{
  "title": {
    "text": "RFC 2310 - The Safe Response Header Field",
    "ja": "RFC 2310 - 安全なレスポンスヘッダーフィールド"
  },
  "number": 2310,
  "created_at": "2019-10-23 01:06:57.335019+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          K. Holtman\nRequest for Comments: 2310                                            TUE\nCategory: Experimental                                         April 1998",
      "raw": true
    },
    {
      "indent": 21,
      "text": "The Safe Response Header Field",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのためにExperimentalプロトコルを定義します。それはどんな種類のインターネット標準を指定しません。改善のための議論や提案が要求されています。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines a HTTP response header field called Safe, which can be used to indicate that repeating a HTTP request is safe. Such an indication will allow user agents to handle retries of some safe requests, in particular safe POST requests, in a more user-friendly way.",
      "ja": "この文書では、HTTPリクエストを繰り返すことは安全であることを示すために使用することができる安全と呼ばれるHTTP応答ヘッダーフィールドを定義します。このような指示は、よりユーザーフレンドリーな方法で、特に安全なPOSTリクエストで、ユーザエージェントは、いくつかの安全な要求の再試行を処理することができます。"
    },
    {
      "indent": 0,
      "text": "1 Introduction",
      "ja": "1はじめに"
    },
    {
      "indent": 3,
      "text": "This document defines a HTTP response header field called Safe, which can be used to indicate that repeating a HTTP request is safe. Such an indication will allow user agents to handle retries of some safe requests, in particular safe POST requests, in a more user-friendly way.",
      "ja": "この文書では、HTTPリクエストを繰り返すことは安全であることを示すために使用することができる安全と呼ばれるHTTP応答ヘッダーフィールドを定義します。このような指示は、よりユーザーフレンドリーな方法で、特に安全なPOSTリクエストで、ユーザエージェントは、いくつかの安全な要求の再試行を処理することができます。"
    },
    {
      "indent": 0,
      "text": "2 Terminology and Notation",
      "ja": "2用語と表記"
    },
    {
      "indent": 3,
      "text": "This document uses the HTTP terminology and BNF notation defined in [1]. It uses the key words in RFC 2119 for defining the significance of each particular requirement.",
      "ja": "この文書では、[1]で定義されたHTTPの用語とBNF表記法を使用します。これは、各々の特定の要件の重要性を定義するためのRFC 2119でキーワードを使用しています。"
    },
    {
      "indent": 0,
      "text": "3 Rationale",
      "ja": "3理由"
    },
    {
      "indent": 3,
      "text": "According to Section 9.1.1 (Safe Methods) of the HTTP/1.1 specification [1], POST requests are assumed to be `unsafe' by default. `Unsafe' means `causes side effects for which the user will be held accountable'.",
      "ja": "HTTP / 1.1仕様書[1]のセクション9.1.1（安全な方法）によると、POSTリクエストは、デフォルトでは `安全でないと仮定されています。 `安全でない「という意味は、 'ユーザが責任を開催されるため、副作用を引き起こします」。"
    },
    {
      "indent": 3,
      "text": "It is sometimes necessary for a user agent to repeat a POST request. Examples of such cases are",
      "ja": "ユーザエージェントはPOSTリクエストを繰り返すことが時々必要です。このような場合の例としては、"
    },
    {
      "indent": 5,
      "text": "- when retrying a POST request which gave an indeterminate error result in the previous attempt - when the user presses the RELOAD button while a POST result is displayed - when the history function is used to redisplay a POST result which is no longer in the history buffer.",
      "ja": " - 場合リトライ以前の試みで、不確定エラー結果が得られたPOSTリクエスト -  POSTの結果が表示されている間に、ユーザがリロードボタンを押下 - ヒストリー機能が履歴バッファでなくなったPOST結果を再表示するために使用され。"
    },
    {
      "indent": 3,
      "text": "If the POST request is unsafe, HTTP requires explicit user confirmation is before the request is repeated. The confirmation dialog often takes the form of a `repost form data?' dialog box. This dialog is confusing to many users, and slows down navigation in any case.",
      "ja": "POSTリクエストが安全でない場合は、HTTP要求が繰り返される前に、明示的なユーザの確認が必要です。確認ダイアログは、多くの場合、 `再投稿フォームデータの形式をとります？」ダイアログボックス。このダイアログには、多くのユーザーに混乱し、そしてどのような場合には、ナビゲーションが遅くなります。"
    },
    {
      "indent": 3,
      "text": "If the repeated POST request is safe, the user-unfriendly confirmation dialog can be omitted. However plain HTTP/1.1 [1] has no mechanism by which agents can tell if POST requests are safe, and they must be assumed unsafe by default. This document adds a mechanism to HTTP, the Safe header field, for telling if a POST request is safe.",
      "ja": "繰り返しPOSTリクエストが安全である場合は、ユーザーが非友好的な確認ダイアログを省略することができます。しかし、プレーンHTTP / 1.1 [1] POSTリクエストが安全である、と彼らは、デフォルトでは安全ではないと仮定しなければならない場合にはエージェントが伝えることが可能なメカニズムを持っていません。この文書では、POSTリクエストが安全かどう伝えるためのHTTPのメカニズム、安全なヘッダフィールドを追加します。"
    },
    {
      "indent": 3,
      "text": "Using the Safe header field, web applications which require the use of a safe POST request, rather than a GET request, for the submission of web forms, can be made more user-friendly. The use of a POST request may be required for a number of reasons, including",
      "ja": "、安全なPOSTリクエストではなく、GETリクエストの使用を必要とするWebアプリケーションを安全なヘッダフィールドを使用して、Webフォームの提出のために、よりユーザーフレンドリーにすることができます。 POSTリクエストの使用には、いくつかの理由で必要とされ得ます"
    },
    {
      "indent": 5,
      "text": "- the contents of the form are potentially very large - the form is used to upload a file (see [2]) - the application needs some internationalization features (see [3]) which are only available if the form contents are transmitted in a request body the information in the form cannot be encoded in a GET request URL because of security considerations.",
      "ja": " - フォームの内容は、潜在的に非常に大きい - フォームは、（[2]参照）ファイルをアップロードするために使用されている - アプリケーションは、フォーム内容がAで送信される場合にのみ使用可能であり、いくつかの国際化機能（[3]参照）が必要リクエストボディは、フォーム内の情報があるため、セキュリティ上の考慮事項のGETリクエストURLでエンコードすることができません。"
    },
    {
      "indent": 0,
      "text": "4 The Safe response header field",
      "ja": "4安全レスポンスヘッダフィールド"
    },
    {
      "indent": 3,
      "text": "The Safe response header field is defined as an addition to the HTTP/1.x protocol suite.",
      "ja": "安全レスポンスヘッダフィールドは、HTTP / 1.1プロトコルスイートに加えとして定義されます。"
    },
    {
      "indent": 3,
      "text": "The Safe response header field is used by origin servers to indicate whether repeating the received HTTP request is safe in the sense of Section 9.1.1 (Safe Methods) of the HTTP/1.1 specification [1]. For the purpose of this specification, a HTTP request is considered to be a repetition of a previous request if both requests",
      "ja": "安全応答ヘッダフィールドは、受信したHTTPリクエストを繰り返すことHTTP / 1.1仕様書[1]のセクション9.1.1（安全な方法）の意味で安全であるかどうかを示すために、オリジンサーバによって使用されます。本明細書の目的のために、HTTPリクエストが両方の要求であれば、前の要求の繰り返しであると考えられています"
    },
    {
      "indent": 5,
      "text": "- are issued by the same user agent, and - apply to the same resource, and - have the same request method, and - both have no request body, or both have request bodies which are byte-wise identical after decoding of any content and transfer codings.",
      "ja": " - 同一のユーザエージェントによって発行され、 - 同じリソースに適用され、そして - 同じリクエストメソッドを有し、 - ないリクエストボディを有していない、あるいはその両方の任意のコンテンツの復号後のバイト単位同一で要求体を有する両方転送コーディング。"
    },
    {
      "indent": 3,
      "text": "The Safe header field has the following syntax.",
      "ja": "安全なヘッダフィールドは、次の構文を持っています。"
    },
    {
      "indent": 5,
      "text": "Safe = \"Safe\" \":\" safe-nature safe-nature = \"yes\" | \"no\"",
      "ja": "「安全=「安全」：」安全な自然、安全・自然=「yes」を| \"番号\""
    },
    {
      "indent": 3,
      "text": "An example of the header field is:",
      "ja": "ヘッダフィールドの例を示します。"
    },
    {
      "indent": 5,
      "text": "Safe: yes",
      "ja": "セーフ：○"
    },
    {
      "indent": 3,
      "text": "If a Safe header field is absent in the response, the corresponding request MUST be considered unsafe, unless it is a GET or HEAD request. As GET and HEAD requests are safe by definition, user agents SHOULD ignore a `Safe: no' header field in GET and HEAD responses.",
      "ja": "安全なヘッダフィールドが応答で存在しない場合、それはGETまたはHEADリクエストでなければ、対応する要求が、安全でないとみなされなければなりません。 GETとHEAD応答には」ヘッダフィールド：GETとHEADリクエストは定義によって安全であるように、ユーザエージェントは `安全を無視してはなりません。"
    },
    {
      "indent": 3,
      "text": "If, according to a received Safe header field, the repeating of a request is safe, the request MAY be repeated automatically without asking for user confirmation.",
      "ja": "、受け取った安全なヘッダフィールドに応じて、要求の繰り返しが安全である場合は、要求は、ユーザの確認を求めずに自動的に繰り返されてもよいです。"
    },
    {
      "indent": 0,
      "text": "5 Security Considerations",
      "ja": "5セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "For a discussion of the security considerations connected to HTTP form submission, see [1]. The Safe header field introduces no new security risks.",
      "ja": "HTTPフォーム提出に接続されたセキュリティ問題の議論については、[1]。安全なヘッダフィールドには、新たなセキュリティリスクを導入していません。"
    },
    {
      "indent": 3,
      "text": "The use of GET requests for form submission has some security risks which are absent for submission with other HTTP methods. By taking away a counter-incentive to the use of GET requests for form submission, the Safe header field may improve overall security.",
      "ja": "フォーム送信のためのGET要求の使用は、他のHTTPメソッドと提出のために存在しないいくつかのセキュリティ上のリスクがあります。フォーム送信のためのGET要求の使用に反対インセンティブを奪うことで、安全なヘッダフィールドは全体のセキュリティを向上させることができます。"
    },
    {
      "indent": 0,
      "text": "6 References",
      "ja": "6つの参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2068, January 1997.",
      "ja": "[1]フィールディング、R.、ゲティス、J.、モーグル、J.、Frystyk、H.、およびT.バーナーズ - リー、 \"ハイパーテキスト転送プロトコル -  HTTP / 1.1\"、RFC 2068、1997年1月。"
    },
    {
      "indent": 3,
      "text": "[2] Nebel, E., and L. Masinter, \"Form-based File Upload in HTML\", RFC 1867, November 1995.",
      "ja": "[2]ネーベル、E.、およびL. Masinter、 \"HTMLでフォームベースのファイルアップロード\"、RFC 1867、1995年11月。"
    },
    {
      "indent": 3,
      "text": "[3] Yergeau, F., Nicol, G., Adams, G., and M. Duerst, \"Internationalization of the Hypertext Markup Language\", RFC 2070, January 1997.",
      "ja": "[3] Yergeau、F.、ニコル、G.アダムス、G、およびM Duerst、 \"ハイパーテキストマークアップ言語の国際化\"、RFC 2070、1997年1月。"
    },
    {
      "indent": 0,
      "text": "7 Author's Address",
      "ja": "7著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Koen Holtman Technische Universiteit Eindhoven Postbus 513 Kamer HG 6.57 5600 MB Eindhoven (The Netherlands)",
      "ja": "技術の公園Holtmanアイントホーフェン大学私書箱513ルームHG 6時57分5600メガバイトアイントホーフェン（オランダ）"
    },
    {
      "indent": 3,
      "text": "EMail: koen@win.tue.nl",
      "ja": "メールアドレス：koen@win.tue.nl"
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}