{
  "title": {
    "text": "RFC 2365 - Administratively Scoped IP Multicast",
    "ja": "RFC 2365 - 管理用スコープのIPマルチキャスト"
  },
  "number": 2365,
  "created_at": "2019-10-23 18:15:52.956588+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           D. Meyer\nRequest for Comments: 2365                          University of Oregon\nBCP: 23                                                        July 1998\nCategory: Best Current Practice",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Administratively Scoped IP Multicast",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントはインターネットコミュニティのためのインターネットBest Current Practicesを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "1. Abstract",
      "section_title": true,
      "ja": "1.要約"
    },
    {
      "indent": 3,
      "text": "This document defines the \"administratively scoped IPv4 multicast space\" to be the range 239.0.0.0 to 239.255.255.255. In addition, it describes a simple set of semantics for the implementation of Administratively Scoped IP Multicast. Finally, it provides a mapping between the IPv6 multicast address classes [RFC1884] and IPv4 multicast address classes.",
      "ja": "この文書では、239.255.255.255の範囲239.0.0.0される「管理スコープIPv4マルチキャスト空間」を定義します。また、管理スコープのIPマルチキャストの実装のためのセマンティクスの簡単なセットを記述する。最後に、IPv6マルチキャストアドレスのクラス[RFC1884]とIPv4マルチキャストアドレスのクラスとの間のマッピングを提供します。"
    },
    {
      "indent": 3,
      "text": "This memo is a product of the MBONE Deployment Working Group (MBONED) in the Operations and Management Area of the Internet Engineering Task Force. Submit comments to <mboned@ns.uoregon.edu> or the author.",
      "ja": "このメモはインターネットエンジニアリングタスクフォースの運用と管理領域におけるMBONE展開ワーキンググループ（MBONED）の製品です。 <mboned@ns.uoregon.edu>や作者へのコメントを提出してください。"
    },
    {
      "indent": 0,
      "text": "2. Acknowledgments",
      "section_title": true,
      "ja": "2.謝辞"
    },
    {
      "indent": 3,
      "text": "Much of this memo is taken from \"Administratively Scoped IP Multicast\", Van Jacobson and Steve Deering, presented at the 30th IETF, Toronto, Canada, 25 July 1994. Steve Casner, Mark Handley and Dave Thaler have also provided insightful comments on earlier versions of this document.",
      "ja": "このメモの多くはから取られている「管理用スコープのIPマルチキャスト」、ヴァン・ヤコブソンとスティーブデアリング、スティーブCasner、マーク・ハンドリーとDaveターラーも以前のバージョンで洞察に満ちたコメントを提供してきた1994年30 IETF、トロント、カナダ、7月25日に発表このドキュメントの。"
    },
    {
      "indent": 0,
      "text": "3. Introduction",
      "section_title": true,
      "ja": "3.はじめに"
    },
    {
      "indent": 3,
      "text": "Most current IP multicast implementations achieve some level of scoping by using the TTL field in the IP header. Typical MBONE (Multicast Backbone) usage has been to engineer TTL thresholds that confine traffic to some administratively defined topological region. The basic forwarding rule for interfaces with configured TTL thresholds is that a packet is not forwarded across the interface unless its remaining TTL is greater than the threshold.",
      "ja": "ほとんどの現在のIPマルチキャスト実装では、IPヘッダ内のTTLフィールドを使用してスコープのいくつかのレベルを達成します。典型的なMBONE（マルチキャストバックボーン）の使用は、いくつかの管理者が定義しトポロジカル地域へのトラフィックを制限TTLしきい値を設計することでした。構成されたTTLしきい値とのインターフェイスのための基本的な転送ルールは、その残りのTTLが閾値よりも大きい場合を除き、パケットがインターフェースを介して転送されないということです。"
    },
    {
      "indent": 3,
      "text": "TTL scoping has been used to control the distribution of multicast traffic with the objective of easing stress on scarce resources (e.g., bandwidth), or to achieve some kind of improved privacy or scaling properties. In addition, the TTL is also used in its traditional role to limit datagram lifetime. Given these often conflicting roles, TTL scoping has proven difficult to implement reliably, and the resulting schemes have often been complex and difficult to understand.",
      "ja": "TTLスコープは、希少資源（例えば、帯域幅）の応力を緩和する目的で、マルチキャストトラフィックの配信を制御するために、または改善されたプライバシーやスケーリングの特性のいくつかの種類を達成するために使用されてきました。また、TTLはまた、データグラムのライフタイムを制限するための伝統的な役割で使用されています。これらしばしば相反する役割を考えると、TTLスコープは確実に実現することは困難であることが証明された、そして得られたスキームは、多くの場合、複雑で理解が困難でした。"
    },
    {
      "indent": 3,
      "text": "A more serious architectural problem concerns the interaction of TTL scoping with broadcast and prune protocols (e.g., DVMRP [DVMRP]). The particular problem is that in many common cases, TTL scoping can prevent pruning from being effective. Consider the case in which a packet has either had its TTL expire or failed a TTL threshold. The router which discards the packet will not be capable of pruning any upstream sources, and thus will sink all multicast traffic (whether or not there are downstream receivers). Note that while it might seem possible to send prunes upstream from the point at which a packet is discarded, this strategy can result in legitimate traffic being discarded, since subsequent packets could take a different path and arrive at the same point with a larger TTL.",
      "ja": "より深刻なアーキテクチャの問題は、ブロードキャスト及びプルーンプロトコルとTTLスコープ（例えば、DVMRP [DVMRP]）との相互作用に関する。特定の問題は、多くの一般的なケースでは、TTLスコープが有効であることからプルーニングを防止することができるということです。パケットは、そのTTLが期限切れに持っていたか、TTLしきい値を失敗したいずれかの場合を考えてみましょう。パケットを破棄するルータは、任意のアップストリームのソースを剪定することができないであろう、したがって、すべてのマルチキャストトラフィックを（下流受信機が存在するか否か）をシンクします。後続のパケットは異なる経路を取り、大きなTTLと同じ点に到達する可能性があるので、それはパケットが廃棄される時点の上流プルーンを送信することが可能と思われるかもしれないが、この戦略は廃棄される正当なトラフィックをもたらすことができることに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "On the other hand, administratively scoped IP multicast can provide clear and simple semantics for scoped IP multicast. The key properties of administratively scoped IP multicast are that (i). packets addressed to administratively scoped multicast addresses do not cross configured administrative boundaries, and (ii). administratively scoped multicast addresses are locally assigned, and hence are not required to be unique across administrative boundaries.",
      "ja": "一方、行政IPマルチキャストは、スコープのIPマルチキャストのための明確かつシンプルなセマンティクスを提供することができますスコープ。管理スコープのIPマルチキャストの重要な性質は、その（I）。パケットは、管理用スコープのマルチキャストアドレスが設定済みの管理境界を横断していないために対処し、および（ii）。管理スコープのマルチキャストアドレスは、ローカルに割り当てられ、ひいては管理境界全体で一意である必要はありません。"
    },
    {
      "indent": 0,
      "text": "4. Definition of the Administratively Scoped IPv4 Multicast Space",
      "section_title": true,
      "ja": "管理スコープIPv4マルチキャストスペースの4の定義"
    },
    {
      "indent": 3,
      "text": "The administratively scoped IPv4 multicast address space is defined to be the range 239.0.0.0 to 239.255.255.255.",
      "ja": "管理スコープIPv4マルチキャストアドレス空間は239.255.255.255までの範囲239.0.0.0であると定義されます。"
    },
    {
      "indent": 0,
      "text": "5. Discussion",
      "section_title": true,
      "ja": "5.ディスカッション"
    },
    {
      "indent": 3,
      "text": "In order to support administratively scoped IP multicast, a router should support the configuration of per-interface scoped IP multicast boundaries. Such a router, called a boundary router, does not forward packets matching an interface's boundary definition in either direction (the bi-directional check prevents problems with multi-access networks). In addition, a boundary router always prunes the boundary for dense-mode groups [PIMDM], and doesn't accept joins for sparse-mode groups [PIMSM] in the administratively scoped range.",
      "ja": "管理上のIPマルチキャストスコープサポートするために、ルータは、インターフェイスの設定はIPマルチキャスト境界をスコープサポートする必要があります。そのようなルータは、境界ルータと呼ばれる、（双方向チェックがマルチアクセスネットワークの問題を防止する）のいずれかの方向にインタフェースの境界の定義に一致するパケットを転送しません。また、境界ルータは常にdenseモードグループ[PIMDM]のための境界を剪定し、受け入れていない管理用スコープ範囲に[PIMSM]希薄モードグループのために参加します。"
    },
    {
      "indent": 0,
      "text": "6. The Structure of the Administratively Scoped Multicast Space",
      "section_title": true,
      "ja": "6.管理スコープマルチキャスト空間の構造"
    },
    {
      "indent": 3,
      "text": "The structure of the IP version 4 administratively scoped multicast space is loosely based on the IP Version 6 Addressing Architecture described in RFC 1884 [RFC1884]. This document defines two important scopes: the IPv4 Local Scope and IPv4 Organization Local Scope. These scopes are described below.",
      "ja": "IPバージョン4管理スコープマルチキャスト空間の構造が緩くRFC 1884 [RFC1884]に記載のIPバージョン6アドレス指定アーキテクチャに基づいています。 IPv4のローカルスコープとIPv4組織ローカルスコープ：この文書では、2つの重要なスコープを定義します。これらのスコープは、以下に記載されています。"
    },
    {
      "indent": 0,
      "text": "6.1. The IPv4 Local Scope -- 239.255.0.0/16",
      "section_title": true,
      "ja": "6.1。 IPv4のローカルスコープ -  239.255.0.0/16"
    },
    {
      "indent": 3,
      "text": "239.255.0.0/16 is defined to be the IPv4 Local Scope. The Local Scope is the minimal enclosing scope, and hence is not further divisible. Although the exact extent of a Local Scope is site dependent, locally scoped regions must obey certain topological constraints. In particular, a Local Scope must not span any other scope boundary. Further, a Local Scope must be completely contained within or equal to any larger scope. In the event that scope regions overlap in area, the area of overlap must be in its own local scope. This implies that any scope boundary is also a boundary for the Local Scope. The more general topological requirements for administratively scoped regions are discussed below.",
      "ja": "239.255.0.0/16は、IPv4のローカルスコープになるように定義されます。ローカルスコープは、最小囲み範囲であるので、さらに割り切れません。ローカルスコープの正確な程度はサイト依存ですが、ローカルスコープ領域は、特定の位相幾何学的制約に従わなければなりません。具体的には、ローカルスコープは他のスコープの境界をまたがってはいけません。さらに、ローカルスコープは完全に内部に含まれるか、または任意のより大きな範囲に等しくなければなりません。スコープ領域が領域に重なった場合には、オーバーラップの領域は、それ自体のローカルスコープ内になければなりません。これは、任意の範囲の境界もローカルスコープのための境界であることを意味します。管理スコープ領域のためのより一般的なトポロジーの要件は、以下に説明します。"
    },
    {
      "indent": 3,
      "text": "6.1.1. Expansion of the IPv4 Local Scope",
      "section_title": true,
      "ja": "6.1.1。 IPv4のローカルスコープの拡大"
    },
    {
      "indent": 3,
      "text": "The IPv4 Local Scope space grows \"downward\". As such, the IPv4 Local Scope may grow downward from 239.255.0.0/16 into the reserved ranges 239.254.0.0/16 and 239.253.0.0/16. However, these ranges should not be utilized until the 239.255.0.0/16 space is no longer sufficient.",
      "ja": "IPv4のローカルスコープのスペースは「下向き」に成長します。このように、IPv4のローカルスコープは、予約範囲239.254.0.0/16と239.253.0.0/16に239.255.0.0/16から下方に成長することができます。 239.255.0.0/16スペースはもはや十分になるまでしかし、これらの範囲は、利用されないべきではありません。"
    },
    {
      "indent": 0,
      "text": "6.2. The IPv4 Organization Local Scope -- 239.192.0.0/14",
      "section_title": true,
      "ja": "6.2。 IPv4の組織ローカルスコープ -  239.192.0.0/14"
    },
    {
      "indent": 3,
      "text": "239.192.0.0/14 is defined to be the IPv4 Organization Local Scope, and is the space from which an organization should allocate sub-ranges when defining scopes for private use.",
      "ja": "239.192.0.0/14は、IPv4の組織ローカルスコープであると定義され、私的使用のためのスコープを定義する際に組織が部分範囲を割り当てる必要があり、そこから空間です。"
    },
    {
      "indent": 0,
      "text": "6.2.1. Expansion of the IPv4 Organization Local Scope",
      "section_title": true,
      "ja": "6.2.1。 IPv4の組織ローカルスコープの拡大"
    },
    {
      "indent": 3,
      "text": "The ranges 239.0.0.0/10, 239.64.0.0/10 and 239.128.0.0/10 are unassigned and available for expansion of this space. These ranges should be left unassigned until the 239.192.0.0/14 space is no longer sufficient. This is to allow for the possibility that future revisions of this document may define additional scopes on a scale larger than organizations.",
      "ja": "範囲239.0.0.0/10、239.64.0.0/10 239.128.0.0/10とは、この空間の拡大のために割り当てられていないと利用できます。 239.192.0.0/14スペースはもはや十分になるまで、これらの範囲は、未割り当てのままにすべきではありません。これは、このドキュメントの将来の改訂は、企業よりも大規模で、追加のスコープを定義する可能性を可能にすることです。"
    },
    {
      "indent": 0,
      "text": "6.3. Other IPv4 Scopes of Interest",
      "section_title": true,
      "ja": "6.3。その他の観光IPv4のスコープ"
    },
    {
      "indent": 3,
      "text": "The other two scope classes of interest, statically assigned link-local scope and global scope already exist in IPv4 multicast space.",
      "ja": "興味のある他の二つの範囲のクラス、静的に割り当てられたリンクローカルスコープおよびグローバルスコープは、すでにIPv4マルチキャスト空間に存在します。"
    },
    {
      "indent": 3,
      "text": "The statically assigned link-local scope is 224.0.0.0/24. The existing static global scope allocations are somewhat more granular, and include",
      "ja": "静的に割り当てられたリンクローカルスコープは224.0.0.0/24です。既存の静的グローバルスコープの割り当ては、幾分より詳細であり、含まれます"
    },
    {
      "indent": 8,
      "text": "224.1.0.0-224.1.255.255         ST Multicast Groups\n224.2.0.0-224.2.127.253         Multimedia Conference Calls\n224.2.127.254                   SAPv1 Announcements\n224.2.127.255                   SAPv0 Announcements (deprecated)\n224.2.128.0-224.2.255.255       SAP Dynamic Assignments\n224.252.0.0-224.255.255.255     DIS transient groups\n232.0.0.0-232.255.255.255       VMTP transient groups",
      "raw": true
    },
    {
      "indent": 3,
      "text": "See [RFC1700] for current multicast address assignments (this list can also be found, possibly in a more current form, on ftp://ftp.isi.edu/in-notes/iana/assignments/multicast-addresses).",
      "ja": "（このリストはまたftp://ftp.isi.edu/in-notes/iana/assignments/multicast-addressesに、おそらくより多くの電流形で見出すことができる）は、現在のマルチキャストアドレス割り当てのために[RFC1700]を参照。"
    },
    {
      "indent": 0,
      "text": "7. Topological Requirements for Administrative Boundaries",
      "section_title": true,
      "ja": "管理境界7.トポロジカル要件"
    },
    {
      "indent": 3,
      "text": "An administratively scoped IP multicast region is defined to be a topological region in which there are one or more boundary routers with common boundary definitions. Such a router is said to be a boundary for scoped addresses in the range defined in its configuration.",
      "ja": "管理IPマルチキャスト領域が共通の境界の定義を有する1つ以上の境界ルータが存在するトポロジー領域であると定義されるスコープ。そのようなルータは、そのコンフィギュレーションで定義された範囲のスコープアドレスの境界であると言われています。"
    },
    {
      "indent": 3,
      "text": "Network administrators may configure a scope region whenever constrained multicast scope is required. In addition, an administrator may configure overlapping scope regions (networks can be in multiple scope regions) where convenient, with the only limitations being that a scope region must be connected (there must be a path between any two nodes within a scope region that doesn't leave that region), and convex (i.e., no path between any two points in the region can cross a region boundary). However, it is important to note that if administratively scoped areas intersect topologically, then the outer scope must consist of its address space minus the address spaces of any intersecting scopes. This requirement prevents the problem that would arise when a path between two points in a convex region crosses the boundary of an intersecting region. For this reason, it is recommended that administrative scopes that intersect topologically should not intersect in address range.",
      "ja": "制約されたマルチキャストスコープが必要とされるたびに、ネットワーク管理者は、スコープ領域を構成することができます。また、管理者は、（doesnの有効範囲領域内の任意の2つのノード間の経路が存在しなければならない場合に便利のみ制限はスコープ領域が接続されなければならないことであると、（ネットワークが複数のスコープ領域であることができる）範囲の重複領域設定できます「t）は、その領域を離れ、凸（すなわち、領域内の任意の2点間の経路が領域境界を越えることができません）。しかし、管理用スコープの領域が位相幾何学的に交差する場合、その外側のスコープは、そのアドレス空間を引い任意の交差スコープのアドレス空間から構成されなければならないことに注意することが重要です。この要件は、凸部の2点間の経路が交差する領域の境界を横切るときに生じるであろう問題を防止します。このため、位相幾何学的に交差し、管理スコープがアドレス範囲で交差してはならないことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Finally, note that any scope boundary is a boundary for the Local Scope. This implies that packets sent to groups covered by 239.255.0.0/16 must not be forwarded across any link for which a scoped boundary is defined.",
      "ja": "最後に、任意の範囲の境界はローカルスコープの境界であることに注意してください。これは239.255.0.0/16でカバーグループに送信されたパケットは、スコープの境界が定義されている任意のリンクを介して転送されてはならないことを意味します。"
    },
    {
      "indent": 0,
      "text": "8. Partitioning of the Administratively Scoped Multicast Space",
      "section_title": true,
      "ja": "管理スコープマルチキャストスペースの8パーティショニング"
    },
    {
      "indent": 3,
      "text": "The following table outlines the partitioning of the IPv4 multicast space, and gives the mapping from IPv4 multicast prefixes to IPv6 SCOP values:",
      "ja": "次の表は、IPv4マルチキャスト空間のパーティショニングの概要を示し、およびIPv6 SCOP値にIPv4マルチキャストプレフィックスのマッピングを与えます。"
    },
    {
      "indent": 3,
      "text": "IPv6 SCOP  RFC 1884 Description             IPv4 Prefix\n===============================================================\n0          reserved\n1          node-local scope\n2          link-local scope             224.0.0.0/24\n3          (unassigned)                 239.255.0.0/16\n4          (unassigned)\n5          site-local scope\n6          (unassigned)\n7          (unassigned)\n8          organization-local scope     239.192.0.0/14\nA          (unassigned)\nB          (unassigned)\nC          (unassigned)\nD          (unassigned)\nE          global scope                 224.0.1.0-238.255.255.255\nF          reserved\n           (unassigned)                 239.0.0.0/10\n           (unassigned)                 239.64.0.0/10\n           (unassigned)                 239.128.0.0/10",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9. Structure and Use of a Scoped Region",
      "section_title": true,
      "ja": "9.構造とスコープの地域の利用"
    },
    {
      "indent": 3,
      "text": "The high order /24 in every scoped region is reserved for relative assignments. A relative assignment is an integer offset from highest address in the scope and represents a 32-bit address (for IPv4). For example, in the Local Scope defined above, 239.255.255.0/24 is reserved for relative allocations. The de-facto relative assignment \"0\", (i.e., 239.255.255.255 in the Local Scope) currently exists for SAP [SAP]. The next relative assignment, \"1\", corresponds to the address 239.255.255.254 in the Local Scope. The rest of a scoped region below the reserved /24 is available for dynamic assignment (presumably by an address allocation protocol).",
      "ja": "すべてのスコープ領域における高次/ 24は、相対的な割り当てのために予約されています。相対的な割り当ては、スコープ内の最上位アドレスからのオフセット整数であり、（IPv4の）32ビットのアドレスを表します。例えば、上記で定義されたローカルスコープにおいて、239.255.255.0/24は相対割り当て用に予約されています。事実上の相対的な割り当ては、「0」は、（すなわち、ローカルスコープ内239.255.255.255）は、現在SAP [SAP]の必要性が存在します。次の相対的な割り当ては、「1」は、ローカルスコープ内のアドレス239.255.255.254に相当します。予約/ 24以下スコープ領域の残りの部分は、（おそらくアドレス割当プロトコルによって）動的割当てのために利用可能です。"
    },
    {
      "indent": 3,
      "text": "In is important to note that a scope discovery protocol [MZAP] will have to be developed to make practical use of scopes other than the Local Scope. In addition, since any use of any administratively scoped region, including the Local Scope, requires dynamically assigned addressing, an Address Allocation Protocol (AAP) will need to be developed to make administrative scoping generally useful.",
      "ja": "中には、スコープ・ディスカバリ・プロトコルは[MZAP]ローカルスコープ以外のスコープを実際に利用するために開発されなければならないことに注意することが重要です。また、ローカルスコープを含む任意の管理用スコープの地域のいずれかの使用、以来、動的に割り当てられたアドレス指定する必要が、アドレス割り当てプロトコル（AAP）は、管理スコープは、一般的に有用なものにするために開発する必要があります。"
    },
    {
      "indent": 0,
      "text": "9.1. Relative Assignment Guidelines",
      "section_title": true,
      "ja": "9.1。相対的な割り当てのガイドライン"
    },
    {
      "indent": 3,
      "text": "Requests for relative assignments should be directed to the IANA. The IANA will be advised by an area expert when making relative address assignments. The area expert will be appointed by the relevant Area Director.",
      "ja": "相対的な割り当ての要求はIANAに向けられるべき。相対アドレスの割り当てを行うときにIANAは、地域の専門家の助言されます。地域の専門家は、関連するエリアディレクターによって任命されます。"
    },
    {
      "indent": 3,
      "text": "In general, relative addresses will be used only for bootstrapping to dynamic address assignments from within the scope. As such, relative assignments should only be made to those services that cannot use a dynamic address assignment protocol to find the address used by that service within the desired scope, such as a dynamic address assignment service itself.",
      "ja": "一般的に、相対アドレスは、範囲内から動的アドレスの割り当てをブートストラップするために使用されます。このように、相対的な割り当ては、動的なアドレス割り当てサービス自体として、所望の範囲内に、そのサービスによって使用されるアドレスを見つけるために、動的アドレス割り当てプロトコルを使用することができないそれらのサービスに対してなされるべきです。"
    },
    {
      "indent": 3,
      "text": "10. Security Considerations",
      "section_title": true,
      "ja": "10.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "It is recommended that organizations using the administratively scoped IP Multicast addresses not rely on them to prevent sensitive data from being transmitted outside the organization. Should a multicast router on an administrative boundary be mis-configured, have a bug in the administrative scoping code, or have other problems that would cause that router to forward an administratively scoped IP multicast packet outside of the proper scope, the organizations data would leave its intended transmission region.",
      "ja": "組織が管理IPマルチキャストは、組織外部に送信されることから機密データを防ぐためにそれらに依存しないアドレススコープを使用してことをお勧めします。管理境界上のマルチキャストルータは、誤設定する必要があり、管理スコープのコードのバグを持っている、またはそのルータが管理上適切な範囲の外でIPマルチキャストパケットをスコープに転送させるような他の問題を抱えている、組織のデータを残してしまいますその意図した透過領域。"
    },
    {
      "indent": 3,
      "text": "Organizations using administratively scoped IP Multicasting to transmit sensitive data should use some confidentiality mechanism (e.g. encryption) to protect that data. In the case of many existing video-conferencing applications (e.g. vat), encryption is available as an application feature and merely needs to be enabled (and appropriate cryptographic keys securely distributed). For many other applications, the use of the IP Encapsulating Security Payload (ESP) [RFC-1825, RFC-1827] can provide IP-layer confidentiality though encryption.",
      "ja": "機密データを送信するために、管理スコープのIPマルチキャストを使用している組織は、そのデータを保護するために、いくつかの機密性のメカニズム（例えば、暗号化）を使用する必要があります。多くの既存のビデオ会議アプリケーション（例えばバット）の場合には、暗号化は、アプリケーション機能として利用可能であり、単に（及び適切な暗号鍵を安全に分散）を有効にする必要があります。他の多くのアプリケーションでは、IPカプセル化セキュリティペイロード（ESP）[RFC-1825、RFC-1827]の使用は、暗号化もののIP層の機密性を提供することができます。"
    },
    {
      "indent": 3,
      "text": "Within the context of an administratively scoped IP multicast group, the use of manual key distribution might well be feasible. While dynamic key management for IP Security is a research area at the time this note is written, it is expected that the IETF will be extending the ISAKMP key management protocol to support scalable multicast key distribution in the future.",
      "ja": "管理スコープのIPマルチキャストグループの文脈の中で、手動鍵配布を使用することは十分に可能であるかもしれません。 IPセキュリティのための動的なキー管理は、このノートが書かれている時点での研究領域であるが、IETFが将来的にスケーラブルマルチキャスト鍵配布をサポートするために、ISAKMP鍵管理プロトコルを拡張することが期待されます。"
    },
    {
      "indent": 3,
      "text": "It is important to note that the \"boundary router\" described in this note is not necessarily providing any kind of firewall capability.",
      "ja": "このノートに記載された「境界ルータは」必ずしもファイアウォール機能のいずれかの種類を提供していないことに注意することが重要です。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 3,
      "text": "[ASMA] V. Jacobson, S. Deering, \"Administratively Scoped IP Multicast\", presented at the 30th IETF, Toronto, Canada, 25 July 1994.",
      "ja": "[ASMA] V.ジェーコブソン、S.デアリングは、30日IETF、トロント、カナダ、1994年7月25日に発表、 \"行政IPマルチキャストスコープ\"。"
    },
    {
      "indent": 3,
      "text": "[DVMRP] Pusateri, T., \"Distance Vector Multicast Routing Protocol\", Work in Progress.",
      "ja": "[DVMRP] Pusateri、T.、 \"距離ベクトルマルチキャストルーティングプロトコル\" が進行中で働いています。"
    },
    {
      "indent": 3,
      "text": "[MZAP] Handley, M., \"Multicast-Scope Zone Announcement Protocol (MZAP)\", Work in Progress.",
      "ja": "【MZAP]ハンドレー、M.、 \"マルチキャストスコープゾーン発表プロトコル（MZAP）\"、ProgressのWork。"
    },
    {
      "indent": 3,
      "text": "[PIMDM] Deering, S, et. al., \"Protocol Independent Multicast Version 2, Dense Mode Specification\", Work in Progress.",
      "ja": "【PIMDM]デアリング、S、ら。ら、「プロトコル独立マルチキャストバージョン2、稠密モードの仕様」が進行中で働いています。"
    },
    {
      "indent": 3,
      "text": "[PIMSM] Estrin, D., Farinacci, D., Helmy, A., Thaler, D., Deering, S., Handley, M., Jacobson, V., Liu, C., Sharma, P., and L. Wei, \"Protocol Independent Multicast Sparse Mode (PIM-SM): Protocol Specification\", RFC 2362, June 1998.",
      "ja": "【PIMSM] Estrin、D.、ファリナッチ、D.、Helmy、A.、ターラー、D.、デアリング、S.、ハンドレー、M.、ヤコブソン、V.、劉、C.、シャルマ、P.、およびL 。魏、 \"プロトコル独立マルチキャストスパースモード（PIM-SM）：プロトコル仕様\"、RFC 2362、1998年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC1700] Reynolds, J., and J. Postel, \"Assigned Numbers\", STD 2, RFC 1700, October 1994.",
      "ja": "[RFC1700]レイノルズ、J.、およびJ.ポステル、 \"割り当て番号\"、STD 2、RFC 1700、1994年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1884] Hinden. R., and S. Deering, \"IP Version 6 Addressing Architecture\", RFC1884, December 1995.",
      "ja": "[RFC1884] Hindenと。 R.、およびS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC1884、1995年12月。"
    },
    {
      "indent": 3,
      "text": "[SAP] Handley, M., \"SAP: Session Announcement Protocol\", Work in Progress.",
      "ja": "[SAP]ハンドリー、M.、 \"SAP：セッションアナウンスメントプロトコル\" が進行中で働いています。"
    },
    {
      "indent": 0,
      "text": "12. Author's Address",
      "section_title": true,
      "ja": "12.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "David Meyer Cisco Systems San Jose, CA",
      "ja": "デビッド・マイヤーシスコシステムズサンノゼ、CA"
    },
    {
      "indent": 3,
      "text": "EMail: dmm@cisco.com",
      "ja": "メールアドレス：dmm@cisco.com"
    },
    {
      "indent": 0,
      "text": "13. Full Copyright Statement",
      "section_title": true,
      "ja": "13.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}