{
  "title": {
    "text": "RFC 6612 - Interactions between Proxy Mobile IPv6 (PMIPv6) and Mobile IPv6 (MIPv6): Scenarios and Related Issues",
    "ja": "RFC 6612 - シナリオと関連問題：プロキシモバイルIPv6（PMIPv6の）およびモバイルIPv6（MIPv6の）間の相互作用"
  },
  "number": 6612,
  "created_at": "2019-10-28 07:28:54.861159+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                  G. Giaretta, Ed.\nRequest for Comments: 6612                                      Qualcomm\nCategory: Informational                                         May 2012\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Interactions between Proxy Mobile IPv6 (PMIPv6) and Mobile IPv6 (MIPv6): Scenarios and Related Issues",
      "ja": "シナリオと関連問題：プロキシモバイルIPv6（PMIPv6の）およびモバイルIPv6（MIPv6の）間の相互作用"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The use of Proxy Mobile IPv6 (PMIPv6) and Mobile IPv6 (MIPv6) in the same network requires some care. This document discusses scenarios where such mixed usage is appropriate and points out the need for interaction between the two mechanisms. Solutions and recommendations to enable these scenarios are also described.",
      "ja": "同じネットワーク内のプロキシモバイルIPv6（PMIPv6の）およびモバイルIPv6（MIPv6の）の使用は、いくつかの注意が必要です。この文書では、このような混合使用が適切であるシナリオを説明し、二つのメカニズムとの間の相互作用の必要性を指摘しています。ソリューションおよびこれらのシナリオを可能にするための推奨も記述されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6612.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6612で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 3,
      "text": "This document may contain material from IETF Documents or IETF Contributions published or made publicly available before November 10, 2008. The person(s) controlling the copyright in some of this material may not have granted the IETF Trust the right to allow modifications of such material outside the IETF Standards Process. Without obtaining an adequate license from the person(s) controlling the copyright in such materials, this document may not be modified outside the IETF Standards Process, and derivative works of it may not be created outside the IETF Standards Process, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "この材料の一部がIETFトラストにこのような材料の変更を許可する権利を与えられていない可能性がありますにこの文書は、2008年、IETFドキュメントまたは11月10日以前に発行または公開さIETF貢献から著作権を支配する者（複数可）材料を含んでいてもよいですIETF標準化プロセスの外。そのような材料の著作権を管理者（単数または複数）から適切なライセンスを取得することなく、この文書は、IETF標準化過程の外側修正されないかもしれません、そして、それの派生物は、IETF標準化過程の外側に作成されない場合があり、それをフォーマットする以外出版RFCとして、英語以外の言語に翻訳します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................3\n3. Overview of the Scenarios and Related Issues ....................4\n   3.1. Issues Related to Scenario A.1 .............................8\n   3.2. Issues Related to Scenario A.2 .............................8\n   3.3. Issues Related to Scenario B ..............................10\n4. Analysis of Possible Solutions .................................11\n   4.1. Solutions Related to Scenario A.1 .........................11\n   4.2. Solutions Related to Scenario A.2 .........................13\n        4.2.1. Mobility from a PMIPv6 Domain to a\n               Non-PMIPv6 Domain ..................................14\n        4.2.2. Mobility from a Non-PMIPv6 Domain to a\n               PMIPv6 Domain ......................................15\n   4.3. Solutions Related to Scenario B ...........................15\n5. Security Considerations ........................................16\n6. Contributors ...................................................16\n7. Acknowledgements ...............................................16\n8. References .....................................................17\n   8.1. Normative References ......................................17\n   8.2. Informative References ....................................17",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Proxy Mobile IPv6 (PMIPv6) [RFC5213] is a network-based IP mobility protocol standardized by the IETF. In some deployment scenarios, this protocol will be deployed together with Mobile IPv6 (MIPv6) [RFC6275], for example, with PMIPv6 as local mobility protocol and MIPv6 as global mobility protocol. While the usage of a local mobility protocol should not have implications on how global mobility is managed, since PMIPv6 is partially based on MIPv6 signaling and data structure, some considerations are needed to understand how the protocols interact and how the different scenarios can be enabled.",
      "ja": "プロキシモバイルIPv6（PMIPv6の）[RFC5213]はIETFによって標準化されたネットワークベースのIPモビリティプロトコルです。いくつかの展開シナリオでは、このプロトコルは、グローバルモビリティプロトコルなどのローカルモビリティプロトコルとのMIPv6などのPMIPv6と、例えば、モバイルIPv6（MIPv6の）[RFC6275]と一緒にデプロイされます。ローカルモビリティプロトコルの使用をどのように管理するかをグローバル移動度に影響を持つべきではないものののPMIPv6が部分的にMIPv6のシグナリングやデータ構造に基づいているため、いくつかの考慮事項が異なるシナリオを有効にすることができますどのようなプロトコルが相互に作用し、どのように理解することが必要とされています。"
    },
    {
      "indent": 3,
      "text": "Some standardization fora are also investigating more complex scenarios where the mobility of some nodes is handled using Proxy Mobile IPv6, while other nodes use Mobile IPv6; or the mobility of a node is managed in turn by a host-based and a network-based mechanism. This also needs to be analyzed as a possible deployment scenario.",
      "ja": "いくつかの標準化フォーラムは、他のノードはモバイルIPv6を使用しながら、いくつかのノードの移動度はプロキシモバイルIPv6を使用して処理される、より複雑なシナリオを検討しています。またはノードの移動度は、ホストベースおよびネットワークベースのメカニズムによって順番に管理されています。また、これは可能展開シナリオとして分析する必要があります。"
    },
    {
      "indent": 3,
      "text": "This document provides a taxonomy of the most common scenarios that require direct interaction between MIPv6 and PMIPv6. The list is not meant to be exhaustive. Moreover, this document presents and identifies most of the issues pertaining to these scenarios and discusses possible means and mechanisms that are recommended to enable them.",
      "ja": "この文書では、MIPv6のとPMIPv6の間の直接的な相互作用を必要とする最も一般的なシナリオの分類法を提供します。このリストは網羅的であることを意味するものではありません。また、この文書では提示して、これらのシナリオに関連する問題のほとんどを識別し、それらを有効にすることを推奨している可能な手段とメカニズムについて説明します。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "General mobility terminology can be found in [RFC3753]. The following acronyms are used in this document:",
      "ja": "一般的なモビリティの用語は、[RFC3753]で見つけることができます。以下の頭字語は、本書で使用されています。"
    },
    {
      "indent": 3,
      "text": "o AR (Access Router): first hop router",
      "ja": "O AR（アクセスルータ）：最初のホップルータ"
    },
    {
      "indent": 3,
      "text": "o BCE (Binding Cache Entry): an entry of the MIPv6 or PMIPv6 binding cache",
      "ja": "O BCE（キャッシュ・エントリ結合）のMIPv6又はPMIPv6のバインディングキャッシュのエントリ"
    },
    {
      "indent": 3,
      "text": "o LMA (Local Mobility Anchor): the PMIPv6 mobility anchor as specified in [RFC5213]",
      "ja": "[RFC5213]で指定されているようにPMIPv6モビリティアンカー：LMA（ローカルモビリティアンカー）O"
    },
    {
      "indent": 3,
      "text": "o MAG (Mobility Access Gateway): the PMIPv6 client as specified in [RFC5213]",
      "ja": "O MAG（モビリティアクセスゲートウェイ）：[RFC5213]で指定されるようにPMIPv6クライアント"
    },
    {
      "indent": 3,
      "text": "o MN-HoA: the Home Address (HoA) of a Mobile Node (MN) in a PMIPv6 domain",
      "ja": "MN-HoAをO：のPMIPv6ドメインにおけるモバイルノード（MN）のホームアドレス（HoA）"
    },
    {
      "indent": 3,
      "text": "o MN-HNP: the IPv6 prefix that is always present in the Router Advertisements that the MN receives when it is attached to any of the access links in that PMIPv6 domain (MN-HoA always belongs to this prefix.)",
      "ja": "それはそのPMIPv6ドメインにおけるアクセスリンクのいずれかに結合されたときにMNが受信するルータ広告に常に存在しているIPv6プレフィックス（MN-HoAでは、常にこのプレフィックスに属しています。）：MN-HNP O"
    },
    {
      "indent": 3,
      "text": "o MIPv6-HoA: the HoA the MN includes in MIPv6 Binding Update messages",
      "ja": "O MIPv6の-のHoA：HoAをMNは、Binding UpdateメッセージのMIPv6に含まれます"
    },
    {
      "indent": 3,
      "text": "o MIPv6-CoA: the Care-of Address the MN includes in MIPv6 Binding Update messages",
      "ja": "O MIPv6の-CoAが：気付アドレスのMNは、Binding UpdateメッセージのMIPv6に含まれます"
    },
    {
      "indent": 0,
      "text": "3. Overview of the Scenarios and Related Issues",
      "section_title": true,
      "ja": "シナリオおよび関連問題の概要3。"
    },
    {
      "indent": 3,
      "text": "Several scenarios can be identified where MIPv6 and PMIPv6 are deployed in the same network. This document not only focuses on scenarios where the two protocols are used by the same MN to manage local and global mobility but also investigates more complex scenarios where the protocols are more tightly integrated or where there is a coexistence of nodes that do or do not implement MIPv6.",
      "ja": "MIPv6のとのPMIPv6が同じネットワーク内に展開されている場合、いくつかのシナリオを特定することができます。この文書では、2つのプロトコルは、ローカルおよびグローバルモビリティを管理するために、同じMNによって使用されているシナリオに焦点を当てただけでなく、プロトコルがより緊密に統合されるか、または存在しないノードの共存があるか実装していないされ、より複雑なシナリオを調査するだけでなくMIPv6の。"
    },
    {
      "indent": 3,
      "text": "In particular, the scenario space can be split into hierarchical deployments and alternative deployments of Mobile IP (MIP) and Proxy Mobile IP (PMIP). Hierarchical deployments are scenarios where the two mobility protocols are used in the same network in a hierarchical manner for global and local mobility management. Alternative deployments are scenarios where only one of the two protocols is used for mobility management of a given MN.",
      "ja": "具体的には、シナリオの空間は、階層展開とモバイルIP（MIP）及びプロキシモバイルIP（PMIP）の別の展開に分割することができます。階層的な展開では2つのモビリティプロトコルは、グローバルとローカルモビリティ管理のための階層的に同じネットワーク内で使用されているシナリオです。代替の展開は、2つのプロトコルの一つだけが与えられたのMNのモビリティ管理のために使用されているシナリオです。"
    },
    {
      "indent": 3,
      "text": "The following hierarchical scenarios are identified:",
      "ja": "以下の階層的なシナリオが識別されます。"
    },
    {
      "indent": 3,
      "text": "Scenario A.1: In this scenario, PMIPv6 is used as a network-based local mobility management protocol whereas MIPv6 is used as a global mobility management protocol. This interaction is very similar to the interaction between Hierarchical Mobile IPv6 (HMIPv6) and MIPv6 [RFC5380]; MIPv6 is used to manage mobility among different access networks, while the mobility within the access network is handled by PMIPv6. The address managed by PMIPv6 (i.e., the MN-HoA) is registered as the Care-of Address by the MN at the Home Agent (HA). This means that the HA has a BCE for MIPv6-HoA that points to the MN-HoA.",
      "ja": "シナリオA.1：このシナリオでは、PMIPv6のは、MIPv6のグローバルモビリティ管理プロトコルとして使用されるのに対し、ネットワーク・ベースのローカル・モビリティ管理プロトコルとして使用されます。この相互作用は、階層化モバイルIPv6（HMIPv6の）とMIPv6の[RFC5380]との間の相互作用に非常に似ています。アクセスネットワーク内のモビリティをのPMIPv6によって処理されている間のMIPv6は、異なるアクセスネットワーク間のモビリティを管理するために使用されます。 PMIPv6（すなわち、MN-HoAを）によって管理されるアドレスは、ホームエージェント（HA）でMNによって気付アドレスとして登録されています。これは、HAは、MN-HoAを指すのMIPv6-のHoAのためのBCEを有することを意味します。"
    },
    {
      "indent": 3,
      "text": "The following figure illustrates this scenario.",
      "ja": "次の図は、このシナリオを示しています。"
    },
    {
      "indent": 4,
      "text": "                       +----+\n                       | HA |  MIPv6-HoA -> MN-HoA\n                       +----+\n                         /\\\n                        /  \\\n         +-------------/----\\--------------+\n        (             /      \\              ) Global Mobile IPv6\n        (            /        \\             ) Domain\n         +----------/----------\\-----------+\n                   /            \\\n                +----+         +----+\nMN-HoA -> MAG1  |LMA1|         |LMA2|\n                +----+         +----+\n                 //\\\\             \\\\\n           +----//--\\\\---+   +-----\\\\------+\n          (    //    \\\\   ) (       \\\\      ) Local Mobility Network\n          (   //      \\\\  ) (        \\\\     ) PMIPv6 domain\n           +-//--------\\\\+   +--------\\\\---+\n            //          \\\\             \\\\\n           //            \\\\             \\\\\n          //              \\\\             \\\\\n       +----+           +----+         +----+\n       |MAG1|           |MAG2|         |MAG3|\n       +----+           +----+         +----+\n         |                |              |\n        [MN]",
      "raw": true
    },
    {
      "indent": 26,
      "text": "Figure 1: Scenario A.1",
      "ja": "図1：シナリオA.1"
    },
    {
      "indent": 3,
      "text": "Scenario A.2: In this scenario, the MN is moving across different access networks, some of them supporting PMIPv6 and some others not supporting it. Therefore, the MN is roaming from an access network where the mobility is managed through a network-based solution to an access network where a host-based management (i.e., Mobile IPv6) is needed. This scenario may have different sub-scenarios depending on the relations between the MIPv6 home network and the PMIPv6 domain. The following figure illustrates an example of this scenario, where the MN is moving from an access network where PMIPv6 is supported (i.e., MAG functionality is supported) to a network where PMIPv6 is not supported (i.e., MAG functionality is not supported by the AR). This implies that the home link of the MN is actually a PMIPv6 domain. In this case, the MIPv6-HoA is equal to the MN-HoA (i.e., the address managed by PMIPv6).",
      "ja": "シナリオA.2：このシナリオでは、MNは、それらのいくつかはのPMIPv6をサポートし、いくつか他の人がそれをサポートしていない、異なるアクセスネットワークを横切って移動されます。したがって、MNは、モビリティは、ホストベースの管理（すなわち、モバイルIPv6）が必要とされるアクセスネットワークへのネットワーク・ベースのソリューションを介して管理されているアクセスネットワークからローミングしています。このシナリオでは、MIPv6のホームネットワークとPMIPv6ドメイン間の関係に応じて、異なるサブシナリオを有することができます。次の図は、（すなわち、MAGの機能はARによってサポートされていないMNはのPMIPv6がサポートされていないネットワークへのPMIPv6がサポートされているアクセスネットワーク（すなわち、MAGの機能がサポートされている）から移動してこのシナリオの一例を示す図）。これは、MNのホームリンクは、実際にPMIPv6ドメインであることを意味します。この場合には、MIPv6の-HoAがMN-HoAを（すなわち、アドレスのPMIPv6によって管理される）に等しいです。"
    },
    {
      "indent": 23,
      "text": "  MIPv6-HoA == MN-HoA -> MAG1\n        +------+\n        |HA/LMA|-----------------------+\n        +------+                       |\n          //\\\\                         |\n +-------//--\\\\--------+               |\n(       //    \\\\ PMIPv6 )              |\n(      //      \\\\ domain)       +--------------+\n +----//--------\\\\-----+       (   Non-PMIPv6   )\n     //          \\\\            (   domain       )\n    //            \\\\            +--------------+\n   //              \\\\                  |\n+----+           +----+              +----+\n|MAG1|           |MAG2|              | AR |\n+----+           +----+              +----+\n  |                |                   |\n [MN]",
      "raw": true
    },
    {
      "indent": 26,
      "text": "Figure 2: Scenario A.2",
      "ja": "図2：シナリオA.2"
    },
    {
      "indent": 3,
      "text": "In the scenario illustrated in Figure 2, the non-PMIPv6 domain can actually also be a different PMIPv6 domain that handles a different MN_HoA. The following figure illustrates this sub-case: the MIPv6- HoA is equal to the MN_HoA; however, when the MN hands over to MAG3, it gets a different IP address (managed by LMA2 using PMIPv6) and registers it as a MIPv6 CoA.",
      "ja": "図2に示されているシナリオでは、非PMIPv6ドメインは、実際には、異なるMN_HoAを扱う異なるPMIPv6ドメインであることができます。次の図は、このサブケースを示す：MIPv6- HoAがMN_HoAに等しいです。しかし、MNの手がオーバーMAG3に、それは（のPMIPv6を使用してLMA2によって管理される）異なるIPアドレスを取得し、MIPv6のCoAとして登録するとき。"
    },
    {
      "indent": 13,
      "text": "  MIPv6-HoA == MN-HoA -> MAG_1\n        +-------+\n        |HA/LMA1|-----------------------+\n        +-------+                       |\n          //\\\\                       +----+\n +-------//--\\\\--------+             |LMA2|\n(       //    \\\\  home  )            +----+\n(      //      \\\\ PMIPv6)       +------||------+\n(     //        \\\\domain)      (       ||visited)\n +---//----------\\\\----+       (       ||PMIPv6 )\n    //            \\\\           (       ||domain )\n   //              \\\\           +------||------+\n+----+           +----+              +----+\n|MAG1|           |MAG2|              |MAG3|\n+----+           +----+              +----+\n  |                |                   |\n [MN]",
      "raw": true
    },
    {
      "indent": 31,
      "text": "(a)",
      "ja": "（A）"
    },
    {
      "indent": 13,
      "text": " MIPv6-HoA -> MN_CoA\n        +-------+\n        |HA/LMA1|-----------------------+\n        +-------+                       |\n          //\\\\                       +----+\n +-------//--\\\\--------+             |LMA2|  MN_CoA -> MAG3\n(       //    \\\\  home  )            +----+\n(      //      \\\\ PMIPv6)       +------||------+\n(     //        \\\\domain)      (       ||visited)\n +---//----------\\\\----+       (       ||PMIPv6 )\n    //            \\\\           (       ||domain )\n   //              \\\\           +------||------+\n+----+           +----+              +----+\n|MAG1|           |MAG2|              |MAG3|\n+----+           +----+              +----+\n  |                |                   |\n                                      [MN]",
      "raw": true
    },
    {
      "indent": 32,
      "text": "(b)",
      "ja": "（B）"
    },
    {
      "indent": 13,
      "text": "Figure 3: Scenario A.2 with Visited PMIPv6 Domain",
      "ja": "図3：訪問のPMIPv6ドメインとのシナリオA.2"
    },
    {
      "indent": 3,
      "text": "The following alternative deployment has been identified:",
      "ja": "次の代替展開が同定されています。"
    },
    {
      "indent": 3,
      "text": "Scenario B: In this scenario, some MNs use MIPv6 to manage their\nmovements while others rely on a network-based mobility solution\nprovided by the network as they don't support Mobile IPv6.  There may be a common mobility anchor that acts as MIPv6 Home Agent and PMIPv6\nLMA, depending on the type of the node as depicted in the figure.\nHowever, the LMA and HA can also be separated, and this has no impact\non the mobility of the nodes.\n                                  +--------+\n                                  | HA/LMA |\n                                  +--------+",
      "raw": true
    },
    {
      "indent": 16,
      "text": "+------+                              +------+\n| MAG1 |                              | MAG2 |\n+------+                              +------+",
      "raw": true
    },
    {
      "indent": 24,
      "text": "   +-----------+\n   | IPv6 host |   ----------------->\n   +-----------+       movement\n+----------+\n| MIPv6 MN |  ----------------->\n+----------+       movement",
      "raw": true
    },
    {
      "indent": 27,
      "text": "Figure 4: Scenario B",
      "ja": "図4：シナリオB"
    },
    {
      "indent": 3,
      "text": "Note that some of the scenarios can be combined. For instance, Scenario B can be combined with Scenario A.1 or Scenario A.2.",
      "ja": "シナリオの一部を組み合わせることが可能です。例えば、シナリオBは、シナリオA.1またはA.2シナリオと組み合わせることができます。"
    },
    {
      "indent": 3,
      "text": "The following sections describe some possible issues for each scenario. Respective recommendations are described in Section 4.3. The specifications considered as a baseline for the analysis are the following: [RFC6275], [RFC4877], and [RFC5213].",
      "ja": "次のセクションでは、各シナリオのためにいくつかの可能性のある問題について説明します。それぞれの勧告は、セクション4.3で説明されています。 [RFC6275]、[RFC4877]及び[RFC5213]：分析のためのベースラインとして考慮仕様は以下の通りです。"
    },
    {
      "indent": 0,
      "text": "3.1. Issues Related to Scenario A.1",
      "section_title": true,
      "ja": "3.1。シナリオA.1に関連する問題"
    },
    {
      "indent": 3,
      "text": "This scenario is very similar to other hierarchical mobility schemes, including an HMIPv6-MIPv6 scheme. No issues have been identified in this scenario. Note that a race condition where the MN registers the CoA at the HA before the CoA is actually bound to the MAG at the LMA is not possible. The reason is that per the PMIPv6 specification [RFC5213], the MAG does not forward any packets sent by the MN until the PMIPv6 tunnel is up, regardless the mechanism used for address allocation.",
      "ja": "このシナリオは、HMIPv6の-MIPv6の方式を含む他の階層的なモビリティスキーム、と非常によく似ています。いいえ問題は、このシナリオでは同定されていません。アシルCoAが実際にLMAでMAGにバインドされる前に、MNがHAにCoAを登録する競合状態ができないことに注意してください。その理由は、のPMIPv6トンネルが起動するまでのPMIPv6仕様[RFC5213]あたり、MAGは、MNによって送信されたパケットを転送しないことを、アドレス割り当てに使用されるメカニズムにかかわらずです。"
    },
    {
      "indent": 3,
      "text": "Section 4.1 describes one message flow in case PMIPv6 is used as a local mobility protocol and MIPv6 is used as a global mobility protocol.",
      "ja": "セクション4.1のPMIPv6がローカルモビリティプロトコルとして使用され、MIPv6のグローバルモビリティプロトコルとして使用される場合に1つのメッセージの流れを説明しています。"
    },
    {
      "indent": 0,
      "text": "3.2. Issues Related to Scenario A.2",
      "section_title": true,
      "ja": "3.2。シナリオA.2に関連する問題"
    },
    {
      "indent": 3,
      "text": "This section highlights some considerations that are applicable to scenario A.2.",
      "ja": "このセクションでは、シナリオA.2に適用可能ないくつかの考慮事項を強調しています。"
    },
    {
      "indent": 3,
      "text": "1. HoA management and lookup key in the binding cache",
      "section_title": true,
      "ja": "バインディングキャッシュ1. HoAを管理し、検索キー"
    },
    {
      "indent": 7,
      "text": "*  In MIPv6 [RFC6275], the lookup key in the binding cache is the\n   HoA of the MN.  In particular, the base specification\n   [RFC6275] doesn't require the MN to include any identifier,\n   such as the MN-ID [RFC4283], in the Binding Update message\n   other than its HoA.  As described in [RFC4877], the identifier\n   of the MN is known by the Home Agent after the Internet Key\n   Exchange Protocol (IKEv2) exchange, but this is not used in\n   the MIPv6 signaling or as a lookup key for the binding cache.\n   On the other hand, as specified in [RFC5213], a Proxy Binding\n   Update contains the home prefix of the MN, the MN-ID and does\n   not include the HoA of the MN (since it may not be known by\n   the MAG and consequently by the HA/LMA).  The lookup key in\n   the binding cache of the LMA is either the home prefix or the\n   MN-ID.  This implies that lookup keys for MIPv6 and PMIPv6\n   registrations are different.  Because of that, when the MN\n   moves from its home network (i.e., from the PMIPv6 domain) to\n   the foreign link, the Binding Update sent by the MN is not\n   identified by the HA as an update of the Proxy BCE containing\n   the home prefix of the MN, but a new binding cache entry is\n   created.  Therefore, PMIPv6 and MIPv6 will always create two\n   different BCEs in the HA/LMA, which implies that the HA and\n   LMA are logically separated.  How to handle the presence of\n   the two BCEs for the same MN is described in Section 4.2.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "2. MIPv6 de-registration Binding Update deletes PMIPv6 binding cache entry",
      "ja": "2. MIPv6の登録解除バインディングアップデートのPMIPv6バインディングキャッシュエントリを削除します"
    },
    {
      "indent": 7,
      "text": "*  When the MN moves from a MIPv6 foreign network to the PMIPv6\n   home domain, the MAG registers the MN at the LMA by sending a\n   Proxy Binding Update.  Subsequently, the LMA updates the MN's\n   BCE with the MAG address and the MAG emulates the MN's home\n   link.  Upon detection of the home link, the MN will send a\n   de-registration Binding Update to its home agent.  It is\n   necessary to make sure that the de-registration of the MIPv6\n   Binding Update does not change the PMIPv6 BCE just created by\n   the MAG.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "3. Race condition between Binding Update and Proxy Binding Update messages (Sequence Numbers and Timestamps)",
      "ja": "バインディング更新及びプロキシ・バインディング更新メッセージ（シーケンス番号とタイムスタンプ）との間の前記競合状態"
    },
    {
      "indent": 7,
      "text": "*  MIPv6 and PMIPv6 use different mechanisms for handling\n   re-ordering of registration messages and they are sent by\n   different entities.  In MIPv6, Binding Update messages that\n   are sent by the MN to the home agent are ordered by the\n   sequence numbers.  The other side, in PMIPv6, Proxy Binding\n   Update messages that are sent by the MAG to the LMA are ordered by a timestamp option.  When the MN moves from one\n   access where Mobile IP is used to another access when Proxy\n   Mobile IP is used, delay in the mobility signaling sent may\n   imply adverse situations.  For example, if the MN sends a\n   Mobile IP Binding Update from access A before moving to access\n   B and this Binding Update gets delayed (e.g., a refresh\n   Binding Update), the Binding Update may reach the combined\n   LMA/HA after the Proxy Binding Update sent by the MAG,\n   re-directing packets to access A even after the MN has moved\n   to access B.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "4. Threat of compromised MAG",
      "section_title": true,
      "ja": "妥協MAGの4脅威"
    },
    {
      "indent": 7,
      "text": "*  In the MIPv6 base specification [RFC6275], there is a strong\n   binding between the HoA registered by the MN and the Security\n   Association (SA) used to modify the corresponding BCE.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "* In the PMIPv6 specification [RFC5213], the MAG sends Proxy Binding Updates on behalf of a MN to update the BCE that corresponds to the MN's HoA. Since the MAG sends the Binding Updates, PMIPv6 requires SAs between each MAG and the LMA.",
      "ja": "* PMIPv6の仕様[RFC5213]では、MAGは、プロキシはMNのHoAに対応BCEを更新するために、MNに代わって結合更新送信します。 MAGバインディング更新を送信するので、PMIPv6の各MAGとLMAとの間のSAを必要とします。"
    },
    {
      "indent": 7,
      "text": "* As described in [RFC4832], in PMIPv6, MAG compromise or impersonation is an issue. [RFC4832], Section 2.2, describes how a compromised MAG can harm the functionality of an LMA, e.g., manipulating the LMA's routing table (or binding cache).",
      "ja": "* [RFC4832]に記載されているように、のPMIPv6に、MAGの妥協または偽装が問題です。 [RFC4832]セクション2.2は、妥協MAGは、LMAのルーティングテーブルを操作する（またはキャッシュを結合）、例えば、LMAの機能を害することができる方法について説明します。"
    },
    {
      "indent": 7,
      "text": "* In this mixed scenario, both host-based and network-based SAs are used to update the same binding cache entry at the HA/LMA (but see the first bullet of this list, as the entry may not be the same). Based on this consideration, the threat described in [RFC4832] is worse as it also affects hosts that are using the LMA/HA as MIPv6 HA and not using PMIPv6.",
      "ja": "*この混合シナリオでは、両方のホストベースおよびネットワークベースのSAが（エントリは同じでなくてもよいように、このリストの最初の項目を参照）HA / LMAで同じバインディング・キャッシュ・エントリを更新するために使用されます。また、MIPv6のHAなどのLMA / HAを用いてのPMIPv6を使用していないホストに影響を与えるように、この考察に基づいて、[RFC4832]に記載の脅威が悪くなります。"
    },
    {
      "indent": 0,
      "text": "3.3. Issues Related to Scenario B",
      "section_title": true,
      "ja": "3.3。シナリオBに関連する問題"
    },
    {
      "indent": 3,
      "text": "In this scenario, there are two types of nodes in the access network: some nodes support MIPv6 while some others do not. The rationale behind such a scenario is that the nodes implementing MIPv6 manage their own mobility to achieve better performance, e.g., for inter-technology handovers. Obviously, nodes that do not implement MIPv6 must rely on the network to manage their mobility; therefore, Proxy MIPv6 is used for those nodes.",
      "ja": "このシナリオでは、アクセスネットワーク内のノードの2種類がありますいくつかの他の人がいない間、いくつかのノードは、MIPv6のをサポートしています。このようなシナリオの根拠は、MIPv6のを実装するノードは、技術間ハンドオーバのために、例えば、より高いパフォーマンスを達成するために、独自のモビリティを管理することです。明らかに、MIPv6のを実装していないノードが自分のモビリティを管理するためにネットワークに依存しなければなりません。従って、プロキシMIPv6のは、それらのノードのために使用されます。"
    },
    {
      "indent": 3,
      "text": "Based on the current PMIPv6 solution described in [RFC5213], in any link of the PMIPv6 domain, the MAG emulates the MN's home link, advertising the home link prefix to the MN in a unicast Router Advertisement message. This ensures that the IP address of the MN is still considered valid by the MN itself. The home network prefix (and any other information needed to emulate the home link) is included in the MN's profile that is obtained by the MAG via context transfer or via a policy store.",
      "ja": "[RFC5213]で説明され、現在のPMIPv6ソリューションに基づいて、PMIPv6ドメインのいずれかのリンクでは、MAGは、ユニキャストRouter AdvertisementメッセージでMNにホームリンクプレフィックスを広告し、MNのホームリンクをエミュレートします。これは、MNのIPアドレスがまだMN自身によって有効と見なされることを保証します。ホームネットワークプレフィックス（およびホームリンクをエミュレートするために必要なその他の情報）はコンテキスト転送を介して、またはポリシーストア経由MAGすることによって得られるMNのプロファイルに含まれています。"
    },
    {
      "indent": 3,
      "text": "However, in case there are nodes that implement MIPv6 and want to use this protocol, the network must offer MIPv6 service to them. In such a case, the MAG should not emulate the home link. Instead of advertising the MN-HNP, the MAG should advertise the topologically correct local IP prefix, i.e., the prefix belonging to the MAG, so that the MN detects an IP movement, configures a new CoA, and sends a MIPv6 Binding Update based on [RFC6275].",
      "ja": "しかし、MIPv6のを実装し、このプロトコルを使用するノードが存在する場合には、ネットワークは、それらにMIPv6のサービスを提供しなければなりません。そのような場合には、MAGは、ホームリンクをエミュレートするべきではありません。代わりに、MN-HNPを広告MNは、IPの動きを検出し、新たなCoAを構成し、上のベースMIPv6のバインディングアップデートを送信するように、MAGは、トポロジー的に正しいローカルIPプレフィックス、すなわち、MAGに属するプレフィックスを通知すべきです[RFC6275]。"
    },
    {
      "indent": 0,
      "text": "4. Analysis of Possible Solutions",
      "section_title": true,
      "ja": "可能な解決策4.分析"
    },
    {
      "indent": 0,
      "text": "4.1. Solutions Related to Scenario A.1",
      "section_title": true,
      "ja": "4.1。シナリオA.1に関連ソリューション"
    },
    {
      "indent": 3,
      "text": "As mentioned in Section 3.1, there are no significant issues in this scenario.",
      "ja": "3.1節で述べたように、このシナリオには重要な問題はありません。"
    },
    {
      "indent": 3,
      "text": "Figures 5 and 6 show a scenario where an MN is moving from one PMIPv6 domain to another, based on the scenario of Figure 1. In Figure 5, the MN moves from an old MAG to MAG2 in the same PMIPv6 domain: this movement triggers a PBU to LMA1 and the updating of the binding cache at the LMA1. There is no MIPv6 signaling as the CoA_1 registered at the HA is the HoA for the PMIPv6 session. In Figure 6, the MN moves from MAG2 in the LMA1 PMIPv6 domain to MAG3 in a different PMIPv6 domain: this triggers the PMIPv6 signaling and the creation of a binding at the LMA2. On the other hand, the local address of the mobile node is changed, as the LMA has changed; therefore, the MN sends a MIPv6 Binding Update to the HA with the new CoA_2.",
      "ja": "図5および図6は、図5において、図1のシナリオに基づいて、MNが別のPMIPv6ドメインから移動しているシナリオを示し、同一のPMIPv6ドメイン内のMAG2に古いMAGからMNの移動は、この移動は、トリガーLMA1へPBUとLMA1のバインディングキャッシュの更新。 HAに登録CoA_1がPMIPv6のセッションのためのHoAであるとして何MIPv6のシグナリングはありません。図6に、異なるPMIPv6ドメイン内MAG3へLMA1 PMIPv6ドメイン内のMAG2からMNが移動する：これは、のPMIPv6シグナリングおよびLMA2での結合の作成をトリガします。 LMAが変更されている一方、モバイルノードのローカルアドレスは、変更されます。そのため、MNは、新しいCoA_2でHAにMIPv6のバインディングアップデートを送信します。"
    },
    {
      "indent": 4,
      "text": "+----+            +------+            +------+       +----+\n| MN |            | MAG2 |            | LMA1 |       | HA |\n+----+            +------+            +------+       +----+\n  |                  |                    |            |\n  |                  |                    |   +-----------------+\n  |                  |                    |   |  HoA -> CoA_1   |\n  |                  |                    |   | binding present |\n  |                  |                    |   +-----------------+\n  |                  |                    |            |\n  | CoA conf/confirm |  PBU(CoA_1,MAG_2)  |            |\n  | <--------------->|  ----------------->|            |\n  |                  |              +-----------------+|\n  |                  |              | CoA_1 -> MAG_2  ||\n  |                  |              | binding updated ||\n  |                  |              +-----------------+|\n  |                  |          PBA       |            |\n  |                  |   <----------------|            |\n  |                  |                    |            |",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 5: Local Mobility Message Flow",
      "ja": "図5：ローカル・モビリティメッセージフロー"
    },
    {
      "indent": 4,
      "text": "+----+            +------+            +------+       +----+\n| MN |            | MAG3 |            | LMA2 |       | HA |\n+----+            +------+            +------+       +----+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "|   CoA config     |  PBU(CoA_2,MAG_3)  |             |\n|<---------------->|------------------->|             |\n|                  |              +-----------------+ |\n|                  |              | CoA_2 -> MAG_3  | |\n|                  |              | binding created | |\n|                  |              +-----------------+ |\n|                  |          PBA       |             |\n|                  |<-------------------|             |\n|                  |                    |             |\n|                  |  BU (HoA, CoA_2)   |             |\n|---------------------------------------------------->|\n|                  |                    |             |\n|                  |                    |     +-----------------+\n|                  |                    |     |  HoA -> CoA_2   |\n|                  |                    |     | binding updated |\n|                  |                    |     +-----------------+\n|                  | BA                 |             |\n|<----------------------------------------------------|",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Figure 6: Global Mobility Message Flow",
      "ja": "図6：グローバルモビリティメッセージフロー"
    },
    {
      "indent": 0,
      "text": "4.2. Solutions Related to Scenario A.2",
      "section_title": true,
      "ja": "4.2。シナリオA.2に関連ソリューション"
    },
    {
      "indent": 3,
      "text": "As described in Section 3.2, in this scenario, the MN relies on PMIPv6 as long as it is in the PMIPv6 domain. The MN then uses MIPv6 whenever it moves out of the PMIPv6 domain, which basically implies that the MIPv6 home link is a PMIPv6 domain.",
      "ja": "このシナリオでは、3.2節で説明したように、MNは、それがPMIPv6ドメインにあるようにPMIPv6に依存しています。それは基本的にMIPv6のホームリンクがPMIPv6ドメインであることを意味PMIPv6ドメイン、外に移動するたびにMNはその後のMIPv6を使用しています。"
    },
    {
      "indent": 3,
      "text": "Analyzing the issues described in Section 3.2, it is clear that most of them are applicable only to the case where there is a common BCE for the PMIPv6 registration and the MIPv6 registration. Issue 1, on how the two protocols identify the BCE, is valid only in the case in which we assume that a PMIPv6 message has any value for a MIPv6 BCE. Also, Issues 2 and 3 are not applicable in the case in which different logical BCEs are used by the LMA and the HA. For this reason, it is recommended that when the MIPv6 home link is implemented as a PMIPv6 domain, the HA/LMA implementation treat the two protocols as independent.",
      "ja": "3.2節で説明した問題点を分析、それらのほとんどが唯一のPMIPv6登録とMIPv6の登録のための一般的なBCEがある場合にも適用可能であることは明らかです。 2つのプロトコルは、BCEを識別する方法についての問題1は、唯一の我々はPMIPv6のメッセージは、MIPv6のBCEのために任意の値を持っていることを前提とした場合に有効です。また、問題2及び図3は、異なる論理BCEsがLMA及びHAによって使用されている場合には適用できません。このため、MIPv6のホームリンクがPMIPv6ドメインとして実装されている場合、HA / LMAの実装は、独立して2つのプロトコルを扱うことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "In more detail, the following principles should be followed by the HA/LMA implementation:",
      "ja": "より詳細には、以下の原理がHA / LMA実装によって従わなければなりません。"
    },
    {
      "indent": 3,
      "text": "o PMIPv6 signaling does not overwrite any MIPv6 BCE. In particular, when a PMIPv6 BCE is created for an MN that has previously created a MIPv6 BCE, the MIPv6 BCE of the MN is not overwritten, and a new PMIPv6 BCE is created.",
      "ja": "OのPMIPv6シグナリングは、任意のMIPv6のBCEを上書きしません。具体的には、PMIPv6のBCEが以前のMIPv6 BCEを作成したMNのために作成されたときに、MNのMIPv6のBCEは上書きされず、新しいPMIPv6のBCEが作成されます。"
    },
    {
      "indent": 3,
      "text": "o The downlink packets in the case where both the MIPv6 BCE and PMIPv6 BCE exist are processed as follows:",
      "ja": "MIPv6のBCEとのPMIPv6 BCEの両方が次のように処理されて存在する場合の下りパケットO："
    },
    {
      "indent": 6,
      "text": "1. The MIPv6 BCE is processed first. If the destination address of the received downlink packet matches the BCE of the HA, the packet is forwarded by encapsulating it with the CoA contained in the BCE.",
      "ja": "1. MIPv6のBCEが最初に処理されます。受信した下りパケットの宛先アドレスがHAのBCEと一致する場合、パケットは、BCEに含まれているCoAを用いてそれをカプセル化することによって転送されます。"
    },
    {
      "indent": 6,
      "text": "2. If the destination address does not match the MIPv6 BCE, the BCE created by PMIPv6 is applied, and the packets are encapsulated to the registered MAG.",
      "ja": "宛先アドレスがMIPv6のBCEと一致しない場合2.のPMIPv6によって作成されたBCEが適用され、パケットが登録されたMAGに封入されています。"
    },
    {
      "indent": 3,
      "text": "The following subsections provide a description of the procedures that will be followed by the MN and HA/LMA based on the above principles. The analysis is performed in two different subsections, depending on whether the MN moves from a PMIPv6 domain to a non-PMIPv6 domain or vice versa.",
      "ja": "以下のサブセクションでは、上記の原理に基づいて、MNとHA / LMAが続く手順の説明を提供します。分析は、MNが非PMIPv6ドメイン、またはその逆へのPMIPv6ドメインから移動するかどうかに応じて、2つの異なるサブセクションで行われます。"
    },
    {
      "indent": 0,
      "text": "4.2.1. Mobility from a PMIPv6 Domain to a Non-PMIPv6 Domain",
      "section_title": true,
      "ja": "4.2.1。非のPMIPv6ドメインへのPMIPv6ドメインからモビリティ"
    },
    {
      "indent": 3,
      "text": "Let's assume the MN is attached to a PMIPv6 domain and there is a valid Proxy BCE at the LMA. Then, the MN moves to a different access network and starts using MIPv6 (e.g., because PMIPv6 is not supported). The MN needs to bootstrap MIPv6 parameters and send a MIPv6 Binding Update in order to have service continuity. Therefore, the following steps must be performed by the User Equipment (UE):",
      "ja": "のは、MNがPMIPv6ドメインに接続され、LMAで有効なプロキシBCEがあると仮定しましょう。その後、MNは異なるアクセスネットワークに移動して（のPMIPv6がサポートされていないため、例えば）のMIPv6を使用して開始します。 MNはMIPv6のパラメータをブートストラップし、サービスの継続性を持たせるためにMIPv6のバインディングアップデートを送信する必要があります。したがって、次のステップは、ユーザ機器（UE）によって実行されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o HA/LMA address discovery: the MN needs to discover the IP address of the LMA that has a valid BCE for its home network prefix. This is described in Section 3.2 as Issue 4.",
      "ja": "O HA / LMAアドレス発見：MNがホームネットワークプレフィックスの有効なBCEを持っているLMAのIPアドレスを発見する必要があります。これは、問題4のように、セクション3.2に記載されています。"
    },
    {
      "indent": 3,
      "text": "o SA establishment: the MN needs to establish an IPsec Security Association with the HA/LMA as described in [RFC4877].",
      "ja": "O SAの確立：MNは、[RFC4877]で説明したようにHA / LMAとのIPsecセキュリティアソシエーションを確立する必要があります。"
    },
    {
      "indent": 3,
      "text": "o HoA or home network prefix assignment: as part of the MIPv6 bootstrapping procedure, the HA assigns a MIPv6 HoA to the MN. This address must be the same the MN was using in the PMIPv6 domain.",
      "ja": "HoAまたはホームネットワークプレフィックスの割り当てO：MIPv6のブートストラップ手順の一部として、HAは、MNへのMIPv6のHoAを割り当てます。このアドレスは、MNがPMIPv6ドメインで使用したのと同じでなければなりません。"
    },
    {
      "indent": 3,
      "text": "Since all these steps must be performed by the MN before sending the Binding Update, they have an impact on the handover latency experienced by the MN. For this reason, it is recommended that the MN establish the IPsec SA (and, consequently, be provided by the HA/ LMA with a MIPv6-HoA) when it is initialized. This implies that the MN has MIPv6 stack active while in the PMIPv6 domain, but as long as it is attached to the same PMIPv6 domain, it will appear to the MN as if it is attached to the home link.",
      "ja": "これらすべてのステップがバインディングアップデートを送信する前にMNによって実行されなければならないので、MNが経験するハンドオーバ待ち時間に影響を与えます。このため、MNは、IPsecのSAを確立する（そして、結果的に、MIPv6の-のHoAとHA / LMAによって提供されている）、それが初期化されたときにすることをお勧めします。これは、MNがMIPv6のは、PMIPv6ドメインで活躍中を積み重ねていますが、それは、ホームリンクに接続されているかのようであれば、同じPMIPv6ドメインに接続されているとして、それはMNに表示されることを意味します。"
    },
    {
      "indent": 3,
      "text": "In order to establish the SA with the HA/LMA, the MN needs to discover the IP address of the LMA/HA while in the PMIPv6 domain. This can be done either based on DNS or based on DHCPv6, as described in [RFC5026] and [RFC6611]. The network should be configured so that the MN discovers or gets assigned the same HA/LMA that was serving as the LMA in the PMIPv6 domain. Details of the exact procedure are out of scope of this document.",
      "ja": "HA / LMAとSAを確立するために、MNは、PMIPv6ドメインにおけるながら、LMA / HAのIPアドレスを発見する必要があります。 [RFC5026]及び[RFC6611]に記載されているように、これは、いずれかで行うDNSに基づいて、またはDHCPv6のに基づくことができます。 MNが発見またはPMIPv6ドメインにLMAとして機能したのと同じHA / LMAを割り当てられますようにネットワークが構成されるべきです。正確な手順の詳細は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "When the MN establishes the SA, it acquires an HoA based on [RFC5026]. However, based on PMIPv6 operations, the LMA knows only the home network prefix used by the MN and does not know the MN-HoA. For this reason, the MN must be configured to propose the MN-HoA as the HoA in the IKEv2 INTERNAL_IP6_ADDRESS attribute during the IKEv2 exchange with the HA/LMA. Alternatively, the HA/LMA can be configured to provide the entire home network prefix via the MIP6_HOME_LINK attribute to the MN as specified in [RFC5026]; based on this home network prefix, the MN can configure an HoA. Note that the SA must be bound to the MN-HoA used in the PMIPv6 domain as per",
      "ja": "MNは、SAを確立すると、それは、[RFC5026]に基づいてHoAとを取得します。しかし、PMIPv6の操作に基づいて、LMAは、MNによって使用される唯一のホームネットワークプレフィックスを知っているし、MN-のHoAを知りません。このため、MNは、HA / LMAとのIKEv2交換の間のIKEv2 INTERNAL_IP6_ADDRESS属性でのHoAとMN-のHoAを提案するように設定する必要があります。代替的に、HA / LMAは、[RFC5026]で指定されるようにMNにMIP6_HOME_LINK属性を介して全体のホーム・ネットワーク・プレフィクスを提供するように構成することができます。このホームネットワークプレフィックスに基づいて、MNは、HoAとを設定することができます。 SAがバインドされなければならないことに注意してくださいMN-HoAがあたりとしてPMIPv6ドメインで使用されます"
    },
    {
      "indent": 3,
      "text": "[RFC4877]. Note that the home network prefix is shared between the LMA and HA, and this implies that there is an interaction between the LMA and the HA in order to assign a common home network prefix when triggered by PMIPv6 and MIPv6 signaling.",
      "ja": "[RFC4877]。ホーム・ネットワーク・プレフィックスがLMAとHAとの間で共有されることに注意してください、これはのPMIPv6とMIPv6のシグナリングによってトリガーされたとき、共通のホーム・ネットワーク・プレフィックスを割り当てるためにLMAとHAとの間の相互作用があることを意味します。"
    },
    {
      "indent": 3,
      "text": "When the MN hands over to an access network that does not support Proxy Mobile IPv6, it sends a Binding Update to the HA. The MN may set the R bit defined in the Network Mobility (NEMO) specification (implicit mode) [RFC3963] in order to indicate that the entire HNP is moved to the new CoA. A MIPv6 BCE is created irrespective of the existing PMIPv6 BCE. Packets matching the MIPv6 BCE are sent to the CoA present in the MIPv6 BCE. The PMIPv6 BCE will expire in the case in which the MAG does not send a refresh PBU.",
      "ja": "以上のプロキシモバイルIPv6をサポートしていないアクセスネットワークへのときMNの手、それはHAにバインディングアップデートを送信します。 MNは、全体HNPを新たなCoAに移動していることを示すために、ネットワークモビリティ（NEMO）仕様（暗黙モード）[RFC3963]で定義されたRビットを設定してもよいです。 MIPv6のBCEは、既存のPMIPv6 BCEとは無関係に作成されます。 MIPv6 BCEに一致するパケットはMIPv6のBCE中のCoAの存在に送られます。 PMIPv6のBCEは、MAGは、リフレッシュPBUを送信しない場合に期限切れになります。"
    },
    {
      "indent": 0,
      "text": "4.2.2. Mobility from a Non-PMIPv6 Domain to a PMIPv6 Domain",
      "section_title": true,
      "ja": "4.2.2。非のPMIPv6ドメインからのPMIPv6ドメインへのモビリティ"
    },
    {
      "indent": 3,
      "text": "In this section, it is assumed that the MN is in a non-PMIPv6 access network, and it has bootstrapped MIPv6 operations based on [RFC5026]; therefore, there is valid binding cache for its MIPv6-HoA (or HNP in case of NEMO) at the HA. Then, the MN moves to a PMIPv6 domain that is configured to be the home link for the MIPv6-HoA the MN has been assigned.",
      "ja": "このセクションでは、MNは非のPMIPv6アクセスネットワークにあると仮定され、それは、[RFC5026]に基づいて、MIPv6の動作をブートストラップしています。従って、HAで（NEMOの場合又はHNP）そのMIPv6の-HoAとの有効なバインディング・キャッシュがあります。その後、MNは、MNが割り当てられているMIPv6の-のHoAのためのホームリンクするように構成されているPMIPv6ドメインに移動します。"
    },
    {
      "indent": 3,
      "text": "In order to provide session continuity, the MAG needs to send a PBU to the HA/LMA that was serving the MN. The MAG needs to discover the HA/LMA; however, [RFC5213] assumes that the LMA is assigned to the MAG or discovered by the MAG when the MN attaches to the MAG. The exact mechanism is not specified in [RFC5213]. A detailed description of the necessary procedure is out of the scope of this document. Note that the MAG may also rely on static configuration or lower-layer information provided by the MN in order to select the correct HA/LMA.",
      "ja": "セッションの継続性を提供するために、MAGは、MNにサービスを提供してHA / LMAにPBUを送信する必要があります。 MAGは、HA / LMAを発見する必要があります。ただし、[RFC5213]はLMAは、MAGに割り当てられているか、MNがMAGに接続するMAGによって発見されていることを前提としています。正確なメカニズムは[RFC5213]で指定されていません。手続きの詳細な説明はこの文書の範囲外です。 MAGはまた、静的構成または正しいHA / LMAを選択するために、MNによって提供される下層情報に依拠することができることに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "The PBU sent by the MAG creates a PMIPv6 BCE for the MN that is independent of the MIPv6 BCE. Traffic destined to the MIPv6-HoA (or to the HNP in case the MN had set the flag R in the last BU) is still forwarded to the CoA present in the MIPv6 BCE. When the MN wants to use the HoA directly from the home link, it sends a de-registration message and, at that point only, the PMIPv6 BCE is present.",
      "ja": "MAGによって送信されたPBUは、MIPv6のBCEから独立してMNのためのPMIPv6 BCEを作成します。 MIPv6の-のHoA宛てのトラフィック（またはMNが最後のBU内のフラグRを設定していた場合にHNPに）依然としてMIPv6のBCE中のCoAの存在に転送されます。 MNがホームリンクから直接のHoAを使用したい場合は、その時点でのみ、PMIPv6のBCEが存在し、登録解除メッセージを送信します。"
    },
    {
      "indent": 0,
      "text": "4.3. Solutions Related to Scenario B",
      "section_title": true,
      "ja": "4.3。シナリオBに関連ソリューション"
    },
    {
      "indent": 3,
      "text": "The solution for this scenario depends on the access network being able to determine that a particular MN wants to use Mobile IPv6. This requires a solution at the system level for the access network and may require knowledge of the detailed configuration and software capabilities of every MN in the system. These issues are out of the scope of this document.",
      "ja": "このシナリオのためのソリューションは、特定のMNは、モバイルIPv6を使用するように望んでいることを決定することができるというアクセスネットワークに依存します。これは、アクセスネットワークのためのシステムレベルでのソリューションを必要とし、システム内のすべてのMNの詳細な構成およびソフトウェアの機能についての知識を必要とするかもしれません。これらの問題は、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Scenario A.1 does not introduce any new security issues in addition to those described in [RFC5213] or [RFC6275].",
      "ja": "シナリオA.1は、[RFC5213]か[RFC6275]に記載されたものに加えて、新たなセキュリティ問題を紹介しません。"
    },
    {
      "indent": 3,
      "text": "For Scenario A.2, this document requires that the a home agent that also implements the PMIPv6 LMA functionality should allow both the MN and the authorized MAGs to modify the BCEs for the MN. Note that the compromised MAG threat described in [RFC4832] also applies here in a more severe form as explained in Section 3.2. Scenario B relies on the secure identification of MNs and their capabilities so that the right service can be provided for the right MNs. For instance, a malicious MN should not get the HoA of some other node assigned to it, and a MN that desires to employ its own mobility management should be able to do so. The ability to identify nodes is already a requirement in [RFC5213], but Scenario B adds a requirement on identification of node capabilities.",
      "ja": "シナリオA.2については、この文書はまたのPMIPv6 LMA機能を実装ホームエージェントは、MNと認可のMAGの両方がMNのためBCEsを変更できるようにする必要があることが必要です。 3.2節で説明したように、[RFC4832]に記載損なわMAGの脅威は、より重篤な形でここに適用されることに留意されたいです。右のサービスは、右のMNに提供することができるように、シナリオBは、MNのとその機能の安全な識別に依存しています。例えば、悪意のあるMNは、それに割り当てられたいくつかの他のノードのHoAであり、独自のモビリティ管理がそうすることができるはず採用を希望するMNを取得するべきではありません。ノードを識別する能力は、すでに[RFC5213]で必要であるが、シナリオBは、ノードの機能の識別に関する要件を追加します。"
    },
    {
      "indent": 0,
      "text": "6. Contributors",
      "section_title": true,
      "ja": "6.寄与者"
    },
    {
      "indent": 3,
      "text": "Kuntal Chowdhury - kuntal@hotmail.com",
      "ja": "Kuntalチョードリー -  kuntal@hotmail.com"
    },
    {
      "indent": 3,
      "text": "Vijay Devarapalli - vijay.devarapalli@azairenet.com",
      "ja": "ビジェイのdevarapalli  - విజయ్.దేవరపల్లి@అజయరెన్ట్.కం"
    },
    {
      "indent": 3,
      "text": "Sri Gundavelli - sgundave@cisco.com",
      "ja": "スリGundavelli  -  sgundave@cisco.com"
    },
    {
      "indent": 3,
      "text": "Suresh Krishnan - suresh.krishnan@ericsson.com",
      "ja": "スレシュクリシュナン -  suresh.krishnan@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Ahmad Muhanna - amuhanna@nortel.com",
      "ja": "アフマドMuhanna  -  amuhanna@nortel.com"
    },
    {
      "indent": 3,
      "text": "Hesham Soliman - Hesham@elevatemobile.com",
      "ja": "ヒシャムスレイマン - هشام@الفاطمبل.كوم"
    },
    {
      "indent": 3,
      "text": "George Tsirtsis - tsirtsis@googlemail.com",
      "ja": "ジョージTsirtsis  -  tsirtsis@googlemail.com"
    },
    {
      "indent": 3,
      "text": "Genadi Velev - Genadi.Velev@eu.panasonic.com",
      "ja": "ゲンナジーZhelev  -  Genadi.Velev@eu.panasonits.tsum"
    },
    {
      "indent": 3,
      "text": "Kilian Weniger - Kilian.Weniger@googlemail.com",
      "ja": "キリアンWeniger  -  Kilian.Weniger@googlemail.com"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "This document is a merge of four different documents: \"Proxy Mobile IPv6 and Mobile IPv6 interworking issues\" (April 2007), \"Proxy Mobile IPv6 and Mobile IPv6 interworking\" (April 2007), \"Behavior of Collocated HA/LMA\" (October 2008), and \"Interactions between PMIPv6 and MIPv6: scenarios and related issues\" (November 2007). Thanks to the authors and editors of those documents.",
      "ja": "「プロキシモバイルIPv6とモバイルIPv6のインターワーキングの問題」（2007年4月）、「プロキシモバイルIPv6とモバイルIPv6のインターワーキング」（2007年4月）、「併置HA / LMAの動作」（2008年10月：このドキュメントは、4つの異なる文書のマージです）、および「のPMIPv6とMIPv6の間の相互作用：シナリオと関連する問題」（2007年11月）。それらの文書の著者と編集者に感謝します。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to thank Jonne Soininen and Vidya Narayanan, NETLMM WG chairs, for their support.",
      "ja": "著者はまた、彼らのサポートのために、Jonne SoininenとVidyaナラヤナン、NETLMM WGの椅子に感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC3963] Devarapalli, V., Wakikawa, R., Petrescu, A., and P. Thubert, \"Network Mobility (NEMO) Basic Support Protocol\", RFC 3963, January 2005.",
      "ja": "[RFC3963] Devarapalli、V.、Wakikawa、R.、ペトレスク、A.、およびP. Thubert、 \"ネットワークモビリティ（NEMO）基本サポートプロトコル\"、RFC 3963、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4832] Vogt, C. and J. Kempf, \"Security Threats to Network-Based Localized Mobility Management (NETLMM)\", RFC 4832, April 2007.",
      "ja": "[RFC4832]フォークト、C.とJ.ケンプ、 \"ネットワークベース局所モビリティ管理（NETLMM）へのセキュリティの脅威\"、RFC 4832、2007年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4877] Devarapalli, V. and F. Dupont, \"Mobile IPv6 Operation with IKEv2 and the Revised IPsec Architecture\", RFC 4877, April 2007.",
      "ja": "[RFC4877] Devarapalli、V.とF.デュポン、 \"IKEv2のと改訂のIPsecアーキテクチャとのモバイルIPv6の操作\"、RFC 4877、2007年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5026] Giaretta, G., Kempf, J., and V. Devarapalli, \"Mobile IPv6 Bootstrapping in Split Scenario\", RFC 5026, October 2007.",
      "ja": "[RFC5026] Giaretta、G.、ケンプ、J.、およびV. Devarapalli、 \"分割シナリオにおけるモバイルIPv6ブートストラップ\"、RFC 5026、2007年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5213] Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K., and B. Patil, \"Proxy Mobile IPv6\", RFC 5213, August 2008.",
      "ja": "[Ramphsi 5213] gundavelli、S。、Leunjiは、K.、Devarapalliは、VEの。、Chaudhuriの、K.、aとb。パティル、 \"プロキシモバイル20 6\"、rphak 5213、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5380] Soliman, H., Castelluccia, C., ElMalki, K., and L. Bellier, \"Hierarchical Mobile IPv6 (HMIPv6) Mobility Management\", RFC 5380, October 2008.",
      "ja": "[RFC5380]ソリマン、H.、カステルッシア、C.、ElMalki、K.、およびL. Bellier、 \"階層モバイルIPv6（HMIPv6の）モビリティ・マネジメント\"、RFC 5380、2008年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6275] Perkins, C., Johnson, D., and J. Arkko, \"Mobility Support in IPv6\", RFC 6275, July 2011.",
      "ja": "[RFC6275]パーキンス、C.、ジョンソン、D.、およびJ. Arkko、 \"IPv6におけるモビリティサポート\"、RFC 6275、2011年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6611] Chowdhury, K., Ed. and A. Yegin, \"Mobile IPv6 (MIPv6) Bootstrapping for the Integrated Scenario\", RFC 6611, May 2012.",
      "ja": "[RFC6611]チョードリ、K.、エド。そして、A. Yegin、 \"モバイルIPv6の統合シナリオのための（MIPv6の）ブートストラップ\"、RFC 6611、2012年5月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3753] Manner, J. and M. Kojo, \"Mobility Related Terminology\", RFC 3753, June 2004.",
      "ja": "[RFC3753]マナー、J.とM.古城、 \"モビリティ関連用語\"、RFC 3753、2004年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4283] Patel, A., Leung, K., Khalil, M., Akhtar, H., and K. Chowdhury, \"Mobile Node Identifier Option for Mobile IPv6 (MIPv6)\", RFC 4283, November 2005.",
      "ja": "[RFC4283]パテル、A.、レオン、K.、カリル、M.、アクタール、H.、およびK.チョードリ、 \"モバイルIPv6（MIPv6の）のためのモバイルノード識別子オプション\"、RFC 4283、2005年11月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Gerardo Giaretta (editor) Qualcomm",
      "ja": "ヘラルドGiaretta（編集者）クアルコム"
    },
    {
      "indent": 3,
      "text": "EMail: gerardog@qualcomm.com",
      "ja": "メールアドレス：gerardog@qualcomm.com"
    }
  ]
}