{
  "title": {
    "text": "RFC 7725 - An HTTP Status Code to Report Legal Obstacles",
    "ja": "RFC 7725 - HTTPステータスコードは、法的障害を報告すること"
  },
  "number": 7725,
  "created_at": "2019-11-01 16:09:35.581473+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           T. Bray\nRequest for Comments: 7725                                    Textuality\nCategory: Standards Track                                  February 2016\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 13,
      "text": "An HTTP Status Code to Report Legal Obstacles",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies a Hypertext Transfer Protocol (HTTP) status code for use when resource access is denied as a consequence of legal demands.",
      "ja": "この文書では、リソースへのアクセスは、法的要求の結果として拒否された使用のためのハイパーテキスト転送プロトコル（HTTP）ステータスコードを指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7725.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7725で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Requirements  . . . . . . . . . . . . . . . . . . . . . . . .   2\n3.  451 Unavailable For Legal Reasons . . . . . . . . . . . . . .   2\n4.  Identifying Blocking Entities . . . . . . . . . . . . . . . .   3\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .   4\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   4\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   4\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   5\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .   5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document specifies a Hypertext Transfer Protocol (HTTP) status code for use when a server operator has received a legal demand to deny access to a resource or to a set of resources that includes the requested resource.",
      "ja": "この文書は、サーバーオペレータがリソースまたは要求されたリソースが含まれるリソースのセットへのアクセスを拒否するための法的要求を受けた使用のためのハイパーテキスト転送プロトコル（HTTP）ステータスコードを指定します。"
    },
    {
      "indent": 3,
      "text": "This status code can be used to provide transparency in circumstances where issues of law or public policy affect server operations. This transparency may be beneficial both to these operators and to end users.",
      "ja": "このステータスコードは、法律や公共政策の問題は、サーバーの運用に影響を与える状況の透明性を提供するために使用することができます。この透明性は、これらの演算子の両方に有益であるかもしれないし、エンドユーザーに。"
    },
    {
      "indent": 3,
      "text": "[RFC4924] discusses the forces working against transparent operation of the Internet; these clearly include legal interventions to restrict access to content. As that document notes, and as Section 4 of [RFC4084] states, such restrictions should be made explicit.",
      "ja": "[RFC4924]はインターネットの透明操作不利に働い力を議論します。これらは明らかにコンテンツへのアクセスを制限する法的な介入が含まれます。そのドキュメントノートとして、および[RFC4084]の状態の第4として、そのような制限が明示されるべきです。"
    },
    {
      "indent": 0,
      "text": "2. Requirements",
      "section_title": true,
      "ja": "2.要件"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. 451 Unavailable For Legal Reasons",
      "section_title": true,
      "ja": "3. 451法的な理由不可"
    },
    {
      "indent": 3,
      "text": "This status code indicates that the server is denying access to the resource as a consequence of a legal demand.",
      "ja": "このステータスコードは、サーバが法的需要の結果として、リソースへのアクセスを拒否していることを示しています。"
    },
    {
      "indent": 3,
      "text": "The server in question might not be an origin server. This type of legal demand typically most directly affects the operations of ISPs and search engines.",
      "ja": "問題のサーバーは、オリジンサーバではないかもしれません。法的需要のこのタイプは通常、最も直接的にISPや検索エンジンの操作に影響を与えます。"
    },
    {
      "indent": 3,
      "text": "Responses using this status code SHOULD include an explanation, in the response body, of the details of the legal demand: the party making it, the applicable legislation or regulation, and what classes of person and resource it applies to. For example:",
      "ja": "パーティーそれを作る、適用される法律や規制、そして人とリソースのどのようなクラスのそれはに適用されます。このステータスコードを使用して応答は法的な需要の内容のレスポンスボディで説明を、含むべきです。例えば："
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 451 Unavailable For Legal Reasons Link: <https://spqr.example.org/legislatione>; rel=\"blocked-by\" Content-Type: text/html",
      "ja": "HTTP / 1.1 451法的な理由リンクでは使用できません：<https://spqr.example.org/legislatione>。 REL = \"ブロックされた-により、\" コンテンツタイプ：text / htmlの"
    },
    {
      "indent": 3,
      "text": "<html> <head><title>Unavailable For Legal Reasons</title></head> <body> <h1>Unavailable For Legal Reasons</h1> <p>This request may not be serviced in the Roman Province of Judea due to the Lex Julia Majestatis, which disallows access to resources hosted on servers deemed to be operated by the People's Front of Judea.</p> </body> </html>",
      "ja": "<HTML> <HEAD> <TITLE>法律上の理由で利用できない</ TITLE> </ HEAD> <BODY> <H1>法律上の理由で利用できない</ H1> <p>この要求は、ユダヤの属州でサービスされない場合がありますサーバ上でホストされているリソースへのアクセスを禁止レックスジュリアMajestatis、のためにユダヤの人々の前面で操作されたとみなされます。</ p> </ body> </ html>この"
    },
    {
      "indent": 3,
      "text": "The use of the 451 status code implies neither the existence nor nonexistence of the resource named in the request. That is to say, it is possible that if the legal demands were removed, a request for the resource still might not succeed.",
      "ja": "451のステータスコードの使用は、要求で指定されたリソースの存在も存在しないでもないことを意味しています。つまり、法的な要求が削除された場合は、リソースの要求がまだ成功しない可能性がある、と言うことです。"
    },
    {
      "indent": 3,
      "text": "Note that in many cases clients can still access the denied resource by using technical countermeasures such as a VPN or the Tor network.",
      "ja": "多くの場合、クライアントはまだ、このようなVPNやTorネットワークなどの技術的な対策を使用して拒否されたリソースにアクセスできることに注意してください。"
    },
    {
      "indent": 3,
      "text": "A 451 response is cacheable by default, i.e., unless otherwise indicated by the method definition or explicit cache controls; see [RFC7234].",
      "ja": "451応答は、デフォルトでキャッシュ可能である、すなわち、そうでなければ、メソッド定義または明示的なキャッシュコントロールによって指示されない限り。 [RFC7234]を参照してください。"
    },
    {
      "indent": 0,
      "text": "4. Identifying Blocking Entities",
      "section_title": true,
      "ja": "4.ブロッキングエンティティの識別"
    },
    {
      "indent": 3,
      "text": "As noted above, when an attempt to access a resource fails with status 451, the entity blocking access might or might not be the origin server. There are a variety of entities in the resource-access path that could choose to deny access -- for example, ISPs, cache providers, and DNS servers.",
      "ja": "上述のようにリソースにアクセスしようとすると、ステータス451で失敗した場合、アクセスをブロックするエンティティは、またはオリジンサーバではないかもしれない可能性があります。たとえば、ISPは、キャッシュ・プロバイダー、およびDNSサーバー用 - アクセスを拒否することを選択することができるリソース・アクセス・パス内の様々なエンティティがあります。"
    },
    {
      "indent": 3,
      "text": "It is useful, when legal blockages occur, to be able to identify the entities actually implementing the blocking.",
      "ja": "法的詰まりが発生した場合には、実際にブロッキングを実装するエンティティを識別することができるように、便利です。"
    },
    {
      "indent": 3,
      "text": "When an entity blocks access to a resource and returns status 451, it SHOULD include a \"Link\" HTTP header field [RFC5988] whose value is a URI reference [RFC3986] identifying itself. When used for this purpose, the \"Link\" header field MUST have a \"rel\" parameter whose value is \"blocked-by\".",
      "ja": "実体ブロックがリソースにアクセスし、ステータス451を返す場合は、その値自体を識別するURI参照[RFC3986]である「リンク」HTTPヘッダフィールド[RFC5988]を含むべきです。この目的のために使用される場合、「リンク」ヘッダフィールドは、その値が「ブロック・バイ」が「REL」パラメータがなければなりません。"
    },
    {
      "indent": 3,
      "text": "The intent is that the header be used to identify the entity actually implementing blockage, not any other entity mandating it. A human-readable response body, as discussed above, is the appropriate location for discussion of administrative and policy issues.",
      "ja": "意図は、ヘッダエンティティ実際実装閉塞ではなく、それを義務付ける他のエンティティを識別するために使用されることです。人間可読応答本体は、上述したように、管理およびポリシーの問題の議論のために適切な位置です。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Clients cannot rely upon the use of the 451 status code. It is possible that certain legal authorities might wish to avoid transparency, and not only demand the restriction of access to certain resources, but also avoid disclosing that the demand was made.",
      "ja": "クライアントは、451のステータスコードの使用に頼ることはできません。特定の法的当局は、透明性を避けたい、とだけでなく、特定のリソースへのアクセスの制限を要求するだけでなく、需要がなされたことを開示避けるかもしれないということも可能です。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The HTTP Status Codes Registry has been updated with the following entry:",
      "ja": "：レジストリは次のエントリで更新されているHTTPステータスコード"
    },
    {
      "indent": 3,
      "text": "o Code: 451",
      "ja": "お こで： ４５１"
    },
    {
      "indent": 3,
      "text": "o Description: Unavailable For Legal Reasons",
      "ja": "O説明：法的な理由不可"
    },
    {
      "indent": 3,
      "text": "o Specification: RFC 7725",
      "ja": "O仕様：RFC 7725"
    },
    {
      "indent": 3,
      "text": "The Link Relation Type Registry has been updated with the following entry:",
      "ja": "リンク関係タイプレジストリは、次のエントリで更新されました："
    },
    {
      "indent": 3,
      "text": "o Relation Name: blocked-by",
      "ja": "Oリレーション名：ブロックされたバイ"
    },
    {
      "indent": 3,
      "text": "o Description: Identifies the entity that blocks access to a resource following receipt of a legal demand.",
      "ja": "O説明：ブロックは法的な需要を受けた後のリソースへのアクセスエンティティを識別します。"
    },
    {
      "indent": 3,
      "text": "o Reference: RFC 7725",
      "ja": "Oリファレンス：RFC 7725"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, DOI 10.17487/RFC3986, January 2005, <http://www.rfc-editor.org/info/rfc3986>.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、DOI 10.17487 / RFC3986、2005年1月<HTTP：/ /www.rfc-editor.org/info/rfc3986>。"
    },
    {
      "indent": 3,
      "text": "[RFC5988] Nottingham, M., \"Web Linking\", RFC 5988, DOI 10.17487/RFC5988, October 2010, <http://www.rfc-editor.org/info/rfc5988>.",
      "ja": "[RFC5988]ノッティンガム、M.、 \"ウェブリンク\"、RFC 5988、DOI 10.17487 / RFC5988、2010年10月、<http://www.rfc-editor.org/info/rfc5988>。"
    },
    {
      "indent": 3,
      "text": "[RFC7234] Fielding, R., Ed., Nottingham, M., Ed., and J. Reschke, Ed., \"Hypertext Transfer Protocol (HTTP/1.1): Caching\", RFC 7234, DOI 10.17487/RFC7234, June 2014, <http://www.rfc-editor.org/info/rfc7234>.",
      "ja": "[RFC7234]フィールディング、R.、エド、ノッティンガム、M.、エド、及びJ. Reschke、編、 \"ハイパーテキスト転送プロトコル（HTTP / 1.1）：キャッシュ\"。。。、RFC 7234、DOI 10.17487 / RFC7234、2014年6月、<http://www.rfc-editor.org/info/rfc7234>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC4084] Klensin, J., \"Terminology for Describing Internet Connectivity\", BCP 104, RFC 4084, DOI 10.17487/RFC4084, May 2005, <http://www.rfc-editor.org/info/rfc4084>.",
      "ja": "[RFC4084] Klensin、J.、 \"インターネット接続を記述するための用語\"、BCP 104、RFC 4084、DOI 10.17487 / RFC4084、2005年5月、<http://www.rfc-editor.org/info/rfc4084>。"
    },
    {
      "indent": 3,
      "text": "[RFC4924] Aboba, B., Ed. and E. Davies, \"Reflections on Internet Transparency\", RFC 4924, DOI 10.17487/RFC4924, July 2007, <http://www.rfc-editor.org/info/rfc4924>.",
      "ja": "[RFC4924] Aboba、B.、エド。そしてE.デイヴィス、 \"インターネット上の透明反射\"、RFC 4924、DOI 10.17487 / RFC4924、2007年7月、<http://www.rfc-editor.org/info/rfc4924>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Terence Eden, who observed that the existing status code 403 was not really suitable for this situation, and suggested the creation of a new status code.",
      "ja": "既存のステータスコード403は、このような状況のために本当に適していなかったことを観察し、新しいステータスコードの作成を提案しテレンス・エデン、に感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks also to Ray Bradbury.",
      "ja": "また、レイ・ブラッドベリのおかげ。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Tim Bray Textuality",
      "ja": "ティム・ブレイTextuality"
    },
    {
      "indent": 3,
      "text": "Email: tbray@textuality.com URI: http://www.tbray.org/ongoing/",
      "ja": "メール：tbray@textuality.com URI：http://www.tbray.org/ongoing/"
    }
  ]
}