{
  "title": {
    "text": "RFC 7832 - Application Bridging for Federated Access Beyond Web (ABFAB) Use Cases",
    "ja": "RFC 7832 - フェデレーションアクセスを超えたWebのアプリケーションブリッジング（ABFAB）は、ユースケース"
  },
  "number": 7832,
  "created_at": "2019-11-02 12:11:29.635584+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                     R. Smith, Ed.\nRequest for Comments: 7832                                          Jisc\nCategory: Informational                                         May 2016\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 1,
      "text": "Application Bridging for Federated Access Beyond Web (ABFAB) Use Cases",
      "ja": "フェデレーションアクセスを超えたWebのアプリケーションブリッジング（ABFAB）は、ユースケース"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Federated identity is typically associated with web-based services at present, but there is growing interest in its application in non-web-based contexts. The goal of this memo is to document a selection of the wide variety of these contexts whose user experience could be improved through the use of technologies based on the Application Bridging for Federated Access Beyond web (ABFAB) architecture and specifications.",
      "ja": "連携アイデンティティは、典型的には、本では、ウェブベースのサービスに関連しているが、非Webベースのコンテキストへの応用に対する関心が高まっています。このメモの目標は、ユーザー体験フェデレーションアクセスを超えウェブ（ABFAB）アーキテクチャおよび仕様については、ブリッジングアプリケーションに基づいた技術を使用して改善することができ、これらの様々な文脈の選択を文書化することです。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7832.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7832で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Context of Use Cases ............................................3\n3. Use Cases .......................................................3\n   3.1. Cloud Services .............................................3\n        3.1.1. Cloud-Based Application Services ....................4\n        3.1.2. Cloud-Based Infrastructure Services .................5\n   3.2. High-Performance Computing .................................6\n   3.3. Grid Infrastructure ........................................6\n   3.4. Databases and Directories ..................................7\n   3.5. Media Streaming ............................................8\n   3.6. Printing ...................................................9\n   3.7. Accessing Applications from Devices on a Telecoms\n        Infrastructure .............................................9\n   3.8. Enhanced Security Services for S/MIME .....................10\n   3.9. Smart Objects .............................................11\n4. Security Considerations ........................................11\n5. References .....................................................12\n   5.1. Normative References ......................................12\n   5.2. Informative References ....................................12\nAcknowledgments ...................................................13\nContributors ......................................................13\nAuthor's Address ..................................................13",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Federated identity facilitates the controlled sharing of information about people (a.k.a. \"principals\"), commonly across organizational boundaries. This avoids redundant registration of principals who operate in and across multiple domains, both reducing the administrative overhead for the organizations involved and improving the usability of systems for the principal. Simultaneously, it can also help address privacy-related concerns, along with the regulatory and statutory requirements of some jurisdictions.",
      "ja": "連携アイデンティティは、一般的に組織の境界を越えて、人々の情報の制御共有（別称、「プリンシパル」）を容易にします。これは、両方の関与する組織のための管理オーバーヘッドを低減し、プリンシパルのシステムの使い勝手を向上させる、および複数のドメインにわたって動作主体の冗長登録を回避します。同時に、それはまた、いくつかの法域の規制や法的要件に伴い、アドレスプライバシー関連の問題を助けることができます。"
    },
    {
      "indent": 3,
      "text": "The information that is passed between organizations may include authentication state and identity information that can be used for many purposes, including making access management decisions. A number of mechanisms support the transmission of this information for web-based scenarios in particular (e.g., the Security Assertion Markup Language (SAML) [OASIS.saml-profiles-2.0-os]), but there is significant interest in the more general application of federated identity to include non-web use cases. This document enumerates some of these use cases, describing how technologies based on the ABFAB architecture [RFC7831] and specifications could be used.",
      "ja": "組織間で渡される情報には、アクセス管理の決定を行うことを含む多くの目的に使用することができる認証状態とアイデンティティ情報を含むことができます。機構の数は、特にウェブベースのシナリオのためのこの情報の送信をサポートする（例えば、セキュリティアサーションマークアップ言語（SAML）[OASIS.saml-プロファイル-2.0-OS]）が、より一般的には大きな関心があります連携アイデンティティのアプリケーションは非Webの使用事例を含めます。この文書はABFABアーキテクチャ[RFC7831]や仕様に基づいた技術を使用することができる方法を説明する、これらのユースケースをいくつか列挙します。"
    },
    {
      "indent": 0,
      "text": "2. Context of Use Cases",
      "section_title": true,
      "ja": "ユースケースの2コンテキスト"
    },
    {
      "indent": 3,
      "text": "The use cases described in this document are a result of work led by Jisc, the operator of the United Kingdom's education and research network, responding to requirements from its community. These use cases have also been augmented by various inputs from the IETF community.",
      "ja": "このドキュメントで説明するユースケースは、そのコミュニティからの要求に応え、JISC、イギリスの教育・研究ネットワークのオペレータが率いる作業の結果です。これらのユースケースは、IETFコミュニティからの各種入力によって拡張されています。"
    },
    {
      "indent": 3,
      "text": "The ABFAB architecture and specifications enables authentication and authorization to occur across organizational boundaries. For many applications, principals need not have pre-instantiated accounts that their federated identity maps to before their first visit to that application; the application can perform this process on the fly. In cases where such accounts are required for particular applications, the pre-provisioning process is out of scope; the ABFAB technology assumes that any such requirements have already been fulfilled. Standards-based work of note that would assist with this pre-provisioning of accounts includes the standards and specifications produced by the IETF SCIM working group.",
      "ja": "ABFABアーキテクチャおよび仕様は組織の境界を越えて発生することが認証および承認を可能にします。多くのアプリケーションでは、校長は、その連携アイデンティティは、そのアプリケーションへの最初の訪問の前にマップするアカウントを事前にインスタンス化されている必要はありません。アプリケーションは、その場でこの処理を行うことができます。そのようなアカウントが特定の用途に必要とされる場合には、前プロビジョニングプロセスが範囲外です。 ABFAB技術は、このような要件がすでに満たされていることを前提としています。アカウントのこの事前プロビジョニングを支援するノートの標準ベースの仕事はIETF SCIMワーキンググループによって作成基準および仕様が含まれています。"
    },
    {
      "indent": 0,
      "text": "3. Use Cases",
      "section_title": true,
      "ja": "3.ユースケース"
    },
    {
      "indent": 3,
      "text": "This section describes some of the various potential use cases where technologies based on the ABFAB architecture and specifications could help improve the user experience; each includes a brief description of how current technologies attempt to solve the use cases and how this could be improved upon by ABFAB implementations.",
      "ja": "このセクションでは、ユーザーエクスペリエンスの向上に役立つ可能性が技術ABFABアーキテクチャや仕様に基づいて、さまざまな潜在的なユースケースのいくつかについて説明します。各ユースケースを解決しようとどのようにこれがABFAB実装によって大幅に改善することができる方法を現在の技術の簡単な説明を含みます。"
    },
    {
      "indent": 0,
      "text": "3.1. Cloud Services",
      "section_title": true,
      "ja": "3.1. クラウドサービス"
    },
    {
      "indent": 3,
      "text": "Cloud computing is emerging as a common way of provisioning infrastructure services in an on-demand manner. These services are typically offered as one of three models:",
      "ja": "クラウドコンピューティングは、オンデマンド方式でインフラストラクチャサービスをプロビジョニングする一般的な方法として浮上しています。これらのサービスは、通常、3つのモデルの一つとして提供されています。"
    },
    {
      "indent": 3,
      "text": "o General infrastructure services such as computing power, networks, storage, and utilities (\"Infrastructure as a Service\", or IaaS);",
      "ja": "このような電源、ネットワーク、ストレージ、およびユーティリティ（「サービスとしてのインフラストラクチャ」、またはIaaSの）を計算としてO総合インフラストラクチャサービス。"
    },
    {
      "indent": 3,
      "text": "o Software stacks or platforms such as database servers, web servers, and application runtime environments (\"Platform as a Service\", or PaaS);",
      "ja": "ソフトウェア・スタックや、データベースサーバー、Webサーバー、およびアプリケーションのランタイム環境（「プラットフォームサービスとして」、またはのPaaS）などのプラットフォームO;"
    },
    {
      "indent": 3,
      "text": "o Common application software such as email, shared storage, business applications such as Customer Relationship Management (CRM), or scientific applications (\"Software as a Service\", or SaaS).",
      "ja": "電子メール、共有ストレージは、そのような顧客関係管理（CRM）、または科学アプリケーション（「サービスとしてのソフトウェア」、またはSaaS型）などのビジネスアプリケーションなどのO共通のアプリケーションソフトウェア。"
    },
    {
      "indent": 3,
      "text": "In many cases, the provisioned cloud infrastructures and applications need to be integrated with existing infrastructure of the organization, and it is of course desirable if this could be achieved in a way that allows business or scientific workflows to act across infrastructure -- both across the cloud and in the local infrastructure -- in as seamless a manner as possible.",
      "ja": "多くの場合、プロビジョニングされたクラウドインフラストラクチャとアプリケーションは、組織の既存のインフラストラクチャと統合する必要があり、これは、インフラストラクチャ全体で行動するビジネスや科学的なワークフローを可能にする方法で達成することができれば、それはもちろん望ましい - 間の両方でクラウドとローカルのインフラ - 可能な限りシームレスな方法インチ"
    },
    {
      "indent": 3,
      "text": "There are two main areas where federated access fits in cloud computing:",
      "ja": "フェデレーションアクセスは、クラウド・コンピューティングに収まる2つの分野があります。"
    },
    {
      "indent": 3,
      "text": "o Using federation to help mediate access to cloud-based application services (e.g., cloud-provided email or CRM systems);",
      "ja": "クラウドベースのアプリケーション・サービス（例えば、クラウドが提供する電子メールやCRMシステム）へのアクセスを仲介支援するためにフェデレーションを使用し、O。"
    },
    {
      "indent": 3,
      "text": "o Using federation to help mediate access to the management of cloud-based infrastructure services.",
      "ja": "クラウドベースのインフラストラクチャサービスの管理へのアクセスを仲介支援するためにフェデレーションを使用し、O。"
    },
    {
      "indent": 0,
      "text": "3.1.1. Cloud-Based Application Services",
      "section_title": true,
      "ja": "3.1.1. クラウドベースのアプリケーションサービス"
    },
    {
      "indent": 3,
      "text": "Many organizations are seeking to deliver services to their users through the use of providers based in the \"cloud\". This is typically motivated by a desire to avoid management and operation of commodity services that, through economies of scale and so forth, can often be delivered more efficiently by such providers.",
      "ja": "多くの組織では、「クラウド」に基づいて、プロバイダを使用してそのユーザーにサービスを提供しようとしています。これは典型的には、規模の経済を通り、等々、多くの場合、プロバイダによって、より効率的に配信できる商品・サービスの管理・運用を回避するための欲求によって動機づけされます。"
    },
    {
      "indent": 3,
      "text": "Many providers already provide web-based access using conventional federated authentication mechanisms -- for example, outsourced email provision where federated access is enabled using \"webmail\" applications where access is mediated through the use of SAML [OASIS.saml-profiles-2.0-os]. This use of federated authentication enables organizations that consume cloud services to more efficiently orchestrate the delivery of these services to their users and also enables single sign-on to the services for these users.",
      "ja": "OASIS.saml-プロファイル-2.0-OS [例えば、フェデレーションアクセスはアクセスがSAMLを使用することによって媒介される「ウェブメール」アプリケーションを使用して有効になっている外部委託の電子メールの提供 - 多くのプロバイダは、すでに従来のフェデレーション認証メカニズムを使用して、Webベースのアクセスを提供します]。フェデレーション認証の使用は、より効率的にユーザーにこれらのサービスの提供を編成し、またこれらのユーザーのサービスへのシングルサインオンを可能にするクラウドサービスを消費することが可能になります。"
    },
    {
      "indent": 3,
      "text": "Frequently, however, users will prefer to use desktop applications that do not use web (i.e., based on HTTP) protocols. For example, a desktop email client may use a variety of non-web protocols, including SMTP [RFC5321], IMAP [RFC3501], and the Post Office Protocol (POP) [RFC1939]. Some cloud providers support access to their services using non-web protocols; however, the authentication mechanisms used by these protocols will typically require that the provider has access to the user's credentials -- i.e., non-federated. Consequently, the provider will require that users' credentials are regularly synchronized from the user organization to the provider, with the obvious overhead this imparts on the organization along with the obvious implications for security and privacy, or else be provisioned directly by the provider to the user.",
      "ja": "しばしば、しかし、ユーザーがウェブを使用しないデスクトップアプリケーションを使用することを好むだろう（つまり、HTTPに基づく）のプロトコル。たとえば、デスクトップメールクライアントがSMTP [RFC5321]、IMAP [RFC3501]、およびポストオフィスプロトコル（POP）[RFC1939]を含む、非Webプロトコルの様々なを使用することができます。非Webプロトコルを使用して、そのサービスへのいくつかのクラウドプロバイダーのサポートアクセス。すなわち、非連合 - しかし、これらのプロトコルで使用される認証メカニズムは、通常、プロバイダがユーザーの資格情報へのアクセス権を持っている必要があります。その結果、プロバイダは、ユーザーの資格情報が定期的にこれは、セキュリティとプライバシーのための明白な意味合いとともに、組織に与える明白なオーバーヘッドで、プロバイダにユーザ組織から同期されている、または他のプロバイダによって直接プロビジョニングされている必要がありますユーザー。"
    },
    {
      "indent": 3,
      "text": "The latter approach of directly provisioning accounts may be acceptable in the case where an organization has relationships with only a small number of providers, but this approach may become untenable if an organization obtains services from many providers. Consequently, any organization with a requirement to use non-web protocols would prefer to make use of the credentials that they have already provisioned their users with, and to utilize federated authentication with non-web protocols to obtain access to cloud-based providers.",
      "ja": "直接プロビジョニングアカウントの後者のアプローチは、組織がプロバイダのわずか数との関係を有する場合には許容されるかもしれないが、組織は多くのプロバイダからサービスを取得する場合には、このアプローチは、理不尽になることができます。その結果、非Webプロトコルを使用するための要件にどのような組織は、彼らがすでにで自分のユーザーをプロビジョニングしている資格情報を使用するために、クラウドベースのプロバイダへのアクセスを得るために、非Webプロトコルと連携認証を利用することを好むだろう。"
    },
    {
      "indent": 3,
      "text": "ABFAB could help in this context, as its specifications would enable federated authentication for a variety of non-web protocols, thus gaining the benefits of federated authentication without any of the drawbacks that are currently experienced.",
      "ja": "その仕様は、このように現在経験している欠点のいずれかのなしフェデレーション認証のメリットを得て、非Webプロトコルのさまざまなフェデレーション認証を可能にするようABFABは、この文脈で助けることができます。"
    },
    {
      "indent": 0,
      "text": "3.1.2. Cloud-Based Infrastructure Services",
      "section_title": true,
      "ja": "3.1.2. クラウドベースのインフラストラクチャサービス"
    },
    {
      "indent": 3,
      "text": "Typical IaaS or PaaS cloud use cases deal with provisioning on-demand cloud-based infrastructure services that may include infrastructure components such as computing and storage resources, network infrastructure, and other utilities. Cloud-based virtualized applications should ideally operate in the same way as regular non-virtualized applications whilst allowing management of the virtual computing resources (scaling, migration, reconfiguration) without changing the management applications.",
      "ja": "典型的なのIaaSまたはPaaSのクラウド・ユースケースは、コンピューティングリソースとストレージリソース、ネットワークインフラストラクチャ、およびその他のユーティリティのようなインフラストラクチャコンポーネントを含むことができるプロビジョニングオンデマンドのクラウドベースのインフラストラクチャサービスを扱います。クラウド・ベースの仮想化アプリケーションは、理想的には、管理アプリケーションを変更することなく、仮想コンピューティングリソース（スケーリング、移動、再構成）の管理を許可する一方で、通常の非仮想化アプリケーションと同じように動作する必要があります。"
    },
    {
      "indent": 3,
      "text": "In many cases, moving applications or platforms to the cloud may require their redesigning/refactoring to support dynamic deployment and configuration, including their security services, and authentication and authorization services. These will typically today be extensively based on manual setup and configuration of such components and features as trusted certificates and trust anchors, authorities and trusted services (both their location and certificates), attribute namespaces, and policies.",
      "ja": "多くの場合、クラウドへのアプリケーションやプラットフォームを移動すると、ダイナミックな展開と構成、彼らのセキュリティサービスを含め、認証および認可サービスをサポートするために再設計/リファクタリングが必要な場合があります。これらは、典型的には、今日は広範囲に信頼できる証明書およびトラストアンカー、当局との信頼できるサービス（その場所と証明書の両方）、属性の名前空間、およびポリシーなどのコンポーネントと機能を手動で設定および構成に基づいて行われます。"
    },
    {
      "indent": 3,
      "text": "ABFAB could help in this context as a way of moving from the model of manually configured authentication and authorization towards a more easily managed system involving federated trust and identity, and ABFAB will be applicable for a wide range of existing features (e.g., connecting to a newly provisioned Virtual Machine through ABFAB-enabled Secure Shell (SSH) [RFC4251] instead of having to manually manage an administrative login to that machine).",
      "ja": "例えば、への接続（ABFABは、フェデレーション信頼とアイデンティティを含む、より簡単に管理対象システムへの手動で設定された認証および承認のモデルから移動する方法として、この文脈で助けることができる、とABFABは、既存の機能の広い範囲のために適用されますABFAB対応のSecure Shell（SSH）を介して、新しくプロビジョニングされた仮想マシンの[RFC4251]の代わりに、手動でそのマシンへの管理ログインを管理することの）。"
    },
    {
      "indent": 0,
      "text": "3.2. High-Performance Computing",
      "section_title": true,
      "ja": "3.2. 高性能コンピューティング"
    },
    {
      "indent": 3,
      "text": "High-Performance Computing (HPC) is a discipline that uses supercomputers and computer clusters to solve complex computation problems; it is most commonly associated with scientific research or computational science.",
      "ja": "高性能コンピューティング（HPC）は、複雑な計算問題を解決するためにスーパーコンピュータやコンピュータ・クラスタを使用して規律あります。それは、最も一般的に科学的研究や計算科学に関連しています。"
    },
    {
      "indent": 3,
      "text": "Access to HPC resources, often mediated through technologies such as SSH, is typically managed through the use of user digital certificates [RFC5280] or through manually provisioned credentials and accounts. This requires HPC operators to issue certificates or accounts to users using a registration process that often duplicates identity management processes that already exist within most user organizations. The HPC community would like to utilize federated identity to perform both the user registration and authentication functions required to use HPC resources, and so reduce costs by avoiding this duplication of effort.",
      "ja": "多くの場合、SSHなどの技術を介して媒介HPCリソースへのアクセスは、通常、ユーザーのデジタル証明書[RFC5280]を使用して、または手動でプロビジョニング証明書と口座を通じて管理されています。これは、多くの場合、すでにほとんどのユーザーの組織内に存在するアイデンティティ管理プロセスを複製登録プロセスを使用して、ユーザーに証明書または口座を発行するHPC事業者が必要です。 HPCコミュニティは、HPCリソースを使用するために必要なユーザー登録と認証の両方の機能を実行するために連携アイデンティティを利用し、その努力のこの重複を避けることで、コストを削減したいと思います。"
    },
    {
      "indent": 3,
      "text": "The HPC community also have the following additional requirements:",
      "ja": "HPCコミュニティはまた、以下の追加要件があります。"
    },
    {
      "indent": 3,
      "text": "o Improve business continuity: In the event of operational issues at an HPC system at one organization (for example, a power failure), users and jobs could be transparently moved to other HPC systems without the overhead of having to manage user credentials for multiple organizations;",
      "ja": "Oビジネス継続性の向上：1つの組織（例えば、停電）でのHPCシステムでの運用上の問題が発生した場合、ユーザーおよびジョブは透過的に複数の組織のためのユーザーの資格情報を管理することのオーバーヘッドなし他のHPCシステムに移動することができ;"
    },
    {
      "indent": 3,
      "text": "o Establish \"HPC as a service\": Many organizations who have invested in HPC systems want to make their systems easily available to external customers. Federated authentication facilitates this by enabling these customers to use their existing identity management, user credentialing, and support processes;",
      "ja": "O「サービスとしてHPC」を設立：HPCシステムに投資している多くの組織は、外部顧客に対する彼らのシステムを簡単に利用できるようにしたいです。フェデレーテッド認証は、既存のID管理、ユーザーの資格認定、およびサポートプロセスを使用するために、これらの顧客を可能にすることによって、これを容易にし、"
    },
    {
      "indent": 3,
      "text": "o Improve the user experience: Authentication to HPC systems is normally performed using user digital certificates, which some users find difficult to use. Federated authentication can provide a better user experience by allowing the use of other types of credentials, without requiring technical modifications to the HPC system to support these.",
      "ja": "Oユーザーエクスペリエンスを向上：HPCシステムへの認証は、通常、一部のユーザーが使用することは困難見つけ、ユーザーのデジタル証明書を使用して実行されます。フェデレーテッド認証は、これらをサポートするために、HPCシステムに技術的な変更を必要とせずに、資格情報の他の種類の使用を可能にすることにより、より優れたユーザーエクスペリエンスを提供することができます。"
    },
    {
      "indent": 3,
      "text": "ABFAB could help in this context, as it could enable federated authentication for many of the protocols and technologies currently in use by HPC providers, such as SSH.",
      "ja": "それは現在、SSHなどのHPCプロバイダー、によって使用されているプロトコルや技術の多くのための連合の認証を可能にすることができるようABFABは、この文脈で助けることができます。"
    },
    {
      "indent": 0,
      "text": "3.3. Grid Infrastructure",
      "section_title": true,
      "ja": "3.3. グリッド・インフラストラクチャ"
    },
    {
      "indent": 3,
      "text": "Grids are large-scale distributed infrastructures, consisting of many loosely coupled, independently managed, and geographically distributed resources managed by organizationally independent providers. Users of grids utilize these resources using grid middleware that allows them to submit and control computing jobs, manipulate datasets, communicate with other users, etc. These users are organized into Virtual Organizations (VOs); each VO represents a group of people working collaboratively on a common project. VOs facilitate both the management of their users and the meditation of agreements between their users and resource providers.",
      "ja": "グリッドは、組織的に独立プロバイダによって管理される、疎結合多くの独立して管理し、地理的に分散したリソースからなる、大規模な分散型インフラストラクチャです。グリッドのユーザーはそれらを提出し、コンピューティングジョブを制御、データセットを操作し、これらのユーザーは、仮想組織（VOS）に編成されているなど、他のユーザーと通信することを可能にするグリッドミドルウェアを使用してこれらのリソースを活用します。各VOは、共通のプロジェクトに共同で働く人々のグループを表します。 VOSがそのユーザーの管理とそのユーザーとリソースプロバイダ間の契約の瞑想の両方を促進します。"
    },
    {
      "indent": 3,
      "text": "Authentication and authorization within most grids are performed using a Public Key Infrastructure, requiring each user to have an X.509 public-key certificate [RFC5280]. Authentication is performed through ownership of a particular certificate, while authorization decisions are made based on the user's identity (derived from their X.509 certificate), membership of a particular VO, or additional information assigned to a user by a VO. While efficient and scalable, this approach has been found wanting in terms of usability -- many users find certificates difficult to manage, for various reasons.",
      "ja": "ほとんどのグリッド内の認証と承認は、X.509公開鍵証明書[RFC5280]を持っている各ユーザーが必要な、公開鍵インフラストラクチャを使用して実行されます。認証は、許可の決定は、ユーザーのIDに基づいて行われているが、特定のVOのメンバーシップ、またはVOによってユーザに割り当てられた追加情報を（自分のX.509証明書から得られる）、特定の証明書の所有権を介して行われます。効率的でスケーラブルなものの、このアプローチは、使いやすさの面で欠けて発見されている - 多くのユーザーは、様々な理由のための管理が難しいの証明書を、見つけます。"
    },
    {
      "indent": 3,
      "text": "One approach to ameliorating this issue, adopted to some extent by some grid communities already, is to abstract away direct access to certificates from users, instead using alternative authentication mechanisms and then converting the credential provided by these into standard grid certificates. Some implementations of this idea use existing federated authentication techniques. However, current implementations of this approach suffer from a number of problems, not the least of which is the inability to use the federated credentials used to authenticate to a credential-conversion portal to also directly authenticate to non-web resources such as SSH daemons.",
      "ja": "すでにいくつかのグリッド・コミュニティによってある程度採用し、この問題を、改善するための一つのアプローチは、代わりに、代替の認証メカニズムを使用して、標準のグリッド証明書にこれらが提供する資格を変換すると、ユーザーからの証明書の抽象化の直接アクセスすることです。このアイデアのいくつかの実装では、既存のフェデレーション認証技術を使用しています。しかし、このアプローチの現在の実装では、直接、そのようなSSHデーモンなどの非Webリソースへの認証に資格変換ポータルへの認証に使用するフェデレーション資格情報を使用することができないことであるない以上、そのうちの多くの問題に苦しんでいます。"
    },
    {
      "indent": 3,
      "text": "The ability to use federated authentication directly through ABFAB, without the use of a credential-conversion service, would allow users to authenticate to a grid and its associated services, allowing them to directly launch and control computing jobs, all without having to manage, or even see, an X.509 public-key certificate at any point in the process. Authorization within the grid would still be performed using VO membership as asserted by the user's Identity Provider (IdP) through the federated transport.",
      "ja": "資格・変換サービスを使用せずに、ABFABから直接フェデレーション認証を使用する機能は、ユーザーがすべて管理することなく、それらを直接起動し、ジョブを計算し制御することができ、グリッドおよびその関連サービスへの認証できるようになる、またはでも、プロセスの任意の時点で、X.509公開鍵証明書を参照してください。連合輸送を介してユーザのアイデンティティプロバイダ（IDP）によってアサートとしてグリッド内の承認はまだVOメンバーシップを使用して実行されるであろう。"
    },
    {
      "indent": 0,
      "text": "3.4. Databases and Directories",
      "section_title": true,
      "ja": "3.4. データベースとディレクトリ"
    },
    {
      "indent": 3,
      "text": "Databases (e.g., MySQL, PostgreSQL, Oracle) and directory technologies (e.g., OpenLDAP (http://www.openldap.org/), Microsoft Active Directory, Novell eDirectory) are very commonly used within many organizations for a variety of purposes. Such purposes can include core administrative functions, such as hosting identity information for its users, as well as business functions (e.g., student records systems at educational organizations).",
      "ja": "データベース（例えば、MySQLの、PostgreSQLの、オラクル）およびディレクトリ技術（例えば、OpenLDAPの（http://www.openldap.org/）、Microsoft Active Directoryの、Novell eDirectoryのは）非常に一般的に、様々な目的のために、多くの組織内で使用されています。このような目的は、（例えば、学生が教育機関でシステムを記録した）コア行政などそのユーザーのID情報をホストとして機能し、だけでなく、ビジネス機能を含めることができます。"
    },
    {
      "indent": 3,
      "text": "Access to such database and directory systems is usually provided for internal users only; however, users external to the organizations sometimes require access to these systems directly -- for example, external examiners in educational organizations requiring access to student records systems, members of cross-organizational project teams who store information in a particular organization's systems, and external auditors.",
      "ja": "このようなデータベースやディレクトリのシステムへのアクセスは、通常、内部ユーザーのみに提供されます。しかし、組織の外部のユーザーが、時には直接、これらのシステムへのアクセスを必要とする - 例えば、教育機関における外部審査官は生徒の記録システム、特定の組織のシステムに情報を格納、組織横断的なプロジェクトチームのメンバー、および外部監査人へのアクセスを必要とします。"
    },
    {
      "indent": 3,
      "text": "Credentials for users either internal or external to the organization that allow access to these databases and directories are usually provisioned manually within an organization, either using identity management technologies or through more manual processes. For the internal users, this situation is fine -- this is one of the mainstays of identity management. However, for external users who require access, this represents more of a problem for organizational processes. The organization has to either (1) add these external users to its internal identity management systems or (2) provision these credentials directly within the database/directory systems and continue to manage them, including appropriate access controls associated with each credential, for the lifetime of that credential.",
      "ja": "これらのデータベースとディレクトリへのアクセスを許可し、組織の内部または外部のユーザーの資格情報は、通常、アイデンティティ管理技術を使用して以上の手動プロセスのいずれかを介して、組織内で手動でプロビジョニングされています。内部ユーザーの場合、このような状況は結構です - これは、ID管理の柱の一つです。しかし、アクセスを必要とする外部ユーザーのために、これは組織のプロセスのための問題の多くを表します。組織は、（1）寿命のために、それぞれの資格に関連する適切なアクセス制御を含め、その内部のID管理システムまたは（2）規定のデータベース/ディレクトリシステム内で直接これらの資格にこれらの外部ユーザーを追加し、それらを管理し続けることがありますその資格の。"
    },
    {
      "indent": 3,
      "text": "Federated authentication to databases or directories, via ABFAB technologies, would improve upon this situation, as it would remove the need to provision and de-provision credentials to access these systems. Organizations may still wish to manually manage access control of federated identities; however, even this could be provided through federated means, if the trust relationship between organizations was strong enough for the organization providing the service to rely upon it for this purpose.",
      "ja": "それは、これらのシステムにアクセスするための準備に必要とデプロビジョニングの資格情報を削除すると同じようにABFAB技術を経由してデータベースやディレクトリへのフェデレーション認証は、この状況に改善するだろう。組織はまだ手動で連携アイデンティティのアクセス制御を管理することを望むかもしれません。組織間の信頼関係は、この目的のためにそれに依存しているためにサービスを提供する組織のための十分な強さだった場合しかし、これでも、連合の手段を通じて提供することができます。"
    },
    {
      "indent": 0,
      "text": "3.5. Media Streaming",
      "section_title": true,
      "ja": "3.5. メディアストリーミング"
    },
    {
      "indent": 3,
      "text": "Media streaming services (audio or audio/video) are often provided publicly to anonymous users, but authentication is important for a protected subset of streams where rights management and access control must be applied.",
      "ja": "メディアストリーミングサービス（オーディオまたはオーディオ/ビデオ）は、多くの場合、匿名ユーザーに公的に提供されていますが、認証には、著作権管理とアクセス制御を適用しなければならないストリームの保護されたサブセットのために重要です。"
    },
    {
      "indent": 3,
      "text": "Streams can be delivered via protocols that already include authentication, such as the Real Time Streaming Protocol (RTSP) [RFC2326] or RTP [RFC3550], or can be published in an encrypted form with keys only being distributed to trusted users. Federated authentication is applicable to both of these cases.",
      "ja": "ストリームは、リアルタイムストリーミングプロトコル（RTSP）[RFC2326]やRTP [RFC3550]のように、すでに認証を含めるプロトコルを介して配信することができ、あるいは信頼できるユーザーのみに配布されているキーで暗号化された形で公開することができます。フェデレーテッド認証は、これらの例の両方に適用可能です。"
    },
    {
      "indent": 3,
      "text": "Alternative mechanisms to managing access exist -- for example, an approach where a unique stream URI is minted for each user. However, this relies on preserving the secrecy of the stream URI and also requires a communication channel between the web page used for authentication and the streaming service itself. Federated authentication would be a better fit for this kind of access control. Thus, ABFAB technologies that allow federated authentication directly within (inherently non-web) media streaming protocols would represent an enhancement to this area.",
      "ja": "アクセスを管理する代替のメカニズムが存在する - 例えば、固有のストリームURIは、ユーザ毎に鋳造されているアプローチ。しかし、これは、ストリームURIの機密性を維持し、また、認証およびストリーミングサービス自体のために使用されるWebページ間の通信チャネルを必要に依存しています。フェデレーテッド認証は、アクセス制御のこの種のためのより良いフィット感だろう。このように、直接（本質的に非Web）メディアストリーミングプロトコル内フェデレーション認証を許可ABFAB技術は、この領域の拡張を表します。"
    },
    {
      "indent": 0,
      "text": "3.6. Printing",
      "section_title": true,
      "ja": "3.6. 印刷"
    },
    {
      "indent": 3,
      "text": "A visitor from one organization to the premises of another often requires the use of print services. Their home organization may of course offer printing, but the output could be a long way away, so the home service is not useful. The user will typically want to print from within a desktop or mobile application.",
      "ja": "別の敷地内にある組織からの訪問者は、多くの場合、印刷サービスを使用する必要があります。自宅の組織は、コースの提供印刷のかもしれませんが、ホームサービスは有用ではありませんので、出力は、長い道のり離れた可能性があります。ユーザーは通常、デスクトップやモバイルアプリケーション内から印刷したいでしょう。"
    },
    {
      "indent": 3,
      "text": "Where this service is currently offered, it would usually be achieved through the use of \"open\" printers (i.e., printers that allow anonymous print requests), where printer availability is advertised through the use of Bonjour or other similar protocols. If the organization requires authenticated print requests (usually for accounting purposes), the visitor would usually have to be given credentials that allow this, often supplemented with pay-as-you-go style payment systems.",
      "ja": "このサービスは現在提供されている場合、それは通常、プリンタの可用性はボンジュールまたは他の同様のプロトコルを使用して広告を出している「オープン」のプリンタ（匿名の印刷要求を許可する、すなわち、プリンタ）の使用によって達成されるであろう。組織が（通常は会計目的のために）認証された印刷要求を必要とする場合、訪問者は通常、これを許可する資格情報を与えなければならない、多くの場合、従量制スタイルの決済システムを補いました。"
    },
    {
      "indent": 3,
      "text": "Adding federated authentication to the Internet Printing Protocol (IPP) [RFC2911] (and other relevant protocols) would enable this kind of remote printing service without the administrative overhead of credentialing these visitors (who, of course, may well be one-time visitors to the organization). This would be immediately applicable to higher education, where this use case is increasingly important thanks to the success of federated network authentication systems such as eduroam (https://www.eduroam.org), but could also be used in other contexts such as commercial print kiosks, or in large heterogeneous organizations.",
      "ja": "インターネット印刷プロトコル（IPP）[RFC2911]（および他の関連するプロトコル）にフェデレーション認証を追加することはもちろん、よく1回の訪問者であってもよいし、これらの訪問者を（資格認定の管理オーバーヘッドなしでリモート印刷この種のサービスを可能にします組織）。これは、このユースケースは、eduroam（https://www.eduroam.org）として連携ネットワーク認証システムの成功にますます重要おかげですが、また、のような他のコンテキストで使用することができ高等教育にすぐに適用可能です商用印刷キオスク、または大規模な異種組織インチ"
    },
    {
      "indent": 0,
      "text": "3.7. Accessing Applications from Devices on a Telecoms Infrastructure",
      "section_title": true,
      "ja": "3.7. 電気通信インフラストラクチャ上のデバイスからアプリケーションへのアクセス"
    },
    {
      "indent": 3,
      "text": "Telecom operators typically have the following properties:",
      "ja": "通信事業者は、一般的に、次のプロパティがあります。"
    },
    {
      "indent": 3,
      "text": "o A large collection of registered users, many of whom may have identities registered to a fairly high level of assurance (often for payment purposes). However, not all users will have this property -- for example, non-contract customers on mobile telecoms infrastructures in countries with low levels of identity registration requirements.",
      "ja": "O（支払目的のために、多くの場合）保証のかなり高いレベルに登録されたIDを持つことがあり、多くの人の登録ユーザー、の大規模なコレクション。ただし、すべてのユーザーが、この性質を持つことになりません - 例えば、非契約顧客のID登録要件のレベルが低い国でのモバイル電気通信インフラ上。"
    },
    {
      "indent": 3,
      "text": "o An existing network infrastructure capable of authenticating a device (e.g., a cellphone or an Asymmetric Digital Subscriber Line (ADSL) router) and, by inference, its owner.",
      "ja": "デバイス（例えば、携帯電話または非対称デジタル加入者線（ADSL）ルータ）を認証することが可能な既存のネットワークインフラoおよび、推論により、その所有者。"
    },
    {
      "indent": 3,
      "text": "o A large collection of applications (both web-based and non-web-based) that its users wish to access using their devices. These applications could be hosted by the telecom operator directly, or they could be any application or system on the internet -- for example, network messaging services, VoIP, or email.",
      "ja": "アプリケーションの大規模なコレクション（ウェブベースおよび非Webベースの両方）Oそのユーザーがデバイスを使用してアクセスしたいということ。これらのアプリケーションは、直接、通信事業者が主催することができ、またはそれらは、インターネット上の任意のアプリケーションやシステムかもしれない - 例えば、ネットワーク・メッセージング・サービス、VoIPの、または電子メール。"
    },
    {
      "indent": 3,
      "text": "At present, authentication to these applications will be typically configured manually by the user on the device (or on a different device connected to that device) by inputting their (usually pre-provisioned out of band) credentials for that application -- one per application.",
      "ja": "現在のところ、これらのアプリケーションへの認証は、典型的には、デバイス上のユーザによって手動で設定され、そのアプリケーションのために、それらの（通常は帯域外で事前プロビジョニング）の資格情報を入力することにより（またはそのデバイスに接続された別のデバイス上） - アプリケーションごとに1つずつ。"
    },
    {
      "indent": 3,
      "text": "The use of ABFAB technologies in this case, via a mechanism dubbed \"federated cross-layer access\" (see [FCLA]) would greatly enhance the user experience of using these applications through devices. Federated cross-layer access would make use of the initial mutual authentication between device and network, to allow subsequent authentication and authorization to happen in a seamless manner for the user of that device authenticating to applications.",
      "ja": "（[FCLA]を参照）「連合クロスレイヤアクセス」と呼ば機構を介して、この場合にABFAB技術の使用は、大幅にデバイスを介してこれらのアプリケーションを使用するユーザの利便性を高めることになります。連合クロスレイヤアクセスは、後続の認証および承認がアプリケーションへの認証、そのデバイスのユーザーのためにシームレスに起こることができるように、デバイスとネットワークとの間の最初の相互認証を利用するだろう。"
    },
    {
      "indent": 0,
      "text": "3.8. Enhanced Security Services for S/MIME",
      "section_title": true,
      "ja": "3.8.  S / MIMEのためのセキュリティサービスを強化"
    },
    {
      "indent": 3,
      "text": "There are many situations where organizations want to protect information with robust access control, either for implementation of intellectual property right protections, for enforcement of contractual confidentiality agreements, or because of legal regulations. The Enhanced Security Services (ESS) for S/MIME defines an access control mechanism that is enforced by the recipient's client after decryption of the message (see [MSG-AC-REQ]). The data model used makes use of Policy Decision Points (PDPs), which make the policy decisions; Policy Enforcement Points (PEPs), which make decision requests to the PDP; and Policy Information Points (PIPs), which issue attributes about subjects. The decisions themselves are based on the policies and on the subject attributes.",
      "ja": "知的財産権保護の実現のために、契約上の守秘義務契約を施行するため、またはための法的規制のいずれかの組織が強固なアクセス制御と情報を保護する多くの状況があります。 S / MIMEのための強化されたセキュリティサービス（ESS）は、メッセージ（[MSG-AC-REQ]を参照）の復号化した後に、受信者のクライアントによって強制されたアクセス制御メカニズムを定義します。使用されるデータモデルは、ポリシー決定ポイント政策決定を行う（プラズマディスプレイパネル）、を使用しています。 PDPの決定要求を行うポリシー実行ポイント（PEPに）;問題は、被験者についての属性およびポリシー情報ポイント（ピップ）、。意思決定自体は政策上、被験者の属性に基づいています。"
    },
    {
      "indent": 3,
      "text": "The use of ABFAB technologies in this case would enable both the front-end and back-end attribute exchange required to provide subject attributes. When the PEP contacts the PDP, it would initiate an ABFAB authentication in order to authenticate to the PDP and allow it to obtain these required subject attributes. Once authenticated, the PDP would return a token to the subject PEP that could then be used for subsequent authentications to the PDP.",
      "ja": "この場合、ABFAB技術の使用は、フロントエンドと対象の属性を提供するために必要なバックエンドを属性交換の両方を可能にします。ときPEP接点PDPは、PDPへの認証と、それはこれらの必要な対象の属性を取得することを可能にするためにABFAB認証を開始します。認証されると、PDPは、次いでPDP以降の認証に使用することができる対象PEPへトークンを返します。"
    },
    {
      "indent": 0,
      "text": "3.9. Smart Objects",
      "section_title": true,
      "ja": "3.9. スマートオブジェクト"
    },
    {
      "indent": 3,
      "text": "Many smart device deployments involve multiple organizations that do not directly share security infrastructure. For example, in smart power deployments, devices (e.g., appliances) and infrastructure (e.g., electric car chargers) will wish to connect to an energy management system. The energy management system is provided by a utility company in some deployments. The utility company may wish to grant access only to authorized devices; for example, a consortium of utility companies and device manufacturers may certify devices to connect to power networks.",
      "ja": "多くのスマートデバイスの導入は、直接セキュリティインフラストラクチャを共有していない複数の組織が関与します。例えば、スマートパワー展開で、デバイス（例えば、電化製品）とインフラ（例えば、電気自動車の充電器）がエネルギー管理システムに接続したいでしょう。エネルギー管理システムは、いくつかの展開で電力会社によって提供されます。電力会社は、許可されたデバイスのみにアクセス権を付与することを望むかもしれません。例えば、電力会社や機器メーカーのコンソーシアムは、電力網に接続するための機器の認定をすることができます。"
    },
    {
      "indent": 3,
      "text": "In another example, consumer devices may be used to access cloud services. For example, a camera could be bound to a photo processing site. Authentication and authorization for uploading pictures or ordering prints are required. Sensors could be used to provide data to services run by organizations other than the sensor manufacturer. Authorization and authentication can become very tricky when sensors have no user interface. Cellular devices may want to access services provided by a third party, regardless of whether the cellular network or Wi-Fi is used. This becomes difficult when authorization and billing are coordinated by the cellular provider.",
      "ja": "別の例では、民生用機器には、クラウドサービスにアクセスするために使用することができます。例えば、カメラは写真処理部位に結合することができます。プリントを写真をアップロードするか、注文するための認証と承認が必要とされています。センサーは、センサーメーカー以外の組織によって実行されるサービスにデータを提供するために使用することができます。センサーは、ユーザーインターフェイスを持っていないときに許可および認証は非常にトリッキーになることができます。携帯デバイスにかかわらず、携帯電話ネットワークまたはWi-Fiを使用するかどうかの、サードパーティが提供するサービスにアクセスすることもできます。認可および課金が携帯電話プロバイダによって調整されているとき、これは困難になります。"
    },
    {
      "indent": 3,
      "text": "The use of ABFAB technologies in this case would provide authentication between one entity, such as a smart device, and its IdP. Only two parties are involved in this exchange; this means that the smart device need not participate in any complicated public-key infrastructure even if it is authenticating against many cloud services. Instead, the device can delegate the process of authenticating the service, and even deciding whether the device should be permitted to access the service, to the IdP. This has several advantages. A wide variety of revenue-sharing models are enabled. Because device authentication is only with a single IdP, phishing of device credentials can be avoided. Authorization and decisions about what personal information to release are made by the IdP. The device owner can use a rich interface such as a website to configure authorization and privacy policy even if the device has no user interface. This model works well with pre-provisioning of device credentials.",
      "ja": "この場合、ABFAB技術の使用は、スマートデバイス、およびそのIdPのように1つのエンティティ間の認証を提供します。 2つだけ当事者がこの交換に関与しています。これは、スマートデバイスは、それが多くのクラウドサービスに対して認証されていても、複雑な公開鍵インフラストラクチャに参加する必要はないということを意味します。代わりに、デバイスは、サービスの認証処理を委譲することができ、さらにはデバイスがIdPのには、サービスへのアクセスを許可する必要があるかどうかを決定します。これにはいくつかの利点があります。収益分配モデルの多種多様な有効になっています。デバイス認証は、単一のIdPのみであるため、デバイスクレデンシャルのフィッシング詐欺を回避することができます。個人情報は、解除するかについての承認と決定はIdPがで作られています。デバイスの所有者は、デバイスがユーザーインターフェイスを持っていない場合でも、認可およびプライバシーポリシーを設定するには、このようなウェブサイトなど豊富なインタフェースを使用することができます。このモデルは、デバイスクレデンシャルの事前プロビジョニングとうまく動作します。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document contains only use cases and defines no protocol operations for ABFAB. Security considerations for the ABFAB architecture are documented in [RFC7831], and security considerations for ABFAB technologies and protocols that are discussed in these use cases are documented in the corresponding protocol specifications.",
      "ja": "この文書では、唯一のユースケースが含まれており、ABFABためのプロトコル動作を定義しません。 ABFABアーキテクチャのセキュリティ上の考慮事項は、[RFC7831]に記載されており、これらのユースケースに記載されているABFAB技術およびプロトコルのセキュリティ問題は、対応するプロトコル仕様に記載されています。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "ja": "5.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC7831] Howlett, J., Hartman, S., Tschofenig, H., and J. Schaad, \"Application Bridging for Federated Access Beyond Web (ABFAB) Architecture\", RFC 7831, DOI 10.17487/RFC7831, May 2016, <http://www.rfc-editor.org/info/rfc7831>.",
      "ja": "[RFC7831]ハウレット、J.、ハルトマン、S.、Tschofenig、H.、及びJ. Schaad、 \"フェデレーションアクセスを越えてウェブ（ABFAB）アーキテクチャのためのブリッジングアプリケーション\"、RFC 7831、DOI 10.17487 / RFC7831、2016年5月、<HTTP ：//www.rfc-editor.org/info/rfc7831>。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "ja": "5.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[FCLA] Wei, Y., Ed., \"Federated Cross-Layer Access\", Work in Progress, draft-wei-abfab-fcla-02, March 2012.",
      "ja": "[FCLA]魏、Y.、エド。、 \"連合クロスレイヤアクセス\" が進行中で働いて、ドラフト - 魏 -  abfab-FCLA-02、2012年3月。"
    },
    {
      "indent": 3,
      "text": "[MSG-AC-REQ] Freeman, T., Schaad, J., and P. Patterson, \"Requirements for Message Access Control\", Work in Progress, draft-freeman-plasma-requirements-11, March 2015.",
      "ja": "[MSG-AC-REQ]フリーマン、T.、Schaad、J.、およびP.パターソン、 \"メッセージアクセス制御のための要件\" が進行中で働いて、ドラフト・フリーマン - プラズマ要件-11、2015年3月。"
    },
    {
      "indent": 3,
      "text": "[OASIS.saml-profiles-2.0-os] Hughes, J., Cantor, S., Hodges, J., Hirsch, F., Mishra, P., Philpott, R., and E. Maler, \"Profiles for the OASIS Security Assertion Markup Language (SAML) V2.0\", OASIS Standard OASIS.saml-profiles-2.0-os, March 2005, <http://docs.oasis-open.org/security/saml/v2.0/ saml-profiles-2.0-os.pdf>.",
      "ja": "[OASIS.saml-プロファイル-2.0-OS】ヒューズ、J.、カントール、S.、ホッジス、J.、ハーシュ、F.、ミシュラ、P.、フィルポット、R.、およびE. MALER「のプロファイルOASISのSAML（Security Assertion Markup Language）V2.0\" 、OASIS標準OASIS.saml-プロファイル-2.0-OS、2005年3月、<http://docs.oasis-open.org/security/saml/v2.0/ SAML -profiles-2.0-os.pdf>。"
    },
    {
      "indent": 3,
      "text": "[RFC1939] Myers, J. and M. Rose, \"Post Office Protocol - Version 3\", STD 53, RFC 1939, DOI 10.17487/RFC1939, May 1996, <http://www.rfc-editor.org/info/rfc1939>.",
      "ja": "[RFC1939]マイヤーズ、J.とM.ローズ、 \"ポストオフィスプロトコル - バージョン3\"、STD 53、RFC 1939、DOI 10.17487 / RFC1939、1996年5月、<http://www.rfc-editor.org/info/ RFC1939>。"
    },
    {
      "indent": 3,
      "text": "[RFC2326] Schulzrinne, H., Rao, A., and R. Lanphier, \"Real Time Streaming Protocol (RTSP)\", RFC 2326, DOI 10.17487/RFC2326, April 1998, <http://www.rfc-editor.org/info/rfc2326>.",
      "ja": "[RFC2326] SchulzrinneとH.とラオとA.、およびR. Lanphier、 \"リアルタイムのストリーミングプロトコル（RTSP）\"、RFC 2326、DOI 10.17487 / RFC2326、1998年4月、<のhttp：//www.rfc-editor。組織/情報/ RFC2326>。"
    },
    {
      "indent": 3,
      "text": "[RFC2911] Hastings, T., Ed., Herriot, R., deBry, R., Isaacson, S., and P. Powell, \"Internet Printing Protocol/1.1: Model and Semantics\", RFC 2911, DOI 10.17487/RFC2911, September 2000, <http://www.rfc-editor.org/info/rfc2911>.",
      "ja": "[RFC2911]ヘイスティングズ、T.、エド、エリオ、R.、deBry、R.、Isaacson氏、S.、およびP.パウエル、 \"インターネット印刷プロトコル/ 1.1：モデルと意味論\"。、RFC 2911、DOI 10.17487 / RFC2911 、2000年9月、<http://www.rfc-editor.org/info/rfc2911>。"
    },
    {
      "indent": 3,
      "text": "[RFC3501] Crispin, M., \"INTERNET MESSAGE ACCESS PROTOCOL - VERSION 4rev1\", RFC 3501, DOI 10.17487/RFC3501, March 2003, <http://www.rfc-editor.org/info/rfc3501>.",
      "ja": "[RFC3501]のCrispin、M.、 \"インターネットメッセージアクセスプロトコル -  VERSION 4rev1\"、RFC 3501、DOI 10.17487 / RFC3501、2003年3月、<http://www.rfc-editor.org/info/rfc3501>。"
    },
    {
      "indent": 3,
      "text": "[RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, DOI 10.17487/RFC3550, July 2003, <http://www.rfc-editor.org/info/rfc3550>.",
      "ja": "[RFC3550] Schulzrinneと、H.、Casner、S.、フレデリック、R.、およびV.ヤコブソン、 \"RTP：リアルタイムアプリケーションのためのトランスポートプロトコル\"、STD 64、RFC 3550、DOI 10.17487 / RFC3550、2003年7月、 <http://www.rfc-editor.org/info/rfc3550>。"
    },
    {
      "indent": 3,
      "text": "[RFC4251] Ylonen, T. and C. Lonvick, Ed., \"The Secure Shell (SSH) Protocol Architecture\", RFC 4251, DOI 10.17487/RFC4251, January 2006, <http://www.rfc-editor.org/info/rfc4251>.",
      "ja": "[RFC4251] Ylonenと、T.とC. Lonvick、エド。、 \"セキュアシェル（SSH）プロトコルアーキテクチャ\"、RFC 4251、DOI 10.17487 / RFC4251、2006年1月、<http://www.rfc-editor.org/情報/ rfc4251>。"
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, DOI 10.17487/RFC5280, May 2008, <http://www.rfc-editor.org/info/rfc5280>.",
      "ja": "[RFC5280]クーパー、D.、Santesson、S.、ファレル、S.、Boeyen、S.、Housley氏、R.、およびW.ポーク、「インターネットX.509公開鍵暗号基盤証明書と証明書失効リスト（CRL）のプロフィール」、RFC 5280、DOI 10.17487 / RFC5280、2008年5月、<http://www.rfc-editor.org/info/rfc5280>。"
    },
    {
      "indent": 3,
      "text": "[RFC5321] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 5321, DOI 10.17487/RFC5321, October 2008, <http://www.rfc-editor.org/info/rfc5321>.",
      "ja": "[RFC5321] Klensin、J.、 \"簡易メール転送プロトコル\"、RFC 5321、DOI 10.17487 / RFC5321、2008年10月、<http://www.rfc-editor.org/info/rfc5321>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "These use cases have been developed and documented using significant input from Jens Jensen (STFC Rutherford Appleton Laboratory), Daniel Kouril (CESNET), Michal Prochazka (CESNET), Ian Stewart (University of Edinburgh), Stephen Booth (Edinburgh Parallel Computing Centre), Eefje van der Harst (SURFnet), Joost van Dijk (SURFnet), Robin Breathe (Oxford Brookes University), Yinxing Wei (ZTE Corporation), Trevor Freeman (Microsoft Corporation), Sam Hartman (Painless Security, LLC), and Yuri Demchenko (University of Amsterdam).",
      "ja": "これらのユースケースは、開発し、イェンス・イェンセン（STFCラザフォードアップルトン研究所）、ダニエル・Kouril（CESNET）、ミハルProchazka（CESNET）、イアン・スチュワート（エジンバラ大学）、スティーブン・ブース（エジンバラ並列コンピューティング・センター）からの重要な入力を使用して文書化されていますEefjeファンデHarst（SURFNET）、Joostのバンダイク（SURFNET）、ロビンはブリーズ（オックスフォード・ブルックス大学）、Yinxing魏（ZTEコーポレーション）、トレバー・フリーマン（マイクロソフト社）、サム・ハートマン（無痛セキュリティ、LLC）、そしてユーリDemchenko（アムステルダム大学）。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "The following individuals made important contributions to the text of this document: Tim Bannister (Manchester University), Simon Cooper (Jisc), Josh Howlett (Jisc), and Mark Tysom (Jisc).",
      "ja": "ティム・バニスター（マンチェスター大学）、サイモン・クーパー（JISC）、ジョシュ・ハウレット（JISC）、およびマーク・Tysom（JISC）：以下の個人はこのドキュメントのテキストへの重要な貢献をしました。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dr. Rhys Smith (editor) Jisc Lumen House, Library Avenue, Harwell Oxford OX11 0SG United Kingdom",
      "ja": "博士リス・スミス（エディタ）JISCルーメンハウス、図書館アベニュー、ハーウェルオックスフォードOX11 0SGイギリス"
    },
    {
      "indent": 3,
      "text": "Phone: +44 1235 822145 Email: rhys.smith@jisc.ac.uk",
      "ja": "電話：+44 1235 822145 Eメール：rhys.smith@jisc.ac.uk"
    }
  ]
}