{
  "title": {
    "text": "RFC 7072 - A Reputation Query Protocol",
    "ja": "RFC 7072 - 評判問い合わせプロトコル"
  },
  "number": 7072,
  "created_at": "2019-10-28 09:09:52.666416+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                     N. Borenstein\nRequest for Comments: 7072                                      Mimecast\nCategory: Standards Track                                   M. Kucherawy\nISSN: 2070-1721                                            November 2013",
      "raw": true
    },
    {
      "indent": 22,
      "text": "A Reputation Query Protocol",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines a mechanism to conduct queries for reputation information over the HyperText Transfer Protocol (HTTP) using JavaScript Object Notation (JSON) as the payload meta-format.",
      "ja": "この文書は、ペイロードメタ形式としてJavaScriptオブジェクト表記（JSON）を使用して、ハイパーテキスト転送プロトコル（HTTP）上の評判情報のクエリを行うためのメカニズムを定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7072.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7072で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology and Definitions .....................................2\n   2.1. Key Words ..................................................2\n   2.2. Other Definitions ..........................................3\n3. Description .....................................................3\n   3.1. Overview ...................................................3\n   3.2. URI Template ...............................................3\n   3.3. Syntax .....................................................4\n   3.4. Response ...................................................6\n   3.5. Protocol Support ...........................................6\n4. IANA Considerations .............................................7\n5. Security Considerations .........................................7\n6. References ......................................................8\n   6.1. Normative References .......................................8\n   6.2. Informative References .....................................8\nAppendix A. Acknowledgements .......................................9",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document defines a method to query a reputation data service for information about an entity, using the HyperText Transfer Protocol (HTTP) as the transport mechanism and JSON as the payload meta-format.",
      "ja": "この文書は、ペイロード・メタフォーマットなどの搬送機構とJSONなどのハイパーテキスト転送プロトコル（HTTP）を使用して、エンティティに関する情報のための評判データサービスを照会する方法を定義します。"
    },
    {
      "indent": 3,
      "text": "The mechanism is a two-stage query:",
      "ja": "メカニズムは、2段階のクエリです："
    },
    {
      "indent": 3,
      "text": "1. A client retrieves a template from a server that describes the construction of a Universal Resource Identifier (URI) that will be the actual query;",
      "ja": "1.クライアントは、実際のクエリになり、ユニバーサルリソース識別子（URI）の構成を説明サーバからテンプレートを取り出します。"
    },
    {
      "indent": 3,
      "text": "2. The client then uses the constructed URI to request the reputation data from the server.",
      "ja": "2.次に、クライアントは、サーバからのレピュテーションデータを要求するために構築されたURIを使用しています。"
    },
    {
      "indent": 0,
      "text": "2. Terminology and Definitions",
      "section_title": true,
      "ja": "2.用語と定義"
    },
    {
      "indent": 3,
      "text": "This section defines terms used in the rest of the document.",
      "ja": "このセクションでは、ドキュメントの残りの部分で使用される用語を定義します。"
    },
    {
      "indent": 0,
      "text": "2.1. Key Words",
      "section_title": true,
      "ja": "2.1. キーワード"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [KEYWORDS].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[キーワード]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Other Definitions",
      "section_title": true,
      "ja": "2.2. 他の定義"
    },
    {
      "indent": 3,
      "text": "Other terms of importance in this document are defined in [RFC7070] and [RFC7071].",
      "ja": "この文書の重要性の他の用語は、[RFC7070]と[RFC7071]で定義されています。"
    },
    {
      "indent": 0,
      "text": "3. Description",
      "section_title": true,
      "ja": "3.説明"
    },
    {
      "indent": 0,
      "text": "3.1. Overview",
      "section_title": true,
      "ja": "3.1. 概要"
    },
    {
      "indent": 3,
      "text": "The components to the question being asked are the following:",
      "ja": "頼まれて質問へのコンポーネントは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o The subject of the query;",
      "ja": "クエリの主題O。"
    },
    {
      "indent": 3,
      "text": "o The name of the host, or the IP address, at which the reputation service is available;",
      "ja": "ホスト名、または評判のサービスが利用可能であるでIPアドレス、O;"
    },
    {
      "indent": 3,
      "text": "o The name of the reputation application, i.e., the context within which the subject is being evaluated;",
      "ja": "評判アプリケーションの名前O、すなわち、被験体が評価されている内文脈。"
    },
    {
      "indent": 3,
      "text": "o Optionally, names of the specific reputation assertions or attributes that are being requested.",
      "ja": "oオプション、要求されている特定の評判アサーションや属性の名前。"
    },
    {
      "indent": 3,
      "text": "There is no discovery protocol for finding reputation services. These are typically subscription services, negotiated between operators through some out-of-band method.",
      "ja": "レピュテーションサービスを見つけるための発見プロトコルがありません。これらは、典型的には、いくつかのアウトオブバンド方式による事業者間で交渉のサブスクリプションサービスです。"
    },
    {
      "indent": 3,
      "text": "Assertions are discussed in [RFC7071].",
      "ja": "アサーションは、[RFC7071]に記載されています。"
    },
    {
      "indent": 3,
      "text": "The name of the application, if given, is expected to be one registered with IANA in the \"Reputation Applications\" registry, which is defined in [RFC7071]. A server receiving a query about an application it does not recognize or explicitly support (e.g., by virtue of private agreements or experimental extensions) MUST return a 404 error code.",
      "ja": "アプリケーションの名前は、与えられた場合、[RFC7071]で定義されている「評判アプリケーション」レジストリにIANAに登録された一つであることが期待されています。それは（プライベート契約または実験の拡張によって、例えば）を認識または明示的にサポートされていないアプリケーションについての問い合わせを受けたサーバ404エラーコードを返さなければなりません。"
    },
    {
      "indent": 3,
      "text": "A reputation query made via [HTTP] encodes the question being asked in an HTTP GET method. The specific syntax of the query itself is specified by retrieving a URI template from the reputation service, completing the template, and then issuing the query.",
      "ja": "[HTTP]を経て作られた評判のクエリは、HTTPのGETメソッドで求められている質問を符号化します。クエリ自体の具体的な構文は、評判のサービスからURIテンプレートを取得するテンプレートを完了した後、クエリを発行することにより指定されます。"
    },
    {
      "indent": 0,
      "text": "3.2. URI Template",
      "section_title": true,
      "ja": "3.2.  URIテンプレート"
    },
    {
      "indent": 3,
      "text": "The template file is retrieved by requesting the [WELL-KNOWN-URI] \"repute-template\" from the host providing reputation service, using HTTP. (The registration for this well-known URI is in Section 4.) The server returns the template file in a reply that MUST use the text/plain media type (see [MIME]) and SHOULD include an Expires field (see Section 14.21 of [HTTP]) indicating a duration for which the template is to be considered valid by clients and not re-queried.",
      "ja": "テンプレートファイルは、評判のサービスを提供するホストから[有名-URI]「の評判・テンプレート」を要求するHTTPを使用して取得されます。サーバは、text / plainのメディアタイプを使用する（[MIME]を参照）、Expiresフィールド含めるべきでなければなりません応答におけるテンプレートファイルを返す（このよく知られたURIの登録は、セクション4である）（セクション14.21を参照[HTTP]）テンプレートは、クライアントによって有効とみなされ、再照会ないようにされている期間を示します。"
    },
    {
      "indent": 3,
      "text": "If an Expires field is present, the client SHOULD NOT send another query to the same server prior to the timestamp in the field. If no Expires field is present, the client SHOULD wait at least one day before sending another query to the same server (i.e., the client assumes a default expiration of one day).",
      "ja": "フィールドが存在している有効期限が切れた場合、クライアントは、フィールド内のタイムスタンプの前に、同じサーバーに別のクエリを送信することはできません。何がフィールドが存在している有効期限が切れた場合、クライアント（すなわち、クライアントは1日のデフォルトの有効期限を前提として）同じサーバーに別のクエリを送信する前に少なくとも1日を待つべきではありません。"
    },
    {
      "indent": 3,
      "text": "The template file might contain more than one template. Such a file MUST have each template separated by a carriage return (ASCII 0x0D) and newline (ASCII 0x0A) character, as is typical for most text-based Internet protocols.",
      "ja": "テンプレートファイルには、複数のテンプレートが含まれている場合があります。ほとんどのテキストベースのインターネットプロトコルのための典型的であるように、このようなファイルは、キャリッジリターン（ASCII 0x0Dを）と改行（ASCII 0x0Aを）文字で区切られた各テンプレートを持たなければなりません。"
    },
    {
      "indent": 3,
      "text": "Each template in the file is expanded using the variables that are the parameters to the query. These parameters are either the subject about which reputation information is sought (or details associated with it) or other parameters that are established out-of-band with the reputation service; they are not established by any automated discovery described here. The client then attempts to query each expanded template that uses a URI scheme it is capable of querying, in the order presented in the file, until the client finds one to which it can establish a usable connection and issue the query.",
      "ja": "ファイル内の各テンプレートは、クエリのパラメータである変数を使用して展開されています。これらのパラメータは、評判情報が求められるかについて被験者（又はそれに関連する詳細）またはレピュテーションサービスと帯域外に確立されている他のパラメータのいずれかです。彼らはここに記載された任意の自動検出によって確立されていません。次に、クライアントは、クライアントが使用可能な接続を確立し、クエリを発行することができたものを見つけるまで、それは、ファイルに提示された順序で、照会が可能なURIスキームを使用して、それぞれ拡大したテンプレートを照会しようとします。"
    },
    {
      "indent": 3,
      "text": "For example, given the following template:",
      "ja": "たとえば、次のテンプレートを与えられました："
    },
    {
      "indent": 3,
      "text": "http://{service}/{application}/{subject}/{assertion}",
      "ja": "HTTP：// {サービス} / {アプリケーション} / {件名} / {}アサーション"
    },
    {
      "indent": 3,
      "text": "A query about the use of the domain \"example.org\" in the \"email-id\" application context to a service run at \"example.com\", where that application declares a required \"subject\" parameter, requesting the \"SPAM\" reputation assertion, would be formed as follows:",
      "ja": "そのアプリケーションは、「SPAM」の評判を要求し、必要な「件名」パラメータを宣言し、「example.com」のサービスの実行に「電子メールID」アプリケーションコンテキスト内のドメイン「example.org」の使用に関する問い合わせ次のように主張は、形成されることになります。"
    },
    {
      "indent": 3,
      "text": "http://example.com/email-id/example.org/spam",
      "ja": "ｈっｔｐ：／／えぁｍｐぇ。こｍ／えまいｌーいｄ／えぁｍｐぇ。おｒｇ／ｓぱｍ"
    },
    {
      "indent": 0,
      "text": "3.3. Syntax",
      "section_title": true,
      "ja": "3.3. 構文"
    },
    {
      "indent": 3,
      "text": "The syntax for the [URI] of the query is constructed using a template as per [URI-TEMPLATE]. (See Section 3.2.) Clients MUST provide the following values in the expansion of the template:",
      "ja": "クエリの[URI]の構文は[URIテンプレート]の通りテンプレートを使用して構築されています。 （3.2節を参照してください。）クライアントは、テンプレートの拡張に次の値を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "application: The name of the application reputation in whose context the request is being made. These names are registered with IANA, and conform to the ABNF \"token\" found in [MIME].",
      "ja": "アプリケーション：要求がなされているコンテキストを持つアプリケーション評判の名前。これらの名前は、IANAに登録され、[MIME]で見つけABNF「トークン」に準拠しています。"
    },
    {
      "indent": 3,
      "text": "service: The hostname or IP address to which the query is being sent. This MUST be the same as the host to which the template query was issued.",
      "ja": "サービス：クエリが送信される先のホスト名またはIPアドレス。これは、テンプレートクエリが発行されたにホストと同じでなければなりません。"
    },
    {
      "indent": 3,
      "text": "subject: The subject of the query, extracted from some content to be evaluated. The subject portion of the template conforms to the ABNF \"value\" found in [MIME].",
      "ja": "件名：クエリの件名、一部のコンテンツから抽出された評価されます。テンプレートの主題部は、[MIME]に見出さABNF「値」に準拠します。"
    },
    {
      "indent": 3,
      "text": "The following variable can also be provided. It is not mandatory in this model, but a specific application (defined in its own extension document) might declare it mandatory in a specific context:",
      "ja": "次の変数を設けることもできます。これは、このモデルでは必須ではありませんが、（独自の拡張文書で定義された）特定のアプリケーションは、特定のコンテキストでは、それは必須宣言するかもしれません。"
    },
    {
      "indent": 3,
      "text": "assertion: The name of the specific assertion of interest to the client. Assertion names conform to the ABNF \"token\" found in [MIME]. If absent, the client is indicating that it requests all available assertion information.",
      "ja": "アサーション：クライアントへの関心の特定のアサーションの名前。アサーション名は、[MIME]で見つけABNF「トークン」に準拠しています。欠席した場合、クライアントは、それが利用可能なすべてのアサーション情報を要求していることを示しています。"
    },
    {
      "indent": 3,
      "text": "If a template contains a variable that is not required and the client does not have a value to insert, it substitutes the empty string into the template in place of that variable. Service providers crafting templates MUST do so such that a client doing an empty variable expansion will still produce a syntactically and semantically valid and unambiguous URI. For example, given this template:",
      "ja": "テンプレートが必要とされていないと、クライアントは挿入する値を持たない変数が含まれている場合、それはその変数の代わりにテンプレートに空の文字列に置き換えます。テンプレートを作り上げ、サービスプロバイダーは、空の変数の展開をしているクライアントが構文的および意味的に有効かつ明確なURIを生成するような行う必要があります。たとえば、このテンプレートを与えられました："
    },
    {
      "indent": 5,
      "text": "http://{service}/{application}/{subject}/{assertion}/{a}/{b}",
      "ja": "HTTP：// {サービス} / {アプリケーション} / {件名} / {アサーション} / {A} / {B}"
    },
    {
      "indent": 3,
      "text": "If \"{a}\" and \"{b}\" are optional and \"{a}\" expands to the empty string, then the resulting URI will have adjacent backslash (\"/\", ASCII 0x2F) characters and one path component after the assertion. If the server interpreting the URI's path component removes or ignores adjacent backslash characters (such as is done with the UNIX filesystem), the server will be unable to distinguish an empty \"{a}\" from an empty \"{b}\", and it could serve the wrong response. Where possible, the template needs to be constructed such that expansion of optional variables yields an unambiguous result. For example, an unambiguous version of the above would be:",
      "ja": "「{A}」と「{B}」オプションであれば、「{A}」空の文字列に展開され、次いで得られたURIは、アサーション後、隣接するバックスラッシュ（「/」、ASCII 0x2F）文字と一つのパスコンポーネントを有するであろう。 URIのパスコンポーネントを解釈し、サーバが（例えば、UNIXファイルシステムで行われているように）隣接するバックスラッシュ文字を削除または無視した場合、サーバは空の「{B}」から「{A}」空を区別することができなくなり、それ間違った応答を果たすことができました。可能な場合には、テンプレートは、オプションの変数の展開が明確な結果が得られますように構築する必要があります。例えば、上記の明確なバージョンは、次のようになります。"
    },
    {
      "indent": 5,
      "text": "http://{service}/{application}/{subject}/{assertion}/a={a}/b={b}",
      "ja": "HTTP：// {サービス} / {アプリケーション} / {件名} / {アサーション} / A = {A} / B = {B}"
    },
    {
      "indent": 3,
      "text": "...or, even better, using URI template set expansions:",
      "ja": "...または、より良い、URIテンプレートセットの拡張を使用しました："
    },
    {
      "indent": 5,
      "text": "http://{service}/{application}/{subject}/{assertion}{?a,b}",
      "ja": "HTTP：// {サービス} / {アプリケーション} / {件名} / {アサーション} {B}？"
    },
    {
      "indent": 3,
      "text": "Every application space has a set of assertions applicable to its own context. [RFC7071] defines a single assertion assumed to exist in any application that does not define its own assertion set.",
      "ja": "すべてのアプリケーション空間は、独自のコンテキストに適用されるアサーションのセットを持っています。 [RFC7071]は、自身のアサーションの集合を定義していない任意のアプリケーション内に存在すると仮定単一のアサーションを定義します。"
    },
    {
      "indent": 3,
      "text": "Reputation applications can extend the set of optional or required query parameters as part of their IANA registration actions. The set enumerated above establishes the base set common to all of them. Further, additional required or optional extension query parameters might be defined by specific reputation service providers, though these are private arrangements between client and server and will not be registered with IANA.",
      "ja": "評判のアプリケーションは、IANA登録アクションの一部として、オプションまたは必須のクエリパラメータのセットを拡張することができます。上に列挙したセットは、それらのすべてに共通の基本セットを確立します。これらは、クライアントとサーバー間のプライベートな取り決めであり、IANAに登録されることはありませんけれどもさらに、必要な追加またはオプションの拡張クエリパラメータは、特定の評判のサービスプロバイダによって定義される可能性があります。"
    },
    {
      "indent": 3,
      "text": "Authentication between reputation client and server is outside the scope of this specification. It could be provided through a variety of available transport-based or object-based mechanisms, including a later extension of this specification.",
      "ja": "評判のクライアントとサーバ間の認証は、この仕様の範囲外です。なお、本明細書の後の拡張を含む利用可能なトランスポートベースまたはオブジェクトベースのメカニズムの様々なを通じて提供することができます。"
    },
    {
      "indent": 0,
      "text": "3.4. Response",
      "section_title": true,
      "ja": "3.4. 応答"
    },
    {
      "indent": 3,
      "text": "The response is expected to be contained in a media type designed to deliver reputons. A media type designed for this purpose, \"application/reputon+json\", is defined in [RFC7071].",
      "ja": "応答がreputonsを提供するために設計されたメディアタイプに含まれると予想されます。この目的のために設計されたメディアタイプ、「アプリケーション/ reputon + JSON」は、[RFC7071]で定義されています。"
    },
    {
      "indent": 3,
      "text": "If the server generates responses that contain an Expires field (see Section 14.21 of [HTTP]), that timestamp MUST align with the \"expires\" field within the response, if any. Failing to do so can result in a state where the response has expired, but the HTTP reply has not, and the client would in that case be unable to get a fresh answer from the reputation server.",
      "ja": "サーバは、（[HTTP]のセクション14.21を参照）フィールドを有効期限含む応答を生成する場合、そのタイムスタンプがあれば、応答内のフィールドを「満了する」と整列しなければなりません。応答の有効期限が切れた状態になることがそうしないが、HTTP応答はしていない、とクライアントが、その場合には評判サーバからの新鮮な答えを得ることができないであろう。"
    },
    {
      "indent": 0,
      "text": "3.5. Protocol Support",
      "section_title": true,
      "ja": "3.5. プロトコルのサポート"
    },
    {
      "indent": 3,
      "text": "A client has to implement HTTP in order to retrieve the query template as described in Section 3.2. Accordingly, a server can assume the client will be able to handle a URI template that produces a URI for the query using the \"http\" URI scheme. The template could yield a query string that uses some other URI scheme, in which case the client could try that URI as well if it supports issuing queries with that URI scheme.",
      "ja": "クライアントは、3.2節で説明したように、クエリテンプレートを取得するためにHTTPを実装する必要があります。したがって、サーバーは、クライアントが「HTTP」URIスキームを使用して、クエリのURIを生成URIテンプレートを扱うことができるようになりますと仮定することができます。テンプレートは、それがそのURIスキームでクエリを発行サポートしている場合、クライアントが同様にURIことを試みることができ、その場合には他のいくつかのURIスキームを使用してクエリ文字列を、もたらすことができます。"
    },
    {
      "indent": 3,
      "text": "A server SHOULD include support for providing service over HTTP, and publish templates indicating support for this, as a baseline for interoperability with arbitrary clients.",
      "ja": "サーバーは、HTTPを介してサービスを提供するためのサポートが含まれ、任意のクライアントとの相互運用性の基準として、このためのサポートを示すテンプレートを公開する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document registers the \"repute-template\" well-known URI in the \"Well-Known URI\" registry as defined by [WELL-KNOWN-URI], as follows:",
      "ja": "[有名-URI]で定義されるように、次のようにこの文書は、「既知のURI」レジストリ内の「評判・テンプレート」のよく知られたURIを登録します。"
    },
    {
      "indent": 3,
      "text": "URI suffix: repute-template",
      "ja": "URIサフィックス：評判テンプレート"
    },
    {
      "indent": 3,
      "text": "Change controller: IETF",
      "ja": "変更コントローラ：IETF"
    },
    {
      "indent": 3,
      "text": "Specification document(s): [RFC7072]",
      "ja": "仕様書（S）：[RFC7072]"
    },
    {
      "indent": 3,
      "text": "Related information: none",
      "ja": "関連情報：なし"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines particular uses of existing protocols for a specific application. In particular, the basic protocol used for this service to retrieve a URI template from a well-known location is basic HTTP, which is not secure without certain extensions. Security issues relevant to use of URI templates are discussed in [URI-TEMPLATE], and those relevant to well-known URI definitions and retrieval are discussed in [WELL-KNOWN-URI].",
      "ja": "この文書は、特定のアプリケーションのための既存のプロトコルの特定の用途を定義します。具体的には、よく知られている位置からURIテンプレートを取得するために、このサービスのために使用される基本的なプロトコルは、特定の拡張子なしで固定されていない基本的なHTTP、です。 URIテンプレートの使用に関連するセキュリティ問題は[URIテンプレート]で議論されている、よく知られているURIの定義と検索に関連するものが[周知-URI]に記載されています。"
    },
    {
      "indent": 3,
      "text": "The reputation service itself will use HTTP or other transport methods to issue queries and receive replies. Those protocols have registered URI schemes and, as such, presumably have documented security considerations. The protocol described here operates atop those URI schemes, and does not itself present new security considerations.",
      "ja": "評判のサービス自体は、クエリを発行し、応答を受信するためにHTTPまたは他の移送方法を使用します。これらのプロトコルは、次のような、おそらくセキュリティ上の考慮事項を文書化している、URIスキームを登録しています。ここで説明するプロトコルは、これらのURIスキームの上で動作し、それ自体は、新しいセキュリティの考慮事項を提示していません。"
    },
    {
      "indent": 3,
      "text": "Reputation mechanisms represent an obvious security concern, in terms of the validity and use of the reputation information. These issues are beyond the scope of this specification. General information pertaining to using or providing reputation services can be found in [CONSIDERATIONS].",
      "ja": "評判メカニズムは、評判情報の有効性と利用規約に、明らかなセキュリティ上の懸念を表しています。これらの問題は、この仕様の範囲を超えています。レピュテーションサービスを使用するか、または提供に関する一般的な情報は、[考察]で見つけることができます。"
    },
    {
      "indent": 3,
      "text": "The security considerations applicable to HTTP (see Section 15 of [HTTP] apply, since this query mechanism for reputation uses that protocol. If it is desirable to conceal the content of the query and its response, use of encryption techniques such as HTTP over TLS [HTTPS] can be used.",
      "ja": "HTTPに適用されるセキュリティ上の考慮事項評判のため、このクエリメカニズムは、そのプロトコルを使用しているので。クエリおよびその応答の内容を隠すことが望ましい場合は、TLS経由HTTPなどの暗号化技術の使用を（、[HTTP]適用のセクション15を参照してください[HTTPS]を使用することができます。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[HTTP] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[HTTP]フィールディング、R.、ゲティス、J.、モーグル、J.、Frystyk、H.、Masinter、L.、リーチ、P.、およびT.バーナーズ - リー、 \"ハイパーテキスト転送プロトコル -  HTTP / 1.1\" 、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[キーワード]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[MIME] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "ja": "[MIME]解放され、N.とN. Borenstein、 \"マルチパーパスインターネットメールエクステンション（MIME）第一部：インターネットメッセージ本体のフォーマット\"、RFC 2045、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC7070] Borenstein, N., Kucherawy, M., and A. Sullivan, \"An Architecture for Reputation Reporting\", RFC 7070, November 2013.",
      "ja": "[RFC7070] Borenstein、N.、Kucherawy、M.、およびA.サリバン、 \"報告評判のためのアーキテクチャ\"、RFC 7070、2013年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC7071] Borenstein, N. and M. Kucherawy, \"A Media Type for Reputation Interchange\", RFC 7071, November 2013.",
      "ja": "[RFC7071] Borenstein、N.およびM. Kucherawy、 \"評判の交換用メディアタイプ\"、RFC 7071、2013年11月。"
    },
    {
      "indent": 3,
      "text": "[URI-TEMPLATE] Gregorio, J., Fielding, R., Hadley, M., Nottingham, M., and D. Orchard, \"URI Template\", RFC 6570, March 2012.",
      "ja": "[URIテンプレート]グレゴリオ、J.、フィールディング、R.、ハドリー、M.、ノッティンガム、M.、およびD.オーチャード、 \"URIテンプレート\"、RFC 6570、2012年3月。"
    },
    {
      "indent": 3,
      "text": "[URI] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[URI]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[WELL-KNOWN-URI] Nottingham, M. and E. Hammer-Lahav, \"Defining Well-Known Uniform Resource Identifiers (URIs)\", RFC 5785, April 2010.",
      "ja": "[有名-URI]ノッティンガム、M.とE.ハンマー -  Lahav、RFC 5785、2010年4月 \"既知のUniform Resource Identifier（URI）を定義\"。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[CONSIDERATIONS] Kucherawy, M., \"Operational Considerations Regarding Reputation Services\", Work in Progress, May 2013.",
      "ja": "[考察] Kucherawy、M.、「レピュテーションサービスに関して運用の注意事項」、進歩、2013年5月に作業。"
    },
    {
      "indent": 3,
      "text": "[HTTPS] Rescorla, E., \"HTTP Over TLS\", RFC 2818, May 2000.",
      "ja": "[HTTPS]レスコラ、E.、 \"HTTPオーバーTLS\"、RFC 2818、2000年5月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgements",
      "ja": "付録A.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank the following for their contributions to this work: Simon Hunt, Mark Nottingham, David F. Skoll, and Mykyta Yevstifeyev.",
      "ja": "サイモン・ハント、マーク・ノッティンガム、デビッドF.スコール、およびMykyta Yevstifeyev：作者はこの作品への貢献のために次のことを感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Nathaniel Borenstein Mimecast 203 Crescent St., Suite 303 Waltham, MA 02453 USA",
      "ja": "ナサニエル・ボレンスタインMimecast 203クレセント聖、スイート303ウォルサム、MA 02453 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 781 996 5340 EMail: nsb@guppylake.com",
      "ja": "電話：+1 781 996 5340 Eメール：nsb@guppylake.com"
    },
    {
      "indent": 3,
      "text": "Murray S. Kucherawy 270 Upland Drive San Francisco, CA 94127 USA",
      "ja": "マレーS. Kucherawy 270高地ドライブサンフランシスコ、CA 94127 USA"
    },
    {
      "indent": 3,
      "text": "EMail: superuser@gmail.com",
      "ja": "メールアドレス：superuser@gmail.com"
    }
  ]
}