{
  "title": {
    "text": "RFC 7488 - Port Control Protocol (PCP) Server Selection",
    "ja": "RFC 7488 - ポート制御プロトコル（PCP）サーバーの選択"
  },
  "number": 7488,
  "created_at": "2019-11-02 20:47:30.257425+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      M. Boucadair\nRequest for Comments: 7488                                France Telecom\nUpdates: 6887                                                   R. Penno\nCategory: Standards Track                                        D. Wing\nISSN: 2070-1721                                                 P. Patil\n                                                                T. Reddy\n                                                                   Cisco\n                                                              March 2015",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Port Control Protocol (PCP) Server Selection",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies the behavior to be followed by a Port Control Protocol (PCP) client to contact its PCP server(s) when one or several PCP server IP addresses are configured.",
      "ja": "この文書では、1つまたはいくつかのPCPサーバのIPアドレスが設定されている場合、そのPCPサーバ（複数可）に連絡するためのポート制御プロトコル（PCP）クライアントが従うべき動作を指定します。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 6887.",
      "ja": "この文書は、RFC 6887に更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7488.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7488で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Terminology and Conventions . . . . . . . . . . . . . . . . .   3\n  2.1.  Requirements Language . . . . . . . . . . . . . . . . . .   3\n  2.2.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  IP Address Selection: PCP Server with Multiple IP Addresses .   3\n4.  IP Address Selection: Multiple PCP Servers  . . . . . . . . .   4\n5.  Example: Multiple PCP Servers on a Single Interface . . . . .   5\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   7\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   7\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .   7\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .   8\nAppendix A.  Multihoming  . . . . . . . . . . . . . . . . . . . .   9\n  A.1.  IPv6 Multihoming  . . . . . . . . . . . . . . . . . . . .   9\n  A.2.  IPv4 Multihoming  . . . . . . . . . . . . . . . . . . . .  10\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  11\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  12",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "A host may have multiple network interfaces (e.g., 3G, IEEE 802.11, etc.), each configured with different PCP servers. Each PCP server learned must be associated with the interface on which it was learned. Generic multi-interface considerations are documented in Section 8.4 of [RFC6887]. Multiple PCP server IP addresses may be configured on a PCP client in some deployment contexts such as multihoming (see Appendix A). A PCP server may also have multiple IP addresses associated with it. It is out of the scope of this document to enumerate all deployment scenarios that require multiple PCP server IP addresses to be configured.",
      "ja": "ホストが複数のネットワークインタフェース（例えば、3G、IEEE 802.11など）、異なるPCPサーバで構成されている各を有していてもよいです。学んだ各PCPサーバは、それが学習したインターフェイスに関連付ける必要があります。一般的なマルチインターフェースの考慮事項は、[RFC6887]のセクション8.4に記載されています。複数のPCPサーバのIPアドレスは、そのようなマルチホーミング（付録Aを参照）など、いくつかの展開コンテキストでPCPクライアント上で設定することができます。 PCPサーバは、それに関連付けられた複数のIPアドレスを持つことができます。これは、設定する複数のPCPサーバのIPアドレスを必要とするすべての展開シナリオを列挙するために、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "If a PCP client discovers multiple PCP server IP addresses, it needs to determine which actions it needs to undertake (e.g., whether PCP entries are to be installed in all or a subset of discovered IP addresses, whether some PCP entries are to be removed, etc.). This document makes the following assumptions:",
      "ja": "PCPのクライアントが複数のPCPサーバのIPアドレスを発見した場合、それは、それがPCPエントリは、いくつかのPCPエントリを削除するかどうか、全てまたは発見されたIPアドレスのサブセットにインストールするかどうか、（例えばに着手する必要があるアクションを決定する必要があります等。）。このドキュメントでは、次のことを前提とします。"
    },
    {
      "indent": 3,
      "text": "o There is no requirement that multiple PCP servers configured on the same interface have the same capabilities.",
      "ja": "O同じインターフェイスで構成された複数のPCPサーバが同じ機能を持っている必要はありません。"
    },
    {
      "indent": 3,
      "text": "o PCP requests to different PCP servers are independent, the result of a PCP request to one PCP server does not influence another.",
      "ja": "O異なるPCPサーバへPCP要求が独立している、1台のPCPサーバへPCP要求の結果は、別のに影響を与えません。"
    },
    {
      "indent": 3,
      "text": "o The configuration mechanism must distinguish IP addresses that belong to the same PCP server.",
      "ja": "O構成メカニズムは同じPCPサーバに属しているIPアドレスを区別しなければなりません。"
    },
    {
      "indent": 3,
      "text": "This document specifies the behavior to be followed by a PCP client [RFC6887] to contact its PCP server(s) [RFC6887] when it is configured with one or several PCP server IP addresses (e.g., using DHCP [RFC7291]). This document does not make any assumption on the type of these IP addresses (i.e., unicast/anycast).",
      "ja": "この文書は、それが一つまたは複数のPCPサーバのIPアドレス（例えば、DHCP [RFC7291]を使用）で構成されている場合、そのPCPサーバ（複数可）[RFC6887]を連絡するPCPクライアント[RFC6887]で従うべき動作を指定します。この文書では、これらのIPアドレスのタイプ（すなわち、ユニキャスト/エニーキャスト）上の任意の仮定を行いません。"
    },
    {
      "indent": 0,
      "text": "2. Terminology and Conventions",
      "section_title": true,
      "ja": "2.用語と表記"
    },
    {
      "indent": 0,
      "text": "2.1. Requirements Language",
      "section_title": true,
      "ja": "2.1。要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Terminology",
      "section_title": true,
      "ja": "2.2。用語"
    },
    {
      "indent": 3,
      "text": "o PCP client: denotes a PCP software instance responsible for issuing PCP requests to a PCP server. Refer to [RFC6887].",
      "ja": "O PCPクライアント：PCPサーバへPCP要求を発行する責任PCPソフトウェアのインスタンスを示しています。 [RFC6887]を参照してください。"
    },
    {
      "indent": 3,
      "text": "o PCP server: denotes a software instance that receives and processes PCP requests from a PCP client. A PCP server can be co-located with or be separated from the function it controls (e.g., Network Address Translation (NAT) or firewall). Refer to [RFC6887].",
      "ja": "OのPCPサーバは：PCPクライアントからPCP要求を受け取り、処理するソフトウェアのインスタンスを示しています。 PCPサーバは、と同じ場所に配置することができ、またはそれは制御機能から分離すること（例えば、ネットワークアドレス変換（NAT）またはファイアウォール）。 [RFC6887]を参照してください。"
    },
    {
      "indent": 0,
      "text": "3. IP Address Selection: PCP Server with Multiple IP Addresses",
      "section_title": true,
      "ja": "3. IPアドレスの選択：複数のIPアドレスを持つPCPサーバ"
    },
    {
      "indent": 3,
      "text": "This section describes the behavior a PCP client follows to contact its PCP server when the PCP client has multiple IP addresses for a single PCP server.",
      "ja": "このセクションでは、PCPクライアントがPCPクライアントは、単一のPCPサーバの複数のIPアドレスを持っているそのPCPサーバに接続するには、以下の動作を説明します。"
    },
    {
      "indent": 3,
      "text": "1. A PCP client should construct a set of candidate source addresses (see Section 4 of [RFC6724]) based on application input and PCP [RFC6887] constraints. For example, when sending a PEER or a MAP with a FILTER request for an existing TCP connection, the only candidate source address is the source address used for the existing TCP connection. But when sending a MAP request for a service that will accept incoming connections, the candidate source addresses may be all of the node's IP addresses or some subset of IP addresses on which the service is configured to listen.",
      "ja": "1. A PCPクライアントは、アプリケーションの入力及びPCPに基づく（[RFC6724]のセクション4を参照）[RFC6887]の制約を候補ソースアドレスのセットを構築すべきです。ピアまたは既存のTCP接続のためのフィルタ要求にMAPを送信する場合、例えば、唯一の候補送信元アドレスは、既存のTCP接続に使用されるソースアドレスです。着信接続を受け付けるサービスのMAPリクエストを送信するときしかし、候補送信元アドレスは、ノードのIPアドレスの全部またはサービスがリッスンするように設定されているIPアドレスの一部のサブセットであり得ます。"
    },
    {
      "indent": 3,
      "text": "2. The PCP client then sorts the PCP server IP addresses as per Section 6 of [RFC6724] using the candidate source addresses selected in the previous step as input to the destination address selection algorithm.",
      "ja": "2. PCPクライアントは、宛先アドレス選択アルゴリズムへの入力として前のステップで選択された候補送信元アドレスを使用して、[RFC6724]のセクション6に従ってPCPサーバのIPアドレスをソート。"
    },
    {
      "indent": 3,
      "text": "3. The PCP client initializes its Maximum Retransmission Count (MRC) to 4.",
      "ja": "3. PCPクライアントは4にその最大再送回数（MRC）を初期化します。"
    },
    {
      "indent": 3,
      "text": "4. The PCP client sends its PCP messages following the retransmission procedure specified in Section 8.1.1 of [RFC6887]. If no response is received after MRC attempts, the PCP client retries the procedure with the next IP address in the sorted list.",
      "ja": "4. PCPクライアントは[RFC6887]のセクション8.1.1で指定された再送手順に従ってそのPCPメッセージを送信します。応答がMRCの試みの後に受信されない場合は、PCPクライアントは、ソートされたリスト内の次のIPアドレスを持つプロシージャを再試行します。"
    },
    {
      "indent": 7,
      "text": "The PCP client may receive a response from an IP address after\nexhausting MRC attempts for that particular IP address.  The PCP\nclient SHOULD ignore such a response because receiving a delayed\nresponse after exhausting four retransmissions sent with\nexponentially increasing intervals is an indication that problems\nare to be encountered in the corresponding forwarding path and/or\nwhen processing subsequent requests by that PCP server instance.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "If, when sending PCP requests, the PCP client receives a hard ICMP error [RFC1122], it MUST immediately try the next IP address from the list of PCP server IP addresses.",
      "ja": "PCPリクエストを送信する際に、PCPクライアントは、ハードICMPエラー[RFC1122]を受信した場合、それはすぐにPCPサーバのIPアドレスのリストから、次のIPアドレスを試みなければなりません。"
    },
    {
      "indent": 3,
      "text": "5. If the PCP client has exhausted all IP addresses configured for a given PCP server, the procedure SHOULD be repeated every 15 minutes until the PCP request is successfully answered.",
      "ja": "5. PCPクライアントが与えられたPCPサーバ用に構成されているすべてのIPアドレスを使い果たした場合は、手順が正常に答えているPCP要求するまで、15分ごとに繰り返されるべきです。"
    },
    {
      "indent": 3,
      "text": "6. Once the PCP client has successfully received a response from a PCP server's IP address, all subsequent PCP requests to that PCP server are sent on the same IP address until that IP address becomes unresponsive. In case the IP address becomes unresponsive, the PCP client clears the cache of sorted destination addresses and follows the steps described above to contact the PCP server again.",
      "ja": "6. PCPクライアントが正常にPCPサーバのIPアドレスからの応答を受信すると、そのIPアドレスが応答しなくなるまで、そのPCPサーバへの後続のすべてのPCPの要求は、同じIPアドレスに送信されます。 IPアドレスが応答しなくなった場合には、PCPクライアントは、ソートされた宛先アドレスのキャッシュをクリアし、再びPCPサーバに接続するために、上記の手順に従います。"
    },
    {
      "indent": 3,
      "text": "For efficiency, the PCP client SHOULD use the same Mapping Nonce for requests sent to all IP addresses belonging to the same PCP server. As a reminder, nonce validation checks are performed when operating in the Simple Threat Model (see Section 18.1 of [RFC6887]) to defend against some off-path attacks.",
      "ja": "効率化のために、PCPクライアントが同じPCPサーバに属するすべてのIPアドレスに送信された要求に対して同じマッピングnonceを使用すべきです。単純な脅威モデルで動作しているときにリマインダとして、ノンス検証チェックは、いくつかのオフパス攻撃に対して防御する（[RFC6887]のセクション18.1を参照）が行われます。"
    },
    {
      "indent": 0,
      "text": "4. IP Address Selection: Multiple PCP Servers",
      "section_title": true,
      "ja": "4. IPアドレスの選択：複数のPCPサーバ"
    },
    {
      "indent": 3,
      "text": "This section describes the behavior a PCP client follows to contact multiple PCP servers, with each PCP server reachable on a list of IP addresses. There is no requirement that these multiple PCP servers have the same capabilities.",
      "ja": "このセクションでは、PCPクライアントがIPアドレスのリストに到達可能な各PCPサーバで、複数のPCPサーバに接続するには、以下の動作を説明します。これらの複数のPCPサーバが同じ機能を持っている必要はありません。"
    },
    {
      "indent": 6,
      "text": "Note that how PCP clients are configured to separate lists of IP addresses of each PCP server is implementation specific and deployment specific. For example, a PCP client can be configured using DHCP with multiple lists of PCP server IP addresses; each list is referring to a distinct PCP server [RFC7291].",
      "ja": "どのようにPCPクライアントは、各PCPサーバのIPアドレスの別々のリストに設定されていることは実装固有と展開特異的であることに注意してください。例えば、PCPクライアントは、PCPサーバのIPアドレスを複数のリストにDHCPを使用して設定することができます。各リストは、別個のPCPサーバ[RFC7291]を参照しています。"
    },
    {
      "indent": 3,
      "text": "If several PCP servers are configured, each with multiple IP addresses, the PCP client contacts all PCP servers using the procedure described in Section 3.",
      "ja": "いくつかのPCPサーバが設定されている場合は、複数のIPアドレスを持つ各、PCPクライアントの連絡先セクション3に記載した手順を用いて、すべてのPCPサーバ。"
    },
    {
      "indent": 3,
      "text": "As specified in Sections 11.2 and 12.2 of [RFC6887], the PCP client must use a different Mapping Nonce for each PCP server with which it communicates.",
      "ja": "セクション11.2 [RFC6887]の12.2に規定されているように、PCPクライアントは、それが通信する各PCPサーバに対して異なるマッピングnonceを使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "If the PCP client is configured, using some means, with the capabilities of each PCP server, a PCP client may choose to contact all PCP servers simultaneously or iterate through them with a delay.",
      "ja": "PCPクライアントは、各PCPサーバの機能と、いくつかの手段を用いて、構成されている場合は、PCPのクライアントは、同時にすべてのPCPサーバに問い合わせるか、または遅延してそれらを反復処理することもできます。"
    },
    {
      "indent": 3,
      "text": "This procedure may result in a PCP client instantiating multiple mappings maintained by distinct PCP servers. The decision to use all these mappings or delete some of them depends on the purpose of the PCP request. For example, if the PCP servers are configuring firewall (not NAT) functionality, then the client would, by default (i.e., unless it knows that they all replicate state among them), need to use all the PCP servers.",
      "ja": "この手順は、明確なPCPサーバによって維持複数のマッピングをインスタンス化PCPクライアントになることがあります。すべてのこれらのマッピングを使用するか、またはそれらの一部を削除するという決定は、PCP要求の目的に依存します。 PCPサーバは、ファイアウォール（ないNAT）機能を設定している場合たとえば、クライアントは、デフォルトでは（すなわち、それは彼らのすべてがそれらの間で状態をレプリケートすることを知っている場合を除く）、すべてのPCPサーバを使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Example: Multiple PCP Servers on a Single Interface",
      "section_title": true,
      "ja": "5.例：単一インターフェイス上の複数のPCPサーバ"
    },
    {
      "indent": 3,
      "text": "Figure 1 depicts an example that is used to illustrate the server selection procedure specified in Sections 3 and 4. In this example, PCP servers (A and B) are co-located with edge routers (rtr1 and rtr2) with each PCP server controlling its own device.",
      "ja": "図1は、この例ではセクション3と4で指定されたサーバ選択手順を説明するために使用される例を示すPCPサーバ（AとB）は、各PCPサーバは、その制御とエッジルータ（RTR1とRTR2）と同じ場所に配置されています自装置。"
    },
    {
      "indent": 8,
      "text": "                        ISP Network\n                      |              |\n.........................................................\n                      |              |        Subscriber Network\n           +----------+-----+  +-----+----------+\n           | PCP-Server-A   |  | PCP-Server-B   |\n           |    (rtr1)      |  |   (rtr2)       |\n           +-------+--------+  +--+-------------+\n  192.0.2.1        |              |     198.51.100.1\n  2001:db8:1111::1 |              |     2001:db8:2222::1\n                   |              |\n                   |              |\n            -------+-------+------+-----------\n                           |\n                           |    203.0.113.0\n                           |    2001:db8:3333::1\n                       +---+---+\n                       | Host  |\n                       +-------+",
      "raw": true
    },
    {
      "indent": 1,
      "text": "Edge Routers (rtr1, rtr2)",
      "ja": "エッジルータ（RTR1、RTR2）"
    },
    {
      "indent": 15,
      "text": "Figure 1: Single Uplink, Multiple PCP Servers",
      "ja": "図1：単一のアップリンク、複数のPCPサーバ"
    },
    {
      "indent": 3,
      "text": "The example describes behavior when a single IP address for one PCP server is not responsive. The PCP client is configured with two PCP servers for the same interface, PCP-Server-A and PCP-Server-B, each of which have two IP addresses: an IPv4 address and an IPv6 address. The PCP client wants an IPv4 mapping, so it orders the addresses as follows:",
      "ja": "1台のPCPサーバのための単一のIPアドレスが応答しないときの例では、動作について説明します。 PCPクライアントが同じインターフェイス用の2台のPCPサーバで構成され、2つのIPアドレスを持っているそれぞれのPCP-SERVER-AおよびPCP-SERVER-B、：IPv4アドレスとIPv6アドレス。 PCPクライアントは、IPv4マッピングを望んでいるので、次のようにアドレスを注文します。"
    },
    {
      "indent": 3,
      "text": "o PCP-Server-A:",
      "ja": "O PCP-SERVER-A："
    },
    {
      "indent": 6,
      "text": "* 192.0.2.1",
      "ja": "＊ １９２。０。２。１"
    },
    {
      "indent": 6,
      "text": "* 2001:db8:1111::1",
      "ja": "* 2001：DB8：1111 :: 1"
    },
    {
      "indent": 3,
      "text": "o PCP-Server-B:",
      "ja": "PCP-SERVER-B O："
    },
    {
      "indent": 6,
      "text": "* 198.51.100.1",
      "ja": "＊ １９８。５１。１００。１"
    },
    {
      "indent": 6,
      "text": "* 2001:db8:2222::1",
      "ja": "* 2001：DB8：2222 :: 1"
    },
    {
      "indent": 3,
      "text": "Suppose that:",
      "ja": "仮定："
    },
    {
      "indent": 3,
      "text": "o The path to reach 192.0.2.1 is broken",
      "ja": "O 192.0.2.1に到達するためのパスが壊れています"
    },
    {
      "indent": 3,
      "text": "o The path to reach 2001:db8:1111::1 is working",
      "ja": "Oパスが到達する2001：DB8：1111 :: 1が働いています"
    },
    {
      "indent": 3,
      "text": "o The path to reach 198.51.100.1 is working",
      "ja": "198.51.100.1に到達するためのパスが働いているoを"
    },
    {
      "indent": 3,
      "text": "o The path to reach 2001:db8:2222::1 is working",
      "ja": "Oパスが到達する2001：DB8：2222 :: 1が働いています"
    },
    {
      "indent": 3,
      "text": "It sends two PCP requests at the same time, the first to 192.0.2.1 (corresponding to PCP-Server-A) and the second to 198.51.100.1 (corresponding to PCP-Server-B). The path to 198.51.100.1 is working, so a PCP response is received. Because the path to 192.0.2.1 is broken, no PCP response is received. The PCP client retries four times to elicit a response from 192.0.2.1 and finally gives up on that address and sends a PCP message to 2001::db8:1111:1. That path is working, and a response is received. Thereafter, the PCP client should continue using that responsive IP address for PCP-Server-A (2001:db8:1111::1). In this particular case, it will have to use the THIRD_PARTY option for IPv4 mappings.",
      "ja": "これは、（PCP-サーバBに相当）（PCP-サーバAに相当）192.0.2.1に第一及び第二198.51.100.1に、同時に2つのPCP要求を送信します。 198.51.100.1へのパスが働いているので、PCPの応答が受信されます。 192.0.2.1へのパスが壊れているので、何のPCPの応答が受信されません。 PCPクライアントは192.0.2.1からの応答を引き出すために4回再試行し、最終的にそのアドレスを断念し、2001 :: DB8にPCPメッセージを送信します：1111：1。そのパスが働いている、と応答が受信されます。その後、PCPクライアントは、PCP-SERVER-Aのためにその応答IPアドレスを使用し続ける必要があります（2001：DB8を：1111 :: 1）。この特定のケースでは、それは、IPv4マッピングのTHIRD_PARTYオプションを使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "PCP-related security considerations are discussed in [RFC6887].",
      "ja": "PCP関連のセキュリティの考慮事項は、[RFC6887]で議論されています。"
    },
    {
      "indent": 3,
      "text": "This document does not specify how PCP server addresses are provisioned on the PCP client. It is the responsibility of PCP server provisioning document(s) to elaborate on security considerations to discover legitimate PCP servers.",
      "ja": "この文書では、PCPサーバアドレスがPCPクライアントにプロビジョニングされる方法を指定しません。正当なPCPサーバを発見するために、セキュリティ上の考慮事項について詳しく説明するPCPサーバのプロビジョニングの文書（複数可）の責任です。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月、<http://www.rfc-editor.org/info/rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC6724] Thaler, D., Ed., Draves, R., Matsumoto, A., and T. Chown, \"Default Address Selection for Internet Protocol Version 6 (IPv6)\", RFC 6724, September 2012, <http://www.rfc-editor.org/info/rfc6724>.",
      "ja": "[RFC6724]ターラー、D.、エド、Draves、R.、松本、A.、およびT. CHOWN、 \"インターネットプロトコルバージョン6（IPv6）のためのデフォルトのアドレス選択\"、RFC 6724、2012年9月、<HTTP：/ /www.rfc-editor.org/info/rfc6724>。"
    },
    {
      "indent": 3,
      "text": "[RFC6887] Wing, D., Ed., Cheshire, S., Boucadair, M., Penno, R., and P. Selkirk, \"Port Control Protocol (PCP)\", RFC 6887, April 2013, <http://www.rfc-editor.org/info/rfc6887>.",
      "ja": "[RFC6887]ウイング、D.、エド、チェシャー、S.、Boucadair、M.、Penno、R.、およびP.セルカーク、 \"ポート制御プロトコル（PCP）\"、RFC 6887、2013年4月、<HTTP：/ /www.rfc-editor.org/info/rfc6887>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1122] Braden, R., Ed., \"Requirements for Internet Hosts - Communication Layers\", STD 3, RFC 1122, October 1989, <http://www.rfc-editor.org/info/rfc1122>.",
      "ja": "[RFC1122]ブレーデン、R.、エド、 \"インターネットホストのための要件 - 通信層\"。、STD 3、RFC 1122、1989年10月、<http://www.rfc-editor.org/info/rfc1122>。"
    },
    {
      "indent": 3,
      "text": "[RFC4116] Abley, J., Lindqvist, K., Davies, E., Black, B., and V. Gill, \"IPv4 Multihoming Practices and Limitations\", RFC 4116, July 2005, <http://www.rfc-editor.org/info/rfc4116>.",
      "ja": "[RFC4116] Abley、J.、Lindqvist、K.、デイビス、E.、ブラック、B.、およびV.ギル、 \"IPv4のマルチホーミングプラクティスと制限\"、RFC 4116、2005年7月、<HTTP：//www.rfc -editor.org/info/rfc4116>。"
    },
    {
      "indent": 3,
      "text": "[RFC7291] Boucadair, M., Penno, R., and D. Wing, \"DHCP Options for the Port Control Protocol (PCP)\", RFC 7291, July 2014, <http://www.rfc-editor.org/info/rfc7291>.",
      "ja": "[RFC7291] Boucadair、M.、Penno、R.、およびD.翼、 \"ポート制御プロトコル（PCP）のためのDHCPオプション\"、RFC 7291、2014年7月、<http://www.rfc-editor.org/情報/ rfc7291>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Multihoming",
      "ja": "付録A.マルチホーミング"
    },
    {
      "indent": 3,
      "text": "The main problem of a PCP multihoming situation can be succinctly described as \"one PCP client, multiple PCP servers.\" As described in Section 3, if a PCP client discovers multiple PCP servers, it should send requests to all of them with assumptions described in Section 1.",
      "ja": "PCPマルチホーミング状況の主な問題は、簡潔のように記述することができる「1つのPCPクライアント、複数のPCPサーバ。」第3節で述べたようにPCPのクライアントが複数のPCPサーバを検出した場合、それは第1節で述べた仮定でそれらのすべてに要求を送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "The following sub-sections describe multihoming examples to illustrate the PCP client behavior.",
      "ja": "以下のサブセクションでは、PCPクライアントの動作を説明するためのマルチホーミングの例を説明します。"
    },
    {
      "indent": 0,
      "text": "A.1. IPv6 Multihoming",
      "ja": "A.1。 IPv6のマルチホーミング"
    },
    {
      "indent": 3,
      "text": "In this example of an IPv6 multihomed network, two or more routers co-located with firewalls are present on a single link shared with the host(s). Each router is, in turn, connected to a different service provider network, and the host in this environment would be offered multiple prefixes and advertised multiple DNS servers. Consider a scenario in which firewalls within an IPv6 multihoming environment also implement a PCP server. The PCP client learns the available PCP servers using DHCP [RFC7291] or any other provisioning mechanism. In reference to Figure 2, a typical model is to embed DHCP servers in rtr1 and rtr2. A host located behind rtr1 and rtr2 can contact these two DHCP servers and retrieve from each server the IP address(es) of the corresponding PCP server.",
      "ja": "IPv6のマルチホームネットワークのこの例では、ファイアウォールと同じ場所に複数のルータがホスト（単数または複数）と共有される単一のリンク上に存在します。各ルータは、順番に、異なるサービスプロバイダーのネットワークに接続されており、この環境でのホストが複数のプレフィックスを提供し、複数のDNSサーバーを公示することでしょう。また、PCPサーバを実装したIPv6マルチホーミング環境内ファイアウォールシナリオを考えてみましょう。 PCPクライアントがDHCP [RFC7291]またはその他のプロビジョニングメカニズムを使用して、使用可能なPCPサーバを学習します。図2を参照して、典型的なモデルはRTR1とRTR2にDHCPサーバを埋め込むことです。 RTR1とRTR2の背後にあるホストは、これらの2台のDHCPサーバーに連絡し、各サーバから対応するPCPサーバのIPアドレスを取得することができます。"
    },
    {
      "indent": 3,
      "text": "The PCP client will send PCP requests in parallel to each of the PCP servers.",
      "ja": "PCPクライアントは、PCPサーバのそれぞれに並列にPCPのリクエストを送信します。"
    },
    {
      "indent": 7,
      "text": "                   ==================\n                   |    Internet    |\n                   ==================\n                      |          |\n                      |          |\n                 +----+-+      +-+----+\n                 | ISP1 |      | ISP2 |\n                 +----+-+      +-+----+      ISP Network\n                      |          |\n.........................................................\n                      |          |\n                      |          |        Subscriber Network\n              +-------+---+ +----+------+\n              | rtr1 with | | rtr2 with |\n              |   FW1     | |    FW2    |\n              +-------+---+ +----+------+\n                      |          |\n                      |          |\n               -------+----------+------\n                           |\n                       +---+---+\n                       | Host  |\n                       +-------+",
      "raw": true
    },
    {
      "indent": 24,
      "text": "Figure 2: IPv6 Multihoming",
      "ja": "図2：IPv6のマルチホーミング"
    },
    {
      "indent": 0,
      "text": "A.2. IPv4 Multihoming",
      "ja": "A.2。 IPv4のマルチホーミング"
    },
    {
      "indent": 3,
      "text": "In this example of an IPv4 multihomed network described in \"NAT- or RFC2260-based Multihoming\" (Section 3.3 of [RFC4116]), the gateway router is connected to different service provider networks. This method uses Provider-Aggregatable (PA) addresses assigned by each transit provider to which the site is connected. The site uses NAT to translate the various provider addresses into a single set of private-use addresses within the site. In such a case, two PCP servers might have to be present to configure NAT to each of the transit providers. The PCP client learns the available PCP servers using DHCP [RFC7291] or any other provisioning mechanism. In reference to Figure 3, a typical model is to embed the DHCP server and the PCP servers in rtr1. A host located behind rtr1 can contact the DHCP server to obtain IP addresses of the PCP servers. The PCP client will send PCP requests in parallel to each of the PCP servers.",
      "ja": "「NAT-またはRFC2260ベースマルチホーミング」（[RFC4116]のセクション3.3）に記載のIPv4マルチホーム・ネットワークのこの例では、ゲートウェイルータは、異なるサービスプロバイダのネットワークに接続されています。この方法は、サイトが接続されている各トランジット・プロバイダによって割り当てられたプロバイダ・集約（PA）アドレスを使用します。このサイトは、サイト内の私的使用のアドレスの単一セットにさまざまなプロバイダのアドレスを変換するNATを使用しています。そのような場合には、2台のPCPサーバは、トランジットプロバイダのそれぞれにNATを設定するために存在することが必要になる場合があります。 PCPクライアントがDHCP [RFC7291]またはその他のプロビジョニングメカニズムを使用して、使用可能なPCPサーバを学習します。図3を参照するには、典型的なモデルは、DHCPサーバとRTR1におけるPCPサーバを埋め込むことです。 RTR1の背後にあるホストは、PCPサーバのIPアドレスを取得するためにDHCPサーバーに接続することができます。 PCPクライアントは、PCPサーバのそれぞれに並列にPCPのリクエストを送信します。"
    },
    {
      "indent": 9,
      "text": "               =====================\n               |    Internet       |\n               =====================\n                  |              |\n                  |              |\n             +----+--------+   +-+------------+\n             | ISP1        |   | ISP2         |\n             |             |   |              |\n             +----+--------+   +-+------------+ ISP Network\n                  |              |\n                  |              |\n..............................................................\n                  |              |\n                  | Port1        | Port2    Subscriber Network\n                  |              |\n             +----+--------------+----+\n             |rtr1: NAT & PCP servers |\n             |       GW Router        |\n             +----+-------------------+\n                  |\n                  |\n                  |\n             -----+--------------\n                  |\n                +-+-----+\n                | Host  |  (private address space)\n                +-------+",
      "raw": true
    },
    {
      "indent": 24,
      "text": "Figure 3: IPv4 Multihoming",
      "ja": "図3：IPv4のマルチホーミング"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks to Dave Thaler, Simon Perreault, Hassnaa Moustafa, Ted Lemon, Chris Inacio, and Brian Haberman for their reviews and comments.",
      "ja": "彼らのレビューとコメントのためデーブターラー、サイモン・ペロー、Hassnaa Moustafa、テッド・レモン、クリス・イナシオ、そしてブライアンハーバーマンに感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Mohamed Boucadair France Telecom Rennes 35000 France",
      "ja": "モハメド・Boucadairフランステレコム35000レンヌフランス"
    },
    {
      "indent": 3,
      "text": "EMail: mohamed.boucadair@orange.com",
      "ja": "メールアドレス：mohamed.boucadair@orange.com"
    },
    {
      "indent": 3,
      "text": "Reinaldo Penno Cisco Systems, Inc. United States",
      "ja": "レイナルドPennoシスコシステムズ、Inc.の米国"
    },
    {
      "indent": 3,
      "text": "EMail: repenno@cisco.com",
      "ja": "メールアドレス：repenno@cisco.com"
    },
    {
      "indent": 3,
      "text": "Dan Wing Cisco Systems, Inc. 170 West Tasman Drive San Jose, California 95134 United States",
      "ja": "ダン・ウィングシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、カリフォルニア95134米国"
    },
    {
      "indent": 3,
      "text": "EMail: dwing@cisco.com",
      "ja": "メールアドレス：dwing@cisco.com"
    },
    {
      "indent": 3,
      "text": "Prashanth Patil Cisco Systems, Inc. Bangalore India",
      "ja": "プラシャンスパティルシスコシステムズバンガロールインド"
    },
    {
      "indent": 3,
      "text": "EMail: praspati@cisco.com",
      "ja": "メールアドレス：praspati@cisco.com"
    },
    {
      "indent": 3,
      "text": "Tirumaleswar Reddy Cisco Systems, Inc. Cessna Business Park, Varthur Hobli Sarjapur Marathalli Outer Ring Road Bangalore, Karnataka 560103 India",
      "ja": "Tirumaleswarレディシスコシステムズ、株式会社セスナビジネスパーク、Varthur HobliサリヤプールMarathalli外環状道路カルナータカ州バンガロール560103インド"
    },
    {
      "indent": 3,
      "text": "EMail: tireddy@cisco.com",
      "ja": "メールアドレス：tireddy@cisco.com"
    }
  ]
}