{
  "title": {
    "text": "RFC 7917 - Advertising Node Administrative Tags in IS-IS",
    "ja": "RFC 7917 - IS-ISで広告ノードの管理タグ"
  },
  "number": 7917,
  "created_at": "2019-11-01 21:41:00.853289+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                    P. Sarkar, Ed.\nRequest for Comments: 7917                        Individual Contributor\nCategory: Standards Track                                     H. Gredler\nISSN: 2070-1721                                             RtBrick Inc.\n                                                                S. Hegde\n                                                  Juniper Networks, Inc.\n                                                            S. Litkowski\n                                                             B. Decraene\n                                                                  Orange\n                                                               July 2016",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Advertising Node Administrative Tags in IS-IS",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes an extension to the IS-IS routing protocol to advertise node administrative tags. This optional capability allows tagging and grouping of the nodes in an IS-IS domain. The node administrative tags can be used to express and apply locally defined network policies, thereby providing a very useful operational capability. Node administrative tags may be used by either IS-IS itself or other applications consuming information propagated via IS-IS.",
      "ja": "この文書では、ノード管理タグを宣伝するためにIS-ISルーティングプロトコルの拡張について説明します。このオプション機能は、IS-ISドメインでタグ付けし、ノードのグループ化を可能にします。ノード管理タグは、それにより非常に有用な演算能力を提供し、発現し、ローカルに定義されたネットワークポリシーを適用するために使用することができます。ノード管理タグのいずれかで使用することができる、それ自体またはIS-ISを経由して伝播した情報を消費する他のアプリケーションIS-IS。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7917.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7917で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Requirements Language ......................................3\n2. Node Administrative Tags ........................................3\n3. Node Administrative Tag (Node-Admin-Tag) Sub-TLV ................3\n   3.1. TLV Format .................................................4\n4. Elements of Procedure ...........................................5\n   4.1. Interpretation of Node Administrative Tags .................5\n   4.2. Use of Node Administrative Tags ............................5\n   4.3. Processing Node Administrative Tag Changes .................6\n5. Applications ....................................................7\n6. Security Considerations .........................................7\n7. Operational Considerations ......................................8\n8. Manageability Considerations ....................................8\n9. IANA Considerations .............................................8\n10. References .....................................................9\n   10.1. Normative References ......................................9\n   10.2. Informative References ....................................9\nAcknowledgments ...................................................11\nContributors ......................................................11\nAuthors' Addresses ................................................11",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "It is useful to assign a node administrative tag to a router in the IS-IS domain and use it as an attribute associated with the node. The node administrative tag can be used in variety of applications. For example:",
      "ja": "IS-ISドメイン内のルータにノード管理タグを割り当てて、ノードに関連付けられた属性としてそれを使用すると便利です。ノード管理タグは、種々の用途に使用することができます。例えば："
    },
    {
      "indent": 3,
      "text": "(a) Traffic-engineering applications to provide different path-selection criteria.",
      "ja": "（a）のトラフィック・エンジニアリングアプリケーションは、異なるパスの選択基準を提供します。"
    },
    {
      "indent": 3,
      "text": "(b) Preference for, or pruning of, certain paths in Loop-Free Alternate (LFA) [RFC5286] backup selection via local policies as defined in [RFC7916].",
      "ja": "（B）に対する好み、またはローカルポリシーを介して、ループのない代替（LFA）[RFC5286]バックアップ選択で、特定のパスの刈り込みを[RFC7916]で定義されます。"
    },
    {
      "indent": 3,
      "text": "This document provides mechanisms to advertise node administrative tags in IS-IS for various applications, including (but not limited to) route and path selection. Route and path selection functionality applies to both Traffic Engineering (TE) and non-TE applications. Hence, the new sub-TLV for carrying node administrative tags is included in the Router CAPABILITY TLV [RFC4971].",
      "ja": "この文書は、ルート及び経路選択（に限定されるものではない）を含む様々な用途にIS-ISにノード管理タグをアドバタイズするためのメカニズムを提供します。ルートおよびパスの選択機能は、トラフィックエンジニアリング（TE）と非TEアプリケーションの両方に適用されます。したがって、ノードの管理タグを搬送するための新たなサブTLVは、ルータCAPABILITY TLV [RFC4971]に含まれています。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "ja": "1.1。要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Node Administrative Tags",
      "section_title": true,
      "ja": "2.ノードの管理タグ"
    },
    {
      "indent": 3,
      "text": "An administrative tag is a 32-bit unsigned integer value that can be used to identify a group of nodes in the IS-IS domain. An IS-IS router should advertise in the specific IS-IS level the set of groups of which it is a part.",
      "ja": "管理タグは、IS-ISドメイン内のノードのグループを識別するために使用できる32ビットの符号なし整数値です。具体的に宣伝すべきであるIS-ISルータは、それが一部であるグループのセットをレベルです。"
    },
    {
      "indent": 3,
      "text": "As an example, all edge network devices in a given network may be configured with a certain tag value, whereas all core network devices may be configured with another, different tag value.",
      "ja": "すべてのコアネットワーク装置が、相互に異なるタグ値を構成することができる一方で、一例として、所与のネットワーク内のすべてのエッジネットワークデバイスは、特定のタグ値を使用して構成されてもよいです。"
    },
    {
      "indent": 0,
      "text": "3. Node Administrative Tag (Node-Admin-Tag) Sub-TLV",
      "section_title": true,
      "ja": "3.ノードの管理タグ（ノード管理タグ）サブTLV"
    },
    {
      "indent": 3,
      "text": "The new sub-TLV defined in this document is carried within an IS-IS Router CAPABILITY TLV (IS-IS TLV type 242) [RFC4971] in the Link State PDUs originated by the device. Router CAPABILITY TLVs [RFC4971] can have \"level-wide\" or \"domain-wide\" flooding scope. The choice of flooding scope in which a specific node administrative tag shall be flooded is purely a matter of local policy and is defined by the operator's usage needs. An operator MAY choose to advertise a set of node administrative tags across levels and another different set of node administrative tags within the specific level. Alternatively, the operator may use the same node administrative tags within both the \"domain-wide\" flooding scope and one or more \"level-wide\" flooding scopes.",
      "ja": "この文書で定義された新しいサブTLVは、IS-ISルータ機能デバイスによって発信リンク状態のPDUにTLV（TLVタイプ242-IS）[RFC4971]の中で運ばれます。ルータ機能のTLV [RFC4971]は、「レベル・ワイド」または「ドメイン全体の」フラッディングスコープを持つことができます。特定のノード管理タグが殺到するものとした氾濫範囲の選択は純粋にローカルポリシーの問題であり、事業者の使用状況のニーズによって定義されます。オペレータは、レベル間のノード管理タグのセットと、特定のレベル内のノード管理タグの別の異なるセットを宣伝するために選ぶかもしれません。あるいは、オペレータは、「ドメイン全体の」氾濫範囲及び1つ以上の「レベルワイド」フラッディングスコープの両方内の同じノード管理タグを使用することができます。"
    },
    {
      "indent": 3,
      "text": "The format of the Node Administrative Tag (Node-Admin-Tag) sub-TLV (see Section 3.1) does not include a topology identifier. Therefore, it is not possible to indicate a topology-specific context when advertising node administrative tags. Hence, in deployments using multi-topology routing [RFC5120], advertising a separate set of node administrative tags for each topology SHOULD NOT be supported.",
      "ja": "ノード管理タグ（ノード管理タグ）サブTLV（セクション3.1を参照）のフォーマットは、トポロジーの識別子が含まれていません。したがって、ノード管理タグを広告するとき、トポロジ固有のコンテキストを示すことはできません。したがって、各トポロジのノードの管理タグの別個のセットを広告するマルチトポロジルーティング[RFC5120]を使用して展開でサポートされるべきではありません。"
    },
    {
      "indent": 0,
      "text": "3.1. TLV Format",
      "section_title": true,
      "ja": "3.1。 TLVのフォーマット"
    },
    {
      "indent": 3,
      "text": "[RFC4971] defines the Router CAPABILITY TLV, which may be used to advertise properties of the originating router. The payload of the Router CAPABILITY TLV consists of one or more nested Type-Length-Value (TLV) triplets.",
      "ja": "[RFC4971]は、元のルータの特性を宣伝するために使用することができるルータ能力TLVを定義します。 TLVは、1つ以上のネストされたタイプレングス値（TLV）トリプレットから成るルータ機能のペイロード。"
    },
    {
      "indent": 3,
      "text": "The new Node-Admin-Tag sub-TLV, like other IS-IS sub-TLVs, is formatted as TLV triplets. Figure 1 below shows the format of the new sub-TLV.",
      "ja": "その他のような新しいノード管理タグサブTLVは、サブのTLV-IS、TLVトリプレットとしてフォーマットされます。図1は、以下の新たなサブTLVのフォーマットを示します。"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Administrative Tag #1                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Administrative Tag #2                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n//                                                             //\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Administrative Tag #N                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 4,
      "text": "Type: 21 (Node-Admin-Tag)",
      "ja": "タイプ：21（ノード管理タグ）"
    },
    {
      "indent": 4,
      "text": "Length: An 8-bit field that indicates the length of the Value portion in octets; this will be a multiple of 4 octets, depending on the number of tags advertised.",
      "ja": "長さ：オクテット値の部分の長さを示す8ビットのフィールド。これは宣伝タグの数に応じて、4つのオクテットの倍数になります。"
    },
    {
      "indent": 4,
      "text": "Value: Defines the node administrative tags (Administrative Tag #1, Administrative Tag #2, etc.). Multiples of 4 octets.",
      "ja": "値：ノード管理タグ（管理タグ＃1、管理タグ＃2、など）を定義します。 4つのオクテットの倍数。"
    },
    {
      "indent": 18,
      "text": "Figure 1: IS-IS Node-Admin-Tag Sub-TLV",
      "ja": "図1：IS-ISノード管理タグサブTLV"
    },
    {
      "indent": 0,
      "text": "4. Elements of Procedure",
      "section_title": true,
      "ja": "手順の4要素"
    },
    {
      "indent": 0,
      "text": "4.1. Interpretation of Node Administrative Tags",
      "section_title": true,
      "ja": "4.1。ノードの管理タグの解釈"
    },
    {
      "indent": 3,
      "text": "The meaning of node administrative tags is generally opaque to IS-IS. A router advertising one or more node administrative tags may be configured to do so without knowing (or even explicitly supporting) the functionality implied by the tag. This section describes general rules, regulations, and guidelines for using and interpreting a node administrative tag; these rules, regulations, and guidelines will facilitate interoperable implementations between vendors.",
      "ja": "ノード管理タグの意味は、IS-ISに一般的に不透明です。ルータ広告一つ以上のノード管理タグはタグによって暗黙の機能を知っている（あるいは明示的にサポートする）せずにそうするように構成することができます。このセクションでは、ノードの管理タグを使用して解釈するための一般的な規則、規制、およびガイドラインについて説明し、これらの規則、規制、ガイドラインは、ベンダー間の相互運用可能な実装を容易にするであろう。"
    },
    {
      "indent": 3,
      "text": "Interpretation of tag values is specific to the administrative domain of a particular network operator. Hence, tag values SHOULD NOT be propagated outside the administrative domain to which they apply. The meaning of a node administrative tag is defined by the network local policy and is controlled via configuration. If a receiving node does not understand the tag value, it ignores the specific tag and floods the Router CAPABILITY TLV without any change, as defined in [RFC4971].",
      "ja": "タグ値の解釈は、特定のネットワークオペレータの管理ドメインに特異的です。このため、タグ値は、それらが適用される管理ドメインの外に伝播されるべきではありません。ノード管理タグの意味は、ネットワーク、ローカルポリシーによって定義され、コンフィギュレーションを介して制御されます。受信ノードは、タグ値を理解していない場合、それは特定のタグを無視して、[RFC4971]で定義されるように、変更することなく、ルータ機能TLVをフラッディング。"
    },
    {
      "indent": 3,
      "text": "The semantics of the tag order has no meaning. There is no implied meaning to the ordering of the tags that indicates a certain operation or set of operations that need to be performed based on the ordering.",
      "ja": "タグの順序の意味論は意味を持ちません。特定の操作や順序に基づいて実行する必要のある一連の操作を示し、タグの順序への暗黙的な意味はありません。"
    },
    {
      "indent": 3,
      "text": "Each tag SHOULD be treated as an independent identifier that may be used in a policy to perform a policy action. Each tag carried by the Node-Admin-Tag sub-TLVs should be used to indicate a characteristic of a node that is independent of the characteristics indicated by other administrative tags within the same instance or another instance of a Node-Admin-Tag sub-TLV. The list of node administrative tags carried in a Node-Admin-Tag sub-TLV MUST be considered as an unordered list. Whilst policies may be implemented based on the presence of multiple tags (e.g., if tag A AND tag B are present), they MUST NOT be reliant upon the order of the tags (i.e., all policies should be considered commutative operations, such that tag A preceding or following tag B does not change their outcome).",
      "ja": "各タグは、ポリシー・アクションを実行するポリシーで使用することができる独立した識別子として扱われるべきです。各タグは、サブのTLVが同じインスタンスまたはノード管理タグの別のインスタンス内の他の管理タグによって示される特性とは独立しているノードの特性を示すために使用されるべきサブノード管理タグによって運ばTLV。ノード管理タグサブTLVで運ばれたノード管理タグのリストは、順不同リストとして考えなければなりません。 （タグAとタグBが存在する場合など、）ポリシーが複数のタグの存在に基づいて実施することができる一方で、彼らはタグの順序に依存しているはずがありません（すなわち、すべてのポリシーは、可換演算考慮しなければならない、そのようなそのタグ前後のタグB）は、それらの結果を変更しません。"
    },
    {
      "indent": 0,
      "text": "4.2. Use of Node Administrative Tags",
      "section_title": true,
      "ja": "4.2。ノードの管理タグの使用"
    },
    {
      "indent": 3,
      "text": "The node administrative tags are not meant to be extended by future IS-IS standards. New IS-IS extensions are not expected to require the use of node administrative tags or define well-known tag values. Node administrative tags are for generic use and do not require IANA registration. Future IS-IS extensions requiring well-known values MAY define their own data signaling tailored to the needs of the feature or MAY use the Router CAPABILITY TLV as defined in [RFC4971].",
      "ja": "ノード管理タグは、標準規格IS-IS将来によって拡張することを意味するものではありません。新は、IS-ISの拡張機能は、ノード管理タグの使用を必要としたり、よく知られたタグ値を定義することが期待されていません。ノード管理タグは、一般的な使用のためであり、IANA登録を必要としません。将来は、周知の値を必要とする拡張機能は機能のニーズに合わせた独自のデータシグナリングを定義するか、または[RFC4971]で定義されるように、ルータ機能TLVを使用するかもしれ - です。"
    },
    {
      "indent": 3,
      "text": "Node administrative tags are expected to be associated with a stable attribute. In particular, node administrative tags MUST NOT be associated with something whose state can oscillate frequently, e.g., the reachability of a specific destination.",
      "ja": "ノード管理タグは安定した属性に関連付けされることが期待されます。具体的には、ノード管理タグは、その状態、例えば、頻繁に特定の宛先の到達可能性を発振できるものと関連してはいけません。"
    },
    {
      "indent": 3,
      "text": "While no specific limit on the number of node administrative tags that may be advertised has been defined, it is expected that only a modest number of tags will be required in any deployment.",
      "ja": "宣伝することができるノード管理タグの数には特に制限は定義されていないが、タグのわずかな数は任意の展開に必要とされることが予想されます。"
    },
    {
      "indent": 0,
      "text": "4.3. Processing Node Administrative Tag Changes",
      "section_title": true,
      "ja": "4.3。処理ノードの管理タグの変更"
    },
    {
      "indent": 3,
      "text": "Multiple Node-Admin-Tag sub-TLVs MAY appear in a Router CAPABILITY TLV, or Node-Admin-Tag sub-TLVs MAY be contained in different instances of Router CAPABILITY TLVs. The node administrative tags associated with a node that originates tags for the purpose of any computation or processing at a receiving node SHOULD be a superset of node administrative tags from all the TLVs in all the instances of Router CAPABILITY TLVs received in the Link State PDU(s) advertised by the corresponding IS-IS router. When a Router CAPABILITY TLV is received that changes the set of node administrative tags applicable to any originating node, a receiving node MUST repeat any computation or processing that makes use of node administrative tags.",
      "ja": "複数のノードの管理タグサブTLVがTLVルータ機能で表示されたり、ノード管理タグサブTLVがルータ機能のTLVの異なるインスタンスに含まれていてもよいです。受信ノードにおける任意の計算又は処理のためにタグを発信したノードに関連付けられているノード管理タグは（のTLVはリンク状態PDUで受信したルータ機能のすべてのインスタンス内のすべてのTLVからノード管理タグのスーパーセットである必要があり対応によってアドバタイズsが）IS-ISルータ。ルータ機能TLVは、任意の発信元ノードに適用可能なノードの管理タグのセットを変更し、その受信した場合、受信ノードは、ノードの管理タグを利用する任意の計算又は処理を繰り返す必要があります。"
    },
    {
      "indent": 3,
      "text": "When there is a change to, or removal of, an administrative affiliation of a node, the node MUST re-originate the Router CAPABILITY TLV(s) with the latest set of node administrative tags. On a receiving router, on detecting a change in contents (or removal) of existing Node-Admin-Tag sub-TLV(s) or the addition of new Node-Admin-Tag sub-TLV(s) in any instance of Router CAPABILITY TLV(s), implementations MUST take appropriate measures to update their state according to the changed set of node administrative tags. The exact actions needed will vary, depending on what features are associated with node administrative tags; this topic is outside the scope of this specification.",
      "ja": "変更、または削除、ノードの管理所属がある場合、ノードは、管理タグの最新のセットを持つルータ機能TLV（複数可）を再発信する必要があります。受信ルータに、ノード管理タグサブTLV（S）またはルータの能力の任意のインスタンスに新しいノード管理タグサブTLV（S）の添加を、既存のコンテンツ（又は除去）の変化を検出することにTLV（s）は、実装は、ノード管理タグの変更された設定に応じてその状態を更新するための適切な措置を取らなければなりません。必要な正確なアクションは、ノード管理用タグに関連付けられているかの機能によって異なります。このトピックでは、この仕様の範囲外です。"
    },
    {
      "indent": 0,
      "text": "5. Applications",
      "section_title": true,
      "ja": "5.アプリケーション"
    },
    {
      "indent": 3,
      "text": "[RFC7777] lists several non-normative examples of how implementations might use node administrative tags. These examples are given only to demonstrate the generic usefulness of the router tagging mechanism. An implementation supporting this specification is not required to implement any of the use cases. The following is a brief list of non-normative use cases listed in [RFC7777]. Please refer to Section 3 of [RFC7777] for more details.",
      "ja": "[RFC7777]は実装がノード管理タグを使用する方法のいくつかの非規範的な例を示しています。これらの例は、ルータタギングメカニズムの一般的な有用性を実証するためにのみ与えられています。この仕様をサポートする実装では、ユースケースのいずれかを実装する必要はありません。以下は、[RFC7777]に記載されている非標準使用例簡単なリストです。詳細については、[RFC7777]のセクション3を参照してください。"
    },
    {
      "indent": 3,
      "text": "1. Auto-discovery of services",
      "section_title": true,
      "ja": "サービスの1.自動検出"
    },
    {
      "indent": 3,
      "text": "2. Policy-based Fast Reroute (FRR)",
      "section_title": true,
      "ja": "2.ポリシーベースの高速リルート（FRR）"
    },
    {
      "indent": 7,
      "text": "(a) Administrative limitation of LFA scope",
      "ja": "LFA範囲の（a）の管理制限"
    },
    {
      "indent": 7,
      "text": "(b) Optimizing LFA calculations",
      "ja": "（b）は、LFA計算を最適化"
    },
    {
      "indent": 3,
      "text": "3. Controlling remote LFA tunnel termination",
      "section_title": true,
      "ja": "3.リモコンLFAトンネル終端"
    },
    {
      "indent": 3,
      "text": "4. Mobile backhaul network service deployment",
      "section_title": true,
      "ja": "4.モバイルバックホールネットワークサービスの展開"
    },
    {
      "indent": 3,
      "text": "5. Policy-based explicit routing",
      "section_title": true,
      "ja": "5.ポリシーベースルーティングの明示的"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not introduce any new security issues. Node administrative tags, like link administrative tags (a.k.a. administrative groups) [RFC5305], can be used by operators to indicate geographical location or other sensitive information. The information carried in node administrative tags, like link administrative tags, can be leaked to an IGP snooper.",
      "ja": "このドキュメントは、どんな新しいセキュリティ問題を紹介しません。リンク管理タグ（別名管理グループ）[RFC5305]のようなノードの管理タグは、地理的な場所または他の機密情報を示すためにオペレータが使用することができます。ノード管理タグで運ばれた情報は、リンク管理タグのように、IGPスヌーパに流出することができます。"
    },
    {
      "indent": 3,
      "text": "Advertisement of tag values for one administrative domain into another involves the risk of misinterpretation of the tag values (if the two domains have assigned different meanings to the same values) and may have undesirable and unanticipated side effects.",
      "ja": "別に1つの管理ドメインのタグ値の広告は、タグ値の誤解のリスクを伴う（2つのドメインが同じ値に異なる意味を割り当てている場合）、望ましくないと予期せぬ副作用を有することができます。"
    },
    {
      "indent": 3,
      "text": "Security concerns for IS-IS are already addressed in [ISO10589], [RFC5304], and [RFC5310] and are applicable to the mechanisms described in this document. Extended authentication mechanisms described in [RFC5304] or [RFC5310] SHOULD be used in deployments where attackers have access to the physical networks, because nodes included in the IS-IS domain are vulnerable.",
      "ja": "IS-ISのためのセキュリティ上の懸念はすでに[ISO10589]、[RFC5304]、および[RFC5310]で対処し、この文書で説明メカニズムに適用可能です。ノードはIS-ISドメインに含まれるので、[RFC5304]または[RFC5310]に記載の拡張認証メカニズムは、攻撃者が物理的なネットワークへのアクセスを持って展開で使用されるべき脆弱です。"
    },
    {
      "indent": 0,
      "text": "7. Operational Considerations",
      "section_title": true,
      "ja": "7.運用に関する注意事項"
    },
    {
      "indent": 3,
      "text": "Operators can assign a meaning to the node administrative tags that is local to the operator's administrative domain. The operational use of node administrative tags is analogical to the IS-IS prefix tags [RFC5130] and BGP communities [RFC1997]. Operational discipline and procedures followed in configuring and using BGP communities and IS-IS prefix tags are also applicable to the usage of node administrative tags.",
      "ja": "オペレータは、オペレータの管理ドメインにローカルであるノード管理タグに意味を割り当てることができます。ノード管理タグの操作上の使用は、接頭辞タグ[RFC5130]とBGPコミュニティ[RFC1997] IS-ISへの類推です。運用規律と手順は、ノード管理用タグの利用に適用されるBGPコミュニティを構成し、使用に続き、接頭辞タグ-IS。"
    },
    {
      "indent": 3,
      "text": "Defining a language for local policies is outside the scope of this document. As is the case with other policy applications, the pruning policies can cause the path to be completely removed from the forwarding plane and hence have the potential for a more severe impact on operations (e.g., node unreachability due to path removal) as compared to preference policies that only affect path selection.",
      "ja": "ローカルポリシーの言語を定義することは、この文書の範囲外です。他のポリシーのアプリケーションと同様に、剪定ポリシーは完全に転送プレーンから削除する経路を引き起こし、したがって、（例えば、原因経路の除去にノード到達不能）嗜好と比較して、操作の詳細深刻な影響の可能性を有することができます唯一のパス選択に影響を与える方針。"
    },
    {
      "indent": 0,
      "text": "8. Manageability Considerations",
      "section_title": true,
      "ja": "8.管理性の考慮事項"
    },
    {
      "indent": 3,
      "text": "Node administrative tags are configured and managed using routing policy enhancements. YANG [RFC6020] is a data modeling language used to specify configuration data models. The IS-IS YANG data model is described in [YANG-ISIS-CFG], and the routing policy configuration model is described in [RTG-POLICY-MODEL]. At the time of writing this document, some work to enhance these two other documents so that they include configurations related to node administrative tags is either already in progress or shall be taken up soon.",
      "ja": "ノード管理タグが設定されたルーティングポリシーの拡張機能を使用して管理されています。 YANG [RFC6020]はコンフィギュレーション・データモデルを指定するために使用されるデータモデリング言語です。 ISIS YANGデータモデルは、[YANG-ISIS-CFG]に記載され、ルーティングポリシー構成モデルは、[RTG-POLICY-MODEL]に記載されています。この文書を書いている時点で、彼らは行政のタグをノードに関連した構成を含むように、これらの二つの他の文書を強化するためのいくつかの作業はすでに進行中であるか、またはすぐに講じなければなりません。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This specification updates one IS-IS registry: the \"Sub-TLVs for TLV 242\" registry. The following value has been registered.",
      "ja": "レジストリ「TLV 242のためのサブのTLV」：この仕様は、1つのIS-ISレジストリ更新します。以下の値が登録されています。"
    },
    {
      "indent": 3,
      "text": "Value  Description\n-----  -----------\n21     Node-Admin-Tag",
      "raw": true
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[ISO10589] International Organization for Standardization, \"Intermediate System to Intermediate System intra-domain routeing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode network service (ISO 8473)\", ISO Standard 10589, 2002.",
      "ja": "[ISO10589]国際標準化機構、ISO標準10589、2002「（ISO 8473）コネクションレスモードのネットワークサービスを提供するためのプロトコルと共に使用するための情報交換プロトコルをrouteingする中間システム中間システムにイントラドメイン」。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC4971] Vasseur, JP., Ed., Shen, N., Ed., and R. Aggarwal, Ed., \"Intermediate System to Intermediate System (IS-IS) Extensions for Advertising Router Information\", RFC 4971, DOI 10.17487/RFC4971, July 2007, <http://www.rfc-editor.org/info/rfc4971>.",
      "ja": "[RFC4971] Vasseur、JP。、エド。、シェン、N.、エド。、およびR.アガルワル、エド。、 \"中間システム（IS-IS）広告ルータ情報のための拡張機能への中間システム\"、RFC 4971、DOI 10.17487 / RFC4971、2007年7月、<http://www.rfc-editor.org/info/rfc4971>。"
    },
    {
      "indent": 3,
      "text": "[RFC5304] Li, T. and R. Atkinson, \"IS-IS Cryptographic Authentication\", RFC 5304, DOI 10.17487/RFC5304, October 2008, <http://www.rfc-editor.org/info/rfc5304>.",
      "ja": "[RFC5304]李、T.、およびR.アトキンソンは、 \"IS-IS暗号認証\"、RFC 5304、DOI 10.17487 / RFC5304、2008年10月、<http://www.rfc-editor.org/info/rfc5304>。"
    },
    {
      "indent": 3,
      "text": "[RFC5310] Bhatia, M., Manral, V., Li, T., Atkinson, R., White, R., and M. Fanto, \"IS-IS Generic Cryptographic Authentication\", RFC 5310, DOI 10.17487/RFC5310, February 2009, <http://www.rfc-editor.org/info/rfc5310>.",
      "ja": "[RFC5310] Bhatiaは、M.、Manral、V.、李、T.、アトキンソン、R.、ホワイト、R.、およびM. Fantoは、 \"IS-ISジェネリック暗号認証\"、RFC 5310、DOI 10.17487 / RFC5310、 2009年2月、<http://www.rfc-editor.org/info/rfc5310>。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1997] Chandra, R., Traina, P., and T. Li, \"BGP Communities Attribute\", RFC 1997, DOI 10.17487/RFC1997, August 1996, <http://www.rfc-editor.org/info/rfc1997>.",
      "ja": "[RFC1997]チャンドラ、R.、Trainaの、P.、およびT.李、 \"BGPコミュニティ属性\"、RFC 1997、DOI 10.17487は/ RFC1997、1996年8月、<http://www.rfc-editor.org/info/ RFC1997>。"
    },
    {
      "indent": 3,
      "text": "[RFC5120] Przygienda, T., Shen, N., and N. Sheth, \"M-ISIS: Multi Topology (MT) Routing in Intermediate System to Intermediate Systems (IS-ISs)\", RFC 5120, DOI 10.17487/RFC5120, February 2008, <http://www.rfc-editor.org/info/rfc5120>.",
      "ja": "[RFC5120] Przygienda、T.、シェン、N.、およびN. Sheth、 \"M-ISIS：中間システムへの中間システムにおけるマルチトポロジー（MT）ルーティング（IS-ISS）\"、RFC 5120、DOI 10.17487 / RFC5120、 2008年2月、<http://www.rfc-editor.org/info/rfc5120>。"
    },
    {
      "indent": 3,
      "text": "[RFC5130] Previdi, S., Shand, M., Ed., and C. Martin, \"A Policy Control Mechanism in IS-IS Using Administrative Tags\", RFC 5130, DOI 10.17487/RFC5130, February 2008, <http://www.rfc-editor.org/info/rfc5130>.",
      "ja": "[RFC5130] Previdi、S.、シャンド、M.、エド、およびC.マーティン、RFC 5130、DOI 10.17487 / RFC5130、2008年2月、<HTTP \"IS-ISの管理タグの使用におけるポリシー制御メカニズム\"：。/ /www.rfc-editor.org/info/rfc5130>。"
    },
    {
      "indent": 3,
      "text": "[RFC5286] Atlas, A., Ed., and A. Zinin, Ed., \"Basic Specification for IP Fast Reroute: Loop-Free Alternates\", RFC 5286, DOI 10.17487/RFC5286, September 2008, <http://www.rfc-editor.org/info/rfc5286>.",
      "ja": "[RFC5286]アトラス、A.、エド、およびA.ジニン、エド、。。 \"IP高速リルートのための基本仕様：ループフリーのAlternates\"、RFC 5286、DOI 10.17487 / RFC5286、2008年9月、<のhttp：// WWW .rfc-editor.org /情報/ rfc5286>。"
    },
    {
      "indent": 3,
      "text": "[RFC5305] Li, T. and H. Smit, \"IS-IS Extensions for Traffic Engineering\", RFC 5305, DOI 10.17487/RFC5305, October 2008, <http://www.rfc-editor.org/info/rfc5305>.",
      "ja": "[RFC5305]李、T.とH.スミットは、 \"IS-ISトラフィックエンジニアリングのための拡張機能\"、RFC 5305、DOI 10.17487 / RFC5305、2008年10月、<http://www.rfc-editor.org/info/rfc5305> 。"
    },
    {
      "indent": 3,
      "text": "[RFC6020] Bjorklund, M., Ed., \"YANG - A Data Modeling Language for the Network Configuration Protocol (NETCONF)\", RFC 6020, DOI 10.17487/RFC6020, October 2010, <http://www.rfc-editor.org/info/rfc6020>.",
      "ja": "[RFC6020] Bjorklund、M.、エド、 \"YANG  - ネットワーク構成プロトコルのためのデータモデリング言語（NETCONF）\"、RFC 6020、DOI 10.17487 / RFC6020、2010年10月、<のhttp：。//www.rfc-editor。組織/情報/ rfc6020>。"
    },
    {
      "indent": 3,
      "text": "[RFC7777] Hegde, S., Shakir, R., Smirnov, A., Li, Z., and B. Decraene, \"Advertising Node Administrative Tags in OSPF\", RFC 7777, DOI 10.17487/RFC7777, March 2016, <http://www.rfc-editor.org/info/rfc7777>.",
      "ja": "[RFC7777] Hegde、S.、Shakir、R.、スミルノフ、A.、李、Z.、およびB. Decraene、 \"OSPFで広告ノードの管理タグ\"、RFC 7777、DOI 10.17487 / RFC7777、2016年3月、<HTTP ：//www.rfc-editor.org/info/rfc7777>。"
    },
    {
      "indent": 3,
      "text": "[RFC7916] Litkowski, S., Ed., Decraene, B., Filsfils, C., Raza, K., Horneffer, M., and P. Sarkar, \"Operational Management of Loop-Free Alternates\", RFC 7916, DOI 10.17487/RFC7916, July 2016, <http://www.rfc-editor.org/info/rfc7916>.",
      "ja": "[RFC7916] Litkowski、S.編、Decraene、B.、Filsfils、C.、ラザ、K.、Horneffer、M.、およびP.サーカー、 \"ループのない代替デバイスの運用管理\"、RFC 7916、DOI 10.17487 / RFC7916、2016年7月、<http://www.rfc-editor.org/info/rfc7916>。"
    },
    {
      "indent": 3,
      "text": "[RTG-POLICY-MODEL] Shaikh, A., Shakir, R., D'Souza, K., and C. Chase, \"Routing Policy Configuration Model for Service Provider Networks\", Work in Progress, draft-ietf-rtgwg-policy-model-01, April 2016.",
      "ja": "\"サービスプロバイダーネットワークのルーティングポリシー構成モデル\" [RTG-POLICY-MODEL]シャイフ、A.、Shakir、R.、D'Souza氏、K.、およびC.チェイス、進行中で働いて、ドラフト-IETF-rtgwg-ポリシーモデル-01、2016年4月。"
    },
    {
      "indent": 3,
      "text": "[YANG-ISIS-CFG] Litkowski, S., Yeung, D., Lindem, A., Zhang, J., and L. Lhotka, \"YANG Data Model for IS-IS protocol\", Work in Progress, draft-ietf-isis-yang-isis-cfg-08, March 2016.",
      "ja": "[YANG-ISIS-CFG] Litkowski、S.、ヨン、D.、Lindem、A.、張、J.、およびL. Lhotka、 \"ISISプロトコルのYANGデータモデル\"、進行中で働いて、ドラフトIETF -isis陽-ISIS-CFG-08、2016年3月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks to Les Ginsberg, Dhruv Dhody, Uma Chunduri, and Chris Bowers for providing useful inputs.",
      "ja": "便利な入力を提供するためのレギンズバーグ、Dhruv Dhody、ユマChunduri、そしてクリス・バワーズに感謝します。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "Many many thanks to Ebben Aries and Rafael Rodriguez for their help with reviewing and improving the text of this document. Many thanks to Harish Raguveer for his contributions to initial draft versions of the document as well. Finally, many thanks to Zhenbin Li for providing some valuable use cases.",
      "ja": "この文書のテキストを見直し、改善するとの助けのためEbben牡羊座とラファエル・ロドリゲスに多くの多くの感謝。同様に、文書の草案を初期に彼の貢献のためハリッシュRaguveerに感謝します。最後に、いくつかの貴重なユースケースを提供するためのZhenbinリーに感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Pushpasis Sarkar (editor) Individual Contributor",
      "ja": "Pushpasis政府（編集）投稿者"
    },
    {
      "indent": 3,
      "text": "Email: pushpasis.ietf@gmail.com",
      "ja": "メール：pushpasis.ietf@gmail.com"
    },
    {
      "indent": 3,
      "text": "Hannes Gredler RtBrick Inc.",
      "ja": "ハンネスGredler RtBrick株式会社"
    },
    {
      "indent": 3,
      "text": "Email: hannes@rtbrick.com",
      "ja": "メール：hannes@rtbrick.com"
    },
    {
      "indent": 3,
      "text": "Shraddha Hegde Juniper Networks, Inc. Electra, Exora Business Park Bangalore, KA 560103 India",
      "ja": "Shraddha Hegdeジュニパーネットワークス、株式会社エレクトラ、Exoraビジネスパークバンガロール、KA 560103インド"
    },
    {
      "indent": 3,
      "text": "Email: shraddha@juniper.net",
      "ja": "メール：shraddha@juniper.net"
    },
    {
      "indent": 3,
      "text": "Stephane Litkowski Orange",
      "ja": "ステファンLitkowskiオレンジ"
    },
    {
      "indent": 3,
      "text": "Email: stephane.litkowski@orange.com",
      "ja": "メール：stephane.litkowski@orange.com"
    },
    {
      "indent": 3,
      "text": "Bruno Decraene Orange",
      "ja": "ブルーノDecraeneオレンジ"
    },
    {
      "indent": 3,
      "text": "Email: bruno.decraene@orange.com",
      "ja": "メール：bruno.decraene@orange.com"
    }
  ]
}