{
  "title": {
    "text": "RFC 7226 - Requirements for Advanced Multipath in MPLS Networks",
    "ja": "RFC 7226 - MPLSネットワークにおける高度なマルチパスの要件"
  },
  "number": 7226,
  "created_at": "2019-10-30 08:49:53.399130+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                C. Villamizar, Ed.\nRequest for Comments: 7226                                    OCCNC, LLC\nCategory: Informational                                  D. McDysan, Ed.\nISSN: 2070-1721                                                  Verizon\n                                                                 S. Ning\n                                                     Tata Communications\n                                                                A. Malis\n                                                                  Huawei\n                                                                 L. Yong\n                                                              Huawei USA\n                                                                May 2014",
      "raw": true
    },
    {
      "indent": 10,
      "text": "Requirements for Advanced Multipath in MPLS Networks",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document provides a set of requirements for Advanced Multipath in MPLS networks.",
      "ja": "この文書では、MPLSネットワークの高度なマルチパスの要件のセットを提供します。"
    },
    {
      "indent": 3,
      "text": "Advanced Multipath is a formalization of multipath techniques currently in use in IP and MPLS networks and a set of extensions to existing multipath techniques.",
      "ja": "高度なマルチパスは、現在、IPおよびMPLSネットワークでの使用におけるマルチパス技術の定式化と、既存のマルチパス技術の拡張セットです。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7226.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7226で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n  1.1.  Requirements Language . . . . . . . . . . . . . . . . . .   3\n2.  Definitions . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Functional Requirements . . . . . . . . . . . . . . . . . . .   6\n  3.1.  Availability, Stability, and Transient Response . . . . .   6\n  3.2.  Component Links Provided by Lower-Layer Networks  . . . .   7\n  3.3.  Component Links with Different Characteristics  . . . . .   8\n  3.4.  Considerations for Bidirectional Client LSP . . . . . . .   9\n  3.5.  Multipath Load-Balancing Dynamics . . . . . . . . . . . .  10\n4.  General Requirements for Protocol Solutions . . . . . . . . .  12\n5.  Management Requirements . . . . . . . . . . . . . . . . . . .  13\n6.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  14\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .  14\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  15\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . .  15\n  8.2.  Informative References  . . . . . . . . . . . . . . . . .  15",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "There is often a need to provide large aggregates of bandwidth that are best provided using parallel links between routers or carrying traffic over multiple MPLS Label Switched Paths (LSPs). In core networks, there is often no alternative since the aggregate capacities of core networks today far exceed the capacity of a single physical link or a single packet-processing element.",
      "ja": "スイッチパス（LSP）最高のルータまたは複数のMPLSラベル上のトラフィックを運ぶ間に並列リンクを使用して提供されている帯域幅の大きな凝集体を提供する必要がある場合が多いです。コアネットワークの集合体容量は、今日までのところ、単一の物理リンクの容量または単一パケット処理エレメントを超えるので、コアネットワークでは、何の代替案は、しばしば存在しません。"
    },
    {
      "indent": 3,
      "text": "The presence of parallel links, with each link potentially comprised of multiple layers, has resulted in additional requirements. Certain services may benefit from being restricted to a subset of the component links or a specific component link, where component link characteristics, such as latency, differ. Certain services require that an LSP be treated as atomic and avoid reordering. Other services will continue to require only that reordering not occur within a flow as is current practice.",
      "ja": "平行リンクの存在は、潜在的に複数の層からなる各リンクに、追加の要件をもたらしました。特定のサービスは、コンポーネントリンク又は待ち時間などのコンポーネントリンク特性は、異なる特定のコンポーネントリンクのサブセットに制限されることから利益を得ることができます。特定のサービスは、LSPは原子として扱われ、並べ替えを避けることが必要です。その他のサービスは、現在の慣行があるとして、フロー内で発生していないの並べ替えだけでことを要求していきます。"
    },
    {
      "indent": 3,
      "text": "Numerous forms of multipath exist today, including MPLS Link Bundling [RFC4201], Ethernet Link Aggregation [IEEE-802.1AX], and various forms of Equal Cost Multipath (ECMP) such as for OSPF ECMP, IS-IS ECMP, and BGP ECMP. Refer to the appendices in [USE-CASES] for a description of existing techniques and a set of references.",
      "ja": "マルチパスの多数の形態は、ECMP IS-IS、およびBGP ECMP、MPLSリンクバンドル[RFC4201]、イーサネットリンクアグリゲーション[IEEE-802.1AX]、及びそのようなOSPF ECMPのような等価コストマルチパス（ECMP）の様々な形態を含む、今日存在します。既存の技術の説明および参照のセットに対して[ユースケース]で付録を参照。"
    },
    {
      "indent": 3,
      "text": "The purpose of this document is to clearly enumerate a set of requirements related to the protocols and mechanisms that provide MPLS-based Advanced Multipath. The intent is to first provide a set of functional requirements, in Section 3, that are as independent as possible of protocol specifications. A set of general protocol requirements are defined in Section 4. A set of network management requirements are defined in Section 5.",
      "ja": "このドキュメントの目的は明らかにMPLSベースの高度なマルチパスを提供したプロトコルとメカニズムに関連する一連の要件を列挙することです。目的は、第1のプロトコル仕様の可能な限り独立している第3の機能要件のセットを提供することです。一般的なプロトコル要件のセットは、ネットワーク管理要件のセットは、セクション5で定義されている第4項に定義されています。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "ja": "1.1. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "Any statement that requires the solution to support some new functionality through use of [RFC2119] keywords should be interpreted as follows. The implementation either MUST or SHOULD support the new functionality, depending on the use of either MUST or SHOULD in the requirements statement. The implementation SHOULD, in most or all cases, allow any new functionality to be individually enabled or disabled through configuration. A service provider or other deployment MAY enable or disable any feature in their network, subject to implementation limitations on sets of features that can be disabled.",
      "ja": "次のように[RFC2119]キーワードを使用して、いくつかの新しい機能をサポートするためのソリューションを必要とするすべてのステートメントが解釈されるべきです。実装のいずれかMUSTや要件のステートメント内MUSTやSHOULDのいずれかの用途に応じて、新しい機能をサポートする必要があります。実装は、ほとんどまたはすべての場合に、任意の新しい機能は、個別に有効または設定によって無効にすることができるようにする必要があります。サービスプロバイダまたは他の展開は無効にすることができる機能のセットの実装の制限を受け、そのネットワーク内の任意の機能を、有効または無効にできます。"
    },
    {
      "indent": 0,
      "text": "2. Definitions",
      "section_title": true,
      "ja": "2.定義"
    },
    {
      "indent": 3,
      "text": "Multipath The term \"multipath\" includes all techniques in which:",
      "ja": "マルチパス用語「マルチパスは、」内のすべての技術が含まれています。"
    },
    {
      "indent": 7,
      "text": "1.  Traffic can take more than one path from one node to a\n    destination.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "2. Individual packets take one path only. Packets are not subdivided and reassembled at the receiving end.",
      "ja": "2.個々のパケットは、唯一のパスを取ります。パケットは、細分化し、受信側で再組み立てされていません。"
    },
    {
      "indent": 7,
      "text": "3. Packets are not resequenced at the receiving end.",
      "section_title": true,
      "ja": "3.パケットは、受信側で再配列決定されていません。"
    },
    {
      "indent": 7,
      "text": "4. The paths may be:",
      "section_title": true,
      "ja": "4.パスがあってもよいです。"
    },
    {
      "indent": 11,
      "text": "a. parallel links between two nodes,",
      "ja": "A。 2つのノード間の平行リンク"
    },
    {
      "indent": 11,
      "text": "b. specific paths across a network to a destination node, or",
      "ja": "B。宛先ノードにネットワークを介して特定のパス、または"
    },
    {
      "indent": 11,
      "text": "c. links or paths to an intermediate node used to reach a common destination.",
      "ja": "C。共通の宛先に到達するために使用される中間ノードへのリンクまたはパス。"
    },
    {
      "indent": 7,
      "text": "The paths need not have equal capacity. The paths may or may not have equal cost in a routing protocol.",
      "ja": "パスが同じ能力を持っている必要はありません。経路は、またはルーティングプロトコルに等しいコストを有していてもいなくてもよいです。"
    },
    {
      "indent": 3,
      "text": "Advanced Multipath Advanced Multipath is a formalization of multipath techniques that meets the requirements defined in this document. A key capability of Advanced Multipath is the support of non-homogeneous component links.",
      "ja": "高度なマルチパス高度なマルチパスは、この文書で定義された要件を満たしているマルチパス技術の定式化です。高度なマルチパスの重要な機能は、不均質なコンポーネントリンクのサポートです。"
    },
    {
      "indent": 3,
      "text": "Advanced Multipath Group (AMG) An AMG is a collection of component links where Advanced Multipath techniques are applied.",
      "ja": "高度なマルチパスグループ（AMG）AMGは、高度なマルチパス技術が適用されているコンポーネントのリンク集です。"
    },
    {
      "indent": 3,
      "text": "Composite Link The term \"composite link\" had been a registered trademark of Avici Systems, but it was abandoned in 2007. The term \"composite link\" is now defined by the ITU-T in [ITU-T.G.800]. The ITU-T definition includes multipath as defined here, plus inverse multiplexing, which is explicitly excluded from the definition of multipath.",
      "ja": "コンポジットリンク用語「複合リンクは」Aviciシステムズの登録商標されていたが、それは2007年に用語を放棄された「複合リンク」になりました[ITU-T.G.800]でITU-Tによって定義されます。 ITU-Tの定義は明示的にマルチパスの定義から除外され、ここで定義され、プラスの逆多重化、マルチパスなどが含まれます。"
    },
    {
      "indent": 3,
      "text": "Inverse Multiplexing Inverse multiplexing is another method of sending traffic over multiple links. Inverse multiplexing either transmits whole packets and resequences the packets at the receiving end or subdivides packets and reassembles the packets at the receiving end. Inverse multiplexing requires that all packets be handled by a common egress packet processing element and is, therefore, not useful for very high-bandwidth applications.",
      "ja": "逆多重化逆多重化は、複数のリンクを介してトラフィックを送信する別の方法です。逆多重化は、全パケットを送信し、受信側でパケットをresequencesまたはパケットを細分化し、受信側でパケットを再組み立てのいずれか。逆多重化は、非常に高い帯域幅用途に有用ではない、したがって、すべてのパケットが共通の出力パケット処理要素によって処理されることを必要とします。"
    },
    {
      "indent": 3,
      "text": "Component Link The ITU-T definition of composite link in [ITU-T.G.800] and the IETF definition of link bundling in [RFC4201] both refer to an individual link in the composite link or link bundle as a component link. The term \"component link\" is applicable to all forms of multipath. The IEEE uses the term \"member\" rather than \"component link\" in Ethernet Link Aggregation [IEEE-802.1AX].",
      "ja": "コンポーネントリンクザ・ITU-Tの[ITU-T.G.800]における複合リンクの定義と[RFC4201]に束ねるリンクのIETF定義の両方のコンポーネントリンクの複合リンクまたはリンクバンドル内の個々のリンクを指します。用語「コンポーネントリンクは、」マルチパスのすべての形態に適用されます。 IEEEイーサネットリンクアグリゲーション[IEEE-802.1AX]における用語「部材」よりもむしろ「コンポーネントリンク」を使用します。"
    },
    {
      "indent": 3,
      "text": "Client Layer A client layer is the layer immediately above a server layer.",
      "ja": "クライアントは、クライアントレイヤをレイヤすぐにサーバー層の上の層です。"
    },
    {
      "indent": 3,
      "text": "Server Layer A server layer is the layer immediately below a client layer.",
      "ja": "サーバー層サーバー層は、直ちにクライアント層の下の層です。"
    },
    {
      "indent": 3,
      "text": "Higher Layers Relative to a particular layer, a client layer and any layer above that is considered a higher layer. Upper layer is synonymous with higher layer.",
      "ja": "特定の層の相対的な上位層は、クライアント層とその上の任意の層は、上位層と考えられています。上位層は、上位層と同義です。"
    },
    {
      "indent": 3,
      "text": "Lower Layers Relative to a particular layer, a server layer and any layer below that is considered a lower layer.",
      "ja": "特定の層、サーバ層とその下の任意の層に相対的な下位層は、下位層であると考えられます。"
    },
    {
      "indent": 3,
      "text": "Client LSP A client LSP is an LSP that has been set up over one or more lower layers. In the context of this discussion, one type of client LSP is an LSP that has been set up over an AMG.",
      "ja": "クライアントLSPクライアントLSPは、一つ以上の下位層の上に設定されたLSPです。この議論の文脈では、クライアントLSPの一つのタイプは、AMGの上に設定されたLSPです。"
    },
    {
      "indent": 3,
      "text": "Flow A sequence of packets that should be transferred in order on one component link of a multipath.",
      "ja": "マルチパスの一の成分リンクを順に転送されるべきパケットのシーケンスを流れます。"
    },
    {
      "indent": 3,
      "text": "Flow Identification The label stack and other information that uniquely identifies a flow. Other information in flow identification may include an IP header, pseudowire (PW) control word, Ethernet Media Access Control (MAC) address, etc. Note that a client LSP may contain one or more flows, or a client LSP may be equivalent to a flow. Flow identification is used to locally select a component link or a path through the network toward the destination.",
      "ja": "フロー識別一意フローを識別するラベルスタックおよびその他の情報。フロー識別の他の情報擬似回線（PW）制御ワード、イーサネットメディアアクセス制御（MAC）アドレス、等はクライアントLSPは、1つのまたは複数のフローを含むことができる、またはクライアントLSPと等価であってもよい、IPヘッダを含んでいてもよいですフロー。フロー識別は、宛先に向けてネットワークを介してコンポーネントリンクまたはパスを選択し、局所的に使用されます。"
    },
    {
      "indent": 3,
      "text": "Load Balance Load split, load balance, or load distribution refers to subdividing traffic over a set of component links such that load is fairly evenly distributed over the set of component links and certain packet ordering requirements are met. Some existing techniques better achieve these objectives than others.",
      "ja": "負荷分散負荷分割、負荷バランス、または負荷分散は、負荷がかなり均一に満たされているコンポーネントリンクと特定のパケット順序付け要件のセットにわたって分布されるように、コンポーネントリンクのセット上のトラフィックを細分化を指します。いくつかの既存の技術は、よりよい他よりもこれらの目的を達成します。"
    },
    {
      "indent": 3,
      "text": "Performance Objective Numerical values for performance measures: principally availability, latency, and delay variation. Performance objectives may be related to Service Level Agreements (SLAs) as defined in [RFC2475] or may be strictly internal. Performance objectives may span links from edge to edge or from end to end. Performance objectives may span one provider or multiple providers.",
      "ja": "パフォーマンス測定のためのパフォーマンスの客観的数値：主可用性、遅延、および遅延変動。性能目標は、[RFC2475]で定義されたサービスレベル契約（SLA）に関連してもよいし、厳密の内部にあってもよいです。性能目標は、端から端までまたはエンドからエンドへのリンクにまたがることがあります。性能目標は、1つのプロバイダまたは複数のプロバイダにまたがることがあります。"
    },
    {
      "indent": 3,
      "text": "A component link may be a point-to-point physical link (where a \"physical link\" includes one or more link layers, plus a physical layer) or a logical link that preserves ordering in the steady state. A component link may have transient out-of-order events, but such events must not exceed the network's performance objectives. For example, a component link may be comprised of any supportable combination of link layers over a physical layer or over logical sub-layers -- including those providing physical-layer emulation -- or over MPLS server-layer LSP.",
      "ja": "コンポーネントリンクはポイントツーポイントの物理リンク（「物理リンク」は、一つ以上のリンク層、プラス物理層を含む場合）、または定常状態で注文保存論理リンクであってもよいです。コンポーネントリンクは過渡アウトオブオーダーイベントがあるかもしれませんが、このようなイベントは、ネットワークの性能目標を超えてはなりません。物理層のエミュレーションを提供するものを含む -   - またはMPLSサーバ層LSP上に、例えば、コンポーネントリンクはまたは論理的副層の上に、物理層の上のリンク層の支援の組み合わせから構成されてもよいです。"
    },
    {
      "indent": 3,
      "text": "The ingress and egress of a multipath may be midpoint LSRs with respect to a given client LSP. A midpoint LSR does not participate in the signaling of any clients of the client LSP. Therefore, in general, multipath endpoints cannot determine requirements of clients of a client LSP through participation in the signaling of the clients of the client LSP.",
      "ja": "マルチパスの入力および出力は、所与のクライアントLSPに対して中間のLSRであってもよいです。中間LSRは、クライアントLSPのすべてのクライアントのシグナリングに参加しません。したがって、一般的には、マルチパスのエンドポイントは、クライアントLSPのクライアントのシグナリングへの参加を介してクライアントLSPのクライアントの要件を決定することができません。"
    },
    {
      "indent": 3,
      "text": "This document makes no statement on whether Advanced Multipath is itself a layer or whether an instance of AMG is itself a layer. This is to avoid engaging in long and pointless discussions about what constitutes a proper layer.",
      "ja": "この文書では、高度なマルチパスが層自体であるか、AMGのインスタンスが層自体であるかどうかかどうかに声明を行うものではありません。これは、適切な層を構成するかについて、長く無意味な議論に従事避けるためです。"
    },
    {
      "indent": 3,
      "text": "The term \"Advanced Multipath\" is intended to be used within the context described in this document and related documents, for example, [USE-CASES] and [FRAMEWORK]. Other Advanced Multipath techniques may arise in the future. If the capabilities defined in this document become commonplace, they would no longer be considered \"advanced\". Use of the term \"advanced multipath\" outside this document, if referring to the term as defined here, should indicate Advanced Multipath as defined by this document, citing the current document name. If using another definition of \"advanced multipath\", documents may optionally clarify that they are not using the term \"advanced multipath\" as defined by this document if clarification is deemed helpful.",
      "ja": "用語「高度なマルチパス」は、例えば、本文書および関連する文書に記載コンテキスト内で使用されることが意図されている、[ユースケース]及び[FRAMEWORK]。その他の高度なマルチパス技術は、将来的に発生する可能性があります。この文書で定義された機能が一般的になっている場合、彼らはもはや、「高度な」とみなされないであろう。この文書で定義されるように、ここで定義される用語を参照する場合は、この文書の外側用語「高度なマルチパス」の使用は、現在のドキュメント名を引用し、高度なマルチパスを示す必要があります。 「高度なマルチパス」の別の定義を使用している場合、文書は、必要に応じて明確化が有益と判断される場合には、この文書で定義されるように、彼らは用語「高度なマルチパス」を使用していないことを明確にします。"
    },
    {
      "indent": 0,
      "text": "3. Functional Requirements",
      "section_title": true,
      "ja": "3.機能要件"
    },
    {
      "indent": 3,
      "text": "The functional requirements in this section are grouped in subsections, starting with the highest priority.",
      "ja": "このセクションの機能要件は、最も高い優先度から始めて、サブセクションにグループ化されます。"
    },
    {
      "indent": 0,
      "text": "3.1. Availability, Stability, and Transient Response",
      "section_title": true,
      "ja": "3.1. 可用性、安定性、および過渡応答"
    },
    {
      "indent": 3,
      "text": "In addition to maintaining stability, limiting the period of unavailability in response to failures or transient events is extremely important.",
      "ja": "安定性を維持することに加えて、障害や過渡イベントに応答して使用不能の期間を制限することは非常に重要です。"
    },
    {
      "indent": 3,
      "text": "FR#1 The transient period between some service disrupting event and the convergence of the routing and/or signaling protocols MUST occur within a time frame specified by performance objective values.",
      "ja": "FR＃1いくつかのサービス中断するイベントとパフォーマンス目標値で指定された時間枠内で発生しなければならないルーティング及び/又はシグナリングプロトコルの収束の間の過渡期。"
    },
    {
      "indent": 3,
      "text": "FR#2 An AMG MAY be announced in conjunction with detailed parameters about its component links, such as bandwidth and latency. The AMG SHALL behave as a single IGP adjacency.",
      "ja": "FR＃2アンAMGは、帯域幅と遅延などそのコンポーネントリンクに関する詳細なパラメータと併せて発表されるかもしれません。 AMGは、単一のIGP隣接として振る舞うものとします。"
    },
    {
      "indent": 3,
      "text": "FR#3 The solution SHALL provide a means to summarize some routing advertisements regarding the characteristics of an AMG such that the updated protocol mechanisms maintain convergence times within the time frame needed to meet or not significantly exceed existing performance objectives for convergence on the same network or convergence on a network with a similar topology.",
      "ja": "FR＃3溶液更新プロトコルメカニズムが大幅に同じネットワーク上に収束するための既存のパフォーマンス目標を上回る、または満たすかどうかに必要な時間枠内で収束時間を維持するように、AMGの特性に関するいくつかのルーティング広告を要約するための手段を提供しなければなりません同様のトポロジーを持つネットワーク上の収束。"
    },
    {
      "indent": 3,
      "text": "FR#4 The solution SHALL ensure that restoration operations happen within the time frame needed to meet existing performance objectives for restoration time on the same network or restoration time on a network with a similar topology.",
      "ja": "FR＃4ソリューションは、その復旧作業が同様のトポロジーを持つネットワーク上の同じネットワークまたは復旧時に復旧時間のために、既存のパフォーマンス目標を満たすために必要な時間枠内で発生を確認しなければなりません。"
    },
    {
      "indent": 3,
      "text": "FR#5 The solution shall provide a mechanism to select a set of paths for an LSP across a network in such a way that flows within the LSP are distributed across the set of paths, while meeting all of the other requirements stated above. The solution SHOULD work in a manner similar to existing multipath techniques, except as necessary to accommodate Advanced Multipath requirements.",
      "ja": "FR＃5溶液は、上述した他の要件の全てを満たしながら、パスのセットに分散されているLSP内を流れるように、ネットワークを介してLSPのためのパスのセットを選択するためのメカニズムを提供しなければなりません。ソリューションは、高度なマルチパス要件に対応するために、必要に応じ除き、既存のマルチパス技術と同様に動作するはずです。"
    },
    {
      "indent": 3,
      "text": "FR#6 If extensions to existing protocols are specified and/or new protocols are defined, then the solution SHOULD provide a means for a network operator to migrate an existing deployment in a minimally disruptive manner.",
      "ja": "FR＃6既存のプロトコルへの拡張が指定されている、および/または新しいプロトコルが定義されている場合、そのソリューションは、最小限に破壊的な方法で、既存の展開を移行するために、ネットワークオペレータのための手段を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "FR#7 Any load-balancing solutions MUST NOT oscillate. Some change in path MAY occur. The solution MUST ensure that path stability and traffic reordering continue to meet performance objectives on the same network or on a network with a similar topology. Since oscillation may cause reordering, there MUST be means to control the frequency of changing the component link over which a flow is placed.",
      "ja": "FR＃7の任意の負荷分散ソリューションが発振してはなりません。パス内のいくつかの変更が発生することがあります。解決策は、そのパスの安定性を確保しなければならないし、トラフィックの並べ替えは、同じネットワーク上または類似のトポロジーを持つネットワーク上のパフォーマンス目標を達成し続けています。発振並べ替えを引き起こす可能性があるので、流れが配置される上にコンポーネントリンクを変更する頻度を制御する手段が存在しなければなりません。"
    },
    {
      "indent": 3,
      "text": "FR#8 Management and diagnostic protocols MUST be able to operate over AMGs.",
      "ja": "FR＃8管理および診断プロトコルはAMGs上で動作することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "Existing scaling techniques used in MPLS networks apply to MPLS networks that support Advanced Multipath. Scalability and stability are covered in more detail in [FRAMEWORK].",
      "ja": "MPLSネットワークで使用される既存のスケーリング技術は、高度なマルチパスをサポートするネットワークをMPLSに適用されます。拡張性と安定性は、[FRAMEWORK]で詳しく説明されています。"
    },
    {
      "indent": 0,
      "text": "3.2. Component Links Provided by Lower-Layer Networks",
      "section_title": true,
      "ja": "3.2. 下層ネットワークスが提供するコンポーネントリンク"
    },
    {
      "indent": 3,
      "text": "A component link may be supported by a lower-layer network. For example, the lower layer may be a circuit-switched network or another MPLS network (e.g., MPLS Transport Profile (MPLS-TP)). The lower-layer network may change the latency (and/or other performance parameters) seen by the client layer. Currently, there is no protocol for the lower-layer network to inform the higher-layer network of a change in a performance parameter. Communication of the latency performance parameter is a very important requirement. Communication of other performance parameters (e.g., delay variation) is desirable.",
      "ja": "コンポーネントリンクは、下位層のネットワークによってサポートされてもよいです。例えば、下層は、回線交換網または別のMPLSネットワーク（例えば、MPLSトランスポートプロファイル（MPLS-TP））であってもよいです。下層ネットワークは、クライアント層から見待ち時間（及び/又は他の性能パラメータ）を変更してもよいです。現在、性能パラメータの変化の上位層のネットワークを知らせるために、下位層ネットワークのためのプロトコルではありません。レイテンシー性能パラメータのコミュニケーションは非常に重要な要件です。他の性能パラメータ（例えば、遅延変動）の通信が望ましいです。"
    },
    {
      "indent": 3,
      "text": "FR#9 The solution SHALL specify a protocol means to allow a server-layer network to communicate latency to the client-layer network.",
      "ja": "FR＃9プロトコルを規定する溶液は、サーバレイヤネットワークは、クライアント層ネットワークに待ち時間通信することを可能にすることを意味します。"
    },
    {
      "indent": 3,
      "text": "FR#10 The precision of latency reporting SHOULD be configurable. A reasonable default SHOULD be provided. Implementations SHOULD support precision of at least 10% of the one-way latencies for latency of 1 msec or more.",
      "ja": "FR＃10は、待ち時間報告の精度は設定可能であるべきです。合理的なデフォルトが提供されるべきです。実装は、1秒以上の待ち時間のために一方向の待ち時間の少なくとも10％の精度をサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "The intent is to measure the predominant latency in uncongested service-provider networks, where geographic delay dominates and is on the order of milliseconds or more. The argument for including queuing delay is that it reflects the delay experienced by applications. The argument against including queuing delay is that if used in routing decisions, it can result in routing instability. This trade-off is discussed in detail in [FRAMEWORK].",
      "ja": "その意図は、地理的な遅延が支配し、ミリ秒以上のオーダーである輻輳していないサービスプロバイダーネットワークでの支配的な遅延を測定することです。キューイング遅延を含むための引数が、それはアプリケーションが経験する遅延を反映していることです。キューイング遅延を含むに対する引数は、ルーティングの決定に使用される場合、それは不安定のルーティングにつながることができるということです。このトレードオフは、[FRAMEWORK]で詳細に説明されています。"
    },
    {
      "indent": 0,
      "text": "3.3. Component Links with Different Characteristics",
      "section_title": true,
      "ja": "3.3. 異なる特性を持つコンポーネントリンク"
    },
    {
      "indent": 3,
      "text": "As one means to provide high availability, network operators deploy a topology in the MPLS network using lower-layer networks that have a certain degree of diversity at the lower layer(s). Many techniques have been developed to balance the distribution of flows across component links that connect the same pair of nodes or ultimately lead to a common destination.",
      "ja": "一つは、高可用性を提供する手段として、ネットワークオペレータは、下位層（複数可）での多様性のある程度を有する下層のネットワークを使用して、MPLSネットワークにおけるトポロジーを展開します。多くの技術は、ノードの同一の対を接続したり、最終的に共通の宛先につながるコンポーネントリンクを介して流れの分布のバランスをとるために開発されてきました。"
    },
    {
      "indent": 3,
      "text": "FR#11 In the requirements that follow in this document, the word \"indicate\" is used where information may be provided by either the combination of link state IGP advertisement and MPLS LSP signaling or via management plane protocols. In later documents, providing framework and protocol definitions, both signaling and management plane mechanisms, MUST be defined.",
      "ja": "この文書に従う要件でFR＃11の情報は、リンク状態IGP広告の組み合わせとMPLS LSPシグナリングによって、または管理プレーンプロトコルを介して提供することができる場合、単語が使用されている「を示します」。後でドキュメント、フレームワークおよびプロトコル定義を提供する際に、両方のシグナリングおよび管理プレーン機構は、定義されなければなりません。"
    },
    {
      "indent": 3,
      "text": "FR#12 The solution SHALL provide a means for the client layer to indicate a requirement that a client LSP will traverse a component link with the minimum-latency value. This will provide a means by which minimum latency performance objectives of flows within the client LSP can be supported.",
      "ja": "FR＃12ソリューションは、クライアントLSPが最小レイテンシ値を持つコンポーネントリンクを横断する必要性を示すために、クライアント層のための手段を提供しなければなりません。これは、クライアントLSP内の流れの最小待ち時間のパフォーマンス目標をサポートすることができる手段を提供します。"
    },
    {
      "indent": 3,
      "text": "FR#13 The solution SHALL provide a means for the client layer to indicate a requirement that a client LSP will traverse a component link with a maximum acceptable latency value as specified by protocol. This will provide a means by which bounded latency performance objectives of flows within the client LSP can be supported.",
      "ja": "FR＃13ソリューションは、プロトコルによって指定されたクライアントLSPが最大許容レイテンシ値を持つコンポーネントリンクを横断する必要性を示すために、クライアント層のための手段を提供しなければなりません。これは、サポートできるクライアントLSP内の流れの待ち時間のパフォーマンス目標を囲まれた手段を提供します。"
    },
    {
      "indent": 3,
      "text": "FR#14 The solution SHALL provide a means for the client layer to indicate a requirement that a client LSP will traverse a component link with a maximum acceptable delay variation value as specified by protocol.",
      "ja": "＃14溶液FRは、プロトコルによって指定されたクライアントLSPが最大許容遅延変動値を持つコンポーネントリンクを横断する必要性を示すために、クライアント層のための手段を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The above set of requirements applies to component links with different characteristics, regardless of whether those component links are provided by parallel physical links between nodes or by sets of paths across a network provided by a server-layer LSP.",
      "ja": "要件の上記セットにかかわらず、それらのコンポーネントリンクはノード間またはサーバ層LSPによって提供されるネットワークを介したパスのセットによって並列物理リンクによって提供されているかどうかの、異なる特性を持つコンポーネントリンクに適用されます。"
    },
    {
      "indent": 3,
      "text": "Allowing multipath to contain component links with different characteristics can improve the overall load balance and can be accomplished while still accommodating the more strict requirements of a subset of client LSP.",
      "ja": "マルチパスは、異なる特性を持つコンポーネントリンクを含有させると、全体的な負荷バランスを向上させることができ、それでもクライアントLSPのサブセットのより厳格な要件を収容しながら、達成することができます。"
    },
    {
      "indent": 0,
      "text": "3.4. Considerations for Bidirectional Client LSP",
      "section_title": true,
      "ja": "3.4. 双方向クライアントLSPのための考慮事項"
    },
    {
      "indent": 3,
      "text": "Some client LSPs MAY require a path bound to a specific set of component links. This case is most likely to occur in a bidirectional client LSP where time synchronization protocols such as the Precision Time Protocol (PTP) or the Network Time Protocol (NTP) are carried or in any other case where symmetric delay is highly desirable. There may be other uses of this capability.",
      "ja": "一部のクライアントのLSPは、コンポーネントリンクの特定のセットにバインドされたパスが必要な場合があります。この場合は、高精度時間プロトコル（PTP）またはネットワークタイムプロトコル（NTP）などの時刻同期プロトコルが実施される双方向クライアントLSPまたは対称の遅延が非常に望ましい他の場合に発生する可能性が最も高いです。この機能の他の用途があるかもしれません。"
    },
    {
      "indent": 3,
      "text": "Other client LSPs may only require that the LSP serve the same set of nodes in both directions. This is necessary if protocols are carried that make use of the reverse direction of the LSP as a back channel in cases such Operations, Administration, and Maintenance (OAM) protocols using IPv4 Time to Live (TTL) or IPv4 Hop Limit to monitor or diagnose the underlying path. There may be other uses of this capability.",
      "ja": "他のクライアントのLSPはLSPが両方向に同じノードセットにサービスを提供することを必要とするかもしれません。プロトコルはIPv4の時間がライブする（TTL）またはIPv4ホップリミット監視または診断するために使用した場合、このような運用、管理、および保守（OAM）プロトコルにおけるバックチャネルとしてLSPの逆方向を利用すること運ばれる場合、これが必要です基礎のパス。この機能の他の用途があるかもしれません。"
    },
    {
      "indent": 3,
      "text": "FR#15 The solution SHALL provide a means for the client layer to indicate a requirement that a client LSP be bound to a particular component link within an AMG. If this option is not exercised, then a client LSP that is carried over an AMG may be bound to any component link or set of component links matching all other signaled requirements, and different directions of a bidirectional client LSP can be bound to different component links.",
      "ja": "FR＃15ソリューションは、クライアントLSPがAMG内の特定のコンポーネントリンクに結合されるという要件を示すために、クライアント層のための手段を提供しなければなりません。このオプションが行使されていない場合は、AMGの上に搭載されているクライアントのLSPは、任意のコンポーネントリンクに結合されるか、または別のコンポーネントリンクにバインドすることができ、他のすべての要件、および双方向のクライアントLSPの異なる方向を合図に一致するコンポーネントのリンクを設定することができ。"
    },
    {
      "indent": 3,
      "text": "FR#16 The solution MUST support a means for the client layer to indicate a requirement that for a specific co-routed bidirectional client LSP, both directions of the co-routed bidirectional client LSP MUST be bound to the same set of nodes.",
      "ja": "FR＃16ソリューションは、特定の共同ルーティング双方向クライアントLSPのために、共同ルーティングされた双方向のクライアントLSPの両方の方向が同じノードセットにバインドされなければならない必要性を示すために、クライアント層のための手段をサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "FR#17 A client LSP that is bound to a specific component link SHOULD NOT exceed the capacity of a single component link. This is inherent in the assumption that a network SHOULD NOT operate in a congested state if congestion is avoidable.",
      "ja": "特定のコンポーネントリンクにバインドされているFR＃17クライアントLSPは、単一のコンポーネントリンクの容量を超えないようにしてください。これは、輻輳が回避されている場合は、ネットワークが輻輳状態で動作しないことを前提に固有のものです。"
    },
    {
      "indent": 3,
      "text": "For some large bidirectional client LSPs, it may not be necessary (or possible due to the client LSP capacity) to bind the LSP to a common set of component links, but it may be necessary or desirable to constrain the path taken by the LSP to the same set of nodes in both directions. Without an entirely new and highly dynamic protocol, it is not feasible to constrain such a bidirectional client LSP from taking multiple paths and coordinating load balance on each side in order to keep both directions of flows within such an LSP on common paths.",
      "ja": "いくつかの大規模な双方向クライアントのLSPのために、コンポーネントリンクの共通セットにLSPを結合すること（これはクライアントLSP容量または可能）必要ではないかもしれないが、にLSPによって取られる経路を制約するために必要または望ましいかもしれません両方向でのノードの同じセット。全く新しい、非常に動的なプロトコルがなければ、複数のパスを取り、共通経路上のそのようなLSP内のフローの両方の方向を維持するために各側の負荷バランスを調整するから、このような双方向のクライアントLSPを制限することは不可能です。"
    },
    {
      "indent": 0,
      "text": "3.5. Multipath Load-Balancing Dynamics",
      "section_title": true,
      "ja": "3.5. マルチパスロードバランシングダイナミクス"
    },
    {
      "indent": 3,
      "text": "Multipath load balancing attempts to keep traffic levels on all component links below congestion levels if possible and preferably well balanced. Load balancing is minimally disruptive (see the discussion below this section's list of requirements). The sensitivity to these minimal disruptions of traffic flows within a specific client LSP needs to be considered.",
      "ja": "マルチパスロードバランシングは、輻輳レベル、可能であれば、好ましくはバランスのとれた、以下のすべてのコンポーネントのリンク上のトラフィックレベルを維持しようとします。負荷分散は（要件のこのセクションのリストの下の説明を参照）最小限に破壊的です。トラフィックのこれらの最小限の混乱に対する感度はLSPを考慮する必要があり、特定のクライアント内を流れます。"
    },
    {
      "indent": 3,
      "text": "FR#18 The solution SHALL provide a means for the client layer to indicate a requirement that a specific client LSP MUST NOT be split across multiple component links.",
      "ja": "FR＃18ソリューションは、特定のクライアントLSPは、複数のコンポーネントリンクにまたがって分割してはならない必要性を示すために、クライアント層のための手段を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "FR#19 The solution SHALL provide a means local to a node that automatically distributes flows across the component links in the AMG such that performance objectives are met, as described in the prior requirements in Section 3.3.",
      "ja": "FR＃19溶液は自動的に3.3節で前の要件に記載されているように、性能目標が満たされていることAMGようにコンポーネントリンク間の流れを分配するノードに対してローカルな手段を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "FR#20 The solution SHALL measure traffic flows or groups of traffic flows and dynamically select the component link on which to place this traffic in order to balance the load so that no component link in the AMG between a pair of nodes is overloaded.",
      "ja": "FR＃20溶液は、トラフィックフローまたはトラフィックフローのグループ測定と動的ノードの対の間のAMGにはコンポーネント・リンクが過負荷されないように負荷を分散するために、このトラフィックを配置するためにコンポーネントのリンクを選択しなければなりません。"
    },
    {
      "indent": 3,
      "text": "FR#21 When a traffic flow is moved from one component link to another in the same AMG between a set of nodes, it MUST be done so in a minimally disruptive manner.",
      "ja": "トラフィックフローは、ノードの集合との間の同一のAMGで別のコンポーネントリンクから移動されたときFR＃21は、それが最小限の破壊方法でそうしなければなりません。"
    },
    {
      "indent": 3,
      "text": "FR#22 Load balancing MAY be used during sustained low-traffic periods to reduce the number of active component links for the purpose of power reduction.",
      "ja": "FR＃22ロード・バランシングは、消費電力削減のために、活性成分のリンクの数を減らすために持続的なトラフィックの少ない時間帯に使用されるかもしれません。"
    },
    {
      "indent": 3,
      "text": "FR#23 The solution SHALL provide a means for the client layer to indicate a requirement that a specific client LSP contains traffic whose frequency of component link change due to load balancing needs to be bounded by a specific value. The solution MUST provide a means to bound the frequency of a component link change due to load balancing for subsets of traffic flow on AMGs.",
      "ja": "FR＃23ソリューションは、特定のクライアントLSPは、周波数成分のリンク変更のため、負荷分散に特定の値によって制限される必要があるトラフィックが含まれている要件を示すために、クライアント層のための手段を提供しなければなりません。解決策は、原因AMGs上のトラフィックフローのサブセットのためのロードバランシングにコンポーネントリンク変更の頻度を拘束する手段を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "FR#24 The solution SHALL provide a means to distribute traffic flows from a single client LSP across multiple component links to handle at least the case where the traffic carried in a client LSP exceeds that of any component link in the AMG.",
      "ja": "FR＃24溶液は、トラフィックは、トラフィックがLSPがAMG内の任意のコンポーネントリンクのことを超えて、クライアントで運ば少なくともケースを扱うために、複数のコンポーネントリンクを横切る単一のクライアントLSPから流れ分配する手段を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "FR#25 The solution SHOULD support the use case where an AMG itself is a component link for a higher order AMG. For example, an AMG comprised of MPLS-TP bidirectional tunnels viewed as logical links could then be used as a component link in yet another AMG that connects MPLS routers.",
      "ja": "FR＃25溶液は、AMG自体が高次AMGのコンポーネントリンクであるユースケースをサポートしなければなりません。例えば、論理リンクとして見MPLS-TPの双方向トンネルの構成AMGは、次いでMPLSルータを接続するさらに別のAMGのコンポーネントリンクとして使用することができます。"
    },
    {
      "indent": 3,
      "text": "FR#26 If the total demand offered by traffic flows exceeds the capacity of the AMG, the solution SHOULD define a means to cause some client LSPs to move to an alternate set of paths that are not congested. These \"preempted LSPs\" may not be restored if there is no uncongested path in the network.",
      "ja": "＃26トラフィックによって提供される総需要は、AMGの容量を超えて流れるとFR、解決策はいくつかのクライアントのLSPが混雑していないされているパスの代替セットに移動させるための手段を定義する必要があります。ネットワークには輻輳していないパスが存在しない場合は、これらの「先取りLSPは、」復元することはできません。"
    },
    {
      "indent": 3,
      "text": "A minimally disruptive change implies that as little disruption as is practical occurs. Such a change can be achieved with zero packet loss. A delay discontinuity may occur, which is considered to be a minimally disruptive event for most services if this type of event is sufficiently rare. A delay discontinuity is an example of a minimally disruptive behavior corresponding to current techniques.",
      "ja": "最小限の破壊的変更が実用的である限り少し混乱が生じたことを意味します。このような変化はゼロパケットロスで達成することができます。遅延の不連続は、このタイプのイベントは十分に稀であればほとんどのサービスのための最小限の破壊的なイベントであると考えられる、発生する可能性があります。遅延の不連続性は、現在の技術に対応する最小破壊的行動の一例です。"
    },
    {
      "indent": 3,
      "text": "A delay discontinuity is an isolated event that may greatly exceed the normal delay variation (jitter). A delay discontinuity has the following effect. When a flow is moved from a current link to a target link with lower latency, reordering can occur. When a flow is moved from a current link to a target link with a higher latency, a time gap can occur. Some flows (e.g., timing distribution and PW circuit emulation) are quite sensitive to these effects. A delay discontinuity can also cause a jitter buffer underrun or overrun, affecting user experience in real-time voice services (causing an audible click). These sensitivities may be specified in a performance objective.",
      "ja": "遅延の不連続が大きく、通常の遅延変動（ジッタ）を超えてもよい、単離された事象です。遅延の不連続性は、以下の効果があります。流れが低いレイテンシの対象リンクに現在のリンクから移動されたときに、並べ替えが発生する可能性があります。流れがより高いレイテンシの対象リンクに現在のリンクから移動されたときに、タイムギャップが発生する可能性があります。一部のフロー（例えば、タイミング分布とPW回路エミュレーション）は、これらの影響に非常に敏感です。遅延の不連続は、（可聴クリックを引き起こす）、リアルタイムの音声サービスにおけるユーザーエクスペリエンスに影響を与え、ジッタバッファアンダーランまたはオーバーランを引き起こす可能性があります。これらの感応度は、パフォーマンス目的で指定することができます。"
    },
    {
      "indent": 3,
      "text": "As with any load-balancing change, a change initiated for the purpose of power reduction may be minimally disruptive. Typically, the disruption is limited to a change in delay characteristics and the potential for a very brief period with traffic reordering. When configuring a network for power reduction, the network operator should weigh the benefit of power reduction against the disadvantage of a minimal disruption.",
      "ja": "任意のロードバランシングの変更と同様に、消費電力の低減を目的として開始さの変化は最小限に破壊的かもしれません。一般的に、破壊は遅延特性の変化や交通並べ替えと非常に短い期間のための潜在的に制限されています。電力削減のためのネットワークを構成する場合は、ネットワークオペレータは、最小限の中断の欠点に対して、電力削減の利点を比較検討する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. General Requirements for Protocol Solutions",
      "section_title": true,
      "ja": "プロトコル・ソリューション4.一般要求事項"
    },
    {
      "indent": 3,
      "text": "This section defines requirements for protocol specifications used to meet the functional requirements specified in Section 3.",
      "ja": "このセクションでは、セクション3で指定された機能要件を満たすために使用されるプロトコル仕様の要件を定義します。"
    },
    {
      "indent": 3,
      "text": "GR#1 The solution SHOULD extend existing protocols wherever possible, developing a new protocol only where doing so adds a significant set of capabilities.",
      "ja": "可能な限りGR＃1ソリューションは、そうすることが能力の大幅なセットを追加します唯一の新しいプロトコルを開発し、既存のプロトコルを拡張する必要があります。"
    },
    {
      "indent": 3,
      "text": "GR#2 A solution SHOULD extend LDP capabilities to meet functional requirements. This MUST be accomplished without defining LDP Traffic Engineering (TE) methods as decided in [RFC3468].",
      "ja": "GR＃2ソリューションは、機能要件を満たすためにLDPの機能を拡張する必要があります。これは[RFC3468]で決定されたようにLDPトラフィックエンジニアリング（TE）メソッドを定義することなく達成されなければなりません。"
    },
    {
      "indent": 3,
      "text": "GR#3 Coexistence of LDP- and RSVP-TE-signaled LSPs MUST be supported on an AMG. Function requirements SHOULD, where possible, be accommodated in a manner that supports LDP-signaled LSP, RSVP-signaled LSP, and LSP setup using management plane mechanisms.",
      "ja": "GR＃3 LDP-の共存とRSVP-TE-シグナリングLSPはAMG上でサポートされなければなりません。機能要件は、可能な場合、管理プレーンメカニズムを使用してLDP-LSPシグナリング、RSVP-LSPシグナリング、およびLSP設定をサポートするように収容されるべきです。"
    },
    {
      "indent": 3,
      "text": "GR#4 When the nodes connected via an AMG are in the same routing domain, the solution MAY define extensions to the IGP.",
      "ja": "AMGを介して接続されたノードが同一のルーティングドメイン内にある場合GR＃4は、溶液は、IGPの拡張を定義することができます。"
    },
    {
      "indent": 3,
      "text": "GR#5 When the nodes are connected via an AMG are in different MPLS network topologies, the solution SHALL NOT rely on extensions to the IGP.",
      "ja": "ノードはAMGを介して接続されているGR＃5は、異なるMPLSネットワークトポロジでは、溶液はIGPの拡張機能に依存していないものとします。"
    },
    {
      "indent": 3,
      "text": "GR#6 The solution SHOULD support AMG IGP advertisement that results in convergence time better than that of advertising the individual component links. The solution SHALL be designed so that it represents the range of capabilities of the individual component links such that functional requirements are met, and it also minimizes the frequency of advertisement updates that may cause IGP convergence to occur.",
      "ja": "GR＃6ソリューションは、収束時間に個々のコンポーネントのリンクを広告するよりも良い結果AMG IGP広告をサポートする必要があります。それは機能要件が満たされるように、個々のコンポーネントリンクの能力の範囲を表すように溶液が設計されなければならない、そしてそれはまた、IGP収束が発生する可能性があり、広告の更新の頻度を最小限に抑えます。"
    },
    {
      "indent": 9,
      "text": "Examples of advertisement-update-triggering events to be\nconsidered include: client LSP establishment/release, changes\nin component-link characteristics (e.g., latency and up/down\nstate), and/or bandwidth utilization.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "GR#7 When a worst-case failure scenario occurs, the number of RSVP-TE client LSPs to be resignaled will cause a period of unavailability as perceived by users. The resignaling time of the solution MUST support protocol mechanisms meeting existing provider performance objectives for the duration of unavailability without significantly relaxing those existing performance objectives for the same network or for networks with similar topology. For example, the processing load due to IGP readvertisement MUST NOT increase significantly, and the resignaling time of the solution MUST NOT increase significantly as compared with current methods.",
      "ja": "最悪の場合の障害シナリオが発生した場合、ユーザーによって知覚されるGR＃7は、resignaledするRSVP-TEクライアントLSPの数が使用不能の期間が発生します。溶液のresignaling時間が大幅に同じネットワークまたは類似のトポロジーを有するネットワークのためのそれらの既存のパフォーマンス目標を緩和せずに利用できないの期間のための既存のプロバイダのパフォーマンス目標を満たすプロトコルメカニズムをサポートしなければなりません。例えば、起因IGPの再広告に処理負荷が大幅に増加してはいけません、そして溶液のresignaling時間は、現在の方法と比較して有意に増加してはいけません。"
    },
    {
      "indent": 0,
      "text": "5. Management Requirements",
      "section_title": true,
      "ja": "5.マネジメントの要件"
    },
    {
      "indent": 3,
      "text": "MR#1 The Management Plane MUST support polling of the status and configuration of an AMG and its individual component links and support notification of status change.",
      "ja": "MR＃1ザ・管理プレーンは、AMGやステータス変更の個々のコンポーネントリンクやサポートの通知のステータスと設定のポーリングをサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "MR#2 The Management Plane MUST be able to activate or deactivate any component link in an AMG in order to facilitate operation maintenance tasks. The routers at each end of an AMG MUST redistribute traffic to move traffic from a deactivated link to other component links based on the traffic flow TE criteria.",
      "ja": "MR＃2ザ・管理プレーンは、操作のメンテナンス作業を容易にするために、AMG内の任意のコンポーネントのリンクを有効または無効することができなければなりません。 AMGの各端部のルータは、トラフィックフローTE基準に基づいて、他のコンポーネントリンクに非活性化リンクからのトラフィックを移動するトラフィックを再分配しなければなりません。"
    },
    {
      "indent": 3,
      "text": "MR#3 The Management Plane MUST be able to configure a client LSP over an AMG and be able to select a component link for the client LSP.",
      "ja": "MR＃3ザ・管理プレーンは、AMGの上にクライアントLSPを設定し、クライアントのLSPのためのコンポーネントのリンクを選択することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "MR#4 The Management Plane MUST be able to trace which component link a client LSP is assigned to and monitor individual component link and AMG performance.",
      "ja": "MR＃4ザ・管理プレーンは、LSPがに割り当てられ、個々のコンポーネントのリンクとAMGのパフォーマンスを監視しているコンポーネントリンクのクライアントを追跡することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "MR#5 The Management Plane MUST be able to verify connectivity over each individual component link within an AMG.",
      "ja": "MR＃5ザ管理プレーンは、AMG内の各コンポーネントリンクを介して接続を確認できなければなりません。"
    },
    {
      "indent": 3,
      "text": "MR#6 Component link fault notification MUST be sent to the management plane.",
      "ja": "MR＃6コンポーネントリンク障害通知は、管理プレーンに送らなければなりません。"
    },
    {
      "indent": 3,
      "text": "MR#7 AMG fault notification MUST be sent to the management plane and MUST be distributed via a link state message in the IGP.",
      "ja": "MR＃7 AMG障害通知は、管理プレーンに送信されなければならないとIGPにおけるリンク状態メッセージを介して分配されなければなりません。"
    },
    {
      "indent": 3,
      "text": "MR#8 The Management Plane SHOULD provide the means for an operator to initiate an optimization process.",
      "ja": "MR＃8管理プレーンは、最適化プロセスを開始するためのオペレータのための手段を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "MR#9 An operator-initiated optimization MUST be performed in a minimally disruptive manner, as described in Section 3.5.",
      "ja": "セクション3.5で説明したようにMR＃9オペレータ起動の最適化は、最小限に破壊的な方法で行われなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "Frederic Jounay of France Telecom and Yuji Kamite of NTT Communications Corporation coauthored a version of this document.",
      "ja": "NTTコミュニケーションズ株式会社のフランステレコムと雄二KamiteのフレデリックJounayは、このドキュメントのバージョンを共著。"
    },
    {
      "indent": 3,
      "text": "A rewrite of this document occurred after the IETF 77 meeting. Dimitri Papadimitriou, Lou Berger, Tony Li, the former WG Chairs John Scuder and Alex Zinin, the current WG Chair Alia Atlas, and others provided valuable guidance prior to and at the IETF 77 RTGWG meeting.",
      "ja": "このドキュメントの書き換えは、IETF 77会議の後に起こりました。ディミトリPapadimitriou、ルー・バーガー、トニー・リーは、かつてのWGは、ジョンScuderとアレックスジニン、現在のWG議長アリアアトラスチェア、そして他の人の前にし、IETF 77 RTGWG会議で貴重なガイダンスを提供します。"
    },
    {
      "indent": 3,
      "text": "Tony Li and John Drake have made numerous valuable comments on the RTGWG mailing list that are reflected in versions following the IETF 77 meeting.",
      "ja": "トニー・リーとジョン・ドレイクは、IETF 77会議の次のバージョンに反映されRTGWGメーリングリスト上の数多くの貴重なコメントをしました。"
    },
    {
      "indent": 3,
      "text": "Iftekhar Hussain and Kireeti Kompella made comments on the RTGWG mailing list after the IETF 82 meeting that identified a new requirement. Iftekhar Hussain made numerous valuable comments on the RTGWG mailing list that resulted in improvements to the document's clarity.",
      "ja": "イフテックハーフセインとKireeti Kompellaは、新しい要件を識別IETF 82会議の後RTGWGメーリングリスト上のコメントが寄せられています。イフテックハーフセインは、文書の明瞭に改善をもたらしRTGWGメーリングリストで数多くの貴重なコメントをしました。"
    },
    {
      "indent": 3,
      "text": "In the interest of full disclosure of affiliation and in the interest of acknowledging sponsorship, past affiliations of authors are noted here. Much of the work done by Ning So and Andrew Malis occurred while they were at Verizon. Much of the work done by Curtis Villamizar occurred while he was at Infinera.",
      "ja": "所属の完全な開示の利益のためにとスポンサーシップを認めるの利益のために、筆者の過去の所属は、ここに記載されています。彼らはベライゾンであったが寧だから、とアンドリューMalisによって行われる作業の多くが発生しました。彼はInfineraのであったカーティスVillamizarによって行われる作業の多くが発生しました。"
    },
    {
      "indent": 3,
      "text": "Tom Yu and Francis Dupont provided the SecDir and GenArt reviews, respectively. Both reviews provided useful comments. The current wording of the security section is based on suggested wording from Tom Yu. Lou Berger provided the RtgDir review, which resulted in the document being renamed and the substantial clarification of terminology and document wording, particularly in the Abstract, Introduction, and Definitions sections.",
      "ja": "トム・ゆうとフランシス・デュポンは、それぞれ、SecDirとGenArtレビューを提供します。どちらのレビューは、有益なコメントを提供しました。セキュリティセクションの現在の文言は、トム・ゆうからの提案言葉遣いに基づいています。ルー・バーガーは、特に抽象、導入、および定義のセクションでは、名前を変更されているドキュメントと用語と文書の文言の実質的な解明が生じRtgDirレビューを、提供します。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations for MPLS/GMPLS and for MPLS-TP are documented in [RFC5920] and [RFC6941]. This document does not impact the security of MPLS, GMPLS, or MPLS-TP.",
      "ja": "MPLS / GMPLS用およびMPLS-TPのためのセキュリティの考慮事項は、[RFC5920]と[RFC6941]に記載されています。この文書では、MPLS、GMPLS、またはMPLS-TPのセキュリティに影響を与えません。"
    },
    {
      "indent": 3,
      "text": "The additional information that this document requires does not provide significant additional value to an attacker beyond the information already typically available from attacking a routing or signaling protocol. If the requirements of this document are met by extending an existing routing or signaling protocol, the security considerations of the protocol being extended apply. If the requirements of this document are met by specifying a new protocol, the security considerations of that new protocol should include an evaluation of what level of protection is required by the additional information specified in this document, such as data origin authentication.",
      "ja": "この文書が必要とする追加情報は、ルーティングを攻撃またはシグナリングプロトコルから、既に一般的に入手可能な情報を越えた攻撃者に多大な付加価値を提供していません。この文書の要件は既存のルーティングを拡張またはシグナリングプロトコルによって満たされている場合、拡張されたプロトコルのセキュリティ上の考慮事項が当てはまります。このドキュメントの要件は新しいプロトコルを指定することで満たされている場合は、その新しいプロトコルのセキュリティ上の考慮事項は、このようなデータ発信元認証として、この文書で指定された追加情報が必要とする保護のレベルの評価を含むべきです。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[FRAMEWORK] Ning, S., McDysan, D., Osborne, E., Yong, L., and C. Villamizar, \"Advanced Multipath Framework in MPLS\", Work in Progress, July 2013.",
      "ja": "【FRAMEWORK]寧、S.、McDysan、D.、オズボーン、E.、龍、L.、及びC. Villamizar、 \"MPLSの高度なマルチパスフレームワーク\"、進歩、2013年7月に働いています。"
    },
    {
      "indent": 3,
      "text": "[IEEE-802.1AX] IEEE Standards Association, \"IEEE Std 802.1AX-2008 IEEE Standard for Local and Metropolitan Area Networks - Link Aggregation\", 2006, <http://standards.ieee.org/getieee802/ download/802.1AX-2008.pdf>.",
      "ja": "[IEEE-802.1AX] IEEE規格協会、 \"ローカルおよびメトロポリタンエリアネットワークのIEEE STD 802.1AX-2008 IEEE規格 - リンクアグリゲーション\"、2006年、<http://standards.ieee.org/getieee802/ダウンロード/ 802.1AX- 2008.pdf>。"
    },
    {
      "indent": 3,
      "text": "[ITU-T.G.800] ITU-T, \"Unified functional architecture of transport networks\", ITU-T Recommendation G.800, February 2012, <http://www.itu.int/rec/T-REC-G/ recommendation.asp?parent=T-REC-G.800>.",
      "ja": "[ITU-TG800] ITU-T、 \"トランスポート・ネットワークの統合機能アーキテクチャ\"、ITU-T勧告G.800、2012年2月、<http://www.itu.int/rec/T-REC-G/推薦.asp？親= T-REC-G.800>。"
    },
    {
      "indent": 3,
      "text": "[RFC2475] Blake, S., Black, D., Carlson, M., Davies, E., Wang, Z., and W. Weiss, \"An Architecture for Differentiated Services\", RFC 2475, December 1998.",
      "ja": "[RFC2475]ブレイク、S.、ブラ​​ック、D.、カールソン、M.、デイヴィス、E.、王、Z.、およびW.ワイス、 \"差別化サービスのためのアーキテクチャ\"、RFC 2475、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3468] Andersson, L. and G. Swallow, \"The Multiprotocol Label Switching (MPLS) Working Group decision on MPLS signaling protocols\", RFC 3468, February 2003.",
      "ja": "[RFC3468]アンデションとL.とG.ツバメ、 \"マルチプロトコルラベルスイッチング（MPLS）シグナリングプロトコルMPLSに関する作業部会の決定\"、RFC 3468、2003年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4201] Kompella, K., Rekhter, Y., and L. Berger, \"Link Bundling in MPLS Traffic Engineering (TE)\", RFC 4201, October 2005.",
      "ja": "[RFC4201] Kompella、K.、Rekhter、Y.、およびL.バーガー、 \"MPLSでのリンクバンドルトラフィックエンジニアリング（TE）\"、RFC 4201、2005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, July 2010.",
      "ja": "[RFC5920]牙、L.、 \"MPLSおよびGMPLSネットワークのセキュリティフレームワーク\"、RFC 5920、2010年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6941] Fang, L., Niven-Jenkins, B., Mansfield, S., and R. Graveman, \"MPLS Transport Profile (MPLS-TP) Security Framework\", RFC 6941, April 2013.",
      "ja": "[RFC6941]牙、L.、ニーヴン・ジェンキンス、B.、マンスフィールド、S.、およびR. Graveman、 \"MPLSトランスポートプロファイル（MPLS-TP）セキュリティフレームワーク\"、RFC 6941、2013年4月。"
    },
    {
      "indent": 3,
      "text": "[USE-CASES] Ning, S., Malis, A., McDysan, D., Yong, L., and C. Villamizar, \"Advanced Multipath Use Cases and Design Considerations\", Work in Progress, November 2013.",
      "ja": "[ユースケース]寧、S.、Malis、A.、McDysan、D.、龍、L.、およびC. Villamizar、 \"高度なマルチユースケースと設計上の考慮事項\"、進歩、2013年11月での作業。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Curtis Villamizar (editor) OCCNC, LLC",
      "ja": "カーティスVillamizar（編集者）OCCNC、LLC"
    },
    {
      "indent": 3,
      "text": "EMail: curtis@occnc.com",
      "ja": "メールアドレス：curtis@occnc.com"
    },
    {
      "indent": 3,
      "text": "Dave McDysan (editor) Verizon 22001 Loudoun County PKWY Ashburn, VA 20147 USA",
      "ja": "デイブMcDysan（編集者）、ベライゾン22001ラウドン郡PKWYアッシュバーン、VA 20147 USA"
    },
    {
      "indent": 3,
      "text": "EMail: dave.mcdysan@verizon.com",
      "ja": "メールアドレス：dave.mcdysan@verizon.com"
    },
    {
      "indent": 3,
      "text": "So Ning Tata Communications",
      "ja": "だから、寧タタ・コミュニケーションズ"
    },
    {
      "indent": 3,
      "text": "EMail: ning.so@tatacommunications.com",
      "ja": "メールアドレス：ning.so@tatacommunications.com"
    },
    {
      "indent": 3,
      "text": "Andrew G. Malis Huawei Technologies 2330 Central Expressway Santa Clara, CA 95050 USA",
      "ja": "アンドリューG. Malis華為技術2330セントラルエクスプレスサンタクララ、CA 95050 USA"
    },
    {
      "indent": 3,
      "text": "EMail: agmalis@gmail.com",
      "ja": "メールアドレス：agmalis@gmail.com"
    },
    {
      "indent": 3,
      "text": "Lucy Yong Huawei USA 5340 Legacy Dr. Plano, TX 75025 USA",
      "ja": "ルーシー・ヨンジュン胡AはUSA 5340レガシー博士プラノ、TX 75025 USAです"
    },
    {
      "indent": 3,
      "text": "Phone: +1 469-277-5837 EMail: lucy.yong@huawei.com",
      "ja": "電話：+1 469-277-5837電子メール：lucy.yong@huawei.com"
    }
  ]
}