{
  "title": {
    "text": "RFC 7954 - Locator/ID Separation Protocol (LISP) Endpoint Identifier (EID) Block",
    "ja": "RFC 7954 - ロケータ/ ID分離プロトコル（LISP）エンドポイント識別子（EID）ブロック"
  },
  "number": 7954,
  "created_at": "2019-11-02 16:05:25.863919+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        L. Iannone\nRequest for Comments: 7954                             Telecom ParisTech\nCategory: Experimental                                          D. Lewis\nISSN: 2070-1721                                      Cisco Systems, Inc.\n                                                                D. Meyer\n                                                                 Brocade\n                                                               V. Fuller\n                                                          September 2016",
      "raw": true
    },
    {
      "indent": 1,
      "text": "Locator/ID Separation Protocol (LISP) Endpoint Identifier (EID) Block",
      "ja": "ロケータ/ ID分離プロトコル（LISP）エンドポイント識別子（EID）ブロック"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document directs IANA to allocate a /32 IPv6 prefix for use with the Locator/ID Separation Protocol (LISP). The prefix will be used for local intra-domain routing and global endpoint identification, by sites deploying LISP as Endpoint Identifier (EID) addressing space.",
      "ja": "この文書は、IANAは、ロケータ/ ID分離プロトコル（LISP）で使用するために/ 32のIPv6プレフィックスを割り当てるように指示します。プレフィックスはエンドポイント識別子（EID）アドレス空間としてLISPを展開部位によって、ローカルドメイン内ルーティングおよびグローバルエンドポイントの識別に使用されるであろう。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、検査、実験的な実装、および評価のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "この文書は、インターネットコミュニティのためにExperimentalプロトコルを定義します。このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7954.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7954で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Definition of Terms . . . . . . . . . . . . . . . . . . . . .   3\n3.  Rationale and Intent  . . . . . . . . . . . . . . . . . . . .   3\n4.  Expected Use  . . . . . . . . . . . . . . . . . . . . . . . .   5\n5.  Block Dimension . . . . . . . . . . . . . . . . . . . . . . .   5\n6.  3+3 Allocation Plan . . . . . . . . . . . . . . . . . . . . .   6\n7.  Allocation Lifetime . . . . . . . . . . . . . . . . . . . . .   7\n8.  Routing Considerations  . . . . . . . . . . . . . . . . . . .   7\n9.  Security Considerations . . . . . . . . . . . . . . . . . . .   8\n10. IANA Considerations . . . . . . . . . . . . . . . . . . . . .   8\n11. References  . . . . . . . . . . . . . . . . . . . . . . . . .   9\n  11.1.  Normative References . . . . . . . . . . . . . . . . . .   9\n  11.2.  Informative References . . . . . . . . . . . . . . . . .  10\nAcknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .  11\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  12",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document directs the IANA to allocate a /32 IPv6 prefix for use with the Locator/ID Separation Protocol (LISP [RFC6830]), LISP Map-Server ([RFC6833]), LISP Alternative Topology (LISP+ALT [RFC6836]) (or other) mapping systems, and LISP Interworking ([RFC6832]).",
      "ja": "この文書は、ロケータ/ ID分離プロトコルで使用するために/ 32のIPv6プレフィックスを割り当てるようにIANAに指示（LISP [RFC6830]）、LISPマップ・サーバ（[RFC6833]）、LISP代替トポロジ（LISP + ALT [RFC6836]）（または他の）マッピングシステム、およびLISPインターワーキング（[RFC6832]）。"
    },
    {
      "indent": 3,
      "text": "This block will be used as global Endpoint Identifier (EID) space.",
      "ja": "このブロックは、グローバルエンドポイント識別子（EID）スペースとして使用されます。"
    },
    {
      "indent": 0,
      "text": "2. Definition of Terms",
      "section_title": true,
      "ja": "用語の定義2。"
    },
    {
      "indent": 3,
      "text": "The present document does not introduce any new terms with respect to the set of LISP Specifications ([RFC6830], [RFC6831], [RFC6832], [RFC6833], [RFC6834], [RFC6835], [RFC6836], [RFC6837]), but it assumes that the reader is familiar with the LISP terminology. [LISP-INTRO] provides an introduction to the LISP technology, including its terminology.",
      "ja": "本文書は、LISPの仕様のセット（[RFC6830]、[RFC6831]、[RFC6832]、[RFC6833]、[RFC6834]、[RFC6835]、[RFC6836]、[RFC6837]）に対する新しい用語を導入しません、それは読者がLISP用語に精通していることを前提としています。 [LISP-INTRO]は、その用語を含むLISP技術の概要を提供します。"
    },
    {
      "indent": 0,
      "text": "3. Rationale and Intent",
      "section_title": true,
      "ja": "3.理由と意図"
    },
    {
      "indent": 3,
      "text": "Discussion within the LISP working group led to the identification of several scenarios in which the existence of a LISP-specific address block brings technical benefits. The most relevant scenarios are described below:",
      "ja": "LISPワーキンググループ内での議論は、LISP固有のアドレスブロックの存在は、技術的な利点をもたらしているいくつかのシナリオの同定につながりました。最も関連性の高いシナリオは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "Early LISP destination detection: With the current specifications, there is no direct way to detect whether or not a certain destination is in a LISP domain without performing a LISP mapping lookup. For instance, if an Ingress Tunnel Router (ITR) is sending packets to all types of destinations (i.e., non-LISP destinations, LISP destinations not in the IPv6 EID block, and LISP destinations in the IPv6 EID block), the only way to understand whether or not to encapsulate the traffic is to perform a cache lookup and, in case of a LISP cache miss, send a Map-Request to the mapping system. In the meanwhile (while waiting for the Map-Reply), packets may be dropped to avoid excessive buffering.",
      "ja": "初期のLISP先の検出：現在の仕様では、特定の宛先がLISPマッピング検索を実行せずにLISPのドメイン内にあるか否かを検出する直接的な方法はありません。例えば、入力トンネルルータ（ITR）は、目的地のすべてのタイプ（すなわち、非LISPの宛先、IPv6のEIDブロックのLISPの目的地ではない、とIPv6 EIDブロックでLISPの宛先）への唯一の道にパケットを送信する場合LISPのキャッシュミスの場合には、マッピングシステムへの地図-Requestを送信、キャッシュルックアップを実行することでトラフィックをカプセル化するかどうか理解し。ところで（地図-返信を待っている間に）、パケットが過度のバッファリングを避けるためにドロップすることができます。"
    },
    {
      "indent": 3,
      "text": "Avoid penalizing non-LISP traffic: In certain circumstances, it might be desirable to configure a router using LISP features to natively forward all packets that do not have a destination address in the block and, hence, no lookup whatsoever is performed and packets destined to non-LISP sites are not penalized in any manner.",
      "ja": "非LISPトラフィックを不利に避けてください：ある特定の状況では、ネイティブに前進したがって、何の検索が一切行われず、パケットが宛て、ブロック内の宛先アドレスを持っていないすべてのパケットをLISPの機能を使用してルータを設定することが望ましいかもしれません非LISPサイトがどのような方法で不利にされていません。"
    },
    {
      "indent": 3,
      "text": "Traffic Engineering: In some deployment scenarios, it might be desirable to apply different traffic-engineering policies for LISP and non-LISP traffic. A LISP-specific EID block would allow improved traffic-engineering capabilities with respect to LISP vs. non-LISP traffic. In particular, LISP traffic might be identified without having to use Deep Packet Inspection (DPI) techniques in order to parse the encapsulated packet. Instead, performing a simple inspection of the outer header is sufficient.",
      "ja": "トラフィックエンジニアリングは：いくつかの展開シナリオでは、LISPと非LISPトラフィックのための異なるトラフィック・エンジニアリング・ポリシーを適用することが望ましいかもしれません。 LISP固有のEIDブロックは非LISPトラフィック対LISPに関して改善トラフィック・エンジニアリング機能を可能にします。特に、LISPトラフィックがカプセル化されたパケットを解析するためにディープパケットインスペクション（DPI）技術を使用することなく同定されるかもしれません。代わりに、外部ヘッダの簡単な検査を行うことで十分です。"
    },
    {
      "indent": 3,
      "text": "Transition Mechanism: The existence of a LISP-specific EID block may prove useful in transition scenarios. A non-LISP domain would ask for an allocation in the LISP EID block and use it to deploy LISP in its network. Such allocation would not be announced in the BGP routing infrastructure (cf. Section 4). This approach will allow non-LISP domains to avoid fragmenting their already allocated non-LISP addressing space, which may lead to BGP routing table inflation since it may (rightfully) be announced in the BGP routing infrastructure.",
      "ja": "遷移メカニズム：LISP固有EIDブロックの存在は、遷移シナリオで有用であろう。非LISPドメインは、LISPのEIDブロックの割り当てを依頼し、そのネットワークでLISPを展開するために使用します。そのような割り当ては、BGPルーティング・インフラストラクチャ（参照セクション4）に発表されないであろう。このアプローチは、その既に割り当てられた非LISPアドレス空間の断片化を避けるために、非LISPのドメインを許可します、それは（当然）BGPルーティングインフラストラクチャに発表することができるので、BGPルーティングテーブルのインフレにつながる可能性があります。"
    },
    {
      "indent": 3,
      "text": "Limit the impact on the BGP routing infrastructure: As described in the previous scenario, LISP adopters will avoid fragmenting their addressing space, since fragmentation would negatively impact the BGP routing infrastructure. Adopters will use addressing space from the EID block, which might be announced in large aggregates and in a tightly controlled manner only by Proxy Tunnel Routers (PxTRs).",
      "ja": "BGPルーティングインフラストラクチャへの影響を制限する：前のシナリオで説明したようにフラグメンテーションが負BGPルーティングインフラストラクチャに影響を与えるので、LISP採用は、そのアドレス空間の断片化を回避します。採用者には大きな凝集体にのみプロキシトンネルルータ（PxTRs）によって厳密に制御された方法で発表される可能性がありますEIDブロックからアドレス空間を使用します。"
    },
    {
      "indent": 3,
      "text": "It is worth mentioning that new use cases may arise in the future, due to new and unforeseen scenarios.",
      "ja": "これは、新しいユースケースが原因新しく、予期せぬ状況に、将来的に発生する可能性があることを言及する価値があります。"
    },
    {
      "indent": 3,
      "text": "Furthermore, the use of a dedicated address block allows for tighter control over the traffic in the initial experimental phase (especially filtering), while facilitating its large-scale deployment.",
      "ja": "その大規模な展開を容易にしながらさらに、専用のアドレスブロックを使用することは、初期の実験段階（特にフィルタリング）でトラフィック上厳密な制御を可能にします。"
    },
    {
      "indent": 3,
      "text": "[RFC3692] considers assigning experimental and testing numbers useful; having a reserved IPv6 prefix enables this practice. The present document follows the guidelines provided in [RFC3692], with one exception. [RFC3692] suggests the use of values similar to those called \"Private Use\" in [RFC5226], which by definition are not unique. One purpose of the present request to IANA is to guarantee uniqueness to the EID block. The lack thereof would result in a lack of real utility of a reserved IPv6 prefix.",
      "ja": "[RFC3692]は有用な実験および試験番号を割り当てる考慮する。予約したIPv6プレフィックスを持つことは、この練習を可能にします。本文書では、一つの例外を除いて、[RFC3692]に提供されるガイドラインに従います。 [RFC3692]は定義によって一意ではありませんこれは[RFC5226]で「私用」と呼ばれるものに類似した値を使用することを示唆しています。 IANAへの本の要求の1つの目的は、EIDブロックに一意性を保証することです。その欠如は、予約したIPv6プレフィックスの本当の有用性の欠如につながります。"
    },
    {
      "indent": 0,
      "text": "4. Expected Use",
      "section_title": true,
      "ja": "4.予想される使用"
    },
    {
      "indent": 3,
      "text": "Sites planning to deploy LISP may request a prefix in the IPv6 EID block. Such prefixes will be used for routing and endpoint identification inside the site requesting it. Mappings related to such a prefix, or part of it, will be made available through the mapping system in use and registered to one or more Map-Server(s).",
      "ja": "LISPの展開を計画しているサイトは、IPv6 EIDブロックのプレフィックスを要求することができます。そのような接頭辞は、それを要求するサイト内部ルーティング及びエンドポイントの識別に使用されるであろう。そのような接頭辞、またはその一部に関連したマッピングは、使用中のマッピング・システムを介して利用可能になると1つまたは複数のマップ・サーバ（群）に登録されます。"
    },
    {
      "indent": 3,
      "text": "The EID block must be used for LISP experimentation and must not be advertised in the form of more specific route advertisements in the non-LISP inter-domain routing environment. Interworking between the EID block sub-prefixes and the non-LISP Internet is done according to the techniques described in [RFC6832] and [RFC7215].",
      "ja": "EIDブロックは、LISPの実験に使用しなければならず、非LISPドメイン間ルーティング環境において、より具体的なルート通知の形で広告されてはなりません。 EIDブロックサブプレフィックスと非LISPインターネットとの間のインターワーキングは、[RFC6832]及び[RFC7215]に記載された技術に従って行われます。"
    },
    {
      "indent": 3,
      "text": "As the LISP adoption progresses, the EID block may potentially have a reduced impact on the BGP routing infrastructure, compared to the case of having the same number of adopters using global unicast space allocated by Regional Internet Registries (RIRs) ([MobiArch2007]). From a short-term perspective, the EID block offers potentially large aggregation capabilities since it is announced by Proxy Tunnel Routers (PxTRs), possibly concentrating several contiguous prefixes. This trend should continue with even lower impact from a long-term perspective, because more aggressive aggregation can be used, potentially leading to using fewer PxTRs announcing the whole EID block ([FIABook2010]).",
      "ja": "LISPの採用が進むにつれて、EIDブロックは、潜在的に地域インターネットレジストリ（のRIR）（[MobiArch2007]）によって割り当てられたグローバルユニキャスト・スペースを使用して、採用の同じ数を有する場合に比べてBGPルーティングインフラストラクチャに減少影響を有することができます。それはプロキシトンネルルータ（PxTRs）が発表されているため、短期的な視点から、EIDブロックは、おそらくいくつかの連続したプレフィックスを集中、潜在的に大きなアグリゲーション機能を提供しています。より積極的な凝集が潜在的に全体EIDブロック（[FIABook2010]）を発表少ないPxTRsの使用につながる、使用することができるので、この傾向は、長期的な視点からも低い衝撃を継続すべきです。"
    },
    {
      "indent": 3,
      "text": "The EID block will be used only at the configuration level, so it is recommended not to hard-code the IPv6 EID block in the router hardware in any way. This prevents locking out sites that may want to switch to LISP while keeping their own IPv6 prefix, which is not in the IPv6 EID block. Furthermore, in the case of a future permanent allocation, the allocated prefix may differ from the experimental temporary prefix allocated during the experimentation phase.",
      "ja": "それはどのような方法でルータのハードウェアでのIPv6 EIDブロックハードコードしないことが推奨されるようにEIDブロックは、構成のみのレベルで使用されるであろう。これは、IPv6 EIDブロックではない、独自のIPv6プレフィックスを、保ちながら、LISPに切り替えたいかもしれサイトをロックアウトしないように。さらに、将来永久割り当ての場合には、割り当てられた接頭辞は、実験段階の間に割り当てられた一時的な実験プレフィックスと異なる場合があります。"
    },
    {
      "indent": 3,
      "text": "With the exception of the Proxy Ingress Tunnel Router (PITR) case (described in Section 8), prefixes out of the EID block must not be announced in the BGP routing infrastructure.",
      "ja": "（セクション8を参照）プロキシ入力トンネルルータ（PITR）場合を除いて、EIDブロックのうちプレフィックスは、BGPルーティングインフラストラクチャに発表されてはなりません。"
    },
    {
      "indent": 0,
      "text": "5. Block Dimension",
      "section_title": true,
      "ja": "5.ブロック寸法"
    },
    {
      "indent": 3,
      "text": "The working group reached consensus on an initial allocation of a /32 prefix. The reason of such consensus is manifold:",
      "ja": "ワーキンググループは、/ 32プレフィックスの初期配分について合意に達しました。そのような合意の理由は多種多様です。"
    },
    {
      "indent": 3,
      "text": "o The working group agreed that the /32 prefix is sufficiently large to cover initial allocation and requests for prefixes in the EID space in the next few years for very large-scale experimentation and deployment.",
      "ja": "Oワーキンググループは、/ 32プレフィックスが非常に大規模な実験と展開のために、今後数年間でEID空間の接頭辞のための初期割当てと要求をカバーするのに十分な大きさであることに合意しました。"
    },
    {
      "indent": 3,
      "text": "o As a comparison, it is worth mentioning that the current LISP Beta Network ([BETA]) is using a /32 prefix, with more than 250 sites using a /48 sub-prefix. Hence, a /32 prefix appears sufficiently large to allow the current deployment to scale up and be open for interoperation with independent deployments using the EIDs in the new /32 prefix.",
      "ja": "O比較として、現在のLISPベータネットワーク（β）/ 48サブプレフィックスを使用して250の以上のサイトと、/ 32プレフィックスを使用していることを言及する価値があります。したがって、/ 32プレフィックスは、現在の展開がスケールアップして、新しい/ 32プレフィックスでのEIDを使用して独立した展開との相互運用のために開くことができるようにするために十分に大きい表示されます。"
    },
    {
      "indent": 3,
      "text": "o A /32 prefix is sufficiently large to allow deployment of independent (commercial) LISP-enabled networks by third parties, but may as well boost LISP experimentation and deployment.",
      "ja": "O / 32プレフィックスは、第三者による独立した（市販）LISP対応ネットワークの展開を可能にするのに十分な大きさであるが、同様にLISP実験および展開を高めることができます。"
    },
    {
      "indent": 3,
      "text": "o The use of a /32 prefix is in line with previous similar prefix allocation for tunneling protocols ([RFC3056]).",
      "ja": "O / 32接頭辞の使用は、トンネリングプロトコルの以前の同様のプレフィックス割当（[RFC3056]）に沿ったものです。"
    },
    {
      "indent": 0,
      "text": "6. 3+3 Allocation Plan",
      "section_title": true,
      "ja": "6. 3 + 3割当計画"
    },
    {
      "indent": 3,
      "text": "Per this document, IANA has initially assigned a /32 prefix out of the IPv6 addressing space for use as EID in LISP.",
      "ja": "このドキュメントごとに、IANAは、最初はLISPでEIDとして使用するためのIPv6アドレス空間の外に/ 32のプレフィックスが割り当てられています。"
    },
    {
      "indent": 3,
      "text": "IANA allocated the requested address space in September 2016 for a duration of 3 (three) years (through September 2019), with an option to extend this period by 3 (three) more years (until September 2022). By the end of the first period, the IETF will provide a decision on whether to transform the prefix into a permanent assignment or to put it back in the free pool (see Section 7 for more information).",
      "ja": "IANAは、3（3）年以上（2022年9月まで）で、この期間を延長するオプションを、3（3）年間（2019年9月まで）の期間中、2016年9月に要求されたアドレス空間が割り当てられました。最初の期間の終わりまでに、IETFは、永久的な割り当てにプレフィックスを変換するか（詳細については、セクション7を参照）空きプールにそれを戻すかどうかの決定を提供します。"
    },
    {
      "indent": 3,
      "text": "In the first case, i.e., if the IETF decides to transform the block into a permanent allocation, the EID block allocation period will be extended for three years (until September 2022) to give the IETF time to define the final size of the EID block and create a transition plan. The transition of the EID block into a permanent allocation might pose policy issues (as recognized in [RFC2860], Section 4.3); therefore, discussion with the IANA, the RIR communities, and the IETF community will be necessary to determine the appropriate policy for permanent EID-block allocation and management. Note as well that the final permanent allocation may differ from the initial experimental assignment; hence, it is recommended not to hard-code the experimental EID block on LISP-capable devices in any way.",
      "ja": "IETFは、永久的な配分にブロックを変換することを決定した場合最初のケースでは、すなわち、EIDブロック割り当て期間は、EIDブロックの最終的なサイズを定義するためのIETF時間を与えるために（2022年9月まで）3年間延長されますそして、移行計画を作成します。 （[RFC2860]、セクション4.3で認識されるように）永久的な割り当てにEIDブロックの遷移は、ポリシーの問題を引き起こす可能性があります。従って、IANA、RIRコミュニティ、及びIETFコミュニティとの議論は、永久EIDブロック割り当ておよび管理のための適切な方針を決定することが必要であろう。同様に、最終的な永久的な割り当ては、初期実験割り当て異なっていてもよいことに留意されたいです。したがって、それは、いかなる方法でもハードコードにLISP対応デバイスに関する実験EIDブロックがないことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "In the latter case, i.e., if the IETF decides to terminate the experimental-use EID block, all temporary prefix allocations in this address range must expire and be released by September 2019, so that the entire /32 is returned to the free pool.",
      "ja": "IETFは、実験用EIDブロックを終了することを決定した場合、後者の場合、すなわち、このアドレス範囲内のすべての一時的なプレフィックスの割り当てが期限切れにならず、全体/ 32がフリープールに戻されるように、2019年9月によって解放されます。"
    },
    {
      "indent": 3,
      "text": "The allocation and management of the EID block for the initial 3-year period (and the optional 3 more years) is detailed in [RFC7955].",
      "ja": "最初の3年間のEIDブロック（およびオプション3年以上）の割り当ておよび管理は、[RFC7955]に詳述されています。"
    },
    {
      "indent": 0,
      "text": "7. Allocation Lifetime",
      "section_title": true,
      "ja": "7.割り当て生涯"
    },
    {
      "indent": 3,
      "text": "If no explicit action is carried out by the end of the experiment (by September 2019), it is automatically considered that there was not sufficient interest in having a permanent allocation; therefore, the address block will be returned to the free pool.",
      "ja": "明示的なアクションが（2019年9月によって）実験の終了によって行われていない場合は、自動的に恒久的な割り当てを持つことに十分な関心がなかったと考えられます。そのため、アドレスブロックは、空きプールに戻されます。"
    },
    {
      "indent": 3,
      "text": "Otherwise, if the LISP working group recognizes that there is value in having a permanent allocation, then explicit action is needed.",
      "ja": "LISPのワーキンググループは、恒久的な配分を持つことに価値があることを認識した場合それ以外の場合は、明示的なアクションが必要とされています。"
    },
    {
      "indent": 3,
      "text": "In order to trigger the process for a permanent allocation, a document is required. Such a document has to articulate the rationale for why a permanent allocation would be beneficial. More specifically, the document has to detail the experience gained during experimentation and all of the technical benefits provided by the use of a LISP-specific prefix. Such technical benefits are expected to lay in the scenarios described in Section 3. However, new and unforeseen benefits may appear during experimentation. The description should be sufficiently articulate that the needed size of the permanent allocation can be estimated. However, note that, as explained in Section 6, it is up to IANA to decide which address block will be used as a permanent allocation and that such a block may be different from the temporary experimental allocation.",
      "ja": "永久的な割り当てのためのプロセスをトリガするために、文書が必要です。このような文書は、永久的な配分が有益である理由の根拠を明確にする必要があります。具体的には、文書が細部までの経験は、実験とLISP固有の接頭辞を使用することにより提供される技術の利点のすべての中に獲得しています。このような技術的な利点は、しかし、新しい、予期せぬ利点は、実験中に表示される可能性第3節で説明したシナリオに置くことが期待されています。説明は永久的な配分の必要なサイズを推定することができることを十分に明確にする必要があります。しかしながら、セクション6で説明したように、永久割り振りとして使用されるアドレスブロックと、そのようなブロックは一時的実験割り当て異なってもよいことを決定するIANAまで、それがあることに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "8. Routing Considerations",
      "section_title": true,
      "ja": "8.ルーティングの考慮事項"
    },
    {
      "indent": 3,
      "text": "In order to provide connectivity between the Legacy Internet and LISP sites, PITRs announcing large aggregates (ideally one single, large aggregate) of the IPv6 EID block could be deployed. By doing so, PITRs will attract traffic destined for LISP sites in order to encapsulate and forward it toward the specific destination LISP site. Routers in the Legacy Internet must treat announcements of prefixes from the IPv6 EID block as normal announcements, applying best current practices for traffic engineering and security.",
      "ja": "従来のインターネットとLISPサイト間の接続性を提供するために、大きな凝集物のIPv6 EIDブロックの（理想的には単一の、大きな凝集体）を発表PITRsを展開することができます。そうすることによって、PITRsはカプセル化し、特定の宛先LISPサイトに向かってそれを転送するためにLISPサイト宛てのトラフィックを誘致します。レガシーインターネットにおけるルータは、トラフィックエンジニアリングとセキュリティのためのベストプラクティスを適用する現在の、通常の告知などのIPv6 EIDブロックからプレフィックスのアナウンスを扱わなければなりません。"
    },
    {
      "indent": 3,
      "text": "Even in a LISP site, not all routers need to run LISP elements. In particular, routers that are not at the border of the local domain, used only for intra-domain routing, do not need to provide any specific LISP functionality but must be able to route traffic using addresses in the IPv6 EID block.",
      "ja": "でもLISPサイトではなく、すべてのルータは、LISPの要素を実行する必要があります。具体的には、ローカルドメインの境界にはないルータは、唯一のドメイン内ルーティングのために使用され、任意の特定のLISP機能を提供する必要はありませんが、IPv6のEIDブロックのアドレスを使用してトラフィックをルーティングすることができなければなりません。"
    },
    {
      "indent": 3,
      "text": "For the above-mentioned reasons, routers that do not run any LISP element must not include any special handling code or hardware for addresses in the IPv6 EID block. In particular, it is recommended that the default router configuration not handle such addresses in any special way. Doing differently could prevent communication between the Legacy Internet and LISP sites or even break local intra-domain connectivity.",
      "ja": "上記の理由により、任意のLISPの要素を実行しないルータは、IPv6 EIDブロック内のアドレスのための特別な処理コードやハードウェアを含めることはできません。特に、デフォルトルータの設定は、任意の特別な方法でそのようなアドレスを処理できないことをお勧めします。レガシーインターネットとLISPサイト間の通信を防止したり、ローカルドメイン内の接続を壊す可能性が異なってやって。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not introduce new security threats in the LISP architecture nor in the legacy Internet architecture.",
      "ja": "この文書では、LISPアーキテクチャでも、従来のインターネットアーキテクチャに新たなセキュリティの脅威を導入しません。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "ja": "10. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned a /32 IPv6 prefix for use as the global EID space for LISP using a hierarchical allocation as outlined in [RFC5226] and summarized in Table 1. The assigned block is from the 2001:5 global unicast space.",
      "ja": "5グローバルユニキャストスペース：IANAは[RFC5226]に概説され、割り当てられたブロック2001から表1にまとめたように、階層的割当てを使用してLISPのグローバルEID空間として使用するために/ 32のIPv6プレフィックスを割り当てました。"
    },
    {
      "indent": 3,
      "text": "IANA is not requested to issue an AS0 Route Origin Attestation (ROA [RFC6491]), because the global EID space is be used for routing purposes.",
      "ja": "IANAは、グローバルEID空間が目的をルーティングするために使用されているので、AS0ルート原産地証明（ROA [RFC6491]）を発行するように要求されていません。"
    },
    {
      "indent": 15,
      "text": "+----------------------+--------------------+\n| Attribute            | Value              |\n+----------------------+--------------------+\n| Address Block        | 2001:5::/32        |\n| Name                 | EID Space for LISP |\n| RFC                  | RFC 7954           |\n| Allocation Date      | September 2016     |\n| Termination Date     | September 2019 [1] |\n| Source               | True [2]           |\n| Destination          | True               |\n| Forwardable          | True               |\n| Global               | True               |\n| Reserved-by-protocol | True [3]           |\n+----------------------+--------------------+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "[1] According to the 3+3 Plan outlined in this document, the termination date can be postponed to September 2022. [2] Can be used as a multicast source as well. [3] To be used as EID space by routers enabled by LISP [RFC6830].",
      "ja": "[1]本文書で概説3 + 3計画によれば、終了日2022年9月に延期することができる[2]ならびにマルチキャスト源として使用することができます。 [3] LISP [RFC6830]で対応ルータによってEID空間として使用します。"
    },
    {
      "indent": 28,
      "text": "Table 1: Global EID Space",
      "ja": "表1：グローバルEIDスペース"
    },
    {
      "indent": 3,
      "text": "The reserved address space is requested for an initial 3-year period starting in September 2016 (until September 2019), with an option to extend it by three years (until September 2022) upon the decision of the IETF (see Sections 6 and 7). Following the policies outlined in [RFC5226], upon IETF Review, the decision should be made on whether to have a permanent EID block assignment by September 2019. If no explicit action is taken or, if the IETF Review outcome is that it is not worth having a reserved prefix as a global EID space, the whole /32 will be taken out from the \"IANA IPv6 Special-Purpose Address Registry\" and put back in the free pool managed by IANA.",
      "ja": "予約されたアドレス空間は（セクション6および7を参照）IETFの決定時に3年（2022年9月まで）でそれを拡張するためのオプションで、（2019年9月まで）2016年9月に開始し、最初の3年間のために要求されています。 IETFレビュー時に[RFC5226]に概説された方針を、続いて、決定はIETFレビューの結果は、それは価値がないということであれば、明示的なアクションがとられていない場合は9月2019によって永久EIDブロックの割り当てを持っているか、するかどうかになされるべきですグローバルEID空間として予約された接頭辞を持つ、/ 32の全体は、「IANA IPv6の特別な目的のアドレス登録」から取り出して、IANAによって管理される空きプールに戻されます。"
    },
    {
      "indent": 3,
      "text": "Allocation and management of the global EID space is detailed in [RFC7955]. Nevertheless, all prefix allocations out of this space must be temporary and no allocation must go beyond September 2019 unless the IETF Review decides for a permanent global EID space assignment.",
      "ja": "グローバルEID空間の割り当てと管理は、[RFC7955]に詳述されています。それにもかかわらず、このスペースのうち、すべてのプレフィックスの割り当ては一時的でなければならず、IETFレビューは永久的なグローバルEIDスペースの割り当てのために決定しない限り、割り当てが2019年9月を超えてはなりません。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2860] Carpenter, B., Baker, F., and M. Roberts, \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\", RFC 2860, DOI 10.17487/RFC2860, June 2000, <http://www.rfc-editor.org/info/rfc2860>.",
      "ja": "[RFC2860]大工、B.、ベイカー、F.、およびM.ロバーツ、RFC 2860 \"インターネット割り当て番号機関の技術的な仕事に関する了解覚書\"、DOI 10.17487 / RFC2860、2000年6月、<のhttp：// www.rfc-editor.org/info/rfc2860>。"
    },
    {
      "indent": 3,
      "text": "[RFC3692] Narten, T., \"Assigning Experimental and Testing Numbers Considered Useful\", BCP 82, RFC 3692, DOI 10.17487/RFC3692, January 2004, <http://www.rfc-editor.org/info/rfc3692>.",
      "ja": "[RFC3692] Narten氏、T.、 \"役に立つと考えられた実験的でテスト番号の割り当て\"、BCP 82、RFC 3692、DOI 10.17487 / RFC3692、2004年1月、<http://www.rfc-editor.org/info/rfc3692>。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, DOI 10.17487/RFC5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、DOI 10.17487 / RFC5226、2008年5月、<http://www.rfc-editor.org /情報/ RFC5226>。"
    },
    {
      "indent": 3,
      "text": "[RFC6830] Farinacci, D., Fuller, V., Meyer, D., and D. Lewis, \"The Locator/ID Separation Protocol (LISP)\", RFC 6830, DOI 10.17487/RFC6830, January 2013, <http://www.rfc-editor.org/info/rfc6830>.",
      "ja": "[RFC6830]ファリナッチ、D.、フラー、V.、マイヤー、D.、およびD.ルイス、 \"ロケータ/ ID分離プロトコル（LISP）\"、RFC 6830、DOI 10.17487 / RFC6830、2013年1月、<HTTP：/ /www.rfc-editor.org/info/rfc6830>。"
    },
    {
      "indent": 3,
      "text": "[RFC6831] Farinacci, D., Meyer, D., Zwiebel, J., and S. Venaas, \"The Locator/ID Separation Protocol (LISP) for Multicast Environments\", RFC 6831, DOI 10.17487/RFC6831, January 2013, <http://www.rfc-editor.org/info/rfc6831>.",
      "ja": "[RFC6831]ファリナッチ、D.、マイヤー、D.、Zwiebel、J.、およびS. Venaas、 \"ロケータ/ ID分離プロトコルマルチキャスト環境の（LISP）\"、RFC 6831、DOI 10.17487 / RFC6831、2013年1月、< http://www.rfc-editor.org/info/rfc6831>。"
    },
    {
      "indent": 3,
      "text": "[RFC6832] Lewis, D., Meyer, D., Farinacci, D., and V. Fuller, \"Interworking between Locator/ID Separation Protocol (LISP) and Non-LISP Sites\", RFC 6832, DOI 10.17487/RFC6832, January 2013, <http://www.rfc-editor.org/info/rfc6832>.",
      "ja": "[RFC6832]ルイス、D.、マイヤー、D.、ファリナッチ、D.、およびV.フラー、RFC 6832、DOI 10.17487 / RFC6832 1月 \"ロケータ/ ID分離プロトコル（LISP）および非LISPサイト間のインターワーキング\" 2013年、<http://www.rfc-editor.org/info/rfc6832>。"
    },
    {
      "indent": 3,
      "text": "[RFC6833] Fuller, V. and D. Farinacci, \"Locator/ID Separation Protocol (LISP) Map-Server Interface\", RFC 6833, DOI 10.17487/RFC6833, January 2013, <http://www.rfc-editor.org/info/rfc6833>.",
      "ja": "[RFC6833]フラー、V.およびD.ファリナッチ、 \"ロケータ/ ID分離プロトコル（LISP）地図・サーバ・インタフェース\"、RFC 6833、DOI 10.17487 / RFC6833、2013年1月、<http://www.rfc-editor.org /情報/ rfc6833>。"
    },
    {
      "indent": 3,
      "text": "[RFC6834] Iannone, L., Saucez, D., and O. Bonaventure, \"Locator/ID Separation Protocol (LISP) Map-Versioning\", RFC 6834, DOI 10.17487/RFC6834, January 2013, <http://www.rfc-editor.org/info/rfc6834>.",
      "ja": "[RFC6834] Iannone、L.、Saucez、D.、およびO.ボナベンチャー、 \"ロケータ/ ID分離プロトコル（LISP）地図・バージョン\"、RFC 6834、DOI 10.17487 / RFC6834、2013年1月、<のhttp：// WWW。 rfc-editor.org/info/rfc6834>。"
    },
    {
      "indent": 3,
      "text": "[RFC6835] Farinacci, D. and D. Meyer, \"The Locator/ID Separation Protocol Internet Groper (LIG)\", RFC 6835, DOI 10.17487/RFC6835, January 2013, <http://www.rfc-editor.org/info/rfc6835>.",
      "ja": "[RFC6835]ファリナッチ、D.およびD.マイヤー、 \"ロケータ/ ID分離プロトコルインターネット痴漢（LIG）\"、RFC 6835、DOI 10.17487 / RFC6835、2013年1月、<http://www.rfc-editor.org/情報/ rfc6835>。"
    },
    {
      "indent": 3,
      "text": "[RFC6836] Fuller, V., Farinacci, D., Meyer, D., and D. Lewis, \"Locator/ID Separation Protocol Alternative Logical Topology (LISP+ALT)\", RFC 6836, DOI 10.17487/RFC6836, January 2013, <http://www.rfc-editor.org/info/rfc6836>.",
      "ja": "[RFC6836]フラー、V.、ファリナッチ、D.、マイヤー、D.、およびD.ルイス、 \"ロケータ/ ID分離プロトコルの代替論理トポロジ（LISP + ALT）\"、RFC 6836、DOI 10.17487 / RFC6836、2013年1月、 <http://www.rfc-editor.org/info/rfc6836>。"
    },
    {
      "indent": 3,
      "text": "[RFC6837] Lear, E., \"NERD: A Not-so-novel Endpoint ID (EID) to Routing Locator (RLOC) Database\", RFC 6837, DOI 10.17487/RFC6837, January 2013, <http://www.rfc-editor.org/info/rfc6837>.",
      "ja": "[RFC6837]リア、E.、 \"NERD：それほど新しいエンドポイントID（EID）ルーティングロケータ（RLOC）データベースへ\"、RFC 6837、DOI 10.17487 / RFC6837、2013年1月、<のhttp：//www.rfc -editor.org/info/rfc6837>。"
    },
    {
      "indent": 3,
      "text": "[RFC7955] Iannone, L., Jorgensen, R., Conrad, D., and G. Huston, \"Locator/ID Separation Protocol (LISP) Endpoint Identifier (EID) Block Management Guidelines\", RFC 7955, DOI 10.17487/RFC7955, September 2016, <http://www.rfc-editor.org/info/rfc7955>.",
      "ja": "[RFC7955] Iannone、L.、ヨルゲンセン、R.、コンラッド、D.、およびG.ヒューストン、 \"ロケータ/ ID分離プロトコル（LISP）エンドポイント識別子（EID）ブロック管理ガイドライン\"、RFC 7955、DOI 10.17487 / RFC7955、 2016年9月、<http://www.rfc-editor.org/info/rfc7955>。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[BETA] LISP Beta Network, \"Locator/ID Separation Protocol\", <http://www.lisp4.net>.",
      "ja": "[BETA] LISPベータ・ネットワーク、 \"ロケータ/ ID分離プロトコル\"、<http://www.lisp4.net>。"
    },
    {
      "indent": 3,
      "text": "[FIABook2010] Iannone, L. and T. Leva, \"Modeling the economics of Loc/ID Separation for the Future Internet\", Towards the Future Internet, Pages 11-20, ISBN: 9781607505389, IOS Press, DOI 10.3233/978-1-60750-539-6-11, May 2010.",
      "ja": "今後のインターネットに向けて[FIABook2010] Iannone、L.とT.レバ、 \"今後のインターネットのためのLoc / ID分離の経済学のモデル化\"、ページ11-20、ISBN：9781607505389、IOSを押して、DOI 10.3233 / 978から1 -60750-539-6-11、2010年5月。"
    },
    {
      "indent": 3,
      "text": "[LISP-INTRO] Cabellos-Aparicio, A. and D. Saucez, \"An Architectural Introduction to the Locator/ID Separation Protocol (LISP)\", Work in Progress, draft-ietf-lisp-introduction-13, April 2015.",
      "ja": "[LISP-INTRO] Cabellos・アパリシオ、A.とD. Saucez、進行中で働いて、ドラフト-IETF-lispの紹介 -  13、2015年4月 \"ロケータ/ ID分離プロトコル（LISP）に建築入門\"。"
    },
    {
      "indent": 3,
      "text": "[MobiArch2007] Quoitin, B., Iannone, L., de Launois, C., and O. Bonaventure, \"Evaluating the Benefits of the Locator/ Identifier Separation\", The 2nd ACM-SIGCOMM International Workshop on Mobility in the Evolving Internet Architecture (MobiArch'07), DOI 10.1145/1366919.1366926, August 2007.",
      "ja": "【MobiArch2007] Quoitin、B.、Iannone、L.、デLaunois、C.、およびO.ボナヴェントゥラ、「ロケータ/識別子分離の利点の評価」、進化するインターネットアーキテクチャにおける移動度に第2回ACM SIGCOMM、国際ワークショップ（MobiArch'07）、DOI 10.1145 / 1366919.1366926、2007年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3056] Carpenter, B. and K. Moore, \"Connection of IPv6 Domains via IPv4 Clouds\", RFC 3056, DOI 10.17487/RFC3056, February 2001, <http://www.rfc-editor.org/info/rfc3056>.",
      "ja": "[RFC3056]カーペンター、B.およびK.ムーア、 \"IPv4の雲を介したIPv6ドメインの接続\"、RFC 3056、DOI 10.17487 / RFC3056、2001年2月、<http://www.rfc-editor.org/info/rfc3056> 。"
    },
    {
      "indent": 3,
      "text": "[RFC6491] Manderson, T., Vegoda, L., and S. Kent, \"Resource Public Key Infrastructure (RPKI) Objects Issued by IANA\", RFC 6491, DOI 10.17487/RFC6491, February 2012, <http://www.rfc-editor.org/info/rfc6491>.",
      "ja": "[RFC6491] Manderson、T.、Vegoda、L.、およびS.ケント、 \"IANAによって発行されたリソース公開鍵インフラストラクチャ（RPKI）オブジェクト\"、RFC 6491、DOI 10.17487 / RFC6491、2012年2月、<のhttp：// WWW。 rfc-editor.org/info/rfc6491>。"
    },
    {
      "indent": 3,
      "text": "[RFC7215] Jakab, L., Cabellos-Aparicio, A., Coras, F., Domingo-Pascual, J., and D. Lewis, \"Locator/Identifier Separation Protocol (LISP) Network Element Deployment Considerations\", RFC 7215, DOI 10.17487/RFC7215, April 2014, <http://www.rfc-editor.org/info/rfc7215>.",
      "ja": "[RFC7215] Jakab、L.、Cabellos-アパリシオ、A.、Coras、F.、ドミンゴ、パスカル、J.、およびD.ルイス、 \"ロケータ/識別子分離プロトコル（LISP）ネットワーク要素の展開に関する考慮事項\"、RFC 7215、 DOI 10.17487 / RFC7215、2014年4月、<http://www.rfc-editor.org/info/rfc7215>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Special thanks to Roque Gagliano for his suggestions and pointers. Thanks to Alvaro Retana, Deborah Brungard, Ron Bonica, Damien Saucez, David Conrad, Scott Bradner, John Curran, Paul Wilson, Geoff Huston, Wes George, Arturo Servin, Sander Steffann, Brian Carpenter, Roger Jorgensen, Terry Manderson, Brian Haberman, Adrian Farrel, Job Snijders, Marla Azinger, Chris Morrow, and Peter Schoenmaker for their insightful comments. Thanks as well to all participants for the fruitful discussions on the IETF mailing list.",
      "ja": "彼の提案やポインタのためのロケガリアーノに感謝します。アルバロRetana、デボラBrungard、ロンBonica、ダミアンSaucez、デヴィッド・コンラッド、スコット・ブラッドナー、ジョン・カラン、ポール・ウィルソン、ジェフ・ヒューストン、ウェス・ジョージ、アルトゥーロServin、サンダーSteffann、ブライアン・カーペンター、ロジャー・ヨルゲンセン、テリーManderson、ブライアンハーバーマンのおかげで、彼らの洞察に満ちたコメントのエードリアンファレル、仕事Snijdersの、マーラAzinger、クリス・モロー、そしてピーターSchoenmaker。同様IETFメーリングリストで実りある議論のためのすべての参加者に感謝します。"
    },
    {
      "indent": 3,
      "text": "The work of Luigi Iannone has been partially supported by the ANR-13-INFR-0009 LISP-Lab Project <www.lisp-lab.org> and the EIT KIC ICT-Labs SOFNETS Project.",
      "ja": "ルイジIannoneの作業は、部分的にANR-13-INFR-0009 LISP-Labのプロジェクト<www.lisp-lab.org>とEIT KIC ICT-LabsのSOFNETSプロジェクトによって支えられてきました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Luigi Iannone Telecom ParisTech",
      "ja": "ルイジIannoneテレコムParisTech"
    },
    {
      "indent": 3,
      "text": "Email: ggx@gigix.net",
      "ja": "メール：ggx@gigix.net"
    },
    {
      "indent": 3,
      "text": "Darrel Lewis Cisco Systems, Inc.",
      "ja": "ダレルルイスシスコシステムズ株式会社"
    },
    {
      "indent": 3,
      "text": "Email: darlewis@cisco.com",
      "ja": "メール：darlewis@cisco.com"
    },
    {
      "indent": 3,
      "text": "David Meyer Brocade",
      "ja": "デビッド・マイヤーブロケード"
    },
    {
      "indent": 3,
      "text": "Email: dmm@1-4-5.net",
      "ja": "メール：dmm@1-4-5.net"
    },
    {
      "indent": 3,
      "text": "Vince Fuller",
      "ja": "ビンス・フラー"
    },
    {
      "indent": 3,
      "text": "Email: vaf@vaf.net",
      "ja": "メール：vaf@vaf.net"
    }
  ]
}