{
  "title": {
    "text": "RFC 7711 - PKIX over Secure HTTP (POSH)",
    "ja": "RFC 7711 - セキュアHTTP経由PKIX（POSH）"
  },
  "number": 7711,
  "created_at": "2019-11-01 11:58:44.059989+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         M. Miller\nRequest for Comments: 7711                           Cisco Systems, Inc.\nCategory: Standards Track                                 P. Saint-Andre\nISSN: 2070-1721                                                     &yet\n                                                           November 2015",
      "raw": true
    },
    {
      "indent": 22,
      "text": "PKIX over Secure HTTP (POSH)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Experience has shown that it is difficult to deploy proper PKIX certificates for Transport Layer Security (TLS) in multi-tenanted environments. As a result, domains hosted in such environments often deploy applications using certificates that identify the hosting service, not the hosted domain. Such deployments force end users and peer services to accept a certificate with an improper identifier, resulting in degraded security. This document defines methods that make it easier to deploy certificates for proper server identity checking in non-HTTP application protocols. Although these methods were developed for use in the Extensible Messaging and Presence Protocol (XMPP) as a Domain Name Association (DNA) prooftype, they might also be usable in other non-HTTP application protocols.",
      "ja": "経験は、マルチテナント環境でのトランスポート層セキュリティ（TLS）のための適切PKIX証明書を展開することは困難であることが示されています。その結果、このような環境でホストされたドメインは、多くの場合、ホスティングサービスではなく、ホストドメインを識別し、証明書を使用してアプリケーションを配備します。そのような展開では、劣化セキュリティをもたらす、不適切な識別子を持つ証明書を受け入れるようにエンドユーザとピアサービスを強制します。この文書では、それが簡単に非HTTPアプリケーションプロトコルにチェックを適切なサーバーのアイデンティティのための証明書を展開するために作る方法を定義します。これらのメソッドは、ドメイン名協会（DNA）prooftypeとして拡張メッセージングおよびプレゼンスプロトコル（XMPP）で使用するために開発されたが、彼らはまた、他の非HTTPアプリケーションプロトコルで使えるかもしれません。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7711.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7711で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Terminology .....................................................4\n3. Obtaining Verification Material .................................5\n   3.1. Source Domain Possesses PKIX Certificate Information .......6\n   3.2. Source Domain References PKIX Certificate ..................8\n   3.3. Performing Verification ....................................9\n4. Secure Delegation ...............................................9\n5. Order of Operations ............................................10\n6. Caching Results ................................................11\n7. Guidance for Server Operators ..................................12\n8. Guidance for Protocol Authors ..................................12\n9. IANA Considerations ............................................13\n   9.1. Well-Known URI ............................................13\n   9.2. POSH Service Names ........................................13\n10. Security Considerations .......................................14\n11. References ....................................................15\n   11.1. Normative References .....................................15\n   11.2. Informative References ...................................16\nAcknowledgements ..................................................18\nAuthors' Addresses ................................................18",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "We begin with a thought experiment.",
      "ja": "私たちは、思考実験で始まります。"
    },
    {
      "indent": 3,
      "text": "Imagine that you work on the operations team of a hosting company that provides instances of the hypothetical \"Secure Protocol for Internet Content Exchange\" (SPICE) service for ten thousand different customer organizations. Each customer wants their instance to be identified by the customer's domain name (e.g., bar.example.com), not the hosting company's domain name (e.g., hosting.example.net).",
      "ja": "あなたは1万異なる顧客の組織のための仮想的な「インターネットコンテンツのExchange用のプロトコルをセキュア」（SPICE）サービスのインスタンスを提供してホスティング会社の運用チームで作業することを想像してみてください。各顧客は、彼らのインスタンスは、お客様のドメイン名（例えば、bar.example.com）ではなく、ホスティング会社のドメイン名（例えば、hosting.example.net）によって識別されることを望んでいます。"
    },
    {
      "indent": 3,
      "text": "In order to properly secure each customer's SPICE instance via Transport Layer Security (TLS) [RFC5246], you need to obtain and deploy PKIX certificates [RFC5280] containing identifiers such as bar.example.com, as explained in the \"CertID\" specification [RFC6125]. Unfortunately, you can't obtain and deploy such certificates because:",
      "ja": "「CertID」仕様で説明したように、適切にトランスポート層セキュリティ（TLS）[RFC5246]を経由して各顧客のSPICEインスタンスを確保するためには、[このようなbar.example.comなどの識別子を含むPKIX証明書[RFC5280]を取得して展開する必要がありますRFC6125]。残念ながら、あなたは、このような証明書を入手し、展開することはできません。理由は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Certification authorities won't issue such certificates to you because you work for the hosting company, not the customer organization.",
      "ja": "あなたはホスティング会社ではなく、顧客組織のために働くので、O認定当局はあなたに、このような証明書を発行しません。"
    },
    {
      "indent": 3,
      "text": "o Customers won't obtain such certificates and then give them (plus the associated private keys) to you because their legal department is worried about liability.",
      "ja": "Oお客様には、このような証明書を取得して、自分の法務部門が責任を心配しているので、あなたにそれら（プラス関連する秘密鍵）を与えることはありません。"
    },
    {
      "indent": 3,
      "text": "o You don't want to install such certificates (plus the associated private keys) on your servers because your legal department is worried about liability, too.",
      "ja": "あなたの法務部門が責任を心配しているので、Oあなたも、あなたのサーバー上で、このような証明書（プラス関連する秘密鍵）をインストールする必要はありません。"
    },
    {
      "indent": 3,
      "text": "o Even if your legal department is happy, this still means managing one certificate for each customer across the infrastructure, contributing to a large administrative load.",
      "ja": "あなたの法務部門が幸せであっても、O、これはまだ大きな行政負荷に貢献し、インフラストラクチャ全体で顧客ごとに管理つの証明書を意味します。"
    },
    {
      "indent": 3,
      "text": "Given your inability to obtain and deploy public keys / certificates containing the right identifiers, your back-up approach has always been to use a certificate containing hosting.example.net as the identifier. However, more and more customers and end users are complaining about warning messages in user agents and the inherent security issues involved with taking a \"leap of faith\" to accept the identity mismatch between the source domain (bar.example.com) and the delegated domain (hosting.example.net) [RFC6125].",
      "ja": "右の識別子を含む公開鍵/証明書を取得して展開するためにあなたのできないことを考えると、あなたのバック・アップ・アプローチは、常に識別子としてhosting.example.netを含む証明書を使用することでした。しかし、より多くの顧客やエンドユーザーは、ユーザーエージェントと元ドメイン間の同一性の不一致を受け入れるために、「信仰の飛躍」を取っに関わる固有のセキュリティ上の問題で警告メッセージが文句を言っている（bar.example.com）と委任しますドメイン（hosting.example.net）[RFC6125]。"
    },
    {
      "indent": 3,
      "text": "This situation is both insecure and unsustainable. You have investigated the possibility of using DNS Security [RFC4033] and DNS-Based Authentication of Named Entities (DANE) [RFC6698] to solve the problem. However, your customers and your operations team have told you that it will be several years before they will be able to deploy DNSSEC and DANE for all of your customers (because of tooling updates, slow deployment of DNSSEC at some top-level domains, etc.). The product managers in your company are pushing you to find a method that can be deployed more quickly to overcome the lack of proper server identity checking for your hosted customers.",
      "ja": "この状況は不安定で持続不可能でもあります。あなたは問題を解決するためにDNSセキュリティ[RFC4033]と名前付きエンティティのDNSベースの認証（DANE）[RFC6698]を使用する可能性を検討しました。しかし、あなたの顧客とあなたの運用チームは、彼らがためのツールのアップデート、一部のトップレベルドメインでDNSSECのゆっくりと展開、などの顧客のすべて（のためのDNSSECとDANEを展開することができます前に、それは数年になることを言ってきました。）。社内の製品マネージャーは、あなたのホストされた顧客のためにチェックし、適切なサーバIDの不足を克服するために、より迅速に展開することができる方法を見つけるためにあなたを推進しています。"
    },
    {
      "indent": 3,
      "text": "One possible approach that your team has investigated is to ask each customer to provide the public key / certificate for its SPICE service at a special HTTPS URI on their website (\"https://bar.example.com/.well-known/posh/spice.json\" is one possibility). This could be a public key that you generate for the customer, but because the customer hosts it via HTTPS, any user agent can find that public key and check it against the public key you provide during TLS negotiation for the SPICE service (as one added benefit, the customer never needs to hand you a private key). Alternatively, the customer can redirect requests for that special HTTPS URI to an HTTPS URI at your own website, thus making it explicit that they have delegated the SPICE service to you.",
      "ja": "あなたのチームが調査した1つの可能なアプローチは、彼らのウェブサイト上の特別なHTTPS URI（「https://bar.example.com/.well-known/poshでそのSPICEサービスの公開鍵/証明書を提供するために、各顧客を依頼することです/spice.json」）1つの可能性です。これは、顧客のために生成する公開鍵をかもしれないが、顧客がHTTPS経由でホストしているため、任意のユーザエージェントは、公開鍵という見つけることができ、もう1つは追加として（SPICEサービス用のTLSネゴシエーション中にあなたが提供する公開鍵に対してそれをチェックします利点は、顧客が）あなたに秘密鍵を渡す必要はありません。また、顧客は、このように、彼らはあなたにSPICEサービスを委任されていること、それが明示的にすること、あなた自身のウェブサイトでHTTPS URIにその特別なHTTPS URIのための要求をリダイレクトすることができます。"
    },
    {
      "indent": 3,
      "text": "The approach sketched out above, called POSH (\"PKIX over Secure HTTP\"), is explained in the remainder of this document. Although this approach was developed for use in the Extensible Messaging and Presence Protocol (XMPP) as a prooftype for Domain Name Associations (DNA) [RFC7712], it might be usable by any non-HTTP application protocol.",
      "ja": "アプローチは、POSH（「セキュアHTTP上PKIX」）と呼ばれ、上記スケッチ、本文書の残りの部分で説明されています。このアプローチは、ドメイン名協会（DNA）[RFC7712]のためのprooftypeとして拡張メッセージングおよびプレゼンスプロトコル（XMPP）で使用するために開発されたが、それは任意の非HTTPアプリケーションプロトコルによって使用可能であるかもしれません。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "This document inherits security terminology from [RFC5280]. The terms \"source domain\", \"delegated domain\", \"derived domain\", and \"reference identifier\" are used as defined in the \"CertID\" specification [RFC6125].",
      "ja": "この文書では、[RFC5280]からのセキュリティ専門用語を継承します。 「CertID」仕様[RFC6125]で定義されるように、用語「ソースドメイン」、「委任されたドメイン」、「誘導されたドメイン」、および「参照識別子」が使用されています。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、 \"推奨NOT\"、および「OPTIONAL 「本書では[RFC2119]で説明されるように解釈されるべきです。"
    },
    {
      "indent": 3,
      "text": "Additionally, this document uses the following terms:",
      "ja": "また、この文書は、次の用語を使用します。"
    },
    {
      "indent": 3,
      "text": "POSH client: A client that uses the application service and that uses POSH to obtain material for verifying the service's identity.",
      "ja": "POSHクライアント：アプリケーションサービスを使用し、それがサービスのアイデンティティを検証するための材料を得るためにPOSH使用するクライアント。"
    },
    {
      "indent": 3,
      "text": "POSH server: A server that hosts the application service and that uses POSH to provide material for verifying its identity.",
      "ja": "POSHサーバー：アプリケーション・サービスをホストしているが、その身元を確認するための材料を提供するために、POSH使用するサーバー。"
    },
    {
      "indent": 0,
      "text": "3. Obtaining Verification Material",
      "section_title": true,
      "ja": "3.検証材料を得ます"
    },
    {
      "indent": 3,
      "text": "Server identity checking (see [RFC6125]) involves three different aspects:",
      "ja": "サーバーのIDチェックは、（[RFC6125]を参照）三つの異なる側面が含まれます。"
    },
    {
      "indent": 3,
      "text": "1. A proof of the POSH server's identity (in PKIX, this takes the form of a PKIX end-entity certificate [RFC5280]).",
      "ja": "1. POSHサーバのアイデンティティの証明（PKIXにおいて、これはPKIXエンドエンティティ証明書の形をとる[RFC5280]）。"
    },
    {
      "indent": 3,
      "text": "2. Rules for checking the certificate (which vary by application protocol, although [RFC6125] attempts to harmonize those rules).",
      "ja": "（[RFC6125]はこれらのルールを統一しようとしているが、アプリケーションプロトコルによって異なる）証明書を確認するための2ルール。"
    },
    {
      "indent": 3,
      "text": "3. The material that a POSH client uses to verify the POSH server's identity or check the POSH server's proof (in PKIX, this takes the form of chaining the end-entity certificate back to a trusted root and performing all validity checks as described in [RFC5280], [RFC6125], and the relevant application protocol specification).",
      "ja": "3. POSHクライアントがPOSHサーバーの身元を確認したり、PKIXに（POSHサーバーの証明を確認するために使用する材料は、これはで説明したように、すべての有効性チェックを信頼されたルートに戻って、エンドエンティティ証明書を連鎖して実行するという形をとります[ RFC5280]、[RFC6125]、および関連するアプリケーションプロトコル仕様）。"
    },
    {
      "indent": 3,
      "text": "When POSH is used, the first two aspects remain the same: the POSH server proves its identity by presenting a PKIX certificate [RFC5280], and the certificate is checked according to the rules defined in the appropriate application protocol specification (such as [RFC6120] for XMPP). However, the POSH client obtains the material it will use to verify the server's proof by retrieving a JSON document [RFC7159] containing hashes of the PKIX certificate over HTTPS ([RFC7230] and [RFC2818]) from a well-known URI [RFC5785] at the source domain. POSH servers MUST use HTTPS. This means that the POSH client MUST verify the certificate of the HTTPS service at the source domain in order to securely \"bootstrap\" into the use of POSH; specifically, the rules of [RFC2818] apply to this \"bootstrapping\" step to provide a secure basis for all subsequent POSH operations.",
      "ja": "POSHが使用される場合、最初の二つの側面は同じまま：POSHサーバは、PKIX証明書[RFC5280]を提示することによって、その身元を証明し、証明書（例えば、[RFC6120]などの適切なアプリケーションプロトコル仕様で定義されたルールに従ってチェックされますXMPP用）。しかし、POSHクライアントは、よく知られたURI [RFC5785]から、それはJSONドキュメントを取得することで、サーバの証明を検証するために使用する材料[RFC7159] HTTPS経由でPKIX証明書のハッシュを含む（[RFC7230]と[RFC2818]）を取得し、ソースドメインで。 POSHのサーバーは、HTTPSを使用しなければなりません。これは、POSHクライアントが安全にPOSHの使用に「ブートストラップ」するために、ソースドメインでHTTPSサービスの証明書を検証しなければならないことを意味します。具体的には、[RFC2818]のルールは、後続のすべてのPOSH操作のための安全な基盤を提供するために、この「ブートストラップ」ステップに適用されます。"
    },
    {
      "indent": 3,
      "text": "A PKIX certificate is retrieved over secure HTTP in the following way:",
      "ja": "PKIX証明書は次のように、セキュアHTTP経由で取得されます。"
    },
    {
      "indent": 3,
      "text": "1. The POSH client performs an HTTPS GET request at the source domain to the path \"/.well-known/posh/{servicedesc}.json\". The value of \"{servicedesc}\" is application-specific; see Section 8 of this document for more details. For example, if the application protocol is the hypothetical SPICE service, then \"{servicedesc}\" could be \"spice\"; thus, if an application client were to use POSH to verify an application server for the source domain \"bar.example.com\", the HTTPS GET request would be as follows:",
      "ja": "1. POSHクライアントがパス「/.well-known/posh/{servicedesc}.json」に元ドメインのHTTPS GETリクエストを実行します。 「{servicedesc}」の値は、アプリケーション固有です。詳細については、このドキュメントのセクション8を参照してください。アプリケーションプロトコルは、次に、仮説SPICEサービスである場合、例えば、「{servicedesc}」は「スパイス」とすることができます。アプリケーションクライアントは、ソースドメイン「bar.example.com」用のアプリケーション・サーバーを確認するためにPOSH使用した場合ので、のようになりHTTPS GETリクエストは次のとおりです。"
    },
    {
      "indent": 7,
      "text": "GET /.well-known/posh/spice.json HTTP/1.1\nHost: bar.example.com",
      "raw": true
    },
    {
      "indent": 3,
      "text": "2. The source domain HTTPS server responds in one of three ways:",
      "section_title": true,
      "ja": "2.ソースドメインHTTPSサーバは、3つの方法のいずれかで応答します。"
    },
    {
      "indent": 7,
      "text": "*  If it possesses PKIX certificate information for the requested\n   path, it responds as detailed in Section 3.1.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "* If it has a reference to where the PKIX certificate information can be obtained, it responds as detailed in Section 3.2.",
      "ja": "それはPKIX証明書情報を取得することができる場所への参照がある場合*は、3.2節に詳述するように応答します。"
    },
    {
      "indent": 7,
      "text": "* If it does not have any PKIX certificate information or a reference to such information for the requested path, it responds with an HTTP 404 Not Found status code [RFC7231].",
      "ja": "それはどんなPKIX証明書情報や要求されたパスのためにそのような情報への参照を持っていない場合*は、HTTP 404見つかりませんでしたステータスコード[RFC7231]で応答します。"
    },
    {
      "indent": 0,
      "text": "3.1. Source Domain Possesses PKIX Certificate Information",
      "section_title": true,
      "ja": "3.1. ソースドメインは、PKIX証明書の情報を持っています"
    },
    {
      "indent": 3,
      "text": "If the source domain HTTPS server possesses the certificate information, it responds to the HTTPS GET request with a success status code and the message body set to a JSON document [RFC7159]; the document is a \"fingerprints document\", i.e., a JSON object with the following members:",
      "ja": "ソースドメインのHTTPSサーバは、証明書の情報を持っている場合は、それが成功のステータスコードとJSONドキュメント[RFC7159]に設定されたメッセージ本体とHTTPS GET要求に応答します。文書は、「フィンガープリントドキュメント」、すなわち、以下のメンバーを持つJSONオブジェクトです。"
    },
    {
      "indent": 3,
      "text": "o A \"fingerprints\" member whose value is a JSON array of fingerprint descriptors (the member MUST include at least one fingerprint descriptor).",
      "ja": "O値が指紋ディスクリプタのJSON配列である「フィンガープリント」部材は、（メンバは、少なくとも一つの指紋記述子を含まなければなりません）。"
    },
    {
      "indent": 3,
      "text": "o An \"expires\" member whose value is a JSON number specifying the number of seconds after which the POSH client ought to consider the keying material to be stale (further explained under Section 6).",
      "ja": "その値POSHクライアントが古いことが鍵材料を考慮するべきまでの秒数を指定するJSON番号である（さらに、第6節の下で説明）部材を「満了する」O。"
    },
    {
      "indent": 3,
      "text": "The JSON document returned MUST NOT contain a \"url\" member, as described in Section 3.2.",
      "ja": "JSON文書は、3.2節で説明したように、「URL」メンバーを含めることはできません戻りました。"
    },
    {
      "indent": 3,
      "text": "Each included fingerprint descriptor is a JSON object, where each member name is the textual name of a hash function (as listed in [HASH-NAMES]) and its associated value is the base64-encoded fingerprint hash generated using the named hash function (where the encoding adheres to the definition in Section 4 of [RFC4648] and where the padding bits are set to zero).",
      "ja": "各指紋記述子は各メンバ名（[HASH-NAMES]に記載されている）およびその関連値はbase64エンコード指紋ハッシュという名前のハッシュ関数を用いて生成されるハッシュ関数のテキスト名である（JSONオブジェクト、含まれます符号化は、パディングビットがゼロに設定されている[RFC4648]と）のセクション4で定義に付着します。"
    },
    {
      "indent": 3,
      "text": "The fingerprint hash for a given hash algorithm is generated by performing the named hash function over the DER encoding of the PKIX X.509 certificate. (This implies that if the certificate expires or is revoked, the fingerprint value will be out of date.)",
      "ja": "所定のハッシュアルゴリズムの指紋ハッシュがPKIX X.509証明書のDERエンコーディング上名前のハッシュ関数を実行することによって生成されます。 （これは、証明書の有効期限が切れるか、取り消された場合に、指紋値が時代遅れになることを意味します。）"
    },
    {
      "indent": 3,
      "text": "As an example of the fingerprint format, the \"sha-256\" and \"sha-512\" fingerprints are generated by performing the SHA-256 and SHA-512 hash functions, respectively, over the DER encoding of the PKIX certificate, as illustrated below. Note that for readability whitespace has been added to the content portion of the HTTP response shown below but is not reflected in the Content-Length.",
      "ja": "指紋フォーマット、「SHA-512」指紋がPKIX証明書のDERエンコーディング上に、それぞれ、SHA-256およびSHA-512ハッシュ関数を実行することによって生成される「SHA-256」と、一例として、以下に示すように。読みやすさの空白のために、以下に示すHTTPレスポンスのコンテンツ部分に付加されているが、コンテンツの長さに反映されないことに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "Example Fingerprints Response",
      "ja": "例指紋レスポンス"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 200 OK Content-Type: application/json Content-Length: 195",
      "ja": "HTTP / 1.1 200 OKのContent-Type：アプリケーション/ JSONのコンテンツの長さ：195"
    },
    {
      "indent": 3,
      "text": "{\n  \"fingerprints\": [\n    {\n      \"sha-256\": \"4/mggdlVx8A3pvHAWW5sD+qJyMtUHgiRuPjVC48N0XQ=\",\n      \"sha-512\": \"25N+1hB2Vo42l9lSGqw+n3BKFhDHsyork8ou+D9B43TXeJ\n                  1J81mdQEDqm39oR/EHkPBDDG1y5+AG94Kec0xVqA==\"\n    }\n  ],\n  \"expires\": 604800\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The \"expires\" value is a hint regarding the expiration of the keying material. It MUST be a non-negative integer. If the \"expires\" member has a value of 0 (zero), a POSH client MUST consider the verification material to be invalid. See Section 6 for how to reconcile this \"expires\" member with the reference's \"expires\" member.",
      "ja": "値が鍵素材の有効期限に関するヒントである「期限が切れます」。それは非負整数でなければなりません。メンバーは0（ゼロ）の値を持つ「期限が切れる」場合は、POSHクライアントは、検証材料が無効であることを考慮しなければなりません。これは、基準の「期限が切れる」メンバーとメンバーを「期限が切れる」調整する方法については、セクション6を参照してください。"
    },
    {
      "indent": 3,
      "text": "To indicate alternate PKIX certificates (such as when an existing certificate will soon expire), the returned fingerprints member MAY contain multiple fingerprint descriptors. The fingerprints SHOULD be ordered with the most relevant certificate first as determined by the application service operator (e.g., the renewed certificate), followed by the next most relevant certificate (e.g., the certificate soonest to expire). Here is an example (note that whitespace is added for readability):",
      "ja": "（例えば、既存の証明書が間もなく期限切れになるなど）、代替PKIX証明書を示すために、返された指紋のメンバーは、複数の指紋の記述子を含むかもしれません。次の最も関連性の証明書（例えば、最も早い期限が切れるする証明書）、続いてアプリケーションサービス事業者（例えば、更新された証明書）によって決定されるように指紋が最初に最も関連する証明書を使用して順序付けされるべきです。ここでは（空白を読みやすくするために追加されていることに注意してください）例です。"
    },
    {
      "indent": 3,
      "text": "{\n  \"fingerprints\": [\n    {\n      \"sha-256\": \"4/mggdlVx8A3pvHAWW5sD+qJyMtUHgiRuPjVC48N0XQ\",\n      \"sha-512\": \"25N+1hB2Vo42l9lSGqw+n3BKFhDHsyork8ou+D9B43TXe\n                  J1J81mdQEDqm39oR/EHkPBDDG1y5+AG94Kec0xVqA==\"\n    },\n    {\n      \"sha-256\": \"otyLADSKjRDjVpj8X7/hmCAD5C7Qe+PedcmYV7cUncE=\",\n      \"sha-512\": \"MbBD+ausTGJisEXKSynROWrMfHP2xvBnmI79Pr/KXnDyLN\n                  +13Jof8/Uq9fj5HZG8Rk1E2fclcivpGdijUsvHRg==\"\n    }\n  ],\n  \"expires\": 806400\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Matching on any of these fingerprints is acceptable.",
      "ja": "これらの指紋のいずれかのマッチングは可能です。"
    },
    {
      "indent": 3,
      "text": "Rolling over from one hosting provider to another is best handled by updating the relevant SRV records, not primarily by updating the POSH documents themselves.",
      "ja": "別のホスティングプロバイダから寝返りが最善ではなく、主にPOSHドキュメント自体を更新することにより、関連するSRVレコードを更新することによって処理されます。"
    },
    {
      "indent": 0,
      "text": "3.2. Source Domain References PKIX Certificate",
      "section_title": true,
      "ja": "3.2. ソースドメインは、PKIX証明書を参照します"
    },
    {
      "indent": 3,
      "text": "If the source domain HTTPS server has a reference to the certificate information, it responds to the HTTPS GET request with a success status code and message body set to a JSON document. The document is a \"reference document\", i.e., a JSON object with the following members:",
      "ja": "ソースドメインHTTPSサーバは、証明書情報への参照を持っている場合、それはJSON文書に設定され、成功のステータスコードとメッセージボディとHTTPS GETリクエストに応答します。文書は、「参考文献」、すなわち、以下のメンバーを持つJSONオブジェクトです。"
    },
    {
      "indent": 3,
      "text": "o A \"url\" member whose value is a JSON string specifying the HTTPS URI where POSH clients can obtain the actual certificate information. The URI can be a well-known POSH URI as described in Section 8, but it need not be. (For historical reasons, the member name is \"url\", not \"uri\".)",
      "ja": "O値が「URL」部材は、POSHクライアントは実際の証明書情報を取得することができるHTTPS URIを指定するJSON文字列です。第8章で説明したようにURIは、よく知られたPOSH URIすることができますが、それはである必要はありません。 （歴史的な理由により、メンバー名は、「URL」ではなく、「URI」です。）"
    },
    {
      "indent": 3,
      "text": "o An \"expires\" member whose value is a JSON number specifying the number of seconds after which the POSH client ought to consider the delegation to be stale (further explained under Section 6).",
      "ja": "その値POSHクライアントが古いことを委任を考えるべきまでの秒数を指定するJSONの数である（さらに第6項の下で説明）メンバーを「期限が切れる」O。"
    },
    {
      "indent": 3,
      "text": "Example Reference Response",
      "ja": "例参考レスポンス"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 200 OK Content-Type: application/json Content-Length: 82",
      "ja": "HTTP / 1.1 200 OKのContent-Type：アプリケーション/ JSONのコンテンツの長さ：82"
    },
    {
      "indent": 3,
      "text": "{ \"url\":\"https://hosting.example.net/.well-known/posh/spice.json\", \"expires\":86400 }",
      "ja": "{ \"URL\"： \"https://hosting.example.net/.well-known/posh/spice.json\"、 \"有効期限が切れ\"：86400}"
    },
    {
      "indent": 3,
      "text": "In order to process a reference response, the client performs an HTTPS GET request for the URI specified in the \"url\" member value. The HTTPS server for the URI to which the client has been referred responds to the request with a JSON document containing fingerprints as described in Section 3.1. The document retrieved from the location specified by the \"url\" member MUST NOT itself be a reference document (i.e., containing a \"url\" member instead of a \"fingerprints\" member), in order to prevent circular delegations.",
      "ja": "参照応答を処理するために、クライアントは、「URL」メンバ値で指定されたURIのHTTPS GET要求を行います。クライアントは言及されてきたためにURIのためのHTTPSサーバは、3.1節で説明したように、指紋を含むJSONドキュメントで要求に応答します。 「URL」メンバーで指定された場所から検索された文書は、それ自体が円形の委任を防止するために、（すなわち、「URL」部材の代わりに、「指紋」メンバーを含む）参考文献であるはずがありません。"
    },
    {
      "indent": 6,
      "text": "Note: See Section 10 for discussion about HTTPS redirects.",
      "ja": "注意：HTTPSリダイレクトについての議論については、セクション10を参照してください。"
    },
    {
      "indent": 3,
      "text": "The \"expires\" value is a hint regarding the expiration of the source domain's delegation of service to the delegated domain. It MUST be a non-negative integer. If the \"expires\" member has a value of 0 (zero), a POSH client MUST consider the delegation invalid. See Section 6 for guidelines about reconciling this \"expires\" member with the \"expires\" member of the fingerprints document.",
      "ja": "値が委任ドメインに対するサービスのソースドメインの委任の有効期限に関するヒントである「期限が切れます」。それは非負整数でなければなりません。メンバーは0（ゼロ）の値を持つ「期限が切れる」場合は、POSHクライアントは、代表団が無効に考慮しなければなりません。指紋ドキュメントの「期限が切れる」メンバーで、この「期限が切れる」メンバーを調和に関するガイドラインについては第6章を参照してください。"
    },
    {
      "indent": 0,
      "text": "3.3. Performing Verification",
      "section_title": true,
      "ja": "3.3. 検証を実行します"
    },
    {
      "indent": 3,
      "text": "The POSH client compares the PKIX information presented by the POSH server against each fingerprint descriptor object in the POSH fingerprints document, until a match is found using the hash functions that the client supports, or until the collection of POSH verification material is exhausted. If none of the fingerprint descriptor objects match the POSH server PKIX information, the POSH client SHOULD reject the connection (however, the POSH client might still accept the connection if other verification methods are successful, such as DANE [RFC6698]).",
      "ja": "試合は、クライアントがサポートしているハッシュ関数を使用して発見されるまで、またはPOSH検証材料のコレクションがなくなるまでPOSHクライアントは、POSH指紋文書内の各指紋記述子オブジェクトに対するPOSHサーバーから提示さPKIX情報とを比較します。指紋記述子オブジェクトのいずれもPOSHサーバPKIX情報と一致しない場合、接続を拒否すべきであるPOSHクライアントが（ただし、POSHクライアントは、まだ他の検証方法は、DANEとして、成功した場合、接続を受け入れるかもしれません[RFC6698]）。"
    },
    {
      "indent": 0,
      "text": "4. Secure Delegation",
      "section_title": true,
      "ja": "4.セキュアな委任"
    },
    {
      "indent": 3,
      "text": "The delegation from the source domain to the delegated domain can be considered secure if the credentials offered by the POSH server match the verification material obtained by the client, regardless of how the material was obtained.",
      "ja": "POSHサーバーによって提供される資格情報に関係なく、材料が得られたかの、クライアントによって得られた検証材料と一致した場合に委任ドメインにソースドメインからの代表団は安全であると考えることができます。"
    },
    {
      "indent": 0,
      "text": "5. Order of Operations",
      "section_title": true,
      "ja": "オペレーションの順序5."
    },
    {
      "indent": 3,
      "text": "In order for the POSH client to perform verification of reference identifiers without potentially compromising data, POSH operations MUST be complete before any application-layer data is exchanged for the source domain. In cases where the POSH client initiates an application-layer connection, the client SHOULD perform all POSH retrievals before initiating a connection (naturally, this is not possible in cases where the POSH client receives instead of initiates an application-layer connection). For application protocols that use DNS SRV (including queries for TLSA records in concert with SRV records as described in [RFC7673]), the POSH operations ideally ought to be done in parallel with resolving the SRV records and the addresses of any targets, similar to the \"Happy Eyeballs\" approach for IPv4 and IPv6 [RFC6555].",
      "ja": "任意のアプリケーション層データは、ソースドメインのために交換される前に、潜在的にデータを損なうことなく、参照識別子の検証を実行するためのPOSHクライアントのために、POSH操作が完了していなければなりません。 POSHクライアントは、アプリケーション層の接続を開始する場合には、クライアントが接続を開始する前に、すべてのPOSH回収のを実行する必要があり（当然、これはPOSHクライアントが開始するアプリケーション層の接続の代わりに、受信の場合には不可能です）。 （[RFC7673]に記載されているようにSRVレコードとコンサートでTLSAレコードのクエリを含む）のDNS SRVを使用するアプリケーションプロトコルのため、POSHの動作は、理想的には、SRVレコードと任意のターゲットのアドレスを解決と並行して行われるべきと同様IPv4とIPv6 [RFC6555]のための「ハッピー眼球」アプローチ。"
    },
    {
      "indent": 3,
      "text": "The following diagram illustrates the possession flow:",
      "ja": "次の図は、所持の流れを示しています。"
    },
    {
      "indent": 3,
      "text": " POSH                      Source                      POSH\nClient                     Domain                     Server\n------                     ------                     ------\n  |                          |                          |\n  |      POSH Request        |                          |\n  |------------------------->|                          |\n  |                          |                          |\n  | Return POSH fingerprints |                          |\n  |<-------------------------|                          |\n  |                                                     |\n  |                  Service TLS Handshake              |\n  |<===================================================>|\n  |                                                     |\n  |                     Service Data                    |\n  |<===================================================>|\n  |                                                     |",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 1: Order of Events for Possession Flow",
      "ja": "図1：所持フローのためのイベントの順序"
    },
    {
      "indent": 3,
      "text": "While the following diagram illustrates the reference flow:",
      "ja": "次の図は、リファレンス・フローを示しているが。"
    },
    {
      "indent": 3,
      "text": " POSH              Source       Delegated              POSH\nClient             Domain         Domain              Server\n------             ------         ------              ------\n  |                  |              |                   |\n  |  POSH Request    |              |                   |\n  |----------------->|              |                   |\n  |                  |              |                   |\n  | Return POSH url  |              |                   |\n  |<-----------------|              |                   |\n  |                                 |                   |\n  |            POSH Request         |                   |\n  |-------------------------------->|                   |\n  |                                 |                   |\n  |     Return POSH fingerprints    |                   |\n  |<--------------------------------|                   |\n  |                                                     |\n  |                 Service TLS Handshake               |\n  |<===================================================>|\n  |                                                     |\n  |                     Service Data                    |\n  |<===================================================>|\n  |                                                     |",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 2: Order of Events for Reference Flow",
      "ja": "図2：リファレンス・フローのためのイベントの順序"
    },
    {
      "indent": 0,
      "text": "6. Caching Results",
      "section_title": true,
      "ja": "6.キャッシュ結果"
    },
    {
      "indent": 3,
      "text": "The POSH client MUST NOT cache results (reference or fingerprints) indefinitely. If the source domain returns a reference, the POSH client MUST use the lower of the two \"expires\" values when determining how long to cache results (i.e., if the reference \"expires\" value is lower than the fingerprints \"expires\" value, honor the reference \"expires\" value). Once the POSH client considers the results stale, it needs to perform the entire POSH operation again, starting with the HTTPS GET request to the source domain. The POSH client MAY use a lower value than any provided in the \"expires\" member(s), or not cache results at all.",
      "ja": "POSHクライアントが無期限の結果（参照または指紋）をキャッシュしてはなりません。ソースドメインが参照を返した場合、POSHクライアントは、二つの基準値は、指紋が値、名誉を「期限が切れる」よりも低い「期限が切れる」場合は、キャッシュの結果（すなわち、にどのくらいの時間を決定するときの値を「期限が切れる」の下を使用しなければなりません参照）が値「期限が切れます」。 POSHクライアントは結果が古いと考えると、それは元ドメインへのHTTPS GETリクエストで始まる、再び全体POSH操作を実行する必要があります。 POSHクライアントは、任意のメンバー（複数可）、「期限が切れる」、またはすべてではないでキャッシュの結果で提供されるよりも低い値を使用するかもしれません。"
    },
    {
      "indent": 3,
      "text": "The foregoing considerations apply to the handling of the \"expires\" values in POSH documents; naturally, a POSH client MUST NOT consider an expired PKIX certificate to be valid, in accordance with [RFC5280].",
      "ja": "上記の注意事項は、POSH文書内の値を「期限が切れる」の取り扱いに適用されます。当然、POSHクライアントが期限切れのPKIX証明書は、[RFC5280]に従って、有効であると考えてはなりません。"
    },
    {
      "indent": 3,
      "text": "The POSH client SHOULD NOT rely on HTTP caching mechanisms, instead using the expiration hints provided in the POSH reference document or fingerprints document. To that end, the HTTPS servers for source domains and derived domains SHOULD specify a 'Cache-Control' header indicating a very short duration (e.g., max-age=60) or \"no-cache\" to indicate that the response (redirect, reference, or fingerprints) is not appropriate to cache at the HTTP layer.",
      "ja": "POSHクライアントではなく、POSH参考文書や指紋マニュアルに記載されている有効期限のヒントを使用して、HTTPキャッシングメカニズムに依存すべきではありません。そのために、ソースドメインおよび派生ドメインのHTTPSサーバは、応答が（リダイレクトすることを示すために、非常に短い時間を示す「のCache-Control」ヘッダ（例えば、MAX-年齢= 60）または「キャッシュなし」を指定する必要があります参照、または指紋）は、HTTP層でキャッシュすることは適切ではありません。"
    },
    {
      "indent": 0,
      "text": "7. Guidance for Server Operators",
      "section_title": true,
      "ja": "サーバー事業者向け7.ガイダンス"
    },
    {
      "indent": 3,
      "text": "POSH is intended to ease the operational burden of securing application services, especially in multi-tenanted environments. It does so by obviating the need to obtain certificates for hosted domains, so that an operator can obtain a certificate only for its hosting service (naturally, this certificate needs to be valid according to [RFC5280] and contain the proper identifier(s) in accordance with [RFC6125] and the relevant application protocol specification).",
      "ja": "POSHは、特にマルチテナント環境では、アプリケーションサービスを確保する運用負担を軽減することを意図しています。これは、オペレータが唯一のホスティングサービス用の証明書を取得できるように、ホストドメインのための証明書を取得する必要性をなくすことにより、そうする（当然、この証明書は、[RFC5280]に従った有効なものと適切な識別子（S）でを含める必要があります[RFC6125]及び関連するアプリケーションプロトコル仕様）に応じ。"
    },
    {
      "indent": 3,
      "text": "However, in order to use POSH, an operator does need to coordinate with its customers so that the appropriate POSH documents are provided via HTTPS at a well-known URI at each customer's domain (i.e., at the source domain), thus ensuring delegation to the operator's hosting service (i.e., the delegated domain). Because correct hosting of the POSH document at the source domain is essential for successful functioning of the POSH \"chain\", errors at the source domain will result in authentication problems, certificate warnings, and other operational issues.",
      "ja": "適切なPOSH文書は（ソースドメインで、すなわち）各顧客のドメインでよく知られたURIにHTTPSを介して提供されるように、しかし、POSHを使用するためには、オペレータは、このように代表団を確保し、顧客と調整する必要がありませんオペレータのホスティングサービス（すなわち、委任ドメイン）。ソースドメインでPOSH文書の正しいホスティングPOSH「チェーン」の成功に機能するために不可欠であるため、ソースドメインでのエラーは、認証の問題、証明書の警告、およびその他の運用上の問題になります。"
    },
    {
      "indent": 3,
      "text": "Furthermore, if the POSH document is a reference document instead of a fingerprints document, the operational burden is further decreased because the operator does not need to provision its customers with updated POSH documents when the certificate for the delegated domain expires or is replaced.",
      "ja": "POSH文書が代わりに指紋文書の参照文書がある場合は委任ドメインの証明書の有効期限が切れるか、交換されたときに、オペレータが更新さPOSH文書を提供し、顧客を必要としないので、さらに、作業負担がさらに減少しています。"
    },
    {
      "indent": 0,
      "text": "8. Guidance for Protocol Authors",
      "section_title": true,
      "ja": "プロトコル著者8.ガイダンス"
    },
    {
      "indent": 3,
      "text": "Protocols that use POSH are expected to register with the \"POSH Service Names\" registry defined under Section 9.2.",
      "ja": "POSHを使用するプロトコルは、セクション9.2の下に定義された「POSH・サービス名の」レジストリに登録することが期待されています。"
    },
    {
      "indent": 3,
      "text": "For POSH-using protocols that rely on DNS SRV records [RFC2782], the service name SHOULD be the same as the DNS SRV \"Service\". As an example, the POSH service name for XMPP server-to-server connections would be \"xmpp-server\" because [RFC6120] registers a DNS SRV \"Service\" of \"xmpp-server\". One example of the resulting well-known URI would be \"https://example.com/.well-known/posh/xmpp-server.json\".",
      "ja": "DNS SRVレコード[RFC2782]に依存しているPOSH-使用してプロトコルの場合、サービス名は、DNS SRV「サービス」と同じでなければなりません。 [RFC6120]は、「XMPPサーバ」のDNS SRVの「サービス」を登録するための例として、XMPPサーバ間接続のためのPOSHサービス名は「XMPPサーバ」であろう。得られた良く知られたURIの一例は、「https://example.com/.well-known/posh/xmpp-server.json」になります。"
    },
    {
      "indent": 3,
      "text": "For other POSH-using protocols, the service name MAY be any unique string or identifier for the protocol; for example, it might be a service name registered with the IANA in accordance with [RFC6335], or it might be an unregistered name. As an example, the well-known URI for the hypothetical SPICE application might be \"spice\".",
      "ja": "他のPOSH-使用してプロトコルの場合、サービス名は、プロトコルのための任意の一意の文字列または識別子であってもよいです。例えば、[RFC6335]に従ってIANAに登録されたサービス名であるかもしれない、またはそれは、未登録の名前かもしれません。例として、架空のSPICEアプリケーションのためのよく知られたURIは、「スパイス」かもしれません。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "9.1. Well-Known URI",
      "section_title": true,
      "ja": "9.1. よく知られているURI"
    },
    {
      "indent": 3,
      "text": "IANA has registered \"posh\" in the \"Well-Known URIs\" registry as defined by [RFC5785]. The completed template follows.",
      "ja": "[RFC5785]で定義されているIANAは、「既知のURI」レジストリに「POSH」に登録しました。完成したテンプレートは、以下の通りです。"
    },
    {
      "indent": 3,
      "text": "URI suffix: posh",
      "ja": "URIサフィックス：POSH"
    },
    {
      "indent": 3,
      "text": "Change controller: IETF",
      "ja": "変更コントローラ：IETF"
    },
    {
      "indent": 3,
      "text": "Specification: RFC 7711 (this document)",
      "ja": "仕様：RFC 7711（本書）"
    },
    {
      "indent": 3,
      "text": "Related information: The suffix \"posh\" is expected to be followed by an additional path component consisting of a service name (say, \"spice\") and a file extension of \".json\", resulting in a full path of, for instance, \"/.well-known/posh/spice.json\". Registration of service names shall be requested by developers of the relevant application protocols.",
      "ja": "関連情報：サフィックス「POSH」は、例えば、のフルパス、その結果、サービス名からなる追加のパスコンポーネント（たとえば、「スパイス」）および「.json」のファイル拡張子が続くことが予想されます、 \"/.well-known/posh/spice.json\"。サービス名の登録は、関連するアプリケーションプロトコルの開発者によって要求されなければなりません。"
    },
    {
      "indent": 0,
      "text": "9.2. POSH Service Names",
      "section_title": true,
      "ja": "9.2.  POSHサービス名"
    },
    {
      "indent": 3,
      "text": "IANA has established the \"POSH Service Names\" registry within the \"Uniform Resource Identifier (URI) Schemes\" group of registries.",
      "ja": "IANAは、レジストリの「統一資源識別子（URI）スキーム」グループ内の「POSHサービス名」レジストリを確立しています。"
    },
    {
      "indent": 3,
      "text": "The IANA registration policy [RFC5226] is Expert Review or IETF Review (this was chosen instead of the more liberal policy of First Come First Served to help ensure that POSH services are defined in ways that are consistent with this specification). One or more Designated Experts are to be appointed by the IESG or their delegate.",
      "ja": "IANA登録ポリシー[RFC5226]は専門家のレビューやIETFレビューである（これは、選ばれた代わりの初のより自由な政策が最初に来たPOSHのサービスがこの仕様と一致しているかの方法で定義されていることを確実にするために役立ちました）。 1つ以上の指定された専門家はIESGまたはその代理人によって任命されることになります。"
    },
    {
      "indent": 3,
      "text": "Registration requests are to be sent to the posh@ietf.org mailing list for review and comment, with an appropriate subject (e.g., \"Request for POSH service name: example\").",
      "ja": "登録要求は、適切な対象（例えば、「例：POSHサービス名の要求」）と、レビューとコメントのためのposh@ietf.orgメーリングリストに送信されます。"
    },
    {
      "indent": 3,
      "text": "Before a period of 14 days has passed, the Designated Expert(s) will either approve or deny the registration request, communicating this decision both to the review list and to IANA. Denials should include an explanation and, if applicable, suggestions as to how to make the request successful. Registration requests that are undetermined for a period longer than 21 days can be brought to the IESG's attention (using the iesg@iesg.org mailing list) for resolution.",
      "ja": "14日の期間が経過する前に、指定エキスパート（複数可）レビュー一覧にし、IANAに両方この決定を伝える、登録要求を承認または拒否しますか。否定は説明と、該当する場合、要求を成功させる方法についての提案を含める必要があります。 21日よりも長い期間未定されている登録要求は、解決のため（iesg@iesg.orgメーリングリストを使用して）IESGの注意にすることができます。"
    },
    {
      "indent": 0,
      "text": "9.2.1. Registration Template",
      "section_title": true,
      "ja": "9.2.1. 登録テンプレート"
    },
    {
      "indent": 3,
      "text": "Service name: The name requested, relative to \"/.well-known/posh/\"; e.g., a service name of \"example\" would result in a well-known URI such as \"https://example.com/.well-known/posh/example.json\".",
      "ja": "サービス名：「/.well-known/posh/」に対する要求された名前、。例えば、「実施例」のサービス名は、「https://example.com/.well-known/posh/example.json」として周知のURIをもたらすであろう。"
    },
    {
      "indent": 3,
      "text": "Change controller: For Standards Track RFCs, state \"IETF\". In all other cases, provide the name and email address of the responsible party. Other details (e.g., postal address or website URI) may also be included.",
      "ja": "変更コントローラ：標準化過程のRFCは、状態「IETF」。他のすべてのケースでは、責任者の名前とメールアドレスを提供しています。その他の詳細（例えば、住所またはウェブサイトURI）が含まれてもよいです。"
    },
    {
      "indent": 3,
      "text": "Definition and usage: A brief description that defines the service name and mentions where and how it is used (e.g., in the context of a particular application protocol).",
      "ja": "定義および使用：サービス名を定義し、言及簡単な説明ここで、それは（例えば、特定のアプリケーションプロトコルの文脈において）使用される方法。"
    },
    {
      "indent": 3,
      "text": "Specification: Optionally, reference to a document that specifies the service or application protocol that uses the service name, preferably including a URI that can be used to retrieve a copy of the document. An indication of the relevant sections may also be included but is not required.",
      "ja": "仕様：必要に応じて、好ましくは、文書のコピーを取得するために使用することができるURIを含む、サービス名を使用するサービスまたはアプリケーションプロトコルを指定したドキュメントを参照します。関連するセクションの指示が含まれていてもよいが、必須ではありません。"
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "ja": "10.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document supplements but does not supersede the security considerations provided in specifications for application protocols that decide to use POSH (e.g., [RFC6120] and [RFC6125] for XMPP). Specifically, the security of requests and responses sent via HTTPS depends on checking the identity of the HTTP server in accordance with [RFC2818] as well as following the most modern best practices for TLS as specified in [RFC7525]. Additionally, the security of POSH can benefit from other HTTP-hardening protocols, such as HTTP Strict Transport Security (HSTS) [RFC6797] and key pinning [RFC7469], especially if the POSH client shares some information with a common HTTPS implementation (e.g., a platform-default web browser).",
      "ja": "このドキュメントのサプリメントが、POSH（XMPPについて例えば、[RFC6120]と[RFC6125]）を使用することを決定したアプリケーションプロトコルの仕様で提供されるセキュリティ上の考慮事項に優先しません。具体的には、HTTPS経由で送信されたリクエストとレスポンスのセキュリティは、[RFC2818]に従ってHTTPサーバの身元を確認するだけでなく、[RFC7525]で指定されたTLSのための最も近代的なベストプラクティスを以下に依存します。また、POSHのセキュリティは、このような一般的なHTTPSの実装では特にPOSHクライアント共有している場合、HTTP厳格な交通セキュリティ（HSTS）[RFC6797]とキーピニング[RFC7469]、いくつかの情報（例えば、などの他のHTTP硬化プロトコル、恩恵を受けることができますプラットフォームのデフォルトのWebブラウザ）。"
    },
    {
      "indent": 3,
      "text": "Note well that POSH is used by a POSH client to obtain the public key of a POSH server to which it might connect for a particular application protocol such as IMAP or XMPP. POSH does not enable a hosted domain to transfer private keys to a hosting service via HTTPS. POSH also does not enable a POSH server to engage in certificate enrollment with a certification authority via HTTPS, as is done in Enrollment over Secure Transport [RFC7030].",
      "ja": "POSHは、そのようなIMAPやXMPPなどの特定のアプリケーションプロトコルのために接続する可能性にどのPOSHサーバの公開鍵を取得するためにPOSHクライアントによって使用されていることも注意してください。 POSHは、HTTPS経由のホスティングサービスに秘密鍵を転送するためにホストされたドメインを有効にしません。セキュアな交通[RFC7030]の上に登録して行われているようPOSHも、HTTPS経由で認証局で証明書登録に従事するPOSHサーバーを有効にしません。"
    },
    {
      "indent": 3,
      "text": "A web server at the source domain might redirect an HTTPS request to another HTTPS URI. The location provided in the redirect response MUST specify an HTTPS URI. Source domains SHOULD use only temporary redirect mechanisms, such as HTTP status codes 302 (Found) and 307 (Temporary Redirect) [RFC7231]. Clients MAY treat any redirect as",
      "ja": "ソースドメインでWebサーバは別のHTTPS URIに対してHTTPS要求をリダイレクトすることがあります。リダイレクト応答に設けられた位置は、HTTPS URIを指定しなければなりません。ソースドメインは、HTTPステータスコード302（実測値）と307（一時的なリダイレクト）[RFC7231]などの一時的なリダイレクトメカニズムを使用する必要があります。クライアントは、どのようにリダイレクトを扱うかもしれ"
    },
    {
      "indent": 3,
      "text": "temporary, ignoring the specific semantics for 301 (Moved Permanently) [RFC7231] and 308 (Permanent Redirect) [RFC7538]. To protect against circular references, it is RECOMMENDED that POSH clients follow no more than 10 redirects, although applications or implementations can require that fewer redirects be followed.",
      "ja": "（恒久的に移動）[RFC7231]及び308（パーマネントリダイレクト）[RFC7538] 301のための特定のセマンティクスを無視して、一時。循環参照を防ぐために、アプリケーションや実装が少ないリダイレクトが続くことを要求することができますが、POSHのクライアントは、せいぜい10のリダイレクトに従わないことが推奨されます。"
    },
    {
      "indent": 3,
      "text": "Hash function agility is an important quality to ensure secure operations in the face of attacks against the fingerprints obtained within verification material. Because POSH verification material is relatively short-lived compared to long-lived credentials such as PKIX end-entity certificates (at least as typically deployed), entities that deploy POSH are advised to swap out POSH documents if the hash functions are found to be subject to practical attacks [RFC4270].",
      "ja": "ハッシュ関数の俊敏性は検証材料内に取得した指紋に対する攻撃に直面して、安全な運用を確保するための重要な品質です。 POSH検証材料は、PKIXエンドエンティティ証明書等の長寿命クレデンシャル（少なくともとして一般的に展開）、ハッシュ関数は、被写体であることがわかっている場合POSHドキュメントをスワップアウトすることをお勧めしPOSHを展開するエンティティに比べて比較的短命であるため実用的な攻撃[RFC4270]へ。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2818] Rescorla, E., \"HTTP Over TLS\", RFC 2818, DOI 10.17487/RFC2818, May 2000, <http://www.rfc-editor.org/info/rfc2818>.",
      "ja": "[RFC2818]レスコラ、E.、 \"TLSオーバーHTTP\"、RFC 2818、DOI 10.17487 / RFC2818、2000年5月、<http://www.rfc-editor.org/info/rfc2818>。"
    },
    {
      "indent": 3,
      "text": "[RFC4648] Josefsson, S., \"The Base16, Base32, and Base64 Data Encodings\", RFC 4648, DOI 10.17487/RFC4648, October 2006, <http://www.rfc-editor.org/info/rfc4648>.",
      "ja": "[RFC4648] Josefsson氏、S.、 \"Base16、Base32、およびBase64でデータエンコーディング\"、RFC 4648、DOI 10.17487 / RFC4648、2006年10月、<http://www.rfc-editor.org/info/rfc4648>。"
    },
    {
      "indent": 3,
      "text": "[RFC5246] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.2\", RFC 5246, DOI 10.17487/RFC5246, August 2008, <http://www.rfc-editor.org/info/rfc5246>.",
      "ja": "[RFC5246]ダークス、T.およびE.レスコラ、 \"トランスポート層セキュリティ（TLS）プロトコルバージョン1.2\"、RFC 5246、DOI 10.17487 / RFC5246、2008年8月、<http://www.rfc-editor.org/info / RFC5246>。"
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, DOI 10.17487/RFC5280, May 2008, <http://www.rfc-editor.org/info/rfc5280>.",
      "ja": "[RFC5280]クーパー、D.、Santesson、S.、ファレル、S.、Boeyen、S.、Housley氏、R.、およびW.ポーク、「インターネットX.509公開鍵暗号基盤証明書と証明書失効リスト（CRL）のプロフィール」、RFC 5280、DOI 10.17487 / RFC5280、2008年5月、<http://www.rfc-editor.org/info/rfc5280>。"
    },
    {
      "indent": 3,
      "text": "[RFC5785] Nottingham, M. and E. Hammer-Lahav, \"Defining Well-Known Uniform Resource Identifiers (URIs)\", RFC 5785, DOI 10.17487/RFC5785, April 2010, <http://www.rfc-editor.org/info/rfc5785>.",
      "ja": "[RFC5785]ノッティンガム、M.およびE.ハンマーLahav、 \"既知のUniform Resource Identifier（URI）を定義\"、RFC 5785、DOI 10.17487 / RFC5785、2010年4月<http://www.rfc-editor.org /情報/ rfc5785>。"
    },
    {
      "indent": 3,
      "text": "[RFC6125] Saint-Andre, P. and J. Hodges, \"Representation and Verification of Domain-Based Application Service Identity within Internet Public Key Infrastructure Using X.509 (PKIX) Certificates in the Context of Transport Layer Security (TLS)\", RFC 6125, DOI 10.17487/RFC6125, March 2011, <http://www.rfc-editor.org/info/rfc6125>.",
      "ja": "[RFC6125]サンアンドレ、P.およびJ.ホッジス、「表現およびTransport Layer Security（TLS）の文脈でインターネット公開鍵インフラストラクチャの使用X.509内のドメインベースのアプリケーションサービスのアイデンティティの検証（PKIX）証明書」、 RFC 6125、DOI 10.17487 / RFC6125、2011年3月、<http://www.rfc-editor.org/info/rfc6125>。"
    },
    {
      "indent": 3,
      "text": "[RFC7159] Bray, T., Ed., \"The JavaScript Object Notation (JSON) Data Interchange Format\", RFC 7159, DOI 10.17487/RFC7159, March 2014, <http://www.rfc-editor.org/info/rfc7159>.",
      "ja": "[RFC7159]ブレイ、T.、エド。、 \"JavaScriptのObject Notation（JSON）形式のデータ交換フォーマット\"、RFC 7159、DOI 10.17487 / RFC7159、2014年3月、<http://www.rfc-editor.org/info/ rfc7159>。"
    },
    {
      "indent": 3,
      "text": "[RFC7230] Fielding, R., Ed., and J. Reschke, Ed., \"Hypertext Transfer Protocol (HTTP/1.1): Message Syntax and Routing\", RFC 7230, DOI 10.17487/RFC7230, June 2014, <http://www.rfc-editor.org/info/rfc7230>.",
      "ja": "[RFC7230]フィールディング、R.、エド、及びJ. Reschke、編、 \"ハイパーテキスト転送プロトコル（HTTP / 1.1）：メッセージの構文およびルーティング\"。。、RFC 7230、DOI 10.17487 / RFC7230、2014年6月、<HTTP：/ /www.rfc-editor.org/info/rfc7230>。"
    },
    {
      "indent": 3,
      "text": "[RFC7231] Fielding, R., Ed., and J. Reschke, Ed., \"Hypertext Transfer Protocol (HTTP/1.1): Semantics and Content\", RFC 7231, DOI 10.17487/RFC7231, June 2014, <http://www.rfc-editor.org/info/rfc7231>.",
      "ja": "[RFC7231]フィールディング、R.、エド、およびJ. Reschke、エド、 \"ハイパーテキスト転送プロトコル（HTTP / 1.1）：セマンティクスおよびコンテンツ\"。。、RFC 7231、DOI 10.17487 / RFC7231、2014年6月、<のhttp：// www.rfc-editor.org/info/rfc7231>。"
    },
    {
      "indent": 3,
      "text": "[RFC7525] Sheffer, Y., Holz, R., and P. Saint-Andre, \"Recommendations for Secure Use of Transport Layer Security (TLS) and Datagram Transport Layer Security (DTLS)\", BCP 195, RFC 7525, DOI 10.17487/RFC7525, May 2015, <http://www.rfc-editor.org/info/rfc7525>.",
      "ja": "[RFC7525]シェファー、Y.、ホルツ、R.、およびP.サンアンドレ、 \"トランスポート層セキュリティ（TLS）およびデータグラムトランスポート層セキュリティ（DTLS）のセキュアな利用のための提言\"、BCP 195、RFC 7525、DOI 10.17487 / RFC7525、2015年5月、<http://www.rfc-editor.org/info/rfc7525>。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[HASH-NAMES] \"Hash Function Textual Names\", <http://www.iana.org/assignments/ hash-function-text-names>.",
      "ja": "[HASH-NAMES] \"ハッシュ関数テキスト名\"、<http://www.iana.org/assignments/ハッシュ関数のテキスト名>。"
    },
    {
      "indent": 3,
      "text": "[RFC2782] Gulbrandsen, A., Vixie, P., and L. Esibov, \"A DNS RR for specifying the location of services (DNS SRV)\", RFC 2782, DOI 10.17487/RFC2782, February 2000, <http://www.rfc-editor.org/info/rfc2782>.",
      "ja": "[RFC2782] Gulbrandsenの、A.、いるVixie、P.、およびL. Esibov、 \"サービスの場所を特定するためのDNS RR（DNSのSRV）\"、RFC 2782、DOI 10.17487 / RFC2782、2000年2月、<HTTP：// www.rfc-editor.org/info/rfc2782>。"
    },
    {
      "indent": 3,
      "text": "[RFC4033] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"DNS Security Introduction and Requirements\", RFC 4033, DOI 10.17487/RFC4033, March 2005, <http://www.rfc-editor.org/info/rfc4033>.",
      "ja": "[RFC4033]アレンズ、R.、Austeinと、R.、ラーソン、M.、マッシー、D.、およびS.ローズ、 \"DNSセキュリティ序論と要件\"、RFC 4033、DOI 10.17487 / RFC4033、2005年3月、<のhttp： //www.rfc-editor.org/info/rfc4033>。"
    },
    {
      "indent": 3,
      "text": "[RFC4270] Hoffman, P. and B. Schneier, \"Attacks on Cryptographic Hashes in Internet Protocols\", RFC 4270, DOI 10.17487/RFC4270, November 2005, <http://www.rfc-editor.org/info/rfc4270>.",
      "ja": "[RFC4270]ホフマン、P.とB.シュナイアー、 \"インターネットプロトコルで暗号化ハッシュに対する攻撃\"、RFC 4270、DOI 10.17487 / RFC4270、2005年11月、<http://www.rfc-editor.org/info/rfc4270> 。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, DOI 10.17487/RFC5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、DOI 10.17487 / RFC5226、2008年5月、<http://www.rfc-editor.org /情報/ RFC5226>。"
    },
    {
      "indent": 3,
      "text": "[RFC6120] Saint-Andre, P., \"Extensible Messaging and Presence Protocol (XMPP): Core\", RFC 6120, DOI 10.17487/RFC6120, March 2011, <http://www.rfc-editor.org/info/rfc6120>.",
      "ja": "[RFC6120]サンアンドレ、P.、 \"拡張メッセージングおよびプレゼンスプロトコル（XMPP）：コア\"、RFC 6120、DOI 10.17487 / RFC6120、2011年3月、<http://www.rfc-editor.org/info/rfc6120 >。"
    },
    {
      "indent": 3,
      "text": "[RFC6335] Cotton, M., Eggert, L., Touch, J., Westerlund, M., and S. Cheshire, \"Internet Assigned Numbers Authority (IANA) Procedures for the Management of the Service Name and Transport Protocol Port Number Registry\", BCP 165, RFC 6335, DOI 10.17487/RFC6335, August 2011, <http://www.rfc-editor.org/info/rfc6335>.",
      "ja": "[RFC6335]コットン、M.、エッゲルト、L.、タッチ、J.、ウェスター、M.、およびS.チェシャー、「IANA（Internet Assigned Numbers Authority）のサービス名とトランスポートプロトコルポート番号レジストリの管理のための手順」、BCP 165、RFC 6335、DOI 10.17487 / RFC6335、2011年8月、<http://www.rfc-editor.org/info/rfc6335>。"
    },
    {
      "indent": 3,
      "text": "[RFC6555] Wing, D. and A. Yourtchenko, \"Happy Eyeballs: Success with Dual-Stack Hosts\", RFC 6555, DOI 10.17487/RFC6555, April 2012, <http://www.rfc-editor.org/info/rfc6555>.",
      "ja": "[RFC6555]ウイング、D.とA. Yourtchenko、 \"ハッピー眼球：デュアルスタックホストと成功\"、RFC 6555、DOI 10.17487 / RFC6555、2012年4月、<http://www.rfc-editor.org/info/ rfc6555>。"
    },
    {
      "indent": 3,
      "text": "[RFC6698] Hoffman, P. and J. Schlyter, \"The DNS-Based Authentication of Named Entities (DANE) Transport Layer Security (TLS) Protocol: TLSA\", RFC 6698, DOI 10.17487/RFC6698, August 2012, <http://www.rfc-editor.org/info/rfc6698>.",
      "ja": "[RFC6698]ホフマン、P.およびJ. Schlyter、 \"名前付きエンティティ（DANE）トランスポート層セキュリティ（TLS）プロトコルのDNSベースの認証：TLSA\"、RFC 6698、DOI 10.17487 / RFC6698、2012年8月、<のhttp：/ /www.rfc-editor.org/info/rfc6698>。"
    },
    {
      "indent": 3,
      "text": "[RFC6797] Hodges, J., Jackson, C., and A. Barth, \"HTTP Strict Transport Security (HSTS)\", RFC 6797, DOI 10.17487/RFC6797, November 2012, <http://www.rfc-editor.org/info/rfc6797>.",
      "ja": "[RFC6797]ホッジス、J.、ジャクソン、C.、およびA.バース、 \"HTTP厳格なトランスポート・セキュリティ（HSTS）\"、RFC 6797、DOI 10.17487 / RFC6797、2012年11月、<のhttp：//www.rfc-editor。組織/情報/ rfc6797>。"
    },
    {
      "indent": 3,
      "text": "[RFC7030] Pritikin, M., Ed., Yee, P., Ed., and D. Harkins, Ed., \"Enrollment over Secure Transport\", RFC 7030, DOI 10.17487/RFC7030, October 2013, <http://www.rfc-editor.org/info/rfc7030>.",
      "ja": "[RFC7030] Pritikin、M.、エド、イー、P.、エド、およびD.ハーキンズ、エド、 \"セキュアなトランスポート上で登録\"、RFC 7030、DOI 10.17487 / RFC7030、2013年10月、<のhttp：。。。// www.rfc-editor.org/info/rfc7030>。"
    },
    {
      "indent": 3,
      "text": "[RFC7469] Evans, C., Palmer, C., and R. Sleevi, \"Public Key Pinning Extension for HTTP\", RFC 7469, DOI 10.17487/RFC7469, April 2015, <http://www.rfc-editor.org/info/rfc7469>.",
      "ja": "[RFC7469]エバンス、C.、パーマー、C.、およびR. Sleevi、 \"HTTPのための公開鍵ピンニング拡張\"、RFC 7469、DOI 10.17487 / RFC7469、2015年4月、<http://www.rfc-editor.org /情報/ rfc7469>。"
    },
    {
      "indent": 3,
      "text": "[RFC7538] Reschke, J., \"The Hypertext Transfer Protocol Status Code 308 (Permanent Redirect)\", RFC 7538, DOI 10.17487/RFC7538, April 2015, <http://www.rfc-editor.org/info/rfc7538>.",
      "ja": "[RFC7538] Reschke、J.、 \"ハイパーテキスト転送プロトコルステータスコード308（パーマネントリダイレクト）\"、RFC 7538、DOI 10.17487 / RFC7538、2015年4月、<http://www.rfc-editor.org/info/rfc7538> 。"
    },
    {
      "indent": 3,
      "text": "[RFC7673] Finch, T., Miller, M., and P. Saint-Andre, \"Using DNS-Based Authentication of Named Entities (DANE) TLSA Records with SRV Records\", RFC 7673, DOI 10.17487/RFC7673, October 2015, <http://www.rfc-editor.org/info/rfc7673>.",
      "ja": "[RFC7673]フィンチ、T.、ミラー、M.、およびP.サンアンドレ、RFC 7673 \"名前付きエンティティSRVレコードを持つ（DANE）TLSAレコードのDNSベースの認証を使用\"、DOI 10.17487 / RFC7673、2015年10月、 <http://www.rfc-editor.org/info/rfc7673>。"
    },
    {
      "indent": 3,
      "text": "[RFC7712] Saint-Andre, P., Miller, M., and P. Hancke, \"Domain Name Associations (DNA) in the Extensible Messaging and Presence Protocol (XMPP)\", RFC 7712, DOI 10.17487/RFC7712, November 2015, <http://www.rfc-editor.org/info/rfc7712>.",
      "ja": "[RFC7712]サンアンドレ、P.、ミラー、M.、およびP. Hancke、 \"拡張メッセージングおよびプレゼンスプロトコル（XMPP）でドメイン名協会（DNA）\"、RFC 7712、DOI 10.17487 / RFC7712、2015年11月、 <http://www.rfc-editor.org/info/rfc7712>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Thijs Alkemade, Philipp Hancke, Joe Hildebrand, and Tobias Markmann for their implementation feedback, and to Dave Cridland, Chris Newton, Max Pritikin, and Joe Salowey for their input on the specification.",
      "ja": "仕様上の彼らの入力のための彼らの実装のフィードバックのためのタイスAlkemade、フィリップHancke、ジョー・ヒルデブラント、およびトビアスMarkmannのおかげで、とDave Cridland、クリス・ニュートン、マックスPritikin、とジョーSaloweyへ。"
    },
    {
      "indent": 3,
      "text": "During IESG review, Stephen Farrell, Barry Leiba, and Kathleen Moriarty provided helpful input that resulted in improvements in the document.",
      "ja": "IESGレビューの間、ステファン・ファレル、バリー・レイバ、とキャスリーン・モリアーティは、文書の改善をもたらし役立つ入力を提供します。"
    },
    {
      "indent": 3,
      "text": "Thanks also to Dave Cridland as document shepherd, Joe Hildebrand as working group chair, and Ben Campbell as area director.",
      "ja": "おかげでも地域ディレクターとしてワーキンググループの議長として、文書の羊飼いとしてデイブCridland、ジョー・ヒルデブラント、およびベン・キャンベルへ。"
    },
    {
      "indent": 3,
      "text": "Peter Saint-Andre wishes to acknowledge Cisco Systems, Inc., for employing him during his work on earlier draft versions of this document.",
      "ja": "ピーターサンアンドレはこのドキュメントの以前のドラフトバージョンの彼の仕事中に彼を採用するため、シスコシステムズ、株式会社を確認したいです。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Matthew Miller Cisco Systems, Inc. 1899 Wynkoop Street, Suite 600 Denver, CO 80202 United States",
      "ja": "マシュー・ミラーシスコシステムズ株式会社1899 Wynkoopストリート、スイート600デンバー、CO 80202米国"
    },
    {
      "indent": 3,
      "text": "Email: mamille2@cisco.com",
      "ja": "メール：mamille2@cisco.com"
    },
    {
      "indent": 3,
      "text": "Peter Saint-Andre &yet",
      "ja": "まだピーターサンアンドレ＆"
    },
    {
      "indent": 3,
      "text": "Email: peter@andyet.com URI: https://andyet.com/",
      "ja": "メール：peter@andyet.com URI：https://andyet.com/"
    }
  ]
}