{
  "title": {
    "text": "RFC 7954 - Locator/ID Separation Protocol (LISP) Endpoint Identifier (EID) Block",
    "ja": "RFC 7954 - ロケータ/ ID分離プロトコル（LISP）エンドポイント識別子（EID）ブロック"
  },
  "number": 7954,
  "created_at": "2020-08-29 10:33:56.984507+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        L. Iannone\nRequest for Comments: 7954                             Telecom ParisTech\nCategory: Experimental                                          D. Lewis\nISSN: 2070-1721                                      Cisco Systems, Inc.\n                                                                D. Meyer\n                                                                 Brocade\n                                                               V. Fuller\n                                                          September 2016",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 1,
      "text": "Locator/ID Separation Protocol (LISP) Endpoint Identifier (EID) Block",
      "ja": "ロケータ/ ID分離プロトコル（LISP）エンドポイント識別子（EID）ブロック"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document directs IANA to allocate a /32 IPv6 prefix for use with the Locator/ID Separation Protocol (LISP). The prefix will be used for local intra-domain routing and global endpoint identification, by sites deploying LISP as Endpoint Identifier (EID) addressing space.",
      "ja": "このドキュメントは、ロケーター/ ID分離プロトコル（LISP）で使用する/ 32 IPv6プレフィックスを割り当てるようにIANAに指示します。プレフィックスは、LISPをエンドポイント識別子（EID）アドレス空間として展開するサイトによって、ローカルドメイン内ルーティングとグローバルエンドポイント識別に使用されます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。試験、実験、評価のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントでは、インターネットコミュニティの実験プロトコルを定義します。このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。 IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補になるわけではありません。 RFC 7841のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7954.",
      "ja": "このドキュメントの現在のステータス、正誤表、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7954で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2016 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象であり、この文書の発行日に有効です。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Definition of Terms . . . . . . . . . . . . . . . . . . . . .   3\n3.  Rationale and Intent  . . . . . . . . . . . . . . . . . . . .   3\n4.  Expected Use  . . . . . . . . . . . . . . . . . . . . . . . .   5\n5.  Block Dimension . . . . . . . . . . . . . . . . . . . . . . .   5\n6.  3+3 Allocation Plan . . . . . . . . . . . . . . . . . . . . .   6\n7.  Allocation Lifetime . . . . . . . . . . . . . . . . . . . . .   7\n8.  Routing Considerations  . . . . . . . . . . . . . . . . . . .   7\n9.  Security Considerations . . . . . . . . . . . . . . . . . . .   8\n10. IANA Considerations . . . . . . . . . . . . . . . . . . . . .   8\n11. References  . . . . . . . . . . . . . . . . . . . . . . . . .   9\n  11.1.  Normative References . . . . . . . . . . . . . . . . . .   9\n  11.2.  Informative References . . . . . . . . . . . . . . . . .  10\nAcknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .  11\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  12",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document directs the IANA to allocate a /32 IPv6 prefix for use with the Locator/ID Separation Protocol (LISP [RFC6830]), LISP Map-Server ([RFC6833]), LISP Alternative Topology (LISP+ALT [RFC6836]) (or other) mapping systems, and LISP Interworking ([RFC6832]).",
      "ja": "このドキュメントは、ロケータ/ ID分離プロトコル（LISP [RFC6830]）、LISP Map-Server（[RFC6833]）、LISP代替トポロジ（LISP + ALT [RFC6836]）で使用する/ 32 IPv6プレフィックスを割り当てるようにIANAに指示しますまたはその他）マッピングシステム、およびLISPインターワーキング（[RFC6832]）。"
    },
    {
      "indent": 3,
      "text": "This block will be used as global Endpoint Identifier (EID) space.",
      "ja": "このブロックは、グローバルエンドポイント識別子（EID）スペースとして使用されます。"
    },
    {
      "indent": 0,
      "text": "2. Definition of Terms",
      "section_title": true,
      "ja": "2. 用語の定義"
    },
    {
      "indent": 3,
      "text": "The present document does not introduce any new terms with respect to the set of LISP Specifications ([RFC6830], [RFC6831], [RFC6832], [RFC6833], [RFC6834], [RFC6835], [RFC6836], [RFC6837]), but it assumes that the reader is familiar with the LISP terminology. [LISP-INTRO] provides an introduction to the LISP technology, including its terminology.",
      "ja": "このドキュメントでは、LISP仕様のセット（[RFC6830]、[RFC6831]、[RFC6832]、[RFC6833]、[RFC6834]、[RFC6835]、[RFC6836]、[RFC6837]）に関する新しい用語を紹介していません。ただし、読者がLISPの用語に精通していることを前提としています。 [LISP-INTRO]は、LISPテクノロジーの概要を、その用語を含めて提供します。"
    },
    {
      "indent": 0,
      "text": "3. Rationale and Intent",
      "section_title": true,
      "ja": "3. 根拠と意図"
    },
    {
      "indent": 3,
      "text": "Discussion within the LISP working group led to the identification of several scenarios in which the existence of a LISP-specific address block brings technical benefits. The most relevant scenarios are described below:",
      "ja": "LISPワーキンググループ内での議論により、LISP固有のアドレスブロックの存在が技術的なメリットをもたらすいくつかのシナリオが特定されました。最も関連するシナリオを以下に説明します。"
    },
    {
      "indent": 3,
      "text": "Early LISP destination detection: With the current specifications, there is no direct way to detect whether or not a certain destination is in a LISP domain without performing a LISP mapping lookup. For instance, if an Ingress Tunnel Router (ITR) is sending packets to all types of destinations (i.e., non-LISP destinations, LISP destinations not in the IPv6 EID block, and LISP destinations in the IPv6 EID block), the only way to understand whether or not to encapsulate the traffic is to perform a cache lookup and, in case of a LISP cache miss, send a Map-Request to the mapping system. In the meanwhile (while waiting for the Map-Reply), packets may be dropped to avoid excessive buffering.",
      "ja": "初期のLISP宛先検出：現在の仕様では、LISPマッピングルックアップを実行せずに、特定の宛先がLISPドメインにあるかどうかを直接検出する方法はありません。たとえば、Ingress Tunnel Router（ITR）がすべてのタイプの宛先（つまり、LISP以外の宛先、IPv6 EIDブロックにないLISP宛先、IPv6 EIDブロックにあるLISP宛先）にパケットを送信している場合、唯一の方法はトラフィックをカプセル化するかどうかはキャッシュルックアップを実行するかどうかを理解し、LISPキャッシュミスの場合はMap-Requestをマッピングシステムに送信します。その間（Map-Replyを待機している間）、過度のバッファリングを回避するためにパケットがドロップされることがあります。"
    },
    {
      "indent": 3,
      "text": "Avoid penalizing non-LISP traffic: In certain circumstances, it might be desirable to configure a router using LISP features to natively forward all packets that do not have a destination address in the block and, hence, no lookup whatsoever is performed and packets destined to non-LISP sites are not penalized in any manner.",
      "ja": "非LISPトラフィックへのペナルティの回避：特定の状況では、LISP機能を使用してルーターを構成し、ブロック内に宛先アドレスを持たないすべてのパケットをネイティブに転送することが望ましいため、実行されるルックアップは一切行われず、パケットは宛先に送信されません非LISPサイトは、いかなる方法でもペナルティを課されません。"
    },
    {
      "indent": 3,
      "text": "Traffic Engineering: In some deployment scenarios, it might be desirable to apply different traffic-engineering policies for LISP and non-LISP traffic. A LISP-specific EID block would allow improved traffic-engineering capabilities with respect to LISP vs. non-LISP traffic. In particular, LISP traffic might be identified without having to use Deep Packet Inspection (DPI) techniques in order to parse the encapsulated packet. Instead, performing a simple inspection of the outer header is sufficient.",
      "ja": "トラフィックエンジニアリング：一部の導入シナリオでは、LISPトラフィックと非LISPトラフィックに異なるトラフィックエンジニアリングポリシーを適用することが望ましい場合があります。 LISP固有のEIDブロックにより、LISPトラフィックと非LISPトラフィックのトラフィックエンジニアリング機能を改善できます。特に、LISPトラフィックは、カプセル化されたパケットを解析するためにディープパケットインスペクション（DPI）技術を使用する必要なく識別される場合があります。代わりに、外側のヘッダーを簡単に検査するだけで十分です。"
    },
    {
      "indent": 3,
      "text": "Transition Mechanism: The existence of a LISP-specific EID block may prove useful in transition scenarios. A non-LISP domain would ask for an allocation in the LISP EID block and use it to deploy LISP in its network. Such allocation would not be announced in the BGP routing infrastructure (cf. Section 4). This approach will allow non-LISP domains to avoid fragmenting their already allocated non-LISP addressing space, which may lead to BGP routing table inflation since it may (rightfully) be announced in the BGP routing infrastructure.",
      "ja": "移行メカニズム：LISP固有のEIDブロックの存在は、移行シナリオで役立つ場合があります。非LISPドメインは、LISP EIDブロックでの割り当てを要求し、それを使用してLISPをネットワークに展開します。このような割り当ては、BGPルーティングインフラストラクチャでは通知されません（セクション4を参照）。このアプローチにより、非LISPドメインは、すでに割り当てられている非LISPアドレス空間の断片化を回避できます。これは、BGPルーティングインフラストラクチャで（正しく）アナウンスされるため、BGPルーティングテーブルのインフレーションにつながる可能性があります。"
    },
    {
      "indent": 3,
      "text": "Limit the impact on the BGP routing infrastructure: As described in the previous scenario, LISP adopters will avoid fragmenting their addressing space, since fragmentation would negatively impact the BGP routing infrastructure. Adopters will use addressing space from the EID block, which might be announced in large aggregates and in a tightly controlled manner only by Proxy Tunnel Routers (PxTRs).",
      "ja": "BGPルーティングインフラストラクチャへの影響を制限する：前のシナリオで説明したように、断片化はBGPルーティングインフラストラクチャに悪影響を与えるため、LISP採用者はアドレス空間の断片化を回避します。採用者は、EIDブロックのアドレス空間を使用します。これは、大規模な集合体で、厳密に制御された方法で、プロキシトンネルルーター（PxTR）によってのみ通知される可能性があります。"
    },
    {
      "indent": 3,
      "text": "It is worth mentioning that new use cases may arise in the future, due to new and unforeseen scenarios.",
      "ja": "新しい予期しないシナリオが原因で、将来的に新しいユースケースが発生する可能性があることに言及する価値があります。"
    },
    {
      "indent": 3,
      "text": "Furthermore, the use of a dedicated address block allows for tighter control over the traffic in the initial experimental phase (especially filtering), while facilitating its large-scale deployment.",
      "ja": "さらに、専用アドレスブロックを使用すると、大規模な展開を容易にしながら、初期の実験段階（特にフィルタリング）でトラフィックをより厳密に制御できます。"
    },
    {
      "indent": 3,
      "text": "[RFC3692] considers assigning experimental and testing numbers useful; having a reserved IPv6 prefix enables this practice. The present document follows the guidelines provided in [RFC3692], with one exception. [RFC3692] suggests the use of values similar to those called \"Private Use\" in [RFC5226], which by definition are not unique. One purpose of the present request to IANA is to guarantee uniqueness to the EID block. The lack thereof would result in a lack of real utility of a reserved IPv6 prefix.",
      "ja": "[RFC3692]は、実験番号とテスト番号を割り当てることを検討しています。予約済みのIPv6プレフィックスがあると、この方法が可能になります。本文書は、1つの例外を除いて、[RFC3692]で提供されるガイドラインに従います。 [RFC3692]は、[RFC5226]で「Private Use」と呼ばれているものと同様の値の使用を提案していますが、定義上は一意ではありません。 IANAに対する現在の要求の1つの目的は、EIDブロックの一意性を保証することです。その欠如は、予約されたIPv6接頭辞の実際の有用性の欠如をもたらします。"
    },
    {
      "indent": 0,
      "text": "4. Expected Use",
      "section_title": true,
      "ja": "4. 期待される用途"
    },
    {
      "indent": 3,
      "text": "Sites planning to deploy LISP may request a prefix in the IPv6 EID block. Such prefixes will be used for routing and endpoint identification inside the site requesting it. Mappings related to such a prefix, or part of it, will be made available through the mapping system in use and registered to one or more Map-Server(s).",
      "ja": "LISPの導入を計画しているサイトは、IPv6 EIDブロックのプレフィックスを要求する場合があります。そのようなプレフィックスは、それを要求するサイト内のルーティングとエンドポイントの識別に使用されます。このようなプレフィックスまたはその一部に関連するマッピングは、使用中のマッピングシステムを通じて利用可能になり、1つ以上のMap-Serverに登録されます。"
    },
    {
      "indent": 3,
      "text": "The EID block must be used for LISP experimentation and must not be advertised in the form of more specific route advertisements in the non-LISP inter-domain routing environment. Interworking between the EID block sub-prefixes and the non-LISP Internet is done according to the techniques described in [RFC6832] and [RFC7215].",
      "ja": "EIDブロックはLISP実験に使用する必要があり、非LISPドメイン間ルーティング環境では、より具体的なルートアドバタイズメントの形式でアドバタイズしないでください。 EIDブロックサブプレフィックスと非LISPインターネット間のインターワーキングは、[RFC6832]および[RFC7215]で説明されている手法に従って行われます。"
    },
    {
      "indent": 3,
      "text": "As the LISP adoption progresses, the EID block may potentially have a reduced impact on the BGP routing infrastructure, compared to the case of having the same number of adopters using global unicast space allocated by Regional Internet Registries (RIRs) ([MobiArch2007]). From a short-term perspective, the EID block offers potentially large aggregation capabilities since it is announced by Proxy Tunnel Routers (PxTRs), possibly concentrating several contiguous prefixes. This trend should continue with even lower impact from a long-term perspective, because more aggressive aggregation can be used, potentially leading to using fewer PxTRs announcing the whole EID block ([FIABook2010]).",
      "ja": "LISPの採用が進むにつれて、地域インターネットレジストリ（RIR）（[MobiArch2007]）によって割り当てられたグローバルユニキャストスペースを使用する同数の採用者がいる場合と比較して、EIDブロックはBGPルーティングインフラストラクチャへの影響が小さくなる可能性があります。短期的な観点から見ると、EIDブロックはプロキシトンネルルーター（PxTR）によってアナウンスされるため、潜在的に大きな集約機能を提供し、複数の隣接するプレフィックスを集中させる可能性があります。より積極的な集約を使用でき、EIDブロック全体を通知するPxTRの数が少なくなる可能性があるので、この傾向は長期的な観点からさらに低い影響で継続するはずです（[FIABook2010]）。"
    },
    {
      "indent": 3,
      "text": "The EID block will be used only at the configuration level, so it is recommended not to hard-code the IPv6 EID block in the router hardware in any way. This prevents locking out sites that may want to switch to LISP while keeping their own IPv6 prefix, which is not in the IPv6 EID block. Furthermore, in the case of a future permanent allocation, the allocated prefix may differ from the experimental temporary prefix allocated during the experimentation phase.",
      "ja": "EIDブロックは構成レベルでのみ使用されるため、ルーターハードウェアでIPv6 EIDブロックをハードコードしないでください。これにより、IPv6 EIDブロックにない独自のIPv6プレフィックスを維持しながら、LISPに切り替えたいサイトがロックアウトされるのを防ぐことができます。さらに、将来の永続的な割り当ての場合、割り当てられたプレフィックスは、実験フェーズ中に割り当てられた実験的な一時プレフィックスとは異なる場合があります。"
    },
    {
      "indent": 3,
      "text": "With the exception of the Proxy Ingress Tunnel Router (PITR) case (described in Section 8), prefixes out of the EID block must not be announced in the BGP routing infrastructure.",
      "ja": "プロキシ入力トンネルルーター（PITR）のケース（セクション8で説明）を除いて、EIDブロック外のプレフィックスはBGPルーティングインフラストラクチャでアナウンスされてはなりません。"
    },
    {
      "indent": 0,
      "text": "5. Block Dimension",
      "section_title": true,
      "ja": "5. ブロック寸法"
    },
    {
      "indent": 3,
      "text": "The working group reached consensus on an initial allocation of a /32 prefix. The reason of such consensus is manifold:",
      "ja": "ワーキンググループは、/ 32プレフィックスの初期割り当てについてコンセンサスに達しました。そのようなコンセンサスの理由は多様です："
    },
    {
      "indent": 3,
      "text": "o The working group agreed that the /32 prefix is sufficiently large to cover initial allocation and requests for prefixes in the EID space in the next few years for very large-scale experimentation and deployment.",
      "ja": "o ワーキンググループは、/ 32プレフィックスが非常に大規模な実験と展開のための今後数年間のEIDスペースでのプレフィックスの初期割り当てと要求をカバーするのに十分な大きさであることに同意しました。"
    },
    {
      "indent": 3,
      "text": "o As a comparison, it is worth mentioning that the current LISP Beta Network ([BETA]) is using a /32 prefix, with more than 250 sites using a /48 sub-prefix. Hence, a /32 prefix appears sufficiently large to allow the current deployment to scale up and be open for interoperation with independent deployments using the EIDs in the new /32 prefix.",
      "ja": "o 比較として、現在のLISPベータネットワーク（[ベータ版]）が/ 32プレフィックスを使用しており、250以上のサイトが/ 48サブプレフィックスを使用していることを言及する価値があります。したがって、/ 32プレフィックスは、現在のデプロイメントをスケールアップして、新しい/ 32プレフィックスのEIDを使用する独立したデプロイメントとの相互運用のために開くのに十分な大きさで表示されます。"
    },
    {
      "indent": 3,
      "text": "o A /32 prefix is sufficiently large to allow deployment of independent (commercial) LISP-enabled networks by third parties, but may as well boost LISP experimentation and deployment.",
      "ja": "o / 32プレフィックスは、サードパーティによる独立した（商用）LISP対応ネットワークの導入を可能にするのに十分な大きさですが、LISPの実験と導入を促進することもできます。"
    },
    {
      "indent": 3,
      "text": "o The use of a /32 prefix is in line with previous similar prefix allocation for tunneling protocols ([RFC3056]).",
      "ja": "o / 32プレフィックスの使用は、トンネリングプロトコル（[RFC3056]）に対する以前の同様のプレフィックス割り当てと一致しています。"
    },
    {
      "indent": 0,
      "text": "6. 3+3 Allocation Plan",
      "section_title": true,
      "ja": "6. 3 + 3配分計画"
    },
    {
      "indent": 3,
      "text": "Per this document, IANA has initially assigned a /32 prefix out of the IPv6 addressing space for use as EID in LISP.",
      "ja": "このドキュメントによると、IANAはLISPのEIDとして使用するために、IPv6アドレス空間から/ 32プレフィックスを最初に割り当てました。"
    },
    {
      "indent": 3,
      "text": "IANA allocated the requested address space in September 2016 for a duration of 3 (three) years (through September 2019), with an option to extend this period by 3 (three) more years (until September 2022). By the end of the first period, the IETF will provide a decision on whether to transform the prefix into a permanent assignment or to put it back in the free pool (see Section 7 for more information).",
      "ja": "IANAは、要求されたアドレススペースを2016年9月に3年間（2019年9月まで）割り当てましたが、この期間をさらに3年間（2022年9月まで）延長することもできます。最初の期間の終わりまでに、IETFは、プレフィックスを永続的な割り当てに変換するか、それをフリープールに戻すかを決定します（詳細については、セクション7を参照してください）。"
    },
    {
      "indent": 3,
      "text": "In the first case, i.e., if the IETF decides to transform the block into a permanent allocation, the EID block allocation period will be extended for three years (until September 2022) to give the IETF time to define the final size of the EID block and create a transition plan. The transition of the EID block into a permanent allocation might pose policy issues (as recognized in [RFC2860], Section 4.3); therefore, discussion with the IANA, the RIR communities, and the IETF community will be necessary to determine the appropriate policy for permanent EID-block allocation and management. Note as well that the final permanent allocation may differ from the initial experimental assignment; hence, it is recommended not to hard-code the experimental EID block on LISP-capable devices in any way.",
      "ja": "最初のケース、つまりIETFがブロックを永続的な割り当てに変換することを決定した場合、EIDブロックの割り当て期間は3年間（2022年9月まで）延長され、IETFがEIDブロックの最終サイズを定義する時間を確保します。移行計画を作成します。 EIDブロックを永続的な割り当てに移行すると、ポリシーの問題が発生する可能性があります（[RFC2860]、セクション4.3で認識）。したがって、永続的なEIDブロックの割り当てと管理のための適切なポリシーを決定するには、IANA、RIRコミュニティ、およびIETFコミュニティとの協議が必要になります。また、最終的な永続的な割り当ては、最初の実験的な割り当てとは異なる場合があることに注意してください。したがって、LISP対応デバイスで試験的なEIDブロックをハードコードしないでください。"
    },
    {
      "indent": 3,
      "text": "In the latter case, i.e., if the IETF decides to terminate the experimental-use EID block, all temporary prefix allocations in this address range must expire and be released by September 2019, so that the entire /32 is returned to the free pool.",
      "ja": "後者の場合、つまり、IETFが実験用EIDブロックを終了することを決定した場合、このアドレス範囲のすべての一時的なプレフィックス割り当ては期限切れになり、2019年9月までに解放されるため、/ 32全体が空きプールに返されます。"
    },
    {
      "indent": 3,
      "text": "The allocation and management of the EID block for the initial 3-year period (and the optional 3 more years) is detailed in [RFC7955].",
      "ja": "最初の3年間（およびオプションでさらに3年間）のEIDブロックの割り当てと管理については、[RFC7955]で詳しく説明しています。"
    },
    {
      "indent": 0,
      "text": "7. Allocation Lifetime",
      "section_title": true,
      "ja": "7. 割り当てライフタイム"
    },
    {
      "indent": 3,
      "text": "If no explicit action is carried out by the end of the experiment (by September 2019), it is automatically considered that there was not sufficient interest in having a permanent allocation; therefore, the address block will be returned to the free pool.",
      "ja": "実験の終わり（2019年9月まで）までに明示的なアクションが実行されない場合、永続的な割り当てに十分な関心がなかったと自動的に見なされます。したがって、アドレスブロックはフリープールに返されます。"
    },
    {
      "indent": 3,
      "text": "Otherwise, if the LISP working group recognizes that there is value in having a permanent allocation, then explicit action is needed.",
      "ja": "それ以外の場合、LISPワーキンググループが永続的な割り当てに価値があることを認識すると、明示的なアクションが必要になります。"
    },
    {
      "indent": 3,
      "text": "In order to trigger the process for a permanent allocation, a document is required. Such a document has to articulate the rationale for why a permanent allocation would be beneficial. More specifically, the document has to detail the experience gained during experimentation and all of the technical benefits provided by the use of a LISP-specific prefix. Such technical benefits are expected to lay in the scenarios described in Section 3. However, new and unforeseen benefits may appear during experimentation. The description should be sufficiently articulate that the needed size of the permanent allocation can be estimated. However, note that, as explained in Section 6, it is up to IANA to decide which address block will be used as a permanent allocation and that such a block may be different from the temporary experimental allocation.",
      "ja": "永続的な割り当てのプロセスをトリガーするには、ドキュメントが必要です。そのような文書は、恒久的な割り当てが有益である理由の根拠を明確にする必要があります。具体的には、このドキュメントでは、実験中に得られた経験と、LISP固有のプレフィックスを使用することで得られるすべての技術的な利点について詳しく説明する必要があります。このような技術的なメリットは、セクション3で説明するシナリオで発生すると予想されます。ただし、実験中に新しい予期しないメリットが現れる可能性があります。説明は、永続的な割り当てに必要なサイズを見積もることができるように十分に明確にする必要があります。ただし、セクション6で説明したように、永続的な割り当てとして使用するアドレスブロックを決定するのはIANAの責任であり、そのようなブロックは一時的な実験的割り当てとは異なる場合があることに注意してください。"
    },
    {
      "indent": 0,
      "text": "8. Routing Considerations",
      "section_title": true,
      "ja": "8. ルーティングに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "In order to provide connectivity between the Legacy Internet and LISP sites, PITRs announcing large aggregates (ideally one single, large aggregate) of the IPv6 EID block could be deployed. By doing so, PITRs will attract traffic destined for LISP sites in order to encapsulate and forward it toward the specific destination LISP site. Routers in the Legacy Internet must treat announcements of prefixes from the IPv6 EID block as normal announcements, applying best current practices for traffic engineering and security.",
      "ja": "レガシーインターネットとLISPサイト間の接続を提供するために、IPv6 EIDブロックの大きなアグリゲート（理想的には1つの大きなアグリゲート）を発表するPITRを導入できます。そうすることにより、PITRはLISPサイト宛てのトラフィックを引き付け、それをカプセル化して特定の宛先LISPサイトに転送します。レガシーインターネットのルーターは、IPv6 EIDブロックからのプレフィックスのアナウンスを通常のアナウンスとして扱い、トラフィックエンジニアリングとセキュリティに現在のベストプラクティスを適用する必要があります。"
    },
    {
      "indent": 3,
      "text": "Even in a LISP site, not all routers need to run LISP elements. In particular, routers that are not at the border of the local domain, used only for intra-domain routing, do not need to provide any specific LISP functionality but must be able to route traffic using addresses in the IPv6 EID block.",
      "ja": "LISPサイトでも、すべてのルータがLISP要素を実行する必要はありません。特に、ローカルドメインの境界にないルーターは、ドメイン内ルーティングにのみ使用され、特定のLISP機能を提供する必要はありませんが、IPv6 EIDブロックのアドレスを使用してトラフィックをルーティングできる必要があります。"
    },
    {
      "indent": 3,
      "text": "For the above-mentioned reasons, routers that do not run any LISP element must not include any special handling code or hardware for addresses in the IPv6 EID block. In particular, it is recommended that the default router configuration not handle such addresses in any special way. Doing differently could prevent communication between the Legacy Internet and LISP sites or even break local intra-domain connectivity.",
      "ja": "上記の理由により、LISP要素を実行しないルーターには、IPv6 EIDブロック内のアドレス用の特別な処理コードやハードウェアを含めないでください。特に、デフォルトのルーター構成では、このようなアドレスを特別な方法で処理しないことをお勧めします。異なる方法で行うと、レガシーインターネットとLISPサイト間の通信が妨げられたり、ローカルのドメイン内接続が切断される可能性があります。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not introduce new security threats in the LISP architecture nor in the legacy Internet architecture.",
      "ja": "このドキュメントでは、LISPアーキテクチャやレガシーインターネットアーキテクチャに新しいセキュリティの脅威を紹介していません。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "ja": "10. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned a /32 IPv6 prefix for use as the global EID space for LISP using a hierarchical allocation as outlined in [RFC5226] and summarized in Table 1. The assigned block is from the 2001:5 global unicast space.",
      "ja": "IANAは、[RFC5226]で概説され、表1に要約されている階層割り当てを使用して、LISPのグローバルEIDスペースとして使用する/ 32 IPv6プレフィックスを割り当てました。割り当てられたブロックは、2001：5グローバルユニキャストスペースからのものです。"
    },
    {
      "indent": 3,
      "text": "IANA is not requested to issue an AS0 Route Origin Attestation (ROA [RFC6491]), because the global EID space is be used for routing purposes.",
      "ja": "グローバルEIDスペースはルーティングの目的で使用されるため、IANAはAS0 Route Origin Attestation（ROA [RFC6491]）の発行を要求されません。"
    },
    {
      "indent": 15,
      "text": "+----------------------+--------------------+\n| Attribute            | Value              |\n+----------------------+--------------------+\n| Address Block        | 2001:5::/32        |\n| Name                 | EID Space for LISP |\n| RFC                  | RFC 7954           |\n| Allocation Date      | September 2016     |\n| Termination Date     | September 2019 [1] |\n| Source               | True [2]           |\n| Destination          | True               |\n| Forwardable          | True               |\n| Global               | True               |\n| Reserved-by-protocol | True [3]           |\n+----------------------+--------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "[1] According to the 3+3 Plan outlined in this document, the\n    termination date can be postponed to September 2022.\n[2] Can be used as a multicast source as well.\n[3] To be used as EID space by routers enabled by LISP [RFC6830].",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 28,
      "text": "Table 1: Global EID Space",
      "ja": "表1：グローバルEIDスペース"
    },
    {
      "indent": 3,
      "text": "The reserved address space is requested for an initial 3-year period starting in September 2016 (until September 2019), with an option to extend it by three years (until September 2022) upon the decision of the IETF (see Sections 6 and 7). Following the policies outlined in [RFC5226], upon IETF Review, the decision should be made on whether to have a permanent EID block assignment by September 2019. If no explicit action is taken or, if the IETF Review outcome is that it is not worth having a reserved prefix as a global EID space, the whole /32 will be taken out from the \"IANA IPv6 Special-Purpose Address Registry\" and put back in the free pool managed by IANA.",
      "ja": "予約されたアドレススペースは、2016年9月（2019年9月まで）から始まる最初の3年間要求され、IETFの決定に基づいて3年（2022年9月まで）延長するオプションがあります（セクション6および7を参照）。 。 [RFC5226]で概説されているポリシーに従って、IETFレビューの際に、2019年9月までに永続的なEIDブロックを割り当てるかどうかを決定する必要があります。明示的なアクションが取られない場合、またはIETFレビューの結果が価値がない場合グローバルEIDスペースとして予約済みのプレフィックスがある場合、/ 32全体が「IANA IPv6特殊目的アドレスレジストリ」から取り出され、IANAが管理する空きプールに戻されます。"
    },
    {
      "indent": 3,
      "text": "Allocation and management of the global EID space is detailed in [RFC7955]. Nevertheless, all prefix allocations out of this space must be temporary and no allocation must go beyond September 2019 unless the IETF Review decides for a permanent global EID space assignment.",
      "ja": "グローバルEIDスペースの割り当てと管理については、[RFC7955]で詳しく説明されています。それにもかかわらず、このスペースからのすべてのプレフィックス割り当ては一時的である必要があり、IETFレビューが永続的なグローバルEIDスペース割り当てを決定しない限り、割り当ては2019年9月を超えてはなりません。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11. 参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2860] Carpenter, B., Baker, F., and M. Roberts, \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\", RFC 2860, DOI 10.17487/RFC2860, June 2000, <http://www.rfc-editor.org/info/rfc2860>.",
      "ja": "[RFC2860] Carpenter、B.、Baker、F。、およびM. Roberts、「Internet Assigned Numbers Authorityの技術的作業に関する覚書」、RFC 2860、DOI 10.17487 / RFC2860、2000年6月、<http：// www.rfc-editor.org/info/rfc2860>。"
    },
    {
      "indent": 3,
      "text": "[RFC3692] Narten, T., \"Assigning Experimental and Testing Numbers Considered Useful\", BCP 82, RFC 3692, DOI 10.17487/RFC3692, January 2004, <http://www.rfc-editor.org/info/rfc3692>.",
      "ja": "[RFC3692] Narten、T。、「Assigning Testing and Testing Numbers考慮された有用」、BCP 82、RFC 3692、DOI 10.17487 / RFC3692、2004年1月、<http://www.rfc-editor.org/info/rfc3692>。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, DOI 10.17487/RFC5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "ja": "[RFC5226] Narten、T。およびH. Alvestrand、「RFCでIANAの考慮事項セクションを作成するためのガイドライン」、BCP 26、RFC 5226、DOI 10.17487 / RFC5226、2008年5月、<http://www.rfc-editor.org / info / rfc5226>。"
    },
    {
      "indent": 3,
      "text": "[RFC6830] Farinacci, D., Fuller, V., Meyer, D., and D. Lewis, \"The Locator/ID Separation Protocol (LISP)\", RFC 6830, DOI 10.17487/RFC6830, January 2013, <http://www.rfc-editor.org/info/rfc6830>.",
      "ja": "[RFC6830] Farinacci、D.、Fuller、V.、Meyer、D。、およびD. Lewis、「The Locator / ID Separation Protocol（LISP）」、RFC 6830、DOI 10.17487 / RFC6830、2013年1月、<http：/ /www.rfc-editor.org/info/rfc6830>。"
    },
    {
      "indent": 3,
      "text": "[RFC6831] Farinacci, D., Meyer, D., Zwiebel, J., and S. Venaas, \"The Locator/ID Separation Protocol (LISP) for Multicast Environments\", RFC 6831, DOI 10.17487/RFC6831, January 2013, <http://www.rfc-editor.org/info/rfc6831>.",
      "ja": "[RFC6831] Farinacci、D.、Meyer、D.、Zwiebel、J。、およびS. Venaas、「マルチキャスト環境用のロケータ/ ID分離プロトコル（LISP）」、RFC 6831、DOI 10.17487 / RFC6831、2013年1月、< http://www.rfc-editor.org/info/rfc6831>。"
    },
    {
      "indent": 3,
      "text": "[RFC6832] Lewis, D., Meyer, D., Farinacci, D., and V. Fuller, \"Interworking between Locator/ID Separation Protocol (LISP) and Non-LISP Sites\", RFC 6832, DOI 10.17487/RFC6832, January 2013, <http://www.rfc-editor.org/info/rfc6832>.",
      "ja": "[RFC6832]ルイスD.、マイヤーD.、ファリナッチD.、およびV.フラー「ロケータ/ ID分離プロトコル（LISP）サイトと非LISPサイト間のインターワーキング」、RFC 6832、DOI 10.17487 / RFC6832、1月2013、<http://www.rfc-editor.org/info/rfc6832>。"
    },
    {
      "indent": 3,
      "text": "[RFC6833] Fuller, V. and D. Farinacci, \"Locator/ID Separation Protocol (LISP) Map-Server Interface\", RFC 6833, DOI 10.17487/RFC6833, January 2013, <http://www.rfc-editor.org/info/rfc6833>.",
      "ja": "[RFC6833] Fuller、V。およびD. Farinacci、「Locator / ID Separation Protocol（LISP）Map-Server Interface」、RFC 6833、DOI 10.17487 / RFC6833、2013年1月、<http://www.rfc-editor.org / info / rfc6833>。"
    },
    {
      "indent": 3,
      "text": "[RFC6834] Iannone, L., Saucez, D., and O. Bonaventure, \"Locator/ID Separation Protocol (LISP) Map-Versioning\", RFC 6834, DOI 10.17487/RFC6834, January 2013, <http://www.rfc-editor.org/info/rfc6834>.",
      "ja": "[RFC6834] Iannone、L.、Saucez、D。、およびO. Bonaventure、「Locator / ID Separation Protocol（LISP）Map-Versioning」、RFC 6834、DOI 10.17487 / RFC6834、2013年1月、<http：// www。 rfc-editor.org/info/rfc6834>。"
    },
    {
      "indent": 3,
      "text": "[RFC6835] Farinacci, D. and D. Meyer, \"The Locator/ID Separation Protocol Internet Groper (LIG)\", RFC 6835, DOI 10.17487/RFC6835, January 2013, <http://www.rfc-editor.org/info/rfc6835>.",
      "ja": "[RFC6835] Farinacci、D。およびD. Meyer、「The Locator / ID Separation Protocol Internet Groper（LIG）」、RFC 6835、DOI 10.17487 / RFC6835、2013年1月、<http://www.rfc-editor.org/ info / rfc6835>。"
    },
    {
      "indent": 3,
      "text": "[RFC6836] Fuller, V., Farinacci, D., Meyer, D., and D. Lewis, \"Locator/ID Separation Protocol Alternative Logical Topology (LISP+ALT)\", RFC 6836, DOI 10.17487/RFC6836, January 2013, <http://www.rfc-editor.org/info/rfc6836>.",
      "ja": "[RFC6836] Fuller、V.、Farinacci、D.、Meyer、D。、およびD. Lewis、「Locator / ID Separation Protocol Alternative Logical Topology（LISP + ALT）」、RFC 6836、DOI 10.17487 / RFC6836、2013年1月、 <http://www.rfc-editor.org/info/rfc6836>。"
    },
    {
      "indent": 3,
      "text": "[RFC6837] Lear, E., \"NERD: A Not-so-novel Endpoint ID (EID) to Routing Locator (RLOC) Database\", RFC 6837, DOI 10.17487/RFC6837, January 2013, <http://www.rfc-editor.org/info/rfc6837>.",
      "ja": "[RFC6837]リア、E。、「NERD：A Not-so-novel Endpoint ID（EID）to Routing Locator（RLOC）Database」、RFC 6837、DOI 10.17487 / RFC6837、2013年1月、<http：//www.rfc -editor.org/info/rfc6837>。"
    },
    {
      "indent": 3,
      "text": "[RFC7955] Iannone, L., Jorgensen, R., Conrad, D., and G. Huston, \"Locator/ID Separation Protocol (LISP) Endpoint Identifier (EID) Block Management Guidelines\", RFC 7955, DOI 10.17487/RFC7955, September 2016, <http://www.rfc-editor.org/info/rfc7955>.",
      "ja": "[RFC7955] Iannone、L.、Jorgensen、R.、Conrad、D。、およびG. Huston、「Locator / ID Separation Protocol（LISP）Endpoint Identifier（EID）Block Management Guidelines」、RFC 7955、DOI 10.17487 / RFC7955、 2016年9月、<http://www.rfc-editor.org/info/rfc7955>。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[BETA] LISP Beta Network, \"Locator/ID Separation Protocol\", <http://www.lisp4.net>.",
      "ja": "[ベータ] LISP Beta Network、「Locator / ID Separation Protocol」、<http://www.lisp4.net>。"
    },
    {
      "indent": 3,
      "text": "[FIABook2010] Iannone, L. and T. Leva, \"Modeling the economics of Loc/ID Separation for the Future Internet\", Towards the Future Internet, Pages 11-20, ISBN: 9781607505389, IOS Press, DOI 10.3233/978-1-60750-539-6-11, May 2010.",
      "ja": "[FIABook2010] Iannone、L。およびT. Leva、「将来のインターネットのためのLoc / ID分離の経済学のモデリング」、将来のインターネットに向けて、11〜20ページ、ISBN：9781607505389、IOS Press、DOI 10.3233 / 978-1 -60750-539-6-11、2010年5月。"
    },
    {
      "indent": 3,
      "text": "[LISP-INTRO] Cabellos-Aparicio, A. and D. Saucez, \"An Architectural Introduction to the Locator/ID Separation Protocol (LISP)\", Work in Progress, draft-ietf-lisp-introduction-13, April 2015.",
      "ja": "[LISP-INTRO] Cabellos-Aparicio、A。およびD. Saucez、「An Architectural Introduction to Locator / ID Separation Protocol（LISP）」、Work in Progress、draft-ietf-lisp-introduction-13、2015年4月。"
    },
    {
      "indent": 3,
      "text": "[MobiArch2007] Quoitin, B., Iannone, L., de Launois, C., and O. Bonaventure, \"Evaluating the Benefits of the Locator/ Identifier Separation\", The 2nd ACM-SIGCOMM International Workshop on Mobility in the Evolving Internet Architecture (MobiArch'07), DOI 10.1145/1366919.1366926, August 2007.",
      "ja": "[MobiArch2007] Quoitin、B.、Iannone、L.、de Launois、C。、およびO. Bonaventure、「Evaluating the Benefits of the Benefits of Locator / Identifier Separation」、第2回ACM-SIGCOMM国際ワークショップ、進化するインターネットアーキテクチャにおけるモビリティ（MobiArch'07）、DOI 10.1145 / 1366919.1366926、2007年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3056] Carpenter, B. and K. Moore, \"Connection of IPv6 Domains via IPv4 Clouds\", RFC 3056, DOI 10.17487/RFC3056, February 2001, <http://www.rfc-editor.org/info/rfc3056>.",
      "ja": "[RFC3056]カーペンター、B。およびK.ムーア、「IPv4クラウド経由のIPv6ドメインの接続」、RFC 3056、DOI 10.17487 / RFC3056、2001年2月、<http://www.rfc-editor.org/info/rfc3056> 。"
    },
    {
      "indent": 3,
      "text": "[RFC6491] Manderson, T., Vegoda, L., and S. Kent, \"Resource Public Key Infrastructure (RPKI) Objects Issued by IANA\", RFC 6491, DOI 10.17487/RFC6491, February 2012, <http://www.rfc-editor.org/info/rfc6491>.",
      "ja": "[RFC6491] Manderson、T.、Vegoda、L。、およびS. Kent、「IANAによって発行されるリソース公開鍵インフラストラクチャ（RPKI）オブジェクト」、RFC 6491、DOI 10.17487 / RFC6491、2012年2月、<http：// www。 rfc-editor.org/info/rfc6491>。"
    },
    {
      "indent": 3,
      "text": "[RFC7215] Jakab, L., Cabellos-Aparicio, A., Coras, F., Domingo-Pascual, J., and D. Lewis, \"Locator/Identifier Separation Protocol (LISP) Network Element Deployment Considerations\", RFC 7215, DOI 10.17487/RFC7215, April 2014, <http://www.rfc-editor.org/info/rfc7215>.",
      "ja": "[RFC7215] Jakab、L.、Cabellos-Aparicio、A.、Coras、F.、Domingo-Pascual、J。、およびD. Lewis、「Locator / Identifier Separation Protocol（LISP）Network Element Deployment Considerations」、RFC 7215、 DOI 10.17487 / RFC7215、2014年4月、<http://www.rfc-editor.org/info/rfc7215>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Special thanks to Roque Gagliano for his suggestions and pointers. Thanks to Alvaro Retana, Deborah Brungard, Ron Bonica, Damien Saucez, David Conrad, Scott Bradner, John Curran, Paul Wilson, Geoff Huston, Wes George, Arturo Servin, Sander Steffann, Brian Carpenter, Roger Jorgensen, Terry Manderson, Brian Haberman, Adrian Farrel, Job Snijders, Marla Azinger, Chris Morrow, and Peter Schoenmaker for their insightful comments. Thanks as well to all participants for the fruitful discussions on the IETF mailing list.",
      "ja": "Roque Gagliano氏の提案とアドバイスに特に感謝します。 Alvaro Retana、Deborah Brungard、Ron Bonica、Damien Saucez、David Conrad、Scott Bradner、John Curran、Paul Wilson、Geoff Huston、Wes George、Arturo Servin、Sander Steffann、Brian Carpenter、Roger Jorgensen、Terry Manderson、Brian Habermanに感謝します。 Adrian Farrel、Job Snijders、Marla Azinger、Chris Morrow、およびPeter Schoenmakerの洞察に満ちたコメント。 IETFメーリングリストでの実り多い議論についてすべての参加者に感謝します。"
    },
    {
      "indent": 3,
      "text": "The work of Luigi Iannone has been partially supported by the ANR-13-INFR-0009 LISP-Lab Project <www.lisp-lab.org> and the EIT KIC ICT-Labs SOFNETS Project.",
      "ja": "Luigi Iannoneの作業は、ANR-13-INFR-0009 LISP-Labプロジェクト<www.lisp-lab.org>とEIT KIC ICT-Labs SOFNETSプロジェクトによって部分的にサポートされています。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Luigi Iannone Telecom ParisTech",
      "ja": "Luigi Iannone Telecom ParisTech"
    },
    {
      "indent": 3,
      "text": "Email: ggx@gigix.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Darrel Lewis Cisco Systems, Inc.",
      "ja": "Darrel Lewis Cisco Systems、Inc."
    },
    {
      "indent": 3,
      "text": "Email: darlewis@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "David Meyer Brocade",
      "ja": "デビッドマイヤーブロケード"
    },
    {
      "indent": 3,
      "text": "Email: dmm@1-4-5.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Vince Fuller",
      "ja": "ヴィンスフラー"
    },
    {
      "indent": 3,
      "text": "Email: vaf@vaf.net",
      "raw": true,
      "ja": ""
    }
  ]
}