{
  "title": {
    "text": "RFC 7614 - Explicit Subscriptions for the REFER Method",
    "ja": "RFC 7614 - REFERメソッドの明示的なサブスクリプション"
  },
  "number": 7614,
  "created_at": "2019-10-31 07:02:41.807922+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         R. Sparks\nRequest for Comments: 7614                                        Oracle\nCategory: Standards Track                                    August 2015\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Explicit Subscriptions for the REFER Method",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Session Initiation Protocol (SIP) REFER request, as defined by RFC 3515, triggers an implicit SIP-Specific Event Notification framework subscription. Conflating the start of the subscription with handling the REFER request makes negotiating SUBSCRIBE extensions impossible and complicates avoiding SIP dialog sharing. This document defines extensions to REFER that remove the implicit subscription and, if desired, replace it with an explicit one.",
      "ja": "セッション開始プロトコル（SIP）RFC 3515によって定義されるように、REFERリクエストを、暗黙のSIP固有のイベント通知フレームワークのサブスクリプションをトリガします。 REFER要求は交渉が不可能な拡張をSUBSCRIBEなり、SIPダイアログの共有を避け複雑に扱うとサブスクリプションの開始をConflating。この文書では、それは暗黙のサブスクリプションを削除し、必要に応じて、明示的なものと交換参照するための拡張機能を定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7614.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7614で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Conventions .....................................................3\n3. Overview ........................................................4\n   3.1. Explicit Subscriptions .....................................4\n   3.2. No Subscriptions ...........................................5\n4. The Explicit Subscription Extension .............................5\n   4.1. Sending a REFER ............................................5\n   4.2. Processing a REFER Response ................................5\n   4.3. Processing a Received REFER ................................6\n   4.4. Subscribing to the 'refer' Event ...........................7\n   4.5. Processing a Received SUBSCRIBE ............................7\n   4.6. Sending a NOTIFY ...........................................7\n   4.7. Managing 'refer' Event State ...............................8\n   4.8. The Refer-Events-At Header Field ...........................8\n5. The No Subscription Extension ...................................9\n   5.1. Sending a REFER ............................................9\n   5.2. Processing a REFER Response ................................9\n   5.3. Processing a Received REFER ................................9\n6. The 'explicitsub' and 'nosub' Option Tags ......................10\n7. Updates to RFC 3515 ............................................10\n8. Security Considerations ........................................10\n9. IANA Considerations ............................................12\n   9.1. Register the 'explicitsub' Option Tag .....................12\n   9.2. Register the 'nosub' Option Tag ...........................12\n   9.3. Register the Refer-Events-At Header Field .................12\n10. References ....................................................13\n   10.1. Normative References .....................................13\n   10.2. Informative References ...................................13\nAuthor's Address ..................................................14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "REFER, as defined by [RFC3515], triggers an implicit SIP-Specific Event Framework subscription. Sending a REFER within a dialog established by an INVITE results in dialog reuse and the associated problems described in [RFC5057]. The SIP-Specific Event Notification framework definition [RFC6665] disallows such dialog reuse. Call transfer, as defined in [RFC5589], thus requires sending a REFER request on a new dialog, associating it with an existing dialog using the 'Target-Dialog' mechanism defined in [RFC4538].",
      "ja": "[RFC3515]で定義されるように、REFER、暗黙SIP固有のイベントフレームワークのサブスクリプションは、トリガー。ダイアログリユースにおけるINVITE結果と[RFC5057]に記載の関連する問題によって確立されたダイアログ内REFERを送信します。 SIP固有のイベント通知フレームワークの定義[RFC6665]は、このようなダイアログの再利用を禁止します。 [RFC5589]で定義されるようにコール転送は、このように[RFC4538]で定義された「ターゲット・ダイアログ」メカニズムを使用して、既存のダイアログに関連付け、新しいダイアログのREFER要求を送信することが必要です。"
    },
    {
      "indent": 3,
      "text": "Because there is no explicit SUBSCRIBE request, the tools for negotiating subscription details are unavailable for REFER subscriptions. This includes negotiating subscription duration and providing information through Event header field parameters. The use of the SIP 'Supported' and 'Require' extension mechanisms [RFC3261] is complicated by the implicit subscription. It is unclear whether or not the extension applies to handling the REFER request itself, to the messages in the subscription created by the REFER, or to both. Avoiding this confusion requires careful specification in each extension. Existing extensions do not provide this clarity.",
      "ja": "明示的なSUBSCRIBE要求がないので、サブスクリプションの詳細を交渉するためのツールは、サブスクリプションを参照してください使用できません。これは、サブスクリプション期間を交渉し、イベントヘッダフィールドパラメータを介して情報を提供することを含みます。 SIP「サポート」と「必要」拡張メカニズム[RFC3261]を使用することが暗黙のサブスクリプションによって複雑になります。拡張子がREFER要求自体を処理する、REFERによって作成されたサブスクリプション内のメッセージに、またはその両方に適用されるかどうかは不明です。この混乱を回避することは、各拡張子に注意を指定する必要があります。既存の拡張機能は、この明瞭さを提供していません。"
    },
    {
      "indent": 3,
      "text": "This document defines two mechanisms that remove the implicit subscription, one of which replaces it with an explicit one. The benefits of doing so include:",
      "ja": "この文書は、明示的なものと、それに取って代わる一つは、暗黙的なサブスクリプションを削除する2つのメカニズムを定義します。そうすることの利点は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Allowing REFER to be used within INVITE-created dialogs without creating dialog reuse.",
      "ja": "許可oをダイアログの再利用を作成せずにINVITEが作成したダイアログ内で使用することを参照してください。"
    },
    {
      "indent": 3,
      "text": "o Allowing standard subscription parameter negotiation.",
      "ja": "標準のサブスクリプション・パラメータのネゴシエーションを許可するO。"
    },
    {
      "indent": 3,
      "text": "o Allowing standard negotiation of SIP extensions.",
      "ja": "SIPの拡張機能の標準交渉を許可するO。"
    },
    {
      "indent": 3,
      "text": "There are limitations on when it is appropriate to use the extension that allows an explicit subscription, related directly to definition of non-INVITE transaction handling SIP. These limitations are discussed in Section 4.1.",
      "ja": "SIPを扱う非INVITEトランザクションの定義に直接関係の明示的なサブスクリプションを、可能にする拡張機能を使用することが適切であるときには制限があります。これらの制限は、4.1節で議論されています。"
    },
    {
      "indent": 0,
      "text": "2. Conventions",
      "section_title": true,
      "ja": "2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Overview",
      "section_title": true,
      "ja": "3.概要"
    },
    {
      "indent": 3,
      "text": "This section provides a non-normative overview of the behaviors defined in subsequent sections.",
      "ja": "このセクションでは、以降のセクションで定義された行動の非規範的な概要を提供します。"
    },
    {
      "indent": 0,
      "text": "3.1. Explicit Subscriptions",
      "section_title": true,
      "ja": "3.1. 明示的なサブスクリプション"
    },
    {
      "indent": 3,
      "text": "A SIP User Agent (UA) that wishes to issue a REFER request that will not create an implicit subscription, but will allow an explicit one, will include a new option tag, 'explicitsub', in the Require header field of the REFER request. This REFER could be sent either within an existing dialog or as an out-of-dialog request.",
      "ja": "暗黙のサブスクリプションを作成しませんREFER要求を発行することを希望するが、明示的なものを許可するSIPユーザエージェント（UA）は、REFERリクエストのRequireヘッダーフィールドに、新しいオプションタグ「explicitsub」が含まれます。このREFERは、既存のダイアログ内または外の対話要求のいずれかとして送ることができます。"
    },
    {
      "indent": 3,
      "text": "If the recipient of the REFER accepts the request, it will begin managing the 'refer' event state described in RFC 3515 and will provide a URI that will reach an event server that will service subscriptions to that state. (In many cases, the recipient of the REFER will perform the role of event server itself.) That URI is returned in a new header field in the REFER response named 'Refer-Events-At'.",
      "ja": "REFERの受信者が要求を受け入れた場合、それはRFC 3515で説明し「参照してください」イベント状態管理を開始し、その状態にサブスクリプションをサービスするイベントサーバに到達しますURIを提供します。 （多くの場合、REFERの受信者は、イベント・サーバー自体の役割を実行します。）URIは、「参照してください-イベントアット」という名前のREFER応じて新しいヘッダーフィールドで返されていること。"
    },
    {
      "indent": 3,
      "text": "The UA that issued the REFER can now subscribe to the 'refer' event at the provided URI, using a SUBSCRIBE request with a new dialog identifier. The full range of negotiation mechanisms is available for its use in that request. As detailed in RFCs 6665 and 3515, the event server accepting the subscription will send an immediate NOTIFY with the current refer event state, additional NOTIFY messages as the refer state changes, and a terminal NOTIFY message when the referred action is complete. It is, of course, possible that the initial NOTIFY is also the terminal NOTIFY.",
      "ja": "REFER発行したUAは現在、新しいダイアログ識別子にSUBSCRIBEリクエストを使用して、提供URIで「参照してください」イベントを購読することができます。交渉メカニズムの完全な範囲は、その要求での使用のために利用可能です。 RFC 6665および3515に詳述されているように、サブスクリプションを受け入れるイベント・サーバーが即時に送信されます、現在参照してくださいイベント状態でNOTIFY、追加は呼ばアクションが完了したときにNOTIFYメッセージを参照してください状態の変化、および端末としてNOTIFYメッセージ。初期には、端末がNOTIFYされて通知することを、もちろん、可能です。"
    },
    {
      "indent": 3,
      "text": "It is possible that the referred action is completed before the SUBSCRIBE arrives at the event server. The server needs to retain the final refer event state for some period of time to include in the terminal NOTIFY that will be sent for such subscriptions. It is also possible that a SUBSCRIBE will never arrive.",
      "ja": "SUBSCRIBEは、イベント・サーバーに到着する前に呼ばアクションが完了している可能性があります。サーバは、端末に含めるある期間の最終参照イベント状態を保持する必要があることは、サブスクリプションのために送信されるNOTIFY。 SUBSCRIBEが到着しないことも可能です。"
    },
    {
      "indent": 3,
      "text": "This extension makes it possible to separate the event server that will handle subscriptions from the UA that accepted the REFER. Such a UA could use mechanisms such as PUBLISH [RFC3903] to convey the refer event state to the event server. This extension also makes it possible to allow more than one subscription to the refer event state.",
      "ja": "この拡張はREFERを受け入れたUAからのサブスクリプションを処理するイベント・サーバーを分離することが可能となります。そのようなUAは、イベント・サーバーを参照して、イベント状態を伝えるために[RFC3903]をPUBLISHとしての機構を使用することができます。この拡張も参照してくださいイベント状態に複数のサブスクリプションを許可することが可能となります。"
    },
    {
      "indent": 0,
      "text": "3.2. No Subscriptions",
      "section_title": true,
      "ja": "3.2. いいえサブスクリプションありません"
    },
    {
      "indent": 3,
      "text": "A UA that wishes to issue a REFER request that will not create an implicit subscription and wishes to tell the recipient that it is not interested in creating an explicit subscription will include a new option tag, 'nosub', in the Require header field of the REFER request. This REFER could be sent either within an existing dialog or as an out-of-dialog request.",
      "ja": "暗黙のサブスクリプションを作成しませんREFER要求を発行することを希望し、それが明示的なサブスクリプションを作成するに興味を持っていないことを受信者に伝えることを望むUAはのRequireヘッダーフィールドに新しいオプションタグ「nosub」を、含まれています要求を参照してください。このREFERは、既存のダイアログ内または外の対話要求のいずれかとして送ることができます。"
    },
    {
      "indent": 3,
      "text": "If the recipient of the REFER accepts the request, it knows not to create an implicit subscription and knows that no explicit subscription will be forthcoming. The recipient will continue to process the request indicated in the Refer-To header field as specified in RFC 3515, but it can avoid the cost of preparing to handle any 'refer' event subscriptions related to this REFER request.",
      "ja": "REFERの受信者が要求を受け入れた場合、それは暗黙のサブスクリプションを作成しないように知っていて、明示的なサブスクリプションは今後もないだろうことを知っています。受信者は、RFC 3515で指定されるように参照のために、ヘッダーフィールドに示さ要求を処理していき、それがこのREFER要求に関連する「参照」イベントサブスクリプションを処理するために準備のコストを回避することができます。"
    },
    {
      "indent": 0,
      "text": "4. The Explicit Subscription Extension",
      "section_title": true,
      "ja": "4.明示的なサブスクリプションの拡張"
    },
    {
      "indent": 0,
      "text": "4.1. Sending a REFER",
      "section_title": true,
      "ja": "4.1.  REFER送信"
    },
    {
      "indent": 3,
      "text": "To suppress the creation of any implicit subscription, and allow for an explicit one, a UA forming a REFER request will include the option tag 'explicitsub' in the Require header field of the request. The REFER request is otherwise formed following the requirements of [RFC3515]. Since this REFER has no chance of creating an implicit subscription, the UA MAY send the REFER request within an existing dialog or out-of-dialog.",
      "ja": "暗黙のサブスクリプションの作成を抑制し、明示的な1を可能にするために、UA形成REFER要求は、要求の要求ヘッダーフィールドのオプションタグ「explicitsub」を含むであろう。 REFER要求は、そうでない場合、[RFC3515]の要件を以下に形成されます。このREFERは暗黙のサブスクリプションを作成するためのチャンスを持っていないので、UAが既存のダイアログ内またはアウトオブダイアログREFER要求を送信することができます。"
    },
    {
      "indent": 3,
      "text": "Note that if the REFER forks (see [RFC3261]), only one final response will be returned to the issuing UA. If it is important that the UA be able to subscribe to any refer state generated by accepting this request, the UA needs to form the request so that it will only be accepted in one place. This can be achieved by sending the REFER request within an existing dialog or by using the 'Target-Dialog' mechanism defined in [RFC4538]. If it is possible for the request to be accepted in more than one location, and things would go wrong if the UA did not learn about each location that the request was accepted, using this extension is not appropriate.",
      "ja": "REFERフォーク（[RFC3261]を参照）場合、唯一の最終的な応答が発行UAに戻される。なお。それはUAがこの要求を受け入れることによって生成された参照してください状態に加入できることが重要である場合、UAはそれだけで一つの場所に受け入れられるようにリクエストを形成する必要があります。これは、既存のダイアログ内REFER要求を送信することによって、または[RFC4538]で定義された「ターゲット・ダイアログ」メカニズムを使用することによって達成することができます。要求が複数の場所で受け入れすることは可能である、とUAが、要求が受け入れられたことをそれぞれの場所について学ぶことがなかったならば物事がうまくいかないだろう場合は、この拡張機能を使用することは適切ではありません。"
    },
    {
      "indent": 0,
      "text": "4.2. Processing a REFER Response",
      "section_title": true,
      "ja": "4.2.  REFER応答の処理"
    },
    {
      "indent": 3,
      "text": "The UA will process responses to the REFER request as specified in [RFC3515] (and, consequently, [RFC3261]). In particular, if the REFER was sent to an element that does not support or is unwilling to use this extension, the response will contain a 420 (Bad Extension) response code (see Section 8.1.3.5 of [RFC3261]). As that document states, the UA can retry the request without using this extension.",
      "ja": "[RFC3515]（および、その結果、[RFC3261]）で指定されるように、UAは、REFER要求に対する応答を処理します。具体的には、参照する場合は（[RFC3261]のセクション8.1.3.5を参照）をサポートするか、この拡張を使用することは不本意でない、応答は420（悪い拡張）応答コードを含むであろう要素に送られました。そのドキュメントの状態としては、UAは、この拡張機能を使用せずに要求を再試行することができます。"
    },
    {
      "indent": 3,
      "text": "If the UA receives a 2xx-class response, it will contain a Refer-Events-At header field (Section 4.8) with a single URI as its value. If the UA is interested in the state of the referenced action, it will subscribe to the 'refer' event at that URI.",
      "ja": "UAが2XXクラスの応答を受信した場合は、その値として単一のURIで参照の事象アットヘッダーフィールド（セクション4.8）を含有するであろう。 UAが参照アクションの状態に興味がある場合は、そのURIで「参照してください」イベントをサブスクライブします。"
    },
    {
      "indent": 0,
      "text": "4.3. Processing a Received REFER",
      "section_title": true,
      "ja": "4.3.  REFERのReceivedの処理"
    },
    {
      "indent": 3,
      "text": "An element receiving a REFER request requiring the 'explicitsub' extension will use the same admissions policies that are used without the extension, with the addition that it is acceptable to admit an in-dialog REFER request requiring this extension since it cannot create another usage inside that dialog. In particular, see Section 5.2 of [RFC3515].",
      "ja": "インダイアログが内部別の使用法を作成することができないので、この拡張を必要とする要求をREFER認める許容可能であることを添加して、拡張することなく使用されるのと同じ入学ポリシーを使用する「explicitsub」伸長を必要REFER要求を受信素子そのダイアログ。具体的には、[RFC3515]のセクション5.2を参照。"
    },
    {
      "indent": 3,
      "text": "Accepting a REFER request that requires 'explicitsub' does not create a dialog or a new usage within an existing dialog. The element MUST NOT create an implicit subscription when accepting the REFER request.",
      "ja": "「explicitsub」を要求するREFER要求を受け入れると、既存のダイアログ内のダイアログまたは新しい使用を作成しません。 REFER要求を受け付ける際の要素は、暗黙的なサブスクリプションを作成してはいけません。"
    },
    {
      "indent": 3,
      "text": "If the REFER request was received within an existing dialog, the accepting element will not be acting as a SIP-Events notifier in the context of that dialog. If it is not otherwise subject to becoming a notifier in the context of the dialog, none of the requirements in [RFC6665], particularly the requirement to provide a Globally Routable User Agent URI (GRUU) as the local contact, apply to the message accepting the REFER request.",
      "ja": "REFERリクエストが既存のダイアログ内に受信された場合は、受容性元素は、そのダイアログのコンテキストでSIP-イベント通知として機能することはありません。それは対話の文脈における通知になるため、さもなければ対象ではない場合、[RFC6665]の要求のいずれも、特に要件は、ローカルコンタクトとしてグローバルにルーティング可能なユーザエージェントURI（GRUU）を提供しない受付メッセージに適用します要求を参照してください。"
    },
    {
      "indent": 3,
      "text": "An element that accepts a REFER request with 'explicitsub' in its Require header field MUST return a 200 response containing a sip: or sips: URI in the Refer-Events-At header field that can be used to subscribe to the refer event state associated with this REFER request. This URI MUST uniquely identify this refer event state. The URI needs to reach the event server when used in a SUBSCRIBE request from the element that sent the REFER. One good way to ensure the URI provided has that property is to use a GRUU [RFC5627] for the event server. As discussed in Section 8, possession of this URI is often the only requirement for authorizing a subscription to it. Implementations SHOULD provide a URI constructed in a way that is hard to guess. Again, using a GRUU (specifically, a temporary GRUU) is one good way to achieve this property.",
      "ja": "または一口：参照イベント状態関連に加入するために使用することができる参照の事象アットヘッダーフィールドにおけるURIの要求ヘッダーフィールドは、SIPを含む200応答を返す必要があります「explicitsub」を有するREFER要求を受け付ける要素これで、要求を参照してください。このURIは一意には、イベント状態を指す特定しなければなりません。 URIは、REFER送ら要素からSUBSCRIBEリクエストで使用されるとき、イベントサーバに到達する必要があります。提供URIを確保するための一つの良い方法は、プロパティは、イベント・サーバーにGRUU [RFC5627]を使用することであることがあります。第8章で説明したように、このURIの所持は、多くの場合、それにサブスクリプションを許可するための唯一の要件です。実装は推測しにくいようにして構築さURIを提供する必要があります。ここでも、GRUU（具体的には、一時的なGRUU）を使用すると、このプロパティを達成するための一つの良い方法です。"
    },
    {
      "indent": 3,
      "text": "The accepting element will otherwise proceed with the processing defined in [RFC3515].",
      "ja": "受け入れ要素は、そうでなければ、[RFC3515]で定義された処理を進めます。"
    },
    {
      "indent": 3,
      "text": "The event server identified by the Refer-Events-At URI could receive SUBSCRIBE requests at any point after the response containing the Refer-Events-At header field is sent. Implementations should take care to ensure the event server is ready to receive those SUBSCRIBE requests before sending the REFER response, but as with all non-",
      "ja": "参照の事象アットURIによって識別されるイベント・サーバは、参照の事象アットヘッダフィールドを含む応答が送信された後の任意の時点でSUBSCRIBE要求受信することができます。イベント・サーバーを確保するために注意しなければならない実装は、REFER応答を送信する前に、それらが要求をSUBSCRIBE受信する準備ができているが、すべての非を持つように"
    },
    {
      "indent": 3,
      "text": "INVITE responses, the response should be sent as soon as possible (see [RFC4321]). It is also possible that the referred action may complete before any SUBSCRIBE request arrives. The event server will need to maintain the final refer event state for a period of time after the action completes in order to serve such subscriptions (see Section 4.7).",
      "ja": "INVITE応答、応答は（[RFC4321]を参照）できるだけ早く送信する必要があります。任意の要求が到着する前に、SUBSCRIBE呼ばアクションが完了することも可能です。イベント・サーバは、アクションが（4.7節を参照）、このようなサブスクリプションサービスを提供するために完了した後、最終的には一定期間のイベント状態を指す維持する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.4. Subscribing to the 'refer' Event",
      "section_title": true,
      "ja": "4.4.  「参照してください」イベントへの登録"
    },
    {
      "indent": 3,
      "text": "A UA that possesses a URI obtained from a Refer-Events-At header field MAY subscribe to the refer event state at that URI. It does so following the requirements of [RFC6665], placing the token 'refer' in the Event header field and the URI in the Request-URI of the SUBSCRIBE request. The SUBSCRIBE request MUST NOT reuse any existing dialog identifiers.",
      "ja": "URIが参照事象アットヘッダフィールドから得られた所有UAは、そのURIで参照イベント状態に加入することができます。そのように、SUBSCRIBEリクエストのRequest-URIに、[RFC6665]の要件を次のトークンを配置するイベントヘッダフィールドに「参照」とURIありません。 SUBSCRIBEリクエストは、既存のダイアログ識別子を再利用してはいけません。"
    },
    {
      "indent": 3,
      "text": "Subsequent handling of the subscription MUST follow the requirements of [RFC6665] and [RFC3515]. In particular, as discussed in Section 2.4.6 of [RFC3515], the NOTIFY messages in the subscription might include an id parameter in their Event header fields. Subsequent SUBSCRIBE requests used to refresh or terminate this subscription MUST contain this id parameter. Note that the rationale for the id parameter provided in that section is not relevant when this extension is used. The URI returned in the Refer-Events-At header field uniquely identifies appropriate state, making the id parameter redundant. However, this behavioral requirement is preserved to reduce the number of changes to existing implementations in order to support this extension and to make it more likely that existing diagnostic tools will work with little or no modification.",
      "ja": "サブスクリプションのその後の取り扱いは、[RFC6665]と[RFC3515]の要件に従わなければなりません。具体的には、[RFC3515]のセクション2.4.6で説明したように、それらのイベントヘッダフィールドにidパラメータが含まれる場合があり、サブスクリプションのメッセージを通知します。更新したり、このサブスクリプションを終了するために使用され、後続のSUBSCRIBEリクエストは、このidパラメータを含まなければなりません。この拡張を使用する場合、そのセクション内に設けられたidパラメータの根拠は関連しないことに留意されたいです。 URIが参照事象アットヘッダフィールドに戻さ一意のIDパラメータは冗長化、適切な状態を識別する。しかし、この行動の要件は、この拡張機能をサポートし、それは可能性が高く、既存の診断ツールは、ほとんど、またはまったく変更することなく動作することを確認するために、既存の実装への変更の数を減らすために保存されています。"
    },
    {
      "indent": 0,
      "text": "4.5. Processing a Received SUBSCRIBE",
      "section_title": true,
      "ja": "4.5.  SUBSCRIBEのReceivedの処理"
    },
    {
      "indent": 3,
      "text": "An event server receiving a SUBSCRIBE request will process it according to the requirements of [RFC6665]. The event server MAY choose to authorize the SUBSCRIBE request based on the Request-URI corresponding to existing refer event state. It MAY also require further authorization as discussed in Section 8.",
      "ja": "SUBSCRIBEリクエストを受信し、イベント・サーバは、[RFC6665]の要件に応じてそれを処理します。イベント・サーバーがイベント状態を指す既存に対応するのRequest-URIに基づいてSUBSCRIBEリクエストを承認することを選択するかもしれません。セクション8で説明したようにそれはまた、さらに、許可が必要な場合があります。"
    },
    {
      "indent": 3,
      "text": "When accepting a subscription, the event server will establish the initial subscription duration using the guidance in Section 3.4 of [RFC3515].",
      "ja": "サブスクリプションを受け付けると、イベント・サーバーは、[RFC3515]の3.4節のガイダンスを使用して初期サブスクリプション期間を確立します。"
    },
    {
      "indent": 0,
      "text": "4.6. Sending a NOTIFY",
      "section_title": true,
      "ja": "4.6.  NOTIFY送信"
    },
    {
      "indent": 3,
      "text": "NOTIFY messages within a subscription are formed and sent following the requirements in [RFC3515]. See, in particular, Section 2.4.5 of that document.",
      "ja": "サブスクリプション内のメッセージをNOTIFYは、[RFC3515]で要件以下に形成して送信されます。特に、そのドキュメントのセクション2.4.5を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.7. Managing 'refer' Event State",
      "section_title": true,
      "ja": "4.7. イベント管理状態「を参照してください。」"
    },
    {
      "indent": 3,
      "text": "As described in [RFC3515], an element creates the state for event 'refer' when it accepts a REFER request. It updates that state as the referred request proceeds, ultimately reaching a state where the request has completed and the final state is known.",
      "ja": "[RFC3515]に記載されているように、要素は、イベントの状態を作成し、それはREFER要求を受け付けると「参照します」。それは、最終的に要求が完了したと最終状態が知られている状態に達すると呼ば要求が進むにつれてその状態を更新します。"
    },
    {
      "indent": 3,
      "text": "In RFC 3515 implementations, it was a reasonable design choice to destroy the refer event state immediately after sending the NOTIFY that terminated the implicit subscription. This is not the case when using this extension. It is possible for the referenced request to complete very quickly, perhaps sooner than the time it takes the response to the REFER to traverse the network to the UA that sent the request and the time it takes that agent to send the SUBSCRIBE request for the event state to the URI the response provides. Thus, the event server MUST retain the final refer event state for a reasonable period of time, which SHOULD be at least 2*64*T1 (that is, 64 seconds), representing an upper-bound estimate of the time it would take to complete two non-INVITE transactions: the REFER and an immediate SUBSCRIBE.",
      "ja": "RFC 3515個の実装では、すぐに、暗黙的なサブスクリプションを終了することを通知送信後、イベント状態を指す破壊する合理的な設計上の選択でした。この拡張機能を使用する場合は、このケースではありません。参照要求は、それが要求し、それがイベントのためにSUBSCRIBEリクエストを送信するには、そのエージェントにかかる時間を送ったUAにネットワークを横断するREFERに対する応答に要する時間よりも、おそらく早く、非常に迅速に完了することが可能ですURIへの状態応答が用意されています。したがって、イベント・サーバは、それがかかる時間の上限推定値を表す（すなわち、64秒）は、少なくとも2 * 64 * T1すべき、合理的な期間のイベント状態を参照し、最終的に保持しなければなりません完全な二つの非INVITE取引：REFERと即時SUBSCRIBE。"
    },
    {
      "indent": 3,
      "text": "If an otherwise acceptable SUBSCRIBE arrives during this retention period, the subscription would be accepted and immediately terminated with a NOTIFY containing the final event state with a Subscription-State of terminated with a reason value of \"noresource\".",
      "ja": "それ以外の場合は許容できるが、この保存期間中に到着したSUBSCRIBE場合は、サブスクリプションが受け入れられ、すぐに「NORESOURCE」の理由値で終了のサブスクリプションのステートで最後のイベントの状態を含むNOTIFYで終了されるだろう。"
    },
    {
      "indent": 0,
      "text": "4.8. The Refer-Events-At Header Field",
      "section_title": true,
      "ja": "4.8. 参照してください-イベントアットヘッダーフィールド"
    },
    {
      "indent": 3,
      "text": "The Refer-Events-At header field is an extension-header as defined by [RFC3261]. Its ABNF [RFC5234] is as follows:",
      "ja": "参照の事象アットヘッダフィールド[RFC3261]で定義されるような拡張ヘッダです。次のようにそのABNF [RFC5234]は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Refer-Events-At = \"Refer-Events-At\" HCOLON LAQUOT ( SIP-URI / SIPS-URI ) RAQUOT *( SEMI generic-param )",
      "ja": "参照してください-イベントアット= \"を参照してください-イベント-AT\" HCOLON LAQUOT（SIP-URI / SIPS-URI）RAQUOTの*（SEMIジェネリック-PARAM）"
    },
    {
      "indent": 3,
      "text": "See [RFC3261] for the definition of the elements used in that production.",
      "ja": "その生産に使用される要素の定義については、[RFC3261]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Note that this rule does not allow a full addr-spec as defined in RFC 3261, and it mandates the use of the angle brackets. That is:",
      "ja": "RFC 3261で定義された、このルールは、フルのaddrスペックを許可していないことに注意してください、そして、それは角括弧の使用を義務付け。あれは："
    },
    {
      "indent": 3,
      "text": "Refer-Events-At: <sips:vPT3izGmo8NTxaPADRZvEAY22BKx@example.com;gr>",
      "ja": "参照してください-イベント-時：<一口：vPT3izGmo8NTxaPADRZvEAY22BKx@example.com; GR>"
    },
    {
      "indent": 3,
      "text": "is well formed, but",
      "ja": "うまく形成されておりますが、"
    },
    {
      "indent": 3,
      "text": "Refer-Events-At: sip:wsXa9mkHtPcGu8@example.com",
      "ja": "SIP：-イベントアットを参照してくださいwsXa9mkHtPcGu8@example.com"
    },
    {
      "indent": 3,
      "text": "is invalid.",
      "ja": "無効です。"
    },
    {
      "indent": 3,
      "text": "The Refer-Events-At header field is only meaningful in a 2xx-class response to a REFER request. If it appears in the header of any other SIP message, its meaning is undefined, and it MUST be ignored.",
      "ja": "参照の事象アットヘッダフィールドは、REFER要求への2xxクラスの応答でのみ意味があります。それは、他のSIPメッセージのヘッダーに表示されている場合は、その意味は未定義であり、それを無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. The No Subscription Extension",
      "section_title": true,
      "ja": "5.ノー契約延長"
    },
    {
      "indent": 0,
      "text": "5.1. Sending a REFER",
      "section_title": true,
      "ja": "5.1.  REFER送信"
    },
    {
      "indent": 3,
      "text": "To suppress the creation of any implicit subscription and signal that no explicit subscription will be forthcoming, a UA forming a REFER request will include the option tag 'nosub' in the Require header field of the request. The REFER request is otherwise formed following the requirements of [RFC3515]. Since this REFER has no chance of creating an implicit subscription, the UA MAY send the REFER request within an existing dialog or out-of-dialog.",
      "ja": "暗黙のサブスクリプションの作成を抑制し、明示的なサブスクリプションが今後ないであろうことを知らせるために、UA形成REFER要求は、要求の要求ヘッダーフィールドのオプションタグ「nosub」を含むであろう。 REFER要求は、そうでない場合、[RFC3515]の要件を以下に形成されます。このREFERは暗黙のサブスクリプションを作成するためのチャンスを持っていないので、UAが既存のダイアログ内またはアウトオブダイアログREFER要求を送信することができます。"
    },
    {
      "indent": 0,
      "text": "5.2. Processing a REFER Response",
      "section_title": true,
      "ja": "5.2.  REFER応答の処理"
    },
    {
      "indent": 3,
      "text": "The UA will process responses to the REFER request as specified in [RFC3515] (and, consequently, [RFC3261]). In particular, if the REFER was sent to an element that does not support or is unwilling to use this extension, the response will contain a 420 (Bad Extension) response code (see Section 8.1.3.5 of [RFC3261]). As that document states, the UA can retry the request without using this extension.",
      "ja": "[RFC3515]（および、その結果、[RFC3261]）で指定されるように、UAは、REFER要求に対する応答を処理します。具体的には、参照する場合は（[RFC3261]のセクション8.1.3.5を参照）をサポートするか、この拡張を使用することは不本意でない、応答は420（悪い拡張）応答コードを含むであろう要素に送られました。そのドキュメントの状態としては、UAは、この拡張機能を使用せずに要求を再試行することができます。"
    },
    {
      "indent": 0,
      "text": "5.3. Processing a Received REFER",
      "section_title": true,
      "ja": "5.3.  REFERのReceivedの処理"
    },
    {
      "indent": 3,
      "text": "An element receiving a REFER request requiring the 'nosub' extension will use the same admissions policies that would be used without the extension, with the addition that it is acceptable to admit an in-dialog REFER request requiring this extension since it cannot create another usage inside that dialog. In particular, see Section 5.2 of [RFC3515].",
      "ja": "で、ダイアログ、それは別の使用状況を作成することはできませんので、この拡張機能を必要とするREFER要求を認める許容可能であることに加えて、拡張子なしで使用されるのと同じ入学ポリシーを使用します「nosub」拡張子を必要とREFER要求を受信した要素そのダイアログの内部。具体的には、[RFC3515]のセクション5.2を参照。"
    },
    {
      "indent": 3,
      "text": "Accepting a REFER request that requires 'nosub' does not create a dialog or a new usage within an existing dialog. The element MUST NOT create an implicit subscription when accepting the REFER request. Furthermore, the element accepting the REFER request is not required to maintain any state for serving refer event subscriptions.",
      "ja": "「nosub」を要求するREFER要求を受け入れると、既存のダイアログ内のダイアログまたは新しい使用を作成しません。 REFER要求を受け付ける際の要素は、暗黙的なサブスクリプションを作成してはいけません。また、REFER要求を受け付ける要素は、イベントサブスクリプションを参照して提供するための任意の状態を維持するために必要とされません。"
    },
    {
      "indent": 3,
      "text": "If the REFER is received within an existing dialog, the accepting element will not be acting as a SIP-Events notifier in the context of that dialog. If it is not otherwise subject to becoming a notifier in the context of the dialog, none of the requirements in [RFC6665], particularly the requirement to provide a GRUU as the local contact, apply to the message accepting the REFER request.",
      "ja": "REFERが既存のダイアログ内に受信された場合は、受容性元素は、そのダイアログのコンテキストでSIP-イベント通知として機能することはありません。それは対話の文脈における通知になるため、さもなければ対象ではない場合、[RFC6665]の要求のいずれも、ローカルコンタクトとしてGRUUを提供することが特に必要では、REFER要求を受け付けるメッセージに適用されません。"
    },
    {
      "indent": 3,
      "text": "The accepting element will otherwise proceed with the processing defined in [RFC3515].",
      "ja": "受け入れ要素は、そうでなければ、[RFC3515]で定義された処理を進めます。"
    },
    {
      "indent": 0,
      "text": "6. The 'explicitsub' and 'nosub' Option Tags",
      "section_title": true,
      "ja": "6.「explicitsub」と「nosub」オプションタグ"
    },
    {
      "indent": 3,
      "text": "This document defines the 'explicitsub' option tag, used to signal the use of the extension defined in Section 4, and the 'nosub' option tag, used to signal the use of the extension defined in Section 5.",
      "ja": "この文書は、セクション4で定義された拡張機能の使用を通知するために使用される「explicitsub」オプションタグ、およびセクション5で定義された拡張機能の使用を通知するために使用される「nosub」オプションタグを定義します。"
    },
    {
      "indent": 3,
      "text": "The use of either option tag in a Require header field is only defined when it appears in a REFER request or a response to a REFER request. A UA MUST NOT include the 'explicitsub' or 'nosub' option tag in the Require header field of any request other than REFER. A UA MUST NOT include the 'explicitsub' or 'nosub' option tag in the Require header field of any SIP response other than a 200 or 421 response to a REFER request.",
      "ja": "それはREFER要求またはREFER要求に応じて表示されたときに必要とヘッダーフィールドのいずれかでオプションタグの使用のみ定義されます。 UAは、REFER以外の要求の要求ヘッダーフィールドに「explicitsub」または「nosub」オプションタグを含めることはできません。 UAは、REFER要求200または421応答以外の任意のSIP応答のRequireヘッダーフィールドに「explicitsub」または「nosub」オプションタグを含めることはできません。"
    },
    {
      "indent": 3,
      "text": "The 'explicitsub' and 'nosub' option tags MAY appear in the Supported header field of SIP messages and in the sip.extensions feature tag defined in [RFC3840]. This signals only that the UA including the value is aware of the extensions. In particular, a UA can only invoke the use of one of the extensions in a request. A UA MUST NOT include either option tag in the Require header field of a 200 response to a REFER request if that tag was not present in the Require header field of the request. A User Agent Server (UAS) that is processing a REFER request that lists 'explicitsub' or 'nosub' in its Supported header field and wishes to use one of those extensions will return a 421 response indicating which extension is required.",
      "ja": "「explicitsub」と「nosub」オプションタグはSIPメッセージのSupportedヘッダーフィールドにとsip.extensionsに現れるかもしれ[RFC3840]で定義されたタグが付いています。これは、値を含むUAは、拡張子を認識していることだけを通知します。具体的には、UAは、要求内の拡張の1つの使用を呼び出すことができます。そのタグは、要求の要求ヘッダーフィールドに存在しない場合、UAは、REFER要求に対する200応答のRequireヘッダーフィールドにいずれかのオプションタグを含めることはできません。そのサポートされているヘッダフィールドに「explicitsub」または「nosub」をリストし、それらの拡張のいずれかが必要とされる拡張を示す421応答を返すであろう使用したいREFER要求を処理しているユーザエージェントサーバ（UAS）。"
    },
    {
      "indent": 1,
      "text": "7. Updates to",
      "section_title": true,
      "ja": "7.アップデートへ"
    },
    {
      "indent": 3,
      "text": "The requirement in Section 2.4.4 of [RFC3515] to reject out-of-dialog SUBSCRIBE requests to event 'refer' is removed. An element MAY accept a SUBSCRIBE request to event 'refer', following the requirements and guidance in this document. REFER is no longer the only mechanism that can create a subscription to event 'refer'.",
      "ja": "アウト・オブ・ダイアログは「参照してください」イベントにSUBSCRIBEリクエストを拒否する[RFC3515]のセクション2.4.4における要件が削除されます。要素は、この文書の要求事項及び指針以下、「参照してください。」イベントへのSUBSCRIBE要求を受け入れることができます。 REFER「参照してください」はもはやイベントへのサブスクリプションを作成することができます唯一のメカニズムではありません。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations of [RFC3515] all still apply to a REFER request using this extension. The security considerations there for the implicit subscription apply to any explicit subscription for the 'refer' event.",
      "ja": "[RFC3515]のセキュリティ上の考慮事項はすべて、まだこの拡張機能を使用してREFERリクエストに適用されます。暗黙のサブスクリプションがセキュリティ上の考慮事項は、「参照してください」イベントのために明示的なサブスクリプションに適用されます。"
    },
    {
      "indent": 3,
      "text": "This update to RFC 3515 introduces a new authorization consideration. An element receiving an initial SUBSCRIBE request to the 'refer' event needs to decide whether the subscriber should be allowed to see the refer event state. In RFC 3515, this decision was conflated with",
      "ja": "RFC 3515にこのアップデートには、新しい認証対価を紹介します。初期の受光素子には、「参照してください」イベントにSUBSCRIBE要求を加入者が参照するイベントの状態を見ることが許されるべきかどうかを決定する必要があります。 RFC 3515では、この決定はして融合しました"
    },
    {
      "indent": 3,
      "text": "accepting the REFER request, and the only possible subscriber was the element that sent the REFER. With this update, there may be multiple subscribers to any given refer event state.",
      "ja": "要求を参照して、唯一の可能な加入者が参照送信要素た受け入れます。このアップデートにより、イベント状態を指す与えいずれかに複数のサブスクライバがあるかもしれません。"
    },
    {
      "indent": 3,
      "text": "This document allows an element to accept an initial SUBSCRIBE request based on having a Request-URI that identifies existing refer event state. (Such a URI will have previously been sent in the Refer-Events-At header field in a successful REFER response). The element retrieving that URI from the response and any elements that element shares the URI with are authorized to SUBSCRIBE to the event state. Consequently, the URI should be constructed so that it is not easy to guess and should be protected against eavesdroppers when transmitted. [RFC3261] details mechanisms for providing such protection, such as sending SIP messages over Transport Layer Security (TLS) or Datagram TLS (DTLS). See the Security Considerations section of [RFC3261] for considerations when using other security mechanisms. An event server receiving a REFER request over an unprotected transport can redirect the requester to use a protected transport before accepting the request. A good way to ensure that subscriptions use a protected transport is to only construct sips: URIs. The event server can also require any of the additional authorization mechanisms allowed for any SIP request. For example, the event server could require a valid assertion of the subscriber's identity using [RFC4474].",
      "ja": "この文書は、最初のを受け入れる要素がRequest-URIのイベント状態を参照し、既存の識別有することに基づいてSUBSCRIBEリクエストを可能にします。 （そのようなURIは、以前に成功したREFER応答して参照の事象アットヘッダフィールドで送信されてきたであろう）。応答要素共有が許可されているとURIがイベント状態に加入することを任意の要素からそのURIを取得する要素。したがって、URIはそれを推測することは容易ではないように構成されなければならないと送信時に盗聴から保護されなければなりません。 [RFC3261]は、このようなトランスポート層セキュリティ（TLS）またはデータグラムTLS（DTLS）を介してSIPメッセージを送信するよう、このような保護を提供するためのメカニズムを詳しく説明します。他のセキュリティ・メカニズムを使用する場合の考慮事項については、[RFC3261]のセキュリティの考慮事項のセクションを参照してください。保護されていないトランスポート上でREFERリクエストを受信したイベント・サーバーが要求を受け入れる前に保護されたトランスポートを使用するように依頼者をリダイレクトすることができます。 URI：サブスクリプションは、保護されたトランスポートを使用することを確保するための良い方法は、唯一の一口を構築しています。イベント・サーバはまた、任意のSIPリクエストに許さ追加の許可メカニズムのいずれかを要求することができます。例えば、イベント・サーバーは、[RFC4474]を使用して、加入者の身元の有効なアサーションを必要とする可能性があります。"
    },
    {
      "indent": 3,
      "text": "The URI provided in a Refer-Events-At header field will be used as the Request-URI of SUBSCRIBE requests. A malicious agent could take advantage of being able to choose this URI in ways similar to the ways an agent sending a REFER request can take advantage of the Refer-To URI, as described in the Security Considerations section of [RFC3515]. In particular, the malicious agent could cause a SIP SUBSCRIBE to be sent as raw traffic towards a victim. If the victim is not SIP aware and the SUBSCRIBE is sent over UDP, there is (at most) a factor of 11 amplification due to retransmissions of the request. The potential for abuse in this situation is lower than that of the Refer-To URI, since the URI can only have a sip: or sips: scheme, and is only provided in a REFER response. A malicious agent would have to first receive a REFER request to take advantage of providing a Refer-Events-At URI.",
      "ja": "参照の事象アットヘッダフィールド内に設けられたURIは、SUBSCRIBE要求のRequest-URIとして使用されます。悪意のあるエージェントは、[RFC3515]のSecurity Considerations部で説明したようにREFERリクエストを送信するエージェントは、参照してください-にURIを利用することができる方法に類似の方法でこのURIを選択することができる利点を取ることができます。特に、悪意のあるエージェントは、SIPは、被害者への生のトラフィックとして送信されるSUBSCRIBE引き起こす可能性があります。被害者が意識SIPされていないとSUBSCRIBE UDP経由で送信された場合、原因要求の再送信に11の増幅率（最大で）があります。または一口：このような状況での乱用の可能性を参照してください-にURI、URIが唯一の一口を持つことができるので、より低い方式で、かつ唯一のREFER応答して提供されます。悪意のあるエージェントが最初に参照してください-イベント-でURIを提供するという利点を取るためにREFERリクエストを受信しなければなりません。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "9.1. Register the 'explicitsub' Option Tag",
      "section_title": true,
      "ja": "9.1.  「explicitsub」オプションタグを登録します"
    },
    {
      "indent": 3,
      "text": "The option tag 'explicitsub' has been registered in the 'Option Tags' subregistry of the 'Session Initiation Protocol (SIP) Parameters' registry by adding a row with these values:",
      "ja": "オプションタグ「explicitsub」は、これらの値を持つ行を追加することによって、「セッション開始プロトコル（SIP）パラメータ」レジストリの「オプションタグ」副登録に登録されています。"
    },
    {
      "indent": 3,
      "text": "Name: explicitsub",
      "ja": "名前：explicitsub"
    },
    {
      "indent": 3,
      "text": "Description: This option tag identifies an extension to REFER to suppress the implicit subscription and provide a URI for an explicit subscription.",
      "ja": "説明：このオプションタグは、暗黙的なサブスクリプションを抑制し、明示的なサブスクリプションのためのURIを提供するために、参照するために拡張機能を識別します。"
    },
    {
      "indent": 3,
      "text": "Reference: RFC 7614 (this document)",
      "ja": "参考：RFC 7614（本書）"
    },
    {
      "indent": 0,
      "text": "9.2. Register the 'nosub' Option Tag",
      "section_title": true,
      "ja": "9.2.  「nosub」オプションタグを登録します"
    },
    {
      "indent": 3,
      "text": "The option tag 'nosub' has been registered in the 'Option Tags' subregistry of the 'Session Initiation Protocol (SIP) Parameters' registry by adding a row with these values:",
      "ja": "オプションタグ「nosub」は、これらの値を持つ行を追加することによって、「セッション開始プロトコル（SIP）パラメータ」レジストリの「オプションタグ」副登録に登録されています。"
    },
    {
      "indent": 3,
      "text": "Name: nosub",
      "ja": "名前：nosub"
    },
    {
      "indent": 3,
      "text": "Description: This option tag identifies an extension to REFER to suppress the implicit subscription and indicate that no explicit subscription is forthcoming.",
      "ja": "説明：このオプションタグは、暗黙的なサブスクリプションを抑制するために参照するために拡張機能を識別し、明示的なサブスクリプションが迫っていないことを示しています。"
    },
    {
      "indent": 3,
      "text": "Reference: RFC 7614 (this document)",
      "ja": "参考：RFC 7614（本書）"
    },
    {
      "indent": 0,
      "text": "9.3. Register the Refer-Events-At Header Field",
      "section_title": true,
      "ja": "9.3. 参照してください-イベントアットヘッダーフィールドを登録します"
    },
    {
      "indent": 3,
      "text": "The header field described in Section 4.8 has been registered in the 'Header Fields' subregistry of the 'Session Initiation Protocol (SIP) Parameters' registry by adding a row with these values:",
      "ja": "セクション4.8で説明ヘッダーフィールドは、これらの値を持つ行を追加することによって、「セッション開始プロトコル（SIP）パラメータ」レジストリの「ヘッダフィールド」副登録に登録されています。"
    },
    {
      "indent": 3,
      "text": "Header Name: Refer-Events-At",
      "ja": "ヘッダー名：参照してください-イベントアット"
    },
    {
      "indent": 3,
      "text": "compact: none",
      "ja": "コンパクト：骨"
    },
    {
      "indent": 3,
      "text": "Reference: RFC 7614 (this document)",
      "ja": "参考：RFC 7614（本書）"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, DOI 10.17487/RFC3261, June 2002, <http://www.rfc-editor.org/info/rfc3261>.",
      "ja": "[RFC3261]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\" 、RFC 3261、DOI 10.17487 / RFC3261、2002年6月、<http://www.rfc-editor.org/info/rfc3261>。"
    },
    {
      "indent": 3,
      "text": "[RFC3515] Sparks, R., \"The Session Initiation Protocol (SIP) Refer Method\", RFC 3515, DOI 10.17487/RFC3515, April 2003, <http://www.rfc-editor.org/info/rfc3515>.",
      "ja": "[RFC3515]スパークス、R.、 \"セッション開始プロトコル（SIP）メソッドを参照してください\"、RFC 3515、DOI 10.17487 / RFC3515、2003年4月、<http://www.rfc-editor.org/info/rfc3515>。"
    },
    {
      "indent": 3,
      "text": "[RFC3840] Rosenberg, J., Schulzrinne, H., and P. Kyzivat, \"Indicating User Agent Capabilities in the Session Initiation Protocol (SIP)\", RFC 3840, DOI 10.17487/RFC3840, August 2004, <http://www.rfc-editor.org/info/rfc3840>.",
      "ja": "[RFC3840]ローゼンバーグ、J.、Schulzrinneと、H.、およびP. Kyzivat、RFC 3840 \"セッション開始プロトコル（SIP）でユーザエージェントの能力を示す\"、DOI 10.17487 / RFC3840、2004年8月、<のhttp：// WWW .rfc-editor.org /情報/ rfc3840>。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, DOI 10.17487/RFC5234, January 2008, <http://www.rfc-editor.org/info/rfc5234>.",
      "ja": "[RFC5234]クロッカー、D.、エド。そして、P. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、STD 68、RFC 5234、DOI 10.17487 / RFC5234、2008年1月、<http://www.rfc-editor.org/info/rfc5234>。"
    },
    {
      "indent": 3,
      "text": "[RFC6665] Roach, A., \"SIP-Specific Event Notification\", RFC 6665, DOI 10.17487/RFC6665, July 2012, <http://www.rfc-editor.org/info/rfc6665>.",
      "ja": "[RFC6665]ローチ、A.、 \"SIP固有のイベント通知\"、RFC 6665、DOI 10.17487 / RFC6665、2012年7月、<http://www.rfc-editor.org/info/rfc6665>。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3903] Niemi, A., Ed., \"Session Initiation Protocol (SIP) Extension for Event State Publication\", RFC 3903, DOI 10.17487/RFC3903, October 2004, <http://www.rfc-editor.org/info/rfc3903>.",
      "ja": "[RFC3903]ニエミ、A.編、 \"セッション開始プロトコル（SIP）のイベントステート発行のための拡張\"、RFC 3903、DOI 10.17487 / RFC3903、2004年10月、<http://www.rfc-editor.org/info / rfc3903>。"
    },
    {
      "indent": 3,
      "text": "[RFC4321] Sparks, R., \"Problems Identified Associated with the Session Initiation Protocol's (SIP) Non-INVITE Transaction\", RFC 4321, DOI 10.17487/RFC4321, January 2006, <http://www.rfc-editor.org/info/rfc4321>.",
      "ja": "[RFC4321]スパークス、R.、RFC 4321、DOI 10.17487 / RFC4321、2006年1月、<http://www.rfc-editor.org/ \"セッション開始プロトコルの（SIP）非INVITEトランザクションに関連付けられた特定された問題\"情報/ rfc4321>。"
    },
    {
      "indent": 3,
      "text": "[RFC4474] Peterson, J. and C. Jennings, \"Enhancements for Authenticated Identity Management in the Session Initiation Protocol (SIP)\", RFC 4474, DOI 10.17487/RFC4474, August 2006, <http://www.rfc-editor.org/info/rfc4474>.",
      "ja": "[RFC4474]ピーターソン、J.とC.ジェニングス、RFC 4474 \"セッション開始プロトコルで認証されたアイデンティティ管理（SIP）のための機能強化\"、DOI 10.17487 / RFC4474、2006年8月、<のhttp：//www.rfc-editor。組織/情報/ rfc4474>。"
    },
    {
      "indent": 3,
      "text": "[RFC4538] Rosenberg, J., \"Request Authorization through Dialog Identification in the Session Initiation Protocol (SIP)\", RFC 4538, DOI 10.17487/RFC4538, June 2006, <http://www.rfc-editor.org/info/rfc4538>.",
      "ja": "[RFC4538]ローゼンバーグ、J.、 \"セッション開始プロトコル（SIP）におけるダイアログ識別介して要求承認\"、RFC 4538、DOI 10.17487 / RFC4538、2006年6月<http://www.rfc-editor.org/info/ rfc4538>。"
    },
    {
      "indent": 3,
      "text": "[RFC5057] Sparks, R., \"Multiple Dialog Usages in the Session Initiation Protocol\", RFC 5057, DOI 10.17487/RFC5057, November 2007, <http://www.rfc-editor.org/info/rfc5057>.",
      "ja": "[RFC5057]は、 \"セッション開始プロトコルの複数の対話用法\"、RFC 5057は、R.、スパークス、DOI 10.17487 / RFC5057、2007年11月、<http://www.rfc-editor.org/info/rfc5057>。"
    },
    {
      "indent": 3,
      "text": "[RFC5589] Sparks, R., Johnston, A., Ed., and D. Petrie, \"Session Initiation Protocol (SIP) Call Control - Transfer\", BCP 149, RFC 5589, DOI 10.17487/RFC5589, June 2009, <http://www.rfc-editor.org/info/rfc5589>.",
      "ja": "[RFC5589]は、R.、ジョンストン、A.、エド・スパークス、およびD.ペトリー、 \"セッション開始プロトコル（SIP）呼制御 - 転送\"、BCP 149、RFC 5589、DOI 10.17487 / RFC5589、2009年6月、<HTTP ：//www.rfc-editor.org/info/rfc5589>。"
    },
    {
      "indent": 3,
      "text": "[RFC5627] Rosenberg, J., \"Obtaining and Using Globally Routable User Agent URIs (GRUUs) in the Session Initiation Protocol (SIP)\", RFC 5627, DOI 10.17487/RFC5627, October 2009, <http://www.rfc-editor.org/info/rfc5627>.",
      "ja": "[RFC5627]ローゼンバーグ、J.、2009年10月、RFC 5627、DOI 10.17487 / RFC5627、 \"セッション開始プロトコル（SIP）でグローバルにルーティング可能なユーザエージェントのURI（GRUUs）の取得と使用\"、<のhttp：//www.rfc- editor.org/info/rfc5627>。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Robert Sparks Oracle 7460 Warren Parkway, Suite 300 Frisco, Texas 75034 United States",
      "ja": "ロバートは、Oracle 7460ウォーレン・パークウェイ、スイート300スパークスフリスコ、テキサス75034米国"
    },
    {
      "indent": 3,
      "text": "Email: rjsparks@nostrum.com",
      "ja": "メール：rjsparks@nostrum.com"
    }
  ]
}