{
  "title": {
    "text": "RFC 7102 - Terms Used in Routing for Low-Power and Lossy Networks",
    "ja": "RFC 7102 - 低消費電力とロッシーネットワークのルーティングに使用される用語"
  },
  "number": 7102,
  "created_at": "2019-10-28 15:32:52.099372+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       JP. Vasseur\nRequest for Comments: 7102                           Cisco Systems, Inc.\nCategory: Informational                                     January 2014\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 9,
      "text": "Terms Used in Routing for Low-Power and Lossy Networks",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document provides a glossary of terminology used in routing requirements and solutions for networks referred to as Low-Power and Lossy Networks (LLNs). An LLN is typically composed of many embedded devices with limited power, memory, and processing resources interconnected by a variety of links. There is a wide scope of application areas for LLNs, including industrial monitoring, building automation (e.g., heating, ventilation, air conditioning, lighting, access control, fire), connected home, health care, environmental monitoring, urban sensor networks, energy management, assets tracking, and refrigeration.",
      "ja": "この文書では、低消費電力とロッシーネットワーク（LLNs）と呼ばれるネットワークの要件とソリューションのルーティングに使用される用語の用語集を提供します。 LLNは、典型的には、リンクの様々な相互接続限られた電力、メモリおよび処理リソースを有する多くの組み込み機器で構成されています。工業用監視、ビルオートメーション（例えば、暖房、換気、空調、照明、アクセスコントロール、火災）、接続されている家庭、医療、環境モニタリング、都市センサネットワーク、エネルギー管理を含むLLNsのための応用分野の広い範囲があります、資産の追跡、および冷凍。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7102.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7102で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................3\n3. Security Considerations .........................................7\n4. Acknowledgements ................................................7\n5. Informative References ..........................................7",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document provides a glossary of terminology used in routing requirements and solutions for networks referred to as Low-Power and Lossy Networks (LLNs).",
      "ja": "この文書では、低消費電力とロッシーネットワーク（LLNs）と呼ばれるネットワークの要件とソリューションのルーティングに使用される用語の用語集を提供します。"
    },
    {
      "indent": 3,
      "text": "LLNs are typically composed of many embedded devices with limited power, memory, and processing resources interconnected by a variety of links, such as IEEE 802.15.4 or low-power Wi-Fi. There is a wide scope of application areas for LLNs, including industrial monitoring, building automation (heating, ventilation, air conditioning, lighting, access control, fire), connected home, health care, environmental monitoring, urban sensor networks, energy management, assets tracking, and refrigeration.",
      "ja": "LLNsは、典型的には、IEEE 802.15.4または低電力のWi-Fiのような限られた電力、メモリ、及びリンクの様々な相互接続された処理リソースと多くの組み込み装置、から構​​成されています。工業用監視、ビルオートメーション（暖房、換気、空調、照明、アクセスコントロール、火災）、接続されている家庭、医療、環境モニタリング、都市センサネットワーク、エネルギー管理、資産を含むLLNsのための応用分野の広い範囲があります追跡、および冷凍。"
    },
    {
      "indent": 3,
      "text": "Since these applications are usually highly specific (for example, industrial automation, building automation, etc.), it is not uncommon to see a number of disparate terms used to describe the same device or functionality. Thus, in order to avoid confusion or discrepancies, this document specifies the common terminology to be used in all ROLL working group documents. The terms defined in this document are used in [RFC5548], [RFC5673], [RFC5826], and [RFC5867].",
      "ja": "これらのアプリケーションは、通常、（例えば、工業オートメーション、ビルディングオートメーション、等のために）高度に特異的であるので、同一のデバイスまたは機能を記述するために使用される異なる用語の数を見ることが珍しくありません。このように、混乱や矛盾を避けるために、この文書は、すべてROLLワーキンググループ文書で使用される一般的な用語を指定します。本書で定義された用語は、[RFC5548]、[RFC5673]、[RFC5826]及び[RFC5867]に使用されています。"
    },
    {
      "indent": 3,
      "text": "Terminology specific to a particular application is out of the scope of this document.",
      "ja": "特定のアプリケーションに固有の用語は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "It is expected that all routing documents defining requirements or specifying solutions for LLN will use the common terminology specified in this document. This document should be listed as an informative reference.",
      "ja": "すべてのルーティングドキュメントが要件を定義するか、この文書で指定された一般的な用語を使用しますLLNのための解決策を指定することが期待されます。この文書は情報の参照として表示されます。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "Actuator: A field device that controls a set of equipment. For example, an actuator might control and/or modulate the flow of a gas or liquid, control electricity distribution, perform a mechanical operation, etc.",
      "ja": "アクチュエータ：機器のセットを制御し、フィールド機器。例えば、アクチュエータは制御及び/又は気体または液体の流れを調節する、配電を制御する機械的な操作を実行するかもしれない、など"
    },
    {
      "indent": 3,
      "text": "AMI: Advanced Metering Infrastructure. Makes use of Smart Grid technologies. A canonical Smart Grid application is smart-metering.",
      "ja": "AMI：高度計測インフラ。スマートグリッド技術を利用します。標準的なスマートグリッド・アプリケーションは、スマートメーターです。"
    },
    {
      "indent": 3,
      "text": "Channel: Radio frequency sub-band used to transmit a modulated signal carrying packets.",
      "ja": "チャンネル：パケットを搬送する変調された信号を送信するために使用される無線周波数サブバンド。"
    },
    {
      "indent": 3,
      "text": "Channel Hopping: A procedure by which field devices synchronously change channels during operation.",
      "ja": "チャンネルホッピング：フィールドデバイスが同期動作中のチャンネルを変更する手順。"
    },
    {
      "indent": 3,
      "text": "Commissioning Tool: Any physical or logical device temporarily added to the network for the express purpose of setting up the network and device operational parameters. The commissioning tool can also be temporarily added to the LLN for scheduled or unscheduled maintenance.",
      "ja": "コミッショニングツール：一時的にネットワークおよびデバイスの動作パラメータを設定する明確な目的のためにネットワークに追加された物理的または論理的デバイス。試運転ツールは、一時的に、スケジュールや予定外のメンテナンスのためLLNに追加することができます。"
    },
    {
      "indent": 3,
      "text": "Closed Loop Control: A procedure whereby a device controller controls an actuator based on input information sensed by one or more field devices.",
      "ja": "閉ループ制御：デバイス・コントローラは、1つまたは複数のフィールドデバイスによって感知された入力情報に基づいてアクチュエータを制御することにより、手順。"
    },
    {
      "indent": 3,
      "text": "Controller: A field device that can receive sensor input and automatically change the environment in the facility by manipulating digital or analog actuators.",
      "ja": "コントローラ：センサー入力を受信し、自動的にデジタルまたはアナログアクチュエータを操作することにより、施設内の環境を変更することができるフィールド装置。"
    },
    {
      "indent": 3,
      "text": "DA: Distribution Automation. Part of Smart Grid. Encompasses technologies for maintenance and management of electrical distribution systems.",
      "ja": "DA：配電自動化。スマートグリッドの一部。配電システムの保守・管理のための技術を包含する。"
    },
    {
      "indent": 3,
      "text": "DAG: Directed Acyclic Graph. A directed graph with no directed cycles (a graph formed by a collection of vertices and directed edges where each edge connects one vertex to another, such that there is no way to start at some vertex v and follow a sequence of edges that eventually loops back to vertex v again).",
      "ja": "DAG：有向非循環グラフ。いくつかの頂点vで開始し、最終的にループバックエッジのシーケンスを追跡する方法がないように、無指向サイクル（頂点と各エッジは別の頂点を結ぶ有向辺の集合によって形成されたグラフ、を有する有向グラフ）再び頂点vへ。"
    },
    {
      "indent": 3,
      "text": "Data sink: A device that collects data from nodes in an LLN.",
      "ja": "データシンク：LLNのノードからデータを収集する装置。"
    },
    {
      "indent": 3,
      "text": "Downstream: Data direction traveling from outside of the LLN (e.g., traffic coming from a LAN, WAN, or the Internet) via an LLN Border Router (LBR), or in general, \"deeper\" in the Directed Acyclic Graph computed by the routing protocol.",
      "ja": "下流：データLLNの外側から進行方向（例えば、LAN、WAN、またはインターネットからのトラフィック）LLN境界ルータを経由して（LBR）は、あるいは一般的に、「より深い」循環有向グラフ内では、ルーティングによって計算しますプロトコル。"
    },
    {
      "indent": 3,
      "text": "Field Device: A field device is a physical device placed in the network's operating environment (e.g., plant, urban area, or home). Field devices include sensors and actuators as well as routers and Low-Power and Lossy Network Border Routers (LBRs). A field device is usually (but not always) a device with constrained CPU, memory footprint, storage capacity, bandwidth, and sometimes power (battery operated). At the time of writing, for the sake of illustration, a typical sensor or actuator would have a few Kilobytes of RAM, a few dozens of Kilobytes of ROM/Flash memory, a 8-/16-/32-bit microcontroller, and communication capabilities ranging from a few kbits/s to a few hundred kbits/s. Although continuous improvement of hardware and software technologies is expected, such devices will likely continue to be seen as resource-constrained devices compared to computers and routers used in the rest of the Internet.",
      "ja": "フィールド機器：フィールドデバイスは、ネットワークの動作環境（例えば、植物、都市エリア、又は家庭）に配置された物理デバイスです。フィールド装置は、センサおよびアクチュエータ、並びにルータと低消費電力とロッシーネットワーク境界ルータ（のLBR）が挙げられます。フィールドデバイスは、（常にではない）通常制約CPU、メモリフットプリント、記憶容量、帯域幅、及び時々電源（電池式）を有する装置です。執筆時点では、説明のために、典型的なセンサやアクチュエータがRAMの数キロバイト、ROM /フラッシュメモリ、8/16/32ビットマイクロコントローラ、および通信のキロバイトの数十を持っているでしょうキロビット/秒数から数百キロビット/秒までの機能を提供します。ハードウェアとソフトウェア技術の継続的な向上が期待されているが、このようなデバイスは、おそらくインターネットの残りの部分で使用されるコンピュータやルータに比べてリソースに制約のあるデバイスとして見られることを継続します。"
    },
    {
      "indent": 3,
      "text": "Flash Memory: non-volatile memory that can be re-programmed.",
      "ja": "フラッシュメモリ：再度プログラム可能な不揮発性メモリ。"
    },
    {
      "indent": 3,
      "text": "FMS: Facility Management System. A global term applied across all the vertical designations within a building, including heating, ventilation, and air conditioning (also referred to as HVAC), fire, security, lighting, and elevator control.",
      "ja": "FMS：施設管理システム。暖房、換気、および空調（HVACもとも称される）、火災、セキュリティ、照明、エレベータ制御を含む建物内の全ての垂直名称、両端に印加されるグローバル用語。"
    },
    {
      "indent": 3,
      "text": "HART: Highway Addressable Remote Transducer. A group of specifications for industrial process and control devices administered by the HART Foundation (see [HART]). The latest version for the specifications is HART7, which includes the additions for WirelessHART.",
      "ja": "HART：高速アドレスリモートトランスデューサ。 HART財団によって投与工業プロセス及び制御装置の仕様のグループ（[HART]参照）。仕様の最新バージョンは、のWirelessHARTのための添加物を含んでHART7、です。"
    },
    {
      "indent": 3,
      "text": "HVAC: Heating, Ventilation, and Air Conditioning. A term applied to mechanisms used to maintain the comfort level of an internal space.",
      "ja": "HVAC：暖房、換気、空調。内部空間の快適さのレベルを維持するために使用されるメカニズムに適用される用語。"
    },
    {
      "indent": 3,
      "text": "ISA: International Society of Automation. An ANSI accredited standards-making society. ISA100 is an ISA committee whose charter includes defining a family of standards for industrial automation. [ISA100.11a] is a working group within ISA100 that is working on a standard for monitoring and non-critical process-control applications.",
      "ja": "ISA：オートメーションの国際学会。 ANSI認定基準作り社会。 ISA100は、その憲章産業オートメーションのための規格のファミリーを定義することを含むISA委員会です。 【ISA100.11aの】監視および非クリティカルプロセス制御アプリケーションのための標準に取り組んでISA100内のワーキンググループです。"
    },
    {
      "indent": 3,
      "text": "LAN: Local Area Network.",
      "ja": "LAN：ローカルエリアネットワーク。"
    },
    {
      "indent": 3,
      "text": "LBR: Low-Power and Lossy Network Border Router. A device that connects the Low-Power and Lossy Network to another routing domain such as a LAN, a WAN, or the Internet where a different routing protocol may be in operation. The LBR acts as a routing device and may possibly host other functions such as data collector or aggregator.",
      "ja": "LBR：低消費電力とロッシーネットワーク境界ルータ。そのようなLAN、WAN、または異なるルーティングプロトコルが動作中であってもよいインターネットのような他のルーティングドメインに低消費電力とロッシーネットワークを接続するデバイス。 LBRは、ルーティング装置として機能し、おそらく、データコレクタまたはアグリゲータなどの他の機能をホストすることができます。"
    },
    {
      "indent": 3,
      "text": "LLN: Low-Power and Lossy Network. Typically composed of many embedded devices with limited power, memory, and processing resources interconnected by a variety of links, such as IEEE 802.15.4 or low-power Wi-Fi. There is a wide scope of application areas for LLNs, including industrial monitoring, building automation (HVAC, lighting, access control, fire), connected home, health care, environmental monitoring, urban sensor networks, energy management, assets tracking, and refrigeration.",
      "ja": "LLN：低消費電力とロッシーネットワーク。典型的には、IEEE 802.15.4または低電力のWi-Fiなどのリンクの様々な相互接続限られた電力、メモリおよび処理リソースを有する多くの組み込み装置、からなります。産業用モニタリングなどLLNs、のための応用分野の広い範囲は、オートメーション（HVAC、照明、アクセスコントロール、火災）、接続されている家庭、医療、環境モニタリング、都市センサネットワーク、エネルギー管理、資産の追跡、および冷蔵を構築し、そこにあります。"
    },
    {
      "indent": 3,
      "text": "MP2P: Multipoint-to-Point. Used to describe a particular traffic pattern (e.g., MP2P flows collecting information from many nodes flowing upstream towards a collecting sink or an LBR).",
      "ja": "MP2P：マルチポイントツーポイント。特定のトラフィックパターンを記述するために使用される（例えば、MP2Pは収集シンク又はLBRに向かって上流に流れる多数のノードから情報を収集するフロー）。"
    },
    {
      "indent": 3,
      "text": "MAC: Medium Access Control. Refers to algorithms and procedures used by the data link layer to coordinate use of the physical layer.",
      "ja": "MAC：媒体アクセス制御。物理層の使用を調整するためにデータリンク層によって用いられるアルゴリズムと手順を指します。"
    },
    {
      "indent": 3,
      "text": "Non-Sleepy Node: A node that always remains in a fully powered-on state (i.e., always awake) where it has the capability to perform communication.",
      "ja": "非スリーピーノード：常に完全にパワーオンの状態のままノード（すなわち、常にアウェイク）が通信を行う能力を有します。"
    },
    {
      "indent": 3,
      "text": "Open Loop Control: A process whereby a plant operator manually manipulates an actuator over the network where the decision is influenced by information sensed by field devices.",
      "ja": "ループ制御を開く：プラントオペレータが手動で決定は、フィールドデバイスによって感知された情報に影響されるネットワークを介してアクチュエータを操作するプロセスを。"
    },
    {
      "indent": 3,
      "text": "PER: Packet Error Rate. A ratio of the number of unusable packets (not received at all or received in error, even after any applicable error correction has been applied) to the total number of packets that would have been received in the absence of errors.",
      "ja": "PER：パケットエラーレート。エラーが存在しない状態で受信されていたパケットの総数に（該当するエラー訂正が適用された後でも、全てあるいはエラーで受信で受信されていない）使用不能パケット数の割合。"
    },
    {
      "indent": 3,
      "text": "P2P: Point To Point. Refers to traffic exchanged between two nodes (regardless of the number of hops between the two nodes).",
      "ja": "P2P：ポイントツーポイント。トラフィックを指す（かかわらず、2つのノード間のホップ数の）2つのノード間で交換しました。"
    },
    {
      "indent": 3,
      "text": "P2MP: Point-to-Multipoint. Refers to traffic between one node and a set of nodes. This is similar to the P2MP concept in Multicast or MPLS Traffic Engineering ([RFC4461]and [RFC4875]). A common use case for the Routing Protocol for Low-Power and Lossy Networks (RPL) involves P2MP flows from or through a DAG root outward towards other nodes contained in the DAG.",
      "ja": "P2MP：ポイントツーマルチポイント。一つのノードとノードのセット間のトラフィックを指します。これは、マルチキャストまたはMPLSトラフィックエンジニアリング（[RFC4461]と[RFC4875]）でP2MPの概念に似ています。低消費電力と非可逆ネットワークのためのルーティングプロトコル（RPL）のための一般的なユースケースは、P2MPが外側DAGに含まれる他のノードに向かってDAGのルートから、または流れることを含みます。"
    },
    {
      "indent": 3,
      "text": "RAM: Random Access Memory. A volatile memory.",
      "ja": "RAM：ランダムアクセスメモリ。不揮発性メモリ。"
    },
    {
      "indent": 3,
      "text": "RFID: Radio Frequency IDentification.",
      "ja": "RFID：無線周波数識別。"
    },
    {
      "indent": 3,
      "text": "ROM: Read-Only Memory.",
      "ja": "ROM：リードオンリーメモリ。"
    },
    {
      "indent": 3,
      "text": "ROLL: Routing Over Low-Power and Lossy Networks.",
      "ja": "ROLL：低消費電力とロッシーネットワーク上でルーティング。"
    },
    {
      "indent": 3,
      "text": "RPL: An IPv6 Routing Protocol for Low-Power and Lossy Networks that provides a mechanism whereby multipoint-to-point traffic from devices inside the LLN towards a central control point as well as point-to-multipoint traffic from the central control point to the devices inside the LLN are supported. RPL also supports point-to-point traffic between any arbitrary nodes in the LLN.",
      "ja": "RPL：これによりマルチポイントツーポイントの中央制御点に向けLLN内部デバイスからのトラフィックだけでなく、ポイント・ツー・マルチポイントトラフィック中央制御点からするメカニズムを提供する低消費電力と非可逆ネットワークのIPv6ルーティングプロトコルLLN内部のデバイスがサポートされています。 RPLはまたLLNにおける任意のノード間のポイントツーポイントトラフィックをサポートします。"
    },
    {
      "indent": 3,
      "text": "RPL Domain: A collection of RPL routers under the control of a single administration. The boundaries of routing domains are defined by network management by setting some links to be exterior, or inter-domain, links.",
      "ja": "RPLドメイン：単回投与の制御下RPLルータのコレクション。ルーティングドメインの境界は、リンク外装、またはドメイン間であることをいくつかのリンクを設定することにより、ネットワーク管理によって定義されています。"
    },
    {
      "indent": 3,
      "text": "Schedule: An agreed execution, wake-up, transmission, reception, etc., timetable between two or more field devices.",
      "ja": "スケジュール：合意の実行、ウェイクアップ、送信、受信、など、二つ以上のフィールドデバイス間の時刻表。"
    },
    {
      "indent": 3,
      "text": "Sensor: A device that measures a physical quantity and converts it to an analog or digital signal that can be read by a program or a user. Sensed data can be of many types: electromagnetic (e.g., current, voltage, power, or resistance), mechanical (e.g., pressure, flow, liquid density, or humidity), chemical (e.g., oxygen or carbon monoxide), acoustic (e.g., noise or ultrasound), etc.",
      "ja": "センサ：物理量を測定し、プログラムまたはユーザによって読み取ることができ、アナログまたはデジタル信号に変換するデバイス。電磁（例えば、電流、電圧、電力、又は抵抗性）、機械的（例えば、圧力、流量、液体の密度、又は湿度）、化学的（例えば、酸素又は一酸化炭素）、音響（例：感知されたデータは、多くの種類のものとすることができます、ノイズまたは超音波）、等"
    },
    {
      "indent": 3,
      "text": "Sleepy Node: A node that may sometimes go into a sleep mode (i.e., go into a low-power state to conserve power) and temporarily suspend protocol communication. When not in sleep mode, the sleepy node is in a fully powered-on state where it has the capability to perform communication.",
      "ja": "眠いノード：時々スリープモードに入ることができるノードは、一時的プロトコル通信を中断（すなわち、電力を節約するために低電力状態に入ります）。ないときにスリープモードで、眠いノードは、通信を行う能力を有する完全にパワーオン状態になっています。"
    },
    {
      "indent": 3,
      "text": "Smart Grid: A broad class of applications to network and automate utility infrastructure.",
      "ja": "スマートグリッド：ユーティリティインフラストラクチャをネットワークおよび自動化するアプリケーションの幅広いクラス。"
    },
    {
      "indent": 3,
      "text": "Timeslot: A fixed time interval that may be used for the transmission or reception of a packet between two field devices. A timeslot used for communications is associated with a slotted-link.",
      "ja": "タイムスロット：2つのフィールドデバイスとの間のパケットの送受信のために使用することができる一定の時間間隔。通信に使用されるタイムスロットは、スロット付きリンクに関連付けられています。"
    },
    {
      "indent": 3,
      "text": "Upstream: Data direction traveling from the LLN via the LBR to outside of the LLN (LAN, WAN, or Internet) or generally closer to the root of the DAG computed by the routing protocol.",
      "ja": "上流：LLN（LAN、WAN、またはインターネット）または一般ルーティングプロトコルによって計算DAGのルートに近い外にLBRを介しLLNから走行データ方向。"
    },
    {
      "indent": 3,
      "text": "WAN: Wide Area Network.",
      "ja": "WAN：広域ネットワークを。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Since this document specifies terminology and does not specify new procedures or protocols, it raises no new security issues.",
      "ja": "この文書は、専門用語を指定し、新しい手順やプロトコルを指定していないので、それはどんな新しい安全保障問題も提起しません。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgements",
      "section_title": true,
      "ja": "4.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Christian Jacquenet, Tim Winter, Pieter De Mil, David Meyer, Mukul Goyal, and Abdussalam Baryun for their valuable feedback.",
      "ja": "著者は、彼らの貴重なフィードバックのためのキリスト教Jacquenet、ティム冬、ピーテル・デ・ミル、デビッド・マイヤー、Mukul Goyal氏、およびアブドゥッサラームBaryunに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "5. Informative References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 3,
      "text": "[HART] HART Communication Foundation, <http://www.hartcomm.org>.",
      "ja": "[HART] HARTコミュニケーション財団、<http://www.hartcomm.org>。"
    },
    {
      "indent": 3,
      "text": "[ISA100.11a] ISA, \"Wireless systems for industrial automation: Process control and related applications\", ISA 100.11a, May 2008, <http://www.isa.org/Community/ SP100WirelessSystemsforAutomation>.",
      "ja": "[ISA100.11aの] ISA、 \"産業オートメーション用無線システム：プロセス制御および関連アプリケーション\"、ISAの100.11a、2008年5月、<http://www.isa.org/Community/ SP100WirelessSystemsforAutomation>。"
    },
    {
      "indent": 3,
      "text": "[RFC4461] Yasukawa, S., Ed., \"Signaling Requirements for Point-to-Multipoint Traffic-Engineered MPLS Label Switched Paths (LSPs)\", RFC 4461, April 2006.",
      "ja": "[RFC4461]安川、S.、エド。、2006 4月には、RFC 4461、「ポイントツーマルチポイントトラフィック・エンジニアMPLSラベルのためのシグナリング要件は、スイッチパス（LSP）」。"
    },
    {
      "indent": 3,
      "text": "[RFC4875] Aggarwal, R., Ed., Papadimitriou, D., Ed., and S. Yasukawa, Ed., \"Extensions to Resource Reservation Protocol - Traffic Engineering (RSVP-TE) for Point-to-Multipoint TE Label Switched Paths (LSPs)\", RFC 4875, May 2007.",
      "ja": "[RFC4875]アガルワルは、R.、エド、Papadimitriou、D.、エド、およびS.安川、エド、「リソース予約プロトコルへの拡張 - 。。。は、ポイント・ツー・マルチポイントTEラベルのためのトラフィックエンジニアリング（RSVP-TE）は、スイッチパス（LSPを）」、RFC 4875、2007年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5548] Dohler, M., Ed., Watteyne, T., Ed., Winter, T., Ed., and D. Barthel, Ed., \"Routing Requirements for Urban Low-Power and Lossy Networks\", RFC 5548, May 2009.",
      "ja": "[RFC5548]のDohler、M.編、Watteyne、T.、エド。、冬、T.、エド。、及びD.バーセル、編、 \"都市低消費電力と非可逆ネットワークのルーティング要件\"、RFC 5548 、2009年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5673] Pister, K., Ed., Thubert, P., Ed., Dwars, S., and T. Phinney, \"Industrial Routing Requirements in Low-Power and Lossy Networks\", RFC 5673, October 2009.",
      "ja": "[RFC5673]ピスター教授、K.、エド。、Thubert、P.、エド。、Dwars、S.、およびT.フィニー、 \"低消費電力とロッシーネットワークにおける産業ルーティング要件\"、RFC 5673、2009年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5826] Brandt, A., Buron, J., and G. Porcu, \"Home Automation Routing Requirements in Low-Power and Lossy Networks\", RFC 5826, April 2010.",
      "ja": "[RFC5826]ブラント、A.、Buron、J.、およびG. Porcu、 \"低消費電力とロッシーネットワークにおけるホーム・オートメーションルーティング要件\"、RFC 5826、2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5867] Martocci, J., Ed., De Mil, P., Riou, N., and W. Vermeylen, \"Building Automation Routing Requirements in Low-Power and Lossy Networks\", RFC 5867, June 2010.",
      "ja": "[RFC5867] Martocci、J.、エド。、デ・ミル、P.、Riouの、N.、およびW. Vermeylen、 \"低消費電力とロッシーネットワークにおけるビルオートメーションルーティング要件\"、RFC 5867、2010年6月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "JP. Vasseur Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA 01719 US",
      "ja": "JP。 Vasseurシスコシステムズ株式会社1414年マサチューセッツアベニューボックスボロー、MA 01719米国"
    },
    {
      "indent": 3,
      "text": "EMail: jpv@cisco.com",
      "ja": "メールアドレス：jpv@cisco.com"
    }
  ]
}