{
  "title": {
    "text": "RFC 7673 - Using DNS-Based Authentication of Named Entities (DANE) TLSA Records with SRV Records",
    "ja": "RFC 7673 - SRVレコードで名前付きエンティティ（DANE）TLSAレコードのDNSベースの認証を使用して、"
  },
  "number": 7673,
  "created_at": "2019-11-01 01:49:11.278655+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          T. Finch\nRequest for Comments: 7673                       University of Cambridge\nCategory: Standards Track                                      M. Miller\nISSN: 2070-1721                                      Cisco Systems, Inc.\n                                                          P. Saint-Andre\n                                                                    &yet\n                                                            October 2015",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Using DNS-Based Authentication of Named Entities (DANE)\n             TLSA Records with SRV Records",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The DNS-Based Authentication of Named Entities (DANE) specification (RFC 6698) describes how to use TLSA resource records secured by DNSSEC (RFC 4033) to associate a server's connection endpoint with its Transport Layer Security (TLS) certificate (thus enabling administrators of domain names to specify the keys used in that domain's TLS servers). However, application protocols that use SRV records (RFC 2782) to indirectly name the target server connection endpoints for a service domain name cannot apply the rules from RFC 6698. Therefore, this document provides guidelines that enable such protocols to locate and use TLSA records.",
      "ja": "名前付きエンティティのDNSベースの認証（DANE）仕様（RFC 6698）は、これの管理者を有効にするそのトランスポート層セキュリティ（TLS）証明書（とサーバーの接続エンドポイントを関連付けるためにDNSSEC（RFC 4033）で固定TLSAリソースレコードを使用する方法について説明しますドメイン名は、そのドメインのTLSサーバで使用するキー）を指定します。しかし、間接的にサービスドメイン名のターゲット・サーバー接続のエンドポイントに名前を付けるためにSRVレコード（RFC 2782）を使用するアプリケーションプロトコルは、したがってRFC 6698.からルールを適用することはできません、このドキュメントはTLSAのレコードを検索し、使用するようなプロトコルを可能にするガイドラインを提供します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7673.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7673で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Terminology .....................................................4\n3. DNS Checks ......................................................4\n   3.1. SRV Query ..................................................4\n   3.2. Address Queries ............................................5\n   3.3. TLSA Queries ...............................................6\n   3.4. Impact on TLS Usage ........................................6\n4. TLS Checks ......................................................7\n   4.1. SRV Records Only ...........................................7\n   4.2. TLSA Records ...............................................8\n5. Guidance for Protocol Authors ...................................8\n6. Guidance for Server Operators ...................................8\n7. Guidance for Application Developers .............................9\n8. Internationalization Considerations .............................9\n9. Security Considerations ........................................10\n   9.1. Mixed Security Status .....................................10\n   9.2. Certificate Subject Name Matching .........................10\n10. References ....................................................11\n   10.1. Normative References .....................................11\n   10.2. Informative References ...................................12\nAppendix A. Examples ..............................................13\n  A.1. IMAP .......................................................13\n  A.2. XMPP .......................................................13\nAppendix B. Rationale .............................................14\nAcknowledgements ..................................................15\nAuthors' Addresses ................................................16",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The base DNS-Based Authentication of Named Entities (DANE) specification [RFC6698] describes how to use TLSA resource records secured by DNSSEC [RFC4033] to associate a target server's connection endpoint with its Transport Layer Security (TLS) certificate (thus enabling administrators of domain names to specify the keys used in that domain's TLS servers). Some application protocols locate connection endpoints indirectly via SRV records [RFC2782]. As a result of this indirection, the rules specified in [RFC6698] cannot be directly applied to such application protocols. (Rules for SMTP [RFC5321], which uses MX resource records instead of SRV records, are described in [RFC7672].)",
      "ja": "名前付きエンティティの基本DNSベースの認証（DANE）仕様[RFC6698]はこれを管理者に可能そのトランスポート層セキュリティ（TLS）証明書（とターゲット・サーバーの接続エンドポイントを関連付けるために、[RFC4033] DNSSECで保護TLSAリソースレコードを使用する方法について説明しますドメイン名は、そのドメインのTLSサーバで使用するキー）を指定します。いくつかのアプリケーションプロトコルは、SRVレコード[RFC2782]を介して間接的に接続エンドポイントを検索します。この間接参照の結果、[RFC6698]で指定された規則は、直接そのようなアプリケーションプロトコルに適用することはできません。 （代わりに、SRVレコードのMXリソースレコードを使用してSMTP [RFC5321]のルールは、[RFC7672]に記載されています。）"
    },
    {
      "indent": 3,
      "text": "This document describes how to use DANE TLSA records with SRV records. To summarize:",
      "ja": "この文書では、SRVレコードとDANE TLSAレコードを使用する方法について説明します。要約する："
    },
    {
      "indent": 3,
      "text": "o We rely on DNSSEC to secure SRV records that map the desired service, transport protocol, and service domain name to the corresponding target server connection endpoints (i.e., the target server hostnames and port numbers returned in the SRV records for that service type).",
      "ja": "O我々は（すなわち、ターゲットサーバのホスト名とポート番号は、そのサービスタイプのSRVレコードに戻される）対応するターゲットサーバ接続エンドポイントに所望のサービス、トランスポートプロトコル、およびサービスのドメイン名をマップするSRVレコードを確保するためにDNSSECに依存しています。"
    },
    {
      "indent": 3,
      "text": "o Although in accordance with [RFC2782] a service domain name can advertise a number of SRV records (some of which might map to connection endpoints that do not support TLS), the intent of this specification is for a client to securely discover connection endpoints that support TLS.",
      "ja": "O [RFC2782]サービスのドメイン名に基づいて（TLSをサポートしていない接続のエンドポイントにマッピングするかもしれないそのうちのいくつか）SRVレコードの数を広告することができますが、この仕様の意図はしっかりとその接続のエンドポイントを発見するためのクライアントのためにありますTLSをサポートしています。"
    },
    {
      "indent": 3,
      "text": "o The TLSA records for each connection endpoint are located using the transport protocol, port number, and hostname for the target server (not the service domain name).",
      "ja": "oを各接続エンドポイントのTLSAレコードは、ターゲット・サーバ（ないサービスドメイン名）のためのトランスポートプロトコル、ポート番号、およびホスト名を使用して配置されています。"
    },
    {
      "indent": 3,
      "text": "o When DNSSEC-validated TLSA records are published for a given connection endpoint, clients always use TLS when connecting (even if the connection endpoint supports cleartext communication).",
      "ja": "DNSSEC検証さTLSAレコードが与えられた接続エンドポイント用に公開されている場合（接続エンドポイントは、平文通信をサポートしている場合でも）接続時に、O、クライアントは常にTLSを使用します。"
    },
    {
      "indent": 3,
      "text": "o If there is at least one usable TLSA record for a given connection endpoint, the connection endpoint's TLS certificate or public key needs to match at least one of those usable TLSA records.",
      "ja": "与えられた接続エンドポイントのための少なくとも一つの使用可能なTLSAレコードがある場合は、O、接続エンドポイントのTLS証明書または公開鍵は、それらの使用可能なTLSAレコードの少なくともいずれかと一致する必要があります。"
    },
    {
      "indent": 3,
      "text": "o If there are no usable TLSA records for a given connection endpoint, the target server hostname is used as one of the acceptable reference identifiers, as described in [RFC6125]. Other reference identifiers might arise through CNAME expansion of either the service domain name or target server hostname, as detailed in [RFC7671].",
      "ja": "所与の接続エンドポイントのための使用可能なTLSAレコードが存在しない場合は[RFC6125]に記載されているようにO、ターゲットサーバのホスト名は、許容される参照識別子の1つとして使用されます。その他の参照識別子は、[RFC7671]で説明するように、サービスのドメイン名またはターゲット・サーバーのホスト名のいずれかのCNAMEの拡大を通じて発生する可能性があります。"
    },
    {
      "indent": 3,
      "text": "o If there are no usable TLSA records for any connection endpoint (and thus the client cannot securely discover a connection endpoint that supports TLS), the client's behavior is a matter for the application protocol or client implementation; this might involve a fallback to non-DANE behavior using the public key infrastructure [RFC5280].",
      "ja": "任意の接続エンドポイントには、使用可能なTLSAレコードが（したがって、クライアントが安全にTLSをサポートしている接続エンドポイントを検出することはできません）が存在しない場合は、O、クライアントの動作は、アプリケーションプロトコルまたはクライアント実装の問題です。これは、公開鍵インフラストラクチャ[RFC5280]を使用して、非DANE行動へのフォールバックを必要とするかもしれません。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this memo are to be interpreted as described in [RFC2119].",
      "ja": "キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、 \"推奨NOT\"、および「OPTIONAL [RFC2119]に記載されているように「このメモで解釈されるべきです。"
    },
    {
      "indent": 3,
      "text": "This document uses the definitions for \"secure\", \"insecure\", \"bogus\", and \"indeterminate\" from Section 4.3 of [RFC4035]. This document uses the acronyms from [RFC7218] for the values of TLSA fields where appropriate.",
      "ja": "この文書では、「安全でない」「偽」、および[RFC4035]のセクション4.3「不定」、「安全」の定義を使用しています。この文書では、適切なTLSAフィールドの値は[RFC7218]からの頭字語を使用します。"
    },
    {
      "indent": 3,
      "text": "Additionally, this document uses the following terms:",
      "ja": "また、この文書は、次の用語を使用します。"
    },
    {
      "indent": 3,
      "text": "connection endpoint: A tuple of a fully qualified DNS hostname, transport protocol, and port number that a client uses to establish a connection to the target server.",
      "ja": "接続エンドポイント：クライアントがターゲット・サーバーへの接続を確立するために使用する完全修飾DNSホスト名、トランスポートプロトコル、およびポート番号のタプル。"
    },
    {
      "indent": 3,
      "text": "service domain name: The fully qualified DNS domain name that identifies an application service; corresponds to the term \"source domain\" from [RFC6125].",
      "ja": "サービスドメイン名：アプリケーションサービスを識別する完全修飾DNSドメイン名。 [RFC6125]から用語「ソースドメイン」に相当します。"
    },
    {
      "indent": 3,
      "text": "This document uses the term \"target server hostname\" in place of the term \"derived domain\" from the so-called CertID specification [RFC6125].",
      "ja": "この文書では、いわゆるCertID仕様[RFC6125]から用語の代わりに「派生ドメイン」は、用語「ターゲット・サーバーのホスト名を」使用しています。"
    },
    {
      "indent": 0,
      "text": "3. DNS Checks",
      "section_title": true,
      "ja": "3. DNSチェック"
    },
    {
      "indent": 0,
      "text": "3.1. SRV Query",
      "section_title": true,
      "ja": "3.1.  SRVクエリ"
    },
    {
      "indent": 3,
      "text": "When the client makes an SRV query, a successful result will typically be a list of one or more SRV records (or possibly a chain of CNAME/DNAME aliases leading to such a list).",
      "ja": "クライアントは、SRVのクエリを行うと、成功した結果は、通常、1つまたは複数のSRVレコード（あるいはそのようなリストにつながるCNAME / DNAMEエイリアスのチェーン）のリストになります。"
    },
    {
      "indent": 6,
      "text": "NOTE: Implementers need to be aware that unsuccessful results can occur because of various DNS-related errors; guidance on avoiding downgrade attacks can be found in Section 2.1 of [RFC7672].",
      "ja": "注：実装者は失敗した結果があるため、さまざまなDNS関連のエラーの発生する可能性があることを認識する必要があります。ダウングレード攻撃を回避についてのガイダンスは、[RFC7672]のセクション2.1に記載されています。"
    },
    {
      "indent": 3,
      "text": "For this specification to apply, the entire chain of DNS RRset(s) returned MUST be \"secure\" according to DNSSEC validation (Section 5 of [RFC4035]). In the case where the answer is obtained via a chain of CNAME and/or DNAME aliases, the whole chain of CNAME and DNAME RRsets MUST also be secure.",
      "ja": "この仕様を適用するために、DNS RRセット（S）のチェーン全体が返さDNSSEC検証（[RFC4035]のセクション5）によれば「安全」でなければなりません。回答がCNAMEの鎖および/またはDNAMEエイリアスを介して取得された場合に、CNAMEとDNAME資源レコード集合の全体鎖はまた、安全でなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the SRV lookup fails because the RRset is \"bogus\" (or the lookup fails for reasons other than no records), the client MUST abort its attempt to connect to the desired service. If the lookup result is \"insecure\" (or no SRV records exist), this protocol does not apply and the client SHOULD fall back to its non-DNSSEC, non-DANE (and possibly non-SRV) behavior.",
      "ja": "RRセットは「偽」であるため、SRVルックアップが失敗した（または検索がレコードなし以外の理由で失敗した）場合、クライアントは必要なサービスに接続する試みを中止しなければなりません。検索結果は、「安全でない」である（あるいは全くSRVレコードが存在しない）場合は、このプロトコルが適用されないと、クライアントは戻ってその非DNSSEC、非DANE（そしておそらく非SRV）の動作に落ちるべきです。"
    },
    {
      "indent": 3,
      "text": "When the lookup returns a \"secure\" RRset (possibly via a chain of \"secure\" CNAME/DNAME records), the client now has an authentic list of target server connection endpoints with weight and priority values. It performs server ordering and selection using the weight and priority values without regard to the presence or absence of DNSSEC or TLSA records. It also takes note of the DNSSEC validation status of the SRV response for use when checking certificate names (see Section 4). The client can then proceed to making address queries on the target server hostnames as described in the following section.",
      "ja": "検索は（おそらく「安全な」CNAME / DNAMEレコードのチェーンを介して）「安全な」RRセットを返した場合、クライアントは現在、体重および優先順位の値を持つターゲットサーバ接続のエンドポイントの本物のリストを持っています。これはDNSSEC又はTLSAレコードの存在または非存在に関係なく、重量及び優先値を使用してサーバーの順序および選択を行います。また、使用するSRV応答証明書の名前を（セクション4を参照）のチェックのDNSSECの検証ステータスのノートを取ります。次に、クライアントは、次のセクションで説明するように、ターゲット・サーバーのホスト名にアドレスクエリーを作ることに進むことができます。"
    },
    {
      "indent": 0,
      "text": "3.2. Address Queries",
      "section_title": true,
      "ja": "3.2. 住所クエリ"
    },
    {
      "indent": 3,
      "text": "For each SRV target server connection endpoint, the client makes A and/or AAAA queries, performs DNSSEC validation on the address (A or AAAA) response, and continues as follows, based on the results:",
      "ja": "各SRVターゲットサーバ接続エンドポイントのために、クライアントは、Aおよび/またはAAAAクエリを行うアドレス（AまたはAAAA）応答にDNSSEC検証を行い、その結果に基づいて、次のように継続します。"
    },
    {
      "indent": 3,
      "text": "o If a returned RRSet is \"secure\", the client MUST perform a TLSA query for that target server connection endpoint, as described in the next section.",
      "ja": "返された資源レコード集合は「安全」である場合は、次のセクションで説明するように、O、クライアントは、そのターゲット・サーバー接続エンドポイントのTLSAクエリを実行しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o If no returned RRsets are \"secure\", the client MUST NOT perform a TLSA query for that target server connection endpoint; the TLSA query will most likely fail or produce spurious results.",
      "ja": "O NOであれば返されたRRセットクライアントがそのターゲット・サーバー接続エンドポイントのTLSAクエリを実行してはならない、「安全」です。 TLSAクエリは、最も可能性の高い失敗したり、誤った結果を生成します。"
    },
    {
      "indent": 3,
      "text": "o If the address record lookup fails (a validation status of either \"bogus\" or \"indeterminate\"), the client MUST NOT connect to this connection endpoint; instead, it uses the next most appropriate SRV target. This helps prevent downgrade attacks.",
      "ja": "アドレスレコードの検索は、クライアントがこの接続エンドポイントに接続してはなりません（「偽」または「不確定」のいずれかの検証ステータス）が失敗した場合、O。その代わり、それは次の最も適切なSRVターゲットを使用しています。これは、ダウングレード攻撃を防ぐことができます。"
    },
    {
      "indent": 0,
      "text": "3.3. TLSA Queries",
      "section_title": true,
      "ja": "3.3.  TLSAクエリ"
    },
    {
      "indent": 3,
      "text": "The client SHALL construct the TLSA query name as described in Section 3 of [RFC6698], based on the fields from the SRV record: the port number from the SRV RDATA, the transport protocol from the SRV query name, and the TLSA base domain from the SRV target server hostname.",
      "ja": "SRV RDATA、SRVクエリ名からトランスポートプロトコルからポート番号、及びTLSAベースドメインから：SRVレコードのフィールドに基づいて、[RFC6698]のセクション3に記載されているように、クライアントはTLSAクエリ名を構築するものとSRVターゲットサーバのホスト名。"
    },
    {
      "indent": 3,
      "text": "For example, the following SRV record for IMAP (see [RFC6186])",
      "ja": "IMAPため、例えば、次のSRVレコード（[RFC6186]を参照）"
    },
    {
      "indent": 7,
      "text": "_imap._tcp.example.com. 86400 IN SRV 10 0 9143 imap.example.net.",
      "ja": "_imap._tcp.example.com。 SRV 10 0 9143 imap.example.net、IN 86400。"
    },
    {
      "indent": 3,
      "text": "leads to the TLSA query shown below:",
      "ja": "以下に示すTLSAクエリにつながります："
    },
    {
      "indent": 7,
      "text": "_9143._tcp.imap.example.net. IN TLSA ?",
      "ja": "_9143._tcp.imap.example.net。 TLSA、IN？"
    },
    {
      "indent": 0,
      "text": "3.4. Impact on TLS Usage",
      "section_title": true,
      "ja": "3.4.  TLSの使用への影響"
    },
    {
      "indent": 3,
      "text": "The client SHALL determine if the TLSA records returned in the previous step are usable according to Section 4.1 of [RFC6698]. This affects the use of TLS as follows:",
      "ja": "前のステップで返さTLSAレコードは[RFC6698]のセクション4.1に従って使用可能である場合、クライアントは、決定しなければなりません。これは次のようにTLSの使用に影響を与えます。"
    },
    {
      "indent": 3,
      "text": "o If the TLSA response is \"secure\" and usable, then the client MUST use TLS when connecting to the target server. The TLSA records are used when validating the server's certificate as described in Section 4.",
      "ja": "TLSA応答が「安全」と使用可能な場合、ターゲット・サーバーに接続するとき、O、クライアントはTLSを使用しなければなりません。第4節で説明したように、サーバーの証明書を検証する際TLSAレコードが使用されています。"
    },
    {
      "indent": 3,
      "text": "o If the TLSA response is \"bogus\" or \"indeterminate\" (or the lookup fails for reasons other than no records), then the client MUST NOT connect to the target server (the client can still use other SRV targets).",
      "ja": "TLSA応答が「偽」または「不定」である（またはルックアップがレコードなし以外の理由で失敗した）場合は、O、その後、クライアントは、ターゲット・サーバー（クライアントは、まだ他のSRVターゲットを使用することができます）に接続することはできません。"
    },
    {
      "indent": 3,
      "text": "o If the TLSA response is \"insecure\" (or no TLSA records exist), then the client SHALL proceed as if the target server had no TLSA records. It MAY connect to the target server with or without TLS, subject to the policies of the application protocol or client implementation.",
      "ja": "TLSA応答が「安全でない」である（あるいは全くTLSAレコードが存在しない）場合は、ターゲットサーバは何TLSAレコードを持っていたかのように、O、クライアントは続行しないものとします。これは、アプリケーションプロトコルやクライアントの実装の方針に従うTLSの有無にかかわらず、ターゲットサーバに接続することができます。"
    },
    {
      "indent": 0,
      "text": "4. TLS Checks",
      "section_title": true,
      "ja": "4. TLSチェック"
    },
    {
      "indent": 3,
      "text": "When connecting to a server, the client MUST use TLS if the responses to the SRV and TLSA queries were \"secure\" as described above. The rules described in the next two sections -- Section 4.2 for cases where there is at least one usable TLSA record, and Section 4.1 otherwise -- apply to such secure responses.",
      "ja": "サーバーに接続するときは、上記のようSRVとTLSAクエリに対する応答が「確保」された場合、クライアントはTLSを使用しなければなりません。次の2つのセクションで説明したルール - 少なくとも一つの使用可能なTLSAレコードが存在する場合については、セクション4.2およびセクション4.1別段は - 安全な応答に適用されます。"
    },
    {
      "indent": 0,
      "text": "4.1. SRV Records Only",
      "section_title": true,
      "ja": "4.1.  SRVレコードのみ"
    },
    {
      "indent": 3,
      "text": "If the client received zero usable TLSA certificate associations, it SHALL validate the server's TLS certificate using the normal PKIX rules [RFC5280] or protocol-specific rules (e.g., following [RFC6125]) without further input from the TLSA records. In this case, the client uses the information in the server certificate and the DNSSEC validation status of the SRV query in its authentication checks. It SHOULD use the Server Name Indication extension (TLS SNI) [RFC6066] or its functional equivalent in the relevant application protocol (e.g., in the Extensible Messaging and Presence Protocol (XMPP) [RFC6120], this is the 'to' address of the initial stream header). The preferred name SHALL be chosen as follows, and the client SHALL verify the identity asserted by the server's certificate according to Section 6 of [RFC6125], using a list of reference identifiers constructed as follows (note again that in RFC 6125 the terms \"source domain\" and \"derived domain\" refer to the same things as \"service domain name\" and \"target server hostname\" in this document). The examples below assume a service domain name of \"im.example.com\" and a target server hostname of \"xmpp23.hosting.example.net\".",
      "ja": "クライアントがゼロ使用可能TLSA証明書の関連付けを受け取った場合、それはTLSAレコードからのさらなる入力なしに（例えば、[RFC6125]以下）通常PKIX規則[RFC5280]またはプロトコル固有の規則を使用してサーバのTLS証明書を検証SHALL。この場合、クライアントはサーバ証明書とその認証チェックでSRVクエリのDNSSEC検証状態の情報を使用しています。これは、サーバー名の表示の拡張機能（TLS SNI）[RFC6066]または拡張メッセージングおよびプレゼンスプロトコル（XMPP）[RFC6120]で関連するアプリケーションプロトコル（例えば、その機能的同等物を使用すべきで、これはの「から」のアドレスであります初期ストリームヘッダ）。次のように好ましい名が選択されるべきであり、クライアントは次のように構成された参照識別子のリストを使用して、[RFC6125]のセクション6に係るサーバの証明書によってアサートされたアイデンティティを検証しなければならない（RFC 6125で、用語「ソースことに再度注意ドメイン」と 『派生ドメインは、サービスドメイン名『と 『この文書のターゲット・サーバーのホスト名』）』と同じものを指します』。以下の例は、「im.example.com」のサービスドメイン名と「xmpp23.hosting.example.net」の対象サーバのホスト名を想定しています。"
    },
    {
      "indent": 3,
      "text": "SRV is insecure: The reference identifiers SHALL include the service domain name and MUST NOT include the SRV target server hostname (e.g., include \"im.example.com\" but not \"xmpp23.hosting.example.net\"). The service domain name is the preferred name for TLS SNI or its equivalent.",
      "ja": "SRVは安全です：参照識別子は、サービスのドメイン名を含むものとし、SRV対象サーバのホスト名を含んではいけません（例えば、「im.example.com」ではなく「xmpp23.hosting.example.net」が含まれます）。サービスのドメイン名は、TLS SNIまたはそれと同等のための好適名前です。"
    },
    {
      "indent": 3,
      "text": "SRV is secure: The reference identifiers SHALL include both the service domain name and the SRV target server hostname (e.g., include both \"im.example.com\" and \"xmpp23.hosting.example.net\"). The service domain name is still the preferred name for TLS SNI or its equivalent (this reduces code complexity and the possibility of interoperability problems).",
      "ja": "SRVは安全である：参照識別子は、サービスドメイン名とSRV対象サーバのホスト名の両方を含むものとする。（例えば、両方とも「im.example.com」および「xmpp23.hosting.example.net」を含みます）。サービスドメイン名はまだTLS SNIまたはそれと同等の（これは、コードの複雑さと相互運用性の問題の可能性を低減）のための好適な名前です。"
    },
    {
      "indent": 3,
      "text": "In the latter case, the client will accept either identity to ensure compatibility with servers that support this specification as well as servers that do not support this specification.",
      "ja": "後者の場合、クライアントはこの仕様をサポートするサーバーだけでなく、この仕様をサポートしていないサーバーとの互換性を確保するためのいずれかのIDを受け入れます。"
    },
    {
      "indent": 0,
      "text": "4.2. TLSA Records",
      "section_title": true,
      "ja": "4.2.  TLSAレコード"
    },
    {
      "indent": 3,
      "text": "If the client received one or more usable TLSA certificate associations, it SHALL process them as described in Section 2.1 of [RFC6698].",
      "ja": "クライアントは、1つまたは複数の使用可能なTLSA証明書の関連付けを受信した場合は[RFC6698]のセクション2.1に記載されているように、それはそれらを処理SHALL。"
    },
    {
      "indent": 3,
      "text": "If the TLS server's certificate -- or the public key of the server's certificate -- matches a usable TLSA record with certificate usage DANE-EE, the client MUST ignore validation checks from [RFC5280] and reference identifier checks from [RFC6125]. The information in such a TLSA record supersedes the non-key information in the certificate.",
      "ja": "TLSサーバーの証明書場合 - またはサーバの証明書の公開鍵が - 証明書の利用DANE-EEで使用可能なTLSAレコードと一致し、クライアントは[RFC6125]から[RFC5280]からの妥当性チェックと参照識別子のチェックを無視しなければなりません。このようTLSAレコード内の情報は、証明書内の非キー情報よりも優先されます。"
    },
    {
      "indent": 0,
      "text": "5. Guidance for Protocol Authors",
      "section_title": true,
      "ja": "プロトコル作成者のための指針5."
    },
    {
      "indent": 3,
      "text": "This document describes how to use DANE with application protocols in which target servers are discovered via SRV records. Although this document attempts to provide generic guidance applying to all such protocols, additional documents for particular application protocols could cover related topics, such as:",
      "ja": "この文書では、ターゲットサーバーがSRVレコードを経て発見されているアプリケーションプロトコルでDANEを使用する方法について説明します。このドキュメントはそのようなすべてのプロトコルに適用する一般的なガイダンスを提供しようとしますが、特定のアプリケーションプロトコルのための追加書類は、以下のような関連するトピックをカバーできます。"
    },
    {
      "indent": 3,
      "text": "o Fallback logic in the event that a client is unable to connect securely to a target server by following the procedures defined in this document.",
      "ja": "クライアントは、この文書で定義された手順に従うことにより、ターゲットサーバに安全に接続することができない場合に、Oフォールバックロジック。"
    },
    {
      "indent": 3,
      "text": "o How clients ought to behave if (1) they do not support SRV lookups or (2) they do support SRV lookups and encounter service domain names that do not offer SRV records.",
      "ja": "Oどのようにクライアントは、（1）彼らはSRVルックアップをサポートしていないか、（2）彼らはSRVルックアップとSRVレコードを提供していない出会いサービスのドメイン名をサポートしていない場合に振る舞うべきです。"
    },
    {
      "indent": 3,
      "text": "o Whether or not the application protocol has a functional equivalent for TLS SNI that is preferred within that protocol.",
      "ja": "アプリケーションプロトコルは、そのプロトコル内好ましいTLS SNIための機能的等価物を有するか否か、O。"
    },
    {
      "indent": 3,
      "text": "o The use of SRV records with additional discovery technologies, such as the use of both SRV records and NAPTR records [RFC3403] for transport selection in the Session Initiation Protocol (SIP).",
      "ja": "セッション開始プロトコル（SIP）におけるトランスポート選択のためのSRVレコードとNAPTRレコードの両方の使用のような追加の発見技術、[RFC3403]とSRVレコードの使用、O。"
    },
    {
      "indent": 3,
      "text": "For example, [XMPP-DNA] covers such topics for XMPP.",
      "ja": "例えば、[XMPP-DNA]はXMPPのためのそのようなトピックをカバーします。"
    },
    {
      "indent": 0,
      "text": "6. Guidance for Server Operators",
      "section_title": true,
      "ja": "サーバー事業者向け6.ガイダンス"
    },
    {
      "indent": 3,
      "text": "To conform to this specification, the published SRV records and subsequent address (A and AAAA) records MUST be secured with DNSSEC. There SHOULD also be at least one TLSA record published that authenticates the server's certificate.",
      "ja": "この仕様に準拠するために、公表されSRVレコードと次のアドレス（AとAAAA）レコードがDNSSECで保護されなければなりません。また、サーバの証明書を認証し、公開少なくとも一つTLSAレコードがあるはずです。"
    },
    {
      "indent": 3,
      "text": "When using TLSA records with certificate usage DANE-EE, it is not necessary for the deployed certificate to contain an identifier for either the source domain or target server hostname. However, operators need to be aware that servers relying solely on validation using certificate usage DANE-EE TLSA records might prevent clients that do not support this specification from successfully connecting with TLS.",
      "ja": "証明書の利用DANE-EEとTLSAレコードを使用する場合は、ソースドメインまたはターゲット・サーバーのホスト名のいずれかの識別子を含むように展開された証明書は必要ありません。しかし、事業者は、証明書の使用方法DANE-EE TLSAレコードを使用して検証のみに頼るのサーバーが正常にTLSとの接続からこの仕様をサポートしていないクライアントを妨げる可能性があることに注意する必要があります。"
    },
    {
      "indent": 3,
      "text": "For TLSA records with certificate usage types other than DANE-EE, the certificate(s) MUST contain an identifier that matches:",
      "ja": "DANE-EE以外の証明書の使用法の種類とTLSAレコードに対して、証明書（複数可）と一致する識別子を含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "o the service domain name (the \"source domain\" in [RFC6125] terms, which is the SRV query domain), and/or",
      "ja": "Oサービスドメイン名（SRVクエリドメインである[RFC6125]という点で、「ソースドメイン」）、及び/又は"
    },
    {
      "indent": 3,
      "text": "o the target server hostname (the \"derived domain\" in [RFC6125] terms, which is the SRV target hostname).",
      "ja": "ターゲットサーバのホスト名（SRV対象ホスト名は[RFC6125]という点で「派生ドメイン」）O。"
    },
    {
      "indent": 3,
      "text": "Servers that support multiple service domain names (i.e., so-called \"multi-tenanted environments\") can implement TLS SNI [RFC6066] or its functional equivalent to determine which certificate to offer. Clients that do not support this specification will indicate a preference for the service domain name, while clients that support this specification will indicate the target server hostname. However, the server determines what certificate to present in the TLS handshake; e.g., the presented certificate might only authenticate the target server hostname.",
      "ja": "複数のサービスのドメイン名（すなわち、いわゆる「マルチテナント環境」）をサポートするサーバーは、提供するためにどの証明書を決定するためにTLS SNI [RFC6066]またはその機能的等価物を実現することができます。この仕様をサポートするクライアントは、ターゲットサーバのホスト名を示しますしながら、この仕様をサポートしていないクライアントは、サービスのドメイン名に対する選好を示します。しかし、サーバがTLSハンドシェイク中に提示するどの証明書を決定します。例えば、提示された証明書は、ターゲットサーバのホスト名を認証することがあります。"
    },
    {
      "indent": 0,
      "text": "7. Guidance for Application Developers",
      "section_title": true,
      "ja": "アプリケーション開発者のためのガイダンス7."
    },
    {
      "indent": 3,
      "text": "Developers of application clients that depend on DANE-SRV often would like to prepare as quickly as possible for making a connection to the intended service, thus reducing the wait time for end users. To make this optimization possible, a DNS library might perform the address queries and TLSA queries in parallel. (Because a TLSA record can be ignored if it turns out that the address record on which it depends is not secure, performing the TLSA queries in parallel with the address queries is not harmful from a security perspective and can yield some operational benefits.)",
      "ja": "DANE-SRVに依存したアプリケーションのクライアントの開発者は、多くの場合、このように、エンドユーザーのための待ち時間を減らすこと、意図したサービスへの接続を行うために、可能な限り迅速に準備したいと思います。この最適化を可能にするために、DNSライブラリは、並列にアドレスクエリとTLSAクエリを実行する場合があります。 （TLSAレコードは、それが依存しているアドレスレコードが安全でないことが判明した場合は無視することができるため、アドレスのクエリと並列にTLSAクエリを実行すると、セキュリティの観点から有害ではないといくつかの運用上の利点を得ることができます。）"
    },
    {
      "indent": 0,
      "text": "8. Internationalization Considerations",
      "section_title": true,
      "ja": "8.国際化に関する注意事項"
    },
    {
      "indent": 3,
      "text": "If any of the DNS queries are for an internationalized domain name, then they need to use the A-label form [RFC5890].",
      "ja": "DNSクエリのいずれかが、国際化ドメイン名のためのものであるならば、それらはA-ラベル形式[RFC5890]を使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 0,
      "text": "9.1. Mixed Security Status",
      "section_title": true,
      "ja": "9.1. 混在セキュリティステータス"
    },
    {
      "indent": 3,
      "text": "We do not specify that all of the target server connection endpoints for a service domain name need to be consistent in whether they have or do not have TLSA records. This is so that partial or incremental deployment does not break the service. Different levels of deployment are likely if a service domain name has a third-party fallback server, for example.",
      "ja": "私たちは、サービスドメイン名のターゲット・サーバーの接続エンドポイントのすべてのは、彼らが持っているかどうかで一貫している必要があるかTLSAレコードを持っていないことを指定しないでください。部分的または増分展開がサービスを壊さないようにするためです。サービスドメイン名は、例えば、サードパーティのフォールバックサーバを持っている場合は、展開のさまざまなレベルがありそうです。"
    },
    {
      "indent": 3,
      "text": "The SRV sorting rules are unchanged; in particular, they have not been altered in order to prioritize secure connection endpoints over insecure connection endpoints. If a site wants to be secure, it needs to deploy this protocol completely; a partial deployment is not secure, and we make no special effort to support it.",
      "ja": "SRV仕分けルールは変更されません。具体的には、彼らが安全でない接続エンドポイント上での安全な接続のエンドポイントを優先させるために変更されていません。サイトが安全であることを望んでいるなら、それは完全にこのプロトコルを展開する必要があります。部分的な展開は安全ではない、と我々はそれをサポートするための特別な努力をしていません。"
    },
    {
      "indent": 0,
      "text": "9.2. Certificate Subject Name Matching",
      "section_title": true,
      "ja": "9.2. 証明書のサブジェクト名のマッチング"
    },
    {
      "indent": 3,
      "text": "Section 4 of the TLSA specification [RFC6698] leaves the details of checking names in certificates to higher-level application protocols, though it suggests the use of [RFC6125].",
      "ja": "それは[RFC6125]を使用することを示唆しているもののTLSA仕様[RFC6698]のセクション4は、より高いレベルのアプリケーションプロトコルの証明書内の名前をチェックする詳細を残します。"
    },
    {
      "indent": 3,
      "text": "Name checks are not necessary if the matching TLSA record is of certificate usage DANE-EE. Because such a record identifies the specific certificate (or public key of the certificate), additional checks are superfluous and potentially conflicting.",
      "ja": "マッチングTLSAレコードが証明書の使用DANE-EEである場合名チェックは不要です。そのようなレコードは、特定の証明書（または証明書の公開鍵）を識別するため、追加のチェックが余分と潜在的に矛盾しています。"
    },
    {
      "indent": 3,
      "text": "Otherwise, while DNSSEC provides a secure binding between the server name and the TLSA record, and the TLSA record provides a binding to a certificate, this latter step can be indirect via a chain of certificates. For example, a certificate usage PKIX-TA TLSA record only authenticates the Certification Authority (CA) that issued the certificate, and third parties can obtain certificates from the same CA. Therefore, clients need to check to see whether or not the server's certificate matches one of the expected reference identifiers to ensure that the certificate was issued by the CA to the server the client expects (naturally, this is in addition to standard certificate-related checks as specified in [RFC5280], including but not limited to certificate syntax, certificate extensions such as name constraints and extended key usage, and handling of certification paths).",
      "ja": "DNSSECは、サーバ名とTLSAレコードとの間の安全な結合を提供し、TLSAレコードが証明書への結合を提供しながら、それ以外の場合、この後者のステップは、証明書の連鎖を介して間接的であってもよいです。たとえば、証明書の使用方法PKIX-TA TLSAレコードのみが証明書を発行した認証局（CA）を認証し、第三者が同じCAから証明書を取得することができますそのため、クライアントはサーバの証明書は、証明書がクライアントが期待するサーバーへのCAによって発行されたことを確認するために期待される参照識別子のいずれかと一致するかどうかを確認するためにチェックする必要があります（当然、これは標準の証明書関連のチェックに加えています[RFC5280]で指定されるように、）などではなく、証明書の構文、そのような名前の制約と拡張鍵使用法として証明書の拡張機能、及び認証パスの処理に限定されるもの。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2782] Gulbrandsen, A., Vixie, P., and L. Esibov, \"A DNS RR for specifying the location of services (DNS SRV)\", RFC 2782, DOI 10.17487/RFC2782, February 2000, <http://www.rfc-editor.org/info/rfc2782>.",
      "ja": "[RFC2782] Gulbrandsenの、A.、いるVixie、P.、およびL. Esibov、 \"サービスの場所を特定するためのDNS RR（DNSのSRV）\"、RFC 2782、DOI 10.17487 / RFC2782、2000年2月、<HTTP：// www.rfc-editor.org/info/rfc2782>。"
    },
    {
      "indent": 3,
      "text": "[RFC4033] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"DNS Security Introduction and Requirements\", RFC 4033, DOI 10.17487/RFC4033, March 2005, <http://www.rfc-editor.org/info/rfc4033>.",
      "ja": "[RFC4033]アレンズ、R.、Austeinと、R.、ラーソン、M.、マッシー、D.、およびS.ローズ、 \"DNSセキュリティ序論と要件\"、RFC 4033、DOI 10.17487 / RFC4033、2005年3月、<のhttp： //www.rfc-editor.org/info/rfc4033>。"
    },
    {
      "indent": 3,
      "text": "[RFC4035] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"Protocol Modifications for the DNS Security Extensions\", RFC 4035, DOI 10.17487/RFC4035, March 2005, <http://www.rfc-editor.org/info/rfc4035>.",
      "ja": "[RFC4035]アレンズ、R.、Austeinと、R.、ラーソン、M.、マッシー、D.、およびS.ローズ、 \"DNSセキュリティ拡張のためのプロトコル変更\"、RFC 4035、DOI 10.17487 / RFC4035、2005年3月、< http://www.rfc-editor.org/info/rfc4035>。"
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, DOI 10.17487/RFC5280, May 2008, <http://www.rfc-editor.org/info/rfc5280>.",
      "ja": "[RFC5280]クーパー、D.、Santesson、S.、ファレル、S.、Boeyen、S.、Housley氏、R.、およびW.ポーク、「インターネットX.509公開鍵暗号基盤証明書と証明書失効リスト（CRL）のプロフィール」、RFC 5280、DOI 10.17487 / RFC5280、2008年5月、<http://www.rfc-editor.org/info/rfc5280>。"
    },
    {
      "indent": 3,
      "text": "[RFC5890] Klensin, J., \"Internationalized Domain Names for Applications (IDNA): Definitions and Document Framework\", RFC 5890, DOI 10.17487/RFC5890, August 2010, <http://www.rfc-editor.org/info/rfc5890>.",
      "ja": "[RFC5890] Klensin、J.、 \"アプリケーション（IDNA）のための国際化ドメイン名：定義とドキュメントフレームワーク\"、RFC 5890、DOI 10.17487 / RFC5890、2010年8月、<http://www.rfc-editor.org/info/ rfc5890>。"
    },
    {
      "indent": 3,
      "text": "[RFC6066] Eastlake 3rd, D., \"Transport Layer Security (TLS) Extensions: Extension Definitions\", RFC 6066, DOI 10.17487/RFC6066, January 2011, <http://www.rfc-editor.org/info/rfc6066>.",
      "ja": "[RFC6066]イーストレイク3日、D.、 \"トランスポート層セキュリティ（TLS）拡張機能：拡張定義\"、RFC 6066、DOI 10.17487 / RFC6066、2011年1月、<http://www.rfc-editor.org/info/rfc6066> 。"
    },
    {
      "indent": 3,
      "text": "[RFC6125] Saint-Andre, P. and J. Hodges, \"Representation and Verification of Domain-Based Application Service Identity within Internet Public Key Infrastructure Using X.509 (PKIX) Certificates in the Context of Transport Layer Security (TLS)\", RFC 6125, DOI 10.17487/RFC6125, March 2011, <http://www.rfc-editor.org/info/rfc6125>.",
      "ja": "[RFC6125]サンアンドレ、P.およびJ.ホッジス、「表現およびTransport Layer Security（TLS）の文脈でインターネット公開鍵インフラストラクチャの使用X.509内のドメインベースのアプリケーションサービスのアイデンティティの検証（PKIX）証明書」、 RFC 6125、DOI 10.17487 / RFC6125、2011年3月、<http://www.rfc-editor.org/info/rfc6125>。"
    },
    {
      "indent": 3,
      "text": "[RFC6698] Hoffman, P. and J. Schlyter, \"The DNS-Based Authentication of Named Entities (DANE) Transport Layer Security (TLS) Protocol: TLSA\", RFC 6698, DOI 10.17487/RFC6698, August 2012, <http://www.rfc-editor.org/info/rfc6698>.",
      "ja": "[RFC6698]ホフマン、P.およびJ. Schlyter、 \"名前付きエンティティ（DANE）トランスポート層セキュリティ（TLS）プロトコルのDNSベースの認証：TLSA\"、RFC 6698、DOI 10.17487 / RFC6698、2012年8月、<のhttp：/ /www.rfc-editor.org/info/rfc6698>。"
    },
    {
      "indent": 3,
      "text": "[RFC7218] Gudmundsson, O., \"Adding Acronyms to Simplify Conversations about DNS-Based Authentication of Named Entities (DANE)\", RFC 7218, DOI 10.17487/RFC7218, April 2014, <http://www.rfc-editor.org/info/rfc7218>.",
      "ja": "[RFC7218]グドムンソン、O.、RFC 7218 \"略語は、名前付きエンティティ（DANE）のDNSベースの認証についての会話を簡単にするために追加\"、DOI 10.17487 / RFC7218、2014年4月、<http://www.rfc-editor.org /情報/ rfc7218>。"
    },
    {
      "indent": 3,
      "text": "[RFC7671] Dukhovni, V. and W. Hardaker, \"The DNS-Based Authentication of Named Entities (DANE) Protocol: Updates and Operational Guidance\", RFC 7671, DOI 10.17487/RFC7671, October 2015, <http://www.rfc-editor.org/info/rfc7671>.",
      "ja": "[RFC7671] Dukhovni、V.とW. Hardaker、 \"名前付きエンティティ（DANE）プロトコルのDNSベースの認証：更新と運用指針\"、RFC 7671、DOI 10.17487 / RFC7671、2015年10月、<のhttp：// WWW。 rfc-editor.org/info/rfc7671>。"
    },
    {
      "indent": 3,
      "text": "[RFC7672] Dukhovni, V. and W. Hardaker, \"SMTP Security via Opportunistic DNS-Based Authentication of Named Entities (DANE) Transport Layer Security (TLS)\", RFC 7672, DOI 10.17487/RFC7672, October 2015, <http://www.rfc-editor.org/info/rfc7672>.",
      "ja": "[RFC7672] Dukhovni、V.とW. Hardaker、 \"SMTPセキュリティ名前付きエンティティの日和見DNSベースの認証（DANE）を介してトランスポート層セキュリティ（TLS）\"、RFC 7672、DOI 10.17487 / RFC7672、2015年10月、<のhttp：/ /www.rfc-editor.org/info/rfc7672>。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3403] Mealling, M., \"Dynamic Delegation Discovery System (DDDS) Part Three: The Domain Name System (DNS) Database\", RFC 3403, DOI 10.17487/RFC3403, October 2002, <http://www.rfc-editor.org/info/rfc3403>.",
      "ja": "[RFC3403] Mealling、M.、 \"ダイナミックな委譲発見システム（DDDS）パート3：ドメインネームシステム（DNS）データベース\"、RFC 3403、DOI 10.17487 / RFC3403、2002年10月、<のhttp：//www.rfc-editor .ORG /情報/ rfc3403>。"
    },
    {
      "indent": 3,
      "text": "[RFC5321] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 5321, DOI 10.17487/RFC5321, October 2008, <http://www.rfc-editor.org/info/rfc5321>.",
      "ja": "[RFC5321] Klensin、J.、 \"簡易メール転送プロトコル\"、RFC 5321、DOI 10.17487 / RFC5321、2008年10月、<http://www.rfc-editor.org/info/rfc5321>。"
    },
    {
      "indent": 3,
      "text": "[RFC6120] Saint-Andre, P., \"Extensible Messaging and Presence Protocol (XMPP): Core\", RFC 6120, DOI 10.17487/RFC6120, March 2011, <http://www.rfc-editor.org/info/rfc6120>.",
      "ja": "[RFC6120]サンアンドレ、P.、 \"拡張メッセージングおよびプレゼンスプロトコル（XMPP）：コア\"、RFC 6120、DOI 10.17487 / RFC6120、2011年3月、<http://www.rfc-editor.org/info/rfc6120 >。"
    },
    {
      "indent": 3,
      "text": "[RFC6186] Daboo, C., \"Use of SRV Records for Locating Email Submission/Access Services\", RFC 6186, DOI 10.17487/RFC6186, March 2011, <http://www.rfc-editor.org/info/rfc6186>.",
      "ja": "[RFC6186] Daboo、C.、 \"電子メールの提出/アクセスサービスの検索のためのSRVレコードの使用\"、RFC 6186、DOI 10.17487 / RFC6186、2011年3月、<http://www.rfc-editor.org/info/rfc6186> 。"
    },
    {
      "indent": 3,
      "text": "[XMPP-DNA] Saint-Andre, P., Miller, M., and P. Hancke, \"Domain Name Associations (DNA) in the Extensible Messaging and Presence Protocol (XMPP)\", Work in Progress, draft-ietf-xmpp-dna-11, September 2015.",
      "ja": "[XMPP-DNA]サンアンドレ、P.、ミラー、M.、およびP. Hancke、 \"拡張メッセージングおよびプレゼンスプロトコル（XMPP）でドメイン名協会（DNA）\"、進行中で働いて、ドラフトIETF-XMPP -DNA-11、2015年9月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Examples",
      "ja": "付録A.例"
    },
    {
      "indent": 3,
      "text": "In the following, most of the DNS resource data is elided for simplicity.",
      "ja": "以下では、DNSリソースデータのほとんどは、簡単にするために省略されています。"
    },
    {
      "indent": 0,
      "text": "A.1. IMAP",
      "ja": "A.1。 IMAP"
    },
    {
      "indent": 3,
      "text": "; mail domain _imap._tcp.example.com. SRV 10 0 9143 imap.example.net. example.com. RRSIG SRV ...",
      "ja": ";メールドメイン_imap._tcp.example.com。 SRV 10 0 9143 imap.example.net。 example.com。 RRSIG SRV ..."
    },
    {
      "indent": 3,
      "text": "; target server hostname imap.example.net. A 192.0.2.1 imap.example.net. RRSIG A ...",
      "ja": ";サーバのホスト名のimap.example.netをターゲットにしています。 192.0.2.1のimap.example.net。 RRSIG A ..."
    },
    {
      "indent": 3,
      "text": "imap.example.net. AAAA 2001:db8:212:8::e:1 imap.example.net. RRSIG ...",
      "ja": "imap.example.net。 AAAA 2001：DB8：212：8 :: E：1 imap.example.net。 RRSIG ..."
    },
    {
      "indent": 3,
      "text": "; TLSA resource record _9143._tcp.imap.example.net. TLSA ... _9143._tcp.imap.example.net. RRSIG TLSA ...",
      "ja": "; TLSAリソースレコード_9143._tcp.imap.example.net。 TLSA ... _9143._tcp.imap.example.net。 RRSIG TLSA ..."
    },
    {
      "indent": 3,
      "text": "Mail messages received for addresses at example.com are retrieved via IMAP at imap.example.net. Connections to imap.example.net port 9143 that use STARTTLS will get a server certificate that authenticates the name imap.example.net.",
      "ja": "example.comでアドレスに対して受信したメールメッセージがimap.example.netでIMAP経由で取得されています。 STARTTLSを使用imap.example.netポート9143への接続は、名前のimap.example.netを認証サーバー証明書を取得します。"
    },
    {
      "indent": 0,
      "text": "A.2. XMPP",
      "ja": "A.2。 XMPP"
    },
    {
      "indent": 3,
      "text": "; XMPP domain _xmpp-client._tcp.example.com. SRV 1 0 5222 im.example.net. _xmpp-client._tcp.example.com. RRSIG SRV ...",
      "ja": "; XMPPドメイン_xmpp-client._tcp.example.com。 SRV 1 0 5222 im.example.net。 _xmpp-client._tcp.example.com。 RRSIG SRV ..."
    },
    {
      "indent": 3,
      "text": "; target server hostname im.example.net. A 192.0.2.3 im.example.net. RRSIG A ...",
      "ja": ";サーバのホスト名のim.example.netをターゲットにしています。 192.0.2.3のim.example.net。 RRSIG A ..."
    },
    {
      "indent": 3,
      "text": "im.example.net. AAAA 2001:db8:212:8::e:4 im.example.net. RRSIG AAAA ...",
      "ja": "im.example.net。 AAAA 2001：DB8：212：8 :: E：4 im.example.net。 RRSIG AAAA ..."
    },
    {
      "indent": 3,
      "text": "; TLSA resource record _5222._tcp.im.example.net. TLSA ... _5222._tcp.im.example.net. RRSIG TLSA ...",
      "ja": "; TLSAリソースレコード_5222._tcp.im.example.net。 TLSA ... _5222._tcp.im.example.net。 RRSIG TLSA ..."
    },
    {
      "indent": 3,
      "text": "XMPP sessions for addresses at example.com are established at im.example.net. Connections to im.example.net port 5222 that use STARTTLS will get a server certificate that authenticates the name im.example.net.",
      "ja": "example.comのアドレスのためのXMPPセッションがim.example.netで確立されています。 STARTTLSを使用im.example.netポート5222への接続は、名前のim.example.netを認証サーバー証明書を取得します。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Rationale",
      "ja": "付録B.理論的根拠"
    },
    {
      "indent": 3,
      "text": "The long-term goal of this specification is to settle on TLS certificates that verify the target server hostname rather than the service domain name, since this is more convenient for servers hosting multiple domains (so-called \"multi-tenanted environments\") and scales up more easily to larger numbers of service domain names.",
      "ja": "これは、複数のドメイン（「マルチテナント環境」と呼ばれる）とスケールをホストするサーバにとってより便利であるので、この仕様の長期的な目標は、むしろサービスのドメイン名よりも、ターゲット・サーバーのホスト名を確認するTLS証明書に落ち着くことですサービスドメイン名の多数をより簡単に。"
    },
    {
      "indent": 3,
      "text": "There are a number of other reasons for doing it this way:",
      "ja": "このようにそれを行うための他の多くの理由があります："
    },
    {
      "indent": 3,
      "text": "o The certificate is part of the server configuration, so it makes sense to associate it with the target server hostname rather than the service domain name.",
      "ja": "O証明書は、サーバー構成の一部であるため、ターゲット・サーバーのホスト名ではなく、サービスのドメイン名に関連付けることが理にかなっています。"
    },
    {
      "indent": 3,
      "text": "o In the absence of TLS SNI, if the certificate identifies the target server hostname, then it does not need to list all the possible service domain names.",
      "ja": "証明書は、ターゲットサーバのホスト名を特定した場合、O TLS SNIがない場合には、それが可能なすべてのサービスドメイン名をリストする必要はありません。"
    },
    {
      "indent": 3,
      "text": "o When the server certificate is replaced, it is much easier if there is one part of the DNS that needs updating to match, instead of an unbounded number of hosted service domain names.",
      "ja": "サーバー証明書が交換される代わりに、ホスティングサービスドメイン名の無制限の数の一致するように更新する必要がDNSの1つの部分がある場合は、O、それははるかに簡単です。"
    },
    {
      "indent": 3,
      "text": "o The same TLSA records work with this specification, and with direct connections to the connection endpoint in the style of [RFC6698].",
      "ja": "O同じTLSAレコードは、この仕様で動作し、[RFC6698]のスタイルで接続エンドポイントへの直接接続を持ちます。"
    },
    {
      "indent": 3,
      "text": "o Some application protocols, such as SMTP, allow a client to perform transactions with multiple service domain names in the same connection. It is not, in general, feasible for the client to specify the service domain name using TLS SNI when the connection is established, and the server might not be able to present a certificate that authenticates all possible service domain names. See [RFC7672] for details.",
      "ja": "O SMTPなど一部のアプリケーション・プロトコルは、クライアントが同じ接続で複数のサービスドメイン名との取引を行うことを可能にします。クライアントは接続が確立され、サーバはすべての可能なサービスのドメイン名を認証する証明書を提示することはできない可能性がある場合TLS SNIを使用して、サービスのドメイン名を指定することは、一般的には、現実的ではありません。詳細については、[RFC7672]を参照してください。"
    },
    {
      "indent": 3,
      "text": "o It is common for SMTP servers to act in multiple roles -- for example, as outgoing relays or as incoming MX servers, depending on the client identity. It is simpler if the server can present the same certificate regardless of the role in which it is to act. Sometimes the server does not know its role until the client has authenticated, which usually occurs after TLS has been established. See [RFC7672] for details.",
      "ja": "例えば、送信リレーとしてまたは着信MXサーバとして、クライアントの識別情報に応じて、 -  O SMTPサーバが複数の役割で行動するのが一般的です。サーバは、それが動作するようになっている役割に関係なく、同じ証明書を提示することができればそれは簡単です。クライアントが認証されるまで、時々、サーバはTLSが確立された後に通常発生し、その役割を認識していません。詳細については、[RFC7672]を参照してください。"
    },
    {
      "indent": 3,
      "text": "This specification does not provide an option to put TLSA records under the service domain name, because that would add complexity without providing any benefit; security protocols are best kept simple. As described above, there are real-world cases where authenticating the service domain name cannot be made to work, so there would be complicated criteria regarding when service domain name TLSA records might be used and when they cannot. This is all avoided by putting the TLSA records under the target server hostname.",
      "ja": "それはどんな利点を提供せずに複雑さを追加することになりますので、この仕様では、サービスドメイン名の下TLSAレコードを入れるためのオプションを提供していません。セキュリティプロトコルは、最高のシンプルな保持されます。前述したように、サービスのドメイン名を認証すると、動作させることができない現実世界のケースがありますので、サービスのドメイン名TLSAレコードが使用されたとき、彼らはできないかもしれないときに関する複雑な基準が存在することになります。これは、すべてのターゲット・サーバーのホスト名の下にTLSAレコードを置くことによって回避されます。"
    },
    {
      "indent": 3,
      "text": "The disadvantage is that clients that do not complete DNSSEC validation must, according to [RFC6125] rules, check the server certificate against the service domain name, since they have no other way to authenticate the server. This means that SNI support or its functional equivalent is necessary for backward compatibility.",
      "ja": "欠点は、サーバーを認証する他の方法を持っていないので、DNSSEC検証を完了していないクライアントは、[RFC6125]の規則に従って、サービスのドメイン名に対してサーバ証明書をチェックしなければならないということです。これは、SNIサポートまたはその機能的同等物は、下位互換性のために必要であることを意味します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Mark Andrews for arguing that authenticating the target server hostname is the right thing, and that we ought to rely on DNSSEC to secure the SRV lookup. Thanks to Stephane Bortzmeyer, James Cloos, Viktor Dukhovni, Ned Freed, Olafur Gudmundsson, Paul Hoffman, Phil Pennock, Hector Santos, Jonas Schneider, and Alessandro Vesely for helpful suggestions.",
      "ja": "ターゲット・サーバーのホスト名を認証することは正しいことであり、我々はSRVルックアップを確保するためにDNSSECに依存するべきであることを主張していることのためにマーク・アンドリュースに感謝します。有用な提案のためのステファンBortzmeyer、ジェームズCloos、ヴィクトルDukhovni、ネッドフリード、オラフルグドムンソン、ポール・ホフマン、フィル・ペノック、ヘクターサントス、ジョナス・シュナイダー、そしてアレッサンドロVeselyに感謝します。"
    },
    {
      "indent": 3,
      "text": "Carl Wallace completed an insightful review on behalf of the Security Directorate.",
      "ja": "カール・ウォレスは、セキュリティ総局の代わりに洞察に満ちたレビューを完了しました。"
    },
    {
      "indent": 3,
      "text": "Ben Campbell, Brian Haberman, and Alvaro Retana provided helpful feedback during IESG review.",
      "ja": "ベン・キャンベル、ブライアンハーバーマン、そしてアルバロRetanaはIESGレビューの間有用なフィードバックを提供します。"
    },
    {
      "indent": 3,
      "text": "The authors gratefully acknowledge the assistance of Olafur Gudmundsson and Warren Kumari as the working group chairs and Stephen Farrell as the sponsoring Area Director.",
      "ja": "作者は感謝してスポンサーエリアディレクターとしてオラフルグドムンソンとワーキンググループの議長として、ウォーレン・クマリとステファン・ファレルの支援を認めます。"
    },
    {
      "indent": 3,
      "text": "Peter Saint-Andre wishes to acknowledge Cisco Systems, Inc., for employing him during his work on earlier draft versions of this document.",
      "ja": "ピーターサンアンドレはこのドキュメントの以前のドラフトバージョンの彼の仕事中に彼を採用するため、シスコシステムズ、株式会社を確認したいです。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Tony Finch University of Cambridge Information Services Roger Needham Building 7 JJ Thomson Avenue Cambridge CB3 0RB United Kingdom",
      "ja": "ケンブリッジインフォメーションサービスロジャーニーダムビル7 JJトムソンアベニューケンブリッジCB3 0RBイギリスのトニー・フィンチ大学"
    },
    {
      "indent": 3,
      "text": "Phone: +44 797 040 1426 Email: dot@dotat.at URI: http://dotat.at/",
      "ja": "電話：+44 797 040 1426 Eメール：URI dot@dotat.at：http://dotat.at/"
    },
    {
      "indent": 3,
      "text": "Matthew Miller Cisco Systems, Inc. 1899 Wynkoop Street, Suite 600 Denver, CO 80202 United States",
      "ja": "マシュー・ミラーシスコシステムズ株式会社1899 Wynkoopストリート、スイート600デンバー、CO 80202米国"
    },
    {
      "indent": 3,
      "text": "Email: mamille2@cisco.com",
      "ja": "メール：mamille2@cisco.com"
    },
    {
      "indent": 3,
      "text": "Peter Saint-Andre &yet",
      "ja": "まだピーターサンアンドレ＆"
    },
    {
      "indent": 3,
      "text": "Email: peter@andyet.com URI: https://andyet.com/",
      "ja": "メール：peter@andyet.com URI：https://andyet.com/"
    }
  ]
}