{
  "title": {
    "text": "RFC 7975 - Request Routing Redirection Interface for Content Delivery Network (CDN) Interconnection",
    "ja": "RFC 7975 - コンテンツ配信ネットワーク（CDN）の相互接続のためのルーティングリダイレクトインターフェイスをリクエスト"
  },
  "number": 7975,
  "created_at": "2019-11-02 23:27:50.313538+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)             B. Niven-Jenkins, Ed.\nRequest for Comments: 7975                                         Nokia\nCategory: Standards Track                        R. van Brandenburg, Ed.\nISSN: 2070-1721                                                      TNO\n                                                            October 2016",
      "raw": true
    },
    {
      "indent": 13,
      "text": "  Request Routing Redirection Interface for\nContent Delivery Network (CDN) Interconnection",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Request Routing interface comprises (1) the asynchronous advertisement of footprint and capabilities by a downstream Content Delivery Network (CDN) that allows an upstream CDN to decide whether to redirect particular user requests to that downstream CDN; and (2) the synchronous operation of an upstream CDN requesting whether a downstream CDN is prepared to accept a user request and of a downstream CDN responding with how to actually redirect the user request. This document describes an interface for the latter part, i.e., the CDNI Request Routing Redirection interface.",
      "ja": "リクエストルーティングインタフェースは、（1）下流コンテンツ配信ネットワークその下流CDNに特定のユーザ要求をリダイレクトするかどうかを決定するための上流CDNを可能にする（CDN）によってフットプリントと機能の非同期広告。 （2）上流のCDNの同期動作は、下流CDNは、ユーザ要求と実際にユーザ要求をリダイレクトする方法で応答下流CDNのを受け入れる用意があるかどうかを要求します。この文書では、後者の部分、すなわち、CDNIリクエストルーティングリダイレクトインターフェイスのインターフェイスを記述する。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7975.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7975で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Interface Function and Operation Overview . . . . . . . . . .   4\n4.  HTTP-Based Interface for the Redirection Interface  . . . . .   6\n  4.1.  Information Passed in RI Requests and Responses . . . . .   8\n  4.2.  JSON Encoding of RI Requests and Responses  . . . . . . .   9\n  4.3.  MIME Media Types Used by the RI Interface . . . . . . . .  11\n  4.4.  DNS Redirection . . . . . . . . . . . . . . . . . . . . .  12\n    4.4.1.  DNS Redirection Requests  . . . . . . . . . . . . . .  12\n    4.4.2.  DNS Redirection Responses . . . . . . . . . . . . . .  14\n  4.5.  HTTP Redirection  . . . . . . . . . . . . . . . . . . . .  17\n    4.5.1.  HTTP Redirection Requests . . . . . . . . . . . . . .  17\n    4.5.2.  HTTP Redirection Responses  . . . . . . . . . . . . .  19\n  4.6.  Cacheability and Scope of Responses . . . . . . . . . . .  22\n  4.7.  Error Responses . . . . . . . . . . . . . . . . . . . . .  24\n  4.8.  Loop Detection and Prevention . . . . . . . . . . . . . .  28\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .  29\n  5.1.  Authentication, Authorization, Confidentiality, and\n        Integrity Protection  . . . . . . . . . . . . . . . . . .  29\n  5.2.  Privacy . . . . . . . . . . . . . . . . . . . . . . . . .  30\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  31\n  6.1.  CDNI Payload Type Parameter Registrations . . . . . . . .  31\n    6.1.1.  CDNI RI Redirection Request Payload Type  . . . . . .  31\n    6.1.2.  CDNI RI Redirection Response Payload Type . . . . . .  31\n  6.2.  RI Error Response Registry  . . . . . . . . . . . . . . .  31\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  32\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .  32\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .  34\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  34\nContributors  . . . . . . . . . . . . . . . . . . . . . . . . . .  35\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  35",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "A Content Delivery Network (CDN) is a system built on an existing IP network that is used for large-scale content delivery, via prefetching or dynamically caching content on its distributed surrogates (caching servers). [RFC6707] describes the problem area of interconnecting CDNs.",
      "ja": "コンテンツ配信ネットワーク（CDN）は、プリフェッチを介して、または動的に分散サロゲート（キャッシュサーバ）上のコンテンツをキャッシュし、大規模コンテンツ配信のために使用されている既存のIPネットワーク上に構築されたシステムです。 [RFC6707]はのCDNを相互接続の問題の領域を記述する。"
    },
    {
      "indent": 3,
      "text": "The CDNI Request Routing interface outlined in [RFC7336] is comprised of:",
      "ja": "[RFC7336]に概説CDNIリクエストルーティングインタフェースはで構成されています。"
    },
    {
      "indent": 3,
      "text": "1. The asynchronous advertisement of footprint and capabilities by a downstream CDN (dCDN) that allows an upstream CDN (uCDN) to decide whether to redirect particular user requests to that dCDN.",
      "ja": "1.下流CDN上流CDN（uCDN）を可能にする（dCDN）によってフットプリントと機能の非同期の広告は、そのdCDNに特定のユーザ要求をリダイレクトするかどうかを決定します。"
    },
    {
      "indent": 3,
      "text": "2. The synchronous operation of a uCDN requesting whether a dCDN is prepared to accept a user request and of a dCDN responding with how to actually redirect the user request.",
      "ja": "2. uCDNの同期動作はdCDNが実際にユーザ要求をリダイレクトする方法で応答するユーザ要求とdCDNのを受け入れる用意があるかどうかを要求します。"
    },
    {
      "indent": 3,
      "text": "This document describes an interface for the latter part, i.e., the CDNI Request Routing Redirection interface (RI).",
      "ja": "この文書では、後者の部分、すなわち、CDNIリクエストルーティングリダイレクトインタフェース（RI）のためのインタフェースを記述しています。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "This document reuses the terminology defined in [RFC6707].",
      "ja": "この文書では、[RFC6707]で定義された用語を再利用します。"
    },
    {
      "indent": 3,
      "text": "The following additional terms are introduced by this document:",
      "ja": "以下の追加条件は、本文書によって導入されています。"
    },
    {
      "indent": 3,
      "text": "Application-Level Redirection: The act of using an application-specific redirection mechanism for the request routing process of a CDN. The Redirection Target (RT) is the result of a CDN's routing decision at the time it receives a content request via an application-specific protocol response. Examples of an application-level redirection are HTTP 302 Redirection and Real Time Messaging Protocol (RTMP) [RTMP] 302 Redirection.",
      "ja": "アプリケーションレベルのリダイレクト：CDNのリクエストルーティングプロセス用のアプリケーション固有のリダイレクションメカニズムを使用する行為。リダイレクションターゲット（RT）は、アプリケーション固有のプロトコル応答を介してコンテンツ要求を受信した時にCDNのルーティング決定の結果です。アプリケーションレベルのリダイレクションの例は、HTTP 302リダイレクトリアルタイムメッセージングプロトコル（RTMP）RTMP] 302リダイレクションです。"
    },
    {
      "indent": 3,
      "text": "DNS Redirection: The act of using DNS name resolution for the request routing process of a CDN. In DNS Redirection, the DNS name server of the CDN makes the routing decision based on a local policy and selects one or more Redirection Targets (RTs) and redirects the User Agent (UA) to the RT(s) by returning the details of the RT(s) in response to the DNS query request from the User Agent's DNS resolver.",
      "ja": "DNSリダイレクション：CDNの要求ルーティング処理のためのDNSの名前解決を使用しての行為。 DNSリダイレクションでは、CDNのDNSネームサーバはローカルポリシーに基づいてルーティング決定を行い、一つ以上のリダイレクションターゲット（RTS）を選択し、内容を返すことによって、RT（S）へのユーザーエージェント（UA）のリダイレクトユーザーエージェントのDNSリゾルバからのDNSクエリ要求に応じて、RT（複数可）。"
    },
    {
      "indent": 3,
      "text": "HTTP Redirection: The act of using an HTTP redirection response for the request routing process of a CDN. The Redirection Target (RT) is the result of the routing decision of a CDN at the time it receives a content request via HTTP. HTTP Redirection is a particular case of application-level redirection.",
      "ja": "HTTPリダイレクション：CDNのリクエストルーティングプロセスのHTTPリダイレクト応答を使用する行為。リダイレクションターゲット（RT）は、HTTPを介してコンテンツ要求を受信した時にCDNのルーティング決定の結果です。 HTTPリダイレクトは、アプリケーションレベルのリダイレクションの特定の場合です。"
    },
    {
      "indent": 3,
      "text": "Redirection Target (RT): The endpoint to which the User Agent is redirected. In CDNI, an RT may point to a number of different components, some examples include a surrogate in the same CDN as the request router, a request router in a dCDN, or a surrogate in a dCDN.",
      "ja": "リダイレクションターゲット（RT）：ユーザエージェントがリダイレクトされているエンドポイント。 CDNIにおいて、RTは、いくつかの例は、リクエストルータと同一のCDNで代用、dCDNにリクエストルータ、またはdCDNでサロゲートを含む、異なる成分の数を指してもよいです。"
    },
    {
      "indent": 0,
      "text": "3. Interface Function and Operation Overview",
      "section_title": true,
      "ja": "3.インタフェース機能と動作概要"
    },
    {
      "indent": 3,
      "text": "The main function of the CDNI Redirection interface (RI) is to allow the request routing systems in interconnected CDNs to communicate to facilitate the redirection of User Agent requests between interconnected CDNs.",
      "ja": "CDNIリダイレクトインタフェース（RI）の主な機能は、相互接続のCDNにおけるリクエストルーティングシステムが相互接続のCDNとの間のユーザエージェント要求のリダイレクトを容易にするために通信することを可能にすることです。"
    },
    {
      "indent": 3,
      "text": "The detailed requirements for the Redirection interface and their relative priorities are described in Section 5 of [RFC7337].",
      "ja": "リダイレクトインターフェイスの詳細な要件およびそれらの相対的な優先順位は、[RFC7337]のセクション5に記載されています。"
    },
    {
      "indent": 3,
      "text": "The User Agent will make a request to a request router in the uCDN using one of either DNS or HTTP. The RI is used between the uCDN and one or more dCDNs. The dCDN's RI response may contain a Redirection Target with a type that is compatible with the protocol used between the User Agent and uCDN request router. The dCDN has control over the Redirection Target it provides. Depending on the returned Redirection Target, the User Agent's request may be redirected to:",
      "ja": "ユーザーエージェントは、DNSまたはHTTPのいずれかのいずれかを使用してuCDNでリクエストルータに要求を行います。 RIはuCDNと1つまたは複数のdCDNsの間で使用されています。 dCDNのRI応答は、ユーザエージェントとuCDNのリクエストルータ間で使用されるプロトコルと互換性のあるタイプでリダイレクト先が含まれていてもよいです。 dCDNは、それが提供するリダイレクト先を制御しています。返されたリダイレクト先によっては、ユーザエージェントの要求はにリダイレクトされることがあります。"
    },
    {
      "indent": 3,
      "text": "o The final surrogate, which may be in the dCDN that returned the RI response to the uCDN or another CDN (if the dCDN delegates the delivery to another CDN); or",
      "ja": "uCDNまたは別のCDN（dCDN委譲場合、別のCDNへの送達）にRI応答を返さdCDNであってもよく、最終的な代理、O。または"
    },
    {
      "indent": 3,
      "text": "o A request router (in the dCDN or another CDN), which may use a different redirection protocol (DNS or HTTP) than the one included in the RI request.",
      "ja": "Oとは別のリダイレクション・プロトコル（DNSまたはHTTP）を使用することができる（dCDNまたは別のCDNにおける）リクエストルータは、RI要求に含まれます。"
    },
    {
      "indent": 3,
      "text": "The Redirection interface operates between the request routing systems of a pair of interconnected CDNs. To enable communication over the Redirection interface, the uCDN needs to know the URI (endpoint) in the dCDN to send CDNI request routing queries.",
      "ja": "リダイレクトインターフェイスは、相互接続のCDNの一対のリクエストルーティングシステムとの間で動作します。リダイレクトインターフェイスを介した通信を可能にするために、uCDNはCDNI要求ルーティングクエリを送信するためにdCDNでURI（エンドポイント）を知る必要があります。"
    },
    {
      "indent": 3,
      "text": "The Redirection interface URI may be statically preconfigured, dynamically discovered via the CDNI Control interface, or discovered via other means. However, such discovery mechanisms are not specified in this document, as they are considered out of the scope of the Redirection interface specification.",
      "ja": "URIは、静的に事前に設定することができるリダイレクトインターフェイスは、動的CDNIコントロールインターフェースを介して発見された、または他の手段を介して発見されました。それらはリダイレクトインターフェイス仕様の範囲外と考えられているようしかし、そのような発見メカニズムは、この文書で指定されていません。"
    },
    {
      "indent": 3,
      "text": "The Redirection interface is only relevant in the case of Recursive Request Redirection, as Iterative Request Redirection does not invoke any interaction over the Redirection interface between interconnected CDNs. Therefore, the scope of this document is limited to Recursive Request Redirection.",
      "ja": "反復要求リダイレクションが相互接続のCDNとの間のリダイレクトインタフェース上の任意の相互作用を起動しないようにリダイレクトインターフェイスは、再帰要求リダイレクションの場合にのみ関係します。したがって、この文書の範囲は、再帰的要求リダイレクションに制限されています。"
    },
    {
      "indent": 3,
      "text": "In the case of Recursive Request Redirection, in order to perform redirection of a request received from a User Agent, the uCDN queries the dCDN so that the dCDN can select and provide a Redirection Target. In cases where a uCDN has a choice of dCDNs, it is up to the uCDN to decide (for example, via configured policies) which dCDN(s) to query and in which order to query them. A number of strategies are possible, including selecting a preferred dCDN based on local policy, possibly falling back to querying an alternative dCDN(s) if the first dCDN does not return a Redirection Target or otherwise rejects the uCDN's RI request. A more complex strategy could be to query multiple dCDNs in parallel before selecting one and using the Redirection Target provided by that dCDN.",
      "ja": "dCDNは、リダイレクト先を選択し、提供できるように再帰的な要求リダイレクションの場合、ユーザエージェントから受信した要求のリダイレクトを実行するためには、uCDNはdCDNを照会します。 uCDNがdCDNsの選択肢を持っている場合には、それはdCDN（s）が照会すると、どの順番でそれらを照会するためにどの（設定されたポリシーを経て、たとえば）を決定するuCDN次第です。戦略の数は、おそらく最初dCDNは、リダイレクト先を返すか、さもなければuCDNのRI要求を拒否しない場合、代替dCDN（複数可）を照会にフォールバック、ローカルポリシーに基づいて、好ましいdCDNを選択することを含む、可能です。より複雑な戦略は、いずれかを選択し、そのdCDNが提供するリダイレクトターゲットを使用する前に、並行して複数のdCDNsを照会することができます。"
    },
    {
      "indent": 3,
      "text": "The uCDN->User Agent redirection protocols addressed in this document are: DNS redirection and HTTP redirection. Other types of application-level redirection will not be discussed further in this document. However, the Redirection interface is designed to be extensible and could be extended to support additional application-level redirection protocols.",
      "ja": "リダイレクトプロトコルは、本書で取り上げuCDN->ユーザーエージェントです：DNSリダイレクションおよびHTTPリダイレクト。アプリケーションレベルのリダイレクションの他のタイプは、この文書でさらに議論されることはありません。しかし、リダイレクトインターフェイスが拡張できるように設計されており、追加のアプリケーションレベルのリダイレクション・プロトコルをサポートするように拡張することができます。"
    },
    {
      "indent": 3,
      "text": "For both DNS and HTTP redirection, either HTTP or HTTPS could be used to connect to the Redirection Target. When HTTPS is used to connect to the uCDN, if the uCDN uses DNS redirection to identify the RT to the User Agent, then the new target domain name may not match the domain in the URL dereferenced to reach the uCDN; without operational precautions, and in the absence of DNSSEC, this can make a legitimate redirection look like a DNS-based attack to a User Agent and trigger security warnings. When DNS-based redirection with HTTPS is used, this specification assumes that any RT can complete the necessary Transport Layer Security (TLS) handshake with the User Agent. Any operational mechanisms this requires, e.g., private key distribution to surrogates and request routers in dCDNs, are outside the scope of this document.",
      "ja": "DNSおよびHTTPリダイレクト、両方のためにHTTPまたはHTTPSは、リダイレクションターゲットに接続するために使用することができます。 HTTPSはuCDNは、ユーザエージェントにRTを識別するために、DNSリダイレクトを使用している場合、uCDNに接続するために使用されている場合は、新しいターゲット・ドメイン名はuCDNに到達するために間接参照URL内のドメインと一致しない場合があります。運用上の注意なし、およびDNSSECの不存在下で、これは正当なリダイレクトはユーザエージェントにDNSベースの攻撃のように見えるし、セキュリティ警告をトリガすることができます。 HTTPSでのDNSベースのリダイレクションを使用する場合は、この仕様はどんなRTはユーザーエージェントとの必要なトランスポート層セキュリティ（TLS）ハンドシェイクを完了できることを前提としています。これは、例えば、dCDNsにおけるサロゲートリクエストルータにプライベート鍵配布を必要とする任意の動作機構は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "This document also defines an RI loop prevention and detection mechanism as part of the Redirection interface.",
      "ja": "この文書はまた、リダイレクトインタフェースの一部としてRIループ防止及び検出機構を定義します。"
    },
    {
      "indent": 0,
      "text": "4. HTTP-Based Interface for the Redirection Interface",
      "section_title": true,
      "ja": "リダイレクトインターフェイス4. HTTPベースのインタフェース"
    },
    {
      "indent": 3,
      "text": "This document defines a simple interface for the Redirection interface based on HTTP [RFC7230], where the attributes of a User Agent's requests are encapsulated along with any other data that can aid the dCDN in processing the requests. The RI response encapsulates the attributes of the RT(s) that the uCDN should return to the User Agent (if it decides to utilize the dCDN for delivery) along with the policy for how the response can be reused. The examples of RI requests and responses below do not contain a complete set of HTTP headers for brevity; only the pertinent HTTP headers are shown.",
      "ja": "この文書では、ユーザーエージェントの要求の属性が要求を処理でdCDNを支援することができ、他のデータと一緒に封入されているHTTP [RFC7230]に基づいてリダイレクトインターフェイスのためのシンプルなインターフェイスを定義します。 RI応答は、応答が再利用できるかのポリシーと一緒に（それは配達のためdCDNを利用することを決定した場合）uCDNはユーザエージェントに戻す必要があることをRT（S）の属性をカプセル化します。以下RIの要求と応答の例は、簡潔にするために、HTTPヘッダーの完全なセットが含まれていません。唯一の適切なHTTPヘッダが表示されます。"
    },
    {
      "indent": 3,
      "text": "The RI between the uCDN and dCDN uses the same HTTP interface to encapsulate the attributes of both DNS and HTTP requests received from User Agents, although the contents of the RI requests/responses contain data specific to either DNS or HTTP redirection.",
      "ja": "uCDNとdCDN間のRIは、DNSとHTTPリクエストの両方の属性をカプセル化するために同一のHTTPインタフェースを使用RI要求/応答の内容がDNSまたはHTTPリダイレクトのいずれかに固有のデータが含まれているものの、ユーザエージェントから受け取りました。"
    },
    {
      "indent": 3,
      "text": "This approach has been chosen because it enables CDN operators to only have to deploy a single interface for the RI between their CDNs, regardless of the User Agent redirection method. In this way, from an operational point of view, there is only one interface to monitor, manage, develop troubleshooting tools for, etc.",
      "ja": "それは関係なく、ユーザエージェントリダイレクション方式の、彼らのCDNとの間でRIのための単一のインタフェースを展開する必要が唯一のCDN事業者を可能にしますので、このアプローチが選択されています。このように、動作の観点から、など、監視、管理、トラブルシューティングのためのツールを開発するために1つのインタフェースだけがあります"
    },
    {
      "indent": 3,
      "text": "In addition, having a single RI where the attributes of the User Agent's DNS or HTTP request are encapsulated along with the other data required for the dCDN to make a request routing decision, avoids having to both 1) try to encapsulate or proxy DNS/HTTP/RTMP/ etc. requests and 2) find ways to somehow embed the additional CDNI Request Routing Redirection interface properties/data within those end-user DNS/HTTP/RTMP/etc. requests.",
      "ja": "また、両方の1）またはプロキシDNS / HTTPをカプセル化しようとした、ユーザーエージェントのDNSまたはHTTPリクエストの属性が要求ルーティングの決定を行うためにdCDNために必要な他のデータと一緒にカプセル化された単一RIを回避しました/ RTMP /等の要求及び2）何らかの形でこれらのエンドユーザDNS / HTTP / RTMPの/ etc内のリダイレクト界面特性/データをルーティング追加CDNI要求を埋め込む方法を見つけます。リクエスト。"
    },
    {
      "indent": 3,
      "text": "Finally, the RI is easily extendable to support other User Agent request redirection methods (e.g., RTMP 302 redirection) by defining additional protocol-specific keys for RI requests and responses along with a specification about how to process them.",
      "ja": "最後に、RIは、それらを処理する方法についての仕様とともにRI要求と応答のための追加のプロトコル固有のキーを定義することによって、他のユーザエージェント要求のリダイレクト方法（例えば、RTMP 302リダイレクション）をサポートするように容易に拡張可能です。"
    },
    {
      "indent": 3,
      "text": "The generic Recursive Request Redirection message flow between Request Routing systems in a pair of interconnected CDNs is as follows:",
      "ja": "次のように相互接続のCDN一対のリクエストルーティングシステム間の一般的な再帰要求リダイレクションメッセージフローです。"
    },
    {
      "indent": 3,
      "text": "User Agent                CDN B RR                  CDN A RR\n    |UA Request (DNS or HTTP) |                         |\n    |-------------------------------------------------->| (1)\n    |                         |                         |\n    |                         |HTTP POST to CDN B's RI  |\n    |                         |URI encapsulating UA     |\n    |                         |request attributes       |\n    |                         |<------------------------| (2)\n    |                         |                         |\n    |                         |HTTP Response with body  |\n    |                         |containing RT attributes |\n    |                         |of the protocol-specific |\n    |                         |response to return to UA |\n    |                         |------------------------>| (3)\n    |                         |                         |\n    |           Protocol-specific response (redirection)|\n    |<--------------------------------------------------| (4)\n    |                         |                         |",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Figure 1: Generic Recursive Request Redirection Message Flow",
      "ja": "図1：一般的な再帰的な要求リダイレクションメッセージフロー"
    },
    {
      "indent": 3,
      "text": "1. The User Agent sends its (DNS or HTTP) request to CDN A. The Request Routing System of CDN A processes the request and, through local policy, recognizes that the request is best served by another CDN, specifically CDN B (or that CDN B may be one of a number of candidate dCDNs it could use).",
      "ja": "1.ユーザーエージェントは、CDN Aのリクエストルーティングシステムはリクエストを処理し、ローカルポリシーによって、要求が最高の別のCDNによって提供されていることを認識し、特にCDN B（またはことCDN Aにその（DNSまたはHTTP）リクエストを送信しますCDN Bは、それが使用できる候補dCDNs）のうちの1つであってもよいです。"
    },
    {
      "indent": 3,
      "text": "2. The Request Routing System of CDN A sends an HTTP POST to CDN B's RI URI containing the attributes of the User Agent's request.",
      "ja": "2.リクエストCDN Aのルーティングシステムは、ユーザエージェントの要求の属性を含むCDN BのRI URIにHTTP POSTを送信します。"
    },
    {
      "indent": 3,
      "text": "3. The Request Routing System of CDN B processes the RI request and, assuming the request is well-formed, responds with an HTTP \"200\" response with a message body containing the RT(s) to return to the User Agent as well as parameters that indicate the properties of the response (cacheability and scope).",
      "ja": "3.リクエストCDN Bのルーティングシステムは、RIの要求を処理し、要求を十分に形成されていると仮定すると、ユーザエージェントに戻り、ならびにするRTを含むメッセージ本体とHTTP「200」応答（S）で応答します応答（キャッシュ可能と範囲）の特性を示すパラメータ。"
    },
    {
      "indent": 3,
      "text": "4. The Request Routing System of CDN A sends a protocol-specific response (containing the returned attributes) to the User Agent, so that the User Agent's request will be redirected to the RT(s) returned by CDN B.",
      "ja": "ユーザーエージェントの要求がCDN B.によって返さRT（複数可）にリダイレクトされるように、4リクエストCDN Aのルーティングシステムは、ユーザエージェントにプロトコル固有の応答を（返される属性を含む）を送信します"
    },
    {
      "indent": 0,
      "text": "4.1. Information Passed in RI Requests and Responses",
      "section_title": true,
      "ja": "4.1。 RIのリクエストとレスポンスに渡される情報"
    },
    {
      "indent": 3,
      "text": "The information passed in RI requests splits into two basic categories:",
      "ja": "RI要求で渡された情報は、2つの基本的なカテゴリに分割します。"
    },
    {
      "indent": 3,
      "text": "1. The attributes of the User Agent's request to the uCDN.",
      "section_title": true,
      "ja": "1. uCDNへのユーザーエージェントのリクエストの属性。"
    },
    {
      "indent": 3,
      "text": "2. Properties/parameters that the uCDN can use to control the dCDN's response or that can help the dCDN make its decision.",
      "ja": "uCDNがdCDNの応答を制御するために使用することができますまたはそれはdCDNは、その意思決定を助けることができます。2.プロパティ/パラメータ。"
    },
    {
      "indent": 3,
      "text": "Generally, dCDNs can provide better routing decisions given additional information about the content request, e.g., the URI of the requested content or the User Agent's IP address or subnet. The information required to base a routing decision on can be highly dependent on the type of content delivered. A uCDN SHOULD only include information that is absolutely necessary for delivering that type of content. Cookies in particular are especially sensitive from a security/privacy point of view and in general SHOULD NOT be conveyed in the RI Requests to the dCDN. The information necessary to be conveyed for a particular type of request is expected to be conveyed out of band between the uCDN and dCDN. See Section 5.2 for more detail on the privacy aspects of using RI Requests to convey information about UA requests.",
      "ja": "一般的に、dCDNsは、コンテンツ要求、例えば、要求されたコンテンツのURIまたはユーザーエージェントのIPアドレスまたはサブネットに関する追加情報与えられ、より良いルーティング決定を提供することができます。上のルーティング決定を基に必要な情報が配信されたコンテンツの種類に大きく依存することができます。 uCDNのみコンテンツの種類を送達するために絶対に必要な情報を含むべきです。特にクッキーは、ビューのセキュリティ/プライバシーの点から特に敏感であり、一般的にdCDNにRI要求に搬送されるべきではありません。要求の特定のタイプのために搬送されるのに必要な情報がuCDNとdCDN間の帯域外に搬送されることが期待されます。 UA要求に関する情報を伝えるためにRIの要求を使用してのプライバシーの側面に関する詳細については、セクション5.2を参照してください。"
    },
    {
      "indent": 3,
      "text": "In order for the dCDN to determine whether it is capable of delivering any requested content, it requires CDNI metadata related to the content the User Agent is requesting. That metadata will describe the content and any policies associated with it. It is expected that the RI request contains sufficient information for the Request Router in the dCDN to be able to retrieve the required CDNI Metadata via the CDNI Metadata interface.",
      "ja": "dCDNは、それがどんな要求されたコンテンツを送達することが可能であるかどうかを判断するためには、それは、ユーザエージェントが要求しているコンテンツに関連CDNIメタデータが必要です。そのメタデータは、コンテンツとそれに関連するすべてのポリシーを記述します。 RIの要求がCDNIメタデータインタフェースを介して必要なCDNIメタデータを取得することができるようにdCDNでリクエストルータのための十分な情報が含まれていることを期待されています。"
    },
    {
      "indent": 3,
      "text": "The information passed in RI responses splits into two basic categories:",
      "ja": "RI応答に渡された情報は、2つの基本的なカテゴリに分割します。"
    },
    {
      "indent": 3,
      "text": "1. The attributes of the RT to return to the User Agent in the DNS response or HTTP response.",
      "ja": "1. RTの属性は、DNS応答やHTTP応答でユーザーエージェントに戻ります。"
    },
    {
      "indent": 3,
      "text": "2. Parameters/policies that indicate the properties of the response, such as, whether it is cacheable, the scope of the response, etc.",
      "ja": "2.パラメータ/ような、それがキャッシュ可能であるかどうか、応答の範囲、等の応答特性を示すポリシー"
    },
    {
      "indent": 3,
      "text": "In addition to details about how to redirect the User Agent, the dCDN may wish to return additional policy information to the uCDN. For example, the dCDN may wish to return a policy that expresses \"this response can be reused without requiring an RI request for 60 seconds provided the User Agent's IP address is in the range 198.51.100.0 -- 198.51.100.255\".",
      "ja": "ユーザーエージェントをリダイレクトする方法についての詳細に加えて、dCDNはuCDNに追加のポリシー情報を返すこともできます。例えば、dCDNは「 -  198.51.100.255この応答は、ユーザーエージェントのIPアドレスが範囲198.51.100.0で提供される60秒のためのRI要求を必要とせずに再利用することができ、」表現する方針を返すこともできます。"
    },
    {
      "indent": 3,
      "text": "These additional policies split into two basic categories:",
      "ja": "これらの追加のポリシーは、2つの基本的なカテゴリに分かれ："
    },
    {
      "indent": 3,
      "text": "o Cacheability information signaled via the HTTP response headers of the RI response (to reduce the number of subsequent RI requests the uCDN needs to make).",
      "ja": "O RI応答のHTTPレスポンスヘッダを介してシグナリングさキャッシュ可能情報（以降RIがuCDNを行う必要がある要求の数を減らすために）。"
    },
    {
      "indent": 3,
      "text": "o The scope of a cacheable response signaled in the HTTP response body of the RI response, for example, whether the response applies to a wider range of IP addresses than what was included in the RI request.",
      "ja": "Oキャッシュ可能な応答の範囲は、応答がRI要求に含まれていたものよりもIPアドレスのより広い範囲に適用されるかどうか、例えば、RI応答のHTTPレスポンスボディに合図しました。"
    },
    {
      "indent": 3,
      "text": "The cacheability of the response is indicated using the standard HTTP Cache-Control mechanisms.",
      "ja": "レスポンスのキャッシュ可能性は、標準的なHTTPキャッシュ制御機構を使用して示されています。"
    },
    {
      "indent": 0,
      "text": "4.2. JSON Encoding of RI Requests and Responses",
      "section_title": true,
      "ja": "4.2。 RIの要求および応答のJSONエンコーディング"
    },
    {
      "indent": 3,
      "text": "The body of RI requests and responses is a JSON object [RFC7159] that contains a dictionary of key:value pairs that MUST conform to [RFC7493]. Senders MUST encode all (top-level object and sub-object) keys specified in this document in lowercase. Receivers MUST ignore any keys that are unknown or invalid.",
      "ja": "[RFC7493]に従わなければなりません値のペア：RIのリクエストとレスポンスのボディは、キーの辞書が含まれているJSONオブジェクト[RFC7159]です。送信者は、全ての（最上位レベルのオブジェクトおよびサブオブジェクト）小文字で、この文書で指定されたキーを符号化しなければなりません。レシーバは不明または無効である任意のキーを無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The following table defines the top-level keys and indicates whether they are applicable to RI requests, RI responses, or both:",
      "ja": "次の表は、トップレベルのキーを定義し、それらがRI要求、RI応答、または両方に適用可能であるかどうかを示します。"
    },
    {
      "indent": 3,
      "text": "+----------+------------------+-------------------------------------+\n| Key      | Request/Response | Description                         |\n+----------+------------------+-------------------------------------+\n| dns      | Both             | The attributes of the UA's DNS      |\n|          |                  | request or the attributes of the    |\n|          |                  | RT(s) to return in a DNS response.  |\n|          |                  |                                     |\n| http     | Both             | The attributes of the UA's HTTP     |\n|          |                  | request or the attributes of the RT |\n|          |                  | to return in an HTTP response.      |\n|          |                  |                                     |\n| scope    | Response         | The scope of the response (if it is |\n|          |                  | cacheable). For example, whether    |\n|          |                  | the response applies to a wider     |\n|          |                  | range of IP addresses than what was |\n|          |                  | included in the RI request.         |\n|          |                  |                                     |\n| error    | Response         | Additional details if the response  |\n|          |                  | is an error response.               |\n|          |                  |                                     |\n| cdn-path | Both             | A List of Strings. Contains a list  |\n|          |                  | of the CDN Provider IDs of previous |\n|          |                  | CDNs that have participated in the  |\n|          |                  | request routing for the associated  |\n|          |                  | User Agent request. On RI requests, |\n|          |                  | it contains the list of previous    |\n|          |                  | CDNs that this RI request has       |\n|          |                  | passed through. On RI responses, it |\n|          |                  | contains the list of CDNs that were |\n|          |                  | involved in obtaining the final     |\n|          |                  | redirection included in the RI      |\n|          |                  | response. See Section 4.8.          |\n|          |                  |                                     |\n| max-hops | Request          | Integer specifying the maximum      |\n|          |                  | number of hops (CDN Provider IDs)   |\n|          |                  | this request is allowed to be       |\n|          |                  | propagated along. This allows the   |\n|          |                  | uCDN to coarsely constrain the      |\n|          |                  | latency of the request routing      |\n|          |                  | chain.                              |\n+----------+------------------+-------------------------------------+",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Table 1: Top-Level Keys in RI Requests/Responses",
      "ja": "表1：RI要求/応答におけるトップレベルの鍵"
    },
    {
      "indent": 3,
      "text": "A single request or response MUST contain only one of the dns or http keys. Requests MUST contain a cdn-path key and responses MAY contain a cdn-path key. If the max-hops key is not present, then there is no limit on the number of CDN hops that the RI request can be propagated along. If the first uCDN does not wish the RI request to be propagated beyond the dCDN it is making the request to, then the uCDN MUST set max-hops to 1.",
      "ja": "単一の要求または応答は、DNS（またはHTTP）キーを1つだけ含まなければなりません。要求はCDNパスキーを含まなければならないとの応答がCDNパスキーを含むかもしれません。 MAX-ホップキーが存在しない場合は、CDNの数に制限はありませんRI要求に沿って伝播させることができることをホップ。最初uCDNは、それが要求に行っているdCDNを超えて伝播するRI要求を希望しない場合は、uCDNは1に、最大ホップを設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The cdn-path MAY be reflected back in RI responses, although doing so could expose information to the uCDN that a dCDN may not wish to expose (for example, the existence of business relationships between a dCDN and other CDNs).",
      "ja": "そうすることdCDNが公開したくない場合があることuCDNに情報を公開する可能性がCDN-pathは、バックRI応答に反映されてもよい（例えば、dCDNおよび他のCDNとの間のビジネス関係の存在）。"
    },
    {
      "indent": 3,
      "text": "If the cdn-path is reflected back in the RI response, it MUST contain the value of cdn-path received in the associated RI request with the final dCDN's CDN Provider ID appended. Transit CDNs MAY remove the cdn-path from RI responses but MUST NOT modify the cdn-path in other ways.",
      "ja": "CDNパスバックRI応答に反映されている場合、それは添付最終dCDNのCDNプロバイダIDに関連付けられたRI要求で受信CDNパスの値を含まなければなりません。トランジットのCDNは、RI応答からCDN-パスを削除することができるが、他の方法でCDN-パスを変更してはいけません。"
    },
    {
      "indent": 3,
      "text": "The presence of an error key within a response that also contains either a dns or http key does not automatically indicate that the RI request was unsuccessful as the error key MAY be used for communicating additional (e.g., debugging) information. When a response contains an error key as well as either a dns or http key, the error-code SHOULD be 1xx (e.g., 100). See Section 4.7 for more details about encoding error information in RI responses.",
      "ja": "また、DNSまたはHTTPキー自動的にエラーキーを追加（例えば、デバッグ）情報を通信するために用いることができるRI要求が失敗したことを示すものではないのいずれかを含む応答内のエラーキーの存在。応答がエラーキー、並びに、DNSまたはHTTPキーのいずれかが含まれている場合、エラーコードは、1XX（例えば、100）であるべきです。 RIの応答でエラー情報を符号化の詳細については、セクション4.7を参照してください。"
    },
    {
      "indent": 3,
      "text": "All implementations that support IPv4 addresses MUST support the encoding specified by the 'IPv4address' rule in Section 3.2.2 of [RFC3986]. Likewise, implementations that support IPv6 addresses MUST support all IPv6 address formats specified in [RFC4291]. Server implementations SHOULD use IPv6 address formats specified in [RFC5952].",
      "ja": "IPv4のアドレスをサポートするすべての実装は、[RFC3986]のセクション3.2.2に「IPv4Addressを」ルールで指定されたエンコーディングをサポートしなければなりません。同様に、IPv6のアドレスをサポートする実装は、[RFC4291]で指定されたすべてのIPv6アドレス形式をサポートしなければなりません。サーバ実装は、[RFC5952]で指定されたIPv6アドレス形式を使用すべきです。"
    },
    {
      "indent": 0,
      "text": "4.3. MIME Media Types Used by the RI Interface",
      "section_title": true,
      "ja": "4.3。 RIインターフェイスが使用するMIMEメディアタイプ"
    },
    {
      "indent": 3,
      "text": "RI requests MUST use a MIME media type of application/cdni as specified in [RFC7736], with the Payload Type (ptype) parameter set to 'redirection-request'.",
      "ja": "[RFC7736]で指定されるようRIリクエストは「リダイレクション要求」に設定ペイロードタイプ（p型）パラメータで、アプリケーション/ cdniのMIMEメディアタイプを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "RI responses MUST use a MIME media type of application/cdni as specified in [RFC7736], with the Payload Type (ptype) parameter set to 'redirection-response'.",
      "ja": "[RFC7736]で指定されるようRI応答が「リダイレクト応答」に設定ペイロードタイプ（p型）パラメータで、アプリケーション/ cdniのMIMEメディアタイプを使用しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.4. DNS Redirection",
      "section_title": true,
      "ja": "4.4。 DNSリダイレクション"
    },
    {
      "indent": 3,
      "text": "The following sections provide detailed descriptions of the information that should be passed in RI requests and responses for DNS redirection.",
      "ja": "次のセクションでは、DNSリダイレクションのためのRIのリクエストとレスポンスで渡されるべき情報の詳細な説明を提供しています。"
    },
    {
      "indent": 0,
      "text": "4.4.1. DNS Redirection Requests",
      "section_title": true,
      "ja": "4.4.1。 DNSリダイレクション要求"
    },
    {
      "indent": 3,
      "text": "For DNS-based redirection, the uCDN needs to pass the following information to the dCDN in the RI request:",
      "ja": "DNSベースのリダイレクションのために、uCDNはRI要求にdCDNに以下の情報を渡す必要があります。"
    },
    {
      "indent": 3,
      "text": "o The IP address of the DNS resolver that made the DNS request to the uCDN.",
      "ja": "uCDNへのDNS要求を行ったDNSリゾルバのIPアドレス、O。"
    },
    {
      "indent": 3,
      "text": "o The type of DNS query made (usually either A or AAAA).",
      "ja": "DNSクエリのタイプ（通常はAまたはAAAAのいずれか）製のO。"
    },
    {
      "indent": 3,
      "text": "o The class of DNS query made (usually IN).",
      "ja": "O製のDNSクエリのクラス（通常はIN）。"
    },
    {
      "indent": 3,
      "text": "o The fully qualified domain name for which DNS redirection is being requested.",
      "ja": "DNSリダイレクションが要求されている完全修飾ドメイン名O。"
    },
    {
      "indent": 3,
      "text": "o The IP address or prefix of the User Agent (if known to the uCDN).",
      "ja": "ユーザーエージェントのIPアドレスまたはプレフィックスO（uCDNに知られている場合）。"
    },
    {
      "indent": 3,
      "text": "The preceding information is encoded as a set of key:value pairs within the dns dictionary as follows:",
      "ja": "次のようにDNS辞書内の値のペア：上記の情報は、キーのセットとしてコードされます。"
    },
    {
      "indent": 3,
      "text": "+-------------+---------+-----------+-------------------------------+\n| Key         | Value   | Mandatory | Description                   |\n+-------------+---------+-----------+-------------------------------+\n| resolver-ip | String  | Yes       | The IP address of the UA's    |\n|             |         |           | DNS resolver.                 |\n|             |         |           |                               |\n| qtype       | String  | Yes       | The type of DNS query made by |\n|             |         |           | the UA's DNS resolvers in     |\n|             |         |           | uppercase.  The value of this |\n|             |         |           | field SHALL be set to either  |\n|             |         |           | 'A' or 'AAAA'.                |\n|             |         |           |                               |\n| qclass      | String  | Yes       | The class of DNS query made   |\n|             |         |           | in uppercase (IN, etc.).      |\n|             |         |           |                               |\n| qname       | String  | Yes       | The fully qualified domain    |\n|             |         |           | name being queried.           |\n|             |         |           |                               |\n| c-subnet    | String  | No        | The IP address (or prefix) of |\n|             |         |           | the UA in Classless Inter-    |\n|             |         |           | Domain Routing (CIDR) format. |\n|             |         |           |                               |\n| dns-only    | Boolean | No        | If True, then dCDN MUST only  |\n|             |         |           | use DNS redirection and MUST  |\n|             |         |           | include RTs to one or more    |\n|             |         |           | surrogates in any successful  |\n|             |         |           | RI response.  CDNs MUST       |\n|             |         |           | include the dns-only property |\n|             |         |           | set to True on any cascaded   |\n|             |         |           | RI requests.  Defaults to     |\n|             |         |           | False.                        |\n+-------------+---------+-----------+-------------------------------+",
      "raw": true
    },
    {
      "indent": 34,
      "text": "Table 2",
      "ja": "表2"
    },
    {
      "indent": 3,
      "text": "An RI request for DNS-based redirection MUST include a dns dictionary. This dns dictionary MUST contain the following keys: resolver-ip, qtype, qclass, and qname; the value of each MUST be the value of the appropriate part of the User Agent's DNS query/request. For internationalized domain names containing non-ASCII characters, the value of the qname field MUST be the ASCII-compatible encoded (ACE) representation (A-label) of the domain name [RFC5890].",
      "ja": "DNSベースのリダイレクションのためのRIの要求は、DNS辞書を含まなければなりません。このDNS辞書には、次のキーを含まなければなりません：リゾルバ-IP、QTYPE、QCLASS、とのqnameを。それぞれの値は、ユーザーエージェントのDNSクエリ/要求の適切な部分の値でなければなりません。非ASCII文字を含む国際化ドメイン名のために、QNameのフィールドの値は、ドメイン名[RFC5890]のASCII互換符号化（ACE）表現（ラベル）でなければなりません。"
    },
    {
      "indent": 3,
      "text": "An example RI request (uCDN->dCDN) for DNS-based redirection is as follows:",
      "ja": "次のようにDNSベースのリダイレクションのために（CDN-> CDN）を要求するために例を示します。"
    },
    {
      "indent": 3,
      "text": "POST /dcdn/ri HTTP/1.1 Host: rr1.dcdn.example.net Content-Type: application/cdni; ptype=redirection-request Accept: application/cdni; ptype=redirection-response",
      "ja": "POST / dcdn / RI HTTP / 1.1ホスト：rr1.dcdn.example.netのコンテンツタイプ：アプリケーション/ cdni。 p型=リダイレクト要求受諾：アプリケーション/ cdni。 p型=リダイレクト応答"
    },
    {
      "indent": 3,
      "text": "{\n  \"dns\" : {\n    \"resolver-ip\" : \"192.0.2.1\",\n    \"c-subnet\" : \"198.51.100.0/24\",\n    \"qtype\" : \"A\",\n    \"qclass\" : \"IN\",\n    \"qname\" : \"www.example.com\"\n  },\n  \"cdn-path\": [\"AS64496:0\"],\n  \"max-hops\": 3\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.4.2. DNS Redirection Responses",
      "section_title": true,
      "ja": "4.4.2。 DNSのリダイレクション応答"
    },
    {
      "indent": 3,
      "text": "For a successful DNS-based redirection, the dCDN needs to return one of the following to the uCDN in the RI response:",
      "ja": "成功したDNSベースのリダイレクションのために、dCDNはRI応答でuCDNに次のいずれかを返す必要があります："
    },
    {
      "indent": 3,
      "text": "o The IP address(es) of (or the CNAME of) RTs that are dCDN surrogates (if the dCDN is performing DNS-based redirection directly to a surrogate); or",
      "ja": "dCDN代用物（dCDNがサロゲートに直接DNSベースのリダイレクションを実行している場合）であるのRT（またはCNAME）IPアドレス（ES）のO。または"
    },
    {
      "indent": 3,
      "text": "o The IP address(es) of (or the CNAME of) RTs that are Request Routers (if the dCDN will perform request redirection itself). A dCDN MUST NOT return an RT that is a Request Router if the dns-only key is set to True in the RI request.",
      "ja": "IPアドレス（ES）（またはCNAME）リクエストルータ（dCDN要求のリダイレクト自体を実行する場合）であるのRT O。 dCDNは、DNS専用キーはRI要求にTrueに設定されている場合、リクエストルータであるRTを返してはなりません。"
    },
    {
      "indent": 3,
      "text": "The preceding information is encoded as a set of key:value pairs within the dns dictionary as follows:",
      "ja": "次のようにDNS辞書内の値のペア：上記の情報は、キーのセットとしてコードされます。"
    },
    {
      "indent": 3,
      "text": "+-------+-----------+-----------+-----------------------------------+\n| Key   | Value     | Mandatory | Description                       |\n+-------+-----------+-----------+-----------------------------------+\n| rcode | Integer   | Yes       | DNS response code (see            |\n|       |           |           | [RFC6895]).                       |\n|       |           |           |                                   |\n| name  | String    | Yes       | The fully qualified domain name   |\n|       |           |           | the response relates to.          |\n|       |           |           |                                   |\n| a     | List of   | No        | Set of IPv4 Addresses of RT(s).   |\n|       | String    |           |                                   |\n|       |           |           |                                   |\n| aaaa  | List of   | No        | Set of IPv6 Addresses of RT(s).   |\n|       | String    |           |                                   |\n|       |           |           |                                   |\n| cname | List of   | No        | Set of fully qualified domain     |\n|       | String    |           | names of RT(s).                   |\n|       |           |           |                                   |\n| ttl   | Integer   | No        | TTL in seconds of DNS response.   |\n|       |           |           | Default is 0.                     |\n+-------+-----------+-----------+-----------------------------------+",
      "raw": true
    },
    {
      "indent": 34,
      "text": "Table 3",
      "ja": "表3"
    },
    {
      "indent": 3,
      "text": "A successful RI response for DNS-based redirection MUST include a dns dictionary and MAY include an error dictionary (see Section 4.7). An unsuccessful RI response for DNS-based redirection MUST include an error dictionary. If a dns dictionary is included in the RI response, it MUST include the rcode and name keys and it MUST include at least one of the following keys: a, aaaa, or cname. The dns dictionary MAY include both a and aaaa keys. If the dns dictionary contains a cname key, it MUST NOT contain either an a or aaaa key. For internationalized domain names containing non-ASCII characters, the value of the cname field MUST be the ACE representation (A-label) of the domain name.",
      "ja": "DNSベースのリダイレクションのための成功RI応答は、DNS辞書を含まなければならないとエラー辞書を（4.7節を参照）を含むことができます。 DNSベースのリダイレクションのために失敗したRI応答がエラー辞書を含まなければなりません。 DNS辞書はRI応答に含まれている場合、それはRCODEと名前のキーを含まなければならないし、それは次のキーの少なくとも一つ含まれている必要があります、AAAA、またはCNAMEを。 DNS辞書はAとAAAAキーの両方を含んでいてもよいです。 DNSの辞書はCNAMEキーが含まれている場合、それはAまたはAAAAキーのいずれかを含めることはできません。非ASCII文字を含む国際化ドメイン名については、CNAMEフィールドの値は、ドメイン名のACE表現（ラベル）でなければなりません。"
    },
    {
      "indent": 3,
      "text": "An example of a successful RI response (dCDN->uCDN) for DNS-based redirection with both a and aaaa keys is listed below:",
      "ja": "AとAAAAの両方のキーでDNSベースのリダイレクションのための成功したRI応答（dCDN-> uCDN）の例を以下に示します："
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 200 OK Date: Mon, 06 Aug 2012 18:41:38 GMT Content-Type: application/cdni; ptype=redirection-response",
      "ja": "HTTP / 1.1 200 OK日：月、2012年8月6日午前18時41分38秒GMTのコンテンツタイプ：アプリケーション/ cdni。 p型=リダイレクト応答"
    },
    {
      "indent": 3,
      "text": "{ \"dns\" : { \"rcode\" : 0, \"name\" : \"www.example.com\", \"a\" : [\"203.0.113.200\", \"203.0.113.201\", \"203.0.113.202\"], \"aaaa\" : [\"2001:DB8::C8\", \"2001:DB8::C9\"], \"ttl\" : 60 } }",
      "ja": "{ \"DNS\"：{ \"RCODE\"：0、 \"名前\"： \"www.example.com\"、 \"A\"：[ \"203.0.113.200\"、 \"203.0.113.201\"、 \"203.0.113.202\"]、「AAAA \"[\" 2001：DB8 :: C8\" 、 \"2001：DB8 :: C9\"]、 \"TTL\"：60}}"
    },
    {
      "indent": 3,
      "text": "A further example of a successful RI response (dCDN->uCDN) for DNS-based redirection is listed below, in this case with a cname key containing the FQDN of the RT.",
      "ja": "DNSベースのリダイレクションのための成功したRI応答（dCDN-> uCDN）の更なる例は、RTのFQDNを含むCNAMEキーを使用して、この場合には、以下に記載されています。"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 200 OK Date: Mon, 06 Aug 2012 18:41:38 GMT Content-Type: application/cdni; ptype=redirection-response",
      "ja": "HTTP / 1.1 200 OK日：月、2012年8月6日午前18時41分38秒GMTのコンテンツタイプ：アプリケーション/ cdni。 p型=リダイレクト応答"
    },
    {
      "indent": 3,
      "text": "{ \"dns\" : { \"rcode\" : 0, \"name\" : \"www.example.com\", \"cname\" : [\"rr1.dcdn.example\"], \"ttl\" : 20 } }",
      "ja": "{ \"DNS\"：{ \"RCODE\"：0、 \"名前\"： \"www.example.com\"、 \"CNAME\"：[ \"rr1.dcdn.example\"]、 \"TTL\"：20}}"
    },
    {
      "indent": 0,
      "text": "4.5. HTTP Redirection",
      "section_title": true,
      "ja": "4.5。 HTTPリダイレクト"
    },
    {
      "indent": 3,
      "text": "The following sections provide detailed descriptions of the information that should be passed in RI requests and responses for HTTP redirection.",
      "ja": "次のセクションでは、HTTPリダイレクトのためのRIのリクエストとレスポンスで渡されるべき情報の詳細な説明を提供しています。"
    },
    {
      "indent": 3,
      "text": "The dictionary keys used in HTTP Redirection requests and responses use the following conventions for their prefixes:",
      "ja": "HTTPリダイレクト要求と応答で使用される辞書のキーは、その接頭辞のために次の表記法を使用します。"
    },
    {
      "indent": 3,
      "text": "o c- is prefixed to keys for information related to the Client (User Agent).",
      "ja": "O C-は、クライアント（ユーザエージェント）に関連する情報のためのキーに付けられます。"
    },
    {
      "indent": 3,
      "text": "o cs- is prefixed to keys for information passed by the Client (User Agent) to the Server (uCDN).",
      "ja": "O CS-は、サーバー（uCDN）へのクライアント（ユーザエージェント）によって渡された情報のためのキーに付けられます。"
    },
    {
      "indent": 3,
      "text": "o sc- is prefixed to keys for information to be passed by the Server (uCDN) to the Client (User Agent).",
      "ja": "O SC-は、クライアント（ユーザエージェント）にサーバー（uCDN）によって渡される情報のためのキーに付けられます。"
    },
    {
      "indent": 0,
      "text": "4.5.1. HTTP Redirection Requests",
      "section_title": true,
      "ja": "4.5.1。 HTTPリダイレクト要求"
    },
    {
      "indent": 3,
      "text": "For HTTP-based redirection, the uCDN needs to pass the following information to the dCDN in the RI request:",
      "ja": "HTTPベースのリダイレクションのために、uCDNはRI要求にdCDNに以下の情報を渡す必要があります。"
    },
    {
      "indent": 3,
      "text": "o The IP address of the User Agent.",
      "ja": "ユーザーエージェントのIPアドレス、O。"
    },
    {
      "indent": 3,
      "text": "o The URI requested by the User Agent.",
      "ja": "O URIは、ユーザエージェントによって要求されました。"
    },
    {
      "indent": 3,
      "text": "o The HTTP method requested by the User Agent.",
      "ja": "O HTTPメソッドは、ユーザーエージェントによって要求されました。"
    },
    {
      "indent": 3,
      "text": "o The HTTP version number requested by the User Agent.",
      "ja": "O HTTPのバージョン番号は、ユーザーエージェントによって要求されました。"
    },
    {
      "indent": 3,
      "text": "The uCDN may also decide to pass the presence and value of particular HTTP headers included in the User Agent request to the dCDN.",
      "ja": "uCDNもdCDNにユーザエージェント要求に含まれる特定のHTTPヘッダーの存在及び値を通過することを決定することができます。"
    },
    {
      "indent": 3,
      "text": "The preceding information is encoded as a set of key:value pairs within the http dictionary as follows:",
      "ja": "次のようにHTTP辞書内の値のペア：上記の情報は、キーのセットとしてコードされます。"
    },
    {
      "indent": 3,
      "text": "+-------------------+--------+-----------+--------------------------+\n| Key               | Value  | Mandatory | Description              |\n+-------------------+--------+-----------+--------------------------+\n| c-ip              | String | Yes       | The IP address of the    |\n|                   |        |           | UA.                      |\n|                   |        |           |                          |\n| cs-uri            | String | Yes       | The Effective Request    |\n|                   |        |           | URI [RFC7230] requested  |\n|                   |        |           | by the UA.               |\n|                   |        |           |                          |\n| cs-method         | String | Yes       | The method part of the   |\n|                   |        |           | request-line as defined  |\n|                   |        |           | in Section 3.1.1 of      |\n|                   |        |           | [RFC7230].               |\n|                   |        |           |                          |\n| cs-version        | String | Yes       | The HTTP-version part of |\n|                   |        |           | the request-line as      |\n|                   |        |           | defined in Section 3.1.1 |\n|                   |        |           | of [RFC7230].            |\n|                   |        |           |                          |\n| cs-(<headername>) | String | No        | The field-value of the   |\n|                   |        |           | HTTP header field named  |\n|                   |        |           | <HeaderName> as a        |\n|                   |        |           | string, for example,     |\n|                   |        |           | cs-(cookie) would        |\n|                   |        |           | contain the value of the |\n|                   |        |           | HTTP Cookie header from  |\n|                   |        |           | the UA request.          |\n+-------------------+--------+-----------+--------------------------+",
      "raw": true
    },
    {
      "indent": 34,
      "text": "Table 4",
      "ja": "表4"
    },
    {
      "indent": 3,
      "text": "An RI request for HTTP-based redirection MUST include an http dictionary. This http dictionary MUST contain the following keys: c-ip, cs-method, cs-version, and cs-uri; the value of each MUST be the value of the appropriate part of the User Agent's HTTP request.",
      "ja": "HTTPベースのリダイレクションのためのRI要求は、http辞書を含まなければなりません。このHTTP辞書には、次のキーが含まれなければならない：C-IP、CS-法、CS-バージョン、およびCS-URIを。それぞれの値は、ユーザーエージェントのHTTPリクエストの適切な部分の値でなければなりません。"
    },
    {
      "indent": 3,
      "text": "The http dictionary of an RI request MUST contain a maximum of one cs-(<headername>) key for each unique header field-name (HTTP header field). <headername> MUST be identical to the equivalent HTTP header field-name encoded in all lowercase.",
      "ja": "各ユニークなヘッダフィールド名（HTTPヘッダフィールド）のために（<ヘッダ名>）キー -  RI要求のHTTP辞書は、一つのCSの最大値を含まなければなりません。 <ヘッダ名>すべて小文字でエンコードされた同等のHTTPヘッダフィールド名と同一でなければなりません。"
    },
    {
      "indent": 3,
      "text": "In the case where the User Agent request includes multiple HTTP header fields with the same field-name, it is RECOMMENDED that the uCDN combine these different HTTP headers into a single value according to Section 3.2.2 of [RFC7230]. However, because of the plurality of already defined HTTP header fields and the inconsistency of some of these header fields concerning the combination mechanism defined in RFC 7230, the uCDN MAY have to deviate from using the combination mechanism where appropriate. For example, it might only send the contents of the first occurrence of the HTTP Headers instead.",
      "ja": "ユーザエージェント要求が同じフィールド名を持つ複数のHTTPヘッダーフィールドを含む場合には、uCDNは[RFC7230]のセクション3.2.2に従う1つの値にこれらの異なるHTTPヘッダーを組み合わせることが推奨されます。しかし、既に定義されたHTTPヘッダフィールドとRFC 7230で定義された組み合わせの機構に関するこれらのヘッダフィールドのいくつかの矛盾の複数の、uCDNは適宜組み合わせメカニズムを使用してから逸脱する必要があります。例えば、それが唯一の代わりにHTTPヘッダの最初の出現の内容を送信することがあります。"
    },
    {
      "indent": 3,
      "text": "An example RI request (uCDN->dCDN) for HTTP-based redirection is as follows:",
      "ja": "次のようにHTTPベースのリダイレクションたとえばRI要求（uCDN-> dCDN）です。"
    },
    {
      "indent": 3,
      "text": "POST /dcdn/rrri HTTP/1.1 Host: rr1.dcdn.example.net Content-Type: application/cdni; ptype=redirection-request Accept: application/cdni; ptype=redirection-response",
      "ja": "POST / dcdn / rrri HTTP / 1.1ホスト：rr1.dcdn.example.netのコンテンツタイプ：アプリケーション/ cdni。 p型=リダイレクト要求受諾：アプリケーション/ cdni。 p型=リダイレクト応答"
    },
    {
      "indent": 3,
      "text": "{\n  \"http\": {\n    \"c-ip\": \"198.51.100.1\",\n    \"cs-uri\": \"http://www.example.com\",\n    \"cs-version\": \"HTTP/1.1\",\n    \"cs-method\": \"GET\"\n  },\n  \"cdn-path\": [\"AS64496:0\"],\n  \"max-hops\": 3\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.5.2. HTTP Redirection Responses",
      "section_title": true,
      "ja": "4.5.2。 HTTPリダイレクト応答"
    },
    {
      "indent": 3,
      "text": "For a successful HTTP-based redirection, the dCDN needs to return one of the following to the uCDN in the RI response:",
      "ja": "成功したHTTPベースのリダイレクションのために、dCDNはRI応答でuCDNに次のいずれかを返す必要があります："
    },
    {
      "indent": 3,
      "text": "o A URI pointing to an RT that is the selected dCDN surrogate(s) (if the dCDN is performing HTTP-based redirection directly to a surrogate); or",
      "ja": "URI O（dCDNがサロゲートに直接HTTPベースのリダイレクションを実行している場合）を選択dCDNサロゲート（S）であるRTを指します。または"
    },
    {
      "indent": 3,
      "text": "o A URI pointing to an RT that is a Request Router (if the dCDN will perform request redirection itself).",
      "ja": "O URIは（dCDN要求のリダイレクト自体を実行する場合）、リクエストルータであるRTを指します。"
    },
    {
      "indent": 3,
      "text": "The preceding information is encoded as a set of key:value pairs within the http dictionary as follows:",
      "ja": "次のようにHTTP辞書内の値のペア：上記の情報は、キーのセットとしてコードされます。"
    },
    {
      "indent": 3,
      "text": "+-------------------+---------+-----------+-------------------------+\n| Key               | Value   | Mandatory | Description             |\n+-------------------+---------+-----------+-------------------------+\n| sc-status         | Integer | Yes       | The status-code part of |\n|                   |         |           | the status-line as      |\n|                   |         |           | defined in Section      |\n|                   |         |           | 3.1.2 of [RFC7230] to   |\n|                   |         |           | return to the UA        |\n|                   |         |           | (usually set to 302).   |\n|                   |         |           |                         |\n| sc-version        | String  | Yes       | The HTTP-version part   |\n|                   |         |           | of the status-line as   |\n|                   |         |           | defined in Section      |\n|                   |         |           | 3.1.2 of [RFC7230] to   |\n|                   |         |           | return to the UA.       |\n|                   |         |           |                         |\n| sc-reason         | String  | Yes       | The reason-phrase part  |\n|                   |         |           | of the status-line as   |\n|                   |         |           | defined in Section      |\n|                   |         |           | 3.1.2 of [RFC7230] to   |\n|                   |         |           | return to the UA.       |\n|                   |         |           |                         |\n| cs-uri            | String  | Yes       | The URI requested by    |\n|                   |         |           | the UA/client.          |\n|                   |         |           |                         |\n| sc-(location)     | String  | Yes       | The contents of the     |\n|                   |         |           | Location header to      |\n|                   |         |           | return to the UA (i.e., |\n|                   |         |           | a URI pointing to the   |\n|                   |         |           | RT(s)).                 |\n|                   |         |           |                         |\n| sc-(<headername>) | String  | No        | The field-value of the  |\n|                   |         |           | HTTP header field named |\n|                   |         |           | <HeaderName> to return  |\n|                   |         |           | to the UA. For example, |\n|                   |         |           | sc-(expires) would      |\n|                   |         |           | contain the value of    |\n|                   |         |           | the HTTP Expires        |\n|                   |         |           | header.                 |\n+-------------------+---------+-----------+-------------------------+",
      "raw": true
    },
    {
      "indent": 34,
      "text": "Table 5",
      "ja": "表5"
    },
    {
      "indent": 3,
      "text": "Note: The sc-(location) key in the preceding table is an example of sc-(<headername>) that has been called out separately as its presence is mandatory in RI responses.",
      "ja": "注：上記の表のSC-（位置）キーは、SCの一例である - （<ヘッダ名>）その存在がRI応答に必須であるように別々に呼び出されたこと。"
    },
    {
      "indent": 3,
      "text": "A successful RI response for HTTP-based redirection MUST include an http dictionary and MAY include an error dictionary (see Section 4.7). An unsuccessful RI response for HTTP-based redirection MUST include an error dictionary. If an http dictionary is included in the RI response, it MUST include at least the following keys: sc-status, sc-version, sc-reason, cs-uri, and sc-(location).",
      "ja": "HTTPベースのリダイレクションのための成功RI応答は、http辞書を含まなければならないとエラー辞書を（4.7節を参照）を含むことができます。 HTTPベースのリダイレクションのための失敗したRI応答がエラー辞書を含まなければなりません。 SC-ステータス、SC-バージョン、SC-理由、CS-URI、およびSC-（場所）：HTTP辞書はRI応答に含まれている場合、それは、少なくとも次のキーを含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "The http dictionary of an RI response MUST contain a maximum of one sc-(<headername>) key for each unique header field-name (HTTP header field). <headername> MUST be identical to the equivalent HTTP header field-name encoded in all lowercase.",
      "ja": "各ユニークなヘッダフィールド名（HTTPヘッダフィールド）のために（<ヘッダ名>）キー -  RI応答のHTTP辞書は、1つのSCの最大値を含まなければなりません。 <ヘッダ名>すべて小文字でエンコードされた同等のHTTPヘッダフィールド名と同一でなければなりません。"
    },
    {
      "indent": 3,
      "text": "The uCDN MAY decide to not return, override, or alter any or all of the HTTP headers defined by sc-(<headername>) keys before sending the HTTP response to the UA. It should be noted that in some cases, sending the HTTP Headers indicated by the dCDN transparently on to the UA might result in, for the uCDN, undesired behavior. As an example, the dCDN might include sc-(cache-control), sc-(last-modified), and sc-(expires) keys in the http dictionary, through which the dCDN may try to influence the cacheability of the response by the UA. If the uCDN would pass these HTTP headers on to the UA, this could mean that further requests from the uCDN would go directly to the dCDN, bypassing the uCDN and any logging it may perform on incoming requests. Therefore, the uCDN is recommended to carefully consider which HTTP headers to pass on, and which to either override or not pass on at all.",
      "ja": "UAへのHTTPレスポンスを送信する前に（<ヘッダ名>）キー -  uCDNは、オーバーライドを返す、またはSCによって定義されたHTTPヘッダの一部またはすべてを変更しないことを決定することができます。いくつかのケースでは、UAの上で透過dCDNで示されるHTTPヘッダを送信することuCDN、望ましくない動作のために、内なる可能性がありますことに留意すべきです。一例として、dCDNはSC-を含むかもしれない（キャッシュ制御）、SC-（最終更新）、及びSC-は（期限切れになる）dCDNによりレスポンスのキャッシュ可能性に影響を与えることを試みることができるを通じてHTTP辞書のキー、 UA。 uCDNはUAの上でこれらのHTTPヘッダを通過する場合、これはuCDNからさらに要求がuCDN、それが着信要求に対して実行可能性のあるログをバイパスし、dCDNに直接移動することを意味するかもしれません。したがって、uCDNは慎重に通過し、そしてどのオーバーライドかのどちらかに全く渡すためにどのHTTPヘッダを検討することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "An example of a successful RI response (dCDN->uCDN) for HTTP-based redirection is a follows:",
      "ja": "HTTPベースのリダイレクションのための成功したRI応答（dCDN-> uCDN）の例は以下であります："
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 200 OK Date: Mon, 06 Aug 2012 18:41:38 GMT Content-Type: application/cdni; ptype=redirection-response",
      "ja": "HTTP / 1.1 200 OK日：月、2012年8月6日午前18時41分38秒GMTのコンテンツタイプ：アプリケーション/ cdni。 p型=リダイレクト応答"
    },
    {
      "indent": 3,
      "text": "{\n  \"http\": {\n    \"sc-status\": 302,\n    \"sc-version\": \"HTTP/1.1\",\n    \"sc-reason\": \"Found\",\n    \"cs-uri\": \"http://www.example.com\"\n    \"sc-(location)\":\n      \"http://sur1.dcdn.example/ucdn/example.com\",\n  }\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.6. Cacheability and Scope of Responses",
      "section_title": true,
      "ja": "4.6。応答のキャッシュ可能と範囲"
    },
    {
      "indent": 3,
      "text": "RI responses may be cacheable. As long as a cached RI response is not stale according to standard HTTP Cache-Control or other applicable mechanisms, it may be reused by the uCDN in response to User Agent requests without sending another RI request to the dCDN.",
      "ja": "RI応答はキャッシュ可能かもしれません。限り、キャッシュされたRI応答は、標準HTTPのCache-Controlまたは他の適用可能なメカニズムによれば陳腐ではないとして、それがdCDNに別のRI要求を送信することなく、ユーザーエージェントの要求に応じてuCDNによって再利用されてもよいです。"
    },
    {
      "indent": 3,
      "text": "An RI response MUST NOT be reused unless the request from the User Agent would generate an identical RI request to the dCDN as the one that resulted in the cached RI response (except for the c-ip field provided that the User Agent's c-ip is covered by the scope in the original RI response, as elaborated upon below).",
      "ja": "C-IPフィールドを除き、キャッシュされたRI応答の結果1は、（ユーザーエージェントのC-IPがあることを提供するようユーザエージェントからの要求がdCDNと同一のRI要求を生成しない限り、RI応答を再利用してはいけません）以下の際に詳述のように、元のRI応答の範囲に含まれます。"
    },
    {
      "indent": 3,
      "text": "Additionally, although RI requests only encode a single User Agent request to be redirected, there may be cases where a dCDN wishes to indicate to the uCDN that the RI response can be reused for other User Agent requests without the uCDN having to make another request via the RI. For example, a dCDN may know that it will always select the same surrogates for a given set of User Agent IP addresses and in order to reduce request volume across the RI or to remove the additional latency associated with an RI request, the dCDN may wish to indicate that set of User Agent IP addresses to the uCDN in the initial RI response. This is achieved by including an optional scope dictionary in the RI response.",
      "ja": "RI要求のみリダイレクトする単一ユーザエージェント要求をコードするが、さらに、dCDNはRI応答がuCDNを介して別の要求を行うことなく、他のユーザーエージェントの要求のために再利用することができることをuCDNに指示することを望む場合がありますRI。例えば、dCDNは、それは常にユーザーエージェントのIPアドレスの特定のセットに対して同じサロゲートを選択し、RI間で要求量を削減するか、RI要求に関連する追加の待ち時間を除去するために、dCDNが望むかもしれないことを知っているかもしれません初期RI応答のuCDNへのユーザーエージェントのIPアドレスのセットを示します。これは、RI応答の任意スコープ辞書を含むことによって達成されます。"
    },
    {
      "indent": 3,
      "text": "Scope is encoded as a set of key:value pairs within the scope dictionary as follows:",
      "ja": "次のようにスコープ辞書内の値のペア：範囲はキーのセットとしてコードされます。"
    },
    {
      "indent": 3,
      "text": "+---------+--------+-----------+------------------------------------+\n| Key     | Value  | Mandatory | Description                        |\n+---------+--------+-----------+------------------------------------+\n| iprange | List   | No        | A List of IP subnets in CIDR       |\n|         | of     |           | notation that this RI response can |\n|         | String |           | be reused for, provided the RI     |\n|         |        |           | response is still considered       |\n|         |        |           | fresh.                             |\n+---------+--------+-----------+------------------------------------+",
      "raw": true
    },
    {
      "indent": 34,
      "text": "Table 6",
      "ja": "表6"
    },
    {
      "indent": 3,
      "text": "If a uCDN has multiple cached responses with overlapping scopes and a UA request comes in for which the User Agent's IP matches with the IP subnets in multiple of these cached responses, the uCDN SHOULD use the most recent cached response when determining the appropriate RI response to use.",
      "ja": "uCDNが重なってスコープを持つ複数のキャッシュされた応答があり、UAのリクエストが来たユーザーエージェントのIPは、これらのキャッシュされた応答の倍数でIPサブネットと一致している場合に適切なRI応答を決定する際に、uCDNは最新のキャッシュされた応答を使用すべきですつかいます。"
    },
    {
      "indent": 3,
      "text": "The following is an example of a DNS redirection response from Section 4.4.2 that is cacheable by the uCDN for 30 seconds and can be returned to any User Agent with an IPv4 address in 198.51.100.0/24.",
      "ja": "次は30秒間uCDNによってキャッシュ可能であると198.51.100.0/24でIPv4アドレスを持つ任意のユーザエージェントに戻すことができ、セクション4.4.2からのDNSリダイレクト応答の一例です。"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 200 OK Date: Mon, 06 Aug 2012 18:41:38 GMT Content-Type: application/cdni; ptype=redirection-response Cache-Control: public, max-age=30",
      "ja": "HTTP / 1.1 200 OK日：月、2012年8月6日午前18時41分38秒GMTのコンテンツタイプ：アプリケーション/ cdni。 p型=リダイレクト応答のCache-Control：公共、最大エージング= 30"
    },
    {
      "indent": 3,
      "text": "{ \"dns\" : { \"rcode\" : 0, \"name\" : \"www.example.com\", \"a\" : [\"203.0.113.200\", \"203.0.113.201\"], \"aaaa\" : [\"2001:DB8::C8\", \"2001:DB8::C9\"], \"ttl\" : 60 } \"scope\" : { \"iprange\" : [\"198.51.100.0/24\"] } }",
      "ja": "{ \"DNS\"：{ \"RCODE\"：0、 \"名前\"： \"www.example.com\"、 \"A\"：[ \"203.0.113.200\"、 \"203.0.113.201\"]、 \"AAAA\"：[ \"2001： DB8 :: C8\" 、 \"2001：DB8 :: C9\"]、 \"TTL\"：60} \"範囲\"：{ \"iprange\"：[ \"198.51.100.0/24\"]}}"
    },
    {
      "indent": 3,
      "text": "The following is an example of an HTTP redirection response from Section 4.5.2 that is cacheable by the uCDN for 60 seconds and can be returned to any User Agent with an IPv4 address in 198.51.100.0/24.",
      "ja": "次は60秒間uCDNでキャッシュ可能であると198.51.100.0/24でIPv4アドレスを持つ任意のユーザエージェントに戻すことができ、セクション4.5.2からのHTTPリダイレクト応答の一例です。"
    },
    {
      "indent": 3,
      "text": "Note: The response to the UA is only valid for 30 seconds, whereas the uCDN can cache the RI response for 60 seconds.",
      "ja": "注意：UAへの応答は、30秒間のみ有効で、uCDNは60秒間RI応答をキャッシュすることができるのに対し。"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 200 OK Date: Mon, 06 Aug 2012 18:41:38 GMT Content-Type: application/cdni; ptype=redirection-response Cache-Control: public, max-age=60",
      "ja": "HTTP / 1.1 200 OK日：月、2012年8月6日午前18時41分38秒GMTのコンテンツタイプ：アプリケーション/ cdni。 p型=リダイレクト応答のCache-Control：公共、最大エージング= 60"
    },
    {
      "indent": 3,
      "text": "{\n  \"http\": {\n    \"sc-status\": 302,\n    \"cs-uri\": \"http://www.example.com\"\n    \"sc-(location)\":\n      \"http://sur1.dcdn.example/ucdn/example.com\",\n    \"sc-(cache-control)\" : \"public, max-age=30\"\n  }\n  \"scope\" : {\n    \"iprange\" : [\"198.51.100.0/24\"]\n  }\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.7. Error Responses",
      "section_title": true,
      "ja": "4.7。エラーレスポンス"
    },
    {
      "indent": 3,
      "text": "From a uCDN perspective, there are two types of errors that can be the result of the transmission of an RI request to a dCDN:",
      "ja": "uCDNの観点から、dCDNにRI要求の送信の結果であり得るエラーの2種類があります。"
    },
    {
      "indent": 3,
      "text": "1. An HTTP protocol error signaled via an HTTP status code, indicating a problem with the reception or parsing of the RI request or the generation of the RI response by the dCDN, and",
      "ja": "1. HTTPプロトコルエラーがRI要求またはdCDNによってRI応答の発生の受信又は解析に問題があることを示す、HTTPステータスコードを介してシグナリング、および"
    },
    {
      "indent": 3,
      "text": "2. An RI-level error specified in an RI response message.",
      "section_title": true,
      "ja": "RI応答メッセージで指定された2アンRIレベルのエラー。"
    },
    {
      "indent": 3,
      "text": "This section deals with the latter type. The former type is outside the scope of this document.",
      "ja": "このセクションでは、後者のタイプを扱います。前者は、このドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "There are numerous reasons for a dCDN to be unable to return an affirmative RI response to a uCDN. Reasons may include both dCDN internal issues such as capacity problems, as well as reasons outside the influence of the dCDN, such as a malformed RI request. To aid with diagnosing the cause of errors, RI responses SHOULD include an error dictionary to provide additional information to the uCDN as to the reason/cause of the error. The intention behind the error dictionary is to aid with either manual or automatic diagnosis of issues. The resolution of such issues is outside the scope of this document; this document does not specify any consequent actions a uCDN should take upon receiving a particular error-code.",
      "ja": "uCDNへの肯定的なRI応答を返すことができないことにするdCDNのための多くの理由があります。理由はdCDN内部このような能力の問題などの問題、ならびにそのような不正なRI要求としてdCDNの影響外部理由の両方を含むことができます。エラーの原因を診断して支援するために、RIの応答は、エラーの理由/原因についてuCDNに追加情報を提供するために、エラー辞書を含むべきです。エラー辞書の背後にある意図は、マニュアルや問題の自動診断のいずれかを支援することです。このような問題の解決は、この文書の範囲外です。このドキュメントはuCDNは、特定のエラーコードを受信したときに取るべきどんな結果として起こるアクションを指定していません。"
    },
    {
      "indent": 3,
      "text": "Error information (if present) is encoded as a set of key:value pairs within a JSON-encoded error dictionary as follows:",
      "ja": "次のようにJSONエンコードエラー辞書内の値のペア：エラー情報（存在する場合）キーのセットとしてコードされます。"
    },
    {
      "indent": 3,
      "text": "+------------+---------+-----------+--------------------------------+\n| Key        | Value   | Mandatory | Description                    |\n+------------+---------+-----------+--------------------------------+\n| error-code | Integer | Yes       | A three-digit numeric code     |\n|            |         |           | defined by the server to       |\n|            |         |           | indicate the error(s) that     |\n|            |         |           | occurred.                      |\n|            |         |           |                                |\n| reason     | String  | No        | A string providing further     |\n|            |         |           | information related to the     |\n|            |         |           | error.                         |\n+------------+---------+-----------+--------------------------------+",
      "raw": true
    },
    {
      "indent": 34,
      "text": "Table 7",
      "ja": "表7"
    },
    {
      "indent": 3,
      "text": "The first digit of the error-code defines the class of error. There are 5 classes of errors distinguished by the first digit of the error-code:",
      "ja": "エラーコードの最初の数字は、エラーのクラスを定義します。エラー・コードの最初の数字で区別エラーの5つのクラスがあります。"
    },
    {
      "indent": 6,
      "text": "1xx: Informational (no error): The response should not be considered an error by the uCDN, which may proceed by redirecting the UA according to the values in the RI response. The error-code and accompanying description may be used for informational purposes, e.g., for logging.",
      "ja": "1XX：情報（エラーなし）応答はRI応答の値に応じてUAをリダイレクトすることによって進行し得る、uCDNによってエラーと見なされるべきではありません。エラーコードおよび付随する説明は、ロギングのために、例えば、情報提供の目的のために使用することができます。"
    },
    {
      "indent": 6,
      "text": "2xx: Reserved.",
      "ja": "2XX：予約済み。"
    },
    {
      "indent": 6,
      "text": "3xx: Reserved.",
      "ja": "300番台：予約済み。"
    },
    {
      "indent": 6,
      "text": "4xx: uCDN error: The dCDN cannot or will not process the request due to something that is perceived to be a uCDN error, for example, the RI request could not be parsed successfully by the dCDN. The last two-digits may be used to more specifically indicate the source of the problem.",
      "ja": "4XX：uCDNエラー：dCDNがまたは、例えば、RI要求はdCDNで正常に解析することができませんでしたuCDNエラーと認識されている何かのために要求を処理しませんすることはできません。最後の二桁は、より具体的には、問題の原因を示すために使用されてもよいです。"
    },
    {
      "indent": 6,
      "text": "5xx: dCDN error: Indicates that the dCDN is aware that it has erred or is incapable of satisfying the RI request for some reason, for example, the dCDN was able to parse the RI request but encountered an error for some reason. Examples include the dCDN not being able to retrieve the associated metadata or the dCDN being out of capacity.",
      "ja": "5xxの：dCDNエラー：dCDNが、それは誤りを犯したか、何らかの理由でRIの要求を満たすことができない状態になっていることを認識していることを示し、例えば、dCDNはRI要求を解析することができましたが、何らかの理由でエラーが発生しました。例としては、関連するメタデータや容量の外にあることdCDNを取得することができないdCDNが含まれます。"
    },
    {
      "indent": 3,
      "text": "The following error-codes are defined and maintained by IANA (see Section 6).",
      "ja": "以下のエラーコードはIANA（セクション6を参照）によって定義され、維持されます。"
    },
    {
      "indent": 3,
      "text": "Error-codes with a \"Reason\" of \"<reason>\" do not have a defined value for their 'reason'-key. Depending on the error-code semantics, the value of this field may be determined dynamically.",
      "ja": "「理由」とのエラー・コード「<理由>」自分の「reason'-キーの定義された値を持っていません。エラーコードのセマンティクスに依存して、このフィールドの値は動的に決定されてもよいです。"
    },
    {
      "indent": 3,
      "text": "+------+--------------+---------------------------------------------+\n| Code | Reason       | Description                                 |\n+------+--------------+---------------------------------------------+\n| 100  | <reason>     | Generic informational error-code meant for  |\n|      | (see         | carrying a human-readable string            |\n|      | Description) |                                             |\n|      |              |                                             |\n| 400  | <reason>     | Generic error-code for uCDN errors where    |\n|      | (see         | the dCDN cannot or will not process the     |\n|      | Description) | request due to something that is perceived  |\n|      |              | to be a uCDN error.  The reason field may   |\n|      |              | be used to provide more details about the   |\n|      |              | source of the error.                        |\n|      |              |                                             |",
      "raw": true
    },
    {
      "indent": 3,
      "text": "| 500  | <reason>     | Generic error-code for dCDN errors where    |\n|      | (see         | the dCDN is aware that it has erred or is   |\n|      | Description) | incapable of satisfying the RI request for  |\n|      |              | some reason.  The reason field may be used  |\n|      |              | to provide more details about the source of |\n|      |              | the error.                                  |\n|      |              |                                             |\n| 501  | Unable to    | The dCDN is unable to retrieve the metadata |\n|      | retrieve     | associated with the content requested by    |\n|      | metadata     | the UA.  This may indicate a configuration  |\n|      |              | error or that the content requested by the  |\n|      |              | UA does not exist.                          |\n|      |              |                                             |\n| 502  | Loop         | The dCDN detected a redirection loop (see   |\n|      | detected     | Section 4.8).                               |\n|      |              |                                             |\n| 503  | Maximum hops | The dCDN detected the maximum number of     |\n|      | exceeded     | redirection hops exceeding max-hops (see    |\n|      |              | Section 4.8).                               |\n|      |              |                                             |\n| 504  | Out of       | The dCDN does not currently have sufficient |\n|      | capacity     | capacity to handle the UA request.          |\n|      |              |                                             |\n| 505  | Delivery     | The dCDN does not support the (set of)      |\n|      | protocol not | delivery protocols indicated in the CDNI    |\n|      | supported    | Metadata of the content requested by the    |\n|      |              | UA.                                         |\n|      |              |                                             |\n| 506  | Redirection  | The dCDN does not support the requested     |\n|      | protocol not | redirection protocol.  This error-code is   |\n|      | supported    | also used when the RI request has the dns-  |\n|      |              | only flag set to True and the dCDN is not   |\n|      |              | supported or is not prepared to return an   |\n|      |              | RT of a surrogate directly.                 |\n+------+--------------+---------------------------------------------+",
      "raw": true
    },
    {
      "indent": 34,
      "text": "Table 8",
      "ja": "表8"
    },
    {
      "indent": 3,
      "text": "The following is an example of an unsuccessful RI response (dCDN->uCDN) for a DNS-based User Agent request:",
      "ja": "以下は、DNSベースのユーザエージェント要求のために失敗したRI応答（dCDN-> uCDN）の例です。"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 500 Internal Server Error Date: Mon, 06 Aug 2012 18:41:38 GMT Content-Type: application/cdni; ptype=redirection-response Cache-Control: private, no-cache",
      "ja": "HTTP / 1.1 500内部サーバーエラー日：月、2012年8月6日午後6時41分38秒GMTのコンテンツタイプ：アプリケーション/ cdni。 p型=リダイレクト応答のCache-Control：プライベート、キャッシュなし"
    },
    {
      "indent": 3,
      "text": "{ \"error\" : { \"error-code\" : 504, \"description\" : \"Out of capacity\" } }",
      "ja": "{ \"エラー\"：{ \"エラーコード\" 504、 \"説明\"： \"容量不足\"}}"
    },
    {
      "indent": 3,
      "text": "The following is an example of a successful RI response (dCDN->uCDN) for an HTTP-based User Agent request containing an error dictionary for informational purposes:",
      "ja": "以下は、情報提供の目的のためにエラー辞書を含むHTTPベースのユーザエージェント要求の成功RI応答（dCDN-> uCDN）の例です。"
    },
    {
      "indent": 3,
      "text": "HTTP/1.1 200 OK Date: Mon, 06 Aug 2012 18:41:38 GMT Content-Type: application/cdni; ptype=redirection-response Cache-Control: private, no-cache",
      "ja": "HTTP / 1.1 200 OK日：月、2012年8月6日午前18時41分38秒GMTのコンテンツタイプ：アプリケーション/ cdni。 p型=リダイレクト応答のCache-Control：プライベート、キャッシュなし"
    },
    {
      "indent": 3,
      "text": "{\n   \"http\": {\n    \"sc-status\": 302,\n    \"sc-version\": \"HTTP/1.1\",\n    \"sc-reason\": \"Found\",\n    \"cs-uri\": \"http://www.example.com\"\n    \"sc-(location)\":\n      \"http://sur1.dcdn.example/ucdn/example.com\",\n   },\n   \"error\" : {\n    \"error-code\" : 100,\n    \"description\" :\n      \"This is a human-readable message meant for debugging purposes\"\n  }\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.8. Loop Detection and Prevention",
      "section_title": true,
      "ja": "4.8。ループ検出と予防"
    },
    {
      "indent": 3,
      "text": "In order to prevent and detect RI request loops, each CDN MUST insert its CDN Provider ID into the cdn-path key of every RI request it originates or cascades. When receiving RI requests, a dCDN MUST check the cdn-path and reject any RI requests that already contain the dCDN's Provider ID in the cdn-path. Transit CDNs MUST NOT propagate to any downstream CDNs if the number of CDN Provider IDs in cdn-path (before adding its own Provider ID) is equal to or greater than max-hops.",
      "ja": "RI要求ループを防止し、検出するために、各CDNは、それが由来する又はカスケード毎RIリクエストのCDNパスキーにそのCDNプロバイダのIDを挿入する必要があります。 RIのリクエストを受信すると、dCDNは、CDN-パスを確認し、すでにCDNパスにdCDNのプロバイダのIDが含まれている任意のRI要求を拒絶しなければなりません。 CDNパスにおけるCDNプロバイダIDの数（独自のプロバイダIDを追加する前には）に等しいかまたは最大ホップより大きい場合トランジットのCDNは、任意の下流のCDNに伝播してはいけません。"
    },
    {
      "indent": 3,
      "text": "The CDN Provider ID uniquely identifies each CDN Provider during the course of request routing redirection. It consists of the characters AS followed by the CDN Provider's AS number, then a colon (':') and an additional qualifier that is used to guarantee uniqueness in case a particular AS has multiple independent CDNs deployed; for example, \"AS64496:0\".",
      "ja": "CDNプロバイダIDは一意にリクエストルーティングリダイレクトの過程で各CDNプロバイダを識別する。 （「：」）それはCDNプロバイダのAS番号は、コロンなどの文字で構成され、ケース、特定のASが複数の独立したのCDNを展開している中に一意性を保証するために使用される追加の修飾子。例えば、 \"AS64496：0\"。"
    },
    {
      "indent": 3,
      "text": "If a dCDN receives an RI request whose cdn-path already contains that dCDN's Provider ID, the dCDN MUST send an RI error response that SHOULD include an error-code of 502.",
      "ja": "dCDNは、そのCDNパス既にdCDNのプロバイダIDを含むRI要求を受信した場合、dCDN 502のエラーコードを含むべきであるRIエラー応答を送らなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a dCDN receives an RI request where the number of CDN Provider IDs in cdn-path is greater than max-hops, the dCDN MUST send an RI error response that SHOULD include an error-code of 503.",
      "ja": "dCDNはCDNパスにおけるCDNプロバイダIDの数が最大ホップよりも大きいRI要求を受信した場合、dCDN 503のエラーコードを含むべきであるRIエラー応答を送らなければなりません。"
    },
    {
      "indent": 3,
      "text": "It should be noted that the loop detection and prevention mechanisms described above only cover preventing and detecting loops within the RI itself. Besides loops within the RI itself, there is also the possibility of loops in the data plane; for example, if the IP address(es) or URI(s) returned in RI responses do not resolve directly to a surrogate in the final dCDN, there is the possibility that a User Agent may be continuously redirected through a loop of CDNs. The specification of solutions to address data-plane request redirection loops between CDNs is outside of the scope of this document.",
      "ja": "それだけでカバー上述ループ検出及び防止機構はRI自体の内部ループを防止し、検出することに留意すべきです。 RI自体の内部ループの他に、データプレーンにおけるループの可能性もあります。例えば、IPアドレス（複数可）またはURI（s）はRI応答で返された場合、最終的なdCDNでサロゲートを直接解決しない、ユーザーエージェントは、連続のCDNのループを介してリダイレクトされてしまう可能性があります。 CDNとの間のデータプレーン要求のリダイレクトループに対処するための解決策の仕様は、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Information passed over the RI could be considered personal or sensitive, for example, RI requests contain parts of a User Agent's original request and RI responses reveal information about the dCDN's policy for which surrogates should serve which content/user locations.",
      "ja": "RIの上に渡された情報は、個人または機密と考えることができ、例えば、RI要求がユーザエージェントの元の要求とRI応答の一部が含まれている代理は、コンテンツ/ユーザーの場所を果たすべきであるためdCDNの方針についての情報を明らかにしました。"
    },
    {
      "indent": 3,
      "text": "The RI interface also provides a mechanism whereby a uCDN could probe a dCDN and infer the dCDN's edge topology by making repeated RI requests for different content and/or UA IP addresses and correlating the responses from the dCDN. Additionally, the ability for a dCDN to indicate that an RI response applies more widely than the original request (via the scope dictionary) may significantly reduce the number of RI requests required to probe and infer the dCDN's edge topology.",
      "ja": "RIインタフェースは、uCDNがdCDNをプローブと異なるコンテンツおよび/またはUA IPアドレスに対して繰り返さRIリクエストを作成し、dCDNからの応答を相関させることによってdCDNのエッジトポロジを推定ができたメカニズムを提供します。また、dCDNための能力は、RI応答が有意にプローブとdCDNのエッジトポロジを推定するために必要なRI要求の数を減らすことができる（スコープ辞書を介して）元の要求よりも広く適用されることを示します。"
    },
    {
      "indent": 3,
      "text": "The same information could be obtained in the absence of the RI interface, but it could be more difficult to gather as it would require a distributed set of machines with a range of different IP addresses, each making requests directly to the dCDN. However, the RI facilitates easier collection of such information as it enables a single client to query the dCDN for a redirection/surrogate selection on behalf of any UA IP address.",
      "ja": "同じ情報は、RIインターフェースの不在下で得ることができ、それは、異なるIPアドレスの範囲を持つマシンの分散セットを必要とする各dCDNに直接リクエストを行うであろうように、収集することがより困難であり得ます。しかし、RIは、それがどんなUAのIPアドレスの代わりにリダイレクト/サロゲートの選択のためのdCDNを照会する単一のクライアントを可能にするので、そのような情報を簡単に収集を容易にします。"
    },
    {
      "indent": 0,
      "text": "5.1. Authentication, Authorization, Confidentiality, and Integrity Protection",
      "ja": "5.1。認証、認可、機密性、および完全性保護"
    },
    {
      "indent": 3,
      "text": "An implementation of the CDNI Redirection interface MUST support TLS transport as per [RFC2818] and [RFC7230]. The use of TLS for transport of the CDNI Redirection interface messages allows the dCDN and uCDN to authenticate each other. Once they have mutually authenticated each other, it allows:",
      "ja": "CDNIリダイレクトインタフェースの実装は、[RFC2818]及び[RFC7230]に従ってTLSトランスポートをサポートしなければなりません。 CDNIリダイレクトインターフェイスメッセージの輸送のためにTLSを使用することはdCDNとuCDNが互いを認証することができます。それらが相互に認証した後、それができます。"
    },
    {
      "indent": 3,
      "text": "o The dCDN and uCDN to authorize each other (to ensure they are transmitting/receiving CDNI Redirection messages to/from an authorized CDN);",
      "ja": "O dCDNとuCDNは（それらは送信/許可CDNへ/からCDNIリダイレクションメッセージを受信されるように）お互いを認証します。"
    },
    {
      "indent": 3,
      "text": "o CDNI Redirection interface messages to be transmitted with confidentiality; and",
      "ja": "O CDNIリダイレクトインタフェースメッセージは、機密性で送信されます。そして"
    },
    {
      "indent": 3,
      "text": "o The integrity of the CDNI Redirection interface messages to be protected during the exchange.",
      "ja": "交換時に、保護されるべきCDNIリダイレクトインターフェイスメッセージの完全性、O。"
    },
    {
      "indent": 3,
      "text": "In an environment where any such protection is required, mutually authenticated encrypted transport MUST be used to ensure confidentiality of the redirection information; to do so, TLS MUST be used (including authentication of the remote end) by the server side (dCDN) and the client side (uCDN) of the CDNI Redirection interface.",
      "ja": "このような保護が必要な環境では、相互認証された暗号化されたトランスポートは、リダイレクト情報の機密性を確保するために使用されなければなりません。そうするために、TLSは、サーバ側（dCDN）とCDNIリダイレクトインタフェースのクライアント側（uCDN）によって（リモートエンドの認証を含む）を使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "When TLS is used, the general TLS usage guidance in [RFC7525] MUST be followed.",
      "ja": "TLSを使用する場合、[RFC7525]での一般的なTLSの使用指針に従わなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.2. Privacy",
      "section_title": true,
      "ja": "5.2。プライバシー"
    },
    {
      "indent": 3,
      "text": "Information passed over the RI ought to be considered personal and sensitive. In particular, parts of a User Agent's original request, most notably the UA's IP address and requested URI, are transmitted over the RI to the dCDN. The use of mutually authenticated TLS, as described in the previous section, prevents any other party than the authorized dCDN from gaining access to this information.",
      "ja": "RIの上に渡された情報は、個人情報や機密とみなされるべきです。 、特定のユーザエージェントの元の要求の一部、最も顕著なのUAのIPアドレスとURIを要求して、dCDNにRIを介して送信されます。前のセクションで説明したように、相互に認証TLSの使用は、この情報へのアクセスを得るから認可dCDN以外の政党を防ぐことができます。"
    },
    {
      "indent": 3,
      "text": "Regardless of whether the uCDN and dCDN use the RI, a successful redirect from a uCDN to a dCDN will make that dCDN aware of the UA's IP address. As such, the fact that this information is transmitted across the RI does not allow the dCDN to learn new information. On the other hand, if a uCDN uses the RI to check with multiple candidate dCDNs, those candidates that do not end up getting redirected to do obtain information regarding end-user IP addresses and requested URIs that they would not have if the RI not been used.",
      "ja": "かかわらずuCDNとdCDNはRI、dCDNへuCDNから成功したリダイレクトを使用するかどうかのは、作ることUAのIPアドレスを認識してdCDN。そのため、この情報はRIを介して送信されるという事実はdCDNは、新しい情報を学習することはできません。 uCDNは、複数の候補dCDNsに確認するRIを使用している場合一方、終わっていない候補者は、エンドユーザーのIPアドレスに関する情報を取得行うためにリダイレクトされ、RIがされていない場合、彼らは持っていないURIを要求したばかり中古。"
    },
    {
      "indent": 3,
      "text": "While it is technically possible to mask some information in the RI Request, such as the last bits of the UA IP address, it is important to note that this will reduce the effectiveness of the RI in certain cases. CDN deployments need to strike a balance between end-user privacy and the features impacted by such masking. This balance is likely to vary from one deployment to another. As an example, when the UA and its DNS resolver is behind a Carrier-grade NAT, and the RI is used to find an appropriate delivery node behind the same NAT, the full IP address might be necessary. Another potential issue when using IP anonymization is that it is no longer possible to correlate an RI Request with a subsequent UA request.",
      "ja": "それは、そのようなUAのIPアドレスの最後のビットとして、RIリクエストにいくつかの情報をマスクすることは技術的には可能ですが、特定の場合におけるRIの有効性が低下することに注意することが重要です。 CDNの展開は、エンドユーザーのプライバシーと、このようなマスキングの影響を受け特徴間のバランスを取る必要があります。このバランスは別の展開によって異なる可能性があります。 UAとそのDNSリゾルバは、キャリアグレードNATの背後にある、とRIが同じNATの背後にある適切な配信ノードを見つけるために使用されている場合の例としては、完全なIPアドレスが必要になる場合があります。 IPの匿名化を使用して別の潜在的な問題は、その後のUA要求でRI要求を相関させるためにもはや可能であるということではありません。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "6.1. CDNI Payload Type Parameter Registrations",
      "section_title": true,
      "ja": "6.1。 CDNIペイロードタイプパラメータ登録"
    },
    {
      "indent": 3,
      "text": "IANA has registered the following two new Payload Types in the \"Content Delivery Network Interconnection (CDNI) Parameters\" registry for use with the application/cdni MIME media type.",
      "ja": "IANAは、「コンテンツデリバリーネットワーク相互接続（CDNI）パラメータ」アプリケーション/ cdni MIMEメディアタイプで使用するために、レジストリに次の二つの新しいペイロードタイプを登録しています。"
    },
    {
      "indent": 17,
      "text": "+----------------------+---------------+\n| Payload Type         | Specification |\n+----------------------+---------------+\n| redirection-request  | RFC 7975      |\n|                      |               |\n| redirection-response | RFC 7975      |\n+----------------------+---------------+",
      "raw": true
    },
    {
      "indent": 34,
      "text": "Table 9",
      "ja": "表9"
    },
    {
      "indent": 0,
      "text": "6.1.1. CDNI RI Redirection Request Payload Type",
      "section_title": true,
      "ja": "6.1.1。 CDNI RIリダイレクト要求ペイロードタイプ"
    },
    {
      "indent": 3,
      "text": "Purpose: The purpose of this payload type is to distinguish RI request messages.",
      "ja": "目的：このペイロードタイプの目的は、RI要求メッセージを区別することです。"
    },
    {
      "indent": 3,
      "text": "Interface: RI",
      "ja": "インターフェース：RI"
    },
    {
      "indent": 3,
      "text": "Encoding: See Section 4.4.1 and Section 4.5.1",
      "ja": "エンコード：4.4.1項および4.5.1項を参照してください"
    },
    {
      "indent": 0,
      "text": "6.1.2. CDNI RI Redirection Response Payload Type",
      "section_title": true,
      "ja": "6.1.2。 CDNI RIリダイレクト応答ペイロードタイプ"
    },
    {
      "indent": 3,
      "text": "Purpose: The purpose of this payload type is to distinguish RI response messages.",
      "ja": "目的：このペイロードタイプの目的は、RIの応答メッセージを区別することです。"
    },
    {
      "indent": 3,
      "text": "Interface: RI",
      "ja": "インターフェース：RI"
    },
    {
      "indent": 3,
      "text": "Encoding: See Section 4.4.2 and Section 4.5.2",
      "ja": "エンコード：4.4.2項および4.5.2項を参照してください"
    },
    {
      "indent": 0,
      "text": "6.2. RI Error Response Registry",
      "section_title": true,
      "ja": "6.2。 RIエラーレスポンスレジストリ"
    },
    {
      "indent": 3,
      "text": "IANA has created a new \"CDNI RI Error response code\" subregistry within the \"Content Delivery Network Interconnection (CDNI) Parameters\" registry. The \"CDNI RI Error response code\" namespace defines the valid values for the error-code key in RI error responses. The CDNI RI Error response code MUST be a three-digit integer.",
      "ja": "IANAは、「コンテンツデリバリーネットワーク相互接続（CDNI）パラメータ」レジストリ内に新しい「CDNI RIのエラー応答コード」副登録を作成しました。 「CDNI RIのエラー応答コード」の名前空間は、RIのエラー応答でエラー・コードキーの有効な値を定義します。 CDNI RIエラー応答コードは、3桁の整数でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Additions to the \"RI Error response registry\" will be made via \"Specification Required\" as defined in [RFC5226].",
      "ja": "「RIのエラー応答レジストリ」への追加は、[RFC5226]で定義されている「仕様が必要」を介して行われます。"
    },
    {
      "indent": 3,
      "text": "The Designated Expert will verify that new error-code registrations do not duplicate existing error-code definitions (in name or functionality), ensure that the new error-code is in accordance with the error classes defined in Section 4.7 of this document, prevent gratuitous additions to the namespace, and prevent any additions to the namespace that would impair the interoperability of CDNI implementations.",
      "ja": "指定Expertは、新しいエラー・コードの登録は（名前または機能的に）既存のエラー・コードの定義が重複していないことを確認し、新しいエラー・コードは、このドキュメントのセクション4.7で定義されたエラークラスに従っていることを確認し、無償防ぐことができます名前空間への追加、およびCDNI実装の相互運用性を損なう名前空間への追加を防ぎます。"
    },
    {
      "indent": 3,
      "text": "New registrations are required to provide the following information:",
      "ja": "新規登録は、以下の情報を提供する必要があります。"
    },
    {
      "indent": 6,
      "text": "Code: A three-digit numeric error-code, in accordance with the error classes defined in Section 4.7 of this document.",
      "ja": "コード：3桁の数値のエラー・コード、このドキュメントのセクション4.7で定義されたエラークラスに従ってインチ"
    },
    {
      "indent": 6,
      "text": "Reason: A string that provides further information related to the error that will be included in the JSON error dictionary with the 'reason'-key. Depending on the error-code semantics, the value of this field may be determined dynamically. In that case, the registration should set this value to '<reason>' and define its semantics in the description field.",
      "ja": "理由：「reason'-キーでJSONエラー辞書に含まれるエラーに関連する更なる情報を提供した文字列。エラーコードのセマンティクスに依存して、このフィールドの値は動的に決定されてもよいです。その場合には、登録は、「<理由>」にこの値を設定しなければならないと説明フィールドにその意味を定義します。"
    },
    {
      "indent": 6,
      "text": "Description: A brief description of the error-code semantics.",
      "ja": "説明：エラー・コードの意味の簡単な説明。"
    },
    {
      "indent": 6,
      "text": "Specification: Reference to the specification that defines the error-code in more detail.",
      "ja": "仕様：より詳細にエラーコードを定義する明細書を参照。"
    },
    {
      "indent": 3,
      "text": "The entries in Table 8 are registered by this document, with the value of the 'Specification' field set to RFC 7975 (this document).",
      "ja": "表8中のエントリは、RFC 7975（本書）に設定「仕様」フィールドの値が、この文書によって登録されています。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, DOI 10.17487/RFC3986, January 2005, <http://www.rfc-editor.org/info/rfc3986>.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、DOI 10.17487 / RFC3986、2005年1月<HTTP：/ /www.rfc-editor.org/info/rfc3986>。"
    },
    {
      "indent": 3,
      "text": "[RFC4291] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 4291, DOI 10.17487/RFC4291, February 2006, <http://www.rfc-editor.org/info/rfc4291>.",
      "ja": "[RFC4291] HindenとR.とS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 4291、DOI 10.17487 / RFC4291、2006年2月、<http://www.rfc-editor.org/info/rfc4291>。"
    },
    {
      "indent": 3,
      "text": "[RFC5952] Kawamura, S. and M. Kawashima, \"A Recommendation for IPv6 Address Text Representation\", RFC 5952, DOI 10.17487/RFC5952, August 2010, <http://www.rfc-editor.org/info/rfc5952>.",
      "ja": "[RFC5952]川村、S.及びM.川島、 \"IPv6のアドレスのテキスト表現のための勧告\"、RFC 5952、DOI 10.17487 / RFC5952、2010年8月、<http://www.rfc-editor.org/info/rfc5952> 。"
    },
    {
      "indent": 3,
      "text": "[RFC7230] Fielding, R., Ed. and J. Reschke, Ed., \"Hypertext Transfer Protocol (HTTP/1.1): Message Syntax and Routing\", RFC 7230, DOI 10.17487/RFC7230, June 2014, <http://www.rfc-editor.org/info/rfc7230>.",
      "ja": "[RFC7230]フィールディング、R.、エド。及びJ. Reschke、編、 \"ハイパーテキスト転送プロトコル（HTTP / 1.1）：メッセージの構文およびルーティング\"、RFC 7230、DOI 10.17487 / RFC7230、2014年6月、<http://www.rfc-editor.org/info/ rfc7230>。"
    },
    {
      "indent": 3,
      "text": "[RFC7159] Bray, T., Ed., \"The JavaScript Object Notation (JSON) Data Interchange Format\", RFC 7159, DOI 10.17487/RFC7159, March 2014, <http://www.rfc-editor.org/info/rfc7159>.",
      "ja": "[RFC7159]ブレイ、T.、エド。、 \"JavaScriptのObject Notation（JSON）形式のデータ交換フォーマット\"、RFC 7159、DOI 10.17487 / RFC7159、2014年3月、<http://www.rfc-editor.org/info/ rfc7159>。"
    },
    {
      "indent": 3,
      "text": "[RFC6895] Eastlake 3rd, D., \"Domain Name System (DNS) IANA Considerations\", BCP 42, RFC 6895, DOI 10.17487/RFC6895, April 2013, <http://www.rfc-editor.org/info/rfc6895>.",
      "ja": "[RFC6895]イーストレーク3日、D.、 \"ドメインネームシステム（DNS）IANAの考慮事項\"、BCP 42、RFC 6895、DOI 10.17487 / RFC6895、2013年4月、<http://www.rfc-editor.org/info/rfc6895 >。"
    },
    {
      "indent": 3,
      "text": "[RFC7493] Bray, T., Ed., \"The I-JSON Message Format\", RFC 7493, DOI 10.17487/RFC7493, March 2015, <http://www.rfc-editor.org/info/rfc7493>.",
      "ja": "[RFC7493]ブレイ、T.、エド。、 \"I-JSONメッセージ形式\"、RFC 7493、DOI 10.17487 / RFC7493、2015年3月、<http://www.rfc-editor.org/info/rfc7493>。"
    },
    {
      "indent": 3,
      "text": "[RFC7525] Sheffer, Y., Holz, R., and P. Saint-Andre, \"Recommendations for Secure Use of Transport Layer Security (TLS) and Datagram Transport Layer Security (DTLS)\", BCP 195, RFC 7525, DOI 10.17487/RFC7525, May 2015, <http://www.rfc-editor.org/info/rfc7525>.",
      "ja": "[RFC7525]シェファー、Y.、ホルツ、R.、およびP.サンアンドレ、 \"トランスポート層セキュリティ（TLS）およびデータグラムトランスポート層セキュリティ（DTLS）のセキュアな利用のための提言\"、BCP 195、RFC 7525、DOI 10.17487 / RFC7525、2015年5月、<http://www.rfc-editor.org/info/rfc7525>。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, DOI 10.17487/RFC5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、DOI 10.17487 / RFC5226、2008年5月、<http://www.rfc-editor.org /情報/ RFC5226>。"
    },
    {
      "indent": 3,
      "text": "[RFC6707] Niven-Jenkins, B., Le Faucheur, F., and N. Bitar, \"Content Distribution Network Interconnection (CDNI) Problem Statement\", RFC 6707, DOI 10.17487/RFC6707, September 2012, <http://www.rfc-editor.org/info/rfc6707>.",
      "ja": "[RFC6707]ニーヴン・ジェンキンス、B.、ルFaucheur、F.、およびN.ビタール、 \"コンテンツ配信ネットワーク相互接続（CDNI）問題文\"、RFC 6707、DOI 10.17487 / RFC6707、2012年9月、<のhttp：// WWW .rfc-editor.org /情報/ rfc6707>。"
    },
    {
      "indent": 3,
      "text": "[RFC2818] Rescorla, E., \"HTTP Over TLS\", RFC 2818, DOI 10.17487/RFC2818, May 2000, <http://www.rfc-editor.org/info/rfc2818>.",
      "ja": "[RFC2818]レスコラ、E.、 \"TLSオーバーHTTP\"、RFC 2818、DOI 10.17487 / RFC2818、2000年5月、<http://www.rfc-editor.org/info/rfc2818>。"
    },
    {
      "indent": 3,
      "text": "[RFC5890] Klensin, J., \"Internationalized Domain Names for Applications (IDNA): Definitions and Document Framework\", RFC 5890, DOI 10.17487/RFC5890, August 2010, <http://www.rfc-editor.org/info/rfc5890>.",
      "ja": "[RFC5890] Klensin、J.、 \"アプリケーション（IDNA）のための国際化ドメイン名：定義とドキュメントフレームワーク\"、RFC 5890、DOI 10.17487 / RFC5890、2010年8月、<http://www.rfc-editor.org/info/ rfc5890>。"
    },
    {
      "indent": 3,
      "text": "[RTMP] Adobe Systems Incorporated, \"Real-Time Messaging Protocol (RTMP) specification\", December 2012, <http://www.adobe.com/go/spec_rtmp>.",
      "ja": "[RTMP] Adob​​e Systems Incorporated（アドビシステムズ社）、 \"リアルタイムメッセージングプロトコル（RTMP）の仕様\"、2012年12月、<http://www.adobe.com/go/spec_rtmp>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC7337] Leung, K., Ed. and Y. Lee, Ed., \"Content Distribution Network Interconnection (CDNI) Requirements\", RFC 7337, DOI 10.17487/RFC7337, August 2014, <http://www.rfc-editor.org/info/rfc7337>.",
      "ja": "[RFC7337]レオン、K.、エド。そして、Y.リー、エド。、 \"コンテンツ配信ネットワーク相互接続（CDNI）の要件\"、RFC 7337、DOI 10.17487 / RFC7337、2014年8月、<http://www.rfc-editor.org/info/rfc7337>。"
    },
    {
      "indent": 3,
      "text": "[RFC7336] Peterson, L., Davie, B., and R. van Brandenburg, Ed., \"Framework for Content Distribution Network Interconnection (CDNI)\", RFC 7336, DOI 10.17487/RFC7336, August 2014, <http://www.rfc-editor.org/info/rfc7336>.",
      "ja": "[RFC7336]ピーターソン、L.、デイビー、B.、およびR.バンブランデンブルク、エド、 \"コンテンツ配信ネットワーク相互接続（CDNI）のためのフレームワーク\"、RFC 7336、DOI 10.17487 / RFC7336、2014年8月、<のhttp：// www.rfc-editor.org/info/rfc7336>。"
    },
    {
      "indent": 3,
      "text": "[RFC7736] Ma, K., \"Content Delivery Network Interconnection (CDNI) Media Type Registration\", RFC 7736, DOI 10.17487/RFC7736, December 2015, <http://www.rfc-editor.org/info/rfc7736>.",
      "ja": "[RFC7736]馬、K.、 \"コンテンツデリバリーネットワーク相互接続（CDNI）メディアタイプ登録\"、RFC 7736、DOI 10.17487 / RFC7736、2015年12月、<http://www.rfc-editor.org/info/rfc7736>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Taesang Choi, Francois Le Faucheur, Matt Miller, Scott Wainner, and Kevin J. Ma for their valuable comments and input to this document.",
      "ja": "作者はこのドキュメントへの彼らの貴重なコメントや入力のためTaesangチェ、フランソワ・ルFaucheur、マット・ミラー、スコット・ワイナー、そしてケビン・J.馬に感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "The following persons have participated as co-authors to this document:",
      "ja": "次の人は、この文書に共著者として参加しています："
    },
    {
      "indent": 3,
      "text": "Wang Danhua Huawei Email: wangdanhua@huawei.com",
      "ja": "王ダンはH UAのメールを塗装されていますHuawei社Wangdan華@ .COM"
    },
    {
      "indent": 3,
      "text": "He Xiaoyan Huawei Email: hexiaoyan@huawei.com",
      "ja": "オーストリアHU Aの六角メールに私の目：彼Xiaoyan Huawei社.COM @"
    },
    {
      "indent": 3,
      "text": "Ge Chen China Telecom Email: cheng@gsta.com",
      "ja": "Geの陳中国電信メールアドレス：cheng@gsta.com"
    },
    {
      "indent": 3,
      "text": "Ni Wei China Mobile Email: niwei@chinamobile.com",
      "ja": "ニッケル魏中国のモバイルEメール：niwei@chinamobile.com"
    },
    {
      "indent": 3,
      "text": "Yunfei Zhang Email: hishigh@gmail.com",
      "ja": "Y UN非張メール：彼のhigh@Gmail.com"
    },
    {
      "indent": 3,
      "text": "Spencer Dawkins Huawei Email: spencer@wonderhamster.org",
      "ja": "スペンサードーキンスHuawei社Eメール：spencer@wonderhamster.org"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ben Niven-Jenkins (editor) Nokia 3 Ely Road Milton, Cambridge CB24 6DD United Kingdom",
      "ja": "ベン・ニーヴン・ジェンキンス（編集者）、ノキア3エリー道路ミルトン、ケンブリッジCB24 6DDイギリス"
    },
    {
      "indent": 3,
      "text": "Email: ben.niven-jenkins@nokia.com",
      "ja": "メール：ben.niven-jenkins@nokia.com"
    },
    {
      "indent": 3,
      "text": "Ray van Brandenburg (editor) TNO Anna van Buerenplein 1 The Hague 2595DA The Netherlands",
      "ja": "レイ・ブランデンブルクアンナ・バンビューレンスクエア1 2595DAハーグオランダをRIP（編集者）"
    },
    {
      "indent": 3,
      "text": "Phone: +31-88-866-7000 Email: ray.vanbrandenburg@tno.nl",
      "ja": "電話：+ 31-88-866-7000 Eメール：ray.vanbrandenburg@tno.nl"
    }
  ]
}