{
  "title": {
    "text": "RFC 7040 - Public IPv4-over-IPv6 Access Network",
    "ja": "RFC 7040 - パブリックIPv4オーバーのIPv6アクセスネットワーク"
  },
  "number": 7040,
  "created_at": "2019-10-27 22:47:17.657861+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                            Y. Cui\nRequest for Comments: 7040                                         J. Wu\nCategory: Informational                                            P. Wu\nISSN: 2070-1721                                      Tsinghua University\n                                                              O. Vautrin\n                                                        Juniper Networks\n                                                                  Y. Lee\n                                                                 Comcast\n                                                           November 2013",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Public IPv4-over-IPv6 Access Network",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a mechanism called Public 4over6, which is designed to provide IPv4 Internet connectivity over an IPv6 access network using global IPv4 addresses. Public 4over6 was developed in the IETF and is in use in some existing deployments but is not recommended for new deployments. Future deployments of similar scenarios should use Lightweight 4over6. Public 4over6 follows the Hub and Spoke softwire model and uses an IPv4-in-IPv6 tunnel to forward IPv4 packets over an IPv6 access network. The bidirectionality of the IPv4 communication is achieved by explicitly allocating global non-shared IPv4 addresses to end users and by maintaining IPv4-IPv6 address binding on the border relay. Public 4over6 aims to provide uninterrupted IPv4 services to users, like Internet Content Providers (ICPs), etc., while an operator makes the access network transition to an IPv6-only access network.",
      "ja": "この文書では、グローバルIPv4アドレスを使用してIPv6アクセスネットワーク上でのIPv4インターネット接続を提供するように設計されて公開4over6と呼ばれるメカニズムを、説明しています。公共4over6はIETFで開発され、いくつかの既存の展開で使用されているが、新規導入のために推奨されていませんました。同様のシナリオの今後の展開は軽量4over6を使用する必要があります。公共4over6ハブに従い、softwireモデルを話し、IPv6アクセスネットワークを介してIPv4パケットを転送するためにIPv4のインのIPv6トンネルを使用します。 IPv4の通信の双方向性は、明示的グローバル非共有IPv4のはエンドユーザにアドレス割り当てによって、および境界リレーに結合たIPv4-IPv6アドレスを維持することによって達成されます。公共4over6は、オペレータがIPv6のみのアクセスネットワークへのアクセスネットワーク遷移しながら、などのインターネットコンテンツプロバイダ（ICP類）、のように、ユーザーへの中断のないのIPv4サービスを提供することを目的とします。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7040.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7040で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................4\n3. Scenario and Use Cases ..........................................4\n4. Public 4over6 Address Provisioning ..............................6\n   4.1. Basic Provisioning Steps ...................................6\n   4.2. Public IPv4 Address Allocation .............................7\n5. 4over6 CE Behavior ..............................................7\n6. 4over6 BR Behavior ..............................................8\n7. Fragmentation and Reassembly ....................................9\n8. DNS .............................................................9\n9. Security Considerations ........................................10\n10. Contributors ..................................................11\n11. References ....................................................12\n   11.1. Normative References .....................................12\n   11.2. Informative References ...................................12",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "When operators make the access network transition to an IPv6-only access network, they must continue to provide IPv4 services to their users to access IPv4 contents. IPv4 connectivity is required when communicating with the IPv4-only Internet. This document describes a mechanism called Public 4over6 for providing IPv4 connectivity over a native IPv6-only access network. This memo focuses on interactions between Public 4over6 elements as well as the deployment architecture.",
      "ja": "事業者がIPv6のみのアクセスネットワークへのアクセスネットワークの移行を行うと、彼らは、IPv4の内容にアクセスするには、そのユーザーにはIPv4サービスを提供し続けなければなりません。 IPv4専用のインターネットと通信するときにIPv4接続が必要です。このドキュメントは、ネイティブIPv6のみのアクセスネットワーク上でIPv4接続を提供するための公共4over6と呼ばれるメカニズムを説明します。このメモは公開4over6要素だけでなく、展開アーキテクチャ間の相互作用に焦点を当てています。"
    },
    {
      "indent": 3,
      "text": "Public 4over6 is in active deployment in some environments, particularly in China Next Generation Internet (CNGI) and China Education and Research Network 2 (CERNET2), but it is not recommended for new deployments. Documenting this approach is intended to benefit users and operators of existing deployments as well as readers of other IPv4-over-IPv6 documents.",
      "ja": "公共4over6は、特に中国次世代インターネット（CNGI）と中国教育研究ネットワーク2（CERNET2）で、一部の環境でアクティブな展開であるが、それは、新たな展開には推奨されません。このアプローチを文書化することで、ユーザーと事業者の既存の展開のだけでなく、他のIPv4オーバーのIPv6文書の読者に利益をもたらすことを意図しています。"
    },
    {
      "indent": 3,
      "text": "In addition to Public 4over6 and its deployment architecture as described in this memo, the IETF is currently working on a more generic solution called Lightweight 4over6 [SOFTWIRE-LW46], which is classified as a binding approach in the Unified IPv4-in-IPv6 Softwire Customer Premises Equipment (CPE) [SOFTWIRE-CPE]. Lightweight 4over6 covers both sharing and non-sharing global IPv4 addresses in the Hub and Spoke model. Future deployments should use [SOFTWIRE-LW46].",
      "ja": "このメモで説明したように公共4over6とその展開アーキテクチャに加えて、IETFは現在、統一のIPv4-IPv6の中-Softwireで結合アプローチとして分類されている軽量4over6 [SOFTWIRE-LW46]と呼ばれる、より汎用的なソリューション、に取り組んでいます顧客宅内機器（CPE）SOFTWIRE-CPE]。軽量4over6は、ハブとスポークモデルで共有および非共有のグローバルIPv4アドレスの両方をカバーしています。今後の展開では、[SOFTWIRE-LW46]を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "Public 4over6 utilizes the IPv4-in-IPv6 tunnel technique defined in [RFC2473], which enables IPv4 datagrams to traverse through native IPv6 networks. IPv4 nodes connect to the Tunnel Entry-Point Node and Tunnel Exit-Point Node to communicate over the IPv6-only network. Therefore, the Internet Service Providers (ISPs) can run an IPv6-only infrastructure instead of a fully dual-stack network as well as avoid the need to deploy scarce IPv4 address resources throughout the network.",
      "ja": "公共4over6は、IPv4データグラムは、ネイティブIPv6ネットワークを横断することができ、[RFC2473]で定義されたIPv4型のIPv6トンネル技術を利用します。 IPv4ノードは、IPv6のみのネットワークを介して通信するためのトンネルエントリポイントノードとトンネル出口ポイントノードに接続します。そのため、インターネットサービスプロバイダ（ISP）の代わりに、完全にデュアルスタックネットワークのIPv6のみのインフラストラクチャを実行するだけでなく、ネットワーク全体乏しいIPv4アドレスリソースを展開する必要性を回避することができます。"
    },
    {
      "indent": 3,
      "text": "This mechanism focuses on providing full end-to-end transparency to the user side. Therefore, global IPv4 addresses are expected to be provisioned to end users, and carrier-side address translation can be avoided. Furthermore, global non-shared IPv4 addresses are preferable to shared IPv4 addresses, so that user-side address translation is not necessary either. It is important, in particular, to users that are required to run their applications on an IP protocol different from TCP and UDP (e.g., IPsec, L2TP) or on certain well-known TCP/UDP ports (e.g., HTTP, SMTP). For many ISPs that are actually capable of provisioning non-shared unique IPv4 addresses, the mechanism provides a pure, suitable solution.",
      "ja": "このメカニズムは、ユーザ側に完全なエンド・ツー・エンドの透明性を提供することに焦点を当てています。そのため、グローバルIPv4アドレスは、エンドユーザーにプロビジョニングされると予想されており、キャリア側のアドレス変換を回避することができます。ユーザ側のアドレス変換は、いずれかの必要がないようさらに、グローバル非共有IPv4アドレスは、共有IPv4アドレスに好適です。これは、TCPとUDP（例えば、IPsecの、L2TP）から、または特定の周知のTCP / UDPポート（例えば、HTTP、SMTP）上で異なるIPプロトコル上でアプリケーションの実行に必要なユーザーに、特に重要です。実際に、非共有ユニークなIPv4アドレスをプロビジョニングすることができる多くのISPのために、機構は、純粋な、適切な解決策を提供します。"
    },
    {
      "indent": 3,
      "text": "Another focus of this mechanism is deployment and operational flexibility. Public 4over6 allows IPv4 and IPv6 address architectures to be totally independent of each other; the end user's IPv4 address is not embedded in its IPv6 address. Therefore, IPv4 address planning has no implication for IPv6 address planning. Operators can manage the IPv4 address resources in a flat, centralized manner. This requires that the tunnel concentrator [RFC4925] maintain the binding between an IPv4 address and an IPv6 address, i.e., maintaining per-subscriber binding state.",
      "ja": "このメカニズムのもう一つの焦点は、展開と運用の柔軟性です。公共4over6は、IPv4およびIPv6アドレスアーキテクチャは互いに完全に独立することができます。エンドユーザーのIPv4アドレスをIPv6アドレスに埋め込まれていません。そのため、IPv4アドレス計画は、IPv6アドレスの計画のための意味合いを持っていません。オペレータはフラット、一元的にIPv4アドレスリソースを管理することができます。これは、トンネルコンセントレータ[RFC4925]は、すなわち、加入者単位の結合状態を維持し、IPv4アドレスとIPv6アドレスとの間の結合を維持することを必要とします。"
    },
    {
      "indent": 3,
      "text": "The mechanism follows the Hub and Spoke softwire model [RFC4925] and uses IPv4-in-IPv6 tunneling as the basic data-plane method. Global non-shared IPv4 addresses are allocated from the ISP to end hosts or CPEs over an IPv6 network. Simultaneously, the binding between the allocated IPv4 address and the end user's IPv6 address is maintained on the tunnel concentrator for encapsulation usage.",
      "ja": "機構は、ハブとスポークsoftwireモデル[RFC4925]を次のと基本的なデータ・プレーン法などのIPv4型のIPv6トンネリングを使用します。グローバル非共有IPv4アドレスは、IPv6ネットワーク上のホストまたはのCPEを終了するためにISPから割り当てられています。同時に、割り当てられたIPv4アドレスとエンドユーザのIPv6アドレスとの間の結合は、カプセルの使用のためのトンネルコンセントレータ上に維持されます。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "Public 4over6: A per-subscriber, stateful IPv4-in-IPv6 tunnel mechanism. Public 4over6 supports bidirectional communication between the global IPv4 Internet and IPv4 hosts or customer networks via an IPv6 access network by leveraging IPv4-in-IPv6 tunneling [RFC2473] and global IPv4 address allocation over IPv6. The term 'Public' means the allocated IPv4 address is globally routable.",
      "ja": "公共4over6：ごとの加入者、ステートフルのIPv4型のIPv6トンネル機構。公共4over6は、IPv4内IPv6のトンネリング[RFC2473]とIPv6上グローバルIPv4アドレスの割り当てを活用することにより、IPv6アクセスネットワークを介してグローバルIPv4インターネットとIPv4ホストまたは顧客ネットワークとの間の双方向通信をサポートします。用語「公共」は、割り当てられたIPv4アドレスはグローバルにルーティング可能であることを意味します。"
    },
    {
      "indent": 3,
      "text": "Full IPv4 address: An IPv4 address that is not shared by multiple users. The user with this IPv4 address has full access to all the available TCP/UDP ports, including the well-known TCP/UDP ports.",
      "ja": "完全なIPv4アドレス：複数のユーザーで共有されていないIPv4アドレス。このIPv4アドレスを持つユーザーは、よく知られているTCP / UDPポートを含む利用可能なすべてのTCP / UDPポートへの完全なアクセス権を持っています。"
    },
    {
      "indent": 3,
      "text": "4over6 Customer Edge (CE): A device functioning as the Customer Edge equipment in a Public 4over6 environment. A 4over6 CE can be either a dual-stack capable host or a dual-stack CPE device, both of which have a tunnel interface to support IPv4-in-IPv6 encapsulation. In the former case, the host supports both IPv4 and IPv6 stacks but its uplink is IPv6 only. In the latter case, the CPE has an IPv6 interface connecting to the ISP network and an IPv4 or dual-stack interface connecting to the customer network; hosts in the customer network can be IPv4 only or dual stack.",
      "ja": "4over6カスタマーエッジ（CE）：公共4over6環境でカスタマーエッジ機器として機能デバイス。 4over6のCEは、IPv4内IPv6のカプセル化をサポートするために、トンネルインタフェースを有する両方が、デュアルスタック可能なホストまたはデュアルスタックCPEデバイスのいずれかとすることができます。前者の場合、ホストは、IPv4とIPv6の両方のスタックをサポートするが、そのアップリンクはIPv6のみです。後者の場合、CPEは、ISPのネットワークとIPv4または顧客ネットワークに接続するデュアルスタック・インターフェースに接続するIPv6インタフェースを有します。顧客ネットワーク内のホストは、IPv4のみ、またはデュアルスタックすることができます。"
    },
    {
      "indent": 3,
      "text": "4over6 Border Relay (BR): A router deployed in the edge of the operator's IPv6 access network that supports IPv4-in-IPv6 tunnel termination. A 4over6 BR is a dual-stack router that connects to both the IPv6 access network and the IPv4 Internet. The 4over6 BR can also work as a DHCPv4-over-IPv6 [DHCPv4-IPv6] server/relay for assigning and distributing global IPv4 addresses to 4over6 CEs.",
      "ja": "4over6ボーダリレー（BR）：IPv4の型のIPv6トンネル終端をサポートオペレータのIPv6アクセスネットワークのエッジに配備ルータ。 4over6のBRは、IPv6アクセスネットワークとIPv4インターネットの両方に接続してデュアルスタックルーターです。 4over6のBRはまた、グローバルなIPv4を割り当て、分配するためのDHCPv4オーバーのIPv6 [DHCPv4の-のIPv6]サーバ/リレーとして働くことができるのCEを4over6するアドレス。"
    },
    {
      "indent": 0,
      "text": "3. Scenario and Use Cases",
      "section_title": true,
      "ja": "3.シナリオと使用事例"
    },
    {
      "indent": 3,
      "text": "The general Public 4over6 scenario is shown in Figure 1. Users in an IPv6 network take IPv6 as their native service. Some users are end hosts that face the ISP network directly, while others are in private networks behind CPEs, such as a home Local Area Network (LAN), an enterprise network, etc. The ISP network is IPv6 only rather than dual stack, which means the ISP cannot provide native IPv4 service to users. In order to support legacy IPv4 transport, some routers on the carrier side are dual stack and are connected to the IPv4 Internet. These routers act as 4over6 BRs. Network users that require IPv4 connectivity obtain it through these routers.",
      "ja": "一般公開4over6シナリオは、IPv6ネットワーク1.ユーザーは、ネイティブサービスとしてIPv6を取る。図に示されています。一部のユーザーは他の人がなど家庭ローカルエリアネットワーク（LAN）、企業ネットワーク、ISPのネットワークがIPv6であるだけではなく、デュアルスタック、などのCPEの背後にあるプライベートネットワーク、でありながら、直接ISPのネットワークに直面しているエンドホストでありますISPがユーザーにネイティブのIPv4サービスを提供できないことを意味します。従来のIPv4トランスポートをサポートするために、キャリア側の一部のルータは、デュアルスタックで、IPv4インターネットに接続されています。これらのルータは、4over6のBRとしての役割を果たす。 IPv4接続を必要とするネットワークユーザーは、これらのルータを通してそれを得ます。"
    },
    {
      "indent": 3,
      "text": "                     +-------------------------+\n                     |    IPv6 ISP Network     |\n                     |                         |\n                  +------+                     |\n                  |4over6|Host             +-------+   +-----------+\n                  |  CE  |=================|       |   |           |\n                  +------+                 |       |   |           |\n                     |                     |4over6 |   |   IPv4    |\n+--------------+  +------+  IPv4-in-IPv6   |  BR   |---| Internet  |\n|   Customer   |  |4over6|                 |       |   |           |\n| Private IPv4 |--|  CE  |=================|       |   |           |\n|   Network    |  |      |CPE              +-------+   +-----------+\n+--------------+  +------+                     |\n                     |                         |\n                     |                         |\n                     +-------------------------+",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Figure 1: Public 4over6 Scenario",
      "ja": "図1：公共4over6シナリオ"
    },
    {
      "indent": 3,
      "text": "Public 4over6 can be applicable in several use cases. If an ISP that switches to IPv6 still has plenty of global IPv4 address resources, it can deploy Public 4over6 to provide transparent IPv4 service for all its customers. If the ISP does not have enough IPv4 addresses, it can deploy Dual-Stack Lite [RFC6333] as the basic IPv4-over-IPv6 service. Along with Dual-Stack Lite, Public 4over6 can be deployed as a value-added service, overcoming the service degradation caused by the Carrier Grade NAT (CGN). An IPv4 application server is a typical high-end user of Public 4over6. Using a full, global IPv4 address brings significant advantages in this case and is important for Internet Content Providers (ICPs) making the transition to IPv6:",
      "ja": "公共4over6は、いくつかのユースケースに適用することができます。 IPv6への切り替えISPは、まだグローバルIPv4アドレス資源の多くを持っている場合、それはすべての顧客のために透明IPv4サービスを提供するために、公共の4over6を展開することができます。 ISPは十分にIPv4アドレスを持っていない場合、それは基本的なIPv4のオーバーIPv6サービスとしてデュアルスタックライト[RFC6333]を展開することができます。デュアルスタックライトに加えて、公共4over6は、キャリアグレードNAT（CGN）によって引き起こされるサービス低下を克服し、付加価値サービスとして展開することができます。 IPv4のアプリケーションサーバは、公共4over6の典型的なハイエンドユーザーです。フル、グローバルIPv4アドレスを使用すると、この場合の重要な利点をもたらすとIPv6への移行を行うインターネットコンテンツプロバイダーのため（のICP）が重要です。"
    },
    {
      "indent": 3,
      "text": "o The DNS registration can be direct, using a dedicated address;",
      "ja": "O DNS登録は、専用のアドレスを使用して、直接することができ;"
    },
    {
      "indent": 3,
      "text": "o Accessing the application service can be straightforward, with no translation involved;",
      "ja": "関与変換せず、簡単なことができ、アプリケーションサービスへのアクセスO;"
    },
    {
      "indent": 3,
      "text": "o There will be no need to provide NAT traversal mechanisms for incoming traffic, and no special handling is required for the well-known TCP/UDP ports.",
      "ja": "Oがあり、着信トラフィックのためのNATトラバーサルメカニズムを提供する必要もないでしょうし、特別な処理は、よく知られているTCP / UDPポートのために必要とされません。"
    },
    {
      "indent": 0,
      "text": "4. Public 4over6 Address Provisioning",
      "section_title": true,
      "ja": "4.公開4over6アドレスプロビジョニング"
    },
    {
      "indent": 0,
      "text": "4.1. Basic Provisioning Steps",
      "section_title": true,
      "ja": "4.1. 基本的なプロビジョニング手順"
    },
    {
      "indent": 3,
      "text": "Figure 2 shows the basic provisioning steps for Public 4over6.",
      "ja": "図2は、公共4over6のための基本的なプロビジョニング手順を示しています。"
    },
    {
      "indent": 7,
      "text": "  4over6                  DHCPv6          4over6         DHCPv4\n    CE                    Server            BR           Server\n    |Assign IPv6 Addr/Pref +|               |              |\n    |  BR's IPv6 Addr Info  |               |              |\n    |<----------------------|               |              |\n    |     DHCPv6/Other      |               |              |\n   WAN                                      |              |\nIPv6 Configure                              |              |\n    |                                       |              |\n    | Assign Public IPv4 Addr (DHCPv4 over v6/Static Conf) |\n    |<--------------------------------------|<-------------|\n    |                                       | IPv4-IPv6    |\n    |                                       | Binding SYN  |\n   Tunnel                                   |\nIPv4 Configure                        Binding Update\n    |                                       |\n    |          IPv4-in-IPv6 Tunnel          |\n    |<------------------------------------->|\n    |                                       |",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 2: Public 4over6 Address Provisioning",
      "ja": "図2：公共4over6アドレスプロビジョニング"
    },
    {
      "indent": 3,
      "text": "The main steps are:",
      "ja": "主な手順は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o IPv6 address/prefix is provisioned to 4over6 CE, along with knowledge of 4over6 BR's IPv6 address, using DHCPv6 or other means.",
      "ja": "O IPv6アドレス/プレフィックスは、DHCPv6のか、他の手段を用いて、4over6 BRのIPv6アドレスの知識とともに、4over6 CEにプロビジョニングされます。"
    },
    {
      "indent": 3,
      "text": "o 4over6 CE configures its WAN interface with a globally unique IPv6 address, which is a result of IPv6 provisioning, including DHCPv6, Stateless Address Autoconfiguration (SLAAC), or manual configuration.",
      "ja": "O 4over6 CEは、DHCPv6の、ステートレスアドレス自動設定（SLAAC）、または手動設定などのIPv6プロビジョニングの結果であり、グローバルに一意のIPv6アドレスとのWANインターフェイスを構成します。"
    },
    {
      "indent": 3,
      "text": "o IPv4 address is provisioned to 4over6 CE by DHCPv4 over IPv6 or static configuration.",
      "ja": "O IPv4アドレスは、IPv6または静的な構成上のDHCPv4によりCEを4over6するようにプロビジョニングされています。"
    },
    {
      "indent": 3,
      "text": "o 4over6 BR obtains the IPv4 and IPv6 addresses of the 4over6 CE using information provided by the DHCPv4 server.",
      "ja": "O 4over6 BRは、DHCPv4サーバによって提供される情報を用いて、4over6 CEのIPv4およびIPv6アドレスを取得します。"
    },
    {
      "indent": 3,
      "text": "o 4over6 CE configures its tunnel interface as a result of IPv4 provisioning.",
      "ja": "O 4over6 CEは、IPv4プロビジョニングの結果として、そのトンネルインターフェースを構成します。"
    },
    {
      "indent": 3,
      "text": "o 4over6 BR updates the IPv4-IPv6 address-binding table according to the address-binding information acquired from the DHCPv4 server.",
      "ja": "O 4over6 BRは、DHCPv4サーバから取得したアドレス・バインディング情報に応じたIPv4-IPv6アドレス結合テーブルを更新します。"
    },
    {
      "indent": 0,
      "text": "4.2. Public IPv4 Address Allocation",
      "section_title": true,
      "ja": "4.2. パブリックIPv4アドレスの割り当て"
    },
    {
      "indent": 3,
      "text": "Usually, each CE is provisioned with one global IPv4 address. However, it is possible that a CE would require an IPv4 prefix. The key problem here is the mechanism for IPv4 address provisioning over IPv6 networks.",
      "ja": "通常、各CEは、一つのグローバルIPv4アドレスがプロビジョニングされています。しかし、CEがIPv4プレフィックスを必要とすることも可能です。ここで重要な問題は、IPv6ネットワーク上でIPv4アドレスのプロビジョニングのためのメカニズムです。"
    },
    {
      "indent": 3,
      "text": "There are two possibilities: DHCPv4 over IPv6, and static configuration. Public 4over6 supports both these methods. DHCPv4 over IPv6 allows DHCPv4 messages to be transported in IPv6 rather than IPv4; therefore, the DHCPv4 process can be performed over an IPv6 network between the BR and the relevant CE. [DHCPv4-IPv6] describes the DHCP protocol extensions needed to support this operation. For static configuration, Public 4over6 users and ISP operators negotiate beforehand to authorize the IPv4 address(es). Then the tunnel interface and the address binding are configured by the user and the ISP, respectively.",
      "ja": "IPv6を介したDHCPv4、および静的構成：2つの可能性があります。公共4over6は、これらのメソッドの両方をサポートしています。 IPv6の上のDHCPv4はDHCPv4のメッセージは、IPv6なくIPv4の中で輸送されることを可能にします。従って、DHCPv4のプロセスは、BRと関連CEとの間のIPv6ネットワークを介して行うことができます。 [DHCPv4の-IPv6はこの操作をサポートするために必要なDHCPプロトコルの拡張機能について説明します。静的構成のために、パブリック4over6ユーザとISPオペレータは、IPv4アドレスを認証するために予め交渉します。次に、トンネルインターフェースとアドレスバインディングは、それぞれ、ユーザとISPによって構成されています。"
    },
    {
      "indent": 3,
      "text": "While regular users would probably opt for DHCPv4 over IPv6, the static configuration is particularly applicable in two cases: for application servers, which require a stable IPv4 address; and for enterprise networks, which usually require an IPv4 prefix rather than one single address. (Note that DHCPv4 does not support prefix allocation.)",
      "ja": "通常のユーザーは、おそらくIPv6の上のDHCPv4を選ぶだろうが、静的な構成が2つの場合に特に適用可能である：安定したIPv4アドレスを必要とするアプリケーションサーバー、ため。また、通常のIPv4接頭辞よりむしろ単一のアドレスを必要とする企業ネットワーク用。 （DHCPv4のプレフィックスの割り当てをサポートしていないことに注意してください。）"
    },
    {
      "indent": 0,
      "text": "5. 4over6 CE Behavior",
      "section_title": true,
      "ja": "5. EC 4over6行動"
    },
    {
      "indent": 3,
      "text": "A CE is provisioned with IPv6 before the Public 4over6 process. It also learns the BR's IPv6 address beforehand. This IPv6 address can be configured using a variety of methods, ranging from an out-of-band mechanism, manual configuration, or via a DHCPv6 option. In order to guarantee interoperability, the CE element implements the AFTR-Name DHCPv6 option defined in [RFC6334].",
      "ja": "CEは、公共4over6プロセスの前にIPv6でプロビジョニングされます。また、事前にBRのIPv6アドレスを学習します。このIPv6アドレスがアウトオブバンド機構、手動設定に至るまで、様々な方法を用いて構成することができ、またはDHCPv6のオプションを介し。相互運用性を保証するために、CE要素は[RFC6334]で定義されたAFTR-名前のDHCPv6オプションを実装しています。"
    },
    {
      "indent": 3,
      "text": "A CE supports DHCPv4 over IPv6 [DHCPv4-IPv6] to dynamically acquire an IPv4 address over IPv6 and assign it to the IPv4-in-IPv6 tunnel interface. The CE regards the BR as its DHCPv4-over-IPv6 server/relay, which is used to obtain its global IPv4 address allocation; its IPv6 address is learned by the CE as described above.",
      "ja": "CEは、IPv6上のDHCPv4 [DHCPv4の-IPv6は】動的にIPv6を介したIPv4アドレスを取得し、IPv4インのIPv6トンネルインターフェイスに割り当てるサポート。 CEは、グローバルIPv4アドレスの割り当てを取得するために使用され、そのDHCPv4のオーバーのIPv6サーバ/リレーとしてBRに関しては、上記のようにIPv6アドレスはCEによって学習されます。"
    },
    {
      "indent": 3,
      "text": "A CE also supports static configuration of the tunnel interface. In the case of prefix provisioning, the tunnel interface is assigned with the well-known IPv4 address defined in Section 5.7 of [RFC6333], rather than using an address from the prefix. If the CE has multiple IPv6 addresses on its WAN interface, it uses one of the IPv6 addresses for DHCPv4 over IPv6 or negotiation of static configuration. The CE then uses the same IPv6 address for data-plane encapsulation.",
      "ja": "CEはまた、トンネルインターフェイスの静的な構成をサポートします。プレフィックスプロビジョニングの場合には、トンネルインターフェースはなくプレフィックスからアドレスを使用するよりも、[RFC6333]のセクション5.7で定義されたよく知られているIPv4アドレスが割り当てられています。 CEがWANインターフェイスに複数のIPv6アドレスを持っている場合、それは、IPv6の一つは、IPv6または静的な構成の交渉上のDHCPv4のためにアドレスを使用しています。 CEは、データプレーンのカプセル化のために、同じIPv6アドレスを使用しています。"
    },
    {
      "indent": 3,
      "text": "A CE performs IPv4-in-IPv6 encapsulation and decapsulation on the tunnel interface. When sending out an IPv4 packet, it performs the encapsulation using the IPv6 address of the 4over6 BR as the IPv6 destination address and its own IPv6 address as the IPv6 source address. The decapsulation on the 4over6 CE is simple. When receiving an IPv4-in-IPv6 packet, the CE just removes the IPv6 header and either hands it to a local upper layer or forwards it to the customer network according to the IPv4 destination address.",
      "ja": "CEは、トンネルインターフェース上でIPv4インのIPv6カプセル化及びデカプセル化を行います。 IPv4パケットを送信するとき、それは、IPv6宛先アドレスとIPv6ソースアドレスとして、自身のIPv6アドレスとして4over6 BRのIPv6アドレスを使用してカプセル化を行います。 4over6 CE上のカプセル化解除は簡単です。 IPv4のインのIPv6パケットを受信すると、CEはそれは、IPv4宛先アドレスに基づいてローカル上層または顧客ネットワークに転送をするIPv6ヘッダとのいずれかの手を除去します。"
    },
    {
      "indent": 3,
      "text": "A CE runs a regular IPv4 Network Address and Port Translation (NAPT) for its customer network when it is provisioned with one single IPv4 address. In that case, the assigned IPv4 address of the tunnel interface would be the external IPv4 address of the NAPT. Then the CE performs IPv4 private-to-public translation before encapsulation of IPv4 packets from the customer network and IPv4 public-to-private translation after decapsulation of IPv4-in-IPv6 packets.",
      "ja": "それは1つのIPv4アドレスがプロビジョニングされているとき、CEは、その顧客ネットワークの通常のIPv4ネットワークアドレスとポート変換（NAPT）を実行します。その場合には、トンネルインタフェースの割り当てられたIPv4アドレスは、NAPTの外部IPv4アドレスであろう。そして、CEは、IPv4インのIPv6パケットのカプセル化解除した後、顧客ネットワークとIPv4のパブリック・ツー・プライベート翻訳からIPv4パケットをカプセル化する前に、IPv4のプライベート・ツー・公共変換を行います。"
    },
    {
      "indent": 3,
      "text": "IPv4 NAPT is not necessary when the CE is provisioned with an IPv4 prefix. In this case, detailed customer network planning is out of scope for this document.",
      "ja": "CEは、IPv4のプレフィックスがプロビジョニングされているとき、IPv4のNAPTは必要ありません。この場合は、詳細な顧客ネットワーク計画はこの文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "The 4over6 CE supports backward compatibility with DS-Lite. A CE can employ the well-known IPv4 address for the Basic Bridging BroadBand (B4) element [RFC6333] and switch to Dual-Stack Lite for IPv4 communications if it can't get a global IPv4 address from the DHCPv4 server (for instance, if the DHCPv4-over-IPv6 process fails or the DHCPv4 server refuses to allocate a global IPv4 address to it, etc.).",
      "ja": "4over6 CEは、DS-Liteのとの後方互換性をサポートしています。 CEは、基本的なブリッジングブロードバンド（B4）要素[RFC6333]のためによく知られているIPv4アドレスを採用し、それは、例えば（DHCPv4サーバからグローバルIPv4アドレスを取得できない場合のIPv4通信にデュアルスタックライトに切り替えることができます）のDHCPv4オーバーのIPv6プロセスが失敗するかDHCPv4サーバは、それにグローバルIPv4アドレスを割り当てることなどを拒否した場合。"
    },
    {
      "indent": 0,
      "text": "6. 4over6 BR Behavior",
      "section_title": true,
      "ja": "6. 4over6 BR行動"
    },
    {
      "indent": 3,
      "text": "The 4over6 BR maintains the bindings between the CE IPv6 address and CE IPv4 address (prefixes). The bindings are used to provide the correct encapsulation destination address for inbound IPv4 packets and also to validate the IPv6-IPv4 source of the outbound IPv4-in-IPv6 packets.",
      "ja": "4over6 BRはCE IPv6アドレスとCE IPv4アドレス（プレフィックス）との間のバインディングを維持します。バインディングは、インバウンドIPv4パケットに対する正しいカプセル化宛先アドレスを提供するために使用され、また、アウトバウンドのIPv4型のIPv6パケットのIPv6-IPv4ソースを検証します。"
    },
    {
      "indent": 3,
      "text": "The BR acquires the binding information through the IPv4 address provisioning process. For static configuration, the operator manually configures the BR using the binding information obtained through negotiation with the customer. As for DHCPv4 over IPv6, there are multiple possibilities, which are deployment-specific:",
      "ja": "BRは、IPv4アドレスプロビジョニングプロセスを通じてバインディング情報を取得します。静的構成のために、オペレータは、手動で、顧客との交渉を経て得られた結合情報を用いてBRを構成します。 IPv6を介しDHCPv4のとおり、デプロイメント固有の複数の可能性があります："
    },
    {
      "indent": 3,
      "text": "o The BR can be co-located with the DHCPv4-over-IPv6 server. Then the synchronization happens within the BR. It installs a binding when sending out an ACK for a DHCP lease and deletes it when the lease expires or a DHCP RELEASE message is received.",
      "ja": "O BRは、DHCPv4のオーバーのIPv6サーバと同じ場所に配置することができます。そして、同期がBR中に起こります。これは、DHCPリースのためのACKを送信する際に結合インストールし、リース期間が終了するか、DHCP RELEASEメッセージを受信したときに、それを削除します。"
    },
    {
      "indent": 3,
      "text": "o The BR can play the role of IPv6-Transport Relay Agent (TRA) as described in [DHCPv4-IPv6] and snoop for the DHCPv4 ACK and RELEASE messages as well as keep a timer for each binding according to the DHCP lease time.",
      "ja": "BR O [DHCPv4の-のIPv6]に記載されたIPv6-交通リレーエージェント（TRA）の役割を果たしており、スヌープのDHCPv4 ACKとRELEASEメッセージのためだけでなく、DHCPリース時間に応じて結合ごとにタイマーを維持することができます。"
    },
    {
      "indent": 3,
      "text": "On the IPv6 side, the BR decapsulates IPv4-in-IPv6 packets coming from 4over6 CEs. It removes the IPv6 header of every IPv4-in-IPv6 packet and forwards it to the IPv4 Internet. Before the decapsulation, the BR checks the inner IPv4 source address against the outer IPv6 source address by matching such a binding entry in the binding table. If no binding is found, the BR silently drops the packet. On the IPv4 side, the BR encapsulates the IPv4 packets destined to 4over6 CEs. When performing the IPv4-in-IPv6 encapsulation, the BR uses its own IPv6 address as the IPv6 source address and uses the IPv4 destination address in the packet to look up the IPv6 destination address in the address-binding table. After the encapsulation, the BR sends the IPv6 packet on its IPv6 interface to reach a CE.",
      "ja": "IPv6の側で、BRは、IPv4内IPv6パケットは、4over6のCEからのデカプセル化します。それは、すべてのIPv4インのIPv6パケットのIPv6ヘッダを削除し、IPv4インターネットに転送します。デカプセル化の前に、BRは、バインディングテーブル内のそのようなバインディングエントリを照合することによって、外側のIPv6ソースアドレスに対して内側のIPv4ソースアドレスをチェックします。何の結合が検出されない場合、BRは黙ってパケットをドロップします。 IPv4の側で、BRは、4over6 CEに宛てIPv4パケットをカプセル化します。 IPv4のインのIPv6カプセル化を行う場合、BRは、IPv6送信元アドレスとして、自身のIPv6アドレスを使用し、アドレス結合テーブル内のIPv6宛先アドレスをルックアップするために、パケットにIPv4宛先アドレスを使用します。カプセル化した後、BRは、CEに到達するために、そのIPv6インターフェイス上でIPv6パケットを送信します。"
    },
    {
      "indent": 3,
      "text": "The BR supports the hairpinning of traffic between two CEs by performing decapsulation and re-encapsulation of packets.",
      "ja": "BRは、デカプセル化し、パケットの再カプセル化を行うことにより、2つのCE間のトラフィックのヘアピニングをサポートします。"
    },
    {
      "indent": 3,
      "text": "In cases where the BR manages the global IPv4 address pool, the BR advertises the routing information of IPv4 addresses to the IPv4 Internet.",
      "ja": "BRは、グローバルIPv4アドレスプールを管理のケースでは、BRは、IPv4のルーティング情報は、IPv4インターネットに対処アドバタイズします。"
    },
    {
      "indent": 0,
      "text": "7. Fragmentation and Reassembly",
      "section_title": true,
      "ja": "7.フラグメンテーションおよび再構成"
    },
    {
      "indent": 3,
      "text": "The same considerations as those described in Sections 5.3 and 6.3 of [RFC6333] are taken into account for the CE and the BR, respectively.",
      "ja": "[RFC6333]のセクション5.3および6.3で説明したものと同様の考慮は、それぞれ、CEおよびBRのために考慮されます。"
    },
    {
      "indent": 0,
      "text": "8. DNS",
      "section_title": true,
      "ja": "8. DNS"
    },
    {
      "indent": 3,
      "text": "The procedure described in Sections 5.5 and 6.4 of [RFC6333] is followed by the CE and the BR, respectively.",
      "ja": "[RFC6333]のセクション5.5および6.4に記載された手順を、それぞれ、CEおよびBRが続きます。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The 4over6 BR implements methods to limit service only to registered customers. On the control plane, the BR allocates IPv4 addresses only to registered customers. The BR can filter on the IPv6 source addresses of incoming DHCP requests and only respond to the ones that are conveyed by registered IPv6 source addresses. But this doesn't work in situations where multi-homing is present. In the networks where Public 4over6 is deployed, multi-homing is disallowed to avoid this issue.",
      "ja": "4over6のBRは、登録ユーザのみにサービスを制限する方法を実装しています。制御プレーンでは、BRは、IPv4のみ登録済みのお客様にアドレスを割り当てます。 BRは、着信DHCP要求のIPv6送信元アドレスに基づいてフィルタリングのみ登録IPv6送信元アドレスによって搬送されたものに対応することができます。しかし、これはマルチホーミングが存在する状況では動作しません。公共4over6が展開されているネットワークでは、マルチホーミングは、この問題を回避するために許可されていません。"
    },
    {
      "indent": 3,
      "text": "Alternatively, the BR can filter out the unregistered CE's requests during the DHCP process. For data packets, the BR does ingress filtering by looking up addresses in the IPv4-IPv6 address-binding table for the related matches as described in Section 6.",
      "ja": "また、BRは、DHCPプロセスの間に未登録CEの要求をフィルタリングすることができます。データパケットに対して、BRはセクション6で説明したように、関連する一致のIPv4-IPv6アドレス結合テーブル内のアドレスをルックアップすることにより、イングレスフィルタリングを行います。"
    },
    {
      "indent": 3,
      "text": "In the case of fallback to DS-Lite, security considerations in Section 11 of [RFC6333] are followed.",
      "ja": "DS-Liteのへのフォールバックの場合は、[RFC6333]のセクション11のセキュリティの考慮事項が続いています。"
    },
    {
      "indent": 0,
      "text": "10. Contributors",
      "section_title": true,
      "ja": "10.協力者"
    },
    {
      "indent": 3,
      "text": "The following are those who have made contributions to the effort:",
      "ja": "次の努力への貢献をした人たちです。"
    },
    {
      "indent": 6,
      "text": "Huiling Zhao China Telecom Room 502, No.118, Xizhimennei Street Beijing 100035 P.R.China Phone: +86-10-58552002 Email: zhaohl@ctbri.com.cn",
      "ja": "Huiling趙中国電信室502、No.118、Xizhimenneiストリート北京100035 P.R.China電話：+ 86-10-58552002 Eメール：zhaohl@ctbri.com.cn"
    },
    {
      "indent": 6,
      "text": "Chongfeng Xie China Telecom Room 708, No.118, Xizhimennei Street Beijing 100035 P.R.China Phone: +86-10-58552116 Email: xiechf@ctbri.com.cn",
      "ja": "Chongfeng謝中国電信室708、No.118、Xizhimenneiストリート北京100035 P.R.China電話：+ 86-10-58552116 Eメール：xiechf@ctbri.com.cn"
    },
    {
      "indent": 6,
      "text": "Qiong Sun China Telecom Room 708, No.118, Xizhimennei Street Beijing 100035 P.R.China Phone: +86-10-58552936 Email: sunqiong@ctbri.com.cn",
      "ja": "Qiong日中国電信室708、No.118、Xizhimenneiストリート北京100035 P.R.China電話：+ 86-10-58552936 Eメール：sunqiong@ctbri.com.cn"
    },
    {
      "indent": 6,
      "text": "Qi Sun Tsinghua University Beijing 100084 P.R.China Phone: +86-10-62785822 Email: sunqi@csnet1.cs.tsinghua.edu.cn",
      "ja": "チー日清華大学、北京100084 P.R.China電話：+ 86-10-62785822 Eメール：sunqi@csnet1.cs.tsinghua.edu.cn"
    },
    {
      "indent": 6,
      "text": "Chris Metz Cisco Systems 3700 Cisco Way San Jose, CA 95134 USA Email: chmetz@cisco.com",
      "ja": "クリス・メッツシスコシステムズ3700のCiscoウェイサンノゼ、CA 95134 USA Eメール：chmetz@cisco.com"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2473] Conta, A. and S. Deering, \"Generic Packet Tunneling in IPv6 Specification\", RFC 2473, December 1998.",
      "ja": "[RFC2473]コンタ、A.、およびS.デアリング、 \"IPv6の仕様の汎用パケットトンネリング\"、RFC 2473、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4925] Li, X., Dawkins, S., Ward, D., and A. Durand, \"Softwire Problem Statement\", RFC 4925, July 2007.",
      "ja": "[RFC4925]のLi、X.、ドーキンス、S.、ウォード、D.、およびA.デュラン、 \"Softwire問題文\"、RFC 4925、2007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6333] Durand, A., Droms, R., Woodyatt, J., and Y. Lee, \"Dual-Stack Lite Broadband Deployments Following IPv4 Exhaustion\", RFC 6333, August 2011.",
      "ja": "[RFC6333]デュラン、A.、Droms、R.、Woodyatt、J.、およびY.リー、 \"IPv4の枯渇後デュアルスタックLiteのブロードバンドの展開\"、RFC 6333、2011年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6334] Hankins, D. and T. Mrugalski, \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6) Option for Dual-Stack Lite\", RFC 6334, August 2011.",
      "ja": "[RFC6334]ハンキンズ、D.とT. Mrugalski、 \"IPv6の動的ホスト構成プロトコル（DHCPv6）デュアルスタックLiteのオプション\"、RFC 6334、2011年8月。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[DHCPv4-IPv6] Cui, Y., Wu, P., Wu, J., Lemon, T., and Q. Sun, \"DHCPv4 over IPv6 Transport\", Work in Progress, October 2013.",
      "ja": "【のDHCPv4-のIPv6]キュイ、Y.、ウー、P.、ウー、J.、レモン、T.、およびQ.サン、 \"IPv6のトランスポート上のDHCPv4\"、進歩、2013年10月に働いています。"
    },
    {
      "indent": 3,
      "text": "[SOFTWIRE-CPE] Boucadair, M., Farrer, I., Perreault, S., Ed., and S. Sivakumar, Ed., \"Unified IPv4-in-IPv6 Softwire CPE\", Work in Progress, May 2013.",
      "ja": "[SOFTWIRE-CPE] Boucadair、M.、ファラー、I.、ペロー、S.編、及びS.シバクマー編、 \"統合のIPv4型のIPv6 Softwire CPE\"、進歩、2013年5月に働いています。"
    },
    {
      "indent": 3,
      "text": "[SOFTWIRE-LW46] Cui, Y., Sun, Q., Boucadair, M., Tsou, T., Lee, Y., and I. Farrer, \"Lightweight 4over6: An Extension to the DS-Lite Architecture\", Work in Progress, November 2013.",
      "ja": "[SOFTWIRE-LW46]崔、Y.、日、Q.、Boucadair、M.、ツオウ、T.、リー、Y.、およびI.ファラー、 \"軽量4over6：DS-Liteのアーキテクチャへの拡張\"、仕事プログレス11月2013インチ"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Yong Cui Tsinghua University Beijing 100084 P.R.China Phone: +86-10-6260-3059 EMail: yong@csnet1.cs.tsinghua.edu.cn",
      "ja": "大学北京100084 P.R.China電話の龍CuのITSのING：+ 86-10-6260-3059メール：時間の@CS NET1量との彼の4年計画に...."
    },
    {
      "indent": 3,
      "text": "Jianping Wu Tsinghua University Beijing 100084 P.R.China Phone: +86-10-6278-5983 EMail: jianping@cernet.edu.cn",
      "ja": "にJianping @CER純額：+ 86-10-6278-5983メール：Jイアン・W UTは、その後、大学北京100084 P.R.China電話を平らに歌います。"
    },
    {
      "indent": 3,
      "text": "Peng Wu Tsinghua University Beijing 100084 P.R.China Phone: +86-10-6278-5822 EMail: pengwu.thu@gmail.com",
      "ja": "鵬呉清華大学、北京100084 P.R.China電話：+ 86-10-6278-5822 Eメール：pengwu.thu@gmail.com"
    },
    {
      "indent": 3,
      "text": "Olivier Vautrin Juniper Networks 1194 N. Mathilda Avenue Sunnyvale, CA 94089 USA EMail: Olivier@juniper.net",
      "ja": "Vautrinオリヴィエジュニパーネットワークスの1194 N.マチルダアベニューサニーベール、CA 94089 USA電子メール：Olivier@juniper.net"
    },
    {
      "indent": 3,
      "text": "Yiu L. Lee Comcast One Comcast Center Philadelphia, PA 19103 USA EMail: yiu_lee@cable.comcast.com",
      "ja": "耀輝L.リーComcastの一つコムキャストセンター、フィラデルフィア、PA 19103 USA電子メール：yiu_lee@cable.comcast.com"
    }
  ]
}