{
  "title": {
    "text": "RFC 7259 - The Jabber-ID Header Field",
    "ja": "RFC 7259 - Jabber-IDヘッダーフィールド"
  },
  "number": 7259,
  "created_at": "2020-09-03 19:11:36.241045+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                    P. Saint-Andre\nRequest for Comments: 7259                                          &yet\nCategory: Informational                                         May 2014\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 23,
      "text": "The Jabber-ID Header Field",
      "ja": "Jabber-IDヘッダーフィールド"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document defines a header field that enables the author of an email or netnews message to include a Jabber ID in the message header block for the purpose of associating the author with a particular Extensible Messaging and Presence Protocol (XMPP) address.",
      "ja": "このドキュメントでは、電子メールメッセージまたはネットニュースメッセージの作成者が特定のExtensible Messaging and Presence Protocol（XMPP）アドレスに関連付けるために、メッセージヘッダーブロックにJabber IDを含めることができるヘッダーフィールドを定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "これは、他のRFCストリームとは無関係に、RFCシリーズへの貢献です。 RFCエディターは、このドキュメントを独自の裁量で公開することを選択し、実装または展開に対するその価値については何も述べていません。 RFC Editorによって公開が承認されたドキュメントは、どのレベルのインターネット標準の候補にもなりません。 RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7259.",
      "ja": "このドキュメントの現在のステータス、正誤表、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7259で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2014 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Syntax  . . . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Usage . . . . . . . . . . . . . . . . . . . . . . . . . . . .   3\n  3.1.  Inclusion . . . . . . . . . . . . . . . . . . . . . . . .   3\n  3.2.  Generation  . . . . . . . . . . . . . . . . . . . . . . .   3\n  3.3.  Processing  . . . . . . . . . . . . . . . . . . . . . . .   4\n  3.4.  Disposition . . . . . . . . . . . . . . . . . . . . . . .   4\n4.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   4\n5.  Security and Privacy Considerations . . . . . . . . . . . . .   5\n6.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   5\n  6.1.  Normative References  . . . . . . . . . . . . . . . . . .   5\n  6.2.  Informative References  . . . . . . . . . . . . . . . . .   6\nAppendix A.  Acknowledgements . . . . . . . . . . . . . . . . . .   7",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Extensible Messaging and Presence Protocol (XMPP), documented in [RFC6120], is a streaming XML technology that enables any two entities on a network to exchange well-defined but extensible XML elements (called \"XML stanzas\") in close to real time. Given XMPP's heritage in the Jabber open-source community, one of the primary uses for XMPP is instant messaging and presence as documented in [RFC6121], and XMPP addresses are still referred to as Jabber IDs.",
      "ja": "[RFC6120]に文書化されているExtensible Messaging and Presence Protocol（XMPP）は、ネットワーク上の任意の2つのエンティティが明確に定義されているが拡張可能なXML要素（ \"XMLスタンザ\"と呼ばれる）をほぼリアルタイムで交換できるストリーミングXMLテクノロジーです。 。 JabberオープンソースコミュニティにおけるXMPPの伝統を踏まえると、XMPPの主な用途の1つは[RFC6121]で文書化されているインスタントメッセージングとプレゼンスであり、XMPPアドレスは引き続きJabber IDと呼ばれます。"
    },
    {
      "indent": 3,
      "text": "Because almost all human users of Jabber/XMPP instant messaging and presence systems also use email systems [RFC5322] and because many also use netnews systems [RFC5536], it can be helpful for them to associate their Jabber IDs with the messages they author. The Jabber-ID header field provides a standard location for that information.",
      "ja": "Jabber / XMPPインスタントメッセージングおよびプレゼンスシステムのほとんどすべての人間のユーザーは電子メールシステム[RFC5322]も使用しているため、多くのユーザーはnetnewsシステム[RFC5536]も使用しているため、Jabber IDを作成したメッセージに関連付けると役立ちます。 Jabber-IDヘッダーフィールドは、その情報の標準的な場所を提供します。"
    },
    {
      "indent": 3,
      "text": "Members of the XMPP instant messaging and presence community have been experimenting with the Jabber-ID header field for many years. This document defines the syntax and usage of the Jabber-ID header field, including the information necessary to register the field in the Provisional Message Header Field Names registry maintained by the IANA.",
      "ja": "XMPPインスタントメッセージングおよびプレゼンスコミュニティのメンバーは、Jabber-IDヘッダーフィールドを長年にわたって実験しています。このドキュメントでは、JANAが保持する暫定メッセージヘッダーフィールド名レジストリにフィールドを登録するために必要な情報を含め、Jabber-IDヘッダーフィールドの構文と使用法を定義します。"
    },
    {
      "indent": 0,
      "text": "2. Syntax",
      "section_title": true,
      "ja": "2. 構文"
    },
    {
      "indent": 3,
      "text": "The syntax of the Jabber-ID header field is defined below using Augmented Backus-Naur Form [RFC5234], where the \"pathxmpp\" rule is defined in the XMPP URI specification [RFC5122] and the remaining rules are defined in the Internet Message Format specification [RFC5322]:",
      "ja": "Jabber-IDヘッダーフィールドの構文は、拡張バッカスナウアフォーム[RFC5234]を使用して以下に定義されています。「pathxmpp」ルールはXMPP URI仕様[RFC5122]で定義され、残りのルールはインターネットメッセージフォーマット仕様で定義されています[RFC5322]："
    },
    {
      "indent": 6,
      "text": "Jabber-ID = SP *WSP pathxmpp *WSP CRLF",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Although a native XMPP address can contain virtually any Unicode character [UNICODE], the header of an email or netnews message is allowed to contain only printable ASCII characters (see Section 2 of [RFC5322]). Therefore, any characters outside the ASCII range [RFC20] in an XMPP address need to be converted to ASCII before inclusion in a Jabber-ID header field, in accordance with the rules defined in the XMPP URI specification [RFC5122]. In addition, characters allowed in XMPP localparts and XMPP resourceparts but disallowed by the relevant URI rules need to be percent-encoded in accordance with the rules defined in the URI specification [RFC3986].",
      "ja": "ネイティブXMPPアドレスには事実上すべてのUnicode文字[UNICODE]を含めることができますが、メールまたはネットニュースメッセージのヘッダーには、印刷可能なASCII文字のみを含めることができます（[RFC5322]のセクション2を参照）。したがって、XMPP URI仕様[RFC5122]で定義されている規則に従って、XMPPアドレスのASCII範囲[RFC20]の外にある文字は、Jabber-IDヘッダーフィールドに含める前にASCIIに変換する必要があります。さらに、XMPPローカルパートとXMPPリソースパートで許可されているが、関連するURIルールでは許可されていない文字は、URI仕様[RFC3986]で定義されているルールに従ってパーセントエンコードする必要があります。"
    },
    {
      "indent": 0,
      "text": "3. Usage",
      "section_title": true,
      "ja": "3. 使用法"
    },
    {
      "indent": 0,
      "text": "3.1. Inclusion",
      "section_title": true,
      "ja": "3.1. 包含"
    },
    {
      "indent": 3,
      "text": "The Jabber-ID header field is associated with the author of the message; see [RFC5322]. If the \"From:\" header field of an email message contains more than one mailbox, it is best not to add the Jabber-ID header field to the message. To reduce the possibility of confusion, it is best to include only one instance of the Jabber-ID header field in a given message.",
      "ja": "Jabber-IDヘッダーフィールドはメッセージの作成者に関連付けられています。 [RFC5322]を参照してください。電子メールメッセージの「From：」ヘッダーフィールドに複数のメールボックスが含まれている場合は、Jabber-IDヘッダーフィールドをメッセージに追加しないことをお勧めします。混乱の可能性を減らすには、特定のメッセージにJabber-IDヘッダーフィールドのインスタンスを1つだけ含めることをお勧めします。"
    },
    {
      "indent": 0,
      "text": "3.2. Generation",
      "section_title": true,
      "ja": "3.2. 世代"
    },
    {
      "indent": 3,
      "text": "For a user whose XMPP address is \"juliet@example.com\", the corresponding Jabber-ID header field would be:",
      "ja": "XMPPアドレスが「juliet@example.com」であるユーザーの場合、対応するJabber-IDヘッダーフィールドは次のようになります。"
    },
    {
      "indent": 6,
      "text": "Jabber-ID: juliet@example.com",
      "ja": "Jabber-ID：juliet@example.com"
    },
    {
      "indent": 3,
      "text": "As noted, non-ASCII characters in XMPP addresses need to be converted into ASCII before inclusion in a Jabber-ID header field. Consider the following XMPP address:",
      "ja": "前述のとおり、XMPPアドレスの非ASCII文字は、Jabber-IDヘッダーフィールドに含める前にASCIIに変換する必要があります。次のXMPPアドレスを検討してください。"
    },
    {
      "indent": 6,
      "text": "ji&#x159;i@&#x10D;echy.example",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": " In the foregoing example, the string \"&#x159;\" stands for the Unicode character LATIN SMALL LETTER R WITH CARON and the string \"&#x10D;\" stands for the Unicode character LATIN SMALL LETTER C WITH CARON, following the \"XML Notation\" used in [RFC3987] to represent characters that cannot be rendered in ASCII-only documents. For those who do not read Czech, this example could be anglicized as \"george@czech-lands.example\".",
      "ja": "前述の例では、文字列「＆＃x159;」 Unicode文字のラテン文字の小文字のRとCARONおよび文字列 \"＆＃x10D;\"を表しますASCII文字のみのドキュメントではレンダリングできない文字を表すために[RFC3987]で使用される「XML表記法」に従い、Unicode文字のラテン小文字Cとキャロンを表します。チェコ語を読まない人のために、この例は \"george@czech-lands.example\"のように英語化できます。"
    },
    {
      "indent": 3,
      "text": "Following the rules in [RFC5122] and the Jabber-ID header field syntax, the resulting header field might be as shown below (note that this representation includes folding white space, which is allowed in accordance with the ABNF):",
      "ja": "[RFC5122]のルールとJabber-IDヘッダーフィールド構文に従うと、結果のヘッダーフィールドは次のようになります（この表現には、ABNFに従って許可されている折りたたみ空白が含まれていることに注意してください）。"
    },
    {
      "indent": 6,
      "text": "Jabber-ID: ji%C5%99i@%C4%8Dechy.example",
      "ja": "Jabber-ID：ji%C5%99i@%C4%8Dechy.example"
    },
    {
      "indent": 0,
      "text": "3.3. Processing",
      "section_title": true,
      "ja": "3.3. 処理"
    },
    {
      "indent": 3,
      "text": "Upon receiving an email message or netnews message containing a Jabber-ID header field, a user agent that supports the field ought to process the field by converting any escaped characters to characters outside the ASCII range in accordance with the rules defined in [RFC5122], thus yielding a Jabber ID that can be used for native communication on the XMPP network.",
      "ja": "Jabber-IDヘッダーフィールドを含む電子メールメッセージまたはnetnewsメッセージを受信すると、このフィールドをサポートするユーザーエージェントは、[RFC5122]で定義されているルールに従って、エスケープ文字をASCII範囲外の文字に変換することによってフィールドを処理する必要があります。したがって、XMPPネットワークでのネイティブ通信に使用できるJabber IDが生成されます。"
    },
    {
      "indent": 0,
      "text": "3.4. Disposition",
      "section_title": true,
      "ja": "3.4. 配置"
    },
    {
      "indent": 3,
      "text": "A user agent that has processed a Jabber-ID header field can provide appropriate interface elements if it has independent information linking the author of the email or netnews message with the specified Jabber ID (e.g., via a user-controlled address book or automated directory lookup). Such interface elements might include an indicator of \"presence\" (i.e., that the author is online and available for communication via XMPP) if the user is subscribed to the presence of the author, and an element that enables the user to send an instant message or initiate a text chat session with the author.",
      "ja": "Jabber-IDヘッダーフィールドを処理したユーザーエージェントは、電子メールまたはnetnewsメッセージの作成者を指定されたJabber IDにリンクする独立した情報を持っている場合（たとえば、ユーザー制御のアドレス帳または自動ディレクトリルックアップを介して）、適切なインターフェース要素を提供できます。 ）。このようなインターフェイス要素には、ユーザーが著者のプレゼンスにサブスクライブしている場合、「プレゼンス」のインジケーター（つまり、著者がオンラインでXMPP経由の通信に利用できること）と、ユーザーがインスタントメッセージを送信できるようにする要素が含まれる場合があります。または、作成者とのテキストチャットセッションを開始します。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The IANA has added \"Jabber-ID\" to the Provisional Message Header Field Names registry. The completed registration template follows.",
      "ja": "IANAは、暫定メッセージヘッダーフィールド名レジストリに「Jabber-ID」を追加しました。完成した登録テンプレートは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Header field name: Jabber-ID",
      "ja": "ヘッダーフィールド名：Jabber-ID"
    },
    {
      "indent": 3,
      "text": "Applicable protocol: mail, netnews",
      "ja": "該当するプロトコル：メール、ネットニュース"
    },
    {
      "indent": 3,
      "text": "Status: provisional",
      "ja": "ステータス：暫定"
    },
    {
      "indent": 0,
      "text": "   Author/Change controller  Peter Saint-Andre <stpeter@jabber.org>\n   Specification document:  RFC 7259",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Related information: See RFC 6120",
      "ja": "関連情報：RFC 6120を参照"
    },
    {
      "indent": 0,
      "text": "5. Security and Privacy Considerations",
      "section_title": true,
      "ja": "5. セキュリティとプライバシーに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Message headers are an existing standard and are designed to easily accommodate new types. Although the Jabber-ID header field could be forged, this problem is inherent in Internet email and netnews. However, because a forged Jabber-ID header field might break automated processing, applications are discouraged from depending on the Jabber-ID header field to indicate the authenticity of an email or netnews message, or the identity of its author or sender. Including the Jabber-ID header field among the signer header fields in DomainKeys Identified Mail (DKIM) can help to mitigate against forging of the header (see [RFC6376]).",
      "ja": "メッセージヘッダーは既存の標準であり、新しいタイプに簡単に対応できるように設計されています。 Jabber-IDヘッダーフィールドは偽造される可能性がありますが、この問題はインターネットメールとネットニュースに固有のものです。ただし、偽造されたJabber-IDヘッダーフィールドは自動処理を中断する可能性があるため、アプリケーションはJabber-IDヘッダーフィールドに依存して電子メールまたはネットニュースメッセージの信頼性、または作成者または送信者のIDを示すことをお勧めしません。 DomainKeys Identified Mail（DKIM）の署名者ヘッダーフィールドにJabber-IDヘッダーフィールドを含めると、ヘッダーの偽造を軽減できます（[RFC6376]を参照）。"
    },
    {
      "indent": 3,
      "text": "Advertising XMPP addresses in email or netnews headers might make it easier for malicious users to harvest XMPP addresses and therefore to send unsolicited bulk communications to the users or applications represented by those addresses. Providing such a binding between an email address and a Jabber ID can also increase the possibility of drawing a connection between different kinds of communications traffic for purposes of surveillance and other breaches of privacy. Care ought to be taken in balancing the benefits of open information exchange against the potential costs of security and privacy weaknesses. An email or netnews user agent that is capable of including the Jabber-ID header field in outgoing email or netnews messages needs to provide an option for its user to disable inclusion of the Jabber-ID header field generally, on a per-recipient basis, and on a per-message basis.",
      "ja": "電子メールまたはネットニュースヘッダーでXMPPアドレスをアドバタイズすると、悪意のあるユーザーがXMPPアドレスを取得しやすくなり、そのため、これらのアドレスで表されるユーザーまたはアプリケーションに迷惑な通信を送信しやすくなります。電子メールアドレスとJabber IDの間にこのようなバインディングを提供すると、監視やその他のプライバシー侵害を目的として、さまざまな種類の通信トラフィック間の接続が確立される可能性も高まります。オープンな情報交換の利点と、セキュリティおよびプライバシーの脆弱性の潜在的なコストとのバランスをとる際には注意が必要です。 Jabber-IDヘッダーフィールドを送信メールまたはnetnewsメッセージに含めることができる電子メールまたはnetnewsユーザーエージェントは、Jabber-IDヘッダーフィールドの包含を受信者ごとに無効にするオプションをユーザーに提供する必要があります。メッセージごとに。"
    },
    {
      "indent": 3,
      "text": "The security and privacy considerations discussed in [RFC3986], [RFC3987], [RFC5122], [RFC6120], and [RFC6121] also apply to the Jabber-ID message header.",
      "ja": "[RFC3986]、[RFC3987]、[RFC5122]、[RFC6120]、および[RFC6121]で説明されているセキュリティとプライバシーの考慮事項は、Jabber-IDメッセージヘッダーにも適用されます。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986] Berners-Lee、T.、Fielding、R。、およびL. Masinter、「Uniform Resource Identifier（URI）：Generic Syntax」、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3987] Duerst, M. and M. Suignard, \"Internationalized Resource Identifiers (IRIs)\", RFC 3987, January 2005.",
      "ja": "[RFC3987] Duerst、M。およびM. Suignard、「Internationalized Resource Identifiers（IRIs）」、RFC 3987、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5122] Saint-Andre, P., \"Internationalized Resource Identifiers (IRIs) and Uniform Resource Identifiers (URIs) for the Extensible Messaging and Presence Protocol (XMPP)\", RFC 5122, February 2008.",
      "ja": "[RFC5122] Saint-Andre、P。、「Extensible Messaging and Presence Protocol（XMPP）の国際化リソース識別子（IRI）およびUniform Resource Identifiers（URIs）」、RFC 5122、2008年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "[RFC5234] Crocker、D。およびP. Overell、「構文仕様の拡張BNF：ABNF」、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5322] Resnick, P., Ed., \"Internet Message Format\", RFC 5322, October 2008.",
      "ja": "[RFC5322] Resnick、P。、編、「インターネットメッセージ形式」、RFC 5322、2008年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6120] Saint-Andre, P., \"Extensible Messaging and Presence Protocol (XMPP): Core\", RFC 6120, March 2011.",
      "ja": "[RFC6120] Saint-Andre、P。、「Extensible Messaging and Presence Protocol（XMPP）：Core」、RFC 6120、2011年3月。"
    },
    {
      "indent": 3,
      "text": "[UNICODE] The Unicode Consortium, \"The Unicode Standard, Version 6.3\", (Mountain View, CA: The Unicode Consortium, 2013. ISBN 978-1-936213-08-5), <http://www.unicode.org/versions/Unicode6.3.0/>.",
      "ja": "[UNICODE] Unicodeコンソーシアム、「The Unicode Standard、Version 6.3」、（Mountain View、CA：The Unicode Consortium、2013。ISBN978-1-936213-08-5）、<http://www.unicode.org /versions/Unicode6.3.0/>。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC20] Cerf, V., \"ASCII format for network interchange\", RFC 20, October 1969.",
      "ja": "[RFC20] Cerf、V。、「ネットワーク交換用のASCII形式」、RFC 20、1969年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5536] Murchison, K., Lindsey, C., and D. Kohn, \"Netnews Article Format\", RFC 5536, November 2009.",
      "ja": "[RFC5536]マーチソン、K。、リンジー、C。、およびD.コーン、「Netnews Article Format」、RFC 5536、2009年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC6121] Saint-Andre, P., \"Extensible Messaging and Presence Protocol (XMPP): Instant Messaging and Presence\", RFC 6121, March 2011.",
      "ja": "[RFC6121] Saint-Andre、P。、「Extensible Messaging and Presence Protocol（XMPP）：Instant Messaging and Presence」、RFC 6121、2011年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC6376] Crocker, D., Hansen, T., and M. Kucherawy, \"DomainKeys Identified Mail (DKIM) Signatures\", RFC 6376, September 2011.",
      "ja": "[RFC6376] Crocker、D.、Hansen、T。、およびM. Kucherawy、「DomainKeys Identified Mail（DKIM）Signatures」、RFC 6376、2011年9月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Acknowledgements",
      "section_title": true,
      "ja": "付録A謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Dave Cridland, Stephen Farrell, Russ Housley, and Alexey Melnikov for their feedback.",
      "ja": "Dave Cridland、Stephen Farrell、Russ Housley、Alexey Melnikovのフィードバックに感謝します。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Peter Saint-Andre &yet",
      "ja": "ピーターサンタンドレ＆まだ"
    },
    {
      "indent": 3,
      "text": "EMail: ietf@stpeter.im",
      "raw": true,
      "ja": ""
    }
  ]
}