{
  "title": {
    "text": "RFC 7112 - Implications of Oversized IPv6 Header Chains",
    "ja": "RFC 7112 - 特大のIPv6ヘッダーチェーンの影響"
  },
  "number": 7112,
  "created_at": "2020-09-04 12:32:50.544001+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           F. Gont\nRequest for Comments: 7112                           Huawei Technologies\nUpdates: 2460                                                  V. Manral\nCategory: Standards Track                                 Ionos Networks\nISSN: 2070-1721                                                R. Bonica\n                                                        Juniper Networks\n                                                            January 2014",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "Implications of Oversized IPv6 Header Chains",
      "ja": "特大のIPv6ヘッダーチェーンの影響"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The IPv6 specification allows IPv6 Header Chains of an arbitrary size. The specification also allows options that can, in turn, extend each of the headers. In those scenarios in which the IPv6 Header Chain or options are unusually long and packets are fragmented, or scenarios in which the fragment size is very small, the First Fragment of a packet may fail to include the entire IPv6 Header Chain. This document discusses the interoperability and security problems of such traffic, and updates RFC 2460 such that the First Fragment of a packet is required to contain the entire IPv6 Header Chain.",
      "ja": "IPv6仕様では、任意のサイズのIPv6ヘッダーチェーンが許可されています。この仕様では、各ヘッダーを拡張できるオプションも許可されています。 IPv6ヘッダーチェーンまたはオプションが異常に長く、パケットがフラグメント化されているシナリオ、またはフラグメントサイズが非常に小さいシナリオでは、パケットの最初のフラグメントにIPv6ヘッダーチェーン全体を含めることができない場合があります。このドキュメントでは、このようなトラフィックの相互運用性とセキュリティの問題について説明し、パケットの最初のフラグメントにIPv6ヘッダーチェーン全体を含める必要があるようにRFC 2460を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはInternet Standards Trackドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。インターネット標準の詳細については、RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7112.",
      "ja": "このドキュメントの現在のステータス、エラッタ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7112で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2014 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Requirements Language ...........................................3\n3. Terminology .....................................................3\n4. Motivation ......................................................4\n5. Updates to RFC 2460 .............................................5\n6. IANA Considerations .............................................5\n7. Security Considerations .........................................6\n8. Acknowledgements ................................................6\n9. References ......................................................7\n   9.1. Normative References .......................................7\n   9.2. Informative References .....................................7",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "With IPv6, optional internet-layer information is carried in one or more IPv6 Extension Headers [RFC2460]. Extension Headers are placed between the IPv6 header and the Upper-Layer Header in a packet. The term \"Header Chain\" refers collectively to the IPv6 header, Extension Headers, and Upper-Layer Header occurring in a packet. In those scenarios in which the IPv6 Header Chain is unusually long and packets are fragmented, or scenarios in which the fragment size is very small, the Header Chain may span multiple fragments.",
      "ja": "IPv6では、オプションのインターネット層情報が1つ以上のIPv6拡張ヘッダー[RFC2460]で運ばれます。拡張ヘッダーは、パケットのIPv6ヘッダーと上位レイヤーヘッダーの間に配置されます。 「ヘッダーチェーン」という用語は、パケット内で発生するIPv6ヘッダー、拡張ヘッダー、および上位レイヤーヘッダーを総称したものです。 IPv6ヘッダーチェーンが異常に長く、パケットがフラグメント化されているシナリオ、またはフラグメントサイズが非常に小さいシナリオでは、ヘッダーチェーンが複数のフラグメントにまたがることがあります。"
    },
    {
      "indent": 3,
      "text": "While IPv4 had a fixed maximum length for the set of all IPv4 options present in a single IPv4 packet, IPv6 does not have any equivalent maximum limit at present. This document updates the set of IPv6 specifications to create an overall limit on the size of the combination of IPv6 options and IPv6 Extension Headers that is allowed in a single IPv6 packet. Namely, it updates RFC 2460 such that the First Fragment of a fragmented datagram is required to contain the entire IPv6 Header Chain.",
      "ja": "IPv4では、単一のIPv4パケットに存在するすべてのIPv4オプションのセットの最大長が固定されていましたが、IPv6には現在、同等の最大長はありません。このドキュメントは、IPv6仕様のセットを更新して、単一のIPv6パケットで許可されるIPv6オプションとIPv6拡張ヘッダーの組み合わせのサイズに全体的な制限を作成します。つまり、IPv6ヘッダーチェーン全体を含めるには、フラグメント化されたデータグラムの最初のフラグメントが必要になるようにRFC 2460を更新します。"
    },
    {
      "indent": 3,
      "text": "It should be noted that this requirement does not preclude the use of large payloads but, instead, merely requires that all headers, starting from the IPv6 base header and continuing up to the Upper-Layer Header (e.g., TCP or the like) be present in the First Fragment.",
      "ja": "この要件は大きなペイロードの使用を排除するものではなく、IPv6ベースヘッダーから始まり、上位レイヤーヘッダー（TCPなど）まで続くすべてのヘッダーが存在することを要求するだけであることに注意してください。最初のフラグメントで。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Language",
      "section_title": true,
      "ja": "2. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3. 用語"
    },
    {
      "indent": 3,
      "text": "For the purposes of this document, the terms Extension Header, IPv6 Header Chain, First Fragment, and Upper-Layer Header are used as follows:",
      "ja": "このドキュメントでは、拡張ヘッダー、IPv6ヘッダーチェーン、最初のフラグメント、および上位レイヤーヘッダーという用語を次のように使用します。"
    },
    {
      "indent": 3,
      "text": "Extension Header:",
      "ja": "拡張ヘッダー："
    },
    {
      "indent": 6,
      "text": "Extension Headers are defined in Section 4 of [RFC2460]. As a result of [RFC7045], [IANA-PROTO] provides a list of assigned Internet Protocol Numbers and designates which of those protocol numbers also represent Extension Headers.",
      "ja": "拡張ヘッダーは、[RFC2460]のセクション4で定義されています。 [RFC7045]の結果として、[IANA-PROTO]は割り当てられたインターネットプロトコル番号のリストを提供し、それらのプロトコル番号のうちどれが拡張ヘッダーも表すかを指定します。"
    },
    {
      "indent": 3,
      "text": "First Fragment:",
      "ja": "最初のフラグメント："
    },
    {
      "indent": 6,
      "text": "An IPv6 fragment with Fragment Offset equal to 0.",
      "ja": "フラグメントオフセットが0のIPv6フラグメント。"
    },
    {
      "indent": 3,
      "text": "IPv6 Header Chain:",
      "ja": "IPv6ヘッダーチェーン："
    },
    {
      "indent": 6,
      "text": "The IPv6 Header Chain contains an initial IPv6 header, zero or more IPv6 Extension Headers, and optionally, a single Upper-Layer Header. If an Upper-Layer Header is present, it terminates the header chain; otherwise, the \"No Next Header\" value (Next Header = 59) terminates it.",
      "ja": "IPv6ヘッダーチェーンには、初期IPv6ヘッダー、0個以上のIPv6拡張ヘッダー、およびオプションで単一の上位層ヘッダーが含まれます。上位ヘッダーが存在する場合は、ヘッダーチェーンを終了します。それ以外の場合は、「次のヘッダーなし」の値（次のヘッダー= 59）で終了します。"
    },
    {
      "indent": 6,
      "text": "The first member of the IPv6 Header Chain is always an IPv6 header. For a subsequent header to qualify as a member of the header chain, it must be referenced by the \"Next Header\" field of the previous member of the header chain. However, if a second IPv6 header appears in the header chain, as is the case when IPv6 is tunneled over IPv6, the second IPv6 header is considered to be an Upper-Layer Header and terminates the header chain. Likewise, if an Encapsulating Security Payload (ESP) header appears in the header chain, it is considered to be an Upper-Layer Header, and it terminates the header chain.",
      "ja": "IPv6ヘッダーチェーンの最初のメンバーは常にIPv6ヘッダーです。後続のヘッダーをヘッダーチェーンのメンバーとして認定するには、ヘッダーチェーンの前のメンバーの[次のヘッダー]フィールドで参照する必要があります。ただし、IPv6がIPv6を介してトンネリングされる場合のように、2番目のIPv6ヘッダーがヘッダーチェーンに表示される場合、2番目のIPv6ヘッダーは上位層ヘッダーと見なされ、ヘッダーチェーンを終了します。同様に、カプセル化セキュリティペイロード（ESP）ヘッダーがヘッダーチェーンに表示される場合、それは上位層ヘッダーと見なされ、ヘッダーチェーンを終了します。"
    },
    {
      "indent": 3,
      "text": "Upper-Layer Header:",
      "ja": "上層ヘッダー："
    },
    {
      "indent": 6,
      "text": "In the general case, the Upper-Layer Header is the first member of the header chain that is neither an IPv6 header nor an IPv6 Extension Header. However, if either an ESP header, or a second IPv6 header occur in the header chain, they are considered to be Upper-Layer Headers, and they terminate the header chain.",
      "ja": "一般的なケースでは、Upper-Layerヘッダーは、IPv6ヘッダーでもIPv6拡張ヘッダーでもないヘッダーチェーンの最初のメンバーです。ただし、ESPヘッダーまたは2番目のIPv6ヘッダーのいずれかがヘッダーチェーンにある場合、それらは上位層ヘッダーと見なされ、ヘッダーチェーンを終了します。"
    },
    {
      "indent": 6,
      "text": "Neither the upper-layer payload, nor any protocol data following the upper-layer payload, is considered to be part of the IPv6 Header Chain. In a simple example, if the Upper-Layer Header is a TCP header, the TCP payload is not part of the IPv6 Header Chain. In a more complex example, if the Upper-Layer Header is an ESP header, neither the payload data, nor any of the fields that follow the payload data in the ESP header are part of the IPv6 Header Chain.",
      "ja": "上位層のペイロードも、上位層のペイロードに続くプロトコルデータも、IPv6ヘッダーチェーンの一部とは見なされません。簡単な例では、Upper-LayerヘッダーがTCPヘッダーの場合、TCPペイロードはIPv6ヘッダーチェーンの一部ではありません。より複雑な例では、Upper-LayerヘッダーがESPヘッダーの場合、ペイロードデータも、ESPヘッダーのペイロードデータに続くフィールドもIPv6ヘッダーチェーンの一部ではありません。"
    },
    {
      "indent": 0,
      "text": "4. Motivation",
      "section_title": true,
      "ja": "4. 動機"
    },
    {
      "indent": 3,
      "text": "Many forwarding devices implement stateless firewalls. A stateless firewall enforces a forwarding policy on a packet-by-packet basis. In order to enforce its forwarding policy, the stateless firewall may need to glean information from both the IPv6 and upper-layer headers.",
      "ja": "多くの転送デバイスは、ステートレスファイアウォールを実装しています。ステートレスファイアウォールは、パケットごとに転送ポリシーを適用します。転送ポリシーを実施するために、ステートレスファイアウォールは、IPv6ヘッダーと上位層ヘッダーの両方から情報を収集する必要がある場合があります。"
    },
    {
      "indent": 3,
      "text": "For example, assume that a stateless firewall discards all traffic received from an interface unless it is destined for a particular TCP port on a particular IPv6 address. When this firewall is presented with a fragmented packet that is destined for a different TCP port, and the entire header chain is contained within the First Fragment, the firewall discards the First Fragment and allows subsequent fragments to pass. Because the First Fragment was discarded, the packet cannot be reassembled at the destination. Insomuch as the packet cannot be reassembled, the forwarding policy is enforced.",
      "ja": "たとえば、ステートレスファイアウォールが、特定のIPv6アドレスの特定のTCPポート宛てでない限り、インターフェイスから受信したすべてのトラフィックを破棄するとします。このファイアウォールに別のTCPポート宛のフラグメント化されたパケットが提示され、ヘッダーチェーン全体が最初のフラグメント内に含まれている場合、ファイアウォールは最初のフラグメントを破棄し、後続のフラグメントの通過を許可します。最初のフラグメントが破棄されたため、パケットは宛先で再構成できません。パケットは再構成できないため、転送ポリシーが適用されます。"
    },
    {
      "indent": 3,
      "text": "However, when the firewall is presented with a fragmented packet and the header chain spans multiple fragments, the First Fragment does not contain enough information for the firewall to enforce its forwarding policy. Lacking sufficient information, the stateless firewall either forwards or discards that fragment. Regardless of the action that it takes, it may fail to enforce its forwarding policy.",
      "ja": "ただし、ファイアウォールにフラグメント化されたパケットがあり、ヘッダーチェーンが複数のフラグメントにまたがっている場合、最初のフラグメントには、ファイアウォールが転送ポリシーを適用するための十分な情報が含まれていません。十分な情報がないため、ステートレスファイアウォールはそのフラグメントを転送または破棄します。実行するアクションに関係なく、転送ポリシーを適用できない場合があります。"
    },
    {
      "indent": 0,
      "text": "5. Updates to RFC 2460",
      "section_title": true,
      "ja": "5. RFC 2460の更新"
    },
    {
      "indent": 3,
      "text": "When a host fragments an IPv6 datagram, it MUST include the entire IPv6 Header Chain in the First Fragment.",
      "ja": "ホストがIPv6データグラムをフラグメント化するとき、最初のフラグメントにIPv6ヘッダーチェーン全体を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "A host that receives a First Fragment that does not satisfy the above-stated requirement SHOULD discard the packet and SHOULD send an ICMPv6 error message to the source address of the offending packet (subject to the rules for ICMPv6 errors specified in [RFC4443]). However, for backwards compatibility, implementations MAY include a configuration option that allows such fragments to be accepted.",
      "ja": "上記の要件を満たさない最初のフラグメントを受信したホストは、パケットを破棄し（SHOULD）、問題のあるパケットの送信元アドレスにICMPv6エラーメッセージを送信する必要があります（[RFC4443]で指定されているICMPv6エラーのルールに従う必要があります）。しかしながら、後方互換性のために、実装はそのようなフラグメントが受け入れられることを可能にする設定オプションを含むかもしれません。"
    },
    {
      "indent": 3,
      "text": "Likewise, an intermediate system (e.g., router or firewall) that receives an IPv6 First Fragment that does not satisfy the above-stated requirement MAY discard that packet, and it MAY send an ICMPv6 error message to the source address of the offending packet (subject to the rules for ICMPv6 error messages specified in [RFC4443]). Intermediate systems having this capability SHOULD support configuration (e.g., enable/disable) of whether or not such packets are dropped by the intermediate system.",
      "ja": "同様に、上記の要件を満たさないIPv6の最初のフラグメントを受信する中間システム（ルーターやファイアウォールなど）は、そのパケットを破棄してもよい（MAY）、ICMPv6エラーメッセージを問題のパケットの送信元アドレス（サブジェクト[RFC4443]で指定されたICMPv6エラーメッセージのルールに準拠）。この機能を持つ中間システムは、そのようなパケットが中間システムによってドロップされるかどうかの構成（たとえば、有効化/無効化）をサポートする必要があります（SHOULD）。"
    },
    {
      "indent": 3,
      "text": "If a host or intermediate system discards a First Fragment because it does not satisfy the above-stated requirement and sends an ICMPv6 error message due to the discard, then the ICMPv6 error message MUST be Type 4 (\"Parameter Problem\") and MUST use Code 3 (\"First Fragment has incomplete IPv6 Header Chain\"). The Pointer field contained by the ICMPv6 Parameter Problem message MUST be set to zero. The format for the ICMPv6 error message is the same regardless of whether a host or intermediate system originates it.",
      "ja": "ホストまたは中間システムが上記の要件を満たさないために最初のフラグメントを破棄し、破棄のためにICMPv6エラーメッセージを送信する場合、ICMPv6エラーメッセージはタイプ4（「パラメーターの問題」）であり、コードを使用する必要があります。 3（「最初のフラグメントには不完全なIPv6ヘッダーチェーンがあります」）。 ICMPv6パラメータ問題メッセージに含まれるポインタフィールドはゼロに設定する必要があります。 ICMPv6エラーメッセージの形式は、ホストシステムまたは中間システムが発信元であるかどうかに関係なく同じです。"
    },
    {
      "indent": 3,
      "text": "As a result of the above-mentioned requirement, a packet's header chain length cannot exceed the Path MTU associated with its destination. Hosts discover the Path MTU using procedures such as those defined in [RFC1981] and [RFC4821]. Hosts that do not discover the Path MTU MUST limit the IPv6 Header Chain length to 1280 bytes. Limiting the IPv6 Header Chain length to 1280 bytes ensures that the header chain length does not exceed the IPv6 minimum MTU [RFC2460].",
      "ja": "上記の要件の結果として、パケットのヘッダーチェーンの長さは、その宛先に関連付けられたパスMTUを超えることはできません。ホストは、[RFC1981]や[RFC4821]で定義されているような手順を使用して、パスMTUを発見します。パスMTUを検出しないホストは、IPv6ヘッダーチェーンの長さを1280バイトに制限する必要があります。 IPv6ヘッダーチェーンの長さを1280バイトに制限すると、ヘッダーチェーンの長さがIPv6の最小MTU [RFC2460]を超えないようになります。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has added the following \"Type 4 - Parameter Problem\" message to the \"Internet Control Message Protocol version 6 (ICMPv6) Parameters\" registry:",
      "ja": "IANAは、「インターネット制御メッセージプロトコルバージョン6（ICMPv6）パラメータ」レジストリに次の「タイプ4-パラメータの問題」メッセージを追加しました。"
    },
    {
      "indent": 6,
      "text": "CODE NAME/DESCRIPTION 3 IPv6 First Fragment has incomplete IPv6 Header Chain",
      "ja": "コード名/説明3 IPv6の最初のフラグメントに不完全なIPv6ヘッダーチェーンがあります"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "No new security exposures or issues are raised by this document. This document describes how undesirably fragmented packets can be leveraged to evade stateless packet filtering. Having made that observation, this document updates [RFC2460] so that undesirably fragmented packets are forbidden. Therefore, a security vulnerability is removed.",
      "ja": "このドキュメントによって、新たな機密漏れや問題は発生しません。このドキュメントでは、フラグメント化された望ましくないパケットを活用して、ステートレスパケットフィルタリングを回避する方法について説明します。その観察を行った上で、このドキュメントは[RFC2460]を更新して、望ましくない断片化されたパケットが禁止されるようにします。したがって、セキュリティの脆弱性が削除されます。"
    },
    {
      "indent": 3,
      "text": "This specification allows nodes that drop the aforementioned packets to signal such packet drops with ICMPv6 \"Parameter Problem, IPv6 First Fragment has incomplete IPv6 header chain\" (Type 4, Code 3) error messages.",
      "ja": "この仕様により、前述のパケットをドロップするノードは、ICMPv6「パラメーターの問題、IPv6の最初のフラグメントに不完全なIPv6ヘッダーチェーンがあります」（タイプ4、コード3）エラーメッセージでそのようなパケットドロップを通知できます。"
    },
    {
      "indent": 3,
      "text": "As with all ICMPv6 error/diagnostic messages, deploying Source Address Forgery Prevention filters helps reduce the chances of an attacker successfully performing a reflection attack by sending forged illegal packets with the victim's/target's IPv6 address as the IPv6 source address of the illegal packet [RFC2827] [RFC3704].",
      "ja": "すべてのICMPv6エラー/診断メッセージと同様に、Source Address Forgery Preventionフィルターを導入すると、攻撃者が不正なパケットのIPv6送信元アドレスとして被害者/ターゲットのIPv6アドレスを使用して偽造された不正パケットを送信することにより、リフレクション攻撃を成功させる可能性を減らすことができます[RFC2827 ] [RFC3704]。"
    },
    {
      "indent": 3,
      "text": "A firewall that performs stateless deep packet inspection (i.e., examines application payload content) might still be unable to correctly process fragmented packets, even if the IPv6 Header Chain is not fragmented.",
      "ja": "ステートレスのディープパケットインスペクションを実行する（つまり、アプリケーションのペイロードコンテンツを検査する）ファイアウォールは、IPv6ヘッダーチェーンがフラグメント化されていなくても、フラグメント化されたパケットを正しく処理できない場合があります。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Ran Atkinson for contributing text and ideas that were incorporated into this document.",
      "ja": "著者は、このドキュメントに組み込まれたテキストとアイデアを提供してくれたRan Atkinsonに感謝します。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank (in alphabetical order) Ran Atkinson, Fred Baker, Stewart Bryant, Brian Carpenter, Benoit Claise, Dominik Elsbroek, Wes George, Mike Heard, Bill Jouris, Suresh Krishnan, Dave Thaler, Ole Troan, Eric Vyncke, and Peter Yee, for providing valuable comments on earlier versions of this document.",
      "ja": "著者は（アルファベット順で）ランアトキンソン、フレッドベイカー、スチュワートブライアント、ブライアンカーペンター、ブノワクレイズ、ドミニクエルスブローク、ウェスジョージ、マイクハード、ビルジュリス、スレーシュクリシュナン、デイブターラー、オレトローン、エリックヴィンケ、このドキュメントの以前のバージョンについて貴重なコメントを提供してくれたPeter Yee。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC1981] McCann, J., Deering, S., and J. Mogul, \"Path MTU Discovery for IP version 6\", RFC 1981, August 1996.",
      "ja": "[RFC1981] McCann、J.、Deering、S。、およびJ. Mogul、「IPバージョン6のパスMTUディスカバリ」、RFC 1981、1996年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[RFC2460] Deering、S。およびR. Hinden、「インターネットプロトコル、バージョン6（IPv6）仕様」、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC4443] Conta, A., Deering, S., and M. Gupta, \"Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6) Specification\", RFC 4443, March 2006.",
      "ja": "[RFC4443]コンタ、A。、ディアリング、S。、およびM.グプタ、「インターネットプロトコルバージョン6（IPv6）仕様のインターネットコントロールメッセージプロトコル（ICMPv6）」、RFC 4443、2006年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4821] Mathis, M. and J. Heffner, \"Packetization Layer Path MTU Discovery\", RFC 4821, March 2007.",
      "ja": "[RFC4821] Mathis、M。およびJ. Heffner、「Packetization Layer Path MTU Discovery」、RFC 4821、2007年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC7045] Carpenter, B. and S. Jiang, \"Transmission and Processing of IPv6 Extension Headers\", RFC 7045, December 2013.",
      "ja": "[RFC7045] Carpenter、B。およびS. Jiang、「IPv6拡張ヘッダーの送信と処理」、RFC 7045、2013年12月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC2827] Ferguson, P. and D. Senie, \"Network Ingress Filtering: Defeating Denial of Service Attacks which employ IP Source Address Spoofing\", BCP 38, RFC 2827, May 2000.",
      "ja": "[RFC2827]ファーガソン、P。およびD.セニー、「ネットワーク入力フィルタリング：IP送信元アドレスのスプーフィングを利用するサービス拒否攻撃の阻止」、BCP 38、RFC 2827、2000年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3704] Baker, F. and P. Savola, \"Ingress Filtering for Multihomed Networks\", BCP 84, RFC 3704, March 2004.",
      "ja": "[RFC3704]ベイカー、F。、およびP.サボラ、「マルチホームネットワークの入力フィルタリング」、BCP 84、RFC 3704、2004年3月。"
    },
    {
      "indent": 3,
      "text": "[IANA-PROTO] Internet Assigned Numbers Authority, \"Protocol Numbers\", <http://www.iana.org/assignments/protocol-numbers>.",
      "ja": "[IANA-PROTO] Internet Assigned Numbers Authority、「Protocol Numbers」、<http://www.iana.org/assignments/protocol-numbers>。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Fernando Gont Huawei Technologies Evaristo Carriego 2644 Haedo, Provincia de Buenos Aires 1706 Argentina",
      "ja": "Fernando Gont Huawei Technologies Evaristo Carriego 2644ブエノスアイレス州ハエド1706アルゼンチン"
    },
    {
      "indent": 3,
      "text": "Phone: +54 11 4650 8472\nEMail: fgont@si6networks.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Vishwas Manral Ionos Networks Sunnyvale, CA 94089 US",
      "ja": "Biswas Muralonos Networks Sunnyvale、CA 94089 US"
    },
    {
      "indent": 3,
      "text": "Phone: 408-447-1497 EMail: vishwas@ionosnetworks.com",
      "ja": "電話：408-447-1497メール：vishwas@ionosnetworks.com"
    },
    {
      "indent": 3,
      "text": "Ronald P. Bonica Juniper Networks 2251 Corporate Park Drive Herndon, VA 20171 US",
      "ja": "ロナルドP.ボニカジュニパーネットワークス2251コーポレートパークドライブハーンドン、バージニア州20171米国"
    },
    {
      "indent": 3,
      "text": "Phone: 571 250 5819 EMail: rbonica@juniper.net",
      "ja": "電話：571 250 5819メール：rbonica@juniper.net"
    }
  ]
}