{
  "title": {
    "text": "RFC 7579 - General Network Element Constraint Encoding for GMPLS-Controlled Networks",
    "ja": "RFC 7579 - GMPLS制御されたネットワークのための一般的なネットワーク要素制約エンコーディング"
  },
  "number": 7579,
  "created_at": "2019-10-30 17:09:12.677515+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                 G. Bernstein, Ed.\nRequest for Comments: 7579                             Grotto Networking\nCategory: Standards Track                                    Y. Lee, Ed.\nISSN: 2070-1721                                                    D. Li\n                                                                  Huawei\n                                                              W. Imajuku\n                                                                     NTT\n                                                                  J. Han\n                                                                  Huawei\n                                                               June 2015",
      "raw": true
    },
    {
      "indent": 14,
      "text": "General Network Element Constraint Encoding\n       for GMPLS-Controlled Networks",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Generalized Multiprotocol Label Switching (GMPLS) can be used to control a wide variety of technologies. In some of these technologies, network elements and links may impose additional routing constraints such as asymmetric switch connectivity, non-local label assignment, and label range limitations on links.",
      "ja": "一般マルチプロトコルラベルスイッチング（GMPLS）は、多種多様な技術を制御するために使用することができます。これらの技術のいくつかでは、ネットワーク要素とリンクは、非対称スイッチ接続、非ローカルラベルの割り当て、およびリンク上のラベル範囲の制限として追加のルーティング制約を課すことができます。"
    },
    {
      "indent": 3,
      "text": "This document provides efficient, protocol-agnostic encodings for general information elements representing connectivity and label constraints as well as label availability. It is intended that protocol-specific documents will reference this memo to describe how information is carried for specific uses.",
      "ja": "この文書では、接続性とラベル制約ならびにラベルの使用可否を表す一般的な情報要素のための効率的な、プロトコルに依存しない符号化を提供します。プロトコル固有の文書は情報は、特定の用途のために実施される方法を説明するために、このメモを参照することを意図しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7579.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7579で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Node Switching Asymmetry Constraints .......................3\n   1.2. Non-local Label Assignment Constraints .....................4\n   1.3. Conventions Used in This Document ..........................4\n2. Encoding ........................................................4\n   2.1. Connectivity Matrix Field ..................................5\n   2.2. Port Label Restrictions Field ..............................6\n        2.2.1. SIMPLE_LABEL ........................................8\n        2.2.2. CHANNEL_COUNT .......................................8\n        2.2.3. LABEL_RANGE .........................................9\n        2.2.4. SIMPLE_LABEL & CHANNEL_COUNT ........................9\n        2.2.5. LINK_LABEL_EXCLUSIVITY .............................10\n   2.3. Link Set Field ............................................10\n   2.4. Available Labels Field ....................................12\n   2.5. Shared Backup Labels Field ................................13\n   2.6. Label Set Field ...........................................14\n3. Security Considerations ........................................16\n4. IANA Considerations ............................................17\n5. References .....................................................17\n   5.1. Normative References ......................................17\n   5.2. Informative References ....................................18\nAppendix A. Encoding Examples .....................................19\n   A.1. Link Set Field ............................................19\n   A.2. Label Set Field ...........................................19\n   A.3. Connectivity Matrix .......................................20\n   A.4. Connectivity Matrix with Bidirectional Symmetry ...........24\n   A.5. Priority Flags in Available/Shared Backup Labels ..........26\nContributors ......................................................27\nAuthors' Addresses ................................................28",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Some data-plane technologies that wish to make use of a GMPLS control plane contain additional constraints on switching capability and label assignment. In addition, some of these technologies must perform non-local label assignment based on the nature of the technology, e.g., wavelength continuity constraint in Wavelength Switched Optical Networks (WSONs) [RFC6163]. Such constraints can lead to the requirement for link-by-link label availability in path computation and label assignment.",
      "ja": "GMPLS制御プレーンを使用することを希望する一部のデータ・プレーン技術は能力とラベルの割り当てを切り替えるに追加の制約が含まれています。また、これらの技術のいくつかは、技術の性質に基づいて非ローカルラベル割り当てを実行する必要があり、例えば、波長の波長連続性制約は、光ネットワーク（WSONs）[RFC6163]を交換しました。このような制約は、経路計算及びラベル割り当て内のリンク・バイ・リンクラベルの可用性の要件につながることができます。"
    },
    {
      "indent": 3,
      "text": "This document provides efficient encodings of information needed by the routing and label assignment process in technologies such as WSON and are potentially applicable to a wider range of technologies. Such encodings can be used to extend GMPLS signaling and routing protocols. In addition, these encodings could be used by other mechanisms to convey this same information to a path computation element (PCE).",
      "ja": "この文書は、WSONなどの技術にルーティングラベル割り当てプロセスが必要とする情報の効率的な符号化を提供し、潜在的に技術の広い範囲に適用可能です。そのようなエンコーディングは、GMPLSシグナリングおよびルーティングプロトコルを拡張するために使用することができます。加えて、これらのエンコーディングは、経路計算エレメント（PCE）にこの同じ情報を伝達するために他の機構によって使用することができます。"
    },
    {
      "indent": 0,
      "text": "1.1. Node Switching Asymmetry Constraints",
      "section_title": true,
      "ja": "1.1。ノードスイッチング非対称性の制約"
    },
    {
      "indent": 3,
      "text": "For some network elements, the ability of a signal or packet on a particular input port to reach a particular output port may be limited. Additionally, in some network elements (e.g., a simple multiplexer), the connectivity between some input and output ports may be fixed. To take into account such constraints during path computation, we model this aspect of a network element via a connectivity matrix.",
      "ja": "いくつかのネットワーク要素について、特定の出力ポートに到達する特定の入力ポートに信号またはパケットの能力が制限されてもよいです。さらに、いくつかのネットワーク要素（例えば、単純なマルチプレクサ）に、いくつかの入力ポートと出力ポートとの間の接続が固定されていてもよいです。経路計算の際に考慮ような制約を考慮に入れるために、我々は、接続性マトリックスを介してネットワーク要素のこの側面をモデル化します。"
    },
    {
      "indent": 3,
      "text": "The connectivity matrix (ConnectivityMatrix) represents either the potential connectivity matrix for asymmetric switches or fixed connectivity for an asymmetric device such as a multiplexer. Note that this matrix does not represent any particular internal blocking behavior but indicates which input ports and labels (e.g., wavelengths) could possibly be connected to a particular output port and label pair. Representing internal state-dependent blocking for a node is beyond the scope of this document and, due to its highly implementation-dependent nature, would most likely not be subject to standardization in the future. The connectivity matrix is a conceptual M*m by N*n matrix where M represents the number of input ports (each with m labels) and N the number of output ports (each with n labels).",
      "ja": "連結性行列（ConnectivityMatrix）は、非対称スイッチまたはマルチプレクサのような非対称デバイス用の固定接続のための潜在的な接続性マトリックスのいずれかを表します。このマトリックスは、任意の特定の内部ブロックの動作を表すが、入力ポートとラベル（例えば、波長）は、おそらく特定の出力ポートとラベル対に接続することができるかを示すものではありません。ノードのための内部状態依存ブロッキングを表現することは、その高度実装依存性のために、このドキュメントの範囲を超えて、最も可能性の高い将来の標準化の対象ではありません。連結性行列は、Mは、（Mラベル各）入力ポートの数を表し、N * nの行列による概念のM * mとN個の出力ポートの数（n個のラベルを有する各）です。"
    },
    {
      "indent": 0,
      "text": "1.2. Non-local Label Assignment Constraints",
      "section_title": true,
      "ja": "1.2。非ローカルラベル割り当ての制約"
    },
    {
      "indent": 3,
      "text": "If the nature of the equipment involved in a network results in a requirement for non-local label assignment, we can have constraints based on limits imposed by the ports themselves and those that are implied by the current label usage. Note that constraints such as these only become important when label assignment has a non-local character. For example, in MPLS, an LSR may have a limited range of labels available for use on an output port and a set of labels already in use on that port; these are therefore unavailable for use. This information, however, does not need to be shared unless there is some limitation on the LSR's label swapping ability. For example, if a Time Division Multiplexer (TDM) node lacks the ability to perform time-slot interchange or a WSON lacks the ability to perform wavelength conversion, then the label assignment process is not local to a single node. In this case, it may be advantageous to share the label assignment constraint information for use in path computation.",
      "ja": "非ローカルラベル割り当てのための要件でネットワークの結果に関係する機器の性質た場合、我々は現在のラベルの使用によって暗示されているポート自身とそれらによって課される制限に基づいて制約を持つことができます。ラベルの割り当てが非ローカルの文字を持っていたときにこのような制約が重要なだけになることに注意してください。例えば、MPLSに、LSRは、出力ポートと、そのポート上ですでに使用中のラベルのセットに使用可能なラベルの限られた範囲を有していてもよいです。これらは、そのための使用のため使用できません。この情報は、しかし、LSRのラベルスワッピング能力にいくつかの制限がある場合を除き、共有する必要はありません。時分割マルチプレクサ（TDM）ノードがタイムスロット交換を実行する能力を欠いているか、WSON波長変換を実行する能力を欠いている場合、例えば、このラベル割り当てプロセスは、単一のノードにローカルではありません。この場合、経路計算に使用するためのラベル割り当て制約情報を共有することが有利であり得ます。"
    },
    {
      "indent": 3,
      "text": "Port label restrictions (PortLabelRestriction) model the label restrictions that the network element (node) and link may impose on a port. These restrictions tell us what labels may or may not be used on a link and are intended to be relatively static. More dynamic information is contained in the information on available labels. Port label restrictions are specified relative to the port in general or to a specific connectivity matrix for increased modeling flexibility. [Switch] gives an example where both switch and fixed connectivity matrices are used and both types of constraints occur on the same port.",
      "ja": "ポートラベルの制限（PortLabelRestriction）ネットワーク要素（ノード）とリンクがポートに課すことができるラベルの制約をモデル化します。これらの制限はどのようなラベルやリンク上で使用してもしなくてもよいし、比較的静的であることを意図している私達に告げます。よりダイナミックな情報が入手できるラベルの情報に含まれています。ポートラベルの制限は、一般的にまたは増加モデリングの柔軟性のための具体的な接続性マトリックスにポートに対して指定されています。 [スイッチ]スイッチと固定接続行列が使用され、制約の両方のタイプの両方が同じポートで発生例を示します。"
    },
    {
      "indent": 0,
      "text": "1.3. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.3。このドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Encoding",
      "section_title": true,
      "ja": "2.エンコーディング"
    },
    {
      "indent": 3,
      "text": "This section provides encodings for the information elements defined in [RFC7446] that have applicability to WSON. The encodings are designed to be suitable for use in the GMPLS routing protocols OSPF [RFC4203] and IS-IS [RFC5307] and in the PCE Communication Protocol (PCEP) [RFC5440]. Note that the information distributed in [RFC4203] and [RFC5307] is arranged via the nesting of sub-TLVs within TLVs; this document defines elements to be used within such constructs. Specific constructs of sub-TLVs and the nesting of sub-TLVs of the information element defined by this document will be defined in the respective protocol enhancement documents.",
      "ja": "このセクションでは、WSONに適用性を有する、[RFC7446]で定義された情報要素の符号化を提供します。エンコーディングは、GMPLSルーティングプロトコルOSPF [RFC4203]での使用に適するように設計されており、IS IS [RFC5307]及びPCE通信プロトコル（PCEP）[RFC5440]にしています。 [RFC4203]及び[RFC5307]に配信された情報をTLVの内のサブのTLVのネスティングを介して配置されていることに留意されたいです。この文書は、そのような構築物内で使用するための要素を定義します。特定のサブのTLVの構築物および本文書によって定義される情報要素の下位のTLVのネストは、各プロトコルの拡張文書で定義されます。"
    },
    {
      "indent": 0,
      "text": "2.1. Connectivity Matrix Field",
      "section_title": true,
      "ja": "2.1。接続性マトリックスフィールド"
    },
    {
      "indent": 3,
      "text": "The Connectivity Matrix Field represents how input ports are connected to output ports for network elements. The switch and fixed connectivity matrices can be compactly represented in terms of a minimal list of input and output port set pairs that have mutual connectivity. As described in [Switch], such a minimal list representation leads naturally to a graph representation for path computation purposes; this representation involves the fewest additional nodes and links.",
      "ja": "接続マトリクスフィールドは、ネットワーク要素の出力ポートに接続されている方法の入力ポートを表します。スイッチと固定接続行列をコンパクト入出力ポートの最小のリストで表現することができる相互接続がペアを設定します。 [スイッチ]に記載されているように、そのような最小のリスト表現は、経路計算の目的のためのグラフ表現に自然につながります。この表現は、最少の追加ノードとリンクが含まれます。"
    },
    {
      "indent": 3,
      "text": "The Connectivity Matrix Field is uniquely identified only by the advertising node. There may be more than one Connectivity Matrix Field associated with a node as a node can partition the switch matrix into several sub-matrices. This partitioning is primarily to limit the size of any individual information element used to represent the matrix and to enable incremental updates. When the matrix is partitioned into sub-matrices, each sub-matrix will be mutually exclusive to one another in representing which ports/labels are associated with each sub-matrix. This implies that two matrices will not have the same {src port, src label, dst port, dst label}.",
      "ja": "接続マトリックスフィールドを一意にのみ広告ノードによって識別されます。ノードがいくつかのサブマトリックスにスイッチマトリクスを分割することができるように、ノードに関連付けられた複数の接続マトリックスフィールドがあってもよいです。この分割は行列を表すために増分更新を有効にするために使用される任意の個々の情報要素のサイズを制限する主です。マトリックスをサブマトリックスに分割される場合、各サブマトリクスは、各サブ行列に関連付けられているポート/ラベル表現で互いに相互に排他的であろう。これは、二つの行列が同じ{SRCポート、SRCラベル、DSTポート、DSTのラベルを}持っていないことを意味します。"
    },
    {
      "indent": 3,
      "text": "Each sub-matrix is identified via a different Matrix ID that MUST represent a unique combination of {src port, src label, dst port, dst label}.",
      "ja": "各サブ行列を、{SRCポート、SRCラベル、DSTポート、DSTラベル}のユニークな組み合わせを表現しなければなりません異なるマトリックスIDによって識別されます。"
    },
    {
      "indent": 3,
      "text": "A TLV encoding of this list of link set pairs is:",
      "ja": "リンクセットのペアのリストのTLVエンコーディングは次のとおりです。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Conn  |   MatrixID    |            Reserved                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Link Set A #1                         |\n:                               :                               :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Link Set B #1                         :\n:                               :                               :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Additional Link Set Pairs as Needed           |\n:                     to Specify Connectivity                   :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Where:",
      "ja": "どこ："
    },
    {
      "indent": 3,
      "text": "Connectivity (Conn) (4 bits) is the device type.",
      "ja": "コネクタ（コネチカット）（4ビット）デバイスタイプです。"
    },
    {
      "indent": 6,
      "text": "0 - the device is fixed",
      "ja": "0  - デバイスは固定され"
    },
    {
      "indent": 6,
      "text": "1 - the device is switched (e.g., Reconfigurable Optical Add/Drop Multiplexer / Optical Cross-Connect (ROADM/OXC))",
      "ja": "1  - デバイスが切り替えられる（例えば、再構成可能な光アド/ドロップマルチプレクサ/光クロスコネクト（ROADM / OXC））"
    },
    {
      "indent": 3,
      "text": "MatrixID represents the ID of the connectivity matrix and is an 8-bit integer. The value of 0xFF is reserved for use with port label constraints and should not be used to identify a connectivity matrix.",
      "ja": "MatrixIDは、接続マトリックスのIDを表し、8ビットの整数です。値0xFFは、ポートラベル制約で使用するために予約されており、接続行列を識別するために使用すべきではありません。"
    },
    {
      "indent": 3,
      "text": "Link Set A #1 and Link Set B #1 together represent a pair of link sets. See Section 2.3 for a detailed description of the Link Set Field. There are two permitted combinations for the Link Set Field parameter \"dir\" for link set A and B pairs:",
      "ja": "一緒に＃1及びリンクセットB＃1を設定し、リンクは、リンクセットの対を表します。リンクセットのフィールドの詳細については、2.3節を参照してください。リンク集合AとBのペアのためのリンクセットのフィールドパラメータ「DIR」には2つの許可の組み合わせがあります。"
    },
    {
      "indent": 3,
      "text": "o Link Set A dir=input, Link Set B dir=output",
      "ja": "OリンクセットDIR =入力、リンクセットBのDIR =出力"
    },
    {
      "indent": 6,
      "text": "In this case, the meaning of the pair of link sets A and B is that any signal that inputs a link in set A can be potentially switched out of an output link in set B.",
      "ja": "この場合には、リンクの対の意味は、A及びBは、集合A内のリンクを入力する任意の信号は、潜在的に集合Bの出力リンクから切り替えることができるということである設定します"
    },
    {
      "indent": 3,
      "text": "o Link Set A dir=bidirectional, Link Set B dir=bidirectional",
      "ja": "OリンクセットDIR =双方向、リンクセットBのDIR =双方向"
    },
    {
      "indent": 6,
      "text": "In this case, the meaning of the pair of link sets A and B is that any signal that inputs on the links in set A can potentially output on a link in set B and any input signal on the links in set B can potentially output on a link in set A. If link set A is an input and link set B is an output for a signal, then it implies that link set A is an output and link set B is an input for that signal.",
      "ja": "この場合には、リンクの対の意味は、Aを設定し、Bはであることができ、セットBのリンクにセットB内のリンクと任意の入力信号に対して、潜在的に出力することができ、潜在的に出力にセットA内のリンクに入力する任意のシグナルリンクセットAが入力され、リンクセットBの場合集合A内のリンクは、それがリンクセットAを出力し、リンクセットBは、その信号の入力であることを意味し、信号の出力です。"
    },
    {
      "indent": 3,
      "text": "See Appendix A for both types of encodings as applied to a ROADM example.",
      "ja": "ROADMの例に適用されるエンコーディングの両方のタイプについては、付録Aを参照してください。"
    },
    {
      "indent": 0,
      "text": "2.2. Port Label Restrictions Field",
      "section_title": true,
      "ja": "2.2。ポートラベルの制限フィールド"
    },
    {
      "indent": 3,
      "text": "The Port Label Restrictions Field tells us what labels may or may not be used on a link.",
      "ja": "ポートラベルの制限フィールドまたはリンク上で使用してもしなくてもよいものを、ラベルを教えてくれる。"
    },
    {
      "indent": 3,
      "text": "The port label restrictions can be encoded as follows. More than one of these fields may be needed to fully specify a complex port constraint. When more than one of these fields is present, the resulting restriction is the union of the restrictions expressed in each field. The use of the reserved value of 0xFF for the MatrixID indicates that a restriction applies to the port and not to a specific connectivity matrix.",
      "ja": "次のようにポートラベルの制限をコード化することができます。これらのフィールドの複数が完全に複雑なポートの制約を指定することが必要になる場合があります。これらのフィールドの2つ以上が存在する場合には、得られた制限は、各フィールドにおいて発現制約の和集合です。 MatrixIDため0xFFでの予約値を使用することは、制限はポートにではなく、特定の接続性マトリックスに適用されることを示しています。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   MatrixID    |    RstType    | Switching Cap |     Encoding  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Additional Restriction Parameters per Restriction Type    |\n:                                                               :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Where:",
      "ja": "どこ："
    },
    {
      "indent": 3,
      "text": "MatrixID: either is the value in the corresponding Connectivity Matrix Field or takes the value 0xFF to indicate the restriction applies to the port regardless of any connectivity matrix.",
      "ja": "MatrixID：対応するコネクタマトリックスフィールドの値であるか、または制限に関係なく、任意の接続性マトリックスのポートに適用される示す値は0xFFをとるのいずれか。"
    },
    {
      "indent": 3,
      "text": "RstType (Restriction Type) can take the following values and meanings:",
      "ja": "RSTTYPE（制限のタイプ）は、以下の値と意味を取ることができます。"
    },
    {
      "indent": 6,
      "text": "0: SIMPLE_LABEL (Simple label selective restriction). See Section 2.2.1 for details.",
      "ja": "0：SIMPLE_LABEL（簡易ラベル選択的制限）。詳細については、2.2.1項を参照してください。"
    },
    {
      "indent": 6,
      "text": "1: CHANNEL_COUNT (Channel count restriction). See Section 2.2.2 for details.",
      "ja": "1：CHANNEL_COUNT（チャンネル数制限）。詳細については、2.2.2項を参照してください。"
    },
    {
      "indent": 6,
      "text": "2: LABEL_RANGE (Label range device with a movable center label and width). See Section 2.2.3 for details.",
      "ja": "2：LABEL_RANGE（可動中心ラベルと幅を有するラベル範囲装置）。詳細については、セクション2.2.3を参照してください。"
    },
    {
      "indent": 6,
      "text": "3: SIMPLE_LABEL & CHANNEL_COUNT (Combination of SIMPLE_LABEL and CHANNEL_COUNT restriction. The accompanying label set and channel count indicate labels permitted on the port and the maximum number of channels that can be simultaneously used on the port). See Section 2.2.4 for details.",
      "ja": "3：SIMPLE_LABEL＆CHANNEL_COUNT（SIMPLE_LABELとCHANNEL_COUNT制限の組合せに伴うラベルセットとチャネル・カウントポートで許可ラベルと同時にポートで使用することができるチャネルの最大数を示します。）。詳細については、2.2.4項を参照してください。"
    },
    {
      "indent": 6,
      "text": "4: LINK_LABEL_EXCLUSIVITY (A label may be used at most once amongst a set of specified ports). See Section 2.2.5 for details.",
      "ja": "4：LINK_LABEL_EXCLUSIVITY（ラベルが指定されたポートのセットの中で最大1回使用されてもよいです）。詳細については、セクション2.2.5を参照してください。"
    },
    {
      "indent": 3,
      "text": "Switching Cap (Switching Capability) is defined in [RFC4203], and LSP Encoding Type is defined in [RFC3471]. The combination of these fields defines the type of labels used in specifying the port label restrictions as well as the interface type to which these restrictions apply.",
      "ja": "キャップ（スイッチング能力）の切り替えは[RFC4203]で定義されており、LSP符号化タイプは、[RFC3471]で定義されています。これらのフィールドの組み合わせは、ポートラベルの制限、並びにこれらの制限が適用されるインタフェースタイプを指定する際に使用されるラベルの種類を定義します。"
    },
    {
      "indent": 3,
      "text": "The Additional Restriction Parameters per RestrictionType field is an optional field that describes additional restriction parameters for each RestrictionType pertaining to specific protocols.",
      "ja": "RestrictionTypeフィールドごとに追加の制限パラメータは、特定のプロトコルに関連する各RestrictionTypeのために追加の制限パラメータを説明オプションのフィールドです。"
    },
    {
      "indent": 0,
      "text": "2.2.1. SIMPLE_LABEL",
      "section_title": true,
      "ja": "2.2.1。 SIMPLE_LABEL"
    },
    {
      "indent": 3,
      "text": "In the case of SIMPLE_LABEL, the format is:",
      "ja": "SIMPLE_LABELの場合、フォーマットは次のとおりです。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| MatrixID      | RstType = 0   | Switching Cap |   Encoding    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           Label Set Field                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In this case, the accompanying label set indicates the labels permitted on the port/matrix.",
      "ja": "この場合には、添付のラベルセットは、ポート/マトリックス上許容ラベルを示しています。"
    },
    {
      "indent": 3,
      "text": "See Section 2.6 for the definition of label set.",
      "ja": "ラベルセットの定義については、2.6節を参照してください。"
    },
    {
      "indent": 0,
      "text": "2.2.2. CHANNEL_COUNT",
      "section_title": true,
      "ja": "2.2.2。 CHANNEL_COUNT"
    },
    {
      "indent": 3,
      "text": "In the case of CHANNEL_COUNT, the format is:",
      "ja": "CHANNEL_COUNTの場合、フォーマットは次のとおりです。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| MatrixID      | RstType = 1   |Switching Cap  |   Encoding    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        MaxNumChannels                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In this case, the accompanying MaxNumChannels indicates the maximum number of channels (labels) that can be simultaneously used on the port/matrix.",
      "ja": "この場合、添付MaxNumChannels同時にポート/マトリックス上で使用可能なチャンネル（ラベル）の最大数を示します。"
    },
    {
      "indent": 3,
      "text": "MaxNumChannels is a 32-bit integer.",
      "ja": "MaxNumChannelsは、32ビット整数です。"
    },
    {
      "indent": 0,
      "text": "2.2.3. LABEL_RANGE",
      "section_title": true,
      "ja": "2.2.3。 LABEL_RANGE"
    },
    {
      "indent": 3,
      "text": "In the case of LABEL_RANGE, the format is:",
      "ja": "LABEL_RANGEの場合、フォーマットは次のとおりです。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| MatrixID      | RstType = 2   | Switching Cap |  Encoding     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          MaxLabelRange                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Label Set Field                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This is a generalization of the waveband device. The MaxLabelRange indicates the maximum width of the waveband in terms of the channels spacing given in the Label Set Field. The corresponding label set is used to indicate the overall tuning range.",
      "ja": "これは、波長帯デバイスの一般化です。 MaxLabelRangeは、ラベルフィールド設定で与えられたチャンネル間隔の点では波長帯の最大幅を示しています。対応するラベルのセットは、全体的な同調範囲を示すために使用されます。"
    },
    {
      "indent": 3,
      "text": "MaxLabelRange is a 32-bit integer.",
      "ja": "MaxLabelRangeは、32ビット整数です。"
    },
    {
      "indent": 3,
      "text": "See Section 2.6.2 for an explanation of label range.",
      "ja": "ラベル範囲の説明については、セクション2.6.2を参照してください。"
    },
    {
      "indent": 0,
      "text": "2.2.4. SIMPLE_LABEL & CHANNEL_COUNT",
      "section_title": true,
      "ja": "2.2.4。 SIMPLE_LABEL＆CHANNEL_COUNT"
    },
    {
      "indent": 3,
      "text": "In the case of SIMPLE_LABEL & CHANNEL_COUNT, the format is:",
      "ja": "SIMPLE_LABEL＆CHANNEL_COUNTの場合、フォーマットは次のとおりです。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| MatrixID      | RstType = 3   | Switching Cap |   Encoding    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        MaxNumChannels                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Label Set Field                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In this case, the accompanying label set and MaxNumChannels indicate labels permitted on the port and the maximum number of labels that can be simultaneously used on the port.",
      "ja": "この場合には、添付のラベルセットとMaxNumChannelsポートと同時にポートで使用できる標識の最大数で許可ラベルを示します。"
    },
    {
      "indent": 3,
      "text": "See Section 2.6 for the definition of label set.",
      "ja": "ラベルセットの定義については、2.6節を参照してください。"
    },
    {
      "indent": 0,
      "text": "2.2.5. LINK_LABEL_EXCLUSIVITY",
      "section_title": true,
      "ja": "2.2.5。 LINK_LABEL_EXCLUSIVITY"
    },
    {
      "indent": 3,
      "text": "In the case of Link Label Exclusivity, the format is:",
      "ja": "リンクラベル排他の場合、形式は次のとおりです。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| MatrixID      | RstType = 4   | Switching Cap |   Encoding    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Link Set Field                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In this case, the accompanying link set indicates that a label may be used at most once among the ports in the Link Set Field.",
      "ja": "この場合は、添付リンクセットは、ラベルがリンクセットのフィールド内のポート間で、最高1回使用することができることを示しています。"
    },
    {
      "indent": 3,
      "text": "See Section 2.3 for the definition of link set.",
      "ja": "リンクセットの定義については、セクション2.3を参照してください。"
    },
    {
      "indent": 0,
      "text": "2.3. Link Set Field",
      "section_title": true,
      "ja": "2.3。リンクセットのフィールド"
    },
    {
      "indent": 3,
      "text": "We will frequently need to describe properties of groups of links. To do so efficiently, we can make use of a link set concept similar to the label set concept of [RFC3471]. The Link Set Field is used in the <ConnectivityMatrix>, which is defined in Section 2.1. The information carried in a link set is defined as follows:",
      "ja": "私たちはしばしば、リンクのグループのプロパティを記述する必要があります。その効率的に行うために、我々は[RFC3471]のラベルセットの概念に似リンクセットの概念を利用することができます。リンクセットのフィールドはセクション2.1で定義されている、<ConnectivityMatrix>で使用されています。次のようにリンクセットに運ばれた情報が定義されています。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Action     |Dir|  Format   |         Length                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Link Identifier 1                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n:                               :                               :\n:                               :                               :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Link Identifier N                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Action: 8 bits",
      "ja": "アクション：8ビット"
    },
    {
      "indent": 6,
      "text": "0 - Inclusive List",
      "ja": "0  - インクルーシブ一覧"
    },
    {
      "indent": 10,
      "text": "Indicates that one or more link identifiers are included in\nthe link set.  Each identifies a separate link that is part of\nthe set.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "1 - Inclusive Range",
      "ja": "1  - 包含範囲"
    },
    {
      "indent": 10,
      "text": "Indicates that the link set defines a range of links.  It\ncontains two link identifiers.  The first identifier indicates\nthe start of the range.  The second identifier indicates the\nend of the range.  All links with numeric values between the\nbounds are considered to be part of the set.  A value of zero\nin either position indicates that there is no bound on the\ncorresponding portion of the range.  Note that the Action\nfield can be set to 0x01 (Inclusive Range) only when the\nidentifier for unnumbered link is used.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Dir: Directionality of the link set (2 bits)",
      "ja": "DIR：リンクセットの方向（2ビット）"
    },
    {
      "indent": 6,
      "text": "0 - bidirectional",
      "ja": "0  - 双方向"
    },
    {
      "indent": 6,
      "text": "1 - input",
      "ja": "1  - 入力"
    },
    {
      "indent": 6,
      "text": "2 - output",
      "ja": "2  - 出力"
    },
    {
      "indent": 6,
      "text": "In optical networks, we think in terms of unidirectional and bidirectional links. For example, label restrictions or connectivity may be different for an input port than for its \"companion\" output port, if one exists. Note that \"interfaces\" such as those discussed in the Interfaces MIB [RFC2863] are assumed to be bidirectional. This also applies to the links advertised in various link state routing protocols.",
      "ja": "光ネットワークでは、単方向および双方向リンクの観点から考えます。たとえば、ラベルの制限や接続が存在する場合、その「仲間」出力ポートよりも、入力ポートごとに異なるかもしれません。そのようなインタフェースMIB [RFC2863]で説明したものなどの「インターフェース」が双方向であると仮定されることに留意されたいです。これはまた、様々なリンクステートルーティングプロトコルで広告のリンクに適用されます。"
    },
    {
      "indent": 3,
      "text": "Format: The format of the link identifier (6 bits)",
      "ja": "フォーマット：リンク識別子のフォーマット（6ビット）"
    },
    {
      "indent": 6,
      "text": "0 - Link Local Identifier",
      "ja": "0  - リンクローカル識別子"
    },
    {
      "indent": 10,
      "text": "Indicates that the links in the link set are identified by\nlink local identifiers.  All link local identifiers are\nsupplied in the context of the advertising node.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "1 - Local Interface IPv4 Address",
      "ja": "1  - ローカルインターフェイスのIPv4アドレス"
    },
    {
      "indent": 10,
      "text": "Indicates that the links in the link set are identified by\nLocal Interface IPv4 Address.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "2 - Local Interface IPv6 Address",
      "ja": "2  - ローカルインターフェイスのIPv6アドレス"
    },
    {
      "indent": 10,
      "text": "Indicates that the links in the link set are identified by\nLocal Interface IPv6 Address.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Others - Reserved for future use",
      "ja": "その他 - 今後の使用のために予約"
    },
    {
      "indent": 6,
      "text": "Note that all link identifiers in the same list must be of the same type.",
      "ja": "同じリスト内のすべてのリンク識別子は、同じ型でなければならないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Length: 16 bits",
      "ja": "長さ：16ビット"
    },
    {
      "indent": 6,
      "text": "This field indicates the total length in bytes of the Link Set Field.",
      "ja": "このフィールドは、リンクセットのフィールドのバイト単位の合計の長さを示します。"
    },
    {
      "indent": 3,
      "text": "Link Identifier: length is dependent on the link format",
      "ja": "リンクID：長は、リンクの形式に依存しています"
    },
    {
      "indent": 6,
      "text": "The link identifier represents the port that is being described either for connectivity or for label restrictions. This can be the link local identifier of GMPLS routing [RFC4202], GMPLS OSPF routing [RFC4203], and IS-IS GMPLS routing [RFC5307]. The use of the link local identifier format can result in more compact encodings when the assignments are done in a reasonable fashion.",
      "ja": "リンクIDは、接続のためまたはラベルの制限のためにどちらか説明されているポートを表します。これは、GMPLSルーティングのリンクローカル識別子[RFC4202]、GMPLS OSPFルーティング[RFC4203]とすることができ、GMPLSルーティング[RFC5307]-ISです。割り当てが合理的な方法で行われているときに、リンクローカル識別子フォーマットの使用は、よりコンパクトな符号化をもたらすことができます。"
    },
    {
      "indent": 0,
      "text": "2.4. Available Labels Field",
      "section_title": true,
      "ja": "2.4。利用可能なラベルフィールド"
    },
    {
      "indent": 3,
      "text": "The Available Labels Field consists of priority flags and a single variable-length Label Set Field as follows:",
      "ja": "次のように使用可能なラベルフィールドは、優先フラグとシングル可変長ラベルフィールド設定で構成されています。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     PRI       |              Reserved                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Label Set Field                           |\n:                                                               :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Where:",
      "ja": "どこ："
    },
    {
      "indent": 3,
      "text": "PRI (Priority Flags, 8 bits): A bitmap used to indicate which priorities are being advertised. The bitmap is in ascending order, with the leftmost bit representing priority level 0 (i.e., the highest) and the rightmost bit representing priority level 7 (i.e., the lowest). A bit MUST be set (1) corresponding to each priority represented in the sub-TLV and MUST NOT be set (0) when the corresponding priority is not represented. If a label is available at priority M, it MUST be advertised available at each priority N < M. At least one priority level MUST be advertised.",
      "ja": "PRI（優先フラグ、8ビット）：優先順位がアドバタイズされているかを示すために使用されるビットマップ。ビットマップは、左端のビットを表す優先順位レベル0（すなわち、最高）と右端のビットを表す優先レベル7と、昇順である（即ち、最も低いです）。ビットは、（1）サブTLVで表される各優先度に対応して設定しなければならなくて、対応する優先度が示されていない場合（0）に設定してはいけません。ラベルは、優先度Mで利用可能である場合、それは、N <Mの少なくとも一つの優先度が広告されなければならない各優先度で利用可能な広告されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The PRI field indicates the availability of the labels for use in Label Switched Path (LSP) setup and preemption as described in [RFC3209].",
      "ja": "[RFC3209]に記載されているようにPRIフィールドは、ラベルスイッチパス（LSP）セットアップおよびプリエンプションに使用するためのラベルの利用可能性を示しています。"
    },
    {
      "indent": 3,
      "text": "When a label is advertised as available for priorities 0, 1, ... M, it may be used by any LSP of priority N <= M. When a label is in use by an LSP of priority M, it may be used by an LSP of priority N < M if LSP preemption is supported.",
      "ja": "ラベルは優先順位0、1、... Mのために利用可能として宣伝されている場合、それは優先順位Nの任意のLSPによって使用することができるラベルが優先MのLSPによって使用中である場合<= M.が、それが使用することができますLSPプリエンプションがサポートされている場合は優先順位N <MのLSP。"
    },
    {
      "indent": 3,
      "text": "When a label was initially advertised as available for priorities 0, 1, ... M and once a label is used for an LSP at a priority, say N (N<=M), then this label is advertised as available for 0, ... N-1.",
      "ja": "ラベルは、最初の優先順位0、1、... M可能として宣伝されたラベルは、優先度LSPのために使用されると、N（N <= M）と言う、このラベルは、0可能としてアドバタイズされた場合... N-1。"
    },
    {
      "indent": 3,
      "text": "Note that the Label Set Field is defined in Section 2.6. See Appendix A.5 for illustrative examples.",
      "ja": "ラベルフィールド設定は2.6節で定義されていることに注意してください。具体例については、付録A.5を参照してください。"
    },
    {
      "indent": 0,
      "text": "2.5. Shared Backup Labels Field",
      "section_title": true,
      "ja": "2.5。共有バックアップラベルフィールド"
    },
    {
      "indent": 3,
      "text": "The Shared Backup Labels Field consists of priority flags and a single variable-length Label Set Field as follows:",
      "ja": "次のように共有バックアップラベルフィールドは、優先度フラグとシングル可変長ラベルフィールド設定で構成されています。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     PRI         |            Reserved                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Label Set Field                           |\n:                                                               :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Where:",
      "ja": "どこ："
    },
    {
      "indent": 3,
      "text": "PRI (Priority Flags, 8 bits): A bitmap used to indicate which priorities are being advertised. The bitmap is in ascending order, with the leftmost bit representing priority level 0 (i.e., the highest) and the rightmost bit representing priority level 7 (i.e., the lowest). A bit MUST be set (1) corresponding to each priority represented in the sub-TLV and MUST NOT be set (0) when the corresponding priority is not represented. If a label is available at priority M, it MUST be advertised available at each priority N < M. At least one priority level MUST be advertised.",
      "ja": "PRI（優先フラグ、8ビット）：優先順位がアドバタイズされているかを示すために使用されるビットマップ。ビットマップは、左端のビットを表す優先順位レベル0（すなわち、最高）と右端のビットを表す優先レベル7と、昇順である（即ち、最も低いです）。ビットは、（1）サブTLVで表される各優先度に対応して設定しなければならなくて、対応する優先度が示されていない場合（0）に設定してはいけません。ラベルは、優先度Mで利用可能である場合、それは、N <Mの少なくとも一つの優先度が広告されなければならない各優先度で利用可能な広告されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The same LSP setup and preemption rules specified in Section 2.4 apply here.",
      "ja": "2.4節で指定された同じLSPのセットアップおよびプリエンプションのルールが適用されます。"
    },
    {
      "indent": 3,
      "text": "Note that Label Set Field is defined in Section 2.6. See Appendix A.5 for illustrative examples.",
      "ja": "ラベルフィールド設定は2.6節で定義されていることに注意してください。具体例については、付録A.5を参照してください。"
    },
    {
      "indent": 0,
      "text": "2.6. Label Set Field",
      "section_title": true,
      "ja": "2.6。ラベルフィールド設定"
    },
    {
      "indent": 3,
      "text": "The Label Set Field is used within the Available Labels Field or the Shared Backup Labels Field, defined in Sections 2.4 and 2.5, respectively. It is also used within SIMPLE_LABEL, LABEL_RANGE, or SIMPLE_LABEL & CHANNEL_COUNT, defined in Sections 2.2.1, 2.2.3, and 2.2.4, respectively.",
      "ja": "ラベルの設定フィールドは、セクションはそれぞれ2.4と2.5で定義された利用可能なラベルフィールドまたは共有バックアップラベルフィールド内で使用されています。またSIMPLE_LABEL、LABEL_RANGE、又はSIMPLE_LABEL＆CHANNEL_COUNT内で使用され、それぞれ、2.2.4セクション2.2.1、2.2.3で定義され、そして。"
    },
    {
      "indent": 3,
      "text": "The general format for a label set is given below. This format uses the Action concept from [RFC3471] with an additional Action to define a \"bitmap\" type of label set. Labels are variable in length. Action-specific fields are defined in Sections 2.6.1, 2.6.2, and 2.6.3.",
      "ja": "ラベルセットのための一般的なフォーマットは以下のとおりです。この形式は、ラベルセットの「ビットマップ」タイプを定義するための追加アクションと[RFC3471]からのアクションという概念を使用しています。ラベルの長さは可変です。アクション固有のフィールドは、セクション2.6.1、2.6.2、および2.6.3で定義されています。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Action|    Num Labels = N       |           Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Base Label                           |\n|                             . . .                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      (Action-specific fields)                 |\n|                              . . . .                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Action:",
      "ja": "アクション："
    },
    {
      "indent": 6,
      "text": "0 - Inclusive List",
      "ja": "0  - インクルーシブ一覧"
    },
    {
      "indent": 6,
      "text": "1 - Exclusive List",
      "ja": "1  - 排他的なリスト"
    },
    {
      "indent": 6,
      "text": "2 - Inclusive Range",
      "ja": "2  - 包含範囲"
    },
    {
      "indent": 6,
      "text": "3 - Exclusive Range",
      "ja": "3  - 独占レンジ"
    },
    {
      "indent": 6,
      "text": "4 - Bitmap Set",
      "ja": "4  - ビットマップの設定"
    },
    {
      "indent": 3,
      "text": "Num Labels is generally the number of labels. It has a specific meaning depending on the Action value. See Sections 2.6.1, 2.6.2, and 2.6.3 for details. Num Labels is a 12-bit integer.",
      "ja": "ヌムラベルは、一般的にラベルの数です。これは、アクションの値に応じて特定の意味を持っています。セクション2.6.1、詳細については、2.6.2、および2.6.3を参照してください。 NUMラベルは、12ビットの整数です。"
    },
    {
      "indent": 3,
      "text": "Length is the length in bytes of the entire Label Set Field.",
      "ja": "長さは、全体のラベルフィールド設定のバイト単位の長さです。"
    },
    {
      "indent": 0,
      "text": "2.6.1. Inclusive/Exclusive Label Lists",
      "section_title": true,
      "ja": "2.6.1。インクルーシブ/専用ラベルリスト"
    },
    {
      "indent": 3,
      "text": "For inclusive/exclusive lists (Action = 0 or 1), the wavelength set format is:",
      "ja": "包含/排他的なリスト（ACTION = 0または1）の場合、波長セットの形式は次のとおりです。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|0 or 1 | Num Labels = 2        |          Length               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Label #1                              |\n|                            . . .                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n:                                                               :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Label #N                              |\n|                            . . .                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Label #1 is the first label to be included/excluded, and Label #N is the last label to be included/excluded. Num Labels MUST match with N.",
      "ja": "ラベル＃1は除外/含めるべき最初のラベルで、ラベル#Nは除外/含めるべき最後のラベルです。ヌムラベルはN.と一致している必要があり"
    },
    {
      "indent": 0,
      "text": "2.6.2. Inclusive/Exclusive Label Ranges",
      "section_title": true,
      "ja": "2.6.2。インクルーシブ/専用ラベル範囲"
    },
    {
      "indent": 3,
      "text": "For inclusive/exclusive ranges (Action = 2 or 3), the label set format is:",
      "ja": "包含/排他的な範囲について（ACTION = 2または3）、ラベルセットの形式は次のとおりです。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|2 or 3 | Num Labels          |               Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    Start Label                                |\n|                       . . .                                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     End Label                                 |\n|                       . . .                                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note that Start Label is the first label in the range to be included/excluded, and End Label is the last label in the same range. Num Labels MUST be two.",
      "ja": "開始ラベルが含まれる/除外する範囲内の最初のラベルであり、そしてエンド・ラベルが同じ範囲で最後のラベルであることに注意してください。ヌムラベルは2でなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.6.3. Bitmap Label Set",
      "section_title": true,
      "ja": "2.6.3。ビットマップラベルセット"
    },
    {
      "indent": 3,
      "text": "For bitmap sets (Action = 4), the label set format is:",
      "ja": "ビットマップ・セット（アクション= 4）の場合は、ラベルセットの形式は次のとおりです。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  4    |   Num Labels          |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Base Label                            |\n|                            . . .                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Bitmap Word #1 (Lowest numerical labels)                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n:                                                               :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Bitmap Word #N (Highest numerical labels)                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In this case, Num Labels tells us the number of labels represented by the bitmap. Each bit in the bitmap represents a particular label with a value of 1/0 indicating whether or not the label is in the set. Bit position zero represents the lowest label and corresponds to the base label, while each succeeding bit position represents the next label logically above the previous.",
      "ja": "この場合、ヌムラベルは私たちに、ビットマップによって表されるラベルの数を伝えます。ビットマップの各ビットは、ラベルがセット内にあるか否かを示す1/0の値と特定の標識を表します。ビット位置ゼロは、最低ラベルを表し、後続の各ビット位置は論理的に前上方に次のラベルを表す、ベースラベルに相当します。"
    },
    {
      "indent": 3,
      "text": "The size of the bitmap is Num Labels bits, but the bitmap is padded out to a full multiple of 32 bits so that the field is a multiple of four bytes. Bits that do not represent labels SHOULD be set to zero and MUST be ignored.",
      "ja": "ビットマップのサイズは、numがビットラベルされているが、フィールドは4バイトの倍数になるようにビットマップは、32ビットの完全な倍数にパディングされます。ラベルを表すものではないビットはゼロに設定されるべきであり、無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines protocol-independent encodings for WSON information and does not introduce any security issues.",
      "ja": "この文書では、WSON情報のためのプロトコルに依存しないエンコーディングを定義し、すべてのセキュリティ上の問題を紹介しません。"
    },
    {
      "indent": 3,
      "text": "However, other documents that make use of these encodings within protocol extensions need to consider the issues and risks associated with inspection, interception, modification, or spoofing of any of this information. It is expected that any such documents will describe the necessary security measures to provide adequate protection. A general discussion on security in GMPLS networks can be found in [RFC5920].",
      "ja": "しかし、プロトコル拡張内でこれらのエンコーディングを利用する他の文書は、この情報のいずれかの検査、傍受、変更、またはなりすましに関連する問題やリスクを考慮する必要があります。どのような文書が適切な保護を提供するために必要なセキュリティ対策を記述することが期待されます。 GMPLSネットワークにおけるセキュリティ上の一般的な議論は[RFC5920]で見つけることができます。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document provides general protocol-independent information encodings. There is no IANA allocation request for the information elements defined in this document. IANA allocation requests will be addressed in protocol-specific documents based on the encodings defined here.",
      "ja": "この文書では、一般的なプロトコルに依存しない情報のエンコーディングを提供します。この文書で定義されている情報要素にはIANAの割り当て要求はありません。 IANAの割り当て要求は、ここで定義されたエンコーディングに基づいて、プロトコル固有の文書で対処されることになります。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "ja": "5.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[G.694.1] ITU-T, \"Spectral grids for WDM applications: DWDM frequency grid\", ITU-T Recommendation G.694.1, February 2012.",
      "ja": "[G.694.1] ITU-T、 \"WDM用途のスペクトルグリッド：DWDM周波数グリッド\"、ITU-T勧告G.694.1、2012年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, DOI 10.17487/RFC2863, June 2000, <http://www.rfc-editor.org/info/rfc2863>.",
      "ja": "[RFC2863] McCloghrie、K.およびF. Kastenholzと、 \"インターフェイスグループMIB\"、RFC 2863、DOI 10.17487 / RFC2863、2000年6月、<http://www.rfc-editor.org/info/rfc2863>。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, DOI 10.17487/RFC3209, December 2001, <http://www.rfc-editor.org/info/rfc3209>.",
      "ja": "[RFC3209] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニヴァサン、V.、およびG.ツバメ、 \"RSVP-TE：ExtensionsがLSPトンネルのためのRSVPする\"、RFC 3209、DOI 10.17487 / RFC3209、2001年12月、<http://www.rfc-editor.org/info/rfc3209>。"
    },
    {
      "indent": 3,
      "text": "[RFC3471] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Functional Description\", RFC 3471, DOI 10.17487/RFC3471, January 2003, <http://www.rfc-editor.org/info/rfc3471>.",
      "ja": "[RFC3471]バーガー、L.、エド。、 \"一般化されたマルチプロトコルラベルスイッチング（GMPLS）機能説明シグナリング\"、RFC 3471、DOI 10.17487は/ RFC3471、2003年1月、<http://www.rfc-editor.org/情報/ RFC3471>。"
    },
    {
      "indent": 3,
      "text": "[RFC4202] Kompella, K., Ed., and Y. Rekhter, Ed., \"Routing Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 4202, DOI 10.17487/RFC4202, October 2005, <http://www.rfc-editor.org/info/rfc4202>.",
      "ja": "[RFC4202] Kompella、K.、エド、およびY. Rekhter、エド、 \"一般化されたマルチプロトコルラベルのサポートにおけるルーティング拡張機能（GMPLS）を切り替える\"、RFC 4202、DOI 10.17487 / RFC4202、2005年10月、<HTTP。。： //www.rfc-editor.org/info/rfc4202>。"
    },
    {
      "indent": 3,
      "text": "[RFC4203] Kompella, K., Ed., and Y. Rekhter, Ed., \"OSPF Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 4203, DOI 10.17487/RFC4203, October 2005, <http://www.rfc-editor.org/info/rfc4203>.",
      "ja": "[RFC4203] Kompella、K.、エド、およびY. Rekhter、エド、 \"一般化されたマルチプロトコルラベルのサポートでOSPF拡張機能（GMPLS）を切り替える\"、RFC 4203、DOI 10.17487 / RFC4203、2005年10月、<HTTP。。： //www.rfc-editor.org/info/rfc4203>。"
    },
    {
      "indent": 3,
      "text": "[RFC5307] Kompella, K., Ed., and Y. Rekhter, Ed., \"IS-IS Extensions in Support of Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 5307, DOI 10.17487/RFC5307, October 2008, <http://www.rfc-editor.org/info/rfc5307>.",
      "ja": "[RFC5307] Kompellaは、K.、エド。、およびY. Rekhter、エド。は、RFC 5307 \"一般化マルチプロトコルラベルのサポート・スイッチング（GMPLS）に拡張-IS IS\"、DOI 10.17487 / RFC5307、2008年10月、< http://www.rfc-editor.org/info/rfc5307>。"
    },
    {
      "indent": 3,
      "text": "[RFC6205] Otani, T., Ed., and D. Li, Ed., \"Generalized Labels for Lambda-Switch-Capable (LSC) Label Switching Routers\", RFC 6205, DOI 10.17487/RFC6205, March 2011, <http://www.rfc-editor.org/info/rfc6205>.",
      "ja": "[RFC6205]大谷、T.、エド、およびD.リー、エド、 \"ラムダ・スイッチ対応のための一般化ラベル（LSC）ラベルスイッチングルータ\"、RFC 6205、DOI 10.17487 / RFC6205、2011年3月、<HTTP。。： //www.rfc-editor.org/info/rfc6205>。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "ja": "5.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC5440] Vasseur, JP., Ed., and JL. Le Roux, Ed., \"Path Computation Element (PCE) Communication Protocol (PCEP)\", RFC 5440, DOI 10.17487/RFC5440, March 2009, <http://www.rfc-editor.org/info/rfc5440>.",
      "ja": "[RFC5440] Vasseur、JP。、編、およびJL。ル・ルー、エド。、 \"パス計算要素（PCE）通信プロトコル（PCEP）\"、RFC 5440、DOI 10.17487 / RFC5440、2009年3月、<http://www.rfc-editor.org/info/rfc5440>。"
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., Ed., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, DOI 10.17487/RFC5920, July 2010, <http://www.rfc-editor.org/info/rfc5920>.",
      "ja": "[RFC5920]牙、L.、エド。、 \"MPLSおよびGMPLSネットワークのセキュリティフレームワーク\"、RFC 5920、DOI 10.17487 / RFC5920、2010年7月、<http://www.rfc-editor.org/info/rfc5920>。"
    },
    {
      "indent": 3,
      "text": "[RFC6163] Lee, Y., Ed., Bernstein, G., Ed., and W. Imajuku, \"Framework for GMPLS and Path Computation Element (PCE) Control of Wavelength Switched Optical Networks (WSONs)\", RFC 6163, DOI 10.17487/RFC6163, April 2011, <http://www.rfc-editor.org/info/rfc6163>.",
      "ja": "[RFC6163]リー、Y.、エド。、バーンスタイン、G.、エド。、およびW. Imajuku、 \"GMPLSと波長の経路計算エレメント（PCE）の制御のためのフレームワークは、交換光ネットワーク（WSONs）\"、RFC 6163、DOI 10.17487 / RFC6163、2011年4月、<http://www.rfc-editor.org/info/rfc6163>。"
    },
    {
      "indent": 3,
      "text": "[RFC7446] Lee, Y., Ed., Bernstein, G., Ed., Li, D., and W. Imajuku, \"Routing and Wavelength Assignment Information Model for Wavelength Switched Optical Networks\", RFC 7446, DOI 10.17487/RFC7446, February 2015, <http://www.rfc-editor.org/info/rfc7446>.",
      "ja": "[RFC7446]リー、Y.、エド。、バーンスタイン、G.、エド。、李、D.、およびW. Imajukuは、 \"波長のためのルーティングと波長割り当て情報モデルは、交換光ネットワーク\"、RFC 7446、DOI 10.17487 / RFC7446 、2015年2月、<http://www.rfc-editor.org/info/rfc7446>。"
    },
    {
      "indent": 3,
      "text": "[Switch] Bernstein, G., Lee, Y., Gavler, A., and J. Martensson, \"Modeling WDM Wavelength Switching Systems for Use in GMPLS and Automated Path Computation\", Journal of Optical Communications and Networking, Volume 1, Issue 1, pp. 187-195, June 2009.",
      "ja": "[スイッチ]バーンスタイン、G.、リー、Y.、Gavler、A.、およびJ. Martenssonから、「モデルWDM波長は、GMPLSで使用するためのシステムおよび自動化された経路計算の切り替え」、光通信やネットワーキング、第1巻、発行の雑誌1、頁187-195、2009年6月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Encoding Examples",
      "ja": "付録A.エンコーディング例"
    },
    {
      "indent": 3,
      "text": "This appendix contains examples of the general encoding extensions applied to some simple ROADM network elements and links.",
      "ja": "この付録では、いくつかの簡単なROADMネットワーク要素とリンクに適用される一般的なエンコーディングの拡張の例が含まれています。"
    },
    {
      "indent": 0,
      "text": "A.1. Link Set Field",
      "ja": "A.1。リンクセットのフィールド"
    },
    {
      "indent": 3,
      "text": "Suppose that we wish to describe a set of input ports that have link local identifiers numbered 3 through 42. In the Link Set Field, we set Action = 1 to denote an inclusive range, Dir = 1 to denote input links, and Format = 0 to denote link local identifiers. Thus, we have:",
      "ja": "我々は、リンクローカル識別子は、リンクセットのフィールドに42を介して3番持つ入力ポートのセットを記述したいと仮定し、私たちはアクション= 1は、ディレクトリ= 1は、入力リンク、およびフォーマットを示すために包括的な範囲を示すために= 0を設定しますリンクローカル識別子を意味します。したがって、我々は持っています："
    },
    {
      "indent": 5,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=1     |0 1|0 0 0 0 0 0|             Length = 12       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #3                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #42               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "A.2. Label Set Field",
      "ja": "A.2。ラベルフィールド設定"
    },
    {
      "indent": 3,
      "text": "In this example, we use a 40-channel C-Band Dense Wavelength Division Multiplexing (DWDM) system with 100 GHz spacing with lowest frequency 192.0 THz (1561.4 nm) and highest frequency 195.9 THz (1530.3 nm). These frequencies correspond to n = -11 and n = 28, respectively. Now suppose the following channels are available:",
      "ja": "この例では、最低周波数192.0テラヘルツ（1561.4 nm）を最高周波数195.9テラヘルツ（1530.3 nm）の100 GHz間隔の40チャネルCバンド高密度波長分割多重（DWDM）システムを使用します。これらの周波数は、それぞれにN = -11であり、n = 28に対応します。ここで、次のチャンネルが用意されていたとします。"
    },
    {
      "indent": 3,
      "text": "Frequency (THz)       n Value      bitmap position\n--------------------------------------------------\n   192.0             -11                  0\n   192.5              -6                  5\n   193.1               0                 11\n   193.9               8                 19\n   194.0               9                 20\n   195.2              21                 32\n   195.8              27                 38",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Using the label format defined in [RFC6205], with the Grid value set to indicate an ITU-T A/2 [G.694.1] DWDM grid and C.S. set to indicate 100 GHz, this lambda bitmap set would then be encoded as follows:",
      "ja": "次のようにグリッド値は、100ギガヘルツを示すために、ITU-T A / 2 [G.694.1] DWDMグリッドとC。S.セットを示すように設定して、[RFC6205]で定義されたラベルフォーマットを使用して、このラムダビットマップセットは、次に符号化されるであろう。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  4    | Num Labels = 40       |    Length = 16 bytes          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid |  C.S. |      Reserved   | n  for lowest frequency = -11 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|1 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 0 0 0 0|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|1 0 0 0 0 0 1 0|   Not used in 40 Channel system (all zeros)   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "To encode this same set as an inclusive list, we would have:",
      "ja": "包括的リストとして、この同じセットを符号化するために、我々は持っているでしょう："
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  0    | Num Labels = 7        |    Length = 32 bytes          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid |  C.S. |      Reserved   | n  for lowest frequency = -11 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid |  C.S. |      Reserved   | n  for lowest frequency = -6  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid |  C.S. |      Reserved   | n  for lowest frequency = -0  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid |  C.S. |      Reserved   | n  for lowest frequency = 8   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid |  C.S. |      Reserved   | n  for lowest frequency = 9   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid |  C.S. |      Reserved   | n  for lowest frequency = 21  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid |  C.S. |      Reserved   | n  for lowest frequency = 27  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "A.3. Connectivity Matrix",
      "ja": "A.3。接続マトリクス"
    },
    {
      "indent": 3,
      "text": "Suppose we have a typical 2-degree 40-channel ROADM. In addition to its two line side ports, it has 80 add and 80 drop ports. The figure below illustrates how a typical 2-degree ROADM system that works with bidirectional fiber pairs is a highly asymmetrical system composed of two unidirectional ROADM subsystems.",
      "ja": "我々は典型的な2度の40チャネルROADMがあるとします。その2つのライン側ポートに加えて、それは80 ADDと80個のドロップポートを有します。以下の図は、双方向ファイバ対で動作する典型的な2度のROADMシステムは2つの単方向ROADMサブシステムから構成される高度に非対称システムである様子を示します。"
    },
    {
      "indent": 3,
      "text": "                      (Tributary) Ports #3-#42\n                  Input added to    Output dropped from\n                  West Line Output    East Line Input\n                        vvvvv          ^^^^^\n                       | |||.|        | |||.|\n                 +-----| |||.|--------| |||.|------+\n                 |    +----------------------+     |\n                 |    |                      |     |\n     Output      |    | Unidirectional ROADM |     |    Input\n-----------------+    |                      |     +--------------\n<=====================|                      |===================<\n-----------------+    +----------------------+     +--------------\n                 |                                 |\n     Port #1     |                                 |   Port #2\n(West Line Side) |                                 |(East Line Side)\n-----------------+    +----------------------+     +--------------\n>=====================|                      |===================>\n-----------------+    | Unidirectional ROADM |     +--------------\n       Input     |    |                      |     |    Output\n                 |    |              _       |     |\n                 |    +----------------------+     |\n                 +-----| |||.|--------| |||.|------+\n                       | |||.|        | |||.|\n                        vvvvv          ^^^^^\n                  (Tributary) Ports #43-#82\n             Output dropped from    Input added to\n             West Line Input      East Line Output",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Referring to the figure above, we see that the Input direction of ports #3-#42 (add ports) can only connect to the output on port #1 while the Input side of port #2 (line side) can only connect to the output on ports #3-#42 (drop) and to the output on port #1 (pass through). Similarly, the input direction of ports #43-#82 can only connect to the output on port #2 (line) while the input direction of port #1 can only connect to the output on ports #43-#82 (drop) or port #2 (pass through). We can now represent this potential connectivity matrix as follows. This representation uses only 29 32-bit words.",
      "ja": "上図を参照すると、我々は、ポート＃2（回線側）の入力側のみに接続することができながら、ポートの入力方向＃3-＃42（ポートを追加）のみポート＃1上の出力に接続できることを確認しますポート＃1のポート＃3-＃42（ドロップ）を出力するオン出力（通過）。同様に、ポート＃43-＃82の入力方向は、ポート＃1の入力方向のみ＃43-＃82（ドロップ）ポートの出力に接続することができながら、ポート＃2（回線）上の出力に接続したりすることができポート＃2（通過）。次のように我々は今、この潜在的な接続行列を表すことができます。この表現は、29の32ビットワードを使用します。"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Conn = 1   |    MatrixID   |      Reserved                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                      Note: adds to line\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=1     |0 1|0 0 0 0 0 0|          Length = 12          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #3                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #42               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |1 0|0 0 0 0 0 0|          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #1                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                   Note: line to drops\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |0 1|0 0 0 0 0 0|          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #2                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=1     |1 0|0 0 0 0 0 0|          Length = 12          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #3                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #42               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                   Note: line to line\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |0 1|0 0 0 0 0 0|          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #2                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |1 0|0 0 0 0 0 0|          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #1                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                            Note: adds to line\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=1     |0 1|0 0 0 0 0 0|          Length = 12          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #43               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #82               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |1 0|0 0 0 0 0 0|          Length = 8           |",
      "raw": true
    },
    {
      "indent": 4,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #2                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                   Note: line to drops\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |0 1|0 0 0 0 0 0||          Length = 8          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #1                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=1     |1 0|0 0 0 0 0 0|          Length = 12          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #43               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #82               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                   Note: line to line\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |0 1|0 0 0 0 0 0|          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #1                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |1 0|0 0 0 0 0 0|          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #2                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "A.4. Connectivity Matrix with Bidirectional Symmetry",
      "ja": "A.4。双方向対称性と接続性マトリックス"
    },
    {
      "indent": 3,
      "text": "If one has the ability to renumber the ports of the previous example as shown in the next figure, then we can take advantage of the bidirectional symmetry and use bidirectional encoding of the connectivity matrix. Note that we set dir=bidirectional in the Link Set Fields.",
      "ja": "次の図に示すように、1つ前の例のポート番号を変更する能力を有している場合、我々は、双方向対称性を利用し、連結性行列の双方向符号化を使用することができます。我々はリンクセットの分野でDIR =双方向に設定することに注意してください。"
    },
    {
      "indent": 3,
      "text": "                             (Tributary)\n                  Ports #3-42         Ports #43-82\n                  West Line Output    East Line Input\n                        vvvvv          ^^^^^\n                       | |||.|        | |||.|\n                 +-----| |||.|--------| |||.|------+\n                 |    +----------------------+     |\n                 |    |                      |     |\n     Output      |    | Unidirectional ROADM |     |    Input\n-----------------+    |                      |     +--------------\n<=====================|                      |===================<\n-----------------+    +----------------------+     +--------------\n                 |                                 |\n     Port #1     |                                 |   Port #2\n(West Line Side) |                                 |(East Line Side)\n-----------------+    +----------------------+     +--------------\n>=====================|                      |===================>\n-----------------+    | Unidirectional ROADM |     +--------------\n     Input     |    |                      |     |    Output\n                 |    |              _       |     |\n                 |    +----------------------+     |\n                 +-----| |||.|--------| |||.|------+\n                       | |||.|        | |||.|\n                        vvvvv          ^^^^^\n                  Ports #3-#42            Ports #43-82\n             Output dropped from    Input added to\n             West Line Input      East Line Output",
      "raw": true
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Conn = 1   |    MatrixID   |      Reserved                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n               Note: Add/Drop #3-42 to Line side #1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=1     |0 0|0 0 0 0 0 0|          Length = 12          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #3                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #42               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |0 0|0 0 0 0 0 0|          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #1                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                   Note: line #2 to add/drops #43-82\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |0 0|0 0 0 0 0 0|          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #2                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=1     |0 0|0 0 0 0 0 0|          Length = 12          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #43               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #82               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                   Note: line to line\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |0 0|0 0 0 0 0 0|          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #1                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Action=0     |0 0|0 0 0 0 0 0|          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Link Local Identifier = #2                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "A.5. Priority Flags in Available/Shared Backup Labels",
      "ja": "A.5。利用/共有バックアップラベルでの優先フラグ"
    },
    {
      "indent": 3,
      "text": "If one wants to make a set of labels (indicated by Label Set Field #1) available only for the highest priority level (Priority Level 0) while allowing a set of labels (indicated by Label Set Field #2) to be available to all priority levels, the following encoding will express such need.",
      "ja": "一つは（ラベルの設定フィールド＃2で示される）ラベルのセットが全てに利用できるように可能にしながら、唯一の優先順位が最も高いレベル（優先レベル0）のためのラベルのセット（ラベルの設定フィールド＃で示されるが、1）利用できるようにしたい場合優先レベルは、次の符号化は、そのような必要性を発現します。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|1 0 0 0 0 0 0 0|              Reserved                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Label Set Field #1                        |\n:                                                               :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|1 1 1 1 1 1 1 1|              Reserved                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Label Set Field #2                        |\n:                                                               :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "Diego Caviglia Ericsson Via A. Negrone 1/A 16153 Genoa Italy Phone: +39 010 600 3736 EMail: diego.caviglia@ericsson.com",
      "ja": "ディエゴ・Cavigliaエリクソン経由A. Negrone 16153分の1ジェノヴァイタリア電話：39010600 3736 Eメール：diego.caviglia@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Anders Gavler Acreo AB Electrum 236 SE - 164 40 Kista Sweden EMail: Anders.Gavler@acreo.se",
      "ja": "アンダースGavler Acreo ABエレクトラ236 SE  -  164 40シスタ、スウェーデンのEメール：Anders.Gavler@acreo.se"
    },
    {
      "indent": 3,
      "text": "Jonas Martensson Acreo AB Electrum 236 SE - 164 40 Kista Sweden EMail: Jonas.Martensson@acreo.se",
      "ja": "ジョナスMartenssonからAcreo ABエレクトラ236 SE  -  164 40シスタ、スウェーデンのEメール：Jonas.Martensson@acreo.se"
    },
    {
      "indent": 3,
      "text": "Itaru Nishioka NEC Corp. 1753 Simonumabe Nakahara-ku, Kawasaki, Kanagawa 211-8666 Japan Phone: +81 44 396 3287 EMail: i-nishioka@cb.jp.nec.com",
      "ja": "いたる にしおか ねＣ こｒｐ。 １７５３ しもぬまべ なかはらーく、 かわさき、 かながわ ２１１ー８６６６ じゃぱん Ｐほね： ＋８１ ４４ ３９６ ３２８７ えまいｌ： いーにしおか＠ｃｂ。ｊｐ。ねｃ。こｍ"
    },
    {
      "indent": 3,
      "text": "Rao Rajan Infinera EMail: rrao@infinera.com",
      "ja": "InfineraのラジャンラオEメール：rrao@infinera.com"
    },
    {
      "indent": 3,
      "text": "Giovanni Martinelli Cisco EMail: giomarti@cisco.com",
      "ja": "ジョヴァンニ・マルティネリシスコEメール：giomarti@cisco.com"
    },
    {
      "indent": 3,
      "text": "Remi Theillaud Marben EMail: remi.theillaud@marben-products.com",
      "ja": "レミTheillaud Marben Eメール：remi.theillaud@marben-products.com"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Greg M. Bernstein (editor) Grotto Networking Fremont, California United States Phone: (510) 573-2237 EMail: gregb@grotto-networking.com",
      "ja": "グレッグ・M.バーンスタイン（エディタ）洞窟ネットワーキングフリーモント、カリフォルニア州アメリカ合衆国電話：（510）573から2237 Eメール：gregb@grotto-networking.com"
    },
    {
      "indent": 3,
      "text": "Young Lee (editor) Huawei Technologies 1700 Alma Drive, Suite 100 Plano, TX 75075 United States Phone: (972) 509-5599 (x2240) EMail: ylee@huawei.com",
      "ja": "ヤング・リー（編集者）華為技術1700アルマドライブ、スイート100プラノ、TX 75075人の米国電話：（972）509から5599（x2240）メール：ylee@huawei.com"
    },
    {
      "indent": 3,
      "text": "Dan Li Huawei Technologies Co., Ltd. F3-5-B R&D Center, Huawei Base, Bantian, Longgang District Shenzhen 518129 China Phone: +86-755-28973237 EMail: danli@huawei.com",
      "ja": "ダン李華為技術有限公司F3-5-B R＆Dセンター、Huawei社ベース、Bantian、Longgang区、深セン518129中国電話：+ 86-755-28973237電子メール：danli@huawei.com"
    },
    {
      "indent": 3,
      "text": "Wataru Imajuku NTT Network Innovation Labs 1-1 Hikari-no-oka, Yokosuka, Kanagawa Japan Phone: +81-(46) 859-4315 EMail: imajuku.wataru@lab.ntt.co.jp",
      "ja": "わたる いまじゅく んっｔ ねとぉｒｋ いんおゔぁちおん ぁｂｓ １ー１ ひかりーのーおか、 よこすか、 かながわ じゃぱん Ｐほね： ＋８１ー（４６） ８５９ー４３１５ えまいｌ： いまじゅく。わたる＠ぁｂ。んっｔ。こ。ｊｐ"
    },
    {
      "indent": 3,
      "text": "Jianrui Han Huawei Technologies Co., Ltd. F3-5-B R&D Center, Huawei Base, Bantian, Longgang District Shenzhen 518129 China Phone: +86-755-28972916 EMail: hanjianrui@huawei.com",
      "ja": "Jianruiハン華為技術有限公司F3-5-B R＆Dセンター、Huawei社ベース、Bantian、Longgang区、深セン518129中国電話：+ 86-755-28972916電子メール：hanjianrui@huawei.com"
    }
  ]
}