{
  "title": {
    "text": "RFC 7041 - Extensions to the Virtual Private LAN Service (VPLS) Provider Edge (PE) Model for Provider Backbone Bridging",
    "ja": "RFC 7041 - ブリッジングプロバイダーバックボーンのための仮想プライベートLANサービス（VPLS）プロバイダーエッジ（PE）モデルへの拡張"
  },
  "number": 7041,
  "created_at": "2019-10-27 22:57:19.417561+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                     F. Balus, Ed.\nRequest for Comments: 7041                                Alcatel-Lucent\nCategory: Informational                                  A. Sajassi, Ed.\nISSN: 2070-1721                                                    Cisco\n                                                           N. Bitar, Ed.\n                                                                 Verizon\n                                                           November 2013",
      "raw": true
    },
    {
      "indent": 10,
      "text": " Extensions to the Virtual Private LAN Service (VPLS)\nProvider Edge (PE) Model for Provider Backbone Bridging",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The IEEE 802.1 Provider Backbone Bridges (PBBs) specification defines an architecture and bridge protocols for interconnection of multiple Provider Bridged Networks (PBNs). Provider backbone bridging was defined by IEEE as a connectionless technology based on multipoint VLAN tunnels. PBB can be used to attain better scalability than Provider Bridges (PBs) in terms of the number of customer Media Access Control addresses and the number of service instances that can be supported.",
      "ja": "IEEE 802.1プロバイダ・バックボーン・ブリッジ（PBB類）仕様は、複数のプロバイダブリッジネットワーク（PBNs）の相互接続のためのアーキテクチャおよびブリッジプロトコルを定義します。プロバイダーバックボーンブリッジングは、マルチポイントVLANトンネルに基づいてコネクション技術としてIEEEによって定義されました。 PBBは、顧客のメディアアクセス制御アドレスの数とサポートできるサービスインスタンスの数の点でプロバイダブリッジ（PBS）よりも優れたスケーラビリティを達成するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "The Virtual Private LAN Service (VPLS) provides a framework for extending Ethernet LAN services, using MPLS tunneling capabilities, through a routed MPLS backbone without running the Rapid Spanning Tree Protocol (RSTP) or the Multiple Spanning Tree Protocol (MSTP) across the backbone. As a result, VPLS has been deployed on a large scale in service provider networks.",
      "ja": "仮想プライベートLANサービス（VPLS）は、バックボーン全体で高速スパニングツリープロトコル（RSTP）またはマルチプルスパニングツリープロトコル（MSTP）を実行せずにルーティングされたMPLSバックボーンを通じて、MPLSのトンネリング機能を、イーサネットLANサービスを拡張使用するためのフレームワークを提供します。その結果、VPLSは、サービスプロバイダーネットワークに大規模に展開されています。"
    },
    {
      "indent": 3,
      "text": "This document discusses extensions to the VPLS Provider Edge (PE) model required to incorporate desirable PBB components while maintaining the service provider fit of the initial model.",
      "ja": "この文書は、初期モデルのサービスプロバイダ適合を維持しながら、望ましいPBB成分を組み込むために必要なVPLSプロバイダエッジ（PE）モデルへの拡張を説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7041.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7041で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. General Terminology .............................................4\n3. PE Reference Model ..............................................6\n4. Packet Walkthrough ..............................................9\n5. Control Plane ..................................................11\n6. Efficient Packet Replication in PBB VPLS .......................12\n7. PBB VPLS OAM ...................................................12\n8. Security Considerations ........................................12\n9. References .....................................................13\n   9.1. Normative References ......................................13\n   9.2. Informative References ....................................13\n10. Contributors ..................................................14\n11. Acknowledgments ...............................................15",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The IEEE 802.1 Provider Backbone Bridges specification [PBB] defines an architecture and bridge protocols for interconnection of multiple Provider Bridged Networks (PBNs). PBB can be used to attain better scalability than Provider Bridges [PB] in terms of the number of customer Media Access Control (MAC) addresses and the number of service instances that can be supported. PBB provides a data-plane hierarchy and new addressing designed to achieve such better scalability in Provider Backbone Networks. A number of Ethernet control-plane protocols, such as the Rapid Spanning Tree Protocol (RSTP), the Multiple Spanning Tree Protocol (MSTP), and Shortest Path Bridging (SPB), could be deployed as the core control plane for loop avoidance and load balancing for PBB. The applicability of these control protocols is out of scope for this document.",
      "ja": "IEEE 802.1プロバイダ・バックボーン・ブリッジ仕様[PBB]は、複数のプロバイダブリッジネットワーク（PBNs）の相互接続のためのアーキテクチャおよびブリッジプロトコルを定義します。 PBBは、顧客のメディアアクセス制御（MAC）アドレスの数とサポートできるサービスインスタンスの数の点でプロバイダブリッジ[PB]よりも優れたスケーラビリティを達成するために使用することができます。 PBBは、データプレーンの階層を提供し、新しいは、プロバイダのバックボーンネットワークで、このような優れたスケーラビリティを実現するために設計されたアドレッシング。このようなラピッドスパニングツリープロトコル（RSTP）、マルチプルスパニングツリープロトコル（MSTP）、および最短経路としてイーサネット制御プレーンプロトコルの数は、（SPB）、ループ回避および負荷のためのコア制御プレーンとして展開することができる架橋しますPBBのためにバランスをとります。これらの制御プロトコルの適用はこの文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "The Virtual Private LAN Service (VPLS) provides a solution for extending Ethernet LAN services, using MPLS tunneling capabilities, through a routed MPLS backbone without requiring the use of a native Ethernet control-plane protocol across the backbone. VPLS use of the structured FEC 129 [RFC4762] also allows for inter-domain, inter-provider connectivity and enables auto-discovery options across the network, improving the service delivery options.",
      "ja": "仮想プライベートLANサービス（VPLS）はバックボーン上のネイティブイーサネットコントロールプレーンプロトコルの使用を必要とせずにルーティングされたMPLSバックボーンを通じて、MPLSのトンネリング機能を、イーサネットLANサービスを拡張使用するためのソリューションを提供します。構造化されたFEC 129 [RFC4762]のVPLSの使用はまた、ドメイン間、インタープロバイダの接続を可能にし、ネットワーク経由で自動検出のオプションを可能にする、サービスの配信オプションを向上させることができます。"
    },
    {
      "indent": 3,
      "text": "A hierarchical solution for VPLS was introduced in [RFC4761] and [RFC4762] to provide improved scalability and efficient handling of packet replication. These improvements are achieved by reducing the number of Provider Edge (PE) devices connected in a full-mesh topology through the creation of two-tier PEs. A User-facing PE (U-PE) aggregates all the Customer Edge (CE) devices in a lower-tier access network and then connects to the Network-facing PE (N-PE) device(s) deployed around the core domain. In VPLS, Media Access Control (MAC) address learning and forwarding are done based on Customer MAC addresses (C-MACs); this poses scalability issues on the N-PE devices as the number of VPLS instances (and thus C-MACs) increases. Furthermore, since a set of pseudowires (PWs) is maintained on a \"per customer service instance\" basis, the number of PWs required at N-PE devices is proportional to the number of customer service instances multiplied by the number of N-PE devices in the full-mesh set. This can result in scalability issues (in terms of PW manageability and troubleshooting) as the number of customer service instances grows.",
      "ja": "VPLSのための階層的なソリューションは、改善されたスケーラビリティとパケット複製の効率的な処理を提供するために、[RFC4761]及び[RFC4762]に導入しました。これらの改善は、プロバイダエッジ（PE）2層PEの作成を通じてフルメッシュトポロジで接続されたデバイスの数を減らすことによって達成されます。ユーザーに面するPE（U-PE）は、下部層のアクセスネットワーク内のすべての顧客エッジ（CE）デバイスを集約した後、コア領域の周囲に配備ネットワーク側PE（N-PE）デバイス（単数または複数）に接続します。 VPLSでは、メディアアクセス制御（MAC）アドレス学習や転送はお客様のMACアドレス（C-MACの）に基づいて行われます。 VPLSインスタンスの数（したがって、C-MACは）増加するように、これはN-PEデバイスのスケーラビリティの問題を提起します。疑似回線（PWの）のセットは、「顧客サービスインスタンスごと」に基づいて維持されるので、N-PEデバイスで必要のPWの数はN-PEデバイスの数を乗じた顧客サービス・インスタンスの数に比例しますフルメッシュセットインチこれは、顧客サービスのインスタンスの数が増えると（PWの管理とトラブルシューティングの観点で）スケーラビリティの問題をもたらす可能性があります。"
    },
    {
      "indent": 3,
      "text": "This document describes how PBB can be integrated with VPLS to allow for useful PBB capabilities while continuing to avoid the use of MSTP in the backbone. The combined solution referred to in this document as PBB-VPLS results in better scalability in terms of the number of service instances, PWs, and C-MACs that need to be handled in the VPLS PEs.",
      "ja": "この文書では、PBBは、バックボーンにおけるMSTPの使用を避けるために継続しながら、便利なPBB機能を可能にするためにVPLSと統合することができる方法を説明します。合わせた溶液は、サービスインスタンスのPW、およびVPLSのPEで処理する必要がC-MACの数の点でより良好なスケーラビリティにPBB-VPLSの結果として、この文書で言及しました。"
    },
    {
      "indent": 3,
      "text": "Section 2 provides a quick terminology reference. Section 3 covers the reference model for PBB VPLS PEs. Section 4 describes the packet walkthrough. Sections 5 through 7 discuss the PBB-VPLS usage of existing VPLS mechanisms -- the control plane; efficient packet replication; and Operations, Administration, and Maintenance (OAM).",
      "ja": "第2節では、迅速な用語の参照を提供します。第3節では、PBB VPLSのPEのための参照モデルをカバーしています。第4章では、パケットのチュートリアルを説明します。 7を介してセクション5既存のVPLSメカニズムのPBB-VPLS使用議論 - コントロールプレーンと、効率的なパケット複製;そして、運用、管理、および保守（OAM）。"
    },
    {
      "indent": 0,
      "text": "2. General Terminology",
      "section_title": true,
      "ja": "2.一般的な用語"
    },
    {
      "indent": 3,
      "text": "Some general terminology is defined here; most of the terminology used is from [PBB], [PB], [RFC4664], and [RFC4026]. Terminology specific to this memo is introduced as needed in later sections.",
      "ja": "いくつかの一般的な用語をここで定義されます。使用される用語のほとんどは[PBB]、[PB]、[RFC4664]及び[RFC4026]です。後のセクションで、必要に応じてこのメモに特有の用語が導入されます。"
    },
    {
      "indent": 3,
      "text": "B-BEB: A backbone edge bridge positioned at the edge of a provider backbone bridged network. It contains a B-component that supports bridging in the provider backbone based on Backbone MAC (B-MAC) and B-tag information.",
      "ja": "B-BEB：プロバイダ・バックボーンのエッジに位置バックボーン・エッジ・ブリッジは、ネットワークをブリッジ。これは、バックボーンMAC（B-MAC）及びB-タグ情報に基づいて、プロバイダ・バックボーンにブリッジングをサポートB成分を含有します。"
    },
    {
      "indent": 3,
      "text": "B-component: A bridging component contained in backbone edge and core bridges that bridges in the backbone space (B-MAC addresses, B-VLAN).",
      "ja": "B成分：バックボーン空間に橋渡し架橋骨格エッジに含まれる成分とコアブリッジ（B-MACアドレス、B-VLAN）。"
    },
    {
      "indent": 3,
      "text": "B-MAC: The backbone source or destination MAC address fields defined in the PBB provider MAC encapsulation header.",
      "ja": "B-MAC：MACカプセル化ヘッダPBBプロバイダに定義されたバックボーン送信元または宛先MACアドレスフィールド。"
    },
    {
      "indent": 3,
      "text": "B-tag: Field defined in the PBB provider MAC encapsulation header that conveys the backbone VLAN identifier information. The format of the B-tag field is the same as that of an 802.1ad S-tag field.",
      "ja": "Bタグ：フィールドバックボーンVLAN識別子情報を搬送PBBプロバイダMACカプセル化ヘッダで定義されました。 B-tagフィールドのフォーマットは、802.1ad Sタグフィールドと同じです。"
    },
    {
      "indent": 3,
      "text": "B-Tagged Service Interface: The interface between a BEB and a Backbone Core Bridge (BCB) in a provider backbone bridged network. Frames passed through this interface contain a B-tag field.",
      "ja": "B-タグ付けサービス・インタフェース：プロバイダ・バックボーンにBEBおよびバックボーンコアブリッジ（BCB）との間のインタフェースは、ネットワークをブリッジ。このインタフェースを通過したフレームは、B-タグフィールドを含んでいます。"
    },
    {
      "indent": 3,
      "text": "B-VID: The specific VLAN identifier carried inside a B-tag.",
      "ja": "B-VID：B-タグ内に運ば特定のVLAN識別子。"
    },
    {
      "indent": 3,
      "text": "B-VLAN: The backbone VLAN associated with a B-component.",
      "ja": "B-VLAN：B成分に関連付けられたバックボーンVLAN。"
    },
    {
      "indent": 3,
      "text": "B-PW: The pseudowire used to interconnect B-component instances.",
      "ja": "B-PW：B-コンポーネントインスタンスを相互接続するために使用される疑似回線。"
    },
    {
      "indent": 3,
      "text": "BEB: A backbone edge bridge positioned at the edge of a provider backbone bridged network. It can contain an I-component, a B-component, or both I-components and B-components.",
      "ja": "BEBは：プロバイダ・バックボーンのエッジに位置バックボーン・エッジ・ブリッジは、ネットワークをブリッジ。それはI成分、B成分、またはI-成分及びB成分の両方を含むことができます。"
    },
    {
      "indent": 3,
      "text": "C-VID: The VLAN identifier in a customer VLAN.",
      "ja": "C-VID：顧客のVLANでVLAN識別子。"
    },
    {
      "indent": 3,
      "text": "DA: Destination Address.",
      "ja": "DA：宛先アドレス。"
    },
    {
      "indent": 3,
      "text": "I-BEB: A backbone edge bridge positioned at the edge of a provider backbone bridged network. It contains an I-component for bridging in the customer space (customer MAC addresses, service VLAN IDs).",
      "ja": "I-BEB：プロバイダ・バックボーンのエッジに位置バックボーン・エッジ・ブリッジは、ネットワークをブリッジ。これは、顧客の空間にブリッジングのためのI成分（顧客MACアドレス、サービスVLAN ID）を含んでいます。"
    },
    {
      "indent": 3,
      "text": "I-component: A bridging component contained in a backbone edge bridge that bridges in the customer space (customer MAC addresses, service VLAN identifier information (S-VLAN)).",
      "ja": "I成分：顧客空間にブリッジバックボーン・エッジ・ブリッジ（カスタマーMACアドレス、サービスVLAN識別子情報（S-VLAN））に含まれる架橋成分。"
    },
    {
      "indent": 3,
      "text": "I-SID: The 24-bit service instance field carried inside the I-tag. I-SID defines the service instance that the frame should be \"mapped to\".",
      "ja": "I-SID：I-タグ内に運ば24ビット・サービス・インスタンス・フィールド。 I-SIDフレームが「にマッピング」されるべきであることをサービスインスタンスを定義します。"
    },
    {
      "indent": 3,
      "text": "I-tag: A field defined in the PBB provider MAC encapsulation header that conveys the service instance information (I-SID) associated with the frame.",
      "ja": "I-タグ：フレームに関連付けられたサービスインスタンス情報（I-SID）を搬送するPBBプロバイダMACカプセル化ヘッダに定義されたフィールド。"
    },
    {
      "indent": 3,
      "text": "I-Tagged Service Interface: The interface defined between the I-components and B-components inside an IB-BEB or between two B-BEBs. Frames passed through this interface contain an I-tag field.",
      "ja": "I-タグ付けサービスインタフェース：IB-BEB内部またはB-BEBs両者のI-成分とB成分との間に定義されたインターフェース。このインタフェースを通過したフレームは、I-タグフィールドを含んでいます。"
    },
    {
      "indent": 3,
      "text": "IB-BEB: A backbone edge bridge positioned at the edge of a provider backbone bridged network. It contains an I-component for bridging in the customer space (customer MAC addresses, service VLAN IDs) and a B-component for bridging the provider's backbone space (B-MAC, B-tag).",
      "ja": "IB-BEB：プロバイダ・バックボーンのエッジに位置バックボーン・エッジ・ブリッジは、ネットワークをブリッジ。これは、顧客のスペース（顧客MACアドレス、サービスVLANのID）と（B-MAC、B-タグ）プロバイダのバックボーンスペースを埋めるためのB成分でブリッジングのためのI成分が含まれています。"
    },
    {
      "indent": 3,
      "text": "PBs: Provider Bridges (IEEE amendment (802.1ad) to 802.1Q for \"QinQ\" encapsulation and bridging of Ethernet frames [PB]).",
      "ja": "PB：プロバイダブリッジ（イーサネットフレームの \"QinQの\" カプセル化および架橋のために802.1QするIEEEの改正（802.1ad）[PB]）。"
    },
    {
      "indent": 3,
      "text": "PBBs: Provider Backbone Bridges (IEEE amendment (802.1ah) to 802.1Q for \"MAC tunneling\" encapsulation and bridging of frames across a provider network [PBB]).",
      "ja": "PBB類：プロバイダ・バックボーン・ブリッジ（IEEE修正案（802.1ahの）は、プロバイダネットワーク経由「MACトンネリング」カプセル化およびフレームのブリッジ[PBB]に802.1Qします）。"
    },
    {
      "indent": 3,
      "text": "PBBN: Provider Backbone Bridged Network.",
      "ja": "PBBN：プロバイダーバックボーンブリッジネットワーク。"
    },
    {
      "indent": 3,
      "text": "PBN: Provider Bridged Network. A network that employs 802.1ad (QinQ) technology.",
      "ja": "PBN：プロバイダブリッジネットワーク。 802.1ad（QinQの）技術を採用したネットワーク。"
    },
    {
      "indent": 3,
      "text": "PSN: Packet-Switched Network.",
      "ja": "PSN：パケット交換ネットワーク。"
    },
    {
      "indent": 3,
      "text": "S-tag: A field defined in the 802.1ad QinQ encapsulation header that conveys the service VLAN identifier information (S-VLAN).",
      "ja": "Sタグ：サービスVLAN識別子情報（S-VLAN）を搬送する802.1adのQinQのカプセル化ヘッダ内に定義されたフィールド。"
    },
    {
      "indent": 3,
      "text": "S-Tagged Service Interface: The interface defined between the customer (CE) and the I-BEB or IB-BEB components. Frames passed through this interface contain an S-tag field.",
      "ja": "S-タグ付けサービス・インタフェース：顧客との間に画定されたインターフェース（CE）とI-BEBまたはIB-BEBのコンポーネント。このインタフェースを通過したフレームは、S-タグフィールドを含んでいます。"
    },
    {
      "indent": 3,
      "text": "S-VLAN: The specific service VLAN identifier carried inside an S-tag.",
      "ja": "S-VLAN：S-タグ内に運ば特定のサービスVLAN識別子。"
    },
    {
      "indent": 3,
      "text": "SA: Source Address.",
      "ja": "SA：送信元アドレス。"
    },
    {
      "indent": 3,
      "text": "S-VID: The VLAN identifier in a service VLAN.",
      "ja": "S-VID：サービスVLANでVLAN識別子。"
    },
    {
      "indent": 3,
      "text": "Tag: In Ethernet, a header immediately following the Source MAC Address field of the frame.",
      "ja": "タグ：イーサネット、すぐにフレームの送信元MACアドレスフィールドを次のヘッダーで。"
    },
    {
      "indent": 0,
      "text": "3. PE Reference Model",
      "section_title": true,
      "ja": "3.参照モデル"
    },
    {
      "indent": 3,
      "text": "The following gives a short primer on the Provider Backbone Bridge (PBB) before describing the PE reference model for PBB-VPLS. The internal components of a PBB bridge module are depicted in Figure 1.",
      "ja": "以下は、PBB-VPLSのためのPE参照モデルを説明する前に、プロバイダ・バックボーン・ブリッジ（PBB）に短いプライマーを与えます。 PBBブリッジモジュールの内部構成要素は、図1に示されています。"
    },
    {
      "indent": 3,
      "text": "           +-------------------------------+\n           |       PBB Bridge Model        |\n           |                               |\n+---+      |  +------+      +-----------+  |\n|CE |---------|I-Comp|------|           |  |\n+---+      |  |      |      |           |--------\n           |  +------+      |           |  |\n           |     o          |   B-Comp  |  |\n           |     o          |           |--------\n           |     o          |           |  |\n+---+      |  +------+      |           |  |\n|CE |---------|I-Comp|------|           |--------\n+---+  ^   |  |      |  ^   |           |  |   ^\n       |   |  +------+  |   +-----------+  |   |\n       |   +------------|------------------+   |\n       |                |                      |\n       |                |                      |\n  S-tagged            I-tagged             B-tagged\n  Service Interface   Service I/F          Service I/F\n  (I/F)",
      "raw": true
    },
    {
      "indent": 24,
      "text": "Figure 1: PBB Bridge Model",
      "ja": "図1：PBBブリッジモデル"
    },
    {
      "indent": 3,
      "text": "Provider Backbone Bridges (PBBs) [PBB] offer a scalable solution for service providers to build large bridged networks. The focus of PBB is primarily on improving two main areas with provider Ethernet bridged networks:",
      "ja": "プロバイダーバックボーンブリッジ（PBB類）[PBB]は、大規模なブリッジネットワークを構築するためのサービスプロバイダのためのスケーラブルなソリューションを提供します。 PBBの焦点は、主に、プロバイダイーサネットブリッジネットワークとの2つの領域を改善することにあります。"
    },
    {
      "indent": 5,
      "text": "- MAC-address table scalability - Service instance scalability",
      "ja": " -  MACアドレステーブルのスケーラビリティ - サービスインスタンスのスケーラビリティ"
    },
    {
      "indent": 3,
      "text": "To obviate the above two limitations, PBB introduces a hierarchical network architecture with associated new frame formats that extend the work completed by Provider Bridges (PBs). In the PBBN architecture, customer networks (using PBs) are aggregated into PBBNs, which utilize the IEEE PBB frame format. The frame format employs a MAC tunneling encapsulation scheme for tunneling customer Ethernet frames within provider Ethernet frames across the PBBN. A VLAN identifier (B-VID) is used to segregate the backbone into broadcast domains, and a new 24-bit service identifier (I-SID) is defined and used to associate a given customer MAC frame with a provider service instance (also called the service delimiter). It should be noted that in [PBB] there is a clear segregation between provider service instances (represented by I-SIDs) and provider VLANs (represented by B-VIDs), which was not the case for PBs.",
      "ja": "上記2つの制限を回避するために、PBBはプロバイダブリッジ（PBS）で完了した作業を拡張し、関連する新たなフレームフォーマットを持つ階層型ネットワークアーキテクチャを導入します。 PBBNアーキテクチャでは、（PBSを用いて）顧客ネットワークは、IEEE PBBフレームフォーマットを利用PBBNs、に集約されています。フレームフォーマットはPBBN横切るプロバイダイーサネットフレーム内トンネリング顧客イーサネットフレームのMACトンネリングカプセル化方式を採用しています。 VLAN識別子（B-VID）がブロードキャストドメインにバックボーンを分離するために使用され、そして新たな24ビットのサービス識別子（I-SID）が定義され、プロバイダ・サービス・インスタンスと、所与の顧客MACフレームを関連付けるために使用されている（別名サービスデリミタ）。明確なプロバイダサービスインスタンス間の分離（I-SIDが表される）し、PBSの場合ではなかった（B-VIDので表される）プロバイダVLANが、ある[PBB]であることに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "As shown in Figure 1, a PBB bridge may consist of a single B-component and one or more I-components. In simple terms, the B-component provides bridging in the provider space (B-MAC, B-VLAN), and the I-component provides bridging in the customer space (C-MAC, S-VLAN). The customer frame is first encapsulated with the provider backbone header (B-MAC, B-tag, I-tag); then, the bridging is performed in the provider backbone space (B-MAC, B-VLAN) through the network till the frame arrives at the destination BEB, where it gets decapsulated and passed to the CE. If a PBB bridge consists of both I-components and B-components, then it is called an IB-BEB, and if it only consists of either B-components or I-components, then it is called a B-BEB or an I-BEB, respectively. The interface between an I-BEB or IB-BEB and a CE is called an S-tagged service interface, and the interface between an I-BEB and a B-BEB (or between two B-BEBs) is called an I-tagged service interface. The interface between a B-BEB or IB-BEB and a Backbone Core Bridge (BCB) is called a B-tagged service interface.",
      "ja": "図1に示すように、PBBブリッジは、単一のB成分と1つ以上のIコンポーネントから構成されてもよいです。簡単に言えば、B成分は、プロバイダ空間（B-MAC、B-VLAN）に架橋提供し、I成分は、（C-MAC、S-VLAN）ユーザー空間に架橋提供します。顧客フレームは、第1のプロバイダ・バックボーン・ヘッダ（B-MAC、Bタグ、I-タグ）でカプセル化されています。フレームは、それがデカプセル化及びCEに渡される宛先BEB、に到達するまで、次に、ブリッジは、ネットワークを介してプロバイダ・バックボーン・スペース（B-MAC、B-VLAN）で行われます。 PBBブリッジがI-成分とB成分の両方から構成されている場合、それはIB-BEBと呼ばれ、それが唯一のB-コンポーネントまたはI-成分のいずれかで構成されている場合、それはB-BEBまたはIと呼ばれていますそれぞれ-BEB、。 I-BEBまたはIB-BEBとの間のインターフェースとCEは、Sタグ、サービス・インターフェースと呼ばれ、I-BEBおよびB-BEB（またはB-BEBs両者）との間のインタフェースはIタグと呼ばれていますサービス・インターフェース。 B-BEBまたはIB-BEBおよびバックボーンコアブリッジ（BCB）との間のインターフェースは、Bタグサービス・インターフェースと呼ばれます。"
    },
    {
      "indent": 3,
      "text": "To accommodate the PBB components, the VPLS model defined in [RFC4664] is extended as depicted in Figure 2.",
      "ja": "PBB成分を収容するために、[RFC4664]で定義されたVPLSモデルは、図2に示すように拡張されます。"
    },
    {
      "indent": 3,
      "text": "     +----------------------------------------+\n     |       PBB-VPLS-Capable PE Model        |\n     |   +---------------+          +------+  |\n     |   |               |          |VPLS-1|------------\n     |   |               |==========|Fwdr  |------------ PWs\n+--+ |   |     Bridge    ------------      |------------\n|CE|-|-- |               |          +------+  |\n+--+ |   |     Module    |             o      |\n     |   |               |             o      |\n     |   |    (PBB       |             o      |\n     |   |    bridge)    |             o      |\n     |   |               |             o      |\n+--+ |   |               |          +------+  |\n|CE|-|-- |               ------------VPLS-n|-------------\n+--+ |   |               |==========| Fwdr |------------- PWs\n     |   |               |     ^    |      |-------------\n     |   +---------------+     |    +------+  |\n     |                         |              |\n     +-------------------------|--------------+\n                      LAN Emulation Interface",
      "raw": true
    },
    {
      "indent": 20,
      "text": "Figure 2: PBB-VPLS-Capable PE Model",
      "ja": "図2：PBB-VPLS対応モデル"
    },
    {
      "indent": 3,
      "text": "The PBB module as defined in the [PBB] specification is expanded to interact with VPLS Forwarders. The VPLS Forwarders are used in [RFC4762] to build a PW mesh or a set of spoke PWs (Hierarchical VPLS (H-VPLS) topologies). The VPLS instances are represented externally in the MPLS context by a Layer 2 Forwarding Equivalence Class (L2FEC) that binds related VPLS instances together. VPLS Signaling advertises the mapping between the L2FEC and the PW labels and implicitly associates the VPLS bridging instance to the VPLS Forwarders [RFC4762].",
      "ja": "【PBB明細書で定義されているPBBモジュールはVPLSフォワーダと相互作用するように拡張されます。 VPLSフォワーダは、メッシュまたはスポークのPW（階層型VPLS（H-VPLS）トポロジー）のセットPWを構築するために、[RFC4762]に使用されています。 VPLSインスタンスは一緒に関連するVPLSインスタンスをバインドし、レイヤ2つのフォワーディング等価クラス（L2FEC）によって外部MPLSコンテキストで表されます。 VPLSシグナリングL2FECとPWラベルとの間のマッピングをアドバタイズし、暗黙的にVPLSフォワーダ[RFC4762]にインスタンスをブリッジVPLSを関連付けます。"
    },
    {
      "indent": 3,
      "text": "In the PBB-VPLS case, the backbone service instance in the B-component space (B-VID) is represented in the backbone MPLS network using a VPLS instance. In the same way as for the regular VPLS case, existing signaling procedures are used to generate through PW labels the linkage between VPLS Forwarders and the backbone service instance.",
      "ja": "PBB-VPLSの場合には、B成分の空間におけるバックボーン・サービス・インスタンス（B-VID）はVPLSインスタンスを使用してバックボーンMPLSネットワークで表されています。定期的なVPLSの場合と同様に、既存のシグナリング手順は、PWがVPLSフォワーダとバックボーン・サービス・インスタンス間の結合を介してラベル生成するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Similarly, with the regular H-VPLS, another L2FEC may be used to identify the customer service instance in the I-component space. This will be useful, for example, to address the PBB-VPLS N-PE case where H-VPLS spokes are connecting the PBB-VPLS N-PE to a VPLS U-PE.",
      "ja": "同様に、定期的なH-VPLSと、別のL2FECは、I成分の空間内にカスタマーサービスインスタンスを識別するために使用されてもよいです。これは、H-VPLSスポークがVPLS U-PEへPBB-VPLS N-PEを接続しているPBB-VPLS N-PEのケースに対処するために、例えば、有用であろう。"
    },
    {
      "indent": 3,
      "text": "It is important to note that the PBB-VPLS solution inherits the PBB service aggregation capability where multiple customer service instances may be mapped to a backbone service instance. In the PBB-VPLS case, this means multiple customer VPNs can be transported using a single VPLS instance corresponding to the backbone service instance, thus substantially reducing resource consumption in the VPLS core.",
      "ja": "PBB-VPLSソリューションは、複数の顧客サービスインスタンスがバックボーンサー​​ビスインスタンスにマッピングすることができるPBBサービス集約機能を継承することに注意することが重要です。 PBB-VPLSの場合には、これは、複数の顧客のVPNは、このように実質的VPLSコアにおけるリソース消費を低減、バックボーン・サービス・インスタンスに対応する単一のVPLSインスタンスを使用して輸送することができることを意味します。"
    },
    {
      "indent": 0,
      "text": "4. Packet Walkthrough",
      "section_title": true,
      "ja": "4.パケットチュートリアル"
    },
    {
      "indent": 3,
      "text": "Since the PBB bridge module inherently performs forwarding, the PE reference model of Figure 2 can be expanded as shown in Figure 3.",
      "ja": "PBBブリッジモジュールは、本質的に転送を行うため、図3に示すように、図2のPE参照モデルを拡張することができます。"
    },
    {
      "indent": 3,
      "text": "Furthermore, the B-component is connected via several virtual interfaces to the PW Forwarder module. The function of the PW Forwarder is defined in [RFC3985]. In this context, the PW Forwarder simply performs the mapping of the PWs to the virtual interface on the B-component, without the need for any MAC lookup.",
      "ja": "また、B成分はPWフォワーダモジュールに複数の仮想インタフェースを介して接続されています。 PWフォワーダの機能は、[RFC3985]で定義されています。この文脈において、PWフォワーダは、単に任意のMACルックアップを必要とせず、B成分上の仮想インターフェースへのPWのマッピングを行います。"
    },
    {
      "indent": 3,
      "text": "This simplified model takes full advantage of the PBB module -- where all the [PBB] procedures, including C-MAC/B-MAC forwarding and PBB encapsulation/decapsulation, take place -- and thus avoids the need to specify any of these functions in this document.",
      "ja": "C-MAC / B-MAC転送とPBBカプセル化/デカプセル化を含むすべての[PBB]手順は、場所を取る場合 -   - この簡略化モデルは、PBBモジュールを最大限に活用し、したがって、これらの機能のいずれかを指定する必要がなくなりこのドキュメントインチ"
    },
    {
      "indent": 3,
      "text": "Because of text-based graphics, Figure 3 only shows PWs on the core-facing side; however, in the case of MPLS access with spoke PWs, the PE reference model is simply extended to include the same PW Forwarder function on the access-facing side. To avoid cluttering the figure, but without losing any generality, the access-side PW Forwarder (Fwdr) is not depicted.",
      "ja": "なぜならテキストベースのグラフィックス、図3は、コアに面する側のPWを示す図です。しかしながら、スポークのPWとMPLSアクセスの場合には、PE参照モデルは、単にアクセスに面する側に同じPWフォワーダ機能を含むように拡張されます。図を乱雑に避けるために、しかし、任意の一般性を失うことなく、アクセス側PWフォワーダ（FWDR）が描かれていません。"
    },
    {
      "indent": 3,
      "text": "     +------------------------------------------------+\n     |               PBB-VPLS-Capable PE Model        |\n     |             +---------------+      +------+    |\n     |             |               |      |      |    |\n     |   +------+  |               ========      ---------\n+--+ |   |      |  |               |      |      --------- PWs\n|CE|-|-- | I-   ====               ========  PW  ---------\n+--+ |   | Comp |  |               |      | Fwdr |\n     |   +------+  |               |      |      --------- PWs\n     |             |    B-Comp     ========      ---------\n     |             |               |  ^   |      |    |\n     |   +------+  |               |  |   +------+    |\n+--+ |   | I-   |  |               OOOOOOOOOOOOOOOOOOOOOOOO B-tag\n|CE|-|-- | Comp ====               |  |               |     I/Fs\n+--+ |   |      |^ |               OOOOOOOOOOOOOOOOOOOOOOOO\n     |   +------+| |               |  |               |\n     |           | +---------------+  |               |\n     |           |                    |               |\n     +-----------|--------------------|---------------+\n                 |                    |\n           Internal I-tag I/Fs   Virtual Interfaces (I/Fs)",
      "raw": true
    },
    {
      "indent": 4,
      "text": "+---------------+                                +--------------+\n| C-MAC DA,SA   |                                | PSN Header   |\n|---------------|                                |--------------|\n| S-VID, C-VID  |                                | PW Label     |\n|---------------|                                |--------------|\n|    Payload    |                                | B-MAC DA,SA  |\n+---------------+                                |--------------|\n                                                 | PBB I-tag    |\n                                                 |--------------|\n                                                 | C-MAC DA,SA  |\n                                                 |--------------|\n                                                 | S-VID, C-VID |\n                                                 |--------------|\n                                                 |   Payload    |\n                                                 +--------------+",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 3: Packet Walkthrough for PBB VPLS PE",
      "ja": "図3：PBB VPLS PEのパケットチュートリアル"
    },
    {
      "indent": 3,
      "text": "In order to better understand the data-plane walkthrough, let us consider the example of a PBB packet arriving over a Backbone pseudowire (B-PW). The PSN header is used to carry the PBB encapsulated frame over the backbone while the PW label will point to the related Backbone Service Instance (B-SI), in the same way as for regular VPLS. The PW label has in this case an equivalent role with the backbone VLAN identifier on the PBB B-tagged interface.",
      "ja": "優れたデータプレーンのチュートリアルを理解するために、私たちは、バックボーンの擬似回線（B-PW）の上に到着PBBパケットの例を考えてみましょう。 PSNヘッダはPBBを搬送するために使用されるPWラベルは、通常のVPLSの場合と同様に、関連するバックボーン・サービス・インスタンス（B-SI）をポイントする一方バックボーン上にフレームをカプセル化。 PWラベルは、この場合、PBB Bタグインターフェイス上バックボーンVLAN識別子と同等の役割を有しています。"
    },
    {
      "indent": 3,
      "text": "An example of the PBB packet for the regular Ethernet PW is depicted on the right-hand side of Figure 3. The MPLS packet from the MPLS core network is received by the PBB-VPLS PE. The PW Forwarder function of the PE uses the PW label to derive the virtual interface-id on the B-component, and then, after removing the PSN and PW encapsulation, it passes the packet to the B-component. From there on, the processing and forwarding are performed according to [PBB], where bridging based on the Backbone MAC (B-MAC) Destination Address (DA) is performed. This scenario results in one of the following outcomes:",
      "ja": "通常のイーサネットPW用PBBパケットの例はMPLSコアネットワークからMPLSパケットがPBB-VPLS PEによって受信される図3の右側に示されています。 PEのPWフォワーダ機能は、B成分の仮想インターフェースIDを導出するためにPWラベルを使用し、その後、PSNとPWカプセル化を除去した後、それはB成分にパケットを渡します。そこにから、処理および転送は、バックボーンMAC（B-MAC）宛先アドレス（DA）に基づいて、ブリッジが実行される[PBB]、に従って行われます。このシナリオでは、次の結果の1のような結果になります。"
    },
    {
      "indent": 3,
      "text": "1. The packet is forwarded to a physical interface on the B-component. In this case, the PBB Ethernet frame is forwarded as is.",
      "ja": "1.パケットは、B成分の物理インターフェイスに転送されます。この場合、PBBイーサネットフレームであるとして転送されます。"
    },
    {
      "indent": 3,
      "text": "2. The packet is forwarded to a virtual interface on the B-component. This is not typically the case, because of a single split-horizon group within a VPLS instance; however, if there is more than one split-horizon group, then such forwarding takes place. In this case, the PW Forwarder module adds the PSN and PW labels before sending the packet out.",
      "ja": "2.パケットは、B成分上の仮想インターフェイスに転送されます。これは、VPLSインスタンス内の単一のスプリットホライズン基の、典型的には当てはまりません。複数のスプリットホライズングループがある場合は、そのような転送が行われます。この場合、PWフォワーダモジュールは、パケットを送信する前にPSNとPWラベルを追加します。"
    },
    {
      "indent": 3,
      "text": "3. The packet is forwarded toward the access side via one of the I-tagged service interfaces connected to the corresponding I-components. In this case, the I-component removes the B-MAC header according to [PBB] and bridges the packet using the C-MAC DA.",
      "ja": "3.パケットは、対応するI-コンポーネントに接続されたI-タグ付けされたサービス・インターフェースのうちの1つを介してアクセス側に転送されます。この場合、I成分は[PBB]に従ってB-MACヘッダを除去し、C-MAC DAを使用してパケットをブリッジします。"
    },
    {
      "indent": 3,
      "text": "If the destination B-MAC is an unknown MAC address or a Group MAC address (multicast or broadcast), then the B-component floods the packet to one or more of the three destinations described above.",
      "ja": "宛先B-MACが未知のMACアドレス又はグループMACアドレス（マルチキャストまたはブロードキャスト）である場合、B成分は、上述した3つの目的地の1つ以上にパケットをフラッディング。"
    },
    {
      "indent": 0,
      "text": "5. Control Plane",
      "section_title": true,
      "ja": "5.コントロールプレーン"
    },
    {
      "indent": 3,
      "text": "The control-plane procedures described in [RFC6074], [RFC4761], and [RFC4762] can be reused in a PBB-VPLS to set up the PW infrastructure in the service provider and/or customer bridging space. This allows porting the existing control-plane procedures (e.g., BGP Auto-Discovery (BGP-AD), PW setup, VPLS MAC flushing, PW OAM) for each domain.",
      "ja": "[RFC6074]、[RFC4761]及び[RFC4762]で説明した制御プレーンの手順は、サービス・プロバイダおよび/または顧客ブリッジ空間内PWインフラストラクチャをセットアップするPBB-VPLSで再利用することができます。これは、各ドメインの既存の制御プレーンの手順（例えば、BGP自動検出（BGP-AD）、PWセットアップ、VPLS MACフラッシング、PW OAM）を移植可能にします。"
    },
    {
      "indent": 0,
      "text": "6. Efficient Packet Replication in PBB VPLS",
      "section_title": true,
      "ja": "PBB VPLS 6.効率的なパケットレプリケーション"
    },
    {
      "indent": 3,
      "text": "The PBB VPLS architecture takes advantage of the existing VPLS features addressing packet replication efficiency. The H-VPLS hierarchy may be used in both customer and backbone service instances to reduce the redundant distribution of packets over the core. IGMP and PIM snooping may be applied on a \"per customer service instance\" basis to control the distribution of the multicast traffic to non-member sites.",
      "ja": "PBB VPLSアーキテクチャは、パケットの複製効率を扱う既存のVPLS機能を利用しています。 H-VPLSの階層は、コア上でパケットの冗長な分布を減少させるために、顧客とバックボーンの両方のサービスインスタンスで使用することができます。 IGMPおよびPIMスヌーピングは、非会員サイトへのマルチキャストトラフィックの配信を制御するために、「顧客サービスのインスタンスごとに」単位で適用することができます。"
    },
    {
      "indent": 3,
      "text": "[IEEE-802.1Q] specifies the use of the Multiple MAC Registration Protocol (MMRP) for flood containment in the backbone instances. The same solution can be ported in the PBB-VPLS solution.",
      "ja": "[IEEE-802.1Q]は、バックボーンインスタンスの洪水封じ込めのための複数のMAC登録プロトコル（MMRP）の使用を指定します。同ソリューションは、PBB-VPLS溶液に移植することができます。"
    },
    {
      "indent": 3,
      "text": "Further optimizations of the packet replication in PBB-VPLS are out of the scope of this document.",
      "ja": "PBB-VPLSでのパケット複製のさらなる最適化は、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "7. PBB VPLS OAM",
      "section_title": true,
      "ja": "7. PBB VPLS OAM"
    },
    {
      "indent": 3,
      "text": "The existing VPLS, PW, and MPLS OAM procedures may be used in each customer service instance or backbone service instance to verify the status of the related connectivity components.",
      "ja": "既存のVPLS、PW、およびMPLS OAM手順は、関連する接続コンポーネントの状態を確認するために、各顧客サービス・インスタンスまたはバックボーン・サービス・インスタンスに使用することができます。"
    },
    {
      "indent": 3,
      "text": "PBB OAM procedures make use of the IEEE Ethernet Connectivity Fault Management [CFM] and ITU-T Y.1731 [Y.1731] tools in both I-components and B-components.",
      "ja": "PBB OAM手順は、I成分およびB-成分の両方におけるIEEEイーサネット接続障害管理[CFM]とITU-T Y.1731 [Y.1731]ツールを利用します。"
    },
    {
      "indent": 3,
      "text": "Both sets of tools (PBB and VPLS) may be used for the combined PBB-VPLS solution.",
      "ja": "ツール（PBBおよびVPLS）の両方のセットを合わせPBB-VPLSの溶液のために使用することができます。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "No new security issues are introduced beyond those described in [RFC4761] and [RFC4762].",
      "ja": "新たなセキュリティ問題は[RFC4761]と[RFC4762]に記載されているものを超えて導入されていません。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC4761] Kompella, K., Ed., and Y. Rekhter, Ed., \"Virtual Private LAN Service (VPLS) Using BGP for Auto-Discovery and Signaling\", RFC 4761, January 2007.",
      "ja": "[RFC4761] Kompella、K.、エド。、およびY. Rekhter、エド。、 \"仮想プライベートLANサービス（VPLS）自動検出およびシグナリングのためにBGPを使用する\"、RFC 4761、2007年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4762] Lasserre, M., Ed., and V. Kompella, Ed., \"Virtual Private LAN Service (VPLS) Using Label Distribution Protocol (LDP) Signaling\", RFC 4762, January 2007.",
      "ja": "[RFC4762] Lasserre、M.、エド。、およびV. Kompella、エド。、 \"仮想プライベートLANサービス（VPLS）ラベル配布プロトコル（LDP）シグナリングの使用\"、RFC 4762、2007年1月を。"
    },
    {
      "indent": 3,
      "text": "[RFC6074] Rosen, E., Davie, B., Radoaca, V., and W. Luo, \"Provisioning, Auto-Discovery, and Signaling in Layer 2 Virtual Private Networks (L2VPNs)\", RFC 6074, January 2011.",
      "ja": "[RFC6074]ローゼン、E.、デイビー、B.、Radoaca、V.、およびW.羅、 \"プロビジョニング、自動検出、およびレイヤ2個の仮想プライベートネットワーク（のL2VPN）をシグナリング\"、RFC 6074、2011年1月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3985] Bryant, S., Ed., and P. Pate, Ed., \"Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture\", RFC 3985, March 2005.",
      "ja": "[RFC3985]ブライアント、S.、エド。、およびP.パテ、エド。、 \"疑似ワイヤーエミュレーション端から端まで（PWE3）アーキテクチャ\"、RFC 3985、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4664] Andersson, L., Ed., and E. Rosen, Ed., \"Framework for Layer 2 Virtual Private Networks (L2VPNs)\", RFC 4664, September 2006.",
      "ja": "[RFC4664]アンデション、L.、エド。、およびE.ローゼン、エド。、RFC 4664 \"レイヤ2個の仮想プライベートネットワーク（のL2VPN）のためのフレームワーク\"、2006年9月。"
    },
    {
      "indent": 3,
      "text": "[PBB] Clauses 25 and 26 of \"IEEE Standard for Local and metropolitan area networks - Media Access Control (MAC) Bridges and Virtual Bridged Local Area Networks\", IEEE Std 802.1Q-REV, 2013.",
      "ja": "[PBB]句25と「ローカルおよびメトロポリタンエリアネットワークのためのIEEE規格 - メディアアクセス制御（MAC）ブリッジと仮想ブリッジローカルエリアネットワーク」の26、IEEE 802.1Q STD-REV、2013。"
    },
    {
      "indent": 3,
      "text": "[PB] Clauses 15 and 16 of \"IEEE Standard for Local and metropolitan area networks - Media Access Control (MAC) Bridges and Virtual Bridged Local Area Networks\", IEEE Std 802.1Q-REV, 2013.",
      "ja": "[PB]句15と「ローカルおよびメトロポリタンエリアネットワークのためのIEEE規格 - メディアアクセス制御（MAC）ブリッジと仮想ブリッジローカルエリアネットワーク」の16、IEEE 802.1Q STD-REV、2013。"
    },
    {
      "indent": 3,
      "text": "[CFM] CFM clauses of \"IEEE Standard for Local and metropolitan area networks - Media Access Control (MAC) Bridges and Virtual Bridged Local Area Networks\", IEEE Std 802.1Q-REV, 2013.",
      "ja": "[CFM]「地方とメトロポリタンエリアネットワークのためのIEEE規格 - メディアアクセス制御（MAC）ブリッジと仮想ブリッジローカルエリアネットワーク」のCFM句、IEEE 802.1Q STD-REV、2013。"
    },
    {
      "indent": 3,
      "text": "[IEEE-802.1Q] \"IEEE Standard for Local and metropolitan area networks - Media Access Control (MAC) Bridges and Virtual Bridged Local Area Networks\", IEEE Std 802.1Q-REV, 2013.",
      "ja": "[IEEE-802.1Q] \"ローカルおよびメトロポリタンエリアネットワークのためのIEEE規格 - メディアアクセス制御（MAC）ブリッジと仮想ブリッジローカルエリアネットワーク\"、IEEE 802.1Q STD-REV、2013。"
    },
    {
      "indent": 3,
      "text": "[Y.1731] ITU-T Recommendation Y.1731, \"OAM functions and mechanisms for Ethernet based networks\", July 2011.",
      "ja": "2011年7月[Y.1731] ITU-T勧告Y.1731、 \"イーサネットベースのネットワークのためのOAM機能およびメカニズム\"。"
    },
    {
      "indent": 3,
      "text": "[RFC4026] Andersson, L. and T. Madsen, \"Provider Provisioned Virtual Private Network (VPN) Terminology\", RFC 4026, March 2005.",
      "ja": "[RFC4026]アンデションとL.とT.マドセン、 \"プロバイダーのプロビジョニングされた仮想プライベートネットワーク（VPN）用語\"、RFC 4026、2005月。"
    },
    {
      "indent": 0,
      "text": "10. Contributors",
      "section_title": true,
      "ja": "10.協力者"
    },
    {
      "indent": 3,
      "text": "The following people made significant contributions to this document:",
      "ja": "次の人は、このドキュメントへの重要な貢献をしました。"
    },
    {
      "indent": 6,
      "text": "Matthew Bocci Alcatel-Lucent Voyager Place Shoppenhangers Road Maidenhead Berks, UK",
      "ja": "マシューボッチアルカテル・ルーセントボイジャー場所Shoppenhangers道路メイデンヘッドバークス、英国"
    },
    {
      "indent": 6,
      "text": "EMail: matthew.bocci@alcatel-lucent.com",
      "ja": "メールアドレス：matthew.bocci@alcatel-lucent.com"
    },
    {
      "indent": 6,
      "text": "Raymond Zhang Alcatel-Lucent",
      "ja": "レイモンド・チャンアルカテル・ルーセント"
    },
    {
      "indent": 6,
      "text": "EMail: raymond.zhang@alcatel.com",
      "ja": "メールアドレス：raymond.zhang@alcatel.com"
    },
    {
      "indent": 6,
      "text": "Geraldine Calvignac Orange 2, avenue Pierre-Marzin 22307 Lannion Cedex France",
      "ja": "ジェラルディンCalvignacオレンジ2、大通りピエールMarzin 22307ラニオンセデックスフランス"
    },
    {
      "indent": 6,
      "text": "EMail: geraldine.calvignac@orange.com",
      "ja": "メールアドレス：geraldine.calvignac@orange.com"
    },
    {
      "indent": 6,
      "text": "John Hoffmans KPN Regulusweg 1 2516 AC Den Haag The Netherlands",
      "ja": "ジョン・ホフマンKPN Regulusweg 1 2516 ACハーグ、ネザーランズ"
    },
    {
      "indent": 6,
      "text": "EMail: john.hoffmans@kpn.com",
      "ja": "メールアドレス：john.hoffmans@kpn.com"
    },
    {
      "indent": 6,
      "text": "Olen Stokes Extreme Networks PO Box 14129 RTP, NC 27709 USA",
      "ja": "オレンストークスエクストリームネットワーク私書箱14129 RTP、NC 27709 USA"
    },
    {
      "indent": 6,
      "text": "EMail: ostokes@extremenetworks.com",
      "ja": "メールアドレス：ostokes@extremenetworks.com"
    },
    {
      "indent": 0,
      "text": "11. Acknowledgments",
      "section_title": true,
      "ja": "11.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Wim Henderickx, Mustapha Aissaoui, Dimitri Papadimitriou, Pranjal Dutta, Jorge Rabadan, Maarten Vissers, and Don Fedyk for their insightful comments and probing questions.",
      "ja": "作者は彼らの洞察に満ちたコメントやプロービングの質問のためにヴィム・ヘンデリック、ムスタファAissaoui、ディミトリPapadimitriou、Pranjal Duttaさん、ホルヘRabadan、マールテンVissers、とドンFedykに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Florin Balus (editor) Alcatel-Lucent 701 E. Middlefield Road Mountain View, CA 94043 USA",
      "ja": "フローリンBalus（編集者）アルカテル・ルーセント701 E.ミドルロード、マウンテンビュー、CA 94043 USA"
    },
    {
      "indent": 3,
      "text": "EMail: florin.balus@alcatel-lucent.com",
      "ja": "メールアドレス：florin.balus@alcatel-lucent.com"
    },
    {
      "indent": 3,
      "text": "Ali Sajassi (editor) Cisco 170 West Tasman Drive San Jose, CA 95134 USA",
      "ja": "アリSajassi（エディタ）のCisco 170西タスマン・ドライブサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: sajassi@cisco.com",
      "ja": "メールアドレス：sajassi@cisco.com"
    },
    {
      "indent": 3,
      "text": "Nabil Bitar (editor) Verizon 60 Sylvan Road Waltham, MA 02145 USA",
      "ja": "ナビル・ビタール（編集者）、ベライゾン60シルバンロードウォルサム、MA 02145 USA"
    },
    {
      "indent": 3,
      "text": "EMail: nabil.n.bitar@verizon.com",
      "ja": "メールアドレス：nabil.n.bitar@verizon.com"
    }
  ]
}