{
  "title": {
    "text": "RFC 7420 - Path Computation Element Communication Protocol (PCEP) Management Information Base (MIB) Module",
    "ja": "RFC 7420 - パス計算要素通信プロトコル（PCEP）管理情報ベース（MIB）モジュール"
  },
  "number": 7420,
  "created_at": "2020-09-02 18:30:32.616718+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        A. Koushik\nRequest for Comments: 7420                  Brocade Communications, Inc.\nCategory: Standards Track                                     E. Stephan\nISSN: 2070-1721                                                   Orange\n                                                                 Q. Zhao\n                                                       Huawei Technology\n                                                                 D. King\n                                                      Old Dog Consulting\n                                                             J. Hardwick\n                                                              Metaswitch\n                                                           December 2014",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "Path Computation Element Communication Protocol (PCEP) Management Information Base (MIB) Module",
      "ja": "パス計算要素通信プロトコル（PCEP）管理情報ベース（MIB）モジュール"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes managed objects for modeling of the Path Computation Element Communication Protocol (PCEP) for communications between a Path Computation Client (PCC) and a Path Computation Element (PCE), or between two PCEs.",
      "ja": "このメモは、インターネットコミュニティのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、経路計算クライアント（PCC）と経路計算要素（PCE）の間、または2つのPCEの間の通信のための経路計算要素通信プロトコル（PCEP）のモデリングのための管理対象オブジェクトについて説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはInternet Standards Trackドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。インターネット標準の詳細については、RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7420.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7420で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2014 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象であり、この文書の発行日に有効です。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  Requirements Language . . . . . . . . . . . . . . . . . .   3\n  1.2.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  The Internet-Standard Management Framework  . . . . . . . . .   4\n3.  PCEP MIB Module Architecture  . . . . . . . . . . . . . . . .   4\n  3.1.  pcePcepEntityTable  . . . . . . . . . . . . . . . . . . .   4\n  3.2.  pcePcepPeerTable  . . . . . . . . . . . . . . . . . . . .   5\n  3.3.  pcePcepSessTable  . . . . . . . . . . . . . . . . . . . .   5\n  3.4.  PCEP Notifications  . . . . . . . . . . . . . . . . . . .   6\n  3.5.  Relationship to Other MIB Modules . . . . . . . . . . . .   6\n  3.6.  Illustrative Example  . . . . . . . . . . . . . . . . . .   7\n4.  Object Definitions  . . . . . . . . . . . . . . . . . . . . .   8\n  4.1.  PCE-PCEP-MIB  . . . . . . . . . . . . . . . . . . . . . .   8\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .  49\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  50\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  50\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .  50\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .  51\nAppendix A.  PCEP MIB Module Example  . . . . . . . . . . . . . .  52\n  A.1.  Contents of PCEP MIB Module at PCE2 . . . . . . . . . . .  53\n  A.2.  Contents of PCEP MIB Module at PCCb . . . . . . . . . . .  60\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  64\nContributors  . . . . . . . . . . . . . . . . . . . . . . . . . .  64\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  65",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The PCE defined in [RFC4655] is an entity that is capable of computing a network path or route based on a network graph and applying computational constraints. A PCC may make requests to a PCE for paths to be computed.",
      "ja": "[RFC4655]で定義されているPCEは、ネットワークグラフに基づいてネットワークパスまたはルートを計算し、計算の制約を適用できるエンティティです。 PCCは、計算するパスをPCEに要求できます。"
    },
    {
      "indent": 3,
      "text": "PCEP is the communication protocol between a PCC and PCE and is defined in [RFC5440]. PCEP interactions include path computation requests and path computation replies as well as notifications of specific states related to the use of a PCE in the context of Multiprotocol Label Switching (MPLS) and Generalized MPLS (GMPLS) Traffic Engineering (TE).",
      "ja": "PCEPは、PCCとPCE間の通信プロトコルであり、[RFC5440]で定義されています。 PCEPの相互作用には、パス計算要求とパス計算応答、およびマルチプロトコルラベルスイッチング（MPLS）と汎用MPLS（GMPLS）トラフィックエンジニアリング（TE）のコンテキストでのPCEの使用に関連する特定の状態の通知が含まれます。"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the MIB for use with network management protocols in the Internet community. In particular, it defines a MIB module that can be used to monitor PCEP interactions between a PCC and a PCE, or between two PCEs.",
      "ja": "このメモは、インターネットコミュニティのネットワーク管理プロトコルで使用するMIBの一部を定義しています。特に、PCCとPCE間、または2つのPCE間のPCEP相互作用を監視するために使用できるMIBモジュールを定義します。"
    },
    {
      "indent": 3,
      "text": "The scope of this document is to provide a MIB module for the PCEP base protocol defined in [RFC5440]. Extensions to the PCEP base protocol are beyond the scope for this document.",
      "ja": "このドキュメントの範囲は、[RFC5440]で定義されているPCEPベースプロトコル用のMIBモジュールを提供することです。 PCEPベースプロトコルへの拡張は、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "ja": "1.1. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\" and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、「OPTIONAL」は、 BCP 14 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.2. Terminology",
      "section_title": true,
      "ja": "1.2. 用語"
    },
    {
      "indent": 3,
      "text": "This document uses the terminology defined in [RFC4655] and [RFC5440]. In particular, it uses the following acronyms.",
      "ja": "このドキュメントでは、[RFC4655]と[RFC5440]で定義されている用語を使用しています。特に、次の頭字語を使用しています。"
    },
    {
      "indent": 3,
      "text": "o Path Computation Request (PCReq) message.",
      "ja": "o パス計算要求（PCReq）メッセージ。"
    },
    {
      "indent": 3,
      "text": "o Path Computation Reply (PCRep) message.",
      "ja": "o パス計算応答（PCRep）メッセージ。"
    },
    {
      "indent": 3,
      "text": "o Notification (PCNtf) message.",
      "ja": "o 通知（PCNtf）メッセージ。"
    },
    {
      "indent": 3,
      "text": "o Error (PCErr) message.",
      "ja": "o エラー（PCErr）メッセージ。"
    },
    {
      "indent": 3,
      "text": "o Request Parameter (RP) object.",
      "ja": "o リクエストパラメータ（RP）オブジェクト。"
    },
    {
      "indent": 3,
      "text": "o Synchronization Vector (SVEC) object.",
      "ja": "o 同期ベクトル（SVEC）オブジェクト。"
    },
    {
      "indent": 3,
      "text": "o Explicit Route Object (ERO).",
      "ja": "o 明示的ルートオブジェクト（ERO）。"
    },
    {
      "indent": 3,
      "text": "This document uses the term \"PCEP entity\" to refer to a local PCEP speaker, \"peer\" to refer to a remote PCEP speaker, and \"PCEP speaker\" where it is not necessary to distinguish between local and remote.",
      "ja": "このドキュメントでは、「PCEPエンティティ」という用語をローカルPCEPスピーカーを指し、「ピア」をリモートPCEPスピーカーを指し、「PCEPスピーカー」はローカルとリモートを区別する必要がない場合に使用します。"
    },
    {
      "indent": 0,
      "text": "2. The Internet-Standard Management Framework",
      "section_title": true,
      "ja": "2. インターネット標準の管理フレームワーク"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "ja": "現在のインターネット標準管理フレームワークを説明するドキュメントの詳細な概要については、RFC 3410 [RFC3410]のセクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579], and STD 58, RFC 2580 [RFC2580].",
      "ja": "管理対象オブジェクトは、管理情報ベースまたはMIBと呼ばれる仮想情報ストアを介してアクセスされます。 MIBオブジェクトには、通常、簡易ネットワーク管理プロトコル（SNMP）を介してアクセスします。 MIB内のオブジェクトは、管理情報の構造（SMI）で定義されたメカニズムを使用して定義されます。このメモは、SMIv2に準拠するMIBモジュールを指定します。これは、STD 58、RFC 2578 [RFC2578]、STD 58、RFC 2579 [RFC2579]、およびSTD 58、RFC 2580 [RFC2580]で説明されています。"
    },
    {
      "indent": 0,
      "text": "3. PCEP MIB Module Architecture",
      "section_title": true,
      "ja": "3. PCEP MIBモジュールアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "The PCEP MIB module contains the following information:",
      "ja": "PCEP MIBモジュールには、次の情報が含まれています。"
    },
    {
      "indent": 3,
      "text": "a. PCE and PCC local entity status (see pcePcepEntityTable).",
      "ja": "a. PCEおよびPCCローカルエンティティのステータス（pcePcepEntityTableを参照）。"
    },
    {
      "indent": 3,
      "text": "b. PCEP peer information (see pcePcepPeerTable).",
      "ja": "b. PCEPピア情報（pcePcepPeerTableを参照）。"
    },
    {
      "indent": 3,
      "text": "c. PCEP session information (see pcePcepSessTable).",
      "ja": "c. PCEPセッション情報（pcePcepSessTableを参照）。"
    },
    {
      "indent": 3,
      "text": "d. Notifications to indicate PCEP session changes.",
      "ja": "d. PCEPセッションの変更を示す通知。"
    },
    {
      "indent": 3,
      "text": "The PCEP MIB module is limited to \"read-only\" access except for pcePcepNotificationsMaxRate, which is used to throttle the rate at which the implementation generates notifications.",
      "ja": "PCEP MIBモジュールは、実装が通知を生成するレートを調整するために使用されるpcePcepNotificationsMaxRateを除いて、「読み取り専用」アクセスに制限されています。"
    },
    {
      "indent": 0,
      "text": "3.1. pcePcepEntityTable",
      "section_title": true,
      "ja": "3.1. pcePcepEntityTable"
    },
    {
      "indent": 3,
      "text": "The PCEP MIB module may contain status information for multiple logical local PCEP entities. There are several scenarios in which there may be more than one local PCEP entity, including the following.",
      "ja": "PCEP MIBモジュールには、複数の論理ローカルPCEPエンティティのステータス情報が含まれる場合があります。以下を含む、複数のローカルPCEPエンティティが存在するシナリオがいくつかあります。"
    },
    {
      "indent": 3,
      "text": "o A physical router, which is partitioned into multiple virtual routers, each with its own PCC.",
      "ja": "o 物理ルーター。複数の仮想ルーターに分割され、それぞれに独自のPCCがあります。"
    },
    {
      "indent": 3,
      "text": "o A PCE device that front ends a cluster of compute resources, each with a different set of capabilities that are accessed via different IP addresses.",
      "ja": "o コンピューティングリソースのクラスターをフロントエンドするPCEデバイス。それぞれが異なるIPアドレスを介してアクセスされる異なる機能セットを備えています。"
    },
    {
      "indent": 3,
      "text": "The pcePcepEntityTable contains one row for each local PCEP entity. Each row is read-only and contains current status information, plus the PCEP entity's running configuration.",
      "ja": "pcePcepEntityTableには、ローカルPCEPエンティティごとに1行が含まれています。各行は読み取り専用で、現在のステータス情報に加えて、PCEPエンティティの実行構成が含まれています。"
    },
    {
      "indent": 3,
      "text": "The pcePcepEntityTable is indexed by pcePcepEntityIndex, which also acts as the primary index for the other tables in this MIB module.",
      "ja": "pcePcepEntityTableはpcePcepEntityIndexによってインデックスが付けられます。これは、このMIBモジュール内の他のテーブルのプライマリインデックスとしても機能します。"
    },
    {
      "indent": 0,
      "text": "3.2. pcePcepPeerTable",
      "section_title": true,
      "ja": "3.2. pcePcepPeerTable"
    },
    {
      "indent": 3,
      "text": "The pcePcepPeerTable contains one row for each peer that the local PCEP entity knows about. Each row is read-only and contains information to identify the peer, the running configuration relating to that peer, and statistics that track the messages exchanged with that peer and its response times.",
      "ja": "pcePcepPeerTableには、ローカルPCEPエンティティが認識しているピアごとに1つの行が含まれています。各行は読み取り専用で、ピアを識別するための情報、そのピアに関連する実行コンフィギュレーション、およびそのピアと交換されたメッセージとその応答時間を追跡する統計が含まれています。"
    },
    {
      "indent": 3,
      "text": "A PCEP speaker is identified by its IP address. If there is a PCEP speaker in the network that uses multiple IP addresses, then it looks like multiple distinct peers to the other PCEP speakers in the network.",
      "ja": "PCEPスピーカーはIPアドレスで識別されます。複数のIPアドレスを使用するPCEPスピーカーがネットワークにある場合、ネットワーク内の他のPCEPスピーカーに対して複数の異なるピアのように見えます。"
    },
    {
      "indent": 3,
      "text": "The pcePcepPeerTable is indexed first by pcePcepEntityIndex, then by pcePcepPeerAddrType and pcePcepPeerAddr. This indexing structure allows each local PCEP entity to report its own set of peers.",
      "ja": "pcePcepPeerTableには、最初にpcePcepEntityIndex、次にpcePcepPeerAddrTypeおよびpcePcepPeerAddrによってインデックスが付けられます。このインデックス構造により、各ローカルPCEPエンティティは独自のピアのセットを報告できます。"
    },
    {
      "indent": 3,
      "text": "Since PCEP sessions can be ephemeral, pcePcepPeerTable tracks a peer even when no PCEP session currently exists to that peer. The statistics contained in pcePcepPeerTable are an aggregate of the statistics for all successive sessions to that peer.",
      "ja": "PCEPセッションは一時的なものになる可能性があるため、現在そのピアにPCEPセッションが存在しない場合でも、pcePcepPeerTableはピアを追跡します。 pcePcepPeerTableに含まれる統計は、そのピアへのすべての連続したセッションの統計の集計です。"
    },
    {
      "indent": 3,
      "text": "To limit the quantity of information that is stored, an implementation MAY choose to discard a row from pcePcepPeerTable if and only if no PCEP session exists to the corresponding peer.",
      "ja": "保存される情報の量を制限するために、対応するピアへのPCEPセッションが存在しない場合にのみ、実装はpcePcepPeerTableから行を破棄することを選択できます（MAY）。"
    },
    {
      "indent": 0,
      "text": "3.3. pcePcepSessTable",
      "section_title": true,
      "ja": "3.3. pcePcepSessTable"
    },
    {
      "indent": 3,
      "text": "The pcePcepSessTable contains one row for each PCEP session that the PCEP entity (PCE or PCC) is currently participating in. Each row is read-only and contains the running configuration that is applied to the session, plus identifiers and statistics for the session.",
      "ja": "pcePcepSessTableには、PCEPエンティティ（PCEまたはPCC）が現在参加しているPCEPセッションごとに1行が含まれます。各行は読み取り専用であり、セッションに適用される実行中の構成に加えて、セッションの識別子と統計情報が含まれます。"
    },
    {
      "indent": 3,
      "text": "The statistics in pcePcepSessTable are semantically different from those in pcePcepPeerTable since the former applies to the current session only, whereas the latter is the aggregate for all sessions that have existed to that peer.",
      "ja": "前者は現在のセッションにのみ適用され、後者はそのピアに存在していたすべてのセッションの集計であるため、pcePcepSessTableの統計はpcePcepPeerTableの統計と意味的に異なります。"
    },
    {
      "indent": 0,
      "text": " Although it is forbidden per [RFC5440] to have more than one active PCEP session between a given pair of PCEP entities at any one time, there is a window during session establishment where the pcePcepSessTable may contain two rows for a given peer, one representing a session initiated by the local PCEP entity and one representing a session initiated by the peer. If either of these sessions reaches an active state, then the other is discarded.",
      "ja": "[RFC5440]では、PCEPエンティティの特定のペア間で一度に複数のアクティブなPCEPセッションを持つことは禁止されていますが、セッションの確立中に、pcePcepSessTableに特定のピアの2つの行が含まれるウィンドウがあります。ローカルPCEPエンティティによって開始されたセッションと、ピアによって開始されたセッションを表すセッション。これらのセッションのいずれかがアクティブ状態になると、もう一方は破棄されます。"
    },
    {
      "indent": 3,
      "text": "The pcePcepSessTable is indexed first by pcePcepEntityIndex, then by pcePcepPeerAddrType and pcePcepPeerAddr, and finally by pcePcepSessInitiator. This indexing structure allows each local PCEP entity to report its own set of active sessions. The pcePcepSessInitiator index allows two rows to exist transiently for a given peer, as discussed above.",
      "ja": "pcePcepSessTableには、最初にpcePcepEntityIndex、次にpcePcepPeerAddrTypeおよびpcePcepPeerAddr、最後にpcePcepSessInitiatorによってインデックスが作成されます。このインデックス構造により、各ローカルPCEPエンティティは独自のアクティブセッションのセットを報告できます。上記で説明したように、pcePcepSessInitiatorインデックスを使用すると、特定のピアに対して2つの行を一時的に存在させることができます。"
    },
    {
      "indent": 0,
      "text": "3.4. PCEP Notifications",
      "section_title": true,
      "ja": "3.4. PCEP通知"
    },
    {
      "indent": 3,
      "text": "The PCEP MIB module contains notifications for the following conditions.",
      "ja": "PCEP MIBモジュールには、次の条件の通知が含まれています。"
    },
    {
      "indent": 3,
      "text": "a. pcePcepSessUp: PCEP session has gone up.",
      "ja": "a. pcePcepSessUp：PCEPセッションが上がりました。"
    },
    {
      "indent": 3,
      "text": "b. pcePcepSessDown: PCEP session has gone down.",
      "ja": "b. pcePcepSessDown：PCEPセッションがダウンしました。"
    },
    {
      "indent": 3,
      "text": "c. pcePcepSessLocalOverload: Local PCEP entity has sent an overload PCNtf on this session.",
      "ja": "c. pcePcepSessLocalOverload：ローカルPCEPエンティティがこのセッションで過負荷PCNtfを送信しました。"
    },
    {
      "indent": 3,
      "text": "d. pcePcepSessLocalOverloadClear: Local PCEP entity has sent an overload-cleared PCNtf on this session.",
      "ja": "d. pcePcepSessLocalOverloadClear：ローカルPCEPエンティティがこのセッションで過負荷クリアされたPCNtfを送信しました。"
    },
    {
      "indent": 3,
      "text": "e. pcePcepSessPeerOverload: Peer has sent an overload PCNtf on this session.",
      "ja": "e. pcePcepSessPeerOverload：ピアがこのセッションで過負荷PCNtfを送信しました。"
    },
    {
      "indent": 3,
      "text": "f. pcePcepSessPeerOverloadClear: Peer has sent an overload-cleared PCNtf on this session.",
      "ja": "f. pcePcepSessPeerOverloadClear：ピアがこのセッションで過負荷クリアされたPCNtfを送信しました。"
    },
    {
      "indent": 0,
      "text": "3.5. Relationship to Other MIB Modules",
      "section_title": true,
      "ja": "3.5. 他のMIBモジュールとの関係"
    },
    {
      "indent": 3,
      "text": "The PCEP MIB module imports the following textual conventions from the INET-ADDRESS-MIB defined in RFC 4001 [RFC4001]:",
      "ja": "PCEP MIBモジュールは、RFC 4001 [RFC4001]で定義されているINET-ADDRESS-MIBから次のテキスト表記規則をインポートします。"
    },
    {
      "indent": 3,
      "text": "o InetAddressType",
      "ja": "o InetAddressType"
    },
    {
      "indent": 3,
      "text": "o InetAddress",
      "ja": "o InetAddress"
    },
    {
      "indent": 3,
      "text": "PCEP relies on existing protocols that have specialized MIB objects to monitor their own activities. Consequently, this document considers that the monitoring of underlying protocols is out of scope of the PCEP MIB module.",
      "ja": "PCEPは、専用のMIBオブジェクトを持つ既存のプロトコルに依存して、独自のアクティビティを監視します。したがって、このドキュメントでは、基礎となるプロトコルの監視はPCEP MIBモジュールの範囲外であると見なします。"
    },
    {
      "indent": 0,
      "text": "3.6. Illustrative Example",
      "section_title": true,
      "ja": "3.6. 実例"
    },
    {
      "indent": 3,
      "text": "The following diagram illustrates the relationships between pcePcepEntityTable, pcePcepPeerTable, and pcePcepSessTable.",
      "ja": "次の図は、pcePcepEntityTable、pcePcepPeerTable、およびpcePcepSessTableの関係を示しています。"
    },
    {
      "indent": 7,
      "text": "Index by: pcePcepEntityIndex",
      "ja": "索引付け：pcePcepEntityIndex"
    },
    {
      "indent": 7,
      "text": "+--------------+      Index by:\n|pcePcepEntity |      pcePcepEntityIndex,\n|Table         |      pcePcepPeerAddrType,\n+--------------+      pcePcepPeerAddr\n|pcePcepEntity |\n|Entry         |<----*\n+--------------+     |  +------------+    Index by:\n|              |     |  |pcePcepPeer |    pcePcepEntityIndex,\n|              |<-*  |  |Table       |    pcePcepPeerAddrType,\n+--------------+  |  |  +------------+    pcePcepPeerAddr,\n                  |  *--|PcePcepPeer |    pcePcepSessInitiator\n                  |  |  |Entry       |<-----*\n                  |  |  +------------+      | +------------+\n                  |  *--|            |      | |pcePcepSess |\n                  |     |            |<----*| |Table       |\n                  |     +------------+     || +------------+\n                  *-----|            |     |*-|pcePcepSess |\n                  |     |            |<--* |  |Entry       |\n                  |     +------------+   | |  +------------+\n                  *-----|            |   | *--|            |\n                        | [1]        |   |    |            |\n                        +------------+   |    +------------+\n                                         *----|            |\n                                         |    |            |\n                                         |    +------------+\n                                         *----| [2]        |\n                                              |            |\n                                              +------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "[1]: A peer entry with no current session. [2]: Two sessions exist during a window in session initialization.",
      "ja": "[1]：現在のセッションのないピアエントリ。 [2]：セッション初期化のウィンドウ中に2つのセッションが存在します。"
    },
    {
      "indent": 0,
      "text": "4. Object Definitions",
      "section_title": true,
      "ja": "4. オブジェクト定義"
    },
    {
      "indent": 0,
      "text": "4.1. PCE-PCEP-MIB",
      "section_title": true,
      "ja": "4.1. PCE-PCEP-MIB"
    },
    {
      "indent": 3,
      "text": "PCE-PCEP-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, mib-2, NOTIFICATION-TYPE, Unsigned32, Counter32 FROM SNMPv2-SMI -- RFC 2578 TruthValue, TimeStamp FROM SNMPv2-TC -- RFC 2579 MODULE-COMPLIANCE, OBJECT-GROUP, NOTIFICATION-GROUP FROM SNMPv2-CONF -- RFC 2580 InetAddressType, InetAddress FROM INET-ADDRESS-MIB; -- RFC 4001",
      "ja": "IMPORTS MODULE-IDENTITY、OBJECT-TYPE、mib-2、NOTIFICATION-TYPE、Unsigned32、Counter32 FROM SNMPv2-SMI-RFC 2578 TruthValue、TimeStamp FROM SNMPv2-TC-RFC 2579 MODULE-COMPLIANCE、OBJECT-GROUP、NOTIFICATION-GROUP FROM SNMPv2-CONF-RFC 2580 InetAddressType、InetAddress FROM INET-ADDRESS-MIB; -RFC 4001"
    },
    {
      "indent": 3,
      "text": "pcePcepMIB MODULE-IDENTITY\n    LAST-UPDATED\n        \"201412171200Z\" -- 17 December 2014\n    ORGANIZATION\n        \"IETF Path Computation Element (PCE) Working Group\"\n    CONTACT-INFO\n        \"Email: pce@ietf.org\n         WG charter:\n                  http://datatracker.ietf.org/wg/pce/charter/\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "DESCRIPTION \"This MIB module defines a collection of objects for managing the Path Computation Element Communication Protocol (PCEP).",
      "ja": "説明「このMIBモジュールは、Path Computation Element Communication Protocol（PCEP）を管理するためのオブジェクトのコレクションを定義します。"
    },
    {
      "indent": 10,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as authors of the code. All rights reserved.",
      "ja": "Copyright（c）2014 IETF Trustおよびコードの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 10,
      "text": "Redistribution and use in source and binary forms, with or without modification, is permitted pursuant to, and subject to the license terms contained in, the Simplified BSD License set forth in Section 4.c of the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info).\"",
      "ja": "ソースおよびバイナリ形式での再配布および使用は、変更の有無にかかわらず、IETFドキュメントに関連するIETFトラストの法的規定のセクション4.cに記載されているSimplified BSD Licenseに準拠し、それに含まれるライセンス条項に従って許可されます（ http://trustee.ietf.org/license-info）」"
    },
    {
      "indent": 7,
      "text": "REVISION\n    \"201412171200Z\" -- 17 December 2014\nDESCRIPTION\n    \"Initial version, published as RFC 7420.\"\n::= { mib-2 227 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepNotifications OBJECT IDENTIFIER ::= { pcePcepMIB 0 }\npcePcepObjects       OBJECT IDENTIFIER ::= { pcePcepMIB 1 }\npcePcepConformance   OBJECT IDENTIFIER ::= { pcePcepMIB 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-- -- PCEP Entity Objects --",
      "ja": "--PCEPエンティティオブジェクト-"
    },
    {
      "indent": 3,
      "text": "pcePcepEntityTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF PcePcepEntityEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table contains information about local PCEP entities.\n         The entries in this table are read-only.\"\n    ::= { pcePcepObjects 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityEntry OBJECT-TYPE\n    SYNTAX      PcePcepEntityEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This entry represents a local PCEP entity.\"\n    INDEX       {  pcePcepEntityIndex  }\n    ::= { pcePcepEntityTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   PcePcepEntityEntry ::= SEQUENCE {\n       pcePcepEntityIndex                Unsigned32,\n       pcePcepEntityAdminStatus          INTEGER,\n       pcePcepEntityOperStatus           INTEGER,\n       pcePcepEntityAddrType             InetAddressType,\n       pcePcepEntityAddr                 InetAddress,\n       pcePcepEntityConnectTimer         Unsigned32,\n       pcePcepEntityConnectMaxRetry      Unsigned32,\n       pcePcepEntityInitBackoffTimer     Unsigned32,\n       pcePcepEntityMaxBackoffTimer      Unsigned32,\n       pcePcepEntityOpenWaitTimer        Unsigned32,\n       pcePcepEntityKeepWaitTimer        Unsigned32,\n       pcePcepEntityKeepAliveTimer       Unsigned32,\n       pcePcepEntityDeadTimer            Unsigned32,\n       pcePcepEntityAllowNegotiation     TruthValue,\n       pcePcepEntityMaxKeepAliveTimer    Unsigned32,\n       pcePcepEntityMaxDeadTimer         Unsigned32,\n       pcePcepEntityMinKeepAliveTimer    Unsigned32,\n       pcePcepEntityMinDeadTimer         Unsigned32,\n       pcePcepEntitySyncTimer            Unsigned32,\n       pcePcepEntityRequestTimer         Unsigned32,\n       pcePcepEntityMaxSessions          Unsigned32,\n       pcePcepEntityMaxUnknownReqs       Unsigned32,\n       pcePcepEntityMaxUnknownMsgs       Unsigned32\n   }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityIndex OBJECT-TYPE\n    SYNTAX      Unsigned32\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This index is used to uniquely identify the PCEP entity.\"\n    ::= { pcePcepEntityEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityAdminStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                  adminStatusUp(1),\n                  adminStatusDown(2)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The administrative status of this PCEP entity.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "     This is the desired operational status as currently set by\n     an operator or by default in the implementation.  The value\n     of pcePcepEntityOperStatus represents the current status of\n     an attempt to reach this desired status.\"\n::= { pcePcepEntityEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityOperStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                  operStatusUp(1),\n                  operStatusDown(2),\n                  operStatusGoingUp(3),\n                  operStatusGoingDown(4),\n                  operStatusFailed(5),\n                  operStatusFailedPerm(6)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The operational status of the PCEP entity.  It takes one of\n         the following values.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "     - operStatusUp(1): the PCEP entity is active.\n     - operStatusDown(2): the PCEP entity is inactive.\n     - operStatusGoingUp(3): the PCEP entity is activating.\n     - operStatusGoingDown(4): the PCEP entity is deactivating.\n     - operStatusFailed(5): the PCEP entity has failed and will\n       recover when possible.\n     - operStatusFailedPerm(6): the PCEP entity has failed and\n       will not recover without operator intervention.\"\n::= { pcePcepEntityEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityAddrType OBJECT-TYPE\n    SYNTAX      InetAddressType\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The type of the PCEP entity's Internet address.  This object\n         specifies how the value of the pcePcepEntityAddr object\n         should be interpreted.  Only values unknown(0), ipv4(1), or\n         ipv6(2) are supported.\"\n    ::= { pcePcepEntityEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityAddr OBJECT-TYPE SYNTAX InetAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The local Internet address of this PCEP entity. The type is given by pcePcepEntityAddrType.",
      "ja": "pcePcepEntityAddr OBJECT-TYPE構文InetAddress MAX-ACCESS読み取り専用ステータス現在の説明「このPCEPエンティティのローカルインターネットアドレス。タイプはpcePcepEntityAddrTypeによって指定されます。"
    },
    {
      "indent": 12,
      "text": "If operating as a PCE server, the PCEP entity listens on this address. If operating as a PCC, the PCEP entity binds outgoing TCP connections to this address.",
      "ja": "PCEサーバーとして動作している場合、PCEPエンティティはこのアドレスをリッスンします。 PCCとして動作している場合、PCEPエンティティは発信TCP接続をこのアドレスにバインドします。"
    },
    {
      "indent": 7,
      "text": "     It is possible for the PCEP entity to operate both as a PCC\n     and a PCE server, in which case it uses this address both to\n     listen for incoming TCP connections and to bind outgoing\n     TCP connections.\"\n::= { pcePcepEntityEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   pcePcepEntityConnectTimer OBJECT-TYPE\n       SYNTAX      Unsigned32 (1..65535)\n       UNITS       \"seconds\"\n       MAX-ACCESS  read-only\n       STATUS      current\n       DESCRIPTION\n           \"The time that the PCEP entity will wait to establish a TCP\n            connection with a peer.  If a TCP connection is not\n            established within this time, then PCEP aborts the session\n            setup attempt.\"\n       ::= { pcePcepEntityEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityConnectMaxRetry OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The maximum number of times the system tries to establish a TCP connection to a peer before the session with the peer transitions to the idle state.",
      "ja": "pcePcepEntityConnectMaxRetry OBJECT-TYPE構文Unsigned32 MAX-ACCESS読み取り専用ステータス現在の説明「ピアとのセッションがアイドル状態に移行する前に、システムがピアへのTCP接続の確立を試行する最大回数。"
    },
    {
      "indent": 7,
      "text": "     When the session transitions to the idle state:\n     - pcePcepPeerSessionExists transitions to false(2).\n     - the associated PcePcepSessEntry is deleted.\n     - a backoff timer runs before the session is tried again.\"\n::= { pcePcepEntityEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityInitBackoffTimer OBJECT-TYPE SYNTAX Unsigned32 (1..65535) UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The initial backoff time for retrying a failed session setup attempt to a peer.",
      "ja": "pcePcepEntityInitBackoffTimer OBJECT-TYPE構文Unsigned32（1..65535）UNITS \"秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"失敗したセッションセットアップ試行をピアに再試行するための初期バックオフ時間。"
    },
    {
      "indent": 7,
      "text": "     The backoff time increases for each failed session setup\n     attempt, until a maximum backoff time is reached.  The\n     maximum backoff time is pcePcepEntityMaxBackoffTimer.\"\n::= { pcePcepEntityEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityMaxBackoffTimer OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The maximum backoff time for retrying a failed session setup attempt to a peer.",
      "ja": "pcePcepEntityMaxBackoffTimer OBJECT-TYPE構文Unsigned32 UNITS \"秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"失敗したセッションセットアップ試行をピアに再試行するための最大バックオフ時間。"
    },
    {
      "indent": 7,
      "text": "     The backoff time increases for each failed session setup\n     attempt, until this maximum value is reached.  Session\n     setup attempts then repeats periodically without any\n     further increase in backoff time.\"\n::= { pcePcepEntityEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityOpenWaitTimer OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..65535)\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The time that the PCEP entity will wait to receive an Open\n         message from a peer after the TCP connection has come up.\n         If no Open message is received within this time, then PCEP\n         terminates the TCP connection and deletes the associated\n         PcePcepSessEntry.\"\n    ::= { pcePcepEntityEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityKeepWaitTimer OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..65535)\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The time that the PCEP entity will wait to receive a\n         Keepalive or PCErr message from a peer during session\n         initialization after receiving an Open message.  If no\n         Keepalive or PCErr message is received within this time,\n         then PCEP terminates the TCP connection and deletes the\n         associated PcePcepSessEntry.\"\n    ::= { pcePcepEntityEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityKeepAliveTimer OBJECT-TYPE SYNTAX Unsigned32 (0..255) UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The Keepalive transmission timer that this PCEP entity will propose in the initial OPEN message of each session it is involved in. This is the maximum time between two consecutive messages sent to a peer. Zero means that the PCEP entity prefers not to send Keepalives at all.",
      "ja": "pcePcepEntityKeepAliveTimer OBJECT-TYPE構文Unsigned32（0..255）UNITS \"秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"このPCEPエンティティが関与する各セッションの最初のOPENメッセージで提案するキープアライブ送信タイマー。ピアに送信される2つの連続するメッセージ間の最大時間です。ゼロは、PCEPエンティティがキープアライブを送信しないことを選択したことを意味します。"
    },
    {
      "indent": 0,
      "text": "            Note that the actual Keepalive transmission intervals, in\n            either direction of an active PCEP session, are determined\n            by negotiation between the peers as specified by RFC\n            5440, and so may differ from this configured value.  For\n            the actually negotiated values (per session), see\n            pcePcepSessKeepaliveTimer and\n            pcePcepSessPeerKeepaliveTimer.\"\n       ::= { pcePcepEntityEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityDeadTimer OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..255)\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The DeadTimer that this PCEP entity will propose in the\n         initial OPEN message of each session it is involved in.\n         This is the time after which a peer should declare a\n         session down if it does not receive any PCEP messages.\n         Zero suggests that the peer does not run a DeadTimer at\n         all.\"\n    ::= { pcePcepEntityEntry 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityAllowNegotiation OBJECT-TYPE\n    SYNTAX      TruthValue\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"Whether the PCEP entity will permit negotiation of session\n         parameters.\"\n    ::= { pcePcepEntityEntry 14 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityMaxKeepAliveTimer OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..255)\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"In PCEP session parameter negotiation, the maximum value\n         that this PCEP entity will accept from a peer for the\n         interval between Keepalive transmissions.  Zero means that\n         the PCEP entity will allow no Keepalive transmission at\n         all.\"\n    ::= { pcePcepEntityEntry 15 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   pcePcepEntityMaxDeadTimer OBJECT-TYPE\n       SYNTAX      Unsigned32 (0..255)\n       UNITS       \"seconds\"\n       MAX-ACCESS  read-only\n       STATUS      current\n       DESCRIPTION\n           \"In PCEP session parameter negotiation, the maximum value\n            that this PCEP entity will accept from a peer for the\n            DeadTimer.  Zero means that the PCEP entity will allow not\n            running a DeadTimer.\"\n       ::= { pcePcepEntityEntry 16 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityMinKeepAliveTimer OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..255)\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"In PCEP session parameter negotiation, the minimum value\n         that this PCEP entity will accept for the interval between\n         Keepalive transmissions.  Zero means that the PCEP entity\n         insists on no Keepalive transmission at all.\"\n    ::= { pcePcepEntityEntry 17 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityMinDeadTimer OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..255)\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"In PCEP session parameter negotiation, the minimum value\n         that this PCEP entity will accept for the DeadTimer.  Zero\n         means that the PCEP entity insists on not running a\n         DeadTimer.\"\n    ::= { pcePcepEntityEntry 18 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntitySyncTimer OBJECT-TYPE SYNTAX Unsigned32 (0..65535) UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of SyncTimer is used in the case of a synchronized path computation request using the SVEC object.",
      "ja": "pcePcepEntitySyncTimer OBJECT-TYPE SYNTAX Unsigned32（0..65535）UNITS \"seconds\" MAX-ACCESS read-only STATUS current説明「SyncTimerの値は、SVECオブジェクトを使用した同期パス計算要求の場合に使用されます。"
    },
    {
      "indent": 12,
      "text": "Consider the case where a PCReq message is received by a PCE that contains the SVEC object referring to M synchronized path computation requests. If after the expiration of the SyncTimer all the M path computation requests have not been received, a protocol error is triggered and the PCE MUST cancel the whole set of path computation requests.",
      "ja": "PCReqメッセージが、M個の同期パス計算要求を参照するSVECオブジェクトを含むPCEによって受信された場合を考えます。 SyncTimerの満了後にすべてのMパス計算要求が受信されなかった場合、プロトコルエラーがトリガーされ、PCEはパス計算要求のセット全体をキャンセルする必要があります。"
    },
    {
      "indent": 12,
      "text": "The aim of the SyncTimer is to avoid the storage of unused synchronized requests should one of them get lost for some reason (for example, a misbehaving PCC).",
      "ja": "SyncTimerの目的は、未使用の同期要求が何らかの理由（たとえば、PCCの動作不良）で失われた場合に、未使用の同期要求の格納を回避することです。"
    },
    {
      "indent": 7,
      "text": "     A value of zero is returned if and only if the entity does\n     not use the SyncTimer.\"\n::= { pcePcepEntityEntry 19 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityRequestTimer OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..65535)\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The maximum time that the PCEP entity will wait for a\n         response to a PCReq message.\"\n    ::= { pcePcepEntityEntry 20 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityMaxSessions OBJECT-TYPE\n    SYNTAX      Unsigned32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The maximum number of sessions involving this PCEP entity\n         that can exist at any time.\"\n    ::= { pcePcepEntityEntry 21 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepEntityMaxUnknownReqs OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The maximum number of unrecognized requests and replies that any session on this PCEP entity is willing to accept per minute before terminating the session.",
      "ja": "pcePcepEntityMaxUnknownReqs OBJECT-TYPE構文Unsigned32 MAX-ACCESS読み取り専用ステータス現在の説明「このPCEPエンティティ上の任意のセッションがセッションを終了する前に1分あたり受け入れることを許可する、認識されない要求と応答の最大数。"
    },
    {
      "indent": 12,
      "text": "A PCRep message contains an unrecognized reply if it contains an RP object whose request ID does not correspond to any in-progress request sent by this PCEP entity.",
      "ja": "PCRepメッセージには、このPCEPエンティティによって送信された進行中の要求に対応しない要求IDを持つRPオブジェクトが含まれている場合、認識されない応答が含まれます。"
    },
    {
      "indent": 7,
      "text": "     A PCReq message contains an unrecognized request if it\n     contains an RP object whose request ID is zero.\"\n::= { pcePcepEntityEntry 22 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   pcePcepEntityMaxUnknownMsgs OBJECT-TYPE\n       SYNTAX      Unsigned32\n       MAX-ACCESS  read-only\n       STATUS      current\n       DESCRIPTION\n           \"The maximum number of unknown messages that any session\n            on this PCEP entity is willing to accept per minute before\n            terminating the session.\"\n       ::= { pcePcepEntityEntry 23 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-- -- The PCEP Peer Table --",
      "ja": "--PCEPピアテーブル-"
    },
    {
      "indent": 3,
      "text": "pcePcepPeerTable OBJECT-TYPE SYNTAX SEQUENCE OF PcePcepPeerEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This table contains information about peers known by the local PCEP entity. The entries in this table are read-only.",
      "ja": "pcePcepPeerTable OBJECT-TYPE構文シーケンスPcePcepPeerEntry MAX-ACCESSにアクセスできませんステータス現在の説明「このテーブルには、ローカルPCEPエンティティによって認識されているピアに関する情報が含まれています。このテーブルのエントリは読み取り専用です。"
    },
    {
      "indent": 7,
      "text": "     This table gives peer information that spans PCEP\n     sessions.  Information about current PCEP sessions can be\n     found in the pcePcepSessTable table.\"\n::= { pcePcepObjects 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerEntry OBJECT-TYPE\n    SYNTAX      PcePcepPeerEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"Information about a single peer that spans all PCEP\n         sessions to that peer.\"\n    INDEX { pcePcepEntityIndex,\n            pcePcepPeerAddrType,\n            pcePcepPeerAddr }\n    ::= { pcePcepPeerTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   PcePcepPeerEntry ::= SEQUENCE {\n       pcePcepPeerAddrType                 InetAddressType,\n       pcePcepPeerAddr                     InetAddress,\n       pcePcepPeerRole                     INTEGER,\n       pcePcepPeerDiscontinuityTime        TimeStamp,\n       pcePcepPeerInitiateSession          TruthValue,\n       pcePcepPeerSessionExists            TruthValue,\n       pcePcepPeerNumSessSetupOK           Counter32,\n       pcePcepPeerNumSessSetupFail         Counter32,\n       pcePcepPeerSessionUpTime            TimeStamp,\n       pcePcepPeerSessionFailTime          TimeStamp,\n       pcePcepPeerSessionFailUpTime        TimeStamp,\n       pcePcepPeerAvgRspTime               Unsigned32,\n       pcePcepPeerLWMRspTime               Unsigned32,\n       pcePcepPeerHWMRspTime               Unsigned32,\n       pcePcepPeerNumPCReqSent             Counter32,\n       pcePcepPeerNumPCReqRcvd             Counter32,\n       pcePcepPeerNumPCRepSent             Counter32,\n       pcePcepPeerNumPCRepRcvd             Counter32,\n       pcePcepPeerNumPCErrSent             Counter32,\n       pcePcepPeerNumPCErrRcvd             Counter32,\n       pcePcepPeerNumPCNtfSent             Counter32,\n       pcePcepPeerNumPCNtfRcvd             Counter32,\n       pcePcepPeerNumKeepaliveSent         Counter32,\n       pcePcepPeerNumKeepaliveRcvd         Counter32,\n       pcePcepPeerNumUnknownRcvd           Counter32,\n       pcePcepPeerNumCorruptRcvd           Counter32,\n       pcePcepPeerNumReqSent               Counter32,\n       pcePcepPeerNumSvecSent              Counter32,\n       pcePcepPeerNumSvecReqSent           Counter32,\n       pcePcepPeerNumReqSentPendRep        Counter32,\n       pcePcepPeerNumReqSentEroRcvd        Counter32,\n       pcePcepPeerNumReqSentNoPathRcvd     Counter32,\n       pcePcepPeerNumReqSentCancelRcvd     Counter32,\n       pcePcepPeerNumReqSentErrorRcvd      Counter32,\n       pcePcepPeerNumReqSentTimeout        Counter32,\n       pcePcepPeerNumReqSentCancelSent     Counter32,\n       pcePcepPeerNumReqSentClosed         Counter32,\n       pcePcepPeerNumReqRcvd               Counter32,\n       pcePcepPeerNumSvecRcvd              Counter32,\n       pcePcepPeerNumSvecReqRcvd           Counter32,\n       pcePcepPeerNumReqRcvdPendRep        Counter32,\n       pcePcepPeerNumReqRcvdEroSent        Counter32,\n       pcePcepPeerNumReqRcvdNoPathSent     Counter32,\n       pcePcepPeerNumReqRcvdCancelSent     Counter32,\n       pcePcepPeerNumReqRcvdErrorSent      Counter32,\n       pcePcepPeerNumReqRcvdCancelRcvd     Counter32,\n       pcePcepPeerNumReqRcvdClosed         Counter32,\n       pcePcepPeerNumRepRcvdUnknown        Counter32,\n       pcePcepPeerNumReqRcvdUnknown        Counter32\n   }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   pcePcepPeerAddrType OBJECT-TYPE\n       SYNTAX      InetAddressType\n       MAX-ACCESS  not-accessible\n       STATUS      current\n       DESCRIPTION\n           \"The type of the peer's Internet address.  This object\n            specifies how the value of the pcePcepPeerAddr object should\n            be interpreted.  Only values unknown(0), ipv4(1), or\n            ipv6(2) are supported.\"\n       ::= { pcePcepPeerEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerAddr OBJECT-TYPE\n    SYNTAX      InetAddress\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The Internet address of the peer.  The type is given by\n         pcePcepPeerAddrType.\"\n    ::= { pcePcepPeerEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerRole OBJECT-TYPE\n    SYNTAX      INTEGER {\n                  unknown(0),\n                  pcc(1),\n                  pce(2),\n                  pccAndPce(3)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The role that this peer took the last time a session was\n         established.  It takes one of the following values.\n         - unknown(0): this peer's role is not known.\n         - pcc(1): this peer is a Path Computation Client (PCC).\n         - pce(2): this peer is a Path Computation Element (PCE).\n         - pccAndPce(3): this peer is both a PCC and a PCE.\"\n    ::= { pcePcepPeerEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerDiscontinuityTime OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The value of sysUpTime at the time that the information and\n         statistics in this row were last reset.\"\n    ::= { pcePcepPeerEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   pcePcepPeerInitiateSession OBJECT-TYPE\n       SYNTAX      TruthValue\n       MAX-ACCESS  read-only\n       STATUS      current\n       DESCRIPTION\n           \"Indicates whether the local PCEP entity initiates sessions\n            to this peer or waits for the peer to initiate a session.\"\n       ::= { pcePcepPeerEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerSessionExists OBJECT-TYPE\n    SYNTAX      TruthValue\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"Indicates whether a session with this peer currently\n         exists.\"\n    ::= { pcePcepPeerEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumSessSetupOK OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCEP sessions successfully established with\n         the peer, including any current session.  This counter is\n         incremented each time a session with this peer is\n         successfully established.\"\n    ::= { pcePcepPeerEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumSessSetupFail OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCEP sessions with the peer that have been\n         attempted but failed before being fully established.\n         This counter is incremented each time a session retry to\n         this peer fails.\"\n    ::= { pcePcepPeerEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerSessionUpTime OBJECT-TYPE SYNTAX TimeStamp MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of sysUpTime the last time a session with this peer was successfully established.",
      "ja": "pcePcepPeerSessionUpTime OBJECT-TYPE構文TimeStamp MAX-ACCESS読み取り専用ステータス現在の説明「このピアとのセッションが最後に正常に確立されたときのsysUpTimeの値。"
    },
    {
      "indent": 7,
      "text": "     If pcePcepPeerNumSessSetupOK is zero, then this object\n     contains zero.\"\n::= { pcePcepPeerEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerSessionFailTime OBJECT-TYPE SYNTAX TimeStamp MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of sysUpTime the last time a session with this peer failed to be established.",
      "ja": "pcePcepPeerSessionFailTime OBJECT-TYPE構文TimeStamp MAX-ACCESS読み取り専用ステータス現在の説明「このピアとのセッションの確立に最後に失敗したときのsysUpTimeの値。"
    },
    {
      "indent": 7,
      "text": "     If pcePcepPeerNumSessSetupFail is zero, then this object\n     contains zero.\"\n::= { pcePcepPeerEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerSessionFailUpTime OBJECT-TYPE SYNTAX TimeStamp MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of sysUpTime the last time a session with this peer failed from active.",
      "ja": "pcePcepPeerSessionFailUpTime OBJECT-TYPE構文TimeStamp MAX-ACCESS読み取り専用ステータス現在の説明「このピアとのセッションが最後にアクティブから失敗したときのsysUpTimeの値。"
    },
    {
      "indent": 7,
      "text": "     If pcePcepPeerNumSessSetupOK is zero, then this object\n     contains zero.\"\n::= { pcePcepPeerEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerAvgRspTime OBJECT-TYPE SYNTAX Unsigned32 UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The average response time for this peer.",
      "ja": "pcePcepPeerAvgRspTime OBJECT-TYPE構文Unsigned32 UNITS \"ミリ秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"このピアの平均応答時間。"
    },
    {
      "indent": 12,
      "text": "If an average response time has not been calculated for this peer, then this object has the value zero.",
      "ja": "このピアの平均応答時間が計算されていない場合、このオブジェクトの値はゼロです。"
    },
    {
      "indent": 7,
      "text": "     If pcePcepPeerRole is pcc, then this field is meaningless\n     and is set to zero.\"\n::= { pcePcepPeerEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerLWMRspTime OBJECT-TYPE SYNTAX Unsigned32 UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The smallest (low-water mark) response time seen from this peer.",
      "ja": "pcePcepPeerLWMRspTime OBJECT-TYPE構文Unsigned32 UNITS \"ミリ秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"このピアから見た最小（最低水準点）応答時間。"
    },
    {
      "indent": 12,
      "text": "If no responses have been received from this peer, then this object has the value zero.",
      "ja": "このピアから応答を受信して​​いない場合、このオブジェクトの値はゼロです。"
    },
    {
      "indent": 7,
      "text": "     If pcePcepPeerRole is pcc, then this field is meaningless\n     and is set to zero.\"\n::= { pcePcepPeerEntry 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerHWMRspTime OBJECT-TYPE SYNTAX Unsigned32 UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The greatest (high-water mark) response time seen from this peer.",
      "ja": "pcePcepPeerHWMRspTime OBJECT-TYPE構文Unsigned32 UNITS \"ミリ秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"このピアから見た最大（最高水準点）応答時間。"
    },
    {
      "indent": 12,
      "text": "If no responses have been received from this peer, then this object has the value zero.",
      "ja": "このピアから応答を受信して​​いない場合、このオブジェクトの値はゼロです。"
    },
    {
      "indent": 7,
      "text": "     If pcePcepPeerRole is pcc, then this field is meaningless\n     and is set to zero.\"\n::= { pcePcepPeerEntry 14 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumPCReqSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCReq messages sent to this peer.\"\n    ::= { pcePcepPeerEntry 15 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumPCReqRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCReq messages received from this peer.\"\n    ::= { pcePcepPeerEntry 16 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumPCRepSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCRep messages sent to this peer.\"\n    ::= { pcePcepPeerEntry 17 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumPCRepRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCRep messages received from this peer.\"\n    ::= { pcePcepPeerEntry 18 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumPCErrSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCErr messages sent to this peer.\"\n    ::= { pcePcepPeerEntry 19 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumPCErrRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCErr messages received from this peer.\"\n    ::= { pcePcepPeerEntry 20 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumPCNtfSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCNtf messages sent to this peer.\"\n    ::= { pcePcepPeerEntry 21 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumPCNtfRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCNtf messages received from this peer.\"\n    ::= { pcePcepPeerEntry 22 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumKeepaliveSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of Keepalive messages sent to this peer.\"\n    ::= { pcePcepPeerEntry 23 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumKeepaliveRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of Keepalive messages received from this peer.\"\n    ::= { pcePcepPeerEntry 24 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumUnknownRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of unknown messages received from this peer.\"\n    ::= { pcePcepPeerEntry 25 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumCorruptRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of corrupted PCEP messages received from this\n         peer.\"\n    ::= { pcePcepPeerEntry 26 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqSent OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests sent to this peer. A request corresponds 1:1 with an RP object in a PCReq message.",
      "ja": "pcePcepPeerNumReqSent OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「このピアに送信されたリクエストの数。リクエストは、PCReqメッセージ内のRPオブジェクトと1：1で対応しています。"
    },
    {
      "indent": 7,
      "text": "     This might be greater than pcePcepPeerNumPCReqSent because\n     multiple requests can be batched into a single PCReq\n     message.\"\n::= { pcePcepPeerEntry 27 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumSvecSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of SVEC objects sent to this peer in PCReq\n         messages.  An SVEC object represents a set of synchronized\n         requests.\"\n    ::= { pcePcepPeerEntry 28 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumSvecReqSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests sent to this peer that appeared in\n         one or more SVEC objects.\"\n    ::= { pcePcepPeerEntry 29 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqSentPendRep OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests that have been sent to this peer for\n         which a response is still pending.\"\n    ::= { pcePcepPeerEntry 30 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqSentEroRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests that have been sent to this peer for\n         which a response with an ERO was\n         received.  Such responses indicate that a path was\n         successfully computed by the peer.\"\n    ::= { pcePcepPeerEntry 31 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqSentNoPathRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests that have been sent to this peer for\n         which a response with a NO-PATH object was received.  Such\n         responses indicate that the peer could not find a path to\n         satisfy the request.\"\n    ::= { pcePcepPeerEntry 32 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqSentCancelRcvd OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests that were canceled by the peer with a PCNtf message.",
      "ja": "pcePcepPeerNumReqSentCancelRcvd OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「PCNtfメッセージのあるピアによってキャンセルされたリクエストの数。"
    },
    {
      "indent": 7,
      "text": "     This might be different than pcePcepPeerNumPCNtfRcvd because\n     not all PCNtf messages are used to cancel requests, and a\n     single PCNtf message can cancel multiple requests.\"\n::= { pcePcepPeerEntry 33 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqSentErrorRcvd OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests that were rejected by the peer with a PCErr message.",
      "ja": "pcePcepPeerNumReqSentErrorRcvd OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「PCErrメッセージのあるピアによって拒否されたリクエストの数。"
    },
    {
      "indent": 7,
      "text": "     This might be different than pcePcepPeerNumPCErrRcvd because\n     not all PCErr messages are used to reject requests, and a\n     single PCErr message can reject multiple requests.\"\n::= { pcePcepPeerEntry 34 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqSentTimeout OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests that have been sent to a peer and\n         have been abandoned because the peer has taken too long to\n         respond to them.\"\n    ::= { pcePcepPeerEntry 35 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqSentCancelSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests that were sent to the peer and\n         explicitly canceled by the local PCEP entity sending a\n         PCNtf.\"\n    ::= { pcePcepPeerEntry 36 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqSentClosed OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests that were sent to the peer and\n         implicitly canceled when the session they were sent over was\n         closed.\"\n    ::= { pcePcepPeerEntry 37 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqRcvd OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests received from this peer. A request corresponds 1:1 with an RP object in a PCReq message.",
      "ja": "pcePcepPeerNumReqRcvd OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「このピアから受信した要求の数。要求は、PCReqメッセージ内のRPオブジェクトと1：1で対応しています。"
    },
    {
      "indent": 7,
      "text": "     This might be greater than pcePcepPeerNumPCReqRcvd because\n     multiple requests can be batched into a single PCReq\n     message.\"\n::= { pcePcepPeerEntry 38 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumSvecRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of SVEC objects received from this peer in PCReq\n         messages.  An SVEC object represents a set of synchronized\n         requests.\"\n    ::= { pcePcepPeerEntry 39 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumSvecReqRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests received from this peer that appeared\n         in one or more SVEC objects.\"\n    ::= { pcePcepPeerEntry 40 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqRcvdPendRep OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests that have been received from this\n         peer for which a response is still pending.\"\n    ::= { pcePcepPeerEntry 41 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   pcePcepPeerNumReqRcvdEroSent OBJECT-TYPE\n       SYNTAX      Counter32\n       MAX-ACCESS  read-only\n       STATUS      current\n       DESCRIPTION\n           \"The number of requests that have been received from this\n            peer for which a response with an ERO was sent.  Such\n            responses indicate that a path was successfully computed by\n            the local PCEP entity.\"\n       ::= { pcePcepPeerEntry 42 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqRcvdNoPathSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests that have been received from this\n         peer for which a response with a NO-PATH object was sent.\n         Such responses indicate that the local PCEP entity could\n         not find a path to satisfy the request.\"\n    ::= { pcePcepPeerEntry 43 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqRcvdCancelSent OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests received from this peer that were canceled by the local PCEP entity sending a PCNtf message.",
      "ja": "pcePcepPeerNumReqRcvdCancelSent OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「PCNtfメッセージを送信するローカルPCEPエンティティによってキャンセルされた、このピアから受信した要求の数。"
    },
    {
      "indent": 7,
      "text": "     This might be different than pcePcepPeerNumPCNtfSent because\n     not all PCNtf messages are used to cancel requests, and a\n     single PCNtf message can cancel multiple requests.\"\n::= { pcePcepPeerEntry 44 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqRcvdErrorSent OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests received from this peer that were rejected by the local PCEP entity sending a PCErr message.",
      "ja": "pcePcepPeerNumReqRcvdErrorSent OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「PCErrメッセージを送信するローカルPCEPエンティティによって拒否された、このピアから受信した要求の数。"
    },
    {
      "indent": 7,
      "text": "     This might be different than pcePcepPeerNumPCErrSent because\n     not all PCErr messages are used to reject requests, and a\n     single PCErr message can reject multiple requests.\"\n::= { pcePcepPeerEntry 45 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   pcePcepPeerNumReqRcvdCancelRcvd OBJECT-TYPE\n       SYNTAX      Counter32\n       MAX-ACCESS  read-only\n       STATUS      current\n       DESCRIPTION\n           \"The number of requests that were received from the peer and\n            explicitly canceled by the peer sending a PCNtf.\"\n       ::= { pcePcepPeerEntry 46 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqRcvdClosed OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests that were received from the peer and\n         implicitly canceled when the session they were received over\n         was closed.\"\n    ::= { pcePcepPeerEntry 47 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumRepRcvdUnknown OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of responses to unknown requests received from\n         this peer.  A response to an unknown request is a response\n         whose RP object does not contain the request ID of any\n         request that is currently outstanding on the session.\"\n    ::= { pcePcepPeerEntry 48 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepPeerNumReqRcvdUnknown OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of unknown requests that have been received from\n         a peer.  An unknown request is a request whose RP object\n         contains a request ID of zero.\"\n    ::= { pcePcepPeerEntry 49 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-- -- The PCEP Sessions Table --",
      "ja": "--PCEPセッションテーブル-"
    },
    {
      "indent": 3,
      "text": "pcePcepSessTable OBJECT-TYPE SYNTAX SEQUENCE OF PcePcepSessEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A table of PCEP sessions that involve the local PCEP entity. Each entry in this table represents a single session. The entries in this table are read-only.",
      "ja": "pcePcepSessTable OBJECT-TYPE SYNTAX SEQUENCE OF PcePcepSessEntry MAX-ACCESS not-accessibleステータス現在の説明「ローカルPCEPエンティティを含むPCEPセッションのテーブル。このテーブルの各エントリは単一のセッションを表しています。このテーブルのエントリは読み取り専用です。"
    },
    {
      "indent": 7,
      "text": "     An entry appears in this table when the corresponding PCEP\n     session transitions out of idle state.  If the PCEP session\n     transitions back into an idle state, then the corresponding\n     entry in this table is removed.\"\n::= { pcePcepObjects 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessEntry OBJECT-TYPE SYNTAX PcePcepSessEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This entry represents a single PCEP session in which the local PCEP entity participates.",
      "ja": "pcePcepSessEntry OBJECT-TYPE構文PcePcepSessEntry MAX-ACCESS not-accessibleステータス現在の説明「このエントリは、ローカルPCEPエンティティが参加する単一のPCEPセッションを表します。"
    },
    {
      "indent": 7,
      "text": "     This entry exists only if the corresponding PCEP session has\n     been initialized by some event, such as manual user\n     configuration, auto-discovery of a peer, or an incoming TCP\n     connection.\"\nINDEX { pcePcepEntityIndex,\n        pcePcepPeerAddrType,\n        pcePcepPeerAddr,\n        pcePcepSessInitiator }\n::= { pcePcepSessTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   PcePcepSessEntry ::= SEQUENCE {\n       pcePcepSessInitiator                INTEGER,\n       pcePcepSessStateLastChange          TimeStamp,\n       pcePcepSessState                    INTEGER,\n       pcePcepSessConnectRetry             Counter32,\n       pcePcepSessLocalID                  Unsigned32,\n       pcePcepSessRemoteID                 Unsigned32,\n       pcePcepSessKeepaliveTimer           Unsigned32,\n       pcePcepSessPeerKeepaliveTimer       Unsigned32,\n       pcePcepSessDeadTimer                Unsigned32,\n       pcePcepSessPeerDeadTimer            Unsigned32,\n       pcePcepSessKAHoldTimeRem            Unsigned32,\n       pcePcepSessOverloaded               TruthValue,\n       pcePcepSessOverloadTime             Unsigned32,\n       pcePcepSessPeerOverloaded           TruthValue,\n       pcePcepSessPeerOverloadTime         Unsigned32,\n       pcePcepSessDiscontinuityTime        TimeStamp,\n       pcePcepSessAvgRspTime               Unsigned32,\n       pcePcepSessLWMRspTime               Unsigned32,\n       pcePcepSessHWMRspTime               Unsigned32,\n       pcePcepSessNumPCReqSent             Counter32,\n       pcePcepSessNumPCReqRcvd             Counter32,\n       pcePcepSessNumPCRepSent             Counter32,\n       pcePcepSessNumPCRepRcvd             Counter32,\n       pcePcepSessNumPCErrSent             Counter32,\n       pcePcepSessNumPCErrRcvd             Counter32,\n       pcePcepSessNumPCNtfSent             Counter32,\n       pcePcepSessNumPCNtfRcvd             Counter32,\n       pcePcepSessNumKeepaliveSent         Counter32,\n       pcePcepSessNumKeepaliveRcvd         Counter32,\n       pcePcepSessNumUnknownRcvd           Counter32,\n       pcePcepSessNumCorruptRcvd           Counter32,\n       pcePcepSessNumReqSent               Counter32,\n       pcePcepSessNumSvecSent              Counter32,\n       pcePcepSessNumSvecReqSent           Counter32,\n       pcePcepSessNumReqSentPendRep        Counter32,\n       pcePcepSessNumReqSentEroRcvd        Counter32,\n       pcePcepSessNumReqSentNoPathRcvd     Counter32,\n       pcePcepSessNumReqSentCancelRcvd     Counter32,\n       pcePcepSessNumReqSentErrorRcvd      Counter32,\n       pcePcepSessNumReqSentTimeout        Counter32,\n       pcePcepSessNumReqSentCancelSent     Counter32,\n       pcePcepSessNumReqRcvd               Counter32,\n       pcePcepSessNumSvecRcvd              Counter32,\n       pcePcepSessNumSvecReqRcvd           Counter32,\n       pcePcepSessNumReqRcvdPendRep        Counter32,\n       pcePcepSessNumReqRcvdEroSent        Counter32,\n       pcePcepSessNumReqRcvdNoPathSent     Counter32,\n       pcePcepSessNumReqRcvdCancelSent     Counter32,\n       pcePcepSessNumReqRcvdErrorSent      Counter32,\n       pcePcepSessNumReqRcvdCancelRcvd     Counter32,\n       pcePcepSessNumRepRcvdUnknown        Counter32,\n       pcePcepSessNumReqRcvdUnknown        Counter32\n   }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessInitiator OBJECT-TYPE\n    SYNTAX      INTEGER {\n                   local(1),\n                   remote(2)\n                }\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The initiator of the session; that is, whether the TCP\n         connection was initiated by the local PCEP entity or the\n         peer.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "            There is a window during session initialization where two\n            sessions can exist between a pair of PCEP speakers, each\n            initiated by one of the speakers.  One of these sessions is\n            always discarded before it leaves OpenWait state.  However,\n            before it is discarded, two sessions to the given peer\n            appear transiently in this MIB module.  The sessions are\n            distinguished by who initiated them, and so this field is an\n            index for pcePcepSessTable.\"\n       ::= { pcePcepSessEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessStateLastChange OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The value of sysUpTime at the time this session entered its\n         current state as denoted by the pcePcepSessState object.\"\n    ::= { pcePcepSessEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessState OBJECT-TYPE\n    SYNTAX      INTEGER {\n                   tcpPending(1),\n                   openWait(2),\n                   keepWait(3),\n                   sessionUp(4)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The current state of the session.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "     The set of possible states excludes the idle state since\n     entries do not exist in this table in the idle state.\"\n::= { pcePcepSessEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessConnectRetry OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of times that the local PCEP entity has\n         attempted to establish a TCP connection for this session\n         without success.  The PCEP entity gives up when this\n         reaches pcePcepEntityConnectMaxRetry.\"\n    ::= { pcePcepSessEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessLocalID OBJECT-TYPE SYNTAX Unsigned32 (0..255) MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of the PCEP session ID used by the local PCEP entity in the Open message for this session.",
      "ja": "pcePcepSessLocalID OBJECT-TYPE SYNTAX Unsigned32（0..255）MAX-ACCESS read-only STATUS current説明「このセッションのOpenメッセージでローカルPCEPエンティティが使用するPCEPセッションIDの値。"
    },
    {
      "indent": 7,
      "text": "     If pcePcepSessState is tcpPending, then this is the session\n     ID that will be used in the Open message.  Otherwise, this\n     is the session ID that was sent in the Open message.\"\n::= { pcePcepSessEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessRemoteID OBJECT-TYPE SYNTAX Unsigned32 (0..255) MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of the PCEP session ID used by the peer in its Open message for this session.",
      "ja": "pcePcepSessRemoteID OBJECT-TYPE構文Unsigned32（0..255）MAX-ACCESS読み取り専用ステータス現在の説明「このセッションのOpenメッセージでピアが使用するPCEPセッションIDの値。"
    },
    {
      "indent": 7,
      "text": "     If pcePcepSessState is tcpPending or openWait, then this\n     field is not used and MUST be set to zero.\"\n::= { pcePcepSessEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessKeepaliveTimer OBJECT-TYPE SYNTAX Unsigned32 (0..255) UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The agreed maximum interval at which the local PCEP entity transmits PCEP messages on this PCEP session. Zero means that the local PCEP entity never sends Keepalives on this session.",
      "ja": "pcePcepSessKeepaliveTimer OBJECT-TYPE構文Unsigned32（0..255）UNITS \"秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"ローカルPCEPエンティティがこのPCEPセッションでPCEPメッセージを送信する合意された最大間隔。ゼロはローカルPCEPエンティティがこのセッションでキープアライブを送信することはありません。"
    },
    {
      "indent": 7,
      "text": "     This field is used if and only if pcePcepSessState is\n     sessionUp.  Otherwise, it is not used and MUST be set to\n     zero.\"\n::= { pcePcepSessEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessPeerKeepaliveTimer OBJECT-TYPE SYNTAX Unsigned32 (0..255) UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The agreed maximum interval at which the peer transmits PCEP messages on this PCEP session. Zero means that the peer never sends Keepalives on this session.",
      "ja": "pcePcepSessPeerKeepaliveTimer OBJECT-TYPE構文Unsigned32（0..255）UNITS「秒」MAX-ACCESS読み取り専用ステータス現在の説明「ピアがこのPCEPセッションでPCEPメッセージを送信する合意された最大間隔。ゼロは、ピアがキープアライブを送信しないことを意味します。このセッションで。"
    },
    {
      "indent": 7,
      "text": "     This field is used if and only if pcePcepSessState is\n     sessionUp.  Otherwise, it is not used and MUST be set to\n     zero.\"\n::= { pcePcepSessEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessDeadTimer OBJECT-TYPE\n    SYNTAX      Unsigned32 (0..255)\n    UNITS       \"seconds\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The DeadTimer interval for this PCEP session.\"\n    ::= { pcePcepSessEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessPeerDeadTimer OBJECT-TYPE SYNTAX Unsigned32 (0..255) UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The peer's DeadTimer interval for this PCEP session.",
      "ja": "pcePcepSessPeerDeadTimer OBJECT-TYPE構文Unsigned32（0..255）UNITS \"秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"このPCEPセッションのピアのDeadTimer間隔。"
    },
    {
      "indent": 7,
      "text": "     If pcePcepSessState is tcpPending or openWait, then this\n     field is not used and MUST be set to zero.\"\n::= { pcePcepSessEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessKAHoldTimeRem OBJECT-TYPE SYNTAX Unsigned32 (0..255) UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The Keepalive hold time remaining for this session.",
      "ja": "pcePcepSessKAHoldTimeRem OBJECT-TYPE構文Unsigned32（0..255）UNITS \"秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"このセッションの残りのキープアライブホールドタイム。"
    },
    {
      "indent": 7,
      "text": "     If pcePcepSessState is tcpPending or openWait, then this\n     field is not used and MUST be set to zero.\"\n::= { pcePcepSessEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessOverloaded OBJECT-TYPE\n    SYNTAX      TruthValue\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"If the local PCEP entity has informed the peer that it is\n         currently overloaded, then this is set to true.  Otherwise,\n         it is set to false.\"\n    ::= { pcePcepSessEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": " pcePcepSessOverloadTime OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The interval of time that is remaining until the local PCEP entity will cease to be overloaded on this session.",
      "ja": "pcePcepSessOverloadTime OBJECT-TYPE構文Unsigned32 UNITS \"秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"このセッションでローカルPCEPエンティティのオーバーロードが中止されるまでの残り時間。"
    },
    {
      "indent": 7,
      "text": "     This field is only used if pcePcepSessOverloaded is set to\n     true.  Otherwise, it is not used and MUST be set to zero.\"\n::= { pcePcepSessEntry 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessPeerOverloaded OBJECT-TYPE\n    SYNTAX      TruthValue\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"If the peer has informed the local PCEP entity that it is\n         currently overloaded, then this is set to true.  Otherwise,\n         it is set to false.\"\n    ::= { pcePcepSessEntry 14 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessPeerOverloadTime OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The interval of time that is remaining until the peer will cease to be overloaded. If it is not known how long the peer will stay in overloaded state, this field is set to zero.",
      "ja": "pcePcepSessPeerOverloadTime OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"ピアが過負荷状態でなくなるまでの残り時間。ピアが過負荷状態のままでいる時間の長さがわからない場合、このフィールドはゼロに設定されます。"
    },
    {
      "indent": 7,
      "text": "     This field is only used if pcePcepSessPeerOverloaded is set\n     to true.  Otherwise, it is not used and MUST be set to\n     zero.\"\n::= { pcePcepSessEntry 15 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessDiscontinuityTime OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The value of sysUpTime at the time that the statistics in\n         this row were last reset.\"\n    ::= { pcePcepSessEntry 16 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": " pcePcepSessAvgRspTime OBJECT-TYPE SYNTAX Unsigned32 UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The average response time for this peer on this session.",
      "ja": "pcePcepSessAvgRspTime OBJECT-TYPE構文Unsigned32 UNITS \"ミリ秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"このセッションのこのピアの平均応答時間。"
    },
    {
      "indent": 7,
      "text": "     If an average response time has not been calculated for this\n     peer, then this object has the value zero.\"\n::= { pcePcepSessEntry 17 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessLWMRspTime OBJECT-TYPE SYNTAX Unsigned32 UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The smallest (low-water mark) response time seen from this peer on this session.",
      "ja": "pcePcepSessLWMRspTime OBJECT-TYPE構文Unsigned32 UNITS \"ミリ秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"このセッションでこのピアから見た最小（最低水準点）応答時間。"
    },
    {
      "indent": 7,
      "text": "     If no responses have been received from this peer, then this\n     object has the value zero.\"\n::= { pcePcepSessEntry 18 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessHWMRspTime OBJECT-TYPE SYNTAX Unsigned32 UNITS \"milliseconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The greatest (high-water mark) response time seen from this peer on this session.",
      "ja": "pcePcepSessHWMRspTime OBJECT-TYPE構文Unsigned32 UNITS \"ミリ秒\" MAX-ACCESS読み取り専用ステータス現在の説明 \"このセッションでこのピアから見た最大（最高水準点）応答時間。"
    },
    {
      "indent": 7,
      "text": "     If no responses have been received from this peer, then this\n     object has the value zero.\"\n::= { pcePcepSessEntry 19 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumPCReqSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCReq messages sent on this session.\"\n    ::= { pcePcepSessEntry 20 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumPCReqRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCReq messages received on this session.\"\n    ::= { pcePcepSessEntry 21 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumPCRepSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCRep messages sent on this session.\"\n    ::= { pcePcepSessEntry 22 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumPCRepRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCRep messages received on this session.\"\n    ::= { pcePcepSessEntry 23 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumPCErrSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCErr messages sent on this session.\"\n    ::= { pcePcepSessEntry 24 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumPCErrRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCErr messages received on this session.\"\n    ::= { pcePcepSessEntry 25 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumPCNtfSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCNtf messages sent on this session.\"\n    ::= { pcePcepSessEntry 26 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumPCNtfRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of PCNtf messages received on this session.\"\n    ::= { pcePcepSessEntry 27 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumKeepaliveSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of Keepalive messages sent on this session.\"\n    ::= { pcePcepSessEntry 28 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumKeepaliveRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of Keepalive messages received on this session.\"\n    ::= { pcePcepSessEntry 29 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumUnknownRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of unknown messages received on this session.\"\n    ::= { pcePcepSessEntry 30 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumCorruptRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of corrupted PCEP messages received on this\n         session.\"\n    ::= { pcePcepSessEntry 31 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqSent OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests sent on this session. A request corresponds 1:1 with an RP object in a PCReq message.",
      "ja": "pcePcepSessNumReqSent OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「このセッションで送信されたリクエストの数。リクエストは、PCReqメッセージのRPオブジェクトと1：1で対応しています。"
    },
    {
      "indent": 7,
      "text": "     This might be greater than pcePcepSessNumPCReqSent because\n     multiple requests can be batched into a single PCReq\n     message.\"\n::= { pcePcepSessEntry 32 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumSvecSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of SVEC objects sent on this session in PCReq\n         messages.  An SVEC object represents a set of synchronized\n         requests.\"\n    ::= { pcePcepSessEntry 33 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumSvecReqSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests sent on this session that appeared in\n         one or more SVEC objects.\"\n    ::= { pcePcepSessEntry 34 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqSentPendRep OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests that have been sent on this session\n         for which a response is still pending.\"\n    ::= { pcePcepSessEntry 35 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqSentEroRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of successful responses received on this session.\n         A response corresponds 1:1 with an RP object in a PCRep\n         message.  A successful response is a response for which an\n         ERO was successfully computed.\"\n    ::= { pcePcepSessEntry 36 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqSentNoPathRcvd OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of unsuccessful responses received on this session. A response corresponds 1:1 with an RP object in a PCRep message. An unsuccessful response is a response with a NO-PATH object.\"",
      "ja": "pcePcepSessNumReqSentNoPathRcvd OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「このセッションで受信した失敗した応答の数。応答は、PCRepメッセージ内のRPオブジェクトと1：1で対応します。失敗した応答は、NO -PATHオブジェクト。」"
    },
    {
      "indent": 7,
      "text": "::= { pcePcepSessEntry 37 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqSentCancelRcvd OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests sent on this session that were canceled by the peer with a PCNtf message.",
      "ja": "pcePcepSessNumReqSentCancelRcvd OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「このセッションで送信され、PCNtfメッセージを持つピアによってキャンセルされた要求の数。"
    },
    {
      "indent": 7,
      "text": "     This might be different than pcePcepSessNumPCNtfRcvd because\n     not all PCNtf messages are used to cancel requests, and a\n     single PCNtf message can cancel multiple requests.\"\n::= { pcePcepSessEntry 38 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqSentErrorRcvd OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests sent on this session that were rejected by the peer with a PCErr message.",
      "ja": "pcePcepSessNumReqSentErrorRcvd OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「PCErrメッセージのあるピアによって拒否された、このセッションで送信された要求の数。"
    },
    {
      "indent": 7,
      "text": "     This might be different than pcePcepSessNumPCErrRcvd because\n     not all PCErr messages are used to reject requests, and a\n     single PCErr message can reject multiple requests.\"\n::= { pcePcepSessEntry 39 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqSentTimeout OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests sent on this session that have been\n         sent to a peer and have been abandoned because the peer has\n         taken too long to respond to them.\"\n    ::= { pcePcepSessEntry 40 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqSentCancelSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests sent on this session that were sent\n         to the peer and explicitly canceled by the local PCEP\n         entity sending a PCNtf.\"\n    ::= { pcePcepSessEntry 41 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqRcvd OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests received on this session. A request corresponds 1:1 with an RP object in a PCReq message.",
      "ja": "pcePcepSessNumReqRcvd OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「このセッションで受信されたリクエストの数。リクエストは、PCReqメッセージ内のRPオブジェクトと1：1で対応しています。"
    },
    {
      "indent": 7,
      "text": "     This might be greater than pcePcepSessNumPCReqRcvd because\n     multiple requests can be batched into a single PCReq\n     message.\"\n::= { pcePcepSessEntry 42 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumSvecRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of SVEC objects received on this session in PCReq\n         messages.  An SVEC object represents a set of synchronized\n         requests.\"\n    ::= { pcePcepSessEntry 43 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumSvecReqRcvd OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests received on this session that\n         appeared in one or more SVEC objects.\"\n    ::= { pcePcepSessEntry 44 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqRcvdPendRep OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of requests that have been received on this\n         session for which a response is still pending.\"\n    ::= { pcePcepSessEntry 45 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   pcePcepSessNumReqRcvdEroSent OBJECT-TYPE\n       SYNTAX      Counter32\n       MAX-ACCESS  read-only\n       STATUS      current\n       DESCRIPTION\n           \"The number of successful responses sent on this session.  A\n            response corresponds 1:1 with an RP object in a PCRep\n            message.  A successful response is a response for which an\n            ERO was successfully computed.\"\n       ::= { pcePcepSessEntry 46 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqRcvdNoPathSent OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of unsuccessful responses sent on this session.\n         A response corresponds 1:1 with an RP object in a PCRep\n         message.  An unsuccessful response is a response with a\n         NO-PATH object.\"\n    ::= { pcePcepSessEntry 47 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqRcvdCancelSent OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests received on this session that were canceled by the local PCEP entity sending a PCNtf message.",
      "ja": "pcePcepSessNumReqRcvdCancelSent OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「PCNtfメッセージを送信するローカルPCEPエンティティによってキャンセルされた、このセッションで受信された要求の数。"
    },
    {
      "indent": 7,
      "text": "     This might be different than pcePcepSessNumPCNtfSent because\n     not all PCNtf messages are used to cancel requests, and a\n     single PCNtf message can cancel multiple requests.\"\n::= { pcePcepSessEntry 48 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqRcvdErrorSent OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests received on this session that were rejected by the local PCEP entity sending a PCErr message.",
      "ja": "pcePcepSessNumReqRcvdErrorSent OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「PCErrメッセージを送信するローカルPCEPエンティティによって拒否された、このセッションで受信された要求の数。"
    },
    {
      "indent": 7,
      "text": "     This might be different than pcePcepSessNumPCErrSent because\n     not all PCErr messages are used to reject requests, and a\n     single PCErr message can reject multiple requests.\"\n::= { pcePcepSessEntry 49 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqRcvdCancelRcvd OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"The number of requests that were received on this session and explicitly canceled by the peer sending a PCNtf.\"",
      "ja": "pcePcepSessNumReqRcvdCancelRcvd OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明「このセッションで受信され、PCNtfを送信するピアによって明示的にキャンセルされた要求の数。」"
    },
    {
      "indent": 7,
      "text": "::= { pcePcepSessEntry 50 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumRepRcvdUnknown OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of responses to unknown requests received on this\n         session.  A response to an unknown request is a response\n         whose RP object does not contain the request ID of any\n         request that is currently outstanding on the session.\"\n    ::= { pcePcepSessEntry 51 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessNumReqRcvdUnknown OBJECT-TYPE\n    SYNTAX      Counter32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The number of unknown requests that have been received on\n         this session.  An unknown request is a request whose RP\n         object contains a request ID of zero.\"\n    ::= { pcePcepSessEntry 52 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "---\n--- Notifications Configuration\n---",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepNotificationsMaxRate OBJECT-TYPE\n    SYNTAX       Unsigned32\n    MAX-ACCESS   read-write\n    STATUS       current\n    DESCRIPTION\n        \"This variable indicates the maximum number of\n         notifications issued per second.  If events occur\n         more rapidly, the implementation may simply fail to\n         emit these notifications during that period or may\n         queue them until an appropriate time.  A value of zero\n         means no notifications are emitted and all should be\n         discarded (that is, not queued).\"\n    ::= { pcePcepObjects 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "---\n--- Notifications\n---",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   pcePcepSessUp NOTIFICATION-TYPE\n       OBJECTS     {\n                      pcePcepSessState,\n                      pcePcepSessStateLastChange\n                   }\n       STATUS      current\n       DESCRIPTION\n           \"This notification is sent when the value of\n            pcePcepSessState enters the sessionUp state.\"\n       ::= { pcePcepNotifications 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessDown NOTIFICATION-TYPE\n    OBJECTS     {\n                   pcePcepSessState,\n                   pcePcepSessStateLastChange\n                }\n    STATUS      current\n    DESCRIPTION\n        \"This notification is sent when the value of\n         pcePcepSessState leaves the sessionUp state.\"\n    ::= { pcePcepNotifications 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessLocalOverload NOTIFICATION-TYPE\n    OBJECTS     {\n                   pcePcepSessOverloaded,\n                   pcePcepSessOverloadTime\n                }\n    STATUS      current\n    DESCRIPTION\n        \"This notification is sent when the local PCEP entity enters\n         overload state for a peer.\"\n    ::= { pcePcepNotifications 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessLocalOverloadClear NOTIFICATION-TYPE\n    OBJECTS     {\n                   pcePcepSessOverloaded\n                }\n    STATUS      current\n    DESCRIPTION\n        \"This notification is sent when the local PCEP entity leaves\n         overload state for a peer.\"\n    ::= { pcePcepNotifications 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   pcePcepSessPeerOverload NOTIFICATION-TYPE\n       OBJECTS     {\n                      pcePcepSessPeerOverloaded,\n                      pcePcepSessPeerOverloadTime\n                   }\n       STATUS      current\n       DESCRIPTION\n           \"This notification is sent when a peer enters overload\n            state.\"\n       ::= { pcePcepNotifications 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepSessPeerOverloadClear NOTIFICATION-TYPE\n    OBJECTS     {\n                   pcePcepSessPeerOverloaded\n                }\n    STATUS      current\n    DESCRIPTION\n        \"This notification is sent when a peer leaves overload\n         state.\"\n    ::= { pcePcepNotifications 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-- -- Module Conformance Statement --",
      "ja": "--モジュールの適合宣言-"
    },
    {
      "indent": 3,
      "text": "pcePcepCompliances\n    OBJECT IDENTIFIER ::= { pcePcepConformance 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepGroups\n    OBJECT IDENTIFIER ::= { pcePcepConformance 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-- -- Read-Only Compliance --",
      "ja": "--読み取り専用コンプライアンス-"
    },
    {
      "indent": 3,
      "text": "pcePcepModuleReadOnlyCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The module is implemented with support for read-only. In other words, only monitoring is available by implementing this MODULE-COMPLIANCE.\"",
      "ja": "pcePcepModuleReadOnlyCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION「このモジュールは読み取り専用をサポートして実装されています。つまり、このMODULE-COMPLIANCEを実装することによって、監視のみが利用可能になります。」"
    },
    {
      "indent": 7,
      "text": "MODULE -- this module\n    MANDATORY-GROUPS    {\n                          pcePcepGeneralGroup,\n                          pcePcepNotificationsGroup\n                        }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "OBJECT       pcePcepEntityAddrType\nSYNTAX       InetAddressType { unknown(0), ipv4(1), ipv6(2) }\nDESCRIPTION  \"Only unknown(0), ipv4(1), and ipv6(2) support\n              is required.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- The following restriction is commented out because of a limitation\n-- in SMIv2 which does not allow index objects to be restricted in\n-- scope.  Nevertheless, this object is intended to be restricted in\n-- scope, as follows.\n--\n--     OBJECT       pcePcepPeerAddrType\n--     SYNTAX       InetAddressType { unknown(0), ipv4(1), ipv6(2) }\n--     DESCRIPTION  \"Only unknown(0), ipv4(1), and ipv6(2) support\n--                   is required.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "::= { pcePcepCompliances 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-- units of conformance",
      "ja": "-- units of conformance"
    },
    {
      "indent": 0,
      "text": "   pcePcepGeneralGroup OBJECT-GROUP\n       OBJECTS { pcePcepEntityAdminStatus,\n                 pcePcepEntityOperStatus,\n                 pcePcepEntityAddrType,\n                 pcePcepEntityAddr,\n                 pcePcepEntityConnectTimer,\n                 pcePcepEntityConnectMaxRetry,\n                 pcePcepEntityInitBackoffTimer,\n                 pcePcepEntityMaxBackoffTimer,\n                 pcePcepEntityOpenWaitTimer,\n                 pcePcepEntityKeepWaitTimer,\n                 pcePcepEntityKeepAliveTimer,\n                 pcePcepEntityDeadTimer,\n                 pcePcepEntityAllowNegotiation,\n                 pcePcepEntityMaxKeepAliveTimer,\n                 pcePcepEntityMaxDeadTimer,\n                 pcePcepEntityMinKeepAliveTimer,\n                 pcePcepEntityMinDeadTimer,\n                 pcePcepEntitySyncTimer,\n                 pcePcepEntityRequestTimer,\n                 pcePcepEntityMaxSessions,\n                 pcePcepEntityMaxUnknownReqs,\n                 pcePcepEntityMaxUnknownMsgs,\n                 pcePcepPeerRole,\n                 pcePcepPeerDiscontinuityTime,\n                 pcePcepPeerInitiateSession,\n                 pcePcepPeerSessionExists,\n                 pcePcepPeerNumSessSetupOK,\n                 pcePcepPeerNumSessSetupFail,\n                 pcePcepPeerSessionUpTime,\n                 pcePcepPeerSessionFailTime,\n                 pcePcepPeerSessionFailUpTime,\n                 pcePcepPeerAvgRspTime,\n                 pcePcepPeerLWMRspTime,\n                 pcePcepPeerHWMRspTime,\n                 pcePcepPeerNumPCReqSent,\n                 pcePcepPeerNumPCReqRcvd,\n                 pcePcepPeerNumPCRepSent,\n                 pcePcepPeerNumPCRepRcvd,\n                 pcePcepPeerNumPCErrSent,\n                 pcePcepPeerNumPCErrRcvd,\n                 pcePcepPeerNumPCNtfSent,\n                 pcePcepPeerNumPCNtfRcvd,\n                 pcePcepPeerNumKeepaliveSent,\n                 pcePcepPeerNumKeepaliveRcvd,\n                 pcePcepPeerNumUnknownRcvd,\n                 pcePcepPeerNumCorruptRcvd,\n                 pcePcepPeerNumReqSent,\n                 pcePcepPeerNumSvecSent,\n                 pcePcepPeerNumSvecReqSent,\n                 pcePcepPeerNumReqSentPendRep,\n                 pcePcepPeerNumReqSentEroRcvd,\n                 pcePcepPeerNumReqSentNoPathRcvd,\n                 pcePcepPeerNumReqSentCancelRcvd,\n                 pcePcepPeerNumReqSentErrorRcvd,\n                 pcePcepPeerNumReqSentTimeout,\n                 pcePcepPeerNumReqSentCancelSent,\n                 pcePcepPeerNumReqSentClosed,\n                 pcePcepPeerNumReqRcvd,\n                 pcePcepPeerNumSvecRcvd,\n                 pcePcepPeerNumSvecReqRcvd,\n                 pcePcepPeerNumReqRcvdPendRep,\n                 pcePcepPeerNumReqRcvdEroSent,\n                 pcePcepPeerNumReqRcvdNoPathSent,\n                 pcePcepPeerNumReqRcvdCancelSent,\n                 pcePcepPeerNumReqRcvdErrorSent,\n                 pcePcepPeerNumReqRcvdCancelRcvd,\n                 pcePcepPeerNumReqRcvdClosed,\n                 pcePcepPeerNumRepRcvdUnknown,\n                 pcePcepPeerNumReqRcvdUnknown,\n                 pcePcepSessStateLastChange,\n                 pcePcepSessState,\n                 pcePcepSessConnectRetry,\n                 pcePcepSessLocalID,\n                 pcePcepSessRemoteID,\n                 pcePcepSessKeepaliveTimer,\n                 pcePcepSessPeerKeepaliveTimer,\n                 pcePcepSessDeadTimer,\n                 pcePcepSessPeerDeadTimer,\n                 pcePcepSessKAHoldTimeRem,\n                 pcePcepSessOverloaded,\n                 pcePcepSessOverloadTime,\n                 pcePcepSessPeerOverloaded,\n                 pcePcepSessPeerOverloadTime,\n                 pcePcepSessDiscontinuityTime,\n                 pcePcepSessAvgRspTime,\n                 pcePcepSessLWMRspTime,\n                 pcePcepSessHWMRspTime,\n                 pcePcepSessNumPCReqSent,\n                 pcePcepSessNumPCReqRcvd,\n                 pcePcepSessNumPCRepSent,\n                 pcePcepSessNumPCRepRcvd,\n                 pcePcepSessNumPCErrSent,\n                 pcePcepSessNumPCErrRcvd,\n                 pcePcepSessNumPCNtfSent,\n                 pcePcepSessNumPCNtfRcvd,\n                 pcePcepSessNumKeepaliveSent,\n                 pcePcepSessNumKeepaliveRcvd,\n                 pcePcepSessNumUnknownRcvd,\n                 pcePcepSessNumCorruptRcvd,\n                 pcePcepSessNumReqSent,\n                 pcePcepSessNumSvecSent,\n                 pcePcepSessNumSvecReqSent,\n                 pcePcepSessNumReqSentPendRep,\n                 pcePcepSessNumReqSentEroRcvd,\n                 pcePcepSessNumReqSentNoPathRcvd,\n                 pcePcepSessNumReqSentCancelRcvd,\n                 pcePcepSessNumReqSentErrorRcvd,\n                 pcePcepSessNumReqSentTimeout,\n                 pcePcepSessNumReqSentCancelSent,\n                 pcePcepSessNumReqRcvd,\n                 pcePcepSessNumSvecRcvd,\n                 pcePcepSessNumSvecReqRcvd,\n                 pcePcepSessNumReqRcvdPendRep,\n                 pcePcepSessNumReqRcvdEroSent,\n                 pcePcepSessNumReqRcvdNoPathSent,\n                 pcePcepSessNumReqRcvdCancelSent,\n                 pcePcepSessNumReqRcvdErrorSent,\n                 pcePcepSessNumReqRcvdCancelRcvd,\n                 pcePcepSessNumRepRcvdUnknown,\n                 pcePcepSessNumReqRcvdUnknown,\n                 pcePcepNotificationsMaxRate\n               }\n       STATUS current\n       DESCRIPTION\n           \"Objects that apply to all PCEP MIB module implementations.\"\n       ::= { pcePcepGroups 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "pcePcepNotificationsGroup NOTIFICATION-GROUP\n    NOTIFICATIONS { pcePcepSessUp,\n                    pcePcepSessDown,\n                    pcePcepSessLocalOverload,\n                    pcePcepSessLocalOverloadClear,\n                    pcePcepSessPeerOverload,\n                    pcePcepSessPeerOverloadClear\n                  }\n    STATUS   current\n    DESCRIPTION\n        \"The notifications for a PCEP MIB module implementation.\"\n    ::= { pcePcepGroups 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "END",
      "ja": "END"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. Security Considerations"
    },
    {
      "indent": 3,
      "text": "The pcePcepNotificationsMaxRate object defined in this MIB module has a MAX-ACCESS clause of read-write. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection opens devices to attack. In particular, pcePcepNotificationsMaxRate may be used improperly to stop notifications being issued or to permit a flood of notifications to be sent to the management agent at a high rate.",
      "ja": "The pcePcepNotificationsMaxRate object defined in this MIB module has a MAX-ACCESS clause of read-write. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection opens devices to attack. In particular, pcePcepNotificationsMaxRate may be used improperly to stop notifications being issued or to permit a flood of notifications to be sent to the management agent at a high rate."
    },
    {
      "indent": 3,
      "text": "All the readable objects in this MIB module (i.e., objects with a MAX-ACCESS other than not-accessible) may be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. The sensitivity/vulnerability arises because, collectively, these objects provide information about the amount and frequency of path computation requests and responses within the network and can reveal some aspects of its configuration.",
      "ja": "このMIBモジュールのすべての読み取り可能なオブジェクト（つまり、アクセス不可以外のMAX-ACCESSを持つオブジェクト）は、一部のネットワーク環境では機密または脆弱であると見なされる場合があります。したがって、これらのオブジェクトへのGETおよび/またはNOTIFYアクセスを制御し、SNMP経由でネットワーク経由で送信するときにこれらのオブジェクトの値を暗号化することも重要です。これらのオブジェクトが集合的にネットワーク内のパス計算要求と応答の量と頻度に関する情報を提供し、その構成のいくつかの側面を明らかにする可能性があるため、機密性/脆弱性が発生します。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPsec), there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.",
      "ja": "SNMPv3より前のSNMPバージョンには、十分なセキュリティが含まれていませんでした。ネットワーク自体が（たとえばIPsecを使用して）安全であっても、安全なネットワーク上の誰がこのMIBモジュール内のオブジェクトにアクセスしてGET / SET（読み取り/変更/作成/削除）できるかは制御できません。"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD provide the security features described by the SNMPv3 framework (see [RFC3410]), and implementations claiming compliance to the SNMPv3 standard MUST include full support for authentication and privacy via the User-based Security Model (USM) [RFC3414] with the AES cipher algorithm [RFC3826]. Implementations MAY also provide support for the Transport Security Model (TSM)",
      "ja": "実装は、SNMPv3フレームワーク（[RFC3410]を参照）によって記述されたセキュリティ機能を提供する必要があり、SNMPv3標準への準拠を主張する実装は、AESによるユーザーベースのセキュリティモデル（USM）[RFC3414]による認証とプライバシーの完全なサポートを含める必要があります暗号アルゴリズム[RFC3826]。実装は、Transport Security Model（TSM）のサポートも提供できます（MAY）"
    },
    {
      "indent": 3,
      "text": "[RFC5591] in combination with a secure transport such as SSH [RFC5592] or TLS/DTLS [RFC6353].",
      "ja": "[RFC5591]は、SSH [RFC5592]やTLS / DTLS [RFC6353]などの安全なトランスポートと組み合わせて。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "ja": "さらに、SNMPv3より前のSNMPバージョンの配備は推奨されません。代わりに、SNMPv3を展開して暗号化セキュリティを有効にすることをお勧めします。次に、このMIBモジュールのインスタンスにアクセスを許可するSNMPエンティティが、実際にGETまたはSET（変更）に対する正当な権限を持つプリンシパル（ユーザー）にのみオブジェクトへのアクセスを許可するように適切に構成されていることを確認するのは、顧客/オペレーターの責任です。 / create / delete）それら。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The MIB module in this document uses the following IANA-assigned OBJECT IDENTIFIER values recorded in the SMI Numbers registry:",
      "ja": "このドキュメントのMIBモジュールは、SMI番号レジストリに記録された、次のIANA割り当てのOBJECT IDENTIFIER値を使用します。"
    },
    {
      "indent": 8,
      "text": "Descriptor        OBJECT IDENTIFIER value\n----------        -----------------------\npcePcepMIB         { mib-2 227 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月、<http://www.rfc-editor.org/info/rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999, <http://www.rfc-editor.org/info/rfc2578>.",
      "ja": "[RFC2578] McCloghrie、K.、Ed。、Perkins、D.、Ed。、and J. Schoenwaelder、Ed。、 \"Structure of Management Information Version 2（SMIv2）\"、STD 58、RFC 2578、April 1999、<http ：//www.rfc-editor.org/info/rfc2578>。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999, <http://www.rfc-editor.org/info/rfc2579>.",
      "ja": "[RFC2579] McCloghrie、K.、Ed。、Perkins、D.、Ed。、and J. Schoenwaelder、Ed。、 \"Textual Conventions for SMIv2\"、STD 58、RFC 2579、April 1999、<http：// www。 rfc-editor.org/info/rfc2579>。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999, <http://www.rfc-editor.org/info/rfc2580>.",
      "ja": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999, <http://www.rfc-editor.org/info/rfc2580>."
    },
    {
      "indent": 3,
      "text": "[RFC3414] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", STD 62, RFC 3414, December 2002, <http://www.rfc-editor.org/info/rfc3414>.",
      "ja": "[RFC3414] Blumenthal、U。およびB. Wijnen、「バージョン3のSimple Network Management Protocol（SNMPv3）用のユーザーベースのセキュリティモデル（USM）」、STD 62、RFC 3414、2002年12月、<http：// www .rfc-editor.org / info / rfc3414>。"
    },
    {
      "indent": 3,
      "text": "[RFC3826] Blumenthal, U., Maino, F., and K. McCloghrie, \"The Advanced Encryption Standard (AES) Cipher Algorithm in the SNMP User-based Security Model\", RFC 3826, June 2004, <http://www.rfc-editor.org/info/rfc3826>.",
      "ja": "[RFC3826] Blumenthal、U.、Maino、F。、およびK. McCloghrie、「SNMPユーザーベースのセキュリティモデルにおけるAdvanced Encryption Standard（AES）暗号アルゴリズム」、RFC 3826、2004年6月、<http：// www .rfc-editor.org / info / rfc3826>。"
    },
    {
      "indent": 3,
      "text": "[RFC4001] Daniele, M., Haberman, B., Routhier, S., and J. Schoenwaelder, \"Textual Conventions for Internet Network Addresses\", RFC 4001, February 2005, <http://www.rfc-editor.org/info/rfc4001>.",
      "ja": "[RFC4001] Daniele、M.、Haberman、B.、Routhier、S。、およびJ. Schoenwaelder、「インターネットネットワークアドレスのテキスト表記法」、RFC 4001、2005年2月、<http://www.rfc-editor.org / info / rfc4001>。"
    },
    {
      "indent": 3,
      "text": "[RFC5440] Vasseur, JP. and JL. Le Roux, \"Path Computation Element (PCE) Communication Protocol (PCEP)\", RFC 5440, March 2009, <http://www.rfc-editor.org/info/rfc5440>.",
      "ja": "[RFC5440] Vasseur、JP。とJL。 Le Roux、「Path Computation Element（PCE）Communication Protocol（PCEP）」、RFC 5440、2009年3月、<http://www.rfc-editor.org/info/rfc5440>。"
    },
    {
      "indent": 3,
      "text": "[RFC5591] Harrington, D. and W. Hardaker, \"Transport Security Model for the Simple Network Management Protocol (SNMP)\", STD 78, RFC 5591, June 2009, <http://www.rfc-editor.org/info/rfc5591>.",
      "ja": "[RFC5591] Harrington、D。およびW. Hardaker、「SNMP（Simple Network Management Protocol）のトランスポートセキュリティモデル」、STD 78、RFC 5591、2009年6月、<http://www.rfc-editor.org/info / rfc5591>。"
    },
    {
      "indent": 3,
      "text": "[RFC5592] Harrington, D., Salowey, J., and W. Hardaker, \"Secure Shell Transport Model for the Simple Network Management Protocol (SNMP)\", RFC 5592, June 2009, <http://www.rfc-editor.org/info/rfc5592>.",
      "ja": "[RFC5592] Harrington、D.、Salowey、J。、およびW. Hardaker、「Simple Network Management Protocol（SNMP）のセキュアシェルトランスポートモデル」、RFC 5592、2009年6月、<http：//www.rfc-editor .org / info / rfc5592>。"
    },
    {
      "indent": 3,
      "text": "[RFC6353] Hardaker, W., \"Transport Layer Security (TLS) Transport Model for the Simple Network Management Protocol (SNMP)\", STD 78, RFC 6353, July 2011, <http://www.rfc-editor.org/info/rfc6353>.",
      "ja": "[RFC6353] Hardaker, W., \"Transport Layer Security (TLS) Transport Model for the Simple Network Management Protocol (SNMP)\", STD 78, RFC 6353, July 2011, <http://www.rfc-editor.org/info/rfc6353>."
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002, <http://www.rfc-editor.org/info/rfc3410>.",
      "ja": "[RFC3410] Case、J.、Mundy、R.、Partain、D。、およびB. Stewart、「Introduction and Applicability Statements for Internet-Standard Management Framework」、RFC 3410、2002年12月、<http：//www.rfc -editor.org/info/rfc3410>。"
    },
    {
      "indent": 3,
      "text": "[RFC4655] Farrel, A., Vasseur, J., and J. Ash, \"A Path Computation Element (PCE)-Based Architecture\", RFC 4655, August 2006, <http://www.rfc-editor.org/info/rfc4655>.",
      "ja": "[RFC4655] Farrel, A., Vasseur, J., and J. Ash, \"A Path Computation Element (PCE)-Based Architecture\", RFC 4655, August 2006, <http://www.rfc-editor.org/info/rfc4655>."
    },
    {
      "indent": 0,
      "text": "Appendix A. PCEP MIB Module Example",
      "section_title": true,
      "ja": "付録A. PCEP MIBモジュールの例"
    },
    {
      "indent": 3,
      "text": "This example considers the set of PCC/PCE relationships shown in the following figure. The example shows the contents of the PCEP MIB module as read at PCE2 and PCCb.",
      "ja": "この例では、次の図に示すPCC / PCE関係のセットを検討します。この例は、PCE2およびPCCbで読み取られるPCEP MIBモジュールの内容を示しています。"
    },
    {
      "indent": 7,
      "text": "PCE1---PCE2   PCE3\n  |   /  |    /  |\n  |  /   |   /   |\nPCCa/    PCCb   PCCc",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The IP addresses of the PCE speakers in this diagram are given in the following table.",
      "ja": "この図のPCEスピーカーのIPアドレスを次の表に示します。"
    },
    {
      "indent": 7,
      "text": "+------+-------------+\n| PCE1 | 1.1.1.1     |\n+------+-------------+\n| PCE2 | 2.2.2.2     |\n+------+-------------+\n| PCE3 | 3.3.3.3     |\n+------+-------------+\n| PCCa | 11.11.11.11 |\n+------+-------------+\n| PCCb | 22.22.22.22 |\n+------+-------------+\n| PCCc | 33.33.33.33 |\n+------+-------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In this example, the PCEP session between PCCb and PCE3 is currently down.",
      "ja": "この例では、PCCbとPCE3の間のPCEPセッションが現在ダウンしています。"
    },
    {
      "indent": 0,
      "text": "A.1. Contents of PCEP MIB Module at PCE2",
      "section_title": true,
      "ja": "A.1. PCE2でのPCEP MIBモジュールの内容"
    },
    {
      "indent": 3,
      "text": "At PCE2, there is a single local PCEP entity that has three peers (PCCa, PCCb, and PCE1). There is a session active to all of these peers.",
      "ja": "PCE2には、3つのピア（PCCa、PCCb、PCE1）を持つ単一のローカルPCEPエンティティがあります。これらのすべてのピアに対してアクティブなセッションがあります。"
    },
    {
      "indent": 3,
      "text": "The contents of the PCEP MIB module as read at PCE2 are as follows.",
      "ja": "The contents of the PCEP MIB module as read at PCE2 are as follows."
    },
    {
      "indent": 3,
      "text": "In pcePcepEntityTable  {\n       pcePcepEntityIndex                1,\n       pcePcepEntityAdminStatus          adminStatusUp(1),\n       pcePcepEntityOperStatus           operStatusUp(1),\n       pcePcepEntityAddrType             ipv4(1),\n       pcePcepEntityAddr                 2.2.2.2, -- PCE2\n       pcePcepEntityConnectTimer         60,\n       pcePcepEntityConnectMaxRetry      5,\n       pcePcepEntityInitBackoffTimer     30,\n       pcePcepEntityMaxBackoffTimer      3600,\n       pcePcepEntityOpenWaitTimer        60,\n       pcePcepEntityKeepWaitTimer        60,\n       pcePcepEntityKeepAliveTimer       1,\n       pcePcepEntityDeadTimer            4,\n       pcePcepEntityAllowNegotiation     true(1),\n       pcePcepEntityMaxKeepAliveTimer    60,\n       pcePcepEntityMaxDeadTimer         240,\n       pcePcepEntityMinKeepAliveTimer    1,\n       pcePcepEntityMinDeadTimer         4,\n       pcePcepEntitySyncTimer            60,\n       pcePcepEntityRequestTimer         120,\n       pcePcepEntityMaxSessions          999,\n       pcePcepEntityMaxUnknownReqs       5,\n       pcePcepEntityMaxUnknownMsgs       5\n   }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   In pcePcepPeerTable {\n          pcePcepPeerAddrType                 ipv4(1), --PCE1\n          pcePcepPeerAddr                     1.1.1.1,\n          pcePcepPeerRole                     pccAndPce(3),\n          pcePcepPeerDiscontinuityTime        TimeStamp,\n          pcePcepPeerInitiateSession          true(1),\n          pcePcepPeerSessionExists            true(1),\n          pcePcepPeerNumSessSetupOK           1,\n          pcePcepPeerNumSessSetupFail         0,\n          pcePcepPeerSessionUpTime            TimeStamp,\n          pcePcepPeerSessionFailTime          0,\n          pcePcepPeerSessionFailUpTime        TimeStamp,\n          pcePcepPeerAvgRspTime               0,\n          pcePcepPeerLWMRspTime               0,\n          pcePcepPeerHWMRspTime               0,\n          pcePcepPeerNumPCReqSent             0,\n          pcePcepPeerNumPCReqRcvd             0,\n          pcePcepPeerNumPCRepSent             0,\n          pcePcepPeerNumPCRepRcvd             0,\n          pcePcepPeerNumPCErrSent             0,\n          pcePcepPeerNumPCErrRcvd             0,\n          pcePcepPeerNumPCNtfSent             0,\n          pcePcepPeerNumPCNtfRcvd             0,\n          pcePcepPeerNumKeepaliveSent         123,\n          pcePcepPeerNumKeepaliveRcvd         123,\n          pcePcepPeerNumUnknownRcvd           0,\n          pcePcepPeerNumCorruptRcvd           0,\n          pcePcepPeerNumReqSent               0,\n          pcePcepPeerNumSvecSent              0,\n          pcePcepPeerNumSvecReqSent           0,\n          pcePcepPeerNumReqSentPendRep        0,\n          pcePcepPeerNumReqSentEroRcvd        0,\n          pcePcepPeerNumReqSentNoPathRcvd     0,\n          pcePcepPeerNumReqSentCancelRcvd     0,\n          pcePcepPeerNumReqSentErrorRcvd      0,\n          pcePcepPeerNumReqSentTimeout        0,\n          pcePcepPeerNumReqSentCancelSent     0,\n          pcePcepPeerNumReqSentClosed         0,\n          pcePcepPeerNumReqRcvd               0,\n          pcePcepPeerNumSvecRcvd              0,\n          pcePcepPeerNumSvecReqRcvd           0,\n          pcePcepPeerNumReqRcvdPendRep        0,\n          pcePcepPeerNumReqRcvdEroSent        0,\n          pcePcepPeerNumReqRcvdNoPathSent     0,\n          pcePcepPeerNumReqRcvdCancelSent     0,\n          pcePcepPeerNumReqRcvdErrorSent      0,\n          pcePcepPeerNumReqRcvdCancelRcvd     0,\n          pcePcepPeerNumReqRcvdClosed         0,\n          pcePcepPeerNumRepRcvdUnknown        0,\n          pcePcepPeerNumReqRcvdUnknown        0\n      },\n      {\n          pcePcepPeerAddrType                 ipv4(1),  --PCCa\n          pcePcepPeerAddr                     11.11.11.11,\n          pcePcepPeerRole                     pcc(1),\n          pcePcepPeerDiscontinuityTime        TimeStamp,\n          pcePcepPeerInitiateSession          false(0),\n          pcePcepPeerSessionExists            true(1),\n          pcePcepPeerNumSessSetupOK           1,\n          pcePcepPeerNumSessSetupFail         0,\n          pcePcepPeerSessionUpTime            TimeStamp,\n          pcePcepPeerSessionFailTime          0,\n          pcePcepPeerSessionFailUpTime        TimeStamp,\n          pcePcepPeerAvgRspTime               200,\n          pcePcepPeerLWMRspTime               100,\n          pcePcepPeerHWMRspTime               300,\n          pcePcepPeerNumPCReqSent             0,\n          pcePcepPeerNumPCReqRcvd             3,\n          pcePcepPeerNumPCRepSent             3,\n          pcePcepPeerNumPCRepRcvd             0,\n          pcePcepPeerNumPCErrSent             0,\n          pcePcepPeerNumPCErrRcvd             0,\n          pcePcepPeerNumPCNtfSent             0,\n          pcePcepPeerNumPCNtfRcvd             0,\n          pcePcepPeerNumKeepaliveSent         123,\n          pcePcepPeerNumKeepaliveRcvd         123,\n          pcePcepPeerNumUnknownRcvd           0,\n          pcePcepPeerNumCorruptRcvd           0,\n          pcePcepPeerNumReqSent               0,\n          pcePcepPeerNumSvecSent              0,\n          pcePcepPeerNumSvecReqSent           0,\n          pcePcepPeerNumReqSentPendRep        0,\n          pcePcepPeerNumReqSentEroRcvd        0,\n          pcePcepPeerNumReqSentNoPathRcvd     0,\n          pcePcepPeerNumReqSentCancelRcvd     0,\n          pcePcepPeerNumReqSentErrorRcvd      0,\n          pcePcepPeerNumReqSentTimeout        0,\n          pcePcepPeerNumReqSentCancelSent     0,\n          pcePcepPeerNumReqSentClosed         0,\n          pcePcepPeerNumReqRcvd               3,\n          pcePcepPeerNumSvecRcvd              0,\n          pcePcepPeerNumSvecReqRcvd           0,\n          pcePcepPeerNumReqRcvdPendRep        0,\n          pcePcepPeerNumReqRcvdEroSent        3,\n          pcePcepPeerNumReqRcvdNoPathSent     0,\n          pcePcepPeerNumReqRcvdCancelSent     0,\n          pcePcepPeerNumReqRcvdErrorSent      0,\n          pcePcepPeerNumReqRcvdCancelRcvd     0,\n          pcePcepPeerNumReqRcvdClosed         0,\n          pcePcepPeerNumRepRcvdUnknown        0,\n          pcePcepPeerNumReqRcvdUnknown        0\n      },\n      {\n          pcePcepPeerAddrType                 ipv4(1), -- PCCb\n          pcePcepPeerAddr                     22.22.22.22,\n          pcePcepPeerRole                     pcc(1),\n          pcePcepPeerDiscontinuityTime        TimeStamp,\n          pcePcepPeerInitiateSession          true(1),\n          pcePcepPeerSessionExists            true(1),\n          pcePcepPeerNumSessSetupOK           1,\n          pcePcepPeerNumSessSetupFail         0,\n          pcePcepPeerSessionUpTime            TimeStamp,\n          pcePcepPeerSessionFailTime          0,\n          pcePcepPeerSessionFailUpTime        TimeStamp,\n          pcePcepPeerAvgRspTime               200,\n          pcePcepPeerLWMRspTime               100,\n          pcePcepPeerHWMRspTime               300,\n          pcePcepPeerNumPCReqSent             0,\n          pcePcepPeerNumPCReqRcvd             4,\n          pcePcepPeerNumPCRepSent             4,\n          pcePcepPeerNumPCRepRcvd             0,\n          pcePcepPeerNumPCErrSent             0,\n          pcePcepPeerNumPCErrRcvd             0,\n          pcePcepPeerNumPCNtfSent             0,\n          pcePcepPeerNumPCNtfRcvd             0,\n          pcePcepPeerNumKeepaliveSent         123,\n          pcePcepPeerNumKeepaliveRcvd         123,\n          pcePcepPeerNumUnknownRcvd           0,\n          pcePcepPeerNumCorruptRcvd           0,\n          pcePcepPeerNumReqSent               0,\n          pcePcepPeerNumSvecSent              0,\n          pcePcepPeerNumSvecReqSent           0,\n          pcePcepPeerNumReqSentPendRep        0,\n          pcePcepPeerNumReqSentEroRcvd        0,\n          pcePcepPeerNumReqSentNoPathRcvd     0,\n          pcePcepPeerNumReqSentCancelRcvd     0,\n          pcePcepPeerNumReqSentErrorRcvd      0,\n          pcePcepPeerNumReqSentTimeout        0,\n          pcePcepPeerNumReqSentCancelSent     0,\n          pcePcepPeerNumReqSentClosed         0,\n          pcePcepPeerNumReqRcvd               4,\n          pcePcepPeerNumSvecRcvd              0,\n          pcePcepPeerNumSvecReqRcvd           0,\n          pcePcepPeerNumReqRcvdPendRep        0,\n          pcePcepPeerNumReqRcvdEroSent        3,\n          pcePcepPeerNumReqRcvdNoPathSent     1,\n          pcePcepPeerNumReqRcvdCancelSent     0,\n          pcePcepPeerNumReqRcvdErrorSent      0,\n          pcePcepPeerNumReqRcvdCancelRcvd     0,\n          pcePcepPeerNumReqRcvdClosed         0,\n          pcePcepPeerNumRepRcvdUnknown        0,\n          pcePcepPeerNumReqRcvdUnknown        0\n      }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   In pcePcepSessTable {\n          pcePcepSessInitiator                local(1), --PCE1\n          pcePcepSessStateLastChange          TimeStamp,\n          pcePcepSessState                    sessionUp(4),\n          pcePcepSessConnectRetry             0,\n          pcePcepSessLocalID                  1,\n          pcePcepSessRemoteID                 2,\n          pcePcepSessKeepaliveTimer           1,\n          pcePcepSessPeerKeepaliveTimer       1,\n          pcePcepSessDeadTimer                4,\n          pcePcepSessPeerDeadTimer            4,\n          pcePcepSessKAHoldTimeRem            1,\n          pcePcepSessOverloaded               false(0),\n          pcePcepSessOverloadTime             0,\n          pcePcepSessPeerOverloaded           false(0),\n          pcePcepSessPeerOverloadTime         0,\n          pcePcepSessDiscontinuityTime        TimeStamp,\n          pcePcepSessAvgRspTime               0,\n          pcePcepSessLWMRspTime               0,\n          pcePcepSessHWMRspTime               0,\n          pcePcepSessNumPCReqSent             0,\n          pcePcepSessNumPCReqRcvd             0,\n          pcePcepSessNumPCRepSent             0,\n          pcePcepSessNumPCRepRcvd             0,\n          pcePcepSessNumPCErrSent             0,\n          pcePcepSessNumPCErrRcvd             0,\n          pcePcepSessNumPCNtfSent             0,\n          pcePcepSessNumPCNtfRcvd             0,\n          pcePcepSessNumKeepaliveSent         123,\n          pcePcepSessNumKeepaliveRcvd         123,\n          pcePcepSessNumUnknownRcvd           0,\n          pcePcepSessNumCorruptRcvd           0,\n          pcePcepSessNumReqSent               0,\n          pcePcepSessNumSvecSent              0,\n          pcePcepSessNumSvecReqSent           0,\n          pcePcepSessNumReqSentPendRep        0,\n          pcePcepSessNumReqSentEroRcvd        0,\n          pcePcepSessNumReqSentNoPathRcvd     0,\n          pcePcepSessNumReqSentCancelRcvd     0,\n          pcePcepSessNumReqSentErrorRcvd      0,\n          pcePcepSessNumReqSentTimeout        0,\n          pcePcepSessNumReqSentCancelSent     0,\n          pcePcepSessNumReqRcvd               0,\n          pcePcepSessNumSvecRcvd              0,\n          pcePcepSessNumSvecReqRcvd           0,\n          pcePcepSessNumReqRcvdPendRep        0,\n          pcePcepSessNumReqRcvdEroSent        0,\n          pcePcepSessNumReqRcvdNoPathSent     0,\n          pcePcepSessNumReqRcvdCancelSent     0,\n          pcePcepSessNumReqRcvdErrorSent      0,\n          pcePcepSessNumReqRcvdCancelRcvd     0,\n          pcePcepSessNumRepRcvdUnknown        0,\n          pcePcepSessNumReqRcvdUnknown        0\n      },\n      {\n          pcePcepSessInitiator                remote(2), --PCCa\n          pcePcepSessStateLastChange          TimeStamp,\n          pcePcepSessState                    sessionUp(4),\n          pcePcepSessConnectRetry             0,\n          pcePcepSessLocalID                  2,\n          pcePcepSessRemoteID                 1,\n          pcePcepSessKeepaliveTimer           1,\n          pcePcepSessPeerKeepaliveTimer       1,\n          pcePcepSessDeadTimer                4,\n          pcePcepSessPeerDeadTimer            4,\n          pcePcepSessKAHoldTimeRem            1,\n          pcePcepSessOverloaded               false(0),\n          pcePcepSessOverloadTime             0,\n          pcePcepSessPeerOverloaded           false(0),\n          pcePcepSessPeerOverloadTime         0,\n          pcePcepSessDiscontinuityTime        TimeStamp,\n          pcePcepSessAvgRspTime               200,\n          pcePcepSessLWMRspTime               100,\n          pcePcepSessHWMRspTime               300,\n          pcePcepSessNumPCReqSent             0,\n          pcePcepSessNumPCReqRcvd             1,\n          pcePcepSessNumPCRepSent             1,\n          pcePcepSessNumPCRepRcvd             0,\n          pcePcepSessNumPCErrSent             0,\n          pcePcepSessNumPCErrRcvd             0,\n          pcePcepSessNumPCNtfSent             0,\n          pcePcepSessNumPCNtfRcvd             0,\n          pcePcepSessNumKeepaliveSent         123,\n          pcePcepSessNumKeepaliveRcvd         123,\n          pcePcepSessNumUnknownRcvd           0,\n          pcePcepSessNumCorruptRcvd           0,\n          pcePcepSessNumReqSent               0,\n          pcePcepSessNumSvecSent              0,\n          pcePcepSessNumSvecReqSent           0,\n          pcePcepSessNumReqSentPendRep        0,\n          pcePcepSessNumReqSentEroRcvd        0,\n          pcePcepSessNumReqSentNoPathRcvd     0,\n          pcePcepSessNumReqSentCancelRcvd     0,\n          pcePcepSessNumReqSentErrorRcvd      0,\n          pcePcepSessNumReqSentTimeout        0,\n          pcePcepSessNumReqSentCancelSent     0,\n          pcePcepSessNumReqRcvd               3,\n          pcePcepSessNumSvecRcvd              0,\n          pcePcepSessNumSvecReqRcvd           0,\n          pcePcepSessNumReqRcvdPendRep        0,\n          pcePcepSessNumReqRcvdEroSent        3,\n          pcePcepSessNumReqRcvdNoPathSent     0,\n          pcePcepSessNumReqRcvdCancelSent     0,\n          pcePcepSessNumReqRcvdErrorSent      0,\n          pcePcepSessNumReqRcvdCancelRcvd     0,\n          pcePcepSessNumRepRcvdUnknown        0,\n          pcePcepSessNumReqRcvdUnknown        0\n      },\n      {\n          pcePcepSessInitiator                remote(2), --PCCb\n          pcePcepSessStateLastChange          TimeStamp,\n          pcePcepSessState                    sessionUp(4),\n          pcePcepSessConnectRetry             0,\n          pcePcepSessLocalID                  2,\n          pcePcepSessRemoteID                 1,\n          pcePcepSessKeepaliveTimer           1,\n          pcePcepSessPeerKeepaliveTimer       1,\n          pcePcepSessDeadTimer                4,\n          pcePcepSessPeerDeadTimer            4,\n          pcePcepSessKAHoldTimeRem            1,\n          pcePcepSessOverloaded               false(0),\n          pcePcepSessOverloadTime             0,\n          pcePcepSessPeerOverloaded           false(0),\n          pcePcepSessPeerOverloadTime         0,\n          pcePcepSessDiscontinuityTime        TimeStamp,\n          pcePcepSessAvgRspTime               200,\n          pcePcepSessLWMRspTime               100,\n          pcePcepSessHWMRspTime               300,\n          pcePcepSessNumPCReqSent             0,\n          pcePcepSessNumPCReqRcvd             4,\n          pcePcepSessNumPCRepSent             4,\n          pcePcepSessNumPCRepRcvd             0,\n          pcePcepSessNumPCErrSent             0,\n          pcePcepSessNumPCErrRcvd             0,\n          pcePcepSessNumPCNtfSent             0,\n          pcePcepSessNumPCNtfRcvd             0,\n          pcePcepSessNumKeepaliveSent         123,\n          pcePcepSessNumKeepaliveRcvd         123,\n          pcePcepSessNumUnknownRcvd           0,\n          pcePcepSessNumCorruptRcvd           0,\n          pcePcepSessNumReqSent               0,\n          pcePcepSessNumSvecSent              0,\n          pcePcepSessNumSvecReqSent           0,\n          pcePcepSessNumReqSentPendRep        0,\n          pcePcepSessNumReqSentEroRcvd        0,\n          pcePcepSessNumReqSentNoPathRcvd     0,\n          pcePcepSessNumReqSentCancelRcvd     0,\n          pcePcepSessNumReqSentErrorRcvd      0,\n          pcePcepSessNumReqSentTimeout        0,\n          pcePcepSessNumReqSentCancelSent     0,\n          pcePcepSessNumReqRcvd               4,\n          pcePcepSessNumSvecRcvd              0,\n          pcePcepSessNumSvecReqRcvd           0,\n          pcePcepSessNumReqRcvdPendRep        0,\n          pcePcepSessNumReqRcvdEroSent        3,\n          pcePcepSessNumReqRcvdNoPathSent     1,\n          pcePcepSessNumReqRcvdCancelSent     0,\n          pcePcepSessNumReqRcvdErrorSent      0,\n          pcePcepSessNumReqRcvdCancelRcvd     0,\n          pcePcepSessNumRepRcvdUnknown        0,\n          pcePcepSessNumReqRcvdUnknown        0\n      }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "A.2. Contents of PCEP MIB Module at PCCb",
      "section_title": true,
      "ja": "A.2. PCCbでのPCEP MIBモジュールの内容"
    },
    {
      "indent": 3,
      "text": "At PCCb, there is a single local PCEP entity that has two peers (PCE2 and PCE3). There is a session active to PCE2, but the session to PCE3 is currently down.",
      "ja": "PCCbには、2つのピア（PCE2とPCE3）を持つ単一のローカルPCEPエンティティがあります。 PCE2へのアクティブなセッションがありますが、PCE3へのセッションは現在ダウンしています。"
    },
    {
      "indent": 3,
      "text": "The contents of the PCEP MIB module as read at PCCb are as follows.",
      "ja": "PCCbで読み取られるPCEP MIBモジュールの内容は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "In pcePcepEntityTable  {\n       pcePcepEntityIndex                1,\n       pcePcepEntityAdminStatus          adminStatusUp(1),\n       pcePcepEntityOperStatus           operStatusUp(1),\n       pcePcepEntityAddrType             ipv4(1),\n       pcePcepEntityAddr                 22.22.22.22, -- PCCb\n       pcePcepEntityConnectTimer         60,\n       pcePcepEntityConnectMaxRetry      5,\n       pcePcepEntityInitBackoffTimer     30,\n       pcePcepEntityMaxBackoffTimer      3600,\n       pcePcepEntityOpenWaitTimer        60,\n       pcePcepEntityKeepWaitTimer        60,\n       pcePcepEntityKeepAliveTimer       1,\n       pcePcepEntityDeadTimer            4,\n       pcePcepEntityAllowNegotiation     true(1),\n       pcePcepEntityMaxKeepAliveTimer    60,\n       pcePcepEntityMaxDeadTimer         240,\n       pcePcepEntityMinKeepAliveTimer    1,\n       pcePcepEntityMinDeadTimer         4,\n       pcePcepEntitySyncTimer            60,\n       pcePcepEntityRequestTimer         120,\n       pcePcepEntityMaxSessions          999,\n       pcePcepEntityMaxUnknownReqs       5,\n       pcePcepEntityMaxUnknownMsgs       5\n   }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   In pcePcepPeerTable {\n          pcePcepPeerAddrType                 ipv4(1), --PCE2\n          pcePcepPeerAddr                     2.2.2.2,\n          pcePcepPeerRole                     pce(2),\n          pcePcepPeerDiscontinuityTime        TimeStamp,\n          pcePcepPeerInitiateSession          true(1),\n          pcePcepPeerSessionExists            true(1)),\n          pcePcepPeerNumSessSetupOK           0,\n          pcePcepPeerNumSessSetupFail         1,\n          pcePcepPeerSessionUpTime            TimeStamp,\n          pcePcepPeerSessionFailTime          TimeStamp,\n          pcePcepPeerSessionFailUpTime        TimeStamp,\n          pcePcepPeerAvgRspTime               0,\n          pcePcepPeerLWMRspTime               0,\n          pcePcepPeerHWMRspTime               0,\n          pcePcepPeerNumPCReqSent             4,\n          pcePcepPeerNumPCReqRcvd             0,\n          pcePcepPeerNumPCRepSent             0,\n          pcePcepPeerNumPCRepRcvd             4,\n          pcePcepPeerNumPCErrSent             0,\n          pcePcepPeerNumPCErrRcvd             0,\n          pcePcepPeerNumPCNtfSent             0,\n          pcePcepPeerNumPCNtfRcvd             0,\n          pcePcepPeerNumKeepaliveSent         0,\n          pcePcepPeerNumKeepaliveRcvd         0,\n          pcePcepPeerNumUnknownRcvd           0,\n          pcePcepPeerNumCorruptRcvd           0,\n          pcePcepPeerNumReqSent               4,\n          pcePcepPeerNumSvecSent              0,\n          pcePcepPeerNumSvecReqSent           0,\n          pcePcepPeerNumReqSentPendRep        0,\n          pcePcepPeerNumReqSentEroRcvd        3,\n          pcePcepPeerNumReqSentNoPathRcvd     1,\n          pcePcepPeerNumReqSentCancelRcvd     0,\n          pcePcepPeerNumReqSentErrorRcvd      0,\n          pcePcepPeerNumReqSentTimeout        0,\n          pcePcepPeerNumReqSentCancelSent     0,\n          pcePcepPeerNumReqSentClosed         0,\n          pcePcepPeerNumReqRcvd               0,\n          pcePcepPeerNumSvecRcvd              0,\n          pcePcepPeerNumSvecReqRcvd           0,\n          pcePcepPeerNumReqRcvdPendRep        0,\n          pcePcepPeerNumReqRcvdEroSent        0,\n          pcePcepPeerNumReqRcvdNoPathSent     0,\n          pcePcepPeerNumReqRcvdCancelSent     0,\n          pcePcepPeerNumReqRcvdErrorSent      0,\n          pcePcepPeerNumReqRcvdCancelRcvd     0,\n          pcePcepPeerNumReqRcvdClosed         0,\n          pcePcepPeerNumRepRcvdUnknown        0,\n          pcePcepPeerNumReqRcvdUnknown        0\n      },\n      {\n          pcePcepPeerAddrType                 ipv4(1),  --PCE3\n          pcePcepPeerAddr                     3.3.3.3,\n          pcePcepPeerRole                     pce(2),\n          pcePcepPeerDiscontinuityTime        TimeStamp,\n          pcePcepPeerInitiateSession          true(1),\n          pcePcepPeerSessionExists            false(0),\n          pcePcepPeerNumSessSetupOK           1,\n          pcePcepPeerNumSessSetupFail         0,\n          pcePcepPeerSessionUpTime            TimeStamp,\n          pcePcepPeerSessionFailTime          TimeStamp,\n          pcePcepPeerSessionFailUpTime        TimeStamp,\n          pcePcepPeerAvgRspTime               200,\n          pcePcepPeerLWMRspTime               100,\n          pcePcepPeerHWMRspTime               300,\n          pcePcepPeerNumPCReqSent             4,\n          pcePcepPeerNumPCReqRcvd             0,\n          pcePcepPeerNumPCRepSent             0,\n          pcePcepPeerNumPCRepRcvd             3,\n          pcePcepPeerNumPCErrSent             0,\n          pcePcepPeerNumPCErrRcvd             0,\n          pcePcepPeerNumPCNtfSent             0,\n          pcePcepPeerNumPCNtfRcvd             0,\n          pcePcepPeerNumKeepaliveSent         123,\n          pcePcepPeerNumKeepaliveRcvd         123,\n          pcePcepPeerNumUnknownRcvd           0,\n          pcePcepPeerNumCorruptRcvd           0,\n          pcePcepPeerNumReqSent               4,\n          pcePcepPeerNumSvecSent              0,\n          pcePcepPeerNumSvecReqSent           0,\n          pcePcepPeerNumReqSentPendRep        0,\n          pcePcepPeerNumReqSentEroRcvd        3,\n          pcePcepPeerNumReqSentNoPathRcvd     0,\n          pcePcepPeerNumReqSentCancelRcvd     0,\n          pcePcepPeerNumReqSentErrorRcvd      0,\n          pcePcepPeerNumReqSentTimeout        0,\n          pcePcepPeerNumReqSentCancelSent     0,\n          pcePcepPeerNumReqSentClosed         1,\n          pcePcepPeerNumReqRcvd               0,\n          pcePcepPeerNumSvecRcvd              0,\n          pcePcepPeerNumSvecReqRcvd           0,\n          pcePcepPeerNumReqRcvdPendRep        0,\n          pcePcepPeerNumReqRcvdEroSent        0,\n          pcePcepPeerNumReqRcvdNoPathSent     0,\n          pcePcepPeerNumReqRcvdCancelSent     0,\n          pcePcepPeerNumReqRcvdErrorSent      0,\n          pcePcepPeerNumReqRcvdCancelRcvd     0,\n          pcePcepPeerNumReqRcvdClosed         0,\n          pcePcepPeerNumRepRcvdUnknown        0,\n          pcePcepPeerNumReqRcvdUnknown        0\n      }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "   In pcePcepSessTable {\n          pcePcepSessInitiator                local(1), --PCE2\n          pcePcepSessStateLastChange          TimeStamp,\n          pcePcepSessState                    sessionUp(4),\n          pcePcepSessConnectRetry             0,\n          pcePcepSessLocalID                  1,\n          pcePcepSessRemoteID                 1,\n          pcePcepSessKeepaliveTimer           1,\n          pcePcepSessPeerKeepaliveTimer       1,\n          pcePcepSessDeadTimer                4,\n          pcePcepSessPeerDeadTimer            4,\n          pcePcepSessKAHoldTimeRem            1,\n          pcePcepSessOverloaded               false(0),\n          pcePcepSessOverloadTime             0,\n          pcePcepSessPeerOverloaded           false(0),\n          pcePcepSessPeerOverloadTime         0,\n          pcePcepSessDiscontinuityTime        TimeStamp,\n          pcePcepSessAvgRspTime               200,\n          pcePcepSessLWMRspTime               100,\n          pcePcepSessHWMRspTime               300,\n          pcePcepSessNumPCReqSent             4,\n          pcePcepSessNumPCReqRcvd             0,\n          pcePcepSessNumPCRepSent             0,\n          pcePcepSessNumPCRepRcvd             4,\n          pcePcepSessNumPCErrSent             0,\n          pcePcepSessNumPCErrRcvd             0,\n          pcePcepSessNumPCNtfSent             0,\n          pcePcepSessNumPCNtfRcvd             0,\n          pcePcepSessNumKeepaliveSent         123,\n          pcePcepSessNumKeepaliveRcvd         123,\n          pcePcepSessNumUnknownRcvd           0,\n          pcePcepSessNumCorruptRcvd           0,\n          pcePcepSessNumReqSent               4,\n          pcePcepSessNumSvecSent              0,\n          pcePcepSessNumSvecReqSent           0,\n          pcePcepSessNumReqSentPendRep        0,\n          pcePcepSessNumReqSentEroRcvd        3,\n          pcePcepSessNumReqSentNoPathRcvd     1,\n          pcePcepSessNumReqSentCancelRcvd     0,\n          pcePcepSessNumReqSentErrorRcvd      0,\n          pcePcepSessNumReqSentTimeout        0,\n          pcePcepSessNumReqSentCancelSent     0,\n          pcePcepSessNumReqRcvd               0,\n          pcePcepSessNumSvecRcvd              0,\n          pcePcepSessNumSvecReqRcvd           0,\n          pcePcepSessNumReqRcvdPendRep        0,\n          pcePcepSessNumReqRcvdEroSent        0,\n          pcePcepSessNumReqRcvdNoPathSent     0,\n          pcePcepSessNumReqRcvdCancelSent     0,\n          pcePcepSessNumReqRcvdErrorSent      0,\n          pcePcepSessNumReqRcvdCancelRcvd     0,\n          pcePcepSessNumRepRcvdUnknown        0,\n          pcePcepSessNumReqRcvdUnknown        0\n      }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "-- no session to PCE3",
      "ja": "-PCE3へのセッションなし"
    },
    {
      "indent": 1,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Santanu Mazumder, Meral Shirazipour, and Adrian Farrel for their valuable input.",
      "ja": "著者は、貴重な情報を提供してくれたSantanu Mazumder、Meral Shirazipour、およびAdrian Farrelに感謝します。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "貢献者"
    },
    {
      "indent": 3,
      "text": "Dhruv Dhody Huawei Technologies Leela Palace Bangalore, Karnataka 560008 India",
      "ja": "Dhruv Dhody Huawei Technologies Leela Palace Bangalore、Karnataka、560008 India"
    },
    {
      "indent": 3,
      "text": "EMail: dhruv.ietf@gmail.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Agrahara Kiran Koushik Brocade Communications, Inc.",
      "ja": "Agrahara Kiran Koushik Brocade Communications, Inc."
    },
    {
      "indent": 3,
      "text": "EMail: kkoushik@brocade.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Emile Stephan Orange 2 Avenue Pierre Marzin Lannion F-22307 France",
      "ja": "エミールステファンオレンジ2アベニューピエールマルザンラニオンF-22307フランス"
    },
    {
      "indent": 3,
      "text": "EMail: emile.stephan@orange.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Quintin Zhao Huawei Technology 125 Nagog Technology Park Acton, MA 01719 United States",
      "ja": "Quintin Zhao Huawei Technology 125 Nagog Technology Park Acton, MA 01719 United States"
    },
    {
      "indent": 3,
      "text": "EMail: qzhao@huawei.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Daniel King Old Dog Consulting",
      "ja": "Daniel King Old Dog Consulting"
    },
    {
      "indent": 3,
      "text": "EMail: daniel@olddog.co.uk",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Jonathan Hardwick Metaswitch 100 Church Street Enfield EN2 6BQ United Kingdom",
      "ja": "Jonathan Hardwick Metaswitch 100 Church Street Enfield EN2 6BQ United Kingdom"
    },
    {
      "indent": 3,
      "text": "EMail: jonathan.hardwick@metaswitch.com",
      "raw": true,
      "ja": ""
    }
  ]
}