{
  "title": {
    "text": "RFC 7962 - Alternative Network Deployments: Taxonomy, Characterization, Technologies, and Architectures",
    "ja": "RFC 7962 - 代替ネットワーク展開：分類、特性評価、技術、およびアーキテクチャ"
  },
  "number": 7962,
  "created_at": "2019-11-02 18:10:12.367645+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Research Task Force (IRTF)                      J. Saldana, Ed.\nRequest for Comments: 7962                        University of Zaragoza\nCategory: Informational                                   A. Arcia-Moret\nISSN: 2070-1721                                  University of Cambridge\n                                                                B. Braem\n                                                                  iMinds\n                                                         E. Pietrosemoli\n                                                    The Abdus Salam ICTP\n                                                         A. Sathiaseelan\n                                                 University of Cambridge\n                                                              M. Zennaro\n                                                    The Abdus Salam ICTP\n                                                             August 2016",
      "raw": true
    },
    {
      "indent": 6,
      "text": "              Alternative Network Deployments:\nTaxonomy, Characterization, Technologies, and Architectures",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document presents a taxonomy of a set of \"Alternative Network Deployments\" that emerged in the last decade with the aim of bringing Internet connectivity to people or providing a local communication infrastructure to serve various complementary needs and objectives. They employ architectures and topologies different from those of mainstream networks and rely on alternative governance and business models.",
      "ja": "この文書は、人々にインターネット接続をもたらすか、様々な補完的なニーズや目的を果たすために、ローカル通信インフラを提供することを目的に10年で登場し、「代替ネットワーク展開」のセットの分類法を提示しています。彼らは、主流のネットワークのものとは異なるアーキテクチャおよびトポロジーを採用し、代替ガバナンスやビジネスモデルに依存しています。"
    },
    {
      "indent": 3,
      "text": "The document also surveys the technologies deployed in these networks, and their differing architectural characteristics, including a set of definitions and shared properties.",
      "ja": "文書はまた、定義と共有プロパティのセットを含む、これらのネットワークで展開テクノロジ、およびそれらの異なるアーキテクチャの特性を調査し。"
    },
    {
      "indent": 3,
      "text": "The classification considers models such as Community Networks, Wireless Internet Service Providers (WISPs), networks owned by individuals but leased out to network operators who use them as a low-cost medium to reach the underserved population, networks that provide connectivity by sharing wireless resources of the users, and rural utility cooperatives.",
      "ja": "分類は、無線リソースを共有することにより、接続性を提供し、このようなコミュニティ・ネットワーク、ワイヤレスインターネットサービスプロバイダ（WISP）、個人が所有しているが、不十分な人口に到達するために低コストの媒体としてそれらを使用するネットワークオペレータに出賃貸ネットワーク、ネットワークなどのモデルを検討しますユーザー、および農村ユーティリティ協同組合の。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Research Task Force (IRTF). The IRTF publishes the results of Internet-related research and development activities. These results might not be suitable for deployment. This RFC represents the consensus of the Global Access to the Internet for All Research Group of the Internet Research Task Force (IRTF). Documents approved for publication by the IRSG are not a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "この文書はインターネットResearch Task Force（IRTF）の製品です。 IRTFはインターネット関連の研究開発活動の成果を公表しています。これらの結果は、展開に適していない可能性があります。このRFCはインターネットリサーチタスクフォースのすべての研究グループ（IRTF）のためのインターネットへのグローバルアクセスのコンセンサスを表しています。 IRSGによって公表のために承認されたドキュメントは、インターネット標準の任意のレベルの候補ではありません。 RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7962.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7962で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   4\n  1.1.  Mainstream Networks . . . . . . . . . . . . . . . . . . .   5\n  1.2.  Alternative Networks  . . . . . . . . . . . . . . . . . .   5\n2.  Terms Used in This Document . . . . . . . . . . . . . . . . .   5\n3.  Scenarios Where Alternative Networks Are Deployed . . . . . .   7\n  3.1.  Urban vs. Rural Areas . . . . . . . . . . . . . . . . . .   8\n  3.2.  Topology Patterns Followed by Alternative Networks  . . .   9\n4.  Classification Criteria . . . . . . . . . . . . . . . . . . .  10\n  4.1.  Entity behind the Network . . . . . . . . . . . . . . . .  10\n  4.2.  Purpose . . . . . . . . . . . . . . . . . . . . . . . . .  10\n  4.3.  Governance and Sustainability Model . . . . . . . . . . .  12\n  4.4.  Technologies Employed . . . . . . . . . . . . . . . . . .  12\n  4.5.  Typical Scenarios . . . . . . . . . . . . . . . . . . . .  13\n5.  Classification of Alternative Networks  . . . . . . . . . . .  13\n  5.1.  Community Networks  . . . . . . . . . . . . . . . . . . .  14\n  5.2.  Wireless Internet Service Providers (WISPs) . . . . . . .  16\n  5.3.  Shared Infrastructure Model . . . . . . . . . . . . . . .  17\n  5.4.  Crowdshared Approaches Led by the Users and Third-Party\n        Stakeholders  . . . . . . . . . . . . . . . . . . . . . .  19\n  5.5.  Rural Utility Cooperatives  . . . . . . . . . . . . . . .  21\n  5.6.  Testbeds for Research Purposes  . . . . . . . . . . . . .  22\n6.  Technologies Employed . . . . . . . . . . . . . . . . . . . .  22\n  6.1.  Wired . . . . . . . . . . . . . . . . . . . . . . . . . .  22\n  6.2.  Wireless  . . . . . . . . . . . . . . . . . . . . . . . .  22\n    6.2.1.  Media Access Control (MAC) Protocols for Wireless\n            Links . . . . . . . . . . . . . . . . . . . . . . . .  23\n      6.2.1.1.  802.11 (Wi-Fi)  . . . . . . . . . . . . . . . . .  23\n      6.2.1.2.  Mobile Technologies . . . . . . . . . . . . . . .  24\n      6.2.1.3.  Dynamic Spectrum  . . . . . . . . . . . . . . . .  24\n7.  Upper Layers  . . . . . . . . . . . . . . . . . . . . . . . .  26\n  7.1.  Layer 3 . . . . . . . . . . . . . . . . . . . . . . . . .  26\n    7.1.1.  IP Addressing . . . . . . . . . . . . . . . . . . . .  26\n    7.1.2.  Routing Protocols . . . . . . . . . . . . . . . . . .  26\n      7.1.2.1.  Traditional Routing Protocols . . . . . . . . . .  26\n      7.1.2.2.  Mesh Routing Protocols  . . . . . . . . . . . . .  27\n  7.2.  Transport Layer . . . . . . . . . . . . . . . . . . . . .  27\n    7.2.1.  Traffic Management When Sharing Network Resources . .  27\n  7.3.  Services Provided . . . . . . . . . . . . . . . . . . . .  28\n    7.3.1.  Use of VPNs . . . . . . . . . . . . . . . . . . . . .  29\n    7.3.2.  Other Facilities  . . . . . . . . . . . . . . . . . .  29\n  7.4.  Security Considerations . . . . . . . . . . . . . . . . .  29\n8.  Informative References  . . . . . . . . . . . . . . . . . . .  30\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  40\nContributors  . . . . . . . . . . . . . . . . . . . . . . . . . .  41\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  42",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "One of the aims of the Global Access to the Internet for All (GAIA) IRTF Research Group is \"to document and share deployment experiences and research results to the wider community through scholarly publications, white papers, Informational and Experimental RFCs, etc.\" [GAIA]. In line with this objective, this document proposes a classification of \"Alternative Network Deployments\". This term includes a set of network access models that have emerged in the last decade with the aim of providing Internet connections, following topological, architectural, governance, and business models that differ from the so-called \"mainstream\" ones, where a company deploys the infrastructure connecting the users, who pay a subscription fee to be connected and make use of it.",
      "ja": "すべて（GAIA）IRTF研究グループのためのインターネットへのグローバルアクセスの目的の一つは、「ホワイトペーパーなど、情報および実験的RFCを、文書化し、学術出版物を通じて、より広いコミュニティへの展開の経験と研究成果を共有すること」であります[GAIA]。この目的に沿って、この文書は「代替ネットワーク展開」の分類を提案しています。この用語は、同社が展開し、いわゆる「主流」のものと異なる位相幾何学、建築、ガバナンス、およびビジネスモデル以下、インターネット接続を提供することを目的に10年で浮上しているネットワーク・アクセス・モデルのセットを含み、接続されており、それを利用することが購読料を支払うユーザーは、接続するインフラ。"
    },
    {
      "indent": 3,
      "text": "Several initiatives throughout the world have built these large-scale networks, using predominantly wireless technologies (including long distance links) due to the reduced cost of using unlicensed spectrum. Wired technologies such as fiber are also used in some of these networks.",
      "ja": "世界中のいくつかの取り組みが原因無免許のスペクトルを使用してのコスト削減に（長距離リンクを含む）は、主に無線技術を使用して、これらの大規模なネットワークを構築しています。ファイバなどの有線技術はまた、これらのネットワークの一部で使用されています。"
    },
    {
      "indent": 3,
      "text": "The classification considers several types of alternate deployments: Community Networks are self-organized networks wholly owned by the community; networks acting as Wireless Internet Service Providers (WISPs); networks owned by individuals but leased out to network operators who use such networks as a low-cost medium to reach the underserved population; networks that provide connectivity by sharing wireless resources of the users; and finally there are some rural utility cooperatives also connecting their members to the Internet.",
      "ja": "分類は、代替展開のいくつかのタイプを考慮：コミュニティネットワークは完全にコミュニティが所有する自己組織化ネットワークです。ワイヤレスインターネットサービスプロバイダ（WISP）として動作するネットワーク。個人が所有しているが、不十分な人口に到達するための低コストの媒体として、このようなネットワークを使用するネットワーク事業者にアウト賃貸ネットワーク。ユーザーの無線リソースを共有することにより、接続を提供するネットワーク。そして最終的には、インターネットへの接続部材を、いくつかの農村ユーティリティ協同組合があります。"
    },
    {
      "indent": 3,
      "text": "The emergence of these networks has been motivated by a variety of factors such as the lack of wired and cellular infrastructures in rural/remote areas [Pietrosemoli]. In some cases, Alternative Networks may provide more localized communication services as well as Internet backhaul support through peering agreements with mainstream network operators. In other cases, they are built as a complement or an alternative to commercial Internet access provided by mainstream network operators.",
      "ja": "これらのネットワークの出現は、農村/遠隔地[Pietrosemoli]における有線およびセルラーインフラストラクチャの欠如などの種々の要因によって動機付けされています。いくつかのケースでは、代替ネットワークは、主流のネットワーク事業者とのピアリング契約を通じてより局所的な通信サービスだけでなく、インターネットのバックホールのサポートを提供することができます。他の例では、彼らは、補体または主流のネットワークオペレータが提供する商用のインターネットアクセスに代わるものとして構築されています。"
    },
    {
      "indent": 3,
      "text": "The present document is intended to provide a broad overview of initiatives, technologies, and approaches employed in these networks, including some real examples. References describing each kind of network are also provided.",
      "ja": "現在のドキュメントは、いくつかの実際の例を含むこれらのネットワークで採用取り組み、技術、およびアプローチの概観を、提供することを意図しています。ネットワークの各種類を記述する参考文献もまた提供されます。"
    },
    {
      "indent": 0,
      "text": "1.1. Mainstream Networks",
      "section_title": true,
      "ja": "1.1. 主流のネットワーク"
    },
    {
      "indent": 3,
      "text": "In this document, we will use the term \"mainstream networks\" to denote those networks sharing these characteristics:",
      "ja": "この文書では、我々はこれらの特性を共有するこれらのネットワークを示すために、用語「主流のネットワーク」を使用します："
    },
    {
      "indent": 3,
      "text": "o Regarding scale, they are usually large networks spanning entire regions.",
      "ja": "規模に関しては、O、彼らは通常、全体の地域にまたがる大規模なネットワークです。"
    },
    {
      "indent": 3,
      "text": "o Top-down control of the network and centralized approach.",
      "ja": "Oトップダウンネットワークの制御と集中アプローチ。"
    },
    {
      "indent": 3,
      "text": "o They require a substantial investment in infrastructure.",
      "ja": "O彼らは、インフラへの多額の投資を必要としています。"
    },
    {
      "indent": 3,
      "text": "o Users in mainstream networks do not participate in the network design, deployment, operation, governance, and maintenance.",
      "ja": "O主流のネットワークのユーザーは、ネットワークの設計、導入、運用、ガバナンス、およびメンテナンスに参加しません。"
    },
    {
      "indent": 3,
      "text": "o Ownership of the network is never vested in the users themselves.",
      "ja": "Oネットワークの所有権はユーザー自身に帰属されることはありません。"
    },
    {
      "indent": 0,
      "text": "1.2. Alternative Networks",
      "section_title": true,
      "ja": "1.2. オルタナティブ・ネットワーク"
    },
    {
      "indent": 3,
      "text": "The term \"Alternative Network\" proposed in this document refers to the networks that do not share the characteristics of \"mainstream network deployments\". Therefore, they may share some of the following characteristics:",
      "ja": "この文書で提案されている用語「代替ネットワークは、」「主流のネットワーク展開」の特性を共有していないネットワークを指します。そのため、彼らは次のような特徴のいくつかを共有することがあります。"
    },
    {
      "indent": 3,
      "text": "o Relatively small scale (i.e., not spanning entire regions).",
      "ja": "O比較的小規模（すなわち、全領域に及ぶありません）。"
    },
    {
      "indent": 3,
      "text": "o Administration may not follow a centralized approach.",
      "ja": "Oの管理は、集中的なアプローチに従っていないことがあります。"
    },
    {
      "indent": 3,
      "text": "o They may require a reduced investment in infrastructure, which may be shared by the users and commercial and non-commercial entities.",
      "ja": "O彼らは、ユーザーおよび商用、非営利団体で共有することができるインフラへの投資抑制を必要とする可能性があります。"
    },
    {
      "indent": 3,
      "text": "o Users in Alternative Networks may participate in the network design, deployment, operation, and maintenance.",
      "ja": "Oオルタナティブ・ネットワークのユーザーは、ネットワークの設計、導入、運用、保守に参加することができます。"
    },
    {
      "indent": 3,
      "text": "o Ownership of the network is often vested in the users.",
      "ja": "Oネットワークの所有権は、多くの場合、ユーザーに付与されます。"
    },
    {
      "indent": 0,
      "text": "2. Terms Used in This Document",
      "section_title": true,
      "ja": "このドキュメントで使用する2.利用規約"
    },
    {
      "indent": 3,
      "text": "Considering the role that the Internet currently plays in everyday life, this document touches on complex social, political, and economic issues. Some of the concepts and terminology used have been the subject of study of various disciplines outside the field of networking and are responsible for long debates whose resolution is out of the scope of this document.",
      "ja": "インターネットは現在、日常生活の中で果たす役割を考えると、この文書では、複雑な、社会的、政治的、そして経済的な問題に触れます。使用される概念と用語のいくつかは、ネットワーキングの分野以外の様々な分野の研究の対象となって、その解像度、この文書の範囲外で長い議論を担当しているしています。"
    },
    {
      "indent": 3,
      "text": "o \"Global north\" and \"global south\". Although there is no consensus on the terms to be used when talking about the different development level of countries, we will employ the term \"global south\" to refer to nations with a relatively lower standard of living. This distinction is normally intended to reflect basic economic country conditions. In common practice, Japan in Asia, Canada and the United States in northern America, Australia and New Zealand in Oceania, and Europe are considered \"developed\" regions or areas [UN], so we will employ the term \"global north\" when talking about them.",
      "ja": "O「グローバル北」と「グローバル南」。国の異なる開発レベルの話をするときに使用される用語には何のコンセンサスはありませんが、私たちは生活の比較的低い標準で国を参照するための用語「グローバル南」を採用します。この区別は、通常、基本的な経済国の状況を反映することを意図しています。一般的な方法では、アジア、カナダ、オセアニアでは北部アメリカ、オーストラリア、ニュージーランドでは、米国、およびヨーロッパで日本が考慮されている地域や分野[UN]「開発」、そう話すとき、私たちは、用語「グローバル北」を採用しますそれらについて。"
    },
    {
      "indent": 3,
      "text": "o The \"Digital Divide\". The following dimensions are considered to be meaningful when measuring the digital development state of a country: infrastructures (availability and affordability), the Information and Communications Technology (ICT) sector (human capital and technological industry), digital literacy, legal and regulatory framework, and content and services. A lack of digital development in one or more of these dimensions is what has been referred as the \"Digital Divide\" [Norris]. It should be noted that this \"Divide\" is not only present between different countries but between zones of the same country, despite its degree of development.",
      "ja": "「デジタルデバイド」O。インフラ（可用性と手頃な価格）、情報通信技術（ICT）部門（人的資本と技術産業）、デジタルリテラシー、法律や規制の枠組み、：国のデジタル発展状態を測定する場合は、次の寸法が有意義であると考えられていますそしてコンテンツおよびサービス。これらの寸法の一つ以上のデジタル開発の欠如は、「デジタルデバイド」[ノリス]と呼ばれているものです。この「分割」は、開発の程度にもかかわらず、異なる国の間ではなく、同じ国のゾーンの間だけ存在していないことに留意すべきです。"
    },
    {
      "indent": 3,
      "text": "o \"Urban\" and \"rural\" zones. There is no single definition of \"rural\" or \"urban\", as each country and various international organizations define these terms differently, mainly based on the number of inhabitants, the population density, and the distance between houses [UNStats]. For networking purposes, the primary distinction is likely the average distance between customers, typically measured by population density, as well as the distance to the nearest Internet point-of-presence, i.e., the distance to be covered by \"middle mile\" or backhaul connectivity. Some regions with low average population density may cluster almost all inhabitants into a small number of relatively dense small towns, for example, while residents may be dispersed more evenly in others.",
      "ja": "O「都市」と「農村」のゾーン。 「農村」や「都市」の単一の定義は、主に住民の数、人口密度、および[UNStats]家の間の距離に基づいて、異なったこれらの用語を定義し、それぞれの国や様々な国際機関として、ありません。ネットワーキングの目的のために、主な違いは、一般的に人口密度によって測定された顧客との間の平均距離、だけでなく、最寄りのインターネットポイントオブプレゼンスすなわち、距離が「ミドルマイル」によってカバーされる、またはバックホールまでの距離がありそうです接続。住民が他でより均一に分散させることができるが、低平均人口密度を有するいくつかの領域は、例えば、比較的高密度の小さな町の小さな数にほぼすべての住民をクラスタ化してもよいです。"
    },
    {
      "indent": 3,
      "text": "o Demand. In economics, it describes a consumer's desire and willingness to pay a price for a specific good or service.",
      "ja": "O需要。経済学では、それが消費者の欲望と、特定の商品またはサービスの料金を支払うことに意欲を示しています。"
    },
    {
      "indent": 3,
      "text": "o Provision is the act of making an asset available for sale. In this document, we will mainly use it as the act of making a network service available to the inhabitants of a zone.",
      "ja": "Oの提供は、売却可能資産を作る行為です。この文書では、我々は、主にゾーンの住民に利用可能なネットワークサービスを作るの行為としてそれを使用します。"
    },
    {
      "indent": 3,
      "text": "o Underserved area. Area in which the telecommunication market permanently fails to provide the information and communications services demanded by the population.",
      "ja": "O行き届かない地域。通信市場は、恒久的に人口が要求する情報通信サービスを提供するために失敗しているエリア。"
    },
    {
      "indent": 3,
      "text": "o Free, open, and neutral networks. Their principles have been summarized this way [Baig]:",
      "ja": "Oフリー、オープン、およびニュートラルネットワーク。彼らの原則は、このよう[Baig]要約されています。"
    },
    {
      "indent": 6,
      "text": "* You have the freedom to use the network for any purpose as long as you do not harm the operation of the network itself, the rights of other users, or the principles of neutrality that allow contents and services to flow without deliberate interference.",
      "ja": "*あなたはネットワーク自体の動作を損なわない限り、任意の目的のためにネットワークを使用する自由を持って、他のユーザーの権利、またはコンテンツやサービスが意図的な干渉を受けることなく流れることができる中立性の原則。"
    },
    {
      "indent": 6,
      "text": "* You have the right to understand the network, to know its components, and to spread knowledge of its mechanisms and principles.",
      "ja": "*あなたは、ネットワークを理解するために、そのコンポーネントを知って、そしてそのメカニズムと原則についての知識を広めるために権利を持っています。"
    },
    {
      "indent": 6,
      "text": "* You have the right to offer services and content to the network on your own terms.",
      "ja": "*あなたがあなた自身の条件で、ネットワークにサービスやコンテンツを提供する権利を持っています。"
    },
    {
      "indent": 6,
      "text": "* You have the right to join the network, and the responsibility to extend this set of rights to anyone according to these same terms.",
      "ja": "*あなたは、これらと同じ条件に応じて誰にも権利のこのセットを拡張するためにネットワークに参加する権利、および責任を持っています。"
    },
    {
      "indent": 0,
      "text": "3. Scenarios Where Alternative Networks Are Deployed",
      "section_title": true,
      "ja": "オルタナティブ・ネットワークが展開されている3.シナリオ"
    },
    {
      "indent": 3,
      "text": "Different studies have reported that as much as 60% of the people on the planet do not have Internet connectivity [Sprague] [InternetStats]. In addition, those unconnected are unevenly distributed: only 31% of the population in \"global south\" countries had access in 2014, against 80% in \"global north\" countries [WorldBank2016]. This is one of the reasons behind the inclusion of the objective to \"significantly increase access to information and communications technology and strive to provide universal and affordable access to the Internet in least developed countries by 2020,\" as one of the targets in the Sustainable Development Goals (SDGs) [SDG], considered as a part of \"Goal 9. Build resilient infrastructure, promote inclusive and sustainable industrialization and foster innovation.\"",
      "ja": "別の研究では、地球上の人々の最大60％がインターネットに接続[スプラーグ] [InternetStats]を持っていないことを報告しています。また、接続されていないものが偏在している：「グローバル南」の国の人口のわずか31％は、[WorldBank2016]「グローバル北」の国で80％に対して、2014年にアクセスし、持っていました。これは、持続可能な開発における目標の一つとして「大幅に情報通信技術へのアクセスを増やし、2020年までに少なくとも先進国では、インターネットへのユニバーサルで手頃なアクセスを提供するために努力する」目的を含めることの背後にある理由の一つであります一部とみなさ目標（SDGs）[SDG]、「ゴール9ビルド弾力性のインフラストラクチャは、包括的かつ持続可能な産業化と里親技術革新を推進しています。」"
    },
    {
      "indent": 3,
      "text": "For the purpose of this document, a distinction between \"global north\" and \"global south\" zones is made, highlighting the factors related to ICT, which can be quantified in terms of:",
      "ja": "本文書の目的のために、「グローバル北」と「南グローバル」ゾーンとの間の区別は換算で定量化することができるICTに関連する要因を、ハイライト、行われます。"
    },
    {
      "indent": 3,
      "text": "o The availability of both national and international bandwidth, as well as equipment.",
      "ja": "国内および国際の両方帯域幅の利用可能性だけでなく、機器のO。"
    },
    {
      "indent": 3,
      "text": "o The difficulty in paying for the services and the devices required to access the ICTs.",
      "ja": "サービスや情報通信技術へのアクセスに必要なデバイスのために支払うのが困難O。"
    },
    {
      "indent": 3,
      "text": "o The instability and/or lack of power supply.",
      "ja": "O不安定性および/または電力供給の不足。"
    },
    {
      "indent": 3,
      "text": "o The scarcity of qualified staff.",
      "ja": "有能なスタッフの不足、O。"
    },
    {
      "indent": 3,
      "text": "o The existence of a policy and regulatory framework that hinders the development of these models in favor of state monopolies or incumbents.",
      "ja": "国家独占または現職の賛成でこれらのモデルの開発を妨げる政策と規制の枠組みの存在、O。"
    },
    {
      "indent": 3,
      "text": "In this context, the World Summit of the Information Society [WSIS] aimed at achieving \"a people-centred, inclusive and development-oriented Information Society, where everyone can create, access, utilize and share information and knowledge. Therefore, enabling individuals, communities and people to achieve their full potential in promoting their sustainable development and improving their quality of life\". It also called upon \"governments, private sector, civil society and international organizations\" to actively engage to work towards the bridging of the digital divide.",
      "ja": "この文脈では、情報社会の世界サミットは、[WSIS]誰もが、アクセスを作成して利用し、情報や知識を共有することができ、「人間中心の、包括的で開発志向の情報社会を、達成することを目的とした。そのため、個人を有効にします、 「彼らの持続的な発展を促進し、生活の質を向上させる上で自分の可能性を最大限に達成するために、地域社会や人々。また、積極的にデジタル・デバイドのブリッジに向けて努力して従事し、「政府、民間部門、市民社会、国際機関」に呼びかけ。"
    },
    {
      "indent": 3,
      "text": "Some Alternative Networks have been deployed in underserved areas, where citizens may be compelled to take a more active part in the design and implementation of ICT solutions. However, Alternative Networks (e.g., [Baig]) are also present in some \"global north\" countries, being built as an alternative to commercial ones managed by mainstream network operators.",
      "ja": "いくつかの代替Networksは、市民がICTソリューションの設計と実装により積極的な参加することを強制することができるない地域で展開されています。しかし、代替ネットワーク（例えば、[Baig]）も、主流のネットワークオペレータによって管理される商業用のものに代わるものとして構築されて、いくつかの「グローバル北」の国に存在しています。"
    },
    {
      "indent": 3,
      "text": "The consolidation of a number of mature Alternative Networks (e.g., Community Networks) sets a precedent for civil society members to become more active in the search for alternatives to provide themselves with affordable access. Furthermore, Alternative Networks could contribute to bridge the digital divide by increasing human capital and promoting the creation of localized content and services.",
      "ja": "成熟した代替ネットワーク（例えば、コミュニティ・ネットワーク）の数の統合は、市民社会のメンバーは、手頃な価格のアクセスを自分自身を提供するために、代替のための検索では、より積極的になるための先例を設定します。さらに、代替ネットワークスは、人的資本を増やし、ローカライズされたコンテンツやサービスの創出を促進することにより、デジタルデバイドを埋めるために貢献できます。"
    },
    {
      "indent": 0,
      "text": "3.1. Urban vs. Rural Areas",
      "section_title": true,
      "ja": "3.1. 都市対農村"
    },
    {
      "indent": 3,
      "text": "The differences presented in the previous section are not only present between countries, but within them too. This is especially the case for rural inhabitants, who represent approximately 55% of the world's population [IFAD2011], with 78% of them in \"global south\" countries [ITU2011]. According to the World Bank, adoption gaps \"between rural and urban populations are falling for mobile phones but increasing for the internet\" [WorldBank2016].",
      "ja": "前節で提示違いはなく、その中の、あまりにも、国間の唯一の存在ではありません。これは特に、「グローバル南」の国々[ITU2011]でそれらの78％で、[IFAD2011]世界の人口の約55％を占め、農村住民のためのケースです。世界銀行によると、養子縁組ギャップ「農村部と都市部の住民の間では、携帯電話のために下落しているが、インターネットの増加」[WorldBank2016]。"
    },
    {
      "indent": 3,
      "text": "Although it is impossible to generalize among them, there exist some common features in rural areas that have prevented incumbent operators from providing access and that, at the same time, challenge the deployment of alternative infrastructures [Brewer] [Nungu] [Simo_c]. For example, a high network latency was reported in [Johnson_b], which could be in the order of seconds during some hours.",
      "ja": "それが彼らの間で一般化することは不可能ですが、アクセスして、それを提供するから現職演算子を妨げてきた農村部ではいくつかの共通の特徴が存在し、同時に、代替インフラの展開に挑戦[ビール] [Nungu] [Simo_c]。例えば、高ネットワーク待ち時間は数時間の間秒のオーダーであり得る[Johnson_b]で報告されました。"
    },
    {
      "indent": 3,
      "text": "These challenges include:",
      "ja": "これらの課題は、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Low per capita income, as the local economy is mainly based on subsistence agriculture, farming, and fishing.",
      "ja": "O低一人当たりの所得、地域経済は主に自給自足農業、農業、漁業とに基づいています。"
    },
    {
      "indent": 3,
      "text": "o Scarcity or absence of basic infrastructures, such as electricity, water, and access roads.",
      "ja": "O不足または、電気、水、およびアクセス道路などの基本的なインフラが存在しません。"
    },
    {
      "indent": 3,
      "text": "o Low population density and distance (spatial or effective) between population clusters.",
      "ja": "O低人口密度と人口クラスタ間の距離（空間的または有効）。"
    },
    {
      "indent": 3,
      "text": "o Underdeveloped social services, such as healthcare and education.",
      "ja": "そのような医療や教育などのO後進社会サービス、。"
    },
    {
      "indent": 3,
      "text": "o Lack of adequately educated and trained technicians, and high potential for those (few) trained to leave the community incentivized by better opportunities, higher salaries, or the possibility of starting their own companies [McMahon].",
      "ja": "O十分な教育を受け、訓練を受けた技術者の不足、およびそれらの可能性が高い（数）は、より良い機会でインセンティブコミュニティ、高い給料、または自分の会社を開始する可能性[マクマホン]を残すために訓練を受けました。"
    },
    {
      "indent": 3,
      "text": "o High cost of Internet access [Mathee].",
      "ja": "Oインターネットアクセスの高コスト[Mathee]。"
    },
    {
      "indent": 3,
      "text": "o Harsh environments leading to failure in electronic communication devices [Johnson_a], which reduces the reliability of the network.",
      "ja": "ネットワークの信頼性を低下させる電子通信機器の故障につながるO過酷な環境[Johnson_a]。"
    },
    {
      "indent": 3,
      "text": "Some of these factors challenge the stability of Alternative Networks and the services they provide: scarcity of spectrum, scale, and heterogeneity of devices. However, the proliferation of Alternative Networks [Baig] together with the raising of low-cost, low-consumption, low-complexity off-the-shelf wireless devices have allowed and simplified the deployment and maintenance of alternative infrastructures in rural areas.",
      "ja": "スペクトルの希少性、規模、およびデバイスの異質性：これらの要因のいくつかは、代替ネットワークとそれらが提供するサービスの安定性に挑戦します。しかし、代替ネットワークスの増殖は[Baig]一緒に低コストの上昇で、低消費電力、低複雑既製の無線デバイスが許可され、農村部での代替インフラの導入と保守を簡素化しています。"
    },
    {
      "indent": 0,
      "text": "3.2. Topology Patterns Followed by Alternative Networks",
      "section_title": true,
      "ja": "3.2. 代替ネットワークトポロジが続くパターン"
    },
    {
      "indent": 3,
      "text": "Alternative Networks, considered self-managed and self-sustained, follow different topology patterns [Vega_a]. Generally, these networks grow spontaneously and organically, that is, the network grows without specific planning and deployment strategy and the routing core of the network tends to fit a power law distribution. Moreover, these networks are composed of a high number of heterogeneous devices with the common objective of freely connecting and increasing the network coverage and the reliability. Although these characteristics increase the entropy (e.g., by increasing the number of routing protocols), they have resulted in an inexpensive solution to effectively increase the network size. One such example is Guifi.net [Vega_a], which has had an exponential growth rate in the number of operating nodes during the last decade.",
      "ja": "自己管理と自己持続みなさ代替ネットワークスは、[Vega_a]異なるトポロジーパターンに従ってください。一般的に、これらのネットワークはつまり、ネットワークは、べき乗分布をフィットする傾向があり、特定の計画と展開戦略とネットワークのルーティングコアなしで成長し、自発的かつ有機的に成長します。また、これらのネットワークを自由に接続し、ネットワークカバレッジ及び信頼性を向上させる一般的な目的を有する異種デバイスの多数で構成されています。これらの特性は、エントロピーを増大させるが（例えば、ルーティングプロトコルの数を増加させることによって）、それらは効果的にネットワークのサイズを増加させるために、安価な溶液をもたらしました。その一例は、過去10年間動作ノードの数が指数関数的に成長率があったGuifi.net [Vega_a]、です。"
    },
    {
      "indent": 3,
      "text": "Regularly, rural areas in these networks are connected through long-distance links and/or wireless mesh networks, which in turn convey the Internet connection to relevant organizations or institutions. In contrast, in urban areas, users tend to share and require mobile access. Since these areas are also likely to be covered by commercial ISPs, the provision of wireless access by virtual operators like [Fon] may constitute a way to extend the user capacity to the network. Other proposals like \"Virtual Public Networks\" [Sathiaseelan_a] can also extend the service.",
      "ja": "定期的に、これらのネットワークでは、農村部は順番に関係機関や団体へのインターネット接続を伝える長距離リンクおよび/または無線メッシュネットワークを介して接続されています。これとは対照的に、都市部では、ユーザーがモバイルアクセスを共有し、必要とする傾向があります。これらの領域はまた、コマーシャルのISPによって覆われる可能性があるので、[フォン]のような仮想オペレータによる無線アクセスの提供は、ネットワークへのユーザの能力を拡張する方法を構成することができます。 「仮想パブリックネットワーク」[Sathiaseelan_a]のような他の提案もサービスを拡張することができます。"
    },
    {
      "indent": 0,
      "text": "4. Classification Criteria",
      "section_title": true,
      "ja": "4.分類基準"
    },
    {
      "indent": 3,
      "text": "The classification of Alternative Network Deployments, presented in this document, is based on the following criteria:",
      "ja": "この文書の代替ネットワーク展開の分類は、以下の基準に基づいています。"
    },
    {
      "indent": 0,
      "text": "4.1. Entity behind the Network",
      "section_title": true,
      "ja": "4.1. ネットワークの背後にあるエンティティ"
    },
    {
      "indent": 3,
      "text": "The entity (or entities) or individuals behind an Alternative Network can be:",
      "ja": "代替ネットワークの背後にあるエンティティ（またはエンティティ）または個人がすることができます："
    },
    {
      "indent": 3,
      "text": "o A community of users.",
      "ja": "ユーザのコミュニティO。"
    },
    {
      "indent": 3,
      "text": "o A public stakeholder.",
      "ja": "公共の利害関係者O。"
    },
    {
      "indent": 3,
      "text": "o A private company.",
      "ja": "民間企業O。"
    },
    {
      "indent": 3,
      "text": "o Supporters of a crowdshared approach.",
      "ja": "crowdsharedアプローチのサポーターO。"
    },
    {
      "indent": 3,
      "text": "o A community that already owns the infrastructure and shares it with an operator, who, in turn, may also use it for backhauling purposes.",
      "ja": "すでにインフラと、今度は、また、バックホールの目的のためにそれを使用することができ、オペレータ、との株式を所有しているコミュニティO。"
    },
    {
      "indent": 3,
      "text": "o A research or academic entity.",
      "ja": "研究や学術の実体O。"
    },
    {
      "indent": 3,
      "text": "The above actors may play different roles in the design, financing, deployment, governance, and promotion of an Alternative Network. For example, each of the members of a Community Network maintains the ownership over the equipment they have contributed, whereas in others there is a single entity, e.g., a private company who owns the equipment, or at least a part of it.",
      "ja": "上記の俳優は代替ネットワークの設計、資金調達、導入、ガバナンス、およびプロモーションに異なる役割を果たしている可能性があります。他では単一のエンティティ、例えば、機器、またはそれの少なくとも一部を所有している民間企業があるのに対し、例えば、コミュニティネットワークの各メンバーは、彼らが貢献している機器の上に所有権を維持します。"
    },
    {
      "indent": 0,
      "text": "4.2. Purpose",
      "section_title": true,
      "ja": "4.2. 目的"
    },
    {
      "indent": 3,
      "text": "Alternative Networks can be classified according to their purpose and the benefits they bring compared to mainstream solutions, regarding economic, technological, social, or political objectives. These benefits could be enjoyed mostly by the actors involved (e.g., lowering costs or gaining technical expertise) or by the local community (e.g., Internet access in underserved areas) or by the society as a whole (e.g., network neutrality).",
      "ja": "代替ネットワークスは、その目的に応じて分類することができ、それらがもたらすメリットは、経済的、技術的、社会的、または政治的な目的に関して主流のソリューションに比べて。これらの利点はほとんど関与行為者（例えば、コストを下げるか、技術的な専門知識を得る）によって、または地域社会（例えば、インターネットのない地域でのアクセス）は、全体として、あるいは社会によって（例えば、ネットワークの中立性）で楽しむことができます。"
    },
    {
      "indent": 3,
      "text": "The benefits provided by Alternative Networks include, but are not limited to:",
      "ja": "オルタナティブ・ネットワークにより提供される利点があり、これらに限定されません："
    },
    {
      "indent": 3,
      "text": "o Extending coverage to underserved areas (users and communities).",
      "ja": "ない地域（ユーザーやコミュニティ）への適用範囲を拡張するO。"
    },
    {
      "indent": 3,
      "text": "o Providing affordable Internet access for all.",
      "ja": "すべてのための手頃な価格のインターネットアクセスを提供し、O。"
    },
    {
      "indent": 3,
      "text": "o Reducing initial capital expenditures (for the network and the end user, or both).",
      "ja": "（ネットワーク及びエンドユーザ、またはその両方のための）初期資本支出を削減O。"
    },
    {
      "indent": 3,
      "text": "o Providing additional sources of capital (beyond the traditional carrier-based financing).",
      "ja": "（伝統的なキャリア・ベース・ファイナンスを超えて）資本の追加ソースを提供し、O。"
    },
    {
      "indent": 3,
      "text": "o Reducing ongoing operational costs (such as backhaul or network administration).",
      "ja": "O（例えばバックホールやネットワーク管理など）の継続的な運用コストを削減します。"
    },
    {
      "indent": 3,
      "text": "o Leveraging expertise and having a place for experimentation and teaching.",
      "ja": "専門知識を活用し、実験や教育の場を持つO。"
    },
    {
      "indent": 3,
      "text": "o Reducing hurdles to adoption (e.g., digital literacy, literacy in general, and relevance).",
      "ja": "採用へのハードルを低減O（例えば、デジタルリテラシー、一般に識字、および関連性）。"
    },
    {
      "indent": 3,
      "text": "o Providing an alternative service in case of natural disasters and other extreme situations.",
      "ja": "自然災害やその他の極端な状況の場合の代替サービスを提供し、O。"
    },
    {
      "indent": 3,
      "text": "o Community building, social cohesion, and quality of life improvement.",
      "ja": "Oコミュニティの構築、社会的一体性、および生活の改善の質。"
    },
    {
      "indent": 3,
      "text": "o Experimentation with alternative governance and ownership models for treating network infrastructures as a commons.",
      "ja": "コモンズなどのネットワークインフラストラクチャを治療するための代替ガバナンスと所有権のモデルとOの実験。"
    },
    {
      "indent": 3,
      "text": "o Raising awareness of political debates around issues like network neutrality, knowledge sharing, access to resources, and more.",
      "ja": "ネットワークの中立性、知識の共有、リソースへのアクセス、などのような問題点の周りの政治的な議論の意識を高めるO。"
    },
    {
      "indent": 3,
      "text": "Note that the different purposes of Alternative Networks can be more or less explicitly stated and they could also evolve over time based on the internal dynamics and external events. For example, the Red Hook WIFI network in Brooklyn [Redhook] started as a Community Network focusing more on local applications and community building [TidePools], but it became widely known when it played a key role as an alternative service available during the Sandy storm [Tech] [NYTimes].",
      "ja": "オルタナティブ・ネットワークの異なる目的が多かれ少なかれ明示的に記述できることに注意してください、彼らはまた、内部ダイナミクスと外部イベントに基づいて、時間をかけて進化することができます。例えば、ブルックリンのレッドフックのWIFIネットワーク[レッドフック]はコミュニティネットワークは、ローカルアプリケーションとコミュニティの構築[TidePools]にもっと焦点を当てとして始まりましたが、それはサンディ嵐の中の代替サービスとして利用できる重要な役割を果たしたとき、それは広く知られるようになりました[技術] [NYTimesの]。"
    },
    {
      "indent": 3,
      "text": "Moreover, especially for those networks with more open and horizontal governance models, the underlying motivations of those involved may be very diverse, ranging from altruistic ones related to the desire of free sharing of Internet connectivity and various forms of activism to personal benefits from the experience and expertise through the active participation in the deployment and management of a real and operational network.",
      "ja": "また、特によりオープンで水平ガバナンスモデルとこれらのネットワークのために、関係者の根本的な動機は、インターネット接続の自由な共有と経験から個人的な利益の行動の様々な形の願望に関連する利他的なものに至るまで、非常に多様でありそして、実際の運用ネットワークの展開と管理に積極的に参加を通じて専門知識。"
    },
    {
      "indent": 0,
      "text": "4.3. Governance and Sustainability Model",
      "section_title": true,
      "ja": "4.3. ガバナンスと持続可能性モデル"
    },
    {
      "indent": 3,
      "text": "Different governance models are present in Alternative Networks. They may range from some open and horizontal models, with an active participation of the users (e.g., Community Networks) to a more centralized model, where a single authority (e.g., a company or a public stakeholder) plans and manages the network, even if it is (total or partially) owned by a community.",
      "ja": "異なるガバナンスモデルが代替ネットワーク内に存在しています。彼らは、単一の機関（例えば、企業や公共の利害関係者が）でも、ネットワークを計画し、管理し、より集中型モデルへのユーザ（例えば、コミュニティ・ネットワーク）の積極的な参加と、いくつかのオープンおよび水平モデルの範囲とすることができますそれがある場合（合計または部分的に）コミュニティによって所有していました。"
    },
    {
      "indent": 3,
      "text": "Regarding sustainability, some networks grow \"organically\" as a result of the new users who join and extend the network, contributing their own hardware. In some other cases, the existence of previous infrastructure (owned by the community or the users) may lower the capital expenditures of an operator, who can therefore provide the service with better economic conditions.",
      "ja": "持続可能性に関しては、いくつかのネットワークが参加し、自分のハードウェアに貢献、ネットワークを拡張する新しいユーザーの結果として、「有機的」に成長します。他のいくつかの例では、（コミュニティやユーザーが所有している）前のインフラの存在は、それゆえ、より良い経済状況でサービスを提供できる事業者の設備投資を低下させることができます。"
    },
    {
      "indent": 0,
      "text": "4.4. Technologies Employed",
      "section_title": true,
      "ja": "4.4. テクノロジーを採用します"
    },
    {
      "indent": 3,
      "text": "o Standard Wi-Fi. Many Alternative Networks are based on the standard IEEE 802.11 [IEEE.802.11] using the Distributed Coordination Function.",
      "ja": "O規格のWi-Fiを提供しています。多くの代替ネットワークは、分散コーディネーション機能を使用して、標準のIEEE 802.11 [IEEE.802.11]に基づいています。"
    },
    {
      "indent": 3,
      "text": "o Wi-Fi-based Long Distance (WiLD) networks. These can work with either Carrier Sense Multiple Access with Collision Avoidance (CSMA/CA) or an alternative Time Division Multiple Access (TDMA) Media Access Control (MAC) [Simo_b].",
      "ja": "OのWi-Fiベースの長距離（野生）ネットワーク。これらは、衝突回避（CSMA / CA）、または代替の時分割多元接続（TDMA）メディアアクセス制御（MAC）[Simo_b]搬送波感知多重アクセスのいずれかで動作することができます。"
    },
    {
      "indent": 3,
      "text": "o TDMA. It can be combined with a Wi-Fi protocol, in a non-standard way [airMAX]. This configuration allows each client to send and receive data using pre-designated timeslots.",
      "ja": "OのTDMA。これは、非標準的な方法[エアマックス]でのWi-Fiプロトコルと組み合わせることができます。この構成では、各クライアントが事前に指定されたタイムスロットを使用してデータを送受信することができます。"
    },
    {
      "indent": 3,
      "text": "o 802.16-compliant (Worldwide Interoperability for Microwave Access (WiMax)) [IEEE.802.16] systems over non-licensed bands.",
      "ja": "O（ワイマックス（WiMAX））、非ライセンスバンド上【IEEE.802.16]システム802.16準拠。"
    },
    {
      "indent": 3,
      "text": "o Dynamic Spectrum Solutions (e.g., based on the use of TV White Spaces). A set of television frequencies that can be utilized by secondary users in locations where they are unused, e.g., IEEE 802.11af [IEEE.802.11AF] or 802.22 [IEEE.802.22].",
      "ja": "Oダイナミックスペクトル・ソリューションズ（例えば、TVホワイトスペースの使用に基づいて）。例えば、IEEE 802.11af [IEEE.802.11AF]または802.22 [IEEE.802.22]、それらが使用されていない場所で二次ユーザが利用することができるテレビジョン周波数のセット。"
    },
    {
      "indent": 3,
      "text": "o Satellite solutions can also be employed to give coverage to wide areas, as proposed in the RIFE project (https://rife-project.eu/).",
      "ja": "RIFEプロジェクト（https://rife-project.eu/）に提案されているようにO衛星溶液はまた、広いエリアにカバレッジを与えるために使用することができます。"
    },
    {
      "indent": 3,
      "text": "o Low-cost optical fiber systems are also used to connect households in different places.",
      "ja": "O低コストの光ファイバシステムは、異なる場所で家庭を接続するために使用されます。"
    },
    {
      "indent": 0,
      "text": "4.5. Typical Scenarios",
      "section_title": true,
      "ja": "4.5. 典型的なシナリオ"
    },
    {
      "indent": 3,
      "text": "The scenarios where Alternative Networks are usually deployed can be classified as:",
      "ja": "オルタナティブ・ネットワークは、通常は配備されているシナリオは、以下のように分類できます。"
    },
    {
      "indent": 3,
      "text": "o Urban/rural areas.",
      "ja": "都市部/農村部O。"
    },
    {
      "indent": 3,
      "text": "o \"Global north\" / \"global south\" countries.",
      "ja": "O「グローバル北」/「グローバル南」の国。"
    },
    {
      "indent": 0,
      "text": "5. Classification of Alternative Networks",
      "section_title": true,
      "ja": "オルタナティブ・ネットワークの5分類"
    },
    {
      "indent": 3,
      "text": "This section classifies Alternative Networks according to the criteria explained previously. Each of them has different incentive structures, maybe common technological challenges, but most importantly interesting usage challenges that feed into the incentives as well as the technological challenges.",
      "ja": "このセクションでは、先に説明した基準に従って代替ネットワークを分類します。それらのそれぞれは、異なるインセンティブ構造、多分共通の技術的な課題が、インセンティブだけでなく、技術的な課題に供給最も重要なのは面白い使い方の課題があります。"
    },
    {
      "indent": 3,
      "text": "At the beginning of each subsection, a table is presented including a classification of each network according to the criteria listed in the \"Classification Criteria\" subsection. Real examples of each kind of Alternative Network are cited.",
      "ja": "各サブセクションの初めに、テーブルは「分類基準」の項に記載されている基準に従って、各ネットワークの分類など、提示されています。代替ネットワークの各種類の本当の例が挙げられます。"
    },
    {
      "indent": 0,
      "text": "5.1. Community Networks",
      "section_title": true,
      "ja": "5.1. コミュニティネットワーク"
    },
    {
      "indent": 3,
      "text": "+----------------+--------------------------------------------------+\n| Entity behind  | community                                        |\n| the network    |                                                  |\n+----------------+--------------------------------------------------+\n| Purpose        | all the goals listed in Section 4.2 may be       |\n|                | present                                          |\n+----------------+--------------------------------------------------+\n| Governance and | participatory administration model: non-         |\n| sustainability | centralized and open building and maintenance;   |\n| model          | users may contribute their own hardware          |\n+----------------+--------------------------------------------------+\n| Technologies   | Wi-Fi [IEEE.802.11] (standard and non-standard   |\n| employed       | versions) and optical fiber                      |\n+----------------+--------------------------------------------------+\n| Typical        | urban and rural                                  |\n| scenarios      |                                                  |\n+----------------+--------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 10,
      "text": "Table 1: Characteristics Summary for Community Networks",
      "ja": "表1：コミュニティネットワークの特性の概要"
    },
    {
      "indent": 3,
      "text": "Community Networks are non-centralized, self-managed networks sharing these characteristics:",
      "ja": "コミュニティネットワークは、これらの特性を共有する非集中型の、自己管理ネットワークです。"
    },
    {
      "indent": 3,
      "text": "o They start and grow organically, and they are open to participation from everyone, sharing an open participation agreement. Community members directly contribute active (not just passive) network infrastructure. The network grows as new hosts and links are added.",
      "ja": "O彼らはオープン参加契約を共有し、起動して、有機的に成長し、彼らは皆からの参加に開放されています。コミュニティメンバーは、直接、アクティブ（だけでなく、受動的）ネットワークインフラストラクチャに貢献します。新しいホストとのリンクが追加されるネットワークが成長します。"
    },
    {
      "indent": 3,
      "text": "o Knowledge about building and maintaining the network and ownership of the network itself is non-centralized and open. Different degrees of centralization can be found in Community Networks. In some of them, a shared platform (e.g., a website) may exist where minimum coordination is performed. Community members with the right permissions have an obvious and direct form of organizational control over the overall organization of the network (e.g., IP addresses, routing, etc.) in their community (not just their own participation in the network).",
      "ja": "Oネットワーク自体のネットワークと所有権を構築し、維持することについての知識は非中央集権とオープンしています。集中度の違いは、コミュニティネットワークで見つけることができます。最小の調整が行われる場合、それらのいくつかは、共有プラットフォームでは（例えば、ウェブサイト）が存在してもよいです。右の権限を持つコミュニティメンバーは、彼らのコミュニティ（ネットワーク内だけでなく、自分の参加）におけるネットワークの全体的な組織（例えば、IPアドレス、ルーティングなど）を超える組織制御の明白かつ直接的な形を持っています。"
    },
    {
      "indent": 3,
      "text": "o The network can serve as a backhaul for providing a whole range of services and applications, from completely free to even commercial services.",
      "ja": "Oネットワークは完全に無料にしても商用サービスから、サービスやアプリケーションの全範囲を提供するためのバックホールとしての役割を果たすことができます。"
    },
    {
      "indent": 3,
      "text": "Hardware and software used in Community Networks can be very diverse and customized, even inside one network. A Community Network can have both wired and wireless links. Multiple routing protocols or network topology management systems may coexist in the network.",
      "ja": "コミュニティ・ネットワークで使用されるハードウェアとソフトウェアが一つでもネットワーク内で、非常に多様でカスタマイズすることができます。コミュニティネットワークは、有線と無線の両方のリンクを持つことができます。複数のルーティングプロトコルやネットワークトポロジ管理システムは、ネットワーク内で共存することができます。"
    },
    {
      "indent": 3,
      "text": "These networks grow organically, since they are formed by the aggregation of nodes belonging to different users. A minimal governance infrastructure is required in order to coordinate IP addressing, routing, etc. Several examples of Community Networks are described in [Braem]. A technological analysis of a Community Network is presented in [Vega_b], which focuses on technological network diversity, topology characteristics, the evolution of the network over time, robustness and reliability, and networking service availability.",
      "ja": "それらは異なるユーザに属するノードの集合によって形成されているので、これらのネットワークは、有機的に成長します。最小のガバナンス・インフラストラクチャは、等、IPアドレッシング、ルーティングを調整するために必要とされるコミュニティネットワークのいくつかの例は、[Braem]に記載されています。コミュニティネットワークの技術的な分析は、技術的ネットワークの多様性、トポロジー特性、時間、堅牢性と信頼性、およびネットワーキング・サービスの可用性を超えるネットワークの進化に焦点を当てて[Vega_b]、に提示されています。"
    },
    {
      "indent": 3,
      "text": "These networks follow a participatory administration model, which has been shown to be effective in connecting geographically dispersed people, thus enhancing and extending digital Internet rights.",
      "ja": "これらのネットワークは、このように、地理的に分散した人々をつなぐ高め、デジタルインターネット権の延長に有効であることが示された参加型管理モデルを、従ってください。"
    },
    {
      "indent": 3,
      "text": "Users adding new infrastructure (i.e., extensibility) can be used to formulate another definition: A Community Network is a network in which any participant in the system may add link segments to the network in such a way that the new segments can support multiple nodes and adopt the same overall characteristics as those of the joined network, including the capacity to further extend the network. Once these link segments are joined to the network, there is no longer a meaningful distinction between the previous and the new extent of the network. The term \"participant\" refers to an individual, who may become the user, provider, and manager of the network at the same time.",
      "ja": "新しいインフラストラクチャ（すなわち、拡張）を添加ユーザが別の定義を策定するために使用することができる：コミュニティネットワークは、システム内の任意の参加者が新しいセグメントが複数のノードをサポートすることができるように、ネットワークにリンクセグメントを追加してもよいしたネットワークであり、さらに、ネットワークを拡張する能力を含む接合ネットワークのものと同じ全体的な特徴を採用します。これらリンクセグメントがネットワークに参加していると、以前とネットワークの新しいエクステントの間の意味のある区別がなくなります。用語「参加者」は、ユーザ、プロバイダと同時に、ネットワークの管理者になることが個々に指します。"
    },
    {
      "indent": 3,
      "text": "In Community Networks, profit can only be made by offering services and not simply by supplying the infrastructure, because the infrastructure is neutral, free, and open (mainstream Internet Service Providers base their business on the control of the infrastructure). In Community Networks, everybody usually keeps the ownership of what he/she has contributed or leaves the stewardship of the equipment to the network as a whole (the commons), even loosing track of the ownership of a particular equipment itself, in favor of the community.",
      "ja": "インフラは（主流のインターネット・サービス・プロバイダは、インフラの制御に彼らのビジネスの基礎）、ニュートラル自由、および開いているため、コミュニティ・ネットワークスでは、利益は、インフラストラクチャを供給するだけでサービスを提供していないことによって作製することができます。の賛成で、コミュニティ・ネットワークスでは、誰もが通常彼/彼女が貢献したものの所有権を保持したり、特定の機器自体の所有権のトラックを失う、全体（コモンズ）などのネットワークへの機器の責務を残しコミュニティ。"
    },
    {
      "indent": 3,
      "text": "The majority of Community Networks comply with the definition of Free Network, included in Section 2.",
      "ja": "コミュニティネットワークの大半は、第2節に含まフリーネットワークの定義に準拠しています。"
    },
    {
      "indent": 0,
      "text": "5.2. Wireless Internet Service Providers (WISPs)",
      "section_title": true,
      "ja": "5.2. ワイヤレスインターネットサービスプロバイダ（WISP）"
    },
    {
      "indent": 3,
      "text": "+----------------+--------------------------------------------------+\n| Entity behind  | company                                          |\n| the network    |                                                  |\n+----------------+--------------------------------------------------+\n| Purpose        | to serve underserved areas; to reduce capital    |\n|                | expenditures in Internet access; and to provide  |\n|                | additional sources of capital                    |\n+----------------+--------------------------------------------------+\n| Governance and | operated by a company that provides the          |\n| sustainability | equipment; centralized administration            |\n| model          |                                                  |\n+----------------+--------------------------------------------------+\n| Technologies   | wireless, e.g., [IEEE.802.11] and [IEEE.802.16]  |\n| employed       | and unlicensed frequencies                       |\n+----------------+--------------------------------------------------+\n| Typical        | rural (urban deployments also exist)             |\n| scenarios      |                                                  |\n+----------------+--------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Table 2: Characteristics Summary for WISPs",
      "ja": "表2：切れ間のための特性の概要"
    },
    {
      "indent": 3,
      "text": "WISPs are commercially operated wireless Internet networks that provide Internet and/or Voice over Internet (VoIP) services. They are most common in areas not covered by mainstream telecommunications companies or ISPs. WISPs mostly use wireless point-to-multipoint links using unlicensed spectrum but often must resort to licensed frequencies. Use of licensed frequencies is common in regions where unlicensed spectrum is either perceived to be crowded or too unreliable to offer commercial services, or where unlicensed spectrum faces regulatory barriers impeding its use.",
      "ja": "切れ間は、商業的にインターネット上でインターネットおよび/または音声を提供し、無線インターネット網（VoIP）のサービスを運営しています。彼らは、主流の通信会社やISPが覆われていない領域で最も一般的です。切れ間は、主に無免許のスペクトルを用いて無線ポイント・ツー・マルチポイントリンクを使用しますが、多くの場合、ライセンスの周波数に頼らなければなりません。ライセンスされた周波数の使用は、無免許のスペクトルが混雑したり、商業サービスを提供するにはあまりにも信頼できない、またはどこ無免許のスペクトルは、その使用を妨げる規制の障壁に直面していることを認識されているいずれかの地域では一般的です。"
    },
    {
      "indent": 3,
      "text": "Most WISPs are operated by local companies responding to a perceived market gap. There is a small but growing number of WISPs, such as [Airjaldi] in India, that have expanded from local service into multiple locations.",
      "ja": "ほとんどの切れ間が知覚市場のギャップへの対応地元企業によって運営されています。複数の場所にローカルサービスから拡大しているインドでは、このような[Airjaldi]として切れ間、の小さいながらも成長している番号があります。"
    },
    {
      "indent": 3,
      "text": "Since 2006, the deployment of cloud-managed WISPs has been possible with hardware from companies such as [Meraki] and later [OpenMesh] and others. Until recently, however, most of these services have been aimed at \"global north\" markets. In 2014, a cloud-managed WISP service aimed at \"global south\" markets was launched [Everylayer].",
      "ja": "2006年以来、クラウド管理の切れ間の展開は、[メラキ・ネットワークス]などの企業からのハードウェアと、後で[OpenMesh]などで可能となっています。最近まで、しかし、これらのサービスのほとんどは、「グローバル北」の市場を狙ってきました。 2014年に、「グローバル南」の市場に向けたクラウド管理WISPサービスは、[Everylayer]発売されました。"
    },
    {
      "indent": 0,
      "text": "5.3. Shared Infrastructure Model",
      "section_title": true,
      "ja": "5.3. 共有インフラストラクチャモデル"
    },
    {
      "indent": 3,
      "text": "+----------------+--------------------------------------------------+\n| Entity behind  | shared: companies and users                      |\n| the network    |                                                  |\n+----------------+--------------------------------------------------+\n| Purpose        | to eliminate a capital expenditures barrier (to  |\n|                | operators); lower the operating expenses         |\n|                | (supported by the community); and extend         |\n|                | coverage to underserved areas                    |\n+----------------+--------------------------------------------------+\n| Governance and | the community rents the existing infrastructure  |\n| sustainability | to an operator                                   |\n| model          |                                                  |\n+----------------+--------------------------------------------------+\n| Technologies   | wireless in non-licensed bands, mobile           |\n| employed       | femtocells, WiLD networks [WiLD], and/or low-    |\n|                | cost fiber                                       |\n+----------------+--------------------------------------------------+\n| Typical        | rural areas, and more particularly rural areas   |\n| scenarios      | in \"global south\" regions                        |\n+----------------+--------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Table 3: Characteristics Summary for Shared Infrastructure",
      "ja": "表3：共有インフラストラクチャのための特性の概要"
    },
    {
      "indent": 3,
      "text": "In mainstream networks, the operator usually owns the telecommunications infrastructure required for the service or sometimes rents infrastructure to/from other companies. The problem arises in large areas with low population density, in which neither the operator nor the other companies have deployed infrastructure and such deployments are not likely to happen due to the low potential return on investment.",
      "ja": "主流のネットワークでは、オペレータは、通常、サービスに必要な通信インフラを所有しているか、時には他の企業との間で/インフラをレンタル。問題は、オペレータや他の企業でもないが、インフラストラクチャを展開していると、このような展開は投資の低電位のリターンのために発生する可能性がされていない低人口密度、との大きな領域に発生します。"
    },
    {
      "indent": 3,
      "text": "When users already own deployed infrastructure, either individually or as a community, sharing that infrastructure with an operator can benefit both parties and is a solution that has been deployed in some areas. For the operator, this provides a significant reduction in the initial investment needed to provide services in small rural localities because capital expenditure is only associated with the access network. Renting capacity in the users' network for backhauling only requires an increment in the operating expenditure. This approach also benefits the users in two ways: they obtain improved access to telecommunications services that would not be accessible otherwise, and they can derive some income from the operator that helps to offset the network's operating costs, particularly for network maintenance.",
      "ja": "ユーザーは、すでに個別にまたはコミュニティとして、展開のインフラを所有する場合、オペレータとそのインフラストラクチャを共有することは、双方に利益をもたらすと一部の地域で展開されたソリューションであることができます。オペレータにとって、これは資本支出のみのアクセスネットワークに関連付けられているため、小さな農村地域でサービスを提供するために必要な初期投資の大幅な削減を提供します。迂回中継のため、ユーザーのネットワークのキャパシティを借りることは唯一のオペレーティング支出の増加が必要です。彼らがそうでなければアクセスできないでしょう電気通信サービスへのアクセス改善を取得し、彼らは特にネットワークメンテナンスのために、ネットワークの運用コストを相殺するのに役立ちますオペレータからいくつかの収入を得ることができます。また、この手法は、二つの方法でユーザーに利益をもたらします。"
    },
    {
      "indent": 3,
      "text": "One clear example of the potential of the \"shared infrastructure model\" nowadays is the deployment of 3G services in rural areas in which there is a broadband rural Community Network. Since the inception of femtocells (small, low-power cellular base stations), there are complete technical solutions for low-cost 3G coverage using the Internet as a backhaul. If a user or community of users has an IP network connected to the Internet with some excess capacity, placing a femtocell in the user premises benefits both the user and the operator, as the user obtains better coverage and the operator does not have to support the cost of the backhaul infrastructure. Although this paradigm was conceived for improved indoor coverage, the solution is feasible for 3G coverage in underserved rural areas with low population density (i.e., villages), where the number of simultaneous users and the servicing area are small enough to use low-cost femtocells. Also, the amount of traffic produced by these cells can be easily transported by most community broadband rural networks.",
      "ja": "「共有インフラストラクチャモデル」の可能性の一つの明確な例は、今日のブロードバンド農村コミュニティネットワークが存在する農村部での3Gサービスの展開です。フェムトセル（小型、低電力セルラ基地局）の開始以来、バックホールとしてインターネットを使用して、低コストの3Gカバレッジのための完全な技術的な解決策があります。ユーザまたはユーザのコミュニティは、いくつかの過剰生産能力と、インターネットに接続されたIPネットワーク、ユーザーはより良いカバレッジを取得し、オペレーターがサポートする必要はありませんので、ユーザー宅内メリットユーザとオペレータの両方でフェムトセルを設置している場合バックホール・インフラストラクチャのコスト。このパラダイムは、改善された屋内カバレッジのために考案されましたが、解決策は、同時ユーザー数やサービス領域は、低コストのフェムトセルを使用するのに十分小さく、低人口密度（すなわち、村）との行き届いていない農村部での3Gカバレッジのために実現可能です。また、これらの細胞によって産生されたトラフィックの量は、簡単にほとんどのコミュニティブロードバンド農村ネットワークによって輸送することができます。"
    },
    {
      "indent": 3,
      "text": "Some real examples can be referenced in the TUCAN3G project, which deployed demonstrator networks in two regions in the Amazon forest in Peru [Simo_d]. In these networks [Simo_a], the operator and several rural communities cooperated to provide services through rural networks built up with WiLD links [WiLD]. In these cases, the networks belonged to the public health authorities and were deployed with funds that came from international cooperation for telemedicine purposes. Publications that justify the feasibility of this approach can also be found on that website.",
      "ja": "いくつかの実際の例は、[Simo_d]ペルーのアマゾンの森の中に二つの領域にデモンストレータネットワークを展開しTUCAN3Gプロジェクトで参照することができます。これらのネットワーク[Simo_a]では、オペレータといくつかの農村地域では野生のリンク[WILD]で構築農村のネットワークを通じてサービスを提供するために協力しました。これらのケースでは、ネットワークは、公衆衛生当局に所属し、遠隔医療目的のための国際協力から来た資金で配備されました。このアプローチの実現可能性を正当化する出版物は、そのウェブサイト上で見つけることができます。"
    },
    {
      "indent": 0,
      "text": "5.4. Crowdshared Approaches Led by the Users and Third-Party Stakeholders",
      "ja": "5.4. ユーザーとサードパーティーのステークホルダーが率いるCrowdsharedアプローチ"
    },
    {
      "indent": 3,
      "text": "+----------------+--------------------------------------------------+\n| Entity behind  | community, public stakeholders, private          |\n| the network    | companies, and supporters of a crowdshared       |\n|                | approach                                         |\n+----------------+--------------------------------------------------+\n| Purpose        | sharing connectivity and resources               |\n+----------------+--------------------------------------------------+\n| Governance and | users share their capacity, coordinated by a     |\n| sustainability | Virtual Network Operator (VNO); different models |\n| model          | may exist, depending on the nature of the VNO    |\n+----------------+--------------------------------------------------+\n| Technologies   | Wi-Fi [IEEE.802.11]                              |\n| employed       |                                                  |\n+----------------+--------------------------------------------------+\n| Typical        | urban and rural                                  |\n| scenarios      |                                                  |\n+----------------+--------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Table 4: Characteristics Summary for Crowdshared Approaches",
      "ja": "表4：Crowdsharedアプローチのための特性の概要"
    },
    {
      "indent": 3,
      "text": "These networks can be defined as a set of nodes whose owners share common interests (e.g., sharing connectivity; resources; and peripherals) regardless of their physical location. They conform to the following approach: the home router creates two wireless networks -- one of them is normally used by the owner, and the other one is public. A small fraction of the bandwidth is allocated to the public network to be employed by any user of the service in the immediate area. Some examples are described in [PAWS] and [Sathiaseelan_c]. Other examples are found in the networks created and managed by city councils (e.g., [Heer]). The \"openwireless movement\" (https://openwireless.org/) also promotes the sharing of private wireless networks.",
      "ja": "かかわらず、それらの物理的位置の（及び周辺機器;リソース、例えば、共有接続）これらのネットワークは、所有者共通の関心を共有するノードの集合として定義することができます。そのうちの一つは、通常、所有者によって使用され、他の一つは公開されている - ホームルータは、2つの無線ネットワークを作成します。彼らは、次のアプローチに準拠しています。帯域幅の小さな部分は、即時エリア内のサービスの任意のユーザによって使用されるパブリックネットワークに割り当てられています。いくつかの例は、[PAWS]と[Sathiaseelan_c]に記載されています。他の例は、都市協議会（例えば、[Heerさん]）によって作成され、管理ネットワークに見出されます。 「openwireless動きは」（https://openwireless.org/）もプライベートワイヤレスネットワークの共有を促進します。"
    },
    {
      "indent": 3,
      "text": "Some companies [Fon] also promote the use of Wi-Fi routers with dual access: a Wi-Fi network for the user and a shared one. Adequate Authentication, Authorization, and Accounting (AAA) policies are implemented, so people can join the network in different ways: they can buy a router, so they can share their connection and in turn, they get access to all the routers associated with the community. Some users can even get some revenue every time another user connects to their Wi-Fi Access Point. Users that are not part of the community can buy passes in order to use the network. Some mainstream telecommunications operators collaborate with these communities by including the functionality required to create the two access networks in their routers. Some of these efforts are surveyed in [Shi].",
      "ja": "ユーザーのためのWi-Fiネットワークと共有1：一部の企業は、[フォン]また、デュアルアクセスのWi-Fiルーターの利用を促進します。適切な認証、認可、アカウンティング（AAA）ポリシーは、人々がさまざまな方法でネットワークに参加することができますので、実装されています。彼らは、ルータを購入することができますので、彼らは彼らの接続と順番にを共有することができ、それらを関連付けられたすべてのルータへのアクセスを取得しますコミュニティ。一部のユーザーは、さらにいくつかの収入に別のユーザーが自分のWi-Fiアクセスポイントに接続するたびに取得することができます。コミュニティの一部ではないユーザーがネットワークを使用するためにパスを購入することができます。いくつかの主流の通信事業者は、そのルータに2つのアクセスネットワークを作成するために必要な機能を含むことにより、これらのコミュニティとのコラボレーション。これらの取り組みの一部は、[市]で調査されています。"
    },
    {
      "indent": 3,
      "text": "The elements involved in a crowdshared network are summarized below:",
      "ja": "crowdsharedネットワークに関わる要素は以下のとおりであります："
    },
    {
      "indent": 3,
      "text": "o Interest: A parameter capable of providing a measure (cost) of the attractiveness of a node in a specific location, at a specific instance in time.",
      "ja": "O関係：時間内の特定の瞬間に、特定の場所にあるノードの魅力の測定値（コスト）を提供することができるパラメータ。"
    },
    {
      "indent": 3,
      "text": "o Resources: A physical or virtual element of a global system. For instance, bandwidth; energy; data; and devices.",
      "ja": "Oリソース：グローバルシステムの物理または仮想要素。例えば、帯域幅、エネルギー;データ;およびデバイス。"
    },
    {
      "indent": 3,
      "text": "o The owner: End users who sign up for the service and share their network capacity. As a counterpart, they can access another owner's home network capacity for free. The owner can be an end user or an entity (e.g., operator; virtual mobile network operator; or municipality) that is to be made responsible for any actions concerning his/her device.",
      "ja": "サービスにサインアップすると、そのネットワーク容量を共有するエンドユーザー：所有者は、O。カウンターパートとして、彼らは自由のための別の所有者のホーム・ネットワーク容量にアクセスすることができます。彼/彼女のデバイスに関する任意のアクションを担当なされるべきである（又は市町村;仮想移動ネットワークオペレータ、例えば、オペレータ）所有者は、エンドユーザまたはエンティティとすることができます。"
    },
    {
      "indent": 3,
      "text": "o The user: A legal entity or an individual using or requesting a publicly available electronic communications service for private or business purposes, without necessarily having subscribed to such service.",
      "ja": "法人又は必ずしもそのようなサービスに加入しなくても、使用して、またはプライベートまたはビジネスの目的のために公的に利用可能な電子通信サービスを要求する個々のユーザO。"
    },
    {
      "indent": 3,
      "text": "o The VNO: An entity that acts in some aspects as a network coordinator. It may provide services such as initial authentication or registration and, eventually, trust relationship storage. A VNO is not an ISP given that it does not provide Internet access (e.g., infrastructure or naming). A VNO is not an Application Service Provider (ASP) either since it does not provide user services. VNOs may also be stakeholders with socio-environmental objectives. They can be local governments, grassroots user communities, charities, or even content operators, smart grid operators, etc. They are the ones who actually run the service.",
      "ja": "VNO O：ネットワークコーディネータとして、いくつかの側面に作用するエンティティ。このような初期認証や登録などのサービスを提供し、最終的には、関係記憶を信頼します。 VNOは、インターネットアクセス（例えば、インフラストラクチャまたは命名）を提供していないことを考えるとISPはありません。それは、ユーザーのサービスを提供していませんので、VNOは、アプリケーションサービスプロバイダ（ASP）のいずれかではありません。 VNOsまた、社会環境目標と利害関係者かもしれません。彼らは、彼らが実際にサービスを実行するものであり、地方政府、草の根のユーザーコミュニティ、慈善団体、またはその他にも、コンテンツ事業者、スマートグリッド事業者とすることができます。"
    },
    {
      "indent": 3,
      "text": "o Network operators: They have a financial incentive to lease out unused capacity [Sathiaseelan_b] at a lower cost to the VNOs.",
      "ja": "ネットワークオペレータO：彼らはVNOsに低コストで未使用容量[Sathiaseelan_b]を出しリースする報奨金を持っています。"
    },
    {
      "indent": 3,
      "text": "VNOs pay the sharers and the network operators, thus creating an incentive structure for all the actors: the end users get money for sharing their network, and the network operators are paid by the VNOs, who in turn accomplish their socio-environmental role.",
      "ja": "VNOsは、このようにすべての俳優のためのインセンティブ構造を作成、共有者とネットワークオペレータを支払う：エンドユーザーは、自分のネットワークを共有するためのお金を取得し、ネットワークオペレータは、今度は自分の社会的・環境的な役割を果たすVNOs、によって支払われます。"
    },
    {
      "indent": 0,
      "text": "5.5. Rural Utility Cooperatives",
      "section_title": true,
      "ja": "5.5. 農村ユーティリティ協同組合"
    },
    {
      "indent": 3,
      "text": "+---------------------+---------------------------------------------+\n| Entity behind the   | rural utility cooperative                   |\n| network             |                                             |\n+---------------------+---------------------------------------------+\n| Purpose             | to serve underserved areas and to reduce    |\n|                     | capital expenditures in Internet access     |\n+---------------------+---------------------------------------------+\n| Governance and      | the cooperative partners with an ISP who    |\n| sustainability      | manages the network                         |\n| model               |                                             |\n+---------------------+---------------------------------------------+\n| Technologies        | wired (fiber) and wireless                  |\n| employed            |                                             |\n+---------------------+---------------------------------------------+\n| Typical scenarios   | rural                                       |\n+---------------------+---------------------------------------------+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Table 5: Characteristics Summary for Rural Utility Cooperatives",
      "ja": "表5：農村ユーティリティ協同組合のための特性の概要"
    },
    {
      "indent": 3,
      "text": "A utility cooperative is a type of cooperative that delivers a public utility to its members. For example, in the United States, rural electric cooperatives have provided electric service starting in the 1930s, especially in areas where investor-owned utility would not provide service, believing there would be insufficient revenue to justify the capital expenditures required. Similarly, in many regions with low population density, traditional Internet Service Providers such as telephone companies or cable TV companies are either not providing service at all or only offering low-speed DSL service. Some rural electric cooperatives started installing fiber optic lines to run their smart grid applications, but they found they could provide fiber-based broadband to their members at little additional cost [Cash]. In some of these cases, rural electric cooperatives have partnered with local ISPs to provide Internet connection to their members [Carlson]. More information about these utilities and their management can be found in [NewMexico] and [Mitchell].",
      "ja": "ユーティリティ協同組合は、そのメンバーに公益を提供する協同組合の一種です。例えば、米国では、農村部の電気協同組合は、特に投資家所有のユーティリティは必要な設備投資を正当化するのに不十分収入があるだろうと信じ、サービスを提供しない地域では、1930年代に始まる電気サービスを提供してきました。同様に、低人口密度の多くの地域では、そのような電話会社やケーブルテレビ会社などの伝統的なインターネットサービスプロバイダは、どちらかで、すべてのサービスを提供していないか、だけ低速DSLサービスを提供しています。いくつかの農村部の電気協同組合は、スマートグリッドアプリケーションを実行するために、光ファイバ回線を設置始めたが、彼らは少し追加コスト[現金]でそのメンバーにファイバベースのブロードバンドを提供することができました。これらの例のいくつかでは、農村部の電気協同組合は、組合員[カールソン]へのインターネット接続を提供するために、地元のISPと提携しています。これらのユーティリティとその管理についての詳しい情報は[ニューメキシコ州]と[ミッチェル]で見つけることができます。"
    },
    {
      "indent": 0,
      "text": "5.6. Testbeds for Research Purposes",
      "section_title": true,
      "ja": "5.6. 研究目的のためのテストベッド"
    },
    {
      "indent": 3,
      "text": "+------------------+------------------------------------------------+\n| Entity behind    | research/academic entity                       |\n| the network      |                                                |\n+------------------+------------------------------------------------+\n| Purpose          | research                                       |\n+------------------+------------------------------------------------+\n| Governance and   | the management is initially coordinated by the |\n| sustainability   | research entity, but it may end up in a        |\n| model            | different model                                |\n+------------------+------------------------------------------------+\n| Technologies     | wired and wireless                             |\n| employed         |                                                |\n+------------------+------------------------------------------------+\n| Typical          | urban and rural                                |\n| scenarios        |                                                |\n+------------------+------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Table 6: Characteristics Summary for Testbeds",
      "ja": "表6：テストベッドのための特性の概要"
    },
    {
      "indent": 3,
      "text": "In some cases, the initiative to start the network is not from the community but from a research entity (e.g., a university), with the aim of using it for research purposes [Samanta] [Bernardi].",
      "ja": "いくつかのケースでは、ネットワークを開始するためのイニシアチブは、研究目的の[Samanta] [ベルナルディ]のためにそれを使用することを目的に、地域社会からではなく、研究のエンティティ（例えば、大学）からのものではありません。"
    },
    {
      "indent": 3,
      "text": "The administration of these networks may start being centralized in most cases (administered by the academic entity) and may end up in a non-centralized model in which other local stakeholders assume part of the network administration (for example, see [Rey]).",
      "ja": "これらのネットワークの投与は、（学術エンティティによって投与）ほとんどの場合に集中さ開始してもよいし、他の地域の利害関係者は、ネットワーク管理の一部を想定する非集中型モデルで終わることができる（例えば、[レイ]を参照）。"
    },
    {
      "indent": 0,
      "text": "6. Technologies Employed",
      "section_title": true,
      "ja": "就業6.テクノロジーズ"
    },
    {
      "indent": 0,
      "text": "6.1. Wired",
      "section_title": true,
      "ja": "6.1. ワイヤード"
    },
    {
      "indent": 3,
      "text": "In many (\"global north\" or \"global south\") countries, it may happen that national service providers decline to provide connectivity to tiny and isolated villages. So in some cases, the villagers have created their own optical fiber networks. This is the case in Lowenstedt, Germany [Lowenstedt] or in some parts of Guifi.net [Cerda-Alabern].",
      "ja": "多くの（「グローバル北」または「グローバル南」）の国では、全国のサービスプロバイダが小さなと孤立の村への接続を提供するために断ることが起こり得ます。だから、いくつかのケースでは、村人たちは、独自の光ファイバーネットワークを作成しました。これはLowenstedt、ドイツ[Lowenstedt]またはGuifi.netの一部で[Cerdaの-Alabern]場合です。"
    },
    {
      "indent": 0,
      "text": "6.2. Wireless",
      "section_title": true,
      "ja": "6.2. 無線"
    },
    {
      "indent": 3,
      "text": "The vast majority of Alternative Network Deployments are based on different wireless technologies [WNDW]. Below we summarize the options and trends when using these features in Alternative Networks.",
      "ja": "代替ネットワーク展開の大半は、異なる無線技術[WNDW]に基づいています。以下は、代替ネットワークにおけるこれらの機能を使用するときに我々はオプションと傾向をまとめます。"
    },
    {
      "indent": 0,
      "text": "6.2.1. Media Access Control (MAC) Protocols for Wireless Links",
      "section_title": true,
      "ja": "6.2.1. メディアアクセス制御（MAC）無線リンクのためのプロトコル"
    },
    {
      "indent": 3,
      "text": "Different protocols for MAC, which also include physical layer (PHY) recommendations, are widely used in Alternative Network Deployments. Wireless standards ensure interoperability and usability to those who design, deploy, and manage wireless networks. In addition, they then ensure the low cost of equipment due to economies of scale and mass production.",
      "ja": "また、物理層（PHY）の勧告を含むMACのための異なるプロトコルは、広く代替ネットワーク展開で使用されています。無線規格は、設計者に相互運用性と使いやすさを確保展開、およびワイヤレスネットワークを管理します。また、彼らはその後、原因規模や量産の経済への機器の低コストを確保します。"
    },
    {
      "indent": 3,
      "text": "The standards used in the vast majority of Alternative Networks come from the IEEE Standard Association's IEEE 802 Working Group. Standards developed by other international entities can also be used, such as, e.g., the European Telecommunications Standards Institute (ETSI).",
      "ja": "オルタナティブ・ネットワークの大半で使用される標準規格はIEEE規格協会のIEEE 802ワーキンググループから来ます。他の国際機関が開発した規格は、例えば、欧州電気通信標準化機構（ETSI）、としても使用することができます。"
    },
    {
      "indent": 0,
      "text": "6.2.1.1. 802.11 (Wi-Fi)",
      "section_title": true,
      "ja": "T.o .1.1。 802.11（IN）"
    },
    {
      "indent": 3,
      "text": "The standard we are most interested in is 802.11 a/b/g/n/ac, as it defines the protocol for Wireless LAN. It is also known as \"Wi-Fi\". The original release (a/b) was issued in 1999 and allowed for rates up to 54 Mbit/s. The latest release (802.11ac) approved in 2013 reaches up to 866.7 Mbit/s. In 2012, the IEEE issued an 802.11 standard that consolidated all the previous amendments [IEEE.802.11]. The document is freely downloadable from the IEEE Standards Association [IEEE].",
      "ja": "それは無線LANのためのプロトコルを定義するように、我々が最も興味を持っている標準は、802.11 / B / G / N / ACです。また、「のWi-Fi」として知られています。オリジナルリリース（A / B）が1999年に発行され、54メガビット/秒までのレートに許可されました。 2013年に承認された最新のリリース（802.11ac）は866.7メガビット/秒にまで達します。 2012年、IEEEは、以前のすべての修正[IEEE.802.11]を固め802.11規格を発行しました。文書は自由にIEEE規格協会[IEEE]からダウンロード可能です。"
    },
    {
      "indent": 3,
      "text": "The MAC protocol in 802.11 is called CSMA/CA and was designed for short distances; the transmitter expects the reception of an acknowledgment for each transmitted unicast packet and if a certain waiting time is exceeded, the packet is retransmitted. This behavior makes necessary the adaptation of several MAC parameters when 802.11 is used in long links [Simo_b]. Even with this adaptation, distance has a significant negative impact on performance. For this reason, many vendors implement alternative medium access techniques that are offered alongside the standard CSMA/CA in their outdoor 802.11 products. These alternative proprietary MAC protocols usually employ some type of TDMA. Low-cost equipment using these techniques can offer high throughput at distances above 100 kilometers.",
      "ja": "802.11におけるMACプロトコルは、CSMA / CAと呼ばれ、短い距離のために設計されました。送信機は、各送信されたユニキャストパケットに対する確認応答の受信を期待し、一定の待機時間を超過した場合、パケットが再送されます。この動作は、802.11が長いリンク[Simo_b]で使用されているいくつかのMACパラメータの必要な適応になります。でも、この適応で、距離は、パフォーマンスに大きなマイナスの影響を与えています。このような理由から、多くのベンダーは、屋外802.11製品に標準CSMA / CAと一緒に提供されている代替媒体アクセス技術を実装しています。これらの代替独自のMACプロトコルは、通常、TDMAのいくつかのタイプを採用しています。 100キロ以上の距離で高いスループットを提供することができ、これらの技術を使用して、低コストの装置。"
    },
    {
      "indent": 3,
      "text": "Different specifications of 802.11 operate in different frequency bands. 802.11b/g/n operates in 2.4 GHz, but 802.11a/n/ac operates in 5 GHz. This fact is used in some Community Networks in order to separate ordinary and \"backbone\" nodes:",
      "ja": "802.11の異なる仕様は、異なる周波数帯域で動作します。 802.11b / g / nの2.4GHz帯で動作する、しかしの802.11a / N / ACは、5ギガヘルツで動作します。この事実は、通常と「背骨」のノードを分離するために、いくつかのコミュニティ・ネットワークで使用されます。"
    },
    {
      "indent": 3,
      "text": "o Typical routers running mesh firmware in homes, offices, and public spaces operate at 2.4 GHz.",
      "ja": "O家庭、オフィス、公共空間でのメッシュのファームウェアを実行している典型的なルータは、2.4 GHzで動作します。"
    },
    {
      "indent": 3,
      "text": "o Special routers running mesh firmware as well but broadcasting and receiving on the 5 GHz band are used in point-to-point connections only. They are helpful to create a \"backbone\" on the network that can both connect neighborhoods to one another when reasonable connections with 2.4 GHz nodes are not possible, and they ensure that users of 2.4 GHz nodes are within a few hops to strong and stable connections to the rest of the network.",
      "ja": "Oだけでなく、メッシュのファームウェアを実行しているが、5 GHz帯に放送し、受信専用ルータは、ポイントツーポイント接続のみに使用されています。彼らは、2.4 GHzのノードとの合理的な接続が可能でない場合、両方お互いに地域を接続することができ、ネットワーク上の「バックボーン」を作成すると便利であり、それらは2.4 GHzのノードのユーザーは、強力かつ安定した接続に数ホップの範囲内であることを確認しますネットワークの他の部分へ。"
    },
    {
      "indent": 0,
      "text": "6.2.1.2. Mobile Technologies",
      "section_title": true,
      "ja": "6.2.1.2。モバイル・テクノロジーズ"
    },
    {
      "indent": 3,
      "text": "Global System for Mobile Communications (GSM), from ETSI, has also been used in Alternative Networks as a Layer 2 option, as explained in [Mexican], [Village], and [Heimerl]. Open source GSM code projects such as OpenBTS (http://openbts.org) or OpenBSC (http://openbsc.osmocom.org/trac/) have created an ecosystem with the participation of several companies such as, e.g., [Rangenetworks], [Endaga], and [YateBTS]. This enables deployments of voice, SMS, and Internet services over Alternative Networks with an IP-based backhaul.",
      "ja": "[メキシコ]で説明したようにETSIからモバイル・コミュニケーションズ（GSM）用のグローバルシステムは、また、レイヤ2オプションとして代替ネットワークで使用されている、[村]、および[Heimerl]。そのようなOpenBTS（http://openbts.org）またはOpenBSC（http://openbsc.osmocom.org/trac/）などのオープンソースGSMコードプロジェクトは、[Rangenetworks、例えば、のようないくつかの企業が参加するエコシステムを作成しました]、[Endaga]、および[YateBTS]。これは、IPベースのバックホールで代替ネットワーク上での音声、SMS、およびインターネットサービスの展開を可能にします。"
    },
    {
      "indent": 3,
      "text": "Internet navigation is usually restricted to relatively low bit rates (see, e.g., [Osmocom]). However, leveraging on the evolution of Third Generation Partnership Project (3GPP) standards, a trend can be observed towards the integration of 4G [Spectrum] [YateBTS] or 5G [Openair] functionalities, with significant increase of achievable bit rates.",
      "ja": "インターネットナビゲーションは通常、比較的低いビットレートに制限されている（参照、例えば、[Osmocom]）。しかし、第三世代パートナーシッププロジェクト（3GPP）規格の進化に活用し、傾向は、達成可能なビットレートの大幅な増加と、4G [スペクトラム] [YateBTS]または5G [オープンエアー]機能の統合に向けて観察することができます。"
    },
    {
      "indent": 3,
      "text": "Depending on factors such as the allocated frequency band, the adoption of licensed spectrum can have advantages over the eventually higher frequencies used for Wi-Fi, in terms of signal propagation and, consequently, coverage. Other factors favorable to 3GPP technologies, especially GSM, are the low cost and energy consumption of handsets, which facilitate its use by low-income communities.",
      "ja": "そのような割り当てられた周波数帯域のような要因に応じて、ライセンスされたスペクトルの採用は、信号伝播と、その結果、カバレッジの観点から、のWi-Fiのために使用される最終的に、より高い周波数を上回る利点を有することができます。 3GPP技術、特にGSMに有利な他の要因は、低所得コミュニティによってその使用を容易に携帯電話の低コストとエネルギー消費量です。"
    },
    {
      "indent": 0,
      "text": "6.2.1.3. Dynamic Spectrum",
      "section_title": true,
      "ja": "6.2.1.3。ダイナミックスペクトル"
    },
    {
      "indent": 3,
      "text": "Some Alternative Networks make use of TV White Spaces [Lysko] -- a set of UHF and VHF television frequencies that can be utilized by secondary users in locations where they are unused by licensed primary users such as television broadcasters. Equipment that makes use of TV White Spaces is required to detect the presence of existing unused TV channels by means of a spectrum database and/or spectrum sensing in order to ensure that no harmful interference is caused to primary users. In order to smartly allocate interference-free channels to the devices, cognitive radios are used that are able to modify their frequency, power, and modulation techniques to meet the strict operating conditions required for secondary users.",
      "ja": "彼らは、テレビ放送事業者として認可プライマリユーザによって使用されていない場所での二次利用者が利用することができUHFとVHFのテレビ周波数のセット - いくつかの代替ネットワークスは、TVホワイトスペース[Lysko]を利用します。 TVホワイトスペースを利用する装置は、有害な干渉がプライマリユーザに生じないことを確実にするために、スペクトルのデータベース及び/又はスペクトラムセンシングによって既存の未使用のTVチャネルの存在を検出するために必要とされます。スマートデバイスへの干渉のないチャネルを割り当てるために、コグニティブ無線は、二人のユーザーのために必要な厳しい動作条件を満たすように、それらの周波数、電力、および変調技術を変更することが可能であることに使用されます。"
    },
    {
      "indent": 3,
      "text": "The use of the term \"White Spaces\" is often used to describe \"TV White Spaces\" as the VHF and UHF television frequencies were the first to be exploited on a secondary use basis. There are two dominant standards for TV White Space communication: (i) the 802.11af standard [IEEE.802.11AF] -- an adaptation of the 802.11 standard for TV White Space bands -- and (ii) the IEEE 802.22 standard [IEEE.802.22] for long-range rural communication.",
      "ja": "用語「ホワイトスペース」の使用は、多くの場合、VHFとUHFのテレビ周波数が二次利用ごとに悪用される最初のあったように「TVホワイトスペース」を記述するために使用されます。 - テレビホワイトスペースバンドのための802.11規格の適合 - および（ii）IEEE 802.22標準[IEEE（I）802.11af標準[IEEE.802.11AF]：TVホワイトスペース通信用の2つの主要な基準があります。長距離農村通信用802.22]。"
    },
    {
      "indent": 0,
      "text": "6.2.1.3.1. 802.11af",
      "section_title": true,
      "ja": "6.2.1.3.1。 802.11af"
    },
    {
      "indent": 3,
      "text": "802.11af [IEEE.802.11AF] is a modified version of the 802.11 standard operating in TV White Space bands using cognitive radios to avoid interference with primary users. The standard is often referred to as \"White-Fi\" or \"Super Wi-Fi\" and was approved in February 2014. 802.11af contains much of the advances of all the 802.11 standards including recent advances in 802.11ac such as up to four bonded channels, four spatial streams, and very high-rate 256 QAM (Quadrature Amplitude Modulation) but with improved in-building penetration and outdoor coverage. The maximum data rate achievable is 426.7 Mbit/s for countries with 6/7 MHz channels and 568.9 Mbit/s for countries with 8 MHz channels. Coverage is typically limited to 1 km although longer range at lower throughput and using high gain antennas will be possible.",
      "ja": "802.11af [IEEE.802.11AF]プライマリユーザとの干渉を避けるために、コグニティブ無線を使用して、TVホワイトスペース帯域で動作する802.11規格の修正版です。標準はしばしば「ホワイト-Fiの」または「スーパーのWi-Fi」と呼ばれ、2014年802.11afは、最大4つ結合したとして、802.11acの最近の進歩を含むすべての802.11規格の進歩の多くが含まれている2月に承認されましたチャネルは、4つの空間ストリーム、および非常に高いレート256 QAM（直交振幅変調）が、改良された建物内浸透および屋外カバレッジを有します。最大データレートは、達成可能な6/7 MHzチャネルと8MHzのチャネルを有する国568.9メガビット/秒との国426.7メガビット/秒です。カバレッジは、典型的にはより低いスループットでより長い範囲であるが1キロに制限され、高利得アンテナを使用することは可能であろう。"
    },
    {
      "indent": 3,
      "text": "Devices are designated as enabling stations (Access Points) or dependent stations (clients). Enabling stations are authorized to control the operation of a dependent station and securely access a geolocation database. Once the enabling station has received a list of available White Space channels, it can announce a chosen channel to the dependent stations for them to communicate with the enabling station. 802.11af also makes use of a registered location server -- a local database that organizes the geographic location and operating parameters of all enabling stations.",
      "ja": "デバイスは有効ステーション（アクセスポイント）、または従属局（クライアント）に指定されています。イネーブル局は、従属局の動作を制御し、安全ジオロケーションデータベースへのアクセスを許可されています。有効ステーションが利用できるホワイトスペースチャネルのリストを受信したら、それは彼らが有効局と通信するための従属局に選ばれたチャンネルを発表することができます。すべての有効局の地理的位置や動作パラメータを整理し、ローカル・データベース -  802.11afも登録ロケーションサーバを利用します。"
    },
    {
      "indent": 0,
      "text": "6.2.1.3.2. 802.22",
      "section_title": true,
      "ja": "６。２。１。３。２。 ８０２。２２"
    },
    {
      "indent": 3,
      "text": "802.22 [IEEE.802.22] is a standard developed specifically for long-range rural communications in TV White Space frequencies and was first approved in July 2011. The standard is similar to the 802.16 (WiMax) [IEEE.802.16] standard with an added cognitive radio ability. The maximum throughput of 802.22 is 22.6 Mbit/s for a single 8 MHz channel using 64-QAM modulation. The achievable range using the default MAC scheme is 30 km; however, 100 km is possible with special scheduling techniques. The MAC of 802.22 is specifically customized for long distances -- for example, slots in a frame destined for more distant Consumer Premises Equipment (CPE) are sent before slots destined for nearby CPEs.",
      "ja": "802.22 [IEEE.802.22]は、TVホワイトスペース周波数における長距離農村通信のために特別に開発された標準であり、最初の標準を添加認知と[IEEE.802.16]標準802.16（ワイマックス）に類似している2011年7月に承認されましたラジオ機能。 802.22の最大スループットは、64-QAM変調を使用して単一の8 MHzチャネルのための22.6メガビット/秒です。デフォルトMAC方式を使用して、実現可能な範囲は30キロです。しかし、100キロは、特殊なスケジューリング技術で可能です。 802.22のMACは、特に長距離のためにカスタマイズされている - 例えば、より遠くの消費者宅内機器（CPE）宛のフレーム内のスロットの近くのCPE宛のスロットの前に送信されます。"
    },
    {
      "indent": 3,
      "text": "Base stations are required to have a Global Positioning System (GPS) and a connection to the Internet in order to query a geolocation spectrum database. Once the base station receives the allowed TV channels, it communicates a preferred operating TV White Space channel with the CPE devices. The standard also includes a coexistence mechanism that uses beacons to make other 802.22 base stations aware of the presence of a base station that is not part of the same network.",
      "ja": "基地局は、全地球測位システム（GPS）とジオロケーションスペクトルデータベースを照会するために、インターネットへの接続が要求されます。基地局は許さテレビチャンネルを受信すると、CPEデバイスと好ましい動作TVホワイトスペースのチャネルを通信します。標準はまた、同一のネットワークの一部ではない基地局の存在の他の802.22の基地局に認識させるためにビーコンを使用して共存機構を含みます。"
    },
    {
      "indent": 0,
      "text": "7. Upper Layers",
      "section_title": true,
      "ja": "7.上位層"
    },
    {
      "indent": 0,
      "text": "7.1. Layer 3",
      "section_title": true,
      "ja": "7.1. レイヤ3"
    },
    {
      "indent": 0,
      "text": "7.1.1. IP Addressing",
      "section_title": true,
      "ja": "7.1.1.  IPアドレス指定"
    },
    {
      "indent": 3,
      "text": "Most Community Networks use private IPv4 address ranges, as defined by [RFC1918]. The motivation for this was the lower cost and the simplified IP allocation because of the large available address ranges.",
      "ja": "[RFC1918]で定義されているほとんどのコミュニティ・ネットワークは、プライベートIPv4アドレス範囲を使用しています。この動機は低コストであるため、大きな可能なアドレス範囲の簡略化されたIP割り当てました。"
    },
    {
      "indent": 3,
      "text": "Most known Alternative Networks started in or around the year 2000. IPv6 was fully specified by then, but almost all Alternative Networks still use IPv4. A survey [Avonts] indicated that IPv6 rollout presented a challenge to Community Networks. However, some of them have already adopted it, such as ninux.org.",
      "ja": "最も知られている代替ネットワークスは2000年にかの周りを開始IPv6が完全にそれまでに指定されたが、ほとんどすべての代替ネットワークスは、まだIPv4のを使用しました。調査[Avonts]は、IPv6の展開は、コミュニティネットワークへの挑戦を提示していることが示されました。しかし、それらのいくつかはすでにninux.orgとして、それを採用しています。"
    },
    {
      "indent": 0,
      "text": "7.1.2. Routing Protocols",
      "section_title": true,
      "ja": "7.1.2. ルーティングプロトコル"
    },
    {
      "indent": 3,
      "text": "As stated in previous sections, Alternative Networks are composed of possibly different Layer 2 devices, resulting in a mesh of nodes. A connection between different nodes is not guaranteed, and the link stability can vary strongly over time. To tackle this, some Alternative Networks use mesh routing protocols for Mobile Ad Hoc Networks (MANETs), while other ones use more traditional routing protocols. Some networks operate multiple routing protocols in parallel. For example, they may use a mesh protocol inside different islands and rely on traditional routing protocols to connect these islands.",
      "ja": "前のセクションで述べたように、代替ネットワークは、ノードのメッシュをもたらす、おそらく異なるレイヤ2つのデバイスで構成されています。異なるノード間の接続が保証されないと、リンクの安定性は、時間の経過とともに強く異なる場合があります。他のものは、より伝統的なルーティングプロトコルを使用しながら、これに取り組むために、いくつかの代替ネットワークは、アドホックネットワーク（MANET）用のメッシュルーティングプロトコルを使用します。いくつかのネットワークは、並列に複数のルーティングプロトコルを動作させます。例えば、彼らは別の島の内側にメッシュプロトコルを使用することができ、これらの島々を接続するために、伝統的なルーティングプロトコルに依存しています。"
    },
    {
      "indent": 0,
      "text": "7.1.2.1. Traditional Routing Protocols",
      "section_title": true,
      "ja": "7.1.2.1。伝統的なルーティングプロトコル"
    },
    {
      "indent": 3,
      "text": "The Border Gateway Protocol (BGP), as defined by [RFC4271], is used by a number of Community Networks because of its well-studied behavior and scalability.",
      "ja": "ボーダーゲートウェイプロトコル（BGP）は、[RFC4271]で定義されるように、なぜならそのよく研究挙動とスケーラビリティのコミュニティネットワークの数によって使用されます。"
    },
    {
      "indent": 3,
      "text": "For similar reasons, smaller networks opt to run the Open Shortest Path First (OSPF) protocol, as defined by [RFC2328].",
      "ja": "同様の理由により、小さいネットワークは[RFC2328]で定義されるように、オープンショーテストパスファースト（OSPF）プロトコルを実行することを選びます。"
    },
    {
      "indent": 0,
      "text": "7.1.2.2. Mesh Routing Protocols",
      "section_title": true,
      "ja": "7.1.2.2。ルーティングプロトコルをメッシュ"
    },
    {
      "indent": 3,
      "text": "A large number of Alternative Networks use customized versions of the Optimized Link State Routing (OLSR) Protocol [RFC3626]. The open source project [OLSR] has extended the protocol with the Expected Transmission Count (ETX) metric [Couto] and other features for its use in Alternative Networks, especially wireless ones. A new version of the protocol, named OLSRv2 [RFC7181], is becoming used in some Community Networks [Barz].",
      "ja": "代替ネットワークの多数は、最適化リンク状態ルーティング（OLSR）プロトコル[RFC3626]のカスタマイズされたバージョンを使用します。オープンソースプロジェクトは、[OLSR]代替ネットワークにおけるその使用、特に無線のものに予想される送信回数（ETX）メトリック[クート]や他の機能とプロトコルを拡張しました。 OLSRv2 [RFC7181]という名前のプロトコルの新しいバージョンでは、いくつかのコミュニティネットワーク[バーズ]で使用になってきています。"
    },
    {
      "indent": 3,
      "text": "Better Approach To Mobile Ad Hoc Networking (B.A.T.M.A.N.) Advanced [Seither] is a Layer 2 routing protocol, which creates a bridged network and allows seamless roaming of clients between wireless nodes.",
      "ja": "より良いアプローチモバイルアドホックネットワーク（B.A.T.M.A.N.）アドバンスト[Seither]はブリッジネットワークを作成し、無線ノード間のクライアントのシームレスなローミングを可能にするレイヤ2ルーティングプロトコルです。"
    },
    {
      "indent": 3,
      "text": "Some networks also run the BatMan-eXperimental Version 6 (BMX6) protocol [Neumann_a], which is based on IPv6 and tries to exploit the social structure of Alternative Networks.",
      "ja": "いくつかのネットワークはまた、IPv6をベースと代替ネットワークの社会構造を利用しようとしているバットマン、実験バージョン6（BMX6）プロトコル[Neumann_a]を、実行します。"
    },
    {
      "indent": 3,
      "text": "Babel [RFC6126] is a Layer 3 loop-avoiding distance-vector routing protocol that is robust and efficient both in wired and wireless mesh networks.",
      "ja": "バベル[RFC6126]は、有線および無線メッシュネットワークの両方で堅牢かつ効率的であるレイヤ3ループ回避距離ベクトルルーティングプロトコルです。"
    },
    {
      "indent": 3,
      "text": "In [Neumann_b], a study of three proactive mesh routing protocols (BMX6, OLSR, and Babel) is presented, in terms of scalability, performance, and stability.",
      "ja": "【Neumann_b]では、三のプロアクティブメッシュルーティングプロトコル（BMX6、OLSR、およびバベル）の研究は、スケーラビリティ、性能、及び安定性の観点から、提示されています。"
    },
    {
      "indent": 0,
      "text": "7.2. Transport Layer",
      "section_title": true,
      "ja": "7.2. トランスポート層"
    },
    {
      "indent": 0,
      "text": "7.2.1. Traffic Management When Sharing Network Resources",
      "section_title": true,
      "ja": "7.2.1. トラフィック管理、ネットワークリソースを共有する場合"
    },
    {
      "indent": 3,
      "text": "When network resources are shared (as, e.g., in the networks explained in Section 5.4), special care has to be taken with the management of the traffic at upper layers. From a crowdshared perspective, and considering just regular TCP connections during the critical sharing time, the Access Point offering the service is likely to be the bottleneck of the connection.",
      "ja": "（例えば、ネットワーク内のセクション5.4で説明したように）ネットワークリソースが共有される場合、特別な注意は、上位層でのトラフィックの管理に注意しなければなりません。 crowdshared観点から、そして重要な共有時間の間だけで、通常のTCPコネクションを考慮し、サービスを提供するアクセスポイントは、接続のボトルネックになる可能性があります。"
    },
    {
      "indent": 3,
      "text": "This is the main concern of sharers, having several implications. In some cases, an adequate Active Queue Management (AQM) mechanism that implements a Less-than-Best-Effort (LBE) [RFC6297] policy for the user is used to protect the sharer. Achieving LBE behavior requires the appropriate tuning of well-known mechanisms such as Explicit Congestion Notification (ECN) [RFC3168], Random Early Detection (RED) [RFC7567], or other more recent AQM mechanisms that aid low latency such as Controlled Delay (CoDel) [CoDel] and Proportional Integral controller Enhanced (PIE) [PIE] design.",
      "ja": "これは、いくつかの意味合いを持つ、共有者の主要な関心事です。いくつかのケースでは、ユーザのためのより少なくよりベストエフォート（LBE）[RFC6297]ポリシーを実装する十分なアクティブキュー管理（AQM）機構は、共有者を保護するために使用されます。 LBE挙動を達成することは、そのような明示的輻輳通知（ECN）のような周知の機構[RFC3168]、ランダム早期検出（RED）[RFC7567]、またはそのような制御遅延（CODELなどの低レイテンシを支援する他のより最近のAQM機構の適切なチューニングを必要とします）[CODEL]比例積分コントローラ拡張（PIE）[PIE]デザイン。"
    },
    {
      "indent": 0,
      "text": "7.3. Services Provided",
      "section_title": true,
      "ja": "7.3. 提供するサービス"
    },
    {
      "indent": 3,
      "text": "This section provides an overview of the services provided by the network. Many Alternative Networks can be considered Autonomous Systems, being (or aspiring to be) a part of the Internet.",
      "ja": "ここでは、ネットワークが提供するサービスの概要を説明します。多くの代替ネットワークは、インターネットの一部である（またはを目指す）、自律システムとみなすことができます。"
    },
    {
      "indent": 3,
      "text": "The services provided can include, but are not limited to:",
      "ja": "提供するサービスは、これらに限定されないができます。"
    },
    {
      "indent": 3,
      "text": "o Web browsing.",
      "ja": "OのWebブラウジング。"
    },
    {
      "indent": 3,
      "text": "o Email.",
      "ja": "Oメール。"
    },
    {
      "indent": 3,
      "text": "o Remote desktop (e.g., using my home computer and my Internet connection when I am away).",
      "ja": "Oリモートデスクトップ（例えば、私は離れていたときに私の自宅のコンピュータと私のインターネット接続を使用して）。"
    },
    {
      "indent": 3,
      "text": "o FTP file sharing (e.g., distribution of software and media).",
      "ja": "O FTPファイル共有（例えば、ソフトウェアおよびメディアの分布）。"
    },
    {
      "indent": 3,
      "text": "o VoIP (e.g., with SIP).",
      "ja": "VoIPのO（例えば、SIPで）。"
    },
    {
      "indent": 3,
      "text": "o Peer-to-Peer (P2P) file sharing.",
      "ja": "Oピア・ツー・ピア（P2P）ファイル共有。"
    },
    {
      "indent": 3,
      "text": "o Public video cameras.",
      "ja": "O公共のビデオカメラ。"
    },
    {
      "indent": 3,
      "text": "o DNS.",
      "ja": "OのDNS。"
    },
    {
      "indent": 3,
      "text": "o Online game servers.",
      "ja": "オンラインゲームサーバーO。"
    },
    {
      "indent": 3,
      "text": "o Jabber instant messaging.",
      "ja": "O Jabberのインスタントメッセージング。"
    },
    {
      "indent": 3,
      "text": "o Weather stations.",
      "ja": "O気象局。"
    },
    {
      "indent": 3,
      "text": "o Network monitoring.",
      "ja": "ネットワーク監視O。"
    },
    {
      "indent": 3,
      "text": "o Videoconferencing/streaming.",
      "ja": "Oビデオ会議/ストリーミング。"
    },
    {
      "indent": 3,
      "text": "o Radio streaming.",
      "ja": "Oラジオのストリーミング。"
    },
    {
      "indent": 3,
      "text": "o Message/bulletin board.",
      "ja": "Oメッセージ/掲示板。"
    },
    {
      "indent": 3,
      "text": "o Local cloud storage services.",
      "ja": "Oローカルクラウド・ストレージ・サービスを提供しています。"
    },
    {
      "indent": 3,
      "text": "Due to bandwidth limitations, some services (file sharing, VoIP, etc.) may not be allowed in some Alternative Networks. In some of these cases, a number of federated proxies provide web-browsing service for the users.",
      "ja": "帯域幅の制限により、一部のサービス（ファイル共有、VoIPの、など）は、いくつかの代替ネットワークで許可されないことがあります。これらの例のいくつかでは、フェデレーションプロキシの数は、ユーザーのためのウェブブラウジングサービスを提供しています。"
    },
    {
      "indent": 3,
      "text": "Some specialized services have been specifically developed for Alternative Networks:",
      "ja": "いくつかの専門的なサービスは、特にオルタナティブ・ネットワークのために開発されています。"
    },
    {
      "indent": 3,
      "text": "o Inter-network peering/VPNs (e.g., https://wiki.freifunk.net/IC-VPN).",
      "ja": "Oネットワーク間のピアリング/ VPNの（例えば、https://wiki.freifunk.net/IC-VPN）。"
    },
    {
      "indent": 3,
      "text": "o Community-oriented portals (e.g., http://tidepools.co/).",
      "ja": "Oコミュニティ指向ポータル（例えば、http://tidepools.co/）。"
    },
    {
      "indent": 3,
      "text": "o Network monitoring/deployment/maintenance platforms.",
      "ja": "Oネットワーク監視/導入/維持管理プラットフォーム。"
    },
    {
      "indent": 3,
      "text": "o VoIP sharing between networks, allowing cheap calls between countries.",
      "ja": "O VoIPは国間の格安通話をできるように、ネットワーク間で共有します。"
    },
    {
      "indent": 3,
      "text": "o Sensor networks and citizen science built by adding sensors to devices.",
      "ja": "デバイスにセンサーを追加することによって構築されたセンサネットワークや市民科学O。"
    },
    {
      "indent": 3,
      "text": "o Community radio/TV stations.",
      "ja": "コミュニティラジオ/ TV局、O。"
    },
    {
      "indent": 3,
      "text": "Other services (e.g., local wikis as used in community portals; see https://localwiki.org) can also provide useful information when supplied through an Alternative Network, although they were not specifically created for them.",
      "ja": "その他のサービス（コミュニティ・ポータルで使用されるように、例えば、ローカルウィキ; https://localwiki.orgを参照してください）代替ネットワークを介して供給されたとき、彼らは、特に彼らのために作成されていないが、また、有用な情報を提供することができます。"
    },
    {
      "indent": 0,
      "text": "7.3.1. Use of VPNs",
      "section_title": true,
      "ja": "7.3.1.  VPNの使用"
    },
    {
      "indent": 3,
      "text": "Some \"micro-ISPs\" may use the network as a backhaul for providing Internet access, setting up VPNs from the client to a machine with Internet access.",
      "ja": "いくつかの「マイクロISPは、」インターネットアクセスのマシンにクライアントからのVPNを設定し、インターネットへのアクセスを提供するためのバックホールとしてのネットワークを使用することができます。"
    },
    {
      "indent": 3,
      "text": "Many Community Networks also use VPNs to connect multiple disjoint parts of their networks together. In some others, every node establishes a VPN tunnel as well.",
      "ja": "多くのコミュニティ・ネットワークも一緒にネットワークの複数のばらばらの部品を接続するためにVPNを使用しています。いくつかの他のものでは、すべてのノードが同様にVPNトンネルを確立します。"
    },
    {
      "indent": 0,
      "text": "7.3.2. Other Facilities",
      "section_title": true,
      "ja": "7.3.2. その他の施設"
    },
    {
      "indent": 3,
      "text": "Other facilities, such as NTP or Internet Relay Chat (IRC) servers may also be present in Alternative Networks.",
      "ja": "このようNTPまたはインターネットリレーチャット（IRC）サーバなどのその他の施設には、また、オルタナティブ・ネットワークに存在することができます。"
    },
    {
      "indent": 0,
      "text": "7.4. Security Considerations",
      "section_title": true,
      "ja": "7.4. セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "No security issues have been identified for this document.",
      "ja": "いかなるセキュリティ問題はこのドキュメントのために同定されていません。"
    },
    {
      "indent": 0,
      "text": "8. Informative References",
      "section_title": true,
      "ja": "8.参考文献"
    },
    {
      "indent": 3,
      "text": "[Airjaldi] AirJaldi Networks, \"Airjaldi Service\", 2015, <https://airjaldi.com/>.",
      "ja": "[Airjaldi] AirJaldiネットワークス、 \"Airjaldiサービス\"、2015年、<https://airjaldi.com/>。"
    },
    {
      "indent": 3,
      "text": "[airMAX] Ubiquiti Networks, Inc., \"airMAX\", 2016, <https://www.ubnt.com/broadband/>.",
      "ja": "[エアマックス] Ubiquitiネットワークス、 \"エアマックス\"、2016年、<https://www.ubnt.com/broadband/>。"
    },
    {
      "indent": 3,
      "text": "[Avonts] Avonts, J., Braem, B., and C. Blondia, \"A Questionnaire based Examination of Community Networks\", IEEE 9th International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob), pp. 8-15, DOI 10.1109/WiMOB.2013.6673333, October 2013.",
      "ja": "【Avonts] Avonts、J.、Braem、B.、およびC. Blondia、「コミュニティネットワークの検討基づいてアンケート」、ワイヤレスでIEEE第9回国際会議、およびモバイルコンピューティング、ネットワーキングおよび通信（WiMob）、頁8-15 、DOI 10.1109 / WiMOB.2013.6673333、2013年10月。"
    },
    {
      "indent": 3,
      "text": "[Baig] Baig, R., Roca, R., Freitag, F., and L. Navarro, \"guifi.net, a crowdsourced network infrastructure held in common\", Computer Networks, Vol. 90, Issue C, pp. 150-165, DOI 10.1016/j.comnet.2015.07.009, October 2015.",
      "ja": "[Baig] Baig、R.、ロカ、R.、フライターグ、F.、およびL.ナバロ、 \"guifi.net、共通で開催されたクラウドソーシングネットワークインフラストラクチャ\"、コンピュータネットワーク、巻。 90号C、PP。150-165、DOI 10.1016 / j.comnet.2015.07.009、2015年10月。"
    },
    {
      "indent": 3,
      "text": "[Barz] Barz, C., Fuchs, C., Kirchhoff, J., Niewiejska, J., and H. Rogge, \"OLSRv2 for Community Networks\", Computer Networks, Vol. 93, Issue P2, pp. 324-341, December 2015, <http://dx.doi.org/10.1016/j.comnet.2015.09.022>.",
      "ja": "[バーズ]バーズ、C.、フックス、C.、キルヒホッフ、J.、Niewiejska、J.、およびH.ロゲ会長、 \"コミュニティ・ネットワークのOLSRv2\"、コンピュータネットワーク、巻。 93号P2、頁324から341まで、2015年12月、<http://dx.doi.org/10.1016/j.comnet.2015.09.022>。"
    },
    {
      "indent": 3,
      "text": "[Bernardi] Bernardi, B., Buneman, P., and M. Marina, \"Tegola Tiered Mesh Network Testbed in Rural Scotland\", Proceedings of the 2008 ACM workshop on Wireless networks and systems for developing regions, pp. 9-16, DOI 10.1145/1410064.1410067, 2008.",
      "ja": "【ベルナルディ】ベルナルディ、B.、Buneman、P.、およびM.マリーナ、「農村スコットランドTegola階層メッシュネットワークテストベッド」、領域を開発するためのワイヤレスネットワークとシステム2008 ACMワークショップの議事録、頁9-16、 DOI 10.1145 / 1410064.1410067、2008。"
    },
    {
      "indent": 3,
      "text": "[Braem] Braem, B., Baig Vinas, R., Kaplan, A., Neumann, A., Vilata i Balaguer, I., Tatum, B., Matson, M., Blondia, C., Barz, C., Rogge, H., Freitag, F., Navarro, L., Bonicioli, J., Papathanasiou, S., and P. Escrich, \"A Case for Research with and on Community Networks\", ACM SIGCOMM Computer Communication Review, Vol. 43, Issue 3, pp. 68-73, DOI 10.1145/2500098.2500108, July 2013.",
      "ja": "【Braem] Braem、B.、Baigヴァイナス、R.、カプラン、A.、ノイマン、A.、Vilata I Balaguer、I.、テイタム、B.、マトソン、M.、Blondia、C.、バーズ、C. 、ロゲ会長、H.、フライターグ、F.、ナバロ、L.、Bonicioli、J.、Papathanasiou、S.、およびP. Escrich、 \"コミュニティ・ネットワークを持つと研究のためのケース\"、ACM SIGCOMMコンピュータコミュニケーションレビュー、集。 43、3号、PP。68-73、DOI 10.1145 / 2500098.2500108、2013年7月。"
    },
    {
      "indent": 3,
      "text": "[Brewer] Brewer, E., Demmer, M., Du, B., Ho, M., Kam, M., Nedevschi, S., Pal, J., Patra, R., Surana, S., and K. Fall, \"The Case for Technology in Developing Regions\", IEEE Computer Society, Vol. 38, Issue 6, pp. 25-38, DOI 10.1109/MC.2005.204, 2005.",
      "ja": "【ブリュー​​ワー】ブリューワー、E.、Demmer、M.、デュ、B.、ホー、M.、カム、M.、Nedevschi、S.、パル、J.、パトラ、R.、Surana、S.、およびK 。秋、「開発途上地域における技術のためのケース」、IEEEコンピュータ学会、巻。 38、問題6、PP。25-38、DOI 10.1109 / MC.2005.204 2005。"
    },
    {
      "indent": 3,
      "text": "[Carlson] Carlson, S. and C. Mitchell, \"RS Fiber: Fertile Fields for New Rural Internet Cooperative\", Institute for Local Self-Reliance and Next Century Cities, April 2016, <https://ilsr.org/wp-content/uploads/downloads/2016/04/ rs-fiber-report-2016.pdf>.",
      "ja": "[カールソン]カールソン、S.とC.ミッチェル、「RSファイバー：新しい農村協同インターネットのための肥沃なフィールド」、地方自立と次世紀の都市研究所、2016年4月、<https://ilsr.org/wp-コンテンツ/アップロード/ダウンロード/ 2016/04 / RS-ファイバレポート-2016.pdf>。"
    },
    {
      "indent": 3,
      "text": "[Cash] Cash, C., \"CO-MO'S D.I.Y. Model for Building Broadband\", National Rural Electric Cooperative Association (NRECA), November 2015, <http://remagazine.coop/co-mo-broadband/>.",
      "ja": "[現金]現金、C.、 \"ビルブロードバンド用CO-MO'S D.I.Y.モデル\"、国立農村電気協同組合（NRECA）、2015年11月、<http://remagazine.coop/co-mo-broadband/>。"
    },
    {
      "indent": 3,
      "text": "[Cerda-Alabern] Cerda-Alabern, L., \"On the topology characterization of Guifi.net\", Proceedings of the IEEE 8th International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob), pp. 389-396, DOI 10.1109/WiMOB.2012.6379103, October 2012.",
      "ja": "\"Guifi.netのトポロジーの特徴付けに\" [Cerdaの-Alabern] Cerdaの-Alabern、L.、ワイヤレスおよびモバイルコンピューティング、ネットワーキングおよび通信（WiMob）、PP。389-396、DOIに関するIEEE第8回国際会議の議事録10.1109 / WiMOB.2012.6379103、2012年10月。"
    },
    {
      "indent": 3,
      "text": "[CoDel] Nichols, K., Jacobson, V., McGregor, A., and J. Iyengar, \"Controlled Delay Active Queue Management\", Work in Progress, draft-ietf-aqm-codel-04, June 2016.",
      "ja": "[CODEL]ニコルズ、K.、ヤコブソン、V.、マクレガー、A.、およびJ.アイアンガー、 \"制御された遅延アクティブキュー管理\"、進捗状況、ドラフト-IETF-AQM-CODEL-04、2016年6月での作業。"
    },
    {
      "indent": 3,
      "text": "[Couto] De Couto, D., Aguayo, D., Bicket, J., and R. Morris, \"A high-throughput path metric for multi-hop wireless routing\", Wireless Networks, Vol. 11, Issue 4, pp. 419-434, DOI 10.1007/s11276-005-1766-z, July 2005.",
      "ja": "【クート】デクート、D.、Aguayo、D.、Bicket、J.、およびR.モリス、「マルチホップ無線ルーティングのためのハイスループットパスメトリック」、無線ネットワーク、巻。 11、第4号、PP。419-434、DOI 10.1007 / s11276-005-1766-Z、2005年7月。"
    },
    {
      "indent": 3,
      "text": "[Endaga] Alleven, M., \"Endaga raises $1.2M to help it bring cellular to remote villages\", FierceWireless Tech News, December 2014, <http://www.fiercewireless.com/tech/story/ endaga-raises-12m-help-it-bring-cellular-remote-villages/2014-12-03>.",
      "ja": "[Endaga] Alleven、M.、 \"Endagaが、それは、リモートの村に携帯持っ助けるために$ 1.2Mを上げる\"、FierceWireless技術のニュース、2014年12月、<http://www.fiercewireless.com/tech/story/ endaga--12mが提起します-help-IT-持参 - セルラー - リモートの村/ 2014年12月3日>。"
    },
    {
      "indent": 3,
      "text": "[Everylayer] Everylayer, Inc. (formerly Volo Broadband), \"Everylayer\", 2015, <http://www.everylayer.com/>.",
      "ja": "[Everylayer] Everylayer株式会社（旧VOLOブロードバンド）、 \"Everylayer\"、2015年、<http://www.everylayer.com/>。"
    },
    {
      "indent": 3,
      "text": "[Fon] Fon, \"Fon is the Global WiFi Network\", 2014, <https://corp.fon.com/en>.",
      "ja": "[フォン]フォンは、2014年、<https://corp.fon.com/en> \"フォングローバルのWiFiネットワークです\"。"
    },
    {
      "indent": 3,
      "text": "[GAIA] Internet Research Task Force, \"Charter: Global Access to the Internet for All Research Group (GAIA)\", 2016, <https://irtf.org/gaia>.",
      "ja": "[GAIA]インターネットリサーチタスクフォース、 \"憲章：すべての研究グループのためのインターネットへのグローバルアクセス（GAIA）\"、2016年、<https://irtf.org/gaia>。"
    },
    {
      "indent": 3,
      "text": "[Heer] Heer, T., Hummen, R., Viol, N., Wirtz, H., Gotz, S., and K. Wehrle, \"Collaborative municipal Wi-Fi networks-challenges and opportunities\", 8th IEEE International Conference on Pervasive Computing and Communications Workshops (PERCOM Workshops), pp. 588-593, DOI 10.1109/PERCOMW.2010.5470505, 2010.",
      "ja": "[Heerさん] Heerさん、T.、Hummen、R.、ヴィオール、N.、ワーツ、H.、ゲッツ、S.、およびK. Wehrleの、 \"共同市営のWi-Fiネットワーク-課題と機会\"、第8回IEEE国際会議パーベイシブ・コンピューティングおよび通信ワークショップ（PERCOMワークショップ）、頁588から593、DOI 10.1109 / PERCOMW.2010.5470505、2010。"
    },
    {
      "indent": 3,
      "text": "[Heimerl] Heimerl, K., Shaddi, H., Ali, K., Brewer, E., and T. Parikh, \"Local, sustainable, small-scale cellular networks\", In ICTD 2013, Cape Town, South Africa, DOI 10.1145/2516604.2516616, 2013.",
      "ja": "[Heimerl] Heimerl、K.、Shaddi、H.、アリ、K.、ビール、E.、およびT.パリキ、 \"ローカル、持続可能な、小規模な携帯電話ネットワーク\"、ICTD 2013年、ケープタウン、南アフリカ共和国、 DOI 10.1145 / 2516604.2516616、2013。"
    },
    {
      "indent": 3,
      "text": "[IEEE] Institute of Electrical and Electronics Engineers (IEEE), \"IEEE Standards Association\", <https://standards.ieee.org/>.",
      "ja": "[IEEE]電気電子技術者協会（IEEE）、 \"IEEE規格協会\"、<https://standards.ieee.org/>。"
    },
    {
      "indent": 3,
      "text": "[IEEE.802.11] IEEE, \"IEEE Standard for Information technology-- Telecommunications and information exchange between systems Local and metropolitan area networks--Specific requirements Part 11: Wireless LAN Medium Access Control (MAC) and Physical Layer (PHY) Specifications\", IEEE 802.11-2012, DOI 10.1109/ieeestd.2012.6178212, April 2012, <http://standards.ieee.org/getieee802/ download/802.11-2012.pdf>.",
      "ja": "[IEEE.802.11] IEEE、「システムローカルおよびメトロポリタンエリアネットワーク間のテレコミュニケーションと情報交換technology--情報のためのIEEE規格 - 特定の要件パート11：無線LAN媒体アクセス制御（MAC）および物理層（PHY）仕様」、 IEEE 802.11から2012、DOI 10.1109 / ieeestd.2012.6178212、2012年4月、<http://standards.ieee.org/getieee802/ダウンロード/ 802.11-2012.pdf>。"
    },
    {
      "indent": 3,
      "text": "[IEEE.802.11AF] IEEE, \"IEEE Standard for Information technology - Telecommunications and information exchange between systems - Local and metropolitan area networks - Specific requirements - Part 11: Wireless LAN Medium Access Control (MAC) and Physical Layer (PHY) specifications - Amendment 5: Television White Spaces (TVWS) Operation\", IEEE 802.11af-2013, DOI 10.1109/ieeestd.2014.6744566, February 2014, <http://standards.ieee.org/getieee802/ download/802.11af-2013.pdf>.",
      "ja": "情報技術のための[IEEE.802.11AF] IEEE、「IEEE規格 - 電気通信及びシステム間の情報交換 - 地方とメトロポリタンエリアネットワーク - 特定の要件 - パート11：無線LAN媒体アクセス制御（MAC）および物理層（PHY）仕様 - 改正5：テレビホワイトスペース（TVWS）操作」、IEEE 802.11af-2013、DOI 10.1109 / ieeestd.2014.6744566、2014年2月、<http://standards.ieee.org/getieee802/ダウンロード/ 802.11af-2013.pdf> 。"
    },
    {
      "indent": 3,
      "text": "[IEEE.802.16] IEEE, \"IEEE Standard for Information technology - Telecommunications and information exchange between systems - Broadband wireless metropolitan area networks (MANs) - IEEE Standard for Air Interface for Broadband Wireless Access Systems\", IEEE 802.16-2012, DOI 10.1109/ieeestd.2012.6272299, August 2012, <http://standards.ieee.org/getieee802/ download/802.16-2012.pdf>.",
      "ja": "【IEEE.802.16] IEEE、「情報技術のためのIEEE規格 - システム間の電気通信および情報交換 - ブロードバンド無線メトロポリタンエリアネットワーク（MAN） - 広帯域無線アクセスシステムのためのエアインターフェースのためのIEEE規格」、IEEE 802.16から2012、DOI 10.1109 / ieeestd.2012.6272299、2012年8月、<http://standards.ieee.org/getieee802/ダウンロード/ 802.16-2012.pdf>。"
    },
    {
      "indent": 3,
      "text": "[IEEE.802.22] IEEE, \"IEEE Standard for Information technology-- Local and metropolitan area networks-- Specific requirements-- Part 22: Cognitive Wireless RAN Medium Access Control (MAC) and Physical Layer (PHY) specifications: Policies and procedures for operation in the TV Bands\", IEEE 802.22-2011, DOI 10.1109/ieeestd.2011.5951707, July 2011, <http://ieeexplore.ieee.org/servlet/ opac?punumber=5951705>.",
      "ja": "[IEEE.802.22] IEEE、「情報のためのIEEE規格は、地方と首都圏networks--特定requirements--パート22をtechnology--：方針と手順について：コグニティブ無線は、媒体アクセス制御（MAC）および物理層（PHY）の仕様をRAN IEEE 802.22から2011、DOI 10.1109 / ieeestd.2011.5951707、2011年7月、「TVバンドでの動作、<http://ieeexplore.ieee.org/servlet/ OPAC？punumber = 5951705>。"
    },
    {
      "indent": 3,
      "text": "[IFAD2011] International Fund for Agricultural Development (IFAD), \"Rural Poverty Report 2011\", ISBN 978-92-9072-200-7, 2011.",
      "ja": "[IFAD2011]国際農業開発基金（IFAD）、 \"2011農村部の貧困報告書\"、ISBN 978-92-9072-200-7、2011。"
    },
    {
      "indent": 3,
      "text": "[InternetStats] Internet World Stats, \"World Internet Users and 2015 Population Stats\", <http://www.internetworldstats.com/stats.htm>.",
      "ja": "[InternetStats]インターネットの世界統計、 \"世界のインターネットユーザーと2015年の人口統計\"、<http://www.internetworldstats.com/stats.htm>。"
    },
    {
      "indent": 3,
      "text": "[ITU2011] International Telecommunication Union, \"World Telecommunication/ICT Indicators Database - 2011\", <http://www.itu.int/en/ITU-D/Statistics/Pages/ publications/wtid.aspx>.",
      "ja": "[ITU2011]国際電気通信連合、 \"世界電気通信/ ICT指標データベース -  2011\"、<http://www.itu.int/en/ITU-D/Statistics/Pages/出版/ wtid.aspx>。"
    },
    {
      "indent": 3,
      "text": "[Johnson_a] Johnson, D. and K. Roux, \"Building Rural Wireless Networks: Lessons Learnt and Future Directions\", In Proceedings of the ACM workshop on Wireless networks and systems for developing regions, pp. 17-22, DOI 10.1145/1410064.1410068, 2008.",
      "ja": "[Johnson_a]ジョンソン、D.及びK.ルーは、「建物の農村ワイヤレスネットワーク：教訓と今後の方向性」の開発途上地域のためのワイヤレスネットワークとシステム上のACMワークショップの議事録には、頁17-22、DOI 10.1145 / 1410064.1410068。 2008年。"
    },
    {
      "indent": 3,
      "text": "[Johnson_b] Johnson, D., Pejovic, V., Belding, E., and G. van Stam, \"Traffic Characterization and Internet Usage in Rural Africa\", In Proceedings of the 20th International Conference Companion on World Wide Web, pp. 493-502, DOI 10.1145/1963192.1963363, 2011.",
      "ja": "[Johnson_b]ジョンソン、D.、Pejovic、V.、ベルディング、E.、およびG.バン・スタム、「アフリカ農村におけるトラフィック特性評価およびインターネット利用」、ワールド・ワイド・ウェブ、頁上の第20回国際会議コンパニオンの議事録。 493-502、DOI 10.1145 / 1963192.1963363、2011。"
    },
    {
      "indent": 3,
      "text": "[Lowenstedt] Huggler, J., \"German villagers set up their own broadband network\", June 2014, <http://www.telegraph.co.uk/news/worldnews/europe/ germany/10871150/ German-villagers-set-up-their-own-broadband-network.html>.",
      "ja": "[Lowenstedt] Huggler、J.、2014年6月、「ドイツの村人が自分のブロードバンドネットワークをセットアップする」、<http://www.telegraph.co.uk/news/worldnews/europe/ドイツ/ 10871150 /ドイツ村人セット-up-自分自身--ブロードバンド-network.html>。"
    },
    {
      "indent": 3,
      "text": "[Lysko] Lysko, A., Masonta, M., Mofolo, M., Mfupe, L., Montsi, L., Johnson, D., Mekuria, F., Ngwenya, D., Ntlatlapa, N., Hart, A., Harding, C., and A. Lee, \"First large TV white spaces trial in South Africa: A brief overview\", 6th International Congress on Ultra Modern Telecommunications and Control Systems and Workshops (ICUMT), pp. 407-414, DOI 10.1109/ICUMT.2014.7002136, October 2014.",
      "ja": "【Lysko] Lysko、A.、Masonta、M.、Mofolo、M.、Mfupe、L.、Montsi、L.、ジョンソン、D.、Mekuria、F.、Ngwenya、D.、Ntlatlapa、N.、ハート、 A.、ハーディング、C.、およびA.リー、「南アフリカで最初の大規模TVホワイトスペースの試用：簡単な概要」、超近代的な通信制御システム及びワークショップ（ICUMT）第6回国際会議、頁407-414。 、DOI 10.1109 / ICUMT.2014.7002136、2014年10月。"
    },
    {
      "indent": 3,
      "text": "[Mathee] Mathee, K., Mweemba, G., Pais, A., Stam, V., and M. Rijken, \"Bringing Internet connectivity to rural Zambia using a collaborative approach\", International Conference on Information and Communication Technologies and Development, pp. 1-12, DOI 10.1109/ICTD.2007.4937391, 2007.",
      "ja": "[Mathee] Mathee、K.、Mweemba、G.、パイス、A.、スタム、V.、およびM. Rijken、「協調的なアプローチを使用して、農村ザンビアへのインターネット接続をもたらす」、情報通信技術と開発に関する国際会議、頁1-12、DOI 10.1109 / ICTD.2007.4937391、2007。"
    },
    {
      "indent": 3,
      "text": "[McMahon] McMahon, R., Gurstein, M., Beaton, B., Donnell, S., and T. Whiteducke, \"Making Information Technologies Work at the End of the Road\", Journal of Information Policy, Vol. 4, pp. 250-269, DOI 10.5325/jinfopoli.4.2014.0250, 2014.",
      "ja": "[マクマホン]マクマホン、R.、Gurstein、M.、ビートン、B.、Donnell、S.、およびT. Whiteducke、 \"道の終わりに情報技術仕事を作る\"、情報政策誌、Vol。 4、頁250から269、DOI 10.5325 / jinfopoli.4.2014.0250、2014。"
    },
    {
      "indent": 3,
      "text": "[Meraki] Cisco Systems, \"Meraki\", 2016, <https://www.meraki.com/>.",
      "ja": "<：//ooo.meraki.kom/ ittps>アイビーシステム、 \"インスパイア\"、2016、[インスパイア]。"
    },
    {
      "indent": 3,
      "text": "[Mexican] Varma, S., \"Ignored by big companies, Mexican village creates its own mobile service\", August 2013, <http://timesofindia.indiatimes.com/world/rest-of-world/ Ignored-by-big-companies-Mexican-village-creates-its-own-mobile-service/articleshow/22094736.cms>.",
      "ja": "[メキシコ]ヴァルマ、S.、2013年8月「大企業では無視されますが、メキシコの村は独自のモバイルサービスを作成する」、<http://timesofindia.indiatimes.com/world/rest-of-world/無視バイビッグ-companies  - メキシコの村が作成されます - それ-自身のモバイルサービス/ articleshow / 22094736.cms>。"
    },
    {
      "indent": 3,
      "text": "[Mitchell] Mitchell, C., \"Broadband At the Speed of Light: How Three Communities Built Next-Generation Networks\", Institute for Local Self-Reliance (ILSR), April 2012, <http://ilsr.org/ wp-content/uploads/2012/04/muni-bb-speed-light.pdf>.",
      "ja": "[ミッチェル]ミッチェル、C.、「光の速度でブロードバンド：どのように三つのコミュニティ内蔵次世代ネットワーク」、ローカルセルフリライアンス（ILSR）研究所、2012年4月、<http://ilsr.org/ wp-コンテンツ/アップロード/ 2012/04 /ムニ-BB-速度light.pdf>。"
    },
    {
      "indent": 3,
      "text": "[Neumann_a] Neumann, A., Lopez, E., and L. Navarro, \"An evaluation of BMX6 for community wireless networks\", In IEEE 8th International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob), pp. 651-658, DOI 10.1109/WiMOB.2012.6379145, 2012.",
      "ja": "【Neumann_a]ノイマン、A.、ロペス、E.、およびワイヤレスでIEEE第8回国際会議、およびモバイルコンピューティング、ネットワーキングおよび通信のL.ナバロ、「コミュニティ無線ネットワークのためBMX6の評価」、（WiMob）、頁651 -658、DOI 10.1109 / WiMOB.2012.6379145、2012。"
    },
    {
      "indent": 3,
      "text": "[Neumann_b] Neumann, A., Lopez, E., and L. Navarro, \"Evaluation of mesh routing protocols for wireless community networks\", Computer Networks, Vol. 93, Part 2, pp. 308-323, December 2015, <http://dx.doi.org/10.1016/j.comnet.2015.07.018>.",
      "ja": "[Neumann_b]ノイマン、A.、ロペス、E.、およびL.ナバロ、「ワイヤレスコミュニティネットワークのためのメッシュルーティングプロトコルの評価」、コンピュータネットワーク、巻。 93、パート2、頁308から323まで、2015年12月、<http://dx.doi.org/10.1016/j.comnet.2015.07.018>。"
    },
    {
      "indent": 3,
      "text": "[NewMexico] New Mexico Department of Information Technology, \"Broadband Guide for Electric Utilities\", CTC Technology & Energy, Version 1, April 2015, <http://www.doit.state.nm.us/broadband/reports/ NMBBP_FiberGuide_ElectricUtilities.pdf>.",
      "ja": "情報技術の[ニューメキシコ州]ニューメキシコ州省、「電気事業用ブロードバンド・ガイド」、CTCテクノロジー・エネルギー、バージョン1、2015年4月、<http://www.doit.state.nm.us/broadband/reports/ NMBBP_FiberGuide_ElectricUtilities。 PDF>。"
    },
    {
      "indent": 3,
      "text": "[Norris] Norris, P., \"Digital Divide: Civic Engagement, Information Poverty, and the Internet Worldwide\", Cambridge University Press, ISBN 0521807514, 2001.",
      "ja": "[ノリス]ノリス、P.、「デジタルデバイド：市民参加、情報貧困、そしてインターネットの世界」、ケンブリッジ大学出版、ISBN 0521807514、2001。"
    },
    {
      "indent": 3,
      "text": "[Nungu] Nungu, A., Knutsson, B., and B. Pehrson, \"On Building Sustainable Broadband Networks in Rural Areas\", Technical Symposium at ITU Telecom World, pp. 135-140, October 2011.",
      "ja": "[Nungu] Nungu、A.、Knutsson、B.、およびB. Pehrson、 \"農村地域で持続可能なブロードバンドネットワークの構築について\"、ITUテレコムワールド、頁のテクニカルシンポジウム。135〜140、2011年10月。"
    },
    {
      "indent": 3,
      "text": "[NYTimes] Gall, C. and J. Glanz, \"U.S. Promotes Network to Foil Digital Spying\", The New York Times, April 2014, <http://www.nytimes.com/2014/04/21/us/ us-promotes-network-to-foil-digital-spying.html?_r=1>.",
      "ja": "[NYTimesの]ガル、C.とJ.グランツは、「米国は箔デジタルスパイへのネットワークを促進する」、ニューヨーク・タイムズ、2014年4月、<http://www.nytimes.com/2014/04/21/us/たちを-promotesネットワーク・ツー・ホイルデジタルspying.html？_r = 1>。"
    },
    {
      "indent": 3,
      "text": "[OLSR] OLSR.org, \"OLSR\", 2016, <http://www.olsr.org/>.",
      "ja": "[OLSR] OLSR.org、 \"OLSR\"、2016年、<http://www.olsr.org/>。"
    },
    {
      "indent": 3,
      "text": "[Openair] OpenAirInterface, \"OpenAirInterface: 5G software alliance for democratising wireless innovation\", 2016, <http://www.openairinterface.org/>.",
      "ja": "[オープンエアー] OpenAirInterface、 \"OpenAirInterface：無線技術革新を民主化するため5Gソフトウェアアライアンス\"、2016年、<http://www.openairinterface.org/>。"
    },
    {
      "indent": 3,
      "text": "[OpenMesh] Open Mesh, \"Open Mesh\", 2016, <http://www.open-mesh.com/>.",
      "ja": "【OpenMesh]オープンメッシュ、 \"オープンメッシュ\"、2016年、<http://www.open-mesh.com/>。"
    },
    {
      "indent": 3,
      "text": "[Osmocom] Open Source Mobile Communications (Osmocom), \"Cellular Infrastructure\", GPRS bitrates, 2016, <https://osmocom.org/projects/osmopcu/wiki/GPRS_bitrates>.",
      "ja": "【Osmocom】オープンソースモバイルコミュニケーションズ（Osmocom）、 \"セルラーインフラストラクチャ\"、GPRSビットレート2016、<https://osmocom.org/projects/osmopcu/wiki/GPRS_bitrates>。"
    },
    {
      "indent": 3,
      "text": "[PAWS] Sathiaseelan, A., Crowcroft, J., Goulden, M., Greiffenhagen, C., Mortier, R., Fairhurst, G., and D. McAuley, \"Public Access WiFi Service (PAWS)\", Digital Economy All Hands Meeting, University of Aberdeen, October 2012.",
      "ja": "[PAWS] Sathiaseelan、A.、クロウクロフト、J.、Goulden、M.、Greiffenhagen、C.、モルティエ、R.、Fairhurst、G.、およびD. McAuley氏、 \"パブリックアクセス無線LANサービス（PAWS）\"、デジタル・エコノミーすべてのハンズミーティング、アバディーン、2012年10月の大学。"
    },
    {
      "indent": 3,
      "text": "[PIE] Pan, R., Natarajan, P., Baker, F., and G. White, \"PIE: A Lightweight Control Scheme To Address the Bufferbloat Problem\", Work in Progress, draft-ietf-aqm-pie-09, August 2016.",
      "ja": "[PIE]パン、R.、Natarajan、P.、ベイカー、F.、およびG.ホワイト、 \"PIE：Bufferbloat問題に対処するために軽量制御方式\" が進行中で働いて、ドラフト-IETF-AQM-パイ-09 、2016年8月。"
    },
    {
      "indent": 3,
      "text": "[Pietrosemoli] Pietrosemoli, E., Zennaro, M., and C. Fonda, \"Low cost carrier independent telecommunications infrastructure\", Global Information Infrastructure and Networking Symposium, pp. 1-4, DOI 10.1109/GIIS.2012.6466655, December 2012.",
      "ja": "[Pietrosemoli] Pietrosemoli、E.、Zennaro、M.、およびC.フォンダ、 \"格安航空会社の独立した通信インフラ\"、世界情報基盤とネットワークシンポジウム、頁1-4、DOI 10.1109 / GIIS.2012.6466655、2012年12月。"
    },
    {
      "indent": 3,
      "text": "[Rangenetworks] Range Networks, \"Range Networks\", 2016, <http://www.rangenetworks.com>.",
      "ja": "[Rangenetworks]範囲ネットワークス、 \"レンジ・ネットワーク\"、2016、<http://www.rangenetworks.com>。"
    },
    {
      "indent": 3,
      "text": "[Redhook] Red Hook WIFI, \"Red Hook WIFI, a project of the Red Hook Initiative\", 2016, <http://redhookwifi.org/>.",
      "ja": "[レッドフック]レッドフックのWIFI、 \"レッドフックのWIFI、レッドフックのイニシアティブのプロジェクト\"、2016年、<http://redhookwifi.org/>。"
    },
    {
      "indent": 3,
      "text": "[Rey] Rey-Moreno, C., Bebea-Gonzalez, I., Foche-Perez, I., Quispe-Taca, R., Linan-Benitez, L., and J. Simo-Reigadas, \"A telemedicine WiFi network optimized for long distances in the Amazonian jungle of Peru\", Proceedings of the 3rd Extreme Conference on Communication: The Amazon Expedition, Article No. 9, DOI 10.1145/2414393.2414402, 2011.",
      "ja": "【レイ】レイ・モレノ、C.、Bebea  - ゴンザレス、I.、地下鉄Foche  - ペレス、I.、QUISPE-TACA、R.、Linan-ベニテス、L.、及びJ. SIMO-Reigadas、「遠隔医療WiFiネットワーク「ペルーのアマゾンのジャングルの中長距離用に最適化された、コミュニケーション上の第三エクストリーム会議議事録：アマゾン探検隊条第9号/ 2414393.2414402、2011 DOI 10.1145。"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, B., Karrenberg, D., de Groot, G., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, DOI 10.17487/RFC1918, February 1996, <http://www.rfc-editor.org/info/rfc1918>.",
      "ja": "[RFC1918] Rekhter、Y.、モスコウィッツ、B.、Karrenberg、D.、デ・グルート、G.、およびE.リア、 \"個人的なインターネットのための配分\"、BCP 5、RFC 1918、DOI 10.17487 / RFC1918、1996年2月に、<http://www.rfc-editor.org/info/rfc1918>。"
    },
    {
      "indent": 3,
      "text": "[RFC2328] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, DOI 10.17487/RFC2328, April 1998, <http://www.rfc-editor.org/info/rfc2328>.",
      "ja": "[RFC2328]モイ、J.、 \"OSPFバージョン2\"、STD 54、RFC 2328、DOI 10.17487 / RFC2328、1998年4月、<http://www.rfc-editor.org/info/rfc2328>。"
    },
    {
      "indent": 3,
      "text": "[RFC3168] Ramakrishnan, K., Floyd, S., and D. Black, \"The Addition of Explicit Congestion Notification (ECN) to IP\", RFC 3168, DOI 10.17487/RFC3168, September 2001, <http://www.rfc-editor.org/info/rfc3168>.",
      "ja": "\"IPへの明示的輻輳通知の追加（ECN）\" [RFC3168]ラマクリシュナン、K.、フロイド、S.、およびD.ブラック、RFC 3168、DOI 10.17487 / RFC3168、2001年9月、<のhttp：// WWW。 rfc-editor.org/info/rfc3168>。"
    },
    {
      "indent": 3,
      "text": "[RFC3626] Clausen, T., Ed. and P. Jacquet, Ed., \"Optimized Link State Routing Protocol (OLSR)\", RFC 3626, DOI 10.17487/RFC3626, October 2003, <http://www.rfc-editor.org/info/rfc3626>.",
      "ja": "[RFC3626] Clausenの、T.、エド。そして、P.ジャケ、エド。、 \"最適化されたリンクステートルーティングプロトコル（OLSR）\"、RFC 3626、DOI 10.17487 / RFC3626、2003年10月、<http://www.rfc-editor.org/info/rfc3626>。"
    },
    {
      "indent": 3,
      "text": "[RFC4271] Rekhter, Y., Ed., Li, T., Ed., and S. Hares, Ed., \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, DOI 10.17487/RFC4271, January 2006, <http://www.rfc-editor.org/info/rfc4271>.",
      "ja": "[RFC4271] Rekhter、Y.、エド。、李、T.、エド。、およびS.野兎、編、 \"ボーダーゲートウェイプロトコル4（BGP-4）\"、RFC 4271、DOI 10.17487 / RFC4271、2006年1月、<http://www.rfc-editor.org/info/rfc4271>。"
    },
    {
      "indent": 3,
      "text": "[RFC6126] Chroboczek, J., \"The Babel Routing Protocol\", RFC 6126, DOI 10.17487/RFC6126, April 2011, <http://www.rfc-editor.org/info/rfc6126>.",
      "ja": "[RFC6126] Chroboczek、J.、 \"バベルルーティングプロトコル\"、RFC 6126、DOI 10.17487 / RFC6126、2011年4月、<http://www.rfc-editor.org/info/rfc6126>。"
    },
    {
      "indent": 3,
      "text": "[RFC6297] Welzl, M. and D. Ros, \"A Survey of Lower-than-Best-Effort Transport Protocols\", RFC 6297, DOI 10.17487/RFC6297, June 2011, <http://www.rfc-editor.org/info/rfc6297>.",
      "ja": "[RFC6297] Welzl、M.とD.ロス、 \"低級より-ベストエフォートトランスポートプロトコルの調査\"、RFC 6297、DOI 10.17487は/ RFC6297、2011年6月、<http://www.rfc-editor.org /情報/ rfc6297>。"
    },
    {
      "indent": 3,
      "text": "[RFC7181] Clausen, T., Dearlove, C., Jacquet, P., and U. Herberg, \"The Optimized Link State Routing Protocol Version 2\", RFC 7181, DOI 10.17487/RFC7181, April 2014, <http://www.rfc-editor.org/info/rfc7181>.",
      "ja": "[RFC7181]クラウゼン、T.、Dearlove、C.、ジャケ、P.、およびU. Herberg、 \"最適化されたリンクステートルーティングプロトコルバージョン2\"、RFC 7181、DOI 10.17487 / RFC7181、2014年4月、<のhttp：// www.rfc-editor.org/info/rfc7181>。"
    },
    {
      "indent": 3,
      "text": "[RFC7567] Baker, F., Ed. and G. Fairhurst, Ed., \"IETF Recommendations Regarding Active Queue Management\", BCP 197, RFC 7567, DOI 10.17487/RFC7567, July 2015, <http://www.rfc-editor.org/info/rfc7567>.",
      "ja": "[RFC7567]ベーカー、F.、エド。そして、G. Fairhurst、エド。、 \"アクティブキュー管理に関するIETF勧告\"、BCP 197、RFC 7567、DOI 10.17487 / RFC7567、2015年7月、<http://www.rfc-editor.org/info/rfc7567>。"
    },
    {
      "indent": 3,
      "text": "[Samanta] Samanta, V., Knowles, C., Wagmister, J., and D. Estrin, \"Metropolitan Wi-Fi Research Network at the Los Angeles State Historic Park\", The Journal of Community Informatics, Vol. 4, No. 1, May 2008, <http://ci-journal.net/index.php/ciej/article/ viewArticle/427>.",
      "ja": "[Samanta] Samanta、V.、ノウルズ、C.、Wagmister、J.、およびD. Estrin、 \"ロサンゼルス州立歴史公園でのメトロポリタンのWi-Fi研究ネットワーク\"、コミュニティ情報誌、Vol。図4に示すように、第1号、2008年05月、<http://ci-journal.net/index.php/ciej/article/ viewArticle / 427>。"
    },
    {
      "indent": 3,
      "text": "[Sathiaseelan_a] Sathiaseelan, A., Rotsos, C., Sriram, C., Trossen, D., Papadimitriou, P., and J. Crowcroft, \"Virtual Public Networks\", In IEEE 2013 Second European Workshop on Software Defined Networks (EWSDN) pp. 1-6, DOI 10.1109/EWSDN.2013.7, October 2013.",
      "ja": "[Sathiaseelan_a] Sathiaseelan、A.、IEEE 2013第二に、欧州ワークショップでRotsos、C.、スリラム、C.、Trossen、D.、Papadimitriou、P.、およびJ.クロウクロフト、 \"仮想パブリックネットワーク\"、ソフトウェア定義されたネットワーク上の（ EWSDN）頁1-6、DOI 10.1109 / EWSDN.2013.7、2013年10月。"
    },
    {
      "indent": 3,
      "text": "[Sathiaseelan_b] Sathiaseelan, A. and J. Crowcroft, \"LCD-Net: Lowest Cost Denominator Networking\", ACM SIGCOMM Computer Communication Review, Vol. 43, No. 2, April 2013, <http://dx.doi.org/10.1145/2479957.2479966>.",
      "ja": "[Sathiaseelan_b] Sathiaseelan、A.、およびJ.クロウクロフト、 \"LCD-ネット：低コスト分母ネットワーキング\"、ACM SIGCOMMコンピュータコミュニケーションレビュー、巻。 43、第2号、2013年4月、<http://dx.doi.org/10.1145/2479957.2479966>。"
    },
    {
      "indent": 3,
      "text": "[Sathiaseelan_c] Sathiaseelan, A., Mortier, R., Goulden, M., Greiffenhagen, C., Radenkovic, M., Crowcroft, J., and D. McAuley, \"A Feasibility Study of an In-the-Wild Experimental Public Access WiFi Network\", Proceedings of the Fifth ACM Symposium on Computing for Development, pp. 33-42, DOI 10.1145/2674377.2674383, 2014.",
      "ja": "【Sathiaseelan_c] Sathiaseelan、A.、モルティエ、R.、Goulden、M.、Greiffenhagen、C.、Radenkovic、M.、クロウクロフト、J.、およびD. McAuley氏、「イン・ザ・ワイルド実験のフィージビリティスタディパブリックアクセスのWiFiネットワーク」、開発、PPのためのコンピューティング第五ACMシンポジウム。33-42、DOI 10.1145 / 2674377.2674383、2014。"
    },
    {
      "indent": 3,
      "text": "[SDG] United Nations, \"Sustainable Development Goals\", Sustainable Development Knowledge Platform, 2015, <https://sustainabledevelopment.un.org/?menu=1300>.",
      "ja": "[SDG]国連、 \"持続可能な開発目標\"、持続可能な開発に関する知識プラットフォーム、2015年、<https://sustainabledevelopment.un.org/?menu=1300>。"
    },
    {
      "indent": 3,
      "text": "[Seither] Seither, D., Koenig, A., and M. Hollick, \"Routing performance of Wireless Mesh Networks: A practical evaluation of BATMAN advanced\", IEEE 36th Conference on Local Computer Networks (LCN), pp. 897-904, DOI 10.1109/LCN.2011.6115569, October 2011.",
      "ja": "[Seither] Seither、D.、ケーニッヒ、A.、およびM. Hollick、 \"無線メッシュネットワークのパフォーマンスルーティング：BATMANの実用的な評価が進んだ\"、ローカルコンピュータネットワーク上のIEEE第36回会議（LCN）、頁897から904まで。 、DOI 10.1109 / LCN.2011.6115569、2011年10月。"
    },
    {
      "indent": 3,
      "text": "[Shi] Shi, J., Gui, L., Koutsonikolas, D., Qiao, C., and G. Challen, \"A Little Sharing Goes a Long Way: The Case for Reciprocal Wifi Sharing\", HotWireless '15 Proceedings of the 2nd International Workshop on Hot Topics in Wireless, DOI 10.1145/2799650.2799652, September 2015.",
      "ja": "【市】市、J.、GUI、L.、Koutsonikolas、D.、橋、C.、およびG.チャレンジVol、「リトル共有ロングウェイ行く：相互無線LAN共有のためのケース」のHotWireless '15手続第2回国際ワークショップワイヤレス、DOI 10.1145 / 2799650.2799652、2015年9月のホットな話題に。"
    },
    {
      "indent": 3,
      "text": "[Simo_a] Simo-Reigadas, J., Morgado, E., Municio, E., Prieto-Egido, I., and A. Martinez-Fernandez, \"Assessing IEEE 802.11 and IEEE 802.16 as backhaul technologies for rural 3G femtocells in rural areas of developing countries\", Proceedings of EUCNC, 2014.",
      "ja": "農村地域の農村の3Gフェムトセルのためのバックホール技術として、IEEE 802.11及びIEEE 802.16の評価[Simo_a] SIMO-Reigadas、J.、モルガド、E.、Municio、E.、プリエト - エヒド、I.、およびA.マルティネス・フェルナンデス、」途上国の領域」、EUCNC、2014年の議事。"
    },
    {
      "indent": 3,
      "text": "[Simo_b] Simo-Reigadas, J., Martinez-Fernandez, A., Ramos-Lopez, J., and J. Seoane-Pascual, \"Modeling and Optimizing IEEE 802.11 DCF for Long-Distance Links\", IEEE Transactions on Mobile Computing, Vol. 9, Issue 6, pp. 881-896, DOI 10.1109/TMC.2010.27, 2010.",
      "ja": "モバイルコンピューティング[Simo_b] SIMO-Reigadas、J.、マルティネス・フェルナンデス、A.、ラモス・ロペス、J.、およびJ. Seoane、パスカル、 \"モデリングおよび長距離リンクのために最適化IEEE 802.11 DCF\"、IEEEトランザクション巻。 9、問題6、頁881から896、DOI 10.1109 / TMC.2010.27 2010。"
    },
    {
      "indent": 3,
      "text": "[Simo_c] Simo-Reigadas, J., Martinez-Fernandez, A., Osuna, P., Lafuente, S., and J. Seoane-Pascual, \"The Design of a Wireless Solar-Powered Router for Rural Environments Isolated from Health Facilities\", IEEE Wireless Communications, Vol. 15, Issue 3, pp. 24-30, DOI 0.1109/MWC.2008.4547519, June 2008.",
      "ja": "【Simo_c] SIMO-Reigadas、J.、マルティネス・フェルナンデス、A.、オスナ、P.、Lafuente、S.、およびJ. Seoane、パスカル、「健康から分離された農村環境のワイヤレスソーラールータの設計施設」、IEEE無線通信、巻。 15、3号、頁24-30、DOI 0.1109 / MWC.2008.4547519、2008年6月。"
    },
    {
      "indent": 3,
      "text": "[Simo_d] Simo-Reigadas, J., Municio, E., Morgado, E., Castro, E., Martinez-Fernandez, A., Solorzano, L., and I. Prieto-Egido, \"Sharing low-cost wireless infrastructures with telecommunications operators to bring 3G services to rural communities\", Computer Networks, Vol. 93, Issue P2, pp. 245-259, December 2015, <http://dx.doi.org/10.1016/j.comnet.2015.09.006>.",
      "ja": "【Simo_d] SIMO-Reigadas、J.、Municio、E.、モルガド、E.、カストロ、E.、マルティネス・フェルナンデス、A.、Solorzano、L.、及びI.プリエト - エヒド、「低コストの無線共有農村地域に3Gサービスをもたらすために通信事業者」、コンピュータネットワーク、巻とインフラ。 93号P2、頁245から259まで、2015年12月、<http://dx.doi.org/10.1016/j.comnet.2015.09.006>。"
    },
    {
      "indent": 3,
      "text": "[Spectrum] Laursen, L., \"Software-Defined Radio Will Let Communities Build Their Own 4G Networks\", November 2015, <http://spectrum.ieee.org/telecom/wireless/ softwaredefined-radio-will-let-communities-build-their-own-4g-networks>.",
      "ja": "[スペクトラム]ラウルセン、L.は、2015年11月、<http://spectrum.ieee.org/telecom/wireless/ softwaredefined-無線-ようになる-コミュニティ、「ソフトウェア無線は、コミュニティが自分の4Gネットワ​​ークを構築できるようになります」 -build-自分自身--4グラム・ネットワーク>。"
    },
    {
      "indent": 3,
      "text": "[Sprague] Sprague, K., Grijpink, F., Manyika, J., Moodley, L., Chappuis, B., Pattabiraman, K., and J. Bughin, \"Offline and falling behind: Barriers to Internet adoption\", McKinsey and Company, August 2014.",
      "ja": "[スプラーグ】スプラーグ、K.、Grijpink、F.、Manyika、J.、Moodley、L.、Chappuis、B.、Pattabiraman、K.、およびJ. Bughin、 \"オフラインと後ろ下がり：インターネットの普及の障壁\"、マッキンゼーアンドカンパニー、2014年8月。"
    },
    {
      "indent": 3,
      "text": "[Tech] Kazansky, B., \"In Red Hook, Mesh Network Connects Sandy Survivors Still Without Power\", November 2012, <http://techpresident.com/news/23127/red-hook-mesh-network-connects-sandy-survivors-still-without-power>.",
      "ja": "[技術] Kazansky、B.、「レッドフックでは、メッシュネットワークは、電源なしまだサンディ生存者を接続」、2012年11月、<http://techpresident.com/news/23127/red-hook-mesh-network-connects-sandy -survivors-まだ電源なし>。"
    },
    {
      "indent": 3,
      "text": "[TidePools] Baldwin, J., \"TidePools: Social WiFi\", Parsons, the New School for Design, Doctoral dissertation, Master thesis, 2011, <http://www.scribd.com/doc/94601219/ TidePools-Social-WiFi-Thesis>.",
      "ja": "[TidePools]ボールドウィン、J.、 \"TidePools：社会のWiFi\"、パーソンズデザインのための新しい学校、博士論文、修士論文、2011、<http://www.scribd.com/doc/94601219/ TidePools-Social-無線LAN-論文>。"
    },
    {
      "indent": 3,
      "text": "[UN] United Nations Statistics Division (UNSD), \"Composition of macro geographical (continental) regions, geographical sub-regions, and selected economic and other groupings\", October 2013, <http://unstats.un.org/unsd/methods/m49/ m49regin.htm#ftnc>.",
      "ja": "[UN]国連統計部（UNSD）、「マクロ地理的（大陸）地域、地理的なサブ領域、および選択された経済や他のグループの構成」、2013年10月、<http://unstats.un.org/unsd/方法/ M49 / m49regin.htm＃ftnc>。"
    },
    {
      "indent": 3,
      "text": "[UNStats] United Nations Statistics Division (UNSD), \"Urban and total population by sex: 1996-2005\", Table 6 - Demographic Yearbook 2005, <http://unstats.un.org/unsd/demographic/products/dyb/ dyb2005/notestab06.pdf>.",
      "ja": "[UNStats]国連統計部（UNSD）、 \"性別による都市と総人口：1996年から2005年\"、表6  - 人口統計学年鑑2005、<http://unstats.un.org/unsd/demographic/products/dyb/ dyb2005 / notestab06.pdf>。"
    },
    {
      "indent": 3,
      "text": "[Vega_a] Vega, D., Cerda-Alabern, L., Navarro, L., and R. Meseguer, \"Topology patterns of a community network: Guifi.net\", IEEE 8th International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob), pp. 612-619, DOI 10.1109/WiMOB.2012.6379139, October 2012.",
      "ja": "[Vega_a]ベガ、D.、Cerdaの-Alabern、L.、ナバロ、L.、およびR. Meseguer、 \"コミュニティネットワークのトポロジーパターン：Guifi.net\"、ワイヤレスのIEEE第8回国際会議やモバイルコンピューティング、ネットワーキングおよびコミュニケーションズ（WiMob）、頁612から619、DOI 10.1109 / WiMOB.2012.6379139、2012年10月。"
    },
    {
      "indent": 3,
      "text": "[Vega_b] Vega, D., Baig, R., Cerda-Alabern, L., Medina, E., Meseguer, R., and L. Navarro, \"A technological overview of the guifi.net community network\", Computer Networks, Vol. 93, Issue P2, pp. 260-278, December 2015, <http://dx.doi.org/10.1016/j.comnet.2015.09.023>.",
      "ja": "[Vega_b]ベガ、D.、Baig、R.、Cerdaの-Alabern、L.、メディナ、E.、Meseguer、R.、およびL.ナバロ、 \"guifi.netのコミュニティネットワークの技術的概要\"、コンピュータネットワーク巻。 93号P2、頁260から278まで、2015年12月、<http://dx.doi.org/10.1016/j.comnet.2015.09.023>。"
    },
    {
      "indent": 3,
      "text": "[Village] Heimerl, K. and E. Brewer, \"The Village Base Station\", Proceedings of the 4th ACM Workshop on Networked Systems for Developing Regions, Article No. 14, DOI 10.1145/1836001.1836015, 2010.",
      "ja": "発展途上地域のために[村] Heimerl、K.およびE. Brewerの、 \"村ベースステーション\"、ネットワーク上のシステムに第4回ACMワークショップの議事録、商品番号14、DOI 10.1145 / 1836001.1836015 2010。"
    },
    {
      "indent": 3,
      "text": "[WiLD] Patra, R., Nedevschi, S., Surana, S., Sheth, A., Subramanian, L., and E. Brewer, \"WiLDNet: Design and Implementation of High Performance WiFi Based Long Distance Networks\", NSDI, Vol. 1, No. 1, pp. 1, April 2007.",
      "ja": "[WILD]パトラ、R.、Nedevschi、S.、Surana、S.、Sheth、A.、サブラマニアン、L.、およびE.ブリューワー、：、NSDI \"WiLDNet高性能無線LANベースの長距離ネットワークの設計と実装\"巻。 1、第1号、頁1、2007年4月。"
    },
    {
      "indent": 3,
      "text": "[WNDW] WNDW, \"Wireless Networking in the Developing World, 3rd Edition\", The WNDW Project, 2013, <http://wndw.net>.",
      "ja": "[WNDW] WNDW、 \"発展途上国でワイヤレスネットワーク、第3版\"、WNDWプロジェクト、2013年、<http://wndw.net>。"
    },
    {
      "indent": 3,
      "text": "[WorldBank2016] World Bank, \"World Development Report 2016: Digital Dividends\", Washington, DC: The World Bank, ISBN 978-1-4648-0672-8, DOI 10.1596/978-1-4648-0671-1, 2016, <http://www-wds.worldbank.org/external/default/WDSContentS erver/WDSP/IB/2016/01/13/090224b08405ea05/2_0/Rendered/ PDF/World0developm0000digital0dividends.pdf>.",
      "ja": "[WorldBank2016]世界銀行、 \"世界開発報告2016：デジタル配当\"、ワシントンD.C.：世界銀行、ISBN 978-1-4648-0672-8、DOI 10.1596 / 978-1-4648-0671-1、2016、 <http://www-wds.worldbank.org/external/default/WDSContentS ERVER / WDSP / IB / 2016/01/13 / 090224b08405ea05 / 2_0 /レンダリング/ PDF / World0developm0000digital0dividends.pdf>。"
    },
    {
      "indent": 3,
      "text": "[WSIS] International Telecommunications Union, \"Declaration of Principles. Building the Information Society: A global challenge in the new millennium\", WSIS-03 / GENEVA / DOC / 4-E, December 2003, <http://www.itu.int/wsis>.",
      "ja": "[WSIS]国際電気通信連合、 \"原則の宣言情報社会の構築：新世紀のグローバルチャレンジ\"、WSIS-03 / GENEVA / DOC / 4-E、2003年12月、<のhttp：//www.itu。 int型/ WSIS>。"
    },
    {
      "indent": 3,
      "text": "[YateBTS] YateBTS, \"YateBTS\", 2016, <http://yatebts.com/>.",
      "ja": "[YateBTS] YateBTS、 \"YateBTS\"、2016年、<http://yatebts.com/>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "This work has been partially funded by the CONFINE European Commission project (FP7 - 288535). Arjuna Sathiaseelan and Andres Arcia Moret were funded by the EU H2020 RIFE project (Grant Agreement no: 644663). Jose Saldana was funded by the EU H2020 Wi-5 project (Grant Agreement no: 644262).",
      "ja": "この作品は、部分的にCONFINE欧州委員会のプロジェクト（ -  288535 FP7）によって資金を供給されています。アルジュナSathiaseelanとアンドレスArciaモレはEU H2020 RIFEプロジェクト（：644663グラント契約なし）によって賄われました。 （：644262グラント契約なし）ホセ・サルダナはEU H2020のWi-5プロジェクトによって資金を供給されました。"
    },
    {
      "indent": 3,
      "text": "The editor and the authors of this document wish to thank the following individuals who have participated in the drafting, review, and discussion of this memo: Panayotis Antoniadis, Paul M. Aoki, Roger Baig, Jaume Barcelo, Steven G. Huter, Aldebaro Klautau, Rohan Mahy, Vesna Manojlovic, Mitar Milutinovic, Henning Schulzrinne, Rute Sofia, and Dirk Trossen.",
      "ja": "Panayotis Antoniadis、ポール・M.青木、ロジャーBaig、ジャウメバルセロ、スティーブンG. Huter、Aldebaro Klautau：エディタと本書の著者は、次の起草、審査に参加した個人、およびこのメモの議論に感謝したいです、ロハンマーイ、ヴェスナManojlovic、Mitar Milutinovic、ヘニングSchulzrinneと、ルーテソフィア、そしてダークTrossen。"
    },
    {
      "indent": 3,
      "text": "A special thanks to the GAIA Working Group chairs Mat Ford and Arjuna Sathiaseelan for their support and guidance.",
      "ja": "彼らの支援と指導のためのGAIAワーキンググループチェアマットフォードとアルジュナSathiaseelanに感謝します。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "Leandro Navarro U. Politecnica Catalunya Jordi Girona, 1-3, D6 Barcelona 08034 Spain",
      "ja": "レアンドロ・ナバロU.工科カタルーニャジョルディジローナ、1-3、08034バルセロナスペインD6"
    },
    {
      "indent": 3,
      "text": "Phone: +34 93 401 6807 Email: leandro@ac.upc.edu",
      "ja": "電話：+34 93 401 6807 Eメール：leandro@ac.upc.edu"
    },
    {
      "indent": 3,
      "text": "Carlos Rey-Moreno University of the Western Cape Robert Sobukwe road Bellville 7535 South Africa",
      "ja": "西ケープ州ロバート・ソブクウェ道路のカルロス・レイ・モレノ大学ベルヴィル7535南アフリカ"
    },
    {
      "indent": 3,
      "text": "Phone: +27 (0)21 959 2562 Email: crey-moreno@uwc.ac.za",
      "ja": "電話：+27（0）21 959 2562 Eメール：crey-moreno@uwc.ac.za"
    },
    {
      "indent": 3,
      "text": "Ioannis Komnios Democritus University of Thrace Department of Electrical and Computer Engineering Kimmeria University Campus Xanthi 67100 Greece",
      "ja": "電気のトラキア専攻コンピュータ工学Kimmeria大学キャンパスクサンティ67100ギリシャのイオアニスKomniosデモクリトス大学"
    },
    {
      "indent": 3,
      "text": "Phone: +306945406585 Email: ikomnios@ee.duth.gr",
      "ja": "電話番号：+306945406585 Eメール：ikomnios@ee.duth.gr"
    },
    {
      "indent": 3,
      "text": "Steve Song Network Startup Resource Center Lunenburg, Nova Scotia Canada",
      "ja": "スティーブ・ソングネットワーク起動リソースセンタールーネンバーグ、ノバスコシア州カナダ"
    },
    {
      "indent": 3,
      "text": "Phone: +1 902 529 0046 Email: stevesong@nsrc.org",
      "ja": "電話：+1 902 529 0046 Eメール：stevesong@nsrc.org"
    },
    {
      "indent": 3,
      "text": "David Lloyd Johnson Meraka, CSIR 15 Lower Hope St Rosebank 7700 South Africa",
      "ja": "デビッド・ロイド・ジョンソンMeraka、CSIR 15下段希望セントローズバンク7700南アフリカ"
    },
    {
      "indent": 3,
      "text": "Phone: +27 (0)21 658 2740 Email: djohnson@csir.co.za",
      "ja": "電話：+27（0）21 658 2740 Eメール：djohnson@csir.co.za"
    },
    {
      "indent": 3,
      "text": "Javier Simo-Reigadas Escuela Tecnica Superior de Ingenieria de Telecomunicacion Campus de Fuenlabrada Universidad Rey Juan Carlos Madrid Spain",
      "ja": "フエンラブラダレイファンカルロス大学、マドリード、スペインの通信エンジニアリングキャンパスのハビエルSIMO-Reigadas学校"
    },
    {
      "indent": 3,
      "text": "Phone: +34 91 488 8428 Fax: +34 91 488 7500 Email: javier.simo@urjc.es",
      "ja": "電話：+34 91 488 8428ファックス：+34 91 488 7500 Eメール：javier.simo@urjc.es"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jose Saldana (editor) University of Zaragoza Dpt. IEC Ada Byron Building Zaragoza 50018 Spain",
      "ja": "サラゴサのDptのホセ・サルダナ（編集者）大学。エイダバイロンビルIEC 50018サラゴサスペイン"
    },
    {
      "indent": 3,
      "text": "Phone: +34 976 762 698 Email: jsaldana@unizar.es",
      "ja": "電話：+34 976 762 698 Eメール：jsaldana@unizar.es"
    },
    {
      "indent": 3,
      "text": "Andres Arcia-Moret University of Cambridge 15 JJ Thomson Avenue Cambridge FE04 United Kingdom",
      "ja": "ケンブリッジのアンドレスArcia-モレ大学15 JJトムソンアベニューケンブリッジFE04イギリス"
    },
    {
      "indent": 3,
      "text": "Phone: +44 (0) 1223 763610 Email: andres.arcia@cl.cam.ac.uk",
      "ja": "電話：+44（0）1223 763610 Eメール：andres.arcia@cl.cam.ac.uk"
    },
    {
      "indent": 3,
      "text": "Bart Braem iMinds Gaston Crommenlaan 8 (bus 102) Gent 9050 Belgium",
      "ja": "BART Braem iMindsガストンCrommenlaan 8（バス102）ゲント9050ベルギー"
    },
    {
      "indent": 3,
      "text": "Phone: +32 3 265 38 64 Email: bart.braem@iminds.be",
      "ja": "電話：+32 3 265 38 64 Eメール：bart.braem@iminds.be"
    },
    {
      "indent": 3,
      "text": "Ermanno Pietrosemoli The Abdus Salam ICTP Via Beirut 7 Trieste 34151 Italy",
      "ja": "エルマンノ・Pietrosemoliザ・アブドゥッサラームICTP経由ベイルート7 34151トリエステイタリア"
    },
    {
      "indent": 3,
      "text": "Phone: +39 040 2240 471 Email: ermanno@ictp.it",
      "ja": "電話：+39 040 2240 471 Eメール：ermanno@ictp.it"
    },
    {
      "indent": 3,
      "text": "Arjuna Sathiaseelan University of Cambridge 15 JJ Thomson Avenue Cambridge CB30FD United Kingdom",
      "ja": "ケンブリッジのアルジュナSathiaseelan大学15 JJトムソンアベニューケンブリッジCB30FDイギリス"
    },
    {
      "indent": 3,
      "text": "Phone: +44 (0)1223 763781 Email: arjuna.sathiaseelan@cl.cam.ac.uk",
      "ja": "電話：+44（0）1223 763781 Eメール：arjuna.sathiaseelan@cl.cam.ac.uk"
    },
    {
      "indent": 3,
      "text": "Marco Zennaro The Abdus Salam ICTP Strada Costiera 11 Trieste 34100 Italy",
      "ja": "マルコZennaroザ・アブドゥッサラームICTPストラーダコスティエラ11 34100トリエステイタリア"
    },
    {
      "indent": 3,
      "text": "Phone: +39 040 2240 406 Email: mzennaro@ictp.it",
      "ja": "電話：+39 040 2240 406 Eメール：mzennaro@ictp.it"
    }
  ]
}