{
  "title": {
    "text": "RFC 7680 - A One-Way Loss Metric for IP Performance Metrics (IPPM)",
    "ja": "RFC 7680 - IPパフォーマンス・メトリックのためのワンウェイ損失メトリック（IPPM）"
  },
  "number": 7680,
  "created_at": "2019-11-01 03:14:27.652399+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          G. Almes\nRequest for Comments: 7680                                     Texas A&M\nSTD: 82                                                     S. Kalidindi\nObsoletes: 2680                                                     Ixia\nCategory: Standards Track                                   M. Zekauskas\nISSN: 2070-1721                                                Internet2\n                                                          A. Morton, Ed.\n                                                               AT&T Labs\n                                                            January 2016",
      "raw": true
    },
    {
      "indent": 8,
      "text": "A One-Way Loss Metric for IP Performance Metrics (IPPM)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines a metric for one-way loss of packets across Internet paths. It builds on notions introduced and discussed in the IP Performance Metrics (IPPM) Framework document, RFC 2330; the reader is assumed to be familiar with that document. This memo makes RFC 2680 obsolete.",
      "ja": "このメモは、インターネットパス間でパケットの一方向の損失のためにメトリックを定義します。これは、IPパフォーマンス・メトリック（IPPM）の枠組み文書に導入され、議論の概念、RFC 2330に基づいています。読者は、その文書に精通しているものとします。このメモはRFC 2680が廃止されます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7680.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7680で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   4\n  1.1.  Motivation  . . . . . . . . . . . . . . . . . . . . . . .   5\n  1.2.  General Issues regarding Time . . . . . . . . . . . . . .   6\n2.  A Singleton Definition for One-Way Packet Loss  . . . . . . .   7\n  2.1.  Metric Name . . . . . . . . . . . . . . . . . . . . . . .   7\n  2.2.  Metric Parameters . . . . . . . . . . . . . . . . . . . .   7\n  2.3.  Metric Units  . . . . . . . . . . . . . . . . . . . . . .   7\n  2.4.  Definition  . . . . . . . . . . . . . . . . . . . . . . .   7\n  2.5.  Discussion  . . . . . . . . . . . . . . . . . . . . . . .   8\n  2.6.  Methodologies . . . . . . . . . . . . . . . . . . . . . .   9\n  2.7.  Errors and Uncertainties  . . . . . . . . . . . . . . . .  10\n  2.8.  Reporting the Metric  . . . . . . . . . . . . . . . . . .  11\n    2.8.1.  Type-P  . . . . . . . . . . . . . . . . . . . . . . .  11\n    2.8.2.  Loss Threshold  . . . . . . . . . . . . . . . . . . .  11\n    2.8.3.  Calibration Results . . . . . . . . . . . . . . . . .  11\n    2.8.4.  Path  . . . . . . . . . . . . . . . . . . . . . . . .  12\n3.  A Definition for Samples of One-Way Packet Loss . . . . . . .  12\n  3.1.  Metric Name . . . . . . . . . . . . . . . . . . . . . . .  12\n  3.2.  Metric Parameters . . . . . . . . . . . . . . . . . . . .  13\n  3.3.  Metric Units  . . . . . . . . . . . . . . . . . . . . . .  13\n  3.4.  Definition  . . . . . . . . . . . . . . . . . . . . . . .  13\n  3.5.  Discussion  . . . . . . . . . . . . . . . . . . . . . . .  13\n  3.6.  Methodologies . . . . . . . . . . . . . . . . . . . . . .  14\n  3.7.  Errors and Uncertainties  . . . . . . . . . . . . . . . .  15\n  3.8.  Reporting the Metric  . . . . . . . . . . . . . . . . . .  15\n4.  Some Statistics Definitions for One-Way Packet Loss . . . . .  15\n  4.1.  Type-P-One-way-Packet-Loss-Ratio  . . . . . . . . . . . .  15\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .  16\n6.  Changes from RFC 2680 . . . . . . . . . . . . . . . . . . . .  17\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  19\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .  19\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .  20\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  21\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  22",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This memo defines a metric for one-way packet loss across Internet paths. It builds on notions introduced and discussed in the IPPM Framework document, [RFC2330]; the reader is assumed to be familiar with that document and its recent update [RFC7312].",
      "ja": "このメモはインターネットパス間で一方向のパケット損失のためのメトリックを定義します。それは、[RFC2330]、IPPMフレームワーク文書で導入され、論じ概念に基づいています。読者はその文書とその最近の更新[RFC7312]に精通しているものとします。"
    },
    {
      "indent": 3,
      "text": "This memo is intended to be parallel in structure to a companion document for One-way Delay (\"A One-Way Delay Metric for IP Performance Metrics (IPPM)\") [RFC7679]; the reader is assumed to be familiar with that document.",
      "ja": "このメモは、一方向遅延（「IPパフォーマンス・メトリック（IPPM）のためのワンウェイ遅延メトリック」）[RFC7679]のための仲間ドキュメントの構造で、平行であることを意図しています。読者は、その文書に精通しているものとします。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119]. Although [RFC2119] was written with protocols in mind, the key words are used in this document for similar reasons. They are used to ensure the results of measurements from two different implementations are comparable and to note instances when an implementation could perturb the network.",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。 [RFC2119]は念頭にプロトコルで書かれていたが、キーワードは、同様の理由でこの文書で使用されています。これらは同等であり、実装がネットワークを乱すことができるときのインスタンスを注意するために、2つの異なる実装からの測定の結果を確実にするために使用されます。"
    },
    {
      "indent": 3,
      "text": "Whenever a technical term from the IPPM Framework document is first used in this memo, it will be tagged with a trailing asterisk. For example, \"term*\" indicates that \"term\" is defined in the Framework document.",
      "ja": "IPPMフレームワークの文書から専門用語が最初にこのメモで使用されるたびに、末尾にアスタリスクでタグ付けされます。たとえば、「用語の*は」「という用語は、」フレームワーク文書で定義されていることを示しています。"
    },
    {
      "indent": 3,
      "text": "The structure of the memo is as follows:",
      "ja": "次のようにメモの構造は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o A 'singleton*' analytic metric, called Type-P-One-way-Packet-Loss, is introduced to measure a single observation of packet transmission or loss.",
      "ja": "O「シングルトンは*」タイプP-ワンウェイパケット損失と呼ばれる、メトリック解析は、パケットの送信または損失の単一の観察を測定するために導入されます。"
    },
    {
      "indent": 3,
      "text": "o Using this singleton metric, a 'sample*' called Type-P-One-way-Packet-Loss-Poisson-Stream is introduced to measure a sequence of singleton transmissions and/or losses measured at times taken from a Poisson process, as defined in Section 11.1.1 of [RFC2330].",
      "ja": "メトリックこのシングルトンを使用して、O、いわゆる「サンプル*」がタイプP-ワンウェイパケット・ロス・ポアソン・ストリームは、ポアソン過程から取られた時間で測定シングルトン送信および/または損失のシーケンスを測定するために導入された、として[RFC2330]のセクション11.1.1に定義されました。"
    },
    {
      "indent": 3,
      "text": "o Using this sample, several 'statistics*' of the sample will be defined and discussed.",
      "ja": "このサンプルを使用してO、サンプルのいくつかの「統計は、*」定義して議論されます。"
    },
    {
      "indent": 3,
      "text": "This progression from singleton to sample to statistics, with clear separation among them, is important.",
      "ja": "統計にサンプリングするシングルトンからのこの進行は、それらの間に明確な分離で、重要です。"
    },
    {
      "indent": 0,
      "text": "1.1. Motivation",
      "section_title": true,
      "ja": "1.1。動機"
    },
    {
      "indent": 3,
      "text": "Understanding one-way packet loss of Type-P* packets from a source host* to a destination host is useful for several reasons:",
      "ja": "宛先ホストに送信元ホスト*からタイプPの*パケットの一方向のパケット損失を理解することは、いくつかの理由のために有用です："
    },
    {
      "indent": 3,
      "text": "o Some applications do not perform well (or at all) if end-to-end loss between hosts is large relative to some threshold value.",
      "ja": "ホスト間のエンドツーエンドの損失がある閾値に対して大きい場合、O一部のアプリケーションでは、ウェル（またはまったく）行いません。"
    },
    {
      "indent": 3,
      "text": "o Excessive packet loss may make it difficult to support certain real-time applications (where the precise threshold of \"excessive\" depends on the application).",
      "ja": "O過度のパケット損失は、それが難しい（「過剰」の正確なしきい値は、アプリケーションによって異なります）、特定のリアルタイムアプリケーションをサポートすることがあります。"
    },
    {
      "indent": 3,
      "text": "o The larger the value of packet loss, the more difficult it is for transport-layer protocols to sustain high bandwidths.",
      "ja": "トランスポート層プロトコルは高い帯域幅を維持するため、パケットロスの大きな値O、より困難です。"
    },
    {
      "indent": 3,
      "text": "o The sensitivity of real-time applications and of transport-layer protocols to loss become especially important when very large delay-bandwidth products must be supported.",
      "ja": "リアルタイムアプリケーションの、特に重要になっ損失へのトランスポート層プロトコルの感度oを非常に大きな遅延、帯域幅の製品はサポートされなければならないとき。"
    },
    {
      "indent": 3,
      "text": "The measurement of one-way loss instead of round-trip loss is motivated by the following factors:",
      "ja": "代わりに、往復損失の一方向損失の測定は、以下の要因によって動機付けされます。"
    },
    {
      "indent": 3,
      "text": "o In today's Internet, the path from a source to a destination may be different than the path from the destination back to the source (\"asymmetric paths\"), such that different sequences of routers are used for the forward and reverse paths. Therefore, round-trip measurements actually measure the performance of two distinct paths together. Measuring each path independently highlights the performance difference between the two paths that may traverse different Internet service providers and even radically different types of networks (for example, research versus commodity networks, or networks with asymmetric link capacities, or wireless versus wireline access).",
      "ja": "今日のインターネットでoは、ソースから宛先へのパスは、バックルータの異なる配列が順方向および逆方向経路のために使用されるように、ソース（「非対称パス」）、先の経路と異なっていてもよいです。したがって、往復の測定値は、実際には2つの別個の経路の性能を測定します。各経路を測定することは独立に異なるインターネットサービスプロバイダとも根本的に異なる（例えば、商品のネットワークに対する研究、または非対称リンク容量とネットワーク、又は有線アクセスに対して無線）ネットワークのタイプを横断することができる二つの経路の間の性能差を強調する。"
    },
    {
      "indent": 3,
      "text": "o Even when the two paths are symmetric, they may have radically different performance characteristics due to asymmetric queuing.",
      "ja": "2つのパスが対称である場合でも、O、彼らは、非対称キューイングによる根本的に異なる性能特性を有することができます。"
    },
    {
      "indent": 3,
      "text": "o Performance of an application may depend mostly on the performance in one direction. For example, a TCP-based communication will experience reduced throughput if congestion occurs in one direction of its communication. Troubleshooting may be simplified if the congested direction of TCP transmission can be identified.",
      "ja": "Oアプリケーションのパフォーマンスは、1つの方向の性能にほとんど依存してもよいです。輻輳がその通信の一方向に発生した場合、例えば、TCPベースの通信は、スループットの低下を経験します。 TCP伝送の輻輳方向が特定できる場合、トラブルシューティングを簡素化することができます。"
    },
    {
      "indent": 3,
      "text": "o In networks in which quality of service (QoS) is enabled, provisioning in one direction may be radically different than provisioning in the reverse direction and thus the QoS guarantees differ. Measuring the paths independently allows the verification of both guarantees.",
      "ja": "サービスの品質（QoS）がイネーブルされたOネットワークでは、一方向のプロビジョニングは、逆方向にプロビジョニングより根本的に異なることができるので、QoS保証が異なります。経路を測定することは、独立して、両方の保証の検証を可能にします。"
    },
    {
      "indent": 3,
      "text": "It is outside the scope of this document to say precisely how loss metrics would be applied to specific problems.",
      "ja": "これは、特定の問題に適用される正確にどのように損失メトリクスと言って、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "1.2. General Issues regarding Time",
      "section_title": true,
      "ja": "1.2。時間に関する一般的な問題"
    },
    {
      "indent": 3,
      "text": "{Comment: The terminology below differs from that defined by ITU-T documents (e.g., G.810, \"Definitions and terminology for synchronization networks\" and I.356, \"B-ISDN ATM layer cell transfer performance\") but is consistent with the IPPM Framework document. In general, these differences derive from the different backgrounds; the ITU-T documents historically have a telephony origin, while the authors of this document (and the Framework document) have a computer systems background. Although the terms defined below have no direct equivalent in the ITU-T definitions, after our definitions we will provide a rough mapping. However, note one potential confusion: our definition of \"clock\" is the computer operating systems definition denoting a time-of-day clock, while the ITU-T definition of clock denotes a frequency reference.}",
      "ja": "{コメント：以下の用語は、（例えば、G.810「の定義及び用語同期ネットワークのために」とI.356、「B-ISDN ATMレイヤセル転送性能」）ITU-T文書によって定義されたものとは異なるが、と一致していますIPPMフレームワークドキュメント。一般的に、これらの違いは、異なる背景から派生します。このドキュメント（およびフレームワークドキュメント）の著者は、コンピュータシステムのバックグラウンドを持っていながら、ITU-T文書は歴史的に、電話の起源を持っています。以下に定義する用語は、ITU-Tの定義には直接対応を持っていませんが、私たちの定義の後に我々はラフなマッピングを提供します。しかし、1混乱の点に注意してください。時計のITU-Tの定義は、周波数基準を示しながら、「時計」の私達の定義は、時刻クロックを表すコンピュータのオペレーティングシステムの定義です}。"
    },
    {
      "indent": 3,
      "text": "Whenever a time (i.e., a moment in history) is mentioned here, it is understood to be measured in seconds (and fractions) relative to UTC.",
      "ja": "時間（歴史の中で、すなわち、モーメント）がここに記載されているときはいつでも、UTCに対する秒（画分）において測定されていると理解されます。"
    },
    {
      "indent": 3,
      "text": "As described more fully in the Framework document, there are four distinct, but related notions of clock uncertainty:",
      "ja": "フレームワークドキュメントで詳しく説明するように、クロックの不確実性の4つの異なる、しかし関連概念があります。"
    },
    {
      "indent": 3,
      "text": "synchronization*",
      "ja": "同期*"
    },
    {
      "indent": 3,
      "text": "measures the extent to which two clocks agree on what time it is. For example, the clock on one host might be 5.4 msec ahead of the clock on a second host. {Comment: A rough ITU-T equivalent is \"time error\".}",
      "ja": "2つのクロックが、それが何であるかを時間に同意する範囲を測定します。例えば、一つのホスト上のクロックは5.4ミリ秒先に第二のホスト上のクロックのかもしれません。 {コメント：荒いITU-Tと同等「とは、時間誤差」です。}"
    },
    {
      "indent": 3,
      "text": "accuracy*",
      "ja": "正確さ*"
    },
    {
      "indent": 3,
      "text": "measures the extent to which a given clock agrees with UTC. For example, the clock on a host might be 27.1 msec behind UTC. {Comment: A rough ITU-T equivalent is \"time error from UTC\".}",
      "ja": "与えられたクロックがUTCと一致する程度を測定します。たとえば、ホスト上のクロックがUTCの後ろの27.1ミリ秒であるかもしれません。 {コメント：荒いITU-Tと同等「とは、UTCからの時間誤差」です。}"
    },
    {
      "indent": 3,
      "text": "resolution*",
      "ja": "解決*"
    },
    {
      "indent": 3,
      "text": "is a specification of the smallest unit by which the clock's time is updated. It gives a lower bound on the clock's uncertainty. For example, the clock on an old Unix host might tick only once every 10 msec and thus have a resolution of only 10 msec. {Comment: A very rough ITU-T equivalent is \"sampling period\".} skew*",
      "ja": "時計の時刻が更新されることにより、最小単位の仕様です。これは、クロックの不確実性の下限を与えます。例えば、古いUNIXホスト上のクロックは一回だけ10msec毎にチェックを入れ、したがって、わずか10ミリ秒の分解能を持っているかもしれません。 {コメント：非常に粗いITU-T同等物は「サンプリング周期」である。}スキュー*"
    },
    {
      "indent": 3,
      "text": "measures the change of accuracy, or of synchronization, with time. For example, the clock on a given host might gain 1.3 msec per hour and thus be 27.1 msec behind UTC at one time and only 25.8 msec an hour later. In this case, we say that the clock of the given host has a skew of 1.3 msec per hour relative to UTC, which threatens accuracy. We might also speak of the skew of one clock relative to another clock, which threatens synchronization. {Comment: A rough ITU-T equivalent is \"time drift\".}",
      "ja": "時間の経過とともに、精度の変化を測定する、または同期の。たとえば、特定のホスト上のクロックは、一度にUTCの後ろの27.1ミリとのみ25.8ミリ秒時間後に毎時1.3ミリ秒を得るため、かもしれません。この場合、私たちは与えられたホストのクロック精度を脅かすUTCを基準とする相対時間あたり1.3ミリ秒のスキューを持っていることを言います。また、同期を脅かす別のクロックに比べ1つのクロックのスキューの話かもしれません。 {コメント：荒いITU-Tと同等「とは、時間ドリフト」です。}"
    },
    {
      "indent": 0,
      "text": "2. A Singleton Definition for One-Way Packet Loss",
      "section_title": true,
      "ja": "一方向のパケット損失2. Aシングルトンの定義"
    },
    {
      "indent": 0,
      "text": "2.1. Metric Name",
      "section_title": true,
      "ja": "2.1。メトリック名"
    },
    {
      "indent": 3,
      "text": "Type-P-One-way-Packet-Loss",
      "ja": "タイプ-P-ワンウェイパケット損失"
    },
    {
      "indent": 0,
      "text": "2.2. Metric Parameters",
      "section_title": true,
      "ja": "2.2。メトリックパラメータ"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of a host",
      "ja": "OのSrc、ホストのIPアドレス"
    },
    {
      "indent": 3,
      "text": "o Dst, the IP address of a host",
      "ja": "OのDst、ホストのIPアドレス"
    },
    {
      "indent": 3,
      "text": "o T, a time",
      "ja": "O T、時間"
    },
    {
      "indent": 3,
      "text": "o Tmax, a loss threshold waiting time",
      "ja": "OのTmax、損失しきい値待ち時間"
    },
    {
      "indent": 0,
      "text": "2.3. Metric Units",
      "section_title": true,
      "ja": "2.3。メートル法"
    },
    {
      "indent": 3,
      "text": "The value of a Type-P-One-way-Packet-Loss is either a zero (signifying successful transmission of the packet) or a one (signifying loss).",
      "ja": "タイプP-ワンウェイパケット損失の値がゼロ（パケットの意味送信成功）または1（損失を意味する）のいずれかです。"
    },
    {
      "indent": 0,
      "text": "2.4. Definition",
      "section_title": true,
      "ja": "2.4。定義"
    },
    {
      "indent": 3,
      "text": ">>The *Type-P-One-way-Packet-Loss* from Src to Dst at T is 0<< means that Src sent the first bit of a Type-P packet to Dst at wire time* T and that Dst received that packet.",
      "ja": ">> Tにおけるsrcからdstへ*タイプP-ワンウェイパケット損失*が0 << srcがワイヤ時間* TでDSTのタイプPのパケットの最初のビットを送信し、dstが受信したことを意味していますそのパケット。"
    },
    {
      "indent": 3,
      "text": ">>The *Type-P-One-way-Packet-Loss* from Src to Dst at T is 1<< means that Src sent the first bit of a Type-P packet to Dst at wire time T and that Dst did not receive that packet (within the loss threshold waiting time, Tmax).",
      "ja": ">> Tにおけるsrcからdstへ*タイプP-ワンウェイパケット損失*が1 << srcがワイヤ時間TでDSTのタイプPのパケットの最初のビットを送信したとDSTがなかったことを意味しています（損失しきい値待機時間内に、Tmaxは）そのパケットを受け取ります。"
    },
    {
      "indent": 0,
      "text": "2.5. Discussion",
      "section_title": true,
      "ja": "2.5。討論"
    },
    {
      "indent": 3,
      "text": "Thus, Type-P-One-way-Packet-Loss is 0 exactly when Type-P-One-way-Delay is a finite value, and it is 1 exactly when Type-P-One-way-Delay is undefined.",
      "ja": "このように、タイプP-ワンウェイパケット損失は0を正確に入力し-P-ワンウェイ遅延が有限の値である、そしてそれはタイプP-ワンウェイ遅延が未定義の正確とき1です。"
    },
    {
      "indent": 3,
      "text": "The following issues are likely to come up in practice:",
      "ja": "次の問題は、実際に出てくる可能性があります。"
    },
    {
      "indent": 3,
      "text": "o A given methodology will have to include a way to distinguish between a packet loss and a very large (but finite) delay. As noted by Mahdavi and Paxson [RFC2678], simple upper bounds (such as the 255-second theoretical upper bound on the lifetimes of IP packets [RFC791]) could be used, but good engineering, including an understanding of packet lifetimes, will be needed in practice. {Comment: Note that, for many applications of these metrics, there may be no harm in treating a large delay as packet loss. An audio playback packet, for example, that arrives only after the playback point may as well have been lost. See Section 4.1.1 of [RFC6703] for examination of unusual packet delays and application performance estimation.}",
      "ja": "O所定の方法論は、パケット損失と非常に大きい（しかし有限の）遅延を区別する方法を含むことがあります。 Mahdaviとパクソン[RFC2678]で述べたように、（例えばIPパケットの寿命に結合した255秒の理論上のような[RFC791]）単純な上限を使用することができるが、パケットの寿命の理解を含め、工学良いであろう実際には必要。 {コメント：なお、これらのメトリックの多くの用途のために、パケットロスなどの大きな遅延を治療するのに害がなくてもよいです。オーディオ再生パケットは、例えば、それは、再生ポイントが同様に失われている可能性があり後にのみ到着します。珍しいパケット遅延とアプリケーションのパフォーマンス推定の検査のために[RFC6703]のセクション4.1.1を参照してください。}"
    },
    {
      "indent": 3,
      "text": "o If the packet arrives but is corrupted, then it is counted as lost. {Comment: One is tempted to count the packet as received since corruption and packet loss are related but distinct phenomena. If the IP header is corrupted, however, one cannot be sure about the source or destination IP addresses and is thus on shaky grounds about knowing that the corrupted received packet corresponds to a given sent test packet. Similarly, if other parts of the packet needed by the methodology to know that the corrupted received packet corresponds to a given sent test packet, then such a packet would have to be counted as lost. It would be inconsistent to count packets with corrupted methodology-specific fields as lost, and not to count packets with other corrupted aspects in the same category.} Section 15 of [RFC2330] defines the \"standard-formed\" packet that is applicable to all metrics. Note that at this time the definition of standard-formed packets only applies to IPv4 (see also [IPPM-UPDATES]).",
      "ja": "パケットが到着したが、破損している場合は、O、失われたとしてカウントされます。 {コメント：一つは、腐敗やパケットロスが関連するが異なる現象であるので、受信したパケットをカウントするために誘惑されます。 IPヘッダが破損している場合、しかし、一方が送信元または宛先IPアドレスについて確認することができず、破損し、受信したパケットが所与の送信テストパケットに対応することを知って約不安定敷地ことです。方法論が必要とするパケットの他の部分が破損し、受信したパケットが所与の送信テストパケットに対応することを知っている場合は同様に、そのようなパケットが失われたとしてカウントされなければなりません。失われた、同じカテゴリー内の他の破損の態様にパケットをカウントしないように、破損方法固有のフィールドを持つパケットをカウントする矛盾であろう。} [RFC2330]のセクション15のすべてに適用可能である「標準的に形成された」パケットを定義しますメトリクス。標準の形成パケットの定義は、IPv4のみに適用され、この時点でなお（参照[IPPM-UPDATES]）。"
    },
    {
      "indent": 3,
      "text": "o If the packet is duplicated along the path (or paths) so that multiple non-corrupt copies arrive at the destination, then the packet is counted as received.",
      "ja": "複数の非破損コピーが宛先に到着するようにパケットを経路（又は経路）に沿って複製される場合、O、次いで、パケットを受信としてカウントされます。"
    },
    {
      "indent": 3,
      "text": "o If the packet is fragmented and if, for whatever reason, reassembly does not occur, then the packet will be deemed lost.",
      "ja": "パケットが断片化し、何らかの理由で、再構築が発生していない、場合であれば、O、その後、パケットが失われたものとみなされます。"
    },
    {
      "indent": 0,
      "text": "2.6. Methodologies",
      "section_title": true,
      "ja": "2.6。方法論"
    },
    {
      "indent": 3,
      "text": "As with other Type-P-* metrics, the detailed methodology will depend on the Type-P (e.g., protocol number, UDP/TCP port number, size, Differentiated Services (DS) Field [RFC2780]).",
      "ja": "他のタイプP- *メトリックと同様に、詳細な方法論は、タイプP（例えば、プロトコル番号、UDP / TCPポート番号、サイズ、差別化サービス（DS）フィールド[RFC2780]）に依存するであろう。"
    },
    {
      "indent": 3,
      "text": "Generally, for a given Type-P, one possible methodology would proceed as follows:",
      "ja": "次のように一般的に、与えられたタイプPのために、一つの可能​​な方法は進行します。"
    },
    {
      "indent": 3,
      "text": "o Arrange that Src and Dst have clocks that are synchronized with each other. The degree of synchronization is a parameter of the methodology and depends on the threshold used to determine loss (see below).",
      "ja": "O Srcとdstが互いに同期しているクロックを持っていることを配置します。同期化の程度は、（下記参照）方法のパラメータであり、損失を決定するために使用される閾値に依存します。"
    },
    {
      "indent": 3,
      "text": "o At the Src host, select Src and Dst IP addresses and form a test packet of Type-P with these addresses.",
      "ja": "OのSrcホストでは、SrcとDstのIPアドレスを選択し、これらのアドレスとタイプPのテストパケットを形成します。"
    },
    {
      "indent": 3,
      "text": "o At the Dst host, arrange to receive the packet.",
      "ja": "O Dstのホストでは、パケットを受信するためにアレンジ。"
    },
    {
      "indent": 3,
      "text": "o At the Src host, place a timestamp in the prepared Type-P packet, and send it towards Dst (ideally minimizing time before sending).",
      "ja": "SrcのホストではO、準備されたタイプPパケットにタイムスタンプを置き、（理想的に送信する前に時間を最小化）のDstに向けて送信してください。"
    },
    {
      "indent": 3,
      "text": "o If the packet arrives within a reasonable period of time, the one-way packet loss is taken to be zero (and take a timestamp as soon as possible upon the receipt of the packet).",
      "ja": "パケットは、合理的な期間内に到着した場合、O、一方向のパケット損失はゼロ（およびパケットの受信時にできるだけ早くタイムスタンプを取る）するために取られています。"
    },
    {
      "indent": 3,
      "text": "o If the packet fails to arrive within a reasonable period of time, Tmax, the one-way packet loss is taken to be one. Note that the threshold of \"reasonable\" here is a parameter of the metric.",
      "ja": "パケットは、合理的な期間内に到着しなかった場合、O、Tmaxとは、一方向のパケット損失は1であると解釈されます。ここでは「合理的」のしきい値は、メトリックのパラメータであることに注意してください。"
    },
    {
      "indent": 3,
      "text": "{Comment: The definition of reasonable is intentionally vague and is intended to indicate a value \"Th\" so large that any value in the closed interval [Th-delta, Th+delta] is an equivalent threshold for loss. Here, delta encompasses all error in clock synchronization and timestamp acquisition and assignment along the measured path. If there is a single value, Tmax, after which the packet must be counted as lost, then we reintroduce the need for a degree of clock synchronization similar to that needed for one-way delay, and virtually all practical measurement systems combine methods for delay and loss. Therefore, if a measure of packet loss parameterized by a specific non-huge \"reasonable\" time-out value is needed, one can always measure one-way delay and see what percentage of packets from a given stream exceed a given time-out value. This point is examined in detail in [RFC6703], including analysis preferences to assign undefined delay to packets that fail to arrive with the difficulties emerging from the informal \"infinite delay\" assignment, and an estimation of an upper bound on waiting time for packets in transit. Further, enforcing a specific constant waiting time on stored singletons of one-way delay is compliant with this specification and may allow the results to serve more than one reporting audience.}",
      "ja": "{コメント：合理的な定義が意図的曖昧であり、閉区間の任意の値が[TH-δ、TH +δは損失の等価しきい値となるように大きな値「Thの」を示すことを意図しています。ここで、デルタは、測定経路に沿ってクロック同期およびタイムスタンプの取得と割り当て内のすべてのエラーを包含する。失われたように、パケットがカウントされなければならないの後に単一の値、Tmaxは、存在する場合、我々は一方向の遅延のために必要なものと同様クロック同期の程度の必要性を再導入し、事実上すべての実用的な測定システムは、遅延のための方法を組み合わせますそして損失。特定非巨大な「合理的な」タイムアウト値によってパラメータパケットロスの測定が必要な場合はそのため、一つは、常に一方向の遅延を測定し、与えられたタイムアウト値を超えて指定されたストリームから何のパケットの割合を見ることができます。この点は、非公式の「無限の遅延」割当から出てくる問題で到着しないパケットに未定義の遅延を割り当てるために、分析の好みを含む、[RFC6703]に詳細に検討されており、内のパケットのための待機時間の上限の推定トランジット。さらに、一方向遅延の記憶されたシングルトンに待ち時間特定定数を強制することは、この仕様に準拠しており、その結果、複数のレポート視聴者にサービスを提供することを可能にします。}"
    },
    {
      "indent": 3,
      "text": "Issues such as the packet format, the means by which Dst knows when to expect the test packet, and the means by which Src and Dst are synchronized are outside the scope of this document. {Comment: We plan to document the implementation techniques of our work in much more detail elsewhere; we encourage others to do so as well.}",
      "ja": "そのようなパケットフォーマットなどの問題、試験パケットを期待する場合にDSTが知っする手段、およびSrcとdstが同期される手段は、この文書の範囲外です。 {コメント：私たちは、他の場所でずっと詳細に我々の仕事の実装技術を文書化する予定。我々としてもそうするように他の人を励まします。}"
    },
    {
      "indent": 0,
      "text": "2.7. Errors and Uncertainties",
      "section_title": true,
      "ja": "2.7。エラーおよび不確実性"
    },
    {
      "indent": 3,
      "text": "The description of any specific measurement method should include an accounting and analysis of various sources of error or uncertainty. The Framework document provides general guidance on this point.",
      "ja": "任意の具体的な測定方法の説明は、会計及びエラーまたは不確定性のさまざまなソースの分析を含むべきです。フレームワークドキュメントは、この点に関する一般的なガイダンスを提供します。"
    },
    {
      "indent": 3,
      "text": "For loss, there are three sources of error:",
      "ja": "損失の場合は、エラーの3つの源があります。"
    },
    {
      "indent": 3,
      "text": "o synchronization between clocks on Src and Dst.",
      "ja": "SrcとDstの上のクロックとの間のO同期。"
    },
    {
      "indent": 3,
      "text": "o the packet-loss threshold (which is related to the synchronization between clocks).",
      "ja": "（クロック間の同期に関連する）、パケットロスしきい値O。"
    },
    {
      "indent": 3,
      "text": "o resource limits in the network interface or software on the receiving instrument.",
      "ja": "受信機器のネットワークインタフェース又はソフトウェアで入出力リソース制限。"
    },
    {
      "indent": 3,
      "text": "The first two sources are interrelated and could result in a test packet with finite delay being reported as lost. Type-P-One-way-Packet-Loss is 1 if the test packet does not arrive, or if it does arrive and the difference between the Src timestamp and the Dst timestamp is greater than the \"reasonable period of time\" or loss threshold. If the clocks are not sufficiently synchronized, the loss threshold may not be \"reasonable\" - the packet may take much less time to arrive than its Src timestamp indicates. Similarly, if the loss threshold is set too low, then many packets may be counted as lost. The loss threshold must be high enough and the clocks synchronized well enough so that a packet that arrives is rarely counted as lost. (See the discussions in the previous two sections.)",
      "ja": "最初の二つのソースは相互に関連し、失われたと報告されている有限の遅延とテストパケットにつながる可能性があります。試験パケットが到着しない、またはそれが到着しない場合、およびSrcタイムスタンプとdstタイムスタンプの間の差は、「合理的な時間の期間」または損失閾値よりも大きい場合、タイプP-ワンウェイパケット損失は1 。クロックが十分に同期されていない場合は、損失しきい値は、「合理的」ではないかもしれない - パケットがSrcのタイムスタンプが示すよりも到着するはるかに少ない時間がかかることがあります。損失しきい値の設定が低すぎる場合に失われたと同様に、その後、多くのパケットをカウントすることができます。損失しきい値は十分に高くなければならず、失われたとして到着したパケットはほとんどカウントされないようにクロックが十分同期。 （前の2節での議論を参照してください。）"
    },
    {
      "indent": 3,
      "text": "Since the sensitivity of packet-loss measurement alone to lack of clock synchronization is less than for delay, we refer the reader to the treatment of synchronization errors in the \"One-way Delay Metric for IPPM\" [RFC2330] for more details.",
      "ja": "クロック同期の欠如にのみ、パケット損失測定の感度が遅れよりも小さいので、私たちは「ワンウェイIPPMの遅延メトリック」詳細は[RFC2330]で同期エラーの治療に読者を参照してください。"
    },
    {
      "indent": 3,
      "text": "The last source of error, resource limits, cause the packet to be dropped by the measurement instrument and counted as lost when in fact the network delivered the packet in reasonable time.",
      "ja": "エラー、リソース制限の最後のソースは、パケットが測定器によって低下し、実際にネットワークが合理的な時間内にパケットを配信する際に失わとしてカウントされる原因。"
    },
    {
      "indent": 3,
      "text": "The measurement instruments should be calibrated such that the loss threshold is reasonable for application of the metrics and the clocks are synchronized enough so the loss threshold remains reasonable.",
      "ja": "測定機器は、損失閾値はメトリックの適用のための合理的であり、損失しきい値が妥当なままであるように、クロックが十分に同期されるように較正されなければなりません。"
    },
    {
      "indent": 3,
      "text": "In addition, the instruments should be checked to ensure that the possibility a packet arrives at the network interface but is lost due to congestion on the interface or to other resource exhaustion (e.g., buffers) on the instrument is low.",
      "ja": "また、器具は、パケットがネットワークインターフェースに到着するが、インターフェイスまたは装置上の他のリソースの枯渇（例えば、バッファ）に輻輳のために失われる可能性が低いことを確認するためにチェックされるべきです。"
    },
    {
      "indent": 0,
      "text": "2.8. Reporting the Metric",
      "section_title": true,
      "ja": "2.8。メトリックを報告"
    },
    {
      "indent": 3,
      "text": "The calibration and context in which the metric is measured MUST be carefully considered and SHOULD always be reported along with metric results. We now present four items to consider: Type-P of the test packets, the loss threshold, instrument calibration, and the path traversed by the test packets. This list is not exhaustive; any additional information that could be useful in interpreting applications of the metrics should also be reported (see [RFC6703] for extensive discussion of reporting considerations for different audiences).",
      "ja": "メトリックが測定されるキャリブレーションとコンテキストが慎重に考慮しなければならず、常にメトリック結果とともに報告します。私たちは、今現在4つの項目は、考慮すべき：テストパケットの種類-P、損失しきい値、機器の校正、およびテストパケットが通過するパス。このリストは網羅的なものではありません。メトリックの用途を解釈するのに有用である可能性のある追加の情報も（別の観客のための注意事項を報告する広範な議論のための[RFC6703]を参照）に報告しなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.8.1. Type-P",
      "section_title": true,
      "ja": "2.8.1。タイプP"
    },
    {
      "indent": 3,
      "text": "As noted in Section 13 of the Framework document [RFC2330], the value of the metric may depend on the type of IP packets used to make the measurement, or \"Type-P\". The value of Type-P-One-way-Delay could change if the protocol (UDP or TCP), port number, size, or arrangement for special treatment (e.g., IP DS Field [RFC2780], Explicit Congestion Notification (ECN) [RFC3168], or RSVP) changes. Additional packet distinctions identified in future extensions of the Type-P definition will apply. The exact Type-P used to make the measurements MUST be accurately reported.",
      "ja": "フレームワークドキュメント[RFC2330]のセクション13で述べたように、メトリックの値が測定、または「タイプP」を作製するために使用されるIPパケットの種類に依存してもよいです。値タイプ-P-ワンウェイ遅延が変更される可能性があれば、特別な治療のためのプロトコル（UDPまたはTCP）、ポート番号、サイズ、または配列（例えば、IP DSフィールド[RFC2780]、明示的輻輳通知（ECN）[ RFC3168]、またはRSVP）の変更。タイプPの定義の将来の拡張で特定され、追加のパケットの区別が適用されます。測定を行うために使用される正確なタイプPを正確に報告しなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.8.2. Loss Threshold",
      "section_title": true,
      "ja": "2.8.2。損失しきい値"
    },
    {
      "indent": 3,
      "text": "The threshold, Tmax, between a large finite delay and loss (or other methodology to distinguish between finite delay and loss) MUST be reported.",
      "ja": "（有限の遅延と損失とを区別するため、または他の方法）大有限遅延と損失の間の閾値、Tmaxが、報告されなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.8.3. Calibration Results",
      "section_title": true,
      "ja": "2.8.3。校正結果"
    },
    {
      "indent": 3,
      "text": "The degree of synchronization between the Src and Dst clocks MUST be reported. If possible, a test packet that arrives at the Dst network interface and is reported as lost due to resource exhaustion on Dst SHOULD be reported.",
      "ja": "SrcとDstのクロック間の同期の程度は、報告されなければなりません。可能であれば、Dstのネットワークインターフェースに到着とdstに枯渇資源に失われたと報告されたテストパケットを報告する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.8.4. Path",
      "section_title": true,
      "ja": "2.8.4。道"
    },
    {
      "indent": 3,
      "text": "Finally, the path traversed by the packet SHOULD be reported, if possible. In general, it is impractical to know the precise path a given packet takes through the network. The precise path may be known for certain Type-P on short or stable paths. If Type-P includes the record route (or loose-source route) option in the IP header, and the path is short enough, and all routers* on the path support record (or loose-source) route, then the path will be precisely recorded. This is impractical because the route must be short enough, many routers do not support (or are not configured for) record route, and use of this feature would often artificially worsen the performance observed by removing the packet from common-case processing. However, partial information is still valuable context. For example, if a host can choose between two links* (and hence, two separate routes from Src to Dst), then the initial link used is valuable context. {Comment: Backbone path selection services come and go. A historical example was Merit's NetNow setup, where a Src on one Network Access Point (NAP) can reach a Dst on another NAP by either of several different backbone networks.}",
      "ja": "最後に、パケットが通過するパスは、可能な場合、報告する必要があります。一般に、与えられたパケットがネットワークを介してかかる正確なパスを知ることは非現実的です。正確なパスは、短いまたは安定した経路上の特定のタイプPのために知られてもよいです。タイプPは、レコードルート（またはルーズソースルート）IPヘッダ内のオプションを含み、経路が十分に短く、パスサポートレコード（またはルーズソース）経路上のすべてのルータ*、その後パスがなる場合正確に記録します。これは非現実的であるルートが十分に短くなければならないので、多くのルータがサポートしていない（またはのために設定されていない）レコードルート、およびこの機能の使用は、多くの場合、人為的に共通の場合の処理​​からパケットを除去することにより、観察した性能を悪化させるだろう。しかし、部分的な情報はまだ貴重な文脈です。ホストは、2つの間のリンク*（およびSrcからDSTのため、二つの別々の経路）を選択することができる場合、例えば、使用される最初のリンクは、貴重なコンテキストです。 {コメント：バックボーン経路選択サービスは行ったり来たり。過去の例では、1つのネットワークアクセスポイント（NAP）にSRCは、いくつかの異なるバックボーンネットワークのいずれかによって別のNAP上のDstに達することができるメリットのNetNowセットアップでした。}"
    },
    {
      "indent": 0,
      "text": "3. A Definition for Samples of One-Way Packet Loss",
      "section_title": true,
      "ja": "3.一方向のパケット損失のサンプルのための定義"
    },
    {
      "indent": 3,
      "text": "Given the singleton metric Type-P-One-way-Packet-Loss, we now define one particular sample of such singletons. The idea of the sample is to select a particular binding of the parameters Src, Dst, and Type-P, then define a sample of values of parameter T. The means for defining the values of T is to select a beginning time T0, a final time Tf, and an average rate lambda, then define a pseudorandom Poisson process of rate lambda, whose values fall between T0 and Tf. The time interval between successive values of T will then average 1/ lambda.",
      "ja": "シングルトンメトリックタイプ-P-ワンウェイパケット損失を考えると、我々は今、このようなシングルトンの一つの特定のサンプルを定義します。サンプルのアイデアはパラメータのSrc、Dstの、およびType-Pの特定の結合を選択することで、その後、Tの値を定義するためのパラメータTの値手段のサンプルを定義することは、開始時刻T0を選択することです最終的な時間Tf、および平均速度ラムダ、次に値T0とTfとの間に入る速度ラムダの擬似ランダムポアソン過程を定義します。 Tの連続する値の間の時間間隔は、次いで、平均1 /ラムダをします。"
    },
    {
      "indent": 3,
      "text": "Note that Poisson sampling is only one way of defining a sample. Poisson has the advantage of limiting bias, but other methods of sampling will be appropriate for different situations. For example, a truncated Poisson distribution may be needed to avoid reactive network state changes during intervals of inactivity, see Section 4.6 of [RFC7312]. Sometimes the goal is sampling with a known bias, and [RFC3432] describes a method for periodic sampling with random start times.",
      "ja": "ポアソンサンプリングはサンプルを定義する唯一の方法であることに注意してください。ポアソンバイアスを制限するという利点を有するが、サンプリングの他の方法は、異なる状況のために適切であろう。例えば、切断型ポアソン分布は、[RFC7312]のセクション4.6を参照して、非アクティブの期間中に反応性のネットワーク状態の変更を回避するために必要とされるかもしれません。時には目標は、既知のバイアスでサンプリングされ、そして[RFC3432]は、ランダムな開始時間との定期的なサンプリングのための方法を説明します。"
    },
    {
      "indent": 0,
      "text": "3.1. Metric Name",
      "section_title": true,
      "ja": "3.1。メトリック名"
    },
    {
      "indent": 3,
      "text": "Type-P-One-way-Packet-Loss-Poisson-Stream",
      "ja": "タイプ-P-ワンウェイパケット・ロス・ポアソンストリーム"
    },
    {
      "indent": 0,
      "text": "3.2. Metric Parameters",
      "section_title": true,
      "ja": "3.2。メトリックパラメータ"
    },
    {
      "indent": 3,
      "text": "o Src, the IP address of a host",
      "ja": "OのSrc、ホストのIPアドレス"
    },
    {
      "indent": 3,
      "text": "o Dst, the IP address of a host",
      "ja": "OのDst、ホストのIPアドレス"
    },
    {
      "indent": 3,
      "text": "o T0, a time",
      "ja": "T0、時間O"
    },
    {
      "indent": 3,
      "text": "o Tf, a time",
      "ja": "O Tfは、時間"
    },
    {
      "indent": 3,
      "text": "o Tmax, a loss threshold waiting time",
      "ja": "OのTmax、損失しきい値待ち時間"
    },
    {
      "indent": 3,
      "text": "o lambda, a rate in reciprocal seconds",
      "ja": "Oラムダ、相反秒率"
    },
    {
      "indent": 0,
      "text": "3.3. Metric Units",
      "section_title": true,
      "ja": "3.3。メートル法"
    },
    {
      "indent": 3,
      "text": "A sequence of pairs; the elements of each pair are:",
      "ja": "ペアの配列;各対の要素は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o T, a time, and",
      "ja": "O T、時間、および"
    },
    {
      "indent": 3,
      "text": "o L, either a zero or a one.",
      "ja": "ゼロまたは1個のO L、。"
    },
    {
      "indent": 3,
      "text": "The values of T in the sequence are monotonic increasing. Note that T would be a valid parameter to Type-P-One-way-Packet-Loss and that L would be a valid value of Type-P-One-way-Packet-Loss.",
      "ja": "配列におけるTの値が増加する単調です。 Tは、TYPE-P-ワンウェイパケット損失への有効なパラメータとなり、そのLは、タイプP-ワンウェイパケット損失の有効な値になることに注意してください。"
    },
    {
      "indent": 0,
      "text": "3.4. Definition",
      "section_title": true,
      "ja": "3.4。定義"
    },
    {
      "indent": 3,
      "text": "Given T0, Tf, and lambda, we compute a pseudorandom Poisson process beginning at or before T0, with average arrival rate lambda, and ending at or after Tf. Those time values greater than or equal to T0 and less than or equal to Tf are then selected. At each of the selected times in this process, we obtain one value of Type-P-One-way-Delay. The value of the sample is the sequence made up of the resulting <time, loss> pairs. If there are no such pairs, the sequence is of length zero and the sample is said to be empty.",
      "ja": "T0、Tfは、ラムダを考えると、我々は平均到着率ラムダを、T0で以前に開始する、とのTfで以降に終了する擬似ランダムポアソン過程を計算します。これらの時間は、以上T0に等しく、以下のTfに等しいが、選択された値。この過程で選択された時間のそれぞれで、我々は、Type-P-ワンウェイ遅延の一つの値を取得します。サンプルの値が得られた<時間、損失>対から構成される配列です。そのようなペアが存在しない場合、配列の長さはゼロであり、試料は、空であると言われます。"
    },
    {
      "indent": 0,
      "text": "3.5. Discussion",
      "section_title": true,
      "ja": "3.5。討論"
    },
    {
      "indent": 3,
      "text": "The reader should be familiar with the in-depth discussion of Poisson sampling in the Framework document [RFC2330], which includes methods to compute and verify the pseudorandom Poisson process.",
      "ja": "リーダは、擬似ランダムポアソン過程を計算し、検証する方法を含むフレームワークドキュメント[RFC2330]にポアソンサンプリングの詳細な議論に精通しなければなりません。"
    },
    {
      "indent": 3,
      "text": "We specifically do not constrain the value of lambda except to note the extremes. If the rate is too large, then the measurement traffic will perturb the network and itself cause congestion. If the rate is too small, then you might not capture interesting network behavior. {Comment: We expect to document our experiences with, and suggestions for, lambda elsewhere, culminating in a \"Best Current Practice\" document.}",
      "ja": "私たちは、特に極端に注意することを除いて、ラムダの値を制約しないでください。率が大きすぎると、測定トラフィックが混雑の原因のネットワークと自身を混乱させるだろう。率が小さすぎる場合は、興味深いネットワーク動作をキャプチャしない場合があります。 {コメント：私たちは、と私たちの経験を文書化することを期待、と提案のために、他の場所でラムダ、「最も良いCurrent Practice」ドキュメントで最高潮に達します。}"
    },
    {
      "indent": 3,
      "text": "Since a pseudorandom number sequence is employed, the sequence of times, and hence the value of the sample, is not fully specified. Pseudorandom number generators of good quality will be needed to achieve the desired qualities.",
      "ja": "擬似乱数列を用いているので、時間の順序、したがってサンプルの値は、完全に指定されていません。良質の擬似乱数は、所望の品質を達成するために必要とされます。"
    },
    {
      "indent": 3,
      "text": "The sample is defined in terms of a Poisson process both to avoid the effects of self-synchronization and also capture a sample that is statistically as unbiased as possible. The Poisson process is used to schedule the loss measurements. The test packets will generally not arrive at Dst according to a Poisson distribution, since they are influenced by the network. Time-slotted links described in Section 3.4 [RFC7312] can greatly modify the sample characteristics. The main concern is that unbiased packet streams with randomized inter-packet time intervals will be converted to some new distribution after encountering a time-slotted link, possibly with strong periodic characteristics instead.",
      "ja": "サンプルは、自己同期化の影響を回避し、また、統計学的に可能な限り公平である試料を捕捉するために、両方のポアソン過程に関して定義されます。ポアソン過程は、損失測定をスケジュールするために使用されます。それらはネットワークによって影響されるので、テストパケットは、一般に、ポアソン分布に従ってDstのに到着しないであろう。セクション3.4 [RFC7312]に記載のタイムスロットリンクが大幅サンプル特性を変更することができます。主な関心事は、無作為化パケット間の時間間隔で公平なパケットストリームは、おそらく代わりに、強力な周期的特性を有するタイムスロットのリンクを、遭遇した後、いくつかの新しい分布に変換されるということです。"
    },
    {
      "indent": 3,
      "text": "{Comment: there is, of course, no claim that real Internet traffic arrives according to a Poisson arrival process.",
      "ja": "{コメント：本当のインターネットトラフィックはポアソン到着過程に応じて到着したという主張は、もちろん、ありません。"
    },
    {
      "indent": 3,
      "text": "It is important to note that, in contrast to this metric, loss ratios observed by transport connections do not reflect unbiased samples. For example, TCP transmissions both (1) occur in bursts, which can induce loss due to the burst volume that would not otherwise have been observed, and (2) adapt their transmission rate in an attempt to minimize the loss ratio observed by the connection.}",
      "ja": "このメトリックとは対照的に、交通機関の接続で観測された損失率は公平なサンプルを反映していない、ということに注意することが重要です。例えば、TCPの送信は、（1）により、そうでなければ観察されていないバーストボリュームに損失を誘発し、そして（2）接続によって観察損失率を最小にする試みにおいて、それらの送信レートを適応させることができ、バーストで発生します。}"
    },
    {
      "indent": 3,
      "text": "All the singleton Type-P-One-way-Packet-Loss metrics in the sequence will have the same values of Src, Dst, and Type-P.",
      "ja": "シーケンスのすべてのシングルトンタイプ-P-ワンウェイパケット損失メトリックは、Src、Dstの、およびType-Pの同じ値を持つことになります。"
    },
    {
      "indent": 3,
      "text": "Note also that, given one sample that runs from T0 to Tf, and given new time values T0' and Tf' such that T0 <= T0' <= Tf' <= Tf, the subsequence of the given sample whose time values fall between T0' and Tf' are also a valid Type-P-One-way-Packet-Loss-Poisson-Stream sample.",
      "ja": "メモはまた、T0からTfとを結ぶ一つのサンプル与えられ、与えられた新たな時間は、T0 <= T0' <= Tfと「<= Tfは、時刻の値の間に入る所与のサンプルのサブことT0' 値およびTfの」 T0' とのTf」も有効なタイプ-P-ワンウェイパケット・ロス・ポアソン・ストリームのサンプルです。"
    },
    {
      "indent": 0,
      "text": "3.6. Methodologies",
      "section_title": true,
      "ja": "3.6。方法論"
    },
    {
      "indent": 3,
      "text": "The methodologies follow directly from:",
      "ja": "方法論は、直接からは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o the selection of specific times using the specified Poisson arrival process, and",
      "ja": "O指定ポアソン到着プロセスを使用して特定の時刻の選択、及び"
    },
    {
      "indent": 3,
      "text": "o the methodologies discussion already given for the singleton Type-P-One-way-Packet-Loss metric.",
      "ja": "O方法論の議論はすでにメトリックシングルトンタイプ-P-ワンウェイパケット損失のために与えられました。"
    },
    {
      "indent": 3,
      "text": "Care must be given to correctly handle out-of-order arrival of test packets; it is possible that the Src could send one test packet at TS[i], then send a second one (later) at TS[i+1] while the Dst could receive the second test packet at TR[i+1], and then receive the first one (later) at TR[i]. Metrics for reordering may be found in [RFC4737].",
      "ja": "ケアを正しく処理するために与えられなければならないアウトオブオーダーテストパケットの到着。 SRCは、その後TS時（後）は、第2のものを送信する、TS [I]に一つのテストパケットを送信することができることが可能である[I + 1] DSTはTRで第2のテストパケットを受信することができながら、[I + 1]、及び次いで、[i]はTRで最初の（後）を受信します。並べ替えのためのメトリックは、[RFC4737]に見出すことができます。"
    },
    {
      "indent": 0,
      "text": "3.7. Errors and Uncertainties",
      "section_title": true,
      "ja": "3.7。エラーおよび不確実性"
    },
    {
      "indent": 3,
      "text": "In addition to sources of errors and uncertainties associated with methods employed to measure the singleton values that make up the sample, care must be given to analyze the accuracy of the Poisson arrival process of the wire times of the sending of the test packets. Problems with this process could be caused by several things, including problems with the pseudorandom number techniques used to generate the Poisson arrival process. The Framework document shows how to use the Anderson-Darling test to verify the accuracy of the Poisson process over small time frames. {Comment: The goal is to ensure that the test packets are sent \"close enough\" to a Poisson schedule and avoid periodic behavior.}",
      "ja": "試料を構成するシングルトン値を測定するために使用される方法に関連したエラーおよび不確実性の源に加えて、ケアは、試験パケットの送信のワイヤ時間のポアソン到着プロセスの精度を分析するために与えられなければなりません。このプロセスの問題点は、ポアソン到着プロセスを生成するために使用される擬似乱数技術の問題点を含むいくつかのもの、で発生することができます。フレームワークドキュメントは、小さな時間枠にわたってポアソン過程の精度を検証するためにアンダーソン・ダーリン検定を使用する方法を示します。 {コメント：目標は、テストパケットはポアソンスケジュールに「十分に近い」と周期的挙動を避ける送信されることを保証することです。}"
    },
    {
      "indent": 0,
      "text": "3.8. Reporting the Metric",
      "section_title": true,
      "ja": "3.8。メトリックを報告"
    },
    {
      "indent": 3,
      "text": "The calibration and context for the underlying singletons MUST be reported along with the stream (see \"Reporting the Metric\" (Section 2.8) for Type-P-One-way-Packet-Loss).",
      "ja": "基礎となるシングルトンのためのキャリブレーションとコンテキストは、ストリーム（タイプ-P-ワンウェイパケット損失のため（2.8節）「メトリックをレポート」を参照）と一緒に報告しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Some Statistics Definitions for One-Way Packet Loss",
      "section_title": true,
      "ja": "4.いくつかの統計の定義を一方向パケット損失のために"
    },
    {
      "indent": 3,
      "text": "Given the sample metric Type-P-One-way-Packet-Loss-Poisson-Stream, we now offer several statistics of that sample. These statistics are offered mostly to be illustrative of what could be done. See [RFC6703] for additional discussion of statistics that are relevant to different audiences.",
      "ja": "サンプルメトリックタイプ-P-ワンウェイパケット・ロス・ポアソン・ストリームを考えると、私たちは今、そのサンプルのいくつかの統計情報を提供します。これらの統計は、何ができるかを説明することを主に提供されています。別の観客に関連する統計情報の追加の議論については、[RFC6703]を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.1. Type-P-One-way-Packet-Loss-Ratio",
      "section_title": true,
      "ja": "4.1。タイプ-P-ワンウェイパケット損失比"
    },
    {
      "indent": 3,
      "text": "Given a Type-P-One-way-Packet-Loss-Poisson-Stream, the average of all the L values in the stream is the ratio of losses to total packets in the stream. In addition, the Type-P-One-way-Packet-Loss-Ratio is undefined if the sample is empty.",
      "ja": "タイプP-ワンウェイパケット損失-ポアソンストリーム与えられ、ストリーム内のすべてのL値の平均値は、ストリーム中の全パケットに損失の比です。サンプルが空の場合は加えて、タイプP-ワンウェイパケット損失比は未定義です。"
    },
    {
      "indent": 3,
      "text": "For example, suppose we take a sample and the results are as follows:",
      "ja": "たとえば、私たちはサンプルを取り、次のような結果であると仮定します。"
    },
    {
      "indent": 3,
      "text": "Stream1 = <",
      "ja": "ストリーム1 = <"
    },
    {
      "indent": 3,
      "text": "<T1, 0>",
      "ja": "<T1、0>"
    },
    {
      "indent": 3,
      "text": "<T2, 0>",
      "ja": "<0のTaq、>"
    },
    {
      "indent": 3,
      "text": "<T3, 1>",
      "ja": "<Tsと、1>"
    },
    {
      "indent": 3,
      "text": "<T4, 0>",
      "ja": "<PM 0>"
    },
    {
      "indent": 3,
      "text": "<T5, 0>",
      "ja": "<TKH 0、>"
    },
    {
      "indent": 3,
      "text": ">",
      "ja": "＞"
    },
    {
      "indent": 3,
      "text": "Then, the average of loss results would be 0.2, the loss ratio.",
      "ja": "次に、損失の結果の平均値は0.2、損失率であろう。"
    },
    {
      "indent": 3,
      "text": "Note that, since healthy Internet paths should be operating at loss ratios below 1% (particularly if high delay-bandwidth products are to be sustained), the sample sizes needed might be larger than one would like. Thus, for example, if one wants to discriminate between various fractions of 1% over one-minute periods, then several hundred samples per minute might be needed. This would result in larger values of lambda than one would ordinarily want.",
      "ja": "健康なインターネットパスが1％以下の損失率で動作しなければならないので（高遅延帯域幅積が維持される場合は特に）、なお、必要に応じてサンプルサイズは、1つの希望よりも大きいかもしれません。一つは1分にわたって1％の種々の画分を区別したい場合したがって、例えば、次に分あたり数百のサンプルが必要とされるかもしれません。これは、1つは通常望むよりも、ラムダの大きな値になるでしょう。"
    },
    {
      "indent": 3,
      "text": "Note that although the loss threshold should be set such that any errors in loss are not significant, if the possibility that a packet that arrived is counted as lost due to resource exhaustion is significant compared to the loss ratio of interest, Type-P-One-way-Packet-Loss-Ratio will be meaningless.",
      "ja": "なお、損失閾値が到着したパケットが失われたリソースに起因する消耗としてカウントされる可能性が大きい場合損失のエラーが、タイプP-一つ関心の損失率に比べ、有意ではないように設定されるべきです-way-パケット損失比は無意味になります。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Conducting Internet measurements raises both security and privacy concerns. This memo does not specify an implementation of the metrics, so it does not directly affect the security of the Internet nor of applications that run on the Internet. However, implementations of these metrics must be mindful of security and privacy concerns.",
      "ja": "インターネット測定を行うことは、両方のセキュリティとプライバシーの問題を提起します。このメモは、メトリックの実装を指定していないので、直接インターネットのも、インターネット上で動作するアプリケーションのセキュリティに影響を与えません。しかし、これらのメトリックの実装では、セキュリティとプライバシーの問題に留意する必要があります。"
    },
    {
      "indent": 3,
      "text": "There are two types of security concerns: potential harm caused by the measurements and potential harm to the measurements. The measurements could cause harm because they are active and inject packets into the network. The measurement parameters MUST be carefully selected so that the measurements inject trivial amounts of additional traffic into the networks they measure. If they inject",
      "ja": "測定によって引き起こされる潜在的な害や測定に潜在的な危害：セキュリティ上の問題の2つのタイプがあります。彼らがアクティブで、ネットワークにパケットを注入するので測定が害を引き起こす可能性があります。測定は、彼らが測定ネットワークに追加トラフィックの些細な量を注入するように測定パラメータを慎重に選択しなければなりません。彼らは、注入した場合"
    },
    {
      "indent": 3,
      "text": "\"too much\" traffic, they can skew the results of the measurement and in extreme cases cause congestion and denial of service.",
      "ja": "「あまり」トラフィック、彼らは、測定の結果を歪曲し、極端な場合にはサービスの混雑や拒否を引き起こす可能性があります。"
    },
    {
      "indent": 3,
      "text": "The measurements themselves could be harmed by routers giving measurement traffic a different priority than \"normal\" traffic or by an attacker injecting artificial measurement traffic. If routers can recognize measurement traffic and treat it separately, the measurements will not reflect actual user traffic. If an attacker injects artificial traffic that is accepted as legitimate, the loss ratio will be artificially lowered. Therefore, the measurement methodologies SHOULD include appropriate techniques to reduce the probability that measurement traffic can be distinguished from \"normal\" traffic. Authentication techniques, such as digital signatures, may be used where appropriate to guard against injected traffic attacks.",
      "ja": "測定自体は、測定トラフィックに「正常な」トラフィックや人工的な測定トラフィックを注入することにより、攻撃者は異なる優先順位を与えるルータによって悪影響を受ける可能性があります。ルータは、測定トラフィックを認識し、個別に扱うことができた場合は、測定値は、実際のユーザトラフィックが反映されません。攻撃者は正当なものとして受け入れている人工的なトラフィックを注入した場合、損失率は人為的に低下させることになります。したがって、測定方法は、測定トラフィックが「正常な」トラフィックと区別することができる確率を低減するための適切な技術を含むべきです。そのようなデジタル署名などの認証技術は、注入されたトラフィックの攻撃を防ぐために適切な場合に使用することができます。"
    },
    {
      "indent": 3,
      "text": "When considering privacy of those involved in measurement or those whose traffic is measured, the sensitive information available to potential observers is greatly reduced when using active techniques that are within this scope of work. Passive observations of user traffic for measurement purposes raise many privacy issues. We refer the reader to the privacy considerations described in the Large Scale Measurement of Broadband Performance (LMAP) Framework [RFC7594], which covers active and passive techniques.",
      "ja": "測定に関与するものまたはそのトラフィック測定されるそれらのプライバシーを考慮した場合、作業のこの範囲内で活性な技術を使用する場合、潜在的な観察者に利用可能な機密情報が大幅に低減されます。測定目的のためにユーザトラフィックの受動的観測は、多くのプライバシーの問題を提起します。我々は、アクティブおよびパッシブ技術をカバーする広帯域性能（LMAP）フレームワーク[RFC7594]の大規模測定に記載のプライバシーの考慮事項を読者に参照します。"
    },
    {
      "indent": 3,
      "text": "Collecting measurements or using measurement results for reconnaissance to assist in subsequent system attacks is quite common. Access to measurement results or control of the measurement systems to perform reconnaissance should be guarded against. See Section 7 of [RFC7594] (the Security Considerations section of the LMAP Framework) for system requirements that help to avoid measurement system compromise.",
      "ja": "測定値を収集またはその後のシステム攻撃を支援するために偵察の測定結果を使用することは非常に一般的です。偵察を実行する測定結果又は測定システムの制御へのアクセスがに対して守らなければなりません。測定システムの妥協を避けるために役立つシステム要件については、[RFC7594]（LMAPフレームワークのSecurity Considerations部）のセクション7を参照してください。"
    },
    {
      "indent": 1,
      "text": "6. Changes from",
      "section_title": true,
      "ja": "6.変更から"
    },
    {
      "indent": 3,
      "text": "The text above constitutes a revision to RFC 2680, which is now an Internet Standard.",
      "ja": "テキストは、上記今やインターネット標準であるRFC 2680にリビジョンを構成します。"
    },
    {
      "indent": 3,
      "text": "[RFC7290] provides the test plan and results supporting [RFC2680] advancement along the Standards Track, according to the process in [RFC6576]. The conclusions of [RFC7290] list four minor modifications for inclusion:",
      "ja": "[RFC7290]は[RFC6576]での処理によれば、標準化過程に沿って[RFC2680]進歩をサポート試験計画と結果を提供します。 [RFC7290]のリストを含めるための4つの若干の変更の結論："
    },
    {
      "indent": 3,
      "text": "1. Section 6.2.3 of [RFC7290] asserts that the assumption of post-processing to enforce a constant waiting time threshold is compliant and that the text of the RFC should be revised slightly to include this point. The applicability of post-processing was added in the last list item of Section 2.6, above.",
      "ja": "[RFC7290]の1セクション6.2.3は、一定の待機時間閾値を適用する後処理の仮定が準拠し、RFCのテキストは、この点を含むようにわずかに修正されるべきであることを主張します。後処理の適用は、上記、2.6節の最後のリスト項目に追加されました。"
    },
    {
      "indent": 3,
      "text": "2. Section 6.5 of [RFC7290] indicates that the Type-P-One-way-Packet-Loss-Average statistic is more commonly called a Packet Loss Ratio, so it is renamed in this document (this small discrepancy does not affect candidacy for advancement). The renaming was implemented in Section 4.1, above.",
      "ja": "[RFC7290]の2セクション6.5は、（この小さな不一致がために立候補を影響しないタイプ-P-ワンウェイパケットロス-平均統計は、より一般的にパケットロス率と呼ばれ、それは、本文書に名前が変更されていることを示していますアドバンス）。名前の変更は、上記セクション4.1で実装されました。"
    },
    {
      "indent": 3,
      "text": "3. The IETF has reached consensus on guidance for reporting metrics in [RFC6703], and the memo is referenced this document to incorporate recent experience where appropriate. This reference was added in the last list item of Section 2.6, in Section 2.8, and in Section 4 above.",
      "ja": "3. IETFは、[RFC6703]のメトリックを報告するための指針について合意に達した、とメモが適切な場合には最近の経験を組み込むために、この文書を参照されています。この基準は、セクション2.8で、上記のセクション4で、2.6節の最後のリスト項目に加えました。"
    },
    {
      "indent": 3,
      "text": "4. There are currently two errata with status \"Verified\" (EID 1528) and \"Held for Document Update\" (EID 3186) for [RFC2680], and these minor revisions were incorporated in Sections 1 and 2.7.",
      "ja": "4.そこ現在、[RFC2680]のための（EID 3186）「文書の更新のために開催された」状態「確認済み」（EID 1528）と2つの正誤表であり、これらのマイナーリビジョンは、セクション1および2.7に組み込まれました。"
    },
    {
      "indent": 3,
      "text": "A number of updates to the [RFC2680] text have been implemented in the text to reference key IPPM RFCs that were approved after [RFC2680] (see Sections 3 and 3.6, above) and to address comments on the IPPM mailing list describing current conditions and experience.",
      "ja": "[RFC2680]のテキストへの更新の数が（上記セクション3および3.6を参照）、現在の状態を記述するIPPMメーリングリストのコメントに対処するために、[RFC2680]の後に承認されたキーIPPMのRFCを参照するテキストに実装されていると経験。"
    },
    {
      "indent": 3,
      "text": "1. Near the end of Section 1.1, there is an update of a network example using ATM, a clarification of TCP's affect on queue occupation, and discussion of the importance of one-way delay measurement.",
      "ja": "1.セクション1.1の終わり近く、ATM、TCPのキュー・職業への影響の明確化、および一方向遅延測定の重要性についての議論を使用したネットワーク例の更新があります。"
    },
    {
      "indent": 3,
      "text": "2. Clarification of the definition of \"resolution\" in Section 1.2.",
      "section_title": true,
      "ja": "1.2節では、「解像度」の定義の明確化2。"
    },
    {
      "indent": 3,
      "text": "3. Explicit inclusion of the maximum waiting time input parameter in Sections 2.2, 2.4, and 3.2, reflecting recognition of this parameter in more recent RFCs and ITU-T Recommendation Y.1540.",
      "ja": "より最近のRFCとITU-T勧告Y.1540におけるこのパラメータの認識を反映した3明示セクション2.2、2.4の最大待機時間入力パラメータの包含、および3.2。"
    },
    {
      "indent": 3,
      "text": "4. Addition of a reference to RFC 6703 in the discussion of packet lifetime and application timeouts in Section 2.5.",
      "ja": "セクション2.5におけるパケット寿命とアプリケーションタイムアウトの議論でRFC 6703を参照の4添加。"
    },
    {
      "indent": 3,
      "text": "5. Replaced \"precedence\" with updated terminology (DS Field) in Sections 2.6 and 2.8.1 (with reference).",
      "ja": "5.セクション2.6および2.8.1で更新された用語（DSフィールド）（基準）と「優先度」を置き換え。"
    },
    {
      "indent": 3,
      "text": "6. Added parenthetical guidance on minimizing the interval between timestamp placement to send time or reception time in Section 2.6. Also, the text now recognizes the timestamp acquisition process and that practical systems measure both delay and loss (thus requiring the max waiting time parameter).",
      "ja": "6. 2.6節では、時間または受信時間を送信するには、タイムスタンプの配置間隔を最小限に括弧のガイダンスを追加しました。また、テキストは、現在のタイムスタンプ取得処理を認識し、その実用的なシステムは、（従って、最大待機時間パラメータを必要とする）遅延及び損失の両方を測定します。"
    },
    {
      "indent": 3,
      "text": "7. Added a reference to RFC 3432 regarding periodic sampling alongside Poisson sampling in Section 3 and also noted that a truncated Poisson distribution may be needed with modern networks as described in the IPPM Framework update [RFC7312].",
      "ja": "7.第3のポアソンサンプリングと一緒に周期的サンプリングに関するRFC 3432への参照を追加し、また、IPPMフレームワークアップデート[RFC7312]で説明されるように切頭ポアソン分布は、現代のネットワークで必要とされ得ることに留意しました。"
    },
    {
      "indent": 3,
      "text": "8. Recognition that time-slotted links described in [RFC7312] can greatly modify the sample characteristics, in Section 3.5.",
      "ja": "[RFC7312]で説明8.認識そのタイムスロットリンクが大幅セクション3.5で、サンプルの特性を変更することができます。"
    },
    {
      "indent": 3,
      "text": "9. Added a reference to RFC 4737 regarding reordering metrics in the related discussion of Section 3.6, \"Methodologies\".",
      "ja": "9.第3.6節、「方法論」の関連議論で並べ替えメトリックに関するRFC 4737への参照を追加しました。"
    },
    {
      "indent": 3,
      "text": "10. Expanded and updated the material on privacy and added cautions on use of measurements for reconnaissance in Section 5, \"Security Considerations\".",
      "ja": "10.拡張およびプライバシー上に材料を更新し、第5節で偵察のための測定の使用上の注意事項を追加し、「セキュリティに関する考慮事項」。"
    },
    {
      "indent": 3,
      "text": "Section 5.4.4 of [RFC6390] suggests a common template for performance metrics partially derived from previous IPPM and Benchmarking Methodology Working Group (BMWG) RFCs, but it also contains some new items. All of the normative parts of [RFC6390] are covered, but not quite in the same section names or orientation. Several of the informative parts are covered. Maintaining the familiar outline of IPPM literature has value and minimizes unnecessary differences between this revised RFC and current/future IPPM RFCs.",
      "ja": "[RFC6390]のセクション5.4.4は、部分的に前のIPPM由来パフォーマンスメトリックとベンチマーク手法ワーキンググループ（BMWG）RFCの共通テンプレートを示唆しているが、それはまた、いくつかの新しいアイテムが含まれています。 [RFC6390]の規範的部分の全てはなく、全く同じセクション名や向きで、覆われています。有益な部品のいくつかは、覆われています。 IPPM文学の馴染みの概要を維持することは価値があり、この改訂RFCと将来/現在のIPPM RFCの間の不要な差異を最小限に抑えることができます。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC791] Postel, J., \"Internet Protocol\", STD 5, RFC 791, DOI 10.17487/RFC0791, September 1981, <http://www.rfc-editor.org/info/rfc791>.",
      "ja": "[RFC791]ポステル、J.、 \"インターネットプロトコル\"、STD 5、RFC 791、DOI 10.17487 / RFC0791、1981年9月、<http://www.rfc-editor.org/info/rfc791>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2330] Paxson, V., Almes, G., Mahdavi, J., and M. Mathis, \"Framework for IP Performance Metrics\", RFC 2330, DOI 10.17487/RFC2330, May 1998, <http://www.rfc-editor.org/info/rfc2330>.",
      "ja": "[RFC2330]パクソン、V.、Almes、G.、Mahdavi、J.、およびM.マティス、 \"IPパフォーマンス・メトリックのためのフレームワーク\"、RFC 2330、DOI 10.17487 / RFC2330、1998年5月、<HTTP：//www.rfc -editor.org/info/rfc2330>。"
    },
    {
      "indent": 3,
      "text": "[RFC2678] Mahdavi, J. and V. Paxson, \"IPPM Metrics for Measuring Connectivity\", RFC 2678, DOI 10.17487/RFC2678, September 1999, <http://www.rfc-editor.org/info/rfc2678>.",
      "ja": "[RFC2678] Mahdavi、J.およびV.パクソン、 \"接続を測定するためのIPPMメトリック\"、RFC 2678、DOI 10.17487 / RFC2678、1999年9月、<http://www.rfc-editor.org/info/rfc2678>。"
    },
    {
      "indent": 3,
      "text": "[RFC2680] Almes, G., Kalidindi, S., and M. Zekauskas, \"A One-way Packet Loss Metric for IPPM\", RFC 2680, DOI 10.17487/RFC2680, September 1999, <http://www.rfc-editor.org/info/rfc2680>.",
      "ja": "[RFC2680] Almes、G.、Kalidindi、S.、およびM. Zekauskas、 \"IPPMための一方向パケット損失メトリック\"、RFC 2680、DOI 10.17487 / RFC2680、1999年9月、<HTTP：//www.rfc- editor.org/info/rfc2680>。"
    },
    {
      "indent": 3,
      "text": "[RFC2780] Bradner, S. and V. Paxson, \"IANA Allocation Guidelines For Values In the Internet Protocol and Related Headers\", BCP 37, RFC 2780, DOI 10.17487/RFC2780, March 2000, <http://www.rfc-editor.org/info/rfc2780>.",
      "ja": "[RFC2780]ブラドナー、S.とV.パクソン、 \"インターネットプロトコルと関連ヘッダーの値のためのIANA配分ガイドライン\"、BCP 37、RFC 2780、DOI 10.17487 / RFC2780、2000年3月、<のhttp：//www.rfc- editor.org/info/rfc2780>。"
    },
    {
      "indent": 3,
      "text": "[RFC3432] Raisanen, V., Grotefeld, G., and A. Morton, \"Network performance measurement with periodic streams\", RFC 3432, DOI 10.17487/RFC3432, November 2002, <http://www.rfc-editor.org/info/rfc3432>.",
      "ja": "[RFC3432]、RFC 3432、DOI 10.17487 / RFC3432、2002年11月Raisanen、V.、Grotefeld、G.、およびA.モートン、 \"周期的なストリームによるネットワーク性能測定\"、<http://www.rfc-editor.org /情報/ rfc3432>。"
    },
    {
      "indent": 3,
      "text": "[RFC6576] Geib, R., Ed., Morton, A., Fardid, R., and A. Steinmitz, \"IP Performance Metrics (IPPM) Standard Advancement Testing\", BCP 176, RFC 6576, DOI 10.17487/RFC6576, March 2012, <http://www.rfc-editor.org/info/rfc6576>.",
      "ja": "[RFC6576] Geib、R.、エド。、モートン、A.、Fardid、R.、およびA. Steinmitz、 \"IPパフォーマンス・メトリック（IPPM）標準推進テスト\"、BCP 176、RFC 6576、DOI 10.17487 / RFC6576、マーチ2012年、<http://www.rfc-editor.org/info/rfc6576>。"
    },
    {
      "indent": 3,
      "text": "[RFC7312] Fabini, J. and A. Morton, \"Advanced Stream and Sampling Framework for IP Performance Metrics (IPPM)\", RFC 7312, DOI 10.17487/RFC7312, August 2014, <http://www.rfc-editor.org/info/rfc7312>.",
      "ja": "[RFC7312] Fabini、J.及びA.モートン、 \"アドバンスドストリームとIPパフォーマンス・メトリック（IPPM）のためのサンプリングフレームワーク\"、RFC 7312、DOI 10.17487 / RFC7312、2014年8月、<http://www.rfc-editor.org /情報/ rfc7312>。"
    },
    {
      "indent": 3,
      "text": "[RFC7679] Almes, G., Kalidindi, S., Zekauskas, M., and A. Morton, Ed., \"A One-Way Delay Metric for IP Performance Metrics (IPPM)\", STD 81, RFC 7679, DOI 10.17487/RFC7679, January 2016, <http://www.rfc-editor.org/info/rfc7679>.",
      "ja": "[RFC7679] Almes、G.、Kalidindi、S.、Zekauskas、M.、およびA.モートン編、 \"IPパフォーマンス・メトリックのための一方向遅延メトリック（IPPM）\"、STD 81、RFC 7679、DOI 10.17487 / RFC7679、2016年1月、<http://www.rfc-editor.org/info/rfc7679>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[IPPM-UPDATES] Morton, A., Fabini, J., Elkins, N., Ackermann, M., and V. Hegde, \"Updates for IPPM's Active Metric Framework: Packets of Type-P and Standard-Formed Packets\", Work in Progress, draft-morton-ippm-2330-stdform-typep-02, December 2015.",
      "ja": "[IPPM-UPDATES]モートン、A.、Fabini、J.、エルキンズ、N.、アッカーマン、M.、およびV. Hegde、 \"IPPMのActiveメトリックフレームワークの更新：タイプ-Pおよび標準形成されたパケットのパケット\"、ドラフト・モートン・IPPM-2330-stdform-typep-02、2015年12月、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[RFC3168] Ramakrishnan, K., Floyd, S., and D. Black, \"The Addition of Explicit Congestion Notification (ECN) to IP\", RFC 3168, DOI 10.17487/RFC3168, September 2001, <http://www.rfc-editor.org/info/rfc3168>.",
      "ja": "\"IPへの明示的輻輳通知の追加（ECN）\" [RFC3168]ラマクリシュナン、K.、フロイド、S.、およびD.ブラック、RFC 3168、DOI 10.17487 / RFC3168、2001年9月、<のhttp：// WWW。 rfc-editor.org/info/rfc3168>。"
    },
    {
      "indent": 3,
      "text": "[RFC4737] Morton, A., Ciavattone, L., Ramachandran, G., Shalunov, S., and J. Perser, \"Packet Reordering Metrics\", RFC 4737, DOI 10.17487/RFC4737, November 2006, <http://www.rfc-editor.org/info/rfc4737>.",
      "ja": "[RFC4737]モートン、A.、Ciavattone、L.、ラマチャンドラン、G.、Shalunov、S.、およびJ. Perser、 \"パケット並べ替えメトリック\"、RFC 4737、DOI 10.17487 / RFC4737、2006年11月、<HTTP：// www.rfc-editor.org/info/rfc4737>。"
    },
    {
      "indent": 3,
      "text": "[RFC6390] Clark, A. and B. Claise, \"Guidelines for Considering New Performance Metric Development\", BCP 170, RFC 6390, DOI 10.17487/RFC6390, October 2011, <http://www.rfc-editor.org/info/rfc6390>.",
      "ja": "[RFC6390]クラーク、A.およびB. Claise、 \"新パフォーマンスメトリック開発を検討するためのガイドライン\"、BCP 170、RFC 6390、DOI 10.17487 / RFC6390、2011年10月、<http://www.rfc-editor.org/info / rfc6390>。"
    },
    {
      "indent": 3,
      "text": "[RFC6703] Morton, A., Ramachandran, G., and G. Maguluri, \"Reporting IP Network Performance Metrics: Different Points of View\", RFC 6703, DOI 10.17487/RFC6703, August 2012, <http://www.rfc-editor.org/info/rfc6703>.",
      "ja": "[RFC6703]モートン、A.、ラマチャンドラン、G.、およびG. Maguluri、 \"IPネットワークのパフォーマンス・メトリックをレポート：異なる視点\"、RFC 6703、DOI 10.17487 / RFC6703、2012年8月、<のhttp：//www.rfc -editor.org/info/rfc6703>。"
    },
    {
      "indent": 3,
      "text": "[RFC7290] Ciavattone, L., Geib, R., Morton, A., and M. Wieser, \"Test Plan and Results for Advancing RFC 2680 on the Standards Track\", RFC 7290, DOI 10.17487/RFC7290, July 2014, <http://www.rfc-editor.org/info/rfc7290>.",
      "ja": "[RFC7290] Ciavattone、L.、Geib、R.、モートン、A.、およびM. Wieserの、 \"テスト計画と標準化過程にRFC 2680を前進させるための結果\"、RFC 7290、DOI 10.17487 / RFC7290、2014年7月、< http://www.rfc-editor.org/info/rfc7290>。"
    },
    {
      "indent": 3,
      "text": "[RFC7594] Eardley, P., Morton, A., Bagnulo, M., Burbridge, T., Aitken, P., and A. Akhter, \"A Framework for Large-Scale Measurement of Broadband Performance (LMAP)\", RFC 7594, DOI 10.17487/RFC7594, September 2015, <http://www.rfc-editor.org/info/rfc7594>.",
      "ja": "[RFC7594] Eardley、P.、モートン、A.、Bagnulo、M.、バーブリッジ、T.、エイトケン、P.、およびA. Akhter、 \"ブロードバンドパフォーマンス（LMAP）の大規模測定のための枠組み\"、RFC 7594、DOI 10.17487 / RFC7594、2015年9月、<http://www.rfc-editor.org/info/rfc7594>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "For [RFC2680], thanks are due to Matt Mathis for encouraging this work and for calling attention on so many occasions to the significance of packet loss. Thanks are due also to Vern Paxson for his valuable comments on early drafts and to Garry Couch and Will Leland for several useful suggestions.",
      "ja": "[RFC2680]のために、おかげでこの作業を促進するため、パケットロスの重要性に非常に多くの機会に注意を喚起するためのマット・マティスによるものです。おかげでいくつかの有用な提案のための早期ドラフトのとギャリーソファーとウィルリーランドへの彼の貴重なコメントのためにも、バーン・パクソンによるものです。"
    },
    {
      "indent": 3,
      "text": "For this document, thanks to Joachim Fabini, Ruediger Geib, Nalini Elkins, and Barry Constantine for sharing their measurement experience as part of their careful reviews. Brian Carpenter and Scott Bradner provided useful feedback at IETF Last Call.",
      "ja": "このドキュメントのために、彼らの慎重なレビューの一環として、測定の経験を共有するためのヨアヒムFabini、Ruediger Geib、ナリニエルキンズ、そしてバリー・コンスタンティンのおかげ。ブライアン・カーペンターとスコット・ブラッドナーは、IETFラストコールで有用なフィードバックを提供します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Guy Almes Texas A&M",
      "ja": "ガイAlmesテキサスA＆M"
    },
    {
      "indent": 3,
      "text": "Email: almes@acm.org",
      "ja": "メール：almes@acm.org"
    },
    {
      "indent": 3,
      "text": "Sunil Kalidindi Ixia",
      "ja": "スニルKalidindiイクシア"
    },
    {
      "indent": 3,
      "text": "Email: skalidindi@ixiacom.com",
      "ja": "メール：skalidindi@ixiacom.com"
    },
    {
      "indent": 3,
      "text": "Matt Zekauskas Internet2",
      "ja": "マット・Zekauskasインターネット2"
    },
    {
      "indent": 3,
      "text": "Email: matt@internet2.edu",
      "ja": "メール：matt@internet2.edu"
    },
    {
      "indent": 3,
      "text": "Al Morton (editor) AT&T Labs 200 Laurel Avenue South Middletown, NJ 07748 United States",
      "ja": "アル・モートン（エディタ）AT＆T Labsの200ローレルアベニュー南ミドルタウン、NJ 07748米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732 420 1571 Fax: +1 732 368 1192 Email: acmorton@att.com URI: http://home.comcast.net/~acmacm/",
      "ja": "電話：+1 732 420 1571ファックス：+1 732 368 1192 Eメール：acmorton@att.com URI：http://home.comcast.net/~acmacm/"
    }
  ]
}