{
  "title": {
    "text": "RFC 7803 - Changing the Registration Policy for the NETCONF Capability URNs Registry",
    "ja": "RFC 7803 - NETCONF Capability URNsレジストリの登録ポリシーの変更"
  },
  "number": 7803,
  "created_at": "2020-08-29 19:38:06.654236+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          B. Leiba\nRequest for Comments: 7803                           Huawei Technologies\nBCP: 203                                                   February 2016\nUpdates: 6241\nCategory: Best Current Practice\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 18,
      "text": "Changing the Registration Policy for the NETCONF Capability URNs Registry",
      "ja": "NETCONF Capability URNsレジストリの登録ポリシーの変更"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The registration policy for the \"Network Configuration Protocol (NETCONF) Capability URNs\" registry, set up by RFC 6241, has turned out to be unnecessarily strict. This document changes that registration policy to \"IETF Review\", allowing registrations from certain well-reviewed Experimental RFCs, in addition to Standards Track RFCs.",
      "ja": "RFC 6241によって設定された「ネットワーク構成プロトコル（NETCONF）機能URN」レジストリの登録ポリシーは、不必要に厳格であることが判明しています。このドキュメントは、その登録ポリシーを「IETFレビュー」に変更し、Standards Track RFCに加えて、よくレビューされた特定の実験的RFCからの登録を許可します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモは、インターネットの現在のベストプラクティスを文書化したものです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。 BCPの詳細については、RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7803.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7803で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2016 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象であり、この文書の発行日に有効です。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   2\n3.  Security Considerations . . . . . . . . . . . . . . . . . . .   2\n4.  Normative References  . . . . . . . . . . . . . . . . . . . .   3\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .   3",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The \"Network Configuration Protocol (NETCONF) Capability URNs\" registry [RFC6241] was set up with a registration policy of \"Standards Action\" [RFC5226], allowing registrations only from Standards Track RFCs. This provided thorough review of the specifications that are requesting NETCONF Capability URNs. It has turned out to be desirable to allocate capability URNs for certain Experimental RFCs also, provided those specifications are also carefully reviewed. The existing registration policy is, therefore, unnecessarily strict, requiring exception handling by the IESG. This document changes that registration policy to \"IETF Review\", which also allows registrations from certain well-reviewed Experimental RFCs, or, for example, corrections to registry errors from Informational RFCs, with IETF review and consensus.",
      "ja": "\"Network Configuration Protocol（NETCONF）Capability URNs\"レジストリ[RFC6241]は、 \"Standards Action\" [RFC5226]の登録ポリシーで設定され、Standards Track RFCからの登録のみを許可します。これにより、NETCONF機能URNを要求している仕様を徹底的に確認できました。特定の試験的RFCにも機能URNを割り当てることが望ましいことが判明しました。ただし、それらの仕様も慎重に検討されている必要があります。したがって、既存の登録ポリシーは不必要に厳格であり、IESGによる例外処理が必要です。このドキュメントは、その登録ポリシーを「IETFレビュー」に変更します。これにより、よくレビューされた特定の実験的RFCからの登録や、たとえば、情報RFCからのレジストリエラーの修正が、IETFレビューとコンセンサスで許可されます。"
    },
    {
      "indent": 0,
      "text": "2. IANA Considerations",
      "section_title": true,
      "ja": "2. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has changed the registration policy for the \"Network Configuration Protocol (NETCONF) Capability URNs\" registry to \"IETF Review\" and has added this document to the registry's reference field.",
      "ja": "IANAは、「Network Configuration Protocol（NETCONF）Capability URNs」レジストリの登録ポリシーを「IETF Review」に変更し、このドキュメントをレジストリの参照フィールドに追加しました。"
    },
    {
      "indent": 3,
      "text": "Registrations made from RFCs that are not on the Standards Track need to be carefully reviewed through IETF Last Call and in consultation with relevant working groups, such as NETCONF. The Operations and Management Area Directors should confirm that the document has received the appropriate level of review during IESG Evaluation.",
      "ja": "Standards TrackにないRFCから作成された登録は、IETF Last Callを通じて、およびNETCONFなどの関連するワーキンググループと協議して慎重に検討する必要があります。運用管理責任者は、ドキュメントがIESG評価中に適切なレベルのレビューを受けたことを確認する必要があります。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document is purely procedural, and there are no related security considerations.",
      "ja": "このドキュメントは純粋に手続き型であり、関連するセキュリティ上の考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "4. Normative References",
      "section_title": true,
      "ja": "4. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, DOI 10.17487/RFC5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "ja": "[RFC5226] Narten、T。およびH. Alvestrand、「RFCでIANAの考慮事項セクションを作成するためのガイドライン」、BCP 26、RFC 5226、DOI 10.17487 / RFC5226、2008年5月、<http://www.rfc-editor.org / info / rfc5226>。"
    },
    {
      "indent": 3,
      "text": "[RFC6241] Enns, R., Ed., Bjorklund, M., Ed., Schoenwaelder, J., Ed., and A. Bierman, Ed., \"Network Configuration Protocol (NETCONF)\", RFC 6241, DOI 10.17487/RFC6241, June 2011, <http://www.rfc-editor.org/info/rfc6241>.",
      "ja": "[RFC6241] Enns、R。、編、Bjorklund、M。、編、Schoenwaelder、J。、編、およびA. Bierman、編、「Network Configuration Protocol（NETCONF）」、RFC 6241、DOI 10.17487 / RFC6241、2011年6月、<http://www.rfc-editor.org/info/rfc6241>。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Barry Leiba Huawei Technologies",
      "ja": "バリーブレッドファーウェイテクノロジーズ"
    },
    {
      "indent": 3,
      "text": "Phone: +1 646 827 0648\nEmail: barryleiba@computer.org\nURI:   http://internetmessagingtechnology.org/",
      "raw": true,
      "ja": ""
    }
  ]
}