{
  "title": {
    "text": "RFC 7746 - Label Switched Path (LSP) Self-Ping",
    "ja": "RFC 7746 - ラベルスイッチパス（LSP）自己のPing"
  },
  "number": 7746,
  "created_at": "2019-11-01 21:31:38.325545+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         R. Bonica\nRequest for Comments: 7746                              Juniper Networks\nCategory: Standards Track                                       I. Minei\nISSN: 2070-1721                                             Google, Inc.\n                                                                 M. Conn\n                                                              D. Pacella\n                                                             L. Tomotaki\n                                                                 Verizon\n                                                            January 2016",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Label Switched Path (LSP) Self-Ping",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "When certain RSVP-TE optimizations are implemented, ingress Label Switching Router (LSRs) can receive RSVP RESV messages before forwarding state has been installed on all downstream nodes. According to the RSVP-TE specification, the ingress LSR can forward traffic through a Label Switched Path (LSP) as soon as it receives a RESV message. However, if the ingress LSR forwards traffic through the LSP before forwarding state has been installed on all downstream nodes, traffic can be lost.",
      "ja": "特定のRSVP-TEの最適化が実現される場合、状態を転送する前にRSVPのRESVメッセージを受信することができ、入口ラベルスイッチングルータ（LSRには）すべてのダウンストリームノードにインストールされています。 RSVP-TEの仕様によると、入口LSRはすぐにそれがRESVメッセージを受信するとラベルスイッチパス（LSP）を介してトラフィックを転送することができます。状態を転送する前に、LSPを通過するトラフィックを転送イングレスLSRがすべての下流ノードにインストールされている場合は、トラフィックが失われることがあります。"
    },
    {
      "indent": 3,
      "text": "This document describes LSP Self-ping. When an ingress LSR receives an RESV message, it can invoke LSP Self-ping procedures to ensure that forwarding state has been installed on all downstream nodes.",
      "ja": "この文書では、LSP自己のpingを説明しています。入口LSRがRESVメッセージを受信すると、転送状態は、すべての下流ノードにインストールされていることを確認するためにLSP自己ピング・プロシージャを呼び出すことができます。"
    },
    {
      "indent": 3,
      "text": "LSP Self-ping is a new protocol. It is not an extension of LSP Ping. Although LSP Ping and LSP Self-ping are named similarly, each is designed for a unique purpose. Each protocol listens on its own UDP port and executes its own procedures.",
      "ja": "LSP自己のpingは、新しいプロトコルです。これは、LSPのPingの拡張ではありません。 LSP pingとLSP自己のpingは、同様に名前が付けられていますが、それぞれが独自の目的のために設計されています。各プロトコルは独自のUDPポートでリッスンし、独自の手順を実行します。"
    },
    {
      "indent": 3,
      "text": "LSP Self-ping is an extremely lightweight mechanism. It does not consume control-plane resources on transit or egress LSRs.",
      "ja": "LSP自己のpingは、非常に軽量なメカニズムです。これは、トランジットまたは出力LSRの上でコントロールプレーンのリソースを消費しません。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741. Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7746.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。それはhttp://www.rfc-editor.org/infoで入手することができる上、インターネット規格に関する詳細情報は、フィードバックを提供するために、この文書の現在の状態、任意の正誤表、および方法に関するRFC 5741.情報の第2節で利用可能です/ rfc7746。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  Requirements Language . . . . . . . . . . . . . . . . . .   4\n2.  Applicability . . . . . . . . . . . . . . . . . . . . . . . .   4\n3.  The LSP Self-ping Message . . . . . . . . . . . . . . . . . .   6\n4.  LSP Self-Ping Procedures  . . . . . . . . . . . . . . . . . .   7\n5.  Bidirectional LSP Procedures  . . . . . . . . . . . . . . . .   8\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   9\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .   9\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   9\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . .   9\n  8.2.  Informative References  . . . . . . . . . . . . . . . . .  10\nAppendix A.  Rejected Approaches  . . . . . . . . . . . . . . . .  11\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  11\nContributors  . . . . . . . . . . . . . . . . . . . . . . . . . .  12\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  12",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Ingress Label Switching Routers (LSRs) use RSVP-TE [RFC3209] to establish MPLS Label Switched Paths (LSPs). The following paragraphs describe RSVP-TE procedures.",
      "ja": "イングレスラベルスイッチングルータ（LSRの）MPLSラベルを確立するために、RSVP-TE [RFC3209]を使用してスイッチパス（LSP）。次の段落では、RSVP-TEの手順を説明します。"
    },
    {
      "indent": 3,
      "text": "The ingress LSR calculates a path between itself and an egress LSR. The calculated path can be either strictly or loosely routed. Having calculated a path, the ingress LSR constructs an RSVP PATH message. The PATH message includes an Explicit Route Object (ERO) that represents the path between the ingress and egress LSRs.",
      "ja": "入口LSRは、それ自体と出口LSR間の経路を算出します。計算されたパスは、いずれかの厳密または緩くルーティングすることができます。パスを計算した、イングレスLSRは、RSVP PATHメッセージを構築します。 PATHメッセージは、入口と出口LSRs間の経路を表す明示的ルート・オブジェクト（ERO）を含みます。"
    },
    {
      "indent": 3,
      "text": "The ingress LSR forwards the PATH message towards the egress LSR, following the path defined by the ERO. Each transit LSR that receives the PATH message executes admission control procedures. If the transit LSR admits the LSP, it sends the PATH message downstream, to the next node in the ERO.",
      "ja": "入口LSRはEROによって定義されたパスを、以下、出口LSRに向かってPATHメッセージを転送します。 PATHメッセージを受信した各中継LSRは、アドミッション制御手順を実行します。トランジットLSRがLSPを認める場合は、EROの次のノードに、下流PATHメッセージを送信します。"
    },
    {
      "indent": 3,
      "text": "When the egress LSR receives the PATH message, it binds a label to the LSP. The label can be implicit null, explicit null, or non-null. The egress LSR then installs forwarding state (if necessary) and constructs an RSVP RESV message. The RESV message contains a Label Object that includes the label that has been bound to the LSP.",
      "ja": "出口LSRは、PATHメッセージを受信すると、それはLSPにラベルをバインドします。ラベルは暗黙のヌル、明示的ヌル、または非nullにすることができます。出口LSRは、次いで、転送状態をインストールする（必要な場合）とRSVP RESVメッセージを構築します。 RESVメッセージは、LSPにバインドされたラベルが含まれてラベルオブジェクトが含まれています。"
    },
    {
      "indent": 3,
      "text": "The egress LSR sends the RESV message upstream towards the ingress LSR. The RESV message visits the same transit LSRs that the PATH message visited, in reverse order. Each transit LSR binds a label to the LSP, updates its forwarding state, and updates the RESV message. As a result, the Label Object in the RESV message contains the label that has been bound to the LSP most recently. Finally, the transit LSR sends the RESV message upstream, along the reverse path of the LSP.",
      "ja": "出口LSRはイングレスLSRに向けて上流RESVメッセージを送信します。 RESVメッセージは、PATHメッセージは逆の順序で、訪問した同じトランジットのLSRを訪問します。各中継LSRは、その転送状態を更新し、RESVメッセージを更新し、LSPにラベルをバインドします。その結果、RESVメッセージにラベルオブジェクトは、最後にLSPにバインドされたラベルが含まれています。最後に、中継LSRは、LSPの逆の経路に沿って、上流のRESVメッセージを送信します。"
    },
    {
      "indent": 3,
      "text": "When the ingress LSR receives the RESV message, it installs forwarding state. Once the ingress LSR installs forwarding state, it can forward traffic through the LSP.",
      "ja": "入口LSRがRESVメッセージを受信すると、状態を転送インストール。入口LSRは、転送状態をインストールしたら、それはLSPを通過するトラフィックを転送することができます。"
    },
    {
      "indent": 3,
      "text": "Referring to any LSR, RFC 3209 says, \"The node SHOULD be prepared to forward packets carrying the assigned label prior to sending the Resv message.\" However, RFC 3209 does not strictly require this behavior.",
      "ja": "任意LSRを参照すると、RFC 3209「は、ノードがResvメッセージを送信する前に割り当てられたラベルを搬送するパケットを転送するために準備されるべきである。」と言いますしかし、RFC 3209は、厳密には、この動作を必要としません。"
    },
    {
      "indent": 3,
      "text": "Some implementations optimize the above-described procedure by allowing LSRs to send RESV messages before installing forwarding state [RFC6383]. This optimization is desirable, because it allows LSRs to install forwarding state in parallel, thus accelerating the process of LSP signaling and setup. However, this optimization creates a race condition. When the ingress LSR receives a RESV message, some downstream LSRs may have not yet installed forwarding state. If the ingress LSR forwards traffic through the LSP before forwarding state has been installed on all downstream nodes, traffic can be lost.",
      "ja": "いくつかの実装では、LSRのフォワーディング状態[RFC6383]をインストールする前に、RESVメッセージを送信できるようにすることで、上記の手順を最適化します。それはこのようにLSPシグナリングおよびセットアップのプロセスを加速する、のLSRが並列に転送状態をインストールすることを可能にするので、この最適化は、望ましいです。しかし、この最適化は、競合状態を作成します。入口LSRがRESVメッセージを受信すると、いくつかの下流のLSRは、まだ転送状態をインストールしていないかもしれ。状態を転送する前に、LSPを通過するトラフィックを転送イングレスLSRがすべての下流ノードにインストールされている場合は、トラフィックが失われることがあります。"
    },
    {
      "indent": 3,
      "text": "This document describes LSP Self-ping. When an ingress LSR receives an RESV message, it can invoke LSP Self-ping procedures to verify that forwarding state has been installed on all downstream nodes. By verifying the installation of downstream forwarding state, the ingress LSR eliminates this particular cause of traffic loss.",
      "ja": "この文書では、LSP自己のpingを説明しています。入口LSRがRESVメッセージを受信すると、転送状態は、すべての下流ノードにインストールされたことを確認するためにLSP自己ピング・プロシージャを呼び出すことができます。下流の転送状態のインストールを検証することにより、入口LSRは、トラフィック損失のこの特定の原因を排除します。"
    },
    {
      "indent": 3,
      "text": "LSP Self-ping is a new protocol. It is not an extension of LSP Ping [RFC4379]. Although LSP Ping and LSP Self-ping are named similarly, each is designed for a unique purpose. Each protocol listens on its own UDP port and executes its own procedures.",
      "ja": "LSP自己のpingは、新しいプロトコルです。これは、LSPのPing [RFC4379]の拡張ではありません。 LSP pingとLSP自己のpingは、同様に名前が付けられていますが、それぞれが独自の目的のために設計されています。各プロトコルは独自のUDPポートでリッスンし、独自の手順を実行します。"
    },
    {
      "indent": 3,
      "text": "LSP Self-ping is an extremely lightweight mechanism. It does not consume control-plane resources on transit or egress LSRs.",
      "ja": "LSP自己のpingは、非常に軽量なメカニズムです。これは、トランジットまたは出力LSRの上でコントロールプレーンのリソースを消費しません。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "ja": "1.1. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Applicability",
      "section_title": true,
      "ja": "2.適用性"
    },
    {
      "indent": 3,
      "text": "LSP Self-ping is applicable in the following scenario:",
      "ja": "LSP自己のpingは、次のシナリオに適用されます。"
    },
    {
      "indent": 3,
      "text": "o The ingress LSR signals a point-to-point LSP.",
      "ja": "入口oをLSRは、ポイントツーポイントLSPに信号を送ります。"
    },
    {
      "indent": 3,
      "text": "o The ingress LSR receives a RESV message.",
      "ja": "入口oをLSRは、RESVメッセージを受信します。"
    },
    {
      "indent": 3,
      "text": "o The RESV message indicates that all downstream nodes have begun the process of forwarding state installation.",
      "ja": "O RESVメッセージは、すべてのダウンストリームノードが状態のインストールを転送する処理を開始していることを示しています。"
    },
    {
      "indent": 3,
      "text": "o The RESV message does not guarantee that all downstream nodes have completed the process of forwarding state installation.",
      "ja": "O RESVメッセージは、すべての下流ノードが状態のインストールを転送するプロセスを完了していることを保証するものではありません。"
    },
    {
      "indent": 3,
      "text": "o The ingress LSR needs to confirm that all downstream nodes have completed the process for forwarding state installation.",
      "ja": "イングレスoをLSRは、すべての下流ノードが状態のインストールを転送するためのプロセスを完了していることを確認する必要があります。"
    },
    {
      "indent": 3,
      "text": "o The ingress LSR does not need to confirm the correctness of downstream forwarding state, because there is a very high likelihood that downstream forwarding state is correct.",
      "ja": "イングレスoをLSRは、下流の転送状態が正しいことを非常に高い可能性があるので、下流の転送状態の正しさを確認する必要はありません。"
    },
    {
      "indent": 3,
      "text": "o Control-plane resources on the egress LSR may be scarce.",
      "ja": "O出力LSR上のコントロールプレーンのリソースが不足することがあります。"
    },
    {
      "indent": 3,
      "text": "o The need to conserve control-plane resources on the egress LSR outweighs the need to determine whether downstream forwarding state is correct.",
      "ja": "O必要上回る出口LSRにコントロールプレーンのリソースを節約する必要性は、下流転送状態が正しいかどうかを決定します。"
    },
    {
      "indent": 3,
      "text": "Unlike LSP Ping and S-BFD [S-BFD], LSP Self-ping is not a general-purpose MPLS OAM mechanism. It cannot reliably determine whether downstream forwarding state is correct. For example, if a downstream LSR installs a forwarding state that causes an LSP to terminate at the wrong node, LSP Self-ping will not detect an error. In another example, if a downstream LSR erroneously forwards a packet without an MPLS label, LSP Self-ping will not detect an error.",
      "ja": "LSP pingおよびS-BFD [S-BFD]と異なり、LSP自己のpingは、汎用MPLS OAMメカニズムはありません。確実下流転送状態が正しいかどうかを判断することができません。下流LSRがLSPが間違ったノードで終端させる転送状態をインストールする場合、例えば、LSP自己pingがエラーを検出しないであろう。下流LSRが誤っMPLSラベルなしでパケットを転送する場合、別の例では、LSP自己pingがエラーを検出しないであろう。"
    },
    {
      "indent": 3,
      "text": "Furthermore, LSP Self-ping fails when either of the following conditions are true:",
      "ja": "以下の条件のいずれかに該当する場合さらに、LSP自己pingが失敗します。"
    },
    {
      "indent": 3,
      "text": "o The LSP under test is signaled by the Label Distribution Protocol (LDP) Independent Mode [RFC5036].",
      "ja": "試験対象LSP Oがラベル配布プロトコル（LDP）独立モード[RFC5036]によってシグナリングされます。"
    },
    {
      "indent": 3,
      "text": "o Reverse Path Forwarding (RPF) [RFC3704] filters are enabled on links that connect the ingress LSR to the egress LSR.",
      "ja": "Oパス転送（RPF）[RFC3704]のフィルタを逆に出口LSRへの入口LSRを接続するリンク上で有効になっています。"
    },
    {
      "indent": 3,
      "text": "While LSP Ping and S-BFD are general-purpose OAM mechanisms, they are not applicable in the above-described scenario because:",
      "ja": "LSP pingおよびS-BFDは、汎用OAMメカニズムであるが、それらは、上記のシナリオに適用されていないため。"
    },
    {
      "indent": 3,
      "text": "o LSP Ping consumes control-plane resources on the egress LSR.",
      "ja": "O LSP pingは出力LSRにコントロールプレーンのリソースを消費します。"
    },
    {
      "indent": 3,
      "text": "o An S-BFD implementation either consumes control-plane resources on the egress LSR or requires special support for S-BFD on the forwarding plane.",
      "ja": "O S-BFDの実装では、出口LSRにコントロールプレーンのリソースを消費するか、フォワーディングプレーン上のS-BFDのための特別な支援を必要とどちらか。"
    },
    {
      "indent": 3,
      "text": "By contrast, LSP Self-ping requires nothing from the egress LSR beyond the ability to forward an IP datagram.",
      "ja": "これとは対照的に、LSP自己のpingは、IPデータグラムを転送する能力を超えた出力LSRからは何も必要ありません。"
    },
    {
      "indent": 3,
      "text": "LSP Self-ping's purpose is to determine whether forwarding state has been installed on all downstream LSRs. Its primary constraint is to minimize its impact on egress LSR performance. This functionality is valuable during network convergence events that impact a large number of LSPs.",
      "ja": "LSP自己のpingの目的は、転送状態は、すべてのダウンストリームLSRの上にインストールされているかどうかを決定することです。その主な制約は、出口LSRのパフォーマンスへの影響を最小限に抑えることです。この機能は、LSPの大規模な数に影響を与えるネットワークのコンバージェンスイベント中に貴重です。"
    },
    {
      "indent": 3,
      "text": "Therefore, LSP Self-ping is applicable in the scenario described above, where the LSP is signaled by RSVP, RPF is not enabled, and the need to conserve control-plane resources on the egress LSR outweighs the need to determine whether downstream forwarding state is correct.",
      "ja": "したがって、LSP自己pingがRPFが有効になっていない、LSPは、RSVPによって通知され、上述のシナリオに適用可能であり、下流フォワーディング状態であるか否かを決定する必要上回る出口LSRにコントロールプレーンのリソースを節約する必要性正しい。"
    },
    {
      "indent": 0,
      "text": "3. The LSP Self-ping Message",
      "section_title": true,
      "ja": "3. LSP自己のpingメッセージ"
    },
    {
      "indent": 3,
      "text": "The LSP Self-ping Message is a User Datagram Protocol (UDP) [RFC768] packet that encapsulates a session ID. If the RSVP messages used to establish the LSP under test were delivered over IPv4 [RFC791], the UDP datagram MUST be encapsulated in an IPv4 header. If the RSVP messages used to establish the LSP were delivered over IPv6 [RFC2460], the UDP datagram MUST be encapsulated in an IPv6 header.",
      "ja": "LSP自己のpingメッセージは、セッションIDをカプセル化ユーザ・データグラム・プロトコル（UDP）[RFC768]パケットです。被試験LSPを確立するために使用されるRSVPメッセージをIPv4の[RFC791]を介して配信された場合、UDPデータグラムは、IPv4ヘッダーでカプセル化されなければなりません。 LSPを確立するために使用されるRSVPメッセージは、IPv6 [RFC2460]を介して配信された場合、UDPデータグラムは、IPv6ヘッダ内にカプセル化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "In either case:",
      "ja": "どちらの場合にも："
    },
    {
      "indent": 3,
      "text": "o The IP Source Address MAY be configurable. By default, it MUST be the address of the egress LSR.",
      "ja": "O IPソースアドレスが設定可能であってもよいです。デフォルトでは、出力LSRのアドレスであるに違いありません。"
    },
    {
      "indent": 3,
      "text": "o The IP Destination Address MUST be the address of the ingress LSR.",
      "ja": "O IP宛先アドレスは入力LSRのアドレスであるに違いありません。"
    },
    {
      "indent": 3,
      "text": "o The IP Time to Live (TTL) / Hop Count MAY be configurable. By default, it MUST be 255.",
      "ja": "ライブするIP時間（TTL）O /ホップ数が設定可能であってもよいです。デフォルトでは、それは255でなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The IP DSCP (Differentiated Services Code Point) MAY be configurable. By default, it MUST be CS6 (110000) [RFC4594].",
      "ja": "O IP DSCP（DiffServコードポイント）が設定可能です。デフォルトでは、CS6（110000）[RFC4594]でなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The UDP Source Port MUST be selected from the dynamic range (49152-65535) [RFC6335].",
      "ja": "UDPソースポートoをダイナミックレンジ（49152〜65535）[RFC6335]から選択されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The UDP Destination Port MUST be lsp-self-ping (8503) [IANA.PORTS]",
      "ja": "O UDP宛先ポートは、LSP-自己のping（8503）でなければならない[IANA.PORTS]"
    },
    {
      "indent": 3,
      "text": "UDP packet contents have the following format:",
      "ja": "UDPパケットの内容は次の形式を持っています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Session-ID                             |\n|                        (64 bits)                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 27,
      "text": "LSP Self-Ping Message",
      "ja": "LSP自己Pingメッセージ"
    },
    {
      "indent": 3,
      "text": "The Session-ID is a 64-bit field that associates an LSP Self-ping message with an LSP Self-ping session.",
      "ja": "セッションIDは、LSP自己pingセッションとLSP自己pingメッセージを関連付ける64ビットのフィールドです。"
    },
    {
      "indent": 0,
      "text": "4. LSP Self-Ping Procedures",
      "section_title": true,
      "ja": "4. LSP自己Pingの手順"
    },
    {
      "indent": 3,
      "text": "In order to verify that an LSP is ready to carry traffic, the ingress LSR creates a short-lived LSP Self-ping session. All session state is maintained locally on the ingress LSR. Session state includes the following information:",
      "ja": "LSPは、トラフィックを伝送する準備ができていることを確認するために、入口LSRは短命LSP自己pingセッションを作成します。すべてのセッション状態は、入口LSR上でローカルに維持されています。セッション状態は次の情報が含まれます。"
    },
    {
      "indent": 3,
      "text": "o Session-ID: A 64-bit number that identifies the LSP Self-ping session.",
      "ja": "OセッションID：LSP自己pingセッションを識別する64ビット数。"
    },
    {
      "indent": 3,
      "text": "o Retry Counter: The maximum number of times that the ingress LSR probes the LSP before terminating the LSP Self-ping session. The initial value of this variable is determined by configuration.",
      "ja": "Oリトライカウンタ：入口LSRは、LSP自己pingセッションを終了する前にLSPをプローブする最大回数。この変数の初期値を設定することによって決定されます。"
    },
    {
      "indent": 3,
      "text": "o Retry Timer: The number of milliseconds that the LSR waits after probing the LSP. The initial value of this variable is determined by configuration.",
      "ja": "Oリトライタイマー：LSRがLSPをプロービングした後に待機するミリ秒数。この変数の初期値を設定することによって決定されます。"
    },
    {
      "indent": 3,
      "text": "o Status: A boolean variable indicating the completion status of the LSP Self-ping session. The initial value of this variable is FALSE.",
      "ja": "O状態：LSP自己pingセッションの完了ステータスを示すブール変数。この変数の初期値はFALSEです。"
    },
    {
      "indent": 3,
      "text": "Implementations MAY represent the above-mentioned information in any format that is convenient to them.",
      "ja": "実装はそれらに便利な任意の形式で上記の情報を表すことができます。"
    },
    {
      "indent": 3,
      "text": "The ingress LSR executes the following procedure until Status equals TRUE or Retry Counter equals zero:",
      "ja": "ステータスがTRUEと等しいか、リトライカウンタがゼロに等しくなるまで、入口LSRは、次の手順を実行します。"
    },
    {
      "indent": 3,
      "text": "o Format a LSP Self-ping message.",
      "ja": "O LSP自己pingメッセージをフォーマットします。"
    },
    {
      "indent": 3,
      "text": "o Set the Session-ID in the LSP Self-ping message to the Session-ID mentioned above.",
      "ja": "O上記セッションIDにLSP自己pingメッセージにセッションIDを設定します。"
    },
    {
      "indent": 3,
      "text": "o Send the LSP Self-ping message through the LSP under test.",
      "ja": "Oテスト中のLSPを通じてLSP自己pingメッセージを送信します。"
    },
    {
      "indent": 3,
      "text": "o Set a timer to expire in Retry Timer milliseconds.",
      "ja": "Oリトライタイマーミリ秒で期限切れにするタイマーを設定します。"
    },
    {
      "indent": 3,
      "text": "o Wait until either an LSP Self-ping message associated with the session returns or the timer expires. If an LSP Self-ping message associated with the session returns, set Status to TRUE. Otherwise, decrement the Retry Counter. Optionally, increase the value of Retry Timer according to an appropriate back-off algorithm.",
      "ja": "セッションが戻ると関連するLSP自己pingメッセージやタイマーのどちらかの期限が切れるまで、O待ちます。セッションが戻ると関連するLSP自己pingメッセージは、TRUEにステータスを設定した場合。そうでない場合は、再試行カウンタをデクリメントします。必要に応じて、適切なバックオフアルゴリズムに従ってリトライタイマーの値を増加させます。"
    },
    {
      "indent": 3,
      "text": "In the process described above, the ingress LSR addresses an LSP Self-ping message to itself and forwards that message through the LSP under test. If forwarding state has been installed on all downstream LSRs, the egress LSR receives the LSP Self-ping message and determines that it is addressed to the ingress LSR. So, the egress LSR forwards the LSP Self-ping message back to the ingress LSR, exactly as it would forward any other IP packet.",
      "ja": "上述のプロセスでは、入口LSRは、試験下のLSPを介して自身のLSP自己pingメッセージと転送そのメッセージに対処します。フォワーディング状態は、すべての下流のLSRにインストールされている場合は、出口LSRは、LSP自己pingメッセージを受信して​​、それがイングレスLSRにアドレス指定されていることを決定します。そのため、出力LSRは、それが他のIPパケットを転送する場合とまったく同じように、バックイングレスLSRにLSP自己pingメッセージを転送します。"
    },
    {
      "indent": 3,
      "text": "The LSP Self-ping message can arrive at the egress LSR with or without an MPLS header, depending on whether the LSP under test executes penultimate hop-popping procedures. If the LSP Self-ping message arrives at the egress LSR with an MPLS header, the egress LSR removes that header.",
      "ja": "LSP自己ピング・メッセージは、テスト中のLSPは最後から二番目のホップポッピング手順を実行するかどうかに応じて、MPLSヘッダの有無にかかわらず出口LSRに到達することができます。 LSP自己のpingメッセージは、MPLSヘッダと出口LSRに到達する場合、出口LSRは、そのヘッダを除去します。"
    },
    {
      "indent": 3,
      "text": "If the egress LSR's most preferred route to the ingress LSR is through an LSP, the egress LSR forwards the LSP Self-ping message through that LSP. However, if the egress LSR's most preferred route to the ingress LSR is not through an LSP, the egress LSR forwards the LSP Self-ping message without MPLS encapsulation.",
      "ja": "イングレスLSRへの出口LSRの最も好ましい経路は、LSPている場合は、出力LSRは、LSPを通じてLSP自己pingメッセージを転送します。入口LSRに出口LSRの最も好ましい経路は、LSP経由でない場合は、出力LSRは、MPLSカプセル化せずにLSP自己pingメッセージを転送します。"
    },
    {
      "indent": 3,
      "text": "When an LSP Self-ping session terminates, it returns its completion status to the invoking protocol. For example, if RSVP-TE invokes LSP Self-ping as part of the LSP setup procedure, LSP Self-ping returns its completion status to RSVP-TE.",
      "ja": "LSP自己pingセッションが終了すると、それは、呼び出しプロトコルにその完了ステータスを返します。 RSVP-TEは、LSPセットアップ手順の一部として、LSP自己ピングを呼び出した場合、LSP自己のpingは、RSVP-TEのための完了ステータスを返します。"
    },
    {
      "indent": 0,
      "text": "5. Bidirectional LSP Procedures",
      "section_title": true,
      "ja": "5.双方向LSP手続き"
    },
    {
      "indent": 3,
      "text": "A bidirectional LSP has an active side and a passive side. The active side calculates the ERO and signals the LSP in the forward direction. The passive side reverses the ERO and signals the LSP in the reverse direction.",
      "ja": "双方向LSPは、能動側と受動側を有しています。アクティブ側はEROを算出し、順方向LSPに信号を送ります。受動側はEROを反転し、逆方向のLSPを知らせます。"
    },
    {
      "indent": 3,
      "text": "When LSP Self-ping is applied to a bidirectional LSP:",
      "ja": "LSP自己のpingは、双方向のLSPに適用される場合："
    },
    {
      "indent": 3,
      "text": "o The active side calculates the ERO, signals the LSP, and runs LSP Self-ping.",
      "ja": "アクティブ側はEROを算出O、LSPの信号、およびLSP自己のpingを実行します。"
    },
    {
      "indent": 3,
      "text": "o The Passive side reverses the ERO, signals the LSP, and runs another instance of LSP Self-ping.",
      "ja": "パッシブ側はEROを反転O、LSPの信号、およびLSP自己ピングの別のインスタンスを実行します。"
    },
    {
      "indent": 3,
      "text": "o Neither side forwards traffic through the LSP until local LSP Self-ping returns TRUE.",
      "ja": "OローカルLSP自己ピングまでのLSPを通過するトラフィックを転送どちらの側には、TRUEを返します。"
    },
    {
      "indent": 3,
      "text": "The two LSP Self-ping sessions mentioned above are independent of one another. They are not required to have the same Session-ID. Each endpoint can forward traffic through the LSP as soon as its local LSP Self-ping returns TRUE. Endpoints are not required to wait until both LSP Self-ping sessions have returned TRUE.",
      "ja": "上記2 LSP自己のpingセッションは、互いに独立しています。彼らは、同じセッションIDを持つ必要はありません。各エンドポイントは、すぐにそのローカルLSP自己pingがTRUEを返すようLSPを経由してトラフィックを転送することができます。エンドポイントは、両方のLSP自己のpingセッションがTRUEが返されるまで待つ必要はありません。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned UDP Port Number 8503 [IANA.PORTS] for use by MPLS LSP Self-Ping.",
      "ja": "IANAはMPLS LSP自己のPingで使用するために[IANA.PORTS] UDPポート番号8503が割り当てられています。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "LSP Self-ping messages are easily forged. Therefore, an attacker can send the ingress LSR a forged LSP Self-ping message, causing the ingress LSR to terminate the LSP Self-ping session prematurely. In order to mitigate these threats, operators SHOULD filter LSP Self-ping packets at the edges of the MPLS signaling domain. Furthermore, implementations SHOULD NOT assign Session-IDs in a predictable manner. In order to avoid predictability, implementations can leverage a Cryptographically Secure Pseudorandom Number Generator (CSPRNG) [NIST-CSPRNG].",
      "ja": "LSP自己pingメッセージを簡単に偽造されています。したがって、攻撃者は、早期LSP自己pingセッションを終了するために、入口LSRを引き起こし、入口LSRに鍛造LSP自己pingメッセージを送信することができます。これらの脅威を軽減するために、オペレータは、MPLSシグナリングドメインのエッジでLSP自己pingパケットをフィルタリングするべきです。さらに、実装は、予測可能な方法でセッションIDを割り当てないでください。予測可能性を回避するために、実装は、暗号的に安全な擬似乱数生成器（CSPRNG）[NIST-CSPRNG]を活用することができます。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC768] Postel, J., \"User Datagram Protocol\", STD 6, RFC 768, DOI 10.17487/RFC0768, August 1980, <http://www.rfc-editor.org/info/rfc768>.",
      "ja": "[RFC768]ポステル、J.、 \"ユーザ・データグラム・プロトコル\"、STD 6、RFC 768、DOI 10.17487 / RFC0768、1980年8月、<http://www.rfc-editor.org/info/rfc768>。"
    },
    {
      "indent": 3,
      "text": "[RFC791] Postel, J., \"Internet Protocol\", STD 5, RFC 791, DOI 10.17487/RFC0791, September 1981, <http://www.rfc-editor.org/info/rfc791>.",
      "ja": "[RFC791]ポステル、J.、 \"インターネットプロトコル\"、STD 5、RFC 791、DOI 10.17487 / RFC0791、1981年9月、<http://www.rfc-editor.org/info/rfc791>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, DOI 10.17487/RFC2460, December 1998, <http://www.rfc-editor.org/info/rfc2460>.",
      "ja": "[RFC2460]デアリング、S.とR. Hindenと \"インターネットプロトコル、バージョン6（IPv6）の仕様\"、RFC 2460、DOI 10.17487 / RFC2460、1998年12月、<http://www.rfc-editor.org/info/ RFC2460>。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, DOI 10.17487/RFC3209, December 2001, <http://www.rfc-editor.org/info/rfc3209>.",
      "ja": "[RFC3209] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニヴァサン、V.、およびG.ツバメ、 \"RSVP-TE：ExtensionsがLSPトンネルのためのRSVPする\"、RFC 3209、DOI 10.17487 / RFC3209、2001年12月、<http://www.rfc-editor.org/info/rfc3209>。"
    },
    {
      "indent": 3,
      "text": "[RFC3704] Baker, F. and P. Savola, \"Ingress Filtering for Multihomed Networks\", BCP 84, RFC 3704, DOI 10.17487/RFC3704, March 2004, <http://www.rfc-editor.org/info/rfc3704>.",
      "ja": "[RFC3704]ベイカー、F.およびP. Savola、 \"マルチホームネットワークの入力フィルタリング\"、BCP 84、RFC 3704、DOI 10.17487 / RFC3704、2004年3月、<http://www.rfc-editor.org/info/rfc3704 >。"
    },
    {
      "indent": 3,
      "text": "[RFC4379] Kompella, K. and G. Swallow, \"Detecting Multi-Protocol Label Switched (MPLS) Data Plane Failures\", RFC 4379, DOI 10.17487/RFC4379, February 2006, <http://www.rfc-editor.org/info/rfc4379>.",
      "ja": "[RFC4379] Kompella、K.とG.ツバメ、 \"検出マルチプロトコルラベル（MPLS）データプレーン障害のスイッチ\"、RFC 4379、DOI 10.17487 / RFC4379、2006年2月、<http://www.rfc-editor.org /情報/ rfc4379>。"
    },
    {
      "indent": 3,
      "text": "[RFC5036] Andersson, L., Ed., Minei, I., Ed., and B. Thomas, Ed., \"LDP Specification\", RFC 5036, DOI 10.17487/RFC5036, October 2007, <http://www.rfc-editor.org/info/rfc5036>.",
      "ja": "[RFC5036]アンデション、L.、エド、Minei、I.、エド、およびB.トーマス、エド、 \"LDP仕様\"、RFC 5036、DOI 10.17487 / RFC5036、2007年10月、<のhttp：。。。// WWW。 rfc-editor.org/info/rfc5036>。"
    },
    {
      "indent": 3,
      "text": "[RFC6335] Cotton, M., Eggert, L., Touch, J., Westerlund, M., and S. Cheshire, \"Internet Assigned Numbers Authority (IANA) Procedures for the Management of the Service Name and Transport Protocol Port Number Registry\", BCP 165, RFC 6335, DOI 10.17487/RFC6335, August 2011, <http://www.rfc-editor.org/info/rfc6335>.",
      "ja": "[RFC6335]コットン、M.、エッゲルト、L.、タッチ、J.、ウェスター、M.、およびS.チェシャー、「IANA（Internet Assigned Numbers Authority）のサービス名とトランスポートプロトコルポート番号レジストリの管理のための手順」、BCP 165、RFC 6335、DOI 10.17487 / RFC6335、2011年8月、<http://www.rfc-editor.org/info/rfc6335>。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[IANA.PORTS] IANA, \"Service Name and Transport Protocol Port Number Registry\", <http://www.iana.org/assignments/ service-names-port-numbers>.",
      "ja": "[IANA.PORTS] IANA、「サービス名とトランスポートプロトコルポート番号レジストリ」、<http://www.iana.org/assignments/サービス名・ポート番号>。"
    },
    {
      "indent": 3,
      "text": "[NIST-CSPRNG] NIST, \"Recommendation for Random Number Generation Using Deterministic Random Bit Generators\", NIST Special Publication 800-90A, January 2012.",
      "ja": "、は、NIST Special Publication 800-90A、2012年1月[NIST-CSPRNG] NIST、 \"確定的ランダムビットジェネレータを使用して乱数生成のための勧告\"。"
    },
    {
      "indent": 3,
      "text": "[RFC4594] Babiarz, J., Chan, K., and F. Baker, \"Configuration Guidelines for DiffServ Service Classes\", RFC 4594, DOI 10.17487/RFC4594, August 2006, <http://www.rfc-editor.org/info/rfc4594>.",
      "ja": "[RFC4594] Babiarz、J.、チャン、K.、およびF.ベイカー、 \"DiffServのサービスクラスの設定時の注意事項\"、RFC 4594、DOI 10.17487 / RFC4594、2006年8月、<http://www.rfc-editor.org /情報/ rfc4594>。"
    },
    {
      "indent": 3,
      "text": "[RFC6383] Shiomoto, K. and A. Farrel, \"Advice on When It Is Safe to Start Sending Data on Label Switched Paths Established Using RSVP-TE\", RFC 6383, DOI 10.17487/RFC6383, September 2011, <http://www.rfc-editor.org/info/rfc6383>.",
      "ja": "[RFC6383] Shiomoto、K.とA.ファレル、 \"パスがRSVP-TEを使用して確立ラベルスイッチ上でデータの送信を開始するために安全な時期に関するアドバイス\"、RFC 6383、DOI 10.17487 / RFC6383、2011年9月、<のhttp：// www.rfc-editor.org/info/rfc6383>。"
    },
    {
      "indent": 3,
      "text": "[S-BFD] Akiya, N., Pignataro, C., Ward, D., Bhatia, M., and J. Networks, \"Seamless Bidirectional Forwarding Detection (S-BFD)\", Work in Progress, draft-ietf-bfd-seamless-base-05, June 2015.",
      "ja": "[S-BFD]秋谷、N.、Pignataro、C.、区、D.、Bhatiaは、M.、およびJ.ネットワーク、 \"シームレスな双方向フォワーディング検出（S-BFD）\"、進行中で働いて、ドラフトietf- BFD-シームレスベース-05、2015年6月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Rejected Approaches",
      "ja": "付録A.拒否されたアプローチ"
    },
    {
      "indent": 3,
      "text": "In a rejected approach, the ingress LSR uses LSP Ping to verify LSP readiness. This approach was rejected for the following reasons.",
      "ja": "拒否されたアプローチでは、入口LSRは、LSPの準備を確認するために、LSPのPingを使用しています。このアプローチは、次の理由で拒否されました。"
    },
    {
      "indent": 3,
      "text": "While an ingress LSR can control its control-plane overhead due to LSP Ping, an egress LSR has no such control. This is because each ingress LSR can, on its own, control the rate of the LSP Ping originated by the LSR, while an egress LSR must respond to all the LSP Pings originated by various ingresses. Furthermore, when an MPLS Echo Request reaches an egress LSR, it is sent to the control plane of the egress LSR; this makes egress LSR processing overhead of LSP Ping well above the overhead of its data plane (MPLS/IP forwarding). These factors make LSP Ping problematic as a tool for detecting LSP readiness to carry traffic when dealing with a large number of LSPs.",
      "ja": "入口LSRが原因LSP PINGにその制御プレーンオーバーヘッドを制御することができるが、出口LSRは、そのような制御を有していません。各入口LSRは、独自に、出口LSRは、様々なingressesによって発信すべてのLSP pingに応答する必要がありながら、LSPのPingの速度は、LSRによって発信を制御することができるからです。 MPLSエコー要求が出口LSRに達したときに更に、それは出口LSRの制御プレーンに送られます。これはよく、そのデータプレーン（MPLS / IPフォワーディング）のオーバーヘッド上方LSPピングの出口LSR処理オーバーヘッドを行います。これらの要因は、LSPの多数を扱うときにトラフィックを伝送するLSPの準備を検出するためのツールとして、LSPのPingが問題にします。"
    },
    {
      "indent": 3,
      "text": "By contrast, LSP Self-ping does not consume any control-plane resources at the egress LSR, and it relies solely on the data plane of the egress LSR, making it more suitable as a tool for checking LSP readiness when dealing with a large number of LSPs.",
      "ja": "これとは対照的に、LSP自己のpingは、出力LSRで任意のコントロールプレーンのリソースを消費しない、それが多数を扱うときLSPの準備をチェックするためのツールとして、それをより適切なものに、出力LSRのデータプレーンのみに依存していますLSPの。"
    },
    {
      "indent": 3,
      "text": "In another rejected approach, the ingress LSR does not verify LSP readiness. Instead, it sets a timer when it receives an RSVP RESV message and does not forward traffic through the LSP until the timer expires. This approach was rejected because it is impossible to determine the optimal setting for this timer. If the timer value is set too low, it does not prevent black-holing. If the timer value is set too high, it slows down the process of LSP signaling and setup.",
      "ja": "別の拒否のアプローチでは、入口LSRは、LSPの準備状況を検証しません。それはRSVP RESVメッセージを受信して​​、タイマーが切れるまでLSPを経由してトラフィックを転送しない場合に代わりに、タイマーを設定します。このタイマの最適な設定を決定することは不可能であるため、このアプローチが拒否されました。タイマー値の設定が低すぎると、それはブラックホール化を防ぐことはできません。タイマー値が高すぎる設定されている場合、それはLSPシグナリングおよびセットアップのプロセスを遅くします。"
    },
    {
      "indent": 3,
      "text": "Moreover, the above-mentioned timer is configured on a per-router basis. However, its optimum value is determined by a network-wide behavior. Therefore, changes in the network could require changes to the value of the timer, making the optimal setting of this timer a moving target.",
      "ja": "また、上記タイマは毎ルータに基づいて構成されています。しかし、その最適値は、ネットワーク全体の行動によって決定されます。そのため、ネットワークの変化は、このタイマー動く標的の最適な設定を行う、タイマーの値を変更する必要があります。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Yakov Rekhter, Ravi Singh, Eric Rosen, Eric Osborne, Greg Mirsky, and Nobo Akiya for their contributions to this document.",
      "ja": "このドキュメントへの貢献のためのヤコフ・レックター、ラヴィ・シン、エリック・ローゼン、エリック・オズボーン、グレッグMirsky、およびNOBO秋谷に感謝します。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "The following individuals contributed significantly to this document:",
      "ja": "以下の個人は、この文書に大きく貢献しました。"
    },
    {
      "indent": 6,
      "text": "Mark Wygant Verizon mark.wygant@verizon.com",
      "ja": "マークWygantベライゾンmark.wygant@verizon.com"
    },
    {
      "indent": 6,
      "text": "Ravi Torvi Juniper Networks rtorvi@juniper.net",
      "ja": "ラヴィホーンジュニパーネットワークスrtorvi@juniper.net"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ron Bonica Juniper Networks",
      "ja": "ロン・プリティ・ジュニパーネットワークス"
    },
    {
      "indent": 3,
      "text": "Email: rbonica@juniper.net",
      "ja": "メール：rbonica@juniper.net"
    },
    {
      "indent": 3,
      "text": "Ina Minei Google, Inc. 1600 Amphitheatre Parkway Mountain View, CA 94043 United States",
      "ja": "伊那Mineiグーグル株式会社1600アンフィシアターパークウェイマウンテンビュー、CA 94043米国"
    },
    {
      "indent": 3,
      "text": "Email: inaminei@google.com",
      "ja": "メール：inaminei@google.com"
    },
    {
      "indent": 3,
      "text": "Michael Conn Verizon",
      "ja": "マイケル・コネティカットベライゾン"
    },
    {
      "indent": 3,
      "text": "Email: meconn26@gmail.com",
      "ja": "メール：meconn26@gmail.com"
    },
    {
      "indent": 3,
      "text": "Dante Pacella Verizon",
      "ja": "ダンテPacellaベライゾン"
    },
    {
      "indent": 3,
      "text": "Email: dante.j.pacella@verizon.com",
      "ja": "メール：dante.j.pacella@verizon.com"
    },
    {
      "indent": 3,
      "text": "Luis Tomotaki Verizon",
      "ja": "ルイス・Tomotakiベライゾン"
    },
    {
      "indent": 3,
      "text": "Email: luis.tomotaki@verizon.com",
      "ja": "メール：luis.tomotaki@verizon.com"
    }
  ]
}