{
  "title": {
    "text": "RFC 7311 - The Accumulated IGP Metric Attribute for BGP",
    "ja": "RFC 7311 - BGPのための累積IGPメトリック属性"
  },
  "number": 7311,
  "created_at": "2019-10-31 14:38:03.027208+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      P. Mohapatra\nRequest for Comments: 7311                              Sproute Networks\nCategory: Standards Track                                    R. Fernando\nISSN: 2070-1721                                                 E. Rosen\n                                                     Cisco Systems, Inc.\n                                                               J. Uttaro\n                                                                    AT&T\n                                                             August 2014",
      "raw": true
    },
    {
      "indent": 14,
      "text": "The Accumulated IGP Metric Attribute for BGP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Routing protocols that have been designed to run within a single administrative domain (IGPs) generally do so by assigning a metric to each link and then choosing, as the installed path between two nodes, the path for which the total distance (sum of the metric of each link along the path) is minimized. BGP, designed to provide routing over a large number of independent administrative domains (autonomous systems), does not make its path-selection decisions through the use of a metric. It is generally recognized that any attempt to do so would incur significant scalability problems as well as inter-administration coordination problems. However, there are deployments in which a single administration runs several contiguous BGP networks. In such cases, it can be desirable, within that single administrative domain, for BGP to select paths based on a metric, just as an IGP would do. The purpose of this document is to provide a specification for doing so.",
      "ja": "ルーティング単一の管理ドメイン（のIGP）内で実行するように設計されているプロトコル概して2つのノード間のインストールパスとして、各リンクにメトリックを割り当て、次に選択することによってこれを行う、経路の総距離（メトリックの和経路に沿った各リンクの）最小化されます。 BGPは、メトリックの使用により、その経路選択決定を行うない、独立した管理ドメイン（自律システム）の多数にわたってルーティングを提供するように設計されました。一般的にそうしようとするが、重大なスケーラビリティの問題だけでなく、間管理の連携の問題を被ることが認識されています。しかし、単回投与は、いくつかの連続したBGPネットワークを実行する展開があります。 BGPは、IGPが行うのと同じように、メトリックに基づいてパスを選択するためにこのような場合には、それは、その単一の管理ドメイン内で、望ましい可能性があります。このドキュメントの目的は、そのようにするための仕様を提供することです。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7311.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7311で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Specification of Requirements ...................................4\n3. AIGP Attribute ..................................................4\n   3.1. Applicability Restrictions and Cautions ....................6\n   3.2. Handling a Malformed AIGP Attribute ........................6\n   3.3. Restrictions on Sending/Receiving ..........................6\n   3.4. Creating and Modifying the AIGP Attribute ..................7\n        3.4.1. Originating the AIGP Attribute ......................7\n        3.4.2. Modifications by the Originator .....................8\n        3.4.3. Modifications by a Non-Originator ...................8\n4. Decision Process ...............................................10\n   4.1. When a Route Has an AIGP Attribute ........................11\n   4.2. When the Route to the Next Hop Has an AIGP Attribute ......11\n5. Deployment Considerations ......................................12\n6. IANA Considerations ............................................13\n7. Security Considerations ........................................13\n8. Acknowledgments ................................................13\n9. References .....................................................14\n   9.1. Normative Reference .......................................14\n   9.2. Informative References ....................................14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "There are many routing protocols that have been designed to run within a single administrative domain. These are known collectively as \"Interior Gateway Protocols\" (IGPs). Typically, each link is assigned a particular \"metric\" value. The path between two nodes can then be assigned a \"distance\", which is the sum of the metrics of all the links that belong to that path. An IGP selects the \"shortest\" (minimal distance) path between any two nodes, perhaps subject to the constraint that if the IGP provides multiple \"areas\", it may prefer the shortest path within an area to a path that traverses more than one area. Typically, the administration of the network has some routing policy that can be approximated by selecting shortest paths in this way.",
      "ja": "単一の管理ドメイン内で実行するように設計されている多くのルーティングプロトコルがあります。これらは、「内部ゲートウェイプロトコル」（のIGP）として集合的に知られています。典型的には、各リンクは、特定の「メトリック」の値が割り当てられます。 2つのノード間のパスは、そのパスに属するすべてのリンクのメトリックの和である「距離」を割り当てることができます。 IGPは、IGPは、複数の「領域」を提供する場合、それは複数の領域を横切る経路に領域内の最短経路を好むかもしれないという制約におそらく被験者任意の2つのノード間の「最短」（最小距離）パスを選択します。典型的には、ネットワークの投与は、このように最短経路を選択することによって近似することができるいくつかのルーティングポリシーを持っています。"
    },
    {
      "indent": 3,
      "text": "BGP, as distinguished from the IGPs, was designed to run over an arbitrarily large number of administrative domains (\"autonomous systems\" or \"ASes\") with limited coordination among the various administrations. BGP does not make its path-selection decisions based on a metric; there is no such thing as an \"inter-AS metric\". There are two fundamental reasons for this:",
      "ja": "BGPは、のIGPとは区別される、種々の投与間の限られた配位で管理ドメイン（「自律システム」または「のAS」）の任意の多数の上で実行するように設計されました。 BGPは、メトリックに基づいてパス選択決定を下すことはありません。 「インターASメトリック」のようなものはありません。これには二つの基本的な理由があります。"
    },
    {
      "indent": 3,
      "text": "- The distance between two nodes in a common administrative domain may change at any time due to events occurring in that domain. These changes are not propagated around the Internet unless they actually cause the border routers of the domain to select routes with different BGP attributes for some set of address prefixes. This accords with a fundamental principle of scaling, viz., that changes with only local significance must not have global effects. If local changes in distance were always propagated around the Internet, this principle would be violated.",
      "ja": " - 共通の管理ドメイン内の2つのノード間の距離は、そのドメイン内で発生するイベントに起因する任意の時点で変更することができます。彼らは実際には異なるBGPは、アドレスプレフィックスのいくつかのセットの属性を持つルートを選択するために、ドメインの境界ルータを起こさない限り、これらの変更は、インターネットの周りには反映されません。これは、ローカルな意味を持つの変更はグローバルな効果を持っていなければならないことを、スケーリングの基本原則、すなわち。に応じました。距離の局所的な変化は、常にインターネットの周りに伝播された場合は、この原則に違反することでしょう。"
    },
    {
      "indent": 3,
      "text": "- A basic principle of inter-domain routing is that the different administrative domains may have their own policies, which do not have to be revealed to other domains and which certainly do not have to be agreed to by other domains. Yet, the use of an inter-AS metric in the Internet would have exactly these effects.",
      "ja": " - ドメイン間ルーティングの基本的な原理は、異なる管理ドメインが他のドメインに明らかにされている必要はありませんし、これは確かに他のドメインが合意する必要はありません、自分の政策を、持っていることです。しかし、インターネットでのAS間メトリックの使用は、正確にこれらの効果を持っているでしょう。"
    },
    {
      "indent": 3,
      "text": "There are, however, deployments in which a single administration runs a network that has been sub-divided into multiple, contiguous ASes, each running BGP. There are several reasons why a single administrative domain may be broken into several ASes (which, in this case, are not really autonomous.) It may be that the existing IGPs do not scale well in the particular environment; it may be that a more generalized topology is desired than could be obtained by use of a single IGP domain; it may be that a more finely grained routing policy is desired than can be supported by an IGP. In such deployments, it can be useful to allow BGP to make its routing decisions based on the IGP metric, so that BGP chooses the shortest path between two nodes, even if the nodes are in two different ASes within that same administrative domain.",
      "ja": "単回投与は、複数の連続のAS、各実行中のBGPにサブ分割されたネットワークを運営する展開は、しかし、があります。単一の管理ドメインがいくつかのASに分割することができるいくつかの理由がありますそれは、既存のIGPは、特定の環境でうまくスケーリングしていないのかもしれ（この場合には、実際には自律的ではありません。）;それはより一般トポロジが単一IGPドメインを使用することによって得ることができるよりも望ましいことであり得ます。それはより細かく粒状ルーティングポリシーがIGPによってサポートされ得るよりも望ましいことであり得ます。 BGPは、ノードが同じ管理ドメイン内の二つの異なるのASである場合でも、2つのノード間の最短経路を選択するように、そのような展開では、BGPがIGPメトリックに基づいてルーティング決定を行うことが可能にするのに有用であり得ます。"
    },
    {
      "indent": 3,
      "text": "There are, in fact, some implementations that already do something like this, using BGP's MULTI_EXIT_DISC (MED) attribute to carry a value based on IGP metrics. However, that doesn't really provide IGP-like shortest path routing, as the BGP decision process gives priority to other factors, such as the AS_PATH length. Also, the standard procedures for use of the MED do not ensure that the IGP metric is properly accumulated so that it covers all the links along the path.",
      "ja": "すでにこのような何かを、いくつかの実装では、IGPメトリックに基づいて値を運ぶためにBGPのMULTI_EXIT_DISC（MED）属性を使用して、実際には、があります。 BGP決定プロセスは、AS_PATHの長さなどの他の要因、に優先権を与えるようにしかし、それは実際には、IGP状最短パスルーティングを提供しません。また、MEDを使用するための標準的な手順は、それがパスに沿ってすべてのリンクを覆うように、IGPメトリックが適切に蓄積されていることを保証しません。"
    },
    {
      "indent": 3,
      "text": "In this document, we define a new optional, non-transitive BGP attribute, called the \"Accumulated IGP Metric Attribute\", or \"AIGP attribute\", and specify the procedures for using it.",
      "ja": "この文書では、「累積IGPメトリック属性」、または「AIGP属性」と呼ばれる、新しいオプション、非推移BGP属性を定義し、それを使用するための手順を指定します。"
    },
    {
      "indent": 3,
      "text": "The specified procedures prevent the AIGP attribute from \"leaking out\" past an administrative domain boundary into the Internet. We will refer to the set of ASes in a common administrative domain as an \"AIGP administrative domain\".",
      "ja": "指定された手順は、インターネットへの管理ドメインの境界を越えて「漏れ出す」からAIGP属性を防ぎます。私たちは、「AIGP管理ドメイン」のような一般的な管理ドメイン内のASのセットを参照します。"
    },
    {
      "indent": 3,
      "text": "The specified procedures also ensure that the value in the AIGP attribute has been accumulated all along the path from the destination, i.e., that the AIGP attribute does not appear when there are \"gaps\" along the path where the IGP metric is unknown.",
      "ja": "指定された手順はまたAIGP属性の値がIGPメトリックが未知である経路に沿って「ギャップ」が存在する場合AIGP属性が表示されないこと、すなわち、すべての宛先から経路に沿って蓄積されていることを確認してください。"
    },
    {
      "indent": 0,
      "text": "2. Specification of Requirements",
      "section_title": true,
      "ja": "要件の2仕様"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. AIGP Attribute",
      "section_title": true,
      "ja": "3. AIGP属性"
    },
    {
      "indent": 3,
      "text": "The AIGP attribute is an optional, non-transitive BGP path attribute. The attribute type code for the AIGP attribute is 26.",
      "ja": "AIGP属性はオプションで、非推移BGPのパス属性です。 AIGP属性の属性タイプコードは26です。"
    },
    {
      "indent": 3,
      "text": "The value field of the AIGP attribute is defined here to be a set of elements encoded as \"Type/Length/Value\" (i.e., a set of TLVs). Each such TLV is encoded as shown in Figure 1.",
      "ja": "AIGP属性の値フィールドは、「タイプ/長さ/値」（のTLVのすなわち、セット）として符号化要素のセットであることがここで定義されています。図1に示すように、各そのようなTLVが符号化されます。"
    },
    {
      "indent": 4,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |         Length                |               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+               |\n~                                                               ~\n|                           Value                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+..........................",
      "raw": true
    },
    {
      "indent": 27,
      "text": "Figure 1: AIGP TLV",
      "ja": "図1：AIGP TLV"
    },
    {
      "indent": 3,
      "text": "- Type: A single octet encoding the TLV Type. Only type 1, \"AIGP TLV\", is defined in this document. Use of other TLV types is outside the scope of this document.",
      "ja": " - タイプ：TLVタイプをコードする単一オクテット。唯一のタイプ1、「AIGP TLV」は、この文書で定義されています。他のTLVタイプの使用は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "- Length: Two octets encoding the length in octets of the TLV, including the Type and Length fields. The length is encoded as an unsigned binary integer. (Note that the minimum length is 3, indicating that no Value field is present.)",
      "ja": " - 長さ：タイプと長さフィールドを含むTLVのオクテットの長さをコードする2つのオクテット。長さは、符号なし2進整数として符号化されます。 （最小長さが値のフィールドが存在しないことを示し、3であることに注意してください。）"
    },
    {
      "indent": 3,
      "text": "- Value: A field containing zero or more octets.",
      "ja": " - 値：ゼロ以上のオクテットを含むフィールド。"
    },
    {
      "indent": 3,
      "text": "This document defines only a single such TLV, the \"AIGP TLV\". The AIGP TLV is encoded as follows:",
      "ja": "この文書では、単一なTLV、「AIGP TLV」を定義します。次のようにAIGP TLVは、符号化されています："
    },
    {
      "indent": 3,
      "text": "- Type: 1",
      "ja": " - タイプ：1"
    },
    {
      "indent": 3,
      "text": "- Length: 11",
      "ja": " - 長さ：11"
    },
    {
      "indent": 3,
      "text": "- Value: Accumulated IGP Metric.",
      "ja": " - 値：累積IGPメトリック。"
    },
    {
      "indent": 6,
      "text": "The value field of the AIGP TLV is always 8 octets long, and its value is interpreted as an unsigned 64-bit integer. IGP metrics are frequently expressed as 4-octet values. By using an 8-octet field, we ensure that the AIGP attribute can be used to hold the sum of an arbitrary number of 4-octet values.",
      "ja": "AIGP TLVの値フィールドは常に8つのオクテット長であり、その値は、符号なし64ビット整数として解釈されます。 IGPメトリックは、しばしば4オクテット値として表されます。 8オクテットフィールドを使用して、我々はAIGP属性が4オクテットの値の任意の数の和を保持するために使用することができることを確認してください。"
    },
    {
      "indent": 3,
      "text": "When an AIGP attribute is created, it SHOULD contain no more than one AIGP TLV. However, if it contains more than one AIGP TLV, only the first one is used as described in Sections 3.4 and 4. In the remainder of this document, we will use the term \"value of the AIGP TLV\" to mean the value of the first AIGP TLV in the AIGP attribute. Any other AIGP TLVs in the AIGP attribute MUST be passed along unchanged if the AIGP attribute is passed along.",
      "ja": "AIGP属性が作成されると、それは1 AIGP TLVよりも多くを含んではなりません。それは複数のAIGP TLVが含まれている場合は、この文書の残りの部分では、セクション3.4と4で説明したようにしかし、最初のものだけが使用され、私たちは「AIGP TLVの値は、」の値を意味する用語を使用しますAIGP属性の最初のAIGP TLV。 AIGP属性が一緒に渡された場合AIGP属性内の任意の他のAIGP TLVがそのまま渡さなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.1. Applicability Restrictions and Cautions",
      "section_title": true,
      "ja": "3.1. 適用性の制限と注意事項"
    },
    {
      "indent": 3,
      "text": "This document only considers the use of the AIGP attribute in networks where each router uses tunneling of some sort to deliver a packet to its BGP next hop. Use of the AIGP attribute in other scenarios is outside the scope of this document.",
      "ja": "この文書では、各ルータがBGPネクストホップにパケットを届けるために、ある種のトンネリングを使用してネットワークのAIGP属性の使用を考慮しています。他のシナリオでAIGP属性の使用は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "If a Route Reflector supports the AIGP attribute but some of its clients do not, then the routing choices that result may not all reflect the intended routing policy.",
      "ja": "ルートリフレクタはAIGP属性をサポートしていますが、そのクライアントのいくつかは、結果ルーティングの選択肢は、すべての意図したルーティングポリシーを反映していないかもしれません。場合"
    },
    {
      "indent": 0,
      "text": "3.2. Handling a Malformed AIGP Attribute",
      "section_title": true,
      "ja": "3.2. 不正なAIGP属性の取り扱い"
    },
    {
      "indent": 3,
      "text": "When receiving a BGP Update message containing a malformed AIGP attribute, the attribute MUST be treated exactly as if it were an unrecognized non-transitive attribute. That is, it \"MUST be quietly ignored and not passed along to other BGP peers\" (see [BGP], Section 5). This is equivalent to the \"attribute discard\" action specified in [BGP-ERROR].",
      "ja": "不正なAIGP属性を含むBGPアップデートメッセージを受信した場合、それが認識されていない非推移属性であるかのように、属性は正確に処理しなければなりません。つまり、「静かに無視され、他のBGPピアに渡さないでなければならない」（[BGP]、第5節を参照）、です。これは、[BGP-ERROR]で指定された「属性廃棄」アクションに相当します。"
    },
    {
      "indent": 3,
      "text": "Note that an AIGP attribute MUST NOT be considered to be malformed because it contains more than one TLV of a given type or because it contains TLVs of unknown types.",
      "ja": "それは与えられたタイプの複数のTLVが含まれているためか、それが不明なタイプのTLVを含んでいるためAIGP属性が不正していると考えてはいけないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "If a BGP path attribute is received that has the AIGP attribute codepoint but also has the transitive bit set, the attribute MUST be considered to be a malformed AIGP attribute and MUST be discarded as specified in this section.",
      "ja": "BGPパス属性はAIGPはコードポイント属性も推移ビットセットを有しているが受信される場合、属性が不正なAIGP属性であると考えなければならなくて、このセクションで指定されるように捨てなければなりません。"
    },
    {
      "indent": 3,
      "text": "If an AIGP attribute is received and its first AIGP TLV contains the maximum value 0xffffffffffffffff, the attribute SHOULD be considered to be malformed and SHOULD be discarded as specified in this section. (Since the TLV value cannot be increased any further, it is not useful for metric-based path selection.)",
      "ja": "AIGP属性が受信され、その最初のAIGP TLVが最大値0xffffffffffffffffが含まれている場合は、属性が奇形であるとみなされるべきであり、このセクションで指定されるように廃棄されるべきです。 （TLV値がそれ以上大きくすることができないので、メトリックベースの経路選択のために有用ではありません。）"
    },
    {
      "indent": 0,
      "text": "3.3. Restrictions on Sending/Receiving",
      "section_title": true,
      "ja": "3.3. 送信/受信時に制限"
    },
    {
      "indent": 3,
      "text": "An implementation that supports the AIGP attribute MUST support a per-session configuration item, AIGP_SESSION, that indicates whether the attribute is enabled or disabled for use on that session.",
      "ja": "AIGP属性をサポートする実装は、属性を有効にするか、そのセッションで使用するために無効にされているかどうかを示すセッションごとの設定項目、AIGP_SESSIONを、サポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "- For Internal BGP (IBGP) sessions, and for External BGP (EBGP) sessions between members of the same BGP Confederation [BGP-CONFED], the default value of AIGP_SESSION SHOULD be \"enabled\".",
      "ja": " - 、および外部BGP（EBGP）同じBGP連合[BGP-CONFED]のメンバーとの間のセッションのための内部BGP（IBGP）セッションでは、AIGP_SESSIONのデフォルト値が「有効」である必要があります。"
    },
    {
      "indent": 3,
      "text": "- For all other External BGP (EBGP) sessions, the default value of AIGP_SESSION MUST be \"disabled\".",
      "ja": " - 他のすべての外部BGP（EBGP）セッションでは、AIGP_SESSIONのデフォルト値は「無効」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "The AIGP attribute MUST NOT be sent on any BGP session for which AIGP_SESSION is disabled.",
      "ja": "AIGP属性はAIGP_SESSIONが無効になっているすべてのBGPセッションに送ってはいけません。"
    },
    {
      "indent": 3,
      "text": "If an AIGP attribute is received on a BGP session for which AIGP_SESSION is disabled, the attribute MUST be treated exactly as if it were an unrecognized non-transitive attribute. That is, it \"MUST be quietly ignored and not passed along to other BGP peers\" (see [BGP], Section 5). However, the fact that the attribute was received SHOULD be logged (in a rate-limited manner).",
      "ja": "AIGP属性はAIGP_SESSIONが無効になっているBGPセッション上で受信された場合、それは認識されていない非推移属性であるかのように、属性が正確に処理されなければなりません。つまり、「静かに無視され、他のBGPピアに渡さないでなければならない」（[BGP]、第5節を参照）、です。しかし、属性が受信されたという事実は（レート制限された方法で）ログに記録します。"
    },
    {
      "indent": 0,
      "text": "3.4. Creating and Modifying the AIGP Attribute",
      "section_title": true,
      "ja": "3.4.  AIGP属性の作成と変更"
    },
    {
      "indent": 0,
      "text": "3.4.1. Originating the AIGP Attribute",
      "section_title": true,
      "ja": "3.4.1.  AIGP属性を発信"
    },
    {
      "indent": 3,
      "text": "An implementation that supports the AIGP attribute MUST support a configuration item, AIGP_ORIGINATE, that enables or disables its creation and attachment to routes. The default value of AIGP_ORIGINATE MUST be \"disabled\".",
      "ja": "AIGP属性をサポートする実装は、その作成とルートに添付ファイルを有効または無効に設定項目、AIGP_ORIGINATEを、サポートしなければなりません。 AIGP_ORIGINATEのデフォルト値は「無効」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker MUST NOT add the AIGP attribute to any route whose path leads outside the AIGP administrative domain to which the BGP speaker belongs. When the AIGP attribute is used, changes in IGP routing will directly impact BGP routing. Attaching the AIGP attribute to customer routes, Internet routes, or other routes whose paths lead outside the infrastructure of a particular AIGP administrative domain could result in BGP scaling and/or thrashing problems.",
      "ja": "BGPスピーカは、そのパスBGPスピーカが属するAIGP管理ドメインの外につながる任意の経路にAIGP属性を追加してはなりません。 AIGP属性を使用する場合、IGPルーティングの変化が直接BGPルーティングに影響を与えます。顧客のルートを、インターネットルート、またはそのパスの特定のAIGP管理ドメインのインフラ外につながるBGPスケーリングおよび/またはスラッシングの問題が生じる可能性が他のルートにAIGP属性を付けます。"
    },
    {
      "indent": 3,
      "text": "The AIGP attribute may be added only to routes that satisfy one of the following conditions:",
      "ja": "AIGP属性は、次の条件のいずれかを満たす経路に加えてもよいです。"
    },
    {
      "indent": 3,
      "text": "- The route is a static route, not leading outside the AIGP administrative domain, that is being redistributed into BGP;",
      "ja": " - ルートはそれがBGPに再配布され、AIGP管理ドメインの外につながるない、静的なルートです。"
    },
    {
      "indent": 3,
      "text": "- The route is an IGP route that is being redistributed into BGP;",
      "ja": " - ルートがBGPに再配布されているIGP経路です。"
    },
    {
      "indent": 3,
      "text": "- The route is an IBGP-learned route whose AS_PATH attribute is empty; or",
      "ja": " - ルートは、そのAS_PATH属性が空であるIBGP学習ルートがあります。または"
    },
    {
      "indent": 3,
      "text": "- The route is an EBGP-learned route whose AS_PATH contains only ASes that are in the same AIGP administrative domain as the BGP speaker.",
      "ja": " - ルートは、そのAS_PATH BGPスピーカと同じAIGP管理ドメイン内にある唯一のASが含まれていEBGP学習ルートです。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker R MUST NOT add the AIGP attribute to any route for which R does not set itself as the next hop.",
      "ja": "BGPスピーカーRは、Rは、ネクストホップとしての地位を設定しないために任意の経路にAIGP属性を追加してはなりません。"
    },
    {
      "indent": 3,
      "text": "It SHOULD be possible to set AIGP_ORIGINATE to \"enabled for the routes of a particular IGP that are redistributed into BGP\" (where \"a particular IGP\" might be OSPF or IS-IS). Other policies determining when and whether to originate an AIGP attribute are also possible, depending on the needs of a particular deployment scenario.",
      "ja": "「BGPに再配布されている特定のIGPの経路のために有効」（ここで、「特定のIGPは」OSPFまたはIS-ISであるかもしれない）するAIGP_ORIGINATEを設定することが可能であるべきです。 AIGP属性を発信するかどうかを決定する他のポリシーは、特定の展開シナリオのニーズに応じて、また可能です。"
    },
    {
      "indent": 3,
      "text": "When originating an AIGP attribute for a BGP route to address prefix P, the value of the AIGP TLV is set according to policy. There are a number of useful policies, some of which are in the following list:",
      "ja": "プレフィックスPに対処するためにBGPルートのAIGP属性を発信するとき、AIGP TLVの値は、ポリシーに応じて設定されます。以下のリストにあるそのうちのいくつか便利なポリシーの数があります。"
    },
    {
      "indent": 3,
      "text": "- When a BGP speaker R is redistributing into BGP an IGP route to address prefix P, the IGP will have computed a distance from R to P. This distance MAY be assigned as the value of the AIGP TLV.",
      "ja": " -  BGPスピーカRプレフィックスPに対処するためにBGPにIGPルートを再配布する場合には、IGPは、この距離はAIGP TLVの値として割り当てることができるPにRからの距離を計算しているであろう。"
    },
    {
      "indent": 3,
      "text": "- A BGP speaker R may be redistributing into BGP a static route to address prefix P, for which a distance from R to P has been configured. This distance MAY be assigned as the value of the AIGP TLV.",
      "ja": " -  BGPスピーカRがBGPにPにRからの距離が設定されたアドレスプレフィックスPへの静的ルートを再配布することができます。この距離はAIGP TLVの値として割り当ててもよいです。"
    },
    {
      "indent": 3,
      "text": "- A BGP speaker R may have received and installed a BGP-learned route to prefix P, with next hop N. Or it may be redistributing a static route to P, with next hop N. Then:",
      "ja": " -  BGPスピーカRが受信され、PをプレフィックスするBGP-学習経路をインストールしている場合があり、ネクストホップとN.それとも、そして次のホップN.と、Pへの静的ルートを再配布することができます。"
    },
    {
      "indent": 6,
      "text": "* If R has an IGP route to N, the IGP-computed distance from R to N MAY be used as the value of the AIGP TLV of the route to P.",
      "ja": "RがNにIGPルートを持っている場合*、RからNまでIGP計算距離は、Pまでの経路のAIGP TLVの値としてもよいです"
    },
    {
      "indent": 6,
      "text": "* If R has a BGP route to N, and an AIGP TLV attribute value has been computed for that route (see Section 3.4.3), that value MAY be used as the AIGP TLV value of the route to P.",
      "ja": "RがNにBGPルート、およびその経路のために計算されたAIGP TLV属性値を持っている場合*その値は、Pまでの経路のAIGP TLV値として用いることができる（セクション3.4.3参照）"
    },
    {
      "indent": 0,
      "text": "3.4.2. Modifications by the Originator",
      "section_title": true,
      "ja": "3.4.2. 発信者によって変更"
    },
    {
      "indent": 3,
      "text": "If BGP speaker R is the originator of the AIGP attribute of prefix P, and the distance from R to P changes at some point, R SHOULD issue a new BGP update containing the new value of the AIGP TLV of the AIGP attribute. (Here we use the term \"distance\" to refer to whatever value the originator assigns to the AIGP TLV, however it is computed; see Section 3.4.1.) However, if the difference between the new distance and the distance advertised in the AIGP TLV is less than a configurable threshold, the update MAY be suppressed.",
      "ja": "BGPスピーカRは、プレフィックスPのAIGP属性の創始者、およびRからいくつかの点でPまでの距離が変化している場合、RはAIGP属性のAIGP TLVの新しい値を含む新しいBGPアップデートを発行する必要があります。 （ここでは、発信者が、しかし、それが計算され、AIGP TLVに割り当てるどのような値を参照するために、「距離」という用語を使用して、3.4.1項を参照してください。）ただし、新しい距離の違いとの距離がAIGPでアドバタイズ場合TLVが設定可能な閾値未満で、更新を抑制することができます。"
    },
    {
      "indent": 0,
      "text": "3.4.3. Modifications by a Non-Originator",
      "section_title": true,
      "ja": "3.4.3. 非発信者によって変更"
    },
    {
      "indent": 3,
      "text": "Suppose a BGP speaker R1 receives a route with an AIGP attribute whose value is A and with a next hop whose value is R2. Suppose also that R1 is about to redistribute that route on a BGP session that is enabled for sending/receiving the attribute.",
      "ja": "BGPスピーカR1が値Aであり、値R2であるネクストホップとAIGP属性を持つ経路を受信すると仮定する。 R1は、属性を送信/受信のために有効にされたBGPセッション上でそのルートを再配布しようとしていることも想定。"
    },
    {
      "indent": 3,
      "text": "If R1 does not change the next hop of the route, then R1 MUST NOT change the AIGP attribute value of the route.",
      "ja": "R1は、ルートのネクストホップを変更しない場合には、R1は、ルートのAIGP属性値を変更しないでください。"
    },
    {
      "indent": 3,
      "text": "In all the computations discussed in this section, the AIGP value MUST be capped at its maximum unsigned value 0xffffffffffffffff. Increasing the AIGP value MUST NOT cause the value to wrap around.",
      "ja": "このセクションで説明するすべての計算において、AIGP値は、その最大の符号なし値0xffffffffffffffffでキャップされなければなりません。 AIGP値を大きくすると、値がラップアラウンドすることがあってはなりません。"
    },
    {
      "indent": 3,
      "text": "Suppose R1 changes the next hop of the route from R2 to R1. If R1's route to R2 is either (a) an IGP-learned route or (b) a static route that does not require recursive next hop resolution, then R1 MUST increase the value of the AIGP TLV by adding to A the distance from R1 to R2. This distance is either the IGP-computed distance from R1 to R2 or some value determined by policy. However, A MUST be increased by a non-zero amount.",
      "ja": "R1は、R1にR2からの経路の次のホップを変更すると仮定する。 R2へのR1の経路は、（a）は、IGP-学習経路又は再帰ネクストホップ解決を必要としない、（b）は、静的ルートのいずれかである場合、R1はR1からの距離に加えることによってAIGP TLVの値を増やす必要がありますR2。この距離はR1からR2へIGP計算距離またはポリシーによって決定されるいくつかの値のいずれかです。ただし、Aは非ゼロの量によって増加させなければなりません。"
    },
    {
      "indent": 3,
      "text": "It is possible that R1 and R2 above are EBGP neighbors and that there is a direct link between them on which no IGP is running. Then, when R1 changes the next hop of a route from R2 to R1, the AIGP TLV value MUST be increased by a non-zero amount. The amount of the increase SHOULD be such that it is properly comparable to the IGP metrics. For example, if the IGP metric is a function of latency, then the amount of the increase should be a function of the latency from R1 to R2.",
      "ja": "R1とR2は上記EBGP隣接していること、およびIGPが動作していないされているそれらの間の直接のリンクが存在することが可能です。 R1は、R1にR2からの経路の次のホップを変更するときに、AIGP TLV値が非ゼロの量によって増加させなければなりません。増加量は、それがIGPメトリックに適切に匹敵するようなものであるべきです。 IGPメトリックは、待ち時間の関数である場合、例えば、その増加量は、R1からR2までの待ち時間の関数であるべきです。"
    },
    {
      "indent": 3,
      "text": "Suppose R1 changes the next hop of the route from R2 to R1 and R1's route to R2 is either (a) a BGP-learned route or (b) a static route that requires recursive next-hop resolution. Then, the AIGP TLV value needs to be increased in several steps, according to the following procedure. (Note that this procedure is ONLY used when recursive next-hop resolution is needed.)",
      "ja": "R1は、R1にR2からの経路の次のホップを変更し、R2までR1の経路は、（a）は、BGP-学習経路または再帰ネクストホップ解像度を必要と（b）の静的ルートのいずれかであると仮定する。次いで、AIGP TLV値は、以下の手順に従って、いくつかのステップで増加する必要があります。 （再帰ネクストホップ分解能が必要な場合、この手順にのみ使用されることに注意してください。）"
    },
    {
      "indent": 3,
      "text": "1. Let Xattr be the new AIGP TLV value.",
      "section_title": true,
      "ja": "1. xattrのは、新しいAIGP TLV値とします。"
    },
    {
      "indent": 3,
      "text": "2. Initialize Xattr to A.",
      "section_title": true,
      "ja": "A. 2.初期化されるxattr"
    },
    {
      "indent": 3,
      "text": "3. Set XNH to R2.",
      "section_title": true,
      "ja": "3. R2に設定XNH。"
    },
    {
      "indent": 3,
      "text": "4. Find the route to XNH.",
      "section_title": true,
      "ja": "4. XNHへのルートを検索します。"
    },
    {
      "indent": 3,
      "text": "5. If the route to XNH does not require recursive next-hop resolution, get the distance D from R1 to XNH. (Note that this condition cannot be satisfied the first time through this procedure.) If D is above a configurable threshold, set the AIGP TLV value to Xattr+D. If D is below a configurable threshold, set the AIGP TLV value to Xattr. In either case, exit this procedure.",
      "ja": "5. XNHへのルートが再帰ネクストホップ解像度を必要としない場合、R1からXNHまでの距離Dを取得します。 （この条件は、この手順を介して第1の時間を満たすことができないことに留意されたい。）Dが設定閾値を上回る場合、れるxattr + DへAIGP TLV値を設定します。 Dが設定閾値を下回る場合、れるxattrにAIGP TLV値を設定します。いずれの場合も、この手順を終了します。"
    },
    {
      "indent": 3,
      "text": "6. If the route to XNH is a BGP-learned route that does NOT have an AIGP attribute, then exit this procedure and do not pass on any AIGP attribute. If the route has an AIGP attribute without an AIGP TLV, then the AIGP attribute MAY be passed along unchanged.",
      "ja": "6. XNHへのルートがAIGP属性を持たないBGP学習ルートをある場合は、この手順を終了し、任意のAIGP属性に渡すことはありません。ルートはAIGP TLVなしAIGP属性を持っている場合は、AIGP属性はそのままに沿って渡すことができます。"
    },
    {
      "indent": 3,
      "text": "7. If the route to XNH is a BGP-learned route that has an AIGP TLV value of Y, then set Xattr to Xattr+Y and set XNH to the next hop of this route. (The intention here is that Y is the AIGP TLV value of the route as it was received by R1, without having been modified by R1.)",
      "ja": "7. XNHへのルートは、YのAIGP TLV値を有するBGP学習ルートである場合、次いでれるxattr + Yへれるxattrを設定し、この経路の次のホップにXNHを設定。 （ここでの意図は、それがR1によって受信されたようにYがR1によって改変されることなく、経路のAIGP TLV値であることです。）"
    },
    {
      "indent": 3,
      "text": "8. Go to step 4.",
      "section_title": true,
      "ja": "8.ゴー4に進みます。"
    },
    {
      "indent": 3,
      "text": "The AIGP TLV value of a given route depends on (a) the AIGP TLV values of all the next hops that are recursively resolved during this procedure, and (b) the IGP distance to any next hop that is not recursively resolved. Any change due to (a) in any of these values MUST trigger a new AIGP computation for that route. Whether a change due to (b) triggers a new AIGP computation depends upon whether the change in IGP distance exceeds a configurable threshold.",
      "ja": "所与の経路のAIGP TLV値は再帰的に、この手順の間に解決されているすべての次のホップの（A）AIGP TLV値、再帰的に解決されていない任意の次のホップに（B）IGPの距離に依存します。 （a）は、これらの値のいずれかによる任意の変更は、そのルートのための新しいAIGP計算をトリガしなければなりません。 （B）新しいAIGP計算をトリガに起因する変化はIGPの距離の変化が設定閾値を超えているか否かに依存するかどうか。"
    },
    {
      "indent": 3,
      "text": "If the AIGP attribute is carried across several ASes, each with its own IGP domain, it is clear that these procedures are unlikely to give a sensible result if the IGPs are different (e.g., some OSPF and some IS-IS) or if the meaning of the metrics is different in the different IGPs (e.g., if the metric represents bandwidth in some IGP domains but represents latency in others). These procedures also are unlikely to give a sensible result if the metric assigned to inter-AS BGP links (on which no IGP is running) or to static routes is not comparable to the IGP metrics. All such cases are outside the scope of the current document.",
      "ja": "AIGP属性は、いくつかのAS間で実施されている場合は、独自のIGPドメインとのそれぞれが、これらの手順はIGPのが異なる場合（例えば、いくつかのOSPFおよび一部のIS-IS）、または意味があれば賢明な結果を与える可能性が低いことが明らかです（メトリックは、いくつかのIGPドメイン内の帯域幅を表しますが、その他に、待ち時間を表す場合、例えば）メトリックの異なるのIGPで異なっています。 （何IGPが実行されていないれている）間AS BGPリンクまたは静的ルートに割り当てられたメトリックがIGPメトリックと同等でない場合、これらの手順はまた、賢明な結果を与える可能性は低いです。すべてのそのような場合は、現在のドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "4. Decision Process",
      "section_title": true,
      "ja": "4.決定プロセス"
    },
    {
      "indent": 3,
      "text": "Support for the AIGP attribute involves several modifications to the tie-breaking procedures of the BGP \"phase 2\" decision described in [BGP], Section 9.1.2.2. These modifications are described in Sections 4.1 and 4.2.",
      "ja": "AIGP属性のサポートは、[BGP]、セクション9.1.2.2に記載のBGP「フェーズ2」決定のタイブレーク手順にいくつかの修正を含みます。これらの修飾は、セクション4.1および4.2に記載されています。"
    },
    {
      "indent": 3,
      "text": "In some cases, the BGP decision process may install a route without executing any tie-breaking procedures. This may happen, e.g., if only one route to a given prefix has the highest degree of preference (as defined in [BGP], Section 9.1.1). In this case, the AIGP attribute is not considered.",
      "ja": "いくつかのケースでは、BGP決定プロセスは、任意のタイブレーク手順を実行せずにルートをインストールすることができます。 （[BGP]、セクション9.1.1で定義されるように）与えられたプレフィックスへの唯一の経路は、優先度が最も高いを持っている場合、これは、例えば、起こり得ます。この場合、AIGP属性が考慮されていません。"
    },
    {
      "indent": 3,
      "text": "In other cases, some routes may be eliminated before the tie-breaking procedures are invoked, e.g., routes with AS-PATH attributes indicating a loop or routes with unresolvable next hops. In these cases, the AIGP attributes of the eliminated routes are not considered.",
      "ja": "他の場合では、いくつかの経路を除去することができるタイブレーク手順が呼び出される前に、例えば、AS-PATHが解決できない次のホップを有するループまたは経路を示す属性を持つ経路。これらのケースでは、排除ルートのAIGP属性は考慮されません。"
    },
    {
      "indent": 0,
      "text": "4.1. When a Route Has an AIGP Attribute",
      "section_title": true,
      "ja": "4.1. ルートはAIGP属性を持っている場合には"
    },
    {
      "indent": 3,
      "text": "Assuming that the BGP decision process invokes the tie-breaking procedures, the procedures in this section MUST be executed BEFORE any of the tie-breaking procedures described in [BGP], Section 9.1.2.2 are executed.",
      "ja": "[BGP]に記載のタイブレーク手順のいずれかは、セクション9.1.2.2が実行される前に、BGP決定プロセスは、タイブレーク手順を起動すると仮定すると、このセクションの手順を実行しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If any routes have an AIGP attribute containing an AIGP TLV, remove from consideration all routes that do not have an AIGP attribute containing an AIGP TLV.",
      "ja": "どのルートがAIGP TLVを含むAIGP属性を持っている場合は、考慮からAIGP TLVを含むAIGP属性を持たないすべてのルートを削除します。"
    },
    {
      "indent": 3,
      "text": "If router R is considering route T, where T has an AIGP attribute with an AIGP TLV,",
      "ja": "ルータRは、TはAIGP TLVとAIGP属性を持つルートTを、検討している場合は、"
    },
    {
      "indent": 3,
      "text": "- then R must compute the value A, defined as follows: set A to the sum of (a) T's AIGP TLV value and (b) the IGP distance from R to T's next hop.",
      "ja": " - 次いで、Rは、以下のように定義された値Aを計算しなければならない：（A）TのAIGP TLV値とTの次のホップにRから（b）のIGP距離の和に設定されます。"
    },
    {
      "indent": 3,
      "text": "- remove from consideration all routes that are not tied for the lowest value of A.",
      "ja": " - 考慮からA.の最低値のために結ばれていないすべてのルートを削除します"
    },
    {
      "indent": 0,
      "text": "4.2. When the Route to the Next Hop Has an AIGP Attribute",
      "section_title": true,
      "ja": "4.2. ネクストホップへのルートはAIGP属性を持っている場合には"
    },
    {
      "indent": 3,
      "text": "Suppose that a given router R1 is comparing two BGP-learned routes, such that either:",
      "ja": "：指定されたルータR1は、いずれかのその2つのBGP学習ルートを、比較していると仮定"
    },
    {
      "indent": 3,
      "text": "- the two routes have equal AIGP TLV values, or else",
      "ja": " - 二つの経路が等しいAIGP TLV値を有する、あるいは"
    },
    {
      "indent": 3,
      "text": "- neither of the two routes has an AIGP attribute containing an AIGP TLV.",
      "ja": " - 二つの経路のどちらもAIGP TLVを含むAIGP属性を持っています。"
    },
    {
      "indent": 3,
      "text": "The BGP decision process as specified in [BGP] makes use, in its tie-breaking procedures, of \"interior cost\", defined as follows:",
      "ja": "[BGP]で指定されているBGP決定プロセスは、以下のように定義された「内部コスト」、の、そのタイブレークの手順で、使用します："
    },
    {
      "indent": 6,
      "text": "interior cost of a route is determined by calculating the metric to the NEXT_HOP for the route using the Routing Table.",
      "ja": "ルートの内部コストはルーティングテーブルを使用して、ルートのNEXT_HOPにメトリックを計算することによって決定されます。"
    },
    {
      "indent": 3,
      "text": "This document replaces the \"interior cost\" tie breaker of [BGP] with a tie breaker based on the \"AIGP-enhanced interior cost\". Suppose route T has a next hop of N. The \"AIGP-enhanced interior cost\" from node R1 to node N is defined as follows:",
      "ja": "この文書では、「内部コスト」は「AIGP強化内部コスト」に基づき、タイブレーカーで[BGP]のブレーカーを結ぶ置き換えます。仮定する経路Tは、次のようにNのノードにノードR1からNの次のホップ「AIGP強化内部コスト」が定義されています"
    },
    {
      "indent": 3,
      "text": "- Let R2 be the BGP next hop of the route to N after all recursive resolution of the next hop is done. Let m be the IGP distance (or in the case of a static route, the configured distance) from R1 to R2.",
      "ja": " - ネクストホップのすべての再帰的な解決が行われた後、R2がNへのルートのBGPネクストホップとします。 mはR1からR2までIGP距離（または静的ルート、構成距離の場合）とします。"
    },
    {
      "indent": 3,
      "text": "- If the installed route to N has an AIGP attribute with an AIGP TLV, set A to its AIGP TLV value, computed according to the procedure in Section 3.4.3.",
      "ja": " -  NにインストールルートがAIGP TLVとAIGP属性を持っている場合、セクション3.4.3の手順に従って計算され、そのAIGP TLV値に設定。"
    },
    {
      "indent": 3,
      "text": "- If the installed route to N does not have an AIGP attribute with an AIGP TLV, set A to 0.",
      "ja": " -  NへのインストールルートがAIGP TLVとAIGP属性を持っていない場合は、0に設定します。"
    },
    {
      "indent": 3,
      "text": "- The \"AIGP-enhanced interior cost\" of route T is the quantity A+m.",
      "ja": " - 経路Tの「AIGP増強内部コスト」が量A + mです。"
    },
    {
      "indent": 3,
      "text": "The \"interior cost\" tie breaker of [BGP] is then applied, using the \"AIGP-enhanced interior cost\" instead of the \"interior cost\" as defined in [BGP].",
      "ja": "「内部コスト」[BGP]のブレーカを結ぶは、次に[BGP]で定義されるように「AIGP強化内部コスト」の代わりに「内部コスト」を使用して、適用されます。"
    },
    {
      "indent": 0,
      "text": "5. Deployment Considerations",
      "section_title": true,
      "ja": "5.展開の考慮事項"
    },
    {
      "indent": 3,
      "text": "- Using the AIGP attribute to achieve a desired routing policy will be more effective if each BGP speaker can use it to choose from among multiple routes. Thus, it is highly recommended that the procedures of [BESTEXT] and [ADD-PATH] be used in conjunction with the AIGP attribute.",
      "ja": " - 各BGPスピーカは、複数の経路の中から選択するために使用することができた場合に、所望のルーティングポリシーを実現するためにAIGP属性を使用するとより効果的であろう。したがって、非常[BESTEXT]の手順および[ADD-PATH]はAIGP属性と一緒に使用することが推奨されます。"
    },
    {
      "indent": 3,
      "text": "- If a Route Reflector does not pass all paths to its clients, then it will tend to pass the paths for which the IGP distance from the Route Reflector itself to the next hop is smallest. This may result in a non-optimal choice by the clients.",
      "ja": " - ルートリフレクタは、そのクライアントへのすべてのパスを通過しない場合、それは次のホップへのルートリフレクタ自体からIGP距離が最小となる経路を通過する傾向があります。これは、クライアントが非最適な選択になることがあります。"
    },
    {
      "indent": 3,
      "text": "- When the procedures of this document are deployed, it must be understood that frequent changes of the IGP distance towards a certain prefix may result in equally frequent transmission of BGP updates about that prefix.",
      "ja": " - この文書の手順は、展開されている場合、特定のプレフィックスに向けIGP距離の頻繁な変更がその接頭約BGPアップデートの等しく頻繁な送信をもたらすことができることを理解しなければなりません。"
    },
    {
      "indent": 3,
      "text": "- In an IGP deployment, there are certain situations in which a network link may be temporarily assigned a metric whose value is the maximum metric value (or close to the maximum) for that IGP. This is known as \"costing out\" the link. A link may be \"costed out\" to deflect traffic from the link before the link is actually brought down or to discourage traffic from using a link until all the necessary state for that link has been set up (e.g., [LDP-IGP-SYNC]). This assumes, of course, that a path containing a \"costed out\" link will have a total distance that is larger than any alternate path within the same IGP area; in that case, the normal IGP decision process will choose the path that does not contain the \"costed out\" link.",
      "ja": " -  IGP配備では、ネットワークリンクが一時的に値そのIGPの最大メトリック値（又は最大値に近い）であるメトリックを割り当てることのできる特定の状況があります。これは、リンクを「アウトコスト」として知られています。リンクは、実際にダウンしているか、そのリンクのために必要なすべての状態が（例えば、[LDP-IGP-SYNCを設定されるまでのリンクを使用してからのトラフィックを阻止するためにリンクする前にリンクからのトラフィックをそらすために「アウト負けまし」することができます]）。これは「アウト原価計算」リンクを含むパスが同じIGP領域内の任意の代替経路より大きい総距離を有することが、当然のことながら、想定しています。その場合には、通常のIGPの決定プロセスは、「アウト負けまし」のリンクが含まれていないパスを選択します。"
    },
    {
      "indent": 6,
      "text": "Costing out a link will have the same effect on BGP routes that carry the AIGP attribute. The value of the AIGP TLV will be larger for a route (to a given prefix) that contains a \"costed out\" link than for a route (to the same prefix) that does not. It must be understood, though, that a route that carries an AIGP attribute will be preferred to a route that does not, no matter what the value of the AIGP TLV is. This is similar to the behavior in, e.g., an OSPF area, where an intra-area route is preferred to an inter-area or external route, even if the intra-area route's distance is large.",
      "ja": "リンクを原価計算することAIGP属性を運ぶBGPルートで同じ効果があります。 AIGP TLVの値がない（同じプレフィックスへの）ルートのより「アウト負けまし」のリンクが含まれています（指定された接頭辞に）ルートの大きくなります。 AIGP属性を運ぶルートは関係なくAIGP TLVの値が何であるか、ない経路に好まれないこと、しかし、理解されなければなりません。これは、エリア内のルートの距離が大きい場合であっても、エリア内経路がエリア間又は外部経路よりも好ましい例えば、OSPFエリア内の動作と同様です。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned the codepoint 26 in the \"BGP Path Attributes\" registry to the AIGP attribute.",
      "ja": "IANAはAIGP属性にレジストリを「属性BGPパス」内のコードポイント26を割り当てています。"
    },
    {
      "indent": 3,
      "text": "IANA has created a registry for \"BGP AIGP Attribute Types\". The Type field consists of a single octet, with possible values from 1 to 255. (The value 0 is \"Reserved\".) The registration procedure for this registry is \"Standards Action\". Type 1 is defined as \"AIGP\" and refers to this document.",
      "ja": "IANAは、「BGP AIGPは、属性の型」のレジストリを作成しました。 Typeフィールドは、1から255までの可能な値を用いて、単一のオクテットで構成され（値0が「予約」されている。）このレジストリの登録手順を「標準アクション」です。タイプ1は、「AIGP」と定義し、この文書を指しています。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The spurious introduction, through error or malfeasance, of an AIGP attribute could result in the selection of paths other than those desired.",
      "ja": "AIGP属性のエラーまたは違法行為を通るスプリアス導入は、所望のもの以外のパスの選択をもたらし得ます。"
    },
    {
      "indent": 3,
      "text": "Improper configuration on both ends of an EBGP connection could result in an AIGP attribute being passed from one service provider to another. This would likely result in an unsound selection of paths.",
      "ja": "EBGP接続の両端の不適切な設定が別のサービスプロバイダから渡されるAIGP属性につながる可能性があります。これはおそらくパスの不健全な選択をもたらすでしょう。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Waqas Alam, Rajiv Asati, Alia Atlas, Ron Bonica, Bruno Decraene, Brian Dickson, Clarence Filsfils, Sue Hares, Anoop Kapoor, Pratima Kini, Thomas Mangin, Robert Raszuk, Yakov Rekhter, Eric Rosenberg, Samir Saad, John Scudder, Shyam Sethuram, and Ilya Varlashkin for their input.",
      "ja": "著者はWaqasアラム、ラジブAsati、アリアアトラス、ロンBonica、ブルーノDecraene、ブライアン・ディクソン、クラレンスFilsfils、スーノウサギ、アヌープ・カプール、Pratima KINI、トーマス・マンジャン、ロバートRaszuk、ヤコフ・レックター、エリック・ローゼンバーグ、サミール・サアドに感謝したいと思います、ジョン・スカダー、シャムSethuram、およびその入力のためのイリヤVarlashkin。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative Reference",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[BGP] Rekhter, Y., Ed., Li, T., Ed., and S. Hares, Ed., \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, January 2006.",
      "ja": "[BGP] Rekhter、Y.、エド。、李、T.、エド。、およびS.野兎、編、 \"ボーダーゲートウェイプロトコル4（BGP-4）\"、RFC 4271、2006年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[ADD-PATH] Walton, D., Retana, A., Chen, E., and J. Scudder, \"Advertisement of Multiple Paths in BGP\", Work in Progress, October 2013.",
      "ja": "[ADD-PATH]ウォルトン、D.、Retana、A.、チェン、E.、およびJ.スカダー、 \"BGPの複数のパスの広告\"、進歩、2013年10月に働いています。"
    },
    {
      "indent": 3,
      "text": "[BESTEXT] Marques, P., Fernando, R., Mohapatra, P., and H. Gredler, \"Advertisement of the best external route in BGP\", Work in Progress, January 2012.",
      "ja": "[BESTEXT]マルケス、P.、フェルナンド、R.、Mohapatra、P.、およびH. Gredler、 \"BGPで最高の外部ルートの広告\"、進歩、2012年1月での作業。"
    },
    {
      "indent": 3,
      "text": "[BGP-CONFED] Traina, P., McPherson, D., and J. Scudder, \"Autonomous System Confederations for BGP\", RFC 5065, August 2007.",
      "ja": "[BGP-CONFED] Trainaの、P.、マクファーソン、D.、およびJ.スカダー、 \"BGPのための自律システムコンフェデレーション\"、RFC 5065、2007年8月。"
    },
    {
      "indent": 3,
      "text": "[BGP-ERROR] Chen, E., Scudder, J., Mohapatra, P., and K. Patel, \"Revised Error Handling for BGP UPDATE Messages\", Work in Progress, June 2014.",
      "ja": "[BGP-ERROR]チェン、E.、スカダー、J.、Mohapatra、P.、およびK.パテル、 \"BGPのUPDATEメッセージのための処理改訂エラー\"、進歩、2014年6月に作業。"
    },
    {
      "indent": 3,
      "text": "[LDP-IGP-SYNC] Jork, M., Atlas, A., and L. Fang, \"LDP IGP Synchronization\", RFC 5443, March 2009.",
      "ja": "[LDP-IGP-SYNC] Jorkの、M.、アトラス、A.、およびL.牙、 \"LDP IGP同期\"、RFC 5443、2009年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Pradosh Mohapatra Sproute Networks",
      "ja": "Pradosh Mohapatraスプラウトネットワーク"
    },
    {
      "indent": 3,
      "text": "EMail: mpradosh@yahoo.com",
      "ja": "メールアドレス：mpradosh@yahoo.com"
    },
    {
      "indent": 3,
      "text": "Rex Fernando Cisco Systems, Inc. 170 Tasman Drive San Jose, CA 95134 US",
      "ja": "レックスフェルナンドシスコシステムズ社170タスマン・ドライブサンノゼ、CA 95134米国"
    },
    {
      "indent": 3,
      "text": "EMail: rex@cisco.com",
      "ja": "メールアドレス：rex@cisco.com"
    },
    {
      "indent": 3,
      "text": "Eric C. Rosen Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA, 01719 US",
      "ja": "エリックC.ローゼンシスコシステムズ株式会社1414年マサチューセッツアベニューボックスボロー、MA、01719米国"
    },
    {
      "indent": 3,
      "text": "EMail: erosen@cisco.com",
      "ja": "メールアドレス：erosen@cisco.com"
    },
    {
      "indent": 3,
      "text": "James Uttaro AT&T 200 S. Laurel Avenue Middletown, NJ 07748 US",
      "ja": "ジェームズUttaro AT＆T 200 S.ローレルアベニューミドルタウン、NJ 07748米国"
    },
    {
      "indent": 3,
      "text": "EMail: uttaro@att.com",
      "ja": "メールアドレス：uttaro@att.com"
    }
  ]
}