{
  "title": {
    "text": "RFC 7136 - Significance of IPv6 Interface Identifiers",
    "ja": "RFC 7136 - IPv6インタフェース識別子の意義"
  },
  "number": 7136,
  "created_at": "2019-10-29 00:11:57.339771+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      B. Carpenter\nRequest for Comments: 7136                             Univ. of Auckland\nUpdates: 4291                                                   S. Jiang\nCategory: Standards Track                   Huawei Technologies Co., Ltd\nISSN: 2070-1721                                            February 2014",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Significance of IPv6 Interface Identifiers",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The IPv6 addressing architecture includes a unicast interface identifier that is used in the creation of many IPv6 addresses. Interface identifiers are formed by a variety of methods. This document clarifies that the bits in an interface identifier have no meaning and that the entire identifier should be treated as an opaque value. In particular, RFC 4291 defines a method by which the Universal and Group bits of an IEEE link-layer address are mapped into an IPv6 unicast interface identifier. This document clarifies that those two bits are significant only in the process of deriving interface identifiers from an IEEE link-layer address, and it updates RFC 4291 accordingly.",
      "ja": "IPv6のアドレス指定アーキテクチャは、多くのIPv6アドレスの作成に使用されるユニキャストインタフェース識別子を含みます。インタフェース識別子は、種々の方法によって形成されています。この文書では、インターフェース識別子のビットは意味を持たないこと及び全体識別子は不透明な値として扱われるべきであることを明確にしています。特に、RFC 4291は、IEEEリンク層アドレスのユニバーサルグループビットは、IPv6ユニキャストインタフェース識別子にマッピングされる方法を定義します。この文書は、これら2つのビットのみIEEEリンク層アドレスからインタフェース識別子を導出する過程で有意であることを明確にし、それに応じてRFC 4291を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7136.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7136で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n  1.1.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Problem Statement . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Usefulness of the U and G Bits  . . . . . . . . . . . . . . .   5\n4.  The Role of Duplicate Address Detection . . . . . . . . . . .   6\n5.  Clarification of Specifications . . . . . . . . . . . . . . .   6\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   7\n7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7\n8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   8\n9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   8\n  9.1.  Normative References  . . . . . . . . . . . . . . . . . .   8\n  9.2.  Informative References  . . . . . . . . . . . . . . . . .   8",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "IPv6 unicast addresses consist of a prefix followed by an Interface Identifier (IID). The IID is supposed to be unique on the links reached by routing to that prefix, giving an IPv6 address that is unique within the applicable scope (link local or global). According to the IPv6 addressing architecture [RFC4291], when a 64-bit IPv6 unicast IID is formed on the basis of an IEEE EUI-64 address, usually itself expanded from a 48-bit MAC address, a particular format must be used:",
      "ja": "IPv6ユニキャストアドレスは、インタフェース識別子（IID）が続く接頭辞で構成される。 IIDは、適用範囲（ローカルまたはグローバルリンク）内で一意であるIPv6アドレスを与えて、そのプレフィックスにルーティングすることにより、到達したリンク上で一意であることが想定されます。 IPv6のアドレス指定アーキテクチャによれば、64ビットのIPv6ユニキャストIIDは、IEEE EUI-64アドレスに基づいて形成されている[RFC4291]は、通常それ自体が48ビットのMACアドレスから展開、特定のフォーマットを使用しなければなりません。"
    },
    {
      "indent": 6,
      "text": "For all unicast addresses, except those that start with the binary value 000, Interface IDs are required to be 64 bits long and to be constructed in Modified EUI-64 format.",
      "ja": "すべてのユニキャストアドレスの場合、バイナリ値000で始まるものを除いて、インタフェースIDは64ビット長であり、かつ変形EUI-64フォーマットに構築する必要があります。"
    },
    {
      "indent": 3,
      "text": "Thus, the specification assumes that the normal case is to transform an Ethernet-style address into an IID, but, in practice, there are various methods of forming such an IID.",
      "ja": "従って、明細書は、実際に、そのようなIIDを形成する様々な方法があり、通常の場合は、IIDにイーサネット形式のアドレスを変換することであることを前提としていたが、。"
    },
    {
      "indent": 3,
      "text": "The Modified EUI-64 format preserves the information provided by two particular bits in the MAC address:",
      "ja": "変形EUI-64フォーマットは、MACアドレスで2つの特定のビットによって提供される情報を保存します。"
    },
    {
      "indent": 3,
      "text": "o The \"u/l\" bit in a MAC address [IEEE802] is set to 0 to indicate universal scope (implying uniqueness) or to 1 to indicate local scope (without implying uniqueness). In an IID formed from a MAC address, this bit is simply known as the \"u\" bit and its value is inverted, i.e., 1 for universal scope and 0 for local scope. According to [RFC4291] and [RFC7042], the reason for this was to make it easier for network operators to manually configure local-scope IIDs.",
      "ja": "O MACの「U / L」ビットは、アドレス[IEEE802]ユニバーサルスコープを示すために0に設定されている（一意意味）または1（一意意味なし）ローカルスコープを示すために。 MACアドレスから形成されたIIDでは、このビットは単に「U」ビットとして知られており、その値は、すなわち、ユニバーサルスコープの1と0ローカルスコープのため、反転されます。 [RFC4291]と[RFC7042]によると、この理由は、それが簡単にネットワークオペレータが手動でローカルスコープのIIDを設定できるようにすることでした。"
    },
    {
      "indent": 6,
      "text": "In an IID, this bit is in position 6, i.e., position 70 in the complete IPv6 address (when counting from 0).",
      "ja": "IIDでは、このビットは（0から数えて）完全なIPv6アドレスに、すなわち、位置70、位置6です。"
    },
    {
      "indent": 3,
      "text": "o The \"i/g\" bit in a MAC address is set to 1 to indicate group addressing (link-layer multicast). The value of this bit is preserved in an IID, where it is known as the \"g\" bit.",
      "ja": "O MACアドレスの「I / G」ビットはグループアドレッシング（リンク層マルチキャスト）を示すために1に設定されています。このビットの値は、それが「G」ビットとして知られているIID、に保存されています。"
    },
    {
      "indent": 6,
      "text": "In an IID, this bit is in position 7, i.e., position 71 in the complete IPv6 address (when counting from 0).",
      "ja": "IIDでは、このビットは（0から数えて）完全なIPv6アドレスに、すなわち、位置71、位置7にあります。"
    },
    {
      "indent": 3,
      "text": "This document discusses problems observed with the \"u\" and \"g\" bits as a result of the above requirements and the fact that various other methods of forming an IID have been defined independently of the method described in Appendix A of RFC 4291. It then discusses the usefulness of these two bits and the significance of the bits in an IID in general. Finally, it updates RFC 4291 accordingly.",
      "ja": "この文書では、上記の要件の結果として、「U」で観察した問題と「G」のビットを説明し、IIDを形成する種々の他の方法は、それが次いでRFC 4291.の付録Aに記載された方法とは無関係に定義されているという事実これら2つのビットの有用性と一般にIIDのビットの重要性を論じています。最後に、それはRFC 4291に応じて更新します。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Problem Statement",
      "section_title": true,
      "ja": "2.問題文"
    },
    {
      "indent": 3,
      "text": "In addition to IIDs formed from IEEE EUI-64 addresses, various new forms of IIDs have been defined, including temporary addresses [RFC4941], Cryptographically Generated Addresses (CGAs) [RFC3972] [RFC4982], Hash-Based Addresses (HBAs) [RFC5535], and ISATAP addresses [RFC5214]. Other methods have been proposed, such as stable privacy addresses [IID-SLAAC] and mapped addresses for 4rd [SOFTWR-4RD]. In each case, the question of how to set the \"u\" and \"g\" bits has to be decided. For example, RFC 3972 specifies that they are both zero in CGAs, and RFC 4982 describes them as if they were reserved bits. The same applies to HBAs. On the other hand, RFC 4941 specifies that \"u\" must be zero but leaves \"g\" variable.",
      "ja": "IEEE EUI-64アドレスから形成されたIIDに加えて、のIIDの様々な新しい形態は、暗号化生成アドレス（CGAs）、一時アドレス[RFC4941]を含む、定義されている[RFC3972]、[RFC4982]、ハッシュベースのアドレス（のHBA）[RFC5535 ]、およびISATAPアドレス[RFC5214]。他の方法は、安定したプライバシーアドレス[IID-SLAAC]と4RD [SOFTWR-4RD]のためのマッピングされたアドレスとして、提案されています。各場合において、「U」と「G」のビットを設定する方法の問題を決定しなければなりません。例えば、RFC 3972は、彼らがCGAsの両方でゼロであることを指定し、それらはビットを予約しているかのようにRFC 4982はそれらを記述する。同じことは、HBAのに適用されます。一方、RFC 4941には、「u」はゼロでなければならないことを指定しますが、「G」の変数を残します。"
    },
    {
      "indent": 3,
      "text": "The NAT64 addressing format [RFC6052] sets the whole byte containing \"u\" and \"g\" to zero.",
      "ja": "NAT64アドレッシング形式[RFC6052]をゼロに「U」と「G」を含む全バイトを設定します。"
    },
    {
      "indent": 3,
      "text": "Another case where the \"u\" and \"g\" bits are specified is in the Reserved IPv6 Subnet Anycast Address format [RFC2526], which states that \"for interface identifiers in EUI-64 format, the universal/local bit in the interface identifier MUST be set to 0\" (i.e., local) and the \"g\" bit is required to be set to 1. However, the text neither states nor implies any semantics for these bits in anycast addresses.",
      "ja": "「U」と「G」のビットが指定されている別の場合には述べ予約のIPv6サブネットエニーキャストアドレスフォーマット[RFC2526]である「とEUI-64フォーマットのインターフェイス識別子の、インターフェース識別子にする必要があり、ユニバーサル/ローカルビット0\" に設定する（すなわち、ローカル）および 『G』ビットは、しかし、1に設定する必要がある、テキストもない状態をもエニーキャストアドレスでこれらのビットのいずれかの意味を意味します。"
    },
    {
      "indent": 3,
      "text": "A common operational practice for well-known servers is to manually assign a small number as the IID, in which case \"u\" and \"g\" are both zero.",
      "ja": "よく知られているサーバのための共通の動作の練習は、その場合、手動でIIDとして小さい数を割り当てることで、「U」と「G」の両方はゼロです。"
    },
    {
      "indent": 3,
      "text": "These cases illustrate that the statement quoted above from RFC 4291 requiring \"Modified EUI-64 format\" is inapplicable when applied to forms of IID that are not in fact based on an underlying EUI-64 address. In practice, the IETF has chosen to assign some 64-bit IIDs that have nothing to do with EUI-64.",
      "ja": "これらの場合は、下にあるEUI-64アドレスに基づいて、実際にないIIDの形態に適用される場合、「改変EUI-64フォーマット」を必要とするRFC 4291から上記引用文は適用できないことを示します。実際には、IETFは、EUI-64とは何の関係もない、いくつかの64ビットのIIDを割り当てることを選択しました。"
    },
    {
      "indent": 3,
      "text": "A particular case is that of /127 prefixes for point-to-point links between routers, as standardised by [RFC6164]. The addresses on these links are undoubtedly global unicast addresses, but they do not have a 64-bit IID. The bits in the positions named \"u\" and \"g\" in such an IID have no special significance and their values are not specified.",
      "ja": "特定の場合は、その[RFC6164]によって標準化されるようルータ間のポイントツーポイントリンクのための/ 127プレフィックス。これらのリンク上のアドレスは間違いなくグローバルユニキャストアドレスですが、彼らは、64ビットのIIDを持っていません。このようIIDに「U」と「G」という名前の位置のビットは、特別な意味を持っていないし、その値が指定されていません。"
    },
    {
      "indent": 3,
      "text": "Each time a new IID format is proposed, the question arises whether these bits have any meaning. Section 2.2.1 of [RFC7042] discusses the mechanics of the bit allocations but does not explain the purpose or usefulness of these bits in an IID. There is an IANA registry for reserved IID values [RFC5453], but again there is no explanation of the purpose of the \"u\" and \"g\" bits.",
      "ja": "新しいIIDフォーマットが提案されるたびに、問題はこれらのビットはどんな意味を持つかどうかを生じます。 [RFC7042]のセクション2.2.1は、ビット割り当ての仕組みを説明しが、IIDにおけるこれらのビットの目的や有用性を説明していません。予約IID値[RFC5453]のためのIANAレジストリがあり、やはり「U」と「G」ビットの目的の何の説明がありません。"
    },
    {
      "indent": 3,
      "text": "There was a presumption when IPv6 was designed and the IID format was first specified that a universally unique IID might prove to be very useful, for example to contribute to solving the multihoming problem. Indeed, the addressing architecture [RFC4291] states this explicitly:",
      "ja": "IPv6がデザインされたとIID形式は最初の汎用一意IIDは、マルチホーミングの問題の解決に貢献するために、たとえば、非常に有用であることを証明するかもしれないと指定された前提がありました。確かに、アドレス体系[RFC4291]は、明示的にこれを述べました："
    },
    {
      "indent": 6,
      "text": "The use of the universal/local bit in the Modified EUI-64 format identifier is to allow development of future technology that can take advantage of interface identifiers with universal scope.",
      "ja": "変更されたEUI-64フォーマット識別子でユニバーサル/ローカルビットを使用することは、ユニバーサルスコープでインタフェース識別子を利用することができ、将来の技術の開発を可能にすることです。"
    },
    {
      "indent": 3,
      "text": "However, so far, this has not proved to be the case. Also, there is evidence from the field that MAC addresses with universal scope are sometimes assigned to multiple MAC interfaces. There are recurrent reports of manufacturers assigning the same MAC address to multiple devices, and significant reuse of the same virtual MAC address is reported in virtual machine environments. Once transformed into IID format (with \"u\" = 1), these identifiers would purport to be universally unique but would in fact be ambiguous. This has no known harmful effect as long as the replicated MAC addresses and IIDs are used on different layer 2 links. If they are used on the same link, of course there will be a problem, very likely interfering with link-layer transmission. If not, the problem will be detected by duplicate address detection [RFC4862] [RFC6775], but such an error can usually only be resolved by human intervention.",
      "ja": "しかし、これまでのところ、これはそうであることが証明されていません。また、ユニバーサルスコープを持つMACアドレスが、時には複数のMACインターフェースに割り当てられていることをフィールドからの証拠があります。そこ複数のデバイスに同じMACアドレスを割り当てるメーカーの再発の報告があり、同じ仮想MACアドレスの大幅な再利用は、仮想マシン環境で報告されます。 （「U」= 1）IIDのフォーマットに変換されると、これらの識別子は、普遍的に一意であることを主張するだろうが、実際にはあいまいになります。これには、複製MACアドレス限り、有害な影響を知らなかったとのIIDは異なるレイヤ2つのリンクで使用されています。彼らは同じリンク上で使用されている場合は、もちろん非常に可能性の高いリンク層の伝送に干渉し、問題があるでしょう。そうでない場合、問題は、重複アドレス検出[RFC4862] [RFC6775]によって検出されますが、このようなエラーは、通常は人間の介入によって解決することができます。"
    },
    {
      "indent": 3,
      "text": "The conclusion from this is that the \"u\" bit is not a reliable indicator of universal uniqueness.",
      "ja": "これからの結論は、「U」ビットは、ユニバーサル一意の信頼できる指標ではないということです。"
    },
    {
      "indent": 3,
      "text": "We note that Identifier-Locator Network Protocol (ILNP), a multihoming solution that might be expected to benefit from universally unique IIDs in modified EUI-64 format, does not in fact rely on them. ILNP uses its own format defined as a Node Identifier [RFC6741]. ILNP has the constraint that a given Node Identifier must be unique within the context of a given Locator (i.e., within a single given IPv6 subnetwork). As we have just shown, the state of the \"u\" bit does not in any way guarantee such uniqueness, but duplicate address detection is available.",
      "ja": "私たちは、識別子ロケータネットワークプロトコル（ILNP）、修正EUI-64形式の汎用一意のIIDの恩恵を受けると予想されるマルチホーミングソリューションは、実際にそれらに依存しないことに注意してください。 ILNPは、ノード識別子[RFC6741]として定義される独自のフォーマットを使用します。 ILNPは、与えられたノード識別子（すなわち、単一の所与のIPv6サブネットワーク内の）指定されたロケータのコンテキスト内で一意でなければならないという制約があります。私たちがちょうど示したように、「U」ビットの状態は、どのような方法保証などユニークさではないが、重複アドレス検出が可能です。"
    },
    {
      "indent": 3,
      "text": "Thus, we can conclude that the value of the \"u\" bit in IIDs has no particular meaning. In the case of an IID created from a MAC address according to RFC 4291, its value is determined by the MAC address, but that is all.",
      "ja": "したがって、我々は、IIDを中に「U」ビットの値は特に意味を持たないと結論付けることができます。 RFC 4291によれば、MACアドレスから作成されたIIDの場合、その値は、MACアドレスによって決定され、それはすべてです。"
    },
    {
      "indent": 3,
      "text": "An IPv6 IID should not be created from a MAC group address, so the \"g\" bit will normally be zero. But, this value also has no particular meaning. Additionally, the \"u\" and the \"g\" bits are both meaningless in the format of an IPv6 multicast group ID [RFC3306] [RFC3307].",
      "ja": "IPv6のIIDは、MACグループアドレスから作成されるべきではないので、「G」ビットは、通常はゼロとなります。しかし、この値も特に意味はありません。また、「U」と「G」のビットが両方のIPv6マルチキャストグループID [RFC3306]、[RFC3307]の形式で無意味です。"
    },
    {
      "indent": 3,
      "text": "None of the above implies that there is a problem with using the \"u\" and \"g\" bits in MAC addresses as part of the process of generating IIDs from MAC addresses, or with specifying their values in other methods of generating IIDs. What it does imply is that after an IID is generated by any method, no reliable deductions can be made from the state of the \"u\" and \"g\" bits; in other words, these bits have no useful semantics in an IID.",
      "ja": "上記のいずれも、MACアドレスからのIIDを生成するプロセスの一部として、またはのIIDを生成する他の方法でその値を指定してMACアドレスに「U」と「G」ビットを使用に問題があることを意味しません。それは何を意味するものでないことはIIDは、任意の方法によって生成された後、信頼できる控除は「U」と「G」ビットの状態から作製することができないということです。言い換えれば、これらのビットは、IIDでは有用な意味を持っていません。"
    },
    {
      "indent": 3,
      "text": "Once this is recognised, we can avoid the problematic confusion caused by these bits each time that a new form of IID is proposed.",
      "ja": "これが認識されると、我々はこれらのビットIIDの新しい形を提案するたびに起因する問題の混乱を避けることができます。"
    },
    {
      "indent": 0,
      "text": "3. Usefulness of the U and G Bits",
      "section_title": true,
      "ja": "UおよびGビットの3有用"
    },
    {
      "indent": 3,
      "text": "Given that the \"u\" and \"g\" bits do not have a reliable meaning in an IID, it is relevant to consider what usefulness they do have.",
      "ja": "「U」と「G」のビットがIIDで信頼性の意味を持っていないことを考えると、彼らが持っていないものを有用性を検討することが適切です。"
    },
    {
      "indent": 3,
      "text": "If an IID is known or guessed to have been created according to [RFC4291], it could be transformed back into a MAC address. This can be very helpful during operational fault diagnosis. For that reason, mapping the IEEE \"u\" and \"g\" bits into the IID has operational usefulness. However, it should be stressed that an IID with \"u\" = 1 and \"g\" = 0 might not be formed from a MAC address; on the contrary, it might equally result from another method. With other methods, there is no reverse transformation available.",
      "ja": "IIDが知られているか、または[RFC4291]に基づいて作成されたものと推測されている場合は、それがバックMACアドレスに変換することができます。これは、動作故障診断時に非常に役に立ちます。そのため、IIDにIEEE「U」と「G」のビットをマッピングする動作有用性を有します。しかし、「U」のIID = 1及び「G」= 0 MACアドレスから形成されない可能性があることを強調すべきです。逆に、それは同じように他の方法に起因する可能性があります。他の方法では、利用可能な逆変換はありません。"
    },
    {
      "indent": 3,
      "text": "Given that the values of the \"u\" and \"g\" bits in an IID have no particular meaning, new methods of IID formation are at liberty to use them as they wish, for example, as additional pseudo-random bits to reduce the chances of duplicate IIDs.",
      "ja": "IIDの「U」の値と「G」のビットは特段の意味を持たないことを考えると、IID形成の新しい方法は、彼らが、たとえば、望むように可能性を減らすために、追加の疑似ランダムビットとして、それらを使用するために自由です重複したIIDの。"
    },
    {
      "indent": 0,
      "text": "4. The Role of Duplicate Address Detection",
      "section_title": true,
      "ja": "4.重複アドレス検出の役割"
    },
    {
      "indent": 3,
      "text": "As mentioned above, Duplicate Address Detection (DAD) [RFC4862] is able to detect any case where a collision of two IIDs on the same link leads to a duplicated IPv6 address. The scope of DAD may be extended to a set of links by a DAD proxy [RFC6957] or by Neighbor Discovery Optimization [RFC6775]. Since DAD is mandatory for all nodes, there will be almost no case in which an IID collision, however unlikely it may be, is not detected. It is out of scope of most existing specifications to define the recovery action after a DAD failure, which is an implementation issue. If a manually created IID, or an IID derived from a MAC address according to RFC 4291, leads to a DAD failure, human intervention will most likely be required. However, as mentioned above, some methods of IID formation might produce IID values with \"u\" = 1 and \"g\" = 0 that are not based on a MAC address. With very low probability, such a value might collide with an IID based on a MAC address.",
      "ja": "上述したように、重複検出（DAD）[RFC4862]同じリンク上の2つのIIDの衝突が重複IPv6アドレスをもたらすいずれの場合を検出することができるアドレス。 DADの範囲は、DADプロキシ[RFC6957]によって、または近隣探索の最適化[RFC6775]でリンクのセットに拡張することができます。 DADがすべてのノードのために必須であるため、IID衝突は、それがあってもよいが低い、検出されないほとんどない場合があります。これは、実装の問題であるDAD障害、後の回復アクションを定義するために、ほとんどの既存の仕様の範囲外です。手動で作成IID、またはRFC 4291に従ったMACアドレスから派生IIDは、DADの故障につながる場合には、人間の介入は、おそらく必要になります。しかしながら、上述したように、IID形成のいくつかの方法は、「U」= 1及びMACアドレスに基づいていない「G」= 0とIIDの値を生成するかもしれません。非常に低い確率で、そのような値は、MACアドレスに基づいて、IIDと衝突する可能性があります。"
    },
    {
      "indent": 3,
      "text": "As stated in RFC 4862:",
      "ja": "RFC 4862に記載されているように："
    },
    {
      "indent": 6,
      "text": "On the other hand, if the duplicate link-local address is not formed from an interface identifier based on the hardware address, which is supposed to be uniquely assigned, IP operation on the interface MAY be continued.",
      "ja": "重複したリンクローカルアドレスが一意に割り当てられることになっているハードウェア・アドレスに基づいて、インタフェース識別子から形成されていない一方、インターフェイス上のIP動作を継続してもよいです。"
    },
    {
      "indent": 3,
      "text": "Continued operation is only possible if a new IID is created. The best procedure to follow for this will depend on the IID formation method in use. For example, if an IID is formed by a pseudo-random process, that process could simply be repeated.",
      "ja": "新しいIIDが作成された場合に継続的操作のみ可能です。このために従うべき最善の手順は、使用中のIID形成方法に依存します。 IIDは、擬似ランダムプロセスによって形成されている場合、そのプロセスは単純に繰り返すことができます。"
    },
    {
      "indent": 0,
      "text": "5. Clarification of Specifications",
      "section_title": true,
      "ja": "仕様の明確化5。"
    },
    {
      "indent": 3,
      "text": "This section describes clarifications to the IPv6 specifications that result from the above discussion.",
      "ja": "このセクションでは、上記の議論から生じるIPv6の仕様に明確化について説明しています。"
    },
    {
      "indent": 3,
      "text": "The EUI-64 to IID transformation defined in the IPv6 addressing architecture [RFC4291] MUST be used for all cases where an IPv6 IID is derived from an IEEE MAC or EUI-64 address. With any other form of link-layer address, an equivalent transformation SHOULD be used.",
      "ja": "EUI-64 IIDへの変換アーキテクチャ[RFC4291]をIPv6アドレスで定義さは、IPv6 IIDは、IEEE MACまたはEUI-64アドレスから導出されるすべての場合に使用しなければなりません。リンク層アドレスの任意の他の形態で、等価変換を使用すべきです。"
    },
    {
      "indent": 3,
      "text": "Specifications of other forms of 64-bit IIDs MUST specify how all 64 bits are set, but a generic semantic meaning for the \"u\" and \"g\" bits MUST NOT be defined. However, the method of generating IIDs for specific link types MAY define some local significance for certain bits.",
      "ja": "64ビットのIIDの他の形態の仕様はすべて64ビットが設定されている方法を指定する必要がありますが、「U」と「G」のビットのための一般的な意味論的な意味を定義してはなりません。しかし、特定のリンクタイプのためのIIDを生成する方法は、特定のビットのためのいくつかのローカルの意味を定義することができます。"
    },
    {
      "indent": 3,
      "text": "In all cases, the bits in an IID have no generic semantics; in other words, they have opaque values. In fact, the whole IID value MUST be viewed as an opaque bit string by third parties, except possibly in the local context.",
      "ja": "すべての場合において、IID内のビットには、一般的な意味を持っていません。言い換えれば、彼らは不透明な値を持っています。実際には、全体のIID値は、おそらくローカルコンテキストを除き、第三者による不透明なビット列として見なければなりません。"
    },
    {
      "indent": 3,
      "text": "The following statement in Section 2.5.1 of the IPv6 addressing architecture [RFC4291]:",
      "ja": "IPv6のアドレス体系の第2.5.1項で、次の文[RFC4291]："
    },
    {
      "indent": 6,
      "text": "For all unicast addresses, except those that start with the binary value 000, Interface IDs are required to be 64 bits long and to be constructed in Modified EUI-64 format.",
      "ja": "すべてのユニキャストアドレスの場合、バイナリ値000で始まるものを除いて、インタフェースIDは64ビット長であり、かつ変形EUI-64フォーマットに構築する必要があります。"
    },
    {
      "indent": 3,
      "text": "is replaced by:",
      "ja": "によって置き換えられます。"
    },
    {
      "indent": 6,
      "text": "For all unicast addresses, except those that start with the binary value 000, Interface IDs are required to be 64 bits long. If derived from an IEEE MAC-layer address, they must be constructed in Modified EUI-64 format.",
      "ja": "すべてのユニキャストアドレスの場合、バイナリ値000で始まるものを除いて、インタフェースIDは64ビット長であることが要求されています。 IEEE MAC層アドレスから派生した場合、それらは変形EUI-64フォーマットで構築されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The following statement in Section 2.5.1 of the IPv6 addressing architecture [RFC4291] is obsoleted:",
      "ja": "IPv6のアドレス体系[RFC4291]のセクション2.5.1に次の文が廃止されています。"
    },
    {
      "indent": 6,
      "text": "The use of the universal/local bit in the Modified EUI-64 format identifier is to allow development of future technology that can take advantage of interface identifiers with universal scope.",
      "ja": "変更されたEUI-64フォーマット識別子でユニバーサル/ローカルビットを使用することは、ユニバーサルスコープでインタフェース識別子を利用することができ、将来の技術の開発を可能にすることです。"
    },
    {
      "indent": 3,
      "text": "As far as is known, no existing implementation will be affected by these changes. The benefit is that future design discussions are simplified.",
      "ja": "知られている限り、既存の実装では、これらの変更によって影響を受けることはありません。利点は、将来の設計の議論を単純化していることです。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "No new security exposures or issues are raised by this document.",
      "ja": "新しいセキュリティ・エクスポージャーや問題は、この文書で提起さ​​れていません。"
    },
    {
      "indent": 3,
      "text": "In some contexts, unpredictable IID values are considered beneficial to enhance privacy and defeat scanning attacks. The recognition that the IID value should be regarded as an opaque bit string is consistent with methods of IID formation that result in unpredictable, pseudo-random values.",
      "ja": "いくつかの状況では、予測不可能なIID値は、プライバシーと敗北スキャン攻撃を強化するために有益であると考えています。 IID値は、不透明なビット列と見なされるべきであるという認識は予測不可能な、擬似ランダム値になるIID形成の方法と一致しています。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document requests no immediate action by IANA. However, the following should be noted when considering any future proposed addition to the registry of reserved IID values, which requires Standards Action [RFC5226] according to [RFC5453].",
      "ja": "この文書は、IANAによって即時アクションを要求しません。 [RFC5453]に記載の標準アクション[RFC5226]を必要予約IID値のレジストリに加えを提案しかし、将来を考慮するとき、以下が留意されるべきです。"
    },
    {
      "indent": 3,
      "text": "Full deployment of a new reserved IID value would require updates to IID generation code in every deployed IPv6 stack, so the technical justification for such a Standards Action would need to be extremely strong.",
      "ja": "そのような標準アクションのための技術的な正当性が非常に強いことが必要となるように、新しい予約IID値の完全な展開は、すべての展開IPv6スタックにおけるIID生成コードの更新が必要となります。"
    },
    {
      "indent": 3,
      "text": "The preceding sentence and a reference to this document have been added to the \"Reserved IPv6 Interface Identifiers\" registry.",
      "ja": "前の文と、このドキュメントを参照するには、「予約済みIPv6インタフェース識別子」レジストリに追加されました。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "Valuable comments were received from Ran Atkinson, Remi Despres, Ralph Droms, Fernando Gont, Eric Gray, Brian Haberman, Joel Halpern, Bob Hinden, Christian Huitema, Ray Hunter, Tatuya Jinmei, Roger Jorgensen, Mark Smith, Bernie Volz, and other participants in the 6MAN working group.",
      "ja": "貴重なコメントは蘭アトキンソン、レミ・デプレ、ラルフDroms、フェルナンドGont、エリックグレー、ブライアンハーバーマン、ジョエル・ハルパーン、ボブHindenとクリスチャンのHuitema、レイ・ハンター、達也神明、ロジャー・ヨルゲンセン、マーク・スミス、バーニーフォルツ、および他の参加者から受信し、 6MANワーキンググループインチ"
    },
    {
      "indent": 3,
      "text": "Brian Carpenter was a visitor at the Computer Laboratory, Cambridge University during part of this work.",
      "ja": "ブライアン・カーペンターは、この作品の一部の間にコンピュータ研究所、ケンブリッジ大学の訪問者でした。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4291] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 4291, February 2006.",
      "ja": "[RFC4291] HindenとR.とS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 4291、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC4862] Thomson, S., Narten, T., and T. Jinmei, \"IPv6 Stateless Address Autoconfiguration\", RFC 4862, September 2007.",
      "ja": "[RFC4862]トムソン、S.、Narten氏、T.、およびT.神明、 \"IPv6のステートレスアドレス自動設定\"、RFC 4862、2007年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5453] Krishnan, S., \"Reserved IPv6 Interface Identifiers\", RFC 5453, February 2009.",
      "ja": "[RFC5453]クリシュナン、S.、 \"予約済みIPv6インタフェース識別子\"、RFC 5453、2009年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC7042] Eastlake, D. and J. Abley, \"IANA Considerations and IETF Protocol and Documentation Usage for IEEE 802 Parameters\", BCP 141, RFC 7042, October 2013.",
      "ja": "[RFC7042]イーストレーク、D.およびJ. Abley、 \"IEEE 802個のパラメータのIANAの考慮事項とIETFプロトコルとマニュアル使用方法\"、BCP 141、RFC 7042、2013年10月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[IEEE802] \"IEEE Standard for Local and Metropolitan Area Networks: Overview and Architecture\", IEEE Std 802-2001 (R2007), 2007.",
      "ja": "[IEEE802] \"ローカルおよびメトロポリタンエリアネットワークのIEEE標準：概要とアーキテクチャ\"、IEEE規格802-2001（R2007）、2007。"
    },
    {
      "indent": 3,
      "text": "[IID-SLAAC] Gont, F., \"A method for Generating Stable Privacy-Enhanced Addresses with IPv6 Stateless Address Autoconfiguration (SLAAC)\", Work in Progress, March 2012.",
      "ja": "[IID-SLAAC] Gont、F.、進歩、2012年3月で、仕事の \"IPv6ステートレスアドレス自動設定（SLAAC）で安定したプライバシー・強化されたアドレスを生成するための方法\"。"
    },
    {
      "indent": 3,
      "text": "[RFC2526] Johnson, D. and S. Deering, \"Reserved IPv6 Subnet Anycast Addresses\", RFC 2526, March 1999.",
      "ja": "[RFC2526]ジョンソン、D.とS.デアリング、 \"予約済みのIPv6サブネットエニーキャストアドレス\"、RFC 2526、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3306] Haberman, B. and D. Thaler, \"Unicast-Prefix-based IPv6 Multicast Addresses\", RFC 3306, August 2002.",
      "ja": "[RFC3306]ハーバーマン、B.とD.ターラー、 \"ユニキャストプレフィックスベースのIPv6マルチキャストアドレス\"、RFC 3306、2002年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3307] Haberman, B., \"Allocation Guidelines for IPv6 Multicast Addresses\", RFC 3307, August 2002.",
      "ja": "[RFC3307]ハーバーマン、B.、 \"IPv6マルチキャストアドレスの割り当てに関するガイドライン\"、RFC 3307、2002年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3972] Aura, T., \"Cryptographically Generated Addresses (CGA)\", RFC 3972, March 2005.",
      "ja": "[RFC3972]オーラ、T.、 \"暗号的に生成されたアドレス（CGA）\"、RFC 3972、2005年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4941] Narten, T., Draves, R., and S. Krishnan, \"Privacy Extensions for Stateless Address Autoconfiguration in IPv6\", RFC 4941, September 2007.",
      "ja": "[RFC4941] Narten氏、T.、Draves、R.、およびS.クリシュナン、 \"IPv6におけるステートレスアドレス自動設定のための個人情報保護の拡張\"、RFC 4941、2007年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4982] Bagnulo, M. and J. Arkko, \"Support for Multiple Hash Algorithms in Cryptographically Generated Addresses (CGAs)\", RFC 4982, July 2007.",
      "ja": "[RFC4982] Bagnulo、M.及びJ. Arkko、 \"暗号化生成アドレス（CGAs）の複数のハッシュアルゴリズムのサポート\"、RFC 4982、2007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5214] Templin, F., Gleeson, T., and D. Thaler, \"Intra-Site Automatic Tunnel Addressing Protocol (ISATAP)\", RFC 5214, March 2008.",
      "ja": "[RFC5214]テンプリン、F.、グリーソン、T.、およびD.ターラーは、 \"イントラサイト自動トンネルは、プロトコル（ISATAP）をアドレス指定\"、RFC 5214、2008年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5535] Bagnulo, M., \"Hash-Based Addresses (HBA)\", RFC 5535, June 2009.",
      "ja": "[RFC5535] Bagnulo、M.、 \"ハッシュベースアドレス（HBA）\"、RFC 5535、2009年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC6052] Bao, C., Huitema, C., Bagnulo, M., Boucadair, M., and X. Li, \"IPv6 Addressing of IPv4/IPv6 Translators\", RFC 6052, October 2010.",
      "ja": "[RFC6052]バオ、C.、のHuitema、C.、Bagnulo、M.、Boucadair、M.、およびX.李、RFC 6052、2010年10月の \"IPv6は、IPv4 / IPv6の翻訳者のアドレス指定\"。"
    },
    {
      "indent": 3,
      "text": "[RFC6164] Kohno, M., Nitzan, B., Bush, R., Matsuzaki, Y., Colitti, L., and T. Narten, \"Using 127-Bit IPv6 Prefixes on Inter-Router Links\", RFC 6164, April 2011.",
      "ja": "[RFC6164]河野、M.、Nitzan、B.、ブッシュ、R.、松崎、Y.、Colitti、L.、及びT. Narten氏、 \"ルータ間のリンク上の127ビットのIPv6プレフィックスを使用する\"、RFC 6164、 2011年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6741] Atkinson,, RJ., \"Identifier-Locator Network Protocol (ILNP) Engineering Considerations\", RFC 6741, November 2012.",
      "ja": "[RFC6741]アトキンソン,, RJ。、 \"識別子ロケータネットワークプロトコル（ILNP）エンジニアリングの注意事項\"、RFC 6741、2012年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC6775] Shelby, Z., Chakrabarti, S., Nordmark, E., and C. Bormann, \"Neighbor Discovery Optimization for IPv6 over Low-Power Wireless Personal Area Networks (6LoWPANs)\", RFC 6775, November 2012.",
      "ja": "[RFC6775]シェルビー、Z.、Chakrabarti、S.、Nordmarkと、E.、およびC.ボルマン、 \"低消費電力無線パーソナルエリアネットワーク（6LoWPANs）を超えるIPv6の近隣探索の最適化\"、RFC 6775、2012年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC6957] Costa, F., Combes, J-M., Pougnard, X., and H. Li, \"Duplicate Address Detection Proxy\", RFC 6957, June 2013.",
      "ja": "[RFC6957]コスタ、F.、Combesの、J-M。、Pougnard、X.、およびH.リー、 \"重複アドレス検出プロキシ\"、RFC 6957、2013年6月。"
    },
    {
      "indent": 3,
      "text": "[SOFTWR-4RD] Despres, R., Jiang, S., Penno, R., Lee, Y., Chen, G., and M. Chen, \"IPv4 Residual Deployment via IPv6 - a Stateless Solution (4rd)\", Work in Progress, October 2013.",
      "ja": "[SOFTWR-4RD]デプレ、R.、江、S.、Penno、R.、リー、Y.、チェン、G.、およびM.チェン、の \"IPv6経由のIPv4残留展開 - （4RD）ステートレスソリューション\"、進歩、2013年10月に働いています。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Brian Carpenter Department of Computer Science University of Auckland PB 92019 Auckland 1142 New Zealand",
      "ja": "オークランドPBのコンピュータサイエンス大学92019オークランド1142ニュージーランドのブライアン・カーペンター部門"
    },
    {
      "indent": 3,
      "text": "EMail: brian.e.carpenter@gmail.com",
      "ja": "メールアドレス：brian.e.carpenter@gmail.com"
    },
    {
      "indent": 3,
      "text": "Sheng Jiang Huawei Technologies Co., Ltd Q14, Huawei Campus No.156 Beiqing Road Hai-Dian District, Beijing 100095 P.R. China",
      "ja": "HU AはキャンパスNO.156は愛緑道H -Dイアン地区、北京100095中華人民共和国私もあるSが共同クロス江HU A技術である、株式会社Q14、"
    },
    {
      "indent": 3,
      "text": "EMail: jiangsheng@huawei.com",
      "ja": "メールアドレス：jiangsheng@huawei.com"
    }
  ]
}