{
  "title": {
    "text": "RFC 7065 - Traversal Using Relays around NAT (TURN) Uniform Resource Identifiers",
    "ja": "RFC 7065 - NAT（TURN）ユニフォームリソース識別子の周りのリレーを使用したトラバーサル"
  },
  "number": 7065,
  "created_at": "2020-09-04 11:37:00.666248+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                 M. Petit-Huguenin\nRequest for Comments: 7065                            Impedance Mismatch\nCategory: Standards Track                                  S. Nandakumar\nISSN: 2070-1721                                             G. Salgueiro\n                                                                P. Jones\n                                                           Cisco Systems\n                                                           November 2013",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 1,
      "text": "Traversal Using Relays around NAT (TURN) Uniform Resource Identifiers",
      "ja": "NAT（TURN）ユニフォームリソース識別子の周りのリレーを使用したトラバーサル"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document specifies the syntax of Uniform Resource Identifier (URI) schemes for the Traversal Using Relays around NAT (TURN) protocol. It defines two URI schemes to provision the TURN Resolution Mechanism (RFC 5928).",
      "ja": "このドキュメントでは、NAT周りのリレーを使用したトラバーサル（TURN）プロトコルのURI（Uniform Resource Identifier）スキームの構文を指定します。 TURN解決メカニズム（RFC 5928）をプロビジョニングする2つのURIスキームを定義しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはInternet Standards Trackドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。インターネット標準の詳細については、RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7065.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7065で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2013 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Definitions of the \"turn\" and \"turns\" URI . . . . . . . . . .   4\n  3.1.  URI Scheme Syntax . . . . . . . . . . . . . . . . . . . .   4\n  3.2.  URI Scheme Semantics  . . . . . . . . . . . . . . . . . .   4\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .   5\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   5\n  5.1.  \"turn\" URI Registration . . . . . . . . . . . . . . . . .   5\n  5.2.  \"turns\" URI Registration  . . . . . . . . . . . . . . . .   6\n6.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   6\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   7\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .   7\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .   7\nAppendix A.  Examples . . . . . . . . . . . . . . . . . . . . . .   8\nAppendix B.  Design Notes . . . . . . . . . . . . . . . . . . . .   8",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document specifies the syntax and semantics of the Uniform Resource Identifier (URI) scheme for the Traversal Using Relays around NAT (TURN) protocol.",
      "ja": "このドキュメントでは、NATリレー（TURN）プロトコルを使用したトラバーサルのURI（Uniform Resource Identifier）スキームの構文とセマンティクスを指定します。"
    },
    {
      "indent": 3,
      "text": "The TURN protocol is a specification allowing hosts behind NAT to control the operation of a relay server. The relay server allows hosts to exchange packets with its peers. The peers themselves may also be behind NATs. RFC 5766 [RFC5766] defines the specifics of the TURN protocol.",
      "ja": "TURNプロトコルは、NATの背後にあるホストがリレーサーバーの動作を制御できるようにする仕様です。リレーサーバーにより、ホストはピアとパケットを交換できます。ピア自体もNATの背後にある可能性があります。 RFC 5766 [RFC5766]は、TURNプロトコルの詳細を定義しています。"
    },
    {
      "indent": 3,
      "text": "The \"turn\" and \"turns\" URI schemes are used to designate a TURN server (also known as a relay) on Internet hosts accessible using the TURN protocol. With the advent of standards such as WebRTC [WEBRTC], we anticipate a plethora of endpoints and web applications to be able to identify and communicate with such a TURN server to carry out the TURN protocol. This implies that endpoints and/or applications must be provisioned with the appropriate configuration to identify the TURN server. Having an inconsistent syntax adds ambiguity and can result in non-interoperable solutions and implementation limitations. The \"turn\" and \"turns\" URI schemes help alleviate most of these issues by providing a consistent way to describe, configure, and exchange the information identifying a TURN server.",
      "ja": "「ターン」および「ターン」URIスキームは、TURNプロトコルを使用してアクセス可能なインターネットホスト上のTURNサーバー（リレーとも呼ばれる）を指定するために使用されます。 WebRTC [WEBRTC]などの標準の出現により、エンドポイントやWebアプリケーションが大量にあり、そのようなTURNサーバーを識別して通信し、TURNプロトコルを実行できることが期待されています。これは、TURNサーバーを識別するために、エンドポイントやアプリケーションを適切な構成でプロビジョニングする必要があることを意味します。一貫性のない構文があるとあいまいさが増し、相互運用できないソリューションや実装の制限につながる可能性があります。 「ターン」および「ターン」URIスキームは、TURNサーバーを識別する情報を記述、構成、および交換する一貫した方法を提供することにより、これらの問題のほとんどを軽減するのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "[RFC5928] defines a resolution mechanism to convert a secure flag, a host name or IP address, a potentially empty port, and a potentially empty transport to a list of IP address, port, and TURN transport tuples.",
      "ja": "[RFC5928]は、セキュアフラグ、ホスト名またはIPアドレス、潜在的に空のポート、および潜在的に空のトランスポートをIPアドレス、ポート、およびTURNトランスポートタプルのリストに変換する解決メカニズムを定義します。"
    },
    {
      "indent": 3,
      "text": "To simplify the provisioning of TURN clients, this document defines the \"turn\" and \"turns\" URI schemes that can carry the four components needed for the resolution mechanism.",
      "ja": "TURNクライアントのプロビジョニングを簡素化するために、このドキュメントでは、解決メカニズムに必要な4つのコンポーネントを伝送できる「ターン」および「ターン」URIスキームを定義しています。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119] when they appear in ALL CAPS. When these words are not in ALL CAPS (such as \"should\" or \"Should\"), they have their usual English meanings, and are not to be interpreted as RFC 2119 key words.",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「MAY」、および「OPTIONAL」は、すべて大文字で表記されている場合、[RFC2119]で説明されているように解釈されます。これらの単語がすべて大文字（ \"should\"や \"Should\"など）にない場合、それらは通常の英語の意味を持ち、RFC 2119のキーワードとして解釈されません。"
    },
    {
      "indent": 0,
      "text": "3. Definitions of the \"turn\" and \"turns\" URI",
      "section_title": true,
      "ja": "3. 「ターン」および「ターン」URIの定義"
    },
    {
      "indent": 0,
      "text": "3.1. URI Scheme Syntax",
      "section_title": true,
      "ja": "3.1. URIスキームの構文"
    },
    {
      "indent": 3,
      "text": "The \"turn\" and \"turns\" URIs have the following formal ABNF syntax [RFC5234]:",
      "ja": "「ターン」および「ターン」URIには、次の正式なABNF構文[RFC5234]があります。"
    },
    {
      "indent": 3,
      "text": "turnURI       = scheme \":\" host [ \":\" port ]\n                [ \"?transport=\" transport ]\nscheme        = \"turn\" / \"turns\"\ntransport     = \"udp\" / \"tcp\" / transport-ext\ntransport-ext = 1*unreserved",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "<host> and <port> are specified in [RFC3986]. While these two ABNF productions are defined in [RFC3986] as components of the generic hierarchical URI, this does not imply that the \"turn\" and \"turns\" schemes are hierarchical URIs. Developers MUST NOT use a generic hierarchical URI parser to parse a \"turn\" or \"turns\" URI.",
      "ja": "<host>と<port>は[RFC3986]で指定されています。これらの2つのABNFプロダクションは[RFC3986]で汎用階層URIのコンポーネントとして定義されていますが、これは「ターン」および「ターン」スキームが階層URIであることを意味するものではありません。開発者は、「ターン」または「ターン」URIを解析するために、汎用階層URIパーサーを使用してはなりません（MUST NOT）。"
    },
    {
      "indent": 3,
      "text": "The <host>, <port>, and <transport> components are passed without modification to the [RFC5928] algorithm. <secure> is set to false if <scheme> is equal to \"turn\", and set to true if <scheme> is equal to \"turns\" and passed to the [RFC5928] algorithm with the other components.",
      "ja": "<host>、<port>、および<transport>コンポーネントは、変更せずに[RFC5928]アルゴリズムに渡されます。 <secure>は、<scheme>が \"turn\"と等しい場合はfalseに設定され、<scheme>が \"turns\"と等しい場合はtrueに設定され、他のコンポーネントとともに[RFC5928]アルゴリズムに渡されます。"
    },
    {
      "indent": 0,
      "text": "3.2. URI Scheme Semantics",
      "section_title": true,
      "ja": "3.2. うり Ｓちぇめ せまんちｃｓ"
    },
    {
      "indent": 3,
      "text": "The \"turn\" and \"turns\" URI schemes are used to designate a TURN server (also known as a relay) on Internet hosts accessible using the TURN protocol. The TURN protocol supports sending messages over UDP, TCP, or TLS-over-TCP. The \"turns\" URI scheme MUST be used when TURN is run over TLS-over-TCP (or, in the future, DTLS-over-UDP), and the \"turn\" scheme MUST be used otherwise.",
      "ja": "「ターン」および「ターン」URIスキームは、TURNプロトコルを使用してアクセス可能なインターネットホスト上のTURNサーバー（リレーとも呼ばれる）を指定するために使用されます。 TURNプロトコルは、UDP、TCP、またはTLS-over-TCPを介したメッセージの送信をサポートしています。 TURNがTLS-over-TCP（または将来的にはDTLS-over-UDP）で実行される場合は、「turns」URIスキームを使用する必要があり、そうでない場合は「turn」スキームを使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "The required <host> part of the \"turn\" URI denotes the TURN server host.",
      "ja": "「turn」URIの必須の<host>部分は、TURNサーバーホストを示します。"
    },
    {
      "indent": 3,
      "text": "As specified in [RFC5766] and [RFC5928], the <port> part, if present, denotes the port on which the TURN server is awaiting connection requests. If it is absent, the default port is 3478 for both UDP and TCP. The default port for TURN over TLS is 5349.",
      "ja": "[RFC5766]および[RFC5928]で指定されているように、<port>部分は、存在する場合、TURNサーバーが接続要求を待機しているポートを示します。存在しない場合、UDPとTCPの両方のデフォルトポートは3478です。 TLS over TURNのデフォルトポートは5349です。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Security considerations for the resolution mechanism are discussed in Section 5 of [RFC5928]. Note that this section contains normative text defining authentication procedures to be followed by turn clients when TLS is used.",
      "ja": "解決メカニズムのセキュリティに関する考慮事項は、[RFC5928]のセクション5で説明されています。このセクションには、TLSが使用されているときにターンクライアントが従う認証手順を定義する規範的なテキストが含まれていることに注意してください。"
    },
    {
      "indent": 3,
      "text": "The \"turn\" and \"turns\" URI schemes do not introduce any specific security issues beyond the security considerations discussed in [RFC3986].",
      "ja": "「ターン」および「ターン」URIスキームは、[RFC3986]で説明されているセキュリティの考慮事項を超えて、特定のセキュリティ問題を導入しません。"
    },
    {
      "indent": 3,
      "text": "Although a \"turn\" or \"turns\" URI does not itself include the username or password that will be used to authenticate the TURN client, in certain environments, such as WebRTC, the username and password will almost certainly be provisioned remotely by an external agent at the same time as a \"turns\" URI is sent to that client. Thus, in such situations, if the username and password were received in the clear, there would be little or no benefit to using a \"turns\" URI. For this reason, a TURN client MUST ensure that the username, password, \"turns\" URI, and any other security-relevant parameters are received with equivalent security before using the \"turns\" URI. Receiving those parameters over another TLS session can provide the appropriate level of security, if both TLS sessions are similarly parameterised, e.g., with commensurate strength ciphersuites.",
      "ja": "「turn」または「turns」URI自体には、TURNクライアントの認証に使用されるユーザー名またはパスワードが含まれていませんが、WebRTCなどの特定の環境では、ユーザー名とパスワードは外部エージェントによってほぼ確実にリモートでプロビジョニングされます「ターン」URIがそのクライアントに送信されると同時に。したがって、このような状況では、ユーザー名とパスワードを平文で受け取った場合、「turns」URIを使用してもほとんどまたはまったくメリットがありません。このため、TURNクライアントは、「turns」URIを使用する前に、ユーザー名、パスワード、「turns」URI、およびその他のセキュリティ関連パラメータが同等のセキュリティで受信されることを確認する必要があります。別のTLSセッションを介してこれらのパラメーターを受信すると、両方のTLSセッションが同様にパラメーター化されている場合（たとえば、釣り合いのとれた強度の暗号スイートを使用した場合）に、適切なレベルのセキュリティを提供できます。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This section contains the registration information for the \"turn\" and \"turns\" URI Schemes (in accordance with [RFC4395]).",
      "ja": "このセクションには、「ターン」および「ターン」URIスキーム（[RFC4395]に準拠）の登録情報が含まれています。"
    },
    {
      "indent": 0,
      "text": "5.1. \"turn\" URI Registration",
      "section_title": true,
      "ja": "5.1. 「ターン」URI登録"
    },
    {
      "indent": 3,
      "text": "URI scheme name: turn",
      "ja": "URIスキーム名：ターン"
    },
    {
      "indent": 3,
      "text": "Status: permanent",
      "ja": "ステータス：永続的"
    },
    {
      "indent": 3,
      "text": "URI scheme syntax: See Section 3.1.",
      "ja": "URIスキームの構文：セクション3.1を参照してください。"
    },
    {
      "indent": 3,
      "text": "URI scheme semantics: See Section 3.2.",
      "ja": "URIスキームのセマンティクス：セクション3.2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: There are no encoding considerations beyond those in [RFC3986].",
      "ja": "エンコーディングに関する考慮事項：[RFC3986]のエンコーディングに関する考慮事項以外はありません。"
    },
    {
      "indent": 3,
      "text": "Applications/protocols that use this URI scheme name:",
      "ja": "このURIスキーム名を使用するアプリケーション/プロトコル："
    },
    {
      "indent": 6,
      "text": "The \"turn\" URI scheme is intended to be used by applications with a need to identify a TURN server to be used for NAT traversal.",
      "ja": "「ターン」URIスキームは、NATトラバーサルに使用するTURNサーバーを識別する必要があるアプリケーションで使用することを目的としています。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: N/A",
      "ja": "相互運用性に関する考慮事項：N / A"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 4.",
      "ja": "セキュリティに関する考慮事項：セクション4を参照してください。"
    },
    {
      "indent": 3,
      "text": "Contact: Marc Petit-Huguenin <petithug@acm.org>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Author/Change controller: The IESG",
      "ja": "作成者/変更コントローラ：IESG"
    },
    {
      "indent": 3,
      "text": "References: RFC 7065",
      "ja": "参照：RFC 7065"
    },
    {
      "indent": 0,
      "text": "5.2. \"turns\" URI Registration",
      "section_title": true,
      "ja": "5.2. URI登録を「回す」"
    },
    {
      "indent": 3,
      "text": "URI scheme name: turns",
      "ja": "URIスキーム名：ターン"
    },
    {
      "indent": 3,
      "text": "Status: permanent",
      "ja": "ステータス：永続的"
    },
    {
      "indent": 3,
      "text": "URI scheme syntax: See Section 3.1.",
      "ja": "URIスキームの構文：セクション3.1を参照してください。"
    },
    {
      "indent": 3,
      "text": "URI scheme semantics: See Section 3.2.",
      "ja": "URIスキームのセマンティクス：セクション3.2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: There are no encoding considerations beyond those in [RFC3986].",
      "ja": "エンコーディングに関する考慮事項：[RFC3986]のエンコーディングに関する考慮事項以外はありません。"
    },
    {
      "indent": 3,
      "text": "Applications/protocols that use this URI scheme name:",
      "ja": "このURIスキーム名を使用するアプリケーション/プロトコル："
    },
    {
      "indent": 6,
      "text": "The \"turns\" URI scheme is intended to be used by applications with a need to identify a TURN server to be used for NAT traversal over a secure connection.",
      "ja": "「ターン」URIスキームは、安全な接続を介したNATトラバーサルに使用するTURNサーバーを識別する必要があるアプリケーションで使用することを目的としています。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: N/A",
      "ja": "相互運用性に関する考慮事項：N / A"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 4.",
      "ja": "セキュリティに関する考慮事項：セクション4を参照してください。"
    },
    {
      "indent": 3,
      "text": "Contact: Marc Petit-Huguenin <petithug@acm.org>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Author/Change controller: The IESG",
      "ja": "作成者/変更コントローラ：IESG"
    },
    {
      "indent": 3,
      "text": "References: RFC 7065",
      "ja": "参照：RFC 7065"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Margaret Wasserman, Magnus Westerlund, Juergen Schoenwaelder, Sean Turner, Ted Hardie, Dave Thaler, Alfred E. Heggestad, Eilon Yardeni, Dan Wing, Alfred Hoenes, and Jim Kleck for the comments, suggestions, and questions that helped improve \"Traversal Using Relays around NAT (TURN) Uniform Resource Identifiers\" by M. Petit-Huguenin (October 2011).",
      "ja": "マーガレットワッサーマン、マグナスウェスタールンド、ユルゲンシェーンヴェルダー、ショーンターナー、テッドハーディ、デイブターラー、アルフレッドE.ヘゲスタッド、エイロンヤーデニ、ダンウイング、アルフレッドホエネス、ジムクレックの「トラバーサル」の改善に役立つコメント、提案、質問に感謝NAT周りのリレーの使用（TURN）Uniform Resource Identifiers」M。Petit-Huguenin（2011年10月）。"
    },
    {
      "indent": 3,
      "text": "Many thanks to Cullen Jennings for his detailed review and thoughtful comments on \"URI Scheme for Traversal Using Relays around NAT (TURN) Protocol\" by S. Nandakumar, et al. (October 2011).",
      "ja": "S. Nandakumarほかによる「NAT（TURN）プロトコルのリレーを使用したトラバーサルのURIスキーム」に関する詳細なレビューと思慮深いコメントを提供してくれたCullen Jenningsに感謝します。 （2011年10月）。"
    },
    {
      "indent": 3,
      "text": "Thanks to Bjoern Hoehrmann, Dan Wing, Russ Housley, S. Moonesamy, Graham Klyne, Harald Alvestrand, Hadriel Kaplan, Tina Tsou, Spencer Dawkins, Ted Lemon, Barry Leiba, Pete Resnick, and Stephen Farrell for the comments, suggestions, and questions that helped improve this document.",
      "ja": "コメント、提案、質問に対するBjoern Hoehrmann、Dan Wing、Russ Housley、S。Moonesamy、Graham Klyne、Harald Alvestrand、Hadriel Kaplan、Tina Tsou、Spencer Dawkins、Ted Lemon、Barry Leiba、Pete Resnick、Stephen Farrellに感謝このドキュメントの改善に役立ちました。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to express their gratitude to Dan Wing for his assistance in shepherding this document. We also want to thank Gonzalo Camarillo, the Real-time Applications and Infrastructure Area Director, for sponsoring this document as well as his careful reviews.",
      "ja": "著者はまた、この文書の羊飼いを手伝ってくれたDan Wingに感謝の意を表したいと思います。また、このドキュメントのスポンサーおよび慎重なレビューを提供してくれた、リアルタイムアプリケーションおよびインフラストラクチャエリアディレクターのゴンザロカマリロにも感謝します。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986] Berners-Lee、T.、Fielding、R。、およびL. Masinter、「Uniform Resource Identifier（URI）：Generic Syntax」、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "[RFC5234] Crocker、D。およびP. Overell、「構文仕様の拡張BNF：ABNF」、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5766] Mahy, R., Matthews, P., and J. Rosenberg, \"Traversal Using Relays around NAT (TURN): Relay Extensions to Session Traversal Utilities for NAT (STUN)\", RFC 5766, April 2010.",
      "ja": "[RFC5766] Mahy、R.、Matthews、P.、J。Rosenberg、「NAT周辺のリレーを使用したトラバーサル（TURN）：NATのセッショントラバーサルユーティリティへのリレー拡張（STUN）」、RFC 5766、2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5928] Petit-Huguenin, M., \"Traversal Using Relays around NAT (TURN) Resolution Mechanism\", RFC 5928, August 2010.",
      "ja": "[RFC5928] Petit-Huguenin、M。、「NAT（TURN）解決メカニズムの周りのリレーを使用したトラバーサル」、RFC 5928、2010年8月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC4395] Hansen, T., Hardie, T., and L. Masinter, \"Guidelines and Registration Procedures for New URI Schemes\", BCP 35, RFC 4395, February 2006.",
      "ja": "[RFC4395] Hansen、T.、Hardie、T。、およびL. Masinter、「新しいURIスキームのガイドラインと登録手順」、BCP 35、RFC 4395、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[WEBRTC] Bergkvist, A., Burnett, D., Jennings, C., and A. Narayanan, \"WebRTC 1.0: Real-time Communication Between Browsers\", World Wide Web Consortium WD WD-webrtc-20120821, August 2012, <http://www.w3.org/TR/2012/WD-webrtc-20120821>.",
      "ja": "[WEBRTC] Bergkvist、A.、Burnett、D.、Jennings、C。、およびA. Narayanan、「WebRTC 1.0：ブラウザー間のリアルタイム通信」、World Wide Web Consortium WD WD-webrtc-20120821、2012年8月、< http://www.w3.org/TR/2012/WD-webrtc-20120821>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Examples",
      "section_title": true,
      "ja": "付録A.例"
    },
    {
      "indent": 3,
      "text": "Table 1 shows how the <secure>, <port>, and <transport> components are populated from various URIs. For all these examples, the <host> component is populated with \"example.org\".",
      "ja": "表1は、<secure>、<port>、および<transport>コンポーネントがさまざまなURIからどのように入力されるかを示しています。これらすべての例で、<host>コンポーネントには「example.org」が入力されています。"
    },
    {
      "indent": 3,
      "text": "+---------------------------------+----------+--------+-------------+\n| URI                             | <secure> | <port> | <transport> |\n+---------------------------------+----------+--------+-------------+\n| turn:example.org                | false    |        |             |\n| turns:example.org               | true     |        |             |\n| turn:example.org:8000           | false    | 8000   |             |\n| turn:example.org?transport=udp  | false    |        | UDP         |\n| turn:example.org?transport=tcp  | false    |        | TCP         |\n| turns:example.org?transport=tcp | true     |        | TLS         |\n+---------------------------------+----------+--------+-------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 34,
      "text": "Table 1",
      "ja": "表1"
    },
    {
      "indent": 0,
      "text": "Appendix B. Design Notes",
      "section_title": true,
      "ja": "付録B.設計ノート"
    },
    {
      "indent": 3,
      "text": "o One recurring comment was to stop using the suffix \"s\" on the URI scheme, and to move the secure option to a parameter (e.g. \";proto=tls\"). We decided against this idea because the STUN URI does not have a \";proto=\" parameter and we would have lost the symmetry between the TURN and STUN URIs.",
      "ja": "o 繰り返しコメントの1つは、URIスキームでの接尾辞「s」の使用を停止し、セキュアオプションをパラメーターに移動することでした（例：「; proto = tls」）。 STUN URIには「; proto =」パラメーターがなく、TURN URIとSTUN URIの対称性が失われていたため、この考えに反対しました。"
    },
    {
      "indent": 3,
      "text": "o Following the advice of Section 2.2 of RFC 4395, and because the TURN URI does not describe a hierarchical structure, the TURN URIs are opaque URIs.",
      "ja": "o RFC 4395のセクション2.2のアドバイスに従い、TURN URIは階層構造を記述しないため、TURN URIは不透明なURIです。"
    },
    {
      "indent": 3,
      "text": "o <password> is not used in the URIs because it is deprecated [RFC3986]. <username> and <auth> are not used in the URIs because they do not guide the resolution mechanism.",
      "ja": "o <password>は非推奨であるため、URIでは使用されません[RFC3986]。 <username>および<auth>は、解決メカニズムをガイドしないため、URIで使用されません。"
    },
    {
      "indent": 3,
      "text": "o As discussed at IETF 72 in Dublin, there are no generic parameters in the URI to prevent compatibility issues.",
      "ja": "o ダブリンのIETF 72で説明されているように、URIには互換性の問題を防ぐための汎用パラメーターはありません。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Marc Petit-Huguenin Impedance Mismatch",
      "ja": "マルクプティフーゲニンインピーダンスミスマッチ"
    },
    {
      "indent": 3,
      "text": "EMail: petithug@acm.org",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Suhas Nandakumar Cisco Systems 170 West Tasman Drive San Jose, CA 95134 US",
      "ja": "Suhas Nandakumar Cisco Systems 170 West Tasman Drive San Jose、CA 95134 US"
    },
    {
      "indent": 3,
      "text": "EMail: snandaku@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Gonzalo Salgueiro Cisco Systems 7200-12 Kit Creek Road Research Triangle Park, NC 27709 US",
      "ja": "Gonzalo Salgueiro Cisco Systems 7200-12 Kit Creek Road Research Triangle Park、NC 27709 US"
    },
    {
      "indent": 3,
      "text": "EMail: gsalguei@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Paul E. Jones Cisco Systems 7025 Kit Creek Road Research Triangle Park, NC 27709 US",
      "ja": "Paul E. Jones Cisco Systems 7025 Kit Creek Road Research Triangle Park、NC 27709 US"
    },
    {
      "indent": 3,
      "text": "EMail: paulej@packetizer.com",
      "raw": true,
      "ja": ""
    }
  ]
}