{
  "title": {
    "text": "RFC 7687 - Report from the Strengthening the Internet (STRINT) Workshop",
    "ja": "RFC 7687 - インターネットを強化（STRINT）ワークショップからの報告書"
  },
  "number": 7687,
  "created_at": "2019-11-01 05:29:30.748535+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Architecture Board (IAB)                             S. Farrell\nRequest for Comments: 7687                       Trinity College, Dublin\nCategory: Informational                                       R. Wenning\nISSN: 2070-1721                                                   B. Bos\n                                                                     W3C\n                                                             M. Blanchet\n                                                                Viagenie\n                                                           H. Tschofenig\n                                                                ARM Ltd.\n                                                           December 2015",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Report from the Strengthening the Internet (STRINT) Workshop",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Strengthening the Internet (STRINT) workshop assembled one hundred participants in London for two days in early 2014 to discuss how the technical community, and in particular the IETF and the W3C, should react to Pervasive Monitoring and more generally how to strengthen the Internet in the face of such attacks. The discussions covered issues of terminology, the role of user interfaces, classes of mitigation, some specific use cases, transition strategies (including opportunistic encryption), and more. The workshop ended with a few high-level recommendations, that it is believed could be implemented and could help strengthen the Internet. This is the report of that workshop.",
      "ja": "強化は、インターネット（STRINT）ワークショップでは、どのように技術的なコミュニティを議論するために早期に2014年に2日間、ロンドンの百人の参加者を集め、特にIETFとW3Cは、Pervasiveの監視に反応すべきであり、より一般的で、インターネットを強化する方法このような攻撃の顔。議論は用語の問題をカバーし、ユーザーインターフェース、緩和のクラス、いくつかの具体的な使用例、（日和見暗号化を含む）の移行戦略、およびより多くの役割。ワークショップでは、それを実装することができ、インターネットを強化する助けることができると考えられていることを、いくつかの高レベルの勧告に終わりました。これは、ワークショップのレポートです。"
    },
    {
      "indent": 3,
      "text": "Note that this document is a report on the proceedings of the workshop. The views and positions documented in this report are those of the workshop participants and do not necessarily reflect IAB views and positions.",
      "ja": "このドキュメントは、ワークショップの議事録についての報告であることに注意してください。この報告書に記載見解と位置は、ワークショップ参加者のものであり、必ずしもIABビューと位置を反映するものではありません。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. Documents approved for publication by the IAB are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットアーキテクチャ委員会（IAB）の製品であり、IABは、永久的な記録を提供するために貴重なものとみなされたことの情報を表します。 IABによって公表のために承認されたドキュメントは、インターネット標準の任意のレベルの候補ではありません。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7687.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7687で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Context . . . . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Summary . . . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Workshop Goals  . . . . . . . . . . . . . . . . . . . . . . .   4\n4.  Workshop Structure  . . . . . . . . . . . . . . . . . . . . .   5\n5.  Topics  . . . . . . . . . . . . . . . . . . . . . . . . . . .   6\n6.  After the Workshop  . . . . . . . . . . . . . . . . . . . . .  20\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .  21\n8.  Informative References  . . . . . . . . . . . . . . . . . . .  21\nAppendix A.  Logistics  . . . . . . . . . . . . . . . . . . . . .  25\nAppendix B.  Agenda . . . . . . . . . . . . . . . . . . . . . . .  26\nAppendix C.  Workshop Chairs and Program Committee  . . . . . . .  29\nAppendix D.  Participants . . . . . . . . . . . . . . . . . . . .  29\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  32",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Context",
      "section_title": true,
      "ja": "1.コンテキスト"
    },
    {
      "indent": 3,
      "text": "The technical plenary session at IETF 88 [vancouverplenary] concluded that Pervasive Monitoring (PM) represents an attack on the Internet, and the IETF has begun to carry out the more obvious actions required to try to handle this attack. However, there are much more complex questions arising that need further consideration before any additional concrete plans can be made.",
      "ja": "IETF 88の技術本会議は、[vancouverplenary]パーベイシブモニタリング（PM）は、インターネット上の攻撃を表し、IETFはこの攻撃に対処しようとするために必要なより多くの明白なアクションを実行するために始めていると結論付けました。しかし、任意の追加の具体的な計画を行うことができる前に、さらなる検討が必要であることに起因はるかに複雑な質問があります。"
    },
    {
      "indent": 3,
      "text": "The W3C (<https://www.w3.org>) and IAB (<https://www.iab.org>) therefore decided to host a workshop on the topic of \"Strengthening the Internet Against Pervasive Monitoring\" [STRINT] before IETF 89 in London in March 2014. The FP7-funded STREWS project (<https://www.strews.eu/>) organised the STRINT workshop on behalf of the IAB and W3C.",
      "ja": "W3C（<https://www.w3.org>）とIAB（<https://www.iab.org>）ため、「Pervasiveの監視に反対インターネットの強化」をテーマにワークショップを開催することを決定した[STRINT ]三月2014年にロンドンでIETF 89 FP7資金によるSTREWSプロジェクト（<https://www.strews.eu/>）はIABとW3Cに代わってSTRINTのワークショップを開催する前に。"
    },
    {
      "indent": 3,
      "text": "The main workshop goal was to discuss what can be done, especially by the two standards organisations IETF and W3C, against PM, both for existing Internet protocols (HTTP/1, SMTP, etc.) and for new ones (WebRTC, HTTP/2, etc.).",
      "ja": "主なワークショップの目的は、特に2つの標準化団体IETFとW3Cによって、何ができるかについて議論することでした、PMに対して、両方の既存のインターネット・プロトコル（HTTP / 1、SMTPなど）のために、新しいもののため（のWebRTC、HTTP / 2 、など）。"
    },
    {
      "indent": 3,
      "text": "The starting point for the workshop was the existing IETF consensus that PM is an attack [RFC7258] (the text of which had achieved IETF consensus at the time of the workshop, even though the RFC had yet to be published).",
      "ja": "ワークショップのための出発点は、PMが攻撃[RFC7258]（RFCが公開されることはまだ持っていたにも関わらず、ワークショップの時にIETFコンセンサスを達成していたのテキスト）で、既存のIETF合意しました。"
    },
    {
      "indent": 0,
      "text": "2. Summary",
      "section_title": true,
      "ja": "2.概要"
    },
    {
      "indent": 3,
      "text": "The workshop was well attended (registration closed when the maximum capacity of 100 was reached, but more than 150 expressed a desire to register) and several people (about 165 at the maximum) listened to the streaming audio. The submitted papers (67 in total) were generally of good quality and all were published, except for a few where authors who couldn't take part in the workshop preferred not to publish.",
      "ja": "ワークショップは、ウェル（100の最大容量に達した場合、登録を閉じたが、150以上が登録したいという要望表す）（最大で約165）、およびいくつかの人々をストリーミングオーディオを聴い出席しました。提出書類（合計67）は、一般的に良い品質のであり、ワークショップに参加することができませんでした作者が公開しないことが好ましいところ、すべては少数を除いて、発表されました。"
    },
    {
      "indent": 3,
      "text": "The chairs of the workshop summarised the workshop in the final session in the form of the following recommendations:",
      "ja": "ワークショップの椅子は以下の提言の形で最終セッションでワークショップをまとめました。"
    },
    {
      "indent": 3,
      "text": "1. Well-implemented cryptography can be effective against PM and will benefit the Internet if used more, despite its cost, which is steadily decreasing anyway.",
      "ja": "1.よく実装暗号では、PMに対して有効にすることができ、着実に減少している、とにかくそのコストにもかかわらず、より多く使用されている場合、インターネットの利益になります。"
    },
    {
      "indent": 3,
      "text": "2. Traffic analysis also needs to be considered, but is less well understood in the Internet community: relevant research and protocol mitigations such as data minimisation need to be better understood.",
      "ja": "2.トラフィック分析も検討する必要があるが、あまりインターネットコミュニティで理解されています。そのようなデータの最小化などの関連研究とプロトコル緩和策をよりよく理解する必要があります。"
    },
    {
      "indent": 3,
      "text": "3. Work should continue on progressing the PM threat model document [Barnes] discussed in the workshop. Subsequent work on this topic resulted in the publication of [RFC7624].",
      "ja": "3.作業は、ワークショップで議論PM脅威モデルドキュメント[バーンズ]を進んで継続すべきです。このトピックの以降の作業は、[RFC7624]の出版物になりました。"
    },
    {
      "indent": 3,
      "text": "4. Later, the IETF may be in a position to start to develop an update to BCP 72 [RFC3552], most likely as a new RFC enhancing that BCP and dealing with recommendations on how to mitigate PM and how to reflect that in IETF work.",
      "ja": "4.その後、IETFは、[RFC3552] BCP 72への更新を開発するために開始する位置にBCPとPMを軽減する方法と、IETFの仕事にそれを反映させる方法に関する推奨事項を扱っていることを強化する新しいRFCとして最も可能性が高いです。"
    },
    {
      "indent": 3,
      "text": "5. The term \"opportunistic\" has been widely used to refer to a possible mitigation strategy for PM. The community needs to document definition(s) for this term, as it is being used differently by different people and in different contexts. We may also be able to develop a cookbook-like set of related protocol techniques for developers. Since the workshop, the IETF's Security area has taken up this work, most recently favouring the generic term \"Opportunistic Security\" (OS) [Kent]. Subsequent work on this topic resulted in the publication of a definition of OS in [RFC7435].",
      "ja": "5.「日和見主義」という用語は、広くPMのための可能な軽減戦略を参照するために使用されてきました。コミュニティは、異なる人々によって、異なる文脈では異なる使用されているように、この用語の定義（複数可）を文書化する必要があります。また、開発者のための関連プロトコル技術の料理のようなセットを開発できる可能性があります。ワークショップ以来、IETFのセキュリティエリアは、最近一般的な用語「日和見セキュリティ」（OS）[ケント]を好む、この作品を取り上げています。このトピックの以降の作業は、[RFC7435]でOSの定義の出版物になりました。"
    },
    {
      "indent": 3,
      "text": "6. The technical community could do better in explaining the real technical downsides related to PM in terms that policy makers can understand.",
      "ja": "6.技術コミュニティは、政策立案者が理解できる用語でPMに関連する真の技術的な欠点を説明する中で、より良い行うことができます。"
    },
    {
      "indent": 3,
      "text": "7. Many user interfaces (UIs) could be better in terms of how they present security state, though this is a significantly hard problem. There may be benefits if certain dangerous choices were simply not offered anymore. But that could require significant coordination among competing software makers; otherwise, some will be considered \"broken\" by users.",
      "ja": "7.多くのユーザ・インターフェース（UI）は、これが非常に難しい問題ですが、彼らは、セキュリティの状態を提示する方法の面でより良いかもしれません。特定の危険な選択が単純にもう提供されていなかった場合はメリットがあるかもしれません。しかし、それは、競合するソフトウェアメーカー間で有意の調整を必要とする可能性があります。そうでない場合は、いくつかは、ユーザーが「壊れた」とみなされます。"
    },
    {
      "indent": 3,
      "text": "8. Further discussion is needed on ways to better integrate UI issues into the processes of IETF and W3C.",
      "ja": "8.さらなる議論は良くIETFとW3CのプロセスにUIの問題を統合する方法に必要とされています。"
    },
    {
      "indent": 3,
      "text": "9. Examples of good software configurations that can be cut-and-pasted for popular software, etc., can help. This is not necessarily standards work, but maybe the standards organisations can help and can work with those developing such package-specific documentation.",
      "ja": "カットアンドペーストし人気のあるソフトウェアのため、などすることができます良いソフトウェア構成の9例としては、助けることができます。これは、必ずしも標準化作業ではありませんが、多分標準化団体は助けることができると、このようなパッケージ固有のマニュアルを開発したもので動作することができます。"
    },
    {
      "indent": 3,
      "text": "10. The IETF and W3C can do more so that default (\"out-of-the-box\") settings for protocols better protect security and privacy.",
      "ja": "10. IETFとW3Cは、より多くのように、より良いプロトコルセキュリティとプライバシーを保護するため、デフォルト（「アウト・オブ・ボックス」）の設定を行うことができます。"
    },
    {
      "indent": 3,
      "text": "11. Captive portals [Captive] and some firewalls, too, can and should be distinguished from real man-in-the-middle attacks. This might mean establishing common conventions with makers of such middleboxes, but might also mean developing new protocols. However, the incentives for deploying such new middlebox features might not align.",
      "ja": "11.キャプティブポータル[キャプティブ]と一部のファイアウォールは、あまりにも、そして本物のman-in-the-middle攻撃は区別されなければならないことができます。これは、このようなミドルボックスのメーカーと共通の規則を確立する意味するかもしれませんが、また、新しいプロトコルを開発意味するかもしれません。しかし、そのような新しいミドル機能を展開するためのインセンティブが揃わない場合があります。"
    },
    {
      "indent": 0,
      "text": "3. Workshop Goals",
      "section_title": true,
      "ja": "3.ワークショップの目標"
    },
    {
      "indent": 3,
      "text": "As stated, the STRINT workshop started from the position [RFC7258] that PM is an attack. While some dissenting voices are expected and need to be heard, that was the baseline assumption for the workshop, and the high-level goal was to provide more consideration of that and how it ought to affect future work within the IETF and W3C.",
      "ja": "述べたように、STRINTのワークショップは、PMが攻撃である位置[RFC7258]から始まりました。いくつかの反対の声を期待して聞くことする必要があるが、それは、ワークショップのためのベースラインの仮定で、高レベルの目標は、より多くのことを考慮し、それがどのようにIETFとW3Cの中に将来の仕事に影響を与えるべきを提供することでした。"
    },
    {
      "indent": 3,
      "text": "At the next level down, the goals of the STRINT workshop were to:",
      "ja": "次のレベルダウンでは、STRINGのワークショップの目標はにありました。"
    },
    {
      "indent": 3,
      "text": "o Discuss and hopefully come to agreement among the participants on concepts in PM for both threats and mitigation, e.g., \"opportunistic\" as the term applies to cryptography.",
      "ja": "用語が暗号に適用されるO例えば、「日和見」、議論とうまくいけば脅威と緩和の両方のためのPMにおける概念の参加者の間で合意に達します。"
    },
    {
      "indent": 3,
      "text": "o Discuss the PM threat model, and how that might be usefully documented for the IETF at least, e.g., via an update to BCP 72. [RFC3552]",
      "ja": "O PM脅威モデルを議論し、どのようにそれが有用[RFC3552] BCP 72に更新を介して、例えば、少なくともIETFのために文書化されるかもしれません"
    },
    {
      "indent": 3,
      "text": "o Discuss and progress common understanding in the trade-offs between mitigating and suffering PM.",
      "ja": "O議論と緩和と苦しみPM間のトレードオフで共通の理解を進めます。"
    },
    {
      "indent": 3,
      "text": "o Identify weak links in the chain of Web security architecture with respect to PM.",
      "ja": "O PMに対するWebセキュリティ・アーキテクチャのチェーンの弱いリンクを識別します。"
    },
    {
      "indent": 3,
      "text": "o Identify potential work items for the IETF, IAB, IRTF, and W3C that would help mitigate PM.",
      "ja": "O PMを軽減するのに役立つだろうIETF、IAB、IRTF、およびW3Cのための潜在的な作業項目を識別します。"
    },
    {
      "indent": 3,
      "text": "o Discuss the kinds of action outside the IETF/W3C context that might help those done within the IETF/W3C.",
      "ja": "O IETF / W3C内で行わそれらを助けるかもしれないIETF / W3Cのコンテキスト外のアクションの種類を話し合います。"
    },
    {
      "indent": 0,
      "text": "4. Workshop Structure",
      "section_title": true,
      "ja": "4.ワークショップの構造"
    },
    {
      "indent": 3,
      "text": "The workshop structure was designed to maximise discussion time. There were no direct presentations of submitted papers. Instead, the moderators of each session summarised topics that the Technical Programme Committee (TPC) had agreed based on the submitted papers. These summary presentations took at most 50% of the session and usually less.",
      "ja": "ワークショップの構造は、議論の時間を最大化するように設計されました。提出書類のない直接の発表はありませんでした。代わりに、各セッションの司会者は、技術プログラム委員会（TPC）が提出した書類に基づいて合意したトピックをまとめました。これらの要約のプレゼンテーションは、セッションの最大50％を取って、通常より少ないです。"
    },
    {
      "indent": 3,
      "text": "Because the papers would not be presented during the workshop, participants were asked to read and discuss the papers beforehand, at least those relevant to their fields of interest. (To help people choose papers to read, authors were asked to provide short abstracts.)",
      "ja": "論文は、ワークショップ中に提示されないので、参加者は、事前に興味のある分野に関連する少なくともこれらの論文を読み、議論するよう求めました。 （人が読むための論文を選択しやすくするために、著者は短い要約を提供するように求めていました。）"
    },
    {
      "indent": 3,
      "text": "Most of the sessions had two moderators, one to lead the discussion, while the other managed the queue of people who wanted to speak. This worked well: everybody got a chance to speak and each session still ended on time.",
      "ja": "他に話すことを望んでいた人々のキューを管理しながら、セッションのほとんどは、議論をリードするために、2つのモデレーター、1を持っていました。これはうまく：誰もが話す機会を持って、各セッションは、まだ時間に終了しました。"
    },
    {
      "indent": 3,
      "text": "The penultimate session consisted of break-outs (which turned out to be the most productive sessions of all, most likely simply due to the smaller numbers of people involved). The subjects for the break-outs were agreed during the earlier sessions, and just before the break-out session the participants collectively determined who would attend which.",
      "ja": "最後から二番目のセッションは、（ほとんどの場合、単純に起因する関係者の小さい番号に、すべての最も生産的なセッションであることが判明）ブレイクアウトで構成されていました。ブレイクアウトのための被験者は、以前のセッション中に合意された、ちょうどブレイクアウトセッションの前に参加者を総称しているに出席するだろう誰が決定します。"
    },
    {
      "indent": 0,
      "text": "5. Topics",
      "section_title": true,
      "ja": "5.トピックス"
    },
    {
      "indent": 3,
      "text": "The following sections contain summaries of the various sessions. See the minutes (see Appendix B) for more details.",
      "ja": "次のセクションでは、さまざまなセッションの要約を含んでいます。詳細は、（付録Bを参照）分を参照してください。"
    },
    {
      "indent": 0,
      "text": "5.1. Opening session",
      "section_title": true,
      "ja": "5.1. オープニングセッション"
    },
    {
      "indent": 3,
      "text": "The first session discussed the goals of the workshop. Possible approaches to improving security in the light of pervasive monitoring include a critical look at what metadata is actually required, whether old (less secure) devices can be replaced with new ones, what are \"low-hanging fruit\" (issues that can be handled quickly and easily), and what level of security is \"good enough\": a good solution may be one that is good for 90% of people or 90% of organisations.",
      "ja": "最初のセッションは、ワークショップの目標を議論しました。普及モニタリングの光の中で、セキュリティを改善するための可能なアプローチは、実際に必要とされるもののメタデータで批判的な視線を含んで、古い（安全性が低い）デバイスは新しいものと交換することができるかどうか、処理することができる（問題は「低ぶら下げフルーツ」何ですか迅速かつ容易に）、およびセキュリティのレベルが「十分」である：良い解決策は、人々の90％または組織の90％のために良いですものであってもよいです。"
    },
    {
      "indent": 3,
      "text": "Some participants felt that standards are needed so that people can see if their systems conform to a certain level of security, and easy to remember names are needed for those standards, so that a buyer can immediately see that a product \"conforms to the named intended standard.\"",
      "ja": "買い手はすぐに製品が「意図という名前に準拠していることを見ることができるように、一部の参加者は、彼らのシステムは、セキュリティの一定のレベルに適合している場合、人々が見ることができるように基準が必要であることを感じた、と名前を覚えやすいこれらの基準のために必要とされます標準。\""
    },
    {
      "indent": 0,
      "text": "5.2. Threats",
      "section_title": true,
      "ja": "5.2. 脅威"
    },
    {
      "indent": 3,
      "text": "One difference between \"traditional\" attacks and pervasive monitoring is modus operandi of the attacker: typically, one determines what resources an attacker might want to target and at what cost and then one defends against that threat. But a pervasive attacker has no specific targets, other than to collect everything he can. The calculation of the cost of losing resources vs. the cost of protecting them is thus different. And unlike someone motivated to make money, a PM attacker may not be concerned at the cost of the attack (or may even prefer a higher cost, for \"empire building\" reasons).",
      "ja": "「伝統的な」攻撃と普及モニタリングの違いの1つは、攻撃者の手口である：一般的に、人は攻撃者がターゲットにしたいかもしれないものなリソースを決定し、どのようなコストで、その後1は、その脅威を防御します。しかし、普及攻撃者は、彼ができるすべてを収集する以外に、具体的な目標を持っていません。負け資源の費用対それらを保護するためのコストの計算は、このように異なっています。そして、お金を稼ぐために意欲的に誰かとは異なり、PMの攻撃者は、攻撃のコストを懸念することはできません（あるいは「帝国の建物」の理由で、高いコストを好む場合があります）。"
    },
    {
      "indent": 3,
      "text": "The terminology used to talk about threats has to be chosen carefully (this was a common theme in several sessions), because we need to explain to people outside the technical community what they need to do or not do. For example, authentication of endpoints doesn't so much \"protect against\" man-in-the-middle (MITM) attacks as make them visible. The attacker can still mount an attack but does not remain invisible while he does so. Somebody on either end of the conversation needs to react to the alert from the system: stop the conversation or find a different channel.",
      "ja": "脅威について話すために使用される用語は、我々は彼らが行うかどうか何をする必要があるか技術コミュニティ外の人に説明する必要があるため、（これはいくつかのセッションで共通のテーマだった）を慎重に選択しなければなりません。例えば、エンドポイントの認証はあまりないを行い、それらを見えるようになどのman-in-the-middle（MITM）攻撃「から守ります」。攻撃者は、まだ攻撃を仕掛けることができますが、彼はそうしながら、目に見えないままではありません。会話を停止するか、別のチャンネルを見つける：会話のどちらかの端に誰かがシステムから警告に反応する必要があります。"
    },
    {
      "indent": 3,
      "text": "Paradoxically, while larger sites such as Facebook, Yahoo, and Google supervise the security of their respective services more than other smaller sites, such large sites offer a much more attractive target to attack. Avoiding overuse of such repositories for private or sensitive information may be a useful measure that increases the cost of collecting for a pervasive attacker. This is sometimes called the target-dispersal approach.",
      "ja": "こうしたフェイスブック、ヤフー、とGoogleなどの大規模なサイトは、他の小規模なサイトよりも、それぞれのサービスのセキュリティを監督しながら、逆説的に、このような大規模なサイトが攻撃をはるかに魅力的な標的を提供します。プライベートまたは機密情報のためのこのようなリポジトリの過剰使用を回避することパーベイシブ攻撃者収集のコストを増加させる有用な尺度とすることができます。これは時々、ターゲット・分散アプローチと呼ばれています。"
    },
    {
      "indent": 3,
      "text": "Lack of interoperability between systems can lead to poorly thought out work-arounds and compromises that may themselves introduce vulnerabilities. Thus, improving interoperability needs to be high on the list of priorities of standards makers and even more for implementers. Of course, testing (such as interop testing) is, at some level, part of the process of the IETF and W3C; and the W3C is currently increasing its testing efforts.",
      "ja": "システム間の相互運用性の欠如は、自身が脆弱性を導入することが悪い考え抜か回避策や妥協につながることができます。このように、相互運用性を向上させることが規格メーカーの優先順位や実装のための一層のリストの上位にする必要があります。当然のことながら、（このような相互運用テストなど）をテストすることは、いくつかのレベルでは、IETFとW3Cのプロセスの一部です。そしてW3Cは現在、テスト作業が増加しています。"
    },
    {
      "indent": 0,
      "text": "5.3. Increase Usage of Security Tools",
      "section_title": true,
      "ja": "5.3. セキュリティツールの使用量が増加"
    },
    {
      "indent": 3,
      "text": "The first session on Communication Security (COMSEC) tools looked at the question why existing security tools aren't used more.",
      "ja": "通信セキュリティ（COMSEC）ツールの最初のセッションは、既存のセキュリティツールが多く使用されていない理由を質問を見ました。"
    },
    {
      "indent": 3,
      "text": "The example of the public key infrastructure used to secure HTTP is informative. One problem is that certification authorities (CAs) may issue a certificate for any domain. Thus, a single compromised CA can be used in combination with a MITM to impersonate any server. Moreover, ongoing administration, including requesting, paying for, and installing new certificates, has proven over time to be an insurmountable barrier for many web site administrators, leading them not to bother to secure their systems.",
      "ja": "HTTPを保​​護するために使用する公開鍵インフラストラクチャの例は有益です。一つの問題は、証明機関（CA）は任意のドメインの証明書を発行することができるということです。したがって、単一損なわCAは、​​任意のサーバを偽装するMITMと組み合わせて使用​​することができます。また、要求の支払い、および新しい証明書をインストールするなど、継続的な管理は、自社のシステムを確保するためにわざわざしないようにそれらをリードし、多くのWebサイトの管理者のために乗り越えられない障壁であることを時間をかけて証明されています。"
    },
    {
      "indent": 3,
      "text": "Some ideas were discussed for improving the CA system, e.g., via cross-certification of CAs and by means of \"certificate transparency\" -- a public, permanent log of who issued which certificate [RFC6962].",
      "ja": "公共、その証明書[RFC6962]を発行した人の永久ログ - いくつかのアイデアは、CAの相互認証を経て、例えば、CAシステムを改善するためと、「証明書の透明性」によって議論されました。"
    },
    {
      "indent": 3,
      "text": "Using other models than the hierarchical certificate model (as alternative or in combination) may also help. Pretty Good Privacy (PGP) demonstrates a model known as a \"web of trust\" where people verify the public key of the people they meet. Because there is no innate transitive trust in PGP, it is appropriate only for small-scale uses; an example is a team of people working on a project.",
      "ja": "（代替または組み合わせとして）階層証明モデル以外のモデルを使用することも助けることができます。プリティグッドプライバシー（PGP）は、人々は、彼らが出会った人の公開鍵を検証する「信頼のウェブ」として知られているモデルを示しています。 PGPには先天性の推移的な信頼がないので、小規模で使用するだけのために適切です。例では、プロジェクトに取り組んでいる人のチームです。"
    },
    {
      "indent": 3,
      "text": "Yet another model is \"trust on first use\" (TOFU). This is used quite effectively by SSH [RFC4252]. On the first connection, one has no way to verify that the received public key belongs to the server one is contacting, therefore, the key is accepted without further verification. But on the subsequent connections, one can verify that the received key is the same key as the first time. So, a MITM has to be there on all connections, including the first; otherwise, it will be detected by a key mismatch.",
      "ja": "さらに別のモデルは、「最初の使用上の信託」（豆腐）です。これは、SSH [RFC4252]で非常に効果的に使用されます。最初の接続で、一方は受信した公開鍵は、したがって、キーは、さらなる検証なしに受け入れられ、接触している一つのサーバに属することを確認する方法がありません。しかし、その後の接続で、1は、受信したキーが初めてと同じキーであることを確認することができます。だから、MITMは最初を含め、すべての接続、でそこにする必要があり、それ以外の場合は、キーの不一致によって検出されます。"
    },
    {
      "indent": 3,
      "text": "This works well for SSH, because people typically use SSH to communicate with a small number of servers over and over again. And, if they want, they may find a separate channel to get the public key (or its fingerprint). It may also work for web servers used by small groups (the server of a sports club, a department of a company, etc.), but probably works less well for public servers that are visited once or a few times or for large services where many servers may be used.",
      "ja": "人々は一般的に何度も何度も少数のサーバと通信するためにSSHを使用するので、これは、SSHに適しています。そして、彼らが望むならば、彼らは、公開鍵（またはその指紋）を取得するために別のチャンネルを見つけることができます。また、小グループ（スポーツクラブのサーバー、会社の部署など）で使用されるWebサーバのために働く、おそらく一度訪れている公開サーバまたは数回または大規模なサービスの場所のためにあまりうまく機能します多くのサーバーを使用することができます。"
    },
    {
      "indent": 3,
      "text": "A similar proposal [RFC7469] for an HTTP header introduces an aspect of TOFU into HTTP: Key pinning tells HTTP clients that for a certain time after receiving this certificate, they should not expect the certificate to change. If it does, even if the new certificate looks valid, the client should assume a security breach.",
      "ja": "HTTPヘッダの同様の提案[RFC7469]はHTTPに豆腐の態様を紹介：キーピニングは、この証明書を受信した後一定時間の間、彼らは証明書を変更するために期待すべきではないことをHTTPクライアントに伝えます。それがない場合は、新しい証明書が有効なように見えても、クライアントがセキュリティ侵害を前提とすべきです。"
    },
    {
      "indent": 3,
      "text": "The Session Initiation Protocol (SIP) [RFC3261] can require several different intermediaries in different stages of the communication to deal with NAT traversal and to handle policy. While both hop-by-hop and end-to-end encryption are specified, in practice, many SIP providers disable these functions. The reasons for disabling end-to-end security here are understandable: to overcome lack of interoperability they often need to change protocol headers and modify protocol data. Some workshop participants argued that SIP would never have taken off if it hadn't been possible for providers to monitor and interfere in communications in this way. Of course, that means an attacker can listen in just as easily.",
      "ja": "セッション開始プロトコル（SIP）[RFC3261]はNATトラバーサルに対処するために、ポリシーを処理するために、通信の異なる段階で、いくつかの異なる仲介を必要とし得ます。両方のホップバイホップとエンドツーエンドの暗号化が指定されていますが、実際には、多くのSIPプロバイダーは、これらの機能を無効にします。ここでは、エンドツーエンドのセキュリティを無効にする理由は理解している：彼らは多くの場合、プロトコルヘッダーを変更し、プロトコルデータを変更する必要があり、相互運用性の欠如を克服するために。いくつかのワークショップの参加者は、プロバイダが監視し、このように通信に干渉することができていなかった場合、SIPが離陸したことはなかっただろうと主張しました。もちろん、それは、攻撃者は同じように簡単に聞くことができることを意味します。"
    },
    {
      "indent": 3,
      "text": "A new protocol for peer-to-peer communication of video and audio (and potentially other data) is WebRTC. WebRTC reuses many of the same architectural concepts as SIP, but there is a reasonable chance that it can do better in terms of protecting users: The people implementing the protocols and offering the service have different goals and interests. In particular, the first implementers are browser makers, who may have different business models from other more traditional Voice over IP providers.",
      "ja": "ビデオとオーディオ（及び潜在的に他のデータ）のピア・ツー・ピア通信のための新しいプロトコルがのWebRTCあります。 WebRTCは、SIPと同じアーキテクチャの概念の多くを再利用し、それがユーザーを保護するという点でより良い行うことができ、合理的な可能性がある：人々のプロトコルを実装し、サービスを提供するには、さまざまな目標や興味を持っています。具体的には、最初の実装は、IPプロバイダを介して他のより伝統的な声は異なるビジネスモデルを有していてもよく、ブラウザメーカー、です。"
    },
    {
      "indent": 3,
      "text": "XMPP [RFC6120] suffers from yet a different kind of problem. It has encryption and authentication, and the OTR (\"off the record\") extension even provides what is called Perfect Forward Secrecy (PFS), i.e., compromising the current communication never gives an attacker enough information to decrypt past communications that he may have recorded. But, in practice, many people don't use XMPP at all, but rather Skype, WhatsApp, or other instant-messaging tools with unknown or no security. The problem here seems to be one of user awareness. And though OTR does provide security, it is not well integrated with XMPP, nor is it available as a core feature of XMPP clients.",
      "ja": "XMPP [RFC6120]は、問題のさらに別の種類に苦しんでいます。それはつまり、暗号化と認証、および（「オフレコ」）OTR拡張子も完全転送秘密（PFS）と呼ばれるものを提供し、現在の通信は、彼が記録している可能性が過去の通信を解読するために、攻撃者に十分な情報を与え決して妥協することがあります。しかし、実際には、多くの人が不明またはセキュリティなしで全くXMPPのではなく、スカイプ、のWhatsApp、または他のインスタントメッセージングツールを使用しないでください。ここでの問題は、ユーザーの意識の一つのようです。 OTRは、セキュリティが提供されていても、それはうまくXMPPに統合されていない、またそれは、XMPPクライアントのコア機能として提供されています。"
    },
    {
      "indent": 3,
      "text": "To increase usage of existing solutions, some tasks can be identified; though how those map to actions for, e.g., IETF/W3C is not clear:",
      "ja": "既存のソリューションの利用を高めるために、いくつかのタスクを識別することができます。 ：のためのアクションに、これらのマップは、例えば、IETF / W3Cは明らかではないが、どのようにかかわらず、"
    },
    {
      "indent": 3,
      "text": "o Improvements to the certificate system, such as certificate transparency (CT).",
      "ja": "そのような証明書の透明性（CT）などの証明書システムの改善、O。"
    },
    {
      "indent": 3,
      "text": "o Making it easier (cheaper, quicker) for system administrators to deploy secure solutions.",
      "ja": "それは（、より安くより早く）簡単にシステム管理者は安全なソリューションを展開するために作り、O。"
    },
    {
      "indent": 3,
      "text": "o Improve awareness of the risks. Identify which communities influence which decisions and what is the appropriate message for each.",
      "ja": "Oリスクの意識を向上させます。それぞれに適切なメッセージである意思決定とどのような影響を与えているコミュニティ識別します。"
    },
    {
      "indent": 3,
      "text": "o Provide an upgrade path that doesn't break existing systems or require that everybody upgrade at the same time. Opportunistic Security may be one model for that.",
      "ja": "O既存のシステムを壊すか、皆が同時にアップグレードすることを必要としないアップグレードパスを提供します。日和見セキュリティは、そのための一つのモデルかもしれません。"
    },
    {
      "indent": 0,
      "text": "5.4. Policy Issues and Non-technical Actions",
      "section_title": true,
      "ja": "5.4. 政策の問題と非技術的なアクション"
    },
    {
      "indent": 3,
      "text": "Previous sessions already concluded that the problem isn't just technical, such as getting the right algorithms in the standards, fixing interoperability, or educating implementers and systems administrators. There are user interface issues and education issues too. And there are also legal issues and policy issues for governments.",
      "ja": "前のセッションがすでに問題は、このような、標準規格に右アルゴリズムを取得し、相互運用性を固定し、または実装者やシステム管理者を教育として、単に技術的ではないと結論付けました。ユーザーインターフェースの問題や教育の問題もあります。そして、政府の法的問題と政策課題もあります。"
    },
    {
      "indent": 3,
      "text": "It appears that the public, in general, demands more privacy and security (e.g., for their children) but are also pessimistic about getting that. They trust that somebody assures that nothing bad happens to them, but they also expect to be spied on all the time.",
      "ja": "国民が、一般的には、（自分の子供のための、例えば、）より、プライバシーとセキュリティを要求だけでなく、それを得ることについて悲観的であることを表示されます。彼らは、誰かが悪い何が彼らに起こらないことを保証することを信頼し、彼らはまた、すべての時間をスパイすることを期待しています。"
    },
    {
      "indent": 3,
      "text": "(Perceived) threats of terrorism gave governments a reason to allow widespread surveillance, far beyond what may previously have been considered dangerous for freedom.",
      "ja": "テロの（知覚）の脅威がはるか以前に、自由のために危険と考えられていたかもしれないものを超えて、広範な監視を可能にするために、政府に理由を与えました。"
    },
    {
      "indent": 3,
      "text": "In this environment, the technical community will have a hard time developing and deploying technologies that fully counter PM, which means there has to be action in the social and political spheres, too.",
      "ja": "この環境では、技術的なコミュニティは、あまりにも、社会的、政治的球でのアクションがなければならないことを意味する、苦労技術完全にカウンターPMの開発と展開を持つことになります。"
    },
    {
      "indent": 3,
      "text": "Technology isn't the only thing that can make life harder for attackers. Government-sponsored PM is indirectly affected by trade agreements and treaties, and thus it makes sense to lobby for those to be as privacy-friendly as possible.",
      "ja": "テクノロジーは、攻撃者のための生活が困難に作ることができる唯一のものではありません。政府主催のPMは、間接的貿易協定や条約の影響を受けているので、それはプライバシーに優しいできるだけのようにそれらのために働きかけることは理にかなっています。"
    },
    {
      "indent": 3,
      "text": "Court cases on the grounds of human rights can also influence policy, especially if they reach, for example, the European Court of Human Rights.",
      "ja": "人権を理由に裁判所の例はまた、例えば、彼らが到達する場合は特に、欧州人権裁判所の政策に影響を与えることができます。"
    },
    {
      "indent": 3,
      "text": "In medicine and law, it is common to have ethics committees, not so in software. Should standards bodies such as the IETF and W3C have an ethics committee? Standards such as the Geolocation API [w3c-geo-api] have gotten scrutiny from privacy experts, but only in an ad hoc manner. (W3C has permanent groups to review standards for accessibility and internationalisation. It also has a Privacy group, but that currently doesn't do the same kind of systematic reviews.)",
      "ja": "医学や法律では、そうではないソフトウェアので、倫理委員会を持つことが一般的です。このようIETFやW3Cなどの標準化団体は倫理委員会を持っているべきですか？そのようなジオロケーションAPI [W3C-GEO-API]などの規格がなく、唯一のアドホックな方法で、プライバシーの専門家からの精査を頂いております。 （W3Cは、アクセシビリティや国際化のための基準を検討する常設のグループを持っている。また、個人情報保護基を有しているが、それは現在の系統的レビューの同じ種類を行いません。）"
    },
    {
      "indent": 3,
      "text": "As the Internet-Draft draft-barnes-pervasive-problem-00 [Barnes] (which was included as paper 44) explains, PM doesn't just monitor the networks, but also attacks at the endpoints, turning organisations or people into (willing, unwilling, or unwitting) collaborators. Note: that document later evolved into [RFC7624]. One technical means of protection is thus to design protocols such that there are fewer potential collaborators, e.g., a provider of cloud storage cannot hand over plaintext for content that is encrypted with a key he doesn't have, and cannot hand over names if his client is anonymous.",
      "ja": "（紙44として含まれていた）インターネットドラフトドラフト・バーンズ・普及-問題-00 [バーンズ]が説明するように、PMだけでネットワークを監視するだけでなく、エンドポイントで攻撃し、（意思に組織や人を回すことはありません共同研究者）、不本意、あるいは無意識。注意：そのドキュメントは、後で[RFC7624]へと進化。保護の1つの技術的な手段が少ない可能性協力者、例えばがあるというようなプロトコルを設計することで、クラウドストレージの提供者は、彼が持っていない鍵で暗号化されたコンテンツの平文を引き渡すことができない、と彼の場合は名前を引き渡すことができませんクライアントは、匿名です。"
    },
    {
      "indent": 3,
      "text": "It is important to distinguish between PM and fighting crime. PM is an attack, but a judge ordering the surveillance of a suspected criminal is not. The latter, often abbreviated in this context as LI (for Lawful Intercept) is outside the scope of this workshop.",
      "ja": "PMとの戦いの犯罪を区別することが重要です。 PMは攻撃ですが、疑いの犯罪者の監視を注文裁判官はありません。多くの場合、（合法的傍受のための）LIとして、この文脈で略記後者は、このワークショップの範囲外です。"
    },
    {
      "indent": 0,
      "text": "5.5. Improving the Tools",
      "section_title": true,
      "ja": "5.5. ツールの改善"
    },
    {
      "indent": 3,
      "text": "An earlier session discussed why existing COMSEC tools weren't used more. This second session on COMSEC therefore discussed what improvements and/or new tools were needed.",
      "ja": "既存のCOMSECツールがより使用されなかった理由は、以前のセッションが議論しました。 COMSECのこの第二セッションでは、そのために必要であったものを改良および/または新しいツールについて説明しました。"
    },
    {
      "indent": 3,
      "text": "Discussion at the workshop indicated that an important meta-tool for improving existing security technology could be Opportunistic Security (OS) [Kent]. The idea is that software is enhanced with a module that tries to encrypt communications when it detects that the other end also has the same capability, but otherwise it lets the communication continue in the old way. The detailed definition of OS was being discussed by the IETF Security Area Advisory Group at the time of this workshop [SAAG_list].",
      "ja": "ワークショップでの議論は、既存のセキュリティ技術を向上させるための重要なメタツールは日和見セキュリティ（OS）[ケント]ことができることを示しました。アイデアは、ソフトウェアは、それはもう一方の端も同じ能力を持っていることを検出した場合、通信を暗号化しようとするモジュールで強化されていることですが、それ以外の場合は、通信は古い方法で継続することができます。 OSの詳細な定義は[SAAG_list]このワークショップの時にIETFセキュリティエリア諮問グループで議論されました。"
    },
    {
      "indent": 3,
      "text": "OS would protect against a passive eavesdropper but should also allow for endpoint authentication to protect against an active attacker (a MITM). As OS spreads, more and more communications would be encrypted (and hopefully authenticated), and thus there is less and less for an eavesdropper to collect.",
      "ja": "OSは、受動盗聴者から守るだろうが、エンドポイントの認証は、アクティブ攻撃者（MITM）から保護するためにも許可する必要があります。 OSが広がるように、より多くの通信は暗号化された（そして、できれば認証され）、従って盗聴者が収集するために少なく存在することになります。"
    },
    {
      "indent": 3,
      "text": "Of course, an implementation of OS could give a false sense of security as well: some connections are encrypted, some are not. A user might see something like a padlock icon in browsers, but there was agreement at the workshop that such user interface features ought not be changed because OS is being used.",
      "ja": "もちろん、OSの実装は、同様に誤った安心感を与えることができる。いくつかの接続が暗号化され、一部ではありません。ユーザーは、ブラウザに南京錠のアイコンのようなものが表示される場合がありますが、OSが使用されているので、このようなユーザインタフェース機能を変更することはないはずワークショップで合意がありました。"
    },
    {
      "indent": 3,
      "text": "There is also the possibility that a MITM intercepts the reply from a server that says \"yes, I can do encryption\" and removes it, causing the client to fall back to an unencrypted protocol. Mitigations against this can be to have other channels of finding out a server's capabilities and remembering that a server could do encryption previously.",
      "ja": "MITMは、クライアントが暗号化されていないプロトコルにフォールバックさせ、「はい、私は暗号化を行うことができます」と言うと、それを削除し、サーバーからの応答を傍受する可能性もあります。これに対する緩和策は、サーバーの機能を見つけると、サーバが以前に暗号化を行うことができることを思い出すの他のチャンネルを持つことができます。"
    },
    {
      "indent": 3,
      "text": "There is also, again, a terminology problem. The technical descriptions of OS talk about \"silent fail\" when a connection couldn't be encrypted and has to fall back to the old, unencrypted protocol. Actually, it's not a fail; it's no worse than it was before. A successful encryption would rather be a \"silent improvement.\"",
      "ja": "用語の問題は、再び、もあります。接続が暗号化され、昔、暗号化されていないプロトコルに落ちていることができなかったときに「サイレントが失敗」についてのOSの話の技術的な説明。実際に、それは失敗しません。それが以前よりも悪くないんです。成功した暗号化は、むしろ「サイレント改善。」だろう"
    },
    {
      "indent": 3,
      "text": "That raises the question of the UI: How do you explain to a user what their security options are, and, in case an error occurs, how do you explain the implications of the various responses?",
      "ja": "それはUIの問題提起：どのようにあなたは彼らのセキュリティオプションが何であるかをユーザーに説明しますが、そして、場合にエラーが発生し、どのように様々な回答の意味を説明していますか？"
    },
    {
      "indent": 3,
      "text": "The people working on encryption are mathematicians and engineers, and typically not the same people who know about UI. We need to involve the experts. We also need to distinguish between usability of the UI, user understanding, and user experience. For an e-commerce site, e.g., it is not just important that the user's data is technically safe, but also that he feels secure. Otherwise, he still won't buy anything.",
      "ja": "暗号化に働いている人は、数学者やエンジニア、そして典型的にはUIを知っている人と同じです。私たちは、専門家が関与する必要があります。また、UIのユーザビリティ、ユーザーの理解、およびユーザーエクスペリエンスを区別する必要があります。電子商取引サイトの場合、例えば、ユーザーのデータは、技術的に安全であることだけが重要ではないですが、また、彼は安全な感じています。そうでなければ、彼はまだ何も買わないだろう。"
    },
    {
      "indent": 3,
      "text": "When talking about users, we also need to distinguish the end user (who we typically think about when we talk about UI) from the server administrators and other technical people involved in enabling a connection. When something goes wrong (e.g., the user's software detects an invalid certificate), the message usually goes to the end user. But, he isn't necessarily the person who can do something about it. For example, if the problem is a certificate that expired yesterday, the options for the user are to break the connection (the safe choice, but it means he can't get his work done) or continue anyway (there could be a MITM). The server administrator, on the other hand, could actually solve the problem.",
      "ja": "ユーザーの話をするとき、我々はまた、サーバー管理者との接続を可能に関与する他の技術者から（私たちは一般的に、我々はUIについて話すときを考える）エンドユーザーを区別する必要があります。何かが間違っている（例えば、ユーザーのソフトウェアは無効な証明書を検出した）になると、メッセージは通常、エンド・ユーザーに行きます。しかし、彼は必ずしもそれについて何かを行うことができた人ではありません。問題は、昨日の期限が切れた証明書であれば、例えば、使用者のためのオプションは、接続破るためにある（安全な選択を、それは彼が彼の仕事を成し遂げることができないことを意味する）か、とにかく続ける（MITMがあるかもしれません） 。サーバ管理者は、他の一方で、実際に問題を解決することができます。"
    },
    {
      "indent": 3,
      "text": "Encryption and authentication have a cost, in terms of setting them up, but also in terms of the time it takes for software to do the calculations. The setup cost can be reduced with sensible defaults, predefined profiles, and cut-and-paste configurations. And for some connections, authentication without encryption could be enough, in the case that the data doesn't need to be kept secret, but it is important to know that it is the real data. Most mail user agents (UA) already provide independent options for encryption and signing, but web servers only support authentication if the connection is also encrypted.",
      "ja": "暗号化と認証は、それらを設定するという点で、コストを持っているだけでなく、時間的にそれが計算を行うためのソフトウェアにかかります。セットアップ費用は適切なデフォルト値、事前に定義されたプロファイル、およびカットアンドペースト構成で減少させることができます。そして、いくつかの接続のために、暗号化なしの認証は、データを秘密にする必要がない場合に、十分かもしれないが、実際のデータであることを知っておくことが重要です。ほとんどのメールユーザエージェント（UA）は、すでに暗号化と署名のための独立したオプションを提供しますが、接続はまた、暗号化されている場合、Webサーバーは認証のみをサポートしています。"
    },
    {
      "indent": 3,
      "text": "On the other hand, as email also shows, it is difficult for users to understand what encryption and authentication do separately.",
      "ja": "ユーザーが個別に何をすべきか、暗号化と認証理解する一方で、電子メールにも示すように、それは困難です。"
    },
    {
      "indent": 3,
      "text": "It also has to be kept in mind that encrypting only the \"sensitive\" data and not the rest decreases the cost for an attacker, too: It becomes easy to know which connections are worth attacking. Selective field confidentiality is also more prone to lead to developer error, as not all developers will know the provenance of values to be processed.",
      "ja": "また、唯一の「機密」のデータを暗号化していない残りの部分は、あまりにも、攻撃者のコストを減少させることを心に留めておかなければなりません：それは攻撃価値があるどの接続を知ることが容易となります。選択フィールドの機密性もなく、すべての開発者が処理する値の出所を知っているように、開発者のエラーにつながるやすいです。"
    },
    {
      "indent": 3,
      "text": "One problem with the TOFU model as used by SSH (see explanation above) is that it lacks a solution for key continuity: When a key is changed (which can happen, e.g., when a server is replaced or the software upgraded), there is no way to inform the client. (In practice, people use other means, such as calling people on the phone or asking their colleagues in the office, but that doesn't scale and doesn't always happen either.) An improvement in the SSH protocol could thus be a way to transfer a new key to a client in a safe way.",
      "ja": "SSHで使用されるようTOFUモデルの一つの問題（上記の説明を参照）、それは重要な継続のためのソリューションを欠いていることである：（サーバーを交換したり、ソフトウェアがアップグレードされるとき、例えば、発生する可能性がある）キーを変更すると、そこにありますクライアントに通知する方法はありません。 （実際には、どちらかの人々は、このような電話で人を呼び出すか、オフィスで同僚に尋ねるなど、他の手段を使用し、それはスケールしない、常に発生しません。）SSHプロトコルの改善は、このような方法かもしれません安全な方法でクライアントに新しいキーを転送します。"
    },
    {
      "indent": 0,
      "text": "5.6. Hiding Metadata",
      "section_title": true,
      "ja": "5.6. 非表示のメタデータ"
    },
    {
      "indent": 3,
      "text": "Encryption and authentication help protect the content of messages. Correctly implemented encryption is very hard to crack. (To get the content, an attacker would rather attempt to steal the keys, corrupt the encoding software, or get the content via a collaborator. See [RFC7624] for more information on \"collaborator\".) But encrypting the content doesn't hide the fact that you are communicating. This metadata (who talks to whom, when, and for how long) is often as interesting as the content itself, and in some cases the size and timing of messages is even an accurate predictor of the content. So how to stop an attacker from collecting metadata, given that much of that data is actually needed by routers and other services to deliver the message to the right place?",
      "ja": "暗号化と認証は、メッセージの内容を保護します。正しく実装暗号化はクラックするのは非常に困難です。 （コンテンツを取得するには、攻撃者はむしろキー、壊れエンコードソフトウェアを盗もうとする、または協力者を介してコンテンツを取得することになります。「協力者」の詳細については、[RFC7624]を参照してください。）しかし、コンテンツは非表示にしていない暗号化あなたが通信しているという事実。このメタデータは、（誰がいつ、どのくらいのために、誰に話す）、多くの場合、コンテンツそのものと同じくらい面白いです、そしていくつかのケースでは、メッセージのサイズおよびタイミングは、コンテンツのも、正確な予測因子です。だから、どのようにデータの多くが実際に適切な場所にメッセージを配信するために、ルータや他のサービスで必要とされることを考えると、メタデータの収集からの攻撃を停止するには？"
    },
    {
      "indent": 3,
      "text": "It is useful to distinguish different kinds of metadata: explicit (or metadata proper) and implicit (sometimes called traffic data). Implicit metadata is things that can be derived from a message or are necessary for its delivery, such as the destination address, the size, the time, or the frequency with which messages pass. Explicit metadata is things like quality ratings, provenance, or copyright data: data about the data, useful for an application, but not required to deliver the data to its endpoint.",
      "ja": "明示的な（またはメタデータの適切）および暗黙的（とも呼ばれるトラフィックデータ）：メタデータの種類を区別するために有用です。暗黙的なメタデータは、宛先アドレス、サイズ、時間、またはメッセージが通過する頻度として、メッセージに由来するか、またはその送達のために必要であることができるものです。明示的なメタデータは、品質評価、出所、または著作権データのようなものです：データに関するデータ、アプリケーションに役立つが、そのエンドポイントにデータを配信する必要はありません。"
    },
    {
      "indent": 3,
      "text": "A system such as Tor hides much of the metadata by passing through several servers, encrypting all the data except that which a particular server needs to see. Each server thus knows which server a message came from and where it has to send it to, but cannot know where the previous server got it from or where the next server is instructed to send it. However, deliberately passing through multiple servers makes the communication slower than taking the most direct route and increases the amount of traffic the network as a whole has to process.",
      "ja": "このようTorのようなシステムは、特定のサーバを参照する必要があることを除いて、すべてのデータを暗号化し、複数のサーバを通過することにより、メタデータの多くを隠します。各サーバーは、このようにメッセージがどこから来ているサーバーを知っていると、それはそれを送信するために持っていますが、以前のサーバーからそれを得たか、次のサーバが指示された場合、それを送信するために場所を知ることができないところ。しかし、故意に複数のサーバを通過することは最も直接的なルートを取るよりも、通信が遅くなり、全体を処理しなければならないとして、トラフィック量ネットワークが増加します。"
    },
    {
      "indent": 3,
      "text": "There are three kinds of measures that can be taken to make metadata harder to get: aggregation, contraflow, and multipath (see \"Flows and Pervasive Monitoring\" [Paper4]). New protocols should be designed such that these measures are not inadvertently disallowed, e.g., because the design assumes that the whole of a conversation passes through the same route.",
      "ja": "集約、contraflow、およびマルチパス（参照「フローとパーベイシブ監視」[Paper4]）：取得するには難しく、メタデータを作るために撮影することができます対策の3種類があります。デザインは、会話の全体が同じルートを通ることを前提としているため、新たなプロトコルは、例えば、これらの措置が誤って禁止されていないように設計されなければなりません。"
    },
    {
      "indent": 3,
      "text": "\"Aggregation\" means collecting conversations from multiple sources into one stream. For example, if HTTP connections pass through a proxy, all the conversations appear to come from the proxy instead of from their original sources. (This assumes that telltale information in the headers is stripped by the proxy or that the connection is encrypted.) It also works in the other direction: if multiple web sites are hosted on the same server, an attacker cannot see which of those web sites a user is reading. (This assumes that the name of the site is in the path info of the URL and not in the domain name; otherwise, watching DNS queries can still reveal the name.)",
      "ja": "1つのストリームに複数のソースからの会話を集める「集約」を意味します。 HTTP接続がプロキシを通過した場合、すべての会話は、プロキシからではなく、元のソースから来るように見えます。 （これは、ヘッダの証拠となる情報がプロキシまたは接続が暗号化されていることを剥奪されていることを前提としています。）また、他の方向に動作します：複数のWebサイトが同じサーバーでホストされている場合、攻撃者がこれらのウェブサイトのかを確認することはできませんユーザーが読んでいます。 （; DNSクエリは、まだ名前を明らかにすることができます見て、そうでない場合これは、サイトの名前はURLのパス情報ではなく、ドメイン名であることを前提としています。）"
    },
    {
      "indent": 3,
      "text": "\"Contraflow\" means routing a conversation via one or more other servers than the normal route, e.g., by using a tunnel (e.g., with SSH or a VPN) to another server. Tor is an example of this. An attacker must watch more routes and do more effort to correlate conversations. (Again, this assumes that there is no telltale information left in the messages that leave the tunnel.)",
      "ja": "「Contraflow」は、別のサーバに（SSHまたはVPNを用いて、例えば）トンネルを使用して、例えば、通常の経路よりも一つ以上の他のサーバを介して会話をルーティングすることを意味します。 Torのはその一例です。攻撃者は、より多くのルートを見て会話を相関させる多くの努力を行う必要があります。 （再び、これはトンネルを残すメッセージに残された証拠となる情報が存在しないことを前提としています。）"
    },
    {
      "indent": 3,
      "text": "\"Multipath\" splits up a single conversation (or a set of related conversations) and routes the parts in different ways, e.g., sending a request via a satellite link and receiving the response via a land line, or starting a conversation on a cellular link and continuing it via Wi-Fi. This again increases the cost for an attacker, who has to monitor and correlate data traversing multiple networks.",
      "ja": "「マルチパス」は、単一の会話（または関連する会話の組）を構成分割し、経路の異なる方法で部分、例えば、衛星リンクを介して要求を送信し、陸線を介して応答を受信する、または細胞リンク上の会話を開始しますそして、のWi-Fiを経由して、それを継続。これは、再び複数のネットワークを通過するデータを監視し、相関させるために攻撃者のためのコストを増加させます。"
    },
    {
      "indent": 3,
      "text": "Protecting metadata automatically with technology at a lower layer than the application layer is difficult. The applications themselves need to pass less data, e.g., use anonymous temporary handles instead of permanent identifiers. There is often no real need for people to use the same identifier on different computers (smartphone, desktop, etc.) other than that the application they use was designed that way.",
      "ja": "アプリケーション層よりも下位層で技術を使用して自動的にメタデータを保護することは困難です。アプリケーション自体は、例えば、以下のデータを渡す匿名の一時的なハンドルの代わりに、永続的な識別子を使用する必要があります。人々は、彼らが使用するアプリケーションがそのように設計されたこと以外の異なるコンピュータ（スマートフォン、デスクトップなど）に同じ識別子を使用するためには本当の必要がしばしばありません。"
    },
    {
      "indent": 3,
      "text": "One thing that can be done relatively easily in the short term is to go through existing protocols to check what data they send that isn't really necessary. One candidate mentioned for such a study was XMPP.",
      "ja": "短期的には比較的容易に行うことができることの一つは、彼らはそれが本当に必要ではありません送信どのデータをチェックするために既存のプロトコルを通過することです。そのような研究のために言及した一つの候補は、XMPPました。"
    },
    {
      "indent": 3,
      "text": "\"Fingerprinting\" is the process of distinguishing different senders of messages based on metadata [RFC6973]: Clients can be recognised (or at least grouped) because their messages always have a combination of features that other clients' messages do not have. Reducing redundant metadata and reducing the number of optional features in a protocol reduces the variation between clients and thus makes fingerprinting harder.",
      "ja": "「フィンガープリント」はに基づいてメッセージの異なる送信者を区別するプロセスですメタデータ[RFC6973]：彼らのメッセージは、常に他のクライアントのメッセージが持っていない機能の組み合わせを持っているので、クライアントは（あるいは少なくともグループ化）を認識することができます。冗長メタデータを削減し、プロトコルにオプション機能の数を減らすとクライアント間の変動を減少させ、したがって、フィンガープリントは難しくなります。"
    },
    {
      "indent": 3,
      "text": "Traffic analysis is a research discipline that produces sometimes surprising findings that are little known among protocol developers. Some collections of results are",
      "ja": "トラフィック分析はほとんどないプロトコルの開発者の間で知られ、時には驚くべき発見を生産する研究分野です。結果の一部コレクションはあります"
    },
    {
      "indent": 3,
      "text": "o a selected bibliography on anonymity by the Free Haven Project <http://freehaven.net/anonbib/>,",
      "ja": "O無料ヘブンプロジェクト<http://freehaven.net/anonbib/>によって匿名で選択した参考文献、"
    },
    {
      "indent": 3,
      "text": "o the yearly Symposium on Privacy Enhancing Technologies (PETS) <http://www.informatik.uni-trier.de/~Ley/db/conf/pet/index.html>, and",
      "ja": "毎年のプライバシー強化技術に関するシンポジウム（PETS）<http://www.informatik.uni-trier.de/~Ley/db/conf/pet/index.html>、およびO"
    },
    {
      "indent": 3,
      "text": "o the yearly Workshop on Privacy in the Electronic Society (WPES) <http://www.informatik.uni-trier.de/~Ley/db/conf/wpes/index.html>.",
      "ja": "電子社会（WPES）における個人情報保護について毎年ワークショップO <http://www.informatik.uni-trier.de/~Ley/db/conf/wpes/index.html>。"
    },
    {
      "indent": 3,
      "text": "Techniques that deliberately change the timing or size of messages, such as padding, can also help reduce traffic analysis. Obviously, they make conversations slower and/or use more bandwidth, but in some cases that is not an issue, e.g., if the conversation is limited by the speed of a human user anyway. HTTP/2, for example, has a built-in padding mechanism. However, it is not easy to use these techniques well and make messages harder to recognise (as intended) rather than easier.",
      "ja": "意図的な詰め物などのメッセージ、のタイミングや大きさを変更する技術は、また、トラフィック分析を減らすことができます。明らかに、彼らは会話が遅くさせる、および/またはより多くの帯域幅を使用していますが、会話が、とにかく人間のユーザの速度によって制限されている場合、いくつかのケースでは、それは、例えば、問題ではありません。 HTTP / 2は、例えば、組み込みのパディング機構を有しています。しかし、それもこれらの技術を使用し、（意図したように）認識するメッセージが難しくやすいというよりも簡単ではありません。"
    },
    {
      "indent": 3,
      "text": "Different users in different contexts may have different security needs, so maybe the priority can be a user choice (if that can be done without making high-security users stand out from other users). Although many people would not understand what their choices are, some do, such as political activists or journalists.",
      "ja": "異なる文脈で異なるユーザが異なるセキュリティニーズを持っていること（つまり、高セキュリティ、ユーザーは他のユーザーよりも目立つせずに行うことができる場合）、ので、多分優先順位は、ユーザーの選択することができます。多くの人々が彼らの選択が何であるかを理解できないだろうが、いくつかは、そのような政治活動家やジャーナリストとして、行います。"
    },
    {
      "indent": 0,
      "text": "5.7. Deployment, Intermediaries, and Middleboxes",
      "section_title": true,
      "ja": "5.7. 展開、仲介、およびのMiddleboxes"
    },
    {
      "indent": 3,
      "text": "Secure protocols have often been designed in the past for end-to-end security: Intermediaries cannot read or modify the messages. This is the model behind TLS, for example.",
      "ja": "セキュアなプロトコルは、多くの場合、エンドツーエンドのセキュリティのために、過去に設計されています：仲介は、メッセージを読んだり、変更することはできません。これは、例えば、TLSの背後にあるモデルです。"
    },
    {
      "indent": 3,
      "text": "In practice, however, people have more or less valid reasons to insist on intermediaries: companies filtering incoming and outgoing traffic for viruses, inspecting content to give priority to certain applications, or caching content to reduce bandwidth.",
      "ja": "帯域幅を減らすために、特定のアプリケーション、またはキャッシュコンテンツを優先するために、コンテンツを検査、ウイルスの着信および発信トラフィックをフィルタリング企業：実際には、しかし、人々は多かれ少なかれ有効な仲介を主張する理由があります。"
    },
    {
      "indent": 3,
      "text": "In the presence of end-to-end encryption and authentication, these intermediaries have two choices: use fake certificates to impersonate the endpoints or have access to the private keys of the endpoints. The former is a MITM attack that is difficult to distinguish from a more malicious one, and the latter obviously decreases the security of the endpoints by copying supposedly confidential information and concentrating credentials in a single place.",
      "ja": "エンドポイントを偽装またはエンドポイントの秘密鍵へのアクセス権を持っている偽の証明書を使用する：エンドツーエンドの暗号化と認証の存在下では、これらの仲介者は、2つの選択肢があります。前者は、より悪質なものから区別することは困難であるMITM攻撃であり、後者は明らかにおそらく機密情報をコピーして1つの場所で資格情報を集中させることによって、エンドポイントのセキュリティを低下させます。"
    },
    {
      "indent": 3,
      "text": "As mentioned in Section 5.2 above, aggregation of data in a single place makes that place an attractive target. And in the case of PM, even if the data is not concentrated physically in one place, it is under control of a single legal entity that can be made into a collaborator.",
      "ja": "上記の5.2節で述べたように、単一の場所でのデータの集約は、その場所魅力的な標的となります。そして、PMの場合には、データを1つの場所に物理的に集中していない場合でも、それは協力者にすることができる単一の法人の制御下にあります。"
    },
    {
      "indent": 3,
      "text": "The way Web communication with TLS typically works is that the client authenticates the server, but the server does not authenticate the client at the TLS layer. (If the user needs to be identified, that is mainly done at the application layer via username and password.) Thus, the presence of a MITM (middlebox) could be detected by the client (because of the incorrect certificate), but not by the server. If the client doesn't immediately close the connection (which they do not in many cases), the server may thus disclose information that the user would rather not have disclosed.",
      "ja": "TLSでのWeb通信は通常動作方法は、クライアントがサーバーを認証するということですが、サーバーはTLSレイヤでクライアントを認証しません。 （ユーザーが識別される必要がある場合、それは主に、ユーザ名とパスワードを経由してアプリケーション層で行われます。）このように、MITM（ミドル）の存在が（正しくないため、証明書の）クライアントによって検出することができたが、しないことにより、サーバー。クライアントはすぐに（彼らは多くの場合にはない）接続を閉じていない場合、サーバーは、このように、ユーザは、むしろ開示していないだろうとの情報を開示することがあります。"
    },
    {
      "indent": 3,
      "text": "One widespread example of middleboxes is captive portals, as found on the Wi-Fi hotspots in hotels, airports, etc. Even the hotspots offering free access often intercept communications to redirect the user to a login or policy page.",
      "ja": "ホテルでのWi-Fiホットスポットに見られるようなミドルボックスの一つの広範な例は、キャプティブポータルで、空港などの無料アクセスを提供してもホットスポットは、多くの場合、ログインまたはポリシーのページにユーザーをリダイレクトするために、通信を傍受。"
    },
    {
      "indent": 3,
      "text": "When the communication they intercept is, e.g., the automatic update of your calendar program or a chat session, the redirect obviously doesn't work: these applications don't know how to display a web page. With the increasing use of applications, it may be a while before the user actually opens a browser. The flood of error messages may also have as a result that the user no longer reads the errors, allowing an actual malicious attack to go unnoticed.",
      "ja": "彼らは傍受通信の場合は、例えば、カレンダープログラムの自動更新やチャットセッションは、リダイレクトは明らかに動作しません。これらのアプリケーションは、Webページを表示する方法がわかりません。ユーザが実際にブラウザを開く前に、アプリケーションの使用の増加と、それはしばらくかもしれません。エラーメッセージの洪水はまた、ユーザーは、もはや実際の悪意のある攻撃は見過ごさすることができ、エラーを読み取った結果として持っていることがあります。"
    },
    {
      "indent": 3,
      "text": "Some operating systems now come with heuristics that try to recognise captive portals and either automatically login or show their login page in a separate application. (But, some hotspot providers apparently don't want automatic logins and actually reverse-engineered the heuristics to try and fool them.)",
      "ja": "一部のオペレーティングシステムは現在、キャプティブポータルを認識しようとすると、自動的にログインするか、別のアプリケーションでは、ログインページを表示するヒューリスティックが付属しています。 （しかし、いくつかのホットスポットプロバイダが明らかに自動ログインをしたくないと、実際には試してみて、それらをだますためのヒューリスティックをリバースエンジニアリング。）"
    },
    {
      "indent": 3,
      "text": "It seems some protocol is missing in this case. Captive portals shouldn't have to do MITM attacks to be noticed. A mechanism at the link layer or an extension to DHCP that tells a connecting device about the login page may help, although that still doesn't solve the problem for devices that do not have a web browser, such as voice over IP phones. HTTP response code 511 (defined in [RFC6585]) is another attempt at a partial solution. (It's partial because it can only work at the moment the user uses a browser to connect to a web site and doesn't use HTTPS.)",
      "ja": "いくつかのプロトコルが、この場合には欠けているようです。キャプティブポータルは気づいたことがMITM攻撃を実行する必要はありません。リンク層での機構やそれはまだ、IP電話、ボイスオーバーなどのWebブラウザを持っていないデバイスのための問題を解決していませんが、役立つかもしれログインページについての接続デバイスに指示しますDHCPの拡張。 HTTP応答コード511（[RFC6585]で定義される）は部分的な解決策で別の試みです。 （それが唯一のユーザーがWebサイトに接続し、ブラウザを使用して、HTTPSを使用していない現時点で働くことができるので、それは部分的です。）"
    },
    {
      "indent": 3,
      "text": "A practical problem with deployment of such a protocol may be that many such captive portals are very old and never updated. The hotel staff only knows how to reboot the system, and, as long as it works, the hotel has no incentive to buy a new one. As evidence of this: how many such systems require you to get a password and the ticket shows the price as zero? This is typically because the owner doesn't know how to reconfigure the hotspot, but he does know how to change the price in his cash register.",
      "ja": "そのようなプロトコルの展開と実用上の問題は、このような多くのキャプティブポータルは非常に古く、更新されたことがないことかもしれません。ホテルのスタッフは唯一のホテルは、新しいものを購入するインセンティブを持っていない限り、それが動作するよう、システムを再起動する方法を知っている、と。どのように多くのそのようなシステムは、パスワードを取得する必要が、チケットはゼロとして価格を示しています。これの証拠として？所有者がホットスポットを再構成する方法を知りませんが、彼は彼のレジに価格を変更する方法を知っていないため、これは一般的です。"
    },
    {
      "indent": 0,
      "text": "5.8. Break-out 1 - Research",
      "section_title": true,
      "ja": "5.8. ブレイクアウト1  - リサーチ"
    },
    {
      "indent": 3,
      "text": "Despite some requests earlier in the workshop, the research break-out did not discuss clean-slate approaches. The challenge was rather that the relationship between security research and standardisation needs improvement. Research on linkability is not yet well known in the IETF. But, the other side of the coin needs improvement too: While doing protocol design, standardisation organisations should indicate what specific problems are in need of more research.",
      "ja": "以前のワークショップでは、いくつかの要求にもかかわらず、研究のブレイクアウトは、クリーンスレートアプローチを議論しませんでした。課題は、セキュリティ研究と標準化の関係は改善が必要であるということでした。リンク可能性に関する研究は、IETFではまだあまり知られていません。しかし、コインの反対側にも改善が必要である：プロトコル設計をしながら、標準化団体は、特定の問題は、より多くの研究が必要であるかを示す必要があります。"
    },
    {
      "indent": 3,
      "text": "The break-out then made a nonexhaustive list of topics that are in need of further research:",
      "ja": "ブレイクアウトは、さらなる研究を必要としているトピックの非網羅的なリストを作りました。"
    },
    {
      "indent": 3,
      "text": "o The interaction of compression and encryption as demonstrated by the CRIME (\"Compression Ratio Info-leak Made Easy\") SSL/TLS vulnerability [Ristic]",
      "ja": "犯罪によって実証されるように圧縮と暗号化の相互作用（「イージーメイド圧縮率情報漏れ」）SSL / TLSの脆弱性[Ristic] O"
    },
    {
      "indent": 3,
      "text": "o A more proactive deprecation of algorithms based on research results",
      "ja": "研究結果に基づくアルゴリズムのより積極的な廃止O"
    },
    {
      "indent": 3,
      "text": "o Mitigation for return-oriented programming attacks",
      "ja": "リターン指向プログラミングの攻撃の緩和策O"
    },
    {
      "indent": 3,
      "text": "o How to better obfuscate so-called \"metadata\" o How to make the existence of traffic and their endpoints stealthy",
      "ja": "Oどのようにより良いトラフィックの存在を作り、そのエンドポイントのステルスする方法O、いわゆる「メタデータ」を難読化するには"
    },
    {
      "indent": 0,
      "text": "5.9. Break-out 2 - Clients",
      "section_title": true,
      "ja": "5.9. ブレイクアウト2  - クライアント"
    },
    {
      "indent": 3,
      "text": "Browsers are the first clients one thinks of when talking about encrypted connections, authentication, and certificates, but there are many others.",
      "ja": "ブラウザは、1つの暗号化接続、認証、および証明書について話すときを考える最初のクライアントであるが、他の多くがあります。"
    },
    {
      "indent": 3,
      "text": "Other common cases of \"false\" alarms for MITM (after captive portals) include expired and misconfigured certificates. This is quite common in intranets, when the sysadmin hasn't bothered updating a certificate and rather tells his handful of users to just \"click continue.\" The problem is on the one hand that users may not understand the difference between this case and the same error message when they connect to a server outside the company, and on the other hand that the incorrect certificate installed by the sysadmin is not easily distinguishable from an incorrect certificate from a MITM. The error message is almost the same, and the user may just click continue again.",
      "ja": "（キャプティブポータル後）MITMための「偽」のアラームの他の一般的な例には、有効期限が切れと誤設定の証明書が含まれます。システム管理者は、証明書の更新を気にしてというだけで、ユーザーの彼の一握りに指示していないとき、これは、イントラネットではかなり一般的である「[続行]をクリックします。」問題は、彼らが社外のサーバに接続するとき、ユーザーは、この場合と同じエラーメッセージの違いを理解していない可能性が一方であり、他方ではシステム管理者によってインストールされた不正な証明書は容易に区別はないことMITMから間違った証明書。エラーメッセージはほぼ同じであり、ユーザは、もう一度[続行]をクリックします。"
    },
    {
      "indent": 3,
      "text": "One way to get rid of such certificates is if client software no longer offers the option to continue after a certificate error. That requires that all major clients (such as browsers) change their behaviour at the same time; otherwise, the first one to do so will be considered broken by users, because the others still work. Also, it requires a period in which that software gives increasingly strong warnings about the cut-off date after which the connection will fail with this certificate.",
      "ja": "クライアントソフトウェアは、もはや証明書エラーの後に継続するためのオプションを提供していますならば、このような証明書を取り除くための一つの方法ではありません。それは、（ブラウザなど）すべての主要なクライアントが同時に彼らの行動を変えることが必要です。他の人がまだ動作しているためそれ以外の場合は、そうするための最初のものは、ユーザーによって破ら考慮されます。また、そのソフトウェアは、接続が、この証明書で失敗するまでのカットオフ日付について、ますます強い警告を与えている期間が必要です。"
    },
    {
      "indent": 3,
      "text": "Yet another source of error messages is self-signed certificates. Such certificates are actually only errors for sites that are not expected to have them. If a message about a self-signed certificate appears when connecting to Facebook or Google, you're clearly not connected to the real Facebook or Google. But, for a personal web site, it shouldn't cause such scary warnings. There may be ways to improve the explanations in the error message and provide an easy way to verify the certificate (by email, phone, or some other channel) and trust it.",
      "ja": "しかし、エラーメッセージの別のソースは、自己署名証明書です。このような証明書は、実際にそれらを持つことが期待されていないサイトのエラーのみです。 FacebookやGoogleに接続するとき、自己署名証明書に関するメッセージが表示された場合、あなたは明らかに本物のFacebookやGoogleに接続していません。しかし、個人のウェブサイトのために、そのような恐ろしい警告が発生することはありません。エラーメッセージの説明を改善し、（Eメール、電話、または他のいくつかのチャンネルで）証明書を検証し、それを信頼する簡単な方法を提供する方法があるかもしれません。"
    },
    {
      "indent": 0,
      "text": "5.10. Break-out 3 - On by Default",
      "section_title": true,
      "ja": "5.10. ブレイクアウト3  - デフォルトでON"
    },
    {
      "indent": 3,
      "text": "One step in improving security is to require the relevant features (in particular, encryption and authentication) to be implemented in compliant products: The features are labelled as \"MUST\" in the standard rather than \"MAY\". This is sometimes referred to as Mandatory To Implement (MTI) and is the current practice for IETF protocols [RFC3365].",
      "ja": "セキュリティを向上させる1つのステップは、準拠した製品に実装されるように、関連する機能（特に、暗号化および認証）を要求することです：機能は標準ではなく、「MAY」よりも「MUST」と表示されています。これは、時々（MTI）を実現するために必須として呼ばれ、IETFプロトコル[RFC3365]のための現在の慣行です。"
    },
    {
      "indent": 3,
      "text": "But, that may not be enough to counter PM. It may be that the features are there, but not used, because only very knowledgeable users or sysadmins turn them on. Or, it may be that implementations do not actually follow the MTI parts of specifications. Or, it may be that some security features are implemented, but interoperability for those doesn't really work. Or, even worse, it may be that protocol designers have only followed the letter of the MTI best practice and not its spirit, with the result that security features are hard to use or make deployment harder. One can thus argue that such features should be defined to be on by default.",
      "ja": "しかし、それはPMに対抗するために十分ではないかもしれません。それは特徴があるということが、唯一の非常に精通したユーザーまたはシステム管理者がそれらをオンにするので、使用しない場合があります。それとも、それは実装が実際に仕様のMTI部品に従わないことかもしれません。それとも、それはいくつかのセキュリティ機能が実装されていることかもしれないが、それらのための相互運用性は、実際に動作しません。あるいは、さらに悪いことには、そのプロトコルの設計者はセキュリティ機能を使用するか、展開が難しくするのは難しいです、その結果、MTIのベストプラクティスではなく、その精神の手紙を唯一続いているかもしれません。一つは、このような機能はデフォルトでオンになるように定義されるべきであると主張することができます。"
    },
    {
      "indent": 3,
      "text": "Going further, one might argue that these features should not even be options, i.e., there should be no way to turn them off. This is sometimes called Mandatory To Use (MTU).",
      "ja": "さらに行く、一つは、すなわち、それらをオフにする方法があってはならない、これらの機能もオプションであってはならないと主張するかもしれません。これは、時々（MTU）を使用することが必須と呼ばれています。"
    },
    {
      "indent": 3,
      "text": "The questions raised at this session were for what protocols is on-by-default appropriate, and how can one explain to the developers of such protocols that it is needed?",
      "ja": "このセッションでは問題提起は、どのようなプロトコルのために・バイ・デフォルトが適切であるし、どのように1は、それが必要とされるようなプロトコルの開発者に説明することができますか？"
    },
    {
      "indent": 3,
      "text": "Of course, there would be resistance to MTU security from implementers and deployments that practice deep packet inspection (DPI) and also perhaps from some governments. On the other hand, there may also be governments that outlaw protocols without proper encryption.",
      "ja": "もちろん、いくつかの政府から多分またディープパケットインスペクション（DPI）との練習を実装し、展開からMTUのセキュリティへの抵抗があるだろう。一方、また、適切な暗号化せずにプロトコルを非合法政府があるかもしれません。"
    },
    {
      "indent": 3,
      "text": "This break-out concluded that there could be value in attempting to document a new Best Current Practice for the IETF that moves from the current MTI position to one where security features are on by default. Some of the workshop participants expressed interest in authoring a draft for such a new BCP and progressing it through the IETF consensus process (where it would no doubt be controversial).",
      "ja": "このブレイクアウトは、セキュリティ機能がデフォルトでオンになっているものに、現在のMTI位置から移動IETFのための新しい最も良い現在の練習を文書化しようとして価値があるかもしれないと結論付けました。ワークショップ参加者の一部は、このような新しいBCPのための草案をオーサリングして（それは間違いなく物議ないだろう場所）IETF合意プロセスを経て、それを進んで関心を表明しました。"
    },
    {
      "indent": 0,
      "text": "5.11. Break-out 4 - Measurement",
      "section_title": true,
      "ja": "5.11. ブレイクアウト4  - 測定を"
    },
    {
      "indent": 3,
      "text": "There was a small break-out on the idea of measurement as a way to encourage or gamify the increased use of security mechanisms.",
      "ja": "セキュリティメカニズムの使用の増加を促すかgamifyするための方法として、測定の考え方の小さなブレイクアウトがありました。"
    },
    {
      "indent": 0,
      "text": "5.12. Break-out 5 - Opportunistic",
      "section_title": true,
      "ja": "5.12. ブレイクアウト5  - 日和見"
    },
    {
      "indent": 3,
      "text": "This break-out considered the use of the term \"opportunistic\" as it applies to cryptographic security and attempted to progress the work towards arriving at an agreed-upon definition for use of that term, at it applies to IETF and W3C work.",
      "ja": "それは暗号化セキュリティに適用され、それがIETFとW3Cの作業に適用される時に、その用語の使用のために合意された定義に到着に向けて作業を進めることを試みとして、このブレイクアウトは、用語の使用は「日和見」と考えました。"
    },
    {
      "indent": 3,
      "text": "While various terms had been used, with many people talking about opportunistic encryption, that usage was felt to be problematic both because it conflicted with the use of the same term in [RFC4322] and because it was being used differently in different parts of the community.",
      "ja": "様々な用語が多くの人々が、日和見暗号化の話で、使用されていたが、その使用は[RFC4322]で同じ用語を使用して、それが競合しているため、それが社会のさまざまな部分で異なって使用されていたので、両方の問題があると感じました。 。"
    },
    {
      "indent": 3,
      "text": "At the session, it was felt that the term \"opportunistic keying\" was better, but, as explained above, subsequent list discussion resulted in a move to the term \"Opportunistic Security\" (OS).",
      "ja": "セッションでは、上述したようにそれは、用語「日和見キーイングは、」良くなったと感じていたが、その後のリストの議論は、用語「日和見セキュリティ」（OS）への移動が生じました。"
    },
    {
      "indent": 3,
      "text": "Aside from terminology, discussion focused on the use of Diffie-Hellman (D-H) key exchange as the preferred mechanism of OS, with fall back to cleartext if D-H doesn't succeed as a counter for passive attacks.",
      "ja": "別に専門用語、D-Hは、受動的攻撃のためのカウンタとして成功していない場合はクリアテキストにフォールバックして、ディフィー・ヘルマン（D-H）OSの推奨メカニズムとして鍵交換を使用することに焦点を当てた議論から。"
    },
    {
      "indent": 3,
      "text": "There was also, of course, the desire to be able to easily escalate from countering passive attacks to also handling endpoint authentication and thereby also countering MITM attacks.",
      "ja": "簡単に、エンドポイントの認証を処理するために受動的攻撃に対抗し、それによってもMITM攻撃に対抗からエスカレートすることができるようにする欲求が、もちろん、もありました。"
    },
    {
      "indent": 3,
      "text": "Making OS visible to users was again considered to be undesirable, as users could not be expected to distinguish between cleartext, OS, and (one-sided or mutual) endpoint authentication.",
      "ja": "ユーザーがクリアテキスト、OS、及び（片面または相互）エンドポイント認証を区別するために期待できないようにユーザにOSを可視化は再び、望ましくないと考えられました。"
    },
    {
      "indent": 3,
      "text": "Finally, it was noted that it may take some effort to establish how middleboxes might affect OS at different layers and that OS really is not suitable as the only mitigation to use for high-sensitivity sessions such as financial transactions.",
      "ja": "最後に、それがミドルボックスは異なる層でOSに影響を与え、OSが実際にそのような金融取引のような高感度のセッションに使用するための唯一の緩和策として適切ではないということかもしれない方法を確立するためにいくつかの努力を取ることができることに留意されました。"
    },
    {
      "indent": 0,
      "text": "5.13. Unofficial Transport/Routing Break-out",
      "section_title": true,
      "ja": "5.13. 非公式交通/ルーティングブレイクアウト"
    },
    {
      "indent": 3,
      "text": "Some routing and transport Area Directors felt a little left out by all the application-layer break-outs, so they had their own brainstorm about what could be done at the transport and routing layers from which these notes resulted.",
      "ja": "いくつかのルーティングとトランスポートエリア取締役は、すべてのアプリケーション層のブレイクアウトで取り残さ少しを感じたので、彼らはこれらのノートがもたらしたからトランスポートおよびルーティング層で何ができるかについて、自分のひらめきを持っていました。"
    },
    {
      "indent": 3,
      "text": "The LEDBAT [RFC6817] protocol was targeted towards a bulk-transfer service that is reordering- and delay-insensitive. Use of LEDBAT could offer the following benefits for an application:",
      "ja": "LEDBAT [RFC6817]プロトコルはreordering-遅延非感受性であるバルク転送サービスをターゲットにしました。 LEDBATの使用は、アプリケーションのための次のような利点を提供することができます："
    },
    {
      "indent": 3,
      "text": "a. Because it is reordering-insensitive, traffic can be sprayed across a large number of forwarding paths. Assuming such different paths exist, this would make it more challenging to capture and analyze a full interaction.",
      "ja": "A。それは並べ替え - 鈍感であるため、トラフィックは転送パスの多数を横切って噴霧することができます。このように異なるパスが存在すると仮定すると、これは完全な相互作用を捕獲し、分析することがより困難になるだろう。"
    },
    {
      "indent": 3,
      "text": "b. The application can vary the paths by indicating per packet a different flow. In IPv6, this can be done via different IPv6 flow labels. For IPv4, this can be done by encapsulating the IP packet into UDP and varying the UDP source port.",
      "ja": "B。アプリケーションは、パケットごとに異なるフローを示すことにより、経路を変更することができます。 IPv6では、これは異なるのIPv6フローラベルを介して行うことができます。 IPv4の場合、これはUDPにIPパケットをカプセル化し、UDPソースポートを変えることによって行うことができます。"
    },
    {
      "indent": 3,
      "text": "c. Since LEDBAT is delay-insensitive and applications using it would need to be as well, it would be possible to obfuscate the application signatures by varying the packet lengths and frequency.",
      "ja": "C。 LEDBAT遅延非感受性それは同様であることが必要であろう使用してアプリケーションであるので、パケットの長さと周波数を変化させることにより、アプリケーション署名を難読化することが可能です。"
    },
    {
      "indent": 3,
      "text": "d. This can also hide the transport header (for IP in UDP).",
      "ja": "D。また、これは（UDPでIP用の）トランスポートヘッダーを非表示にすることができます。"
    },
    {
      "indent": 3,
      "text": "e. If the Reverse Path Forwarding (RPF) [RFC3704] check problem can be fixed, perhaps the source could be hidden; however, such fixes assume the traffic is within trusted perimeters.",
      "ja": "電子。逆方向パス転送（RPF）[RFC3704]のチェック問題は、おそらくソースを隠すことができ、固定することができる場合。しかし、そのような修正は、トラフィックが信頼周囲の範囲内であると仮定します。"
    },
    {
      "indent": 3,
      "text": "f. The use of LEDBAT is orthogonal to the use of encryption and provides different benefits (harder to intercept the whole conversation, ability to obfuscate the traffic analysis), and it has different costs (longer latency, new transport protocol usage) to its users.",
      "ja": "F。 LEDBATの使用は、暗号化の使用に直交すると（、トラフィック解析を難読化する能力が全体の会話を傍受しにくい）さまざまな利点を提供し、そしてそれがそのユーザーに異なるコスト（長い待ち時間の、新しいトランスポートプロトコルの使用を）持っています。"
    },
    {
      "indent": 3,
      "text": "The idea of encrypting traffic from Customer Edge (CE) to CE as part of an L3VPN or such was also discussed. This could allow hiding of addresses, including source, and headers. From conversation with Ron Bonica, it's clear that some customers already do encryption (though without hiding the source address). So, rather than an enhancement, this is an existing mechanism for which deployment and use can be encouraged.",
      "ja": "L3VPNの一部またはのようなCEにカスタマーエッジ（CE）からのトラフィックを暗号化するという考えも議論されました。これは、ソース、およびヘッダを含むアドレスを隠すことを、可能性があります。ロンBonicaとの会話から、それは（ただし、送信元アドレスを隠すことなく）一部の顧客はすでに暗号化を行うことは明らかです。だから、むしろ強化よりも、これは展開と使用を奨励することができたため、既存のメカニズムです。"
    },
    {
      "indent": 3,
      "text": "Finally, it was discussed whether it would be useful to have a means of communicating where and what layers are doing encryption on an application's traffic path. The initial idea of augmenting ICMP has some issues (not visible to application, ICMP packets frequently filtered) as well as potential work (determining how to trust the report of encryption). It would be interesting to understand if such communication is actually needed and what the requirements would be.",
      "ja": "最後に、どのような層は、アプリケーションのトラフィックパスで暗号化を行っているところと通信する手段を有することが有用であろうかどうかを議論しました。 ICMPを増大させるの最初のアイデアは、いくつかの（アプリケーションには見えない、ICMPパケットが頻繁にフィルター）の問題だけでなく、潜在的な仕事（暗号化のレポートを信頼する方法を決定する）を持っています。このような通信が実際に必要とされている場合、理解することは興味深いものになるだろうとの要件はどうなりますか。"
    },
    {
      "indent": 0,
      "text": "6. After the Workshop",
      "section_title": true,
      "ja": "ワークショップの後6"
    },
    {
      "indent": 3,
      "text": "Holding the workshop just before the IETF had the intended effect: a number of people went to both the workshop and the IETF, and they took the opportunity of being together at the IETF to continue the discussions.",
      "ja": "IETFは、意図した効果があった直前にワークショップを開催：人々の数は、ワークショップとIETFの両方に行き、彼らは議論を継続するためにIETFで一緒にいるの機会を得ました。"
    },
    {
      "indent": 3,
      "text": "IETF working groups meeting in London took the recommendations from the workshop into account. It was even the first item in the report about the IETF meeting by the IETF chair, Jari Arkko:",
      "ja": "ロンドンで開催IETFワーキンググループは、アカウントにワークショップからの提言を取りました。これは、IETFいす、ヤリArkkoによってIETF会議に関する報告書でも、最初の項目でした。"
    },
    {
      "indent": 6,
      "text": "Strengthening the security and privacy of the Internet continued to draw a lot of attention. The STRINT workshop organised by the IAB and W3C just before the IETF attracted 100 participants and over 60 papers. Even more people would have joined us, but there was no space. During the IETF meeting, we continued discussing the topic at various working groups. A while ago we created the first working group specifically aimed at addressing some of the issues surrounding pervasive monitoring. The Using TLS for Applications (UTA) working group had its first meeting in London. But many other working groups also address these issues in their own work. The TCPM working group discussed a proposal to add opportunistic keying mechanisms directly onto the TCP protocol. And the DNSE BOF considered the possibility of adding confidentiality support to DNS queries. Finally, there is an ongoing effort to review old specifications to search for areas that might benefit from taking privacy and data minimisation better into account. [Arkko1]",
      "ja": "インターネットのセキュリティとプライバシーを強化することは多くの注目を引くために続けました。 IETFは100人の参加者と60以上の論文を集め直前IABおよびW3Cによって組織STRINTワークショップ。でも、より多くの人々は私たちに参加しているだろうが、何のスペースがありませんでした。 IETFミーティング中、当社は様々なワーキンググループでトピックを議論続けました。しばらく前に、私たちは、特に普及モニタリングを取り巻く問題のいくつかに対処することを目的とした最初のワーキンググループを作成しました。アプリケーションのためにTLSを使用する（UTA）ワーキンググループは、ロンドンで初の会談を行いました。しかし、他の多くのワーキンググループも、自分の仕事にこれらの問題に対処します。 TCPMワーキンググループは、直接TCPプロトコルに日和見キーイング機構を追加する提案を検討しました。そしてDNSE BOFは、DNSクエリに機密性のサポートを追加する可能性を検討しました。最後に、考慮に優れたプライバシーとデータの最小化を取るの恩恵を受ける可能性がある領域を検索するための古い仕様を確認するための継続的な努力があります。 [Arkko1]"
    },
    {
      "indent": 3,
      "text": "Two papers that were written for the workshop, but not finished in time, are worth mentioning, too: One by the same Jari Arkko, titled \"Privacy and Networking Functions\" [Arkko2]; and one by Johan Pouwelse, \"The Shadow Internet: liberation from Surveillance, Censorship and Servers\" [Pouwelse].",
      "ja": "ワークショップのために書かれていますが、時間内に終了していなかった2つの論文は、あまりにも、言及する価値がある：、同じヤリArkkoずつ「プライバシーおよびネットワーキング機能」[Arkko2]というタイトル。そしてヨハンPouwelse、「シャドウインターネット：監視、検閲やサーバーからの解放」により、1 [Pouwelse]。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document is all about security and privacy.",
      "ja": "この文書では、すべてのセキュリティとプライバシーに関するものです。"
    },
    {
      "indent": 0,
      "text": "8. Informative References",
      "section_title": true,
      "ja": "8.参考文献"
    },
    {
      "indent": 3,
      "text": "[Arkko1] Arkko, J., \"IETF-89 Summary\", March 2014, <http://www.ietf.org/blog/2014/03/ietf-89-summary/>.",
      "ja": "【Arkko1] Arkko、J.、 \"IETF-89の概要\"、2014年3月、<http://www.ietf.org/blog/2014/03/ietf-89-summary/>。"
    },
    {
      "indent": 3,
      "text": "[Arkko2] Arkko, J., \"Privacy and Networking Functions\", March 2014, <http://www.arkko.com/ietf/strint/ draft-arkko-strint-networking-functions.txt>.",
      "ja": "[Arkko2] Arkko、J.、 \"プライバシーおよびネットワーキング機能\"、2014年3月、<http://www.arkko.com/ietf/strint/ドラフトarkko-strintネットワーキング・functions.txt>。"
    },
    {
      "indent": 3,
      "text": "[Barnes] Barnes, R., Schneier, B., Jennings, C., and T. Hardie, \"Pervasive Attack: A Threat Model and Problem Statement\", Work in Progress, draft-barnes-pervasive-problem-00, January 2014.",
      "ja": "[バーンズ]バーンズ、R.、シュナイアー、B.、ジェニングス、C.、およびT.ハーディ、「パーベイシブ攻撃：脅威モデルと問題文」が進行中で働いて、ドラフト・バーンズ・普及-問題-00、1月2014。"
    },
    {
      "indent": 3,
      "text": "[Captive] Wikipedia, \"Captive portal\", October 2015, <https://en.wikipedia.org/w/ index.php?title=Captive_portal&oldid=685621201>.",
      "ja": "[キャプティブ]ウィキペディア、 \"キャプティブポータル\"、2015年10月、<https://en.wikipedia.org/w/のindex.php？タイトル= Captive_portal＆oldid = 685621201>。"
    },
    {
      "indent": 3,
      "text": "[Kent] Kent, S., \"Opportunistic Security as a Countermeasure to Pervasive Monitoring\", Work in Progress, draft-kent-opportunistic-security-01, April 2014.",
      "ja": "[ケント]ケント、S.、「パーベイシブ監視対策として日和見セキュリティ」が進行中で働いて、ドラフトケント・日和見セキュリティ-01、2014年4月。"
    },
    {
      "indent": 3,
      "text": "[Paper4] Hardie, T., \"Flows and Pervasive Monitoring\", STRINT Workshop, 2014, <https://www.w3.org/2014/strint/papers/4.pdf>.",
      "ja": "【Paper4]ハーディー、T.、 \"フローとパーベイシブ監視\"、STRINTワークショップ2014年、<https://www.w3.org/2014/strint/papers/4.pdf>。"
    },
    {
      "indent": 3,
      "text": "[Pouwelse] Pouwelse, J., \"The Shadow Internet: liberation from Surveillance, Censorship and Servers\", Work in Progress, draft-pouwelse-perpass-shadow-internet-00, February 2014.",
      "ja": "[Pouwelse] Pouwelse、J.、 \"シャドウインターネット：監視、検閲やサーバーからの解放\" が進行中で働いて、ドラフトpouwelse-perpassシャドウ・インターネット-00、2014年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, DOI 10.17487/RFC3261, June 2002, <http://www.rfc-editor.org/info/rfc3261>.",
      "ja": "[RFC3261]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\" 、RFC 3261、DOI 10.17487 / RFC3261、2002年6月、<http://www.rfc-editor.org/info/rfc3261>。"
    },
    {
      "indent": 3,
      "text": "[RFC3365] Schiller, J., \"Strong Security Requirements for Internet Engineering Task Force Standard Protocols\", BCP 61, RFC 3365, DOI 10.17487/RFC3365, August 2002, <http://www.rfc-editor.org/info/rfc3365>.",
      "ja": "[RFC3365]シラー、J.、 \"インターネットエンジニアリングタスクフォース標準プロトコルのための強力なセキュリティ要件\"、BCP 61、RFC 3365、DOI 10.17487 / RFC3365、2002年8月、<http://www.rfc-editor.org/info/ rfc3365>。"
    },
    {
      "indent": 3,
      "text": "[RFC3552] Rescorla, E. and B. Korver, \"Guidelines for Writing RFC Text on Security Considerations\", BCP 72, RFC 3552, DOI 10.17487/RFC3552, July 2003, <http://www.rfc-editor.org/info/rfc3552>.",
      "ja": "[RFC3552]レスコラ、E.とB.コーバー、 \"セキュリティの考慮事項の書き方RFCテキストのためのガイドライン\"、BCP 72、RFC 3552、DOI 10.17487 / RFC3552、2003年7月、<http://www.rfc-editor.org/情報/ rfc3552>。"
    },
    {
      "indent": 3,
      "text": "[RFC3704] Baker, F. and P. Savola, \"Ingress Filtering for Multihomed Networks\", BCP 84, RFC 3704, DOI 10.17487/RFC3704, March 2004, <http://www.rfc-editor.org/info/rfc3704>.",
      "ja": "[RFC3704]ベイカー、F.およびP. Savola、 \"マルチホームネットワークの入力フィルタリング\"、BCP 84、RFC 3704、DOI 10.17487 / RFC3704、2004年3月、<http://www.rfc-editor.org/info/rfc3704 >。"
    },
    {
      "indent": 3,
      "text": "[RFC4252] Ylonen, T. and C. Lonvick, Ed., \"The Secure Shell (SSH) Authentication Protocol\", RFC 4252, DOI 10.17487/RFC4252, January 2006, <http://www.rfc-editor.org/info/rfc4252>.",
      "ja": "[RFC4252] Ylonenと、T.とC. Lonvick、エド。、 \"セキュアシェル（SSH）認証プロトコル\"、RFC 4252、DOI 10.17487 / RFC4252、2006年1月、<http://www.rfc-editor.org/情報/ rfc4252>。"
    },
    {
      "indent": 3,
      "text": "[RFC4322] Richardson, M. and D. Redelmeier, \"Opportunistic Encryption using the Internet Key Exchange (IKE)\", RFC 4322, DOI 10.17487/RFC4322, December 2005, <http://www.rfc-editor.org/info/rfc4322>.",
      "ja": "[RFC4322]リチャードソン、M.とD. Redelmeier、 \"IKE（Internet Key Exchange）を使用して日和見暗号化\"、RFC 4322、DOI 10.17487 / RFC4322、2005年12月、<http://www.rfc-editor.org/info / rfc4322>。"
    },
    {
      "indent": 3,
      "text": "[RFC6120] Saint-Andre, P., \"Extensible Messaging and Presence Protocol (XMPP): Core\", RFC 6120, DOI 10.17487/RFC6120, March 2011, <http://www.rfc-editor.org/info/rfc6120>.",
      "ja": "[RFC6120]サンアンドレ、P.、 \"拡張メッセージングおよびプレゼンスプロトコル（XMPP）：コア\"、RFC 6120、DOI 10.17487 / RFC6120、2011年3月、<http://www.rfc-editor.org/info/rfc6120 >。"
    },
    {
      "indent": 3,
      "text": "[RFC6585] Nottingham, M. and R. Fielding, \"Additional HTTP Status Codes\", RFC 6585, DOI 10.17487/RFC6585, April 2012, <http://www.rfc-editor.org/info/rfc6585>.",
      "ja": "[RFC6585]ノッティンガム、M.とR.フィールディング、 \"追加のHTTPステータスコード\"、RFC 6585、DOI 10.17487 / RFC6585、2012年4月、<http://www.rfc-editor.org/info/rfc6585>。"
    },
    {
      "indent": 3,
      "text": "[RFC6817] Shalunov, S., Hazel, G., Iyengar, J., and M. Kuehlewind, \"Low Extra Delay Background Transport (LEDBAT)\", RFC 6817, DOI 10.17487/RFC6817, December 2012, <http://www.rfc-editor.org/info/rfc6817>.",
      "ja": "[RFC6817] Shalunov、S.、ヘーゼル、G.、アイアンガー、J.、およびM. Kuehlewind、 \"低余分な遅延の背景トランスポート（LEDBAT）\"、RFC 6817、DOI 10.17487 / RFC6817、2012年12月、<HTTP：// www.rfc-editor.org/info/rfc6817>。"
    },
    {
      "indent": 3,
      "text": "[RFC6962] Laurie, B., Langley, A., and E. Kasper, \"Certificate Transparency\", RFC 6962, DOI 10.17487/RFC6962, June 2013, <http://www.rfc-editor.org/info/rfc6962>.",
      "ja": "[RFC6962]ローリー、B.、ラングレー、A.、およびE.カスパー、 \"証明書の透明性\"、RFC 6962、DOI 10.17487 / RFC6962、2013年6月、<http://www.rfc-editor.org/info/rfc6962 >。"
    },
    {
      "indent": 3,
      "text": "[RFC6973] Cooper, A., Tschofenig, H., Aboba, B., Peterson, J., Morris, J., Hansen, M., and R. Smith, \"Privacy Considerations for Internet Protocols\", RFC 6973, DOI 10.17487/RFC6973, July 2013, <http://www.rfc-editor.org/info/rfc6973>.",
      "ja": "[RFC6973]クーパー、A.、Tschofenig、H.、Aboba、B.、ピーターソン、J.、モリス、J.、ハンセン、M.、およびR.スミス、 \"インターネットプロトコルのためのプライバシーの考慮事項\"、RFC 6973、DOI 10.17487 / RFC6973、2013年7月、<http://www.rfc-editor.org/info/rfc6973>。"
    },
    {
      "indent": 3,
      "text": "[RFC7258] Farrell, S. and H. Tschofenig, \"Pervasive Monitoring Is an Attack\", BCP 188, RFC 7258, DOI 10.17487/RFC7258, May 2014, <http://www.rfc-editor.org/info/rfc7258>.",
      "ja": "[RFC7258]ファレル、S.およびH. Tschofenig、BCP 188 \"パーベイシブモニタリングが攻撃である\"、RFC 7258、DOI 10.17487 / RFC7258、2014年5月、<http://www.rfc-editor.org/info/rfc7258 >。"
    },
    {
      "indent": 3,
      "text": "[RFC7435] Dukhovni, V., \"Opportunistic Security: Some Protection Most of the Time\", RFC 7435, DOI 10.17487/RFC7435, December 2014, <http://www.rfc-editor.org/info/rfc7435>.",
      "ja": "[RFC7435] Dukhovni、V.、 \"日和見セキュリティ：時間のいくつかの保護ほとんど\"、RFC 7435、DOI 10.17487 / RFC7435、2014年12月、<http://www.rfc-editor.org/info/rfc7435>。"
    },
    {
      "indent": 3,
      "text": "[RFC7469] Evans, C., Palmer, C., and R. Sleevi, \"Public Key Pinning Extension for HTTP\", RFC 7469, DOI 10.17487/RFC7469, April 2015, <http://www.rfc-editor.org/info/rfc7469>.",
      "ja": "[RFC7469]エバンス、C.、パーマー、C.、およびR. Sleevi、 \"HTTPのための公開鍵ピンニング拡張\"、RFC 7469、DOI 10.17487 / RFC7469、2015年4月、<http://www.rfc-editor.org /情報/ rfc7469>。"
    },
    {
      "indent": 3,
      "text": "[RFC7624] Barnes, R., Schneier, B., Jennings, C., Hardie, T., Trammell, B., Huitema, C., and D. Borkmann, \"Confidentiality in the Face of Pervasive Surveillance: A Threat Model and Problem Statement\", RFC 7624, DOI 10.17487/RFC7624, August 2015, <http://www.rfc-editor.org/info/rfc7624>.",
      "ja": "[RFC7624]バーンズ、R.、シュナイアー、B.、ジェニングス、C.、ハーディー、T.、トラメル、B.、のHuitema、C.、およびD. Borkmann、「パーベイシブ監視の顔に機密性：脅威モデルそして、問題文」、RFC 7624、DOI 10.17487 / RFC7624、2015年8月、<http://www.rfc-editor.org/info/rfc7624>。"
    },
    {
      "indent": 3,
      "text": "[Ristic] Ristic, I., \"CRIME: Information Leakage Attack against SSL/TLS\", Qualys Blog, <https://community.qualys.com/blogs/securitylabs/2012/ 09/14/crime-information-leakage-attack-against-ssltls>.",
      "ja": "[Ristic] Ristic、I.、 \"CRIME：SSL / TLSに対する情報漏洩アタック\"、クアリスブログ、<https://community.qualys.com/blogs/securitylabs/2012/ 9月14日/犯罪情報leakage-攻撃に対する-ssltls>。"
    },
    {
      "indent": 3,
      "text": "[SAAG_list] IETF, \"saag Discussion Archive\", <https://www.ietf.org/ mail-archive/web/saag/current/maillist.html>.",
      "ja": "[SAAG_list] IETF、 \"SAAGディスカッションアーカイブ\"、<https://www.ietf.org/メールアーカイブ/ウェブ/ SAAG /現在/ maillist.html>。"
    },
    {
      "indent": 3,
      "text": "[STRINT] W3C/IAB, \"STRINT Workshop\", <https://www.w3.org/2014/strint/Overview.html>.",
      "ja": "【STRINT] W3C / IAB、 \"STRINTワークショップ\"、<https://www.w3.org/2014/strint/Overview.html>。"
    },
    {
      "indent": 3,
      "text": "[vancouverplenary] IETF, \"IETF 88 Technical Plenary Minutes\", <https://www.ietf.org/proceedings/88/minutes/ minutes-88-iab-techplenary>.",
      "ja": "[vancouverplenary] IETF、 \"IETF 88技術総会議事録\"、<https://www.ietf.org/proceedings/88/minutes/分-88-IAB-techplenary>。"
    },
    {
      "indent": 3,
      "text": "[w3c-geo-api] Popescu, A., \"Geolocation API Specification\", W3C Recommendation, October 2013, <http://www.w3.org/TR/geolocation-API/>.",
      "ja": "[W3C-GEO-API]ポペスク、A.、 \"ジオロケーションAPI仕様\"、W3C勧告、2013年10月、<http://www.w3.org/TR/geolocation-API/>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Logistics",
      "ja": "付録A.物流"
    },
    {
      "indent": 3,
      "text": "The workshop was organised by the STREWS project (<https://www.strews.eu/>), which is a research project funded under the European Union's 7th Framework Programme (<http://cordis.europa.eu/fp7/ict/>). It was the first of two workshops in its work plan. The organisers were supported by the IAB and W3C, and, for the local organisation, by Telefonica Digital (<http://blog.digital.telefonica.com/>).",
      "ja": "ワークショップは、欧州連合（EU）の第7次フレームワークプログラム（<http://cordis.europa.eu/fp7/の下で資金による研究プロジェクトですSTREWSプロジェクト（<https://www.strews.eu/>）によって組織されましたICT />）。それは、その作業計画に2回のワークショップの第一号でした。主催者は、テレフォニカ・デジタル（<http://blog.digital.telefonica.com/>）で、地元の組織のために、IABおよびW3Cによってサポートされ、そしてました。"
    },
    {
      "indent": 3,
      "text": "One of the suggestions in the project description of the STREWS project was to attach the first workshop to an IETF meeting. The best opportunity was IETF 89 in London, which began on Sunday 2 March 2014; see <https://www.ietf.org/meeting/89/> for more information. Telefonica Digital offered meeting rooms at its offices in central London for the preceding Friday and Saturday, just minutes away from the IETF's location.",
      "ja": "STREWSプロジェクトのプロジェクトの説明で提案の一つは、IETFミーティングに最初のワークショップを添付しました。最良の機会は日曜日2014年3月2日に始まったロンドンでのIETF 89、でした。詳細については、<https://www.ietf.org/meeting/89/>を参照してください。テレフォニカ・デジタルは、わずか数分IETFの場所から、前の金曜日と土曜日にロンドン中心部にあるオフィスで会議室を提供しました。"
    },
    {
      "indent": 3,
      "text": "The room held 100 people, which was thought to be sufficient. There turned out to be more interest than expected and we could have filled a larger room, but 100 people is probably an upper limit for good discussions anyway.",
      "ja": "部屋は十分であると考えられていた100人を、開催されました。そこには予想以上の関心であることが判明し、我々は大きな部屋を埋め尽くしたかもしれないが、100人はとにかく、おそらく良い議論のための上限です。"
    },
    {
      "indent": 3,
      "text": "Apart from the usual equipment in the room (projector, white boards, microphones, coffee), we also set up some extra communication channels:",
      "ja": "アパートの部屋（プロジェクター、ホワイトボード、マイク、コーヒー）で通常の機器から、我々はまた、いくつかの余分な通信チャネルを設定します。"
    },
    {
      "indent": 3,
      "text": "o A mailing list where participants could discuss the agenda and the published papers about three weeks in advance of the workshop itself.",
      "ja": "参加者はワークショップ自体の事前に議題と約3週間掲載された論文を議論することができメーリングリストO。"
    },
    {
      "indent": 3,
      "text": "o Publicly advertised streaming audio (one-way only). At some point, no less than 165 people were listening.",
      "ja": "O公的に広告を出してストリーミングオーディオ（片道のみ）。ある時点で、劣らず165以上の人が聞いていました。"
    },
    {
      "indent": 3,
      "text": "o An IRC channel for live minute-taking, passing links and other information, and helping remote participants to follow the proceedings.",
      "ja": "ライブ分撮影、パッシングリンクやその他の情報のためのIRCチャンネルO、および手続きに従うことを遠隔地の参加を支援します。"
    },
    {
      "indent": 3,
      "text": "o An Etherpad, where the authors of papers could provide an abstract of their submissions, to help participants who could not read all 66 papers in full in advance of the workshop. The abstracts were also used on the workshop's web site: <https://www.w3.org/2014/strint/>.",
      "ja": "論文の著者は、ワークショップの前に完全な内のすべての66本の論文を読むことができませんでした参加者を助けるために、彼らの提出の抽象を提供することができEtherPadでは、O。 <https://www.w3.org/2014/strint/>：抄録は、また、ワークショップのウェブサイト上で使用されました。"
    },
    {
      "indent": 3,
      "text": "o A Twitter hashtag (#strint). Four weeks after the workshop, there were still a few new messages about events related to workshop topics; see <https://twitter.com/search?q=%23strint>.",
      "ja": "Twitterのハッシュタグ（#strint）O。四週間のワークショップの後、ワークショップのトピックに関連するイベントについてのいくつかの新しいメッセージが残っていました。 <https://twitter.com/search?q=%23strint>を参照してください。"
    },
    {
      "indent": 0,
      "text": "Appendix B. Agenda",
      "ja": "付録B.アジェンダ"
    },
    {
      "indent": 3,
      "text": "This was the final agenda of the workshop, as determined by the TPC and participants on the mailing list prior to the workshop. The included links are to the slides that the moderators used to introduce each discussion topic and to the minutes.",
      "ja": "ワークショップの前にメーリングリスト上TPCと参加者が決定され、これは、ワークショップの最後の議題でした。含まれるリンクは、モデレータは、各ディスカッショントピックを導入するために使用するスライドにし、数分にあります。"
    },
    {
      "indent": 0,
      "text": "B.1. Friday 28 February",
      "ja": "B.1。金曜日2月28日"
    },
    {
      "indent": 3,
      "text": "Minutes: <http://www.w3.org/2014/02/28-strint-minutes.html>",
      "ja": "分：<http://www.w3.org/2014/02/28-strint-minutes.html>"
    },
    {
      "indent": 3,
      "text": "Workshop starts, welcome, logistics, opening/overview Slides: <https://down.dsg.cs.tcd.ie/strint-slides/s0-welcome.pdf>",
      "ja": "ワークショップは、歓迎、物流、開口部/概要スライドを開始します。<https://down.dsg.cs.tcd.ie/strint-slides/s0-welcome.pdf>"
    },
    {
      "indent": 3,
      "text": "o Goal is to plan how we respond to PM threats",
      "ja": "Oゴールは、我々はPMの脅威への対応方法を計画することです"
    },
    {
      "indent": 3,
      "text": "o Specific questions to be discussed in sessions",
      "ja": "セッションで議論される具体的な質問O"
    },
    {
      "indent": 3,
      "text": "o Outcomes are actions for IETF, W3C, IRTF, etc.",
      "ja": "Oの成果等IETF、W3C、IRTF、のために行動しています"
    },
    {
      "indent": 3,
      "text": "I. Threats - What problem are we trying to solve? (Presenter: Richard Barnes; Moderator: Cullen Jennings) Slides: <https://down.dsg.cs.tcd.ie/strint-slides/s1-threat.pdf>",
      "ja": "I.脅威 - どのような問題我々が解決しようとしていますか？ （プレゼンター：リチャード・バーンズ;司会：カレン・ジェニングス）スライド：<https://down.dsg.cs.tcd.ie/strint-slides/s1-threat.pdf>"
    },
    {
      "indent": 10,
      "text": "* What attacks have been described? (Attack taxonomy)",
      "ja": "*どのような攻撃が記載されていますか？ （攻撃の分類）"
    },
    {
      "indent": 10,
      "text": "* What should we assume the attackers' capabilities are?",
      "ja": "*私たちは、攻撃者の能力を何を想定する必要がありますか？"
    },
    {
      "indent": 10,
      "text": "* When is it really \"pervasive monitoring\" and when is it not?",
      "ja": "*とき、それは本当に「普及モニタリング」とするとき、それはないでしょうか？"
    },
    {
      "indent": 10,
      "text": "* Scoping - what's in and what's out? (for IETF/W3C)",
      "ja": "*スコーピング - で何がアウト何ですか？ （IETF / W3C用）"
    },
    {
      "indent": 3,
      "text": "II. COMSEC 1 - How can we increase usage of current COMSEC tools? (Presenter: Hannes Tschofenig; Moderator: Leif Johansson) Slides: <https://down.dsg.cs.tcd.ie/strint-slides/s2-comsec.pdf>",
      "ja": "II。 COMSEC 1  - どのように私たちは現在のCOMSECツールの利用を増やすことができますか？ （プレゼンター：ハンスTschofenig、モデレータ：レイフ・ヨハンソン）スライド<https://down.dsg.cs.tcd.ie/strint-slides/s2-comsec.pdf>"
    },
    {
      "indent": 10,
      "text": "* Whirlwind catalog of current tools",
      "ja": "現在のツールの*旋風カタログ"
    },
    {
      "indent": 10,
      "text": "* Why aren't people using them? In what situations are / aren't they used?",
      "ja": "*なぜ人々はそれらを使用していませんか？どのような状況で/彼らが使用されていないされていますか？"
    },
    {
      "indent": 10,
      "text": "* Securing AAA and management protocols - why not?",
      "ja": "* AAAおよび管理プロトコルを保護する - なぜありませんか？"
    },
    {
      "indent": 10,
      "text": "* How can we (IETF/W3C/community) encourage more/better use?",
      "ja": "*どのように我々（IETF / W3C /コミュニティは）多くの/より良い利用を奨励することができますか？"
    },
    {
      "indent": 3,
      "text": "III. Policy - What policy/legal/other issues need to be taken into account? (Presenter: Christine Runnegar; Moderator: Rigo Wenning) Slides: <https://down.dsg.cs.tcd.ie/strint-slides/s3-policy.pdf>",
      "ja": "III。ポリシー - ポリシー/その他/法的問題を考慮に入れる必要がありますか？ （プレゼンター：クリスティンRunnegar;司会：リゴヴェニング）スライド<https://down.dsg.cs.tcd.ie/strint-slides/s3-policy.pdf>"
    },
    {
      "indent": 10,
      "text": "* What non-technical activities do we need to be aware of?",
      "ja": "*どのような非技術的な活動を我々は認識する必要がありますか？"
    },
    {
      "indent": 10,
      "text": "* How might such non-technical activities impact on IETF/W3C?",
      "ja": "*どのように可能性があるIETF / W3Cのような非技術的な活動への影響？"
    },
    {
      "indent": 10,
      "text": "* How might IETF/W3C activities impact those non-technical activities?",
      "ja": "*どのようにIETF / W3Cの活動は、これらの非技術的な活動に影響を与えるのでしょうか？"
    },
    {
      "indent": 3,
      "text": "Saturday plan, open mic, wrap-up of the day",
      "ja": "土曜日の計画、オープンマイク、一日のラップアップ"
    },
    {
      "indent": 0,
      "text": "B.2. Saturday 1 March",
      "ja": "B.2。土曜日3月1日"
    },
    {
      "indent": 3,
      "text": "Minutes: <http://www.w3.org/2014/03/01-strint-minutes.html>",
      "ja": "分：<http://www.w3.org/2014/03/01-strint-minutes.html>"
    },
    {
      "indent": 3,
      "text": "IV. COMSEC 2 - What improvements to COMSEC tools are needed? (Presenter: Mark Nottingham; Moderator: Steve Bellovin) Slides: <https://down.dsg.cs.tcd.ie/strint-slides/s4-opportunistic.pdf>",
      "ja": "IV。 COMSEC 2  -  COMSECツールにどのような改善が必要とされていますか？ （プレゼンター：マーク・ノッティンガム;司会：スティーブBellovin氏）スライド：<https://down.dsg.cs.tcd.ie/strint-slides/s4-opportunistic.pdf>"
    },
    {
      "indent": 8,
      "text": "*  Opportunistic encryption - what is it and where it might\n   apply",
      "raw": true
    },
    {
      "indent": 8,
      "text": "* Mitigations aiming to block PM vs. detect PM - when to try which?",
      "ja": "PMをブロック対PMを検出することを目指し*た軽減 - ときに試してみますか？"
    },
    {
      "indent": 3,
      "text": "V. Metadata - How can we reduce the metadata that protocols expose? (Presenters: Alfredo Pironti, Ted Hardie; Moderator: Alissa Cooper)",
      "ja": "V.メタデータ - どのようにして公開するプロトコルメタデータを減らすことができますか？ （プレゼンター：アルフレドPironti、テッドハーディー;司会：アリッサ・クーパー）"
    },
    {
      "indent": 5,
      "text": "Slides: <https://down.dsg.cs.tcd.ie/strint-slides/s5-1metadata-pironti.pdf> <https://down.dsg.cs.tcd.ie/strint-slides/s5-2metadata-hardie.pdf> <https://down.dsg.cs.tcd.ie/strint-slides/s5-3metadata-cooper.pdf>",
      "ja": "スライド：<https://down.dsg.cs.tcd.ie/strint-slides/s5-1metadata-pironti.pdf> <https://down.dsg.cs.tcd.ie/strint-slides/s5- 2metadata-hardie.pdf> <https://down.dsg.cs.tcd.ie/strint-slides/s5-3metadata-cooper.pdf>"
    },
    {
      "indent": 8,
      "text": "* Metadata, fingerprinting, minimisation",
      "ja": "*メタデータ、指紋、最小化"
    },
    {
      "indent": 8,
      "text": "* What's out there?",
      "ja": "*そこには何ですか？"
    },
    {
      "indent": 8,
      "text": "* How can we do better?",
      "ja": "*どのように我々はよりよく行うことができますか？"
    },
    {
      "indent": 3,
      "text": "VI. Deployment - How can we address PM in deployment / operations? (Presenter: Eliot Lear; Moderator: Barry Leiba) Slides: <https://down.dsg.cs.tcd.ie/strint-slides/s6-deploy.pdf>",
      "ja": "VI。展開 - どのように私たちは、PMは、展開/運用に取り組むことができますか？ （プレゼンター：エリオット・リア;司会：バリー・レイバ）スライド：<https://down.dsg.cs.tcd.ie/strint-slides/s6-deploy.pdf>"
    },
    {
      "indent": 8,
      "text": "*  \"Mega\"-commercial services (clouds, large-scale email and\n   Online Social Networks, SIP, WebRTC)",
      "raw": true
    },
    {
      "indent": 8,
      "text": "* Target dispersal - good goal or wishful thinking?",
      "ja": "*ターゲット散布 - 良い目標や希望的観測？"
    },
    {
      "indent": 8,
      "text": "* Middleboxes: when a help and when a hindrance?",
      "ja": "*のMiddleboxes：ときの助けと障害？"
    },
    {
      "indent": 3,
      "text": "VII. Break-out Sessions (x 3) / Bar-Camp style (Hannes Tschofenig)",
      "ja": "VII。ブレイクアウトセッション（×3）/バー・キャンプスタイル（ハンネスTschofenig）"
    },
    {
      "indent": 8,
      "text": "* Content to be defined during meeting, as topics come up",
      "ja": "*会議中に定義されるコンテンツ、話題が出てくるよう"
    },
    {
      "indent": 8,
      "text": "* Sum up at the end to gather conclusions for report",
      "ja": "*レポートの結論を収集するために終わりまで合計します"
    },
    {
      "indent": 8,
      "text": "Break-outs:",
      "ja": "ブレイクアウト："
    },
    {
      "indent": 8,
      "text": "1. Research Questions (Moderator: Kenny Paterson)",
      "section_title": true,
      "ja": "1.研究の質問（司会：ケニー・パターソン）"
    },
    {
      "indent": 12,
      "text": "+ Do we need more/different crypto tools?",
      "ja": "+私たちはより/異なる暗号ツールが必要ですか？"
    },
    {
      "indent": 12,
      "text": "+ How can applications make better use of COMSEC tools?",
      "ja": "+どのようなアプリケーションは、COMSECツールをより有効に利用することができますか？"
    },
    {
      "indent": 12,
      "text": "+ What research topics could be handled in IRTF?",
      "ja": "+どのような研究テーマは、IRTFで扱われるだろうか？"
    },
    {
      "indent": 12,
      "text": "+ What other research would help?",
      "ja": "+他のどのような研究に役立つだろうか？"
    },
    {
      "indent": 8,
      "text": "2. Clients",
      "section_title": true,
      "ja": "2.クライアント"
    },
    {
      "indent": 8,
      "text": "3. On by default",
      "section_title": true,
      "ja": "デフォルトでON 3."
    },
    {
      "indent": 8,
      "text": "4. Measurement",
      "section_title": true,
      "ja": "4.測定"
    },
    {
      "indent": 8,
      "text": "5. Opportunistic",
      "section_title": true,
      "ja": "5.日和見"
    },
    {
      "indent": 3,
      "text": "VIII. Break-out Reports, Open Mic & Conclusions - What are we going to do to address PM? Slides: <https://www.w3.org/2014/strint/slides/summary.pdf>",
      "ja": "VIII。ブレイクアウトレポート、オープンマイク＆結論 - 私たちはPMに対処するために行うつもりですか？スライド：<https://www.w3.org/2014/strint/slides/summary.pdf>"
    },
    {
      "indent": 9,
      "text": "*  Gather conclusions / recommendations / goals from earlier\n   sessions",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Appendix C. Workshop Chairs and Program Committee",
      "ja": "付録C.ワークショップの議長とプログラム委員会"
    },
    {
      "indent": 3,
      "text": "The workshop chairs were three: Stephen Farrell (TCD) and Rigo Wenning (W3C) from the STREWS project, and Hannes Tschofenig (ARM) from the STREWS Interest Group.",
      "ja": "スティーブン・ファレル（TCD）とSTREWSプロジェクトから離合ヴェニング（W3C）、およびSTREWSインタレストグループからハンネスTschofenig（ARM）：ワークショップの椅子は3でした。"
    },
    {
      "indent": 3,
      "text": "The Technical Programme Committee (TPC) was charged with evaluating the submitted papers. It was made up of the members of the STREWS project, the members of the STREWS Interest Group, plus invited experts: Bernard Aboba (Microsoft), Dan Appelquist (Telefonica & W3C TAG), Richard Barnes (Mozilla), Bert Bos (W3C), Lieven Desmet (KU Leuven), Karen O'Donoghue (ISOC), Russ Housley (Vigil Security), Martin Johns (SAP), Ben Laurie (Google), Eliot Lear (Cisco), Kenny Paterson (Royal Holloway), Eric Rescorla (RTFM), Wendy Seltzer (W3C), Dave Thaler (Microsoft), and Sean Turner (IECA).",
      "ja": "テクニカルプログラム委員会（TPC）は、投稿論文の評価を投入しました。これは、専門家STREWSプロジェクトのメンバー、STREWSインタレスト・グループのメンバーで構成され、プラス招待されました：バーナードAboba（マイクロソフト）、ダン・Appelquist（テレフォニカ＆W3C TAG）、リチャード・バーンズ（Mozillaの）、バート・ボス（W3C） 、リーフェンDesmet（KUルーベン）、カレンO'Donoghue（ISOC）、ラスHousley（ビジルセキュリティ）、マーティン・ジョンズ（SAP）、ベン・ローリー（グーグル）、エリオット・リア（シスコ）、ケニー・パターソン（ロイヤル・ホロウェイ）、エリックレスコラ（RTFM）、ウェンディー・セルツァー（W3C）、デーブターラー（マイクロソフト）、そしてショーン・ターナー（IECA）。"
    },
    {
      "indent": 0,
      "text": "Appendix D. Participants",
      "ja": "付録D.参加"
    },
    {
      "indent": 3,
      "text": "The participants to the workshop were:",
      "ja": "ワークショップへの参加者がありました。"
    },
    {
      "indent": 3,
      "text": "o Bernard Aboba (Microsoft Corporation) o Thijs Alkemade (Adium) o Daniel Appelquist (Telefonica Digital) o Jari Arkko (Ericsson) o Alia Atlas (Juniper Networks) o Emmanuel Baccelli (INRIA) o Mary Barnes o Richard Barnes (Mozilla) o Steve Bellovin (Columbia University) o Andrea Bittau (Stanford University) o Marc Blanchet (Viagenie) o Carsten Bormann (Uni Bremen TZI) o Bert Bos (W3C) o Ian Brown (Oxford University) o Stewart Bryant (Cisco Systems) o Randy Bush (IIJ / Dragon Research Labs) o Kelsey Cairns (Washington State University) o Stuart Cheshire (Apple) o Vincent Cheval (University of Birmingham) o Benoit Claise (Cisco) o Alissa Cooper (Cisco) o Dave Crocker (Brandenburg InternetWorking) o Leslie Daigle (Internet Society) o George Danezis (University College London) o Spencer Dawkins (Huawei) o Mark Donnelly (Painless Security) o Nick Doty (W3C) o Dan Druta (AT&T) o Peter Eckersley (Electronic Frontier Foundation) o Lars Eggert (NetApp) o Kai Engert (Red Hat) o Monika Ermert o Stephen Farrell (Trinity College Dublin) o Barbara Fraser (Cisco) o Virginie Galindo (gemalto) o Stefanie Gerdes (Uni Bremen TZI) o Daniel Kahn Gillmor (ACLU) o Wendy M. Grossman o Christian Grothoff (The GNUnet Project) o Oliver Hahm (INRIA) o Joseph Lorenzo Hall (Center for Democracy & Technology) o Phillip Hallam-Baker o Harry Halpin (W3C/MIT and IRI) o Ted Hardie (Google) o Joe Hildebrand (Cisco Systems) o Russ Housley (Vigil Security, LLC) o Cullen Jennings (CISCO) o Leif Johansson (SUNET) o Harold Johnson (Irdeto) o Alan Johnston (Avaya) o L. Aaron Kaplan (CERT.at) o Steve Kent (BBN Technologies) o Achim Klabunde (European Data Protection Supervisor) o Hans Kuhn (NOC) o Christian de Larrinaga o Ben Laurie (Google) o Eliot Lear (Cisco Ssytems) o Barry Leiba (Huawei Technologies) o Sebastian Lekies (SAP AG) o Orit Levin (Microsoft Corporation) o Carlo Von LynX (#youbroketheinternet) o Xavier Marjou (Orange) o Larry Masinter (Adobe) o John Mattsson (Ericsson) o Patrick McManus (Mozilla) o Doug Montgomery (NIST) o Kathleen Moriarty (EMC) o Alec Muffett (Facebook) o Suhas Nandakumar (Cisco Systems) o Linh Nguyen (ERCIM/W3C) o Linus Nordberg (NORDUnet) o Mark Nottingham o Karen O'Donoghue (Internet Society) o Piers O'Hanlon (Oxford Internet Institute) o Kenny Paterson (Royal Holloway, University of London) o Jon Peterson (Neustar) o Joshua Phillips (University of Birmingham) o Alfredo Pironti (INRIA) o Dana Polatin-Reuben (University of Oxford) o Prof. Johan Pouwelse (Delft University of Technology) o Max Pritikin (Cisco) o Eric Rescorla (Mozilla) o Pete Resnick (Qualcomm Technologies, Inc.) o Tom Ristenpart (University of Wisconsin) o Andrei Robachevsky (Internet Society) o David Rogers (Copper Horse) o Scott Rose (NIST) o Christine Runnegar (Internet Society) o Philippe De Ryck (DistriNet - KU Leuven) o Peter Saint-Andre (&yet) o Runa A. Sandvik (Center for Democracy and Technology) o Jakob Schlyter o Dr. Jan Seedorf (NEC Laboratories Europe) o Wendy Seltzer (W3C) o Melinda Shore (No Mountain Software) o Dave Thaler (Microsoft) o Brian Trammell (ETH Zurich) o Hannes Tschofenig (ARM Limited) o Sean Turner (IECA, Inc.) o Matthias Waehlisch (Freie Universitaet Berlin) o Greg Walton (Oxford University) o Rigo Wenning (W3C) o Tara Whalen (Apple Inc.) o Greg Wood (Internet Society) o Jiangshan Yu (University of Birmingham) o Aaron Zauner o Dacheng Zhang (Huawei) o Phil Zimmermann (Silent Circle LLC) o Juan-Carlos Zuniga (InterDigital)",
      "ja": "スティーブOリチャード・バーンズ（Mozillaの）Oメアリー・バーンズOエマニュエルBaccelli（INRIA）Oアリアアトラス（ジュニパーネットワークス）OヤリArkko（エリクソン）OダニエルAppelquist（テレフォニカ・デジタル）OタイスAlkemade（Adiumの）〇〇バーナードAboba（マイクロソフト株式会社）ランディブッシュO・スチュワートブライアント（シスコシステムズ）（Oイアン・ブラウン（オックスフォード大学）Oバート・ボス（W3C）Oカルステンボルマン（ユニブレーメンTZI）Oマルク・ブランシェ（Viagenie）OアンドレアBittau（スタンフォード大学）O Bellovin氏（コロンビア大学）レスリーDaigle氏Oデイブ・クロッカー（ブランデンブルクインターネットワーキング）Oアリッサ・クーパー（シスコ）OブノワClaise（シスコ）Oヴィンセントシュヴァル（バーミンガム大学）Oスチュアート・チェシャー（アップル）Oケルシーケアンズ（ワシントン州立大学）O IIJ /ドラゴン研究所）ラースEggertの（NetAppのOピーター・エッカースリー（電子フロンティア財団）OダンDruta（AT＆T）Oニック・ドーティ（W3C）Oマーク・ドネリー（無痛セキュリティ）Oスペンサードーキンス（華為）OジョージDanezis（ロンドン大学）O（インターネット協会）セントOモニカErmert O）カイEngert（レッドハット）オリバーHahm OクリスチャンGrothoff（GNUnetのプロジェクト）OウェンディーM.グロスマンOダニエル・カーンGillmor氏（ACLU）OステファニーGerdes（ユニブレーメンTZI）Oヴィルジニーガリンド（ジェムアルト）Oバーバラ・フレイザー（シスコ）O・ファレル（トリニティ・カレッジ・ダブリン）ephenラスHousley（ビジルセキュリティ、LLC Oジョー・ヒルデブラント（シスコシステムズ）Oテッド・ハーディー（グーグル）Oハリー・ハルピン（W3C / MITとIRI）Oフィリップハラム - ベイカーOジョセフ・ロレンツォ・ホール（民主主義と技術のためのセンター）O（INRIA） ）カレンジェニングス（CISCO）Oレイフ・ヨハンソン（SUNET）Oハロルド・ジョンソン（Irdeto社）Oアラン・ジョンストン（アバイア）Oスティーブ・ケント（BBNテクノロジーズO L.アーロン・カプラン（CERT.at））OアヒムKlabunde（欧州データ保護スーパーバイザーO ）ベン・ローリー（グーグル）Oクリスチャン・ド・Larrinaga Oハンス・クーン（NOC）Oバリー・レイバ（華為技術Oエリオット・リア（シスコSsytems））Oカルロ・フォンLYNX OのoriTレヴィン（マイクロソフト社）（OセバスチャンLekies（SAP AG）O #youbroketheinternet）パトリック・マクマナス（Mozill Oジョン・マットソン（エリクソン）OラリーMasinter（アドビシステムズ社）OザビエルMarjou（オレンジ）O A）アウレック・マフェット（Facebookの）Oキャスリーン・モリアーティ（EMC）Oダグ・モンゴメリー（NIST）O Suhas Nandakumar（シスコシステムズ）OたLiNHグエン（ERCIM / W3C）Oライナスノードバーグ（NORDUnet）Oマーク・ノッティンガムOカレンO'Donoghue（OダナPolatin・ルーベン（OアルフレドPironti（INRIA）Oジョシュア・フィリップス（バーミンガム大学）Oジョン・ピーターソン（Neustar）Oケニー・パターソン（ロイヤル・ホロウェイ、ロンドン大学）O埠頭オハンロン（オックスフォードインターネット研究所）Oインターネット協会）アンドレイRobachevsky OトムRistenpart OピートレズニックOエリックレスコラOマックスPritikin（シスコ）（Mozillaの）O教授ヨハン・Pouwelse（デルフト工科大学）（クアルコム・テクノロジーズ社）（ウィスコンシン大学）Oオックスフォード大学）（インターネットルナA.サンドビックOピーターサンタンドレ（＆まだ）（O KUルーベン）民主主義のためのセンターと - フィリップ・デ・Ryck（DistriNet OクリスティンRunnegar（インターネット協会）O・スコット・ローズ（NIST）Oデビッド・ロジャース（コッパーホース）O協会）ウェンディー・セルツァー（W3C）〇〇博士ヤン・セードルフ（NEC欧州研究所）OヤコブSchlyter Oテクノロジー）グレッグ・ウォルトン（オックスフォード大学OマティアスWaehlisch（Freie Universitaetベルリン）Oショーン・ターナー（IECA社）OハンネスTschofenig（ARM限定）Oブライアン・トラメル（ETHチューリッヒ）Oデーブターラー（マイクロソフト）Oメリンダ・ショア（ノー・マウンテンソフトウェア） ）グレッグ・ウッド（インターネット協会）Oタラウェイレン（アップル社O離合ヴェニング（W3C））Oバーミンガムの江山ゆう（大学）OアーロンZauner O大成張（華為）Oフィル・ジマーマン（サイレントサークルLLC）O Juan- Oカルロス・スニガ（インターデジタル）"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Stephen Farrell Trinity College, Dublin Email: stephen.farrell@cs.tcd.ie URI: https://www.cs.tcd.ie/Stephen.Farrell/",
      "ja": "スティーブン・ファレルトリニティカレッジ、ダブリンEメール：stephen.farrell@cs.tcd.ie URI：https://www.cs.tcd.ie/Stephen.Farrell/"
    },
    {
      "indent": 3,
      "text": "Rigo Wenning World Wide Web Consortium 2004, route des Lucioles B.P. 93 Sophia-Antipolis 06902 France Email: rigo@w3.org URI: http://www.w3.org/People/Rigo/",
      "ja": "2004年の離合ヴェニングワールドワイドウェブコンソーシアム、ルート・デLucioles B.P. 93ソフィア・アンティポリス、フランス06902 Eメール：rigo@w3.org URI：http://www.w3.org/People/Rigo/"
    },
    {
      "indent": 3,
      "text": "Bert Bos World Wide Web Consortium 2004, route des Lucioles B.P. 93 Sophia-Antipolis 06902 France Email: bert@w3.org",
      "ja": "バート・ボス、ワールド・ワイド・ウェブ・コンソーシアム2004ルートデLucioles 93 PB 06902ソフィアアンティポリスフランスメール：bert@w3.org"
    },
    {
      "indent": 3,
      "text": "Marc Blanchet Viagenie 246 Aberdeen Quebec, QC G1R 2E1 Canada Email: Marc.Blanchet@viagenie.ca URI: http://viagenie.ca",
      "ja": "マルク・ブランシェViagenie 246アバディーンケベック、QC G1R 2E1カナダEメール：Marc.Blanchet@viagenie.ca URI：http://viagenie.ca"
    },
    {
      "indent": 3,
      "text": "Hannes Tschofenig ARM Ltd. 110 Fulbourn Rd Cambridge CB1 9NJ Great Britain Email: Hannes.tschofenig@gmx.net URI: http://www.tschofenig.priv.at",
      "ja": "ハンネスTschofenig ARM社110 Fulbourn RdのケンブリッジCB1 9NJグレートブリテンメール：Hannes.tschofenig@gmx.net URI：http://www.tschofenig.priv.at"
    }
  ]
}