{
  "title": {
    "text": "RFC 7692 - Compression Extensions for WebSocket",
    "ja": "RFC 7692 - WebSocketの圧縮機能拡張"
  },
  "number": 7692,
  "created_at": "2019-11-01 06:33:35.698469+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        T. Yoshino\nRequest for Comments: 7692                                  Google, Inc.\nCategory: Standards Track                                  December 2015\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Compression Extensions for WebSocket",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines a framework for creating WebSocket extensions that add compression functionality to the WebSocket Protocol. An extension based on this framework compresses the payload data portion of WebSocket data messages on a per-message basis using parameters negotiated during the opening handshake. This framework provides a general method for applying a compression algorithm to the contents of WebSocket messages. Each compression algorithm has to be defined in a document defining the extension by specifying the parameter negotiation and the payload transformation algorithm in detail. This document also specifies one specific compression extension using the DEFLATE algorithm.",
      "ja": "この文書では、WebSocketのプロトコルに圧縮機能を追加するのWebSocket拡張を作成するためのフレームワークを定義します。このフレームワークに基づく拡張は、開口ハンドシェーク中にネゴシエートされたパラメータを使用して、メッセージごとの基礎でのWebSocketデータメッセージのペイロードデータ部分を圧縮します。このフレームワークは、WebSocketのメッセージの内容に圧縮アルゴリズムを適用するための一般的な方法を提供します。各圧縮アルゴリズムは、パラメータのネゴシエーションおよび詳細におけるペイロード変換アルゴリズムを指定することによって、拡張を定義する文書で定義されなければなりません。また、このドキュメントでは、deflateアルゴリズムを使用して、ある特定の圧縮拡張子を指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7692.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7692で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Conformance Requirements and Terminology ........................3\n3. Complementary Terminology .......................................4\n4. WebSocket Per-Message Compression Extension .....................5\n5. Extension Negotiation ...........................................5\n   5.1. General Negotiation Flow ...................................9\n   5.2. Negotiation Examples .......................................9\n6. Framing ........................................................10\n   6.1. Compression ...............................................10\n   6.2. Decompression .............................................12\n7. The \"permessage-deflate\" Extension .............................12\n   7.1. Extension Parameters ......................................14\n        7.1.1. Context Takeover Control ...........................14\n        7.1.2. Limiting the LZ77 Sliding Window Size ..............16\n        7.1.3. Examples ...........................................18\n   7.2. Message Payload Transformation ............................19\n        7.2.1. Compression ........................................19\n        7.2.2. Decompression ......................................21\n        7.2.3. Examples ...........................................22\n   7.3. Implementation Notes ......................................25\n8. Security Considerations ........................................25\n9. IANA Considerations ............................................26\n   9.1. Registration of the \"permessage-deflate\" WebSocket\n        Extension Name ............................................26\n   9.2. Registration of the \"Per-Message Compressed\"\n        WebSocket Framing Header Bit ..............................26\n10. References ....................................................27\n   10.1. Normative References .....................................27\n   10.2. Informative References ...................................27\nAcknowledgements ..................................................28\nAuthor's Address ..................................................28",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document specifies a framework for adding compression functionality to the WebSocket Protocol [RFC6455]. The framework specifies how to define WebSocket Per-Message Compression Extensions (PMCEs) for a compression algorithm based on the extension concept of the WebSocket Protocol specified in Section 9 of [RFC6455]. A WebSocket client and a peer WebSocket server negotiate the use of a PMCE and determine the parameters required to configure the compression algorithm during the WebSocket opening handshake. The client and server can then exchange data messages whose frames contain compressed data in the payload data portion.",
      "ja": "この文書では、WebSocketのプロトコル[RFC6455]に圧縮機能を追加するためのフレームワークを指定します。フレームワークは、[RFC6455]のセクション9で指定されたのWebSocketプロトコルの拡張概念に基づいて圧縮アルゴリズムのために、メッセージごとの圧縮拡張機能（PMCEs）のWebSocketを定義する方法を指定します。 WebSocketクライアント及びピア用WebSocketサーバはPMCEの使用を交渉とのWebSocket開口ハンドシェイク中に圧縮アルゴリズムを設定するために必要なパラメータを決定します。クライアントとサーバは、そのフレームのペイロードデータ部分で圧縮されたデータを含むデータメッセージを交換することができます。"
    },
    {
      "indent": 3,
      "text": "This framework only specifies a general method for applying a compression algorithm to the contents of WebSocket messages. Each individual PMCE has to be specified in a document describing in detail how to negotiate the configuration parameters for the specific compression algorithm used by that PMCE and how to transform (compress and decompress) data in the payload data portion.",
      "ja": "このフレームワークは、唯一のWebSocketメッセージの内容に圧縮アルゴリズムを適用するための一般的な方法を指定します。各個々PMCEは、ペイロードデータ部にデータを変換（圧縮及び解凍）することPMCE及び方法で使用される特定の圧縮アルゴリズムの構成パラメータを交渉する方法を詳細に説明する文書に指定されなければなりません。"
    },
    {
      "indent": 3,
      "text": "A WebSocket client may offer multiple PMCEs during the WebSocket opening handshake. A peer WebSocket server receiving the offer may choose to accept the preferred PMCE or decline all of them. PMCEs use the RSV1 bit of the WebSocket frame header to indicate whether a message is compressed or not so that an endpoint can choose not to compress messages with incompressible contents.",
      "ja": "WebSocketクライアントがWebSocketの開口ハンドシェイク中に複数のPMCEsを提供することがあります。提供を受けたピアのWebSocketサーバーが優先PMCEを受け入れるか、またはそれらのすべてを拒否することがあります。 PMCEsエンドポイントが非圧縮コンテンツを持つメッセージを圧縮しないように選択することができるように、メッセージは圧縮されているか否かを示すためのWebSocketフレームヘッダのRSV1ビットを使用します。"
    },
    {
      "indent": 3,
      "text": "This document also specifies one specific PMCE based on the DEFLATE [RFC1951] algorithm. The DEFLATE algorithm is widely available on various platforms, and its overhead is small. The extension name of this PMCE is \"permessage-deflate\". To align the end of compressed data to an octet boundary, this extension uses the algorithm described in Section 2.1 of [RFC1979]. Endpoints can take over the LZ77 sliding window [LZ77] used to build frames for previous messages to achieve a better compression ratio. For resource-limited devices, this extension provides parameters to limit memory usage for compression context.",
      "ja": "この文書はまた、DEFLATE [RFC1951]のアルゴリズムに基づいて、ある特定のPMCEを指定します。 deflateアルゴリズムは、さまざまなプラットフォーム上で広く利用可能であり、そのオーバーヘッドは小さいです。このPMCEの拡張子名は「permessage-デフレート」です。オクテット境界に圧縮されたデータの末尾を整列させるために、この拡張は、[RFC1979]のセクション2.1に記載されたアルゴリズムを使用します。エンドポイントは、[LZ77]は、前のメッセージは、より良い圧縮率を達成するためのフレームを構築するために使用LZ77スライディングウィンドウを引き継ぐことができます。リソース制限デバイスの場合、この拡張は、圧縮コンテキストのメモリ使用量を制限するためのパラメータを提供します。"
    },
    {
      "indent": 0,
      "text": "2. Conformance Requirements and Terminology",
      "section_title": true,
      "ja": "2.適合性要件と用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "Requirements phrased in the imperative as part of algorithms (such as \"strip any leading space characters\" or \"return false and abort these steps\") are to be interpreted with the meaning of the key word (\"MUST\", \"SHOULD\", \"MAY\", etc.) used in introducing the algorithm.",
      "ja": "（例えば、「任意の先頭の空白文字を削除」または「falseを返し、これらの手順を中止します」など）のアルゴリズムの一部として不可欠に言葉で表現要件のキーワード（「MUST」、「SHOULD」の意味に解釈されるべきです、 \" MAY」、など）は、アルゴリズムの導入に使用されます。"
    },
    {
      "indent": 3,
      "text": "Conformance requirements phrased as algorithms or specific steps can be implemented in any manner, so long as the end result is equivalent. In particular, the algorithms defined in this specification are intended to be easy to understand and are not intended to be performant.",
      "ja": "アルゴリズムや特定の手順と言う適合要件があれば、最終結果は同等であるように、任意の方法で実施することができます。特に、本明細書で定義されたアルゴリズムは、理解しやすいように意図されており、パフォーマンスであることを意図するものではありません。"
    },
    {
      "indent": 3,
      "text": "This document references the procedure to _Fail the WebSocket Connection_. This procedure is defined in Section 7.1.7 of [RFC6455].",
      "ja": "この文書では、WebSocketをConnection_を_Failする手順を参照します。この手順は、[RFC6455]のセクション7.1.7で定義されています。"
    },
    {
      "indent": 3,
      "text": "This document references the event that _The WebSocket Connection is Established_ and the event that _A WebSocket Message Has Been Received_. These events are defined in Sections 4.1 and 6.2, respectively, of [RFC6455].",
      "ja": "この文書では、_TheのWebSocket接続がEstablished_と_AのWebSocketメッセージがReceived_されていることをイベントであること、イベントを参照しています。これらのイベントは、[RFC6455]の、それぞれ、セクション4.1および6.2で定義されています。"
    },
    {
      "indent": 3,
      "text": "This document uses the Augmented Backus-Naur Form (ABNF) notation of [RFC5234]. The DIGIT (decimal 0-9) rule is included by reference, as defined in the Appendix B.1 of [RFC5234].",
      "ja": "このドキュメントは[RFC5234]の増補バッカス - ナウアフォーム（ABNF）の表記を使用します。 [RFC5234]の付録B.1で定義されDIGIT（小数0-9）ルールは、参照により含まれます。"
    },
    {
      "indent": 0,
      "text": "3. Complementary Terminology",
      "section_title": true,
      "ja": "3.相補用語"
    },
    {
      "indent": 3,
      "text": "This document defines some terms about WebSocket and WebSocket extension mechanisms that are underspecified or not defined at all in [RFC6455].",
      "ja": "この文書では不足のまたは[RFC6455]に全く定義されていないのWebSocketとのWebSocket拡張メカニズムについてのいくつかの用語を定義します。"
    },
    {
      "indent": 3,
      "text": "data message - a message consisting of data frames as defined in Section 5.6 of [RFC6455].",
      "ja": "データメッセージ -  [RFC6455]のセクション5.6で定義されたデータフレームからなるメッセージ。"
    },
    {
      "indent": 3,
      "text": "message payload (or payload of a message) - the concatenation of the payload data portion of all data frames (see Section 6.2 of [RFC6455]) representing a single message.",
      "ja": "メッセージ・ペイロード（またはメッセージのペイロード） - すべてのデータフレームのペイロードデータ部分の連結（[RFC6455]のセクション6.2を参照）は、単一のメッセージを表します。"
    },
    {
      "indent": 3,
      "text": "next extension in use after extension X - the next extension listed after X in the \"Sec-WebSocket-Extensions\" header in the server's opening handshake as defined in Section 9.1 of [RFC6455]. Such an extension is applied to outgoing data from the application right after X on the sender side but is applied right before X to incoming data from the underlying transport.",
      "ja": "延長X使用後の次の拡張 -  [RFC6455]のセクション9.1で定義されているサーバの開口ハンドシェークにおける「SEC-のWebSocket-拡張」ヘッダ内のXの後に列挙された次の拡張。このような拡張は、右送信側のXの後に、アプリケーションからの出力データに適用されますが、基本的なトランスポートからの着信データにXの前に右に適用されます。"
    },
    {
      "indent": 3,
      "text": "extension in use preceding extension X - the extension listed right before X in the \"Sec-WebSocket-Extensions\" header in the server's opening handshake. Such an extension is applied to outgoing data from the application right before X on the sender side but is applied right after X to incoming data from the underlying transport.",
      "ja": "拡張Xの前に、使用中の拡張機能 - サーバーのオープニングハンドシェイクで「SEC-のWebSocket-拡張」ヘッダの右Xの前にリストされている拡張。このような拡張は、右送信側のX前に、アプリケーションからの出力データに適用されますが、基本的なトランスポートからの着信データに右のXの後に適用されます。"
    },
    {
      "indent": 3,
      "text": "extension negotiation offer - each element in the \"Sec-WebSocket-Extensions\" header in the client's opening handshake.",
      "ja": "延長交渉のオファー - クライアントのオープニングハンドシェイクで「SEC-のWebSocket-拡張」ヘッダ内の各要素。"
    },
    {
      "indent": 3,
      "text": "extension negotiation response - each element in the \"Sec-WebSocket-Extensions\" header in the server's opening handshake.",
      "ja": "延長交渉応答 - サーバーのオープニングハンドシェイクで「SEC-のWebSocket-拡張」ヘッダ内の各要素。"
    },
    {
      "indent": 3,
      "text": "corresponding extension negotiation response for an extension negotiation offer - an extension negotiation response that a server sends back to the peer client containing the same extension name as the offer and meeting the requirements represented by the offer.",
      "ja": "延長交渉のオファーのための対応の延長交渉応答 - サーバが提供と同じ拡張名を含むとの申し出によって表される要件を満たすピアクライアントに送り返すことを延長交渉応答。"
    },
    {
      "indent": 3,
      "text": "Accepting an extension negotiation offer - including a corresponding extension negotiation response for the offer in the \"Sec-WebSocket-Extensions\" header in the server's opening handshake.",
      "ja": "サーバーのオープニングハンドシェイクで「SEC-のWebSocket-拡張」ヘッダで提供するために対応する延長交渉応答を含む - 延長交渉の申し出を受け入れます。"
    },
    {
      "indent": 3,
      "text": "Declining an extension negotiation offer - not including a corresponding extension negotiation response for the offer in the \"Sec-WebSocket-Extensions\" header in the server's opening handshake.",
      "ja": "延長交渉プランを減少 - サーバーのオープニングハンドシェイクで「SEC-のWebSocket-拡張」ヘッダで提供するために対応する延長交渉応答を含めていません。"
    },
    {
      "indent": 0,
      "text": "4. WebSocket Per-Message Compression Extension",
      "section_title": true,
      "ja": "4.のWebSocketメッセージごとの圧縮拡張"
    },
    {
      "indent": 3,
      "text": "WebSocket PMCEs are extensions to the WebSocket Protocol enabling compression functionality. PMCEs are built based on the extension concept of the WebSocket Protocol specified in Section 9 of [RFC6455]. PMCEs are individually defined for each compression algorithm to be implemented and are registered in the \"WebSocket Extension Name Registry\" created in Section 11.4 of [RFC6455]. Each PMCE referring to this framework MUST define the following:",
      "ja": "WebSocket PMCEsは、圧縮機能を有効にするのWebSocketプロトコルの拡張機能です。 PMCEsは、[RFC6455]のセクション9で指定されたのWebSocketプロトコルの拡張概念に基づいて構築されています。 PMCEsは、個別に実施される各圧縮アルゴリズムのために定義され、[RFC6455]のセクション11.4で作成「のWebSocket拡張名レジストリ」に登録されています。このフレームワークを参照する各PMCEには、次のように定義する必要があります。"
    },
    {
      "indent": 3,
      "text": "o The extension name of the PMCE and any applicable extension parameters that MUST be included in the \"Sec-WebSocket-Extensions\" header during the extension negotiation offer/response.",
      "ja": "PMCEの拡張名と拡張子交渉のオファー/応答中に「SEC-のWebSocket-拡張」ヘッダに含まれなければならない任意の適用可能な拡張パラメータO。"
    },
    {
      "indent": 3,
      "text": "o How to interpret the extension parameters exchanged during the opening handshake.",
      "ja": "Oオープニングハンドシェイクの間に交換拡張パラメータを解釈する方法。"
    },
    {
      "indent": 3,
      "text": "o How to transform the payload of a message.",
      "ja": "メッセージのペイロードを変換する方法O。"
    },
    {
      "indent": 3,
      "text": "One PMCE is defined in Section 7 of this document and is registered in Section 9. Other PMCEs may be defined in the future in other documents.",
      "ja": "一つPMCEは、他のドキュメントで将来定義することができるこのドキュメントのセクション7で定義され、第9節その他PMCEsに登録されています。"
    },
    {
      "indent": 3,
      "text": "Section 5 describes the basic extension negotiation process. Section 6 describes how to apply the compression algorithm with negotiated parameters to the contents of WebSocket messages.",
      "ja": "第5節では、基本的な延長交渉プロセスを説明します。第6節は、WebSocketのメッセージの内容に交渉されたパラメータで圧縮アルゴリズムを適用する方法について説明します。"
    },
    {
      "indent": 0,
      "text": "5. Extension Negotiation",
      "section_title": true,
      "ja": "5.延長交渉"
    },
    {
      "indent": 3,
      "text": "To offer use of a PMCE, a client MUST include the extension name of the PMCE in the \"Sec-WebSocket-Extensions\" header field of its opening handshake of the WebSocket connection. Extension parameters are used to specify the PMCE offer in detail. For example, a client lists its preferred configuration parameter values for the compression algorithm of the PMCE. A client may also offer multiple PMCE choices to the server by including multiple elements in the \"Sec-WebSocket-Extensions\" header, one for each PMCE offered. This set of elements MAY include multiple PMCEs with the same extension name to offer the possibility to use the same algorithm with different configuration parameters. The order of elements is important as it specifies the client's preference. An element preceding another element has higher preference. It is recommended that a server accepts PMCEs with higher preference if the server supports them.",
      "ja": "PMCEの使用を提供するために、クライアントがWebSocketの接続の開業ハンドシェイクの「SEC-のWebSocket-拡張機能」ヘッダフィールドにPMCEの拡張名を含まなければなりません。拡張パラメータを詳細にPMCEプランを指定するために使用されています。例えば、クライアントがPMCEの圧縮アルゴリズムのためにその好ましい構成パラメータの値を示します。クライアントは、「SEC-のWebSocket-拡張」ヘッダ、提供される各PMCEための1つの中に複数の要素を含めることによって、サーバへの複数PMCEの選択肢を提供することができます。要素のこのセットは、さまざまな設定パラメータと同じアルゴリズムを使用する可能性を提供するために、同じ拡張子名を持つ複数のPMCEsを含むかもしれません。それは、クライアントの好みを指定して要素の順序は重要です。別の要素に先行する要素は、より高い優先度を有しています。サーバーがサポートしている場合、サーバーは、より高い優先順位を持つPMCEsを受け入れることをお勧めします。"
    },
    {
      "indent": 3,
      "text": "A PMCE negotiation offer provides requests and/or hints to the server.",
      "ja": "PMCE交渉オファーは、サーバーへの要求および/またはヒントを提供します。"
    },
    {
      "indent": 3,
      "text": "A request in a PMCE negotiation offer indicates constraints on the server's behavior that must be satisfied if the server accepts the offer. For example, suppose that a server sends data compressed with the DEFLATE algorithm to a client. The server must keep the original bytes of data that it recently compressed and sent to the client. The client must keep the result of decompressing the bytes of data that it recently received from the server. The amount of bytes of data kept is called the LZ77 window size. The LZ77 window size of the client must not be less than the LZ77 window size of the server. In a PMCE negotiation offer, the client MUST inform the server of its LZ77 window size so that the server uses an LZ77 window size that is not greater than the LZ77 window size of the client. This restriction on the LZ77 window size is an example of a request in a PMCE negotiation offer.",
      "ja": "PMCE交渉のオファーでの要求は、サーバーが提示を受け入れた場合に満たさなければならないサーバーの動作上の制約を示します。例えば、サーバはクライアントへのdeflateアルゴリズムで圧縮されたデータを送信したとします。サーバーは、それが最近、圧縮され、クライアントに送信されたデータの元のバイトを維持する必要があります。クライアントは、それが最近、サーバから受信したデータのバイト数を伸長した結果を保持する必要があります。保管データのバイトの量は、LZ77ウィンドウサイズと呼ばれています。クライアントのLZ77ウィンドウサイズは、サーバーのLZ77ウィンドウサイズ以上でなければなりません。サーバがクライアントのLZ77ウィンドウサイズよりも大きくないLZ77ウィンドウサイズを使用するようにPMCE交渉の申し出では、クライアントはそのLZ77ウィンドウサイズのサーバーに通知しなければなりません。 LZ77ウィンドウサイズにこの制限はPMCE交渉のオファーでの要求の例です。"
    },
    {
      "indent": 3,
      "text": "A hint in a PMCE negotiation offer provides information about the client's behavior that the server may either safely ignore or refer to when the server decides its behavior. For example, suppose that a client sends data compressed with the DEFLATE algorithm to a server. The client must keep the original bytes of data that it recently compressed and sent to the server. The server must keep the result of decompressing the bytes of data that it recently received from the client. The LZ77 window size of the server must not be less than the LZ77 window size of the client. In a PMCE negotiation offer, the client MAY inform the server of the maximum LZ77 window size the client can afford so that the server can choose to use an LZ77 window size that is not greater than the maximum size of the client. This information is an example of a hint in a PMCE negotiation offer. It's waste of memory to use an LZ77 window size greater than the LZ77 window size the client actually uses. Using the hint, the server can avoid the waste of memory. Since the hint itself doesn't specify the constraints on the endpoints, the server must use the \"agreed parameters\" (defined below) to explicitly ask the client not to use an LZ77 window size greater than the LZ77 window size of the server.",
      "ja": "PMCE交渉のオファーでのヒントは、サーバーがいずれかの安全に無視したり、サーバがその行動を決定する際に参照することがあり、クライアントの行動に関する情報を提供します。たとえば、クライアントがサーバへのdeflateアルゴリズムで圧縮されたデータを送信したとします。クライアントは、それが最近、圧縮され、サーバーに送信されたデータの元のバイトを維持する必要があります。サーバは、それが最近、クライアントから受信したデータのバイト数を伸長した結果を保持する必要があります。サーバーのLZ77ウィンドウサイズは、クライアントのLZ77ウィンドウサイズ以上でなければなりません。 PMCE交渉の申し出では、クライアントは、クライアントは、サーバがクライアントの最大サイズよりも大きくないLZ77ウィンドウサイズを使用することを選択できるように余裕が最大LZ77ウィンドウサイズのサーバーに通知することができます。この情報はPMCE交渉のオファーでのヒントの例です。これは、クライアントが実際に使用LZ77ウィンドウサイズよりも大きいLZ77ウィンドウサイズを使用するメモリの無駄です。ヒントを使用して、サーバはメモリの無駄を省くことができます。ヒント自体は、エンドポイント上の制約を指定していないので、サーバーは、明示的にサーバーのLZ77ウィンドウサイズよりも大きいLZ77ウィンドウサイズを使用していないクライアントを依頼する「合意されたパラメータ」（以下に定義）を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "To accept the use of an offered PMCE, a server MUST include the extension name of the PMCE in the \"Sec-WebSocket-Extensions\" header field of its opening handshake of the WebSocket connection. Extension parameters represent the detailed configuration parameters for the PMCE to use. These extension parameters and their values are called \"agreed parameters\". The element MUST represent a PMCE that is fully supported by the server. The contents of the element don't need to be exactly the same as those of the received extension negotiation offers. For example, suppose that a server received a PMCE extension negotiation offer with an extension parameter \"X\" indicating that the client can enable an optional feature named X. The server may accept the PMCE offer with an element without the extension parameter \"X\", meaning that the server chose not to enable the feature X. In this case, the offer contains the extension parameter \"X\", but the \"agreed parameters\" don't contain the extension parameter \"X\".",
      "ja": "提供PMCEの使用を受け入れるように、サーバは、WebSocketの接続のその開口ハンドシェークの「SEC-のWebSocket-拡張」ヘッダフィールドにPMCEの拡張子名を含まなければなりません。拡張パラメータは、使用するPMCEのための詳細な設定パラメータを表しています。これらの拡張パラメータとその値は「合意されたパラメータ」と呼ばれています。要素は完全にサーバによってサポートされてPMCEを表現しなければなりません。要素の内容は、受信延長交渉オファーのものとまったく同じである必要はありません。例えば、サーバはクライアントがサーバが拡張パラメータ「X」なし要素とPMCEの申し出を受け入れることX.という名前のオプション機能を有効にすることができたことを示す拡張パラメータ「X」とPMCE延長交渉の提案を受けたとし、サーバはこの場合、機能Xを有効にしないことを選択したことを意味し、オファーは拡張パラメータ「X」が含まれていますが、「合意されたパラメータは、」拡張パラメータ「X」が含まれていません。"
    },
    {
      "indent": 3,
      "text": "\"Agreed parameters\" must represent how the requests and hints in the client's extension negotiation offer have been handled in addition to the server's requests and hints on the client's behavior, so that the client can configure its behavior without identifying exactly which PMCE extension negotiation offer has been accepted.",
      "ja": "「合意されたパラメータは、」クライアントがPMCE延長交渉オファーが持っている正確に識別することなく、その動作を設定できるように、クライアントの延長交渉のオファーでの要求とヒントは、クライアントの行動上のサーバーの要求やヒントに加えて、処理された方法を表している必要があります受け入れられて。"
    },
    {
      "indent": 3,
      "text": "For example, if a client sends an extension negotiation offer that includes a parameter \"enable_compression\" and another without this parameter, the server accepts the former and informs the client by sending back an element that includes parameter(s) acknowledging \"enable_compression\". The name of the acknowledging parameter doesn't need to be exactly the same as the offer. For example, two parameters, \"enable_strong_compression\" and \"enable_weak_compression\", may be defined as acknowledging parameters for \"enable_compression\".",
      "ja": "クライアントは、このパラメータを指定しないパラメータ「enable_compression」と別のものを含んで延長交渉プランを送信した場合、サーバーは、前者を受け入れ、パラメータ（複数可）、「enable_compression」を認めるが含まれる要素を送り返すことにより、クライアントに通知します。認めパラメータの名前は、提供とまったく同じである必要はありません。例えば、2つのパラメータ「enable_strong_compression」および「enable_weak_compression」は、「enable_compression」のパラメータを認めるように定義することができます。"
    },
    {
      "indent": 3,
      "text": "Compression features can be applied differently for each direction. For such features, the acknowledging parameter and the parameter in the reverse direction must be chosen to distinguish them. For example, in order to make parameters distinguishable, a \"server_\" prefix can be added to parameters affecting data sent from a server, and a \"client_\" prefix can be added to parameters affecting data sent from a client.",
      "ja": "圧縮機能は、方向ごとに別々に適用することができます。このような特徴のために、逆方向に認めパラメータおよびパラメータは、それらを区別するために選択されなければなりません。たとえば、パラメータが区別できるようにするために、「SERVER_」プレフィックスは、サーバから送信されたデータに影響を与えるパラメータに追加することができ、そして「あるCLIENT_IDENTIFIER」プレフィックスは、クライアントから送信されたデータに影響を与えるパラメータに追加することができます。"
    },
    {
      "indent": 3,
      "text": "A server MUST NOT accept a PMCE extension negotiation offer together with another extension if the PMCE will conflict with the extension on their use of the RSV1 bit. A client that received a response accepting a PMCE extension negotiation offer together with such an extension MUST _Fail the WebSocket Connection_.",
      "ja": "PMCEはRSV1ビットのその使用上の拡張子と競合する場合、サーバーは、別の拡張と一緒にPMCE延長交渉の申し出を受け入れてはいけません。 WebSocketをConnection_を_Failしなければならないような拡張と一緒にPMCE延長交渉の申し出を受諾応答を受信したクライアント。"
    },
    {
      "indent": 3,
      "text": "A server MUST NOT accept a PMCE extension negotiation offer together with another extension if the PMCE will be applied to the output of the extension and any of the following conditions applies to the extension:",
      "ja": "：PMCEは延長の出力に適用され、次の条件のいずれかが拡張子に適用される場合、サーバーは、一緒に別の拡張子を持つPMCE延長交渉の申し出を受け入れてはいけません"
    },
    {
      "indent": 3,
      "text": "o The extension requires the boundary of frames to be preserved between the output from the extension at the sender and the input to the extension at the receiver.",
      "ja": "O拡張は、フレームの境界は、送信側の拡張からの出力と受信機における拡張への入力との間に保持することが必要です。"
    },
    {
      "indent": 3,
      "text": "o The extension uses the \"Extension data\" field or any of the reserved bits on the WebSocket header as a per-frame attribute.",
      "ja": "O拡張子は「拡張データ」フィールドまたはフレーム毎の属性としてのWebSocketヘッダに予約されたビットのいずれかを使用します。"
    },
    {
      "indent": 3,
      "text": "A client that receives a response accepting a PMCE extension negotiation offer together with such an extension MUST _Fail the WebSocket Connection_.",
      "ja": "一緒に、このような拡張子を持つPMCE延長交渉の申し出を受諾応答を受信したクライアントは、WebSocketをConnection_を_Failしなければなりません。"
    },
    {
      "indent": 3,
      "text": "A server declining all offered PMCEs MUST NOT include any element with PMCE names. If a server responds with no PMCE element in the \"Sec-WebSocket-Extensions\" header, both endpoints proceed without per-message compression once _the WebSocket Connection is established_.",
      "ja": "提供されるすべてのPMCEsを減少サーバがPMCE名を持つ任意の要素を含んではいけません。サーバは「SEC-のWebSocket-拡張」ヘッダでないPMCE要素で応答した場合_TheのWebSocket接続がestablished_されると、両方のエンドポイントは、メッセージごとの圧縮せずに進みます。"
    },
    {
      "indent": 3,
      "text": "If a server gives an invalid response, such as accepting a PMCE that the client did not offer, the client MUST _Fail the WebSocket Connection_.",
      "ja": "サーバーが無効な応答を与えた場合は、そのようなクライアントを提供しなかったことPMCEを受け入れるように、クライアントは、WebSocketをConnection_を_Failしなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a server responds with a valid PMCE element in the \"Sec-WebSocket-Extensions\" header and _the WebSocket Connection is established_, both endpoints MUST use the algorithm described in Section 6 and the message payload transformation (compressing and decompressing) procedure of the PMCE configured with the \"agreed parameters\" returned by the server to exchange messages.",
      "ja": "サーバがestablished_れる有効PMCEの「SEC-のWebSocket-拡張」の要素ヘッダと_TheのWebSocket接続で応答した場合、両方のエンドポイントはPMCEのセクション6で説明されたアルゴリズムとメッセージペイロード変換（圧縮および伸張）の手順を使用しなければなりませんメッセージを交換するために、サーバから返された「合意されたパラメータ」で構成。"
    },
    {
      "indent": 0,
      "text": "5.1. General Negotiation Flow",
      "section_title": true,
      "ja": "5.1。一般的な交渉の流れ"
    },
    {
      "indent": 3,
      "text": "This section describes a general negotiation flow. How to handle parameters in detail must be specified in the document specifying the PMCE.",
      "ja": "このセクションでは、一般的な交渉の流れを説明します。詳細なパラメータを処理する方法PMCEを指定する文書で指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "A client makes an offer including parameters identifying the following:",
      "ja": "クライアントは、次の識別パラメータを含む提案を行います。"
    },
    {
      "indent": 3,
      "text": "o Hints about how the client is planning to compress data",
      "ja": "Oクライアントがデータを圧縮することを計画しているかについてヒント"
    },
    {
      "indent": 3,
      "text": "o Requests about how the server compresses data",
      "ja": "サーバはデータを圧縮する方法についてO要求"
    },
    {
      "indent": 3,
      "text": "o Limitations concerning the client's compression functionality",
      "ja": "クライアントの圧縮機能に関する制限事項O"
    },
    {
      "indent": 3,
      "text": "The peer server makes a determination of its behavior based on these parameters. If the server can and wants to proceed with this PMCE enabled, the server responds to the client with parameters identifying the following:",
      "ja": "ピア・サーバーは、これらのパラメータに基づいて、その動作の判定を行います。サーバーのことが可能と有効このPMCEを続行したい場合は、サーバーは次の識別パラメータを使用してクライアントに応答します。"
    },
    {
      "indent": 3,
      "text": "o Requests about how the client compresses data",
      "ja": "クライアントはデータを圧縮する方法についてO要求"
    },
    {
      "indent": 3,
      "text": "o How the server will compress data",
      "ja": "Oサーバは、データをどのように圧縮します"
    },
    {
      "indent": 3,
      "text": "Based on these parameters received from the server, the client determines its behavior and if it can and wants to proceed with this PMCE enabled. Otherwise, the client starts the closing handshake with close code 1010.",
      "ja": "サーバから受信し、これらのパラメータに基づいて、クライアントがその行動を決定し、それができるならば、有効になって、このPMCEを進めたいと考えています。そうでない場合、クライアントは近いコード1010で終了ハンドシェイクを開始します。"
    },
    {
      "indent": 0,
      "text": "5.2. Negotiation Examples",
      "section_title": true,
      "ja": "5.2。交渉例"
    },
    {
      "indent": 3,
      "text": "The following are example values for the \"Sec-WebSocket-Extensions\" header offering PMCEs; permessage-foo and permessage-bar in the examples are hypothetical extension names of PMCEs for the compression algorithm foo and bar.",
      "ja": "「SEC-のWebSocket-拡張」ヘッダ提供PMCEsための例示的な値は以下の通りです。例のpermessage-fooとpermessageバー圧縮アルゴリズムfooとbarのためのPMCEsの仮想的な拡張子名です。"
    },
    {
      "indent": 3,
      "text": "o Offer the permessage-foo.",
      "ja": "O permessage-FOOを提供します。"
    },
    {
      "indent": 10,
      "text": "permessage-foo",
      "ja": "permessage-FOO"
    },
    {
      "indent": 3,
      "text": "o Offer the permessage-foo with a parameter x with a value of 10.",
      "ja": "O 10の値を持つパラメータxとpermessage-FOOを提供します。"
    },
    {
      "indent": 10,
      "text": "permessage-foo; x=10",
      "ja": "permessage-fooという。 X = 10"
    },
    {
      "indent": 6,
      "text": "The value may be quoted.",
      "ja": "値が引用されていてもよいです。"
    },
    {
      "indent": 10,
      "text": "permessage-foo; x=\"10\"",
      "ja": "permessage-fooという。 X = \"10\""
    },
    {
      "indent": 3,
      "text": "o Offer the permessage-foo as first choice and the permessage-bar as a fallback plan.",
      "ja": "O代替案として、最初の選択肢とpermessageバーとしてpermessage-FOOを提供します。"
    },
    {
      "indent": 10,
      "text": "permessage-foo, permessage-bar",
      "ja": "permessage-FOO、バーpermessage"
    },
    {
      "indent": 3,
      "text": "o Offer the permessage-foo with a parameter use_y, which enables a feature y as first choice, and the permessage-foo without the use_y parameter as a fallback plan.",
      "ja": "O代替案としてuse_yパラメータなしで最初の選択肢として、特徴量yを可能パラメータuse_y、およびpermessage-fooでpermessage-FOOを提供します。"
    },
    {
      "indent": 10,
      "text": "permessage-foo; use_y, permessage-foo",
      "ja": "perMessage-fooという。 use_y、perMessage-FOO"
    },
    {
      "indent": 0,
      "text": "6. Framing",
      "section_title": true,
      "ja": "6.フレーミング"
    },
    {
      "indent": 3,
      "text": "PMCEs operate only on data messages.",
      "ja": "PMCEsは、データメッセージにのみ動作します。"
    },
    {
      "indent": 3,
      "text": "This document allocates the RSV1 bit of the WebSocket header for PMCEs and calls the bit the \"Per-Message Compressed\" bit. On a WebSocket connection where a PMCE is in use, this bit indicates whether a message is compressed or not.",
      "ja": "この文書はPMCEsためのWebSocketヘッダのRSV1ビットを割り当て、「メッセージごとの圧縮」ビットのビットを呼び出します。 PMCEが使用されているのWebSocket接続で、このビットは、メッセージが圧縮されているか否かを示します。"
    },
    {
      "indent": 3,
      "text": "A message with the \"Per-Message Compressed\" bit set on the first fragment of the message is called a \"compressed message\". Frames of a compressed message have compressed data in the payload data portion. An endpoint receiving a compressed message decompresses the concatenation of the compressed data of the frames of the message by following the decompression procedure specified by the PMCE in use. The endpoint uses the bytes corresponding to the application data portion in this decompressed data for the _A WebSocket Message Has Been Received_ event instead of the received data as is.",
      "ja": "メッセージの最初のフラグメントに設定された「メッセージごとの圧縮」ビットを持つメッセージは、「圧縮されたメッセージ」と呼ばれます。圧縮されたメッセージのフレームは、ペイロードデータ部にデータを圧縮しています。圧縮されたメッセージを受信したエンドポイントは使用中PMCEによって指定された解凍手順に従ってメッセージのフレームの圧縮データの連結を解凍します。であるようにエンドポイントが_AのWebSocketメッセージは、この圧縮解除されたデータにアプリケーションデータ部に対応するバイトを使用する代わりに、受信したデータのReceived_イベントされています。"
    },
    {
      "indent": 3,
      "text": "A message with the \"Per-Message Compressed\" bit unset on the first fragment of the message is called an \"uncompressed message\". Frames of an uncompressed message have uncompressed original data as is in the payload data portion. An endpoint receiving an uncompressed message uses the concatenation of the application data portion of the frames of the message as is for the _A WebSocket Message Has Been Received_ event.",
      "ja": "メッセージの最初のフラグメントに解除「メッセージごとの圧縮」ビットを持つメッセージは、「圧縮されていないメッセージ」と呼ばれます。ペイロードデータ部分にあるように圧縮されていないメッセージのフレームは、元のデータを解凍しています。 Received_イベントされた_A用WebSocketメッセージのためのものであるように圧縮されていないメッセージを受信したエンドポイントは、メッセージのフレームのアプリケーションデータ部の連結を使用します。"
    },
    {
      "indent": 0,
      "text": "6.1. Compression",
      "section_title": true,
      "ja": "6.1。圧縮"
    },
    {
      "indent": 3,
      "text": "An endpoint MUST use the following algorithm to send a message in the form of a compressed message.",
      "ja": "エンドポイントは、圧縮されたメッセージの形式でメッセージを送信するために、以下のアルゴリズムを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "1. Compress the message payload of the original message by following the compression procedure of the PMCE. The original message may be input from the application layer or output of another WebSocket extension, depending on which extensions were negotiated.",
      "ja": "1 PMCEの圧縮手順に従うことにより、元のメッセージのメッセージのペイロードを圧縮します。元のメッセージは、拡張が交渉されたかに応じて、別のWebSocket拡張のアプリケーション層または出力から入力されてもよいです。"
    },
    {
      "indent": 3,
      "text": "2. Process the compressed data as follows:",
      "section_title": true,
      "ja": "2.プロセスは、圧縮されたデータを次のように"
    },
    {
      "indent": 7,
      "text": "*  If this PMCE is the last extension to process outgoing\n   messages, build frame(s) using the compressed data instead of\n   the original data for the message payload, set the \"Per-\n   Message Compressed\" bit of the first frame, and then send the\n   frame(s) as described in Section 6.1 of [RFC6455].",
      "raw": true
    },
    {
      "indent": 7,
      "text": "* Otherwise, pass the transformed message payload and modified header values, including the \"Per-Message Compressed\" bit value set to 1, to the next extension after the PMCE. If the extension expects frames for input, build a frame for the message and pass it.",
      "ja": "*そうでない場合、PMCE後の次の内線番号に、1に設定された「メッセージごとの圧縮」ビット値を含む変換されたメッセージのペイロードと変更されたヘッダー値を渡します。拡張は、入力用フレームを想定した場合、メッセージのフレームを構築し、それを渡します。"
    },
    {
      "indent": 3,
      "text": "An endpoint MUST use the following algorithm to send a message in the form of an uncompressed message.",
      "ja": "エンドポイントは、圧縮されていないメッセージの形式でメッセージを送信するために、以下のアルゴリズムを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "1. Process the original data as follows:",
      "section_title": true,
      "ja": "1.プロセスは、元のデータを次のように"
    },
    {
      "indent": 7,
      "text": "*  If this PMCE is the last extension to process outgoing\n   messages, build frame(s) using the original data for the\n   payload data portion as is, unset the \"Per-Message Compressed\"\n   bit of the first frame, and then send the frame(s) as\n   described in Section 6.1 of [RFC6455].",
      "raw": true
    },
    {
      "indent": 7,
      "text": "* Otherwise, pass the message payload and header values to the next extension after the PMCE as is. If the extension expects frames for input, build a frame for the message and pass it.",
      "ja": "*そうでない場合は、そのままPMCE後、次の内線番号にメッセージ・ペイロードとヘッダ値を渡します。拡張は、入力用フレームを想定した場合、メッセージのフレームを構築し、それを渡します。"
    },
    {
      "indent": 3,
      "text": "An endpoint MUST NOT set the \"Per-Message Compressed\" bit of control frames and non-first fragments of a data message. An endpoint receiving such a frame MUST _Fail the WebSocket Connection_.",
      "ja": "エンドポイントは、制御フレームとデータメッセージの非最初の断片の「メッセージごとの圧縮」ビットを設定してはいけません。そのようなフレームを受信したエンドポイントのWebSocket Connection_を_Failしなければなりません。"
    },
    {
      "indent": 3,
      "text": "PMCEs do not change the opcode field. The opcode of the first frame of a compressed message indicates the opcode of the original message.",
      "ja": "PMCEsは、オペコードフィールドを変更しないでください。圧縮されたメッセージの最初のフレームのオペコードは、元のメッセージのオペコードを示しています。"
    },
    {
      "indent": 3,
      "text": "The payload data portion in frames generated by a PMCE is not subject to the constraints for the original data type. For example, the concatenation of the output data corresponding to the application data portion of frames of a compressed text message is not required to be valid UTF-8. At the receiver, the payload data portion after decompression is subject to the constraints for the original data type again.",
      "ja": "PMCEによって生成されたフレーム内のペイロードデータ部分は、元のデータ・タイプの制約を受けません。例えば、圧縮されたテキストメッセージのフレームのアプリケーションデータ部に対応する出力データの連結は、有効なUTF-8である必要はありません。受信機で、減圧後のペイロードデータ部分は再び元のデータ・タイプの制約を受けます。"
    },
    {
      "indent": 0,
      "text": "6.2. Decompression",
      "section_title": true,
      "ja": "6.2。減圧"
    },
    {
      "indent": 3,
      "text": "An endpoint MUST use the following algorithm to receive a message in the form of a compressed message.",
      "ja": "エンドポイントは、圧縮されたメッセージの形式でメッセージを受信するために、以下のアルゴリズムを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "1. Concatenate the payload data portion of the received frames of the compressed message. The received frames may be direct input from the underlying transport or output of another WebSocket extension, depending on which extensions were negotiated.",
      "ja": "1.圧縮されたメッセージの受信フレームのペイロードデータ部を連結。受信されたフレームは、拡張が交渉されたかに応じて、別のWebSocket拡張の基礎となるトランスポートまたは出力から直接入力されてもよいです。"
    },
    {
      "indent": 3,
      "text": "2. Decompress the concatenation by following the decompression procedure of the PMCE.",
      "ja": "2. PMCEの解凍手順に従って連結を解凍。"
    },
    {
      "indent": 3,
      "text": "3. Process the decompressed message as follows:",
      "section_title": true,
      "ja": "3.プロセス解凍メッセージを次のように"
    },
    {
      "indent": 7,
      "text": "*  If this is the last extension to process incoming messages,\n   deliver the _A WebSocket Message Has Been Received_ event to\n   the application layer with the decompressed message payload\n   and header values, including the \"Per-Message Compressed\" bit\n   unset to 0.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "* Otherwise, pass the decompressed message payload and header values, including the \"Per-Message Compressed\" bit unset to 0, to the extension preceding the PMCE. If the extension expects frames for input, build a frame for the message and pass it.",
      "ja": "*そうでない場合、PMCEの前拡張に、0に設定解除「メッセージごとの圧縮」ビットを含む、解凍メッセージ・ペイロードとヘッダ値を渡します。拡張は、入力用フレームを想定した場合、メッセージのフレームを構築し、それを渡します。"
    },
    {
      "indent": 3,
      "text": "An endpoint MUST use the following algorithm to receive a message in the form of an uncompressed message.",
      "ja": "エンドポイントは、圧縮されていないメッセージの形式でメッセージを受信するために、以下のアルゴリズムを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "1. Process the received message as follows:",
      "section_title": true,
      "ja": "1.プロセスの受信メッセージを次のように"
    },
    {
      "indent": 7,
      "text": "*  If this PMCE is the last extension to process incoming\n   messages, deliver the _A WebSocket Message Has Been Received_\n   event to the application layer with the received message\n   payload and header values as is.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "* Otherwise, pass the message payload and header values to the extension preceding the PMCE as is. If the extension expects frames for input, build a frame for the message and pass it.",
      "ja": "*そうでない場合は、そのままPMCEの前拡張にメッセージ・ペイロードとヘッダ値を渡します。拡張は、入力用フレームを想定した場合、メッセージのフレームを構築し、それを渡します。"
    },
    {
      "indent": 0,
      "text": "7. The \"permessage-deflate\" Extension",
      "section_title": true,
      "ja": "7.「permessage-デフレート」拡張"
    },
    {
      "indent": 3,
      "text": "This section defines a specific PMCE called \"permessage-deflate\". It compresses the payload of a message using the DEFLATE algorithm [RFC1951] and uses the byte boundary alignment method introduced in [RFC1979].",
      "ja": "このセクションでは、「permessage-デフレート」と呼ばれる特定のPMCEを定義します。これは、DEFLATEアルゴリズム[RFC1951]を使用して、メッセージのペイロードを圧縮し、[RFC1979]に導入バイト境界アライメント方法を使用します。"
    },
    {
      "indent": 3,
      "text": "This section uses the term \"byte\" with the same meaning as used in [RFC1951], i.e., 8 bits stored or transmitted as a unit (same as an octet).",
      "ja": "このセクションでは、[RFC1951]で用いたのと同じ意味を持つ用語「バイト」を使用し、すなわち、8ビットで格納されるか、または（オクテットと同じ）単位として送信されます。"
    },
    {
      "indent": 3,
      "text": "The registered extension name for this extension is \"permessage-deflate\".",
      "ja": "この拡張のために登録された拡張子名は「permessage-デフレート」です。"
    },
    {
      "indent": 3,
      "text": "Four extension parameters are defined for \"permessage-deflate\" to help endpoints manage per-connection resource usage.",
      "ja": "四つの拡張パラメータは、エンドポイントは、接続ごとのリソース使用量の管理を支援するために、「permessage-デフレート」のために定義されています。"
    },
    {
      "indent": 3,
      "text": "o \"server_no_context_takeover\"",
      "ja": "O \"server_no_context_takeover\""
    },
    {
      "indent": 3,
      "text": "o \"client_no_context_takeover\"",
      "ja": "O \"client_no_context_takeover\""
    },
    {
      "indent": 3,
      "text": "o \"server_max_window_bits\"",
      "ja": "O \"server_max_window_bits\""
    },
    {
      "indent": 3,
      "text": "o \"client_max_window_bits\"",
      "ja": "O \"client_max_window_bits\""
    },
    {
      "indent": 3,
      "text": "These parameters enable two methods (no_context_takeover and max_window_bits) of constraining memory usage that may be applied independently to either direction of WebSocket traffic. The extension parameters with the \"client_\" prefix are used by the client to configure its compressor and by the server to configure its decompressor. The extension parameters with the \"server_\" prefix are used by the server to configure its compressor and by the client to configure its decompressor. All four parameters are defined for both a client's extension negotiation offer and a server's extension negotiation response.",
      "ja": "これらのパラメータは、WebSocketのトラフィックのいずれかの方向に独立して適用することができる拘束メモリ使用の二つの方法（no_context_takeoverとmax_window_bits）を可能にします。 「あるCLIENT_IDENTIFIER」接頭辞を持つ拡張パラメータは、その伸長器を構成するためのコンプレッサーを設定し、サーバーによってためにクライアントによって使用されています。 「SERVER_」接頭辞を持つ拡張パラメータは、その伸長器を構成するためのコンプレッサーを設定し、クライアントがためにサーバによって使用されています。すべての4つのパラメータは、クライアントの延長交渉提供し、サーバーの拡張ネゴシエーション応答の両方のために定義されています。"
    },
    {
      "indent": 3,
      "text": "A server MUST decline an extension negotiation offer for this extension if any of the following conditions are met:",
      "ja": "次のいずれかの条件が満たされている場合、サーバーは、この拡張機能のために延長交渉の申し出を辞退しなければなりません："
    },
    {
      "indent": 3,
      "text": "o The negotiation offer contains an extension parameter not defined for use in an offer.",
      "ja": "oを交渉オファーが提供で使用するために定義されていない拡張パラメータが含まれています。"
    },
    {
      "indent": 3,
      "text": "o The negotiation offer contains an extension parameter with an invalid value.",
      "ja": "O交渉オファーが無効な値を持つ拡張パラメータが含まれています。"
    },
    {
      "indent": 3,
      "text": "o The negotiation offer contains multiple extension parameters with the same name.",
      "ja": "O交渉オファーが同じ名前の複数の拡張パラメータが含まれています。"
    },
    {
      "indent": 3,
      "text": "o The server doesn't support the offered configuration.",
      "ja": "Oサーバは、提示された設定をサポートしていません。"
    },
    {
      "indent": 3,
      "text": "A client MUST _Fail the WebSocket Connection_ if the peer server accepted an extension negotiation offer for this extension with an extension negotiation response meeting any of the following conditions: o The negotiation response contains an extension parameter not defined for use in a response.",
      "ja": "交渉応答は応答で使用するために定義されていない拡張パラメータが含まれている○：ピアサーバーが延長交渉応答会議で以下の条件のいずれかをこの拡張のための拡張折衝の申し出を受け入れた場合、クライアントは、WebSocketをConnection_を_Failしなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The negotiation response contains an extension parameter with an invalid value.",
      "ja": "Oネゴシエーション応答は、無効な値を持つ拡張パラメータが含まれています。"
    },
    {
      "indent": 3,
      "text": "o The negotiation response contains multiple extension parameters with the same name.",
      "ja": "Oネゴシエーション応答は、同じ名前を持つ複数の拡張パラメータが含まれています。"
    },
    {
      "indent": 3,
      "text": "o The client does not support the configuration that the response represents.",
      "ja": "Oクライアントは、応答が表す構成をサポートしていません。"
    },
    {
      "indent": 3,
      "text": "The term \"LZ77 sliding window\" [LZ77] used in this section means the buffer used by the DEFLATE algorithm to store recently processed input. The DEFLATE compression algorithm searches the buffer for a match with the following input.",
      "ja": "このセクションで使用される用語「LZ77スライディングウィンドウ」[LZ77]は最近処理された入力を格納するDEFLATEアルゴリズムによって使用されるバッファーを意味します。 DEFLATE圧縮アルゴリズムは、以下の入力との一致のためのバッファを検索します。"
    },
    {
      "indent": 3,
      "text": "The term \"use context takeover\" used in this section means that the same LZ77 sliding window used by the endpoint to build frames of the previous sent message is reused to build frames of the next message to be sent.",
      "ja": "このセクションで使用される用語「使用コンテキスト引き継ぎ」が以前送信されたメッセージのフレームを構築するために、エンドポイントによって使用される同じLZ77スライディングウィンドウが送信される次のメッセージのフレームを構築するために再利用されることを意味します。"
    },
    {
      "indent": 0,
      "text": "7.1. Extension Parameters",
      "section_title": true,
      "ja": "7.1。拡張パラメータ"
    },
    {
      "indent": 0,
      "text": "7.1.1. Context Takeover Control",
      "section_title": true,
      "ja": "7.1.1。コンテキスト買収コントロール"
    },
    {
      "indent": 0,
      "text": "7.1.1.1. The \"server_no_context_takeover\" Extension Parameter",
      "section_title": true,
      "ja": "7.1.1.1。 「server_no_context_takeover」拡張パラメータ"
    },
    {
      "indent": 3,
      "text": "A client MAY include the \"server_no_context_takeover\" extension parameter in an extension negotiation offer. This extension parameter has no value. By including this extension parameter in an extension negotiation offer, a client prevents the peer server from using context takeover. If the peer server doesn't use context takeover, the client doesn't need to reserve memory to retain the LZ77 sliding window between messages.",
      "ja": "クライアントは、延長交渉の申し出に「server_no_context_takeover」拡張パラメータを含むかもしれません。この拡張パラメータには値がありません。延長交渉の申し出で、この拡張パラメータを含めることで、クライアントは、コンテキストの買収を使用してから、ピアサーバーを防ぎます。ピアサーバーがコンテキストの引き継ぎを使用しない場合、クライアントは、メッセージ間LZ77スライディングウィンドウを保持するメモリを予約する必要はありません。"
    },
    {
      "indent": 3,
      "text": "Absence of this extension parameter in an extension negotiation offer indicates that the client can decompress a message that the server built using context takeover.",
      "ja": "延長交渉の申し出で、この拡張パラメータの不在は、クライアントがサーバーがコンテキストの引き継ぎを使用して構築されたメッセージを復元することができることを示しています。"
    },
    {
      "indent": 3,
      "text": "A server accepts an extension negotiation offer that includes the \"server_no_context_takeover\" extension parameter by including the \"server_no_context_takeover\" extension parameter in the corresponding extension negotiation response to send back to the client. The \"server_no_context_takeover\" extension parameter in an extension negotiation response has no value.",
      "ja": "サーバーは、クライアントに送信するには、対応する延長交渉応答で「server_no_context_takeover」拡張パラメータを含むことにより、「server_no_context_takeover」拡張パラメータを含んで延長交渉の申し出を受け入れます。延長交渉応答で「server_no_context_takeover」拡張パラメータには値がありません。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that a server supports the \"server_no_context_takeover\" extension parameter in an extension negotiation offer.",
      "ja": "サーバーが延長交渉の申し出に「server_no_context_takeover」拡張パラメータをサポートすることを推奨します。"
    },
    {
      "indent": 3,
      "text": "A server MAY include the \"server_no_context_takeover\" extension parameter in an extension negotiation response even if the extension negotiation offer being accepted by the extension negotiation response didn't include the \"server_no_context_takeover\" extension parameter.",
      "ja": "サーバーは、拡張交渉応答で受け入れられて延長交渉のオファーは「server_no_context_takeover」拡張パラメータが含まれていない場合でも、延長交渉応答で「server_no_context_takeover」拡張パラメータを含むかもしれません。"
    },
    {
      "indent": 0,
      "text": "7.1.1.2. The \"client_no_context_takeover\" Extension Parameter",
      "section_title": true,
      "ja": "7.1.1.2。 「client_no_context_takeover」拡張パラメータ"
    },
    {
      "indent": 3,
      "text": "A client MAY include the \"client_no_context_takeover\" extension parameter in an extension negotiation offer. This extension parameter has no value. By including this extension parameter in an extension negotiation offer, a client informs the peer server of a hint that even if the server doesn't include the \"client_no_context_takeover\" extension parameter in the corresponding extension negotiation response to the offer, the client is not going to use context takeover.",
      "ja": "クライアントは、延長交渉の申し出に「client_no_context_takeover」拡張パラメータを含むかもしれません。この拡張パラメータには値がありません。延長交渉の申し出で、この拡張パラメータを含めることで、クライアントは、クライアントが予定されていないサーバーが提供する、対応する延長交渉応答で「client_no_context_takeover」拡張パラメータが含まれていない場合でも、ヒントのピア・サーバーに通知しますコンテキストの買収を使用します。"
    },
    {
      "indent": 3,
      "text": "A server MAY include the \"client_no_context_takeover\" extension parameter in an extension negotiation response. If the received extension negotiation offer includes the \"client_no_context_takeover\" extension parameter, the server may either ignore the parameter or use the parameter to avoid taking over the LZ77 sliding window unnecessarily by including the \"client_no_context_takeover\" extension parameter in the corresponding extension negotiation response to the offer. The \"client_no_context_takeover\" extension parameter in an extension negotiation response has no value. By including the \"client_no_context_takeover\" extension parameter in an extension negotiation response, a server prevents the peer client from using context takeover. This reduces the amount of memory that the server has to reserve for the connection.",
      "ja": "サーバーは、拡張折衝応答で「client_no_context_takeover」拡張パラメータを含むかもしれません。受信延長交渉オファーは「client_no_context_takeover」拡張パラメータが含まれている場合、サーバはパラメータを無視するか、に対応する延長交渉応答で「client_no_context_takeover」拡張パラメータを含むことにより、不必要にウィンドウをスライディングLZ77を引き継ぐ避けるために、パラメータを使用してのいずれか提供。延長交渉応答で「client_no_context_takeover」拡張パラメータには値がありません。延長交渉応答で「client_no_context_takeover」拡張パラメータを含めることで、サーバーは、コンテキストの引き継ぎを使用してからピアクライアントを防ぎます。これは、サーバーが接続のために予約しているメモリの量を減少させます。"
    },
    {
      "indent": 3,
      "text": "Absence of this extension parameter in an extension negotiation response indicates that the server can decompress messages built by the client using context takeover.",
      "ja": "延長交渉応答で、この拡張パラメータの不在は、サーバーがコンテキストの買収を使用して、クライアントによって構築されたメッセージを復元することができることを示しています。"
    },
    {
      "indent": 3,
      "text": "A client MUST support the \"client_no_context_takeover\" extension parameter in an extension negotiation response.",
      "ja": "クライアントは、延長交渉応答で「client_no_context_takeover」拡張パラメータをサポートしなければなりません。"
    },
    {
      "indent": 0,
      "text": "7.1.2. Limiting the LZ77 Sliding Window Size",
      "section_title": true,
      "ja": "7.1.2。 LZ77スライディングウィンドウサイズを制限します"
    },
    {
      "indent": 0,
      "text": "7.1.2.1. The \"server_max_window_bits\" Extension Parameter",
      "section_title": true,
      "ja": "7.1.2.1。 「server_max_window_bits」拡張パラメータ"
    },
    {
      "indent": 3,
      "text": "A client MAY include the \"server_max_window_bits\" extension parameter in an extension negotiation offer. This parameter has a decimal integer value without leading zeroes between 8 to 15, inclusive, indicating the base-2 logarithm of the LZ77 sliding window size, and MUST conform to the ABNF below.",
      "ja": "クライアントは、延長交渉の申し出に「server_max_window_bits」拡張パラメータを含むかもしれません。このパラメータは、LZ77スライディングウィンドウサイズの2を底とする対数を示し、包括8〜15の間の先行ゼロなしの10進数の整数値を有し、そして以下ABNFに従わなければなりません。"
    },
    {
      "indent": 7,
      "text": "server-max-window-bits = 1*DIGIT",
      "ja": "サーバー-MAX-ウィンドウ-ビット= 1 * DIGIT"
    },
    {
      "indent": 3,
      "text": "By including this parameter in an extension negotiation offer, a client limits the LZ77 sliding window size that the server will use to compress messages. If the peer server uses a small LZ77 sliding window to compress messages, the client can reduce the memory needed for the LZ77 sliding window.",
      "ja": "延長交渉の申し出に、このパラメータを含めることで、クライアントは、サーバがメッセージを圧縮するために使用するLZ77スライディングウィンドウのサイズを制限します。ピア・サーバーがメッセージを圧縮する小さなLZ77スライディングウィンドウを使用している場合、クライアントはLZ77スライディングウィンドウに必要なメモリを減らすことができます。"
    },
    {
      "indent": 3,
      "text": "A server declines an extension negotiation offer with this parameter if the server doesn't support it.",
      "ja": "サーバがそれをサポートしていない場合、サーバーは、このパラメータを使用して延長交渉の申し出を辞退します。"
    },
    {
      "indent": 3,
      "text": "Absence of this parameter in an extension negotiation offer indicates that the client can receive messages compressed using an LZ77 sliding window of up to 32,768 bytes.",
      "ja": "延長交渉の申し出で、このパラメータの不在は、クライアントが、最大32,768バイトのLZ77スライディングウィンドウを使用して圧縮されたメッセージを受け取ることができることを示しています。"
    },
    {
      "indent": 3,
      "text": "A server accepts an extension negotiation offer with this parameter by including the \"server_max_window_bits\" extension parameter in the extension negotiation response to send back to the client with the same or smaller value as the offer. The \"server_max_window_bits\" extension parameter in an extension negotiation response has a decimal integer value without leading zeroes between 8 to 15, inclusive, indicating the base-2 logarithm of the LZ77 sliding window size, and MUST conform to the ABNF below.",
      "ja": "サーバはオファーと同じか、値を小さくして、クライアントに送信するために延長交渉応答で「server_max_window_bits」拡張パラメータを含むことにより、このパラメータを使用して延長交渉の申し出を受け入れます。拡張ネゴシエーション応答における「server_max_window_bits」拡張パラメータは、LZ77スライディングウィンドウサイズの2を底とする対数を示し、包括8〜15の間の先行ゼロなしの10進数の整数値を有し、そして以下ABNFに従わなければなりません。"
    },
    {
      "indent": 7,
      "text": "server-max-window-bits = 1*DIGIT",
      "ja": "サーバー-MAX-ウィンドウ-ビット= 1 * DIGIT"
    },
    {
      "indent": 3,
      "text": "A server MAY include the \"server_max_window_bits\" extension parameter in an extension negotiation response even if the extension negotiation offer being accepted by the response didn't include the \"server_max_window_bits\" extension parameter.",
      "ja": "サーバが応答で受け入れられて延長交渉のオファーは「server_max_window_bits」拡張パラメータが含まれていない場合でも、延長交渉応答で「server_max_window_bits」拡張パラメータを含むかもしれません。"
    },
    {
      "indent": 0,
      "text": "7.1.2.2. The \"client_max_window_bits\" Extension Parameter",
      "section_title": true,
      "ja": "7.1.2.2。 「client_max_window_bits」拡張パラメータ"
    },
    {
      "indent": 3,
      "text": "A client MAY include the \"client_max_window_bits\" extension parameter in an extension negotiation offer. This parameter has no value or a decimal integer value without leading zeroes between 8 to 15 inclusive indicating the base-2 logarithm of the LZ77 sliding window size. If a value is specified for this parameter, the value MUST conform to the ABNF below.",
      "ja": "クライアントは、延長交渉の申し出に「client_max_window_bits」拡張パラメータを含むかもしれません。このパラメータは値またはLZ77スライディングウィンドウサイズの2を底とする対数を表す8~15までの間の先行ゼロなしの10進数の整数値を有していません。このパラメータに値が指定されている場合は、値は以下のABNFに従わなければなりません。"
    },
    {
      "indent": 7,
      "text": "client-max-window-bits = 1*DIGIT",
      "ja": "クライアント-MAX-ウィンドウ-ビット= 1 * DIGIT"
    },
    {
      "indent": 3,
      "text": "By including this parameter in an offer, a client informs the peer server that the client supports the \"client_max_window_bits\" extension parameter in an extension negotiation response and, optionally, a hint by attaching a value to the parameter. If the \"client_max_window_bits\" extension parameter in an extension negotiation offer has a value, the parameter also informs the peer server of a hint that even if the server doesn't include the \"client_max_window_bits\" extension parameter in the corresponding extension negotiation response with a value greater than the one in the extension negotiation offer or if the server doesn't include the extension parameter at all, the client is not going to use an LZ77 sliding window size greater than the size specified by the value in the extension negotiation offer to compress messages.",
      "ja": "プランでは、このパラメータを含めることで、クライアントは、クライアントがパラメータに値を付加することにより、必要に応じて、ヒントを延長交渉応答で「client_max_window_bits」拡張パラメータをサポートし、ピア・サーバーに通知します。延長交渉のオファーで「client_max_window_bits」拡張パラメータの値を持っている場合、パラメータは、サーバーが値を持つ、対応する延長交渉応答で「client_max_window_bits」拡張パラメータが含まれていない場合でも、ヒントのピア・サーバーに通知します延長交渉のオファーの1以上のサーバが全く拡張パラメータが含まれていない場合、クライアントは圧縮に延長交渉の申し出の値で指定したサイズよりも大きいウィンドウサイズをスライドLZ77を使用するつもりはありませんメッセージ。"
    },
    {
      "indent": 3,
      "text": "If a received extension negotiation offer has the \"client_max_window_bits\" extension parameter, the server MAY include the \"client_max_window_bits\" extension parameter in the corresponding extension negotiation response to the offer. If the \"client_max_window_bits\" extension parameter in a received extension negotiation offer has a value, the server may either ignore this value or use this value to avoid allocating an unnecessarily big LZ77 sliding window by including the \"client_max_window_bits\" extension parameter in the corresponding extension negotiation response to the offer with a value equal to or smaller than the received value. The \"client_max_window_bits\" extension parameter in an extension negotiation response has a decimal integer value without leading zeroes between 8 to 15 inclusive indicating the base-2 logarithm of the LZ77 sliding window size and MUST conform to the ABNF below.",
      "ja": "受信延長交渉オファーは「client_max_window_bits」拡張パラメータを持っている場合は、サーバが提供する、対応する延長交渉応答で「client_max_window_bits」拡張パラメータを含むかもしれません。受信延長交渉のオファーで「client_max_window_bits」拡張パラメータの値を持っている場合、サーバはこの値を無視するか、対応する延長交渉で「client_max_window_bits」拡張パラメータを含めることで、ウィンドウをスライディング、不必要に大きなLZ77を割り当てる避けるために、この値を使用することのいずれか受信された値以下の値を持つオファーに対する応答。拡張ネゴシエーション応答における「client_max_window_bits」拡張パラメータは、LZ77スライディングウィンドウサイズの2を底とする対数を表す8~15までの間の先行ゼロなしの10進数の整数値を有し、そして以下ABNFに従わなければなりません。"
    },
    {
      "indent": 7,
      "text": "client-max-window-bits = 1*DIGIT",
      "ja": "クライアント-MAX-ウィンドウ-ビット= 1 * DIGIT"
    },
    {
      "indent": 3,
      "text": "By including this extension parameter in an extension negotiation response, a server limits the LZ77 sliding window size that the client uses to compress messages. This reduces the amount of memory for the decompression context that the server has to reserve for the connection.",
      "ja": "延長交渉応答して、この拡張パラメータを含めることにより、サーバは、クライアントがメッセージを圧縮するために使用するLZ77スライディングウィンドウのサイズを制限します。これは、サーバーが接続のために予約してい解凍コンテキスト用のメモリの量を減少させます。"
    },
    {
      "indent": 3,
      "text": "If a received extension negotiation offer doesn't have the \"client_max_window_bits\" extension parameter, the corresponding extension negotiation response to the offer MUST NOT include the \"client_max_window_bits\" extension parameter.",
      "ja": "受信延長交渉オファーは「client_max_window_bits」拡張パラメータを持っていない場合は、プランに対応する延長交渉応答は「client_max_window_bits」拡張パラメータを含んではいけません。"
    },
    {
      "indent": 3,
      "text": "Absence of this extension parameter in an extension negotiation response indicates that the server can receive messages compressed using an LZ77 sliding window of up to 32,768 bytes.",
      "ja": "延長交渉応答で、この拡張パラメータの不在は、サーバーは、最大32,768バイトのLZ77スライディングウィンドウを使用して圧縮されたメッセージを受け取ることができることを示しています。"
    },
    {
      "indent": 0,
      "text": "7.1.3. Examples",
      "section_title": true,
      "ja": "7.1.3。例"
    },
    {
      "indent": 3,
      "text": "The simplest \"Sec-WebSocket-Extensions\" header in a client's opening handshake to offer use of the \"permessage-deflate\" extension looks like this:",
      "ja": "「permessage-デフレート」拡張子の使用を提供するために、クライアントのオープニングハンドシェイクで最も簡単な「SEC-のWebSocket-拡張機能」ヘッダは次のようになります。"
    },
    {
      "indent": 7,
      "text": "Sec-WebSocket-Extensions: permessage-deflate",
      "ja": "SEC-のWebSocket-拡張機能：permessage-デフレート"
    },
    {
      "indent": 3,
      "text": "Since the \"client_max_window_bits\" extension parameter is not included in this extension negotiation offer, the server must not accept the offer with an extension negotiation response that includes the \"client_max_window_bits\" extension parameter. The simplest \"Sec-WebSocket-Extensions\" header in a server's opening handshake to accept use of the \"permessage-deflate\" extension is the same:",
      "ja": "「client_max_window_bits」拡張パラメータは、この拡張交渉プランに含まれていないので、サーバは「client_max_window_bits」拡張パラメータを含んで延長交渉応答で申し出を受け入れるいけません。 「permessage-デフレート」拡張子の使用を受け入れるために、サーバのオープニングハンドシェイクで最も簡単な「SEC-のWebSocket-拡張機能」ヘッダは同じです。"
    },
    {
      "indent": 7,
      "text": "Sec-WebSocket-Extensions: permessage-deflate",
      "ja": "SEC-のWebSocket-拡張機能：permessage-デフレート"
    },
    {
      "indent": 3,
      "text": "The following extension negotiation offer sent by a client is asking the server to use an LZ77 sliding window with a size of 1,024 bytes or less and declaring that the client supports the \"client_max_window_bits\" extension parameter in an extension negotiation response.",
      "ja": "クライアントから送信された以下の拡張折衝のオファーは1024バイト以下のサイズでLZ77スライディングウィンドウを使用するようにサーバーを尋ねると、クライアントは延長交渉応答で「client_max_window_bits」拡張パラメータをサポートすることを宣言しています。"
    },
    {
      "indent": 7,
      "text": "Sec-WebSocket-Extensions:\n    permessage-deflate;\n    client_max_window_bits; server_max_window_bits=10",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This extension negotiation offer might be rejected by the server because the server doesn't support the \"server_max_window_bits\" extension parameter in an extension negotiation offer. This is fine if the client cannot receive messages compressed using a larger sliding window size, but if the client just prefers using a small window but wants to fall back to the \"permessage-deflate\" without the \"server_max_window_bits\" extension parameter, the client can make an offer with the fallback option like this:",
      "ja": "サーバが延長交渉の申し出に「server_max_window_bits」拡張パラメータをサポートしていないので、この延長交渉オファーがサーバーによって拒否されることがあります。クライアントは、より大きなスライディングウィンドウサイズを使用して圧縮されたメッセージを受信できない場合、これは罰金ですが、クライアントは単に「server_max_window_bits」拡張パラメータなしで小さなウィンドウを使用して好むが、バック「permessage-デフレート」にフォールさせたい場合は、クライアントができますこのような代替オプションを提供します"
    },
    {
      "indent": 7,
      "text": "Sec-WebSocket-Extensions:\n    permessage-deflate;\n    client_max_window_bits; server_max_window_bits=10,\n    permessage-deflate;\n    client_max_window_bits",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The server can accept \"permessage-deflate\" by picking any supported one from the listed offers. To accept the first option, for example, the server may send back a response as follows:",
      "ja": "サーバがリストされている申し出からサポートされている任意のものを選択することにより、「permessage-デフレート」を受け入れることができます。次のように最初のオプションを受け入れるには、例えば、サーバが応答を送り返すことがあります。"
    },
    {
      "indent": 7,
      "text": "Sec-WebSocket-Extensions:\n    permessage-deflate; server_max_window_bits=10",
      "raw": true
    },
    {
      "indent": 3,
      "text": "To accept the second option, for example, the server may send back a response as follows:",
      "ja": "次のように2番目のオプションを受け入れるには、例えば、サーバが応答を送り返すことがあります。"
    },
    {
      "indent": 7,
      "text": "Sec-WebSocket-Extensions: permessage-deflate",
      "ja": "SEC-のWebSocket-拡張機能：permessage-デフレート"
    },
    {
      "indent": 0,
      "text": "7.2. Message Payload Transformation",
      "section_title": true,
      "ja": "7.2。メッセージペイロード変換"
    },
    {
      "indent": 0,
      "text": "7.2.1. Compression",
      "section_title": true,
      "ja": "7.2.1。圧縮"
    },
    {
      "indent": 3,
      "text": "An endpoint uses the following algorithm to compress a message.",
      "ja": "エンドポイントは、メッセージを圧縮するには、次のアルゴリズムを使用しています。"
    },
    {
      "indent": 3,
      "text": "1. Compress all the octets of the payload of the message using DEFLATE.",
      "ja": "1. DEFLATEを使用して、メッセージのペイロードの全てのオクテットを圧縮します。"
    },
    {
      "indent": 3,
      "text": "2. If the resulting data does not end with an empty DEFLATE block with no compression (the \"BTYPE\" bits are set to 00), append an empty DEFLATE block with no compression to the tail end.",
      "ja": "2.得られたデータは、圧縮なしで空DEFLATEブロックで終わっていない場合（「BTYPE」ビットが00に設定されている）、最後尾に圧縮なしで空DEFLATEブロックを追加します。"
    },
    {
      "indent": 3,
      "text": "3. Remove 4 octets (that are 0x00 0x00 0xff 0xff) from the tail end. After this step, the last octet of the compressed data contains (possibly part of) the DEFLATE header bits with the \"BTYPE\" bits set to 00.",
      "ja": "3.最後尾から（0x00から0x00から0xFFの0xFFである）4つのオクテットを削除。このステップの後、圧縮されたデータの最後のオクテットが00に設定された「BTYPE」ビットを有するDEFLATEヘッダビット（の可能性の一部）を含みます。"
    },
    {
      "indent": 3,
      "text": "When using DEFLATE in the first step above:",
      "ja": "上記第一工程でDEFLATEを使用する場合："
    },
    {
      "indent": 3,
      "text": "o An endpoint MAY use multiple DEFLATE blocks to compress one message.",
      "ja": "Oエンドポイントは、一つのメッセージを圧縮するために、複数のDEFLATEブロックを使用するかもしれません。"
    },
    {
      "indent": 3,
      "text": "o An endpoint MAY use DEFLATE blocks of any type.",
      "ja": "Oエンドポイントは、あらゆるタイプのDEFLATEブロックを使用するかもしれません。"
    },
    {
      "indent": 3,
      "text": "o An endpoint MAY use both DEFLATE blocks with the \"BFINAL\" bit set to 0 and DEFLATE blocks with the \"BFINAL\" bit set to 1.",
      "ja": "Oエンドポイントは、両方が0に設定された「BFINAL」ビットを有するブロックを収縮および「BFINAL」が1に設定ビットがブロックをDEFLATE使用するかもしれ。"
    },
    {
      "indent": 3,
      "text": "o When any DEFLATE block with the \"BFINAL\" bit set to 1 doesn't end at a byte boundary, an endpoint MUST add minimal padding bits of 0 to make it end at a byte boundary. The next DEFLATE block follows the padded data if any.",
      "ja": "Oと1に設定された「BFINAL」ビットを有する任意のDEFLATEブロックは、エンドポイントは、それがバイト境界で終了するために0の最小のパディングビットを追加しなければならない、バイト境界で終了しません。いずれかの場合には、次のDEFLATEブロックはパディングされたデータを次の。"
    },
    {
      "indent": 3,
      "text": "An endpoint fragments a compressed message by splitting the result of running this algorithm. Even when only part of the payload is available, a fragment can be built by compressing the available data and choosing the block type appropriately so that the end of the resulting compressed data is aligned at a byte boundary. Note that for non-final fragments, the removal of 0x00 0x00 0xff 0xff MUST NOT be done.",
      "ja": "エンドポイントは、このアルゴリズムの実行結果を分割して圧縮されたメッセージを断片化します。ペイロードの一部のみが利用可能である場合でも、断片は、利用可能なデータを圧縮し、得られた圧縮データの末尾がバイト境界で整列されるように、適切にブロックタイプを選択することによって構築することができます。非最終フラグメントのためなお、0x00には0x00から0xffのは0xffの除去が行われてはなりません。"
    },
    {
      "indent": 3,
      "text": "An endpoint MUST NOT use an LZ77 sliding window longer than 32,768 bytes to compress messages to send.",
      "ja": "エンドポイントは、送信するメッセージを圧縮するために長い32,768バイトよりLZ77スライディングウィンドウを使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "If the \"agreed parameters\" contain the \"client_no_context_takeover\" extension parameter, the client MUST start compressing each new message with an empty LZ77 sliding window. Otherwise, the client MAY take over the LZ77 sliding window used to build the last compressed message. Note that even if the client has included the \"client_no_context_takeover\" extension parameter in its offer, the client MAY take over the LZ77 sliding window used to build the last compressed message if the \"agreed parameters\" don't contain the \"client_no_context_takeover\" extension parameter. The client-to-server \"client_no_context_takeover\" extension parameter is just a hint for the server to build an extension negotiation response.",
      "ja": "「合意されたパラメータは」「client_no_context_takeover」拡張パラメータが含まれている場合、クライアントは空LZ77スライディングウィンドウとそれぞれの新しいメッセージの圧縮を開始しなければなりません。そうでない場合、クライアントは最後に圧縮されたメッセージを構築するために使用LZ77スライディングウィンドウを引き継ぐかもしれません。クライアントはその申し出に「client_no_context_takeover」拡張パラメータが含まれている場合でも、クライアントは「合意されたパラメータは」「client_no_context_takeover」拡張パラメータが含まれていない場合は、最後の圧縮されたメッセージを構築するために使用LZ77スライディングウィンドウの上にかかることがあります。クライアントからサーバーへの「client_no_context_takeover」拡張パラメータは延長交渉応答を構築するためのサーバーのためだけのヒントです。"
    },
    {
      "indent": 3,
      "text": "If the \"agreed parameters\" contain the \"server_no_context_takeover\" extension parameter, the server MUST start compressing each new message with an empty LZ77 sliding window. Otherwise, the server MAY take over the LZ77 sliding window used to build the last compressed message.",
      "ja": "「合意されたパラメータは」「server_no_context_takeover」拡張パラメータが含まれている場合、サーバーは空LZ77スライディングウィンドウとそれぞれの新しいメッセージの圧縮を開始しなければなりません。そうしないと、サーバーは、最後の圧縮されたメッセージを構築するために使用LZ77スライディングウィンドウを引き継ぐかもしれません。"
    },
    {
      "indent": 3,
      "text": "If the \"agreed parameters\" contain the \"client_max_window_bits\" extension parameter with a value of w, the client MUST NOT use an LZ77 sliding window longer than the w-th power of 2 bytes to compress messages to send. Note that even if the client has included in its offer the \"client_max_window_bits\" extension parameter with a value smaller than one in the \"agreed parameters\", the client MAY use an LZ77 sliding window with any size to compress messages to send as long as the size conforms to the \"agreed parameters\". The client-to-server \"client_max_window_bits\" extension parameter is just a hint for the server to build an extension negotiation response.",
      "ja": "「合意されたパラメータは」Wの値が「client_max_window_bits」拡張パラメータが含まれている場合、クライアントが送信するメッセージを圧縮する2バイトのワット乗よりも長いLZ77スライディングウィンドウを使用してはなりません。クライアントはその申し出に「合意されたパラメータ」の1よりも小さい値を持つ「client_max_window_bits」拡張パラメータが含まれている場合でも、クライアントは限り送信するメッセージを圧縮するために、任意のサイズでLZ77スライディングウィンドウを使用することができることに注意してくださいサイズは、「合意されたパラメータ」に準拠しています。クライアントからサーバーへの「client_max_window_bits」拡張パラメータは延長交渉応答を構築するためのサーバーのためだけのヒントです。"
    },
    {
      "indent": 3,
      "text": "If the \"agreed parameters\" contain the \"server_max_window_bits\" extension parameter with a value of w, the server MUST NOT use an LZ77 sliding window longer than the w-th power of 2 bytes to compress messages to send.",
      "ja": "「合意されたパラメータは」Wの値が「server_max_window_bits」拡張パラメータが含まれている場合、サーバーが送信するメッセージを圧縮する2バイトのワット乗よりも長いLZ77スライディングウィンドウを使用してはなりません。"
    },
    {
      "indent": 0,
      "text": "7.2.2. Decompression",
      "section_title": true,
      "ja": "7.2.2。減圧"
    },
    {
      "indent": 3,
      "text": "An endpoint uses the following algorithm to decompress a message.",
      "ja": "エンドポイントは、メッセージを解凍するには、次のアルゴリズムを使用しています。"
    },
    {
      "indent": 3,
      "text": "1. Append 4 octets of 0x00 0x00 0xff 0xff to the tail end of the payload of the message.",
      "ja": "1.メッセージのペイロードの最後尾には0x00 0x00から0xFFの0xFFでの4つのオクテットを追加。"
    },
    {
      "indent": 3,
      "text": "2. Decompress the resulting data using DEFLATE.",
      "section_title": true,
      "ja": "2. DEFLATEを使用して得られたデータを解凍。"
    },
    {
      "indent": 3,
      "text": "If the \"agreed parameters\" contain the \"server_no_context_takeover\" extension parameter, the client MAY decompress each new message with an empty LZ77 sliding window. Otherwise, the client MUST decompress each new message using the LZ77 sliding window used to process the last compressed message.",
      "ja": "「合意されたパラメータは」「server_no_context_takeover」拡張パラメータが含まれている場合、クライアントは空LZ77スライディングウィンドウにそれぞれの新しいメッセージを解凍するかもしれません。そうでない場合、クライアントは最後に圧縮されたメッセージを処理するために使用されるLZ77スライディングウィンドウを使用してそれぞれの新しいメッセージを解凍しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the \"agreed parameters\" contain the \"client_no_context_takeover\" extension parameter, the server MAY decompress each new message with an empty LZ77 sliding window. Otherwise, the server MUST decompress each new message using the LZ77 sliding window used to process the last compressed message. Note that even if the client has included the \"client_no_context_takeover\" extension parameter in its offer, the server MUST decompress each new message using the LZ77 sliding window used to process the last compressed message if the \"agreed parameters\" don't contain the \"client_no_context_takeover\" extension parameter. The client-to-server \"client_no_context_takeover\" extension parameter is just a hint for the server to build an extension negotiation response.",
      "ja": "「合意されたパラメータは」「client_no_context_takeover」拡張パラメータが含まれている場合、サーバーは空LZ77スライディングウィンドウにそれぞれの新しいメッセージを解凍するかもしれません。そうでない場合、サーバは、最後の圧縮されたメッセージを処理するために使用されるLZ77スライディングウィンドウを使用して各新しいメッセージを解凍しなければなりません。クライアントはその申し出に「client_no_context_takeover」拡張パラメータが含まれている場合でも、サーバは「合意されたパラメータは」「client_no_context_takeoverが含まれていない場合は、最後の圧縮されたメッセージを処理するために使用されるLZ77スライディングウィンドウを使用してそれぞれの新しいメッセージを解凍しなければならないことに注意してください「拡張パラメータ。クライアントからサーバーへの「client_no_context_takeover」拡張パラメータは延長交渉応答を構築するためのサーバーのためだけのヒントです。"
    },
    {
      "indent": 3,
      "text": "If the \"agreed parameters\" contain the \"server_max_window_bits\" extension parameter with a value of w, the client MAY reduce the size of its LZ77 sliding window to decompress received messages down to the w-th power of 2 bytes. Otherwise, the client MUST use a 32,768-byte LZ77 sliding window to decompress received messages.",
      "ja": "「合意されたパラメータは」Wの値を持つ「server_max_window_bits」拡張パラメータが含まれている場合、クライアントは、2バイトのワット乗まで受信したメッセージを解凍するために、そのLZ77スライディングウィンドウのサイズを小さくすることができます。それ以外の場合は、クライアントが受信したメッセージを解凍するために32,768バイトLZ77スライディングウィンドウを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the \"agreed parameters\" contain the \"client_max_window_bits\" extension parameter with a value of w, the server MAY reduce the size of its LZ77 sliding window to decompress received messages down to the w-th power of 2 bytes. Otherwise, the server MUST use a 32,768-byte LZ77 sliding window to decompress received messages. Note that even if the client has included in its offer the \"client_max_window_bits\" extension parameter with a value smaller than one in the \"agreed parameters\", the client MUST use an LZ77 sliding window of a size that conforms the \"agreed parameters\" to compress messages to send. The client-to-server \"client_max_window_bits\" extension parameter is just a hint for the server to build an extension negotiation response.",
      "ja": "「合意されたパラメータは、」Wの値が「client_max_window_bits」拡張パラメータが含まれている場合、サーバは、2バイトのW乗まで受信したメッセージを解凍するために、そのLZ77スライディングウィンドウのサイズを減少させることができます。そうでなければ、サーバは、受信したメッセージを解凍する32,768バイトLZ77スライディングウィンドウを使用しなければなりません。クライアントはその申し出に「合意されたパラメータ」の1よりも小さい値を持つ「client_max_window_bits」拡張パラメータが含まれている場合でも、クライアントは圧縮し、「合意されたパラメータを」適合したサイズのLZ77スライディングウィンドウを使用しなければならないことに注意してくださいメッセージを送信します。クライアントからサーバーへの「client_max_window_bits」拡張パラメータは延長交渉応答を構築するためのサーバーのためだけのヒントです。"
    },
    {
      "indent": 0,
      "text": "7.2.3. Examples",
      "section_title": true,
      "ja": "7.2.3。例"
    },
    {
      "indent": 3,
      "text": "This section introduces examples of how the \"permessage-deflate\" extension transforms messages.",
      "ja": "このセクションでは、「permessage-デフレート」の拡張子がメッセージを変換する方法の例を紹介します。"
    },
    {
      "indent": 0,
      "text": "7.2.3.1. A Message Compressed Using One Compressed DEFLATE Block",
      "section_title": true,
      "ja": "7.2.3.1。一つの圧縮DEFLATEブロックを使用して圧縮されたメッセージ"
    },
    {
      "indent": 3,
      "text": "Suppose that an endpoint sends a text message \"Hello\". If the endpoint uses one compressed DEFLATE block (compressed with fixed Huffman code and the \"BFINAL\" bit not set) to compress the message, the endpoint obtains the compressed data to use for the message payload as follows.",
      "ja": "エンドポイントは、テキストメッセージ「こんにちは」を送信したとします。エンドポイントがメッセージを圧縮する（固定されたハフマン符号と「BFINAL」ビットを設定しないで圧縮された）一つの圧縮DEFLATEブロックを使用している場合、エンドポイントは次のようにメッセージペイロードに使用する圧縮データを取得します。"
    },
    {
      "indent": 3,
      "text": "The endpoint compresses \"Hello\" into one compressed DEFLATE block and flushes the resulting data into a byte array using an empty DEFLATE block with no compression:",
      "ja": "エンドポイントは、一つの圧縮DEFLATEブロックに「こんにちは」圧縮と圧縮なしで空DEFLATEブロックを使用して、バイト配列に得られたデータをフラッシュします。"
    },
    {
      "indent": 7,
      "text": "0xf2 0x48 0xcd 0xc9 0xc9 0x07 0x00 0x00 0x00 0xff 0xff",
      "ja": "0xf2 0x48 0xcd 0xc9 0xc9 0x07には0x00 0x00には0x00から0xff 0xffで"
    },
    {
      "indent": 3,
      "text": "By stripping 0x00 0x00 0xff 0xff from the tail end, the endpoint gets the data to use for the message payload:",
      "ja": "テールエンドからは0x00 0x00には0xff 0xffのストリッピングすることにより、エンドポイントは、データがメッセージペイロードに使用する取得します。"
    },
    {
      "indent": 7,
      "text": "0xf2 0x48 0xcd 0xc9 0xc9 0x07 0x00",
      "ja": "0xf2 0x48 0xcd 0xc9 0xc9 0x07の0x00で"
    },
    {
      "indent": 3,
      "text": "Suppose that the endpoint sends this compressed message without fragmentation. The endpoint builds one frame by putting all of the compressed data in the payload data portion of the frame:",
      "ja": "エンドポイントは、断片化せずに、この圧縮されたメッセージを送信したとします。エンドポイントは、フレームのペイロードデータ部で圧縮されたデータのすべてを置くことによって一つのフレームを構築します。"
    },
    {
      "indent": 7,
      "text": "0xc1 0x07 0xf2 0x48 0xcd 0xc9 0xc9 0x07 0x00",
      "ja": "0xc1 0x07の0xf2 0x48 0xcd 0xc9 0xc9 0x07の0x00で"
    },
    {
      "indent": 3,
      "text": "The first 2 octets (0xc1 0x07) are the WebSocket frame header (FIN=1, RSV1=1, RSV2=0, RSV3=0, opcode=text, MASK=0, Payload length=7). The following figure shows what value is set in each field of the WebSocket frame header.",
      "ja": "第2オクテット（0xc1の0x07のは）のWebSocketフレームヘッダ（FIN = 1、RSV1 = 1、RSV2 = 0、RSV3 = 0、オペコード=テキスト、MASK = 0、ペイロード長= 7）です。次の図は、値のWebSocketフレームヘッダの各フィールドに設定されているものを示しています。"
    },
    {
      "indent": 7,
      "text": " 0                   1\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5\n+-+-+-+-+-------+-+-------------+\n|F|R|R|R| opcode|M| Payload len |\n|I|S|S|S|       |A|             |\n|N|V|V|V|       |S|             |\n| |1|2|3|       |K|             |\n+-+-+-+-+-------+-+-------------+\n|1|1|0|0|   1   |0|      7      |\n+-+-+-+-+-------+-+-------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Suppose that the endpoint sends the compressed message with fragmentation. The endpoint splits the compressed data into fragments and builds frames for each fragment. For example, if the fragments are 3 and 4 octets, the first frame is:",
      "ja": "エンドポイントが断片化して圧縮されたメッセージを送信したとします。エンドポイントは、フラグメントに圧縮されたデータを分割し、各断片のためのフレームを構築します。断片3及び4オクテットである場合、例えば、最初のフレームです。"
    },
    {
      "indent": 7,
      "text": "0x41 0x03 0xf2 0x48 0xcd",
      "ja": "0×41 0×03 0xf2 0x48 0xcd"
    },
    {
      "indent": 3,
      "text": "and the second frame is:",
      "ja": "第二のフレームは次のとおりです。"
    },
    {
      "indent": 7,
      "text": "0x80 0x04 0xc9 0xc9 0x07 0x00",
      "ja": "0x80と0x04の0xc9 0xc9 0x07の0x00で"
    },
    {
      "indent": 3,
      "text": "Note that the RSV1 bit is set only on the first frame.",
      "ja": "RSV1ビットが最初のフレームに設定されていることに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "7.2.3.2. Sharing LZ77 Sliding Window",
      "section_title": true,
      "ja": "7.2.3.2。 LZ77スライディングウィンドウを共有"
    },
    {
      "indent": 3,
      "text": "Suppose that a client has sent a message \"Hello\" as a compressed message and will send the same message \"Hello\" again as a compressed message.",
      "ja": "クライアントが圧縮されたメッセージのようなメッセージ「こんにちは」を送信したと圧縮されたメッセージと、再び同じメッセージ「こんにちは」を送信することとします。"
    },
    {
      "indent": 7,
      "text": "0xf2 0x48 0xcd 0xc9 0xc9 0x07 0x00",
      "ja": "0xf2 0x48 0xcd 0xc9 0xc9 0x07の0x00で"
    },
    {
      "indent": 3,
      "text": "The above is the payload of the first message that the client has sent. If the \"agreed parameters\" contain the \"client_no_context_takeover\" extension parameter, the client compresses the payload of the next message into the same bytes (if the client uses the same \"BTYPE\" value and \"BFINAL\" value). So, the payload of the second message will be:",
      "ja": "上記は、クライアントが送信した最初のメッセージのペイロードです。 「合意されたパラメータは」「client_no_context_takeover」拡張パラメータが含まれている場合、クライアントは同じバイト（クライアントが同じ「BTYPE」値と「BFINAL」値を使用している場合）に、次のメッセージのペイロードを圧縮します。だから、2番目のメッセージのペイロードは次のようになります。"
    },
    {
      "indent": 7,
      "text": "0xf2 0x48 0xcd 0xc9 0xc9 0x07 0x00",
      "ja": "0xf2 0x48 0xcd 0xc9 0xc9 0x07の0x00で"
    },
    {
      "indent": 3,
      "text": "If the \"agreed parameters\" did not contain the \"client_no_context_takeover\" extension parameter, the client can compress the payload of the next message into fewer bytes by referencing the history in the LZ77 sliding window. So, the payload of the second message will be:",
      "ja": "「合意されたパラメータは」「client_no_context_takeover」拡張パラメータが含まれていない場合、クライアントはLZ77スライディングウィンドウ内の歴史を参照することで、より少ないバイトに次のメッセージのペイロードを圧縮することができます。だから、2番目のメッセージのペイロードは次のようになります。"
    },
    {
      "indent": 7,
      "text": "0xf2 0x00 0x11 0x00 0x00",
      "ja": "0xf2は0x00 0x11を0x00には0x00"
    },
    {
      "indent": 3,
      "text": "So, 2 bytes are saved in total.",
      "ja": "だから、2つのバイトは、合計で保存されます。"
    },
    {
      "indent": 3,
      "text": "Note that even if some uncompressed messages (with the RSV1 bit unset) are inserted between the two \"Hello\" messages, they don't affect the LZ77 sliding window.",
      "ja": "（未設定のRSV1ビットで）いくつかの非圧縮のメッセージは二つの「Hello」メッセージの間に挿入されている場合でも、彼らはLZ77スライディングウィンドウには影響を与えないことに注意してください。"
    },
    {
      "indent": 0,
      "text": "7.2.3.3. Using a DEFLATE Block with No Compression",
      "section_title": true,
      "ja": "7.2.3.3。圧縮なしでDEFLATEブロックの使用"
    },
    {
      "indent": 3,
      "text": "A DEFLATE block with no compression may be used.",
      "ja": "圧縮なしDEFLATEブロックを使用することができます。"
    },
    {
      "indent": 7,
      "text": "0xc1 0x0b 0x00 0x05 0x00 0xfa 0xff 0x48 0x65 0x6c 0x6c 0x6f 0x00",
      "ja": "0xc1 0x0Bのは0x00 0x05を0x00から0xffの0xfa 0x48 0x65 0x6c 0x6c 0x6f $ 00"
    },
    {
      "indent": 3,
      "text": "This is a frame constituting a text message \"Hello\" built using a DEFLATE block with no compression. The first 2 octets (0xc1 0x0b) are the WebSocket frame header (FIN=1, RSV1=1, RSV2=0, RSV3=0, opcode=text, MASK=0, Payload length=7). Note that the RSV1 bit is set for this message (only on the first fragment if the message is fragmented) because the RSV1 bit is set when DEFLATE is applied to the message, including the case when only DEFLATE blocks with no compression are used. The 3rd to 13th octets consist of the payload data containing \"Hello\" compressed using a DEFLATE block with no compression.",
      "ja": "これは、圧縮なしでDEFLATEブロックを使用して構築されたテキストメッセージ「こんにちは」を構成するフレームです。第2オクテット（0xc1の0x0Bのは）のWebSocketフレームヘッダ（FIN = 1、RSV1 = 1、RSV2 = 0、RSV3 = 0、オペコード=テキスト、MASK = 0、ペイロード長= 7）です。 （メッセージが断片化されている場合にのみ最初のフラグメント上）DEFLATEのみ圧縮なしでブロックをDEFLATEを使用する場合など、メッセージに適用する場合RSV1ビットが設定されているためRSV1ビットがこのメッセージに設定されていることに留意されたいです。 13オクテットの第三は、圧縮なしDEFLATEブロックを使用して圧縮された「こんにちは」を含むペイロードデータで構成されています。"
    },
    {
      "indent": 0,
      "text": "7.2.3.4. Using a DEFLATE Block with \"BFINAL\" Set to 1",
      "section_title": true,
      "ja": "7.2.3.4。 1に設定し、「BFINAL」とDEFLATEブロックの使用"
    },
    {
      "indent": 3,
      "text": "On platforms on which the flush method using an empty DEFLATE block with no compression is not available, implementors can choose to flush data using DEFLATE blocks with \"BFINAL\" set to 1.",
      "ja": "圧縮なしで空DEFLATEブロックを使用してフラッシュ方法が利用できるされていないプラットフォームでは、実装は、1に設定された「BFINAL」とDEFLATEブロックを使用してデータをフラッシュするように選択することができます。"
    },
    {
      "indent": 7,
      "text": "0xf3 0x48 0xcd 0xc9 0xc9 0x07 0x00 0x00",
      "ja": "0xf3 0x48 0xcd 0xc9 0xc9 0x07の0x00から0x00に"
    },
    {
      "indent": 3,
      "text": "This is the payload of a message containing \"Hello\" compressed using a DEFLATE block with \"BFINAL\" set to 1. The first 7 octets constitute a DEFLATE block with \"BFINAL\" set to 1 and \"BTYPE\" set to 01 containing \"Hello\". The last 1 octet (0x00) contains the header bits with \"BFINAL\" set to 0 and \"BTYPE\" set to 00, and 5 padding bits of 0. This octet is necessary to allow the payload to be decompressed in the same manner as messages flushed using DEFLATE blocks with \"BFINAL\" unset.",
      "ja": "これは、最初の7つのオクテットが「こんにちは」を含む01に設定1に設定された「BFINAL」および「BTYPE」とDEFLATEブロックを構成する1に設定された「BFINAL」とDEFLATEブロックを使用して圧縮の「Hello」を含むメッセージのペイロードであります。最後の1つのオクテット（0x00が）0と00に設定されている「BTYPE」に設定された「BFINAL」のヘッダビット、および0.1の5つのパディングビットを含むこのオクテットペイロードは、メッセージと同様に解凍できるようにする必要があります「BFINAL」の設定を解除してDEFLATEブロックを使用してフラッシュ。"
    },
    {
      "indent": 0,
      "text": "7.2.3.5. Two DEFLATE Blocks in One Message",
      "section_title": true,
      "ja": "7.2.3.5。一つのメッセージで二DEFLATEブロック"
    },
    {
      "indent": 3,
      "text": "Two or more DEFLATE blocks may be used in one message.",
      "ja": "二つ以上のDEFLATEブロックが一つのメッセージに使用することができます。"
    },
    {
      "indent": 7,
      "text": "0xf2 0x48 0x05 0x00 0x00 0x00 0xff 0xff 0xca 0xc9 0xc9 0x07 0x00",
      "ja": "0xf2 0x48 0x05を0x00には0x00 0x00から0xffの0xffの0xca 0xc9 0xc9 0x07の0x00で"
    },
    {
      "indent": 3,
      "text": "The first 3 octets (0xf2 0x48 0x05) and the least significant two bits of the 4th octet (0x00) constitute one DEFLATE block with \"BFINAL\" set to 0 and \"BTYPE\" set to 01 containing \"He\". The rest of the 4th octet contains the header bits with \"BFINAL\" set to 0 and \"BTYPE\" set to 00, and the 3 padding bits of 0. Together with the following 4 octets (0x00 0x00 0xff 0xff), the header bits constitute an empty DEFLATE block with no compression. A DEFLATE block containing \"llo\" follows the empty DEFLATE block.",
      "ja": "最初の3つのオクテット（0xf2 0x48 0x05の）および第4オクテット（0×00）の最下位2ビットが「BFINAL」を0に設定し、「彼」を含む01に設定された「BTYPE」と、ワンDEFLATEブロックを構成しています。第4オクテットは、以下の4つのオクテット（0x00から0x00から0xFFの0xFFの）と一緒に「BFINAL」を0に設定し、「BTYPE」は00に設定され、0の3パディングビットとヘッダビットを含む残りの、ヘッダビットは構成します圧縮なしで空DEFLATEブロック。 「LLO」を含むDEFLATEブロックは、空のDEFLATEブロックに従います。"
    },
    {
      "indent": 0,
      "text": "7.2.3.6. Generating an Empty Fragment",
      "section_title": true,
      "ja": "7.2.3.6。空のフラグメントを生成します"
    },
    {
      "indent": 3,
      "text": "Suppose that an endpoint is sending data of unknown size. The endpoint may encounter the end-of-data signal from the data source when its buffer for uncompressed data is empty. In such a case, the endpoint just needs to send the last fragment with the FIN bit set to 1 and the payload set to the DEFLATE block(s), which contains 0 bytes of data. If the compression library being used doesn't generate any data when its buffer is empty, an empty uncompressed DEFLATE block can be built and used for this purpose as follows:",
      "ja": "エンドポイントは、未知のサイズのデータ​​を送信していると仮定します。非圧縮データのためにそのバッファが空である場合、エンドポイントは、データソースからエンドのデータ信号を発生することがあります。このような場合、エンドポイントはちょうど1に設定FINビットとデータの0バイトを含むDEFLATEブロック（S）に設定ペイロードと最後のフラグメントを送信する必要があります。そのバッファが空である場合に使用されている圧縮ライブラリは、任意のデータを生成しない場合、次のように、空の非圧縮DEFLATEブロックは、この目的のために構築して使用することができます。"
    },
    {
      "indent": 7,
      "text": "0x00",
      "ja": "$ 00"
    },
    {
      "indent": 3,
      "text": "The single octet 0x00 contains the header bits with \"BFINAL\" set to 0 and \"BTYPE\" set to 00, and 5 padding bits of 0.",
      "ja": "単一オクテット0x00が0の0と00に設定された「BTYPE」、および5パディングビットに設定された「BFINAL」のヘッダビットを含みます。"
    },
    {
      "indent": 0,
      "text": "7.3. Implementation Notes",
      "section_title": true,
      "ja": "7.3。実装の注意事項"
    },
    {
      "indent": 3,
      "text": "On most common software development platforms, the DEFLATE compression library provides a method for aligning compressed data to byte boundaries using an empty DEFLATE block with no compression. For example, zlib [zlib] does this when \"Z_SYNC_FLUSH\" is passed to the deflate function.",
      "ja": "最も一般的なソフトウェア開発プラットフォームでは、deflate圧縮ライブラリは、圧縮なしで空DEFLATEブロックを使用して、バイト境界に圧縮されたデータを整列させるための方法を提供します。例えば、ZLIBは[ZLIBこのとき「Z_SYNC_FLUSHは」DEFLATE関数に渡されません。"
    },
    {
      "indent": 3,
      "text": "Some platforms may only provide methods to output and process compressed data with a zlib header and an Adler-32 checksum. On such platforms, developers need to write stub code to remove and complement the zlib and Adler-32 checksum by themselves.",
      "ja": "一部のプラットフォームは、ZLIBヘッダとアドラー-32チェックサムと出力とプロセス圧縮データにする方法を提供することができます。こうしたプラットフォームでは、開発者が自分自身ではzlibとアドラー-32チェックサムを削除し、補完するためにスタブコードを記述する必要があります。"
    },
    {
      "indent": 3,
      "text": "To obtain a useful compression ratio, an LZ77 sliding window size of 1,024 or more is RECOMMENDED.",
      "ja": "有用な圧縮比を得るために、1024以上のLZ77スライディングウィンドウサイズが推奨されます。"
    },
    {
      "indent": 3,
      "text": "If a side disallows context takeover, its endpoint can easily figure out whether or not a certain message will be shorter if compressed. Otherwise, it's not easy to know whether future messages will benefit from having a certain message compressed. Implementors may employ some heuristics to determine this.",
      "ja": "側は、コンテキストの引き継ぎを許可しない場合は、そのエンドポイントは容易に圧縮あれば、特定のメッセージが短くなりますかどうかを把握することができます。それ以外の場合は、今後のメッセージが圧縮された特定のメッセージを持っていることから恩恵を受けるかどうかを知ることは容易ではありません。実装者はこれを決定するために、いくつかのヒューリスティックを使用することができます。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There is a known exploit when history-based compression is combined with a secure transport [CRIME]. Implementors should pay attention to this point when integrating this extension with other extensions or protocols.",
      "ja": "履歴ベースの圧縮がセキュアトランスポート[犯罪]と組み合わせた場合知られ利用されています。他の拡張やプロトコルでこの拡張機能を統合するときに実装者は、この点に注意を払う必要があります。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "9.1. Registration of the \"permessage-deflate\" WebSocket Extension Name",
      "section_title": true,
      "ja": "9.1。 「permessage-デフレート」のWebSocket拡張子名の登録"
    },
    {
      "indent": 3,
      "text": "IANA has registered the following WebSocket extension name in the \"WebSocket Extension Name Registry\" defined in [RFC6455].",
      "ja": "IANAは[RFC6455]で定義された「WebSocketを拡張名レジストリ」に次のWebSocketの拡張名を登録しています。"
    },
    {
      "indent": 3,
      "text": "Extension Identifier permessage-deflate",
      "ja": "拡張perMessage-デフレートを識別する"
    },
    {
      "indent": 3,
      "text": "Extension Common Name WebSocket Per-Message Deflate",
      "ja": "拡張共通名のWebSocketメッセージごとのデフレート"
    },
    {
      "indent": 3,
      "text": "Extension Definition This document.",
      "ja": "拡張定義このドキュメント。"
    },
    {
      "indent": 3,
      "text": "Known Incompatible Extensions None",
      "ja": "既知の互換性のない拡張機能なし"
    },
    {
      "indent": 3,
      "text": "The \"permessage-deflate\" extension name is used in the \"Sec-WebSocket-Extensions\" header in the WebSocket opening handshake to negotiate use of the \"permessage-deflate\" extension.",
      "ja": "「permessage-DEFLATE」拡張子名が「permessage-デフレート」拡張子の使用を交渉するためのWebSocket開口ハンドシェークにおける「SEC-のWebSocket-拡張」ヘッダに使用されています。"
    },
    {
      "indent": 0,
      "text": "9.2. Registration of the \"Per-Message Compressed\" WebSocket Framing Header Bit",
      "ja": "9.2。 「メッセージごとの圧縮」のWebSocketフレーミングヘッダービットの登録"
    },
    {
      "indent": 3,
      "text": "IANA has registered the following WebSocket framing header bit in the \"WebSocket Framing Header Bits Registry\" defined in [RFC6455].",
      "ja": "IANAは[RFC6455]で定義された「のWebSocketフレーミングヘッダビットレジストリ」で次のWebSocketフレーミングヘッダビットを登録しました。"
    },
    {
      "indent": 3,
      "text": "Value RSV1",
      "ja": "バリューRSV1"
    },
    {
      "indent": 3,
      "text": "Description The \"Per-Message Compressed\" bit, which indicates whether or not the message is compressed. RSV1 is set for compressed messages and unset for uncompressed messages.",
      "ja": "説明メッセージが圧縮されているか否かを示す「メッセージごとの圧縮」ビット、。 RSV1は、圧縮されたメッセージと非圧縮のメッセージの解除のために設定されています。"
    },
    {
      "indent": 3,
      "text": "Reference Section 6 of this document.",
      "ja": "このドキュメントの参照セクション6。"
    },
    {
      "indent": 3,
      "text": "The \"Per-Message Compressed\" framing header bit is used on the first fragment of data messages to indicate whether the payload of the message is compressed by the PMCE or not.",
      "ja": "「メッセージごとの圧縮」ヘッダビットフレーミングメッセージのペイロードはPMCEによって圧縮されているか否かを示すために、データ・メッセージの最初のフラグメントで使用されます。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[CRIME] Rizzo, J. and T. Duong, \"The CRIME attack\", EKOparty Security Conference, September 2012.",
      "ja": "[犯罪] Rizzo氏、J.およびT.ドゥオン、 \"犯罪攻撃\"、EKOpartyセキュリティ会議、2012年9月。"
    },
    {
      "indent": 3,
      "text": "[LZ77] Ziv, J. and A. Lempel, \"A Universal Algorithm for Sequential Data Compression\", IEEE Transactions on Information Theory, Vol. 23, No. 3, pp. 337-343, DOI 10.1109/TIT.1977.1055714, May 1977, <https://www.cs.duke.edu/courses/spring03/cps296.5/papers/ ziv_lempel_1977_universal_algorithm.pdf>.",
      "ja": "[LZ77]ジブ、J.およびA.レンペル、「シーケンシャルデータ圧縮のためのユニバーサル・アルゴリズム」、情報理論、巻上のIEEEトランザクション。 DOI 10.1109 / TIT.1977.1055714 23、第3号、頁337-343、1977年月、<https://www.cs.duke.edu/courses/spring03/cps296.5/papers/ ziv_lempel_1977_universal_algorithm.pdf>。"
    },
    {
      "indent": 3,
      "text": "[RFC1951] Deutsch, P., \"DEFLATE Compressed Data Format Specification version 1.3\", RFC 1951, DOI 10.17487/RFC1951, May 1996, <http://www.rfc-editor.org/info/rfc1951>.",
      "ja": "[RFC1951]ドイツ、P.、 \"DEFLATE圧縮データフォーマット仕様バージョン1.3\"、RFC 1951、DOI 10.17487 / RFC1951、1996年5月、<http://www.rfc-editor.org/info/rfc1951>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, DOI 10.17487/RFC5234, January 2008, <http://www.rfc-editor.org/info/rfc5234>.",
      "ja": "[RFC5234]クロッカー、D.、エド。そして、P. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、STD 68、RFC 5234、DOI 10.17487 / RFC5234、2008年1月、<http://www.rfc-editor.org/info/rfc5234>。"
    },
    {
      "indent": 3,
      "text": "[RFC6455] Fette, I. and A. Melnikov, \"The WebSocket Protocol\", RFC 6455, DOI 10.17487/RFC6455, December 2011, <http://www.rfc-editor.org/info/rfc6455>.",
      "ja": "[RFC6455]たFette、I.およびA.メルニコフ、 \"WebSocketのプロトコル\"、RFC 6455、DOI 10.17487 / RFC6455、2011年12月、<http://www.rfc-editor.org/info/rfc6455>。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1979] Woods, J., \"PPP Deflate Protocol\", RFC 1979, DOI 10.17487/RFC1979, August 1996, <http://www.rfc-editor.org/info/rfc1979>.",
      "ja": "[RFC1979]ウッズ、J.、 \"PPPデフレートプロトコル\"、RFC 1979、DOI 10.17487 / RFC1979、1996年8月、<http://www.rfc-editor.org/info/rfc1979>。"
    },
    {
      "indent": 3,
      "text": "[zlib] Gailly, J. and M. Adler, \"zlib\", <http://www.zlib.net/>.",
      "ja": "【ZLIB] Gailly氏、J.とM.アドラー、 \"ZLIB\"、<http://www.zlib.net/>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Special thanks to Patrick McManus who wrote up the initial specification of a DEFLATE-based compression extension for the WebSocket Protocol, which I referred to when writing this specification.",
      "ja": "私はこの仕様を書く際に参照のWebSocketプロトコル用DEFLATEベースの圧縮拡張の初期仕様を書いたパトリック・マクマナスに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to the following people who participated in discussions on the HyBi WG and contributed ideas and/or provided detailed reviews (the list is likely incomplete): Adam Rice, Alexander Philippou, Alexey Melnikov, Arman Djusupov, Bjoern Hoehrmann, Brian McKelvey, Dario Crivelli, Greg Wilkins, Inaki Baz Castillo, Jamie Lokier, Joakim Erdfelt, John A. Tamplin, Julian Reschke, Kenichi Ishibashi, Mark Nottingham, Peter Thorson, Roberto Peon, Salvatore Loreto, Simone Bordet, Tobias Oberstein, and Yutaka Hirano. Note that the people listed above didn't necessarily endorse the end result of this work.",
      "ja": "アダム・ライス、アレクサンダーPhilippou、アレクセイ・メルニコフ、アルマンDjusupov、ビョルンHoehrmann、ブライアンMcKelvey、ダリオクリヴェリ：HyBi WGでの議論に参加し、（リストが不完全な可能性がある）アイデアおよび/または提供する詳細なレビューを貢献した以下の方々に感謝します、グレッグ・ウィルキンス、イニャキバズカスティーヨ、ジェイミーLokier、ヨアキムErdfelt、ジョンA. Tamplin、ジュリアンReschke、健一石橋、マーク・ノッティンガム、ピーター・ソーソン、ロベルトペオン、サルヴァトーレ・ロレート、Simone Bordet氏、トビアスオーバーシュタイン、そして豊平野。上に挙げた人が、必ずしもこの作業の最終結果を保証するものではありませんでしたことに注意してください。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Takeshi Yoshino Google, Inc.",
      "ja": "武吉野グーグル株式会社"
    },
    {
      "indent": 3,
      "text": "Email: tyoshino@google.com",
      "ja": "メール：tyoshino@google.com"
    }
  ]
}