{
  "title": {
    "text": "RFC 7102 - Terms Used in Routing for Low-Power and Lossy Networks",
    "ja": "RFC 7102 - 低電力および損失の多いネットワークのルーティングで使用される用語"
  },
  "number": 7102,
  "created_at": "2020-09-04 12:19:06.152035+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       JP. Vasseur\nRequest for Comments: 7102                           Cisco Systems, Inc.\nCategory: Informational                                     January 2014\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "Terms Used in Routing for Low-Power and Lossy Networks",
      "ja": "低電力および損失の多いネットワークのルーティングで使用される用語"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document provides a glossary of terminology used in routing requirements and solutions for networks referred to as Low-Power and Lossy Networks (LLNs). An LLN is typically composed of many embedded devices with limited power, memory, and processing resources interconnected by a variety of links. There is a wide scope of application areas for LLNs, including industrial monitoring, building automation (e.g., heating, ventilation, air conditioning, lighting, access control, fire), connected home, health care, environmental monitoring, urban sensor networks, energy management, assets tracking, and refrigeration.",
      "ja": "このドキュメントでは、低電力および損失の多いネットワーク（LLN）と呼ばれるネットワークのルーティング要件とソリューションで使用される用語集を提供します。 LLNは通常、さまざまなリンクによって相互接続された限られた電力、メモリ、処理リソースを持つ多くの組み込みデバイスで構成されます。産業用監視、ビルディングオートメーション（暖房、換気、空調、照明、アクセス制御、消防など）、コネクテッドホーム、ヘルスケア、環境監視、都市センサーネットワーク、エネルギー管理など、LLNには幅広いアプリケーション領域があります。 、資産の追跡、および冷凍。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。 IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補になるわけではありません。 RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7102.",
      "ja": "このドキュメントの現在のステータス、エラッタ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7102で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2014 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................3\n3. Security Considerations .........................................7\n4. Acknowledgements ................................................7\n5. Informative References ..........................................7",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document provides a glossary of terminology used in routing requirements and solutions for networks referred to as Low-Power and Lossy Networks (LLNs).",
      "ja": "このドキュメントでは、低電力および損失の多いネットワーク（LLN）と呼ばれるネットワークのルーティング要件とソリューションで使用される用語集を提供します。"
    },
    {
      "indent": 3,
      "text": "LLNs are typically composed of many embedded devices with limited power, memory, and processing resources interconnected by a variety of links, such as IEEE 802.15.4 or low-power Wi-Fi. There is a wide scope of application areas for LLNs, including industrial monitoring, building automation (heating, ventilation, air conditioning, lighting, access control, fire), connected home, health care, environmental monitoring, urban sensor networks, energy management, assets tracking, and refrigeration.",
      "ja": "LLNは通常、IEEE 802.15.4や低電力Wi-Fiなどのさまざまなリンクによって相互接続された、限られた電力、メモリ、および処理リソースを持つ多くの組み込みデバイスで構成されます。産業用監視、ビルディングオートメーション（暖房、換気、空調、照明、アクセス制御、火災）、コネクテッドホーム、ヘルスケア、環境監視、都市センサーネットワーク、エネルギー管理、資産など、LLNには幅広いアプリケーション領域があります追跡、および冷凍。"
    },
    {
      "indent": 3,
      "text": "Since these applications are usually highly specific (for example, industrial automation, building automation, etc.), it is not uncommon to see a number of disparate terms used to describe the same device or functionality. Thus, in order to avoid confusion or discrepancies, this document specifies the common terminology to be used in all ROLL working group documents. The terms defined in this document are used in [RFC5548], [RFC5673], [RFC5826], and [RFC5867].",
      "ja": "これらのアプリケーションは通常非常に限定的であるため（たとえば、産業オートメーション、ビルディングオートメーションなど）、同じデバイスまたは機能を説明するためにさまざまな用語が使用されることは珍しくありません。したがって、混乱や矛盾を避けるために、このドキュメントでは、すべてのROLLワーキンググループドキュメントで使用される一般的な用語を指定しています。このドキュメントで定義されている用語は、[RFC5548]、[RFC5673]、[RFC5826]、および[RFC5867]で使用されています。"
    },
    {
      "indent": 3,
      "text": "Terminology specific to a particular application is out of the scope of this document.",
      "ja": "特定のアプリケーションに固有の用語は、このドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "It is expected that all routing documents defining requirements or specifying solutions for LLN will use the common terminology specified in this document. This document should be listed as an informative reference.",
      "ja": "要件を定義する、またはLLNのソリューションを指定するすべてのルーティングドキュメントは、このドキュメントで指定されている一般的な用語を使用することが期待されています。このドキュメントは、参考情報として記載する必要があります。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "Actuator: A field device that controls a set of equipment. For example, an actuator might control and/or modulate the flow of a gas or liquid, control electricity distribution, perform a mechanical operation, etc.",
      "ja": "アクチュエータ：機器のセットを制御するフィールドデバイス。たとえば、アクチュエータは、気体または液体の流れを制御および/または調整し、配電を制御し、機械的動作を実行するなどです。"
    },
    {
      "indent": 3,
      "text": "AMI: Advanced Metering Infrastructure. Makes use of Smart Grid technologies. A canonical Smart Grid application is smart-metering.",
      "ja": "AMI：Advanced Metering Infrastructure。スマートグリッド技術を利用しています。標準的なスマートグリッドアプリケーションはスマートメータリングです。"
    },
    {
      "indent": 3,
      "text": "Channel: Radio frequency sub-band used to transmit a modulated signal carrying packets.",
      "ja": "チャネル：パケットを運ぶ変調信号を送信するために使用される無線周波数サブバンド。"
    },
    {
      "indent": 3,
      "text": "Channel Hopping: A procedure by which field devices synchronously change channels during operation.",
      "ja": "チャネルホッピング：フィールドデバイスが動作中に同期的にチャネルを変更する手順。"
    },
    {
      "indent": 3,
      "text": "Commissioning Tool: Any physical or logical device temporarily added to the network for the express purpose of setting up the network and device operational parameters. The commissioning tool can also be temporarily added to the LLN for scheduled or unscheduled maintenance.",
      "ja": "試運転ツール：ネットワークとデバイスの動作パラメーターを設定するという明確な目的で一時的にネットワークに追加された物理デバイスまたは論理デバイス。試運転ツールは、定期的または非定期的なメンテナンスのために一時的にLLNに追加することもできます。"
    },
    {
      "indent": 3,
      "text": "Closed Loop Control: A procedure whereby a device controller controls an actuator based on input information sensed by one or more field devices.",
      "ja": "閉ループ制御：1つ以上のフィールドデバイスによって検出された入力情報に基づいて、デバイスコントローラーがアクチュエーターを制御する手順。"
    },
    {
      "indent": 3,
      "text": "Controller: A field device that can receive sensor input and automatically change the environment in the facility by manipulating digital or analog actuators.",
      "ja": "コントローラー：センサー入力を受信し、デジタルまたはアナログアクチュエーターを操作することで施設内の環境を自動的に変更できるフィールドデバイス。"
    },
    {
      "indent": 3,
      "text": "DA: Distribution Automation. Part of Smart Grid. Encompasses technologies for maintenance and management of electrical distribution systems.",
      "ja": "DA：配布の自動化。スマートグリッドの一部。配電システムの保守と管理のための技術を網羅しています。"
    },
    {
      "indent": 3,
      "text": "DAG: Directed Acyclic Graph. A directed graph with no directed cycles (a graph formed by a collection of vertices and directed edges where each edge connects one vertex to another, such that there is no way to start at some vertex v and follow a sequence of edges that eventually loops back to vertex v again).",
      "ja": "DAG：有向非循環グラフ。有向サイクルのない有向グラフ（各頂点が別の頂点に接続する頂点と有向エッジのコレクションによって形成されるグラフ。ある頂点vから開始して、最終的にループバックする一連のエッジを追跡する方法はありません。再び頂点vへ）。"
    },
    {
      "indent": 3,
      "text": "Data sink: A device that collects data from nodes in an LLN.",
      "ja": "データシンク：LLNのノードからデータを収集するデバイス。"
    },
    {
      "indent": 3,
      "text": "Downstream: Data direction traveling from outside of the LLN (e.g., traffic coming from a LAN, WAN, or the Internet) via an LLN Border Router (LBR), or in general, \"deeper\" in the Directed Acyclic Graph computed by the routing protocol.",
      "ja": "ダウンストリーム：LLNボーダールーター（LBR）を介してLLNの外部から移動するデータ方向（LAN、WAN、またはインターネットからのトラフィックなど）、または一般に、ルーティングによって計算された有向非巡回グラフの「より深い」プロトコル。"
    },
    {
      "indent": 3,
      "text": "Field Device: A field device is a physical device placed in the network's operating environment (e.g., plant, urban area, or home). Field devices include sensors and actuators as well as routers and Low-Power and Lossy Network Border Routers (LBRs). A field device is usually (but not always) a device with constrained CPU, memory footprint, storage capacity, bandwidth, and sometimes power (battery operated). At the time of writing, for the sake of illustration, a typical sensor or actuator would have a few Kilobytes of RAM, a few dozens of Kilobytes of ROM/Flash memory, a 8-/16-/32-bit microcontroller, and communication capabilities ranging from a few kbits/s to a few hundred kbits/s. Although continuous improvement of hardware and software technologies is expected, such devices will likely continue to be seen as resource-constrained devices compared to computers and routers used in the rest of the Internet.",
      "ja": "フィールドデバイス：フィールドデバイスは、ネットワークの動作環境に配置された物理デバイスです（例：プラント、都市部、または家庭）。フィールドデバイスには、センサーとアクチュエーター、ルーター、低電力および損失の多いネットワークボーダールーター（LBR）が含まれます。フィールドデバイスは通常（常にではありませんが）、CPU、メモリフットプリント、ストレージ容量、帯域幅に制約があり、場合によっては電源（バッテリーで動作）を備えています。執筆時点では、説明のために、一般的なセンサーまたはアクチュエーターには、数キロバイトのRAM、数十キロバイトのROM /フラッシュメモリ、8/16/32ビットマイクロコントローラー、および通信が搭載されています。数キロビット/秒から数百キロビット/秒の範囲の機能。ハードウェアおよびソフトウェアテクノロジーの継続的な改善が期待されますが、そのようなデバイスは、インターネットの残りの部分で使用されるコンピューターやルーターと比較して、リソースに制約のあるデバイスと見なされ続けるでしょう。"
    },
    {
      "indent": 3,
      "text": "Flash Memory: non-volatile memory that can be re-programmed.",
      "ja": "フラッシュメモリ：再プログラム可能な不揮発性メモリ。"
    },
    {
      "indent": 3,
      "text": "FMS: Facility Management System. A global term applied across all the vertical designations within a building, including heating, ventilation, and air conditioning (also referred to as HVAC), fire, security, lighting, and elevator control.",
      "ja": "FMS：施設管理システム。暖房、換気、空調（HVACとも呼ばれる）、火災、セキュリティ、照明、エレベーターの制御など、建物内のすべての垂直方向の指定に適用されるグローバルな用語。"
    },
    {
      "indent": 3,
      "text": "HART: Highway Addressable Remote Transducer. A group of specifications for industrial process and control devices administered by the HART Foundation (see [HART]). The latest version for the specifications is HART7, which includes the additions for WirelessHART.",
      "ja": "HART：Highway Addressable Remote Transducer。 HART Foundation（[HART]を参照）が管理する工業プロセスおよび制御装置の仕様のグループ。仕様の最新バージョンはHART7で、WirelessHARTが追加されています。"
    },
    {
      "indent": 3,
      "text": "HVAC: Heating, Ventilation, and Air Conditioning. A term applied to mechanisms used to maintain the comfort level of an internal space.",
      "ja": "HVAC：暖房、換気、および空調。内部空間の快適性を維持するために使用されるメカニズムに適用される用語。"
    },
    {
      "indent": 3,
      "text": "ISA: International Society of Automation. An ANSI accredited standards-making society. ISA100 is an ISA committee whose charter includes defining a family of standards for industrial automation. [ISA100.11a] is a working group within ISA100 that is working on a standard for monitoring and non-critical process-control applications.",
      "ja": "ISA：国際自動化学会。 ANSI認定の標準化社会。 ISA100はISA委員会であり、その憲章には産業オートメーションの標準ファミリの定義が含まれています。 [ISA100.11a]は、監視および重要でないプロセス制御アプリケーションの標準に取り組んでいるISA100内のワーキンググループです。"
    },
    {
      "indent": 3,
      "text": "LAN: Local Area Network.",
      "ja": "LAN：ローカルエリアネットワーク。"
    },
    {
      "indent": 3,
      "text": "LBR: Low-Power and Lossy Network Border Router. A device that connects the Low-Power and Lossy Network to another routing domain such as a LAN, a WAN, or the Internet where a different routing protocol may be in operation. The LBR acts as a routing device and may possibly host other functions such as data collector or aggregator.",
      "ja": "LBR：低電力で損失の多いネットワーク境界ルーター。低電力および損失の多いネットワークを、別のルーティングプロトコルが動作している可能性があるLAN、WAN、インターネットなどの別のルーティングドメインに接続するデバイス。 LBRはルーティングデバイスとして機能し、データコレクターやアグリゲーターなどの他の機能をホストする可能性があります。"
    },
    {
      "indent": 3,
      "text": "LLN: Low-Power and Lossy Network. Typically composed of many embedded devices with limited power, memory, and processing resources interconnected by a variety of links, such as IEEE 802.15.4 or low-power Wi-Fi. There is a wide scope of application areas for LLNs, including industrial monitoring, building automation (HVAC, lighting, access control, fire), connected home, health care, environmental monitoring, urban sensor networks, energy management, assets tracking, and refrigeration.",
      "ja": "LLN：低電力で損失の多いネットワーク。通常、IEEE 802.15.4や低電力Wi-Fiなどのさまざまなリンクによって相互接続された、限られた電力、メモリ、および処理リソースを持つ多くの組み込みデバイスで構成されます。産業用監視、ビルディングオートメーション（HVAC、照明、アクセス制御、消防）、コネクテッドホーム、ヘルスケア、環境監視、都市センサーネットワーク、エネルギー管理、資産追跡、冷凍など、LLNには幅広いアプリケーション領域があります。"
    },
    {
      "indent": 3,
      "text": "MP2P: Multipoint-to-Point. Used to describe a particular traffic pattern (e.g., MP2P flows collecting information from many nodes flowing upstream towards a collecting sink or an LBR).",
      "ja": "MP2P：マルチポイントツーポイント。特定のトラフィックパターンを説明するために使用されます（たとえば、MP2Pフローは、収集シンクまたはLBRに向かって上流に流れる多くのノードから情報を収集します）。"
    },
    {
      "indent": 3,
      "text": "MAC: Medium Access Control. Refers to algorithms and procedures used by the data link layer to coordinate use of the physical layer.",
      "ja": "MAC：中程度のアクセス制御。物理層の使用を調整するためにデータリンク層で使用されるアルゴリズムと手順を指します。"
    },
    {
      "indent": 3,
      "text": "Non-Sleepy Node: A node that always remains in a fully powered-on state (i.e., always awake) where it has the capability to perform communication.",
      "ja": "非スリープノード：通信を実行する機能を備えた、完全に電源が投入された状態（つまり、常にウェイクアップ）のままであるノード。"
    },
    {
      "indent": 3,
      "text": "Open Loop Control: A process whereby a plant operator manually manipulates an actuator over the network where the decision is influenced by information sensed by field devices.",
      "ja": "オープンループ制御：プラントオペレーターがネットワーク上で手動でアクチュエーターを操作するプロセスで、フィールドデバイスによって検出された情報によって決定が影響を受けます。"
    },
    {
      "indent": 3,
      "text": "PER: Packet Error Rate. A ratio of the number of unusable packets (not received at all or received in error, even after any applicable error correction has been applied) to the total number of packets that would have been received in the absence of errors.",
      "ja": "PER：パケットエラー率。エラーがない場合に受信されるはずだったパケットの総数に対する、使用できないパケットの数（該当するエラー訂正が適用された後でも、まったく受信されないか、エラーで受信された）の比率。"
    },
    {
      "indent": 3,
      "text": "P2P: Point To Point. Refers to traffic exchanged between two nodes (regardless of the number of hops between the two nodes).",
      "ja": "P2P：ポイントツーポイント。 （2つのノード間のホップ数に関係なく）2つのノード間で交換されるトラフィックを指します。"
    },
    {
      "indent": 3,
      "text": "P2MP: Point-to-Multipoint. Refers to traffic between one node and a set of nodes. This is similar to the P2MP concept in Multicast or MPLS Traffic Engineering ([RFC4461]and [RFC4875]). A common use case for the Routing Protocol for Low-Power and Lossy Networks (RPL) involves P2MP flows from or through a DAG root outward towards other nodes contained in the DAG.",
      "ja": "P2MP：ポイントツーマルチポイント。 1つのノードと一連のノード間のトラフィックを指します。これは、マルチキャストまたはMPLSトラフィックエンジニアリング（[RFC4461]および[RFC4875]）のP2MPコンセプトに似ています。低電力および損失の多いネットワーク（RPL）のルーティングプロトコルの一般的なユースケースには、DAGルートから、またはDAGルートを介して、DAGに含まれる他のノードに向かって外向きに流れるP2MPフローが含まれます。"
    },
    {
      "indent": 3,
      "text": "RAM: Random Access Memory. A volatile memory.",
      "ja": "RAM：ランダムアクセスメモリ。揮発性メモリ。"
    },
    {
      "indent": 3,
      "text": "RFID: Radio Frequency IDentification.",
      "ja": "RFID：無線周波数識別。"
    },
    {
      "indent": 3,
      "text": "ROM: Read-Only Memory.",
      "ja": "ROM：読み取り専用メモリ。"
    },
    {
      "indent": 3,
      "text": "ROLL: Routing Over Low-Power and Lossy Networks.",
      "ja": "ロール：低電力および損失の多いネットワークを介したルーティング。"
    },
    {
      "indent": 3,
      "text": "RPL: An IPv6 Routing Protocol for Low-Power and Lossy Networks that provides a mechanism whereby multipoint-to-point traffic from devices inside the LLN towards a central control point as well as point-to-multipoint traffic from the central control point to the devices inside the LLN are supported. RPL also supports point-to-point traffic between any arbitrary nodes in the LLN.",
      "ja": "RPL：低電力および損失の多いネットワーク用のIPv6ルーティングプロトコルで、LLN内のデバイスから中央制御点に向かうマルチポイントツーポイントトラフィック、および中央制御点から中央制御点に向かうポイントツーマルチポイントトラフィックLLN内のデバイスがサポートされます。 RPLは、LLN内の任意のノード間のポイントツーポイントトラフィックもサポートします。"
    },
    {
      "indent": 3,
      "text": "RPL Domain: A collection of RPL routers under the control of a single administration. The boundaries of routing domains are defined by network management by setting some links to be exterior, or inter-domain, links.",
      "ja": "RPLドメイン：単一の管理下にあるRPLルーターのコレクション。ルーティングドメインの境界は、一部のリンクを外部リンクまたはドメイン間リンクに設定することにより、ネットワーク管理によって定義されます。"
    },
    {
      "indent": 3,
      "text": "Schedule: An agreed execution, wake-up, transmission, reception, etc., timetable between two or more field devices.",
      "ja": "スケジュール：合意された実行、ウェイクアップ、送信、受信など、2つ以上のフィールドデバイス間のタイムテーブル。"
    },
    {
      "indent": 3,
      "text": "Sensor: A device that measures a physical quantity and converts it to an analog or digital signal that can be read by a program or a user. Sensed data can be of many types: electromagnetic (e.g., current, voltage, power, or resistance), mechanical (e.g., pressure, flow, liquid density, or humidity), chemical (e.g., oxygen or carbon monoxide), acoustic (e.g., noise or ultrasound), etc.",
      "ja": "センサー：物理量を測定し、プログラムまたはユーザーが読み取ることができるアナログまたはデジタル信号に変換するデバイス。感知されたデータは多くのタイプである可能性があります：電磁気（例えば、電流、電圧、電力、または抵抗）、機械的（例えば、圧力、流量、液体密度、または湿度）、化学的（例えば、酸素または一酸化炭素）、音響的（例えば、ノイズまたは超音波）など"
    },
    {
      "indent": 3,
      "text": "Sleepy Node: A node that may sometimes go into a sleep mode (i.e., go into a low-power state to conserve power) and temporarily suspend protocol communication. When not in sleep mode, the sleepy node is in a fully powered-on state where it has the capability to perform communication.",
      "ja": "スリープノード：スリープモードに入る（つまり、電力を節約するために低電力状態になる）可能性があり、プロトコル通信を一時的に停止するノード。スリープモードではない場合、スリープ状態のノードは完全に電源が入った状態であり、通信を実行する機能があります。"
    },
    {
      "indent": 3,
      "text": "Smart Grid: A broad class of applications to network and automate utility infrastructure.",
      "ja": "スマートグリッド：ユーティリティインフラストラクチャをネットワーク化および自動化する幅広いクラスのアプリケーション。"
    },
    {
      "indent": 3,
      "text": "Timeslot: A fixed time interval that may be used for the transmission or reception of a packet between two field devices. A timeslot used for communications is associated with a slotted-link.",
      "ja": "タイムスロット：2つのフィールドデバイス間のパケットの送信または受信に使用できる固定の時間間隔。通信に使用されるタイムスロットは、スロット付きリンクに関連付けられています。"
    },
    {
      "indent": 3,
      "text": "Upstream: Data direction traveling from the LLN via the LBR to outside of the LLN (LAN, WAN, or Internet) or generally closer to the root of the DAG computed by the routing protocol.",
      "ja": "アップストリーム：LLNからLBRを経由してLLNの外側（LAN、WAN、またはインターネット）に移動する、または一般的にルーティングプロトコルによって計算されたDAGのルートに近いデータ方向。"
    },
    {
      "indent": 3,
      "text": "WAN: Wide Area Network.",
      "ja": "WAN：広域ネットワーク。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Since this document specifies terminology and does not specify new procedures or protocols, it raises no new security issues.",
      "ja": "このドキュメントでは用語を指定し、新しい手順やプロトコルを指定していないため、新しいセキュリティの問題は発生しません。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgements",
      "section_title": true,
      "ja": "4. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Christian Jacquenet, Tim Winter, Pieter De Mil, David Meyer, Mukul Goyal, and Abdussalam Baryun for their valuable feedback.",
      "ja": "著者は、貴重なフィードバックを提供してくれたChristian Jacquenet、Tim Winter、Pieter De Mil、David Meyer、Mukul Goyal、およびAbdussalam Baryunに感謝します。"
    },
    {
      "indent": 0,
      "text": "5. Informative References",
      "section_title": true,
      "ja": "5. 参考引用"
    },
    {
      "indent": 3,
      "text": "[HART] HART Communication Foundation, <http://www.hartcomm.org>.",
      "ja": "[HART] HART Communication Foundation、<http://www.hartcomm.org>。"
    },
    {
      "indent": 3,
      "text": "[ISA100.11a] ISA, \"Wireless systems for industrial automation: Process control and related applications\", ISA 100.11a, May 2008, <http://www.isa.org/Community/ SP100WirelessSystemsforAutomation>.",
      "ja": "[ISA100.11a] ISA、「産業オートメーション用ワイヤレスシステム：プロセス制御と関連アプリケーション」、ISA 100.11a、2008年5月、<http://www.isa.org/Community/ SP100WirelessSystemsforAutomation>。"
    },
    {
      "indent": 3,
      "text": "[RFC4461] Yasukawa, S., Ed., \"Signaling Requirements for Point-to-Multipoint Traffic-Engineered MPLS Label Switched Paths (LSPs)\", RFC 4461, April 2006.",
      "ja": "[RFC4461] Yasukawa、S.、Ed。、「ポイントツーマルチポイントトラフィックエンジニアリングMPLSラベルスイッチドパス（LSP）のシグナリング要件」、RFC 4461、2006年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC4875] Aggarwal, R., Ed., Papadimitriou, D., Ed., and S. Yasukawa, Ed., \"Extensions to Resource Reservation Protocol - Traffic Engineering (RSVP-TE) for Point-to-Multipoint TE Label Switched Paths (LSPs)\", RFC 4875, May 2007.",
      "ja": "[RFC4875] Aggarwal、R.、Ed。、Papadimitriou、D.、Ed。、and S. Yasukawa、Ed。、 \"Extensions to Resource Reservation Protocol-Traffic Engineering（RSVP-TE）for Point-to-Multipoint TE Label Switchedパス（LSP）」、RFC 4875、2007年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5548] Dohler, M., Ed., Watteyne, T., Ed., Winter, T., Ed., and D. Barthel, Ed., \"Routing Requirements for Urban Low-Power and Lossy Networks\", RFC 5548, May 2009.",
      "ja": "[RFC5548] Dohler、M。、編、Watteyne、T。、編、Winter、T。、編、およびD. Barthel、編、「都市の低電力および損失の多いネットワークのルーティング要件」、RFC 5548 、2009年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5673] Pister, K., Ed., Thubert, P., Ed., Dwars, S., and T. Phinney, \"Industrial Routing Requirements in Low-Power and Lossy Networks\", RFC 5673, October 2009.",
      "ja": "[RFC5673] Pister、K.、Ed。、Thubert、P.、Ed。、Dwars、S.、T。Phinney、「Industrial Routing Requirements in Low-Power and Lossy Networks」、RFC 5673、2009年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5826] Brandt, A., Buron, J., and G. Porcu, \"Home Automation Routing Requirements in Low-Power and Lossy Networks\", RFC 5826, April 2010.",
      "ja": "[RFC5826] Brandt、A.、Buron、J。、およびG. Porcu、「低電力および損失の多いネットワークにおけるホームオートメーションルーティング要件」、RFC 5826、2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5867] Martocci, J., Ed., De Mil, P., Riou, N., and W. Vermeylen, \"Building Automation Routing Requirements in Low-Power and Lossy Networks\", RFC 5867, June 2010.",
      "ja": "[RFC5867] Martocci、J.、Ed。、De Mil、P.、Riou、N。、およびW. Vermeylen、「Building Automation Routing Requirements in Low-Power and Lossy Networks」、RFC 5867、2010年6月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "JP. Vasseur Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA 01719 US",
      "ja": "ＪＰ。 ゔぁっせうｒ しｓこ Ｓｙｓてｍｓ、 いんｃ。 １４１４ まっさちゅせっｔｓ あゔぇぬえ ぼｘぼろうｇｈ、 ま ０１７１９ うＳ"
    },
    {
      "indent": 3,
      "text": "EMail: jpv@cisco.com",
      "raw": true,
      "ja": ""
    }
  ]
}