{
  "title": {
    "text": "RFC 7842 - Requirements for Improvements to the IETF Email List Archiving, Web-Based Browsing, and Search Tool",
    "ja": "RFC 7842 - IETFメーリングリストのアーカイブ、Webベースの参照、および検索ツールの改善のための要件"
  },
  "number": 7842,
  "created_at": "2020-08-29 16:18:42.075277+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         R. Sparks\nRequest for Comments: 7842                                        Oracle\nCategory: Informational                                       April 2016\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "Requirements for Improvements to the IETF Email List Archiving, Web-Based Browsing, and Search Tool",
      "ja": "IETFメーリングリストのアーカイブ、Webベースの参照、および検索ツールの改善のための要件"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The web-based IETF email archive search tool based on the requirements captured in RFC 6778 was deployed in January 2014. This memo captures the requirements for a set of improvements that have been identified during its initial years of community use.",
      "ja": "RFC 6778で取得された要件に基づくWebベースのIETF電子メールアーカイブ検索ツールは、2014年1月に導入されました。このメモは、コミュニティでの使用の初期の数年間に特定された一連の改善の要件を取得します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。 IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補になるわけではありません。 RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7842.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7842で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2016 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象であり、この文書の発行日に有効です。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  List Search and Archive Tool Improvement Requirements . . . .   2\n  2.1.  Viewing by Thread . . . . . . . . . . . . . . . . . . . .   2\n  2.2.  Navigation from the Message List View . . . . . . . . . .   3\n  2.3.  Navigation from a Single Message  . . . . . . . . . . . .   3\n  2.4.  Message List UI . . . . . . . . . . . . . . . . . . . . .   4\n  2.5.  Improve Support for Mobile Devices  . . . . . . . . . . .   5\n  2.6.  Improve Use of Display Space  . . . . . . . . . . . . . .   5\n  2.7.  Use without JavaScript  . . . . . . . . . . . . . . . . .   5\n  2.8.  Administration  . . . . . . . . . . . . . . . . . . . . .   6\n3.  Security Considerations . . . . . . . . . . . . . . . . . . .   6\n4.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   6\n  4.1.  Normative References  . . . . . . . . . . . . . . . . . .   6\n  4.2.  Informative References  . . . . . . . . . . . . . . . . .   6\nAcknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .   6\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .   7",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The IETF email archive search tool, as specified in [RFC6778]) and available at [mailarch], has been in use for nearly two years. During that time, there have been repeated requests for several improvements. This memo captures the requirements for a concerted development effort to provide those improvements.",
      "ja": "[RFC6778]で指定され、[mailarch]で利用できるIETFメールアーカイブ検索ツールは、ほぼ2年間使用されています。その間、いくつかの改善の要望が何度もありました。このメモは、それらの改善を提供するための協調開発努力の要件をキャプチャします。"
    },
    {
      "indent": 0,
      "text": "2. List Search and Archive Tool Improvement Requirements",
      "section_title": true,
      "ja": "2. リスト検索およびアーカイブツールの改善要件"
    },
    {
      "indent": 0,
      "text": "2.1. Viewing by Thread",
      "section_title": true,
      "ja": "2.1. スレッドで見る"
    },
    {
      "indent": 3,
      "text": "Currently, when the \"Group by Thread\" button is selected, the resulting list of messages is flat. It is very hard to tell where a thread starts and stops. This flat view interacts badly with sorting (triggered by clicking on the column headers), leading to results that are confusing and sometimes incorrect.",
      "ja": "現在、[スレッドごとにグループ化]ボタンを選択すると、結果のメッセージリストはフラットになります。スレッドの開始位置と停止位置を特定するのは非常に困難です。このフラットビューは、並べ替え（列ヘッダーをクリックすることでトリガーされます）との相互作用が悪く、結果がわかりにくく、時には不正確になります。"
    },
    {
      "indent": 3,
      "text": "This effort will:",
      "ja": "この努力は："
    },
    {
      "indent": 3,
      "text": "o Modify the message list display, when grouped by thread, to show each thread hierarchically.",
      "ja": "o スレッドごとにグループ化されている場合は、メッセージリストの表示を変更して、各スレッドを階層的に表示します。"
    },
    {
      "indent": 3,
      "text": "o Modify the sort performed by the clicking on the column headers to sort the overall list first by the parameters in the first message in the thread, and then sort within the thread (ensuring the thread grouping doesn't change based on these sorts). When viewing threads sorted this way, the hierarchy will be flattened, but the thread boundaries will remain visibly distinct.",
      "ja": "o 列ヘッダーをクリックして実行する並べ替えを変更して、最初にスレッド内の最初のメッセージのパラメーターでリスト全体を並べ替え、次にスレッド内で並べ替えます（これらの並べ替えに基づいてスレッドのグループ化が変更されないようにします）。この方法でソートされたスレッドを表示すると、階層はフラット化されますが、スレッドの境界ははっきりと区別されたままになります。"
    },
    {
      "indent": 0,
      "text": "2.2. Navigation from the Message List View",
      "section_title": true,
      "ja": "2.2. メッセージリストビューからのナビゲーション"
    },
    {
      "indent": 3,
      "text": "This effort will add navigation to the message list view, whether viewing flat search results or viewing by thread, making it simple to:",
      "ja": "この作業により、メッセージリストビューにナビゲーションが追加され、フラットな検索結果を表示する場合でも、スレッドごとに表示する場合でも、次のことが簡単になります。"
    },
    {
      "indent": 3,
      "text": "o Navigate to the previous/next message by date in the set of listed messages.",
      "ja": "o リストされたメッセージのセットで、日付ごとに前/次のメッセージに移動します。"
    },
    {
      "indent": 3,
      "text": "o Navigate to the previous/next message in a thread, to the first message in a thread, and to the previous/next thread displayed.",
      "ja": "o スレッド内の前/次のメッセージ、スレッド内の最初のメッセージ、表示されている前/次のスレッドに移動します。"
    },
    {
      "indent": 3,
      "text": "o Navigate to any References or Replies (displayed as Follow-Ups in MHonArc) for the currently selected message. These are derived from the References header field in the displayed message, and the In-Reply-To header field or the last value in the References header field of all other messages in the archive).",
      "ja": "o 現在選択されているメッセージの参照または返信（MHonArcでフォローアップとして表示）に移動します。これらは、表示されたメッセージのReferencesヘッダーフィールド、およびIn-Reply-Toヘッダーフィールドまたはアーカイブ内の他のすべてのメッセージのReferencesヘッダーフィールドの最後の値から取得されます。"
    },
    {
      "indent": 3,
      "text": "The UI will make it possible to hide these navigation elements.",
      "ja": "UIにより、これらのナビゲーション要素を非表示にすることができます。"
    },
    {
      "indent": 0,
      "text": "2.3. Navigation from a Single Message",
      "section_title": true,
      "ja": "2.3. 単一のメッセージからのナビゲーション"
    },
    {
      "indent": 3,
      "text": "Currently, when viewing a single message, the only option for navigating to related messages is to return to the message list view (either by date or by thread). This is implemented with a new search based only on the details present in the message itself. No information about any search that led to the message is retained.",
      "ja": "現在、単一のメッセージを表示する場合、関連するメッセージに移動するための唯一のオプションは、メッセージリストビューに戻ることです（日付別またはスレッド別）。これは、メッセージ自体に存在する詳細のみに基づく新しい検索で実装されます。メッセージにつながった検索に関する情報は保持されません。"
    },
    {
      "indent": 3,
      "text": "This effort will:",
      "ja": "この努力は："
    },
    {
      "indent": 3,
      "text": "o Add navigation to the single message view, enabling transition to previous/next in list and previous/next in thread.",
      "ja": "o 単一メッセージビューにナビゲーションを追加して、リスト内の前/次およびスレッド内の前/次への移行を可能にします。"
    },
    {
      "indent": 3,
      "text": "o Add navigation enabling transition to previous/next in search, if the message page being displayed was arrived at by navigating from the message list view of a search result.",
      "ja": "o 検索結果のメッセージリストビューから移動して、表示されているメッセージページに到達した場合に、検索の前/次への遷移を可能にするナビゲーションを追加します。"
    },
    {
      "indent": 3,
      "text": "o Add navigation to any References or Replies (displayed as Follow-Ups in MHonArc). These are derived from the References header field in the displayed message, and the In-Reply-To header field or the last value in the References header field of all other messages in the archive.",
      "ja": "o 参照または返信にナビゲーションを追加します（MHonArcではフォローアップとして表示されます）。これらは、表示されたメッセージのReferencesヘッダーフィールド、およびIn-Reply-Toヘッダーフィールドまたはアーカイブ内の他のすべてのメッセージのReferencesヘッダーフィールドの最後の値から派生します。"
    },
    {
      "indent": 3,
      "text": "o Make it possible to hide these navigation elements.",
      "ja": "o これらのナビゲーション要素を非表示にすることを可能にします。"
    },
    {
      "indent": 0,
      "text": "2.4. Message List UI",
      "section_title": true,
      "ja": "2.4. メッセージリストUI"
    },
    {
      "indent": 3,
      "text": "It is not sufficiently obvious that the message list panel can be resized. The current handle is not visually distinct enough to signal the capability to the user, leaving many users believing they are restricted to the very short default list, even when viewing on large monitors.",
      "ja": "メッセージリストパネルのサイズを変更できるかどうかは、明らかではありません。現在のハンドルは、機能をユーザーに知らせるのに十分なほど視覚的に区別されていないため、大きなモニターで表示している場合でも、多くのユーザーは非常に短いデフォルトリストに制限されていると信じています。"
    },
    {
      "indent": 3,
      "text": "Additionally, there is a flaw in the code that fetches additional messages when scrolling to the bottom of what's currently displayed. If the message window is large enough that the default number of results does not fill it, no scrollbar appears, and scrolling to the bottom does not fetch additional results.",
      "ja": "さらに、現在表示されているものの一番下までスクロールすると、追加のメッセージをフェッチするコードに欠陥があります。メッセージウィンドウが十分な大きさで、デフォルトの結果数がそれを満たさない場合、スクロールバーは表示されず、下部までスクロールしても追加の結果は取得されません。"
    },
    {
      "indent": 3,
      "text": "The filter by list and filter by from sections to the left of the message list have no values in many circumstances, but it is not obvious why they are missing. One notable condition is when the search result is very large -- computing the values to put in these filters becomes prohibitively expensive. Without foreknowledge of the decisions captured in the code, the behavior seems arbitrary and unintuitive.",
      "ja": "メッセージリストの左側にあるリストによるフィルターおよびフィルターによる送信元セクションは、多くの状況で値を持ちませんが、これらが欠落している理由は明らかではありません。注目すべき条件の1つは、検索結果が非常に大きい場合です。これらのフィルターに入力する値の計算は、法外に高価になります。コードでキャプチャされた決定を事前に理解していないと、動作は恣意的で直感的ではないようです。"
    },
    {
      "indent": 3,
      "text": "The current view truncates fields, leaving trailing ellipses, when it doesn't need to. This leaves space underutilized on large displays and may make selection (particularly of long email addresses in the filters) much more difficult than it should be. On small displays, the column of filters dominates the display, leaving only a small amount of space for the actual message content.",
      "ja": "現在のビューでは、必要がない場合はフィールドが切り捨てられ、末尾の省略記号が残ります。これにより、大型ディスプレイではスペースが十分に活用されず、選択（特にフィルター内の長い電子メールアドレスの選択）が必要以上に難しくなる場合があります。小さなディスプレイでは、フィルターの列がディスプレイを支配し、実際のメッセージコンテンツ用にわずかなスペースしか残しません。"
    },
    {
      "indent": 3,
      "text": "The current view requires the user to select each message in the message list to get the URI to that message. This makes it difficult to open several messages in different windows, or to build a list of URIs for use in a message or other applications. It is also not obvious that double-clicking a row in the list will open the message in a separate window.",
      "ja": "現在のビューでは、メッセージリストの各メッセージを選択して、そのメッセージのURIを取得する必要があります。これにより、複数のメッセージを異なるウィンドウで開いたり、メッセージや他のアプリケーションで使用するためのURIのリストを作成したりすることが難しくなります。リストの行をダブルクリックすると、別のウィンドウでメッセージが開くことも明らかではありません。"
    },
    {
      "indent": 3,
      "text": "This effort will:",
      "ja": "この努力は："
    },
    {
      "indent": 3,
      "text": "o Make the ability to resize the panels on the message list display easier to find.",
      "ja": "o メッセージリスト表示のパネルのサイズを変更する機能を見つけやすくします。"
    },
    {
      "indent": 3,
      "text": "o Account for the size of the message list panel when choosing how many messages to fetch, filling the panel whenever there are enough results to do so.",
      "ja": "o フェッチするメッセージの数を選択するときにメッセージリストパネルのサイズを考慮し、十分な結果がある場合は常にパネルを埋めます。"
    },
    {
      "indent": 3,
      "text": "o Provide a message explaining any condition leading to filter values not being populated (such as \"Refine search to enable 'From' filtering\").",
      "ja": "o フィルター値が入力されない原因となる条件を説明するメッセージを提供します（「検索を絞り込んで「From」フィルターを有効にする」など）。"
    },
    {
      "indent": 3,
      "text": "o Allow subjects to fill the column on large displays. Show fully expanded list and email addresses in the pop-ups for the filters.",
      "ja": "o 大きなディスプレイで被験者が列を満たすことができるようにします。完全に展開されたリストと電子メールアドレスをフィルターのポップアップに表示します。"
    },
    {
      "indent": 3,
      "text": "o Provide a link on each row of the list to the URL for that row's message.",
      "ja": "o リストの各行に、その行のメッセージのURLへのリンクを提供します。"
    },
    {
      "indent": 3,
      "text": "o Add an export type that produces a file containing a list of URIs to each message in the list.",
      "ja": "o リスト内の各メッセージに、URIのリストを含むファイルを生成するエクスポートタイプを追加します。"
    },
    {
      "indent": 3,
      "text": "o Add a hint to the UI that double-clicking on a row in the list will open a single-message view of the associated message in a separate view.",
      "ja": "o リストの行をダブルクリックすると、関連付けられたメッセージの単一メッセージビューが別のビューで開くというヒントをUIに追加します。"
    },
    {
      "indent": 0,
      "text": "2.5. Improve Support for Mobile Devices",
      "section_title": true,
      "ja": "2.5. モバイルデバイスのサポートを改善する"
    },
    {
      "indent": 3,
      "text": "The current view becomes difficult to use on small displays, particularly phone displays in portrait mode. This effort will:",
      "ja": "現在のビューは、小さなディスプレイ、特にポートレートモードの電話ディスプレイでは使いにくくなります。この努力は："
    },
    {
      "indent": 3,
      "text": "o Add a responsive interface, presenting a useful interface on both small and large displays.",
      "ja": "o 応答性の高いインターフェースを追加して、小さいディスプレイと大きいディスプレイの両方で便利なインターフェースを表示します。"
    },
    {
      "indent": 0,
      "text": "2.6. Improve Use of Display Space",
      "section_title": true,
      "ja": "2.6. 表示スペースの使用を改善する"
    },
    {
      "indent": 3,
      "text": "The current view underutilizes the available display space. This effort will:",
      "ja": "現在のビューでは、利用可能な表示スペースが十分に活用されていません。この努力は："
    },
    {
      "indent": 3,
      "text": "o Make the message content the primary point of each view.",
      "ja": "o メッセージの内容を各ビューの主要なポイントにします。"
    },
    {
      "indent": 3,
      "text": "o Reduce the unused space on the display.",
      "ja": "o ディスプレイの未使用スペースを減らします。"
    },
    {
      "indent": 3,
      "text": "o Remove the filter column responsively when the display width is small.",
      "ja": "o ディスプレイの幅が狭い場合は、フィルター列を適切に削除してください。"
    },
    {
      "indent": 0,
      "text": "2.7. Use without JavaScript",
      "section_title": true,
      "ja": "2.7. JavaScriptなしで使用"
    },
    {
      "indent": 3,
      "text": "The current web-based archive search tool requires JavaScript to function. This effort will extend the tool to allow users that have disabled JavaScript in their browser to retrieve and navigate through search results using the message list and single message views.",
      "ja": "現在のWebベースのアーカイブ検索ツールが機能するには、JavaScriptが必要です。この取り組みによりツールが拡張され、ブラウザでJavaScriptを無効にしたユーザーがメッセージリストと単一メッセージビューを使用して検索結果を取得およびナビゲートできるようになります。"
    },
    {
      "indent": 3,
      "text": "This effort will not attempt to preserve all of the functionality provided with JavaScript enabled. In particular, when running with JavaScript disabled, these features will not be available:",
      "ja": "この作業では、JavaScriptが有効になっている場合に提供されるすべての機能を保持しようとはしません。特に、JavaScriptを無効にして実行している場合、これらの機能は使用できません。"
    },
    {
      "indent": 3,
      "text": "o Resizing of the message list panels.",
      "ja": "o メッセージリストパネルのサイズ変更。"
    },
    {
      "indent": 3,
      "text": "o Dynamically filtering by time, list, or from. (The filter column will not appear).",
      "ja": "o 時間、リスト、またはからの動的なフィルタリング。 （フィルター列は表示されません）。"
    },
    {
      "indent": 0,
      "text": "2.8. Administration",
      "section_title": true,
      "ja": "2.8. 行政"
    },
    {
      "indent": 3,
      "text": "This project will:",
      "ja": "このプロジェクトは："
    },
    {
      "indent": 3,
      "text": "o Add a link from the message view to the admin page for the message when logged in as an administrator.",
      "ja": "o 管理者としてログインしたときに、メッセージビューからメッセージの管理ページへのリンクを追加します。"
    },
    {
      "indent": 3,
      "text": "o Add correction of the appropriate thread indices to the handling of administrative imports of messages.",
      "ja": "o メッセージの管理インポートの処理に適切なスレッドインデックスの修正を追加します。"
    },
    {
      "indent": 3,
      "text": "o Implement a redirection handler mapping legacy archive URLs to the appropriate mailarch page.",
      "ja": "o 従来のアーカイブURLを適切なmailarchページにマッピングするリダイレクトハンドラーを実装します。"
    },
    {
      "indent": 3,
      "text": "o Make the underlying template consistent across all views presented by the tool. In particular, ensure that the correct logo as designated by the IETF Administrative Oversight Committee (IAOC) appears consistently on all views.",
      "ja": "o ツールによって表示されるすべてのビューにわたって、基になるテンプレートを一貫させます。特に、IETF管理監視委員会（IAOC）によって指定された正しいロゴがすべてのビューに一貫して表示されるようにします。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The requirements for improvement to the mailarch tool captured in this document do not introduce any exceptional security considerations. They add additional navigation points, and the implementers should consider the impact of rapid navigation using these new mechanisms (see the security considerations of [RFC6778]).",
      "ja": "このドキュメントに記載されているmailarchツールを改善するための要件には、例外的なセキュリティ上の考慮事項はありません。それらは追加のナビゲーションポイントを追加し、実装者はこれらの新しいメカニズムを使用して高速ナビゲーションの影響を考慮する必要があります（[RFC6778]のセキュリティに関する考慮事項を参照）。"
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "ja": "4. 参考文献"
    },
    {
      "indent": 0,
      "text": "4.1. Normative References",
      "section_title": true,
      "ja": "4.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC6778] Sparks, R., \"Requirements for Archiving IETF Email Lists and for Providing Web-Based Browsing and Searching\", RFC 6778, DOI 10.17487/RFC6778, October 2012, <http://www.rfc-editor.org/info/rfc6778>.",
      "ja": "[RFC6778] Sparks、R。、「IETFメールリストのアーカイブおよびWebベースのブラウジングと検索を提供するための要件」、RFC 6778、DOI 10.17487 / RFC6778、2012年10月、<http://www.rfc-editor.org/ info / rfc6778>。"
    },
    {
      "indent": 0,
      "text": "4.2. Informative References",
      "section_title": true,
      "ja": "4.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[mailarch] IETF, \"Mail Archive\", <https://mailarchive.ietf.org>.",
      "ja": "[mailarch] IETF、「メールアーカイブ」、<https://mailarchive.ietf.org>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The following people have provided particularly useful input for this document: Lou Berger, Chris Bowers, Brian Carpenter, Russ Housley, Pete Resnick, and Dale Worley.",
      "ja": "次の人々は、このドキュメントに特に有用な情報を提供してくれました。LouBerger、Chris Bowers、Brian Carpenter、Russ Housley、Pete Resnick、Dale Worley。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Robert Sparks Oracle 7460 Warren Parkway Suite 300 Frisco, Texas 75034 United States",
      "ja": "Robert Sparks Oracle 7460 Warren Parkway Suite 300フリスコ、テキサス75034アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: rjsparks@nostrum.com",
      "raw": true,
      "ja": ""
    }
  ]
}