{
  "title": {
    "text": "RFC 7332 - Loop Detection Mechanisms for Session Initiation Protocol (SIP) Back-to-Back User Agents (B2BUAs)",
    "ja": "RFC 7332 - セッション開始プロトコル（SIP）のためのループ検出メカニズムバックツーバックユーザエージェント（型B2BUA）"
  },
  "number": 7332,
  "created_at": "2019-10-31 20:19:07.472351+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         H. Kaplan\nRequest for Comments: 7332                                        Oracle\nCategory: Standards Track                                     V. Pascual\nISSN: 2070-1721                                                   Quobis\n                                                             August 2014",
      "raw": true
    },
    {
      "indent": 4,
      "text": "Loop Detection Mechanisms for Session Initiation Protocol (SIP)\n               Back-to-Back User Agents (B2BUAs)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "SIP Back-to-Back User Agents (B2BUAs) can cause unending SIP request routing loops because, as User Agent Clients, they can generate SIP requests with new Max-Forwards values. This document discusses the difficulties associated with loop detection for B2BUAs and the requirements for them to prevent infinite loops.",
      "ja": "SIPバックツーバックユーザエージェント（型B2BUA）は、ユーザエージェントクライアントとして、彼らは新しいマックス・転送した値とのSIPリクエストを生成することができ、ので、果てしないSIPリクエストのルーティングループを引き起こす可能性があります。この文書では、ループ型B2BUAのための検出、それらは無限ループを防止するための要件に関連した困難について説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7332.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7332で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Conventions . . . . . . . . . . . . . . . . . . . . . . . . .   2\n3.  Background  . . . . . . . . . . . . . . . . . . . . . . . . .   3\n4.  B2BUA Loop-Detection Behavior . . . . . . . . . . . . . . . .   3\n5.  B2BUA Max-Forwards Behavior . . . . . . . . . . . . . . . . .   4\n6.  B2BUA Max-Breadth Behavior  . . . . . . . . . . . . . . . . .   4\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .   4\n8.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .   5\n9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "SIP provides a means of preventing infinite request forwarding loops in [RFC3261], and a means of mitigating parallel forking amplification floods in [RFC5393]. Neither document normatively defines specific behavior for B2BUAs, however.",
      "ja": "SIPは、[RFC3261]に無限要求転送ループを防止する手段、及び[RFC5393]に平行フォーク増幅洪水を軽減する手段を提供します。どちらの文書は規範しかし、型B2BUAのための具体的な動作を定義します。"
    },
    {
      "indent": 3,
      "text": "Unbounded SIP request loops have actually occurred in SIP deployments numerous times. The cause of loops is usually misconfiguration, but the reason they have been unbounded/unending is they crossed B2BUAs that reset the Max-Forwards value in the SIP requests they generated on their User Agent Client (UAC) side. Although such behavior is technically legal per [RFC3261] because a B2BUA is a UAC, the resulting unbounded loops have caused service outages and make troubleshooting difficult.",
      "ja": "無制限SIPリクエストループは、実際に何度もデプロイメントSIPに発生しました。ループの原因は、通常は設定ミスですが、彼らは果てしない/無制限となっている理由は、彼らが彼らのユーザエージェントクライアント（UAC）側で生成されたSIPリクエストにマックス・フォワード値をリセット型B2BUAを越えています。そのような行動は、[RFC3261]あたりの技術的、法的ですが、B2BUAはUACであるため、結果として無限のループは、サービス停止を引き起こし、トラブルシューティングを困難にしています。"
    },
    {
      "indent": 3,
      "text": "Furthermore, [RFC5393] also provides a mechanism to mitigate the impact of parallel forking amplification issues, through the use of a \"Max-Breadth\" header field. If a B2BUA does not pass this header field on, parallel forking amplification is not mitigated with the [RFC5393] mechanism.",
      "ja": "さらに、[RFC5393]も、「最大巾」ヘッダフィールドを使用することにより、並列フォーク増幅の問題の影響を軽減するメカニズムを提供します。 B2BUAは、上でこのヘッダーフィールドを通過しない場合は、パラレルフォーキング増幅は[RFC5393]メカニズムで緩和されていません。"
    },
    {
      "indent": 3,
      "text": "This document defines normative requirements for Max-Forwards and Max-Breadth header field behaviors of B2BUAs, in order to mitigate the effect of loops and parallel forking amplification.",
      "ja": "この文書では、ループやパラレルフォーキング増幅の影響を軽減するために、最大転送し、型B2BUAの最大巾ヘッダフィールド行動のための規範的要件を定義します。"
    },
    {
      "indent": 0,
      "text": "2. Conventions",
      "section_title": true,
      "ja": "2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14、RFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "B2BUA terminology and taxonomy used in this document is based on [RFC7092].",
      "ja": "この文書で使用さB2BUAの用語と分類は、[RFC7092]に基づいています。"
    },
    {
      "indent": 0,
      "text": "3. Background",
      "section_title": true,
      "ja": "3.背景"
    },
    {
      "indent": 3,
      "text": "Within the context of B2BUAs, the scope of the SIP protocol ends at the User Agent Server (UAS) side of the B2BUA, and a new one begins on the UAC side. A B2BUA is thus capable of choosing what it wishes to do on its UAC side independently of its UAS side, and still remains compliant with [RFC3261] and its extensions. For example, any B2BUA type defined in [RFC7092] other than Proxy-B2BUA may create the SIP request on its UAC side without copying any of the Via header field values received on its UAS side. Indeed there are valid reasons for it to do so; however, this prevents the Via-based loop-detection mechanism defined in [RFC3261] and updated by [RFC5393] from detecting SIP request loops any earlier than by reaching a Max-Forwards limit.",
      "ja": "型B2BUAのコンテキスト内で、SIPプロトコルの範囲は、B2BUAのユーザエージェントサーバ（UAS）側に終了し、新しいものではUAC側で始まります。 B2BUAは、それが独立してそのUAS側のそのUAC側で行うことを希望するものを選択するように可能であり、さらに、[RFC3261]とその拡張機能に準拠したまま。例えば、プロキシB2BUA以外の[RFC7092]で定義された任意のB2BUAタイプは、フィールドの値がそのUAS側で受信Viaヘッダのいずれかをコピーせずに、そのUAC側のSIPリクエストを作成することができます。確かにそれはそうするための正当な理由があります。しかしながら、これは、最大転送し限界に達することによってより以前のSIP要求を検出すると[RFC5393]で[RFC3261]で定義され、更新されたビアベースループ検出メカニズムをループ防止します。"
    },
    {
      "indent": 3,
      "text": "Some attempts have been made by B2BUA vendors to detect request loops in other ways: by keeping track of the number of outstanding dialog-forming requests for a given caller/called URI pair; or by detecting when they receive and send their own media addressing information too many times in certain cases when they are a signaling/media-plane B2BUA; or by encoding a request instance identifier in some field they believe will pass through other nodes, and detecting when they see the same value too many times.",
      "ja": "いくつかの試みが他の方法で要求ループを検出するために、B2BUAのベンダーによって行われています。与えられ、発信者/と呼ばれるURIのペアのための優れたダイアログ形成要求の数を追跡することで、または、彼らが受け取ると、彼らは、シグナリング/メディアプレーンB2BUAているときに、特定のケースでは、独自のメディアアドレス情報を何度も送信するときに検出することで、または、彼らは他のノードを通過することになると信じて、いくつかの分野で要求インスタンス識別子をコードする、と彼らは同じ値を見ると、あまりにも多くの時間を検出することもできます。"
    },
    {
      "indent": 3,
      "text": "All of these methods are brittle and prone to error, however. They are brittle because it is very hard to accurately define when a value has been seen \"too many times\". Requests can and do fork before and after B2BUAs process them, and requests legitimately spiral in some cases, leading to incorrect determination of loops. The mechanisms are prone to error because there can be other B2BUAs in the loop's path that interfere with the particular mechanism being used.",
      "ja": "これらのメソッドのすべてがしかし、エラーに脆くなりやすいです。値が「あまりにも多くの時間を」見てきたとき、正確に定義するのは非常に困難であるので、彼らは脆いです。要求ができ、それらを処理する前と後に型B2BUAフォークを行い、そして要求が合法的にループの誤判定につながる、いくつかのケースではスパイラル。使用される特定のメカニズムに干渉するループのパス内の他の型B2BUAができるためのメカニズムは、エラーを起こしやすいです。"
    },
    {
      "indent": 3,
      "text": "Ultimately, the last defense against loops becoming unbounded is to limit how many SIP hops any request can traverse, which is the purpose of the SIP Max-Forwards field value. If B2BUAs were to at least copy and decrement the Max-Forwards header field value from their UAS to the UAC side, loops would not continue indefinitely.",
      "ja": "最終的に、無限ループになっに対する最後の防衛は、SIPは、任意の要求がSIP最大転送し、フィールド値の目的であり、通過できるホップの数を制限することです。型B2BUAは、少なくともコピーにし、そしてそれらのUASからUAC側にMax-Forwardsヘッダフィールドの値をデクリメントした場合、無期限に継続ないループ。"
    },
    {
      "indent": 0,
      "text": "4. B2BUA Loop-Detection Behavior",
      "section_title": true,
      "ja": "4. B2BUAループ検出動作"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that B2BUAs implement the loop-detection mechanism for the Via header field, as defined for a proxy in [RFC5393].",
      "ja": "[RFC5393]でプロキシについて定義した通り型B2BUAは、Viaヘッダフィールドのループ検出メカニズムを実装することが推奨されます。"
    },
    {
      "indent": 0,
      "text": "5. B2BUA Max-Forwards Behavior",
      "section_title": true,
      "ja": "5. B2BUAマックス・フォワード挙動"
    },
    {
      "indent": 3,
      "text": "This section applies for dialog-forming and out-of-dialog SIP requests. B2BUAs MAY perform the same actions for in-dialog requests, but doing so may cause issues with devices that set Max-Forwards values based upon the number of received Via or Record-Route headers.",
      "ja": "このセクションでは、ダイアログ形成し、アウトオブダイアログSIPリクエストに適用されます。型B2BUAは、インダイアログのリクエストに対して同じアクションを実行するかもしれ、そうすることまたはレコード-Routeヘッダを介して受信されたの数に基づいて、マックス・フォワード値を設定するデバイスに問題が発生することがあります。"
    },
    {
      "indent": 3,
      "text": "All B2BUA types MUST copy the received Max-Forwards header field from the received SIP request on their UAS side, to any request(s) they generate on their UAC side, and decrement the value, as if they were a proxy following the requirements described in [RFC3261].",
      "ja": "これらは説明の要件次のプロキシであるかのようにすべてのB2BUAタイプは、彼らがUAC側で生成し、その値をデクリメント任意要求（単数または複数）に、彼らのUAS側で受信したSIP要求から受け取ったMax-Forwardsヘッダーフィールドをコピーする必要があります[RFC3261]インチ"
    },
    {
      "indent": 3,
      "text": "Being a UAS, B2BUAs MUST also check the received Max-Forwards header field and reject or respond to the request if the value is zero, as defined in [RFC3261].",
      "ja": "UASである、型B2BUAは、受信したMax-Forwardsヘッダーフィールドをチェックし、拒否、または値がゼロである場合、[RFC3261]で定義されるように、要求に応答しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the received request did not contain a Max-Forwards header field, one MUST be created in any request generated in the UAC side, as described for proxies in Section 16.6, Step 3 of [RFC3261]. As in that specification, the value of the new Max-Forwards header SHOULD be 70.",
      "ja": "受信した要求がMax-Forwardsヘッダーフィールドを含んでいなかった場合、セクション16.6、[RFC3261]のステップ3においてプロキシについて説明したように、一つは、UAC側で生成された任意のリクエストで作成されなければなりません。その明細書のように、新しい最大Forwardsヘッダの値は70であるべきです。"
    },
    {
      "indent": 0,
      "text": "6. B2BUA Max-Breadth Behavior",
      "section_title": true,
      "ja": "6. B2BUAマックス・横幅の挙動"
    },
    {
      "indent": 3,
      "text": "All B2BUA types MUST copy the received Max-Breadth header field from the received SIP request on their UAS side, to any request(s) they generate on their UAC side, as if they were a proxy following the requirements described in [RFC5393].",
      "ja": "全てB2BUAタイプは、彼らが[RFC5393]で説明した要件次のプロキシであるかのように、彼らは、彼らのUAC側で生成する任意のリクエスト（単数または複数）に、彼らのUAS側で受信したSIP要求から受信した最大巾ヘッダーフィールドをコピーする必要があります。"
    },
    {
      "indent": 3,
      "text": "B2BUAs of all types MUST follow the requirements imposed on Proxies as described in Section 5.3.3 of [RFC5393], including generating the header field if none is received, limiting its maximum value, etc.",
      "ja": "等、何も受信されない場合、ヘッダフィールドを生成するその最大値を制限することを含む、[RFC5393]のセクション5.3.3に記載したように、すべてのタイプの型B2BUAは、プロキシに課される要件に従わなければなりません"
    },
    {
      "indent": 3,
      "text": "B2BUAs that generate parallel requests on their UAC side for a single incoming request on the UAS side MUST also follow the rules for Max-Breadth handling in [RFC5393] as if they were a parallel forking proxy.",
      "ja": "また、彼らは平行フォークプロキシであるかのように最大幅が[RFC5393]で処理するためのルールに従わなければならないUAS側の単一の着信要求のためのそれらのUAC側平行要求を発生型B2BUA。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The security implications for parallel forking amplification are documented in Section 7 of [RFC5393]. This document does not introduce any additional issues beyond those discussed in [RFC5393].",
      "ja": "パラレルフォーキング増幅のためのセキュリティ上の影響は、[RFC5393]のセクション7に記載されています。この文書では、[RFC5393]で説明したもの以外の追加の問題を紹介しません。"
    },
    {
      "indent": 3,
      "text": "Some B2BUAs reset the Max-Forwards and Max-Breadth header field values in order to obfuscate the number of hops a request has already traversed, as a privacy or security concern. Such goals are at odds with the mechanisms in this document, and administrators can decide which they consider more important: obfuscation vs. loop detection. In order to comply with this RFC, manufacturers MUST comply with the normative rules defined herein by default, but MAY provide user-configurable overrides as they see fit.",
      "ja": "いくつかの型B2BUAは、プライバシーやセキュリティ懸念として、要求が既に横断したホップの数を難読化するために、最大転送し、最大横幅ヘッダフィールド値をリセットします。このような目標は、この文書に記載されているメカニズムと対立しており、管理者は、彼らがより重要と考えるかを決定することができます：ループ検出対難読化。このRFCに準拠するために、メーカーは、デフォルトでは、本明細書に定義規範的なルールを遵守しなければならないが、彼らが合うように、ユーザが設定オーバーライドを提供することができます。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Brett Tate (Broadsoft), Andrew Hutton (Unify), and Anton Roman (Quobis) for their review of the document.",
      "ja": "ドキュメントの彼らのレビューのためのブレット・テイト（BroadSoftに）、アンドリュー・ハットン（統一）、およびアントン・ローマン（Quobis）に感謝します。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "ja": "[RFC3261]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\" 、RFC 3261、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5393] Sparks, R., Lawrence, S., Hawrylyshen, A., and B. Campen, \"Addressing an Amplification Vulnerability in Session Initiation Protocol (SIP) Forking Proxies\", RFC 5393, December 2008.",
      "ja": "[RFC5393]は、RFC 5393、2008年12月 \"セッション開始プロトコル（SIP）フォーキングプロキシにおける増幅脆弱性への対処\"、R.、ローレンス、S.、Hawrylyshen、A.およびB. Campenをスパーク。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC7092] Kaplan, H. and V. Pascual, \"A Taxonomy of Session Initiation Protocol (SIP) Back-to-Back User Agents\", RFC 7092, December 2013.",
      "ja": "[RFC7092]カプラン、H.及びV.パスカル、RFC 7092、2013年12月「セッション開始プロトコル（SIP）バックツーバックユーザエージェントの分類」。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Hadriel Kaplan Oracle",
      "ja": "Hadrielカプランオラクル"
    },
    {
      "indent": 3,
      "text": "EMail: hadrielk@yahoo.com",
      "ja": "メールアドレス：hadrielk@yahoo.com"
    },
    {
      "indent": 3,
      "text": "Victor Pascual Quobis",
      "ja": "ビクターパスカルQuobis"
    },
    {
      "indent": 3,
      "text": "EMail: victor.pascual@quobis.com",
      "ja": "メールアドレス：victor.pascual@quobis.com"
    }
  ]
}