{
  "title": {
    "text": "RFC 7598 - DHCPv6 Options for Configuration of Softwire Address and Port-Mapped Clients",
    "ja": "RFC 7598 - DHCPv6のオプションSoftwireアドレスとポートマップクライアントの構成について"
  },
  "number": 7598,
  "created_at": "2019-10-30 23:51:42.230258+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      T. Mrugalski\nRequest for Comments: 7598                                           ISC\nCategory: Standards Track                                       O. Troan\nISSN: 2070-1721                                            Cisco Systems\n                                                               I. Farrer\n                                                     Deutsche Telekom AG\n                                                            S. Perreault\n                                                     Jive Communications\n                                                                  W. Dec\n                                                           Cisco Systems\n                                                                  C. Bao\n                                                     Tsinghua University\n                                                                  L. Yeh\n                                                 Freelancer Technologies\n                                                                 X. Deng\n                                       The University of New South Wales\n                                                               July 2015",
      "raw": true
    },
    {
      "indent": 10,
      "text": "DHCPv6 Options for Configuration of Softwire Address\n              and Port-Mapped Clients",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies DHCPv6 options, termed Softwire46 options, for the provisioning of Softwire46 Customer Edge (CE) devices. Softwire46 is a collective term used to refer to architectures based on the notion of IPv4 Address plus Port (A+P) for providing IPv4 connectivity across an IPv6 network.",
      "ja": "この文書は、DHCPv6オプションを指定し、Softwire46カスタマーエッジ（CE）デバイスのプロビジョニングのために、Softwire46オプションと呼ばれます。 Softwire46は、IPv6ネットワークを介してIPv4接続を提供するためのIPv4アドレスとポート（A + P）の概念に基づくアーキテクチャを参照するために使用される総称です。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7598.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7598で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Conventions .....................................................3\n3. Softwire46 Overview .............................................4\n4. Common Softwire46 DHCPv6 Options ................................5\n   4.1. S46 Rule Option ............................................5\n   4.2. S46 BR Option ..............................................7\n   4.3. S46 DMR Option .............................................8\n   4.4. S46 IPv4/IPv6 Address Binding Option .......................9\n   4.5. S46 Port Parameters Option ................................10\n5. Softwire46 Containers ..........................................11\n   5.1. S46 MAP-E Container Option ................................11\n   5.2. S46 MAP-T Container Option ................................12\n   5.3. S46 Lightweight 4over6 Container Option ...................13\n6. Softwire46 Options Encapsulation ...............................14\n7. DHCPv6 Server Behavior .........................................14\n8. DHCPv6 Client Behavior .........................................14\n9. Security Considerations ........................................15\n10. IANA Considerations ...........................................16\n11. References ....................................................16\n   11.1. Normative References .....................................16\n   11.2. Informative References ...................................17\nAcknowledgements ..................................................18\nAuthors' Addresses ................................................19",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "A number of architectural solution proposals discussed in the IETF Softwire Working Group use Address plus Port (A+P) [RFC6346] as their technology base for providing IPv4 connectivity to end users using Customer Edge (CE) devices across a service provider's IPv6 network, while allowing for shared or dedicated IPv4 addressing of CEs.",
      "ja": "IETF Softwireワーキンググループで議論建築ソリューション提案の数はアドレスプラスポート（A + P）を使用して、[RFC6346]サービスプロバイダのIPv6ネットワーク全体でカスタマーエッジ（CE）デバイスを使用してエンドユーザーにIPv4接続を提供するための彼らの技術をベースとして、 CEのアドレッシング共用または専用のIPv4を可能にしつつ。"
    },
    {
      "indent": 3,
      "text": "An example is Mapping of Address and Port with Encapsulation (MAP-E) as defined in [RFC7597]. The MAP solution consists of one or more MAP Border Relay (BR) routers responsible for stateless forwarding between a MAP IPv6 domain and an IPv4 network, and one or more MAP Customer Edge (CE) routers responsible for forwarding between a user's IPv4 network and the MAP IPv6 network domain. Collectively, the MAP CE and BR form a domain when configured with common service parameters. This characteristic is common to all of the Softwire46 mechanisms.",
      "ja": "[RFC7597]で定義されるように例では、アドレスとカプセル化とポート（MAP-E）のマッピングです。 MAP溶液は、一つ以上のMAPボーダリレー（BR）MAP IPv6ドメインとIPv4ネットワークと、1つ以上のMAPカスタマエッジ（CE）は、ユーザのIPv4ネットワークとの間の転送を担当するルータ間ステートレス転送を担うルータで構成されMAP IPv6ネットワークのドメイン。共通のサービスパラメータで設定されたときまとめ、MAP CEとBRは、ドメインを形成します。この特性はSoftwire46メカニズムのすべてに共通です。"
    },
    {
      "indent": 3,
      "text": "To function in such a domain, a CE needs to be provisioned with the appropriate A+P service parameters for that domain. These consist primarily of the CE's IPv4 address and transport-layer port range(s). Furthermore, the IPv6 transport mode (i.e., encapsulation or translation) needs to be specified. Provisioning of other IPv4 configuration information not derived directly from the A+P service parameters is not covered in this document. It is expected that provisioning of other IPv4 configuration information will continue to use DHCPv4 [RFC2131].",
      "ja": "そのようなドメインで機能するように、CEは、そのドメインの適切なA + Pサービスパラメータでプロビジョニングする必要があります。これらは、主にCEのIPv4アドレス及びトランスポート層ポート範囲（S）から成ります。また、IPv6の転送モード（すなわち、カプセル化または翻訳）を指定する必要があります。 A + P・サービス・パラメータから直接派生していない他のIPv4設定情報のプロビジョニングは、この文書で覆われていません。他のIPv4設定情報のプロビジョニングのDHCPv4 [RFC2131]を使用し続けることが予想されます。"
    },
    {
      "indent": 3,
      "text": "This memo specifies a set of DHCPv6 [RFC3315] options to provision Softwire46 configuration information to CE routers. Although the focus is to deliver IPv4 service to an end-user network (such as a residential home network), it can equally be applied to an individual host acting as a CE. Configuration of the BR is out of scope for this document.",
      "ja": "このメモは、CEルータに提供Softwire46構成情報へのDHCPv6 [RFC3315]のオプションのセットを指定します。焦点は（例えば、住宅、ホームネットワークなど）エンドユーザのネットワークへのIPv4サービスを提供することであるが、それは同様にCEとして動作する個々のホストに適用することができます。 BRの設定はこの文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "2. Conventions",
      "section_title": true,
      "ja": "2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Softwire46 Overview",
      "section_title": true,
      "ja": "3. Softwire46概要"
    },
    {
      "indent": 3,
      "text": "This document describes a set of common DHCPv6 options for configuring the Mapping of Address and Port with Encapsulation (MAP-E) [RFC7597], Mapping of Address and Port using Translation (MAP-T) [RFC7599], and Lightweight 4over6 [RFC7596] mechanisms. For definitions of the terminology used in this document, please see the relevant terminology sections in [RFC7597], [RFC7599], and [RFC7596].",
      "ja": "この文書では、[RFC7596]翻訳（MAP-T）[RFC7599]、および軽量4over6を使用して、カプセル化（MAP-E）[RFC7597]でアドレスとポートのマッピングを設定するためのアドレスとポートのマッピングを共通のDHCPv6オプションのセットを記述するメカニズム。このドキュメントで使用される用語の定義については、[RFC7597]、[RFC7599]、および[RFC7596]で関連する用語のセクションを参照してください。"
    },
    {
      "indent": 3,
      "text": "MAP-E, MAP-T, and Lightweight 4over6 are essentially providing the same functionality: IPv4 service to a CE router over an IPv6-only access network. MAP-E and MAP-T may embed parts of the IPv4 address in IPv6 prefixes, thereby supporting many clients with a fixed set of mapping rules and Mesh mode (direct CE-to-CE communication). MAP-E and MAP-T CEs may also be provisioned in hub-and-spoke mode and in 1:1 mode (with no embedded address bits). The difference between MAP-E and MAP-T is that they use different means to connect to the IPv6 domain. MAP-E uses IPv4-over-IPv6 tunneling [RFC2473], while MAP-T uses IPv4-to-IPv6 translation based on [RFC6145]. Lightweight 4over6 is a hub-and-spoke IPv4-over-IPv6 tunneling mechanism, with complete independence of IPv4 and IPv6 addressing (zero embedded address bits).",
      "ja": "IPv6のみのアクセスネットワークを介したCEルータにIPv4サービス：MAP-E、MAP-T、および軽量4over6は、本質的に同じ機能を提供しています。 MAP-EおよびMAP-Tは、それによって固定マッピング規則のセット及びメッシュモード（直接CE-に-CE通信）と多数のクライアントをサポートして、IPv6プレフィックスでIPv4アドレスの部分を埋め込んでもよいです。 MAP-EおよびMAP-T CEは、ハブアンドスポークモードと1でプロビジョニングすることができる：1モード（非埋め込みアドレスビットを有します）。 MAP-EおよびMAP-Tとの違いは、彼らがIPv6ドメインに接続するための別の手段を使用することです。 MAP-Tは、[RFC6145]に基づいたIPv4対IPv6変換を使用しながら、MAP-Eは、IPv4-over-IPv6トンネルリング[RFC2473]を使用します。軽量4over6は、IPv4およびIPv6アドレスの完全独立（ゼロ埋め込みアドレスビット）を持つハブアンドスポークのIPv4オーバーのIPv6トンネリングメカニズムです。"
    },
    {
      "indent": 3,
      "text": "The DHCPv6 options described here tie the provisioning parameters, and hence the IPv4 service itself, to the End-user IPv6 prefix lifetime. The validity of a Softwire46's IPv4 address, prefix, or shared IPv4 address; port set; and any authorization and accounting are tied to the lifetime of its associated End-user IPv6 prefix.",
      "ja": "ここで説明するDHCPv6オプションは、エンドユーザのIPv6プレフィックスの寿命に、プロビジョニング・パラメータ、ひいてはIPv4サービス自体を結びます。 Softwire46のIPv4アドレス、プレフィックス、または共有IPv4アドレスの有効性。ポートセット。そして任意の許可およびアカウンティングは、それに関連するエンドユーザーのIPv6プレフィックスの寿命に関連付けられています。"
    },
    {
      "indent": 3,
      "text": "To support more than one mechanism at a time and to allow for a possibility of transition between them, the DHCPv6 Option Request Option (ORO) [RFC3315] is used. Each mechanism has a corresponding DHCPv6 container option. A DHCPv6 client can request a particular mechanism by including the option code for a particular container option in its ORO. The provisioning parameters for that mechanism are expressed by embedding the common format options within the respective container option.",
      "ja": "一度に複数のメカニズムをサポートするために、それらの間の遷移の可能性を可能にするために、DHCPv6のオプション要求オプション（ORO）[RFC3315]は使用されています。各機構は、対応するDHCPv6のコンテナオプションを持っています。 DHCPv6クライアントは、そのOROで特定のコンテナオプションのオプションコードを含めることによって、特定の機構を要求することができます。その機構のためのプロビジョニング・パラメータは、それぞれの容器のオプション内の共通フォーマットオプションを埋め込むことによって表現されます。"
    },
    {
      "indent": 3,
      "text": "This approach implies that all of the provisioning options appear only within the container options. Softwire46 DHCPv6 clients that receive provisioning options that are not encapsulated in container options MUST silently ignore these options. DHCPv6 server administrators are advised to ensure that DHCPv6 servers are configured to send these options in the proper encapsulation.",
      "ja": "このアプローチは、プロビジョニング・オプションのすべてが唯一のコンテナオプション内に表示されることを意味します。コンテナのオプションの中にカプセル化されていないプロビジョニングオプションを受け取るSoftwire46 DHCPv6クライアントは黙って、これらのオプションを無視しなければなりません。 DHCPv6サーバの管理者は、DHCPv6のサーバが適切なカプセル化にこれらのオプションを送信するように設定されていることを確認することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "This document is organized with the common encapsulated options described first (Section 4), followed by the three container options (Section 5). Some encapsulated options are mandatory in some containers, some are optional, and some are not permitted. This is shown in Table 1 (Section 6).",
      "ja": "この文書は、三の容器オプション（セクション5）続いて最初に記載共通カプセル化されたオプション（セクション4）で編成されます。いくつかのカプセル化されたオプションがいくつかは任意であり、いくつかは許可されていない、いくつかの容器に必須です。これは、表1（セクション6）に示されています。"
    },
    {
      "indent": 0,
      "text": "4. Common Softwire46 DHCPv6 Options",
      "section_title": true,
      "ja": "4.共通Softwire46 DHCPv6のオプション"
    },
    {
      "indent": 3,
      "text": "The DHCPv6 protocol is used for Softwire46 CE provisioning following regular DHCPv6 notions, with the CE assuming the role of a DHCPv6 client, and the DHCPv6 server providing options following DHCPv6 server-side policies. The format and usage of the options are defined in the following subsections.",
      "ja": "DHCPv6のプロトコルはSoftwire46 CEは、CEは、DHCPv6クライアントの役割を想定して、DHCPv6サーバがDHCPv6のサーバー側のポリシーを、次のオプションを提供し、定期的なのDHCPv6の概念次のプロビジョニングに使用されます。オプションの形式と使用法は、以下のサブセクションで定義されています。"
    },
    {
      "indent": 3,
      "text": "Each CE needs to be provisioned with enough information to calculate its IPv4 address, IPv4 prefix, or shared IPv4 address. MAP-E and MAP-T use the OPTION_S46_RULE option, while Lightweight 4over6 uses the OPTION_S46_V4V6BIND option. A CE that needs to communicate outside of the A+P domain also needs the address or prefix of the BR. MAP-E and Lightweight 4over6 use the OPTION_S46_BR option to communicate the IPv6 address of the BR. MAP-T forms an IPv6 destination address by embedding an IPv4 destination address into the BR's IPv6 prefix conveyed via the OPTION_S46_DMR option. Optionally, all mechanisms can include the OPTION_S46_PORTPARAMS option to specify parameters and port sets for the port-range algorithm.",
      "ja": "各CEは、そのIPv4アドレス、IPv4のプレフィックス、または共有IPv4アドレスを計算するのに十分な情報をプロビジョニングする必要があります。軽量4over6はOPTION_S46_V4V6BINDオプションを使用しながら、MAP-EおよびMAP-Tは、OPTION_S46_RULEオプションを使用します。 A + Pドメインの外側を通信する必要CEはまた、BRのアドレスまたはプレフィックスを必要とします。 MAP-Eと軽量4over6は、BRのIPv6アドレスを通信するOPTION_S46_BRオプションを使用します。 MAP-TはOPTION_S46_DMRオプションを介して伝達BRのIPv6プレフィックスにIPv4宛先アドレスを埋め込むことにより、IPv6宛先アドレスを形成します。必要に応じて、すべてのメカニズムは、ポート範囲のアルゴリズムのパラメータとポートセットを指定するOPTION_S46_PORTPARAMSオプションを含むことができます。"
    },
    {
      "indent": 3,
      "text": "Softwire46 options use addresses rather than Fully Qualified Domain Names (FQDNs). For the rationale behind this design choice, see Section 8 of [RFC7227].",
      "ja": "Softwire46オプションは、完全修飾ドメイン名（FQDN）ではなくアドレスを使用します。この設計上の選択の根拠については、[RFC7227]のセクション8を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.1. S46 Rule Option",
      "section_title": true,
      "ja": "4.1.  S46のルールオプション"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows the format of the S46 Rule option (OPTION_S46_RULE) used for conveying the Basic Mapping Rule (BMR) and Forwarding Mapping Rule (FMR).",
      "ja": "図1は、基本的なマッピングルール（BMR）と転送マッピングルール（FMR）を搬送するために使用S46ルールオプション（OPTION_S46_RULE）のフォーマットを示します。"
    },
    {
      "indent": 3,
      "text": "This option follows behavior described in Sections 17.1.1 and 18.1.1 of [RFC3315]. Clients can send those options, encapsulated in their respective container options, with specific values as hints for the server. See Section 5 for details. Depending on the server configuration and policy, it may accept or ignore the hints. Clients MUST be able to process received values that are different than the hints it sent earlier.",
      "ja": "このオプションは、セクション17.1.1および[RFC3315]の18.1.1で説明した動作に従います。クライアントは、サーバーのヒントなど、特定の値を使用して、それぞれのコンテナオプションでカプセル化されたそれらのオプションを、送信することができます。詳細については、第5章を参照してください。サーバーの設定とポリシーに応じて、それがヒントを受け入れるか、無視することがあります。クライアントは、それが早く送られたヒントとは異なる、受信した値を処理できなければなりません。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        OPTION_S46_RULE        |         option-length         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     flags     |     ea-len    |  prefix4-len  | ipv4-prefix   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  (continued)                  |  prefix6-len  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                           ipv6-prefix                         |\n|                       (variable length)                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n.                        S46_RULE-options                       .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 25,
      "text": "Figure 1: S46 Rule Option",
      "ja": "図1：S46のルールオプション"
    },
    {
      "indent": 3,
      "text": "o option-code: OPTION_S46_RULE (89)",
      "ja": "Oオプションコード：OPTION_S46_RULE（89）"
    },
    {
      "indent": 3,
      "text": "o option-length: length of the option, excluding option-code and option-length fields, including length of all encapsulated options; expressed in octets.",
      "ja": "Oオプションの長さ：すべてのカプセル化されたオプションの長さを含むオプションコードとオプション長フィールドを除くオプションの長さ。オクテットで表しました。"
    },
    {
      "indent": 3,
      "text": "o flags: 8 bits long; carries flags applicable to the rule. The meanings of the specific bits are explained in Figure 2.",
      "ja": "Oフラグ：8ビット長。ルールに該当するフラグを運びます。特定のビットの意味は、図2で説明されています。"
    },
    {
      "indent": 3,
      "text": "o ea-len: 8 bits long; specifies the Embedded Address (EA) bit length. Allowed values range from 0 to 48.",
      "ja": "EA-LEN O：8ビット長。埋め込みアドレス（EA）ビットの長さを指定します。使用できる値は、0から48までの範囲。"
    },
    {
      "indent": 3,
      "text": "o prefix4-len: 8 bits long; expresses the prefix length of the Rule IPv4 prefix specified in the ipv4-prefix field. Allowed values range from 0 to 32.",
      "ja": "O prefix4-LEN：8ビット長、 IPv4のプレフィックス]フィールドで指定されたルールのIPv4プレフィックスのプレフィックス長を表します。許容値は、0から32の範囲です。"
    },
    {
      "indent": 3,
      "text": "o ipv4-prefix: a fixed-length 32-bit field that specifies the IPv4 prefix for the S46 rule. The bits in the prefix after prefix4-len number of bits are reserved and MUST be initialized to zero by the sender and ignored by the receiver.",
      "ja": "O IPv4のプレフィックス：S46ルールのIPv4のプレフィックスを指定する固定長32ビットのフィールド。ビットのprefix4-LEN数た後、プレフィックスのビットは予約されており、送信者によってゼロに初期化し、受信機で無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o prefix6-len: 8 bits long; expresses the length of the Rule IPv6 prefix specified in the ipv6-prefix field. Allowed values range from 0 to 128.",
      "ja": "O prefix6-LEN：8ビット長、 IPv6のプレフィックス]フィールドで指定されたルールのIPv6プレフィックスの長さを表しています。許容値は0から128の範囲です。"
    },
    {
      "indent": 3,
      "text": "o ipv6-prefix: a variable-length field that specifies the IPv6 domain prefix for the S46 rule. The field is padded on the right with zero bits up to the nearest octet boundary when prefix6-len is not evenly divisible by 8.",
      "ja": "OのIPv6プレフィックス：S46規則のIPv6ドメインプレフィックスを指定する可変長フィールド。 prefix6-lenが8で割り切れない場合、フィールドは、最も近いオクテット境界までゼロビットで右側に埋め込まれます。"
    },
    {
      "indent": 3,
      "text": "o S46_RULE-options: a variable-length field that may contain zero or more options that specify additional parameters for this S46 rule. This document specifies one such option: OPTION_S46_PORTPARAMS.",
      "ja": "O S46_RULE-オプション：このS46のルールの追加パラメータを指定するゼロ以上のオプションを含んでいてもよい可変長フィールド。 OPTION_S46_PORTPARAMS：この文書では、そのようなオプションを指定します。"
    },
    {
      "indent": 3,
      "text": "The format of the S46 Rule Flags field is:",
      "ja": "S46ルールFlagsフィールドの形式は次のとおりです。"
    },
    {
      "indent": 29,
      "text": " 0 1 2 3 4 5 6 7\n+-+-+-+-+-+-+-+-+\n|Reserved     |F|\n+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 25,
      "text": "Figure 2: S46 Rule Flags",
      "ja": "図2：S46ルールの国旗"
    },
    {
      "indent": 3,
      "text": "o Reserved: 7 bits; reserved for future use as flags.",
      "ja": "予約O：7ビット。フラグなどの将来の使用のために予約。"
    },
    {
      "indent": 3,
      "text": "o F-flag: 1-bit field that specifies whether the rule is to be used for forwarding (FMR). If set, this rule is used as an FMR; if not set, this rule is a BMR only and MUST NOT be used for forwarding. Note: A BMR can also be used as an FMR for forwarding if the F-flag is set. The BMR is determined by a longest-prefix match of the Rule IPv6 prefix against the End-user IPv6 prefix(es).",
      "ja": "O F-フラグ：ルールは（FMR）を転送するために使用されるかどうかを指定する1ビットのフィールド。設定した場合、このルールはFMRとして使用されます。設定されていない場合は、このルールは、BMRで、転送に使用してはいけません。注：BMRはまた、F-フラグが設定されている場合、転送するためFMRとして使用することができます。 BMRは、エンドユーザーのIPv6接頭語（es）に対するルールIPv6プレフィックスの最長プレフィックス一致によって決定されます。"
    },
    {
      "indent": 3,
      "text": "It is expected that in a typical mesh deployment scenario there will be a single BMR, which could also be designated as an FMR using the F-flag.",
      "ja": "典型的なメッシュ展開シナリオでも、F-フラグを使用してFMRとして指定することができる単一BMR、が存在するであろうことが予想されます。"
    },
    {
      "indent": 0,
      "text": "4.2. S46 BR Option",
      "section_title": true,
      "ja": "4.2.  S46 BRオプション"
    },
    {
      "indent": 3,
      "text": "The S46 BR option (OPTION_S46_BR) is used to convey the IPv6 address of the Border Relay. Figure 3 shows the format of the OPTION_S46_BR option.",
      "ja": "S46 BRオプション（OPTION_S46_BRは）ボーダーリレーのIPv6アドレスを伝えるために使用されます。図3は、OPTION_S46_BRオプションのフォーマットを示します。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         OPTION_S46_BR         |         option-length         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      br-ipv6-address                          |\n|                                                               |\n|                                                               |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 26,
      "text": "Figure 3: S46 BR Option",
      "ja": "図3：S46 BRオプション"
    },
    {
      "indent": 3,
      "text": "o option-code: OPTION_S46_BR (90)",
      "ja": "Oオプションコード：OPTION_S46_BR（90）"
    },
    {
      "indent": 3,
      "text": "o option-length: 16 o br-ipv6-address: a fixed-length field of 16 octets that specifies the IPv6 address for the S46 BR.",
      "ja": "Oオプションの長さ：16 O BR-のIPv6アドレス：S46 BRのIPv6アドレスを指定する16オクテットの固定長フィールド。"
    },
    {
      "indent": 3,
      "text": "BR redundancy can be implemented by using an anycast address for the BR IPv6 address. Multiple OPTION_S46_BR options MAY be included in the container; this document does not further explore the use of multiple BR IPv6 addresses.",
      "ja": "BRの冗長性は、BRのIPv6アドレスのエニーキャストアドレスを使用して実施することができます。複数のOPTION_S46_BRオプションは、コンテナに含まれるかもしれ。この文書では、さらに、複数のBRのIPv6アドレスの使用を検討しません。"
    },
    {
      "indent": 0,
      "text": "4.3. S46 DMR Option",
      "section_title": true,
      "ja": "4.3.  S46 DMRオプション"
    },
    {
      "indent": 3,
      "text": "The S46 DMR option (OPTION_S46_DMR) is used to convey values for the Default Mapping Rule (DMR). Figure 4 shows the format of the OPTION_S46_DMR option used for conveying a DMR.",
      "ja": "S46 DMRオプション（OPTION_S46_DMR）はデフォルトのマッピング・ルール（DMR）の値を伝えるために使用されます。図4は、DMRを搬送するために使用OPTION_S46_DMRオプションのフォーマットを示します。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        OPTION_S46_DMR         |         option-length         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|dmr-prefix6-len|            dmr-ipv6-prefix                    |\n+-+-+-+-+-+-+-+-+           (variable length)                   |\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 25,
      "text": "Figure 4: S46 DMR Option",
      "ja": "図4：S46 DMRオプション"
    },
    {
      "indent": 3,
      "text": "o option-code: OPTION_S46_DMR (91)",
      "ja": "Oオプションコード：OPTION_S46_DMR（91）"
    },
    {
      "indent": 3,
      "text": "o option-length: 1 + length of dmr-ipv6-prefix specified in octets.",
      "ja": "oオプションの長さ：オクテットで指定されたDMR-たIPv6プレフィックスの1つの+長さ。"
    },
    {
      "indent": 3,
      "text": "o dmr-prefix6-len: 8 bits long; expresses the bitmask length of the IPv6 prefix specified in the dmr-ipv6-prefix field. Allowed values range from 0 to 128.",
      "ja": "O DMR-prefix6-LEN：8ビット長。 DMR-のIPv6プレフィックス]フィールドに指定したIPv6プレフィックスのビットマスクの長さを表しています。許容値は0から128の範囲です。"
    },
    {
      "indent": 3,
      "text": "o dmr-ipv6-prefix: a variable-length field specifying the IPv6 prefix or address for the BR. This field is right-padded with zeros to the nearest octet boundary when dmr-prefix6-len is not divisible by 8.",
      "ja": "O-DMRのIPv6プレフィクス：BRのIPv6プレフィックスまたはアドレスを指定する可変長フィールド。このフィールドは、DMR-prefix6-lenは8で割り切れない最も近いオクテット境界までゼロが右詰めです。"
    },
    {
      "indent": 0,
      "text": "4.4. S46 IPv4/IPv6 Address Binding Option",
      "section_title": true,
      "ja": "4.4. オプションのバインドS46のIPv4 / IPv6アドレス"
    },
    {
      "indent": 3,
      "text": "The S46 IPv4/IPv6 Address Binding option (OPTION_S46_V4V6BIND) MAY be used to specify the full or shared IPv4 address of the CE. The IPv6 prefix field is used by the CE to identify the correct prefix to use for the tunnel source.",
      "ja": "S46のIPv4 / IPv6アドレスのバインドオプション（OPTION_S46_V4V6BIND）はCEのフルまたは共有IPv4アドレスを指定するために使用されるかもしれません。 IPv6プレフィックスフィールドは、トンネルソースに使用する正しいプレフィックスを識別するためにCEによって使用されます。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      OPTION_S46_V4V6BIND      |         option-length         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         ipv4-address                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|bindprefix6-len|             bind-ipv6-prefix                  |\n+-+-+-+-+-+-+-+-+             (variable length)                 |\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n.                      S46_V4V6BIND-options                     .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Figure 5: S46 IPv4/IPv6 Address Binding Option",
      "ja": "図5：S46のIPv4 / IPv6アドレスのバインドオプション"
    },
    {
      "indent": 3,
      "text": "o option-code: OPTION_S46_V4V6BIND (92)",
      "ja": "Oオプションコード：OPTION_S46_V4V6BIND（92）"
    },
    {
      "indent": 3,
      "text": "o option-length: length of the option, excluding option-code and option-length fields, including length of all encapsulated options; expressed in octets.",
      "ja": "Oオプションの長さ：すべてのカプセル化されたオプションの長さを含むオプションコードとオプション長フィールドを除くオプションの長さ。オクテットで表しました。"
    },
    {
      "indent": 3,
      "text": "o ipv4-address: a fixed-length field of 4 octets specifying an IPv4 address.",
      "ja": "入出力のIPv4アドレス：IPv4アドレスを指定する4つのオクテットの固定長フィールド。"
    },
    {
      "indent": 3,
      "text": "o bindprefix6-len: 8 bits long; expresses the bitmask length of the IPv6 prefix specified in the bind-ipv6-prefix field. Allowed values range from 0 to 128.",
      "ja": "O bindprefix6-LEN：8ビット長。バインドのIPv6プレフィックス]フィールドに指定したIPv6プレフィックスのビットマスクの長さを表しています。許容値は0から128の範囲です。"
    },
    {
      "indent": 3,
      "text": "o bind-ipv6-prefix: a variable-length field specifying the IPv6 prefix or address for the S46 CE. This field is right-padded with zeros to the nearest octet boundary when bindprefix6-len is not divisible by 8.",
      "ja": "OバインドのIPv6プレフィックスを：S46のCEのためのIPv6プレフィックスまたはアドレスを指定して可変長フィールドを。このフィールドはbindprefix6-lenは8で割り切れない最も近いオクテット境界までゼロが右詰めです。"
    },
    {
      "indent": 3,
      "text": "o S46_V4V6BIND-options: a variable-length field that may contain zero or more options that specify additional parameters. This document specifies one such option: OPTION_S46_PORTPARAMS.",
      "ja": "O S46_V4V6BIND-オプション：追加のパラメータを指定するゼロ以上のオプションを含んでいてもよい可変長フィールド。 OPTION_S46_PORTPARAMS：この文書では、そのようなオプションを指定します。"
    },
    {
      "indent": 0,
      "text": "4.5. S46 Port Parameters Option",
      "section_title": true,
      "ja": "4.5.  S46ポートパラメータオプション"
    },
    {
      "indent": 3,
      "text": "The S46 Port Parameters option (OPTION_S46_PORTPARAMS) specifies optional port set information that MAY be provided to CEs.",
      "ja": "S46ポートパラメータオプション（OPTION_S46_PORTPARAMS）は、オプションのポートをCEに提供することができる情報を設定して指定します。"
    },
    {
      "indent": 3,
      "text": "See Section 5.1 of [RFC7597] for a description of the MAP algorithm and detailed explanation of all of the parameters.",
      "ja": "MAPアルゴリズムやパラメータのすべての詳細な説明の詳細については、[RFC7597]のセクション5.1を参照してください。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     OPTION_S46_PORTPARAMS     |         option-length         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   offset      |    PSID-len   |              PSID             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 6: S46 Port Parameters Option",
      "ja": "図6：S46ポートパラメータオプション"
    },
    {
      "indent": 3,
      "text": "o option-code: OPTION_S46_PORTPARAMS (93)",
      "ja": "oオプションコード：OPTION_S46_PORTPARAMS（93）"
    },
    {
      "indent": 3,
      "text": "o option-length: 4",
      "ja": "oオプションの長さ：4"
    },
    {
      "indent": 3,
      "text": "o offset: Port Set Identifier (PSID) offset. 8 bits long; specifies the numeric value for the S46 algorithm's excluded port range/ offset bits (a-bits), as per Section 5.1 of [RFC7597]. Allowed values are between 0 and 15. Default values for this field are specific to the softwire mechanism being implemented and are defined in the relevant specification document.",
      "ja": "Oオフセット：ポートセット識別子（PSID）オフセットを。 8ビット長、 [RFC7597]のセクション5.1の通りS46アルゴリズムの除外ポートレンジ/オフセットビット（ビット）の数値を指定します。許容値は、このフィールドに0〜15のデフォルト値は実装さsoftwire機構に固有であり、関連仕様書で定義されています。"
    },
    {
      "indent": 3,
      "text": "o PSID-len: 8 bits long; specifies the number of significant bits in the PSID field (also known as 'k'). When set to 0, the PSID field is to be ignored. After the first 'a' bits, there are k bits in the port number representing the value of the PSID. Consequently, the address-sharing ratio would be 2^k.",
      "ja": "入出力PSID-LEN：8ビット長。 （また、「K」として知られている）PSIDフィールドの最下位ビットの数を指定します。 0に設定すると、PSIDフィールドは無視されます。第一「」のビットの後、PSIDの値を表すポート番号におけるkビットがあります。これにより、アドレス共有比が2 ^ Kであろう。"
    },
    {
      "indent": 3,
      "text": "o PSID: 16 bits long. The PSID value algorithmically identifies a set of ports assigned to a CE. The first k bits on the left of this field contain the PSID binary value. The remaining (16 - k) bits on the right are padding zeros.",
      "ja": "入出力PSID：16ビット長。 PSID値がアルゴリズムCEに割り当てられたポートのセットを識別する。このフィールドの左側の最初のkビットは、PSIDバイナリ値を含みます。 （16  -  K）、残りの右側のビットはパディングゼロです。"
    },
    {
      "indent": 3,
      "text": "When receiving the OPTION_S46_PORTPARAMS option with an explicit PSID, the client MUST use this explicit PSID when configuring its softwire interface. The OPTION_S46_PORTPARAMS option with an explicit PSID MUST be discarded if the S46 CE isn't configured with a full IPv4 address (e.g., IPv4 prefix).",
      "ja": "明示的なPSIDとOPTION_S46_PORTPARAMSオプションを受信すると、そのsoftwireインタフェースを設定する際に、クライアントは、この明示的なPSIDを使用しなければなりません。 S46 CEが全IPv4アドレス（例えば、IPv4のプレフィックス）で構成されていない場合、明示的なPSIDとOPTION_S46_PORTPARAMSオプションを捨てなければなりません。"
    },
    {
      "indent": 3,
      "text": "The OPTION_S46_PORTPARAMS option is contained within an OPTION_S46_RULE option or an OPTION_S46_V4V6BIND option.",
      "ja": "OPTION_S46_PORTPARAMSオプションはOPTION_S46_RULEオプションまたはOPTION_S46_V4V6BINDオプションの中に含まれています。"
    },
    {
      "indent": 0,
      "text": "5. Softwire46 Containers",
      "section_title": true,
      "ja": "5. Softwire46コンテナ"
    },
    {
      "indent": 0,
      "text": "5.1. S46 MAP-E Container Option",
      "section_title": true,
      "ja": "5.1.  S46 MAP-Eコンテナオプション"
    },
    {
      "indent": 3,
      "text": "The S46 MAP-E Container option (OPTION_S46_CONT_MAPE) specifies the container used to group all rules and optional port parameters for a specified domain.",
      "ja": "S46 MAP-Eコンテナオプション（OPTION_S46_CONT_MAPE）がグループに使用コンテナすべてのルールと、指定されたドメインのオプションのポートパラメータを指定します。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        OPTION_S46_CONT_MAPE   |         option-length         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n.            encapsulated-options (variable length)             .\n.                                                               .\n+---------------------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 7: S46 MAP-E Container Option",
      "ja": "図7：S46 MAP-Eコンテナオプション"
    },
    {
      "indent": 3,
      "text": "o option-code: OPTION_S46_CONT_MAPE (94)",
      "ja": "Oオプションコード：OPTION_S46_CONT_MAPE（94）"
    },
    {
      "indent": 3,
      "text": "o option-length: length of encapsulated options, expressed in octets.",
      "ja": "Oオプションの長さ：カプセル化されたオプションの長さは、オクテット単位で表されます。"
    },
    {
      "indent": 3,
      "text": "o encapsulated-options: options associated with this Softwire46 MAP-E domain.",
      "ja": "O-カプセル化オプション：このSoftwire46 MAP-Eのドメインに関連付けられたオプション。"
    },
    {
      "indent": 3,
      "text": "The encapsulated-options field conveys options specific to the OPTION_S46_CONT_MAPE option. Currently, there are two encapsulated options specified: OPTION_S46_RULE and OPTION_S46_BR. There MUST be at least one OPTION_S46_RULE option and at least one OPTION_S46_BR option.",
      "ja": "カプセル化され、オプションフィールドはOPTION_S46_CONT_MAPEオプションに固有のオプションを伝えます。 OPTION_S46_RULEとOPTION_S46_BR：現在、指定された2つのカプセル化のオプションがあります。少なくとも一つのOPTION_S46_RULEオプションと少なくとも1つのOPTION_S46_BRオプションがあるに違いありません。"
    },
    {
      "indent": 3,
      "text": "Other options applicable to a domain may be defined in the future. A DHCPv6 message MAY include multiple OPTION_S46_CONT_MAPE options (representing multiple domains).",
      "ja": "ドメインに適用されるその他のオプションは、将来的に定義されてもよいです。 DHCPv6のメッセージは、（複数のドメインを表す）複数OPTION_S46_CONT_MAPEオプションを含むかもしれません。"
    },
    {
      "indent": 0,
      "text": "5.2. S46 MAP-T Container Option",
      "section_title": true,
      "ja": "5.2.  S46 MAP-Tコンテナオプション"
    },
    {
      "indent": 3,
      "text": "The S46 MAP-T Container option (OPTION_S46_CONT_MAPT) specifies the container used to group all rules and optional port parameters for a specified domain.",
      "ja": "S46 MAP-Tコンテナオプション（OPTION_S46_CONT_MAPT）グループに使用される容器すべてのルールと指定されたドメインの任意のポートパラメータを指定します。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     OPTION_S46_CONT_MAPT      |         option-length         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n.            encapsulated-options (variable length)             .\n.                                                               .\n+---------------------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 8: S46 MAP-T Container Option",
      "ja": "図8：S46 MAP-Tコンテナオプション"
    },
    {
      "indent": 3,
      "text": "o option-code: OPTION_S46_CONT_MAPT (95)",
      "ja": "Oオプションコード：OPTION_S46_CONT_MAPT（95）"
    },
    {
      "indent": 3,
      "text": "o option-length: length of encapsulated options, expressed in octets.",
      "ja": "Oオプションの長さ：カプセル化されたオプションの長さは、オクテット単位で表されます。"
    },
    {
      "indent": 3,
      "text": "o encapsulated-options: options associated with this Softwire46 MAP-T domain.",
      "ja": "O-カプセル化オプション：このSoftwire46 MAP-Tドメインに関連付けられたオプション。"
    },
    {
      "indent": 3,
      "text": "The encapsulated-options field conveys options specific to the OPTION_S46_CONT_MAPT option. Currently, there are two options specified: the OPTION_S46_RULE and OPTION_S46_DMR options. There MUST be at least one OPTION_S46_RULE option and exactly one OPTION_S46_DMR option.",
      "ja": "カプセル化され、オプションフィールドはOPTION_S46_CONT_MAPTオプションに固有のオプションを伝えます。 OPTION_S46_RULEとOPTION_S46_DMRオプション：現在、指定された2つのオプションがあります。少なくとも一つのOPTION_S46_RULEオプションと正確に一つのOPTION_S46_DMRオプションがあるに違いありません。"
    },
    {
      "indent": 0,
      "text": "5.3. S46 Lightweight 4over6 Container Option",
      "section_title": true,
      "ja": "5.3.  S46軽量4over6コンテナオプション"
    },
    {
      "indent": 3,
      "text": "The S46 Lightweight 4over6 Container option (OPTION_S46_CONT_LW) specifies the container used to group all rules and optional port parameters for a specified domain.",
      "ja": "S46軽量4over6コンテナオプション（OPTION_S46_CONT_LW）は、すべてのルールとオプションのポートパラメータを指定されたドメインのグループに使用されるコンテナを指定します。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      OPTION_S46_CONT_LW       |         option-length         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n+            encapsulated-options (variable length)             .\n.                                                               .\n+---------------------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Figure 9: S46 Lightweight 4over6 Container Option",
      "ja": "図9：S46軽量4over6コンテナオプション"
    },
    {
      "indent": 3,
      "text": "o option-code: OPTION_S46_CONT_LW (96)",
      "ja": "Oオプションコード：OPTION_S46_CONT_LW（96）"
    },
    {
      "indent": 3,
      "text": "o option-length: length of encapsulated options, expressed in octets.",
      "ja": "Oオプションの長さ：カプセル化されたオプションの長さは、オクテット単位で表されます。"
    },
    {
      "indent": 3,
      "text": "o encapsulated-options: options associated with this Softwire46 Lightweight 4over6 domain.",
      "ja": "O-カプセル化オプション：このSoftwire46軽量4over6ドメインに関連付けられたオプション。"
    },
    {
      "indent": 3,
      "text": "The encapsulated-options field conveys options specific to the OPTION_S46_CONT_LW option. Currently, there are two options specified: OPTION_S46_V4V6BIND and OPTION_S46_BR. There MUST be at most one OPTION_S46_V4V6BIND option and at least one OPTION_S46_BR option.",
      "ja": "カプセル化され、オプションフィールドはOPTION_S46_CONT_LWオプションに固有のオプションを伝えます。 OPTION_S46_V4V6BINDとOPTION_S46_BR：現在、指定された2つのオプションがあります。高々1つのOPTION_S46_V4V6BINDオプションと少なくとも1つのOPTION_S46_BRオプションがあるに違いありません。"
    },
    {
      "indent": 0,
      "text": "6. Softwire46 Options Encapsulation",
      "section_title": true,
      "ja": "6. Softwire46オプションのカプセル化"
    },
    {
      "indent": 3,
      "text": "The table below shows which encapsulated options are mandatory, optional, or not permitted for each defined container option.",
      "ja": "オプションのカプセル化された下表は、必須のオプション、または定義された各コンテナオプションで許可されていません。"
    },
    {
      "indent": 6,
      "text": "+-----------------------+-------+-------+--------------------+\n| Option                | MAP-E | MAP-T | Lightweight 4over6 |\n+-----------------------+-------+-------+--------------------+\n| OPTION_S46_RULE       |   M   |   M   |        N/P         |\n| OPTION_S46_BR         |   M   |  N/P  |         M          |\n| OPTION_S46_PORTPARAMS |   O   |   O   |         O          |\n| OPTION_S46_DMR        |  N/P  |   M   |        N/P         |\n| OPTION_S46_V4V6BIND   |  N/P  |  N/P  |         O          |\n+-----------------------+-------+-------+--------------------+",
      "raw": true
    },
    {
      "indent": 13,
      "text": "M - Mandatory, O - Optional, N/P - Not Permitted",
      "ja": "M  -  N / P、オプション -   -  O、必須許可しません]"
    },
    {
      "indent": 18,
      "text": "Table 1: Options for Container Mappings",
      "ja": "表1：コンテナマッピングのオプション"
    },
    {
      "indent": 3,
      "text": "Softwire46 DHCPv6 clients that receive container options that violate any of the above rules MUST silently ignore such container options.",
      "ja": "上記の規則に違反した容器のオプションを受け取るSoftwire46 DHCPv6クライアントは黙ってこのような容器のオプションを無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "7. DHCPv6 Server Behavior",
      "section_title": true,
      "ja": "7. DHCPv6のサーバーの動作"
    },
    {
      "indent": 3,
      "text": "Section 17.2.2 of [RFC3315] describes how a DHCPv6 client and server negotiate configuration values using the ORO. As a convenience for the reader, we mention here that by default a server will not reply with a Softwire46 container option if the client has not explicitly enumerated one in its ORO.",
      "ja": "[RFC3315]のセクション17.2.2は、DHCPv6クライアントとサーバがOROを使用して設定値を交渉する方法を説明します。読者の利便性として、我々は、クライアントが明示的にOROでものを列挙していない場合、デフォルトでは、サーバーがSoftwire46コンテナオプションを指定して返信しないことをここで言及します。"
    },
    {
      "indent": 3,
      "text": "A CE router may support several (or all) of the mechanisms mentioned here. In the case where a client requests multiple mechanisms in its ORO, the server will reply with the corresponding Softwire46 container options for which it has configuration information.",
      "ja": "CEルータは、ここに述べたメカニズムのいくつか（またはすべて）をサポートすることができます。クライアントがOROで複数の機構を要求する場合、サーバは、構成情報を持っている対応Softwire46コンテナオプションで応答します。"
    },
    {
      "indent": 0,
      "text": "8. DHCPv6 Client Behavior",
      "section_title": true,
      "ja": "8. DHCPv6のクライアントの動作"
    },
    {
      "indent": 3,
      "text": "An S46 CE acting as a DHCPv6 client will request S46 configuration parameters from the DHCPv6 server located in the IPv6 network. Such a client MUST request the S46 container option(s) that it is configured for in its ORO in SOLICIT, REQUEST, RENEW, REBIND, and INFORMATION-REQUEST messages.",
      "ja": "S46 CEは、IPv6ネットワークに配置DHCPv6サーバからS46の設定パラメータを要求しますDHCPv6クライアントとして動作します。このようなクライアントは、それはSOLICIT、REQUESTにそのOROにするために構成されていることをS46コンテナオプション（複数可）を要求するRENEW、REBIND、およびINFORMATION-REQUESTメッセージをしなければなりません。"
    },
    {
      "indent": 3,
      "text": "When processing received S46 container options, the following behavior is expected:",
      "ja": "受信S46コンテナのオプションを処理する際に、次のような動作が期待されています。"
    },
    {
      "indent": 3,
      "text": "o A client MUST support processing multiple received OPTION_S46_RULE options in a container OPTION_S46_CONT_MAPE or OPTION_S46_CONT_MAPT option.",
      "ja": "O処理複数をサポートしなければならないクライアントは、コンテナOPTION_S46_CONT_MAPEまたはOPTION_S46_CONT_MAPTオプションでOPTION_S46_RULEオプションを受け取りました。"
    },
    {
      "indent": 3,
      "text": "o A client receiving an unsupported S46 option or an invalid parameter value SHOULD discard that S46 container option and log the event.",
      "ja": "OサポートされていないS46オプションまたは無効なパラメータ値を受信するクライアントは、そのS46コンテナオプションを破棄し、イベントをログに記録すべきです。"
    },
    {
      "indent": 3,
      "text": "The behavior of a client that supports multiple Softwire46 mechanisms is out of scope for this document. [Unified-v4-in-v6] describes client behavior for the prioritization and handling of multiple mechanisms simultaneously.",
      "ja": "複数Softwire46メカニズムをサポートしているクライアントの動作はこの文書の範囲外です。 [統合-V4-で-V6]同時に複数のメカニズムの優先順位付けと取り扱いのためのクライアントの動作を説明します。"
    },
    {
      "indent": 3,
      "text": "Note that a system implementing CE functionality may have multiple network interfaces, and these interfaces may be configured differently; some may be connected to networks using a Softwire46 mechanism, and some may be connected to networks that are using normal dual-stack or other means. The CE should approach this specification on an interface-by-interface basis. For example, if the CE system is MAP-E capable and is attached to multiple networks that provide the OPTION_S46_CONT_MAPE option, then the CE MUST configure MAP-E for each interface separately.",
      "ja": "CE機能を実装するシステムが複数のネットワークインターフェイスを有していてもよく、これらのインタフェースは、異なって構成されてもよいことに留意されたいです。いくつかSoftwire46メカニズムを使用してネットワークに接続することができる、いくつかは通常、デュアルスタックまたは他の手段を使用しているネットワークに接続されてもよいです。 CEは、イン​​ターフェイスごとに、本明細書に近づくべきです。 CEシステムは、MAP-E可能であり、OPTION_S46_CONT_MAPEオプションを提供する複数のネットワークに接続されている場合、例えば、その後、CEは別々に各インターフェイスのためにMAP-E設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Failure modes are out of scope for this document. Failure recovery mechanisms may be defined in the future. See Section 5 of [RFC7597] for a discussion of valid MAP Rule combinations. See Section 11 of [RFC7227] and Sections 18.1.3, 18.1.4, and 19.1 of [RFC3315] for parameter-update mechanisms in DHCPv6 that can be leveraged to update configuration after a failure.",
      "ja": "故障モードはこの文書の範囲外です。障害回復メカニズムは、将来的に定義されてもよいです。有効なMAP規則の組み合わせの議論については、[RFC7597]のセクション5を参照してください。障害発生後に設定を更新するために利用することができるのDHCPv6におけるパラメータ更新メカニズムのために[RFC7227]のセクション11とセクション18.1.3、18.1.4、および[RFC3315]の19.1を参照。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Section 23 of [RFC3315] discusses DHCPv6-related security issues.",
      "ja": "[RFC3315]のセクション23は、DHCPv6の関連のセキュリティ問題について説明します。"
    },
    {
      "indent": 3,
      "text": "As with all DHCPv6-derived configuration states, it is possible that configuration is actually being delivered by a third party (Man in the Middle). As such, there is no basis on which access over MAP or Lightweight 4over6 can be trusted. Therefore, softwires should not bypass any security mechanisms such as IP firewalls.",
      "ja": "すべてのDHCPv6由来の構成状態と同様に、コンフィギュレーションが実際に第三者（中間者）によって配信されている可能性があります。そのため、信頼できるMAPや軽量4over6の上にアクセスするには根拠がありません。したがって、softwiresは、IPファイアウォールのような任意のセキュリティメカニズムをバイパスしてはなりません。"
    },
    {
      "indent": 3,
      "text": "In IPv6-only networks that lack IPv4 firewalls, a device that supports MAP could be tricked into enabling its IPv4 stack and directing IPv4 traffic to the attacker, thus exposing itself to previously infeasible IPv4 attack vectors.",
      "ja": "IPv4のファイアウォールを欠くIPv6のみのネットワークでは、MAPをサポートするデバイスは、このように以前に実行不可能のIPv4攻撃ベクトルにそれ自身を露出する、そのIPv4スタックを有効にし、攻撃者にIPv4トラフィックを向けるようにだまされる可能性があります。"
    },
    {
      "indent": 3,
      "text": "Section 10 of [RFC7597] discusses security issues related to the MAP-E mechanism, Section 9 of [RFC7596] discusses security issues related to the Lightweight 4over6 mechanism, and Section 13 of [RFC7599] discusses security issues related to the MAP-T mechanism.",
      "ja": "[RFC7597]のセクション10は、MAP-E機構に関連するセキュリティ問題について説明し、[RFC7596]のセクション9は、軽量4over6機構に関連するセキュリティ問題について説明し、[RFC7599]のセクション13は、MAP-Tメカニズムに関連するセキュリティ問題について説明し。"
    },
    {
      "indent": 3,
      "text": "Readers concerned with the security of Softwire46 provisioning over DHCPv6 are encouraged to read [Secure-DHCPv6].",
      "ja": "DHCPv6の上Softwire46プロビジョニングのセキュリティに関する読者は、[セキュアのDHCPv6]を読み取ることが奨励されます。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "ja": "10. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has allocated the following DHCPv6 option codes:",
      "ja": "IANAは、次のDHCPv6オプションコードを割り当てています。"
    },
    {
      "indent": 6,
      "text": "89 for OPTION_S46_RULE",
      "ja": "OPTION_S46_RULE 89"
    },
    {
      "indent": 6,
      "text": "90 for OPTION_S46_BR",
      "ja": "OPTION_S46_BR 90"
    },
    {
      "indent": 6,
      "text": "91 for OPTION_S46_DMR",
      "ja": "OPTION_S46_DMRのための91"
    },
    {
      "indent": 6,
      "text": "92 for OPTION_S46_V4V6BIND",
      "ja": "OPTION_S46_V4V6BIND 92"
    },
    {
      "indent": 6,
      "text": "93 for OPTION_S46_PORTPARAMS",
      "ja": "OPTION_S46_PORTPARAMS 93"
    },
    {
      "indent": 6,
      "text": "94 for OPTION_S46_CONT_MAPE",
      "ja": "OPTION_S46_CONT_MAPE 94"
    },
    {
      "indent": 6,
      "text": "95 for OPTION_S46_CONT_MAPT",
      "ja": "OPTION_S46_CONT_MAPT 95"
    },
    {
      "indent": 6,
      "text": "96 for OPTION_S46_CONT_LW",
      "ja": "OPTION_S46_CONT_LW 96"
    },
    {
      "indent": 3,
      "text": "All values have been added to the \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\" option code space defined in Section 24.3 of [RFC3315].",
      "ja": "すべての値は、「IPv6の動的ホスト構成プロトコル（DHCPv6）」[RFC3315]のセクション24.3で定義されたオプションコードスペースに追加されました。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3315] Droms, R., Ed., Bound, J., Volz, B., Lemon, T., Perkins, C., and M. Carney, \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\", RFC 3315, DOI 10.17487/RFC3315, July 2003, <http://www.rfc-editor.org/info/rfc3315>.",
      "ja": "[RFC3315] Droms、R.、編、バウンド、J.、フォルツ、B.、レモン、T.、パーキンス、C.、およびM.カーニー、 \"IPv6のための動的ホスト構成プロトコル（DHCPv6）\"、RFC 3315 、DOI 10.17487 / RFC3315、2003年7月、<http://www.rfc-editor.org/info/rfc3315>。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2131] Droms, R., \"Dynamic Host Configuration Protocol\", RFC 2131, DOI 10.17487/RFC2131, March 1997, <http://www.rfc-editor.org/info/rfc2131>.",
      "ja": "[RFC2131] Droms、R.、 \"動的ホスト構成プロトコル\"、RFC 2131、DOI 10.17487 / RFC2131、1997年3月、<http://www.rfc-editor.org/info/rfc2131>。"
    },
    {
      "indent": 3,
      "text": "[RFC2473] Conta, A. and S. Deering, \"Generic Packet Tunneling in IPv6 Specification\", RFC 2473, DOI 10.17487/RFC2473, December 1998, <http://www.rfc-editor.org/info/rfc2473>.",
      "ja": "[RFC2473]コンタ、A.、およびS.デアリング、 \"IPv6の仕様の汎用パケットトンネリング\"、RFC 2473、DOI 10.17487 / RFC2473、1998年12月、<http://www.rfc-editor.org/info/rfc2473>。"
    },
    {
      "indent": 3,
      "text": "[RFC6145] Li, X., Bao, C., and F. Baker, \"IP/ICMP Translation Algorithm\", RFC 6145, DOI 10.17487/RFC6145, April 2011, <http://www.rfc-editor.org/info/rfc6145>.",
      "ja": "[RFC6145]のLi、X.、バオ、C.、およびF.ベイカー、 \"IP / ICMP翻訳アルゴリズム\"、RFC 6145、DOI 10.17487 / RFC6145、2011年4月、<http://www.rfc-editor.org/情報/ rfc6145>。"
    },
    {
      "indent": 3,
      "text": "[RFC6346] Bush, R., Ed., \"The Address plus Port (A+P) Approach to the IPv4 Address Shortage\", RFC 6346, DOI 10.17487/RFC6346, August 2011, <http://www.rfc-editor.org/info/rfc6346>.",
      "ja": "[RFC6346]ブッシュ、R.、エド、 \"住所プラスIPv4アドレスの不足にポート（A + P）アプローチ\"、RFC 6346、DOI 10.17487 / RFC6346、2011年8月、<のhttp：。//www.rfc-editor .ORG /情報/ rfc6346>。"
    },
    {
      "indent": 3,
      "text": "[RFC7227] Hankins, D., Mrugalski, T., Siodelski, M., Jiang, S., and S. Krishnan, \"Guidelines for Creating New DHCPv6 Options\", BCP 187, RFC 7227, DOI 10.17487/RFC7227, May 2014, <http://www.rfc-editor.org/info/rfc7227>.",
      "ja": "[RFC7227]ハンキンズ、D.、Mrugalski、T.、Siodelski、M.、江、S.、およびS.クリシュナン、 \"新しいDHCPv6のオプションを作成するためのガイドライン\"、BCP 187、RFC 7227、DOI 10.17487 / RFC7227、2014年5月、<http://www.rfc-editor.org/info/rfc7227>。"
    },
    {
      "indent": 3,
      "text": "[RFC7596] Cui, Y., Sun, Q., Boucadair, M., Tsou, T., Lee, Y., and I. Farrer, \"Lightweight 4over6: An Extension to the Dual-Stack Lite Architecture\", RFC 7596, DOI 10.17487/RFC7596, July 2015, <http://www.rfc-editor.org/info/rfc7596>.",
      "ja": "[RFC7596]崔、Y.、日、Q.、Boucadair、M.、ツオウ、T.、リー、Y.、およびI.ファラー、 \"軽量4over6：デュアルスタックLiteのアーキテクチャへの拡張\"、RFC 7596 、DOI 10.17487 / RFC7596、2015年7月、<http://www.rfc-editor.org/info/rfc7596>。"
    },
    {
      "indent": 3,
      "text": "[RFC7597] Troan, O., Ed., Dec, W., Li, X., Bao, C., Matsushima, S., Murakami, T., and T. Taylor, Ed., \"Mapping of Address and Port with Encapsulation (MAP-E)\", RFC 7597, DOI 10.17487/RFC7597, July 2015, <http://www.rfc-editor.org/info/rfc7597>.",
      "ja": "[RFC7597] Troan、O.、エド。、12月、W.はLi、X.、バオ、C.、松島、S.、村上、T.、およびT.テイラー編、「マッピングアドレスとポートのカプセル化と（MAP-E）」、RFC 7597、DOI 10.17487 / RFC7597、2015年7月、<http://www.rfc-editor.org/info/rfc7597>。"
    },
    {
      "indent": 3,
      "text": "[RFC7599] Li, X., Bao, C., Dec, W., Ed., Troan, O., Matsushima, S., and T. Murakami, \"Mapping of Address and Port using Translation (MAP-T)\", RFC 7599, DOI 10.17487/RFC7599, July 2015, <http://www.rfc-editor.org/info/rfc7599>.",
      "ja": "[RFC7599]のLi、X.、バオ、C.、12月、W.、編、Troan、O.、松島、S.、およびT.村上、 \"翻訳（MAP-T）を使用してアドレスとポートのマッピング\" 、RFC 7599、DOI 10.17487 / RFC7599、2015年7月、<http://www.rfc-editor.org/info/rfc7599>。"
    },
    {
      "indent": 3,
      "text": "[Secure-DHCPv6] Jiang, S., Ed., Shen, S., Zhang, D., and T. Jinmei, \"Secure DHCPv6\", Work in Progress, draft-ietf-dhc-sedhcpv6-08, June 2015.",
      "ja": "[セキュア-のDHCPv6]江、S.、エド。、シェン、S.、張、D.、およびT.神明を、進捗状況、ドラフト-IETF-DHC-sedhcpv6-08、2015年6月での作業 \"DHCPv6のセキュア\"。"
    },
    {
      "indent": 3,
      "text": "[Unified-v4-in-v6] Boucadair, M., Farrer, I., Perreault, S., Ed., and S. Sivakumar, Ed., \"Unified IPv4-in-IPv6 Softwire CPE\", Work in Progress, draft-ietf-softwire-unified-cpe-01, May 2013.",
      "ja": "[統一-V4型V6] Boucadair、M.、ファラー、I.、ペロー、S.編、及びS.シバクマー編、 \"IPv4のインのIPv6 Softwire CPE統一\"、進行中で働いて、ドラフト-IETF-softwire-統一-CPE-01、2013年5月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "This document was created as a product of a MAP design team. The following people were members of that team: Congxiao Bao, Mohamed Boucadair, Gang Chen, Maoke Chen, Wojciech Dec, Xiaohong Deng, Jouni Korhonen, Xing Li, Satoru Matsushima, Tomek Mrugalski, Tetsuya Murakami, Jacni Qin, Necj Scoberne, Qiong Sun, Tina Tsou, Dan Wing, Leaf Yeh, and Jan Zorz.",
      "ja": "この文書は、MAPのデザインチームのプロダクトとして作成されました。 Congxiaoバオ、モハメドBoucadair、ギャング陳、Maoke陳、ヴォイチェフ12月、Xiaohong鄧小、Jouni Korhonen、興李、悟松島、Tomek Mrugalski、哲也村上、Jacni秦、Necj Scoberne、Qiong日：次の人はそのチームのメンバーでした、ティナツオウ、ダン・ウィング、葉の葉、とJan Zorz。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Bernie Volz and Tom Taylor for their insightful comments and suggestions.",
      "ja": "作者は彼らの洞察に満ちたコメントと提案のためのバーニーフォルツとトム・テイラーに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Tomek Mrugalski Internet Systems Consortium, Inc. 950 Charter Street Redwood City, CA 94063 United States",
      "ja": "Tomek Mrugalskiインターネットシステムコンソーシアム株式会社950憲章通りカリフォルニア州レッドウッドシティー94063米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650 423 1345 Email: tomasz.mrugalski@gmail.com URI: http://www.isc.org/",
      "ja": "電話：+1 650 423 1345 Eメール：tomasz.mrugalski@gmail.com URI：http://www.isc.org/"
    },
    {
      "indent": 3,
      "text": "Ole Troan Cisco Systems Philip Pedersens vei 1 Lysaker 1366 Norway",
      "ja": "オレTroanシスコシステムズフィリップ・ペダーセンの道1リサーカー1366ノルウェー"
    },
    {
      "indent": 3,
      "text": "Email: ot@cisco.com",
      "ja": "メール：to@cisco.com"
    },
    {
      "indent": 3,
      "text": "Ian Farrer Deutsche Telekom AG CTO-ATI, Landgrabenweg 151 Bonn, NRW 53227 Germany",
      "ja": "イアン・ファラー、ドイツテレコム・アーゲーCTO ATI、Landgrabenweg 151ボン、NRW 53227ドイツ"
    },
    {
      "indent": 3,
      "text": "Email: ian.farrer@telekom.de",
      "ja": "メール：ian.farrer@telekom.de"
    },
    {
      "indent": 3,
      "text": "Simon Perreault Jive Communications Quebec, QC Canada",
      "ja": "サイモン・ペロージャイブコミュニケーションズケベック、QCカナダ"
    },
    {
      "indent": 3,
      "text": "Email: sperreault@jive.com",
      "ja": "メール：sperreault@jive.com"
    },
    {
      "indent": 3,
      "text": "Wojciech Dec Cisco Systems, Inc. The Netherlands",
      "ja": "ヴォイチェフ12月シスコシステムズ、株式会社オランダ"
    },
    {
      "indent": 3,
      "text": "Email: wdec@cisco.com URI: http://cisco.com",
      "ja": "メール：wdec@cisco.com URI：http://cisco.com"
    },
    {
      "indent": 3,
      "text": "Congxiao Bao CERNET Center/Tsinghua University Room 225, Main Building, Tsinghua University Beijing 100084 China",
      "ja": "CongxiaoバオCERNETセンター/清華大学ルーム225、本館、清華大学、北京100084中国"
    },
    {
      "indent": 3,
      "text": "Phone: +86 10-62785983 Email: congxiao@cernet.edu.cn",
      "ja": "電話：+86 10-62785983 Eメール：congxiao@cernet.edu.cn"
    },
    {
      "indent": 3,
      "text": "Leaf Y. Yeh Freelancer Technologies China",
      "ja": "リーフY.葉フリーランサーテクノロジー中国"
    },
    {
      "indent": 3,
      "text": "Email: leaf.y.yeh@hotmail.com",
      "ja": "メール：leaf.y.yeh@hotmail.com"
    },
    {
      "indent": 3,
      "text": "Xiaohong Deng The University of New South Wales Sydney NSW 2052 Australia",
      "ja": "ニューサウスウェールズ州のXiaohong鄧小東京大学シドニーNSW 2052オーストラリア"
    },
    {
      "indent": 3,
      "text": "Email: dxhbupt@gmail.com URI: https://www.unsw.edu.au/",
      "ja": "メール：dxhbupt@gmail.com URI：https://www.unsw.edu.au/"
    }
  ]
}