{
  "title": {
    "text": "RFC 7043 - Resource Records for EUI-48 and EUI-64 Addresses in the DNS",
    "ja": "RFC 7043 - DNSにおけるEUI-48のためのリソースレコードとEUI-64アドレス"
  },
  "number": 7043,
  "created_at": "2019-10-27 23:30:44.380453+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          J. Abley\nRequest for Comments: 7043                                     Dyn, Inc.\nCategory: Informational                                     October 2013\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Resource Records for EUI-48 and EUI-64 Addresses in the DNS",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "48-bit Extended Unique Identifier (EUI-48) and 64-bit Extended Unique Identifier (EUI-64) are address formats specified by the IEEE for use in various layer-2 networks, e.g., Ethernet.",
      "ja": "一意識別子（EUI-48）および64ビット拡張固有識別子（EUI-64）拡張48ビットは、例えば、イーサネット（登録商標）の種々のレイヤ2ネットワークでの使用のためにIEEEによって指定されたアドレス形式です。"
    },
    {
      "indent": 3,
      "text": "This document describes two new DNS resource record types, EUI48 and EUI64, for encoding Ethernet addresses in the DNS.",
      "ja": "この文書では、DNSにイーサネットアドレスを符号化するために、二つの新しいDNSリソースレコードタイプ、EUI48とEUI64を説明しています。"
    },
    {
      "indent": 3,
      "text": "This document describes potentially severe privacy implications resulting from indiscriminate publication of link-layer addresses in the DNS. EUI-48 or EUI-64 addresses SHOULD NOT be published in the public DNS. This document specifies an interoperable encoding of these address types for use in private DNS namespaces, where the privacy concerns can be constrained and mitigated.",
      "ja": "この文書では、DNS内のリンク層アドレスの無差別出版から生じる潜在的に深刻なプライバシーの意味を説明しています。 EUI-48またはEUI-64アドレスは、パブリックDNSに公開されない（SHOULD NOT）。この文書では、プライバシーの問題が制約と緩和することができるプライベートDNS名前空間での使用のためにこれらのアドレスタイプの相互運用性のエンコーディングを指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7043.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7043で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2013 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2013 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  The EUI48 Resource Record . . . . . . . . . . . . . . . . . .   3\n  3.1.  EUI48 RDATA Wire Format . . . . . . . . . . . . . . . . .   4\n  3.2.  EUI48 RR Presentation Format  . . . . . . . . . . . . . .   4\n  3.3.  Example . . . . . . . . . . . . . . . . . . . . . . . . .   4\n4.  The EUI64 Resource Record . . . . . . . . . . . . . . . . . .   4\n  4.1.  EUI64 RDATA Wire Format . . . . . . . . . . . . . . . . .   4\n  4.2.  EUI64 RR Presentation Format  . . . . . . . . . . . . . .   5\n  4.3.  Example . . . . . . . . . . . . . . . . . . . . . . . . .   5\n5.  Example Use Case: IP Address Tracking in DOCSIS Networks  . .   5\n6.  DNS Protocol Considerations . . . . . . . . . . . . . . . . .   6\n7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   6\n8.  Security Considerations . . . . . . . . . . . . . . . . . . .   6\n9.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   7\n10. References  . . . . . . . . . . . . . . . . . . . . . . . . .   7\n  10.1.  Normative References . . . . . . . . . . . . . . . . . .   7\n  10.2.  Informative References . . . . . . . . . . . . . . . . .   8",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Domain Name System (DNS) is described in [RFC1034] and [RFC1035]. This base specification defines many resource record (RR) types, and subsequent specifications have defined others. Each defined RR type provides a means of encoding particular data in the DNS.",
      "ja": "ドメインネームシステム（DNS）は、[RFC1034]及び[RFC1035]に記載されています。この基本仕様は、多くのリソースレコード（RR）のタイプを定義し、その後の仕様が他を定義しています。各定義されたRR型は、DNS内の特定のデータを符号化する手段を提供します。"
    },
    {
      "indent": 3,
      "text": "48-bit Extended Unique Identifier (EUI-48) [EUI48] and 64-bit Extended Unique Identifier (EUI-64) [EUI64] are address formats specified by the IEEE for use in various layer-2 networks, e.g., Ethernet.",
      "ja": "[EUI64] 48ビット[EUI48]一意識別子（EUI48）拡張と64ビット拡張固有識別子（EUI64）、例えば、イーサネット（登録商標）の種々のレイヤ2ネットワークでの使用のためにIEEEによって指定されたアドレス形式です。"
    },
    {
      "indent": 3,
      "text": "This document defines two new RR types, EUI48 and EUI64, for encoding EUI-48 and EUI-64 addresses in the DNS.",
      "ja": "この文書では、DNSにEUI48とEUI64アドレスを符号化するために、二つの新しいRRタイプ、EUI48とEUI64を定義します。"
    },
    {
      "indent": 3,
      "text": "There are potentially severe privacy implications resulting from the indiscriminate publication of link-layer addresses in the DNS (see Section 8). This document recommends that EUI-48 or EUI-64 addresses SHOULD NOT be published in the public DNS. This document specifies an interoperable encoding of these address types for use in private DNS namespaces, where the privacy implications can be constrained and mitigated.",
      "ja": "DNS内のリンク層アドレスの無差別出版から生じる潜在的に深刻なプライバシーへの影響は（セクション8を参照）があります。この文書では、EUI-48またはEUI-64アドレスは、パブリックDNSで公開されてはならないことをお勧めします。この文書では、プライバシーへの影響が制約と緩和することができるプライベートDNS名前空間での使用のためにこれらのアドレスタイプの相互運用性のエンコーディングを指定します。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "This document uses capitalized keywords such as MUST and MAY to describe the requirements for using the registered RR types. The intended meaning of those keywords in this document are the same as those described in [RFC2119]. Although these keywords are often used to specify normative requirements in IETF Standards, their use in this document does not imply that this document is a standard of any kind.",
      "ja": "この文書では、登録されたRRタイプを使用するための要件を記述するために、そのような必要があり、MAYとして資産のキーワードを使用しています。この文書に記載されているこれらのキーワードの意図した意味は、[RFC2119]で説明したものと同じです。これらのキーワードは、多くの場合、IETF規格で規範的要件を指定するために使用されているが、本書ではそれらの使用は、この文書は、いかなる種類の標準であることを意味するものではありません。"
    },
    {
      "indent": 0,
      "text": "3. The EUI48 Resource Record",
      "section_title": true,
      "ja": "3. EUI48リソースレコード"
    },
    {
      "indent": 3,
      "text": "The EUI48 resource record (RR) is used to store a single EUI-48 address in the DNS.",
      "ja": "EUI48リソースレコード（RR）がDNSに単一EUI48アドレスを記憶するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The Type value for the EUI48 RR is 108 (decimal).",
      "ja": "EUI48 RRの型値が108（10進数）です。"
    },
    {
      "indent": 3,
      "text": "The EUI48 RR is class independent.",
      "ja": "EUI48 RRはクラスから独立しています。"
    },
    {
      "indent": 3,
      "text": "The EUI48 RR has no special Time-to-Live (TTL) requirements.",
      "ja": "EUI48 RRは特別な生存時間（TTL）の要件を持っていません。"
    },
    {
      "indent": 0,
      "text": "3.1. EUI48 RDATA Wire Format",
      "section_title": true,
      "ja": "3.1。 EUI48 RDATAワイヤーフォーマット"
    },
    {
      "indent": 3,
      "text": "The RDATA for an EUI48 RR consists of a single, 6-octet Address field, encoded in network (big-endian) order.",
      "ja": "EUI48のRRのためのRDATAは、ネットワーク（ビッグエンディアン）の順序で符号化されたシングル、6オクテットのアドレスフィールドから成ります。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          EUI-48 Address                       |\n|                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3.2. EUI48 RR Presentation Format",
      "section_title": true,
      "ja": "3.2。 EUI48 RRプレゼンテーションフォーマット"
    },
    {
      "indent": 3,
      "text": "The Address field MUST be represented as six two-digit hexadecimal numbers separated by hyphens. The hexadecimal digits \"A\" through \"F\" MAY be represented in either upper or lower case.",
      "ja": "アドレスフィールドは、ハイフンで区切られた6 2桁の16進数として表現されなければなりません。 16進数「F」から「A」は、大文字または小文字で表すことができます。"
    },
    {
      "indent": 0,
      "text": "3.3. Example",
      "section_title": true,
      "ja": "3.3。例"
    },
    {
      "indent": 3,
      "text": "The following EUI48 RR stores the EUI-48 unicast address 00-00-5e-00-53-2a.",
      "ja": "以下EUI48 RRはEUI48ユニキャストアドレス00-00-5E-00-53-2aを記憶します。"
    },
    {
      "indent": 5,
      "text": "host.example. 86400 IN EUI48 00-00-5e-00-53-2a",
      "ja": "host.example。 EUI48 00-00-5E-00-53-2a、IN 86400"
    },
    {
      "indent": 0,
      "text": "4. The EUI64 Resource Record",
      "section_title": true,
      "ja": "4. EUI64リソースレコード"
    },
    {
      "indent": 3,
      "text": "The EUI64 RR is used to store a single EUI-64 address in the DNS.",
      "ja": "EUI64 RRはDNSに、単一のEUI64アドレスを格納するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The Type value for the EUI64 RR is 109 (decimal).",
      "ja": "EUI64 RRの型値が109（10進数）です。"
    },
    {
      "indent": 3,
      "text": "The EUI64 RR is class independent.",
      "ja": "EUI64 RRはクラスから独立しています。"
    },
    {
      "indent": 3,
      "text": "The EUI64 RR has no special TTL requirements.",
      "ja": "EUI64 RRは特別なTTLの要件はありません。"
    },
    {
      "indent": 0,
      "text": "4.1. EUI64 RDATA Wire Format",
      "section_title": true,
      "ja": "4.1。 EUI64 RDATAワイヤーフォーマット"
    },
    {
      "indent": 3,
      "text": "The RDATA for an EUI64 RR consists of a single, 8-octet Address field, encoded in network (big-endian) order.",
      "ja": "EUI64 RR用RDATAは、ネットワーク内の符号化された単一の8オクテットアドレスフィールド、（ビッグエンディアン）オーダ​​ーで構成されています。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          EUI-64 Address                       |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.2. EUI64 RR Presentation Format",
      "section_title": true,
      "ja": "4.2。 EUI64 RRプレゼンテーションフォーマット"
    },
    {
      "indent": 3,
      "text": "The Address field MUST be represented as eight two-digit hexadecimal numbers separated by hyphens. The hexadecimal digits \"A\" through \"F\" MAY be represented in either upper or lower case.",
      "ja": "アドレスフィールドは、ハイフンで区切られた8個の2桁の16進数として表現されなければなりません。 16進数「F」から「A」は、大文字または小文字で表すことができます。"
    },
    {
      "indent": 0,
      "text": "4.3. Example",
      "section_title": true,
      "ja": "4.3。例"
    },
    {
      "indent": 3,
      "text": "The following EUI64 RR stores the EUI-64 unicast address 00-00-5e-ef-10-00-00-2a.",
      "ja": "以下EUI64 RR格納EUI64ユニキャストアドレス00-00-5E-EF-10-00-00-2a。"
    },
    {
      "indent": 5,
      "text": "host.example. 86400 IN EUI64 00-00-5e-ef-10-00-00-2a",
      "ja": "host.example。 EUI64 00-00-5E-EF-10-00-00-2a、IN 86400"
    },
    {
      "indent": 0,
      "text": "5. Example Use Case: IP Address Tracking in DOCSIS Networks",
      "section_title": true,
      "ja": "5.使用例ケース：DOCSISネットワークにおけるIPアドレス追跡"
    },
    {
      "indent": 3,
      "text": "Canadian cable Internet subscribers are assigned IP addresses using DHCP, using a DHCP server operated by a cable company. In the case where a cable company provides last-mile connectivity to a subscriber on behalf of a third-party company (reseller), the DHCP server assigns addresses from a pool supplied by the reseller. The reseller retains knowledge of the EUI-48 address of the DOCSIS modem supplied to the subscriber but has no direct knowledge of the IP addresses assigned. In order for the reseller to be able to map the IP address assigned to a subscriber to that EUI-48 address (and hence to the subscriber identity), the cable company can make available information from the DHCP server that provides (EUI-48, IP) address mapping.",
      "ja": "カナダのケーブルインターネット加入者は、ケーブル会社が運営するDHCPサーバーを使用して、DHCPを使ってIPアドレスを割り当てられています。ケーブル会社は、サードパーティの会社（リセラー）に代わって加入者にラストマイルの接続を提供する場合には、DHCPサーバは、再販業者から供給されたプールからアドレスを割り当てます。リセラーは、加入者に供給されるDOCSISモデムのEUI-48アドレスの知識を保持するが、割り当てられたIPアドレスのない直接的な知識を持っていません。 （したがって、加入者識別に）、ケーブル会社が提供するDHCPサーバ（EUI-48から入手可能な情報を作ることができる代理店がそのEUI-48アドレスへの加入者に割り当てられたIPアドレスをマッピングすることができるようにするためには、 IP）アドレスマッピング。"
    },
    {
      "indent": 3,
      "text": "Cable companies in Canada are required [NTRE038D] to make this address mapping available using the DNS. Zones containing the relevant information are published on DNS servers, access to which is restricted to the resellers corresponding to particular sets of subscribers. Subscriber address information is not published in the public DNS.",
      "ja": "カナダでのケーブル会社は、[NTRE038D] DNSを使用して、このアドレスマッピングを使用可能にする必要があります。関連情報を含むゾーンは、加入者の特定のセットに対応した販売店に制限されたアクセス先のDNSサーバ上で公開されています。加入者のアドレス情報は、パブリックDNSで公開されていません。"
    },
    {
      "indent": 3,
      "text": "Existing DNS schemas for the representation of (EUI-48, IP) mapping used by Canadian cable companies are varied and inefficient; in the absence of an RR type for direct encoding of EUI-48 addresses, addresses are variously encoded into owner names or are published in TXT records.",
      "ja": "カナダのケーブル会社によって使用される（EUI-48、IP）マッピングの表現のための既存のDNSスキーマは、多様かつ非効率的です。 EUI-48アドレスを直接符号化するためのRR型の非存在下では、アドレスは、様々所有者名に符号化されるか、またはTXTレコードに公開されています。"
    },
    {
      "indent": 3,
      "text": "The specification in this document facilitates a more efficient, consistent, and reliable representation of (EUI-48, IP) mapping than was previously available.",
      "ja": "この文書に記載されている仕様は、以前に利用可能であったよりも（EUI-48、IP）マッピングのより効率的で一貫性、および信頼性の表現を容易にします。"
    },
    {
      "indent": 0,
      "text": "6. DNS Protocol Considerations",
      "section_title": true,
      "ja": "6. DNSプロトコルの考慮事項"
    },
    {
      "indent": 3,
      "text": "The specification of the new RR types in this document has no effect on the address resolution behavior of any previously existing network processes or protocols. Proposals or specifications to modify or augment address resolution processes or protocols by making use of these RR types should specify how any address conflicts or use of multiple EUI48/EUI64 RRs are handled.",
      "ja": "このドキュメントの新しいRRタイプの仕様では、任意の既存のネットワーク・プロセスまたはプロトコルのアドレス解決の動作には影響を与えません。これらのRRタイプを利用してアドレス解決プロセスまたはプロトコルを変更または増強する提案や仕様は、複数のEUI48 / EUI64 RRの任意のアドレス競合または使用をどのように処理するかを指定する必要があります。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned the RR type value 108 (decimal) for EUI48 and 109 (decimal) for EUI64. The corresponding entries in the \"Resource Record (RR) TYPEs\" subregistry (http://www.iana.org/assignments/ dns-parameters/) match the following data:",
      "ja": "IANAはEUI64ためEUI48及び109（10進数）のためのRRタイプ値108（10進数）を割り当てました。 「リソースレコード（RR）タイプ」副登録に対応するエントリ（http://www.iana.org/assignments/ DNSパラメータは、/）は、次のデータと一致します。"
    },
    {
      "indent": 12,
      "text": "+-------+-------+-------------------+---------------+\n| Type  | Value | Meaning           | Reference     |\n+-------+-------+-------------------+---------------+\n| EUI48 | 108   | an EUI-48 address | this document |\n| EUI64 | 109   | an EUI-64 address | this document |\n+-------+-------+-------------------+---------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are privacy concerns with the publication of link-layer addresses in the DNS. EUI-48 and EUI-64 addresses with the Local/Global bit zero [RFC7042] (referred to in [RFC4291] as the universal/local bit) are intended to represent unique identifiers for network connected equipment, notwithstanding many observed cases of duplication due to manufacturing errors, unauthorized use of Organizationally Unique Identifiers (OUIs), and address spoofing through configuration of network interfaces. Publication of EUI-48 or EUI-64 addresses in the DNS may result in privacy issues in the form of unique trackable identities that in some cases may be permanent.",
      "ja": "DNS内のリンク層アドレスの公表とプライバシーの問題があります。複製の多く観察された場合にもかかわらず、EUI-48およびグローバル/ローカルビットとEUI-64アドレスゼロ[RFC7042]（ユニバーサル/ローカルビットとして[RFC4291]で言及）は、ネットワーク接続された機器に一意の識別子を表すことを意図されています、製造誤差、ネットワークインタフェースの構成を介して組織固有識別子（のOUI）とアドレススプーフィングの不正使用に関する。 DNSにおけるEUI-48またはEUI-64アドレスの発行は、いくつかのケースでは永久的かもしれユニークな追跡可能なアイデンティティの形でプライバシーの問題をもたらすことができます。"
    },
    {
      "indent": 3,
      "text": "For example, although IP addresses and DNS names for network devices typically change over time, EUI-48 and EUI-64 addresses configured on the same devices are normally far more stable (in many cases, effectively invariant). Publication of EUI-48 addresses associated with user devices in a way that could be mapped to assigned IP addresses would allow the behavior of those users to be tracked by third parties, regardless of where and how the user's device is connected to the Internet. This might well result in a loss of privacy for the user.",
      "ja": "IPアドレスとネットワークデバイスのDNS名は、典型的には、経時的に変化するが、例えば、同一のデバイス上で設定EUI-48とEUI-64アドレスは、通常、はるかに安定した（多くの場合、効果的に不変）です。割り当てられたIPアドレスにマッピングすることができるようにして、ユーザデバイスに関連するEUI-48アドレスの出版物にかかわらずどこで、どのようにユーザのデバイスがインターネットに接続され、それらのユーザの挙動は、第三者によって追跡することを可能にします。これはよく、ユーザーのプライバシーが失われる可能性があります。"
    },
    {
      "indent": 3,
      "text": "The publication of EUI-48 or EUI-64 addresses associated with deployed equipment, using the mechanism described in this document or any other mechanism, has the potential to facilitate Media Access Control (MAC) cloning -- that is, facilitate link-layer attacks against deployed devices, e.g., to disrupt service or intercept data.",
      "ja": "この文書または他の任意の機構で説明されたメカニズムを使用して展開装置に関連付けられたEUI-48またはEUI-64アドレスの出版物は、メディアアクセス制御（MAC）クローニングを促進する可能性を有する - すなわち、リンク層攻撃を容易にします展開デバイス、例えば、反対のサービスやインターセプトのデータを破壊します。"
    },
    {
      "indent": 3,
      "text": "These concerns can be mitigated by restricting access to DNS zones containing EUI48 or EUI64 RRs to specific, authorized clients and by provisioning them in DNS zones that exist in private namespaces only.",
      "ja": "これらの懸念は、特定の、承認されたクライアントにEUI48やEUI64 RRを含むDNSゾーンへのアクセスを制限することで、唯一のプライベート名前空間に存在するDNSゾーンでそれらをプロビジョニングすることによって軽減することができます。"
    },
    {
      "indent": 3,
      "text": "This document recommends that EUI-48 or EUI-64 addresses SHOULD NOT be published in the public DNS.",
      "ja": "この文書では、EUI-48またはEUI-64アドレスは、パブリックDNSで公開されてはならないことをお勧めします。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "The author acknowledges the contributions of Olafur Gudmundsson, Mark Smith, Andrew Sullivan, Roy Arends, Michael StJohns, Donald Eastlake III, Randy Bush, and John Klensin.",
      "ja": "著者はオラフルグドムンソン、マーク・スミス、アンドリュー・サリバン、ロイ・アレンズ、マイケルStJohns、ドナルドイーストレイクIII、ランディブッシュ、そしてジョン・クレンシンの貢献を認めています。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[EUI48] IEEE, \"Guidelines for use of a 48-bit Extended Unique Identifier (EUI-48)\", <http://standards.ieee.org/develop/regauth/tut/eui48.pdf>.",
      "ja": "[EUI48] IEEE、<http://standards.ieee.org/develop/regauth/tut/eui48.pdf> \"48ビット拡張固有識別子（EUI48）の使用のためのガイドライン\"。"
    },
    {
      "indent": 3,
      "text": "[EUI64] IEEE, \"Guidelines for 64-bit Global Identifier (EUI-64)\", November 2012, <http://standards.ieee.org/develop/regauth/tut/eui64.pdf>.",
      "ja": "[EUI64] IEEE、2012年11月、<http://standards.ieee.org/develop/regauth/tut/eui64.pdf> \"64ビットのグローバル識別子（EUI64）のためのガイドライン\"。"
    },
    {
      "indent": 3,
      "text": "[RFC1034] Mockapetris, P., \"Domain names - concepts and facilities\", STD 13, RFC 1034, November 1987.",
      "ja": "[RFC1034] Mockapetris、P.、 \"ドメイン名 - 概念と設備\"、STD 13、RFC 1034、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC1035] Mockapetris, P., \"Domain names - implementation and specification\", STD 13, RFC 1035, November 1987.",
      "ja": "[RFC1035] Mockapetris、P.、 \"ドメイン名 - 実装及び仕様\"、STD 13、RFC 1035、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC7042] Eastlake 3rd, D. and J. Abley, \"IANA Considerations and IETF Protocol and Documentation Usage for IEEE 802 Parameters\", BCP 141, RFC 7042, October 2013.",
      "ja": "[RFC7042]イーストレーク3、D.およびJ. Abley、 \"IEEE 802個のパラメータのIANAの考慮事項とIETFプロトコルとマニュアル使用方法\"、BCP 141、RFC 7042、2013年10月。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[NTRE038D] CRTC Interconnection Steering Committee (CISC) Network Working Group, \"Implementation of IP Address Tracking in DOCSIS Networks (TIF18)\", NTRE038D Consensus Report, October 2006, <http://www.crtc.gc.ca/public/cisc/nt/NTRE038D.doc>.",
      "ja": "[NTRE038D] CRTC相互接続運営委員会（CISC）ネットワークワーキンググループ、 \"DOCSISネットワーク（TIF18）でIPアドレス追跡の実装\"、NTRE038Dコンセンサス報告書、2006年10月、<http://www.crtc.gc.ca/public/ CISC / NT / NTRE038D.doc>。"
    },
    {
      "indent": 3,
      "text": "[RFC4291] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 4291, February 2006.",
      "ja": "[RFC4291] HindenとR.とS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 4291、2006年2月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Joe Abley Dyn, Inc. 470 Moore Street London, ON N6C 2C2 Canada",
      "ja": "N6C 2C2カナダONジョーAbley Dynは、株式会社470ムーアストリートロンドン、"
    },
    {
      "indent": 3,
      "text": "Phone: +1 519 670 9327 EMail: jabley@dyn.com",
      "ja": "電話：+1 519 670 9327 Eメール：jabley@dyn.com"
    }
  ]
}