{
  "title": {
    "text": "RFC 7202 - Securing the RTP Framework: Why RTP Does Not Mandate a Single Media Security Solution",
    "ja": "RFC 7202 - RTPは、単一のメディアセキュリティソリューションを強制しない理由：RTPフレームワークを確保"
  },
  "number": 7202,
  "created_at": "2019-10-30 01:51:59.735509+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        C. Perkins\nRequest for Comments: 7202                         University of Glasgow\nCategory: Informational                                    M. Westerlund\nISSN: 2070-1721                                                 Ericsson\n                                                              April 2014",
      "raw": true
    },
    {
      "indent": 7,
      "text": "               Securing the RTP Framework:\nWhy RTP Does Not Mandate a Single Media Security Solution",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo discusses the problem of securing real-time multimedia sessions. It also explains why the Real-time Transport Protocol (RTP) and the associated RTP Control Protocol (RTCP) do not mandate a single media security mechanism. This is relevant for designers and reviewers of future RTP extensions to ensure that appropriate security mechanisms are mandated and that any such mechanisms are specified in a manner that conforms with the RTP architecture.",
      "ja": "このメモは、リアルタイムのマルチメディアセッションを確保する問題について説明します。リアルタイムトランスポートプロトコル（RTP）と関連するRTP制御プロトコル（RTCP）は、単一のメディアセキュリティメカニズムを強制していない理由も説明しています。これは、適切なセキュリティメカニズムが義務付けられていることを、どのようなメカニズムはRTPアーキテクチャに準拠した方法で指定されていることを保証するために、設計者や将来RTP拡張のレビューアに関連します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7202.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7202で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  RTP Applications and Deployment Scenarios . . . . . . . . . .   3\n3.  RTP Media Security  . . . . . . . . . . . . . . . . . . . . .   4\n4.  RTP Session Establishment and Key Management  . . . . . . . .   5\n5.  On the Requirement for Strong Security in Framework Protocols   5\n6.  Securing the RTP Framework  . . . . . . . . . . . . . . . . .   6\n7.  Conclusions . . . . . . . . . . . . . . . . . . . . . . . . .   8\n8.  Security Considerations . . . . . . . . . . . . . . . . . . .   8\n9.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   8\n10. Informative References  . . . . . . . . . . . . . . . . . . .   8",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Real-time Transport Protocol (RTP) [RFC3550] is widely used for voice over IP, Internet television, video conferencing, and other real-time and streaming media applications. Despite this use, the basic RTP specification provides only limited options for media security and defines no standard key exchange mechanism. Rather, a number of extensions are defined that can provide confidentiality and authentication of RTP media streams and RTP Control Protocol (RTCP) messages. Other mechanisms define key exchange protocols. This memo outlines why it is appropriate that multiple extension mechanisms are defined rather than mandating a single security and keying mechanism for all users of RTP.",
      "ja": "リアルタイムトランスポートプロトコル（RTP）[RFC3550]は広くボイスオーバーIP、インターネットテレビ、ビデオ会議、およびその他のリアルタイムおよびストリーミングメディアアプリケーションのために使用されています。この使用にもかかわらず、基本的なRTP仕様は、メディアセキュリティのためにのみ限られた選択肢を提供し、標準的な鍵交換メカニズムを定義しません。むしろ、エクステンションの数はRTPメディアストリームおよびRTP制御プロトコル（RTCP）メッセージの機密性と認証を提供できるように定義されています。他のメカニズムは、鍵交換プロトコルを定義します。複数の拡張メカニズムは、単一のセキュリティを義務化し、RTPのすべてのユーザーのためのメカニズムをキーイングのではなく、定義されていることが適切である理由はこのメモは、概要を説明します。"
    },
    {
      "indent": 3,
      "text": "The IETF policy \"Strong Security Requirements for Internet Engineering Task Force Standard Protocols\" [RFC3365] (the so-called \"Danvers Doctrine\") states that \"we MUST implement strong security in all protocols to provide for the all too frequent day when the protocol comes into widespread use in the global Internet\". The security mechanisms defined for use with RTP allow these requirements to be met. However, since RTP is a protocol framework that is suitable for a wide variety of use cases, there is no single security mechanism that is suitable for every scenario. This memo outlines why this is the case and discusses how users of RTP can meet the requirement for strong security.",
      "ja": "IETFポリシー「インターネットエンジニアリングタスクフォース標準プロトコルのための強力なセキュリティ要件」[RFC3365]（いわゆる「ダンバースドクトリン」）は、我々はときプロトコルあまりにも頻繁に一日のために提供するために、すべてのプロトコルに強力なセキュリティを実装しなければならない」と述べています「グローバルなインターネットで普及しています。 RTPで使用するために定義されたセキュリティ・メカニズムは、これらの要件を満たすことを可能にします。 RTPは、ユースケースの多種多様に適しているプロトコル・フレームワークであるので、すべてのシナリオに適している単一のセキュリティメカニズムは存在しません。これが事実であるとRTPのユーザーが強力なセキュリティの要件を満たすことができる方法を説明し、なぜこのメモは、概要を説明します。"
    },
    {
      "indent": 3,
      "text": "This document provides high-level guidance on how to handle security issues for the various types of components within the RTP framework as well as the role of the service or application using RTP to ensure strong security is implemented. This document does not provide the guidance that an individual implementer, or even specifier of an RTP application, really can use to determine what security mechanism they need to use; that is not intended with this document.",
      "ja": "この文書では、RTPフレームワークだけでなく、強力なセキュリティが実装されていることを確認するためにRTPを使用したサービスまたはアプリケーションの役割内のコンポーネントの様々なタイプのセキュリティ問題を処理する方法の高レベルのガイダンスを提供します。この文書では、個々の実装者、またはRTPアプリケーションのさえ指定子は、本当に彼らが使用するために必要なもの、セキュリティ・メカニズムを決定するために使用できるガイダンスを提供していません。それは、この文書には意図されていません。"
    },
    {
      "indent": 3,
      "text": "A non-exhaustive list of the RTP security options available at the time of this writing is outlined in [RFC7201]. This document gives an overview of the available RTP solutions and provides guidance on their applicability for different application domains. It also attempts to provide an indication of actual and intended usage at the time of writing as additional input to help with considerations such as interoperability, availability of implementations, etc.",
      "ja": "この記事の執筆時点で入手可能なRTPのセキュリティオプションの非網羅的なリストは、[RFC7201]に概説されています。この文書では、利用可能なRTPソリューションの概要を示し、異なるアプリケーションドメインのためのそれらの適用に関するガイダンスを提供します。それはまた、などの相互運用性、実装の利用可能性、などの考慮を支援するなどの追加入力を書き込む時に実際の使用目的の指示を提供することを試みます"
    },
    {
      "indent": 0,
      "text": "2. RTP Applications and Deployment Scenarios",
      "section_title": true,
      "ja": "2. RTPアプリケーションおよび展開シナリオ"
    },
    {
      "indent": 3,
      "text": "The range of application and deployment scenarios where RTP has been used includes, but is not limited to, the following:",
      "ja": "RTPが使用されているアプリケーションおよび展開シナリオの範囲を含むが、以下に限定されるものではありません。"
    },
    {
      "indent": 3,
      "text": "o Point-to-point voice telephony;",
      "ja": "Oポイントツーポイント音声電話;"
    },
    {
      "indent": 3,
      "text": "o Point-to-point video conferencing and telepresence;",
      "ja": "Oポイントツーポイントビデオ会議およびテレプレゼンス。"
    },
    {
      "indent": 3,
      "text": "o Centralized group video conferencing and telepresence, using a Multipoint Conference Unit (MCU) or similar central middlebox;",
      "ja": "マルチポイント会議ユニット（MCU）または類似の中央ミドルボックスを使用してO集中グループビデオ会議及びテレプレゼンス、。"
    },
    {
      "indent": 3,
      "text": "o Any Source Multicast (ASM) video conferencing using the lightweight sessions model (e.g., the Mbone conferencing tools);",
      "ja": "O軽量セッションモデルを使用して、任意のソースマルチキャスト（ASM）ビデオ会議（例えば、MBONE会議ツール）。"
    },
    {
      "indent": 3,
      "text": "o Point-to-point streaming audio and/or video (e.g., on-demand TV or movie streaming);",
      "ja": "Oポイントツーポイントストリーミングオーディオおよび/またはビデオ（例えば、オンデマンドのテレビや映画のストリーミング）。"
    },
    {
      "indent": 3,
      "text": "o Source-Specific Multicast (SSM) streaming to large receiver groups (e.g., IPTV streaming by residential ISPs or the Third Generation Partnership Project (3GPP) Multimedia/Broadcast Multicast Service [T3GPP.26.346]);",
      "ja": "Oソース固有マルチキャスト（SSM）大受信グループへのストリーミング（例えば、住宅のISPや第三世代パートナーシッププロジェクト（3GPP）のマルチメディアブロードキャスト/マルチキャストサービス【T3GPP.26.346]によるIPTVストリーミング）。"
    },
    {
      "indent": 3,
      "text": "o Replicated unicast streaming to a group of receivers;",
      "ja": "O受信機のグループにユニキャストストリーミング複製。"
    },
    {
      "indent": 3,
      "text": "o Interconnecting components in music production studios and video editing suites;",
      "ja": "音楽制作スタジオやビデオ編集スイートのコンポーネントを相互接続するO;"
    },
    {
      "indent": 3,
      "text": "o Interconnecting components of distributed simulation systems; and",
      "ja": "分散シミュレーションシステムの構成要素を相互接続するO;そして"
    },
    {
      "indent": 3,
      "text": "o Streaming real-time sensor data (e.g., electronic Very Long Baseline Interferometry (e-VLBI) radio astronomy).",
      "ja": "Oストリーミングリアルタイムセンサデータ（例えば、電子超長基線電波干渉法（E-VLBI）電波天文学）。"
    },
    {
      "indent": 3,
      "text": "As can be seen, these scenarios vary from point-to-point sessions to very large multicast groups, from interactive to non-interactive, and from low bandwidth (kilobits per second) telephony to high bandwidth (multiple gigabits per second) video and data streaming. While most of these applications run over UDP [RFC0768], some use TCP [RFC0793] [RFC4614] or the Datagram Congestion Control Protocol (DCCP) [RFC4340] as their underlying transport. Some run on highly reliable optical networks, while others use low-rate unreliable wireless networks. Some applications of RTP operate entirely within a single trust domain, while others run interdomain with untrusted (and, in some cases, potentially unknown) users. The range of scenarios is wide and growing both in number and in heterogeneity.",
      "ja": "図から分かるように、これらのシナリオは、対話型から非対話、及び高帯域幅の電話低帯域幅（キロビット毎秒）（秒あたり複数ギガビット）からの映像およびデータをポイント・ツー・ポイントセッションに非常に大きなマルチキャストグループ毎に異なりますストリーミング。その基礎となるトランスポートとして[RFC0768]、いくつかの使用TCP [RFC0793] [RFC4614]またはデータグラム輻輳制御プロトコル（DCCP）[RFC4340] UDP上で実行し、これらのアプリケーションのほとんどの間。他の人が低レートの信頼性の低い無線ネットワークを利用しながら、いくつかは、信頼性の高い光ネットワーク上で実行します。他の人が信頼できない（と、いくつかのケースでは、潜在的に未知の）ユーザーとドメイン間を実行しながら、RTPの一部のアプリケーションは、完全に単一の信頼ドメイン内で動作します。シナリオの範囲が広く、数にして異質の両方で成長しています。"
    },
    {
      "indent": 0,
      "text": "3. RTP Media Security",
      "section_title": true,
      "ja": "3. RTPメディアのセキュリティ"
    },
    {
      "indent": 3,
      "text": "The wide range of application scenarios where RTP is used has led to the development of multiple solutions for securing RTP media streams and RTCP control messages, considering different requirements.",
      "ja": "RTPが使用されているアプリケーション・シナリオの広い範囲が異なる要件を考慮し、RTPメディアストリームとRTCP制御メッセージを確保するための複数のソリューションの開発につながりました。"
    },
    {
      "indent": 3,
      "text": "Perhaps the most widely applicable of these security options is the Secure RTP (SRTP) framework [RFC3711]. This is an application-level media security solution, encrypting the media payload data (but not the RTP headers) to provide confidentiality and supporting source origin authentication as an option. SRTP was carefully designed to be low overhead, including operating on links subject to RTP header compression, and to support the group communication and third-party performance monitoring features of RTP across a range of networks.",
      "ja": "おそらく、これらのセキュリティオプションの最も広く適用は、Secure RTP（SRTP）フレームワーク[RFC3711]です。これは、機密性を提供し、オプションとして、ソース発信元認証をサポートするためにメディアのペイロードデータ（ただし、RTPヘッダ）を暗号化し、アプリケーションレベルメディアセキュリティソリューションです。 SRTP注意深くRTPヘッダ圧縮の対象のリンク上で動作など、低いオーバーヘッドであるように設計し、ネットワークの範囲にわたってRTPのグループ通信およびサードパーティのパフォーマンス監視機能をサポートします。"
    },
    {
      "indent": 3,
      "text": "SRTP is not the only media security solution for RTP, however, and alternatives can be more appropriate in some scenarios, perhaps due to ease of integration with other parts of the complete system. In addition, SRTP does not address all possible security requirements, and other solutions are needed in cases where SRTP is not suitable. For example, ISMACryp payload-level confidentiality [ISMACryp2] is appropriate for some types of streaming video application, but is not suitable for voice telephony, and uses features that are not provided by SRTP.",
      "ja": "SRTPは、しかし、RTPのための唯一のメディアセキュリティソリューションではありません、と選択肢は、いくつかのシナリオでは、より適切な完全なシステムの他の部分との統合が容易で、おそらく起因することができます。また、SRTPは、すべての可能なセキュリティ要件に対応せず、他のソリューションは、SRTPが適切でない場合に必要とされています。例えば、ISMACrypペイロードレベルの機密性は、[ISMACryp2】ストリーミングビデオアプリケーションのいくつかのタイプのために適切であるが、音声電話に適していない、およびSRTPによって提供されていない機能を使用します。"
    },
    {
      "indent": 3,
      "text": "The range of available RTP security options, and their applicability to different scenarios, is outlined in [RFC7201]. At the time of this writing, there is no media security protocol that is appropriate for all the environments where RTP is used. Multiple RTP media security protocols are expected to remain in wide use for the foreseeable future.",
      "ja": "利用できるRTPのセキュリティオプションの範囲、および異なるシナリオへの適用、[RFC7201]に概説されています。この記事の執筆時点では、RTPが使用されているすべての環境に適して何のメディアセキュリティプロトコルがありません。複数のRTPメディアセキュリティプロトコルは予見可能な将来のために広く利用にとどまると予想されます。"
    },
    {
      "indent": 0,
      "text": "4. RTP Session Establishment and Key Management",
      "section_title": true,
      "ja": "4. RTPセッションの確立とキー管理"
    },
    {
      "indent": 3,
      "text": "A range of different protocols for RTP session establishment and key exchange exist, matching the diverse range of use cases for the RTP framework. These mechanisms can be split into two categories: those that operate in band on the media path and those that are out of band and operate as part of the session establishment signaling channel. The requirements for these two classes of solutions are different, and a wide range of solutions have been developed in this space.",
      "ja": "RTPセッションの確立及び鍵交換用の異なるプロトコルの範囲は、RTPフレームワークのユースケースの多様な範囲に一致する、存在します。メディアパスに帯域で動作するものと帯域外であり、セッション確立シグナリングチャネルの一部として動作するもの：これらのメカニズムは、2つのカテゴリに分けることができます。ソリューションのこの2つのクラスのための要件が​​異なっており、幅広いソリューションは、このスペースに開発されています。"
    },
    {
      "indent": 3,
      "text": "A more-detailed survey of requirements for media security management protocols can be found in [RFC5479]. As can be seen from that memo, the range of use cases is wide, and there is no single key management protocol that is appropriate for all scenarios. The solutions have been further diversified by the existence of infrastructure elements, such as authentication systems, that are tied to the key management. The most important and widely used keying options for RTP sessions at the time of this writing are described in [RFC7201].",
      "ja": "メディアセキュリティ管理プロトコルのための要件のより詳細な調査は、[RFC5479]で見つけることができます。そのメモから分かるように、ユースケースの範囲が広く、すべてのシナリオに適した単一の鍵管理プロトコルは存在しません。ソリューションは、さらに、そのような鍵管理に結びついている認証システムとして、インフラストラクチャ要素の存在によって多様化してきました。この記事の執筆時点でのRTPセッションの最も重要かつ広く使用さキーイングのオプションは、[RFC7201]で説明されています。"
    },
    {
      "indent": 0,
      "text": "5. On the Requirement for Strong Security in Framework Protocols",
      "section_title": true,
      "ja": "フレームワークプロトコルにおける強固なセキュリティのための要件5."
    },
    {
      "indent": 3,
      "text": "The IETF requires that all protocols provide a strong, mandatory-to-implement security solution [RFC3365]. This is essential for the overall security of the Internet to ensure that all implementations of a protocol can interoperate in a secure way. Framework protocols offer a challenge for this mandate, however, since they are designed to be used by different classes of applications in a wide range of different environments. The different use cases for the framework have different security requirements, and implementations designed for different environments are generally not expected to interwork.",
      "ja": "IETFは、すべてのプロトコルが強い、実装に必須のセキュリティソリューション[RFC3365]を提供する必要があります。インターネットの全体的なセキュリティは、プロトコルのすべての実装は、セキュアな方法で相互運用できるようにするためにこれが必要不可欠です。それらは異なる環境の広い範囲でアプリケーションの異なるクラスによって使用されるように設計されているので、フレームワークプロトコルは、しかし、この任務のための課題を提供します。フレームワークのためのさまざまな使用例は、異なるセキュリティ要件を持ち、異なる環境用に設計された実装は、一般的に相互に作用することが期待されていません。"
    },
    {
      "indent": 3,
      "text": "RTP is an example of a framework protocol with wide applicability. The wide range of scenarios described in Section 2 show the issues that arise in mandating a single security mechanism for this type of framework. It would be desirable if a single media security solution, and a single key management solution, could be developed that is suitable for applications across this range of use scenarios. The authors are not aware of any such solution, however, and believe it is unlikely that any such solution will be developed. In part, this is because applications in the different domains are not intended to interwork, so there is no incentive to develop a single mechanism. More importantly, though, the security requirements for the different usage scenarios vary widely, and an appropriate security mechanism in one scenario simply does not work for some other scenarios.",
      "ja": "RTPは、広い適用性を有するフレームワークプロトコルの一例です。第2節で説明したシナリオの広い範囲は、フレームワークのこのタイプのための単一のセキュリティメカニズムを義務付けるに生じる問題を示します。単一のメディアセキュリティソリューション、および単一の鍵管理ソリューションは、使用シナリオのこの範囲にわたる用途に適していることを開発することができれば、それは望ましいことです。著者は、しかし、どのような解決策を認識していない、そしてどのようなソリューションが開発される可能性は低いと考えています。一部では、異なるドメイン内のアプリケーションが相互に作用することを意図していないので、これがあるので、単一のメカニズムを開発するインセンティブはありません。さらに重要なことは、しかし、異なる使用シナリオのためのセキュリティ要件は大きく異なり、一つのシナリオでは、適切なセキュリティメカニズムは、単にいくつかの他のシナリオでは動作しません。"
    },
    {
      "indent": 3,
      "text": "For a framework protocol, it appears that the only sensible solution to the strong security requirement of [RFC3365] is to develop and use building blocks for the basic security services of confidentiality, integrity protection, authorization, authentication, and so on. When new uses for the framework protocol arise, they need to be studied to determine if the existing security building blocks can satisfy the requirements, or if new building blocks need to be developed.",
      "ja": "フレームワークプロトコルの場合は、[RFC3365]の強力なセキュリティ要件に対する唯一の賢明な解決策は、ように開発し、機密性、完全性の保護、認証、認証の基本的なセキュリティサービスのためのビルディング・ブロックを使用し、していることが表示されます。フレームワークプロトコルのための新たな用途が発生した場合、彼らは既存のセキュリティ・ビルディング・ブロックが要件を満たすことができるかどうかを判断するために検討する必要がある、または新しいビルディングブロックを開発する必要がある場合。"
    },
    {
      "indent": 3,
      "text": "Therefore, when considering the strong and mandatory-to-implement security mechanism for a specific class of applications, one has to consider what security building blocks need to be integrated, or if any new mechanisms need to be defined to address specific issues relating to this new class of application. To maximize interoperability, it is important that common media security and key management mechanisms are defined for classes of application with similar requirements. The IETF needs to participate in this selection of security building blocks for each class of applications that use the protocol framework and are expected to interoperate, in cases where the IETF has the appropriate knowledge of the class of applications.",
      "ja": "アプリケーションの特定のクラスのための強力かつ実装に必須のセキュリティ・メカニズムを検討する際にそのため、一つには、セキュリティ・ビルディング・ブロックを統合するために必要なものを考慮しなければならない、または任意の新しいメカニズムは、これに関連する特定の問題に対処するために定義する必要がある場合アプリケーションの新しいクラス。相互運用性を最大化するために、一般的なメディアセキュリティと鍵管理メカニズムは同様の要件を持つアプリケーションのクラスのために定義されていることが重要です。 IETFは、IETFは、アプリケーションのクラスの適切な知識を持っている場合には、プロトコル・フレームワークを使用して相互運用することが期待されているアプリケーションの各クラスのセキュリティビルディングブロックのこの選択に参加する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. Securing the RTP Framework",
      "section_title": true,
      "ja": "6. RTPフレームワークを確保"
    },
    {
      "indent": 3,
      "text": "The IETF requires that protocols specify mandatory-to-implement (MTI) strong security [RFC3365]. This applies to the specification of each interoperable class of application that makes use of RTP. However, RTP is a framework protocol, so the arguments made in Section 5 also apply. Given the variability of the classes of application that use RTP, and the variety of the currently available security mechanisms described in [RFC7201], no one set of MTI security options can realistically be specified that apply to all classes of RTP applications.",
      "ja": "IETFは、プロトコルが強制的に実装（MTI）強力なセキュリティ[RFC3365]を指定する必要があります。これは、RTPを使用するアプリケーションの各相互運用可能クラスの仕様に適用されます。ただし、RTPは、フレームワークのプロトコルであるので、第5節で作られた引数にも適用されます。 RTPを使用したアプリケーションのクラスの変動、およびRTPのアプリケーションのすべてのクラスに適用されます[RFC7201]で説明され、現在利用可能なセキュリティメカニズム、MTIのセキュリティオプションの誰セットは現実的に指定することはできませんの様々な与えられました。"
    },
    {
      "indent": 3,
      "text": "Documents that define an interoperable class of applications using RTP are subject to [RFC3365], and thus need to specify MTI security mechanisms. This is because such specifications do fully specify interoperable applications that use RTP. Examples of such documents under development in the IETF at the time of this writing are \"WebRTC Security Architecture\" [WebRTC-SEC] and \"Real Time Streaming Protocol 2.0 (RTSP)\" [RTSP]. It is also expected that a similar document will be produced for voice-over-IP applications using SIP and RTP.",
      "ja": "RTPを使用するアプリケーションの相互運用可能なクラスを定義するドキュメントは[RFC3365]の対象であるため、MTIセキュリティメカニズムを指定する必要があります。そのような仕様が完全にRTPを使用する相互運用可能なアプリケーションを指定しないためです。この記事の執筆時点ではIETFで開発中のような文書の例としては、「のWebRTCセキュリティアーキテクチャ」[のWebRTC-SEC]と「リアルタイムストリーミングプロトコル2.0（RTSP）」[RTSP]です。また、同様の文書がSIPとRTPを使用してボイスオーバーIPアプリケーション用に生成されることが期待されます。"
    },
    {
      "indent": 3,
      "text": "The RTP framework includes several extension points. Some extensions can significantly change the behavior of the protocol to the extent that applications using the extension form a separate interoperable class of applications to those that have not been extended. Other extension points are defined in such a manner that they can be used (largely) independently of the class of applications using RTP. Two important extension points that are independent of the class of applications are RTP payload formats and RTP profiles.",
      "ja": "RTPフレームワークは、いくつかの拡張ポイントを含みます。いくつかの拡張機能が大幅に拡張を使用するアプリケーションが拡張されていないものへのアプリケーションの独立した相互運用可能なクラスを形成する程度のプロトコルの動作を変更することができます。他の拡張ポイントは、独立して、RTPを使用してアプリケーションのクラス（主に）それらが使用できるように定義されています。アプリケーションのクラスの独立した2つの重要な拡張ポイントは、RTPペイロードフォーマットとRTPプロフィールです。"
    },
    {
      "indent": 3,
      "text": "An RTP payload format defines how the output of a media codec can be used with RTP. At the time of this writing, there are over 70 RTP payload formats defined in published RFCs, with more in development. It is appropriate for an RTP payload format to discuss the specific security implications of using that media codec with RTP. However, an RTP payload format does not specify an interoperable class of applications that use RTP since, in the vast majority of cases, a media codec and its associated RTP payload format can be used with many different classes of application. As such, an RTP payload format is neither secure in itself nor something to which [RFC3365] applies. Future RTP payload format specifications need to explicitly state this and include a reference to this memo for explanation. It is not appropriate for an RTP payload format to mandate the use of SRTP [RFC3711], or any other security building blocks, since that RTP payload format might be used by different classes of application that use RTP and that have different security requirements.",
      "ja": "RTPペイロードフォーマットは、メディアコーデックの出力は、RTPで使用することができる方法を定義します。この記事の執筆時点では、開発中のより多くのと公表のRFCで定義された70以上のRTPペイロードフォーマットは、あります。 RTPペイロードフォーマットはRTPとそのメディアコーデックを使用して、特定のセキュリティへの影響を議論することは適切です。ほとんどの場合において、メディアコーデックおよびその関連RTPペイロードフォーマットは、アプリケーションの多くの異なるクラスで使用することができ、しかし、RTPペイロードフォーマットは、RTPを使用するアプリケーションの相互運用可能なクラスを指定していません。そのため、RTPペイロード形式は、それ自体で安全でも、[RFC3365]に適用するものでもありません。将来のRTPペイロードフォーマットの仕様は、明示的にこれを述べると、説明のためにこのメモへの参照を含める必要があります。そのRTPペイロードフォーマットは、RTPを使用するアプリケーションの異なるクラスによって使用されるかもしれないので、RTPペイロードフォーマットは、SRTP [RFC3711]の使用、または他のセキュリティ・ビルディング・ブロックを強制するために、それは別のセキュリティ要件を持っていることは適切ではありません。"
    },
    {
      "indent": 3,
      "text": "RTP profiles are larger extensions that adapt the RTP framework for use with particular classes of application. In some cases, those classes of application might share common security requirements so that it could make sense for an RTP profile to mandate particular security options and building blocks (the RTP/SAVP profile [RFC3711] is an example of this type of RTP profile). In other cases, though, an RTP profile is applicable to such a wide range of applications that it would not make sense for that profile to mandate particular security building blocks be used (the RTP/AVPF profile [RFC4585] is an example of this type of RTP profile, since it provides building blocks that can be used in different styles of application). A new RTP profile specification needs to discuss whether or not it makes sense to mandate particular security building blocks that need to be used with all implementations of that profile; however, there is no expectation that all RTP profiles will mandate particular security solutions. RTP profiles that do not specify an interoperable usage for a particular class of RTP applications are neither secure in themselves nor something to which [RFC3365] applies; any future RTP profiles in this category need to explicitly state this with justification and include a reference to this memo.",
      "ja": "RTPプロファイルは、アプリケーションの特定のクラスで使用するためのRTPの枠組みを適応させる大きな拡張したものです。 RTPプロファイルは、特定のセキュリティオプションおよびビルディングブロックを強制することが意味をなすことができるように、いくつかのケースでは、アプリケーションのこれらのクラスは、共通のセキュリティ要件を共有するかもしれない（RTP / SAVPプロファイルは、[RFC3711]はRTPプロファイルのこのタイプの一例です） 。他の場合では、しかし、RTPプロファイルが使用され、特定のセキュリティ・ビルディング・ブロックを強制することは、そのプロファイルの意味をなさないアプリケーションのような広い範囲に適用可能である（RTP / AVPFプロフィールは、[RFC4585]は、このタイプの例でありますRTPプロファイル、それはアプリケーションの異なるスタイルで使用することができるビルディングブロックを提供するため）の。新しいRTPプロファイル仕様は、それがそのプロファイルのすべての実装で使用する必要がある特定のセキュリティ・ビルディング・ブロックを強制することは理にかなっているか否か議論する必要があります。しかし、すべてのRTPプロファイルは、特定のセキュリティソリューションを義務付けるだろうという期待がありません。 RTPアプリケーションの特定のクラスのための相互運用可能な使用法を指定していないRTPプロファイルは、自分自身も何かに[RFC3365]適用中にも安全です。このカテゴリ内の任意の将来のRTPプロファイルが明示的に正当化してこれを述べる必要があり、このメモへの参照が含まれています。"
    },
    {
      "indent": 0,
      "text": "7. Conclusions",
      "section_title": true,
      "ja": "7、結論"
    },
    {
      "indent": 3,
      "text": "The RTP framework is used in a wide range of different scenarios with no common security requirements. Accordingly, neither SRTP [RFC3711] nor any other single media security solution or keying mechanism can be mandated for all uses of RTP. In the absence of a single common security solution, it is important to consider what mechanisms can be used to provide strong and interoperable security for each different scenario where RTP applications are used. This will require analysis of each class of application to determine the security requirements for the scenarios in which they are to be used, followed by the selection of MTI security building blocks for that class of application, including the desired RTP traffic protection and key management. A non-exhaustive list of the RTP security options available at the time of this writing is outlined in [RFC7201]. It is expected that each class of application will be supported by a memo describing what security options are mandatory to implement for that usage scenario.",
      "ja": "RTPフレームワークはない共通のセキュリティ要件を持つ異なるシナリオの広い範囲で使用されます。したがって、どちらのSRTP [RFC3711]や他の単一のメディア・セキュリティ・ソリューションやキーイングメカニズムは、RTPのすべての使用に対して要求することもできます。単一の共通のセキュリティ・ソリューションが存在しない場合には、RTPアプリケーションが使用されているそれぞれの異なるシナリオのための強力かつ相互運用可能なセキュリティを提供するために使用することができるかのメカニズムを検討することが重要です。これは、所望のRTPトラフィック保護とキー管理などのアプリケーションのそのクラスのためのMTIセキュリティ・ビルディング・ブロックの選択に続いてそれらが使用されるシナリオのためのセキュリティ要件を決定するために、アプリケーションの各クラスの分析が必要になります。この記事の執筆時点で入手可能なRTPのセキュリティオプションの非網羅的なリストは、[RFC7201]に概説されています。アプリケーションの各クラスは、セキュリティオプションは、その使用シナリオのために実装するために必須であるかを記述するメモでサポートされることが期待されます。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This entire memo is about mandatory-to-implement security.",
      "ja": "この全体のメモはおよそ実装に必須のセキュリティです。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Ralph Blom, Hannes Tschofenig, Dan York, Alfred Hoenes, Martin Ellis, Ali Begen, Keith Drage, Ray van Brandenburg, Stephen Farrell, Sean Turner, John Mattsson, and Benoit Claise for their feedback.",
      "ja": "彼らのフィードバックのためのラルフ・ブロム、ハンネスTschofenig、ダン・ニューヨーク、アルフレッドHoenes、マーティン・エリス、アリBegen、キース糖剤、レイ・バンブランデンブルク、スティーブン・ファレル、ショーン・ターナー、ジョン・マットソン、およびブノワClaiseに感謝します。"
    },
    {
      "indent": 0,
      "text": "10. Informative References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 3,
      "text": "[ISMACryp2] Internet Streaming Media Alliance (ISMA), \"ISMA Encryption and Authentication Version 2.0\", November 2007, <http://www.oipf.tv/images/site/DOCS/mpegif/ISMA/ isma_easpec2.0.pdf>.",
      "ja": "[ISMACryp2]インターネットストリーミングメディアアライアンス（ISMA）、 \"ISMA暗号化および認証バージョン2.0\"、2007年11月、<http://www.oipf.tv/images/site/DOCS/mpegif/ISMA/ isma_easpec2.0.pdf> 。"
    },
    {
      "indent": 3,
      "text": "[RFC0768] Postel, J., \"User Datagram Protocol\", STD 6, RFC 768, August 1980.",
      "ja": "[RFC0768]ポステル、J.、 \"ユーザ・データグラム・プロトコル\"、STD 6、RFC 768、1980年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC0793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981.",
      "ja": "[RFC0793]ポステル、J.、 \"伝送制御プロトコル\"、STD 7、RFC 793、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3365] Schiller, J., \"Strong Security Requirements for Internet Engineering Task Force Standard Protocols\", BCP 61, RFC 3365, August 2002.",
      "ja": "[RFC3365]シラー、J.、BCP 61、RFC 3365、2002年8月 \"インターネットエンジニアリングタスクフォース標準プロトコルのための強力なセキュリティ要件\"。"
    },
    {
      "indent": 3,
      "text": "[RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, July 2003.",
      "ja": "[RFC3550] Schulzrinneと、H.、Casner、S.、フレデリック、R.、およびV.ヤコブソン、 \"RTP：リアルタイムアプリケーションのためのトランスポートプロトコル\"、STD 64、RFC 3550、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC3711] Baugher, M., McGrew, D., Naslund, M., Carrara, E., and K. Norrman, \"The Secure Real-time Transport Protocol (SRTP)\", RFC 3711, March 2004.",
      "ja": "[RFC3711] Baugher、M.、マグリュー、D.、Naslund、M.、カララ、E.、およびK. Norrman、 \"セキュアリアルタイム転送プロトコル（SRTP）\"、RFC 3711、2004年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4340] Kohler, E., Handley, M., and S. Floyd, \"Datagram Congestion Control Protocol (DCCP)\", RFC 4340, March 2006.",
      "ja": "[RFC4340]コーラー、E.、ハンドリー、M.、およびS.フロイド、 \"データグラム輻輳制御プロトコル（DCCP）\"、RFC 4340、2006年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4585] Ott, J., Wenger, S., Sato, N., Burmeister, C., and J. Rey, \"Extended RTP Profile for Real-time Transport Control Protocol (RTCP)-Based Feedback (RTP/AVPF)\", RFC 4585, July 2006.",
      "ja": "[RFC4585]オット、J.、ウェンガー、S.、佐藤、N.、Burmeister、C.、およびJ.レイ「ベースのフィードバック（RTP / AVPF）リアルタイムトランスポート制御プロトコル（RTCP）の拡張RTPプロファイル」、RFC 4585、2006年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4614] Duke, M., Braden, R., Eddy, W., and E. Blanton, \"A Roadmap for Transmission Control Protocol (TCP) Specification Documents\", RFC 4614, September 2006.",
      "ja": "[RFC4614]デューク、M.、ブレーデン、R.、エディ、W.、及びE.ブラントン、RFC 4614、2006年9月 \"伝送制御プロトコル（TCP）仕様書のためのロードマップ\"。"
    },
    {
      "indent": 3,
      "text": "[RFC5479] Wing, D., Fries, S., Tschofenig, H., and F. Audet, \"Requirements and Analysis of Media Security Management Protocols\", RFC 5479, April 2009.",
      "ja": "[RFC5479]ウイング、D.、フライドポテト、S.、Tschofenig、H.、およびF. Audet、 \"要件とメディアセキュリティ管理プロトコルの分析\"、RFC 5479、2009年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC7201] Westerlund, M. and C. Perkins, \"Options for Securing RTP Sessions\", RFC 7201, April 2014.",
      "ja": "[RFC7201]ウェスター、M.とC.パーキンス、RFC 7201、2014年4月 \"RTPセッションの保護のオプション\"。"
    },
    {
      "indent": 3,
      "text": "[RTSP] Schulzrinne, H., Rao, A., Lanphier, R., Westerlund, M., and M. Stiemerling, \"Real Time Streaming Protocol 2.0 (RTSP)\", Work in Progress, February 2014.",
      "ja": "[RTSP] Schulzrinneと、H.、ラオ、A.、Lanphier、R.、ウェスター、M.、およびM. Stiemerling、 \"リアルタイムストリーミングプロトコル2.0（RTSP）\"、進歩、2014年2月に働いています。"
    },
    {
      "indent": 3,
      "text": "[T3GPP.26.346] 3GPP, \"Multimedia Broadcast/Multicast Service (MBMS); Protocols and codecs\", 3GPP TS 26.346 10.7.0, March 2013, <http://www.3gpp.org/ftp/Specs/html-info/26346.htm>.",
      "ja": "[T3GPP.26.346] 3GPP、 \"マルチメディアブロードキャスト/マルチキャストサービス（MBMS）;プロトコルとコーデック\"、3GPP TS 26.346 10.7.0、2013年3月、<http://www.3gpp.org/ftp/Specs/html-info > /26346.htm。"
    },
    {
      "indent": 3,
      "text": "[WebRTC-SEC] Rescorla, E., \"WebRTC Security Architecture\", Work in Progress, February 2014.",
      "ja": "[のWebRTC-SEC]レスコラ、E.、 \"のWebRTCセキュリティアーキテクチャ\"、進歩、2014年2月での作業。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Colin Perkins University of Glasgow School of Computing Science Glasgow G12 8QQ United Kingdom",
      "ja": "コンピューティング科学グラスゴーG12 8QQイギリスのグラスゴー大学のコリン・パーキンス大学"
    },
    {
      "indent": 3,
      "text": "EMail: csp@csperkins.org URI: http://csperkins.org/",
      "ja": "電子メール：csp@csperkins.org URI：http://csperkins.org/"
    },
    {
      "indent": 3,
      "text": "Magnus Westerlund Ericsson Farogatan 6 Kista SE-164 80 Sweden",
      "ja": "マグヌスウェスターエリクソンFärögatan6シスタSE-164 80スウェーデン"
    },
    {
      "indent": 3,
      "text": "EMail: magnus.westerlund@ericsson.com",
      "ja": "メールアドレス：magnus.westerlund@ericsson.com"
    }
  ]
}