{
  "title": {
    "text": "RFC 7557 - Extension Mechanism for the Babel Routing Protocol",
    "ja": "RFC 7557 - Babel Routing Protocolの拡張メカニズム"
  },
  "number": 7557,
  "created_at": "2020-08-30 16:10:45.830603+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                     J. Chroboczek\nRequest for Comments: 7557              PPS, University of Paris-Diderot\nUpdates: 6126                                                   May 2015\nCategory: Experimental\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Extension Mechanism for the Babel Routing Protocol",
      "ja": "Babel Routing Protocolの拡張メカニズム"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document defines the encoding of extensions to the Babel routing protocol, as specified in RFC 6126.",
      "ja": "このドキュメントでは、RFC 6126で指定されている、Babelルーティングプロトコルの拡張のエンコーディングを定義します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。試験、実験、評価のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントでは、インターネットコミュニティの実験プロトコルを定義します。これは、他のRFCストリームとは無関係に、RFCシリーズへの貢献です。 RFCエディターは、このドキュメントを独自の裁量で公開することを選択し、実装または展開に対するその価値については何も述べていません。 RFC Editorによって公開が承認されたドキュメントは、どのレベルのインターネット標準の候補にもなりません。 RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7557.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7557で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2015 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書は、BCP 78およびIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象であり、この文書の発行日に有効です。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Mechanisms for Extending the Babel Protocol . . . . . . . . .   3\n  2.1.  New Versions of the Babel Protocol  . . . . . . . . . . .   3\n  2.2.  New TLVs  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  2.3.  Sub-TLVs  . . . . . . . . . . . . . . . . . . . . . . . .   4\n  2.4.  The Flags Field . . . . . . . . . . . . . . . . . . . . .   4\n  2.5.  Packet Trailer  . . . . . . . . . . . . . . . . . . . . .   5\n3.  Format of Sub-TLVs  . . . . . . . . . . . . . . . . . . . . .   5\n  3.1.  Sub-TLVs Specified in This Document . . . . . . . . . . .   5\n  3.2.  Unknown Sub-TLVs  . . . . . . . . . . . . . . . . . . . .   6\n4.  Choosing between Extension Mechanisms . . . . . . . . . . . .   6\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   9\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  10\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .  10\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .  10\nAcknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .  10\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .  11",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "A Babel packet [RFC6126] contains a header followed by a sequence of TLVs, each of which is a sequence of octets having an explicit type and length. The original Babel protocol has the following provisions for including extension data:",
      "ja": "Babelパケット[RFC6126]にはヘッダーが含まれ、その後にTLVのシーケンスが続きます。各TLVは、明示的なタイプと長さを持つオクテットのシーケンスです。オリジナルのBabelプロトコルには、拡張データを含めるための以下の規定があります。"
    },
    {
      "indent": 3,
      "text": "o A Babel packet with a version number different from 2 MUST be silently ignored ([RFC6126], Section 4.2).",
      "ja": "o バージョン番号が2以外のBabelパケットは黙って無視する必要があります（[RFC6126]、セクション4.2）。"
    },
    {
      "indent": 3,
      "text": "o An unknown TLV MUST be silently ignored ([RFC6126], Section 4.3).",
      "ja": "o 不明なTLVは黙って無視する必要があります（[RFC6126]、セクション4.3）。"
    },
    {
      "indent": 3,
      "text": "o Except for Pad1 and PadN, all TLVs are self-terminating, and any extra data included in a TLV MUST be silently ignored ([RFC6126], Section 4.2).",
      "ja": "o Pad1とPadNを除いて、すべてのTLVは自己終端的であり、TLVに含まれる追加データは何も通知せずに無視する必要があります（[RFC6126]、セクション4.2）。"
    },
    {
      "indent": 3,
      "text": "o The Flags field of the Update TLV contains 6 undefined bits that MUST be silently ignored ([RFC6126], Section 4.4.9).",
      "ja": "o 更新TLVのフラグフィールドには6つの未定義ビットが含まれているため、暗黙的に無視する必要があります（[RFC6126]、セクション4.4.9）。"
    },
    {
      "indent": 3,
      "text": "o Any data following the last TLV of a Babel packet MUST be silently ignored ([RFC6126], Section 4.2).",
      "ja": "o Babelパケットの最後のTLVに続くデータは、黙って無視する必要があります（[RFC6126]、セクション4.2）。"
    },
    {
      "indent": 3,
      "text": "Each of these provisions provides a place to store data needed by extensions of the Babel protocol. However, in the absence of any further conventions, independently developed extensions to the Babel protocol might make conflicting uses of the available space, and therefore lead to implementations that would fail to interoperate.",
      "ja": "これらの各プロビジョニングは、Babelプロトコルの拡張に必要なデータを格納する場所を提供します。ただし、それ以上の規則がない場合、独自に開発されたBabelプロトコルの拡張機能は、利用可能なスペースの使用を競合させ、その結果、相互運用に失敗する実装につながる可能性があります。"
    },
    {
      "indent": 3,
      "text": "This document formalises a set of rules for extending the Babel protocol that are designed to ensure that no such incompatibilities arise, and that are currently respected by a number of deployed extensions.",
      "ja": "このドキュメントは、そのような非互換性が発生しないことを保証するように設計され、現在デプロイされている多数の拡張機能によって尊重されているBabelプロトコルを拡張するための一連のルールを形式化しています。"
    },
    {
      "indent": 3,
      "text": "In the rest of this document, we use the term \"original protocol\" for the protocol defined in [RFC6126], and \"extended protocol\" for any extension of the Babel protocol that follows the rules set out in this document.",
      "ja": "このドキュメントの残りの部分では、[RFC6126]で定義されているプロトコルに「元のプロトコル」という用語を使用し、このドキュメントに記載されているルールに従うBabelプロトコルの拡張に「拡張プロトコル」を使用します。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Mechanisms for Extending the Babel Protocol",
      "section_title": true,
      "ja": "2. Babelプロトコルを拡張するメカニズム"
    },
    {
      "indent": 3,
      "text": "This section describes each of the mechanisms available for extending the Babel protocol.",
      "ja": "このセクションでは、Babelプロトコルを拡張するために使用できる各メカニズムについて説明します。"
    },
    {
      "indent": 0,
      "text": "2.1. New Versions of the Babel Protocol",
      "section_title": true,
      "ja": "2.1. Babelプロトコルの新しいバージョン"
    },
    {
      "indent": 3,
      "text": "The header of a Babel packet contains an eight-bit protocol version. The current version of the Babel protocol is version 2; any packets containing a version number different from 2 MUST be silently ignored.",
      "ja": "Babelパケットのヘッダーには、8ビットのプロトコルバージョンが含まれています。 Babelプロトコルの現在のバージョンはバージョン2です。 2とは異なるバージョン番号を含むパケットは、黙って無視されなければなりません（MUST）。"
    },
    {
      "indent": 3,
      "text": "Versions 0 and 1 were earlier experimental versions of the Babel protocol that have seen some modest deployment; these version numbers SHOULD NOT be reused by future versions of the Babel protocol. Version numbers larger than 2 might be used by a future incompatible protocol.",
      "ja": "バージョン0と1は、適度な展開が見られるBabelプロトコルの初期の実験バージョンです。これらのバージョン番号は、Babelプロトコルの将来のバージョンで再利用しないでください。 2より大きいバージョン番号は、将来の非互換プロトコルで使用される可能性があります。"
    },
    {
      "indent": 0,
      "text": "2.2. New TLVs",
      "section_title": true,
      "ja": "2.2. 新しいTLV"
    },
    {
      "indent": 3,
      "text": "An extension may carry its data in a new TLV type. Such new TLVs will be silently ignored by implementations of the original Babel protocol, as well as by other extended implementations of the Babel protocol, as long as the TLV types do not collide.",
      "ja": "拡張機能は、新しいTLVタイプでデータを運ぶ場合があります。このような新しいTLVは、TLVのタイプが衝突しない限り、元のBabelプロトコルの実装や、Babelプロトコルの他の拡張実装によって黙って無視されます。"
    },
    {
      "indent": 3,
      "text": "All new TLVs MUST have the format defined in [RFC6126], Section 4.3. New TLVs SHOULD be self-terminating, in the sense defined in the next section, and any data found after the main data section of the TLV SHOULD be treated as a series of sub-TLVs.",
      "ja": "すべての新しいTLVは、[RFC6126]のセクション4.3で定義されたフォーマットを持つ必要があります。新しいTLVは、次のセクションで定義されている意味で自己終了する必要があり（SHOULD）、TLVのメインデータセクションの後にあるデータはすべて、一連のサブTLVとして扱われる必要があります（SHOULD）。"
    },
    {
      "indent": 3,
      "text": "TLV types 224 through 254 are reserved for Experimental Use [RFC3692]. TLV type 255 is reserved for expansion of the TLV type space, in the unlikely event that eight bits turn out not to be enough.",
      "ja": "TLVタイプ224〜254は、実験的使用[RFC3692]用に予約されています。 TLVタイプ255は、8ビットでは不十分であることが判明した場合に備えて、TLVタイプスペースの拡張用に予約されています。"
    },
    {
      "indent": 0,
      "text": "2.3. Sub-TLVs",
      "section_title": true,
      "ja": "2.3. サブTLV"
    },
    {
      "indent": 3,
      "text": "With the exception of the Pad1 TLV, all Babel TLVs carry an explicit length. With the exception of Pad1 and PadN, all TLVs defined by the original protocol are self-terminating, in the sense that the length of the meaningful data that they contain (the \"natural length\") can be determined without reference to the explicitly encoded length. In some cases, the natural length is trivial to determine: for example, a HELLO TLV always has a natural length of 2 (4 including the Type and Length fields). In other cases, determining the natural length is not that easy, but this needs to be done anyway by an implementation that interprets the given TLV. For example, the natural length of an Update TLV depends on both the prefix length and the amount of prefix compression being performed.",
      "ja": "Pad1 TLVを除いて、すべてのBabel TLVは明示的な長さを持ちます。 Pad1とPadNを除いて、元のプロトコルで定義されたすべてのTLVは、それらが含む意味のあるデータの長さ（「自然長」）を明示的にエンコードされた長さを参照せずに決定できるという意味で、自己終了します。 。場合によっては、自然長は簡単に判断できます。たとえば、HELLO TLVの自然長は常に2（タイプフィールドと長さフィールドを含めて4）です。他の場合では、自然な長さを決定することはそれほど簡単ではありませんが、これはとにかく、与えられたTLVを解釈する実装によって行われる必要があります。たとえば、Update TLVの本来の長さは、実行されるプレフィックス長とプレフィックス圧縮の量の両方に依存します。"
    },
    {
      "indent": 3,
      "text": "If the explicit length of a TLV defined by the original protocol is larger than its natural length, the extra space present in the TLV is silently ignored by an implementation of the original protocol; extended implementations MAY use it to store arbitrary data and SHOULD structure the additional data as a sequence of sub-TLVs. Unlike TLVs, the sub-TLVs themselves need not be self-terminating.",
      "ja": "元のプロトコルで定義されたTLVの明示的な長さがその自然な長さよりも長い場合、TLVに存在する余分なスペースは、元のプロトコルの実装によって黙って無視されます。拡張実装は、これを使用して任意のデータを格納し、追加のデータをサブTLVのシーケンスとして構造化する必要があります（SHOULD）。 TLVとは異なり、サブTLV自体は自己終端である必要はありません。"
    },
    {
      "indent": 3,
      "text": "An extension MAY be assigned one or more sub-TLV types. Sub-TLV types are assigned independently from TLV types: the same numeric type can be assigned to a TLV and a sub-TLV. Sub-TLV types are assigned globally: once an extension is assigned a given sub-TLV number, it MAY use this number within any TLV. However, the interpretation of a given sub-TLV type can depend on which particular TLV it is embedded within.",
      "ja": "拡張には、1つ以上のサブTLVタイプを割り当てることができます（MAY）。サブTLVタイプはTLVタイプとは別に割り当てられます。同じ数値タイプをTLVとサブTLVに割り当てることができます。サブTLVタイプはグローバルに割り当てられます。拡張機能に特定のサブTLV番号が割り当てられると、TLV内でこの番号を使用できます。ただし、特定のサブTLVタイプの解釈は、それが埋め込まれている特定のTLVに依存する場合があります。"
    },
    {
      "indent": 3,
      "text": "Sub-TLV types 224 through 254 are reserved for Experimental Use [RFC3692]. TLV type 255 is reserved for expansion of the sub-TLV type space, in the unlikely event that eight bits turn out not to be enough. The format of sub-TLVs is defined in Section 3 below.",
      "ja": "サブTLVタイプ224〜254は、実験的使用[RFC3692]用に予約されています。 TLVタイプ255は、8ビットでは不十分であることが判明した場合に備えて、サブTLVタイプスペースの拡張用に予約されています。サブTLVのフォーマットは、以下のセクション3で定義されています。"
    },
    {
      "indent": 0,
      "text": "2.4. The Flags Field",
      "section_title": true,
      "ja": "2.4. フラグフィールド"
    },
    {
      "indent": 3,
      "text": "The Flags field is an eight-bit field in the Update TLV. Bits 0 and 1 (the bits with values 80 and 40 hexadecimal) are defined by the original protocol and MUST be recognised and used by every implementation. The remaining six bits are not currently used and are silently ignored by implementations of the original protocol.",
      "ja": "Flagsフィールドは、Update TLVの8ビットフィールドです。ビット0と1（16進数の値が80と40のビット）は、元のプロトコルで定義されており、すべての実装で認識および使用する必要があります。残りの6ビットは現在使用されておらず、元のプロトコルの実装では通知なく無視されます。"
    },
    {
      "indent": 3,
      "text": "Due to the small size of the Flags field, it is NOT RECOMMENDED that one or more bits be assigned to an extension; a sub-TLV SHOULD be assigned instead. An implementation MUST ignore any bits in the Flags field that it does not know about and MUST send them as zero.",
      "ja": "フラグフィールドのサイズが小さいため、1つ以上のビットを拡張に割り当てることはお勧めしません。代わりにサブTLVを割り当てる必要があります。実装は、Flagsフィールド内の知らないビットを無視しなければならず、それらをゼロとして送信しなければなりません（MUST）。"
    },
    {
      "indent": 0,
      "text": "2.5. Packet Trailer",
      "section_title": true,
      "ja": "2.5. パケットトレーラー"
    },
    {
      "indent": 3,
      "text": "A Babel packet carries an explicit length in its header. A Babel packet is carried by a UDP datagram, which in turn contains an explicit length in its header. It is possible for a UDP datagram carrying a Babel packet to be larger than the size of the Babel packet. In that case, the extra space after the Babel packet, known as the packet trailer, is silently ignored by an implementation of the original protocol.",
      "ja": "Babelパケットは、ヘッダーに明示的な長さを持っています。 BabelパケットはUDPデータグラムによって運ばれ、UDPデータグラムはヘッダーに明示的な長さを含みます。 Babelパケットを伝送するUDPデータグラムがBabelパケットのサイズよりも大きくなる可能性があります。その場合、パケットトレーラーと呼ばれるBabelパケットの後の余分なスペースは、元のプロトコルの実装によって暗黙的に無視されます。"
    },
    {
      "indent": 3,
      "text": "The packet trailer was originally intended to be used as a cryptographic trailer. However, the authentication extension to Babel [RFC7298] ended up using a pair of new TLVs, and no currently deployed extension of Babel uses the packet trailer. The format and purpose of the packet trailer is therefore currently left undefined.",
      "ja": "パケットトレーラーは、もともと暗号トレーラーとして使用することを目的としていました。ただし、Babelへの認証拡張[RFC7298]は新しいTLVのペアを使用することになり、現在配備されているBabelの拡張ではパケットトレーラーを使用していません。したがって、パケットトレーラーの形式と目的は現在未定義のままです。"
    },
    {
      "indent": 0,
      "text": "3. Format of Sub-TLVs",
      "section_title": true,
      "ja": "3. サブTLVのフォーマット"
    },
    {
      "indent": 3,
      "text": "A sub-TLV has exactly the same structure as a TLV. Except for Pad1 (Section 3.1.1), all sub-TLVs have the following structure:",
      "ja": "サブTLVの構造はTLVとまったく同じです。 Pad1（セクション3.1.1）を除き、すべてのサブTLVは次の構造を持っています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     |     Body...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Fields:",
      "ja": "田畑："
    },
    {
      "indent": 3,
      "text": "Type The type of the sub-TLV.",
      "ja": "タイプサブTLVのタイプ。"
    },
    {
      "indent": 3,
      "text": "Length The length of the body, in octets, exclusive of the Type and Length fields.",
      "ja": "長さタイプと長さフィールドを除いたオクテット単位のボディの長さ。"
    },
    {
      "indent": 3,
      "text": "Body The sub-TLV body, the interpretation of which depends on both the type of the sub-TLV and the type of the TLV within which it is embedded.",
      "ja": "ボディサブTLVボディ。その解釈は、サブTLVのタイプとそれが埋め込まれているTLVのタイプの両方に依存します。"
    },
    {
      "indent": 0,
      "text": "3.1. Sub-TLVs Specified in This Document",
      "section_title": true,
      "ja": "3.1. このドキュメントで指定されているサブTLV"
    },
    {
      "indent": 3,
      "text": "This document defines two types of sub-TLVs, Pad1 and PadN. These two sub-TLVs MUST be correctly parsed and ignored by any extended implementation of the Babel protocol that uses sub-TLVs.",
      "ja": "このドキュメントでは、Pad1とPadNの2種類のサブTLVを定義しています。これらの2つのサブTLVは、正しく解析され、サブTLVを使用するBabelプロトコルの拡張実装によって無視される必要があります。"
    },
    {
      "indent": 0,
      "text": "3.1.1. Pad1",
      "section_title": true,
      "ja": "3.1.1. パッド1"
    },
    {
      "indent": 3,
      "text": " 0\n 0 1 2 3 4 5 6 7\n+-+-+-+-+-+-+-+-+\n|   Type = 0    |\n+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Fields:",
      "ja": "田畑："
    },
    {
      "indent": 3,
      "text": "Type Set to 0 to indicate a Pad1 sub-TLV.",
      "ja": "「0に設定」と入力して、Pad1サブTLVを示します。"
    },
    {
      "indent": 3,
      "text": "This sub-TLV is silently ignored on reception.",
      "ja": "このサブTLVは、受信時に暗黙的に無視されます。"
    },
    {
      "indent": 0,
      "text": "3.1.2. PadN",
      "section_title": true,
      "ja": "3.1.2. PadN"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Type = 1   |    Length     |      MBZ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Fields:",
      "ja": "田畑："
    },
    {
      "indent": 3,
      "text": "Type Set to 1 to indicate a PadN sub-TLV.",
      "ja": "Set 1と入力して、PadNサブTLVを示します。"
    },
    {
      "indent": 3,
      "text": "Length The length of the body, in octets, exclusive of the Type and Length fields.",
      "ja": "長さタイプと長さフィールドを除いたオクテット単位のボディの長さ。"
    },
    {
      "indent": 3,
      "text": "MBZ Set to 0 on transmission.",
      "ja": "MBZ送信時に0に設定されます。"
    },
    {
      "indent": 3,
      "text": "This sub-TLV is silently ignored on reception.",
      "ja": "このサブTLVは、受信時に暗黙的に無視されます。"
    },
    {
      "indent": 0,
      "text": "3.2. Unknown Sub-TLVs",
      "section_title": true,
      "ja": "3.2. 不明なサブTLV"
    },
    {
      "indent": 3,
      "text": "Any unknown sub-TLV MUST be silently ignored by an extended implementation that uses sub-TLVs.",
      "ja": "不明なサブTLVは、サブTLVを使用する拡張実装によって黙って無視される必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Choosing between Extension Mechanisms",
      "section_title": true,
      "ja": "4. 拡張メカニズムの選択"
    },
    {
      "indent": 3,
      "text": "New versions of the Babel protocol should only be defined if the new version is not backwards compatible with the original protocol.",
      "ja": "Babelプロトコルの新しいバージョンは、新しいバージョンが元のプロトコルとの下位互換性がない場合にのみ定義する必要があります。"
    },
    {
      "indent": 3,
      "text": "In many cases, an extension could be implemented either by defining a new TLV or by adding a new sub-TLV to an existing TLV. For example, an extension whose purpose is to attach additional data to route updates can be implemented either by creating a new \"enriched\" Update TLV or by adding a sub-TLV to the Update TLV.",
      "ja": "多くの場合、新しいTLVを定義するか、既存のTLVに新しいサブTLVを追加することにより、拡張機能を実装できます。たとえば、ルート更新に追加データを添付することを目的とする拡張機能は、新しい「強化された」更新TLVを作成するか、更新TLVにサブTLVを追加することによって実装できます。"
    },
    {
      "indent": 3,
      "text": "The two encodings are treated differently by implementations that do not understand the extension. In the case of a new TLV, the whole unknown TLV is ignored by an implementation of the original protocol, while in the case of a new sub-TLV, the TLV is parsed and acted upon, and the unknown sub-TLV is silently ignored. Therefore, a sub-TLV should be used by extensions that extend the Update in a compatible manner (the extension data may be silently ignored), while a new TLV must be used by extensions that make incompatible extensions to the meaning of the TLV (the whole TLV must be thrown away if the extension data is not understood).",
      "ja": "2つのエンコーディングは、拡張機能を理解しない実装では異なる方法で処理されます。新しいTLVの場合、未知のTLV全体は元のプロトコルの実装によって無視されますが、新しいサブTLVの場合、TLVは解析されて処理され、不明なサブTLVは黙って無視されます。したがって、サブTLVは、互換性のある方法で更新を拡張する拡張機能で使用する必要があります（拡張データは通知なく無視される場合があります）。一方、新しいTLVは、TLVの意味に互換性のない拡張を行う拡張機能で使用する必要があります（拡張データが理解されない場合、TLV全体を破棄する必要があります）。"
    },
    {
      "indent": 3,
      "text": "Using a new bit in the Flags field is equivalent to defining a new sub-TLV while using less space in the Babel packet. Due to the limited Flags space, and the doubtful space savings, we do not recommend the use of bits in the Flags field -- a new sub-TLV should be used instead.",
      "ja": "Flagsフィールドで新しいビットを使用することは、Babelパケットで使用するスペースを減らしながら、新しいサブTLVを定義することと同じです。フラグスペースが限られていること、およびスペースの節約が疑わしいため、フラグフィールドでビットを使用することはお勧めしません。代わりに新しいサブTLVを使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "We refrain from making any recommendations about the usage of the packet trailer due to the lack of implementation experience.",
      "ja": "実装経験が不足しているため、パケットトレーラーの使用に関する推奨は行いません。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has created three new registries, called \"Babel TLV Types\", \"Babel Sub-TLV Types\", and \"Babel Flags Values\". The allocation policy for each of these registries is Specification Required [RFC5226].",
      "ja": "IANAは、「Babel TLV Types」、「Babel Sub-TLV Types」、および「Babel Flags Values」と呼ばれる3つの新しいレジストリを作成しました。これらの各レジストリの割り当てポリシーは、Specification Required [RFC5226]です。"
    },
    {
      "indent": 3,
      "text": "The initial values in the \"Babel TLV Types\" registry are as follows:",
      "ja": "「Babel TLV Types」レジストリの初期値は次のとおりです。"
    },
    {
      "indent": 0,
      "text": "   +---------+-----------------------------------------+---------------+\n   | Type    | Name                                    | Reference     |\n   +---------+-----------------------------------------+---------------+\n   | 0       | Pad1                                    | [RFC6126]     |\n   |         |                                         |               |\n   | 1       | PadN                                    | [RFC6126]     |\n   |         |                                         |               |\n   | 2       | Acknowledgment Request                  | [RFC6126]     |\n   |         |                                         |               |\n   | 3       | Acknowledgment                          | [RFC6126]     |\n   |         |                                         |               |\n   | 4       | Hello                                   | [RFC6126]     |\n   |         |                                         |               |\n   | 5       | IHU                                     | [RFC6126]     |\n   |         |                                         |               |\n   | 6       | Router-Id                               | [RFC6126]     |\n   |         |                                         |               |\n   | 7       | Next Hop                                | [RFC6126]     |\n   |         |                                         |               |\n   | 8       | Update                                  | [RFC6126]     |\n   |         |                                         |               |\n   | 9       | Route Request                           | [RFC6126]     |\n   |         |                                         |               |\n   | 10      | Seqno Request                           | [RFC6126]     |\n   |         |                                         |               |\n   | 11      | TS/PC                                   | [RFC7298]     |\n   |         |                                         |               |\n   | 12      | HMAC                                    | [RFC7298]     |\n   |         |                                         |               |\n   | 13      | Source-specific Update                  | [BABEL-SS]    |\n   |         |                                         |               |\n   | 14      | Source-specific Request                 | [BABEL-SS]    |\n   |         |                                         |               |\n   | 15      | Source-specific Seqno Request           | [BABEL-SS]    |\n   |         |                                         |               |\n   | 224-254 | Reserved for Experimental Use           | this document |\n   |         |                                         |               |\n   | 255     | Reserved for expansion of the type      | this document |\n   |         | space                                   |               |\n   +---------+-----------------------------------------+---------------+\n   The initial values in the \"Babel Sub-TLV Types\" registry are as\n   follows:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "+---------+-----------------------------------------+---------------+\n| Type    | Name                                    | Reference     |\n+---------+-----------------------------------------+---------------+\n| 0       | Pad1                                    | this document |\n|         |                                         |               |\n| 1       | PadN                                    | this document |\n|         |                                         |               |\n| 2       | Diversity                               | [BABEL-DIV]   |\n|         |                                         |               |\n| 3       | Timestamp                               | [BABEL-RTT]   |\n|         |                                         |               |\n| 224-254 | Reserved for Experimental Use           | this document |\n|         |                                         |               |\n| 255     | Reserved for expansion of the type      | this document |\n|         | space                                   |               |\n+---------+-----------------------------------------+---------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The initial values in the \"Babel Flags Values\" registry are as follows:",
      "ja": "「Babel Flags Values」レジストリの初期値は次のとおりです。"
    },
    {
      "indent": 18,
      "text": "+-----+-------------------+-----------+\n| Bit | Name              | Reference |\n+-----+-------------------+-----------+\n| 0   | Default prefix    | [RFC6126] |\n|     |                   |           |\n| 1   | Default router-id | [RFC6126] |\n|     |                   |           |\n| 2-7 | Unassigned        |           |\n+-----+-------------------+-----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document specifies the structure of fields that are already present in the original Babel protocol and does not, by itself, raise any new security considerations. Specific extensions may change the security properties of the protocol, for example, by adding security mechanisms [RFC7298] or by enabling new kinds of attack.",
      "ja": "このドキュメントは、元のBabelプロトコルにすでに存在するフィールドの構造を指定し、それ自体では、新しいセキュリティ上の考慮事項を提起しません。特定の拡張機能は、たとえば、セキュリティメカニズムを追加することで[RFC7298]、または新しい種類の攻撃を有効にすることで、プロトコルのセキュリティプロパティを変更する場合があります。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3692] Narten, T., \"Assigning Experimental and Testing Numbers Considered Useful\", BCP 82, RFC 3692, DOI 10.17487/RFC3692, January 2004, <http://www.rfc-editor.org/info/rfc3692>.",
      "ja": "[RFC3692] Narten、T。、「Assigning Testing and Testing Numbers考慮された有用」、BCP 82、RFC 3692、DOI 10.17487 / RFC3692、2004年1月、<http://www.rfc-editor.org/info/rfc3692>。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, DOI 10.17487/RFC5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "ja": "[RFC5226] Narten、T。およびH. Alvestrand、「RFCでIANAの考慮事項セクションを作成するためのガイドライン」、BCP 26、RFC 5226、DOI 10.17487 / RFC5226、2008年5月、<http://www.rfc-editor.org / info / rfc5226>。"
    },
    {
      "indent": 3,
      "text": "[RFC6126] Chroboczek, J., \"The Babel Routing Protocol\", RFC 6126, DOI 10.17487/RFC6126, April 2011, <http://www.rfc-editor.org/info/rfc6126>.",
      "ja": "[RFC6126] Chroboczek、J。、「The Babel Routing Protocol」、RFC 6126、DOI 10.17487 / RFC6126、2011年4月、<http://www.rfc-editor.org/info/rfc6126>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[BABEL-DIV] Chroboczek, J., \"Diversity Routing for the Babel Routing Protocol\", Work in Progress, draft-chroboczek-babel-diversity-routing-00, July 2014.",
      "ja": "[BABEL-DIV] Chroboczek、J。、「Babel Routing Protocolの多様性ルーティング」、進行中の作業、draft-chroboczek-babel-diversity-routing-00、2014年7月。"
    },
    {
      "indent": 3,
      "text": "[BABEL-RTT] Jonglez, B. and J. Chroboczek, \"Delay-based Metric Extension for the Babel Routing Protocol\", Work in Progress, draft-jonglez-babel-rtt-extension-01, May 2015.",
      "ja": "[BABEL-RTT] Jonglez、B。およびJ. Chroboczek、「Babel Routing Protocolの遅延ベースのメトリック拡張」、作業中、draft-jonglez-babel-rtt-extension-01、2015年5月。"
    },
    {
      "indent": 3,
      "text": "[BABEL-SS] Boutier, M. and J. Chroboczek, \"Source-Specific Routing in Babel\", Work in Progress, draft-boutier-babel-source-specific-01, May 2015.",
      "ja": "[BABEL-SS] Boutier、M.、J。Chroboczek、「Babelでのソース固有のルーティング」、Work in Progress、draft-boutier-babel-source-specific-01、2015年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC7298] Ovsienko, D., \"Babel Hashed Message Authentication Code (HMAC) Cryptographic Authentication\", RFC 7298, DOI 10.17487/RFC7298, July 2014, <http://www.rfc-editor.org/info/rfc7298>.",
      "ja": "[RFC7298] Ovsienko、D。、「Babel Hashed Message Authentication Code（HMAC）Cryptographic Authentication」、RFC 7298、DOI 10.17487 / RFC7298、2014年7月、<http://www.rfc-editor.org/info/rfc7298>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "I am grateful to Denis Ovsienko and Gabriel Kerneis for their feedback on previous draft versions of this document.",
      "ja": "このドキュメントの以前のドラフトバージョンに対するフィードバックを提供してくれたDenis OvsienkoとGabriel Kerneisに感謝します。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Juliusz Chroboczek PPS, University of Paris-Diderot Case 7014 75205 Paris Cedex 13 France",
      "ja": "Juliusz Chroboczek PPS、パリ大​​学ディドロ事件7014 75205 Paris Cedex 13フランス"
    },
    {
      "indent": 3,
      "text": "EMail: jch@pps.univ-paris-diderot.fr",
      "raw": true,
      "ja": ""
    }
  ]
}