{
  "title": {
    "text": "RFC 7823 - Performance-Based Path Selection for Explicitly Routed Label Switched Paths (LSPs) Using TE Metric Extensions",
    "ja": "RFC 7823 - 明示的ルートラベルのためのパフォーマンスベースの経路選択は、TEメトリック拡張機能を使用したスイッチパス（LSP）"
  },
  "number": 7823,
  "created_at": "2019-11-02 05:09:12.038083+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          A. Atlas\nRequest for Comments: 7823                                      J. Drake\nCategory: Informational                                 Juniper Networks\nISSN: 2070-1721                                             S. Giacalone\n                                                               Microsoft\n                                                              S. Previdi\n                                                           Cisco Systems\n                                                                May 2016",
      "raw": true
    },
    {
      "indent": 0,
      "text": " Performance-Based Path Selection for Explicitly Routed Label Switched Paths (LSPs) Using TE Metric Extensions",
      "ja": "明示的ルートラベルのためのパフォーマンスベースの経路選択は、TEメトリック拡張機能を使用したスイッチパス（LSP）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "In certain networks, it is critical to consider network performance criteria when selecting the path for an explicitly routed RSVP-TE Label Switched Path (LSP). Such performance criteria can include latency, jitter, and loss or other indications such as the conformance to link performance objectives and non-RSVP TE traffic load. This specification describes how a path computation function may use network performance data, such as is advertised via the OSPF and IS-IS TE metric extensions (defined outside the scope of this document) to perform such path selections.",
      "ja": "特定のネットワークでは、明示的にルーティングされたRSVP-TEラベルスイッチパス（LSP）のパスを選択する際のネットワーク性能基準を考慮することが重要です。このような性能基準は、このようなパフォーマンス目標と非RSVP TEトラフィック負荷をリンクするための適合として遅延、ジッタ、および損失または他の適応症を含めることができます。この仕様は、経路計算機能は、OSPFを介してアドバタイズされるように、ネットワーク・パフォーマンス・データを使用することができる方法を説明し、そのような経路の選択を実行する（この文書の範囲外で定義された）TEメトリック拡張は、です。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7823.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7823で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n  1.1.  Basic Requirements  . . . . . . . . . . . . . . . . . . .   4\n  1.2.  Oscillation and Stability Considerations  . . . . . . . .   4\n2.  Using Performance Data Constraints  . . . . . . . . . . . . .   5\n  2.1.  End-to-End Constraints  . . . . . . . . . . . . . . . . .   5\n  2.2.  Link Constraints  . . . . . . . . . . . . . . . . . . . .   6\n  2.3.  Links out of Compliance with Link Performance Objectives    6\n    2.3.1.  Use of Anomalous Links for New Paths  . . . . . . . .   7\n    2.3.2.  Links Entering the Anomalous State  . . . . . . . . .   7\n    2.3.3.  Links Leaving the Anomalous State . . . . . . . . . .   8\n3.  Security Considerations . . . . . . . . . . . . . . . . . . .   8\n4.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   8\n  4.1.  Normative References  . . . . . . . . . . . . . . . . . .   8\n  4.2.  Informative References  . . . . . . . . . . . . . . . . .   8\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   9\nContributors  . . . . . . . . . . . . . . . . . . . . . . . . . .  10\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  10",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "In certain networks, such as financial information networks, network performance information is becoming as critical to data-path selection as other existing metrics. Network performance information can be obtained via either the TE Metric Extensions in OSPF [RFC7471] or IS-IS [RFC7810] or via a management system. As with other TE information flooded via OSPF or IS-IS, the TE metric extensions have a flooding scope limited to the local area or level. This document describes how a path computation function, whether in an ingress LSR or a PCE [RFC4655], can use that information for path selection for explicitly routed LSPs. The selected path may be signaled via RSVP-TE [RFC3209] [RFC3473] or simply used by the ingress with segment",
      "ja": "金融情報ネットワークなどの特定のネットワークでは、ネットワークのパフォーマンス情報は、他の既存のメトリックなどのデータ・パスの選択についての重要になってきています。ネットワーク性能情報は、OSPF [RFC7471]のいずれかでTEメトリック拡張を介して取得することができるか、[RFC7810]または管理システムを介してIS-IS。 OSPFまたはIS-ISを経由して浸水他のTE情報と同様に、TEメトリックの拡張機能は、ローカルエリアまたはレベルに制限氾濫範囲を持っています。この文書では、経路計算機能は、入口LSRまたはPCE [RFC4655]にするかどうかを、明示的にルーティングされたLSPのためのパス選択のためにその情報を使用する方法について説明します。選択されたパスは、RSVP-TE [RFC3209]、[RFC3473]を介してシグナリングまたは単にセグメントと入力することによって使用することができます"
    },
    {
      "indent": 3,
      "text": "routing [SEG-ROUTE-MPLS] to properly forward the packet. Methods of optimizing path selection for multiple parameters are generally computationally complex. However, there are good heuristics for the delay-constrained lowest-cost (DCLC) computation problem [k-Paths_DCLC] that can be applied to consider both path cost and a maximum delay bound. Some of the network performance information can also be used to prune links from a topology before computing the path.",
      "ja": "ルーティング[SEG-ROUTE-MPLS]は正しくパケットを転送します。複数のパラメータのための経路選択を最適化する方法は、一般に、計算上複雑です。しかし、パスコストと結合した最大遅延の両方を考慮するために適用することができる遅延制約最小コスト（DCLC）計算問題[K-Paths_DCLC]のための良好なヒューリスティックがあります。ネットワークパフォーマンス情報の一部は、パスを計算する前に、トポロジからのリンクを剪定するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "The path selection mechanisms described in this document apply to paths that are fully computed by the head-end of the LSP and then signaled in an Explicit Route Object (ERO) where every sub-object is strict. This allows the head-end to consider IGP-distributed performance data without requiring the ability to signal the performance constraints in an object of the RSVP Path message.",
      "ja": "本書では説明経路選択メカニズムは完全にはLSPのヘッドエンドによって計算した後、すべてのサブオブジェクトが厳密で明示的ルート・オブジェクト（ERO）にシグナリングされるパスに適用されます。これは、RSVP Pathメッセージのオブジェクトのパフォーマンス制約をシグナリングする能力を必要とすることなく、IGP-分散性能データを考慮するヘッドエンドを可能にします。"
    },
    {
      "indent": 3,
      "text": "When considering performance-based data, it is obvious that there are additional contributors to latency beyond just the links. Clearly end-to-end latency is a combination of router latency (e.g., latency from traversing a router without queueing delay), queuing latency, physical link latency, and other factors. While traversing a router can cause delay, that router latency can be included in the advertised link delay. As described in [RFC7471] and [RFC7810], queuing delay must not be included in the measurements advertised by OSPF or IS-IS.",
      "ja": "パフォーマンスベースのデータを考慮すると、それだけでリンクを超えてレイテンシの追加の貢献があることは明らかです。明らかに、エンドツーエンド待ち時間が待ち時間、物理リンクの待ち時間、およびその他の要因をキューイング、ルータレイテンシ（遅延キューイングすることなく、ルータを横断するから、例えば、レイテンシ）の組み合わせです。ルータを通過すると、遅延を引き起こす可能性がありますが、そのルータの待ち時間は、広告を出してリンク遅延に含めることができます。 [RFC7471]及び[RFC7810]に記載されているように、キューイング遅延がOSPFによってアドバタイズ測定値に含まれてはならないか、 - です。"
    },
    {
      "indent": 3,
      "text": "Queuing latency is specifically excluded to insure freedom from oscillations and stability issues that have plagued prior attempts to use delay as a routing metric. If application traffic follows a path based upon latency constraints, the same traffic might be in an Expedited Forwarding Per-Hop Behavior (PHB) [RFC3246] with minimal queuing delay or another PHB with potentially very substantial per-hop queuing delay. Only traffic that experiences relatively low congestion, such as Expedited Forwarding traffic, will experience delays very close to the sum of the reported link delays.",
      "ja": "キューイング待ち時間は、特に振動およびルーティングメトリックとして遅延を使用する従来の試みを悩ませてきた安定性の問題から自由を保証するために除外されます。アプリケーショントラフィックがレイテンシ制約に基づいて経路をたどる場合、同一のトラフィックが最小のキューイング遅延または潜在的に非常に実質的なホップごとのキューイング遅延を有する別のPHBと[RFC3246]緊急転送ホップ単位動作（PHB）であるかもしれません。トラフィックのみ、このような緊急転送トラフィックなどの体験比較的低い混雑は、報告されたリンク遅延の合計に非常に近い遅延が発生します。"
    },
    {
      "indent": 3,
      "text": "This document does not specify how a router determines what values to advertise by the IGP; it does assume that the constraints specified in [RFC7471] and [RFC7810] are followed. Additionally, the end-to-end performance that is computed for an LSP path should be built from the individual link data. Any end-to-end characterization used to determine an LSP's performance compliance should be fully reflected in the Traffic Engineering Database so that a path calculation can also determine whether a path under consideration would be in compliance.",
      "ja": "この文書では、ルータはIGPで宣伝する値を決定する方法を指定しません。それは、[RFC7471]と[RFC7810]で指定された制約に従っていることを前提としていません。また、LSPパスについて計算されたエンドツーエンドの性能は、個々のリンクデータから構築されるべきです。パス計算も検討中のパスが準拠するかどうかを決定できるように、LSPのパフォーマンスコンプライアンスを決定するために使用されるすべてのエンド・ツー・エンドの特性が完全にトラフィックエンジニアリングデータベースに反映されるべきです。"
    },
    {
      "indent": 0,
      "text": "1.1. Basic Requirements",
      "section_title": true,
      "ja": "1.1. 基本要件"
    },
    {
      "indent": 3,
      "text": "The following are the requirements considered for a path computation function that uses network performance criteria.",
      "ja": "次のネットワーク性能基準を使用して経路計算機能で考慮要件です。"
    },
    {
      "indent": 3,
      "text": "1. Select a TE tunnel's path based upon a combination of existing constraints as well as on link-latency, packet loss, jitter, conformance with link performance objectives, and bandwidth consumed by non-RSVP-TE traffic.",
      "ja": "1.既存の制約の組み合わせにだけでなく、リンク遅延、パケットロス、ジッタ、リンクの性能目標との適合性、および非RSVP-TEトラフィックによって消費される帯域幅に基づいて、TEトンネルのパスを選択します。"
    },
    {
      "indent": 3,
      "text": "2. Ability to define different end-to-end performance requirements for each TE tunnel regardless of common use of resources.",
      "ja": "かかわらず、リソースの一般的な使用の各TEトンネルの異なるエンド・ツー・エンドの性能要件を定義する2.能力。"
    },
    {
      "indent": 3,
      "text": "3. Ability to periodically verify with the TE Link State Database (LSDB) that a TE tunnel's current LSP complies with its configured end-to-end performance requirements.",
      "ja": "定期TEトンネルの現在のLSPは、その構成されたエンドツーエンドのパフォーマンス要件に準拠していることTEリンク状態データベース（LSDB）を用いて検証する。3.能力。"
    },
    {
      "indent": 3,
      "text": "4. Ability to move tunnels, using make-before-break, based upon computed end-to-end performance complying with constraints.",
      "ja": "メイク前にブレーク、計算されたエンド・ツー・エンドのパフォーマンスが制約に準拠に基づいて使用して、トンネルを移動する4.能力。"
    },
    {
      "indent": 3,
      "text": "5. Ability to move tunnels away from any link that is violating an underlying link performance objective.",
      "ja": "基本的なリンク性能目標に違反している任意のリンクから離れてトンネルを移動する5.能力。"
    },
    {
      "indent": 3,
      "text": "6. Ability to optionally avoid setting up tunnels using any link that is violating a link performance objective, regardless of whether end-to-end performance would still meet requirements.",
      "ja": "かかわらず、エンド・ツー・エンドのパフォーマンスはまだ要件を満たしているかどうかの、リンク性能目標に違反している任意のリンクを使用してトンネルを設定しないように任意に6.機能。"
    },
    {
      "indent": 3,
      "text": "7. Ability to revert back, using make-before-break, to the best path after a configurable period.",
      "ja": "メイク前にブレーク、設定可能な期間の後に最適なパスを使用して、戻すための7機能。"
    },
    {
      "indent": 0,
      "text": "1.2. Oscillation and Stability Considerations",
      "section_title": true,
      "ja": "1.2. 振動と安定性の考慮事項"
    },
    {
      "indent": 3,
      "text": "Past attempts to use unbounded delay or loss as a metric suffered from severe oscillations. The use of performance based data must be such that undamped oscillations are not possible and stability cannot be impacted.",
      "ja": "過去には厳しい振動に苦しんメトリックとして無限の遅延や損失を使用しようとします。パフォーマンスベースのデータの使用は非減衰振動が不可能であり、安定性が影響を受けることができないようなものでなければなりません。"
    },
    {
      "indent": 3,
      "text": "The use of timers is often cited as a cure. Oscillation that is damped by timers is known as \"slosh\". If advertisement timers are very short relative to the jitter applied to RSVP-TE Constrained Shortest Path First (CSPF) timers, then a partial oscillation occurs. If RSVP-TE CSPF timers are short relative to advertisement timers, full oscillation (all traffic moving back and forth) can occur. Even a partial oscillation causes unnecessary reordering that is considered at least minimally disruptive.",
      "ja": "タイマーの使用は、多くの場合、治療法として引用されています。タイマーによって減衰された振動は、「スラッシュ」として知られています。広告のタイマーは非常にジッタに対して短いが、制約付き最短パスファースト（CSPF）タイマー-TEをRSVPに適用されている場合は、部分的な振動が発生します。 RSVP-TE CSPFタイマーが広告タイマーに対して短いしている場合は、完全な振動が発生する可能性があります（すべてのトラフィックが前後に移動します）。でも、部分的な振動は、少なくとも最小限に破壊的と考えられている不必要な並べ替えが発生します。"
    },
    {
      "indent": 3,
      "text": "Delay variation or jitter is affected by even small traffic levels. At even tiny traffic levels, the probability of a queue occupancy of one can produce a measured jitter proportional to or equal to the packet serialization delay. Very low levels of traffic can increase the probability of queue occupancies of two or three packets enough to further increase the measured jitter. Because jitter measurement is extremely sensitive to very low traffic levels, any use of jitter is likely to oscillate. However, there may be uses of a jitter measurement in path computation that can be considered free of oscillation.",
      "ja": "遅延変動やジッタが小さくても、トラフィックレベルによって影響されます。でも小さなトラフィックレベルでは、1のキュー占有の確率はに比例またはパケットのシリアル化遅延に等しい測定したジッタを生成することができます。トラフィックの非常に低いレベルでは、さらに、測定ジッタが増加するのに十分な2つのまたは3つのパケットのキュー占有率の確率を高めることができます。ジッタ測定が非常に低いトラフィックレベルに非常に敏感であるため、ジッタのいずれかの使用が発振する可能性があります。しかしながら、振動のないと考えることができる経路計算におけるジッタ測定の用途があるかもしれません。"
    },
    {
      "indent": 3,
      "text": "Delay measurements that are not sensitive to traffic loads may be safely used in path computation. Delay measurements made at the link layer or measurements made at a queuing priority higher than any significant traffic (such as Differentiated Services Code Point (DSCP) CS7 or CS6 [RFC4594], but not CS2 if traffic levels at CS3 and higher or Expedited Forwarding and Assured Forwarding can affect the measurement). Making delay measurements at the same priority as the traffic on affected paths is likely to cause oscillations.",
      "ja": "トラフィック負荷に対して敏感ではない遅延測定を安全経路計算に使用することができます。 CS3及びより高いまたは優先転送におけるトラフィックレベルであれば、キューイングこのような差別化サービスコードポイント（DSCP）CS7又はCS6 [RFC4594]などの任意の有意なトラフィックよりも高い優先度（はなく、CS2で行わリンク層又は測定で行われた遅延測定及び保証転送）は、測定に影響を与えることができます。影響を受けたパス上のトラフィックと同じ優先度で遅延測定を行うことは振動を引き起こす可能性があります。"
    },
    {
      "indent": 0,
      "text": "2. Using Performance Data Constraints",
      "section_title": true,
      "ja": "2.パフォーマンスデータの制約を使用して"
    },
    {
      "indent": 0,
      "text": "2.1. End-to-End Constraints",
      "section_title": true,
      "ja": "2.1. エンドツーエンドの制約"
    },
    {
      "indent": 3,
      "text": "The per-link performance data available in the IGP [RFC7471] [RFC7810] includes: unidirectional link delay, unidirectional delay variation, and link loss. Each (or all) of these parameters can be used to create the path-level link-based parameter.",
      "ja": "IGP [RFC7471]、[RFC7810]で使用可能なリンクごとのパフォーマンスデータは、単方向リンク遅延、一方向の遅延変動、およびリンク損失。これらのパラメータの各々（または全て）がパスレベルリンクベースのパラメータを作成するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "It is possible to compute a CSPF where the link latency values are used instead of TE metrics; this results in ignoring the TE metrics and causing LSPs to prefer the lowest-latency paths. In practical scenarios, latency constraints are typically a bound constraint rather than a minimization objective. An end-to-end latency upper bound merely requires that the path computed be no more than that bound and does not require that it be the minimum latency path. The latter is exactly the DCLC problem to which good heuristics have been proposed in the literature (e.g., [k-Paths_DCLC]).",
      "ja": "リンク・レイテンシの値が代わりにTEメトリックのに使用されるCSPFを計算することが可能です。これは、TEメトリックを無視すると最低のレイテンシーパスを好むLSPを引き起こすことになります。実用的なシナリオでは、待ち時間の制約は、一般的にバインドされた制約はなく、最小化目標です。上部単に結合し、エンドツーエンド待ち時間は、パスがそのバウンドを超えない計算され、それは最小レイテンシパスであることを必要としないことを要求します。後者は、良好なヒューリスティックは、文献（例えば、[K-Paths_DCLC]）で提案されているため、正確にDCLC問題です。"
    },
    {
      "indent": 3,
      "text": "An end-to-end bound on delay variation can be used similarly as a constraint in the path computation on what links to explore where the path's delay variation is the sum of the used links' delay variations.",
      "ja": "エンド・ツー・エンドの遅延変動に結合したパスの遅延変動が使用されるリンク遅延変動の和であるところ探索するのに何リンク上の経路計算に制約として同様に使用することができます。"
    },
    {
      "indent": 3,
      "text": "For link loss, the path loss is not the sum of the used links' losses. Instead, the path loss fraction is 1 - (1 - loss_L1)* (1 - loss_L2)*...*(1 - loss_Ln), where the links along the path are L1 to Ln with loss_Li in fractions. This computation is discussed in more detail in Sections 5.1.4 and 5.1.5 in [RFC6049]. The end-to-end link loss bound, computed in this fashion, can also be used as a constraint in the path computation.",
      "ja": "リンク損失のために、経路損失が使用されるリンク損失の合計ではありません。代わりに、経路損失分数は1  - （1  -  loss_L1）*（1  -  loss_L2）* ... *（1  -  loss_Ln）、経路に沿ったリンクを画分にloss_LiとのLnにL1です。この計算は、セクション5.1.4および5.1.5 [RFC6049]にでより詳細に説明します。このように計算された結合されたエンドツーエンドのリンク損失は、また、経路計算における制約として使用することができます。"
    },
    {
      "indent": 3,
      "text": "The heuristic algorithms for DCLC only address one constraint bound but having a CSPF that limits the paths explored (i.e., based on hop count) can be combined [hop-count_DCLC].",
      "ja": "DCLCためのヒューリスティックアルゴリズムのみ結合した1つの制約に対処するが、経路が探索さ制限CSPFを有する（すなわち、ホップ数に基づいて）組み合わせることができる[ホップcount_DCLC]。"
    },
    {
      "indent": 0,
      "text": "2.2. Link Constraints",
      "section_title": true,
      "ja": "2.2. リンク制約"
    },
    {
      "indent": 3,
      "text": "In addition to selecting paths that conform to a bound on performance data, it is also useful to avoid using links that do not meet a necessary constraint. Naturally, if such a parameter were a known fixed value, then resource attribute flags could be used to express this behavior. However, when the parameter associated with a link may vary dynamically, there is not currently a configuration-time mechanism to enforce such behavior. An example of this is described in Section 2.3, where links may move in and out of conformance for link performance objectives with regards to latency, delay variation, and link loss.",
      "ja": "演奏データにバインドされたに準拠するパスを選択することに加えて、必要な制約を満たしていないリンクの使用を避けることも有用です。当然のことながら、そのようなパラメータは、既知の固定値であった場合には、属性フラグリソースこの現象を発現させるために使用することができます。リンクに関連付けられたパラメータは、動的に変化することができるしかし、このような動作を実施する構成タイム機構は現在存在しません。この例は、リンクの待ち時間、遅延変動、及びリンク損失に関してリンク性能目標のために及び適合の外に移動することができるセクション2.3に記載されています。"
    },
    {
      "indent": 3,
      "text": "When doing path selection for TE tunnels, it has not been possible to know how much actual bandwidth is available that includes the bandwidth used by non-RSVP-TE traffic. In [RFC7471] and [RFC7810], the Unidirectional Available Bandwidth is advertised as is the Residual Bandwidth. When computing the path for a TE tunnel, only links with at least a minimum amount of Unidirectional Available Bandwidth might be permitted.",
      "ja": "TEトンネルのパス選択を行う際には、実際の帯域幅は非RSVP-TEのトラフィックが使用する帯域幅を含んでいる可能ですどのくらい知っていることはできませんでした。 [RFC7471]及び[RFC7810]において、一方向利用可能な帯域幅が残余帯域であると宣伝されています。 TEトンネルのパスを計算するとき、唯一の少なくとも一方向利用可能な帯域幅の最小量は許容されるかもしれないとリンク。"
    },
    {
      "indent": 3,
      "text": "Similarly, only links whose loss is under a configurable value might be acceptable. For these constraints, each link can be tested against the constraint and only explored in the path computation if the link passes. In essence, a link that fails the constraint test is treated as if it contained a resource attribute in the exclude-any filter.",
      "ja": "同様に、その損失、設定値の下にあるリンクのみが許容できるかもしれません。これらの制約のために、各リンクは、制約に対してテストすることができ、リンクが合格した場合のみ、経路計算で検討します。それは除外し、いずれかをフィルタでリソース属性が含まれているかのよう本質的には、制約のテストに失敗したリンクが処理されます。"
    },
    {
      "indent": 0,
      "text": "2.3. Links out of Compliance with Link Performance Objectives",
      "section_title": true,
      "ja": "2.3. リンク性能目標の遵守のうちリンク"
    },
    {
      "indent": 3,
      "text": "Link conformance to a link performance objective can change as a result of rerouting at lower layers. This could be due to optical regrooming or simply rerouting of an FA-LSP. When this occurs, there are two questions to be asked:",
      "ja": "リンク性能目標へのリンクの適合性は、下位層での再ルーティングの結果として変更することができます。これは、光学regroomingまたは単にFA-LSPの再ルーティングに起因するかもしれません。これが発生すると、尋ねられるするには2つの質問があります。"
    },
    {
      "indent": 3,
      "text": "a. Should the link be trusted and used for the setup of new LSPs?",
      "ja": "A。リンクは信頼され、新しいLSPのセットアップに使用されるべきか？"
    },
    {
      "indent": 3,
      "text": "b. Should LSPs using this link automatically be moved to a secondary path?",
      "ja": "B。このリンクを使用してLSPは、自動的にセカンダリパスに移動する必要がありますか？"
    },
    {
      "indent": 0,
      "text": "2.3.1. Use of Anomalous Links for New Paths",
      "section_title": true,
      "ja": "2.3.1. 新しいパスの異常リンクの使用"
    },
    {
      "indent": 3,
      "text": "If the answer to (a) is no for link latency performance objectives, then any link that has the Anomalous bit set in the Unidirectional Link Delay sub-TLV [RFC7471] [RFC7810] should be removed from the topology before a path calculation is used to compute a new path. In essence, the link should be treated exactly as if it fails the exclude-any resource attributes filter [RFC3209].",
      "ja": "異常ビットた経路計算が使用される前に単方向リンク遅延サブTLV [RFC7471]、[RFC7810]はトポロジーから除去されるべきで設定（A）への答えが、リンク・レイテンシ性能目標のためのであれば、任意のリンク新しいパスを計算します。それは除外し、いずれかのリソースは、フィルタ[RFC3209]を属性失敗したかのように本質的には、リンクが正確に扱われるべきです。"
    },
    {
      "indent": 3,
      "text": "Similarly, if the answer to (a) is no for link loss performance objectives, then any link that has the Anomalous bit set in the Link Loss sub-TLV should be treated as if it fails the exclude-any resource attributes filter.",
      "ja": "それが失敗したかのように答えは（a）のリンク損失性能目標のために何であれば同様に、その後、異常を持っている任意のリンクがリンク損失サブTLVに設定されていないビットが扱われるべき排除し、任意のリソースは、フィルター属性。"
    },
    {
      "indent": 0,
      "text": "2.3.2. Links Entering the Anomalous State",
      "section_title": true,
      "ja": "2.3.2. 異常状態に入るリンク"
    },
    {
      "indent": 3,
      "text": "When the Anomalous bit transitions from clear to set, this indicates that the associated link has entered the Anomalous state with respect to the associated parameter; similarly, a transition from set to clear indicates that the Anomalous state has been exited for that link and associated parameter.",
      "ja": "異常を設定するクリアからの遷移ビット場合、これは関連するリンクは、関連するパラメータに関して異常状態に入ったことを示します。同様に、明らかにセットからの遷移は、異常状態がそのリンクと関連したパラメータに終了されたことを示します。"
    },
    {
      "indent": 3,
      "text": "When a link enters the Anomalous state with respect to a parameter, this is an indication that LSPs using that link might also no longer be in compliance with their performance bounds. It can also be considered an indication that something is changing that link and so it might no longer be trustworthy to carry performance-critical traffic. Naturally, which performance criteria are important for a particular LSP is dependent upon the LSP's configuration; thus, the compliance of a link with respect to a particular link performance objective is indicated per performance criterion.",
      "ja": "リンクは、パラメータに関して異常な状態になると、これはそのリンクを使用するLSPも、もはや彼らのパフォーマンスの限界を遵守しない可能性があることを示しています。また、何かがそのリンクを変更されていないので、もはやパフォーマンスが重要なトラフィックを運ぶために信頼できるかもしれないことを示す指標と考えることができます。当然のことながら、その性能基準は、特定のLSPは、LSPの設定に依存しているために重要です。従って、特定のリンクのパフォーマンス目標に対するリンクのコンプライアンスは、性能基準ごとに示されています。"
    },
    {
      "indent": 3,
      "text": "At the ingress of a TE tunnel, a TE tunnel may be configured to be sensitive to the Anomalous state of links in reference to latency, delay variation, and/or loss. Additionally, such a TE tunnel may be configured to either verify continued compliance, to switch immediately to a standby LSP, or to move to a different path.",
      "ja": "TEトンネルの入口で、TEトンネルがレイテンシ参照のリンク、遅延変動、及び/又は損失の異常状態に対して敏感であるように構成することができます。また、このようなTEトンネルは、継続的なコンプライアンスを検証スタンバイLSPに直ちに切り替えること、または別のパスに移動するかのいずれかに構成することができます。"
    },
    {
      "indent": 3,
      "text": "When a sub-TLV is received with the Anomalous bit set when previously it was clear, the list of interested TE tunnels must be scanned. Each such TE tunnel should have its continued compliance verified, be switched to a hot standby, or do a make-before-break to a secondary path.",
      "ja": "以前に、それは明らかだったときのサブTLVが異常ビットセットで受信されると、興味TEトンネルのリストをスキャンしなければなりません。それぞれのそのようなTEトンネルは、その継続的なコンプライアンスが確認されている必要があり、ホットスタンバイに切り替えること、あるいは二次パスにメイク・ビフォア・ブレイクを行います。"
    },
    {
      "indent": 3,
      "text": "It is not sufficient to just look at the Anomalous bit in order to determine when TE tunnels must have their compliance verified. When changing to set, the Anomalous bit merely provides a hint that interested TE tunnels should have their continued compliance verified.",
      "ja": "ちょうどTEトンネルは、その遵守を確認しなければならないときを決定するために、異常なビットを見てするのに十分ではありません。設定するために変更する場合は、異常なビットは、単に興味TEトンネルが彼らの継続的なコンプライアンスが確認されていなければならないというヒントを提供します。"
    },
    {
      "indent": 0,
      "text": "2.3.3. Links Leaving the Anomalous State",
      "section_title": true,
      "ja": "2.3.3. 異常状態のままリンク"
    },
    {
      "indent": 3,
      "text": "When a link leaves the Anomalous state with respect to a parameter, this can serve as an indication that those TE tunnels, whose LSPs were changed due to administrative policy when the link entered the Anomalous state, may want to reoptimize to a better path. The hint provided by the Anomalous state change may help optimize when to recompute for a better path.",
      "ja": "リンクは、パラメータに関して異常状態を離れたとき、これはLSPのリンクが異常状態に入ったとき、管理ポリシーにより変更されたものをTEトンネルは、より適切なパスに再最適化することをお勧めしますことを示す指標としての役割を果たすことができます。異常状態の変化によって提供ヒントは、より良好なパスを再計算するときに最適化することができます。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document is not currently believed to introduce new security concerns.",
      "ja": "この文書は、現在、新たなセキュリティ上の懸念を導入しないと考えられます。"
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "ja": "4.参考文献"
    },
    {
      "indent": 0,
      "text": "4.1. Normative References",
      "section_title": true,
      "ja": "4.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, DOI 10.17487/RFC3209, December 2001, <http://www.rfc-editor.org/info/rfc3209>.",
      "ja": "[RFC3209] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニヴァサン、V.、およびG.ツバメ、 \"RSVP-TE：ExtensionsがLSPトンネルのためのRSVPする\"、RFC 3209、DOI 10.17487 / RFC3209、2001年12月、<http://www.rfc-editor.org/info/rfc3209>。"
    },
    {
      "indent": 3,
      "text": "[RFC7471] Giacalone, S., Ward, D., Drake, J., Atlas, A., and S. Previdi, \"OSPF Traffic Engineering (TE) Metric Extensions\", RFC 7471, DOI 10.17487/RFC7471, March 2015, <http://www.rfc-editor.org/info/rfc7471>.",
      "ja": "[RFC7471] Giacalone、S.、ウォード、D.、ドレイク、J.、アトラス、A.、およびS. Previdi、 \"OSPFトラフィックエンジニアリング（TE）メートルの拡張\"、RFC 7471、DOI 10.17487 / RFC7471、2015年3月、 <http://www.rfc-editor.org/info/rfc7471>。"
    },
    {
      "indent": 3,
      "text": "[RFC7810] Previdi, S., Ed., Giacalone, S., Ward, D., Drake, J., and Q. Wu, \"IS-IS Traffic Engineering (TE) Metric Extensions\", RFC 7810, DOI 10.17487/7810, May 2016, <http://www.rfc-editor.org/info/rfc7810>.",
      "ja": "[RFC7810] Previdi、S.編、Giacalone、S.、区、D.、ドレイク、J.、およびQ.ウー、 \"IS-ISトラフィックエンジニアリング（TE）メトリック拡張\"、RFC 7810、DOI 10.17487 / 7810、2016年5月、<http://www.rfc-editor.org/info/rfc7810>。"
    },
    {
      "indent": 0,
      "text": "4.2. Informative References",
      "section_title": true,
      "ja": "4.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[hop-count_DCLC] Agrawal, H., Grah, M., and M. Gregory, \"Optimization of QoS Routing\", 6th IEEE/AACIS International Conference on Computer and Information Science, DOI 10.1109/ICIS.2007.144, July 2007, <http://ieeexplore.ieee.org/xpl/ articleDetails.jsp?arnumber=4276447>.",
      "ja": "コンピュータと情報科学[ホップcount_DCLC]アグラワル、H.、Grah、M.、およびM.グレゴリー、 \"QoSルーティングの最適化\"、第六IEEE / AACIS国際会議、DOI 10.1109 / ICIS.2007.144、2007年7月、< http://ieeexplore.ieee.org/xpl/ articleDetails.jsp？arnumber = 4276447>。"
    },
    {
      "indent": 3,
      "text": "[k-Paths_DCLC] Jia, Z. and P. Varaiya, \"Heuristic methods for delay constrained least cost routing using k-shortest-paths\", IEEE Transactions on Automatic Control, vol. 51, no. 4, April 2006, <http://dx.doi.org/10.1109/TAC.2006.872827>.",
      "ja": "[K-Paths_DCLC]甲、Z.及びP. Varaiyaは、自動制御、巻上のIEEEトランザクション「遅延のための発見的方法は、k最短パスを使用して最小コストルーティングの制約します」。 51、ありません。 4、2006年4月、<http://dx.doi.org/10.1109/TAC.2006.872827>。"
    },
    {
      "indent": 3,
      "text": "[RFC3246] Davie, B., Charny, A., Bennet, J., Benson, K., Le Boudec, J., Courtney, W., Davari, S., Firoiu, V., and D. Stiliadis, \"An Expedited Forwarding PHB (Per-Hop Behavior)\", RFC 3246, DOI 10.17487/RFC3246, March 2002, <http://www.rfc-editor.org/info/rfc3246>.",
      "ja": "[RFC3246]デイビー、B.、Charny、A.、ベネット、J.、ベンソン、K.、ルBoudec、J.、コートニー、W.、Davari、S.、Firoiu、V.、およびD. Stiliadis、 \"緊急転送PHB（ホップ単位動作）」、RFC 3246、DOI 10.17487 / RFC3246、2002年3月、<http://www.rfc-editor.org/info/rfc3246>。"
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, DOI 10.17487/RFC3473, January 2003, <http://www.rfc-editor.org/info/rfc3473>.",
      "ja": "[RFC3473]バーガーは、L.、エドは、 \"一般化されたマルチプロトコルラベルスイッチング（GMPLS）シグナリング資源予約プロトコル - トラフィックエンジニアリング（RSVP-TE）拡張機能\"、RFC 3473、DOI 10.17487 / RFC3473、2003年1月、<のhttp： //www.rfc-editor.org/info/rfc3473>。"
    },
    {
      "indent": 3,
      "text": "[RFC4594] Babiarz, J., Chan, K., and F. Baker, \"Configuration Guidelines for DiffServ Service Classes\", RFC 4594, DOI 10.17487/RFC4594, August 2006, <http://www.rfc-editor.org/info/rfc4594>.",
      "ja": "[RFC4594] Babiarz、J.、チャン、K.、およびF.ベイカー、 \"DiffServのサービスクラスの設定時の注意事項\"、RFC 4594、DOI 10.17487 / RFC4594、2006年8月、<http://www.rfc-editor.org /情報/ rfc4594>。"
    },
    {
      "indent": 3,
      "text": "[RFC4655] Farrel, A., Vasseur, J., and J. Ash, \"A Path Computation Element (PCE)-Based Architecture\", RFC 4655, DOI 10.17487/RFC4655, August 2006, <http://www.rfc-editor.org/info/rfc4655>.",
      "ja": "[RFC4655]ファレル、A.、Vasseur、J.、およびJ.アッシュ、 \"パス計算要素（PCE）ベースのアーキテクチャ\"、RFC 4655、DOI 10.17487 / RFC4655、2006年8月、<のhttp：//www.rfc -editor.org/info/rfc4655>。"
    },
    {
      "indent": 3,
      "text": "[RFC6049] Morton, A. and E. Stephan, \"Spatial Composition of Metrics\", RFC 6049, DOI 10.17487/RFC6049, January 2011, <http://www.rfc-editor.org/info/rfc6049>.",
      "ja": "[RFC6049]モートン、A.及びE.ステファン、 \"メトリックの空間構成\"、RFC 6049、DOI 10.17487 / RFC6049、2011年1月、<http://www.rfc-editor.org/info/rfc6049>。"
    },
    {
      "indent": 3,
      "text": "[SEG-ROUTE-MPLS] Filsfils, C., Ed., Previdi, S., Ed., Bashandy, A., Decraene, B., Litkowski, S., Horneffer, M., Shakir, R., Tantsura, J., and E. Crabbe, \"Segment Routing with MPLS data plane\", Work in Progress, draft-ietf-spring-segment-routing-mpls-04, March 2016.",
      "ja": "[SEG-ROUTE-MPLS] Filsfils、C.、エド。、Previdi、S.編、Bashandy、A.、Decraene、B.、Litkowski、S.、Horneffer、M.、Shakir、R.、Tantsura、 J.、およびE.クラッブ、 \"MPLSデータプレーンとルーティングセグメント\"、進行中で働いて、ドラフトIETFばねセグメントルーティング-MPLS-04、2016年3月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Curtis Villamizar for his extensive detailed comments and suggested text in Sections 1 and 1.2. The authors would like to thank Dhruv Dhody for his useful comments and his care and persistence in making sure that these important corrections weren't missed. The authors would also like to thank Xiaohu Xu and Sriganesh Kini for their reviews.",
      "ja": "著者は、彼の豊富な詳細なコメントとセクション1および1.2で推奨テキストのカーティスVillamizarに感謝したいと思います。著者らは、これらの重要な修正が失われていなかったことを確認することで彼の有益なコメントと彼のケアと持続性のためDhruv Dhodyに感謝したいと思います。著者はまた、彼らのレビューのためにXiaohu徐とSriganesh KINIに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "Dave Ward and Clarence Filsfils contributed to this document.",
      "ja": "デイブ・ワードとクラレンスFilsfilsは、この文書に貢献しました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Alia Atlas Juniper Networks 10 Technology Park Drive Westford, MA 01886 United States",
      "ja": "アリアアトラスジュニパーネットワークスの10テクノロジーパークドライブウェストフォード、マサチューセッツ州01886米国"
    },
    {
      "indent": 3,
      "text": "Email: akatlas@juniper.net",
      "ja": "メール：akatlas@juniper.net"
    },
    {
      "indent": 3,
      "text": "John Drake Juniper Networks 1194 N. Mathilda Ave. Sunnyvale, CA 94089 United States",
      "ja": "ジョン・ドレイクジュニパーネットワークスの1194 N.マチルダアベニュー。サニーベール、CA 94089米国"
    },
    {
      "indent": 3,
      "text": "Email: jdrake@juniper.net",
      "ja": "メール：jdrake@juniper.net"
    },
    {
      "indent": 3,
      "text": "Spencer Giacalone Microsoft",
      "ja": "スペンサーGiacaloneマイクロソフト"
    },
    {
      "indent": 3,
      "text": "Email: spencer.giacalone@gmail.com",
      "ja": "メール：spencer.giacalone@gmail.com"
    },
    {
      "indent": 3,
      "text": "Stefano Previdi Cisco Systems Via Del Serafico 200 Rome 00142 Italy",
      "ja": "スティーブンは、シスコシステムズヴィアデルセラフィック200 00142ローマイタリアを予見しました"
    },
    {
      "indent": 3,
      "text": "Email: sprevidi@cisco.com",
      "ja": "メール：sprevidi@cisco.com"
    }
  ]
}