{
  "title": {
    "text": "RFC 7694 - Hypertext Transfer Protocol (HTTP) Client-Initiated Content-Encoding",
    "ja": "RFC 7694 - ハイパーテキスト転送プロトコル（HTTP）クライアントが開始したコンテンツのエンコーディング"
  },
  "number": 7694,
  "created_at": "2019-11-01 07:15:27.234939+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        J. Reschke\nRequest for Comments: 7694                                    greenbytes\nCategory: Standards Track                                  November 2015\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 2,
      "text": "Hypertext Transfer Protocol (HTTP) Client-Initiated Content-Encoding",
      "ja": "ハイパーテキスト転送プロトコル（HTTP）クライアントが開始したコンテンツのエンコーディング"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "In HTTP, content codings allow for payload encodings such as for compression or integrity checks. In particular, the \"gzip\" content coding is widely used for payload data sent in response messages.",
      "ja": "HTTPにおいて、コンテンツコーディングは、圧縮または完全性チェックのようなペイロードエンコーディングを可能にします。具体的には、「GZIP」コンテンツ符号化が広く、応答メッセージで送信されるペイロードデータのために使用されます。"
    },
    {
      "indent": 3,
      "text": "Content codings can be used in request messages as well; however, discoverability is not on par with response messages. This document extends the HTTP \"Accept-Encoding\" header field for use in responses, to indicate the content codings that are supported in requests.",
      "ja": "内容コーディングは、同様に、要求メッセージで使用することができます。しかし、発見可能では応答メッセージと同等のではありません。このドキュメントでは、HTTPを拡張し、「受け入れエンコード」要求でサポートされているコンテンツのコーディングを示すために、応答で使用するためのヘッダフィールドを。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7694.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7694で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Notational Conventions  . . . . . . . . . . . . . . . . . . .   2\n3.  Using the 'Accept-Encoding' Header Field in Responses . . . .   3\n4.  Example . . . . . . . . . . . . . . . . . . . . . . . . . . .   4\n5.  Deployment Considerations . . . . . . . . . . . . . . . . . .   4\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   5\n7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   5\n  7.1.  Header Field Registry . . . . . . . . . . . . . . . . . .   5\n  7.2.  Status Code Registry  . . . . . . . . . . . . . . . . . .   6\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   6\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . .   6\n  8.2.  Informative References  . . . . . . . . . . . . . . . . .   6\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   7\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .   7",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "In HTTP, content codings allow for payload encodings such as for compression or integrity checks ([RFC7231], Section 3.1.2). In particular, the \"gzip\" content coding ([RFC7230], Section 4.2) is widely used for payload data sent in response messages.",
      "ja": "HTTPにおいて、コンテンツコーディングは、圧縮または整合性チェック（[RFC7231]、セクション3.1.2）のようなペイロードエンコーディングを可能にします。具体的には、「GZIP」コンテンツコード（[RFC7230]、セクション4.2）が広く、応答メッセージで送信されるペイロードデータのために使用されます。"
    },
    {
      "indent": 3,
      "text": "Content codings can be used in request messages as well; however, discoverability is not on par with response messages. This document extends the HTTP \"Accept-Encoding\" header field ([RFC7231], Section 5.3.4) for use in responses, to indicate the content codings that are supported in requests. It furthermore updates the definition of status code 415 (Unsupported Media Type) ([RFC7231], Section 6.5.13), recommending that the \"Accept-Encoding\" header field be included when appropriate.",
      "ja": "内容コーディングは、同様に、要求メッセージで使用することができます。しかし、発見可能では応答メッセージと同等のではありません。この文書では、HTTPリクエストに支持されているコンテンツのコーディングを示すために、応答で使用するための「符号化を許可」ヘッダフィールド（[RFC7231]、セクション5.3.4）に延びています。それはさらに、適切な場合、「同意エンコード」ヘッダフィールドが含まれることを推奨、ステータスコード415（サポートされていないメディアタイプ）（[RFC7231]、セクション6.5.13）の定義を更新します。"
    },
    {
      "indent": 0,
      "text": "2. Notational Conventions",
      "section_title": true,
      "ja": "2.表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "This document reuses terminology defined in the base HTTP specifications, namely Section 2 of [RFC7230] and Section 3.1.2 of [RFC7231].",
      "ja": "この文書は、基本HTTP仕様で定義された用語、すなわち、[RFC7230]のセクション2及び[RFC7231]のセクション3.1.2を再利用します。"
    },
    {
      "indent": 0,
      "text": "3. Using the 'Accept-Encoding' Header Field in Responses",
      "section_title": true,
      "ja": "3.応答で「受け入れエンコード」ヘッダーフィールドを使用して"
    },
    {
      "indent": 3,
      "text": "Section 5.3.4 of [RFC7231] defines \"Accept-Encoding\" as a request header field only.",
      "ja": "[RFC7231]のセクション5.3.4に定義のみリクエストヘッダフィールドとして「エンコードを受け入れ」。"
    },
    {
      "indent": 3,
      "text": "This specification expands that definition to allow \"Accept-Encoding\" as a response header field as well. When present in a response, it indicates what content codings the resource was willing to accept in the associated request. A field value that only contains \"identity\" implies that no content codings were supported.",
      "ja": "本明細書は、同様に、応答ヘッダフィールドとして「エンコードを受け入れる」ことを可能にするという定義を拡張します。現在は反応して、それがどのような内容コーディングを示している場合、リソースは、関連する要求に受け入れて喜んでいました。唯一の「アイデンティティ」を含むフィールドの値には、コンテンツのコーディングがサポートされなかったことを意味します。"
    },
    {
      "indent": 3,
      "text": "Note that this information is specific to the associated request; the set of supported encodings might be different for other resources on the same server and could change over time or depend on other aspects of the request (such as the request method).",
      "ja": "この情報は、関連する要求に特異的であることに留意されたいです。サポートされている符号化方式のセットは、同じサーバ上の他のリソースのために異なる場合があり、経時変化や（例えば、リクエストメソッドとして）要求の他の側面に依存する可能性があります。"
    },
    {
      "indent": 3,
      "text": "Section 6.5.13 of [RFC7231] defines status code 415 (Unsupported Media Type) to apply to problems related to both media types and content codings.",
      "ja": "[RFC7231]のセクション6.5.13はメディアタイプ及びコンテンツコーディングの両方に関連する問題に適用するには、ステータスコード415（サポートされていないメディアタイプ）を定義します。"
    },
    {
      "indent": 3,
      "text": "Servers that fail a request due to an unsupported content coding ought to respond with a 415 status and ought to include an \"Accept-Encoding\" header field in that response, allowing clients to distinguish between issues related to content codings and media types. In order to avoid confusion with issues related to media types, servers that fail a request with a 415 status for reasons unrelated to content codings MUST NOT include the \"Accept-Encoding\" header field.",
      "ja": "サポートされていないコンテンツの符号化に要求を失敗するサーバーは、415個のステータスで応答するべきとクライアントがコンテンツのコーディングとメディアタイプに関連した問題を区別することができ、その応答で「同意エンコード」のヘッダーフィールドを含むべきです。メディアタイプに関連する問題との混同を避けるために、コンテンツのコーディングとは無関係の理由のための415個の状態で要求を失敗するサーバーには、「同意エンコードを」ヘッダフィールドを含んではいけません。"
    },
    {
      "indent": 3,
      "text": "It is expected that the most common use of \"Accept-Encoding\" in responses will have the 415 (Unsupported Media Type) status code, in response to optimistic use of a content coding by clients. However, the header field can also be used to indicate to clients that content codings are supported, to optimize future interactions. For example, a resource might include it in a 2xx response when the request payload was big enough to justify use of a compression coding but the client failed do so.",
      "ja": "応答の「同意エンコード」の最も一般的な用途は、クライアントによるコンテンツ符号化の楽観的な使用に応じて、415（サポートされていないメディアタイプ）ステータスコードを持つことが期待されます。しかし、ヘッダフィールドは、将来の相互作用を最適化するために、コンテンツ・コーディングがサポートされていることをクライアントに知らせるために使用することができます。たとえば、リソースが要求ペイロードは、圧縮符号化の使用を正当化するのに十分な大きさでしたが、クライアントがそうしなかったとき2xx応答でそれを含めることができます。"
    },
    {
      "indent": 0,
      "text": "4. Example",
      "section_title": true,
      "ja": "4.例"
    },
    {
      "indent": 3,
      "text": "A client submits a POST request using the \"compress\" content coding ([RFC7231], Section 3.1.2.1):",
      "ja": "クライアントは、「圧縮」コンテンツコーディング（[RFC7231]、セクション3.1.2.1）を使用してPOSTリクエストを送信します"
    },
    {
      "indent": 5,
      "text": "POST /edit/ HTTP/1.1 Host: example.org Content-Type: application/atom+xml;type=entry Content-Encoding: compress",
      "ja": "POST /編集/ HTTP / 1.1ホスト：example.orgのContent-Type：アプリケーション/アトム+ xmlの;タイプ=エントリーのコンテンツエンコード：圧縮"
    },
    {
      "indent": 5,
      "text": "...compressed payload...",
      "ja": "...圧縮されたペイロード..."
    },
    {
      "indent": 3,
      "text": "The server rejects the request because it only allows the \"gzip\" content coding:",
      "ja": "それが唯一の「GZIP」コンテンツのコーディングを可能にするため、サーバーは要求を拒否します："
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 415 Unsupported Media Type Date: Fri, 09 May 2014 11:43:53 GMT Accept-Encoding: gzip Content-Length: 68 Content-Type: text/plain",
      "ja": "HTTP / 1.1 415サポートされていないメディアタイプ日：金、2014年5月9日は11時43分53秒GMTが受け入れ-エンコード：gzipでのContent-Length：68 Content-Typeの：text / plainの"
    },
    {
      "indent": 5,
      "text": "This resource only supports the \"gzip\" content coding in requests.",
      "ja": "このリソースは、要求だけで「GZIP」コンテンツコーディングをサポートしています。"
    },
    {
      "indent": 3,
      "text": "At this point, the client can retry the request with the supported \"gzip\" content coding.",
      "ja": "この時点で、クライアントは、サポートされている「GZIP」コンテンツ・コーディングで要求を再試行することができます。"
    },
    {
      "indent": 3,
      "text": "Alternatively, a server that does not support any content codings in requests could answer with:",
      "ja": "また、リクエスト内のすべてのコンテンツのコーディングをサポートしていないサーバーは、と答えることができます："
    },
    {
      "indent": 5,
      "text": "HTTP/1.1 415 Unsupported Media Type Date: Fri, 09 May 2014 11:43:53 GMT Accept-Encoding: identity Content-Length: 61 Content-Type: text/plain",
      "ja": "HTTP / 1.1 415サポートされていないメディアタイプ日：金、2014年5月9日11時43分五十三秒GMTは受け入れ-エンコード：アイデンティティのContent-Lengthを：61のContent-Type：text / plainの"
    },
    {
      "indent": 5,
      "text": "This resource does not support content codings in requests.",
      "ja": "このリソースは、リクエストでコンテンツコーディングをサポートしていません。"
    },
    {
      "indent": 0,
      "text": "5. Deployment Considerations",
      "section_title": true,
      "ja": "5.展開の考慮事項"
    },
    {
      "indent": 3,
      "text": "Servers that do not support content codings in requests already are required to fail a request that uses a content coding. Section 6.5.13 of [RFC7231] defines the status code 415 (Unsupported Media Type) for this purpose, so the only change needed is to include the \"Accept-Encoding\" header field with the value \"identity\" in that response.",
      "ja": "リクエストでコンテンツコーディングをサポートしていないサーバーは、既にコンテンツのコーディングを使用して、要求を失敗するために必要とされています。 [RFC7231]のセクション6.5.13は、この目的のためにステータスコード415（サポートされていないメディアタイプ）を定義し、これに必要な唯一の変更は、その応答の値「同一性」と「同意エンコード」ヘッダフィールドを含めることです。"
    },
    {
      "indent": 3,
      "text": "Servers that do support some content codings are required to fail requests with unsupported content codings as well. To be compliant with this specification, servers will need to use the status code 415 (Unsupported Media Type) to signal the problem and will have to include an \"Accept-Encoding\" header field that enumerates the content codings that are supported. As the set of supported content codings is usually static and small, adding the header field ought to be trivial.",
      "ja": "一部のコンテンツコーディングをサポートしていないサーバーも同様にサポートされていないコンテンツのコーディングとのリクエストに失敗する必要があります。この仕様に準拠するために、サーバは、問題を知らせるために、ステータスコード415（サポートされていないメディアタイプ）を使用する必要がありますし、サポートされているコンテンツのコーディングを列挙「のAccept-Encoding」ヘッダフィールド含める必要があります。サポートされるコンテンツコーディングのセットとしてヘッダフィールドは自明であるべき追加、通常静的および小さいです。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This specification only adds discovery of supported content codings and diagnostics for requests failing due to unsupported content codings. As such, it doesn't introduce any new security considerations over those already present in HTTP/1.1 (Section 9 of [RFC7231]) and HTTP/2 (Section 10 of [RFC7540]).",
      "ja": "この仕様は、のみサポートされていないコンテンツのコーディングによる失敗の要求のためにサポートされているコンテンツのコーディングおよび診断の発見を追加します。このように、HTTP / 1.1（[RFC7231]のセクション9）及びHTTP / 2（[RFC7540]のセクション10）中に既に存在するものより新しいセキュリティ問題を導入しません。"
    },
    {
      "indent": 3,
      "text": "However, the point of better discoverability and diagnostics is to make it easier to use content codings in requests. This might lead to increased usage of compression codings such as gzip (Section 4.2 of [RFC7230]), which, when used over a secure channel, can enable side-channel attacks such as BREACH (see Section 10.6 of [RFC7540] and [BREACH]). At the time of publication, it was unclear how BREACH-like attacks can be applied to compression in HTTP requests.",
      "ja": "しかし、より良い発見可能と診断のポイントは、それが簡単に要求にコンテンツのコーディングを使用するようにすることです。これは、安全なチャネルを介して使用される場合、そのような違反のようなサイドチャネル攻撃を有効にすることができ、このようなGZIP（[RFC7230]のセクション4.2）のような圧縮コーディングの増加した使用につながる可能性がある（[RFC7540]のセクション10.6および[違反を参照]）。公開時点で、違反のような攻撃は、HTTP要求の圧縮に適用することができるかは不明でした。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "7.1. Header Field Registry",
      "section_title": true,
      "ja": "7.1. ヘッダーフィールドレジストリ"
    },
    {
      "indent": 3,
      "text": "HTTP header fields are registered within the \"Message Headers\" registry located at <http://www.iana.org/assignments/ message-headers>, as defined by [BCP90].",
      "ja": "[BCP90]によって定義されるようにHTTPヘッダフィールドは、<http://www.iana.org/assignments/メッセージヘッダー>に位置する「メッセージヘッダ」レジストリ内に登録されています。"
    },
    {
      "indent": 3,
      "text": "This document updates the definition of the \"Accept-Encoding\" header field. The \"Permanent Message Header Field Names\" registry has been updated as follows:",
      "ja": "この文書では、「同意エンコード」ヘッダフィールドの定義を更新します。以下のように「恒久メッセージヘッダフィールド名」レジストリが更新されました："
    },
    {
      "indent": 3,
      "text": "+-----------------+----------+----------+---------------------------+\n| Header Field    | Protocol | Status   | Reference                 |\n| Name            |          |          |                           |\n+-----------------+----------+----------+---------------------------+\n| Accept-Encoding | http     | standard | Section 5.3.4 of          |\n|                 |          |          | [RFC7231] and Section 3   |\n|                 |          |          | of this document          |\n+-----------------+----------+----------+---------------------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7.2. Status Code Registry",
      "section_title": true,
      "ja": "7.2. ステータスコードレジストリ"
    },
    {
      "indent": 3,
      "text": "HTTP status codes are registered within the \"HTTP Status Codes\" registry located at <http://www.iana.org/assignments/ http-status-codes>.",
      "ja": "HTTPステータスコードは、<http://www.iana.org/assignments/ HTTPステータス・コード>にある「HTTPステータスコード」レジストリ内に登録されています。"
    },
    {
      "indent": 3,
      "text": "This document updates the definition of the status code 415 (Unsupported Media Type). The \"HTTP Status Codes\" registry has been updated as follows:",
      "ja": "この文書では、ステータスコード415（サポートされていないメディアタイプ）の定義を更新します。以下のように「HTTPステータスコード」レジストリが更新されました："
    },
    {
      "indent": 3,
      "text": "+-------+-----------------+-----------------------------------------+\n| Value | Description     | Reference                               |\n+-------+-----------------+-----------------------------------------+\n| 415   | Unsupported     | Section 6.5.13 of [RFC7231] and Section |\n|       | Media Type      | 3 of this document                      |\n+-------+-----------------+-----------------------------------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC7230] Fielding, R., Ed. and J. Reschke, Ed., \"Hypertext Transfer Protocol (HTTP/1.1): Message Syntax and Routing\", RFC 7230, DOI 10.17487/RFC7230, June 2014, <http://www.rfc-editor.org/info/rfc7230>.",
      "ja": "[RFC7230]フィールディング、R.、エド。及びJ. Reschke、編、 \"ハイパーテキスト転送プロトコル（HTTP / 1.1）：メッセージの構文およびルーティング\"、RFC 7230、DOI 10.17487 / RFC7230、2014年6月、<http://www.rfc-editor.org/info/ rfc7230>。"
    },
    {
      "indent": 3,
      "text": "[RFC7231] Fielding, R., Ed. and J. Reschke, Ed., \"Hypertext Transfer Protocol (HTTP/1.1): Semantics and Content\", RFC 7231, DOI 10.17487/RFC7231, June 2014, <http://www.rfc-editor.org/info/rfc7231>.",
      "ja": "[RFC7231]フィールディング、R.、エド。そして、J. Reschke、エド、 \"ハイパーテキスト転送プロトコル（HTTP / 1.1）：セマンティクスおよびコンテンツ\"、RFC 7231、DOI 10.17487 / RFC7231、2014年6月、<http://www.rfc-editor.org/info/rfc7231 >。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[BCP90] Klyne, G., Nottingham, M., and J. Mogul, \"Registration Procedures for Message Header Fields\", BCP 90, RFC 3864, September 2004, <http://www.rfc-editor.org/info/bcp90>.",
      "ja": "[BCP90] Klyne、G.、ノッティンガム、M.、およびJ.モーグル、 \"メッセージヘッダフィールドの登録手順\"、BCP 90、RFC 3864、2004年9月、<http://www.rfc-editor.org/info / bcp90>。"
    },
    {
      "indent": 3,
      "text": "[BREACH] Gluck, Y., Harris, N., and A. Prado, \"BREACH: Reviving the CRIME Attack\", July 2013, <http://breachattack.com/resources/ BREACH%20-%20SSL,%20gone%20in%2030%20seconds.pdf>.",
      "ja": "[違反]グルック、Y.、ハリス、N.、およびA.プラドは、 \"違反：CRIME攻撃を復活\"、2013年7月、<http://breachattack.com/resources/ブリーチ％20-％の20SSL％の20gone ％20IN％2030パーセント20seconds.pdf>。"
    },
    {
      "indent": 3,
      "text": "[RFC7540] Belshe, M., Peon, R., and M. Thomson, Ed., \"Hypertext Transfer Protocol Version 2 (HTTP/2)\", RFC 7540, DOI 10.17487/RFC7540, May 2015, <http://www.rfc-editor.org/info/rfc7540>.",
      "ja": "[RFC7540] Belshe、M.、ペオン、R.、およびM.トムソン、エド、 \"ハイパーテキスト転送プロトコルバージョン2（HTTP / 2）\"、RFC 7540、DOI 10.17487 / RFC7540、2015年5月、<のhttp：// www.rfc-editor.org/info/rfc7540>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks go to the Hypertext Transfer Protocol Working Group participants, namely Amos Jeffries, Ben Campbell, Mark Nottingham, Pete Resnick, Stephen Farrell, and Ted Hardie.",
      "ja": "おかげでハイパーテキスト転送プロトコルワーキンググループの参加者、すなわちアモスジェフリーズ、ベン・キャンベル、マーク・ノッティンガム、ピート・レズニック、スティーブン・ファレル、およびテッドハーディーに行きます。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Julian F. Reschke greenbytes GmbH Hafenweg 16 Muenster, NW 48155 Germany",
      "ja": "ジュリアン・F. Reschke greenbytes社Hafenweg 16ミュンスター、NW 48155ドイツ"
    },
    {
      "indent": 3,
      "text": "Email: julian.reschke@greenbytes.de URI: http://greenbytes.de/tech/webdav/",
      "ja": "メール：julian.reschke@greenbytes.de URI：http://greenbytes.de/tech/webdav/"
    }
  ]
}