{
  "title": {
    "text": "RFC 7726 - Clarifying Procedures for Establishing BFD Sessions for MPLS Label Switched Paths (LSPs)",
    "ja": "RFC 7726 - MPLSラベルのためのBFDセッションを確立するための手順を明確にすることはパス（LSPの）スイッチ"
  },
  "number": 7726,
  "created_at": "2019-11-01 16:13:38.573510+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       V. Govindan\nRequest for Comments: 7726                                  K. Rajaraman\nUpdates: 5884                                              Cisco Systems\nCategory: Standards Track                                      G. Mirsky\nISSN: 2070-1721                                                 Ericsson\n                                                                N. Akiya\n                                                     Big Switch Networks\n                                                               S. Aldrin\n                                                                  Google\n                                                            January 2016",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Clarifying Procedures for Establishing BFD Sessions for\n            MPLS Label Switched Paths (LSPs)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document clarifies the procedures for establishing, maintaining, and removing multiple, concurrent BFD (Bidirectional Forwarding Detection) sessions for a given <MPLS LSP, FEC> as described in RFC 5884.",
      "ja": "この文書は、確立、維持、およびRFC 5884に記載されているように、所与の<MPLS LSP、FEC>のための複数の、同時BFD（双方向フォワーディング検出）セッションを除去するための手順を明確にしています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7726.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7726で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Background  . . . . . . . . . . . . . . . . . . . . . . . . .   2\n  1.1.  Requirements Language . . . . . . . . . . . . . . . . . .   3\n2.  Theory of Operation . . . . . . . . . . . . . . . . . . . . .   3\n  2.1.  Procedures for Establishment of Multiple BFD Sessions . .   3\n  2.2.  Procedures for Maintenance of Multiple BFD Sessions . . .   4\n  2.3.  Procedures for Removing BFD Sessions at the Egress LSR  .   4\n  2.4.  Changing Discriminators for a BFD Session . . . . . . . .   5\n3.  Backwards Compatibility . . . . . . . . . . . . . . . . . . .   5\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .   5\n5.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   6\n  5.1.  Normative References  . . . . . . . . . . . . . . . . . .   6\n  5.2.  Informative References  . . . . . . . . . . . . . . . . .   6\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   6\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   7",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Background",
      "section_title": true,
      "ja": "1.背景"
    },
    {
      "indent": 3,
      "text": "[RFC5884] defines the procedures to bootstrap and maintain BFD sessions for an <MPLS LSP, FEC> using a Label Switched Path (LSP) ping. While Section 4 of [RFC5884] specifies that multiple BFD sessions can be established for an <MPLS LSP, FEC> tuple, the procedures to bootstrap and maintain multiple BFD sessions concurrently over an <MPLS LSP, FEC> are not clearly specified. Additionally, the procedures of removing BFD sessions bootstrapped on the egress Label Switching Router (LSR) are unclear. This document provides those clarifications without deviating from the principles outlined in [RFC5884].",
      "ja": "[RFC5884]はブートストラップとラベルスイッチパス（LSP）のpingを使用して、<MPLS LSP、FEC>のためのBFDセッションを維持するための手順を定義します。 [RFC5884]のセクション4は、複数のBFDセッションが<MPLS LSP、FEC>タプルのために確立することができることを指定しながら、手順は、ブートストラップすると明確に指定されていない<、MPLS LSP FEC>をかけて同時に複数のBFDセッションを維持します。また、BFDセッションを削除する手順は、ルータ（LSR）をスイッチング出力ラベルにブートストラップ不明です。このドキュメントは[RFC5884]に概説された原理から逸脱することなく、それらの明確化を提供します。"
    },
    {
      "indent": 3,
      "text": "The ability for an ingress LSR to establish multiple BFD sessions for an <MPLS LSP, FEC> tuple is useful in scenarios such as LSPs based on Segment Routing [SEG-ROUTING] or LSPs having Equal-Cost Multipath (ECMP). The process used by the ingress LSR to determine the number of BFD session(s) to be bootstrapped for an <MPLS LSP, FEC> tuple and the mechanism used to construct those session(s) are outside the scope of this document.",
      "ja": "複数のBFDセッションを確立するために、入口LSRのための能力は、<MPLS LSP、FEC>タプルは、セグメントルーティング[SEG-ROUTING]または等価コストマルチパス（ECMP）を有するのLSPに基づいて、LSPのようなシナリオで有用です。 <MPLS LSP、FEC>タプル及びそれらのセッション（単数または複数）を構築するために使用される機構のためにブートストラップするBFDセッション（S）の数を決定するために、入口LSRによって使用されるプロセスは、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "ja": "1.1. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、 \"推奨NOT\"、および「OPTIONAL 「本書では[RFC2119]で説明されるように解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "2. Theory of Operation",
      "section_title": true,
      "ja": "動作2.理論"
    },
    {
      "indent": 0,
      "text": "2.1. Procedures for Establishment of Multiple BFD Sessions",
      "section_title": true,
      "ja": "2.1. 複数のBFDセッションの確立のための手順"
    },
    {
      "indent": 3,
      "text": "Section 4 of [RFC5884] specifies the procedure for bootstrapping BFD sessions using LSP ping. It further states that \"a BFD session SHOULD be established for each alternate path that is discovered.\" This requirement has been the source of some ambiguity as the procedures of establishing concurrent, multiple sessions have not been explicitly specified. This ambiguity can also be attributed in part to the text in Section 7 of [RFC5884] forbidding either end to change local discriminator values in BFD control packets after the session reaches the UP state. The following procedures are described to clarify the ambiguity based on the interpretation of the authors' reading of the referenced sections:",
      "ja": "[RFC5884]のセクション4は、LSPピングを使用して、BFDセッションをブートストラップするための手順を指定します。さらに、「BFDセッションが発見された各代替パスのために確立されるべきである。」と述べています同時、複数のセッションを確立する手順を明示的に指定されていないとして、この要件は、いくつかのあいまいさの源となっています。この曖昧さは、セッションがUP状態に達した後BFD制御パケット内のローカルディスクリミネータ値を変更するために両端を禁止[RFC5884]のセクション7にテキストに部分的に起因し得ます。以下の手順は、参照セクションの著者の読書の解釈に基づいて曖昧さを明確にするために説明されています。"
    },
    {
      "indent": 3,
      "text": "At the ingress LSR:",
      "ja": "イングレスLSRで："
    },
    {
      "indent": 6,
      "text": "MPLS LSP ping can be used to bootstrap multiple BFD sessions for a given <MPLS LSP, FEC>. Each LSP ping MUST carry a different discriminator value in the BFD discriminator TLV [RFC5884].",
      "ja": "MPLS LSPピングは、与えられた<MPLS LSP、FEC>のための複数のBFDセッションをブートストラップするために使用することができます。各LSPピングはBFD弁別TLV [RFC5884]に異なるディスクリミネータ値を運ばなければなりません。"
    },
    {
      "indent": 3,
      "text": "The egress LSR needs to perform the following:",
      "ja": "出口LSRは以下を実行する必要があります。"
    },
    {
      "indent": 6,
      "text": "If the validation of the Forwarding Equivalence Class (FEC) in the MPLS Echo request message succeeds, check the discriminator specified in the BFD discriminator TLV of the MPLS Echo request. If there is no local session that corresponds to the (remote) discriminator received in the MPLS Echo request, a new session is bootstrapped and a local discriminator is allocated. The validation of a FEC is a necessary condition to be satisfied to create a new BFD session at the egress LSR. However, the policy or procedure, if any, to be applied by the egress LSR before allowing a new BFD session to be created is outside the scope of this document. Such policies or procedures could consider availability of system resources before allowing a session to be created. When the egress LSR disallows the creation of a BFD session due to policy, it MUST drop the MPLS Echo request message.",
      "ja": "MPLSエコー要求メッセージ内の転送等価クラス（FEC）の検証が成功した場合、MPLSエコー要求のBFD弁別TLVに指定された識別器をチェックします。 MPLSエコー要求で受け取った（リモート）識別器に対応するローカルセッションが存在しない場合、新しいセッションがブートストラップし、地域識別器が割り当てられています。 FECの検証は、出力LSRで新しいBFDセッションを作成するために満たすべき必要条件です。しかし、新しいBFDセッションを作成することを許可する前に出力LSRによって適用されるいかなる場合方針や手順は、この文書の範囲外です。このような方針や手続きはセッションが作成できるようにする前に、システムリソースの利用可能性を検討することができます。出力LSRが原因ポリシーへのBFDセッションの作成を許可しない場合は、MPLSエコー要求メッセージを削除する必要があります。"
    },
    {
      "indent": 6,
      "text": "Ensure the uniqueness of the <MPLS LSP, FEC, Remote Discriminator> tuple.",
      "ja": "<MPLS LSP、FEC、リモートディスクリミ>タプルの一意性を確認してください。"
    },
    {
      "indent": 6,
      "text": "Except for the clarification mentioned above, the remaining procedures of BFD session establishment are as specified in Sections 4-6 of [RFC5884].",
      "ja": "[RFC5884]のセクション4-6で指定されるように、上述した清澄以外は、BFDセッション確立の残りの手順があります。"
    },
    {
      "indent": 0,
      "text": "2.2. Procedures for Maintenance of Multiple BFD Sessions",
      "section_title": true,
      "ja": "2.2. 複数のBFDセッションのメンテナンスのための手順"
    },
    {
      "indent": 3,
      "text": "Both the ingress LSR and egress LSR use the Your Discriminator of the received BFD packet to demultiplex BFD sessions.",
      "ja": "どちらの入口LSRと出口LSRは、BFDセッションを分離するために、受信したBFDパケットのあなたの弁別を使用しています。"
    },
    {
      "indent": 0,
      "text": "2.3. Procedures for Removing BFD Sessions at the Egress LSR",
      "section_title": true,
      "ja": "2.3. 出口LSRでBFDセッションを削除するための手順"
    },
    {
      "indent": 3,
      "text": "[RFC5884] does not specify an explicit procedure for deleting BFD sessions. The procedure for removing a BFD session established by an out-of-band discriminator exchange using the MPLS LSP ping can improve resource management (e.g., memory), especially in scenarios involving thousands or more of such sessions. A few observations are made here:",
      "ja": "[RFC5884]はBFDセッションを削除するための明確な手順が指定されていません。 MPLS LSPピングを使用して、アウトオブバンド弁別交換によって確立されたBFDセッションを除去するための手順は、特に、このようなセッションの数千以上が関与するシナリオで、資源管理（例えば、メモリ）を向上させることができます。いくつかの観察はここで作られています："
    },
    {
      "indent": 6,
      "text": "The BFD session MAY be removed in the egress LSR if the BFD session transitions from UP to DOWN. This can either be done immediately after the BFD session transitions from UP to DOWN or after the expiry of a configurable timer started after the BFD session state transitions from UP to DOWN at the egress LSR to reduce flapping by adding hysteresis.",
      "ja": "アップからダウンにBFDセッションの移行場合BFDセッションは、出口LSRに除去することができます。これはすぐにDOWNにUPまたは構成タイマーの満了がヒステリシスを追加することによって、フラッピングを減らすために出力LSRでのアップからダウンにBFDセッションの状態遷移後に開始した後からBFDセッションに遷移した後のいずれかで行うことができます。"
    },
    {
      "indent": 6,
      "text": "The BFD session on the egress LSR MAY be removed by the ingress LSR by using the BFD diagnostic code AdminDown(7) as specified in [RFC5880]. When the ingress LSR wants to remove a session without triggering any state change at the egress, it MAY transmit BFD packets indicating the State as Down(1), diagnostic code AdminDown(7) detectMultiplier number of times. Upon receiving such a packet, the egress LSR MAY remove the BFD session, without triggering a change of state.",
      "ja": "出口LSRにBFDセッションは[RFC5880]で指定されるようにBFD診断コードAdminDown（7）を用いて、入口LSRによって除去することができます。入口LSRは、出口における任意の状態変化をトリガすることなく、セッションを削除したい場合、それがダウンした状態を示すBFDパケットを送信してもよい（1）、診断コードAdminDown（7）detectMultiplier回数。そのようなパケットを受信すると、出口LSRは、状態の変化をトリガすることなく、BFDセッションを除去することができます。"
    },
    {
      "indent": 6,
      "text": "The procedures to be followed at the egress LSR when BFD session(s) remain in the DOWN state for a significant amount of time is a local matter. Such procedures are outside the scope of this document.",
      "ja": "BFDセッション（s）は、かなりの時間のためのDOWN状態のままとき出口LSRに従うべき手順は、ローカルの問題です。このような手順は、この文書の範囲外です。"
    },
    {
      "indent": 6,
      "text": "All BFD sessions established with the FEC MUST be removed automatically if the FEC is removed.",
      "ja": "FECが削除された場合、FECで確立されたすべてのBFDセッションは自動的に削除されなければなりません。"
    },
    {
      "indent": 6,
      "text": "The egress MUST use the discriminators exchanged when the session was brought UP to indicate any session state change to the ingress. The egress SHOULD reset this to zero after transmitting bfd.detectMult number of packets if the BFD session transitions to DOWN state.",
      "ja": "セッションが進入する任意のセッション状態の変更を示すために育ったときの弁別器を使用しなければならない出口を交換しました。出口はDOWN状態にBFDセッション遷移場合にパケットのbfd.detectMult番号を送信した後、これをゼロにリセットしてください。"
    },
    {
      "indent": 0,
      "text": "2.4. Changing Discriminators for a BFD Session",
      "section_title": true,
      "ja": "2.4.  BFDセッションの変更ネータ"
    },
    {
      "indent": 3,
      "text": "The discriminators of a BFD session established over an MPLS LSP cannot be changed when it is in UP state. The BFD session could be removed after a graceful transition to AdminDown state using the BFD diagnostic code AdminDown. A new session could be established with a different discriminator. The initiation of the transition from the UP to DOWN state can be done by either the ingress LSR or the egress LSR.",
      "ja": "それがUP状態にあるとき、MPLS LSPを介して確立BFDセッションの識別器を変更することはできません。 BFDセッションをBFD診断コードAdminDownを使用して状態をAdminDownする優雅な遷移後に除去することができます。新しいセッションが異なる弁別で確立することができます。 DOWN状態までの遷移の開始は入口LSRまたは出口LSRのいずれかによって行うことができます。"
    },
    {
      "indent": 0,
      "text": "3. Backwards Compatibility",
      "section_title": true,
      "ja": "3.後方互換性"
    },
    {
      "indent": 3,
      "text": "The procedures clarified by this document are fully backward compatible with an existing implementation of [RFC5884]. While the capability to bootstrap and maintain multiple BFD sessions may not be present in current implementations, the procedures outlined by this document can be implemented as a software upgrade without affecting existing sessions. In particular, the egress LSR needs to support multiple BFD sessions per <MPLS LSP, FEC> before the ingress LSR is upgraded.",
      "ja": "この文書によって清澄化手順は、[RFC5884]の既存の実装と完全な下位互換性です。複数BFDセッションをブートストラップし、維持する能力は、現在の実装では存在しないかもしれないが、このドキュメントによって概説された手順は、既存のセッションに影響を与えることなく、ソフトウェアのアップグレードとして実装することができます。特に、出口LSRはイングレスLSRがアップグレードされる前に、<MPLS LSP、FEC>ごとに複数のBFDセッションをサポートする必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document clarifies the mechanism to bootstrap multiple BFD sessions per <MPLS LSP, FEC>. BFD sessions, naturally, use system and network resources. More BFD sessions means more resources will be used. It is highly important to ensure that only a minimum number of BFD sessions are provisioned per FEC and that bootstrapped BFD sessions are properly deleted when they are no longer required. Additionally, security measures described in [RFC4379] and [RFC5884] are to be followed.",
      "ja": "この文書では、<MPLS LSP、FEC>ごとに複数のBFDセッションをブートストラップするためのメカニズムを明らかにしています。 BFDセッションは、当然、システムおよびネットワークリソースを使用します。その他のBFDセッションがより多くのリソースが使用されることを意味します。 BFDセッションの唯一の最小数は、FECごとにプロビジョニングされていると、彼らはもはや必要とされるときにブートストラップBFDセッションが正しく削除されていないことを確実にするために非常に重要です。また、[RFC4379]及び[RFC5884]に記載されているセキュリティ対策が従うべきです。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "ja": "5.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC4379] Kompella, K. and G. Swallow, \"Detecting Multi-Protocol Label Switched (MPLS) Data Plane Failures\", RFC 4379, DOI 10.17487/RFC4379, February 2006, <http://www.rfc-editor.org/info/rfc4379>.",
      "ja": "[RFC4379] Kompella、K.とG.ツバメ、 \"検出マルチプロトコルラベル（MPLS）データプレーン障害のスイッチ\"、RFC 4379、DOI 10.17487 / RFC4379、2006年2月、<http://www.rfc-editor.org /情報/ rfc4379>。"
    },
    {
      "indent": 3,
      "text": "[RFC5880] Katz, D. and D. Ward, \"Bidirectional Forwarding Detection (BFD)\", RFC 5880, DOI 10.17487/RFC5880, June 2010, <http://www.rfc-editor.org/info/rfc5880>.",
      "ja": "[RFC5880]カッツ、D.およびD.区、 \"双方向フォワーディング検出（BFD）\"、RFC 5880、DOI 10.17487 / RFC5880、2010年6月、<http://www.rfc-editor.org/info/rfc5880>。"
    },
    {
      "indent": 3,
      "text": "[RFC5884] Aggarwal, R., Kompella, K., Nadeau, T., and G. Swallow, \"Bidirectional Forwarding Detection (BFD) for MPLS Label Switched Paths (LSPs)\", RFC 5884, DOI 10.17487/RFC5884, June 2010, <http://www.rfc-editor.org/info/rfc5884>.",
      "ja": "[RFC5884]アガルワル、R.、Kompella、K.、ナドー、T.、およびG.ツバメ、 \"双方向フォワーディング検出（BFD）MPLSラベルは、（LSPを）パスのスイッチのための\"、RFC 5884、DOI 10.17487 / RFC5884、2010年6月、<http://www.rfc-editor.org/info/rfc5884>。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "ja": "5.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[SEG-ROUTING] Filsfils, C., Ed., Previdi, S., Ed., Decraene, B., Litkowski, S., and R. Shakir, \"Segment Routing Architecture\", Work in Progress, draft-ietf-spring-segment-routing-07, December 2015.",
      "ja": "[SEG-ROUTING] Filsfils、C.、エド。、Previdi、S.編、Decraene、B.、Litkowski、S.、およびR. Shakir、 \"セグメントルーティングアーキテクチャ\"、進行中で働いて、ドラフトietf-春セグメントルーティング-07を、2015年12月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Marc Binderberger for performing thorough reviews and providing valuable suggestions.",
      "ja": "著者は、徹底したレビューを実施し、貴重な提案を提供するためのMarc Binderbergerに感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Mudigonda Mallik, Rajaguru Veluchamy, and Carlos Pignataro of Cisco Systems for their review comments.",
      "ja": "作者は彼らのレビューコメントをMudigonda Mallik、Rajaguru Veluchamy、およびシスコシステムズのカルロスPignataroに感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Alvaro Retana and Scott Bradner for their review comments.",
      "ja": "作者は彼らのレビューコメントのためにアルバロRetanaとスコット・ブラッドナーに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Vengada Prasad Govindan Cisco Systems",
      "ja": "Vengadaプラサドゴヴィンダンシスコシステムズ"
    },
    {
      "indent": 3,
      "text": "Email: venggovi@cisco.com",
      "ja": "メール：venggovi@cisco.com"
    },
    {
      "indent": 3,
      "text": "Kalyani Rajaraman Cisco Systems",
      "ja": "Kalyani Rajaraman共著シスコシステムズ"
    },
    {
      "indent": 3,
      "text": "Email: kalyanir@cisco.com",
      "ja": "メール：kalyanir@cisco.com"
    },
    {
      "indent": 3,
      "text": "Gregory Mirsky Ericsson",
      "ja": "グレゴリーMirskyエリクソン"
    },
    {
      "indent": 3,
      "text": "Email: gregory.mirsky@ericsson.com",
      "ja": "メール：gregory.mirsky@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Nobo Akiya Big Switch Networks",
      "ja": "NOBO秋谷ビッグスイッチネットワーク"
    },
    {
      "indent": 3,
      "text": "Email: nobo.akiya.dev@gmail.com",
      "ja": "メール：nobo.akiya.dev@gmail.com"
    },
    {
      "indent": 3,
      "text": "Sam Aldrin Google",
      "ja": "サム・オルドリングーグル"
    },
    {
      "indent": 3,
      "text": "Email: aldrin.ietf@gmail.com",
      "ja": "メール：aldrin.ietf@gmail.com"
    }
  ]
}