{
  "title": {
    "text": "RFC 7505 - A \"Null MX\" No Service Resource Record for Domains That Accept No Mail",
    "ja": "RFC 7505 - 「ヌルMX」にメールを受け入れないドメインなしサービスリソースレコード"
  },
  "number": 7505,
  "created_at": "2019-10-29 10:23:55.820576+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         J. Levine\nRequest for Comments: 7505                          Taughannock Networks\nCategory: Standards Track                                      M. Delany\nISSN: 2070-1721                                               Apple Inc.\n                                                               June 2015",
      "raw": true
    },
    {
      "indent": 1,
      "text": "A \"Null MX\" No Service Resource Record for Domains That Accept No Mail",
      "ja": "「ヌルMX」にメールを受け入れないドメインなしサービスリソースレコード"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Internet mail determines the address of a receiving server through the DNS, first by looking for an MX record and then by looking for an A/AAAA record as a fallback. Unfortunately, this means that the A/AAAA record is taken to be mail server address even when that address does not accept mail. The No Service MX RR, informally called \"null MX\", formalizes the existing mechanism by which a domain announces that it accepts no mail, without having to provide a mail server; this permits significant operational efficiencies.",
      "ja": "インターネットメールは、最初のMXレコードを探すことにより、その後のフォールバックとしてA / AAAAレコードを探すことにより、DNSを介して受信サーバのアドレスを決定します。残念ながら、これはA / AAAAレコードは、そのアドレスがメールを受け入れない場合でも、メールサーバのアドレスであると解釈されることを意味します。非公式に「ヌルMX」と呼ばれるサービス無しMX RRは、ドメインがメールサーバを設けることなく、それはメールを受け付けないことを発表したことで、既存のメカニズムを形式化。これは、重要な業務の効率化が可能となります。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7505.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7505で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Conventions Used in This Document . . . . . . . . . . . . . .   2\n3.  MX Resource Records Specifying Null MX  . . . . . . . . . . .   3\n4.  Effects of Null MX  . . . . . . . . . . . . . . . . . . . . .   3\n  4.1.  SMTP Server Benefits  . . . . . . . . . . . . . . . . . .   3\n  4.2.  Sending Mail from Domains That Publish Null MX  . . . . .   4\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .   4\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   5\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   5\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .   5\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .   6\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   6\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document defines the No Service MX, informally called \"null MX\", as a simple mechanism by which a domain can indicate that it does not accept email.",
      "ja": "このドキュメントでは、ドメインは、それが電子メールを受け入れないことを示すことができたことにより、簡単なメカニズムとして、非公式に「ヌルMX」と呼ばれる、ノーサービスMXを定義します。"
    },
    {
      "indent": 3,
      "text": "SMTP clients have a prescribed sequence for identifying a server that accepts email for a domain. Section 5 of [RFC5321] covers this in detail; in essence, the SMTP client first looks up a DNS MX RR, and, if that is not found, it falls back to looking up a DNS A or AAAA RR. Hence, this overloads a DNS record (that has a different primary mission) with an email service semantic.",
      "ja": "SMTPクライアントは、ドメインのメールを受け入れるサーバを識別するための所定の配列を有します。 [RFC5321]のセクション5を詳細にこれを覆っています。本質的には、SMTPクライアントは、最初にDNSのMX RRを検索し、そして、それが見つからない場合は、それがバックDNS AまたはAAAA RRを調べるにフォール。したがって、これはセマンティック電子メールサービスとDNSレコードを（つまり、別の第一の使命を持っている）オーバーロード。"
    },
    {
      "indent": 3,
      "text": "If a domain has no MX records, senders will attempt to deliver mail to the hosts at the addresses in the domain's A or AAAA records. If there are no SMTP listeners at the A/AAAA addresses, message delivery will be attempted repeatedly for a long period, typically a week, before the sending Mail Transfer Agent (MTA) gives up. This will delay notification to the sender in the case of misdirected mail and will consume resources at the sender.",
      "ja": "ドメインは、MXレコードを持っていない場合は、送信者は、ドメインのAまたはAAAAレコード内のアドレスのホストにメールを配信しようとします。 A / AAAAアドレスで何のSMTPリスナーが存在しない場合は、送信メール転送エージェント（MTA）があきらめる前に、メッセージの配信は、一般的に一週間、長期間繰り返し試行されます。これは見当違いのメールの場合、送信者に通知が遅れますと、送信者のリソースを消費します。"
    },
    {
      "indent": 3,
      "text": "This document defines a null MX that will cause all mail delivery attempts to a domain to fail immediately, without requiring domains to create SMTP listeners dedicated to preventing delivery attempts.",
      "ja": "このドキュメントでは、ドメインへのメール配信すべての試行は、配達の試みを防ぐ専用のSMTPリスナーを作成するには、ドメインを必要とせずに、すぐに失敗する原因になりますヌルMXを定義します。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "The terms \"RFC5321.MailFrom\" and \"RFC5322.From\" are used as defined in [RFC5598].",
      "ja": "[RFC5598]で定義されるように、用語「RFC5321.MailFrom」および「RFC5322.From」が使用されています。"
    },
    {
      "indent": 0,
      "text": "3. MX Resource Records Specifying Null MX",
      "section_title": true,
      "ja": "3. MXリソースレコードの指定ヌルMX"
    },
    {
      "indent": 3,
      "text": "To indicate that a domain does not accept email, it advertises a single MX RR (see Section 3.3.9 of [RFC1035]) with an RDATA section consisting of preference number 0 and a zero-length label, written in master files as \".\", as the exchange domain, to denote that there exists no mail exchanger for a domain. Since \".\" is not a valid host name, a null MX record cannot be confused with an ordinary MX record. The use of \".\" as a pseudo-hostname meaning no service available is modeled on the SRV RR [RFC2782] where it has a similar meaning.",
      "ja": "ドメインが電子メールを受け入れないことを示すために、それは「として、マスタファイルに書き込まれた優先順位番号0からなるRDATA部とゼロ長ラベル、と単一MX RRを（[RFC1035]のセクション3.3.9を参照）をアドバタイズ。 」、交換ドメインとして、ドメインのためのメール交換が存在しないことを意味します。以来、「」 nullのMXレコードは、通常のMXレコードと混同することはできません、有効なホスト名ではありません。の用法 \"。\"擬似ホスト名の意味として利用可能なサービスは、同様の意味を有するのSRV RR [RFC2782]に基づいてモデル化されていません。"
    },
    {
      "indent": 3,
      "text": "A domain that advertises a null MX MUST NOT advertise any other MX RR.",
      "ja": "ヌルMXをアドバタイズドメインは、他のMX RRを広告してはなりません。"
    },
    {
      "indent": 0,
      "text": "4. Effects of Null MX",
      "section_title": true,
      "ja": "ヌルMXの4及ぼす影響"
    },
    {
      "indent": 3,
      "text": "The null MX record has a variety of efficiency and usability benefits.",
      "ja": "nullのMXレコードは、効率性と使いやすさのさまざまなメリットがあります。"
    },
    {
      "indent": 0,
      "text": "4.1. SMTP Server Benefits",
      "section_title": true,
      "ja": "4.1.  SMTPサーバーの利点"
    },
    {
      "indent": 3,
      "text": "Mail often has an incorrect address due to user error, where the address was mistranscribed or misunderstood, for example, to alice@www.example.com, alice@example.org, or alice@examp1e.com rather than alice@example.com. Null MX allows a mail system to report the delivery failure when the user sends the message, rather than hours or days later.",
      "ja": "メールはしばしばアドレスがalice@example.comではなくalice@www.example.com、alice@example.org、またはalice@examp1e.comに、例えば、mistranscribedまたは誤解されたユーザー・エラーに誤ったアドレスを持っています。ヌルMXは、ユーザーが後からではなく数時間または数日より、メッセージを送信すると、メールシステムは、配信失敗を報告することができます。"
    },
    {
      "indent": 3,
      "text": "Senders of abusive mail often use forged undeliverable return addresses. Null MX allows Delivery Status Notifications (DSNs) and other attempted responses to such mail to be disposed of efficiently.",
      "ja": "虐待的なメールの送信者は、多くの場合、偽造配信不能リターンアドレスを使用しています。ヌルMXは、配信状態通知（DSN）と、そのようなメールに他未遂の応答が効率的に処分することができます。"
    },
    {
      "indent": 3,
      "text": "The ability to detect domains that do not accept email offers resource savings to an SMTP client. It will discover on the first sending attempt that an address is not deliverable, avoiding queuing and retries.",
      "ja": "メールを受け入れないドメインを検出する能力は、SMTPクライアントに資源の節約を提供しています。これは、アドレスがキューイングとリトライを避け、成果物ではありません最初の送信の試行で発見するでしょう。"
    },
    {
      "indent": 3,
      "text": "When a submission or SMTP relay server rejects an envelope recipient due to a domain's null MX record, it SHOULD use a 556 reply code [RFC7504] (Requested action not taken: domain does not accept mail) and a 5.1.10 enhanced status code (Permanent failure: Recipient address has null MX).",
      "ja": "提出またはSMTPリレーサーバが原因ドメインのヌルMXレコードにエンベロープ受信者を拒否した場合、それは556応答コードを使用すべきである[RFC7504]（要求されたアクションが取られていない：ドメインがメールを受け付けない）および5.1.10拡張状態コード（永続的なエラー：受信者のアドレスがnull MXを持っています）。"
    },
    {
      "indent": 3,
      "text": "A receiving SMTP server that chooses to reject email during the SMTP conversation that presents an undeliverable RFC5321.MailFrom or RFC5322.From domain can be more confident that for other messages a subsequent attempt to send a DSN or other response will reach a recipient SMTP server.",
      "ja": "配信不能RFC5321.MailFromまたはRFC5322.Fromドメインを提示SMTPの会話の間に電子メールを拒否することを選択した受信側のSMTPサーバーは、他のメッセージをDSNまたは他の応答を送信するために、後続の試みは、受信者のSMTPサーバに到達することをより確信することができます。"
    },
    {
      "indent": 3,
      "text": "SMTP servers that reject mail because a RFC5321.MailFrom or RFC5322.From domain has a null MX record SHOULD use a 550 reply code (Requested action not taken: mailbox unavailable) and a 5.7.27 enhanced status code (Permanent failure: Sender address has null MX).",
      "ja": "および5.7.27拡張状態コード（パーマネント失敗：RFC5321.MailFromまたはRFC5322.FromドメインがnullのMXレコードを持っているので、メールを拒否SMTPサーバーは550応答コード（メールボックス使用できません要求されたアクションとらない）：使用すべきである送信者アドレスを持っていますヌルMX）。"
    },
    {
      "indent": 0,
      "text": "4.2. Sending Mail from Domains That Publish Null MX",
      "section_title": true,
      "ja": "4.2. ヌルMXを公開しているドメインからのメールを送信します"
    },
    {
      "indent": 3,
      "text": "Null MX is primarily intended for domains that do not send or receive any mail, but have mail sent to them anyway due to mistakes or malice. Many receiving systems reject mail that has an invalid return address. Return addresses are needed to allow the sender to handle message delivery errors. An invalid return address often signals that the message is spam. Hence, mail systems SHOULD NOT publish a null MX record for domains that they use in RFC5321.MailFrom or RFC5322.From addresses. If a system nonetheless does so, it risks having its mail rejected.",
      "ja": "ヌルMXは、主に送信したり、任意のメールを受信、しかし、メールが原因のミスや悪意にとにかく彼らに送信されていないドメインを対象としています。多くの受信システムは、無効なリターンアドレスを持つメールを拒否します。リターンアドレスは、送信者がメッセージ配信エラーを処理できるようにするために必要とされています。無効なリターンアドレスは、多くの場合、メッセージがスパムであることを知らせます。そのため、メールシステムは、彼らがRFC5321.MailFromまたはRFC5322.Fromアドレスに使用するドメインにnull MXレコードを公開すべきではありません。システムはそれにもかかわらず、そうするならば、それはそのメールが拒否されたリスク。"
    },
    {
      "indent": 3,
      "text": "Operators of domains that do not send mail can publish Sender Policy Framework (SPF) \"-all\" policies [RFC7208] to make an explicit declaration that the domains send no mail.",
      "ja": "メールを送信しないドメインのオペレータは、ドメインが全くメールを送信しないことを明示的な宣言をするためにSPF（Sender Policy Framework）を「-all」の方針[RFC7208]を公開することができます。"
    },
    {
      "indent": 3,
      "text": "Null MX is not intended to be a replacement for the null reverse-path described in Section 4.5.5 of RFC 5321 and does not change the meaning or use of a null reverse-path.",
      "ja": "ヌルMXは、RFC 5321のセクション4.5.5に記載のヌル逆経路に代わることを意図するものではないとの意味またはヌル逆経路の使用を変更しません。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Within the DNS, a null MX RR is an ordinary MX record and presents no new security issues. If desired, it can be secured in the same manner as any other DNS record using DNSSEC.",
      "ja": "DNSの中で、ヌルMX RRは、通常のMXレコードで、新たなセキュリティ問題を提示していません。所望であれば、それはDNSSECを使用して、他のDNSレコードと同様に確保することができます。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has added the following entries to the \"Enumerated Status Codes\" subregistry of the \"Simple Mail Transfer Protocol (SMTP) Enhanced Status Codes Registry\".",
      "ja": "IANAは、「簡易メール転送プロトコル（SMTP）強化されたステータスコードレジストリ」の「列挙ステータスコード」副登録に次のエントリを追加しました。"
    },
    {
      "indent": 3,
      "text": "Code: X.1.10 Sample Text: Recipient address has null MX Associated basic status code: 556 Description: This status code is returned when the associated address is marked as invalid using a null MX. Reference: This document Submitter: Authors of this document Change controller: IESG",
      "ja": "コード：X.1.10サンプルテキスト：受信者のアドレスがnull MX関連する基本的なステータスコードを持っている：556説明：関連付けられたアドレスがヌルMXを使用して無効としてマークされている場合、このステータスコードが返されます。参考：このドキュメント投稿者：このドキュメントの変更コントローラの著者：IESG"
    },
    {
      "indent": 3,
      "text": "Code: X.7.27 Sample Text: Sender address has null MX Associated basic status code: 550 Description: This status code is returned when the associated sender address has a null MX, and the SMTP receiver is configured to reject mail from such sender (e.g., because it could not return a DSN). Reference: This document Submitter: Authors of this document Change controller: IESG",
      "ja": "コード：X.7.27サンプルテキスト：送信者アドレスがnull MX関連する基本的なステータスコードを持っている：550説明：関連付けられている送信者のアドレスがnull MXがあり、SMTPの受信機は、送信者からのメールを拒否するように構成されている場合、このステータスコードが返されます（たとえば、 、それはDSNを返すことができなかったので）。参考：このドキュメント投稿者：このドキュメントの変更コントローラの著者：IESG"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC1035] Mockapetris, P., \"Domain names - implementation and specification\", STD 13, RFC 1035, DOI 10.17487/RFC1035, November 1987, <http://www.rfc-editor.org/info/rfc1035>.",
      "ja": "[RFC1035] Mockapetris、P.、 \"ドメイン名 - 実装及び仕様\"、STD 13、RFC 1035、DOI 10.17487 / RFC1035、1987年11月、<http://www.rfc-editor.org/info/rfc1035>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC5321] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 5321, DOI 10.17487/RFC5321, October 2008, <http://www.rfc-editor.org/info/rfc5321>.",
      "ja": "[RFC5321] Klensin、J.、 \"簡易メール転送プロトコル\"、RFC 5321、DOI 10.17487 / RFC5321、2008年10月、<http://www.rfc-editor.org/info/rfc5321>。"
    },
    {
      "indent": 3,
      "text": "[RFC7504] Klensin, J., \"SMTP 521 and 556 Reply Codes\", RFC 7504, DOI 10.17487/RFC7504, June 2015, <http://www.rfc-editor.org/info/rfc7504>.",
      "ja": "[RFC7504] Klensin、J.、 \"SMTP 521と556応答コード\"、RFC 7504、DOI 10.17487 / RFC7504、2015年6月、<http://www.rfc-editor.org/info/rfc7504>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2782] Gulbrandsen, A., Vixie, P., and L. Esibov, \"A DNS RR for specifying the location of services (DNS SRV)\", RFC 2782, DOI 10.17487/RFC2782, February 2000, <http://www.rfc-editor.org/info/rfc2782>.",
      "ja": "[RFC2782] Gulbrandsenの、A.、いるVixie、P.、およびL. Esibov、 \"サービスの場所を特定するためのDNS RR（DNSのSRV）\"、RFC 2782、DOI 10.17487 / RFC2782、2000年2月、<HTTP：// www.rfc-editor.org/info/rfc2782>。"
    },
    {
      "indent": 3,
      "text": "[RFC5598] Crocker, D., \"Internet Mail Architecture\", RFC 5598, DOI 10.17487/RFC5598, July 2009, <http://www.rfc-editor.org/info/rfc5598>.",
      "ja": "[RFC5598]クロッカー、D.、 \"インターネットメールのアーキテクチャ\"、RFC 5598、DOI 10.17487 / RFC5598、2009年7月、<http://www.rfc-editor.org/info/rfc5598>。"
    },
    {
      "indent": 3,
      "text": "[RFC7208] Kitterman, S., \"Sender Policy Framework (SPF) for Authorizing Use of Domains in Email, Version 1\", RFC 7208, DOI 10.17487/RFC7208, April 2014, <http://www.rfc-editor.org/info/rfc7208>.",
      "ja": "[RFC7208] Kitterman、S.、 \"送信者ポリシーフレームワーク認可メールでのドメインの使用、バージョン1用（SPF）\"、RFC 7208、DOI 10.17487 / RFC7208、2014年4月、<http://www.rfc-editor.org /情報/ rfc7208>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "We thank Dave Crocker for his diligent and lengthy shepherding of this document, and members of the APPSAWG working group for their constructive suggestions.",
      "ja": "私たちは、彼の勤勉と長い本書のシェパディング、そして彼らの建設的な提案のためのAPPSAWGワーキンググループのメンバーのデイヴ・クロッカーに感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "John Levine Taughannock Networks PO Box 727 Trumansburg, NY 14886 United States",
      "ja": "ジョン・レヴァインTaughannockネットワーク私書箱727 Trumansburgに、NY 14886米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 831 480 2300 Email: standards@taugh.com URI: http://jl.ly",
      "ja": "電話：+1 831 480 2300 Eメール：standards@taugh.com URI：http://jl.ly"
    },
    {
      "indent": 3,
      "text": "Mark Delany Apple Inc. 1 Infinite Loop Cupertino, CA 95014 United States",
      "ja": "マーク・ディレイニーされたApple Inc. 1無限ループクパチーノ、CA 95014米国"
    },
    {
      "indent": 3,
      "text": "Email: mx0dot@yahoo.com",
      "ja": "メール：mx0dot@yahoo.com"
    }
  ]
}