{
  "title": {
    "text": "RFC 7198 - Duplicating RTP Streams",
    "ja": "RFC 7198 - 複製RTPストリーム"
  },
  "number": 7198,
  "created_at": "2019-10-30 00:10:15.822297+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          A. Begen\nRequest for Comments: 7198                                         Cisco\nCategory: Standards Track                                     C. Perkins\nISSN: 2070-1721                                    University of Glasgow\n                                                              April 2014",
      "raw": true
    },
    {
      "indent": 24,
      "text": "Duplicating RTP Streams",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Packet loss is undesirable for real-time multimedia sessions but can occur due to a variety of reasons including unplanned network outages. In unicast transmissions, recovering from such an outage can be difficult depending on the outage duration, due to the potentially large number of missing packets. In multicast transmissions, recovery is even more challenging as many receivers could be impacted by the outage. For this challenge, one solution that does not incur unbounded delay is to duplicate the packets and send them in separate redundant streams, provided that the underlying network satisfies certain requirements. This document explains how Real-time Transport Protocol (RTP) streams can be duplicated without breaking RTP or RTP Control Protocol (RTCP) rules.",
      "ja": "パケット損失は、リアルタイムのマルチメディアセッションのために望ましくないが、計画外のネットワークの停止を含めたさまざまな理由が原因で発生する可能性があります。ユニキャスト送信では、そのような障害から回復することは、欠落したパケットの潜在的に大きな数に、停止時間に応じて困難であり得ます。多くの受信機は、停電によって影響を受ける可能性がようマルチキャスト伝送では、回復はさらに困難です。この挑戦のために、無限の遅延は発生しません一つの解決策は、パケットを複製し、別の冗長ストリームでそれらを送信することで、基盤となるネットワークは、一定の要件を満たすことを条件とします。この文書では、リアルタイムトランスポートプロトコル（RTP）ストリームはRTPやRTP制御プロトコル（RTCP）のルールを壊すことなく、複製することができる方法を説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7198.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7198で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Terminology and Requirements Notation . . . . . . . . . . . .   4\n3.  Use Cases for Dual Streaming  . . . . . . . . . . . . . . . .   4\n  3.1.  Temporal Redundancy . . . . . . . . . . . . . . . . . . .   4\n  3.2.  Spatial Redundancy  . . . . . . . . . . . . . . . . . . .   5\n  3.3.  Dual Streaming over a Single Path or Multiple Paths . . .   5\n  3.4.  Requirements  . . . . . . . . . . . . . . . . . . . . . .   6\n4.  Use of RTP and RTCP with Temporal Redundancy  . . . . . . . .   7\n  4.1.  RTCP Considerations . . . . . . . . . . . . . . . . . . .   7\n  4.2.  Signaling Considerations  . . . . . . . . . . . . . . . .   7\n5.  Use of RTP and RTCP with Spatial Redundancy . . . . . . . . .   8\n  5.1.  RTCP Considerations . . . . . . . . . . . . . . . . . . .   9\n  5.2.  Signaling Considerations  . . . . . . . . . . . . . . . .   9\n6.  Use of RTP and RTCP with Temporal and Spatial Redundancy  . .  10\n7.  Congestion Control Considerations . . . . . . . . . . . . . .  10\n8.  Security Considerations . . . . . . . . . . . . . . . . . . .  11\n9.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .  11\n10. References  . . . . . . . . . . . . . . . . . . . . . . . . .  12\n  10.1.  Normative References . . . . . . . . . . . . . . . . . .  12\n  10.2.  Informative References . . . . . . . . . . . . . . . . .  12",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Real-time Transport Protocol (RTP) [RFC3550] is widely used today for delivering IPTV traffic and other real-time multimedia sessions. Many of these applications support very large numbers of receivers and rely on intra-domain UDP/IP multicast for efficient distribution of traffic within the network.",
      "ja": "リアルタイムトランスポートプロトコル（RTP）[RFC3550]は広くIPTVトラフィックおよび他のリアルタイムマルチメディアセッションを配信するために、今日使用されています。これらのアプリケーションの多くは、受信機の非常に大きな数をサポートし、ネットワーク内のトラフィックを効率的に配布するため、ドメイン内UDP / IPマルチキャストに依存しています。"
    },
    {
      "indent": 3,
      "text": "While this combination has proved successful, there does exist a weakness. As [RFC2354] noted, packet loss is not avoidable. This loss might be due to congestion; it might also be a result of an unplanned outage caused by a flapping link, a link or interface failure, a software bug, or a maintenance person accidentally cutting the wrong fiber. Since UDP/IP flows do not provide any means for detecting loss and retransmitting packets, it is left up to the RTP layer and the applications to detect, and recover from, packet loss.",
      "ja": "この組み合わせは成功したが、弱点が存在しません。 [RFC2354]で述べたように、パケットロスが避けられないです。この損失は、輻輳が原因かもしれません。それはまた、フラッピングリンク、リンクまたはインターフェースの故障、ソフトウェアのバグ、または間違った繊維を切断保守者によって引き起こされる計画外の停止の結果である可能性があります。 UDP / IPフローが損失を検出し、パケットを再送するための任意の手段を提供していないので、RTP層とを検出する用途に委ね、およびパケット損失から回復しています。"
    },
    {
      "indent": 3,
      "text": "In a carefully managed network, congestion should not normally happen; however, network outages can still happen due to the reasons listed above. In such a managed network, one technique to recover from packet loss without incurring unbounded delay is to duplicate the packets and send them in separate redundant streams. As described later in this document, the probability that two copies of the same packet are lost in cases of non-congestive packet loss is quite small.",
      "ja": "慎重に管理ネットワークでは、輻輳が正常に発生しません。しかし、ネットワークの停止は、まだ上記の理由により発生する可能性があります。そのような管理されたネットワークでは、無限の遅延を招くことなく、パケット損失から回復するための一つの技術は、パケットを複製し、別の冗長ストリームでそれらを送信することです。このドキュメントで後述するように、同じパケットの2つのコピーが非うっ血パケット損失の場合に失われる確率は非常に小さいです。"
    },
    {
      "indent": 3,
      "text": "Variations on this idea have been implemented and deployed today [IC2011]. However, duplication of RTP streams without breaking the RTP and RTCP functionality has not been documented properly. This document discusses the most common use cases and explains how duplication can be achieved for RTP streams in such use cases to address the immediate market needs. In the future, if there will be a different use case that is not covered by this document, a new specification that explains how RTP duplication should be done in such a scenario may be needed.",
      "ja": "このアイデアのバリエーションが実装され、今日[IC2011]を展開してきました。しかし、RTPの重複がRTPを壊すことなくストリームとRTCPの機能が適切に文書化されていません。この文書では、最も一般的な使用例について説明し、RTPは、当面、市場のニーズに対応するため、このようなユースケースでストリームのための重複を達成することができる方法を説明します。将来的には、場合には、この文書、RTPの重複が必要になることがあり、そのようなシナリオで行われるべき方法を説明し、新たな仕様で覆われていない別のユースケースがあるでしょう。"
    },
    {
      "indent": 3,
      "text": "Stream duplication offers a simple way to protect media flows from packet loss. It has a comparatively high overhead in terms of bandwidth, since everything is sent twice, but with a low overhead in terms of processing. It is also very predictable in its overheads. Alternative approaches, for example, retransmission-based recovery [RFC4588] or Forward Error Correction [RFC6363], may be suitable in some other cases.",
      "ja": "ストリームの重複は、パケット損失からメディアフローを保護するための簡単な方法を提供しています。すべてがなく、処理の面で低いオーバーヘッドで、2回送信されるので、それは、帯域幅の面で比較的高いオーバーヘッドがあります。それは、そのオーバーヘッドでも非常に予測可能です。代替的なアプローチ、例えば、再送ベースのリカバリ[RFC4588]または前方誤り訂正[RFC6363]は、他のいくつかの場合に適切であり得ます。"
    },
    {
      "indent": 0,
      "text": "2. Terminology and Requirements Notation",
      "section_title": true,
      "ja": "2.用語と要件表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、 \"推奨NOT\"、および「OPTIONAL 「本書では[RFC2119]で説明されるように解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "3. Use Cases for Dual Streaming",
      "section_title": true,
      "ja": "デュアルストリーミング3.ユースケース"
    },
    {
      "indent": 3,
      "text": "Dual streaming refers to a technique that involves transmitting two redundant RTP streams (the original plus its duplicate) of the same content, with each stream capable of supporting the playback when there is no packet loss. Therefore, adding an additional RTP stream provides a protection against packet loss. The level of protection depends on how the packets are sent and transmitted inside the network.",
      "ja": "デュアルストリーミングには、パケットロスがない場合、再生をサポートすることができる各ストリームと、同じコンテンツの2つの冗長RTPストリーム（オリジナルプラスその重複）を送信することを含む技術を指します。そのため、追加のRTPストリームを追加すると、パケット損失に対する保護を提供します。保護のレベルは、パケットが送信され、ネットワーク内で送信されている方法によって異なります。"
    },
    {
      "indent": 3,
      "text": "It is important to note that dual streaming can easily be extended to support cases when more than two streams are desired. However, using three or more streams is rare in practice, due to the high overhead that it incurs and the little additional protection it provides.",
      "ja": "デュアルストリーミングが簡単に二つ以上のストリームを希望された場合のケースをサポートするように拡張することができることに注意することが重要です。しかし、三つ以上のストリームを使用することは、それが負担することに高いオーバーヘッドとそれが提供して少し追加の保護のため、実際には稀です。"
    },
    {
      "indent": 0,
      "text": "3.1. Temporal Redundancy",
      "section_title": true,
      "ja": "3.1。時間的冗長性"
    },
    {
      "indent": 3,
      "text": "From a routing perspective, two streams are considered identical if the following two IP header fields are the same (in addition to the transport ports), since they will be both routed over the same path:",
      "ja": "次の2つのIPヘッダフィールドは、（トランスポートポートに加えて）同一である場合、それらが両方とも同じ経路を介してルーティングするためのルーティングの観点から、二つのストリームは、同じであると考えられます。"
    },
    {
      "indent": 3,
      "text": "o IP Source Address",
      "ja": "O IPソースアドレス"
    },
    {
      "indent": 3,
      "text": "o IP Destination Address",
      "ja": "O IP宛先アドレス"
    },
    {
      "indent": 3,
      "text": "Two routing-plane identical RTP streams might carry the same payload but can use different Synchronization Sources (SSRCs) to differentiate the RTP packets belonging to each stream. In the context of dual RTP streaming, we assume that the sender duplicates the RTP packets and sends them in separate RTP streams, each with a unique SSRC. All the redundant streams are transmitted in the same RTP session.",
      "ja": "2つのルーティング面同じRTPストリームは、同一のペイロードを運ぶかもしれないが、各ストリームに属するRTPパケットを区別するために異なる同期ソース（SSRCs）を使用することができます。デュアルRTPストリーミングの文脈において、我々は、送信者がRTPパケットを複製し、ユニークなSSRCでそれぞれ、別々のRTPストリームでそれらを送信することを前提としています。すべての冗長ストリームは同じRTPセッションで送信されています。"
    },
    {
      "indent": 3,
      "text": "For example, one main stream and its duplicate stream can be sent to the same IP destination address and UDP destination port with a certain delay between them [RFC7197]. The streams carry the same payload in their respective RTP packets with identical sequence numbers. This allows receivers (or other nodes responsible for gap filling and duplicate suppression) to identify and suppress the duplicate packets, and subsequently produce a hopefully loss-free and duplication-free output stream. This process is commonly called \"stream merging\" or \"de-duplication\".",
      "ja": "例えば、一つのメインストリームとその重複ストリームが同じIP宛先アドレスと、それらの間に一定の遅延[RFC7197]とUDP宛先ポートに送信することができます。ストリームは、同一のシーケンス番号を有するそれぞれのRTPパケット内の同じペイロードを運びます。これは、受信機（またはギャップを担う他のノードは、充填および複製の抑制）を識別し、重複パケットを抑制し、続いてできれば無損失と複製フリー出力ストリームを生成することを可能にします。このプロセスは、一般に「ストリームのマージ」または「重複」と呼ばれています。"
    },
    {
      "indent": 0,
      "text": "3.2. Spatial Redundancy",
      "section_title": true,
      "ja": "3.2。空間的冗長性"
    },
    {
      "indent": 3,
      "text": "An RTP source might be associated with multiple network interfaces, allowing it to send two redundant streams from two separate source addresses. Such streams can be routed over diverse or identical paths, depending on the routing algorithm used inside the network. At the receiving end, the node responsible for duplicate suppression can look into various RTP header fields, for example, SSRC and sequence number, to identify and suppress the duplicate packets.",
      "ja": "RTPソースは、2つの別々のソースアドレスから、2つの冗長ストリームを送信することができ、複数のネットワークインターフェイスに関連付けされるかもしれません。そのようなストリームは、ネットワーク内で使用されるルーティングアルゴリズムに依存して、多様な又は同一の経路を介してルーティングすることができます。受信側では、重複抑制を担うノードは、例えば、SSRC及びシーケンス番号は、重複パケットを識別および抑制するために、種々のRTPヘッダフィールドの中に見ることができます。"
    },
    {
      "indent": 3,
      "text": "If source-specific multicast (SSM) transport is used to carry such redundant streams, there will be a separate SSM session for each redundant stream since the streams are sourced from different interfaces (i.e., IP addresses). Thus, the receiving host has to join each SSM session separately.",
      "ja": "ソース固有マルチキャスト（SSM）輸送は、このような冗長ストリームを伝送するために使用される場合ストリームは異なるインタフェース（すなわち、IPアドレス）から供給されるので、各冗長ストリームに対して別々のSSMセッションが存在するであろう。このように、受信ホストは、個別に各SSMのセッションに参加しています。"
    },
    {
      "indent": 3,
      "text": "Alternatively, the destination host could also have multiple IP addresses for an RTP source to send the redundant streams to.",
      "ja": "代替的に、宛先ホストにも冗長ストリームを送信するRTPソースの複数のIPアドレスを有することができます。"
    },
    {
      "indent": 0,
      "text": "3.3. Dual Streaming over a Single Path or Multiple Paths",
      "section_title": true,
      "ja": "3.3。シングルパスまたは複数のパスを超えるデュアルストリーミング"
    },
    {
      "indent": 3,
      "text": "Having described the characteristics of the streams, one can reach the following conclusions:",
      "ja": "ストリームの特徴を説明してきたが、一つは次のような結論に到達することができます："
    },
    {
      "indent": 3,
      "text": "1. When two routing-plane identical streams are used, the flow labels will be the same. This makes it impractical to forward the packets onto different paths. In order to minimize packet loss, the packets belonging to one stream are often interleaved with packets belonging to its duplicate stream, and with a delay, so that if there is a packet loss, such a delay would allow the same packet from the duplicate stream to reach the receiver because the chances that the same packet is lost in transit again are often small. This is what is also known as \"time-shifted redundancy\", \"temporal redundancy\" or simply \"delayed duplication\" [RFC7197] [IC2011]. This approach can be used with both types of dual streaming, described in Sections 3.1 and 3.2.",
      "ja": "2つのルーティング面同じストリームを使用する場合1、フローラベルは同じであろう。これは非現実的で異なるパスにパケットを転送することができます。パケット損失がある場合、このような遅延は、重複したストリームから同じパケットを可能にするように、パケットの損失を最小限に抑えるために、一つのストリームに属するパケットは、多くの場合、その複製ストリームに属するパケットとインターリーブ、および遅延とされています同じパケットが転送中に失われる可能性が再び頻繁に小さいため、受信機に到達します。これはまた、「タイムシフト冗長性」、「時間的冗長性」または単に「遅延重複」[RFC7197] [IC2011]として知られているものです。このアプローチは、セクション3.1と3.2で説明したデュアルストリーミングの種類、両方で使用することができます。"
    },
    {
      "indent": 3,
      "text": "2. If the two streams have different IP headers, an additional opportunity arises in that one is able to build a network, with physically diverse paths, to deliver the two streams concurrently to the intended receivers. This reduces the delay when packet loss occurs and needs to be recovered. Additionally, it also further reduces chances for packet loss. An unrecoverable loss happens only when two network failures happen in such a way that the same packet is affected on both paths. This is referred to as Spatial Diversity or Spatial Redundancy [IC2011]. The techniques used to build diverse paths are beyond the scope of this document.",
      "ja": "2.2つのストリームが異なるIPヘッダを使用している場合、追加の機会が1つで発生は、目的の受信機に同時に2つのストリームを配信するために、物理的に多様な経路で、ネットワークを構築することが可能です。これは、パケットロスが発生して回復する必要が遅延を低減します。さらに、それはまた、さらに、パケット損失の可能性を低減します。 2つのネットワーク障害が同じパケットが両方のパスに影響されるように起こる場合にのみ回復不能な損失が起こります。これは、空間ダイバーシティまたは空間的冗長性[IC2011]と呼ぶことにします。多様なパスを構築するために使用される技術は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 7,
      "text": "Note that spatial redundancy often offers less delay in\nrecovering from packet loss, provided that the forwarding delay\nof the network paths are more or less the same.  (This is often\nensured through careful network design.)  For both temporal and\nspatial redundancy approaches, packet misordering might still\nhappen and needs to be handled using the sequence numbers of some\nsort (e.g., RTP sequence numbers).",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Temporal and spatial redundancy deal with different patterns of packet loss. The former helps with transient loss (within the duplication window), while the latter helps with longer-term packet loss that affects only one of the two redundant paths.",
      "ja": "パケット損失の異なるパターンの時間的、空間的冗長性の契約。後者は2つだけの冗長パスの影響長期パケット損失に役立つ前者は、（複製ウィンドウ内で）一過性損失に役立ちます。"
    },
    {
      "indent": 3,
      "text": "To summarize, dual streaming allows an application and a network to work together to provide a near-zero-loss transport with a bounded or minimum delay. The additional advantage includes a predictable bandwidth overhead that is proportional to the minimum bandwidth needed for the multimedia session, but independent of the number of receivers experiencing a packet loss and requesting a retransmission. For a survey and comparison of similar approaches, refer to [IC2011].",
      "ja": "要約すると、デュアル・ストリーミングは、アプリケーションとネットワークが有界または最小の遅延でゼロに近い損失輸送を提供するために連携して動作することができます。追加の利点は、マルチメディアセッションのために必要な最小帯域幅に比例しますが、パケットロスを経験し、再送信を要求する受信機の数とは独立した予測可能な帯域幅のオーバーヘッドが含まれています。調査と同様のアプローチの比較のために、[IC2011]を指します。"
    },
    {
      "indent": 0,
      "text": "3.4. Requirements",
      "section_title": true,
      "ja": "3.4。必要条件"
    },
    {
      "indent": 3,
      "text": "One of the following conditions is currently REQUIRED to hold in applications using this specification:",
      "ja": "以下の条件の一つは、現在この仕様を使用してアプリケーションに保持するために必要です。"
    },
    {
      "indent": 3,
      "text": "o The original and duplicate RTP streams are carried (with their own SSRCs) in the same \"m\" line. (There could be other RTP streams listed in the same \"m\" line.)",
      "ja": "Oオリジナルと複製RTPストリームは、同じ「M」の行に（自分のSSRCsで）実施されます。 （同じ「M」の行に記載されている他のRTPストリームがある可能性があります。）"
    },
    {
      "indent": 3,
      "text": "o The original and duplicate RTP streams are carried in separate \"m\" lines, and there is no other RTP stream listed in either \"m\" line.",
      "ja": "Oオリジナルと複製RTPストリームは、別個の「M」ラインで運ばれ、そしていずれかの「M」の行に記載されている他のRTPストリームが存在していません。"
    },
    {
      "indent": 3,
      "text": "When the original and duplicate RTP streams are carried in separate \"m\" lines in a Session Description Protocol (SDP) description and if the SDP description has one or more other RTP streams listed in either \"m\" line, duplication grouping is not trivial and further signaling will be needed; this is left for future standardization.",
      "ja": "オリジナルと複製RTPストリームはセッション記述プロトコル（SDP）の説明では別個の「M」ラインで運ばれ、SDP記述は、1つ以上を有する場合、他のRTPのいずれか「M」の行に記載されているストリーム場合、複製グループ化が容易ではないとさらにシグナリングが必要になります。これは、将来の標準化のために残されています。"
    },
    {
      "indent": 0,
      "text": "4. Use of RTP and RTCP with Temporal Redundancy",
      "section_title": true,
      "ja": "時間的冗長性とRTPとRTCPの4."
    },
    {
      "indent": 3,
      "text": "To achieve temporal redundancy, the main and duplicate RTP streams SHOULD be sent using the sample 5-tuple of transport protocol, source and destination IP addresses, and source and destination transport ports. Due to the possible presence of network address and port translation (NAPT) devices, load balancers, or other middleboxes, use of anything other than an identical 5-tuple and flow label might also cause spatial redundancy (which might introduce an additional delay due to the delta between the path delays), and so it is NOT RECOMMENDED unless the path is known to be free of such middleboxes.",
      "ja": "時間的冗長性を達成するために、主と重複RTPストリームは、トランスポートプロトコル、ソースおよび宛先IPアドレス、送信元および宛先のトランスポートポートのサンプル5タプルを使用して送信されるべきです。ネットワークアドレスとポート変換（NAPT）デバイス、ロードバランサ、または他のミドルボックスの存在の可能性に、同じ5タプルとフローラベル以外の使用はまた、（空間的冗長性を引き起こす可能性に起因して、追加の遅延を導入する可能性がありますパス遅延の間のデルタ）、およびパスは、このようなミドルボックスの自由であることが知られない限り、それはお勧めしません。"
    },
    {
      "indent": 3,
      "text": "Since the main and duplicate RTP streams follow an identical path, they are part of the same RTP session. Accordingly, the sender MUST choose a different SSRC for the duplicate RTP stream than it chose for the main RTP stream, following the rules in Section 8 of [RFC3550].",
      "ja": "RTPは、同じ経路をたどるストリーム複製主とするので、それらは同じRTPセッションの一部です。したがって、送信者は、[RFC3550]の第8章の規則に従って、メインRTPストリームのために選択したよりも、重複したRTPストリームのための異なるSSRCを選択する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.1. RTCP Considerations",
      "section_title": true,
      "ja": "4.1。 RTCPの考慮事項"
    },
    {
      "indent": 3,
      "text": "If RTCP is being sent for the main RTP stream, then the sender MUST also generate RTCP for the duplicate RTP stream. The RTCP for the duplicate RTP stream is generated exactly as if the duplicate RTP stream were a regular media stream. The sender MUST NOT duplicate the RTCP packets sent for the main RTP stream when sending the duplicate stream; instead, it MUST generate new RTCP reports for the duplicate stream. The sender MUST use the same RTCP CNAME in the RTCP reports it sends for both streams, so that the receiver can synchronize them.",
      "ja": "RTCPは、メインRTPストリームのために送信されている場合は、送信者はまた、重複したRTPストリームのためのRTCPを発生させなければなりません。重複したRTPストリームは、通常のメディアストリームであるかのように重複したRTPストリームのRTCPを正確に生成されます。重複したストリームを送信する際、送信者は、メインRTPストリームのために送られたRTCPパケットを複製してはなりません。その代わり、それは重複したストリームのための新しいRTCPレポートを生成しなければなりません。 RTCPに同じRTCP CNAMEを使用しなければならない送信者は受信者がそれらを同期させることができるように、それは、両方のストリームのために送信し報告します。"
    },
    {
      "indent": 3,
      "text": "The main and duplicate streams are conceptually synchronized using the standard mechanism based on RTCP Sender Reports, deriving a mapping between their timelines. However, the RTP timestamps and sequence numbers MUST be identical in the main and duplicate streams, making the mapping quite trivial.",
      "ja": "メインと重複ストリームは、概念的に、そのタイムラインとの間のマッピングを導き出す、RTCP送信レポートに基づく標準的なメカニズムを使用して同期されます。しかし、RTPタイムスタンプとシーケンス番号は、マッピングはかなり些細な作り、メインと重複ストリームが同一でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Both the main and duplicate RTP streams, and their corresponding RTCP reports, will be received. If RTCP is used, receivers MUST generate RTCP reports for both the main and duplicate streams in the usual way, treating them as entirely separate media streams.",
      "ja": "どちらもメインと重複するRTPストリーム、およびそれらに対応するRTCPレポートは、受信されます。 RTCPを使用する場合、受信機は、RTCPは、メインと完全に独立したメディアストリームとして扱う、通常の方法でストリームを複製の両方のためにレポートを生成しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2. Signaling Considerations",
      "section_title": true,
      "ja": "4.2。シグナリングの考慮事項"
    },
    {
      "indent": 3,
      "text": "Signaling is needed to allow the receiver to determine that an RTP stream is a duplicate of another, rather than a separate stream that needs to be rendered in parallel. There are two parts to this: an SDP extension is needed in the offer/answer exchange to negotiate support for temporal redundancy; and signaling is needed to indicate which stream is the duplicate. (The latter can be done in-band using an RTCP extension or out-of-band in the SDP description.)",
      "ja": "シグナリングは、受信機は、RTPストリームはなく並列にレンダリングする必要が別のストリームよりも、別の複製であることを決定することを可能にするために必要とされます。これには2つの部分があります：SDP拡張は、時間的冗長性のためのサポートを交渉するためにオファー/アンサー交換に必要とされています。そしてシグナリングは、重複しているストリームを示すために必要とされます。 （後者は、SDP記述のRTCP拡張またはアウトオブバンドを使用して、帯域内で行うことができます。）"
    },
    {
      "indent": 3,
      "text": "Out-of-band signaling is needed for both features. The SDP attribute to signal duplication in the SDP offer/answer exchange ('duplication-delay') is defined in [RFC7197]. The required SDP grouping semantics are defined in [RFC7104].",
      "ja": "アウトオブバンドシグナリングは、両方の機能のために必要とされています。 SDPオファー/アンサー交換（「重複遅延」）に複製をシグナリングするSDP属性は[RFC7197]で定義されています。必要SDPグループ化セマンティクスは[RFC7104]で定義されています。"
    },
    {
      "indent": 3,
      "text": "In the following SDP example, a video stream is duplicated, and the main and duplicate streams are transmitted in two separate SSRCs (1000 and 1010):",
      "ja": "次のSDPの例では、ビデオストリームが複製され、そして主と重複するストリームは、2つの別個のSSRCs（1000,1010）で送信されます。"
    },
    {
      "indent": 8,
      "text": "v=0\no=ali 1122334455 1122334466 IN IP4 dup.example.com\ns=Delayed Duplication\nt=0 0\nm=video 30000 RTP/AVP 100\nc=IN IP4 233.252.0.1/127\na=source-filter:incl IN IP4 233.252.0.1 198.51.100.1\na=rtpmap:100 MP2T/90000\na=ssrc:1000 cname:ch1a@example.com\na=ssrc:1010 cname:ch1a@example.com\na=ssrc-group:DUP 1000 1010\na=duplication-delay:50\na=mid:Ch1",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Section 3.2 of [RFC7104] states that it is advisable that the SSRC listed first in the \"a=ssrc-group:\" line (i.e., SSRC of 1000) is sent first, with the other SSRC (i.e., SSRC of 1010) being the time-delayed duplicate. This is not critical, however, and a receiving host should size its playout buffer based on the 'duplication-delay' attribute and play the stream that arrives first in preference, with the other stream acting as a repair stream, irrespective of the order in which they are signaled.",
      "ja": "[RFC7104]のセクション3.2は、SSRCはで最初にリストことが賢明であると述べている「A = SSRCグループ：」行（すなわち、1000 SSRC）は他のSSRC（1010すなわち、SSRC）と、最初に送信されるが、あります時間遅延の重複。しかし、これは重要ではなく、受信ホストは、サイズは、その再生バッファ「重複遅延」属性に基づいており、他のストリームがリペアストリームとして働くと、優先的に最初に到着したストリームを再生する必要があり、関係なく、順序の中それらが通知されます。"
    },
    {
      "indent": 0,
      "text": "5. Use of RTP and RTCP with Spatial Redundancy",
      "section_title": true,
      "ja": "空間的冗長性とRTPとRTCPの5."
    },
    {
      "indent": 3,
      "text": "Assuming the network is structured appropriately, when using spatial redundancy, the duplicate RTP stream is sent using a different source and/or destination address/port pair. This will be a separate RTP session from the session conveying the main RTP stream. Thus, the SSRCs used for the main and duplicate streams MUST be chosen randomly, following the rules in Section 8 of [RFC3550]. Accordingly, they will almost certainly not match each other. The sender MUST, however, use the same RTCP CNAME for both the main and duplicate streams. An \"a=group:DUP\" line or \"a=ssrc-group:DUP\" line is used to indicate duplication.",
      "ja": "空間的冗長性を使用する場合、ネットワークは、適切に構成されていると仮定すると、重複したRTPストリームは、異なるソースおよび/または宛先アドレス/ポートのペアを使用して送信されます。これは、メインRTPストリームを搬送するセッションとは別のRTPセッションであろう。したがって、主重複ストリームに使用SSRCsは[RFC3550]の第8章の規則に従って、ランダムに選択されなければなりません。したがって、彼らはほぼ確実に一致しなくなります。送信者は、しかし、メインの両方に同じRTCP CNAMEを使用してストリームを複製する必要があります。 「A =基：DUP」行または「A = SSRCグループ：DUP」行が重複を示すために使用されます。"
    },
    {
      "indent": 0,
      "text": "5.1. RTCP Considerations",
      "section_title": true,
      "ja": "5.1。 RTCPの考慮事項"
    },
    {
      "indent": 3,
      "text": "If RTCP is being sent for the main RTP stream, then the sender MUST also generate RTCP for the duplicate RTP stream. The RTCP for the duplicate RTP stream is generated exactly as if the duplicate RTP stream were a regular media stream. The sender MUST NOT duplicate the RTCP packets sent for the main RTP stream when sending the duplicate stream; instead, it MUST generate new RTCP reports for the duplicate stream. The sender MUST use the same RTCP CNAME in the RTCP reports it sends for both streams, so that the receiver can synchronize them.",
      "ja": "RTCPは、メインRTPストリームのために送信されている場合は、送信者はまた、重複したRTPストリームのためのRTCPを発生させなければなりません。重複したRTPストリームは、通常のメディアストリームであるかのように重複したRTPストリームのRTCPを正確に生成されます。重複したストリームを送信する際、送信者は、メインRTPストリームのために送られたRTCPパケットを複製してはなりません。その代わり、それは重複したストリームのための新しいRTCPレポートを生成しなければなりません。 RTCPに同じRTCP CNAMEを使用しなければならない送信者は受信者がそれらを同期させることができるように、それは、両方のストリームのために送信し報告します。"
    },
    {
      "indent": 3,
      "text": "The main and duplicate streams are conceptually synchronized using the standard mechanism based on RTCP Sender Reports, deriving a mapping between their timelines. However, the RTP timestamps and sequence numbers MUST be identical in the main and duplicate streams, making the mapping quite trivial.",
      "ja": "メインと重複ストリームは、概念的に、そのタイムラインとの間のマッピングを導き出す、RTCP送信レポートに基づく標準的なメカニズムを使用して同期されます。しかし、RTPタイムスタンプとシーケンス番号は、マッピングはかなり些細な作り、メインと重複ストリームが同一でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Both the main and duplicate RTP streams, and their corresponding RTCP reports, will be received. If RTCP is used, receivers MUST generate RTCP reports for both the main and duplicate streams in the usual way, treating them as entirely separate media streams.",
      "ja": "どちらもメインと重複するRTPストリーム、およびそれらに対応するRTCPレポートは、受信されます。 RTCPを使用する場合、受信機は、RTCPは、メインと完全に独立したメディアストリームとして扱う、通常の方法でストリームを複製の両方のためにレポートを生成しなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.2. Signaling Considerations",
      "section_title": true,
      "ja": "5.2。シグナリングの考慮事項"
    },
    {
      "indent": 3,
      "text": "The required SDP grouping semantics have been defined in [RFC7104]. In the following example, the redundant streams have different IP destination addresses. The example shows the same UDP port number and IP source address for each stream, but either or both could have been different for the two streams.",
      "ja": "必要SDPグループ化セマンティクスは[RFC7104]で定義されています。次の例では、冗長ストリームは、異なるIP宛先アドレスを持ちます。例では、同じUDPポート番号と各ストリームのIP送信元アドレスを示しているが、いずれか一方または両方は、2つのストリームに異なるだったかもしれません。"
    },
    {
      "indent": 8,
      "text": "v=0\no=ali 1122334455 1122334466 IN IP4 dup.example.com\ns=DUP Grouping Semantics\nt=0 0\na=group:DUP S1a S1b\nm=video 30000 RTP/AVP 100\nc=IN IP4 233.252.0.1/127\na=source-filter:incl IN IP4 233.252.0.1 198.51.100.1\na=rtpmap:100 MP2T/90000\na=mid:S1a\nm=video 30000 RTP/AVP 101\nc=IN IP4 233.252.0.2/127\na=source-filter:incl IN IP4 233.252.0.2 198.51.100.1\na=rtpmap:101 MP2T/90000\na=mid:S1b",
      "raw": true
    },
    {
      "indent": 0,
      "text": "6. Use of RTP and RTCP with Temporal and Spatial Redundancy",
      "section_title": true,
      "ja": "時間的および空間的冗長性とRTPとRTCPの6."
    },
    {
      "indent": 3,
      "text": "This uses the same RTP/RTCP mechanisms from Sections 4 and 5, plus a combination of signaling provided in each of these sections.",
      "ja": "これは、セクション4および5から同じRTP / RTCPメカニズムに加え、これらのセクションの各々に設けられたシグナリングの組み合わせを使用します。"
    },
    {
      "indent": 0,
      "text": "7. Congestion Control Considerations",
      "section_title": true,
      "ja": "7.輻輳制御に関する注意事項"
    },
    {
      "indent": 3,
      "text": "Duplicating RTP streams has several considerations in the context of congestion control. First of all, RTP duplication MUST NOT be used in cases where the primary cause of packet loss is congestion since duplication can make congestion only worse. Furthermore, RTP duplication SHOULD NOT be used where there is a risk of congestion upon duplicating an RTP stream. Duplication is RECOMMENDED only to be used for protection against network outages due to a temporary link or network element failure and where it is known (e.g., through explicit operator configuration) that there is sufficient network capacity to carry the duplicated traffic. The capacity requirement constrains the use of duplication to managed networks and makes it unsuitable for use on unmanaged public networks.",
      "ja": "RTPストリームを複製する輻輳制御の文脈の中でいくつかの注意事項があります。まず、RTPの重複は、パケット損失の主な原因は、重複が輻輳が唯一悪化させることができるので、輻輳ある場合に使用してはいけません。 RTPストリームを複製する際の混雑の危険性がある場合また、RTPの複製を使用しないでください。複製は、推奨される複製トラフィックを伝送するために十分なネットワーク容量があることを、一時的なリンクまたはネットワーク構成要素の故障、それが知られている場合（例えば、明示的なオペレータ構成を通して）によるネットワーク障害に対する保護のために使用されます。容量の要件は、管理対象のネットワークに重複の使用を制約し、管理されていない公共ネットワーク上で使用するためには適しません。"
    },
    {
      "indent": 3,
      "text": "It is essential that the nodes responsible for the duplication and de-duplication are aware of the original stream's requirements and the available capacity inside the network. If there is an adaptation capability for the original stream, these nodes have to assume the same adaptation capability for the duplicated stream, too. For example, if the source doubles the bitrate for the original stream, the bitrate of the duplicate stream will also be doubled.",
      "ja": "重複や重複排除を担当するノードは、元のストリームの要件およびネットワーク内の利用可能な容量を認識していることが不可欠です。元のストリームのための適応能力が存在する場合、これらのノードは、あまりにも、複製されたストリームに対して同じ適応能力を想定しなければなりません。ソースは、元のストリームのためのビットレートを倍増する場合、例えば、重複したストリームのビットレートも倍増します。"
    },
    {
      "indent": 3,
      "text": "Depending on where de-duplication takes place, there could be different scenarios. When the duplication and de-duplication take place inside the network before the ultimate endpoints that will consume the RTP media, the whole process is transparent to these endpoints. Thus, these endpoints will apply any congestion control, if applicable, on the de-duplicated RTP stream. This output stream will have fewer losses than either the original or duplicated stream will have, and the endpoint will make congestion control decisions accordingly. However, if de-duplication takes place at the ultimate endpoint, this endpoint MUST consider the aggregate of the original and duplicated RTP stream in any congestion control it wants to apply. The endpoint will observe the losses in each stream separately, and this information can be used to fine-tune the duplication process. For example, the duplication interval can be adjusted based on the duration of a common packet loss in both streams. In these scenarios, the RTP Monitoring Framework [RFC6792] can be used to monitor the duplicated streams in the same way an ordinary RTP would be monitored.",
      "ja": "重複排除が行われる場所に応じて、異なるシナリオがあるかもしれません。重複や重複排除がRTPメディアを消費します究極のエンドポイント前に、ネットワーク内の場所を取るときは、全体のプロセスは、これらのエンドポイントに透過的です。該当する場合はこのように、これらのエンドポイントは、重複除外RTPストリーム上で、任意の輻輳制御を適用します。この出力ストリームは、オリジナルまたは複製ストリームがありますいずれかより少ない損失を持つことになり、エンドポイントはそれに応じて輻輳制御の決定を行います。重複除外は究極のエンドポイントで行われます場合は、このエンドポイントは、元の集約を検討し、それを適用したい任意の輻輳制御にRTPストリームを複製しなければなりません。エンドポイントは、個別に各ストリームの損失を観察すると、この情報は複製処理を微調整するために使用することができます。例えば、複製間隔は、両方のストリームに共通のパケット損失の持続時間に基づいて調整することができます。これらのシナリオでは、RTPモニタリングフレームワーク[RFC6792]は、通常のRTPを監視するのと同じ方法で複製ストリームを監視するために使用することができます。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations of [RFC3550], [RFC7104], [RFC7197], and any RTP profiles and payload formats in use apply.",
      "ja": "使用中の[RFC3550]、[RFC7104]、[RFC7197]、および任意のRTPプロファイルとペイロードフォーマットのセキュリティに関する考慮事項が適用されます。"
    },
    {
      "indent": 3,
      "text": "Duplication can be performed end-to-end, with the media sender generating a duplicate RTP stream, and the receiver(s) performing de-duplication. In such cases, if the original media stream is to be authenticated (e.g., using Secure RTP (SRTP) [RFC3711]), then the duplicate stream also needs to be authenticated, and duplicate packets that fail the authentication check need to be discarded.",
      "ja": "重複は、重複するRTPストリームを生成するメディア送信者と受信機（複数可）を行う重複排除と、エンドツーエンドを行うことができます。元のメディアストリームが認証される場合、このような場合には、（例えば、セキュアRTP（SRTP）[RFC3711]を使用して）、次いで重複ストリームはまた、認証、および認証チェックに失敗し廃棄する必要があるパケットを複製する必要があります。"
    },
    {
      "indent": 3,
      "text": "Stream duplication and de-duplication can also be performed by in-network middleboxes. Such middleboxes will need to rewrite the RTP SSRC such that the RTP packets in the duplicate stream have a different SSRC to the original stream, and such middleboxes will need to generate and respond to RTCP packets corresponding to the duplicate stream. This sort of in-network duplication service has the potential to act as an amplifier for denial-of-service attacks if the attacker can cause attack traffic to be duplicated. To prevent this, middleboxes providing the duplication service need to authenticate the traffic to be duplicated as being from a legitimate source, for example, using the SRTP profile [RFC3711]. This requires the middlebox to be part of the security context of the media session being duplicated, so it has access to the necessary keying material for authentication. To do this, the middlebox will need to be privy to the session setup signaling. Details of how that is done will depend on the type of signaling used (SIP, Real Time Streaming Protocol (RTSP), WebRTC, etc.), and is not specified here.",
      "ja": "ストリーム複製と重複排除はまた、ネットワーク中間装置によって行うことができます。このようなミドルボックスは、重複したストリームにおけるRTPパケットは、元のストリームに異なるSSRCを持ち、かつ、そのようなミドルボックスを生成し、重複したストリームに対応するRTCPパケットに応答する必要があることに、このようなRTP SSRCを書き換える必要があります。ネットワーク内の重複サービスのこの種の攻撃者は、攻撃トラフィックが重複させることができる場合、サービス拒否攻撃用アンプとして作用する可能性があります。これを防止するために、複製サービスを提供するミドルボックスは、SRTPプロファイル[RFC3711]を使用して、例えば、正当なソースからのものと重複するトラフィックを認証する必要があります。これは、複製されるメディアセッションのセキュリティコンテキストの一部であることがミドルを要求するので、認証に必要な鍵素材へのアクセス権を持っています。これを行うには、ミドルは、セッションセットアップシグナリングに関与する必要があります。それがどのように行われるかの詳細については、使用（SIPなどのリアルタイムストリーミングプロトコル（RTSP）、のWebRTCを、）シグナリングの種類に依存し、ここで指定されていません。"
    },
    {
      "indent": 3,
      "text": "Similarly, to prevent packet injection attacks, a de-duplication middlebox needs to authenticate original and duplicate streams, and ought not use non-authenticated packets that are received. Again, this requires the middlebox to be part of the security context and to have access to the appropriate signaling and keying material.",
      "ja": "同様に、パケットインジェクション攻撃を防ぐために、デデュプリケーションミドルボックスは、元の認証およびストリームを複製する必要があり、受信された非認証パケットを使用しないはずです。繰り返しますが、これはセキュリティコンテキストの一部であるように、適切なシグナリングとキーへのアクセス権を持っているミドルが必要です。"
    },
    {
      "indent": 3,
      "text": "The use of the encryption features of SRTP does not affect stream de-duplication middleboxes, since the RTP headers are sent in the clear.",
      "ja": "RTPヘッダーが平文で送信されているので、SRTPの暗号化機能を使用するには、ストリームデデュプリケーションミドルボックスには影響を与えません。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgments",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Magnus Westerlund for his suggestions.",
      "ja": "彼の提案のためのマグヌスウェスターに感謝します。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, July 2003.",
      "ja": "[RFC3550] Schulzrinneと、H.、Casner、S.、フレデリック、R.、およびV.ヤコブソン、 \"RTP：リアルタイムアプリケーションのためのトランスポートプロトコル\"、STD 64、RFC 3550、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC7197] Begen, A., Cai, Y., and H. Ou, \"Duplication Delay Attribute in the Session Description Protocol\", RFC 7197, April 2014.",
      "ja": "[RFC7197] Begen、A.、カイ、Y.、およびH.王、 \"セッション記述プロトコルにおける複製DELAY属性\"、RFC 7197、2014年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC7104] Begen, A., Cai, Y., and H. Ou, \"Duplication Grouping Semantics in the Session Description Protocol\", RFC 7104, January 2014.",
      "ja": "[RFC7104] Begen、A.、カイ、Y.、およびH.王、 \"セッション記述プロトコルにおける複製グループ化セマンティクス\"、RFC 7104、2014年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3711] Baugher, M., McGrew, D., Naslund, M., Carrara, E., and K. Norrman, \"The Secure Real-time Transport Protocol (SRTP)\", RFC 3711, March 2004.",
      "ja": "[RFC3711] Baugher、M.、マグリュー、D.、Naslund、M.、カララ、E.、およびK. Norrman、 \"セキュアリアルタイム転送プロトコル（SRTP）\"、RFC 3711、2004年3月。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2354] Perkins, C. and O. Hodson, \"Options for Repair of Streaming Media\", RFC 2354, June 1998.",
      "ja": "[RFC2354]パーキンス、C.およびO.ホドソン、 \"ストリーミングメディアの修理のためのオプション\"、RFC 2354、1998年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC4588] Rey, J., Leon, D., Miyazaki, A., Varsa, V., and R. Hakenberg, \"RTP Retransmission Payload Format\", RFC 4588, July 2006.",
      "ja": "[RFC4588]レイ、J.、レオン、D.、宮崎、A.、Varsa、V.、およびR. Hakenberg、 \"RTP再送信ペイロードフォーマット\"、RFC 4588、2006年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC6363] Watson, M., Begen, A., and V. Roca, \"Forward Error Correction (FEC) Framework\", RFC 6363, October 2011.",
      "ja": "[RFC6363]ワトソン、M.、Begen、A.、およびV.ロカ、 \"前方誤り訂正（FEC）フレームワーク\"、RFC 6363、2011年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6792] Wu, Q., Hunt, G., and P. Arden, \"Guidelines for Use of the RTP Monitoring Framework\", RFC 6792, November 2012.",
      "ja": "[RFC6792]呉、Q.、ハント、G.、およびP.アーデン、 \"RTPの監視フレームワークの使用のためのガイドライン\"、RFC 6792、2012年11月。"
    },
    {
      "indent": 3,
      "text": "[IC2011] Evans, J., Begen, A., Greengrass, J., and C. Filsfils, \"Toward Lossless Video Transport\", IEEE Internet Computing, Vol. 15, No. 6, pp. 48-57, November 2011.",
      "ja": "[IC2011]エバンス、J.、Begen、A.、グリーングラス、J.、および \"ロスレスビデオの交通をめざして\" C. Filsfils、IEEEインターネットコンピューティング、巻。 15、第6号、PP。48-57、2011年11月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ali Begen Cisco 181 Bay Street Toronto, ON M5J 2T3 Canada",
      "ja": "M5J 2T3カナダONアリBegenのCisco 181ベイストリートトロント、"
    },
    {
      "indent": 3,
      "text": "EMail: abegen@cisco.com",
      "ja": "メールアドレス：abegen@cisco.com"
    },
    {
      "indent": 3,
      "text": "Colin Perkins University of Glasgow School of Computing Science Glasgow G12 8QQ UK",
      "ja": "コンピューティング科学グラスゴーG12 8QQ英国のグラスゴー大学のコリン・パーキンス大学"
    },
    {
      "indent": 3,
      "text": "EMail: csp@csperkins.org URI: http://csperkins.org/",
      "ja": "電子メール：csp@csperkins.org URI：http://csperkins.org/"
    }
  ]
}