{
  "title": {
    "text": "RFC 7956 - Transparent Interconnection of Lots of Links (TRILL) Distributed Layer 3 Gateway",
    "ja": "RFC 7956 - リンクの多くの透明な相互接続（TRILL）分散型レイヤ3ゲートウェイ"
  },
  "number": 7956,
  "created_at": "2019-11-02 16:24:05.218533+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                            W. Hao\nRequest for Comments: 7956                                         Y. Li\nCategory: Standards Track                                         Huawei\nISSN: 2070-1721                                                    A. Qu\n                                                                MediaTec\n                                                              M. Durrani\n                                                            Equinix Inc.\n                                                          P. Sivamurugan\n                                                             IP Infusion\n                                                          September 2016",
      "raw": true
    },
    {
      "indent": 10,
      "text": "Transparent Interconnection of Lots of Links (TRILL)\n            Distributed Layer 3 Gateway",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The base TRILL (Transparent Interconnection of Lots of Links) protocol provides optimal pair-wise data frame forwarding for Layer 2 intra-subnet traffic but not for Layer 3 inter-subnet traffic. A centralized gateway solution is typically used for Layer 3 inter-subnet traffic forwarding but has the following issues:",
      "ja": "基地TRILL（リンクの多くの透明相互接続）プロトコルは、レイヤ2イントラサブネットトラフィックのためではなく、レイヤ3サブネット間トラフィックの最適ペアワイズデータフレーム転送を提供します。集中型のゲートウェイソリューションは、典型的にはレイヤ3サブネット間トラフィック転送のために使用されるが、以下の問題を有しています。"
    },
    {
      "indent": 3,
      "text": "1. Sub-optimum forwarding paths for inter-subnet traffic.",
      "section_title": true,
      "ja": "サブネット間トラフィックの1サブ最適な転送パス。"
    },
    {
      "indent": 3,
      "text": "2. A centralized gateway that may need to support a very large number of gateway interfaces in a Data Center, one per tenant per Data Label used by that tenant, to provide interconnect functionality for all the Layer 2 Virtual Networks in a TRILL campus.",
      "ja": "2.、データセンターでそのテナントが使用するデータ・ラベルごとにテナントごとに1つのゲートウェイ・インタフェースの非常に大きな数をサポートするために、TRILLキャンパス内のすべてのレイヤ2つの仮想ネットワークの相互接続機能を提供する必要がある場合があり、集中型ゲートウェイ。"
    },
    {
      "indent": 3,
      "text": "3. A traffic bottleneck at the gateway.",
      "section_title": true,
      "ja": "3.ゲートウェイにおけるトラフィックのボトルネック。"
    },
    {
      "indent": 3,
      "text": "This document specifies an optional TRILL distributed gateway solution that resolves these centralized gateway issues.",
      "ja": "この文書では、これらの集中型のゲートウェイの問題を解決し、オプションのTRILL分散型ゲートウェイソリューションを指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7956.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7956で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Document Organization ......................................3\n2. Conventions Used in This Document ...............................4\n3. Simplified Example and Problem Statement ........................5\n   3.1. Simplified Example .........................................6\n   3.2. Problem Statement Summary ..................................8\n4. Layer 3 Traffic Forwarding Model ................................9\n5. Distributed Gateway Solution Details ...........................10\n   5.1. Local Routing Information .................................11\n   5.2. Local Routing Information Synchronization .................12\n   5.3. Active-Active Access ......................................14\n   5.4. Data Traffic Forwarding Process ...........................15\n6. Distributed Layer 3 Gateway Process Example ....................16\n   6.1. Control-Plane Process .....................................17\n   6.2. Data-Plane Process ........................................19\n7. TRILL Protocol Extensions ......................................20\n   7.1. The Tenant Label and Gateway MAC APPsub-TLV ...............20\n   7.2. The SE Flag in the NickFlags APPsub-TLV ...................21\n   7.3. The IPv4 Prefix APPsub-TLV ................................22\n   7.4. The IPv6 Prefix APPsub-TLV ................................23\n8. Security Considerations ........................................24\n9. Management Considerations ......................................24\n10. IANA Considerations ...........................................24\n11. References ....................................................25\n   11.1. Normative References .....................................25\n   11.2. Informative References ...................................26\nAcknowledgments ...................................................27\nAuthors' Addresses ................................................28",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The TRILL (Transparent Interconnection of Lots of Links) protocol [RFC6325] [RFC7780] provides a solution for least-cost transparent routing in multi-hop networks with arbitrary topologies and link technologies, using IS-IS [IS-IS] [RFC7176] link-state routing and a hop count. TRILL switches are sometimes called RBridges (Routing Bridges).",
      "ja": "TRILL（リンクの多くの透明相互接続）プロトコル[RFC6325]、[RFC7780]はIS-ISを使用して、任意のトポロジ及びリンク技術とマルチホップネットワークにおける最小コスト透明なルーティングのためのソリューションを提供する[IS-IS] [RFC7176]リンクステートルーティングとホップカウント。 TRILLスイッチが時々RBridges（ルーティングブリッジ）と呼ばれています。"
    },
    {
      "indent": 3,
      "text": "The base TRILL protocol provides optimal unicast forwarding for Layer 2 intra-subnet traffic but not for Layer 3 inter-subnet traffic, where \"subnet\" means a different IP address prefix and, typically, a different Data Label (VLAN or FGL (Fine-Grained Label)). This document specifies a TRILL-based distributed Layer 3 gateway solution that provides optimal unicast forwarding for Layer 3 inter-subnet traffic. With distributed gateway support, an edge RBridge provides routing based on the Layer 2 identity (address and Virtual Network (VN, i.e., Data Label)) among End Stations (ESs) that belong to the same subnet and also provides routing based on the Layer 3 identity among ESs that belong to different subnets of the same routing domain. An edge RBridge supporting this feature needs to provide routing instances and Layer 3 gateway interfaces for locally connected ESs. Such routing instances provide IP address isolation between tenants. In the TRILL distributed Layer 3 gateway solution, inter-subnet traffic can be fully spread over edge RBridges, so there is no single bottleneck.",
      "ja": "ベースTRILLプロトコルは、レイヤ2イントラサブネットトラフィックに最適なユニキャスト転送を提供しなく「サブネット」は、典型的には、異なるIPアドレスプレフィックスを意味し、レイヤ3サブネット間トラフィック、異なるデータ・ラベル（VLANまたはFGL（微用グレインラベル））。この文書は、レイヤ3サブネット間トラフィックのための最適なユニキャスト転送を提供TRILLベースの分散レイヤ3ゲートウェイ・ソリューションを特定します。分散型ゲートウェイのサポートにより、エッジRBridgeは、同じサブネットに属しているエンドステーション（ESS）の間で、レイヤ2のアイデンティティ（アドレスと仮想ネットワーク（VN、すなわち、データラベル））に基づいてルーティングを提供し、また、レイヤに基づいてルーティングを提供します同じルーティングドメインの異なるサブネットに属しているのESの間で3アイデンティティ。この機能をサポートしているエッジRBridgeは、ルーティングインスタンスとローカルに接続されたESのレイヤ3ゲートウェイインターフェイスを提供する必要があります。そのようなルーティングインスタンスは、テナント間のIPアドレスの隔離を提供します。 TRILL分散レイヤ3ゲートウェイ溶液に、サブネット間トラフィックは完全にエッジRBridgesに広がることができるので、単一のボトルネックが存在しません。"
    },
    {
      "indent": 0,
      "text": "1.1. Document Organization",
      "section_title": true,
      "ja": "1.1. マニュアルの構成"
    },
    {
      "indent": 3,
      "text": "This document is organized as follows: Section 3 gives a simplified example and also a more detailed problem statement. Section 4 gives the Layer 3 traffic forwarding model. Section 5 provides a distributed gateway solution overview. Section 6 gives a detailed distributed gateway solution example. Section 7 describes the TRILL protocol extensions needed to support this distributed gateway solution.",
      "ja": "次のようにこの文書では、構成されています。第3節ではまた、簡略化した例や、より詳細な問題文を与えます。第4章では、レイヤ3トラフィック転送モデルを提供します。セクション5は、分散ゲートウェイソリューションの概要を提供します。セクション6は、詳細な分散ゲートウェイソリューション例を示します。第7節では、この分散型ゲートウェイ・ソリューションをサポートするために必要なTRILLプロトコル拡張機能について説明します。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "The terms and acronyms in [RFC6325] are used, with the following additions:",
      "ja": "[RFC6325]での用語及び頭字語は、以下の追加で、使用されています。"
    },
    {
      "indent": 3,
      "text": "AGG: Aggregation switch.",
      "ja": "AGG：アグリゲーションスイッチ。"
    },
    {
      "indent": 3,
      "text": "ARP: Address Resolution Protocol [RFC826].",
      "ja": "ARP：アドレス解決プロトコル[RFC826]。"
    },
    {
      "indent": 3,
      "text": "Campus: The name for a network using the TRILL protocol in the same sense that a \"bridged LAN\" is the name for a network using bridging. In TRILL, the word \"campus\" has no academic implication.",
      "ja": "キャンパス：「LANをブリッジ」と同じ意味でTRILLプロトコルを使用して、ネットワークの名前は、ブリッジングを使用して、ネットワークの名前です。 TRILLでは、単語「キャンパス」には学術的な意味合いを持っていません。"
    },
    {
      "indent": 3,
      "text": "COR: Core switch.",
      "ja": "COR：コアスイッチ。"
    },
    {
      "indent": 3,
      "text": "Data Label: VLAN or FGL [RFC7172].",
      "ja": "データレーベル：FGL VLANまたは[RFC7172]。"
    },
    {
      "indent": 3,
      "text": "DC: Data Center.",
      "ja": "DC：データセンター。"
    },
    {
      "indent": 3,
      "text": "Edge RBridge: An RBridge that connects to one or more ESs without any intervening RBridges.",
      "ja": "エッジRBridge：介在RBridgesせずに、1個のまたは複数のESに接続RBridge。"
    },
    {
      "indent": 3,
      "text": "ES: End Station. A Virtual Machine or physical server, whose address is either the destination or source of a data frame.",
      "ja": "ES：エンドステーション。そのアドレスが仮想マシンまたは物理サーバは、送信先またはデータフレームのソースのいずれかです。"
    },
    {
      "indent": 3,
      "text": "FGL: Fine-Grained Label [RFC7172].",
      "ja": "FGL：ファイングレイン・ラベル[RFC7172]。"
    },
    {
      "indent": 3,
      "text": "Gateway interface: A Layer 3 virtual interface that terminates Layer 2 forwarding and forwards IP traffic to the destination using IP forwarding rules. Incoming traffic from a physical port on a gateway will be distributed to its virtual gateway interface based on the Data Label (VLAN or FGL).",
      "ja": "ゲートウェイインターフェイス：レイヤIP転送ルールを使用して宛先に転送2フォワーディングおよびIPトラフィックを終了し、レイヤ3仮想インターフェイス。ゲートウェイの物理ポートからの着信トラフィックは、データラベル（VLANまたはFGL）に基づいて、仮想ゲートウェイインターフェイスに配布されます。"
    },
    {
      "indent": 3,
      "text": "Inner.MacDA: The inner MAC destination address in a TRILL Data packet [RFC6325].",
      "ja": "Inner.MacDA：TRILLデータパケット内の内側のMAC宛先アドレス[RFC6325]。"
    },
    {
      "indent": 3,
      "text": "Inner.MacSA: The inner MAC source address in a TRILL Data packet [RFC6325].",
      "ja": "Inner.MacSA：TRILLデータパケット内の内部MAC送信元アドレス[RFC6325]。"
    },
    {
      "indent": 3,
      "text": "Inner.VLAN: The inner VLAN tag in a TRILL Data packet payload [RFC6325].",
      "ja": "Inner.VLAN：TRILLデータパケットペイロードにおける内側VLANタグ[RFC6325]。"
    },
    {
      "indent": 3,
      "text": "L2: Layer 2.",
      "ja": "番号：リア。"
    },
    {
      "indent": 3,
      "text": "L3: IP Layer 3.",
      "ja": "L3：IPレイヤ3。"
    },
    {
      "indent": 3,
      "text": "LSP: Link State PDU",
      "ja": "LSP：リンク状態PDU"
    },
    {
      "indent": 3,
      "text": "ND: IPv6's Neighbor Discovery [RFC4861].",
      "ja": "ND：IPv6の近隣探索の[RFC4861]。"
    },
    {
      "indent": 3,
      "text": "ToR: Top of Rack.",
      "ja": "ToR：ラックのトップへ。"
    },
    {
      "indent": 3,
      "text": "VN: Virtual Network. In a TRILL campus, a unique 12-bit VLAN ID or a 24-bit FGL [RFC7172] identifies each VN.",
      "ja": "VN：仮想ネットワーク。 TRILLキャンパスにおいて、ユニークな12ビットのVLAN IDまたは24ビットFGL [RFC7172]はそれぞれVNを識別する。"
    },
    {
      "indent": 3,
      "text": "VRF: Virtual Routing and Forwarding. In IP-based computer networks, VRF technology supports multiple instances of routing tables existing within the same router at the same time.",
      "ja": "VRF：仮想ルーティングおよびフォワーディング。 IPベースのコンピュータネットワークでは、VRF技術が同時に同じルータ内に存在するルーティングテーブルの複数のインスタンスをサポートしています。"
    },
    {
      "indent": 0,
      "text": "3. Simplified Example and Problem Statement",
      "section_title": true,
      "ja": "3.簡単な例と問題文"
    },
    {
      "indent": 3,
      "text": "There is normally a Data Label (VLAN or FGL) associated with each IP subnet. For traffic within a subnet -- that is, IP traffic to another ES in the same Data Label attached to the TRILL campus -- the ES just ARPs for the MAC address of the destination ES's IP. It then uses this MAC address for traffic to that destination. TRILL routes the ingressed TRILL Data packets to the destination's edge RBridge based on the egress nickname for that destination MAC address and Data Label. This is the regular TRILL base protocol [RFC6325] process.",
      "ja": "各IPサブネットに関連付けられているデータ・ラベル（VLANまたはFGL）は、通常あります。サブネット内のトラフィックのために - つまり、TRILLのキャンパスに添付同じデータ・ラベル内の別ESへのIPトラフィック - 先ESのIPのMACアドレスのESだけのARP。その後、その宛先へのトラフィックのために、このMACアドレスを使用しています。 TRILLルートその宛先MACアドレスとデータ・ラベルのための出口ニックネームに基づいて、宛先のエッジRBridgeにingressed TRILLデータパケット。これは、通常のTRILLベースプロトコル[RFC6325]プロセスです。"
    },
    {
      "indent": 3,
      "text": "If two ESs of the same tenant are on different subnets and need to communicate with each other, their packets are typically forwarded to an IP L3 gateway that performs L3 routing and, if necessary, changes the Data Label. Either a centralized L3 gateway solution or the distributed L3 gateway solution specified in this document can be used for inter-subnet traffic forwarding.",
      "ja": "同じテナント二ESSは異なるサブネット上にあり、互いに通信する必要がある場合、そのパケットは、典型的には、必要に応じて、データラベルを変更し、L3ルーティングを実行し、IP L3ゲートウェイに転送されます。集中L3ゲートウェイ溶液又は本書で指定された分散L3ゲートウェイ溶液のいずれかは、サブネット間トラフィック転送のために使用することができます。"
    },
    {
      "indent": 3,
      "text": "Section 3.1 gives a simplified example in a TRILL campus with and without a distributed L3 gateway using VLAN Data Labels. Section 3.2 gives a detailed description of the issues related to using a centralized gateway (i.e., without a distributed L3 gateway). The remainder of this document, particularly Section 5, describes the distributed gateway solution in detail.",
      "ja": "セクション3.1とし、VLANデータラベルを使用して分散L3ゲートウェイなしTRILLキャンパスに簡単な例を与えます。セクション3.2（即ち、分散L3ゲートウェイなし）集中型のゲートウェイを使用することに関連する問題の詳細な説明を与えます。この文書の残りの部分、特に第5章は、詳細に分散ゲートウェイソリューションを記述する。"
    },
    {
      "indent": 0,
      "text": "3.1. Simplified Example",
      "section_title": true,
      "ja": "3.1. 簡単な例"
    },
    {
      "indent": 3,
      "text": "Figure 1 depicts a TRILL DC network, where ToR switches are edge RBridges and the AGGs and CORs are non-edge RBridges.",
      "ja": "図1のToRスイッチがエッジRBridgesあり、AGGsとCORSは非エッジRBridgesあるTRILL DCネットワークを示しています。"
    },
    {
      "indent": 6,
      "text": "               -------                --------\n               | COR1|                | COR2 |\n               -------                --------\n                  |                      |\n               -------                -------\n               |AGG1 |                |AGG2 |\n               -------                -------\n                  |                      |\n    -----------------------------------------------------\n    |  -------------|------------------|----------------|\n    |  |            |  |               |  |          |  |\n  -------          -------           -------        -------\n  | RB1 |          | RB2 |           | RB3 |        | RB4 |\n  |ToR1 |          |ToR2 |           |ToR3 |        |ToR4 |\n  -------          -------           -------        -------\n   |    |           |    |            |    |         |    |\n-----  -----     -----  -----      -----  -----   -----  -----\n|ES1|  |ES2|     |ES3|  |ES4|      |ES5|  |ES6|   |ES7|  |ES8|\n-----  -----     -----  -----      -----  -----   -----  -----",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 1: A Typical TRILL DC Network",
      "ja": "図1：一般的なTRILL DCネットワーク"
    },
    {
      "indent": 3,
      "text": "ES1 through ES8 belong to one tenant network, and the tenant has four subnets with each subnet corresponding to one VLAN (which indicates one individual L2 VN). Each ES's IP address, VLAN, and subnet are listed below:",
      "ja": "ES8スルーES1は、一つのテナントネットワークに属し、そしてテナントは（一人の個人L2 VNを示す）1つのVLANに対応する各サブネットを持つ4つのサブネットを有しています。各ESのIPアドレス、VLAN、およびサブネットは以下のとおりです。"
    },
    {
      "indent": 11,
      "text": "+----+----------------+-----------------+----------+\n| ES |   IP Address   |    Subnet       |  VLAN    |\n+----+----------------+-----------------+----------+\n| ES1| 192.0.2.2      | 192.0.2.0/24    |   10     |\n+----+----------------+-----------------+----------+\n| ES2| 198.51.100.2   | 198.51.100.0/24 |   11     |\n+----+----------------+-----------------+----------+\n| ES3| 192.0.2.3      | 192.0.2.0/24    |   10     |\n+----+----------------+-----------------+----------+\n| ES4| 198.51.100.3   | 198.51.100.0/24 |   11     |\n+----+----------------+-----------------+----------+\n| ES5| 203.0.113.2    | 203.0.113.0/25  |   12     |\n+----+----------------+-----------------+----------+\n| ES6| 203.0.113.130  | 203.0.113.128/25|   13     |\n+----+----------------+-----------------+----------+\n| ES7| 203.0.113.3    | 203.0.113.0/25  |   12     |\n+----+----------------+-----------------+----------+\n| ES8| 203.0.113.131  | 203.0.113.128/25|   13     |\n+----+----------------+-----------------+----------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Assume that a centralized gateway solution is used with both COR1 and COR2 acting as centralized gateways for redundancy in Figure 1. COR1 and COR2 each have four gateway interfaces for the four subnets in the tenant. In the centralized L3 gateway solution, all traffic within the tenant between different VLANs must go through the centralized L3 gateway device of COR1 or COR2, even if the traffic is between two ESs connected to the same edge RBridge, because only the L3 gateway can change the VLAN labeling of the traffic.",
      "ja": "集中型のゲートウェイ溶液がCOR1及びCOR2の両方がCOR1及びCOR2各テナントの4つのサブネットのための4つのゲートウェイインターフェースを有する図1の冗長性として集中ゲートウェイを作用と共に使用されると仮定する。のみL3ゲートウェイを変更することができるので、集中L3ゲートウェイ溶液中で、異なるVLAN間のテナント内のすべてのトラフィックは、トラフィックが同じエッジRBridgeに接続された2個のESとの間であっても、COR1又はCOR2の集中L3ゲートウェイ装置を経由しなければなりませんトラフィックのVLANラベル。"
    },
    {
      "indent": 3,
      "text": "This is generally sub-optimal because the two ESs may be connected to the same ToR where L3 switching could have been performed locally. For example, in Figure 1 above, the unicast IP traffic between ES1 and ES2 has to go through a centralized gateway of COR1 or COR2. It can't be locally routed between them on ToR1. However, if an edge RBridge has the distributed gateway capabilities specified in this document, then it can still perform optimum L2 forwarding for intra-subnet traffic and, in addition, optimum L3 forwarding for inter-subnet traffic, thus delivering optimum forwarding for unicast packets in all important cases.",
      "ja": "2つのESSはL3スイッチングが局所的に行われている可能性があり、同一のToRに接続することができるので、これは、一般的に準最適です。例えば、上記図1に、ES1及びES2の間のユニキャストIPトラフィックは、COR1又はCOR2の集中ゲートウェイを通過しなければなりません。これは、ローカルTOR1にそれらの間でルーティングすることはできません。エッジRBridgeこの文書で指定された分散ゲートウェイ機能を有している場合は、それはまだ他に、イントラサブネットトラフィックに最適なL2転送を行うことができ、サブネット間トラフィックの最適L3転送は、このようにユニキャストパケットのための最適な転送を提供しますすべての重要な例インチ"
    },
    {
      "indent": 3,
      "text": "With a distributed L3 gateway, each edge RBridge acts as a default L3 gateway for local connecting ESs and has IP router capabilities to direct IP communications to other edge RBridges. Each edge RBridge only needs gateway interfaces for local connecting ESs, i.e., RB1 and RB2 need gateway interfaces only for VLAN 10 and VLAN 11 while RB3 and RB4 need gateway interfaces only for VLAN 12 and VLAN 13. No device needs to maintain gateway interfaces for all VLANs in the entire network. This will enhance scalability in terms of the number of tenants and subnets per tenant.",
      "ja": "分散L3ゲートウェイと、各エッジRBridgeは、ローカル接続のESのデフォルトL3ゲートウェイとして機能し、他のエッジRBridgesにIP通信を指示するためにIPルータ機能を有しています。 RB3及びRB4のみVLAN 12とVLANなしデバイスがために、ゲートウェイインターフェイスを維持する必要がない13のゲートウェイインターフェイスを必要としながら、各エッジRBridgeは、ローカル接続のES、すなわち、RB1とRB2のためのゲートウェイ・インタフェースを必要とのみVLAN 10およびVLAN 11のゲートウェイインターフェイスを必要としますネットワーク全体ですべてのVLAN。これは、テナントごとにテナントとサブネットの数の面でスケーラビリティを向上させます。"
    },
    {
      "indent": 3,
      "text": "When each ES ARPs for its L3 gateway, that is, its IP router, the edge RBridge to which it is connected will respond with that RBridge's \"gateway MAC\". When the ES later sends IP traffic to the L3 gateway, which it does if the destination IP is outside of its subnet, the edge RBridge intercepts the IP packet because the destination MAC is its gateway MAC. That RBridge routes the IP packet using the routing instance associated with that tenant, handling it in one of three ways:",
      "ja": "各々がそのL3ゲートウェイのARPをES場合、すなわち、そのIPルータであり、それが接続されているエッジRBridgeは、RBridgeの「ゲートウェイMAC」で応答します。 ESは、後で宛先IPは、外部サブネットのであればそれがないL3ゲートウェイにIPトラフィックを送信する際、宛先MACがゲートウェイMACであるため、エッジRBridgeは、IPパケットをインターセプト。そのRBridgeルートの3つの方法のいずれかでそれを処理し、そのテナントに関連付けられたルーティングインスタンスを使用してIPパケット："
    },
    {
      "indent": 3,
      "text": "(1) ES1 communicates with ES2. The destination IP is connected to the same edge RBridge; the RBridge of ToR1 can simply transmit the IP packet out the right edge port in the destination VLAN.",
      "ja": "（1）ES1はES2と通信します。宛先IPは、同じエッジRBridgeに接続されています。 TOR1のRBridgeは、単純に、宛先VLANに右エッジポートからIPパケットを送信することができます。"
    },
    {
      "indent": 3,
      "text": "(2) If the destination IP is located in an outside network, the edge RBridge encapsulates it as a TRILL Data packet and sends it to the actual TRILL campus edge RBridge connecting to an external IP router.",
      "ja": "宛先IPが外部ネットワークに位置している場合（2）、エッジRBridgeは、TRILLデータパケットとしてカプセル化し、外部のIPルータに接続する実際のTRILLキャンパスエッジRBridgeに送信します。"
    },
    {
      "indent": 3,
      "text": "(3) ES1 communicates with ES4. The destination ES is connected to a different edge RBridge; the ingress RBridge ToR1 uses TRILL encapsulation to route the IP packet to the correct egress RBridge ToR2, using the egress RBridge's gateway MAC and an Inner.VLAN identifying the tenant. Finally, the egress RBridge terminates the TRILL encapsulation and routes the IP packet to the destination ES based on the routing instance for that tenant.",
      "ja": "（3）ES1はES4と通信します。先ESは、異なるエッジRBridgeに接続されています。入口RBridge TOR1は出口RBridgeのゲートウェイMACとテナントを識別するInner.VLANを使用して、正しい出力RBridge TOR2にルーティングするIPパケットをTRILLカプセル化を使用します。最後に、出口RBridgeはTRILLカプセル化及びルートそのテナントのルーティングインスタンスに基づいて、宛先ESにIPパケットを終了します。"
    },
    {
      "indent": 0,
      "text": "3.2. Problem Statement Summary",
      "section_title": true,
      "ja": "3.2. 問題文の概要"
    },
    {
      "indent": 3,
      "text": "With FGL [RFC7172], in theory, up to 16 million L2 VNs can be supported in a TRILL campus. To support inter-subnet traffic, a very large number of L3 gateway interfaces could be needed on a centralized gateway, if each VN corresponds to a subnet and there are many tenants with many subnets per tenant. It is a big burden for the centralized gateway to support so many interfaces. In addition, all inter-subnet traffic will go through a centralized gateway that may become a traffic bottleneck.",
      "ja": "FGL [RFC7172]を使用すると、理論的には、最大1600万のL2のVNは、TRILLのキャンパスでサポートすることができます。各VNサブネットに対応し、テナントごとに多くのサブネットを持つ多くのテナントがある場合サブネット間トラフィックをサポートするために、L3ゲートウェイインターフェースの非常に大きな数は、集中型のゲートウェイに必要とされ得ます。これは、非常に多くのインターフェースをサポートするための集中ゲートウェイにとって大きな負担となっています。また、すべてのサブネット間のトラフィックは、トラフィックのボトルネックになることがあり、集中型ゲートウェイを通過します。"
    },
    {
      "indent": 3,
      "text": "The centralized gateway has the following issues:",
      "ja": "集中型のゲートウェイには、次の問題があります。"
    },
    {
      "indent": 3,
      "text": "1. Sub-optimum forwarding paths for inter-subnet traffic can occur due to the requirements to perform IP routing and possibly change Data Labels at a centralized gateway.",
      "ja": "サブネット間トラフィックの1サブ最適な転送パスは、IPルーティングを実行し、おそらく集中ゲートウェイでデータラベルを変更することにより、要求に発生する可能性があります。"
    },
    {
      "indent": 3,
      "text": "2. The centralized gateway may need to support a very large number of gateway interfaces -- in a DC, one per tenant per Data Label used by that tenant -- to provide interconnect functionality for all the L2 VNs in the TRILL campus.",
      "ja": "2.集中ゲートウェイは、ゲートウェイインターフェイスの非常に大きな数をサポートする必要があるかもしれません -  DC、そのテナントによって使用されるデータラベルごとテナントごとに一つに -  TRILLキャンパス内のすべてのL2のVNのための相互接続機能を提供します。"
    },
    {
      "indent": 3,
      "text": "3. There may be a traffic bottleneck at the centralized gateway.",
      "section_title": true,
      "ja": "3.集中型のゲートウェイにトラフィックのボトルネックがあるかもしれません。"
    },
    {
      "indent": 3,
      "text": "A distributed gateway on edge RBridges addresses these issues. Through the distributed L3 gateway solution, the inter-subnet traffic is fully dispersed and is transmitted along optimal pair-wise forwarding paths, improving network efficiency.",
      "ja": "エッジRBridgesに分散ゲートウェイは、これらの問題に対処します。分散L3ゲートウェイ溶液を介して、サブネット間トラフィックが完全に分散され、ネットワーク効率を改善、最適ペアワイズ転送パスに沿って送信されます。"
    },
    {
      "indent": 0,
      "text": "4. Layer 3 Traffic Forwarding Model",
      "section_title": true,
      "ja": "4.レイヤ3トラフィック転送モデル"
    },
    {
      "indent": 3,
      "text": "In a DC network, each tenant has one or more L2 VNs, and, in normal cases, each tenant corresponds to one routing domain. Normally, each L2 VN uses a different Data Label and corresponds to one or more IP subnets.",
      "ja": "DCネットワークでは、各テナントは、一つ以上のL2のVNを有し、そして、通常の場合には、各テナントは、一つのルーティングドメインに対応します。通常、各L2 VNは、異なるデータ・ラベルを使用し、1つまたは複数のIPサブネットに対応します。"
    },
    {
      "indent": 3,
      "text": "Each L2 VN in a TRILL campus is identified by a unique 12-bit VLAN ID or 24-bit FGL [RFC7172]. Different routing domains may have overlapping address space but need distinct and separate routes. The ESs that belong to the same subnet communicate through L2 forwarding; ESs of the same tenant that belong to different subnets communicate through L3 routing.",
      "ja": "TRILLキャンパス内の各L2 VNは、一意の12ビットのVLAN IDまたは24ビットFGL [RFC7172]によって識別されます。異なるルーティングドメインは、重複アドレス空間を持っていますが、異なる別個のルートが必要な場合があります。同じサブネットに属しているのESは、L2転送を介して通信します。異なるサブネットに属する同じテナントのESがL3ルーティングを介して通信します。"
    },
    {
      "indent": 3,
      "text": "Figure 2 depicts the model where there are n VRFs corresponding to n tenants, with each tenant having up to m segments/subnets (VNs).",
      "ja": "図2は、各テナントは、m個のセグメント/サブネット（のVN）までを有すると共に、Nテナントに対応するn個のVRFが存在するモデルを示します。"
    },
    {
      "indent": 14,
      "text": "+---------------------------------------------+\n|                                             |\n|      +-----------+         +-----------+    |\n|      | Tenant n  |---------|  VRF n    |    |\n|   +------------+ |     +------------+  |    |\n|   |  +-----+   | |     |            |  |    |\n|   |  | VN1 |   | |     |            |  |    |\n|   |  +-----+   | |     |    VRF 1   |  |    |\n|   |     ..     +-------+            |  |    |\n|   |  +-----+   | |     |            |  |    |\n|   |  | VNm |   | |     |            |  |    |\n|   |  +-----+   | |     |            |  |    |\n|   |  Tenant1   |-+     |            |  |    |\n|   +------------+       |            |  |    |\n|   +------------+       +------------+       |\n|                                             |\n|               Edge RBridge                  |\n+---------------------------------------------+",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Figure 2: Edge RBridge Model as Distributed Gateway",
      "ja": "図2：分散型ゲートウェイとしてエッジRBridgeモデル"
    },
    {
      "indent": 0,
      "text": "5. Distributed Gateway Solution Details",
      "section_title": true,
      "ja": "5.分散型ゲートウェイソリューションの詳細"
    },
    {
      "indent": 3,
      "text": "With the TRILL distributed gateway solution, an edge RBridge continues to perform routing based on the L2 MAC address for the ESs that are on the same subnet but performs IP routing for the ESs that are on the different subnets of the same tenant.",
      "ja": "TRILL分散ゲートウェイ溶液で、エッジRBridgeは同じサブネット上にあるが、同じテナントの異なるサブネット上にあるのESのためのIPルーティングを実行するためのES L2 MACアドレスに基づいてルーティングを実行し続けます。"
    },
    {
      "indent": 3,
      "text": "As the IP address space in different routing domains can overlap, VRF instances need to be created on each edge RBridge to isolate the IP forwarding process for different routing domains present on the edge RBridge. A Tenant ID unique across the TRILL campus identifies each routing domain. The network operator MUST configure the Tenant IDs on each edge RBridge for each routing domain consistently so that the same ID always refers to the same tenant. Otherwise, data might be delivered to the wrong tenant. If a routing domain spreads over multiple edge RBridges, routing information for the routing domain is synchronized among these edge RBridges through the link-state database to ensure reachability to all ESs in that routing domain. The routing information is, in effect, labeled with the Tenant ID to differentiate the routing domains.",
      "ja": "異なるルーティングドメイン内のIPアドレス空間が重複することができるように、VRFインスタンスは、エッジRBridge上に存在する異なるルーティングドメインのIP転送処理を分離するために各エッジRBridgeに作成する必要があります。 TRILLキャンパス全体でユニークなテナントIDは、各ルーティングドメインを識別します。同じIDが常に同じテナントを参照するように、ネットワークオペレータは、一貫して、各ルーティングドメインの各エッジRBridgeにテナントIDを設定する必要があります。そうしないと、データが間違ったテナントに配信されることがあります。ルーティングドメインに複数のエッジRBridgesにわたって広がる場合、ルーティング・ドメインのルーティング情報は、ルーティングドメイン内の全てのESへの到達可能性を保証するために、リンクステートデータベースを介してこれらのエッジRBridges間で同期されます。ルーティング情報は、実際には、ルーティングドメインを区別するためにテナントIDで標識されています。"
    },
    {
      "indent": 3,
      "text": "From the data-plane perspective, all edge RBridges are connected to each other via one or more TRILL hops; however, they are always just a single IP hop away. When an ingress RBridge receives inter-subnet",
      "ja": "データプレーンの観点から、すべてのエッジRBridgesは、一つ以上のTRILLホップを介して相互に接続されています。しかし、彼らは、単一のIPホップ離れて常にあります。入口RBridgeは、サブネット間を受信した場合"
    },
    {
      "indent": 3,
      "text": "IP traffic from a local ES whose destination MAC is the edge RBridge's gateway MAC, that RBridge will perform Ethernet header termination. The tenant involved is determined by the VLAN of the traffic and the port on which it arrives. The edge RBridge looks up in its IP routing table for that tenant how to route the traffic to the IP next hop. If the destination ES is connected to a remote edge RBridge, the remote RBridge will be the IP next hop for traffic forwarding. For such inter-subnet traffic, the ingress RBridge will rewrite the original Ethernet header with the ingress RBridge's gateway MAC address as the Inner.MacSA and the egress RBridge's gateway MAC address as the Inner.MacDA and then perform TRILL encapsulation to the remote RBridge's nickname, setting the inner Data Label to indicate the tenant involved. TRILL then routes it to the remote edge RBridge through the TRILL campus.",
      "ja": "宛先MACローカルESからIPトラフィックはRBridgeは、イーサネットヘッダ終端を実行することは、エッジRBridgeのゲートウェイMACです。関連するテナントは、トラフィックのVLANと、それが到着するポートによって決定されます。どのようにIPネクストホップへのトラフィックをルーティングするエッジRBridgeは、そのテナントのためにそのIPルーティングテーブルに検索します。先ESがリモートエッジRBridgeに接続されている場合、リモートRBridgeはトラフィックの転送のためにIPネクストホップであろう。そのようなサブネット間トラフィックの場合、入口RBridgeはInner.MacDAとしてInner.MacSAと出口RBridgeのゲートウェイMACアドレスとして入力RBridgeのゲートウェイのMACアドレスを持つ元のイーサネットヘッダをリライトし、その後リモートRBridgeのニックネームにTRILLカプセル化を行います、関与テナントを示すために内部データ・ラベルを設定します。 TRILLキャンパスを介してリモートエッジRBridgeへのルートにそれをトリル。"
    },
    {
      "indent": 3,
      "text": "When that remote edge RBridge receives the traffic, it will decapsulate the TRILL Data packet and see that the inner destination MAC is its gateway MAC. It then terminates the inner Ethernet encapsulation and looks up the destination IP in the RBridge's IP forwarding table for the tenant indicated by the inner Data Label, to route it to the destination ES.",
      "ja": "そのリモートエッジRBridgeがトラフィックを受信すると、TRILLデータパケットをデカプセル化し、内部宛先MACがゲートウェイMACであることがわかります。その後、内側のイーサネットカプセル化を終了し、目的地までのルートESそれが、内部データ・ラベルで示さテナントのためのRBridgeのIPフォワーディングテーブルに宛先IPを検索します。"
    },
    {
      "indent": 3,
      "text": "Through this method, TRILL with distributed gateways provides optimum pair-wise data routing for inter-subnet traffic.",
      "ja": "この方法により、分散ゲートウェイとTRILLは、サブネット間トラフィックの最適ペアワイズデータルーティングを提供します。"
    },
    {
      "indent": 0,
      "text": "5.1. Local Routing Information",
      "section_title": true,
      "ja": "5.1. ローカルルーティング情報"
    },
    {
      "indent": 3,
      "text": "An ES can be locally connected to an edge RBridge through an L2 network (such as a point-to-point Ethernet link or a bridged LAN) or externally connected through an L3 IP network.",
      "ja": "ESは、ローカルL3 IPネットワークを介して接続されたまたは外部（例えば、ポイントツーポイントイーサネットリンクまたはブリッジLANなど）L2ネットワークを介してエッジRBridgeに接続することができます。"
    },
    {
      "indent": 3,
      "text": "If the ES is connected to an edge RBridge through an L2 network, then the edge RBridge acts as an L3 gateway for the ES. A gateway interface is established on the edge RBridge for the connecting ES. Because the ESs in a subnet may be spread over multiple edge RBridges, each such edge RBridge that establishes its gateway interface for the subnet SHOULD share the same gateway MAC and gateway IP address configuration. Sharing the configuration and insuring configuration consistency can be done by local configuration and Network Configuration Protocol (NETCONF) / YANG models.",
      "ja": "ESは、L2ネットワークを介してエッジRBridgeに接続されている場合、エッジRBridgeはESのL3ゲートウェイとして働きます。ゲートウェイインターフェースは、接続ESに対するエッジRBridgeに確立されます。サブネット内のESSは、複数のエッジRBridgesに広がることができるので、サブネットのそのゲートウェイインターフェイスを確立するような各エッジRBridgeは、同じゲートウェイMACおよびゲートウェイIPアドレスの設定を共有する必要があります。設定の整合性を設定を共有し、保証することは、ローカル設定とネットワーク設定プロトコル（NETCONF）/ YANGモデルによって行うことができます。"
    },
    {
      "indent": 3,
      "text": "With a distributed gateway, the edge RBridge to which an ES is connected appears to be the local IP router on its link. As in any IP network, before the ES starts to send inter-subnet traffic, it acquires its gateway's MAC through the ARP/ND process. Local connecting edge RBridges that support this distributed gateway feature always respond with the gateway MAC address when receiving ARP/ND requests for the gateway IP. Through the ARP/ND process, the edge RBridge can learn the IP and MAC correspondence of a local ES connected to the edge RBridge by L2 and then generate local IP routing entries for that ES in the corresponding routing domain.",
      "ja": "分散ゲートウェイと、ESが接続されたエッジRBridgeは、そのリンク上のローカルIPルータであるように見えます。 ESは、サブネット間のトラフィックの送信を開始する前に、任意のIPネットワークのように、それはARP / NDプロセスを通じて、ゲートウェイのMACを取得します。ゲートウェイIPのARP / ND要求を受信したときに、この分散型ゲートウェイ機能をサポートしてローカル接続するエッジRBridgesは常にゲートウェイのMACアドレスで応答します。 ARP / NDプロセスを介して、エッジRBridgeは、L2によってエッジRBridgeに接続されたローカルESのIP及びMAC対応を学習し、その対応するルーティングドメイン内のESのローカルIPルーティングエントリを生成することができます。"
    },
    {
      "indent": 3,
      "text": "To TRILL, an IP router connected to an edge RBridge looks like an ES. If a router/ES is located in an external IP network, it normally provides access to one or more IP prefixes. The router/ES SHOULD run an IP routing protocol with the connecting TRILL edge RBridge. The edge RBridge will learn the IP prefixes behind the router/ES through that IP routing protocol, and the RBridge will then generate local IP routing entries in the corresponding routing domain. If such a routing protocol is not run with the edge RBridge, then only the IP prefixes behind the router/ES that are explicitly configured on the edge RBridge will be accessible.",
      "ja": "TRILLに、エッジRBridgeに接続されたIPルータは、ESのように見えます。ルータ/ ESは、外部IPネットワーク内に配置されている場合、それは通常、1つ以上のIPプレフィックスへのアクセスを提供します。ルータ/ ESは、接続TRILL縁RBridgeとIPルーティングプロトコルを実行する必要があります。エッジRBridgeは、IPルーティング・プロトコルを介してルータ/ ESの背後にIPプレフィクスを学習し、RBridgeは、対応するルーティングドメイン内のローカルIPルーティングエントリを生成します。そのようなルーティングプロトコルは、エッジRBridgeで実行されていない場合は、明示的にエッジRBridge上に設定されているルータ/ ESの背後にあるIPプレフィックスのみがアクセスできるようになります。"
    },
    {
      "indent": 0,
      "text": "5.2. Local Routing Information Synchronization",
      "section_title": true,
      "ja": "5.2. ローカルルーティング情報の同期"
    },
    {
      "indent": 3,
      "text": "When a routing instance is created on an edge RBridge, the Tenant ID, tenant Data Label (VLAN or FGL), and tenant gateway MAC that correspond to that instance are configured and MUST be globally advertised (see Section 7.1). The Tenant ID uniquely identifies that tenant throughout the campus. The tenant Data Label identifies that tenant at the edge RBridge. The tenant gateway MAC MAY identify that tenant, all tenants, or some subset of tenants at the edge RBridge.",
      "ja": "ルーティングインスタンスがRBridge、テナントIDは、そのインスタンスに対応するテナントデータラベル（VLANまたはFGL）、及びテナントゲートウェイMACが設定されているエッジ上に作成され、グローバルにアドバタイズする必要がある場合（7.1節を参照）。テナントIDは一意にキャンパスを通じてそのテナントを識別する。テナントのデータ・ラベルは、エッジRBridgeでそのテナントを識別します。テナントゲートウェイMACは、テナント、すべてのテナント、またはエッジRBridgeでテナントのいくつかのサブセットを識別することができます。"
    },
    {
      "indent": 3,
      "text": "When an ingress RBridge performs inter-subnet traffic TRILL encapsulation, the ingress RBridge uses the Data Label advertised by the egress RBridge as the inner VLAN or FGL and uses the tenant gateway MAC advertised by the egress RBridge as the Inner.MacDA. The egress RBridge relies on this tenant Data Label to find the local VRF instance for the IP forwarding process when receiving inter-subnet traffic from the TRILL campus. (The role of the tenant Data Label is akin to an MPLS VPN Label in an MPLS IP / MPLS VPN network.) Tenant Data Labels are independently allocated on each edge RBridge for each routing domain. An edge RBridge can use an access Data Label from a routing domain to act as the inter-subnet Data Label, or the edge RBridge can use a Data Label different from any access Data Labels to be a tenant Data Label. It is implementation dependent, and there is no restriction on this assignment of Data Labels.",
      "ja": "入口RBridgeがサブネット間トラフィックTRILLカプセル化を行う場合、入口RBridgeは、内側VLANまたはFGLとして出口RBridgeによってアドバタイズデータラベルを使用しInner.MacDAとして出力RBridgeによってアドバタイズテナントゲートウェイMACを使用します。出口RBridgeは、TRILLキャンパスからサブネット間のトラフィックを受信したときにIP転送処理のためのローカルVRFインスタンスを見つけるために、このテナントのデータ・ラベルに依存しています。 （テナントデータラベルの役割は、MPLS、IP / MPLS VPNネットワーク内のMPLS VPNラベルに似ている。）テナントデータラベルは、それぞれ独立して、ルーティングドメインの各エッジRBridgeに割り当てられています。エッジRBridgeは、サブネット間のデータラベルとして作用するルーティングドメインからのアクセスデータラベルを使用することができ、又はエッジRBridgeは、テナントデータラベルであることが任意のアクセスデータラベルから異なるデータラベルを使用することができます。これは、実装に依存して、データラベルのこの割り当てに制限はありません。"
    },
    {
      "indent": 3,
      "text": "The tenant gateway MAC differentiates inter-subnet L3 traffic from intra-subnet L2 traffic on the egress RBridge. Each tenant on an RBridge can use a different gateway MAC or the same tenant gateway MAC for inter-subnet traffic purposes. This is also implementation dependent, and there is no restriction on it.",
      "ja": "テナントゲートウェイMACは、出力RBridgeにイントラサブネットL2トラフィックからサブネット間L3のトラフィックを区別する。 RBridgeの各テナントは、サブネット間トラフィックのために異なるゲートウェイMACまたは同じテナントゲートウェイMACを使用することができます。また、これは実装依存であり、それに制限はありません。"
    },
    {
      "indent": 3,
      "text": "When a local IP prefix is learned in a routing instance on an edge RBridge, the edge RBridge should advertise the IP prefix information for the routing instance so that other edge RBridges will generate IP routing entries. If the ESs in a VN are spread over multiple RBridges, these RBridges MUST advertise each local connecting ES's IP address in the VN to other RBridges. If the ESs in a VN are only connected to one edge RBridge, that RBridge only needs to advertise the subnet corresponding to the VN to other RBridges using host routes. A Tenant ID unique across the TRILL campus is also carried in the advertisement to differentiate IP prefixes between different tenants, because the IP address space of different tenants can overlap (see Sections 7.3 and 7.4).",
      "ja": "ローカルIPプレフィックスは、エッジRBridgeにルーティングインスタンスで学習されたときに他のエッジRBridgesは、IPルーティングエントリを生成するように、エッジRBridgeは、ルーティングインスタンスのIPプレフィックス情報を広告すべきです。 VN中のESが複数のRBridgesに広がっている場合は、これらのRBridgesは、他のRBridgesにVN内の各ローカル接続ESのIPアドレスをアドバタイズする必要があります。 VNでのESを一つだけエッジRBridgeに接続されている場合、そのRBridgeは、ホストルートを使用して、他のRBridgesにVNに対応するサブネットをアドバタイズする必要があります。異なるテナントのIPアドレス空間は（セクション7.3と7.4を参照）を重ねることができるので、TRILLのキャンパス全体でユニークなテナントIDはまた、異なるテナント間のIPプレフィックスを区別するために広告で運ばれます。"
    },
    {
      "indent": 3,
      "text": "If a tenant is deleted on an edge RBridge RB1, RB1 updates the local tenant Data Label, tenant gateway MAC, and related IP prefix information it is advertising to include only the rest of the tenants. It may take some time for these updates to reach all other RBridges, so during this period of time there may be transient route inconsistency among the edge RBridges. If there is traffic in flight during this time, it will be dropped at the egress RBridge due to local tenant deletion. When a stable state is reached, the traffic to the deleted tenant will be dropped by the ingress RBridge. Therefore, the transient route inconsistency won't cause issues other than wasting some network bandwidth.",
      "ja": "テナントは、エッジRBridge RB1上で削除されている場合は、RB1は、テナントの唯一の残りの部分が含まれるように広告している地元のテナントのデータラベル、テナントゲートウェイMAC、および関連するIPプレフィックス情報を更新します。これは、これらの更新は、他のすべてのRBridgesに到達するまでに時間がかかる場合がありますので、この期間中にエッジRBridges間過渡ルート矛盾があるかもしれません。トラフィックがこの時間の間、飛行中に存在する場合、それは地元のテナントの削除による出力RBridgeでドロップされます。安定した状態に到達すると、削除されたテナントへのトラフィックは入力RBridgeによって破棄されます。そのため、過渡ルート矛盾は、いくつかのネットワーク帯域幅を浪費以外の問題が発生することはありません。"
    },
    {
      "indent": 3,
      "text": "If a new tenant is created and a previously used tenant Data Label is assigned to the new tenant immediately, this may cause a security policy violation for the traffic in flight, because when the egress RBridge receives traffic from the old tenant, it will forward it in the new tenant's routing instance and deliver it to the wrong destination. So, a tenant Data Label MUST NOT be reallocated until a reasonable amount of time -- for example, twice the IS-IS Holding Time generally in use in the TRILL campus -- has passed to allow any traffic in flight to be discarded.",
      "ja": "新しいテナントが作成され、以前に使用したテナントのデータ・ラベルがすぐに新しいテナントに割り当てられている場合は、出口RBridgeが古いテナントからのトラフィックを受信したとき、それはそれを転送しますので、これは、飛行中のトラフィックのセキュリティポリシー違反を引き起こす可能性があり新しいテナントのルーティングインスタンスにし、誤った宛先に配信。だから、テナントのデータラベルは、妥当な時間まで、再割り当てされてはならない - 例えば、一般的にTRILLキャンパスで使用されている二回IS-ISの保持時間は - 廃棄しなければ、飛行中にすべてのトラフィックを許可するように過ぎています。"
    },
    {
      "indent": 3,
      "text": "When the ARP entry in an edge RBridge for an ES times out, it will trigger an edge RBridge LSP advertisement to other edge RBridges with the corresponding IP routing entry deleted. If the ES is an IP router, the edge RBridge also notifies other edge RBridges that they must delete the routing entries corresponding to the IP prefixes accessible through that IP router. During the IP prefix deleting process, if there is traffic in flight, the traffic will be discarded at the egress RBridge because there is no local IP routing entry to the destination.",
      "ja": "アウトES時間のエッジRBridgeにARPエントリは、それが削除され、対応するIPルーティングエントリを有する他のエッジRBridgesにエッジRBridge LSPの広告をトリガする場合。 ESは、IPルータである場合には、エッジRBridgeはまた、彼らはそのIPルーターを介してアクセス可能なIPプレフィックスに対応するルーティングエントリを削除しなければならない他のエッジRBridgesを通知します。トラフィックが飛行中に存在する場合、宛先へのローカルIPルーティングエントリが存在しないため、IPプレフィックス削除処理中に、トラフィックは、出口RBridgeで破棄されます。"
    },
    {
      "indent": 3,
      "text": "If an edge RBridge changes its tenant gateway MAC, it will trigger an edge RBridge LSP advertisement to other edge RBridges, giving the new gateway MAC to be used as the Inner.MacDA for future traffic destined to the edge RBridge. During the gateway MAC changing process, if there is traffic in flight using the old gateway MAC as the Inner.MacDA, the traffic will be discarded or will be forwarded as L2 intra-subnet traffic on the edge RBridge. If the inter-subnet tenant Data Label is a unique Data Label that is different from any access Data Labels, when the edge RBridge receives the traffic whose Inner.MacDA is different from the local tenant gateway MAC, the traffic will be discarded. If the edge RBridge uses one of the access Data Labels as an inter-subnet tenant Data Label, the traffic will be forwarded as L2 intra-subnet traffic unless a special traffic-filtering policy is enforced on the edge RBridge.",
      "ja": "エッジRBridgeは、そのテナントのゲートウェイMACを変更した場合、それはエッジRBridge宛ての将来のトラフィックのためにInner.MacDAとして使用する新しいゲートウェイMACを与え、他のエッジRBridgesにエッジRBridge LSP広告をトリガーします。 Inner.MacDAとして古いゲートウェイMACを使用して飛行中のトラフィックがある場合、ゲートウェイMAC変更プロセスの間、トラフィックは廃棄されるか、またはエッジRBridgeにL2イントラサブネットトラフィックとして転送されます。サブネット間テナントのデータ・ラベルはエッジRBridgeは、そのInner.MacDAローカルテナントゲートウェイMACと異なるトラフィックを受信した場合に、任意のアクセスデータ・ラベルと異なる独自のデータ・ラベルの場合は、トラフィックが破棄されます。エッジRBridgeは、サブネット間のテナントのデータ・ラベルなどのアクセスデータ・ラベルの1つを使用する場合は、特別なトラフィックフィルタリングポリシーをエッジRBridgeに施行されていない限り、トラフィックはL2サブネット内トラフィックとして転送されます。"
    },
    {
      "indent": 3,
      "text": "If there are multiple nicknames owned by an edge RBridge, the edge RBridge can also specify one nickname as the egress nickname for inter-subnet traffic forwarding. A NickFlags APPsub-TLV with the SE flag set can be used for this purpose. If the edge RBridge doesn't specify a nickname for this purpose, the ingress RBridge can use any one of the nicknames owned by the egress as the egress nickname for inter-subnet traffic forwarding.",
      "ja": "エッジRBridgeが所有する複数のニックネームがある場合は、エッジRBridgeもサブネット間のトラフィック転送のための出口ニックネームとして1つのニックネームを指定することができます。 SEフラグが設定されたNickFlags APPsub-TLVは、この目的のために使用することができます。エッジRBridgeは、この目的のためにニックネームを指定していない場合は、入口RBridgeは、サブネット間のトラフィック転送のための出口ニックネームとして出口が所有ニックネームのいずれかを使用することができます。"
    },
    {
      "indent": 3,
      "text": "TRILL Extended Level 1 Flooding Scope (E-L1FS) FS-LSP [RFC7780] APPsub-TLVs are used for IP routing information synchronization in each routing domain among edge RBridges. Based on the synchronized information from other edge RBridges, each edge RBridge generates routing entries in each routing domain for remote IP addresses and subnets.",
      "ja": "TRILL拡張レベル1氾濫範囲（E-L1FS）FS-LSP [RFC7780] APPsub-のTLVは、エッジRBridgesうち各ルーティングドメイン内のIPルーティング情報同期のために使用されます。他のエッジRBridgesから同期情報に基づいて、各エッジRBridgeは、リモートIPアドレスとサブネットの各ルーティング領域内のルーティングエントリを生成します。"
    },
    {
      "indent": 3,
      "text": "Through this solution, the intra-subnet forwarding and inter-subnet IP routing functions are integrated, and network management and deployment are simplified.",
      "ja": "この溶液に、イントラサブネット転送およびサブネット間のIPルーティング機能が統合され、ネットワーク管理および展開が簡素化されます。"
    },
    {
      "indent": 0,
      "text": "5.3. Active-Active Access",
      "section_title": true,
      "ja": "5.3. アクティブ - アクティブアクセス"
    },
    {
      "indent": 3,
      "text": "TRILL active-active service provides ESs with flow-level load balance and resilience against link failures at the edge of TRILL campuses, as described in [RFC7379].",
      "ja": "[RFC7379]に記載されているようにTRILLアクティブ - アクティブサービスは、TRILLキャンパスの端にリンク障害に対するフローレベルの負荷バランスと弾力とのESを提供します。"
    },
    {
      "indent": 3,
      "text": "If an ES is connected to two TRILL RBridges, say RB1 and RB2, in active-active mode, RB1 and RB2 MUST both be configured to act as a distributed L3 gateway for the ES in order to use a distributed gateway. RB1 and RB2 each learn the ES's IP address through the ARP/ND process, and then they announce the IP address to the TRILL campus independently. The remote ingress RBridge will generate an IP routing entry corresponding to the IP address with two IP next hops of RB1 and RB2. When the ingress RBridge receives inter-subnet traffic from a local access network, the ingress RBridge selects RB1 or RB2 as the IP next hop based on least cost or, if costs are equal, the local load-balancing algorithm. The traffic will then be transmitted to the selected next-hop destination RB1 or RB2 through the TRILL campus.",
      "ja": "ESは二つのTRILLのRBridgesに接続されている場合、RB1とRB2を言い、アクティブ - アクティブモードでは、RB1とRB2の両方分散ゲートウェイを使用するためにESの分散L3ゲートウェイとして機能するように構成されなければなりません。 RB1とRB2それぞれがARP / NDプロセスを介してESのIPアドレスを学習した後、彼らは独立してTRILLのキャンパスにIPアドレスを発表します。遠隔入口RBridgeはRB1とRB2の2つのIPネクストホップとIPアドレスに対応するIPルーティングエントリを生成します。入口RBridgeは、ローカル・アクセス・ネットワークからサブネット間のトラフィックを受信すると、入口RBridgeは、最小のコストや、コストが等しい場合、ローカルロードバランシングアルゴリズムに基づいて、IPネクストホップとしてRB1またはRB2を選択します。トラフィックは、TRILLキャンパスを介して選択された次のホップ先RB1又はRB2に伝達されます。"
    },
    {
      "indent": 0,
      "text": "5.4. Data Traffic Forwarding Process",
      "section_title": true,
      "ja": "5.4. データトラフィック転送プロセス"
    },
    {
      "indent": 3,
      "text": "After ES1, connected by L2 in VLAN-x, acquires its gateway's MAC, it can start inter-subnet data traffic transmission to ES2 in VLAN-y.",
      "ja": "VLAN-xのL2で接続されたES1は、そのゲートウェイのMACを取得した後、それはVLAN-yのES2へのサブネット間のデータトラフィックの送信を開始することができます。"
    },
    {
      "indent": 3,
      "text": "When the edge RBridge attached to ES1 receives inter-subnet traffic from ES1, that RBridge performs L2 header termination; then, using the local VRF corresponding to VLAN-x, it performs the IP routing process in that VRF.",
      "ja": "ES1に取り付けられたエッジRBridgeは、ES1からサブネット間のトラフィックを受信した場合、RBridgeは、L2ヘッダ終端を実行します。次に、VLAN-Xに対応するローカルVRFを使用して、そのVRF内のIPルーティング処理を行います。"
    },
    {
      "indent": 3,
      "text": "If destination ES2 is attached to the same edge RBridge, the traffic will be locally forwarded to ES2 by that RBridge. Compared to the centralized gateway solution, the forwarding path is optimal, and a traffic detour through the centralized gateway is avoided.",
      "ja": "先ES2が同じエッジRBridgeに接続されている場合、トラフィックは、ローカルそのRBridgeによってES2に転送されます。集中型のゲートウェイ・ソリューションに比べ、転送パスが最適であり、集中型のゲートウェイを通過するトラフィックの迂回が回避されます。"
    },
    {
      "indent": 3,
      "text": "If ES2 is attached to a remote edge RBridge, the remote edge RBridge is the IP next hop, and the inter-subnet traffic is forwarded to the IP next hop through TRILL encapsulation. If there are multiple equal-cost shortest paths between the ingress RBridge and the egress RBridge, all these paths can be used for inter-subnet traffic forwarding, so load-spreading can be achieved for inter-subnet traffic.",
      "ja": "ES2がリモートエッジRBridgeに接続されている場合、リモートエッジRBridgeは、IPネクストホップであり、サブネット間トラフィックはTRILLカプセル化を介してIPネクストホップに転送されます。入口RBridgeと出口RBridge間の複数の等コスト最短経路が存在する場合、これらのすべてのパスがサブネット間トラフィック転送のために使用することができるので、負荷拡散がサブネット間トラフィックに達成することができます。"
    },
    {
      "indent": 3,
      "text": "When the remote RBridge receives the inter-subnet TRILL-encapsulated traffic, the RBridge decapsulates these TRILL packets and checks the Inner.MacDA. If that MAC address is the local gateway MAC corresponding to the inner label (VLAN or FGL), the inner label will be used to find the corresponding local VRF; the IP routing process in that VRF will then be performed, and the traffic will be locally forwarded to destination ES2.",
      "ja": "リモートRBridgeがサブネット間TRILLカプセル化トラフィックを受信した場合、RBridgeは、これらTRILLパケットをデカプセル化し、Inner.MacDAをチェックします。そのMACアドレスがMACは、内側ラベル（VLANまたはFGL）に対応するローカルゲートウェイである場合、インナーラベルは、対応するローカルVRFを見つけるために使用されるであろう。そのVRFでのIPルーティングプロセスは、次に実行され、トラフィックはローカルの宛先ES2に転送されます。"
    },
    {
      "indent": 3,
      "text": "In summary, this solution avoids traffic detours through a central gateway. Both inter-subnet and intra-subnet traffic can be forwarded along pair-wise shortest paths, and network bandwidth is conserved.",
      "ja": "要約すると、この溶液は、中央ゲートウェイを介してトラフィックの迂回を回避します。サブネット間およびイントラサブネットトラフィックの両方は、ペアワイズの最短経路に沿って転送することができ、ネットワーク帯域幅が保存されています。"
    },
    {
      "indent": 0,
      "text": "6. Distributed Layer 3 Gateway Process Example",
      "section_title": true,
      "ja": "6.分散レイヤ3ゲートウェイ・プロセスの例"
    },
    {
      "indent": 3,
      "text": "This section gives a detailed description of a distributed L3 gateway solution example for IPv4 and IPv6.",
      "ja": "このセクションでは、IPv4とIPv6の分散L3ゲートウェイソリューション例の詳細な説明を与えます。"
    },
    {
      "indent": 3,
      "text": "In Figure 3, RB1 and RB2 support the distribution gateway function, ES1 connects to RB1, and ES2 connects to RB2. ES1 and ES2 belong to Tenant1 but are in different subnets.",
      "ja": "図3では、RB1とRB2はES1は、RB1に接続し、ES2はRB2に接続され、配信ゲートウェイ機能をサポートします。 ES1とES2はTenant1に属しているが、異なるサブネットにあります。"
    },
    {
      "indent": 21,
      "text": "---------             ---------\n|  RB3  |             |  RB4  |\n---------             ---------\n#   *                     #  *\n#   **************************\n###########################  *\n#                            *\n#                            *\n#                            *\n---------              ---------\n|  RB1  |              |  RB2  |\n---------              ---------\n   |                       |\n -----                   -----\n |ES1|                   |ES2|\n -----                   -----",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Figure 3: Distributed Gateway Scenario",
      "ja": "図3：分散型ゲートウェイのシナリオ"
    },
    {
      "indent": 3,
      "text": "For IPv4, the IP address, VLAN, and subnet information of ES1 and ES2 are as follows:",
      "ja": "次のようにIPv4の場合、IPアドレス、VLAN、およびES1とES2のサブネット情報は以下のとおりです。"
    },
    {
      "indent": 4,
      "text": "+----+----------+------------------+------------------+----------+\n| ES | Tenant   |   IP Address     |  Subnet          |  VLAN    |\n+----+----------+------------------+------------------+----------+\n| ES1| Tenant1  |   192.0.2.2      |  192.0.2.0/24    |   10     |\n+----+----------+------------------+------------------+----------+\n| ES2| Tenant1  |   198.51.100.2   |  198.51.100.0/24 |   20     |\n+----+----------+------------------+------------------+----------+",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Figure 4: IPv4 ES Information",
      "ja": "図4：IPv4のES情報"
    },
    {
      "indent": 3,
      "text": "For IPv6, the IP address, VLAN, and subnet information of ES1 and ES2 are as follows:",
      "ja": "次のようにIPv6の場合、IPアドレス、VLAN、およびES1とES2のサブネット情報は以下のとおりです。"
    },
    {
      "indent": 4,
      "text": "+----+----------+------------------+------------------+----------+\n| ES | Tenant   | IP Address       | Subnet           |  VLAN    |\n+----+----------+------------------+------------------+----------+\n| ES1| Tenant1  | 2001:db8:0:1::2  |2001:db8:0:1::0/64|   10     |\n+----+----------+------------------+------------------+----------+\n| ES2| Tenant1  | 2001:db8:0:2::2  |2001:db8:0:2::0/64|   20     |\n+----+----------+------------------+------------------+----------+",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Figure 5: IPv6 ES Information",
      "ja": "図5：IPv6のES情報"
    },
    {
      "indent": 3,
      "text": "The nickname, VRF, tenant Label, and tenant gateway MAC for Tenant1 on RB1 and RB2 are as follows:",
      "ja": "次のようにRB1とRB2のTenant1のニックネーム、VRF、テナントラベル、およびテナントゲートウェイMACは以下のとおりです。"
    },
    {
      "indent": 4,
      "text": "+----+---------+-----------+-------+--------------+--------------+\n| RB | Nickname|  Tenant   | VRF   | Tenant Label |  Gateway MAC |\n+----+---------+-----------+-------+--------------+--------------+\n| RB1|  nick1  |  Tenant1  | VRF1  |    100       |    MAC1      |\n+----+---------+-----------+-------+--------------+--------------+\n| RB2|  nick2  |  Tenant1  | VRF2  |    100       |    MAC2      |\n+----+---------+-----------+-------+--------------+--------------+",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Figure 6: RBridge Information",
      "ja": "図6：RBridge情報"
    },
    {
      "indent": 0,
      "text": "6.1. Control-Plane Process",
      "section_title": true,
      "ja": "6.1. コントロールプレーンプロセス"
    },
    {
      "indent": 3,
      "text": "RB1 advertises the following local routing information to the TRILL campus:",
      "ja": "RB1は、TRILLのキャンパスに次のローカルルーティング情報をアドバタイズします。"
    },
    {
      "indent": 18,
      "text": "Tenant ID: 1",
      "ja": "テナントID：1"
    },
    {
      "indent": 18,
      "text": "Tenant gateway MAC: MAC1",
      "ja": "テナントゲートウェイMAC：MAC1"
    },
    {
      "indent": 18,
      "text": "Tenant Label for Tenant1: VLAN 100",
      "ja": "Tenant1のためのテナントレーベル：VLAN 100"
    },
    {
      "indent": 18,
      "text": "IPv4 prefix for Tenant1: 192.0.2.0/24",
      "ja": "Tenant1のIPv4プレフィックス：192.0.2.0/24"
    },
    {
      "indent": 18,
      "text": "IPv6 prefix for Tenant1: 2001:db8:0:1::0/64",
      "ja": "Tenant1のためのIPv6プレフィックス：2001：DB8：0：1 :: 0/64"
    },
    {
      "indent": 3,
      "text": "RB2 announces the following local routing information to the TRILL campus:",
      "ja": "RB2は、TRILLのキャンパスに次のローカルルーティング情報を発表しました："
    },
    {
      "indent": 18,
      "text": "Tenant ID: 1",
      "ja": "テナントID：1"
    },
    {
      "indent": 18,
      "text": "Tenant gateway MAC: MAC2",
      "ja": "テナントゲートウェイMAC：MAC2"
    },
    {
      "indent": 18,
      "text": "Tenant Label for Tenant1: VLAN 100",
      "ja": "Tenant1のためのテナントレーベル：VLAN 100"
    },
    {
      "indent": 18,
      "text": "IPv4 prefix for Tenant1: 198.51.100.0/24",
      "ja": "Tenant1のIPv4プレフィックス：198.51.100.0/24"
    },
    {
      "indent": 18,
      "text": "IPv6 prefix for Tenant1: 2001:db8:0:2::0/64",
      "ja": "Tenant1のためのIPv6プレフィックス：2001：DB8：0：2 :: 0/64"
    },
    {
      "indent": 3,
      "text": "Relying on the routing information from RB2, remote routing entries on RB1 are generated as follows:",
      "ja": "次のようにRB2からルーティング情報に依存する、RB1にリモートルーティングエントリが生成されます。"
    },
    {
      "indent": 5,
      "text": "+------------------+-------------+--------------+----------------+\n|  Prefix/Mask     | Inner.MacDA | Inner VLAN   | Egress Nickname|\n+------------------+-------------+--------------+----------------+\n|198.51.100.0/24   |    MAC2     |    100       |     nick2      |\n+------------------+-------------+--------------+----------------+\n|2001:db8:0:2::0/64|    MAC2     |    100       |     nick2      |\n+------------------+-------------+--------------+----------------+",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 7: Tenant1 Remote Routing Table on RB1",
      "ja": "図7：RB1のTenant1リモートルーティングテーブル"
    },
    {
      "indent": 3,
      "text": "Similarly, relying on the routing information from RB1, remote routing entries on RB2 are generated as follows:",
      "ja": "以下同様に、RB1からのルーティング情報に依存する、RB2上のリモートルーティングエントリが生成されます。"
    },
    {
      "indent": 5,
      "text": "+------------------+-------------+--------------+----------------+\n|   Prefix/Mask    | Inner.MacDA | Inner VLAN   | Egress Nickname|\n+------------------+-------------+--------------+----------------+\n|  192.0.2.0/24    |     MAC1    |    100       |     nick1      |\n+------------------+-------------+--------------+----------------+\n|2001:db8:0:1::0/64|     MAC1    |    100       |     nick1      |\n+------------------+-------------+--------------+----------------+",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 8: Tenant1 Remote Routing Table on RB2",
      "ja": "図8：RB2のTenant1リモートルーティングテーブル"
    },
    {
      "indent": 0,
      "text": "6.2. Data-Plane Process",
      "section_title": true,
      "ja": "6.2. データプレーンプロセス"
    },
    {
      "indent": 3,
      "text": "Assuming that ES1 sends unicast inter-subnet traffic to ES2, the traffic forwarding process is as follows:",
      "ja": "次のようにES1はES2にユニキャストサブネット間トラフィックを送信すると仮定すると、トラフィック転送プロセスです。"
    },
    {
      "indent": 3,
      "text": "1. ES1 sends unicast inter-subnet traffic to RB1 with RB1's gateway's MAC as the destination MAC and the VLAN as VLAN 10.",
      "ja": "1. ES1は、宛先MACとVLAN 10とVLANとしてRB1のゲートウェイのMACとRB1に対してユニキャストサブネット間トラフィックを送信します。"
    },
    {
      "indent": 3,
      "text": "2. Ingress RBridge (RB1) forwarding process:",
      "section_title": true,
      "ja": "2.進入RBridge（RB1）転送処理："
    },
    {
      "indent": 6,
      "text": "RB1 checks the destination MAC. If the destination MAC equals the local gateway MAC, the gateway function will terminate the L2 header and perform L3 routing.",
      "ja": "RB1は、宛先MACをチェックします。宛先MACローカルゲートウェイMACに等しい場合、ゲートウェイ機能は、L2ヘッダを終了し、L3ルーティングを実行します。"
    },
    {
      "indent": 6,
      "text": "RB1 looks up IP routing table information by destination IP and Tenant ID to get IP next-hop information, which includes the egress RBridge's gateway MAC (MAC2), tenant Label (VLAN 100), and egress nickname (nick2). Using this information, RB1 will perform inner Ethernet header encapsulation and TRILL encapsulation. RB1 will use MAC2 as the Inner.MacDA, MAC1 (RB1's own gateway MAC) as the Inner.MacSA, VLAN 100 as the Inner.VLAN, nick2 as the egress nickname, and nick1 as the ingress nickname.",
      "ja": "RB1は、出力RBridgeのゲートウェイMAC（MAC2）を含むIPネクストホップ情報、テナントラベル（VLAN 100）、および出口ニックネーム（NICK2）を取得する宛先IPとテナントIDによってIPルーティングテーブル情報を検索します。この情報を使用して、RB1は、内部イーサネットヘッダのカプセル化及びTRILLカプセル化を実行します。 RB1はInner.MacSA、Inner.VLAN、出口ニックネームなどNICK2としてVLAN 100、および入力ニックネームなどnick1としてInner.MacDA、MAC1（RB1自身のゲートウェイMAC）としてMAC2を使用します。"
    },
    {
      "indent": 6,
      "text": "RB1 looks up TRILL forwarding information by egress nickname and sends the traffic to the TRILL next hop as per [RFC6325]. The traffic will be sent to RB3 or RB4 as a result of load-balancing.",
      "ja": "RB1は出口ニックネームでTRILL転送情報を検索し、[RFC6325]あたりのようTRILL次のホップにトラフィックを送信します。トラフィックは、負荷分散の結果として、RB3またはRB4に送信されます。"
    },
    {
      "indent": 3,
      "text": "Assuming that the traffic is forwarded to RB3, the following occurs:",
      "ja": "トラフィックがRB3に転送されると仮定すると、次の処理が行われます。"
    },
    {
      "indent": 3,
      "text": "3. Transit RBridge (RB3) forwarding process:",
      "section_title": true,
      "ja": "3.トランジットRBridge（RB3）転送処理："
    },
    {
      "indent": 6,
      "text": "RB3 looks up TRILL forwarding information by egress nickname and forwards the traffic to RB2 as per [RFC6325].",
      "ja": "RB3は出口ニックネームでTRILL転送情報を検索し、[RFC6325]あたりのようRB2にトラフィックを転送します。"
    },
    {
      "indent": 3,
      "text": "4. Egress RBridge forwarding process:",
      "section_title": true,
      "ja": "4.出口RBridge転送プロセス："
    },
    {
      "indent": 6,
      "text": "As the egress nickname is RB2's own nickname, RB2 performs TRILL decapsulation. It then checks the Inner.MacDA and, because that MAC is equal to the local gateway MAC, performs inner Ethernet header termination. Using the inner VLAN, RB2 finds the local corresponding VRF and looks up the packet's destination IP address in the VRF's IP routing table. The traffic is then locally forwarded to ES2 with VLAN 20.",
      "ja": "出口ニックネームはRB2の自身のニックネームであるため、RB2は、TRILLのカプセル化解除を行います。次にInner.MacDAをチェックし、そのMACローカルゲートウェイMACに等しいので、内部イーサネットヘッダ終端を行います。内部VLANを使用して、RB2は地元対応するVRFを検索し、VRFのIPルーティングテーブルにパケットの宛先IPアドレスを検索します。トラフィックはその後、ローカルにVLAN 20とES2に転送されます。"
    },
    {
      "indent": 0,
      "text": "7. TRILL Protocol Extensions",
      "section_title": true,
      "ja": "7. TRILLプロトコル拡張"
    },
    {
      "indent": 3,
      "text": "If an edge RBridge RB1 participates in the distributed gateway function, it announces its tenant gateway MAC and tenant Data Label to the TRILL campus through the tenant Label and gateway MAC APPsub-TLV. It should announce its local IPv4 and IPv6 prefixes through the IPv4 Prefix APPsub-TLV and the IPv6 Prefix APPsub-TLV, respectively. If RB1 has multiple nicknames, it can announce one nickname for use by the distributed gateway, by using the NickFlags APPsub-TLV with the SE flag set to 1.",
      "ja": "エッジRBridge RB1は、分散ゲートウェイ機能に関与する場合は、テナントラベルとゲートウェイMAC APPsub-TLVを介しTRILLキャンパスへのテナントゲートウェイMAC及びテナントデータラベルを発表します。それは、それぞれのIPv4プレフィックスAPPsub-TLVおよびIPv6プレフィックスAPPsub-TLVを通じて、地元のIPv4およびIPv6プレフィックスを発表すべきです。 RB1は、複数のニックネームを持っている場合、それは1にセットSEフラグでNickFlags APPsub-TLVを使用することにより、分散ゲートウェイによって使用するための1つのニックネームを発表することができます。"
    },
    {
      "indent": 3,
      "text": "The remote ingress RBridges belonging to the same routing domain use this information to generate IP routing entries in that routing domain. These RBridges use the nickname, tenant gateway MAC, and tenant Label of RB1 to perform inter-subnet TRILL encapsulation when they receive inter-subnet traffic from a local ES. The nickname is used as the egress nickname, the tenant gateway MAC is used as the Inner.MacDA, and the tenant Data Label is used as the Inner.Label. The following APPsub-TLVs MUST be included in a TRILL GENINFO TLV in E-L1FS FS-LSPs [RFC7780].",
      "ja": "同じルーティングドメインに属するリモート入口RBridgesは、そのルーティングドメインにIPルーティングエントリを生成するには、この情報を使用します。これらのRBridgesはニックネーム、テナントゲートウェイMACを使用して、彼らは地元のESからサブネット間のトラフィックを受信したときRB1のテナントラベルはサブネット間TRILLカプセル化を実行します。ニックネームを出口ニックネームとして使用される、テナントゲートウェイMACはInner.MacDAとして使用され、テナントデータラベルはInner.Labelとして使用されます。以下APPsub-のTLVは、E-L1FS FS-LSPを[RFC7780]にTRILL GENINFO TLVに含まれなければなりません。"
    },
    {
      "indent": 0,
      "text": "7.1. The Tenant Label and Gateway MAC APPsub-TLV",
      "section_title": true,
      "ja": "7.1. テナントラベルやゲートウェイMAC APPsub-TLV"
    },
    {
      "indent": 5,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Type                        | (2 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Length                      | (2 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Tenant ID   (4 bytes)                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Resv1 |     Label1            | (2 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Resv2 |     Label2            | (2 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+....-+-+-+-+-+-+-+-+-+\n|            Tenant Gateway MAC   (6 bytes)                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+....-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 5,
      "text": "o Type: Set to the TENANT-GWMAC-LABEL sub-TLV type (7). 2 bytes, because this APPsub-TLV appears in an extended TLV [RFC7356].",
      "ja": "O型：テナントGWMACラベルサブTLVのタイプ（7）に設定します。 2バイト、このAPPsub-TLV拡張TLV [RFC7356]に表示されているため。"
    },
    {
      "indent": 5,
      "text": "o Length: If the Label1 field is used to represent a VLAN, the value of the Length field is 12. If the Label1 and Label2 fields are used to represent an FGL, the value of the Length field is 14.",
      "ja": "O長さ：のLabel1フィールドはVLANを表すために使用される場合、長さフィールドの値のLabel1とLabel2をフィールドはFGLを表すために使用される場合、長さフィールドの値が14である12です。"
    },
    {
      "indent": 5,
      "text": "o Tenant ID: This identifies a Tenant ID unique across the TRILL campus.",
      "ja": "OテナントID：これは、TRILLのキャンパス全体でユニークなテナントIDを識別します。"
    },
    {
      "indent": 5,
      "text": "o Resv1: 4 bits that MUST be sent as zero and ignored on receipt.",
      "ja": "O Resv1：ゼロとして送られて、領収書の上で無視しなければなりません4ビット。"
    },
    {
      "indent": 5,
      "text": "o Label1: If the value of the Length field is 12, it identifies a tenant Label corresponding to a VLAN ID. If the value of the Length field is 14, it identifies the higher 12 bits of a tenant Label corresponding to an FGL.",
      "ja": "OのLabel1は：長さフィールドの値が12である場合、それは、VLAN IDに対応するテナントラベルを識別する。 Lengthフィールドの値が14である場合、それはFGLに対応するテナントラベルの上位12ビットを識別する。"
    },
    {
      "indent": 5,
      "text": "o Resv2: 4 bits that MUST be sent as zero and ignored on receipt. Only present if the Length field is 14.",
      "ja": "O RESV2：ゼロとして送られて、領収書の上で無視しなければなりません4ビット。長さフィールドが14である場合にのみ存在。"
    },
    {
      "indent": 5,
      "text": "o Label2: This field has the lower 12 bits of the tenant Label corresponding to an FGL. Only present if the Length field is 14.",
      "ja": "O Label2を：このフィールドは、FGLに対応するテナントラベルの下位12ビットを有します。長さフィールドが14である場合にのみ存在。"
    },
    {
      "indent": 5,
      "text": "o Tenant Gateway MAC: This identifies the local gateway MAC corresponding to the Tenant ID. The remote ingress RBridges use the gateway MAC as the Inner.MacDA. The advertising TRILL RBridge uses the gateway MAC to differentiate L2 intra-subnet traffic and L3 inter-subnet traffic in the egress direction.",
      "ja": "テナントゲートウェイMAC（O）これは、ローカルゲートウェイMACは、テナントIDに対応する特定します。遠隔入口RBridgesはInner.MacDAとしてゲートウェイMACを使用します。広告TRILL RBridgeは、出力方向にL2イントラサブネットトラフィックおよびL3サブネット間のトラフィックを区別するために、ゲートウェイMACを使用します。"
    },
    {
      "indent": 0,
      "text": "7.2. The SE Flag in the NickFlags APPsub-TLV",
      "section_title": true,
      "ja": "7.2.  NickFlags APPsub-TLVでSE旗"
    },
    {
      "indent": 3,
      "text": "The NickFlags APPsub-TLV is specified in [RFC7780], where the IN flag is described. The SE Flag is assigned as follows:",
      "ja": "NickFlags APPsub-TLVは、INフラグが記述されている[RFC7780]で指定されています。次のようにSEフラグが割り当てられます。"
    },
    {
      "indent": 15,
      "text": "+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+\n|   Nickname                                    |\n+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+\n|IN|SE|         RESV                            |\n+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+--+\n                 NICKFLAG RECORD",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o SE: If the SE flag is set to 1, it indicates that the advertising RBridge suggests that the Nickname SHOULD be used as the Inter-Subnet Egress nickname for inter-subnet traffic forwarding. If the SE flag is set to 0, that Nickname SHOULD NOT be used for that purpose. The SE flag is ignored if the NickFlags APPsub-TLV is advertised by an RBridge that does not own the Nickname.",
      "ja": "O SE：SEフラグが1に設定されている場合、それは広告RBridgeがニックネームがサブネット間トラフィック転送用のインターサブネット出口ニックネームとして使用されるべきであることを示唆していることを示しています。 SEフラグが0に設定されている場合は、そのニックネームは、その目的には使用しないでください。 NickFlags APPsub-TLVは、ニックネームを所有していないRBridgeによってアドバタイズされた場合にSEフラグは無視されます。"
    },
    {
      "indent": 0,
      "text": "7.3. The IPv4 Prefix APPsub-TLV",
      "section_title": true,
      "ja": "7.3.  IPv4のプレフィックスAPPsub-TLV"
    },
    {
      "indent": 5,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Type                        |                    (2 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Total Length                |                    (2 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|                     Tenant ID                    | (4 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|PrefixLength(1)|                                    (1 byte)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|                     Prefix (1)                   | (variable)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|     .....     |                                    (1 byte)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|                    .....                         | (variable)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|PrefixLength(N)|                                    (1 byte)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|                     Prefix (N)                   | (variable)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 5,
      "text": "o Type: Set to the IPV4-PREFIX sub-TLV type (8). 2 bytes, because this APPsub-TLV appears in an extended TLV [RFC7356].",
      "ja": "O型：IPV4-PREFIXサブTLVのタイプ（8）に設定します。 2バイト、このAPPsub-TLV拡張TLV [RFC7356]に表示されているため。"
    },
    {
      "indent": 5,
      "text": "o Total Length: This 2-byte unsigned integer indicates the total length of the Tenant ID, Prefix Length, and Prefix fields, in octets. A value of 0 indicates that no IPv4 prefix is being advertised.",
      "ja": "全長（O）この2バイトの符号なし整数オクテットで、テナントID、プレフィックス長、およびプレフィックスフィールドの合計長さを示します。 0の値は、IPv4のプレフィックスがアドバタイズされていないことを示しています。"
    },
    {
      "indent": 5,
      "text": "o Tenant ID: This identifies a Tenant ID unique across the TRILL campus.",
      "ja": "OテナントID：これは、TRILLのキャンパス全体でユニークなテナントIDを識別します。"
    },
    {
      "indent": 5,
      "text": "o Prefix Length: The Prefix Length field indicates the length, in bits, of the IPv4 address prefix. A length of 0 (i.e., the prefix itself is 0 octets) indicates a prefix that matches all IPv4 addresses.",
      "ja": "Oプレフィックス長：プレフィックス長フィールドは、IPv4アドレスプレフィックスのビットの長さを、示しています。 0の長さ（すなわち、接頭辞自体は0オクテットで）すべてのIPv4アドレスと一致する接頭辞を示します。"
    },
    {
      "indent": 5,
      "text": "o Prefix: The Prefix field contains an IPv4 address prefix, followed by enough trailing bits to make the end of the field fall on an octet boundary. Note that the value of the trailing bits is irrelevant. For example, if the Prefix Length is 12, indicating 12 bits, then the Prefix is 2 octets and the low-order 4 bits of the Prefix are irrelevant.",
      "ja": "Oプレフィックス：プレフィックスフィールドは、オクテット境界上のフィールドの秋の終わりを作るのに十分な末尾のビットに続いてIPv4アドレスのプレフィックスを、含まれています。後続のビットの値は無関係であることに留意されたいです。例えば、プレフィックス長が12ビットを示し、12であれば、その後プレフィックスは2つのオクテットであり、プレフィックスの下位4ビットは無関係です。"
    },
    {
      "indent": 0,
      "text": "7.4. The IPv6 Prefix APPsub-TLV",
      "section_title": true,
      "ja": "7.4.  IPv6のプレフィックスAPPsub-TLV"
    },
    {
      "indent": 5,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Type                        |                    (2 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Total Length                |                    (2 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|                     Tenant ID                    | (4 bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|PrefixLength(1)|                                    (1 byte)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|                     Prefix (1)                   | (variable)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|     .....       |                                  (1 byte)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|                    .....                         | (variable)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|PrefixLength(N)|                                    (1 byte)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+\n|                     Prefix (N)                   | (variable)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+...-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 5,
      "text": "o Type: Set to the IPV6-PREFIX sub-TLV type (9). 2 bytes, because this APPsub-TLV appears in an extended TLV [RFC7356].",
      "ja": "O型：IPV6-PREFIXサブTLVのタイプ（9）に設定します。 2バイト、このAPPsub-TLV拡張TLV [RFC7356]に表示されているため。"
    },
    {
      "indent": 5,
      "text": "o Total Length: This 2-byte unsigned integer indicates the total length of the Tenant ID, Prefix Length, and Prefix fields, in octets. A value of 0 indicates that no IPv6 prefix is being advertised.",
      "ja": "全長（O）この2バイトの符号なし整数オクテットで、テナントID、プレフィックス長、およびプレフィックスフィールドの合計長さを示します。 0の値は、IPv6プレフィクスがアドバタイズされていないことを示しています。"
    },
    {
      "indent": 5,
      "text": "o Tenant ID: This identifies a Tenant ID unique across the TRILL campus.",
      "ja": "OテナントID：これは、TRILLのキャンパス全体でユニークなテナントIDを識別します。"
    },
    {
      "indent": 5,
      "text": "o Prefix Length: The Prefix Length field indicates the length, in bits, of the IPv6 address prefix. A length of 0 (i.e., the prefix itself is 0 octets) indicates a prefix that matches all IPv6 addresses.",
      "ja": "Oプレフィックス長：プレフィックス長フィールドは、IPv6アドレスプレフィックスのビットの長さを、示しています。 0の長さ（すなわち、接頭辞自体は0オクテットで）すべてのIPv6アドレスに一致するプレフィックスを示します。"
    },
    {
      "indent": 5,
      "text": "o Prefix: The Prefix field contains an IPv6 address prefix, followed by enough trailing bits to make the end of the field fall on an octet boundary. Note that the value of the trailing bits is irrelevant. For example, if the Prefix Length is 100, indicating 100 bits, then the Prefix is 13 octets and the low-order 4 bits of the Prefix are irrelevant.",
      "ja": "Oプレフィックス：プレフィックスフィールドは、オクテット境界上のフィールドの秋の終わりを作るのに十分な末尾のビットに続いて、IPv6アドレスのプレフィックスが含まれています。後続のビットの値は無関係であることに留意されたいです。例えば、プレフィックス長が100ビットを示し、100であれば、その後プレフィックスは13個のオクテットであり、プレフィックスの下位4ビットは無関係です。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Correct configuration of the participating edge RBridges is important to assure that data is not delivered to the wrong tenant, as such incorrect delivery would violate security constraints. IS-IS security [RFC5310] can be used to secure the information advertised by the edge RBridges in LSPs and FS-LSPs.",
      "ja": "参加エッジRBridgesの正しい構成は、このような間違った配信がセキュリティ制約に違反するとして、データは、間違ったテナントに配信されていないことを保証することが重要です。セキュリティ[RFC5310]はのLSPとFS-のLSPのエッジRBridgesによって通知情報を保護するために使用することができ、です。"
    },
    {
      "indent": 3,
      "text": "To avoid the mishandling of data in flight, see Section 5.2 for constraints on the reuse of a tenant Label and on tenant gateway MAC changes. Selecting tenant Labels and IDs in a pseudorandom fashion [RFC4086] can make it more difficult for an adversary to guess a tenant Label or ID that is in use.",
      "ja": "飛行中のデータの取扱いミスを避けるために、テナントラベルの再利用のテナントゲートウェイMACの変更の制約については、セクション5.2を参照してください。敵が使用されているテナントラベルやIDを推測するために擬似ランダムファッション[RFC4086]でテナントラベルとIDを選択することがより困難にすることができます。"
    },
    {
      "indent": 3,
      "text": "Particularly sensitive data should be encrypted end-to-end -- that is, from the source ES to the destination ES. Since the TRILL campus is, for the most part, transparent to ES traffic, such ESs are free to use whatever end-to-end security protocol they would like.",
      "ja": "元ESから宛先ESに、ある - 特に機密性の高いデータは、エンドツーエンドの暗号化されなければなりません。 TRILLのキャンパスがあるので、ほとんどの部分は、ESトラフィックに透明なESが、彼らが望むものは何でも、エンドツーエンドのセキュリティプロトコル自由に使用できます。"
    },
    {
      "indent": 3,
      "text": "For general TRILL security considerations, see [RFC6325].",
      "ja": "一般TRILLセキュリティの考慮事項については、[RFC6325]を参照してください。"
    },
    {
      "indent": 0,
      "text": "9. Management Considerations",
      "section_title": true,
      "ja": "9.管理に関する注意事項"
    },
    {
      "indent": 3,
      "text": "The configuration at each RBridge to support the distributed L3 gateway feature is visible, via the link-state database, to all other RBridges in the campus. Operations, Administration, and Maintenance (OAM) facilities for TRILL are primarily specified in [RFC7455] and [RFC7456].",
      "ja": "分散L3ゲートウェイ機能をサポートする各RBridgeにおける構成は、キャンパス内の他のすべてのRBridgesに、リンクステートデータベースを介して、表示されています。 TRILLのための操作、管理、および保守（OAM）機能は、主に[RFC7455]及び[RFC7456]で指定されています。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "ja": "10. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned three APPsub-TLV type numbers that are lower than 255 in the \"TRILL APPsub-TLV Types under IS-IS TLV 251 Application Identifier 1\" registry. The registry has been updated as follows:",
      "ja": "IANAレジストリ「IS-IS TLV 251アプリケーション識別子1下TRILL APPsub-TLVタイプ」255よりも低い3つAPPsub-TLVタイプ番号を割り当てました。次のようにレジストリが更新されました。"
    },
    {
      "indent": 9,
      "text": "Type         Name            Reference\n----   ------------------   -------------\n 7     TENANT-GWMAC-LABEL   this document",
      "raw": true
    },
    {
      "indent": 10,
      "text": "8 IPV4-PREFIX this document",
      "ja": "8 IPV4-PREFIXこのドキュメント"
    },
    {
      "indent": 10,
      "text": "9 IPV6-PREFIX this document",
      "ja": "9 IPV6-PREFIXこのドキュメント"
    },
    {
      "indent": 3,
      "text": "IANA has assigned a flag bit in the NickFlags APPsub-TLV as described in Section 7.2 and updated the \"NickFlags Bits\" registry, created by [RFC7780], as follows:",
      "ja": "セクション7.2で説明し、以下のように、[RFC7780]によって作成された「NickFlagsビット」レジストリを更新としてIANAはNickFlags APPsub-TLVにフラグビットが割り当てられています。"
    },
    {
      "indent": 9,
      "text": " Bit   Mnemonic      Description        Reference\n-----  --------  -------------------   -------------\n  1       SE     Inter-Subnet Egress   this document",
      "raw": true
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[IS-IS] International Organization for Standardization, \"Intermediate System to Intermediate System intra-domain routeing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode network service (ISO 8473)\", ISO Standard 10589, 2002.",
      "ja": "[IS-IS]国際標準化機構、「中間システムへの中間システム接続モード・ネットワーク・サービス（ISO 8473）を提供するためのプロトコルと組み合わせて使用​​するための情報交換プロトコルをrouteingするドメイン内」、ISO規格10589、2002。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC6325] Perlman, R., Eastlake 3rd, D., Dutt, D., Gai, S., and A. Ghanwani, \"Routing Bridges (RBridges): Base Protocol Specification\", RFC 6325, DOI 10.17487/RFC6325, July 2011, <http://www.rfc-editor.org/info/rfc6325>.",
      "ja": "[RFC6325]パールマン、R.、イーストレイク3、D.、ダット、D.、ガイ、S.、およびA. Ghanwani、 \"ルーティングブリッジ（RBridges）：基本プロトコル仕様\"、RFC 6325、DOI 10.17487 / RFC6325、2011 2011年、<http://www.rfc-editor.org/info/rfc6325>。"
    },
    {
      "indent": 3,
      "text": "[RFC7172] Eastlake 3rd, D., Zhang, M., Agarwal, P., Perlman, R., and D. Dutt, \"Transparent Interconnection of Lots of Links (TRILL): Fine-Grained Labeling\", RFC 7172, DOI 10.17487/RFC7172, May 2014, <http://www.rfc-editor.org/info/rfc7172>.",
      "ja": "[RFC7172]イーストレーク3、D.、張、M.、Agarwalさん、P.、パールマン、R.、およびD.ダット、 \"リンク（TRILL）のロットの透明相互接続：ファイングレイン標識\"、RFC 7172、DOI 10.17487 / RFC7172、2014年5月、<http://www.rfc-editor.org/info/rfc7172>。"
    },
    {
      "indent": 3,
      "text": "[RFC7176] Eastlake 3rd, D., Senevirathne, T., Ghanwani, A., Dutt, D., and A. Banerjee, \"Transparent Interconnection of Lots of Links (TRILL) Use of IS-IS\", RFC 7176, DOI 10.17487/RFC7176, May 2014, <http://www.rfc-editor.org/info/rfc7176>.",
      "ja": "[RFC7176]イーストレーク3、D.、Senevirathne、T.、Ghanwani、A.、ダット、D.、およびA.バネルジー、 \"リンクIS-ISの（TRILL）使用の多くの透明相互接続\"、RFC 7176、DOI 10.17487 / RFC7176、2014年5月、<http://www.rfc-editor.org/info/rfc7176>。"
    },
    {
      "indent": 3,
      "text": "[RFC7356] Ginsberg, L., Previdi, S., and Y. Yang, \"IS-IS Flooding Scope Link State PDUs (LSPs)\", RFC 7356, DOI 10.17487/RFC7356, September 2014, <http://www.rfc-editor.org/info/rfc7356>.",
      "ja": "[RFC7356]ギンズバーグ、L.、Previdi、S.、およびY.ヤン、 \"IS-IS範囲リンク州のPDU（LSPを）フラッディング\"、RFC 7356、DOI 10.17487 / RFC7356、2014年9月、<のhttp：// WWW。 rfc-editor.org/info/rfc7356>。"
    },
    {
      "indent": 3,
      "text": "[RFC7780] Eastlake 3rd, D., Zhang, M., Perlman, R., Banerjee, A., Ghanwani, A., and S. Gupta, \"Transparent Interconnection of Lots of Links (TRILL): Clarifications, Corrections, and Updates\", RFC 7780, DOI 10.17487/RFC7780, February 2016, <http://www.rfc-editor.org/info/rfc7780>.",
      "ja": "[RFC7780]イーストレーク3日、D.、張、M.、パールマン、R.、バネルジー、A.、Ghanwani、A.、およびS.グプタ、「リンクの多くの透明相互接続（TRILL）：明確化、修正、およびアップデート」、RFC 7780、DOI 10.17487 / RFC7780、2016年2月、<http://www.rfc-editor.org/info/rfc7780>。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC826] Plummer, D., \"Ethernet Address Resolution Protocol: Or Converting Network Protocol Addresses to 48.bit Ethernet Address for Transmission on Ethernet Hardware\", STD 37, RFC 826, DOI 10.17487/RFC0826, November 1982, <http://www.rfc-editor.org/info/rfc826>.",
      "ja": "[RFC826]プラマー、D.、 \"イーサネットアドレス解決プロトコル：またはネットワークプロトコルを変換すると、イーサネットハードウェア上での伝送のためのイーサネットアドレスを48ビットへのアドレス\"、STD 37、RFC 826、DOI 10.17487 / RFC0826、1982年11月、<のhttp：/ /www.rfc-editor.org/info/rfc826>。"
    },
    {
      "indent": 3,
      "text": "[RFC4086] Eastlake 3rd, D., Schiller, J., and S. Crocker, \"Randomness Requirements for Security\", BCP 106, RFC 4086, DOI 10.17487/RFC4086, June 2005, <http://www.rfc-editor.org/info/rfc4086>.",
      "ja": "[RFC4086]イーストレーク3日、D.、シラー、J.、およびS.クロッカー、 \"セキュリティのためにランダム要件\"、BCP 106、RFC 4086、DOI 10.17487 / RFC4086、2005年6月、<HTTP：//www.rfc-editor .ORG /情報/ RFC4086>。"
    },
    {
      "indent": 3,
      "text": "[RFC4861] Narten, T., Nordmark, E., Simpson, W., and H. Soliman, \"Neighbor Discovery for IP version 6 (IPv6)\", RFC 4861, DOI 10.17487/RFC4861, September 2007, <http://www.rfc-editor.org/info/rfc4861>.",
      "ja": "[RFC4861] Narten氏、T.、Nordmarkと、E.、シンプソン、W.、およびH.ソリマン、 \"近隣探索IPバージョン6（IPv6）のために\"、RFC 4861、DOI 10.17487 / RFC4861、2007年9月、<のhttp：/ /www.rfc-editor.org/info/rfc4861>。"
    },
    {
      "indent": 3,
      "text": "[RFC5310] Bhatia, M., Manral, V., Li, T., Atkinson, R., White, R., and M. Fanto, \"IS-IS Generic Cryptographic Authentication\", RFC 5310, DOI 10.17487/RFC5310, February 2009, <http://www.rfc-editor.org/info/rfc5310>.",
      "ja": "[RFC5310] Bhatiaは、M.、Manral、V.、李、T.、アトキンソン、R.、ホワイト、R.、およびM. Fantoは、 \"IS-ISジェネリック暗号認証\"、RFC 5310、DOI 10.17487 / RFC5310、 2009年2月、<http://www.rfc-editor.org/info/rfc5310>。"
    },
    {
      "indent": 3,
      "text": "[RFC7379] Li, Y., Hao, W., Perlman, R., Hudson, J., and H. Zhai, \"Problem Statement and Goals for Active-Active Connection at the Transparent Interconnection of Lots of Links (TRILL) Edge\", RFC 7379, DOI 10.17487/RFC7379, October 2014, <http://www.rfc-editor.org/info/rfc7379>.",
      "ja": "[RFC7379]のLi、Y.、ハオ、W.、パールマン、R.、ハドソン、J.、およびH.テキ、「リンクの多くの透明相互接続（TRILL）エッジでアクティブ - アクティブ接続の問題文と目標」、RFC 7379、DOI 10.17487 / RFC7379、2014年10月、<http://www.rfc-editor.org/info/rfc7379>。"
    },
    {
      "indent": 3,
      "text": "[RFC7455] Senevirathne, T., Finn, N., Salam, S., Kumar, D., Eastlake 3rd, D., Aldrin, S., and Y. Li, \"Transparent Interconnection of Lots of Links (TRILL): Fault Management\", RFC 7455, DOI 10.17487/RFC7455, March 2015, <http://www.rfc-editor.org/info/rfc7455>.",
      "ja": "[RFC7455] Senevirathne、T.、フィン、N.、サラム、S.、クマー、D.、イーストレーク3、D.、アルドリン、S.、およびY.李、リンクの多くの「透明相互接続（TRILL）： 「障害管理、RFC 7455、DOI 10.17487 / RFC7455、2015年3月、<http://www.rfc-editor.org/info/rfc7455>。"
    },
    {
      "indent": 3,
      "text": "[RFC7456] Mizrahi, T., Senevirathne, T., Salam, S., Kumar, D., and D. Eastlake 3rd, \"Loss and Delay Measurement in Transparent Interconnection of Lots of Links (TRILL)\", RFC 7456, DOI 10.17487/RFC7456, March 2015, <http://www.rfc-editor.org/info/rfc7456>.",
      "ja": "[RFC7456]ミズラヒ、T.、Senevirathne、T.、サラム、S.、クマー、D.、およびD.イーストレーク第3、 \"リンクのロット（TRILL）の透明な相互接続の損失及び遅延測定\"、RFC 7456、DOI 10.17487 / RFC7456、2015年3月、<http://www.rfc-editor.org/info/rfc7456>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to acknowledge the important contributions of Donald Eastlake, Gayle Noble, Mohammed Umair, Susan Hares, Guangrui Wu, Zhenbin Li, Zhibo Hu, Liang Xia, Scott Bradner, Stephen Farrell, Shawn Emery, Ben Campbell, Russ White, Kathleen Moriarty, Suresh Krishnan, Mirja Kuehlewind, and Francis Dupont.",
      "ja": "著者はドナルドイーストレイク、ゲイルノーブル、モハメッドUmair、スーザンノウサギ、Guangrui呉、Zhenbinリー、Zhibo胡、梁夏、スコット・ブラッドナー、スティーブン・ファレル、ショーン・エメリー、ベン・キャンベル、ラスホワイト、キャスリーン・モリアーティの重要な貢献を認めることを望みます、スレシュクリシュナン、Mirja Kuehlewind、フランシスデュポン。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Weiguo Hao Huawei Technologies 101 Software Avenue Nanjing 210012 China",
      "ja": "魏技術としてUAああああHを持っていた101のソフトウェア大通りのNaN北京210012中国"
    },
    {
      "indent": 3,
      "text": "Phone: +86-25-56623144 Email: haoweiguo@huawei.com",
      "ja": "電話：+ 86-25-56623144 Eメール：haoweiguo@huawei.com"
    },
    {
      "indent": 3,
      "text": "Yizhou Li Huawei Technologies 101 Software Avenue Nanjing 210012 China",
      "ja": "技術のY IリットルIH UA周辺101ソフトウェアの大通りのNaN北京210012中国"
    },
    {
      "indent": 3,
      "text": "Phone: +86-25-56625375 Email: liyizhou@huawei.com",
      "ja": "電話：+ 86-25-56625375 Eメール：liyizhou@huawei.com"
    },
    {
      "indent": 3,
      "text": "Andrew Qu MediaTec",
      "ja": "アンドリュー・屈原MediaTec"
    },
    {
      "indent": 3,
      "text": "Email: laodulaodu@gmail.com",
      "ja": "メール：laodulaodu@gmail.com"
    },
    {
      "indent": 3,
      "text": "Muhammad Durrani Equinix Inc.",
      "ja": "ムハンマドドゥッラーニーエクイニクス株式会社"
    },
    {
      "indent": 3,
      "text": "Email: mdurrani@equinix.com",
      "ja": "メール：mdurrani@equinix.com"
    },
    {
      "indent": 3,
      "text": "Ponkarthick Sivamurugan IP Infusion RMZ Centennial Mahadevapura Post Bangalore 560048",
      "ja": "センテニアルホテルポスト、バンガロール560048 mahadevapura sivamerugan ponkartikリップimphusin"
    },
    {
      "indent": 3,
      "text": "Email: Ponkarthick.sivamurugan@ipinfusion.com",
      "ja": "メール：Ponkarthick.sivamurugan@ipinfusion.com"
    }
  ]
}