{
  "title": {
    "text": "RFC 7922 - Interface to the Routing System (I2RS) Traceability: Framework and Information Model",
    "ja": "RFC 7922 - ルーティングシステム（I2RS）トレーサビリティへのインタフェース：フレームワークおよび情報モデル"
  },
  "number": 7922,
  "created_at": "2019-11-01 23:14:09.924620+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         J. Clarke\nRequest for Comments: 7922                                  G. Salgueiro\nCategory: Informational                                     C. Pignataro\nISSN: 2070-1721                                                    Cisco\n                                                               June 2016",
      "raw": true
    },
    {
      "indent": 13,
      "text": "    Interface to the Routing System (I2RS)\nTraceability: Framework and Information Model",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a framework for traceability in the Interface to the Routing System (I2RS) and the information model for that framework. It specifies the motivation, requirements, and use cases, and defines an information model for recording interactions between elements implementing the I2RS protocol. This framework provides a consistent tracing interface for components implementing the I2RS architecture to record what was done, by which component, and when. It aims to improve the management of I2RS implementations, and can be used for troubleshooting, auditing, forensics, and accounting purposes.",
      "ja": "この文書では、ルーティングシステム（I2RS）とそのフレームワークのための情報モデルへのインタフェースにおけるトレーサビリティのためのフレームワークを記述する。これは、モチベーション、要件、ユースケースを特定し、I2RSプロトコルを実装する要素間の記録の相互作用のための情報モデルを定義します。このフレームワークは、コンポーネント、および場合により、行われたものを記録するI2RSアーキテクチャを実装するコンポーネントの一貫した追跡インタフェースを提供します。それはI2RS実装の管理を改善することを目指し、トラブルシューティング、監査、フォレンジック、および会計目的のために使用することができます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7922.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7922で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Terminology and Conventions .....................................3\n3. Motivation ......................................................4\n4. Use Cases .......................................................4\n5. Information Model ...............................................5\n   5.1. I2RS Traceability Framework ................................5\n   5.2. I2RS Trace Log Fields ......................................7\n   5.3. End of Message Marker .....................................11\n6. Examples .......................................................11\n7. Operational Guidance ...........................................11\n   7.1. Trace Log Creation ........................................12\n   7.2. Trace Log Temporary Storage ...............................12\n   7.3. Trace Log Rotation ........................................13\n   7.4. Trace Log Retrieval .......................................13\n        7.4.1. Retrieval via Syslog ...............................14\n        7.4.2. Retrieval via I2RS Information Collection ..........14\n        7.4.3. Retrieval via I2RS Pub/Sub .........................14\n8. Security Considerations ........................................15\n9. References .....................................................16\n   9.1. Normative References ......................................16\n   9.2. Informative References ....................................16\nAcknowledgments ...................................................17\nAuthors' Addresses ................................................17",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The architecture for the Interface to the Routing System [RFC7921] specifies that I2RS clients wishing to retrieve or change the routing state on a routing element MUST authenticate to an I2RS agent. The I2RS client will have a unique identity it provides for authentication, and should provide another opaque identity for applications communicating through it. The programming of routing state will produce a return code containing the results of the specified operation and associated reason(s) for the result. All of this is critical information to be used for understanding the history of I2RS interactions.",
      "ja": "ルーティングシステム[RFC7921]へのインタフェースのためのアーキテクチャは、ルーティング要素のルーティング状態を取得したり、変更したいI2RSクライアントはI2RSエージェントに認証しなければいけないことを指定します。 I2RSクライアントは、認証を提供ユニークなアイデンティティを持つことになりますし、それを介して通信するアプリケーションのための別の不透明なアイデンティティを提供する必要があります。ルーティング状態のプログラミングは、結果のために指定された操作の結果と関連した理由（複数可）を含有するリターンコードを生成します。このすべてがI2RS相互作用の歴史を理解するために使用される重要な情報です。"
    },
    {
      "indent": 3,
      "text": "This document defines the framework necessary to trace those interactions between the I2RS client and I2RS agent. It goes on to describe use cases for traceability within I2RS. Based on these use cases, the document proposes an information model and reporting requirements to provide for effective recording of I2RS interactions. In this context, effective troubleshooting means being able to identify what operation was performed by a specific I2RS client via the I2RS agent, what was the result of the operation, and when that operation was performed.",
      "ja": "この文書では、I2RSクライアントとI2RSエージェント間のそれらの相互作用を追跡するために必要なフレームワークを定義します。それはI2RS内のトレーサビリティのためのユースケースを記述するために行きます。これらのユースケースに基づいて、文書は情報モデルを提案し、I2RS相互作用の効果的な記録を提供するための要件を報告します。この文脈において、効果的なトラブルシューティング操作の結果、およびときに操作が行われた何であったか、I2RS剤を介して特定I2RSクライアントによって行われたもの操作を識別することができることを意味します。"
    },
    {
      "indent": 0,
      "text": "2. Terminology and Conventions",
      "section_title": true,
      "ja": "2.用語と表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "The architecture specification for I2RS [RFC7921] defines additional terms used in this document that are specific to the I2RS domain, such as \"I2RS agent\", \"I2RS client\", etc. The reader is expected to be familiar with the terminology and concepts defined in [RFC7921].",
      "ja": "I2RSためのアーキテクチャ仕様[RFC7921]は、読者が定義された用語と概念に精通していることが予想されるなど、「I2RS剤」、「I2RSクライアント」として、I2RSドメインに特異的であり、本書で使用される追加の用語を定義します[RFC7921]インチ"
    },
    {
      "indent": 0,
      "text": "3. Motivation",
      "section_title": true,
      "ja": "3.動機"
    },
    {
      "indent": 3,
      "text": "As networks scale and policy becomes an increasingly important part of the control plane that creates and maintains the forwarding state, operational complexity increases as well. I2RS offers more granular and coherent control over policy and control-plane state, but it also removes or reduces the locality of the policy that has been applied to the control plane at any individual forwarding device. The ability to automate and abstract even complex policy-based controls highlights the need for an equally scalable traceability function to provide recording at event-level granularity of the evolution of the routing system compliant with the requirements of I2RS (Section 5 of [RFC7920]).",
      "ja": "ネットワークの規模とポリシーが転送状態を作成し、維持し、制御プレーンのますます重要な部分になるように、操作の複雑さも増大します。 I2RSポリシーおよびコントロールプレーンの状態をより詳細コヒーレント制御を提供し、それはまた、任意の個々の中継装置の制御プレーンに適用されたポリシーの局所性を除去または低減します。複雑なポリシーベースの制御を自動化し、抽象化する能力はI2RSの要件に準拠ルーティングシステム（[RFC7920]のセクション5）の進化のイベントレベルの粒度で記録を提供することに等しく、スケーラブルなトレーサビリティ機能の必要性を強調します。"
    },
    {
      "indent": 0,
      "text": "4. Use Cases",
      "section_title": true,
      "ja": "4.ユースケース"
    },
    {
      "indent": 3,
      "text": "An obvious motivation for I2RS traceability is the need to troubleshoot and identify root causes of problems in these increasingly complex routing systems. For example, since I2RS is a high-throughput multi-channel, full duplex, and highly responsive interface, I2RS clients may be performing a large number of operations on I2RS agents concurrently or at nearly the same time and quite possibly in very rapid succession. As these many changes are made, the network reacts accordingly. These changes might lead to a race condition, performance issues, data loss, or disruption of services. In order to isolate the root cause of these issues, it is critical that a network operator or administrator has visibility into what changes were made via I2RS at a specific time.",
      "ja": "I2RSのトレーサビリティのための明白な動機は、トラブルシューティングを行い、これらのますます複雑なルーティングシステムに問題の根本原因を特定することが必要です。 I2RSはハイスループット多チャネル、全二重、および高応答インターフェイスであるため、例えば、クライアントは、非常に迅速に連続して、同時に又はほぼ同時にかつ恐らくI2RS剤の操作の多くを実行することができるI2RS。これらの多くの変更が行われると、ネットワークはそれに応じて反応します。これらの変更は、競合状態、パフォーマンスの問題、データの損失、またはサービスの中断につながる可能性があります。これらの問題の根本原因を特定するためには、ネットワークオペレータや管理者が特定の時間にI2RSを経由して行われたどのような変更の可視性を持っていることが重要です。"
    },
    {
      "indent": 3,
      "text": "Some network environments have strong auditing requirements for configuration and runtime changes. Other environments have policies that require saving logging information for operational or regulatory compliance considerations. These requirements therefore demand that I2RS provides an account of changes made to network element routing systems.",
      "ja": "一部のネットワーク環境では、コンフィギュレーションと実行時の変更のための強力な監査要件を持っています。他の環境では、運用や規制コンプライアンスを考慮してログ情報を保存する必要がポリシーを持っています。これらの要件は、それゆえI2RS要素ルーティングシステムをネットワークに加えられた変更のアカウントを提供することを要求します。"
    },
    {
      "indent": 3,
      "text": "As I2RS becomes increasingly pervasive in routing environments, a traceability model that supports controllable trace log retention using a standardized structured data format offers significant advantages, such as the ability to create common tools supporting automated testing, and facilitates the following use cases: o real-time monitoring and troubleshooting of router events;",
      "ja": "I2RSがルーティング環境でますます普及に伴い、標準化された構造化データ・フォーマットを使用して制御可能なトレースログの保持をサポートトレーサビリティモデルは、このような自動テストをサポートしている共通のツールを作成する機能などの重要な利点を提供していますし、次の使用例を容易にします。o実ルーター・イベントのリアルタイム監視とトラブルシューティング。"
    },
    {
      "indent": 3,
      "text": "o automated event correlation, trend analysis, and anomaly detection;",
      "ja": "O自動化されたイベント相関、トレンド分析、および異常検出。"
    },
    {
      "indent": 3,
      "text": "o offline (manual or tools-based) analysis of router state evolution from the retained trace logs;",
      "ja": "Oをオフライン（手動または工具ベース）保有トレースログからルータの状態進化の分析。"
    },
    {
      "indent": 3,
      "text": "o enhanced network audit, management, and forensic analysis capabilities;",
      "ja": "O拡張ネットワーク監査、管理、および法医学的分析機能。"
    },
    {
      "indent": 3,
      "text": "o improved accounting of routing system operations; and",
      "ja": "Oルーティングシステム動作のアカウンティングを改善し、そして"
    },
    {
      "indent": 3,
      "text": "o providing a standardized format for incident reporting and test logging.",
      "ja": "インシデントレポートおよびテストログの標準フォーマットを提供O。"
    },
    {
      "indent": 0,
      "text": "5. Information Model",
      "section_title": true,
      "ja": "5.情報​​モデル"
    },
    {
      "indent": 3,
      "text": "These sections describe the I2RS traceability information model and the details about each of the fields to be logged.",
      "ja": "ここでは、I2RSのトレーサビリティ情報のモデルを記述し、各フィールドについての詳細は、ログに記録されます。"
    },
    {
      "indent": 0,
      "text": "5.1. I2RS Traceability Framework",
      "section_title": true,
      "ja": "5.1.  I2RSトレーサビリティ体制"
    },
    {
      "indent": 3,
      "text": "This section describes a framework for I2RS traceability based on the I2RS Architecture.",
      "ja": "このセクションでは、I2RSアーキテクチャに基づいてI2RSのトレーサビリティのためのフレームワークについて説明します。"
    },
    {
      "indent": 3,
      "text": "The interaction between the optional network application that drives client activity, I2RS client, I2RS agent, the Routing System, and the data captured in the I2RS trace log is shown in Figure 1.",
      "ja": "クライアントのアクティビティを駆動するオプションのネットワークアプリケーション間の相互作用は、I2RSクライアント、I2RS剤、ルーティングシステム、及びI2RSトレースログに取り込まれたデータは、図1に示されています。"
    },
    {
      "indent": 3,
      "text": "           +---------------+\n      +----------------+   |\n      |Application     |   |\n      |..............  |   |  0 or more Applications\n      | Application ID |   +\n      +----------------+\n             ^\n             |\n             |\n             v\n          +-------------+\n      +-------------+   |\n      |I2RS Client  |   |\n      |.............|   |  1 or more Clients\n      |  Client ID  |   +\n      +-------------+\n             ^\n             |\n             |\n             v\n      +-------------+                 +-----------------------------+\n      |I2RS Agent   |---------------->|Trace Log                    |\n      |             |                 |.............................|\n      +-------------+                 |Log Entry  [1 .. N]          |\n            |  ^                      |.............................|\n            |  |                      |Event ID                     |\n            |  |                      |Starting Timestamp           |\n            |  |                      |Request State                |\n            |  |                      |Client ID                    |\n            |  |                      |Client Priority              |\n            |  |                      |Secondary ID                 |\nOperation + |  | Result Code          |Client Address               |\n Op Data    |  |                      |Requested Operation          |\n            |  |                      |Applied Operation            |\n            |  |                      |Operation Data Present       |\n            |  |                      |Requested Operation Data     |\n            |  |                      |Applied Operation Data       |\n            |  |                      |Transaction ID               |\n            |  |                      |Result Code                  |\n            |  |                      |Ending Timestamp             |\n            |  |                      |Timeout Occurred             |\n            v  |                      |End Of Message               |\n      +-------------+                 +-----------------------------+\n      |Routing      |\n      |System       |\n      +-------------+",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 1: I2RS Interaction Trace Log Capture",
      "ja": "図1：I2RSインタラクショントレースログキャプチャ"
    },
    {
      "indent": 0,
      "text": "5.2. I2RS Trace Log Fields",
      "section_title": true,
      "ja": "5.2.  I2RSトレースログのフィールド"
    },
    {
      "indent": 3,
      "text": "The following fields comprise an I2RS trace log. These fields ensure that each I2RS interaction can be properly traced back to the client that made the request at a specific point in time.",
      "ja": "次のフィールドはI2RSトレースログを構成します。これらのフィールドは、各I2RS相互作用が適切に特定の時点で要求を行ったクライアントにさかのぼることができることを確認してください。"
    },
    {
      "indent": 3,
      "text": "The list below describes the fields captured in the I2RS trace log. This list represents a common set of fields that MUST appear in all I2RS trace logs. In addition to these fields, I2RS agent implementations MAY choose to log additional fields such as I2RS client vendor or agent statistics like free memory, performance metrics, etc.",
      "ja": "以下のリストは、I2RSトレースログに記録されるフィールドについて説明します。このリストは、すべてのI2RSトレースログに表示しなければならない分野の共通セットを表します。これらの分野に加えて、I2RSエージェントの実装は、空きメモリ、パフォーマンスメトリック、などなどのI2RSクライアントベンダーまたはエージェント統計などの追加のフィールドをログに記録するのを選ぶかもしれ"
    },
    {
      "indent": 3,
      "text": "Event ID: This is a unique identifier for each event in the I2RS trace log. An event can be a client authenticating with the agent, a client to agent operation, or a client disconnecting from an agent. Operation events can either be logged atomically upon completion (in which case they will have both a Starting and an Ending Timestamp field) or they can be logged at the beginning of each Request State transition. Since operations can occur from the same client at the same time, it is important to have an identifier that can be unambiguously associated to a specific entry. If each state transition is logged for an operation, the same ID MUST be used for each of the Request State log entries. In this way, the life of a request can be easily followed in the I2RS trace log. Beyond the requirement that the Event ID MUST be unique for each event, the specific type and value is left up to the implementation.",
      "ja": "イベントID：これはI2RSトレースログ内の各イベントの一意の識別子です。イベントは、エージェントの操作、またはエージェントから切断するクライアントにエージェントを使用して認証クライアント、クライアントになることができます。操作イベントは、いずれかの完了時にアトミックにログインすることができる（これらは開始と終了のタイムスタンプフィールドの両方を持っている場合）、またはそれらは、各リクエストの状態遷移の開始時に記録されることができます。操作が同時に同じクライアントから発生する可能性がありますので、明確に特定のエントリに関連させることができる識別子を持つことが重要です。各状態遷移を操作するためにログインしている場合、同じIDは、要求状態ログエントリの各々のために使用されなければなりません。このように、要求の人生は簡単にI2RSトレースログに続くことができます。イベントIDは、イベントごとに固有のものでなければならないという要件を超えて、特定の型と値は実装に任されています。"
    },
    {
      "indent": 3,
      "text": "Starting Timestamp: The specific time at which the I2RS operation enters the specified Request State within the agent. If the log entry covers the entire duration of the request, then this will be the time that it was first received by the agent. This field MUST be present in all entries that specify the beginning of the state transition, as well as those entries that log the entire duration of the request. The time is passed in the full timestamp format [RFC3339], including the date and offset from Coordinated Universal Time (UTC). Given that many I2RS operations can occur in rapid succession, the fractional seconds element of the timestamp MUST be used to provide adequate granularity. Fractional seconds SHOULD be expressed with at least three significant digits in second.microsecond format.",
      "ja": "開始タイムスタンプ：I2RS操作はエージェント内で指定された要求状態に入る時に、特定の時間。ログエントリは、要求の全期間をカバーしている場合、これは最初のエージェントが受信した時刻となります。このフィールドには、状態遷移の始まりを指定するすべてのエントリと同様に、要求の全期間のログを記録するエントリ中に存在しなければなりません。時刻は、日付を含む完全なタイムスタンプ形式[RFC3339]に渡され、協定世界時（UTC）からオフセットされています。多くのI2RS操作が矢継ぎ早に発生する可能性があることを考えると、タイムスタンプの小数秒要素は十分な精度を提供するために使用されなければなりません。秒の小数部はsecond.microsecond形式で少なくとも3桁で表現されるべきです。"
    },
    {
      "indent": 3,
      "text": "Request State: The state of the given operation within the I2RS agent state machine at the specified Starting or Ending Timestamps. The I2RS agent SHOULD generate a log entry at the moment a request enters and exits a state. Upon entering a new state, the log entry will have a Starting Timestamp set to the time of entry and no Ending Timestamp. Upon exiting a state, the log entry will have an Ending Timestamp set to the time of exit and no Starting Timestamp. The progression of the request through its various states can be linked using the Event ID. The states can be one of the following values:",
      "ja": "要求状態：指定された開始時I2RSエージェント状態マシン内の所定の動作状態や終了タイムスタンプ。 I2RSエージェントは、要求が入り、状態を終了時点のログエントリを生成する必要があります。新しい状態に入ると、ログエントリは、エントリの時間なし終了タイムスタンプに設定開始タイムスタンプを持つことになります。状態を出ると、ログエントリが出ると、出発タイムスタンプの時刻に終了タイムスタンプが設定されています。そのさまざまな状態によるリクエストの進行は、イベントIDを使用してリンクすることができます。状態は次の値のいずれかになります。"
    },
    {
      "indent": 9,
      "text": "PENDING: The request has been received and queued for\nprocessing.",
      "raw": true
    },
    {
      "indent": 9,
      "text": "IN PROCESS: The request is currently being handled by the I2RS agent.",
      "ja": "プロセス内：要求は現在I2RSエージェントによって処理されています。"
    },
    {
      "indent": 9,
      "text": "COMPLETED: The request has reached a terminal point.",
      "ja": "COMPLETED：要求が終点に達しています。"
    },
    {
      "indent": 6,
      "text": "Every state transition SHOULD be logged unless doing so will put an undue performance burden on the I2RS agent. However, an entry with the Request State set to COMPLETED MUST be logged for all operations. If the COMPLETED state is the only entry for a given request, then it MUST have both Starting and Ending Timestamps that cover the entire duration of the request from ingress to the agent until completion.",
      "ja": "そうすることI2RSエージェントに過度のパフォーマンス負担をかけますしない限り、すべての状態遷移は、ログインする必要があります。ただし、COMPLETEDに設定要求状態のエントリは、すべての操作のためにログインする必要があります。完成状態が所定の要求のための唯一のエントリである場合、それが完了するまで、入口からエージェントへの要求の全期間をカバーする両方の開始と終了のタイムスタンプを持たなければなりません。"
    },
    {
      "indent": 3,
      "text": "Client Identity: The I2RS client identity used to authenticate the client to the I2RS agent.",
      "ja": "クライアントID：I2RSエージェントにクライアントを認証するために使用さI2RSのクライアントID。"
    },
    {
      "indent": 3,
      "text": "Client Priority: The I2RS client priority assigned by the access control model that authenticates the client. For example, this can be set by the Network Configuration Protocol (NETCONF) Access Control Model (NACM) as described in [RFC6536].",
      "ja": "クライアントの優先度：クライアントを認証アクセス制御モデルによって割り当てられI2RSクライアントの優先順位。 [RFC6536]に記載されているように、例えば、これは、ネットワーク構成プロトコル（NETCONF）アクセス制御モデル（NACM）によって設定することができます。"
    },
    {
      "indent": 3,
      "text": "Secondary Identity: This is an opaque identity that may be known to the client from a controlling network application. This is used to trace the network application driving the actions of the client. The client may not provide this identity to the agent if there is no external network application driving the client. However, this field MUST be logged even if the client does not provide a Secondary Identity. In that case, the field will be logged with an empty value.",
      "ja": "セカンダリアイデンティティ：これは、ネットワーク制御アプリケーションからクライアントに知られる不透明なアイデンティティです。これは、クライアントの行動を駆動するネットワークアプリケーションをトレースするために使用されます。クライアントを駆動する外部ネットワークアプリケーションが存在しない場合、クライアントは、エージェントにこのIDを提供することはできません。しかし、このフィールドは、クライアントがセカンダリアイデンティティを提供していない場合でも、ログインする必要があります。その場合には、フィールドが空の値で記録されます。"
    },
    {
      "indent": 3,
      "text": "Client Address: This is the network address of the client that connected to the agent. For example, this may be an IPv4 or an IPv6 address.",
      "ja": "クライアントアドレス：これは、エージェントに接続されたクライアントのネットワークアドレスです。例えば、これは、IPv4またはIPv6アドレスであってもよいです。"
    },
    {
      "indent": 3,
      "text": "Requested Operation: This is the I2RS operation that was requested to be performed. For example, this may be an add route operation if a route is being inserted into a routing table. This may not be the operation that was actually applied to the agent.",
      "ja": "要求された操作：これを行うことが要求されたI2RS操作です。ルートは、ルーティングテーブルに挿入されている場合、例えば、これは、追加ルート操作であってもよいです。これは、実際にエージェントに適用された操作ではないかもしれません。"
    },
    {
      "indent": 6,
      "text": "In the case of a client authenticating to the agent, the Requested Operation MUST be \"CLIENT AUTHENTICATE\". In the case of a client disconnecting from the agent, the Requested Operation MUST be \"CLIENT DISCONNECT\".",
      "ja": "エージェントへの認証クライアントの場合は、要求された操作は、「クライアント認証」でなければなりません。エージェントから切断するクライアントの場合は、要求された操作は、「クライアントDISCONNECT」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Applied Operation: This is the I2RS operation that was actually performed. This can differ from the Requested Operation in cases where the agent cannot satisfy the Requested Operation. This field may not be logged unless the Request State is COMPLETED.",
      "ja": "応用操作：これは実際に行われたI2RS操作です。これは、エージェントが要求された操作を満たすことができない場合には、要求された操作と異なる場合があります。要求状態が完了しない限り、このフィールドには、ログに記録されないことがあります。"
    },
    {
      "indent": 3,
      "text": "Operation Data Present: This is a Boolean field that indicates whether or not additional per-Operation Data is present.",
      "ja": "運転データの現在：これは、追加の操作ごとのデータが存在するかどうかを示すブールフィールドです。"
    },
    {
      "indent": 3,
      "text": "Requested Operation Data: This field comprises the data passed to the agent to complete the desired operation. For example, if the operation is a route add operation, the Operation Data would include the route prefix, prefix length, and next-hop information to be inserted as well as the specific routing table to which the route will be added. If Operation Data is provided, then the Operation Data Present field MUST be set to TRUE. Some operations may not provide operation data. In those cases, the Operation Data Present field MUST be set to FALSE, and this field MUST be empty. This may not represent the data that was used for the operation that was actually applied on the agent.",
      "ja": "要求された操作データ：このフィールドは、所望の動作を完了するために、エージェントに渡されたデータを含みます。動作は、経路追加操作である場合、例えば、操作データは、経路プレフィックス、プレフィックス長、およびネクストホップ情報ルートが追加される特定のルーティングテーブルと同様に挿入するを含むであろう。運転データが提供されている場合は、運転データ現在のフィールドがtrueに設定する必要があります。一部の操作は、操作データを提供することはできません。そのような場合には、運転データ現在のフィールドをfalseに設定する必要があり、このフィールドは空でなければなりません。これは実際にエージェントに適用された操作のために使用されたデータを表していてもよいです。"
    },
    {
      "indent": 6,
      "text": "When a client authenticates to the agent, the Requested Operation Data MUST contain the client priority. Other attributes such as credentials used for authentication MAY be logged.",
      "ja": "クライアントがエージェントに認証されると、要求された操作データは、クライアントの優先順位を含まなければなりません。そのような認証に使用する資格情報などの他の属性が記録されることがあります。"
    },
    {
      "indent": 3,
      "text": "Applied Operation Data: This field comprises the data that was actually applied as part of the Applied Operation. If the agent cannot satisfy the Requested Operation with the Requested Operation Data, then this field can differ from the Requested Operation Data. This field will be empty unless the Requested Operation Data was specified. This field may not be logged unless the Request State is COMPLETED.",
      "ja": "応用操作データ：このフィールドは、実際に応用操作の一部として適用されたデータを備えます。エージェントは、要求された操作データと要求された操作を満たすことができない場合は、このフィールドは、要求された操作データと異なることがあります。要求された操作データが指定されていない限り、このフィールドは空になります。要求状態が完了しない限り、このフィールドには、ログに記録されないことがあります。"
    },
    {
      "indent": 3,
      "text": "Transaction ID: The Transaction Identity represents that this particular operation is part of a long-running I2RS transaction that can consist of multiple, related I2RS operations. Using this value, one can relate multiple log entries together as they are part of a single, overall I2RS operation. This is an optional field that may not be logged unless the event is part of a long-running transaction.",
      "ja": "トランザクションID：トランザクションIDが、この特定の操作は、複数の、関連I2RS操作からなることができる長期実行I2RSトランザクションの一部であることを表しています。それらは単一の、全体I2RS動作の一部であるとしてこの値を使用して、一方が一緒に複数のログエントリを関連付けることができます。これは、イベントが長時間トランザクションの一部でない限り、ログに記録されないことがあり、オプションのフィールドです。"
    },
    {
      "indent": 3,
      "text": "Result Code: This field holds the result of the operation once the Request State is COMPLETED. In the case of Routing Information Base (RIB) operations, this MUST be the return code as specified in Section 4 of [RIBINFO]. The operation may not complete with a result code in the case of a timeout. If the operation fails to complete, it MUST still log the attempted operation with an appropriate result code.",
      "ja": "結果コード：要求状態が完了すると、このフィールドには、操作の結果を保持しています。 【RIBINFO]のセクション4で指定されるようにルーティング情報ベース（RIB）操作の場合、これはリターンコードでなければなりません。操作はタイムアウトした場合の結果コードで完了しないかもしれません。操作が完了するまでに失敗した場合、それはまだ適切な結果コードを実行しようとした操作をログに記録しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Timeout Occurred: This is a Boolean field that indicates whether or not a timeout occurred in the operation. When this is true, the value of the Ending Timestamp MUST be set to the time the agent recorded for the timeout occurrence. This field may not be logged unless the Request State is COMPLETED.",
      "ja": "タイムアウトが発生しました：これは、タイムアウトが運転中に発生したかどうかを示すブールフィールドです。これがtrueの場合、終了タイムスタンプの値は、エージェントがタイムアウト発生のために記録した時間に設定しなければなりません。要求状態が完了しない限り、このフィールドには、ログに記録されないことがあります。"
    },
    {
      "indent": 3,
      "text": "Ending Timestamp: The specific time at which the I2RS operation exits the specified Request State within the I2RS agent. If the log entry covers the entire duration of the request, then this will be the time that the request reached a terminal point within the agent. This field MUST be present in all entries that specify the ending of the state transition, as well as those entries that log the entire duration of the request. The time is passed in the full timestamp format [RFC3339], including the date and offset from Coordinated Universal Time (UTC). See the description for Starting Timestamp above for the proper format of the Ending Timestamp.",
      "ja": "エンディングタイムスタンプ：I2RS操作はI2RSエージェント内で指定された要求状態を出る時に、特定の時間。ログエントリは、要求の全期間をカバーしている場合、この要求は、エージェント内の終点に到達した時間になります。このフィールドは、状態遷移の終了、ならびに要求の全体の持続時間を記録それらのエントリを指定するすべてのエントリに存在していなければなりません。時刻は、日付を含む完全なタイムスタンプ形式[RFC3339]に渡され、協定世界時（UTC）からオフセットされています。エンディングタイムスタンプの適切なフォーマットのために上のタイムスタンプを起動するための説明を参照してください。"
    },
    {
      "indent": 3,
      "text": "End Of Message: Each log entry SHOULD have an appropriate End Of Message (EOM) indicator. See Section 5.3 below for more details.",
      "ja": "メッセージの最後：各ログエントリには、メッセージ（EOM）標識の適切な終了を持っているべきです。詳細については、以下の5.3節を参照してください。"
    },
    {
      "indent": 0,
      "text": "5.3. End of Message Marker",
      "section_title": true,
      "ja": "5.3. メッセージマーカーの終わり"
    },
    {
      "indent": 3,
      "text": "Because of variability within I2RS trace log fields, implementors MUST use a format-appropriate End Of Message (EOM) indicator in order to signify the end of a particular record. That is, regardless of format, the I2RS trace log MUST provide a distinct way of distinguishing between the end of one record and the beginning of another. For example, in a linear-formatted log (similar to a syslog) the EOM marker may be a newline character. In an XML-formatted log, the schema would provide for element tags that denote the beginning and end of records. In a JSON-formatted log, the syntax would provide record separation (likely by comma-separated array elements).",
      "ja": "なぜならI2RSトレース・ログ・フィールド内の変動のため、実装は、特定のレコードの終わりを意味するために、メッセージ（EOM）インジケータのフォーマット、適切なエンドを使用しなければなりません。これは、形式にかかわらず、I2RSトレースログは、1つのレコードの終わりと他の始まりを区別する明確な方法を提供する必要がありますされています。たとえば、線形形式のログ（syslogに類似）でEOMマーカーは改行文字であってもよいです。 XML形式のログでは、スキーマは、レコードの始まりと終わりを表す要素タグを提供するでしょう。 JSON形式のログでは、構文は、（カンマで区切られた配列要素による可能性が高い）レコード分離を提供するであろう。"
    },
    {
      "indent": 0,
      "text": "6. Examples",
      "section_title": true,
      "ja": "6.例"
    },
    {
      "indent": 3,
      "text": "This section shows a sample of what the fields and values could look like.",
      "ja": "このセクションでは、フィールドと値がどのように見えることができるものの例を示します。"
    },
    {
      "indent": 3,
      "text": "Event ID: 1 Starting Timestamp: 2013-09-03T12:00:01.21+00:00 Request State: COMPLETED Client ID: 5CEF1870-0326-11E2-A21F-0800200C9A66 Client Priority: 100 Secondary ID: com.example.RoutingApp Client Address: 2001:db8:c0c0::2 Requested Operation: ROUTE_ADD Applied Operation: ROUTE_ADD Operation Data Present: TRUE Requested Operation Data: PREFIX 2001:db8:feed:: PREFIX-LEN 64 NEXT-HOP 2001:db8:cafe::1 Applied Operation Data: PREFIX 2001:db8:feed:: PREFIX-LEN 64 NEXT-HOP 2001:db8:cafe::1 Transaction ID: 2763461 Result Code: SUCCESS(0) Timeout Occurred: FALSE Ending Timestamp: 2013-09-03T12:00:01.23+00:00",
      "ja": "イベントID：1の開始タイムスタンプ：2013-09-03T12：00：01.21 + 00：00の要求状態：完了したクライアントID：5CEF1870-0326-11E2-A21F-0800200C9A66クライアントの優先順位：100セカンダリID：com.example.RoutingAppのクライアントアドレス：2001：DB8：c0c0 :: 2要求された操作：ROUTE_ADD応用操作：ROUTE_ADD操作データ現在：TRUE要求された操作データ：PREFIX 2001：DB8：フィード:: PREFIX-LEN 64次ホップ2001：DB8：カフェ:: 1アプライド運転データ：PREFIX 2001：DB8：フィード:: PREFIX-LEN 64 NEXT-HOP 2001：DB8：カフェ:: 1トランザクションID：2763461結果コードは：SUCCESS（0）タイムアウトが発生しました：タイムスタンプを終了FALSE：2013-09-03T12を： 00：01.23 + 00：00"
    },
    {
      "indent": 0,
      "text": "7. Operational Guidance",
      "section_title": true,
      "ja": "7.操作ガイダンス"
    },
    {
      "indent": 3,
      "text": "Specific operational procedures regarding temporary log storage, rollover, retrieval, and access of I2RS trace logs is out of scope for this document. Organizations employing I2RS trace logging are responsible for establishing proper operational procedures that are appropriately suited to their specific requirements and operating environment. In this section, we only provide fundamental and generalized operational guidelines that are implementation independent.",
      "ja": "一時的なログ保存、ロールオーバー、検索、およびI2RSトレースログのアクセスに関する具体的な操作手順はこの文書の範囲外です。 I2RSトレースログを使用する組織は、特定の要件と動作環境に適切に適しており、適切な操作手順を確立する責任があります。このセクションでは、我々は唯一の実装に依存している基本的かつ一般的な運用ガイドラインを提供します。"
    },
    {
      "indent": 0,
      "text": "7.1. Trace Log Creation",
      "section_title": true,
      "ja": "7.1. トレースログの作成"
    },
    {
      "indent": 3,
      "text": "The I2RS agent interacts with the Routing and Signaling functions of the Routing Element. Since the I2RS agent is responsible for actually making the routing changes on the associated network device, it creates and maintains a log of operations that can be retrieved to troubleshoot I2RS-related impact to the network. Changes that occur to the network element's local configuration outside of the I2RS protocol that preempt I2RS state will only be logged if the network element notifies the I2RS agent.",
      "ja": "I2RSエージェントは、ルーティング要素のルーティングとシグナリング機能と相互作用します。 I2RS剤が実際に関連付けられたネットワークデバイスにルーティング変更を行う責任があるので、それが作成され、ネットワークへI2RS関連の影響をトラブルシューティングするために取得することができるオペレーションのログを維持します。ネットワーク要素がI2RSエージェントを通知した場合I2RS状態を先取りI2RSプロトコルの外のネットワーク要素のローカル設定に発生した変更のみが記録されます。"
    },
    {
      "indent": 0,
      "text": "7.2. Trace Log Temporary Storage",
      "section_title": true,
      "ja": "7.2. トレースログの一時保管"
    },
    {
      "indent": 3,
      "text": "The trace information may be temporarily stored either in an in-memory buffer or as a file local to the agent. Care should be given to the number of I2RS operations expected on a given agent so that the appropriate storage medium is used, and to maximize the effectiveness of the log while not impacting the performance and health of the agent. client requests may not always be processed synchronously or within a bounded time period. Consequently, to ensure that trace log fields, such as \"Operation\" and \"Result Code\", are part of the same trace log record, buffering of the trace log entries may be required. This buffering may result in additional resource load on the agent and the network element.",
      "ja": "トレース情報を一時的にメモリバッファまたはエージェントにローカルファイルとしてのいずれかで格納することができます。ケアは、適切な記憶媒体が使用され、エージェントのパフォーマンスと健康に影響を与えずにログの有効性を最大限にするように、与えられた薬に期待I2RS操作の数に与えられるべきです。クライアント要求は常に同期的または限定された時間内に処理されない場合があります。したがって、このような「操作」としてそのトレースログフィールドを確保し、「コードの結果」、同じトレースログレコードの一部であるために、トレースログエントリのバッファリングが必要になることがあります。このバッファリングは、エージェントとネットワーク要素の追加リソース負荷をもたらすことができます。"
    },
    {
      "indent": 3,
      "text": "Section 7.3 discusses rotating the trace log in order to preserve the operation history without exhausting agent or network device resources. It is perfectly acceptable, therefore, to use both an in-memory buffer for recent operations while rotating or archiving older operations to a local file.",
      "ja": "7.3節では、エージェントやネットワークデバイスのリソースを消耗することなく、操作履歴を保存するために、トレースログを回転さについて説明します。これは、回転またはローカルファイルに古い操作をアーカイブしつつ、最近の操作のために、メモリバッファの両方を使用する、完全に許容可能です。"
    },
    {
      "indent": 3,
      "text": "It is outside the scope of this document to specify the implementation details (i.e., size, throughput, data protection, etc.) for the physical storage of the I2RS log file. In terms of data retention, attention should be paid to the length of time that the I2RS trace log data is kept when that data contains security- or privacy-sensitive attributes. The longer this data is retained, the higher the impact if it were to be leaked. It is also possible that legislation may impose some additional requirements on the minimum and/or maximum durations for which some kinds of data may be retained.",
      "ja": "これは、ログファイルI2RSの物理的な記憶のための実装の詳細（すなわち、サイズ、スループット、データ保護など）を指定するには、この文書の範囲外です。データ保持の観点では、注意がそのデータがセキュリティやプライバシーに敏感な属性が含まれている場合I2RSトレース・ログ・データが保持される時間の長さに支払われるべきです。長くこのデータが保持され、それが漏れたことがなかった場合の影響が高いです。法律は、データの種類によっては、保持することができるの最小及び/又は最大持続時間にいくつかの追加の要件を課すことも可能です。"
    },
    {
      "indent": 0,
      "text": "7.3. Trace Log Rotation",
      "section_title": true,
      "ja": "7.3. トレースログローテーション"
    },
    {
      "indent": 3,
      "text": "In order to prevent the exhaustion of resources on the I2RS agent or its associated network device, it is RECOMMENDED that the I2RS agent implements trace log rotation. The details on how this is achieved are left to the implementation and are outside the scope of this document. However, it should be possible to do a file rotation based on either the time or size of the current trace log. If file rollover is supported, multiple archived log files should be supported in order to maximize the troubleshooting and accounting benefits of the trace log.",
      "ja": "I2RS剤やそれに関連するネットワークデバイス上の資源の枯渇を防ぐためには、I2RSエージェントは、トレースログローテーションを実装することを推奨します。これが達成される方法の詳細は、実装に委ね、この文書の範囲外でされています。しかし、時間や現在のトレースログのサイズのいずれかに基づいてファイルのローテーションを行うことが可能であるべきです。ファイルのロールオーバーがサポートされている場合は、複数のアーカイブ・ログ・ファイルは、トレースログのトラブルシューティングと会計利益を最大にするためにサポートされる必要があります。"
    },
    {
      "indent": 0,
      "text": "7.4. Trace Log Retrieval",
      "section_title": true,
      "ja": "7.4. ログの取得をトレース"
    },
    {
      "indent": 3,
      "text": "Implementors are free to provide their own, proprietary interfaces and develop custom tools to retrieve and display the I2RS trace log. These may include the display of the I2RS trace log as command-line interface (CLI) output. However, a key intention of defining this information model is to establish a vendor-agnostic and consistent interface to collect I2RS trace data. Correspondingly, retrieval of the data should also be made vendor-agnostic.",
      "ja": "実装者は、自分の、独自のインタフェースを提供し、I2RSトレースログを取得し、表示するカスタムツールを開発するのは自由です。これらは、コマンドラインインターフェイス（CLI）出力としてI2RSトレースログの表示を含むことができます。しかし、この情報モデルを定義する主要な意図はI2RSトレースデータを収集するために、ベンダーに依存しないと一貫性のあるインタフェースを確立することです。これに対応して、データの検索も、ベンダに依存しないなされるべきです。"
    },
    {
      "indent": 3,
      "text": "Despite the fact that export of I2RS trace log information could be an invaluable diagnostic tool for off-box analysis, exporting this information MUST NOT interfere with the ability of the agent to process new incoming operations.",
      "ja": "I2RSトレースログ情報のエクスポートがオフボックスの解析のための貴重な診断ツールとなる可能性があるという事実にもかかわらず、この情報をエクスポートすると、新しい着信操作を処理する薬剤の能力を妨害してはなりません。"
    },
    {
      "indent": 3,
      "text": "The following three sections describe potential ways the trace log can be accessed. The use of I2RS pub/sub for accessing trace log data is mandatory-to-implement, while others are optional.",
      "ja": "次の3つのセクションでは、トレースログにアクセスできる可能性の方法について説明します。他はオプションですしながら、トレースログデータにアクセスするためのI2RSパブ/サブの使用は、実装に必須のです。"
    },
    {
      "indent": 0,
      "text": "7.4.1. Retrieval via Syslog",
      "section_title": true,
      "ja": "7.4.1.  Syslog経由検索"
    },
    {
      "indent": 3,
      "text": "The syslog protocol [RFC5424] is a standard way of sending event notification messages from a host to a collector. However, the protocol does not define any standard format for storing the messages, and thus implementors of I2RS tracing would be left to define their own format. So, while the data contained within the syslog message would adhere to this information model, and may be consumable by a human operator, it would not be easily parseable by a machine. Syslog MAY be employed as a means of retrieving or disseminating the I2RS trace log contents.",
      "ja": "syslogプロトコル[RFC5424]はコレクタへのホストからのイベント通知メッセージを送信する標準的な方法です。しかし、このプロトコルは、メッセージを保存するための任意の標準フォーマットを定義していないので、トレースI2RSの実装は、独自のフォーマットを定義するために残されることになります。シスログメッセージ内に含まれるデータは、この情報モデルに付着する、及び人間のオペレータによって消費可能であってもよいつつ、それは機械によって容易に解析可能ではないであろう。 syslogはI2RSトレースログの内容を検索したり発信の手段として使用することができます。"
    },
    {
      "indent": 3,
      "text": "If syslog is used for trace log retrieval, then existing logging infrastructure and capabilities of syslog [RFC5424] should be leveraged without the need to define or extend existing formats. That is, the various fields described in Section 5.2 SHOULD be modeled and encoded as Structured Data Elements (referred to as \"SD-ELEMENT\"), as described in Section 6.3.1 of [RFC5424].",
      "ja": "シスログはトレースログの取得のために使用される場合、既存のロギング・インフラストラクチャとsyslog [RFC5424]の能力は、定義したり、既存のフォーマットを拡張することなく活用されるべきです。 [RFC5424]のセクション6.3.1に記載したようにそれは、セクション5.2で説明される様々なフィールドは、モデル化されるべきであり（「SD-ELEMENT」とも呼ばれる）構造化データ要素として符号化されます。"
    },
    {
      "indent": 0,
      "text": "7.4.2. Retrieval via I2RS Information Collection",
      "section_title": true,
      "ja": "7.4.2.  I2RS情報収集を経由して検索"
    },
    {
      "indent": 3,
      "text": "Section 7.7 of the I2RS architecture [RFC7921] defines a mechanism for information collection. The information collected includes obtaining a snapshot of a large amount of data from the network element. It is the intent of I2RS to make this data available in an implementor-agnostic fashion. Therefore, the I2RS trace log SHOULD be made available via the I2RS information collection mechanism either as a single snapshot or via a subscription stream.",
      "ja": "I2RSアーキテクチャ[RFC7921]のセクション7.7は、情報収集のためのメカニズムを定義します。収集された情報は、ネットワーク要素からの大量のデータのスナップショットを得ることを含みます。実装に依存しない形で、このデータを利用できるようにするI2RSの意図です。したがって、I2RSトレースログは、単一のスナップショットとして、またはサブスクリプション・ストリームのいずれかを介しI2RS情報収集機構を介して利用できるようにすべきです。"
    },
    {
      "indent": 0,
      "text": "7.4.3. Retrieval via I2RS Pub/Sub",
      "section_title": true,
      "ja": "7.4.3.  I2RSパブ/サブを介して検索"
    },
    {
      "indent": 3,
      "text": "Section 7.6 of the I2RS architecture [RFC7921] goes on to describe notification mechanisms for a feed of changes happening within the I2RS layer. Specifically, the requirements for a publish-subscribe system for I2RS are defined in [RFC7923]. I2RS agents MUST support publishing I2RS trace log information to that feed as described in [RFC7923]. Subscribers would then receive a live stream of I2RS interactions in trace log format and could flexibly choose to do a number of things with the log messages. For example, the subscribers could log the messages to a datastore, aggregate, and summarize interactions from a single client, etc. The full range of potential activities is virtually limitless and the details of how they are performed are outside the scope of this document, however.",
      "ja": "I2RSアーキテクチャ[RFC7921]のセクション7.6 I2RS層内で起こっ変更の供給のための通知メカニズムを記述するために進みます。具体的には、I2RSためのパブリッシュ・サブスクライブシステムの要件は[RFC7923]で定義されています。 I2RS剤は、[RFC7923]に記載されているように、そのフィードにI2RSトレースログ情報を公開サポートしなければなりません。加入者は、その後、トレースログ形式でI2RS相互作用のライブストリームを受け取ることになるし、柔軟にログメッセージで多くのことを行うことを選択することができます。例えば、加入者は、データストアにログメッセージを集約、およびなど、単一のクライアントからの相互作用をまとめる可能性のある潜在的な活動の完全な範囲は、実質的に無限であり、それらが実行される方法の詳細は、このドキュメントの範囲外です、しかしながら。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The I2RS trace log, like any log file, reveals the state of the entity producing it as well as the identifying information elements and detailed interactions of the system containing it. The information model described in this document does not itself introduce any security issues, but it does define the set of attributes that make up an I2RS log file. These attributes may contain sensitive information, and thus should adhere to the security, privacy, and permission policies of the organization making use of the I2RS log file.",
      "ja": "I2RSトレースログは、すべてのログファイルのように、それを製造エンティティの状態、並びに特定の情報要素とそれを含むシステムの詳細な相互作用を明らかにする。この文書に記載されている情報モデルは、それ自体は、セキュリティ上の問題を導入していないが、それはI2RSログファイルを構成する属性のセットを定義しません。これらの属性は、機密情報を含むことができ、これにより、セキュリティ、プライバシーを遵守すべきである、とI2RSを利用して、組織の権限ポリシーは、ファイルを記録します。"
    },
    {
      "indent": 3,
      "text": "It is outside the scope of this document to specify how to protect the stored log file, but it is expected that adequate precautions and security best practices such as disk encryption, appropriately restrictive file/directory permissions, suitable hardening and physical security of logging entities, mutual authentication, transport encryption, channel confidentiality, and channel integrity if transferring log files. Additionally, the potentially sensitive information contained in a log file SHOULD be adequately anonymized or obfuscated by operators to ensure its privacy.",
      "ja": "これは、保存されたログファイルを保護する方法を指定するには、この文書の範囲外であるが、それは十分な注意事項や、ディスク暗号化などのセキュリティのベストプラクティス、適切に制限するファイル/ディレクトリのパーミッションは、適切な硬化およびロギングエンティティの物理的なセキュリティと予想され、相互認証、トランスポート暗号化、チャネルの機密性、およびチャネルの整合性ログファイルを転送する場合。また、ログファイルに含まれている機密情報が適切に匿名化またはそのプライバシーを確​​保するために事業者が難読化されるべきです。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3339] Klyne, G. and C. Newman, \"Date and Time on the Internet: Timestamps\", RFC 3339, DOI 10.17487/RFC3339, July 2002, <http://www.rfc-editor.org/info/rfc3339>.",
      "ja": "[RFC3339] Klyne、G.とC.ニューマン、 \"インターネット上の日付と時刻：タイムスタンプ\"、RFC 3339、DOI 10.17487 / RFC3339、2002年7月、<http://www.rfc-editor.org/info/rfc3339 >。"
    },
    {
      "indent": 3,
      "text": "[RFC5424] Gerhards, R., \"The Syslog Protocol\", RFC 5424, DOI 10.17487/RFC5424, March 2009, <http://www.rfc-editor.org/info/rfc5424>.",
      "ja": "[RFC5424] Gerhards氏、R.、 \"Syslogのプロトコル\"、RFC 5424、DOI 10.17487 / RFC5424、2009年3月、<http://www.rfc-editor.org/info/rfc5424>。"
    },
    {
      "indent": 3,
      "text": "[RFC7921] Atlas, A., Halpern, J., Hares, S., Ward, D., and T. Nadeau, \"An Architecture for the Interface to the Routing System\", RFC 7921, DOI 10.17487/RFC7921, June 2016, <http://www.rfc-editor.org/info/rfc7921>.",
      "ja": "[RFC7921]アトラス、A.、アルペルン、J.、野兎、S.、区、D.、およびT.ナドー、 \"ルーティングシステムへのインタフェースのためのアーキテクチャ\"、RFC 7921、DOI 10.17487 / RFC7921、2016年6月、<http://www.rfc-editor.org/info/rfc7921>。"
    },
    {
      "indent": 3,
      "text": "[RFC7923] Voit, E., Clemm, A., and A. Gonzalez Prieto, \"Requirements for Subscription to YANG Datastores\", RFC 7923, DOI 10.17487/RFC7923, June 2016.",
      "ja": "[RFC7923]フォイト、E.、Clemm、A.、およびA.ゴンザレスプリエト、 \"YANGデータストアへのサブスクリプションのための要件\"、RFC 7923、DOI 10.17487 / RFC7923、2016年6月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC6536] Bierman, A. and M. Bjorklund, \"Network Configuration Protocol (NETCONF) Access Control Model\", RFC 6536, DOI 10.17487/RFC6536, March 2012, <http://www.rfc-editor.org/info/rfc6536>.",
      "ja": "[RFC6536] Bierman、A.とM. Bjorklund、 \"ネットワーク構成プロトコル（NETCONF）アクセス制御モデル\"、RFC 6536、DOI 10.17487 / RFC6536、2012年3月、<http://www.rfc-editor.org/info/ rfc6536>。"
    },
    {
      "indent": 3,
      "text": "[RFC7920] Atlas, A., Ed., Nadeau, T., Ed., and D. Ward, \"Problem Statement for the Interface to the Routing System\", RFC 7923, DOI 10.17487/RFC7923, June 2016, <http://www.rfc-editor.org/info/rfc7920>.",
      "ja": "[RFC7920]アトラス、A.、エド、ナドー、T.、エド、およびD.区、 \"ルーティングシステムへのインタフェースのための問題文\"、RFC 7923、DOI 10.17487 / RFC7923、2016年6月、<HTTP。。： //www.rfc-editor.org/info/rfc7920>。"
    },
    {
      "indent": 3,
      "text": "[RIBINFO] Bahadur, N., Ed., Kini, S., Ed., and J. Medved, \"Routing Information Base Info Model\", Work in Progress, draft-ietf-i2rs-rib-info-model-08, October 2015.",
      "ja": "[RIBINFO]バハドゥール、N.、エド。、KINI、S.、エド。、およびJ. Medved、 \"ルーティング情報ベースの情報モデル\" が進行中で働いて、ドラフト-IETF-i2rs-リブ情報モデル-08、 2015年10月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Alia Atlas for her initial feedback and overall support for this work. Additionally, the authors acknowledge Alvaro Retana, Russ White, Matt Birkner, Jeff Haas, Joel Halpern, Dean Bogdanovich, Ignas Bagdonas, Nobo Akiya, Kwang-koog Lee, Sue Hares, Mach Chen, Alex Clemm, Stephen Farrell, Benoit Claise, Les Ginsberg, Suresh Krishnan, and Elwyn Davies for their reviews, contributed text, and suggested improvements to this document.",
      "ja": "作者はこの仕事のための彼女の初期のフィードバックや全体的な支援のためのアリアアトラスに感謝したいと思います。さらに、著者はアルバロRetana、ラスホワイト、マット・バークナー、ジェフ・ハース、ジョエル・ハルパーン、ディーン・ボグダノヴィッチ、Ignas Bagdonas、NOBO秋谷、クァン・コーホリー、スー・ノウサギ、マッハチェン、アレックスClemm、スティーブン・ファレル、ブノワClaise、レを認めます彼らのレビューのためギンズバーグ、スレシュクリシュナン、およびエルウィン・デイヴィスは、テキストを寄付し、このドキュメントの改善を示唆しました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Joe Clarke Cisco Systems, Inc. 7200-12 Kit Creek Road Research Triangle Park, NC 27709 United States",
      "ja": "ジョー・クラークシスコシステムズ株式会社7200から12キットクリーク道路リサーチトライアングルパーク、ノースカロライナ州27709米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1-919-392-2867 Email: jclarke@cisco.com",
      "ja": "電話：+ 1-919-392-2867 Eメール：jclarke@cisco.com"
    },
    {
      "indent": 3,
      "text": "Gonzalo Salgueiro Cisco Systems, Inc. 7200-12 Kit Creek Road Research Triangle Park, NC 27709 United States",
      "ja": "ゴンサロSalgueiroシスコシステムズ株式会社7200から12キットクリーク道路リサーチトライアングルパーク、ノースカロライナ州27709米国"
    },
    {
      "indent": 3,
      "text": "Email: gsalguei@cisco.com",
      "ja": "メール：gsalguei@cisco.com"
    },
    {
      "indent": 3,
      "text": "Carlos Pignataro Cisco Systems, Inc. 7200-11 Kit Creek Road Research Triangle Park, NC 27709 United States",
      "ja": "カルロスPignataroシスコシステムズ株式会社7200から11キットクリーク道路リサーチトライアングルパーク、ノースカロライナ州27709米国"
    },
    {
      "indent": 3,
      "text": "Email: cpignata@cisco.com",
      "ja": "メール：cpignata@cisco.com"
    }
  ]
}