{
  "title": {
    "text": "RFC 7125 - Revision of the tcpControlBits IP Flow Information Export (IPFIX) Information Element",
    "ja": "RFC 7125 - tcpControlBits IPフロー情報エクスポート（IPFIX）情報要素の改訂"
  },
  "number": 7125,
  "created_at": "2020-09-04 08:53:06.460489+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       B. Trammell\nRequest for Comments: 7125                                    ETH Zurich\nCategory: Informational                                        P. Aitken\nISSN: 2070-1721                                       Cisco Systems, Inc\n                                                           February 2014",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": " Revision of the tcpControlBits IP Flow Information Export (IPFIX) Information Element",
      "ja": "tcpControlBits IPフロー情報エクスポート（IPFIX）情報要素の改訂"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document revises the tcpControlBits IP Flow Information Export (IPFIX) Information Element as originally defined in RFC 5102 to reflect changes to the TCP Flags header field since RFC 793.",
      "ja": "このドキュメントは、RFC 5102で最初に定義されたtcpControlBits IPフロー情報エクスポート（IPFIX）情報要素を改訂して、RFC 793以降のTCPフラグヘッダーフィールドへの変更を反映します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。 IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補になるわけではありません。 RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7125.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7125で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2014 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Octets 12 and 13 (counting from zero) of the TCP header encode the data offset (header length) in 4 bits, as well as 12 bits of flags. The least significant 6 bits of these were defined in [RFC0793] as URG, ACK, PSH, RST, SYN, and FIN for TCP control. Subsequently, [RFC3168] defined the CWR and ECE flags for Explicit Congestion Notification (ECN) negotiation and signaling; [RFC3540] additionally defined the NS flag for the ECN Nonce Sum.",
      "ja": "TCPヘッダーのオクテット12と13（ゼロからカウント）は、データオフセット（ヘッダー長）を4ビットと12ビットのフラグでエンコードします。これらの最下位6ビットは、[RFC0793]で、TCP制御用のURG、ACK、PSH、RST、SYN、およびFINとして定義されていました。その後、[RFC3168]は、明示的輻輳通知（ECN）ネゴシエーションおよびシグナリング用のCWRおよびECEフラグを定義しました。 [RFC3540]は、ECN Nonce SumのNSフラグをさらに定義しました。"
    },
    {
      "indent": 3,
      "text": "As defined in the IANA IPFIX Information Element Registry [IANA-IPFIX], taken from [RFC5102], the tcpControlBits Information Element for IPFIX [RFC7011] only covers the original 6 bits from [RFC0793]. To allow IPFIX to be used to measure the use of ECN, and to bring the IPFIX Information Element definition in line with the current definition of the TCP Flags header field, it is necessary to revise this definition.",
      "ja": "[RFC5102]から取得したIANA IPFIX情報要素レジストリ[IANA-IPFIX]で定義されているように、IPFIX [RFC7011]のtcpControlBits情報要素は、[RFC0793]の元の6ビットのみをカバーしています。 IPFIXを使用してECNの使用を測定し、IPFIX情報要素の定義をTCPフラグヘッダーフィールドの現在の定義に合わせるには、この定義を修正する必要があります。"
    },
    {
      "indent": 3,
      "text": "The revised definition of the Information Element in Section 3 was developed and approved through the IE-DOCTORS process [RFC7013] in August 2013. Section 5.1 of [RFC7013] states \"This process should not in any way be construed as allowing the IE-DOCTORS to overrule IETF consensus. Specifically, Information Elements in the IANA Information Element registry that were added with IETF consensus require IETF consensus for revision or deprecation\". Since the tcpControlBits Information Element was originally defined in [RFC5102], an IETF Proposed Standard, any revision of this Information Element definition requires IETF Consensus. The publication of this document fulfills that requirement.",
      "ja": "セクション3の情報要素の改訂された定義は、2013年8月にIE-DOCTORSプロセス[RFC7013]を通じて作成および承認されました。[RFC7013]のセクション5.1は、「このプロセスは、IE-DOCTORSを許可するように解釈されるべきではありません。特に、IETFコンセンサスで追加されたIANA情報要素レジストリの情報要素は、改訂または廃止のためにIETFコンセンサスを必要とします。」 tcpControlBits情報要素は、もともと[RFC5102]（IETF提案標準）で定義されていたため、この情報要素定義の改訂にはIETFコンセンサスが必要です。このドキュメントの公開は、その要件を満たしています。"
    },
    {
      "indent": 3,
      "text": "Section 3 defines the revised tcpControlBits Information Element as in Section 9.1 of [RFC7013].",
      "ja": "セクション3では、[RFC7013]のセクション9.1と同様に、改訂されたtcpControlBits情報要素を定義しています。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "キーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「NOT RECOMMENDED」、「MAY」、「OPTIONALこの文書の \"は、[RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. The tcpControlBits Information Element",
      "section_title": true,
      "ja": "3. tcpControlBits情報要素"
    },
    {
      "indent": 3,
      "text": "ElementId: 6",
      "ja": "ElementId：6"
    },
    {
      "indent": 3,
      "text": "Data Type: unsigned16",
      "ja": "データ型：unsigned16"
    },
    {
      "indent": 0,
      "text": " Data Type Semantics: flags Description: TCP control bits observed for the packets of this Flow. This information is encoded as a bit field; for each TCP control bit, there is a bit in this set. The bit is set to 1 if any observed packet of this Flow has the corresponding TCP control bit set to 1. The bit is cleared to 0 otherwise.",
      "ja": "データタイプセマンティクス：フラグ説明：このフローのパケットで観測されたTCP制御ビット。この情報はビットフィールドとしてエンコードされます。 TCP制御ビットごとに、このセットにビットがあります。このフローの監視対象パケットに対応するTCP制御ビットが1に設定されている場合、ビットは1に設定されます。それ以外の場合、ビットは0にクリアされます。"
    },
    {
      "indent": 6,
      "text": "The values of each bit are shown below, per the definition of the bits in the TCP header [RFC0793] [RFC3168] [RFC3540]:",
      "ja": "TCPヘッダーのビットの定義[RFC0793] [RFC3168] [RFC3540]に従って、各ビットの値を以下に示します。"
    },
    {
      "indent": 6,
      "text": " MSb                                                         LSb\n  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15\n+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+\n|               |           | N | C | E | U | A | P | R | S | F |\n|     Zero      |   Future  | S | W | C | R | C | S | S | Y | I |\n| (Data Offset) |    Use    |   | R | E | G | K | H | T | N | N |\n+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "bit    flag\nvalue  name  description\n------+-----+-------------------------------------\n0x8000       Zero (see tcpHeaderLength)\n0x4000       Zero (see tcpHeaderLength)\n0x2000       Zero (see tcpHeaderLength)\n0x1000       Zero (see tcpHeaderLength)\n0x0800       Future Use\n0x0400       Future Use\n0x0200       Future Use\n0x0100   NS  ECN Nonce Sum\n0x0080  CWR  Congestion Window Reduced\n0x0040  ECE  ECN Echo\n0x0020  URG  Urgent Pointer field significant\n0x0010  ACK  Acknowledgment field significant\n0x0008  PSH  Push Function\n0x0004  RST  Reset the connection\n0x0002  SYN  Synchronize sequence numbers\n0x0001  FIN  No more data from sender",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "As the most significant 4 bits of octets 12 and 13 (counting from zero) of the TCP header [RFC0793] are used to encode the TCP data offset (header length), the corresponding bits in this Information Element MUST be exported as zero and MUST be ignored by the collector. Use the tcpHeaderLength Information Element to encode this value.",
      "ja": "TCPヘッダー[RFC0793]のオクテット12および13の最上位4ビット（ゼロから数える）がTCPデータオフセット（ヘッダー長）のエンコードに使用されるため、この情報要素の対応するビットはゼロとしてエクスポートする必要があり、コレクターによって無視されます。この値をエンコードするには、tcpHeaderLength情報要素を使用します。"
    },
    {
      "indent": 6,
      "text": "Each of the 3 bits (0x800, 0x400, and 0x200), which are reserved for future use in [RFC0793], SHOULD be exported as observed in the TCP headers of the packets of this Flow.",
      "ja": "[RFC0793]で将来使用するために予約されている3ビット（0x800、0x400、および0x200）のそれぞれは、このフローのパケットのTCPヘッダーで観察されるようにエクスポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "If exported as a single octet with reduced-size encoding, this Information Element covers the low-order octet of this field (i.e, bits 0x80 to 0x01), omitting the ECN Nonce Sum and the three Future Use bits. A collector receiving this Information Element with reduced-size encoding must not assume anything about the content of these four bits.",
      "ja": "縮小サイズのエンコーディングを使用して単一のオクテットとしてエクスポートされる場合、この情報要素はこのフィールドの下位オクテット（ビット0x80〜0x01）をカバーし、ECNノンスサムと3つのFuture Useビットを省略します。縮小サイズのエンコードでこの情報要素を受け取るコレクターは、これらの4ビットの内容について何も想定してはなりません。"
    },
    {
      "indent": 6,
      "text": "Exporting Processes exporting this Information Element on behalf of a Metering Process that is not capable of observing any of the ECN Nonce Sum or Future Use bits SHOULD use reduced-size encoding, and only export the least significant 8 bits of this Information Element.",
      "ja": "エクスポートプロセスは、ECNノンスサムまたはフューチャーユースビットを監視できないメータリングプロセスに代わってこの情報要素をエクスポートし、縮小サイズのエンコーディングを使用して、この情報要素の最下位8ビットのみをエクスポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "Note that previous revisions of this Information Element's definition specified that the CWR and ECE bits must be exported as zero, even if observed. Collectors should therefore not assume that a value of zero for these bits in this Information Element indicates the bits were never set in the observed traffic, especially if these bits are zero in every Flow Record sent by a given exporter.",
      "ja": "この情報要素の定義の以前の改訂では、CWRおよびECEビットは、たとえ観察されたとしても、ゼロとしてエクスポートする必要があると指定されていたことに注意してください。したがって、コレクターは、この情報要素のこれらのビットの値がゼロであることを示しません。特に、特定のエクスポーターによって送信されたすべてのフローレコードでこれらのビットがゼロの場合、観測されたトラフィックにビットが設定されなかったことを示します。"
    },
    {
      "indent": 3,
      "text": "Units:",
      "ja": "単位："
    },
    {
      "indent": 3,
      "text": "Range:",
      "ja": "範囲："
    },
    {
      "indent": 3,
      "text": "References: [RFC0793] [RFC3168] [RFC3540]",
      "ja": "参照：[RFC0793] [RFC3168] [RFC3540]"
    },
    {
      "indent": 3,
      "text": "Revision: 1",
      "ja": "改訂：1"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has updated the definition of the tcpControlBits Information Element in the IANA IPFIX Information Element Registry [IANA-IPFIX] to reflect the changes in Section 3 above, setting the revision to 1 as noted, and the revision date to the date of publication of this document.",
      "ja": "IANAは、IANA IPFIX情報要素レジストリ[IANA-IPFIX]のtcpControlBits情報要素の定義を更新して、上記のセクション3の変更を反映し、改訂を上記のように1に設定し、改訂日をこの発行日に変更しました資料。"
    },
    {
      "indent": 0,
      "text": "5. Security and Privacy Considerations",
      "section_title": true,
      "ja": "5. セキュリティとプライバシーに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document changes the data type (and therefore the native size) of the tcpControlBits Information Element, from unsigned8 (1 octet) to unsigned16 (2 octets). As Exporting and Collecting Processes use the Information Element Length field in Templates, Options Templates, and specifications for reduced-size encoding where appropriate, as opposed to abstract data type sizes, for encoding and decoding Data Records, it is not expected that this will have any impact on buffer sizing during encoding and decoding. Otherwise, note that the security considerations for IPFIX [RFC7011] apply.",
      "ja": "このドキュメントは、tcpControlBits情報要素のデータ型（したがってネイティブサイズ）をunsigned8（1オクテット）からunsigned16（2オクテット）に変更します。エクスポートおよび収集プロセスは、テンプレート、オプションテンプレート、および抽象データタイプのサイズとは対照的に、縮小されたサイズのエンコードの仕様で、情報レコードの長さフィールドを使用します。エンコードおよびデコード中のバッファのサイズ変更への影響。それ以外の場合は、IPFIX [RFC7011]のセキュリティに関する考慮事項が適用されることに注意してください。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Andrew Feren, Lothar Braun, Michael Scharf, and Simon Josefsson for comments on the revised definition. This work is partially supported by the European Commission under grant agreement FP7-ICT-318627 mPlane; this does not imply endorsement by the Commission.",
      "ja": "Andrew Feren、Lothar Braun、Michael Scharf、およびSimon Josefssonに、改訂された定義に関するコメントをありがとう。この作業は、助成金契約FP7-ICT-318627 mPlaneに基づく欧州委員会によって部分的にサポートされています。これは委員会による承認を意味するものではありません。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC0793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981.",
      "ja": "[RFC0793] Postel、J。、「Transmission Control Protocol」、STD 7、RFC 793、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3168] Ramakrishnan, K., Floyd, S., and D. Black, \"The Addition of Explicit Congestion Notification (ECN) to IP\", RFC 3168, September 2001.",
      "ja": "[RFC3168]ラマクリシュナン、K。、フロイド、S。、およびD.ブラック、「IPへの明示的輻輳通知（ECN）の追加」、RFC 3168、2001年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3540] Spring, N., Wetherall, D., and D. Ely, \"Robust Explicit Congestion Notification (ECN) Signaling with Nonces\", RFC 3540, June 2003.",
      "ja": "[RFC3540] Spring、N.、Wetherall、D。、およびD. Ely、「Ronce Explicit Congestion Notification（ECN）Signaling with Nonces」、RFC 3540、2003年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC7011] Claise, B., Trammell, B., and P. Aitken, \"Specification of the IP Flow Information Export (IPFIX) Protocol for the Exchange of Flow Information\", STD 77, RFC 7011, September 2013.",
      "ja": "[RFC7011] Claise、B.、Trammell、B。、およびP. Aitken、「Specification of the IP Flow Information Export（IPFIX）Protocol for the Exchange of Flow Information of Exchange」、STD 77、RFC 7011、2013年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC7013] Trammell, B. and B. Claise, \"Guidelines for Authors and Reviewers of IP Flow Information Export (IPFIX) Information Elements\", BCP 184, RFC 7013, September 2013.",
      "ja": "[RFC7013] Trammell、B。およびB. Claise、「作成者とIPフロー情報エクスポート（IPFIX）情報要素のレビューアのためのガイドライン」、BCP 184、RFC 7013、2013年9月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[IANA-IPFIX] IANA, \"IP Flow Information Export (IPFIX) Entities\", <http://www.iana.org/assignments/ipfix>.",
      "ja": "[IANA-IPFIX] IANA、「IP Flow Information Export（IPFIX）Entities」、<http://www.iana.org/assignments/ipfix>。"
    },
    {
      "indent": 3,
      "text": "[RFC5102] Quittek, J., Bryant, S., Claise, B., Aitken, P., and J. Meyer, \"Information Model for IP Flow Information Export\", RFC 5102, January 2008.",
      "ja": "[RFC5102] Quittek、J.、Bryant、S.、Claise、B.、Aitken、P。、およびJ. Meyer、「IPフロー情報エクスポートの情報モデル」、RFC 5102、2008年1月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Brian Trammell Swiss Federal Institute of Technology Zurich Gloriastrasse 35 8092 Zurich Switzerland",
      "ja": "ブライアントラメルスイス連邦工科大学チューリッヒGloriastrasse 35 8092チューリッヒスイス"
    },
    {
      "indent": 3,
      "text": "Phone: +41 44 632 70 13\nEMail: trammell@tik.ee.ethz.ch",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Paul Aitken Cisco Systems, Inc. 96 Commercial Quay Commercial Street, Edinburgh EH6 6LX United Kingdom",
      "ja": "Paul Aitken Cisco Systems、Inc. 96 Commercial Quay Commercial Street、Edinburgh EH6 6LX United Kingdom"
    },
    {
      "indent": 3,
      "text": "Phone: +44 131 561 3616\nEMail: paitken@cisco.com",
      "raw": true,
      "ja": ""
    }
  ]
}