{
  "title": {
    "text": "RFC 7471 - OSPF Traffic Engineering (TE) Metric Extensions",
    "ja": "RFC 7471 - OSPFトラフィックエンジニアリング（TE）メトリック拡張"
  },
  "number": 7471,
  "created_at": "2019-11-02 15:47:20.096493+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      S. Giacalone\nRequest for Comments: 7471                                  Unaffiliated\nCategory: Standards Track                                        D. Ward\nISSN: 2070-1721                                            Cisco Systems\n                                                                J. Drake\n                                                                A. Atlas\n                                                        Juniper Networks\n                                                              S. Previdi\n                                                           Cisco Systems\n                                                              March 2015",
      "raw": true
    },
    {
      "indent": 12,
      "text": "OSPF Traffic Engineering (TE) Metric Extensions",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "In certain networks, such as, but not limited to, financial information networks (e.g., stock market data providers), network performance information (e.g., link propagation delay) is becoming critical to data path selection.",
      "ja": "などの特定のネットワークではなく、金融情報ネットワーク（例えば、株式市場データプロバイダ）、ネットワーク性能情報（例えば、リンクの伝搬遅延）は、データパスの選択に重要になってきているに限定されるもの。"
    },
    {
      "indent": 3,
      "text": "This document describes common extensions to RFC 3630 \"Traffic Engineering (TE) Extensions to OSPF Version 2\" and RFC 5329 \"Traffic Engineering Extensions to OSPF Version 3\" to enable network performance information to be distributed in a scalable fashion. The information distributed using OSPF TE Metric Extensions can then be used to make path selection decisions based on network performance.",
      "ja": "このドキュメントは、およびRFC 5329「OSPFバージョン2へのトラフィックエンジニアリング（TE）の拡張」RFC 3630に共通の拡張機能について説明し、「OSPFバージョン3へのトラフィックエンジニアリングの拡張は、」スケーラブルな方式で分散されるように、ネットワークのパフォーマンス情報を有効にします。 OSPF TEメトリックの拡張機能を使用して配信された情報は、ネットワークのパフォーマンスに基づいてパス選択決定を行うために使用することができます。"
    },
    {
      "indent": 3,
      "text": "Note that this document only covers the mechanisms by which network performance information is distributed. The mechanisms for measuring network performance information or using that information, once distributed, are outside the scope of this document.",
      "ja": "この文書は、唯一のネットワーク性能情報を分散させる機構を覆うことに留意されたいです。一度分散ネットワーク性能情報を測定するか、その情報を利用するための機構は、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7471.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7471で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Conventions Used in This Document ...............................4\n3. TE Metric Extensions to OSPF TE .................................4\n4. Sub-TLV Details .................................................6\n   4.1. Unidirectional Link Delay Sub-TLV ..........................6\n        4.1.1. Type ................................................6\n        4.1.2. Length ..............................................6\n        4.1.3. Anomalous (A) Bit ...................................7\n        4.1.4. Reserved ............................................7\n        4.1.5. Delay Value .........................................7\n   4.2. Min/Max Unidirectional Link Delay Sub-TLV ..................7\n        4.2.1. Type ................................................7\n        4.2.2. Length ..............................................7\n        4.2.3. Anomalous (A) Bit ...................................8\n        4.2.4. Reserved ............................................8\n        4.2.5. Min Delay ...........................................8\n        4.2.6. Reserved ............................................8\n        4.2.7. Max Delay ...........................................8\n   4.3. Unidirectional Delay Variation Sub-TLV .....................9\n        4.3.1. Type ................................................9\n        4.3.2. Length ..............................................9\n        4.3.3. Reserved ............................................9\n        4.3.4. Delay Variation .....................................9\n   4.4. Unidirectional Link Loss Sub-TLV ...........................9\n        4.4.1. Type ...............................................10\n        4.4.2. Length .............................................10\n        4.4.3. Anomalous (A) Bit ..................................10\n        4.4.4. Reserved ...........................................10\n        4.4.5. Link Loss ..........................................10",
      "raw": true
    },
    {
      "indent": 3,
      "text": "   4.5. Unidirectional Residual Bandwidth Sub-TLV .................10\n        4.5.1. Type ...............................................11\n        4.5.2. Length .............................................11\n        4.5.3. Residual Bandwidth .................................11\n   4.6. Unidirectional Available Bandwidth Sub-TLV ................11\n        4.6.1. Type ...............................................12\n        4.6.2. Length .............................................12\n        4.6.3. Available Bandwidth ................................12\n   4.7. Unidirectional Utilized Bandwidth Sub-TLV .................12\n        4.7.1. Type ...............................................12\n        4.7.2. Length .............................................13\n        4.7.3. Utilized Bandwidth .................................13\n5. Announcement Thresholds and Filters ............................13\n6. Announcement Suppression .......................................14\n7. Network Stability and Announcement Periodicity .................14\n8. Enabling and Disabling Sub-TLVs ................................15\n9. Static Metric Override .........................................15\n10. Compatibility .................................................15\n11. Security Considerations .......................................15\n12. IANA Considerations ...........................................16\n13. References ....................................................16\n   13.1. Normative References .....................................16\n   13.2. Informative References ...................................17\nAcknowledgments ...................................................18\nAuthors' Addresses ................................................19",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "In certain networks, such as, but not limited to, financial information networks (e.g., stock market data providers), network performance information (e.g., link propagation delay) is becoming as critical to data path selection as other metrics.",
      "ja": "そのようなネットワーク性能情報ではなく、（例えば、株式市場データプロバイダ）金融情報ネットワーク、これらに限定され、のような特定のネットワーク（例えば、リンクの伝搬遅延）に他のメトリックなどのデータ経路選択のような重要になっています。"
    },
    {
      "indent": 3,
      "text": "Because of this, using metrics such as hop count or cost as routing metrics is becoming only tangentially important. Rather, it would be beneficial to be able to make path selection decisions based on network performance information (such as link propagation delay) in a cost-effective and scalable way.",
      "ja": "このため、そのようなルーティングメトリックとしてホップ数やコストなど使用してメトリックは、唯一の接線方向に重要になってきています。むしろ、費用対効果の高いスケーラブルな方法で（例えば、リンクの伝搬遅延のような）ネットワーク性能情報に基づいて経路選択決定を行うことができるように有益であろう。"
    },
    {
      "indent": 3,
      "text": "This document describes extensions to OSPFv2 and OSPFv3 TE (hereafter called \"OSPF TE Metric Extensions\"), that can be used to distribute network performance information (viz link propagation delay, delay variation, link loss, residual bandwidth, available bandwidth, and utilized bandwidth).",
      "ja": "この文書は、ネットワーク性能情報（すなわちリンク伝搬遅延、遅延変動、リンク損失、残余帯域幅、利用可能な帯域幅、および利用される帯域幅を分配するために使用することができるのOSPFv2およびOSPFv3のTE（以下、「OSPF TEメトリック拡張」と呼ばれる）への拡張について説明し）。"
    },
    {
      "indent": 3,
      "text": "The data distributed by OSPF TE Metric Extensions is meant to be used as part of the operation of the routing protocol (e.g., by replacing cost with link propagation delay or considering bandwidth as well as cost), by enhancing Constrained Shortest Path First (CSPF), or for use by a PCE [RFC4655] or an Application-Layer Traffic Optimization (ALTO) server [RFC7285]. With respect to CSPF, the data distributed by OSPF TE Metric Extensions can be used to set up, fail over, and fail back data paths using protocols such as RSVP-TE [RFC3209].",
      "ja": "OSPF TEメトリック拡張により分配されたデータは、増強制約付き最短パスファースト（CSPF）によって、（例えば、リンク伝搬遅延とコストの交換や帯域幅、並びにコストを考慮して）ルーティングプロトコルの動作の一部として使用されることを意味します、又はPCE [RFC4655]またはアプリケーションレイヤトラフィックの最適化（ALTO）サーバ[RFC7285]で使用するため。 CSPFに対して、OSPF TEメトリック拡張により分配されたデータは、RSVP-TE [RFC3209]などのプロトコルを使用して、データパスを設定フェイルオーバー、およびフェイルバックするために使用することができます。"
    },
    {
      "indent": 3,
      "text": "Note that the mechanisms described in this document only distribute network performance information. The methods for measuring that information or acting on it once it is distributed are outside the scope of this document. A method for measuring loss and delay in an MPLS network is described in [RFC6374].",
      "ja": "本書で説明されたメカニズムは、唯一のネットワーク性能情報を配布することに留意されたいです。それが分散されると、その情報を測定、またはそれに作用するための方法は、この文書の範囲外です。 MPLSネットワークにおける損失と遅延を測定するための方法は、[RFC6374]に記載されています。"
    },
    {
      "indent": 3,
      "text": "While this document does not specify the method for measuring network performance information, any measurement of link propagation delay SHOULD NOT vary significantly based upon the offered traffic load and, hence, SHOULD NOT include queuing delays. For a forwarding adjacency (FA) [RFC4206], care must be taken that measurement of the link propagation delay avoids significant queuing delay; this can be accomplished in a variety of ways, e.g., measuring with a traffic class that experiences minimal queuing or summing the measured link propagation delay of the links on the FA's path.",
      "ja": "この文書は、ネットワーク性能情報を測定するための方法を指定していないが、リンクの伝搬遅延の測定が提供されるトラフィック負荷に基づいており、従って、遅延キューイング含むべきではない有意に変化すべきではありません。転送隣接（FA）[RFC4206]のために、ケアリンク伝搬遅延の測定が重要なキューイング遅延を回避するように注意しなければなりません。これは、最小限のキューイングやFAのパス上のリンクの測定リンク伝播遅延を合計を経験するトラフィッククラスを測定する、例えば、様々な方法で達成することができます。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "In this document, these words should convey that interpretation only when in ALL CAPS. Lowercase uses of these words are not to be interpreted as carrying this significance.",
      "ja": "場合にのみ、すべて大文字で、このドキュメントでは、これらの言葉は、その解釈を伝える必要があります。これらの単語の小文字の用途は、この意義を運ぶように解釈されるべきではありません。"
    },
    {
      "indent": 0,
      "text": "3. TE Metric Extensions to OSPF TE",
      "section_title": true,
      "ja": "OSPF TE 3. TEメトリック拡張"
    },
    {
      "indent": 3,
      "text": "This document defines new OSPF TE sub-TLVs that are used to distribute network performance information. The extensions in this document build on the ones provided in OSPFv2 TE [RFC3630] and OSPFv3 TE [RFC5329].",
      "ja": "この文書では、ネットワーク性能情報を配布するために使用される新しいOSPF TEサブTLVを定義します。この文書に記載されている拡張子はOSPFv2のTE [RFC3630]およびOSPFv3のTE [RFC5329]に提供するものの上に構築します。"
    },
    {
      "indent": 3,
      "text": "OSPFv2 TE Link State Advertisements (LSAs) [RFC3630] are opaque LSAs [RFC5250] with area flooding scope while OSPFv3 Intra-Area-TE-LSAs have their own LSA type, also with area flooding scope; both consist of a single TLV with one or more nested sub-TLVs. The Link TLV is common to both and describes the characteristics of a link between OSPF neighbors.",
      "ja": "OSPFv3のエリア内-TE-のLSAはまた、スコープをフラッディング領域と、独自のLSAタイプを有し、一方のOSPFv2 TEリンクステートアドバタイズメント（LSA）[RFC3630]はエリアフラッディングスコープを持つ不透明LSA [RFC5250]です。双方は、一個の以上のネストされたサブTLVを持つ単一のTLVから成ります。リンクTLVは、両方に共通であり、OSPFネイバー間のリンクの特性について説明します。"
    },
    {
      "indent": 3,
      "text": "This document defines several additional sub-TLVs for the Link TLV:",
      "ja": "このドキュメントは、リンクTLVのためにいくつかの追加のサブTLVを定義します。"
    },
    {
      "indent": 6,
      "text": "Type Length Value",
      "ja": "タイプ長さ値"
    },
    {
      "indent": 6,
      "text": "27 4 Unidirectional Link Delay",
      "ja": "27 4単方向リンク遅延"
    },
    {
      "indent": 6,
      "text": "28 8 Min/Max Unidirectional Link Delay",
      "ja": "28 8最小/最大単方向リンク遅延"
    },
    {
      "indent": 6,
      "text": "29 4 Unidirectional Delay Variation",
      "ja": "29 4単方向遅延変動"
    },
    {
      "indent": 6,
      "text": "30 4 Unidirectional Link Loss",
      "ja": "30 4単方向リンク損失"
    },
    {
      "indent": 6,
      "text": "31 4 Unidirectional Residual Bandwidth",
      "ja": "31 4単方向残余帯域"
    },
    {
      "indent": 6,
      "text": "32 4 Unidirectional Available Bandwidth",
      "ja": "32 4単方向利用可能な帯域幅"
    },
    {
      "indent": 6,
      "text": "33 4 Unidirectional Utilized Bandwidth",
      "ja": "33 4一方向利用される帯域幅"
    },
    {
      "indent": 3,
      "text": "As can be seen in the list above, the sub-TLVs described in this document carry different types of network performance information. Many (but not all) of the sub-TLVs include a bit called the Anomalous (or A) bit. When the A bit is clear (or when the sub-TLV does not include an A bit), the sub-TLV describes steady state link performance. This information could conceivably be used to construct a steady state performance topology for initial tunnel path computation, or to verify alternative failover paths.",
      "ja": "上記のリストから分かるように、本文書に記載されたサブのTLVは、ネットワーク性能情報の種類を運びます。多くの（すべてではない）サブのTLVのは、異常（又はA）ビットと呼ばれるビットを含みます。ビットがクリアされて（またはサブTLVは、ビットが含まれていない場合）場合、サブTLVは、定常状態のリンク性能を記載します。この情報は、おそらく最初のトンネル経路計算のための定常状態性能トポロジーを構築するために使用することができ、または代替フェイルオーバーパスを検証します。"
    },
    {
      "indent": 3,
      "text": "When network performance violates configurable link-local thresholds a sub-TLV with the A bit set is advertised. These sub-TLVs could be used by the receiving node to determine whether to move traffic to a backup path or whether to calculate an entirely new path. From an MPLS perspective, the intent of the A bit is to permit LSP ingress nodes to:",
      "ja": "ネットワーク性能は、構成リンクローカルしきい値を違反したときビットセットAとサブTLVがアドバタイズされます。これらのサブTLVのバックアップパスにトラフィックを移動するかどうか全く新しい経路を計算するかどうかを決定するために受信ノードによって使用することができます。 MPLSの観点から、ビットの意図はにLSPの入口ノードを可能にすることです。"
    },
    {
      "indent": 3,
      "text": "A) Determine whether the link referenced in the sub-TLV affects any of the LSPs for which it is ingress. If there are, then:",
      "ja": "A）サブTLVで参照リンクは、それが入力されたLSPのいずれかに影響を与えるかどうかを決定。その後、場合があります。"
    },
    {
      "indent": 3,
      "text": "B) The node determines whether those LSPs still meet end-to-end performance objectives. If not, then:",
      "ja": "B）ノードは、それらのLSPがまだエンドツーエンドのパフォーマンス目標を満たしているか否かを判定する。そして、そうでない場合："
    },
    {
      "indent": 3,
      "text": "C) The node could then conceivably move affected traffic to a pre-established protection LSP or establish a new LSP and place the traffic in it.",
      "ja": "C）ノードは、おそらく事前に確立された保護LSPに影響を受けたトラフィックを移動したり、新しいLSPを確立し、それにトラフィックを置くことができます。"
    },
    {
      "indent": 3,
      "text": "If link performance then improves beyond a configurable minimum value (reuse threshold), that sub-TLV can be re-advertised with the Anomalous bit cleared. In this case, a receiving node can conceivably do whatever re-optimization (or failback) it wishes (including nothing).",
      "ja": "リンク性能は、サブTLVが異常で再アドバタイズすることができ、設定最小値（再利用閾値）を超えて改善されるかどうかをクリアビット。この場合、受信ノードは、おそらくそれは（何も含まない）を希望するものは何でも再最適化（またはフェイルバック）を行うことができます。"
    },
    {
      "indent": 3,
      "text": "The A bit was intentionally omitted from some sub-TLVs to help mitigate oscillations. See Section 7.1 for more information.",
      "ja": "ビットは、意図的に振動を軽減するためにいくつかのサブのTLVから省略されました。詳細については、セクション7.1を参照してください。"
    },
    {
      "indent": 3,
      "text": "Link delay, delay variation, and link loss MUST be encoded as integers. Consistent with existing OSPF TE specifications [RFC3630], residual, available, and utilized bandwidth MUST be encoded in IEEE single precision floating point [IEEE754]. Link delay and delay variation MUST be in units of microseconds, link loss MUST be a percentage, and bandwidth MUST be in units of bytes per second. All values (except residual bandwidth) MUST be calculated as rolling averages where the averaging period MUST be a configurable period of time. See Section 5 for more information.",
      "ja": "リンク遅延、遅延変動、およびリンク損失は整数としてエンコードする必要があります。既存のOSPF TE仕様[RFC3630]、残留、利用可能な、そして利用される帯域幅は、IEEE単精度浮動小数点数で符号化されなければならない[IEEE754]と一致します。リンク遅延及び遅延変動がマイクロ秒の単位でなければなりません、リンクロスはパーセンテージでなければなりません、及び帯域幅は、毎秒バイト単位でなければなりません。 （残余帯域を除く）のすべての値は平均化期間は、設定可能な期間でなければなりませんローリング平均値として計算しなければなりません。詳細については、セクション5を参照してください。"
    },
    {
      "indent": 0,
      "text": "4. Sub-TLV Details",
      "section_title": true,
      "ja": "4.サブTLVの詳細"
    },
    {
      "indent": 0,
      "text": "4.1. Unidirectional Link Delay Sub-TLV",
      "section_title": true,
      "ja": "4.1. 単方向リンク遅延サブTLV"
    },
    {
      "indent": 3,
      "text": "This sub-TLV advertises the average link delay between two directly connected OSPF neighbors. The delay advertised by this sub-TLV MUST be the delay from the advertising node to its neighbor (i.e., the forward path delay). The format of this sub-TLV is shown in the following diagram:",
      "ja": "このサブTLVは、二つの直接接続されたOSPFネイバーとの間の平均リンク遅延をアドバタイズ。このサブTLVによってアドバタイズ遅延は、その隣接（すなわち、順方向パス遅延）に広告ノードから遅れていなければなりません。このサブTLVのフォーマットは、次の図に示されています。"
    },
    {
      "indent": 5,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              27               |               4               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|A|  RESERVED   |                     Delay                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.1.1. Type",
      "section_title": true,
      "ja": "4.1.1. タイプ"
    },
    {
      "indent": 3,
      "text": "This sub-TLV has a type of 27.",
      "ja": "このサブTLVは、27のタイプがあります。"
    },
    {
      "indent": 0,
      "text": "4.1.2. Length",
      "section_title": true,
      "ja": "4.1.2. 長さ"
    },
    {
      "indent": 3,
      "text": "The length is 4.",
      "ja": "長さは4です。"
    },
    {
      "indent": 0,
      "text": "4.1.3. Anomalous (A) Bit",
      "section_title": true,
      "ja": "4.1.3. 異常（A）ビット"
    },
    {
      "indent": 3,
      "text": "This field represents the Anomalous (A) bit. The A bit is set when the measured value of this parameter exceeds its configured maximum threshold. The A bit is cleared when the measured value falls below its configured reuse threshold. If the A bit is clear, the sub-TLV represents steady state link performance.",
      "ja": "このフィールドは、異常（A）ビットを表します。このパラメータの測定値がその設定された最大閾値を超えたときにビットが設定されています。測定値は、その構成の再利用閾値を下回ったときにビットがクリアされます。ビットがクリアされている場合、サブTLVは、定常状態のリンク性能を表します。"
    },
    {
      "indent": 0,
      "text": "4.1.4. Reserved",
      "section_title": true,
      "ja": "4.1.4. 予約済み"
    },
    {
      "indent": 3,
      "text": "This field is reserved for future use. It MUST be set to 0 when sent and MUST be ignored when received.",
      "ja": "このフィールドは、将来の使用のために予約されています。これは、送信されたときに0に設定しなければならなくて、受信時に無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.5. Delay Value",
      "section_title": true,
      "ja": "4.1.5. 遅延値"
    },
    {
      "indent": 3,
      "text": "This 24-bit field carries the average link delay over a configurable interval in microseconds, encoded as an integer value. When set to the maximum value 16,777,215 (16.777215 sec), then the delay is at least that value, and it may be larger.",
      "ja": "この24ビットのフィールドは、整数値として符号化されたマイクロ秒で設定間隔にわたる平均リンク遅延を運びます。最大値16,777,215（16.777215秒）に設定した場合、その後の遅延は、少なくともその値であり、大きくてもよいです。"
    },
    {
      "indent": 0,
      "text": "4.2. Min/Max Unidirectional Link Delay Sub-TLV",
      "section_title": true,
      "ja": "4.2. 最小/最大単方向リンク遅延サブTLV"
    },
    {
      "indent": 3,
      "text": "This sub-TLV advertises the minimum and maximum delay values between two directly connected OSPF neighbors. The delay advertised by this sub-TLV MUST be the delay from the advertising node to its neighbor (i.e., the forward path delay). The format of this sub-TLV is shown in the following diagram:",
      "ja": "このサブTLVは、直接接続された2つのOSPFネイバー間の最小および最大遅延値をアドバタイズ。このサブTLVによってアドバタイズ遅延は、その隣接（すなわち、順方向パス遅延）に広告ノードから遅れていなければなりません。このサブTLVのフォーマットは、次の図に示されています。"
    },
    {
      "indent": 5,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              28               |               8               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|A|  RESERVED   |                   Min Delay                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   RESERVED    |                   Max Delay                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.2.1. Type",
      "section_title": true,
      "ja": "4.2.1. タイプ"
    },
    {
      "indent": 3,
      "text": "This sub-TLV has a type of 28.",
      "ja": "このサブTLVは、28のタイプがあります。"
    },
    {
      "indent": 0,
      "text": "4.2.2. Length",
      "section_title": true,
      "ja": "4.2.2. 長さ"
    },
    {
      "indent": 3,
      "text": "The length is 8.",
      "ja": "長さは8です。"
    },
    {
      "indent": 0,
      "text": "4.2.3. Anomalous (A) Bit",
      "section_title": true,
      "ja": "4.2.3. 異常（A）ビット"
    },
    {
      "indent": 3,
      "text": "This field represents the Anomalous (A) bit. The A bit is set when one or more measured values exceed a configured maximum threshold. The A bit is cleared when the measured value falls below its configured reuse threshold. If the A bit is clear, the sub-TLV represents steady state link performance.",
      "ja": "このフィールドは、異常（A）ビットを表します。一つ以上の測定値が設定された最大閾値を超えたときにビットが設定されています。測定値は、その構成の再利用閾値を下回ったときにビットがクリアされます。ビットがクリアされている場合、サブTLVは、定常状態のリンク性能を表します。"
    },
    {
      "indent": 0,
      "text": "4.2.4. Reserved",
      "section_title": true,
      "ja": "4.2.4. 予約済み"
    },
    {
      "indent": 3,
      "text": "This field is reserved for future use. It MUST be set to 0 when sent and MUST be ignored when received.",
      "ja": "このフィールドは、将来の使用のために予約されています。これは、送信されたときに0に設定しなければならなくて、受信時に無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2.5. Min Delay",
      "section_title": true,
      "ja": "4.2.5. 私のディレイ"
    },
    {
      "indent": 3,
      "text": "This 24-bit field carries minimum measured link delay value (in microseconds) over a configurable interval, encoded as an integer value.",
      "ja": "この24ビットのフィールドは、整数値として符号化された設定間隔で（マイクロ秒）最小測定リンク遅延値を、運びます。"
    },
    {
      "indent": 3,
      "text": "Implementations MAY also permit the configuration of an offset value (in microseconds) to be added to the measured delay value to advertise operator specific delay constraints.",
      "ja": "実装は、オペレータ固有の遅延制約をアドバタイズするために測定された遅延値に加算する（マイクロ秒）オフセット値の設定を可能にすることができます。"
    },
    {
      "indent": 3,
      "text": "When set to the maximum value 16,777,215 (16.777215 sec), then the delay is at least that value, and it may be larger.",
      "ja": "最大値16,777,215（16.777215秒）に設定した場合、その後の遅延は、少なくともその値であり、大きくてもよいです。"
    },
    {
      "indent": 0,
      "text": "4.2.6. Reserved",
      "section_title": true,
      "ja": "4.2.6. 予約済み"
    },
    {
      "indent": 3,
      "text": "This field is reserved for future use. It MUST be set to 0 when sent and MUST be ignored when received.",
      "ja": "このフィールドは、将来の使用のために予約されています。これは、送信されたときに0に設定しなければならなくて、受信時に無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2.7. Max Delay",
      "section_title": true,
      "ja": "4.2.7. 最大ディレイ"
    },
    {
      "indent": 3,
      "text": "This 24-bit field carries the maximum measured link delay value (in microseconds) over a configurable interval, encoded as an integer value.",
      "ja": "この24ビットのフィールドは、整数値として符号化された設定間隔で測定された最大リンク遅延値を（マイクロ秒）、運びます。"
    },
    {
      "indent": 3,
      "text": "Implementations may also permit the configuration of an offset value (in microseconds) to be added to the measured delay value to advertise operator specific delay constraints.",
      "ja": "実装は、オペレータ固有の遅延制約をアドバタイズするために測定された遅延値に加算する（マイクロ秒）オフセット値の設定を可能にすることができます。"
    },
    {
      "indent": 3,
      "text": "It is possible for min delay and max delay to be the same value.",
      "ja": "最小遅延と最大遅延は同じ値であることが可能です。"
    },
    {
      "indent": 3,
      "text": "When the delay value is set to the maximum value 16,777,215 (16.777215 sec), then the delay is at least that value, and it may be larger.",
      "ja": "遅延値が最大値16,777,215（16.777215秒）に設定されているとき、遅延は、少なくともその値であり、大きくてもよいです。"
    },
    {
      "indent": 0,
      "text": "4.3. Unidirectional Delay Variation Sub-TLV",
      "section_title": true,
      "ja": "4.3. 単方向遅延変動サブTLV"
    },
    {
      "indent": 3,
      "text": "This sub-TLV advertises the average link delay variation between two directly connected OSPF neighbors. The delay variation advertised by this sub-TLV MUST be the delay from the advertising node to its neighbor (i.e., the forward path delay variation). The format of this sub-TLV is shown in the following diagram:",
      "ja": "このサブTLVは、二つの直接接続されたOSPFネイバーとの間の平均リンク遅延変動をアドバタイズ。このサブTLVによってアドバタイズ遅延変動は、その隣接（即ち、フォワードパス遅延変動）に広告ノードから遅れていなければなりません。このサブTLVのフォーマットは、次の図に示されています。"
    },
    {
      "indent": 6,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              29               |               4               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    RESERVED   |              Delay Variation                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.3.1. Type",
      "section_title": true,
      "ja": "4.3.1. タイプ"
    },
    {
      "indent": 3,
      "text": "This sub-TLV has a type of 29.",
      "ja": "このサブTLVは、29のタイプがあります。"
    },
    {
      "indent": 0,
      "text": "4.3.2. Length",
      "section_title": true,
      "ja": "4.3.2. 長さ"
    },
    {
      "indent": 3,
      "text": "The length is 4.",
      "ja": "長さは4です。"
    },
    {
      "indent": 0,
      "text": "4.3.3. Reserved",
      "section_title": true,
      "ja": "4.3.3. 予約済み"
    },
    {
      "indent": 3,
      "text": "This field is reserved for future use. It MUST be set to 0 when sent and MUST be ignored when received.",
      "ja": "このフィールドは、将来の使用のために予約されています。これは、送信されたときに0に設定しなければならなくて、受信時に無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3.4. Delay Variation",
      "section_title": true,
      "ja": "4.3.4. 遅延変動"
    },
    {
      "indent": 3,
      "text": "This 24-bit field carries the average link delay variation over a configurable interval in microseconds, encoded as an integer value. When set to 0, it has not been measured. When set to the maximum value 16,777,215 (16.777215 sec), then the delay is at least that value, and it may be larger.",
      "ja": "この24ビットのフィールドは、整数値として符号化されたマイクロ秒で設定間隔にわたる平均リンク遅延変動を運びます。 0に設定すると、それが測定されていません。最大値16,777,215（16.777215秒）に設定した場合、その後の遅延は、少なくともその値であり、大きくてもよいです。"
    },
    {
      "indent": 0,
      "text": "4.4. Unidirectional Link Loss Sub-TLV",
      "section_title": true,
      "ja": "4.4. 単方向リンク損失サブTLV"
    },
    {
      "indent": 3,
      "text": "This sub-TLV advertises the loss (as a packet percentage) between two directly connected OSPF neighbors. The link loss advertised by this sub-TLV MUST be the packet loss from the advertising node to its neighbor (i.e., the forward path loss). The format of this sub-TLV is shown in the following diagram:",
      "ja": "このサブTLVは、二つの直接接続されたOSPFネイバーとの間（パケットのパーセンテージとして）損失をアドバタイズ。このサブTLVによってアドバタイズリンク損失は、その隣接（すなわち、順方向経路損失）に広告ノードからパケット損失でなければなりません。このサブTLVのフォーマットは、次の図に示されています。"
    },
    {
      "indent": 5,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              30               |               4               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|A|  RESERVED   |                 Link Loss                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.4.1. Type",
      "section_title": true,
      "ja": "4.4.1. タイプ"
    },
    {
      "indent": 3,
      "text": "This sub-TLV has a type of 30",
      "ja": "このサブTLVは、30のタイプを有します"
    },
    {
      "indent": 0,
      "text": "4.4.2. Length",
      "section_title": true,
      "ja": "4.4.2. 長さ"
    },
    {
      "indent": 3,
      "text": "The length is 4.",
      "ja": "長さは4です。"
    },
    {
      "indent": 0,
      "text": "4.4.3. Anomalous (A) Bit",
      "section_title": true,
      "ja": "4.4.3. 異常（A）ビット"
    },
    {
      "indent": 3,
      "text": "This field represents the Anomalous (A) bit. The A bit is set when the measured value of this parameter exceeds its configured maximum threshold. The A bit is cleared when the measured value falls below its configured reuse threshold. If the A bit is clear, the sub-TLV represents steady state link performance.",
      "ja": "このフィールドは、異常（A）ビットを表します。このパラメータの測定値がその設定された最大閾値を超えたときにビットが設定されています。測定値は、その構成の再利用閾値を下回ったときにビットがクリアされます。ビットがクリアされている場合、サブTLVは、定常状態のリンク性能を表します。"
    },
    {
      "indent": 0,
      "text": "4.4.4. Reserved",
      "section_title": true,
      "ja": "4.4.4. 予約済み"
    },
    {
      "indent": 3,
      "text": "This field is reserved for future use. It MUST be set to 0 when sent and MUST be ignored when received.",
      "ja": "このフィールドは、将来の使用のために予約されています。これは、送信されたときに0に設定しなければならなくて、受信時に無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.4.5. Link Loss",
      "section_title": true,
      "ja": "4.4.5. リンク損失"
    },
    {
      "indent": 3,
      "text": "This 24-bit field carries link packet loss as a percentage of the total traffic sent over a configurable interval. The basic unit is 0.000003%, where (2^24 - 2) is 50.331642%. This value is the highest packet loss percentage that can be expressed (the assumption being that precision is more important on high speed links than the ability to advertise loss rates greater than this, and that high speed links with over 50% loss are unusable). Therefore, measured values that are larger than the field maximum SHOULD be encoded as the maximum value.",
      "ja": "この24ビットのフィールドは、構成可能な間隔を介して送信される総トラフィックのパーセンテージとしてリンクパケット損失を運びます。 50.331642％である - 基本単位（2 2 ^ 24）0.000003パーセントです。この値を表現することができる最高のパケット損失率（仮定は精度がこれよりも大きい損失率を宣伝する能力よりも高速リンクでより重要であるということであり、50％以上の損失とその高速リンクが使用できない）です。したがって、フィールドの最大値より大きい測定値を最大値として符号化されるべきです。"
    },
    {
      "indent": 0,
      "text": "4.5. Unidirectional Residual Bandwidth Sub-TLV",
      "section_title": true,
      "ja": "4.5. 単方向残留帯域幅サブTLV"
    },
    {
      "indent": 3,
      "text": "This sub-TLV advertises the residual bandwidth between two directly connected OSPF neighbors. The residual bandwidth advertised by this sub-TLV MUST be the residual bandwidth from the advertising node to its neighbor.",
      "ja": "このサブTLVは、直接接続された2つのOSPFネイバー間の残留帯域幅をアドバタイズします。このサブTLVによってアドバタイズ残留帯域幅は、その隣に広告ノードからの残留帯域幅でなければなりません。"
    },
    {
      "indent": 3,
      "text": "The format of this sub-TLV is shown in the following diagram:",
      "ja": "このサブTLVのフォーマットは、次の図に示されています。"
    },
    {
      "indent": 5,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              31               |               4               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Residual Bandwidth                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.5.1. Type",
      "section_title": true,
      "ja": "4.5.1. タイプ"
    },
    {
      "indent": 3,
      "text": "This sub-TLV has a type of 31.",
      "ja": "このサブTLVは、31のタイプを有しています。"
    },
    {
      "indent": 0,
      "text": "4.5.2. Length",
      "section_title": true,
      "ja": "4.5.2. 長さ"
    },
    {
      "indent": 3,
      "text": "The length is 4.",
      "ja": "長さは4です。"
    },
    {
      "indent": 0,
      "text": "4.5.3. Residual Bandwidth",
      "section_title": true,
      "ja": "4.5.3. 残余帯域"
    },
    {
      "indent": 3,
      "text": "This field carries the residual bandwidth on a link, forwarding adjacency [RFC4206], or bundled link in IEEE floating point format with units of bytes per second. For a link or forwarding adjacency, residual bandwidth is defined to be Maximum Bandwidth [RFC3630] minus the bandwidth currently allocated to RSVP-TE LSPs. For a bundled link, residual bandwidth is defined to be the sum of the component link residual bandwidths.",
      "ja": "このフィールドは、秒あたりのバイトのユニットとIEEE浮動小数点フォーマット内のリンク上の残留帯域幅、隣接[RFC4206]を転送する、またはバンドルリンクを運びます。リンクまたは転送隣接ため、残余帯域が最大帯域幅[RFC3630]マイナス現在RSVP-TEするLSPを割り当てられた帯域幅であると定義されます。束ねられたリンクのために、残留帯域幅は、コンポーネントリンク残存帯域幅の合計であると定義されます。"
    },
    {
      "indent": 3,
      "text": "The calculation of Residual Bandwidth is different than that of Unreserved Bandwidth [RFC3630]. Residual Bandwidth subtracts tunnel reservations from Maximum Bandwidth (i.e., the link capacity) [RFC3630] and provides an aggregated remainder across priorities. Unreserved Bandwidth, on the other hand, is subtracted from the Maximum Reservable Bandwidth (the bandwidth that can theoretically be reserved) and provides per priority remainders. Residual Bandwidth and Unreserved Bandwidth [RFC3630] can be used concurrently, and each has a separate use case (e.g., the former can be used for applications like Weighted ECMP while the latter can be used for call admission control).",
      "ja": "残余帯域の計算は、未予約帯域幅[RFC3630]のものとは異なります。残余帯域は、最大帯域幅（すなわち、リンク容量）[RFC3630]からトンネル予約を減算し、優先順位を横切る凝集残りを提供します。未予約帯域幅は、他方で、最大予約可能帯域幅（理論的に確保できる帯域幅）から減算され、優先残りごと提供します。残余帯域及び未予約帯域幅[RFC3630]を同時に使用することができ、それぞれが（後者は、コールアドミッション制御のために使用することができるが、例えば、前者は加重ECMPような用途に使用することができる）別個のユースケースを有しています。"
    },
    {
      "indent": 0,
      "text": "4.6. Unidirectional Available Bandwidth Sub-TLV",
      "section_title": true,
      "ja": "4.6. 単方向利用可能な帯域幅サブTLV"
    },
    {
      "indent": 3,
      "text": "This sub-TLV advertises the available bandwidth between two directly connected OSPF neighbors. The available bandwidth advertised by this sub-TLV MUST be the available bandwidth from the advertising node to its neighbor. The format of this sub-TLV is shown in the following diagram:",
      "ja": "このサブTLVは、直接接続された2つのOSPFネイバー間で利用可能な帯域幅をアドバタイズします。このサブTLVによってアドバタイズ利用可能な帯域幅は、その隣に広告ノードから利用可能な帯域幅でなければなりません。このサブTLVのフォーマットは、次の図に示されています。"
    },
    {
      "indent": 5,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              32               |               4               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Available Bandwidth                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.6.1. Type",
      "section_title": true,
      "ja": "4.6.1. タイプ"
    },
    {
      "indent": 3,
      "text": "This sub-TLV has a type of 32.",
      "ja": "このサブTLVは、32のタイプを有しています。"
    },
    {
      "indent": 0,
      "text": "4.6.2. Length",
      "section_title": true,
      "ja": "4.6.2. 長さ"
    },
    {
      "indent": 3,
      "text": "The length is 4.",
      "ja": "長さは4です。"
    },
    {
      "indent": 0,
      "text": "4.6.3. Available Bandwidth",
      "section_title": true,
      "ja": "4.6.3. 利用可能な帯域幅"
    },
    {
      "indent": 3,
      "text": "This field carries the available bandwidth on a link, forwarding adjacency, or bundled link in IEEE floating point format with units of bytes per second. For a link or forwarding adjacency, available bandwidth is defined to be residual bandwidth (see Section 4.5) minus the measured bandwidth used for the actual forwarding of non-RSVP-TE LSP packets. For a bundled link, available bandwidth is defined to be the sum of the component link available bandwidths.",
      "ja": "このフィールドは、秒あたりのバイトのユニットとIEEE浮動小数点形式でリンク上で利用可能な帯域幅、転送隣接、またはバンドルリンクを運びます。リンクまたは隣接を転送するため、利用可能な帯域幅は、残余帯域（4.5節を参照）マイナス非RSVP-TE LSPパケットの実際の転送に使用される測定された帯域幅であると定義されます。束ねられたリンクのために、利用可能な帯域幅は、コンポーネントリンク利用可能な帯域幅の合計であると定義されます。"
    },
    {
      "indent": 0,
      "text": "4.7. Unidirectional Utilized Bandwidth Sub-TLV",
      "section_title": true,
      "ja": "4.7. 単方向使用される帯域幅サブTLV"
    },
    {
      "indent": 3,
      "text": "This Sub-TLV advertises the bandwidth utilization between two directly connected OSPF neighbors. The bandwidth utilization advertised by this sub-TLV MUST be the bandwidth from the advertising node to its neighbor. The format of this Sub-TLV is shown in the following diagram:",
      "ja": "このサブTLVは、直接接続された2つのOSPFネイバー間の帯域幅の利用をアドバタイズします。このサブTLVによってアドバタイズ帯域幅の利用は、広告ノードからネイバーに帯域幅でなければなりません。このサブTLVのフォーマットは、次の図に示されています。"
    },
    {
      "indent": 5,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              33               |               4               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Utilized Bandwidth                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.7.1. Type",
      "section_title": true,
      "ja": "4.7.1. タイプ"
    },
    {
      "indent": 3,
      "text": "This sub-TLV has a type of 33.",
      "ja": "このサブTLVは、33のタイプを有しています。"
    },
    {
      "indent": 0,
      "text": "4.7.2. Length",
      "section_title": true,
      "ja": "4.7.2. 長さ"
    },
    {
      "indent": 3,
      "text": "The length is 4.",
      "ja": "長さは4です。"
    },
    {
      "indent": 0,
      "text": "4.7.3. Utilized Bandwidth",
      "section_title": true,
      "ja": "4.7.3. 利用される帯域幅"
    },
    {
      "indent": 3,
      "text": "This field carries the bandwidth utilization on a link, forwarding adjacency, or bundled link in IEEE floating-point format with units of bytes per second. For a link or forwarding adjacency, bandwidth utilization represents the actual utilization of the link (i.e., as measured by the advertising node). For a bundled link, bandwidth utilization is defined to be the sum of the component link bandwidth utilizations.",
      "ja": "このフィールドは、秒あたりのバイトの単位を有するIEEE浮動小数点形式のリンク上の帯域幅利用、転送隣接、またはバンドルリンクを運びます。リンクまたは転送隣接のために、帯域幅利用は、（広告ノードによって測定されるように、すなわち、）リンクの実際の使用率を表します。バンドルリンクのために、帯域幅の利用率は、コンポーネントリンク帯域幅の使用率の合計になるように定義されています。"
    },
    {
      "indent": 0,
      "text": "5. Announcement Thresholds and Filters",
      "section_title": true,
      "ja": "5.アナウンスしきい値とフィルタ"
    },
    {
      "indent": 3,
      "text": "The values advertised in all sub-TLVs (except min/max delay and residual bandwidth) MUST represent an average over a period or be obtained by a filter that is reasonably representative of an average. For example, a rolling average is one such filter.",
      "ja": "（最小/最大遅延及び残余帯域を除く）すべてのサブのTLVでアドバタイズ値にわたって平均を表現しなければなりませんか、平均の合理的に代表されたフィルタによって得られます。例えば、ローリング平均は、そのようなフィルタです。"
    },
    {
      "indent": 3,
      "text": "Min and max delay MAY be the lowest and/or highest measured value over a measurement interval or MAY make use of a filter, or other technique, to obtain a reasonable representation of a min and max value representative of the interval with compensation for outliers.",
      "ja": "minとmaxの遅延が測定期間にわたって最低及び/又は最高の測定値であってもよく、または外れ値の補償との間隔の最小値と最大値の代表的な合理的な表現を得るために、フィルタ、または他の技術を利用することができます。"
    },
    {
      "indent": 3,
      "text": "The measurement interval, any filter coefficients, and any advertisement intervals MUST be configurable for each sub-TLV.",
      "ja": "測定間隔、任意のフィルタ係数、及び任意の広告間隔は、各サブTLVのために構成可能でなければなりません。"
    },
    {
      "indent": 3,
      "text": "In addition to the measurement intervals governing re-advertisement, implementations SHOULD provide for each sub-TLV configurable accelerated advertisement thresholds, such that:",
      "ja": "再広告を支配する測定間隔に加えて、インプリメンテーションは、各サブTLV構成加速広告しきい値、その結果を提供すべきです。"
    },
    {
      "indent": 3,
      "text": "1. If the measured parameter falls outside a configured upper bound for all but the min delay metric (or lower bound for min delay metric only) and the advertised sub-TLV is not already outside that bound, or",
      "ja": "1.測定されたパラメータが設定上部以外のすべてのメトリック分遅延（最小遅延のバウンド以下メトリックのみ）のために結合し、アドバタイズされたサブTLVは、そのバウンド外まだないから外れる場合、または"
    },
    {
      "indent": 3,
      "text": "2. If the difference between the last advertised value and current measured value exceed a configured threshold, then",
      "ja": "2.最後に広告された値と現在の測定値との差が、次に、設定された閾値を超えた場合"
    },
    {
      "indent": 3,
      "text": "3. The advertisement is made immediately.",
      "section_title": true,
      "ja": "3.広告がすぐに行われます。"
    },
    {
      "indent": 3,
      "text": "4. For sub-TLVs, which include an A bit (except min/max delay), an additional threshold SHOULD be included corresponding to the threshold for which the performance is considered anomalous (and sub-TLVs with the A bit are sent). The A bit is cleared when the sub-TLV's performance has been below (or re-crosses) this threshold for an advertisement interval(s) to permit fail back.",
      "ja": "4.（最小/最大遅延を除く）ビットを含むサブTLVの、について、追加の閾値は性能が異常と考えられるため、閾値に対応含まれるべきである（ビットとサブのTLVが送信されます）。ビットは、サブTLVのパフォーマンスは以下となっているときにクリア（または再十字）許可する通知間隔（秒）のために、このしきい値は、フェイルバックされます。"
    },
    {
      "indent": 3,
      "text": "To prevent oscillations, only the high threshold or the low threshold (but not both) may be used to trigger any given sub-TLV that supports both.",
      "ja": "発振を防止するために、唯一の高閾値または低閾値（両方ではないが）の両方をサポートする任意のサブTLVをトリガするために使用されてもよいです。"
    },
    {
      "indent": 3,
      "text": "Additionally, once outside of the bounds of the threshold, any re-advertisement of a measurement within the bounds would remain governed solely by the measurement interval for that sub-TLV.",
      "ja": "また、一旦閾値の境界の外側境界内測定の任意の再広告は、そのサブTLVの測定間隔によってのみ支配されたままであろう。"
    },
    {
      "indent": 0,
      "text": "6. Announcement Suppression",
      "section_title": true,
      "ja": "6.アナウンス抑制"
    },
    {
      "indent": 3,
      "text": "When link performance values change by small amounts that fall under thresholds that would cause the announcement of a sub-TLV, implementations SHOULD suppress sub-TLV re-advertisement and/or lengthen the period within which they are refreshed.",
      "ja": "リンク性能値は、サブTLVの発表を引き起こすしきい値に該当し、少量で変更すると、実装では、サブTLVの再広告を抑制し、および/または、それらが更新されている範囲内で期間を延長すべきです。"
    },
    {
      "indent": 3,
      "text": "Only the accelerated advertisement threshold mechanism described in Section 5 may shorten the re-advertisement interval.",
      "ja": "セクション5で説明のみ加速広告しきい値機構は、再広告間隔を短くすることができます。"
    },
    {
      "indent": 3,
      "text": "All suppression and re-advertisement interval back-off timer features SHOULD be configurable.",
      "ja": "すべての抑制と再広告間隔バックオフタイマー機能は設定可能であるべきです。"
    },
    {
      "indent": 0,
      "text": "7. Network Stability and Announcement Periodicity",
      "section_title": true,
      "ja": "7.ネットワークの安定性とアナウンス周期性"
    },
    {
      "indent": 3,
      "text": "Sections 5 and 6 provide configurable mechanisms to bound the number of re-advertisements. Instability might occur in very large networks if measurement intervals are set low enough to overwhelm the processing of flooded information at some of the routers in the topology. Therefore, care should be taken in setting these values.",
      "ja": "セクション5及び6は、再広告の数を結合するために構成可能なメカニズムを提供します。測定間隔は、トポロジ内のルータの一部で浸水情報の処理を圧倒するのに十分低く設定されている場合不安定性は、非常に大規模なネットワークで発生する可能性があります。そのため、注意がこれらの値を設定する際に注意が必要です。"
    },
    {
      "indent": 3,
      "text": "Additionally, the default measurement interval for all sub-TLVs should be 30 seconds.",
      "ja": "また、すべてのサブTLVのためのデフォルトの測定間隔は30秒でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Announcements must also be able to be throttled using configurable inter-update throttle timers. The minimum announcement periodicity is 1 announcement per second. The default value should be set to 120 seconds.",
      "ja": "告知も設定間更新スロットルタイマーを使用して絞ることができなければなりません。最小発表周期は、毎秒1つのアナウンスメントです。デフォルト値は120秒に設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Implementations should not permit the inter-update timer to be lower than the measurement interval.",
      "ja": "実装は測定間隔よりも低くする間更新タイマを許可してはいけません。"
    },
    {
      "indent": 3,
      "text": "Furthermore, it is recommended that any underlying performance measurement mechanisms not include any significant buffer delay, any significant buffer induced delay variation, or any significant loss due to buffer overflow or due to active queue management.",
      "ja": "また、任意の下層の性能測定機構は、任意の有意なバッファ遅延、有意な緩衝誘起遅延変動、またはバッファオーバーフローによるまたはによるアクティブキュー管理に重大な損失を含めないことをお勧めします。"
    },
    {
      "indent": 0,
      "text": "8. Enabling and Disabling Sub-TLVs",
      "section_title": true,
      "ja": "8.サブTLVを有効化および無効化"
    },
    {
      "indent": 3,
      "text": "Implementations MUST make it possible to individually enable or disable the advertisement of each sub-TLV.",
      "ja": "実装は、個別に各サブTLVの広告を有効または無効にすることを可能にしなければなりません。"
    },
    {
      "indent": 0,
      "text": "9. Static Metric Override",
      "section_title": true,
      "ja": "9.静的メトリックの上書き"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD permit the static configuration and/or manual override of dynamic measurements for each sub-TLV in order to simplify migration and to mitigate scenarios where dynamic measurements are not possible.",
      "ja": "実装は、移行を簡素化し、動的測定が不可能なシナリオを軽減するために、静的構成および/または各サブTLVのための動的測定の手動操作を可能にすべきです。"
    },
    {
      "indent": 0,
      "text": "10. Compatibility",
      "section_title": true,
      "ja": "10.互換性"
    },
    {
      "indent": 3,
      "text": "As per [RFC3630], an unrecognized TLV should be silently ignored. That is, it should not be processed but it should be included in LSAs sent to OSPF neighbors.",
      "ja": "[RFC3630]あたりとして、認識されないTLVは静かに無視されるべきです。それは、それが処理されるべきではありませんが、それはOSPFネイバーに送信されたLSAに含まれるべきである、です。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not introduce security issues beyond those discussed in [RFC3630]. OSPFv2 HMAC-SHA [RFC5709] provides additional protection for OSPFv2. OSPFv3 IPsec [RFC4552] and OSPFv3 Authentication Trailer [RFC7166] provide additional protection for OSPFv3.",
      "ja": "この文書では、[RFC3630]で議論したものを超えたセキュリティ上の問題を紹介しません。 OSPFv2のHMAC-SHA [RFC5709]はOSPFv2のための追加的な保護を提供します。 OSPFv3のIPsecの[RFC4552]およびOSPFv3の認証トレーラー[RFC7166] OSPFv3のための追加的な保護を提供します。"
    },
    {
      "indent": 3,
      "text": "OSPF Keying and Authentication for Routing Protocols (KARP) [RFC6863] provides an analysis of OSPFv2 and OSPFv3 routing security, and OSPFv2 Security Extensions [OSPFSEC] provides extensions designed to address the identified gaps in OSPFv2.",
      "ja": "OSPFキーイングおよび認証ルーティングプロトコルのための（カープ）[RFC6863]のOSPFv2およびOSPFv3のルーティングセキュリティの分析を提供し、OSPFv2のセキュリティ拡張[OSPFSEC]はOSPFv2の内の識別ギャップに対処するために設計された拡張機能を提供します。"
    },
    {
      "indent": 0,
      "text": "12. IANA Considerations",
      "section_title": true,
      "ja": "12. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA maintains the registry for the Link TLV sub-TLVs. For OSPF TE Metric Extensions, one new type code for each sub-TLV defined in this document has been registered, as follows:",
      "ja": "IANAは、リンクTLVのサブTLVのためのレジストリを維持します。次のようにOSPF TEメトリック拡張のために、本文書で定義された各サブTLVのための1つの新しいタイプのコードが、登録されています。"
    },
    {
      "indent": 3,
      "text": "Value Sub-TLV",
      "ja": "バリューサブTLV"
    },
    {
      "indent": 5,
      "text": "27 Unidirectional Link Delay",
      "ja": "27単方向リンク遅延"
    },
    {
      "indent": 5,
      "text": "28 Min/Max Unidirectional Link Delay",
      "ja": "28最小/最大単方向リンク遅延"
    },
    {
      "indent": 5,
      "text": "29 Unidirectional Delay Variation",
      "ja": "29単方向遅延変動"
    },
    {
      "indent": 5,
      "text": "30 Unidirectional Link Loss",
      "ja": "30単方向リンク損失"
    },
    {
      "indent": 5,
      "text": "31 Unidirectional Residual Bandwidth",
      "ja": "31単方向残余帯域"
    },
    {
      "indent": 5,
      "text": "32 Unidirectional Available Bandwidth",
      "ja": "32単方向利用可能な帯域幅"
    },
    {
      "indent": 5,
      "text": "33 Unidirectional Utilized Bandwidth",
      "ja": "33単方向利用される帯域幅"
    },
    {
      "indent": 0,
      "text": "13. References",
      "section_title": true,
      "ja": "13.参考文献"
    },
    {
      "indent": 0,
      "text": "13.1. Normative References",
      "section_title": true,
      "ja": "13.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月、<http://www.rfc-editor.org/info/rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3630] Katz, D., Kompella, K., and D. Yeung, \"Traffic Engineering (TE) Extensions to OSPF Version 2\", RFC 3630, September 2003, <http://www.rfc-editor.org/info/rfc3630>.",
      "ja": "[RFC3630]カッツ、D.、Kompella、K.、およびD.ヨン、 \"トラフィックエンジニアリング（TE）OSPFバージョン2への拡張\"、RFC 3630、2003年9月、<http://www.rfc-editor.org/情報/ RFC3630>。"
    },
    {
      "indent": 3,
      "text": "[RFC5329] Ishiguro, K., Manral, V., Davey, A., and A. Lindem, Ed., \"Traffic Engineering Extensions to OSPF Version 3\", RFC 5329, September 2008, <http://www.rfc-editor.org/info/rfc5329>.",
      "ja": "[RFC5329]石黒、K.、Manral、V.、デイビー、A.、およびA. Lindem、エド、 \"OSPFバージョン3へのトラフィックエンジニアリングの拡張\"、RFC 5329、2008年9月、<のhttp：。//www.rfc -editor.org/info/rfc5329>。"
    },
    {
      "indent": 3,
      "text": "[IEEE754] Institute of Electrical and Electronics Engineers, \"Standard for Floating-Point Arithmetic\", IEEE Standard 754, August 2008.",
      "ja": "[IEEE754]「浮動小数点演算のための標準的な」電気電子技術の研究所、IEEE規格754、2008年8月。"
    },
    {
      "indent": 0,
      "text": "13.2. Informative References",
      "section_title": true,
      "ja": "13.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001, <http://www.rfc-editor.org/info/rfc3209>.",
      "ja": "[RFC3209] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニヴァサン、V.、およびG.ツバメ、 \"RSVP-TE：LSPトンネルのためのRSVPの拡張\"、RFC 3209年12月2001年、<http://www.rfc-editor.org/info/rfc3209>。"
    },
    {
      "indent": 3,
      "text": "[RFC4206] Kompella, K. and Y. Rekhter, \"Label Switched Paths (LSP) Hierarchy with Generalized Multi-Protocol Label Switching (GMPLS) Traffic Engineering (TE)\", RFC 4206, October 2005, <http://www.rfc-editor.org/info/rfc4206>.",
      "ja": "[RFC4206] Kompella、K.とY. Rekhterは、RFC 4206、2005年10月 \"ラベル・パス（LSP）の階層は、スイッチング汎用マルチプロトコルラベル（GMPLS）トラフィックエンジニアリング（TE）とスイッチ\"、<のhttp：// WWW。 rfc-editor.org/info/rfc4206>。"
    },
    {
      "indent": 3,
      "text": "[RFC4552] Gupta, M. and N. Melam, \"Authentication/Confidentiality for OSPFv3\", RFC 4552, June 2006, <http://www.rfc-editor.org/info/rfc4552>.",
      "ja": "[RFC4552]グプタ、M.およびN.メラム、 \"OSPFv3のための認証/機密性\"、RFC 4552、2006年6月、<http://www.rfc-editor.org/info/rfc4552>。"
    },
    {
      "indent": 3,
      "text": "[RFC4655] Farrel, A., Vasseur, J.-P., and J. Ash, \"A Path Computation Element (PCE)-Based Architecture\", RFC 4655, August 2006, <http://www.rfc-editor.org/info/rfc4655>.",
      "ja": "[RFC4655]ファレル、A.、Vasseur、J.-P.、およびJ.アッシュ、 \"パス計算要素（PCE）ベースのアーキテクチャ\"、RFC 4655、2006年8月、<のhttp：//www.rfc-editor .ORG /情報/ RFC4655>。"
    },
    {
      "indent": 3,
      "text": "[RFC5250] Berger, L., Bryskin, I., Zinin, A., and R. Coltun, \"The OSPF Opaque LSA Option\", RFC 5250, July 2008, <http://www.rfc-editor.org/info/rfc5250>.",
      "ja": "[RFC5250]バーガー、L.、Bryskin、I.、ジニン、A.、およびR. Coltun、 \"OSPFオペークLSAオプション\"、RFC 5250、2008年7月、<http://www.rfc-editor.org/情報/ rfc5250>。"
    },
    {
      "indent": 3,
      "text": "[RFC5709] Bhatia, M., Manral, V., Fanto, M., White, R., Barnes, M., Li, T., and R. Atkinson, \"OSPFv2 HMAC-SHA Cryptographic Authentication\", RFC 5709, October 2009, <http://www.rfc-editor.org/info/rfc5709>.",
      "ja": "[RFC5709] Bhatiaは、M.、Manral、V.、Fanto、M.、ホワイト、R.、バーンズ、M.、李、T.、およびR.アトキンソン、 \"OSPFv2のHMAC-SHA暗号化認証\"、RFC 5709、 2009年10月、<http://www.rfc-editor.org/info/rfc5709>。"
    },
    {
      "indent": 3,
      "text": "[RFC6374] Frost, D. and S. Bryant, \"Packet Loss and Delay Measurement for MPLS Networks\", RFC 6374, September 2011, <http://www.rfc-editor.org/info/rfc6374>.",
      "ja": "[RFC6374]フロスト、D.とS.ブライアント、 \"MPLSネットワークのパケットロスや遅延測定\"、RFC 6374、2011年9月、<http://www.rfc-editor.org/info/rfc6374>。"
    },
    {
      "indent": 3,
      "text": "[RFC6863] Hartman, S. and D. Zhang, \"Analysis of OSPF Security According to the Keying and Authentication for Routing Protocols (KARP) Design Guide\", RFC 6863, March 2013, <http://www.rfc-editor.org/info/rfc6863>.",
      "ja": "[RFC6863]ハートマン、S.およびD.張、RFC 6863、2013年3月 \"ルーティングプロトコルのためのキーイングと認証（カープ）デザインガイドによると、OSPFのセキュリティの分析\"、<のhttp：//www.rfc-editor。組織/情報/ rfc6863>。"
    },
    {
      "indent": 3,
      "text": "[RFC7166] Bhatia, M., Manral, V., and A. Lindem, \"Supporting Authentication Trailer for OSPFv3\", RFC 7166, March 2014, <http://www.rfc-editor.org/info/rfc7166>.",
      "ja": "[RFC7166] Bhatiaは、M.、Manral、V.、およびA. Lindem、 \"OSPFv3のための支持認証トレーラー\"、RFC 7166、2014年3月、<http://www.rfc-editor.org/info/rfc7166>。"
    },
    {
      "indent": 3,
      "text": "[RFC7285] Alimi, R., Ed., Penno, R., Ed., Yang, Y., Ed., Kiesel, S., Previdi, S., Roome, W., Shalunov, S., and R. Woundy, \"Application-Layer Traffic Optimization (ALTO) Protocol\", RFC 7285, September 2014, <http://www.rfc-editor.org/info/rfc7285>.",
      "ja": "[RFC7285] Alimi、R.、編、Penno、R.、編、ヤン、Y.、編、キーセル、S.、Previdi、S.、Roome、W.、Shalunov、S.、およびR. Woundy、 \"アプリケーションレイヤトラフィックの最適化（ALTO）プロトコル\"、RFC 7285、2014年9月、<http://www.rfc-editor.org/info/rfc7285>。"
    },
    {
      "indent": 3,
      "text": "[OSPFSEC] Bhatia, M., Hartman, S., Zhang, D., and A. Lindem, Ed., \"Security Extension for OSPFv2 when Using Manual Key Management\", Work in Progress, draft-ietf-ospf-security-extension-manual-keying, November 2014.",
      "ja": "[OSPFSEC]バティア、M.、ハートマン、S.、張、D.、およびA. Lindem、エド。、 \"OSPFv2のためのセキュリティ拡張手動鍵管理の使用\" が進行中で働いて、ドラフト-IETF-OSPF-セキュリティに延長-手動キーイング、2014年11月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to recognize Nabil Bitar, Edward Crabbe, Don Fedyk, Acee Lindem, David McDysan, and Ayman Soliman for their contributions to this document.",
      "ja": "作者はこのドキュメントへの貢献のためのナビル・ビタール、エドワード・クラッブ、ドンFedyk、ACEE Lindem、デビッドMcDysan、およびアイマン・ソリマンを認識したいと思います。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to acknowledge Curtis Villamizar for his significant comments and direct content collaboration.",
      "ja": "著者らはまた、彼の重要なコメントや直接コンテンツコラボレーションのためのカーティスVillamizarを確認したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Spencer Giacalone Unaffiliated",
      "ja": "スペンサーGiacalone無所属"
    },
    {
      "indent": 3,
      "text": "EMail: spencer.giacalone@gmail.com",
      "ja": "メールアドレス：spencer.giacalone@gmail.com"
    },
    {
      "indent": 3,
      "text": "Dave Ward Cisco Systems 170 West Tasman Dr. San Jose, CA 95134 United States",
      "ja": "デイブ・ワードシスコシステムズ170西タスマン博士サンノゼ、CA 95134米国"
    },
    {
      "indent": 3,
      "text": "EMail: dward@cisco.com",
      "ja": "メールアドレス：dward@cisco.com"
    },
    {
      "indent": 3,
      "text": "John Drake Juniper Networks 1194 N. Mathilda Ave. Sunnyvale, CA 94089 United States",
      "ja": "ジョン・ドレイクジュニパーネットワークスの1194 N.マチルダアベニュー。サニーベール、CA 94089米国"
    },
    {
      "indent": 3,
      "text": "EMail: jdrake@juniper.net",
      "ja": "メールアドレス：jdrake@juniper.net"
    },
    {
      "indent": 3,
      "text": "Alia Atlas Juniper Networks 1194 N. Mathilda Ave. Sunnyvale, CA 94089 United States",
      "ja": "アリアアトラスジュニパーネットワークスの1194 N.マチルダアベニュー。サニーベール、CA 94089米国"
    },
    {
      "indent": 3,
      "text": "EMail: akatlas@juniper.net",
      "ja": "メールアドレス：akatlas@juniper.net"
    },
    {
      "indent": 3,
      "text": "Stefano Previdi Cisco Systems Via Del Serafico 200 00142 Rome Italy",
      "ja": "スティーブンは、シスコシステムズヴィアデルセラフィック200 00142ローマイタリアを予見しました"
    },
    {
      "indent": 3,
      "text": "EMail: sprevidi@cisco.com",
      "ja": "メールアドレス：sprevidi@cisco.com"
    }
  ]
}