{
  "title": {
    "text": "RFC 7587 - RTP Payload Format for the Opus Speech and Audio Codec",
    "ja": "RFC 7587 - オーパス音声およびオーディオコーデックのためのRTPペイロードフォーマット"
  },
  "number": 7587,
  "created_at": "2019-10-30 19:50:16.373860+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        J. Spittka\nRequest for Comments: 7587\nCategory: Standards Track                                         K. Vos\nISSN: 2070-1721                                                  vocTone\n                                                               JM. Valin\n                                                                 Mozilla\n                                                               June 2015",
      "raw": true
    },
    {
      "indent": 9,
      "text": "RTP Payload Format for the Opus Speech and Audio Codec",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines the Real-time Transport Protocol (RTP) payload format for packetization of Opus-encoded speech and audio data necessary to integrate the codec in the most compatible way. It also provides an applicability statement for the use of Opus over RTP. Further, it describes media type registrations for the RTP payload format.",
      "ja": "この文書では、オーパス・符号化された音声と最も互換性のある方法でコーデックを統合するために必要な音声データをパケット化のためのリアルタイムトランスポートプロトコル（RTP）ペイロードフォーマットを定義します。また、RTPを超えるオーパスの使用のための適用性声明を提供します。さらに、それはRTPペイロード形式のメディアタイプ登録を説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7587.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7587で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Conventions, Definitions, and Acronyms Used in This Document    3\n3.  Opus Codec  . . . . . . . . . . . . . . . . . . . . . . . . .   4\n  3.1.  Network Bandwidth . . . . . . . . . . . . . . . . . . . .   4\n    3.1.1.  Recommended Bitrate . . . . . . . . . . . . . . . . .   4\n    3.1.2.  Variable versus Constant Bitrate  . . . . . . . . . .   4\n    3.1.3.  Discontinuous Transmission (DTX)  . . . . . . . . . .   5\n  3.2.  Complexity  . . . . . . . . . . . . . . . . . . . . . . .   6\n  3.3.  Forward Error Correction (FEC)  . . . . . . . . . . . . .   6\n  3.4.  Stereo Operation  . . . . . . . . . . . . . . . . . . . .   6\n4.  Opus RTP Payload Format . . . . . . . . . . . . . . . . . . .   7\n  4.1.  RTP Header Usage  . . . . . . . . . . . . . . . . . . . .   7\n  4.2.  Payload Structure . . . . . . . . . . . . . . . . . . . .   7\n5.  Congestion Control  . . . . . . . . . . . . . . . . . . . . .   8\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   9\n  6.1.  Opus Media Type Registration  . . . . . . . . . . . . . .   9\n7.  SDP Considerations  . . . . . . . . . . . . . . . . . . . . .  12\n  7.1.  SDP Offer/Answer Considerations . . . . . . . . . . . . .  13\n  7.2.  Declarative SDP Considerations for Opus . . . . . . . . .  15\n8.  Security Considerations . . . . . . . . . . . . . . . . . . .  15\n9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  16\n  9.1.  Normative References  . . . . . . . . . . . . . . . . . .  16\n  9.2.  Informative References  . . . . . . . . . . . . . . . . .  17\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  18\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  18",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Opus [RFC6716] is a speech and audio codec developed within the IETF Internet Wideband Audio Codec working group. The codec has a very low algorithmic delay, and it is highly scalable in terms of audio bandwidth, bitrate, and complexity. Further, it provides different modes to efficiently encode speech signals as well as music signals, thus making it the codec of choice for various applications using the Internet or similar networks.",
      "ja": "オーパス[RFC6716]はIETFインターネット広帯域オーディオコーデックワーキンググループ内で開発スピーチおよびオーディオコーデックです。コーデックは、非常に低いアルゴリズム遅延を持っており、それがオーディオ帯域幅、ビットレート、および複雑さの点で非常にスケーラブルです。さらに、効率的のでインターネット又は同様のネットワークを使用して、様々な用途のために選択されるコーデック作り、音声信号だけでなく、音楽信号を符号化するために異なるモードを提供します。"
    },
    {
      "indent": 3,
      "text": "This document defines the Real-time Transport Protocol (RTP) [RFC3550] payload format for packetization of Opus-encoded speech and audio data necessary to integrate Opus in the most compatible way. It also provides an applicability statement for the use of Opus over RTP. Further, it describes media type registrations for the RTP payload format.",
      "ja": "この文書では、リアルタイムトランスポートプロトコル（RTP）、最も互換性のある方法でオーパスを統合する必要オーパス、符号化された音声およびオーディオデータのパケットのために[RFC3550]ペイロードフォーマットを定義します。また、RTPを超えるオーパスの使用のための適用性声明を提供します。さらに、それはRTPペイロード形式のメディアタイプ登録を説明します。"
    },
    {
      "indent": 0,
      "text": "2. Conventions, Definitions, and Acronyms Used in This Document",
      "section_title": true,
      "ja": "2.規則、定義、およびこのドキュメントで使用する略語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "audio bandwidth: The range of audio frequencies being coded",
      "ja": "オーディオ帯域幅：オーディオ周波数の範囲は、符号化されています"
    },
    {
      "indent": 3,
      "text": "CBR: Constant bitrate",
      "ja": "CBR：固定ビットレート"
    },
    {
      "indent": 3,
      "text": "CPU: Central Processing Unit",
      "ja": "CPU：中央演算処理装置"
    },
    {
      "indent": 3,
      "text": "DTX: Discontinuous Transmission",
      "ja": "DTX：不連続送信"
    },
    {
      "indent": 3,
      "text": "FEC: Forward Error Correction",
      "ja": "FEC：前方誤り訂正"
    },
    {
      "indent": 3,
      "text": "IP: Internet Protocol",
      "ja": "IP：インターネットプロトコル"
    },
    {
      "indent": 3,
      "text": "samples: Speech or audio samples (per channel)",
      "ja": "（チャネルあたり）音声またはオーディオサンプル：サンプル"
    },
    {
      "indent": 3,
      "text": "SDP: Session Description Protocol",
      "ja": "SDP：セッション記述プロトコル"
    },
    {
      "indent": 3,
      "text": "SSRC: Synchronization source",
      "ja": "SSRC：同期ソース"
    },
    {
      "indent": 3,
      "text": "VBR: Variable bitrate",
      "ja": "VBR：可変ビットレート"
    },
    {
      "indent": 3,
      "text": "Throughout this document, we refer to the following definitions:",
      "ja": "このドキュメントでは、我々は次の定義を参照してください。"
    },
    {
      "indent": 3,
      "text": "+--------------+----------------+-----------------+-----------------+\n| Abbreviation |      Name      | Audio Bandwidth |  Sampling Rate  |\n|              |                |       (Hz)      |       (Hz)      |\n+--------------+----------------+-----------------+-----------------+\n|      NB      |   Narrowband   |     0 - 4000    |       8000      |\n|              |                |                 |                 |\n|      MB      |   Mediumband   |     0 - 6000    |      12000      |\n|              |                |                 |                 |\n|      WB      |    Wideband    |     0 - 8000    |      16000      |\n|              |                |                 |                 |\n|     SWB      | Super-wideband |    0 - 12000    |      24000      |\n|              |                |                 |                 |\n|      FB      |    Fullband    |    0 - 20000    |      48000      |\n+--------------+----------------+-----------------+-----------------+",
      "raw": true
    },
    {
      "indent": 22,
      "text": "Table 1: Audio Bandwidth Naming",
      "ja": "表1：オーディオ帯域幅が命名"
    },
    {
      "indent": 0,
      "text": "3. Opus Codec",
      "section_title": true,
      "ja": "3.オーパスコーデック"
    },
    {
      "indent": 3,
      "text": "Opus encodes speech signals as well as general audio signals. Two different modes can be chosen, a voice mode or an audio mode, to allow the most efficient coding depending on the type of the input signal, the sampling frequency of the input signal, and the intended application.",
      "ja": "オーパスは、音声信号だけでなく、一般的なオーディオ信号を符号化します。 2つの異なるモード、音声モードまたは音声モードは、入力信号、入力信号のサンプリング周波数、及び意図される用途の種類に応じて、最も効率的な符号化を可能にするために、選択することができます。"
    },
    {
      "indent": 3,
      "text": "The voice mode allows efficient encoding of voice signals at lower bitrates while the audio mode is optimized for general audio signals at medium and higher bitrates.",
      "ja": "音声モードを媒体とより高いビットレートで一般的なオーディオ信号のために最適化されている間、音声モードは、低ビットレートで音声信号の効率的な符号化を可能にします。"
    },
    {
      "indent": 3,
      "text": "Opus is highly scalable in terms of audio bandwidth, bitrate, and complexity. Further, Opus allows transmitting stereo signals with in-band signaling in the bitstream.",
      "ja": "オーパスは、オーディオ帯域幅、ビットレート、および複雑さの点で非常にスケーラブルです。さらに、オーパスは、ビットストリームにおける帯域内シグナリングでステレオ信号を送信することができます。"
    },
    {
      "indent": 0,
      "text": "3.1. Network Bandwidth",
      "section_title": true,
      "ja": "3.1. ネットワーク回線容量"
    },
    {
      "indent": 3,
      "text": "Opus supports bitrates from 6 kbit/s to 510 kbit/s. The bitrate can be changed dynamically within that range. All other parameters being equal, higher bitrates result in higher audio quality.",
      "ja": "オーパスは510キロビット/秒に6キロビット/秒からのビットレートをサポートしています。ビットレートは、その範囲内で動的に変更することができます。等しい他のすべてのパラメータは、高いビットレートは、より高いオーディオ品質につながります。"
    },
    {
      "indent": 0,
      "text": "3.1.1. Recommended Bitrate",
      "section_title": true,
      "ja": "3.1.1. 推奨ビットレート"
    },
    {
      "indent": 3,
      "text": "For a frame size of 20 ms, these are the bitrate \"sweet spots\" for Opus in various configurations:",
      "ja": "20ミリ秒のフレームサイズのために、これらは、様々な構成でオーパスのためのビットレート「スイートスポット」のとおりです。"
    },
    {
      "indent": 3,
      "text": "o 8-12 kbit/s for NB speech,",
      "ja": "O 8-12キロビット/秒NBスピーチのために、"
    },
    {
      "indent": 3,
      "text": "o 16-20 kbit/s for WB speech,",
      "ja": "O 16-20キロビット/秒WBスピーチのために、"
    },
    {
      "indent": 3,
      "text": "o 28-40 kbit/s for FB speech,",
      "ja": "O FBのスピーチのための28から40キロビット/秒、"
    },
    {
      "indent": 3,
      "text": "o 48-64 kbit/s for FB mono music, and",
      "ja": "FBのモノラル音楽用O 48から64キロビット/秒、および"
    },
    {
      "indent": 3,
      "text": "o 64-128 kbit/s for FB stereo music.",
      "ja": "FBのステレオ音楽用O 64から128キロビット/秒。"
    },
    {
      "indent": 0,
      "text": "3.1.2. Variable versus Constant Bitrate",
      "section_title": true,
      "ja": "3.1.2. 固定ビットレート対変数"
    },
    {
      "indent": 3,
      "text": "For the same average bitrate, variable bitrate (VBR) can achieve higher audio quality than constant bitrate (CBR). For the majority of voice transmission applications, VBR is the best choice. One reason for choosing CBR is the potential information leak that _might_ occur when encrypting the compressed stream. See [RFC6562] for guidelines on when VBR is appropriate for encrypted audio communications. In the case where an existing VBR stream needs to be converted to CBR for security reasons, the Opus padding mechanism described in [RFC6716] is the RECOMMENDED way to achieve padding because the RTP padding bit is unencrypted.",
      "ja": "同じ平均ビットレートのために、可変ビットレート（VBR）は一定ビットレート（CBR）より高いオーディオ品質を達成することができます。音声伝送アプリケーションの大半について、VBRは最良の選択です。 CBRを選ぶ理由の一つは、圧縮ストリームを暗号化するときに発生する可能性_might_情報漏洩です。 VBRは暗号化されたオーディオ通信に適しているときのガイドラインについては、[RFC6562]を参照してください。 RTPパディングビットが暗号化されていないため、既存のVBRストリームは、セキュリティ上の理由のためにCBRに変換する必要がある場合には、[RFC6716]に記載のオーパスパディング機構は、パディングを達成するために推奨される方法です。"
    },
    {
      "indent": 3,
      "text": "The bitrate can be adjusted at any point in time. To avoid congestion, the average bitrate SHOULD NOT exceed the available network bandwidth. If no target bitrate is specified, the bitrates specified in Section 3.1.1 are RECOMMENDED.",
      "ja": "ビットレートは、任意の時点で調整することができます。混雑を避けるために、平均ビットレートは、利用可能なネットワーク帯域幅を超えないようにしてください。何のターゲットビットレートが指定されていない場合は、セクション3.1.1で指定されたビットレートを推奨します。"
    },
    {
      "indent": 0,
      "text": "3.1.3. Discontinuous Transmission (DTX)",
      "section_title": true,
      "ja": "3.1.3. 不連続送信（DTX）"
    },
    {
      "indent": 3,
      "text": "Opus can, as described in Section 3.1.2, be operated with a variable bitrate. In that case, the encoder will automatically reduce the bitrate for certain input signals, like periods of silence. When using continuous transmission, it will reduce the bitrate when the characteristics of the input signal permit, but it will never interrupt the transmission to the receiver. Therefore, the received signal will maintain the same high level of audio quality over the full duration of a transmission while minimizing the average bitrate over time.",
      "ja": "オーパスは、セクション3.1.2で説明したように、可変ビットレートで動作することができます。その場合、エンコーダは、自動的に無音の期間のように、特定の入力信号のビットレートを削減します。連続送信を使用する場合は、時に入力信号許可証の特性、それはビットレートが低下しますが、それは受信機への送信を中断することはありません。経時的な平均ビットレートを最小化しつつ、受信信号は、送信の全期間にわたって、音声品質の同じハイレベルを維持します。"
    },
    {
      "indent": 3,
      "text": "In cases where the bitrate of Opus needs to be reduced even further or in cases where only constant bitrate is available, the Opus encoder can use Discontinuous Transmission (DTX), where parts of the encoded signal that correspond to periods of silence in the input speech or audio signal are not transmitted to the receiver. A receiver can distinguish between DTX and packet loss by looking for gaps in the sequence number, as described by Section 4.1 of [RFC3551].",
      "ja": "オーパスのビットレートがさらにのみ定数ビットレートが利用可能である場合には小さくする必要がある場合には、オーパスエンコーダは、符号化信号の一部が入力音声に無音の期間に対応する不連続送信（DTX）を、使用することができ又はオーディオ信号を受信機に送信されません。 [RFC3551]のセクション4.1により記載されたように、受信機は、シーケンス番号のギャップを探すことによってDTXとパケット損失とを区別することができます。"
    },
    {
      "indent": 3,
      "text": "On the receiving side, the non-transmitted parts will be handled by a frame loss concealment unit in the Opus decoder, which generates a comfort noise signal to replace the non-transmitted parts of the speech or audio signal. Using Comfort Noise as defined in [RFC3389] with Opus is discouraged. The transmitter MUST drop whole frames only, based on the size of the last transmitted frame, to ensure successive RTP timestamps differ by a multiple of 120 and to allow the receiver to use whole frames for concealment.",
      "ja": "受信側では、未送信部は、音声又はオーディオ信号の未送信部分を置き換えるために快適雑音信号を生成オーパスデコーダにおけるフレーム消失隠蔽装置によって処理されるであろう。オーパスと[RFC3389]で定義されるように使用してコンフォートノイズが推奨されます。送信機は、連続したRTPタイムスタンプは、120の倍数だけ異なると受信機が隠蔽のための全フレームを使用できるように保証するために、最後に送信されたフレームのサイズに基づいて、唯一の全体フレームをドロップしなければなりません。"
    },
    {
      "indent": 3,
      "text": "DTX can be used with both variable and constant bitrate. It will have a slightly lower speech or audio quality than continuous transmission. Therefore, using continuous transmission is RECOMMENDED unless constraints on available network bandwidth are severe.",
      "ja": "DTXは、変数と固定ビットレートの両方で使用することができます。これは、連続送信よりも若干低いスピーチやオーディオ品質を持つことになります。利用可能なネットワーク帯域幅の制約が厳しい場合を除きしたがって、連続送信を使用することは推奨されています。"
    },
    {
      "indent": 0,
      "text": "3.2. Complexity",
      "section_title": true,
      "ja": "3.2. 複雑"
    },
    {
      "indent": 3,
      "text": "Complexity of the encoder can be scaled to optimize for CPU resources in real time, mostly as a trade-off between audio quality and bitrate. Also, different modes of Opus have different complexity.",
      "ja": "エンコーダの複雑さは、ほとんどのオーディオ品質とビットレートとの間のトレードオフとして、リアルタイムにCPUリソースを最適化するためにスケーリングすることができます。また、オーパスの異なるモードは、異なる複雑さを持っています。"
    },
    {
      "indent": 0,
      "text": "3.3. Forward Error Correction (FEC)",
      "section_title": true,
      "ja": "3.3. 前方誤り訂正（FEC）"
    },
    {
      "indent": 3,
      "text": "The voice mode of Opus allows for embedding in-band Forward Error Correction (FEC) data into the Opus bitstream. This FEC scheme adds redundant information about the previous packet (N-1) to the current output packet N. For each frame, the encoder decides whether to use FEC based on (1) an externally provided estimate of the channel's packet loss rate; (2) an externally provided estimate of the channel's capacity; (3) the sensitivity of the audio or speech signal to packet loss; and (4) whether the receiving decoder has indicated it can take advantage of in-band FEC information. The decision to send in-band FEC information is entirely controlled by the encoder; therefore, no special precautions for the payload have to be taken.",
      "ja": "オーパスの音声モードがオーパスビットストリームにインバンド順方向誤り訂正（FEC）データを埋め込むことを可能にします。このFECスキームは、エンコーダが、チャネルのパケット損失率の（1）外部に設けられ推定に基づいてFECを使用するかどうかを決定し、各フレームについて、現在の出力パケットNに前のパケット（N-1）についての冗長な情報を付加します。 （2）チャネルの容量の外部に設けられた推定値。 （3）パケット損失にオーディオ又は音声信号の感度。 （4）受信したデコーダは、帯域内FEC情報を利用することができる示しているかどうか。インバンドFEC情報を送信する決定は、完全エンコーダによって制御されます。そのため、ペイロードのための特別な予防措置が取られなければなりません。"
    },
    {
      "indent": 3,
      "text": "On the receiving side, the decoder can take advantage of this additional information when it loses a packet and the next packet is available. In order to use the FEC data, the jitter buffer needs to provide access to payloads with the FEC data. Instead of performing loss concealment for a missing packet, the receiver can then configure its decoder to decode the FEC data from the next packet.",
      "ja": "それがパケットを失い、次のパケットが利用可能である場合、受信側では、デコーダは、この追加情報を利用することができます。 FECデータを使用するためには、ジッタバッファは、FECデータをペイロードへのアクセスを提供する必要があります。代わりに、欠落パケットに対する損失隠蔽を実行する、受信機は、その後、次のパケットからFECデータを復号するためのデコーダを構成することができます。"
    },
    {
      "indent": 3,
      "text": "Any compliant Opus decoder is capable of ignoring FEC information when it is not needed, so encoding with FEC cannot cause interoperability problems. However, if FEC cannot be used on the receiving side, then FEC SHOULD NOT be used, as it leads to an inefficient usage of network resources. Decoder support for FEC SHOULD be indicated at the time a session is set up.",
      "ja": "任意の対応オーパスデコーダは、その相互運用性の問題を引き起こすことはできませんFECでエンコードする、それが必要とされていないFECの情報を無視することが可能です。 FECは、受信側で使用できない場合には、ネットワークリソースの非効率的な使用法につながるようしかし、その後、FECは、使用されるべきではありません。 FECのためのデコーダのサポートは、セッションが設定されている時に示すべきです。"
    },
    {
      "indent": 0,
      "text": "3.4. Stereo Operation",
      "section_title": true,
      "ja": "3.4. ステレオ操作"
    },
    {
      "indent": 3,
      "text": "Opus allows for transmission of stereo audio signals. This operation is signaled in-band in the Opus bitstream and no special arrangement is needed in the payload format. An Opus decoder is capable of handling a stereo encoding, but an application might only be capable of consuming a single audio channel.",
      "ja": "オーパスは、ステレオオーディオ信号の伝送を可能にします。この操作はオーパスビットストリーム内でインバンドシグナリングされると特別な配置は、ペイロード形式で必要とされません。オーパスデコーダは、ステレオ符号化を処理することが可能であるが、アプリケーションは、単一のオーディオチャンネルを消費することができるかもしれません。"
    },
    {
      "indent": 3,
      "text": "If a decoder cannot take advantage of the benefits of a stereo signal, this SHOULD be indicated at the time a session is set up. In that case, the sending side SHOULD NOT send stereo signals as it leads to an inefficient usage of network resources.",
      "ja": "デコーダはステレオ信号の利点を取ることができない場合は、これはセッションが設定された時点で示すべきです。それは、ネットワークリソースの非効率的な使用法につながるとして、その場合には、送信側は、ステレオ信号を送るべきではありません。"
    },
    {
      "indent": 0,
      "text": "4. Opus RTP Payload Format",
      "section_title": true,
      "ja": "4.オーパスRTPペイロードフォーマット"
    },
    {
      "indent": 3,
      "text": "The payload format for Opus consists of the RTP header and Opus payload data.",
      "ja": "オーパスのペイロードフォーマットは、RTPヘッダとオーパスペイロードデータから成ります。"
    },
    {
      "indent": 0,
      "text": "4.1. RTP Header Usage",
      "section_title": true,
      "ja": "4.1.  RTPヘッダーの使用"
    },
    {
      "indent": 3,
      "text": "The format of the RTP header is specified in [RFC3550]. The use of the fields of the RTP header by the Opus payload format is consistent with that specification.",
      "ja": "RTPヘッダのフォーマットは、[RFC3550]で指定されています。オーパスペイロードフォーマットによりRTPヘッダのフィールドの使用は、その仕様と一致しています。"
    },
    {
      "indent": 3,
      "text": "The payload length of Opus is an integer number of octets; therefore, no padding is necessary. The payload MAY be padded by an integer number of octets according to [RFC3550], although the Opus internal padding is preferred.",
      "ja": "オーパスのペイロード長をオクテットの整数です。そのため、パディングは必要ありません。オーパス内部パディングが好ましいがペイロードは、[RFC3550]に記載のオクテットの整数番号で埋められることがあります。"
    },
    {
      "indent": 3,
      "text": "The timestamp, sequence number, and marker bit (M) of the RTP header are used in accordance with Section 4.1 of [RFC3551].",
      "ja": "RTPヘッダのタイムスタンプ、シーケンス番号、およびマーカービット（M）は、[RFC3551]のセクション4.1に従って使用されます。"
    },
    {
      "indent": 3,
      "text": "The RTP payload type for Opus is to be assigned dynamically.",
      "ja": "オーパスのためのRTPペイロードタイプは、動的に割り当てられます。"
    },
    {
      "indent": 3,
      "text": "The receiving side MUST be prepared to receive duplicate RTP packets. The receiver MUST provide at most one of those payloads to the Opus decoder for decoding, and it MUST discard the others.",
      "ja": "受信側では、重複するRTPパケットを受信する準備をしなければなりません。受信機は、復号のためのオーパスデコーダにそれらのペイロードの最大1つを提供しなければなりません、そして、それは他の人を捨てなければなりません。"
    },
    {
      "indent": 3,
      "text": "Opus supports 5 different audio bandwidths, which can be adjusted during a stream. The RTP timestamp is incremented with a 48000 Hz clock rate for all modes of Opus and all sampling rates. The unit for the timestamp is samples per single (mono) channel. The RTP timestamp corresponds to the sample time of the first encoded sample in the encoded frame. For data encoded with sampling rates other than 48000 Hz, the sampling rate has to be adjusted to 48000 Hz.",
      "ja": "オーパスは、ストリーム中に調整することができる5つのオーディオ帯域幅をサポートしています。 RTPタイムスタンプは、オーパス、すべてのサンプリング・レートのすべてのモードで48000 Hzのクロックレートでインクリメントされます。タイムスタンプの単位は、単一の（モノラル）チャンネル当たりのサンプルです。 RTPタイムスタンプは、符号化フレーム内の第1の符号化サンプルのサンプル時間に対応します。 48000ヘルツ以外のサンプリングレートで符号化されたデータに対して、サンプリングレートは48000 Hzに調整しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2. Payload Structure",
      "section_title": true,
      "ja": "4.2. ペイロード構造"
    },
    {
      "indent": 3,
      "text": "The Opus encoder can output encoded frames representing 2.5, 5, 10, 20, 40, or 60 ms of speech or audio data. Further, an arbitrary number of frames can be combined into a packet, up to a maximum packet duration representing 120 ms of speech or audio data. The grouping of one or more Opus frames into a single Opus packet is defined in Section 3 of [RFC6716]. An RTP payload MUST contain exactly one Opus packet as defined by that document.",
      "ja": "オーパスエンコーダは、音声又はオーディオデータの2.5、5、10、20、40、または60ミリ秒を表すフレームを出力する符号化されたことができます。さらに、フレームの任意の数は、音声又はオーディオデータの120ミリ秒を表す最大パケット持続時間まで、パケットに組み合わせることができます。単一オーパスパケットへの1つまたは複数のオーパスフレームのグループ化は[RFC6716]のセクション3で定義されています。そのドキュメントで定義されたRTPペイロードは正確に一つのオーパスパケットを含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows the structure combined with the RTP header.",
      "ja": "図1は、RTPヘッダと組み合わされた構造を示しています。"
    },
    {
      "indent": 24,
      "text": "+----------+--------------+\n|RTP Header| Opus Payload |\n+----------+--------------+",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 1: Packet Structure with RTP Header",
      "ja": "図1：RTPヘッダを持つパケット構造"
    },
    {
      "indent": 3,
      "text": "Table 2 shows supported frame sizes in milliseconds of encoded speech or audio data for the speech and audio modes (Mode) and sampling rates (fs) of Opus, and it shows how the timestamp is incremented for packetization (ts incr). If the Opus encoder outputs multiple encoded frames into a single packet, the timestamp increment is the sum of the increments for the individual frames.",
      "ja": "表2は、オーパスのスピーチおよびオーディオモード（モード）、サンプリングレート（FS）のための符号化された音声又はオーディオデータのミリ秒単位のフレームサイズをサポートし、それがタイムスタンプがパケット（TS INCR）毎にインクリメントされる様子を示しています。オーパスエンコーダ出力複数が単一のパケットにフレームを符号化された場合、タイムスタンプインクリメントは、個々のフレームのための増分の和です。"
    },
    {
      "indent": 4,
      "text": "+---------+-----------------+-----+-----+-----+-----+------+------+\n|   Mode  |        fs       | 2.5 |  5  |  10 |  20 |  40  |  60  |\n+---------+-----------------+-----+-----+-----+-----+------+------+\n| ts incr |       all       | 120 | 240 | 480 | 960 | 1920 | 2880 |\n|         |                 |     |     |     |     |      |      |\n|  voice  | NB/MB/WB/SWB/FB |  x  |  x  |  o  |  o  |  o   |  o   |\n|         |                 |     |     |     |     |      |      |\n|  audio  |   NB/WB/SWB/FB  |  o  |  o  |  o  |  o  |  x   |  x   |\n+---------+-----------------+-----+-----+-----+-----+------+------+",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Table 2: Supported Opus frame sizes and timestamp increments are marked with an o. Unsupported ones are marked with an x.",
      "ja": "表2：サポートされているオーパスフレームサイズとタイムスタンプの増分はOでマークされています。サポートされていないものは、xでマークされています。"
    },
    {
      "indent": 0,
      "text": "5. Congestion Control",
      "section_title": true,
      "ja": "5.輻輳制御"
    },
    {
      "indent": 3,
      "text": "The target bitrate of Opus can be adjusted at any point in time, thus allowing efficient congestion control. Furthermore, the amount of encoded speech or audio data encoded in a single packet can be used for congestion control, since the transmission rate is inversely proportional to the packet duration. A lower packet transmission rate reduces the amount of header overhead, but at the same time increases latency and loss sensitivity, so it ought to be used with care.",
      "ja": "オーパスの目標ビットレートは、効率的な輻輳制御を可能にする、任意の時点で調整することができます。伝送レートは、パケット持続時間に反比例するので、単一のパケットで符号化された符号化音声またはオーディオデータの量は、輻輳制御のために使用することができます。低いパケットの伝送レートは、ヘッダーオーバーヘッドの量を減少させるが、同時に、待ち時間及び損失感度を増加させるので、注意して使用されるべきです。"
    },
    {
      "indent": 3,
      "text": "Since UDP does not provide congestion control, applications that use RTP over UDP SHOULD implement their own congestion control above the UDP layer [RFC5405]. Work in the RMCAT working group [rmcat] describes the interactions and conceptual interfaces necessary between the application components that relate to congestion control, including the RTP layer, the higher-level media codec control layer, and the lower-level transport interface, as well as components dedicated to congestion control functions.",
      "ja": "UDPは輻輳制御を提供していないので、UDP上のRTPを使用するアプリケーションは、UDP層[RFC5405]の上に、独自の輻輳制御を実装する必要があります。 【rmcat】も、RTP層、上位のメディアコーデック制御層、及び低レベルのトランスポート・インタフェースを含む輻輳制御に関連するアプリケーションコンポーネント間の必要な相互作用と概念インタフェースについて説明RMCATワーキンググループで作業輻輳制御機能に専用部品として。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "One media subtype (audio/opus) has been defined and registered as described in the following section.",
      "ja": "次のセクションで説明したように、1つのメディアサブタイプ（オーディオ/作品）が定義され、登録されています。"
    },
    {
      "indent": 0,
      "text": "6.1. Opus Media Type Registration",
      "section_title": true,
      "ja": "6.1. オーパスメディアタイプ登録"
    },
    {
      "indent": 3,
      "text": "Media type registration is done according to [RFC6838] and [RFC4855].",
      "ja": "メディアタイプの登録は[RFC6838]と[RFC4855]に従って行われます。"
    },
    {
      "indent": 3,
      "text": "Type name: audio",
      "ja": "型名：オーディオ"
    },
    {
      "indent": 3,
      "text": "Subtype name: opus",
      "ja": "サブタイプ名：作品"
    },
    {
      "indent": 3,
      "text": "Required parameters:",
      "ja": "必須パラメータ："
    },
    {
      "indent": 3,
      "text": "rate: the RTP timestamp is incremented with a 48000 Hz clock rate for all modes of Opus and all sampling rates. For data encoded with sampling rates other than 48000 Hz, the sampling rate has to be adjusted to 48000 Hz.",
      "ja": "料金：RTPタイムスタンプは、オーパスの全てのモードと、すべてのサンプリング・レートのための48000 Hzのクロックレートでインクリメントされます。 48000ヘルツ以外のサンプリングレートで符号化されたデータに対して、サンプリングレートは48000 Hzに調整しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Optional parameters:",
      "ja": "オプションのパラメータ："
    },
    {
      "indent": 3,
      "text": "maxplaybackrate: a hint about the maximum output sampling rate that the receiver is capable of rendering in Hz. The decoder MUST be capable of decoding any audio bandwidth, but, due to hardware limitations, only signals up to the specified sampling rate can be played back. Sending signals with higher audio bandwidth results in higher than necessary network usage and encoding complexity, so an encoder SHOULD NOT encode frequencies above the audio bandwidth specified by maxplaybackrate. This parameter can take any value between 8000 and 48000, although commonly the value will match one of the Opus bandwidths (Table 1). By default, the receiver is assumed to have no limitations, i.e., 48000.",
      "ja": "maxplaybackrate：受信機はHzでレンダリングすることが可能な最大出力サンプリングレートについてのヒント。デコーダは、再生することができる指定されたサンプリングレートまでの信号、ハードウェアの制限により、任意のオーディオ帯域幅をデコードすることが可能ではなく、しなければなりません。ネットワーク利用及び符号化複雑必要以上に高いオーディオ帯域幅の結果と信号を送信するので、エンコーダはmaxplaybackrateによって指定されたオーディオ帯域幅以上の周波数を符号化すべきではありません。一般に値がオーパス帯域幅（表1）のいずれかと一致するが、このパラメータは、8000と48000の間の任意の値をとることができます。デフォルトでは、受信機は48000、即ち、何ら制限を持たないものとします。"
    },
    {
      "indent": 3,
      "text": "sprop-maxcapturerate: a hint about the maximum input sampling rate that the sender is likely to produce. This is not a guarantee that the sender will never send any higher bandwidth (e.g., it could send a prerecorded prompt that uses a higher bandwidth), but it indicates to the receiver that frequencies above this maximum can safely be discarded. This parameter is useful to avoid wasting receiver resources by operating the audio processing pipeline (e.g., echo cancellation) at a higher rate than necessary. This parameter can take any value between 8000 and 48000, although commonly the value will match one of the Opus bandwidths (Table 1). By default, the sender is assumed to have no limitations, i.e., 48000.",
      "ja": "sprop-maxcapturerate：送信者が生成する可能性がある最大入力サンプリングレートについてのヒント。これは、送信者が任意のより高い帯域幅を（例えば、それはより高い帯域幅を使用して事前に録音されたプロンプトを送ることができる）送信することはありませんことを保証するものではありませんが、それは、この最大値を超える周波数を安全に廃棄することができることを受信機に示します。このパラメータは、必要以上に高いレートでオーディオ処理パイプライン（例えば、エコーキャンセル）を操作することにより、受信機資源の浪費を回避するのに有用です。一般に値がオーパス帯域幅（表1）のいずれかと一致するが、このパラメータは、8000と48000の間の任意の値をとることができます。デフォルトでは、送信者は48000、すなわち、制限がありませんと仮定しています。"
    },
    {
      "indent": 3,
      "text": "maxptime: the maximum duration of media represented by a packet (according to Section 6 of [RFC4566]) that a decoder wants to receive, in milliseconds rounded up to the next full integer value. Possible values are 3, 5, 10, 20, 40, 60, or an arbitrary multiple of an Opus frame size rounded up to the next full integer value, up to a maximum value of 120, as defined in Section 4. If no value is specified, the default is 120.",
      "ja": "maxptime：次の完全な整数値に切り上げミリ秒で、デコーダは、受信したい（[RFC4566]のセクション6に従って）パケットによって表されるメディアの最大継続時間。可能な値は3、5、10、20、40、60、又は全く値場合、セクション4で定義されるように、120の最大値まで、次の完全な整数値に切り上げオーパスフレームサイズの任意の倍数指定され、デフォルトは120です。"
    },
    {
      "indent": 3,
      "text": "ptime: the preferred duration of media represented by a packet (according to Section 6 of [RFC4566]) that a decoder wants to receive, in milliseconds rounded up to the next full integer value. Possible values are 3, 5, 10, 20, 40, 60, or an arbitrary multiple of an Opus frame size rounded up to the next full integer value, up to a maximum value of 120, as defined in Section 4. If no value is specified, the default is 20.",
      "ja": "PTIME：次の完全な整数値に切り上げミリ秒で、デコーダは、受信したい（[RFC4566]のセクション6に従って）パケットによって表されるメディアの好ましい持続時間。可能な値は3、5、10、20、40、60、又は全く値場合、セクション4で定義されるように、120の最大値まで、次の完全な整数値に切り上げオーパスフレームサイズの任意の倍数指定され、デフォルトは20です。"
    },
    {
      "indent": 3,
      "text": "maxaveragebitrate: specifies the maximum average receive bitrate of a session in bits per second (bit/s). The actual value of the bitrate can vary, as it is dependent on the characteristics of the media in a packet. Note that the maximum average bitrate MAY be modified dynamically during a session. Any positive integer is allowed, but values outside the range 6000 to 510000 SHOULD be ignored. If no value is specified, the maximum value specified in Section 3.1.1 for the corresponding mode of Opus and corresponding maxplaybackrate is the default.",
      "ja": "maxaveragebitrateは：最大平均は、第二（ビット/秒）当たりのビットのセッションのビットレートを受信指定します。それは、パケット内のメディアの特性に依存しているようにビットレートの実際の値は、変化することができます。最大平均ビットレートは、セッション中に動的に変更されてもよいことに留意されたいです。任意の正の整数が許可されているが、510000の範囲6000外の値は無視されるべきです。値が指定されない場合、オーパスと対応maxplaybackrateの対応するモードについては、セクション3.1.1で指定された最大値はデフォルトです。"
    },
    {
      "indent": 3,
      "text": "stereo: specifies whether the decoder prefers receiving stereo or mono signals. Possible values are 1 and 0, where 1 specifies that stereo signals are preferred, and 0 specifies that only mono signals are preferred. Independent of the stereo parameter, every receiver MUST be able to receive and decode stereo signals, but sending stereo signals to a receiver that signaled a preference for mono signals may result in higher than necessary network utilization and encoding complexity. If no value is specified, the default is 0 (mono).",
      "ja": "ステレオ：デコーダは、ステレオまたはモノラル信号を受信することを好むかどうかを指定します。 1ステレオ信号が好まれることを指定し、そして0のみモノラル信号が好適であることを指定する場合に可能な値は、1及び0です。ステレオパラメータの独立した、すべての受信機は、ステレオ信号を受信して​​復号することができなければならないが、モノラル信号に対する選好をシグナリング受信機にステレオ信号を送信すると、必要なネットワーク使用率および符号化複雑度よりももたらし得ます。値が指定されていない場合、デフォルトは0（モノラル）です。"
    },
    {
      "indent": 3,
      "text": "sprop-stereo: specifies whether the sender is likely to produce stereo audio. Possible values are 1 and 0, where 1 specifies that stereo signals are likely to be sent, and 0 specifies that the sender will likely only send mono. This is not a guarantee that the sender will never send stereo audio (e.g., it could send a prerecorded prompt that uses stereo), but it indicates to the receiver that the received signal can be safely downmixed to mono. This parameter is useful to avoid wasting receiver resources by operating the audio processing pipeline (e.g., echo cancellation) in stereo when not necessary. If no value is specified, the default is 0 (mono).",
      "ja": "sprop-ステレオ：送信者がステレオ音声を生成する可能性があるかどうかを指定します。 1は、ステレオ信号が送信される可能性が高いことを指定し、0は、送信者の可能性が高いだけでモノを送信することを指定します可能な値は、1と0です。これは、（例えば、それがステレオを使用する事前に録音されたプロンプトを送ることができる）送信者がステレオ音声を送信することはありませんことを保証するものではありませんが、それは、受信した信号が安全にモノラルにダウンミックスすることができることを受信機に示します。このパラメータは、必要なときはないステレオでオーディオ処理パイプライン（例えば、エコーキャンセル）を操作することにより、受信機資源の浪費を回避するのに有用です。値が指定されていない場合、デフォルトは0（モノラル）です。"
    },
    {
      "indent": 3,
      "text": "cbr: specifies if the decoder prefers the use of a constant bitrate versus a variable bitrate. Possible values are 1 and 0, where 1 specifies constant bitrate, and 0 specifies variable bitrate. If no value is specified, the default is 0 (vbr). When cbr is 1, the maximum average bitrate can still change, e.g., to adapt to changing network conditions.",
      "ja": "CBR：デコーダは、可変ビットレートに対して一定のビットレートを使用することを好むかどうかを指定します。可能な値は1が一定のビットレートを指定し、0は可変ビットレートを指定する1及び0です。値が指定されていない場合、デフォルトは0（VBR）です。 CBRが1である場合、最大平均ビットレートは、依然として変化するネットワーク条件に適合させるために、例えば、変更することができます。"
    },
    {
      "indent": 3,
      "text": "useinbandfec: specifies that the decoder has the capability to take advantage of the Opus in-band FEC. Possible values are 1 and 0. Providing 0 when FEC cannot be used on the receiving side is RECOMMENDED. If no value is specified, useinbandfec is assumed to be 0. This parameter is only a preference, and the receiver MUST be able to process packets that include FEC information, even if it means the FEC part is discarded.",
      "ja": "useinbandfec：デコーダがオーパス、帯域内FECを利用する能力を持っていることを指定します。 FECは、受信側で使用できない場合に可能な値は0を1と0提供される推奨されます。値が指定されない場合、useinbandfecこのパラメータのみ嗜好が0であると仮定され、そして受信機は、FEC部分は廃棄されることを意味場合でも、FEC情報を含むパケットを処理できなければなりません。"
    },
    {
      "indent": 3,
      "text": "usedtx: specifies if the decoder prefers the use of DTX. Possible values are 1 and 0. If no value is specified, the default is 0.",
      "ja": "usedtx：デコーダがDTXの使用を好むかどうかを指定します。可能な値は、1と0の値を指定しない場合、デフォルトは0です。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations:",
      "ja": "エンコードの考慮事項："
    },
    {
      "indent": 6,
      "text": "The Opus media type is framed and consists of binary data according to Section 4.8 of [RFC6838].",
      "ja": "オーパスメディアタイプは、[RFC6838]のセクション4.8に従ってフレームとバイナリデータで構成されています。"
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "ja": "セキュリティの考慮事項："
    },
    {
      "indent": 6,
      "text": "See Section 8 of this document.",
      "ja": "このドキュメントのセクション8を参照してください。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: none",
      "ja": "相互運用性に関する注意事項：なし"
    },
    {
      "indent": 3,
      "text": "Published specification: RFC 7587",
      "ja": "公開された仕様：RFC 7587"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type:",
      "ja": "このメディアタイプを使用するアプリケーション："
    },
    {
      "indent": 6,
      "text": "Any application that requires the transport of speech or audio data can use this media type. Some examples are, but not limited to, audio and video conferencing, Voice over IP, and media streaming.",
      "ja": "スピーチやオーディオデータの転送を必要とするアプリケーションは、このメディアタイプを使用することができます。いくつかの例がありますが、オーディオおよびビデオ会議、ボイスオーバーIP、およびメディアストリーミング、これらに限定されません。"
    },
    {
      "indent": 3,
      "text": "Fragment identifier considerations: N/A",
      "ja": "フラグメント識別子の考慮事項：N / A"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "ja": "詳細のために連絡する人とEメールアドレス："
    },
    {
      "indent": 6,
      "text": "SILK Support, silksupport@skype.net",
      "ja": "SILKサポート、silksupport@skype.net"
    },
    {
      "indent": 6,
      "text": "Jean-Marc Valin, jmvalin@jmvalin.ca",
      "ja": "ジャンマルクValinはjmvalin@jmvalin.ca"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図している用法：COMMON"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage:",
      "ja": "使用に関する制限事項："
    },
    {
      "indent": 6,
      "text": "For transfer over RTP, the RTP payload format (Section 4 of this document) SHALL be used.",
      "ja": "RTPを介して転送するために、RTPペイロード形式（この文書のセクション4）を使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Authors:",
      "ja": "著者："
    },
    {
      "indent": 6,
      "text": "Julian Spittka, jspittka@gmail.com",
      "ja": "ジュリアンSpittka、jspittka@gmail.com"
    },
    {
      "indent": 6,
      "text": "Koen Vos, koenvos74@gmail.com",
      "ja": "公園・ヴォス、koenvos74@gmail.com"
    },
    {
      "indent": 6,
      "text": "Jean-Marc Valin, jmvalin@jmvalin.ca",
      "ja": "ジャンマルクValinはjmvalin@jmvalin.ca"
    },
    {
      "indent": 3,
      "text": "Change controller: IETF Payload working group delegated from the IESG",
      "ja": "変更コントローラ：IESGから委任IETFペイロードワーキンググループ"
    },
    {
      "indent": 0,
      "text": "7. SDP Considerations",
      "section_title": true,
      "ja": "7. SDPの考慮事項"
    },
    {
      "indent": 3,
      "text": "The information described in the media type specification has a specific mapping to fields in the Session Description Protocol (SDP) [RFC4566], which is commonly used to describe RTP sessions. When SDP is used to specify sessions employing Opus, the mapping is as follows:",
      "ja": "メディアタイプ明細書に記載された情報は、一般的にRTPセッションを記述するために使用されるセッション記述プロトコル（SDP）[RFC4566]のフィールドに特定のマッピングを有します。 SDPはオーパスを用いるセッションを指定するために使用される場合、以下のように、マッピングは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o The media type (\"audio\") goes in SDP \"m=\" as the media name.",
      "ja": "Oメディアタイプ（「オーディオ」）は、メディア名としてSDP「m =」に進みます。"
    },
    {
      "indent": 3,
      "text": "o The media subtype (\"opus\") goes in SDP \"a=rtpmap\" as the encoding name. The RTP clock rate in \"a=rtpmap\" MUST be 48000, and the number of channels MUST be 2.",
      "ja": "Oメディアサブタイプ（「作品」）は、符号化名としてSDPの「a = rtpmap」に進みます。 「= rtpmap」のRTPクロックレートは48000でなければなりません、及びチャネルの数は2でなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The OPTIONAL media type parameters \"ptime\" and \"maxptime\" are mapped to \"a=ptime\" and \"a=maxptime\" attributes, respectively, in the SDP.",
      "ja": "Oオプションのメディアタイプパラメータ「PTIME」および「maxptime」はSDPで、それぞれ、属性「A = PTIME」および「A = maxptime」にマッピングされます。"
    },
    {
      "indent": 3,
      "text": "o The OPTIONAL media type parameters \"maxaveragebitrate\", \"maxplaybackrate\", \"stereo\", \"cbr\", \"useinbandfec\", and \"usedtx\", when present, MUST be included in the \"a=fmtp\" attribute in the SDP, expressed as a media type string in the form of a semicolon-separated list of parameter=value pairs (e.g., maxplaybackrate=48000). They MUST NOT be specified in an SSRC-specific \"fmtp\" source-level attribute (as defined in Section 6.3 of [RFC5576]).",
      "ja": "オプションのメディアタイプパラメータが「maxaveragebitrate」、「maxplaybackrate」、「ステレオ」、「CBR」、「useinbandfec」O、および「usedtx」は、存在する場合は、SDPの「A =のfmtp」属性に含まれなければならない、発現パラメータ=値のペアのセミコロンで区切られたリストの形式でメディアタイプ文字列（例えば、maxplaybackrate = 48000）。彼らは、（[RFC5576]のセクション6.3で定義されるように）SSRC特異的「のfmtp」ソースレベル属性で指定することはできません。"
    },
    {
      "indent": 3,
      "text": "o The OPTIONAL media type parameters \"sprop-maxcapturerate\" and \"sprop-stereo\" MAY be mapped to the \"a=fmtp\" SDP attribute by copying them directly from the media type parameter string as part of the semicolon-separated list of parameter=value pairs (e.g., sprop-stereo=1). These same OPTIONAL media type parameters MAY also be specified using an SSRC-specific \"fmtp\" source-level attribute as described in Section 6.3 of [RFC5576]. They MAY be specified in both places, in which case the parameter in the source-level attribute overrides the one found on the \"a=fmtp\" line. The value of any parameter that is not specified in a source-level source attribute MUST be taken from the \"a=fmtp\" line, if it is present there.",
      "ja": "Oオプションのメディアタイプパラメータ「のsprop-maxcapturerate」および「のsprop-ステレオ」パラメータのセミコロンで区切られたリストの一部として、メディアタイプパラメータの文字列から直接コピーすることによって、「A =のfmtp」SDP属性にマッピングされるかもしれません=値ペア（例えば、のsprop-ステレオ= 1）。 [RFC5576]のセクション6.3に記載したように、これらの同じオプションのメディアタイプパラメータもSSRC特異的「のfmtp」ソースレベル属性を使用して指定することができます。彼らは、ソースレベルの属性にパラメータが「A =のfmtp」行に見つかったものを上書きした場合には、両方の場所で指定することができます。それが存在する場合、ソース・レベル・ソース属性で指定されていないいずれかのパラメータの値は、「A =のfmtp」線から取らなければなりません。"
    },
    {
      "indent": 3,
      "text": "Below are some examples of SDP session descriptions for Opus:",
      "ja": "以下はオーパスのためのSDPセッション記述のいくつかの例は以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "Example 1: Standard mono session with 48000 Hz clock rate",
      "ja": "実施例1：48000 Hzのクロックレートを有する標準モノセッション"
    },
    {
      "indent": 7,
      "text": "m=audio 54312 RTP/AVP 101\na=rtpmap:101 opus/48000/2",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Example 2: 16000 Hz clock rate, maximum packet size of 40 ms, recommended packet size of 40 ms, maximum average bitrate of 20000 bit/s, prefers to receive stereo but only plans to send mono, FEC is desired, DTX is not desired",
      "ja": "実施例2：16000 Hzのクロックレート、40ミリ秒の最大パケットサイズは、40ミリ秒、20000ビット/秒の最大平均ビットレートでパケットサイズを推奨し、ステレオを受信することを好むだけ、FECが望まれ、DTXが望まれていないモノを送信する予定"
    },
    {
      "indent": 7,
      "text": "m=audio 54312 RTP/AVP 101\na=rtpmap:101 opus/48000/2\na=fmtp:101 maxplaybackrate=16000; sprop-maxcapturerate=16000;\nmaxaveragebitrate=20000; stereo=1; useinbandfec=1; usedtx=0\na=ptime:40\na=maxptime:40",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Example 3: Two-way full-band stereo preferred",
      "ja": "例3：優先双方向フルバンド・ステレオ"
    },
    {
      "indent": 7,
      "text": "m=audio 54312 RTP/AVP 101\na=rtpmap:101 opus/48000/2\na=fmtp:101 stereo=1; sprop-stereo=1",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7.1. SDP Offer/Answer Considerations",
      "section_title": true,
      "ja": "7.1.  SDPオファー/回答の考慮事項"
    },
    {
      "indent": 3,
      "text": "When using the offer/answer procedure described in [RFC3264] to negotiate the use of Opus, the following considerations apply:",
      "ja": "オーパスの使用を交渉するために、[RFC3264]で説明オファー/アンサー手続きを使用する場合は、次の考慮事項が適用されます。"
    },
    {
      "indent": 3,
      "text": "o Opus supports several clock rates. For signaling purposes, only the highest, i.e., 48000, is used. The actual clock rate of the corresponding media is signaled inside the payload and is not restricted by this payload format description. The decoder MUST be capable of decoding every received clock rate. An example is shown below:",
      "ja": "Oオーパスは、いくつかのクロック・レートをサポートしています。目的のシグナリングのために、唯一の最高、即ち、48000は、使用されます。対応するメディアの実際のクロックレートは、ペイロードの内部にシグナリングされると、このペイロード形式の説明によって限定されるものではありません。デコーダは、すべての受信されたクロックレートをデコードすることができなければなりません。例を以下に示します。"
    },
    {
      "indent": 7,
      "text": "m=audio 54312 RTP/AVP 100\na=rtpmap:100 opus/48000/2",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o The \"ptime\" and \"maxptime\" parameters are unidirectional receive-only parameters and typically will not compromise interoperability; however, some values might cause application performance to suffer. [RFC3264] defines the SDP offer/answer handling of the \"ptime\" parameter. The \"maxptime\" parameter MUST be handled in the same way.",
      "ja": "O「PTIME」と「maxptime」パラメータは一方向の受信専用のパラメータであり、典型的には相互運用性が損なわれることはありません。しかし、いくつかの値は、アプリケーションのパフォーマンスが低下することがあります。 [RFC3264]は、「PTIME」パラメータのSDPオファー/アンサー取り扱いを定義します。 「maxptime」パラメータは同じように扱われなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The \"maxplaybackrate\" parameter is a unidirectional receive-only parameter that reflects limitations of the local receiver. When sending to a single destination, a sender MUST NOT use an audio bandwidth higher than necessary to make full use of audio sampled at a sampling rate of \"maxplaybackrate\". Gateways or senders that are sending the same encoded audio to multiple destinations SHOULD NOT use an audio bandwidth higher than necessary to represent audio sampled at \"maxplaybackrate\", as this would lead to inefficient use of network resources. The \"maxplaybackrate\" parameter does not affect interoperability. Also, this parameter SHOULD NOT be used to adjust the audio bandwidth as a function of the bitrate, as this is the responsibility of the Opus encoder implementation.",
      "ja": "O「maxplaybackrate」パラメータは、ローカル受信機の限界を反映一方向受信専用パラメータです。単一の宛先に送信する場合、送信者は「maxplaybackrate」のサンプリングレートでサンプリングされたオーディオを最大限に活用するために必要以上のオーディオ帯域幅を使用してはなりません。これは、ネットワークリソースの非効率的な利用につながるとして、複数の宛先に同じ符号化された音声を送信するゲートウェイまたは送信者は、「maxplaybackrate」でサンプリングされた音声を表現するために必要以上のオーディオ帯域幅を使用しないでください。 「maxplaybackrate」パラメータは、相互運用性には影響を与えません。これはオーパスエンコーダの実装の責任があるとしても、このパラメータは、ビットレートの関数としてのオーディオ帯域幅を調整するために使用されるべきではありません。"
    },
    {
      "indent": 3,
      "text": "o The \"maxaveragebitrate\" parameter is a unidirectional receive-only parameter that reflects limitations of the local receiver. The sender of the other side MUST NOT send with an average bitrate higher than \"maxaveragebitrate\" as it might overload the network and/or receiver. The \"maxaveragebitrate\" parameter typically will not compromise interoperability; however, some values might cause application performance to suffer and ought to be set with care.",
      "ja": "O「maxaveragebitrate」パラメータは、ローカル受信機の限界を反映一方向受信専用パラメータです。それは、ネットワークおよび/または受信機をオーバーロード可能性があるとして、反対側の送信者が「maxaveragebitrate」よりも高い平均ビットレートで送ってはいけません。 「maxaveragebitrate」パラメータは、通常の相互運用性を損なうことはありません。しかし、いくつかの値は、アプリケーションのパフォーマンスが低下し、注意して設定されるべきであるために発生する可能性があります。"
    },
    {
      "indent": 3,
      "text": "o The \"sprop-maxcapturerate\" and \"sprop-stereo\" parameters are unidirectional sender-only parameters that reflect limitations of the sender side. They allow the receiver to set up a reduced-complexity audio processing pipeline if the sender is not planning to use the full range of Opus's capabilities. Neither \"sprop-maxcapturerate\" nor \"sprop-stereo\" affect interoperability, and the receiver MUST be capable of receiving any signal.",
      "ja": "「のsprop-maxcapturerate」と「のsprop-ステレオ」Oパラメータは、送信側の限界を反映一方向の送信者専用のパラメータがあります。彼らは、送信者がオーパスの機能の完全な範囲を使用することを計画されていない場合は、受信機が減少し、複雑オーディオ処理パイプラインを設定することができます。 「のsprop-maxcapturerate」でも「のsprop-ステレオ」はいずれも、相互運用性に影響し、受信機は、任意の信号を受信することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The \"stereo\" parameter is a unidirectional receive-only parameter. When sending to a single destination, a sender MUST NOT use stereo when \"stereo\" is 0. Gateways or senders that are sending the same encoded audio to multiple destinations SHOULD NOT use stereo when \"stereo\" is 0, as this would lead to inefficient use of network resources. The \"stereo\" parameter does not affect interoperability.",
      "ja": "O「ステレオ」パラメータは、一方向の受信専用のパラメータです。単一の宛先に送信する場合は、「ステレオ」、「ステレオ」は0であるとき、これは非効率的につながるよう、ステレオを使用するべきではありません複数の宛先に同じ符号化音声を送信している0ゲートウェイまたは送信者であるとき、送信者はステレオを使用してはなりませんネットワーク・リソースの使用。 「ステレオ」パラメータは、相互運用性には影響を与えません。"
    },
    {
      "indent": 3,
      "text": "o The \"cbr\" parameter is a unidirectional receive-only parameter.",
      "ja": "O「CBR」パラメータは、一方向の受信専用のパラメータです。"
    },
    {
      "indent": 3,
      "text": "o The \"useinbandfec\" parameter is a unidirectional receive-only parameter.",
      "ja": "O「useinbandfec」パラメータは、一方向の受信専用のパラメータです。"
    },
    {
      "indent": 3,
      "text": "o The \"usedtx\" parameter is a unidirectional receive-only parameter.",
      "ja": "O「usedtx」パラメータは、一方向の受信専用のパラメータです。"
    },
    {
      "indent": 3,
      "text": "o Any unknown parameter in an offer MUST be ignored by the receiver and MUST be removed from the answer.",
      "ja": "Oのオファー内の任意の未知パラメータは、受信機によって無視されなければならないとの回答から除去されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Opus parameters in an SDP offer/answer exchange are completely orthogonal, and there is no relationship between the SDP offer and the answer.",
      "ja": "SDPオファー/アンサー交換でオーパスパラメータが完全に直交しており、SDPオファーと回答との間には関係がありません。"
    },
    {
      "indent": 0,
      "text": "7.2. Declarative SDP Considerations for Opus",
      "section_title": true,
      "ja": "7.2. オーパスのための宣言型SDPの注意事項"
    },
    {
      "indent": 3,
      "text": "For declarative use of SDP such as in the Session Announcement Protocol (SAP) [RFC2974] and the Real Time Streaming Protocol (RTSP) [RFC2326] for Opus, the following needs to be considered:",
      "ja": "宣言型なセッションアナウンスメントプロトコル（SAP）のように、SDPの使用[RFC2974]とオーパスのためのリアルタイムストリーミングプロトコル（RTSP）[RFC2326]のために、以下を考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "o The values for \"maxptime\", \"ptime\", \"maxplaybackrate\", and \"maxaveragebitrate\" ought to be selected carefully to ensure that a reasonable performance can be achieved for the participants of a session.",
      "ja": "O「maxptime」、「PTIME」、「maxplaybackrate」、および「maxaveragebitrate」の値は妥当なパフォーマンスがセッションの参加者のために達成することができることを保証するために慎重に選択されるべきです。"
    },
    {
      "indent": 3,
      "text": "o The values for \"maxptime\", \"ptime\", and of the payload format configuration are recommendations by the decoding side to ensure the best performance for the decoder.",
      "ja": "「maxptime」、「PTIME」の値O、およびペイロードフォーマット構成のデコーダのための最高のパフォーマンスを確保するため、復号側によって推奨されています。"
    },
    {
      "indent": 3,
      "text": "o All other parameters of the payload format configuration are declarative and a participant MUST use the configurations that are provided for the session. More than one configuration can be provided if necessary by declaring multiple RTP payload types; however, the number of types ought to be kept small.",
      "ja": "Oペイロードフォーマット構成の他のすべてのパラメータは、宣言され、参加者は、セッションのために設けられている構成を使用しなければなりません。必要に応じて複数の構成には、複数のRTPペイロードタイプを宣言することによって提供することができます。しかし、種類の数が小さく維持されるべきです。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Use of VBR is subject to the security considerations in [RFC6562].",
      "ja": "VBRの使用は[RFC6562]のセキュリティ問題を受けることです。"
    },
    {
      "indent": 3,
      "text": "RTP packets using the payload format defined in this specification are subject to the security considerations discussed in the RTP specification [RFC3550] and in any applicable RTP profile such as RTP/AVP [RFC3551], RTP/AVPF [RFC4585], RTP/SAVP [RFC3711], or RTP/ SAVPF [RFC5124]. However, as \"Securing the RTP Framework: Why RTP Does Not Mandate a Single Media Security Solution\" [RFC7202] discusses, it is not an RTP payload format's responsibility to discuss or mandate what solutions are used to meet the basic security goals like confidentiality, integrity, and source authenticity for RTP in general. This responsibility lies on anyone using RTP in an application. They can find guidance on available security mechanisms and important considerations in \"Options for Securing RTP Sessions\" [RFC7201]. Applications SHOULD use one or more appropriate strong security mechanisms.",
      "ja": "本明細書で定義されたペイロードフォーマットを使用して、RTPパケットは、RTP仕様[RFC3550]に、そのようなRTP / AVP [RFC3551]、RTP / AVPF [RFC4585]、RTP / SAVP [として該当RTPプロファイルで議論したセキュリティ問題の対象となっていますRFC3711]、またはRTP / SAVPF [RFC5124]。しかし、「RTPフレームワークの保護：なぜ、RTPは、単一のメディアセキュリティソリューションを強制しない」として、[RFC7202]が論じて、議論したりソリューションは、機密性などの基本的なセキュリティ目標を達成するために使用されているものを義務付けるためのRTPペイロード形式の責任ではありません一般的にはRTPのための完全性、およびソース信憑。この責任は、アプリケーションでRTPを使用して誰にもあります。彼らは、「セキュアなRTPセッションのオプション」[RFC7201]で利用可能なセキュリティ・メカニズムと重要な検討事項に関するガイダンスを見つけることができます。アプリケーションは、1つまたは複数の適切な強力なセキュリティ・メカニズムを使用すべきです。"
    },
    {
      "indent": 3,
      "text": "This payload format and the Opus encoding do not exhibit any significant non-uniformity in the receiver-end computational load and thus are unlikely to pose a denial-of-service threat due to the receipt of pathological datagrams.",
      "ja": "このペイロード形式とオーパスエンコーディングは、受信エンド計算負荷に重大な不均一性を示し、したがって、病理学的データグラムの受信に起因するサービス拒否脅威を与える可能性は低いですしないでください。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2326] Schulzrinne, H., Rao, A., and R. Lanphier, \"Real Time Streaming Protocol (RTSP)\", RFC 2326, DOI 10.17487/RFC2326, April 1998, <http://www.rfc-editor.org/info/rfc2326>.",
      "ja": "[RFC2326] SchulzrinneとH.とラオとA.、およびR. Lanphier、 \"リアルタイムのストリーミングプロトコル（RTSP）\"、RFC 2326、DOI 10.17487 / RFC2326、1998年4月、<のhttp：//www.rfc-editor。組織/情報/ RFC2326>。"
    },
    {
      "indent": 3,
      "text": "[RFC3264] Rosenberg, J. and H. Schulzrinne, \"An Offer/Answer Model with Session Description Protocol (SDP)\", RFC 3264, DOI 10.17487/RFC3264, June 2002, <http://www.rfc-editor.org/info/rfc3264>.",
      "ja": "[RFC3264]ローゼンバーグ、J.、およびH. Schulzrinneと、RFC 3264、DOI 10.17487 / RFC3264、2002年6月 \"セッション記述プロトコル（SDP）とのオファー/アンサーモデル\"、<http://www.rfc-editor.org /情報/ RFC3264>。"
    },
    {
      "indent": 3,
      "text": "[RFC3389] Zopf, R., \"Real-time Transport Protocol (RTP) Payload for Comfort Noise (CN)\", RFC 3389, DOI 10.17487/RFC3389, September 2002, <http://www.rfc-editor.org/info/rfc3389>.",
      "ja": "[RFC3389] Zopf、R.、 \"コンフォートノイズ（CN）のためのリアルタイムトランスポートプロトコル（RTP）ペイロード\"、RFC 3389、DOI 10.17487 / RFC3389、2002年9月、<http://www.rfc-editor.org/情報/ rfc3389>。"
    },
    {
      "indent": 3,
      "text": "[RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, DOI 10.17487/RFC3550, July 2003, <http://www.rfc-editor.org/info/rfc3550>.",
      "ja": "[RFC3550] Schulzrinneと、H.、Casner、S.、フレデリック、R.、およびV.ヤコブソン、 \"RTP：リアルタイムアプリケーションのためのトランスポートプロトコル\"、STD 64、RFC 3550、DOI 10.17487 / RFC3550、2003年7月、 <http://www.rfc-editor.org/info/rfc3550>。"
    },
    {
      "indent": 3,
      "text": "[RFC3551] Schulzrinne, H. and S. Casner, \"RTP Profile for Audio and Video Conferences with Minimal Control\", STD 65, RFC 3551, DOI 10.17487/RFC3551, July 2003, <http://www.rfc-editor.org/info/rfc3551>.",
      "ja": "[RFC3551] Schulzrinneと、H.とS. Casner、 \"最小量のコントロールがあるオーディオとビデオ会議システムのためのRTPプロフィール\"、STD 65、RFC 3551、DOI 10.17487 / RFC3551、2003年7月、<のhttp：//www.rfc-editor。組織/情報/ RFC3551>。"
    },
    {
      "indent": 3,
      "text": "[RFC3711] Baugher, M., McGrew, D., Naslund, M., Carrara, E., and K. Norrman, \"The Secure Real-time Transport Protocol (SRTP)\", RFC 3711, DOI 10.17487/RFC3711, March 2004, <http://www.rfc-editor.org/info/rfc3711>.",
      "ja": "[RFC3711] Baugher、M.、マグリュー、D.、Naslund、M.、カララ、E.、およびK. Norrman、 \"セキュアリアルタイムトランスポートプロトコル（SRTP）\"、RFC 3711、DOI 10.17487 / RFC3711、マーチ2004年、<http://www.rfc-editor.org/info/rfc3711>。"
    },
    {
      "indent": 3,
      "text": "[RFC4566] Handley, M., Jacobson, V., and C. Perkins, \"SDP: Session Description Protocol\", RFC 4566, DOI 10.17487/RFC4566, July 2006, <http://www.rfc-editor.org/info/rfc4566>.",
      "ja": "[RFC4566]ハンドリー、M.、ヤコブソン、V.、およびC.パーキンス、 \"SDP：セッション記述プロトコル\"、RFC 4566、DOI 10.17487 / RFC4566、2006年7月、<http://www.rfc-editor.org/情報/ RFC4566>。"
    },
    {
      "indent": 3,
      "text": "[RFC4855] Casner, S., \"Media Type Registration of RTP Payload Formats\", RFC 4855, DOI 10.17487/RFC4855, February 2007, <http://www.rfc-editor.org/info/rfc4855>.",
      "ja": "[RFC4855] Casner、S.、 \"RTPペイロード形式のメディアタイプ登録\"、RFC 4855、DOI 10.17487 / RFC4855、2007年2月、<http://www.rfc-editor.org/info/rfc4855>。"
    },
    {
      "indent": 3,
      "text": "[RFC5576] Lennox, J., Ott, J., and T. Schierl, \"Source-Specific Media Attributes in the Session Description Protocol (SDP)\", RFC 5576, DOI 10.17487/RFC5576, June 2009, <http://www.rfc-editor.org/info/rfc5576>.",
      "ja": "[RFC5576]レノックス、J.、オット、J.、およびT. Schierl、 \"ソース固有メディアセッション記述プロトコル（SDP）の属性\"、RFC 5576、DOI 10.17487 / RFC5576、2009年6月、<のhttp：// www.rfc-editor.org/info/rfc5576>。"
    },
    {
      "indent": 3,
      "text": "[RFC6562] Perkins, C. and JM. Valin, \"Guidelines for the Use of Variable Bit Rate Audio with Secure RTP\", RFC 6562, DOI 10.17487/RFC6562, March 2012, <http://www.rfc-editor.org/info/rfc6562>.",
      "ja": "[RFC6562]パーキンス、C.およびJM。 Valinは、 \"セキュアRTPと可変ビットレート・オーディオの使用のためのガイドライン\"、RFC 6562、DOI 10.17487 / RFC6562、2012年3月、<http://www.rfc-editor.org/info/rfc6562>。"
    },
    {
      "indent": 3,
      "text": "[RFC6716] Valin, JM., Vos, K., and T. Terriberry, \"Definition of the Opus Audio Codec\", RFC 6716, DOI 10.17487/RFC6716, September 2012, <http://www.rfc-editor.org/info/rfc6716>.",
      "ja": "[RFC6716] Valinは、JM。、ヴォス、K.、およびT. Terriberry、 \"オーパスオーディオコーデックの定義\"、RFC 6716、DOI 10.17487 / RFC6716、2012年9月、<http://www.rfc-editor.org /情報/ rfc6716>。"
    },
    {
      "indent": 3,
      "text": "[RFC6838] Freed, N., Klensin, J., and T. Hansen, \"Media Type Specifications and Registration Procedures\", BCP 13, RFC 6838, DOI 10.17487/RFC6838, January 2013, <http://www.rfc-editor.org/info/rfc6838>.",
      "ja": "[RFC6838]解放され、N.、Klensin、J.、およびT.ハンセン、 \"メディアタイプの仕様と登録手順\"、BCP 13、RFC 6838、DOI 10.17487 / RFC6838、2013年1月、<のhttp：//www.rfc- editor.org/info/rfc6838>。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2974] Handley, M., Perkins, C., and E. Whelan, \"Session Announcement Protocol\", RFC 2974, DOI 10.17487/RFC2974, October 2000, <http://www.rfc-editor.org/info/rfc2974>.",
      "ja": "[RFC2974]ハンドレー、M.、パーキンス、C.、およびE.ウィーラン、 \"セッション告知プロトコル\"、RFC 2974、DOI 10.17487 / RFC2974、2000年10月<http://www.rfc-editor.org/info/ rfc2974>。"
    },
    {
      "indent": 3,
      "text": "[RFC4585] Ott, J., Wenger, S., Sato, N., Burmeister, C., and J. Rey, \"Extended RTP Profile for Real-time Transport Control Protocol (RTCP)-Based Feedback (RTP/AVPF)\", RFC 4585, DOI 10.17487/RFC4585, July 2006, <http://www.rfc-editor.org/info/rfc4585>.",
      "ja": "[RFC4585]オット、J.、ウェンガー、S.、佐藤、N.、Burmeister、C.、およびJ.レイ「ベースのフィードバック（RTP / AVPF）リアルタイムトランスポート制御プロトコル（RTCP）の拡張RTPプロファイル」、RFC 4585、DOI 10.17487 / RFC4585、2006年7月、<http://www.rfc-editor.org/info/rfc4585>。"
    },
    {
      "indent": 3,
      "text": "[RFC5124] Ott, J. and E. Carrara, \"Extended Secure RTP Profile for Real-time Transport Control Protocol (RTCP)-Based Feedback (RTP/SAVPF)\", RFC 5124, DOI 10.17487/RFC5124, February 2008, <http://www.rfc-editor.org/info/rfc5124>.",
      "ja": "[RFC5124]オット、J.およびE.カララ、RFC 5124、DOI 10.17487 / RFC5124、2008年2月、<HTTP \"リアルタイムトランスポート制御プロトコル（RTCP）ベースのフィードバック（RTP / SAVPF）にSecure RTPプロファイル拡張\" ：//www.rfc-editor.org/info/rfc5124>。"
    },
    {
      "indent": 3,
      "text": "[RFC5405] Eggert, L. and G. Fairhurst, \"Unicast UDP Usage Guidelines for Application Designers\", BCP 145, RFC 5405, DOI 10.17487/RFC5405, November 2008, <http://www.rfc-editor.org/info/rfc5405>.",
      "ja": "[RFC5405]エッゲルト、L.とG. Fairhurst、 \"アプリケーションデザイナーのためのユニキャストUDPの使用上の注意事項\"、BCP 145、RFC 5405、DOI 10.17487 / RFC5405、2008年11月、<http://www.rfc-editor.org/info / rfc5405>。"
    },
    {
      "indent": 3,
      "text": "[RFC7201] Westerlund, M. and C. Perkins, \"Options for Securing RTP Sessions\", RFC 7201, DOI 10.17487/RFC7201, April 2014, <http://www.rfc-editor.org/info/rfc7201>.",
      "ja": "[RFC7201]ウェスター、M.とC.パーキンス、 \"RTPセッションを確保するためのオプション\"、RFC 7201、DOI 10.17487 / RFC7201、2014年4月、<http://www.rfc-editor.org/info/rfc7201>。"
    },
    {
      "indent": 3,
      "text": "[RFC7202] Perkins, C. and M. Westerlund, \"Securing the RTP Framework: Why RTP Does Not Mandate a Single Media Security Solution\", RFC 7202, DOI 10.17487/RFC7202, April 2014, <http://www.rfc-editor.org/info/rfc7202>.",
      "ja": "[RFC7202]パーキンス、C.とM.ウェスター、 \"RTPフレームワークの保護：なぜ、RTPは、単一のメディアセキュリティソリューションを強制しない\"、RFC 7202、DOI 10.17487 / RFC7202、2014年4月、<のhttp：//www.rfc- editor.org/info/rfc7202>。"
    },
    {
      "indent": 3,
      "text": "[rmcat] \"RTP Media Congestion Avoidance Techniques (rmcat) Documents\", <https://datatracker.ietf.org/wg/rmcat/ documents/>.",
      "ja": "[rmcat] \"RTPメディア輻輳回避技術（rmcat）ドキュメント\"、<https://datatracker.ietf.org/wg/rmcat/文書/>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Many people have made useful comments and suggestions contributing to this document. In particular, we would like to thank Tina le Grand, Cullen Jennings, Jonathan Lennox, Gregory Maxwell, Colin Perkins, Jan Skoglund, Timothy B. Terriberry, Martin Thompson, Justin Uberti, Magnus Westerlund, and Mo Zanaty.",
      "ja": "多くの人々は、この文書に貢献する有益なコメントと提案をしました。特に、我々はティナルグラン、カレン・ジェニングス、ジョナサン・レノックス、グレゴリー・マクスウェル、コリンパーキンス、ヤンSkoglund、ティモシー・B. Terriberry、マーティン・トンプソン、ジャスティンUberti、マグヌスウェスター、及びMo Zanatyに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Julian Spittka",
      "ja": "ジュリアンSpittka"
    },
    {
      "indent": 3,
      "text": "Email: jspittka@gmail.com",
      "ja": "メール：jspittka@gmail.com"
    },
    {
      "indent": 3,
      "text": "Koen Vos vocTone",
      "ja": "公園・ヴォスvocTone"
    },
    {
      "indent": 3,
      "text": "Email: koenvos74@gmail.com",
      "ja": "メール：koenvos74@gmail.com"
    },
    {
      "indent": 3,
      "text": "Jean-Marc Valin Mozilla 331 E. Evelyn Avenue Mountain View, CA 94041 United States",
      "ja": "ジャンマルクValinはMozillaの331 E.イヴリン・アベニューマウンテンビュー、CA 94041米国"
    },
    {
      "indent": 3,
      "text": "Email: jmvalin@jmvalin.ca",
      "ja": "メール：jmvalin@jmvalin.ca"
    }
  ]
}