{
  "title": {
    "text": "RFC 7288 - Reflections on Host Firewalls",
    "ja": "RFC 7288 - ホストのファイアウォールでの反射"
  },
  "number": 7288,
  "created_at": "2019-10-31 06:30:01.308945+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Architecture Board (IAB)                              D. Thaler\nRequest for Comments: 7288                                     Microsoft\nCategory: Informational                                        June 2014\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Reflections on Host Firewalls",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "In today's Internet, the need for firewalls is generally accepted in the industry, and indeed firewalls are widely deployed in practice. Unlike traditional firewalls that protect network links, host firewalls run in end-user systems. Often the result is that software may be running and potentially consuming resources, but then communication is blocked by a host firewall. It's taken for granted that this end state is either desirable or the best that can be achieved in practice, rather than (for example) an end state where the relevant software is not running or is running in a way that would not result in unwanted communication. In this document, we explore the issues behind these assumptions and provide suggestions on improving the architecture going forward.",
      "ja": "今日のインターネットでは、ファイアウォールの必要性は業界で一般に受け入れられている、実際のファイアウォールは、実際に広く展開されています。ネットワークリンクを保護する従来のファイアウォールとは異なり、ホストファイアウォールは、エンドユーザーのシステムで実行されます。多くの場合、その結果は、ソフトウェアが動作して、潜在的にリソースを消費することができるということですが、その後、通信がホストファイアウォールによってブロックされています。この終了状態が望ましいか、むしろ、関連するソフトウェアが実行されていないか、不要な通信をもたらさない方法で実行されて終了状態（例えば）よりも、実際には達成することができる最善のいずれかであることを当然それは取っています。この文書では、我々はこれらの仮定の背後にある問題を探求し、今後のアーキテクチャの改善にアドバイスを提供します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. It represents the consensus of the Internet Architecture Board (IAB). Documents approved for publication by the IAB are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットアーキテクチャ委員会（IAB）の製品であり、IABは、永久的な記録を提供するために貴重なものとみなされたことの情報を表します。これは、インターネットアーキテクチャ委員会（IAB）のコンセンサスを表しています。 IABによって公表のために承認されたドキュメントは、インターネット標準の任意のレベルの候補ではありません。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7288.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7288で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  Terminology . . . . . . . . . . . . . . . . . . . . . . .   4\n2.  Firewall Rules  . . . . . . . . . . . . . . . . . . . . . . .   5\n3.  Category 1: Attack Surface Reduction  . . . . . . . . . . . .   6\n  3.1.  Discussion of Approaches  . . . . . . . . . . . . . . . .   7\n    3.1.1.  Fix the Software  . . . . . . . . . . . . . . . . . .   7\n    3.1.2.  Don't Use the Software  . . . . . . . . . . . . . . .   8\n    3.1.3.  Run the Software behind a Host Firewall . . . . . . .   8\n4.  Category 2: Security Policy . . . . . . . . . . . . . . . . .   9\n  4.1.  Discussion of Approaches  . . . . . . . . . . . . . . . .   9\n    4.1.1.  Security Policies in Applications . . . . . . . . . .   9\n    4.1.2.  Security Policies in Host Firewalls . . . . . . . . .   9\n    4.1.3.  Security Policies in a Service  . . . . . . . . . . .  10\n5.  Stealth Mode  . . . . . . . . . . . . . . . . . . . . . . . .  11\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .  11\n7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  11\n8.  IAB Members at the Time of Approval . . . . . . . . . . . . .  12\n9.  Informative References  . . . . . . . . . . . . . . . . . . .  12",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "[BLOCK-FILTER] discusses the issue of blocking or filtering abusive or objectionable content and communications, and the effects on the overall Internet architecture. This document complements that discussion by focusing on the architectural effects of host firewalls on hosts and applications.",
      "ja": "[BLOCK-FILTER]は虐待や不快なコンテンツやコミュニケーション、および全体的なインターネットアーキテクチャへの影響を遮断するか、フィルタリングの問題について説明します。この文書では、ホストやアプリケーションのホストファイアウォールのアーキテクチャの影響に焦点を当てて、その議論を補完します。"
    },
    {
      "indent": 3,
      "text": "\"Behavior of and Requirements for Internet Firewalls\" [RFC2979] provides an introduction to firewalls and the requirement for transparency in particular, stating:",
      "ja": "「インターネットファイアウォールおよび要件の動作」[RFC2979]は述べ、ファイアウォールへの導入、特に透明性の要件を提供します。"
    },
    {
      "indent": 6,
      "text": "The introduction of a firewall and any associated tunneling or access negotiation facilities MUST NOT cause unintended failures of legitimate and standards-compliant usage that would work were the firewall not present.",
      "ja": "ファイアウォールと関連するトンネリングやアクセス交渉の設備の導入がうまくいく正当かつ標準準拠の用法の意図しない障害を引き起こしてはならないファイアウォールのない存在でした。"
    },
    {
      "indent": 3,
      "text": "Many firewalls today do not follow that guidance, such as by blocking traffic containing IP options or IPv6 extension headers (see [RFC7045] for more discussion).",
      "ja": "多くのファイアウォールは、今日、このようなIPオプションまたはIPv6拡張ヘッダーを含むトラフィックをブロックするなど、その指導を、（より多くの議論のための[RFC7045]を参照）に従いません。"
    },
    {
      "indent": 3,
      "text": "In Section 2.1 of \"Reflections on Internet Transparency\" [RFC4924], the IAB provided additional thoughts on firewalls and their impact on the Internet architecture, including issues around disclosure obligations and complexity as applications evolve to circumvent firewalls. This document extends that discussion with additional considerations.",
      "ja": "「インターネット上の透明反射」[RFC4924]のセクション2.1で、IABは、アプリケーションがファイアウォールを回避するように進化として開示義務及び複雑さの周りに問題を含む追加のファイアウォール上の考えやインターネットアーキテクチャへの影響を、提供しました。この文書では、追加の考慮事項とその議論を拡張します。"
    },
    {
      "indent": 3,
      "text": "Traditionally, firewalls have been about arming customers to protect against bugs in applications and services. This document discusses a number of fundamental questions, such as who a firewall is meant to protect from what. It does so primarily, though not exclusively, from an end system perspective with a focus on host firewalls in particular.",
      "ja": "伝統的に、ファイアウォールはアプリケーションやサービスのバグから保護するために顧客を武装についてされています。この文書では、このようなファイアウォールが何から保護することを意図している人としての基本的な質問の数を論じています。これは、特定のホストファイアウォールを中心としたエンド・システムの観点から、しかし排他的ではないので、主に行います。"
    },
    {
      "indent": 3,
      "text": "While the Internet Security Glossary [RFC4949] contains an extended definition of a firewall, informally, most people would tend to think of a firewall as simply \"something that blocks unwanted traffic\" (see [RFC4948] for a discussion on many types of unwanted traffic). A fundamental question is, however: \"unwanted by whom?\"",
      "ja": "インターネットセキュリティ用語集[RFC4949]は、ファイアウォールの拡張定義が含まれていますが、非公式に、ほとんどの人は（不要なトラフィックの多くの種類の議論のための[RFC4948]を参照して、単に「ブロック不要なトラフィックは何か」とのファイアウォールと考える傾向があります）。基本的な問題は、しかし、である：「誰によって不要な？」"
    },
    {
      "indent": 3,
      "text": "Possible answers include end users, application developers, network administrators, host administrators, firewall vendors, and content providers. We will exclude by definition the sender of the traffic in question, since the sender would generally want such traffic to be delivered. Still, the other entities have different, and often conflicting, desires which means that a type of traffic might be wanted by one entity and unwanted by another entity. Thus, not surprisingly, there exist various types of firewalls, and various types of \"arms race\" as we will discuss in Section 4.1.2.",
      "ja": "可能な答えは、エンドユーザー、アプリケーション開発者、ネットワーク管理者、ホスト管理者は、ファイアウォールベンダー、コンテンツプロバイダーが含まれます。送信者は、一般的に、このようなトラフィックが配信されるようにしたいと思うので、私たちは、定義上問題のトラフィックの送信者を除外します。それでも、他のエンティティが異なる持っている、としばしば対立する、トラフィックの種類が1つのエンティティによってたかったし、別のエンティティによって不要な可能性があることを意味していることを望みます。私たちは、セクション4.1.2で議論するようしたがって、驚くことではないが、ファイアウォールの様々な種類、および「軍拡競争」の様々な種類が存在します。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1. 用語"
    },
    {
      "indent": 3,
      "text": "In this document we distinguish between a \"host firewall\", which simply intends to protect the single computer on which it runs, and a \"network firewall\", which is located in the network and intends to protect the network and any hosts behind it.",
      "ja": "この文書では、ネットワーク内に配置し、ネットワークとその背後にある任意のホストを保護することを意図されただけで、それが実行されている単一のコンピュータを保護するつもりで、「ホストファイアウォール」、および「ネットワークファイアウォール」、区別します。"
    },
    {
      "indent": 3,
      "text": "A Network Address Translator (NAT) is also often viewed, or even marketed, as a type of network firewall; Section 2.2 of [RFC4864] addresses this misconception, but nevertheless some of the same observations in the present document may also apply to NATs.",
      "ja": "ネットワークアドレス変換（NAT）は、ネットワークファイアウォールの種類として、また多くの場合、閲覧、あるいは販売されています。 [RFC4864]のセクション2.2は、この誤解を解決し、それにもかかわらず、本文書における同じ観察のいくつかはまた、NATのに適用することができます。"
    },
    {
      "indent": 3,
      "text": "Sandboxed environments, such as those provided by browsers, can also be thought of as a type of host firewall in the more general sense. For example, a cross-site check in a browser can be thought of as a mechanism to block unwanted outbound traffic per a \"same origin policy\" where a script can only communicate with the \"site\" from which the script was obtained, for some definition of site such as the scheme and authority in a URI.",
      "ja": "このようなブラウザによって提供されるようなサンドボックス環境でも、より一般的な意味でのホストファイアウォールのタイプと考えることができます。例えば、ブラウザでクロスサイトチェックはいくつかのために、スクリプトはスクリプトのみが得られた「サイト」と通信することができる「同一生成元ポリシー」ごとに不要なアウトバウンドトラフィックをブロックするためのメカニズムと考えることができURIにおけるスキームと権限など、サイトの定義。"
    },
    {
      "indent": 3,
      "text": "The term \"application\" is used in this document generically to apply to any component that can receive traffic. In this sense, it could refer to a process running on a computer (including a system service) or even to a portion of a TCP/IP stack itself, such as a component that responds to pings.",
      "ja": "「アプリケーション」という語は一般的にトラフィックを受信することができます任意のコンポーネントに適用するには、この文書で使用されています。この意味で、このようなpingに応答する成分として、（システムサービスを含む）、あるいはTCP / IPスタック自体の部分にコンピュータ上で実行中のプロセスを参照することができます。"
    },
    {
      "indent": 0,
      "text": "2. Firewall Rules",
      "section_title": true,
      "ja": "2.ファイアウォールルール"
    },
    {
      "indent": 3,
      "text": "Desires for wanted or unwanted traffic can be expressed in terms of \"allow\" vs. \"block\" rules, with some way to resolve conflicting rules. Many firewalls are actually implemented in terms of such rules. Figure 1 shows some typical sources of such rules.",
      "ja": "指名手配または不要なトラフィックのための欲望は、競合のルールを解決するためのいくつかの方法で、「許可」対「ブロック」ルールで表現することができます。多くのファイアウォールは、実際にこのようなルールの面で実装されています。図1は、このようなルールのいくつかの典型的な供給源を示しています。"
    },
    {
      "indent": 7,
      "text": "Source    | Consumer   | Consumer    | Enterprise | Enterprise\n          | Scenario   | Scenario    | Scenario   | Scenario\n          | Host       | Network     | Host       | Network\n          | Firewall   | Firewall    | Firewall   | Firewall\n----------+------------+-------------+------------+------------\nEnd user  | Sometimes  | Sometimes   |            |\n          | (as host   | (as network |            |\n          | admin)     | admin)      |            |\n----------+------------+-------------+------------+------------\nApp       |   Yes      | Sometimes   |            |\ndeveloper |            | (via        |            |\n          |            | protocols)  |            |\n----------+------------+-------------+------------+------------\nNetwork   |            | Sometimes   |            |   Yes\nadmin     |            |             |            |\n----------+------------+-------------+------------+------------\nHost      | Sometimes  |             |    Yes     |\nadmin     |            |             |            |\n----------+------------+-------------+------------+------------\nFirewall  |   Yes      |    Yes      |    Yes     |   Yes\nvendor    |            |             |            |\n----------+------------+-------------+------------+------------",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 1: Common Sources of Firewall Rules",
      "ja": "図1：ファイアウォールルールの共通ソース"
    },
    {
      "indent": 3,
      "text": "Figure 1 assumes that network firewalls are administered by network administrators (if any), and host firewalls are administered by host administrators (if any). A firewall may also have rules provided by the firewall vendor itself.",
      "ja": "図1は、ネットワークファイアウォールは、ネットワーク管理者（もしあれば）によって投与され、ホストファイアウォールは、ホスト管理者（もしあれば）によって投与されることを前提としています。ファイアウォールは、ファイアウォールベンダー自身が提供するルールを有することができます。"
    },
    {
      "indent": 3,
      "text": "End users typically cannot directly provide rules to firewalls that affect other users, unless the end user is a host or network administrator. Application developers can, however, provide such rules to some firewalls, such as providing rules at installation time. They can do this, for example, by invoking an API provided by a host firewall included with the operating system, or by providing metadata to the operating system for use by firewalls, or by using a protocol such as Universal Plug and Play (UPnP) [UPNPWANIP] or the Port Control Protocol (PCP) [RFC6887] to communicate with a network firewall (see Section 4.1.3 for a longer discussion).",
      "ja": "エンドユーザーは、通常、直接エンドユーザーがホストまたはネットワーク管理者でない限り、他のユーザーに影響を与えるファイアウォールにルールを提供することはできません。アプリケーション開発者は、しかし、そのようなインストール時にルールを提供するなど、いくつかのファイアウォールのようなルールを、提供することができます。彼らは（UPnPの）、またはそのようなユニバーサルプラグなどのプロトコルを使用することによって、またはファイアウォールで使用するためのオペレーティング・システムにメタデータを提供することにより、オペレーティングシステムに付属のホストファイアウォールが提供するAPIを呼び出すことによって、例えば、この操作を行うと、再生することができます[UPNPWANIP]またはポート制御プロトコル（PCP）ネットワークファイアウォールと通信するために、[RFC6887]（長い議論のためのセクション4.1.3を参照してください）。"
    },
    {
      "indent": 3,
      "text": "Firewall rules generally fall into two categories:",
      "ja": "ファイアウォールのルールは、一般に2つのカテゴリに分類されます。"
    },
    {
      "indent": 3,
      "text": "1. Attack surface reduction: Rules intended to prevent an application from doing things the developer does not want it to do.",
      "ja": "1.攻撃面の減少：開発者はそれが何を望んでいないことをやってからアプリケーションを防止することを目的とするルール。"
    },
    {
      "indent": 3,
      "text": "2. Security policy: Rules intended to prevent an application from doing things the developer might want it to do, but an administrator does not.",
      "ja": "2.セキュリティポリシー：開発者はそれが何をしたい場合がありますことをやってからアプリケーションを防止することを目的とルールが、管理者にはありません。"
    },
    {
      "indent": 3,
      "text": "A firewall is unnecessary if both categories are empty. We will now treat each category in turn, focusing specifically on host firewalls (although some points might be equally applicable to network firewalls).",
      "ja": "両方のカテゴリが空の場合、ファイアウォールは不要です。私たちは今、ホストのファイアウォール（いくつかのポイントは、ネットワークファイアウォールにも同様に適用可能であるかもしれないが）に特に焦点を当て、順番に各カテゴリーを扱います。"
    },
    {
      "indent": 0,
      "text": "3. Category 1: Attack Surface Reduction",
      "section_title": true,
      "ja": "3.カテゴリー1：攻撃を受ける危険性を低減します"
    },
    {
      "indent": 3,
      "text": "As noted above, this category of firewall rule typically attempts to prevent applications from doing things the developer did not intend.",
      "ja": "上述したように、ファイアウォールルールのこのカテゴリには、一般的に、開発者が意図しなかったことをやってからアプリケーションを防ぐためにしようとします。"
    },
    {
      "indent": 3,
      "text": "One might ask whether this category of rules is typically empty, and the answer is that it is not, at present. One reason stems from mitigating the threat of vulnerability exploitation by putting a security barrier in a separate process, isolated from the potentially compromised process. Furthermore, there is also some desire for a \"stealth mode\" (see Section 5 below).",
      "ja": "一つは、ルールのこのカテゴリは、一般的に空であるかどうかを尋ねるかもしれない、と答えは現時点では、それがないということです。一つの理由は、潜在的に危険にさらさプロセスから分離独立したプロセスでセキュリティバリアを置くことにより、この脆弱性の悪用の脅威を軽減するに由来します。さらに、また、「ステルスモード」（下記のセクション5を参照）のためのいくつかの要望があります。"
    },
    {
      "indent": 3,
      "text": "Hence, typically a firewall will have rules to block everything by default. A one-time, privileged, application-install step adds one or more Allow rules, and then normal (unprivileged) application execution is then constrained by the resulting rules.",
      "ja": "そのため、一般的に、ファイアウォールはデフォルトですべてをブロックするためのルールを持っています。一回、特権、アプリケーションインストールステップは、1つまたは複数のルールを許可を追加し、その後、通常の（非特権）アプリケーションの実行は、次いで、得られたルールによって制約されます。"
    },
    {
      "indent": 3,
      "text": "A second reason this category of rules is non-empty is where they are used as workarounds for cases the application developer found too onerous to implement. These cases include:",
      "ja": "ルールのこのカテゴリが非空である第二の理由は、彼らは、アプリケーション開発者が実装するにはあまりにも面倒ない場合の回避策として使用されているところです。これらの例は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "1. Simple policies that the developer would want but that are difficult to implement. One example might be a policy that an application should communicate only within the local network (e.g., a home or enterprise), but not be reachable from the global Internet or while the device is moved to some public network such as a hotspot. A second example might be the reverse, i.e., a policy to communicate over the Internet but not with local entities. The need for this category would be reduced by better platform support for such policies, making them easier for developers to implement and use.",
      "ja": "開発者が実装するのは困難であるが、を望む1.シンプルなポリシー。一例では、アプリケーションは、ローカルネットワーク（例えば、家庭又は企業）内で通信するべきポリシーであるが、グローバルインターネットから、または装置が、そのようなホットスポットのようないくつかの公衆網に移動させながら、到達可能ではないかもしれません。第二の例は、逆方向、すなわち、ポリシーは、インターネットを介して通信ではなく、ローカル実体とするかもしれません。このカテゴリの必要性は、彼らがより簡単に開発者が実装し、使用できるようにすること、そのような政策のためのより良いプラットフォームのサポートにより減少するであろう。"
    },
    {
      "indent": 3,
      "text": "2. Complex policies where the developer cannot possibly be aware of specifics. One example might be a policy to communicate only during, or only outside of, normal business hours, where the exact hours may vary by location and time of year. Another example might be a policy to avoid communication over links that cost too much, where the definition of \"too much\" may vary by customer, and indeed, the end host and application might not even be aware of the costs. The need for this category would be reduced by better platform support for such policies, allowing the application to communicate through some simple API with some other library or service that can deal with the specifics.",
      "ja": "開発者は、おそらく仕様を意識することはできません2.複雑なポリシー。一例では、中、または唯一の外側のみ正確な時間は、年の位置と時間によって異なり、通常の営業時間を、通信するためのポリシーであるかもしれません。別の例は、「あまり」の定義は、顧客によって異なる場合があり、実際、エンドホストやアプリケーションでもコストを認識していない可能性がありますあまりにも多くの費用がかかりリンクを介した通信を避けるための政策であるかもしれません。このカテゴリの必要性は、アプリケーションが具体的に対処することができますいくつかの他のライブラリやサービスと、いくつかの簡単なAPIを介して通信することができ、そのような政策のためのより良いプラットフォームのサポートにより減少するであろう。"
    },
    {
      "indent": 0,
      "text": "3.1. Discussion of Approaches",
      "section_title": true,
      "ja": "3.1. アプローチの議論"
    },
    {
      "indent": 3,
      "text": "When running an application would result in unwanted behavior, customers have three choices, which we will discuss in turn:",
      "ja": "不要な行動につながるアプリケーションを実行する場合、顧客は、私たちが順番に議論する3つの選択肢を持っています："
    },
    {
      "indent": 3,
      "text": "a. fix (or get the developer to fix) the software,",
      "ja": "A。修正（または修正するために、開発者を取得）ソフトウェア、"
    },
    {
      "indent": 3,
      "text": "b. not use the software, or",
      "ja": "B。ソフトウェアを使用していない、または"
    },
    {
      "indent": 3,
      "text": "c. let the software run, but then use a firewall to thwart it and prevent it from working in unwanted ways.",
      "ja": "C。ソフトウェアの実行をさせるが、それを阻止し、不要な方法で作業してからそれを防ぐためにファイアウォールを使用しています。"
    },
    {
      "indent": 0,
      "text": "3.1.1. Fix the Software",
      "section_title": true,
      "ja": "3.1.1. ソフトウェアを修正"
    },
    {
      "indent": 3,
      "text": "Firewall vendors point out that one can more quickly and reliably update firewall rules than application software. Indeed, some applications might have no way to update them, and support for other applications might no longer be available (e.g., if the developers are no longer around). Most modern operating systems (and any applications that come with them) have automatic updates, as do some independent applications. But until all applications have automatic updates, and automatic updates are actually used, it will still be the case that firewall rules can be updated more quickly than software patches. Furthermore, in some contexts (e.g., within some enterprises), a possibly lengthy retesting and recertification process must be employed before applications can be updated.",
      "ja": "ファイアウォールベンダーは1つが、より迅速かつ確実にアプリケーションソフトウェアよりも、ファイアウォールのルールを更新できると指摘しています。確かに、一部のアプリケーションは、それらを更新する方法がありませんかもしれない、と（開発者が周りにもはやない場合、例えば）他のアプリケーションのサポートは、もはや利用可能であるかもしれません。最近のほとんどのオペレーティング・システム（およびそれに付属している任意のアプリケーション）、いくつかの独立したアプリケーションがそうであるように、自動更新を持っています。すべてのアプリケーションが自動更新を持っており、自動更新が実際に使用されるまでしかし、まだファイアウォールルールはソフトウェアパッチよりも迅速に更新することができた場合となります。アプリケーションを更新することができる前に、さらに、いくつかの状況（例えば、いくつかの企業内）に、おそらく長い再検査と再認証プロセスを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "In short, mechanisms to encourage and ease the use of secure automatic software updates are important and would greatly reduce overall complexity. Such mechanisms should allow scheduling updates at appropriate times, taking into account operational considerations such as dependencies, compatibility, testing and maintenance windows.",
      "ja": "要するに、安全なソフトウェアの自動アップデートの使用を奨励し、容易にするためのメカニズムが重要であり、大幅に全体的な複雑さを軽減します。このようなメカニズムは、そのような依存性、互換性、テスト、保守ウィンドウなどのアカウント運用検討事項を考慮して、適切な時間にスケジュールの更新を許可する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.1.2. Don't Use the Software",
      "section_title": true,
      "ja": "3.1.2. ソフトウェアを使用しないでください"
    },
    {
      "indent": 3,
      "text": "A key question to ask is whether the application could still do something useful when firewalled. If the answer is yes, then not using the software is probably unrealistic. For example, a game with both single-player and multi-player capabilities could still be useful in single-player mode when firewalled. If instead the answer is no, it is better to not allow the application to run in the first place, and some host firewalls can indeed block applications from running.",
      "ja": "依頼する重要な問題は、ファイアウォールで保護する場合、アプリケーションがまだ有益な何かをすることができるかどうかです。答えがイエスであれば、ソフトウェアを使用していないことは、おそらく非現実的です。ファイアウォールで保護する場合例えば、シングルプレイヤーとマルチプレイヤーの両方の機能を備えたゲームはまだ、シングルプレイヤーモードで有用である可能性があります。代わりに答えがNOである場合、アプリケーションが最初の場所で実行することはできませ方が良いではない、といくつかのホストのファイアウォール実行されているから、実際にブロックアプリケーションことができます。"
    },
    {
      "indent": 0,
      "text": "3.1.3. Run the Software behind a Host Firewall",
      "section_title": true,
      "ja": "3.1.3. ホストファイアウォールの背後にあるソフトウェアを実行します"
    },
    {
      "indent": 3,
      "text": "As noted earlier, one disadvantage of this approach is that resources still get consumed. For example, the application can still consume memory, CPU, bandwidth (up to the point of blockage), ports in the transport layer protocol, and possibly other resources depending on the application, for operations that provide no benefit while firewalled.",
      "ja": "先に述べたように、このアプローチの一つの欠点は、リソースがまだ消費してしまうことがあります。例えば、アプリケーションはファイアウォール間は利益を提供しない動作のために、メモリ、CPU、（閉塞の点まで）の帯域幅、トランスポート層プロトコルのポート、および用途に応じて、おそらく他のリソースを消費することができます。"
    },
    {
      "indent": 3,
      "text": "A second important disadvantage of this approach is the bad user experience. Typically the application and the end-user won't know why the application doesn't work. A poorly designed application might not cope well and consume even more resources (e.g., retrying an operation that continually fails).",
      "ja": "このアプローチの第二の重要な欠点は、悪いユーザーエクスペリエンスです。アプリケーションが動作しない理由を通常のアプリケーションとエンドユーザは知ることができません。設計が不十分なアプリケーションがうまく対処し、さらに多くのリソースを消費しないことがあります（例えば、再試行継続的に失敗した操作）。"
    },
    {
      "indent": 3,
      "text": "A third disadvantage is that it is common for a firewall rule to block more that is appropriate for attack surface reduction, impacting protocol operation and even having adverse effects on other endpoints. For example, some firewalls that cannot perform full deep packet inspection at line speed have adopted a block by default approach to anything they don't understand from the first few bytes; this is very harmful to innovation as it interferes with the ability to deploy new protocols and features.",
      "ja": "第3の欠点は、それがよりブロックするファイアウォールルールに共通であることであることは、プロトコルの動作に影響を与え、さらには他のエンドポイントへの悪影響を有する、攻撃面の減少のために適切です。例えば、ライン速度でフルディープパケットインスペクションを実行することはできませんいくつかのファイアウォールは、彼らが最初の数バイトから理解していないものにデフォルトのアプローチでブロックを採用しています。それは新しいプロトコルや機能を展開する能力を妨げるとして、これは技術革新に非常に有害です。"
    },
    {
      "indent": 3,
      "text": "As another example, blocking ICMP adversely affects path MTU discovery which can cause problems for other entities (see [RFC4890] and Section 3.1.1 of [RFC2979] for further discussion). This can happen due to lack of understanding all the details of application behavior, or due to accidental misconfiguration. Section 2.1 of [RFC5505] states, \"Anything that can be configured can be misconfigured,\" and discusses this in more detail.",
      "ja": "別の例として、ICMPをブロックすることは不利他のエンティティの問題を引き起こす可能性があり、パスMTU探索を（さらなる議論のために[RFC4890]及び[RFC2979]のセクション3.1.1を参照）に影響を与えます。これは、アプリケーションの動作のすべての詳細を理解の不足、または不慮の設定ミスに起こることができます。 [RFC5505]のセクション2.1「が、構成することができる何が誤って設定することができる」、と述べてより詳細にこれを説明します。"
    },
    {
      "indent": 3,
      "text": "In short, it is important to make applications more aware of the constraints of their environment, and hence better able to behave well when constrained.",
      "ja": "要するに、彼らの環境の制約のアプリケーションをより認識させるために、ひいてはより可能に拘束する場合うまく動作することが重要です。"
    },
    {
      "indent": 0,
      "text": "4. Category 2: Security Policy",
      "section_title": true,
      "ja": "4.カテゴリー2：セキュリティポリシー"
    },
    {
      "indent": 3,
      "text": "As noted in Section 2, this category of firewall rule typically attempts to prevent an application from doing things an administrator does not want them to do, even if the application developer did.",
      "ja": "第2節で述べたように、ファイアウォールルールのこのカテゴリは、通常、アプリケーション開発者がいた場合でも、管理者はそれらが何を望んでいないことをやってからアプリケーションを防ぐためにしようとします。"
    },
    {
      "indent": 3,
      "text": "One might ask whether this category of rules is typically empty, and the answer varies somewhat. For enterprise-scenario firewalls, it is almost never empty, and hence the problems discussed in Section 3.1.3 can be common here too. Similarly, for consumer-scenario firewalls, it is generally not empty but there are some notable exceptions. For example, for the host firewall in some operation systems, this category always starts empty and most users never change this.",
      "ja": "一つは、ルールのこのカテゴリは、一般的に空であるかどうかを尋ねるかもしれない、と答えは多少異なります。エンタープライズシナリオのファイアウォールでは、それはほとんど空になることはありません、したがって、3.1.3項で述べた問題はここにも共通することができます。同様に、消費者シナリオファイアウォールのために、それは一般的に空ではありませんが、いくつかの注目すべき例外があります。例えば、いくつかのオペレーションシステムでのホストファイアウォールのために、このカテゴリは常に空始まり、ほとんどのユーザーはこれを変更することはありません。"
    },
    {
      "indent": 0,
      "text": "4.1. Discussion of Approaches",
      "section_title": true,
      "ja": "4.1. アプローチの議論"
    },
    {
      "indent": 3,
      "text": "Security policy can be implemented in any of three places, which we will discuss in turn: the application, a firewall, or a library/ service that the application explicitly uses.",
      "ja": "アプリケーション、ファイアウォール、またはアプリケーションが明示的に使用するライブラリ/サービス：セキュリティポリシーは、私たちが順番に議論する3ヶ所のいずれかで実施することができます。"
    },
    {
      "indent": 0,
      "text": "4.1.1. Security Policies in Applications",
      "section_title": true,
      "ja": "4.1.1. アプリケーションでのセキュリティポリシー"
    },
    {
      "indent": 3,
      "text": "In this option, each application must implement support for potentially complex security policies, along with ways for administrators to configure them. Although the explicit interaction with applications avoids the problems discussed in Section 3.1.3, this approach is impractical for a number of reasons. First, the complexity makes it difficult to implement and is error-prone, especially for application developers whose primary expertise is not networking. Second, the potentially large number of applications (and application developers) results in an inconsistent experience that makes it difficult for an administrator to manage common policies across applications, thus driving up training and operational costs.",
      "ja": "このオプションでは、各アプリケーションは、それらを設定するには、管理者のための方法と一緒に、潜在的に複雑なセキュリティ・ポリシーのサポートを実装する必要があります。アプリケーションとの明示的な相互作用は、セクション3.1.3で述べた問題を回避するが、このアプローチは、多くの理由から非現実的です。まず、複雑さは、それが困難実現することができると、特にその主な専門知識のネットワークされていないアプリケーション開発者のために、エラーが発生しやすいです。第二に、アプリケーション（およびアプリケーション開発者）潜在的に多数のため、トレーニングや運用コストを押し上げ、アプリケーション間で共通のポリシーを管理するための管理者のためのことを困難に一貫性のない経験で結果が。"
    },
    {
      "indent": 0,
      "text": "4.1.2. Security Policies in Host Firewalls",
      "section_title": true,
      "ja": "4.1.2. ホストのファイアウォールでセキュリティポリシー"
    },
    {
      "indent": 3,
      "text": "Putting security policies in firewalls without explicit interaction with the applications results in the problems discussed in Section 3.1.3. In addition, this leads to \"arms races\" where the applications are incented to evolve to get around the security policies, since the desires of the end user or developer can conflict with the desires of an administrator. As stated in Section 2.1 of [RFC4924]:",
      "ja": "3.1.3項で述べた問題への適用結果と明示的に相互作用することなく、ファイアウォールでセキュリティポリシーを置きます。また、これは、エンドユーザーや開発者の欲望は、管理者の欲望と衝突することができますので、アプリケーションは、セキュリティポリシーを回避するために進化しincentedされている「アームレース」につながります。 [RFC4924]のセクション2.1で述べたように："
    },
    {
      "indent": 6,
      "text": "In practice, filtering intended to block or restrict application usage is difficult to successfully implement without customer consent, since over time developers will tend to re-engineer filtered protocols so as to avoid the filters. Thus, over time, filtering is likely to result in interoperability issues or unnecessary complexity. These costs come without the benefit of effective filtering since many application protocols began to use HTTP as a transport protocol after application developers observed that firewalls allow HTTP traffic while dropping packets for unknown protocols.",
      "ja": "実際には、アプリケーションの使用をブロックしたり制限することを意図したフィルタリング時間をかけて開発者がフィルタを回避するように再設計のプロトコルをフィルタリングする傾向があることから、成功した顧客の同意なしに実現することは困難です。このように、時間をかけて、フィルタリングは、相互運用性の問題や不必要な複雑さにつながる可能性があります。多くのアプリケーションプロトコルは、アプリケーション開発者は、未知のプロトコルのパケットを落としながら、ファイアウォールがHTTPトラフィックを許可することを観察した後、トランスポートプロトコルとしてHTTPを使うようになったので、これらの費用は、効果的なフィルタリングの恩恵なしで来ます。"
    },
    {
      "indent": 3,
      "text": "Such arms races stem from inherent tussles between the desires of different entities. For example, the tussle between end-user desires and administrator desires leads to an arms race between firewalls and deep packet inspection on the one hand, vs. the use of obfuscation or tunnels on the other.",
      "ja": "このような腕のレースは異なるエンティティの欲望の間の固有乱闘に由来します。例えば、エンドユーザーの要望や管理者との闘争は、ファイアウォールや、一方でディープパケットインスペクション、対他の難読化やトンネルの使用との間の軍拡競争にリードを望んでいます。"
    },
    {
      "indent": 3,
      "text": "Although such arms races are often thought of in the context of network firewalls, they also occur with host firewalls. It is, however, generally easier for a host firewall to overcome, since it may be more practical for a host firewall to establish some form of trust between the policy-desiring entities, and have a trusted arbiter.",
      "ja": "こうした軍備レースは、多くの場合、ネットワークファイアウォールの文脈で考えられているが、彼らはまた、ホストのファイアウォールで発生します。ホストファイアウォールポリシー-望むエンティティ間の信頼関係のいくつかのフォームを確立し、信頼されるアービタを有することがより実用的かもしれないのでそれは、しかし、克服するためのホストファイアウォールのため、一般的に簡単です。"
    },
    {
      "indent": 0,
      "text": "4.1.3. Security Policies in a Service",
      "section_title": true,
      "ja": "4.1.3. サービスにおけるセキュリティポリシー"
    },
    {
      "indent": 3,
      "text": "In this approach, applications use a library or other external service whereby the applications have explicit knowledge of the impact of the security policies in order to avoid the problems in Section 3.1.3, and in a sandboxed environment, this might be the application's only way to interact with the network.",
      "ja": "このアプローチでは、アプリケーションは、アプリケーションが3.1.3で問題を回避するために、セキュリティポリシーの影響の明示的な知識を持っていることにより、ライブラリまたは他の外部サービスを使用し、サンドボックス環境で、これは、アプリケーションの唯一の方法かもしれませんネットワークと対話します。"
    },
    {
      "indent": 3,
      "text": "Thus, in this opt-in approach, applications provide a description of the network access requested, and the library/service can ensure that applications and/or users are informed in a way they can understand and that administrators can craft policy that affects the applications.",
      "ja": "したがって、このオプトインアプローチでは、アプリケーションは、要求されたネットワークアクセスの説明を提供し、ライブラリ/サービスは、アプリケーションおよび/またはユーザーが理解できる形で通知されていることを確認することができますし、管理者がポリシーを作ることができることをアプリケーションに影響を与えます。"
    },
    {
      "indent": 3,
      "text": "This approach is very difficult to do in a firewall-vendor-specific library/service when there can be multiple firewall implementations (including ones in the middle of the network), since it is usually impractical for an application developer to know about and develop for many different firewall APIs. It is, however, possible to employ this approach with a firewall-vendor-agnostic library/service that can communicate with both applications and firewalls. Thus, application developers and firewall developers can use a common platform.",
      "ja": "（ネットワークの中央にあるものを含む）複数のファイアウォールの実装が可能である場合、アプリケーション開発者が知っているとのために開発することが、通常は非現実的であるため、このアプローチは、ファイアウォールベンダー固有のライブラリ/サービスで行うことは非常に困難です多くの異なるファイアウォールのAPI。アプリケーションとファイアウォールの両方と通信することができ、ファイアウォールベンダーに依存しないライブラリ/サービスでこのアプローチを採用することは可能です。このため、アプリケーション開発者およびファイアウォールの開発者は、共通のプラットフォームを使用することができます。"
    },
    {
      "indent": 3,
      "text": "We observe that this approach is very different from the classic firewall approach. It is, however the approach used by some host operating system firewalls, and it is also the approach used by PCP in the IETF. As such, we encourage the deployment and use of this model.",
      "ja": "私たちは、このアプローチは、古典的なファイアウォール・アプローチとは非常に異なっていることを確認します。しかし、いくつかのホスト・オペレーティング・システムのファイアウォールが使用するアプローチであり、そしてそれはまた、IETFにおけるPCPで使用されるアプローチです。そのため、我々はこのモデルの展開と利用を奨励します。"
    },
    {
      "indent": 3,
      "text": "Furthermore, while this approach lessens the incentive for arms races as discussed above, one important issue still remains. Namely, there is no standard mechanism today for a library/service to learn complex policies from the network. Further work in this area is needed.",
      "ja": "このアプローチは、上述のように腕のレースのためのインセンティブを軽減しながら、さらに、一つの重要な問題はまだ残っています。つまり、ネットワークから複雑なポリシーを学ぶためのライブラリ/サービスのための標準的なメカニズム今日はありません。この分野での更なる研究が必要とされています。"
    },
    {
      "indent": 0,
      "text": "5. Stealth Mode",
      "section_title": true,
      "ja": "5.ステルスモード"
    },
    {
      "indent": 3,
      "text": "There is often a desire to hide from address and port scans on a public network. However, compliance to many RFCs requires responding to various messages. For example, TCP [RFC0793] compliance requires sending a RST in response to a SYN when there is no listener, and ICMPv6 [RFC4443] compliance requires sending an Echo Reply in response to an Echo Request.",
      "ja": "パブリックネットワーク上のアドレスとポートスキャンから隠したいという願望がしばしばあります。しかし、多くのRFCに準拠し、さまざまなメッセージに応答が必要です。例えば、TCP [RFC0793]コンプライアンスには、リスナーがない場合SYNに応答してRSTを送信する必要があり、ICMPv6の[RFC4443]のコンプライアンスは、エコー要求に応答して、エコー応答を送信することが必要です。"
    },
    {
      "indent": 3,
      "text": "Firewall rules can allow such stealth without changing the statement of compliance of the basic protocols. However, stealth mode could instead be implemented as a configurable option used by the applications themselves. For example, rather than a firewall rule to drop a certain outbound message after an application generates it, fewer resources would be consumed if the application knew not to generate it in the first place.",
      "ja": "ファイアウォールのルールは、基本的なプロトコルの準拠の声明を変更せずに、このようなステルスを許可することができます。しかし、ステルスモードではなく、アプリケーション自体で使用される設定可能なオプションとして実施することができます。アプリケーションが最初の場所でそれを生成しない知っていればたとえば、むしろアプリケーションがそれを生成した後、特定のアウトバウンドメッセージをドロップするファイアウォールルールよりも、少ないリソースが消費されます。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There is a common misconception that firewalls protect users from malware on their computer, when in fact firewalls protect users from buggy software. There is some concern that firewalls give users a false sense of security; firewalls are not invulnerable and will not prevent malware from running if the user allows it.",
      "ja": "実際にはファイアウォールはバグのあるソフトウェアからユーザーを保護する場合、自分のコンピュータ上のマルウェアからユーザーを保護するファイアウォールの一般的な誤解があります。ファイアウォールは、ユーザーが誤った安心感を与えるいくつかの懸念があります。ファイアウォールは不死身ではなく、ユーザーがそれを可能にする場合は実行されているからマルウェアを防ぐことはできません。"
    },
    {
      "indent": 3,
      "text": "This document has focused primarily on host firewalls. For additional discussion (focused more on network firewalls) see [RFC2979] and [BLOCK-FILTER].",
      "ja": "この文書では、ホストのファイアウォール上で主に焦点を当てています。追加の議論については（複数のネットワーク・ファイアウォール上の集中）[RFC2979]と[BLOCK-FILTER]を参照してください。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "Stuart Cheshire provided the motivation for this document by asking the thought-provoking question of why one would want to firewall an application rather than simply stop running it. The ensuing discussion, and subsequent IAB tech chat in November 2011, led to this document. Dan Simon, Stephen Bensley, Gerardo Diaz Cuellar, Brian Carpenter, and Paul Hoffman also provided helpful suggestions.",
      "ja": "スチュアートチェシャーは、1つのアプリケーションをファイアウォールではなく、単にそれを実行を停止する理由の示唆に富む質問を尋ねることによって、この文書のための動機を提供します。 2011年11月その後の議論、およびそれに続くIABハイテクチャットは、本文書につながりました。ダン・サイモン、スティーブンBensley、ヘラルド・ディアスクエリャル、ブライアン・カーペンター、そしてポール・ホフマンも役立つ情報を提供しました。"
    },
    {
      "indent": 0,
      "text": "8. IAB Members at the Time of Approval",
      "section_title": true,
      "ja": "承認時の8 IABメンバー"
    },
    {
      "indent": 3,
      "text": "Bernard Aboba Jari Arkko Marc Blanchet Ross Callon Alissa Cooper Joel Halpern Russ Housley Eliot Lear Xing Li Erik Nordmark Andrew Sullivan Dave Thaler Hannes Tschofenig",
      "ja": "バーナードAbobaヤリArkkoマルク・ブランシェロスCallonアリッサ・クーパージョエル・ハルパーンラスHousleyエリオット・リア興李エリックNordmarkとアンドリュー・サリバンデーブターラーハンネスTschofenig"
    },
    {
      "indent": 0,
      "text": "9. Informative References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 3,
      "text": "[BLOCK-FILTER] Barnes, R., Cooper, A., and O. Kolkman, \"Technical Considerations for Internet Service Blocking and Filtering\", Work in Progress, January 2014.",
      "ja": "[BLOCK-FILTER]バーンズ、R.、クーパー、A.、およびO. Kolkman、 \"インターネットサービスは、ブロッキングとフィルタリングのための技術的考察\"、進歩、2014年1月での作業。"
    },
    {
      "indent": 3,
      "text": "[RFC0793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981.",
      "ja": "[RFC0793]ポステル、J.、 \"伝送制御プロトコル\"、STD 7、RFC 793、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC2979] Freed, N., \"Behavior of and Requirements for Internet Firewalls\", RFC 2979, October 2000.",
      "ja": "[RFC2979]フリード、N.、 \"の行動とインターネットファイアウォールの要件\"、RFC 2979、2000年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC4443] Conta, A., Deering, S., and M. Gupta, \"Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6) Specification\", RFC 4443, March 2006.",
      "ja": "[RFC4443]コンタ、A.、デアリング、S.、およびM.グプタ、 \"インターネットプロトコルバージョン6（IPv6）の仕様のためのインターネット制御メッセージプロトコル（ICMPv6の）\"、RFC 4443、2006年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4864] Van de Velde, G., Hain, T., Droms, R., Carpenter, B., and E. Klein, \"Local Network Protection for IPv6\", RFC 4864, May 2007.",
      "ja": "[RFC4864]ヴァン・デ・ヴェルデ、G.、ハイン、T.、Droms、R.、大工、B.、およびE.クライン、 \"IPv6のローカルネットワークの保護\"、RFC 4864、2007年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC4890] Davies, E. and J. Mohacsi, \"Recommendations for Filtering ICMPv6 Messages in Firewalls\", RFC 4890, May 2007.",
      "ja": "[RFC4890]デイヴィス、E.およびJ. Mohacsi、 \"ファイアウォールでのフィルタリングICMPv6メッセージへの提言\"、RFC 4890、2007年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC4924] Aboba, B. and E. Davies, \"Reflections on Internet Transparency\", RFC 4924, July 2007.",
      "ja": "[RFC4924] Aboba、B.およびE.デイヴィス、 \"インターネット上の透明反射\"、RFC 4924、2007年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4948] Andersson, L., Davies, E., and L. Zhang, \"Report from the IAB workshop on Unwanted Traffic March 9-10, 2006\", RFC 4948, August 2007.",
      "ja": "[RFC4948]アンデション、L.、デイヴィス、E.、およびL.チャン、 \"不要なトラフィック月9-10、2006年IABワークショップからの報告書\"、RFC 4948、2007年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4949] Shirey, R., \"Internet Security Glossary, Version 2\", RFC 4949, August 2007.",
      "ja": "[RFC4949] Shirey、R.、 \"インターネットセキュリティ用語集、バージョン2\"、RFC 4949、2007年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5505] Aboba, B., Thaler, D., Andersson, L., and S. Cheshire, \"Principles of Internet Host Configuration\", RFC 5505, May 2009.",
      "ja": "[RFC5505] Aboba、B.、ターラー、D.、アンダーソン、L.、およびS.チェシャー、 \"インターネットホスト構成の原則\"、RFC 5505、2009年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC6887] Wing, D., Cheshire, S., Boucadair, M., Penno, R., and P. Selkirk, \"Port Control Protocol (PCP)\", RFC 6887, April 2013.",
      "ja": "[RFC6887]ウィング、D.、チェシャー、S.、Boucadair、M.、Penno、R.、およびP.セルカーク、 \"ポート制御プロトコル（PCP）\"、RFC 6887、2013年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC7045] Carpenter, B. and S. Jiang, \"Transmission and Processing of IPv6 Extension Headers\", RFC 7045, December 2013.",
      "ja": "[RFC7045]カーペンター、B.及びS.江、 \"送信とIPv6拡張ヘッダの処理\"、RFC 7045、2013年12月。"
    },
    {
      "indent": 3,
      "text": "[UPNPWANIP] UPnP Forum, \"WANIPConnection:2 Service\", September 2010, <http://upnp.org/specs/gw/ UPnP-gw-WANIPConnection-v2-Service.pdf>.",
      "ja": "[UPNPWANIP] UPnPフォーラム、 \"WANIPConnection：2サービス\"、2010年9月、<http://upnp.org/specs/gw/のUPnP-GW-WANIPConnection-V2-Service.pdf>。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dave Thaler Microsoft Corporation One Microsoft Way Redmond, WA 98052 USA",
      "ja": "デーブターラーマイクロソフト社1マイクロソフト道、レッドモンド、ワシントン98052 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 425 703 8835 EMail: dthaler@microsoft.com",
      "ja": "電話：+1 425 703 8835 Eメール：dthaler@microsoft.com"
    }
  ]
}