{
  "title": {
    "text": "RFC 7394 - Definition of Time to Live TLV for LSP-Ping Mechanisms",
    "ja": "RFC 7394 - LSP-Pingメカニズムの生存期間TLVの定義"
  },
  "number": 7394,
  "created_at": "2020-08-31 19:46:06.194670+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        S. Boutros\nRequest for Comments: 7394                                  S. Sivabalan\nCategory: Standards Track                                     G. Swallow\nISSN: 2070-1721                                                S. Saxena\n                                                           Cisco Systems\n                                                               V. Manral\n                                                          Ionos Networks\n                                                               S. Aldrin\n                                               Huawei Technologies, Inc.\n                                                           November 2014",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "Definition of Time to Live TLV for LSP-Ping Mechanisms",
      "ja": "LSP-Pingメカニズムの生存期間TLVの定義"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "LSP-Ping is a widely deployed Operation, Administration, and Maintenance (OAM) mechanism in MPLS networks. However, in the present form, this mechanism is inadequate to verify connectivity of a segment of a Multi-Segment Pseudowire (MS-PW) and/or bidirectional co-routed Label Switched Path (LSP) from any node on the path of the MS-PW and/or bidirectional co-routed LSP. This document defines a TLV to address this shortcoming.",
      "ja": "LSP-Pingは、MPLSネットワークで広く展開されている運用、管理、および保守（OAM）メカニズムです。ただし、現在の形式では、このメカニズムは、MSのパス上の任意のノードからのマルチセグメント疑似配線（MS-PW）のセグメントの接続性、および/または双方向の同じルートのラベルスイッチドパス（LSP）を検証するには不十分です。 -PWおよび/または双方向コルーテッドLSP。このドキュメントでは、この欠点に対処するTLVを定義しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはInternet Standards Trackドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。インターネット標準の詳細については、RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7394.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7394で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2014 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Terminology .....................................................3\n3. Time To Live TLV ................................................4\n   3.1. TTL TLV Format .............................................4\n   3.2. Usage ......................................................4\n4. Operation .......................................................5\n   4.1. Traceroute Mode ............................................6\n   4.2. Error Scenario .............................................6\n5. Security Considerations .........................................6\n6. IANA Considerations .............................................7\n7. References ......................................................7\n   7.1. Normative References .......................................7\nAcknowledgements ...................................................7\nContributors .......................................................7\nAuthors' Addresses .................................................8",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 0,
      "text": " An MS-PW may span across multiple service provider networks. In order to allow Service Providers (SPs) to verify segments of such MS-PWs from any node on the path of the MS-PW, any node along the path of the MS-PW, should be able to originate an MPLS Echo Request packet to any other node along the path of the MS-PW and receive the corresponding MPLS Echo Reply. If the originator of the MPLS Echo Request is at the end of a MS-PW, the receiver of the request can send the reply back to the sender without knowing the hop-count distance of the originator. The reply will be intercepted by the originator regardless of the TTL value on the reply packet. But, if the originator is not at the end of the MS-PW, the receiver of the MPLS Echo Request may need to know how many hops away the originator of the MPLS Echo Request is so that it can set the TTL value on the MPLS header for the MPLS Echo Reply to be intercepted at the originator node.",
      "ja": "MS-PWは、複数のサービスプロバイダーネットワークにまたがることがあります。サービスプロバイダー（SP）が、MS-PWのパス上のノードからそのようなMS-PWのセグメントを確認できるようにするために、MS-PWのパスに沿ったすべてのノードは、MPLSエコー要求パケットを発信できる必要があります。 MS-PWのパスに沿った他のノードに送信し、対応するMPLSエコー応答を受信します。 MPLSエコー要求の発信者がMS-PWの最後にある場合、要求の受信者は発信者のホップカウント距離を知らなくても送信者に返信を返すことができます。返信パケットのTTL値に関係なく、返信は発信者によって傍受されます。ただし、発信者がMS-PWの最後にない場合、MPLSエコー要求の受信者は、MPLSエコー要求の発信者がMPLSにTTL値を設定できるように何ホップ離れているかを知る必要がある場合があります。発信者ノードでインターセプトされるMPLSエコー応答のヘッダー。"
    },
    {
      "indent": 3,
      "text": "In MPLS networks, for bidirectional co-routed LSPs, if it is desired to verify connectivity from any intermediate node Label Switching Router (LSR) on the LSP to the any other LSR on the LSP the receiver may need to know the TTL to send the MPLS Echo Reply with, so as the packet is intercepted by the originator node.",
      "ja": "MPLSネットワークでは、双方向コルーテッドLSPの場合、LSP上の中間ノードのラベルスイッチングルータ（LSR）からLSP上の他のLSRへの接続を確認する必要がある場合、受信者はTTLを知って送信する必要があります。 MPLS Echo Reply with。これにより、パケットは発信者ノードによって傍受されます。"
    },
    {
      "indent": 3,
      "text": "A new optional TTL TLV is defined in this document. This TLV will be added by the originator of the MPLS Echo Request to inform the receiver how many hops away the originator is on the path of the MS-PW or bidirectional LSP.",
      "ja": "このドキュメントでは、新しいオプションのTTL TLVが定義されています。このTLVはMPLSエコー要求の発信者によって追加され、発信者がMS-PWまたは双方向LSPのパス上にあるホップ数をレシーバーに通知します。"
    },
    {
      "indent": 3,
      "text": "This mechanism only works if the MPLS Echo Reply is sent down the co-routed LSP; hence, the scope of this TTL TLV is currently limited to MS-PW or bidirectional co-routed MPLS LSPs. The presence of the TLV implies the use of the return path of the co-routed LSP, if the return path is any other mechanism, then the TLV in the MPLS Echo Request MUST be ignored.",
      "ja": "このメカニズムが機能するのは、MPLSエコー応答が同じルートのLSPに送信された場合のみです。したがって、このTTL TLVの範囲は現在、MS-PWまたは双方向のコルーテッドMPLS LSPに制限されています。 TLVの存在は、同じルートのLSPのリターンパスの使用を意味します。リターンパスが他のメカニズムである場合、MPLSエコー要求のTLVは無視する必要があります。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 RFC 2119 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "LSR: Label Switching Router",
      "ja": "LSR：ラベルスイッチングルーター"
    },
    {
      "indent": 3,
      "text": "MPLS-TP: MPLS Transport Profile",
      "ja": "MPLS-TP：MPLSトランスポートプロファイル"
    },
    {
      "indent": 3,
      "text": "MS-PW: Multi-Segment Pseudowire",
      "ja": "MS-PW：マルチセグメント疑似配線"
    },
    {
      "indent": 3,
      "text": "PW: Pseudowire",
      "ja": "説明：シュードビル"
    },
    {
      "indent": 3,
      "text": "TLV: Type Length Value",
      "ja": "TLV：タイプの長さの値"
    },
    {
      "indent": 3,
      "text": "TTL: Time To Live",
      "ja": "TTL：存続可能時間"
    },
    {
      "indent": 0,
      "text": "3. Time To Live TLV",
      "section_title": true,
      "ja": "3. Time To Live TLV"
    },
    {
      "indent": 0,
      "text": "3.1. TTL TLV Format",
      "section_title": true,
      "ja": "3.1. TTL TLV形式"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Type = 32769                 |   Length = 8                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Value       |   Reserved    |   Flags                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 18,
      "text": "Figure 1: Time To Live TLV Format",
      "ja": "図1：存続時間TLV形式"
    },
    {
      "indent": 3,
      "text": "The TTL TLV has the format shown in Figure 1.",
      "ja": "TTL TLVのフォーマットは、図1に示されています。"
    },
    {
      "indent": 3,
      "text": "Value",
      "ja": "値"
    },
    {
      "indent": 6,
      "text": "The value of the TTL as specified by this TLV",
      "ja": "このTLVで指定されたTTLの値"
    },
    {
      "indent": 3,
      "text": "Flags",
      "ja": "旗"
    },
    {
      "indent": 6,
      "text": "The Flags field is a bit vector with the following format:",
      "ja": "Flagsフィールドは、次の形式のビットベクトルです。"
    },
    {
      "indent": 6,
      "text": " 0                   1\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|             MBZ             |R|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "One flag is defined for now, the R flag. The rest of the flags are Reserved - MUST be zero (MBZ) when sending and ignored on receipt.",
      "ja": "今のところ、Rフラグという1つのフラグが定義されています。残りのフラグは予約済みです-送信時にゼロ（MBZ）でなければならず、受信時に無視されます。"
    },
    {
      "indent": 6,
      "text": "The R flag (Reply TTL) is set signify that the value is meant to be used as the TTL for the reply packet. Other bits may be defined later to enhance the scope of this TLV.",
      "ja": "Rフラグ（応答TTL）が設定されていると、その値が応答パケットのTTLとして使用されることを意味します。他のビットは、このTLVの範囲を拡張するために後で定義される場合があります。"
    },
    {
      "indent": 0,
      "text": "3.2. Usage",
      "section_title": true,
      "ja": "3.2. 使用法"
    },
    {
      "indent": 3,
      "text": "The TTL TLV MAY be included in the MPLS Echo Request by the originator of the request.",
      "ja": "TTL TLVは、要求の発信者がMPLSエコー要求に含めることができます。"
    },
    {
      "indent": 3,
      "text": "If the TTL TLV is present and the receiver does not understand TTL TLVs, it will simply ignore the TLV, as is the case for all optional TLVs. If the TTL TLV is not present or is not processed by the receiver, any determination of the TTL value used in the MPLS label on the LSP-Ping echo reply is beyond the scope of this document.",
      "ja": "TTL TLVが存在し、レシーバーがTTL TLVを理解しない場合、すべてのオプションのTLVの場合と同様に、TLVは単に無視されます。 TTL TLVが存在しないか、レシーバーによって処理されない場合、LSP-Pingエコー応答のMPLSラベルで使用されるTTL値の決定は、このドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "If the TTL TLV is present and the receiver understands TTL TLVs, one of the following two conditions apply:",
      "ja": "TTL TLVが存在し、レシーバーがTTL TLVを理解する場合、次の2つの条件のいずれかが適用されます。"
    },
    {
      "indent": 3,
      "text": "o If the TTL TLV value field is zero, the LSP-Ping echo request packet SHOULD be dropped.",
      "ja": "o TTL TLV値フィールドがゼロの場合、LSP-Pingエコー要求パケットをドロップする必要があります（SHOULD）。"
    },
    {
      "indent": 3,
      "text": "o Otherwise, the receiver MUST use the TTL value specified in the TTL TLV when it creates the MPLS header of the MPLS Echo Reply. The TTL value in the TTL TLV takes precedence over any TTL value determined by other means, such as from the Switching Point TLV in the MS-PW. This precedence will aid the originator of the LSP-Ping echo request in analyzing the return path.",
      "ja": "o それ以外の場合、レシーバーはMPLSエコー応答のMPLSヘッダーを作成するときに、TTL TLVで指定されたTTL値を使用する必要があります。 TTL TLVのTTL値は、MS-PWのスイッチングポイントTLVからなど、他の方法で決定されたTTL値よりも優先されます。この優先順位は、LSP-Pingエコー要求の発信者が戻りパスを分析するのに役立ちます。"
    },
    {
      "indent": 0,
      "text": "4. Operation",
      "section_title": true,
      "ja": "4. 操作"
    },
    {
      "indent": 3,
      "text": "In this section, we explain a use case for the TTL TLV with an MPLS MS-PW.",
      "ja": "このセクションでは、MPLS MS-PWを使用したTTL TLVの使用例について説明します。"
    },
    {
      "indent": 12,
      "text": "<------------------MS-PW --------------------->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "A          B          C           D           E\no -------- o -------- o --------- o --------- o\n           ---MPLS Echo Request--->\n           <--MPLS Echo Reply------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Figure 2: Use-Case with MS-PWs",
      "ja": "図2：MS-PWを使用したユースケース"
    },
    {
      "indent": 3,
      "text": "Let us assume an MS-PW going through LSRs A, B, C, D, and E. Furthermore, assume that an operator wants to perform a connectivity check between B and D, from B. Thus, an MPLS Echo Request with the TTL TLV is originated from B and sent towards D. The MPLS Echo Request packet contains the FEC of the PW Segment between C and D. The value field of the TTL TLV and the TTL field of the MPLS label are set to 2, the choice of the value 2 will be based on the operator input requesting the MPLS Echo Request or from the optional LDP switching point TLV. The MPLS Echo Request is intercepted at D because of TTL expiry. D detects the TTL TLV in the request and uses the TTL value (i.e., 2) specified in the TLV on the MPLS label of the MPLS Echo Reply. The MPLS Echo Reply will be intercepted by B because of TTL expiry.",
      "ja": "LSR A、B、C、D、およびEを通過するMS-PWを想定します。さらに、オペレータがBからBとDの間の接続性チェックを実行したいとします。したがって、TTLを使用したMPLSエコー要求TLVはBから発信され、Dに向けて送信されます。MPLSエコー要求パケットには、CとDの間のPWセグメントのFECが含まれています。TTLTLVの値フィールドとMPLSラベルのTTLフィールドは2に設定されています。値2は、MPLSエコー要求を要求するオペレーター入力、またはオプションのLDPスイッチングポイントTLVからの値に基づいています。 TTLの期限切れのため、MPLSエコー要求はDでインターセプトされます。 DはリクエストでTTL TLVを検出し、MPLSエコー応答のMPLSラベルのTLVで指定されたTTL値（つまり、2）を使用します。 TTLの期限切れのため、MPLSエコー応答はBによってインターセプトされます。"
    },
    {
      "indent": 3,
      "text": "The same operation will apply when we have a co-routed bidirectional LSP and we want to check connectivity from an intermediate LSR \"B\" to another LSR \"D\".",
      "ja": "同一ルートの双方向LSPがあり、中間のLSR \"B\"から別のLSR \"D\"への接続を確認する場合も、同じ操作が適用されます。"
    },
    {
      "indent": 0,
      "text": "4.1. Traceroute Mode",
      "section_title": true,
      "ja": "4.1. tracerouteモード"
    },
    {
      "indent": 3,
      "text": "In traceroute mode, the TTL value in the TLV is set to 1 for the first Echo Request, then to 2 for the next, and so on. This is similar to the TTL values used for the label set on the packet.",
      "ja": "tracerouteモードでは、TLVのTTL値は最初のエコー要求に対して1に設定され、次のエコー要求に対して2に設定されます。これは、パケットに設定されたラベルに使用されるTTL値に似ています。"
    },
    {
      "indent": 0,
      "text": "4.2. Error Scenario",
      "section_title": true,
      "ja": "4.2. エラーシナリオ"
    },
    {
      "indent": 3,
      "text": "It is possible that the MPLS Echo Request packet was intercepted before the intended destination for reasons other than label TTL expiry. This could be due to network faults, misconfiguration, or other reasons. In such cases, if the return TTL is set to the value specified in the TTL TLV, then the echo response packet will continue beyond the originating node. This becomes a security issue.",
      "ja": "ラベルTTLの有効期限以外の理由で、意図した宛先の前にMPLSエコー要求パケットが傍受された可能性があります。これは、ネットワーク障害、設定ミス、またはその他の理由が原因である可能性があります。このような場合、リターンTTLがTTL TLVで指定された値に設定されていると、エコー応答パケットは発信ノードを超えて継続します。これはセキュリティの問題になります。"
    },
    {
      "indent": 3,
      "text": "To prevent this, the label TTL value used in the MPLS Echo Reply packet MUST be modified by deducting the incoming label TTL on the received packet from TTL TLV value. If the MPLS Echo Request packet is punted to the CPU before the incoming label TTL is deducted, then another 1 MUST be added. In other words:",
      "ja": "これを防ぐには、MPLSエコー応答パケットで使用されるラベルTTL値を、TTL TLV値から受信パケットの着信ラベルTTLを差し引くことによって変更する必要があります。着信ラベルTTLが差し引かれる前にMPLSエコー要求パケットがCPUにパントされる場合、別の1を追加する必要があります。言い換えると："
    },
    {
      "indent": 3,
      "text": "Return TTL Value on the MPLS Echo Reply packet = (TTL TLV Value) -\n(Incoming Label TTL) + 1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document allows the setting of the TTL value in the MPLS Label of an MPLS Echo Reply, so that it can be intercepted by an intermediate device. This can cause a device to get a lot of LSP-Ping packets that get redirected to the CPU.",
      "ja": "このドキュメントでは、MPLSエコー応答のMPLSラベルでTTL値を設定できるため、中間デバイスによって傍受される可能性があります。これにより、デバイスがCPUにリダイレクトされる多くのLSP-Pingパケットを取得する可能性があります。"
    },
    {
      "indent": 3,
      "text": "However, the same is possible even without the changes mentioned in this document. A device should rate limit the LSP-Ping packets redirected to the CPU so that the CPU is not overwhelmed.",
      "ja": "ただし、このドキュメントに記載されている変更がなくても、同じことが可能です。 CPUが過負荷にならないように、デバイスはCPUにリダイレクトされるLSP-Pingパケットをレート制限する必要があります。"
    },
    {
      "indent": 3,
      "text": "The recommendation in the Security Considerations of [RFC4379] applies, to check the source address of the MPLS Echo Request; however, the source address can now be any node along the LSP path.",
      "ja": "[RFC4379]のセキュリティに関する考慮事項の推奨事項が適用され、MPLSエコー要求の送信元アドレスをチェックします。ただし、送信元アドレスはLSPパス上の任意のノードにすることができます。"
    },
    {
      "indent": 3,
      "text": "A faulty transit node changing the TTL TLV value could make the wrong node reply to the MPLS Echo Request, and/or the wrong node to receive the MPLS Echo Reply. An LSP trace may help identify the faulty transit node.",
      "ja": "TTL TLV値を変更する障害のあるトランジットノードは、MPLSエコー要求に間違ったノードを応答させたり、MPLSエコー応答を受信するために間違ったノードを引き起こしたりする可能性があります。 LSPトレースは、障害のある中継ノードを識別するのに役立ちます。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned a TLV type value to the following TLV from the \"Multi-Protocol Label Switching (MPLS) Label Switched Paths (LSPs) Ping Parameters\" registry in the \"TLVs\" subregistry.",
      "ja": "IANAは、「TLVs」サブレジストリの「Multi-Protocol Label Switching（MPLS）Label Switched Paths（LSPs）Ping Parameters」レジストリから次のTLVにTLVタイプ値を割り当てました。"
    },
    {
      "indent": 6,
      "text": "Time To Live TLV (see Section 3).",
      "ja": "Time To Live TLV（セクション3を参照）。"
    },
    {
      "indent": 3,
      "text": "IANA has allocated the value 32769.",
      "ja": "IANAは値32769を割り当てました。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1 Normative References",
      "section_title": true,
      "ja": "7.1 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月、<http://www.rfc-editor.org/info/rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC4379] Kompella, K. and G. Swallow, \"Detecting Multi-Protocol Label Switched (MPLS) Data Plane Failures\", RFC 4379, February 2006, <http://www.rfc-editor.org/info/rfc4379>.",
      "ja": "[RFC4379] Kompella、K。およびG. Swallow、「Detecting Multi-Protocol Label Switched（MPLS）Data Plane Failures」、RFC 4379、2006年2月、<http://www.rfc-editor.org/info/rfc4379> 。"
    },
    {
      "indent": 3,
      "text": "[RFC5085] Nadeau, T., Ed., and C. Pignataro, Ed., \"Pseudowire Virtual Circuit Connectivity Verification (VCCV): A Control Channel for Pseudowires\", RFC 5085, December 2007, <http://www.rfc-editor.org/info/rfc5085>.",
      "ja": "[RFC5085] Nadeau、T.、Ed。およびC. Pignataro、Ed。、「Pseudowire Virtual Circuit Connectivity Verification（VCCV）：A Control Channel for Pseudowires」、RFC 5085、2007年12月、<http：//www.rfc -editor.org/info/rfc5085>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Greg Mirsky for his comments.",
      "ja": "著者は彼のコメントのためにグレッグ・ミルスキーに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "貢献者"
    },
    {
      "indent": 3,
      "text": "Michael Wildt Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA 01719 United States EMail: mwildt@cisco.com",
      "ja": "Michael Wildt Cisco Systems、Inc. 1414 Massachusetts Avenue Boxborough、MA 01719 United States Eメール：mwildt@cisco.com"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Sami Boutros Cisco Systems, Inc. 3750 Cisco Way San Jose, CA 95134 United States EMail: sboutros@cisco.com",
      "ja": "Sami Boutros Cisco Systems、Inc. 3750 Cisco Way San Jose、CA 95134米国Eメール：sboutros@cisco.com"
    },
    {
      "indent": 3,
      "text": "Siva Sivabalan Cisco Systems, Inc. 2000 Innovation Drive Kanata, Ontario, K2K 3E8 Canada EMail: msiva@cisco.com",
      "ja": "Shiva Sivabalan Cisco Systems、Inc. ವೆ革新的なドライブカンタ、オンタリオ、Q1 A ೮カナダメール：masiva@scisco.com"
    },
    {
      "indent": 3,
      "text": "George Swallow Cisco Systems, Inc. 300 Beaver Brook Road Boxborough, MA 01719 United States EMail: swallow@cisco.com",
      "ja": "George Swallow Cisco Systems、Inc. 300 Beaver Brook Road Boxborough、MA 01719 United States Eメール：swallow@cisco.com"
    },
    {
      "indent": 3,
      "text": "Shaleen Saxena Cisco Systems, Inc. 1414 Massachusetts Avenue Boxborough, MA 01719 United States EMail: ssaxena@cisco.com",
      "ja": "Shaleen Saxena Cisco Systems、Inc. 1414 Massachusetts Avenue Boxborough、MA 01719 United States Eメール：ssaxena@cisco.com"
    },
    {
      "indent": 3,
      "text": "Vishwas Manral Ionos Networks 4100 Moorpark Ave, Suite 122 San Jose, CA 95117 United States EMail: vishwas@ionosnetworks.com",
      "ja": "Biswas Muralnios Networks 4100 Murvik Ave、Suithe 122 SunJosé、CA 95117 United Statesメール：Biswas@iononetwerks.com。"
    },
    {
      "indent": 3,
      "text": "Sam Aldrin Huawei Technologies, Inc. 1188 Central Express Way, Santa Clara, CA 95051 United States EMail: aldrin.ietf@gmail.com",
      "ja": "Sam Aldrin Huawei Technologies、Inc. 1188 Central Express Way、Santa Clara、CA 95051 United States Eメール：aldrin.ietf@gmail.com"
    }
  ]
}