{
  "title": {
    "text": "RFC 7699 - Generalized Labels for the Flexi-Grid in Lambda Switch Capable (LSC) Label Switching Routers",
    "ja": "RFC 7699 - ラムダにおけるフレキシグリッドのための一般ラベルが可能（LSC）ラベルスイッチングルータスイッチ"
  },
  "number": 7699,
  "created_at": "2019-11-01 08:47:14.148134+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         A. Farrel\nRequest for Comments: 7699                                       D. King\nUpdates: 3471, 6205                                   Old Dog Consulting\nCategory: Standards Track                                          Y. Li\nISSN: 2070-1721                                       Nanjing University\n                                                                F. Zhang\n                                                     Huawei Technologies\n                                                           November 2015",
      "raw": true
    },
    {
      "indent": 10,
      "text": "      Generalized Labels for the Flexi-Grid in\nLambda Switch Capable (LSC) Label Switching Routers",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "GMPLS supports the description of optical switching by identifying entries in fixed lists of switchable wavelengths (called grids) through the encoding of lambda labels. Work within the ITU-T Study Group 15 has defined a finer-granularity grid, and the facility to flexibly select different widths of spectrum from the grid. This document defines a new GMPLS lambda label format to support this flexi-grid.",
      "ja": "GMPLSは、ラムダラベルの符号化を介して切替可能な波長（グリッドと呼ばれる）の固定されたリスト内のエントリを識別することによって、光スイッチの説明を支持します。 ITU-T研究グループ15内の作業は、より細かい粒度のグリッドを定義しており、設備は柔軟グリッドからスペクトルの異なる幅を選択します。この文書では、このフレキシグリッドをサポートする新しいGMPLSラムダラベルフォーマットを定義します。"
    },
    {
      "indent": 3,
      "text": "This document updates RFCs 3471 and 6205 by introducing a new label format.",
      "ja": "この文書は、新しいラベルフォーマットを導入しているRFC 3471と6205を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7699.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7699で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n   1.1. Conventions Used in This Document . . . . . . . . . . . . . 4\n2. Overview of Flexi-Grid . . . . . . . . . . . . . . . . . . . . . 4\n3. Fixed-Grid Lambda Label Encoding . . . . . . . . . . . . . . . . 5\n4. Flexi-Grid Label Format and Values . . . . . . . . . . . . . . . 5\n   4.1. Flexi-Grid Label Encoding . . . . . . . . . . . . . . . . . 5\n   4.2. Considerations of Bandwidth . . . . . . . . . . . . . . . . 7\n   4.3. Composite Labels  . . . . . . . . . . . . . . . . . . . . . 7\n5. Manageability and Backward Compatibility Considerations  . . . . 9\n   5.1. Control-Plane Backward Compatibility  . . . . . . . . . . . 9\n   5.2. Manageability Considerations  . . . . . . . . . . . . . . . 9\n6. Security Considerations . . . . . . . . . . . . . . . . . . . . 10\n7. IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 10\n   7.1. Grid Subregistry . . . . . . . . . . . . . . . . . . . . . 10\n   7.2. DWDM Channel Spacing Subregistry . . . . . . . . . . . . . 11\n8. References  . . . . . . . . . . . . . . . . . . . . . . . . . . 11\n   8.1. Normative References . . . . . . . . . . . . . . . . . . . 11\n   8.2. Informative References . . . . . . . . . . . . . . . . . . 11\nAppendix A. Flexi-Grid Example . . . . . . . . . . . . . . . . . . 13\nAcknowledgments  . . . . . . . . . . . . . . . . . . . . . . . . . 14\nContributors . . . . . . . . . . . . . . . . . . . . . . . . . . . 14\nAuthors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "As described in [RFC3945], GMPLS extends MPLS from supporting only Packet Switch Capable (PSC) interfaces and switching, to also support four new classes of interfaces and switching that include Lambda Switch Capable (LSC).",
      "ja": "[RFC3945]に記載されているように、GMPLSは、パケットができる（PSC）インターフェイスと切り替えスイッチ支持からMPLSを拡張し、またラムダを含むインターフェイスとスイッチング4つの新たなクラスをサポートする（LSC）を対応スイッチ。"
    },
    {
      "indent": 3,
      "text": "A functional description of the extensions to MPLS signaling needed to support this new class of interface and switching is provided in [RFC3471].",
      "ja": "インターフェイスと切り替えのこの新しいクラスをサポートするために必要なMPLSシグナリングの拡張機能の機能説明は、[RFC3471]に提供されます。"
    },
    {
      "indent": 3,
      "text": "Section 3.2.1.1 of [RFC3471] states that wavelength labels \"only have significance between two neighbors\": global wavelength semantics are not considered. [RFC6205] defines a standard lambda label format that has a global semantic and is compliant with both the Dense Wavelength Division Multiplexing (DWDM) grid [G.694.1] and the Coarse Wavelength Division Multiplexing (CWDM) grid [G.694.2]. The terms DWDM and CWDM are defined in [G.671].",
      "ja": "[RFC3471]のセクション3.2.1.1は、波長ラベルは「2人のだけの隣人との意義を持っている」と述べている：グローバル波長セマンティクスが考慮されていません。 [RFC6205]はグローバルなセマンティックを持っており、高密度波長分割多重（DWDM）グリッド[G.694.1]及び粗波長分割多重（CWDM）グリッド[G.694.2]の両方に準拠した標準ラムダラベルフォーマットを定義します。用語DWDMとCWDMは[G.671]で定義されています。"
    },
    {
      "indent": 3,
      "text": "A flexible-grid network selects its data channels as arbitrarily assigned pieces of the spectrum. Mixed bitrate transmission systems can allocate their channels with different spectral bandwidths so that the channels can be optimized for the bandwidth requirements of the particular bit rate and modulation scheme of the individual channels. This technique is regarded as a promising way to improve the network utilization efficiency and fundamentally reduce the cost of the core network.",
      "ja": "フレキシブルグリッドネットワークは、スペクトルの任意に割り当てられた部品として、そのデータ・チャネルを選択します。チャネルは、個々のチャネルの特定のビットレート及び変調方式の帯域幅要件のために最適化することができるように、混合ビットレート伝送システムは、異なるスペクトル帯域幅とのチャネルを割り当てることができます。この技術は、ネットワークの利用効率を向上させ、基本的に、コアネットワークのコストを削減するための有望な方法と考えられます。"
    },
    {
      "indent": 3,
      "text": "The \"flexi-grid\" has been developed within the ITU-T Study Group 15 to allow selection and switching of pieces of the optical spectrum chosen flexibly from a fine-granularity grid of wavelengths with variable spectral bandwidth [G.694.1].",
      "ja": "「フレキシグリッド」可変スペクトル帯域幅[G.694.1]と波長の細かい粒度のグリッドから柔軟に選択された光スペクトルの部分の選択及び切り替えを可能にするために、ITU-T研究グループ15内に開発されました。"
    },
    {
      "indent": 3,
      "text": "[RFC3471] defines several basic label types including the lambda label. Section 3.2.1.1 of [RFC3471] states that wavelength labels \"only have significance between two neighbors\"; global wavelength semantics are not considered. In order to facilitate interoperability in a network composed of LSC equipment, [RFC6205] defines a standard lambda label format and is designated an update of RFC 3471.",
      "ja": "[RFC3471]はラムダのラベルを含めたいくつかの基本的なラベルタイプを定義します。 [RFC3471]のセクション3.2.1.1は、波長ラベルは「2人のだけの隣人との意義を持っている」と述べています。グローバルな波長の意味は考慮されません。 LSC機器からなるネットワークで相互運用性を容易にするために、[RFC6205]は、標準的なラムダラベルフォーマットを定義し、RFC 3471の更新を指定します。"
    },
    {
      "indent": 3,
      "text": "This document continues the theme of defining global semantics for the wavelength label by adding support for the flexi-grid. Thus, this document updates [RFC6205] and [RFC3471].",
      "ja": "この文書では、フレキシグリッドのサポートを追加することにより、波長ラベルのための世界的なセマンティクスを定義するテーマを続けています。したがって、このドキュメントの更新[RFC6205]と[RFC3471]。"
    },
    {
      "indent": 3,
      "text": "This document relies on [G.694.1] for the definition of the optical data plane and does not make any updates to the work of the ITU-T.",
      "ja": "この文書では、光データプレーンの定義について[G.694.1]に依存しており、ITU-Tの作品への更新を行いません。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.1。このドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Overview of Flexi-Grid",
      "section_title": true,
      "ja": "フレキシグリッドの2の概要"
    },
    {
      "indent": 3,
      "text": "[G.694.1] defines DWDM fixed grids. The latest version of that document extends the DWDM fixed grids to add support for flexible grids. The basis of the work is to allow a data channel to be formed from an abstract grid anchored at 193.1 THz and selected on a channel spacing of 6.25 GHz with a variable slot width measured in units of 12.5 GHz. Individual allocations may be made on this basis from anywhere in the spectrum, subject to allocations not overlapping.",
      "ja": "【G.694.1は】DWDM固定グリッドを定義します。そのドキュメントの最新バージョンは、柔軟なグリッドのサポートを追加するDWDM固定グリッドを拡張します。作業の基礎は193.1テラヘルツで固定抽象グリッドから形成され、12.5 GHzの単位で測定された可変スロット幅6.25ギガヘルツのチャネル間隔で選択するデータチャネルを可能にすることです。個々の割り当ては、割り当ての対象とは重ならない、どこスペクトル中からこれに基づいて行ってもよいです。"
    },
    {
      "indent": 3,
      "text": "[G.694.1] provides clear guidance on the support of flexible grid by implementations in Section 2 of Appendix I:",
      "ja": "[G.694.1]は付録Iの第2の実装によってフレキシブルグリッドの支持体上に明確な指針を提供します。"
    },
    {
      "indent": 6,
      "text": "The flexible DWDM grid defined in clause 7 has a nominal central frequency granularity of 6.25 GHz and a slot width granularity of 12.5 GHz. However, devices or applications that make use of the flexible grid may not have to be capable of supporting every possible slot width or position. In other words, applications may be defined where only a subset of the possible slot widths and positions are required to be supported.",
      "ja": "項7で定義された柔軟なDWDMグリッドは6.25ギガヘルツの公称中心周波数粒度と12.5ギガヘルツのスロット幅粒度を有しています。しかし、フレキシブルグリッドを利用するデバイスまたはアプリケーションは、すべての可能なスロット幅や位置を支持することが可能でなければならないかもしれません。可能なスロット幅と位置のサブセットのみをサポートする必要がある場合言い換えれば、アプリケーションが定義されてもよいです。"
    },
    {
      "indent": 6,
      "text": "For example, an application could be defined where the nominal central frequency granularity is 12.5 GHz (by only requiring values of n that are even) and that only requires slot widths as a multiple of 25 GHz (by only requiring values of m that are even).",
      "ja": "公称中心周波数粒度は（唯一の偶数であるNの値を要求することによって）、12.5 GHzであり、それはわずか25ギガヘルツの倍数としてスロット幅を必要とする場合、例えば、アプリケーションは、偶数であり、Mの値を要求することによって、（定義することができます）。"
    },
    {
      "indent": 3,
      "text": "Some additional background on the use of GMPLS for flexible grids can be found in [RFC7698].",
      "ja": "フレキシブルグリッドのGMPLSの使用に関するいくつかの追加の背景は、[RFC7698]に見出すことができます。"
    },
    {
      "indent": 0,
      "text": "2.1. Composite Labels",
      "section_title": true,
      "ja": "2.1。コンポジットラベル"
    },
    {
      "indent": 3,
      "text": "It is possible to construct an end-to-end connection as a composite of more than one flexi-grid slot. The mechanism used in GMPLS is similar to that used to support inverse multiplexing familiar in time-division multiplexing (TDM) and optical transport networks (OTNs). The slots in the set could potentially be contiguous or non-contiguous (only as allowed by the definitions of the data plane) and could be signaled as a single LSP or constructed from a group of LSPs. For more details, refer to Section 4.3.",
      "ja": "複数のフレキシグリッドスロットの複合などのエンドツーエンドの接続を構築することが可能です。 GMPLSで使用されるメカニズムは、時分割多重（TDM）でおなじみの逆多重化および光トランスポートネットワーク（OTNs）をサポートするために使用されるものと同様です。セット内のスロットは、潜在的に連続または非連続であってもよい（データプレーンの定義によって許可される唯一のように）単一のLSPとしてシグナリングまたはLSPのグループから構成することができます。詳細については、4.3節を参照してください。"
    },
    {
      "indent": 3,
      "text": "How the signal is carried across such groups of channels is out of scope for this document.",
      "ja": "信号はチャンネルのようなグループ全体で実施されてどのようにこの文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "3. Fixed-Grid Lambda Label Encoding",
      "section_title": true,
      "ja": "3.固定グリッドラムダラベルのエンコーディング"
    },
    {
      "indent": 3,
      "text": "[RFC6205] defines an encoding for a global semantic for a DWDM label based on four fields:",
      "ja": "[RFC6205]は四つのフィールドに基づいて、DWDMラベルのグローバルセマンティックのエンコーディングを定義します。"
    },
    {
      "indent": 3,
      "text": "- Grid: used to select which grid the lambda is selected from. Values defined in [RFC6205] identify DWDM [G.694.1] and CWDM [G.694.2].",
      "ja": " - グリッド：ラムダから選択されたグリッドを選択するために使用されます。 [RFC6205]で定義された値は、DWDM [G.694.1]とCWDM [G.694.2]を識別する。"
    },
    {
      "indent": 3,
      "text": "- C.S. (Channel Spacing): used to indicate the channel spacing. [RFC6205] defines values to represent spacing of 100, 50, 25, and 12.5 GHz.",
      "ja": " -  C。S.（チャネル間隔）：チャネル間隔を示すために使用されます。 [RFC6205]は100の間隔は、50、25、12.5ギガヘルツを表すための値を定義します。"
    },
    {
      "indent": 3,
      "text": "- Identifier: a local-scoped integer used to distinguish different lasers (in one node) when they can transmit the same frequency lambda.",
      "ja": " - 識別子：それらは同じ周波数ラムダを送信することができる場合（一つのノードに）異なるレーザを区別するために使用されるローカルスコープの整数。"
    },
    {
      "indent": 3,
      "text": "- n: a two's-complement integer to take a positive, negative, or zero value. This value is used to compute the frequency as defined in [RFC6205] and based on [G.694.1]. The use of n is repeated here for ease of reading the rest of this document: in case of discrepancy, the definition in [RFC6205] is normative.",
      "ja": " -  nは2の補数の整数は正、負、またはゼロの値を取ります。 [RFC6205]で定義されており、[G.694.1]に基づいて、この値は、周波数を計算するために使用されます。 n個の使用は、この文書の残りの部分を読みやすくするためにここで繰り返されます。不一致の場合には、[RFC6205]で定義は規範的です。"
    },
    {
      "indent": 9,
      "text": "Frequency (THz) = 193.1 THz + n * frequency granularity (THz)",
      "ja": "周波数（テラヘルツ）= 193.1テラヘルツ+ N *周波数粒度（テラヘルツ）"
    },
    {
      "indent": 6,
      "text": "where the nominal central frequency granularity for the flexible grid is 0.00625 THz",
      "ja": "フレキシブルグリッドの公称中心周波数粒度は0.00625テラヘルツあります"
    },
    {
      "indent": 0,
      "text": "4. Flexi-Grid Label Format and Values",
      "section_title": true,
      "ja": "4.フレキシグリッドラベルフォーマットと値"
    },
    {
      "indent": 0,
      "text": "4.1 Flexi-Grid Label Encoding",
      "section_title": true,
      "ja": "4.1フレキシグリッドラベルのエンコーディング"
    },
    {
      "indent": 3,
      "text": "This document defines a generalized label encoding for use in flexi-grid systems. As with the other GMPLS lambda label formats defined in [RFC3471] and [RFC6205], the use of this label format is known a priori. That is, since the interpretation of all lambda labels is determined hop by hop, the use of this label format requires that all nodes on the path expect to use this label format.",
      "ja": "この文書では、フレキシグリッドシステムで使用するための一般的なラベルのエンコーディングを定義します。 [RFC3471]及び[RFC6205]で定義された他のGMPLSラムダラベルフォーマットと同様に、このラベルフォーマットの使用は、事前に知られています。すべてのラムダラベルの解釈はホップでホップを決定しているので、つまり、このラベルフォーマットの使用は、パス上のすべてのノードが、このラベルフォーマットを使用することを期待していることが必要です。"
    },
    {
      "indent": 3,
      "text": "For convenience, however, the label format is modeled on the fixed-grid label defined in [RFC6205] and briefly described in Section 3.",
      "ja": "便宜のために、しかし、ラベルフォーマットは、[RFC6205]で定義されており、簡潔項3に記載の固定グリッドラベルにモデル化されます。"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows the format of the Flexi-Grid Label. It is a 64-bit label.",
      "ja": "図1は、フレキシグリッドラベルのフォーマットを示します。これは、64ビットのラベルです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid | C.S.  |    Identifier   |              n                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              m                |          Reserved             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Figure 1 : The Flexi-Grid Label Encoding",
      "ja": "図1：フレキシグリッドラベルのエンコーディング"
    },
    {
      "indent": 3,
      "text": "This document defines a new Grid value to supplement those in [RFC6205]:",
      "ja": "この文書では、[RFC6205]のものを補完する新しいグリッド値を定義します。"
    },
    {
      "indent": 3,
      "text": "+----------+---------+\n|   Grid   |  Value  |\n+----------+---------+\n|ITU-T Flex|    3    |\n+----------+---------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Within the fixed-grid network, the C.S. value is used to represent the channel spacing, as the spacing between adjacent channels is constant. For the flexible-grid situation, this field is used to represent the nominal central frequency granularity.",
      "ja": "固定グリッドネットワーク内で、C。S.値は、隣接チャネル間の間隔が一定であるように、チャネル間隔を表すために使用されます。フレキシブルグリッド状況の場合、このフィールドは、公称中心周波数細分を表すために使用されます。"
    },
    {
      "indent": 3,
      "text": "This document defines a new C.S. value to supplement those in [RFC6205]:",
      "ja": "この文書では、[RFC6205]のものを補完するための新しいC。S.値を定義します。"
    },
    {
      "indent": 3,
      "text": "+------------+---------+\n| C.S. (GHz) |  Value  |\n+------------+---------+\n|     6.25   |    5    |\n+------------+---------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The meaning of the Identifier field is maintained from [RFC6205] (see also Section 3).",
      "ja": "識別子フィールドの意味は[RFC6205]（セクション3を参照）から、維持されます。"
    },
    {
      "indent": 3,
      "text": "The meaning of n is maintained from [RFC6205] (see also Section 3).",
      "ja": "Nの意味は[RFC6205]（セクション3を参照）から、維持されます。"
    },
    {
      "indent": 3,
      "text": "The m field is used to identify the slot width according to the formula given in [G.694.1] as follows. It is a 16-bit integer value encoded in line format.",
      "ja": "Mフィールドは以下のように[G.694.1]で与えられた式に従ってスロット幅を識別するために使用されます。これは、行の形式で符号化された16ビットの整数値です。"
    },
    {
      "indent": 9,
      "text": "Slot Width (GHz) = 12.5 GHz * m",
      "ja": "スロット幅（ギガヘルツ）= 12.5 GHzの*メートル"
    },
    {
      "indent": 3,
      "text": "The Reserved field MUST be set to zero on transmission and SHOULD be ignored on receipt.",
      "ja": "Reservedフィールドは、送信にゼロに設定しなければならなくて、領収書の上で無視されるべきです。"
    },
    {
      "indent": 3,
      "text": "An implementation that wishes to use the flexi-grid label encoding MUST follow the procedures of [RFC3473] and of [RFC3471] as updated by [RFC6205]. It MUST set Grid to 3 and C.S. to 5. It MUST set Identifier to indicate the local identifier of the laser in use as described in [RFC6205]. It MUST also set n according to the formula in Section 3 (inherited unchanged from [RFC6205]). Finally, the implementation MUST set m as described in the formula stated above.",
      "ja": "[RFC6205]で更新されるようフレキシグリッドラベルエンコーディングを使用することを望む実装は、[RFC3473]及び[RFC3471]の手順に従わなければなりません。それは、[RFC6205]に記載されているように、使用中のレーザのローカル識別子を示すために、識別子を設定しなければなりません5にグリッド3及びC。S.を設定しなければなりません。また、集合Nセクション3（[RFC6205]から変わらず継承）における式に従ってしなければなりません。上述した式に記載したように、最終的に、実装は、Mを設定しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2. Considerations of Bandwidth",
      "section_title": true,
      "ja": "4.2。帯域幅の考慮事項"
    },
    {
      "indent": 3,
      "text": "There is some overlap between the concepts of bandwidth and label in many GMPLS-based systems where a label indicates a physical switching resource. This overlap is increased in a flexi-grid system where a label value indicates the slot width and so affects the bandwidth supported by an LSP. Thus, the m parameter is both a property of the label (i.e., it helps define exactly what is switched) and of the bandwidth.",
      "ja": "ラベルは、物理的なスイッチングリソースを示す多くのGMPLSベースのシステムでは、帯域幅とラベルの概念の間にいくつかの重複があります。この重複は、ラベル値がスロット幅を示すので、LSPによってサポートされる帯域幅に影響を与えるフレキシグリッドシステムで増加します。したがって、m個のパラメータは、ラベルの性質（すなわち、それが切り替えられる正確に定義するのに役立ちます）と帯域幅の両方です。"
    },
    {
      "indent": 3,
      "text": "In GMPLS signaling [RFC3473], bandwidth is requested in the SENDER_TSPEC object and confirmed in the FLOWSPEC object. The m parameter, which is a parameter of the GMPLS flexi-grid label as described above, is also a parameter of the flexi-grid Tspec and Flowspec as described in [FLEXRSVP].",
      "ja": "GMPLSは、[RFC3473]のシグナリングでは、帯域幅は、SENDER_TSPECオブジェクトで要求及びFLOWSPECオブジェクトで確認されています。 【FLEXRSVP]に記載されているように、上述したようGMPLSフレキシグリッドラベルのパラメータであるm個のパラメータは、また、フレキシグリッドのTspec及びFLOWSPECのパラメータです。"
    },
    {
      "indent": 0,
      "text": "4.3. Composite Labels",
      "section_title": true,
      "ja": "4.3。コンポジットラベル"
    },
    {
      "indent": 3,
      "text": "The creation of a composite of multiple channels to support inverse multiplexing is already supported in GMPLS for TDM and OTN (see [RFC4606], [RFC6344], and [RFC7139]). The mechanism used for flexi-grid is similar.",
      "ja": "逆多重化をサポートするために複数のチャネルの複合体の生成は既にTDM及びOTN（参照[RFC4606]、[RFC6344]及び[RFC7139]）のためのGMPLSに支持されています。フレキシグリッドのために使用されるメカニズムは類似しています。"
    },
    {
      "indent": 3,
      "text": "To signal an LSP that uses multiple flexi-grid slots, a \"compound label\" is constructed. That is, the LABEL object is constructed from a concatenation of the 64-bit Flexi-Grid Labels shown in Figure 1. The number of elements in the label can be determined from the length of the LABEL object. The resulting LABEL object is shown in Figure 2 including the object header that is not normally shown in diagrammatic representations of RSVP-TE objects. Note that r is the count of component labels, and this is backward compatible with the label shown in Figure 1 where the value of r is 1.",
      "ja": "複数フレキシグリッドのスロットを使用するLSPを知らせるために、「化合物のラベルが」構成されています。すなわち、ラベルオブジェクトは、ラベル内の要素の数は、ラベルオブジェクトの長さから決定することができる図1に示​​される64ビットフレキシグリッドラベルの連結から構成されています。得られたラベルオブジェクトは、通常、RSVP-TEオブジェクトの図式表現で示されていないオブジェクトヘッダを含む、図2に示されています。 Rがコンポーネントラベルの数であり、これは、Rの値が1である、図1に示すラベルとの下位互換性があります。"
    },
    {
      "indent": 3,
      "text": "The component labels MUST be presented in increasing order of the value n. Implementations MUST NOT infer anything about the encoding of a signal into the set of slots represented by a compound label from the label itself. Information about the encoding MAY be handled in other fields in signaling messages or through an out-of-band system, but such considerations are outside the scope of this document.",
      "ja": "成分ラベルは、値nの昇順に提示されなければなりません。実装は、ラベル自体からの化合物のラベルで表されるスロットのセットに信号の符号化については何を推測してはいけません。符号化に関する情報は、シグナリングメッセージまたはアウトオブバンドシステムを介して他の分野で扱うことができるが、そのような考慮事項は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Object Length (4 + 8r)      | Class-Num (16)|  C-Type (2)   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid | C.S.  |    Identifier   |              n                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              m                |          Reserved             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n~                                                               ~\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Grid | C.S.  |    Identifier   |              n                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              m                |          Reserved             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Figure 2 : A Compound Label for Virtual Concatenation",
      "ja": "図2：バーチャルコンカチネーションのための化合物のラベル"
    },
    {
      "indent": 3,
      "text": "Note that specific rules must be applied as follows:",
      "ja": "次のように特定のルールが適用されなければならないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "- Grid MUST show \"ITU-T Flex\" value 3 in each component label. - C.S. MUST have the same value in each component label. - Identifier in each component label may identify different physical equipment. - Values of n and m in each component label define the slots that are concatenated.",
      "ja": " - グリッドは、各コンポーネントのラベルに「ITU-Tフレックス」値3を示さなければなりません。 -  C。S.、各コンポーネントのラベルに同じ値を持たなければなりません。 - 各コンポーネントのラベル内の識別子は、異なる物理的装置を識別することができます。 - 各コンポーネントラベルにおけるn及びmの値は、連結されたスロットを画定します。"
    },
    {
      "indent": 3,
      "text": "At the time of writing, [G.694.1] only supports only groupings of adjacent slots (i.e., without intervening unused slots that could be used for other purposes) of identical width (same value of m), and the component slots must be in increasing order of frequency (i.e., increasing order of the value n). The mechanism defined here MUST NOT be used for other forms of grouping unless and until those forms are defined and documented in Recommendations published by the ITU-T.",
      "ja": "書き込み時に、[G.694.1]は唯一同じ幅（Mの同じ値）の（他の目的のために使用することができる未使用のスロットを介在することなく、すなわち、）隣接するスロットのグループのみをサポートし、コンポーネントスロットになければなりません周波数の昇順（すなわち、値nの昇順）。これらのフォームは、ITU-Tによって公開勧告で定義され、文書化されていないとまではここで定義されたメカニズムは、グループの他の形態のために使用してはいけません。"
    },
    {
      "indent": 3,
      "text": "Note further that while the mechanism described here naturally means that all component channels are corouted, a composite channel can also be achieved by constructing individual LSPs from single flexi-grid slots and managing those LSPs as a group. A mechanism for achieving this for TDM is described in [RFC6344], but is out of scope for discussion in this document because the labels used are normal, single-slot labels and require no additional definitions.",
      "ja": "当然ここで説明されたメカニズムは、全ての成分のチャネルがcoroutedされることを意味する、複合チャネルはまた、単一のフレキシグリッドスロットから個々のLSPを構築し、グループとして、それらのLSPを管理することによって達成することができることをさらに留意されたいです。 TDMのためにこれを達成するためのメカニズムは、[RFC6344]に記載されたが、使用される標識は、通常、シングルスロットのラベルであり、追加の定義を必要としないため、この文書で議論の範囲外です。"
    },
    {
      "indent": 0,
      "text": "5. Manageability and Backward Compatibility Considerations",
      "section_title": true,
      "ja": "5.管理性と下位互換性に関する注意事項"
    },
    {
      "indent": 3,
      "text": "This section briefly considers issues of manageability and backward compatibility.",
      "ja": "このセクションでは、簡単に管理性との下位互換性の問題を検討します。"
    },
    {
      "indent": 0,
      "text": "5.1. Control-Plane Backward Compatibility",
      "section_title": true,
      "ja": "5.1。コントロールプレーンの下位互換性"
    },
    {
      "indent": 3,
      "text": "Labels are carried in two ways in GMPLS: for immediate use on the next hop and for use at remote hops.",
      "ja": "ラベルはGMPLSに二つの方法で実施されていますネクストホップにし、リモートのホップでの使用のためにすぐに使用できます。"
    },
    {
      "indent": 3,
      "text": "It is an assumption of GMPLS that both ends of a link know what label types are supported and only use appropriate label types. If a label of an unknown type is received, it will be processed as if it was of a known type since the Label Object and similar label-carrying objects do not contain a type identifier. Thus, the introduction of a flexi-grid label in this document does not change the compatibility issues, and a legacy node that does not support the new flexi-grid label should not expect to receive or handle such labels. If one is incorrectly used in communication with a legacy node, it will attempt to process it as an expected label type with a potentially poor outcome.",
      "ja": "これは、リンクの両端がサポートされているラベルの種類を知っているだけで、適切なラベルタイプを使用するGMPLSの仮定です。未知のタイプのラベルを受信した場合ラベルオブジェクトと同様のラベルを運ぶのオブジェクトは型識別子を含んでいないので、それは既知のタイプであったかのように、それが処理されます。したがって、このドキュメントのフレキシグリッドラベルの導入は、互換性の問題を変更しないと、新しいフレキシグリッドのラベルをサポートしていないレガシーノードは、受信したり、そのようなラベルを処理するために期待するべきではありません。 1が誤っレガシーノードとの通信に使用されている場合、それは潜在的に予後不良と予測されるラベルタイプとしてそれを処理しようとします。"
    },
    {
      "indent": 3,
      "text": "It is possible that a GMPLS message transitting a legacy node will contain a flexi-grid label destined for or reported by a remote node. For example, an LSP that transits links of different technologies might record flexi-grid labels in a Record Route Object that is subsequently passed to a legacy node. Such labels will not have any impact on legacy implementations except as noted in the manageability considerations in the next section.",
      "ja": "従来のノードをtransitting GMPLSメッセージが宛てまたはリモートノードによって報告されたフレキシグリッドのラベルが含まれている可能性があります。例えば、異なる技術のリンクを通過するLSPは、その後、従来のノードに渡されたレコードのルートオブジェクトにフレキシグリッドのラベルを記録することがあります。このような標識は、次のセクションでは、管理上の考慮事項に記載されている場合を除き、従来の実装への影響はありません。"
    },
    {
      "indent": 0,
      "text": "5.2. Manageability Considerations",
      "section_title": true,
      "ja": "5.2。管理性の考慮事項"
    },
    {
      "indent": 3,
      "text": "This document introduces no new elements for management. That is, labels can continue to be used in the same way by the GMPLS protocols and where those labels were treated as opaque quantities with local or global significance, no change is needed to the management systems.",
      "ja": "この文書では、管理のための新しい要素を導入していません。すなわち、ラベルはGMPLSプロトコルによって、これらのラベルは、ローカルまたはグローバルな意義を持つ、不透明の量として処理した場合、変化が管理システムに必要とされないのと同じ方法で使用し続けることができるされています。"
    },
    {
      "indent": 3,
      "text": "However, this document introduces some changes to the nature of a label that may require changes to management systems. Although Section 3.2 of [RFC3471] makes clear that a label is of variable length according to the type and that the type is supposed to be known a priori by both ends of a link, a management system is not guaranteed to be updated in step with upgrades or installations of new flexi-grid functionality in the network.",
      "ja": "しかし、この文書は、管理システムへの変更が必要になることがあり、標識の性質にいくつかの変更を導入します。 [RFC3471]のセクション3.2は、ラベルタイプに従って可変長であり、タイプは、リンクの両端によって先験的に知られるようになっている、管理システムを有するステップで更新されることが保証されていないことが明らかにいることになりますがネットワークの新しいフレキシグリッド機能のアップグレードやインストール。"
    },
    {
      "indent": 3,
      "text": "But, an implementation expecting a 32-bit lambda label would not fail ungracefully because the first 32 bits follow the format of [RFC6205]. It would look at theses labels and read but not recognize the new grid type value. It would then give up trying to parse the label and (presumably) the whole of the rest of the message.",
      "ja": "最初の32ビットは[RFC6205]の形式に従うので、しかし、32ビットラムダラベルを期待実装が不正に失敗しないであろう。これは、論文のラベルを見て、読んでますが、新しいグリッド・タイプの値を認識しません。これは、ラベルやメッセージの残りの（おそらく）全体を解析しようとあきらめます。"
    },
    {
      "indent": 3,
      "text": "The management system can be upgraded in two steps:",
      "ja": "管理システムは、2つのステップでアップグレードすることができます。"
    },
    {
      "indent": 3,
      "text": "- Firstly, systems that handle lambda labels as 32-bit quantities need to be updated to handle the increased length (64 bits) of labels as described in this document. These \"unknown\" 64-bit labels could be displayed as opaque 64-bit quantities and still add a lot of value for the operator (who might need to parse the label by hand). However, an implementation that already supports lambda labels as defined in [RFC6205] can safely continue to process the first 32 bits and display the fields defined in RFC 6205 as before, leaving just the second 32 bits as opaque data.",
      "ja": " - まず、32ビットの量としてラムダラベルを処理するシステムは、この文書に記載されているように、ラベルの増大した長さ（64ビット）を処理するために更新する必要があります。これらの「不明」は64ビットのラベルが不透明な64ビット量として表示され、今でも（手でラベルを解析する必要がある場合があります）オペレータの値の多くを追加することができます。しかしながら、[RFC6205]で定義されるように既にラムダラベルをサポートする実装は、安全に不透明なデータとしてだけ第32ビットを残し、最初の32ビットを処理し、前と同様にRFC 6205で定義されたフィールドを表示し続けることができます。"
    },
    {
      "indent": 3,
      "text": "- Second, a more sophisticated upgrade to a management system would fully parse the flexi-grid labels and display them field by field as described in this document.",
      "ja": " - 第二に、管理システムへのより洗練されたアップグレードは完全にフレキシグリッドのラベルを解析し、この文書で説明したように、フィールドで彼らにフィールドを表示していました。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "[RFC6205] notes that the definition of a new label encoding does not introduce any new security considerations to [RFC3471] or [RFC3473]. That statement applies equally to this document.",
      "ja": "[RFC6205]は新しいラベルエンコーディングの定義は[RFC3471]か[RFC3473]に任意の新しいセキュリティの考慮事項を導入しないことを指摘しています。その文は、この文書にも同様に適用されます。"
    },
    {
      "indent": 3,
      "text": "For a general discussion on MPLS and GMPLS-related security issues, see the MPLS/GMPLS security framework [RFC5920].",
      "ja": "MPLSとGMPLS関連のセキュリティ問題に関する一般的な議論については、MPLS / GMPLSセキュリティフレームワーク[RFC5920]を参照してください。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA maintains the \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Parameters\" registry that contains several subregistries.",
      "ja": "IANAは、いくつかのsubregistriesが含まれている「一般化マルチプロトコルラベルスイッチング（GMPLS）シグナリングパラメータ」のレジストリを維持します。"
    },
    {
      "indent": 0,
      "text": "7.1. Grid Subregistry",
      "section_title": true,
      "ja": "7.1。グリッド副登録"
    },
    {
      "indent": 3,
      "text": "IANA has allocated a new entry in this subregistry as follows:",
      "ja": "次のようにIANAは、この副登録に新しいエントリを割り当てています。"
    },
    {
      "indent": 3,
      "text": "Value   Grid                         Reference\n-----   -------------------------    ----------\n  3     ITU-T Flex                   RFC 7699",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7.2. DWDM Channel Spacing Subregistry",
      "section_title": true,
      "ja": "7.2。 DWDMチャネル間隔副登録"
    },
    {
      "indent": 3,
      "text": "IANA has allocated a new entry in this subregistry as follows:",
      "ja": "次のようにIANAは、この副登録に新しいエントリを割り当てています。"
    },
    {
      "indent": 3,
      "text": "Value   Channel Spacing (GHz)        Reference\n-----   -------------------------    ----------\n  5     6.25                         RFC 7699",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3471] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Functional Description\", RFC 3471, DOI 10.17487/RFC3471, January 2003, <http://www.rfc-editor.org/info/rfc3471>.",
      "ja": "[RFC3471]バーガー、L.、エド。、 \"一般化されたマルチプロトコルラベルスイッチング（GMPLS）機能説明シグナリング\"、RFC 3471、DOI 10.17487は/ RFC3471、2003年1月、<http://www.rfc-editor.org/情報/ RFC3471>。"
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, DOI 10.17487/RFC3473, January 2003, <http://www.rfc-editor.org/info/rfc3473>.",
      "ja": "[RFC3473]バーガーは、L.、エドは、 \"一般化されたマルチプロトコルラベルスイッチング（GMPLS）シグナリング資源予約プロトコル - トラフィックエンジニアリング（RSVP-TE）拡張機能\"、RFC 3473、DOI 10.17487 / RFC3473、2003年1月、<のhttp： //www.rfc-editor.org/info/rfc3473>。"
    },
    {
      "indent": 3,
      "text": "[RFC6205] Otani, T., Ed., and D. Li, Ed., \"Generalized Labels for Lambda-Switch-Capable (LSC) Label Switching Routers\", RFC 6205, DOI 10.17487/RFC6205, March 2011, <http://www.rfc-editor.org/info/rfc6205>.",
      "ja": "[RFC6205]大谷、T.、エド、およびD.リー、エド、 \"ラムダ・スイッチ対応のための一般化ラベル（LSC）ラベルスイッチングルータ\"、RFC 6205、DOI 10.17487 / RFC6205、2011年3月、<HTTP。。： //www.rfc-editor.org/info/rfc6205>。"
    },
    {
      "indent": 3,
      "text": "[G.694.1] International Telecommunication Union, \"Spectral grids for WDM applications: DWDM frequency grid\", ITU-T Recommendation G.694.1, February 2012, <https://www.itu.int/rec/T-REC-G.694.1/en>.",
      "ja": "[G.694.1]国際電気通信連合、 \"WDM用途のスペクトルグリッド：DWDM周波数グリッド\"、ITU-T勧告G.694.1、2012年2月、<https://www.itu.int/rec/T-REC-G .694.1 / EN>。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3945] Mannie, E., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Architecture\", RFC 3945, DOI 10.17487/RFC3945, October 2004, <http://www.rfc-editor.org/info/rfc3945>.",
      "ja": "[RFC3945]マニー、E.、エド。、 \"一般化されたマルチプロトコルラベルスイッチング（GMPLS）アーキテクチャ\"、RFC 3945、DOI 10.17487 / RFC3945、2004年10月、<http://www.rfc-editor.org/info/ RFC3945>。"
    },
    {
      "indent": 3,
      "text": "[RFC4606] Mannie, E. and D. Papadimitriou, \"Generalized Multi-Protocol Label Switching (GMPLS) Extensions for Synchronous Optical Network (SONET) and Synchronous Digital Hierarchy (SDH) Control\", RFC 4606, DOI 10.17487/RFC4606, August 2006, <http://www.rfc-editor.org/info/rfc4606>.",
      "ja": "[RFC4606]マニー、E.およびD. Papadimitriou、 \"一般化されたマルチプロトコルラベルスイッチング（GMPLS）同期光ネットワーク（SONET）および同期デジタル階層（SDH）コントロールのための拡張機能\"、RFC 4606、DOI 10.17487 / RFC4606、2006年8月、<http://www.rfc-editor.org/info/rfc4606>。"
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., Ed., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, DOI 10.17487/RFC5920, July 2010, <http://www.rfc-editor.org/info/rfc5920>.",
      "ja": "[RFC5920]牙、L.、エド。、 \"MPLSおよびGMPLSネットワークのセキュリティフレームワーク\"、RFC 5920、DOI 10.17487 / RFC5920、2010年7月、<http://www.rfc-editor.org/info/rfc5920>。"
    },
    {
      "indent": 3,
      "text": "[RFC6344] Bernstein, G., Ed., Caviglia, D., Rabbat, R., and H. van Helvoort, \"Operating Virtual Concatenation (VCAT) and the Link Capacity Adjustment Scheme (LCAS) with Generalized Multi-Protocol Label Switching (GMPLS)\", RFC 6344, DOI 10.17487/RFC6344, August 2011, <http://www.rfc-editor.org/info/rfc6344>.",
      "ja": "[RFC6344]バーンスタイン、G.、エド。、Caviglia、D.、Rabbat、R.、およびH.バンHelvoort、「一般化マルチプロトコルラベルスイッチングとバーチャルコンカチネーション（VCAT）とリンク容量調整スキーム（LCAS）を操作します（GMPLS）」、RFC 6344、DOI 10.17487 / RFC6344、2011年8月、<http://www.rfc-editor.org/info/rfc6344>。"
    },
    {
      "indent": 3,
      "text": "[RFC7139] Zhang, F., Ed., Zhang, G., Belotti, S., Ceccarelli, D., and K. Pithewan, \"GMPLS Signaling Extensions for Control of Evolving G.709 Optical Transport Networks\", RFC 7139, DOI 10.17487/RFC7139, March 2014, <http://www.rfc-editor.org/info/rfc7139>.",
      "ja": "[RFC7139]チャン、F.、エド。、張、G.、Belotti、S.、Ceccarelli、D.、およびK. Pithewan、 \"進化するG.709光トランスポートネットワークの制御のためのGMPLSシグナリング拡張\"、RFC 7139、 DOI 10.17487 / RFC7139、2014年3月、<http://www.rfc-editor.org/info/rfc7139>。"
    },
    {
      "indent": 3,
      "text": "[RFC7698] Gonzalez de Dios, O., Ed., Casellas, R., Ed., Zhang, F., Fu., X., Ceccarelli, D., and I. Hussain, \"Framework and Requirements for GMPLS-Based Control of Flexi-Grid Dense Wavelength Division Multiplexing (DWDM) Networks\", RFC 7698, DOI 10.17487/RFC7698, November 2015, <http://www.rfc-editor.org/info/rfc7698>.",
      "ja": "[RFC7698]ゴンザレス・デ・ディオス、O.、エド。GMPLSベースのため、Casellas、R.、編、張、F.、フー。、X.、Ceccarelli、D.、およびI.フセイン、「フレームワークおよび要件フレキシグリッド高密度波長分割多重（DWDM）ネットワーク」、RFC 7698、DOI 10.17487 / RFC7698、2015年11月、の制御<http://www.rfc-editor.org/info/rfc7698>。"
    },
    {
      "indent": 3,
      "text": "[G.671] International Telecommunication Union, \"Transmission characteristics of optical components and subsystems\", ITU-T Recommendation G.671, February 2012, <https://www.itu.int/rec/T-REC-G.671/en>.",
      "ja": "[G.671]国際電気通信連合、 \"光学部品やサブシステムの伝送特性\"、ITU-T勧告G.671、2012年2月、<https://www.itu.int/rec/T-REC-G.671 / EN>。"
    },
    {
      "indent": 3,
      "text": "[G.694.2] International Telecommunication Union, \"Spectral grids for WDM applications: CWDM wavelength grid\", ITU-T Recommendation G.694.2, December 2003, <https://www.itu.int/rec/T-REC-G.694.2/en>.",
      "ja": "[G.694.2]国際電気通信連合、 \"WDM用途のスペクトルグリッド：CWDM波長グリッド\"、ITU-T勧告G.694.2、2003年12月、<https://www.itu.int/rec/T-REC-G .694.2 / EN>。"
    },
    {
      "indent": 3,
      "text": "[FLEXRSVP] Zhang, F., Zhang, X., Farrel, A., Gonzalez de Dios, O., and D. Ceccarelli, \"RSVP-TE Signaling Extensions in support of Flexible Grid\", Work in Progress, draft-ietf-ccamp-flexible-grid-rsvp-te-ext-03, August 2015.",
      "ja": "【FLEXRSVP]張、F.、張、X.、ファレル、A.、ゴンザレス・デ・ディオス、O.、およびD. Ceccarelli、 \"RSVP-TEフレキシブルグリッドの支持シグナリング拡張\"、進行中で働いて、ドラフトIETF 2015年8月、フレキシブル・グリッド・RSVP-TE-EXT-03を-ccamp。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Flexi-Grid Example",
      "ja": "付録A.フレキシグリッドの例"
    },
    {
      "indent": 3,
      "text": "Consider a fragment of an optical LSP between node A and node B using the flexible grid. Suppose that the LSP on this hop is formed:",
      "ja": "柔軟なグリッドを使用して、ノードAとノードBとの間の光LSPの断片を考えます。このホップのLSPが形成されているとします。"
    },
    {
      "indent": 3,
      "text": "- using the ITU-T Flexi-Grid - the nominal central frequency of the slot is 193.05 THz - the nominal central frequency granularity is 6.25 GHz - the slot width is 50 GHz.",
      "ja": " -  ITU-Tフレキシグリッドを用い - スロットの公称中心周波数は193.05テラヘルツある - 公称中心周波数粒度は6.25ギガヘルツである - スロット幅は50GHzです。"
    },
    {
      "indent": 3,
      "text": "In this case, the label representing the switchable quantity that is the flexi-grid quantity is encoded as described in Section 4.1 with the following parameter settings. The label can be used in signaling or in management protocols to describe the LSP.",
      "ja": "この場合、以下のパラメータ設定で、セクション4.1で説明したようにフレキシグリッド量がエンコードされている切り替え可能量を表すラベル。ラベルは、LSPを記述するためにシグナリングまたは管理プロトコルに使用することができます。"
    },
    {
      "indent": 6,
      "text": "Grid = 3 : ITU-T Flexi-Grid",
      "ja": "グリッド= 3：ITU-Tフレキシグリッド"
    },
    {
      "indent": 6,
      "text": "C.S. = 5 : 6.25 GHz nominal central frequency granularity",
      "ja": "C。S. = 5：6.25 GHzの公称中心周波数の粒度"
    },
    {
      "indent": 6,
      "text": "Identifier = local value indicating the laser in use",
      "ja": "使用中のレーザを示す識別子=ローカル値"
    },
    {
      "indent": 6,
      "text": "n = -8 :",
      "ja": "ん ＝ ー８ ："
    },
    {
      "indent": 10,
      "text": "Frequency (THz) = 193.1 THz + n * frequency granularity (THz)",
      "ja": "周波数（テラヘルツ）= 193.1テラヘルツ+ N *周波数粒度（テラヘルツ）"
    },
    {
      "indent": 10,
      "text": "193.05 (THz) = 193.1 (THz) + n * 0.00625 (THz)",
      "section_title": true,
      "ja": "193.05（テラヘルツ）= 193.1（テラヘルツ）+ N * 0.00625（テラヘルツ）"
    },
    {
      "indent": 10,
      "text": "n = (193.05 - 193.1) / 0.00625 = -8",
      "ja": "ん ＝ （１９３。０５ ー １９３。１） ／ ０。００６２５ ＝ ー８"
    },
    {
      "indent": 6,
      "text": "m = 4 :",
      "ja": "M = 4："
    },
    {
      "indent": 10,
      "text": "Slot Width (GHz) = 12.5 GHz * m",
      "ja": "スロット幅（ギガヘルツ）= 12.5 GHzの*メートル"
    },
    {
      "indent": 10,
      "text": "50 (GHz) = 12.5 (GHz) * m",
      "ja": "50（ギガヘルツ）= 12.5（ギガヘルツ）* M"
    },
    {
      "indent": 10,
      "text": "m = 50 / 12.5 = 4",
      "ja": "M = 50 / 12.5 = 4"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "This work was supported in part by the FP-7 IDEALIST project under grant agreement number 317999.",
      "ja": "この作品は、付与契約番号317999の下FP-7観念論プロジェクトによって部分的にサポートされていました。"
    },
    {
      "indent": 3,
      "text": "Very many thanks to Lou Berger for discussions of labels of more than 32 bits. Many thanks to Sergio Belotti and Pietro Vittorio Grandi for their support of this work. Thanks to Gabriele Galimberti for discussion of the size of the \"m\" field, and to Iftekhar Hussain for discussion of composite labels. Robert Sparks, Carlos Pignataro, and Paul Wouters provided review comments during IETF Last Call.",
      "ja": "32ビット以上のラベルの議論のためのルー・バーガーに非常に多くの感謝。この作品の彼らのサポートのためセルジオBelottiとピエトロ・ヴィットリオ・グランディに感謝します。複合ラベルの議論のための「M」フィールドの大きさについての議論のためのガブリエル・ガリンベルティのおかげで、とイフテックハーフセインへ。ロバート・スパークス、カルロスPignataro、そしてポール・WOUTERSはIETFラストコール時のレビューコメントを提供しました。"
    },
    {
      "indent": 3,
      "text": "The Vancouver 2012 Pool Party drove early discussions and rough consensus. It comprised: Dieter Beller, Ramon Casellas, Daniele Ceccarelli, Oscar Gonzalez de Dios, Iftekhar Hussain, Cyril Margaria, Lyndon Ong, Fatai Zhang, and Adrian Farrel.",
      "ja": "バンクーバー2012プールパーティーでは、早期の議論やラフコンセンサスを運転しました。これは、構成：ディーターBeller、ラモンCasellas、ダニエルCeccarelli、オスカー・ゴンザレス・デ・ディオス、イフテックハーフセイン、シリルMargaria、リンドンオング、Fatai張、およびエードリアンファレルを。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "Zhang Fei Huawei Technologies Email: zhangfei7@huawei.com",
      "ja": "テクノロジーの電子メールなど張鉄IH UA：.COM @張華為7"
    },
    {
      "indent": 3,
      "text": "Ramon Casellas CTTC Email: ramon.casellas@cttc.es",
      "ja": "ラモンCasellas CTTC電子メール：ramon.casellas@cttc.es"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Adrian Farrel Old Dog Consulting Email: adrian@olddog.co.uk",
      "ja": "エードリアンファレル老犬のコンサルティング電子メール：adrian@olddog.co.uk"
    },
    {
      "indent": 3,
      "text": "Daniel King Old Dog Consulting Email: daniel@olddog.co.uk",
      "ja": "ダニエル・キング老犬のコンサルティング電子メール：daniel@olddog.co.uk"
    },
    {
      "indent": 3,
      "text": "Yao Li Nanjing University Email: wsliguotou@hotmail.com",
      "ja": "静かな大学の電子メールでのY AOL：ウェズリー行き過ぎ@ Hotmail.com"
    },
    {
      "indent": 3,
      "text": "Fatai Zhang Huawei Technologies Email: zhangfatai@huawei.com",
      "ja": "張HU AはあまりにもFA技術のメールです：@ Huawei社.COMあまりにもトリック"
    }
  ]
}