{
  "title": {
    "text": "RFC 7710 - Captive-Portal Identification Using DHCP or Router Advertisements (RAs)",
    "ja": "RFC 7710 - DHCPまたはルーターアドバタイズメント（RA）を使用したキャプティブポータルの識別"
  },
  "number": 7710,
  "created_at": "2020-08-16 07:59:04.094405+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         W. Kumari\nRequest for Comments: 7710                                        Google\nCategory: Standards Track                                 O. Gudmundsson\nISSN: 2070-1721                                               CloudFlare\n                                                             P. Ebersman\n                                                                 Comcast\n                                                                S. Sheng\n                                                                   ICANN\n                                                           December 2015",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Captive-Portal Identification Using DHCP or Router Advertisements (RAs)",
      "ja": "DHCPまたはルーターアドバタイズメント（RA）を使用したキャプティブポータルの識別"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "In many environments offering short-term or temporary Internet access (such as coffee shops), it is common to start new connections in a captive-portal mode. This highly restricts what the customer can do until the customer has authenticated.",
      "ja": "短期または一時的なインターネットアクセスを提供する多くの環境（コーヒーショップなど）では、新しい接続をキャプティブポータルモードで開始するのが一般的です。これは、顧客が認証されるまで顧客が実行できることを非常に制限します。"
    },
    {
      "indent": 3,
      "text": "This document describes a DHCP option (and a Router Advertisement (RA) extension) to inform clients that they are behind some sort of captive-portal device and that they will need to authenticate to get Internet access. It is not a full solution to address all of the issues that clients may have with captive portals; it is designed to be used in larger solutions. The method of authenticating to and interacting with the captive portal is out of scope for this document.",
      "ja": "このドキュメントでは、DHCPオプション（およびルーターアドバタイズ（RA）拡張）について説明し、クライアントが何らかのキャプティブポータルデバイスの背後にあり、インターネットアクセスを取得するには認証が必要であることをクライアントに通知します。クライアントがキャプティブポータルで抱える可能性のあるすべての問題に対処することは、完全なソリューションではありません。より大きなソリューションで使用するように設計されています。キャプティブポータルへの認証および対話の方法は、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはInternet Standards Trackドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。インターネット標準の詳細については、RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7710.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7710で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2015 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n  1.1.  Requirements notation . . . . . . . . . . . . . . . . . .   3\n2.  The Captive-Portal Option . . . . . . . . . . . . . . . . . .   3\n  2.1.  IPv4 DHCP Option  . . . . . . . . . . . . . . . . . . . .   3\n  2.2.  IPv6 DHCP Option  . . . . . . . . . . . . . . . . . . . .   4\n  2.3.  The Captive-Portal IPv6 RA Option . . . . . . . . . . . .   4\n3.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   5\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .   5\n5.  Normative References  . . . . . . . . . . . . . . . . . . . .   6\n6.  Informative References  . . . . . . . . . . . . . . . . . . .   7\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   7\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   8",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "In many environments, users need to connect to a captive-portal device and agree to an Acceptable Use Policy (AUP) and/or provide billing information before they can access the Internet. It is anticipated that the IETF will work on a more fully featured protocol at some point, to ease interaction with captive portals. Regardless of how that protocol operates, it is expected that this document will provide needed functionality because the client will need to know when it is behind a captive portal and how to contact it.",
      "ja": "多くの環境では、ユーザーはキャプティブポータルデバイスに接続し、利用規定（AUP）に同意し、インターネットにアクセスする前に課金情報を提供する必要があります。 IETFは、キャプティブポータルとの対話を容易にするために、ある時点でより完全な機能を備えたプロトコルで動作することが予想されます。そのプロトコルがどのように動作するかに関係なく、クライアントはキャプティブポータルの背後にあるときとそれに連絡する方法をクライアントが知る必要があるため、このドキュメントは必要な機能を提供することが期待されます。"
    },
    {
      "indent": 3,
      "text": "In order to present users with the payment or AUP pages, the captive-portal device has to intercept the user's connections and redirect the user to the captive portal, using methods that are very similar to man-in-the-middle (MITM) attacks. As increasing focus is placed on security, and end nodes adopt a more secure stance, these interception techniques will become less effective and/or more intrusive.",
      "ja": "支払いページまたはAUPページをユーザーに提示するために、キャプティブポータルデバイスは、中間者（MITM）攻撃に非常に類似した方法を使用して、ユーザーの接続を傍受し、ユーザーをキャプティブポータルにリダイレクトする必要があります。 。セキュリティに重点が置かれ、エンドノードがより安全なスタンスを採用するにつれて、これらのインターセプトテクニックの効果は低下し、侵入性が高まります。"
    },
    {
      "indent": 3,
      "text": "This document describes a DHCP ([RFC2131]) option (Captive-Portal) and an IPv6 Router Advertisement (RA) ([RFC4861]) extension that inform clients that they are behind a captive-portal device and how to contact it.",
      "ja": "このドキュメントでは、DHCP（[RFC2131]）オプション（Captive-Portal）とIPv6ルーターアドバタイズ（RA）（[RFC4861]）拡張機能について説明します。これらの拡張機能は、クライアントにキャプティブポータルデバイスの背後にあることと、それに接続する方法を通知します。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Notation",
      "section_title": true,
      "ja": "1.1. 要件表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. The Captive-Portal Option",
      "section_title": true,
      "ja": "2. キャプティブポータルオプション"
    },
    {
      "indent": 3,
      "text": "The Captive-Portal DHCP/RA option informs the client that it is behind a captive portal and provides the URI to access an authentication page. This is primarily intended to improve the user experience by getting them to the captive portal faster; for the foreseeable future, captive portals will still need to implement the interception techniques to serve legacy clients, and clients will need to perform probing to detect captive portals.",
      "ja": "キャプティブポータルDHCP / RAオプションは、キャプティブポータルの背後にあることをクライアントに通知し、認証ページにアクセスするためのURIを提供します。これは主に、ユーザーをキャプティブポータルにすばやく移動することでユーザーエクスペリエンスを向上させることを目的としています。近い将来、キャプティブポータルはレガシークライアントにサービスを提供するためにインターセプトテクニックを実装する必要があり、クライアントはキャプティブポータルを検出するためにプローブを実行する必要があります。"
    },
    {
      "indent": 3,
      "text": "In order to support multiple \"classes\" of clients (e.g., IPv4 only, IPv6 only with DHCPv6 ([RFC3315]), IPv6 only with RA), the captive portal can provide the URI via multiple methods (IPv4 DHCP, IPv6 DHCP, IPv6 RA). The captive-portal operator should ensure that the URIs handed out are equivalent to reduce the chance of operational problems. The maximum length of the URI that can be carried in IPv4 DHCP is 255 bytes, so URIs longer than 255 bytes should not be used in IPv6 DHCP or IPv6 RA.",
      "ja": "クライアントの複数の「クラス」（たとえば、IPv4のみ、DHCPv6を備えたIPv6のみ（[RFC3315]）、RAを備えたIPv6）をサポートするために、キャプティブポータルは複数の方法（IPv4 DHCP、IPv6 DHCP、IPv6を介してURIを提供できます） RA）。キャプティブポータルオペレーターは、配布されるURIが同等であることを確認して、運用上の問題の可能性を減らす必要があります。 IPv4 DHCPで伝送できるURIの最大長は255バイトであるため、255バイトを超えるURIはIPv6 DHCPまたはIPv6 RAでは使用しないでください。"
    },
    {
      "indent": 3,
      "text": "In order to avoid having to perform DNS interception, the URI SHOULD contain an address literal. If the captive portal allows the client to perform DNS requests to resolve the name, it is then acceptable for the URI to contain a DNS name. The URI parameter is not null terminated.",
      "ja": "DNSインターセプトを実行する必要がないようにするために、URIにはアドレスリテラルを含める必要があります（SHOULD）。キャプティブポータルでクライアントがDNS要求を実行して名前を解決できる場合、URIにDNS名を含めることは許可されます。 URIパラメータはnullで終了していません。"
    },
    {
      "indent": 0,
      "text": "2.1. IPv4 DHCP Option",
      "section_title": true,
      "ja": "2.1. IPv4 DHCPオプション"
    },
    {
      "indent": 3,
      "text": "The format of the IPv4 Captive-Portal DHCP option is shown below.",
      "ja": "IPv4キャプティブポータルDHCPオプションのフォーマットを以下に示します。"
    },
    {
      "indent": 6,
      "text": " Code    Len          Data\n+------+------+------+------+------+--   --+-----+\n| Code | Len  |  URI                  ...        |\n+------+------+------+------+------+--   --+-----+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "o Code: The Captive-Portal DHCPv4 option (160) (one octet).",
      "ja": "o コード：キャプティブポータルDHCPv4オプション（160）（1オクテット）。"
    },
    {
      "indent": 3,
      "text": "o Len: The length, in octets of the URI.",
      "ja": "o Len：URIの長さ（オクテット単位）。"
    },
    {
      "indent": 3,
      "text": "o URI: The contact URI for the captive portal that the user should connect to (encoded following the rules in [RFC3986]).",
      "ja": "o URI：ユーザーが接続する必要があるキャプティブポータルの連絡先URI（[RFC3986]の規則に従ってエンコードされています）。"
    },
    {
      "indent": 0,
      "text": "2.2. IPv6 DHCP Option",
      "section_title": true,
      "ja": "2.2. IPv6 DHCPオプション"
    },
    {
      "indent": 3,
      "text": "The format of the IPv6 Captive-Portal DHCP option is shown below.",
      "ja": "IPv6キャプティブポータルDHCPオプションのフォーマットを以下に示します。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          option-code          |          option-len           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n.                      URI (variable length)                    .\n|                              ...                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "o option-code: The Captive-Portal DHCPv6 option (103) (two octets).",
      "ja": "o option-code：Captive-Portal DHCPv6オプション（103）（2オクテット）。"
    },
    {
      "indent": 3,
      "text": "o option-len: The length, in octets of the URI.",
      "ja": "o option-len：オクテット単位のURIの長さ。"
    },
    {
      "indent": 3,
      "text": "o URI: The contact URI for the captive portal that the user should connect to (encoded following the rules in [RFC3986]).",
      "ja": "o URI：ユーザーが接続する必要があるキャプティブポータルの連絡先URI（[RFC3986]の規則に従ってエンコードされています）。"
    },
    {
      "indent": 3,
      "text": "See Section 5.7 of [RFC7227] for more examples of DHCP options with URIs.",
      "ja": "URIを使用したDHCPオプションのその他の例については、[RFC7227]のセクション5.7をご覧ください。"
    },
    {
      "indent": 0,
      "text": "2.3. The Captive-Portal IPv6 RA Option",
      "section_title": true,
      "ja": "2.3. キャプティブポータルIPv6 RAオプション"
    },
    {
      "indent": 3,
      "text": "The format of the Captive-Portal Router Advertisement option is shown below.",
      "ja": "Captive-Portal Router Advertisementオプションのフォーマットを以下に示します。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     Length    |              URI              .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               .\n.                                                               .\n.                                                               .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "o Type: 37",
      "ja": "o タイプ：37"
    },
    {
      "indent": 3,
      "text": "o Length: 8-bit unsigned integer. The length of the option (including the Type and Length fields) in units of 8 bytes.",
      "ja": "o 長さ：8ビットの符号なし整数。オプションの長さ（タイプおよび長さフィールドを含む）。8バイト単位。"
    },
    {
      "indent": 3,
      "text": "o URI: The contact URI for the captive portal that the user should connect to. For the reasons described above, the implementer might want to use an IP address literal instead of a DNS name. This should be padded with NULL (0x0) to make the total option length (including the Type and Length fields) a multiple of 8 bytes.",
      "ja": "o URI：ユーザーが接続するキャプティブポータルの連絡先URI。上記の理由により、実装者はDNS名の代わりにIPアドレスリテラルを使用する場合があります。オプションの長さの合計（TypeフィールドとLengthフィールドを含む）を8バイトの倍数にするために、これにNULL（0x0）を埋め込む必要があります。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines two DHCP Captive-Portal options, one for IPv4 and one for IPv6. An option code (160) has been assigned from the \"BOOTP Vendor Extensions and DHCP Options\" registry (http://www.iana.org/assignments/bootp-dhcp-parameters), as specified in [RFC2939]. Also, an option code (103) has been assigned from the \"Option Codes\" registry under DHCPv6 parameters (http://www.iana.org/assignments/dhcpv6-parameters).",
      "ja": "このドキュメントでは、IPv4用とIPv6用の2つのDHCPキャプティブポータルオプションを定義しています。 [BOOTP Vendor Extensions and DHCP Options]レジストリ（http://www.iana.org/assignments/bootp-dhcp-parameters）から、[RFC2939]で指定されているように、オプションコード（160）が割り当てられています。また、オプションコード（103）は、DHCPv6パラメータ（http://www.iana.org/assignments/dhcpv6-parameters）の下の「オプションコード」レジストリから割り当てられています。"
    },
    {
      "indent": 3,
      "text": "IANA also has assigned an IPv6 RA Option Type code (37) from the\n\"IPv6 Neighbor Discovery Option Formats\" registry under ICMPv6\nparameters (http://www.iana.org/assignments/icmpv6-parameters).\nThanks, IANA!",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "An attacker with the ability to inject DHCP messages could include this option and so force users to contact an address of his choosing. As an attacker with this capability could simply list himself as the default gateway (and so intercept all the victim's traffic), this does not provide the attacker with significantly more capabilities, but because this document removes the need for interception, the attacker may have an easier time performing the attack. As the operating systems and application that make use of this information know that they are connecting to a captive-portal device (as opposed to intercepted connections), they can render the page in a sandboxed environment and take other precautions, such as clearly labeling the page as untrusted. The means of sandboxing and how the user interface presents this information are not covered in this document -- by their nature, those are implementation specific and best left to the application and user-interface designers.",
      "ja": "DHCPメッセージを挿入する機能を持つ攻撃者は、このオプションを含めることができるため、ユーザーに自分が選択したアドレスに強制的に連絡させることができます。この機能を持つ攻撃者は、自分をデフォルトゲートウェイとしてリストするだけで（したがって、すべての被害者のトラフィックを傍受できる）、攻撃者に大幅な機能を提供することはありませんが、このドキュメントでは傍受の必要性がなくなるため、攻撃者は攻撃を実行する時間が容易になります。この情報を使用するオペレーティングシステムとアプリケーションは、（インターセプトされた接続ではなく）キャプティブポータルデバイスに接続していることを認識しているため、サンドボックス環境でページをレンダリングし、明確にラベルを付けるなど、他の予防策を講じることができます。信頼されていないページ。サンドボックス化の方法とユーザーインターフェイスがこの情報を提示する方法については、このドキュメントでは扱いません。これらの性質は実装固有であり、アプリケーションとユーザーインターフェイスの設計者に任せるのが最善です。"
    },
    {
      "indent": 3,
      "text": "Devices and systems that automatically connect to an open network could potentially be tracked using the techniques described in this document (forcing the user to continually authenticate, or exposing their browser fingerprint). However, similar tracking can already be performed with the standard captive-portal mechanisms, so this technique does not give the attackers more capabilities.",
      "ja": "オープンネットワークに自動的に接続するデバイスとシステムは、このドキュメントで説明されている手法を使用して追跡される可能性があります（ユーザーに継続的に認証を強制するか、ブラウザーのフィンガープリントを公開する）。ただし、標準のキャプティブポータルメカニズムを使用して同様の追跡をすでに実行できるため、この手法によって攻撃者にさらに多くの機能が提供されることはありません。"
    },
    {
      "indent": 3,
      "text": "Captive portals are increasingly hijacking TLS connections to force browsers to talk to the portal. Providing the portal's URI via a DHCP or RA option is a cleaner technique and reduces user expectations of being hijacked; this may improve security by making users more reluctant to accept TLS hijacking, which can be performed from beyond the network associated with the captive portal.",
      "ja": "キャプティブポータルは、ブラウザにポータルとの通信を強制するために、TLS接続をますますハイジャックしています。 DHCPまたはRAオプションを介してポータルのURIを提供することは、よりクリーンな手法であり、ハイジャックされるユーザーの期待を減らします。これにより、ユーザーがTLSハイジャックの受け入れに消極的になり、キャプティブポータルに関連付けられたネットワーク外から実行できるため、セキュリティが向上する可能性があります。"
    },
    {
      "indent": 3,
      "text": "By simplifying the interaction with the captive-portal systems and doing away with the need for interception, we think that users will be less likely to disable useful security safeguards like DNSSEC validation, VPNs, etc. In addition, because the system knows that it is behind a captive portal, it can know not to send cookies, credentials, etc. By handing out a URI that is protected with TLS, the captive-portal operator can attempt to reassure the user that the captive portal is not malicious.",
      "ja": "キャプティブポータルシステムとの相互作用を簡素化し、傍受の必要性をなくすことで、ユーザーはDNSSEC検証、VPNなどの有用なセキュリティ保護機能を無効にする可能性が低くなると考えています。キャプティブポータルの背後では、Cookieや資格情報などを送信しないようにすることができます。TLSで保護されたURIを渡すことにより、キャプティブポータルのオペレーターは、キャプティブポータルが悪意のあるものではないことをユーザーに保証できます。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "ja": "5. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2131] Droms, R., \"Dynamic Host Configuration Protocol\", RFC 2131, DOI 10.17487/RFC2131, March 1997, <http://www.rfc-editor.org/info/rfc2131>.",
      "ja": "[RFC2131] Droms、R。、「Dynamic Host Configuration Protocol」、RFC 2131、DOI 10.17487 / RFC2131、1997年3月、<http://www.rfc-editor.org/info/rfc2131>。"
    },
    {
      "indent": 3,
      "text": "[RFC3315] Droms, R., Ed., Bound, J., Volz, B., Lemon, T., Perkins, C., and M. Carney, \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\", RFC 3315, DOI 10.17487/RFC3315, July 2003, <http://www.rfc-editor.org/info/rfc3315>.",
      "ja": "[RFC3315] Droms、R.、Ed。、Bound、J.、Volz、B.、Lemon、T.、Perkins、C.、and M. Carney、 \"Dynamic Host Configuration Protocol for IPv6（DHCPv6）\"、RFC 3315 、DOI 10.17487 / RFC3315、2003年7月、<http://www.rfc-editor.org/info/rfc3315>。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, DOI 10.17487/RFC3986, January 2005, <http://www.rfc-editor.org/info/rfc3986>.",
      "ja": "[RFC3986] Berners-Lee、T.、Fielding、R。、およびL. Masinter、「Uniform Resource Identifier（URI）：Generic Syntax」、STD 66、RFC 3986、DOI 10.17487 / RFC3986、2005年1月、<http：/ /www.rfc-editor.org/info/rfc3986>。"
    },
    {
      "indent": 3,
      "text": "[RFC4861] Narten, T., Nordmark, E., Simpson, W., and H. Soliman, \"Neighbor Discovery for IP version 6 (IPv6)\", RFC 4861, DOI 10.17487/RFC4861, September 2007, <http://www.rfc-editor.org/info/rfc4861>.",
      "ja": "[RFC4861] Narten、T.、Nordmark、E.、Simpson、W。、およびH. Soliman、「Neighbor Discovery for IP version 6（IPv6）」、RFC 4861、DOI 10.17487 / RFC4861、2007年9月、<http：/ /www.rfc-editor.org/info/rfc4861>。"
    },
    {
      "indent": 3,
      "text": "[RFC7227] Hankins, D., Mrugalski, T., Siodelski, M., Jiang, S., and S. Krishnan, \"Guidelines for Creating New DHCPv6 Options\", BCP 187, RFC 7227, DOI 10.17487/RFC7227, May 2014, <http://www.rfc-editor.org/info/rfc7227>.",
      "ja": "[RFC7227] Hankins、D.、Mrugalski、T.、Siodelski、M.、Jiang、S。、およびS. Krishnan、「新しいDHCPv6オプションを作成するためのガイドライン」、BCP 187、RFC 7227、DOI 10.17487 / RFC7227、2014年5月、<http://www.rfc-editor.org/info/rfc7227>。"
    },
    {
      "indent": 0,
      "text": "6. Informative References",
      "section_title": true,
      "ja": "6. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC2939] Droms, R., \"Procedures and IANA Guidelines for Definition of New DHCP Options and Message Types\", BCP 43, RFC 2939, DOI 10.17487/RFC2939, September 2000, <http://www.rfc-editor.org/info/rfc2939>.",
      "ja": "[RFC2939]ドロムズR.、「新しいDHCPオプションとメッセージタイプを定義するための手順とIANAガイドライン」、BCP 43、RFC 2939、DOI 10.17487 / RFC2939、2000年9月、<http://www.rfc-editor.org / info / rfc2939>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Vint Cerf for asking for this document to be written. Thanks to Wes George for supplying the IPv6 text. Thanks to Lorenzo and Erik for the V6 RA kick in the pants.",
      "ja": "このドキュメントの作成を依頼してくださったVint Cerfに感謝します。 IPv6テキストを提供してくれたWes Georgeに感謝します。パンツのV6 RAキックについては、LorenzoとErikに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Fred Baker, Paul Hoffman, Barry Leiba, Ted Lemon, Martin Nilsson, Ole Troan, and Asbjorn Tonnesen for detailed reviews and comments. Thanks for David Black for review and providing text for the security considerations. Also, great thanks to Joel Jaeggli for providing feedback and text.",
      "ja": "詳細なレビューとコメントを提供してくれたFred Baker、Paul Hoffman、Barry Leiba、Ted Lemon、Martin Nilsson、Ole Troan、およびAsbjorn Tonnesenに感謝します。セキュリティの検討のためのレビューとテキストを提供してくれたDavid Blackに感謝します。また、フィードバックとテキストを提供してくれたJoel Jaeggliに感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Warren Kumari Google 1600 Amphitheatre Parkway Mountain View, CA 94043 United States",
      "ja": "Warren Kumari Google 1600 Amphitheatre Parkway Mountain View、CA 94043アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: warren@kumari.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Olafur Gudmundsson CloudFlare San Francisco, CA 94107 United States",
      "ja": "Olafur Gudmundsson CloudFlareサンフランシスコ、CA 94107アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: olafur@cloudflare.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Paul Ebersman Comcast",
      "ja": "ポール・エバースマンコムキャスト"
    },
    {
      "indent": 3,
      "text": "Email: ebersman-ietf@dragon.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Steve Sheng Internet Corporation for Assigned Names and Numbers 12025 Waterfront Drive, Suite 300 Los Angeles, CA 90094 United States Phone: +1.310.301.5800",
      "ja": "Steve Sheng Internet Corporation for Assigned Names and Numbers 12025 Waterfront Drive、Suite 300 Los Angeles、CA 90094 United States電話：+1.310.301.5800"
    },
    {
      "indent": 3,
      "text": "Email: steve.sheng@icann.org",
      "raw": true,
      "ja": ""
    }
  ]
}