{
  "title": {
    "text": "RFC 7839 - Access-Network-Identifier Option in DHCP",
    "ja": "RFC 7839 - DHCPでのアクセス・ネットワーク識別子オプション"
  },
  "number": 7839,
  "created_at": "2019-11-02 14:18:47.595566+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       S. Bhandari\nRequest for Comments: 7839                                 S. Gundavelli\nCategory: Standards Track                                     M. Grayson\nISSN: 2070-1721                                                  B. Volz\n                                                           Cisco Systems\n                                                             J. Korhonen\n                                                        Broadcom Limited\n                                                               June 2016",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Access-Network-Identifier Option in DHCP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies the format and mechanism that is to be used for encoding Access-Network Identifiers in DHCPv4 and DHCPv6 messages by defining new Access-Network-Identifier options and sub-options.",
      "ja": "この文書は、新しいアクセス・ネットワーク識別子オプションとサブオプションを定義することにより、DHCPv4とDHCPv6のメッセージにアクセス・ネットワーク識別子を符号化するために使用されるフォーマットおよび機構を特定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7839.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7839で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Motivation  . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   4\n4.  DHCPv4 Access-Network-Identifier Option . . . . . . . . . . .   5\n  4.1.  DHCPv4 Access-Network-Identifier Sub-options  . . . . . .   5\n  4.2.  DHCPv4 Access-Technology-Type Sub-option  . . . . . . . .   6\n  4.3.  DHCPv4 Network-Identifier Sub-options . . . . . . . . . .   7\n    4.3.1.  DHCPv4 Network-Name Sub-option  . . . . . . . . . . .   7\n    4.3.2.  DHCPv4 Access-Point-Name Sub-option . . . . . . . . .   8\n    4.3.3.  DHCPv4 Access-Point-BSSID Sub-option  . . . . . . . .   9\n  4.4.  DHCPv4 Operator-Identifier Sub-options  . . . . . . . . .   9\n    4.4.1.  DHCPv4 Operator-Identifier Sub-option . . . . . . . .   9\n    4.4.2.  DHCPv4 Operator-Realm Sub-option  . . . . . . . . . .  10\n5.  DHCPv6 Access-Network-Identifier Options  . . . . . . . . . .  10\n  5.1.  DHCPv6 Access-Technology-Type Option  . . . . . . . . . .  11\n  5.2.  DHCPv6 Network-Identifier Options . . . . . . . . . . . .  11\n    5.2.1.  DHCPv6 Network-Name Option  . . . . . . . . . . . . .  12\n    5.2.2.  DHCPv6 Access-Point-Name Option . . . . . . . . . . .  12\n    5.2.3.  DHCPv6 Access-Point-BSSID Option  . . . . . . . . . .  13\n  5.3.  DHCPv6 Operator-Identifier Options  . . . . . . . . . . .  13\n    5.3.1.  DHCPv6 Operator-Identifier Option . . . . . . . . . .  13\n    5.3.2.  DHCPv6 Operator-Realm Option  . . . . . . . . . . . .  14\n6.  Relay Agent Behavior  . . . . . . . . . . . . . . . . . . . .  14\n7.  Server Behavior . . . . . . . . . . . . . . . . . . . . . . .  15\n8.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  16\n9.  Security Considerations . . . . . . . . . . . . . . . . . . .  17\n10. References  . . . . . . . . . . . . . . . . . . . . . . . . .  18\n  10.1.  Normative References . . . . . . . . . . . . . . . . . .  18\n  10.2.  Informative References . . . . . . . . . . . . . . . . .  18\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  19\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  20",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Access-network identification of a network device has a range of applications. For example, the Local Mobility Anchor (LMA) in a Proxy Mobile IPv6 (PMIPv6) domain is able to provide service treatment for the mobile node's traffic based on the access network to which the mobile node is attached.",
      "ja": "ネットワークデバイスのアクセス・ネットワーク識別は、アプリケーションの範囲を有します。例えば、プロキシモバイルIPv6（PMIPv6の）ドメインのローカル・モビリティ・アンカー（LMA）は、移動ノードが接続されているアクセスネットワークに基づくモバイルノードのトラフィックのサービス処理を提供することができます。"
    },
    {
      "indent": 3,
      "text": "This document specifies the Dynamic Host Configuration Protocol for IPv4 (DHCPv4) [RFC2131] and the Dynamic Host Configuration Protocol for IPv6 (DHCPv6) [RFC3315] options for access-network identification that is added by the relay agent in the DHCPv4 or DHCPv6 messages sent towards the server. The scope of applicability for this option is between a DHCP relay agent and a mobile access gateway where the same operator typically operates both these functions",
      "ja": "この文書は、IPv4用の動的ホスト構成プロトコル（のDHCPv4）[RFC2131]及び送信のDHCPv4またはDHCPv6のメッセージ中継エージェントによって追加されたアクセス・ネットワーク識別のためのIPv6用動的ホスト構成プロトコル（DHCPv6の）[RFC3315]オプションを指定しサーバー向けました。このオプションの適用の範囲は、DHCPリレーエージェントと同一のオペレータは、典型的には、これらの機能の両方を動作させるモバイル・アクセス・ゲートウェイとの間であります"
    },
    {
      "indent": 3,
      "text": "A DHCP relay agent that is aware of the access network and access operator adds this information in the DHCP messages. This information can be used to provide differentiated services and policing of traffic based on the access network to which a client is attached. Examples of how this information can be used in mobile networks can be found in [RFC6757].",
      "ja": "アクセスネットワークとアクセス演算子を認識しているDHCPリレーエージェントはDHCPメッセージにこの情報を追加します。この情報は、差別化されたサービスとクライアントが接続されているアクセスネットワークに基づいてトラフィックのポリシングを提供するために使用することができます。この情報は、モバイルネットワークで使用する方法の例は、[RFC6757]に見出すことができます。"
    },
    {
      "indent": 0,
      "text": "2. Motivation",
      "section_title": true,
      "ja": "2.動機"
    },
    {
      "indent": 3,
      "text": "PMIPv6 [RFC5213] can be used for supporting network-based mobility management in various types of network deployments. The network architectures, such as service provider Wi-Fi access aggregation or WLAN integrated mobile packet core, are examples where PMIPv6 is a component of the overall architecture. Some of these architectures require the ability of the LMA [RFC5213] to provide differentiated services and policing of traffic to the mobile nodes based on the access network to which they are attached. Policy systems in mobility architectures, such as Policy and Charging Control (PCC) [TS23203] and Access Network Discovery and Selection Function (ANDSF) [TS23402] in the 3GPP system, allow configuration of policy rules with conditions based on the access-network information. For example, the service treatment for the mobile node's traffic may be different when they are attached to an access network owned by the home operator than when owned by a roaming partner. In the case of access networks based on IEEE 802.11, the service treatment can also be different based on the configured Service Set Identifiers (SSIDs). Other examples of services include the operator's ability to apply tariff based on the location.",
      "ja": "PMIPv6 [RFC5213]は、ネットワーク展開の様々なタイプのネットワーク・ベースのモビリティ管理をサポートするために使用することができます。そのようなサービス・プロバイダのWi-Fiアクセス凝集またはWLANなどのネットワークアーキテクチャは、モバイル・パケット・コアを統合し、PMIPv6の全体的なアーキテクチャの構成要素である例です。これらのアーキテクチャの一部は、それらが結合しているアクセスネットワークに基づいて、移動ノードに対して異なるサービスやトラフィックのポリシングを提供するために、LMA [RFC5213]の能力を必要とします。 3GPPシステムにおけるそのようなポリシーおよび課金制御（PCC）TS23203]とアクセスネットワーク発見と選択機能（ANDSF）TS23402]としてモビリティアーキテクチャにおいてポリシシステムは、アクセスネットワークの情報に基づいて、条件にポリシールールの構成を可能にします。彼らはローミングパートナーが所有する場合よりもホームオペレータが所有するアクセスネットワークに接続されている場合たとえば、モバイルノードのトラフィックのためのサービス処理が異なる場合があります。 IEEE 802.11に基づくアクセスネットワークの場合には、サービス処理は、設定されたサービスセット識別子（SSIDの）に基づいて異なっていてもよいです。サービスの他の例は、位置に基づいて関税を適用するオペレータの能力が含まれます。"
    },
    {
      "indent": 3,
      "text": "The PMIPv6 extension as specified in [RFC6757] defines PMIPv6 options to carry Access-Network Identifiers in PMIPv6 signaling from the Mobile Access Gateway (MAG) to the LMA. The MAG can learn this information from the DHCP options as inserted by the DHCP relay agent in the access network. If the MAG relays the DHCP messages to the LMA as specified in [RFC5844], this information can be inserted by the MAG towards the LMA in the forwarded DHCP messages.",
      "ja": "[RFC6757]で指定されるようにPMIPv6の拡張はのPMIPv6がLMAへのモバイルアクセスゲートウェイ（MAG）からのシグナリングにアクセス・ネットワーク識別子を運ぶためのPMIPv6オプションを定義します。アクセスネットワーク内のDHCPリレーエージェントによって挿入されたとして、MAGはDHCPオプションからこの情報を学ぶことができます。 MAGは、LMAにDHCPメッセージを中継した場合、[RFC5844]で指定されるように、この情報が転送されたDHCPメッセージでLMAに向かっMAGによって挿入することができます。"
    },
    {
      "indent": 3,
      "text": "Figure 1 illustrates an example of PMIPv6 deployment. In this example, the access network is based on IEEE 802.11 technology, the DHCP relay agent function is located on the Access Point (AP), and the DHCP server function is located on the MAG. The MAG delivers the information elements related to the access network to the LMA over PMIPv6 signaling messages. The MAG obtains these information elements from the DHCP relay agent as per this specification. The information elements related to the access network include the SSID of the used IEEE 802.11 network, the geo-location of the access network to which the mobile node is attached, and the identity of the operator running the IEEE 802.11 access-network infrastructure.",
      "ja": "図1のPMIPv6の展開の一例を示す図です。この例では、アクセスネットワークはIEEE 802.11技術に基づいており、DHCPリレーエージェント機能は、アクセスポイント（AP）の上に配置され、DHCPサーバ機能は、MAGに位置しています。 MAGは、シグナリングメッセージのPMIPv6 LMA上に、アクセスネットワークに関連する情報要素を提供します。 MAGは、この仕様書どおりにDHCPリレーエージェントからこれらの情報要素を取得します。アクセスネットワークに関連する情報要素を用いるIEEE 802.11ネットワーク、モバイルノードが接続されているアクセスネットワークの地理的位置、およびIEEE 802.11アクセス・ネットワーク・インフラストラクチャを実行して、オペレータのアイデンティティのSSIDを含みます。"
    },
    {
      "indent": 10,
      "text": "SSID: IETF-1\nOperator-Identifier: provider1.example",
      "raw": true
    },
    {
      "indent": 10,
      "text": "+--+\n|AP|-----------.                    {Access-Specific Policies)\n+--+           | (DHCP Server)   _-----_             |\n(DHCP Relay) +-----+           _(       )_        +-----+\n             | MAG |-=========(   PMIPv6  )======-| LMA |-\n             +-----+           (_ Tunnel_)        +-----+\n+--+           |                 '-----'\n|AP|-----------'\n+--+\n(DHCP Relay)",
      "raw": true
    },
    {
      "indent": 10,
      "text": "SSID: IETF-2 Operator-Identifier: provider2.example",
      "ja": "SSID：IETF-2オペレータ識別子：provider2.example"
    },
    {
      "indent": 22,
      "text": "Access Networks Attached to MAG",
      "ja": "MAGに接続されたアクセスネットワーク"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "All the DHCP-related terms used in this document are to be interpreted as defined in DHCPv4 [RFC2131] and DHCPv6 [RFC3315] specifications. \"DHCP message\" refers to both DHCPv4 and DHCPv6 messages throughout this document.",
      "ja": "本書で使用されるすべてのDHCP関連の用語は、DHCPv4の[RFC2131]とDHCPv6 [RFC3315]の仕様で定義されるように解釈されるべきです。 「DHCPメッセージは、」この文書全体DHCPv4とDHCPv6の両方のメッセージを指します。"
    },
    {
      "indent": 3,
      "text": "All the mobility-related terms used in this document are to be interpreted as defined in the PMIPv6 specifications [RFC5213] and [RFC5844]. Additionally, this document uses the following abbreviations:",
      "ja": "本書で使用されるすべてのモビリティ関連用語は、PMIPv6の仕様[RFC5213]及び[RFC5844]で定義されるように解釈されるべきです。また、この文書は次の略語を使用しています："
    },
    {
      "indent": 3,
      "text": "Service Set Identifier (SSID)",
      "ja": "サービスセット識別子（SSID）"
    },
    {
      "indent": 6,
      "text": "The Service Set Identifier (SSID) identifies the name of the IEEE 802.11 network. The SSID differentiates from one network to the other.",
      "ja": "サービスセット識別子（SSID）は、IEEE 802.11ネットワークの名前を識別します。 SSIDは、他の1つのネットワークから区別します。"
    },
    {
      "indent": 3,
      "text": "Operator-Identifier",
      "ja": "オペレータ識別子"
    },
    {
      "indent": 6,
      "text": "The Operator-Identifier is the Structure of Management Information (SMI) Network Management Private Enterprise Code of the IANA-maintained \"Private Enterprise Numbers\" registry [SMI]. It identifies the operator running the access network where the client is attached.",
      "ja": "オペレータ識別子は、IANA-維持「民間企業番号」レジストリ[SMI]の経営情報の構造（SMI）ネットワーク管理プライベートエンタープライズコードです。これは、クライアントが接続されているアクセスネットワークを実行している事業者を識別します。"
    },
    {
      "indent": 0,
      "text": "4. DHCPv4 Access-Network-Identifier Option",
      "section_title": true,
      "ja": "4. DHCPv4のアクセス・ネットワーク識別子オプション"
    },
    {
      "indent": 3,
      "text": "The Access-Network Identifier (ANI) carries information related to the identity of the access network to which the client is attached. This information includes access-technology type, network identifier, and access network operator identifiers.",
      "ja": "アクセス・ネットワーク識別子（ANI）は、クライアントが接続されているアクセスネットワークのアイデンティティに関連する情報を運びます。この情報は、アクセス・テクノロジー・タイプ、ネットワーク識別子、およびアクセスネットワークオペレータ識別子を含みます。"
    },
    {
      "indent": 3,
      "text": "Relay agents that include ANI information include one or more sub-options (see Section 4.1) in the Relay Agent Information option [RFC3046].",
      "ja": "ANI情報を含むリレーエージェントはリレーエージェント情報オプション[RFC3046]で1つ以上のサブオプション（4.1節を参照）が含まれます。"
    },
    {
      "indent": 0,
      "text": "4.1. DHCPv4 Access-Network-Identifier Sub-options",
      "section_title": true,
      "ja": "4.1。 DHCPv4のアクセス・ネットワーク識別子サブオプション"
    },
    {
      "indent": 3,
      "text": "The Access-Network-Identifier information will be defined in multiple sub-options allocated from the \"DHCP Relay Agent Sub-Option Codes\" registry.",
      "ja": "アクセス・ネットワーク識別子情報は、「DHCPリレーエージェントサブオプションコード」レジストリから割り当てられた複数のサブオプションで定義されます。"
    },
    {
      "indent": 3,
      "text": "ANI Sub-options: The ANI sub-options consist of a sequence of Sub-Option Code, Length, and Value tuples for each sub-option, encoded in the following manner:",
      "ja": "ANIサブオプション：ANIサブオプションは、以下のように符号化された各サブオプションのためのサブオプションコード、長さ、および値の組の配列からなります。"
    },
    {
      "indent": 6,
      "text": " Subopt  Len     Sub-option Data\n+------+------+------+------+------+------+--...-+------+\n| code |   N  |  s1  |  s2  |  s3  |  s4  |      |  sN  |\n+------+------+------+------+------+------+--...-+------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Subopt code The 1-octet code for the sub-options defined in the following sections.",
      "ja": "Suboptコード以下のセクションで定義されたサブオプションの1オクテットのコード。"
    },
    {
      "indent": 3,
      "text": "Len An unsigned 8-bit integer giving the length of the Sub-option Data field in this sub-option in octets.",
      "ja": "LENオクテットでこのサブオプションサブオプションデータフィールドの長さを与える8ビットの符号なし整数。"
    },
    {
      "indent": 3,
      "text": "Sub-option Data (s1 to sN) The data area for the sub-option.",
      "ja": "サブオプションデータ（SnにS1）サブオプションのデータ領域。"
    },
    {
      "indent": 3,
      "text": "The initial assignment of the DHCP Access-Network-Identifier sub-options is as follows:",
      "ja": "次のようにDHCPアクセス・ネットワーク識別子サブオプションの初期割り当ては次のとおりです。"
    },
    {
      "indent": 6,
      "text": "+=================+=======================================+\n| SUB-OPTION CODE |      SUB-OPTION DESCRIPTION           |\n+=================+=======================================+\n|       13        | Access-Technology-Type Sub-option     |\n+=========================================================+\n|       14        | Access-Network-Name Sub-option        |\n+=========================================================+\n|       15        | Access-Point-Name Sub-option          |\n+=========================================================+\n|       16        | Access-Point-BSSID Sub-option         |\n+=========================================================+\n|       17        | Operator-Identifier Sub-option        |\n+=========================================================+\n|       18        | Operator-Realm Sub-option             |\n+=========================================================+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.2. DHCPv4 Access-Technology-Type Sub-option",
      "section_title": true,
      "ja": "4.2。 DHCPv4のアクセス・テクノロジー・タイプのサブオプション"
    },
    {
      "indent": 3,
      "text": "This sub-option is used for exchanging the type of the access technology of the network to which the client is attached. Its format is as follows:",
      "ja": "このサブオプションは、クライアントが接続されているネットワークのアクセス技術の種類を交換するために使用されます。形式は以下の通りです："
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Subopt Code  |     Length    |   Reserved    |      ATT      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Subopt Code 13",
      "ja": "Suboptコード13"
    },
    {
      "indent": 3,
      "text": "Length 2",
      "ja": "長さ2"
    },
    {
      "indent": 3,
      "text": "Reserved An 8-bit field that is unused for now. The value MUST be initialized to 0 by the sender and MUST be ignored by the receiver.",
      "ja": "今のところ未使用である8ビットのフィールドを予約。値は、送信者によって0に初期化しなければならなくて、受信機で無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Access-Technology-Type (ATT) An 8-bit field that specifies the access technology through which the client is connected to the access link from the IANA name space \"Access Technology Type Option type values\" registry defined in [RFC5213].",
      "ja": "アクセス・テクノロジー・タイプ（ATT）クライアントが[RFC5213]で定義されたIANA名前空間「アクセス技術の種類のオプションタイプの値」レジストリからアクセスリンクに接続されてアクセス技術を指定する8ビットのフィールド。"
    },
    {
      "indent": 0,
      "text": "4.3. DHCPv4 Network-Identifier Sub-options",
      "section_title": true,
      "ja": "4.3。 DHCPv4のネットワーク識別子サブオプション"
    },
    {
      "indent": 3,
      "text": "These sub-options are used for carrying the name of the access network (e.g., an SSID in the case of an IEEE 802.11 access network or a Public Land-based Mobile Network (PLMN) Identifier [TS23003] in the case of a 3GPP access network) and the Access-Point Name to which the client is attached. The format of these sub-options is defined in the following sections. The Network-Identifier sub-options are only for the currently known access-technology types.",
      "ja": "これらのサブオプションは、アクセスネットワーク（例えば、3GPPアクセスの場合にはIEEE 802.11アクセスネットワーク又は公衆陸上移動ネットワーク（PLMN）識別子[TS23003]の場合のSSIDの名前を運ぶために使用されますネットワーク）と、クライアントが接続されているアクセスポイントの名前。これらのサブオプションのフォーマットは、以下のセクションで定義されています。ネットワーク識別子サブオプションは、現在知られているアクセス技術タイプのためのものです。"
    },
    {
      "indent": 0,
      "text": "4.3.1. DHCPv4 Network-Name Sub-option",
      "section_title": true,
      "ja": "4.3.1。 DHCPv4のネットワーク名のサブオプション"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Subopt Code  |     Length    |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               |\n.                                                               .\n.                     Network-Name (e.g., SSID or PLMNID)       .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Subopt Code 14",
      "ja": "Suboptコード14"
    },
    {
      "indent": 3,
      "text": "Length The length of the Network-Name field.",
      "ja": "長ネットワーク名フィールドの長さ。"
    },
    {
      "indent": 3,
      "text": "Network-Name The name of the access network to which the mobile node is attached. The encoding MUST be UTF-8 as described in [RFC3629].",
      "ja": "モバイルノードが接続されているアクセスネットワークの名前をネットワーク名。 [RFC3629]で説明されるように符号化はUTF-8でなければなりません。"
    },
    {
      "indent": 6,
      "text": "The type of the Network-Name is dependent on the access technology to which the mobile node is attached. For networks based on IEEE 802.11, the Network-Name will be the SSID of the network. For 3GPP access-based networks, it is the PLMN Identifier of the access network, and for 3GPP2 access, the Network-Name is the ANI [ANI].",
      "ja": "ネットワーク名のタイプは、モバイルノードが接続されているアクセス技術に依存しています。 IEEE 802.11に基づくネットワークでは、ネットワーク名は、ネットワークのSSIDとなります。 3GPPアクセスベースのネットワークのために、それは、アクセスネットワークのPLMN識別子であり、および3GPP2アクセスのために、ネットワーク名は、ANI [ANI]です。"
    },
    {
      "indent": 6,
      "text": "When encoding the PLMN Identifier, both the Mobile Network Code (MNC) [TS23003] and Mobile Country Code (MCC) [TS23003] MUST be three digits. If the MNC in use only has two digits, then it MUST be preceded with a '0'.",
      "ja": "PLMN識別子を符号化するときに、モバイルネットワークコード（MNC）TS23003]およびモバイル国コード（MCC）TS23003]の両方が3桁でなければなりません。使用中のMNCが2桁のみを持っている場合、それは「0」を付ける必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3.2. DHCPv4 Access-Point-Name Sub-option",
      "section_title": true,
      "ja": "4.3.2。 DHCPv4のアクセスポイント名のサブオプション"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Subopt Code  |     Length    |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               |\n.                                                               .\n.                        Access-Point-Name                      .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Subopt Code 15",
      "ja": "Suboptコード15"
    },
    {
      "indent": 3,
      "text": "Length The length of the Access-Point-Name field.",
      "ja": "長さはアクセスポイント名フィールドの長さ。"
    },
    {
      "indent": 3,
      "text": "Access-Point-Name The name of the access point (physical device name) to which the mobile node is attached. This is the identifier that uniquely identifies the access point. While the Network-Name (e.g., SSID) identifies the operator's access network, the Access-Point-Name identifies a specific network device in the network to which the mobile node is attached. In some deployments, the Access-Point-Name can be set to the string representation of the Media Access Control (MAC) address of the device as specified in [RFC6991] (see mac-address typedef) or some unique identifier that can be used by the policy systems in the operator network to unambiguously identify the device. The encoding MUST be UTF-8 as described in [RFC3629].",
      "ja": "アクセスポイント名モバイルノードが接続されているアクセスポイント（物理デバイス名）の名称。これは、一意のアクセスポイントを識別する識別子です。ネットワーク名（例えば、SSID）オペレータのアクセスネットワークを識別しながら、アクセスポイント名は、モバイルノードが接続されているネットワーク内の特定のネットワークデバイスを識別する。いくつかの展開では、アクセスポイント名は、[RFC6991]で指定されるように、デバイスのメディアアクセス制御（MAC）アドレス（MACアドレスのtypedefを参照）を用いることができるいくつかのユニークな識別子の文字列表現に設定することができますオペレータネットワーク内のポリシーシステムによって明確にデバイスを識別します。 [RFC3629]で説明されるように符号化はUTF-8でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3.3. DHCPv4 Access-Point-BSSID Sub-option",
      "section_title": true,
      "ja": "4.3.3。 DHCPv4のアクセス・ポイントBSSIDサブオプション"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Subopt Code  |     Length    |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               |\n|                        Access-Point-BSSID                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Subopt Code 16",
      "ja": "Suboptコード16"
    },
    {
      "indent": 3,
      "text": "Length 6",
      "ja": "長さ6"
    },
    {
      "indent": 3,
      "text": "Access-Point-BSSID The 48-bit Basic SSSID (BSSID) of the access point to which the mobile node is attached.",
      "ja": "アクセスポイントBSSIDモバイルノードが接続されているアクセスポイントの48ビットの基本SSSID（BSSID）。"
    },
    {
      "indent": 0,
      "text": "4.4. DHCPv4 Operator-Identifier Sub-options",
      "section_title": true,
      "ja": "4.4。 DHCPv4のオペレータ識別子サブオプション"
    },
    {
      "indent": 3,
      "text": "The Operator-Identifier sub-options can be used for carrying the Operator-Identifiers of the access network to which the client is attached. The format of these sub-options is defined below.",
      "ja": "オペレータ識別子サブオプションは、クライアントが接続されているアクセスネットワークのオペレータ識別子を搬送するために使用することができます。これらのサブオプションのフォーマットは以下に定義されます。"
    },
    {
      "indent": 0,
      "text": "4.4.1. DHCPv4 Operator-Identifier Sub-option",
      "section_title": true,
      "ja": "4.4.1。 DHCPv4のオペレータ識別子サブオプション"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Subopt Code  |     Length    |                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n.      Operator-Identifier      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Subopt Code 17",
      "ja": "Suboptコード17"
    },
    {
      "indent": 3,
      "text": "Length 4",
      "ja": "長さ4"
    },
    {
      "indent": 3,
      "text": "Operator-Identifier The Operator-Identifier is a variable-length Private Enterprise Number (PEN) [SMI] encoded in a network byte order. Please refer to Section 3.1.3 of [RFC6757] for additional details.",
      "ja": "オペレータ識別子ザオペレータ識別子は、ネットワークバイト順に符号化された可変長プライベート企業番号（PEN）[SMI]です。詳細については、[RFC6757]のセクション3.1.3を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.4.2. DHCPv4 Operator-Realm Sub-option",
      "section_title": true,
      "ja": "4.4.2。 DHCPv4のオペレータレルムのサブオプション"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  Subopt Code  |     Length    |                               |\n|-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               |\n.                                                               .\n.                        Operator-Realm                         .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Subopt Code 18",
      "ja": "Suboptコード18"
    },
    {
      "indent": 3,
      "text": "Length The length of the Operator-Realm field.",
      "ja": "長オペレータレルムフィールドの長さ。"
    },
    {
      "indent": 3,
      "text": "Operator-Realm Realm of the operator (e.g., EXAMPLE.COM). Please refer to Section 3.1.3 of [RFC6757] for additional details.",
      "ja": "オペレータ（例えば、EXAMPLE.COM）のオペレータレルムrealm。詳細については、[RFC6757]のセクション3.1.3を参照してください。"
    },
    {
      "indent": 0,
      "text": "5. DHCPv6 Access-Network-Identifier Options",
      "section_title": true,
      "ja": "5. DHCPv6のアクセス・ネットワーク識別子オプション"
    },
    {
      "indent": 3,
      "text": "The Access-Network-Identifier options defined here may be added by the DHCPv6 relay agent in Relay-forward messages.",
      "ja": "ここで定義されたアクセス・ネットワーク識別子のオプションは、リレーフォワードメッセージでのDHCPv6リレーエージェントによって追加することができます。"
    },
    {
      "indent": 6,
      "text": "+=================+=======================================+\n|    OPTION CODE  |      OPTION DESCRIPTION               |\n+=================+=======================================+\n|       105       | OPTION_ANI_ATT                        |\n+=========================================================+\n|       106       | OPTION_ANI_NETWORK_NAME               |\n+=========================================================+\n|       107       | OPTION_ANI_AP_NAME                    |\n+=========================================================+\n|       108       | OPTION_ANI_AP_BSSID                   |\n+=========================================================+\n|       109       | OPTION_ANI_OPERATOR_ID                |\n+=========================================================+\n|       110       | OPTION_ANI_OPERATOR_REALM             |\n+=========================================================+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5.1. DHCPv6 Access-Technology-Type Option",
      "section_title": true,
      "ja": "5.1。 DHCPv6のアクセス・テクノロジー・タイプオプション"
    },
    {
      "indent": 3,
      "text": "This option is used for exchanging the type of access technology the client uses to attach to the network. Its format is as follows:",
      "ja": "このオプションは、クライアントがネットワークに接続するために使用するアクセス技術の種類を交換するために使用されます。形式は以下の通りです："
    },
    {
      "indent": 7,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         OPTION_ANI_ATT        |           Option-Len          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   Reserved    |       ATT     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Option-Code OPTION_ANI_ATT (105)",
      "ja": "オプションコードOPTION_ANI_ATT（105）"
    },
    {
      "indent": 3,
      "text": "Option-Len 2",
      "ja": "ただ、オプション-2"
    },
    {
      "indent": 3,
      "text": "Reserved An 8-bit field that is unused for now. The value MUST be initialized to 0 by the sender and MUST be ignored by the receiver.",
      "ja": "今のところ未使用である8ビットのフィールドを予約。値は、送信者によって0に初期化しなければならなくて、受信機で無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Access-Technology-Type (ATT): The contents of this field are the same as the ATT field described in Section 4.2.",
      "ja": "アクセス技術タイプ（ATT）：このフィールドの内容は、セクション4.2で説明ATTフィールドと同じです。"
    },
    {
      "indent": 0,
      "text": "5.2. DHCPv6 Network-Identifier Options",
      "section_title": true,
      "ja": "5.2。 DHCPv6のネットワーク識別子オプション"
    },
    {
      "indent": 3,
      "text": "These options can be used for carrying the name of the access network (e.g., an SSID in the case of an IEEE 802.11 access network or a PLMN Identifier [TS23003] in the case of a 3GPP access network) and an Access-Point Name to which the client is attached. The format of these options is defined below.",
      "ja": "これらのオプションは、アクセスネットワーク（例えば、IEEE 802.11アクセスネットワーク又は3GPPアクセスネットワークの場合にPLMN識別子[TS23003]の場合SSID）の名前とアクセスポイント名への搬送のために使用することができますこれは、クライアントが接続されています。これらのオプションの書式は以下に定義されます。"
    },
    {
      "indent": 0,
      "text": "5.2.1. DHCPv6 Network-Name Option",
      "section_title": true,
      "ja": "5.2.1。 DHCPv6のネットワーク名オプション"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    OPTION_ANI_NETWORK_NAME    |           Option-Len          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n.                                                               .\n.                     Network-Name (e.g., SSID or PLMNID)       .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Option-Code OPTION_ANI_NETWORK_NAME (106)",
      "ja": "オプションコードOPTION_ANI_NETWORK_NAME（106）"
    },
    {
      "indent": 3,
      "text": "Option-Len The length of the Network-Name field.",
      "ja": "オプション・レンネットワーク名フィールドの長さ。"
    },
    {
      "indent": 3,
      "text": "Network-Name The contents of this field are the same as the Network-Name field described in Section 4.3.1.",
      "ja": "ネットワーク名は、このフィールドの内容は、4.3.1項で説明したネットワーク名]フィールドと同じです。"
    },
    {
      "indent": 0,
      "text": "5.2.2. DHCPv6 Access-Point-Name Option",
      "section_title": true,
      "ja": "5.2.2。 DHCPv6のアクセスポイント名のオプション"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|       OPTION_ANI_AP_NAME      |           Option-Len          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n.                                                               .\n.                        Access-Point-Name                      .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Option-Code OPTION_ANI_AP_NAME (107)",
      "ja": "オプション・コードOPTION_ANI_AP_NAME（107）"
    },
    {
      "indent": 3,
      "text": "Option-Len The length of the Access-Point-Name field.",
      "ja": "オプション・レンアクセスポイント名フィールドの長さ。"
    },
    {
      "indent": 3,
      "text": "Access-Point-Name The contents of this field are the same as the Access-Point-Name field described in Section 4.3.2.",
      "ja": "このフィールドのアクセスポイント名内容は、4.3.2項で説明したアクセスポイント名フィールドと同じです。"
    },
    {
      "indent": 0,
      "text": "5.2.3. DHCPv6 Access-Point-BSSID Option",
      "section_title": true,
      "ja": "5.2.3。 DHCPv6のアクセス・ポイントBSSIDオプション"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|       OPTION_ANI_AP_BSSID     |           Option-Len          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Access-Point-BSSID                     |\n+                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Option-Code OPTION_ANI_AP_BSSID (108)",
      "ja": "オプションコードOPTION_ANI_AP_BSSID（108）"
    },
    {
      "indent": 3,
      "text": "Option-Len 6",
      "ja": "オプション-レン6"
    },
    {
      "indent": 3,
      "text": "Access-Point-BSSID The contents of this field are the same as the Access-Point-BSSID field described in Section 4.3.3.",
      "ja": "アクセスポイント-BSSIDは、このフィールドの内容は、セクション4.3.3で説明したアクセス・ポイントBSSIDフィールドと同じです。"
    },
    {
      "indent": 0,
      "text": "5.3. DHCPv6 Operator-Identifier Options",
      "section_title": true,
      "ja": "5.3。 DHCPv6のオペレータ識別子オプション"
    },
    {
      "indent": 3,
      "text": "The Operator-Identifier options can be used for carrying the Operator-Identifier of the access network to which the client is attached. The format of these options is defined below.",
      "ja": "オペレータ識別子オプションは、クライアントが接続されているアクセスネットワークのオペレータ識別子を運ぶために使用することができます。これらのオプションの書式は以下に定義されます。"
    },
    {
      "indent": 0,
      "text": "5.3.1. DHCPv6 Operator-Identifier Option",
      "section_title": true,
      "ja": "5.3.1。 DHCPv6のオペレータ識別子オプション"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     OPTION_ANI_OPERATOR_ID    |           Option-Len          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Operator-Identifier                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Option-Code OPTION_ANI_OPERATOR_ID (109)",
      "ja": "オプションコードOPTION_ANI_OPERATOR_ID（109）"
    },
    {
      "indent": 3,
      "text": "Option-Len 4",
      "ja": "オプション-4のみ"
    },
    {
      "indent": 3,
      "text": "Operator-Identifier The contents of this field are the same as the DHCPv4 Operator-Identifier Sub-option field described in Section 4.4.1.",
      "ja": "オペレータ識別子このフィールドの内容は、セクション4.4.1に記載のDHCPv4オペレータ識別子サブオプションフィールドと同じです。"
    },
    {
      "indent": 0,
      "text": "5.3.2. DHCPv6 Operator-Realm Option",
      "section_title": true,
      "ja": "5.3.2。 DHCPv6のオペレータ・レルム・オプション"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   OPTION_ANI_OPERATOR_REALM   |           Option-Len          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n.                                                               .\n.                        Operator-Realm                         .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Option-Code OPTION_ANI_OPERATOR_REALM (110)",
      "ja": "オプションコードOPTION_ANI_OPERATOR_REALM（110）"
    },
    {
      "indent": 3,
      "text": "Option-Len The length of the Operator-Realm field.",
      "ja": "オプション・レンオペレーターレルムフィールドの長さ。"
    },
    {
      "indent": 3,
      "text": "Operator-Realm The contents of this field are the same as the Operator-Realm field described in Section 4.4.2.",
      "ja": "オペレータレルムは、このフィールドの内容は、4.4.2項で説明したオペレータレルムのフィールドと同じです。"
    },
    {
      "indent": 0,
      "text": "6. Relay Agent Behavior",
      "section_title": true,
      "ja": "6.リレーエージェントの動作"
    },
    {
      "indent": 3,
      "text": "DHCPv4 relay agents MAY include sub-options as defined in Section 4.2 through 4.4 of [RFC3046] in the Relay Agent Information option for providing information about the access network over which DHCP messages from the client are received.",
      "ja": "クライアントからのDHCPメッセージが受信される上、アクセスネットワークについての情報を提供するためのリレーエージェント情報オプションに[RFC3046]の4.4を通じて4.2節で定義されたDHCPv4リレーエージェントは、サブオプションを含むかもしれません。"
    },
    {
      "indent": 3,
      "text": "The DHCPv4 relay agent MUST include the DHCPv4 Access-Technology-Type Sub-option (Section 4.2) when including any of these sub-options in the DHCP message: DHCPv4 Network-Name Sub-option (Section 4.3.1), DHCPv4 Access-Point-Name Sub-option (Section 4.3.2), and DHCPv4 Access-Point-BSSID Sub-option (Section 4.3.3).",
      "ja": "DHCPv4のネットワーク名サ​​ブオプション（4.3.1）、DHCPv4のAccess-：DHCPv4のリレーエージェントはDHCPメッセージにこれらのサブオプションのいずれかを含むDHCPv4のアクセス・テクノロジー・タイプのサブオプション（4.2節）を含まなければなりませんポイント名のサブオプション（4.3.2項）、およびDHCPv4のアクセス・ポイントBSSIDサブオプション（4.3.3）。"
    },
    {
      "indent": 3,
      "text": "DHCPv6 Relay Agents MAY include options (defined in Section 5) in the Relay-forward message when forwarding any DHCPv6 message type from clients to the servers to provide information about the access network over which DHCPv6 messages from the client are received.",
      "ja": "クライアントからのDHCPv6メッセージが受信される上、アクセスネットワークについての情報を提供するために、サーバーへのクライアントからの任意のDHCPv6メッセージタイプを転送するときのDHCPv6リレーエージェントはリレー転送メッセージで（セクション5で定義された）オプションを含むかもしれません。"
    },
    {
      "indent": 3,
      "text": "The DHCPv6 relay agent MUST include the DHCPv6 Access-Technology-Type Option (Section 5.1) when including any of these options in the DHCP message: DHCPv6 Network-Name Option (Section 5.2.1), DHCPv6 Access-Point-Name Option (Section 5.2.2), and DHCPv6 Access-Point-BSSID Option (Section 5.2.3).",
      "ja": "DHCPv6のネットワーク-nameオプション（5.2.1）、DHCPv6のアクセスポイント名のオプション（セクション：のDHCPv6リレーエージェントはDHCPメッセージでこれらのオプションのいずれかを含むDHCPv6のアクセス・テクノロジー・タイプオプション（5.1節）を含まなければなりません5.2.2）、およびDHCPv6のアクセス・ポイントBSSIDオプション（5.2.3項）。"
    },
    {
      "indent": 0,
      "text": "7. Server Behavior",
      "section_title": true,
      "ja": "7.サーバーの動作"
    },
    {
      "indent": 3,
      "text": "The DHCPv4 base specification [RFC2131] requires that the DHCPv4 server ignore the DHCPv4 Access-Network-Identifier Option if it does not understand the option.",
      "ja": "DHCPv4の基本仕様[RFC2131]は、それがオプションを理解していない場合はDHCPv4サーバは、DHCPv4のアクセス・ネットワーク識別子オプションを無視することが必要です。"
    },
    {
      "indent": 3,
      "text": "If the DHCPv4 server does not understand the received sub-option defined in Sections 4.1 through 4.4 of [RFC3046], the DHCPv4 Relay-Agent-Information Option, it MUST ignore those sub-options only. If the DHCPv4 server is able to process the DHCPv4 Access-Network-Identifier sub-options defined in Sections 4.1 through 4.4 of [RFC3046], the DHCPv4 Relay-Agent-Information Option, it MAY use this information obtained from the sub-option for address pool selection or for policy decisions as per its configured policy. This information obtained from the sub-option SHOULD NOT be stored unless it is absolutely needed. However, if it is stored, the information MUST be deleted as quickly as possible to eliminate any possibility of the information getting exposed to an intruder.",
      "ja": "DHCPv4サーバは、[RFC3046]の4.4節を通じて4.1で定義されている受信したサブオプション、DHCPv4のリレーエージェント情報オプションを理解していない場合は、それだけでそれらのサブオプションを無視しなければなりません。 DHCPv4サーバは、[RFC3046]の4.4を通じてセクション4.1で定義されたDHCPv4アクセス・ネットワーク識別子サブオプション、DHCPv4のリレーエージェント情報オプションを処理することができるならば、それはのためのサブオプションから取得した情報を使用するかもしれその設定されたポリシーに従って、プールの選択や政策決定のために取り組みます。それが絶対的に必要とされない限り、サブオプションから得たこの情報が保存されるべきではありません。しかし、それが格納されている場合、情報が侵入者にさらさ取得情報のいずれかの可能性を排除するために、可能な限り迅速に削除する必要があります。"
    },
    {
      "indent": 3,
      "text": "The DHCPv4 server MUST ignore the received DHCPv4 Access-Network-Identifier Option and process the rest of the message as per the base DHCPv4 specifications if the received DHCPv4 message does not include the DHCPv4 Access-Technology-Type Sub-option (Section 4.2) but does include any one of these other options: DHCPv4 Network Name Sub-option (Section 4.3.1), DHCPv4 Access-Point-Name Sub-option (Section 4.3.2), or DHCPv4 Access-Point-BSSID Sub-option (Section 4.3.3).",
      "ja": "DHCPv4サーバは、受信したDHCPv4アクセス・ネットワーク識別子オプションを無視し、受信したDHCPv4メッセージはDHCPv4のアクセステクノロジー型サブオプション（セクション4.2）を含まない場合のベースDHCPv4の仕様に従って、メッセージの残りの部分を処理しなければならないがDHCPv4のネットワーク名は、サブオプション（4.3.1）、DHCPv4のアクセスポイント名サブオプション（4.3.2項）、またはDHCPv4のアクセス・ポイントBSSIDサブオプション（セクション：これらの他のオプションのいずれかを含んでいます4.3.3）。"
    },
    {
      "indent": 3,
      "text": "DHCPv6 base specification [RFC3315] requires that the DHCPv6 server ignore the DHCPv6 Access-Network-Identifier Option if it does not understand the option.",
      "ja": "DHCPv6の基本仕様[RFC3315]それはオプションを理解していない場合は、DHCPv6サーバがDHCPv6のアクセス・ネットワーク識別子オプションを無視することが必要です。"
    },
    {
      "indent": 3,
      "text": "If the DHCPv6 server receives the options defined in Section 5 and is configured to use the options defined in Section 5, it SHOULD look for the DHCPv6 Access-Network-Identifier options in the Relay-forward message of the DHCPv6 relay agent(s) based on its configured policy. The server MAY use received ANI options for its address pool selection policy decisions as per its configured policy. This information obtained from the options SHOULD NOT be stored unless it is absolutely needed. However, if it is stored, the information MUST be deleted as quickly as possible to eliminate any possibility of the information getting exposed to an intruder.",
      "ja": "DHCPv6サーバは、セクション5で定義されたオプションを受け取り、セクション5で定義されたオプションを使用するように構成されている場合、それは（S）ベースのDHCPv6リレーエージェントのリレー転送メッセージでDHCPv6のアクセス・ネットワーク識別子オプションになるはずその設定されたポリシーに。サーバーは、その設定されたポリシーに従って、そのアドレスプール選択政策決定のために受信ANIオプションを使用するかもしれません。それが絶対的に必要とされていない限り、オプションの中から得たこの情報が保存されるべきではありません。しかし、それが格納されている場合、情報が侵入者にさらさ取得情報のいずれかの可能性を排除するために、可能な限り迅速に削除する必要があります。"
    },
    {
      "indent": 3,
      "text": "The DHCPv6 server MUST ignore the received DHCPv6 Access-Network-Identifier Option and process the rest of the message as per the base DHCPv6 specifications if the received DHCPv6 message does not include the DHCPv6 Access-Technology-Type Option (Section 5.1) but it does includes any one of these other options: DHCPv6 Network-Name Option (Section 5.2.1), DHCPv6 Access-Point-Name Option (Section 5.2.2), or DHCPv6 Access-Point-BSSID Option (Section 5.2.3).",
      "ja": "DHCPv6サーバは、受信DHCPv6のアクセス・ネットワーク識別子オプションを無視し、受信したDHCPv6メッセージがDHCPv6のアクセス・テクノロジー・タイプオプション（5.1節）が含まれていませんが、それがない場合は、ベースのDHCPv6仕様に従ってメッセージの残りの部分を処理しなければなりませんDHCPv6のネットワーク-nameオプション（5.2.1）、DHCPv6のアクセスポイント-nameオプション（5.2.2項）、またはDHCPv6のアクセス・ポイントBSSIDオプション（5.2.3項）：これらの他のオプションのいずれかを含んでいます。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned sub-option codes for the following DHCPv4 sub-options from the \"DHCP Relay Agent Sub-Option Codes\" registry, <http://www.iana.org/assignments/bootp-dhcp-parameters>:",
      "ja": "IANAは、「DHCPリレーエージェントサブオプションコード」レジストリから次のDHCPv4サブオプションのためのサブオプションコードを割り当てられた、<http://www.iana.org/assignments/bootp-dhcp-parameters>："
    },
    {
      "indent": 6,
      "text": "+=================+=======================================+\n| SUB-OPTION CODE |     SUB-OPTION DESCRIPTION            |\n+=================+=======================================+\n|       13        | Access-Technology-Type Sub-option     |\n+=========================================================+\n|       14        | Access-Network-Name Sub-option        |\n+=========================================================+\n|       15        | Access-Point-Name Sub-option          |\n+=========================================================+\n|       16        | Access-Point-BSSID Sub-option         |\n+=========================================================+\n|       17        | Operator-Identifier Sub-option        |\n+=========================================================+\n|       18        | Operator-Realm Sub-option             |\n+=========================================================+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "IANA has assigned option codes for the following DHCPv6 options from the \"Option Codes\" registry for DHCPv6, <http://www.iana.org/assignments/dhcpv6-parameters>, as specified in [RFC3315]:",
      "ja": "IANAは[RFC3315]で指定されるように、DHCPv6の「オプション・コード」レジストリ、<http://www.iana.org/assignments/dhcpv6-parameters>から次のDHCPv6のオプションのためのオプションコードを割り当てています："
    },
    {
      "indent": 6,
      "text": "+=================+=======================================+\n|   OPTION CODE   |      OPTION DESCRIPTION               |\n+=================+=======================================+\n|       105       | OPTION_ANI_ATT                        |\n+=========================================================+\n|       106       | OPTION_ANI_NETWORK_NAME               |\n+=========================================================+\n|       107       | OPTION_ANI_AP_NAME                    |\n+=========================================================+\n|       108       | OPTION_ANI_AP_BSSID                   |\n+=========================================================+\n|       109       | OPTION_ANI_OPERATOR_ID                |\n+=========================================================+\n|       110       | OPTION_ANI_OPERATOR_REALM             |\n+=========================================================+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Since there is no privacy protection for DHCP messages, an eavesdropper who can monitor the link between the DHCP server and relay agent can discover access-network information.",
      "ja": "DHCPメッセージのためのプライバシー保護がないため、DHCPサーバとリレーエージェントとの間のリンクを監視することができ、盗聴者は、アクセス・ネットワーク情報を発見することができます。"
    },
    {
      "indent": 3,
      "text": "[RFC3118] and [RFC3315] describe many of the threats in using DHCP. [RFC3118] and [RFC3315] each provide a solution; the Authentication Option for DHCPv4 and DHCPv6 (respectively). However, neither of these options are in active use and therefore are not a viable mitigation option. DHCP itself is inherently insecure and thus link-layer confidentiality and integrity protection SHOULD be employed to reduce the risk of disclosure and tampering.",
      "ja": "[RFC3118]と[RFC3315]はDHCPを使用して脅威の多くを説明します。 [RFC3118]及び[RFC3315]の各ソリューションを提供します。 DHCPv4とDHCPv6の認証オプション（それぞれ）。しかし、これらのオプションのどちらがアクティブに使用されているので、実行可能な緩和オプションではありません。 DHCP自体は、このように本質的に安全とリンク層の機密性と完全性の保護が開示や改ざんのリスクを軽減するために使用されるべきです。"
    },
    {
      "indent": 3,
      "text": "It is possible for a rogue DHCP relay agent to insert or overwrite with incorrect Access-Network-Identifier options for malicious purposes. A DHCP client can also pose as a rogue DHCP relay agent by sending incorrect Access-Network-Identifier options. While the introduction of fraudulent DHCP relay agent information options can be prevented by a perimeter defense that blocks these options unless the DHCP relay agent is trusted, a deeper defense using the authentication sub-option for the DHCPv4 Relay-Agent-Information Option [RFC4030] SHOULD be deployed as well. Administrators SHOULD configure DHCP servers that use this option to communicate with their relay agents using IPsec, as described in Section 21.1 of [RFC3315].",
      "ja": "不正なDHCPリレーエージェントが挿入または悪意のある目的のために、誤ったアクセス・ネットワーク識別子のオプションで上書きすることが可能です。 DHCPクライアントは、不正なアクセス・ネットワーク識別子のオプションを送信することにより、不正なDHCPリレーエージェントとして提起することができます。不正DHCPリレーエージェント情報オプションの導入をブロック、これらのオプションは、DHCPリレーエージェントが信頼されない限り、という境界防御で防ぐことができますが、DHCPv4のリレーエージェント情報オプションの認証サブオプションを使用して、より深い防衛[RFC4030]同様に展開する必要があります。管理者は、[RFC3315]のセクション21.1で説明したように、IPsecを使用してリレーエージェントと通信するには、このオプションを使用してDHCPサーバを設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "The information elements that this document is exposing are the client's access-network information. These pertain to the access network to which the client is attached, such as Access-Technology Type (e.g., WLAN, Ethernet, etc.), Access-Point Identity (Name, BSSID), and Operator-Identifier and Operator-Realm. In deployments where this information cannot be secured using IPsec [RFC4301] or other security protocols, administrators SHOULD disable the capability specified in this document on the DHCP entities.",
      "ja": "この文書が公開している情報要素は、クライアントのアクセス・ネットワーク情報です。これらは、アクセステクノロジータイプ（例えば、WLAN、イーサネット（登録商標）、等）、アクセスポイントアイデンティティ（名前、BSSID）、及びオペレータ識別子とオペレータレルムなどのクライアントが接続されているアクセスネットワーク、に関する。この情報は、IPsecの[RFC4301]、または他のセキュリティプロトコルを使用して保護することができない展開では、管理者がDHCPエンティティに、この文書で指定された機能を無効にする必要があります。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2131] Droms, R., \"Dynamic Host Configuration Protocol\", RFC 2131, DOI 10.17487/RFC2131, March 1997, <http://www.rfc-editor.org/info/rfc2131>.",
      "ja": "[RFC2131] Droms、R.、 \"動的ホスト構成プロトコル\"、RFC 2131、DOI 10.17487 / RFC2131、1997年3月、<http://www.rfc-editor.org/info/rfc2131>。"
    },
    {
      "indent": 3,
      "text": "[RFC3046] Patrick, M., \"DHCP Relay Agent Information Option\", RFC 3046, DOI 10.17487/RFC3046, January 2001, <http://www.rfc-editor.org/info/rfc3046>.",
      "ja": "[RFC3046]パトリック、M.、 \"DHCPリレーエージェント情報オプション\"、RFC 3046、DOI 10.17487 / RFC3046、2001年1月、<http://www.rfc-editor.org/info/rfc3046>。"
    },
    {
      "indent": 3,
      "text": "[RFC3315] Droms, R., Ed., Bound, J., Volz, B., Lemon, T., Perkins, C., and M. Carney, \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\", RFC 3315, DOI 10.17487/RFC3315, July 2003, <http://www.rfc-editor.org/info/rfc3315>.",
      "ja": "[RFC3315] Droms、R.、編、バウンド、J.、フォルツ、B.、レモン、T.、パーキンス、C.、およびM.カーニー、 \"IPv6のための動的ホスト構成プロトコル（DHCPv6）\"、RFC 3315 、DOI 10.17487 / RFC3315、2003年7月、<http://www.rfc-editor.org/info/rfc3315>。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[ANI] \"Interoperability Specification (IOS) for High Rate Packet Data (HRPD) Radio Access Network Interfaces with Session Control in the Access Network\", 3GPP2 A.S0008-C v4.0, April 2011.",
      "ja": "[ANI]「アクセスネットワークにおけるセッション制御と高速パケットデータ（HRPD）無線アクセスネットワークインタフェースのための相互運用性仕様（IOS）」、3GPP2 A.S0008-C v4.0の、2011年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC3118] Droms, R., Ed. and W. Arbaugh, Ed., \"Authentication for DHCP Messages\", RFC 3118, DOI 10.17487/RFC3118, June 2001, <http://www.rfc-editor.org/info/rfc3118>.",
      "ja": "[RFC3118] Droms、R.、エド。そしてW. Arbaugh、エド。、 \"DHCPメッセージの認証\"、RFC 3118、DOI 10.17487 / RFC3118、2001年6月、<http://www.rfc-editor.org/info/rfc3118>。"
    },
    {
      "indent": 3,
      "text": "[RFC3629] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, DOI 10.17487/RFC3629, November 2003, <http://www.rfc-editor.org/info/rfc3629>.",
      "ja": "[RFC3629] Yergeau、F.、 \"UTF-8、ISO 10646の変換フォーマット\"、STD 63、RFC 3629、DOI 10.17487 / RFC3629、2003年11月、<http://www.rfc-editor.org/info/ RFC3629>。"
    },
    {
      "indent": 3,
      "text": "[RFC4030] Stapp, M. and T. Lemon, \"The Authentication Suboption for the Dynamic Host Configuration Protocol (DHCP) Relay Agent Option\", RFC 4030, DOI 10.17487/RFC4030, March 2005, <http://www.rfc-editor.org/info/rfc4030>.",
      "ja": "[RFC4030]スタップ、M.とT.レモン、 \"認証サブオプション動的ホスト構成プロトコル（DHCP）リレーエージェントオプション\"、RFC 4030、DOI 10.17487 / RFC4030、2005年3月、<のhttp：//www.rfc- editor.org/info/rfc4030>。"
    },
    {
      "indent": 3,
      "text": "[RFC4301] Kent, S. and K. Seo, \"Security Architecture for the Internet Protocol\", RFC 4301, DOI 10.17487/RFC4301, December 2005, <http://www.rfc-editor.org/info/rfc4301>.",
      "ja": "[RFC4301]ケント、S.とK. Seo、 \"インターネットプロトコルのためのセキュリティアーキテクチャ\"、RFC 4301、DOI 10.17487 / RFC4301、2005年12月、<http://www.rfc-editor.org/info/rfc4301>。"
    },
    {
      "indent": 3,
      "text": "[RFC5213] Gundavelli, S., Ed., Leung, K., Devarapalli, V., Chowdhury, K., and B. Patil, \"Proxy Mobile IPv6\", RFC 5213, DOI 10.17487/RFC5213, August 2008, <http://www.rfc-editor.org/info/rfc5213>.",
      "ja": "[RFC5213] Gundavelli、S.編、レオン、K.、Devarapalli、V.、チョードリ、K.、およびB.パティル、 \"プロキシ・モバイルIPv6\"、RFC 5213、DOI 10.17487 / RFC5213、2008年8月、<HTTP ：//www.rfc-editor.org/info/rfc5213>。"
    },
    {
      "indent": 3,
      "text": "[RFC5844] Wakikawa, R. and S. Gundavelli, \"IPv4 Support for Proxy Mobile IPv6\", RFC 5844, DOI 10.17487/RFC5844, May 2010, <http://www.rfc-editor.org/info/rfc5844>.",
      "ja": "[RFC5844] Wakikawa、R.およびS. Gundavelli、 \"プロキシモバイルIPv6のIPv4サポート\"、RFC 5844、DOI 10.17487 / RFC5844、2010年5月、<http://www.rfc-editor.org/info/rfc5844>。"
    },
    {
      "indent": 3,
      "text": "[RFC6757] Gundavelli, S., Ed., Korhonen, J., Ed., Grayson, M., Leung, K., and R. Pazhyannur, \"Access Network Identifier (ANI) Option for Proxy Mobile IPv6\", RFC 6757, DOI 10.17487/RFC6757, October 2012, <http://www.rfc-editor.org/info/rfc6757>.",
      "ja": "[RFC6757] Gundavelli、S.編、Korhonen、J.、編、グレイゾン、M.、レオン、K.、およびR. Pazhyannur、 \"プロキシモバイルIPv6のアクセスネットワーク識別子（ANI）オプション\"、RFC 6757 、DOI 10.17487 / RFC6757、2012年10月、<http://www.rfc-editor.org/info/rfc6757>。"
    },
    {
      "indent": 3,
      "text": "[RFC6991] Schoenwaelder, J., Ed., \"Common YANG Data Types\", RFC 6991, DOI 10.17487/RFC6991, July 2013, <http://www.rfc-editor.org/info/rfc6991>.",
      "ja": "[RFC6991] Schoenwaelder、J.、エド。、 \"共通YANGデータ型\"、RFC 6991、DOI 10.17487 / RFC6991、2013年7月、<http://www.rfc-editor.org/info/rfc6991>。"
    },
    {
      "indent": 3,
      "text": "[SMI] IANA, \"PRIVATE ENTERPRISE NUMBERS, SMI Network Management Private Enterprise Codes\", March 2016, <https://www.iana.org/assignments/enterprise-numbers>.",
      "ja": "[SMI] IANA、 \"民間企業番号、SMIネットワークマネージメント私企業コード\"、2016年3月、<https://www.iana.org/assignments/enterprise-numbers>。"
    },
    {
      "indent": 3,
      "text": "[TS23003] 3GPP, \"Numbering, addressing and identification\", 3GPP TS 23.003 13.4.0, December 2015.",
      "ja": "【TS23003] 3GPP、 \"ナンバリング、アドレッシングおよび識別\"、3GPP TS 23.003 13.4.0、2015年12月。"
    },
    {
      "indent": 3,
      "text": "[TS23203] 3GPP, \"Policy and charging control architecture\", 3GPP TS 23.203 13.6.0, December 2015.",
      "ja": "[TS23203] 3GPP、 \"ポリシーおよび課金制御アーキテクチャ\"、3GPP TS 23.203 13.6.0、2015年12月。"
    },
    {
      "indent": 3,
      "text": "[TS23402] 3GPP, \"Architecture enhancements for non-3GPP accesses\", 3GPP TS 23.402 13.4.0, December 2015.",
      "ja": "[TS23402] 3GPP、 \"非3GPPのためのアーキテクチャの拡張アクセス\"、3GPP TS 23.402 13.4.0、2015年12月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Kim Kinnear, Ted Lemon, Gaurav Halwasia, Hidetoshi Yokota, Sheng Jiang, and Francis Dupont for their valuable input. Also, thank you to Tomek Mrugalski for a thorough review of the document.",
      "ja": "著者は、彼らの貴重な入力のためにキム・キニア、テッド・レモン、のGaurav Halwasia、横田英俊、シェン・ジャン、フランシスデュポンに感謝したいと思います。また、文書の徹底的なレビューのためにTomek Mrugalskiをお願い致します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Shwetha Bhandari Cisco Systems Cessna Business Park, Sarjapura Marathalli Outer Ring Road Bangalore, KARNATAKA 560 087 India",
      "ja": "Shwetaさんバンダリシスコシステムズcesnaビジネスパーク、marathalliサリヤプール外環状道路、カルナータカ州バンガロール560 087インド"
    },
    {
      "indent": 3,
      "text": "Phone: +91 80 4426 0474 Email: shwethab@cisco.com",
      "ja": "電話：+91 80 4426 0474 Eメール：shwethab@cisco.com"
    },
    {
      "indent": 3,
      "text": "Sri Gundavelli Cisco Systems 170 West Tasman Drive San Jose, CA 95134 United States",
      "ja": "スリGundavelliシスコシステムズ170西タスマン・ドライブサンノゼ、CA 95134米国"
    },
    {
      "indent": 3,
      "text": "Email: sgundave@cisco.com",
      "ja": "メール：sgundave@cisco.com"
    },
    {
      "indent": 3,
      "text": "Mark Grayson Cisco Systems 11 New Square Park Bedfont Lakes, FELTHAM TW14 8HA England",
      "ja": "マーク・グレイソンシスコシステムズ11新スクエアパークBedfont湖、フェルサムTW14 8HAイングランド"
    },
    {
      "indent": 3,
      "text": "Email: mgrayson@cisco.com",
      "ja": "メール：mgrayson@cisco.com"
    },
    {
      "indent": 3,
      "text": "Bernie Volz Cisco Systems 1414 Massachusetts Ave Boxborough, MA 01719 United States",
      "ja": "バーニーフォルツシスコシステムズ1414年マサチューセッツアベニューボックスボロー、MA 01719米国"
    },
    {
      "indent": 3,
      "text": "Email: volz@cisco.com",
      "ja": "メール：volz@cisco.com"
    },
    {
      "indent": 3,
      "text": "Jouni Korhonen Broadcom Limited 3151 Zanker Rd San Jose, CA 95134 United States",
      "ja": "Jouni Korhonenブロードコムリミテッド3151 Zanker Rdのサンノゼ、CA 95134米国"
    },
    {
      "indent": 3,
      "text": "Email: jouni.nospam@gmail.com",
      "ja": "メール：jouni.nospam@gmail.com"
    }
  ]
}