{
  "title": {
    "text": "RFC 7111 - URI Fragment Identifiers for the text/csv Media Type",
    "ja": "RFC 7111 - テキスト/ CSV形式のメディアタイプのためのURIのフラグメント識別子"
  },
  "number": 7111,
  "created_at": "2019-10-28 18:02:11.547390+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                     M. Hausenblas\nRequest for Comments: 7111                             MapR Technologies\nUpdates: 4180                                                   E. Wilde\nCategory: Informational                                      UC Berkeley\nISSN: 2070-1721                                              J. Tennison\n                                                     Open Data Institute\n                                                            January 2014",
      "raw": true
    },
    {
      "indent": 10,
      "text": "URI Fragment Identifiers for the text/csv Media Type",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines URI fragment identifiers for text/csv MIME entities. These fragment identifiers make it possible to refer to parts of a text/csv MIME entity identified by row, column, or cell. Fragment identification can use single items or ranges.",
      "ja": "このメモは、テキスト/ CSV形式のMIMEエンティティのURIのフラグメント識別子を定義します。これらのフラグメント識別子は、行、列、またはセルにより識別されたテキスト/ CSV形式のMIMEエンティティの部分を参照することを可能にします。断片の同定は、単一のアイテムまたは範囲を使用することができます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "これは、独立して、他のRFCストリームの、RFCシリーズへの貢献です。 RFC Editorはその裁量でこの文書を公開することを選択し、実装や展開のためにその値についての声明を出すていません。 RFC編集者によって公表のために承認されたドキュメントは、インターネット標準の任意のレベルの候補ではありません。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7111.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7111で取得することができます。"
    },
    {
      "indent": 0,
      "text": "IESG Note",
      "ja": "IESG注意"
    },
    {
      "indent": 3,
      "text": "The change to the text/csv media type registration requires IESG approval, as the IESG is the change controller for that registration. The IESG has, after consultation with the IETF community, approved the change, which is specified in Section 5 of this document.",
      "ja": "IESGは、その登録の変更制御装置であるとしてテキスト/ CSV形式のメディアタイプ登録への変更は、IESGの承認を必要とします。 IESGは、IETFコミュニティと協議した後、このドキュメントのセクション5で指定された変更を、承認しました。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  What is text/csv? . . . . . . . . . . . . . . . . . . . .   3\n  1.2.  Why text/csv Fragment Identifiers?  . . . . . . . . . . .   3\n    1.2.1.  Motivation  . . . . . . . . . . . . . . . . . . . . .   3\n    1.2.2.  Use Cases . . . . . . . . . . . . . . . . . . . . . .   4\n  1.3.  Incremental Deployment  . . . . . . . . . . . . . . . . .   4\n  1.4.  Notation Used in this Memo  . . . . . . . . . . . . . . .   4\n2.  Fragment Identification Methods . . . . . . . . . . . . . . .   5\n  2.1.  Row-Based Selection . . . . . . . . . . . . . . . . . . .   5\n  2.2.  Column-Based Selection  . . . . . . . . . . . . . . . . .   6\n  2.3.  Cell-Based Selection  . . . . . . . . . . . . . . . . . .   6\n  2.4.  Multi-Selections  . . . . . . . . . . . . . . . . . . . .   7\n3.  Fragment Identification Syntax  . . . . . . . . . . . . . . .   7\n4.  Fragment Identifier Processing  . . . . . . . . . . . . . . .   8\n  4.1.  Syntax Errors in Fragment Identifiers . . . . . . . . . .   8\n  4.2.  Semantics of Fragment Identifiers . . . . . . . . . . . .   8\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   9\n  5.1.  The text/csv media type . . . . . . . . . . . . . . . . .   9\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .  11\n7.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  11\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  11\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . .  11\n  8.2.  Informative References  . . . . . . . . . . . . . . . . .  12",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This memo updates the text/csv media type defined in RFC 4180 [RFC4180] by defining URI fragment identifiers for text/csv MIME entities.",
      "ja": "このメモは、テキスト/ CSV形式のMIMEエンティティのURIフラグメント識別子を定義することによって、RFC 4180 [RFC4180]で定義されたテキスト/ CSV形式のメディアタイプを更新します。"
    },
    {
      "indent": 3,
      "text": "The change to the text/csv media type registration required IESG approval, as the IESG is the change controller for that registration. The IESG has, after consultation with the IETF community, approved the change, which is specified in Section 5 of this document.",
      "ja": "IESGは、その登録の変更制御装置であるとしてテキスト/ CSV形式のメディアタイプ登録への変更は、IESGの承認を必要としていました。 IESGは、IETFコミュニティと協議した後、このドキュメントのセクション5で指定された変更を、承認しました。"
    },
    {
      "indent": 3,
      "text": "This section gives an introduction to the general concepts of text/csv MIME entities and URI fragment identifiers and discusses the need for fragment identifiers for text/csv and deployment issues. Section 2 discusses the principles and methods on which this memo is based. Section 3 defines the syntax, and Section 4 discusses processing of text/csv fragment identifiers.",
      "ja": "このセクションでは、テキスト/ CSV形式のMIMEエンティティとURIのフラグメント識別子の一般的な概念を紹介していますし、テキスト/ CSVと展開の問題のためのフラグメント識別子の必要性を論じています。第2節では、このメモの基礎となる原則と方法について説明します。セクション3は、構文を定義し、第4節では、テキスト/ CSVフラグメント識別子の処理について論じています。"
    },
    {
      "indent": 0,
      "text": "1.1. What is text/csv?",
      "section_title": true,
      "ja": "1.1. テキスト/ CSVファイルとは何ですか？"
    },
    {
      "indent": 3,
      "text": "Internet Media Types (often referred to as \"MIME types\") as defined in RFC 2045 [RFC2045] and RFC 2046 [RFC2046] are used to identify different types and subtypes of media. The text/csv media type is defined in RFC 4180 [RFC4180], using US-ASCII [ASCII] as the default character encoding (other character encodings can be used as well). Apart from a media type parameter for specifying the character encoding (\"charset\"), there is a second media type parameter (\"header\") that indicates whether there is a header row in the CSV document or not.",
      "ja": "RFC 2045 [RFC2045]及びRFC 2046 [RFC2046]で定義されるように（しばしば「MIMEタイプ」と呼ぶ）は、インターネットメディアタイプは、異なるタイプとメディアのサブタイプを同定するために使用されます。テキスト/ CSV形式のメディアタイプがデフォルトの文字エンコーディング（他の文字エンコーディングを使用することもできる）としてUS-ASCII [ASCII]を使用して、[RFC4180] RFC 4180で定義されています。別に文字エンコーディング（「文字セット」）を指定するためのメディアタイプパラメータから、そこにヘッダー行は、CSV形式の文書であるか否かを示す第2のメディアタイプパラメータ（「ヘッダ」）があります。"
    },
    {
      "indent": 0,
      "text": "1.2. Why text/csv Fragment Identifiers?",
      "section_title": true,
      "ja": "1.2. なぜテキスト/フラグメント識別子をCSV？"
    },
    {
      "indent": 3,
      "text": "URIs are the identification mechanism for resources on the Web. The URI syntax specified in RFC 3986 [RFC3986] optionally includes a so-called \"fragment identifier\", separated by a number sign (\"#\"). The fragment identifier consists of additional reference information to be interpreted by the client after the retrieval action has been successfully completed. The semantics of a fragment identifier is a property of the media type resulting from a retrieval action, regardless of the URI scheme used in the URI reference. Therefore, the format and interpretation of fragment identifiers is dependent on the media type of the retrieval result.",
      "ja": "URIは、Web上のリソースの識別メカニズムです。 RFC 3986 [RFC3986]で指定されたURIの構文は、任意の数の記号（「＃」）によって分離いわゆる「フラグメント識別子」を含みます。フラグメント識別子は、検索アクションが正常に完了した後、クライアントによって解釈されるべき追加の参照情報から成ります。フラグメント識別子の意味は関係なく、URI参照に使用されるURI方式の、検索行動から生じるメディアタイプの特性です。したがって、フラグメント識別子のフォーマット及び解釈は、検索結果のメディアタイプに依存しています。"
    },
    {
      "indent": 0,
      "text": "1.2.1. Motivation",
      "section_title": true,
      "ja": "1.2.1. 動機"
    },
    {
      "indent": 3,
      "text": "Similar to the motivation in RFC 5147 [RFC5147], which defines fragment identifiers for plain text files, referring to specific parts of a resource can be very useful because it enables users and applications to create more specific references. Users can create references to a particular point of interest within a resource, rather than referring to the complete resource. Even though it is suggested that fragment identification methods are specified in a media type's registration (see [RFC6838]), many media types do not have fragment identification methods associated with them.",
      "ja": "それは、より具体的な参照を作成するユーザとアプリケーションを可能にするために非常に有用であることができるリソースの特定の部分を参照して、プレーンテキストファイルの断片識別子を定義するRFC 5147 [RFC5147]にモチベーションと同様。ユーザーは、むしろ完全なリソースを参照するよりも、リソース内の関心の特定のポイントへの参照を作成することができます。それは、フラグメント識別方法は、メディアタイプの登録で指定されていることが示唆されていますが、それらに関連付けられ、多くのメディアタイプを持たないフラグメントの識別方法（[RFC6838]を参照してください）。"
    },
    {
      "indent": 3,
      "text": "Fragment identifiers are only useful if supported by the client, because they are only interpreted by the client. Therefore, a new fragment identification method will require some time to be adopted by clients, and older clients will not support it. However, because the URI still works even if the fragment identifier is not supported (the resource is retrieved, but the fragment identifier is not interpreted), rapid adoption is not highly critical to ensure the success of a new fragment identification method.",
      "ja": "クライアントでサポートされている場合、彼らは、クライアントのみによって解釈されるため、フラグメント識別子は、のみ有用です。そのため、新しいフラグメントの識別方法は、クライアントが採用されるようにいくつかの時間が必要になりますし、古いクライアントはそれをサポートしていません。 URIは、依然として（リソースが検索されるが、断片識別子は解釈されない）フラグメント識別子がサポートされていない場合でも動作するためしかし、急速な普及は、新しいフラグメントの識別方法の成功を確実にするために非常に重要ではありません。"
    },
    {
      "indent": 0,
      "text": "1.2.2. Use Cases",
      "section_title": true,
      "ja": "1.2.2. ユースケース"
    },
    {
      "indent": 3,
      "text": "Fragment identifiers for text/csv as defined in this memo make it possible to refer to specific parts of a text/csv MIME entity. Use cases include, but are not limited to, selecting a part for visual rendering, stream processing, making assertions about a certain value (provenance, confidence, comments, etc.), or data integration.",
      "ja": "このメモで定義されたテキスト/ CSVのためのフラグメント識別子は、テキスト/ CSV形式のMIMEエンティティの特定の部分を参照することを可能にします。ユースケースとしては、一定値（出所、信頼、コメントなど）、またはデータ統合に関するアサーションを作り、視覚的レンダリング、ストリーム処理のための部品を選択するが、これらに限定されません。"
    },
    {
      "indent": 0,
      "text": "1.3. Incremental Deployment",
      "section_title": true,
      "ja": "1.3. インクリメンタル展開"
    },
    {
      "indent": 3,
      "text": "As long as text/csv fragment identifiers are not supported universally, it is important to consider the implications of incremental deployment. Clients (for example, Web browsers) not supporting the text/csv fragment identifier described in this memo will work with URI references to text/csv MIME entities, but they will fail to understand the identification of the sub-resource specified by the fragment identifier, and thus will behave as if the complete resource was referenced. This is a reasonable fallback behavior and, in general users, should take into account the possibility that a program interpreting a given URI will fail to interpret the fragment identifier part. Since fragment identifier evaluation is local to the client (and happens after retrieving the MIME entity), there is no reliable way for a server to determine whether a requesting client is using a URI containing a fragment identifier.",
      "ja": "限りテキスト/ CSV形式のフラグメント識別子は、普遍的サポートされていないとして、増分展開の影響を考慮することが重要です。クライアント（例えば、Webブラウザ）テキスト/ CSV形式のMIMEエンティティへのURI参照で動作します。このメモで記述されたテキスト/ CSV形式のフラグメント識別子をサポートしているが、それらは、フラグメント識別子で指定されたサブリソースの識別を理解するために失敗しますありません完全なリソースが参照されていたかのように、これにより動作します。これは、合理的なフォールバック動作であり、一般ユーザーには、アカウントに指定されたURIを解釈するプログラムは、フラグメント識別子の一部を解釈するために失敗する可能性を取る必要があります。フラグメント識別子の評価がクライアントにローカルである（及びMIME実体を検索した後に起こる）ので、サーバは要求しているクライアントは、フラグメント識別子を含むURIを使用しているかどうかを決定するための信頼できる方法がありません。"
    },
    {
      "indent": 0,
      "text": "1.4. Notation Used in this Memo",
      "section_title": true,
      "ja": "1.4. このメモで使用される表記"
    },
    {
      "indent": 3,
      "text": "The capitalized key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書に記載されている大文字のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"オプション\" RFC 2119 [RFC2119]に記載されているように解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "2. Fragment Identification Methods",
      "section_title": true,
      "ja": "2.フラグメントの識別方法"
    },
    {
      "indent": 3,
      "text": "This memo specifies fragment identification using the following methods: \"row\" for row selections, \"col\" for columns selections, and \"cell\" for cell selections.",
      "ja": "このメモは、以下の方法を使用して、断片識別を指定する：細胞の選択のための行選択のための「行」、カラム選択のための「COL」、および「セル」。"
    },
    {
      "indent": 3,
      "text": "Throughout the sections below, the following example table in CSV (having 7 rows, including one header row, and 3 columns) is used:",
      "ja": "以下のセクションを通して、CSV（1つのヘッダ行を含む7行、3列を有する）で、次の例の表が使用されます。"
    },
    {
      "indent": 3,
      "text": "date,temperature,place 2011-01-01,1,Galway 2011-01-02,-1,Galway 2011-01-03,0,Galway 2011-01-01,6,Berkeley 2011-01-02,8,Berkeley 2011-01-03,5,Berkeley",
      "ja": "日付、温度、2011-01-01,1、ゴールウェイ2011-01-02、-1、ゴールウェイ2011-01-03,0、ゴールウェイ2011-01-01,6、バークレー2011-01-02,8を配置バークレー2011-01-03,5、バークレー"
    },
    {
      "indent": 0,
      "text": "2.1. Row-Based Selection",
      "section_title": true,
      "ja": "2.1. 行ベースの選択"
    },
    {
      "indent": 3,
      "text": "To select a specific record, the \"row\" scheme followed by a single number is used (the first row is at position 1).",
      "ja": "特定のレコードを選択するために、単一の数字が続く「行」方式が使用される（最初の行は、位置1にあります）。"
    },
    {
      "indent": 3,
      "text": "http://example.com/data.csv#row=4",
      "ja": "ｈっｔｐ：／／えぁｍｐぇ。こｍ／だた。ｃｓｖ＃ろｗ＝４"
    },
    {
      "indent": 3,
      "text": "The above CSV fragment identifies the fourth row:",
      "ja": "CSV断片上記第四の行を識別する。"
    },
    {
      "indent": 3,
      "text": "2011-01-03,0,Galway",
      "ja": "2011-01-03,0、ゴールウェイ"
    },
    {
      "indent": 3,
      "text": "Fragments can also select ranges of rows:",
      "ja": "フラグメントはまた、行の範囲を選択することができます。"
    },
    {
      "indent": 3,
      "text": "http://example.com/data.csv#row=5-7",
      "ja": "ｈっｔｐ：／／えぁｍｐぇ。こｍ／だた。ｃｓｖ＃ろｗ＝５ー７"
    },
    {
      "indent": 3,
      "text": "The above CSV fragment identifies three consecutive rows:",
      "ja": "上記CSVフラグメントは三つの連続行を識別する。"
    },
    {
      "indent": 3,
      "text": "2011-01-01,6,Berkeley 2011-01-02,8,Berkeley 2011-01-03,5,Berkeley",
      "ja": "2011-01-01,6、バークレー2011-01-02,8、バークレー2011-01-03,5、バークレー"
    },
    {
      "indent": 3,
      "text": "The value \"*\" can be used to indicate the last row, so the previous URI is equivalent to:",
      "ja": "値は「*」最後の行を示すために使用することができるので、前のURIは以下と等価です。"
    },
    {
      "indent": 3,
      "text": "http://example.com/data.csv#row=5-*",
      "ja": "ｈっｔｐ：／／えぁｍｐぇ。こｍ／だた。ｃｓｖ＃ろｗ＝５ー＊"
    },
    {
      "indent": 0,
      "text": "2.2. Column-Based Selection",
      "section_title": true,
      "ja": "2.2. 列ベースの選択"
    },
    {
      "indent": 3,
      "text": "To select values from a certain column, the \"col\" scheme is used, followed by a position (the first column is at position 1):",
      "ja": "特定の列の値を選択するために、「COL」方式は、位置、続いて使用される（最初の列は位置1にあります）。"
    },
    {
      "indent": 3,
      "text": "http://example.com/data.csv#col=2",
      "ja": "ｈっｔｐ：／／えぁｍｐぇ。こｍ／だた。ｃｓｖ＃こｌ＝２"
    },
    {
      "indent": 3,
      "text": "The above CSV fragment addresses the second column, identifying the column:",
      "ja": "上記CSV断片列を識別する、第二カラムに対処します。"
    },
    {
      "indent": 3,
      "text": "temperature 1 -1 0 6 8 5",
      "ja": "温度1 -1 0 6 8 5"
    },
    {
      "indent": 3,
      "text": "The \"col\" scheme can also be used to identify ranges of columns:",
      "ja": "「COL」方式は、列の範囲を特定するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "http://example.com/data.csv#col=1-2",
      "ja": "ｈっｔｐ：／／えぁｍｐぇ。こｍ／だた。ｃｓｖ＃こｌ＝１ー２"
    },
    {
      "indent": 3,
      "text": "The above CSV fragment addresses the first and second column:",
      "ja": "上記CSV断片は、第一及び第二のカラムに対処します。"
    },
    {
      "indent": 3,
      "text": "date,temperature 2011-01-01,1 2011-01-02,-1 2011-01-03,0 2011-01-01,6 2011-01-02,8 2011-01-03,5",
      "ja": "日付、温度2011-01-01,1 2011-01-02、-1 2011-01-03,0 2011-01-01,6 2011-01-02,8 2011-01-03,5"
    },
    {
      "indent": 3,
      "text": "As for rows, the value \"*\" can be used to indicate the last column.",
      "ja": "行については、値は「*」最後の列を示すために使用することができます。"
    },
    {
      "indent": 0,
      "text": "2.3. Cell-Based Selection",
      "section_title": true,
      "ja": "2.3. 細胞ベースの選択"
    },
    {
      "indent": 3,
      "text": "To select particular fields, the \"cell\" scheme is used, followed by a row number, a comma, and a column number.",
      "ja": "特定のフィールドを選択するために、「セル」方式は、行番号、コンマ、および列番号、続いて使用されます。"
    },
    {
      "indent": 3,
      "text": "http://example.com/data.csv#cell=4,1",
      "ja": "ｈっｔｐ：／／えぁｍｐぇ。こｍ／だた。ｃｓｖ＃せっｌ＝４、１"
    },
    {
      "indent": 3,
      "text": "The above CSV fragment addresses the field in the first column within the fourth row, yielding:",
      "ja": "上記CSV断片を得、4行以内に最初の列のフィールドに対処します。"
    },
    {
      "indent": 3,
      "text": "2011-01-03",
      "ja": "２０１１ー０１ー０３"
    },
    {
      "indent": 3,
      "text": "It is also possible to select cell-based fragments that have more than just one cell, in which case the cell selection uses the same range syntax as for row and column range selections. For these selections, the syntax uses the upper left-hand cell as the starting point of the selection, followed by a minus sign, and then the lower right-hand cell as the end point of the selection.",
      "ja": "セル選択が行および列範囲の選択と同じ範囲の構文を使用する場合にはただ一つのセルが複数ある細胞ベースの断片を、選択することも可能です。これらの選択のために、構文は、選択範囲の終点としてマイナス記号に続く選択の出発点として左上のセルと、次に右下のセルを使用します。"
    },
    {
      "indent": 3,
      "text": "http://example.com/data.csv#cell=4,1-6,2",
      "ja": "ｈっｔｐ：／／えぁｍｐぇ。こｍ／だた。ｃｓｖ＃せっｌ＝４、１ー６、２"
    },
    {
      "indent": 3,
      "text": "The above CSV fragment selects a region that starts at the fourth row and the first column and ends at the sixth row and the second column:",
      "ja": "CSVフラグメント上述した第4行1列から始まり、6行2列で終了する領域を選択します。"
    },
    {
      "indent": 3,
      "text": "2011-01-03,0 2011-01-01,6 2011-01-02,8",
      "ja": "２０１１ー０１ー０３、０ ２０１１ー０１ー０１、６ ２０１１ー０１ー０２、８"
    },
    {
      "indent": 0,
      "text": "2.4. Multi-Selections",
      "section_title": true,
      "ja": "2.4. マルチ選択"
    },
    {
      "indent": 3,
      "text": "Row, column, and cell selections can make more than one selection, in which case the individual selections are separated by semicolons. In these cases, the resulting fragment may be a disjoint fragment, such as the selection \"#row=3;6\" for the example CSV, which would select the third and the sixth row. It is up to the user agent to decide how to handle disjoint fragments, but since they are allowed, user agents should be prepared to handle disjoint fragments.",
      "ja": "行、列、およびセルの選択は、個々の選択がセミコロンで区切られている場合には、複数の選択を行うことができます。例えばCSVのため、3番目と6番目の行を選択するであろう。これらの場合において、得られた断片は、このような選択「6＃行= 3」のようにばらばらの断片であってもよいです。これは、ばらばらの断片の処理方法を決定するために、ユーザエージェント次第ですが、それらが許可されているため、ユーザエージェントは、ばらばらの断片を処理するために準備しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3. Fragment Identification Syntax",
      "section_title": true,
      "ja": "3.断片の同定構文"
    },
    {
      "indent": 3,
      "text": "The syntax for the text/csv fragment identifiers is as follows.",
      "ja": "次のようにテキスト/ CSV形式のフラグメント識別子の構文は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "The following syntax definition uses ABNF as defined in RFC 5234 [RFC5234], including the rule DIGIT.",
      "ja": "ルールDIGIT含む、RFC 5234 [RFC5234]で定義されるように、次の構文定義はABNFを使用します。"
    },
    {
      "indent": 3,
      "text": "NOTE: In the descriptions that follow, specified text values MUST be used exactly as given, using exactly the indicated lowercase letters. In this respect, the ABNF usage differs from [RFC5234].",
      "ja": "注：与えられた以下の説明では、指定したテキスト値は正確に示された小文字を使用して、正確に使用しなければなりません。この点では、ABNFの使用は[RFC5234]とは異なります。"
    },
    {
      "indent": 3,
      "text": "csv-fragment = rowsel / colsel / cellsel rowsel = \"row=\" singlespec 0*( \";\" singlespec) colsel = \"col=\" singlespec 0*( \";\" singlespec) cellsel = \"cell=\" cellspec 0*( \";\" cellspec) singlespec = position [ \"-\" position ] cellspec = cellrow \",\" cellcol [ \"-\" cellrow \",\" cellcol ] cellrow = position cellcol = position position = number / \"*\" number = 1*( DIGIT )",
      "ja": "CSV-断片= ROWSEL / COLSEL / cellsel ROWSEL = \"行=\" singlespec 0 *（ \";\" singlespec）COLSEL = \"COL =\" singlespec 0 *（ \";\" singlespec）cellsel = \"セル=\" cellspec 0 *（ \" ; \"cellspec）singlespec =ポジション[ \" - \" ポジション] cellspec = cellrow\"、 \"cellcolの[ \" - \" cellrow\"、」cellcol] cellrow =位置cellcol =ポジション位置=数/ \"*\" 数= 1 *（DIGIT）"
    },
    {
      "indent": 0,
      "text": "4. Fragment Identifier Processing",
      "section_title": true,
      "ja": "4.フラグメント識別子処理"
    },
    {
      "indent": 3,
      "text": "Applications implementing support for the mechanism described in this memo MUST behave as described in the following sections.",
      "ja": "次のセクションで説明するように、このメモで説明するメカニズムのサポートを実装するアプリケーションは動作しますしなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1. Syntax Errors in Fragment Identifiers",
      "section_title": true,
      "ja": "4.1. フラグメント識別子の構文エラー"
    },
    {
      "indent": 3,
      "text": "If a fragment identifier contains a syntax error (i.e., does not conform to the syntax specified in Section 3), then it MUST be ignored by clients. Clients MUST NOT make any attempt to correct or guess fragment identifiers. Syntax errors MAY be reported by clients.",
      "ja": "フラグメント識別子（すなわち、セクション3で指定された構文に準拠していない）構文エラーが含まれている場合、それはクライアントによって無視されなければなりません。クライアントは、フラグメント識別子を修正するかを推測しようとする試みをしてはなりません。構文エラーは、クライアントによって報告されてもよいです。"
    },
    {
      "indent": 0,
      "text": "4.2. Semantics of Fragment Identifiers",
      "section_title": true,
      "ja": "4.2. 断片識別子のセマンティクス"
    },
    {
      "indent": 3,
      "text": "Rows and columns in CSV are counted from one. Positions thus refer to the rows and columns starting from position 1, which identifies the first row or column of a CSV. The special character \"*\" can be used to refer to the last row or column of a CSV, thus allowing fragment identifiers to easily identify ranges that extend to the last row or column.",
      "ja": "CSVの行と列は1からカウントされます。位置は、このようにCSVの最初の行または列を識別する位置1から始まる行と列を指します。特殊文字「*」は、このように断片識別子が容易最後の行または列に伸びる範囲を同定することができ、CSVの最後の行または列を参照するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "If single selections refer to non-existing rows or columns (i.e., beyond the size of the CSV), they MUST be ignored.",
      "ja": "単一の選択が存在しない行または列を参照する場合（即ち、CSVのサイズを超えて）、それらを無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If ranges extend beyond the size of the CSV (by extending to rows or columns beyond the size of the CSV), they MUST be interpreted to only extend to the actual size of the CSV.",
      "ja": "範囲は（CSVのサイズを超えて行または列に拡張することによって）CSVのサイズを超えて拡張する場合、それらは、CSVの実際の大きさに延びるように解釈されなければなりません。"
    },
    {
      "indent": 3,
      "text": "If selections of ranges of rows, ranges of columns, or ranges of cells are specified in a way so that they select \"inversely\" (i.e., \"#row=10-5\" or \"#cell=10,10-5,5\"), they MUST be ignored.",
      "ja": "彼らは、「逆」（すなわち、「＃1行= 10 -5」または「＃セル= 10,10-5,5を選択するように、セルの行の範囲の選択、列の範囲、又は範囲は方法で指定された場合「）、それらを無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Each specification of an identified region is processed independently, and ignored specifications (because of reasons listed in the previous paragraphs) do not cause the whole fragment identifier to fail, they just mean that this single specification is ignored. For the example file, the fragment identifier \"#row=1-2;5-4;13-16\" does identify the first two rows: the second specification is an \"inverse\" specification and thus is ignored, and the third specification targets rows beyond the actual size of the CSV and thus is also ignored.",
      "ja": "識別された領域の各仕様は、全フラグメント識別子は失敗しません（理由は、前の段落に記載されている理由を）仕様を独立して処理し、無視され、彼らはこの単一の仕様は無視されることを意味します。例えば、ファイルのため、フラグメント識別子「＃行= 1-2; 5-4 13-16」最初の2行を識別し：第2の仕様は無視され、したがって「逆」仕様であり、そして第三の仕様ターゲットこれCSVの実際のサイズを超える行とも無視されます。"
    },
    {
      "indent": 3,
      "text": "The complete fragment identifier identifies all the successfully evaluated identified parts as a single identified fragment. This fragment can be disjoint because of multiple selections. Multiple selections also can result in overlapping individual parts, and it is up to the user agent how to process such a fragment and whether the individual parts are still made accessible (i.e., visualized in visual user agents) or are presented as one unit. For example, the fragment identifier \"#row=3-6;4-5\" contains a second identified part that is completely contained in the first identified part. Whether a user agent maintains this selection as two parts, or simply signals that the identified fragment spans from the third to the sixth row, is up for the user agent to decide.",
      "ja": "完全なフラグメント識別子は、単一の識別された断片として全て正常に評価同定部品を識別する。この断片は、理由は複数選択でばらばらにすることができます。複数選択は、個々の部品の重複をもたらすことができる、そしてそれはどのようなフラグメントを処理するためにユーザエージェントまでであり、個々の部品がまだアクセス可能にされているかどうか（すなわち、視覚的ユーザエージェントで可視化）、または1つのユニットとして示されています。例えば、フラグメント識別子「＃行= 3-6; 4-5は、」完全に最初に特定部分に含まれている第二の同定一部を含みます。ユーザエージェントは、2つの部分としてこの選択を維持し、または単に識別されたフラグメントが第三から第六の行にまたがることを知らせるかどうかを、決定するユーザエージェントのためのアップです。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has added a reference to this specification in the text/csv media type registration.",
      "ja": "IANAは、テキスト/ CSV形式のメディアタイプ登録に本明細書への参照を追加しました。"
    },
    {
      "indent": 0,
      "text": "5.1. The text/csv media type",
      "section_title": true,
      "ja": "5.1. テキスト/ CSV形式のメディアタイプ"
    },
    {
      "indent": 3,
      "text": "The Internet media type [RFC6838] for a CSV document is text/csv. The following registration has been copied from the original registration of text/csv [RFC4180], with the exception of the added fragment identification considerations and added security considerations for fragment identifiers.",
      "ja": "CSVドキュメントのインターネットメディアタイプ[RFC6838]は、テキスト/ CSV形式です。次の登録が追加断片識別考慮事項を除いて、テキスト/ CSV [RFC4180]の元の登録からコピーされ、フラグメント識別子のセキュリティ上の考慮事項が追加されています。"
    },
    {
      "indent": 3,
      "text": "Type name: text",
      "ja": "型名：テキスト"
    },
    {
      "indent": 3,
      "text": "Subtype name: csv",
      "ja": "サブタイプ名：CSV"
    },
    {
      "indent": 3,
      "text": "Required parameters: none",
      "ja": "必須パラメータ：なし"
    },
    {
      "indent": 3,
      "text": "Optional parameters: charset, header",
      "ja": "オプションのパラメータ：文字セット、ヘッダ"
    },
    {
      "indent": 6,
      "text": "The \"charset\" parameter specifies the charset employed by the CSV content. In accordance with RFC 6657 [RFC6657], the charset parameter SHOULD be used, and if it is not present, UTF-8 SHOULD be assumed as the default (this implies that US-ASCII CSV will work, even when not specifying the \"charset\" parameter). Any charset defined by IANA for the \"text\" tree may be used in conjunction with the \"charset\" parameter.",
      "ja": "「文字セット」パラメータは、CSV形式のコンテンツで採用文字セットを指定します。 RFC 6657に従って[RFC6657]では、charsetパラメータを使用する必要があり、それが存在しない場合、UTF-8は、「文字セットを指定しない場合でも、これはUS-ASCIIのCSVが動作することを意味します（デフォルトとみなされるべきです\"パラメータ）。 「テキスト」木のためにIANAによって定義された任意の文字セットは、「文字セット」パラメータと組み合わせて使用​​することができます。"
    },
    {
      "indent": 6,
      "text": "The \"header\" parameter indicates the presence or absence of the header line. Valid values are \"present\" or \"absent\". Implementors choosing not to use this parameter must make their own decisions as to whether the header line is present or absent.",
      "ja": "「ヘッダ」パラメータは、ヘッダ行の有無を示しています。有効な値は、「現在」または「不在」です。実装者は、ヘッダ行が存在するかしないかどうかについて、独自の意思決定を行う必要があり、このパラメータを使用しないことを選択します。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: CSV MIME entities consist of binary data [RFC6838]. As per Section 4.1.1. of RFC 2046 [RFC2046], this media type uses CRLF to denote line breaks. However, implementers should be aware that some implementations may use other values.",
      "ja": "エンコードの考慮事項：CSV MIMEエンティティは、バイナリデータ[RFC6838]で構成されています。 4.1.1あたりとして。 RFC 2046 [RFC2046]で、このメディアタイプは、改行を表すためにCRLFを使用します。しかし、実装者はいくつかの実装は、他の値を使用する可能性があることに注意する必要があります。"
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "ja": "セキュリティの考慮事項："
    },
    {
      "indent": 6,
      "text": "Text/csv consists of nothing but passive text data that should not pose any direct risks. However, it is possible that malicious data may be included in order to exploit buffer overruns or other bugs in the program processing the text/csv data.",
      "ja": "テキスト/ CSVは何もないが、直接的なリスクをもたらすべきではない受動的なテキストデータで構成されています。しかし、悪意のデータがテキスト/ CSVデータを処理するプログラムでバッファオーバーランや他のバグを利用するために含まれていてもよいことは可能です。"
    },
    {
      "indent": 6,
      "text": "The text/csv format provides no confidentiality or integrity protection, so if such protections are needed, they must be supplied externally.",
      "ja": "テキスト/ csv形式には、機密性や完全性保護を提供していないので、このような保護が必要な場合、彼らは、外部から供給されなければなりません。"
    },
    {
      "indent": 6,
      "text": "The fact that software implementing fragment identifiers for CSV and software not implementing them differs in behavior, and the fact that different software may show documents or fragments to users in different ways, can lead to misunderstandings on the part of users. Such misunderstandings might be exploited in a way similar to spoofing or phishing.",
      "ja": "ソフトウェアは、CSVのためのフラグメント識別子を実装し、ソフトウェアがそれらを実装していないという事実は、行動に異なり、異なるソフトウェアはさまざまな方法でユーザーに文書またはフラグメントを示し得るという事実は、ユーザーの一部に誤解につながることができます。このような誤解は、なりすましやフィッシングと同様の方法で悪用される可能性があります。"
    },
    {
      "indent": 6,
      "text": "Implementers and users of fragment identifiers for CSV text should also be aware of the security considerations in RFC 3986 [RFC3986] and RFC 3987 [RFC3987].",
      "ja": "実装者やCSVテキストのフラグメント識別子のユーザーも、RFC 3986 [RFC3986]およびRFC 3987 [RFC3987]のセキュリティの考慮事項に注意する必要があります。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: Due to lack of a single specification, there are considerable differences among implementations. Implementers should \"be conservative in what you do, be liberal in what you accept from others\" (RFC 793 [RFC0793]) when processing CSV files. An attempt at a common definition can be found in Section 2. Implementations deciding not to use the optional \"header\" parameter must make their own decision as to whether the header is absent or present.",
      "ja": "相互運用性の考慮事項は：により、単一の仕様がないため、実装間にかなりの違いがあります。実装者は、CSVファイルを処理するときに（RFC 793 [RFC0793]）「あなたは他人から受け入れ何でリベラルなこと、あなたが何をすべきかで保守的である」必要があります。共通定義の試みは、オプションの「ヘッダ」パラメータを使用しないように決定する実装はヘッダが存在しないか、あるいは存在しているかどうかについて、自分の決断をしなければならない第2節で見つけることができます。"
    },
    {
      "indent": 3,
      "text": "Published specification: While numerous private specifications exist for various programs and systems, there is no single \"master\" specification for this format. An attempt at a common definition can be found in Section 2 of RFC 4180 [RFC4180].",
      "ja": "公開された仕様：数多くの民間仕様は様々なプログラムやシステムのために存在するが、この形式にはシングル「マスター」仕様ではありません。共通定義の試みは、RFC 4180 [RFC4180]のセクション2に見出すことができます。"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type: Spreadsheet programs and various data conversion utilities.",
      "ja": "スプレッドシートプログラムや各種データ変換ユーティリティ：このメディアタイプを使用するアプリケーション。"
    },
    {
      "indent": 3,
      "text": "Fragment identifier considerations: Fragment identification for text/csv is supported by using fragment identifiers as specified by RFC 7111.",
      "ja": "フラグメント識別子の考慮事項：RFC 7111で指定されたテキスト/ CSVのための断片識別は、フラグメント識別子を使用してサポートされています。"
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "ja": "追加情報："
    },
    {
      "indent": 6,
      "text": "Magic number(s): none",
      "ja": "マジックナンバー（S）：なし"
    },
    {
      "indent": 6,
      "text": "File extension(s): CSV",
      "ja": "ファイルの拡張子（S）：CSV"
    },
    {
      "indent": 6,
      "text": "Macintosh file type code(s): TEXT",
      "ja": "Macintoshのファイルタイプコード（S）：TEXT"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information: Yakov Shafranovich <ietf@shaftek.org> and Erik Wilde <dret@berkeley.edu>",
      "ja": "人と詳細のために連絡する電子メールアドレス：ヤコフShafranovich <ietf@shaftek.org>とエリック・ワイルド<dret@berkeley.edu>"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図している用法：COMMON"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage: none",
      "ja": "使用に関する制限事項：なし"
    },
    {
      "indent": 3,
      "text": "Author: Yakov Shafranovich <ietf@shaftek.org> and Erik Wilde <dret@berkeley.edu>",
      "ja": "著者：ヤコフShafranovich <ietf@shaftek.org>とエリック・ワイルド<dret@berkeley.edu>"
    },
    {
      "indent": 3,
      "text": "Change controller: IESG",
      "ja": "変更コントローラ：IESG"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations for text/csv fragment identifiers are listed in the respective section of the media type registration in Section 5.1.",
      "ja": "テキスト/ CSV形式のフラグメント識別子のためのセキュリティの考慮事項は、セクション5.1でメディアタイプ登録のそれぞれのセクションに記載されています。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks for comments and suggestions provided by Nevil Brownlee, Richard Cyganiak, Ian Davis, Gannon Dick, Leigh Dodds, and Barry Leiba.",
      "ja": "Nevilブラウンリー、リチャード・シガーニアック、イアン・デイビス、ギャノンディック、リー・ドッズ、そしてバリー・レイバが提供する意見やご提案をお寄せいただきありがとうございます。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2045] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "ja": "[RFC2045]解放され、N.とN. Borenstein、 \"マルチパーパスインターネットメールエクステンション（MIME）第一部：インターネットメッセージ本体のフォーマット\"、RFC 2045、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2046] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part Two: Media Types\", RFC 2046, November 1996.",
      "ja": "[RFC2046]解放され、N.とN. Borenstein、 \"マルチパーパスインターネットメールエクステンション（MIME）パート2：メディアタイプ\"、RFC 2046、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3987] Duerst, M. and M. Suignard, \"Internationalized Resource Identifiers (IRIs)\", RFC 3987, January 2005.",
      "ja": "[RFC3987] Duerst、M.およびM. Suignard、 \"国際化リソース識別Fiers（IRI）\"、RFC 3987、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4180] Shafranovich, Y., \"Common Format and MIME Type for Comma-Separated Values (CSV) Files\", RFC 4180, October 2005.",
      "ja": "[RFC4180] Shafranovich、Y.、 \"カンマ区切り値のための共通フォーマットとMIMEタイプ（CSV）ファイル\"、RFC 4180、2005年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "[RFC5234]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC6657] Melnikov, A. and J. Reschke, \"Update to MIME regarding \"charset\" Parameter Handling in Textual Media Types\", RFC 6657, July 2012.",
      "ja": "[RFC6657]メルニコフ、A.とJ. Reschke、 \"パラメータテキストメディアタイプに処理 \"CHARSET\" に関するMIMEへの更新\"、RFC 6657、2012年7月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[ASCII] ANSI X3.4-1986, \"Coded Character Set - 7-Bit American National Standard Code for Information Interchange\", STD 63, RFC 3629, 1992.",
      "ja": "、STD 63、RFC 3629、1992  -  [ASCII] ANSI X3.4-1986は、 \"情報交換のための7ビットの米国標準コード文字セットコード化されました\"。"
    },
    {
      "indent": 3,
      "text": "[RFC0793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981.",
      "ja": "[RFC0793]ポステル、J.、 \"伝送制御プロトコル\"、STD 7、RFC 793、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5147] Wilde, E. and M. Duerst, \"URI Fragment Identifiers for the text/plain Media Type\", RFC 5147, April 2008.",
      "ja": "[RFC5147]ワイルド、E.およびM. Duerst、 \"text / plainのメディアタイプのURIフラグメント識別子\"、RFC 5147、2008年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC6838] Freed, N., Klensin, J., and T. Hansen, \"Media Type Specifications and Registration Procedures\", BCP 13, RFC 6838, January 2013.",
      "ja": "[RFC6838]解放され、N.、Klensin、J.、およびT.ハンセン、 \"メディアタイプの仕様と登録手順\"、BCP 13、RFC 6838、2013年1月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Michael Hausenblas MapR Technologies 32 Bushypark Lawn Galway Ireland",
      "ja": "マイケルHausenblas MAPRテクノロジーズ32 Bushypark芝生ゴールウェイアイルランド"
    },
    {
      "indent": 3,
      "text": "Phone: +353-86-0215164 EMail: mhausenblas@maprtech.com URI: http://mhausenblas.info",
      "ja": "電話：+ 353-86-0215164 Eメール：mhausenblas@maprtech.com URI：http://mhausenblas.info"
    },
    {
      "indent": 3,
      "text": "Erik Wilde UC Berkeley",
      "ja": "エリック・ワイルドUCバークレー"
    },
    {
      "indent": 3,
      "text": "EMail: dret@berkeley.edu URI: http://dret.net/netdret/",
      "ja": "電子メール：dret@berkeley.edu URI：http://dret.net/netdret/"
    },
    {
      "indent": 3,
      "text": "Jeni Tennison Open Data Institute 65 Clifton Street London EC2A 4JE U.K.",
      "ja": "ジェニ・テニソンオープンデータ研究所65クリフトン・ストリートロンドンEC2A 4JE U.K."
    },
    {
      "indent": 3,
      "text": "Phone: +44-797-4420482 EMail: jeni@jenitennison.com URI: http://www.jenitennison.com/blog/",
      "ja": "電話：+ 44-797-4420482 Eメール：jeni@jenitennison.com URI：http://www.jenitennison.com/blog/"
    }
  ]
}