{
  "title": {
    "text": "RFC 7187 - Routing Multipoint Relay Optimization for the Optimized Link State Routing Protocol Version 2 (OLSRv2)",
    "ja": "RFC 7187 - 最適化されたリンク状態ルーティングプロトコルバージョン2（OLSRv2）のルーティングマルチポイントリレー最適化"
  },
  "number": 7187,
  "created_at": "2020-09-03 20:18:26.461530+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       C. Dearlove\nRequest for Comments: 7187                               BAE Systems ATC\nUpdates: 7181                                                 T. Clausen\nCategory: Standards Track                       LIX, Ecole Polytechnique\nISSN: 2070-1721                                               April 2014",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": " Routing Multipoint Relay Optimization for the Optimized Link State Routing Protocol Version 2 (OLSRv2)",
      "ja": "最適化されたリンク状態ルーティングプロトコルバージョン2（OLSRv2）のルーティングマルチポイントリレー最適化"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This specification updates the Optimized Link State Routing Protocol version 2 (OLSRv2) with an optimization to improve the selection of routing multipoint relays. The optimization retains full interoperability between implementations of OLSRv2 with and without this optimization.",
      "ja": "この仕様は、最適化されたリンク状態ルーティングプロトコルバージョン2（OLSRv2）を最適化で更新し、ルーティングマルチポイントリレーの選択を改善します。最適化は、この最適化の有無にかかわらず、OLSRv2の実装間の完全な相互運用性を保持します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはInternet Standards Trackドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。インターネット標準の詳細については、RFC 5741のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7187.",
      "ja": "このドキュメントの現在のステータス、エラッタ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7187で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2014 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   2\n3.  Applicability Statement . . . . . . . . . . . . . . . . . . .   2\n4.  Routing MPR Selection . . . . . . . . . . . . . . . . . . . .   3\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .   4\n6.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .   4\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   4\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .   4\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .   4",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Optimized Link State Routing Protocol version 2 [RFC7181] is a proactive link state routing protocol designed for use in mobile ad hoc networks (MANETs) [RFC2501]. This document improves one area of the OLSRv2 specification.",
      "ja": "最適化リンクステートルーティングプロトコルバージョン2 [RFC7181]は、モバイルアドホックネットワーク（MANET）[RFC2501]で使用するために設計されたプロアクティブリンクステートルーティングプロトコルです。このドキュメントは、OLSRv2仕様の1つの領域を改善します。"
    },
    {
      "indent": 3,
      "text": "One improvement included in OLSRv2, compared to its predecessor described in [RFC3626], is the use of link metrics, rather than minimum-hop routing. A rationale for how link metrics were included in OLSRv2 is documented in [RFC7185]. However, one aspect of the use of link metrics described in [RFC7185], the removal of some unnecessarily selected routing multipoint relays (MPRs), was not included in [RFC7181]. This specification updates OLSRv2 to include this optimization.",
      "ja": "[RFC3626]で説明されている前のものと比較して、OLSRv2に含まれている1つの改善点は、最小ホップルーティングではなく、リンクメトリックの使用です。リンクメトリックがOLSRv2にどのように含まれているかの根拠は、[RFC7185]に文書化されています。ただし、[RFC7185]で説明されているリンクメトリックの使用の1つの側面である、不必要に選択されたルーティングマルチポイントリレー（MPR）の削除は、[RFC7181]には含まれていませんでした。この仕様は、この最適化を含むようにOLSRv2を更新します。"
    },
    {
      "indent": 3,
      "text": "Note that this optimization does not impact interoperability: implementations that do and do not implement this optimization will interoperate seamlessly.",
      "ja": "この最適化は相互運用性に影響を与えないことに注意してください。この最適化を実装する実装と実装しない実装はシームレスに相互運用します。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "キーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「NOT RECOMMENDED」、「MAY」、「OPTIONALこの文書の \"は、[RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "Additionally, this document uses the terminology of [RFC7181].",
      "ja": "また、このドキュメントでは[RFC7181]の用語を使用しています。"
    },
    {
      "indent": 0,
      "text": "3. Applicability Statement",
      "section_title": true,
      "ja": "3. 適用性ステートメント"
    },
    {
      "indent": 0,
      "text": " This specification updates [RFC7181]. As such, it is applicable to all implementations of this protocol. The optimization presented in this specification is simply permissive; it allows an additional optimization, and there is no requirement for any implementation to include it. However, inclusion of this optimization is advised; it can, in some cases, create smaller and fewer messages, without ever having the opposite effect.",
      "ja": "この仕様は[RFC7181]を更新します。そのため、このプロトコルのすべての実装に適用できます。この仕様で提示されている最適化は単に許容範囲です。追加の最適化が可能であり、実装にそれを含める必要はありません。ただし、この最適化を含めることをお勧めします。場合によっては、反対の影響を与えることなく、メッセージを小さくして作成することができます。"
    },
    {
      "indent": 3,
      "text": "[RFC7181] defines the properties for the selection of routing MPRs from among a router's symmetric 1-hop neighbors. The properties are",
      "ja": "[RFC7181]は、ルーターの対称1ホップネイバーからルーティングMPRを選択するためのプロパティを定義します。プロパティは"
    },
    {
      "indent": 3,
      "text": "o the selected MPRs must consist of a set of symmetric 1-hop neighbors that cover all the symmetric 2-hop neighbors, and",
      "ja": "o 選択したMPRは、すべての対称2ホップネイバーをカバーする一連の対称1ホップネイバーで構成されている必要があります。"
    },
    {
      "indent": 3,
      "text": "o the selected MPRs must do so retaining a minimum distance route (1-hop, if present, or 2-hop) to each symmetric 2-hop neighbor.",
      "ja": "o 選択したMPRは、各対称2ホップネイバーへの最小距離ルート（存在する場合は1ホップ、または2ホップ）を保持する必要があります。"
    },
    {
      "indent": 3,
      "text": "The discussion in the latter part of Section 6.2 of [RFC7185] indicates that this requirement is overly prescriptive for routing MPR selection. The update to [RFC7181] described in this specification permits a router to use the described optimization, while still being considered compliant with OLSRv2.",
      "ja": "[RFC7185]のセクション6.2の後半での議論は、この要件がルーティングMPR選択に対して過度に規範的であることを示しています。この仕様で説明されている[RFC7181]の更新により、ルータはOLSRv2に準拠していると見なされながら、説明されている最適化を使用できます。"
    },
    {
      "indent": 3,
      "text": "Note that whether or not a router is considered compliant, a router that implements the optimization described in this specification will interoperate successfully with routers that are not implementing this optimization.",
      "ja": "ルーターが準拠していると見なされているかどうかにかかわらず、この仕様で説明されている最適化を実装するルーターは、この最適化を実装していないルーターと正常に相互運用できます。"
    },
    {
      "indent": 0,
      "text": "4. Routing MPR Selection",
      "section_title": true,
      "ja": "4. MPR選択のルーティング"
    },
    {
      "indent": 3,
      "text": "A set of routing MPRs created as specified in [RFC7181] MAY be optimized in the following manner. Note that this uses the notation of Section 18.2 of [RFC7181]:",
      "ja": "[RFC7181]で指定されたように作成されたルーティングMPRのセットは、次の方法で最適化できます。これは[RFC7181]のセクション18.2の表記を使用していることに注意してください。"
    },
    {
      "indent": 3,
      "text": "1. If there is a sequence x_0, ..., x_n of elements of N1 such that:",
      "ja": "1. 次のようなN1の要素のシーケンスx_0、...、x_nがある場合："
    },
    {
      "indent": 7,
      "text": "* x_0 is a routing MPR,",
      "ja": "* x_0はルーティングMPRです。"
    },
    {
      "indent": 7,
      "text": "* x_1, ... , x_n have corresponding elements y_1, ..., y_n of N2, and",
      "ja": "* x_1、...、x_nには、N2の対応する要素y_1、...、y_n、および"
    },
    {
      "indent": 7,
      "text": "* d1(x_0) + d2(x_0,y_1) + ... + d2(x_m-1,y_m) < d1(x_m) for m = 1, ... , n,",
      "ja": "* d1（x_0）+ d2（x_0、y_1）+ ... + d2（x_m-1、y_m）<d1（x_m）for m = 1、...、n、"
    },
    {
      "indent": 7,
      "text": "then x_1 to x_n may be removed from the set of routing MPRs, if selected.",
      "ja": "次に、x_1からx_nを選択すると、ルーティングMPRのセットから削除できます。"
    },
    {
      "indent": 3,
      "text": "Note that \"corresponding elements\" in N1 and N2 means that these elements represent the same router. All of this information is available from information gathered by NHDP [RFC6130].",
      "ja": "N1とN2の「対応する要素」は、これらの要素が同じルーターを表すことを意味することに注意してください。この情報はすべて、NHDP [RFC6130]によって収集された情報から入手できます。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The update to OLSRv2 [RFC7181] does not introduce any new protocol signals, nor does it change the processing of any received protocol signals.",
      "ja": "OLSRv2 [RFC7181]への更新では、新しいプロトコル信号は導入されず、受信したプロトコル信号の処理も変更されません。"
    },
    {
      "indent": 3,
      "text": "This update to OLSRv2 [RFC7181] permits an implementation that is compliant with OLSRv2 to (potentially) eliminate some unneeded routers from the routing MPR sets generated as described in [RFC7181], which also eliminates the need to include the corresponding information in generated Topology Control (TC) messages. Because this information is not used when included, this update to OLSRv2 [RFC7181] does not present any additional security considerations, beyond those described in [RFC7181].",
      "ja": "このOLSRv2 [RFC7181]への更新により、OLSRv2に準拠した実装により、[RFC7181]で説明されているように生成されたルーティングMPRセットから不要なルーターが（潜在的に）削除され、対応する情報を生成されたトポロジ制御に含める必要もなくなります。 （TC）メッセージ。この情報が含まれている場合は使用されないため、OLSRv2 [RFC7181]へのこの更新では、[RFC7181]で説明されているものを超える追加のセキュリティ上の考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to gratefully acknowledge Philippe Jacquet (Alcatel-Lucent) for intense technical discussions and comments.",
      "ja": "著者は、激しい技術的な議論とコメントに対してフィリップ・ジャケ（アルカテル・ルーセント）に感謝の意を表します。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC6130] Clausen, T., Dean, J., and C. Dearlove, \"Mobile Ad Hoc Network (MANET) Neighborhood Discovery Protocol (NHDP)\", RFC 6130, April 2011.",
      "ja": "[RFC6130] Clausen、T.、Dean、J。、およびC. Dearlove、「モバイルアドホックネットワーク（MANET）近隣探索プロトコル（NHDP）」、RFC 6130、2011年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC7181] Clausen, T., Dearlove, C., Jacquet, P., and U. Herberg, \"The Optimized Link State Routing Protocol Version 2\", RFC 7181, April 2014.",
      "ja": "[RFC7181] Clausen、T.、Dearlove、C.、Jacquet、P。、およびU. Herberg、「The Optimized Link State Routing Protocol Version 2」、RFC 7181、2014年4月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC2501] Macker, J. and S. Corson, \"Mobile Ad hoc Networking (MANET): Routing Protocol Performance Issues and Evaluation Considerations\", RFC 2501, January 1999.",
      "ja": "[RFC2501] Macker、J。およびS. Corson、「モバイルアドホックネットワーキング（MANET）：ルーティングプロトコルのパフォーマンスの問題と評価に関する考慮事項」、RFC 2501、1999年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC3626] Clausen, T. and P. Jacquet, \"The Optimized Link State Routing Protocol\", RFC 3626, October 2003.",
      "ja": "[RFC3626] Clausen、T。およびP. Jacquet、「最適化されたリンク状態ルーティングプロトコル」、RFC 3626、2003年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC7185] Clausen, T., Dearlove, C., and P. Jacquet, \"Rationale for the Use of Link Metrics in the Optimized Link State Routing Protocol Version 2 (OLSRv2)\", RFC 7185, April 2014.",
      "ja": "[RFC7185] Clausen、T.、Dearlove、C。、およびP. Jacquet、「最適化されたリンクステートルーティングプロトコルバージョン2（OLSRv2）でのリンクメトリックの使用の根拠」、RFC 7185、2014年4月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Christopher Dearlove BAE Systems Advanced Technology Centre West Hanningfield Road Great Baddow, Chelmsford United Kingdom",
      "ja": "Christopher Dearlove BAE Systems Advanced Technology Center West Hanningfield Roadイギリス、チェルムズフォード、グレートバッドウ"
    },
    {
      "indent": 3,
      "text": "Phone: +44 1245 242194\nEMail: chris.dearlove@baesystems.com\nURI:   http://www.baesystems.com/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Thomas Heide Clausen LIX, Ecole Polytechnique",
      "ja": "トーマスハイデクラウセンLIX、エコールポリテクニック"
    },
    {
      "indent": 3,
      "text": "Phone: +33 6 6058 9349\nEMail: T.Clausen@computer.org\nURI:   http://www.ThomasClausen.org/",
      "raw": true,
      "ja": ""
    }
  ]
}