{
  "title": {
    "text": "RFC 7758 - Time Capability in NETCONF",
    "ja": "RFC 7758 - NETCONFのタイム機能"
  },
  "number": 7758,
  "created_at": "2019-11-02 01:42:35.971785+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        T. Mizrahi\nRequest for Comments: 7758                                      Y. Moses\nCategory: Experimental                                          Technion\nISSN: 2070-1721                                            February 2016",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Time Capability in NETCONF",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines a capability-based extension to the Network Configuration Protocol (NETCONF) that allows time-triggered configuration and management operations. This extension allows NETCONF clients to invoke configuration updates according to scheduled times and allows NETCONF servers to attach timestamps to the data they send to NETCONF clients.",
      "ja": "この文書は、タイム・トリガ設定と管理操作を可能にするネットワーク構成プロトコル（NETCONF）の能力ベースの拡張を定義します。この拡張は、NETCONFクライアントがスケジュールされた時間に応じて設定更新を呼び出すことができますし、NETCONFサーバは、彼らがNETCONFクライアントに送信するデータにタイムスタンプを添付することができます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、検査、実験的な実装、および評価のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "この文書は、インターネットコミュニティのためにExperimentalプロトコルを定義します。このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7758.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7758で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................4\n2. Conventions Used in This Document ...............................4\n   2.1. Key Words ..................................................4\n   2.2. Abbreviations ..............................................5\n   2.3. Terminology ................................................5\n3. Using Time in NETCONF ...........................................5\n   3.1. The Time Capability in a Nutshell ..........................5\n   3.2. Notifications and Cancellation Messages ....................7\n   3.3. Synchronization Aspects ....................................9\n   3.4. Scheduled Time Format .....................................10\n   3.5. Scheduling Tolerance ......................................10\n   3.6. Scheduling the Near vs. Far Future ........................11\n   3.7. Time-Interval Format ......................................13\n4. Time Capability ................................................14\n   4.1. Overview ..................................................14\n   4.2. Dependencies ..............................................14\n   4.3. Capability Identifier .....................................14\n   4.4. New Operations ............................................14\n   4.5. Modifications to Existing Operations ......................15\n        4.5.1. Affected Operations ................................15\n        4.5.2. Processing Scheduled Operations ....................16\n   4.6. Interactions with Other Capabilities ......................16\n5. Examples .......................................................17\n   5.1. <scheduled-time> Example ..................................17\n   5.2. <get-time> Example ........................................18\n   5.3. Error Example .............................................19\n6. Security Considerations ........................................19\n   6.1. General Security Considerations ...........................19\n   6.2. YANG Module Security Considerations .......................20\n7. IANA Considerations ............................................21\n8. References .....................................................22\n   8.1. Normative References ......................................22\n   8.2. Informative References ....................................22\nAppendix A. YANG Module for the Time Capability ...................24\nAcknowledgments ...................................................32\nAuthors' Addresses ................................................32",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Network Configuration Protocol (NETCONF), defined in [RFC6241], provides mechanisms to install, manipulate, and delete the configuration of network devices. NETCONF allows clients to configure and monitor NETCONF servers using remote procedure calls (RPCs).",
      "ja": "[RFC6241]で定義されたネットワーク構成プロトコル（NETCONF）は、インストール操作、およびネットワークデバイスの設定を削除するためのメカニズムを提供します。 NETCONFは、クライアントがリモートプロシージャコール（RPC）を使用して、NETCONFサーバを設定し、監視することができます。"
    },
    {
      "indent": 3,
      "text": "NETCONF is asynchronous; when a client invokes an RPC, it has no control over the time at which the RPC is executed, nor does it have any feedback from the server about the execution time.",
      "ja": "NETCONFは非同期です。クライアントがRPCを呼び出すとき、それは、RPCが実行された時刻を管理していない、またそれは、実行時間に関するサーバーからのフィードバックを持っていません。"
    },
    {
      "indent": 3,
      "text": "Time-based configuration ([OneClock] [Time4]) can be a useful tool that enables an entire class of coordinated and scheduled configuration procedures. Time-triggered configuration allows coordinated network updates in multiple devices; a client can invoke a coordinated configuration change by sending RPCs to multiple servers with the same scheduled execution time. A client can also invoke a time-based sequence of updates by sending n RPCs with n different update times, T1, T2, ..., Tn, determining the order in which the RPCs are executed.",
      "ja": "時間ベースの設定（[OneClock] [TIME4]）が配位し、スケジュール設定手順の全体のクラスを可能に有用なツールであることができます。タイムトリガの設定は、複数のデバイスでの協調ネットワークの更新を可能にします。クライアントは、同じスケジュールされた実行時間を持つ複数のサーバにRPCを送信することにより、協調の構成変更を呼び出すことができます。また、クライアントは、RPCの実行順序を決定し、n個の異なる更新時間、T1、T2、...、Tnを有するn個のRPCを送信することにより、更新の時間ベースのシーケンスを呼び出すことができます。"
    },
    {
      "indent": 3,
      "text": "This memo defines the :time capability in NETCONF. This extension allows clients to determine the scheduled execution time of RPCs they send. It also allows a server that receives an RPC to report its actual execution time to the client.",
      "ja": "NETCONFの時間機能：このメモは、定義されています。この拡張は、クライアントが送信RPCのスケジュールされた実行時間を決定することができます。また、クライアントへの実際の実行時間を報告するためにRPCを受信するサーバーを可能にします。"
    },
    {
      "indent": 3,
      "text": "The NETCONF time capability is intended for scheduling RPCs that should be performed in the near future, allowing the coordination of simultaneous configuration changes or specification of an order of configuration updates. Time-of-day-based policies and far-future scheduling, e.g., [Cond], are outside the scope of this memo.",
      "ja": "NETCONF時間機能は、近い将来に行われるべきであるRPCをスケジュール同時構成の変更や構成の更新のための仕様の調整を可能にするためのものです。時刻ベースのポリシーと遠未来のスケジューリング、例えば、[条件]、このメモの範囲外です。"
    },
    {
      "indent": 3,
      "text": "This memo is defined for experimental purposes and will allow the community to experiment with the NETCONF time capability. Based on the lessons learned from this experience, it is expected that the NETCONF working group will be able to consider whether to adopt the time capability.",
      "ja": "このメモは実験的な目的のために定義されており、コミュニティがNETCONF時間機能を試すことができるようになります。この経験から学んだ教訓に基づいて、NETCONFワーキンググループは、時間の機能を採用するかどうかを検討することができると期待されています。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 0,
      "text": "2.1. Key Words",
      "section_title": true,
      "ja": "2.1. キーワード"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Abbreviations",
      "section_title": true,
      "ja": "2.2. 略語"
    },
    {
      "indent": 3,
      "text": "NETCONF Network Configuration Protocol",
      "ja": "NETCONFネットワーク構成プロトコル"
    },
    {
      "indent": 3,
      "text": "RPC Remote Procedure Call",
      "ja": "RPCリモートプロシージャコール"
    },
    {
      "indent": 0,
      "text": "2.3. Terminology",
      "section_title": true,
      "ja": "2.3. 用語"
    },
    {
      "indent": 3,
      "text": "o Capability [RFC6241]: A functionality that supplements the base NETCONF specification.",
      "ja": "O機能[RFC6241]：ベースNETCONF仕様を補足する機能。"
    },
    {
      "indent": 3,
      "text": "o Client [RFC6241]: Invokes protocol operations on a server. In addition, a client can subscribe to receive notifications from a server.",
      "ja": "oクライアント[RFC6241]は：サーバー上のプロトコルオペレーションを呼び出します。また、クライアントは、サーバからの通知を受け取るために購読することができます。"
    },
    {
      "indent": 3,
      "text": "o Execution time: The execution time of an RPC is defined as the time at which a server completes the execution of an RPC, before it sends the <rpc-reply> message.",
      "ja": "O実行時間：RPCの実行時間は、それが<RPC-応答>メッセージを送信する前に、サーバが、RPCの実行を完了する時間として定義されます。"
    },
    {
      "indent": 3,
      "text": "o Scheduled RPC: an RPC that is scheduled to be performed at a predetermined time, which is included in the <rpc> message.",
      "ja": "OスケジュールRPC <RPC>メッセージに含まれている所定時間で行うことが予定されているRPC。"
    },
    {
      "indent": 3,
      "text": "o Scheduled time: The scheduled time of an RPC is the time at which the RPC should be started, as determined by the client. It is the server's role to enforce the execution of the scheduled time.",
      "ja": "O時間をスケジュール：RPCの予定時間は、クライアントによって決定されるRPCは、開始すべき時です。スケジュールされた時間の実行を強制するサーバーの役割です。"
    },
    {
      "indent": 3,
      "text": "o Server [RFC6241]: Executes protocol operations invoked by a client. In addition, a server can send notifications to a client.",
      "ja": "Oサーバ[RFC6241]は：クライアントによって呼び出されるプロトコル動作を実行します。また、サーバがクライアントに通知を送信することができます。"
    },
    {
      "indent": 0,
      "text": "3. Using Time in NETCONF",
      "section_title": true,
      "ja": "3. NETCONFに時間を使います"
    },
    {
      "indent": 0,
      "text": "3.1. The Time Capability in a Nutshell",
      "section_title": true,
      "ja": "3.1. 一言で言えばのタイム機能"
    },
    {
      "indent": 3,
      "text": "The :time capability provides two main functions:",
      "ja": "：タイム機能は、2つの主要な機能を提供します。"
    },
    {
      "indent": 3,
      "text": "o Scheduling:",
      "ja": "Oスケジューリング："
    },
    {
      "indent": 6,
      "text": "When a client sends an RPC to a server, the <rpc> message MAY include the scheduled-time element, denoted by Ts in Figure 1. The server then executes the RPC at the scheduled time Ts; once completed, the server can respond with an RPC reply message.",
      "ja": "クライアントがサーバにRPCを送信すると、<RPC>メッセージは、次にスケジュールされた時刻TsにRPCを実行するサーバー図1にTsとで示さ予定時刻要素を含んでもよいです。完了したら、サーバーは、RPC応答メッセージで応答することができます。"
    },
    {
      "indent": 3,
      "text": "o Reporting:",
      "ja": "Oレポート："
    },
    {
      "indent": 6,
      "text": "When a client sends an RPC to a server, the <rpc> message MAY include a get-time element (see Figure 2), requesting the server to return the execution time of the RPC. In this case, after the server performs the RPC, it responds with an RPC reply that includes the execution time, Te.",
      "ja": "クライアントがサーバにRPCを送信すると、<RPC>メッセージは、RPCの実行時間を返すようにサーバに要求するには、Get-time要素を（図2参照）を含むことができます。サーバがRPCを実行した後、この場合、それは、テを実行時間を含むRPC応答で応答します。"
    },
    {
      "indent": 12,
      "text": "          RPC _________\n        executed       \\\n                       \\/\n                       Ts\nserver  ---------------+-------------        ----> time\n                  /\\      \\\n              rpc /        \\ rpc-reply\n             (Ts)/          \\\n                /           \\/\nclient  -----------------------------",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Figure 1: Scheduled RPC",
      "ja": "図1：スケジュールRPC"
    },
    {
      "indent": 12,
      "text": "       RPC _________\n     executed       \\\n                    \\/\n                    Te\nserver  ------------+----------------        ----> time\n                  /\\   \\\n           rpc    /     \\ rpc-reply\n       (get-time)/       \\ (Te)\n                /        \\/\nclient  -----------------------------",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Figure 2: Reporting the Execution Time of an RPC",
      "ja": "図2：RPCの実行時間を報告"
    },
    {
      "indent": 3,
      "text": "Example 1. A client needs to trigger a commit at n servers, so that the n servers perform the commit as close as possible to simultaneously. Without the time capability, the client sends a sequence of n commit messages; thus, each server performs the commit at a different time. By using the time capability, the client can send commit messages that are scheduled to take place at a chosen time Ts, for example, 5 seconds in the future, causing the servers to invoke the commit as close as possible to time Ts.",
      "ja": "n個のサーバが同時ににできるだけ近いコミットを実行するように例1.クライアントは、n個のサーバにコミットトリガする必要があります。時間機能がないと、クライアントは、nコミットメッセージのシーケンスを送信します。したがって、各サーバは、異なる時間にコミット行います。時間機能を使用することにより、クライアントは、サーバが時間Tsにできるだけ近くをコミット起動させ、将来的には、例えば、Tsを選択した時に5秒の場所を取るために予定されているコミットメッセージ送信することができます。"
    },
    {
      "indent": 3,
      "text": "Example 2. In many applications, it is desirable to monitor events or collect statistics regarding a common time reference. A client can send a set of get-config messages that is scheduled to be executed at multiple servers at the same time, providing a simultaneous system-wide view of the state of the servers. Moreover, a client can use the get-time element in its get-config messages, providing a time reference to the sampled element.",
      "ja": "多くのアプリケーションで例2は、イベントを監視したり、共通の時間基準に関する統計情報を収集することが望ましいです。クライアントは、サーバの状態の同時システム全体のビューを提供し、同時に複数のサーバで実行されるようにスケジュールされたGET-config設定メッセージのセットを送信することができます。また、クライアントは、サンプリングされた要素への時間基準を提供し、その取得・設定メッセージには、Get-time要素を使用することができます。"
    },
    {
      "indent": 3,
      "text": "The scenarios of Figures 1 and 2 imply that a third scenario can also be supported (Figure 3), where the client invokes an RPC that includes a scheduled time, Ts, as well as the get-time element. This allows the client to receive feedback about the actual execution time, Te. Ideally, Ts=Te. However, the server may execute the RPC at a slightly different time than Ts, for example, if the server is tied up with other tasks at Ts.",
      "ja": "図1及び図2のシナリオは、第3のシナリオもサポートすることができることを意味するもので、クライアントがスケジュールされた時間、TS、並びに取得時間要素を含むRPCを呼び出す（図3）。これは、クライアントが実際の実行時間、テに関するフィードバックを受け取ることができます。理想的にはTs =テ。サーバはTsので他のタスクと提携している場合は、サーバは、例えば、Tsよりわずかに異なる時間にRPCを実行することができます。"
    },
    {
      "indent": 12,
      "text": "          RPC _________\n        executed       \\\n                       \\/\n                    Ts Te\nserver  -------------+-+-------------        ----> time\n                /\\        \\\n       rpc      /          \\ rpc-reply\n(Ts + get-time)/            \\ (Te)\n              /             \\/\nclient  -----------------------------",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Figure 3: Scheduling and Reporting",
      "ja": "図3：スケジューリングとレポーティング"
    },
    {
      "indent": 0,
      "text": "3.2. Notifications and Cancellation Messages",
      "section_title": true,
      "ja": "3.2. 通知とキャンセルのメッセージ"
    },
    {
      "indent": 3,
      "text": "Notifications",
      "ja": "通知"
    },
    {
      "indent": 6,
      "text": "As illustrated in Figure 1, after a scheduled RPC is executed, the server sends an <rpc-reply>. The <rpc-reply> may arrive a long period of time after the RPC was sent by the client, leaving the client without a clear indication of whether the RPC was received.",
      "ja": "図1に示されるようにスケジュールRPCが実行された後、サーバは、<RPC-応答>を送信します。 <RPC返信> RPCをRPCを受信したか否かを明確に表示することなく、クライアントを残し、クライアントによって送信された後長時間に到着してもよいです。"
    },
    {
      "indent": 6,
      "text": "This document defines a new notification, the netconf-scheduled-message notification, which provides an immediate acknowledgement of the scheduled RPC.",
      "ja": "この文書は、新しい通知、スケジュールされたRPCの即時の確認応答を提供NETCONFスケジュール・メッセージ通知を定義します。"
    },
    {
      "indent": 6,
      "text": "The <netconf-scheduled-message> notification is sent to the client if it is subscribed to the NETCONF notifications [RFC6470]; as illustrated in Figure 4, when the server receives a scheduled RPC, it sends a notification to the client.",
      "ja": "それはNETCONF通知[RFC6470]に登録している場合は、<NETCONFスケジュール・メッセージ>通知がクライアントに送信されます。サーバーがスケジュールRPCを受け取り、図4に示すように、それがクライアントに通知を送信します。"
    },
    {
      "indent": 6,
      "text": "The <netconf-scheduled-message> notification includes a <schedule-id> element. The <schedule-id> is a unique identifier that the server assigns to every scheduled RPC it receives. Thus, a client can keep track of all the pending scheduled RPCs; a client can uniquely identify a scheduled RPC by the tuple {server, schedule-id}.",
      "ja": "<NETCONFスケジューリングメッセージ>通知<スケジュール-ID>エレメントを含みます。 <スケジュール-id>は、サーバは、受信すべてのスケジュールされたRPCに割り当てられる一意の識別子です。したがって、クライアントは、保留中のすべてのスケジュール済みのRPCを追跡することができます。クライアントは、一意のタプル{サーバ、スケジュール-ID}によってスケジュールRPCを識別することができます。"
    },
    {
      "indent": 12,
      "text": "          RPC ____________\n        executed          \\\n                          \\/\n                          Ts\nserver  -------------------+---------        ----> time\n            /\\  \\            \\\n        rpc /    \\notifi-     \\ rpc-reply\n       (Ts)/      \\cation      \\\n          /       \\/           \\/\nclient  -----------------------------",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Figure 4: Scheduled RPC with Notification",
      "ja": "図4：通知とスケジュールRPC"
    },
    {
      "indent": 3,
      "text": "Cancellation Messages",
      "ja": "キャンセルメッセージ"
    },
    {
      "indent": 6,
      "text": "A client can cancel a scheduled RPC by sending a <cancel-schedule> RPC. The <cancel-schedule> RPC includes the <schedule-id> of the scheduled RPC that needs to be cancelled.",
      "ja": "クライアントは、<キャンセル・スケジュール> RPCを送信することにより、スケジュールRPCをキャンセルすることができます。 <キャンセルスケジュールは> RPCをキャンセルする必要がある予定のRPCの<スケジュール-id>を含みます。"
    },
    {
      "indent": 6,
      "text": "The <cancel-schedule> RPC, defined in this document, can be used to perform a coordinated all-or-none procedure, where either all the servers perform the operation on schedule or the operation is aborted.",
      "ja": "この文書で定義された<キャンセルスケジュール> RPC、すべてのサーバのいずれかがスケジュール通りに操作を実行したり、操作が中止され配位全か無かの手順を実行するために使用することができます。"
    },
    {
      "indent": 6,
      "text": "Example 3. A client sends scheduled <rpc> messages to server 1 and server 2, both scheduled to be performed at time Ts. Server 1 sends a notification indicating that it has successfully scheduled the RPC, while server 2 replies with an unknown-element error [RFC6241] that indicates that it does not support the time capability. The client sends a <cancel-schedule> RPC to server 1 and receives an <rpc-reply>. The message exchange between the client and server 1 in this example is illustrated in Figure 5.",
      "ja": "例3.クライアントサーバ1とサーバ2、時間Tsで実行されるようにスケジュールの両方に予定の<RPC>メッセージを送信します。サーバ1は、それが時間の機能をサポートしていないことを示している未知の要素のエラー[RFC6241]を使用してサーバ2件の回答しながら、それが成功し、RPCを予定していることを示す通知を送信します。クライアントは、サーバ1に、<キャンセル・スケジュール> RPCを送信し、<RPC-返信>を受けます。この例では、クライアントとサーバ1との間のメッセージ交換は、図5に示されています。"
    },
    {
      "indent": 12,
      "text": "                    RPC not __________\n                    executed          \\\n                                      \\/\n                                       Ts\nserver  --------------------------------+---      ----> time\n            /\\ \\            /\\        \\\n        rpc /   \\notifi-    /cancel-   \\ rpc-reply\n       (Ts)/     \\cation   /schedule    \\\n          /      \\/       /             \\/\nclient  ------------------------------------",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Figure 5: Cancellation Message",
      "ja": "図5：キャンセルメッセージ"
    },
    {
      "indent": 3,
      "text": "A <cancel-schedule> RPC MUST NOT include the scheduled-time parameter. A server that receives a <cancel-schedule> RPC should try to cancel the schedule as soon as possible. If the server is unable to cancel the scheduled RPC, for example, because it has already been executed, it should respond with an <rpc-error> [RFC6241], in which the error-type is 'protocol', and the error-tag is 'operation-failed'.",
      "ja": "<キャンセル・スケジュール> RPCは、予定時刻のパラメータを含んではいけません。 <キャンセル・スケジュール>を受け取るサーバーは、RPCは、できるだけ早くスケジュールをキャンセルしようとする必要があります。サーバは、スケジュールされたRPCをキャンセルすることができない場合は、既に実行されているので、例えば、それは、<RPCエラー> [RFC6241]で応答しなければならないエラータイプが「プロトコル」、およびエラー - ですタグは、「操作に失敗した」です。"
    },
    {
      "indent": 0,
      "text": "3.3. Synchronization Aspects",
      "section_title": true,
      "ja": "3.3. 同期側面"
    },
    {
      "indent": 3,
      "text": "The time capability defined in this document requires clients and servers to maintain clocks. It is assumed that clocks are synchronized by a method that is outside the scope of this document, e.g., [RFC5905] or [IEEE1588].",
      "ja": "この文書で定義された時間の能力はクロックを維持するために、クライアントとサーバが必要です。クロックがこの文書の範囲外である方法、例えば、[RFC5905]または[IEEE1588]によって同期されているものとします。"
    },
    {
      "indent": 3,
      "text": "This document does not define any requirements pertaining to the degree of accuracy of performing scheduled RPCs. Note that two factors affect how accurately the server can perform a scheduled RPC: one factor is the accuracy of the clock synchronization method used to synchronize the clients and servers and the second factor is the server's ability to execute real-time configuration changes, which greatly depends on how it is implemented. Typical networking devices are implemented by a combination of hardware and software. While the execution time of a hardware module can typically be predicted with a high level of accuracy, the execution time of a software module may be variable and hard to predict. A configuration update would typically require the server's software to be involved, thus affecting how accurately the RPC can be scheduled.",
      "ja": "この文書では、スケジュールされたRPCを実行するの正確度に関する要件を定義していません。一つの要因は、クライアントとサーバーを同期させるために使用されるクロック同期方法の精度であり、第二の要因は、リアルタイムの構成変更を実行するサーバーの機能である、が大幅：二つの要因は、サーバーがスケジュールRPCを実行することができますどのように正確に影響することに注意してくださいそれが実装されている方法によって異なります。典型的なネットワークデバイスは、ハードウェアとソフトウェアの組み合わせによって実現されています。ハードウェア・モジュールの実行時間は、典型的には、高精度で予測することができるが、ソフトウェア・モジュールの実行時間は、変数と予測するのは難しいかもしれません。構成の更新は、通常、このようにRPCをスケジュールすることができますどのように正確に影響を与え、関与していると、サーバのソフトウェアが必要になります。"
    },
    {
      "indent": 3,
      "text": "Another important aspect of synchronization is monitoring; a client should be able to check whether a server is synchronized to a reference time source. Typical synchronization protocols, such as the Network Time Protocol [RFC5905], provide the means ([RFC5907], [RFC7317]) to verify that a clock is synchronized to a time reference by querying its Management Information Base (MIB). The get-time feature defined in this document (see Figure 2) allows a client to obtain a rough estimate of the time offset between the client's clock and the server's clock.",
      "ja": "同期のもう一つの重要な側面は、監視しています。クライアントは、サーバが基準時刻ソースに同期されているかどうかを確認することができるはずです。そのようなネットワークタイムプロトコル[RFC5905]のような典型的な同期プロトコルは、クロックがその管理情報ベース（MIB）を照会することにより、時間基準に同期されていることを確認するための手段（[RFC5907]、[RFC7317]）を提供します。この文書で定義された取得時の特徴は、（図2を参照）クライアントは、クライアントのクロックとサーバのクロックとの間の時間オフセットの大まかな推定値を得ることができます。"
    },
    {
      "indent": 3,
      "text": "Since servers do not perform configuration changes instantaneously, the processing time of an RPC should not be overlooked. The scheduled time always refers to the start time of the RPC, and the execution time always refers to its completion time.",
      "ja": "サーバが瞬時に設定変更を行わないので、RPCの処理時間が見落としてはなりません。スケジュールされた時間は、常にRPCの開始時刻を参照し、実行時間は常にその完了時間を指します。"
    },
    {
      "indent": 0,
      "text": "3.4. Scheduled Time Format",
      "section_title": true,
      "ja": "3.4. スケジュールされた時間のフォーマット"
    },
    {
      "indent": 3,
      "text": "The scheduled time and execution time fields in <rpc> messages use a common time format field.",
      "ja": "<RPC>メッセージに予定された時間と実行時間のフィールドは、共通の時間形式のフィールドを使用します。"
    },
    {
      "indent": 3,
      "text": "The time format used in this document is the date-and-time format, defined in Section 5.6 of [RFC3339] and Section 3 of [RFC6991].",
      "ja": "本書で使用される時間形式は[RFC3339]及び[RFC6991]のセクション3のセクション5.6で定義され、日時フォーマットです。"
    },
    {
      "indent": 7,
      "text": "leaf scheduled-time {\n  type yang:date-and-time;\n  description\n  \"The time at which the RPC is scheduled to be performed.\";\n}",
      "raw": true
    },
    {
      "indent": 7,
      "text": "leaf execution-time {\n  type yang:date-and-time;\n  description\n  \"The time at which the RPC was executed.\";\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3.5. Scheduling Tolerance",
      "section_title": true,
      "ja": "3.5. スケジュールトレランス"
    },
    {
      "indent": 3,
      "text": "When a client sends an RPC that is scheduled to Ts, the server MUST verify that the value Ts is not too far in the past or in the future. As illustrated in Figure 6, the server verifies that Ts is within the scheduling-tolerance range.",
      "ja": "クライアントはTsのに予定されているRPCを送信すると、サーバーは値Tsは、過去または将来にすぎないことを確かめなければなりません。図6に示すように、サーバは、TSがスケジューリング許容範囲内であることを検証します。"
    },
    {
      "indent": 12,
      "text": "      RPC _________\n    received       \\\n                   \\/\n                         Ts\n-----+--------------+-----+------------+-------> time",
      "raw": true
    },
    {
      "indent": 18,
      "text": "<------------> <---------------->\nsched-max-past  sched-max-future",
      "raw": true
    },
    {
      "indent": 18,
      "text": "<------------------------------->\n     scheduling tolerance",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 6: Scheduling Tolerance",
      "ja": "図6：スケジュールトレランス"
    },
    {
      "indent": 3,
      "text": "The scheduling tolerance is determined by two parameters: sched-max-future and sched-max-past. These two parameters use the time-interval format (Section 3.7.), and their default value is 15 seconds.",
      "ja": "schedの-MAX-未来とschedの-MAX-過去：スケジューリング許容範囲は、2つのパラメータによって決定されます。これらの2つのパラメータは、時間間隔形式（3.7節を。）を使用し、そのデフォルト値は15秒です。"
    },
    {
      "indent": 3,
      "text": "If the scheduled time, Ts, is within the scheduling-tolerance range, the scheduled RPC is performed; if Ts occurs in the past and within the scheduling tolerance, the server performs the RPC as soon as possible; whereas if Ts is a future time, the server performs the RPC at Ts.",
      "ja": "スケジュールされた時間、Tsは、スケジューリング許容範囲内にある場合は、スケジュールされたRPCが行われます。 Tsは、過去にスケジューリング許容値内に発生した場合、サーバはできるだけ早くRPCを実行します。 Tsは将来の時間であれば、一方のサーバーは、TSでRPCを実行します。"
    },
    {
      "indent": 3,
      "text": "If Ts is not within the scheduling-tolerance range, the scheduled RPC is discarded, and the server responds with an error message [RFC6241] including a bad-element error-tag. An example is provided in Section 5.3.",
      "ja": "Tsがスケジューリング許容範囲内にない場合、スケジュールされたRPCは破棄され、サーバは、不良素子エラータグを含むエラーメッセージ[RFC6241]で応答します。例は、セクション5.3で提供されています。"
    },
    {
      "indent": 0,
      "text": "3.6. Scheduling the Near vs. Far Future",
      "section_title": true,
      "ja": "3.6. 近対遠い将来のスケジュール"
    },
    {
      "indent": 3,
      "text": "The scheduling bound defined by sched-max-future guarantees that every scheduled RPC is restricted to a scheduling time in the near future.",
      "ja": "スケジューリングは、すべてのスケジュールされたRPCは、近い将来にスケジュール時間に制限されていることをSCHED-MAX-将来の保証によって定義された結合しました。"
    },
    {
      "indent": 3,
      "text": "The scheduling mechanism defined in this document is intended for near-future scheduling, on the order of seconds. Far-future scheduling is outside the scope of this document.",
      "ja": "この文書で定義されたスケジューリング機構は、秒の順に、近未来のスケジューリングのためのものです。遠未来のスケジューリングは、このドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "Example 1 is a typical example of using near-future scheduling; the goal in the example is to perform the RPC at multiple servers at the same time; therefore, it is best to schedule the RPC to be performed a few seconds in the future.",
      "ja": "実施例1は、近未来のスケジューリングを使用しての典型的な例です。例の目標は、同時に複数のサーバーでRPCを実行することです。そのため、それが将来的には数秒を実行するRPCをスケジュールすることをお勧めします。"
    },
    {
      "indent": 3,
      "text": "The Challenges of Far-Future Scheduling",
      "ja": "遠未来のスケジューリングの課題"
    },
    {
      "indent": 6,
      "text": "When an RPC is scheduled to be performed at a far-future time, during the long period between the time at which the RPC is sent and the time at which it is scheduled to be executed, the following erroneous events may occur:",
      "ja": "RPCは、RPCが送信された時刻と、実行されるようにスケジュールされた時刻との間の長い期間の間、遠い未来の時に実行されるようにスケジュールされた場合、次の誤ったイベントが発生することがあります。"
    },
    {
      "indent": 6,
      "text": "o The server may restart.",
      "ja": "Oサーバーが再起動する場合があります。"
    },
    {
      "indent": 6,
      "text": "o The client's authorization level may be changed.",
      "ja": "Oクライアントの認証レベルを変更してもよいです。"
    },
    {
      "indent": 6,
      "text": "o The client may restart and send a conflicting RPC.",
      "ja": "Oクライアントが再起動し、競合RPCを送信することができます。"
    },
    {
      "indent": 6,
      "text": "o A different client may send a conflicting RPC.",
      "ja": "O異なるクライアントは、競合RPCを送信することができます。"
    },
    {
      "indent": 6,
      "text": "In these cases, if the server performs the scheduled operation, it may perform an action that is inconsistent with the current network policy or inconsistent with the currently active clients.",
      "ja": "サーバは、スケジュールされた操作を実行する場合は、これらのケースでは、それは、現在のネットワークポリシーまたは現在アクティブなクライアントと矛盾と矛盾するアクションを実行することができます。"
    },
    {
      "indent": 6,
      "text": "Near-future scheduling guarantees that external events, such as the examples above, have a low probability of occurring during the sched-max-future period, and even when they do, the period of inconsistency is limited to sched-max-future, which is a short period of time.",
      "ja": "近未来のスケジューリングを保証し、上記の例のような外部のイベントは、schedの-MAX-将来の期間中に発生する確率が低い、さらには彼らが行うとき、矛盾の期間はschedの-MAX-未来、に制限されていることをどの時間の短い期間です。"
    },
    {
      "indent": 3,
      "text": "The Trade-off in Setting the sched-max-future Value",
      "ja": "schedの-MAX-将来値の設定におけるトレードオフ"
    },
    {
      "indent": 6,
      "text": "The sched-max-future parameter should be configured to a value that is high enough to allow the client to:",
      "ja": "schedの-MAX-将来のパラメータは、クライアントを可能にするのに十分に高い値に設定する必要があります。"
    },
    {
      "indent": 6,
      "text": "1. Send the scheduled RPC, potentially to multiple servers.",
      "section_title": true,
      "ja": "1.潜在的に複数のサーバーに、スケジュールされたRPCを送信します。"
    },
    {
      "indent": 6,
      "text": "2. Receive notifications or <rpc-error> messages from the server(s) or wait for a timeout and decide that if no response has arrived then something is wrong.",
      "ja": "2.サーバ（群）からの通知または<RPC-エラー>メッセージを受信またはタイムアウトを待っても応答が到着していないならば、何かが間違っていると判断しました。"
    },
    {
      "indent": 6,
      "text": "3. If necessary, send a cancellation message, potentially to multiple servers.",
      "ja": "3.必要に応じて、潜在的に複数のサーバーに、キャンセルメッセージを送信します。"
    },
    {
      "indent": 6,
      "text": "On the other hand, sched-max-future should be configured to a value that is low enough to allow a low probability of the erroneous events above, typically on the order of a few seconds. Note that, even if sched-max-future is configured to a low value, it is still possible (with a low probability) that an erroneous event will occur. However, this short, potentially hazardous period is not significantly worse than in conventional (unscheduled) RPCs, as even a conventional RPC may in some cases be executed a few seconds after it was sent by the client.",
      "ja": "一方、SCHED-MAX-将来は、典型的には、数秒のオーダーで、上記の誤ったイベントの低い確率を可能にするのに十分低い値に設定する必要があります。 schedの-MAX-将来を低い値に設定されている場合でも、それは誤ったイベントが発生する（低い確率で）依然として可能であることに留意されたいです。それは、クライアントによって送信された後も、従来のRPCは、いくつかのケースでは数秒で実行することができるようしかし、この短い、潜在的に危険な期間は、従来の（スケジュールされていない）のRPCに比べて大幅に悪化していません。"
    },
    {
      "indent": 3,
      "text": "The Default Value of sched-max-future",
      "ja": "schedの-MAX-将来のデフォルト値"
    },
    {
      "indent": 6,
      "text": "The default value of sched-max-future is defined to be 15 seconds. This duration is long enough to allow the scheduled RPC to be sent by the client, potentially to multiple servers, and in some cases to send a cancellation message, as described in Section 3.2. On the other hand, the 15-second duration yields a very low probability of a reboot or a permission change.",
      "ja": "schedの-MAX-将来のデフォルト値は15秒になるように定義されます。この期間は、3.2節で説明したように、キャンセルメッセージを送信するために潜在的に複数のサーバーに、いくつかのケースでは、スケジュールされたRPCは、クライアントによって送信されることを可能にするのに十分な長さ。一方、15秒の期間は、再起動やアクセス許可の変更の非常に低い確率を生成します。"
    },
    {
      "indent": 0,
      "text": "3.7. Time-Interval Format",
      "section_title": true,
      "ja": "3.7. 時間間隔のフォーマット"
    },
    {
      "indent": 3,
      "text": "The time-interval format is used for representing the length of a time interval and is based on the date-and-time format. It is used for representing the scheduling tolerance parameters, as described in the previous section.",
      "ja": "時間間隔形式は、時間間隔の長さを表すために使用され、日時のフォーマットに基づいています。前のセクションで説明したように、それは、スケジューリング許容パラメータを表すために使用されます。"
    },
    {
      "indent": 3,
      "text": "While the date-and-time type uniquely represents a specific point in time, the time-interval type defined below can be used to represent the length of a time interval without specifying a specific date.",
      "ja": "日時タイプが一意に特定の時点を表している、以下に定義される時間間隔の種類は、特定の日付を指定せずに、時間間隔の長さを表すために使用することができます。"
    },
    {
      "indent": 3,
      "text": "The time-interval type is defined as follows:",
      "ja": "次のように時間間隔タイプが定義されます。"
    },
    {
      "indent": 6,
      "text": "typedef time-interval {\n  type string {\n    pattern '\\d{2}:\\d{2}:\\d{2}(\\.\\d+)?';\n  }\n  description\n    \"Defines a time interval, up to 24 hours.\n     The format is specified as HH:mm:ss.f,\n     consisting of two digits for hours,\n     two digits for minutes, two digits\n     for seconds, and zero or more digits\n     representing second fractions.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Example",
      "ja": "例"
    },
    {
      "indent": 3,
      "text": "The sched-max-future parameter is defined (Appendix A) as a time-interval, as follows:",
      "ja": "次のようにschedの-MAX-将来パラメータは、時間間隔として（付録A）に定義されます："
    },
    {
      "indent": 6,
      "text": "leaf sched-max-future {\n  type time-interval;\n  default 00:00:15.0;\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The default value specified for sched-max-future is 0 hours, 0 minutes, and 15 seconds.",
      "ja": "schedの-MAX-将来のために指定されたデフォルト値は0時間、0分、15秒です。"
    },
    {
      "indent": 0,
      "text": "4. Time Capability",
      "section_title": true,
      "ja": "4.タイム機能"
    },
    {
      "indent": 3,
      "text": "The structure of this section is as defined in Appendix D of [RFC6241].",
      "ja": "[RFC6241]の付録Dで定義されるように、このセクションの構造です。"
    },
    {
      "indent": 0,
      "text": "4.1. Overview",
      "section_title": true,
      "ja": "4.1. 概要"
    },
    {
      "indent": 3,
      "text": "A server that supports the time capability can perform time-triggered operations as defined in this document.",
      "ja": "この文書で定義された時間の機能をサポートするサーバは、タイムトリガ操作を行うことができます。"
    },
    {
      "indent": 3,
      "text": "A server implementing the :time capability:",
      "ja": "時間機能：実装するサーバー："
    },
    {
      "indent": 3,
      "text": "o MUST support the ability to receive <rpc> messages that include a time element and perform a time-triggered operation accordingly.",
      "ja": "Oは、時間要素を含む<RPC>メッセージを受信し、それに応じてタイムトリガ操作を実行する能力をサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "o MUST support the ability to include a time element in the <rpc-reply> messages that it transmits.",
      "ja": "O <RPC返信>それが送信するメッセージの時間要素を含む能力をサポートしなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2. Dependencies",
      "section_title": true,
      "ja": "4.2. 依存関係"
    },
    {
      "indent": 3,
      "text": "With-defaults Capability",
      "ja": "デフォルト設定機能"
    },
    {
      "indent": 6,
      "text": "The time-capability YANG module (Appendix A) uses default values; thus, it is assumed that the with-defaults capability [RFC6243] is supported.",
      "ja": "タイム機能YANGモジュール（付録A）は、デフォルト値を使用しています。したがって、と、デフォルトの能力[RFC6243]がサポートされているものとします。"
    },
    {
      "indent": 0,
      "text": "4.3. Capability Identifier",
      "section_title": true,
      "ja": "4.3. 機能識別子"
    },
    {
      "indent": 3,
      "text": "The :time capability is identified by the following capability string:",
      "ja": "：タイム機能は、以下の機能文字列によって識別されます。"
    },
    {
      "indent": 3,
      "text": "urn:ietf:params:netconf:capability:time:1.0",
      "ja": "URN：IETF：のparams：NETCONF：機能：時間：1.0"
    },
    {
      "indent": 0,
      "text": "4.4. New Operations",
      "section_title": true,
      "ja": "4.4. 新事業"
    },
    {
      "indent": 3,
      "text": "<cancel-schedule>",
      "ja": "<キャンセルスケジュールを>"
    },
    {
      "indent": 6,
      "text": "The <cancel-schedule> RPC is used for cancelling an RPC that was previously scheduled.",
      "ja": "<キャンセルスケジュール> RPCは、以前にスケジュールされたRPCをキャンセルするために使用されます。"
    },
    {
      "indent": 6,
      "text": "A <cancel-schedule> RPC MUST include the <cancelled-message-id> element, which specifies the message ID of the scheduled RPC that needs to be cancelled.",
      "ja": "<キャンセルスケジュール> RPCをキャンセルする必要がある予定のRPCのメッセージIDを指定する<キャンセルメッセージ-ID>要素を含まなければなりません。"
    },
    {
      "indent": 6,
      "text": "A <cancel-schedule> RPC MAY include the <get-time> element. In this case, the <rpc-reply> includes the <execution-time> element, specifying the time at which the scheduled RPC was cancelled.",
      "ja": "<キャンセル・スケジュール> RPCは<GET-時間>要素を含んでいてもよいです。この場合、<RPC返信>は、スケジュールされたRPCがキャンセルされた時刻を指定する、<実行時>要素を含んでいます。"
    },
    {
      "indent": 0,
      "text": "4.5. Modifications to Existing Operations",
      "section_title": true,
      "ja": "4.5. 既存事業への変更"
    },
    {
      "indent": 0,
      "text": "4.5.1. Affected Operations",
      "section_title": true,
      "ja": "4.5.1. 影響を受ける事業"
    },
    {
      "indent": 3,
      "text": "The :time capability defined in this memo can be applied to any of the following operations:",
      "ja": "このメモで定義された時間の能力は、次の操作のいずれにも適用することができます。"
    },
    {
      "indent": 3,
      "text": "o get-config",
      "ja": "O得る-config設定を"
    },
    {
      "indent": 3,
      "text": "o get",
      "ja": "Oを取得"
    },
    {
      "indent": 3,
      "text": "o copy-config",
      "ja": "Oコピー-config設定"
    },
    {
      "indent": 3,
      "text": "o edit-config",
      "ja": "O編集-config設定"
    },
    {
      "indent": 3,
      "text": "o delete-config",
      "ja": "O削除-config設定を"
    },
    {
      "indent": 3,
      "text": "o lock",
      "ja": "Oロック"
    },
    {
      "indent": 3,
      "text": "o unlock",
      "ja": "Oロック解除"
    },
    {
      "indent": 3,
      "text": "o commit",
      "ja": "Oコミット"
    },
    {
      "indent": 3,
      "text": "Three new elements are added to each of these operations:",
      "ja": "三つの新しい要素は、これらの操作のそれぞれに追加されます。"
    },
    {
      "indent": 3,
      "text": "o <scheduled-time> This element is added to the input of each operation, indicating the time at which the server is scheduled to invoke the operation. Every <rpc> message MAY include the <scheduled-time> element. A server that supports the :time capability and receives an <rpc> message with a <scheduled-time> element MUST perform the operation as close as possible to the scheduled time.",
      "ja": "O <予定時刻>この要素は、サーバーは、操作を呼び出すようにスケジュールされた時刻を示す、各操作の入力に加えられます。すべての<RPC>メッセージは、<予定時刻>要素を含んでいてもよいです。サポートサーバ：時間機能と<予定時刻>と<RPC>メッセージを受信した要素がスケジュールされた時間にできるだけ近い動作を実行しなければなりません。"
    },
    {
      "indent": 6,
      "text": "The <scheduled-time> element uses the date-and-time format (Section 3.4.).",
      "ja": "<予定時刻>要素は、日時形式使用（セクション3.4）。"
    },
    {
      "indent": 3,
      "text": "o <get-time> This element is added to the input of each operation. An <rpc> message MAY include a <get-time> element, indicating that the server MUST include an <execution-time> element in its corresponding <rpc-reply>.",
      "ja": "O <GET-時間>この要素は、各操作の入力に加えられます。 <RPC>メッセージは、サーバーがその対応する<RPC返信>で<実行時>要素を含む必要があることを示す、<GET-時間>要素を含んでいてもよいです。"
    },
    {
      "indent": 3,
      "text": "o <execution-time> This element is added to the output of each operation, indicating the time at which the server completed the operation. An <rpc-reply> MAY include the <execution-time> element. A server that supports the :time capability and receives an operation with the <get-time> element MUST include the execution time in its response.",
      "ja": "O <実行時>この要素は、サーバーが動作を完了した時刻を示す、各操作の出力に加算されます。 <RPC-返信> <実行時>要素を含んでいてもよいです。サポートするサーバー：タイム機能をと<GET-時間>要素を使用して操作を受けるには、その応答して実行時間を含まなければなりません。"
    },
    {
      "indent": 6,
      "text": "The <execution-time> element uses the date-and-time format (Section 3.4.).",
      "ja": "<実行時>要素は、日時形式使用（セクション3.4）。"
    },
    {
      "indent": 0,
      "text": "4.5.2. Processing Scheduled Operations",
      "section_title": true,
      "ja": "4.5.2. スケジュールされた操作の処理"
    },
    {
      "indent": 3,
      "text": "A server that receives a scheduled RPC MUST start executing the RPC as close as possible to its scheduled execution time.",
      "ja": "スケジュールされたRPCを受け取るサーバは、その予定の実行時間にできるだけ近いRPCの実行を開始する必要があります。"
    },
    {
      "indent": 3,
      "text": "If a session between a client and a server is terminated, the server MUST cancel all pending scheduled RPCs that were received in this session.",
      "ja": "クライアントとサーバ間のセッションが終了した場合、サーバはこのセッションで受信したすべての保留予定のRPCをキャンセルしなければなりません。"
    },
    {
      "indent": 3,
      "text": "Scheduled RPCs are processed serially, in an order that is defined by their scheduled times. Thus, the server sends <rpc-reply> messages to scheduled RPCs according to the order of their corresponding schedules. Note that this is a modification to the behavior defined in [RFC6241], which states that replies are sent in the order the requests were received. Interoperability with [RFC6241] is guaranteed by the NETCONF capability exchange; a server that does not support the :time capability responds to RPCs in the order the requests were received. A server that supports the :time capability replies to conventional (non-scheduled) RPCs in the order they were received and replies to scheduled RPCs in the order of their scheduled times.",
      "ja": "スケジュールRPCは、そのスケジュールされた時間によって定義されるためには、連続的に処理されています。このように、サーバは、対応するスケジュールの順序に従ってスケジュールのRPCに<RPC返信>メッセージを送信します。この応答は、要求が受信された順序で送信されると述べている[RFC6241]で定義された行動に修正であることに留意されたいです。 [RFC6241]との相互運用性は、NETCONF能力交換によって保証されています。サポートしていませんサーバー：タイム機能は、要求が受信された順序でのRPCに応答します。サポートするサーバー：タイム機能は、そのスケジュールされた時間のために予定したRPCに、従来の（非スケジュール）、それらが受信された順序でのRPCと回答に返信します。"
    },
    {
      "indent": 3,
      "text": "If a server receives two or more RPCs that are scheduled to be performed at the same time, the server executes the RPCs serially in an arbitrary order.",
      "ja": "サーバが同時に実行されるようにスケジュールされた2つの以上のRPCを受信した場合、サーバは、任意の順序で直列にRPCを実行します。"
    },
    {
      "indent": 0,
      "text": "4.6. Interactions with Other Capabilities",
      "section_title": true,
      "ja": "4.6. その他の機能との相互作用"
    },
    {
      "indent": 3,
      "text": "Confirmed Commit Capability",
      "ja": "確認したコミット機能"
    },
    {
      "indent": 6,
      "text": "The confirmed commit capability is defined in Section 8.4 of [RFC6241]. According to that document, a confirmed <commit> operation MUST be reverted if a confirming commit is not issued within the timeout period (which is 600 seconds by default).",
      "ja": "コミット確認機能は、[RFC6241]のセクション8.4で定義されています。コミット確認は、（デフォルトでは600秒）のタイムアウト期間内に発行されていない場合、その文書によると、<コミット>動作確認を元に戻すされなければなりません。"
    },
    {
      "indent": 6,
      "text": "When the time capability is supported, and a confirmed <commit> operation is used with the <scheduled-time> element, the confirmation timeout MUST be counted from the scheduled time, i.e., the client begins the timeout measurement starting at the scheduled time.",
      "ja": "時間機能はサポートされており、確認操作が<予定時刻>要素と共に使用される<コミット>、確認タイムアウトが予定時刻からカウントする必要がある場合、すなわち、クライアントは、スケジュールされた時刻に開始タイムアウト測定を開始します。"
    },
    {
      "indent": 0,
      "text": "5. Examples",
      "section_title": true,
      "ja": "5.例"
    },
    {
      "indent": 0,
      "text": "5.1. <scheduled-time> Example",
      "section_title": true,
      "ja": "5.1.  <予定時刻>例"
    },
    {
      "indent": 3,
      "text": "The following example extends the example presented in Section 7.2 of [RFC6241] by adding the time capability. In this example, the <scheduled-time> element is used to specify the scheduled execution time of the configuration update (as shown in Figure 1).",
      "ja": "次の例では、時刻機能を追加することによって、[RFC6241]のセクション7.2に提示された例を拡張します。この例では、<予定時刻>要素は、（図1に示すように）設定更新の実行予定時間を指定するために使用されます。"
    },
    {
      "indent": 3,
      "text": "<rpc message-id=\"101\" xmlns=\"urn:ietf:params:xml:ns:netconf:base:1.0\"> <edit-config> <target> <running/> </target> <scheduled-time xmlns=\"urn:ietf:params:xml:ns:yang:ietf-netconf-time\"> 2015-10-21T04:29:00.235Z </scheduled-time> <config> <top xmlns=\"http://example.com/schema/1.2/config\"> <interface> <name>Ethernet0/0</name> <mtu>1500</mtu> </interface> </top> </config> </edit-config> </rpc>",
      "ja": "<RPCメッセージ-ID = \"101\" のxmlns = \"URN：IETF：paramsは：XML：NS：NETCONF：塩基：1.0\"> <編集設定> <ターゲット> <実行/> </ターゲット> <予定時間のxmlns = \"壷：IETF：のparams：XML：NS：ヤン：IETF-NETCONFタイム\"> 2015-10-21T04：29：00.235Z </予定時刻>の<config> <トップのxmlns = \"のhttp：//例.COM /スキーマ/ 1.2 /設定 \"> <インターフェース> <名前>のEthernet0 / 0 </名前> <MTU> 1500 </ MTU> </インターフェイス> </トップ> </ config>の</編集-config>の< / RPC>"
    },
    {
      "indent": 3,
      "text": "<rpc-reply message-id=\"101\" xmlns=\"urn:ietf:params:xml:ns:netconf:base:1.0\"> <ok/> </rpc-reply>",
      "ja": "<RPC応答メッセージ-ID = \"101\" のxmlns = \"URN：IETF：paramsは：XML：NS：NETCONF：塩基：1.0\"> <OK /> </ RPC返信>"
    },
    {
      "indent": 0,
      "text": "5.2. <get-time> Example",
      "section_title": true,
      "ja": "5.2.  <GET-時間>例"
    },
    {
      "indent": 3,
      "text": "The following example is similar to the one presented in Section 5.1, except that, in this example, the client includes a <get-time> element in its RPC and the server consequently responds with an <execution-time> element (as shown in Figure 2).",
      "ja": "次の例は、それ以外は、第5.1節で提示された1つに類似して、この例では、クライアントは、RPCにおける<GET-時間>要素を含み、に示すように、サーバは、結果として<実行時>要素（で応答します図2）。"
    },
    {
      "indent": 3,
      "text": "<rpc message-id=\"101\" xmlns=\"urn:ietf:params:xml:ns:netconf:base:1.0\"> <edit-config> <target> <running/> </target> <get-time xmlns=\"urn:ietf:params:xml:ns:yang:ietf-netconf-time\"> </get-time> <config> <top xmlns=\"http://example.com/schema/1.2/config\"> <interface> <name>Ethernet0/0</name> <mtu>1500</mtu> </interface> </top> </config> </edit-config> </rpc>",
      "ja": "<RPCメッセージ-ID = \"101\" のxmlns = \"URN：IETF：paramsは：XML：NS：NETCONF：塩基：1.0\"> <編集設定> <ターゲット> <実行/> </ターゲット> <取得時のxmlns = \"壷：IETF：のparams：XML：NS：ヤン：IETF-NETCONFタイム\"> </ GET-時間>の<config> <トップのxmlns = \"http://example.com/schema/1.2/config\"> <インターフェース> <名前>をEthernet0 / 0 </名前> <MTU> 1500 </ MTU> </インターフェイス> </ TOP> </ config>の</編集設定> </ RPC>"
    },
    {
      "indent": 3,
      "text": "<rpc-reply message-id=\"101\" xmlns=\"urn:ietf:params:xml:ns:netconf:base:1.0\"> <ok/> <execution-time> 2015-10-21T04:29:00.235Z </execution-time> </rpc-reply>",
      "ja": "<RPC返信メッセージID = \"101\" のxmlns = \"URN：IETF：paramsは：XML：NS：NETCONF：塩基：1.0\"> <OK /> <実行時> 2015-10-21T04：29：00.235Z </実行時> </ RPC-返信>"
    },
    {
      "indent": 0,
      "text": "5.3. Error Example",
      "section_title": true,
      "ja": "5.3. エラー例"
    },
    {
      "indent": 3,
      "text": "The following example presents a scenario in which the scheduled-time is not within the scheduling tolerance, i.e., it is too far in the past; therefore, an <rpc-error> is returned.",
      "ja": "次の例では、予定時刻は、スケジューリング許容範囲内にないとしたシナリオ、すなわち、それはあまりにも遠い過去であると提示します。そのため、<RPC-エラーが>返されます。"
    },
    {
      "indent": 3,
      "text": "<rpc message-id=\"101\" xmlns=\"urn:ietf:params:xml:ns:netconf:base:1.0\"> <edit-config> <target> <running/> </target> <scheduled-time xmlns=\"urn:ietf:params:xml:ns:yang:ietf-netconf-time\"> 2010-10-21T04:29:00.235Z </scheduled-time> <config> <top xmlns=\"http://example.com/schema/1.2/config\"> <interface> <name>Ethernet0/0</name> <mtu>1500</mtu> </interface> </top> </config> </edit-config> </rpc>",
      "ja": "<RPCメッセージ-ID = \"101\" のxmlns = \"URN：IETF：paramsは：XML：NS：NETCONF：塩基：1.0\"> <編集設定> <ターゲット> <実行/> </ターゲット> <予定時間のxmlns = \"壷：IETF：のparams：XML：NS：ヤン：IETF-NETCONFタイム\"> 2010-10-21T04：29：00.235Z </予定時刻>の<config> <トップのxmlns = \"のhttp：//例.COM /スキーマ/ 1.2 /設定 \"> <インターフェース> <名前>のEthernet0 / 0 </名前> <MTU> 1500 </ MTU> </インターフェイス> </トップ> </ config>の</編集-config>の< / RPC>"
    },
    {
      "indent": 3,
      "text": "<rpc-reply message-id=\"101\" xmlns=\"urn:ietf:params:xml:ns:netconf:base:1.0\"> <rpc-error> <error-type>application</error-type> <error-tag>bad-element</error-tag> <error-severity>error</error-severity> <error-info> <bad-element>scheduled-time</bad-element> </error-info> </rpc-error> </rpc-reply>",
      "ja": "<RPC返信メッセージID = \"101\" のxmlns = \"URN：IETF：paramsは：XML：NS：NETCONF：塩基：1.0\"> <RPCエラー> <エラータイプ>アプリケーション</エラータイプ> <エラー-tag>悪い要素</エラータグ> <エラーの重大度>エラー</エラー重大度> <エラー情報> <悪い要素>予定時刻</悪い要素> </エラー・インフォメーション> < / RPCエラー> </ RPC-返信>"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 0,
      "text": "6.1. General Security Considerations",
      "section_title": true,
      "ja": "6.1. 一般的なセキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations of the NETCONF protocol in general are discussed in [RFC6241].",
      "ja": "一般にNETCONFプロトコルのセキュリティ問題は[RFC6241]に記載されています。"
    },
    {
      "indent": 3,
      "text": "The usage of the time capability defined in this document can assist an attacker in gathering information about the system, such as the exact time of future configuration changes. Moreover, the time elements can potentially allow an attacker to learn information about the system's performance. Furthermore, an attacker that sends malicious <rpc> messages can use the time capability to amplify her attack; for example, by sending multiple <rpc> messages with the same scheduled time. It is important to note that the security measures described in [RFC6241] can prevent these vulnerabilities.",
      "ja": "本書で規定された時間能力の使用は、将来の構成変更の正確な時間として、システムに関する情報を収集で攻撃を支援することができます。また、時間の要素が潜在的に攻撃者がシステムのパフォーマンスについての情報を学ぶできるようにすることができます。さらに、悪意のある<RPC>メッセージを送信し、攻撃者は、彼女の攻撃を増幅するための時間の機能を使用することができます。例えば、同じ予定された時間に複数の<RPC>メッセージを送信することもできます。 [RFC6241]で説明したセキュリティ対策は、これらの脆弱性を防ぐことができることに注意することが重要です。"
    },
    {
      "indent": 3,
      "text": "The time capability relies on an underlying time synchronization protocol. Thus, by attacking the time protocol, an attack can potentially compromise NETCONF when using the time capability. A detailed discussion about the threats against time protocols and how to mitigate them is presented in [RFC7384].",
      "ja": "タイム機能は、基礎となる時刻同期プロトコルに依存しています。時間機能を使用するときにこのように、時間プロトコルを攻撃することによって、攻撃は潜在的にNETCONFを危うくすることができます。タイム・プロトコルに対する脅威とどのようにそれらを軽減するための詳細な議論は[RFC7384]に提示されています。"
    },
    {
      "indent": 3,
      "text": "The time capability can allow an attacker to attack a NETCONF server by sending malicious RPCs that are scheduled to take place in the future. For example, an attacker can send multiple scheduled RPCs that are scheduled to be performed at the same time. Another possible attack is to send a large number of scheduled RPCs to a NETCONF server, potentially causing the server's buffers to overflow. These attacks can be mitigated by a carefully designed NETCONF server; when a server receives a scheduled RPC that exceeds its currently available resources, it should reply with an <rpc-error> and discard the scheduled RPC.",
      "ja": "タイム機能は、攻撃者が、将来的に場所を取るために予定されている悪質なRPCを送信することにより、NETCONFサーバを攻撃できるようにすることができます。例えば、攻撃者が同時に行うことが予定されている複数のスケジュールRPCを送信することができます。別の可能な攻撃は、潜在的に、サーバのバッファがオーバーフローを引き起こし、NETCONFサーバにスケジュールRPCの大規模な番号を送信することです。これらの攻撃は、慎重に設計されたNETCONFサーバによって軽減することができます。サーバがその現在利用可能なリソースを超える予定のRPCを受信したとき、それは<RPC-エラー>と答えるとスケジュールRPCを破棄しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Note that if an attacker has been detected and revoked, its future scheduled RPCs are not executed; as defined in Section 4.5.2, once the session with the attacker has been terminated, the corresponding scheduled RPCs are discarded.",
      "ja": "攻撃者が検出され、取り消された場合、その将来予定されたRPCが実行されていないことに注意してください。 4.5.2項で定義されるように、攻撃者とのセッションが終了した後、対応予定さのRPCは破棄されます。"
    },
    {
      "indent": 0,
      "text": "6.2. YANG Module Security Considerations",
      "section_title": true,
      "ja": "6.2.  YANGモジュールのセキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This memo defines a new YANG module, as specified in Appendix A.",
      "ja": "付録Aに指定されているこのメモは、新しいYANGモジュールを定義します"
    },
    {
      "indent": 3,
      "text": "The YANG module defined in this memo is designed to be accessed via the NETCONF protocol [RFC6241]. The lowest NETCONF layer is the secure transport layer and the mandatory-to-implement secure transport is Secure SHell (SSH) [RFC6242]. The NETCONF access control model [RFC6536] provides the means to restrict access for particular NETCONF users to a preconfigured subset of all available NETCONF protocol operations and content.",
      "ja": "このメモで定義されたYANGモジュールはNETCONFプロトコル[RFC6241]を介してアクセスするように設計されています。最低NETCONF層は、セキュアトランスポート層と強制的に実装安全な輸送は、セキュアシェル（SSH）[RFC6242]です。 NETCONFアクセス制御モデル[RFC6536]は、使用可能なすべてのNETCONFプロトコル操作とコンテンツの事前設定されたサブセットに特定のNETCONFのユーザーのアクセスを制限するための手段を提供します。"
    },
    {
      "indent": 3,
      "text": "This YANG module defines <sched-max-future> and <sched-max-past>, which are writable/creatable/deletable. These data nodes may be considered sensitive or vulnerable in some network environments. An attacker may attempt to maliciously configure these parameters to a low value, thereby causing all scheduled RPCs to be discarded. For instance, if a client expects <sched-max-future> to be 15 seconds, but in practice it is maliciously configured to 1 second, then a legitimate scheduled RPC that is scheduled to be performed 5 seconds in the future will be discarded by the server.",
      "ja": "作成可能/書き込み可能/削除可能です。このYANGモジュールの定義<schedの-MAX-未来>と<schedの-MAX-過去>、。これらのデータノードは、いくつかのネットワーク環境に敏感又は脆弱と考えることができます。攻撃者は、それによって廃棄されるすべてのスケジュールされたRPCを引き起こし、悪意低い値にこれらのパラメータを設定することを試みることができます。 15秒に、クライアントは<schedの-MAX-未来>を想定した場合、例えば、それが悪意を持って1秒に設定されている実際には、その後、将来的には5秒を実行することが予定されている合法的なスケジュールされたRPCは、によって破棄されますサーバー。"
    },
    {
      "indent": 3,
      "text": "This YANG module defines the <cancel-schedule> RPC. This RPC may be considered sensitive or vulnerable in some network environments. Since the value of the <schedule-id> is known to all the clients that are subscribed to notifications from the server, the <cancel-schedule> RPC may be used maliciously to attack servers by cancelling their pending RPCs. This attack is addressed in two layers: (i) security at the transport layer, limiting the attack only to clients that have successfully initiated a secure session with the server, and (ii) the authorization level required to cancel an RPC should be the same as the level required to schedule it, limiting the attack only to attackers with an authorization level that is equal to or higher than that of the client that initiated the scheduled RPC.",
      "ja": "このYANGモジュールは、<キャンセルスケジュール> RPCを定義します。このRPCは、いくつかのネットワーク環境で敏感であるか、または脆弱とみなすことができます。 <スケジュール-ID>の値は、サーバからの通知に加入しているすべてのクライアントに知られているので、<キャンセル・スケジュール> RPCは、その保留RPCをキャンセルして、サーバを攻撃するために悪意を持って使用することができます。この攻撃は、2層に対処される：（I）、トランスポート層でのセキュリティ、唯一成功したサーバーとの安全なセッションを開始したクライアントへの攻撃を制限し、及び（ii）はRPCをキャンセルするために必要な権限レベルが同じでなければなりませんレベルはスケジュールされたRPCを開始したクライアントと同等以上の権限レベルを持つ攻撃者に攻撃を制限し、それをスケジュールするために必要とされます。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The following capability identifier URN has been registered in the \"Network Configuration Protocol (NETCONF) Capability URNs\" registry:",
      "ja": "以下の機能識別子URNは、「ネットワーク構成プロトコル（NETCONF）能力壺」レジストリに登録されています。"
    },
    {
      "indent": 6,
      "text": "urn:ietf:params:netconf:capability:time:1.0",
      "ja": "URN：IETF：のparams：NETCONF：機能：時間：1.0"
    },
    {
      "indent": 3,
      "text": "The following XML namespace URN has been registered in the \"IETF XML Registry\", following the format defined in [RFC3688]:",
      "ja": "次のXML名前空間のURNは、[RFC3688]で定義されたフォーマットに従って、「IETF XMLレジストリ」に登録されています："
    },
    {
      "indent": 6,
      "text": "URI: urn:ietf:params:xml:ns:yang:ietf-netconf-time",
      "ja": "URI：URN：IETF：のparams：XML：NS：ヤン：IETF-NETCONFタイム"
    },
    {
      "indent": 6,
      "text": "Registrant Contact: The IESG.",
      "ja": "登録者連絡先：IESG。"
    },
    {
      "indent": 6,
      "text": "XML: N/A, the requested URI is an XML namespace.",
      "ja": "XML：N / Aは、要求されたURIは、XML名前空間があります。"
    },
    {
      "indent": 3,
      "text": "The following module name has been registered in the \"YANG Module Names\" registry, defined in [RFC6020].",
      "ja": "以下のモジュール名は、[RFC6020]で定義され、「YANGモジュール名」レジストリに登録されています。"
    },
    {
      "indent": 6,
      "text": "name: ietf-netconf-time",
      "ja": "名前：IETF-NETCONFタイム"
    },
    {
      "indent": 6,
      "text": "prefix: nct",
      "ja": "接頭辞：NCT"
    },
    {
      "indent": 6,
      "text": "namespace: urn:ietf:params:xml:ns:yang:ietf-netconf-time",
      "ja": "名前空間：URN：IETF：のparams：XML：NS：ヤン：IETF-NETCONFタイム"
    },
    {
      "indent": 6,
      "text": "RFC: 7758",
      "ja": "RFC：7758"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3339] Klyne, G. and C. Newman, \"Date and Time on the Internet: Timestamps\", RFC 3339, DOI 10.17487/RFC3339, July 2002, <http://www.rfc-editor.org/info/rfc3339>.",
      "ja": "[RFC3339] Klyne、G.とC.ニューマン、 \"インターネット上の日付と時刻：タイムスタンプ\"、RFC 3339、DOI 10.17487 / RFC3339、2002年7月、<http://www.rfc-editor.org/info/rfc3339 >。"
    },
    {
      "indent": 3,
      "text": "[RFC3688] Mealling, M., \"The IETF XML Registry\", BCP 81, RFC 3688, DOI 10.17487/RFC3688, January 2004, <http://www.rfc-editor.org/info/rfc3688>.",
      "ja": "[RFC3688] Mealling、M.、 \"IETF XMLレジストリ\"、BCP 81、RFC 3688、DOI 10.17487 / RFC3688、2004年1月、<http://www.rfc-editor.org/info/rfc3688>。"
    },
    {
      "indent": 3,
      "text": "[RFC6241] Enns, R., Ed., Bjorklund, M., Ed., Schoenwaelder, J., Ed., and A. Bierman, Ed., \"Network Configuration Protocol (NETCONF)\", RFC 6241, DOI 10.17487/RFC6241, June 2011, <http://www.rfc-editor.org/info/rfc6241>.",
      "ja": "[RFC6241]エンス、R.、編、Bjorklund、M.、編、Schoenwaelder、J.、編、及びA. Bierman、編、 \"ネットワーク構成プロトコル（NETCONF）\"、RFC 6241、DOI 10.17487 / RFC6241、2011年6月、<http://www.rfc-editor.org/info/rfc6241>。"
    },
    {
      "indent": 3,
      "text": "[RFC6470] Bierman, A., \"Network Configuration Protocol (NETCONF) Base Notifications\", RFC 6470, DOI 10.17487/RFC6470, February 2012, <http://www.rfc-editor.org/info/rfc6470>.",
      "ja": "[RFC6470] Bierman、A.、 \"ネットワーク構成プロトコル（NETCONF）ベースの通知\"、RFC 6470、DOI 10.17487 / RFC6470、2012年2月、<http://www.rfc-editor.org/info/rfc6470>。"
    },
    {
      "indent": 3,
      "text": "[RFC6991] Schoenwaelder, J., Ed., \"Common YANG Data Types\", RFC 6991, DOI 10.17487/RFC6991, July 2013, <http://www.rfc-editor.org/info/rfc6991>.",
      "ja": "[RFC6991] Schoenwaelder、J.、エド。、 \"共通YANGデータ型\"、RFC 6991、DOI 10.17487 / RFC6991、2013年7月、<http://www.rfc-editor.org/info/rfc6991>。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[Cond] Watsen, K., \"Conditional Enablement of Configuration Nodes\", draft-kwatsen-conditional-enablement-00, Work in Progress, February 2013.",
      "ja": "[条件] Watsen、K.、 \"構成ノードの条件付きイネーブルメント\"、ドラフトkwatsen条件付き有効化-00、進歩、2013年2月での作業。"
    },
    {
      "indent": 3,
      "text": "[IEEE1588] IEEE, \"IEEE Standard for a Precision Clock Synchronization Protocol for Networked Measurement and Control Systems Version 2\", IEEE Standard 1588.",
      "ja": "[IEEE1588] IEEE、「ネットワーク測定および制御システムのバージョン2のための高精度クロック同期プロトコルのためのIEEE規格」、IEEE規格1588。"
    },
    {
      "indent": 3,
      "text": "[OneClock] Mizrahi, T. and Y. Moses, \"OneClock to Rule Them All: Using Time in Networked Applications\", IEEE/IFIP Network Operations and Management Symposium (NOMS), 2016.",
      "ja": "[OneClock]ミズラヒ、T.とY.モーセ、 \"OneClockすべてを支配する：ネットワークアプリケーションに時間を使う\"、IEEE / IFIPネットワーク運用と管理シンポジウム（NOMS）、2016。"
    },
    {
      "indent": 3,
      "text": "[RFC5905] Mills, D., Martin, J., Ed., Burbank, J., and W. Kasch, \"Network Time Protocol Version 4: Protocol and Algorithms Specification\", RFC 5905, DOI 10.17487/RFC5905, June 2010, <http://www.rfc-editor.org/info/rfc5905>.",
      "ja": "[RFC5905]ミルズ、D.、マーティン、J.、エド、バーバンク、J.、およびW. Kasch、 \"ネットワークタイムプロトコルバージョン4：プロトコルとアルゴリズムの仕様\"。、RFC 5905、DOI 10.17487 / RFC5905、2010年6月、 <http://www.rfc-editor.org/info/rfc5905>。"
    },
    {
      "indent": 3,
      "text": "[RFC5907] Gerstung, H., Elliott, C., and B. Haberman, Ed., \"Definitions of Managed Objects for Network Time Protocol Version 4 (NTPv4)\", RFC 5907, DOI 10.17487/RFC5907, June 2010, <http://www.rfc-editor.org/info/rfc5907>.",
      "ja": "[RFC5907] Gerstung、H.、エリオット、C.、およびB.ハーバーマン、エド。、 \"ネットワークタイムプロトコルバージョン4（NTPv4）のための管理オブジェクトの定義\"、RFC 5907、DOI 10.17487 / RFC5907、2010年6月、<HTTP ：//www.rfc-editor.org/info/rfc5907>。"
    },
    {
      "indent": 3,
      "text": "[RFC6020] Bjorklund, M., Ed., \"YANG - A Data Modeling Language for the Network Configuration Protocol (NETCONF)\", RFC 6020, DOI 10.17487/RFC6020, October 2010, <http://www.rfc-editor.org/info/rfc6020>.",
      "ja": "[RFC6020] Bjorklund、M.、エド、 \"YANG  - ネットワーク構成プロトコルのためのデータモデリング言語（NETCONF）\"、RFC 6020、DOI 10.17487 / RFC6020、2010年10月、<のhttp：。//www.rfc-editor。組織/情報/ rfc6020>。"
    },
    {
      "indent": 3,
      "text": "[RFC6242] Wasserman, M., \"Using the NETCONF Protocol over Secure Shell (SSH)\", RFC 6242, DOI 10.17487/RFC6242, June 2011, <http://www.rfc-editor.org/info/rfc6242>.",
      "ja": "[RFC6242]ワッサーマン、M.、RFC 6242、DOI 10.17487 / RFC6242、2011年6月、 \"NETCONFプロトコルを使用してセキュアシェル（SSH）上\" <http://www.rfc-editor.org/info/rfc6242>。"
    },
    {
      "indent": 3,
      "text": "[RFC6243] Bierman, A. and B. Lengyel, \"With-defaults Capability for NETCONF\", RFC 6243, DOI 10.17487/RFC6243, June 2011, <http://www.rfc-editor.org/info/rfc6243>.",
      "ja": "[RFC6243] Bierman、A.及びB. Lengyel、 \"NETCONF用で、デフォルト機能\"、RFC 6243、DOI 10.17487 / RFC6243、2011年6月、<http://www.rfc-editor.org/info/rfc6243>。"
    },
    {
      "indent": 3,
      "text": "[RFC6536] Bierman, A. and M. Bjorklund, \"Network Configuration Protocol (NETCONF) Access Control Model\", RFC 6536, DOI 10.17487/RFC6536, March 2012, <http://www.rfc-editor.org/info/rfc6536>.",
      "ja": "[RFC6536] Bierman、A.とM. Bjorklund、 \"ネットワーク構成プロトコル（NETCONF）アクセス制御モデル\"、RFC 6536、DOI 10.17487 / RFC6536、2012年3月、<http://www.rfc-editor.org/info/ rfc6536>。"
    },
    {
      "indent": 3,
      "text": "[RFC7317] Bierman, A. and M. Bjorklund, \"A YANG Data Model for System Management\", RFC 7317, DOI 10.17487/RFC7317, August 2014, <http://www.rfc-editor.org/info/rfc7317>.",
      "ja": "[RFC7317] Bierman、A.とM. Bjorklund、 \"システム管理のためのYANGデータモデル\"、RFC 7317、DOI 10.17487 / RFC7317、2014年8月、<http://www.rfc-editor.org/info/rfc7317> 。"
    },
    {
      "indent": 3,
      "text": "[RFC7384] Mizrahi, T., \"Security Requirements of Time Protocols in Packet Switched Networks\", RFC 7384, DOI 10.17487/RFC7384, October 2014, <http://www.rfc-editor.org/info/rfc7384>.",
      "ja": "[RFC7384]ミズラヒは、T.は、 \"パケットにおけるタイムプロトコルのセキュリティ要件は、スイッチドネットワーク\"、RFC 7384、DOI 10.17487 / RFC7384、2014年10月、<http://www.rfc-editor.org/info/rfc7384>。"
    },
    {
      "indent": 3,
      "text": "[Time4] Mizrahi, T. and Y. Moses, \"Software Defined Networks: It's About Time\", IEEE INFOCOM, 2016.",
      "ja": "[TIME4]ミズラヒ、T.とY.モーセ、 \"ソフトウェア定義されたネットワーク：それは時間だ\"、IEEE INFOCOM、2016。"
    },
    {
      "indent": 0,
      "text": "Appendix A. YANG Module for the Time Capability",
      "ja": "タイム能力付録A. YANGモジュール"
    },
    {
      "indent": 3,
      "text": "This section is normative.",
      "ja": "このセクションは規範的です。"
    },
    {
      "indent": 0,
      "text": "<CODE BEGINS> file \"ietf-netconf-time@2016-01-26.yang\"",
      "ja": "ファイル \"ietf-netconf-time@2016-01-26.yang\" <CODEが開始されます>"
    },
    {
      "indent": 0,
      "text": "module ietf-netconf-time {",
      "ja": "モジュールIETF-NETCONF時間{"
    },
    {
      "indent": 3,
      "text": "namespace \"urn:ietf:params:xml:ns:yang:ietf-netconf-time\";",
      "ja": "名前空間 \"URN：IETF：のparams：XML：NS：ヤン：IETF-NETCONF時間\"。"
    },
    {
      "indent": 3,
      "text": "prefix nct; import ietf-netconf { prefix nc; }",
      "ja": "NCT接頭辞; IETF-NETCONF {プレフィックスNCをインポートします。 }"
    },
    {
      "indent": 3,
      "text": "import ietf-yang-types { prefix yang; }",
      "ja": "インポートIETF-ヤン・タイプ{プレフィックス陽。 }"
    },
    {
      "indent": 3,
      "text": "import ietf-netconf-monitoring { prefix ncm; }",
      "ja": "インポートIETF-NETCONF監視{プレフィックスNCM。 }"
    },
    {
      "indent": 3,
      "text": "organization \"IETF\";",
      "ja": "組織「IETF」。"
    },
    {
      "indent": 3,
      "text": "contact \"Editor: Tal Mizrahi <dew@tx.technion.ac.il> Editor: Yoram Moses <moses@ee.technion.ac.il>\";",
      "ja": "連絡先 \"エディタ：タルミズラヒ<dew@tx.technion.ac.il>エディタ：ヨラム・モージズ<moses@ee.technion.ac.il>\";"
    },
    {
      "indent": 3,
      "text": "description \"This module defines a capability-based extension to the Network Configuration Protocol (NETCONF) that allows time-triggered configuration and management operations. This extension allows NETCONF clients to invoke configuration updates according to scheduled times and allows NETCONF servers to attach timestamps to the data they send to NETCONF clients.",
      "ja": "説明は「このモジュールは、タイムトリガ設定および管理操作を可能にするネットワーク構成プロトコル（NETCONF）への能力ベースの拡張を定義しています。この拡張は、NETCONFクライアントがスケジュールされた時間に応じて設定更新を呼び出すことができますし、NETCONFサーバはにタイムスタンプを付けることができます彼らはNETCONFクライアントに送信するデータ。"
    },
    {
      "indent": 6,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the authors of the code. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託コードの作者として特定の人物。全著作権所有。"
    },
    {
      "indent": 6,
      "text": "Redistribution and use in source and binary forms, with or without modification, is permitted pursuant to, and subject to the license terms contained in, the Simplified BSD License set forth in Section 4.c of the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info).\";",
      "ja": "、に基づき許可されており、中に含まれるライセンス条項に従う、簡体BSDライセンスは、IETFドキュメントに関連IETFトラストの法律規定（のセクション4.Cに記載されている変更の有無にかかわらず、ソースおよびバイナリ形式での再配布および使用http://trustee.ietf.org/license-info）」。"
    },
    {
      "indent": 3,
      "text": "revision 2016-01-26 { description \"Initial version.\";",
      "ja": "改訂2016年1月26日{説明「初期バージョン。」;"
    },
    {
      "indent": 3,
      "text": " reference \"RFC 7758: Time Capability in NETCONF\"; }",
      "ja": "参照「RFC 7758：NETCONFのタイム機能」。 }"
    },
    {
      "indent": 3,
      "text": "typedef time-interval {\n  type string {\n    pattern '\\d{2}:\\d{2}:\\d{2}(\\.\\d+)?';\n  }\n  description\n    \"Defines a time interval, up to 24 hours.\n     The format is specified as HH:mm:ss.f,\n     consisting of two digits for hours,\n     two digits for minutes, two digits\n     for seconds, and zero or more digits\n     representing second fractions.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "grouping scheduling-tolerance-parameters {\n  leaf sched-max-future {\n    type time-interval;\n    default 00:00:15.0;\n    description\n      \"When the scheduled time is in the future, i.e., greater\n       than the present time, this leaf defines the maximal\n       difference between the scheduled time\n       and the present time that the server is willing to\n       accept.  If the difference exceeds this number, the\n       server responds with an error.\";\n  }",
      "raw": true
    },
    {
      "indent": 5,
      "text": "leaf sched-max-past {\n  type time-interval;\n  default 00:00:15.0;\n  description\n    \"When the scheduled time is in the past, i.e., less\n     than the present time, this leaf defines the maximal\n     difference between the present time\n     and the scheduled time that the server is willing to\n     accept.  If the difference exceeds this number, the\n     server responds with an error.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Contains the parameters of the scheduling tolerance.\"; } // extending the get-config operation augment /nc:get-config/nc:input {",
      "ja": "説明は、「スケジューリング許容範囲のパラメータが含まれています。」; } // GET-設定操作延びる増強/ NC：取得・設定/ NC：入力{"
    },
    {
      "indent": 5,
      "text": "leaf scheduled-time {\n  type yang:date-and-time;\n  description\n    \"The time at which the RPC is scheduled to be performed.\";\n}",
      "raw": true
    },
    {
      "indent": 5,
      "text": "leaf get-time {\n  type empty;\n  description\n    \"Indicates that the rpc-reply should include the\n     execution-time.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <get-config>.\"; }",
      "ja": "説明は、 \"<GET-config>のに時間要素を追加します。\"; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:get-config/nc:output {\n  leaf execution-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC was executed.\";\n  }",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <get-config>.\"; }",
      "ja": "説明は、 \"<GET-config>のに時間要素を追加します。\"; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:get/nc:input {\n  leaf scheduled-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC is scheduled to be performed.\";\n  }",
      "raw": true
    },
    {
      "indent": 5,
      "text": "leaf get-time {\n  type empty;\n  description\n    \"Indicates that the rpc-reply should include the\n     execution-time.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <get>.\"; }",
      "ja": "説明は、「<GET>に時間要素を追加します。」; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:get/nc:output { leaf execution-time {",
      "ja": "強化/ NC：取得/ NC：出力{葉の実行時{"
    },
    {
      "indent": 5,
      "text": "  type yang:date-and-time;\n  description\n    \"The time at which the RPC was executed.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <get>.\"; }",
      "ja": "説明は、「<GET>に時間要素を追加します。」; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:copy-config/nc:input {\n  leaf scheduled-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC is scheduled to be performed.\";\n  }",
      "raw": true
    },
    {
      "indent": 5,
      "text": "leaf get-time {\n  type empty;\n  description\n    \"Indicates that the rpc-reply should include the\n     execution-time.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <copy-config>.\"; }",
      "ja": "説明は、「<コピー-config>のに時間要素を追加します。」; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:copy-config/nc:output {\n  leaf execution-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC was executed.\";\n  }",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <copy-config>.\"; }",
      "ja": "説明は、「<コピー-config>のに時間要素を追加します。」; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:edit-config/nc:input {\n  leaf scheduled-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC is scheduled to be performed.\";\n  }",
      "raw": true
    },
    {
      "indent": 5,
      "text": "leaf get-time { type empty; description",
      "ja": "葉取得時{空のタイプ。説明"
    },
    {
      "indent": 5,
      "text": " \"Indicates that the rpc-reply should include the execution-time.\"; }",
      "ja": "「RPC-返信が実行時に含める必要があることを示します。」; }"
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <edit-config>.\"; }",
      "ja": "説明は、「<編集-config>のに時間要素を追加します。」; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:edit-config/nc:output {\n  leaf execution-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC was executed.\";\n  }",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <edit-config>.\"; }",
      "ja": "説明は、「<編集-config>のに時間要素を追加します。」; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:delete-config/nc:input {\n  leaf scheduled-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC is scheduled to be performed.\";\n  }",
      "raw": true
    },
    {
      "indent": 5,
      "text": "leaf get-time {\n  type empty;\n  description\n    \"Indicates that the rpc-reply should include the\n     execution-time.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <delete-config>.\"; }",
      "ja": "説明は、「<削除-config>のに時間要素を追加します。」; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:delete-config/nc:output {\n  leaf execution-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC was executed.\";\n  }\n  description\n    \"Adds the time element to <delete-config>.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "augment /nc:lock/nc:input {",
      "ja": "増強/ NC：ロック/ NC：入力{"
    },
    {
      "indent": 5,
      "text": "leaf scheduled-time {\n  type yang:date-and-time;\n  description\n    \"The time at which the RPC is scheduled to be performed.\";\n}",
      "raw": true
    },
    {
      "indent": 5,
      "text": "leaf get-time {\n  type empty;\n  description\n    \"Indicates that the rpc-reply should include the\n     execution-time.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "  description\n    \"Adds the time element to <lock>.\";\n}\naugment /nc:lock/nc:output {\n  leaf execution-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC was executed.\";\n  }",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <lock>.\"; }",
      "ja": "説明は、「<ロック>に時間要素を追加します。」; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:unlock/nc:input {\n  leaf scheduled-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC is scheduled to be performed.\";\n  }",
      "raw": true
    },
    {
      "indent": 5,
      "text": "leaf get-time {\n  type empty;\n  description\n    \"Indicates that the rpc-reply should include the\n     execution-time.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <unlock>.\"; }",
      "ja": "説明は、「<ロック解除>に時間要素を追加します。」; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:unlock/nc:output { leaf execution-time { type yang:date-and-time;",
      "ja": "/ NCを増強する：/ NCのロックを解除する：出力{リーフ・実行時間{タイプ陽：日時。"
    },
    {
      "indent": 5,
      "text": " description \"The time at which the RPC was executed.\"; }",
      "ja": "説明「RPCが実行された時刻。」; }"
    },
    {
      "indent": 3,
      "text": "  description\n    \"Adds the time element to <unlock>.\";\n}\naugment /nc:commit/nc:input {\n  leaf scheduled-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC is scheduled to be performed.\";\n  }",
      "raw": true
    },
    {
      "indent": 5,
      "text": "leaf get-time {\n  type empty;\n  description\n    \"Indicates that the rpc-reply should include the\n     execution-time.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <commit>.\"; }",
      "ja": "説明は「<コミット>に時間要素を追加します。」; }"
    },
    {
      "indent": 3,
      "text": "augment /nc:commit/nc:output {\n  leaf execution-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC was executed.\";\n  }",
      "raw": true
    },
    {
      "indent": 3,
      "text": " description \"Adds the time element to <commit>.\"; }",
      "ja": "説明は「<コミット>に時間要素を追加します。」; }"
    },
    {
      "indent": 3,
      "text": "augment /ncm:netconf-state {\n  container scheduling-tolerance {\n    uses scheduling-tolerance-parameters;\n    description\n      \"The scheduling tolerance when the time capability\n       is enabled.\";\n  }\n  description\n    \"The scheduling tolerance of the server.\";\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "rpc cancel-schedule {",
      "ja": "RPCキャンセルスケジュールを{"
    },
    {
      "indent": 5,
      "text": "description\n  \"Cancels a scheduled message.\";\nreference\n  \"RFC 7758:\n   Time Capability in NETCONF\";",
      "raw": true
    },
    {
      "indent": 3,
      "text": "  input {\n    leaf cancelled-message-id {\n      type string;\n      description\n        \"The ID of the message to be cancelled.\";\n    }\n    leaf get-time {\n      type empty;\n      description\n        \"Indicates that the rpc-reply should include\n         the execution-time.\";\n    }\n  }\n  output {\n    leaf execution-time {\n      type yang:date-and-time;\n      description\n        \"The time at which the RPC was executed.\";\n    }\n  }\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "notification netconf-scheduled-message {\n  leaf schedule-id {\n    type string;\n    description\n      \"The ID of the scheduled message.\";\n  }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "  leaf scheduled-time {\n    type yang:date-and-time;\n    description\n      \"The time at which the RPC is scheduled to be performed.\";\n  }\n  description\n    \"Indicates that a scheduled message was received.\";\n  reference\n    \"RFC 7758:\n     Time Capability in NETCONF\";\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "}",
      "ja": "｝"
    },
    {
      "indent": 0,
      "text": "<CODE ENDS>",
      "ja": "<CODEはENDS>"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors gratefully acknowledge Joe Marcus Clarke, Andy Bierman, Balazs Lengyel, Jonathan Hansford, John Heasley, Robert Sparks, Al Morton, Olafur Gudmundsson, Juergen Schoenwaelder, Joel Jaeggli, Alon Schneider, and Eylon Egozi for their insightful comments.",
      "ja": "作者は感謝して彼らの洞察に満ちたコメントにジョー・マーカスクラーク、アンディBierman、バラージュLengyel、ジョナサン・Hansford、ジョンHeasley、ロバート・スパークス、アル・モートン、オラフルグドムンソン、ユルゲンSchoenwaelder、ジョエルJaeggli、アロンシュナイダー、およびEylon Egoziを認めます。"
    },
    {
      "indent": 3,
      "text": "This work was supported in part by Israel Science Foundation grant ISF 1520/11.",
      "ja": "この作品は、イスラエル科学財団の助成ISF 1520から1511によって部分的にサポートされていました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Tal Mizrahi Department of Electrical Engineering Technion - Israel Institute of Technology Technion City, Haifa, 32000 Israel",
      "ja": "電気工学テクニオンのタルミズラヒ部門 - イスラエル工科大学テクニオン市、ハイファ、32000イスラエル"
    },
    {
      "indent": 3,
      "text": "Email: dew@tx.technion.ac.il",
      "ja": "メール：dew@tx.technion.ac.il"
    },
    {
      "indent": 3,
      "text": "Yoram Moses Department of Electrical Engineering Technion - Israel Institute of Technology Technion City, Haifa, 32000 Israel",
      "ja": "電気工学テクニオンのヨラム・モージズ部門 - イスラエル工科大学テクニオン市、ハイファ、32000イスラエル"
    },
    {
      "indent": 3,
      "text": "Email: moses@ee.technion.ac.il",
      "ja": "メール：moses@ee.technion.ac.il"
    }
  ]
}