{
  "title": {
    "text": "RFC 7647 - Clarifications for the Use of REFER with RFC 6665",
    "ja": "RFC 7647 - RFC 6665でREFERの使用のための明確化"
  },
  "number": 7647,
  "created_at": "2019-10-31 16:52:54.725971+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         R. Sparks\nRequest for Comments: 7647                                        Oracle\nUpdates: 3515                                                 A.B. Roach\nCategory: Standards Track                                        Mozilla\nISSN: 2070-1721                                           September 2015",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Clarifications for the Use of REFER with",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The SIP REFER method relies on the SIP-Specific Event Notification framework. That framework was revised by RFC 6665. This document highlights the implications of the requirement changes in RFC 6665, and updates the definition of the REFER method described in RFC 3515 to clarify and disambiguate the impact of those changes.",
      "ja": "SIPは、方法はSIP固有のイベント通知フレームワークに依存している参照してください。そのフレームワークは、この文書では、RFC 6665における要件の変更の影響を強調し、かつ明確にその変更の影響を明確にするためにRFC 3515に記載REFERメソッドの定義を更新するRFC 6665.によっ​​て修正されました。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7647.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7647で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Conventions Used in This Document . . . . . . . . . . . . . .   2\n3.  Use of GRUU Is Mandatory  . . . . . . . . . . . . . . . . . .   3\n4.  Dialog Reuse Is Prohibited  . . . . . . . . . . . . . . . . .   3\n5.  The 202 Response Code Is Deprecated . . . . . . . . . . . . .   4\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   4\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   4\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .   4\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .   5\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   6\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The SIP REFER method relies on the SIP-Specific Event Notification framework. That framework was revised by [RFC6665]. This document highlights the implications of the requirement changes in RFC 6665, and updates [RFC3515] to clarify and disambiguate the impact of those changes.",
      "ja": "SIPは、方法はSIP固有のイベント通知フレームワークに依存している参照してください。そのフレームワークは、[RFC6665]で修正されました。この文書は、RFC 6665における要件の変更の影響を強調し、そしてこれらの変更の影響を明確にし、明確にするためにアップデート[RFC3515]。"
    },
    {
      "indent": 3,
      "text": "Accepting a REFER request (without invoking extensions) results in an implicit SIP-Events subscription. If that REFER was part of an existing dialog, the implicit subscription creates a new, problematic dialog usage within that dialog [RFC5057]. The \"norefersub\" extension defined in [RFC4488] asks to suppress this implicit subscription, but cannot prevent its creation.",
      "ja": "暗黙のSIP-イベントサブスクリプションでの結果（拡張子を起動せずに）REFER要求を受け付けます。それは、既存のダイアログの一部であった参照している場合、暗黙のサブスクリプションは、そのダイアログ[RFC5057]内の新しい、問題のダイアログの使用を作成します。 [RFC4488]で定義された「norefersub」拡張子は、この暗黙のサブスクリプションを抑制するために要求しますが、その作成を防ぐことはできません。"
    },
    {
      "indent": 3,
      "text": "There are implementations in some known specialized environments (such as 3GPP) that use out-of-signaling agreements to ensure that in-dialog REFER requests using the RFC 4488 extension do not create a new subscription inside that dialog. In the 3GPP environment, the behavior is based on capabilities advertised using media feature tags. That mechanism does not, however, prevent additional dialog usages when interoperating with implementations that do not support the mechanism. The extensions in [RFC7614] provide a standardized mechanism that allows avoiding any additional dialog usage.",
      "ja": "で、ダイアログREFER RFC 4488拡張機能を使用してリクエストがそのダイアログ内に新しいサブスクリプションを作成しないことを確実にするために、アウトオブシグナル契約を使用し（例えば、3GPPなど）いくつかの既知の特殊な環境での実装があります。 3GPP環境では、動作は、メディア特徴タグを使用してアドバタイズ機能に基づいています。メカニズムをサポートしない実装と相互運用する場合、そのメカニズムは、しかし、追加のダイアログの使用状況を防ぐことはできません。 [RFC7614]での拡張機能は、追加のダイアログの使用を避けることができる標準化されたメカニズムを提供します。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Use of GRUU Is Mandatory",
      "section_title": true,
      "ja": "GRUUの3.は必須です"
    },
    {
      "indent": 3,
      "text": "Section 4.5.1 of [RFC6665] makes GRUU [RFC5627] mandatory for notifiers to implement and use as the local target in the subscription created by the REFER request.",
      "ja": "[RFC 6665]のセクション4.5.1には、届出者は、REFERリクエストによって作成されたサブスクリプションに実装し、地元のターゲットとして使用するためにGRUU [RFC 5627]は必須になります。"
    },
    {
      "indent": 3,
      "text": "A user agent (UA) accepting a REFER that creates a subscription MUST populate its Contact header field with a GRUU.",
      "ja": "その参照を受け付けるユーザエージェント（UA）は、サブスクリプションは、GRUUとのContactヘッダーフィールドを移入する必要があります作成します。"
    },
    {
      "indent": 3,
      "text": "A UA that might possibly become a notifier (e.g., by accepting a REFER request that creates a subscription) needs to include a GRUU in the Contact header field of dialog-forming and target-refresh methods (such as INVITE) [RFC7621]. This ensures that out-of-dialog REFER requests corresponding to any resulting INVITE dialogs arrive at this UA. Extensions can relax this requirement by defining a REFER request that cannot create an implicit subscription, thus not causing the accepting UA to become an RFC 6665 notifier in the context of this dialog. [RFC7614] is an example of such an extension.",
      "ja": "おそらく（例えば、サブスクリプションを作成REFERリクエストを受け入れることにより）通知になるかもしれないUAは、（INVITEなど）ダイアログ形成及びターゲットリフレッシュ方法のContactヘッダーフィールドにGRUU [RFC7621]を含む必要があります。これは、外のダイアログがダイアログがこのUAに到着INVITE結果のいずれかに対応するリクエストを参照することを保証します。拡張機能は、このように受け入れて、UAは、このダイアログのコンテキストでRFC 6665通知になることを引き起こしていない、暗黙のサブスクリプションを作成することはできませんREFER要求を定義することによって、この要件を緩和することができます。 [RFC7614]は、そのような拡張の例です。"
    },
    {
      "indent": 0,
      "text": "4. Dialog Reuse Is Prohibited",
      "section_title": true,
      "ja": "4.ダイアログ再利用される禁止"
    },
    {
      "indent": 3,
      "text": "If a peer in an existing dialog has provided a GRUU as its Contact, sending a REFER that might result in an additional dialog usage within that dialog is prohibited. This is a direct consequence of [RFC6665] requiring the use of GRUU and the requirements in Section 4.5.2 of that document.",
      "ja": "既存のダイアログ内のピアは、それがそのダイアログ内の追加]ダイアログの使用につながる可能性がREFERを送信し、その連絡先としてGRUUを提供している場合は禁止されています。これは、GRUUを使用すると、そのドキュメントのセクション4.5.2における要件を必要とする[RFC6665]の直接の結果です。"
    },
    {
      "indent": 3,
      "text": "A user agent constructing a REFER request that could result in an implicit subscription in a dialog MUST build it as an out-of-dialog message as defined in [RFC3261], unless the remote endpoint is an older implementation of RFC 3515 that has not been updated to conform to RFC 6665 (as determined by the absence of a GRUU in the remote target). Thus, the REFER request will have no tag parameter in its To: header field.",
      "ja": "リモートエンドポイントがされていないRFC 3515の古い実装でない限り、[RFC3261]で定義されたアウトオブダイアログメッセージとしてそれを構築する必要があり、ダイアログで暗黙のサブスクリプションにつながる可能性がREFERリクエストを構築するユーザーエージェント（リモートターゲットにGRUUの不在によって決定される）RFC 6665に準拠するように更新。ヘッダフィールド：このように、REFER要求は、そのするには、タグのパラメータを持っていないであろう。"
    },
    {
      "indent": 3,
      "text": "Using the \"norefersub\" option tag [RFC4488] does not change this requirement, even if used in a \"Require\" header field. Even if the recipient supports the \"norefersub\" mechanism, and accepts the request with the option tag in the \"Require\" header field, it is allowed to return a \"Refer-Sub\" header field with a value of \"true\" in the response, and create an implicit subscription.",
      "ja": "「norefersub」オプションタグ[RFC4488]を使用すると、「要求」ヘッダフィールドで使用される場合であっても、この要件を変更しません。受信者が「norefersub」メカニズムをサポートし、「必要」ヘッダフィールドのオプションタグで要求を受け付けた場合でも、応答して「真」の値と「参照してください - サブ」ヘッダフィールドを返すことが許可されています、および暗黙のサブスクリプションを作成します。"
    },
    {
      "indent": 3,
      "text": "A user agent wishing to identify an existing dialog (such as for call transfer as defined in [RFC5589]) MUST use the \"Target-Dialog\" extension defined in [RFC4538] to do so, and user agents accepting REFER MUST be able to process that extension in requests they receive.",
      "ja": "REFER受け入れそうする中で定義された「ターゲット・ダイアログ」の拡張子[RFC4538]を使用し、ユーザエージェント必要があります（[RFC5589]で定義されるようなコール転送のような）既存のダイアログを識別することを望むユーザエージェントは、処理できなければなりません彼らは受信リクエストでその拡張子。"
    },
    {
      "indent": 3,
      "text": "If a user agent can be certain that no implicit subscription will be created as a result of sending a REFER request (such as by requiring an extension that disallows any such subscription [RFC7614]), the REFER request MAY be sent within an existing dialog (whether or not the remote target is a GRUU). Such a REFER will be constructed with its Contact header field populated with the dialog's local URI as specified in Section 12 of [RFC3261].",
      "ja": "ユーザエージェントは、暗黙的なサブスクリプションは、（例えば、そのようなサブスクリプション[RFC7614]を禁止拡張を必要とするなど）REFER要求を送信した結果として作成されないことを特定することができれば、REFER要求は、（既存のダイアログ内で送信されるかもしれませんリモートターゲット）GRUUであるか否かを判定する。 [RFC3261]のセクション12で指定されるようにREFERようなダイアログのローカルURIで占めそのContactヘッダーフィールドで構成されます。"
    },
    {
      "indent": 3,
      "text": "As described in Section 4.5.2 of [RFC6665], there are cases where a user agent may fall back to sharing existing dialogs for backwards-compatibility purposes. This applies to a REFER only when the peer has not provided a GRUU as its Contact in the existing dialog (i.e., when the peer is an implementation of RFC 3515 that has not been updated to conform with RFC 6665).",
      "ja": "[RFC6665]のセクション4.5.2に記載したように、ユーザエージェントは、後方互換性のために既存のダイアログを共有するにフォールバックすることができる場合があります。これが適用されるピアが既存のダイアログ内の連絡先としてGRUUを提供していないときのみ、REFER（すなわち、ピアは、RFC 6665に準拠するように更新されていないRFC 3515の実装がある場合）。"
    },
    {
      "indent": 0,
      "text": "5. The 202 Response Code Is Deprecated",
      "section_title": true,
      "ja": "5. 202応答コードは廃止されました"
    },
    {
      "indent": 3,
      "text": "Section 8.3.1 of [RFC6665] requires that elements not send a 202 response code to a subscribe request, but use the 200 response code instead. Any 202 response codes received to a subscribe request are treated as 200s. These changes also apply to REFER. Specifically, an element accepting a REFER request MUST NOT reply with a 202 response code and MUST treat any 202 responses received as identical to a 200 response. Wherever [RFC3515] requires sending a 202 response code, a 200 response code MUST be sent instead.",
      "ja": "[RFC6665]のセクション8.3.1は、要素がサブスクライブ要求に202応答コードを送信し、その代わりに200応答コードを使用しないことを要求します。 SUBSCRIBEリクエストを受信した202の応答コードは200Sとして扱われます。これらの変更はまた、参照するために適用されます。具体的には、要素は、REFER要求は、202応答コードで応答してはいけませんと200応答と同じように受信した202の応答を処理しなければならない受け入れます。 [RFC3515]は202応答コードを送信する必要限り、200レスポンスコードが代わりに送信されなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document introduces no new security considerations directly. The updated considerations in [RFC6665] apply to the implicit subscription created by an accepted REFER request.",
      "ja": "この文書は、直接、どんな新しいセキュリティ問題も紹介しません。 [RFC6665]で更新考慮事項が認められたREFER要求によって作成された暗黙のサブスクリプションに適用されます。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, DOI 10.17487/RFC3261, June 2002, <http://www.rfc-editor.org/info/rfc3261>.",
      "ja": "[RFC3261]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\" 、RFC 3261、DOI 10.17487 / RFC3261、2002年6月、<http://www.rfc-editor.org/info/rfc3261>。"
    },
    {
      "indent": 3,
      "text": "[RFC3515] Sparks, R., \"The Session Initiation Protocol (SIP) Refer Method\", RFC 3515, DOI 10.17487/RFC3515, April 2003, <http://www.rfc-editor.org/info/rfc3515>.",
      "ja": "[RFC3515]スパークス、R.、 \"セッション開始プロトコル（SIP）メソッドを参照してください\"、RFC 3515、DOI 10.17487 / RFC3515、2003年4月、<http://www.rfc-editor.org/info/rfc3515>。"
    },
    {
      "indent": 3,
      "text": "[RFC4538] Rosenberg, J., \"Request Authorization through Dialog Identification in the Session Initiation Protocol (SIP)\", RFC 4538, DOI 10.17487/RFC4538, June 2006, <http://www.rfc-editor.org/info/rfc4538>.",
      "ja": "[RFC4538]ローゼンバーグ、J.、 \"セッション開始プロトコル（SIP）におけるダイアログ識別介して要求承認\"、RFC 4538、DOI 10.17487 / RFC4538、2006年6月<http://www.rfc-editor.org/info/ rfc4538>。"
    },
    {
      "indent": 3,
      "text": "[RFC5627] Rosenberg, J., \"Obtaining and Using Globally Routable User Agent URIs (GRUUs) in the Session Initiation Protocol (SIP)\", RFC 5627, DOI 10.17487/RFC5627, October 2009, <http://www.rfc-editor.org/info/rfc5627>.",
      "ja": "[RFC5627]ローゼンバーグ、J.、2009年10月、RFC 5627、DOI 10.17487 / RFC5627、 \"セッション開始プロトコル（SIP）でグローバルにルーティング可能なユーザエージェントのURI（GRUUs）の取得と使用\"、<のhttp：//www.rfc- editor.org/info/rfc5627>。"
    },
    {
      "indent": 3,
      "text": "[RFC6665] Roach, A.B., \"SIP-Specific Event Notification\", RFC 6665, DOI 10.17487/RFC6665, July 2012, <http://www.rfc-editor.org/info/rfc6665>.",
      "ja": "[RFC6665]ローチ、A.B.、 \"SIP固有のイベント通知\"、RFC 6665、DOI 10.17487 / RFC6665、2012年7月、<http://www.rfc-editor.org/info/rfc6665>。"
    },
    {
      "indent": 3,
      "text": "[RFC7621] Roach, A.B., \"A Clarification on the Use of Globally Routable User Agent URIs (GRUUs) in the SIP Event Notification Framework\", RFC 7621, DOI 10.17487/RFC7621, August 2015, <http://www.rfc-editor.org/info/rfc7621>.",
      "ja": "[RFC7621]ローチ、AB、 \"SIPイベント通知フレームワークでグローバルにルーティング可能なユーザエージェントのURI（GRUUs）の使用上の明確化\"、RFC 7621、DOI 10.17487 / RFC7621、2015年8月、<のhttp：//www.rfc- editor.org/info/rfc7621>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC4488] Levin, O., \"Suppression of Session Initiation Protocol (SIP) REFER Method Implicit Subscription\", RFC 4488, DOI 10.17487/RFC4488, May 2006, <http://www.rfc-editor.org/info/rfc4488>.",
      "ja": "[RFC4488]レヴィン、O.、RFC 4488、DOI 10.17487 / RFC4488、2006年5月 \"セッション開始プロトコル（SIP）の抑制は、メソッドの暗黙の契約をREFER\"、<http://www.rfc-editor.org/info/rfc4488 >。"
    },
    {
      "indent": 3,
      "text": "[RFC5057] Sparks, R., \"Multiple Dialog Usages in the Session Initiation Protocol\", RFC 5057, DOI 10.17487/RFC5057, November 2007, <http://www.rfc-editor.org/info/rfc5057>.",
      "ja": "[RFC5057]は、 \"セッション開始プロトコルの複数の対話用法\"、RFC 5057は、R.、スパークス、DOI 10.17487 / RFC5057、2007年11月、<http://www.rfc-editor.org/info/rfc5057>。"
    },
    {
      "indent": 3,
      "text": "[RFC5589] Sparks, R., Johnston, A., Ed., and D. Petrie, \"Session Initiation Protocol (SIP) Call Control - Transfer\", BCP 149, RFC 5589, DOI 10.17487/RFC5589, June 2009, <http://www.rfc-editor.org/info/rfc5589>.",
      "ja": "[RFC5589]は、R.、ジョンストン、A.、エド・スパークス、およびD.ペトリー、 \"セッション開始プロトコル（SIP）呼制御 - 転送\"、BCP 149、RFC 5589、DOI 10.17487 / RFC5589、2009年6月、<HTTP ：//www.rfc-editor.org/info/rfc5589>。"
    },
    {
      "indent": 3,
      "text": "[RFC7614] Sparks, R., \"Explicit Subscriptions for the REFER Method\", RFC 7614, DOI 10.17487/RFC7614, August 2015, <http://www.rfc-editor.org/info/rfc7614>.",
      "ja": "[RFC7614]スパークス、R.、 \"メソッドを参照してください明示的なサブスクリプション\"、RFC 7614、DOI 10.17487 / RFC7614、2015年8月、<http://www.rfc-editor.org/info/rfc7614>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Christer Holmberg provided the formulation for the final paragraph of the introduction. Christer Holmberg and Ivo Sedlacek provided detailed comments during working group discussion of the document.",
      "ja": "クリステルHolmbergのは、導入の最終段落の製剤を提供します。クリステルHolmbergのとアイボ・セドレセックは、文書のワーキンググループディスカッションの際に詳細なコメントを提供しました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Robert Sparks Oracle 7460 Warren Parkway Suite 300 Frisco, Texas 75034 United States",
      "ja": "ロバート・スパークスのOracle 7460ウォーレン・パークウェイスイート300フリスコ、テキサス75034米国"
    },
    {
      "indent": 3,
      "text": "Email: rjsparks@nostrum.com",
      "ja": "メール：rjsparks@nostrum.com"
    },
    {
      "indent": 3,
      "text": "Adam Roach Mozilla Dallas, TX United States",
      "ja": "アダムローチMozillaのダラス、TX、米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650 903 0800 x863 Email: adam@nostrum.com",
      "ja": "電話：+1 650 903 0800 x863電子メール：adam@nostrum.com"
    }
  ]
}