{
  "title": {
    "text": "RFC 7205 - Use Cases for Telepresence Multistreams",
    "ja": "RFC 7205 - テレプレゼンスMultistreams用ケースを使用します"
  },
  "number": 7205,
  "created_at": "2019-10-30 02:38:42.843589+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        A. Romanow\nRequest for Comments: 7205                                         Cisco\nCategory: Informational                                        S. Botzko\nISSN: 2070-1721                                             M. Duckworth\n                                                                 Polycom\n                                                            R. Even, Ed.\n                                                     Huawei Technologies\n                                                              April 2014",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Use Cases for Telepresence Multistreams",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Telepresence conferencing systems seek to create an environment that gives users (or user groups) that are not co-located a feeling of co-located presence through multimedia communication that includes at least audio and video signals of high fidelity. A number of techniques for handling audio and video streams are used to create this experience. When these techniques are not similar, interoperability between different systems is difficult at best, and often not possible. Conveying information about the relationships between multiple streams of media would enable senders and receivers to make choices to allow telepresence systems to interwork. This memo describes the most typical and important use cases for sending multiple streams in a telepresence conference.",
      "ja": "テレプレゼンス会議システムは、与えられる環境を作成しようと、高忠実度の少なくともオーディオおよびビデオ信号を含むマルチメディア通信による共同設置の存在感を同じ場所に配置されていないユーザー（またはユーザーグループ）。オーディオおよびビデオストリームを処理するための多数の技術が、この経験を作成するために使用されています。これらの技術は類似していない場合は、異なるシステム間の相互運用性は、困難で最高の、そして多くの場合は不可能です。メディアの複数のストリーム間の関係についての情報を伝達することは、テレプレゼンスシステムが相互に作用することを可能にする選択を行うために送信者と受信を可能にします。このメモは、テレプレゼンス会議に複数のストリームを送信するための最も一般的な、重要なユースケースを説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7205.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7205で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Overview of Telepresence Scenarios  . . . . . . . . . . . . .   4\n3.  Use Cases . . . . . . . . . . . . . . . . . . . . . . . . . .   6\n  3.1.  Point-to-Point Meeting: Symmetric . . . . . . . . . . . .   7\n  3.2.  Point-to-Point Meeting: Asymmetric  . . . . . . . . . . .   7\n  3.3.  Multipoint Meeting  . . . . . . . . . . . . . . . . . . .   9\n  3.4.  Presentation  . . . . . . . . . . . . . . . . . . . . . .  10\n  3.5.  Heterogeneous Systems . . . . . . . . . . . . . . . . . .  11\n  3.6.  Multipoint Education Usage  . . . . . . . . . . . . . . .  12\n  3.7.  Multipoint Multiview (Virtual Space)  . . . . . . . . . .  14\n  3.8.  Multiple Presentation Streams - Telemedicine  . . . . . .  15\n4.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  16\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .  16\n6.  Informative References  . . . . . . . . . . . . . . . . . . .  16",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Telepresence applications try to provide a \"being there\" experience for conversational video conferencing. Often, this telepresence application is described as \"immersive telepresence\" in order to distinguish it from traditional video conferencing and from other forms of remote presence not related to conversational video conferencing, such as avatars and robots. The salient characteristics of telepresence are often described as: being actual sized, providing immersive video, preserving interpersonal interaction, and allowing non-verbal communication.",
      "ja": "テレプレゼンスアプリケーションは、会話ビデオ会議のための「そこにいる」体験を提供してみてください。多くの場合、このテレプレゼンスアプリケーションは、従来のビデオ会議からと、このようなアバターやロボットなどの会話ビデオ会議に関連していないリモート・プレゼンスの他の形態、と区別するために「イマーシブテレプレゼンス」と記載されています。 、サイズの実際のもの、臨場感あふれる映像を提供する対人相互作用を維持し、非言語コミュニケーションを可能：テレプレゼンスの顕著な特徴は、多くの場合として記載されています。"
    },
    {
      "indent": 3,
      "text": "Although telepresence systems are based on open standards such as RTP [RFC3550], SIP [RFC3261], H.264 [ITU.H264], and the H.323 [ITU.H323] suite of protocols, they cannot easily interoperate with each other without operator assistance and expensive additional equipment that translates from one vendor's protocol to another.",
      "ja": "テレプレゼンスシステムは、このようなRTP [RFC3550]、SIP [RFC3261]、264 [ITU.H264]、およびプロトコルのH.323 [ITU.H323]スイートなどのオープンスタンダードに基づいているが、それらは容易に相互運用することができません別のベンダーのプロトコルから変換するオペレータ案内、高価な追加装備なし。"
    },
    {
      "indent": 3,
      "text": "The basic features that give telepresence its distinctive characteristics are implemented in disparate ways in different systems. Currently, telepresence systems from diverse vendors interoperate to some extent, but this is not supported in a standards-based fashion. Interworking requires that translation and transcoding devices be included in the architecture. Such devices increase latency, reducing the quality of interpersonal interaction. Use of these devices is often not automatic; it frequently requires substantial manual configuration and a detailed understanding of the nature of underlying audio and video streams. This state of affairs is not acceptable for the continued growth of telepresence -- these systems should have the same ease of interoperability as do telephones. Thus, a standard way of describing the multiple streams constituting the media flows and the fundamental aspects of their behavior would allow telepresence systems to interwork.",
      "ja": "テレプレゼンスにその独特の特性を与える基本的な機能は、異なるシステムでは、異なる方法で実装されています。現在、多様なベンダーからのテレプレゼンスシステムでは、ある程度の相互運用が、これは、標準ベースの方法でサポートされていません。インターワーキングは、翻訳およびトランスコーディングデバイスはアーキテクチャに含まれている必要があります。このようなデバイスは、対人相互作用の品質を低下させる、待ち時間が増加します。これらのデバイスの使用は、多くの場合、自動ではありません。それは頻繁にかなりの手動構成および基本的なオーディオおよびビデオストリームの性質を詳細に理解する必要があります。事務のこの状態は、テレプレゼンスの継続的な成長のために受け入れられない - 電話がそうであるように、これらのシステムは、相互運用性の同じやすさを持っている必要があります。したがって、メディアフロー及びその動作の基本的な局面を構成する複数のストリームを記述する標準的な方法は、テレプレゼンスシステムが連動することを可能にします。"
    },
    {
      "indent": 3,
      "text": "This document presents a set of use cases describing typical scenarios. Requirements will be derived from these use cases in a separate document. The use cases are described from the viewpoint of the users. They are illustrative of the user experience that needs to be supported. It is possible to implement these use cases in a variety of different ways.",
      "ja": "この文書では、一般的なシナリオを記述したユースケースのセットを提示します。要件は、別の文書でこれらのユースケースから導出されます。ユースケースは、ユーザの観点から記載されています。彼らは、サポートする必要のあるユーザーエクスペリエンスを例示するものです。さまざまな方法でこれらのユースケースを実現することが可能です。"
    },
    {
      "indent": 3,
      "text": "Many different scenarios need to be supported. This document describes in detail the most common and basic use cases. These will cover most of the requirements. There may be additional scenarios that bring new features and requirements that can be used to extend the initial work.",
      "ja": "多くの異なるシナリオがサポートされる必要があります。この文書では、具体的に、最も一般的かつ基本的な使用例を示します。これらは、要件のほとんどをカバーします。初期の作品を拡張するために使用することができ、新機能と要件をもたらす追加的なシナリオがあるかもしれません。"
    },
    {
      "indent": 3,
      "text": "Point-to-point and multipoint telepresence conferences are considered. In some use cases, the number of screens is the same at all sites; in others, the number of screens differs at different sites. Both use cases are considered. Also included is a use case describing display of presentation material or content.",
      "ja": "ポイントツーポイントおよびマルチテレプレゼンス会議が検討されています。いくつかのユースケースでは、スクリーンの数は、すべてのサイトで同じです。他では、スクリーンの数が異なるサイトで異なります。両方のユースケースが考えられています。また、プレゼンテーション資料やコンテンツの表示を説明するユースケースも含まれます。"
    },
    {
      "indent": 3,
      "text": "The multipoint use cases may include a variety of systems from conference room systems to handheld devices, and such a use case is described in the document.",
      "ja": "マルチユースケースは、ハンドヘルドデバイスへの会議室システムからシステムの多様を含むことができ、このようなユースケースは、文書に記載されています。"
    },
    {
      "indent": 3,
      "text": "This document's structure is as follows: Section 2 gives an overview of scenarios, and Section 3 describes use cases.",
      "ja": "次のようにこのドキュメントの構造は次のとおりです。第2章では、シナリオの概要を示し、そして第3節では、ユースケースを説明します。"
    },
    {
      "indent": 0,
      "text": "2. Overview of Telepresence Scenarios",
      "section_title": true,
      "ja": "テレプレゼンスのシナリオの概要2。"
    },
    {
      "indent": 3,
      "text": "This section describes the general characteristics of the use cases and what the scenarios are intended to show. The typical setting is a business conference, which was the initial focus of telepresence. Recently, consumer products are also being developed. We specifically do not include in our scenarios the physical infrastructure aspects of telepresence, such as room construction, layout, and decoration. Furthermore, these use cases do not describe all the aspects needed to create the best user experience (for example, the human factors).",
      "ja": "このセクションでは、ユースケースとどのようなシナリオが示すことを意図しているの一般的な特性について説明します。典型的な設定は、テレプレゼンスの初期フォーカスしたビジネス会議、です。最近では、消費者製品も開発されています。私たちは、具体的には、部屋の建設、レイアウト、装飾として、私たちのシナリオでテレプレゼンスの物理インフラの側面を含んでいません。さらに、これらのユースケースは、最高のユーザーエクスペリエンスを作成するために必要なすべての側面（例えば、人的要因）を記述しません。"
    },
    {
      "indent": 3,
      "text": "We also specifically do not attempt to precisely define the boundaries between telepresence systems and other systems, nor do we attempt to identify the \"best\" solution for each presented scenario.",
      "ja": "我々はまた、特に正確にテレプレゼンスシステムと他のシステム間の境界を定義しようとせず、また当社は各提示シナリオの「最善」のソリューションを識別しようとします。"
    },
    {
      "indent": 3,
      "text": "Telepresence systems are typically composed of one or more video cameras and encoders and one or more display screens of large size (diagonal around 60 inches). Microphones pick up sound, and audio codec(s) produce one or more audio streams. The cameras used to capture the telepresence users are referred to as \"participant cameras\" (and likewise for screens). There may also be other cameras, such as for document display. These will be referred to as \"presentation cameras\" or \"content cameras\", which generally have different formats, aspect ratios, and frame rates from the participant cameras. The presentation streams may be shown on participant screens or on auxiliary display screens. A user's computer may also serve as a virtual content camera, generating an animation or playing a video for display to the remote participants.",
      "ja": "テレプレゼンスシステムは、典型的には、1台の以上のビデオカメラとエンコーダと大きいサイズ（対角約60インチ）の1つ以上の表示画面で構成されています。マイクは音を拾う、およびオーディオコーデック（複数可）は、1つまたは複数のオーディオストリームを生成します。テレプレゼンスユーザを捕捉するために使用されるカメラは、「参加者のカメラ」（同様に画面の場合）と呼ばれています。また、このような文書表示用として他のカメラがあるかもしれません。これらは、一般参加者のカメラから異なるフォーマット、アスペクト比、フレームレートを有する「プレゼンテーションカメラ」または「コンテンツ・カメラ」、と呼ぶことにします。プレゼンテーションストリームは、参加者の画面上または補助ディスプレイ画面上に表示されてもよいです。ユーザーのコンピュータにも、アニメーションを生成するか、リモートの参加者に表示するためにビデオを再生し、仮想コンテンツカメラとして機能することができます。"
    },
    {
      "indent": 3,
      "text": "We describe such a telepresence system as sending one or more video streams, audio streams, and presentation streams to the remote system(s).",
      "ja": "私たちは、リモートシステムに1つ以上のビデオストリーム、オーディオストリーム、およびプレゼンテーションストリームを送信するようなテレプレゼンスシステムを説明します。"
    },
    {
      "indent": 3,
      "text": "The fundamental parameters describing today's typical telepresence scenarios include:",
      "ja": "今日の典型的なテレプレゼンスのシナリオを記述する基本的なパラメータは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "1. The number of participating sites",
      "section_title": true,
      "ja": "1.参加サイトの数"
    },
    {
      "indent": 3,
      "text": "2. The number of visible seats at a site",
      "section_title": true,
      "ja": "2.サイトで目に見える座席数"
    },
    {
      "indent": 3,
      "text": "3. The number of cameras",
      "section_title": true,
      "ja": "3.カメラの数"
    },
    {
      "indent": 3,
      "text": "4. The number and type of microphones",
      "section_title": true,
      "ja": "4.数とマイクのタイプ"
    },
    {
      "indent": 3,
      "text": "5. The number of audio channels",
      "section_title": true,
      "ja": "オーディオチャンネルの5.数"
    },
    {
      "indent": 3,
      "text": "6. The screen size",
      "section_title": true,
      "ja": "6.画面サイズ"
    },
    {
      "indent": 3,
      "text": "7. The screen capabilities -- such as resolution, frame rate, aspect ratio",
      "ja": "7.スクリーン機能 - 例えば、解像度、フレームレート、アスペクト比として"
    },
    {
      "indent": 3,
      "text": "8. The arrangement of the screens in relation to each other",
      "section_title": true,
      "ja": "8.互いに対してスクリーンの配置"
    },
    {
      "indent": 3,
      "text": "9. The number of primary screens at each site",
      "section_title": true,
      "ja": "9.各サイトの主な画面数"
    },
    {
      "indent": 3,
      "text": "10. Type and number of presentation screens",
      "section_title": true,
      "ja": "プレゼンテーション画面の10種類と数"
    },
    {
      "indent": 3,
      "text": "11. Multipoint conference display strategies -- for example, the camera-to-screen mappings may be static or dynamic",
      "ja": "11.マルチポイント会議ディスプレイ戦略は - 例えば、カメラの画面マッピングは静的または動的であってもよいです"
    },
    {
      "indent": 3,
      "text": "12. The camera point of capture",
      "section_title": true,
      "ja": "捕捉の12カメラポイント"
    },
    {
      "indent": 3,
      "text": "13. The cameras fields of view and how they spatially relate to each other",
      "ja": "13.ビューのカメラのフィールドとそれらがどのように空間的相互関係"
    },
    {
      "indent": 3,
      "text": "As discussed in the introduction, the basic features that give telepresence its distinctive characteristics are implemented in disparate ways in different systems.",
      "ja": "導入部で論じたように、テレプレゼンスにその独特の特性を与える基本的な特徴は、異なるシステムに異なる方法で実装されています。"
    },
    {
      "indent": 3,
      "text": "There is no agreed upon way to adequately describe the semantics of how streams of various media types relate to each other. Without a standard for stream semantics to describe the particular roles and activities of each stream in the conference, interoperability is cumbersome at best.",
      "ja": "適切に様々なメディアタイプのストリームが互いにどのように関係するかの意味を記述するための方法で合意なしにはありません。ストリームのセマンティクスが会議に各ストリームの特定の役割と活動を記述するための標準がなければ、相互運用性は最高で面倒です。"
    },
    {
      "indent": 3,
      "text": "In a multiple-screen conference, the video and audio streams sent from remote participants must be understood by receivers so that they can be presented in a coherent and life-like manner. This includes the ability to present remote participants at their actual size for their apparent distance, while maintaining correct eye contact, gesticular cues, and simultaneously providing a spatial audio sound stage that is consistent with the displayed video.",
      "ja": "彼らは一貫して生きているような方法で提示することができるように複数画面の会議では、リモート参加者から送られたビデオとオーディオストリームは、受信機によって理解されなければなりません。正しいアイコンタクト、無意識の動作（ジェスチャー）キューを維持し、同時に表示される映像と一致する空間オーディオサウンドステージを提供しながら、これは、その見かけの距離のために、実際のサイズで遠隔参加者を提示する能力を含みます。"
    },
    {
      "indent": 3,
      "text": "The receiving device that decides how to render incoming information needs to understand a number of variables such as the spatial position of the speaker, the field of view of the cameras, the camera zoom, which media stream is related to each of the screens, etc. It is not simply that individual streams must be adequately described, to a large extent this already exists, but rather that the semantics of the relationships between the streams must be communicated. Note that all of this is still required even if the basic aspects of the streams, such as the bit rate, frame rate, and aspect ratio, are known. Thus, this problem has aspects considerably beyond those encountered in interoperation of video conferencing systems that have a single camera/screen.",
      "ja": "入ってくる情報をレンダリングする方法を決定し、受信装置は等、そのようなメディアストリームが画面のそれぞれに関連するスピーカの空間的な位置、カメラの視野、カメラズーム、などの変数の数を把握する必要があります。これは、かなりの程度まで、これはすでに存在している、個々のストリームを適切に説明されなければならないことは、単にではなく、ストリーム間の関係の意味は、通信されなければならないこと。このすべてが、まだそのようなビットレート、フレームレート、アスペクト比などのストリームの基本的な態様は、知られている場合でも、必要とされることに留意されたいです。したがって、この問題はかなり単一のカメラ/スクリーンを持っているビデオ会議システムの相互運用に遭遇したもの以外の側面を持っています。"
    },
    {
      "indent": 0,
      "text": "3. Use Cases",
      "section_title": true,
      "ja": "3.ユースケース"
    },
    {
      "indent": 3,
      "text": "The use cases focus on typical implementations. There are a number of possible variants for these use cases; for example, the audio supported may differ at the end points (such as mono or stereo versus surround sound), etc.",
      "ja": "ユースケースは、一般的な実装に焦点を当てています。これらのユースケースのための可能な変形の数があります。例えば、サポートされるオーディオ等、（例えば、サラウンドサウンド対モノラルまたはステレオのような）エンドポイントで異なっていてもよいです"
    },
    {
      "indent": 3,
      "text": "Many of these systems offer a \"full conference room\" solution, where local participants sit at one side of a table and remote participants are displayed as if they are sitting on the other side of the table. The cameras and screens are typically arranged to provide a panoramic view of the remote room (left to right from the local user's viewpoint).",
      "ja": "これらのシステムの多くは、テーブルの反対側に座っているかのように地元の参加者が表示され、テーブルとリモート参加者の一方の側に座って「フル会議室」ソリューションを提供します。カメラおよびスクリーンは、典型的には、（ローカルユーザの視点から、左から右へ）、リモート部屋のパノラマビューを提供するように配置されています。"
    },
    {
      "indent": 3,
      "text": "The sense of immersion and non-verbal communication is fostered by a number of technical features, such as:",
      "ja": "浸漬および非言語コミュニケーションの意味は、次のような技術的特徴の数によって育まれます。"
    },
    {
      "indent": 3,
      "text": "1. Good eye contact, which is achieved by careful placement of participants, cameras, and screens.",
      "ja": "参加者、カメラ、画面を慎重に配置することにより達成される。1.グッドアイコンタクト、。"
    },
    {
      "indent": 3,
      "text": "2. Camera field of view and screen sizes are matched so that the images of the remote room appear to be full size.",
      "ja": "リモート部屋の画像がフルサイズのように見えるように、ビューのサイズの画面の2.カメラのフィールドが一致しています。"
    },
    {
      "indent": 3,
      "text": "3. The left side of each room is presented on the right screen at the far end; similarly, the right side of the room is presented on the left screen. The effect of this is that participants of each site appear to be sitting across the table from each other. If 2 participants on the same site glance at each other, all participants can observe it. Likewise, if a participant at one site gestures to a participant on the other site, all participants observe the gesture itself and the participants it includes.",
      "ja": "3.各部屋の左側は、遠端に右画面上に提示されます。同様に、部屋の右側には、左画面上に提示されます。この効果は、各サイトの参加者が互いからテーブル越しに座っているように見えるということです。お互いに同じサイトを一目で2人の参加した場合、すべての参加者がそれを観察することができます。一つのサイトで参加者が他のサイト上での参加者にジェスチャー場合同様に、すべての参加者は、ジェスチャ自体とそれが含まれ、参加者を観察します。"
    },
    {
      "indent": 0,
      "text": "3.1. Point-to-Point Meeting: Symmetric",
      "section_title": true,
      "ja": "3.1。ポイントツーポイント会議：対称"
    },
    {
      "indent": 3,
      "text": "In this case, each of the 2 sites has an identical number of screens, with cameras having fixed fields of view, and 1 camera for each screen. The sound type is the same at each end. As an example, there could be 3 cameras and 3 screens in each room, with stereo sound being sent and received at each end.",
      "ja": "この場合、2つの部位の各々は、固定された視野、及び各画面の1台のカメラを有するカメラと画面の同じ数を有しています。音のタイプは、各端部で同じです。一例として、各端部で送受信されるステレオサウンドと、3台のカメラ及び各部屋の3つのスクリーンがあってもよいです。"
    },
    {
      "indent": 3,
      "text": "Each screen is paired with a corresponding camera. Each camera/ screen pair is typically connected to a separate codec, producing an encoded stream of video for transmission to the remote site, and receiving a similarly encoded stream from the remote site.",
      "ja": "各画面は、対応するカメラと対になっています。各カメラ/スクリーン対は、典型的には、リモートサイトへの送信のためにビデオの符号化ストリームを生成し、リモートサイトから同様に符号化ストリームを受信し、別のコーデックに接続されています。"
    },
    {
      "indent": 3,
      "text": "Each system has one or multiple microphones for capturing audio. In some cases, stereophonic microphones are employed. In other systems, a microphone may be placed in front of each participant (or pair of participants). In typical systems, all the microphones are connected to a single codec that sends and receives the audio streams as either stereo or surround sound. The number of microphones and the number of audio channels are often not the same as the number of cameras. Also, the number of microphones is often not the same as the number of loudspeakers.",
      "ja": "各システムは、音声をキャプチャするための1つのまたは複数のマイクを持っています。いくつかのケースでは、ステレオマイクが使用されています。他のシステムでは、マイクロフォンは、各参加者（または参加者の組）の前に配置されてもよいです。典型的なシステムでは、全てのマイクはステレオまたはサラウンドサウンドのいずれかとしてオーディオストリームを送信し、受信する単一のコーデックに接続されています。マイクロホンの数とオーディオチャンネルの数は、多くの場合、カメラの数と同じではありません。また、マイクロホンの数は、多くの場合、スピーカの数と同じではありません。"
    },
    {
      "indent": 3,
      "text": "The audio may be transmitted as multi-channel (stereo/surround sound) or as distinct and separate monophonic streams. Audio levels should be matched, so the sound levels at both sites are identical. Loudspeaker and microphone placements are chosen so that the sound \"stage\" (orientation of apparent audio sources) is coordinated with the video. That is, if a participant at one site speaks, the participants at the remote site perceive her voice as originating from her visual image. In order to accomplish this, the audio needs to be mapped at the received site in the same fashion as the video. That is, audio received from the right side of the room needs to be output from loudspeaker(s) on the left side at the remote site, and vice versa.",
      "ja": "オーディオは、マルチチャンネル（ステレオ/サラウンドサウンド）として、または別個の独立したモノラルのストリームとして送信されても​​よいです。オーディオのレベルが一致しなければならないので、両方のサイトでの音のレベルは同じです。音「ステージ」（見かけのオーディオソースの向き）は、ビデオと協調するようにスピーカとマイクの配置が選択されます。つまり、あるサイトで参加者が話す場合は、リモートサイトの参加者が彼女の視覚的なイメージから発信されたものとして彼女の声を認識し、です。これを実現するためには、音声が映像と同じように、受信サイトにマッピングする必要があります。すなわち、部屋の右側から受信した音声は、リモートサイトの左側のスピーカ（複数可）から出力される必要があり、逆もまた同様です。"
    },
    {
      "indent": 0,
      "text": "3.2. Point-to-Point Meeting: Asymmetric",
      "section_title": true,
      "ja": "3.2。ポイントツーポイント会議：非対称"
    },
    {
      "indent": 3,
      "text": "In this case, each site has a different number of screens and cameras than the other site. The important characteristic of this scenario is that the number of screens is different between the 2 sites. This creates challenges that are handled differently by different telepresence systems.",
      "ja": "この場合には、各サイトが他のサイトよりも画面とカメラの異なる数を有します。このシナリオの重要な特徴は、スクリーンの数が2つのサイト間で異なることです。これは、異なるテレプレゼンス・システムによって異なる方法で処理されている課題を作成します。"
    },
    {
      "indent": 3,
      "text": "This use case builds on the basic scenario of 3 screens to 3 screens. Here, we use the common case of 3 screens and 3 cameras at one site, and 1 screen and 1 camera at the other site, connected by a point-to-point call. The screen sizes and camera fields of view at both sites are basically similar, such that each camera view is designed to show 2 people sitting side by side. Thus, the 1-screen room has up to 2 people seated at the table, while the 3-screen room may have up to 6 people at the table.",
      "ja": "このユースケースは、3つの画面に3画面の基本的なシナリオに基づいています。ここでは、ポイントツーポイントコールで接続された他のサイトで3画面、3台のカメラ1つのサイトで、かつ1つの画面と1台のカメラの一般的なケースを使用しています。両方のサイトの画面サイズやビューのカメラのフィールドは、各カメラビューが並んで座っている2人を表示するように設計されるように、基本的に似ています。 3スクリーンルームテーブルで6人まで有していてもよいしつつ、1画面の部屋は、テーブルに座って2人まで有します。"
    },
    {
      "indent": 3,
      "text": "The basic considerations of defining left and right and indicating relative placement of the multiple audio and video streams are the same as in the 3-3 use case. However, handling the mismatch between the 2 sites of the number of screens and cameras requires more complicated maneuvers.",
      "ja": "左右の定義および複数のオーディオおよびビデオストリームの相対的な配置を示す基本的な考慮事項は、3-3ユースケースと同様です。ただし、画面やカメラの数の2つのサイト間の不一致を取り扱うことは、より複雑な操縦を必要とします。"
    },
    {
      "indent": 3,
      "text": "For the video sent from the 1-camera room to the 3-screen room, usually what is done is to simply use 1 of the 3 screens and keep the second and third screens inactive or, for example, put up the current date. This would maintain the \"full-size\" image of the remote side.",
      "ja": "3画面の部屋に1カメラの部屋から送られたビデオの場合、通常行われているものだけで3つの画面の1を使用し、例えば、非アクティブな第二と第三の画面を維持するか、現在の日付を置くことです。これは、リモート側の「フルサイズ」のイメージを維持するであろう。"
    },
    {
      "indent": 3,
      "text": "For the other direction, the 3-camera room sending video to the 1-screen room, there are more complicated variations to consider. Here are several possible ways in which the video streams can be handled.",
      "ja": "他の方向については、1画面の部屋にビデオを送信する3カメラの部屋には、考慮すべき多くの複雑なバリエーションがあります。ここでビデオストリームを処理することができるいくつかの方法があります。"
    },
    {
      "indent": 3,
      "text": "1. The 1-screen system might simply show only 1 of the 3 camera images, since the receiving side has only 1 screen. 2 people are seen at full size, but 4 people are not seen at all. The choice of which one of the 3 streams to display could be fixed, or could be selected by the users. It could also be made automatically based on who is speaking in the 3-screen room, such that the people in the 1-screen room always see the person who is speaking. If the automatic selection is done at the sender, the transmission of streams that are not displayed could be suppressed, which would avoid wasting bandwidth.",
      "ja": "受信側では1つだけ画面を有しているので1. 1スクリーン・システムは、単に、1つだけ3枚のカメラ画像の表示されることがあります。 2人はフルサイズで見られているが、4人は全く見られません。選択は、表示する3つのストリームのうちの1つを固定することができ、またはユーザによって選択することができます。また、1画面の部屋の人々は常に話している人を見るように、3画面の部屋で話している人に基づいて自動的に作ることができます。自動選択は、送信側で行われている場合は、表示されていないストリームの送信は、帯域幅の浪費を避けることになる、抑制することができます。"
    },
    {
      "indent": 3,
      "text": "2. The 1-screen system might be capable of receiving and decoding all 3 streams from all 3 cameras. The 1-screen system could then compose the 3 streams into 1 local image for display on the single screen. All 6 people would be seen, but smaller than full size. This could be done in conjunction with reducing the image resolution of the streams, such that encode/decode resources and bandwidth are not wasted on streams that will be downsized for display anyway.",
      "ja": "2. 1-スクリーンシステムは、すべての3台のカメラからのすべての3つのストリームを受信し、復号することができるかもしれません。 1スクリーンシステムは、単一画面上に表示するために1枚のローカル画像に3つのストリームを構成することができました。すべての6人は見ますが、フルサイズよりも小さいことになります。これは、エンコード/デコードリソースと帯域幅がとにかく表示のために小型化されたストリームに浪費されないように、ストリームの画像の解像度を低減することに関連して行うことができます。"
    },
    {
      "indent": 3,
      "text": "3. The 3-screen system might be capable of including all 6 people in a single stream to send to the 1-screen system. For example, it could use PTZ (Pan Tilt Zoom) cameras to physically adjust the cameras such that 1 camera captures the whole room of 6 people. Or, it could recompose the 3 camera images into 1 encoded stream to send to the remote site. These variations also show all 6 people but at a reduced size.",
      "ja": "3. 3スクリーン・システムは、1画面のシステムに送信するために単一のストリーム内のすべての6人を含めてできるかもしれません。例えば、それは物理的に1台のカメラは、6人の部屋全体をキャプチャするようにカメラを調整するためにPTZ（パンチルトズーム）カメラを使用することができます。それとも、それはリモートサイトに送信するために1つの符号化ストリームに3枚のカメラの画像を再構成できます。これらの変化は、すべての6人を示すが、減少したサイズで。"
    },
    {
      "indent": 3,
      "text": "4. Or, there could be a combination of these approaches, such as simultaneously showing the speaker in full size with a composite of all 6 participants in a smaller size.",
      "ja": "4.あるいは、例えば同時に小型で全6人の参加者の複合体でフルサイズにスピーカを示すようなこれらのアプローチの組み合わせが存在し得ます。"
    },
    {
      "indent": 3,
      "text": "The receiving telepresence system needs to have information about the content of the streams it receives to make any of these decisions. If the systems are capable of supporting more than one strategy, there needs to be some negotiation between the 2 sites to figure out which of the possible variations they will use in a specific point-to-point call.",
      "ja": "受信テレプレゼンスシステムは、これらの決定のいずれかを作るために受信ストリームの内容についての情報を持っている必要があります。システムは、複数の戦略をサポートすることが可能であるならば、彼らは特定のポイントツーポイントコールで使用する可能性のバリエーションのどれを把握する2つのサイト間のいくつかの交渉が必要です。"
    },
    {
      "indent": 0,
      "text": "3.3. Multipoint Meeting",
      "section_title": true,
      "ja": "3.3。マルチポイント会議"
    },
    {
      "indent": 3,
      "text": "In a multipoint telepresence conference, there are more than 2 sites participating. Additional complexity is required to enable media streams from each participant to show up on the screens of the other participants.",
      "ja": "多地点テレプレゼンス会議では、参加している2つの以上のサイトがあります。追加の複雑さは、他の参加者の画面上に表示するために、各参加者からメディアストリームを有効にするために必要です。"
    },
    {
      "indent": 3,
      "text": "Clearly, there are a great number of topologies that can be used to display the streams from multiple sites participating in a conference.",
      "ja": "明らかに、会議に参加する複数のサイトからのストリームを表示するために使用することができますトポロジーの偉大な数があります。"
    },
    {
      "indent": 3,
      "text": "One major objective for telepresence is to be able to preserve the \"being there\" user experience. However, in multi-site conferences, it is often (in fact, usually) not possible to simultaneously provide full-size video, eye contact, and common perception of gestures and gaze by all participants. Several policies can be used for stream distribution and display: all provide good results, but they all make different compromises.",
      "ja": "テレプレゼンスのための一つの大きな目標は、「そこにいる」ユーザー体験を維持できるようにすることです。しかし、マルチサイト会議では、それは（実際には、通常は）いない可能性が同時にすべての参加者がフルサイズのビデオ、アイコンタクト、およびジェスチャーや視線の共通の認識を提供することが多いです。すべてが良い結果を提供し、それらはすべて異なる妥協を作る：いくつかのポリシーは、ストリーム配信および表示のために使用することができます。"
    },
    {
      "indent": 3,
      "text": "One common policy is called site switching. Let's say the speaker is at site A and the other participants are at various \"remote\" sites. When the room at site A shown, all the camera images from site A are forwarded to the remote sites. Therefore, at each receiving remote site, all the screens display camera images from site A. This can be used to preserve full-size image display, and also provide full visual context of the displayed far end, site A. In site switching, there is a fixed relation between the cameras in each room and the screens in remote rooms. The room or participants being shown are switched from time to time based on who is speaking or by manual control, e.g., from site A to site B.",
      "ja": "一つの共通のポリシーは、サイトの切り替えと呼ばれています。のは、スピーカーがサイトAにあり、他の参加者は、様々な「リモート」サイトにあるとしましょう。サイトAの部屋が示された場合、サイトAからのすべてのカメラの画像は、リモートサイトに転送されます。したがって、各受信リモートサイトで、すべての画面がサイトAからカメラ画像これは、フルサイズ画像の表示を維持するために使用され、また、表示された遠端の完全な視覚的なコンテキストを提供することができ、サイトの切り替えにおいて、サイトAを表示します遠隔部屋内の各部屋にカメラと画面との間の固定された関係です。示されている部屋または参加者は、サイトAからサイトBに、例えば、話すまたは手動制御することによるものである誰に基づいて随時切り替えられます"
    },
    {
      "indent": 3,
      "text": "Segment switching is another policy choice. In segment switching (assuming still that site A is where the speaker is, and \"remote\" refers to all the other sites), rather than sending all the images from site A, only the speaker at site A is shown. The camera images of the current speaker and previous speakers (if any) are forwarded to the other sites in the conference. Therefore, the screens in each site are usually displaying images from different remote sites -- the current speaker at site A and the previous ones. This strategy can be used to preserve full-size image display and also capture the non-verbal communication between the speakers. In segment switching, the display depends on the activity in the remote rooms (generally, but not necessarily based on audio/speech detection).",
      "ja": "セグメントの切り替えは、他の政策の選択肢です。セグメントむしろサイトAからすべての画像を送信するよりも、（まだスピーカであり、Aがであり、および「リモート」は、他のすべてのサイトを参照するサイトを想定して）切り替えにおいて、サイトAでのみスピーカーが示されています。現在のスピーカーと、前のスピーカー（もしあれば）のカメラ画像は、会議中に他のサイトに転送されます。サイトAにおける現在の話者と以前のもの - したがって、各サイトの画面は、通常、異なるリモートサイトからの画像を表示しています。この戦略は、フルサイズ画像の表示を維持し、またスピーカーとの間の非言語コミュニケーションを捕捉するために使用することができます。セグメント切り替えでは、ディスプレイは遠隔客室で活性に依存する（一般的に、必ずしも必要ではないが、オーディオ/スピーチ検出に基づきます）。"
    },
    {
      "indent": 3,
      "text": "A third possibility is to reduce the image size so that multiple camera views can be composited onto one or more screens. This does not preserve full-size image display, but it provides the most visual context (since more sites or segments can be seen). Typically in this case, the display mapping is static, i.e., each part of each room is shown in the same location on the display screens throughout the conference.",
      "ja": "第三の可能性は、複数のカメラビューは、1つ以上の画面上に合成することができるように、画像サイズを小さくすることです。これは、フルサイズ画像の表示を維持しないが、それは、ほとんどのビジュアル・コンテキストを（より多くのサイトまたはセグメントを見ることができるため）を提供します。典型的には、この場合には、表示マッピングは静的であり、即ち、各部屋の各部分は、会議全体の表示画面上の同じ位置に示されています。"
    },
    {
      "indent": 3,
      "text": "Other policies and combinations are also possible. For example, there can be a static display of all screens from all remote rooms, with part or all of one screen being used to show the current speaker at full size.",
      "ja": "他の政策との組み合わせも可能です。例えば、フルサイズで現在の話者を示すために使用されている一部または1つの画面のすべてと、すべてのリモートの客室からのすべての画面の静的な表示が存在することができます。"
    },
    {
      "indent": 0,
      "text": "3.4. Presentation",
      "section_title": true,
      "ja": "3.4。プレゼンテーション"
    },
    {
      "indent": 3,
      "text": "In addition to the video and audio streams showing the participants, additional streams are used for presentations.",
      "ja": "参加者を示すビデオとオーディオストリームに加えて、追加のストリームは、プレゼンテーションのために使用されています。"
    },
    {
      "indent": 3,
      "text": "In systems available today, generally only one additional video stream is available for presentations. Often, this presentation stream is half-duplex in nature, with presenters taking turns. The presentation stream may be captured from a PC screen, or it may come from a multimedia source such as a document camera, camcorder, or a DVD. In a multipoint meeting, the presentation streams for the currently active presentation are always distributed to all sites in the meeting, so that the presentations are viewed by all.",
      "ja": "今日利用可能なシステムでは、一般的に一つだけ追加のビデオストリームは、プレゼンテーションのために利用可能です。多くの場合、このプレゼンテーションストリームは、発表者が交代で、本質的に半二重です。プレゼンテーションストリームは、PC画面からキャプチャすることができる、またはそのような書画カメラ、ビデオカメラ、またはDVDなどのマルチメディアソースから来るかもしれません。プレゼンテーションは、すべてに見られるように、多地点会議では、現在アクティブなプレゼンテーションのためのプレゼンテーションストリームは常に、会議内のすべてのサイトに配信されます。"
    },
    {
      "indent": 3,
      "text": "Some systems display the presentation streams on a screen that is mounted either above or below the 3 participant screens. Other systems provide screens on the conference table for observing presentations. If multiple presentation screens are used, they generally display identical content. There is considerable variation in the placement, number, and size of presentation screens.",
      "ja": "いくつかのシステムは、プレゼンテーション3参加者の画面の上または下に装着されて画面上に表示されるストリーム。他のシステムでは、プレゼンテーションを観察するための会議テーブルの上に画面を提供します。複数のプレゼンテーション画面を使用する場合は、これらは一般的に同一の内容を表示します。プレゼンテーション画面の配置、数、およびサイズにはかなりのばらつきがあります。"
    },
    {
      "indent": 3,
      "text": "In some systems, presentation audio is pre-mixed with the room audio. In others, a separate presentation audio stream is provided (if the presentation includes audio).",
      "ja": "いくつかのシステムでは、プレゼンテーションのオーディオは、部屋のオーディオと予備混合です。 （プレゼンテーション、オーディオ含む場合）他では、別個のプレゼンテーションのオーディオストリームが提供されます。"
    },
    {
      "indent": 3,
      "text": "In H.323 [ITU.H323] systems, H.239 [ITU.H239] is typically used to control the video presentation stream. In SIP systems, similar control mechanisms can be provided using the Binary Floor Control Protocol (BFCP) [RFC4582] for the presentation token. These mechanisms are suitable for managing a single presentation stream.",
      "ja": "H.323 [ITU.H323】システムにおいて、H.239 [ITU.H239]は、典型的には、映像プレゼンテーションストリームを制御するために使用されます。 SIPシステムでは、同様の制御機構は、プレゼンテーショントークンのバイナリフロア制御プロトコル（BFCP）[RFC4582]を使用して提供することができます。これらのメカニズムは、単一のプレゼンテーションストリームを管理するために適しています。"
    },
    {
      "indent": 3,
      "text": "Although today's systems remain limited to a single video presentation stream, there are obvious uses for multiple presentation streams:",
      "ja": "今日のシステムは、単一のビデオプレゼンテーションストリームに制限されたままものの、複数のプレゼンテーションストリームのための明確な用途があります。"
    },
    {
      "indent": 3,
      "text": "1. Frequently, the meeting convener is following a meeting agenda, and it is useful for her to be able to show that agenda to all participants during the meeting. Other participants at various remote sites are able to make presentations during the meeting, with the presenters taking turns. The presentations and the agenda are both shown, either on separate screens, or perhaps rescaled and shown on a single screen.",
      "ja": "1.よく、会議の招集は、会議の議題以下である、と彼女は会議中にすべての参加者にその議題を表示することができることが便利です。様々なリモートサイトの他の参加者が交代プレゼンターで、会議中にプレゼンテーションを行うことができます。プレゼンテーション、アジェンダは両方別の画面に、図示せ、又はおそらく再スケーリングし、一画面上に示されています。"
    },
    {
      "indent": 3,
      "text": "2. A single multimedia presentation can itself include multiple video streams that should be shown together. For instance, a presenter may be discussing the fairness of media coverage. In addition to slides that support the presenter's conclusions, she also has video excerpts from various news programs that she shows to illustrate her findings. She uses a DVD player for the video excerpts so that she can pause and reposition the video as needed.",
      "ja": "2つのマルチメディア・プレゼンテーション自体が一緒に表示されるべき複数のビデオストリームを含むことができます。例えば、プレゼンターは報道の公平性を議論することができます。プレゼンターの結論をサポートするスライドに加えて、彼女はまた彼女が彼女の調査結果を説明するために示した様々なニュース番組からのビデオの抜粋を持っています。必要に応じて、彼女はビデオを一時停止し、再配置できるように、彼女は、ビデオの抜粋のためのDVDプレーヤーを使用しています。"
    },
    {
      "indent": 3,
      "text": "3. An educator who is presenting a multiscreen slide show. This show requires that the placement of the images on the multiple screens at each site be consistent.",
      "ja": "3.マルチスクリーンスライドショーを提示している教育者。このショーは、各サイトの複数の画面上の画像の配置は一貫している必要があります。"
    },
    {
      "indent": 3,
      "text": "There are many other examples where multiple presentation streams are useful.",
      "ja": "複数のプレゼンテーションストリームが有用で、他の多くの例があります。"
    },
    {
      "indent": 0,
      "text": "3.5. Heterogeneous Systems",
      "section_title": true,
      "ja": "3.5。異種システム"
    },
    {
      "indent": 3,
      "text": "It is common in meeting scenarios for people to join the conference from a variety of environments, using different types of endpoint devices. A multiscreen immersive telepresence conference may include someone on a PC-based video conferencing system, a participant calling in by phone, and (soon) someone on a handheld device.",
      "ja": "人々はさまざまな環境から会議に参加することは、エンドポイントデバイスの種類を使用して、会議のシナリオでは一般的です。マルチスクリーンイマーシブテレプレゼンス会議は、PCベースのビデオ会議システム、電話で呼び出すことで、参加者、およびハンドヘルドデバイス上で（すぐに）誰かの誰かを含むことができます。"
    },
    {
      "indent": 3,
      "text": "What experience/view will each of these devices have?",
      "ja": "/ビューこれらのデバイスのそれぞれがどのような経験を持っているのだろうか？"
    },
    {
      "indent": 3,
      "text": "Some may be able to handle multiple streams, and others can handle only a single stream. (Here, we are not talking about legacy systems, but rather systems built to participate in such a conference, although they are single stream only.) In a single video stream, the stream may contain one or more compositions depending on the available screen space on the device. In most cases, an intermediate transcoding device will be relied upon to produce a single stream, perhaps with some kind of continuous presence.",
      "ja": "いくつかは複数のストリームを処理することができるかもしれ、他のものは、単一のストリームを処理することができます。 （彼らは唯一の単一のストリームではあるがここでは、我々は、レガシーシステムではなく、会議に参加するために構築されたシステムについて話されていません。）単一のビデオストリームでは、ストリームが利用可能な画面スペースに応じて、1つの以上の組成物を含むことができデバイス上で。ほとんどの場合、中間トランスコード装置は、おそらく、連続的存在のいくつかの種類と、単一のストリームを生成するために依拠します。"
    },
    {
      "indent": 3,
      "text": "Bit rates will vary -- the handheld device and phone having lower bit rates than PC and multiscreen systems.",
      "ja": "ビットレートは異なります -  PCとマルチスクリーンシステムより低いビットレートを有するハンドヘルドデバイスと電話を。"
    },
    {
      "indent": 3,
      "text": "Layout is accomplished according to different policies. For example, a handheld device and PC may receive the active speaker stream. The decision can either be made explicitly by the receiver or by the sender if it can receive some kind of rendering hint. The same is true for audio -- i.e., that it receives a mixed stream or a number of the loudest speakers if mixing is not available in the network.",
      "ja": "レイアウトは異なるポリシーに従って達成されます。例えば、ハンドヘルドデバイスとPCは、アクティブスピーカーのストリームを受け取ることができます。それがヒントをレンダリングのいくつかの種類を受け取ることができるかどうかの決定は、いずれかの受信機または送信者によって明示的に行うことができます。混合はネットワークで利用できない場合、それは混合流または最大音量スピーカーの数を受け取ること、すなわち、 - 同じオーディオについても同様です。"
    },
    {
      "indent": 3,
      "text": "For the PC-based conferencing participant, the user's experience depends on the application. It could be single stream, similar to a handheld device but with a bigger screen. Or, it could be multiple streams, similar to an immersive telepresence system but with a smaller screen. Control for manipulation of streams can be local in the software application, or in another location and sent to the application over the network.",
      "ja": "PCベースの会議の参加者のために、ユーザの経験では、アプリケーションに依存します。これは、ハンドヘルドデバイスに似ていますが、大きな画面を備えた単一のストリームである可能性があります。それとも、それは没入型テレプレゼンスシステムになく、小さな画面と同様の複数のストリームである可能性があります。ストリームの操作のための制御は、ソフトウェア・アプリケーションにローカル、または別の場所に、ネットワーク上のアプリケーションに送信することができます。"
    },
    {
      "indent": 3,
      "text": "The handheld device is the most extreme. How will that participant be viewed and heard? It should be an equal participant, though the bandwidth will be significantly less than an immersive system. A receiver may choose to display output coming from a handheld device differently based on the resolution, but that would be the case with any low-resolution video stream, e.g., from a powerful PC on a bad network.",
      "ja": "ハンドヘルドデバイスは、最も極端です。どのように参加者が閲覧して聞くことができますか？帯域幅は、没入型システムよりも大幅に少なくなりますけれどもそれは、同じ参加者でなければなりません。悪いネットワーク上の強力なPCから、例えば、受信機は、異なる解像度に基づいて、ハンドヘルドデバイスからの出力を表示することを選択することができるが、それは、任意の低解像度ビデオストリームの場合であろう。"
    },
    {
      "indent": 3,
      "text": "The handheld device will send and receive a single video stream, which could be a composite or a subset of the conference. The handheld device could say what it wants or could accept whatever the sender (conference server or sending endpoint) thinks is best. The handheld device will have to signal any actions it wants to take the same way that an immersive system signals actions.",
      "ja": "ハンドヘルドデバイスは、複合や会議のサブセットである可能性があり、単一のビデオストリームを送受信します。ハンドヘルドデバイスは、それが何を望んでいるか言うことができるか、送信者（会議サーバまたは送信エンドポイント）が最善であると考えるものは何でも受け入れることができます。ハンドヘルドデバイスは、没入型システム信号のアクションと同じ方法を取りたい任意のアクションを通知する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.6. Multipoint Education Usage",
      "section_title": true,
      "ja": "3.6。マルチ教育使い方"
    },
    {
      "indent": 3,
      "text": "The importance of this example is that the multiple video streams are not used to create an immersive conferencing experience with panoramic views at all the sites. Instead, the multiple streams are dynamically used to enable full participation of remote students in a university class. In some instances, the same video stream is displayed on multiple screens in the room; in other instances, an available stream is not displayed at all.",
      "ja": "この例の重要性は、複数のビデオストリームは、すべてのサイトでパノラマビューの没入会議体験を作成するために使用されていないということです。代わりに、複数のストリームを動的に大学のクラスでは、リモートの学生の完全な参加を可能にするために使用されます。いくつかの例では、同一のビデオストリームは、部屋内の複数の画面上に表示されます。他の事例では、可能なストリームが全く表示されません。"
    },
    {
      "indent": 3,
      "text": "The main site is a university auditorium that is equipped with 3 cameras. One camera is focused on the professor at the podium. A second camera is mounted on the wall behind the professor and captures the class in its entirety. The third camera is co-located with the second and is designed to capture a close-up view of a questioner in the audience. It automatically zooms in on that student using sound localization.",
      "ja": "主なサイトは、3台のカメラが装備されている大学の講堂です。一つのカメラは表彰台の教授に焦点を当てています。第2のカメラは、教授の後ろの壁に取り付けられており、その全体がクラスを捕捉します。第3のカメラは、第二と同じ場所に配置され、視聴者に質問者のクローズアップビューを捕捉するように設計されています。それは自動的に音像定位を使用して、その学生にズームイン。"
    },
    {
      "indent": 3,
      "text": "Although the auditorium is equipped with 3 cameras, it is only equipped with 2 screens. One is a large screen located at the front so that the class can see it. The other is located at the rear so the professor can see it. When someone asks a question, the front screen shows the questioner. Otherwise, it shows the professor (ensuring everyone can easily see her).",
      "ja": "講堂は、3台のカメラが装備されているが、それはわずか2つの画面を備えています。一つは、クラスがそれを見ることができるようにフロントに位置大画面です。教授はそれを見ることができるので、他には背面にあります。誰かが質問をするときは、フロントスクリーンは質問者を示します。それ以外の場合は、（誰もが簡単に彼女を見ることができます確保）教授を示しています。"
    },
    {
      "indent": 3,
      "text": "The remote sites are typical immersive telepresence rooms, each with 3 camera/screen pairs.",
      "ja": "リモートサイトは、典型的な没入型テレプレゼンス・ルーム、3カメラ/画面のペアとそれぞれ。"
    },
    {
      "indent": 3,
      "text": "All remote sites display the professor on the center screen at full size. A second screen shows the entire classroom view when the professor is speaking. However, when a student asks a question, the second screen shows the close-up view of the student at full size. Sometimes the student is in the auditorium; sometimes the speaking student is at another remote site. The remote systems never display the students that are actually in that room.",
      "ja": "すべてのリモートサイトは、フルサイズの中央画面上の教授を表示します。 2番目の画面では教授が話している全体教室の図を示しています。生徒が質問をするときただし、2番目の画面がフルサイズでの学生の拡大図を示します。時々、学生は講堂です。時々話す学生は、他のリモートサイトです。リモートシステムは、その部屋に実際に学生を表示することはありません。"
    },
    {
      "indent": 3,
      "text": "If someone at a remote site asks a question, then the screen in the auditorium will show the remote student at full size (as if they were present in the auditorium itself). The screen in the rear also shows this questioner, allowing the professor to see and respond to the student without needing to turn her back on the main class.",
      "ja": "リモートサイトの誰かが質問をするならば（彼らは講堂自体に存在していたかのように）、その後、講堂の画面はフルサイズでリモートの学生が表示されます。背面の画面には、教授が見ると、メインクラスに彼女を引き返すすることなく、学生に応答することができ、この質問者を示しています。"
    },
    {
      "indent": 3,
      "text": "When no one is asking a question, the screen in the rear briefly shows a full-room view of each remote site in turn, allowing the professor to monitor the entire class (remote and local students). The professor can also use a control on the podium to see a particular site -- she can choose either a full-room view or a single-camera view.",
      "ja": "誰も質問をされていない場合、リア簡単に画面をクラス全体（リモートとローカルの学生）を監視するための教授をできるように、順番に各リモートサイトのフル部屋図を示しています。教授はまた、特定のサイトを参照して表彰台にコントロールを使用することができます - 彼女は、フルルームビューまたはシングルカメラビューのいずれかを選択することができます。"
    },
    {
      "indent": 3,
      "text": "Realization of this use case does not require any negotiation between the participating sites. Endpoint devices (and a Multipoint Control Unit (MCU), if present) need to know who is speaking and what video stream includes the view of that speaker. The remote systems need some knowledge of which stream should be placed in the center. The ability of the professor to see specific sites (or for the system to show all the sites in turn) would also require the auditorium system to know what sites are available and to be able to request a particular view of any site. Bandwidth is optimized if video that is not being shown at a particular site is not distributed to that site.",
      "ja": "このユースケースの実現は、参加サイト間の任意の交渉を必要としません。エンドポイントデバイス（およびマルチポイントコントロールユニット（MCU）、存在する場合は）話している人とそのスピーカーのビューが含まれてどのようなビデオストリームを知る必要があります。リモートシステムは、ストリームが中央に配置されるべきいくつかの知識が必要です。教授の能力は、特定のサイトを参照してくださいするには（または順番にすべてのサイトを表示するシステムのための）もサイトが利用可能であるかを知るために講堂システムを必要とし、任意のサイトの特定のビューを要求できるようにします。特定のサイトに表示されていないビデオがそのサイトに配布されていない場合、帯域幅が最適化されています。"
    },
    {
      "indent": 0,
      "text": "3.7. Multipoint Multiview (Virtual Space)",
      "section_title": true,
      "ja": "3.7。マルチポイントマルチビュー（仮想空間）"
    },
    {
      "indent": 3,
      "text": "This use case describes a virtual space multipoint meeting with good eye contact and spatial layout of participants. The use case was proposed very early in the development of video conferencing systems as described in 1983 by Allardyce and Randal [virtualspace]. The use case is illustrated in Figure 2-5 of their report. The virtual space expands the point-to-point case by having all multipoint conference participants \"seated\" in a virtual room. In this case, each participant has a fixed \"seat\" in the virtual room, so each participant expects to see a different view having a different participant on his left and right side. Today, the use case is implemented in multiple telepresence-type video conferencing systems on the market. The term \"virtual space\" was used in their report. The main difference between the result obtained with modern systems and those from 1983 are larger screen sizes.",
      "ja": "このユースケースは、優れたアイコンタクトや参加者の空間的なレイアウトを持つ仮想空間マルチポイント会議を説明します。 [仮想空間] Allardyceとランダルにより1983年に記載されたユースケースは非常に初期のビデオ会議システムの開発に提案されました。ユースケースは、その報告書の図2-5に示されています。仮想空間は、仮想の部屋で「着席」のすべてのマルチポイント会議参加者を持つことにより、ポイント・ツー・ポイントのケースを拡張します。この場合、各参加者は、仮想部屋内の固定された「座」を有するので、各参加者は自分の左側と右側に異なる参加者を有する異なるビューを見ることを期待します。今日では、ユースケースは、市場で複数のテレプレゼンス型のビデオ会議システムで実装されています。用語「仮想空間」は、そのレポートで使用されました。近代的なシステム1983年から、それらを用いて得られた結果との間の主な違いは、より大きな画面サイズです。"
    },
    {
      "indent": 3,
      "text": "Virtual space multipoint as defined here assumes endpoints with multiple cameras and screens. Usually, there is the same number of cameras and screens at a given endpoint. A camera is positioned above each screen. A key aspect of virtual space multipoint is the details of how the cameras are aimed. The cameras are each aimed on the same area of view of the participants at the site. Thus, each camera takes a picture of the same set of people but from a different angle. Each endpoint sender in the virtual space multipoint meeting therefore offers a choice of video streams to remote receivers, each stream representing a different viewpoint. For example, a camera positioned above a screen to a participant's left may take video pictures of the participant's left ear; while at the same time, a camera positioned above a screen to the participant's right may take video pictures of the participant's right ear.",
      "ja": "ここで定義されている仮想空間マルチポイントは、複数のカメラや画面でのエンドポイントを想定しています。通常、特定のエンドポイントでカメラと画面の同じ数があります。カメラは、各画面の上方に配置されています。仮想空間マルチポイントの重要な側面は、カメラが向けられている方法の詳細です。カメラは各サイトでの参加者の視野の同じ領域に目的としています。このように、各カメラは、人々の同じセットのが、異なる角度から撮影されます。仮想空間マルチポイント会議内の各エンドポイントの送信者は、したがって、遠隔受信機に異なる視点を表す各ストリームをビデオストリームの選択肢を提供しています。例えば、カメラは、参加者の左耳のビデオ映像を撮ることがあり、参加者の左に画面の上方に位置します。一方、同時に、参加者の右に画面の上方に位置するカメラは、参加者の右耳のビデオ写真を撮ることがあります。"
    },
    {
      "indent": 3,
      "text": "Since a sending endpoint has a camera associated with each screen, an association is made between the receiving stream output on a particular screen and the corresponding sending stream from the camera associated with that screen. These associations are repeated for each screen/camera pair in a meeting. The result of this system is a horizontal arrangement of video images from remote sites, one per screen. The image from each screen is paired with the camera output from the camera above that screen, resulting in excellent eye contact.",
      "ja": "送信エンドポイントは、各画面に関連付けられたカメラを有しているので、関連付けは、特定の画面とその画面に関連付けられているカメラからの対応する送信ストリーム上で受信ストリーム出力との間に形成されています。これらの団体は、会議中、各画面/カメラ対に対して繰り返されます。このシステムの結果は、リモートサイトからのビデオ画像を、画面ごとに水平配置です。各画面からの画像は、優れたアイコンタクトが得られ、その画面上のカメラからカメラ出力と対になっています。"
    },
    {
      "indent": 0,
      "text": "3.8. Multiple Presentation Streams - Telemedicine",
      "section_title": true,
      "ja": "3.8。複数のプレゼンテーションストリーム - 遠隔医療"
    },
    {
      "indent": 3,
      "text": "This use case describes a scenario where multiple presentation streams are used. In this use case, the local site is a surgery room connected to one or more remote sites that may have different capabilities. At the local site, 3 main cameras capture the whole room (the typical 3-camera telepresence case). Also, multiple presentation inputs are available: a surgery camera that is used to provide a zoomed view of the operation, an endoscopic monitor, a flouroscope (X-ray imaging), an ultrasound diagnostic device, an electrocardiogram (ECG) monitor, etc. These devices are used to provide multiple local video presentation streams to help the surgeon monitor the status of the patient and assist in the surgical process.",
      "ja": "このユースケースは、複数のプレゼンテーションストリームが使用されているシナリオについて説明します。このユースケースでは、ローカルサイトは、異なる機能を有していてもよく、1つ以上のリモート・サイトに接続されている手術室です。ローカルサイトでは、主に3台のカメラは、部屋全体（典型的な3-カメラのテレプレゼンスケース）を取得します。また、複数のプレゼンテーション入力が利用可能である：操作のズームビューを提供するために使用される手術用カメラ、内視鏡モニタ、flouroscope（X線撮影）、超音波診断装置、心電図（ECG）を監視し、等これらのデバイスは、外科医が患者の状態を監視し、手術過程で支援するために、複数のローカルビデオプレゼンテーションストリームを提供するために使用されています。"
    },
    {
      "indent": 3,
      "text": "The local site may have 3 main screens and one (or more) presentation screen(s). The main screens can be used to display the remote experts. The presentation screen(s) can be used to display multiple presentation streams from local and remote sites simultaneously. The 3 main cameras capture different parts of the surgery room. The surgeon can decide the number, the size, and the placement of the presentations displayed on the local presentation screen(s). He can also indicate which local presentation captures are provided for the remote sites. The local site can send multiple presentation captures to remote sites, and it can receive from them multiple presentations related to the patient or the procedure.",
      "ja": "ローカルサイトは、3つの主画面と1つ（またはそれ以上）のプレゼンテーション画面を有していてもよいです。メイン画面は、リモート専門家を表示するために使用することができます。プレゼンテーション画面（複数可）は、同時に、ローカルおよびリモートサイトから複数のプレゼンテーションストリームを表示するために使用することができます。 3台のメインカメラは、手術室の異なる部分をキャプチャします。外科医は数、サイズ、およびローカルプレゼンテーション画面（複数可）に表示されるプレゼンテーションの配置を決めることができます。彼はまた、地元のプレゼンテーションのキャプチャがリモートサイトで提供されているかを示すことができます。ローカルサイトがリモートサイトに複数のプレゼンテーションキャプチャを送信することができ、そしてそれはそれらから患者またはプロシージャに関連する複数のプレゼンテーションを受け取ることができます。"
    },
    {
      "indent": 3,
      "text": "One type of remote site is a single- or dual-screen and one-camera system used by a consulting expert. In the general case, the remote sites can be part of a multipoint telepresence conference. The presentation screens at the remote sites allow the experts to see the details of the operation and related data. Like the main site, the experts can decide the number, the size, and the placement of the presentations displayed on the presentation screens. The presentation screens can display presentation streams from the surgery room, from other remote sites, or from local presentation streams. Thus, the experts can also start sending presentation streams that can carry medical records, pathology data, or their references and analysis, etc.",
      "ja": "リモートサイトの一つのタイプは、コンサルティングの専門家によって使用されるシングルまたはデュアルスクリーンとワンのカメラシステムです。一般的なケースでは、リモートサイトは、マルチテレプレゼンス会議の一部にすることができます。リモート・サイトでのプレゼンテーションの画面は、専門家は、操作および関連データの詳細を確認することができます。メインのサイトと同様に、専門家は数、サイズ、およびプレゼンテーションの画面に表示されるプレゼンテーションの配置を決めることができます。プレゼンテーションの画面は、他のリモートサイトから、またはローカルプレゼンテーションの流れから、手術室からのプレゼンテーションストリームを表示することができます。このため、専門家はまた、など、医療記録、病理学データ、またはその参照と分析を運ぶことができ、プレゼンテーションストリームの送信を開始することができます"
    },
    {
      "indent": 3,
      "text": "Another type of remote site is a typical immersive telepresence room with 3 camera/screen pairs, allowing more experts to join the consultation. These sites can also be used for education. The teacher, who is not necessarily the surgeon, and the students are in different remote sites. Students can observe and learn the details of the whole procedure, while the teacher can explain and answer questions during the operation.",
      "ja": "リモートサイトの別のタイプは、より多くの専門家が協議に参加することができ、3カメラ/画面のペアを持つ典型的な没入型テレプレゼンスルームです。これらのサイトはまた、教育のために使用することができます。必ずしも外科医ではない教師、学生が別のリモートサイトにあります。教師は説明し、動作中の質問に答えることができますしながら、学生は、観察し、全体の手順の詳細を学ぶことができます。"
    },
    {
      "indent": 3,
      "text": "All remote education sites can display the surgery room. Another option is to display the surgery room on the center screen, and the rest of the screens can show the teacher and the student who is asking a question. For all the above sites, multiple presentation screens can be used to enhance visibility: one screen for the zoomed surgery stream and the others for medical image streams, such as MRI images, cardiograms, ultrasonic images, and pathology data.",
      "ja": "すべての遠隔教育サイトは、手術室を表示することができます。別のオプションは、中央の画面上で手術室を表示することで、画面の残りの部分は質問をされる教師と生徒を表示することができます。ズーム手術ストリームとそのようなMRI画像、心電図、超音波画像、及び病理学データとして医用画像ストリームのために他人のために一つの画面：上記のすべてのサイトのために、複数のプレゼンテーション画面は視認性を高めるために使用することができます。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgements",
      "section_title": true,
      "ja": "4.謝辞"
    },
    {
      "indent": 3,
      "text": "The document has benefitted from input from a number of people including Alex Eleftheriadis, Marshall Eubanks, Tommy Andre Nyquist, Mark Gorzynski, Charles Eckel, Nermeen Ismail, Mary Barnes, Pascal Buhler, and Jim Cole.",
      "ja": "文書はアレックスEleftheriadis、マーシャルユーバンクス、トミー・アンドレナイキスト、マーク・Gorzynski、チャールズEckel氏、Nermeenイスマイル、メアリー・バーンズ、パスカルビューラー、そしてジム・コールなど、人々の数からの入力から恩恵を受けています。"
    },
    {
      "indent": 3,
      "text": "Special acknowledgement to Lennard Xiao, who contributed the text for the telemedicine use case, and to Claudio Allocchio for his detailed review of the document.",
      "ja": "文書の彼の詳細なレビューのための遠隔医療ユースケースのために、そしてクラウディオAllocchioにテキストを拠出レナード暁に特別承認。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "While there are likely to be security considerations for any solution for telepresence interoperability, this document has no security considerations.",
      "ja": "テレプレゼンスの相互運用性のためのすべてのソリューションのためのセキュリティ上の考慮事項である可能性が高いがありますが、この文書にはセキュリティ上の配慮を持っていません。"
    },
    {
      "indent": 0,
      "text": "6. Informative References",
      "section_title": true,
      "ja": "6.参考文献"
    },
    {
      "indent": 3,
      "text": "[ITU.H239] ITU-T, \"Role management and additional media channels for H.300-series terminals\", ITU-T Recommendation H.239, September 2005.",
      "ja": "【ITU.H239] ITU-T、 \"H.300シリーズ端末用ロール管理および追加のメディアチャネル\"、ITU-T勧告H.239、2005年9月。"
    },
    {
      "indent": 3,
      "text": "[ITU.H264] ITU-T, \"Advanced video coding for generic audiovisual services\", ITU-T Recommendation H.264, April 2013.",
      "ja": "[ITU.H264] ITU-T、 \"一般的な視聴覚サービスのための高度なビデオコーディング\"、ITU-T勧告H.264、2013年4月。"
    },
    {
      "indent": 3,
      "text": "[ITU.H323] ITU-T, \"Packet-based Multimedia Communications Systems\", ITU-T Recommendation H.323, December 2009.",
      "ja": "【ITU.H323] ITU-T、 \"パケットベースのマルチメディア通信システム\"、ITU-T勧告H.323 2009年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "ja": "[RFC3261]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\" 、RFC 3261、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3550] Schulzrinne, H., Casner, S., Frederick, R., and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", STD 64, RFC 3550, July 2003.",
      "ja": "[RFC3550] Schulzrinneと、H.、Casner、S.、フレデリック、R.、およびV.ヤコブソン、 \"RTP：リアルタイムアプリケーションのためのトランスポートプロトコル\"、STD 64、RFC 3550、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4582] Camarillo, G., Ott, J., and K. Drage, \"The Binary Floor Control Protocol (BFCP)\", RFC 4582, November 2006.",
      "ja": "[RFC4582]キャマリロ、G.、オット、J.、およびK.糖剤、 \"バイナリフロア制御プロトコル（BFCP）\"、RFC 4582、2006年11月。"
    },
    {
      "indent": 3,
      "text": "[virtualspace] Allardyce, L. and L. Randall, \"Development of Teleconferencing Methodologies with Emphasis on Virtual Space Video and Interactive Graphics\", April 1983, <http://www.dtic.mil/docs/citations/ADA127738>.",
      "ja": "[仮想空間] Allardyce、L.およびL.ランドール、「仮想空間のビデオやインタラクティブなグラフィックスを重視した電話会議手法の開発」、1983年4月、<http://www.dtic.mil/docs/citations/ADA127738>。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Allyn Romanow Cisco San Jose, CA 95134 US",
      "ja": "アリンRomanowシスコサンノゼ、CA 95134米国"
    },
    {
      "indent": 3,
      "text": "EMail: allyn@cisco.com",
      "ja": "メールアドレス：allyn@cisco.com"
    },
    {
      "indent": 3,
      "text": "Stephen Botzko Polycom Andover, MA 01810 US",
      "ja": "スティーブンBotzkoポリコムアンドーバー、マサチューセッツ州01810米国"
    },
    {
      "indent": 3,
      "text": "EMail: stephen.botzko@polycom.com",
      "ja": "メールアドレス：stephen.botzko@polycom.com"
    },
    {
      "indent": 3,
      "text": "Mark Duckworth Polycom Andover, MA 01810 US",
      "ja": "マーク・ダックワースポリコムアンドーバー、マサチューセッツ州01810米国"
    },
    {
      "indent": 3,
      "text": "EMail: mark.duckworth@polycom.com",
      "ja": "メールアドレス：mark.duckworth@polycom.com"
    },
    {
      "indent": 3,
      "text": "Roni Even (editor) Huawei Technologies Tel Aviv Israel",
      "ja": "ロニさえ（エディタ）華為技術テルアビブイスラエル"
    },
    {
      "indent": 3,
      "text": "EMail: roni.even@mail01.huawei.com",
      "ja": "メールアドレス：roni.even@mail01.huawei.com"
    }
  ]
}