{
  "title": {
    "text": "RFC 7898 - Domain Subobjects for Resource Reservation Protocol - Traffic Engineering (RSVP-TE)",
    "ja": "RFC 7898 - リソース予約プロトコルのドメインサブオブジェクト-トラフィックエンジニアリング（RSVP-TE）"
  },
  "number": 7898,
  "created_at": "2020-08-29 12:36:08.971910+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          D. Dhody\nRequest for Comments: 7898                                      U. Palle\nCategory: Experimental                                      V. Kondreddy\nISSN: 2070-1721                                      Huawei Technologies\n                                                             R. Casellas\n                                                                    CTTC\n                                                               June 2016",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": " Domain Subobjects for Resource Reservation Protocol - Traffic Engineering (RSVP-TE)",
      "ja": "リソース予約プロトコルのドメインサブオブジェクト-トラフィックエンジニアリング（RSVP-TE）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The Resource Reservation Protocol - Traffic Engineering (RSVP-TE) specification and the Generalized Multiprotocol Label Switching (GMPLS) extensions to RSVP-TE allow abstract nodes and resources to be explicitly included in a path setup. Further, Exclude Route extensions to RSVP-TE allow abstract nodes and resources to be explicitly excluded in a path setup.",
      "ja": "リソース予約プロトコル-トラフィックエンジニアリング（RSVP-TE）仕様とRSVP-TEへの汎用マルチプロトコルラベルスイッチング（GMPLS）拡張により、抽象ノードとリソースをパス設定に明示的に含めることができます。さらに、RSVP-TEへのExclude Route拡張機能により、抽象ノードとリソースをパス設定で明示的に除外できます。"
    },
    {
      "indent": 3,
      "text": "This document specifies new subobjects to include or exclude Autonomous Systems (ASes), which are identified by a 4-byte AS number, and Interior Gateway Protocol (IGP) areas during path setup.",
      "ja": "このドキュメントでは、4バイトのAS番号で識別される自律システム（AS）と、パスのセットアップ中にInterior Gateway Protocol（IGP）領域を含めるか除外する新しいサブオブジェクトを指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。試験、実験、評価のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントでは、インターネットコミュニティの実験プロトコルを定義します。このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。 IESGによって承認されたすべてのドキュメントが、あらゆるレベルのインターネット標準の候補になるわけではありません。 RFC 7841のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7898.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc7898で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved. This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "Copyright（c）2016 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。この文書は、BCP 78およびIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象であり、この文書の発行日に有効です。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  Scope . . . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.2.  Requirements Language . . . . . . . . . . . . . . . . . .   4\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   4\n3.  Subobjects for Domains  . . . . . . . . . . . . . . . . . . .   5\n  3.1.  Domains . . . . . . . . . . . . . . . . . . . . . . . . .   5\n  3.2.  Explicit Route Object (ERO) Subobjects  . . . . . . . . .   6\n    3.2.1.  Autonomous System . . . . . . . . . . . . . . . . . .   6\n    3.2.2.  IGP Area  . . . . . . . . . . . . . . . . . . . . . .   7\n    3.2.3.  Mode of Operation . . . . . . . . . . . . . . . . . .   8\n  3.3.  Exclude Route Object (XRO) Subobjects . . . . . . . . . .   9\n    3.3.1.  Autonomous System . . . . . . . . . . . . . . . . . .   9\n    3.3.2.  IGP Area  . . . . . . . . . . . . . . . . . . . . . .   9\n    3.3.3.  Mode of Operation . . . . . . . . . . . . . . . . . .  10\n  3.4.  Explicit Exclusion Route Subobject  . . . . . . . . . . .  10\n4.  Interaction with Path Computation Element (PCE) . . . . . . .  10\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  11\n  5.1.  New Subobjects  . . . . . . . . . . . . . . . . . . . . .  11\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .  11\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  12\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .  12\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .  13\nAppendix A.  Examples . . . . . . . . . . . . . . . . . . . . . .  14\n  A.1.  Inter-Area LSP Path Setup . . . . . . . . . . . . . . . .  14\n  A.2.  Inter-AS LSP Path Setup . . . . . . . . . . . . . . . . .  15\n    A.2.1.  Example 1 . . . . . . . . . . . . . . . . . . . . . .  15\n    A.2.2.  Example 2 . . . . . . . . . . . . . . . . . . . . . .  16\nAcknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .  17\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  18",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The RSVP-TE specification [RFC3209] and the GMPLS extensions to RSVP-TE [RFC3473] allow abstract nodes and resources to be explicitly included in a path setup using the Explicit Route Object (ERO). Further, Exclude Route extensions [RFC4874] allow abstract nodes or resources to be excluded from the whole path using the Exclude Route Object (XRO). To exclude certain abstract nodes or resources between a specific pair of abstract nodes present in an ERO, an Explicit Exclusion Route subobject (EXRS) is used.",
      "ja": "RSVP-TE仕様[RFC3209]およびRSVP-TEへのGMPLS拡張[RFC3473]により、抽象ルートオブジェクトおよびリソースを明示的ルートオブジェクト（ERO）を使用してパス設定に明示的に含めることができます。さらに、Exclude Route拡張機能[RFC4874]では、Exclude Route Object（XRO）を使用して、抽象ノードまたはリソースをパス全体から除外できます。 EROに存在する抽象ノードの特定のペア間の特定の抽象ノードまたはリソースを除外するには、明示的除外ルートサブオブジェクト（EXRS）を使用します。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] already describes the notion of abstract nodes, where an abstract node is a group of nodes whose internal topology is opaque to the ingress node of the Label Switched Path (LSP). It further defines a subobject for AS, but with a 2-byte AS number only.",
      "ja": "[RFC3209]は、抽象ノードの概念をすでに説明しています。抽象ノードは、内部トポロジーがラベルスイッチドパス（LSP）の入力ノードに対して不透明なノードのグループです。さらに、ASのサブオブジェクトを定義しますが、AS番号は2バイトのみです。"
    },
    {
      "indent": 3,
      "text": "This document extends the notion of abstract nodes by adding new subobjects for IGP areas and 4-byte AS numbers (as per [RFC6793]). These subobjects can be included in ERO, XRO, or EXRS.",
      "ja": "このドキュメントは、IGPエリアと4バイトのAS番号（[RFC6793]による）の新しいサブオブジェクトを追加することにより、抽象ノードの概念を拡張します。これらのサブオブジェクトは、ERO、XRO、またはEXRSに含めることができます。"
    },
    {
      "indent": 3,
      "text": "In case of per-domain path computation [RFC5152], where the full path of an inter-domain TE LSP cannot be or is not determined at the ingress node, the signaling message could use domain identifiers. The use of these new subobjects is illustrated in Appendix A.",
      "ja": "ドメインごとのパス計算[RFC5152]の場合、ドメイン間TE LSPのフルパスを入力ノードで決定できない、または決定できない場合、シグナリングメッセージはドメイン識別子を使用できます。これらの新しいサブオブジェクトの使用法については、付録Aで説明しています。"
    },
    {
      "indent": 3,
      "text": "Further, the domain identifier could simply act as a delimiter to specify where the domain boundary starts and ends.",
      "ja": "さらに、ドメイン識別子は、ドメイン境界がどこで始まりどこで終わるかを指定するためのデリミタとして機能します。"
    },
    {
      "indent": 3,
      "text": "This is a companion document to Path Computation Element Protocol (PCEP) extensions for the domain sequence [RFC7897].",
      "ja": "これは、ドメインシーケンス[RFC7897]のパス計算要素プロトコル（PCEP）拡張の関連ドキュメントです。"
    },
    {
      "indent": 0,
      "text": "1.1. Scope",
      "section_title": true,
      "ja": "1.1. 範囲"
    },
    {
      "indent": 3,
      "text": "The procedures described in this document are experimental. The experiment is intended to enable research for the usage of domain subobjects for inter-domain path setup. For this purpose, this document specifies new domain subobjects as well as how they incorporate with existing subobjects.",
      "ja": "このドキュメントで説明されている手順は実験的なものです。この実験の目的は、ドメイン間のパス設定でドメインサブオブジェクトを使用するための調査を可能にすることです。この目的のために、このドキュメントでは、新しいドメインサブオブジェクトと、それらが既存のサブオブジェクトとどのように統合されるかについて説明します。"
    },
    {
      "indent": 3,
      "text": "The experiment will end two years after the RFC is published. At that point, the RFC authors will attempt to determine how widely this has been implemented and deployed.",
      "ja": "実験はRFCが公開されてから2年後に終了します。その時点で、RFCの作成者は、これがどの程度広く実装および展開されているかを判断しようとします。"
    },
    {
      "indent": 3,
      "text": "This document does not change the procedures for handling subobjects in RSVP-TE.",
      "ja": "このドキュメントでは、RSVP-TEでサブオブジェクトを処理する手順は変更されません。"
    },
    {
      "indent": 3,
      "text": "The new subobjects introduced by this document will not be understood by legacy implementations. If a legacy implementation receives one of the subobjects that it does not understand in an RSVP-TE object, the legacy implementation will behave as described in [RFC3209] and [RFC4874]. Therefore, it is assumed that this experiment will be conducted only when all nodes processing the new subobject form part of the experiment.",
      "ja": "このドキュメントで紹介されている新しいサブオブジェクトは、従来の実装では理解されません。レガシー実装がRSVP-TEオブジェクトで理解できないサブオブジェクトの1つを受信した場合、レガシー実装は[RFC3209]および[RFC4874]で説明されているように動作します。したがって、この実験は、新しいサブオブジェクトを処理するすべてのノードが実験の一部を形成する場合にのみ実行されると想定されます。"
    },
    {
      "indent": 3,
      "text": "When the result of implementation and deployment are available, this document will be updated and refined, and then it will be moved from Experimental to Standards Track.",
      "ja": "実装と展開の結果が利用可能になると、このドキュメントは更新および改良され、実験から標準トラックに移動されます。"
    },
    {
      "indent": 3,
      "text": "It should be noted that there are other ways such as the use of a boundary node to identify the domain (instead of a domain identifier); the mechanism defined in this document is just another tool in the toolkit for the operator.",
      "ja": "（ドメイン識別子の代わりに）境界ノードを使用してドメインを識別するなど、他の方法があることに注意してください。このドキュメントで定義されているメカニズムは、オペレーター用のツールキットのもう1つのツールです。"
    },
    {
      "indent": 0,
      "text": "1.2. Requirements Language",
      "section_title": true,
      "ja": "1.2. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The following terminology is used in this document.",
      "ja": "このドキュメントでは、次の用語が使用されています。"
    },
    {
      "indent": 3,
      "text": "AS: Autonomous System",
      "ja": "AS：自律システム"
    },
    {
      "indent": 3,
      "text": "Domain: As per [RFC4655], any collection of network elements within a common sphere of address management or path computational responsibility. Examples of domains include IGP areas and ASes.",
      "ja": "ドメイン：[RFC4655]に従い、アドレス管理またはパス計算の責任の共通の領域内のネットワーク要素のコレクション。ドメインの例には、IGPエリアやASなどがあります。"
    },
    {
      "indent": 3,
      "text": "ERO: Explicit Route Object",
      "ja": "ERO：明示的なルートオブジェクト"
    },
    {
      "indent": 3,
      "text": "EXRS: Explicit Exclusion Route subobject",
      "ja": "EXRS：明示的除外ルートサブオブジェクト"
    },
    {
      "indent": 3,
      "text": "IGP: Interior Gateway Protocol. Either of the two routing protocols: Open Shortest Path First (OSPF) or Intermediate System to Intermediate System (IS-IS).",
      "ja": "IGP：Interior Gateway Protocol。 2つのルーティングプロトコル：Open Shortest Path First（OSPF）またはIntermediate System to Intermediate System（IS-IS）。"
    },
    {
      "indent": 3,
      "text": "IS-IS: Intermediate System to Intermediate System",
      "ja": "IS-IS：中間システムから中間システム"
    },
    {
      "indent": 0,
      "text": " OSPF: Open Shortest Path First PCE: Path Computation Element. An entity (component, application, or network node) that is capable of computing a network path or route based on a network graph and applying computational constraints.",
      "ja": "OSPF：Open Shortest Path First PCE：Path Computation Element。ネットワークグラフに基づいてネットワークパスまたはルートを計算し、計算上の制約を適用できるエンティティ（コンポーネント、アプリケーション、またはネットワークノード）。"
    },
    {
      "indent": 3,
      "text": "PCEP: Path Computation Element Protocol",
      "ja": "PCEP：パス計算要素プロトコル"
    },
    {
      "indent": 3,
      "text": "RSVP: Resource Reservation Protocol",
      "ja": "RSVP：リソース予約プロトコル"
    },
    {
      "indent": 3,
      "text": "TE LSP: Traffic Engineering Label Switched Path",
      "ja": "TE LSP：トラフィックエンジニアリングラベルスイッチドパス"
    },
    {
      "indent": 3,
      "text": "XRO: Exclude Route Object",
      "ja": "XRO：ルートオブジェクトを除外"
    },
    {
      "indent": 0,
      "text": "3. Subobjects for Domains",
      "section_title": true,
      "ja": "3. ドメインのサブオブジェクト"
    },
    {
      "indent": 0,
      "text": "3.1. Domains",
      "section_title": true,
      "ja": "3.1. ドメイン"
    },
    {
      "indent": 3,
      "text": "[RFC4726] and [RFC4655] define domain as a separate administrative or geographic environment within the network. A domain could be further defined as a zone of routing or computational ability. Under these definitions, a domain might be categorized as an AS or an IGP area.",
      "ja": "[RFC4726]および[RFC4655]は、ドメインをネットワーク内の個別の管理環境または地理的環境として定義します。ドメインは、ルーティングまたは計算能力のゾーンとしてさらに定義できます。これらの定義では、ドメインはASまたはIGPエリアとして分類される場合があります。"
    },
    {
      "indent": 3,
      "text": "As per [RFC3209], an abstract node is a group of nodes whose internal topology is opaque to the ingress node of the LSP. Using this concept of abstraction, an explicitly routed LSP can be specified as a sequence of IP prefixes or a sequence of ASes. In this document, we extend the notion to include the IGP area and 4-byte AS number.",
      "ja": "[RFC3209]によると、抽象ノードは内部トポロジがLSPの入力ノードに対して不透明であるノードのグループです。この抽象化の概念を使用すると、明示的にルーティングされたLSPを、一連のIPプレフィックスまたはASのシーケンスとして指定できます。このドキュメントでは、概念を拡張してIGP領域と4バイトのAS番号を含めます。"
    },
    {
      "indent": 3,
      "text": "These subobjects appear in RSVP-TE, notably in:",
      "ja": "これらのサブオブジェクトは、RSVP-TE、特に次の場所に表示されます。"
    },
    {
      "indent": 3,
      "text": "o Explicit Route Object (ERO): As per [RFC3209], an explicit route is a particular path in the network topology including abstract nodes (including domains).",
      "ja": "o 明示的ルートオブジェクト（ERO）：[RFC3209]によると、明示的ルートは、抽象ノード（ドメインを含む）を含むネットワークトポロジ内の特定のパスです。"
    },
    {
      "indent": 3,
      "text": "o Exclude Route Object (XRO): As per [RFC4874], an Exclude Route identifies a list of abstract nodes (including domains) that should not be traversed along the path of the LSP being established.",
      "ja": "o Exclude Route Object（XRO）：[RFC4874]に従い、Exclude Routeは、確立されているLSPのパスに沿ってトラバースしてはならない抽象ノード（ドメインを含む）のリストを識別します。"
    },
    {
      "indent": 3,
      "text": "o Explicit Exclusion Route Subobject (EXRS): As per [RFC4874], used to specify exclusion of certain abstract nodes between a specific pair of nodes. EXRS is a subobject carried inside the ERO. These subobjects can be used to specify the domains to be excluded between two abstract nodes.",
      "ja": "o 明示的除外ルートサブオブジェクト（EXRS）：[RFC4874]に従い、特定のノードのペア間の特定の抽象ノードの除外を指定するために使用されます。 EXRSは、ERO内で実行されるサブオブジェクトです。これらのサブオブジェクトを使用して、2つの抽象ノード間で除外するドメインを指定できます。"
    },
    {
      "indent": 0,
      "text": "3.2. Explicit Route Object (ERO) Subobjects",
      "section_title": true,
      "ja": "3.2. 明示的なルートオブジェクト（ERO）サブオブジェクト"
    },
    {
      "indent": 3,
      "text": "As stated in [RFC3209], an explicit route is a particular path in the network topology. In addition to the ability to identify specific nodes along the path, an explicit route can identify a group of nodes (abstract nodes) to be traversed along the path.",
      "ja": "[RFC3209]で述べられているように、明示的なルートはネットワークトポロジの特定のパスです。明示的なルートは、パスに沿って特定のノードを識別する機能に加えて、パスに沿って通過するノードのグループ（抽象ノード）を識別することができます。"
    },
    {
      "indent": 3,
      "text": "Some subobjects are defined in [RFC3209], [RFC3473], [RFC3477], [RFC4874], and [RFC5553], but new subobjects related to domains are needed.",
      "ja": "一部のサブオブジェクトは[RFC3209]、[RFC3473]、[RFC3477]、[RFC4874]、および[RFC5553]で定義されていますが、ドメインに関連する新しいサブオブジェクトが必要です。"
    },
    {
      "indent": 3,
      "text": "This document extends the support for 4-byte AS numbers and IGP areas.",
      "ja": "このドキュメントは、4バイトのAS番号とIGPエリアのサポートを拡張します。"
    },
    {
      "indent": 17,
      "text": "Value   Description\n-----   ---------\n5       4-byte AS number\n6       OSPF Area ID\n7       IS-IS Area ID",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.2.1. Autonomous System",
      "section_title": true,
      "ja": "3.2.1. 自律システム"
    },
    {
      "indent": 3,
      "text": "[RFC3209] already defines 2-byte AS numbers.",
      "ja": "[RFC3209]はすでに2バイトのAS番号を定義しています。"
    },
    {
      "indent": 3,
      "text": "To support 4-byte AS numbers as per [RFC6793], the following subobject is defined:",
      "ja": "[RFC6793]に従って4バイトのAS番号をサポートするために、次のサブオブジェクトが定義されています。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|L|    Type     |     Length    |         Reserved              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      AS Number (4 bytes)                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "L: The L bit is an attribute of the subobject as defined in [RFC3209], i.e., it's set if the subobject represents a loose hop in the explicit route. If the bit is not set, the subobject represents a strict hop in the explicit route.",
      "ja": "L：Lビットは、[RFC3209]で定義されているサブオブジェクトの属性です。つまり、サブオブジェクトが明示的なルートのルーズホップを表す場合に設定されます。ビットが設定されていない場合、サブオブジェクトは明示的なルートの厳密なホップを表します。"
    },
    {
      "indent": 3,
      "text": "Type: 5 (indicating a 4-byte AS number).",
      "ja": "タイプ：5（4バイトのAS番号を示す）。"
    },
    {
      "indent": 3,
      "text": "Length: 8 (total length of the subobject in bytes).",
      "ja": "長さ：8（バイト単位のサブオブジェクトの全長）。"
    },
    {
      "indent": 3,
      "text": "Reserved: Zero at transmission; ignored at receipt.",
      "ja": "予約済み：送信時にゼロ。受領時に無視されました。"
    },
    {
      "indent": 3,
      "text": "AS Number: The 4-byte AS number. Note that if 2-byte AS numbers are in use, the low-order bits (16 through 31) MUST be used, and the high-order bits (0 through 15) MUST be set to zero. For the purpose of this experiment, it is advised to use a 4-byte AS number subobject as the default.",
      "ja": "AS番号：4バイトのAS番号。 2バイトのAS番号が使用されている場合は、下位ビット（16〜31）を使用する必要があり、上位ビット（0〜15）をゼロに設定する必要があることに注意してください。この実験では、4バイトのAS番号サブオブジェクトをデフォルトとして使用することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "3.2.2. IGP Area",
      "section_title": true,
      "ja": "3.2.2. IGPエリア"
    },
    {
      "indent": 3,
      "text": "Since the length and format of Area ID is different for OSPF and IS-IS, the following two subobjects are defined:",
      "ja": "エリアIDの長さと形式はOSPFとIS-ISで異なるため、次の2つのサブオブジェクトが定義されています。"
    },
    {
      "indent": 3,
      "text": "For OSPF, the Area ID is a 32-bit number. The subobject is encoded as follows:",
      "ja": "OSPFの場合、エリアIDは32ビットの数値です。サブオブジェクトは次のようにエンコードされます。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|L|    Type     |     Length    |         Reserved              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    OSPF Area ID (4 bytes)                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "L: The L bit is an attribute of the subobject as defined in [RFC3209].",
      "ja": "L：Lビットは、[RFC3209]で定義されているサブオブジェクトの属性です。"
    },
    {
      "indent": 3,
      "text": "Type: 6 (indicating a 4-byte OSPF Area ID).",
      "ja": "タイプ：6（4バイトのOSPFエリアIDを示す）。"
    },
    {
      "indent": 3,
      "text": "Length: 8 (total length of the subobject in bytes).",
      "ja": "長さ：8（バイト単位のサブオブジェクトの全長）。"
    },
    {
      "indent": 3,
      "text": "Reserved: Zero at transmission; ignored at receipt.",
      "ja": "予約済み：送信時にゼロ。受領時に無視されました。"
    },
    {
      "indent": 3,
      "text": "OSPF Area ID: The 4-byte OSPF Area ID.",
      "ja": "OSPFエリアID：4バイトのOSPFエリアID。"
    },
    {
      "indent": 3,
      "text": "For IS-IS, the Area ID is of variable length; thus, the length of the subobject is variable. The Area ID is as described in IS-IS by the ISO standard [ISO10589]. The subobject is encoded as follows:",
      "ja": "IS-ISの場合、エリアIDは可変長です。したがって、サブオブジェクトの長さは可変です。エリアIDは、ISO標準[ISO10589]によってIS-ISに記述されているとおりです。サブオブジェクトは次のようにエンコードされます。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|L|    Type     |     Length    |  Area-Len     |  Reserved     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n//                        IS-IS Area ID                        //\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "L: The L bit is an attribute of the subobject as defined in [RFC3209].",
      "ja": "L：Lビットは、[RFC3209]で定義されているサブオブジェクトの属性です。"
    },
    {
      "indent": 3,
      "text": "Type: 7 (indicating the IS-IS Area ID).",
      "ja": "タイプ：7（IS-ISエリアIDを示す）。"
    },
    {
      "indent": 3,
      "text": "Length: Variable. The length MUST be at least 8 and MUST be a multiple of 4.",
      "ja": "長さ：可変。長さは少なくとも8でなければならず、4の倍数でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Area-Len: Variable (length of the actual (non-padded) IS-IS area identifier in octets; valid values are from 1 to 13, inclusive).",
      "ja": "Area-Len：変数（実際の（パディングされていない）IS-ISエリア識別子の長さ（オクテット）。有効な値は1〜13です）。"
    },
    {
      "indent": 3,
      "text": "Reserved: Zero at transmission; ignored at receipt.",
      "ja": "予約済み：送信時にゼロ。受領時に無視されました。"
    },
    {
      "indent": 3,
      "text": "IS-IS Area ID: The variable-length IS-IS area identifier. Padded with trailing zeroes to a 4-byte boundary.",
      "ja": "IS-ISエリアID：可変長のIS-ISエリアID。末尾のゼロで4バイト境界まで埋め込まれます。"
    },
    {
      "indent": 0,
      "text": "3.2.3. Mode of Operation",
      "section_title": true,
      "ja": "3.2.3. 動作モード"
    },
    {
      "indent": 3,
      "text": "The new subobjects to support 4-byte AS numbers and the IGP (OSPF / IS-IS) area could be used in the ERO to specify an abstract node (a group of nodes whose internal topology is opaque to the ingress node of the LSP).",
      "ja": "4バイトのAS番号とIGP（OSPF / IS-IS）領域をサポートする新しいサブオブジェクトをEROで使用して、抽象ノード（内部トポロジがLSPの入力ノードに対して不透明であるノードのグループ）を指定できます。 。"
    },
    {
      "indent": 3,
      "text": "All the rules of processing (for example, next-hop selection, L bit processing, unrecognized subobjects, etc.) are as per the [RFC3209]. Note that if a node is called upon to process subobjects defined in this document that it does not recognize, it will behave as described in [RFC3209] when an unrecognized ERO subobject is encountered. This means that this node will return a PathErr with error code \"Routing Error\" and error value \"Bad EXPLICIT_ROUTE object\" with the EXPLICIT_ROUTE object included, truncated (on the left) to the offending subobject.",
      "ja": "すべての処理規則（たとえば、ネクストホップ選択、Lビット処理、認識されないサブオブジェクトなど）は、[RFC3209]に準拠しています。このドキュメントで定義されているサブオブジェクトを処理するためにノードが認識されない場合、ノードは認識されないEROサブオブジェクトが検出されると、[RFC3209]で説明されているように動作します。つまり、このノードは、エラーコード「Routing Error」とエラー値「Bad EXPLICIT_ROUTE object」を含むPathErrを返します。EXPLICIT_ROUTEオブジェクトが含まれ、問題のあるサブオブジェクトに切り捨てられます（左側）。"
    },
    {
      "indent": 0,
      "text": "3.3. Exclude Route Object (XRO) Subobjects",
      "section_title": true,
      "ja": "3.3. ルートオブジェクト（XRO）サブオブジェクトを除外"
    },
    {
      "indent": 3,
      "text": "As stated in [RFC4874], the Exclude Route identifies a list of abstract nodes to exclude (not be traversed) along the path of the LSP being established.",
      "ja": "[RFC4874]で述べられているように、除外ルートは、確立されているLSPのパスに沿って除外する（通過しない）抽象ノードのリストを識別します。"
    },
    {
      "indent": 3,
      "text": "Some subobjects are defined in [RFC3209], [RFC3477], [RFC4874], and [RFC6001], but new subobjects related to domains are needed.",
      "ja": "一部のサブオブジェクトは[RFC3209]、[RFC3477]、[RFC4874]、および[RFC6001]で定義されていますが、ドメインに関連する新しいサブオブジェクトが必要です。"
    },
    {
      "indent": 3,
      "text": "This document extends the support for 4-byte AS numbers and IGP areas.",
      "ja": "このドキュメントは、4バイトのAS番号とIGPエリアのサポートを拡張します。"
    },
    {
      "indent": 17,
      "text": "Value   Description\n-----   ---------\n5       4-byte AS number\n6       OSPF Area ID\n7       IS-IS Area ID",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.3.1. Autonomous System",
      "section_title": true,
      "ja": "3.3.1. 自律システム"
    },
    {
      "indent": 3,
      "text": "[RFC3209] and [RFC4874] already define a 2-byte AS number.",
      "ja": "[RFC3209]と[RFC4874]はすでに2バイトのAS番号を定義しています。"
    },
    {
      "indent": 3,
      "text": "To support 4-byte AS numbers as per [RFC6793], a subobject has the same format as defined in Section 3.2.1 with the following difference:",
      "ja": "[RFC6793]に従って4バイトのAS番号をサポートするために、サブオブジェクトはセクション3.2.1で定義されたものと同じ形式を持ちますが、次の違いがあります。"
    },
    {
      "indent": 3,
      "text": "The meaning of the L bit is as per [RFC4874], where:",
      "ja": "Lビットの意味は、[RFC4874]と同じです。ここで、"
    },
    {
      "indent": 3,
      "text": "0: indicates that the abstract node specified MUST be excluded.",
      "ja": "0：指定した抽象ノードを除外する必要があることを示します。"
    },
    {
      "indent": 3,
      "text": "1: indicates that the abstract node specified SHOULD be avoided.",
      "ja": "1：指定された抽象ノードが回避されるべきであることを示します。"
    },
    {
      "indent": 0,
      "text": "3.3.2. IGP Area",
      "section_title": true,
      "ja": "3.3.2. IGPエリア"
    },
    {
      "indent": 3,
      "text": "Since the length and format of Area ID is different for OSPF and IS-IS, the following two subobjects are defined:",
      "ja": "エリアIDの長さと形式はOSPFとIS-ISで異なるため、次の2つのサブオブジェクトが定義されています。"
    },
    {
      "indent": 3,
      "text": "For OSPF, the Area ID is a 32-bit number. Subobjects for OSPF and IS-IS are of the same format as defined in Section 3.2.2 with the following difference:",
      "ja": "OSPFの場合、エリアIDは32ビットの数値です。 OSPFおよびIS-ISのサブオブジェクトは、セクション3.2.2で定義されているものと同じ形式ですが、次の違いがあります。"
    },
    {
      "indent": 3,
      "text": "The meaning of the L bit is as per [RFC4874].",
      "ja": "Lビットの意味は[RFC4874]によるものです。"
    },
    {
      "indent": 0,
      "text": "3.3.3. Mode of Operation",
      "section_title": true,
      "ja": "3.3.3. 動作モード"
    },
    {
      "indent": 3,
      "text": "The new subobjects to support 4-byte AS numbers and the IGP (OSPF / IS-IS) area could also be used in the XRO to specify exclusion of an abstract node (a group of nodes whose internal topology is opaque to the ingress node of the LSP).",
      "ja": "4バイトのAS番号とIGP（OSPF / IS-IS）領域をサポートする新しいサブオブジェクトをXROで使用して、抽象ノード（内部トポロジーの入力ノードに対して不透明なノードのグループ）の除外を指定することもできます。 LSP）。"
    },
    {
      "indent": 3,
      "text": "All the rules of processing are as per [RFC4874].",
      "ja": "処理のすべてのルールは[RFC4874]によるものです。"
    },
    {
      "indent": 3,
      "text": "Note that if a node is called upon to process a subobject defined in this document that it does not recognize, it will behave as described in [RFC4874] when an unrecognized XRO subobject is encountered, i.e., ignore it. In this case, the desired exclusion will not be carried out.",
      "ja": "このドキュメントで定義されているサブオブジェクトを処理するためにノードが呼び出され、認識されない場合、[RFC4874]で説明されているように、認識されないXROサブオブジェクトが検出されると、ノードは無視されます。この場合、目的の除外は実行されません。"
    },
    {
      "indent": 3,
      "text": "IGP area subobjects in the XRO are local to the current AS. In case of multi-AS path computation that excludes an IGP area in a different AS, an IGP area subobject should be part of EXRS in the ERO to specify the AS in which the IGP area is to be excluded. Further, policy may be applied to prune/ignore area subobjects in XRO at the AS boundary.",
      "ja": "XROのIGPエリアサブオブジェクトは、現在のASに対してローカルです。異なるASのIGPエリアを除外するマルチASパス計算の場合、IGPエリアが除外されるASを指定するには、IGPエリアサブオブジェクトをEROのEXRSの一部にする必要があります。さらに、ポリシーを適用して、AS境界でXROのエリアサブオブジェクトをプルーニング/無視することができます。"
    },
    {
      "indent": 0,
      "text": "3.4. Explicit Exclusion Route Subobject",
      "section_title": true,
      "ja": "3.4. 明示的な除外ルートサブオブジェクト"
    },
    {
      "indent": 3,
      "text": "As per [RFC4874], the Explicit Exclusion Route is used to specify exclusion of certain abstract nodes between a specific pair of nodes or resources in the explicit route. EXRS is an ERO subobject that contains one or more subobjects of its own, called EXRS subobjects.",
      "ja": "[RFC4874]によると、明示的除外ルートは、明示的ルートのノードまたはリソースの特定のペア間の特定の抽象ノードの除外を指定するために使用されます。 EXRSは、EXRSサブオブジェクトと呼ばれる独自のサブオブジェクトを1つ以上含むEROサブオブジェクトです。"
    },
    {
      "indent": 3,
      "text": "The EXRS subobject could carry any of the subobjects defined for XRO; thus, the new subobjects to support 4-byte AS numbers and the IGP (OSPF / IS-IS) area can also be used in the EXRS. The meanings of the fields of the new XRO subobjects are unchanged when the subobjects are included in an EXRS, except that the scope of the exclusion is limited to the single hop between the previous and subsequent elements in the ERO.",
      "ja": "EXRSサブオブジェクトは、XROに対して定義されたサブオブジェクトを運ぶことができます。したがって、4バイトのAS番号とIGP（OSPF / IS-IS）領域をサポートする新しいサブオブジェクトも、EXRSで使用できます。サブオブジェクトがEXRSに含まれている場合、新しいXROサブオブジェクトのフィールドの意味は変わりません。ただし、除外の範囲は、EROの前の要素と後続の要素の間のシングルホップに制限されます。"
    },
    {
      "indent": 3,
      "text": "All the rules of processing are as per [RFC4874].",
      "ja": "処理のすべてのルールは[RFC4874]によるものです。"
    },
    {
      "indent": 0,
      "text": "4. Interaction with Path Computation Element (PCE)",
      "section_title": true,
      "ja": "4. パス計算要素（PCE）との相互作用"
    },
    {
      "indent": 3,
      "text": "The domain subobjects to be used in PCEP are referred to in [RFC7897]. Note that the new domain subobjects follow the principle that subobjects used in PCEP [RFC5440] are identical to the subobjects used in RSVP-TE and thus are interchangeable between PCEP and RSVP-TE.",
      "ja": "PCEPで使用されるドメインサブオブジェクトは、[RFC7897]で参照されています。新しいドメインサブオブジェクトは、PCEP [RFC5440]で使用されるサブオブジェクトがRSVP-TEで使用されるサブオブジェクトと同一であり、PCEPとRSVP-TEの間で交換可能であるという原則に従っていることに注意してください。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAに関する考慮事項"
    },
    {
      "indent": 0,
      "text": "5.1. New Subobjects",
      "section_title": true,
      "ja": "5.1. 新しいサブオブジェクト"
    },
    {
      "indent": 3,
      "text": "IANA maintains the \"Resource Reservation Protocol (RSVP) Parameters\" registry at <http://www.iana.org/assignments/rsvp-parameters>. Within this registry, IANA maintains two sub-registries:",
      "ja": "IANAは、<http://www.iana.org/assignments/rsvp-parameters>で「リソース予約プロトコル（RSVP）パラメータ」レジストリを維持しています。このレジストリ内で、IANAは2つのサブレジストリを保持しています。"
    },
    {
      "indent": 3,
      "text": "o EXPLICIT_ROUTE subobjects (see \"Sub-object type - 20 EXPLICIT_ROUTE - Type 1 Explicit Route\")",
      "ja": "o EXPLICIT_ROUTEサブオブジェクト（「サブオブジェクトタイプ-20 EXPLICIT_ROUTE-タイプ1明示ルート」を参照）"
    },
    {
      "indent": 3,
      "text": "o EXCLUDE_ROUTE subobjects (see \"Sub-object types of Class Types or C-Types - 232 EXCLUDE_ROUTE\")",
      "ja": "o EXCLUDE_ROUTEサブオブジェクト（「クラスタイプまたはCタイプのサブオブジェクトタイプ-232 EXCLUDE_ROUTE」を参照）"
    },
    {
      "indent": 3,
      "text": "IANA has made identical additions to these registries as follows, in sync with [RFC7897]:",
      "ja": "IANAは、[RFC7897]と同期して、次のようにこれらのレジストリに同じ追加を行いました。"
    },
    {
      "indent": 3,
      "text": "Value   Description         Reference\n-----   ----------------    -------------------\n5       4-byte AS number    [RFC7897], RFC 7898\n6       OSPF Area ID        [RFC7897], RFC 7898\n7       IS-IS Area ID       [RFC7897], RFC 7898",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Further, IANA has added a reference to this document to the new PCEP numbers that are registered by [RFC7897], as shown on <http://www.iana.org/assignments/pcep>.",
      "ja": "さらに、<http://www.iana.org/assignments/pcep>に示すように、IANAはこのドキュメントへの参照を[RFC7897]によって登録された新しいPCEP番号に追加しました。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Security considerations for RSVP-TE and GMPLS signaling RSVP-TE extensions are covered in [RFC3209] and [RFC3473]. This document does not introduce any new messages or any substantive new processing, so those security considerations continue to apply. Further, general considerations for securing RSVP-TE in MPLS-TE and GMPLS networks can be found in [RFC5920]. Section 8 of [RFC5920] describes the inter-provider security considerations, which continue to apply.",
      "ja": "RSVP-TEおよびGMPLSシグナリングのセキュリティに関する考慮事項RSVP-TE拡張は、[RFC3209]および[RFC3473]でカバーされています。このドキュメントでは、新しいメッセージや実質的な新しい処理を紹介していないため、これらのセキュリティに関する考慮事項が引き続き適用されます。さらに、MPLS-TEおよびGMPLSネットワークでRSVP-TEを保護するための一般的な考慮事項は、[RFC5920]にあります。 [RFC5920]のセクション8は、引き続き適用されるプロバイダー間セキュリティの考慮事項について説明しています。"
    },
    {
      "indent": 3,
      "text": "The route exclusion security considerations are covered in [RFC4874] and continue to apply.",
      "ja": "ルート除外のセキュリティに関する考慮事項は[RFC4874]でカバーされており、引き続き適用されます。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[ISO10589] International Organization for Standardization, \"Information technology -- Telecommunications and information exchange between systems -- Intermediate System to Intermediate System intra-domain routeing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode network service (ISO 8473)\", ISO/IEC 10589:2002, Second Edition, November 2002.",
      "ja": "[ISO10589]国際標準化機構、「情報技術-システム間のテレコミュニケーションおよび情報交換-コネクションレスモードのネットワークサービス（ISOを提供するためのプロトコルと組み合わせて使用​​するための中間システムから中間システムのドメイン内ルーティング情報交換プロトコル8473） \"、ISO / IEC 10589：2002、Second Edition、2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, DOI 10.17487/RFC3209, December 2001, <http://www.rfc-editor.org/info/rfc3209>.",
      "ja": "[RFC3209] Awduche、D.、Berger、L.、Gan、D.、Li、T.、Srinivasan、V。、およびG. Swallow、「RSVP-TE：Extensions for RSVP for LSP Tunnels」、RFC 3209、DOI 10.17487 / RFC3209、2001年12月、<http://www.rfc-editor.org/info/rfc3209>。"
    },
    {
      "indent": 3,
      "text": "[RFC3473] Berger, L., Ed., \"Generalized Multi-Protocol Label Switching (GMPLS) Signaling Resource ReserVation Protocol-Traffic Engineering (RSVP-TE) Extensions\", RFC 3473, DOI 10.17487/RFC3473, January 2003, <http://www.rfc-editor.org/info/rfc3473>.",
      "ja": "[RFC3473] Berger、L.、Ed。、「Generalized Multi-Protocol Label Switching（GMPLS）Signaling Resource ReserVation Protocol-Traffic Engineering（RSVP-TE）Extensions」、RFC 3473、DOI 10.17487 / RFC3473、2003年1月、<http： //www.rfc-editor.org/info/rfc3473>。"
    },
    {
      "indent": 3,
      "text": "[RFC3477] Kompella, K. and Y. Rekhter, \"Signalling Unnumbered Links in Resource ReSerVation Protocol - Traffic Engineering (RSVP-TE)\", RFC 3477, DOI 10.17487/RFC3477, January 2003, <http://www.rfc-editor.org/info/rfc3477>.",
      "ja": "[RFC3477] Kompella、K。、およびY. Rekhter、「Resource ReSerVation Protocol-Traffic Engineering（RSVP-TE）での番号なしリンクのシグナリング」、RFC 3477、DOI 10.17487 / RFC3477、2003年1月、<http：//www.rfc- editor.org/info/rfc3477>。"
    },
    {
      "indent": 3,
      "text": "[RFC4874] Lee, CY., Farrel, A., and S. De Cnodder, \"Exclude Routes - Extension to Resource ReserVation Protocol-Traffic Engineering (RSVP-TE)\", RFC 4874, DOI 10.17487/RFC4874, April 2007, <http://www.rfc-editor.org/info/rfc4874>.",
      "ja": "[RFC4874] Lee、CY。、Farrel、A。、およびS. De Cnodder、「Exclude Routes-Extension to Resource ReserVation Protocol-Traffic Engineering（RSVP-TE）」、RFC 4874、DOI 10.17487 / RFC4874、2007年4月、< http://www.rfc-editor.org/info/rfc4874>。"
    },
    {
      "indent": 3,
      "text": "[RFC7897] Dhody, D., Palle, U., and R. Casellas, \"Domain Subobjects for the Path Computation Element Communication Protocol (PCEP)\", RFC 7897, DOI 10.17487/RFC7897, June 2016, <http://www.rfc-editor.org/info/rfc7897>.",
      "ja": "[RFC7897] Dhody、D.、Palle、U。、およびR. Casellas、「Path Computation Element Communication Protocol（PCEP）のドメインサブオブジェクト」、RFC 7897、DOI 10.17487 / RFC7897、2016年6月、<http：// www .rfc-editor.org / info / rfc7897>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC4655] Farrel, A., Vasseur, J., and J. Ash, \"A Path Computation Element (PCE)-Based Architecture\", RFC 4655, DOI 10.17487/RFC4655, August 2006, <http://www.rfc-editor.org/info/rfc4655>.",
      "ja": "[RFC4655] Farrel、A.、Vasseur、J。、およびJ. Ash、「A Path Computation Element（PCE）-Based Architecture」、RFC 4655、DOI 10.17487 / RFC4655、2006年8月、<http：//www.rfc -editor.org/info/rfc4655>。"
    },
    {
      "indent": 3,
      "text": "[RFC4726] Farrel, A., Vasseur, J., and A. Ayyangar, \"A Framework for Inter-Domain Multiprotocol Label Switching Traffic Engineering\", RFC 4726, DOI 10.17487/RFC4726, November 2006, <http://www.rfc-editor.org/info/rfc4726>.",
      "ja": "[RFC4726] Farrel、A.、Vasseur、J。、およびA. Ayyangar、「A Framework for Inter-domain Multiprotocol Label Switching Traffic Engineering」、RFC 4726、DOI 10.17487 / RFC4726、2006年11月、<http：// www。 rfc-editor.org/info/rfc4726>。"
    },
    {
      "indent": 3,
      "text": "[RFC5152] Vasseur, JP., Ed., Ayyangar, A., Ed., and R. Zhang, \"A Per-Domain Path Computation Method for Establishing Inter-Domain Traffic Engineering (TE) Label Switched Paths (LSPs)\", RFC 5152, DOI 10.17487/RFC5152, February 2008, <http://www.rfc-editor.org/info/rfc5152>.",
      "ja": "[RFC5152] Vasseur、JP。、編、Ayyangar、A。、編、およびR. Zhang、「ドメイン間トラフィックエンジニアリング（TE）ラベルスイッチドパス（LSP）を確立するためのドメインごとのパス計算方法」、 RFC 5152、DOI 10.17487 / RFC5152、2008年2月、<http://www.rfc-editor.org/info/rfc5152>。"
    },
    {
      "indent": 3,
      "text": "[RFC5440] Vasseur, JP., Ed. and JL. Le Roux, Ed., \"Path Computation Element (PCE) Communication Protocol (PCEP)\", RFC 5440, DOI 10.17487/RFC5440, March 2009, <http://www.rfc-editor.org/info/rfc5440>.",
      "ja": "[RFC5440] Vasseur、JP。、Ed。とJL。 Le Roux、編、「Path Computation Element（PCE）Communication Protocol（PCEP）」、RFC 5440、DOI 10.17487 / RFC5440、2009年3月、<http://www.rfc-editor.org/info/rfc5440>。"
    },
    {
      "indent": 3,
      "text": "[RFC5553] Farrel, A., Ed., Bradford, R., and JP. Vasseur, \"Resource Reservation Protocol (RSVP) Extensions for Path Key Support\", RFC 5553, DOI 10.17487/RFC5553, May 2009, <http://www.rfc-editor.org/info/rfc5553>.",
      "ja": "[RFC5553] Farrel、A.、Ed。、Bradford、R.、JP。 Vasseur、「Resource Reservation Protocol（RSVP）Extensions for Path Key Support」、RFC 5553、DOI 10.17487 / RFC5553、2009年5月、<http://www.rfc-editor.org/info/rfc5553>。"
    },
    {
      "indent": 3,
      "text": "[RFC5920] Fang, L., Ed., \"Security Framework for MPLS and GMPLS Networks\", RFC 5920, DOI 10.17487/RFC5920, July 2010, <http://www.rfc-editor.org/info/rfc5920>.",
      "ja": "[RFC5920] Fang、L。、編、「MPLSおよびGMPLSネットワークのセキュリティフレームワーク」、RFC 5920、DOI 10.17487 / RFC5920、2010年7月、<http://www.rfc-editor.org/info/rfc5920>。"
    },
    {
      "indent": 3,
      "text": "[RFC6001] Papadimitriou, D., Vigoureux, M., Shiomoto, K., Brungard, D., and JL. Le Roux, \"Generalized MPLS (GMPLS) Protocol Extensions for Multi-Layer and Multi-Region Networks (MLN/ MRN)\", RFC 6001, DOI 10.17487/RFC6001, October 2010, <http://www.rfc-editor.org/info/rfc6001>.",
      "ja": "[RFC6001] Papadimitriou、D.、Vigoureux、M.、Siomoto、K.、Brungard、D。、およびJL。 Le Roux、「Multilayer- Multi-Region Networks（MLN / MRN）のGeneralized MPLS（GMPLS）Protocol Extensions」、RFC 6001、DOI 10.17487 / RFC6001、2010年10月、<http://www.rfc-editor.org / info / rfc6001>。"
    },
    {
      "indent": 3,
      "text": "[RFC6793] Vohra, Q. and E. Chen, \"BGP Support for Four-Octet Autonomous System (AS) Number Space\", RFC 6793, DOI 10.17487/RFC6793, December 2012, <http://www.rfc-editor.org/info/rfc6793>.",
      "ja": "[RFC6793] Vohra、Q。およびE. Chen、「BGP Support for Four-Octet Autonomous System（AS）Number Space」、RFC 6793、DOI 10.17487 / RFC6793、2012年12月、<http：//www.rfc-editor。 org / info / rfc6793>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Examples",
      "section_title": true,
      "ja": "付録A.例"
    },
    {
      "indent": 3,
      "text": "These examples are for illustration purposes only to show how the new subobjects could be encoded. They are not meant to be an exhaustive list of all possible use cases and combinations.",
      "ja": "これらの例は、新しいサブオブジェクトがどのようにエンコードされるかを示すための説明のみを目的としています。これらは、考えられるすべての使用例と組み合わせの完全なリストであることを意味していません。"
    },
    {
      "indent": 0,
      "text": "A.1. Inter-Area LSP Path Setup",
      "section_title": true,
      "ja": "A.1. エリア間LSPパスの設定"
    },
    {
      "indent": 3,
      "text": "In an inter-area LSP path setup where the ingress and the egress belong to different IGP areas within the same AS, the domain subobjects could be represented using an ordered list of IGP area subobjects in an ERO.",
      "ja": "入力と出力が同じAS内の異なるIGPエリアに属するエリア間LSPパス設定では、ドメインサブオブジェクトは、EROのIGPエリアサブオブジェクトの順序付きリストを使用して表すことができます。"
    },
    {
      "indent": 4,
      "text": "                               D2 Area D\n                               |\n                               |\n                               D1\n                               |\n                               |\n                       ********BD1******\n                       *       |       *\n                       *       |       *                Area C\n Area A                *       |       *\n                       *       |       *\n Ingress------A1-----ABF1------B1------BC1------C1------Egress\n                     / *       |       *\n                   /   *       |       *\n                 /     * Area  | B     *\n               F1      *       |       *\n             /         ********BE1******\n           /                   |\n         /                     |\n        F2                     E1\n                               |\nArea F                         |\n                               E2 Area E",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "* All IGP areas in one AS (AS 100)",
      "ja": "* 1つのAS内のすべてのIGPエリア（AS 100）"
    },
    {
      "indent": 16,
      "text": "Figure 1: Domain Corresponding to IGP Area",
      "ja": "図1：IGPエリアに対応するドメイン"
    },
    {
      "indent": 3,
      "text": "As per Figure 1, the signaling at the ingress could be:",
      "ja": "図1のように、入口でのシグナリングは次のようになります。"
    },
    {
      "indent": 3,
      "text": "ERO:(A1, ABF1, area B, area C, egress)",
      "ja": "ERO：（A1、ABF1、エリアB、エリアC、下り）"
    },
    {
      "indent": 0,
      "text": " It should be noted that there are other ways to achieve the desired signaling; the area subobject provides another tool in the toolkit and can have operational benefits when: o Use of PCEP-like domain sequence [RFC7897] configurations in the explicit path is such that area subobjects can be used to signal the loose path.",
      "ja": "必要なシグナリングを実現する方法は他にもあることに注意してください。エリアサブオブジェクトはツールキットの別のツールを提供し、次の場合に操作上の利点があります。o明示的なパスでPCEPのようなドメインシーケンス[RFC7897]構成を使用すると、エリアサブオブジェクトを使用してルーズパスを通知できます。"
    },
    {
      "indent": 3,
      "text": "o Alignment of subobjects and registries is between PCEP and RSVP-TE, thus allowing easier interworking between path computation and signaling, i.e., subobjects are able to switch between signaling and path computation (if need be).",
      "ja": "o サブオブジェクトとレジストリの整列はPCEPとRSVP-TEの間で行われるため、パス計算とシグナリングの間の相互作用が容易になります。つまり、サブオブジェクトはシグナリングとパス計算を切り替えることができます（必要な場合）。"
    },
    {
      "indent": 0,
      "text": "A.2. Inter-AS LSP Path Setup",
      "section_title": true,
      "ja": "A.2. Inter-AS LSPパスの設定"
    },
    {
      "indent": 0,
      "text": "A.2.1. Example 1",
      "section_title": true,
      "ja": "A.2.1. 例1"
    },
    {
      "indent": 3,
      "text": "In an inter-AS LSP path setup where the ingress and the egress belong to a different AS, the domain subobjects (ASes) could be used in an ERO.",
      "ja": "入力と出力が異なるASに属するAS間LSPパス設定では、EROでドメインサブオブジェクト（AS）を使用できます。"
    },
    {
      "indent": 9,
      "text": "     AS A                AS E                AS C\n<------------->      <---------->      <------------->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "             A4----------E1---E2---E3---------C4\n            /           /                       \\\n          /            /                          \\\n        /            /       AS B                   \\\n      /            /      <---------->                \\\nIngress------A1---A2------B1---B2---B3------C1---C2------Egress\n      \\                                    /          /\n        \\                                /          /\n          \\                            /          /\n            \\                        /          /\n             A3----------D1---D2---D3---------C3",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 30,
      "text": "<---------->\n    AS D",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "* All ASes have one area (area 0)",
      "ja": "* すべてのASには1つのエリア（エリア0）があります"
    },
    {
      "indent": 19,
      "text": "Figure 2: Domain Corresponding to AS",
      "ja": "図2：ASに対応するドメイン"
    },
    {
      "indent": 3,
      "text": "As per Figure 2, the signaling at the ingress could be:",
      "ja": "図2のように、入口でのシグナリングは次のようになります。"
    },
    {
      "indent": 3,
      "text": "ERO:(A1, A2, AS B, AS C, egress); or",
      "ja": "ERO：（A1、A2、AS B、AS C、出力）;または"
    },
    {
      "indent": 3,
      "text": "ERO:(A1, A2, AS B, area 0, AS C, area 0, egress).",
      "ja": "ERO：（A1、A2、AS B、エリア0、AS C、エリア0、出力）。"
    },
    {
      "indent": 3,
      "text": "Each AS has a single IGP area (area 0); the area subobject is optional.",
      "ja": "各ASには、単一のIGPエリア（エリア0）があります。エリアサブオブジェクトはオプションです。"
    },
    {
      "indent": 3,
      "text": "Note that to get a domain disjoint path, the ingress could also signal the backup path with:",
      "ja": "ドメインのばらばらのパスを取得するために、イングレスはバックアップパスに次の信号を送ることもできます。"
    },
    {
      "indent": 3,
      "text": "XRO:(AS B)",
      "ja": "XRO：（AS B）"
    },
    {
      "indent": 0,
      "text": "A.2.2. Example 2",
      "section_title": true,
      "ja": "A.2.2. 例2"
    },
    {
      "indent": 3,
      "text": "As shown in Figure 3, where AS 200 is made up of multiple areas, the signaling can include both an AS and area subobject to uniquely identify a domain.",
      "ja": "図3に示すように、AS 200が複数のエリアで構成されている場合、シグナリングには、ドメインを一意に識別するために、ASとエリアサブオブジェクトの両方を含めることができます。"
    },
    {
      "indent": 6,
      "text": "   Ingress                *\n      |                 *\n      |               *\n      |             *\n      X1          *\n      \\\\        *\n       \\ \\    *\n        \\  \\*   Inter-AS\nAS 100   \\*  \\  Link\n        * \\    \\\n      *    \\     \\\n    *       \\      \\\n             \\       \\          D2 Area D\n   AS 200     \\        \\        |\n               \\         \\      |\n        Inter-  \\          \\    D1\n           AS    \\           \\  |\n         Link     \\            \\|\n                   \\    ********BD1******\n                    \\   *       |       *\n                     \\  *       |       *                Area C\n          Area A      \\ *       |       *\n                       \\*       |       *\n      A2------A1------AB1------B1------BC1------C1------Egress\n                        *       |       *\n                        *       |       *\n                        *       |       *\n                        * Area  | B     *\n                        ********BE1******\n                                |\n                                |\n                                E1\n                                |\n                                |\n                                E2 Area E",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "Figure 3: Domain Corresponding to AS and Area",
      "ja": "図3：ASとエリアに対応するドメイン"
    },
    {
      "indent": 3,
      "text": "As per Figure 3, the signaling at the ingress could be:",
      "ja": "図3のように、入口でのシグナリングは次のようになります。"
    },
    {
      "indent": 3,
      "text": "ERO:(X1, AS 200, area B, area C, egress).",
      "ja": "ERO：（X1、AS 200、エリアB、エリアC、出力）。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "We would like to thank Adrian Farrel, Lou Berger, George Swallow, Chirag Shah, Reeja Paul, Sandeep Boina, and Avantika for their useful comments and suggestions.",
      "ja": "Adrian Farrel、Lou Berger、George Swallow、Chirag Shah、Reeja Paul、Sandeep Boina、およびAvantikaの有益なコメントと提案に感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Vishnu Pavan Beeram for shepherding this document.",
      "ja": "このドキュメントを作成してくれたVishnu Pavan Beeramに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Deborah Brungard for being the responsible AD.",
      "ja": "責任あるADであるDeborah Brungardに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Amanda Baber for the IANA review.",
      "ja": "IANAレビューを提供してくれたAmanda Baberに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Brian Carpenter for the Gen-ART review.",
      "ja": "Gen-ARTレビューをしてくれたBrian Carpenterに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Liang Xia (Frank) for the SecDir review.",
      "ja": "SecDirレビューをありがとうLiang Xia（Frank）。"
    },
    {
      "indent": 3,
      "text": "Thanks to Spencer Dawkins and Barry Leiba for comments during the IESG review.",
      "ja": "IESGレビュー中のコメントについて、Spencer DawkinsとBarry Leibaに感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dhruv Dhody Huawei Technologies Divyashree Techno Park, Whitefield Bangalore, Karnataka 560066 India",
      "ja": "Dhruv Dhodai Huawei Technologies Divyashari Techno Park、Wheatfished Bangalore、Karnataka 2008インド"
    },
    {
      "indent": 3,
      "text": "Email: dhruv.ietf@gmail.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Udayasree Palle Huawei Technologies Divyashree Techno Park, Whitefield Bangalore, Karnataka 560066 India",
      "ja": "Udayasari Palle Huawei Technologies Divyashree Techno Park、Whitfield Bangalore、Karnataka 560066 India"
    },
    {
      "indent": 3,
      "text": "Email: udayasree.palle@huawei.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Venugopal Reddy Kondreddy Huawei Technologies Divyashree Techno Park, Whitefield Bangalore, Karnataka 560066 India",
      "ja": "Venugopal Reddy Kondareddy Huawei Technologies Divyashree Techno Park、Whitfield Bangalore、Karnatakaインド"
    },
    {
      "indent": 3,
      "text": "Email: venugopalreddyk@huawei.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Ramon Casellas CTTC Av. Carl Friedrich Gauss n7 Castelldefels, Barcelona 08860 Spain",
      "ja": "ラモンカセラスCTTC Av。カールフリードリヒガウスn7カステルデフェルス、バルセロナ08860スペイン"
    },
    {
      "indent": 3,
      "text": "Email: ramon.casellas@cttc.es",
      "raw": true,
      "ja": ""
    }
  ]
}