{
  "title": {
    "text": "RFC 7735 - Tracking Reviews of Documents",
    "ja": "RFC 7735 - 文書のレビューを追跡"
  },
  "number": 7735,
  "created_at": "2019-11-01 19:08:14.878894+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         R. Sparks\nRequest for Comments: 7735                                        Oracle\nCategory: Informational                                       T. Kivinen\nISSN: 2070-1721                                            INSIDE Secure\n                                                            January 2016",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Tracking Reviews of Documents",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Several review teams ensure specific types of review are performed on Internet-Drafts as they progress towards becoming RFCs. The tools used by these teams to assign and track reviews would benefit from tighter integration to the Datatracker. This document discusses requirements for improving those tools without disrupting current work flows.",
      "ja": "いくつかのレビューチームは、彼らがRFCになりつつ方に進むにつれて見直しの具体的な種類はインターネットドラフトで実行されていることを確認します。レビューを割り当て、追跡するために、これらのチームが使用するツールはDatatrackerに密接な統合の恩恵を受けるだろう。この文書では、現在の作業の流れを中断することなく、これらのツールを改善するための要件について説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7735.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7735で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Overview of Current Workflows . . . . . . . . . . . . . . . .   3\n3.  Requirements  . . . . . . . . . . . . . . . . . . . . . . . .   5\n  3.1.  Secretariat Focused . . . . . . . . . . . . . . . . . . .   5\n  3.2.  Review-Team Secretary Focused . . . . . . . . . . . . . .   5\n  3.3.  Reviewer Focused  . . . . . . . . . . . . . . . . . . . .   8\n  3.4.  Review Requester and Consumer Focused . . . . . . . . . .  10\n  3.5.  Statistics Focused  . . . . . . . . . . . . . . . . . . .  11\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .  12\n5.  Informative References  . . . . . . . . . . . . . . . . . . .  12\nAppendix A.  A Starting Point for Django Models Supporting the\n             Review Tool  . . . . . . . . . . . . . . . . . . . .  14\nAppendix B.  Suggested Features Deferred for Future Work  . . . .  15\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  16\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  16",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "As Internet-Drafts are processed, reviews are requested from several review teams. For example, the General Area Review Team (Gen-ART) and the Security Directorate (SecDir) perform reviews of documents that are in IETF Last Call. Gen-ART always performs a follow-up review when the document is scheduled for an IESG Telechat. SecDir usually performs a follow-up review, but the SecDir secretary may choose not to request that follow-up if any issues identified at Last Call are addressed and there are otherwise no major changes to the document. These teams also perform earlier reviews of documents on demand. There are several other teams that perform similar services, often focusing on specific areas of expertise.",
      "ja": "インターネットドラフトが処理されると、レビューはいくつかのレビューチームから要求されています。例えば、一般的なエリアレビューチーム（ジェン・ART）とセキュリティ総局（SecDir）は、IETFでラストコールされた文書のレビューを行います。 GEN-ARTは常にドキュメントがIESG Telechatに予定されているフォローアップの見直しを行います。 SecDirは通常、フォローアップの見直しを行いますが、SecDirの秘書はラストコールで特定されたすべての問題が解決されている場合には、フォローアップを要求しないことを選んでもよいし、文書に大きな変化はそうありません。これらのチームはまた、オンデマンドでの文書の以前のレビューを行います。多くの場合、特定の専門分野に焦点を当て、同様のサービスを行う他のいくつかのチームがあります。"
    },
    {
      "indent": 3,
      "text": "The secretaries of these teams manage a pool of volunteer reviewers. Documents are assigned to reviewers, taking various factors into account. For instance, a reviewer will not be assigned a document for which he is an author or shepherd. Reviewers are given a deadline, usually driven by the end of Last Call or an IESG Telechat date. The reviewer sends each completed review to the team's mailing list and to any other lists that are relevant for the document being reviewed. Often, a thread ensues on one or more of those lists to resolve any issues found in the review.",
      "ja": "これらのチームの秘書は、ボランティアの審査のプールを管理します。ドキュメントを考慮に様々な要因を取って、校閲に割り当てられています。たとえば、校閲者は、彼が著者や羊飼いされた文書を割り当てられません。レビュアーは、通常はラストコールまたはIESG Telechat日の終わりによって駆動期限を、与えられています。レビューアは、チームのメーリングリストに、レビューされた文書に関連する任意の他のリストに完了した各レビューを送信します。多くの場合、スレッドは、レビューで見つかったすべての問題を解決するために、これらのリストのうちの1つまたは複数に行われます。"
    },
    {
      "indent": 3,
      "text": "The secretaries and reviewers from several teams are using a tool developed and maintained by Tero Kivinen. Much of its design predates the modern Datatracker. The application currently keeps its own data store and learns about documents needing review by inspecting Datatracker and tools.ietf.org pages. Most of those pages are easy to parse, but the Last Call pages, in particular, require some effort. Tighter integration with the Datatracker would simplify the logic used to identify documents that are ready for review, make it simpler for the Datatracker to associate reviews with documents, and allow users to reuse their Datatracker credentials. It would also make it easier to detect other potential review-triggering events, such as a document entering Working Group (WG) Last Call or when an RFC's standard level is being changed without revising the RFC. Tero currently believes this integration is best achieved by a new implementation of the tool. This document captures requirements for that reimplementation, with a focus on the workflows that the new implementation must take care not to disrupt. It also discusses new features, including changes suggested for the existing tool at its issue tracker [art-trac].",
      "ja": "いくつかのチームからの秘書とレビューはTERO Kivinenによって開発され、維持ツールを使用しています。そのデザインの多くは、現代Datatrackerに先行します。アプリケーションは現在、独自のデータストアを保持し、Datatrackerとtools.ietf.orgページを検査することにより、審査を必要とする文書について学習します。これらのページの大部分は、解析するのは簡単ですが、ラストコールページは、具体的には、いくつかの努力が必要です。 Datatrackerとの緊密な統合は、レビューのために準備ができている文書を特定することは単純Datatrackerは文書とレビューを関連付けできるようにするため、ユーザーは自分のDatatrackerの資格情報を再利用できるようにするために使用されるロジックを簡素化します。また、それが簡単なワーキンググループ（WG）RFCの標準レベルは、RFCを改訂することなく変更されるラストコールまたは入力文書として他の潜在的な見直しトリガイベントを検出するためになるだろう。 TEROは現在、この統合は最適なツールの新しい実装によって達成されると考えています。この文書は、新しい実装が中断しないように注意しなければならないのワークフローに焦点を当てて、その再実装するための要件をキャプチャします。また、その課題追跡[アート-Tracの]で、既存のツールのために提案された変更などの新機能を、説明します。"
    },
    {
      "indent": 3,
      "text": "For more information about the various review teams, see the following references.",
      "ja": "様々なレビューチームの詳細については、以下を参照してください。"
    },
    {
      "indent": 10,
      "text": "+-------------------------------+---------------------+\n| General Area Review Team      | [Gen-ART] [RFC6385] |\n| Security Directorate          | [SecDir]            |\n| Applications Area Directorate | [AppsDir]           |\n| Operations Area Directorate   | [OPS-dir]           |\n| Routing Area Directorate      | [RTG-dir]           |\n| MIB Doctors                   | [MIBdoctors]        |\n| YANG Doctors                  | [YANGdoctors]       |\n+-------------------------------+---------------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "2. Overview of Current Workflows",
      "section_title": true,
      "ja": "現在のワークフローの概要2。"
    },
    {
      "indent": 3,
      "text": "This section gives a high-level overview of how the review team secretaries and reviewers use the existing tool. It is not intended to be comprehensive documentation of how review teams operate. Please see the references for those details.",
      "ja": "このセクションでは、レビューチーム幹事とレビューは、既存のツールを使用する方法の高レベルの概要を説明します。審査チームがどのように動作するかの包括的なドキュメントであることを意図したものではありません。これらの詳細については、参考文献を参照してください。"
    },
    {
      "indent": 3,
      "text": "For many teams, the team's secretary periodically (typically once a week) checks the tool for documents it has identified as ready for review. The tool compiles a list from Last Call announcements and IESG Telechat agendas. The secretary creates a set of assignments from this list and enters them into the reviewer pool, choosing the reviewers in roughly a round-robin order. That order can be perturbed by several factors. Reviewers have different levels of availability. Some are willing to review multiple documents a month. Others may only be willing to review a document every other month. The assignment process takes exceptional conditions such as reviewer vacations into account. Furthermore, secretaries are careful not to assign a document to a reviewer that is an author, shepherd, responsible WG chair, or has some other already existing association with the document. The preference is to get a reviewer with a fresh perspective. The secretary may discover reasons to change assignments while going through the list of documents. In order to not cause a reviewer to make a false start on a review, the secretaries complete the full list of assignments before sending notifications to anyone. This assignment process can take several minutes and it is possible for new Last Calls to be issued while the secretary is making assignments. The secretary typically checks to see if new documents are ready for review just before issuing the assignments and updates the assignments if necessary.",
      "ja": "多くのチーム、チームの秘書を定期的（通常は週一回）の場合、それは審査準備完了として特定された文書のためのツールをチェックします。このツールは、ラストコールの発表とIESG Telechatの議題からリストをコンパイルします。秘書はこのリストの割り当てのセットを作成して、おおよそのラウンドロビン順に審査を選択すると、レビューアのプールにそれらを入力します。そのためには、いくつかの要因によって摂動することができます。査読者は、可用性のレベルが異なります。いくつかは、月、複数のドキュメントを確認して喜んでいます。その他は隔月の文書をレビューすることをいとわないことがあります。割り当てプロセスは、アカウントに、このような校閲者の休暇のような例外条件をとります。また、秘書は、著者、羊飼い、責任WGの議長である、またはドキュメントと他のいくつかの既存の関連付けを持つ校閲に文書を割り当てることがないように注意します。好みは新鮮な視点でレビューを取得することです。秘書は、文書のリストを通過しながら、割り当てを変更する理由は発見があります。レビューに関する不正スタートをする校閲を起こさないためには、秘書は誰にも通知を送信する前に、割り当ての完全なリストを完了します。この割り当てプロセスは数分かかることがありますし、秘書が割り当てを行っている間に、新しい最終コールを発行することが可能です。秘書は通常、新しい文書がちょうど割り当てを発行する前にレビューのために準備ができているかどうかを確認し、必要に応じて割り当てを更新します。"
    },
    {
      "indent": 3,
      "text": "Some teams operate in more of a review-on-demand model. The Routing Area Directorate (RTG-dir), for example, primarily initiates reviews at the request of a Routing AD. They may also start an early review at the request of a WG chair. In either case, the reviewers are chosen manually from the pool of available reviewers driven by context rather than using a round-robin ordering.",
      "ja": "いくつかのチームは、レビュー・オン・デマンドモデルのよりで動作します。ルーティングエリア総局（RTG-DIR）は、例えば、主にルーティングADの要求に応じてレビューを開始します。彼らはまた、WGの議長の要請で早期審査を開始することができます。いずれの場合においても、レビューアはなく、ラウンドロビン順序を使用するよりも、コンテキストによって駆動される利用可能なレビュアーのプールから手動で選択されます。"
    },
    {
      "indent": 3,
      "text": "The issued assignments are either sent to the review team's email list or are emailed directly to the assigned reviewer. The assignments are reflected in the tool. For those teams handling different types of reviews (Last Call vs. Telechat, for example), the secretary typically processes the documents for each type of review separately, and potentially with different assignment criteria. In Gen-ART, for example, the Last Call reviewer for a document will almost always get the follow-up Telechat review assignment. Similarly, SecDir assigns any re-reviews of a document to the same reviewer. Other teams may choose to assign a different reviewer.",
      "ja": "発行した割り当ては、どちらかの審査チームの電子メールリストに送信されているか、割り当てられたレビューアに直接電子メールで送信されます。割り当ては、ツールに反映されています。 （例えばTelechat対ラストコール、）レビューの異なる種類を扱うこれらのチームのために、秘書は、通常、異なる割り当て基準を潜在的に個別に審査の種類ごとに書類を処理し、そして。ジェンARTでは、例えば、文書のラストコール投稿者は、ほとんどの場合、フォローアップTelechatレビューの割り当てを取得します。同様に、SecDirは同じ校閲への文書のいずれかの再レビューを割り当てます。他のチームは、さまざまな校閲を割り当てることを選択できます。"
    },
    {
      "indent": 3,
      "text": "Reviewers discover their assignments through email or by looking at their queue in the tool. The secretaries for some teams (such as the OPS-dir and RTG-dir) insulate their team members from using the tool directly. These reviewers only work through the review team's email list or through direct email. On teams that have the reviewers use the tool directly, most reviewers only check the tool when they see they have an assignment via the team's email list. A reviewer has the opportunity to reject the assignment for any reason. While the tool provides a way to reject assignments, reviewers typically use email to coordinate rejections with the team secretary. The secretary will find another volunteer for any rejected assignments. The reviewer can indicate that the assignment is accepted in the tool before starting the review, but this feature is rarely used.",
      "ja": "査読は、電子メールを介して、またはツールで自分のキューを見て、その割り当てを発見します。 （このようOPS-dirとRTG-dirのような）いくつかのチームの秘書が直接ツールを使用してから自分のチームのメンバーを絶縁します。これらのレビューは、レビューチームの電子メールリストを介して、または直接電子メールを介して動作します。査読を持っているチームが直接ツールを使用するには、彼らはチームの電子メールリストを経由して割り当てを持って見ると、多くのレビュアーは、ツールだけをチェック。レビューアは、何らかの理由で割り当てを拒否する機会を持っています。ツールが割り当てを拒否するための方法を提供していますが、審査は通常、チームの秘書と拒否を調整するために電子メールを使用しています。秘書は拒否された割り当ての別のボランティアがあります。レビューアは割り当てが審査を開始する前に、ツールに受け入れられているが、この機能はほとんど使用されていないことを示すことができます。"
    },
    {
      "indent": 3,
      "text": "The reviewer sends a completed review to the team's email list or secretary, as well as any other lists relevant to the review, and usually the draft's primary email alias. For instance, many Last Call reviews are also sent to the IETF general list. The teams typically have a template format for the review. Those templates usually start with a summary of the conclusion of the review.",
      "ja": "レビューアは、チームの電子メールリストや秘書のほか、審査に関連する任意の他のリスト、および通常のドラフトのプライマリ電子メールエイリアスに完了したレビューを送信します。例えば、多くのラストコールレビューは、IETF一般のリストに送信されます。チームは、通常、レビューのためのテンプレート・フォーマットを持っています。これらのテンプレートは、通常、審査の結論の要約で始まります。"
    },
    {
      "indent": 3,
      "text": "Typical summaries are \"ready for publication\" or \"on the right track but has open issues\". The reviewer (or in the case of teams that insulate their reviewers, the secretary) uses the tool to indicate that the review is complete, provides the summary, and has an opportunity to provide a link to the review in the archives. Note, however, that having to wait for the document to appear in the archive to know the link to paste into the tool is a significant enough impedance that this link is often not provided by the reviewer. The SecDir secretary manually collects these links from the team's email list and adds them to the tool.",
      "ja": "典型的な概要は「出版の準備」またはある「右のトラックではなく、未解決の問題があります」。レビューア（またはその査読を絶縁するチームの場合には、秘書）は、審査が完了したことを示すためにツールを使用して要約を提供し、アーカイブでのレビューへのリンクを提供する機会を持っています。ツールに貼り付けるためのリンクを知っているアーカイブに表示された文書のを待つことは、このリンクは、多くの場合、校閲者によって提供されていないことは重要十分なインピーダンスがあること、しかし、注意してください。 SecDir秘書は手動でチームの電子メールのリストからこれらのリンクを収集し、ツールに追加します。"
    },
    {
      "indent": 3,
      "text": "Occasionally, a document is revised between when a review assignment is made and when the reviewer starts the review. Different teams can have different policies about whether the reviewer should review the assigned version or the current version.",
      "ja": "時折、ドキュメントレビューの割り当てが行われたときや校閲者がレビューを開始するとの間で改訂されます。異なるチームは、レビューアが割り当てられたバージョンまたは現在のバージョンを確認する必要があるかどうかについての異なるポリシーを持つことができます。"
    },
    {
      "indent": 0,
      "text": "3. Requirements",
      "section_title": true,
      "ja": "3.要件"
    },
    {
      "indent": 0,
      "text": "3.1. Secretariat Focused",
      "section_title": true,
      "ja": "3.1. 事務局重視"
    },
    {
      "indent": 3,
      "text": "o The Secretariat must be able to configure secretaries and reviewers for review teams (by managing Role records).",
      "ja": "O事務局は（役割レコードを管理することにより）審査チームの秘書と査読を設定することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The Secretariat must be able to perform any secretary action on behalf of a review team secretary (and thus, must be able to perform any reviewer action on behalf of the reviewer).",
      "ja": "oを事務局が審査チームの秘書の代わりに任意の秘書のアクションを実行できなければなりません（したがって、審査の代わりに任意の校閲者のアクションを実行できなければなりません）。"
    },
    {
      "indent": 0,
      "text": "3.2. Review-Team Secretary Focused",
      "section_title": true,
      "ja": "3.2. レビュー・チーム長官は重視します"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to see what documents are ready for a review of a given type (such as a Last Call review).",
      "ja": "O秘書は、文書が（そのようなラストコールレビューなど）特定のタイプのレビューのための準備ができているかを見ることができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to assign reviews for documents that may not have been automatically identified as ready for a review of a given type. (In addition to being the primary assignment method for teams that only initiate reviews on demand, this allows the secretary to work around errors and handle special cases, including early review requests.)",
      "ja": "O秘書は自動的に指定された型の見直しのための準備として同定されていない可能性があり、文書のレビューを割り当てることができなければなりません。 （オンデマンドでのみレビューを開始するチームのための主要な割り当て方法であることに加えて、これは秘書が、エラーを回避し、早期審査の要求を含む特殊なケースを処理することができます。）"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to work on and issue a set of assignments as an atomic unit. No assignment should be issued until the secretary declares the set of assignments complete.",
      "ja": "O秘書は上で動作し、単位として割り当てのセットを発行することができなければなりません。秘書は、完全な割り当てのセットを宣言するまで、割り当てが発行されるべきではありません。"
    },
    {
      "indent": 3,
      "text": "o The tool must support teams that have multiple secretaries. The tool should warn secretaries that are simultaneously working on assignments and protect against conflicting assignments being made.",
      "ja": "Oツールは、複数の秘書を持っているチームをサポートしている必要があります。このツールは、同時に割り当てに取り組んでいる秘書に警告し、競合の割り当てが行われてから保護すべきです。"
    },
    {
      "indent": 3,
      "text": "o It must be easy for the secretary to discover that more documents have become ready for review while working on an assignment set.",
      "ja": "秘書が割り当てセットで作業しながら、より多くの文書が審査の準備となっていることを発見するためにOそれは簡単でなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The tool should make preparing the assignment email to the team's email list easy. For instance, the tool could prepare the message, give the secretary an opportunity to edit it, and handle sending it to the team's email list.",
      "ja": "Oツールは、簡単にチームの電子メールリストに割り当てた電子メールを準備すべきです。例えば、ツールは、メッセージを準備秘書にそれを編集する機会を与え、そしてチームの電子メールリストに送信扱うことができます。"
    },
    {
      "indent": 3,
      "text": "o It must be possible for a secretary to indicate that the review team will not provide a review for a document (or a given version of a document). This indication should be taken into account when presenting the documents that are ready for a review of a given type. This will also make it possible to show on a document's page that no review is expected from this team.",
      "ja": "秘書は、レビューチームは、文書のレビュー（またはドキュメントの特定のバージョン）を提供しないことを示すためにのためにOそれは可能でなければなりません。特定のタイプのレビューのために準備ができている書類を提示するときに、この表示は考慮すべきです。また、これは何のレビューはこのチームから期待されていないことを文書のページに表示することを可能にします。"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to easily see who the next available reviewers are, in order.",
      "ja": "O秘書が簡単ために、次の使用可能な査読が誰であるかを見ることができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to edit a reviewer's availability, both in terms of frequency, not-available-until-date, and skip-next-n-assignments. (See the description of these settings in Section 3.3.)",
      "ja": "O秘書が、両方の周波数の面で、校閲者の可用性を編集することができなければならない、-利用可能になるまで、最新ではない、とスキップ-次のn-割り当てを。 （セクション3.3でこれらの設定の説明を参照してください。）"
    },
    {
      "indent": 3,
      "text": "o The tool should make it easy for the secretary to see any team members that have requested to review a given document when it becomes available for review.",
      "ja": "秘書が、それは審査のために利用可能になったときに与えられた文書を確認するために要求したすべてのチームメンバーを参照するOツールは、簡単に行う必要があります。"
    },
    {
      "indent": 3,
      "text": "o The tool should make it easy for the secretary to identify that a reviewer is already involved with a document. The current tool allows the secretary to provide a regular expression to match against the document name. If the expression matches, the document is not available for assignment to this reviewer. For example, Tero will not be assigned documents matching '^draft-(kivinen|ietf-tcpinc)-.*$'. The tool should also take any roles, such as document shepherd, that the Datatracker knows about into consideration.",
      "ja": "Oツールは、それが簡単に秘書が校閲がすでに文書に関与していることを識別するために作る必要があります。現在のツールは、秘書が文書名にマッチする正規表現を提供することができます。式が一致した場合、文書はこのユーザーへの割り当てには使用できません。 '|  -  * $。^ draft-（IETF-tcpinc kivinen）' を例えば、TEROは、一致する文書を割り当てられません。このツールは、Datatrackerが考慮について知っていることは、そのような文書の羊飼いとしてどんな役割を取る必要があります。"
    },
    {
      "indent": 3,
      "text": "o The tool should make it easy for the secretary to see key features of a document ready for assignment, such as its length, its authors, the group and area it is associated with, its title and abstract, its states (such as IESG or WG states), and any other personnel (such as the shepherd and reviewers already assigned from other teams) involved in the draft.",
      "ja": "ツールは、秘書は、その長さなどの割り当てのための準備ができて、文書の主要な機能を、見ることのために、それは簡単にその著者、それが関連付けられているグループと地域、そのタイトルとアブストラクト、などIESGとしてその状態（またはすべきであるO WG状態）、およびドラフトに関わるなど、すでに他チームから割り当てられた羊飼いとレビューなど、他の担当者（）。"
    },
    {
      "indent": 3,
      "text": "o The tool must make it easy for the secretary to detect and process re-review requests on the same version of a document (such as when a document has an additional Last Call only to deal with new IPR information).",
      "ja": "Oツールは、それが簡単に秘書が検出すると、文書の同じバージョンのプロセス再審査リクエスト（ドキュメントが追加ラストコールを持っている場合などは、唯一の新しいIPRの情報を扱うこと）のために作る必要があります。"
    },
    {
      "indent": 3,
      "text": "o Common operations to groups of documents should be easy for the secretary to process as a group with a minimum amount of interaction with the tool. For instance, it should be possible to process all of the documents described by the immediately preceding bullet with one action. Similarly, for teams that assign re-reviews to the same reviewer, issuing all re-review requests should be a simple action.",
      "ja": "秘書は、ツールとの相互作用の最小量を持つグループとして処理するためのO文書のグループに共通の操作が簡単にする必要があります。例えば、1つのアクションと、直前の弾丸によって記述された文書のすべてを処理することが可能であるべきです。同様に、同じレビューアに再レビューを割り当てるチームのために、すべての再審査リクエストを発行することは、単純なアクションでなければなりません。"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to see which reviewers have outstanding assignments.",
      "ja": "O秘書は査読が未割り当てられているかを確認することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The tool must make it easy for the secretary to see the result of previous reviews from this team for a given document. In SecDir, for example, if the request is for a revision that has only minor differences and the previous review result was \"Ready\", a new assignment will not be made. If the given document replaces one or more other prior documents, the tool must make it easy for the secretary to see the results of previous reviews of the replaced documents.",
      "ja": "Oツールは、それが簡単に秘書が与えられた文書のために、このチームから、前のレビューの結果を参照できるようにするため必要があります。 SecDirでは、例えば、要求は、わずかな違いがあり、前回の審査結果は、新たな割り当てが行われることはありません、「レディ」だったリビジョンのであれば。与えられた文書は、1つまたは複数の他の従来の文書を置き換える場合は、ツールを交換文書の以前のレビューの結果を参照するには秘書のために、それは簡単にする必要があります。"
    },
    {
      "indent": 3,
      "text": "o The tool must make it easy for the secretary to see the result of previous reviews from this team for all documents across configurable, recent periods of time (such as the last 12 months). A secretary of the RTG-dir, for example, would use this result to aid in the manual selection of the next reviewer.",
      "ja": "Oツールは、（過去12ヶ月のように）それは簡単秘書は、時間の設定可能な、最近の期間にわたるすべての文書については、このチームから、前のレビューの結果を参照できるようにするため必要があります。 RTG-DIRの秘書は、例えば、次審査の手動選択を支援するために、この結果を使用します。"
    },
    {
      "indent": 3,
      "text": "o The tools must make it easy for the secretary to see the recent performance of a reviewer while making an assignment (see Section 3.5). This allows the secretary to detect overburdened or unresponsive volunteers earlier in the process.",
      "ja": "割り当てをしながら秘書が審査の最近のパフォーマンスを見るためにするためのツールは、それが簡単にする必要がありO（3.5節を参照してください）。これは、秘書がプロセスの早い段階での過負荷または無応答のボランティアを検出することができます。"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to configure the tool to remind them to follow up when actions are due. (For instance, a secretary could receive email when a review is about to become overdue.)",
      "ja": "O秘書はアクションが原因であるとき、フォローアップするためにそれらを思い出させるためにツールを設定することができなければなりません。 （審査が遅れるなろうとしているとき例えば、秘書が電子メールを受け取ることができます。）"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to assign multiple reviewers to a given draft at any time. In particular, a secretary must be able to assign an additional reviewer when an original reviewer indicates their review is likely to be only partially complete.",
      "ja": "O秘書はいつでも与えられた草案に複数のレビューを割り当てることができなければなりません。具体的には、秘書は元レビュアーが彼らのレビューが部分的にしか完全である可能性が高いとされるとき、追加の校閲者を割り当てることができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to withdraw a review assignment.",
      "ja": "O秘書はレビューの割り当てを撤回することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to perform any reviewer action on behalf of the reviewer.",
      "ja": "O秘書は審査の代わりに任意の校閲者のアクションを実行できなければなりません。"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to configure the review team's set of reviewers (by managing Role records for the team).",
      "ja": "O秘書が（チームの役割レコードを管理することにより）審査の審査チームのセットを設定することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Information about a reviewer must not be lost when a reviewer is removed from a team. (Frequently, reviewers come back to teams later.)",
      "ja": "レビュアーがチームから削除されたときにO審査に関する情報は失われてはなりません。 （よく、レビューアは、後のチームに戻ってきます。）"
    },
    {
      "indent": 3,
      "text": "o A secretary must be able to delegate secretary capabilities in the tool (similar to how a working group chair can assign a Delegate). This allows review teams to self-manage secretary vacations.",
      "ja": "O秘書は（ワーキンググループの議長が委任を割り当てることができる方法に類似）ツールでの秘書機能を委任することができなければなりません。これは、自己管理秘書の休暇に検討チームを可能にします。"
    },
    {
      "indent": 0,
      "text": "3.3. Reviewer Focused",
      "section_title": true,
      "ja": "3.3. レビュアー重視"
    },
    {
      "indent": 3,
      "text": "o A reviewer must be able to indicate availability, both in frequency of reviews and as \"not available until this date\". The current tool speaks of frequency in these terms:",
      "ja": "Oレビューアは、両方のレビューの周波数にし、「この日まで利用できません」と、可用性を示すことができなければなりません。現在のツールは、これらの用語には、周波数のことを話します。"
    },
    {
      "indent": 6,
      "text": "- Assign at maximum one new review per week",
      "ja": " - 週に最大1つの新しいレビューで割り当て"
    },
    {
      "indent": 6,
      "text": "- Assign at maximum one new review per fortnight",
      "ja": " - 二週間ごとに最大1つの新しいレビューで割り当て"
    },
    {
      "indent": 6,
      "text": "- Assign at maximum one new review per month",
      "ja": " - 月あたり最大1つの新しいレビューで割り当て"
    },
    {
      "indent": 6,
      "text": "- Assign at maximum one new review per two months",
      "ja": " -  2ヶ月ごとに最大1つの新しいレビューで割り当て"
    },
    {
      "indent": 6,
      "text": "- Assign at maximum one new review per quarter",
      "ja": " - 四半期ごとに最大1つの新しいレビューで割り当て"
    },
    {
      "indent": 3,
      "text": "o Reviewers must be able to indicate hiatus periods. Each period may be either \"soft\" or \"hard\".",
      "ja": "Oレビューは活動休止期間を示すことができなければなりません。各期間は、「ソフト」または「ハード」のいずれであってもよいです。"
    },
    {
      "indent": 6,
      "text": "- A hiatus must have a start date. It may have an end date or it may be indefinite.",
      "ja": " - 活動休止は、開始日を持っている必要があります。これは、終了日を有するか、またはそれは不定かもしれません。"
    },
    {
      "indent": 6,
      "text": "- During a hiatus, the reviewer will not be included in the normal review rotation. When a provided end date is reached, the reviewer will automatically be included in the rotation in their usual order.",
      "ja": " - 活動休止中は、レビューアは通常のレビューのローテーションには含まれません。提供終了日に達すると、レビューアは自動的に通常の順番でローテーションに含まれます。"
    },
    {
      "indent": 6,
      "text": "- During a \"soft\" hiatus, the reviewer must not be assigned new reviews but is expected to complete existing assignments and do follow-up reviews.",
      "ja": " - 「ソフト」活動休止中は、レビューアは新しいレビューを割り当ててはいけませんが、既存の割り当てを完了し、フォローアップレビューを行うことが期待されています。"
    },
    {
      "indent": 6,
      "text": "- During a \"hard\" hiatus, the reviewer must not be assigned any new reviews and the secretary must be prompted to reassign any outstanding or follow-up reviews.",
      "ja": " - 「ハード」活動休止中は、レビューアは新しいレビューを割り当ててはいけないと秘書は、未処理またはフォローアップレビューを再割り当てするように指示されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Reviewers must be able to indicate that they should be skipped the next \"n\" times they would normally have received an assignment.",
      "ja": "Oレビューは、彼らが正常に割り当てを受けたであろう次の「n」回をスキップする必要があることを示すことができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Reviewers must be able to indicate that they are transitioning to inactive and provide a date for the end of the transition period. During this transition time, the reviewer must not be assigned new reviews but is expected to complete outstanding assignments and follow-up reviews. At the end of the transition period, the secretary must be prompted to reassign any outstanding or follow-up reviews. (This allows review-team members that are taking on AD responsibility to transition gracefully to an inactive state for the team.)",
      "ja": "Oレビューは、彼らが非アクティブと移行期間の終了の日付を提供するために、移行していることを示すことができなければなりません。この移行期間中、レビューは新しいレビューを割り当ててはいけませんが、優れた割り当てとフォローアップレビューを完了することが期待されます。移行期間の終わりに、長官は、未処理またはフォローアップレビューを再割り当てするように指示されなければなりません。 （これは、ADの責任を取っているレビュー・チームのメンバーがチームのために非アクティブ状態に優雅に移行することができます。）"
    },
    {
      "indent": 3,
      "text": "o Both the reviewer and the secretary will be notified by email of any modifications to a reviewer's availability.",
      "ja": "O校閲と秘書の両方が校閲者の可用性への変更の電子メールで通知されます。"
    },
    {
      "indent": 3,
      "text": "o A reviewer must be able to easily discover new review assignments. (The tool might send email directly to an assigned reviewer in addition to sending the set of assignments to the team's email list. The tool might also use the Django Message framework to let a reviewer that's logged into the Datatracker know a new review assignment has been made.)",
      "ja": "Oレビューアは簡単に新しいレビューの割り当てを発見することができなければなりません。 （このツールは、チームの電子メールリストに割り当てのセットを送信することに加えて、割り当てられたレビューアに直接メールを送信することがあります。ツールはまた、Datatrackerにログインしていますレビューアは割り当てがされている新しいレビューを知っているようにDjangoのメッセージフレームワークを使用する場合があります製。）"
    },
    {
      "indent": 3,
      "text": "o Reviewers must be able to see their current set of outstanding assignments, completed assignments, and rejected assignments. The presentation of those sets should either be separate or, if combined, the sets should be visually distinct.",
      "ja": "Oレビュアーが未割り当ての彼らの現在のセットを見ることができなければなりません、割り当てを完了し、割り当てを拒否しました。それらのセットのプレゼンテーションは、別々又は合わせた場合、セットは視覚的に区別可能でなければならなければならないのいずれか。"
    },
    {
      "indent": 3,
      "text": "o A reviewer should be able to request to review a particular document. The draft may be in any state: available and unassigned; already assigned to another reviewer; or not yet available.",
      "ja": "O校閲は、特定の文書を見直すように要求することができるはずです。草案は、どのような状態であってもよい：利用可能と割り当てられていません。すでに別のレビューアに割り当てられています。かはまだ利用できません。"
    },
    {
      "indent": 3,
      "text": "o A reviewer must be able to reject a review assignment, optionally providing the secretary with an explanation for the rejection. The tool will notify the secretary of the rejection by email.",
      "ja": "Oレビューアは、必要に応じて拒否の説明と秘書を提供し、レビューの割り当てを拒否することができなければなりません。このツールは、電子メールでの拒絶の秘書を通知します。"
    },
    {
      "indent": 3,
      "text": "o A reviewer must be able to indicate that they have accepted and are working on an assignment.",
      "ja": "O校閲は、彼らが受け入れていると割り当てに取り組んでいることを示すことができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o A reviewer must be able to indicate that a review is only partially completed and ask the secretary to assign an additional reviewer. The tool will notify the secretary of this condition by email.",
      "ja": "Oレビュアーは、レビューが部分的にしか完了していることを示し、追加のレビューアを割り当てるために秘書を頼むことができなければなりません。このツールは、メールでこの状態の秘書を通知します。"
    },
    {
      "indent": 3,
      "text": "o It should be possible for a reviewer to reject or accept a review either by using the tool's web interface or by replying to the review assignment email.",
      "ja": "校閲ツールのWebインタフェースを使用するか、レビューの割り当てのメールに返信することにより、どちらかの審査を拒否するか、受け入れることのためにOそれは可能なはずです。"
    },
    {
      "indent": 3,
      "text": "o It must be easy for a reviewer to see when each assigned review is due.",
      "ja": "それぞれ割り当てられたレビューが原因であるとき校閲を見るのOそれは簡単でなければなりません。"
    },
    {
      "indent": 3,
      "text": "o A reviewer must be able to configure the tool to remind them when actions are due. (For instance, a reviewer could receive email when a review is about to become overdue).",
      "ja": "O校閲はアクションが原因であるときにそれらを思い出させるためにツールを設定することができなければなりません。 （審査が遅れるなろうとしているときたとえば、校閲者は、電子メールを受け取ることができます）。"
    },
    {
      "indent": 3,
      "text": "o A reviewer must be able to indicate that a review is complete, capturing where the review is in the archives and the high-level, review-result summary.",
      "ja": "Oレビュアーは、レビューがアーカイブやハイレベル、審査結果の要約である場合取り込み、審査が完了したことを示すことができなければなりません。"
    },
    {
      "indent": 3,
      "text": "o It must be possible for a reviewer to clearly indicate which version of a document was reviewed. Documents are sometimes revised between when a review was assigned and when it is due. The tool should note the current version of the document and highlight when the review is not for the current version.",
      "ja": "Oそれは明らかに見直された文書のバージョンを示すために、審査のために可能でなければなりません。文書は、時にはそれが原因であるとき、レビューが割り当てられたときの間で改訂されています。このツールは、ドキュメントの現在のバージョンに注意し、レビューが現バージョンのものであるとき、ハイライトすべきです。"
    },
    {
      "indent": 3,
      "text": "o It must be easy for a reviewer to submit a completed review.",
      "ja": "審査が完了したレビューを提出するためのOそれは簡単でなければなりません。"
    },
    {
      "indent": 6,
      "text": "- The current workflow, where the reviewer sends email to the team's email list (possibly copying other lists) and then indicates where to find that review, must continue to be supported. The tool should make it easier to capture the link to review in the team's email list archives (perhaps by suggesting links based on a search into the archives).",
      "ja": " - レビューアは（おそらく他のリストをコピーする）チームの電子メールリストに電子メールを送信し、どこそのレビューを見つけるために示して現在のワークフローは、引き続きサポートされている必要があります。このツールは、（おそらくアーカイブへの検索に基づいて、リンクを示唆して）、それが簡単にチームの電子メールリストのアーカイブで確認するためのリンクをキャプチャするために行う必要があります。"
    },
    {
      "indent": 6,
      "text": "- The tool should allow the reviewer to enter the review into the tool via a web form (either as directly provided text or through a file-upload mechanism). The tool will ensure the review is posted to the appropriate lists and will construct the links to those posts in the archives.",
      "ja": " - このツールは、レビューアは、Webフォーム（のいずれかのように直接テキストやファイル・アップロードのメカニズムを通じて提供）を介してツールにレビューを入力できるようにする必要があります。レビューを確保するためのツールは、適切なリストに掲載されており、アーカイブにそれらの記事へのリンクを構築します。"
    },
    {
      "indent": 6,
      "text": "- The tool could also allow the reviewer to submit the review to the tool by email (perhaps by replying to the assignment). The tool would then ensure the review is posted to the appropriate lists.",
      "ja": " - このツールは、レビュー担当者が（おそらく割り当てに返信することで）電子メールでツールにレビューを提出する可能性があります。その後、審査を確実にするツールは、適切なリストに掲載されています。"
    },
    {
      "indent": 0,
      "text": "3.4. Review Requester and Consumer Focused",
      "section_title": true,
      "ja": "3.4. レビュー依頼者と消費者を重視しました"
    },
    {
      "indent": 3,
      "text": "o It should be easy for an AD or group chair to request any type of review, but particularly an early review, from a review team.",
      "ja": "ADまたはグループ議長は、審査チームから、審査のいずれかのタイプが、特に早期の審査を要求するためにOそれは簡単なはずです。"
    },
    {
      "indent": 3,
      "text": "o It should be possible for that person to withdraw a review request.",
      "ja": "その人が審査要求を撤回するためにOそれは可能なはずです。"
    },
    {
      "indent": 3,
      "text": "o It must be easy to find all reviews of a document when looking at the document's main page in the Datatracker. The reference to the review must make it easy to see any responses to the review on the email lists it was sent to. If a document \"replaces\" one or more other documents, reviews of the replaced documents should be included in the results.",
      "ja": "O Datatrackerで、ドキュメントのメインページを見たとき、文書のレビューをすべて見つけることは容易でなければなりません。レビューを参照するには、それが簡単にそれが送られた電子メールのリストにレビューへの応答を確認するために行う必要があります。文書は、1つまたは複数の他の文書を「置き換え」場合は、交換した文書のレビューは、結果に含まれるべきです。"
    },
    {
      "indent": 3,
      "text": "o It must be easy to find all reviews of a document when looking at search result pages and other lists of documents, such as the documents on an IESG Telechat agenda.",
      "ja": "O検索結果ページや、IESG Telechatの議題上の文書などのドキュメントの他のリストを見ると、文書のレビューをすべて見つけることは容易でなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.5. Statistics Focused",
      "section_title": true,
      "ja": "3.5. 統計重視"
    },
    {
      "indent": 3,
      "text": "o It must be easy to see the following across all teams, a given team, or a given reviewer, and independently across all time or across configurable recent periods of time:",
      "ja": "Oすべてのチーム、特定のチーム、または特定の校閲間、および独立して、すべての時間を越えたり、時間の設定可能な最近の期間を越え以下を参照してくださいするのは簡単でなければなりません。"
    },
    {
      "indent": 6,
      "text": "- how many reviews have been completed",
      "ja": " - 完了しているどのように多くのレビュー"
    },
    {
      "indent": 6,
      "text": "- how many reviews are in progress",
      "ja": " - 進行中であるどのように多くのレビュー"
    },
    {
      "indent": 6,
      "text": "- how many in progress reviews are late",
      "ja": " - どのように多くの進捗レビューで遅れています"
    },
    {
      "indent": 6,
      "text": "- how many completed reviews were late",
      "ja": " - どのように多くの完成レビューは遅れました"
    },
    {
      "indent": 6,
      "text": "- how many reviews were not completed at all",
      "ja": " - すべてで完了しなかったどのように多くのレビュー"
    },
    {
      "indent": 6,
      "text": "- average time to complete reviews (from assignment to completion)",
      "ja": " - （割り当てから完了まで）レビューを完了するための平均時間"
    },
    {
      "indent": 3,
      "text": "o It must be easy to see the following for all teams, for a given team, or for a given reviewer, across all time or across configurable recent periods:",
      "ja": "Oすべての時間を越えたり、設定、最近の期間を越えて、与えられたチームのために、または特定の審査のために、すべてのチームのために、以下を参照してくださいするのは簡単でなければなりません。"
    },
    {
      "indent": 6,
      "text": "- total counts of reviews in each review state (done, rejected, etc.)",
      "ja": " - 各レビューの状態でのレビューの合計数は（など、拒否され、行われ）"
    },
    {
      "indent": 6,
      "text": "- total counts of completed reviews by result (ready, ready with nits, etc.)",
      "ja": " - 結果によって完成レビューの合計数（など、準備ニットと準備ができて）"
    },
    {
      "indent": 3,
      "text": "o The above statistics should also be calculated reflecting the size of the documents being reviewed (such as using the number of pages or words in the documents).",
      "ja": "上記統計はまた、ドキュメントの大きさを反映計算されるべきであるO（例えばページまたはドキュメント内の単語の数を使用するなど）見直さ。"
    },
    {
      "indent": 3,
      "text": "o Where applicable, statistics should take reviewer hiatus periods into account.",
      "ja": "O該当する場合には、統計を考慮に審査活動休止期間を取る必要があります。"
    },
    {
      "indent": 3,
      "text": "o Access to the above statistics must be easy to configure. Access will be initially limited as follows:",
      "ja": "O上記の統計情報にアクセスするには、設定が容易でなければなりません。次のようにアクセスが最初に制限されます。"
    },
    {
      "indent": 6,
      "text": "- The Secretariat and ADs can see any statistic.",
      "ja": " - 事務局と広告がどの統計を見ることができます。"
    },
    {
      "indent": 6,
      "text": "- A team secretary can see any statistics for that team.",
      "ja": " - チームの秘書がそのチームのために任意の統計を見ることができます。"
    },
    {
      "indent": 6,
      "text": "- A reviewer can see any team aggregate statistics or their own reviewer-specific statistics.",
      "ja": " - レビューアは、どのチームの集約統計や、独自の審査固有の統計情報を見ることができます。"
    },
    {
      "indent": 3,
      "text": "o Where possible, the above statistics should be visible as a time-series graph.",
      "ja": "可能であればO、上記統計は、時系列グラフとして表示されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The implementation should anticipate future enhancements that would allow ADs to indicate their position was informed by a given review. Such enhancements would allow reporting correlations between reviews and documents that receive one or more \"discusses\". However, implementing these enhancements is not part of the current project.",
      "ja": "O実装は、広告が自分の位置を示すためにできるようになり、将来の機能拡張与え見直しにより通知されたを予想すべきです。このような機能強化は、1つ以上の「議論し」を受信口コミや文書間の報告の相関関係を可能にします。しかし、これらの拡張機能を実装することは、現在のプロジェクトの一部ではありません。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document discusses requirements for tools that assist review teams. These requirements do not affect the security of the Internet in any significant fashion. The tools themselves have authentication and authorization considerations (team secretaries will be able to do different things than reviewers).",
      "ja": "この文書は、レビューチームを支援するツールの要件について説明します。これらの要件は、有意な形でインターネットのセキュリティに影響を与えません。ツール自体は認証と認可の考慮事項があります（チームの秘書が審査とは異なることを行うことができるようになります）。"
    },
    {
      "indent": 0,
      "text": "5. Informative References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 3,
      "text": "[AppsDir] IETF, \"Applications Area Directorate Review Process\", <http://trac.tools.ietf.org/area/app/trac/wiki/ AppsDirReview>.",
      "ja": "[AppsDir] IETF、 \"アプリケーションエリア総局レビュープロセス\"、<http://trac.tools.ietf.org/area/app/trac/wiki/ AppsDirReview>。"
    },
    {
      "indent": 3,
      "text": "[art-trac] IETF, \"Area Review Team Tool: {1} Active Tickets\", <https://wiki.tools.ietf.org/tools/art/trac/report/1>.",
      "ja": "[芸術-Tracの] IETF、 \"エリアレビューチームツール：{1}未解決チケット\"、<https://wiki.tools.ietf.org/tools/art/trac/report/1>。"
    },
    {
      "indent": 3,
      "text": "[Gen-ART] IETF, \"General Area: General Area Review Team (GEN-ART) Guidelines\", <http://trac.tools.ietf.org/area/gen/trac/wiki>.",
      "ja": "[ゲン-ART] IETF、 \"一般エリア：一般エリアレビューチーム（GEN-ART）のガイドライン\"、<http://trac.tools.ietf.org/area/gen/trac/wiki>。"
    },
    {
      "indent": 3,
      "text": "[MIBdoctors] IETF, \"MIB Doctors\", <http://www.ietf.org/iesg/directorate/mib-doctors.html>.",
      "ja": "[MIBdoctors] IETF、 \"MIB医師\"、<http://www.ietf.org/iesg/directorate/mib-doctors.html>。"
    },
    {
      "indent": 3,
      "text": "[OPS-dir] IETF, \"OPS Directorate (OPS-DIR)\", <https://svn.tools.ietf.org/area/ops/trac/wiki/ Directorates>.",
      "ja": "[OPS-DIR] IETF、 \"OPS総局（OPS-GET）\" <https://svn.tools.ietf.org/area/ops/trac/wiki/総局>。"
    },
    {
      "indent": 3,
      "text": "[RFC6385] Barnes, M., Doria, A., Alvestrand, H., and B. Carpenter, \"General Area Review Team (Gen-ART) Experiences\", RFC 6385, DOI 10.17487/RFC6385, October 2011, <http://www.rfc-editor.org/info/rfc6385>.",
      "ja": "[RFC6385]バーンズ、M.、ドリア、A.、Alvestrand、H.、およびB.大工、 \"一般的なエリアレビューチーム（ジェン・ART）経験\"、RFC 6385、DOI 10.17487 / RFC6385、2011年10月、<のhttp： //www.rfc-editor.org/info/rfc6385>。"
    },
    {
      "indent": 3,
      "text": "[RTG-dir] IETF, \"Routing Area Directorate Wiki Page\", <http://trac.tools.ietf.org/area/rtg/trac/wiki/RtgDir>.",
      "ja": "[RTG-DIR] IETF、 \"ルーティングエリア総局のWikiページ\"、<http://trac.tools.ietf.org/area/rtg/trac/wiki/RtgDir>。"
    },
    {
      "indent": 3,
      "text": "[SecDir] IETF, \"Security Directorate\", <http://trac.tools.ietf.org/area/sec/trac/wiki/ SecurityDirectorate>.",
      "ja": "[SecDir] IETF、 \"セキュリティ総局\"、<http://trac.tools.ietf.org/area/sec/trac/wiki/ SecurityDirectorate>。"
    },
    {
      "indent": 3,
      "text": "[YANGdoctors] IETF, \"YANG Doctors\", <http://www.ietf.org/iesg/directorate/yang-doctors.html>.",
      "ja": "【YANGdoctors] IETF、 \"医師\"、<http://www.ietf.org/iesg/directorate/yang-doctors.html>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. A Starting Point for Django Models Supporting the Review Tool",
      "ja": "付録A. Aレビュー支援ツールDjangoのモデルのための出発点"
    },
    {
      "indent": 1,
      "text": "from django.db import models from ietf.doc.models import Document from ietf.person.models import Email from ietf.group.models import Group, Role",
      "ja": "ietf.person.modelsからietf.doc.modelsインポートドキュメントからdjango.dbインポートモデルからグループをインポートietf.group.modelsからメールをインポートし、役割"
    },
    {
      "indent": 1,
      "text": "from ietf.name.models import NameModel",
      "ja": "ietf.name.models輸入NameModelから"
    },
    {
      "indent": 1,
      "text": "class ReviewRequestStateName(NameModel): \"\"\" Requested, Accepted, Rejected, Withdrawn, Overtaken By Events, No Response , Completed \"\"\"",
      "ja": "クラスReviewRequestStateName（NameModel）：「」「受け入れられたが、拒否取り下げ、イベント追い抜か、応答なしを要求しない、完成しました 『』」"
    },
    {
      "indent": 1,
      "text": "class ReviewTypeName(NameModel): \"\"\" Early Review, Last Call, Telechat \"\"\"",
      "ja": "クラスReviewTypeName（NameModel）： \"\" \"初期のレビュー、ラストコール、Telechat \"\"\""
    },
    {
      "indent": 1,
      "text": "class ReviewResultName(NameModel): \"\"\"Almost ready, Has issues, Has nits, Not Ready, On the right track, Ready, Ready with issues, Ready with nits, Serious Issues\"\"\"",
      "ja": "クラスReviewResultName（NameModel）： \"\" \"ほとんど準備ができて、問題が、問題に準備ができて、準備ができて、右のトラックにニット、Not Ready（準備中）を有し、ニットと準備、深刻な問題\" \"\""
    },
    {
      "indent": 1,
      "text": "class Reviewer(models.Model): \"\"\" These records associate reviewers with review teams and keep track of admin data associated with the reviewer in the particular team. There will be one record for each combination of reviewer and team. \"\"\" role = models.ForeignKey(Role) frequency = models.IntegerField(help_text= \"Can review every N days\") available = models.DateTimeField(blank=True,null=True, help_text= \"When will this reviewer be available again\") filter_re = models.CharField(blank=True) skip_next = models.IntegerField(help_text= \"Skip the next N review assignments\")",
      "ja": "クラスレビュー（models.Model）：「」「これらのレコードを関連付けるレビューチームで審査し、特定のチームでの校閲者に関連付けられた管理データを追跡審査し、チームの各組み合わせごとに1つのレコードがあります。。 『』」役割= models.ForeignKey（役割）周波数= models.IntegerField（help_textに= \"すべてのNの日を確認することができます\"）利用可能= models.DateTimeField（空白= Trueの場合、ヌル=真、help_textに= \"このレビューが再び利用できるようになります\"）filter_re = models.CharField（空白=真）skip_next = models.IntegerField（help_textに= \"次のNのレビューの割り当てをスキップ\"）"
    },
    {
      "indent": 1,
      "text": "class ReviewResultSet(models.Model): \"\"\" This table provides a way to point out a set of ReviewResultName entries that are valid for a given team in order to be able to limit the result choices that can be set for a given review as a function of which team it is related to. \"\"\" team = models.ForeignKey(Group) valid = models.ManyToManyField(ReviewResultName)",
      "ja": "クラスReviewResultSet（models.Model）：「」」この表のように与えられたレビューのために設定することができ、結果の選択肢を制限することができるようにするために与えられたチームのために有効なReviewResultNameエントリのセットを指摘する方法を提供しますそれが関係しているチームの機能。「」」チーム= models.ForeignKey（グループ）有効= models.ManyToManyField（ReviewResultName）"
    },
    {
      "indent": 1,
      "text": "class ReviewRequest(models.Model): \"\"\" There should be one ReviewRequest entered for each combination of document, rev, and reviewer. \"\"\" # Fields filled in on the initial record creation: time = models.DateTimeField(auto_now_add=True) type = models.ReviewTypeName() doc = models.ForeignKey(Document, related_name='review_request_set') team = models.ForeignKey(Group) deadline = models.DateTimeField() requested_rev = models.CharField(verbose_name=\"requested_revision\", max_length=16, blank=True) state = models.ForeignKey(ReviewRequestStateName) # Fields filled in as reviewer is assigned, and as the review # is uploaded reviewer = models.ForeignKey(Reviewer, null=True, blank=True) review = models.OneToOneField(Document, null=True, blank=True) reviewed_rev = models.CharField(verbose_name=\"reviewed_revision\", max_length=16, blank=True) result = models.ForeignKey(ReviewResultName)",
      "ja": "クラスReviewRequest（models.Model）：「」「『＃フィールド初期レコードの作成に記入』 ReviewRequestは、文書、REV、およびレビューアの組み合わせごとに入力したものがあるはずです。」：時間= models.DateTimeField（auto_now_add =真）= models.ReviewTypeName（）のdoc = models.ForeignKey（ドキュメント、related_name = 'review_request_set'）チーム= models.ForeignKey（グループ）の期限を入力= models.DateTimeField（）requested_rev = models.CharField（verbose_name = \"requested_revision\"、MAX_LENGTH = 16、空白= TRUE）状態= models.ForeignKey（ReviewRequestStateName）＃フィールドレビューアが割り当てられるように充填し、レビュー＃は校閲= models.ForeignKey（レビューは、null = Trueの場合、空白=真）レビュー=モデルにアップロードされると.OneToOneField（文書、真=ヌル、ブランク= TRUE）reviewed_rev = models.CharField（verbose_name = \"reviewed_revision\"、MAX_LENGTH = 16、ブランク= TRUE）結果= models.ForeignKey（ReviewResultName）"
    },
    {
      "indent": 0,
      "text": "Appendix B. Suggested Features Deferred for Future Work",
      "ja": "付録B.は、今後の作業のための繰延機能を推奨しました"
    },
    {
      "indent": 3,
      "text": "Brian Carpenter suggested a set of author/editor-focused requirements that were deferred for another iteration of improvement. These include providing a way for the editors to acknowledge receipt of the review, potentially tracking the email conversation between the reviewer and document editor, and indicating which review topics the editor believes a new revision addresses.",
      "ja": "ブライアン・カーペンターは、改善の別の反復のために延期された著者/編集者に焦点を当てた一連の要件を示唆しました。これらは、編集者がレビューの受信を確認するための方法を提供し、潜在的に審査し、文書エディタ間のメールの会話を追跡し、エディタが新しいリビジョンアドレスを考えていたレビューのトピックを示しています。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Tero Kivinen and Henrik Levkowetz were instrumental in forming this set of requirements and in developing the initial Django models in the appendix.",
      "ja": "TERO KivinenとヘンリクLevkowetzは、要件のこのセットを形成する上でと付録の最初のDjangoのモデルの開発に尽力しました。"
    },
    {
      "indent": 3,
      "text": "The following people provided reviews of this document: David Black, Deborah Brungard, Brian Carpenter, Elwyn Davies, Stephen Farrell, Joel Halpern, Jonathan Hardwick, Russ Housley, Barry Leiba, Jean Mahoney, Randy Presuhn, Gunter Van De Velde, and Martin Vigoureux.",
      "ja": "デビッド・ブラック、デボラBrungard、ブライアン・カーペンター、エルウィン・デイヴィス、スティーブン・ファレル、ジョエル・ハルパーン、ジョナサン・ハードウィック、ラスHousley、バリー・レイバ、ジャン・マホーニー、ランディPresuhn、ギュンター・ヴァン・デ・ヴェルデ、とマーティンVigoureux：次の人は、この文書のレビューを提供しました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Robert Sparks Oracle 7460 Warren Parkway Suite 300 Frisco, Texas 75034 United States",
      "ja": "ロバート・スパークスのOracle 7460ウォーレン・パークウェイスイート300フリスコ、テキサス75034米国"
    },
    {
      "indent": 3,
      "text": "Email: rjsparks@nostrum.com",
      "ja": "メール：rjsparks@nostrum.com"
    },
    {
      "indent": 3,
      "text": "Tero Kivinen INSIDE Secure Eerikinkatu 28 Helsinki FI-00180 Finland",
      "ja": "TERO Kivinen INSIDEはEerikinkatu 28 FI-00180ヘルシンキフィンランドセキュア"
    },
    {
      "indent": 3,
      "text": "Email: kivinen@iki.fi",
      "ja": "メール：kivinen@iki.fi"
    }
  ]
}