{
  "title": {
    "text": "RFC 7090 - Public Safety Answering Point (PSAP) Callback",
    "ja": "RFC 7090 - 公安は、ポイント（PSAP）コールバックに答えます"
  },
  "number": 7090,
  "created_at": "2019-10-28 13:28:17.503257+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                    H. Schulzrinne\nRequest for Comments: 7090                           Columbia University\nCategory: Standards Track                                  H. Tschofenig\nISSN: 2070-1721\n                                                             C. Holmberg\n                                                                Ericsson\n                                                                M. Patel\n                                      Huawei Technologies (UK) Co., Ltd.\n                                                              April 2014",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Public Safety Answering Point (PSAP) Callback",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "After an emergency call is completed (terminated either prematurely by the emergency caller or normally by the call taker), the call taker may feel the need for further communication. For example, the call may have been dropped by accident without the call taker having sufficient information about the current state of an accident victim. A call taker may trigger a callback to the emergency caller using the contact information provided with the initial emergency call. This callback could, under certain circumstances, be treated like any other call and, as a consequence, it may get blocked by authorization policies or may get forwarded to an answering machine.",
      "ja": "緊急コールが完了した後（途中で緊急呼び出し側によって、あるいは通常の呼び出し受け手のいずれかによって終了）、呼び出し受け手は、通信の必要性を感じることがあります。たとえば、コールは事故の犠牲者の現在の状態に関する十分な情報を持つコール係せず、事故によって削除された可能性があります。呼び出し受け手は、初期の緊急呼び出しで設けられたコンタクト情報を利用した緊急呼び出し側にコールバックをトリガすることができます。このコールバックは、特定の状況下で、結果として、それが認可ポリシーによってブロックされるかもしれませんか、留守番電話に転送されるかもしれません、他の呼び出しのように扱われ、することができます。"
    },
    {
      "indent": 3,
      "text": "The IETF emergency services architecture specification already offers a solution approach for allowing Public Safety Answering Point (PSAP) callbacks to bypass authorization policies in order to reach the caller without unnecessary delays. Unfortunately, the specified mechanism only supports limited scenarios. This document discusses shortcomings of the current mechanisms and illustrates additional scenarios where better-than-normal call treatment behavior would be desirable. We describe a solution based on a new header field value for the SIP Priority header field, called \"psap-callback\", to mark PSAP callbacks.",
      "ja": "IETF緊急サービスのアーキテクチャ仕様は、すでに不必要な遅延なしに、発信者に到達するために認可ポリシーをバイパスするポイント（PSAP）コールバックに答える公共安全を可能にするためのソリューションのアプローチを提供しています。残念ながら、指定されたメカニズムは、限られたシナリオをサポートしています。この文書は、現在の機構の欠点を説明し、より良いより、通常の呼処理挙動が望ましいであろう追加のシナリオを示します。私たちは、PSAPコールバックをマークするために、「PSAP-コールバック」と呼ばれるSIPの優先度ヘッダフィールドの新しいヘッダフィールドの値に基づいて、解決策を説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7090.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7090で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Terminology .....................................................5\n3. Callback Scenarios ..............................................5\n   3.1. Routing Asymmetry ..........................................5\n   3.2. Multi-Stage Routing ........................................7\n   3.3. Call Forwarding ............................................8\n   3.4. Network-Based Service URN Resolution ......................10\n   3.5. PSTN Interworking .........................................11\n4. SIP PSAP Callback Indicator ....................................12\n   4.1. General ...................................................12\n   4.2. Usage .....................................................12\n   4.3. Syntax ....................................................12\n        4.3.1. General ............................................12\n        4.3.2. ABNF ...............................................12\n5. Security Considerations ........................................12\n   5.1. Security Threat ...........................................12\n   5.2. Security Requirements .....................................13\n   5.3. Security Solution .........................................13\n6. IANA Considerations ............................................15\n7. Acknowledgements ...............................................16\n8. References .....................................................16\n   8.1. Normative References ......................................16\n   8.2. Informative References ....................................17",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Summoning police, the fire department, or an ambulance in emergencies is one of the fundamental and most valuable functions of the telephone. As telephone functionality moves from circuit-switched telephony to Internet telephony, its users rightfully expect that this core functionality will continue to work at least as well as it has for the legacy technology. New devices and services are being made available that could be used to make a request for help and that are not traditional telephones. Users are increasingly expecting them to be used to place emergency calls.",
      "ja": "緊急時に警察、消防署、または救急車を召喚することは、電話の基本的かつ最も貴重な機能の一つです。インターネット電話への回線交換電話からの電話機能が移動すると、そのユーザーは当然、このコア機能は、それが従来の技術のために持っているように、少なくとも同様に動作し続けることを期待しています。新しいデバイスやサービスを助けて、その伝統的な電話ではないため、要求を行うために使用することができることを利用できるようにされています。ユーザーはますます彼らが緊急コールを発信するために使用されることを期待しています。"
    },
    {
      "indent": 3,
      "text": "An overview of the protocol interactions for emergency calling using the IETF emergency services architecture is described in [RFC6443], and [RFC6881] specifies the technical details. As part of the emergency call setup procedure, two important identifiers are conveyed to the PSAP call taker's user agent, namely the address-of-record (AOR), and if available, the Globally Routable User Agent (UA) URIs (GRUUs). RFC 3261 [RFC3261] defines the AOR as:",
      "ja": "IETF緊急サービスのアーキテクチャを使用して、緊急呼び出しのためのプロトコルの相互作用の概要については、[RFC6443]で説明されており、[RFC6881]は技術的な詳細を指定します。緊急呼設定手順の一環として、2つの重要な識別子がPSAPコール受け手のユーザエージェント、すなわちアドレス・オブ・レコード（AOR）に伝達され、利用可能な場合、グローバルにルーティング可能なユーザエージェント（UA）のURI（GRUUs）。 RFC 3261 [RFC3261]はAORのように定義しています。"
    },
    {
      "indent": 6,
      "text": "An address-of-record (AOR) is a SIP or SIPS URI that points to a domain with a location service that can map the URI to another URI where the user might be available. Typically, the location service is populated through registrations. An AOR is frequently thought of as the \"public address\" of the user.",
      "ja": "アドレス・オブ・レコード（AOR）はSIPであるか、またはユーザが利用できるかもしれない別のURIにURIをマップすることができ、ロケーションサービスを使用してドメインをポイントするURIをSIPS。典型的には、ロケーションサービスは、登録を介して取り込まれます。 AORはしばしばユーザーの「パブリックアドレス」との考えられています。"
    },
    {
      "indent": 3,
      "text": "In SIP systems, a single user can have a number of user agents (handsets, softphones, voicemail accounts, etc.) that are all referenced by the same AOR. There are a number of cases in which it is desirable to have an identifier that addresses a single user agent rather than the group of user agents indicated by an AOR. The GRUU is such a unique user-agent identifier, and it is also globally routable. [RFC5627] specifies how to obtain and use GRUUs. [RFC6881] also makes use of the GRUU for emergency calls.",
      "ja": "SIPシステムでは、1人のユーザがすべて同じAORによって参照されるユーザエージェント（携帯電話、ソフトフォン、ボイスメール・アカウントなど）の数を有することができます。単一のユーザエージェントではなく、AORが示すユーザエージェントのグループに対処する識別子を有することが望まれる場合の数があります。 GRUUは、このようなユニークなユーザーエージェント識別子であり、そしてそれはまた、グローバルにルーティング可能です。 [RFC5627]はGRUUsを取得し、使用する方法を指定します。 [RFC6881]は、緊急コールのGRUUを使用しています。"
    },
    {
      "indent": 3,
      "text": "Regulatory requirements demand that the emergency call setup procedure itself provides enough information to allow the call taker to initiate a callback to the emergency caller. This is desirable in those cases where the call is dropped prematurely or when further communication needs arise. The AOR and the GRUU serve this purpose.",
      "ja": "規制要件は、緊急呼設定手順自体はコールテイカーが緊急呼び出し側にコールバックを開始できるようにするために十分な情報を提供することを要求します。これは、呼び出しが途中で廃棄されるか、またはさらなる通信の必要が生じたとき、これらの場合に望ましいです。 AORとGRUUは、この目的を果たします。"
    },
    {
      "indent": 3,
      "text": "The communication attempt by the PSAP call taker back to the emergency caller is called a \"PSAP callback\".",
      "ja": "バック緊急呼び出し元にPSAPコール係による通信の試みは、「PSAPコールバック」と呼ばれています。"
    },
    {
      "indent": 3,
      "text": "A PSAP callback may, however, be blocked by user-configured authorization policies or may be forwarded to an answering machine since SIP entities (SIP proxies as well as the SIP user equipment itself) cannot differentiate the PSAP callback from any other SIP call. \"Call barring\", \"do not disturb\", or \"call diversion\" (also called call forwarding) are features that prevent delivery of a call. It is important to note that these features may be implemented by SIP intermediaries as well as by the user agent.",
      "ja": "PSAPコールバックは、しかしながら、ユーザ設定認可ポリシーによってブロックされてもよいし、SIPエンティティ（SIPプロキシならびにSIPユーザ機器自体が）、他のSIP呼からPSAPコールバックを区別することができないので、留守番電話に転送することができます。 「発着信規制」、「邪魔しないで」、または「着信転送」は（もコール転送とも呼ばれる）コールの配信を防ぐ機能があります。これらの機能は、SIPの仲介によってだけでなく、ユーザエージェントによって実装されてもよいことに注意することが重要です。"
    },
    {
      "indent": 3,
      "text": "Among the emergency services community, there is a desire to treat PSAP callbacks in such a way that the chances of reaching the emergency caller are increased. At the same time, any solution must minimize the chance that other calls bypass call forwarding or other authorization policies. Ideally, the PSAP callback has to relate to an earlier emergency call that was made \"not too long ago\". An exact time interval is difficult to define in a global IETF standard due to the variety of national regulatory requirements, but [RFC6881] suggests 30 minutes.",
      "ja": "緊急サービスのコミュニティの中で、緊急の発信者に到達する機会が増加しているようにPSAPコールバックを治療することが望まれています。同時に、すべてのソリューションは、他の呼び出しは、コール転送または他の認可ポリシーをバイパスする可能性を最小限に抑える必要があります。理想的には、PSAPコールバックは、「あまりにも長い前に」作られた以前の緊急呼び出しに関連しています。正確な時間間隔が原因国家の規制要件の様々なグローバルIETF標準に定義することは難しいが、[RFC6881]は、30分を示唆しています。"
    },
    {
      "indent": 3,
      "text": "Nevertheless, to meet the needs from the emergency services community, a basic mechanism for preferential treatment of PSAP callbacks was defined in Section 13 of [RFC6443]. The specification says:",
      "ja": "それにもかかわらず、緊急サービスのコミュニティからのニーズを満たすために、PSAPコールバックの優遇措置のための基本的なメカニズムは、[RFC6443]のセクション13で定義されていました。仕様は言います："
    },
    {
      "indent": 6,
      "text": "A UA may be able to determine a PSAP callback by examining the domain of incoming calls after placing an emergency call and comparing that to the domain of the answering PSAP from the emergency call. Any call from the same domain and directed to the supplied Contact header or AOR after an emergency call should be accepted as a callback from the PSAP if it occurs within a reasonable time after an emergency call was placed.",
      "ja": "UAは、緊急電話をかけると、緊急コールからの応答PSAPのドメインにそれを比較した後、着信コールのドメインを調べることによって、PSAPコールバックを決定することができます。緊急コールが置かれた後、それが妥当な時間内に発生した場合、緊急コールの後に任意の同一ドメインから呼び出して供給ContactヘッダまたはAORに導かはPSAPからのコールバックとして受け入れられるべきです。"
    },
    {
      "indent": 3,
      "text": "This approach mimics a stateful packet-filtering firewall and is indeed helpful in a number of cases. It is also relatively simple to implement even though it requires call state to be maintained by the user agent as well as by SIP intermediaries. Unfortunately, the solution does not work in all deployment scenarios. In Section 3 we describe cases where the currently standardized approach is insufficient.",
      "ja": "このアプローチは、ステートフルパケットフィルタリングファイアウォールを模倣し、例数が確かに便利です。ユーザエージェントによってだけでなく、SIPの仲介によって維持されるように、コール状態を必要としていても実装することも比較的簡単です。残念ながら、解決策は、すべての展開シナリオでは動作しません。第3節では現在標準化されたアプローチが不足している例を説明します。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "Emergency-services-related terminology is borrowed from [RFC5012]. This includes terminology like emergency caller, user equipment, call taker, Emergency Service Routing Proxy (ESRP), and Public Safety Answering Point (PSAP).",
      "ja": "救急・サービス関連の用語は[RFC5012]から借りています。これは、緊急の発信者、ユーザ装置、コールテイカー、ポイント（PSAP）に応答緊急サービスルーティングプロキシ（ESRP）、および公安などの用語を含んでいます。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Callback Scenarios",
      "section_title": true,
      "ja": "3.コールバックのシナリオ"
    },
    {
      "indent": 3,
      "text": "This section illustrates a number of scenarios where the currently specified solution, as described in [RFC6881], for preferential treatment of callbacks fails. As explained in Section 1, a SIP entity examines an incoming PSAP callback by comparing the domain of the PSAP with the destination domain of the outbound emergency call placed earlier.",
      "ja": "[RFC6881]に記載されているように、このセクションでは、失敗したコールバックの優遇するために、現在指定溶液シナリオの数を示します。セクション1で説明したように、SIPエンティティは以前に配置され、発信緊急呼の宛先ドメインとPSAPのドメインを比較することにより、着信PSAPコールバックを調べます。"
    },
    {
      "indent": 0,
      "text": "3.1. Routing Asymmetry",
      "section_title": true,
      "ja": "3.1。ルーティング非対称"
    },
    {
      "indent": 3,
      "text": "In some deployment environments, it is common to have incoming and outgoing SIP messaging routed through different SIP entities. Figure 1 shows this graphically whereby a Voice over IP (VoIP) provider uses different SIP proxies for inbound and for outbound call handling. Unless the two devices are synchronized, the callback reaching the inbound proxy would get treated like any other call since the emergency call established state information at the outbound proxy only.",
      "ja": "いくつかのデプロイメント環境では、異なるSIPエンティティを経由する着信および発信SIPメッセージを持っているのが一般的です。図1は、ボイスオーバーIP（VoIP）のプロバイダは、インバウンドおよびアウトバウンド呼処理のための異なるSIPプロキシを使用することにより、グラフィカルにこれを示します。二つのデバイスが同期されない限り、緊急コールのみアウトバウンドプロキシの状態情報を確立しているため、インバウンドプロキシに到達したコールバックは、他のコールと同じように扱わになるだろう。"
    },
    {
      "indent": 5,
      "text": "                                              ,-------.\n                                            ,'         `.\n                 ,-------.                 /  Emergency  \\\n               ,'         `.              |   Services    |\n              /  VoIP       \\      I      |   Network     |\n             |   Provider    |     n      |               |\n             |               |     t      |               |\n             |               |     e      |               |\n             |   +-------+   |     r      |               |\n          +--+---|Inbound|<--+-----m      |               |\n          |  |   |Proxy  |   |     e      |   +------+    |\n          |  |   +-------+   |     d      |   |PSAP  |    |\n          |  |               |     i      |   +--+---+    |\n+----+    |  |               |     a-+    |      |        |\n| UA |<---+  |               |     t |    |      |        |\n|    |----+  |               |     e |    |      |        |\n+----+    |  |               |       |    |      |        |\n          |  |               |     P |    |      |        |\n          |  |               |     r |    |      |        |\n          |  |   +--------+  |     o |    |      |        |\n          +--+-->|Outbound|--+---->v |    |   +--+---+    |\n             |   |Proxy   |  |     i |    | +-+ESRP  |    |\n             |   +--------+  |     d |    | | +------+    |\n             |               |     e |    | |             |\n             |               |     r +----+-+             |\n              \\             /             |               |\n               `.         ,'               \\             /\n                 '-------'                  `.         ,'\n                                              '-------'",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Figure 1: Example for Routing Asymmetry",
      "ja": "図1：ルーティングの非対称性のための例"
    },
    {
      "indent": 0,
      "text": "3.2. Multi-Stage Routing",
      "section_title": true,
      "ja": "3.2。多段ルーティング"
    },
    {
      "indent": 3,
      "text": "Consider the emergency call routing scenario shown in Figure 2 where routing towards the PSAP occurs in several stages. In this scenario, we consider a SIP UA that uses the Location-to-Service Translation (LoST) Protocol [RFC5222] to learn the next-hop destination, namely esrp@example.net, to get the call closer to the PSAP. This call is then sent to the proxy of the user's VoIP provider (example.org). The user's VoIP provider receives the emergency call and creates a state based on the destination domain, namely example.net. It then routes the call to the indicated ESRP. When the ESRP receives the call, it needs to decide what the next hop is to get to the final PSAP. In our example, the next hop is the PSAP with the URI psap@example.com.",
      "ja": "PSAPに向かってルーティングすることはいくつかの段階で発生し、図2に示されている緊急コールルーティングシナリオを考えます。このシナリオでは、我々は近いPSAPへのコールを取得するには、次のホップ先、すなわちesrp@example.net~~Vを学ぶために場所・ツー・サービス翻訳（LOST）プロトコル[RFC5222]を使用するSIP UAを考えてみましょう。この呼び出しは、ユーザーのVoIPプロバイダ（example.org）のプロキシに送信されます。ユーザーのVoIPプロバイダは、緊急コールを受信し、宛先ドメイン、すなわちexample.netに基づいて状態を作成します。その後、ルート示さESRPへの呼び出しを。 ESRPがコールを受信すると、それは次のホップが最終的なPSAPに到達するために何であるかを決定する必要があります。この例では、次のホップは、URI psap@example.comとPSAPです。"
    },
    {
      "indent": 3,
      "text": "When a callback is sent from psap@example.com towards the emergency caller, the call will get normal treatment by the proxy of the VoIP provider since the domain of the PSAP does not match the stored state information.",
      "ja": "コールバックが緊急の発信者に向けてpsap@example.comから送られてくるとPSAPのドメインは、保存された状態情報と一致しないため、コールは、VoIPプロバイダのプロキシによって、通常の治療を取得します。"
    },
    {
      "indent": 7,
      "text": "                                  ,-----------.\n+----+                          ,'             `.\n| UA |--- esrp@example.net    /     Emergency    \\\n+----+   \\                    |      Services    |\n          \\  ,-------.        |      Network     |\n           ,'         `.      |                  |\n          /   VoIP      \\     |     +------+     |\n         (   Provider    )    |     | PSAP |     |\n          \\ example.org /     |     +--+---+     |\n           `.         ,'      |        |         |\n             '---+---'        |        |         |\n                 |            | psap@example.com |\n         esrp@example.net     |        |         |\n                 |            |        |         |\n                 |            |        |         |\n                 |            |     +--+---+     |\n                 +------------+-----+ ESRP |     |\n                              |     +------+     |\n                              |                  |\n                               \\                /\n                                `.            ,'\n                                  '----------'",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Figure 2: Example for Multi-Stage Routing",
      "ja": "図2：マルチステージルーティングの例"
    },
    {
      "indent": 0,
      "text": "3.3. Call Forwarding",
      "section_title": true,
      "ja": "3.3。コール転送"
    },
    {
      "indent": 3,
      "text": "Imagine the following case where an emergency call enters an emergency network (state.example) via an ESRP, but then it gets forwarded to a different emergency services network (in our example, to example.net, example.org, or example.com). The same considerations apply when the police, fire and, ambulance networks are part of the state.example subdomains (e.g., police.state.example).",
      "ja": "緊急コールがESRPを経由して緊急ネットワーク（state.example）に入り、次の場合を想像しますが、それはexample.net、example.org、またはexample.comに、私たちの例では（別の緊急サービスネットワークに転送されます）。警察、火災や、救急車ネットワークはstate.exampleサブドメイン（例えば、police.state.example）の一部である場合、同じ考慮事項が当てはまります。"
    },
    {
      "indent": 3,
      "text": "Similar to the previous scenario, the wrong state information is being set up during the emergency call setup procedure. A callback would originate in the example.net, example.org, or example.com domains whereas the emergency caller's SIP UA or the VoIP outbound proxy has stored state.example.",
      "ja": "前のシナリオと同様に、誤った状態情報は、緊急コールセットアップ手順中に設定されています。コールバックはexample.net、example.orgに由来するだろうか、example.comを緊急呼び出し側のSIP UAのに対し、ドメインまたはVoIPアウトバウンドプロキシはstate.exampleを記憶しています。"
    },
    {
      "indent": 5,
      "text": "                              ,-------.\n                            ,'         `.\n                           /  Emergency  \\\n                          |   Services    |\n                          |   Network     |\n                          |(state.example)|\n                          |               |\n                          |               |\n                          |   +------+    |\n                          |   |PSAP  +--+ |\n                          |   +--+---+  | |\n                          |      |      | |\n                          |      |      | |\n                          |      |      | |\n                          |      |      | |\n                          |      |      | |\n                          |   +--+---+  | |\n        ------------------+---+ESRP  |  | |\n        esrp-a@state.org  |   +------+  | |\n                          |             | |\n                          |    Call Fwd | |\n                          |     +-+-+---+ |\n                           \\    | | |    /\n                            `.  | | |  ,'\n                              '-|-|-|-'           ,-------.\n                       Police   | | | Fire      ,'         `.\n                   +------------+ | +----+     /  Emergency  \\\n    ,-------.      |              |      |    |   Services    |\n  ,'         `.    |              |      |    |   Network     |\n /  Emergency  \\   |          Ambulance  |    |    (Fire)     |\n|   Services    |  |              |      |    |               |\n|   Network     |  |              +----+ |    |   +------+    |\n|   (Police)    |  |     ,-------.     | +----+---+PSAP  |    |\n|               |  |   ,'         `.   |      |   +------+    |\n|   +------+    |  |  /  Emergency  \\  |      |               |\n|   |PSAP  +----+--+ |   Services    | |      |  example.com  ,\n|   +------+    |    |   Network     | |      `~~~~~~~~~~~~~~~\n|               |    |  (Ambulance)  | |\n|  example.net  ,    |               | |\n`~~~~~~~~~~~~~~~     |   +------+    | |\n                     |   |PSAP  +----+ +\n                     |   +------+    |\n                     |               |\n                     |  example.org  ,\n                     `~~~~~~~~~~~~~~~",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 3: Example for Call Forwarding",
      "ja": "図3：着信転送のための例"
    },
    {
      "indent": 0,
      "text": "3.4. Network-Based Service URN Resolution",
      "section_title": true,
      "ja": "3.4。ネットワークベースのサービスURN解決"
    },
    {
      "indent": 3,
      "text": "The IETF emergency services architecture also considers cases where the resolution from the Service URN to the PSAP URI does not only happen at the SIP UA itself but at intermediate SIP entities, such as the user's VoIP provider.",
      "ja": "IETF緊急サービスのアーキテクチャは、PSAPへのサービスURNから解像度がURIのみSIP UA自体ではなく、ユーザーのVoIPプロバイダなどの中間SIPエンティティ、で発生しない場合を考慮しています。"
    },
    {
      "indent": 3,
      "text": "Figure 4 shows this message exchange of the outgoing emergency call and the incoming PSAP graphically. While the state information stored at the VoIP provider is correct, the state allocated at the SIP UA is not.",
      "ja": "図4は、発信緊急呼とグラフィカル着信PSAPのこのメッセージ交換を示しています。 VoIPのプロバイダに格納されている状態情報が正確であるが、SIP UAに割り当てられた状態ではありません。"
    },
    {
      "indent": 4,
      "text": "    ,-------.\n  ,'         `.\n /  Emergency  \\\n|   Services    |\n|   Network     |\n|  example.com  |\n|               |\n|   +------+    |    INVITE to police@example.com\n|   |PSAP  +<---+------------------------+\n|   |      +----+--------------------+   ^\n|   +------+    |INVITE from         |   |\n|               ,police@example.com  |   |\n`~~~~~~~~~~~~~~~                     |   |\n                                     v   |\n+--------+  Query with location   +--+---+-+\n|        |  + urn:service:sos     |  VoIP  |\n| LoST   |<-----------------------|Service |\n| Server |   police@example.com   |Provider|\n|        |----------------------->|        |\n+--------+                        +--------+\n                                   |     ^\n                             INVITE|     | INVITE\n                               from|     | to\n                 police@example.com|     | urn:service:sos\n                                   V     |\n                                  +-------+\n                                  | SIP   |\n                                  | UA    |\n                                  | Alice |\n                                  +-------+",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Figure 4: Example for Network-Based Service URN Resolution",
      "ja": "図4：ネットワークベースのサービスURN解決のための例"
    },
    {
      "indent": 0,
      "text": "3.5. PSTN Interworking",
      "section_title": true,
      "ja": "3.5。 PSTNインターワーキング"
    },
    {
      "indent": 3,
      "text": "In case an emergency call enters the Public Switched Telephone Network (PSTN), as shown in Figure 5, there is no guarantee that the callback sometime later leaves the same PSTN/VoIP gateway or that the same endpoint identifier is used in the forward as well as in the backward direction making it difficult to reliably detect PSAP callbacks.",
      "ja": "場合に緊急呼が公衆交換電話網（PSTN）に入り、図5に示すように、コールバックがいつか後同じPSTN / VoIPゲートウェイを離れるか、同じエンドポイント識別子は同様に前方に使用されるという保証はありません逆方向のように、それは難しい確実PSAPコールバックを検出すること。"
    },
    {
      "indent": 5,
      "text": "+-----------+\n| PSTN      |-------------+\n| Calltaker |             |\n| Bob       |<--------+   |\n+-----------+         |   v\n           -------------------\n       ////                   \\\\\\\\      +------------+\n      |                           |     |PSTN / VoIP |\n      |             PSTN          |---->|Gateway     |\n       \\\\\\\\                   ////      |            |\n           -------------------          +----+-------+\n                      ^                      |\n                      |                      |\n                +-------------+              |  +--------+\n                |             |              |  |VoIP    |\n                | PSTN / VoIP |              +->|Service |\n                | Gateway     |                 |Provider|\n                |             |<------INVITE----|   Y    |\n                +-------------+                 +--------+\n                                                 |     ^\n                                                 |     |\n                                               INVITE INVITE\n                                                 |     |\n                                                 V     |\n                                                +-------+\n                                                | SIP   |\n                                                | UA    |\n                                                | Alice |\n                                                +-------+",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Figure 5: Example for PSTN Interworking",
      "ja": "図5：例PSTNインターワーキングのための"
    },
    {
      "indent": 3,
      "text": "Note: This scenario is considered outside the scope of this document. The specified solution does not support this use case.",
      "ja": "注：このシナリオは、このドキュメントの範囲外と考えられています。指定されたソリューションは、このユースケースをサポートしていません。"
    },
    {
      "indent": 0,
      "text": "4. SIP PSAP Callback Indicator",
      "section_title": true,
      "ja": "4. SIP PSAPコールバックインジケータ"
    },
    {
      "indent": 0,
      "text": "4.1. General",
      "section_title": true,
      "ja": "4.1。一般的な"
    },
    {
      "indent": 3,
      "text": "This section defines a new header field value, called \"psap-callback\", for the SIP Priority header field defined in [RFC3261]. The value is used to inform SIP entities that the request is associated with a PSAP callback SIP session.",
      "ja": "このセクションでは、[RFC3261]で定義されたSIP優先ヘッダフィールドの「PSAP  - コールバック」と呼ばれる新たなヘッダフィールド値を、定義します。値は、要求はPSAPコールバックSIPセッションに関連付けられたSIPエンティティに通知するために使用されます。"
    },
    {
      "indent": 0,
      "text": "4.2. Usage",
      "section_title": true,
      "ja": "4.2。使用法"
    },
    {
      "indent": 3,
      "text": "SIP entities that receive the header field value within an initial request for a SIP session can, depending on local policies, apply PSAP callback-specific procedures for the session or request.",
      "ja": "SIPセッションの最初の要求内のヘッダフィールド値を受信するSIPエンティティは、ローカルポリシーに応じて、セッションまたは要求のためにPSAPコールバック固有の手順を適用することができます。"
    },
    {
      "indent": 3,
      "text": "The PSAP callback-specific procedures may be applied by SIP-based network entities and by the callee. The specific actions taken when receiving a call marked as a PSAP callback marked call, such as bypassing services and barring procedures, are outside the scope of this document.",
      "ja": "PSAPコールバック固有の手順は、SIPベースのネットワークエンティティによって、および被呼者によって適用されてもよいです。 PSAPコールバックを呼び出すマークなどのサービスをバイパスし、手続きがなけれとして、マークコールを受信したときに撮影した具体的な行動は、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "4.3. Syntax",
      "section_title": true,
      "ja": "4.3。構文"
    },
    {
      "indent": 0,
      "text": "4.3.1. General",
      "section_title": true,
      "ja": "4.3.1。一般的な"
    },
    {
      "indent": 3,
      "text": "This section defines the ABNF [RFC5234] for the new SIP Priority header field value \"psap-callback\".",
      "ja": "このセクションでは、新しいSIP優先ヘッダフィールド値「PSAP  - コールバック」のABNF [RFC5234]を定義します。"
    },
    {
      "indent": 0,
      "text": "4.3.2. ABNF",
      "section_title": true,
      "ja": "4.3.2。 ABNF"
    },
    {
      "indent": 7,
      "text": "priority-value =/ \"psap-callback\"",
      "ja": "優先順位の値= / \"PSAP-コールバック\""
    },
    {
      "indent": 15,
      "text": "Figure 6: ABNF",
      "ja": "図6：ABNF"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 0,
      "text": "5.1. Security Threat",
      "section_title": true,
      "ja": "5.1。セキュリティ上の脅威"
    },
    {
      "indent": 3,
      "text": "The PSAP callback functionality described in this document allows marked calls to bypass blacklists and ignore call-forwarding procedures and other similar features used to raise the attention of emergency callers when attempting to contact them. In the case where the SIP Priority header value, \"psap-callback\", is supported by the SIP UA, it would override user-interface configurations, such as vibrate-only mode, to alert the caller of the incoming call.",
      "ja": "このドキュメントで説明PSAPコールバック機能は、マークされた呼び出しがブラックリストをバイパスし、コールの転送手順とそれらを連絡しようとしたときの緊急発信者の関心を高めるために使用される他の似たような機能を無視することができます。 SIP優先ヘッダ値、「PSAP-コールバック」は、SIP UAによってサポートされている場合には、着信呼の発信者に警告するために、そのような振動専用モードなどのユーザーインターフェース設定をオーバーライドすることになります。"
    },
    {
      "indent": 0,
      "text": "5.2. Security Requirements",
      "section_title": true,
      "ja": "5.2。セキュリティ要件"
    },
    {
      "indent": 3,
      "text": "The security threat discussed in Section 5.1 leads to the requirement to ensure that the mechanisms described in this document cannot be used for malicious purposes, including telemarketing.",
      "ja": "セクション5.1で説明したセキュリティの脅威は、この文書で説明したメカニズムは、テレマーケティングなどの悪質な目的に使用することができないことを保証するための要件につながります。"
    },
    {
      "indent": 3,
      "text": "Furthermore, if the newly defined extension is not recognized, not verified adequately, or not obeyed by SIP intermediaries or SIP endpoints, then it must not lead to a failure of the call handling procedure. Such a call must be treated like a call that does not have any marking attached.",
      "ja": "新しく定義された拡張子が認識されない場合はさらに、十分に検証されていない、またはSIPの仲介やSIPエンドポイントによって従わない、それは呼処理手順の故障につながるしてはなりません。このようなコールは、いずれかが付属マーキングがないコールのように扱われなければなりません。"
    },
    {
      "indent": 3,
      "text": "The indicator described in Section 4 can be inserted by any SIP entity, including attackers. So it is critical that the indicator only lead to preferential call treatment in cases where the recipient has some trust in the caller, as described in the next section.",
      "ja": "セクション4で説明インジケータが攻撃者を含む任意のSIPエンティティによって挿入することができます。だから、インジケータのみ、次のセクションで説明するように、受信者は、呼び出し側でいくつかの信頼を持っている場合は、優先コールの治療につながることが重要です。"
    },
    {
      "indent": 0,
      "text": "5.3. Security Solution",
      "section_title": true,
      "ja": "5.3。セキュリティソリューション"
    },
    {
      "indent": 3,
      "text": "The approach for dealing with the implementation of the security requirements described in Section 5.2 can be differentiated between the behavior applied by the UA and by SIP proxies. A UA that has made an emergency call MUST keep state information so that it can recognize and accept a callback from the PSAP if it occurs within a reasonable time after an emergency call was placed, as described in Section 13 of [RFC6443]. Only a timer started at the time when the original emergency call has ended is required; information about the calling party identity is not needed since the callback may use a different calling party identity, as described in Section 3. Since these SIP UA considerations are described already in [RFC6443] as well as in [RFC6881] the rest of this section focuses on the behavior of SIP proxies.",
      "ja": "セクション5.2で記述されたセキュリティ要件の実装に対処するための手法は、UAによって、およびSIPプロキシによって適用される挙動と区別することができます。 [RFC6443]のセクション13に記載されているように、それが認識し、それが緊急コールの後、合理的な時間内に発生した場合、PSAPからのコールバックを受け入れることができるように、状態情報を保持しなければならない緊急コールを行ったUAは、配置しました。唯一のタイマーは、元の緊急コールが必要とされて終了した時点で開始しました。コールバックは、このセクションの残りの部分を第3節で説明したようにこれらのSIP UAの配慮が[RFC6443]で既に説明されているので、さまざまな発信者IDを使用するだけでなく、[RFC6881]で可能性があるため、発呼者の身元に関する情報が必要とされていませんSIPプロキシの行動に焦点を当てています。"
    },
    {
      "indent": 3,
      "text": "Figure 7 shows the architecture that utilizes the identity of the PSAP to decide whether a preferential treatment of callbacks should be provided. To make this policy decision, the identity of the PSAP (i.e., calling party identity) is compared with a PSAPs white list.",
      "ja": "図7は、コールバックの優遇措置を提供する必要があるかどうかを決定するためにPSAPのアイデンティティを利用アーキテクチャを示しています。この方針の決定を行うために、PSAPのアイデンティティ（すなわち、発信者の身元が）のPSAPホワイトリストと比較されます。"
    },
    {
      "indent": 8,
      "text": "               +----------+\n               | List of  |+\n               | valid    ||\n               | PSAPs    ||\n               +----------+|\n                +----------+\n                    *\n                    * white list\n                    *\n                    V\n Incoming      +----------+    Normal\n SIP Msg       | SIP      |+   Treatment\n-------------->| Entity   ||======================>\n + Identity    |          ||(if not in white list)\n   Info        +----------+|\n               +----------+\n                    ||\n                    ||\n                    || Preferential\n                    || Treatment\n                    ++========================>\n                      (if successfully verified)",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Figure 7: Identity-Based Authorization",
      "ja": "図7：アイデンティティベースの許可"
    },
    {
      "indent": 3,
      "text": "The identity assurance in SIP can come in different forms, namely via the SIP Identity [RFC4474] or the P-Asserted-Identity [RFC3325] mechanisms. The former technique relies on a cryptographic assurance and the latter on a chain of trust. Also, the usage of Transport Layer Security (TLS) between neighboring SIP entities may provide useful identity information. At the time of writing, these identity technologies are being revised in the Secure Telephone Identity Revisited (stir) working group [STIR] to offer better support for legacy technologies interworking and SIP intermediaries that modify the content of various SIP headers and the body. Once the work on these specifications has been completed, they will offer a stronger calling party identity mechanism that limits or prevents identity spoofing.",
      "ja": "SIPにおけるアイデンティティの保証、すなわちSIPアイデンティティ[RFC4474]またはP-アサート・アイデンティティ[RFC3325]メカニズムを介して、異なる形で来ることができます。前者の技術は、暗号保証と信頼の連鎖に後者に依存しています。また、近隣のSIPエンティティ間のトランスポート層セキュリティ（TLS）の使用は、便利な識別情報を提供することができます。執筆時点では、これらのアイデンティティ技術は、従来の技術の様々なSIPヘッダとボディの内容を変更するインターワーキングおよびSIP仲介のためのより良いサポートを提供するセキュア電話アイデンティティ再訪（撹拌）ワーキンググループ[STIR]に改定されています。これらの仕様上の作業が完了すると、彼らは制限や身元詐称を防ぐ強力な発信者の身元メカニズムを提供します。"
    },
    {
      "indent": 3,
      "text": "An important aspect from a security point of view is the relationship between the emergency services network (containing the PSAPs) and the VoIP provider, assuming that the emergency call travels via the VoIP provider and not directly between the SIP UA and the PSAP.",
      "ja": "セキュリティの観点から重要な側面は、緊急コールがSIP UAとPSAPとの間で直接のVoIPプロバイダを介して移動しないと仮定すると、緊急サービスネットワーク（のPSAPを含む）とVoIPプロバイダとの間の関係です。"
    },
    {
      "indent": 3,
      "text": "The establishment of a white list with PSAP identities may be operationally complex and dependent on the relationship between the emergency services operator and the VoIP provider. If there is a relationship between the VoIP provider and the PSAP operator, for example, when they are both operating in the same geographical region, then populating the white list is fairly simple and consequently the identification of a PSAP callback is less problematic compared to the case where the two entities have never interacted with each other before. In the end, the VoIP provider has to verify whether the marked callback message indeed came from a legitimate source.",
      "ja": "PSAPアイデンティティとホワイトリストの設立は、操作上、複雑かつ緊急サービス事業者とVoIPプロバイダとの間の関係に依存してもよいです。 VoIPのプロバイダとPSAPオペレータとの間の関係が存在する場合、それらは両方とも同じ地理的領域内で動作している場合、例えば、次にホワイトリストに移入することはかなり簡単であり、その結果、PSAPコールバックの識別は、に比べて問題が少ないです2つのエンティティが前に相互作用したことがない場合。最後に、VoIPのプロバイダは、マークされたコールバックメッセージが実際に合法的なソースから来たかどうかを確認する必要があります。"
    },
    {
      "indent": 3,
      "text": "VoIP providers MUST only give PSAP callbacks preferential treatment when the calling party identity of the PSAP was successfully matched against entries in the white list. If it cannot be verified (because there was no match), then the VoIP provider MUST remove the PSAP callback marking. Thereby, the callback reverts to a normal call. As a second step, SIP UAs MUST maintain a timer that is started with the original emergency call and this timer expires within a reasonable amount of time, such as 30 minutes per [RFC6881]. Such a timer also ensures that VoIP providers cannot misuse the PSAP callback mechanism, for example, to ensure that their support calls reach their customers.",
      "ja": "VoIPプロバイダはPSAPコールバックにPSAPの発信者の身元が正常にホワイトリスト内のエントリと照合された優遇措置を与える必要があります。 （一致するものがなかったので）、それが確認できない場合は、VoIPのプロバイダは、マーキングPSAPコールバックを削除する必要があります。これにより、コールバックは通常の通話に戻ります。第二段階として、SIP UAは、元の緊急呼を開始し、このタイマが妥当な時間内に満了するタイマ、[RFC6881]あたり例えば30分を維持しなければなりません。このようなタイマもVoIPプロバイダは、彼らのサポートコールが顧客に届くことを保証するために、例えば、PSAPコールバックメカニズムを誤用することができないことを保証します。"
    },
    {
      "indent": 3,
      "text": "Finally, a PSAP callback MUST use the same media as the original emergency call. For example, when an initial emergency call established a real-time text communication session, then the PSAP callback must also attempt to establish a real-time communication interaction. The reason for this is twofold. First, the person seeking help may have disabilities that prevent them from using certain media and hence using the same media for the callback avoids unpleasant surprises and delays. Second, the emergency caller may have intentionally chosen a certain media and does not prefer to communicate in a different way. For example, it would be unfortunate if a hostage tries to seek help using instant messaging to avoid any noise when subsequently the ringtone triggered by a PSAP callback using a voice call gets the attention of the hostage-taker. User-interface designs need to cater to such situations.",
      "ja": "最後に、PSAPコールバックは、元の緊急通話と同じメディアを使用しなければなりません。初期の緊急コールがリアルタイムテキスト通信セッションを確立する場合たとえば、その後、PSAPコールバックは、リアルタイム通信の相互作用を確立しようとしなければなりません。この理由は二つあります。まず、助けを求めている人は不快な驚きや遅延を回避し、特定のメディアを使用して、したがって、コールバックのために同じメディアを使用してからそれらを防ぐため、障害を有することができます。第二に、緊急呼び出し側が意図的に特定のメディアを選択している場合があり、さまざまな方法で通信することを好むはありません。人質は、音声通話を使用してPSAPコールバックによってトリガ後に着信音が人質受け手の注意を取得する際のノイズを避けるために、インスタントメッセージングを使用して助けを求めることをしようとした場合たとえば、それは不幸なことでしょう。ユーザー・インターフェース・デザインは、このような状況に対応するために必要があります。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document adds the \"psap-callback\" value to the SIP \"Priority Header Field Values\" registry allocated by [RFC6878]. The semantic of the newly defined \"psap-callback\" value is defined in Section 4.",
      "ja": "この文書では、[RFC6878]によって割り当てられたSIP「優先順位ヘッダーフィールド値」レジストリに「PSAP-コールバック」の値を追加します。新しく定義された「PSAP-コールバック」の値の意味は、4節で定義されています。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "We would like to thank the following persons for their feedback: Bernard Aboba, Andrew Allen, John-Luc Bakker, Kenneth Carlberg, Martin Dolly, Keith Drage, Timothy Dwight, John Elwell, Janet Gunn, Cullen Jennings, Hadriel Kaplan, Paul Kyzivat, John Medland, Atle Monrad, James Polk, Dan Romascanu, Brian Rosen, Robert Sparks, Geoff Thompson, and Martin Thomson.",
      "ja": "、バーナードAboba、アンドリュー・アレン、ジョン・リュック・バッカー、ケネス・カールバーグ、マーティン・ドリー、キース糖剤、ティモシードワイト、ジョンエルウェル、ジャネット・ガン、カレン・ジェニングス、Hadrielカプラン、ポールKyzivat：私たちは、彼らのフィードバックのために、次の人に感謝したいと思いますジョンMedland、Atle Monrad、ジェームズ・ポーク、ダンRomascanu、ブライアン・ローゼン、ロバート・スパークス、ジェフ・トンプソン、そしてマーティン・トムソン。"
    },
    {
      "indent": 3,
      "text": "We would also like to thank the ECRIT working group chairs, Marc Linsner and Roger Marshall, for their support. Roger Marshall was the document shepherd for this document. Vijay Gurbani provided the general area review.",
      "ja": "我々はまた、彼らのサポートのために、ECRITワーキンググループチェア、マルク・Linsnerとロジャー・マーシャルに感謝したいと思います。ロジャー・マーシャルは、この文書の文書羊飼いでした。ビジェイGurbaniは、一般的な領域の見直しを提供します。"
    },
    {
      "indent": 3,
      "text": "During IESG review, the document received good feedback from Barry Leiba, Spencer Dawkins, Richard Barnes, Joel Jaeggli, Stephen Farrell, and Benoit Claise.",
      "ja": "IESGレビューの間、文書がバリー・レイバ、スペンサードーキンス、リチャード・バーンズ、ジョエルJaeggli、スティーブン・ファレル、およびブノワClaiseから良いフィードバックを受けました。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "ja": "[RFC3261]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\" 、RFC 3261、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed., and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008.",
      "ja": "\"構文仕様のための増大しているBNF：ABNF\" [RFC5234]クロッカー、D.、エド、およびP. Overell、。、STD 68、RFC 5234、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5627] Rosenberg, J., \"Obtaining and Using Globally Routable User Agent URIs (GRUUs) in the Session Initiation Protocol (SIP)\", RFC 5627, October 2009.",
      "ja": "[RFC5627]ローゼンバーグ、J.、RFC 5627、2009年10月 \"セッション開始プロトコル（SIP）でグローバルにルーティング可能なユーザエージェントのURI（GRUUs）の取得と使用\" を参照してください。"
    },
    {
      "indent": 3,
      "text": "[RFC6878] Roach, A., \"IANA Registry for the Session Initiation Protocol (SIP) \"Priority\" Header Field\", RFC 6878, March 2013.",
      "ja": "[RFC6878]ローチ、A.、優先順位 \"ヘッダーフィールド \" RFC 6878、2013年3月\" セッション開始プロトコル（SIP）のためのIANAレジストリ\"。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3325] Jennings, C., Peterson, J., and M. Watson, \"Private Extensions to the Session Initiation Protocol (SIP) for Asserted Identity within Trusted Networks\", RFC 3325, November 2002.",
      "ja": "[RFC3325]ジェニングス、C.、ピーターソン、J.、およびM.ワトソン、 \"信頼できるネットワーク内のアサート・アイデンティティのためのセッション開始プロトコル（SIP）のプライベート拡張\"、RFC 3325、2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC4474] Peterson, J. and C. Jennings, \"Enhancements for Authenticated Identity Management in the Session Initiation Protocol (SIP)\", RFC 4474, August 2006.",
      "ja": "[RFC4474]ピーターソン、J.とC.ジェニングス、RFC 4474 \"セッション開始プロトコル（SIP）で認証されたアイデンティティ管理のための機能強化\"、2006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5012] Schulzrinne, H. and R. Marshall, \"Requirements for Emergency Context Resolution with Internet Technologies\", RFC 5012, January 2008.",
      "ja": "[RFC5012] Schulzrinneと、H.とR.マーシャル、 \"インターネット技術との緊急コンテキスト解決のための要件\"、RFC 5012、2008年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5222] Hardie, T., Newton, A., Schulzrinne, H., and H. Tschofenig, \"LoST: A Location-to-Service Translation Protocol\", RFC 5222, August 2008.",
      "ja": "[RFC5222]ハーディ、T.、ニュートン、A.、Schulzrinneと、H.、およびH. Tschofenig、 \"失われた：場所・ツー・サービス翻訳・プロトコル\"、RFC 5222、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC6443] Rosen, B., Schulzrinne, H., Polk, J., and A. Newton, \"Framework for Emergency Calling Using Internet Multimedia\", RFC 6443, December 2011.",
      "ja": "[RFC6443]ローゼン、B.、Schulzrinneと、H.、ポーク、J.、およびA.ニュートン、 \"インターネットマルチメディアを使用して緊急コールのためのフレームワーク\"、RFC 6443、2011年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC6881] Rosen, B. and J. Polk, \"Best Current Practice for Communications Services in Support of Emergency Calling\", BCP 181, RFC 6881, March 2013.",
      "ja": "[RFC6881]ローゼン、B.とJ.ポーク、 \"緊急コールのサポートにおける通信サービスのための最も良い現在の練習\"、BCP 181、RFC 6881、2013年3月。"
    },
    {
      "indent": 3,
      "text": "[STIR] IETF, \"Secure Telephone Identity Revisited (stir) Working Group\", http://datatracker.ietf.org/wg/stir/charter/, October 2013.",
      "ja": "[STIR] IETF、http://datatracker.ietf.org/wg/stir/charter/、2013年10月 \"電話アイデンティティ再訪（撹拌）ワーキンググループを固定します\"。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Henning Schulzrinne Columbia University Department of Computer Science 450 Computer Science Building New York, NY 10027 US",
      "ja": "コンピュータサイエンス450コンピュータサイエンスビル、ニューヨーク、NY 10027米国のヘニングSchulzrinneとコロンビア大学学部"
    },
    {
      "indent": 3,
      "text": "Phone: +1 212 939 7004 EMail: hgs+ecrit@cs.columbia.edu URI: http://www.cs.columbia.edu",
      "ja": "電話：+1 212 939 7004 Eメール：hgs+ecrit@cs.columbia.edu URI：http://www.cs.columbia.edu"
    },
    {
      "indent": 3,
      "text": "Hannes Tschofenig",
      "ja": "ハンネスTschofenig"
    },
    {
      "indent": 3,
      "text": "EMail: Hannes.Tschofenig@gmx.net URI: http://www.tschofenig.priv.at",
      "ja": "電子メール：Hannes.Tschofenig@gmx.net URI：http://www.tschofenig.priv.at"
    },
    {
      "indent": 3,
      "text": "Christer Holmberg Ericsson Hirsalantie 11 Jorvas 02420 Finland",
      "ja": "クリステルHolmbergのエリクソンHirsalantie 11 02420 Jorvasフィンランド"
    },
    {
      "indent": 3,
      "text": "EMail: christer.holmberg@ericsson.com",
      "ja": "メールアドレス：christer.holmberg@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Milan Patel Huawei Technologies (UK) Co., Ltd. 300 South Oak Way, Green Park Reading, Berkshire RG2 6UF U.K.",
      "ja": "ミラノ・パテル華為技術（UK）有限公司300南オークウェイ、グリーンパーク読書、バークシャーRG2 6UF U.K."
    },
    {
      "indent": 3,
      "text": "EMail: Milan.Patel@huawei.com",
      "ja": "メールアドレス：Milan.Patel@huawei.com"
    }
  ]
}