{
  "title": {
    "text": "RFC 6543 - Reserved IPv6 Interface Identifier for Proxy Mobile IPv6",
    "ja": "RFC 6543 - プロキシモバイルIPv6のための予約済みのIPv6インタフェース識別子"
  },
  "number": 6543,
  "created_at": "2019-10-27 12:12:45.825570+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                     S. Gundavelli\nRequest for Comments: 6543                                         Cisco\nUpdates: 5213                                                   May 2012\nCategory: Standards Track\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Reserved IPv6 Interface Identifier for Proxy Mobile IPv6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Proxy Mobile IPv6 (RFC 5213) requires that all mobile access gateways use a fixed link-local address and a fixed link-layer address on any of their access links that they share with mobile nodes. This requirement was intended to ensure that a mobile node does not detect any change with respect to its Layer 3 attachment, even after it roams from one mobile access gateway to another. In the absence of any reserved addresses for this use, coordination across vendors and manual configuration of these addresses on all of the mobility elements in a Proxy Mobile IPv6 domain are required. This document attempts to simplify this operational requirement by making a reservation for special addresses that can be used for this purpose. This document also updates RFC 5213.",
      "ja": "プロキシモバイルIPv6（RFC 5213）は、すべてのモバイル・アクセス・ゲートウェイは、固定リンクローカルアドレスと、彼らはモバイルノードと共有自分のアクセスリンクのいずれかの固定リンク層アドレスを使用する必要があります。この要件は、モバイルノードは、それが別のモバイルアクセスゲートウェイからローミングした後も、そのレイヤ3アタッチメントに対して任意の変更が検出されないことを確実にするために意図されていました。この使用のために予約済みのアドレスが存在しない場合には、ベンダーおよびプロキシモバイルIPv6ドメインのモビリティのすべての要素にこれらのアドレスを手動で構成間の調整が必要とされています。この文書では、この目的のために使用することができ、特別なアドレスの予約をすることによって、この運用要件を簡素化しようとします。この文書はまた、RFC 5213を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc6543.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc6543で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2012 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2012 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Conventions and Terminology .....................................3\n   2.1. Conventions ................................................3\n   2.2. Terminology ................................................3\n3. IANA Considerations .............................................4\n4. Security Considerations .........................................4\n5. Acknowledgements ................................................4\n6. References ......................................................5\n   6.1. Normative References .......................................5\n   6.2. Informative References .....................................5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Proxy Mobile IPv6 [RFC5213] is a network-based mobility management protocol that enables IP mobility support for a mobile node without requiring its participation in any mobility-related signaling. The mobility elements in the network ensure that the mobile node does not detect any change with respect to its Layer 3 attachment, even after it roams from one mobile access gateway to another and changes its point of attachment in the network. All mobile access gateways in a Proxy Mobile IPv6 domain use a fixed link-local address and a fixed link-layer address on any of their access links that they share with the mobile nodes. This essentially ensures that a mobile node, after performing a handoff, does not detect any change with respect to the IP network configuration.",
      "ja": "プロキシモバイルIPv6 [RFC5213]は、任意のモビリティ関連のシグナリングへの参加を必要とせずに、モバイルノードのためのIPモビリティのサポートを可能にするネットワークベースのモビリティ管理プロトコルです。ネットワーク内のモビリティ・エレメントは、それが別のモバイルアクセスゲートウェイからローミングし、ネットワーク内の接続点を変更した後でも、モバイルノードは、そのレイヤ3アタッチメントに対する変更を検出しないことを確認してください。プロキシモバイルIPv6ドメインのすべてのモバイル・アクセス・ゲートウェイは、彼らがモバイルノードと共有のアクセスリンクのいずれかに固定されたリンクローカルアドレスおよび固定リンク層アドレスを使用します。これは、本質的に、モバイルノードは、ハンドオフを実行した後、IPネットワーク設定に対する変更を検出しないことを保証します。"
    },
    {
      "indent": 3,
      "text": "Although the base Proxy Mobile IPv6 specification [RFC5213] requires the use of a fixed link-local and a fixed link-layer address, it did not reserve any specific addresses for this purpose. This is proving to be an operational challenge in deployments involving multi-vendor equipment. To address this problem, this specification makes the following two reservations.",
      "ja": "ベースプロキシモバイルIPv6仕様[RFC5213]は、固定ローカルリンクおよび固定リンク層アドレスの使用を必要とするが、それは、この目的のために特定のアドレスを予約しませんでした。これは、マルチベンダーの機器を含む展開で運用課題であることが証明されて。この問題に対処するために、この仕様は、以下の2つの予約を行います。"
    },
    {
      "indent": 3,
      "text": "1. This specification reserves one Ethernet unicast address, 00-00-5E-00-52-13, for use with Proxy Mobile IPv6. This reserved link-layer address SHOULD be used by the mobile access gateway in a Proxy Mobile IPv6 domain, on all of the access links that it shares with the mobile nodes. The protocol configuration variable FixedMAGLinkLayerAddressOnAllAccessLinks [RFC5213] SHOULD be set to this reserved address. The mobile access gateway can use this address in all packet communication with the mobile node on the access links. Considerations from [RFC5342] apply with respect to the use of Ethernet parameters in IETF protocols. This address is allocated from the registry \"IANA Ethernet Address Block - Unicast Use\".",
      "ja": "1.この仕様準備プロキシモバイルIPv6での使用のための1つのイーサネット（登録商標）のユニキャストアドレス、00-00-5E-00-52-13、。この予約されたリンク層アドレスは、モバイルノードと共有アクセスリンクの全てに、プロキシモバイルIPv6ドメイン内のモバイル・アクセス・ゲートウェイによって使用されるべきです。プロトコル構成変数FixedMAGLinkLayerAddressOnAllAccessLinks [RFC5213]は、この予約アドレスに設定されるべきです。モバイル・アクセス・ゲートウェイは、アクセスリンク上の移動ノードとすべてのパケット通信では、このアドレスを使用することができます。 [RFC5342]からの考察はIETFプロトコルにおけるイーサネットパラメータの使用に対して適用されます。 「 - ユニキャストを使用するIANAイーサネットアドレスブロック」このアドレスは、レジストリから割り当てられます。"
    },
    {
      "indent": 3,
      "text": "2. This specification reserves an IPv6 interface identifier, 0200:5EFF:FE00:5213. This interface identifier is a modified EUI-64 interface identifier generated from the allocated Ethernet unicast address 00-00-5E-00-52-13. This reserved IPv6 interface identifier SHOULD be used by all of the mobile access gateways in a Proxy Mobile IPv6 domain on all of the access links that they share with the mobile nodes. The protocol configuration variable FixedMAGLinkLocalAddressOnAllAccessLinks [RFC5213] SHOULD be set to the link-local address generated using this reserved IPv6 interface identifier. The mobile access gateway can use this link-local address generated using this reserved IPv6 interface identifier in all Neighbor Discovery-related [RFC4861] communication with the mobile node.",
      "ja": "5EFF：FE00：5213 2.この仕様は、IPv6インタフェース識別子、0200留保します。このインタフェース識別子は、割り当てられたイーサネットユニキャストアドレス00-00-5E-00-52-13から生成された変形EUI-64インターフェイス識別子です。この予約されたIPv6インタフェース識別子は、それらがモバイルノードと共有アクセスリンクの全てのプロキシモバイルIPv6ドメイン内のモバイル・アクセス・ゲートウェイの全てによって使用されるべきです。プロトコル構成変数FixedMAGLinkLocalAddressOnAllAccessLinks [RFC5213]は、この予約済みのIPv6インタフェース識別子を使用して生成されたリンクローカルアドレスに設定する必要があります。モバイル・アクセス・ゲートウェイは、移動ノードとのすべての近隣探索に関連する[RFC4861]通信にこの予約IPv6インタフェース識別子を使用して生成され、このリンクローカルアドレスを使用することができます。"
    },
    {
      "indent": 0,
      "text": "2. Conventions and Terminology",
      "section_title": true,
      "ja": "2.表記と用語"
    },
    {
      "indent": 0,
      "text": "2.1. Conventions",
      "section_title": true,
      "ja": "2.1。表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Terminology",
      "section_title": true,
      "ja": "2.2。用語"
    },
    {
      "indent": 3,
      "text": "All of the mobility-related terms used in this document are to be interpreted as defined in the base Proxy Mobile IPv6 specifications ([RFC5213], [RFC5844]). All of the terminology related to IPv6 addressing is to be interpreted as specified in [RFC4291].",
      "ja": "本書で使用されるモビリティ関連の用語の全ては、（[RFC5213]、[RFC5844]）ベースのプロキシモバイルIPv6仕様で定義されるように解釈されるべきです。 IPv6アドレスに関連する用語のすべては、[RFC4291]で指定されるように解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "o This specification reserves one Ethernet unicast address, 00-00-5E-00-52-13, for Proxy Mobile IPv6. This address has been reserved in the registry \"IANA Ethernet Address Block - Unicast Use\".",
      "ja": "Oこの仕様準備プロキシモバイルIPv6のための1つのイーサネット（登録商標）のユニキャストアドレス、00-00-5E-00-52-13、。このアドレスは、レジストリに「 - ユニキャストを使用するIANAイーサネットアドレスブロックを」予約されています。"
    },
    {
      "indent": 3,
      "text": "o This specification reserves an IPv6 interface identifier, 0200:5EFF:FE00:5213, for Proxy Mobile IPv6 [RFC5213] in the registry \"Reserved IPv6 Interface Identifiers\" [RFC5453]. This interface identifier is a modified EUI-64 interface identifier generated from the allocated Ethernet unicast address 00-00-5E-00-52-13, as specified in Appendix A of [RFC4291].",
      "ja": "レジストリ内のプロキシ・モバイルIPv6 [RFC5213] \"予約IPv6インタフェース識別子\" [RFC5453]のために、5213：5EFF：FE00 Oこの仕様は、IPv6インタフェース識別子、0200留保します。 [RFC4291]の付録Aで指定されるように、このインタフェース識別子は、割り当てられたイーサネットユニキャストアドレス00-00-5E-00-52-13から生成された変形EUI-64インターフェイス識別子です。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "All of the security considerations specified in [RFC5213] and [RFC5844] continue to apply to the mobility elements in a Proxy Mobile IPv6 domain when those elements conform to this specification. Specifically, the issues related to the use of fixed link-local and link-layer addresses as documented in Section 6.9.3 of the base Proxy Mobile IPv6 specification are equally relevant here. In some sense, the reservations made in this specification result in the use of the same set of link-local and link-layer address values beyond a single Proxy Mobile IPv6 domain, thereby expanding the scope of the existing problem related to asserting ownership of the configured addresses from a single domain to a multi-domain environment. Future work may be needed to address these issues.",
      "ja": "[RFC5213]と[RFC5844]で指定されたセキュリティ上の考慮事項のすべては、これらの要素は、この仕様に準拠したときにプロキシモバイルIPv6ドメインの移動性要素に適用し続けます。具体的には、ベースプロキシモバイルIPv6仕様のセクション6.9.3に記載のように、固定リンクローカルおよびリンク層アドレスの使用に関連する問題は、ここに等しく関連しています。ある意味では、予約は、それによってアサートの所有権に関連する既存の問題の範囲を拡大し、単一のプロキシ・モバイルIPv6ドメインを越えたリンクローカル及びリンク層アドレス値の同じセットを使用することで、この特定結果に作らマルチドメイン環境に単一のドメインからのアドレスを設定しました。今後の課題は、これらの問題に対処するために必要とすることができます。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "ja": "5.謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank Jari Arkko and Dave Thaler for all of the discussions around the use of fixed link-local and link-layer addresses during work related to the standardization of Proxy Mobile IPv6 [RFC5213]. The author would also like to thank Tero Kivinen, Donald Eastlake 3rd, Stephen Farrell, Suresh Krishnan, Margaret Wasserman, Thomas Narten, Basavaraj Patil, and Eric Voit for their reviews and participation in the discussions related to this document.",
      "ja": "著者は、プロキシモバイルIPv6 [RFC5213]の標準化に関わる作業中固定リンクローカルおよびリンク層アドレスの使用の周りの議論のすべてのためのヤリArkkoとDaveターラーに感謝したいと思います。著者はまた、彼らのレビューと、このドキュメントに関連した議論に参加するためTERO Kivinen、ドナルドイーストレイク3日、スティーブン・ファレル、スレシュクリシュナン、マーガレットワッサーマン、トーマスNarten氏、Basavarajパティル、そしてエリック・フォイトに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC4291] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 4291, February 2006.",
      "ja": "[RFC4291] HindenとR.とS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 4291、2006年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC5213] Gundavelli, S., Ed., Leung, K., Devarapalli, V., Chowdhury, K., and B. Patil, \"Proxy Mobile IPv6\", RFC 5213, August 2008.",
      "ja": "【Ramphsi 5213] gundavelli、S。、ら、Leunji、K.、Devarapalliは、VEの、Chaudhuriの、K.、およびb。パティル、 \"プロキシ・モバイル・20 6\"、rphak 5213 2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5453] Krishnan, S., \"Reserved IPv6 Interface Identifiers\", RFC 5453, February 2009.",
      "ja": "[RFC5453]クリシュナン、S.、 \"予約済みIPv6インタフェース識別子\"、RFC 5453、2009年2月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC4861] Narten, T., Nordmark, E., Simpson, W., and H. Soliman, \"Neighbor Discovery for IP version 6 (IPv6)\", RFC 4861, September 2007.",
      "ja": "[RFC4861] Narten氏、T.、Nordmarkと、E.、シンプソン、W.、およびH.ソリマン、 \"IPバージョン6（IPv6）のための近隣探索\"、RFC 4861、2007年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5342] Eastlake 3rd, D., \"IANA Considerations and IETF Protocol Usage for IEEE 802 Parameters\", BCP 141, RFC 5342, September 2008.",
      "ja": "[RFC5342]イーストレイク3日、D.、 \"IANAの考慮事項およびIEEE 802個のパラメータのためのIETFプロトコルの使用\"、BCP 141、RFC 5342、2008年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC5844] Wakikawa, R. and S. Gundavelli, \"IPv4 Support for Proxy Mobile IPv6\", RFC 5844, May 2010.",
      "ja": "[RFC5844] Wakikawa、R.およびS. Gundavelli、 \"プロキシモバイルIPv6のIPv4サポート\"、RFC 5844、2010年5月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Sri Gundavelli Cisco 170 West Tasman Drive San Jose, CA 95134 USA",
      "ja": "スリGundavelliシスコ170西タスマン・ドライブサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: sgundave@cisco.com",
      "ja": "メールアドレス：sgundave@cisco.com"
    }
  ]
}