{
  "title": {
    "text": "RFC 7410 - A Property Types Registry for the Authentication-Results Header Field",
    "ja": "RFC 7410 - 認証-結果ヘッダーフィールドのためのプロパティタイプレジストリ"
  },
  "number": 7410,
  "created_at": "2019-11-01 18:44:15.041106+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      M. Kucherawy\nRequest for Comments: 7410                                 December 2014\nUpdates: 7001\nCategory: Standards Track\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 1,
      "text": "A Property Types Registry for the Authentication-Results Header Field",
      "ja": "認証-結果ヘッダーフィールドのためのプロパティタイプレジストリ"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 7001 by creating a registry for property types in the Authentication-Results header field, used in email authentication work, rather than limiting participants to using the original, small set of fixed values.",
      "ja": "電子メールの認証作業に使用される認証、結果ヘッダフィールド、プロパティタイプのレジストリを作成するのではなく、固定値の元、小さなセットを使用して参加者を制限することにより、この文書の更新RFC 7001。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7410.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7410で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Updated \"ptype\" Definition  . . . . . . . . . . . . . . . . .   2\n3.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   3\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .   4\n5.  Normative References  . . . . . . . . . . . . . . . . . . . .   5\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   5\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .   5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "[RFC7001] defines the email Authentication-Results header field that presents the results of an authentication effort in a machine-readable format. The header field creates a place to collect the output from authentication processes that are disjoint from later processes that might use the output, such as analysis, filtering, or sorting mechanisms.",
      "ja": "[RFC7001]は、機械可読形式の認証作業の結果を提示する電子メール認証 - 結果ヘッダーフィールドを定義します。ヘッダフィールドは、解析、フィルタリング、又は仕分け機構として出力を使用するかもしれない後の工程、から互いに素で認証プロセスからの出力を収集する場所を作成します。"
    },
    {
      "indent": 3,
      "text": "The specification in that document enumerated a small set of types of properties that can be reported using this mechanism. There has emerged a desire to report types of properties about a message through this mechanism. Accordingly, this document updates the specification to allow for additional property types (\"ptypes\") beyond the original set and creates a registry where new ones can be listed and their defining documents referenced.",
      "ja": "その文書に記載されている仕様は、このメカニズムを使用して報告することができるプロパティのタイプの小さなセットを列挙しました。この機構を介してメッセージに関するプロパティの種類を報告する意欲が浮上しています。したがって、このドキュメントは、元のセット以外の追加プロパティタイプ（「のptype」）を可能にするための仕様を更新し、新しいものを挙げることができ、それらの定義文書が参照されたレジストリを作成します。"
    },
    {
      "indent": 0,
      "text": "2. Updated \"ptype\" Definition",
      "section_title": true,
      "ja": "2.更新「p型」の定義"
    },
    {
      "indent": 3,
      "text": "Advanced Backus Naur Form (ABNF) is defined in [RFC5234].",
      "ja": "高度なバッカスナウア記法（ABNF）[RFC5234]で定義されています。"
    },
    {
      "indent": 3,
      "text": "The ABNF in Section 2.2 of [RFC7001] is updated as follows:",
      "ja": "次のように[RFC7001]のセクション2.2でABNFが更新されます。"
    },
    {
      "indent": 7,
      "text": "ptype = Keyword\n      ; indicates whether the property being evaluated was\n      ; a parameter to an [SMTP] command, was a value taken\n      ; from a message header field, was some property of\n      ; the message body, or was some other property evaluated by\n      ; the receiving Message Transfer Agent (MTA)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The ABNF token \"Keyword\" is defined in Section 4.1.2 of [RFC5321].",
      "ja": "ABNFトークン「キーワードは」[RFC5321]のセクション4.1.2で定義されています。"
    },
    {
      "indent": 3,
      "text": "Legal values of \"ptype\" are as defined in the IANA \"Email Authentication Property Types\" registry (see Section 3). The initial values are as follows, matching those defined in [RFC7001]:",
      "ja": "「p型」の有効な値は、IANAの「電子メール認証プロパティタイプ」レジストリで定義されている通り（セクション3を参照）。初期値は[RFC7001]で定義されたものと一致する、以下の通りです。"
    },
    {
      "indent": 3,
      "text": "body: Indicates information that was extracted from the body of the message. This might be an arbitrary string of bytes, a hash of a string of bytes, a Uniform Resource Identifier, or some other content of interest.",
      "ja": "ボディ：メッセージの本文から抽出した情報を表示します。これは、バイトの任意の文字列、バイトの文字列のハッシュ、統一資源識別子、または関心のある他のコンテンツであるかもしれません。"
    },
    {
      "indent": 3,
      "text": "header: Indicates information that was extracted from the header of the message. This might be the value of a header field or some portion of a header field.",
      "ja": "ヘッダ：メッセージのヘッダから抽出された情報を示します。これは、ヘッダーフィールドの値またはヘッダフィールドの一部であるかもしれません。"
    },
    {
      "indent": 3,
      "text": "policy: A local policy mechanism was applied that augments or overrides the result returned by the authentication mechanism. See Section 2.3 of [RFC7001].",
      "ja": "ポリシー：ローカルポリシーメカニズムが適用された認証メカニズムによって返された結果を補強するか、上書きされます。 [RFC7001]のセクション2.3を参照してください。"
    },
    {
      "indent": 3,
      "text": "smtp: Indicates information that was extracted from an SMTP command that was used to relay the message.",
      "ja": "SMTP：メッセージを中継するために使用されたSMTPコマンドから抽出した情報を示します。"
    },
    {
      "indent": 3,
      "text": "When a consumer of this header field encounters a \"ptype\" that it does not understand, it ignores the result reported with that \"ptype\".",
      "ja": "このヘッダフィールドの消費者はそれが理解していないことを「p型」に遭遇すると、それはその「p型」と報告した結果を無視します。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has created the \"Email Authentication Property Types\" sub-registry within the existing \"Email Authentication Parameters\" registry. Entries in this registry are subject to the Expert Review rules as described in [RFC5226]. Each entry in the registry requires the following values:",
      "ja": "IANAは、既存の「電子メール認証パラメータ」レジストリ内の「電子メール認証プロパティタイプ」サブレジストリを作成しました。このレジストリのエントリは、[RFC5226]で説明したように専門家レビュー規則の対象となります。レジストリの各エントリには、次の値が必要です。"
    },
    {
      "indent": 3,
      "text": "o The \"ptype\" token to be registered, which must fit within the ABNF described in Section 2.",
      "ja": "第2節で説明したABNF内に適合しなければならない「p型」トークン登録する、O。"
    },
    {
      "indent": 3,
      "text": "o A brief description of what sort of information this \"ptype\" is meant to cover.",
      "ja": "この「p型」がカバーするために意図されている情報の種類を簡単に説明O。"
    },
    {
      "indent": 3,
      "text": "o An optional reference to the defining document. This is recommended, but not required.",
      "ja": "定義文書への任意の参照、O。これは推奨しますが、必須ではありません。"
    },
    {
      "indent": 3,
      "text": "The initial entries in this table are as follows, taken from [RFC7001]:",
      "ja": "[RFC7001]から取られ、次のようにこのテーブルの最初のエントリは次のとおりです。"
    },
    {
      "indent": 7,
      "text": "+--------+-------------+----------------------------------------+\n| ptype  | Definition  | Description                            |\n+--------+-------------+----------------------------------------+\n| body   | RFC 7001    | The property being reported was found  |\n|        | Section 2.2 | in the body of the message.            |\n+--------+-------------+----------------------------------------+\n| header | RFC 7001    | The property being reported was found  |\n|        | Section 2.2 | in a header field of the message.      |\n+--------+-------------+----------------------------------------+\n| policy | RFC 7001    | The property being reported relates to |\n|        | Section 2.3 | a locally defined policy.              |\n+--------+-------------+----------------------------------------+\n| smtp   | RFC 7001    | The property being reported is a       |\n|        | Section 2.2 | parameter to an SMTP command used to   |\n|        |             | relay the message.                     |\n+--------+-------------+----------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "For new entries, the Designated Expert needs to assure that the description provided for the new entry adequately describes the intended use. An example would be helpful to include in the entry's defining document, if any, although entries in the \"Email Authentication Methods\" registry or the \"Email Authentication Result Names\" registry might also serve as examples of intended use.",
      "ja": "新しいエントリの場合、指定専門家は、新しいエントリのために提供された説明が十分に意図された用途を説明していることを保証する必要があります。 「電子メール認証方式」レジストリまたは「メール認証結果名」レジストリのエントリはまた、意図された用途の例として役立つかもしれませんが一例では、もしあれば、エントリの定義文書に含めることが役立つだろう。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "It is unknown how legacy code, which expects one of a fixed set of \"ptype\" tokens, will handle new tokens as they begin to appear. There are typically two options: prevent delivery of the message, or ignore those portions of the field that use unknown \"ptype\" tokens and allow processing of the message to continue.",
      "ja": "彼らが現れ始めると、「p型」トークンの固定セットのいずれかを想定し、レガシーコードは、新しいトークンを処理する方法は不明です。 2つのオプションが一般的にあります。メッセージの配信を防止するため、または未知の「p型」トークンを使用するフィールドの部分を無視して、メッセージの処理を継続することができます。"
    },
    {
      "indent": 3,
      "text": "The choice comes down to whether the consumer considers it a threat when there are unknown \"ptypes\" present. The semantics of the report are unknown; the report might be indicating the message is authentic, fraudulent, or that a test failed to complete. The report itself is not actionable because it cannot be understood, and only its presence is certain.",
      "ja": "選択肢がダウンし、消費者が不明である脅威、それを考慮するかどうかになる存在「のptype」。報告書の意味は不明です。報告書では、メッセージが、本物の詐欺、またはテストを完了できなかったことであることを示す可能性があります。それが理解できないため、レポート自体は実用ではなく、唯一その存在は確かです。"
    },
    {
      "indent": 3,
      "text": "Generally, the advice in this situation is to ignore unknown \"ptypes\". It is anticipated that a new property type evaluated by earlier handling agents would also result in the filtering of messages by those agents until consumers can be updated to interpret them.",
      "ja": "一般的に、このような状況でのアドバイスは不明「のptype」を無視することです。消費者がそれを解釈するように更新されるまで、以前のハンドリングエージェントによって評価され、新しいプロパティの型は、また、それらのエージェントによるメッセージのフィルタリングにつながることが予想されます。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "ja": "5.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、2008年5月、<http://www.rfc-editor.org/info/rfc5226> 。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, January 2008, <http://www.rfc-editor.org/info/rfc5234>.",
      "ja": "[RFC5234]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、STD 68、RFC 5234、2008年1月、<http://www.rfc-editor.org/info/rfc5234>。"
    },
    {
      "indent": 3,
      "text": "[RFC5321] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 5321, October 2008, <http://www.rfc-editor.org/info/rfc5321>.",
      "ja": "[RFC5321] Klensin、J.、 \"簡易メール転送プロトコル\"、RFC 5321、2008年10月、<http://www.rfc-editor.org/info/rfc5321>。"
    },
    {
      "indent": 3,
      "text": "[RFC7001] Kucherawy, M., \"Message Header Field for Indicating Message Authentication Status\", RFC 7001, September 2013, <http://www.rfc-editor.org/info/rfc7001>.",
      "ja": "[RFC7001] Kucherawy、M.、 \"メッセージヘッダーフィールドのメッセージ認証ステータスを示すための\"、RFC 7001、2013年9月に、<http://www.rfc-editor.org/info/rfc7001>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The author wishes to acknowledge the following for their review and constructive criticism of this update: Dave Crocker, Tim Draegen, Scott Kitterman, and Franck Martin.",
      "ja": "デイブ・クロッカー、ティムDraegen、スコットKitterman、そしてフランク・マーティン：作者は彼らのレビューとこの更新の建設的な批判のために、次を確認したいです。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Murray S. Kucherawy 270 Upland Drive San Francisco, CA 94127 United States",
      "ja": "マレーS. Kucherawy 270高地ドライブサンフランシスコ、CA 94127米国"
    },
    {
      "indent": 3,
      "text": "EMail: superuser@gmail.com",
      "ja": "メールアドレス：superuser@gmail.com"
    }
  ]
}