{
  "title": {
    "text": "RFC 7431 - Multicast-Only Fast Reroute",
    "ja": "RFC 7431 - マルチキャスト専用高速リルート"
  },
  "number": 7431,
  "created_at": "2019-11-02 02:29:57.220693+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          A. Karan\nRequest for Comments: 7431                                   C. Filsfils\nCategory: Informational                                IJ. Wijnands, Ed.\nISSN: 2070-1721                                      Cisco Systems, Inc.\n                                                             B. Decraene\n                                                                  Orange\n                                                             August 2015",
      "raw": true
    },
    {
      "indent": 22,
      "text": "Multicast-Only Fast Reroute",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "As IPTV deployments grow in number and size, service providers are looking for solutions that minimize the service disruption due to faults in the IP network carrying the packets for these services. This document describes a mechanism for minimizing packet loss in a network when node or link failures occur. Multicast-only Fast Reroute (MoFRR) works by making simple enhancements to multicast routing protocols such as Protocol Independent Multicast (PIM) and Multipoint LDP (mLDP).",
      "ja": "IPTVの展開は、数とサイズが大きくなるにつれて、サービスプロバイダーは、これらのサービスのためのパケットを運ぶIPネットワークの障害へのサービスの中断を最小限に抑えるソリューションを探しています。この文書では、ノードまたはリンクの障害が発生したとき、ネットワーク内のパケット損失を最小限にするための機構を記載しています。マルチキャスト専用高速リルート（MoFRR）は、プロトコル独立マルチキャスト（PIM）とマルチLDP（MLDP）などのルーティングプロトコルをマルチキャストするための簡単な機能強化を行うことによって動作します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7431.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7431で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Conventions Used in This Document ..........................3\n   1.2. Terminology ................................................3\n2. Basic Overview ..................................................4\n3. Determination of the Secondary UMH ..............................5\n   3.1. ECMP-Mode MoFRR ............................................5\n   3.2. Non-ECMP-Mode MoFRR ........................................5\n4. Upstream Multicast Hop Selection ................................6\n   4.1. PIM ........................................................6\n   4.2. mLDP .......................................................6\n5. Detecting Failures ..............................................6\n6. MoFRR Applicability to Dual-Plane Topology ......................7\n7. Other Topologies ...............................................10\n8. Capacity Planning for MoFRR ....................................11\n9. PE Nodes .......................................................11\n10. Other Applications ............................................11\n11. Security Considerations .......................................12\n12. References ....................................................12\n   12.1. Normative References .....................................12\n   12.2. Informative References ...................................12\nAcknowledgments ...................................................13\nContributors ......................................................13\nAuthors' Addresses ................................................14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Different solutions have been developed and deployed to improve service guarantees, both for multicast video traffic and Video on Demand traffic. Most of these solutions are geared towards finding an alternate path around one or more failed network elements (link, node, or path failures).",
      "ja": "別の解決策は、マルチキャストビデオトラフィック用とビデオオンデマンドトラフィックの両方、開発およびサービスの保証を改善するために配備されています。これらのソリューションのほとんどは、一つ以上の障害が発生したネットワーク要素（リンク、ノード、またはパスの障害）の周りに代替パスを見つけるに向けています。"
    },
    {
      "indent": 3,
      "text": "This document describes a mechanism for minimizing packet loss in a network when node or link failures occur. Multicast-only Fast Reroute (MoFRR) works by making simple changes to the way selected routers use multicast protocols such as PIM and mLDP. No changes to the protocols themselves are required. With MoFRR, in many cases, multicast routing protocols don't necessarily have to depend on or have to wait on unicast routing protocols to detect network failures; see Section 5.",
      "ja": "この文書では、ノードまたはリンクの障害が発生したとき、ネットワーク内のパケット損失を最小限にするための機構を記載しています。マルチキャスト専用高速リルート（MoFRR）は、選択したルータは、PIMやMLDPなどのマルチキャストプロトコルを使用する方法の簡単な変更を加えることによって動作します。プロトコルそのものを変更する必要はありません。 MoFRRでは、多くの場合、マルチキャストルーティングプロトコルは、必ずしも依存やネットワーク障害を検出するために、ユニキャストルーティングプロトコルで待機する必要はありません。第5節を参照してください。"
    },
    {
      "indent": 3,
      "text": "On a Merge Point, MoFRR logic determines a primary Upstream Multicast Hop (UMH) and a secondary UMH and joins the tree via both simultaneously. Data packets are received over the primary and secondary paths. Only the packets from the primary UMH are accepted and forwarded down the tree; the packets from the secondary UMH are discarded. The UMH determination is different for PIM and mLDP and explained in Section 4. When a failure is detected on the path to the primary UMH, the repair occurs by changing the secondary UMH into the primary and the primary into the secondary. Since the repair is local, it is fast -- greatly improving convergence times in the event of node or link failures on the path to the primary UMH.",
      "ja": "合流点に、MoFRRロジックは、一次上流マルチキャストホップ（UMH）と二次UMHを決定し、同時に両方を介してツリーに参加します。データパケットは、プライマリおよびセカンダリパスを介して受信されます。プライマリのみUMHからのパケットを受け入れ、ツリーの下に転送されます。二次UMHからのパケットが破棄されます。 UMH判定がPIMとMLDPため異なり、障害が修復は、一次および二次に一次に二次UMHを変化させることによって生じる、原発UMHへのパスで検出された場合、セクション4で説明します。修復がローカルであるので、高速である - 大幅プライマリUMHへの経路上のノードまたはリンク障害が発生した場合に収束時間を改善します。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.1。このドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.2. Terminology",
      "section_title": true,
      "ja": "1.2。用語"
    },
    {
      "indent": 3,
      "text": "MoFRR: Multicast-only Fast Reroute.",
      "ja": "MoFRR：マルチキャスト専用高速リルート。"
    },
    {
      "indent": 3,
      "text": "ECMP: Equal-Cost Multipath.",
      "ja": "ECMP：等価コストマルチパス。"
    },
    {
      "indent": 3,
      "text": "mLDP: Multipoint Label Distribution Protocol.",
      "ja": "MLDP：マルチラベル配布プロトコル。"
    },
    {
      "indent": 3,
      "text": "PIM: Protocol Independent Multicast.",
      "ja": "PIM：プロトコル独立マルチキャスト。"
    },
    {
      "indent": 3,
      "text": "UMH: Upstream Multicast Hop. A candidate next-hop that can be used to reach the root of the tree.",
      "ja": "UMH：上流マルチキャストホップ。ツリーのルートに到達するために使用することができ、次ホップ候補。"
    },
    {
      "indent": 3,
      "text": "tree: Either a PIM (S,G)/(*,G) tree or an mLDP Point-to-Multipoint (P2MP) or Multipoint-to-Multipoint (MP2MP) LSP.",
      "ja": "ツリー：PIM（S、G）/（*、G）ツリー又はMLDPポイントツーマルチポイント（P2MP）または多対多（MP2MP）LSPのいずれか。"
    },
    {
      "indent": 3,
      "text": "OIF: Outgoing interface. An interface used to forward multicast packets down the tree towards the receivers. Either a PIM (S,G)/(*,G) tree or an mLDP P2MP or MP2MP LSP.",
      "ja": "OIF：発信インターフェイス。インターフェイスは、受信機に向けたツリーの下マルチキャストパケットを転送するために使用します。いずれかのPIM（S、G）/（*、G）ツリー又はMLDP P2MP又はMP2MP LSP。"
    },
    {
      "indent": 3,
      "text": "LFA: Loop-Free Alternate as defined in [RFC5286]. In unicast Fast Reroute, this is an alternate next-hop that can be used to reach a unicast destination without using the protected link or node.",
      "ja": "LFA：[RFC5286]で定義され、ループのない代替。ユニキャスト高速リルートでは、これは、保護されたリンクまたはノードを使用せずに、ユニキャスト宛先に到達するために使用することができる代替のネクストホップです。"
    },
    {
      "indent": 3,
      "text": "Merge Point: A router that joins a multicast stream via two divergent upstream paths.",
      "ja": "2つの分岐し、上流経路を介してマルチキャストストリームに参加するルータ：ポイントをマージします。"
    },
    {
      "indent": 3,
      "text": "RPF: Reverse Path Forwarding.",
      "ja": "RPF：パス転送を逆にします。"
    },
    {
      "indent": 3,
      "text": "RP: Rendezvous Point.",
      "ja": "RP：ランデブーポイント。"
    },
    {
      "indent": 3,
      "text": "LSP: Label Switched Path.",
      "ja": "LSP：ラベルスイッチパス。"
    },
    {
      "indent": 3,
      "text": "LSR: Label Switching Router.",
      "ja": "LSR：ラベルスイッチングルータ。"
    },
    {
      "indent": 3,
      "text": "BFD: Bidirectional Forwarding Detection.",
      "ja": "BFD：双方向フォワーディング検出。"
    },
    {
      "indent": 3,
      "text": "IGP: Interior Gateway Protocol.",
      "ja": "IGP：インテリアゲートウェイプロトコル。"
    },
    {
      "indent": 3,
      "text": "MVPN: Multicast Virtual Private Network.",
      "ja": "MVPN：マルチキャストバーチャルプライベートネットワーク。"
    },
    {
      "indent": 3,
      "text": "POP: Point Of Presence, an access point into the network.",
      "ja": "POP：存在のポイント、ネットワークへのアクセスポイント。"
    },
    {
      "indent": 0,
      "text": "2. Basic Overview",
      "section_title": true,
      "ja": "2.基本的な概要"
    },
    {
      "indent": 3,
      "text": "The basic idea of MoFRR is for a Merge Point router to join a multicast tree via two divergent upstream paths in order to get maximum redundancy. The determination of this alternate upstream is defined in Section 3.",
      "ja": "MoFRRの基本的な考え方は、最大の冗長性を得るために2つの分岐し、上流経路を介してマルチキャストツリーに参加する合流点ルータのためです。この代替上流の決定は、セクション3で定義されています。"
    },
    {
      "indent": 3,
      "text": "In order to maximize robustness against any failure, the two paths should be as diverse as possible. Ideally, they should not merge upstream. Sometimes the topology guarantees maximal redundancy; other times additional configuration or techniques are needed to enforce it. See Section 6 for more discussion on the applicability of MoFRR depending on the network topology.",
      "ja": "故障に対するロバスト性を最大にするために、2つの経路が可能な限り多様であるべきです。理想的には、彼らは上流合併べきではありません。時にはトポロジは、最大の冗長性を保証します。他の回の追加の設定や技術は、それを強制するために必要とされています。ネットワークトポロジに応じて、MoFRRの適用性に関する詳細な議論については、セクション6を参照してください。"
    },
    {
      "indent": 3,
      "text": "A Merge Point router should only accept and forward on one of the upstream paths at a time in order to avoid duplicate packet forwarding. The selection of the primary and secondary UMH is done by the MoFRR logic and normally based on unicast routing to find loop-free candidates. This is described in Section 4.",
      "ja": "合流点ルータにのみ受け入れ、重複パケット転送を避けるために、一度に上流のいずれかのパスに転送する必要があります。一次および二次UMHの選択はMoFRRロジックによって行われ、通常はループのない候補を見つけるために、ユニキャストルーティングに基づいています。これは、セクション4に記載されています。"
    },
    {
      "indent": 3,
      "text": "Note, the impact of an additional amount of data on the network is mitigated when tree membership is densely populated. When a part of the network has redundant data flowing, join latency for new joining members is reduced because it's likely a tree Merge Point is not far away.",
      "ja": "ツリーメンバーシップが密集されている場合、ネットワーク上のデータの追加量の影響が緩和され、注意してください。ネットワークの一部が流れる冗長なデータを持っている場合、それは木のマージポイントが遠く離れていない可能性がありますので、新加入メンバーのための待ち時間が軽減される参加。"
    },
    {
      "indent": 0,
      "text": "3. Determination of the Secondary UMH",
      "section_title": true,
      "ja": "二UMH 3.決定"
    },
    {
      "indent": 3,
      "text": "The secondary UMH is a Loop-Free Alternate (LFA) as per [RFC5286].",
      "ja": "二次UMHは[RFC5286]に従ってループのない代替（LFA）です。"
    },
    {
      "indent": 0,
      "text": "3.1. ECMP-Mode MoFRR",
      "section_title": true,
      "ja": "3.1。 ECMPモードMoFRR"
    },
    {
      "indent": 3,
      "text": "If the IGP installs two ECMP paths to the source, then as per [RFC5286] the LFA is a primary next-hop. If the multicast tree is enabled for ECMP-mode MoFRR, the router installs the paths as primary and secondary UMHs. Before the failure, only packets received from the primary UMH path are processed, while packets received from the secondary UMH are dropped.",
      "ja": "IGPは、ソースへの2つのECMPパスをインストールする場合は、[RFC5286]に従ってLFAプライマリネクストホップです。マルチキャストツリーはECMPモードMoFRRのために有効になっている場合、ルータは、プライマリおよびセカンダリUMHSとしてパスをインストールします。二次UMHから受信したパケットは廃棄されながら、故障前に、唯一の主要UMH路から受信したパケットは、処理されます。"
    },
    {
      "indent": 3,
      "text": "The selected primary UMH SHOULD be the same as if the MoFRR extension were not enabled.",
      "ja": "選択された主なUMHはMoFRR拡張機能が有効になっていなかった場合と同じである必要があります。"
    },
    {
      "indent": 3,
      "text": "If more than two ECMP paths exist, one is selected as primary and another as secondary UMH. The selection of the primary and secondary is a local decision. Information from the IGP link-state topology could be leveraged to optimize this selection such that the primary and secondary paths are maximal divergent and don't lead to the same upstream node. Note that MoFRR does not restrict the number of UMH paths that are joined. Implementations may use as many paths as are configured.",
      "ja": "二つ以上のECMPパスが存在する場合、一方は一次および二次UMHような別として選択されます。プライマリとセカンダリの選択はローカル決定です。 IGPリンク状態トポロジーからの情報は、プライマリおよびセカンダリパスが最大発散であり、同一の上流のノードをもたらさないように、この選択を最適化するために活用することができます。 MoFRRが接合さUMH経路の数を制限しないことに留意されたいです。設定されているような実装は、多くの経路を使用することができます。"
    },
    {
      "indent": 0,
      "text": "3.2. Non-ECMP-Mode MoFRR",
      "section_title": true,
      "ja": "3.2。非ECMPモードMoFRR"
    },
    {
      "indent": 3,
      "text": "A router X configured for non-ECMP-mode MoFRR for a multicast tree joins a primary path to its primary UMH and a secondary path to its LFA UMH. In order to prevent control-plane loops, a router MUST stop joining the secondary UMH if this UMH is the only member in the OIF list.",
      "ja": "マルチキャストツリーのための非ECMPモードMoFRR用に構成ルータXは、プライマリUMHとLFA UMHに二次経路へのプライマリパスに合流します。このUMHはOIFリスト内の唯一のメンバーである場合、制御プレーンのループを防ぐために、ルータは、二次UMHに参加停止しなければなりません。"
    },
    {
      "indent": 3,
      "text": "To illustrate the reason for this rule, let's consider the example in Figure 3. If two Provider Edge routers, PE1 and PE2, have received an IGMP request for a multicast tree, they will both join the primary path on their plane and a secondary path to the neighbor PE. If their receivers leave at the same time, it's possible for the multicast tree on PE1 and PE2 to never get deleted, as the PEs refresh each other via the secondary path joins (remember that a secondary path join is not distinguishable from a primary join).",
      "ja": "2つのプロバイダーエッジルータ、PE1およびPE2は、マルチキャストツリーのためのIGMP要求を受けた場合の、図3の例を考えてみましょう、このルールの理由を説明するために、彼らは両方とも彼らの平面とセカンダリパス上のプライマリパスに参加します隣人PEへ。その受信機が同時にままにした場合、それはPEがジョイン二次パスを介して互いを更新して（二次パスが参加することを覚えている主な参加区別はありません）、削除されることはありません飽きないためにPE1とPE2上のマルチキャストツリーのために可能です。"
    },
    {
      "indent": 0,
      "text": "4. Upstream Multicast Hop Selection",
      "section_title": true,
      "ja": "4.上流マルチキャストホップの選択"
    },
    {
      "indent": 3,
      "text": "An Upstream Multicast Hop (UMH) is a candidate next-hop that can be used to reach the root of the tree. This is normally based on unicast routing to find loop-free candidate(s). With MoFRR procedures, we select a primary and a backup UMH. The procedures for determining the UMH are different for PIM and mLDP.",
      "ja": "上流マルチキャストホップ（UMH）ツリーのルートに到達するために使用することができる次ホップ候補です。これは通常、ループのない候補（単数または複数）を見つけるために、ユニキャストルーティングに基づいています。 MoFRR手順により、我々は、プライマリおよびバックアップUMHを選択します。 UMHを決定するための手順は、PIMとMLDPのために異なっています。"
    },
    {
      "indent": 0,
      "text": "4.1. PIM",
      "section_title": true,
      "ja": "4.1。 PIM"
    },
    {
      "indent": 3,
      "text": "The UMH selection in PIM is also known as the Reverse Path Forwarding (RPF) procedure. Based on a unicast route lookup on either the source address or Rendezvous Point (RP) [RFC4601], an upstream interface is selected for sending the PIM Joins/Prunes AND accepting the multicast packets. The interface the packets are received on is used to pass or fail the RPF check. If packets are received on an interface that was not selected as the primary by the RPF procedure, the packets are discarded.",
      "ja": "PIMにUMH選択は、逆パス転送（RPF）手順として知られています。ソースアドレスまたはランデブーポイント（RP）のいずれかのユニキャスト経路探索[RFC4601]に基づいて、上流インタフェースがPIMジョイン/プルーンとマルチキャストパケットを受け入れるを送信するために選択されます。パケットが受信されたインターフェイスは、合格またはRPFチェックに失敗するために使用されます。パケットはRPF手順により一次として選択されなかったインターフェイスで受信された場合、パケットは廃棄されます。"
    },
    {
      "indent": 0,
      "text": "4.2. mLDP",
      "section_title": true,
      "ja": "4.2。 MLDP"
    },
    {
      "indent": 3,
      "text": "The UMH selection in mLDP also depends on unicast routing, but the difference from PIM is that the acceptance of multicast packets is based on MPLS labels and is independent of the interface on which the packet is received. Using the procedures as defined in [RFC6388], an upstream Label Switching Router (LSR) is elected. The upstream LSR that was elected for a Label Switched Path (LSP) gets a unique local MPLS label allocated. Multicast packets are only forwarded if the MPLS label matches the MPLS label that was allocated for that LSP's (primary) upstream LSR.",
      "ja": "MLDPにUMH選択はまた、ユニキャストルーティングに依存するが、PIMとの差がマルチキャストパケットの受付がMPLSラベルに基づいていることであり、パケットが受信されたインターフェイスとは無関係です。 [RFC6388]で定義されるような手順を使用して、ルータ（LSR）を上流のラベルスイッチが選出されます。ラベルスイッチパス（LSP）のために選出された上流のLSRは、割り当てられた一意のローカルMPLSラベルを取得します。 MPLSラベルは、そのLSPの（一次）上流のLSR用に割り当てられたMPLSラベルと一致した場合、マルチキャストパケットにのみ転送されます。"
    },
    {
      "indent": 0,
      "text": "5. Detecting Failures",
      "section_title": true,
      "ja": "5.検出の失敗"
    },
    {
      "indent": 3,
      "text": "Once the two paths are established, the next step is detecting a failure on the primary path to know when to switch to the backup path. This is a local issue, but this section explores some possibilities.",
      "ja": "二つの経路が確立されると、次のステップでは、ときにバックアップ経路に切り替えることを知っているプラ​​イマリパスに障害が検出されます。これは、ローカルな問題であるが、このセクションでは、いくつかの可能性を探ります。"
    },
    {
      "indent": 3,
      "text": "The first (and simplest) option is to detect the failure of the local interface as it's done for unicast Fast Reroute. Detection can be performed using the loss of signal or the loss of probing packets (e.g., BFD). This option can be used in combination with the other options as documented below. Just like for unicast fast reroute, 50 msec switchover is possible.",
      "ja": "最初の（最も単純な）オプションは、ユニキャスト高速リルートのために行うのようなローカルインタフェースの故障を検出することです。検出は、信号の損失又はプロービングパケットの損失（例えば、BFD）を用いて行うことができます。以下の文書化されているように、このオプションは他のオプションと組み合わせて使用​​することができます。ただ、ユニキャストの高速再ルーティングのためのように、50ミリ秒の切り替えが可能です。"
    },
    {
      "indent": 3,
      "text": "A second option consists of comparing the packets received on the primary and secondary streams but only forwarding one of them -- the first one received, no matter which interface it is received on. Zero packet loss is possible for RTP-based streams.",
      "ja": "第2のオプションは、パケットを比較することから成る一次および二次ストリーム上で受信されただけそれらのいずれかを転送 - 最初のものは、受信され、それは上で受信されるインタフェースに関係なく。ゼロパケットロスがRTPベースのストリームが可能です。"
    },
    {
      "indent": 3,
      "text": "A third option assumes a minimum known packet rate for a given data stream. If a packet is not received on the primary RPF within this time frame, the router assumes primary path failure and switches to the secondary RPF interface. 50 msec switchover may be possible for high-rate streams (e.g., IPTV where SD video has a continuous inter-packet gap of about 3 msec), but in general the delay is dependent on the rate of the multicast stream.",
      "ja": "第三の選択肢は、与えられたデータストリームのための最小の既知のパケットレートを想定しています。パケットがこの時間枠内でプライマリRPFに受信されない場合、ルータは、プライマリパスの障害を想定し、二次RPFインターフェースに切り替わります。 50ミリ秒の切り替えが可能である高速ストリームのため（例えば、SD映像は、約3ミリ秒の連続パケット間ギャップを有するIPTV）、一般的には遅延がマルチキャストストリームのレートに依存します。"
    },
    {
      "indent": 3,
      "text": "A fourth option leverages the significant improvements of the IGP convergence speed. When the primary path to the source is withdrawn by the IGP, the MoFRR-enabled router switches over to the backup path, and the UMH is changed to the secondary UMH. Since the secondary path is already in place, and assuming it is disjoint from the primary path, convergence times would not include the time required to build a new tree and hence are smaller. Sub-second to sub-200 msec switchover should be possible.",
      "ja": "4番目のオプションは、IGPの収束速度の大幅な向上を活用しています。ソースへのプライマリパスがIGPによって引き出されるとき、MoFRR対応ルータは、バックアップ経路に切り替え、そしてUMHセカンダリUMHに変更されます。セカンダリパスが所定の位置にすでにあり、それがプライマリパスと共通部分を持たないと仮定しているので、収束時間は、新しいツリーを構築し、それゆえ小さいために必要な時間は含まれません。サブ200ミリ秒の切り替えサブ秒が可能であるべきです。"
    },
    {
      "indent": 0,
      "text": "6. MoFRR Applicability to Dual-Plane Topology",
      "section_title": true,
      "ja": "デュアルプレーントポロジ6. MoFRR適用"
    },
    {
      "indent": 3,
      "text": "MoFRR applicability is topology dependent. The applicability is the same as LFA FRR, which is discussed in [RFC6571].",
      "ja": "MoFRR適用は、トポロジ依存しています。適用は、[RFC6571]に記載されているLFA FRRと同じです。"
    },
    {
      "indent": 3,
      "text": "The following section will discuss MoFRR applicability to dual-plane network topologies.",
      "ja": "次のセクションでは、デュアルプレーンのネットワークトポロジにMoFRR適用可能性を説明します。"
    },
    {
      "indent": 3,
      "text": "MoFRR works best in dual-planes topologies as illustrated in the figures below. MoFRR may be enabled on any router in the network. In the figures below, MoFRR is shown enabled on the Provider Edge (PE) routers to illustrate one way in which the technology may be deployed.",
      "ja": "MoFRR以下の図に示すように、デュアルプレーン・トポロジーで最適に動作します。 MoFRRは、ネットワーク内のすべてのルータで有効にすることができます。以下の図において、MoFRRは技術が展開することができる1つの方法を説明するためにプロバイダエッジ（PE）ルータで有効になって示されています。"
    },
    {
      "indent": 18,
      "text": "          S\n    P    / \\ P\n        /   \\\n ^    G1     R1  ^\n P    /       \\  P\n     /         \\\n    G2----------R2   ^\n    | \\         | \\  P\n^   |  \\        |  \\\nP   |   G3----------R3\n    |    |      |    |\n    |    |      |    | ^\n    G4---|------R4   | P\n  ^   \\  |        \\  |\n  P    \\ |         \\ |\n        G5----------R5\n    ^   |           | ^\n    P   |           | P\n        |           |\n       Gi           Ri\n        \\ \\__    ^  /|\n         \\   \\   S1/ | ^\n        ^ \\  ^\\   /  |P2\n        P1 \\ S2\\_/__ |\n            \\   /   \\|\n             PE1     PE2",
      "raw": true
    },
    {
      "indent": 7,
      "text": "P = Primary path S = Secondary path",
      "ja": "P =プライマリパスS =セカンダリパス"
    },
    {
      "indent": 11,
      "text": "Figure 1: Two-Plane Network Design",
      "ja": "図1：2面ネットワーク設計"
    },
    {
      "indent": 3,
      "text": "The topology has two planes, a primary plane and a secondary plane that are fully disjoint from each other all the way into the POPs. This two-plane design is common in service provider networks as it eliminates single point of failures in their core network. The links marked P indicate the normal (primary) path of how the PIM Joins flow from the POPs towards the source of the network. Multicast streams, especially for the densely watched channels, typically flow along both the planes in the network anyway.",
      "ja": "トポロジは、二つの面、すべての方法のPOPに互いから完全に互いに素で主要面と第二面を有しています。それは彼らのコアネットワーク内の単一障害点を排除し、この2面のデザインは、サービスプロバイダーネットワークでは一般的です。 PとマークリンクはPIMネットワークのソースに向かってのPOPからの流れを結合する方法の通常の（一次）パスを示しています。マルチキャストは、典型的には、いずれにせよ、ネットワーク内の両方の面に沿って流れ、特に密視聴チャンネルについて、ストリーム。"
    },
    {
      "indent": 3,
      "text": "The only change MoFRR adds to this is on the links marked S where the PE routers join a secondary path to their secondary ECMP UMH. As a result of this, each PE router receives two copies of the same stream, one from the primary plane and the other from the secondary plane. As a result of normal UMH behavior, the multicast stream received over the primary path is accepted and forwarded to the downstream receivers. The copy of the stream received from the secondary UMH is discarded.",
      "ja": "MoFRRはこれに追加されます唯一の変更は、リンクがPEルータはその二ECMP UMHへの二次パスに参加Sをマークです。この結果、各PEルータは、同じストリームの2つのコピー、主平面からの1つおよび二面から他方を受信します。通常UMH行動の結果として、プライマリパスを介して受信したマルチキャストストリームが受け入れられ、下流の受信機に転送されます。二次UMHから受信したストリームのコピーが破棄されます。"
    },
    {
      "indent": 3,
      "text": "When a router detects a routing failure on the path to its primary UMH, it will switch to the secondary UMH and accept packets for that stream. If the failure is repaired, the router may switch back. The primary and secondary UMHs have only local context and not end-to-end context.",
      "ja": "ルータがプライマリUMHへのパス上のルーティングエラーを検出した場合、それは二次UMHに切り替えて、そのストリームのパケットを受け入れます。障害が修復された場合、ルータはスイッチバックがあります。プライマリおよびセカンダリUMHSは、ローカルコンテキストを持っており、エンド・ツー・エンドではない状況。"
    },
    {
      "indent": 3,
      "text": "As one can see, MoFRR achieves the faster convergence by pre-building the secondary multicast tree and receiving the traffic on that secondary path. The example discussed above is a simple case where there are two ECMP paths from each PE device towards the source, one along the primary plane and one along the secondary. In cases where the topology is asymmetric or is a ring, this ECMP nature does not hold, and additional rules have to be taken into account to choose when and where to join the secondary path.",
      "ja": "1が見ることができるように、MoFRRは二マルチキャストツリーを事前に構築し、そのセカンダリパス上のトラフィックを受信することにより、より高速な収束を実現します。上述の例では、ソースに向かって各PEデバイス、主要面に沿って及び第二に沿ってから二ECMPパスがある単純な場合です。トポロジーが非対称であるか環である場合には、このECMPの性質は保持していない、と追加ルールは、いつ、どこで、二次パスに参加することを選択することを考慮しなければなりません。"
    },
    {
      "indent": 3,
      "text": "MoFRR is appealing in such topologies for the following reasons:",
      "ja": "MoFRRは、次の理由のために、このようなトポロジに魅力的です："
    },
    {
      "indent": 3,
      "text": "1. Ease of deployment and simplicity: the functionality is only required on the PE devices, although it may be configured on all routers in the topology. Furthermore, each PE device can be enabled separately; there is no need for network-wide coordination in order to deploy MoFRR. Interoperability testing is not required as there are no PIM or mLDP protocol changes.",
      "ja": "展開および簡潔の1やすさ：これは、トポロジ内のすべてのルータに設定されてもよい機能のみ、PEデバイスに必要とされます。また、各PEデバイスが別々に有効にすることができます。 MoFRRを展開するために、ネットワーク全体の調整の必要はありません。何のPIMまたはMLDPプロトコル変更がないとの相互運用性テストは必要ありません。"
    },
    {
      "indent": 3,
      "text": "2. End-to-end failure detection and recovery: any failure along the path from the source to the PE can be detected and repaired with the secondary disjoint stream. (See the second, third, and fourth options in Section 5.)",
      "ja": "2.エンドツーエンド障害検出および回復：PEのソースからの経路に沿った任意の障害が二次互いに素ストリームを用いて検出し、修復することができます。 （第5の第2、第3、及び第四のオプションを参照してください）"
    },
    {
      "indent": 3,
      "text": "3. Capacity efficiency: as illustrated in the previous example, the multicast trees corresponding to IPTV channels cover the backbone and distribution topology in a very dense manner. As a consequence, the secondary path grafts onto the normal multicast trees (i.e., trees signaled by PIM or mLDP without the MoFRR extension) at the aggregation level and hence does not demand any extra capacity either on the distribution links or in the backbone. The secondary path simply uses the capacity that is normally used, without any duplication. This is different from conventional FRR mechanisms that often duplicate the capacity requirements when the backup path crosses links/nodes that already carry the primary/normal tree, and thus twice as much capacity is required.",
      "ja": "3.容量効率：前の例に示すように、IPTVチャネルに対応するマルチキャストツリーは非常に密な方法でバックボーンおよび分配トポロジーを覆います。その結果、二次パスは、集約レベルで正常なマルチキャストツリー（MoFRR拡張子なしPIMまたはMLDPによってシグナリング即ち、木）上にグラフトひいては分布リンクまたはバックボーンのいずれか余分な容量を必要としません。セカンダリパスは単に重複することなく、通常使用される容量を使用します。これは、バックアップパスが既にプライマリ/正常ツリーを運ぶリンク/ノードを横切り、従って、二倍の容量が必要とされる場合、しばしば、容量要件を複製従来FRRメカニズムは異なっています。"
    },
    {
      "indent": 3,
      "text": "4. Loop-free: the secondary path join is sent on an ECMP disjoint path. By definition, the neighbor receiving this request is closer to the source and hence will not cause a loop.",
      "ja": "4.ループフリー：二次パスがECMP独立経路上で送信される参加。定義では、この要求を受けた隣人は、ソースに近いので、ループは発生しません。"
    },
    {
      "indent": 3,
      "text": "The topology we just analyzed is very frequent and can be modeled as per Figure 2. The PE has two ECMP disjoint paths to the source. Each ECMP path uses a disjoint plane of the network.",
      "ja": "先ほど分析トポロジは非常に頻繁であり、PEは、ソースへの2つのECMPの互いに素な経路を有する図2に従ってモデル化することができます。各ECMPパスがネットワークの互いに素な平面を使用します。"
    },
    {
      "indent": 24,
      "text": "    Source\n    /    \\\nPlane1  Plane2\n   |      |\n   A1    A2\n     \\  /\n      PE",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Figure 2: PE is Dual-Homed to Dual-Plane Backbone",
      "ja": "図2：PEデュアルプレーンバックボーンにデュアルホームれます"
    },
    {
      "indent": 3,
      "text": "Another frequent topology is described in Figure 3. PEs are grouped by pairs. In each pair, each PE is connected to a different plane. Each PE has one single shortest-path to a source (via its connected plane). There is no ECMP like in Figure 2. However, there is clearly a way to provide MoFRR benefits as each PE can offer a disjoint secondary path to the PE in the other plane (via the disjoint path).",
      "ja": "別の頻繁なトポロジは3 PEがペアでグループ化され、図に記載されています。各対において、各PEは、異なるプレーンに接続されています。各PEは、（その接続面を介して）ソースへの単一の最短パスを有します。何ECMPは、各PEは、（独立経路を介して）他の平面内にPEにばらばら二次経路を提供することができるようMoFRR利点を提供する方法が明らかに存在する。しかし、図2のようなものは存在しません。"
    },
    {
      "indent": 3,
      "text": "The MoFRR secondary neighbor selection process needs to be extended in this case as one cannot simply rely on using an ECMP path as secondary neighbor. This extension is referred to as non-ECMP-mode MoFRR and is described in Section 3.2.",
      "ja": "MoFRR二ネイバー選択プロセスは1つが単に二次ネイバーとしてECMPパスの使用に頼ることができないように、この場合に拡張する必要があります。この拡張は、非ECMPモードMoFRRと呼ばれ、セクション3.2に記載されています。"
    },
    {
      "indent": 24,
      "text": "    Source\n    /    \\\nPlane1  Plane2\n   |      |\n   A1    A2\n   |      |\n  PE1----PE2",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Figure 3: PEs Are Connected in Pairs to Dual-Plane Backbone",
      "ja": "図3：のPEは、デュアルプレーンバックボーンへのペアに接続されています"
    },
    {
      "indent": 0,
      "text": "7. Other Topologies",
      "section_title": true,
      "ja": "7.その他のトポロジ"
    },
    {
      "indent": 3,
      "text": "As mentioned in Section 6, MoFRR works best in dual-plane topologies. If MoFRR is applied to non-dual-plane networks, it's possible that the secondary path is affected by the same failure that affected the primary path. In that case, there is no guarantee that the backup path will provide an uninterrupted traffic flow of packets without loss or duplication.",
      "ja": "第6節で述べたように、MoFRRは、デュアルプレーン・トポロジーで最適に動作します。 MoFRRは、非デュアルプレーンのネットワークに適用されている場合は、セカンダリパスがプライマリパスに影響を与えた同じ障害の影響を受けている可能性があります。その場合には、バックアップパスが損失または重複することなく、パケットの中断のないトラフィックフローを提供することを保証するものではありません。"
    },
    {
      "indent": 0,
      "text": "8. Capacity Planning for MoFRR",
      "section_title": true,
      "ja": "MoFRR 8.キャパシティプランニング"
    },
    {
      "indent": 3,
      "text": "The previous section has described two very frequent designs (Figures 2 and 3) which provide maximum MoFRR benefits.",
      "ja": "前のセクションでは、2つの非常に頻繁な設計最大MoFRRの利点を提供する（図2及び3）に記載されています。"
    },
    {
      "indent": 3,
      "text": "Designers with topologies different than Figures 2 and 3 can still benefit from MoFRR, thanks to the use of capacity planning tools.",
      "ja": "図2と図3とは異なるトポロジを持つデザイナーが、まだ、MoFRRからキャパシティプランニングツールの使用のおかげで恩恵を受けることができます。"
    },
    {
      "indent": 3,
      "text": "Such tools are able to simulate the ability of each PE to build two disjoint branches of the same tree. This simulation could be for hundreds of PEs and hundreds of sources.",
      "ja": "このようなツールは、同じツリーの2本の互いに素の枝を構築するために、各PEの能力をシミュレートすることができます。このシミュレーションは、PEの数百人と情報源の何百ものためである可能性があります。"
    },
    {
      "indent": 3,
      "text": "This allows an assessment of the MoFRR protection coverage of a given network, for a set of sources.",
      "ja": "これは、ソースのセットのために、与えられたネットワークのMoFRR保護範囲の評価を可能にします。"
    },
    {
      "indent": 3,
      "text": "If the protection coverage is deemed insufficient, the designer can use such a tool to optimize the topology (add links, change IGP metrics).",
      "ja": "保護カバーが不十分と判断される場合には、設計者が（IGPメトリックを変更するには、リンクを追加）トポロジーを最適化するために、このようなツールを使用することができます。"
    },
    {
      "indent": 0,
      "text": "9. PE Nodes",
      "section_title": true,
      "ja": "9.ノード"
    },
    {
      "indent": 3,
      "text": "Many Service Providers devise their topology such that PEs have disjoint paths to the multicast sources. MoFRR leverages the existence of these disjoint paths without any PIM or mLDP protocol modification. Interoperability testing is thus not required. In such topologies, MoFRR only needs to be deployed on the PE devices. Each PE device can be enabled one by one.",
      "ja": "多くのサービスプロバイダーは、PEがマルチキャストソースへのばらばらのパスを持っているように、それらのトポロジーを考案します。 MoFRRは、任意のPIMまたはMLDPプロトコル修正することなく、これらの互いに素な経路の存在を活用します。相互運用性テストは、このように必要とされていません。このようなトポロジーでは、MoFRRは、PEデバイス上に配備する必要があります。各PEデバイスは、一つ一つを有効にすることができます。"
    },
    {
      "indent": 0,
      "text": "10. Other Applications",
      "section_title": true,
      "ja": "10.その他のアプリケーション"
    },
    {
      "indent": 3,
      "text": "While all the examples in this document show the MoFRR applicability on PE devices, it is clear that MoFRR could be enabled on aggregation or core routers.",
      "ja": "このドキュメントのすべての例は、PEデバイス上MoFRRの適用性を示しているが、MoFRRが凝集やコアルータ上で有効にすることができることは明らかです。"
    },
    {
      "indent": 3,
      "text": "MoFRR can be popular in data center network configurations. With the advent of lower-cost Ethernet and increasing port density in routers, there is more meshed connectivity than ever before. When using a three-level access, distribution, and core layers in a data center, there is a lot of inexpensive bandwidth connecting the layers. This will lend itself to more opportunities for ECMP paths at multiple layers. This allows for multiple layers of redundancy protecting link and node failure at each layer with minimal redundancy cost.",
      "ja": "MoFRRは、データセンターのネットワーク構成に人気があることができます。低コストのイーサネットの出現によりルータにポート密度を高め、これまで以上にメッシュ接続があります。データセンター内の3レベルのアクセス、配信、およびコア層を使用する場合、層を接続する安価な多くの帯域幅があります。これは、複数の層でECMPパスのためのより多くの機会に自分自身を貸すだろう。これは、最小の冗長コストで各レイヤのリンクとノードの障害を保護する冗長性の複数の層を可能にします。"
    },
    {
      "indent": 3,
      "text": "Redundancy costs are reduced because only one packet is forwarded at every link along the primary and secondary data paths so there is no duplication of data on any link thereby providing make-before-break protection at a very small cost.",
      "ja": "これにより、非常に少ないコストで作る・ビフォア・ブレーク保護を提供する任意のリンク上のデータが重複がないように、一つのパケットのみがプライマリとセカンダリのデータパスに沿ったすべてのリンクで転送されるため、冗長性のコストが削減されます。"
    },
    {
      "indent": 3,
      "text": "A MoFRR router only accepts packets from the primary path and discards packets from the secondary path. For that reason, management applications (like ping and mtrace) will not work when verifying the secondary path.",
      "ja": "MoFRRルータは、プライマリパスからのパケットを受け入れ、二次経路からのパケットを廃棄します。二次パスを検証する際にそのため、（pingやMTRACEなど）管理アプリケーションは動作しません。"
    },
    {
      "indent": 3,
      "text": "The MoFRR principle may be applied to MVPNs.",
      "ja": "MoFRR原理はMVPNsに適用することができます。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no security considerations for this design other than what is already in the main PIM specification [RFC4601] and mLDP specification [RFC6388].",
      "ja": "[RFC4601]とMLDP仕様[RFC6388]メインPIM仕様で、すでにあるもの以外に、このデザインには、セキュリティの考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "12. References",
      "section_title": true,
      "ja": "12.参考文献"
    },
    {
      "indent": 0,
      "text": "12.1. Normative References",
      "section_title": true,
      "ja": "12.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC5286] Atlas, A., Ed., and A. Zinin, Ed., \"Basic Specification for IP Fast Reroute: Loop-Free Alternates\", RFC 5286, DOI 10.17487/RFC5286, September 2008, <http://www.rfc-editor.org/info/rfc5286>.",
      "ja": "[RFC5286]アトラス、A.、エド、およびA.ジニン、エド、。。 \"IP高速リルートのための基本仕様：ループフリーのAlternates\"、RFC 5286、DOI 10.17487 / RFC5286、2008年9月、<のhttp：// WWW .rfc-editor.org /情報/ rfc5286>。"
    },
    {
      "indent": 0,
      "text": "12.2. Informative References",
      "section_title": true,
      "ja": "12.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC4601] Fenner, B., Handley, M., Holbrook, H., and I. Kouvelas, \"Protocol Independent Multicast - Sparse Mode (PIM-SM): Protocol Specification (Revised)\", RFC 4601, DOI 10.17487/RFC4601, August 2006, <http://www.rfc-editor.org/info/rfc4601>.",
      "ja": "[RFC4601]フェナー、B.、ハンドレー、M.、ホルブルック、H.、およびI. Kouvelas、 \"プロトコル独立マルチキャスト - スパースモード（PIM-SM）：プロトコル仕様（改訂）\"、RFC 4601、DOI 10.17487 / RFC4601 、2006年8月、<http://www.rfc-editor.org/info/rfc4601>。"
    },
    {
      "indent": 3,
      "text": "[RFC6388] Wijnands, IJ., Ed., Minei, I., Ed., Kompella, K., and B. Thomas, \"Label Distribution Protocol Extensions for Point-to-Multipoint and Multipoint-to-Multipoint Label Switched Paths\", RFC 6388, DOI 10.17487/RFC6388, November 2011, <http://www.rfc-editor.org/info/rfc6388>.",
      "ja": "[RFC6388] Wijnands、IJ。、エド。、Minei、I.、エド。、Kompella、K.、およびB.トーマス、「ポイントツーマルチポイントのラベル配布プロトコルの拡張機能と多対多ラベルは、パスの交換しました」 、RFC 6388、DOI 10.17487 / RFC6388、2011年11月、<http://www.rfc-editor.org/info/rfc6388>。"
    },
    {
      "indent": 3,
      "text": "[RFC6571] Filsfils, C., Ed., Francois, P., Ed., Shand, M., Decraene, B., Uttaro, J., Leymann, N., and M. Horneffer, \"Loop-Free Alternate (LFA) Applicability in Service Provider (SP) Networks\", RFC 6571, DOI 10.17487/RFC6571, June 2012, <http://www.rfc-editor.org/info/rfc6571>.",
      "ja": "[RFC6571] Filsfils、C.、エド。、フランソワ、P.編、シャンド、M.、Decraene、B.、Uttaro、J.、Leymann、N.、およびM. Horneffer、「ループフリー代替（サービスプロバイダ（SP）ネットワーク」、RFC 6571でLFA）の適用、DOI 10.17487 / RFC6571、2012年6月、<http://www.rfc-editor.org/info/rfc6571>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Dave Oran and Alvaro Retana for their review and comments on this document.",
      "ja": "彼らのレビューと、この文書に関するコメントについてデイブオランとアルバロRetanaに感謝します。"
    },
    {
      "indent": 3,
      "text": "The authors would like to especially acknowledge Dino Farinacci, John Zwiebel, and Greg Shepherd for the genesis of the MoFRR concept.",
      "ja": "著者は特にMoFRR概念の起源のためにディノファリナッチ、ジョンZwiebel、とグレッグシェパードを確認したいと思います。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "Below is a list of the contributors in alphabetical order:",
      "ja": "以下は、アルファベット順に貢献者のリストは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Dino Farinacci Email: farinacci@gmail.com",
      "ja": "ディノファリナッチEメール：farinacci@gmail.com"
    },
    {
      "indent": 3,
      "text": "Wim Henderickx Alcatel-Lucent Copernicuslaan 50 Antwerp 2018 Belgium Email: wim.henderickx@alcatel-lucent.com",
      "ja": "ヴィム・ヘンデリックアルカテル・ルーセントCopernicuslaan 50アントワープベルギー電子メール：wim.henderickx@alcatel-lucent.com"
    },
    {
      "indent": 3,
      "text": "Uwe Joorde Deutsche Telekom Dahlweg 100 D-48153 Muenster Germany Email: Uwe.Joorde@telekom.de",
      "ja": "ウーヴェJoordeドイツテレコムDahlweg 100 D-48153ミュンスタードイツEメール：Uwe.Joorde@telekom.de"
    },
    {
      "indent": 3,
      "text": "Nicolai Leymann Deutsche Telekom Winterfeldtstrasse 21 Berlin 10781 Germany Email: N.Leymann@telekom.de",
      "ja": "ニコライLeymannドイツテレコムWinterfeldtstrasse 21ベルリン10781ドイツメール：N.Leymann@telekom.de"
    },
    {
      "indent": 3,
      "text": "Jeff Tantsura Ericsson 300 Holger Way San Jose, CA 95134 United States Email: jeff.tantsura@ericsson.com",
      "ja": "ジェフTantsuraエリクソン300ホルガー・ウェイサンノゼ、CA 95134米国メールアドレス：jeff.tantsura@ericsson.com"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Apoorva Karan Cisco Systems, Inc. 3750 Cisco Way San Jose, CA 95134 United States",
      "ja": "Apoorvaカランシスコシステムズ株式会社3750シスコウェイサンノゼ、CA 95134米国"
    },
    {
      "indent": 3,
      "text": "Email: apoorva@cisco.com",
      "ja": "メール：apoorva@cisco.com"
    },
    {
      "indent": 3,
      "text": "Clarence Filsfils Cisco Systems, Inc. De kleetlaan 6a Diegem BRABANT 1831 Belgium",
      "ja": "クラレンスFilsfilsシスコシステムズ、株式会社デkleetlaan図6aディーゲムBRABANT 1831ベルギー"
    },
    {
      "indent": 3,
      "text": "Email: cfilsfil@cisco.com",
      "ja": "メール：cfilsfil@cisco.com"
    },
    {
      "indent": 3,
      "text": "IJsbrand Wijnands (editor) Cisco Systems, Inc. De Kleetlaan 6a Diegem 1831 Belgium",
      "ja": "IJsbrand Wijnands（エディタ）は、シスコシステムズ、株式会社Kleetlaan 6aはディーゲム1831ベルギー"
    },
    {
      "indent": 3,
      "text": "Email: ice@cisco.com",
      "ja": "メール：ice@cisco.com"
    },
    {
      "indent": 3,
      "text": "Bruno Decraene Orange 38-40 rue du General Leclerc Issy Moulineaux Cedex 9, 92794 France",
      "ja": "ブルーノDecraeneオレンジ38-40 RUEデュ一般ルクレールイシムリノーセデックス9、フランス92794"
    },
    {
      "indent": 3,
      "text": "Email: bruno.decraene@orange.com",
      "ja": "メール：bruno.decraene@orange.com"
    }
  ]
}