{
  "title": {
    "text": "RFC 3589 - Diameter Command Codes for Third Generation Partnership Project (3GPP) Release 5",
    "ja": "RFC 3589 - 第三世代パートナーシッププロジェクト（3GPP）リリース5のための直径コマンドコード"
  },
  "number": 3589,
  "created_at": "2019-10-20 00:37:39.726081+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        J. Loughney\nRequest for Comments: 3589                                         Nokia\nCategory: Informational                                   September 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "              Diameter Command Codes for\nThird Generation Partnership Project (3GPP) Release 5",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the IANA's allocation of a block of Diameter Command Codes for the Third Generation Partnership Project (3GPP) Release 5. This document does not pass judgment on the usage of these command codes. Further more, these command codes are for use for Release 5. For future releases, these codes cannot be reused, but must be allocated according to the Diameter Base specification.",
      "ja": "この文書では、第三世代パートナーシッププロジェクト（3GPP）この文書では、これらのコマンドコードの使用上の判断を渡すことはありません5.リリースの直径コマンドコードのブロックのIANAの割り当てについて説明します。更に、これらのコマンドコードは、将来のリリースのリリース5のために使用するためのもので、これらのコードを再利用することはできないが、直径の基本仕様に応じて割り当てられなければなりません。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction................................................... 2\n    1.1.  Abbreviations............................................ 2\n2.  Command Code Allocation........................................ 2\n3.  Security Considerations........................................ 2\n4.  Acknowledgements............................................... 3\n5.  Intellectual Property Statement................................ 3\n6.  References..................................................... 3\n    6.1.  Normative References..................................... 3\n    6.2.  Informative References................................... 3\n7.  Author's Address............................................... 4\n8.  Full Copyright Statement....................................... 5",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Third Generation Partnership Project (3GPP) is defining the Internet Multimedia Subsystem (IMS) as part of their Release 5 architecture. As part of this architecture, they have defined a Diameter application [29.229] and [29.329] which requires the use of new Diameter Command Codes [DIAM].",
      "ja": "第三世代パートナーシッププロジェクト（3GPP）は、彼らのリリース5アーキテクチャの一部として、インターネットマルチメディアサブシステム（IMS）を定義しています。このアーキテクチャの一環として、彼らは新しい直径コマンドコード[DIAM]を使用する必要がDiameterアプリケーション[29.229]と[29.329]を定義しました。"
    },
    {
      "indent": 0,
      "text": "1.1. Abbreviations",
      "section_title": true,
      "ja": "1.1。略語"
    },
    {
      "indent": 3,
      "text": "3GPP Third Generation Partnership Project",
      "ja": "3GPP第三世代パートナーシッププロジェクト"
    },
    {
      "indent": 3,
      "text": "IANA Internet Assigned Name Authority",
      "ja": "IANAインターネットが名典拠割り当て"
    },
    {
      "indent": 3,
      "text": "IMS Internet Multimedia Subsystem",
      "ja": "IMSインターネットマルチメディアサブシステム"
    },
    {
      "indent": 0,
      "text": "2. Command Code Allocation",
      "section_title": true,
      "ja": "2.コマンドコードの割り当て"
    },
    {
      "indent": 3,
      "text": "The IANA has allocated Diameter Command Codes 300 through 313, for use in 3GPP Release 5. The protocols defined by these command codes have not been carefully reviewed by the IETF community and are not considered to be general mechanisms appropriate for broad usage. More work is needed to develop general mechanisms and may become a work item of an IETF Working Group. These command codes are intended to be used for 3GPP Release 5 only [29.228], [29.229]. Future 3GPP releases are expected to make use of alternate mechanisms.",
      "ja": "IANAは〜313 300は、3GPPリリース5で使用するためにこれらのコマンドコードで定義されたプロトコルは慎重にIETFコミュニティによって検討されておらず、幅広い用途に適切な一般的なメカニズムであると考えられていない直径コマンドコードを割り当てています。より多くの作業が一般的なメカニズムを開発するために必要とされるとIETFワーキンググループの作業項目になることがあります。これらのコマンドコードは、3GPPリリース5のために使用されることが意図されるのみ[29.228]、[29.229]。将来の3GPPリリースは、代替メカニズムを利用することが期待されます。"
    },
    {
      "indent": 3,
      "text": "Command codes for 3GPP Release 6 are expected to be allocated from the standard command space, with IETF documentation. The current intent as agreed with 3GPP is to develop a standards track application addressing the needs of AAA for SIP/SDP and encompassing the requirements of the cellular community.",
      "ja": "3GPPリリース6用のコマンドコードはIETFのドキュメントで、標準のコマンド空間から割り当てされることが期待されます。 3GPPとの合意に基づき、現在の意図は、SIP / SDPのためにAAAのニーズに対応し、携帯コミュニティの要件を網羅する標準の追跡アプリケーションを開発することです。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document is not known to affect the security of the Internet.",
      "ja": "この文書は、インターネットのセキュリティに影響を与えることは知られていません。"
    },
    {
      "indent": 0,
      "text": "4. Intellectual Property Statement",
      "section_title": true,
      "ja": "4.知的財産権に関する声明"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、そのような権限下で、ライセンスがたりないかもしれない可能性があるためにどの本書または程度に記載されている技術の実装や使用に関係すると主張される可能性があります任意の知的財産やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能。また、そうした権利を特定するために取り組んできたことを表していないん。スタンダードトラックおよび標準関連文書における権利に関するIETFの手続きの情報は、BCP-11に記載されています。権利の主張のコピーは、出版のために利用可能とライセンスの保証が利用できるようにする、または本仕様の実装者または利用者が、そのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights, which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director [2026].",
      "ja": "IETFは、その注意にこの標準を実践するために必要な場合があり技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を、持って来るためにすべての利害関係者を招待します。 IETFエグゼクティブディレクター[2026]に情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgments",
      "section_title": true,
      "ja": "5.謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank Bernard Aboba, Randy Bush, Allison Mankin and Stephen Hayes.",
      "ja": "著者はバーナードAboba、ランディブッシュ、アリソンマンキンとスティーブン・ヘイズに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "ja": "[2026]ブラドナーの、S.、 \"インターネット標準化プロセス - リビジョン3\"、BCP 9、RFC 2026、1996年10月。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[29.229] 3GPP TS 29.229 V5.1.0 (2002-09); Technical Specification; Technical Specification Group Core Network; Cx and Dx interfaces based on the Diameter protocol; Protocol details; (Release 5).",
      "ja": "[29.229] 3GPP TS 29.229 V5.1.0（2002-09）。技術仕様;技術仕様グループコアネットワーク; Diameterプロトコルに基づくCXとDxとのインターフェース。プロトコルの詳細; （リリース5）。"
    },
    {
      "indent": 3,
      "text": "[29.329] 3GPP TS 29.329 V5.1.0 (2002-09); Technical Specification; 3rd Generation Partnership Project; Technical Specification Group Core Network; Sh Interface based on the Diameter protocol; Protocol details; (Release 5)",
      "ja": "[29.329] 3GPP TS 29.329 V5.1.0（2002-09）。技術仕様;第3世代パートナーシッププロジェクト。技術仕様グループコアネットワーク; Diameterプロトコルに基づくShインタフェース。プロトコルの詳細; （リリース5）"
    },
    {
      "indent": 3,
      "text": "[DIAM] Calhoun, P., Loughney, J., Guttman, E., Zorn, G. and J. Arkko, \"Diameter Base Protocol\", RFC 3588, September 2003.",
      "ja": "[DIAM]カルフーン、P.、Loughney、J.、ガットマン、E.、ゾルン、G.およびJ. Arkko、 \"直径ベースプロトコル\"、RFC 3588、2003年9月。"
    },
    {
      "indent": 0,
      "text": "7. Author's Address",
      "section_title": true,
      "ja": "7.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "John Loughney Nokia Itamerenkatu 11-13 00180 Helsinki Finland",
      "ja": "じょｈん ぉうｇｈねｙ のきあ いためれんかつ １１ー１３ ００１８０ へｌしんき ふぃんぁんｄ"
    },
    {
      "indent": 3,
      "text": "EMail: john.Loughney@Nokia.com",
      "ja": "メールアドレス：john.Loughney@Nokia.com"
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}