{
  "title": {
    "text": "RFC 5015 - Bidirectional Protocol Independent Multicast (BIDIR-PIM)",
    "ja": "RFC 5015 - 双方向プロトコル独立マルチキャスト（BIDIR-PIM）"
  },
  "number": 5015,
  "created_at": "2019-10-21 23:20:31.205328+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         M. Handley\nRequest for Comments: 5015                                           UCL\nCategory: Standards Track                                    I. Kouvelas\n                                                             T. Speakman\n                                                                   Cisco\n                                                             L. Vicisano\n                                                        Digital Fountain\n                                                            October 2007",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Bidirectional Protocol Independent Multicast (BIDIR-PIM)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document discusses Bidirectional PIM (BIDIR-PIM), a variant of PIM Sparse-Mode that builds bidirectional shared trees connecting multicast sources and receivers. Bidirectional trees are built using a fail-safe Designated Forwarder (DF) election mechanism operating on each link of a multicast topology. With the assistance of the DF, multicast data is natively forwarded from sources to the Rendezvous-Point (RP) and hence along the shared tree to receivers without requiring source-specific state. The DF election takes place at RP discovery time and provides the route to the RP, thus eliminating the requirement for data-driven protocol events.",
      "ja": "この文書は、双方向PIM（BIDIR-PIM）、マルチキャスト送信元と受信機とを接続する双方向の共有ツリーを構築するPIMスパースモードの変形例を説明します。双方向ツリーは、マルチキャストトポロジの各リンク上で動作してフェイルセーフ指定フォワーダ（DF）選挙メカニズムを使用して構築されています。 DFの助けを借りて、マルチキャストデータは、ネイティブソース固有の状態を必要とせずに、ランデブーポイント（RP）に、したがって、受信機への共有ツリーに沿ってソースから転送されます。 DF選定はRP発見時間で行われますので、データ駆動型のプロトコルイベントの必要性を排除し、RPへのルートを提供します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Terminology .....................................................4\n   2.1. Definitions ................................................4\n   2.2. Pseudocode Notation ........................................6\n3. Protocol Specification ..........................................6\n   3.1. BIDIR-PIM Protocol State ...................................7\n        3.1.1. General Purpose State ...............................8\n        3.1.2. RPA State ...........................................8\n        3.1.3. Group State .........................................9\n        3.1.4. State Summarization Macros .........................10\n   3.2. PIM Neighbor Discovery ....................................11\n   3.3. Data Packet Forwarding Rules ..............................11\n        3.3.1. Upstream Forwarding at RP ..........................12\n        3.3.2. Source-Only Branches ...............................12\n        3.3.3. Directly Connected Sources .........................13\n   3.4. PIM Join/Prune Messages ...................................13\n        3.4.1. Receiving (*,G) Join/Prune Messages ................13\n        3.4.2. Sending Join/Prune Messages ........................16\n   3.5. Designated Forwarder (DF) Election ........................18\n        3.5.1. DF Requirements ....................................18\n        3.5.2. DF Election Description ............................19\n               3.5.2.1. Bootstrap Election ........................20\n               3.5.2.2. Loser Metric Changes ......................20\n               3.5.2.3. Winner Metric Changes .....................21\n               3.5.2.4. Winner Loses Path .........................22\n               3.5.2.5. Late Router Starting Up ...................22\n               3.5.2.6. Winner Dies ...............................22\n        3.5.3. Election Protocol Specification ....................22\n               3.5.3.1. Election State ............................22\n               3.5.3.2. Election Messages .........................23\n               3.5.3.3. Election Events ...........................24\n               3.5.3.4. Election Actions ..........................25\n               3.5.3.5. Election State Transitions ................26\n        3.5.4. Election Reliability Enhancements ..................30\n        3.5.5. Missing Pass .......................................30\n        3.5.6. Periodic Winner Announcement .......................30\n   3.6. Timers, Counters, and Constants ...........................31\n   3.7. BIDIR-PIM Packet Formats ..................................34\n        3.7.1. DF Election Packet Formats .........................34\n        3.7.2. Backoff Message ....................................36\n        3.7.3. Pass Message .......................................36\n        3.7.4. Bidirectional Capable PIM-Hello Option .............37\n4. RP Discovery ...................................................37\n5. Security Considerations ........................................38\n   5.1. Attacks Based on Forged Messages ..........................38\n        5.1.1. Election of an Incorrect DF ........................38",
      "raw": true
    },
    {
      "indent": 0,
      "text": "           5.1.2. Preventing Election Convergence ....................39\n      5.2. Non-Cryptographic Authentication Mechanisms ...............39\n           5.2.1. Basic Access Control ...............................39\n      5.3. Authentication Using IPsec ................................40\n      5.4. Denial-of-Service Attacks .................................40\n   6. IANA Considerations ............................................40\n   7. Acknowledgments ................................................40\n   8. Normative References ...........................................40\n   9. Informative References .........................................41\nList of Figures\n   Figure 1. Downstream group per-interface state machine ............15\n   Figure 2. Upstream group state machine ............................17\n   Figure 3. Designated Forwarder election state machine .............27",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document specifies Bidirectional PIM (BIDIR-PIM), a variant of PIM Sparse-Mode (PIM-SM) [4] that builds bidirectional shared trees connecting multicast sources and receivers.",
      "ja": "この文書は、双方向PIM（BIDIR-PIM）、PIMスパースモード（PIM-SM）[4]マルチキャストソースおよび受信機を接続する双方向の共有ツリーを構築するの変異体を指定します。"
    },
    {
      "indent": 3,
      "text": "PIM-SM constructs unidirectional shared trees that are used to forward data from senders to receivers of a multicast group. PIM-SM also allows the construction of source-specific trees, but this capability is not related to the protocol described in this document.",
      "ja": "PIM-SMは、マルチキャストグループの受信者に送信者からデータを転送するために使用される一方向共有ツリーを構築します。 PIM-SMは、ソース特有の木の構築を可能にするが、この機能は、本文書に記載のプロトコルに関連しません。"
    },
    {
      "indent": 3,
      "text": "The shared tree for each multicast group is rooted at a multicast router called the Rendezvous Point (RP). Different multicast groups can use separate RPs within a PIM domain.",
      "ja": "各マルチキャストグループの共有ツリーは、ランデブーポイント（RP）と呼ばれるマルチキャストルータに根ざしています。異なるマルチキャストグループには、PIMドメイン内の別のRPを使用することができます。"
    },
    {
      "indent": 3,
      "text": "In unidirectional PIM-SM, there are two possible methods for distributing data packets on the shared tree. These differ in the way packets are forwarded from a source to the RP:",
      "ja": "一方向PIM-SMは、共有ツリー上のデータパケットを配信するための二つの可能な方法があります。これらは、パケットはRPにソースから転送される方法が異なります。"
    },
    {
      "indent": 3,
      "text": "o Initially, when a source starts transmitting, its first hop router encapsulates data packets in special control messages (Registers) that are unicast to the RP. After reaching the RP, the packets are decapsulated and distributed on the shared tree.",
      "ja": "ソースが送信を開始するときにOまず、最初のホップルータは、RPにユニキャストされている特殊な制御メッセージ（レジスタ）にデータパケットをカプセル化します。 RPに達した後、パケットはカプセル化が解除され、共有ツリー上に分散します。"
    },
    {
      "indent": 3,
      "text": "o A transition from the above distribution mode can be made at a later stage. This is achieved by building source-specific state on all routers along the path between the source and the RP. This state is then used to natively forward packets from that source.",
      "ja": "O上記分配モードからの遷移は、後の段階で行うことができます。これは、ソースとRPとの間の経路に沿った全てのルータでソース固有の状態を構築することによって達成されます。この状態は、そのソースからネイティブにパケットを転送するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Both of these mechanisms suffer from problems. Encapsulation results in significant processing, bandwidth, and delay overheads. Forwarding using source-specific state has additional protocol and memory requirements.",
      "ja": "これらのメカニズムの両方が問題を抱えています。重要な処理、帯域幅、および遅延オーバーヘッドでのカプセル化の結果。ソース固有の状態を用いて転送することは、追加のプロトコルおよびメモリ要件を有しています。"
    },
    {
      "indent": 3,
      "text": "Bidirectional PIM dispenses with both encapsulation and source state by allowing packets to be natively forwarded from a source to the RP using shared tree state. In contrast to PIM-SM, this mode of forwarding does not require any data-driven events.",
      "ja": "双方向PIMは、パケットがネイティブで共有ツリーの状態を使用してRPにソースから転送されるようにすることによって、カプセル化、ソース状態の両方で分配します。 PIM-SMとは対照的に、フォワーディングのこのモードでは、任意のデータ駆動型のイベントを必要としません。"
    },
    {
      "indent": 3,
      "text": "The protocol specification in this document assumes familiarity with the PIM-SM specification in [4]. Portions of the BIDIR-PIM protocol operation that are identical to that of PIM-SM are only defined by reference.",
      "ja": "この文書に記載されているプロトコル仕様[4]におけるPIM-SM仕様に精通して前提。 PIM-SMのものと同一であるBIDIR-PIMプロトコルの動作の一部のみが参照することにより定義されます。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "In this document, the key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" are to be interpreted as described in RFC 2119 [1] and indicate requirement levels for compliant BIDIR-PIM implementations.",
      "ja": "この文書では、キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"NOT SHALL\"、 \"推奨\"、 \"すべきではない\" \"べきである\" \"ないものと\"、 \"MAY\"、および \"オプション\" RFC 2119に記載されるように解釈されるべきである[1]と対応BIDIR-PIM実装の要求レベルを示します。"
    },
    {
      "indent": 0,
      "text": "2.1. Definitions",
      "section_title": true,
      "ja": "2.1。定義"
    },
    {
      "indent": 3,
      "text": "This specification uses a number of terms to refer to the roles of routers participating in BIDIR-PIM. The following terms have special significance for BIDIR-PIM:",
      "ja": "この仕様はBIDIR-PIMに参加するルータの役割を参照するために多くの用語を使用します。以下の用語はBIDIR-PIMのための特別な意味を持っています。"
    },
    {
      "indent": 3,
      "text": "Multicast Routing Information Base (MRIB) The multicast topology table, which is typically derived from the unicast routing table, or routing protocols such as Multiprotocol BGP (MBGP) [8] that carry multicast-specific topology information. It is used by PIM for establishing the RPF interface (used in the forwarding rules). In PIM-SM, the MRIB is also used to make decisions regarding where to forward Join/Prune messages, whereas in BIDIR-PIM, it is used as a source for routing metrics for the DF election process.",
      "ja": "典型的には、ユニキャストルーティングテーブル、又はそのようなマルチプロトコルBGP（MBGP）などのルーティングプロトコルから導出されるマルチキャストルーティング情報ベース（MRIB）マルチキャストトポロジーテーブル、[8]マルチキャスト固有のトポロジ情報を運ぶこと。これは、（転送ルールで使用される）RPFインターフェイスを確立するためにPIMによって使用されます。 BIDIR-PIMで、それはDF選定プロセスのメトリックをルーティングするためのソースとして使用されているのに対し、PIM-SMでは、MRIBはまた、/プルーンJoinメッセージを転送する方法に関する決定を行うために使用されます。"
    },
    {
      "indent": 3,
      "text": "Rendezvous Point Address (RPA) An RPA is an address that is used as the root of the distribution tree for a range of multicast groups. The RPA must be routable from all routers in the PIM domain. The RPA does not need to correspond to an address for an interface of a real router. In this respect, BIDIR-PIM differs from PIM-SM, which requires an actual router to be configured as the Rendezvous Point (RP). Join messages from receivers for a BIDIR-PIM group propagate hop-by-hop towards the RPA.",
      "ja": "ランデブーポイントアドレスは、（RPA）RPAアンはマルチキャストグループの範囲の配信ツリーのルートとして使用されるアドレスです。 RPAは、PIMドメイン内のすべてのルータからのルーティング可能でなければなりません。 RPAは、実際のルータのインターフェイスのアドレスに対応している必要はありません。この点において、BIDIR-PIMは、ランデブーポイント（RP）として構成されるべき実際のルータを必要とPIM-SMとは異なります。 RPAに向けてホップバイホップを伝播BIDIR-PIMグループの受信者からのメッセージに参加しましょう。"
    },
    {
      "indent": 3,
      "text": "Rendezvous Point Link (RPL) An RPL for a particular RPA is the physical link to which the RPA belongs. In BIDIR-PIM, all multicast traffic to groups mapping to a specific RPA is forwarded on the RPL of that RPA. The RPL is special within a BIDIR-PIM domain as it is the only link on which a Designated Forwarder election does not take place (see DF definition below).",
      "ja": "ランデブーポイントリンク（RPL）特定のRPAのためのRPLは、RPAが属する物理的なリンクです。 BIDIR-PIMでは、特定のRPAへのグループへのマッピングすべてのマルチキャストトラフィックはそのRPAのRPLに転送されます。それは指定フォワーダ選挙は（以下DFの定義を参照）を行わないで唯一のリンクであるとして、RPLはBIDIR-PIMドメイン内に特別なものです。"
    },
    {
      "indent": 3,
      "text": "Upstream Towards the root (RPA) of the tree. The direction used by packets traveling from sources to the RPL.",
      "ja": "ツリーのルート（RPA）に向けて上流。 RPLの供給源から移動するパケットで使用される方向。"
    },
    {
      "indent": 3,
      "text": "Downstream Away from the root of the tree. The direction on which packets travel from the RPL to receivers.",
      "ja": "アウェイツリーのルートから下流。パケットが受信機にRPLから走行する上方向。"
    },
    {
      "indent": 3,
      "text": "Designated Forwarder (DF) The protocol presented in this document is largely based on the concept of a Designated Forwarder (DF). A single DF exists for each RPA on every link within a BIDIR-PIM domain (this includes both multi-access and point-to-point links). The only exception is the RPL on which no DF exists. The DF is the router on the link with the best route to the RPA (determined by comparing MRIB provided metrics). A DF for a given RPA is in charge of forwarding downstream traffic onto its link, and forwarding upstream traffic from its link towards the RPL. It does this for all the bidirectional groups that map to the RPA. The DF on a link is also responsible for processing Join messages from downstream routers on the link as well as ensuring that packets are forwarded to local receivers (discovered through a local membership mechanism such as MLD [3] or IGMP [2]).",
      "ja": "指定フォワーダ（DF）この文書のプロトコルは、主に指定フォワーダ（DF）の概念に基づいています。単一DF（これはマルチアクセスポイントツーポイントリンクの両方を含む）BIDIR-PIMドメイン内のすべてのリンク上の各RPAのために存在します。唯一の例外は一切DFが存在しない上RPLです。 DFは（MRIB提供メトリックを比較することによって決定）RPAへの最良のルートとのリンク上のルータです。所与RPAのためのDFは、そのリンクにダウンストリームトラフィックを転送し、そしてRPLに対するそのリンクからのアップストリームトラフィックの転送を担当します。これは、RPAにマッピングされたすべての双方向のグループのためにこれを行います。リンク上DFは、リンク上のダウンストリームのルータからのメッセージを参加処理と同様に、パケットがローカル受信機に転送されることを保証する責任がある（例えば、MLDのようなローカルメンバーシップ機構を介して発見された[3]又はIGMP [2]）。"
    },
    {
      "indent": 3,
      "text": "RPF Interface RPF stands for \"Reverse Path Forwarding\". The RPF Interface of a router with respect to an address is the interface that the MRIB indicates should be used to reach that address. In the case of a BIDIR-PIM multicast group, the RPF interface is determined by looking up the RPA in the MRIB. The RPF information determines the interface of the router that would be used to send packets towards the RPL for the group.",
      "ja": "RPFインターフェイスRPFは、「リバースパス転送」の略です。アドレスに対するルータのRPFインタフェースはMRIBがそのアドレスに到達するために使用されるべきで示すインターフェースです。 BIDIR-PIMマルチキャストグループの場合、RPFインタフェースはMRIBにRPAを調べることによって決定されます。 RPF情報は、グループのRPLに向かってパケットを送信するために使用されるルータのインターフェースを決定します。"
    },
    {
      "indent": 3,
      "text": "RPF Neighbor The RPF Neighbor of a router with respect to an address is the neighbor that the MRIB indicates should be used to reach that address. Note that in BIDIR-PIM, the RPF neighbor for a group is not necessarily the router on the RPF interface that Join messages for that group would be directed to (Join messages are only directed to the DF on the RPF interface for the group).",
      "ja": "RPF隣人は、アドレスに関してルータのRPFネイバーは、MRIBは、そのアドレスに到達するために使用されるべきであることを示すことを隣人です。 BIDIR-PIMに、グループのためのRPF隣人が（Joinメッセージを唯一のグループのためのRPFインターフェイス上のDFに向けられている）、そのグループのためのメッセージはに向けられるであろう参加RPFインターフェイス上のルータが必ずしもないことに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "Tree Information Base (TIB) This is the collection of state at a PIM router that has been created by receiving PIM Join/Prune messages, PIM DF election messages, and IGMP or MLD information from local hosts. It essentially stores the state of all multicast distribution trees at that router.",
      "ja": "ツリー情報ベース（TIB）これは、ローカルホストから、PIM DF選定メッセージ、およびIGMPまたはMLD情報/参加PIMプルーンメッセージを受信することにより作成されたPIMルータでの状態のコレクションです。それは本質的にそのルータでは、すべてのマルチキャスト配信ツリーの状態を格納します。"
    },
    {
      "indent": 3,
      "text": "Multicast Forwarding Information Base (MFIB) The TIB holds all the state that is necessary to forward multicast packets at a router. However, although this specification defines forwarding in terms of the TIB, to actually forward packets using the TIB is very inefficient. Instead, a real router implementation will normally build an efficient MFIB from the TIB state to perform forwarding. How this is done is implementation-specific, and is not discussed in this document.",
      "ja": "マルチキャスト転送情報ベース（MFIB）TIBは、ルータにマルチキャストパケットを転送する必要があるすべての状態を保持します。この仕様は、実際に前方にTIBを使用してパケットに、TIBの点で転送定義するものの、非常に非効率的です。代わりに、実際のルータの実装は、通常の転送を実行するためにTIB状態から効率的なMFIBを構築します。これはどのように行われている実装固有であり、この文書で説明されていません。"
    },
    {
      "indent": 0,
      "text": "2.2. Pseudocode Notation",
      "section_title": true,
      "ja": "2.2。擬似コード表記"
    },
    {
      "indent": 3,
      "text": "We use set notation in several places in this specification.",
      "ja": "私たちは、この仕様では、いくつかの場所に設定された表記法を使用しています。"
    },
    {
      "indent": 3,
      "text": "A (+) B is the union of two sets, A and B.",
      "ja": "（+）Bは二組、AとBの和集合であります"
    },
    {
      "indent": 3,
      "text": "A (-) B is the elements of set A that are not in set B.",
      "ja": "（ - ）Bは、セットBにはない集合Aの要素であります"
    },
    {
      "indent": 3,
      "text": "NULL is the empty set or list.",
      "ja": "NULLは空のセットまたはリストです。"
    },
    {
      "indent": 3,
      "text": "In addition, we use C-like syntax:",
      "ja": "加えて、我々はCに似た構文を使用します。"
    },
    {
      "indent": 3,
      "text": "= denotes assignment of a variable.",
      "ja": "=変数の割り当てを示しています。"
    },
    {
      "indent": 3,
      "text": "== denotes a comparison for equality.",
      "ja": "==平等のための比較を示しています。"
    },
    {
      "indent": 3,
      "text": "!= denotes a comparison for inequality.",
      "ja": "！=不平等のための比較を示しています。"
    },
    {
      "indent": 3,
      "text": "Braces { and } are used for grouping.",
      "ja": "ブレースは、{と}グループ化するために使用されます。"
    },
    {
      "indent": 0,
      "text": "3. Protocol Specification",
      "section_title": true,
      "ja": "3.プロトコル仕様"
    },
    {
      "indent": 3,
      "text": "The specification of BIDIR-PIM is broken into several parts:",
      "ja": "BIDIR-PIMの仕様は、いくつかの部分に分割されます。"
    },
    {
      "indent": 3,
      "text": "o Section 3.1 details the protocol state stored.",
      "ja": "O 3.1節詳細プロトコル状態が記憶されます。"
    },
    {
      "indent": 3,
      "text": "o Section 3.2 defines the BIDIR-PIM extensions to the PIM-SM [4] neighbor discovery mechanism.",
      "ja": "Oセクション3.2は、PIM-SM [4]近隣探索メカニズムにBIDIR-PIM拡張機能を定義します。"
    },
    {
      "indent": 3,
      "text": "o Section 3.3 specifies the data packet forwarding rules.",
      "ja": "O部3.3は、データパケットの転送ルールを指定します。"
    },
    {
      "indent": 3,
      "text": "o Section 3.4 specifies the BIDIR-PIM Join/Prune generation and processing rules.",
      "ja": "O部3.4はBIDIR-PIMは/プルーン生成および処理ルールに参加指定します。"
    },
    {
      "indent": 3,
      "text": "o Section 3.5 specifies the Designated Forwarder (DF) election.",
      "ja": "O部3.5は指定フォワーダ（DF）選挙を指定します。"
    },
    {
      "indent": 3,
      "text": "o Section 3.7 specifies the PIM packet formats.",
      "ja": "O部3.7は、PIMパケットフォーマットを指定します。"
    },
    {
      "indent": 3,
      "text": "o Section 3.6 summarizes BIDIR-PIM timers and gives their default values.",
      "ja": "O部3.6はBIDIR-PIMタイマーを要約し、そのデフォルト値を示します。"
    },
    {
      "indent": 0,
      "text": "3.1. BIDIR-PIM Protocol State",
      "section_title": true,
      "ja": "3.1。 BIDIR-PIMプロトコルの状態"
    },
    {
      "indent": 3,
      "text": "This section specifies all the protocol state that a BIDIR-PIM implementation should maintain in order to function correctly. We term this state the Tree Information Base or TIB, as it holds the state of all the multicast distribution trees at this router. In this specification, we define PIM mechanisms in terms of the TIB. However, only a very simple implementation would actually implement packet forwarding operations in terms of this state. Most implementations will use this state to build a multicast forwarding table, which would then be updated when the relevant state in the TIB changes.",
      "ja": "このセクションでは、BIDIR-PIMの実装が正しく機能するために維持する必要があるすべてのプロトコル状態を指定します。それはこのルータでは、すべてのマルチキャスト配信ツリーの状態を保持していると私たちは、この状態ツリー情報ベースまたはTIBを名づけます。この仕様では、我々は、TIBの面でPIMメカニズムを定義します。しかし、唯一の非常に単純な実装では、実際にこのような状態の面でパケット転送の操作を実装します。ほとんどの実装では、TIBの関連する状態が変化したときに、その後更新されるマルチキャスト転送テーブルを構築するために、この状態を使用します。"
    },
    {
      "indent": 3,
      "text": "Although we specify precisely the state to be kept, this does not mean that an implementation of BIDIR-PIM needs to hold the state in this form. This is actually an abstract state definition, which is needed in order to specify the router's behavior. A BIDIR-PIM implementation is free to hold whatever internal state it requires, and will still be conformant with this specification so long as it results in the same externally visible protocol behavior as an abstract router that holds the following state.",
      "ja": "我々が保持されるように、正確な状態を指定しますが、これはBIDIR-PIMの実装は、この形式で状態を保持する必要があることを意味するものではありません。これは実際にルータの動作を指定するために必要とされる抽象状態の定義、です。 BIDIR-PIM実装は、それが必要とする内部どんな状態を保持して自由であり、さらに、それが以下の状態を保持する抽象ルータと同じ外部から見えるプロトコルの動作になり、この仕様に準拠します。"
    },
    {
      "indent": 3,
      "text": "We divide TIB state into two sections:",
      "ja": "我々は2つのセクションにTIB状態を分割します："
    },
    {
      "indent": 3,
      "text": "RPA state State that maintains the DF election information for each RPA.",
      "ja": "各RPAのためのDF選定情報を保持RPA状態状態。"
    },
    {
      "indent": 3,
      "text": "Group state State that maintains a group-specific tree for groups that map to a given RPA.",
      "ja": "与えられたRPAにマップするグループのグループ固有の木を維持し、グループ状態状態。"
    },
    {
      "indent": 3,
      "text": "The state that should be kept is described below. Of course, implementations will only maintain state when it is relevant to forwarding operations - for example, the \"NoInfo\" state might be assumed from the lack of other state information, rather than being held explicitly.",
      "ja": "維持されるべき状態は以下の通りです。それは操作を転送に関連している場合は、当然、実装は唯一の状態を維持する - 例えば、「NoInfo」状態ではなく、明示的に開催されるより、他の状態情報の不足から推定される可能性があります。"
    },
    {
      "indent": 0,
      "text": "3.1.1. General Purpose State",
      "section_title": true,
      "ja": "3.1.1。汎用州"
    },
    {
      "indent": 3,
      "text": "A router holds the following state that is not specific to an RPA or group:",
      "ja": "ルータは、RPAまたはグループに固有のものではない以下の状態を保持します。"
    },
    {
      "indent": 6,
      "text": "Neighbor State:",
      "ja": "近隣の状態："
    },
    {
      "indent": 9,
      "text": "For each neighbor:",
      "ja": "各隣人のために："
    },
    {
      "indent": 12,
      "text": "o Neighbor's Gen ID",
      "ja": "O隣人の世代ID"
    },
    {
      "indent": 12,
      "text": "o Neighbor liveness timer (NLT)",
      "ja": "Oネイバーライブネスタイマー（NLT）"
    },
    {
      "indent": 12,
      "text": "o Other information from neighbor's Hello",
      "ja": "隣人のHelloからその他の情報O"
    },
    {
      "indent": 3,
      "text": "For more information on Hello information, look at Section 3.2 as well as the PIM-SM specification in [4].",
      "ja": "こんにちは情報の詳細については、3.2節と同様に、[4]でPIM-SMの仕様を見てください。"
    },
    {
      "indent": 0,
      "text": "3.1.2. RPA State",
      "section_title": true,
      "ja": "3.1.2。 RPA州"
    },
    {
      "indent": 3,
      "text": "A router maintains a multicast-group to RPA mapping, which is built through static configuration or by using an automatic RP discovery mechanism like BSR or AUTO-RP (see Section 4). For each BIDIR-PIM RPA, a router holds the following state:",
      "ja": "ルータは、静的な構成を介して、またはBSRまたはAuto-RPのような自動RPディスカバリメカニズム（セクション4を参照）を使用して構築されるRPAマッピング、マルチキャストグループを維持します。各BIDIR-PIM RPAの場合、ルータは次の状態を保持します。"
    },
    {
      "indent": 6,
      "text": "o RPA (actual address)",
      "ja": "O RPA（実際のアドレス）"
    },
    {
      "indent": 6,
      "text": "Designated Forwarder (DF) State:",
      "ja": "指定フォワーダ（DF）状態："
    },
    {
      "indent": 11,
      "text": "For each router interface:",
      "ja": "各ルータインターフェイスの場合："
    },
    {
      "indent": 11,
      "text": "Acting DF information:",
      "ja": "DFの情報を代行："
    },
    {
      "indent": 14,
      "text": "o DF IP Address",
      "ja": "O DF IPアドレス"
    },
    {
      "indent": 14,
      "text": "o DF metric",
      "ja": "O DFメトリック"
    },
    {
      "indent": 11,
      "text": "Election information:",
      "ja": "選挙情報："
    },
    {
      "indent": 14,
      "text": "o Election State",
      "ja": "選挙州立O"
    },
    {
      "indent": 14,
      "text": "o DF election-Timer (DFT)",
      "ja": "O DF選定タイマー（DFT）"
    },
    {
      "indent": 14,
      "text": "o Message-Count (MC)",
      "ja": "Oメッセージ・カウント（MC）"
    },
    {
      "indent": 16,
      "text": "Current best offer:",
      "ja": "現在の最善のオファー："
    },
    {
      "indent": 16,
      "text": "o IP address of best offering router o Best offering router metric",
      "ja": "ベスト募集ルータメトリックO最良の募集ルータのO IPアドレス"
    },
    {
      "indent": 3,
      "text": "Designated Forwarder state is described in Section 3.5.",
      "ja": "指定フォワーダの状態は、セクション3.5に記載されています。"
    },
    {
      "indent": 0,
      "text": "3.1.3. Group State",
      "section_title": true,
      "ja": "3.1.3。グループ状態"
    },
    {
      "indent": 3,
      "text": "For every group G, a router keeps the following state:",
      "ja": "各グループGの場合、ルータは次の状態を保持します。"
    },
    {
      "indent": 9,
      "text": "Group state:",
      "ja": "グループの状態："
    },
    {
      "indent": 12,
      "text": "For each interface:",
      "ja": "各インタフェースの場合："
    },
    {
      "indent": 12,
      "text": "Local Membership:",
      "ja": "ローカルメンバーシップ："
    },
    {
      "indent": 15,
      "text": "o State: One of {\"NoInfo\", \"Include\"}",
      "ja": "O状態：の一つ{ \"NoInfo\"、 \"含みます\"}"
    },
    {
      "indent": 12,
      "text": "PIM Join/Prune State:",
      "ja": "PIM /プルーンの状態に参加："
    },
    {
      "indent": 15,
      "text": "o State: One of {\"NoInfo\" (NI), \"Join\" (J), \"PrunePending\" (PP)}",
      "ja": "O状態：{ \"NoInfo\"（NI）は、 \"参加\"（J）、 \"PrunePending\"（PP）}の一つ"
    },
    {
      "indent": 15,
      "text": "o PrunePendingTimer (PPT)",
      "ja": "PrunePendingTimer（PPT）"
    },
    {
      "indent": 15,
      "text": "o Join/Prune Expiry Timer (ET)",
      "ja": "O参加/プルーン有効期限タイマ（ET）"
    },
    {
      "indent": 9,
      "text": "Not interface specific:",
      "ja": "特定のインタフェースではありません。"
    },
    {
      "indent": 12,
      "text": "o Upstream Join/Prune Timer (JT)",
      "ja": "O上流には、/プルーンタイマー（JT）に参加します"
    },
    {
      "indent": 12,
      "text": "o Last RPA Used",
      "ja": "O最終RPAが使用されます"
    },
    {
      "indent": 3,
      "text": "Local membership is the result of the local membership mechanism (such as IGMP [2]) running on that interface. This information is used by the pim_include(*,G) macro described in Section 3.1.4.",
      "ja": "ローカル・メンバーシップは、そのインターフェイス上で実行されている（例えば、IGMP [2]のような）ローカルメンバシップメカニズムの結果です。この情報は、セクション3.1.4に記載pim_include（*、G）マクロによって使用されます。"
    },
    {
      "indent": 3,
      "text": "PIM Join/Prune state is the result of receiving PIM (*,G) Join/Prune messages on this interface, and is specified in Section 3.4.1. The state is used by the macros that calculate the outgoing interface list in Section 3.1.4, and in the JoinDesired(G) macro (defined in Section 3.4.2) that is used in deciding whether a Join(*,G) should be sent upstream.",
      "ja": "PIM /プルーン状態は、このインターフェイス上でPIM（*、G）参加/プルーンメッセージを受信した結果であり、セクション3.4.1で指定され参加。状態は、セクション3.1.4に発信インターフェイスリストを計算するマクロによって使用され、（G、*）に参加するかどうかを決定する際に使用される（セクション3.4.2で定義された）JoinDesired（G）マクロ内であるべきであるれます上流に送りました。"
    },
    {
      "indent": 3,
      "text": "The upstream Join/Prune timer is used to send out periodic Join(*,G) messages, and to override Prune(*,G) messages from peers on an upstream LAN interface.",
      "ja": "上流の参加/プルーンタイマーは、定期的な参加（*、G）メッセージを送信すると、上流のLANインターフェイス上のピアからプルーン（*、G）メッセージを無効にするために使用されます。"
    },
    {
      "indent": 3,
      "text": "The last RPA used must be stored because if the group to RPA mapping changes (see RP Set changes in [4]), then state must be torn down and rebuilt for groups whose RPA changes.",
      "ja": "使用された最後のRPAを記憶しなければならないのでならRPAマッピングの変更は、状態が解体されなければならない（[4]におけるRPセットの変更を参照）、そのRPA変更グループに対して再構築するグループ。"
    },
    {
      "indent": 0,
      "text": "3.1.4. State Summarization Macros",
      "section_title": true,
      "ja": "3.1.4。国家要約マクロ"
    },
    {
      "indent": 3,
      "text": "Using this state, we define the following \"macro\" definitions that we will use in the descriptions of the state machines and pseudocode in the following sections.",
      "ja": "この状態を使用して、我々は次のセクションでは、ステートマシンと擬似コードの記述に使用されます、次の「マクロ」の定義を定義します。"
    },
    {
      "indent": 4,
      "text": "olist(G) = RPF_interface(RPA(G)) (+) joins(G) (+) pim_include(G)",
      "ja": "OLIST（G）= RPF_interface（RPA（G））（+）（G）ジョイン（+）pim_include（G）"
    },
    {
      "indent": 3,
      "text": "RPF_interface(RPA) is the interface the MRIB indicates would be used to route packets to RPA. The olist(G) is the list of interfaces on which packets to group G must be forwarded.",
      "ja": "RPF_interface（RPA）はMRIBがRPAにパケットをルーティングするために使用される示すインターフェースです。 OLIST（G）が転送されなければならないグループGにパケットれたインターフェースのリストです。"
    },
    {
      "indent": 3,
      "text": "The macro pim_include(G) indicates the interfaces to which traffic might be forwarded because of hosts that are local members on that interface.",
      "ja": "マクロpim_include（G）は、トラフィックが原因で、そのインターフェイス上でローカルメンバーでホストから転送される可能性があるにインターフェイスを示します。"
    },
    {
      "indent": 4,
      "text": "pim_include(G) = { all interfaces I such that: I_am_DF(RPA(G),I) AND local_receiver_include(G,I) }",
      "ja": "pim_include（G）= {すべてのインタフェースIように：I_am_DF（RPA（G）、I）AND local_receiver_include（G、I）}"
    },
    {
      "indent": 3,
      "text": "The clause \"I_am_DF(RPA,I)\" is TRUE if the router is in the Win or Backoff states in the DF election state machine (described in Section 3.5) for the given RPA on interface I. Otherwise, it is FALSE.",
      "ja": "句「I_am_DF（RPA、I）は、」そうでなければ、それはFALSEであるルータが勝つか、バックオフである場合、インタフェースI.に与えられたRPAのため（3.5節で説明）DF選定ステートマシンで述べTRUEです。"
    },
    {
      "indent": 3,
      "text": "The clause \"local_receiver_include(G,I)\" is true if the IGMP module, MLD module, or other local membership mechanism has determined that there are local members on interface I that desire to receive traffic sent to group G.",
      "ja": "IGMPモジュールは、MLDモジュール、または他のローカルメンバーシップ機構がグループGに送信されたインターフェースIトラフィックを受信するために、その欲求のローカルメンバーが存在すると判断した場合句「local_receiver_include（G、I）が」真であります"
    },
    {
      "indent": 3,
      "text": "The set \"joins(G)\" is the set of all interfaces on which the router has received (*,G) Joins:",
      "ja": "セット「（G）ジョイン」は、ルータが受信したすべてのインターフェイスのセット（*、G）が参加されます。"
    },
    {
      "indent": 3,
      "text": "joins(G) = { all interfaces I such that I_am_DF(RPA(G),I) AND DownstreamJPState(G,I) is either Joined or PrunePending }",
      "ja": "（G）= {I_am_DF（RPA（G）、I）AND DownstreamJPState（G、I）が参加又はPrunePendingれるかことを私はこのようなすべてのインターフェースを}合流"
    },
    {
      "indent": 3,
      "text": "DownstreamJPState(G,I) is the state of the finite state machine in Section 3.4.1.",
      "ja": "DownstreamJPState（G、I）は、セクション3.4.1における有限状態機械の状態です。"
    },
    {
      "indent": 3,
      "text": "RPF_DF(RPA) is the neighbor that Join messages must be sent to in order to build the group shared tree rooted at the RPL for the given RPA. This is the Designated-Forwarder on the RPF_interface(RPA).",
      "ja": "RPF_DF（RPA）は、与えられたRPAのためのRPLをルートグループ共有ツリーを構築するためにに送信する必要がありJoinメッセージを隣人です。これはRPF_interface（RPA）に指定-フォワーダです。"
    },
    {
      "indent": 0,
      "text": "3.2. PIM Neighbor Discovery",
      "section_title": true,
      "ja": "3.2。 PIMの近隣探索"
    },
    {
      "indent": 3,
      "text": "PIM routers exchange PIM-Hello messages with their neighboring PIM routers. These messages are used to update the Neighbor State described in Section 3.1. The procedures for generating and processing Hello messages as well as maintaining Neighbor State are specified in the PIM-SM [4] documentation.",
      "ja": "PIMルータその隣接PIMルータとの交流PIM-Helloメッセージ。これらのメッセージは、3.1節で説明した近隣国家を更新するために使用されています。生成処理Helloメッセージを同様に隣人状態を維持するための手順は、PIM-SM [4]マニュアルで指定されています。"
    },
    {
      "indent": 3,
      "text": "BIDIR-PIM introduces the Bidirectional Capable PIM-Hello option that MUST be included in all Hello messages from a BIDIR-PIM capable router. The Bidirectional Capable option advertises the router's ability to participate in the BIDIR-PIM protocol. The format of the Bidirectional Capable option is described in Section 3.7.",
      "ja": "BIDIR-PIMはBIDIR-PIM対応ルータからのすべてのHelloメッセージに含まれなければならない双方向できるPIM-こんにちはオプションを紹介します。双方向が可能なオプションはBIDIR-PIMプロトコルに参加するルータの能力をアドバタイズします。双方向が可能なオプションの形式は、3.7節に記述されています。"
    },
    {
      "indent": 3,
      "text": "If a BIDIR-PIM router receives a PIM-Hello message that does not contain the Bidirectional Capable option from one of its neighbors, the error must be logged to the router administrator in a rate-limited manner.",
      "ja": "BIDIR-PIMルータはその隣人の1から双方向が可能なオプションが含まれていないPIM-Helloメッセージを受信した場合、エラーレートが制限された方法で、ルータの管理者にログインする必要があります。"
    },
    {
      "indent": 0,
      "text": "3.3. Data Packet Forwarding Rules",
      "section_title": true,
      "ja": "3.3。データパケット転送ルール"
    },
    {
      "indent": 3,
      "text": "For groups mapping to a given RPA, the following responsibilities are uniquely assigned to the DF for that RPA on each link:",
      "ja": "所与RPAのグループマッピングのために、以下の責任を一意に各リンク上のRPAのためのDFに割り当てられています。"
    },
    {
      "indent": 3,
      "text": "o The DF is the only router that forwards packets traveling downstream onto the link.",
      "ja": "O DFは、リンクの上、下流移動するパケットを転送する唯一のルータがあります。"
    },
    {
      "indent": 3,
      "text": "o The DF is the only router that picks-up upstream traveling packets off the link to forward towards the RPL.",
      "ja": "O DFは、ピック・アップ上流移動するパケットをリンクオフRPLに向けて転送するように、唯一のルータがあります。"
    },
    {
      "indent": 3,
      "text": "Non-DF routers on a link, which use that link as their RPF interface to reach the RPA, may perform the following forwarding actions for bidirectional groups:",
      "ja": "RPAに到達するために彼らのRPFインターフェイスとしてそのリンクを使用するリンク上の非DFルータは、双方向のグループのための次の転送アクションを実行することがあります。"
    },
    {
      "indent": 3,
      "text": "o Forward packets from the link towards downstream receivers.",
      "ja": "下流の受信機へのリンクからOパケットを転送。"
    },
    {
      "indent": 3,
      "text": "o Forward packets from downstream sources onto the link (provided they are the DF for the downstream link from which the packet was picked-up).",
      "ja": "リンクに下流源からO転送パケット（これらは、パケットが、ピックアップされたダウンストリームリンクに対してDF提供されます）。"
    },
    {
      "indent": 3,
      "text": "The BIDIR-PIM packet forwarding rules are defined below in pseudocode.",
      "ja": "BIDIR-PIMパケット転送ルールは、擬似コードで以下に定義されます。"
    },
    {
      "indent": 6,
      "text": "iif is the incoming interface of the packet. G is the destination address of the packet (group address). RPA is the Rendezvous Point Address for this group.",
      "ja": "IIFは、パケットの着信インターフェイスです。 Gはパケット（グループアドレス）の宛先アドレスです。 RPAは、このグループのランデブーポイントアドレスです。"
    },
    {
      "indent": 3,
      "text": "First we check to see whether the packet should be accepted based on TIB state and the interface that the packet arrived on. A packet is accepted if it arrives on the RPF interface to reach the RPA (downstream traveling packet) or if the router is the DF on the interface the packet arrives (upstream traveling packet).",
      "ja": "まず、パケットがTIB状態とパケットが到着したインターフェイスに基づいて受け入れられるべきであるかどうかを確認します。それはRPA（下流走行パケット）に到達するRPFインターフェイスに到着した場合、またはルータがパケット（上流走行パケット）の到着インタフェース上DFである場合、パケットは受け入れられます。"
    },
    {
      "indent": 3,
      "text": "If the packet should be forwarded, we build an outgoing interface list for the packet.",
      "ja": "パケットを転送する必要がある場合、我々は、パケットの発信インターフェイスリストを構築します。"
    },
    {
      "indent": 3,
      "text": "Finally, we remove the incoming interface from the outgoing interface list we've created, and if the resulting outgoing interface list is not empty, we forward the packet out of those interfaces.",
      "ja": "最後に、私たちが作成した発信インターフェイスリストから着信インターフェイスを削除し、そして得られた発信インターフェイスリストが空でない場合、我々は、これらのインタフェースのうち、パケットを転送します。"
    },
    {
      "indent": 3,
      "text": "On receipt of data to G on interface iif: if( iif == RPF_interface(RPA) || I_am_DF(RPA,iif) ) { oiflist = olist(G) (-) iif forward packet on all interfaces in oiflist }",
      "ja": "{ -  oiflist内のすべてのインターフェイス上でのIIF転送パケット（）oiflist = OLIST（G）} IF（IIF == RPF_interface（RPA）|| I_am_DF（RPA、IIF））：IIFインタフェース上のGへのデータを受信します"
    },
    {
      "indent": 0,
      "text": "3.3.1. Upstream Forwarding at RP",
      "section_title": true,
      "ja": "3.3.1。 RPの上流に転送"
    },
    {
      "indent": 3,
      "text": "When configuring a BIDIR-PIM domain, it is possible to assign the Rendezvous Point Address (RPA) such that it does not belong to a physical box but instead is simply a routable address. Routers that have interfaces on the RPL that the RPA belongs to will upstream forward traffic onto the link. Joins from receivers in the domain will propagate hop-by-hop till they reach one of the routers connected to the RPL where they will terminate (as there will be no DF elected on the RPL).",
      "ja": "BIDIR-PIMドメインを設定する場合、物理的なボックスに属していないようにランデブーポイントアドレス（RPA）を割り当てることが可能であるが、代わりに、単純にルーティング可能なアドレスです。 RPAは、リンクにトラフィックを転送します上流に属していることをRPL上のインターフェイスを持つルータ。彼らは（RPLに選出された何のDFがないように）彼らは終了しますRPLに接続されたルータの1に達するまで、ホップバイホップを伝播するドメインの受信機から参加。"
    },
    {
      "indent": 3,
      "text": "If instead the administrator chooses to configure the RPA to be the address of a physical interface of a specific router, then nothing changes. That router must still upstream forward traffic on to the RPL and behave no differently than any other router with an interface on the RPL.",
      "ja": "代わりに、管理者が特定のルータの物理インターフェイスのアドレスにRPAを設定することを選択した場合、何も変わりません。そのルータは、RPLの上、まだ上流トラフィックを転送して、RPLのインターフェイスを持つ他のルータとは異なる全く振る舞いはなりません。"
    },
    {
      "indent": 3,
      "text": "To configure a BIDIR-PIM network to operate in a mode similar to that of PIM-SM where a single router (the RP) is acting as the root of the distribution tree, the RPA can be configured to be the loopback interface of a router.",
      "ja": "単一ルータ（RP）は、配​​信ツリーのルートとして機能しているPIM-SMのものと同様のモードで動作するようにBIDIR-PIMネットワークを設定するために、RPAは、ルータのループバックインタフェースであるように構成することができます。"
    },
    {
      "indent": 0,
      "text": "3.3.2. Source-Only Branches",
      "section_title": true,
      "ja": "3.3.2。ソースのみのブランチ"
    },
    {
      "indent": 3,
      "text": "Source-only branches of the distribution tree for a group G are branches that do not lead to any receivers, but that are used to forward packets traveling upstream from sources towards the RPL. Routers along source-only branches only have the RPF interface to the RPA in their olist for G, and hence do not need to maintain any group specific state. Upstream forwarding can be performed using only RPA specific state. An implementation may decide to maintain group state for source-only branches for accounting or performance reasons. However, doing so requires data-driven events (to discover the groups with active sources), thus sacrificing one of the main benefits of BIDIR-PIM.",
      "ja": "グループGの配布ツリーのソースのみのブランチがどの受信機につながらないが、それはRPLに向けた情報源から上流に移動するパケットを転送するために使用されている枝です。ソースのみの枝に沿ってルータは、Gのみのために彼らのOLISTでRPAへのRPFインターフェイスを持ち、したがって、任意のグループの特定の状態を維持する必要はありません。上流の転送は、RPA、特定の状態を使用して行うことができます。実装は、会計やパフォーマンスの理由から、ソースのみの支店のグループ状態を維持するように決定することができます。しかし、そうすることはこれBIDIR-PIMの主な利点の一つを犠牲にする、（アクティブソースとグループを発見するために）データ駆動型のイベントが必要です。"
    },
    {
      "indent": 0,
      "text": "3.3.3. Directly Connected Sources",
      "section_title": true,
      "ja": "3.3.3。直接接続されているソース"
    },
    {
      "indent": 3,
      "text": " A major advantage of using a Designated Forwarder in BIDIR-PIM compared to PIM-SM is that special treatment is no longer required for sources that are directly connected to a router. Data from such sources does not need to be differentiated from other multicast traffic and will automatically be picked up by the DF and forwarded upstream. This removes the need for performing a directly-connected-source check for data to groups that do not have existing state.",
      "ja": "PIM-SMに比べBIDIR-PIMで指定フォワーダを使用することの主な利点は、特別な治療がもはやルータに直接接続されているソースに必要とされることはありません。そのような情報源からのデータは、他のマルチキャストトラフィックと区別する必要がないと自動的に上流のDFでピックアップし、転送されます。これは、既存の状態を持っていないグループにデータの直接接続されたソースのチェックを実行する必要がなくなります。"
    },
    {
      "indent": 0,
      "text": "3.4. PIM Join/Prune Messages",
      "section_title": true,
      "ja": "3.4。 PIM /プルーンのメッセージに参加"
    },
    {
      "indent": 3,
      "text": "BIDIR-PIM Join/Prune messages are used to construct group-specific distribution trees between receivers and the RPL. Joins are originated by last-hop routers that are elected as the DF on an interface with directly connected receivers. The Joins propagate hop-by-hop towards the RPA until they reach a router connected to the RPL.",
      "ja": "BIDIR-PIM参加/プルーンメッセージは、受信機とRPLの間にグループ固有の分散ツリーを構築するために使用されます。直接接続された受信機とのインタフェース上DFとして選出され、最後のホップルータによって発信されるジョイン。彼らはRPLに接続されたルータに到達するまで、ホップバイホップRPAへの伝播を結合します。"
    },
    {
      "indent": 3,
      "text": "A BIDIR-PIM Join/Prune message consists of a list of Joined and Pruned Groups. When processing a received Join/Prune message, each Joined or Pruned Group is effectively considered individually by applying the following state machines. When considering a Join/Prune message whose PIM Destination field addresses this router, (*,G) Joins and Prunes can affect the downstream state machine. When considering a Join/Prune message whose PIM Destination field addresses another router, most Join or Prune entries could affect the upstream state machine.",
      "ja": "BIDIR-PIM参加/プルーンのメッセージが参加し、剪定されたグループのリストで構成されます。受信した参加/プルーンメッセージを処理する場合、それぞれが参加又はプルーニンググループを効果的に以下の状態マシンを適用することにより、個々に考えられています。そのPIM Destinationフィールドのアドレスをこのルータに参加/プルーンのメッセージ、（*、G）を考慮すると参加とプルーンは、下流のステートマシンに影響を与えることができます。そのPIM先フィールドが別のルータに対処しましょう/プルーンのメッセージを考えるとき、ほとんどの参加やプルーンのエントリは、上流のステートマシンに影響を与える可能性があります。"
    },
    {
      "indent": 0,
      "text": "3.4.1. Receiving (*,G) Join/Prune Messages",
      "section_title": true,
      "ja": "3.4.1。 （*、G）参加/プルーンのメッセージの受信"
    },
    {
      "indent": 3,
      "text": "When a router receives a Join(*,G) or Prune(*,G), it MUST first check to see whether the RP address in the message matches RPA(G) (the router's idea of what the Rendezvous Point Address is). If the RP address in the message does not match RPA(G), the Join or Prune MUST be silently dropped.",
      "ja": "ルータが参加（*、G）またはプルーン（*、G）を受信すると、それは最初のメッセージ内のRPアドレスは、RPA（G）（ランデブーポイントアドレスが何であるかのルータのアイデアを）一致するかどうかを確認するためにチェックしなければなりません。メッセージ内のRPアドレスは、RPA（G）と一致しない場合は、参加やプルーンを静かに下げなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a router has no RPA information for the group (e.g., has not recently received a BSR message), then it MAY choose to accept Join(*,G) or Prune(*,G) and treat the RP address in the message as",
      "ja": "ルータが基（例えば、最近、BSRメッセージを受信して​​いない）のためのRPA情報を持っていない場合、それは（*、G）またはプルーン（*、G）に参加受け入れることを選択し、メッセージなどでRPアドレスを扱うかもしれ"
    },
    {
      "indent": 3,
      "text": "RPA(G). If the newly discovered RPA did not previously exist for any other group, a DF election has to be initiated.",
      "ja": "RPA（G）。新たに発見されたRPAは、以前に他のグループのために存在していなかった場合は、DF選定が開始されることがあります。"
    },
    {
      "indent": 3,
      "text": "Note that a router will process a Join(*,G) targeted to itself even if it is not the DF for RP(G) on the interface on which the message was received. This is an optimisation to eliminate the Join delay of one Join period (t_periodic) in the case where a new DF processes the received Pass and Join messages in reverse order. The BIDIR-PIM forwarding logic will ensure that data packets are not forwarded on such an interface while the router is not the DF (unless it is the RPF interface towards the RPA).",
      "ja": "ルータが参加処理することに注意してください（*、G）は、メッセージを受信したインターフェイス上のRPのためのDF（G）でない場合であっても、それ自体を対象。これは、新しいDFは、受信パスを処理する場合には期間（t_periodic）に参加して、逆の順序でメッセージを参加一方の参加遅延を解消する最適化です。 BIDIR-PIM転送ロジックは、ルータがDFないが（それがRPAに向かってRPFインタフェースがない限り）そのデータ・パケットは、インターフェイス上で転送されないようになります。"
    },
    {
      "indent": 3,
      "text": "The per-interface state machine for receiving (*,G) Join/Prune Messages is given below. There are three states:",
      "ja": "（*、G）参加/プルーンメッセージを受信するためのインターフェイス単位のステートマシンを以下に示します。 3つの状態があります。"
    },
    {
      "indent": 6,
      "text": "NoInfo (NI) The interface has no (*,G) Join state and no timers running.",
      "ja": "NoInfo（NI）インタフェースには（*、G）の状態となしタイマーの実行に参加していません。"
    },
    {
      "indent": 6,
      "text": "Join (J) The interface has (*,G) Join state. If the router is the DF on this interface (I_am_DF(RPA(G),I) is TRUE), the Join state will cause us to forward packets destined for G on this interface.",
      "ja": "参加（J）インターフェースは、（*、G）ステートに参加。ルータは、このインターフェイスのDFである場合（I_am_DF（RPA（G）、I）がTRUEである）、参加状態は、私たちは、このインターフェイス上でG宛てのパケットを転送するようになります。"
    },
    {
      "indent": 6,
      "text": "PrunePending (PP) The router has received a Prune(*,G) on this interface from a downstream neighbor and is waiting to see whether the Prune will be overridden by another downstream router. For forwarding purposes, the PrunePending state functions exactly like the Join state.",
      "ja": "PrunePending（PP）ルータは、ダウンストリームネイバーから、このインターフェイス上でプルーン（*、G）を受信したとプルーンが別の下流のルータによって上書きされるかどうかを確認するために待機しています。転送のために、正確に入会状態などのPrunePending状態機能。"
    },
    {
      "indent": 3,
      "text": "In addition, the state machine uses two timers:",
      "ja": "また、ステートマシンは2つのタイマーを使用しています。"
    },
    {
      "indent": 6,
      "text": "ExpiryTimer (ET) This timer is restarted when a valid Join(*,G) is received. Expiry of the ExpiryTimer causes the interface state to revert to NoInfo for this group.",
      "ja": "ExpiryTimer（ET）有効な参加時にこのタイマーが再開される（*、G）が受信されます。 ExpiryTimerの有効期限は、このグループのためにNoInfoに戻す界面状態を引き起こします。"
    },
    {
      "indent": 6,
      "text": "PrunePendingTimer (PPT) This timer is set when a valid Prune(*,G) is received. Expiry of the PrunePendingTimer causes the interface state to revert to NoInfo for this group.",
      "ja": "有効なプルーン（*、G）を受信したときPrunePendingTimer（PPT）このタイマーが設定されています。 PrunePendingTimerの有効期限は、このグループのためにNoInfoに戻す界面状態を引き起こします。"
    },
    {
      "indent": 3,
      "text": "Figure 1: Downstream group per-interface state machine in tabular form",
      "ja": "図1：表形式の下流グループごとのインターフェイスステートマシン"
    },
    {
      "indent": 2,
      "text": "+---------------++---------------------------------------------------+\n|               ||                    Prev State                     |\n|Event          ++---------------+-----------------+-----------------+\n|               || NoInfo (NI)   | Join (J)        | PrunePending    |\n|               ||               |                 | (PP)            |\n+---------------++---------------+-----------------+-----------------+\n|               || -> J state    | -> J state      | -> J state      |\n|Receive        || start Expiry  | restart Expiry  | restart Expiry  |\n|Join(*,G)      || Timer         | Timer           | Timer; stop     |\n|               ||               |                 | PrunePending-   |\n|               ||               |                 | Timer           |\n+---------------++---------------+-----------------+-----------------+\n|Receive        || -             | -> PP state     | -> PP state     |\n|Prune(*,G)     ||               | start Prune-    |                 |\n|               ||               | PendingTimer    |                 |\n+---------------++---------------+-----------------+-----------------+\n|PrunePending-  || -             | -               | -> NI state     |\n|Timer Expires  ||               |                 | Send Prune-     |\n|               ||               |                 | Echo(*,G)       |\n+---------------++---------------+-----------------+-----------------+\n|Expiry Timer   || -             | -> NI state     | -> NI state     |\n|Expires        ||               |                 |                 |\n+---------------++---------------+-----------------+-----------------+\n|Stop Being DF  || -             | -> NI state     | -> NI state     |\n|on I           ||               |                 |                 |\n+---------------++---------------+-----------------+-----------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The transition events \"Receive Join(*,G)\" and \"Receive Prune(*,G)\" imply receiving a Join or Prune targeted to this router's address on the received interface. If the destination address is not correct, these state transitions in this state machine must not occur, although seeing such a packet may cause state transitions in other state machines.",
      "ja": "遷移イベントは、「（*、G）が参加受信」と「プルーン（*、G）を受信」に参加受ける暗示やプルーンは、受信したインターフェイス上でこのルータのアドレスを対象。宛先アドレスが正しくない場合は、このようなパケットを見てすることは、他のステートマシンの状態遷移を引き起こすかもしれないが、この状態のマシンでこれらの状態遷移は、発生してはいけません。"
    },
    {
      "indent": 3,
      "text": "On unnumbered interfaces on point-to-point links, the router's address should be the same as the source address it chose for the Hello packet it sent over that interface. However, on point-to-point links, we also RECOMMEND that PIM messages with a destination address of all zeros also be accepted.",
      "ja": "ポイントツーポイントリンク上のアンナンバードインターフェイスでは、ルータのアドレスは、それがそのインターフェイスを介して送信されるHelloパケットのために選択した送信元アドレスと同じでなければなりません。しかし、ポイントツーポイントリンク上で、我々はまた、すべてゼロの宛先アドレスを持つPIMメッセージも受け入れられることをお勧めします。"
    },
    {
      "indent": 3,
      "text": "The transition event \"Stop Being DF\" implies a DF re-election taking place on this router interface for RPA(G) and the router changing status from being the active DF to being a non-DF router (the value of the I_am_DF macro changing to FALSE).",
      "ja": "「停止ビーイングDFが」DFの再選RPAのためのこのルータインターフェイス（G）上で行われ、ルータが非DFルータであることにアクティブDFであることからステータスを変更することを意味遷移イベント（I_am_DFマクロ変更値FALSEに）。"
    },
    {
      "indent": 3,
      "text": "When ExpiryTimer is started or restarted, it is set to the HoldTime from the Join/Prune message that triggered the timer.",
      "ja": "ExpiryTimerが起動または再起動する場合は、タイマーをトリガーに参加/プルーンのメッセージからのHoldTimeに設定されています。"
    },
    {
      "indent": 3,
      "text": "When PrunePendingTimer is started, it is set to the J/P_Override_Interval if the router has more than one neighbor on that interface; otherwise, it is set to zero causing it to expire immediately.",
      "ja": "PrunePendingTimerが開始されると、ルータはそのインターフェイス上に複数の隣人を持っている場合、それはJ / P_Override_Intervalに設定されています。そうでない場合は、それがすぐに期限切れに原因がゼロに設定されています。"
    },
    {
      "indent": 3,
      "text": "The action \"Send PruneEcho(*,G)\" is triggered when the router stops forwarding on an interface as a result of a Prune. A PruneEcho(*,G) is simply a Prune(*,G) message sent by the upstream router to itself on a LAN. Its purpose is to add additional reliability so that if a Prune that should have been overridden by another router is lost locally on the LAN, then the PruneEcho may be received and cause the override to happen. A PruneEcho(*,G) need not be sent when the router has only one neighbor on the link.",
      "ja": "ルータはプルーンの結果としてインタフェースに転送停止時アクション「PruneEcho（*、G）を送る」がトリガされます。 PruneEcho（*、G）は、単にLAN上の自身にアップストリームルータによって送信されたプルーン（*、G）メッセージです。その目的は、別のルータによって上書きされているはずプルーンは、LAN上でローカルに失われた場合、その後、PruneEchoを受信して​​オーバーライドが発生する原因となることができるように、追加の信頼性を追加することです。 PruneEcho（*、G）は、ルータがリンク上の唯一の隣人を持っているときに送信する必要はありません。"
    },
    {
      "indent": 0,
      "text": "3.4.2. Sending Join/Prune Messages",
      "section_title": true,
      "ja": "3.4.2。参加/プルーンのメッセージの送信"
    },
    {
      "indent": 3,
      "text": "The downstream per-interface state machines described above hold Join state from downstream PIM routers. This state then determines whether a router needs to propagate a Join(*,G) upstream towards the RPA. Such Join(*,G) messages are sent on the RPF interface towards the RPA and are targeted at the DF on that interface.",
      "ja": "上記下流インターフェースごとの状態機械は、下流のPIMルータから状態を参加保持します。この状態は、その後、上流RPAに向けて（*、G）ルータが参加伝播する必要があるかどうかを判定する。このような参加（*、G）メッセージはRPAに向けてRPFインターフェイス上で送信され、そのインターフェイス上でDFをターゲットにしています。"
    },
    {
      "indent": 3,
      "text": "If a router wishes to propagate a Join(*,G) upstream, it must also watch for messages on its upstream interface from other routers on that subnet, and these may modify its behavior. If it sees a Join(*,G) to the correct upstream neighbor, it should suppress its own Join(*,G). If it sees a Prune(*,G) to the correct upstream neighbor, it should be prepared to override that Prune by sending a Join(*,G) almost immediately. Finally, if it sees the Generation ID (see PIM-SM specification [4]) of the correct upstream neighbor change, it knows that the upstream neighbor has lost state, and it should be prepared to refresh the state by sending a Join(*,G) almost immediately.",
      "ja": "ルータが参加（*、G）上流を伝播することを希望する場合は、それはまた、そのサブネット上の他のルータからのアップストリームインターフェイス上のメッセージを監視しなければならない、これらはその動作を変更することがあります。それが正しい上流の隣人に（*、G）参加見れば、それは自身の参加抑える必要があります（*、G）。それが正しい上流の隣人へのプルーン（*、G）を見れば、ほとんどすぐに（*、G）に参加送信することによって、そのプルーンを上書きするために準備する必要があります。それが正しい上流隣接変更の世代IDを（[4] PIM-SM仕様を参照してください）見れば最終的に、それは*（上流の隣人が状態を失っている、そして参加を送信することにより、状態をリフレッシュするために準備されるべきであることを知っていますほとんどすぐに、G）。"
    },
    {
      "indent": 3,
      "text": "In addition, changes in the next hop towards the RPA trigger a Prune off from the old next hop and join towards the new next hop. Such a change can be caused by the following two events:",
      "ja": "また、RPAに向けた次のホップの変化は古いネクストホップからプルーンをオフトリガーと新しい次のホップの方に参加します。このような変更は、次の2つのイベントによって引き起こされる可能性があります。"
    },
    {
      "indent": 6,
      "text": "o The MRIB indicates that the RPF Interface towards the RPA has changed. In this case the DF on the new RPF interface becomes the new RPF Neighbor.",
      "ja": "O MRIBはRPAへのRPFインターフェイスが変更されたことを示しています。この場合、新しいRPFインターフェイス上のDFは新しいRPFネイバーになります。"
    },
    {
      "indent": 6,
      "text": "o There is a DF re-election on the RPF interface and a new router emerges as the DF.",
      "ja": "OありRPFインターフェイス上のDFの再選挙で、新しいルータはDFとして現れます。"
    },
    {
      "indent": 3,
      "text": "The upstream (*,G) state machine only contains two states:",
      "ja": "上流（*、G）ステートマシンは、2つの状態しか含まれています。"
    },
    {
      "indent": 6,
      "text": "Not Joined The downstream state machines indicate that the router does not need to join the RPA tree for this group.",
      "ja": "参加していない下流のステートマシンは、ルータがこのグループのRPAツリーに参加する必要がないことを示しています。"
    },
    {
      "indent": 6,
      "text": "Joined The downstream state machines indicate that the router would like to join the RPA tree for this group.",
      "ja": "下流のステートマシンは、ルータがこのグループのRPAツリーに参加したいことを示している入社。"
    },
    {
      "indent": 3,
      "text": "In addition, one timer JT(G) is kept, which is used to trigger the sending of a Join(*,G) to the upstream next hop towards the RPA (the DF on the RPF interface for RPA(G)).",
      "ja": "加えて、1つのタイマーJT（G）は、RPA（RPAのためのRPFインターフェイス上のDF（G））に向かってアップストリームの次のホップに参加（*、G）の送信をトリガするために使用され、維持されます。"
    },
    {
      "indent": 10,
      "text": "Figure 2: Upstream group state machine in tabular form",
      "ja": "図2：表形式の上流グループ状態マシン"
    },
    {
      "indent": 2,
      "text": "+---------------------+----------------------------------------------+\n|                     |                    Event                     |\n|  Prev State         +-----------------------+----------------------+\n|                     |   JoinDesired(G)      |    JoinDesired(G)    |\n|                     |   ->True              |    ->False           |\n+---------------------+-----------------------+----------------------+\n|                     |   -> J state          |    -                 |\n|  NotJoined (NJ)     |   Send Join(*,G);     |                      |\n|                     |   Set Timer to        |                      |\n|                     |   t_periodic          |                      |\n+---------------------+-----------------------+----------------------+\n|  Joined (J)         |   -                   |    -> NJ state       |\n|                     |                       |    Send Prune(*,G)   |\n+---------------------+-----------------------+----------------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "In addition, we have the following transitions that occur within the Joined state:",
      "ja": "また、当社は、接合状態内で発生し、次の遷移を持っています："
    },
    {
      "indent": 2,
      "text": "+--------------------------------------------------------------------+\n|                        In Joined (J) State                         |\n+----------------+----------------+-----------------+----------------+\n|Timer Expires   | See Join(*,G)  | See Prune(*,G)  | RPF_DF(RPA(G)) |\n|                | to             | to              | GenID changes  |\n|                | RPF_DF(RPA(G)) | RPF_DF(RPA(G))  |                |\n+----------------+----------------+-----------------+----------------+\n|Send            | Increase Timer | Decrease Timer  | Decrease Timer |\n|Join(*,G); Set  | to             | to t_override   | to t_override  |\n|Timer to        | t_suppressed   |                 |                |\n|t_periodic      |                |                 |                |\n+----------------+----------------+-----------------+----------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "+--------------------------------------------------------------------+\n|                        In Joined (J) State                         |\n+-----------------------------------+--------------------------------+\n|    Change of RPF_DF(RPA(G))       |       RPF_DF(RPA(G)) GenID     |\n|                                   |       changes                  |\n+-----------------------------------+--------------------------------+\n|    Send Join(*,G) to new          |       Decrease Timer to        |\n|    DF; Send Prune(*,G) to         |       t_override               |\n|    old DF; set Timer to           |                                |\n|    t_periodic                     |                                |\n+-----------------------------------+--------------------------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "This state machine uses the following macro:",
      "ja": "このステートマシンは、次のマクロを使用しています："
    },
    {
      "indent": 5,
      "text": "bool JoinDesired(G) { if (olist(G) (-) RPF_interface(RPA(G))) != NULL return TRUE else return FALSE }",
      "ja": "BOOL JoinDesired（G）{もし！（OLIST（G）（ - ）RPF_interface（RPA（G）））= NULL戻り他TRUEはFALSEを返します}"
    },
    {
      "indent": 0,
      "text": "3.5. Designated Forwarder (DF) Election",
      "section_title": true,
      "ja": "3.5。指定フォワーダ（DF）選挙"
    },
    {
      "indent": 3,
      "text": "This section presents a fail-safe mechanism for electing a per-RPA designated router on each link in a BIDIR-PIM domain. We call this router the Designated Forwarder (DF). The DF election does not take place on the RPL for an RPA.",
      "ja": "このセクションでは、BIDIR-PIMドメイン内の各リンクにあたり-RPA指定ルータを選出のためのフェイルセーフメカニズムを提供します。私たちは、指定フォワーダ（DF）このルータを呼び出します。 DF選定は、RPAのためのRPLに行われません。"
    },
    {
      "indent": 0,
      "text": "3.5.1. DF Requirements",
      "section_title": true,
      "ja": "3.5.1。 DFの要件"
    },
    {
      "indent": 3,
      "text": "The DF election chooses the best router on a link to assume responsibility for forwarding traffic between the RPL and the link for the range of multicast groups served by the RPA. Different multicast groups that share a common RPA share the same upstream direction. Hence, the election of an upstream forwarder on each link does not have to be a group-specific decision but instead can be RPA-specific. As the number of RPAs is typically small, the number of elections that have to be performed is significantly reduced by this observation.",
      "ja": "DF選定は、RPLとRPAが提供するマルチキャストグループの範囲のためのリンク間でトラフィックを転送するための責任を負うために、リンク上で最高のルータを選択します。共通のRPAを共有する異なるマルチキャストグループは、同じアップストリーム方向を共有します。したがって、各リンク上のアップストリームフォワーダの選挙は、グループ固有の意思決定をする必要はありませんが、代わりにRPA-特定することができます。 RPASの数は、典型的には小さいように、実行されなければならない選挙の数を大幅この観察によって低減されます。"
    },
    {
      "indent": 3,
      "text": "To optimise tree creation, it is desirable that the winner of the election process should be the router on the link with the \"best\" unicast routing metric (as reported by the MRIB) to reach the RPA. When comparing metrics from different unicast routing protocols, we use the same comparison rules used by the PIM-SM assert process [4].",
      "ja": "ツリーの作成を最適化するためには、選挙プロセスの勝者はRPAに到達する（MRIBによって報告されるように）「最良の」ユニキャストルーティングメトリックとのリンク上のルータであることが望ましいです。異なるユニキャストルーティングプロトコルのメトリックを比較した場合、PIM-SMが使用する我々が使用するのと同じ比較ルールは、[4]の処理をアサート。"
    },
    {
      "indent": 3,
      "text": "The election process needs to take place when information on a new RPA initially becomes available. The result can be re-used as new bidir groups that map to the same RPA are encountered. However, there are some conditions under which an update to the election is required:",
      "ja": "選挙プロセスは、新たなRPAの情報が最初に利用可能になったときに場所を取る必要があります。その結果、発生した同じRPAにマップする新しい双方向グループとして再使用することができます。しかし、選挙への更新が必要とされるの下でいくつかの条件があります。"
    },
    {
      "indent": 6,
      "text": "o There is a change in unicast metric to reach the RPA for any of the routers on the link.",
      "ja": "Oリンク上のルータのいずれかのRPAに到達するために、ユニキャストメトリックの変化があります。"
    },
    {
      "indent": 6,
      "text": "o The interface on which the RPA is reachable (RPF Interface) changes to an interface for which the router was previously the DF.",
      "ja": "RPAが到達されたインターフェース（RPFインタフェース）Oルータが以前DFであったためにインターフェイスに変化します。"
    },
    {
      "indent": 6,
      "text": "o A new PIM neighbor starts up on a link that must participate in the elections and be informed of the current outcome.",
      "ja": "O新しいPIMネイバーが選挙に参加しなければならないと現在の結果が通知されたリンク上で起動します。"
    },
    {
      "indent": 6,
      "text": "o The elected DF fails (detected through neighbor information timeout or MRIB RPF change at downstream router).",
      "ja": "選出されたDFに障害が発生したO（ネイバー情報のタイムアウトまたは下流のルータでMRIBのRPFの変更を通じて検出）。"
    },
    {
      "indent": 3,
      "text": "The election process has to be robust enough to ensure with very high probability that all routers on the link have a consistent view of the DF. Given the forwarding rules described in Section 3.3, loops may result if multiple routers end-up thinking that they should be responsible for forwarding. To minimize the possibility of this occurrence, the election algorithm has been biased towards discarding DF information and suspending forwarding during periods of ambiguity.",
      "ja": "選挙プロセスは、リンク上のすべてのルータがDFの一貫したビューを持っている非常に高い確率で確保するのに十分な堅牢である必要があります。複数のルータエンドアップは、彼らが転送のために責任を負うべきであると考えた場合、セクション3.3で説明した転送ルールを考えると、ループが発生することがあります。この発生の可能性を最小限に抑えるために、選挙アルゴリズムは、DFの情報を破棄し、あいまいさの期間中に転送を一時停止に偏ってきました。"
    },
    {
      "indent": 0,
      "text": "3.5.2. DF Election Description",
      "section_title": true,
      "ja": "3.5.2。 DFの選挙説明"
    },
    {
      "indent": 3,
      "text": "This section gives an outline of the DF election process. It does not provide the definitive specification for the DF election. If any discrepancy exists between Section 3.5.3 and this section, the specification in Section 3.5.3 is to be assumed correct.",
      "ja": "このセクションでは、DF選定プロセスの概要を示します。これは、DF選定のための決定的な仕様を提供していません。任意の不一致は、セクション3.5.3、このセクションの間に存在する場合、セクション3.5.3に仕様が正しいと仮定されます。"
    },
    {
      "indent": 3,
      "text": "To perform the election of the DF for a particular RPA, routers on a link need to exchange their unicast routing metric information for reaching the RPA. Routers advertise their own metrics in Offer, Winner, Backoff, and Pass messages. The advertised metric is calculated using the RPF Interface and metric to reach the RPA available through the MRIB. When a router is participating in a DF election for an RPA on the interface that its MRIB indicates as the RPF Interface, then that router MUST always advertise an infinite metric in its election messages. When a router is participating in a DF election on an interface other than the MRIB-indicated RPF Interface then it MUST advertise the MRIB-provided metrics in its election messages.",
      "ja": "特定のRPAのためにDFの選挙を実行するには、リンク上のルータは、RPAに到達するための彼らのユニキャストルーティングメトリック情報を交換する必要があります。ルータはオファー、受賞、バックオフで独自の指標を宣伝し、メッセージを渡します。アドバタイズされたメトリックは、MRIBを介して利用可能なRPAに到達するためにRPFインターフェイスおよびメトリックを使用して計算されます。ルータがMRIBがRPFインターフェイスとして示しインターフェイスでRPAのためのDF選定に参加している場合は、そのルータは、常に選挙のメッセージに無限のメトリックをアドバタイズする必要があります。ルータがMRIBで示したRPFインターフェイス以外のインターフェイス上でDF選定に参加しているとき、それはその選挙のメッセージにMRIBが提供するメトリックをアドバタイズする必要があります。"
    },
    {
      "indent": 3,
      "text": "In the election protocol described below, many message exchanges are repeated Election_Robustness times for reliability. In all those cases, the message retransmissions are spaced in time by a small random interval. All of the following description is specific to the election on a single link for a single RPA.",
      "ja": "以下に説明する選挙プロトコルでは、多くのメッセージ交換は、信頼性Election_Robustness回繰り返されます。これらすべての場合において、メッセージ再送信は、小さなランダムな間隔によって時間的に間隔を置いて配置されています。以下の記述はすべて、単一のRPAのための単一のリンク上の選挙に固有のものです。"
    },
    {
      "indent": 0,
      "text": "3.5.2.1. Bootstrap Election",
      "section_title": true,
      "ja": "3.5.2.1。ブートストラップ選挙"
    },
    {
      "indent": 3,
      "text": "Initially, when no DF has been elected, routers finding out about a new RPA start participating in the election by sending Offer messages. Offer messages include the router's metric to reach the RPA. Offers are periodically retransmitted with a period of Offer_Interval.",
      "ja": "最初は、とき何のDFは、ルータが新しいRPAは、オファーメッセージを送ることによって、選挙に参加して開始について調べること、選出されていません。オファーメッセージは、RPAに到達するためのルータのメトリックが含まれます。オファーは定期的にOffer_Intervalの周期で再送されています。"
    },
    {
      "indent": 3,
      "text": "If a router hears a better offer than its own from a neighbor, it stops participating in the election for a period of Election_Robustness * Offer_Interval, thus giving a chance to the neighbor with the better metric to be elected DF. If during this period no winner is elected, the router restarts the election from the beginning. If at any point during the initial election a router receives an out of order offer with worse metrics than its own, then it restarts the election from the beginning.",
      "ja": "ルータがネイバーから、自身のより良いプランを聞けば、それはこのようにDF選出するためのより良いメトリックで隣人にチャンスを与え、Election_Robustness * Offer_Intervalの期間のために選挙に参加して停止します。この期間中に何の勝者が選出されていない場合、ルータは最初から選挙を再起動します。最初の選挙の中の任意の時点で、ルータは、自身よりも悪いメトリックを持つためのオファーのうちを受信した場合、それは最初から選挙を再起動します。"
    },
    {
      "indent": 3,
      "text": "The result should be that all routers except the best candidate stop advertising their offers.",
      "ja": "結果は、最高の候補者を除くすべてのルータが自分のオファーを宣伝停止することでなければなりません。"
    },
    {
      "indent": 3,
      "text": "A router assumes the role of the DF after having advertised its metrics Election_Robustness times without receiving any offer from any other neighbor. At that point, it transmits a Winner message that declares to every other router on the link the identity of the winner and the metrics it is using.",
      "ja": "ルータは、他のネイバーからの任意のオファーを受けることなく、そのメトリックElection_Robustness回の広告を出した後にDFの役割を前提としています。その時点で、それがリンクの上に他のすべてのルータに勝者とそれが使用されるメトリックのアイデンティティを宣言受賞メッセージを送信します。"
    },
    {
      "indent": 3,
      "text": "Routers receiving a Winner message stop participating in the election and record the identity and metrics of the winner. If the local metrics are better than those of the winner, then the router records the identity of the winner (accepting it as the acting DF) but re-initiates the election to try and take over.",
      "ja": "勝者メッセージを受信したルータは、選挙に参加して停止し、勝者のアイデンティティとメトリックを記録します。ローカルメトリックは、勝者のものより優れている場合、ルータは勝者のアイデンティティを記録する（演技DFとしてそれを受け入れる）が、試してみて引き継ぐために選挙を再起動します。"
    },
    {
      "indent": 0,
      "text": "3.5.2.2. Loser Metric Changes",
      "section_title": true,
      "ja": "3.5.2.2。敗者メトリックの変更"
    },
    {
      "indent": 3,
      "text": "Whenever the unicast metric to an RPA changes at a non-DF router to a value that is better than that previously advertised by the acting DF, the router with the new better metric should take action to eventually assume forwarding responsibility. When the metric change is detected, the non-DF router with the now better metric restarts the DF election process by sending Offer messages with this new metric. Note that at any point during an election if no response is received after Election_Robustness retransmissions of an offer, a router assumes the role of the DF following the usual Winner announcement procedure.",
      "ja": "RPAへのユニキャストメトリックは、以前に演技DFによって広告よりも優れている値に非DFのルータで変更するたびに、新しいより良いメトリックを持つルータが最終的に責任を転送すると仮定する行動を取る必要があります。メトリックの変更が検出されると、今より良いメトリックが再起動した非DFルータこの新しいメトリックとオファーメッセージを送信することにより、DF選定プロセス。応答がオファーのElection_Robustness再送後に受信されない場合、選挙中の任意の時点で、ルータは通常の受賞発表の手順に従ってDFの役割を前提としています。"
    },
    {
      "indent": 3,
      "text": "Upon receipt of an offer that is worse than its current metric, the DF will respond with a Winner message declaring its status and advertising its better metric. Upon receiving the Winner message, the originator of the Offer records the identity of the DF and aborts the election.",
      "ja": "その現在のメトリックよりも悪いのオファーを受信すると、DFは勝者のメッセージがその地位を宣言し、その優れたメトリックをアドバタイズすると応答します。勝者メッセージを受信すると、オファーの発信元はDFのアイデンティティを記録し、選挙を中止します。"
    },
    {
      "indent": 3,
      "text": "Upon receipt of an offer that is better than its current metric, the DF records the identity and metrics of the offering router and responds with a Backoff message. This instructs the offering router to hold off for a short period of time while the unicast routing stabilizes and other routers get a chance to put in their offers. The Backoff message includes the offering router's new metric and address. All routers on the link that have pending offers with metrics worse than those in the Backoff message (including the original offering router) will hold further offers for a period of time defined in the Backoff message.",
      "ja": "その現在のメトリックよりも優れているのオファーを受信すると、DFは募集ルータのアイデンティティとメトリックを記録し、バックオフメッセージで応答します。これは、ユニキャストルーティングが安定し、他のルータがその申し出に置くためにチャンスを得る一方で、時間の短い期間のためにオフに保持するために提供ルータに指示します。バックオフメッセージが提供ルータの新しいメトリックとアドレスが含まれています。 （オリジナルの募集ルータを含む）バックオフメッセージのものよりも悪いメトリックを持つ保留中のオファーを持っているリンク上のすべてのルータは、バックオフメッセージで定義された期間のための更なるオファーを開催します。"
    },
    {
      "indent": 3,
      "text": "If a third router sends a better offer during the Backoff_Period, the Backoff message is repeated for the new offer and the Backoff_Period is restarted.",
      "ja": "第三ルータがBackoff_Period中に、より良いプランを送信した場合、バックオフメッセージは、新たな提供のために繰り返され、Backoff_Periodが再起動されます。"
    },
    {
      "indent": 3,
      "text": "Before the Backoff_Period expires, the acting DF nominates the router having made the best offer as the new DF using a Pass message. This message includes the IDs and metrics of both the old and new DFs. The old DF stops performing its tasks at the time the Pass message transmission is made. The new DF assumes the role of the DF as soon as it receives the Pass message. All other routers on the link take note of the new DF and its metric. Note that this event constitutes an RPF Neighbor change, which may trigger Join messages to the new DF (see Section 3.4).",
      "ja": "Backoff_Periodの有効期限が切れる前に、演技DFは、ルータがパスメッセージを使用して、新しいDFとして最適な提案をした指名します。このメッセージは、新旧両方のDFのIDとメトリックが含まれます。古いDFはパスメッセージの送信が行われた時点でそのタスクを実行停止します。新しいDFはすぐにそれがパスメッセージを受信するとDFの役割を前提としています。リンク上の他のすべてのルータは、新たなDFとそのメトリックのノートを取ります。このイベントは、新しいDFへのJoinメッセージを引き起こす可能性RPFネイバーの変更を構成することに注意してください（セクション3.4を参照してください）。"
    },
    {
      "indent": 0,
      "text": "3.5.2.3. Winner Metric Changes",
      "section_title": true,
      "ja": "3.5.2.3。受賞メトリックの変更"
    },
    {
      "indent": 3,
      "text": "If the DF's routing metric to reach the RPA changes to a worse value, it sends a set of Election_Robustness randomly spaced Winner messages on the link, advertising the new metric. Routers that receive this announcement but have a better metric may respond with an Offer message that results in the same handoff procedure described above. All routers assume the DF has not changed until they see a Pass or Winner message indicating the change.",
      "ja": "DFのRPAに到達するメトリックルーティングが悪化した値に変更された場合、それが新しいメトリックをアドバタイズする、リンク上のElection_Robustnessランダム間隔の勝者メッセージのセットを送信します。この発表を受け、より良いメトリックを持っているルータは、上記と同様のハンドオフ手順になりオファーメッセージで応答することができます。すべてのルータは、彼らが変化を示すパスや受賞のメッセージが表示されるまで、DFが変更されていないと仮定します。"
    },
    {
      "indent": 3,
      "text": "There is no pressure to make this handoff quickly if the acting DF still has a path to the RPL. The old path may now be suboptimal, but it will still work while the re-election is in progress.",
      "ja": "演技DFはまだRPLへのパスを持っている場合はすぐにこのハンドオフを作るためには圧力はありません。古いパスは今、次善のかもしれませんが、再選挙が進行している間、それはまだ動作します。"
    },
    {
      "indent": 0,
      "text": "3.5.2.4. Winner Loses Path",
      "section_title": true,
      "ja": "3.5.2.4。勝者は、パスが失われます"
    },
    {
      "indent": 3,
      "text": "If a router's RPF Interface to the RPA switches to be on a link for which it is acting as the DF, then it can no longer provide forwarding services for that link. It therefore immediately stops being the DF and restarts the election. As its path to the RPA is through the link, an infinite metric is used in the Offer message it sends.",
      "ja": "RPAへのルータのRPFインターフェイスは、それがDFとして機能しているリンク上にあるように切り替えると、それはもはや、そのリンクの転送サービスを提供することはできません。したがって、すぐにDFをされて停止し、選挙を再起動します。 RPAへのパスがリンクを介してあるので、無限のメトリックは、送信するオファーメッセージで使用されています。"
    },
    {
      "indent": 0,
      "text": "3.5.2.5. Late Router Starting Up",
      "section_title": true,
      "ja": "3.5.2.5。後期ルータが起動します"
    },
    {
      "indent": 3,
      "text": "A late router starting up after the DF election process has completed will have no immediate knowledge of the election outcome. As a result, it will start advertising its metric in Offer messages. As soon as this happens, the currently elected DF will respond with a Winner message if its metric is better than the metric in the Offer message, or with a Backoff message if its metric is worse than the metric in the Offer message.",
      "ja": "DF選定プロセスが完了した後に起動下旬ルータは、選挙結果の即時知識を持っていません。その結果、オファーメッセージでそのメトリックをアドバタイズを開始します。そのメトリックは、オファーメッセージ内のメトリックよりも悪化している場合は、そのメトリックがオファーメッセージで、またはバックオフメッセージとメトリックよりも優れているかのようにすぐにこの問題が発生したとして、現在選出されているDFは勝者メッセージで応答します。"
    },
    {
      "indent": 0,
      "text": "3.5.2.6. Winner Dies",
      "section_title": true,
      "ja": "3.5.2.6。受賞この"
    },
    {
      "indent": 3,
      "text": "Whenever the DF dies, a new DF has to be elected. The speed at which this can be achieved depends on whether there are any downstream routers on the link.",
      "ja": "DFが死ぬたびに、新しいDFを選出する必要があります。これを達成することができる速度は、リンク上の任意の下流のルータが存在するかどうかによって異なります。"
    },
    {
      "indent": 3,
      "text": "If there are downstream routers, typically their MRIB reported next-hop before the DF dies will be the DF itself. They will therefore notice either a change in the metric for the route to the RPA or a change in next-hop away from the DF and can restart the election by transmitting Offer messages. If according to the MRIB the RPA is now reachable through the same link via another upstream router, an infinite metric will be used in the Offer.",
      "ja": "下流のルータが存在する場合は、DFが死ぬ前に、典型的には、そのMRIBは、ネクストホップを報告したDF自体になります。従って、それらは、離れたDFからRPAへのルートまたはネクストホップの変化のメトリックの変化のいずれかに気づくでしょうし、オファーメッセージを送信することにより、選挙を再起動することができます。 MRIBによるRPAは今、別の上流のルータを経由して同じリンクを介して到達可能である場合には、無限のメトリックはオファーに使用されます。"
    },
    {
      "indent": 3,
      "text": "If no downstream routers are present, the only way for other upstream routers to detect a DF failure is by the timeout of the PIM neighbor information, which will take significantly longer.",
      "ja": "ダウンストリームルータが存在しない場合は、他の上流のルータがDFの故障を検出するための唯一の方法は、かなり時間がかかりますPIMネイバー情報のタイムアウトです。"
    },
    {
      "indent": 0,
      "text": "3.5.3. Election Protocol Specification",
      "section_title": true,
      "ja": "3.5.3。選挙プロトコル仕様"
    },
    {
      "indent": 3,
      "text": "This section provides the definitive specification for the DF election process. If any discrepancy exists between Section 3.5.2 and this section, the specification in this section is to be assumed correct.",
      "ja": "このセクションでは、DF選定プロセスのための決定的な仕様を提供します。任意の不一致は、セクション3.5.2、このセクションの間に存在する場合、このセクションの仕様は正しいと仮定されます。"
    },
    {
      "indent": 0,
      "text": "3.5.3.1. Election State",
      "section_title": true,
      "ja": "3.5.3.1。選挙州"
    },
    {
      "indent": 3,
      "text": "The DF election state is maintained per RPA for each multicast enabled interface I on the router as introduced in Section 3.1.",
      "ja": "DF選定状態が、私は、セクション3.1で導入され、ルータ上のインターフェイスを有効にし、各マルチキャストのためのRPAごとに維持されます。"
    },
    {
      "indent": 3,
      "text": "The state machine has the following four states:",
      "ja": "ステートマシンは、次の4つの状態があります。"
    },
    {
      "indent": 6,
      "text": "Offer Initial election state. When in the Offer state, a router thinks it can eventually become the winner and periodically generates Offer messages.",
      "ja": "初期の選挙状態を提供します。ときオファー状態では、ルータは、それが最終的に勝者になることができると考えて、定期的にオファーメッセージを生成します。"
    },
    {
      "indent": 6,
      "text": "Lose In this state, the router knows that there either is a different election winner or that no router on the link has a path to the RPA.",
      "ja": "この状態で負け、ルータは、どちらかが別の選挙の勝者があることを知っているか、リンクにはルータがRPAへのパスを持っていないこと。"
    },
    {
      "indent": 6,
      "text": "Win The router is the acting DF without any contest.",
      "ja": "ルータはどんなコンテストのない演技DFで勝ちます。"
    },
    {
      "indent": 6,
      "text": "Backoff The router is the acting DF but another router has made a bid to take over.",
      "ja": "バックオフルータが動作するDFですが、別のルータが引き継ぐために入札を行いました。"
    },
    {
      "indent": 3,
      "text": "In the state machine, a router is considered to be an acting DF if it is in the Win or Backoff states.",
      "ja": "ステートマシンでは、ルータは、それが勝つか、バックオフ状態にある場合に演技DFであると考えられています。"
    },
    {
      "indent": 3,
      "text": "The operation of the election protocol makes use of the variables and timers described below:",
      "ja": "選挙プロトコルの動作を説明変数とタイマーを使用しています："
    },
    {
      "indent": 6,
      "text": "Acting DF information Used to store the identity and advertised metrics of the election winner that is the currently acting DF.",
      "ja": "現在、演技DFである選挙の勝者のアイデンティティと広告されたメトリックを格納するために使用演技のDF情報。"
    },
    {
      "indent": 6,
      "text": "DF election-Timer (DFT) Used to schedule transmission of Offer, Winner, and Pass messages.",
      "ja": "DF選挙タイマー（DFT）オファー、受賞、およびパスメッセージの送信をスケジュールするために使用します。"
    },
    {
      "indent": 6,
      "text": "Message-Count (MC) Used to maintain the number of times an Offer or Winner message has been transmitted.",
      "ja": "オファーや受賞のメッセージが送信された回数を維持するために使用するメッセージ・カウント（MC）。"
    },
    {
      "indent": 6,
      "text": "Best-Offer Used by the DF to record the identity and advertised metrics of the router that has made the last offer, for use when sending the Path message.",
      "ja": "アイデンティティとPathメッセージを送信する際に使用するため、最後のオファーをしたルータのアドバタイズされたメトリックを記録するためにDFが使用する最高のオファー。"
    },
    {
      "indent": 0,
      "text": "3.5.3.2. Election Messages",
      "section_title": true,
      "ja": "3.5.3.2。選挙メッセージ"
    },
    {
      "indent": 3,
      "text": "The election process uses the following PIM control messages. The packet format is described in Section 3.7:",
      "ja": "選挙プロセスは、以下のPIMコントロールメッセージを使用しています。パケットフォーマットは、3.7節で説明します。"
    },
    {
      "indent": 6,
      "text": "Offer (OfferingID, Metric) Sent by routers that believe they have a better metric to the RPA than the metric that has been on offer so far.",
      "ja": "彼らは、これまで提供してきたメトリックよりもRPAに優れたメトリックを持っていると信じて、ルータによって送信されたオファー（OfferingID、メートル法）。"
    },
    {
      "indent": 6,
      "text": "Winner (DF-ID, DF-Metric) Sent by a router when assuming the role of the DF or when re-asserting in response to worse offers.",
      "ja": "DFの役割を想定したとき、またはより悪い申し出に応じて再アサート時にルータによって送信され受賞（DF-ID、DF-メートル）。"
    },
    {
      "indent": 6,
      "text": "Backoff (DF-ID, DF-Metric, OfferingID, OfferMetric, BackoffInterval) Used by the DF to acknowledge better offers. It instructs other routers with equal or worse offers to wait until the DF passes responsibility to the sender of the offer.",
      "ja": "バックオフ（DF-ID、DF-メトリック、OfferingID、OfferMetric、BackoffInterval）は、より良いオファーを確認するためにDFによって使用されます。これは、DFがオファーの送信者に責任を通過するまで待つように等しいか悪い申し出を持つ他のルータに指示します。"
    },
    {
      "indent": 6,
      "text": "Pass (Old-DF-ID, Old-DF-Metric, New-DF-ID, New-DF-Metric) Used by the old DF to pass forwarding responsibility to a router that has previously made an offer. The Old-DF-Metric is the current metric of the DF at the time the pass is sent.",
      "ja": "峠（旧-DF-ID、旧-DF-メトリック、新DF-ID、新DF-メトリックは）以前のオファーをしたルータへの転送の責任を渡すために、古いDFによって使用されます。旧-DF-メトリックは、パスが送信された時点でのDFの現在の測定基準です。"
    },
    {
      "indent": 3,
      "text": "Note that when a router is participating in a DF election for an RPA on the interface that its MRIB indicates as the RPF Interface, then that router MUST always advertise an infinite metric in its election messages. When a router is participating in a DF election on an interface other than the MRIB-indicated RPF Interface, then it MUST advertise the MRIB-provided metrics in its election messages.",
      "ja": "ルータがMRIBがRPFインターフェイスとして示しインターフェイス上RPAのためのDF選定に参加しているとき、そのルータは、常にその選挙のメッセージに無限のメトリックを広告しなければならないことに注意してください。ルータがMRIBで示したRPFインターフェイス以外のインターフェイス上でDF選定に参加しているとき、それはその選挙のメッセージにMRIBが提供するメトリックをアドバタイズする必要があります。"
    },
    {
      "indent": 0,
      "text": "3.5.3.3. Election Events",
      "section_title": true,
      "ja": "3.5.3.3。選挙のイベント"
    },
    {
      "indent": 3,
      "text": "During protocol operation, the following events can take place:",
      "ja": "プロトコルの動作時には、以下のイベントを行うことができます。"
    },
    {
      "indent": 6,
      "text": "Control message reception Reception of one of the four control DF election messages (Offer, Winner, Backoff, and Pass). When a control message is received and actions are specified on a condition that metrics are Better or Worse, the comparison must be performed as follows:",
      "ja": "4つの制御DF選定メッセージのいずれかの制御メッセージ受信レセプション（オファー、受賞、バックオフ、およびパス）。制御メッセージが受信され、アクションがメトリックは良くも悪くもあることを条件に指定された場合、以下のように、比較を実行する必要があります。"
    },
    {
      "indent": 9,
      "text": "o On receipt of an Offer or Winner message, compare the current metrics for the RPA with the metrics advertised for the sender of the message.",
      "ja": "Oオファー又はウィナーメッセージを受信すると、メッセージの送信者のためにアドバタイズメトリックとRPAのための現在のメトリックを比較します。"
    },
    {
      "indent": 9,
      "text": "o On receipt of a Backoff or Pass message, compare the current metrics for the RPA with the metrics advertised for the target of the message.",
      "ja": "Oバックオフまたはパスメッセージを受信すると、メッセージのターゲットのアドバタイズメトリックとRPAのための現在のメトリックを比較します。"
    },
    {
      "indent": 6,
      "text": "Path to RPA lost Losing the path to the RPA can happen in two ways. The first happens when the route learned through the MRIB is withdrawn and the MRIB no longer reports an available route to reach the RPA. The second case happens when the next-hop information reported by the MRIB changes to indicate a next-hop that is reachable through the router interface under consideration. Clearly, as the router is using the interface as its RPF Interface, it cannot offer forwarding services towards the RPL to other routers on that link.",
      "ja": "RPAへのパスは、RPAへのパスは以下の2つの方法で発生する可能性が負け失いました。 MRIBが撤回されていないとMRIBは、もはやRPAに到達するために使用可能なルートを報告してルートが学習時に最初に発生します。 MRIB変化によって報告ネクストホップ情報は、考慮中のルータインターフェイスを介して到達可能な次のホップを指示するときに、第2のケースが起こります。ルータがRPFインターフェイスとしてインターフェイスを使用しているとして、明らかに、それは、そのリンク上の他のルータにRPLへの転送サービスを提供することはできません。"
    },
    {
      "indent": 6,
      "text": "Metric reported by the MRIB to reach the RPA changes This event is triggered when the MRIB supplied information for the RPA changes and the new information provides a path to the RPA. If the new MRIB information either reports no route or reports a next-hop interface through the interface for which the DF election is taking place, then the \"Path to RPA lost\" event triggers instead. In specific states, the event may be further filtered by specifying whether it is expected of the metric to become better or worse and which of the stored metrics the new MRIB information must be compared against. The new information must be compared with either the router's old metric, the stored DF metric, or the stored Best Offer metric.",
      "ja": "RPAに到達するためにMRIBによって報告されたメトリックは、MRIBはRPAの変更のための情報を提供し、新たな情報がRPAへのパスを提供する場合、このイベントがトリガされた変更します。新しいMRIB情報のいずれかの報告がないルートやレポート場合はDFの選挙が行われているインタフェースを介して、ネクストホップインターフェイスは、そのイベントではなくトリガー「RPAへのパスが失われました」。特定の状態では、イベントは、さらに、良いか悪いと格納されたメトリックのどの新しいMRIB情報が比較されなければならないとなるようにメトリックが期待されているかどうかを指定することによってフィルタリングすることができます。新しい情報は、ルータの古いメトリック、保存されたDFメトリック、または保存されたベストオファーメトリックのいずれかと比較されなければなりません。"
    },
    {
      "indent": 6,
      "text": "Election-Timer (DFT) expiration Expiration of the DFT election timer can cause message transmission and state transitions. The event might be further qualified by specifying the value of the Message Count (MC) as well as the current existence of a path to the RPA (as defined above).",
      "ja": "DFTの選挙タイマーの選挙タイマー（DFT）有効期限有効期限は、メッセージの送信や状態遷移を引き起こす可能性があります。 （上記で定義した）イベントは、さらに、メッセージ数（MC）、ならびにRPAへのパスの現在の存在の値を指定することによって修飾されるかもしれません。"
    },
    {
      "indent": 6,
      "text": "Detection of DF failure Detection of DF failure can occur through the timeout of PIM neighbor state.",
      "ja": "DF障害のDF故障検出の検出は、PIMネイバー状態のタイムアウトを介して起こり得ます。"
    },
    {
      "indent": 0,
      "text": "3.5.3.4. Election Actions",
      "section_title": true,
      "ja": "3.5.3.4。選挙アクション"
    },
    {
      "indent": 3,
      "text": "The DF election state machine action descriptions use the following notation in addition to the pseudocode notation described earlier in this specification:",
      "ja": "DF選定・ステート・マシンのアクションの説明は、この明細書で前述した擬似コード表記に加えて、以下の表記を使用します。"
    },
    {
      "indent": 6,
      "text": "?= denotes the operation of lowering a timer to a new value. If the timer is not running, then it is started using the new value. If the timer is running with an expiration lower than the new value, then the timer is not altered.",
      "ja": "？=新しい値にタイマーを下げる動作を示しています。タイマーが実行されていない場合、それは、新しい値を使用して開始されます。タイマーが新しい値よりも低く、有効期限で実行されている場合、タイマーは変更されません。"
    },
    {
      "indent": 3,
      "text": "When an action of \"set DF to Sender or Target\" is encountered during receipt of a Winner, Pass, or Backoff message, it means the following:",
      "ja": "「SenderにDFを設定したり、ターゲット」のアクションが受賞、パス、またはバックオフメッセージの受信時に遭遇した場合、それは次のことを意味します。"
    },
    {
      "indent": 6,
      "text": "o On receipt of a Winner message, set the DF to be the originator of the message and record its metrics.",
      "ja": "勝者メッセージを受信するとo、DFは、メッセージの発信者であること及びそのメトリックを記録するように設定します。"
    },
    {
      "indent": 6,
      "text": "o On receipt of a Pass message, set the DF to be the target of the message and record its metrics.",
      "ja": "Oパスメッセージを受信すると、DFは、メッセージのターゲットとなると、そのメトリックを記録するように設定しました。"
    },
    {
      "indent": 6,
      "text": "o On receipt of a Backoff message, set the DF to be the originator of the message and record its metrics.",
      "ja": "バックオフメッセージを受信するとo、DFは、メッセージの発信者であること及びそのメトリックを記録するように設定します。"
    },
    {
      "indent": 0,
      "text": "3.5.3.5. Election State Transitions",
      "section_title": true,
      "ja": "3.5.3.5。選挙の状態遷移"
    },
    {
      "indent": 3,
      "text": "When a Designated Forwarder election is initiated, the starting state is the Offer state, the message counter (MC) is set to zero, and the DF election Timer (DFT) is set to OPlow (see Section 3.6 for a definition of timer values).",
      "ja": "指定フォワーダ選挙が開始されると、開始状態はオファー状態で、メッセージカウンタ（MC）がゼロに設定され、かつDF選挙タイマー（DFT）は、（タイマ値の定義については、セクション3.6を参照）OPlowに設定されています。"
    },
    {
      "indent": 3,
      "text": "Figure 3: Designated Forwarder election state machine in tabular form",
      "ja": "図3：表形式で指定フォワーダ選挙ステートマシン"
    },
    {
      "indent": 2,
      "text": "+-------------+------------------------------------------------------+\n|             |                        Event                         |\n| Prev State  +-----------------+------------------+-----------------+\n|             | Recv better     |  Recv better     | Recv better     |\n|             | Pass / Win      |  Backoff         | Offer           |\n+-------------+-----------------+------------------+-----------------+\n|             | -> Lose         |  -               | -               |\n| Offer       | DF = Sender or  |  DFT = BOperiod  | DFT = OPhigh;   |\n|             | Target; Stop    |  + OPlow; MC =   | MC = 0          |\n|             | DFT             |  0               |                 |\n+-------------+-----------------+------------------+-----------------+\n|             | -               |  -               | -> Offer        |\n| Lose        | DF = Sender or  |  DF = Sender     | DFT = OPhigh;   |\n|             | Target          |                  | MC = 0          |\n+-------------+-----------------+------------------+-----------------+\n|             | -> Lose         |  -> Lose         | -> Backoff      |\n|             | DF = Sender or  |  DF = Sender;    | Set Best to     |\n| Win         | Target; Stop    |  Stop DFT        | Sender; Send    |\n|             | DFT             |                  | Backoff; DFT =  |\n|             |                 |                  | BOperiod        |\n+-------------+-----------------+------------------+-----------------+\n|             | -> Lose         |  -> Lose         | -               |\n|             | DF = Sender or  |  DF = Sender;    | Set Best to     |\n| Backoff     | Target; Stop    |  Stop DFT        | Sender; Send    |\n|             | DFT             |                  | Backoff; DFT =  |\n|             |                 |                  | BOperiod        |\n+-------------+-----------------+------------------+-----------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "+-----------+-------------------------------------------------------+\n|           |                         Event                         |\n|           +-------------+-------------+--------------+------------+\n|Prev State |Recv Backoff |Recv Pass    |Recv Worse    |Recv worse  |\n|           |for us       |for us       |Pass / Win /  |Offer       |\n|           |             |             |Backoff       |            |\n+-----------+-------------+-------------+--------------+------------+\n|           |-            |-> Win       |-             |-           |\n|           |DFT =        |Stop DFT     |Set DF to     |DFT ?=      |\n|Offer      |BOperiod +   |             |Sender or     |OPlow; MC = |\n|           |OPlow; MC =  |             |Target; DFT   |0           |\n|           |0            |             |?= OPlow; MC  |            |\n|           |             |             |= 0           |            |\n+-----------+-------------+-------------+--------------+------------+\n|           |-> Offer     |-> Offer     |-> Offer      |-> Offer    |\n|           |DF = Sender; |DF = Sender; |DF = Sender   |DFT = OPlow;|\n|Lose       |DFT = OPlow; |DFT = OPlow; |or Target;    |MC = 0      |\n|           |MC = 0       |MC = 0       |DFT = OPlow;  |            |\n|           |             |             |MC = 0        |            |\n+-----------+-------------+-------------+--------------+------------+\n|           |-> Offer     |-> Offer     |-> Offer      |-           |\n|           |DF = Sender; |DF = Sender; |DF = Sender   |Send Winner |\n|Win        |DFT = OPlow; |DFT = OPlow; |or Target;    |            |\n|           |MC = 0       |MC = 0       |DFT = OPlow;  |            |\n|           |             |             |MC = 0        |            |\n+-----------+-------------+-------------+--------------+------------+\n|           |-> Offer     |-> Offer     |-> Offer      |-> Win      |\n|           |DF = Sender; |DF = Sender; |DF = Sender   |Send Winner;|\n|Backoff    |DFT = OPlow; |DFT = OPlow; |or Target;    |Stop DFT    |\n|           |MC = 0       |MC = 0       |DFT = OPlow;  |            |\n|           |             |             |MC = 0        |            |\n+-----------+-------------+-------------+--------------+------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "+--------------------------------------------------------------------+\n|                          In Offer State                            |\n+----------------------+----------------------+----------------------+\n| DFT Expires and MC   | DFT Expires and MC   |  DFT Expires and MC  |\n| is less than         | is equal to          |  is equal to         |\n| Robustness           | Robustness and we    |  Robustness and      |\n|                      | have path to RPA     |  there is no path    |\n|                      |                      |  to RPA              |\n+----------------------+----------------------+----------------------+\n| -                    | -> Win               |  -> Lose             |\n| Send Offer; DFT =    | Send Winner          |  Set DF to None      |\n| OPlow; MC = MC + 1   |                      |                      |\n+----------------------+----------------------+----------------------+\n+--------------------------------------------------------------------+\n|                          In Offer State                            |\n+--------------------------------------------------------------------+\n|                  Metric changes and is now worse                   |\n+--------------------------------------------------------------------+\n|                  DFT ?= OPlow                                      |\n|                  MC = 0                                            |\n+--------------------------------------------------------------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "+--------------------------------------------------------------------+\n|                           In Lose State                            |\n+------------------------------+-------------------------------------+\n|     Detect DF Failure        |        Metric changes and now       |\n|                              |        is better than DF            |\n+------------------------------+-------------------------------------+\n|     -> Offer                 |        -> Offer                     |\n|     DF = None; DFT =         |        DFT = OPlow_int; MC = 0      |\n|     OPlow_int; MC = 0        |                                     |\n+------------------------------+-------------------------------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "+--------------------------------------------------------------------+\n|                           In Win State                             |\n+----------------------+-----------------------+---------------------+\n| Metric changes and   |  Timer Expires and    |  Path to RPA lost   |\n| is now worse         |  MC is less than      |                     |\n|                      |  Robustness           |                     |\n+----------------------+-----------------------+---------------------+\n| -                    |  -                    |  -> Offer           |\n| DFT = OPlow; MC =    |  Send Winner; DFT =   |  Set DF to None;    |\n| 0                    |  OPlow; MC = MC + 1   |  DFT = OPlow; MC =  |\n|                      |                       |  0                  |\n+----------------------+-----------------------+---------------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "+--------------------------------------------------------------------+\n|                         In Backoff State                           |\n+----------------------+-----------------------+---------------------+\n| Metric changes and   |  Timer Expires        |  Path to RPA lost   |\n| is now better than   |                       |                     |\n| Best                 |                       |                     |\n+----------------------+-----------------------+---------------------+\n| -> Win               |  -> Lose              |  -> Offer           |\n| Stop Timer           |  Send Pass; Set DF    |  Set DF to None;    |\n|                      |  to stored Best       |  DFT = OPlow; MC =  |\n|                      |                       |  0                  |\n+----------------------+-----------------------+---------------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3.5.4. Election Reliability Enhancements",
      "section_title": true,
      "ja": "3.5.4。選挙の信頼性の強化"
    },
    {
      "indent": 3,
      "text": "For the correct operation of BIDIR-PIM, it is very important to avoid situations where two routers consider themselves to be Designated Forwarders for the same link. The two precautions below are not required for correct operation but can help diagnose and correct anomalies.",
      "ja": "BIDIR-PIMの正しい動作のために、2つのルータに同じリンクのためのフォワーダを指定するために自分自身を検討状況を回避することが非常に重要です。下の2つの注意事項は、正しい動作のために必要されていないが、診断し、正しい異常を助けることができます。"
    },
    {
      "indent": 0,
      "text": "3.5.5. Missing Pass",
      "section_title": true,
      "ja": "3.5.5。パスがありません"
    },
    {
      "indent": 3,
      "text": "After a DF has been elected, a router whose metrics change to become better than the DF will attempt to take over. If during the re-election the acting DF has a condition that causes it to lose all of the election messages (like a CPU overload), the new candidate will transmit three offers and assume the role of the forwarder resulting in two DFs on the link. This situation is pathological and should be corrected by fixing the overloaded router. It is desirable that such an event can be detected by a network administrator.",
      "ja": "DFが選出された後、そのメトリックDFよりはましになるように変更ルータが引き継ぐしようとします。再選挙の際に働くDFはそれが（CPUの過負荷などの）選挙メッセージのすべてを失うことになり症状がある場合は、新しい候補は3つのオファーを送信し、リンク上の2人のDFの結果としてフォワーダーの役割を引き継ぎます。この状況は、病的で、オーバーロードルータを固定することにより補正する必要があります。このようなイベントは、ネットワーク管理者によって検出できることが望ましいです。"
    },
    {
      "indent": 3,
      "text": "When a router becomes the DF for a link without receiving a Pass message from the known old DF, the PIM neighbor information for the old DF can be marked to this effect. Upon receiving the next PIM Hello message from the old DF, the router can retransmit Winner messages for all the RPAs for which it is acting as the DF. The anomaly may also be logged by the router in a rate-limited manner to alert the operator.",
      "ja": "ルータが知られている古いDFからのパスメッセージを受信せずにリンクするためにDFになると、古いDFのためのPIMネイバー情報は、この効果にマークすることができます。古いDFから次のPIM Helloメッセージを受信すると、ルータはDFとして動作されているすべてのRPASための勝者メッセージを再送信することができます。異常は、オペレータに警告するためにレート制限された様式で、ルータによって記録されてもよいです。"
    },
    {
      "indent": 0,
      "text": "3.5.6. Periodic Winner Announcement",
      "section_title": true,
      "ja": "3.5.6。定期的な受賞者発表"
    },
    {
      "indent": 3,
      "text": "An additional degree of safety can be achieved by having the DF for each RPA periodically announce its status in a Winner message. Transmission of the periodic Winner message can be restricted to occur only for RPAs that have active groups, thus avoiding the periodic control traffic in areas of the network without senders or receivers for a particular RPA.",
      "ja": "安全性の追加の程度は、各RPAは、定期的に勝者のメッセージにその状態を通知するためのDFを有することによって達成することができます。周期的な勝者メッセージの送信は、このように特定のRPAのための送信者または受信することなく、ネットワークの分野で周期的制御トラフィックを回避する、唯一の活性基を有するRPASに対して発生するように制限することができます。"
    },
    {
      "indent": 0,
      "text": "3.6. Timers, Counters, and Constants",
      "section_title": true,
      "ja": "3.6。タイマ、カウンタ、および定数"
    },
    {
      "indent": 3,
      "text": "BIDIR-PIM maintains the following timers, as discussed in Section 3.1. All timers are countdown timers - they are set to a value and count down to zero, at which point they typically trigger an action. Of course they can just as easily be implemented as count-up timers, where the absolute expiry time is stored and compared against a real-time clock, but the language in this specification assumes that they count downwards to zero.",
      "ja": "3.1節で述べたようにBIDIR-PIMは、次のタイマーを維持します。すべてのタイマーはカウントダウンタイマーです - 彼らは、その時点で、彼らは一般的にアクションをトリガー、値に設定し、ゼロにカウントダウンされています。もちろん、彼らは同じように簡単に絶対有効期限の時間は、リアルタイムクロックに対して保存され、比較され、カウントアップタイマー、として実装されますが、この仕様では、言語は、彼らがゼロに下向きに数えることを前提としてすることができます。"
    },
    {
      "indent": 3,
      "text": "Per Rendezvous-Point Address (RPA):",
      "ja": "パーランデブーポイントアドレス（RPA）："
    },
    {
      "indent": 6,
      "text": "Per interface (I):",
      "ja": "インターフェイスごとに（I）："
    },
    {
      "indent": 9,
      "text": "DF Election Timer: DFT(RPA,I)",
      "ja": "DF選挙タイマー：DFT（RPA、I）"
    },
    {
      "indent": 3,
      "text": "Per Group (G):",
      "ja": "グループごと（G）："
    },
    {
      "indent": 6,
      "text": "Upstream Join Timer: JT(G)",
      "ja": "JT（G）：上流タイマー参加"
    },
    {
      "indent": 6,
      "text": "Per interface (I):",
      "ja": "インターフェイスごとに（I）："
    },
    {
      "indent": 9,
      "text": "Join Expiry Timer: ET(G,I)",
      "ja": "参加有効期限タイマー：ET（G、I）"
    },
    {
      "indent": 9,
      "text": "PrunePendingTimer: PPT(G,I)",
      "ja": "PrunePendingTimer：PPT（G、I）"
    },
    {
      "indent": 3,
      "text": "When timers are started or restarted, they are set to default values. This section summarizes those default values.",
      "ja": "タイマーが起動または再起動されると、それらはデフォルト値に設定されています。ここでは、これらのデフォルト値をまとめたもの。"
    },
    {
      "indent": 3,
      "text": "Timer Name: DF Election Timer (DFT)",
      "ja": "タイマー名：DF選挙タイマー（DFT）"
    },
    {
      "indent": 2,
      "text": "+-------------------+------------------------+-----------------------+\n| Value Name        |  Value                 |   Explanation         |\n+-------------------+------------------------+-----------------------+\n| Offer_Period      |  100 ms                |   Interval to wait    |\n|                   |                        |   between repeated    |\n|                   |                        |   Offer and Winner    |\n|                   |                        |   messages.           |\n+-------------------+------------------------+-----------------------+\n| Backoff_Period    |  1 sec                 |   Period that acting  |\n|                   |                        |   DF waits between    |\n|                   |                        |   receiving a better  |\n|                   |                        |   Offer and sending   |\n|                   |                        |   the Pass message    |\n|                   |                        |   to transfer DF      |\n|                   |                        |   responsibility.     |\n+-------------------+------------------------+-----------------------+\n| OPlow             |  rand(0.5, 1) *        |   Range of actual     |\n|                   |  Offer_Period          |   randomised value    |\n|                   |                        |   used between        |\n|                   |                        |   repeated messages.  |\n+-------------------+------------------------+-----------------------+\n| OPhigh            |  Election_Robustness   |   Interval to wait    |\n|                   |  * Offer_Period        |   in order to give a  |\n|                   |                        |   chance to a router  |\n|                   |                        |   with a better       |\n|                   |                        |   Offer to become     |\n|                   |                        |   the DF.             |\n+-------------------+------------------------+-----------------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "Timer Names: Join Expiry Timer (ET(G,I))",
      "ja": "タイマー名：参加満了タイマ（ET（G、I））"
    },
    {
      "indent": 2,
      "text": "+---------------+---------------+------------------------------------+\n|Value Name     | Value         | Explanation                        |\n+---------------+---------------+------------------------------------+\n|J/P HoldTime   | from message  | Hold Time from Join/Prune Message  |\n+---------------+---------------+------------------------------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "Timer Names: PrunePendingTimer (PPT(G,I))",
      "ja": "タイマー名：PrunePendingTimer（PPT（G、I））"
    },
    {
      "indent": 2,
      "text": "+-------------------------+-------------------+----------------------+\n| Value Name              | Value             |  Explanation         |\n+-------------------------+-------------------+----------------------+\n| J/P Override Interval   | Default: 3 secs   |  Short period after  |\n|                         |                   |  a Join or Prune to  |\n|                         |                   |  allow other         |\n|                         |                   |  routers on the LAN  |\n|                         |                   |  to override the     |\n|                         |                   |  Join or Prune       |\n+-------------------------+-------------------+----------------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "Note that the value of the J/P Override Interval is interface specific and depends on both the Propagation_Delay and the Override_Interval values that may change when Hello messages are received [4].",
      "ja": "J / Pの値がインターバルインターフェース特異的であり、PROPAGATION_DELAYとHelloメッセージを受信したときに変更することができるOverride_Interval値[4]の両方に依存オーバーライドすることに注意してください。"
    },
    {
      "indent": 2,
      "text": "Timer Names: Upstream Join Timer (JT(G))",
      "ja": "タイマー名：上流参加タイマー（JT（G））"
    },
    {
      "indent": 2,
      "text": "+------------+-------------------+-----------------------------------+\nValue Name   |Value              Explanation                         |\n+------------+-------------------+-----------------------------------+\nt_periodic   |Default: 60 secs   Period between Join/Prune Messages  |\n+------------+-------------------+-----------------------------------+\nt_suppressed |rand(1.1 *         Suppression period when someone     |\n|            |t_periodic, 1.4 *  else sends a J/P message so we      |\n|            |t_periodic)        don't need to do so.                |\n+------------+-------------------+-----------------------------------+\nt_override   |rand(0, 0.9 * J/P  Randomized delay to prevent         |\n|            |Override Interval) response implosion when sending a   |\n|            |                   Join message to override someone    |\n|            |                   else's Prune message.               |\n+------------+-------------------+-----------------------------------+",
      "raw": true
    },
    {
      "indent": 2,
      "text": "For more information about these values, refer to the PIM-SM [4] documentation.",
      "ja": "これらの値の詳細については、PIM-SM [4]マニュアルを参照してください。"
    },
    {
      "indent": 2,
      "text": "Constant Name: DF Election Robustness",
      "ja": "定数名：DF選挙頑健性"
    },
    {
      "indent": 2,
      "text": "+-------------------------+------------------+-----------------------+\n|  Constant Name          |   Value          |   Explanation         |\n+-------------------------+------------------+-----------------------+\n|  Election_Robustness    |   Default: 3     |   Minimum number of   |\n|                         |                  |   election messages   |\n|                         |                  |   that must be lost   |\n|                         |                  |   in order for        |\n|                         |                  |   election to fail.   |\n+-------------------------+------------------+-----------------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3.7. BIDIR-PIM Packet Formats",
      "section_title": true,
      "ja": "3.7。 BIDIR-PIMパケット形式"
    },
    {
      "indent": 3,
      "text": "This section describes the details of the packet formats for BIDIR-PIM control messages. BIDIR-PIM shares a number of control messages in common with PIM-SM [4]. These include the Hello and Join/Prune messages as well as the format for the Encoded-Unicast address. For details on the format of these packets, please refer to the PIM-SM documentation. Here we will only define the additional packets that are introduced by BIDIR-PIM. These are the packets used in the DF election process as well as the Bidirectional Capable PIM-Hello option.",
      "ja": "このセクションでは、BIDIR-PIM制御メッセージのパケットフォーマットの詳細について説明します。 BIDIR-PIMは、PIM-SM [4]と共通の制御メッセージの数を共有します。これらのハローを含めると/プルーンのメッセージだけでなく、エンコードされたユニキャストアドレスの形式に参加します。これらのパケットのフォーマットの詳細については、PIM-SMのドキュメントを参照してください。ここでは、唯一のBIDIR-PIMによって導入された追加パケットを定義します。これらは、DF選定プロセスだけでなく、双方向できるPIM-こんにちはオプションで使用されるパケットです。"
    },
    {
      "indent": 0,
      "text": "3.7.1. DF Election Packet Formats",
      "section_title": true,
      "ja": "3.7.1。 DF選挙パケット形式"
    },
    {
      "indent": 3,
      "text": "All PIM control messages have IP protocol number 103.",
      "ja": "すべてのPIMコントロールメッセージは、IPプロトコル番号103を持っています。"
    },
    {
      "indent": 3,
      "text": "BIDIR-PIM messages are multicast with TTL 1 to the `ALL-PIM-ROUTERS' group. The IPv4 `ALL-PIM-ROUTERS' group is `224.0.0.13'. The IPv6 `ALL-PIM-ROUTERS' group is `ff02::d'.",
      "ja": "BIDIR-PIMメッセージは、 `ALL-PIM-ルータのグループにTTL 1でマルチキャストされています。 IPv4の `ALL-PIM-ROUTERS」グループは` 224.0.0.13' です。 IPv6の `ALL-PIM-ROUTERS 'グループは` FF02 :: D' です。"
    },
    {
      "indent": 3,
      "text": "All DF election BIDIR-PIM control messages share the common header below:",
      "ja": "すべてのDF選定BIDIR-PIM制御メッセージは、以下の共通ヘッダを共有します："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|PIM Ver| Type  |Subtype| Rsvd  |           Checksum            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               RP Address (Encoded-Unicast format)           ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Sender Metric Preference                    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Sender Metric                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "PIM Ver PIM Version number is 2.",
      "ja": "PIM版PIMバージョン番号は2です。"
    },
    {
      "indent": 3,
      "text": "Type All DF-Election PIM control messages share the PIM message Type of 10.",
      "ja": "メッセージは10のPIMメッセージタイプを共有するすべてのDF-選挙のPIMコントロールを入力します。"
    },
    {
      "indent": 3,
      "text": "Subtype Subtypes for DF election messages are:",
      "ja": "DF選定メッセージのサブタイプのサブタイプは以下のとおりです。"
    },
    {
      "indent": 14,
      "text": "1 = Offer\n2 = Winner\n3 = Backoff\n4 = Pass",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Rsvd Set to zero on transmission. Ignored on receipt.",
      "ja": "RSVD送信時にゼロに設定してください。領収書の上で無視。"
    },
    {
      "indent": 3,
      "text": "Checksum A standard checksum IP checksum is used, i.e., the 16-bit one's complement of the one's complement sum of the entire PIM message. For computing the checksum, the checksum field is zeroed.",
      "ja": "サムA標準チェックサムIPチェックサムが使用され、すなわち、全体のPIMメッセージの1の補数和の16ビットの1の補数。チェックサムを計算するために、チェックサムフィールドがゼロにされます。"
    },
    {
      "indent": 3,
      "text": "RP Address The bidirectional RPA for which the election is taking place. The format is described in [4], Section 4.9.1.",
      "ja": "RPアドレス選挙が行われている双方向RPA。フォーマットは、[4]、セクション4.9.1に記載されています。"
    },
    {
      "indent": 3,
      "text": "Sender Metric Preference Preference value assigned to the unicast routing protocol that the message sender used to obtain the route to the RPA.",
      "ja": "メッセージの送信者がRPAへのルートを取得するために使用されるユニキャストルーティングプロトコルに割り当てられた送信者メトリック嗜好プリファレンス値。"
    },
    {
      "indent": 3,
      "text": "Sender Metric The unicast routing table metric used by the message sender to reach the RPA. The metric is in units applicable to the unicast routing protocol used.",
      "ja": "送信者メトリックRPAに到達するために、メッセージ送信者によって使用されるユニキャストルーティングテーブルメトリック。メトリックは、使用されるユニキャストルーティングプロトコルに適用単位です。"
    },
    {
      "indent": 3,
      "text": "In addition to the fields defined above, the Backoff and Pass messages have the extra fields described below.",
      "ja": "上記で定義されたフィールドに加えて、バックオフとパスのメッセージは以下の余分なフィールドを持っています。"
    },
    {
      "indent": 0,
      "text": "3.7.2. Backoff Message",
      "section_title": true,
      "ja": "3.7.2。バックオフのメッセージ"
    },
    {
      "indent": 3,
      "text": "The Backoff message uses the following fields in addition to the common election message format described above.",
      "ja": "バックオフメッセージは、上述した一般的な選挙メッセージフォーマットに加えて、以下のフィールドを使用します。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              Offering Address (Encoded-Unicast format)      ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Offering Metric Preference                   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Offering Metric                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Interval           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Offering Address The address of the router that made the last (best) Offer. The format is described in [4], Section 4.9.1.",
      "ja": "最後（最高の）オファーをしたルータのアドレスアドレスを提供しています。フォーマットは、[4]、セクション4.9.1に記載されています。"
    },
    {
      "indent": 3,
      "text": "Offering Metric Preference Preference value assigned to the unicast routing protocol that the offering router used to obtain the route to the RPA.",
      "ja": "提供ルータがRPAへのルートを取得するために使用されるユニキャストルーティングプロトコルに割り当てられたメトリック嗜好プリファレンス値を提供します。"
    },
    {
      "indent": 3,
      "text": "Offering Metric The unicast routing table metric used by the offering router to reach the RPA. The metric is in units applicable to the unicast routing protocol used.",
      "ja": "メトリックにRPAに到達するために提供するルータで使用されるユニキャストルーティングテーブルのメトリックを提供しています。メトリックは、使用されるユニキャストルーティングプロトコルに適用単位です。"
    },
    {
      "indent": 3,
      "text": "Interval The backoff interval in milliseconds to be used by routers with worse metrics than the offering router.",
      "ja": "ミリ秒単位の間隔バックオフ間隔が提供ルーターよりも悪いメトリックでルータによって使用されます。"
    },
    {
      "indent": 0,
      "text": "3.7.3. Pass Message",
      "section_title": true,
      "ja": "3.7.3。メッセージを渡します"
    },
    {
      "indent": 3,
      "text": "The Pass message uses the following fields in addition to the common election fields described above.",
      "ja": "パスメッセージは、上記の一般的な選挙の分野に加えて、次のフィールドを使用しています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              New Winner Address (Encoded-Unicast format)    ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 New Winner Metric Preference                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      New Winner Metric                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "New Winner Address The address of the router that made the last (best) Offer. The format is described in [4], Section 4.9.1.",
      "ja": "新しい勝者は最後（最高の）オファーをしたルータのアドレス。フォーマットは、[4]、セクション4.9.1に記載されています。"
    },
    {
      "indent": 3,
      "text": "New Winner Metric Preference Preference value assigned to the unicast routing protocol that the offering router used to obtain the route to the RPA.",
      "ja": "提供ルータがRPAへのルートを取得するために使用されるユニキャストルーティングプロトコルに割り当てられた新しい勝者メトリック嗜好プリファレンス値。"
    },
    {
      "indent": 3,
      "text": "New Winner Metric The unicast routing table metric used by the offering router to reach the RPA. The metric is in units applicable to the unicast routing protocol used.",
      "ja": "新しい勝者メトリックRPAに到達するために提供するルータで使用されるユニキャストルーティングテーブルのメトリック。メトリックは、使用されるユニキャストルーティングプロトコルに適用単位です。"
    },
    {
      "indent": 0,
      "text": "3.7.4. Bidirectional Capable PIM-Hello Option",
      "section_title": true,
      "ja": "3.7.4。双方向できるPIM-こんにちはオプション"
    },
    {
      "indent": 3,
      "text": "BIDIR-PIM introduces one new PIM-Hello option.",
      "ja": "BIDIR-PIM、1つの新しいPIM-こんにちはオプションを紹介します。"
    },
    {
      "indent": 3,
      "text": "o OptionType 22: Bidirectional Capable",
      "ja": "でoptionType 22 O：双方向可能"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Type = 22            |         Length = 0            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4. RP Discovery",
      "section_title": true,
      "ja": "4. RPディスカバリー"
    },
    {
      "indent": 3,
      "text": "Routers discover that a range of multicast group addresses operates in bidirectional mode, and that the address of the Rendezvous-Point address (RPA) is serving the group range either through static configuration or using an automatic RP discovery mechanism like the PIM Bootstrap mechanism (BSR) [7] or Auto-RP.",
      "ja": "ルータは（BSRをマルチキャストグループアドレスの範囲が双方向モードで動作すること、及びランデブーポイントアドレス（RPA）のアドレスは、静的構成を介してグループ範囲にサービスを提供するか、PIMブートストラップ機構のような自動RPディスカバリメカニズムを使用していることを発見します）[7]またはAuto-RP。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The IPsec [5] authentication header MAY be used to provide data integrity protection and group-wise data origin authentication of BIDIR-PIM protocol messages. Authentication of BIDIR-PIM messages can protect against unwanted behaviour caused by unauthorized or altered BIDIR-PIM messages.",
      "ja": "IPsecは、[5]認証ヘッダは、データの整合性保護とBIDIR-PIMプロトコルメッセージのグループごとのデータ発信元認証を提供するために使用され得ます。 BIDIR-PIMメッセージの認証は、不正または変更されたBIDIR-PIMメッセージによって引き起こされる不要な動作から保護することができます。"
    },
    {
      "indent": 0,
      "text": "5.1. Attacks Based on Forged Messages",
      "section_title": true,
      "ja": "5.1。鍛造メッセージに基づく攻撃"
    },
    {
      "indent": 3,
      "text": "As in PIM Sparse-Mode, the extent of possible damage depends on the type of counterfeit messages accepted. BIDIR-PIM only uses link-local multicast messages sent to the ALL_PIM_ROUTERS address, hence attacks can only be carried out by directly connected nodes, or with the complicity of directly connected routers.",
      "ja": "PIMスパースモードのように、損傷の程度が受け入れ偽造メッセージのタイプに依存します。 BIDIR-PIMは、従って攻撃のみ直接接続されたノードによって、または直接接続されたルータの共謀を用いて行うことができるALL_PIM_ROUTERSアドレスに送信されたリンクローカルマルチキャストメッセージを使用します。"
    },
    {
      "indent": 3,
      "text": "Some of the BIDIR-PIM protocol messages (Join/Prune and Hello) are identical, both in format and functionality, to the respective messages used in PIM-SM. Security considerations for these messages are to be found in [4]. Other messages (DF-election messages) are specific to BIDIR-PIM and will be discussed in the following paragraphs.",
      "ja": "BIDIR-PIMプロトコルメッセージの一部は、PIM-SMで使用される各メッセージに、形式および機能の両方において同一である（/プルーンとハローが参加します）。これらのメッセージのセキュリティに関する考慮事項は、[4]に見られます。その他のメッセージ（DF-選挙メッセージ）BIDIR-PIMに固有のものであり、以下の段落で説明します。"
    },
    {
      "indent": 3,
      "text": "By forging DF-election messages, an attacker can disrupt the election of the Designated Forwarder on a link in two different ways:",
      "ja": "DF-選挙メッセージを鍛造することにより、攻撃者は、2つの異なる方法でリンクを指定フォワーダの選挙を妨害することができます。"
    },
    {
      "indent": 0,
      "text": "5.1.1. Election of an Incorrect DF",
      "section_title": true,
      "ja": "5.1.1。誤ったDFの選挙"
    },
    {
      "indent": 3,
      "text": "An attacker can force its election as DF by participating in a regular election and advertising the best metric to reach the RPA. An attacker can also try to force the election of another router as DF by sending an Offer, Winner, or Pass message and impersonating another router. In some cases (e.g., the Offer), multiple messages might be needed to carry out an attack.",
      "ja": "攻撃者は、通常の選挙に参加し、RPAに到達するために最善のメトリックをアドバタイズすることでDFとしての選挙を強制することができます。攻撃者はまた、オファー、受賞、またはパスメッセージを送信し、別のルータになりすますことでDFとして別のルータの選出を強制しようとすることができます。いくつかのケース（例えば、オファー）では、複数のメッセージには、攻撃を実行するために必要になる場合があります。"
    },
    {
      "indent": 3,
      "text": "In the case of Offer or Winner messages, the attacker will have to impersonate the node that it wants to have become the DF. In the case of the Pass, it will have to impersonate the current DF. This type of attack causes the wrong DF to be recorded in all nodes apart from the one that is being impersonated. This node typically will be able to detect the anomaly and, possibly, restart a new election.",
      "ja": "オファーや受賞のメッセージの場合、攻撃者は、それがDFになっていたいノードを偽装する必要があります。峠のケースでは、現在のDFを偽装する必要があります。この種の攻撃は、間違ったDFが偽装されているものから離れて、すべてのノードに記録されます。このノードは通常、異常を検出して、おそらく、新しい選挙を再起動することができるようになります。"
    },
    {
      "indent": 3,
      "text": "A more sophisticated attacker might carry out a concurrent DoS attack on the node being impersonated, so that it will not be able to detect the forged packets and/or take countermeasures.",
      "ja": "偽造パケットを検出および/または対策を取ることができなくなりますように、より洗練された攻撃者は、偽装されたノード上の同時DoS攻撃を実行する可能性があります。"
    },
    {
      "indent": 3,
      "text": "All attacks based on impersonation can be detected by all routers and avoided if the source of DF-election messages can be authenticated. When authentication is available, spoofed messages MUST be discarded and a rate-limited warning message SHOULD be logged.",
      "ja": "偽装に基づくすべての攻撃は、すべてのルータによって検出され、DF-選挙メッセージの送信元を認証することができる場合に回避することができます。認証が利用可能である場合には、偽装されたメッセージは捨てなければなりませんし、レート制限警告メッセージが記録されるべきです。"
    },
    {
      "indent": 3,
      "text": "A more subtle attacker could use MAC-level addresses to partition the set of recipients of DF-election messages and create an inconsistent DF view on the link. For example, the attacker could use unicast MAC addresses for its forged DF-election messages. To prevent this type of attack, BIDIR-PIM routers SHOULD check the destination MAC address of received DF-election messages. This however is ineffective on links that do not support layer-2 multicast delivery.",
      "ja": "より微妙な攻撃者は、DF-選挙メッセージの受信者の集合を分割し、リンク上の一貫性のないDFのビューを作成するために、MACレベルのアドレスを使用することができます。例えば、攻撃者は、その偽造DF-選挙メッセージのためのユニキャストMACアドレスを使用することができます。この種の攻撃を防ぐために、BIDIR-PIMルータが受信DF-選挙メッセージの宛先MACアドレスを確認する必要があります。しかし、これは、レイヤ2マルチキャスト配信をサポートしていないリンク上では無効です。"
    },
    {
      "indent": 3,
      "text": "Source authentication is also sufficient to prevent this kind of attack.",
      "ja": "ソース認証もこの種の攻撃を防止するのに十分です。"
    },
    {
      "indent": 0,
      "text": "5.1.2. Preventing Election Convergence",
      "section_title": true,
      "ja": "5.1.2。選挙のコンバージェンスの防止"
    },
    {
      "indent": 3,
      "text": "By forging DF election messages, an attacker can prevent the election from converging, thus disrupting the establishment of multicast forwarding trees. There are many ways to achieve this. The simplest is by sending an infinite sequence of Offer messages (the metric used in the messages is not important).",
      "ja": "DF選定メッセージを鍛造することにより、攻撃者は、このようにマルチキャスト転送ツリーの確立を破壊し、収束から選挙を防ぐことができます。これを達成するための多くの方法があります。最も単純には、オファーメッセージ（メッセージの中で使用されるメトリックは重要ではありません）の無限列を送信することです。"
    },
    {
      "indent": 0,
      "text": "5.2. Non-Cryptographic Authentication Mechanisms",
      "section_title": true,
      "ja": "5.2。非暗号化認証メカニズム"
    },
    {
      "indent": 3,
      "text": "A BIDIR-PIM router SHOULD provide an option to limit the set of neighbors from which it will accept Join/Prune, Assert, and DF-election messages. Either static configuration of IP addresses or an IPsec security association may be used. Furthermore, a PIM router SHOULD NOT accept protocol messages from a router from which it has not yet received a valid Hello message.",
      "ja": "BIDIR-PIMルータは、それが参加/プルーン、アサート、及びDF-選挙メッセージを受け入れるから、隣人のセットを制限するためのオプションを提供する必要があります。静的IPアドレスの設定やIPsecセキュリティ協会のどちらかを使用することができます。さらに、PIMルータは、それがまだ有効なHelloメッセージを受信して​​いない元のルータからのプロトコルメッセージを受け入れるべきではありません。"
    },
    {
      "indent": 0,
      "text": "5.2.1. Basic Access Control",
      "section_title": true,
      "ja": "5.2.1。基本的なアクセス制御"
    },
    {
      "indent": 3,
      "text": "In a PIM-SM domain, when all routers are trusted, it is possible to implement a basic form of access control for both sources and receivers: Receivers can be validated by the last-hop DR and sources can be validated by the first-hop DR and/or the RP.",
      "ja": "すべてのルータが信頼されているPIM-SMドメインでは、ソースと受信機の両方のためのアクセス制御の基本的な形態を実現することができる：受信機は、最後のホップDRによって検証することができ、ソースは、最初のホップによって検証することができますDRおよび/またはRP。"
    },
    {
      "indent": 3,
      "text": "In BIDIR-PIM, this is generally feasible only for receivers, as sources can send to the multicast group without the need for routers to detect their activity and create source-specific state. However, it is possible to modify the standard BIDIR-PIM behaviour, in a backward compatible way, to allow per-source access control. The tradeoff would be protocol simplicity, memory, and processing requirements.",
      "ja": "ソースはそれらの活性を検出し、ソース固有の状態を作成するためにルータを必要とすることなく、マルチキャストグループに送信できるようにBIDIR-PIMでは、これは、唯一の受信機のために一般的に可能です。しかし、あたり、ソースのアクセス制御を可能にするために、後方互換性のある方法で、標準BIDIR-PIMの動作を変更することが可能です。トレードオフは、プロトコルシンプルさ、メモリ、および処理要件になります。"
    },
    {
      "indent": 0,
      "text": "5.3. Authentication Using IPsec",
      "section_title": true,
      "ja": "5.3。 IPsecを使用した認証"
    },
    {
      "indent": 3,
      "text": "Just as with PIM-SM, the IPsec [5] transport mode using the Authentication Header (AH) is the recommended method to prevent the above attacks against BIDIR-PIM.",
      "ja": "ちょうどPIM-SMと同様に、認証ヘッダ（AH）を使用したIPsec [5]トランスポートモードはBIDIR-PIMに対して上記の攻撃を防ぐために推奨される方法です。"
    },
    {
      "indent": 3,
      "text": "It is recommended that IPsec authentication be applied to all BIDIR-PIM protocol messages. The specification on how this is done is found in [4]. Specifically, the authentication of PIM-SM link-local messages, described in [4], applies to all BIDIR-PIM messages as well.",
      "ja": "IPsecの認証はすべてBIDIR-PIMプロトコルメッセージに適用することをお勧めします。これがどのように行われるかの仕様は、[4]に含まれています。具体的には、[4]に記載のPIM-SMリンクローカルメッセージの認証は、同様に全てBIDIR-PIMメッセージに適用されます。"
    },
    {
      "indent": 0,
      "text": "5.4. Denial-of-Service Attacks",
      "section_title": true,
      "ja": "5.4。サービス拒否攻撃"
    },
    {
      "indent": 3,
      "text": "The denial-of-service attack based on forged Join messages, described in [4], also applies to BIDIR-PIM.",
      "ja": "で説明したJoinメッセージを偽造に基づいてサービス拒否攻撃は、[4]、またBIDIR-PIMに適用されます。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned OptionType 22 to the \"Bidirectional Capable\" option.",
      "ja": "IANAは、「双方向できる」オプションにでoptionType 22を割り当てています。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "The bidirectional proposal in this document is heavily based on the ideas and text presented by Estrin and Farinacci in [6]. The main difference between the two proposals is in the method chosen for upstream forwarding.",
      "ja": "この文書に記載されている双方向の提案は重くにEstrinとファリナッチが提示アイデアやテキストに基づいている[6]。二つの提案の主な違いは、上流の転送のために選択された方法です。"
    },
    {
      "indent": 3,
      "text": "We would also like to thank John Zwiebel at Cisco, Deborah Estrin at ISI/USC, Bill Fenner at AT&T Research, as well as Nidhi Bhaskar, Yiqun Cai, Toerless Eckert, Apoorva Karan, Rajitha Sumanasekera, and Beau Williamson at Cisco for their contributions and comments to this document.",
      "ja": "我々はまた、彼らの貢献のためにシスコのCiscoのJohn Zwiebel、ISI / USCのデボラ・エストリン、AT＆T Researchのビルフェナー、などNidhi Bhaskar、Yiqunカイ、Toerlessエッカート、Apoorvaカラン、Rajitha Sumanasekera、およびボー・ウィリアムソンに感謝したいと思いますこのドキュメントにコメントしています。"
    },
    {
      "indent": 0,
      "text": "8. Normative References",
      "section_title": true,
      "ja": "8.引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[1]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[2] Cain, B., Deering, S., Kouvelas, I., Fenner, B., and A. Thyagarajan, \"Internet Group Management Protocol, Version 3\", RFC 3376, October 2002.",
      "ja": "[2]カイン、B.、デアリング、S.、Kouvelas、I.、フェナー、B.、およびA. Thyagarajan、 \"インターネットグループ管理プロトコル、バージョン3\"、RFC 3376、2002年10月。"
    },
    {
      "indent": 3,
      "text": "[3] Deering, S., Fenner, W., and B. Haberman, \"Multicast Listener Discovery (MLD) for IPv6\", RFC 2710, October 1999.",
      "ja": "[3]デアリング、S.、フェナー、W.、およびB.ハーバーマン、 \"マルチキャストリスナ発見IPv6の（MLD）\"、RFC 2710、1999年10月。"
    },
    {
      "indent": 3,
      "text": "[4] Fenner, B., Handley, M., Holbrook, H., and I. Kouvelas, \"Protocol Independent Multicast - Sparse Mode (PIM-SM): Protocol Specification (Revised)\", RFC 4601, August 2006.",
      "ja": "[4]フェナー、B.、ハンドリー、M.、ホルブルック、H.、およびI. Kouvelas、 \"プロトコル独立マルチキャスト - スパースモード（PIM-SM）：プロトコル仕様（改訂）\"、RFC 4601、2006年8月を。"
    },
    {
      "indent": 3,
      "text": "[5] Kent, S. and R. Atkinson, \"Security Architecture for the Internet Protocol\", RFC 2401, November 1998.",
      "ja": "[5]ケント、S.とR.アトキンソン、 \"インターネットプロトコルのためのセキュリティー体系\"、RFC 2401、1998年11月。"
    },
    {
      "indent": 0,
      "text": "9. Informative References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 3,
      "text": "[6] Estrin, D. and D. Farinacci, \"Bi-directional Shared Trees in PIM-SM\", Work in Progress, May 1999.",
      "ja": "[6] Estrin、D.とD.ファリナッチ、 \"PIM-SMでの双方向の共有ツリー\"、進歩、1999年5月での作業。"
    },
    {
      "indent": 3,
      "text": "[7] Bhaskar, N., Gall, A., Lingard, J., and S. Venaas, \"Bootstrap Router (BSR) Mechanism for PIM\", Work in Progress, February 2007.",
      "ja": "[7] Bhaskar、N.、ガル、A.、リンガード、J.、およびS. Venaas、 \"PIMブートストラップルータ（BSR）メカニズム\"、進歩、2007年2月ワーク。"
    },
    {
      "indent": 3,
      "text": "[8] Bates, T., Chandra, R., Katz, D., and Y. Rekhter, \"Multiprotocol Extensions for BGP-4\", RFC 4760, January 2007.",
      "ja": "[8]ベイツ、T.、チャンドラ、R.、キャッツ、D.、およびY. Rekhter、 \"BGP-4のためのマルチプロトコルの拡張\"、RFC 4760、2007年1月を。"
    },
    {
      "indent": 0,
      "text": "Index",
      "ja": "指数"
    },
    {
      "indent": 3,
      "text": "DF. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .5,18\nDownstream. . . . . . . . . . . . . . . . . . . . . . . . . . . .   5\nDownstreamJPState(G,I). . . . . . . . . . . . . . . . . . . . . .  10\nET(G,I) . . . . . . . . . . . . . . . . . . . . . . . . . . . 9,14,33\nET(RPA,I) . . . . . . . . . . . . . . . . . . . . . . . . . . . .  10\nI_am_DF(RPA,I). . . . . . . . . . . . . . . . . . . . . . . .10,12,14\nJ/P_HoldTime. . . . . . . . . . . . . . . . . . . . . . . . . . .  33\nJ/P_Override_Interval . . . . . . . . . . . . . . . . . . . . . 16,33\nJoinDesired(G). . . . . . . . . . . . . . . . . . . . . . . . . .  18\njoins(G). . . . . . . . . . . . . . . . . . . . . . . . . . . . .  10\nJT(*,G) . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  17\nJT(G) . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  9,33\nlocal_receiver_include(G,I) . . . . . . . . . . . . . . . . . . .  10\nMFIB. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .   6\nNLT(N,I). . . . . . . . . . . . . . . . . . . . . . . . . . . . .   8\nOffer_Period. . . . . . . . . . . . . . . . . . . . . . . . . . .  32\nolist(G). . . . . . . . . . . . . . . . . . . . . . . . . . .10,12,18\nBidirectional Capable OptionType  . . . . . . . . . . . . . . . .  37\npim_include(G). . . . . . . . . . . . . . . . . . . . . . . . . .  10\nPPT(G,I). . . . . . . . . . . . . . . . . . . . . . . . . . . 9,14,33\nRPA . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .   4\nRPF_interface(RPA). . . . . . . . . . . . . . . . . . . . . . . 10,12\nRPL . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .   4\nTIB . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .   5\nt_override. . . . . . . . . . . . . . . . . . . . . . . . . . . 17,33\nt_periodic. . . . . . . . . . . . . . . . . . . . . . . . . . . 17,33\nt_suppressed. . . . . . . . . . . . . . . . . . . . . . . . . . 17,33\nUpstream. . . . . . . . . . . . . . . . . . . . . . . . . . . . .   5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Mark Handley Computer Science Department University College London EMail: M.Handley@cs.ucl.ac.uk",
      "ja": "マーク・ハンドリーコンピュータサイエンス学部ユニバーシティ・カレッジ・ロンドンのEメール：M.Handley@cs.ucl.ac.uk"
    },
    {
      "indent": 3,
      "text": "Isidor Kouvelas Cisco Systems EMail: kouvelas@cisco.com",
      "ja": "ISIDOREにKouvelasアイビーシステムEMAIL：kouvelas@kisso.kom"
    },
    {
      "indent": 3,
      "text": "Tony Speakman Cisco Systems EMail: speakman@cisco.com",
      "ja": "トニー・スピークマンシスコシステムズ電子メール：speakman@cisco.com"
    },
    {
      "indent": 3,
      "text": "Lorenzo Vicisano Digital Fountain EMail: lorenzo@digitalfountain.com",
      "ja": "ロレンツォVicisanoデジタル噴水Eメール：lorenzo@digitalfountain.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットSOCIETY、（もしあれば）を後援し、IETF TRUST ANDインターネットエンジニアリングタスクフォース放棄ALLに設けられています。保証は、明示または黙示、この情報の利用および特定目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証がこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    }
  ]
}