{
  "title": {
    "text": "RFC 5067 - Infrastructure ENUM Requirements",
    "ja": "RFC 5067 - インフラストラクチャENUMの要件"
  },
  "number": 5067,
  "created_at": "2019-10-22 22:54:45.857646+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            S. Lind\nRequest for Comments: 5067                                     AT&T Labs\nCategory: Informational                                        P. Pfautz\n                                                                    AT&T\n                                                           November 2007",
      "raw": true
    },
    {
      "indent": 20,
      "text": "Infrastructure ENUM Requirements",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document provides requirements for \"infrastructure\" or \"carrier\" ENUM (E.164 Number Mapping), defined as the use of RFC 3761 technology to facilitate interconnection of networks for E.164 number addressed services, in particular but not restricted to VoIP (Voice over IP.)",
      "ja": "この文書では、E.164番号のためのネットワークの相互接続を容易にするために、RFC 3761技術の使用は、（特に、サービスを取り上げたが、VoIPのに限定されないとして定義され、「インフラストラクチャ」または「キャリア」ENUM（E.164番号マッピング）の要件を提供しますボイスオーバーIP）。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Infrastructure ENUM . . . . . . . . . . . . . . . . . . . . . . 1\n  1.1.  Definition  . . . . . . . . . . . . . . . . . . . . . . . . 1\n  1.2.  Background  . . . . . . . . . . . . . . . . . . . . . . . . 2\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . . . 3\n3.  Requirements for Infrastructure ENUM  . . . . . . . . . . . . . 3\n4.  Security Considerations . . . . . . . . . . . . . . . . . . . . 4\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . . . 5\n6.  Normative References  . . . . . . . . . . . . . . . . . . . . . 5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Infrastructure ENUM",
      "section_title": true,
      "ja": "1.インフラストラクチャENUM"
    },
    {
      "indent": 0,
      "text": "1.1. Definition",
      "section_title": true,
      "ja": "1.1。定義"
    },
    {
      "indent": 3,
      "text": "Infrastructure ENUM is defined as the use of the technology in RFC 3761 [1] by the carrier-of-record (as defined below) for a specific E.164 number [2] to publish the mapping of the E.164 number into a URI [3] that identifies a specific point of interconnection to that service provider's network. It is separate from any URIs that the end user, who registers their E.164 number, may wish to associate with that E.164 number.",
      "ja": "（以下に定義する）インフラストラクチャENUMは、特定のE.164番号のキャリアのレコードによって[1] RFC 3761における技術の使用として定義されている[2]にE.164番号のマッピングを公開しますURI [3]それは、サービスプロバイダのネットワークへの相互接続の特定のポイントを識別する。それは彼らのE.164番号を登録し、エンドユーザーは、そのE.164番号に関連付けすることを望むかもしれない任意のURIは別にあります。"
    },
    {
      "indent": 3,
      "text": "\"Infrastructure ENUM\" is distinguished from \"End User ENUM\", defined in RFC3761 [1], in which the entity or person having the right to use a number has the sole discretion about the content of the associated domain and thus the zone content. From a domain registration perspective, the end user number assignee is thus the registrant. Within the infrastructure ENUM namespace, we use the term \"carrier-of-record\" for the entity having discretion over the domain and zone content and acting as the registrant. The \"carrier-of-record\" is:",
      "ja": "「インフラストラクチャENUM」はRFC3761で定義された「エンドユーザENUM」とは区別される[1]、ここでエンティティまたは個人番号が関連付けられているドメインのコンテンツ、したがってゾーンコンテンツに関する裁量を有して使用する権利を有します。ドメイン登録の観点からは、エンドユーザーの数の譲受人は、このように登録者です。インフラENUMの名前空間の中で、私たちは、ドメインおよびゾーンコンテンツの上に裁量権を有する登録者として動作するエンティティのための用語「キャリアのレコード」を使用します。 「キャリアのレコードは」次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o The Service Provider to which the E.164 number was allocated for end user assignment, whether by the National Regulatory Authority (NRA) or the International Telecommunication Union (ITU), for instance, a code under \"International Networks\" (+882) or \"Universal Personal Telecommunications (UPT)\" (+878) or,",
      "ja": "164番号は、国の規制機関（NRA）や国際電気通信連合（ITU）によってか、エンドユーザーの割り当てのために割り当てられた先のサービスプロバイダO、例えば、「国際ネットワーク」の下のコード（882）または「ユニバーサルパーソナル通信（UPT）」（878）または、"
    },
    {
      "indent": 3,
      "text": "o if the number is ported, the service provider to which the number was ported, or",
      "ja": "数は、数が移植された先のサービスプロバイダに移植し、またはされている場合、O"
    },
    {
      "indent": 3,
      "text": "o where numbers are assigned directly to end users, the service provider that the end user number assignee has chosen to provide a Public Switched Telephone Network/Public Land Mobile Network (PSTN/ PLMN) point-of-interconnect for the number.",
      "ja": "番号がエンドユーザーに直接割り当てられている場合、O、エンドユーザ数譲受人パブリックを提供するように選択されたサービスプロバイダは、電話網/公衆陸上移動通信網（PSTN / PLMN）ポイント・オブ・配線数のスイッチド。"
    },
    {
      "indent": 3,
      "text": "It is understood that the definition of carrier-of-record within a given jurisdiction is subject to modification by national authorities.",
      "ja": "特定の管轄区域内のキャリアのレコードの定義は各国当局による変更の対象となることが理解されます。"
    },
    {
      "indent": 0,
      "text": "1.2. Background",
      "section_title": true,
      "ja": "1.2。バックグラウンド"
    },
    {
      "indent": 3,
      "text": "Voice service providers use E.164 numbers currently as their main naming and routing vehicle. Infrastructure ENUM in e164.arpa or another publicly available tree allows service providers to link Internet-based resources such as URIs to E.164 numbers. This allows service providers, in addition to interconnecting via the PSTN/PLMN (or exclusively), to peer via IP-based protocols. Service providers may announce all E.164 numbers or number ranges they host, regardless of whether the final end user device is on the Internet, on IP-based open or closed Next Generation Networks (NGNs), or on the PSTN or PLMN, provided that an access point of some type to the destination service provider's network is available on the Internet. There is also no guarantee that the originating service provider querying infrastructure ENUM is able to access the ingress network element of the destination provider's network. Additional peering and accounting agreements requiring authentication may be necessary. The access provided may also be to a shared network of a group of providers, resolving the final destination network within the shared network.",
      "ja": "音声サービスプロバイダは、現在、彼らの主な命名およびルーティング車両としてE.164番号を使用しています。 e164.arpaまたは別の公に利用可能なツリー内のインフラストラクチャENUMは、サービスプロバイダは、このようなE.164番号へのURIとして、インターネットベースのリソースをリンクすることができます。これは、IPベースのプロトコルを介してピアに、PSTN / PLMN（又は排他的に）を介して相互接続に加えて、サービスプロバイダを可能にします。サービスプロバイダは、すべてのE.164番号または番号を通知してもよい提供かかわらず、最終的なエンドユーザデバイスがインターネット上で、オープンIPベースまたは閉鎖次世代ネットワーク（次世代ネットワーク（NGN））上で、またはPSTNやPLMNにあるかどうかの、これらの宿主範囲宛先サービスプロバイダーのネットワークにはいくつかのタイプのアクセスポイントは、インターネット上で利用可能であること。インフラENUMを照会元のサービスプロバイダは、先のプロバイダのネットワークの入口ネットワーク要素にアクセスすることが可能であるという保証もありません。認証を必要とする追加のピアリングや会計の契約が必要になることがあります。提供されるアクセスは、共有ネットワーク内の最終宛先ネットワークを解決する、プロバイダのグループの共有ネットワークであってよいです。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC2119 [4].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14、RFC2119に記載されているように解釈される[4]。"
    },
    {
      "indent": 0,
      "text": "3. Requirements for Infrastructure ENUM",
      "section_title": true,
      "ja": "インフラENUMのための3要件"
    },
    {
      "indent": 3,
      "text": "1. Infrastructure ENUM SHALL provide a means for a provider to populate DNS resource records (RRs) for the E.164 numbering resources for which it is the carrier-of-record in a single common publicly accessible namespace. The single common namespace ultimately designated may or may not be the same as that designated for End User ENUM (e164.arpa.) The Fully-Qualified Domain Name (FQDN) in the resulting resource records will not necessarily belong to or identify the carrier-of-record.",
      "ja": "1.インフラストラクチャENUMは、それがキャリアのレコード、単一の共通公的にアクセス可能な名前空間であるためにE.164番号リソースのDNSリソースレコード（RR）を移入するプロバイダのための手段を提供しなければなりません。最終的には指定された単一の共通の名前空間は、または（。e164.arpa）エンドユーザーENUMのために指定されたものと同じであってもなくてもよい結果リソースレコードで完全修飾ドメイン名（FQDN）は、必ずしもに属しているか、担体 - を識別しません。レコード。"
    },
    {
      "indent": 3,
      "text": "2. Queries of infrastructure ENUM fully qualified domain names MUST return a result, even if the result is Refused (RCODE = 5). Queries must not be rejected without response, e.g., based on access control lists.",
      "ja": "インフラENUMの2.クエリの完全修飾ドメイン名は、結果が（RCODE = 5）拒否された場合でも、結果を返さなければなりません。クエリは、アクセス制御リストに基づいて、例えば、応答なしに拒否してはいけません。"
    },
    {
      "indent": 3,
      "text": "3. Infrastructure ENUM SHALL support RRs providing a URI that can identify a point of interconnection for delivery to the carrier-of-record of communications addressed to the E.164 number.",
      "ja": "3.インフラストラクチャENUMは、キャリアのレコードE.164番号宛の通信への送達のための相互接続点を識別することができるURIを提供するのRRをサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "4. Infrastructure ENUM SHOULD be able to support an Internet Registry Information Service (IRIS) [5] capability that allows qualified parties to obtain information regarding the E.164 numbering resources and the corresponding carrier-of-record. Determination of what information, if any, shall be available which parties for geographic numbers is a national matter.",
      "ja": "4.インフラストラクチャENUMは、資格のある当事者がE.164番号のリソースと、対応するキャリアのレコードに関する情報を取得することを可能にするインターネットレジストリ情報サービス（IRIS）[5]の機能をサポートすることができるべきです。どのような情報の決意、もしあれば、国家の問題であり、地理的番号についてはどの政党利用可能でなければなりません。"
    },
    {
      "indent": 3,
      "text": "5. Implementation of infrastructure ENUM MUST NOT restrict the ability of an end user, in a competitive environment, to choose a Registrar and/or name server provider for End User ENUM registrations.",
      "ja": "インフラENUMの5実装は、レジストラを選択および/またはエンドユーザーENUM登録のためのネームサーバのプロバイダに、競争的環境の中で、エンドユーザーの能力を制限してはいけません。"
    },
    {
      "indent": 3,
      "text": "6. The domain name chosen for infrastructure ENUM and any parent domains MUST be hosted on name servers that have performance characteristics and supporting infrastructure that is comparable to those deployed for the Internet root name servers. Those name servers for infrastructure ENUM should be configured and operated according to the guidelines described in [6].",
      "ja": "6.インフラENUMと任意の親ドメイン用に選択されたドメイン名は、性能特性およびインターネットルートネームサーバのために展開されたものに匹敵するサポートインフラストラクチャを持っているネームサーバ上でホストされる必要があります。インフラENUMのものネームサーバは、[6]に記載のガイドラインに従って構成及び操作されるべきです。"
    },
    {
      "indent": 3,
      "text": "7. Infrastructure ENUM MUST meet all reasonable privacy concerns about visibility of information over which an end user has no control. It should, for example, support mechanisms to prevent discovery of unlisted numbers by comparison of ENUM registrations against directory listings, or inadvertent disclosure of user identity.",
      "ja": "7.インフラストラクチャENUMは、エンドユーザーが制御することはできませんする、情報の可視性に関するすべての合理的なプライバシーの問題を満たしていなければなりません。それは、例えば、支持機構は、ディレクトリリスト、またはユーザアイデンティティの不注意な開示に対するENUM登録の比較により、非上場番号の発見を防ぐためにすべきです。"
    },
    {
      "indent": 3,
      "text": "8. Proposed implementations of infrastructure ENUM SHOULD:",
      "section_title": true,
      "ja": "インフラENUMの8提案実装は必要があります。"
    },
    {
      "indent": 7,
      "text": "A.  Minimize changes required to existing requirements that are\n    part of RFC 3761.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "B. Work with open as well as closed numbering plans.",
      "ja": "オープンだけでなく、閉じられた番号計画とB.作業。"
    },
    {
      "indent": 7,
      "text": "C. Not require additional functionality of resolvers at large though they may require additional functionality in service provider resolvers that would make use of infrastructure ENUM.",
      "ja": "彼らはインフラENUMを利用するだろう、サービスプロバイダリゾルバで追加機能を必要とするかもしれないけれどもC.は大でリゾルバの追加機能を必要としません。"
    },
    {
      "indent": 7,
      "text": "D. Minimize the number of lookups required to obtain as many NAPTR (Naming Authority Pointer) records (end user and infrastructure) as possible.",
      "ja": "D.は、できるだけ多くのNAPTR（機関ポインタを命名）レコード（エンドユーザとインフラ）を得るために必要なルックアップの数を最小限に抑えます。"
    },
    {
      "indent": 7,
      "text": "E. Minimize knowledge of the numbering plan required of resolvers making use of Infrastructure ENUM.",
      "ja": "E.は、インフラストラクチャENUMを利用するリゾルバに必要な番号計画の知識を最小限に抑えます。"
    },
    {
      "indent": 7,
      "text": "F. Maximize synergies with End User ENUM.",
      "ja": "F.最大化は、エンドユーザーのENUMとのシナジー。"
    },
    {
      "indent": 7,
      "text": "G. Support interworking with private ENUM trees. (In this context, a private ENUM tree is one that is not under e164.arpa or whatever namespace is chosen for infrastructure ENUM but uses instead a privately held domain.)",
      "ja": "プライベートENUMの木と相互作用G.サポート。 （この文脈では、民間のENUMツリーはe164.arpa下にないか、インフラストラクチャENUMのために選択されているものは何でも名前空間ではなく、非公開のドメインを使用するものです。）"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Existing security considerations for ENUM (detailed in [1]) still apply. Since infrastructure ENUM involves carriers where RFC 3761 mainly considered indviduals, implementations meeting these requirements SHOULD reconsider the RFC 3761 security model given this difference in actors concerned. Note that some registration validation issues concerning End User ENUM may not apply to infrastructure ENUM. Where the Tier 1 registry is able to identify the provider serving a number, e.g., based on industry data for number block assignments and number portability, registration might be more easily automated and a separate registrar not required.",
      "ja": "ENUMのための既存のセキュリティに関する考慮事項が適用されます（[1]で詳述します）。インフラストラクチャENUMためRFC 3761は、主indvidualsと考えられる場合、これらの要件を満たす実装がRFC 3761のセキュリティモデルは、当該アクタにこの差を与え再考すべきキャリアを含みます。エンドユーザーENUMに関するいくつかの登録の検証の問題がインフラストラクチャENUMには適用されない場合があることに注意してください。ティア1レジストリ番号を配信プロバイダを識別することが可能であり、例えば、数ブロックの割り当てと番号ポータビリティのための業界データに基づいて、登録をより容易に自動化されるかもしれないし、別レジストラは必須ではありません。"
    },
    {
      "indent": 3,
      "text": "Some parties have expressed concern that an infrastructure ENUM could compromise end user privacy by making it possible for others to identify unlisted or unpublished numbers based on their registration in ENUM. This can be avoided if providers register all of the their allocated (as opposed to assigned) numbers. Unassigned numbers should be provisioned to route to the provider's network in the same fashion as assigned numbers and only then provide an indication that they are unassigned. In that way, provider registration of a number in ENUM provides no more information about the status of a number than could be obtained by dialing it.",
      "ja": "一部の締約国は、インフラストラクチャENUMは、それが可能な他の人がENUMでの登録に基づいて非上場または未発表の数字を識別できるようにすることで、エンドユーザーのプライバシーを危険にさらす可能性が懸念を表明しています。プロバイダーが割り当てられた番号（割り当てではなく）のすべてを登録する場合、これは回避することができます。未割り当て番号が割り当てられた番号と同じようにプロバイダのネットワークにルーティングするプロビジョニングだけにして、彼らが割り当てられていないという指示を提供する必要があります。このように、ENUMにおける数のプロバイダの登録、それをダイヤルすることによって得ることができたより数の状態についてのより多くの情報を提供します。"
    },
    {
      "indent": 3,
      "text": "Implementers should take care to avoid inadvertent disclosure of user identities, for example, in the URIs returned in response to infrastructure ENUM queries.",
      "ja": "実装者は、ユーザーIDの不注意な開示を避けるように注意する必要があり、例えば、URIの中でインフラENUMクエリーに応答して返さ。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document includes no actions to be taken by IANA. The architecture ultimately chosen to meet the requirements may require IANA actions.",
      "ja": "この文書は、IANAによって取らすべきアクションが含まれていません。最終的な要件を満たすために選ばれたアーキテクチャは、IANAのアクションが必要な場合があります。"
    },
    {
      "indent": 0,
      "text": "6. Normative References",
      "section_title": true,
      "ja": "6.引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Faltstrom, P. and M. Mealling, \"The E.164 to Uniform Resource Identifiers (URI) Dynamic Delegation Discovery System (DDDS) Application (ENUM)\", RFC 3761, April 2004.",
      "ja": "[1] Faltstrom、P.及びM. Mealling、 \"ユニフォームリソース識別子にE.164（URI）ダイナミックな委譲発見システム（DDDS）アプリケーション（ENUM）\"、RFC 3761、2004年4月。"
    },
    {
      "indent": 3,
      "text": "[2] International Telecommunication Union-Telecommunication Standardization Sector, \"The International Public Telecommunication Numbering Plan\", Recommendation E.164\", February 2005.",
      "ja": "[2]国際電気通信連合・電気通信標準化部門、「国際公共電気通信番号計画」、勧告E.164\" 、2005年2月。"
    },
    {
      "indent": 3,
      "text": "[3] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, January 2005.",
      "ja": "[3]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[4] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[4]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[5] Newton, A. and M. Sanz, \"IRIS: The Internet Registry Information Service (IRIS) Core Protocol\", RFC 3981, January 2005.",
      "ja": "[5]ニュートン、A.とM.サンス、 \"IRIS：インターネットレジストリ情報サービス（IRIS）コアプロトコル\"、RFC 3981、2005年1月。"
    },
    {
      "indent": 3,
      "text": "[6] Bush, R., Karrenberg, D., Kosters, M., and R. Plzak, \"Root Name Server Operational Requirements\", BCP 40, RFC 2870, June 2000.",
      "ja": "[6]ブッシュ、R.、Karrenberg、D.、Kosters、M.、およびR. Plzak、 \"ルートネームサーバの運用要件\"、BCP 40、RFC 2870、2000年6月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Steven Lind AT&T Labs 180 Park Ave Florham Park, NJ 07932-0971 USA",
      "ja": "スティーブン・リンドAT＆T Labsの180パークアベニューフローラムパーク、ニュージャージー州07932から0971 USA"
    },
    {
      "indent": 3,
      "text": "EMail: sdlind@att.com",
      "ja": "メールアドレス：sdlind@att.com"
    },
    {
      "indent": 3,
      "text": "Penn Pfautz AT&T 200 S. Laurel Ave Middletown, NJ 07748 USA",
      "ja": "ペンPfautz AT＆T 200 S.ローレルアベニューミドルタウン、NJ 07748 USA"
    },
    {
      "indent": 3,
      "text": "EMail: ppfautz@att.com",
      "ja": "メールアドレス：ppfautz@att.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The IETF Trust (2007).",
      "ja": "著作権（C）IETFトラスト（2007）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットSOCIETY、（もしあれば）を後援し、IETF TRUST ANDインターネットエンジニアリングタスクフォース放棄ALLに設けられています。保証は、明示または黙示、この情報の利用および特定目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証がこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    }
  ]
}