{
  "title": {
    "text": "RFC 3496 - Protocol Extension for Support of Asynchronous Transfer Mode (ATM) Service Class-aware Multiprotocol Label Switching (MPLS) Traffic Engineering",
    "ja": "RFC 3496 - 非同期転送モード（ATM）サービスクラス対応のマルチプロトコルラベルスイッチング（MPLS）交通工学のサポートのためのプロトコル拡張"
  },
  "number": 3496,
  "created_at": "2019-10-29 06:51:27.777320+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        A. G. Malis\nRequest for Comments: 3496                                      T. Hsiao\nCategory: Informational                                  Vivace Networks\n                                                              March 2003",
      "raw": true
    },
    {
      "indent": 2,
      "text": "Protocol Extension for Support of Asynchronous Transfer Mode (ATM) Service Class-aware Multiprotocol Label Switching (MPLS) Traffic Engineering",
      "ja": "非同期転送モード（ATM）サービスクラス対応のマルチプロトコルラベルスイッチング（MPLS）交通工学のサポートのためのプロトコル拡張"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies a Resource ReSerVation Protocol-Traffic Engineering (RSVP-TE) signaling extension for support of Asynchronous Transfer Mode (ATM) Service Class-aware Multiprotocol Label Switching (MPLS) Traffic Engineering.",
      "ja": "この文書では、非同期転送モード（ATM）サービスクラス対応のマルチプロトコルラベルスイッチング（MPLS）トラフィックエンジニアリングをサポートするためのリソース予約プロトコル - トラフィックエンジニアリング（RSVP-TE）シグナリングの拡張子を指定します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Overview......................................................2\n2.  Extended RSVP-TE Path Message Format..........................2\n    2.1 PATH Message Format.......................................3\n3.  ATM_SERVICECLASS Object.......................................3\n4.  Handling the ATM_SERVICECLASS Object..........................4\n5.  Non-support of the ATM_SERVICECLASS Object....................4\n6.  Security Considerations.......................................4\n7.  IANA Considerations...........................................5\n8.  References....................................................5\n9.  Authors' Addresses............................................5\n10. Full Copyright Statement......................................6",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1。概要"
    },
    {
      "indent": 3,
      "text": "This document defines a Resource ReSerVation Protocol-Traffic Engineering (RSVP-TE) protocol addition to support ATM (Asynchronous Transfer Mode) Service Class-aware MPLS (MultiProtocol Label Switching) Traffic Engineering.",
      "ja": "この文書では、ATM（非同期転送モード）サービスクラス対応のMPLS（マルチプロトコルラベルスイッチング）トラフィックエンジニアリングをサポートするためのリソース予約はプロトコル - トラフィックエンジニアリング（RSVP-TE）プロトコルの追加を定義します。"
    },
    {
      "indent": 3,
      "text": "This protocol addition is used with all MPLS Label Switched Routers (LSRs) and link types (including, but not restricted to, Packet over SONET, Ethernet, and ATM links) to signal traffic engineered paths that can support the ATM service classes as defined by the ATM Forum [TM]. This document does not specify HOW to actually implement the functionality in the MPLS LSRs to emulate the ATM Forum service classes (such as necessary queuing and scheduling mechanisms), only how to signal that the TE path must support the ATM Forum service classes. A useful application for such paths is the carriage of ATM cells encapsulated in IP or MPLS packets in order to use MPLS networks as functional replacements for ATM networks.",
      "ja": "このプロトコルの追加は、すべてのMPLSラベルは、で定義されたATMサービスクラスをサポートすることができ、トラフィックエンジニアリングパスを知らせるために（を含むが、SONET、イーサネット、およびATMリンク上でパケットに制限されない）ルータ（LSRの）とリンクの種類を交換して使用されていますATMフォーラム[TM]。この文書では、TEパスがATMフォーラムのサービスクラスをサポートしなければならないことを知らせるためにのみどのように、実際に（例えば、必要なキューイングおよびスケジューリングメカニズムなど）ATMフォーラムのサービスクラスをエミュレートするためにMPLSのLSRで機能を実装する方法を指定していません。そのような経路のための有用な用途は、ATMネットワークの機能的代替品としてMPLSネットワークを使用するために、IPまたはMPLSパケットにカプセル化されたATMセルのキャリッジです。"
    },
    {
      "indent": 0,
      "text": "2. Extended RSVP-TE Path Message Format",
      "section_title": true,
      "ja": "2.拡張RSVP-TEパスのメッセージ形式"
    },
    {
      "indent": 3,
      "text": "One new RSVP-TE Object is defined in this document: the ATM_SERVICECLASS Object. Detailed description of this Object is provided below. This new Object is applicable to PATH messages. This specification only defines the use of the ATM_SERVICECLASS Object in PATH messages used to establish LSP (Label Switched Path) Tunnels in accordance with [RSVP-TE]. Such PATH messages contain a Session Object with a C-Type equal to LSP_TUNNEL_IPv4 and a LABEL_REQUEST object.",
      "ja": "ATM_SERVICECLASSオブジェクト：ワン新しいRSVP-TEオブジェクトは、このドキュメントで定義されています。このオブジェクトの詳細な説明は以下に提供されます。この新しいオブジェクトは、PATHメッセージに適用されます。この仕様は、[RSVP-TE]に従い、LSP（ラベルスイッチパス）トンネルを確立するために使用されるPATHメッセージ内ATM_SERVICECLASSオブジェクトの使用を規定します。このようなPathメッセージはLSP_TUNNEL_IPv4に等しいC-TypeとLABEL_REQUESTオブジェクトとセッションオブジェクトを含みます。"
    },
    {
      "indent": 3,
      "text": "Restrictions defined in [RSVP-TE] for support of establishment of LSP Tunnels via RSVP-TE are also applicable to the establishment of LSP Tunnels supporting ATM Service Class-aware traffic engineering. For instance, only unicast LSPs are supported and Multicast LSPs are for further study.",
      "ja": "RSVP-TEを介したLSPトンネルの確立の支援のために[RSVP-TE]で定義された制限もATMサービスクラス対応のトラフィックエンジニアリングをサポートするLSPトンネルの確立にも適用可能です。例えば、ユニキャストLSPはサポートされており、マルチキャストのLSPは、今後の検討課題です。"
    },
    {
      "indent": 3,
      "text": "This new ATM_SERVICECLASS object is optional with respect to RSVP-TE so that general RSVP-TE implementations not concerned with ATM Service Class-aware traffic engineering MPLS LSP setup do not have to support this object.",
      "ja": "ATMサービスクラスを意識したトラフィックエンジニアリングMPLS LSP設定に関係ない一般的なRSVP-TEの実装は、このオブジェクトをサポートする必要がないように、この新しいATM_SERVICECLASSオブジェクトが-TEをRSVPに関しては省略可能です。"
    },
    {
      "indent": 0,
      "text": "2.1 PATH Message Format",
      "section_title": true,
      "ja": "2.1 PATHメッセージフォーマット"
    },
    {
      "indent": 3,
      "text": "The format of the extended PATH message is as follows:",
      "ja": "次のように拡張されたPATHメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "<PATH Message> ::=      <Common Header> [ <INTEGRITY> ]\n                             <SESSION> <RSVP_HOP>\n                         <TIME_VALUES>\n                         [ <EXPLICIT_ROUTE> ]\n                         <LABEL_REQUEST>\n                         [ <SESSION_ATTRIBUTE> ]\n                         [ <DIFFSERV> ]\n                         [ <ATM_SERVICECLASS> ]\n                         [ <POLICY_DATA> ... ]\n                         [ <sender descriptor> ]",
      "raw": true
    },
    {
      "indent": 3,
      "text": "<sender descriptor> ::=  <SENDER_TEMPLATE> [ <SENDER_TSPEC> ]\n                         [ <ADSPEC> ]\n                         [ <RECORD_ROUTE> ]",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3. ATM_SERVICECLASS Object",
      "section_title": true,
      "ja": "3. ATM_SERVICECLASSオブジェクト"
    },
    {
      "indent": 3,
      "text": "The ATM_SERVICECLASS object format is as follows:",
      "ja": "次のようにATM_SERVICECLASSオブジェクトの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Class Number = 227, C_Type = 1",
      "ja": "クラス番号= 227、C_Type = 1"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Reserved                          | SC  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Reserved : 29 bits This field is reserved. It must be set to zero on transmission and must be ignored on receipt.",
      "ja": "予約：このフィールドは予約されている29ビット。これは、送信時にゼロに設定されている必要があり、領収書の上で無視しなければなりません。"
    },
    {
      "indent": 3,
      "text": "SC : 3 bits Indicates the ATM Service Class. Values currently allowed are: 0: UBR (Unspecified Bit Rate) 1: VBR-NRT (Variable Bit Rate, Non-Real Time) 2: VBR-RT (Variable Bit Rate, Real Time) 3: CBR (Constant Bit Rate) 4-7: reserved",
      "ja": "SC：3ビットは、ATMサービスクラスを示します。現在使用できる値は以下のとおりです。0：UBR（未指定ビットレート）1：VBR-NRT（可変ビットレート、非リアルタイム）2：VBR-RT（可変ビットレート、リアルタイム）3：CBR（固定ビットレート）4 -7：予約"
    },
    {
      "indent": 0,
      "text": "4. Handling the ATM_SERVICECLASS Object",
      "section_title": true,
      "ja": "4. ATM_SERVICECLASSオブジェクトの処理"
    },
    {
      "indent": 3,
      "text": "To establish an LSP tunnel with RSVP-TE, the sender LSR creates a PATH message with a session type of LSP_Tunnel_IPv4 and with a LABEL_REQUEST object as per [RSVP-TE]. The sender LSR may also include the DIFFSERV object as per [DIFF-MPLS].",
      "ja": "RSVP-TEでLSPトンネルを確立するために、送信者LSRはLSP_Tunnel_IPv4のセッション・タイプと[RSVP-TE]の通りLABEL_REQUESTオブジェクトとPATHメッセージを作成します。送信者LSRはまた、[DIFF-MPLS]通りのDiffServオブジェクトを含むことができます。"
    },
    {
      "indent": 3,
      "text": "If the LSP is associated with an ATM Service Class, the sender LSR must include the ATM_SERVICECLASS object in the PATH message with the Service-Class (SC) field set to signify the desired ATM Service Class.",
      "ja": "LSPは、ATMサービスクラスに関連付けられている場合、送信者LSRは、所望のATMサービスクラスを意味するためにサービスクラス（SC）フィールドが設定されたPATHメッセージ内ATM_SERVICECLASSオブジェクトを含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a path message contains multiple ATM_SERVICECLASS objects, only the first one is meaningful; subsequent ATM_SERVICECLASS object(s) must be ignored and must not be forwarded.",
      "ja": "パスメッセージは複数ATM_SERVICECLASSオブジェクトが含まれている場合は、最初のものだけで意味があります。その後のATM_SERVICECLASSオブジェクト（複数可）は無視されなければならないと転送されてはなりません。"
    },
    {
      "indent": 3,
      "text": "Each LSR along the path that is ATM_SERVICECLASS-aware records the ATM_SERVICECLASS object, when present, in its path state block.",
      "ja": "ATM_SERVICECLASS認識されるパスに沿った各LSRがATM_SERVICECLASSオブジェクトを記録し、存在する場合、そのパス状態ブロックです。"
    },
    {
      "indent": 3,
      "text": "The destination LSR responds to the PATH message by sending a RESV message without an ATM_SERVICECLASS object (whether the PATH message contained an ATM_SERVICECLASS object or not).",
      "ja": "先LSRはATM_SERVICECLASSオブジェクト（PATHメッセージはATM_SERVICECLASSオブジェクトが含まれているか否か）することなく、RESVメッセージを送信することにより、PATHメッセージに応答します。"
    },
    {
      "indent": 0,
      "text": "5. Non-support of the ATM_SERVICECLASS Object",
      "section_title": true,
      "ja": "ATM_SERVICECLASSオブジェクトの5非サポート"
    },
    {
      "indent": 3,
      "text": "An LSR that does not recognize the ATM_SERVICECLASS object Class Number must behave in accordance with the procedures specified in [RSVP] for an unknown Class Number with the binary format 11bbbbbb, where b=0 or 1 (i.e., RSVP will ignore the object but forward it unexamined and unmodified).",
      "ja": "ATM_SERVICECLASSオブジェクトクラス番号を認識しないLSRは、B = 0または1（すなわち、RSVPは、前方の物体を無視しますが、バイナリフォーマット11bbbbbb、未知クラス番号は[RSVP]で指定された手順に従って動作する必要があります未未修飾が）。"
    },
    {
      "indent": 3,
      "text": "An LSR that recognizes the ATM_SERVICECLASS object Class Number but does not recognize the ATM_SERVICECLASS object C-Type, must behave in accordance with the procedures specified in [RSVP] for an unknown C-type (i.e., it must send a PathErr with the error code 'Unknown object C-Type' toward the sender).",
      "ja": "ATM_SERVICECLASSオブジェクトクラスナンバーを認識するだけで（すなわち、それはエラーコードでのPathErrを送信する必要があり、ATM_SERVICECLASSオブジェクトC-タイプを認識しない、未知のC型用の[RSVP]で指定された手順に従って動作する必要がありますLSR送信者に向けて「不明なオブジェクトC型」）。"
    },
    {
      "indent": 3,
      "text": "In both situations, this causes the path setup to fail. The sender should notify management that a LSP cannot be established and possibly might take action to retry reservation establishment without the ATM_SERVICECLASS object.",
      "ja": "両方の状況では、これはパス設定が失敗します。送信者は、LSPを確立することはできませんし、おそらくATM_SERVICECLASSオブジェクトなしで予約の確立を再試行する行動を取る可能性がある管理に通知しなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The solution is not expected to add specific security requirements beyond those of Diff-Serv and existing TE. The security mechanisms currently used with Diff-Serv and existing TE can be used with this solution.",
      "ja": "溶液はデフ-SERVと既存TEのそれを超えて、特定のセキュリティ要件を追加することが予想されていません。現在のDiff-Servのと既存のTEで使用されるセキュリティメカニズムは、このソリューションを使用することができます。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IANA has registered a new RSVP Class Number for ATM_SERVICECLASS (227). (See http://www.iana.org/assignments/rsvp-parameters).",
      "ja": "IANAはATM_SERVICECLASS（227）のための新しいRSVPクラス番号を登録しています。 （http://www.iana.org/assignments/rsvp-parametersを参照してください）。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 3,
      "text": "[DIFF-MPLS] Le Faucheur, F., Wu, L., Davie, B., Davari, S., Vaananen, P., Krishnan, R., Cheval, P. and J. Heinanen, \"Multi-Protocol Label Switching (MPLS) Support of Differentiated Services\", RFC 3270, May 2002.",
      "ja": "[DIFF-MPLS]ルFaucheur、F.、ウー、L.、デイビー、B.、Davari、S.、Vaananen、P.、クリシュナン、R.、シュヴァル、P.及びJ. Heinanen、「マルチプロトコルラベル差別化サービスの（MPLS）サポート」、RFC 3270、2002年5月を切り替えます。"
    },
    {
      "indent": 3,
      "text": "[RSVP] Braden, R., Ed., Zhang, L., Berson, S., Herzog, S. and S. Jazmin , \"Resource ReSerVation Protocol (RSVP) -- Version 1 Functional Specification\", RFC 2205, September 1997.",
      "ja": "[RSVP]ブレーデン、R.、エド、チャン、L.、Berson氏、S.、ハーツォグ、S.とS. Jazmin、 \"リソース予約プロトコル（RSVP） - バージョン1の機能的な仕様\"。、RFC 2205、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RSVP-TE] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V. and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "ja": "[RSVP-TE] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニバサン、V.およびG.ツバメ、 \"RSVP-TE：ExtensionsがLSPトンネルのためのRSVPする\"、RFC 3209、 2001年12月。"
    },
    {
      "indent": 3,
      "text": "[TM] ATM Forum Traffic Management Specification Version 4.0, af-tm-0056.000, April 1996.",
      "ja": "[TM] ATM Forumトラフィック管理仕様バージョン4.0、バイTM-0056.000、1996年4月。"
    },
    {
      "indent": 0,
      "text": "9. Authors' Addresses",
      "section_title": true,
      "ja": "9.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Andrew G. Malis Vivace Networks, Inc. 2730 Orchard Parkway San Jose, CA 95134",
      "ja": "アンドリューG. Malisビバーチェネットワークス株式会社2730オーチャードパークウェイサンノゼ、CA 95134"
    },
    {
      "indent": 3,
      "text": "EMail: Andy.Malis@vivacenetworks.com",
      "ja": "メールアドレス：Andy.Malis@vivacenetworks.com"
    },
    {
      "indent": 3,
      "text": "Tony Hsiao Vivace Networks, Inc. 2730 Orchard Parkway San Jose, CA 95134",
      "ja": "トニー・シャオヴィヴァーチェネットワークス株式会社2730オーチャードパークウェイサンノゼ、CA 95134"
    },
    {
      "indent": 3,
      "text": "EMail: Tony.Hsiao@VivaceNetworks.com",
      "ja": "メールアドレス：Tony.Hsiao@VivaceNetworks.com"
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "ja": "10.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}