{
  "title": {
    "text": "RFC 2483 - URI Resolution Services Necessary for URN Resolution",
    "ja": "RFC 2483 - URNの解決のために必要なURI解決サービス"
  },
  "number": 2483,
  "created_at": "2019-10-27 01:53:16.302918+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                      M. Mealling\nRequest for Comments: 2483                     Network Solutions, Inc.\nCategory: Experimental                                  R. Daniel, Jr.\n                                        Los Alamos National Laboratory\n                                                          January 1999",
      "raw": true
    },
    {
      "indent": 22,
      "text": "  URI Resolution Services\nNecessary for URN Resolution",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのためにExperimentalプロトコルを定義します。それはどんな種類のインターネット標準を指定しません。改善のための議論や提案が要求されています。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Retrieving the resource identified by a Uniform Resource Identifier (URI) [1] is only one of the operations that can be performed on a URI. One might also ask for and get a list of other identifiers that are aliases for the original URI or a bibliographic description of the resource the URI denotes, for example. This applies to both Uniform Resource Names (URNs) and Uniform Resource Locators (URLs). Uniform Resource Characteristics (URCs) are discussed in this document but only as descriptions of resources rather than identifiers.",
      "ja": "ユニフォームリソース識別子（URI）によって識別されたリソースを検索する[1]のみ1つのURIに対して実行できる操作のです。一つは、またのために尋ねると、元のURIまたはURIは、例えば、意味リソースの書誌記述のための別名である他の識別子のリストを取得する可能性があります。これは、両方の統一リソース名（URN）とUniform Resource Locator（URL）に適用されます。ユニフォームリソース特性（URCs）は、この文書ではなくリソースのみではなく、識別子の記述として議論されています。"
    },
    {
      "indent": 3,
      "text": "A service in the network providing access to a resource may provide one or some of these options, but it need not provide all of them. This memo specifies an initial set of these operations that can be used to describe the interactions provided by a given access service. It also suggests guidelines that should be adhered to when those operations are encoded in a protocol.",
      "ja": "リソースへのアクセスを提供するネットワークでのサービスは、1つまたはこれらのオプションのいくつかを提供することができるが、それはそれらのすべてを提供する必要はありません。このメモは、所与のアクセスサービスによって提供される相互作用を記述するために使用することができ、これらの操作の最初のセットを指定します。それはまた、これらの操作はプロトコルで符号化されたときに接着されるべきガイドラインを示唆しています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "In the course of formulating current proposals [2] regarding URNs [3], it became apparent that requiring servers to manage all of the desired functions or requiring clients to process varied information returned by a server was unrealistic and a barrier to adoption. There needed to be some way for a client to be able to identify a server that specialized in the complex and another that specialized in the simple (but fast). Also, in subsequent conversations it became obvious that, in most cases, some of the operations were inappropriate or difficult for certain identifiers.",
      "ja": "URNに関する現在の提案を策定する過程[2] [3]は、サーバによって返された多様な情報を処理するために所望の機能又は必要すべてのクライアントを管理するサーバを必要とすることは非現実的と採用に対する障壁であったことが明らかになりました。クライアントは、複雑で、単純な（しかし速い）に特化その別に特化したサーバを識別することができるようにするための何らかの手段が必要になります。また、その後の会話では、ほとんどの場合、操作のいくつかは、特定の識別子の不適切または困難であった、あることが明らかになりました。"
    },
    {
      "indent": 3,
      "text": "The Problem",
      "ja": "問題"
    },
    {
      "indent": 3,
      "text": "In the process of learning about a resource in the Internet, there are a variety of possible functions that may be important and/or useful, such as discovery of locators, names, descriptions, and accessing the resource itself. A given service may support only a subset of these; hence, it is important to describe such an access service by the types of functions supported and the resources of which it has some knowledge. For example, in the framework for an RDS described in [5] the RDS itself may provide URLs [6][7], while the resolvers may provide descriptions, URLs, or even the resources themselves. The design of an RDS, as proposed in RFC 2168 [2], may be more generous and provide all of the above.",
      "ja": "インターネットでのリソースについての学習の過程では、このようなロケータの発見として、重要かつ/または有用である可能性が可能な機能、各種の、名前、説明、およびリソース自体へのアクセスがあります。特定のサービスは、これらのサブセットのみをサポートすることができます。したがって、サポートされている関数の種類と、それはいくつかの知識を持っているのリソースによって、このようなアクセスサービスを記述することが重要です。例えば、RDSのためのフレームワークで[5] RDS自体が提供するURLで説明[6] [7]、レゾルバは、説明、URLの、あるいはリソース自体を提供するかもしれません。 RDSの設計は、RFC 2168で提案されている[2]、より寛大であると、上記の全てを提供してもよいです。"
    },
    {
      "indent": 3,
      "text": "This problem requires some well understood set of identifiers that specify those operations. But an exhaustive set would both be impossible and not very necessary. Thus, this document will list several operations, as well as, lay out requirements for specifying new operations.",
      "ja": "この問題は、これらの操作を指定する識別子のいくつかのよく理解セットが必要です。しかし、徹底的なセットは、両方の非常に必要に不可能はないだろう。したがって、このドキュメントは、いくつかの操作を一覧表示する、など、新しい操作を指定するための要件をレイアウトします。"
    },
    {
      "indent": 3,
      "text": "The purpose of this document is to define a list of such functions and short names for them and then use them in defining the interface to an access service. Previous versions of this document referred to services where the arguments were specific types of URIs such as URNs or URLs. These services were called \"N2L\" and \"L2L\",for example. Their use has been changed in favor of the more general URI form.",
      "ja": "このドキュメントの目的は、彼らのために、このような機能と短い名前のリストを定義し、アクセスサービスへのインタフェースを定義する際にそれらを使用することです。このドキュメントの以前のバージョンでは、引数は、そのようなURNのか、URLなどのURIの特定のタイプだったサービスに言及しました。これらのサービスは、たとえば、「N2L」と「L2L」と呼ばれていました。これらの使用は、より一般的なURI形式の賛成で変更されました。"
    },
    {
      "indent": 3,
      "text": "Design Criteria",
      "ja": "設計基準"
    },
    {
      "indent": 3,
      "text": "To meet these requirements a fairly simple design criteria was used. The need to identify the operation with some token such that its operands, algorithm, and errors were known proved sufficient to meet these requirements.",
      "ja": "これらの要件を満たすために非常に単純な設計基準を使用しました。そのオペランド、アルゴリズム、およびエラーが知られていたようないくつかのトークンを使用して操作を特定する必要がこれらの要件を満たすのに十分であることが判明しました。"
    },
    {
      "indent": 0,
      "text": "2. General Specification",
      "section_title": true,
      "ja": "2.一般仕様"
    },
    {
      "indent": 3,
      "text": "To provide a framework both for the specifications in this document and for future work to be written by others, the guidelines below are suggested for documents that seek to specify new operations. Any specification of a member of this set of operations should address these issues with respect to its operands, algorithm, output, and errors.",
      "ja": "このドキュメントの仕様については、他で書き込まれる今後の作業のために、両方のフレームワークを提供するために、以下のガイドラインは、新しい操作を指定することを求める文書のために提案されています。動作のこのセットのメンバーのいずれかの仕様は、そのオペランド、アルゴリズム、出力、およびエラーに対してこれらの問題に対処すべきです。"
    },
    {
      "indent": 3,
      "text": "Due to the small number of listed functions, a registration mechanism was dismissed as premature. If this list grows, a registration mechanism will probably be needed.",
      "ja": "記載された機能の数が少ないため、登録メカニズムは時期尚早として却下されました。このリストが大きくなった場合、登録メカニズムは、おそらく必要になります。"
    },
    {
      "indent": 3,
      "text": "Also, due to the experimental nature of this document and the systems that use its specifications, the use of words like MUST and SHALL are limited. Where used they reflect a case where this specification could cause harm to existing, non-experimental systems such as HTTP and URNs. Thus, the key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119.",
      "ja": "また、本文書の実験的な性質とその仕様を使用するシステムのために、MUSTのような言葉の使用と限定されているものとします。どこを使用し、彼らは、この仕様は、HTTPやURNのような既存の、非実験系に害を引き起こす可能性のケースを反映しています。したがって、この中で、キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\" は、 \"SHALL\"、 \"NOT SHALL\"、 \"べきではありません\"、 \"推奨\"、 \"すべきである\"、 \"MAY\"、および \"オプション\"文書は、RFC 2119に記載されるように解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "2.1 Operands",
      "section_title": true,
      "ja": "2.1オペランド"
    },
    {
      "indent": 3,
      "text": "Operands must contain the following pieces of information:",
      "ja": "オペランドは、以下の情報が含まれている必要があります。"
    },
    {
      "indent": 6,
      "text": "* name of the operation * case insensitive mnemonic for the operation * number of operands * type of each operand * format of each operand",
      "ja": "各オペランドの各オペランド*フォーマットのオペランドの操作*数*タイプの*操作の名前*大文字と小文字を区別しないニーモニック"
    },
    {
      "indent": 0,
      "text": "2.2 Algorithm",
      "section_title": true,
      "ja": "2.2アルゴリズム"
    },
    {
      "indent": 3,
      "text": "The exact algorithm for the operation must either be specified completely or it must be considered opaque and defined by the server or application.",
      "ja": "操作のための正確なアルゴリズムは、いずれかの完全に指定されなければならないか、不透明であると考えられ、サーバまたはアプリケーションによって定義されなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.3 Output",
      "section_title": true,
      "ja": "2.3出力"
    },
    {
      "indent": 3,
      "text": "Output must specify one of the following:",
      "ja": "出力は、次のいずれかを指定する必要があります。"
    },
    {
      "indent": 6,
      "text": "* there is no output * the output is undefined * the output itself and its content * the fact that the output is an object and the object's type and format * any non-protocol specific errors",
      "ja": "*は出力*出力が不定になり*出力自体とその内容*出力はオブジェクトとオブジェクトのタイプおよびフォーマット*以外のプロトコル固有のエラーであるということはありません"
    },
    {
      "indent": 0,
      "text": "2.4 Error Conditions",
      "section_title": true,
      "ja": "2.4エラー条件"
    },
    {
      "indent": 3,
      "text": "All errors that are considered applicable across all implementations and application environments must be included. Errors that depend on the system conveying the service are not included. Thus, many of the expected errors such as service availability or operation syntax are not included in this document since they are implementation dependent.",
      "ja": "すべての実装およびアプリケーション環境全体に適用されると考えられているすべてのエラーが含まれている必要があります。サービスを伝えるシステムに依存エラーが含まれていません。彼らは実装に依存しているので、したがって、そのようなサービスの可用性や操作の構文として期待されるエラーの多くは、本文書に含まれていません。"
    },
    {
      "indent": 0,
      "text": "2.5 Security Considerations",
      "section_title": true,
      "ja": "2.5セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Any security considerations relating to the service provided must be specified. This does NOT include considerations dealing with the protocol used to convey the service or to those that normally accompany the results of the service. For example, a service that returned a single URL would need to discuss the situation where someone maliciously inserts an incorrect URL into the resolver but NOT the case where someone sends personal information across the Internet to the resource identified by the correct URL.",
      "ja": "提供されるサービスに関連するセキュリティ上の考慮事項を指定する必要があります。これは、サービスを伝えるために使用されるプロトコルまたは通常のサービスの結果を伴うものに対処する検討事項が含まれていません。例えば、単一のURLを返されたサービスは、誰かが悪意を持ってリゾルバではなく、誰かが正しいURLで識別されるリソースにインターネットを介して個人情報を送信する場合に、誤ったURLを挿入状況を議論する必要があります。"
    },
    {
      "indent": 0,
      "text": "3. Encoding The Operations",
      "section_title": true,
      "ja": "3.操作のエンコーディング"
    },
    {
      "indent": 3,
      "text": "To be useful, these operations have to be used within some system or protocol. In many cases, these systems and protocols will place restrictions on which operations make sense and how those that do are syntactically represented. It is sufficient for those protocols to define new operations within their own protocol specification documents but care should be taken to make this fact well known.",
      "ja": "有用であるために、これらの操作は、いくつかのシステムやプロトコル内で使用する必要があります。多くの場合、これらのシステムおよびプロトコルは、操作が理にかなって、どのように構文的に表現されないものこれに制限を配置します。これらのプロトコルは、独自のプロトコル仕様書の中に新しい操作を定義するのではなく、ケアが良く知られているこの事実を作るために取られるべきであることは十分です。"
    },
    {
      "indent": 3,
      "text": "Also, a given system or protocol will have its own output specifications that may restrict the output formats of a given operation. Additionally, a given protocol may have better solution for output than the ones given here. For example, the result of an operation that converts a URI to more than one URL may be encoded in a protocol-specific manner that conveys information about the closeness of each resource on the network.",
      "ja": "また、所与のシステムまたはプロトコルは、特定の操作の出力形式を制限することができる独自の出力仕様を有することになります。また、特定のプロトコルは、ここに与えられたものよりも出力のためのよりよい解決策を持っていることがあります。例えば、複数のURLにURIを変換操作の結果は、ネットワーク上の各リソースの近さについての情報を伝えるプロトコル固有の方法で符号化することができます。"
    },
    {
      "indent": 3,
      "text": "Thus, the requirements on encoding these operations within a given system are as follows:",
      "ja": "次のようにこのように、所与のシステム内でこれらの操作をコード上の要件は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "* which subset of the operations are allowed * how the operator is encoded * how the operands are encoded * how the error codes are returned",
      "ja": "*操作のどのサブセットがエラーコードが返される方法*オペランドが符号化される方法*オペレータのエンコード方法*許可されてい"
    },
    {
      "indent": 3,
      "text": "The text/uri-list MIME Media Type is specified in Section 5. This Media Type is merely a suggestion for experimental systems that need a simple implementation. It is included here merely as an example to show completeness (however simple it may be).",
      "ja": "uriテキスト/リストMIMEメディアタイプは、このメディアタイプは、単に単純な実装を必要とする実験系のための提案である、セクション5で指定されています。 （それがかもしれしかし、単純な）完全性を示すために、単なる例として、ここに含まれています。"
    },
    {
      "indent": 0,
      "text": "4. The Incomplete Set",
      "section_title": true,
      "ja": "4.不完全なセット"
    },
    {
      "indent": 0,
      "text": "4.1 I2L (URI to URL)",
      "section_title": true,
      "ja": "４。１ い２Ｌ （うり と うＲＬ）"
    },
    {
      "indent": 6,
      "text": "* Name: URI to URL\n* Mnemonic: I2L\n* Number of Operands: 1\n* Type of Each Operand: First operand is a URI.\n* Format of Each Operand: First operand is encoded as a URI.\n* Algorithm: Opaque\n* Output: One and only one URL\n* Errors Conditions:\n     o Malformed URI\n     o URI is syntactically valid but does not exist in any form.\n     o URI exists but there is no available output from this\n       operation.\n     o URI existed in the past but nothing is currently known\n       about it.\n     o Access denied",
      "raw": true
    },
    {
      "indent": 6,
      "text": "* Security Considerations: o Malicious Redirection One of the fundamental dangers related to any service such as this is that a malicious entry in a resolver's database will cause clients to resolve the URI into the wrong URL. The possible intent may be to cause the client to retrieve a resource containing fraudulent or damaging material. o Denial of Service By removing the URL to which the URI maps, a malicious intruder may remove the client's ability to retrieve the resource.",
      "ja": "*セキュリティの考慮：悪意のあるリダイレクションoをこのような任意のサービスに関連する基本的な危険性の一つは、リゾルバのデータベースに悪質なエントリが間違ったURLにURIを解決するためにクライアントを引き起こすということです。可能な意図は、クライアントが不正または有害物質を含むリソースを取得させるかもしれません。 URIマップこれにURLを除去することにより、サービス拒否O、悪意のある侵入者は、リソースを取得するためのクライアントの機能を削除することができます。"
    },
    {
      "indent": 3,
      "text": "This operation is used to map a single URI to a single URL. It is used by lightweight clients that do not have the ability to select from a list of URLs or understand a URC. The algorithm for this mapping is dependent on the URI scheme.",
      "ja": "この操作は、単一のURLに単一のURIをマップするために使用されます。これは、URLのリストから選択するか、URCを理解する能力を持っていない軽量クライアントによって使用されます。このマッピングのためのアルゴリズムは、URIスキームに依存しています。"
    },
    {
      "indent": 0,
      "text": "4.2 I2Ls (URI to URLs)",
      "section_title": true,
      "ja": "4.2 I2Ls（URLへのURI）"
    },
    {
      "indent": 6,
      "text": "* Name: URI to URLs\n* Mnemonic: I2LS\n* Number of Operands: 1\n* Type of Each Operand: First operand is a URI.\n* Format of Each Operand: First operand is encoded as a URI.\n* Algorithm: Opaque\n* Output: A list of zero or more URLs\n* Errors:\n     o Malformed URI o URI is syntactically valid but does not exist in any form.\n     o URI exists but there is no available output from this\n       operation.\n     o URI existed in the past but nothing is currently known\n       about it.\n     o Access denied\n* Security Considerations:\n     o Malicious Redirection (see I2L)\n     o Denial of Service (see I2L)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This operation is used to map a single URI to 0 or more URLs. It is used by a client that can pick from a list of URLs based on some criteria that are important to the client. The client should not make any assumptions about the order of the URLs returned. No matter what the particular media type, the result should be a list of the URLs that may be used to obtain an instance of the resource identified by the URI. All URIs shall be encoded according to the URL [7] and URN [3] specifications.",
      "ja": "この操作は、0以上のURLへの単一のURIをマップするために使用されます。これは、クライアントにとって重要ないくつかの基準に基づいてURLのリストから選ぶことができ、クライアントによって使用されます。クライアントは、返されたURLの順序についての仮定を行うべきではありません。どんな特定のメディアタイプ、結果は、UR​​Iによって識別されたリソースのインスタンスを取得するために使用することができるURLのリストはなりません。すべてのURIは、URL [7]とURN [3]仕様に従ってエンコードされなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3 I2R (URI to Resource)",
      "section_title": true,
      "ja": "４。３ い２Ｒ （うり と れそうｒせ）"
    },
    {
      "indent": 6,
      "text": "* Name: URI to Resource\n* Mnemonic: I2R\n* Number of Operands: 1\n* Type of Each Operand: First operand is a URI.\n* Format of Each Operand: First operand is encoded as a URI.\n* Algorithm: Opaque\n* Output: An instance of the resource named by the URI.\n* Errors:\n     o Malformed URI\n     o URI is syntactically valid but does not exist in any form.\n     o URI exists but there is no available output from this\n       operation.\n     o URI existed in the past but nothing is currently known\n       about it.\n     o Access denied\n* Security Considerations:\n     o Malicious Redirection (see I2L)\n     o Denial of Service (see I2L)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This operation is used to return a single instance of the resource that is named by the URI. The format of the output is dependent on the resource itself.",
      "ja": "この操作は、URIによって指定されたリソースの単一のインスタンスを返すために使用されます。出力の形式は、リソース自体に依存しています。"
    },
    {
      "indent": 0,
      "text": "4.4 I2Rs (URI to Resources)",
      "section_title": true,
      "ja": "４。４ い２Ｒｓ （うり と れそうｒせｓ）"
    },
    {
      "indent": 6,
      "text": "* Name: URI to Resources\n* Mnemonic: I2Rs\n* Number of Operands: 1\n* Type of Each Operand: First operand is a URI.\n* Format of Each Operand: First operand is encoded as a URI.\n* Algorithm: Opaque\n* Output: Zero or more instances of the resource named by the URI.\n* Errors:\n     o Malformed URI\n     o URI is syntactically valid but does not exist in any form.\n     o URI exists but there is no available output from this\n       operation.\n     o URI existed in the past but nothing is currently known\n       about it.\n     o Access denied\n* Security Considerations:\n     o Malicious Redirection (see I2L)\n     o Denial of Service (see I2L)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This operation is used to return multiple instances of a resource, for example, GIF and JPEG versions of an image. The judgment about the resources being \"the same\" resides with the naming authority that issued the URI.",
      "ja": "この操作は、画像のリソース、例えば、GIFおよびJPEGバージョンの複数のインスタンスを戻すために使用されます。 「同じ」であるリソースについての判断は、URIを発行した命名機関に常駐しています。"
    },
    {
      "indent": 3,
      "text": "The output shall be a MIME multipart/alternative [4] message with the alternative versions of the resource in separate body parts. If there is only one version of the resource identified by the URN, it MAY be returned without the multipart/alternative wrapper.",
      "ja": "出力は、別体の部品でリソースの代替バージョンと[4]メッセージのMIMEマルチパート/代替的でなければなりません。 URNで識別されるリソースの1つのバージョンのみが存在する場合、それはマルチパート/代替ラッパーなしで返されることがあります。"
    },
    {
      "indent": 0,
      "text": "4.5 I2C (URI to URC)",
      "section_title": true,
      "ja": "4.5 I2C（URCへのURI）"
    },
    {
      "indent": 6,
      "text": "* Name: URI to URC * Mnemonic: I2C * Number of Operands: 1 * Type\nof Each Operand: First operand is a URI.  * Format of Each\nOperand: First operand is encoded as a URI.  * Algorithm: Opaque *\nOutput: A URC * Errors:\n     o Malformed URI\n     o URI is syntactically valid but does not exist in any form.\n     o URI exists but there is no available output from this\n       operation.\n     o URI existed in the past but nothing is currently known\n       about it.\n     o Access denied * Security Considerations:\n     o Malicious Redirection (see I2L)\n     o Denial of Service (see I2L)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Uniform Resource Characteristics are descriptions of resources. This request allows the client to obtain a description of the resource identified by a URI, as opposed to the resource itself or simply the resource's URLs. The description might be a bibliographic citation, a digital signature, or a revision history. This memo does not specify the content of any response to a URC request. That content is expected to vary from one server to another.",
      "ja": "ユニフォームリソース特性は、リソースの説明です。リソース自体または単にリソースのURLのとは対照的に、この要求は、クライアントはURIで識別されるリソースの記述を取得することができます。説明は、書誌事項、デジタル署名、または改訂履歴かもしれません。このメモはURC要求に対する応答の内容を指定していません。その内容は、一つのサーバから別のものに変化することが期待されています。"
    },
    {
      "indent": 0,
      "text": "4.6 I2CS (URI to URCs)",
      "section_title": true,
      "ja": "４。６ い２ＣＳ （うり と うＲＣｓ）"
    },
    {
      "indent": 6,
      "text": "* Name: URI to URCs\n* Mnemonic: I2CS\n* Number of Operands: 1\n* Type of Each Operand: First operand is a URI.\n* Format of Each Operand: First operand is encoded as a URI.\n* Algorithm: Opaque\n* Output: Zero or more URCs\n* Errors:\n     o Malformed URI\n     o URI is syntactically valid but does not exist in any form.\n     o URI exists but there is no available output from this\n       operation.\n     o URI existed in the past but nothing is currently known\n       about it.\n     o Access denied\n* Security Considerations:\n     o Malicious Redirection (see I2L)\n     o Denial of Service (see I2L)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "URCs can come in different formats and types. This operation returns zero or more URCs that are appropriate for the given URI.",
      "ja": "URCsは異なるフォーマットやタイプに来ることができます。この動作は、指定されたURIのために適切であるゼロ以上URCsを返します。"
    },
    {
      "indent": 0,
      "text": "4.7 I2N (URI to URN)",
      "section_title": true,
      "ja": "4.7 I2N（URNへのURI）"
    },
    {
      "indent": 6,
      "text": "* Name: URI to URN\n* Mnemonic: I2N\n* Number of Operands: 1\n* Type of Each Operand: First operand is a URN.\n* Format of Each Operand: First operand is encoded as a URI.\n* Algorithm: Opaque\n* Output: One and only one URN\n* Errors:\n     o Malformed URI\n     o URI is syntactically valid but does not exist in any form.\n     o URI exists but there is no available output from this\n       operation.\n     o URI existed in the past but nothing is currently known\n       about it.",
      "raw": true
    },
    {
      "indent": 6,
      "text": " o Access denied * Security Considerations: o Malicious Redirection (see I2L) o Denial of Service (see I2L)",
      "ja": "Oアクセスは、*セキュリティの考慮を拒否：サービス拒否O悪質なリダイレクト（I2Lを参照してください）（I2Lを参照してください）O"
    },
    {
      "indent": 3,
      "text": "While URNs are supposed to identify one and only one resource, that does not mean that a resource may have one and only one URN. For example, consider a resource that one organization wishes to name 'foo'; another organization, in agreement with the first, wants to call the resource 'bar'. Both organizations can agree that both names 'name' the same resource and that the URNs 'foo' and 'bar' are equivalent.",
      "ja": "URNのが、唯一のリソースを識別することになっているが、それは、リソースは、唯一のURNを有することができることを意味するものではありません。例えば、ある組織が「foo」を命名したいリソースを検討します。別の組織では、最初に一致し、「バー」リソースを呼び出すために望んでいます。両組織は、両方の名前「名前」同じリソースということに同意することができますし、URNの「FOO」と「バー」を同等であること。"
    },
    {
      "indent": 3,
      "text": "The result is a URN, known to the server, that identifies the same resource as the input URN.",
      "ja": "結果は、入力URNと同じリソースを識別するサーバに知られているURN、、です。"
    },
    {
      "indent": 3,
      "text": "Extreme care should be taken with this service as it toys with the idea of equality with respect to URNs. As mentioned in several URN documents, the idea of equality is very domain specific. For example, a URN pointing to a weather map for a particular day and a URN pointing to the map as it changes from day to day would NOT be returned in this example because they point to do different resources. Some other concept of temporary equivalence is at work. This service instead deals with resources that have two different names where there is a binding between the names that is agreed by both name assigners. I.e., both namespaces MUST have agreed that the each name can be used in place of the other and the meaning does not change.",
      "ja": "細心の注意を払ったURNに関して平等の考え方とそれおもちゃなど、このサービスで取られるべきです。いくつかのURN文書で述べたように、平等の考え方は非常にドメイン固有のものです。例えば、URNは特定の日の天気マップを指し、それらは異なるリソースを行うことを指すので、それが日から日への変更としてマップを指すURNは、この例で返されることはありません。一時的に等価の他のいくつかの概念が仕事です。このサービスではなく、両方の名前assignersによって合意された名前との間の結合が存在する2つの異なる名前を持つリソースを扱います。すなわち、両方の名前空間は、それぞれの名前が他の代わりに使用することができ、意味が変化しないことで合意している必要があります。"
    },
    {
      "indent": 0,
      "text": "4.8 I2Ns (URI to URNs)",
      "section_title": true,
      "ja": "4.8 I2Ns（のURNのURI）"
    },
    {
      "indent": 6,
      "text": "* Name: URI to URNs\n* Mnemonic: I2NS\n* Number of Operands: 1\n* Type of Each Operand: First operand is a URI.\n* Format of Each Operand: First operand is encoded as a URI.\n* Algorithm: Opaque\n* Output: A list of URNs\n* Errors:\n     o Malformed URI\n     o URI is syntactically valid but does not exist in any form.\n     o URI exists but there is no available output from this\n       operation.\n     o URI existed in the past but nothing is currently known\n       about it.\n     o Access denied\n* Security Considerations:\n     o Malicious Redirection (see I2L) o Denial of Service (see I2L)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This operation simply returns zero or more URNs following the same criteria and cautions as the I2N operation.",
      "ja": "この操作は、単にI2N動作と同じ基準および注意事項を次のゼロ以上のURNを返します。"
    },
    {
      "indent": 0,
      "text": "4.9 I=I (Is URI equal to URI):",
      "section_title": true,
      "ja": "4.9 I = I（URIは、URIに等しいです）："
    },
    {
      "indent": 6,
      "text": "* Name: URI = URI\n* Mnemonic: I=I\n* Number of Operands: 2\n* Type of Each Operand: Both operands are URIs.\n* Format of Each Operand: Both operands are encoded as a URIs.\n* Algorithm: Opaque\n* Output: TRUE or FALSE\n* Errors:\n     o Malformed URIs\n     o URIs are syntactically valid but do not exist in any form.\n     o URIs exist but there is no available output from this\n       operation.\n     o URIs existed in the past but nothing is currently known\n       about them.\n     o Access denied\n* Security Considerations:\n     o Malicious Redirection (see I2L)\n     o Denial of Service (see I2L)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This operation is used to determine whether two given URIs are considered to be equal by the server being asked the question. The algorithm used to determine equality is opaque. No assertions are made about whether or not the URIs exhibits characteristics of URNs or URLs.",
      "ja": "この操作は、質問をされている2つの与えられたURIはサーバによって等しいと考えているかどうかを決定するために使用されます。平等を決定するために使用されるアルゴリズムは不透明です。いいえアサーションはURIがのURNまたはURLの特性を示すかどうかについて行われません。"
    },
    {
      "indent": 0,
      "text": "5. The text/uri-list Internet Media Type",
      "section_title": true,
      "ja": "5. uriテキスト/リストインターネットメディアタイプ"
    },
    {
      "indent": 3,
      "text": "Several of the resolution service requests, such as I2Ls, I2Ns, result in a list of URIs being returned to the client. The text/uri-list Internet Media Type is defined to provide a simple format for the automatic processing of such lists of URIs.",
      "ja": "このようI2Ls、I2Nsとして解決サービス要求のいくつかは、クライアントに返されるURIのリストにつながります。 uriテキスト/リストインターネットメディアタイプは、URIのようなリストの自動処理のための簡単なフォーマットを提供するために定義されています。"
    },
    {
      "indent": 3,
      "text": "This is a copy of the IANA registration of the text/uri-list Media Type.",
      "ja": "これは、uriテキスト/リストメディアタイプのIANA登録のコピーです。"
    },
    {
      "indent": 4,
      "text": "Date: Fri, 18 Apr 97 08:36:07 PDT From: Ron Daniel Jr. <rdaniel@lanl.gov> To: iana@iana.org, rdaniel@lanl.gov Subject: Request for MIME media type Text/IETF Tree - uri-list",
      "ja": "日付：金、4月18日午前8時36分07秒97 PDTから：iana@iana.org、rdaniel@lanl.gov件名：MIMEメディアタイプのテキストのための要求/ IETF木にロンダニエル・ジュニア<rdaniel@lanl.gov> -  URIリスト"
    },
    {
      "indent": 4,
      "text": "Name : Ron Daniel Jr.",
      "ja": "名前：ロン・ダニエル・ジュニア"
    },
    {
      "indent": 4,
      "text": "E-mail : rdaniel@lanl.gov",
      "ja": "Eメール：rdaniel@lanl.gov"
    },
    {
      "indent": 4,
      "text": "MIME media type name : Text",
      "ja": "MIMEメディアタイプ名：テキスト"
    },
    {
      "indent": 4,
      "text": "MIME subtype name : IETF Tree -uri-list",
      "ja": "MIMEサブタイプ名：IETFツリー-uriリスト"
    },
    {
      "indent": 4,
      "text": "Required parameters : none",
      "ja": "必須パラメータ：なし"
    },
    {
      "indent": 4,
      "text": "Optional parameters : charset",
      "ja": "オプションのパラメータ：文字セット"
    },
    {
      "indent": 4,
      "text": "Currently, URIs can be represented using US-ASCII. However, there are many non-standard URIs which use special character sets. Discussion of how to best achieve internationalization of URIs is underway. This registration will be updated with a discussion of the URI charsets once that discussion has concluded.",
      "ja": "現在、URIはUS-ASCIIを使用して表すことができます。しかし、特殊な文字セットを使用する多くの非標準的なURIがあります。最高のURIの国際化を達成する方法の議論が進行中です。その議論が終了した後、この登録は、URI文字セットの議論で更新されます。"
    },
    {
      "indent": 4,
      "text": "Encoding considerations : Some transfer protocols, such as SMTP, place limits on the length of lines. Very long URIs might exceed those limits. Systems must therefore be prepared to use a suitable content transfer encoding. This is anticipated to be a rare occurance.",
      "ja": "エンコードの考慮事項：一部の転送プロトコル、SMTPなど、線の長さの場所の制限。とても長いURIは、これらの制限を超える可能性があります。システムは、従って、適切なコンテンツ転送符号化を使用するために準備されなければなりません。これはまれなのoccuranceことが予想されます。"
    },
    {
      "indent": 4,
      "text": "Security considerations : Client software should be aware of the security considerations of URIs. For example, accessing some URIs can result in sending a death threat to a head of state, frequently prompting a visit from the relevant protective service. Accessing other URIs may result in financial obligations, or access to resources considered inappropriate by one's employer.",
      "ja": "セキュリティの考慮事項：クライアントソフトウェアは、URIのセキュリティの考慮事項に注意する必要があります。例えば、いくつかのURIにアクセスすることは頻繁に関連する保護サービスからの訪問を促し、国家元首に死の脅威を送ることになります。他のURIにアクセスすると、金融債務、または1つの雇用主が不適切と判断資源へのアクセスをもたらすことができます。"
    },
    {
      "indent": 4,
      "text": "While the legitimate provider of a uri-list could exploit these properties for good or ill, it is more likely that uri-lists will be falsified in order to exploit such characteristics of URIs.",
      "ja": "URIリストの正当なプロバイダが良いか悪いのために、これらの特性を悪用する可能性がありますが、URI-リストはURIのような特性を利用するために偽造される可能性が高いです。"
    },
    {
      "indent": 4,
      "text": "Additionally, the lookup and reverse lookup potential of the uri-list may be attractive to traffic analysts. URI lists may also reveal confidential information, such as the location of sensitive information.",
      "ja": "また、URIリストの参照と逆引きの可能性は、トラフィックのアナリストに魅力的であるかもしれません。 URIリストはまた、機密情報の場所として、機密情報を明らかにすることができます。"
    },
    {
      "indent": 4,
      "text": "Because of these considerations, external confidentiality measures should be available to protect uri-list responses when appropriate.",
      "ja": "そのため、これらの考慮事項のため、外部の機密保持措置が適切な場合、URIリスト応答を保護するために利用可能であるべきです。"
    },
    {
      "indent": 4,
      "text": "Interoperability considerations : none known",
      "ja": "相互運用性に関する注意事項：特になし"
    },
    {
      "indent": 4,
      "text": "Published specification : Uniform Resource Locators (URLs) and Uniform Resource Names (URNs) are two instances of the more general class of identifiers known as Uniform Resource Identifiers (URIs). URN resolution methods frequently wish to return lists of URLs for a resource so that fault-tolerance and load balancing can be achieved. The text/uri-list format is intended to be a very simple format for communicating such lists of URLs (and URNs) in a form suitable for automatic processing.",
      "ja": "公開された仕様：ユニフォームリソースロケータ（URL）及び統一資源名（のURN）は、ユニフォームリソース識別子（URIの）として知られている識別子のより一般的なクラスの2つのインスタンスです。 URN解決方法は、頻繁にフォールトトレランスと負荷分散を達成することができるように、リソースのURLのリストを戻したいです。テキスト/ URIリストフォーマットは自動処理に適した形のURL（とのURN）のようなリストを通信するための非常に単純な形式であることが意図されています。"
    },
    {
      "indent": 4,
      "text": "The format of text/uri-list resources is:",
      "ja": "uriテキスト/リストのリソースの形式は次のとおりです。"
    },
    {
      "indent": 4,
      "text": "1) Any lines beginning with the '#' character are comment lines and are ignored during processing. (Note that URIs may contain the '#' character, so it is only a comment character when it is the first character on a line.)",
      "ja": "1）「＃」文字で始まる行はコメント行であり、処理中に無視されます。 （それが行の最初の文字である場合にのみコメント文字ですので、URIは「＃」文字が含まれていてもよいことに注意してください。）"
    },
    {
      "indent": 4,
      "text": "2) The remaining non-comment lines shall be URIs (URNs or URLs), encoded according to the URL or URN specifications (RFC2141, RFC1738 and RFC2396). Each URI shall appear on one and only one line. Very long URIs are not broken in the text/uri-list format. Content-transfer-encodings may be used to enforce line length limitations.",
      "ja": "2）残りの非コメント行は、URLまたはURN仕様（RFC2141、RFC1738およびRFC2396）に従って符号化されたURI（のURNまたはURL）でなければなりません。各URIは、唯一の行に表示されるものとします。非常に長いURIはuriテキスト/リスト形式で破壊されません。コンテンツ転送エンコーディングは、行の長さの制限を強制するために使用することができます。"
    },
    {
      "indent": 4,
      "text": "3) As for all text/* formats, lines are terminated with a CRLF pair.",
      "raw": true
    },
    {
      "indent": 4,
      "text": "In applications where one URI has been mapped to a list of URIs, the first line of the text/uri-list response SHOULD be a comment giving the original URI.",
      "ja": "1つのURIは、URIのリストにマッピングされているアプリケーションでは、テキストの最初の行/ URIリストの応答は、元のURIを与えるコメントであるべきです。"
    },
    {
      "indent": 4,
      "text": "An example of the format is given below:",
      "ja": "フォーマットの例を以下に示します："
    },
    {
      "indent": 6,
      "text": "# urn:isbn:0-201-08372-8 http://www.huh.org/books/foo.html http://www.huh.org/books/foo.pdf ftp://ftp.foo.org/books/foo.txt",
      "ja": "＃壺：ISBN：0-201-08372-8 http://www.huh.org/books/foo.html http://www.huh.org/books/foo.pdf ftp://ftp.foo。 ORG /書籍/ foo.txtの"
    },
    {
      "indent": 4,
      "text": "Applications which use this media : URN resolvers are the initial applications. Web clients and proxies are applications that are likely to support this format in the future.",
      "ja": "このメディアを使用するアプリケーション：URNリゾルバは、最初のアプリケーションです。 Webクライアントとプロキシは、将来的にはこの形式をサポートする可能性があるアプリケーションです。"
    },
    {
      "indent": 4,
      "text": "Additional information :",
      "ja": "追加情報 ："
    },
    {
      "indent": 4,
      "text": "1. Magic number(s) : none at this time 2. File extension(s) : .uris or .uri recommended 3. Macintosh file type code : URIs recommended",
      "ja": "1.マジックナンバー（S）：なし、この時点で2ファイルの拡張子（S）：.urisまたは.uri 3. Macintoshのファイルタイプコードをお勧めします：URIが推奨"
    },
    {
      "indent": 4,
      "text": "This media type is the product of the URN working group of the IETF.",
      "ja": "このメディアタイプは、IETFのURNワーキンググループの製品です。"
    },
    {
      "indent": 4,
      "text": "Person to contact for further information :",
      "ja": "詳細のために連絡する人："
    },
    {
      "indent": 4,
      "text": "1. Name : Ron Daniel Jr. 2. E-mail : rdaniel@lanl.gov",
      "ja": "1.名称：ロン・ダニエル・ジュニア2. Eメール：rdaniel@lanl.gov"
    },
    {
      "indent": 4,
      "text": "Intended usage : Limited Use The text/uri-list media type is intended for use in applications which utilize URIs for replicated resources.",
      "ja": "意図している用法：制限付き使用uriテキスト/リストメディアタイプが複製されたリソースのURIを利用するアプリケーションでの使用を目的としています。"
    },
    {
      "indent": 4,
      "text": "Author/Change controller : Ron Daniel Jr. Los Alamos National Laboratory rdaniel@lanl.gov",
      "ja": "著者/変更コントローラ：ロン・ダニエル・ジュニアロスアラモス国立研究所rdaniel@lanl.gov"
    },
    {
      "indent": 3,
      "text": "In applications where one URI has been mapped to a list of URIs, such as in response to the I2Ls request, the first line of the text/uri-list response SHOULD be a comment giving the original URI. An example of such a result for the I2L request is shown below in Figure 1.",
      "ja": "1つのURIは、I2Ls要求に応答として、URIのリストにマッピングされているアプリケーションでは、テキストの最初の行/ URIリスト応答は、元のURIを与えるコメントであるべきです。 I2L要求のような結果の例を図1に、以下に示されています。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Communications with a server may be of a sensitive nature. Some servers will hold information that should only be released to authorized users. The results from servers may be the target of spoofing, especially once electronic commerce transactions are common and there is money to be made by directing users to pirate repositories rather than repositories that pay royalties to rights-holders. Server requests may be of interest to traffic analysts. The requests may also be subject to spoofing.",
      "ja": "サーバーとの通信は敏感な性質のものであってもよいです。一部のサーバーは、許可されたユーザーのみに解放されるべき情報を保持します。サーバからの結果は、電子商取引が一般的であり、権利者に使用料を支払うのではなく、リポジトリリポジトリ海賊ためにユーザーを誘導することによってなされるべきお金があり、特に一度、なりすましの対象としてもよいです。 Serverリクエストは、トラフィックのアナリストを対象としています。リクエストはまた、なりすましの対象となります。"
    },
    {
      "indent": 3,
      "text": "The \"Access denied\" error message assumes a system within which the operation is being performed that can convey an authenticated concept of access control. Thus, the \"Access denied\" message should only be returned by systems that have an appropriate method of determining access control.",
      "ja": "エラーメッセージは、アクセス制御の認証された概念を伝えることができ、操作が実行されている内のシステムを想定している「アクセスが拒否されました」。したがって、メッセージは専用のアクセス制御を決定する適切な方法を有するシステムによって返されるべきで「アクセスが拒否されました」。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 3,
      "text": "[1] Berners-Lee, T., \"Universal Resource Identifiers in WWW: A Unifying Syntax for the Expression of Names and Addresses of Objects on the Network as Used in the World-Wide Web\", RFC 1630, June 1994.",
      "ja": "[1]バーナーズ=リー、T.、「WWWにおけるユニバーサルリソース識別子：名およびネットワーク上のオブジェクトのアドレスの発現のための統一構文ワールド・ワイド・ウェブで使用される」、RFC 1630、1994年6月。"
    },
    {
      "indent": 3,
      "text": "[2] Daniel, R., and Mealling, M., \"Resolution of Uniform Resource Identifiers using the Domain Name System\", RFC 2168, February 1997.",
      "ja": "、RFC 2168、1997年2月[2]ダニエル、R.、およびMealling、M.、 \"ドメインネームシステムを使用して、統一資源識別子の解決\"。"
    },
    {
      "indent": 3,
      "text": "[3] Moats, R., \"URN Syntax\", RFC 2141, January 1997.",
      "ja": "[3]堀、R.、 \"URN構文\"、RFC 2141、1997年1月。"
    },
    {
      "indent": 3,
      "text": "[4] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "ja": "[4]フリード、N.とN. Borenstein、 \"マルチパーパスインターネットメールエクステンション（MIME）第一部：インターネットメッセージ本体のフォーマット\"、RFC 2045、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[5] Sollins, K., \"Architectural Principles of Uniform Resource Name Resolution\", RFC 2276, January 1998.",
      "ja": "[5] Sollins、K.、 \"ユニフォームリソース名前解決の建築原則\"、RFC 2276、1998年1月。"
    },
    {
      "indent": 3,
      "text": "[6] Kunze, J., \"Functional Recommendations for Internet Resource Locators\", RFC 1736, February 1995.",
      "ja": "[6]クンツェ、J.、 \"インターネットリソースロケータのための機能の提言\"、RFC 1736、1995年2月。"
    },
    {
      "indent": 3,
      "text": "[7] Berners-Lee, T., Masinter, L. and M. McCahill, \"Uniform Resource Locators (URL)\", RFC 1738, December 1994.",
      "ja": "[7]バーナーズ=リー、T.、Masinter、LとM. McCahill、 \"ユニフォームリソースロケータ（URL）\"、RFC 1738、1994年12月。"
    },
    {
      "indent": 0,
      "text": "8. Authors' Addresses",
      "section_title": true,
      "ja": "8.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Michael Mealling Network Solutions 505 Huntmar Park Drive Herndon, VA 22070",
      "ja": "マイケル・メオーリングネットワークソリューション505 Huntmarパークドライブハーンドン、VA 22070"
    },
    {
      "indent": 3,
      "text": "Phone: (703) 742-0400 Fax: (703) 742-9552 EMail: michaelm@rwhois.net",
      "ja": "電話：（703）742-0400ファックス：（703）742-9552 Eメール：michaelm@rwhois.net"
    },
    {
      "indent": 3,
      "text": "Ron Daniel Advanced Computing Lab, MS B287 Los Alamos National Laboratory Los Alamos, NM, USA, 87545",
      "ja": "ロン・ダニエル高度なコンピューティング・ラボ、MS B287ロスアラモス国立研究所ロスアラモス、NM、USA、87545"
    },
    {
      "indent": 3,
      "text": "Phone: (505) 665-0597 Fax: (505) 665-4939 EMail: rdaniel@lanl.gov",
      "ja": "電話：（505）665-0597ファックス：（505）665-4939 Eメール：rdaniel@lanl.gov"
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "ja": "9.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}