{
  "title": {
    "text": "RFC 2424 - Content Duration MIME Header Definition",
    "ja": "RFC 2424 - コンテンツ期間MIMEヘッダー定義"
  },
  "number": 2424,
  "created_at": "2020-08-16 16:50:36.765582+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         G. Vaudreuil\nRequest for Comments: 2424                             Lucent Technologies\nCategory: Standards Track                                       G. Parsons\n                                                          Northern Telecom\n                                                            September 1998",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 25,
      "text": " Content Duration MIME Header Definition",
      "ja": "コンテンツ期間MIMEヘッダー定義"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Overview",
      "ja": "概観"
    },
    {
      "indent": 3,
      "text": "This document describes the MIME header Content-Duration that is\nintended for use with any timed media content (typically audio/* or\nvideo/*).",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Abstract",
      "section_title": true,
      "ja": "1. 概要"
    },
    {
      "indent": 3,
      "text": "This document describes the MIME header Content-Duration that is\nintended for use with any time varying media content (typically\naudio/* or video/*).  The length of time is represented in seconds\nwithout any units indication.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "2. Content-Duration Header Field",
      "section_title": true,
      "ja": "2. Content-Durationヘッダーフィールド"
    },
    {
      "indent": 3,
      "text": "Time varying media contents, for example, a spoken voice message or a video clip, have an inherent time duration. Many audio and video encodings may include their duration as header information or may allow accurate calculation based on the byte length of the data. However, it may be useful to present the time duration of the content in a MIME header to allow its simple determination without dealing with the actual content.",
      "ja": "時々刻々と変化するメディアコンテンツ、たとえば、音声メッセージやビデオクリップには、固有の継続時間があります。多くのオーディオおよびビデオのエンコーディングでは、ヘッダー情報としてデュレーションが含まれる場合や、データのバイト長に基づいて正確に計算できる場合があります。ただし、実際のコンテンツを処理せずに簡単に判断できるように、コンテンツの期間をMIMEヘッダーで提示すると便利な場合があります。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [REQ].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 [REQ]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2.1 Syntax",
      "section_title": true,
      "ja": "2.1 構文"
    },
    {
      "indent": 3,
      "text": "The Content-Duration field's value is a single number specifying the time duration in seconds of the content. Formally:",
      "ja": "Content-Durationフィールドの値は、コンテンツの継続時間を秒単位で指定する単一の数値です。正式に："
    },
    {
      "indent": 3,
      "text": "duration := \"Content-Duration\" \":\" 1*10DIGIT",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Note that practically (though highly unlikely in MIME media), the upper bound on the numerical value of the time duration is (2^^31 - 1) or 2147483647.",
      "ja": "実際には（MIMEメディアではほとんどありませんが）、期間の数値の上限は（2 ^^ 31-1）または2147483647であることに注意してください。"
    },
    {
      "indent": 0,
      "text": "2.2 Semantics",
      "section_title": true,
      "ja": "2.2 意味論"
    },
    {
      "indent": 3,
      "text": "This field represents the time duration of the associated time varying media content. The time duration is noted in seconds with no units tag. The time value should be exact, however the exact value of the time duration cannot be known without opening the content and playing it. If an exact value must be known, then the latter method should be used. This mechanism simply allows placing a sender determined time duration value in the header for easy access.",
      "ja": "このフィールドは、関連する時変メディアコンテンツの期間を表します。継続時間は、単位タグのない秒単位で示されます。時間の値は正確でなければなりませんが、コンテンツを開いて再生しないと、時間の正確な値を知ることはできません。正確な値を知る必要がある場合は、後者の方法を使用する必要があります。このメカニズムでは、簡単にアクセスできるように、送信者が決定した期間の値をヘッダーに配置できます。"
    },
    {
      "indent": 3,
      "text": "Though there are several ways to present this duration to the recipient (e.g. with the inbox headers, when audio attachment opened), the actual use of this field on reception is a local implementation issue.",
      "ja": "この期間を受信者に提示する方法はいくつかありますが（たとえば、オーディオの添付ファイルを開いたときに受信トレイのヘッダーを使用する）、受信時にこのフィールドを実際に使用することはローカル実装の問題です。"
    },
    {
      "indent": 0,
      "text": "2.3 Example",
      "section_title": true,
      "ja": "2.3 例"
    },
    {
      "indent": 3,
      "text": "In this example the content duration represents 33 seconds:",
      "ja": "この例では、コンテンツの継続時間は33秒を表しています。"
    },
    {
      "indent": 7,
      "text": "Content-Duration: 33",
      "ja": "コンテンツ期間：33"
    },
    {
      "indent": 0,
      "text": "3. VPIM Usage",
      "section_title": true,
      "ja": "3. VPIMの使用"
    },
    {
      "indent": 3,
      "text": "The Content-Duration header field for the audio/32KADPCM sub-type is a useful component of the VPIM specification [VPIM2]. All VPIM Messages MUST contain this sub-type to carry the audio of a voice message. It may be useful in some instances (e.g. viewing on a simple MIME or non-MIME desktop) to have the time duration of the voice message available without having to open the audio content.",
      "ja": "audio / 32KADPCMサブタイプのContent-Durationヘッダーフィールドは、VPIM仕様[VPIM2]の有用なコンポーネントです。すべてのVPIMメッセージには、音声メッセージの音声を伝送するためにこのサブタイプが含まれている必要があります。音声コンテンツを開かなくても音声メッセージの継続時間を利用できると便利な場合があります（例：単純なMIMEまたは非MIMEデスクトップで表示）。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This definition introduces the option of explicitly identifying the\ntime duration of an audio/* or video/* content outside of the binary\ndata that forms the content.  In some environments (though likely not\nthe majority), the identification of the actual time duration in a\nheader field may be a security issue and as a result should not be\nnoted.  Reliance on the time indicated in this header field cannot be\ntrusted for the purposes of determining the exact size of the data.\nThe exact length of the data must be determined by examining the data\nitself.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5. Authors' Addresses",
      "section_title": true,
      "ja": "5. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Glenn W. Parsons Northern Telecom P.O. Box 3511, Station C Ottawa, ON K1Y 4H7 Canada",
      "ja": "グレンW.パーソンズノーザンテレコムP.O. Box 3511、ステーションCオタワ、オンK1Y 4H7カナダ"
    },
    {
      "indent": 3,
      "text": "Phone: +1-613-763-7582\nFax: +1-613-763-4461\nEMail: Glenn.Parsons@Nortel.ca",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Gregory M. Vaudreuil Lucent Technologies 17080 Dallas Parkway Dallas, TX 75248-1905 United States",
      "ja": "Gregory M. Vaudreuil Lucent Technologies 17080ダラスパークウェイダラス、テキサス州75248-1905アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Phone/Fax: +1-972-733-2722\nEMail: GregV@Lucent.Com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 3,
      "text": "[MIME2] Freed, N., and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part Two: Media Types\", RFC 2046, November 1996.",
      "ja": "[MIME2] Freed、N。、およびN. Borenstein、「Multipurpose Internet Mail Extensions（MIME）Part Two：Media Types」、RFC 2046、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[VPIM2] Vaudreuil, G., and G. Parsons, \"Voice Profile for Internet Mail - version 2\", RFC 2421, September 1998.",
      "ja": "[VPIM2] Vaudreuil、G。、およびG. Parsons、「Voice Profile for Internet Mail-version 2」、RFC 2421、1998年9月。"
    },
    {
      "indent": 3,
      "text": "[REQ] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[REQ] Bradner、S.、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "ja": "7. 完全な著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントとその翻訳はコピーして他のユーザーに提供することができ、コメントまたはその他の方法で説明したり、その実装を支援する二次的著作物は、いかなる種類の制限なしに、全体または一部を準備、コピー、公開、および配布することができますただし、上記の著作権表示とこの段落は、そのようなすべてのコピーと派生物に含まれています。ただし、このドキュメント自体は、著作権に関する通知を削除したり、インターネットソサエティや他のインターネット組織への参照を削除したりするなど、いかなる方法でも変更できません。ただし、インターネット標準を開発する目的で必要な場合は除きます。インターネット標準のプロセスに従うか、または必要に応じて、それを英語以外の言語に翻訳する必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記で付与された制限付きのアクセス許可は永続的であり、インターネットソサエティまたはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は「現状有姿」で提供され、インターネット社会およびインターネット技術タスクフォースは、明示または黙示を問わず、ここに記載されている情報の使用が保証するものに限定されないいかなる保証も含め、一切の保証を否認します。商品性または特定の目的への適合性に関する権利または黙示の保証を侵害すること。"
    }
  ]
}