{
  "title": {
    "text": "RFC 2350 - Expectations for Computer Security Incident Response",
    "ja": "RFC 2350 - コンピュータセキュリティインシデント対応への期待"
  },
  "number": 2350,
  "created_at": "2019-10-23 13:01:55.779501+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       N. Brownlee\nRequest for Comments: 2350                   The University of Auckland\nBCP: 21                                                      E. Guttman\nCategory: Best Current Practice                        Sun Microsystems\n                                                              June 1998",
      "raw": true
    },
    {
      "indent": 10,
      "text": "Expectations for Computer Security Incident Response",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントはインターネットコミュニティのためのインターネットBest Current Practicesを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The purpose of this document is to express the general Internet community's expectations of Computer Security Incident Response Teams (CSIRTs). It is not possible to define a set of requirements that would be appropriate for all teams, but it is possible and helpful to list and describe the general set of topics and issues which are of concern and interest to constituent communities.",
      "ja": "このドキュメントの目的は、コンピュータセキュリティインシデント対応チーム（のCSIRT）の一般的なインターネットコミュニティの期待を表明することにあります。すべてのチームのために適切であろう一連の要件を定義することはできませんが、構成地域社会への関心と興味のあるトピックや問題の一般的なセットをリストし、記述することが可能と便利です。"
    },
    {
      "indent": 3,
      "text": "CSIRT constituents have a legitimate need and right to fully understand the policies and procedures of 'their' Computer Security Incident Response Team. One way to support this understanding is to supply detailed information which users may consider, in the form of a formal template completed by the CSIRT. An outline of such a template and a filled in example are provided.",
      "ja": "CSIRTの成分は完全に「彼らの」コンピュータセキュリティインシデント対応チームのポリシーと手続きを理解する正当な必要性と権利を持っています。この理解をサポートするための一つの方法は、CSIRTによって完成し、正式なテンプレートの形で、ユーザーが考えることができる詳細な情報を提供することです。そのようなテンプレートの概要および例に充填されています。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1 Introduction ....................................................2\n2 Scope............................................................4\n  2.1 Publishing CSIRT Policies and Procedures ....................4\n  2.2 Relationships between different CSIRTs ......................5\n  2.3 Establishing Secure Communications ..........................6\n3 Information, Policies and Procedures.............................7\n  3.1 Obtaining the Document.......................................8\n  3.2 Contact Information .........................................9\n  3.3 Charter ....................................................10\n      3.3.1 Mission Statement.....................................10\n      3.3.2 Constituency..........................................10",
      "raw": true
    },
    {
      "indent": 3,
      "text": "      3.3.3 Sponsoring Organization / Affiliation.................11\n      3.3.4 Authority.............................................11\n  3.4 Policies ...................................................11\n      3.4.1 Types of Incidents and Level of Support...............11\n      3.4.2 Co-operation, Interaction and Disclosure of\n            Information...........................................12\n      3.4.3 Communication and Authentication......................14\n  3.5 Services ...................................................15\n      3.5.1 Incident Response ....................................15\n            3.5.1.1 Incident Triage ..............................15\n            3.5.1.2 Incident Coordination ........................15\n            3.5.1.3 Incident Resolution...........................16\n      3.5.2 Proactive Activities .................................16\n  3.6 Incident Reporting Forms ...................................16\n  3.7 Disclaimers ................................................17\nAppendix A: Glossary of Terms ....................................18\nAppendix B: Related Material .....................................20\nAppendix C: Known Computer Security Incident Response Teams ......21\nAppendix D: Outline for CSIRT Template ...........................22\nAppendix E: Example - 'filled-in' Template for a CSIRT ...........23\n4 Acknowlegements ................................................36\n5 References .....................................................36\n6 Security Considerations ........................................36\n7 Authors' Addresses .............................................37\n8 Full Copyright Statement .......................................38",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1 Introduction",
      "ja": "1はじめに"
    },
    {
      "indent": 3,
      "text": "The GRIP Working Group was formed to create a document that describes the community's expectations of computer security incident response teams (CSIRTs). Although the need for such a document originated in the general Internet community, the expectations expressed should also closely match those of more restricted communities.",
      "ja": "GRIPワーキンググループは、コンピュータセキュリティインシデント対応チーム（のCSIRT）のコミュニティの期待を記述した文書を作成するために設立されました。そのような文書の必要性は、一般的なインターネットコミュニティで始まったものの、表現の期待も密接に、より制限されたコミュニティのものと一致する必要があります。"
    },
    {
      "indent": 3,
      "text": "In the past there have been misunderstandings regarding what to expect from CSIRTs. The goal of this document is to provide a framework for presenting the important subjects (related to incident response) that are of concern to the community.",
      "ja": "過去においてのCSIRTから期待するのかについての誤解がありました。このドキュメントの目標は、コミュニティへの懸念である（インシデント対応に関連した）重要な課題を提示するためのフレームワークを提供することです。"
    },
    {
      "indent": 3,
      "text": "Before continuing, it is important to clearly understand what is meant by the term \"Computer Security Incident Response Team.\" For the purposes of this document, a CSIRT is a team that performs, coordinates, and supports the response to security incidents that involve sites within a defined constituency (see Appendix A for a more complete definition). Any group calling itself a CSIRT for a specific constituency must therefore react to reported security incidents, and to threats to \"their\" constituency in ways which the specific community agrees to be in its general interest.",
      "ja": "先に進む前に、明らか用語が何を意味するのか理解することが重要である「コンピュータセキュリティインシデント対応チーム。」このドキュメントの目的のために、CSIRTは、実行座標チームである、と定義された選挙区内のサイトのセキュリティ問題（より完全な定義については、付録Aを参照）への応答をサポートしています。それ自体が特定の選挙のためのCSIRTを呼び出す任意のグループは、したがって、報告されたセキュリティインシデントへの、および特定のコミュニティは、その一般的な関心であることを同意する方法で、「彼らの」選挙への脅威に対処しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Since it is vital that each member of a constituent community be able to understand what is reasonable to expect of their team, a CSIRT should make it clear who belongs to their constituency and define the services the team offers to the community. Additionally, each CSIRT should publish its policies and operating procedures. Similarly, these same constituents need to know what is expected of them in order for them to receive the services of their team. This requires that the team also publish how and where to report incidents.",
      "ja": "それは、構成コミュニティの各メンバーが自分のチームに期待するのが妥当であるかを理解することができることが不可欠ですので、CSIRTは、自分の選挙区に属している人、それを明確にし、チームがコミュニティに提供するサービスを定義する必要があります。また、各CSIRTは、その方針や業務手順を公開しなければなりません。同様に、これらの同じ構成要素には、彼らのチームのサービスを受信するためにそれらを期待されているかを知る必要があります。これは、チームはまた、どこでどのように事件を報告するために発行することが必要です。"
    },
    {
      "indent": 3,
      "text": "This document details a template which will be used by CSIRTs to communicate this information to their constituents. The constituents should certainly expect a CSIRT to provide the services they describe in the completed template.",
      "ja": "この文書では、有権者にこの情報を通信するためのCSIRTで使用されるテンプレートの詳細を示します。成分は確かにCSIRTは、彼らが完成したテンプレートに記述したサービスを提供することを期待すべきです。"
    },
    {
      "indent": 3,
      "text": "It must be emphasized that without active participation from users, the effectiveness of the CSIRT's services can be greatly diminished. This is particularly the case with reporting. At a minimum, users need to know that they should report security incidents, and know how and to where they should report them.",
      "ja": "ユーザーからの積極的な参加せずに、CSIRTのサービスの有効性が大幅に減少することができることを強調しておかなければなりません。これは特に報告の場合です。最低でも、ユーザーは、セキュリティインシデントを報告しなければならないことを知って、そしてどのように、彼らはそれらを報告する必要がありますどこに知っておく必要があります。"
    },
    {
      "indent": 3,
      "text": "Many computer security incidents originate outside local community boundaries and affect inside sites, others originate inside the local community and affect hosts or users on the outside. Often, therefore, the handling of security incidents will involve multiple sites and potentially multiple CSIRTs. Resolving these incidents will require cooperation between individual sites and CSIRTs, and between CSIRTs.",
      "ja": "多くのコンピュータセキュリティインシデントは、地域社会の境界の外に発信され、内部のサイトに影響を与え、他の人が地域社会の内部で発生し、外部のホストやユーザーに影響を与えます。多くの場合、そのため、セキュリティインシデントの取り扱いは、複数のサイトや潜在的に複数のCSIRTを伴います。これらの事件の解決は、個々のサイトとのCSIRT間、とのCSIRT間の協力が必要になります。"
    },
    {
      "indent": 3,
      "text": "Constituent communities need to know exactly how their CSIRT will be working with other CSIRTs and organizations outside their constituency, and what information will be shared.",
      "ja": "制憲コミュニティは彼らのCSIRTが自分の選挙区外の他のCSIRTや組織と協力することになり、どのような情報が共有されます正確にどのように知っておく必要があります。"
    },
    {
      "indent": 3,
      "text": "The rest of this document describes the set of topics and issues that CSIRTs need to elaborate for their constituents. However, there is no attempt to specify the \"correct\" answer to any one topic area. Rather, each topic is discussed in terms of what that topic means.",
      "ja": "このドキュメントの残りはのCSIRTは、有権者のために詳しく説明する必要があるトピックや問題のセットを記述します。しかし、いずれかのトピック領域への「正しい」答えを指定する試みはありません。むしろ、各トピックは、そのトピックが何を意味するのかという観点で議論されています。"
    },
    {
      "indent": 3,
      "text": "Chapter two provides an overview of three major areas: the publishing of information by a response team, the definition of the response team's relationship to other response teams, and the need for secure communications. Chapter three describes in detail all the types of information that the community needs to know about their response team.",
      "ja": "対応チームによる情報の掲載、他の対応チームへの対応チームの関係の定義、および安全な通信のための必要性：第二章は、三つの主要分野の概要を説明します。第3章で詳細にコミュニティがその対応チームについて知るために必要な情報のすべての種類について説明します。"
    },
    {
      "indent": 3,
      "text": "For ease of use by the community, these topics are condensed into an outline template found in Appendix D. This template can be used by constituents to elicit information from their CSIRT.",
      "ja": "コミュニティでの使用を容易にするため、これらのトピックは、このテンプレートは、彼らのCSIRTから情報を引き出すための構成要素で使用することができ付録D.で見つかったアウトラインテンプレートに凝縮されています。"
    },
    {
      "indent": 3,
      "text": "It is the working group's sincere hope that through clarification of the topics in this document, understanding between the community and its CSIRTs will be increased.",
      "ja": "このドキュメントのトピックの明確化を通じて、地域社会とそののCSIRT間の理解が増加されることをワーキンググループの誠実な希望です。"
    },
    {
      "indent": 0,
      "text": "2 Scope",
      "ja": "2適用範囲"
    },
    {
      "indent": 3,
      "text": "The interactions between an incident response team and its constituent community response team require first that the community understand the policies and procedures of the response team. Second, since many response teams collaborate to handle incidents, the community must also understand the relationship between their response team and other teams. Finally, many interactions will take advantage of existing public infrastructures, so the community needs to know how those communications will be protected. Each of these subjects will be described in more detail in the following three sections.",
      "ja": "インシデント対応チームとそれを構成するコミュニティ対応チーム間の相互作用は、コミュニティが対応チームのポリシーと手続きを理解することがまず必要です。多くの対応チームは、事件を処理するために協力するため、第二に、地域社会にもその対応チームと他のチームとの間の関係を理解する必要があります。コミュニティは、これらの通信を保護する方法を知っている必要があるので、最後に、多くの相互作用は、既存の公共インフラを活用します。これらの被験者のそれぞれは、次の3つのセクションで詳しく説明します。"
    },
    {
      "indent": 0,
      "text": "2.1 Publishing CSIRT Policies and Procedures",
      "section_title": true,
      "ja": "2.1出版CSIRTポリシーと手続き"
    },
    {
      "indent": 3,
      "text": "Each user who has access to a Computer Security Incident Response Team should know as much as possible about the services of and interactions with this team long before he or she actually needs them.",
      "ja": "コンピュータセキュリティインシデントレスポンスチームへのアクセス権を持つ各ユーザーは、彼または彼女が実際にそれらを必要とするずっと前に、このチームでのサービスとの相互作用についてできるだけ多くを知っている必要があります。"
    },
    {
      "indent": 3,
      "text": "A clear statement of the policies and procedures of a CSIRT helps the constituent understand how best to report incidents and what support to expect afterwards. Will the CSIRT assist in resolving the incident? Will it provide help in avoiding incidents in the future? Clear expectations, particularly of the limitations of the services provided by a CSIRT, will make interaction with it more efficient and effective.",
      "ja": "CSIRTのポリシーや手順の明確な声明は、構成がインシデントを報告するとどのような支援後で期待する最善の方法を理解するのに役立ちます。 CSIRTは、事件を解決するのに役立つでしょうか？それは将来的にインシデントを回避する上で助けを提供しますか？特にCSIRTが提供するサービスの制限の明確な期待は、それとの相互作用は、より効率的かつ効果的になります。"
    },
    {
      "indent": 3,
      "text": "There are different kinds of response teams: some have very broad constituencies (e.g., CERT Coordination Center and the Internet), others have more bounded constituencies (e.g., DFN-CERT, CIAC), and still others have very restricted constituencies (e.g., commercial response teams, corporate response teams). Regardless of the type of response team, the constituency supported by it must be knowledgeable about the team's policies and procedures. Therefore, it is mandatory that response teams publish such information to their constituency.",
      "ja": "対応チームのさまざまな種類があります：いくつかは非常に広い選挙（例えば、CERT Coordination Centerは、インターネットが）、他の人がより制限されている選挙を持っている（例えば、DFN-CERT、CIAC）、そしてまだ他の人が非常に制限されている選挙（例えば、商用対応チーム、企業の対応チーム）。かかわらず、対応チームのタイプの、それによってサポートされる選挙はチームの方針や手続きについての知識がなければなりません。したがって、対応チームは、彼らの選挙区に、このような情報を公開することを義務付けられています。"
    },
    {
      "indent": 3,
      "text": "A CSIRT should communicate all necessary information about its policies and services in a form suitable to the needs of its constituency. It is important to understand that not all policies and procedures need be publicly available. For example, it is not necessary to understand the internal operation of a team in order to interact with it, as when reporting an incident or receiving guidance on how to analyze or secure one's systems.",
      "ja": "CSIRTは、その構成のニーズに適した形での政策やサービスに関するすべての必要な情報を伝える必要があります。ないすべてのポリシーや手順が公開さ必要があることを理解することが重要です。例えば、事件を報告したり分析したり、自分のシステムを保護する方法についてのガイダンスを受けたときのように、それと対話するために、チームの内部動作を理解する必要はありません。"
    },
    {
      "indent": 3,
      "text": "In the past, some teams supplied a kind of Operational Framework, others provided a Frequently Asked Questions list (FAQ), while still others wrote papers for distribution at user conferences or sent newsletters.",
      "ja": "過去には、いくつかのチームはまだ他の人がユーザー会議または送信ニュースレターの配信のための論文を書いている間他の人は、よく寄せられる質問リスト（FAQ）を提供し、運用フレームワークの種類を供給しました。"
    },
    {
      "indent": 3,
      "text": "We recommend that each CSIRT publish its guidelines and procedures on its own information server (e.g. a World Wide Web server). This would allow constituents to easily access it, though the problem remains of how a constituent can find his or her team; people within the constituency have to discover that there is a CSIRT \"at their disposal.\"",
      "ja": "私たちは、各CSIRTは、自身の情報サーバ（例えば、ワールド・ワイド・ウェブ・サーバ）上のガイドラインと手順を公開することをお勧めします。この問題は、構成が自分のチームを見つけることができる方法のままものの、成分は簡単にアクセスできるようになります。選挙中の人は、CSIRTがあることを発見しなければならない「彼らの処分では。」"
    },
    {
      "indent": 3,
      "text": "It is foreseen that completed CSIRT templates will soon become searchable by modern search engines, which will aid in distributing information about the existence of CSIRTs and basic information required to approach them.",
      "ja": "完成しCSIRTテンプレートはすぐにそれらにアプローチするために必要なのCSIRTの存在と基本的な情報に関する情報の配信に役立つ最新の検索エンジンによる検索可能となることが予想されます。"
    },
    {
      "indent": 3,
      "text": "It would be very useful to have a central repository containing all the completed CSIRT templates. No such repository exists at the time of writing, though this might change in the future.",
      "ja": "すべての完成CSIRTテンプレートを含む中央リポジトリを持っていることは非常に有用であろう。そのようなリポジトリが、これは将来変更されるかもしれませんが、執筆時点では存在しません。"
    },
    {
      "indent": 3,
      "text": "Regardless of the source from which the information is retrieved, the user of the template must check its authenticity. It is highly recommended that such vital documents be protected by digital signatures. These will allow the user to verify that the template was indeed published by the CSIRT and that it has not been tampered with. This document assumes the reader is familiar with the proper use of digital signatures to determine whether a document is authentic.",
      "ja": "かかわらず、情報が取得された元のテンプレートのユーザは、その信憑性を確認しなければなりません。非常に、このような重要な文書がデジタル署名によって保護されることが推奨されます。これらは、ユーザーがテンプレートが実際にCSIRTによって公表されたことと、それが改ざんされていないことを確認することができます。この文書は、読者が文書が本物であるかどうかを決定するために、デジタル署名の適切な使用に精通している前提としています。"
    },
    {
      "indent": 0,
      "text": "2.2 Relationships between different CSIRTs",
      "section_title": true,
      "ja": "異なるのCSIRT間の2.2の関係"
    },
    {
      "indent": 3,
      "text": "In some cases a CSIRT may be able to operate effectively on its own and in close cooperation with its constituency. But with today's international networks it is much more likely that most of the incidents handled by a CSIRT will involve parties external to its constituency. Therefore the team will need to interact with other CSIRTs and sites outside its constituency.",
      "ja": "いくつかのケースではCSIRTは、自分自身で、その選挙区との緊密な協力の下で効果的に動作することができるかもしれません。しかし、今日の国際的なネットワークでそれはCSIRTが取り扱う事件のほとんどはその選挙に外部の関係者が参加することをはるかに可能性があります。そのためチームは、他のCSIRTとその構成外側の部位と相互作用する必要があります。"
    },
    {
      "indent": 3,
      "text": "The constituent community should understand the nature and extent of this collaboration, as very sensitive information about individual constituents may be disclosed in the process.",
      "ja": "個々の成分について非常に機密性の高い情報がプロセスに開示されるよう構成コミュニティは、このコラボレーションの性質と範囲を理解する必要があります。"
    },
    {
      "indent": 3,
      "text": "Inter-CSIRT interactions could include asking other teams for advice, disseminating knowledge of problems, and working cooperatively to resolve a security incident affecting one or more of the CSIRTs' constituencies.",
      "ja": "インターCSIRT間の相互作用は、助言のための他のチームを尋ねる問題についての知識を普及し、のCSIRT選挙の一つ以上に影響を与えるセキュリティインシデントの解決に協力し取り組ん含めることができます。"
    },
    {
      "indent": 3,
      "text": "In establishing relationships to support such interactions, CSIRTs must decide what kinds of agreements can exist between them so as to share yet safeguard information, whether this relationship can be disclosed, and if so to whom.",
      "ja": "このような相互作用をサポートするために、関係を確立するには、のCSIRTは、まだそれほど誰にこの関係が開示されることができるかどうか、情報を保護し、あれば共有するように、それらの間に存在することができる契約の種類を決定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Note that there is a difference between a peering agreement, where the CSIRTs involved agree to work together and share information, and simple co-operation, where a CSIRT (or any other organization) simply contacts another CSIRT and asks for help or advice.",
      "ja": "CSIRT（または他の組織）単に連絡先別のCSIRTとは、ヘルプやアドバイスを要求関与のCSIRTが連携し、情報を共有することに同意ピアリング契約、および簡単な協力、違いがあることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Although the establishment of such relationships is very important and affects the ability of a CSIRT to support its constituency, it is up to the teams involved to decide about the details. It is beyond the scope of this document to make recommendations for this process. However, the same set of information used to set expectations for a user community regarding sharing of information will help other parties to understand the objectives and services of a specific CSIRT, supporting a first contact.",
      "ja": "そのような関係の確立は非常に重要であり、その構成をサポートするためのCSIRTの能力に影響を与えるが、それは詳細を決定するために関与チーム次第です。これは、このプロセスのための提言を行うために、このドキュメントの範囲を超えています。しかし、情報の同じセットは、他の当事者が第一のコンタクトをサポートする、特定のCSIRTの目的やサービスを理解するのに役立つ情報の共有に関するユーザコミュニティの期待を設定するために使用されます。"
    },
    {
      "indent": 0,
      "text": "2.3 Establishing Secure Communications",
      "section_title": true,
      "ja": "2.3セキュアな通信を確立します"
    },
    {
      "indent": 3,
      "text": "Once one party has decided to share information with another party, or two parties have agreed to share information or work together - as required for the coordination of computer security incident response - all parties involved need secure communications channels. (In this context, \"secure\" refers to the protected transmission of information shared between different parties, and not to the appropriate use of the information by the parties.)",
      "ja": "通信チャネルを確保する必要が関与するすべての当事者を - コンピュータセキュリティインシデント対応の調整のために必要とされる - 一方の当事者が他の当事者と情報を共有することを決定した後、または両当事者が情報を共有したり、一緒に作業することに合意しました。 （この文脈では、「安全な」異なる当事者間で共有される情報の保護された伝送にはなく、当事者による情報の適切な使用を意味します。）"
    },
    {
      "indent": 3,
      "text": "The goals of secure communication are:",
      "ja": "安全な通信の目的は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "- Confidentiality: Can somebody else access the content of the communication?",
      "ja": " - 機密性：他の誰かが、通信のコンテンツにアクセスすることはできますか？"
    },
    {
      "indent": 6,
      "text": "- Integrity: Can somebody else manipulate the content of the communication?",
      "ja": " - 完全性：他の誰かが通信の内容を操作することはできますか？"
    },
    {
      "indent": 6,
      "text": "- Authenticity: Am I communicating with the \"right\" person?",
      "ja": " - 真正：私は「右」の人と通信していますか？"
    },
    {
      "indent": 3,
      "text": "It is very easy to send forged e-mail, and not hard to establish a (false) identity by telephone. Cryptographic techniques, for example Pretty Good Privacy (PGP) or Privacy Enhanced Mail (PEM) can provide effective ways of securing e-mail. With the correct equipment it is also possible to secure telephone communication. But before using such mechanisms, both parties need the \"right\" infrastructure, which is to say preparation in advance. The most important preparation is ensuring the authenticity of the cryptographic keys used in secure communication:",
      "ja": "電話で（false）のアイデンティティを確立することは難しいことではないフォージド電子メールを送信することは非常に容易である、と。たとえば、PGP（Pretty Good Privacy）またはプライバシー強化メール（PEM）のための暗号化技術は、電子メールを確保する効果的な方法を提供することができます。正しい機器を使えば、電話通信を確保することも可能です。しかし、そのようなメカニズムを使用する前に、両当事者は、事前に準備を言うことである「権利」のインフラを、必要とします。最も重要な準備は、セキュアな通信に使用される暗号鍵の信憑性を保証することです。"
    },
    {
      "indent": 3,
      "text": "- Public keys (for techniques like PGP and PEM): Because they are accessible through the Internet, public keys must be authenticated before use. While PGP relies on a \"Web of Trust\" (where users sign the keys of other users), PEM relies on a hierarchy (where certification authorities sign the keys of users).",
      "ja": " - （PGPやPEMのような技術のための）公開鍵：彼らは、インターネットを介してアクセス可能であるため、公開鍵を使用する前に認証を受ける必要があります。 PGPは、「信頼のウェブ」（ここで、ユーザが他のユーザの鍵に署名）に依存していますが、PEMは（認証局は、利用者の鍵に署名）階層に依存しています。"
    },
    {
      "indent": 3,
      "text": "- Secret keys (for techniques like DES and PGP/conventional encryption): Because these must be known to both sender and receiver, secret keys must be exchanged before the communication via a secure channel.",
      "ja": " - （DESとPGP /従来の暗号化などの技術のための）秘密キー：これらは、送信者と受信者の両方に知られなければならないので、秘密鍵は、安全なチャネルを介して通信する前に交換しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Communication is critical to all aspects of incident response. A team can best support the use of the above-mentioned techniques by gathering all relevant information, in a consistent way. Specific requirements (such as calling a specific number to check the authenticity of keys) should be clear from the start. CSIRT templates provide a standardized vehicle for delivering this information.",
      "ja": "通信は、インシデント対応のあらゆる側面に重要です。チームは最高の一貫性のある方法で、すべての関連情報を収集することによって、上記の技術の使用をサポートすることができます。 （例えば、キーの信憑性を確認するために、特定の番号を呼び出すように）具体的な要件が最初から明確にする必要があります。 CSIRTテンプレートは、この情報を配信するための標準化された車両を提供しています。"
    },
    {
      "indent": 3,
      "text": "It is beyond the scope of this document to address the technical and administrative problems of secure communications. The point is that response teams must support and use a method to secure the communications between themselves and their constituents (or other response teams). Whatever the mechanism is, the level of protection it provides must be acceptable to the constituent community.",
      "ja": "これは、安全な通信の技術的および管理上の問題に対処するために、このドキュメントの範囲を超えています。点は、対応チームは、それ自体とその成分（または他の対応チーム）との間の通信を保護するためのメソッドをサポートし、使用しなければならないということです。メカニズムが何であれ、それが提供する保護のレベルは、構成コミュニティに許容できるものでなければなりません。"
    },
    {
      "indent": 0,
      "text": "3 Information, Policies and Procedures",
      "ja": "3情報、方針および手続き"
    },
    {
      "indent": 3,
      "text": "In chapter 2 it was mentioned that the policies and procedures of a response team need to be published to their constituent community. In this chapter we will list all the types of information that the community needs to receive from its response team. How this information is communicated to a community will differ from team to team, as will the specific information content. The intent here is to clearly describe the various kinds of information that a constituent community expects from its response team.",
      "ja": "第2章では、それは、対応チームのポリシーと手続きがその構成コミュニティに公開する必要があると述べました。この章では、コミュニティがその対応チームから受け取るために必要な情報のすべての種類の一覧を表示します。この情報は、コミュニティに伝達されるどのように具体的な情報内容は意志として、チーム、チームとは異なります。ここでの意図は明確に構成コミュニティがその対応チームから期待する各種の情報を記述することです。"
    },
    {
      "indent": 3,
      "text": "To make it easier to understand the issues and topics relevant to the interaction of constituents with \"their\" CSIRT, we suggest that a CSIRT publish all information, policies, and procedures addressing its constituency as a document, following the template given in Appendix D. The template structure arranges items, making it easy to supply specific information; in Appendix E we provide an example of a filled-out template for the fictitious XYZ University. While no recommendations are made as to what a CSIRT should adopt for its policy or procedures, different possibilities are outlined to give some examples. The most important thing is that a CSIRT have a policy and that those who interact with the CSIRT be able to obtain and understand it.",
      "ja": "それが簡単に「彼らの」CSIRTとの構成要素の相互作用に関連する問題やトピックを理解するために行うために、我々は、CSIRTは、付録Dに与えられたテンプレート以下、文書としてその構成を扱うすべての情報、ポリシー、および手順を公開することを示唆していますテンプレート構造は、それが簡単に特定の情報を提供すること、アイテムを配置します。付録Eに、私たちは架空のXYZ大学のための記入済みのテンプレートの例を提供します。何の勧告はCSIRTがそのポリシーや手続きのために採用すべきである何が行われていないものの、異なる可能性がいくつかの例を与えるために概説されています。最も重要なことは、CSIRTがポリシーを持っていることと、CSIRTとやり取りする人が取得し、それを理解することができるということです。"
    },
    {
      "indent": 3,
      "text": "As always, not every aspect for every environment and/or team can be covered. This outline should be seen as a suggestion. Each team should feel free to include whatever they think is necessary to support its constituency.",
      "ja": "いつものように、すべての環境および/またはチームのすべての側面をカバーすることができません。この概要は提案として見られるべきです。各チームは、彼らがその構成をサポートするために必要だと思うものは何でも含まれて自由に感じるはずです。"
    },
    {
      "indent": 0,
      "text": "3.1 Obtaining the Document",
      "section_title": true,
      "ja": "3.1ドキュメントの取得"
    },
    {
      "indent": 3,
      "text": "Details of a CSIRT change with time, so the completed template must indicate when it was last changed. Additionally, information should be provided concerning how to find out about future updates. Without this, it is inevitable that misunderstandings and misconceptions will arise over time; outdated documents can do more harm than good.",
      "ja": "それが最後に変更された時刻とのCSIRTが変化するので、完成したテンプレートの詳細が示さなければなりません。さらに、情報は、今後のアップデートについて調べる方法について提供されるべきです。これがなければ、誤解や誤解が時間とともに生じることになることは避けられません。古くなった文書は、効果よりも害を行うことができます。"
    },
    {
      "indent": 3,
      "text": "- Date of last update This should be sufficient to allow anyone interested to evaluate the currency of the template.",
      "ja": " - 最後の更新の日付は、これは、興味がある人は、テンプレートの通貨を評価することを可能にするのに十分であるべきです。"
    },
    {
      "indent": 3,
      "text": "- Distribution list Mailing lists are a convenient mechanism to distribute up-to-date information to a large number of users. A team can decide to use its own or an already existing list to notify users whenever the document changes. The list might normally be groups the CSIRT has frequent interactions with.",
      "ja": " - 配布リストメーリングリストは、多数のユーザーに最新の情報を配布するための便利な機構です。チームは、ドキュメントが変更されるたびにユーザーに通知する、独自または既存のリストを使用することを決定することができます。リストは通常​​、CSIRTはと頻繁な相互作用を持っているグループであるかもしれません。"
    },
    {
      "indent": 33,
      "text": "Digital signatures should be used\nfor update messages sent by a CSIRT.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "- Location of the document The location where a current version of the document is accessible through a team's online information services. Constituents can then easily learn more about the team and check for recent updates. This online version should also be accompanied by a digital signature.",
      "ja": " - 文書ドキュメントの現在のバージョンでは、チームのオンライン情報サービスを通じてアクセス可能な場所の場所。成分は、簡単にチームについての詳細を学び、最新の更新を確認することができます。このオンライン版は、デジタル署名が添付されなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.2 Contact Information",
      "section_title": true,
      "ja": "3.2連絡先情報"
    },
    {
      "indent": 3,
      "text": "Full details of how to contact the CSIRT should be listed here, although this might be very different for different teams; for example, some might choose not to publicize the names of their team members. No further clarification is given when the meaning of the item can be assumed.",
      "ja": "これは、異なるチームのために非常に異なる可能性がありますが、CSIRTへの連絡方法の詳細は、ここにリストされなければなりません。例えば、いくつかは、彼らのチームメンバーの名前を公表しないことを選択するかもしれません。項目の意味を仮定することができたときにこれ以上の明確化が与えられていません。"
    },
    {
      "indent": 3,
      "text": "- Name of the CSIRT",
      "ja": " -  CSIRTの名前"
    },
    {
      "indent": 3,
      "text": "- Mailing Address",
      "ja": "- 送り先"
    },
    {
      "indent": 3,
      "text": "- Time zone This is useful for coordinating incidents which cross time zones.",
      "ja": " - タイムゾーンこれは、タイムゾーンを横断事件を調整するのに便利です。"
    },
    {
      "indent": 3,
      "text": "- Telephone number",
      "ja": "- 電話番号"
    },
    {
      "indent": 3,
      "text": "- Facsimile number",
      "ja": " - ファクシミリ番号"
    },
    {
      "indent": 3,
      "text": "- Other telecommunication Some teams might provide secure voice communication (e.g. STU III).",
      "ja": " - その他の通信いくつかのチームは、セキュアな音声通信（例えばSTU III）を提供するかもしれません。"
    },
    {
      "indent": 3,
      "text": "- Electronic mail address",
      "ja": " - 電子メールアドレス"
    },
    {
      "indent": 3,
      "text": "- Public keys and encryption The use of specific techniques depends on the ability of the communication partners to have access to programs, keys and so on. Relevant information should be given to enable users to determine if and how they can make use of encrypted communication while interacting with the CSIRT. - Team members",
      "ja": " - 公開鍵と暗号化の特定の技術の使用は、その上のプログラム、キーおよびへのアクセスを持っている通信相手の能力に依存します。関連情報は、CSIRTとの対話中、どのように彼らは、暗号化通信を利用することができるかどうかを判断するためにユーザを可能にするために与えられるべきです。 - チームメンバー"
    },
    {
      "indent": 3,
      "text": "- Operating Hours The operating hours and holiday schedule should be provided here. Is there a 24 hour hotline?",
      "ja": " - 営業時間営業時間と休日のスケジュールはここで提供されるべきです。 24時間ホットラインはありますか？"
    },
    {
      "indent": 3,
      "text": "- Additional Contact Info Is there any specific customer contact info?",
      "ja": " - 追加の連絡先情報は、いかなる特定の顧客の連絡先情報はありますか？"
    },
    {
      "indent": 3,
      "text": "More detailed contact information can be provided. This might include different contacts for different services, or might be a list of online information services. If specific procedures for access to some services exist (for example addresses for mailing list requests), these should be explained here.",
      "ja": "より詳細な連絡先情報を提供することができます。これは、サービスごとに異なる接点を含む可能性がある、またはオンライン情報サービスのリストであるかもしれません。一部のサービスにアクセスするための具体的な手順は、（メーリングリストの要求のために例えばアドレス）が存在する場合、これらは、ここで説明する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.3 Charter",
      "section_title": true,
      "ja": "3.3憲章"
    },
    {
      "indent": 3,
      "text": "Every CSIRT must have a charter which specifies what it is to do, and the authority under which it will do it. The charter should include at least the following items:",
      "ja": "すべてのCSIRTは、それが何をしているかを指定チャーター、それはそれを行いますその下の権限を持っている必要があります。憲章は、少なくとも以下の項目を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "- Mission statement - Constituency - Sponsorship / affiliation - Authority",
      "ja": " - ミッションステートメント - 選挙 - スポンサーシップ/提携 - オーソリティ"
    },
    {
      "indent": 0,
      "text": "3.3.1 Mission Statement",
      "section_title": true,
      "ja": "3.3.1ミッションステートメント"
    },
    {
      "indent": 3,
      "text": "The mission statement should focus on the team's core activities, already stated in the definition of a CSIRT. In order to be considered a Computer Security Incident Response Team, the team must support the reporting of incidents and support its constituency by dealing with incidents.",
      "ja": "ミッションステートメントは、すでにCSIRTの定義に記載されたチームの中核活動に焦点を当てるべきです。コンピュータセキュリティインシデントレスポンスチームとみなされるためには、チームは、事件の報告をサポートしなければならないし、事件を扱うことにより、その構成をサポートしています。"
    },
    {
      "indent": 3,
      "text": "The goals and purposes of a team are especially important, and require clear, unambiguous definition.",
      "ja": "チームの目標と目的は、特に重要であり、明確な、明確な定義が必要です。"
    },
    {
      "indent": 0,
      "text": "3.3.2 Constituency",
      "section_title": true,
      "ja": "3.3.2選挙"
    },
    {
      "indent": 3,
      "text": "A CSIRT's constituency can be determined in any of several ways. For example it could be a company's employees or its paid subscribers, or it could be defined in terms of a technological focus, such as the users of a particular operating system.",
      "ja": "CSIRTの選挙区では、いくつかの方法のいずれかで決定することができます。例えば、それは、企業の従業員やその有料会員可能性があり、あるいはそのような特定のオペレーティングシステムの利用者として、技術的な焦点の用語で定義することができます。"
    },
    {
      "indent": 3,
      "text": "The definition of the constituency should create a perimeter around the group to whom the team will provide service. The policy section of the document (see below) should explain how requests from outside this perimeter will be handled.",
      "ja": "選挙の定義は、チームがサービスを提供します誰にグループの周りに境界線を作成する必要があります。文書のポリシーセクションは、（下記参照）は、この境界線の外側からの要求がどのように処理するかを説明しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a CSIRT decides not to disclose its constituency, it should explain the reasoning behind this decision. For example, for-fee CSIRTs will not list their clients but will declare that they provide a service to a large group of customers that are kept confidential because of the clients' contracts.",
      "ja": "CSIRTは、その構成を開示しないことを決定した場合、それはこの決定の背後にある理由を説明する必要があります。例えば、有償のCSIRTは、そのクライアントの一覧を表示しませんが、彼らはので、顧客の契約の機密保持されている顧客の大規模なグループにサービスを提供することを宣言します。"
    },
    {
      "indent": 3,
      "text": "Constituencies might overlap, as when an ISP provides a CSIRT which delivers services to customer sites that also have CSIRTs. The Authority section of the CSIRT's description (see below) should make such relationships clear.",
      "ja": "選挙はISPものCSIRTを持つ顧客サイトにサービスを提供するCSIRTを提供する場合のように、重複する可能性があります。 CSIRTの記述の機関セクションには、（下記参照）、このような関係を明確にする必要があります。"
    },
    {
      "indent": 0,
      "text": "3.3.3 Sponsoring Organization / Affiliation",
      "section_title": true,
      "ja": "3.3.3スポンサー組織/所属"
    },
    {
      "indent": 3,
      "text": "The sponsoring organization, which authorizes the actions of the CSIRT, should be given next. Knowing this will help the users to understand the background and set-up of the CSIRT, and it is vital information for building trust between a constituent and a CSIRT.",
      "ja": "CSIRTのアクションを許可スポンサー組織は、次与えられるべきです。これを知ることは、ユーザーがCSIRTの背景とセットアップを理解するのに役立ち、そしてそれは、構成とCSIRT間の信頼関係を構築するための重要な情報であるだろう。"
    },
    {
      "indent": 0,
      "text": "3.3.4 Authority",
      "section_title": true,
      "ja": "3.3.4権限"
    },
    {
      "indent": 3,
      "text": "This section will vary greatly from one CSIRT to another, based on the relationship between the team and its constituency. While an organizational CSIRT will be given its authority by the management of the organization, a community CSIRT will be supported and chosen by the community, usually in a advisory role.",
      "ja": "このセクションでは、チームとその構成との関係に基づいて、別のCSIRTとは大きく異なります。組織のCSIRTは、組織の経営者がその権限を与えられますが、コミュニティCSIRTは、通常、顧問的な役割で、コミュニティによってサポートされており、選択されます。"
    },
    {
      "indent": 3,
      "text": "A CSIRT may or may not have the authority to intervene in the operation of all of the systems within its perimeter. It should identify the scope of its control as distinct from the perimeter of its constituency. If other CSIRTs operate hierarchically within its perimeter, this should be mentioned here, and the related CSIRTs identified.",
      "ja": "CSIRTは、またはその周辺部内のすべてのシステムの操作に介入する権限を持っていない可能性があります。それは、その構成の周囲とは異なり、その制御の範囲を識別すべきです。他のCSIRTは、その周囲の中に階層的に動作させる場合、これはここでは言及されるべき、と関連のCSIRTを同定しました。"
    },
    {
      "indent": 3,
      "text": "Disclosure of a team's authority may expose it to claims of liability. Every team should seek legal advice on these matters. (See section 3.7 for more on liability.)",
      "ja": "チームの権限の開示は、責任の主張にそれを公開することがあります。すべてのチームは、これらの事項について法的助言を求めるべきです。 （責任の詳細については3.7節を参照してください。）"
    },
    {
      "indent": 0,
      "text": "3.4 Policies",
      "section_title": true,
      "ja": "3.4ポリシー"
    },
    {
      "indent": 3,
      "text": "It is critical that Incident Response Teams define their policies. The following sections discuss communication of these policies to the constituent community.",
      "ja": "インシデント対応チームは、彼らのポリシーを定義することが重要です。次のセクションでは、構成コミュニティにこれらのポリシーの通信を議論します。"
    },
    {
      "indent": 0,
      "text": "3.4.1 Types of Incidents and Level of Support",
      "section_title": true,
      "ja": "インシデントとサポートのレベルの3.4.1タイプ"
    },
    {
      "indent": 3,
      "text": "The types of incident which the team is able to address, and the level of support which the team will offer when responding to each type of incident, should be summarized here in list form. The Services section (see below) provides the opportunity to give more detailed descriptions, and to address non-incident-related topics.",
      "ja": "チームが対処することができます事件の種類、およびインシデントの種類ごとに応答するときにチームが提供するサポートのレベルは、リスト形式でここに要約されなければなりません。 [サービス]セクションには、（下記参照）より詳細な説明を与えるために、非インシデント関連のトピックに対処するための機会を提供します。"
    },
    {
      "indent": 3,
      "text": "The level of support may change depending on factors such as the team's workload and the completeness of the information available. Such factors should be outlined and their impact should be explained. As a list of known types of incidents will be incomplete with regard to possible or future incidents, a CSIRT should also give some background on the \"default\" support for incident types not otherwise mentioned.",
      "ja": "サポートのレベルは、そのようなチームの作業負荷や入手可能な情報の完全性などの要因に応じて変更されることがあります。そのような要因は概説されるべきであり、それらの影響を説明すべきです。事件の知られているタイプのリストが可能か、将来の出来事に関して不完全であるように、CSIRTはまた、特に断らないインシデントのタイプのための「デフォルト」、支持体上にいくつかの背景を与えるべきです。"
    },
    {
      "indent": 3,
      "text": "The team should state whether it will act on information it receives about vulnerabilities which create opportunities for future incidents. A commitment to act on such information on behalf of its constituency is regarded as an optional proactive service policy rather than a core service requirement for a CSIRT.",
      "ja": "チームは、それが将来のインシデントの機会を創出する脆弱性についての受信情報に基づいて行動するかどうかを必ず明記してください。その構成に代わって、このような情報に基づいて行動するためのコミットメントは、オプションの積極的なサービスポリシーではなく、CSIRTのためのコアサービスの要件とされています。"
    },
    {
      "indent": 0,
      "text": "3.4.2 Co-operation, Interaction and Disclosure of Information",
      "section_title": true,
      "ja": "3.4.2協力、相互作用と情報の開示"
    },
    {
      "indent": 3,
      "text": "This section should make explicit which related groups the CSIRT routinely interacts with. Such interactions are not necessarily related to the computer security incident response provided, but are used to facilitate better cooperation on technical topics or services. By no means need details about cooperation agreements be given out; the main objective of this section is to give the constituency a basic understanding of what kind of interactions are established and what their purpose is.",
      "ja": "このセクションでは、CSIRTが日常と相互作用する関連グループ明示的に行う必要があります。このような相互作用は、必ずしも設ける必要はコンピュータセキュリティインシデント対応に関連していないが、技術的な話題やサービスのより良い連携を容易にするために使用されています。決してによって与えられるの協力協定の詳細を必要とします。このセクションの主な目的は、選挙区に設立され、どのような彼らの目的はされている相互作用の種類の基本的な理解を与えることです。"
    },
    {
      "indent": 3,
      "text": "Cooperation between CSIRTs can be facilitated by the use of unique ticket number assignment combined with explicit handoff procedures. This reduces the chance of misunderstandings, duplications of effort, assists in incident tracking and prevents 'loops' in communication.",
      "ja": "CSIRT間の協力は、明示的なハンドオフ手順と組み合わせ一意チケット番号の割り当てを使用することによって容易にすることができます。これは誤解、努力の重複、事件の追跡を支援し、防止の機会を減少させるコミュニケーションにおける「ループ」。"
    },
    {
      "indent": 3,
      "text": "The reporting and disclosure policy should make clear who will be the recipients of a CSIRT's report in each circumstance. It should also note whether the team will expect to operate through another CSIRT or directly with a member of another constituency over matters specifically concerning that member.",
      "ja": "報告および開示方針は、各状況におけるCSIRTの報告書の受取人になる人を明確にする必要があります。また、チームは他のCSIRTを介して、または直接、特にそのメンバーに関する事項を介して別の選挙区のメンバーで動作することを期待するかどうかに注意してください。"
    },
    {
      "indent": 3,
      "text": "Related groups a CSIRT will interact with are listed below:",
      "ja": "CSIRTは、と相互作用する関連グループは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Incident Response Teams: A CSIRT will often need to interact with other CSIRTs. For example a CSIRT within a large company may need to report incidents to a national CSIRT, and a national CSIRT may need to report incidents to national CSIRTs in other countries to deal with all sites involved in a large-scale attack.",
      "ja": "インシデント対応チーム：CSIRTは、しばしば他のCSIRTとやり取りする必要があります。たとえば、大規模な企業内CSIRTは、国内CSIRTにインシデントを報告する必要があるかもしれない、と国民のCSIRTは、大規模な攻撃に関与したすべてのサイトに対処するために他の国の国民のCSIRTにインシデントを報告する必要があるかもしれません。"
    },
    {
      "indent": 6,
      "text": "Collaboration between CSIRTs may lead to disclosure of information. The following are examples of such disclosure, but are not intended to be an exhaustive list:",
      "ja": "CSIRT間の連携、情報の開示につながる可能性があります。以下は、そのような開示の例であるが、網羅的なリストであることを意図するものではありません。"
    },
    {
      "indent": 7,
      "text": "- Reporting incidents within the constituency to other teams. If this is done, site-related information may become public knowledge, accessible to everyone, in particular the press.",
      "ja": " - 他のチームに選挙区内のインシデントを報告します。これが行われている場合は、サイトに関連する情報は、プレス、特に、誰もがアクセスできる公共の知識になることがあります。"
    },
    {
      "indent": 7,
      "text": "- Handling incidents occurring within the constituency, but reported from outside it (which implies that some information has already been disclosed off-site).",
      "ja": " - 選挙内で発生するインシデントを取り扱いますが、（いくつかの情報が既にオフサイトに記載されていることを意味する）は、外部からの報告。"
    },
    {
      "indent": 7,
      "text": "- Reporting observations from within the constituency indicating suspected or confirmed incidents outside it.",
      "ja": " - それは外部疑いのインシデントを示す選挙中からレポート観測。"
    },
    {
      "indent": 7,
      "text": "- Acting on reports of incidents from outside the constituency.",
      "ja": " - 選挙外部から事件の報告に作用します。"
    },
    {
      "indent": 7,
      "text": "- Passing information about vulnerabilities to vendors, to partner CSIRTs or directly to affected sites lying within or outside the constituency.",
      "ja": " - ベンダーに、パートナーのCSIRTに直接選挙区内または外にある患部に脆弱性に関する情報を渡します。"
    },
    {
      "indent": 7,
      "text": "- Feedback to parties reporting incidents or vulnerabilities.",
      "ja": " - 事件や脆弱性の報告、関係者へのフィードバック。"
    },
    {
      "indent": 7,
      "text": "- The provision of contact information relating to members of the constituency, members of other constituencies, other CSIRTs, or law-enforcement agencies.",
      "ja": " - 選挙のメンバーに関連する連絡先情報の提供、他の選挙、他のCSIRT、または法執行機関のメンバー。"
    },
    {
      "indent": 3,
      "text": "Vendors: Some vendors have their own CSIRTs, but some vendors may not. In such cases a CSIRT will need to work directly with a vendor to suggest improvements or modifications, to analyze the technical problem or to test provided solutions. Vendors play a special role in handling an incident if their products' vulnerabilities are involved in the incident.",
      "ja": "ベンダー：一部のベンダーは、独自のCSIRTを持っているが、いくつかのベンダーがないかもしれません。このような場合にはCSIRTは、改良または変更を提案するために技術的な問題を分析したり、提供するソリューションをテストするために、ベンダーと直接連携する必要があります。ベンダーは、自社製品脆弱性が事件に関与している場合には事件を処理する際の特別な役割を果たしています。"
    },
    {
      "indent": 3,
      "text": "Law-enforcement agencies: These include the police and other investigative agencies. CSIRTs and users of the template should be sensitive to local laws and regulations, which may vary considerably in different countries. A CSIRT might advise on technical details of attacks or seek advice on the legal implications of an incident. Local laws and regulations may include specific reporting and confidentiality requirements.",
      "ja": "法執行機関：これらは、警察や他の捜査機関が含まれます。テンプレートののCSIRTと、ユーザーはさまざまな国で大幅に異なる場合があり、現地の法律や規制に敏感でなければなりません。 CSIRTは、攻撃の技術的な詳細について助言またはインシデントの法的な意味合いに助言を求めるかもしれません。現地の法律や規制は、特定の報告や機密性の要件を含んでいてもよいです。"
    },
    {
      "indent": 3,
      "text": "Press: A CSIRT may be approached by the press for information and comment from time to time.",
      "ja": "プレス：CSIRTは、随時情報やコメントをプレスにより近づいていてもよいです。"
    },
    {
      "indent": 6,
      "text": "An explicit policy concerning disclosure to the press can be helpful, particularly in clarifying the expectations of a CSIRT's constituency. The press policy will have to clarify the same topics as above more specifically, as the constituency will usually be very sensitive to press contacts.",
      "ja": "プレスへの開示に関する明確な方針は、特にCSIRTの選挙区の期待を明確に、参考にすることができます。プレス政策は選挙が通常の連絡先を押して非常に敏感であるように、より具体的に上記と同じトピックを明確にする必要があります。"
    },
    {
      "indent": 3,
      "text": "Other: This might include research activities or the relation to the sponsoring organization.",
      "ja": "その他：これは、研究活動やスポンサー組織との関係が含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "The default status of any and all security-related information which a team receives will usually be 'confidential,' but rigid adherence to this makes the team to appear to be an informational 'black hole,' which may reduce the likelihood of the team's obtaining cooperation from clients and from other organizations. The CSIRT's template should define what information it will report or disclose, to whom, and when.",
      "ja": "これまでの任意のデフォルトのステータスとチームが通常になります受信したすべてのセキュリティ関連情報の機密、 'は剛性の付着がチームの獲得の可能性を低減することができる「ブラックホール」の情報のように見えるためにチームを作りますクライアントから、その他の団体からの協力。 CSIRTのテンプレートは、それが誰、とするときに、報告または開示する情報を定義する必要があります。"
    },
    {
      "indent": 3,
      "text": "Different teams are likely to be subject to different legal restraints requiring or limiting disclosure, especially if they work in different jurisdictions. In addition, they may have reporting requirements imposed by their sponsoring organization. Each team's template should specify any such constraints, both to clarify users' expectations and to inform other teams.",
      "ja": "異なるチームは、彼らが別の管轄区域で作業する場合は特に、開示を必要とするか、制限異なる法的制約の対象である可能性が高いです。また、彼らはスポンサー組織によって課される要件を報告している可能性があります。各チームのテンプレートは、ユーザーの期待を明らかにし、他のチームに通知するために、両方の、どのような制約を指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Conflicts of interest, particularly in commercial matters, may also restrain disclosure by a team; this document does not recommend on how such conflicts should be addressed.",
      "ja": "特に、商業事項における利益相反も、チームによって開示を抑制すること。この文書では、このような紛争に対処する方法にはお勧めしません。"
    },
    {
      "indent": 3,
      "text": "A team will normally collect statistics. If statistical information is distributed, the template's reporting and disclosure policy should say so, and should describe how to obtain such statistics.",
      "ja": "チームは、通常、統計情報を収集します。統計情報が分散されている場合、テンプレートの報告および開示方針はそう言う必要があり、そのような統計情報を取得する方法を説明しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.4.3 Communication and Authentication",
      "section_title": true,
      "ja": "3.4.3コミュニケーションと認証"
    },
    {
      "indent": 3,
      "text": "You must have a policy which describes methods of secure and verifiable communication that you will use. This is necessary for communication between CSIRTs and between a CSIRT and its constituents. The template should include public keys or pointers to them, including key fingerprints, together with guidelines on how to use this information to check authenticity and how to deal with corrupted information (for example where to report this fact).",
      "ja": "あなたが使用する安全かつ検証可能な通信方法を記載したポリシーを持っている必要があります。これは、のCSIRT間とCSIRTとその構成要素間の通信のために必要です。テンプレートには、一緒に信憑性を確認するためにこの情報を使用する方法についてのガイドラインで、キーの指紋を含むそれらの公開鍵またはポインタを含み、そしてどのように破損した情報（例えば、この事実を報告する場所）に対処する必要があります。"
    },
    {
      "indent": 3,
      "text": "At the moment it is recommended that as a minimum every CSIRT have (if possible), a PGP key available. A team may also make other mechanisms available (for example PEM, MOSS, S/MIME), according to its needs and the needs of its constituents. Note however, that CSIRTs and users should be sensitive to local laws and regulations. Some countries do not allow strong encryption, or enforce specific policies on the use of encryption technology. In addition to encrypting sensitive information whenever possible, correspondence should include digital signatures. (Please note that in most countries, the protection of authenticity by using digital signatures is not affected by existing encryption regulations.)",
      "ja": "現時点では、その最小値として推奨されているすべてのCSIRTは、（可能ならば）可能なPGPキーを持っています。チームは、そのニーズおよびその構成要素のニーズに応じて、（例えばPEM、MOSS、S / MIME）他のメカニズムを利用できるようにしてもよいです。 CSIRTと、ユーザーは現地の法律や規制に敏感でなければならないこと、しかし、注意してください。一部の国では、強力な暗号化を許可、または暗号化技術の利用に関する特定のポリシーを適用しません。機密情報可能な限りの暗号化に加えて、対応のデジタル署名を含むべきです。 （ほとんどの国では、デジタル署名を使用することにより、真正性の保護は、既存の暗号規制に影響されないことに注意してください。）"
    },
    {
      "indent": 3,
      "text": "For communication via telephone or facsimile a CSIRT may keep secret authentication data for parties with whom they may deal, such as an agreed password or phrase. Obviously, such secret keys must not be published, though their existence may be.",
      "ja": "通信のために、電話またはファクシミリCSIRTは、そのような合意されたパスワードやフレーズなど、彼らが扱うことが誰と関係者のための秘密の認証データを保持してもよいです。彼らの存在がかもしれないが明らかにこのような秘密鍵は、公開されてはなりません。"
    },
    {
      "indent": 0,
      "text": "3.5 Services",
      "section_title": true,
      "ja": "3.5サービス"
    },
    {
      "indent": 3,
      "text": "Services provided by a CSIRT can be roughly divided into two categories: real-time activities directly related to the main task of incident response, and non-real-time proactive activities, supportive of the incident response task. The second category and part of the first category consist of services which are optional in the sense that not all CSIRTs will offer them.",
      "ja": "リアルタイム直接入射応答の主なタスクに関連する活動、および非リアルタイムの積極的な活動、インシデント対応作業の支援：CSIRTによって提供されるサービスは、大きく二つのカテゴリーに分けることができます。第二のカテゴリーと最初のカテゴリの一部ではないすべてのCSIRTがそれらを提供するという意味でオプションであるサービスがあります。"
    },
    {
      "indent": 0,
      "text": "3.5.1 Incident Response",
      "section_title": true,
      "ja": "3.5.1インシデントレスポンス"
    },
    {
      "indent": 3,
      "text": "Incident response usually includes assessing incoming reports about incidents (\"Incident Triage\") and following up on these with other CSIRTs, ISPs and sites (\"Incident Coordination\"). A third range of services, helping a local site to recover from an incident (\"Incident Resolution\"), is comprised of typically optional services, which not all CSIRTs will offer.",
      "ja": "インシデント対応は、通常の事件（「インシデントトリアージ」）について、受信報告書を評価し、他のCSIRT、ISPやサイト（「インシデントコーディネーション」）でこれらのフォローアップが含まれます。事件（「事件解決」）から回復するローカルサイトを支援するサービスの第3の範囲は、必ずしもすべてのCSIRTが提供する通常のオプションサービスで構成されています。"
    },
    {
      "indent": 0,
      "text": "3.5.1.1 Incident Triage",
      "section_title": true,
      "ja": "3.5.1.1インシデントトリアージ"
    },
    {
      "indent": 3,
      "text": "Incident triage usually includes:",
      "ja": "インシデントトリアージは、通常は含まれています："
    },
    {
      "indent": 3,
      "text": "- Report assessment Interpretion of incoming incident reports, prioritizing them, and relating them to ongoing incidents and trends.",
      "ja": " - それらに優先順位を付け、入ってくるインシデントレポートの評価の解釈を報告し、継続的な事件やトレンドにそれらを関連付けます。"
    },
    {
      "indent": 3,
      "text": "- Verification Help in determining whether an incident has really occurred, and its scope.",
      "ja": " - 検証の事件が本当に起こったかどうかを決定する際のヘルプ、およびその範囲。"
    },
    {
      "indent": 0,
      "text": "3.5.1.2 Incident Coordination",
      "section_title": true,
      "ja": "3.5.1.2インシデントコーディネーション"
    },
    {
      "indent": 3,
      "text": "Incident Coordination normally includes:",
      "ja": "インシデントコーディネーションは通常含まれています："
    },
    {
      "indent": 3,
      "text": "- Information categorization Categorization of the incident related information (logfiles, contact information, etc.) with respect to the information disclosure policy.",
      "ja": " - 情報開示ポリシーに対する入射関連情報（ログファイル、連絡先情報、等）の情報分類分類。"
    },
    {
      "indent": 3,
      "text": "- Coordination Notification of other involved parties on a need-to-know basis, as per the information disclosure policy.",
      "ja": " - 情報開示ポリシーに従って知る必要性に基づき、他の関係者の調整の通知。"
    },
    {
      "indent": 0,
      "text": "3.5.1.3 Incident Resolution",
      "section_title": true,
      "ja": "3.5.1.3インシデントの解決"
    },
    {
      "indent": 3,
      "text": "Usually additional or optional, incident resolution services include:",
      "ja": "通常、追加またはオプション、インシデント解決サービスが含まれます："
    },
    {
      "indent": 3,
      "text": "- Technical Assistance This may include analysis of compromised systems.",
      "ja": " - 技術支援は、これが危険にさらさシステムの分析を含むことができます。"
    },
    {
      "indent": 3,
      "text": "- Eradication Elimination of the cause of a security incident (the vulnerability exploited), and its effects (for example, continuing access to the system by an intruder).",
      "ja": " - 根絶セキュリティインシデントの原因の除去（脆弱性を悪用）、及びその効果（例えば、侵入者によるシステムへのアクセスを継続します）。"
    },
    {
      "indent": 3,
      "text": "- Recovery Aid in restoring affected systems and services to their status before the security incident.",
      "ja": " - セキュリティインシデント前の状態に影響を受けるシステムやサービスの復元で復旧支援。"
    },
    {
      "indent": 0,
      "text": "3.5.2. Proactive Activities",
      "section_title": true,
      "ja": "3.5.2. 積極的な活動"
    },
    {
      "indent": 3,
      "text": "Usually additional or optional, proactive services might include:",
      "ja": "通常、追加またはオプション、プロアクティブなサービスが含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "- Information provision This might include an archive of known vulnerabilities, patches or resolutions of past problems, or advisory mailing lists.",
      "ja": " - 情報提供これは、既知の脆弱性、パッチや過去の問題、または助言メーリングリストの解像度のアーカイブが含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "- Security Tools This may include tools for auditing a Site's security.",
      "ja": " - セキュリティツールこれは、サイトのセキュリティを監査するためのツールを含むことができます。"
    },
    {
      "indent": 3,
      "text": "- Education and training",
      "ja": " - 教育とトレーニング"
    },
    {
      "indent": 3,
      "text": "- Product evaluation",
      "ja": " - 製品評価"
    },
    {
      "indent": 3,
      "text": "- Site security auditing and consulting",
      "ja": " - サイトのセキュリティ監査とコンサルティング"
    },
    {
      "indent": 0,
      "text": "3.6 Incident Reporting Forms",
      "section_title": true,
      "ja": "3.6インシデント報告フォーム"
    },
    {
      "indent": 3,
      "text": "The use of reporting forms makes it simpler for both users and teams to deal with incidents. The constituent can prepare answers to various important questions before he or she actually contacts the team, and can therefore come well prepared. The team gets all the necessary information at once with the first report and can proceed efficiently.",
      "ja": "報告フォームを使用することは、事件に対処するため、ユーザーとチームの両方にとって簡単になります。構成要素は、彼または彼女が実際に接触し、チームの前に様々な重要な質問への回答を準備することができますので、十分に準備してくることができます。チームは最初のレポートで一度にすべての必要な情報を取得し、効率的に進めることができます。"
    },
    {
      "indent": 3,
      "text": "Depending on the objectives and services of a particular CSIRT, multiple forms may be used, for example a reporting form for a new vulnerability may be very different from the form used for reporting incidents.",
      "ja": "特定のCSIRTの目的やサービスによっては、複数のフォームは、例えば、新たな脆弱性の報告書は、事件を報告するために使用されるフォームから非常に異なる場合があり、使用することができます。"
    },
    {
      "indent": 3,
      "text": "It is most efficient to provide forms through the online information services of the team. The exact pointers to them should be given in the CSIRT description document, together with statements about appropriate use, and guidelines for when and how to use the forms. If separate e-mail addresses are supported for form-based reporting, they should be listed here again.",
      "ja": "チームのオンライン情報サービスを通じて形を提供するために最も効率的です。それらの正確なポインタが一緒に適切な使用についての声明、そして、どのようにフォームを使用するためのガイドラインで、CSIRT記述文書に与えられるべきです。別の電子メールアドレスは、フォームベースのレポートのためにサポートされている場合、彼らは再びここに書かれています。"
    },
    {
      "indent": 3,
      "text": "One example of such a form is the Incident Reporting Form provided by the CERT Coordination Center:",
      "ja": "このような形態の一例は、CERTコーディネーションセンターによって提供されるインシデントレポートの形です。"
    },
    {
      "indent": 3,
      "text": "- ftp://info.cert.org/incident_reporting_form",
      "ja": "ー ｆｔｐ：／／いんふぉ。せｒｔ。おｒｇ／いんしでんｔ＿れぽｒちんｇ＿ふぉｒｍ"
    },
    {
      "indent": 0,
      "text": "3.7 Disclaimers",
      "section_title": true,
      "ja": "3.7免責事項"
    },
    {
      "indent": 3,
      "text": "Although the CSIRT description document does not constitute a contract, liability may conceivably result from its descriptions of services and purposes. The inclusion of a disclaimer at the end of the template is therefore recommended and should warn the user about possible limitations.",
      "ja": "CSIRT記述文書は、契約を構成するものではありませんが、責任はおそらくサービスや目的のその説明から生じ得ます。テンプレートの終わりに免責事項を含めることは、したがって、推奨され、可能な制限についてユーザに警告するべきです。"
    },
    {
      "indent": 3,
      "text": "In situations where the original version of a document must be translated into another language, the translation should carry a disclaimer and a pointer to the original. For example:",
      "ja": "ドキュメントのオリジナルバージョンは、他の言語に翻訳されなければならない状況では、翻訳は免責事項と元へのポインタを運ぶ必要があります。例えば："
    },
    {
      "indent": 6,
      "text": "Although we tried to carefully translate the original document from German into English, we can not be certain that both documents express the same thoughts in the same level of detail and correctness. In all cases, where there is a difference between both versions, the German version will prevail.",
      "ja": "我々は慎重に英語にドイツ語から元の文書を翻訳しようとしたが、我々は両方の文書は、詳細かつ正確に同じレベルで同じ考えを表現することを特定することはできません。両方のバージョンの間に差があるすべての場合において、ドイツ語バージョンが優先する。"
    },
    {
      "indent": 3,
      "text": "The use of and protection by disclaimers is affected by local laws and regulations, of which each CSIRT should be aware. If in doubt the CSIRT should check the disclaimer with a lawyer.",
      "ja": "免責事項によっての使用と保護は、各CSIRTが知っておくべきで現地の法律や規制の影響を受けています。疑問がある場合はCSIRTは、弁護士と免責事項を確認する必要があります。"
    },
    {
      "indent": 0,
      "text": "Appendix A: Glossary of Terms",
      "ja": "付録A：用語集"
    },
    {
      "indent": 3,
      "text": "This glossary defines terms used in describing security incidents and Computer Security Incident Response Teams. Only a limited list is included. For more definitions please refer to other sources, for example to the Internet User's Glossary [RFC 1983].",
      "ja": "この用語集では、セキュリティインシデントやコンピュータセキュリティインシデント対応チームを記述する際に使用される用語を定義します。限られたリストが含まれています。より多くの定義については、インターネットユーザーの用語集[RFC 1983]に、たとえば、他の情報源を参照してください。"
    },
    {
      "indent": 3,
      "text": "Constituency: Implicit in the purpose of a Computer Security Incident Response Team is the existence of a constituency. This is the group of users, sites, networks or organizations served by the team. The team must be recognized by its constituency in order to be effective.",
      "ja": "選挙：コンピュータセキュリティインシデントレスポンスチームの目的で暗黙的には、選挙の存在です。これは、チームによって提供されるユーザー、サイト、ネットワークや組織のグループです。チームは、効果的にするために、その構成によって認識されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Security Incident: For the purpose of this document, this term is a synonym of Computer Security Incident: any adverse event which compromises some aspect of computer or network security.",
      "ja": "セキュリティインシデントは：コンピュータやネットワークセキュリティのいくつかの側面を損なういかなる有害事象：このドキュメントの目的のために、この用語は、コンピュータセキュリティインシデントの同義語です。"
    },
    {
      "indent": 6,
      "text": "The definition of an incident may vary between organizations, but at least the following categories are generally applicable:",
      "ja": "インシデントの定義は、組織間で変化してもよいが、少なくとも次のカテゴリは、一般的に適用可能です。"
    },
    {
      "indent": 6,
      "text": "- Loss of confidentiality of information. - Compromise of integrity of information. - Denial of service. - Misuse of service, systems or information. - Damage to systems.",
      "ja": " - 情報の機密性の損失。 - 情報の完全性の妥協。 - サービス拒否。 - サービス、システム、または情報の不正使用。 - システムへのダメージ。"
    },
    {
      "indent": 6,
      "text": "These are very general categories. For instance the replacement of a system utility program by a Trojan Horse is an example of ' compromise of integrity,' and a successful password attack is an example of 'loss of confidentiality.' Attacks, even if they failed because of proper protection, can be regarded as Incidents.",
      "ja": "これらは非常に一般的なカテゴリです。たとえば、トロイの木馬によるシステムユーティリティプログラムの交換は「完全性の妥協」の一例であり、成功したパスワード攻撃はの一例である「機密性の損失」。攻撃は、彼らがために、適切な保護を失敗しても、インシデントと見なすことができます。"
    },
    {
      "indent": 6,
      "text": "Within the definition of an incident the word 'compromised' is used. Sometimes an administrator may only 'suspect' an incident. During the response it must be established whether or not an incident has really occurred.",
      "ja": "単語は「妥協」インシデントの定義内で使用されています。時には、管理者のみ \"容疑者事件があります。応答の際には、事件が実際に発生しているか否かを確立する必要があります。"
    },
    {
      "indent": 3,
      "text": "Computer Security Incident Response Team: Based on two of the definitions given above, a CSIRT is a team that coordinates and supports the response to security incidents that involve sites within a defined constituency.",
      "ja": "コンピュータセキュリティインシデント対応チーム：上記の定義の2に基づき、CSIRTは、定義された選挙区内のサイトのセキュリティ問題への対応を調整し、サポートチームです。"
    },
    {
      "indent": 6,
      "text": "In order to be considered a CSIRT, a team must:",
      "ja": "順序がCSIRTを考慮することに、チームは次の条件を満たす必要があります。"
    },
    {
      "indent": 6,
      "text": "- Provide a (secure) channel for receiving reports about suspected incidents.",
      "ja": " - 疑われる事件に関するレポートを受信するための（安全な）チャネルを提供します。"
    },
    {
      "indent": 6,
      "text": "- Provide assistance to members of its constituency in handling these incidents. - Disseminate incident-related information to its constituency and to other involved parties.",
      "ja": " - これらの事件を処理する際のその選挙のメンバーに援助を提供します。 - その構成にし、他の関係者に事件に関連した情報を発信。"
    },
    {
      "indent": 6,
      "text": "Note that we are not referring here to police or other law enforcement bodies which may investigate computer-related crime. CSIRT members, indeed, need not have any powers beyond those of ordinary citizens.",
      "ja": "我々はコンピュータ関連犯罪を調査することがあり、警察またはその他の法執行機関に、ここで言及されていないことに注意してください。 CSIRTのメンバーは、確かに、一般市民のものを超えてどんな力を持ってする必要はありません。"
    },
    {
      "indent": 3,
      "text": "Vendor: A 'vendor' is any entity that produces networking or computing technology, and is responsible for the technical content of that technology. Examples of 'technology' include hardware (desktop computers, routers, switches, etc.), and software (operating systems, mail forwarding systems, etc.).",
      "ja": "ベンダー：「ベンダー」は、ネットワーキングやコンピューティング技術を生成する任意のエンティティであり、その技術の技術的な内容に責任があります。 「技術」の例としては、ハードウェア（デスクトップコンピュータ、ルータ、スイッチなど）、ソフトウェア（オペレーティング・システム、メール転送システムなど）が含まれています。"
    },
    {
      "indent": 6,
      "text": "Note that the supplier of a technology is not necessarily the ' vendor' of that technology. As an example, an Internet Service Provider (ISP) might supply routers to each of its customers, but the 'vendor' is the manufacturer, since the manufacturer, rather than the ISP, is the entity responsible for the technical content of the router.",
      "ja": "技術の供給者が必ずしもその技術の「ベンダー」ではないことに注意してください。例として、インターネットサービスプロバイダ（ISP）は、顧客のそれぞれにルーターを供給かもしれませんが、「ベンダー」は、むしろISPよりも、メーカー以来、メーカーであるルータの技術的な内容については責任を負いエンティティです。"
    },
    {
      "indent": 3,
      "text": "Vulnerability: A 'vulnerability' is a characteristic of a piece of technology which can be exploited to perpetrate a security incident. For example, if a program unintentionally allowed ordinary users to execute arbitrary operating system commands in privileged mode, this \"feature\" would be a vulnerability.",
      "ja": "脆弱性：A '脆弱性のセキュリティインシデントを犯すために活用することができる技術の作品の特徴です。プログラムが意図せずに普通のユーザーは、特権モードで任意のオペレーティング・システム・コマンドを実行するために許可されている場合たとえば、この「機能」は、脆弱性になります。"
    },
    {
      "indent": 0,
      "text": "Appendix B: Related Material",
      "ja": "付録B：関連資料"
    },
    {
      "indent": 3,
      "text": "Important issues in responding to security incidents on a site level are contained in [RFC 2196], the Site Security Handbook, produced by the Site Security Handbook Working Group (SSH). This document will be updated by the SSH working group and will give recommendations for local policies and procedures, mainly related to the avoidance of security incidents.",
      "ja": "サイトレベルでのセキュリティインシデントへの対応の重要な問題は、[RFC 2196]でサイトセキュリティハンドブックワーキンググループ（SSH）によって生成サイトセキュリティハンドブックを、含まれています。この文書では、SSHワーキンググループによって更新され、主にセキュリティインシデントの回避に関連するローカルポリシーと手続きのための提言を行います。"
    },
    {
      "indent": 3,
      "text": "Other documents of interest for the discussion of CSIRTs and their tasks are available by anonymous FTP. A collection can be found on:",
      "ja": "CSIRTとそのタスクの議論のための関心の他の文書は、匿名FTPで利用可能です。コレクションはで見つけることができます："
    },
    {
      "indent": 3,
      "text": "- ftp://ftp.cert.dfn.de/pub/docs/csir/ Please refer to file 01-README for further information about the content of this directory.",
      "ja": " -  ftp://ftp.cert.dfn.de/pub/docs/csir/このディレクトリの内容の詳細については01-READMEファイルを参照してください。"
    },
    {
      "indent": 3,
      "text": "Some especially interesting documents in relation to this document are as follows:",
      "ja": "次のように、このドキュメントに関連するいくつかの特に興味深い文書は、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- ftp://ftp.nic.surfnet.nl/surfnet/net-security/cert-nl/docs/ reports/R-92-01 This report contains the Operational Framework of CERT-NL, the CSIRT of SURFnet (network provider in the Netherlands).",
      "ja": " -  ftp://ftp.nic.surfnet.nl/surfnet/net-security/cert-nl/docs/レポート/ R-92から01本報告書は、CERT-NL、SURFNETのCSIRT（ネットワークプロバイダの運用フレームワークが含まれていますオランダ）。"
    },
    {
      "indent": 3,
      "text": "- For readers interested in the operation of FIRST (Forum of Incident Response and Security Teams) more information is collected in Appendix C.",
      "ja": " -  FIRSTの詳細情報（インシデント対応とセキュリティチームのフォーラム）の動作に関心のある読者のために、付録C.に収集されました"
    },
    {
      "indent": 3,
      "text": "- http://hightop.nrl.navy.mil/news/incident.html This document leads to the NRL Incident Response Manual.",
      "ja": " -  http://hightop.nrl.navy.mil/news/incident.htmlこのドキュメントは、NRLインシデント対応マニュアルにつながります。"
    },
    {
      "indent": 3,
      "text": "- http://www.cert.dfn.de/eng/team/kpk/certbib.html This document contains an annotated bibliography of available material, documents and files about the operation of CSIRTs with links to many of the referenced items.",
      "ja": " -  http://www.cert.dfn.de/eng/team/kpk/certbib.htmlこの文書は、参照される項目の多くへのリンクとのCSIRTの動作に関する入手可能な材料で、文書やファイルの注釈付きの文献目録が含まれています。"
    },
    {
      "indent": 3,
      "text": "- ftp://info.cert.org/incident_reporting_form This Incident Reporting Form is provided by the CERT Coordination Center to gather incident information and to avoid additional delays caused by the need to request more detailed information from the reporting site.",
      "ja": " -  ftp://info.cert.org/incident_reporting_formこのインシデント報告書は、インシデント情報を収集し、報告サイトからより詳細な情報を要求する必要性によって引き起こされる追加の遅延を避けるために、CERTコーディネーションセンターによって提供されます。"
    },
    {
      "indent": 3,
      "text": "- http://www.cert.org/cert.faqintro.html A collection of frequently asked questions from the CERT Coordination Center.",
      "ja": " -  http://www.cert.org/cert.faqintro.html CERT Coordination Centerはからよく寄せられる質問を集めました。"
    },
    {
      "indent": 0,
      "text": "Appendix C: Known Computer Security Incident Response Teams",
      "ja": "付録C：既知のコンピュータセキュリティインシデント対応チーム"
    },
    {
      "indent": 3,
      "text": "Today, there are many different CSIRTs but no single source lists every team. Most of the major and long established teams (the first CSIRT was founded in 1988) are nowadays members of FIRST, the worldwide Forum of Incident Response and Security Teams. At the time of writing, more than 55 teams are members (1 in Australia, 13 in Europe, all others in North America). Information about FIRST can be found:",
      "ja": "今日では、そこに多くの異なったのCSIRTがありますが、単一のソースは、すべてのチームが一覧表示されますありません。メジャーと老舗チーム（CSIRT最初は1988年に設立された）のほとんどは、今日FIRST、インシデント対応とセキュリティチームの世界的なフォーラムのメンバーです。執筆時点では、55以上のチームがメンバー（オーストラリアの1、欧州では13、北米の他のすべて）です。 FIRSTに関する情報は見つけることができます："
    },
    {
      "indent": 3,
      "text": "- http://www.first.org/",
      "ja": "ー ｈっｔｐ：／／ｗっｗ。ふぃｒｓｔ。おｒｇ／"
    },
    {
      "indent": 3,
      "text": "The current list of members is available also, with the relevant contact information and some additional information provided by the particular teams:",
      "ja": "メンバーの現在のリストは、関連する連絡先情報や特定のチームによって提供されるいくつかの付加的な情報でも提供されています："
    },
    {
      "indent": 3,
      "text": "- http://www.first.org/team-info/",
      "ja": "ー ｈっｔｐ：／／ｗっｗ。ふぃｒｓｔ。おｒｇ／てあｍーいんふぉ／"
    },
    {
      "indent": 3,
      "text": "For CSIRTs which want to become members of this forum (please note that a team needs a sponsor - a team which is already a full member of FIRST - to be introduced), the following files contain more information:",
      "ja": "このフォーラムのメンバーになりたいのCSIRTのために（チームはスポンサーが必要であることに注意してください - すでにFIRSTのフルメンバーでチームを - 導入されるように）、以下のファイルは、より多くの情報が含まれています。"
    },
    {
      "indent": 3,
      "text": "- http://www.first.org/about/op_frame.html The Operational Framework of FIRST.",
      "ja": " -  http://www.first.org/about/op_frame.html FIRSTの運営体制。"
    },
    {
      "indent": 3,
      "text": "- http://www.first.org/docs/newmem.html Guidelines for teams which want to become members of FIRST.",
      "ja": " -  http://www.first.org/docs/newmem.html FIRSTのメンバーになりたいチームのためのガイドライン。"
    },
    {
      "indent": 3,
      "text": "Many of the European teams, regardless of whether they are members of FIRST or not, are listed by countries on a page maintained by the German CSIRT:",
      "ja": "ヨーロッパのチームの多くは、関係なく、彼らが最初かどうかのメンバーであるかどうかの、ドイツのCSIRTによって維持ページに国によって記載されています："
    },
    {
      "indent": 3,
      "text": "- http://www.cert.dfn.de/eng/csir/europe/certs.html",
      "ja": "ー ｈっｔｐ：／／ｗっｗ。せｒｔ。ｄｆん。で／えんｇ／ｃしｒ／えうろぺ／せｒｔｓ。ｈｔｍｌ"
    },
    {
      "indent": 3,
      "text": "To learn about existing teams suitable to one's needs it is often helpful to ask either known teams or an Internet Service Provider for the \"right\" contact.",
      "ja": "自分のニーズに適した既存のチームについて学ぶためには、多くの場合、既知のチームまたは「右」の接触のためのインターネット・サービス・プロバイダのいずれかを尋ねると便利です。"
    },
    {
      "indent": 0,
      "text": "Appendix D: Outline for CSIRT Template",
      "ja": "付録D：CSIRTテンプレートの概要"
    },
    {
      "indent": 3,
      "text": "This outline summarizes in point form the issues addressed in this document, and is the recommended template for a CSIRT description document. Its structure is designed to facilitate the communication of a CSIRT's policies, procedures, and other relevant information to its constituency and to outside organizations such as other CSIRTs. A 'filled-in' example of this template is given as Appendix E.",
      "ja": "この概要は、本書で扱わ問題を形成する点に要約して、CSIRT記述文書に推奨されるテンプレートです。その構造は、その選挙区に及び、そのような他のCSIRTなど外部組織へのCSIRTの方針、手順、およびその他の関連情報の通信を容易にするように設計されています。このテンプレートの「塗りつぶされた」の例は、付録Eのように与えられます"
    },
    {
      "indent": 6,
      "text": "1. Document Information 1.1 Date of Last Update 1.2 Distribution List for Notifications 1.3 Locations where this Document May Be Found",
      "ja": "この文書は見つけることができる。1.ドキュメント情報の通知1.3場所のための最終更新1.2配布リストの1.1日"
    },
    {
      "indent": 6,
      "text": "2. Contact Information 2.1 Name of the Team 2.2 Address 2.3 Time Zone 2.4 Telephone Number 2.5 Facsimile Number 2.6 Other Telecommunication 2.7 Electronic Mail Address 2.8 Public Keys and Encryption Information 2.9 Team Members 2.10 Other Information 2.11 Points of Customer Contact",
      "ja": "チームの2.連絡先情報2.1名前2.2住所2.3タイムゾーン2.4電話番号2.5ファクシミリ番号2.6その他の通信2.7電子メールが2.9チームメンバー顧客接点の2.10その他の情報2.11ポイント2.8公開鍵と暗号化アドレス情報"
    },
    {
      "indent": 6,
      "text": "3. Charter 3.1 Mission Statement 3.2 Constituency 3.3 Sponsorship and/or Affiliation 3.4 Authority",
      "ja": "3.チャーター3.1理念3.2部会3.3スポンサー及び/又は所属3.4オーソリティ"
    },
    {
      "indent": 6,
      "text": "4. Policies 4.1 Types of Incidents and Level of Support 4.2 Co-operation, Interaction and Disclosure of Information 4.3 Communication and Authentication",
      "ja": "4.ポリシーインシデントおよび情報4.3コミュニケーションと認証のサポート4.2協力、相互作用と情報開示のレベルの4.1タイプ"
    },
    {
      "indent": 6,
      "text": "5. Services 5.1 Incident Response 5.1.1. Incident Triage 5.1.2. Incident Coordination 5.1.3. Incident Resolution 5.2 Proactive Activities",
      "ja": "5.サービス5.1インシデント対応5.1.1。インシデントトリアージ5.1.2。インシデントコーディネーション5.1.3。インシデントの解決5.2積極的な取り組み"
    },
    {
      "indent": 6,
      "text": "6. Incident Reporting Forms",
      "section_title": true,
      "ja": "6.インシデント報告フォーム"
    },
    {
      "indent": 6,
      "text": "7. Disclaimers",
      "section_title": true,
      "ja": "7.免責事項"
    },
    {
      "indent": 0,
      "text": "Appendix E: Example - 'filled-in' Template for a CSIRT",
      "ja": "付録E：例 -  CSIRTのための「満たされたイン」のテンプレート"
    },
    {
      "indent": 3,
      "text": "Below is an example of a filled-in template for a fictitious CSIRT called XYZ-CSIRT. This text is for example purposes only, and does not constitute endorsement by the working group or the IETF of any particular set of procedures or policies. While CSIRTs are welcome to use any or all of this text if they wish, such use is of course not mandatory, or even appropriate in most cases.",
      "ja": "以下XYZ-CSIRTと呼ばれる架空のCSIRTのために充填されたインテンプレートの例です。このテキストは、例示の目的のためであり、作業グループまたは手順またはポリシーの任意の特定のセットのIETFによって是認するものではありません。 CSIRTは、このテキストの一部またはすべてを使用して大歓迎ですが、彼らが望むなら、そのような使用は、ほとんどの場合、当然の義務、あるいは適切ではありません。"
    },
    {
      "indent": 0,
      "text": "CSIRT Description for XYZ-CERT\n-----------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "1. About this document",
      "section_title": true,
      "ja": "この文書について1。"
    },
    {
      "indent": 3,
      "text": "1.1 Date of Last Update",
      "section_title": true,
      "ja": "最終更新日の1.1日"
    },
    {
      "indent": 8,
      "text": "This is version 1.01, published 1997/03/31.",
      "ja": "これは1997年3月31日に公開、バージョン1.01です。"
    },
    {
      "indent": 3,
      "text": "1.2 Distribution List for Notifications",
      "section_title": true,
      "ja": "通知の1.2配布リスト"
    },
    {
      "indent": 8,
      "text": "Notifications of updates are submitted to our mailing list\n<xyz-cert-info@xyz-univ.ca>.  Subscription requests for this\nlist should be sent to the Majordomo at\n<xyz-cert-info-request@xyz-univ.ca>; the body of the message\nshould consist of the word \"subscribe\".  Send the word \"help\"\ninstead if you don't know how to use a Majordomo list manager.\nThis mailing list is moderated.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "1.3 Locations where this Document May Be Found",
      "section_title": true,
      "ja": "この文書は見つけることができる場所1.3"
    },
    {
      "indent": 8,
      "text": "The current version of this CSIRT description document is\navailable from the XYZ-CERT WWW site; its URL is\n  http://www.xyz-univ.ca/xyz-cert/english/CSIRT-descr.txt\nUne version francaise de ce document est igalement disponible:\n  http://www.xyz-univ.ca/xyz-cert/francais/CSIRT-descr.txt\nPlease make sure you are using the latest version.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "1.4 Authenticating this Document",
      "section_title": true,
      "ja": "1.4この文書を認証"
    },
    {
      "indent": 8,
      "text": "Both the English and French versions of this document have\nbeen signed with the XYZ-CERT's PGP key.  The signatures are\nalso on our Web site, under:\n  http://www.xyz-univ.ca/xyz-cert/english/CSIRT-descr.asc\n  http://www.xyz-univ.ca/xyz-cert/francais/CSIRT-descr.asc",
      "raw": true
    },
    {
      "indent": 3,
      "text": "2. Contact Information",
      "section_title": true,
      "ja": "2.連絡先情報"
    },
    {
      "indent": 3,
      "text": "2.1 Name of the Team",
      "section_title": true,
      "ja": "チームの名前2.1"
    },
    {
      "indent": 8,
      "text": "\"XYZ-CERT\": the XYZ University Computer Emergency Response\nTeam.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "2.2 Address",
      "section_title": true,
      "ja": "2.2住所"
    },
    {
      "indent": 8,
      "text": "XYZ-CERT\nXYZ University, Computing Services Department\n12345 Rue Principale\nUniversityTown, Quebec\nCanada H0H 0H0",
      "raw": true
    },
    {
      "indent": 3,
      "text": "2.3 Time Zone",
      "section_title": true,
      "ja": "2.3タイムゾーン"
    },
    {
      "indent": 8,
      "text": "Canada/Eastern (GMT-0500, and GMT-0400 from April to October)",
      "ja": "（4月から10月までGMT-0500、およびGMT-0400）カナダ/東"
    },
    {
      "indent": 3,
      "text": "2.4 Telephone Number",
      "section_title": true,
      "ja": "2.4電話番号"
    },
    {
      "indent": 8,
      "text": "+1 234 567 7890 (ask for the XYZ-CERT)",
      "ja": "+1 234 567 7890（XYZ-CERTを求めます）"
    },
    {
      "indent": 3,
      "text": "2.5 Facsimile Number",
      "section_title": true,
      "ja": "2.5ファクシミリ番号"
    },
    {
      "indent": 8,
      "text": "+1 234 567 7899 (this is *not* a secure fax)",
      "ja": "+1 234 567 7899（これは*ありません*安全なファックスです）"
    },
    {
      "indent": 3,
      "text": "2.6 Other Telecommunication",
      "section_title": true,
      "ja": "2.6その他の電気通信"
    },
    {
      "indent": 8,
      "text": "None available.",
      "ja": "利用可能なし。"
    },
    {
      "indent": 3,
      "text": "2.7 Electronic Mail Address",
      "section_title": true,
      "ja": "2.7電子メールアドレス"
    },
    {
      "indent": 8,
      "text": "<xyz-cert@xyz-univ.ca>  This is a mail alias that relays mail\nto the human(s) on duty for the XYZ-CERT.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "2.8 Public Keys and Other Encryption Information",
      "section_title": true,
      "ja": "2.8公開鍵とその他の暗号化情報"
    },
    {
      "indent": 8,
      "text": "The XYZ-CERT has a PGP key, whose KeyID is 12345678 and\nwhose fingerprint is\n  11 22 33 44 55 66 77 88  88 77 66 55 44 33 22 11.\nThe key and its signatures can be found at the usual large\npublic keyservers.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Because PGP is still a relatively new technology at XYZ University, this key still has relatively few signatures; efforts are underway to increase the number of links to this key in the PGP \"web of trust\". In the meantime, since most fellow universities in Quebec have at least one staff member who knows the XYZ-CERT coordinator Zoe Doe, Zoe Doe has signed the XYZ-CERT key, and will be happy to confirm its fingerprint and that of her own key to those people who know her, by telephone or in person.",
      "ja": "PGPは、XYZ大学でまだ比較的新しい技術であるため、このキーはまだ比較的少数の署名を持っています。努力はPGP「信頼のウェブ」でこのキーへのリンクの数を増やすことが進行中です。ケベック州のほとんどの仲間の大学はXYZ-CERTコーディネーターゾーイドウを知っている少なくとも一つのスタッフを持っているので、その間に、ゾーイDoeがXYZ-CERTキーを締結しており、その指紋を確認させていただきますと、彼女自身の鍵のこと電話または人で、彼女を知っている人に。"
    },
    {
      "indent": 3,
      "text": "2.9 Team Members",
      "section_title": true,
      "ja": "2.9チームメンバー"
    },
    {
      "indent": 8,
      "text": "Zoe Doe of Computing Services is the XYZ-CERT coordinator.\nBackup coordinators and other team members, along with their\nareas of expertise and contact information, are listed in the\nXYZ-CERT web pages, at\n  http://www.xyz-univ.ca/xyz-cert/teamlist.html",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Management, liaison and supervision are provided by Steve Tree, Assistant Director (Technical Services), Computing Services.",
      "ja": "管理、リエゾンと監督はスティーブ・ツリー、アシスタントディレクター（技術サービス）、コンピューティングサービスによって提供されています。"
    },
    {
      "indent": 3,
      "text": "2.10 Other Information",
      "section_title": true,
      "ja": "2.10その他の情報"
    },
    {
      "indent": 8,
      "text": "General information about the XYZ-CERT, as well as links to\nvarious recommended security resources, can be found at\n  http://www.xyz-univ.ca/xyz-cert/index.html",
      "raw": true
    },
    {
      "indent": 3,
      "text": "2.11 Points of Customer Contact",
      "section_title": true,
      "ja": "顧客接点の2.11ポイント"
    },
    {
      "indent": 8,
      "text": "The preferred method for contacting the XYZ-CERT is via\ne-mail at <xyz-cert@xyz-univ.ca>; e-mail sent to this address\nwill \"biff\" the responsible human, or be automatically\nforwarded to the appropriate backup person, immediately.  If\nyou require urgent assistance, put \"urgent\" in your subject\nline.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "If it is not possible (or not advisable for security reasons) to use e-mail, the XYZ-CERT can be reached by telephone during regular office hours. Telephone messages are checked less often than e-mail.",
      "ja": "それは、電子メールを使用することが可能（またはセキュリティ上の理由からお勧めできません）されていない場合、XYZ-CERTは、通常の営業時間中に電話で到達することができます。電話メッセージは、電子メールよりも頻繁にチェックされます。"
    },
    {
      "indent": 8,
      "text": "The XYZ-CERT's hours of operation are generally restricted to regular business hours (09:00-17:00 Monday to Friday except holidays).",
      "ja": "操作のXYZ-CERTの時間は、一般的に通常の営業時間（00月曜日〜金曜日祝日を除く：00-17 09）に制限されています。"
    },
    {
      "indent": 8,
      "text": "If possible, when submitting your report, use the form mentioned in section 6.",
      "ja": "可能であれば、レポートを提出する際、セクション6で述べた形式を使用します。"
    },
    {
      "indent": 3,
      "text": "3. Charter",
      "section_title": true,
      "ja": "3.憲章"
    },
    {
      "indent": 3,
      "text": "3.1 Mission Statement",
      "section_title": true,
      "ja": "3.1ミッションステートメント"
    },
    {
      "indent": 8,
      "text": "The purpose of the XYZ-CERT is, first, to assist members of XYZ\nUniversity community in implementing proactive measures to\nreduce the risks of computer security incidents, and second, to\nassist XYZ community in responding to such incidents when they\noccur.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "3.2 Constituency",
      "section_title": true,
      "ja": "3.2選挙"
    },
    {
      "indent": 8,
      "text": "The XYZ-CERT's constituency is the XYZ University community,\nas defined in the context of the \"XYZ University Policy on\nComputing Facilities\".  This policy is available at\n  http://www-compserv.xyz-univ.ca/policies/pcf.html",
      "raw": true
    },
    {
      "indent": 8,
      "text": "However, please note that, notwithtanding the above, XYZ-CERT services will be provided for on-site systems only.",
      "ja": "しかし、上記のnotwithtanding、XYZ-CERTサービスのみオンサイトシステムのために提供される、ということに注意してください。"
    },
    {
      "indent": 3,
      "text": "3.3 Sponsorship and/or Affiliation",
      "section_title": true,
      "ja": "3.3スポンサーシップ及び/又は所属"
    },
    {
      "indent": 8,
      "text": "The XYZ-CERT is sponsored by the ACME Canadian Research\nNetwork.  It maintains affiliations with various University\nCSIRTs throughout Canada and the USA on an as needed basis.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "3.4 Authority",
      "section_title": true,
      "ja": "3.4権限"
    },
    {
      "indent": 8,
      "text": "The XYZ-CERT operates under the auspices of, and with authority\ndelegated by, the Department of Computing Services of XYZ\nUniversity.  For further information on the mandate and\nauthority of the Department of Computing Services, please\nrefer to the XYZ University \"Policy on Computing Facilities\",\navailable at\n  http://www-compserv.xyz-univ.ca/policies/pcf.html",
      "raw": true
    },
    {
      "indent": 8,
      "text": "The XYZ-CERT expects to work cooperatively with system administrators and users at XYZ University, and, insofar as possible, to avoid authoritarian relationships. However, should circumstances warrant it, the XYZ-CERT will appeal to Computing Services to exert its authority, direct or indirect, as necessary. All members of the XYZ-CERT are members of the CCSA (Committee of Computer Systems Administrators), and have all of the powers and responsibilities assigned to Systems Administrators by the Policy on Computing Facilities, or are members of University management.",
      "ja": "XYZ-CERTは、権威の関係を避けるために、できるだけ限り、XYZ大学のシステム管理者やユーザーと協力して作業する予定、と。しかし、状況がそれを正当化する必要があり、XYZ-CERTは、必要に応じて、直接または間接的に、その権限を行使するためにコンピューティングサービスにアピールします。 XYZ-CERTのすべてのメンバーは、CCSA（コンピュータシステム管理者の委員会）のメンバーである、とコンピューティング施設に関するポリシーによりシステム管理者に割り当てられた権限と責任のすべてを持っているか、大学の管理のメンバーです。"
    },
    {
      "indent": 8,
      "text": "Members of the XYZ University community who wish to appeal the actions of the XYZ-CERT should contact the Assistant Director (Technical Services), Computing Services. If this recourse is not satisfactory, the matter may be referred to the Director of Computing Services (in the case of perceived problems with existing policy), or to the XYZ University Office of Rights and Responsibilities (in the case of perceived errors in the application of existing policy).",
      "ja": "XYZ-CERTの行動をアピールしたいXYZ大学のコミュニティのメンバーは、アシスタントディレクター（技術サービス）、コンピューティングサービスにお問い合わせください。このリコースが十分でない場合は、問題は、（既存のポリシーと認識される問題が発生した場合には）コンピューティングサービスのディレクターと呼ばれることも、またはアプリケーションで認識されるエラーが発生した場合の権利と責任（XYZの大学オフィスへ）既存のポリシーの。"
    },
    {
      "indent": 3,
      "text": "4. Policies",
      "section_title": true,
      "ja": "4.ポリシー"
    },
    {
      "indent": 3,
      "text": "4.1 Types of Incidents and Level of Support",
      "section_title": true,
      "ja": "インシデントとサポートのレベルの4.1タイプ"
    },
    {
      "indent": 8,
      "text": "The XYZ-CERT is authorized to address all types of computer\nsecurity incidents which occur, or threaten to occur, at\nXYZ University.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "The level of support given by XYZ-CERT will vary depending on the type and severity of the incident or issue, the type of constituent, the size of the user community affected, and the XYZ-CERT's resources at the time, though in all cases some response will be made within one working day. Resources will be assigned according to the following priorities, listed in decreasing order:",
      "ja": "XYZ-CERTによって与えられたサポートのレベルは、しかし、すべての場合には、一度にタイプと重大インシデントまたは問題の、構成​​要素の種類、影響を受けたユーザーコミュニティの大きさ、およびXYZ-CERTのリソースによって異なりますいくつかの応答は、1営業日以内とさせていただきます。リソースが順に記載されている次の優先順位に従って割り当てられます。"
    },
    {
      "indent": 10,
      "text": "- Threats to the physical safety of human beings. - Root or system-level attacks on any Management Information System, or any part of the backbone network infrastructure. - Root or system-level attacks on any large public service machine, either multi-user or dedicated-purpose. - Compromise of restricted confidential service accounts or software installations, in particular those used for MIS applications containing confidential data, or those used for system administration. - Denial of service attacks on any of the above three items. - Any of the above at other sites, originating from XYZ University. - Large-scale attacks of any kind, e.g. sniffing attacks, IRC \"social engineering\" attacks, password cracking attacks. - Threats, harassment, and other criminal offenses involving individual user accounts. - Compromise of individual user accounts on multi-user systems. - Compromise of desktop systems. - Forgery and misrepresentation, and other security-related violations of local rules and regulations, e.g. netnews and e-mail forgery, unauthorized use of IRC bots.",
      "ja": " - 人間の身体の安全に対する脅威。 - ルートまたは管理情報システム上のシステム・レベルの攻撃、またはバックボーンネットワークインフラストラクチャの一部。 - ルートまたは任意の大規模な公共サービス・マシン上のシステム・レベルの攻撃、マルチユーザまたは専用目的のいずれか。 - 特に制限された機密サービスアカウントまたはソフトウェアのインストールの侵害、機密データを含むMISアプリケーションのために使用されるもの、またはシステム管理のために使用されるもの。 - 上記の3つの項目のいずれかにサービス妨害攻撃。 - 他のサイトで上記のいずれも、XYZ大学から発信。 - あらゆる種類の大規模な攻撃、例えば盗聴攻撃、IRC「ソーシャルエンジニアリング」攻撃、パスワードクラッキング攻撃。 - 脅威、嫌がらせ、および個々のユーザーアカウントを含む他の刑事犯罪。 - マルチユーザシステム上の個々のユーザアカウントの妥協。 - デスクトップシステムの妥協。 - 偽造や詐称、およびローカル規則および規制の他のセキュリティ関連の違反、例えばネットニュースや電子メールの偽造、IRCボットの不正使用。"
    },
    {
      "indent": 10,
      "text": "- Denial of service on individual user accounts, e.g. mailbombing.",
      "ja": " - 個々のユーザーアカウント、例えば上のサービス拒否メール爆弾。"
    },
    {
      "indent": 8,
      "text": "Types of incidents other than those mentioned above will be prioritized according to their apparent severity and extent.",
      "ja": "上記以外のインシデントの種類は、その見かけの重症度および程度に応じて優先順位付けされます。"
    },
    {
      "indent": 8,
      "text": "Note that no direct support will be given to end users; they are expected to contact their system administrator, network administrator, or department head for assistance. The XYZ-CERT will support the latter people.",
      "ja": "直接サポートは、エンドユーザーに与えられないことに注意してください。彼らは支援のために彼らのシステム管理者、ネットワーク管理者、または部門長に連絡することが期待されています。 XYZ-CERTは、後者の人々をサポートしています。"
    },
    {
      "indent": 8,
      "text": "While the XYZ-CERT understands that there exists great variation in the level of system administrator expertise at XYZ University, and while the XYZ-CERT will endeavor to present information and assistance at a level appropriate to each person, the XYZ-CERT cannot train system administrators on the fly, and it cannot perform system maintenance on their behalf. In most cases, the XYZ-CERT will provide pointers to the information needed to implement appropriate measures.",
      "ja": "XYZ-CERTがXYZ大学のシステム管理者の専門知識のレベルに大きな変動が存在し、XYZ-CERTは、一人一人に適切なレベルの情報と支援を提供するよう努力する一方、XYZ-CERTは、システムをトレーニングすることができないことを理解しているもののその場で、管理者、およびそれが彼らに代わって、システムのメンテナンスを実行することはできません。ほとんどの場合、XYZ-CERTは、適切な対策を実施するために必要な情報へのポインタを提供します。"
    },
    {
      "indent": 8,
      "text": "The XYZ-CERT is committed to keeping the XYZ University system administration community informed of potential vulnerabilities, and where possible, will inform this community of such vulnerabilities before they are actively exploited.",
      "ja": "XYZ-CERTは、潜在的な脆弱性を知らさXYZ大学のシステム管理コミュニティを維持することを約束され、可能な場合、彼らは積極的に活用される前に、そのような脆弱性のこのコミュニティに通知します。"
    },
    {
      "indent": 3,
      "text": "4.2 Co-operation, Interaction and Disclosure of Information",
      "section_title": true,
      "ja": "4.2協力、相互作用と情報の開示"
    },
    {
      "indent": 8,
      "text": "While there are legal and ethical restrictions on the flow of\ninformation from XYZ-CERT, many of which are also outlined in\nthe XYZ University Policy on Computing Facilities, and all of\nwhich will be respected, the XYZ-CERT acknowledges its\nindebtedness to, and declares its intention to contribute to,\nthe spirit of cooperation that created the Internet.\nTherefore, while appropriate measures will be taken to protect\nthe identity of members of our constituency and members of\nneighbouring sites where necessary, the XYZ-CERT will otherwise\nshare information freely when this will assist others in\nresolving or preventing security incidents.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "In the paragraphs below, \"affected parties\" refers to the legitimate owners, operators, and users of the relevant computing facilities. It does not refer to unauthorized users, including otherwise authorized users making unauthorized use of a facility; such intruders may have no expectation of confidentiality from the XYZ-CERT. They may or may not have legal rights to confidentiality; such rights will of course be respected where they exist.",
      "ja": "以下の段落では、「影響を受けた当事者は、」関連するコンピューティング施設の正当な所有者、オペレーター、およびユーザーを指します。これは、施設の不正使用を作るそうでない場合は、許可されたユーザーを含む権限のないユーザー、を指すものではありません。そのような侵入者はXYZ-CERTから機密性のない期待を持たないことがあります。彼らはや機密性への法的権利を持っていない場合があります。彼らが存在する場合、そのような権利は、もちろん尊敬されます。"
    },
    {
      "indent": 8,
      "text": "Information being considered for release will be classified as follows:",
      "ja": "次のようにリリースのために検討されている情報は、分類されます。"
    },
    {
      "indent": 10,
      "text": "- Private user information is information about particular users, or in some cases, particular applications, which must be considered confidential for legal, contractual, and/or ethical reasons.",
      "ja": " - プライベートユーザー情報は、法的契約、および/または倫理的な理由のために機密扱いされている必要があり、特定のユーザー、またはいくつかのケースでは、特定のアプリケーションに関する情報です。"
    },
    {
      "indent": 12,
      "text": "Private user information will be not be released in identifiable form outside the XYZ-CERT, except as provided for below. If the identity of the user is disguised, then the information can be released freely (for example to show a sample .cshrc file as modified by an intruder, or to demonstrate a particular social engineering attack).",
      "ja": "プライベートユーザ情報は、以下のために提供される以外は、XYZ-CERT外側に識別形で放出されないであろう。ユーザーの身元を偽装している場合は、その情報は、（侵入者によって変更されたサンプルの.cshrcファイルを表示するために、または特定のソーシャルエンジニアリング攻撃を実証するなど）を自由に解放することができます。"
    },
    {
      "indent": 10,
      "text": "- Intruder information is similar to private user information, but concerns intruders.",
      "ja": " - 侵入者の情報は、専用のユーザ情報に似ていますが、懸念の侵入者。"
    },
    {
      "indent": 12,
      "text": "While intruder information, and in particular identifying information, will not be released to the public (unless it becomes a matter of public record, for example because criminal charges have been laid), it will be exchanged freely with system administrators and CSIRTs tracking an incident.",
      "ja": "（それは刑事責任が敷設されているため、例えば、公的記録の問題とならない限り）、特定の識別情報に侵入者情報は、一般に公開されることはありませんが、それが入射する追跡システム管理者とのCSIRTと自由に交換されます。"
    },
    {
      "indent": 10,
      "text": "- Private site information is technical information about particular systems or sites.",
      "ja": " - プライベートサイトの情報は、特定のシステムやサイトに関する技術的な情報です。"
    },
    {
      "indent": 12,
      "text": "It will not be released without the permission of the site in question, except as provided for below.",
      "ja": "これは、以下のために提供されるもの以外、問題のサイトの許可を得ずにリリースされることはありません。"
    },
    {
      "indent": 10,
      "text": "- Vulnerability information is technical information about vulnerabilities or attacks, including fixes and workarounds.",
      "ja": " - 脆弱性情報は、修正や回避方法などの脆弱性や攻撃に関する技術的な情報です。"
    },
    {
      "indent": 12,
      "text": "Vulnerability information will be released freely, though every effort will be made to inform the relevant vendor before the general public is informed.",
      "ja": "あらゆる努力は、一般市民が知らされる前に、関連するベンダーに通知するために行われるものの、脆弱性情報は、自由にリリースされます。"
    },
    {
      "indent": 10,
      "text": "- Embarrassing information includes the statement that an incident has occurred, and information about its extent or severity. Embarrassing information may concern a site or a particular user or group of users.",
      "ja": " - 恥ずかしい情報は、インシデントが発生したことを声明し、その程度又は重症度についての情報を含みます。恥ずかしいの情報は、サイトやユーザーの特定のユーザーまたはグループに関係があります。"
    },
    {
      "indent": 12,
      "text": "Embarrassing information will not be released without the permission of the site or users in question, except as provided for below.",
      "ja": "恥ずかしいの情報は以下のために提供されるもの以外、問題のサイトやユーザーの許可なしに解放されることはありません。"
    },
    {
      "indent": 10,
      "text": "- Statistical information is embarrassing information with the identifying information stripped off.",
      "ja": " - 統計情報を剥離識別情報と恥ずかしい情報です。"
    },
    {
      "indent": 12,
      "text": "Statistical information will be released at the discretion of the Computing Services Department.",
      "ja": "統計情報は、コンピューティングサービス部門の裁量でリリースされます。"
    },
    {
      "indent": 10,
      "text": "- Contact information explains how to reach system administrators and CSIRTs.",
      "ja": " - 連絡先情報は、システム管理者とのCSIRTに到達する方法について説明します。"
    },
    {
      "indent": 12,
      "text": "Contact information will be released freely, except where the contact person or entity has requested that this not be the case, or where XYZ-CERT has reason to believe that the dissemination of this information would not be appreciated.",
      "ja": "連絡先情報は、連絡先の個人または団体が、このようなケースではないことを要求している、またはXYZ-CERTはこの情報の普及が理解されるではないだろうと信じる理由を有する場合場合を除いて、自由にリリースされます。"
    },
    {
      "indent": 8,
      "text": "Potential recipients of information from the XYZ-CERT will be classified as follows:",
      "ja": "以下のようにXYZ-CERTからの情報の潜在的な受信者が分類されます。"
    },
    {
      "indent": 8,
      "text": "- Because of the nature of their responsibilities and consequent expectations of confidentiality, members of XYZ University management are entitled to receive whatever information is necessary to facilitate the handling of computer security incidents which occur in their jurisdictions.",
      "ja": " - そのため彼らの責任と守秘義務の結果としての期待の性質上、XYZ大学の管理のメンバーは、その管轄区域で発生するコンピュータセキュリティインシデントの取り扱いを容易にするために必要なあらゆる情報受領する権利をされています。"
    },
    {
      "indent": 8,
      "text": "- Members of the Office of Rights and Responsibilities are entitled to receive whatever information they request concerning a computer security incident or related matter which has been referred to them for resolution. The same is true for the XYZ Security Department, when its assistance in an investigation has been enlisted, or when the investigation has been instigated at its request.",
      "ja": " - 権利と責任の事務所のメンバーは、それらがコンピュータセキュリティインシデントや解像度のためにそれらを参照された関連問題に関する要請どんな情報受領する権利をされています。同じことが、調査での援助が入隊された、または調査はその要求に扇動されたときとき、XYZセキュリティ部門についても同様です。"
    },
    {
      "indent": 8,
      "text": "- System administrators at XYZ University who are members of the CCSA are also, by virtue of their responsibilities, trusted with confidential information. However, unless such people are also members of XYZ-CERT, they will be given only that confidential information which they must have in order to assist with an investigation, or in order to secure their own systems.",
      "ja": " -  CCSAのメンバーであるXYZ大学のシステム管理者は、その責任のおかげで、機密情報で信頼されています。そのような人々はまた、XYZ-CERTのメンバーでない限り、しかし、彼らは捜査を支援するために、または自分のシステムを確保するために持っている必要がありますだけで、機密情報が与えられます。"
    },
    {
      "indent": 8,
      "text": "- Users at XYZ University are entitled to information which pertains to the security of their own computer accounts, even if this means revealing \"intruder information\", or \"embarrassing information\" about another user. For example, if account aaaa is cracked and the intruder attacks account bbbb, user bbbb is entitled to know that aaaa was cracked, and how the attack on the bbbb account was executed. User bbbb is also entitled, if she or he requests it, to information about account aaaa which might enable bbbb to investigate the attack. For example, if bbbb was attacked by someone remotely connected to aaaa, bbbb should be told the provenance of the connections to aaaa, even though this information would ordinarily be considered private to aaaa. Users at XYZ University are entitled to be notified if their account is believed to have been compromised.",
      "ja": " -  XYZ大学のユーザーは、これは明らかに「侵入者情報」、または別のユーザーに関する「恥ずかしい情報」を意味していても、自分のコンピュータアカウントのセキュリティに関係する情報を受けることができます。アカウントAAAAが割れや侵入者の攻撃はBBBBを占めている場合たとえば、ユーザーBBBBはAAAAが割れたことを知っている権利がある、とBBBBアカウントへの攻撃がどのように実行されました。彼女または彼が攻撃を調査するBBBBを可能にするかもしれないアカウントAAAAについての情報を、それを要求した場合、ユーザBBBBも、権利があります。 BBBBがリモートAAAAに接続され、誰かに襲われた場合、例えば、BBBBは、この情報は通常、AAAAにプライベートと考えられるにもかかわらず、AAAAへの接続の出所を告げする必要があります。 XYZ大学で、ユーザーは自分のアカウントが侵害されたと考えられている場合に通知する権利があります。"
    },
    {
      "indent": 8,
      "text": "- The XYZ University community will receive no restricted information, except where the affected parties have given permission for the information to be disseminated. Statistical information may be made available to the general XYZ community. There is no obligation on the part of the XYZ-CERT to report incidents to the community, though it may choose to do so; in particular, it is likely that the XYZ-CERT will inform all affected parties of the ways in which they were affected, or will encourage the affected site to do so.",
      "ja": " -  XYZ大学のコミュニティは、影響を受けた当事者が普及する情報のための許可を与えている場合を除いて、何の制限された情報を受け取りません。統計情報は、一般的なXYZコミュニティに利用できるようにすることができます。それはそうすることを選択するかもしれませんが、コミュニティに事件を報告するXYZ-CERTの一部の義務はありません。特に、XYZ-CERTは、彼らが影響を受けた、またはそうするように影響を受けたサイトを奨励するする方法の影響を受けるすべての関係者に通知する可能性があります。"
    },
    {
      "indent": 8,
      "text": "- The public at large will receive no restricted information. In fact, no particular effort will be made to communicate with the public at large, though the XYZ-CERT recognizes that, for all intents and purposes, information made available to the XYZ University community is in effect made available to the community at large, and will tailor the information in consequence.",
      "ja": " - 一般大衆には制限された情報を受け取りません。 XYZ-CERTは、すべての意図や目的のために、XYZ大学のコミュニティに利用可能な情報が有効で広く社会に利用可能になる、ということを認識しても実際には、特段の努力は、広く一般に通信するために行われることはありませんそしてその結果に情報を調整します。"
    },
    {
      "indent": 8,
      "text": "- The computer security community will be treated the same way the general public is treated. While members of XYZ-CERT may participate in discussions within the computer security community, such as newsgroups, mailing lists (including the full-disclosure list \"bugtraq\"), and conferences, they will treat such forums as though they were the public at large. While technical issues (including vulnerabilities) may be discussed to any level of detail, any examples taken from XYZ-CERT experience will be disguised to avoid identifying the affected parties.",
      "ja": " - コンピュータセキュリティコミュニティは、一般市民が治療されているのと同じように扱われます。 XYZ-CERTのメンバーは、ニュースグループ、（フル公開リスト「バグ追跡」を含む）メーリングリスト、および会議などのコンピュータセキュリティコミュニティ内での議論に参加することができるが、彼らは一般大衆であるかのように、彼らは、このようなフォーラムを扱います。 （脆弱性を含む）の技術的な問題の詳細の任意のレベルに議論することができるが、XYZ-CERTの経験から採取した任意の実施例は、影響を受ける当事者を識別回避するために偽装します。"
    },
    {
      "indent": 8,
      "text": "- The press will also be considered as part of the general public. The XYZ-CERT will not interact directly with the Press concerning computer security incidents, except to point them toward information already released to the general public. If necessary, information will be provided to the XYZ University Public Relations Department, and to the Customer Relations group of the Computing Services Department. All incident-related queries will be referred to these two bodies. The above does not affect the ability of members of XYZ-CERT to grant interviews on general computer security topics; in fact, they are encouraged to do to, as a public service to the community.",
      "ja": " - キーを押しても、一般市民の一部とみなされます。すでに一般向けにリリースされた情報に向かって、それらをポイントする以外XYZ-CERTは、コンピュータセキュリティインシデントに関するプレスと直接対話しません。必要であれば、情報はXYZ大学広報部へ、およびコンピューティングサービス部門の顧客関係グループに提供されます。すべての事件に関連したクエリは、これら二つの物体と呼ぶことにします。上記の一般的なコンピュータセキュリティの話題についてのインタビューを付与するXYZ-CERTのメンバーの能力には影響を与えません。実際に、彼らはコミュニティへの公共サービスとして、を行うことを奨励されています。"
    },
    {
      "indent": 8,
      "text": "- Other sites and CSIRTs, when they are partners in the investigation of a computer security incident, will in some cases be trusted with confidential information. This will happen only if the foreign site's bona fide can be verified, and the information transmitted will be limited to that which is likely to be helpful in resolving the incident. Such information sharing is most likely to happen in the case of sites well known to XYZ-CERT (for example, several other Quebec universities have informal but well-established working relationships with XYZ University in such matters).",
      "ja": " - 彼らは、コンピュータセキュリティインシデントの調査におけるパートナーであるとき、他のサイトとのCSIRT、いくつかのケースでは、機密情報で信頼されます。これは外国のサイトの善意を検証することができ、かつ送信された情報は、事件を解決するのに役立つ可能性があるものに限定される場合にのみ発生します。このような情報共有がうまくXYZ-CERTに知られているサイトの場合に起こる可能性が最も高い（例えば、他のいくつかのケベック州の大学は、このような事項のXYZ大学との非公式が、十分に確立協力関係を持っています）。"
    },
    {
      "indent": 10,
      "text": "For the purposes of resolving a security incident, otherwise semi-private but relatively harmless user information such as the provenance of connections to user accounts will not be considered highly sensitive, and can be transmitted to a foreign site without excessive precautions. \"Intruder information\" will be transmitted freely to other system administrators and CSIRTs. \"Embarrassing information\" can be transmitted when there is reasonable assurance that it will remain confidential, and when it is necessary to resolve an incident.",
      "ja": "セキュリティインシデントを解決する目的のために、このようなユーザーアカウントへの接続の産地としてそれ以外の場合はセミプライベートが、比較的無害なユーザー情報は、機密性の高いと見なされず、過度な予防措置なしで外国サイトに送信することができます。 「侵入者情報」は、他のシステム管理者とのCSIRTに自由に送信されます。 「恥ずかしいの情報は、」それは秘密のままであることを合理的な保証がある場合に送信することができ、それが事件を解決する必要がある場合。"
    },
    {
      "indent": 8,
      "text": "- Vendors will be considered as foreign CSIRTs for most intents and purposes. The XYZ-CERT wishes to encourage vendors of all kinds of networking and computer equipment, software, and services to improve the security of their products. In aid of this, a vulnerability discovered in such a product will be reported to its vendor, along with all technical details needed to identify and fix the problem. Identifying details will not be given to the vendor without the permission of the affected parties.",
      "ja": " - ベンダーは、ほとんどの意図や目的のために外国のCSIRTとみなされます。 XYZ-CERTは、自社製品のセキュリティを向上させるためのネットワーキングおよびコンピュータ機器、ソフトウェア、およびサービスのすべての種類のベンダーを奨励したいです。このの助けを借りて、このような製品に発見された脆弱性は、問題を特定し、修正するために必要なすべての技術的な詳細とともに、そのベンダーに報告されます。特定の詳細は、影響を受ける当事者の許可なしにベンダーに与えられません。"
    },
    {
      "indent": 8,
      "text": "- Law enforcement officers will receive full cooperation from the XYZ-CERT, including any information they require to pursue an investigation, in accordance with the Policy on Computing Facilities.",
      "ja": " - 法の執行役員は、彼らがコンピューティング施設の方針に従って、捜査を追求するために必要とするすべての情報を含むXYZ-CERTからの全面的な協力を、受け取ることになります。"
    },
    {
      "indent": 3,
      "text": "4.3 Communication and Authentication",
      "section_title": true,
      "ja": "4.3コミュニケーションと認証"
    },
    {
      "indent": 8,
      "text": "In view of the types of information that the XYZ-CERT will\nlikely be dealing with, telephones will be considered\nsufficiently secure to be used even unencrypted.  Unencrypted\ne-mail will not be considered particularly secure, but will be sufficient for the transmission of low-sensitivity data.  If\nit is necessary to send highly sensitive data by e-mail, PGP\nwill be used.  Network file transfers will be considered to\nbe similar to e-mail for these purposes: sensitive data should\nbe encrypted for transmission.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Where it is necessary to establish trust, for example before relying on information given to the XYZ-CERT, or before disclosing confidential information, the identity and bona fide of the other party will be ascertained to a reasonable degree of trust. Within XYZ University, and with known neighbor sites, referrals from known trusted people will suffice to identify someone. Otherwise, appropriate methods will be used, such as a search of FIRST members, the use of WHOIS and other Internet registration information, etc, along with telephone call-back or e-mail mail-back to ensure that the party is not an impostor. Incoming e-mail whose data must be trusted will be checked with the originator personally, or by means of digital signatures (PGP in particular is supported).",
      "ja": "それはXYZ-CERTに与えられた情報に頼る前に、情報や機密情報を開示する前に、たとえば、信頼関係を確立する必要がある場合には、アイデンティティと相手の善意は、信頼の妥当な程度に確認されます。 XYZ大学の中で、および既知の隣人サイトで、知られている信頼できる人からの紹介は誰かを識別するために十分であろう。そうでない場合は、適切な方法は、そのようなFIRSTメンバーの検索として、使用され、電話のコールバックや電子メール、メールバックと一緒にWHOISや他のインターネット登録情報などの使用は、当事者が詐欺師ではないことを確実にするために。そのデータは信頼されている必要があり受信メールは個人的には、発信者、またはデジタル署名によって、（特にPGPがサポートされている）で確認されます。"
    },
    {
      "indent": 3,
      "text": "5. Services",
      "section_title": true,
      "ja": "5.サービス"
    },
    {
      "indent": 3,
      "text": "5.1 Incident Response",
      "section_title": true,
      "ja": "5.1インシデントレスポンス"
    },
    {
      "indent": 8,
      "text": "XYZ-CERT will assist system administrators in handling the\ntechnical and organizational aspects of incidents.  In\nparticular, it will provide assistance or advice with respect\nto the following aspects of incident management:",
      "raw": true
    },
    {
      "indent": 3,
      "text": "5.1.1 Incident Triage",
      "section_title": true,
      "ja": "5.1.1インシデントトリアージ"
    },
    {
      "indent": 12,
      "text": "- Investigating whether indeed an incident occured.\n- Determining the extent of the incident.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "5.1.2 Incident Coordination",
      "section_title": true,
      "ja": "5.1.2インシデントコーディネーション"
    },
    {
      "indent": 12,
      "text": "- Determining the initial cause of the incident\n  (vulnerability exploited).\n- Facilitating contact with other sites which may be\n  involved.\n- Facilitating contact with XYZ University Security and/or\n  appropriate law enforcement officials, if necessary.\n- Making reports to other CSIRTs.\n- Composing announcements to users, if applicable.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "5.1.3 Incident Resolution",
      "section_title": true,
      "ja": "5.1.3インシデントの解決"
    },
    {
      "indent": 12,
      "text": "- Removing the vulnerability.\n- Securing the system from the effects of the incident.\n- Evaluating whether certain actions are likely to reap\n  results in proportion to their cost and risk, in\n  particular those actions aimed at an eventual prosecution\n  or disciplinary action: collection of evidence after the\n  fact, observation of an incident in progress, setting\n  traps for intruders, etc.\n- Collecting evidence where criminal prosecution, or\n  University disciplinary action, is contemplated.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "In addition, XYZ-CERT will collect statistics concerning incidents which occur within or involve the XYZ University community, and will notify the community as necessary to assist it in protecting against known attacks.",
      "ja": "また、XYZ-CERTは、XYZ大学のコミュニティ内で、または伴わ起こる事件に関する統計情報を収集し、既知の攻撃からの保護でそれを支援するために、必要に応じてコミュニティを通知します。"
    },
    {
      "indent": 8,
      "text": "To make use of XYZ-CERT's incident response services, please send e-mail as per section 2.11 above. Please remember that the amount of assistance available will vary according to the parameters described in section 4.1.",
      "ja": "XYZ-CERTのインシデント対応サービスを利用するためには、上記のセクション2.11に従って電子メールを送信してください。利用できる援助の量は、4.1節で説明したパラメータに応じて変化することを覚えておいてください。"
    },
    {
      "indent": 3,
      "text": "5.2 Proactive Activities",
      "section_title": true,
      "ja": "5.2積極的な活動"
    },
    {
      "indent": 8,
      "text": "The XYZ-CERT coordinates and maintains the following\nservices to the extent possible depending on its resources:\n  - Information services\n     - List of departmental security contacts, administrative\n       and technical.  These lists will be available to the\n       general public, via commonly-available channels such as\n       the World Wide Web and/or the Domain Name Service.\n     - Mailing lists to inform security contacts of new\n       information relevant to their computing environments.\n       These lists will be available only to XYZ University\n       system administrators.\n     - Repository of vendor-provided and other security-related\n       patches for various operating systems.  This repository\n       will be available to the general public wherever\n       license restrictions allow it, and will be provided via\n       commonly-available channels such as the World Wide Web\n       and/or ftp.\n     - Repository of security tools and documentation for\n       use by sysadmins.  Where possible, precompiled\n       ready-to-install versions will be supplied.  These will\n       be supplied to the general public via www or ftp as\n       above.",
      "raw": true
    },
    {
      "indent": 10,
      "text": " - \"Clipping\" service for various existing resources, such as major mailing lists and newsgroups. The resulting clippings will be made available either on the restricted mailing list or on the web site, depending on their sensitivity and urgency. - Training services - Members of the XYZ-CERT will give periodic seminars on computer security related topics; these seminars will be open to XYZ University system administrators. - Auditing services - Central file integrity checking service for Unix machines, and for any other platforms capable of running \"tripwire\". - Security level assignments; machines and subnetworks at XYZ University will be audited and assigned a security level. This security level information will be available to the XYZ University community, to facilitate the setting of appropriate access privileges. However, details of the security analyses will be confidential, and available only to the concerned parties. - Archiving services - Central logging service for machines capable of Unix-style remote logging. Incoming log entries will be watched by an automated log analysis program, and events or trends indicative of a potential security problem will be reported to the affected system administrators. - Records of security incidents handled will be kept. While the records will remain confidential, periodic statistical reports will be made available to the XYZ University community.",
      "ja": " - そのような主要なメーリングリストやニュースグループなど、さまざまな既存のリソースのための「クリッピング」サービス。結果の切り抜きは、それらの感度及び緊急性に応じて、制限されたメーリングリストやウェブサイト上のいずれか利用できるようになります。 - トレーニングサービス -  XYZ-CERTのメンバーは、コンピュータセキュリティ関連のトピックに関する定期的なセミナーを行います。これらのセミナーは、XYZ大学のシステム管理者に開放されます。 - 監査サービス - 中央ファイルのUnixマシンのためのサービスを整合性チェック、および「仕掛け」を実行することができる任意の他のプラットフォーム用。 - セキュリティレベルの割り当て。 XYZ大学で機械やサブネットワークを監査し、セキュリティレベルを割り当てられます。このセキュリティレベルの情報は、適切なアクセス権限の設定を容易にするため、XYZ大学のコミュニティに利用できるようになります。しかし、セキュリティ分析の詳細については、機密、および関係者のみが利用できるようになります。 - アーカイブサービス -  Unixスタイルのリモートロギングできるマシン用の中央ロギングサービス。着信ログエントリは、自動化されたログ解析プログラムによって監視され、イベントや潜在的なセキュリティ上の問題を示す傾向が影響を受けたシステム管理者に報告されます。 - 取り扱いセキュリティインシデントの記録は保持されます。レコードは機密のままになりますが、定期的な統計レポートは、XYZ大学のコミュニティに利用できるようになります。"
    },
    {
      "indent": 8,
      "text": "Detailed descriptions of the above services, along with instructions for joining mailing lists, downloading information, or participating in certain services such as the central logging and file integrity checking services, are available on the XYZ-CERT web site, as per section 2.10 above.",
      "ja": "こうした中央ロギングやファイルの整合性チェックサービスとして、メーリングリストに参加する情報のダウンロード、または特定のサービスに参加するための指示に沿って上記サービスの詳細な説明は、上記のセクション2.10に従って、XYZ-CERTのWebサイトで入手できます。"
    },
    {
      "indent": 3,
      "text": "6. Incident Reporting Forms",
      "section_title": true,
      "ja": "6.インシデント報告フォーム"
    },
    {
      "indent": 8,
      "text": "There are no local forms developed yet for reporting incidents\nto XYZ-CERT. If possible, please make use of the Incident\nReporting Form of the CERT Coordination Center (Pittsburgh,\nPA).  The current version is available from:\n   ftp://info.cert.org/incident_reporting_form",
      "raw": true
    },
    {
      "indent": 3,
      "text": "7. Disclaimers",
      "section_title": true,
      "ja": "7.免責事項"
    },
    {
      "indent": 8,
      "text": "While every precaution will be taken in the preparation of\ninformation, notifications and alerts, XYZ-CERT assumes no\nresponsibility for errors or omissions, or for damages\nresulting from the use of the information contained within.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4 Acknowlegdements",
      "ja": "4つの謝辞"
    },
    {
      "indent": 3,
      "text": "The editors gratefully acknowledge the contributed material and editorial scrutiny of Anne Bennett. Thanks also to Don Stikvoort for assistance reworking the description of Incident Response Team services.",
      "ja": "編集者は感謝アン・ベネットの貢献材料と編集精査を認めます。インシデント対応チームサービスの説明をリワーク支援のためにもドンStikvoortに感謝します。"
    },
    {
      "indent": 0,
      "text": "5 References",
      "ja": "5つの参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC 2196] Fraser, B., \"Site Security Handbook\", FYI 8, RFC 2196, September 1997.",
      "ja": "[RFC 2196]フレイザー、B.、 \"サイトセキュリティハンドブック\"、FYI 8、RFC 2196、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC 1983] Malkin, G., \"Internet Users' Glossary\", FYI 18, RFC 1983, August 1996.",
      "ja": "[RFC 1983]マルキン、G.、 \"インターネットユーザーの用語集\"、FYI 18、RFC 1983、1996年8月。"
    },
    {
      "indent": 0,
      "text": "6 Security Considerations",
      "ja": "6セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document discusses the operation of Computer Security Incident Response Teams, and the teams' interactions with their constituencies and with other organizations. It is, therefore, not directly concerned with the security of protocols, applications, or network systems themselves. It is not even concerned with particular responses and reactions to security incidents, but only with the appropriate description of the responses provided by CSIRTs.",
      "ja": "この文書では、有権者とし、他の組織とコンピュータセキュリティインシデント対応チーム、そしてチームの相互作用の操作について説明します。それは、したがって、プロトコル、アプリケーション、またはネットワーク・システムそのものの安全に直接関係はありません。それも、だけのCSIRTが提供する応答の適切な説明と、特定の応答とセキュリティインシデントに対する反応に関与されていません。"
    },
    {
      "indent": 3,
      "text": "Nonetheless, it is vital that the CSIRTs themselves operate securely, which means that they must establish secure communication channels with other teams, and with members of their constituency. They must also secure their own systems and infrastructure, to protect the interests of their constituency and to maintain the confidentiality of the identity of victims and reporters of security incidents.",
      "ja": "それにもかかわらず、のCSIRT自体が、彼らは他のチームとの安全な通信チャネルを確立し、その選挙のメンバーでなければならないことを意味し、安全に動作させることが重要です。彼らはまた、選挙の利益を保護し、セキュリティインシデントの被害者と記者のアイデンティティの機密性を維持するために、独自のシステムとインフラストラクチャを保護する必要があります。"
    },
    {
      "indent": 0,
      "text": "7 Authors' Addresses",
      "ja": "7本の著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Nevil Brownlee ITSS Technology Development The University of Auckland",
      "ja": "NevilブラウンリーITSSオークランドの技術開発東京大学"
    },
    {
      "indent": 3,
      "text": "Phone: +64 9 373 7599 x8941 EMail: n.brownlee@auckland.ac.nz",
      "ja": "電話：+64 9 373 7599 x8941メール：n.brownlee@auckland.ac.nz"
    },
    {
      "indent": 3,
      "text": "Erik Guttman Sun Microsystems, Inc. Bahnstr. 2 74915 Waibstadt Germany",
      "ja": "エリック・ガットマンサン・マイクロシステムズ株式会社Bahnstr。 2 74915ヴァイプシュタットドイツ"
    },
    {
      "indent": 3,
      "text": "Phone: +49 7263 911484 EMail: Erik.Guttman@sun.com",
      "ja": "電話：+49 7263 911484 Eメール：Erik.Guttman@sun.com"
    },
    {
      "indent": 0,
      "text": "8 Full Copyright Statement",
      "ja": "8フル著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}