{
  "title": {
    "text": "RFC 2497 - Transmission of IPv6 Packets over ARCnet Networks",
    "ja": "RFC 2497 - ARCネットネットワークの上のIPv6パケットのトランスミッション"
  },
  "number": 2497,
  "created_at": "2019-10-27 05:23:58.939902+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       I. Souvatzis\nRequest for Comments: 2497                            The NetBSD Project\nSee Also: 1201                                              January 1999\nCategory: Standards Track",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Transmission of IPv6 Packets over ARCnet Networks",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This memo specifies a frame format for transmission of IPv6 [IPV6] packets and the method of forming IPv6 link-local and statelessly autoconfigured addresses on ARCnet networks. It also specifies the content of the Source/Target Link-layer Address option used by the Router Solicitation, Router Advertisement, Neighbor Solicitation, Neighbor Advertisement and Redirect messages described in [DISC], when those messages are transmitted on an ARCnet.",
      "ja": "このメモは、IPv6 [IPV6]パケットの伝送のためのフレームフォーマット及びARCネットネットワーク上でIPv6リンクローカル及びステートレス自動設定アドレスを形成する方法を指定します。また、ルータ要請によって使用されるソース/ターゲットリンク層アドレスオプション、ルータアドバタイズメント、近隣要請、近隣広告の内容を指定し、それらのメッセージは、ARCネット上で送信される場合、[DISC]で説明したメッセージをリダイレクトします。"
    },
    {
      "indent": 6,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [KWORD].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [KWORD]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Frame Format",
      "section_title": true,
      "ja": "2.フレーム形式"
    },
    {
      "indent": 3,
      "text": "IPv6 packets are link layer fragmented and reassembled according to [PHDS]. A brief but sufficient discussion of this fragmentation method can be found in [ARCIPV4].",
      "ja": "IPv6パケットは、リンク層断片化及び[PHDS]に従って再構築されます。この断片化方法の簡単であるが十分な議論は[ARCIPV4]に見出すことができます。"
    },
    {
      "indent": 3,
      "text": "The protocol ID (System Code in ARCnet terminology) assigned to IPv6 is C4 hexadecimal.",
      "ja": "IPv6への割り当てプロトコルID（ARCネット用語でシステムコード）C4の16進数です。"
    },
    {
      "indent": 0,
      "text": "3. Maximum Transmission Unit",
      "section_title": true,
      "ja": "3.最大伝送単位"
    },
    {
      "indent": 3,
      "text": "The maximum IPv6 packet length possible using this encapsulation method is 60480 octets. Since this length is impractical because of its worst case transmission time of several seconds, all ARCnet implementations on a given ARCnet network should agree on a smaller value.",
      "ja": "このカプセル化方式を用いて可能な最大IPv6パケット長が60480オクテットです。この長さは、その最悪の場合、数秒の伝送時間の実際的ではないので、与えられたのARCnetネットワーク上のすべてのARCnet実装が小さい値に同意する必要があります。"
    },
    {
      "indent": 3,
      "text": "The default MTU for IPv6 [IPV6] packets on an ARCnet is 9072 octets.",
      "ja": "ARCネット上のIPv6 [IPV6]パケットのデフォルトMTUは9072オクテットです。"
    },
    {
      "indent": 3,
      "text": "In the presence of a router, this size MAY be changed by a Router Advertisement [DISC] containing an MTU option. If a Router Advertisement is received with an MTU option specifying an MTU larger than 60480, or larger than a manually configured value less than 60480, that MTU option may be logged to system management but MUST be otherwise ignored.",
      "ja": "ルータの存在下で、このサイズがMTUオプションを含むルータ広告[DISC]で変更することができます。ルータ広告は、MTUオプションは、システム管理に記録されてもよいが、そうでなければ無視されなければならないことは、手動で設定値未満60480以上60480より大きい、またはより大きなMTUを指定するMTUオプションで受信された場合。"
    },
    {
      "indent": 3,
      "text": "If no router is available, the local MTU MUST be left at 9072 or MUST be manually configured to the same different value on all connected stations.",
      "ja": "ないルータが利用できない場合、ローカルMTUは9072で放置しなければならないか、または手動で接続されているすべてのステーションで同じ異なる値に設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Implementations MAY accept arriving IPv6 datagrams which are larger than their configured maximum transmission unit. They are not required to discard such datagrams. If they can not handle larger datagrams, they MAY log the event to the system administration, but MUST otherwise silently discard them.",
      "ja": "実装は、その設定された最大送信単位よりも大きいIPv6データグラムが到着受け入れることができます。これらは、データグラムを破棄する必要はありません。彼らは、より大きなデータグラムを処理できない場合は、システム管理にイベントを記録することがありますが、それ以外は静かにそれを捨てなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Stateless Auto-configuration",
      "section_title": true,
      "ja": "4.ステートレス自動設定"
    },
    {
      "indent": 3,
      "text": "If a node has an EUI-64 which is not used to form the Interface Identifier for any other interface, it SHOULD use that EUI-64 to form the Interface Identifier for its ARCnet interface. If that EUI-64 is in use for another interface attached to a different link, it MAY be used for the ARCnet interface as well.",
      "ja": "ノードは、EUI-64の任意の他のインターフェイスのインターフェイス識別子を形成するために使用されていない持っている場合は、そのARCネットインターフェイスのインターフェイス識別子を形成するために、そのEUI-64を使用するべきです。そのEUI-64は異なるリンクに取り付けられた別のインタフェースのために使用されている場合、それは同様のARCnetインタフェースのために使用されるかもしれません。"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier is then formed from the EUI-64 by complementing the \"Universal/Local\" (U/L) bit, which is the next-to-lowest order bit of the first octet of the EUI-64.",
      "ja": "インタフェース識別子は、その後、EUI-64の最初のオクテットの次ツー最下位ビットである「ローカルユニバーサル/」（U / L）ビットを補完することによりEUI-64から形成されています。"
    },
    {
      "indent": 3,
      "text": "When a node has no EUI-64 available for forming its ARCnet Interface Identifer, it MUST form that identifier as specified in [AARCH], Appendix A, section \"Links with Non-Global Identifier\". That is, the 8 bit manually configured ARCnet address is appended to the 56 zero bits.",
      "ja": "ノードがEUI-64のARCネットインタフェース識別子ですを形成するために利用できるがない場合[AARCH]、付録A、セクション「非グローバル識別子とリンク」に指定され、その識別子を形成しなければなりません。つまり、8ビット手動で設定ARCネットアドレスは56ビットでゼロに付加されます。"
    },
    {
      "indent": 3,
      "text": "For example, for an ARCnet interface with the configured address of 49 hexadecimal this results in the following identifier:",
      "ja": "例えば、49進数の設定されたアドレスとのARCnetインタフェースのため、これは以下の識別子になります。"
    },
    {
      "indent": 3,
      "text": "|0              1|1              3|3              4|4              6|\n|0              5|6              1|2              7|8              3|\n+----------------+----------------+----------------+----------------+\n|0000000000000000|0000000000000000|0000000000000000|0000000001001001|\n+----------------+----------------+----------------+----------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note that this results in the universal/local bit set to \"0\" to indicate local scope.",
      "ja": "これはローカルスコープを示すために「0」に設定ユニバーサル/ローカルビットの結果であることに留意ください。"
    },
    {
      "indent": 3,
      "text": "An IPv6 address prefix used for stateless auto-configuration [ACONF] of an ARCnet interface MUST have a length of 64 bits.",
      "ja": "ARCネットインタフェースのステートレス自動設定に使用されるIPv6アドレスプレフィックス[ACONF]は64ビットの長さでなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Link-Local Addresses",
      "section_title": true,
      "ja": "5.リンクローカルアドレス"
    },
    {
      "indent": 3,
      "text": "The IPv6 link-local address [AARCH] for an ARCnet interface is formed by appending the Interface Identifier, as defined above, to the prefix FE80::/64.",
      "ja": "プレフィックスFE80 :: / 64に、上記で定義した通りのARCnetインタフェースのIPv6リンクローカルアドレス[AARCH]は、インターフェース識別子を付加することによって形成されます。"
    },
    {
      "indent": 3,
      "text": " 10 bits            54 bits                  64 bits\n+----------+-----------------------+----------------------------+\n|1111111010|         (zeros)       |    Interface Identifier    |\n+----------+-----------------------+----------------------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "6. Address Mapping -- Unicast",
      "section_title": true,
      "ja": "6.アドレスマッピング - ユニキャスト"
    },
    {
      "indent": 3,
      "text": "The procedure for mapping IPv6 addresses into ARCnet link-layer addresses is described in [DISC]. The Source/Target link layer Address option has the following form when the link layer is ARCnet.",
      "ja": "IPv6がARCネットリンク層アドレスへのアドレスマッピングのための手順は、[DISC]で説明されています。リンク層は、ARCネットときに、ソース/ターゲットリンク層アドレスオプションは次の形式を持っています。"
    },
    {
      "indent": 12,
      "text": " 0                   1\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|ARCnet address |               |\n+---------------+              -+\n|                               |\n+-    5 octets of padding      -+\n|                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Option fields:",
      "ja": "オプションフィールド："
    },
    {
      "indent": 6,
      "text": "Type 1 for Source Link-layer address. 2 for Target Link-layer address. Length 1 (in units of 8 octets).",
      "ja": "ソースリンク層アドレスのためのタイプ1。ターゲットリンク層アドレスのため2。長さ1（8つのオクテットの単位で）。"
    },
    {
      "indent": 6,
      "text": "ARCnet address The 8 bit ARCnet address, in canonical bit order.",
      "ja": "ARCネット正規のビット順に、8ビットのARCnetアドレス。"
    },
    {
      "indent": 0,
      "text": "7. Address Mapping -- Multicast",
      "section_title": true,
      "ja": "7.アドレスマッピング - マルチキャスト"
    },
    {
      "indent": 3,
      "text": "As ARCnet only provides 1 multicast address (00 hexadecimal), all IPv6 multicast addresses MUST be mapped to this address.",
      "ja": "ARCネットのみ1つのマルチキャストアドレス（00進数）を提供するように、すべてのIPv6マルチキャストアドレスは、このアドレスにマッピングされなければなりません。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The method of derivation of Interface Identifiers from ARCnet addresses is intended to preserve local uniqueness when possible. However, there is no protection from duplication through accident or forgery.",
      "ja": "ARCネットアドレスからインタフェース識別子の導出方法は、可能な場合、ローカルの一意性を維持することを意図しています。しかし、事故や偽造による重複からの保護はありません。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "Big parts of the new version of this memo are either based on [ETHIPV6] or on Matt Crawford's review of an earlier version.",
      "ja": "このメモの新しいバージョンのビッグ部分はどちらか[ETHIPV6]または以前のバージョンのマット・クロフォードのレビューに基づいています。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 3,
      "text": "[AARCH] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 2373, July 1998.",
      "ja": "[AARCH] HindenとR.とS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 2373、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[ACONF] Thomson, S. and T. Narten, \"IPv6 Stateless Address Autoconfiguration\", RFC 2462, December 1998.",
      "ja": "[ACONF]トムソン、S.とT. Narten氏、 \"IPv6のステートレスアドレス自動設定\"、RFC 2462、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[ARCIPV4] Provan, D., \"Transmitting IP Traffic over ARCNET Networks\", RFC1201, Novell, Inc., February 1991.",
      "ja": "[ARCIPV4] Provan、D.、 \"ARCNETネットワークの上に送信するIPトラフィック\"、RFC1201、ノベル社、1991年2月。"
    },
    {
      "indent": 3,
      "text": "[DISC] Narten, T., Nordmark, E. and W. Simpson, \"Neighbor Discovery for IP Version 6 (IPv6)\", RFC 2461, December 1998.",
      "ja": "[DISC] Narten氏、T.、Nordmarkと、E.およびW.シンプソン、 \"IPバージョン6のための近隣探索（IPv6）の\"、RFC 2461、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[ETHIPV6] Crawford, M., \"Transmission of IPv6 Packets over Ethernet Networks\", RFC 2464, December 1998.",
      "ja": "[ETHIPV6]クロフォード、M.、 \"イーサネットネットワークの上のIPv6パケットのトランスミッション\"、RFC 2464、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[EUI64] \"64-Bit Global Identifier Format Tutorial\", http://stan­ dards.ieee.org/db/oui/tutorials/EUI64.html.",
      "ja": "[EUI64] \"64ビットのグローバル識別子の形式のチュートリアル\" は、http：//スタンdards.ieee.org/db/oui/tutorials/EUI64.html。"
    },
    {
      "indent": 3,
      "text": "[IPV6] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[IPV6]デアリング、S.とR. Hindenと、 \"インターネットプロトコルバージョン6（IPv6）の仕様\"、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[KWORD] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[KWORD]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[PHDS] Novell, Inc., \"ARCNET Packet Header Definition Standard\", Novell Part Number 100-00721-001, November 1989.",
      "ja": "[PHDS]ノベル社、 \"ARCNETパケットヘッダの定義基準\"、Novellの部品番号100-00721-001、1989年11月。"
    },
    {
      "indent": 0,
      "text": "11. Author's Address",
      "section_title": true,
      "ja": "11.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ignatios Souvatzis The NetBSD Project Stationenweg 29 D-53332 Bornheim Germany",
      "ja": "IgnatiosはNetBSDプロジェクトStationenweg 29 D-53332 BornheimのドイツをSouvatzis"
    },
    {
      "indent": 3,
      "text": "Phone (work): +49 (228) 734316 EMail: is@netbsd.org",
      "ja": "電話（仕事）：+49（228）734316 Eメール：is@netbsd.org"
    },
    {
      "indent": 0,
      "text": "12. Full Copyright Statement",
      "section_title": true,
      "ja": "12.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}