{
  "title": {
    "text": "RFC 2596 - Use of Language Codes in LDAP",
    "ja": "RFC 2596 - LDAPでの言語コードの使用"
  },
  "number": 2596,
  "created_at": "2019-10-27 08:04:32.807345+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            M. Wahl\nRequest for Comments: 2596                  Innosoft International, Inc.\nCategory: Standards Track                                       T. Howes\n                                           Netscape Communications Corp.\n                                                                May 1999",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Use of Language Codes in LDAP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "1. Abstract",
      "section_title": true,
      "ja": "1.要約"
    },
    {
      "indent": 3,
      "text": "The Lightweight Directory Access Protocol [1] provides a means for clients to interrogate and modify information stored in a distributed directory system. The information in the directory is maintained as attributes [2] of entries. Most of these attributes have syntaxes which are human-readable strings, and it is desirable to be able to indicate the natural language associated with attribute values.",
      "ja": "ライトウェイトディレクトリアクセスプロトコル[1]は分散ディレクトリシステムに格納されている情報を問い合わせると、修正するクライアントのための手段を提供します。ディレクトリ内の情報は、[2]のエントリの属性として維持されます。これらの属性のほとんどは、人間が読める文字列である構文を持っている、そして属性値に関連した自然言語を示すことができるようにすることが望ましいです。"
    },
    {
      "indent": 3,
      "text": "This document describes how language codes [3] are carried in LDAP and are to be interpreted by LDAP servers. All implementations MUST be prepared to accept language codes in the LDAP protocols. Servers may or may not be capable of storing attributes with language codes in the directory. This document does not specify how to determine whether particular attributes can or cannot have language codes.",
      "ja": "この文書では、言語コード[3]はLDAPで運ばれ、LDAPサーバによって解釈されるようにする方法を説明します。すべての実装は、LDAPプロトコルでの言語コードを受け入れるように準備しなければなりません。サーバーは、ディレクトリ内の言語コードと属性を格納することが可能であってもなくてもよいです。この文書は、特定の属性がまたは言語コードを持つことができないことができるかどうかを決定する方法を指定しません。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [4].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119に記載されるように解釈される[4]。"
    },
    {
      "indent": 0,
      "text": "2. Language Codes",
      "section_title": true,
      "ja": "2.言語コード"
    },
    {
      "indent": 3,
      "text": "Section 2 of RFC 1766 [3] describes the language code format which is used in LDAP. Briefly, it is a string of ASCII alphabetic characters and hyphens. Examples include \"fr\", \"en-US\" and \"ja-JP\".",
      "ja": "RFC 1766のセクション2 [3] LDAPで使用される言語コードのフォーマットを説明しています。簡単に言えば、それはASCII英字とハイフンの文字列です。例としては、 \"EN-US\" \"FR\"、および \"JA-JP\" が挙げられます。"
    },
    {
      "indent": 3,
      "text": "Language codes are case insensitive. For example, the language code \"en-us\" is the same as \"EN-US\" and \"en-US\".",
      "ja": "言語コードは大文字と小文字を区別しません。たとえば、 \"EN-US\" 言語コードは \"EN-US\" と \"EN-US\" と同じです。"
    },
    {
      "indent": 3,
      "text": "Implementations MUST NOT otherwise interpret the structure of the code when comparing two codes, and MUST treat them as simply strings of characters. Client and server implementations MUST allow any arbitrary string which follows the patterns given in RFC 1766 to be used as a language code.",
      "ja": "実装は、2つのコードを比較するとき、そうでない場合は、コードの構造を解釈してはならない、と文字の単純文字列としてそれらを扱わなければなりません。クライアントとサーバの実装は、RFC 1766に与えられたパターンを下記の任意の文字列が言語コードとして使用されることを可能にしなければなりません。"
    },
    {
      "indent": 0,
      "text": "3. Use of Language Codes in LDAP",
      "section_title": true,
      "ja": "LDAPでの言語コードの3."
    },
    {
      "indent": 3,
      "text": "This section describes how LDAP implementations MUST interpret language codes in performing operations.",
      "ja": "このセクションでは、LDAPの実装は操作を実行するには、言語コードを解釈しなければならない方法を説明します。"
    },
    {
      "indent": 3,
      "text": "In general, an attribute with a language code is to be treated as a subtype of the attribute without a language code. If a server does not support storing language codes with attribute values in the DIT, then it MUST always treat an attribute with a language code as an unrecognized attribute.",
      "ja": "一般的には、言語コードを有する属性は、言語コードなしの属性のサブタイプとして扱われるべきです。サーバがDIT内の属性値を持つ言語コードを格納サポートしていない場合、それは常に認識されていない属性として言語コードと属性を扱わなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.1. Attribute Description",
      "section_title": true,
      "ja": "3.1. 属性説明"
    },
    {
      "indent": 3,
      "text": "An attribute consists of a type, a list of options for that type, and a set of one or more values. In LDAP, the type and the options are combined into the AttributeDescription, defined in section 4.1.5 of [1]. This is represented as an attribute type name and a possibly-empty list of options. One of these options associates a natural language with values for that attribute.",
      "ja": "属性はタイプ、そのタイプのオプションのリスト、および1つ以上の値のセットで構成されます。 LDAPにおいて、タイプおよびオプションは、[1]のセクション4.1.5で定義されたのAttributeDescription、に結合されます。これは、属性タイプ名とオプションの可能性 - 空のリストとして表されます。これらのオプションの一つは、その属性の値を持つ自然言語を関連付けます。"
    },
    {
      "indent": 8,
      "text": "language-option = \"lang-\" lang-code",
      "ja": "言語オプション=「lang-」LANGコード"
    },
    {
      "indent": 8,
      "text": "lang-code = printable-ascii ; a code as defined in RFC 1766",
      "ja": "LANGコード=印刷可能なASCII文字。 RFC 1766で定義されたコード"
    },
    {
      "indent": 3,
      "text": "Multiple language options may be present on a particular value.",
      "ja": "複数の言語オプションは、特定の値に存在していてもよいです。"
    },
    {
      "indent": 3,
      "text": "The language code has no effect on the character set encoding for string representations of DirectoryString syntax values; the UTF-8 representation of UniversalString (ISO 10646) is always used.",
      "ja": "言語コードはDirectoryString構文の値の文字列表現の文字セット符号化に影響を及ぼしません。 UniversalString（ISO 10646）のUTF-8表現が常に使用されます。"
    },
    {
      "indent": 3,
      "text": "Examples of valid AttributeDescription: givenName;lang-en-US CN;lang-ja",
      "ja": "有効なのAttributeDescriptionの例：givenName属性; LANG-EN-US CN; LANG-JA"
    },
    {
      "indent": 3,
      "text": "In LDAP and in examples in this document, a directory attribute is represented as an AttributeDescription with a list of values. Note that the data could be stored in the LDAP server in a different representation.",
      "ja": "LDAPでは、この文書の例では、ディレクトリの属性は、値のリストとのAttributeDescriptionとして表現されます。データが異なる表現でLDAPサーバに格納することができることに注意してください。"
    },
    {
      "indent": 0,
      "text": "3.2. Distinguished Names and Relative Distinguished Names",
      "section_title": true,
      "ja": "3.2. 識別名と相対識別名"
    },
    {
      "indent": 3,
      "text": "No attribute description options are permitted in Distinguished Names or Relative Distinguished Names. Thus language codes MUST NOT be used in forming DNs.",
      "ja": "いいえ属性記述オプションは識別名または相対識別名では許可されません。このように言語コードは、DNSを形成するのに使用してはいけません。"
    },
    {
      "indent": 0,
      "text": "3.3. Search Filter",
      "section_title": true,
      "ja": "3.3. 検索フィルタ"
    },
    {
      "indent": 3,
      "text": "If a language code is present in an AttributeDescription in a search filter, then only attribute values in the directory which match the base attribute type or its subtype, the language code and the assertion value match this filter.",
      "ja": "言語コードが検索フィルタでのAttributeDescriptionに存在する場合のみ、ベース属性タイプまたはそのサブタイプに一致するディレクトリ内の属性値を、その後、言語コードとアサーションの値は、このフィルタに一致します。"
    },
    {
      "indent": 3,
      "text": "Thus for example a filter of an equality match of type \"name;lang-en-US\" and assertion value \"Billy Ray\", against the following directory entry",
      "ja": "従って、例えばタイプの平等マッチのフィルタ;以下のディレクトリエントリに対するアサーション値「ビリー・レイ」、「名前のlang-EN-US」"
    },
    {
      "indent": 3,
      "text": "objectclass: top DOES NOT MATCH (wrong type) objectclass: person DOES NOT MATCH (wrong type) name;lang-EN-US: Billy Ray MATCHES name;lang-EN-US: Billy Bob DOES NOT MATCH (wrong value) CN;lang-en-us: Billy Ray MATCHES CN;lang-EN-US;dynamic: Billy Ray MATCHES CN;lang-en;dynamic: Billy Ray DOES NOT MATCH (differing lang-) name: Billy Ray DOES NOT MATCH (no lang-) SN: Ray DOES NOT MATCH (wrong value)",
      "ja": "オブジェクトクラス：トップが一致していない（間違ったタイプ）オブジェクトクラス：人は（間違ったタイプ）の名前と一致していません。LANG-EN-US：ビリー・レイは名前と一致する; LANG-EN-US：ビリー・ボブは、（間違った値）と一致しないCN; LANG-EN-US：ビリーレイはCNと一致する; LANG-EN-US;ダイナミック：ビリーレイはCNと一致する; LANGエン;ダイナミック：ビリー・レイは（異なるlang-）と一致しない名前：ビリー・レイが一致していない（無LANG - ）SN：Rayは（間違った値と一致していません）"
    },
    {
      "indent": 3,
      "text": "(Note that \"CN\" and \"SN\" are subtypes of \"name\".)",
      "ja": "（「CN」と「SN」は「名前」のサブタイプであることに注意してください。）"
    },
    {
      "indent": 3,
      "text": "Client implementors should however note that providing a language code in a search filter AttributeDescription will often filter out desirable values where the language code does not match exactly. For example, the filter (name;lang-en=Billy Ray) does NOT match the attribute \"name;lang-en-US: Billy Ray\".",
      "ja": "クライアントの実装者は、しかし、検索フィルターのAttributeDescriptionの言語コードを提供することは、多くの場合、言語コードが正確に一致しないことが望ま値をフィルタリングすることに注意すべきです。例えば、フィルタ（名; LANGエン=ビリー・レイ）は、属性 \"名前を; LANG-EN-US：ビリー・レイ\" 一致していません。"
    },
    {
      "indent": 3,
      "text": "If the server does not support storing language codes with attribute values in the DIT, then any filter which includes a language code will always fail to match, as it is an unrecognized attribute type. No error would be returned because of this; a presence filter would evaluate to FALSE and all other forms to Undefined.",
      "ja": "サーバがDIT内の属性値を持つ言語コードを格納サポートしていない場合、それは認識されていない属性タイプであるとして、その言語コードを含む任意のフィルタが常に一致するように失敗します。エラーはこれのために返さないであろう。存在フィルタは未定義にFALSEとすべての他の形態に評価されます。"
    },
    {
      "indent": 3,
      "text": "If no language code is specified in the search filter, then only the base attribute type and the assertion value need match the value in the directory.",
      "ja": "何の言語コードは、検索フィルタに指定されていない場合は、基本属性タイプと主張値だけでは、ディレクトリ内の値と一致する必要が。"
    },
    {
      "indent": 3,
      "text": "Thus for example a filter of an equality match of type \"name\" and assertion value \"Billy Ray\", against the following directory entry objectclass: top DOES NOT MATCH (wrong type) objectclass: person DOES NOT MATCH (wrong type) name;lang-EN-US: Billy Ray MATCHES name;lang-EN-US: Billy Bob DOES NOT MATCH (wrong value) CN;lang-EN-US;dynamic: Billy Ray MATCHES CN;lang-en;dynamic: Billy Ray MATCHES name: Billy Ray MATCHES SN: Ray DOES NOT MATCH (wrong value)",
      "ja": "従って、例えばタイプ「名前」と主張値「ビリー・レイ」の平等マッチのフィルタは、以下のディレクトリエントリのオブジェクトクラスに対する：トップが一致していない（間違ったタイプ）オブジェクトクラス：人は一致していない（間違ったタイプ）の名前; LANG -EN-US：ビリー・レイは名前と一致する; LANG-EN-US：ビリー・ボブは、（間違った値）と一致しないCN; LANG-EN-US;ダイナミック：ビリーレイはCNと一致する; LANGエン;ダイナミック：ビリー・レイは名前と一致します：ビリー・レイはSNと一致する：レイは（間違った値）と一致しません"
    },
    {
      "indent": 3,
      "text": "Thus in general, clients SHOULD NOT use the language code option in AttributeDescription fields in search filters.",
      "ja": "このように、一般的には、クライアントが検索フィルタでのAttributeDescription分野で言語コードオプションを使用しないでください。"
    },
    {
      "indent": 0,
      "text": "3.4. Compare",
      "section_title": true,
      "ja": "3.4. 比較します"
    },
    {
      "indent": 3,
      "text": "A language code can be present in an AttributeDescription used in a compare request AttributeValueAssertion. This is to be treated by servers the same as the use of language codes in a search filter with an equality match, as described in the previous section. If there is no attribute in the entry with the same subtype and language code, the noSuchAttributeType error will be returned.",
      "ja": "言語コードは、比較要求AttributeValueAssertionで使用されるのAttributeDescription中に存在することができます。これは、前のセクションで説明したように、等価マッチした検索フィルタにおける言語コードの使用と同じサーバによって処理されるべきです。同じサブタイプと言語コードのエントリには属性が存在しない場合は、noSuchAttributeTypeエラーが返されます。"
    },
    {
      "indent": 3,
      "text": "Thus for example a compare request of type \"name\" and assertion value \"Johann\", against an entry with all the following directory entry",
      "ja": "従って、例えば、以下のすべてのディレクトリエントリのエントリに対して、タイプ「名前」と主張値「ヨハン」の要求を比較します"
    },
    {
      "indent": 3,
      "text": "objectclass: top objectclass: person givenName;lang-de-DE: Johann CN: Johann Sibelius SN: Sibelius",
      "ja": "オブジェクトクラス：トップオブジェクトクラス：人givenName属性; LANGドDE：ヨハンCN：ヨハン・シベリウスSN：シベリウス"
    },
    {
      "indent": 3,
      "text": "will cause the server to return compareTrue.",
      "ja": "サーバがcompareTrueを返すことになります。"
    },
    {
      "indent": 3,
      "text": "However, if the client issued a compare request of type \"name;lang-de\" and assertion value \"Johann\" against the above entry, the request would fail with the noSuchAttributeType error.",
      "ja": "「名前; LANG =ド」のクライアントは、タイプの要求を比較を発行した場合は、上記のエントリに対して「ヨハン」と主張値、要求はnoSuchAttributeTypeエラーで失敗します。"
    },
    {
      "indent": 3,
      "text": "If the server does not support storing language codes with attribute values in the DIT, then any comparison which includes a language code will always fail to locate an attribute type, and noSuchAttributeType will be returned.",
      "ja": "サーバがDIT内の属性値を持つ言語コードを格納サポートしていない場合は、言語コードを含む任意の比較は常に属性タイプを見つけるために失敗し、noSuchAttributeTypeが返されます。"
    },
    {
      "indent": 3,
      "text": "Thus in general, clients SHOULD NOT use the language code option in AttributeDescription fields in the compare request.",
      "ja": "このように、一般的には、クライアントは比較要求の中のAttributeDescription分野で言語コードオプションを使用しないでください。"
    },
    {
      "indent": 0,
      "text": "3.5. Requested Attributes in Search",
      "section_title": true,
      "ja": "3.5. 検索で要求された属性"
    },
    {
      "indent": 3,
      "text": "Clients MAY provide language codes in AttributeDescription in the requested attribute list in a search request.",
      "ja": "クライアントは検索要求で要求された属性のリストでのAttributeDescriptionに言語コードを提供することができます。"
    },
    {
      "indent": 3,
      "text": "If a language code is provided in an attribute description, then only attribute values in a directory entry which have the same language code as that provided are to be returned. Thus if a client requests an attribute \"description;lang-en\", the server MUST NOT return values of an attribute \"description\" or \"description;lang-fr\".",
      "ja": "言語コード属性記述で提供される場合、次いでのみ提供されるものが返されるのと同じ言語コードを持っているディレクトリエントリの属性値。クライアントが属性「の記述; LANG-EN」を要求したこのようにすると、サーバーは、属性「説明」や「; LANG-FRの説明」の値を返してはなりません。"
    },
    {
      "indent": 3,
      "text": "Clients MAY provide in the attribute list multiple AttributeDescription which have the same base attribute type but different options. For example a client MAY provide both \"name;lang-en\" and \"name;lang-fr\", and this would permit an attribute with either language code to be returned. Note there would be no need to provide both \"name\" and \"name;lang-en\" since all subtypes of name would match \"name\".",
      "ja": "クライアントは、属性リストで同じベース属性タイプが異なるオプションを持つ複数のAttributeDescriptionを提供することができます。 「; LANGエン名」と「名; LANG-FR」たとえば、クライアントが両方を提供することができ、言語コードのいずれかが返されると、これは属性を可能にします。 「名前」との両方を提供する必要はないだろうに注意してください「という名前を; LANGエン」の名前のすべてのサブタイプが「名」と一致するからです。"
    },
    {
      "indent": 3,
      "text": "If a server does not support storing language codes with attribute values in the DIT, then any attribute descriptions in the list which include language codes are to be ignored, just as if they were unknown attribute types.",
      "ja": "サーバがDITに属性値を持つ言語コードを格納サポートしていない場合は、言語コードを含むリスト内の属性の説明は、彼らが未知の属性タイプであるかのように、無視されることになっています。"
    },
    {
      "indent": 3,
      "text": "If a request is made specifying all attributes or an attribute is requested without providing a language code, then all attribute values regardless of their language code are returned.",
      "ja": "要求はすべての属性を指定して行われるか、属性が言語コードを提供せずに要求された場合は、関係なく、彼らの言語コードのすべての属性値が返されます。"
    },
    {
      "indent": 3,
      "text": "For example, if the client requests a \"description\" attribute, and a matching entry contains",
      "ja": "クライアントが要求した場合たとえば、「説明」属性、および一致するエントリが含まれています"
    },
    {
      "indent": 3,
      "text": "objectclass: top objectclass: organization O: Software GmbH description: software description;lang-en: software products description;lang-de: Softwareprodukte postalAddress: Berlin 8001 Germany postalAddress;lang-de: Berlin 8001 Deutschland",
      "ja": "オブジェクトクラス：トップオブジェクトクラス：組織O：ソフトウェア社の説明：ソフトウェアの説明; LANG-EN：ソフトウェア製品の説明; LANG =ド：ソフトウェア製品のpostalAddressの：ベルリン8001ドイツpostalAddressの、LANG =ド：ベルリン8001ドイツ"
    },
    {
      "indent": 3,
      "text": "The server will return:",
      "ja": "サーバが返します。"
    },
    {
      "indent": 3,
      "text": "description: software description;lang-en: software products description;lang-de: Softwareprodukte",
      "ja": "説明：ソフトウェアの説明; LANG-EN：ソフトウェア製品の説明; LANG-EN：ソフトウェア製品"
    },
    {
      "indent": 0,
      "text": "3.6. Add Operation",
      "section_title": true,
      "ja": "3.6. オペレーションを追加"
    },
    {
      "indent": 3,
      "text": "Clients MAY provide language codes in AttributeDescription in attributes of a new entry to be created, subject to the limitation that the client MUST NOT use language codes in the attribute value or values which form the RDN of the entry.",
      "ja": "クライアントは、クライアントがエントリのRDNを形成する属性値または値の言語コードを使用してはならないという制限を受け、作成する新しいエントリの属性でのAttributeDescriptionでの言語コードを提供することができます。"
    },
    {
      "indent": 3,
      "text": "A client MAY provide multiple attributes with the same attribute type and value, so long as each attribute has a different language code, and at most one attribute does not have a language code option.",
      "ja": "クライアントは、各属性が異なる言語コードを持っている限り、同じ属性のタイプと値を持つ複数の属性を提供し、最大で一つの属性は、言語コードのオプションがありません。"
    },
    {
      "indent": 3,
      "text": "Servers which support storing language codes in the DIT MUST allow any attribute it recognizes that has the Directory String syntax to have a language option associated with it. Servers SHOULD allow language options to be associated with other attributes.",
      "ja": "DITの言語コードを記憶しサポートするサーバーは、それはそれはそれに関連付けられている言語オプションを持っているディレクトリ文字列構文を持つ認識する任意の属性を許容しなければなりません。サーバは、言語のオプションが他の属性と関連付けることができるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "For example, the following is a legal request.",
      "ja": "たとえば、次のように法的な要求です。"
    },
    {
      "indent": 3,
      "text": "objectclass: top objectclass: person objectclass: residentialPerson name: John Smith CN: John Smith CN;lang-en: John Smith SN: Smith streetAddress: 1 University Street streetAddress;lang-en: 1 University Street streetAddress;lang-fr: 1 rue Universite houseIdentifier;lang-fr: 9e etage",
      "ja": "オブジェクトクラス：トップオブジェクトクラス：人のオブジェクトクラス：residentialPerson名：ジョン・スミスCN：ジョン・スミスCN; LANGエン：ジョン・スミスSN：スミスstreetAddress：1大学通りstreetAddress; LANGエン：1大学通りstreetAddress; LANG-FR：1 RUE大学HouseIdentifierという; LANG-FR：9Eのエタージュ"
    },
    {
      "indent": 3,
      "text": "If a server does not support storing language codes with attribute values in the DIT, then it MUST treat an AttributeDescription with a language code as an unrecognized attribute. If the server forbids the addition of unrecognized attributes then it MUST fail the add request with the appropriate result code.",
      "ja": "サーバがDIT内の属性値を持つ言語コードを格納サポートしていない場合、それは認識されていない属性として言語コードとのAttributeDescriptionを扱わなければなりません。サーバーが認識されない属性の追加を禁止した場合、それは適切な結果コードと追加要求に失敗しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.7. Modify Operation",
      "section_title": true,
      "ja": "3.7. 操作を変更します。"
    },
    {
      "indent": 3,
      "text": "A client MAY provide a language code in an AttributeDescription as part of a modification element in the modify operation.",
      "ja": "クライアントが変更操作で変更要素の一部としてのAttributeDescriptionでの言語コードを提供することができます。"
    },
    {
      "indent": 3,
      "text": "Attribute types and language codes MUST match exactly against values stored in the directory. For example, if the modification is a \"delete\", then if the stored values to be deleted have a language code, the language code MUST be provided in the modify operation, and if the stored values to be deleted do not have a language code, then no language code is to be provided.",
      "ja": "属性タイプと言語コードは、ディレクトリに格納された値に対して正確に一致する必要があります。たとえば、変更、削除する格納された値は、言語コードを持っている場合は、「削除」、そして、言語コードは変更操作に提供しなければなりませんされ、保存された値を削除する場合は、言語コードを持っていない場合、その後、何の言語コードが提供されるべきではありません。"
    },
    {
      "indent": 3,
      "text": "If the server does not support storing language codes with attribute values in the DIT, then it MUST treat an AttributeDescription with a language code as an unrecognized attribute, and MUST fail the request with an appropriate result code.",
      "ja": "サーバがDIT内の属性値を持つ言語コードを格納サポートしていない場合、それは認識されていない属性として言語コードとのAttributeDescriptionを扱わなければなりませんし、適切な結果コードで要求を失敗しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.8. Diagnostic Messages",
      "section_title": true,
      "ja": "3.8. 診断メッセージ"
    },
    {
      "indent": 3,
      "text": "Servers SHOULD use only printable ASCII characters in the errorMessage field, as not all clients will be able to display the full range of Unicode.",
      "ja": "いないすべてのクライアントは、Unicodeの全範囲を表示することができますようサーバーは、ErrorMessageのフィールドにのみ印刷可能なASCII文字を使用すべきです。"
    },
    {
      "indent": 0,
      "text": "4. Differences from X.500(1997)",
      "section_title": true,
      "ja": "X.500から4違い（1997）"
    },
    {
      "indent": 3,
      "text": "X.500(1997) defines a different mechanism, contexts, as the means of representing language tags. This section summarizes the major differences in approach.",
      "ja": "X.500（1997）は、言語タグを表現する手段として、異なる機構、コンテキストを定義します。このセクションでは、アプローチの主要な相違点をまとめました。"
    },
    {
      "indent": 3,
      "text": "a) An X.500 operation which has specified a language code on a value matches a value in the directory without a language code. b) LDAP references RFC 1766, which allows for IANA registration of new tags. c) LDAP does not allow language codes in distinguished names. d) X.500 describes subschema administration procedures to allow language codes to be associated with particular attributes types.",
      "ja": "A）値に言語コードを指定したX.500動作は言語コードなしでディレクトリ内の値と一致します。新しいタグのIANA登録することができますb）のLDAP参照のRFC 1766、。 C）LDAP識別名で言語コードを許可していません。 D）X.500は、言語コードが特定の属性タイプに関連付けることができるようにサブスキーマ管理手順が記載されています。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no known security considerations for this document. See the security considerations sections of [1] and [2] for security considerations of LDAP in general.",
      "ja": "このドキュメントに関する既知のセキュリティ上の考慮事項はありません。セキュリティの考慮事項のセクションを参照してください。[1]と[2]一般的なLDAPのセキュリティに関する考慮事項のため。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "This document is a product of the IETF ASID and LDAPEXT working groups. Martin Duerst provided many valuable comments on an earlier version of this document.",
      "ja": "この文書は、IETF ASIDとLDAPEXTワーキンググループの製品です。マーティンDuerstはこのドキュメントの以前のバージョンには、多くの貴重なコメントを提供しました。"
    },
    {
      "indent": 0,
      "text": "7. Bibliography",
      "section_title": true,
      "ja": "7.参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Wahl, M., Howes, T. and S. Kille, \"Lightweight Directory Access Protocol (v3)\", RFC 2251, December 1997.",
      "ja": "[1]ワール、M.、ハウズ、T.およびS. Kille、 \"軽量のディレクトリアクセスプロトコル（V3）\"、RFC 2251、1997年12月。"
    },
    {
      "indent": 3,
      "text": "[2] Wahl, M., Coulbeck, A., Howes, T. and S. Kille, \"Lightweight X.500 Directory Access Protocol Attribute Syntax Definitions\", RFC 2252, December 1997.",
      "ja": "[2]ワール、M.、Coulbeck、A.、ハウズ、T.、およびS. Kille、 \"軽量のX.500ディレクトリアクセスプロトコル属性構文定義\"、RFC 2252、1997年12月。"
    },
    {
      "indent": 3,
      "text": "[3] Alvestrand, H.,\"Tags for the Identification of Languages\", RFC 1766, March 1995.",
      "ja": "[3] Alvestrand、Hを、 \"言語識別のためのタグ\"、RFC 1766、1995年3月。"
    },
    {
      "indent": 3,
      "text": "[4] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[4]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 0,
      "text": "8. Authors' Addresses",
      "section_title": true,
      "ja": "8.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Mark Wahl Innosoft International, Inc. 8911 Capital of Texas Hwy Suite 4140 Austin, TX 78759 USA",
      "ja": "マーク・ワールInnosoftの国際、Inc.の8911資本テキサス州のハイウェイスイート4140オースティン、TX 78759 USA"
    },
    {
      "indent": 3,
      "text": "EMail: M.Wahl@innosoft.com",
      "ja": "メールアドレス：M.Wahl@innosoft.com"
    },
    {
      "indent": 3,
      "text": "Tim Howes Netscape Communications Corp. 501 E. Middlefield Rd Mountain View, CA 94043 USA",
      "ja": "ティム・ハウズネットスケープコミュニケーションズ株式会社501 E.ミドルRdのマウンテンビュー、CA 94043 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650 937-3419 EMail: howes@netscape.com",
      "ja": "電話：+1 650 937-3419 Eメール：howes@netscape.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}