{
  "title": {
    "text": "RFC 2448 - AT&T's Error Resilient Video Transmission Technique",
    "ja": "RFC 2448 - AT＆Tの誤り耐性動画像伝送方式"
  },
  "number": 2448,
  "created_at": "2019-10-24 21:01:44.968469+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        M. Civanlar\nRequest for Comments: 2448                                       G. Cash\nCategory: Informational                                       B. Haskell\n                                                      AT&T Labs-Research\n                                                           November 1998",
      "raw": true
    },
    {
      "indent": 10,
      "text": "AT&T's Error Resilient Video Transmission Technique",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a set of techniques for packet loss resilient transmission of compressed video bitstreams based on reliable delivery of their vital information-carrying segments. The described techniques can be used over packet networks without packet prioritization. These techniques are related to AT&T/Lucent patents [1, 2].",
      "ja": "この文書は、それらの重要な情報を運ぶセグメントの信頼できる配信に基づいて、圧縮されたビデオビットストリームのパケット損失弾性送信するための技術のセットを記述する。記載された技術は、パケットの優先順位付けすることなく、パケットネットワーク上で使用することができます。これらの技術は[2,1] AT＆T /ルーセントの特許に関連しています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "It is well known that every bit in a compressed video bitstream is not equal. Some bits belong to segments defining vital information such as picture types, quantization values, parameter ranges, average intensity values for image blocks, etc. When transporting compressed video bitstreams over packet networks, packet losses from such segments cause a much longer lasting and severe degradation on the output of a decoder than that caused by packet losses from other segments. We will call the vital information-carrying segments \"High Priority (HP)\" segments. The rest of the bitstream consists of \"Low Priority (LP)\" segments. Clearly, the video outputs resulting from transport techniques that protect the HP segments against packet losses are more resilient to packet losses in general.",
      "ja": "よく圧縮されたビデオビットストリーム内のすべてのビットが等しくないことが知られています。いくつかのビットは、ピクチャタイプ、量子化値、パラメータ範囲、パケット・ネットワーク上で圧縮されたビデオビットストリームを輸送する場合、このようなセグメントからパケット損失がはるかに長く持続し、重篤な劣化を引き起こす等の画像ブロックの平均輝度値として、重要な情報を定義セグメントに属し他のセグメントからのパケット損失によって引き起こされるものよりも、デコーダの出力に。私たちは、「高優先度（HP）」セグメントの重要な情報を運ぶセグメントを呼び出します。ビットストリームの残りの部分は、「低優先度（LP）」のセグメントで構成されています。明らかに、パケット損失に対してHPセグメントを保護するトランスポート技術から生じるビデオ出力は、一般にパケット損失に対してより弾力的です。"
    },
    {
      "indent": 3,
      "text": "Protection of the HP segments can be accomplished in many ways. These include:",
      "ja": "HPセグメントの保護は、多くの方法で達成することができます。これらは、次のとおりです。"
    },
    {
      "indent": 6,
      "text": "- redundant transmission of the HP segments as described in [3] for MPEG RTP payloads",
      "ja": " -  MPEG RTPペイロードのために記載されているようにHPセグメントの冗長伝送[3]"
    },
    {
      "indent": 6,
      "text": "- using forward error correction (FEC) techniques - transmitting HP segments over reserved channels or using differentiated services.",
      "ja": " - 予約チャネル上でHPセグメントを送信するか、差別化サービスを使用して、 - 誤り訂正（FEC）技術フォワード使用。"
    },
    {
      "indent": 3,
      "text": "Both redundant transmission and FEC techniques increase the bandwidth needed to transmit the compressed video bitstream. FEC techniques increase the effectiveness of this additional bandwidth for packet loss protection at the expense of increased processing at the receiver and the transmitter ends and increased overall delay. Using channel reservations or differentiated services based approaches may be the best solutions for protecting the HP segments but, they require network infrastructure changes.",
      "ja": "両方の冗長送信及びFEC技術は、圧縮されたビデオビットストリームを送信するために必要な帯域幅を増加させます。 FEC技法は、受信機における増加処理の費用及び送信端でのパケット損失保護のためのこの追加の帯域幅の効率を高め、全体的な遅延を増加させました。チャネル予約やアプローチに基づく差別化サービスを使用すると、彼らはネットワークインフラストラクチャの変更が必要、HPセグメントを保護するための最善の解決策であってもよいがあります。"
    },
    {
      "indent": 3,
      "text": "This document outlines another set of HP segment protection techniques based on AT&T/Lucent patents [1, 2] that can be used for reliable video transmission over packet networks without a built-in prioritization mechanism. These techniques use reliable transport protocols and \"out-of-band\" delivery approaches. In this context, the term \"out-of-band\" is used to imply information transmission means other than those used for transmitting the main video stream. The details of these techniques are discussed in the following sections. An implementation of these, as applied to MPEG-2 video transmission over IP networks, is described in [4].",
      "ja": "この文書では、AT＆T / Lucent社の特許に基づいて、HPセグメント保護技術の別のセットを概説[1,2]内蔵の優先順位付け機構なしパケットネットワーク上で信頼性の高いビデオ伝送のために使用することができます。これらの技術は、信頼性の高いトランスポートプロトコルと「アウトオブバンド」送達アプローチを使用しています。この文脈において、「アウトオブバンド」という用語は、情報の伝送を意味するために使用されるメインビデオストリームを送信するために使用されるもの以外の意味。これらの技術の詳細は、次のセクションで説明されています。これらの実装は、IPネットワーク上でMPEG-2ビデオの伝送に適用される、[4]に記載されています。"
    },
    {
      "indent": 3,
      "text": "The IESG/IETF take no position regarding the validity or scope of any intellectual property right or other rights that might be claimed to pertain to the implementation or use of the technology, or the extent to which any license under such rights might or might not be available. See the IETF IPR web page at http://www.ietf.org/ipr.html for any additional information that has been forwarded to the IETF.",
      "ja": "IESG / IETFは、そのような権限下で、ライセンスがたりないかもしれない可能性があるためにどの実装や技術の使用、または程度に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる立場を取るん利用可能。 IETFに転送された任意の追加情報については、http://www.ietf.org/ipr.htmlでIETF IPRのWebページを参照してください。"
    },
    {
      "indent": 0,
      "text": "2. Identification of the HP segments",
      "section_title": true,
      "ja": "HPセグメントの2同定"
    },
    {
      "indent": 3,
      "text": "The classification of a part of a video bitstream as an HP segment depends on two factors. The first one is the encoding algorithm used in compressing the video data. It is impossible to segment a compressed video bitstream without knowing the syntax and the semantics of the encoding algorithm. The second factor is the determination of a compromise between the HP segment size and the corresponding loss resilience. As the segment size increases, so does the loss resilience. On the other hand, it may not be feasible to deliver large HP segments reliably.",
      "ja": "HPセグメントとしてビデオビットストリームの一部の分類は2つの要因に依存します。一つ目は、映像データを圧縮する際に使用される符号化アルゴリズムです。これは、構文と符号化アルゴリズムの意味を知らなくても、セグメントに圧縮されたビデオビットストリームは不可能です。第2の要因は、HPセグメントサイズと対応する損失回復力との間の妥協の決意です。セグメントサイズが大きくなるにつれて、損失弾性を行います。一方、確実に大きなHPセグメントを提供することが実現可能ではないかもしれません。"
    },
    {
      "indent": 3,
      "text": "As an example, the \"data partitioning\" method of the MPEG-2 standard [5] defines the syntax and semantics for one particular way of partitioning an MPEG-2 encoded video bitstream into HP and LP segments. In data partitioning, the smallest useful HP segment can be selected to contain only the header information, which is usually less than two percent of the video data. HP segments defined this way contain vital information including picture type, quantization factor, motion vector ranges, etc. without which the rest of the bitstream is not decodable. As an alternative, the DC coefficients (the average values) for each picture macroblock may be included in the HP segment increasing its size to about 40% of the bitstream. This way HP segments can be made to carry somewhat usable video information also; however, their reliable transmission may become a demanding task.",
      "ja": "一例として、MPEG-2規格の「データ分割」法[5] HP及びLPセグメントにMPEG-2符号化ビデオビットストリームを区画の一つの特定の方法のためのシンタックスとセマンティクスを定義します。データパーティショニングでは、最小の有用なHPセグメントは、通常、ビデオデータの2％未満であり、ヘッダ情報のみを含むように選択することができます。このように定義されたHPセグメントはビットストリームの残りが復号可能でないそれなし等ピクチャタイプ、量子化係数、動きベクトルの範囲を含む重要な情報を含んでいます。代替として、各画像のマクロブロックのDC係数（平均値）は、ビットストリームの約40％までのサイズを大きくHPセグメントに含まれてもよいです。この方法でHPセグメントもやや使用可能なビデオ情報を運ぶようにすることができます。しかし、彼らの信頼性の高い伝送が要求の厳しい作業になることがあります。"
    },
    {
      "indent": 3,
      "text": "Since it is not possible to formulate a general technique that can be used for identifying the HP segments in any encoded video bitstream, we will assume that such segments are identified some way prior to the transmission. For example, some encoders can generate HP and LP segments separately, a stored bitstream can be in the partitioned format, etc. Also, consistent with most of the popular coding techniques, we assume that the HP segments (HP1, HP2, ...) are dispersed on the entire bitstream over time as shown in Fig. 1.",
      "ja": "それは、任意の符号化ビデオビットストリーム中のHPセグメントを識別するために使用することができる一般的な技術を処方することは不可能であるので、我々は、そのようなセグメントが送信前にいくつかの方法が特定されると仮定する。例えば、いくつかのエンコーダは、別途HPとLPセグメントを生成することができ、保存されたビットストリームは、またパーティションのフォーマットなどで人気の符号化技術のほとんどと一致することができ、我々はHPセグメント（HP1、HP2、ことを前提としてい...図2に示すように）時間にわたってビットストリーム全体に分散されている。1。"
    },
    {
      "indent": 3,
      "text": "+---+----------------+---+----------------------+---+-----\n|HP1|     LP1        |HP2|        LP2           |HP3| ...\n+---+----------------+---+----------------------+---+-----\n                             Figure 1\n    HP segments dispersed on an encoded video bitstream over time",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3. Transmission of HP data using a reliable transport protocol []",
      "section_title": true,
      "ja": "信頼できるトランスポートプロトコルを使用して、HPデータの3トランスミッション[]"
    },
    {
      "indent": 3,
      "text": "In this approach, one or more of the HP segments are transmitted using a reliable transport protocol prior to starting the transmission of the LP segments. For point-to-point applications, TCP, for multipoint applications, an appropriate reliable multicast protocol [6] may be used for transporting the HP segments. The number of HP segments to be sent before starting the transmission of the LP segments depends on the application's tolerance to the start-up delay. Depending on the HP segment size and the path-MTU [7], one or more HP segments can be put in each packet carrying the HP data.",
      "ja": "このアプローチは、HPセグメントの1つ以上においてLPセグメントの送信を開始する前に信頼できるトランスポートプロトコルを使用して送信されます。マルチポイント・アプリケーションのためのポイント・ツー・ポイント・アプリケーション、TCP、適切な信頼できるマルチキャストプロトコルの[6] HPセグメントを輸送するために使用することができます。 LPセグメントの送信を開始する前に送信するHPセグメントの数は、起動遅延に対するアプリケーションの許容度に依存します。 HPセグメントサイズおよびパスMTUに応じて、[7]、一つ以上のHPセグメントは、HPのデータを搬送する各パケットに入れることができます。"
    },
    {
      "indent": 3,
      "text": "HP segments can be packetized using RTP with the following definitions for the header fields:",
      "ja": "HPセグメントは、ヘッダフィールドの次の定義を用いてRTPを使用してパケット化することができます。"
    },
    {
      "indent": 6,
      "text": "Payload Type: A distinct payload type number, which may be dynamic, should be assigned to HP segments of each video payload.",
      "ja": "ペイロードタイプ：動的であってもよい別個のペイロードタイプ番号は、各ビデオ・ペイロードのHPセグメントに割り当てられるべきです。"
    },
    {
      "indent": 6,
      "text": "M Bit: Set for packets containing HP data for key pictures.",
      "ja": "Mビット：キー映像のためにHPデータを含むパケットのために設定してください。"
    },
    {
      "indent": 6,
      "text": "timestamp: Uses the same format as that of the video payload. Shows the sampling time for the video data following the first HP segment in the packet.",
      "ja": "タイムスタンプ：ビデオペイロードのと同じ形式を使用します。パケットの最初のHPセグメントに続く映像データのサンプリング時間を表示します。"
    },
    {
      "indent": 3,
      "text": "The SSRC field may be defined following the rules developed for the transmission of layered media streams in [8]. That is:",
      "ja": "SSRCフィールドは、[8]に積層メディアストリームの送信のために開発された規則に従って定義することができます。あれは："
    },
    {
      "indent": 6,
      "text": "- A single SSRC space is used for the HP segment packets and the main video stream. Only the latter is used for SSRC allocation and conflict resolution. When a source discovers that it has collided, it transmits an RTCP BYE message on only the main video stream.",
      "ja": " - 単一SSRC空間がHPセグメントパケットとメインビデオストリーム用に使用されます。後者のみがSSRC割り当てと競合の解決に使用されます。ソースは、それが衝突したことを検出すると、それが唯一のメインビデオストリームにRTCP BYEメッセージを送信します。"
    },
    {
      "indent": 6,
      "text": "- A participant sends sender identification (SDES) on only the main video stream.",
      "ja": " - 参加者はメインビデオストリームに送信者識別（SDES）を送信します。"
    },
    {
      "indent": 3,
      "text": "Most HP segments are self-identifying and can be packed without any additional headers. For others, techniques used for packetizing generic payload types may be used or special payload types may be defined.",
      "ja": "ほとんどのHPセグメントは、自己識別であり、任意の追加のヘッダーなしで詰めることができます。他人のために、一般的なペイロードタイプをパケット化するために使用される技術を用いてもよいし、特殊なペイロードタイプを定義することができます。"
    },
    {
      "indent": 3,
      "text": "It is possible to send the HP data along with the LP data (i.e., the original, unpartitioned bitstream) in addition to sending the HP segments separately. This way, the separately transmitted HP segments are needed only when packet losses occur.",
      "ja": "別途HPセグメントを送信することに加えてLPデータ（すなわち、元の、未使用ビットストリーム）とともに、HPのデータを送信することが可能です。パケットロスが発生した場合にのみ、この方法では、別々に伝送HPセグメントが必要とされています。"
    },
    {
      "indent": 0,
      "text": "4. Out-of-band transmission of the HP information []",
      "section_title": true,
      "ja": "HP情報の4アウトオブバンド伝送[]"
    },
    {
      "indent": 3,
      "text": "In cases where a certain sequence of HP segments is used periodically for the entire duration of the video bitstream, this sequence may be transmitted once before the start of video transmission using a reliable transport protocol. The receiver can save this information and use it to recover lost HP segments during the main video transmission.",
      "ja": "HPセグメントの特定のシーケンスは、ビデオビットストリームの全期間にわたって定期的に使用される場合には、この配列は、信頼性の高いトランスポートプロトコルを使用して、ビデオ伝送の開始前に一度送信されても​​よいです。受信機は、この情報を保存し、メインのビデオ伝送中に失われたHPセグメントを回復するためにそれを使用することができます。"
    },
    {
      "indent": 3,
      "text": "In this approach, the timestamps are not meaningful for the HP data and they may not be included in the transmitted HP segment sequence. In most cases, the synchronization between the stored HP segments and the LP data stream can be accomplished using the key-frames because the HP data sequence usually cover the video segment between two key-frames (e.g. a group-of-pictures (GOP) in MPEG). If the sequence of HP segments covers a video sequence with more than one key-frame, some indicator, e.g. if available the M-bit may be used to indicate a packet which carries the beginning of LP data that follows the first stored HP segment.",
      "ja": "このアプローチでは、タイムスタンプは、HPデータの意味のものではなく、それらが送信HPセグメントシーケンスに含まれていなくてもよいです。 HPデータシーケンスは、通常、2つのキーフレーム間のビデオ・セグメントをカバーするため、ほとんどの場合、記憶されたHPセグメントとLPデータストリーム間の同期は、キーフレームを使用して達成することができる（例えば、グループ・オブ・ピクチャ（GOP） MPEGで）。 HPセグメントの配列は、複数のキーフレームを有するビデオシーケンスをカバーする場合、いくつかの指標、例えば可能な場合はMビットは、最初の保存されたHPセグメントに続くLPデータの先頭を運ぶパケットを示すために使用されてもよいです。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "RTP packets transmitted according to the techniques outlined in this document are subject to the security considerations discussed in the RTP specification [9]. This implies that confidentiality of the media streams is achieved by encryption. Because the data compression used is applied end-to-end, encryption may be performed after compression so there is no conflict between the two operations. For certain coding techniques and applications, encrypting only the HP segments may provide sufficent confidentiality.",
      "ja": "本文書で概説技術に従って送信されたRTPパケットは、RTP仕様[9]で説明したセキュリティ上の考慮の対象となっています。これは、メディアストリームの機密性は、暗号化によって達成されることを意味します。使用されるデータ圧縮は、エンドツーエンドで適用されるので、二つの操作の間に競合がないので、暗号化は、圧縮後に行ってもよいです。特定の符号化技術とアプリケーションでは、唯一のHPセグメントを暗号化するsufficentの機密性を提供することができます。"
    },
    {
      "indent": 3,
      "text": "The described techniques do not introduce any significant additional non-uniformity in the receiver side computational complexity for packet processing to cause a potential denial-of-service threat.",
      "ja": "記載されている技術は、潜在的なサービス拒否の脅威を引き起こすために、パケット処理のために受信機側計算の複雑さの大幅な追加的な不均一性を導入しません。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "リファレンス"
    },
    {
      "indent": 3,
      "text": "[1] Glenn L. Cash, Mehmet R. Civanlar, \"Method Of And Apparatus For The Transmission Of High And Low Priority Segments Of A Video Bitstream Over Packet Networks,\" United States Patent Number: 5,481,312, Jan. 2, 1996.",
      "ja": "[1]グレン・L.現金、メフメットR. Civanlar、米国特許番号「ハイとAビデオビットストリームを介してパケットネットワークの低優先度セグメントを送信するための方法及び装置」：5481312、1996年1月2日。"
    },
    {
      "indent": 3,
      "text": "[2] Glenn L. Cash, Mehmet R. Civanlar, \"Video Bitstream Regeneration Using Previously Agreed To High Priority Segments,\" United States Patent Number: 5,510,844, April 23, 1996.",
      "ja": "5510844、1996年4月23日：[2]グレン・L.現金、メフメットR. Civanlar、米国特許番号「ビデオビットストリーム再生は、以前は優先度の高いセグメント、することに合意した使用します」。"
    },
    {
      "indent": 3,
      "text": "[3] Hoffman, D., Fernando, G., Goyal, V. and M. Civanlar, \"RTP Payload Format for MPEG1/MPEG2 Video\", RFC 2250, April 1997.",
      "ja": "[3]ホフマン、D.、フェルナンド、G.、Goyal氏、V.とM. Civanlar、 \"MPEG1 / MPEG2ビデオ用のRTPペイロードフォーマット\"、RFC 2250、1997年4月。"
    },
    {
      "indent": 3,
      "text": "[4] M. R. Civanlar, G. L. Cash, \"A practical system for MPEG-2 based video-on-demand over ATM packet networks and the WWW,\" Signal Processing: Image Communication, no. 8, pp. 221-227, Elsevier, 1996.",
      "ja": "[4] M. R. Civanlar、G. L.現金、信号処理 \"MPEG-2ベースのビデオ・オン・デマンドATMパケットネットワークとWWW、オーバーのための実用的なシステム\"：画像通信、いいえ。 8頁221-227、Elsevier社、1996。"
    },
    {
      "indent": 3,
      "text": "[5] ISO/IEC International Standard 13818; \"Generic coding of moving pictures and associated audio information,\" November 1994.",
      "ja": "[5] ISO / IEC国際標準13818; 1994年11月、「動画と関連オーディオ情報のジェネリックコーディング」。"
    },
    {
      "indent": 3,
      "text": "[6] Overview of Reliable Multicast Protocols Web Page, URL http://gaia.cs.umass.edu/sigcomm_mcast/talk1.html.",
      "ja": "信頼性マルチキャストプロトコルWebページ、URL http://gaia.cs.umass.edu/sigcomm_mcast/talk1.htmlの[6]の概要。"
    },
    {
      "indent": 3,
      "text": "[7] Mogul, J. and S. Deering, \"Path MTU Discovery\", RFC 1191, November 1990.",
      "ja": "[7]モーグル、J.およびS.デアリング、 \"パスMTUディスカバリ\"、RFC 1191、1990年11月。"
    },
    {
      "indent": 3,
      "text": "[8] M. F. Speer, S. McCanne, \"RTP Usage with Layered Multimedia Streams\", Work in Progress.",
      "ja": "[8] M. F.シュペーア、S. McCanne、 \"レイヤードマルチメディアストリームのRTPの使用\"、進行中で働いています。"
    },
    {
      "indent": 3,
      "text": "[9] Schulzrinne, H., Casner, S., Frederick, R. and V. Jacobson, \"RTP: A Transport Protocol for Real-Time Applications\", RFC 1889, January 1996.",
      "ja": "[9] Schulzrinneと、H.、Casner、S.、フレデリック、R.とV. Jacobson氏、 \"RTP：リアルタイムアプリケーションのためのトランスポートプロトコル\"、RFC 1889、1996年1月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "M. Reha Civanlar AT&T Labs-Research 100 Schultz Drive Red Bank, NJ 07701 USA",
      "ja": "M.レハCivanlar AT＆T Labsの研究-100シュルツドライブレッドバンク、NJ 07701 USA"
    },
    {
      "indent": 3,
      "text": "EMail: civanlar@research.att.com",
      "ja": "メールアドレス：civanlar@research.att.com"
    },
    {
      "indent": 3,
      "text": "Glenn L. Cash AT&T Labs-Research 100 Schultz Drive Red Bank, NJ 07701 USA",
      "ja": "グレン・L.現金AT＆T Labsの研究-100シュルツドライブレッドバンク、NJ 07701 USA"
    },
    {
      "indent": 3,
      "text": "EMail: glenn@research.att.com",
      "ja": "メールアドレス：glenn@research.att.com"
    },
    {
      "indent": 3,
      "text": "Barry G. Haskell AT&T Labs-Research 100 Schultz Drive Red Bank, NJ 07701 USA",
      "ja": "バリー・G. HaskellのAT＆T Labsの研究-100シュルツドライブレッドバンク、NJ 07701 USA"
    },
    {
      "indent": 3,
      "text": "EMail: bgh@research.att.com",
      "ja": "メールアドレス：bgh@research.att.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}