{
  "title": {
    "text": "RFC 2635 - DON'T SPEW A Set of Guidelines for Mass Unsolicited Mailings and Postings (spam*)",
    "ja": "RFC 2635 - 大量の未承諾の郵送と投稿のガイドラインのセットを吐き出さないでください（SPAM*）"
  },
  "number": 2635,
  "created_at": "2024-02-14 17:17:51.333943+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                    S. Hambridge\nRequest for Comments: 2635                                      INTEL\nFYI: 35                                                      A. Lunde\nCategory: Informational                       Northwestern University\n                                                            June 1999",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 16,
      "text": " DON'T SPEW A Set of Guidelines for Mass Unsolicited Mailings and Postings (spam*)",
      "ja": "大量の未承諾の郵送と投稿のガイドラインのセットを吐き出さないでください（SPAM*）"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（1999）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document explains why mass unsolicited electronic mail messages are harmful in the Internetworking community. It gives a set of guidelines for dealing with unsolicited mail for users, for system administrators, news administrators, and mailing list managers. It also makes suggestions Internet Service Providers might follow.",
      "ja": "このドキュメントは、インターネットワーキングコミュニティで大規模な未承諾の電子メールメッセージが有害である理由を説明しています。ユーザー、システム管理者、ニュース管理者、メーリングリストマネージャー向けの未承諾メールを扱うための一連のガイドラインを提供します。また、インターネットサービスプロバイダーがフォローする可能性のある提案をします。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Internet's origins in the Research and Education communities played an important role in the foundation and formation of Internet culture. This culture defined rules for network etiquette (netiquette) and communication based on the Internet's being relatively off-limits to commercial enterprise.",
      "ja": "研究と教育コミュニティにおけるインターネットの起源は、インターネット文化の基礎と形成において重要な役割を果たしました。この文化は、ネットワークエチケット（ネチケット）のルールと、インターネットが商業企業にとって比較的立ち入り禁止であることに基づく通信を定義しました。"
    },
    {
      "indent": 3,
      "text": "This all changed when U.S. Government was no longer the primary funding body for the U.S. Internet, when the Internet truly went global, and when all commercial enterprises were allowed to join what had been strictly research networks. Internet culture had become deeply embedded in the protocols the network used. Although the social context has changed, the technical limits of the Internet protocols still require a person to enforce certain limits on resource usage for the 'Net to function effectively. Strong authentication was not built into the News and Mail protocols. The only thing that is saving the Internet from congestion collapse is the voluntary inclusion of TCP backoff in almost all of the TCP/IP driver code on the Internet. There is no end-to-end cost accounting and/or cost recovery. Bandwidth is shared among all traffic without resource reservation (although this is changing).",
      "ja": "これはすべて、米国政府が米国のインターネットの主要な資金提供機関ではなくなったとき、インターネットが本当にグローバルになったとき、そしてすべての商業企業が厳密に研究ネットワークに参加することを許可されたときに変化しました。インターネット文化は、ネットワークが使用したプロトコルに深く組み込まれていました。ソーシャルコンテキストは変化しましたが、インターネットプロトコルの技術的な制限は、依然として、ネットが効果的に機能するためのリソース使用に関する特定の制限を実施する必要があります。強力な認証は、ニュースおよびメールプロトコルに組み込まれていません。インターネットの崩壊からインターネットを保存している唯一のことは、インターネット上のTCP/IPドライバーコードのほぼすべてにTCPバックオフを自発的に含めることです。エンドツーエンドのコスト会計やコスト回収はありません。帯域幅は、リソースの予約なしですべてのトラフィック間で共有されます（ただし、これは変化しています）。"
    },
    {
      "indent": 3,
      "text": "Unfortunately for all of us, the culture so carefully nurtured through the early years of the Internet was not fully transferred to all those new entities hooking into the bandwidth. Many of those entities believe they have found a paradise of thousands of potential customers each of whom is desperate to learn about stunning new business opportunities. Alternatively, some of the new netizens believe all people should at least hear about the one true religion or political party or process. And some of them know that almost no one wants to hear their message but just can't resist how inexpensive the net can be to use. While there may be thousands of folks desperate for any potential message, mass mailings or Netnews postings are not at all appropriate on the 'Net.",
      "ja": "残念ながら、私たち全員にとって、インターネットの初期に慎重に育まれた文化は、帯域幅に接続しているすべての新しいエンティティに完全に移されませんでした。これらのエンティティの多くは、それぞれが驚くべき新しいビジネスチャンスについて学ぶことを切望している数千人の潜在的な顧客の楽園を見つけたと考えています。あるいは、新しいネチズンの一部は、すべての人々が少なくとも1つの真の宗教または政党またはプロセスについて聞くべきだと信じています。そして、彼らの何人かは、誰も彼らのメッセージを聞きたくないが、ネットがどれほど安価であるかに抵抗することはできないことを知っています。何千人もの人々が潜在的なメッセージに必死になるかもしれませんが、大量の郵送またはネットネークの投稿はネットではまったく適切ではありません。"
    },
    {
      "indent": 3,
      "text": "This document explains why mass unsolicited email and Netnews posting (aka spam) is bad, what to do if you get it, what webmasters, postmasters, and news admins can do about it, and how an Internet Service Provider might respond to it.",
      "ja": "このドキュメントでは、なぜ大規模な未承諾の電子メールとNetNewsの投稿（別名スパム）が悪いのか、それを手に入れた場合の対処方法、Webマスター、ポストマスター、ニュース管理者ができること、およびインターネットサービスプロバイダーがどのように対応するかについて説明します。"
    },
    {
      "indent": 0,
      "text": "2. What is Spam*?",
      "section_title": true,
      "ja": "2. スパムとは何ですか？"
    },
    {
      "indent": 3,
      "text": "The term \"spam\" as it is used to denote mass unsolicited mailings or netnews postings is derived from a Monty Python sketch set in a movie/tv studio cafeteria. During that sketch, the word \"spam\" takes over each item offered on the menu until the entire dialogue consists of nothing but \"spam spam spam spam spam spam and spam.\" This so closely resembles what happens when mass unsolicited mail and posts take over mailing lists and netnews groups that the term has been pushed into common usage in the Internet community.",
      "ja": "「スパム」という用語は、大量の未承諾の郵送またはNetNewsの投稿を示すために使用されます。映画/テレビスタジオカフェテリアに設定されたモンティパイソンスケッチから派生しています。そのスケッチの間、「スパム」という言葉は、ダイアログ全体が「スパムスパムスパムスパムスパムとスパム」以外に構成されるまで、メニューで提供される各アイテムを引き継ぎます。これは、大規模な未承諾のメールと投稿がメーリングリストとネットネークのグループを引き継ぐと、インターネットコミュニティで一般的な使用にプッシュされたときに起こることに非常に似ています。"
    },
    {
      "indent": 3,
      "text": "When unsolicited mail is sent to a mailing list and/or news group it frequently generates more hate mail to the list or group or apparent sender by people who do not realize the true source of the message. If the mailing contains suggestions for removing your name from a mailing list, 10s to 100s of people will respond to the list with \"remove\" messages meant for the originator. So, the original message (spam) creates more unwanted mail (spam spam spam spam), which generates more unwanted mail (spam spam spam spam spam spam and spam). Similar occurrences are perpetrated in newsgroups, but this is held somewhat in check by \"cancelbots\" (programs which cancel postings) triggered by mass posting. Recently, cancelbots have grown less in favor with those administering News servers since the cancelbots are now generating the same amount of traffic as spam. Even News admins are beginning to use filters, demonstrating that spam spam spam spam spam spam and spam is a monumental problem.",
      "ja": "未承諾のメールがメーリングリストやニュースグループに送信されると、メッセージの真のソースを認識していない人々によって、リストまたはグループまたは見かけの送信者により多くの憎悪メールを生成します。メーリングにメーリングリストから名前を削除するための提案が含まれている場合、10代から100人の人々が、オリジネーター向けの「削除」メッセージでリストに応答します。そのため、元のメッセージ（スパム）は、より多くの不要なメール（スパムスパムスパムスパム）を作成し、より多くの不要なメール（スパムスパムスパムスパムスパムとスパム）を生成します。同様の出来事はニュースグループで行われますが、これは大量の投稿によってトリガーされる「キャンセルボット」（投稿をキャンセルするプログラム）によって多少抑制されます。最近、CancelbotsがSPAMと同じ量のトラフィックを生成しているため、Cancelbotsはニュースサーバーを管理するものに好意的に成長していません。ニュース管理者でさえフィルターを使用し始めており、スパムスパムスパムスパムスパムとスパムが記念碑的な問題であることを示しています。"
    },
    {
      "indent": 0,
      "text": "3. Why Mass Mailing is Bad",
      "section_title": true,
      "ja": "3. なぜ大量の郵送が悪いのか"
    },
    {
      "indent": 3,
      "text": "In the world of paper mail we're all used to receiving unsolicited circulars, advertisements, and catalogs. Generally we don't object to this - we look at what we find of interest, and we discard/recycle the rest. Why should receiving unsolicited email be any different?",
      "ja": "紙メールの世界では、私たちは皆、未承諾の回覧、広告、カタログを受け取ることに慣れています。一般的に、私たちはこれに反対しません - 私たちは興味のあるものを見て、残りを破棄/リサイクルします。なぜ未承諾の電子メールを受信する必要があるのですか？"
    },
    {
      "indent": 3,
      "text": "The answer is that the cost model is different. In the paper world, the cost of mailing is borne by the sender. The sender must pay for the privilege of creating the ad and the cost of mailing it to the recipient. An average paper commercial mailing in the U.S. ends up costing about $1.00 per addressee. In the world of electronic communications, the recipient bears the majority of the cost. Yes, the sender still has to compose the message and the sender has to pay for Internet connectivity. However, the recipient ALSO has to pay for Internet connectivity and possibly also connect time charges and for disk space. For electronic mailings the recipient is expected to help share the cost of the mailing. Bulk Internet mail from the U.S. ends up costing the sender only about 1/100th of a cent per address; or FOUR ORDERS of magnitude LESS than bulk paper mailings!",
      "ja": "答えは、コストモデルが異なるということです。紙の世界では、郵送のコストは送信者が負担します。送信者は、広告を作成する特権と受信者に郵送する費用を支払う必要があります。米国での平均的な紙の商業郵送は、宛先あたり約1.00ドルかかることになります。電子通信の世界では、受信者はコストの大部分を負担します。はい、送信者はまだメッセージを作成する必要があり、送信者はインターネット接続の代金を支払う必要があります。ただし、受信者はインターネット接続の代金も支払う必要があり、場合によっては時間費用とディスクスペースも接続する必要があります。電子郵送の場合、受信者は郵送のコストを共有するのに役立つと予想されます。米国からのバルクインターネットメールは、住所あたり約1/100セントしか送信者にかかりません。または、大量の紙の郵送よりも4桁少ない！"
    },
    {
      "indent": 3,
      "text": "Of course, this cost model is very popular with those looking for cheap methods to get their message out. By the same token, it's very unpopular with people who have to pay for their messages just to find that their mailbox is full of junk mail. Neither do they appreciate being forced to spend time learning how to filter out unwanted messages. Consider this: if you had to pay for receiving paper mail would you pay for junk mail?",
      "ja": "もちろん、このコストモデルは、メッセージを伝えるための安価な方法を探している人に非常に人気があります。同様に、メールボックスがジャンクメールでいっぱいであることを見つけるためだけにメッセージを支払わなければならない人にとって、それは非常に人気がありません。彼らは、不要なメッセージを除外する方法を学ぶことに時間を費やすことを余儀なくされていることにも感謝していません。これを考えてみてください：紙メールを受け取るために支払わなければならなかった場合、ジャンクメールの代金を支払いますか？"
    },
    {
      "indent": 3,
      "text": "Another consideration is that the increase in volume of spam will have an impact on the viability of electronic mail as a communications medium. If, when you went to your postal mail box you found four crates of mail, would you be willing to search through the crates for the one or two pieces of mail which were not advertising? Spam has a tremendous potential to create this scenario in the electronic world.",
      "ja": "別の考慮事項は、スパムの量の増加が、通信媒体としての電子メールの実行可能性に影響を与えることです。郵便郵便箱に行ったときに、郵便物の4つの箱を見つけた場合、広告ではない1つまたは2つのメールをクレートで検索しても構わないと思いますか？スパムには、電子の世界でこのシナリオを作成する大きな可能性があります。"
    },
    {
      "indent": 3,
      "text": "Frequently spammers indulge in unethical behavior such as using mail servers which allow mail to be relayed to send huge amounts of electronic solicitations. Or they forge their headers to make it look as if the mail originates from a different domain. These people don't care that they're intruding into a personal or business mailbox nor do they care that they are using other people's resources without compensating them.",
      "ja": "頻繁にスパマーは、メールサーバーを使用するなど、膨大な量の電子勧誘を送信できるようにするメールサーバーを使用するなどの非倫理的な行動にふけることがよくあります。または、ヘッダーを偽造して、メールが異なるドメインから発信されるかのように見せます。これらの人々は、個人またはビジネスのメールボックスに侵入していることを気にしませんし、他の人のリソースを補償せずに使用していることを気にしません。"
    },
    {
      "indent": 3,
      "text": "The huge cost difference has other bad effects. Since even a very cheap paper mailing is going to cost tens of (U.S.) cents there is a real incentive to send only to those really likely to be interested.",
      "ja": "巨大なコストの違いには、他の悪い影響があります。非常に安価な紙の郵送でさえ、数十セントの費用がかかるので、本当に興味がある可能性が高い人にのみ送るという本当のインセンティブがあります。"
    },
    {
      "indent": 3,
      "text": "So paper bulk mailers frequently pay a premium to get high quality mailing lists, carefully prune out bad addresses and pay for services to update old addresses. Bulk email is so cheap that hardly anyone sending it bothers to do any of this. As a result, the chance that the receiver is actually interested in the mail is very, very, very low.",
      "ja": "そのため、紙のバルクメーラーは頻繁にプレミアムを支払い、高品質のメーリングリストを取得し、悪いアドレスを慎重に剪定し、古い住所を更新するためのサービスの支払いを行います。バルクメールは非常に安価であるため、これを行うためにそれを送る人はほとんどいません。その結果、レシーバーが実際にメールに関心を持っている可能性は非常に、非常に低くなります。"
    },
    {
      "indent": 3,
      "text": "As of the date of this document, it is a daily event on the Internet for a mail service to melt-down due to an overload of spam. Every few months this happens to a large/major/regional/ national/international service provider resulting in denial of or severe degradation of service to hundreds of thousands of users. Such service degradations usually prompt the providers to spend hundreds of thousands of dollars upgrading their mail service equipment just because of the volume of spam. Service providers pass those costs on to customers.",
      "ja": "このドキュメントの日付の時点で、これはインターネット上の毎日のイベントであり、スパムの過負荷のためにメールサービスが溶けてしまうことです。数か月ごとに、これは大規模/メジャー/地域/国内/国際サービスプロバイダーに起こり、数十万人のユーザーに対するサービスの否定または深刻な劣化をもたらします。このようなサービスの劣化により、通常、プロバイダーはスパムの量だけでメールサービス機器をアップグレードする数十万ドルを費やすように促します。サービスプロバイダーは、それらのコストを顧客に渡します。"
    },
    {
      "indent": 3,
      "text": "Doesn't the U.S. Constitution guarantee the ability to say whatever one likes? First, the U.S. Constitution is law only in the U.S., and the Internet is global. There are places your mail will reach where free speech is not a given. Second, the U.S. Constitution does NOT guarantee one the right to say whatever one likes. In general, the U.S. Constitution refers to political freedom of speech and not to commercial freedom of speech. Finally, and most importantly, the U.S. Constitution DOES NOT guarantee the right to seize the private property of others in order to broadcast your speech. The Internet consists of a vast number of privately owned networks in voluntary cooperation. There are laws which govern other areas of electronic communication, namely the \"junk fax\" laws. Although these have yet to be applied to electronic mail they are still an example of the \"curbing\" of \"free speech.\" Free speech does not, in general, require other people to spend their money and resources to deliver or accept your message.",
      "ja": "米国憲法は、好きなものを何でも言う能力を保証しませんか？第一に、米国憲法は米国でのみ法律であり、インターネットはグローバルです。あなたのメールが言論の自由が与えられていない場所に届く場所があります。第二に、米国憲法は、好きなことを言う権利を保証するものではありません。一般に、米国憲法は、商業的言論の自由ではなく、政治的言論の自由を指します。最後に、そして最も重要なことは、米国憲法は、スピーチを放送するために他者の私有財産を押収する権利を保証しないことです。インターネットは、自発的な協力における膨大な数の個人所有のネットワークで構成されています。電子通信の他の分野、つまり「ジャンクファックス」法を支配する法律があります。これらはまだ電子メールに適用されていませんが、「言論の自由」の「抑制」の例です。言論の自由は、一般に、他の人があなたのメッセージを届けたり受け入れたりするためにお金とリソースを使うことを要求しません。"
    },
    {
      "indent": 3,
      "text": "Most responsible Internet citizens have come to regard unsolicited mail/posts as \"theft of service\". Since the recipient must pay for the service and for the most part the mail/posts are advertisements of unsolicited \"stuff\" (products, services, information) those receiving it believe that the practice of making the recipient pay constitutes theft.",
      "ja": "ほとんどの責任あるインターネット市民は、未承諾のメール/投稿を「サービスの盗難」と見なすようになりました。受信者はサービスの代金を支払う必要があり、ほとんどの場合、メール/投稿は未承諾の「もの」（製品、サービス、情報）の広告です。"
    },
    {
      "indent": 3,
      "text": "The crux of sending large amounts of unsolicited mail and news is not a legal issue so much as an ethical one. If you are tempted to send unsolicited \"information\" ask yourself these questions: \"Whose resources is this using?\" \"Did they consent in advance?\" \"What would happen if everybody (or a very large number of people) did this?\" \"How would you feel if 90% of the mail you received was advertisements for stuff you didn't want?\" \"How would you feel if 95% of the mail you received was advertisements for stuff you didn't want?\" \"How would you feel if 99% of the mail you received was advertisements for stuff you didn't want?\"",
      "ja": "大量の未承諾のメールとニュースを送信するという核心は、倫理的なものほど法的問題ではありません。未承諾の「情報」を送信したい場合は、これらの質問を自問してください。「彼らは事前に同意しましたか？」「誰もがこれをした場合はどうなりますか？」「受け取ったメールの90％が、あなたが望んでいないものの広告であったらどう思いますか？」「受け取ったメールの95％が、あなたが望んでいないものの広告だったらどう思いますか？」「受け取ったメールの99％が、あなたが望んでいないものの広告であったらどう思いますか？」"
    },
    {
      "indent": 3,
      "text": "Although numbers on the volume and rate of increase of spam are not easy to find, seat-of-the-pants estimates from the people on spam discussion mailing lists [1] indicate that unsolicited mail/posts seems to be following the same path of exponential growth as the Internet as a whole [2]. This is NOT encouraging, as this kind of increase puts a strain on servers, connections, routers, and the bandwidth of the Internet as a whole. On a per person basis, unsolicited mail is also on the increase, and individuals also have to bear the increasing cost of increasing numbers of unsolicited and unwanted mail. People interested in hard numbers may want to point their web browsers to http://www.techweb.com/se/directlink.cgi?INW19980504S0003 where Internet Week reports what spam costs.",
      "ja": "スパムの量と増加率の数値は簡単に見つけることができませんが、スパムディスカッションメーリングリスト[1]の人々からのパンツの見積もりは、未承諾のメール/投稿が同じ道をたどっているように見えることを示しています。インターネット全体としての指数関数的な成長[2]。この種の増加は、インターネット全体のサーバー、接続、ルーター、および帯域幅に負担をかけるため、これは励みになりません。一人当たりにおいて、未承諾のメールも増加しており、個人は、未承諾および不要なメールの数を増やすコストを増やす必要があります。ハードナンバーに興味のある人は、Webブラウザをhttp://www.techweb.com/se/directlink.cgi?inw19980504s0003に指して、インターネットウィークがスパムコストを報告しています。"
    },
    {
      "indent": 3,
      "text": "Finally, sending large volumes of unsolicited email or posting voluminous numbers of Netnews postings is just plain rude. Consider the following analogy: Suppose you discovered a large party going on in a house on your block. Uninvited, you appear, then join each group in conversation, force your way in, SHOUT YOUR OPINION (with a megaphone) of whatever you happen to be thinking about at the time, drown out all other conversation, then scream \"discrimination\" when folks tell you you're being rude.",
      "ja": "最後に、大量の未承諾の電子メールを送信したり、膨大な数のNetNewsの投稿を投稿したりするのは、単なる失礼です。次の類推を考えてみましょう。ブロックの家で大規模なパーティーが起こっていることを発見したとします。招待されていない、あなたは現れてから、各グループに会話に参加し、あなたの道を強制し、あなたがたまたま考えていることについてのあなたの意見（メガホンで）を叫び、他のすべての会話をかき消し、そして人々が「差別」を叫ぶあなたが失礼だと言ってください。"
    },
    {
      "indent": 3,
      "text": "To continue the party analogy, suppose instead of forcing your way into each group you stood on the outskirts a while and listened to the conversation. Then you gradually began to add comments relevant to the discussion. Then you began to tell people your opinion of the issues they were discussing; they would probably be less inclined to look badly on your intrusion. Note that you are still intruding. And that it would still be considered rude to offer to sell products or services to the guests even if the products and services were relevant to the discussion. You are in the wrong venue and you need to find the right one.",
      "ja": "パーティーの類推を継続するために、各グループにあなたの道を強制する代わりに、あなたはしばらく郊外に立って会話を聞いたと仮定します。その後、徐々に議論に関連するコメントを追加し始めました。それからあなたは彼らが議論している問題についてあなたの意見を人々に伝え始めました。彼らはおそらくあなたの侵入をひどく見る傾向が少ないでしょう。あなたはまだ侵入していることに注意してください。そして、たとえ製品やサービスが議論に関連していても、ゲストに製品やサービスを販売することを申し出ることはまだ失礼と見なされるでしょう。あなたは間違った会場にいて、正しい会場を見つける必要があります。"
    },
    {
      "indent": 3,
      "text": "Lots of spammers act as if their behavior can be forgiven by beginning their messages with an apology, or by personalizing their messages with the recipient's real name, or by using a number of ingratiating techniques. But much like the techniques used by Uriah Heep in Dickens' _David Copperfield_, these usually have an effect opposite to the one intended. Poor excuses (\"It's not illegal,\" \"This will be the only message you receive,\" \"This is an ad,\" \"It's easy to REMOVE yourself from our list\") are still excuses. Moreover, they are likely to make the recipient MORE aggravated rather than less aggravated.",
      "ja": "多くのスパマーは、あたかも彼らの行動が謝罪でメッセージを始めること、または受信者の本名でメッセージをパーソナライズすることによって、または多くのin gratiatingテクニックを使用することによって許されるように振る舞います。しかし、ディケンズの_david copperfield_でウリア・ヒープが使用したテクニックと同じように、これらは通常、意図したものとは反対の効果があります。貧弱な言い訳（「それは違法ではない」、「これはあなたが受け取る唯一のメッセージになるでしょう」、「これは広告です」、「私たちのリストから自分自身を削除するのは簡単です」）はまだ言い訳です。さらに、彼らは、それほど悪化するのではなく、受信者をより悪化させる可能性があります。"
    },
    {
      "indent": 3,
      "text": "In particular, there are two very severe problems with believing that a \"remove\" feature to stop future mail helps: (1) Careful tests have been done with sending remove requests for \"virgin\" email accounts (that have never been used anywhere else). In over 80% of the cases, this resulted in a deluge of unsolicited email, although usually from other sources than the one the remove was sent to. In other words, if you don't like unsolicited mail, you should think carefully before using a remove feature because the evidence is that it will result in more mail not less. (2) Even if it did work, it would not stop lots of new unsolicited email every day from new businesses that hadn't mailed before.",
      "ja": "特に、将来のメールを停止するための「削除」機能が役立つと信じることには2つの非常に深刻な問題があります。（1）「バージン」メールアカウントの削除リクエストを送信する際の慎重なテストが行われました（他の場所では使用したことがありません）。ケースの80％以上で、これにより、除去された電子メールが大洪水が発生しましたが、通常は削除が送信されたソースよりも他のソースからの電子メールが発生しました。言い換えれば、未承諾のメールが気に入らない場合は、削除機能を使用する前に慎重に検討する必要があります。（2）たとえそれが機能したとしても、以前に郵送していなかった新しいビジネスから毎日、新しい未承諾の電子メールを多く止めることはありません。"
    },
    {
      "indent": 0,
      "text": "4a. ACK! I've Been Spammed - Now What?",
      "ja": "4a。ack！私はスパムされました - 今何？"
    },
    {
      "indent": 3,
      "text": "It's unpleasant to receive mail which you do not want. It's even more unpleasant if you're paying for connect time to download it. And it's really unpleasant to receive mail on topics which you find offensive. Now that you're good and mad, what's an appropriate response?",
      "ja": "あなたが望んでいないメールを受け取るのは不快です。Connect Timeをダウンロードするのに費用をかけている場合、さらに不快です。そして、あなたが攻撃的だと思うトピックに関するメールを受け取ることは本当に不快です。あなたが元気で怒っているので、適切な反応は何ですか？"
    },
    {
      "indent": 3,
      "text": "First, you always have the option to delete it and get on with your life. This is the easiest and safest response. It does not guarantee you won't get more of the same in the future, but it does take care of the current problem. Also, if you do not read your mail on a regular basis it is possible that your complaint is much too late to do any good.",
      "ja": "まず、あなたはそれを削除してあなたの人生を続けるオプションを常に持っています。これは最も簡単で安全な応答です。将来同じことを得ることはできないことを保証するものではありませんが、現在の問題を処理します。また、定期的にメールを読まなければ、苦情が遅すぎて、何でもするには遅すぎる可能性があります。"
    },
    {
      "indent": 3,
      "text": "Second, consider strategies that take advantage of screening technology. You might investigate technologies that allow you to filter unwanted mail before you see it. Some software allows you to scan subject lines and delete unwanted messages before you download them. Other programs can be configured to download portions of messages, check them to see if they are advertising (for example) and delete them before the whole message is downloaded.",
      "ja": "第二に、スクリーニング技術を活用する戦略を検討します。表示される前に、不要なメールをフィルタリングできるテクノロジーを調査する場合があります。一部のソフトウェアでは、ダウンロードする前に、件名をスキャンして不要なメッセージを削除できます。他のプログラムは、メッセージの一部をダウンロードし、それらが広告（たとえば）であるかどうかを確認し、メッセージ全体がダウンロードされる前にそれらを削除するように構成できます。"
    },
    {
      "indent": 3,
      "text": "Also, your organization or your local Internet Service Provider may have the ability to block unwanted mail at their mail relay machines and thus spare you the hassle of dealing with it at all. It is worth inquiring about this possibility if you are the victim of frequent spam.",
      "ja": "また、あなたの組織または地元のインターネットサービスプロバイダーは、メールリレーマシンで不要なメールをブロックすることができ、それを扱うことができるようにすることができます。あなたが頻繁なスパムの犠牲者である場合、この可能性について尋ねる価値があります。"
    },
    {
      "indent": 3,
      "text": "Your personal mailer software may allow you to write rules defining what you do and do not wish to read. If so, write a rule which sends mail from the originator of the unwanted mail to the trash. This will work if one sender or site repeatedly bothers you. You may also consider writing other rules based on other headers if you are sure the probability of them being activated for non-spam is low enough. That way, although you may still have to pay to download it, you won't have to read it!",
      "ja": "あなたの個人的なメーラーソフトウェアを使用すると、自分がしていることと読みたくないことを定義するルールを書くことができます。もしそうなら、不要なメールの発信者からゴミ箱にメールを送信するルールを書きます。これは、1つの送信者またはサイトが繰り返し気になる場合に機能します。また、非スパムのためにそれらがアクティブ化される可能性が十分に低いと確信している場合、他のヘッダーに基づいて他のルールを書くことを検討することもできます。そうすれば、ダウンロードするためにまだ支払う必要があるかもしれませんが、読む必要はありません！"
    },
    {
      "indent": 3,
      "text": "Third, you may consider sending the mail back to the originator objecting to your being on the mailing-list; however, we recommend against this. First, a lot of spammers disguise who they are and where their mail comes from by forging the mail headers. Unless you are very experienced at reading headers discovering the true origin of the mail will probably prove difficult. Although you can engage your local support staff to help you with this, they may have much higher priorities (such as setting up site-wide filters to prevent spam from entering the site). Second, responding to this email will simply verify your address as valid and make your address more valuable for other (ab)uses (as was mentioned above in Section 3). Third, even if the two previous things do not happen, very probably your mail will be directed to the computer equivalent of a black hole (the bit-bucket).",
      "ja": "第三に、あなたはあなたが郵送リストに載っていることに反対するオリジネーターにメールを送り返すことを検討するかもしれません。ただし、これに反対することをお勧めします。第一に、多くのスパマーが、彼らが誰であり、メールのヘッダーを偽造することによって彼らのメールがどこから来ているのかを隠しています。メールの真の起源を発見してヘッダーを読んでいない限り、おそらく困難であることが判明します。これを支援するために地元のサポートスタッフをエンゲージすることができますが、彼らははるかに高い優先順位を持っているかもしれません（SPAMがサイトに入るのを防ぐためにサイト全体のフィルターをセットアップするなど）。第二に、この電子メールに応答すると、アドレスが有効であると確認され、アドレスを他の（ab）使用するためにより価値のあるものにします（上記のセクション3で説明しました）。第三に、たとえ2つの以前のことが起こらない場合でも、おそらくあなたのメールは、ブラックホール（ビットバケット）に相当するコンピューターに向けられます。"
    },
    {
      "indent": 3,
      "text": "As of the writing of this document, there are several pieces of pending legislation in several jurisdictions about the sending of unsolicited mail and also about forging headers. If forging of headers should become illegal, then responding to the sender is less risky and may be useful.",
      "ja": "この文書の執筆時点では、未承諾メールの送信とヘッダーの鍛造に関するいくつかの管轄区域には、いくつかの保留中の法律があります。ヘッダーの鍛造が違法になる場合、送信者への応答はリスクが低く、有用である可能性があります。"
    },
    {
      "indent": 3,
      "text": "Certainly we advocate communicating to the originator (as best as you can tell) to let them know you will NOT be buying any products from them as you object to the method they have chosen to conduct their business (aka spam). Most responses through media other than electronic mail (mostly by those who take the time to phone included \"800\" (free to calling party in the U.S.) phone numbers) have proved somewhat effective. You can also call the business the advertisement is for, ask to speak to someone in authority, and then tell them you will never buy their products or use their services because their advertising mechanism is spam.",
      "ja": "確かに、私たちは、彼らが彼らのビジネスを行うために選択した方法（別名スパム）に異議を唱えるとき、あなたが彼らから製品を購入しないことを彼らに知らせるために、彼らに彼らが彼らから購入しないことを彼らに知らせるために彼らに彼らを知らせるために彼らに彼らに伝えるために彼らに伝えるために彼らに彼らに伝えることを彼らに彼らに知らせるために彼らに彼らに彼らに伝えることを提唱することを提唱する。電子メール以外のメディアを介したほとんどの回答（主に電話に時間をかける人による「800」（米国では無料）の電話番号が含まれています）がやや効果的であることが証明されています。また、広告のためのビジネスに電話して、権限のある人に話すように頼んでから、広告メカニズムがスパムであるため、製品を購入したりサービスを使用したりしないことを伝えます。"
    },
    {
      "indent": 3,
      "text": "Next, you can carbon copy or forward the questionable mail messages or news postings to your postmaster. You can do this by sending mail \"To: Postmaster@your-site.example.\" Your postmaster should be an expert at reading mail headers and will be able to tell if the originating address is forged. He or she may be able to pinpoint the real culprit and help close down the site. If your postmaster wants to know about unsolicited mail, be sure s/he gets a copy, including headers. You will need to find out the local policy and comply.",
      "ja": "次に、疑わしいメールメッセージまたはニュース投稿をポストマスターにコピーまたは転送できます。これを行うには、メールを「postmaster@yoursite.example」に送信できます。あなたの郵便局長は、メールのヘッダーを読むことの専門家である必要があり、発信者のアドレスが偽造されているかどうかを判断することができます。彼または彼女は、本当の犯人を特定し、サイトを閉鎖するのを助けることができるかもしれません。郵便局長が未承諾のメールについて知りたい場合は、ヘッダーを含むコピーを取得してください。ローカルポリシーを見つけて遵守する必要があります。"
    },
    {
      "indent": 29,
      "text": "*** IMPORTANT ***",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Wherever you send a complaint, be sure to include the full headers (most mail and news programs don't display the full headers by default). For mail it is especially important to show the \"Received:\" headers. For Usenet news, it is the \"Path:\" header. These normally show the route by which the mail or news was delivered. Without them, it's impossible to even begin to tell where the message originated. See the appendix for an example of a mail header.",
      "ja": "苦情を送る場所はどこでも、完全なヘッダーを含めてください（ほとんどのメールとニュースプログラムは、デフォルトで完全なヘッダーを表示しません）。メールでは、「受信」ヘッダーを表示することが特に重要です。Usenet Newsの場合、それは「パス：」ヘッダーです。これらは通常、メールまたはニュースが配信されたルートを示しています。それらがなければ、メッセージがどこから生まれたのかを知ることさえ不可能です。メールヘッダーの例については、付録を参照してください。"
    },
    {
      "indent": 3,
      "text": "There is lively and ongoing debate about the validity of changing one's email address in a Web Browser in order to have Netnews posts and email look as if it is originating from some spot other than where it does originate. The reasoning behind this is that web email address harvesters will not be getting a real address when it encounters these. There is reason on both sides of this debate: If you change your address, you will not be as visible to the harvesters, but if you change your address, real people who need to contact you will be cut off as well. Also, if you are using the Internet through an organization such as a company, the company may have policies about \"forging\" addresses - even your own! Most people agree that the consequences of changing your email address on your browser or even in your mail headers is fairly dangerous and will nearly guarantee your mail goes into a black hole unless you are very sure you know what you are doing.",
      "ja": "NetNewsの投稿と電子メールが、それが発生している場所以外の場所から生まれているかのように見えるように、Webブラウザで自分のメールアドレスを変更することの有効性について、活発で継続的な議論があります。この背後にある理由は、Webメールアドレスの収穫機がこれらに遭遇したときに実際のアドレスを取得しないということです。この議論の両側には理由があります。住所を変更した場合、ハーベスターに見えることはありませんが、住所を変更すると、連絡する必要がある実際の人々も同様に切り取られます。また、会社などの組織を通じてインターネットを使用している場合、会社は自分の住所でさえ「鍛造」アドレスに関するポリシーを持っている可能性があります。ほとんどの人は、ブラウザやメールヘッダーでメールアドレスを変更する結果はかなり危険であり、自分が何をしているのかわからない限り、メールがブラックホールに入ることをほぼ保証することに同意します。"
    },
    {
      "indent": 3,
      "text": "Finally, DO NOT respond by sending back large volumes of unsolicited mail. Two wrongs do not make a right; do not become your enemy; and take it easy on the network. While the legal status of spam is uncertain, the legal status (at least in the U.S.) of a \"mail bomb\" (large numbers and/or sizes of messages to the site with the intent of disabling or injuring the site) is pretty clear: it is criminal.",
      "ja": "最後に、大量の未承諾メールを送り返しても応答しないでください。2つの間違いは正しいことではありません。あなたの敵にならないでください。そして、ネットワークで簡単にしてください。スパムの法的状況は不確実ですが、「郵便爆弾」の法的地位（少なくとも米国では）（サイトを無効にしたり負傷させたりすることを目的としたサイトへのメッセージの多数および/またはサイズ）はかなり明確です：それは犯罪者です。"
    },
    {
      "indent": 3,
      "text": "There is a web site called \"www.abuse.net\" which allows you to register, then send your message to the name of the \"offending-domain@abuse.net,\" which will re-mail your message to the best reporting address for the offending domain. The site contains good tips for reporting abuse netnews or email messages. It also has some automated tools that you may download to help you filter your messages. Also check CIAC bulletin I-005 at:",
      "ja": "「www.abuse.net」というWebサイトがあり、登録してから、「offending-domain@abuse.net」の名前にメッセージを送信します。問題のドメインの場合。このサイトには、悪用のネットネーワや電子メールメッセージを報告するための優れたヒントが含まれています。また、メッセージをフィルタリングするのに役立ついくつかの自動化されたツールもあります。また、以下でCIAC Bulletin I-005を確認します"
    },
    {
      "indent": 6,
      "text": "http://ciac.llnl.gov/ciac/bulletins/i-005c.shtml",
      "ja": "http://ciac.llnl.gov/ciac/bulletins/i-005c.shtml"
    },
    {
      "indent": 3,
      "text": "or at:",
      "ja": "または："
    },
    {
      "indent": 6,
      "text": "http://spam.abuse.net/spam/tools/mailblock.html.",
      "ja": "http://spam.abuse.net/spam/tools/mailblock.html."
    },
    {
      "indent": 3,
      "text": "Check the Appendix for a detailed explanation of tools and methodology to use when trying to chase down a spammer.",
      "ja": "スパマーを追いかけようとするときに使用するツールと方法論の詳細な説明については、付録を確認してください。"
    },
    {
      "indent": 0,
      "text": "4b. There's a Spam in My Group!",
      "ja": "4b。私のグループにスパムがあります！"
    },
    {
      "indent": 3,
      "text": "Netnews is also subject to spamming. Here several factors help to mitigate against the propagation of spam in news, although they don't entirely solve the problem. Newsgroups and mailing lists may be moderated, which means that a moderator approves all mail/posts. If this is the case, the moderator usually acts as a filter to remove unwanted and off-topic posts/mail.",
      "ja": "NetNewsはスパムの対象となります。ここでは、いくつかの要因がニュースでスパムの伝播に対して緩和するのに役立ちますが、問題は完全には解決しません。ニュースグループとメーリングリストはモデレートされる場合があります。つまり、モデレーターはすべてのメール/投稿を承認します。この場合、モデレーターは通常、不要な投稿/トピック外の投稿/メールを削除するフィルターとして機能します。"
    },
    {
      "indent": 3,
      "text": "In Netnews there are programs which detect posts which have been sent to multiple groups or which detect multiple posts from the same source to one group. These programs cancel the posts. While these work and keep unsolicited posts down, they are not 100% effective and spam in newsgroups seems to be growing at an even faster rate than spam in mail or on mailing lists. After all, it's much easier to post to a newsgroup for which there are thousands of readers than it is to find individual email addresses for all those folks. Hence the development of the \"cancelbots\" (sometimes called \"cancelmoose\") for Netnews groups. Cancelbots are triggered when one message is sent to a large number of newsgroups or when many small messages are sent (from one sender) to the same newsgroup. In general these are tuned to the \"Breidbart Index\" [3] which is a somewhat fuzzy measure of the interactions of the number of posts and number of groups. This is fuzzy purposefully, so that people will not post a number of messages just under the index and still \"get away with it.\" And as noted above, the cancel messages have reached such a volume now that a lot of News administrators are beginning to write filters rather than send cancels. Still spam gets through, so what can a concerned netizen do?",
      "ja": "NetNewsには、複数のグループに送信された、または同じソースから1つのグループに複数の投稿を検出する投稿を検出するプログラムがあります。これらのプログラムは投稿をキャンセルします。これらの作業と未承諾の投稿を維持しますが、ニュースグループのスパムは100％効果的ではなく、郵便やメーリングリストのスパムよりもさらに速いレートで成長しているようです。結局のところ、すべての人々の個々のメールアドレスを見つけるよりも、何千人もの読者がいるニュースグループに投稿する方がはるかに簡単です。したがって、NetNewsグループの「Cancelbots」（「CancelMoose」と呼ばれることもあります）の開発。Cancelbotsは、1つのメッセージが多数のニュースグループに送信される場合、または多くの小さなメッセージが（1つの送信者から）同じニュースグループに送信されるとトリガーされます。一般に、これらは「Breidbart Index」[3]に調整されています。これは、投稿数とグループ数の相互作用のややファジーな尺度です。これは意図的にファジーであるため、人々はインデックスのすぐ下に多くのメッセージを投稿せず、それでも「それで逃げる」ことができます。上記のように、キャンセルメッセージは、多くのニュース管理者がキャンセルを送信するのではなく、フィルターを書き始めているように、そのようなボリュームに到達しました。まだスパムが通り抜けているので、関係するネチズンは何ができますか？"
    },
    {
      "indent": 3,
      "text": "If there is a group moderator, make sure s/he knows that off-topic posts are slipping into the group. If there is no moderator, you could take the same steps for dealing with news as are recommended for mail with all the same caveats.",
      "ja": "グループモデレーターがある場合は、トピック外の投稿がグループに滑り込んでいることを知っていることを確認してください。モデレーターがない場合は、同じ注意事項を備えたメールに推奨されるように、ニュースを扱うために同じ手順を実行することができます。"
    },
    {
      "indent": 3,
      "text": "A reasonable printed reference one might obtain has been published by O'Reilly and Associates, _Stopping Spam_, by Alan Schwartz and Simson Garfinkel [4]. This book also has interesting histories of spammers such as Cantor and Siegel, and Jeff Slaton. It gives fairly clear instructions for filtering mail and news.",
      "ja": "得られる合理的な印刷された参照が、O'Reilly and Associates、_Stopping Spam_、Alan SchwartzとSimson Garfinkel [4]によって公開されています。この本には、CantorやSiegel、Jeff Slatonなどのスパマーの興味深い歴史もあります。これは、メールとニュースをフィルタリングするためのかなり明確な指示を提供します。"
    },
    {
      "indent": 0,
      "text": "5. Help for Beleaguered Admins",
      "section_title": true,
      "ja": "5. 悩まされた管理者の助けを借ります"
    },
    {
      "indent": 3,
      "text": "As a system administrator, news administrator, local Postmaster, or mailing-list administrator, your users will come to you for help in dealing with unwanted mail and posts. First, find out what your institution's policy is regarding unwanted/unsolicited mail. It is possible that it won't do anything for you, but it is also possible to use it to justify blocking a domain which is sending particularly offensive mail to your users. If you don't have a clear policy, it would be really useful to create one. If you are a mailing-list administrator, make sure your mailing-list charter forbids off-topic posts. If your internal-only newsgroups are getting spammed from the outside of your institution, you probably have bigger security problems than just spam.",
      "ja": "システム管理者、ニュース管理者、ローカルポストマスター、またはメーリングリスト管理者として、ユーザーは不要なメールや投稿に対処するのに役立ちます。まず、不要な/未承諾メールに関する機関のポリシーが何であるかを調べます。それはあなたのために何もしない可能性がありますが、特に攻撃的なメールをユーザーに送信しているドメインのブロックを正当化するために使用することもできます。明確なポリシーがない場合は、本を作成することは本当に便利です。あなたが郵送リストの管理者である場合は、郵送リストのチャーターがトピック外の投稿を禁止することを確認してください。内部のみのニュースグループがあなたの機関の外部からスパムされている場合、おそらくスパムよりも大きなセキュリティ上の問題があるでしょう。"
    },
    {
      "indent": 3,
      "text": "Make sure that your mail and news transports are configured to reject messages injected by parties outside your domain. Recently misconfigured Netnews servers have become subject to hijacking by spammers. SMTP source routing <@relay.host:user@dest.host> is becoming deprecated due to its overwhelming abuse by spammers. You should configure your mail transport to reject relayed messages (when neither the sender nor the recipient are within your domain). Check:",
      "ja": "メールおよびニューストランスポートが、ドメインの外側の関係者が挿入したメッセージを拒否するように構成されていることを確認してください。最近、誤解されたNetNewsサーバーは、スパマーによるハイジャックの対象となりました。smtpソースルーティング<@relay.host：user@dest.host>は、スパマーによる圧倒的な虐待のために非難されています。リレーしたメッセージを拒否するようにメールトランスポートを構成する必要があります（送信者も受信者もドメイン内にいない場合）。チェック："
    },
    {
      "indent": 25,
      "text": "http://www.sendmail.org/",
      "ja": "http://www.sendmail.org/"
    },
    {
      "indent": 3,
      "text": "under the \"Anti-Spam\" heading.",
      "ja": "「スパムアンチスパム」見出しの下。"
    },
    {
      "indent": 3,
      "text": "If you run a firewall at your site, it can be configured in ways to discourage spam. For example, if your firewall is a gateway host that itself contains an NNTP server, ensure that it is configured so it does not allow access from external sites except your news feeds. If your firewall acts as a proxy for an external news-server, ensure that it does not accept NNTP connections other than from your internal network. Both these potential holes have recently been exploited by spammers. Ensure that email messages generated within your domain have proper identity information in the headers, and that users cannot forge headers. Be sure your headers have all the correct information as stipulated by RFC 822 [5] and RFC 1123 [6].",
      "ja": "サイトでファイアウォールを実行すると、スパムを思いとどまらせる方法で構成できます。たとえば、ファイアウォールがNNTPサーバーを含むゲートウェイホストの場合、ニュースフィード以外の外部サイトからのアクセスを許可しないように、構成されていることを確認してください。ファイアウォールが外部ニュースサーバーのプロキシとして機能する場合は、内部ネットワーク以外のNNTP接続を受け入れないことを確認してください。これらの両方の潜在的な穴は、最近スパマーによって悪用されています。ドメイン内で生成された電子メールメッセージがヘッダーに適切なID情報を持っていること、およびユーザーがヘッダーを偽造できないことを確認してください。RFC 822 [5]およびRFC 1123 [6]によって規定されているように、ヘッダーがすべて正しい情報を持っていることを確認してください。"
    },
    {
      "indent": 3,
      "text": "If you are running a mailing-list, allowing postings only by subscribers means a spammer would actually have to join your list before sending spam messages, which is unlikely. Make sure your charter forbids any off-topic posts. There is another spam-related problem with mailing-lists which is that spammers like to retaliate on those who work against them by mass-subscribing their enemies to mailing-lists. Your mailing-list software should require confirmation of the subscription, and only then should the address be subscribed.",
      "ja": "メーリングリストを実行している場合、サブスクライバーによってのみ投稿を許可すると、スパムメッセージがスパムメッセージを送信する前に実際にリストに参加する必要があることを意味します。チャーターがオフトピックの投稿を禁止することを確認してください。メーリングリストには別のスパム関連の問題があります。これは、敵を郵送リストに大量に抑制することで、スパマーが彼らに対して働く人々に報復することを好むということです。メーリングリストソフトウェアは、サブスクリプションの確認を必要とするはずであり、その後、アドレスを購読する必要があります。"
    },
    {
      "indent": 3,
      "text": "It is possible, if you are running a mail transfer agent that allows it, to block persistant offending sites from ever getting mail into your site. However, careful consideration should be taken before taking that step. For example, be careful not to block out sites for which you run MX records! In the long run, it may be most useful to",
      "ja": "それを許可するメール転送エージェントを実行している場合、永続的な問題のあるサイトがサイトにメールを入れることをブロックする可能性があります。ただし、そのステップを踏む前に慎重に検討する必要があります。たとえば、MXレコードを実行するサイトをブロックしないように注意してください！長期的には、最も便利かもしれません"
    },
    {
      "indent": 3,
      "text": "help your users learn enough about their mailers so that they can write rules to filter their own mail, or provide rules and kill files for them to use, if they so choose.",
      "ja": "ユーザーが自分のメールをフィルタリングするルールを作成したり、使用するルールを提供したり、ファイルを選択したりすることができるように、ユーザーがメーラーについて十分に学習できるようにします。"
    },
    {
      "indent": 3,
      "text": "There is information about how to configure sendmail available at \"www.sendmail.org.\" Help is also available at \"spam.abuse.net.\"",
      "ja": "「www.sendmail.org」で利用可能なsendmailを構成する方法に関する情報があります。ヘルプは「spam.abuse.net」でも入手できます。"
    },
    {
      "indent": 3,
      "text": "Another good strategy is to use Internet tools such as whois and traceroute to find which ISP is serving your problem site. Notify the postmaster or abuse (abuse@offending-domain.example) address that they have an offender. Be sure to pass on all header information in your messages to help them with tracking down the offender. If they have a policy against using their service to post unsolicited mail they will need more than just your say-so that there is a problem. Also, the \"originating\" site may be a victim of the offender as well. It's not unknown for those sending this kind of mail to bounce their mail through dial-up accounts, or off unprotected mail servers at other sites. Use caution and courtesy in your approach to those who look like the offender.",
      "ja": "もう1つの優れた戦略は、WhoisやTracerouteなどのインターネットツールを使用して、どのISPが問題サイトを提供しているかを見つけることです。ポストマスターまたは乱用（abuse@onfending-domain.example）に犯罪者がいることを通知します。メッセージのすべてのヘッダー情報を渡して、犯罪者の追跡を支援してください。彼らがサービスを使用して未承諾のメールを投稿することに対してポリシーを持っている場合、彼らはあなたの言う以上のものを必要とします - 問題があるということです。また、「起源の」サイトも犯罪者の犠牲者である可能性があります。この種のメールを送信して、ダイヤルアップアカウントを介してメールを送信したり、他のサイトで保護されていないメールサーバーを跳ね返したりする人は不明ではありません。犯罪者のように見える人へのあなたのアプローチには注意と礼儀を使用してください。"
    },
    {
      "indent": 3,
      "text": "News spammers use similar techniques for sending spam to the groups. They have been known to forge headers and bounce posts off \"open\" news machines and remailers to cover their tracks. During the height of the infamous David Rhodes \"Make Money Fast\" posts, it was not unheard of for students to walk away from terminals which were logged in, and for sneaky folks to then use their accounts to forge posts, much to the later embarrassment of both the student and the institution.",
      "ja": "ニューススパマーは、グループにスパムを送信するために同様のテクニックを使用しています。彼らは、ヘッダーを偽造し、「オープン」ニュースマシンとリメイラーの投稿をバウンスして、トラックをカバーすることが知られています。悪名高いデビッド・ロードスの「お金を稼ぐ」投稿の最中に、学生がターミナルから立ち去ることは前代未聞ではありませんでした。学生と機関の両方の。"
    },
    {
      "indent": 3,
      "text": "One way to lessen problems is to avoid using mail-to URLs on your web pages. They allow email addresses to be easily harvested by those institutions grabbing email addresses off the web. If you need to have an email address prevalent on a web page, consider using a cgi script to generate the mailto address.",
      "ja": "問題を軽減する1つの方法は、WebページでメールツーURLを使用しないようにすることです。それらは、ウェブからメールアドレスをつかむ機関によって簡単に収穫されることを許可します。Webページで一般的なメールアドレスを使用する必要がある場合は、CGIスクリプトを使用してMailToアドレスを生成することを検討してください。"
    },
    {
      "indent": 3,
      "text": "Participate in mailing lists and news groups which discuss unsolicited mail/posts and the problems associated with it. News.admin.net-abuse.misc is probably the most well-known of these.",
      "ja": "未承諾のメール/投稿とそれに関連する問題について議論するメーリングリストとニュースグループに参加します。news.admin.net-abuse.miscは、おそらくこれらの中で最もよく知られているでしょう。"
    },
    {
      "indent": 0,
      "text": "6. What's an ISP to Do",
      "section_title": true,
      "ja": "6. ISPとは何ですか"
    },
    {
      "indent": 3,
      "text": "As an Internet Service Provider, you first and foremost should decide what your stance against unsolicited mail and posts will be. If you decide not to tolerate unsolicited mail, write a clear Acceptable Use Policy which states your position and delineates consequences for abuse. If you state that you will not tolerate use of your resource for unsolicited mail/posts, and that the consequence will be loss of service, you should be able to cancel offending accounts relatively quickly (after verifying that the account really IS being mis-used). If you have downstreaming arrangements with other providers, you should make sure they are aware of any policy you set. Likewise, you should be aware of your upstream providers' policies.",
      "ja": "インターネットサービスプロバイダーとして、何よりもまず、未承諾のメールと投稿に対するあなたのスタンスが何であるかを決定する必要があります。未承諾のメールを容認しないことに決めた場合は、あなたの立場を述べ、虐待の結果を描写する明確な許容可能な使用ポリシーを書きます。未承諾のメール/投稿に対するリソースの使用を容認しないと述べ、結果はサービスの損失になると述べている場合、違反するアカウントを比較的迅速にキャンセルできるはずです（アカウントが実際に誤用されていることを確認した後、）。他のプロバイダーとのダウンストリーミングアレンジメントがある場合は、設定したポリシーを認識していることを確認する必要があります。同様に、上流のプロバイダーのポリシーに注意する必要があります。"
    },
    {
      "indent": 3,
      "text": "Consider limiting access for dialup accounts so they cannot be used by those who spew. Make sure your mail servers aren't open for mail to be bounced off them (except for legitimate users). Make sure your mail transfer agents are the most up-to-date version (which pass security audits) of the software.",
      "ja": "ダイヤルアップアカウントのアクセスを制限することを検討して、吐き出す人が使用できないようにしてください。メールサーバーが正当なユーザーを除く郵便物を跳ね返すために、メールサーバーが開いていないことを確認してください。メール転送エージェントがソフトウェアの最新バージョン（セキュリティ監査に合格）であることを確認してください。"
    },
    {
      "indent": 3,
      "text": "Educate your users about how to react to spew and spewers. Make sure instructions for writing rules for mailers are clear and available. Support their efforts to deal with unwanted mail at the local level - taking some of the burden from your system administrators.",
      "ja": "噴水や噴水にどのように反応するかについてユーザーに教育します。メーラーのルールを書くための指示が明確で利用可能であることを確認してください。ローカルレベルで不要なメールに対処するための努力をサポートします - システム管理者からの負担の一部を取得してください。"
    },
    {
      "indent": 3,
      "text": "Make sure you have an address for abuse complaints. If complainers can routinely send mail to \"abuse@BigISP.example\" and you have someone assigned to read that mail, workflow will be much smoother. Don't require people complaining about spam to use some unique local address for complaints. Read and use 'postmaster' and 'abuse'. We recommend adherence to RFC 2142, _Mailbox Names for Common Services, Roles and Functions._ [7].",
      "ja": "虐待の苦情の住所があることを確認してください。申立人が「Aubse@bigisp.example」に日常的にメールを送信できる場合、そのメールを読むために誰かが割り当てられている場合、ワークフローははるかにスムーズになります。スパムについて不平を言っている人々が苦情のためにいくつかのユニークなローカルアドレスを使用することを要求しないでください。「ポストマスター」と「虐待」を読んで使用します。RFC 2142、_ Mailbox名の順守、役割、機能の遵守をお勧めします。_[7]。"
    },
    {
      "indent": 3,
      "text": "Finally, write your contracts and terms and conditions in such language that allows you to suspend service for offenders, and so that you can impose a charge on them for your costs in handling the complaints their abuse generates and/or terminating their account and cleaning up the mess they make. Some large ISPs have found that they can fund much of their abuse prevention staff by imposing such charges. Make sure all your customers sign the agreement before their accounts are activated. There is a list of \"good\" Acceptable Use Policies and Terms of Service at:",
      "ja": "最後に、犯罪者へのサービスを一時停止できるように、契約と契約条件をそのような言語で書いてください。彼らが作る混乱。いくつかの大規模なISPは、そのような告発を課すことにより、虐待防止スタッフの多くに資金を提供できることを発見しました。アカウントがアクティブ化される前に、すべての顧客が契約に署名することを確認してください。「良い」許容可能な使用ポリシーと利用規約のリストがあります。"
    },
    {
      "indent": 16,
      "text": "http://spam.abuse.net/goodsites/index.html.",
      "ja": "http://spam.abuse.net/goodsites/index.html."
    },
    {
      "indent": 3,
      "text": "Legally, you may be able to stop spammers and spam relayers, but this is certainly dependent on the jurisdictions involved. Potentially, the passing of spam via third party computers, especially if the headers are forged, could be a criminal action depending on the laws of the particular jurisdiction(s) involved. If your site is being used as a spam relay, be sure to contact local and national criminal law enforcement agencies. Site operators may also want to consider bringing civil actions against the spammer for expropriation of property, in particular the computer time and network bandwidth. In addition, when a mailing list is involved, there is a potential intellectual property rights violation.",
      "ja": "法的には、スパマーやスパムの中継者を止めることができるかもしれませんが、これは確かに関係する管轄区域に依存しています。潜在的に、特にヘッダーが偽造されている場合、サードパーティのコンピューターを介したスパムの通過は、関係する特定の管轄権の法律に応じて刑事訴訟になる可能性があります。あなたのサイトがスパムリレーとして使用されている場合は、地元および国の刑法執行機関に必ず連絡してください。サイトオペレーターは、財産の収用、特にコンピューターの時間とネットワーク帯域幅のために、スパマーに対して民事訴訟を起こすことを検討することもできます。さらに、メーリングリストが関与している場合、潜在的な知的財産権侵害があります。"
    },
    {
      "indent": 3,
      "text": "There are a few law suits in the courts now which claim spammers interfered with and endangered network connectivity. At least one company is attempting to charge spammers for the use of its networks (www.kclink.com/spam/).",
      "ja": "現在、裁判所には、スパマーが干渉したネットワーク接続を危険にさらしたと主張するいくつかの法律訴訟があります。少なくとも1つの会社が、ネットワークの使用にスパマーを請求しようとしています（www.kclink.com/spam/）。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Certain actions to stop spamming may cause problems to legitimate users of the net. There is a risk that filters to stop spamming will unintentionally stop legitimate mail too. Overloading postmasters with complaints about spamming may cause trouble to the wrong person, someone who is not responsible for and cannot do anything to avoid the spamming activity, or it may cause trouble out of proportion to the abuse you are complaining about. Be sure to exercise discretion and good judgment in all these cases. Check your local escalation procedure. The Site Security Handbook [2] can help define an escalation procedure if your site does not have one defined.",
      "ja": "スパムを停止する特定のアクションは、ネットの正当なユーザーに問題を引き起こす可能性があります。スパムを停止するためのフィルターが意図せずに正当なメールを停止するリスクがあります。スパムに関する苦情でポストマスターを過負荷にすると、間違った人、スパム活動を避けるために責任がなく、何もできない人に問題を引き起こす可能性があります。これらすべての場合において、必ず裁量と良い判断を行うようにしてください。地元のエスカレーション手順を確認してください。サイトセキュリティハンドブック[2]は、サイトに定義されていない場合、エスカレーション手順を定義するのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "Lower levels of network security interact with the ability to trace spam via logs or message headers. Measures to stop various sorts of DNS and IP spoofing can make this information more reliable. Spammers can and will exploit obvious security weaknesses, especially in NNTP servers. This can lead to denial of service, either from the sheer volume of posts, or as a result of action taken by upstream providers.",
      "ja": "ネットワークセキュリティの低レベルは、ログまたはメッセージヘッダーを介してスパムをトレースする機能と相互作用します。さまざまな種類のDNSとIPスプーフィングを停止する措置により、この情報をより信頼性を高めることができます。スパマーは、特にNNTPサーバーでは、明らかなセキュリティの弱点を活用することができます。これは、膨大な量の投稿から、または上流のプロバイダーが行った行動の結果として、サービスの拒否につながる可能性があります。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8. 謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks for help from the IETF-RUN working group, and also to all the spew-fighters. Specific thanks are due to J.D. Falk, whose very helpful Anti-spam FAQ proved valuable. Thanks are also due to the vigilance of Scott Hazen Mueller and Paul Vixie, who run spam.abuse.net, the Anti-spam web site. Thanks also to Jacob Palme, Chip Rosenthal, Karl Auerbach for specific text: Jacob for the Security Considerations section, Chip for the configuration suggestions in section 5, Karl for the legal considerations. Andrew Gierth was very helpful with Netnews spam considerations. And thanks to Gary Malkin for proofing and formatting.",
      "ja": "IETF-Runワーキンググループ、およびすべての噴出戦闘機の助けをありがとう。J.D.フォークのおかげで、その非常に役立つアンチスパムFAQが価値があることが証明されました。また、Spam.abuse.netを実行しているスコットヘイゼンミューラーとポールビクシーの警戒に感謝します。Jacob Palme、Chip Rosenthal、Karl Auerbachの特定のテキストについても感謝します。セキュリティに関する考慮事項のJacob、セクション5の構成提案のチップ、法的考慮事項のカール。Andrew Gierthは、NetNews Spamの考慮事項に非常に役立ちました。そして、校正とフォーマットをしてくれたゲイリー・マルキンに感謝します。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 3,
      "text": "[1] See for example spam-l@peach.ease.lsoft.com",
      "ja": "[1] たとえば、spaml@peach.ease.lsoft.comを参照してください"
    },
    {
      "indent": 3,
      "text": "[2] Fraser, B., \"Site Security Handbook\", FYI 8, RFC 2196, September 1997.",
      "ja": "[2] Fraser、B。、「サイトセキュリティハンドブック」、FYI 8、RFC 2196、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[3] \"Current Spam thresholds and guidelines,\" Lewis, Chris and Tim Skirvin, http://www.killfile.org/~tskirvin/faqs/spam.html.",
      "ja": "[3] 「現在のスパムのしきい値とガイドライン」、ルイス、クリス、ティム・スカルビン、http：//www.killfile.org/~tskirvin/faqs/spam.html。"
    },
    {
      "indent": 3,
      "text": "[4] Schwartz, Alan and Simson Garfinkel, \"Stopping Spam,\" O'Reilly and Associates, 1998.",
      "ja": "[4] シュワルツ、アラン、シムソンガーフィンケル、「スパムを停止する」、オライリーとアソシエイツ、1998年。"
    },
    {
      "indent": 3,
      "text": "[5] Crocker, D., \"Standard for the format of ARPA Internet text messages\", STD 11, RFC 822, August 1982.",
      "ja": "[5] Crocker、D。、「ARPAインターネットテキストメッセージの形式の標準」、STD 11、RFC 822、1982年8月。"
    },
    {
      "indent": 3,
      "text": "[6] Braden, R., \"Requirements for Internet hosts - application and support\", STD 3, RFC 1123, October 1989.",
      "ja": "[6] Braden、R。、「インターネットホストの要件 - アプリケーションとサポート」、STD 3、RFC 1123、1989年10月。"
    },
    {
      "indent": 3,
      "text": "[7] Crocker, D., \"Mailbox Names for Common Services, Roles and Functions\", RFC 2142, May 1997.",
      "ja": "[7] Crocker、D。、「一般的なサービス、役割、機能のメールボックス名」、RFC 2142、1997年5月。"
    },
    {
      "indent": 3,
      "text": "* Spam is a name of a meat product made by Hormel. \"spam\" (no capitalization) is routinely used to describe unsolicited bulk email and netnews posts.",
      "ja": "* スパムは、ホーマルが作った肉製品の名前です。「スパム」（大文字なし）は、未承諾のバルクメールとNetNewsの投稿を説明するために日常的に使用されます。"
    },
    {
      "indent": 0,
      "text": "10. Appendix - How to Track Down Spammers",
      "section_title": true,
      "ja": "10. 付録 - スパマーを追跡する方法"
    },
    {
      "indent": 3,
      "text": "In a large proportion of spams today, complaining to the postmaster of the site that is the apparent sender of a message will have little effect because either the headers are forged to disguise the source of the message, or the senders of the message run their own system/domain, or both.",
      "ja": "今日のスパムの大部分では、メッセージの見かけの送信者であるサイトのポストマスターに不満を言うことはほとんど効果がありません。システム/ドメイン、またはその両方。"
    },
    {
      "indent": 3,
      "text": "As a result, it may be necessary to look carefully at the headers of a message to see what parts are most reliable, and/or to complain to the second or third-level Internet providers who provide Internet service to a problem domain.",
      "ja": "その結果、メッセージのヘッダーを慎重に調べて、どのパーツが最も信頼できるかを確認したり、問題ドメインにインターネットサービスを提供する2番目または第3レベルのインターネットプロバイダーに不満を言う必要がある場合があります。"
    },
    {
      "indent": 3,
      "text": "In many cases, getting reports with full headers from various recipients of a spam can help locate the source. In extreme cases of header forgery, only examination of logs on multiple systems can trace the source of a message.",
      "ja": "多くの場合、スパムのさまざまな受信者からフルヘッダーを含むレポートを取得すると、ソースを見つけることができます。Header Forgeryの極端な場合、複数のシステムでのログのみの検査のみがメッセージのソースを追跡できます。"
    },
    {
      "indent": 3,
      "text": "With only one message in hand, one has to make an educated guess as to the source. The following are only rough guidelines.",
      "ja": "1つのメッセージしか手にないので、ソースについて教育を受けた推測をしなければなりません。以下は大まかなガイドラインのみです。"
    },
    {
      "indent": 3,
      "text": "In the case of mail messages, \"Received:\" headers added by systems under control of the destination organization are most likely to be reliable. You can't trust what the source domain calls itself, but you can usually use the source IP address since that is determined by the destination domain's server.",
      "ja": "メールメッセージの場合、「受信：」ヘッダーが宛先組織の制御下にあるシステムによって追加されたヘッダーは、信頼できる可能性が最も高くなります。ソースドメインがそれ自体を呼び出すものを信頼することはできませんが、通常、宛先ドメインのサーバーによって決定されるため、ソースIPアドレスを使用できます。"
    },
    {
      "indent": 3,
      "text": "In naive mail forgeries, the \"Message-ID:\" header may show the first SMTP server to handle the message and/or the \"Received:\" headers may all be accurate, but neither can be relied on. Be especially wary when the Received: headers have other headers intermixed. Normally, Received: headers are all together in a block, and when split up, one or the other blocks is probably forged.",
      "ja": "Naive Mail Forgeriesでは、「Message-ID：」ヘッダーは、メッセージおよび/または「受信」を処理する最初のSMTPサーバーを表示する場合があります。受信した場合、特に注意してください。ヘッダーには他のヘッダーが混ざっています。通常、受信：ヘッダーはすべてブロック内で一緒になり、分割すると、おそらく一方のブロックが偽造されます。"
    },
    {
      "indent": 3,
      "text": "In the case of news messages, some part of the Path: header may be a forgery; only reports from multiple sites can make this clear. In naive news forgeries, the \"NNTP-Posting-Host:\" header shows the actual source, but this can be forged too.",
      "ja": "ニュースメッセージの場合、パスの一部：ヘッダーは偽造である可能性があります。複数のサイトからのレポートのみがこれを明確にすることができます。ナイーブニュースの偽造では、「NNTPポストホスト：」ヘッダーは実際のソースを表示しますが、これも偽造できます。"
    },
    {
      "indent": 3,
      "text": "If a spam message advertises an Internet server like a WWW site, that server must be connected to the network to be usable. Therefore that address can be traced. It is appropriate to complain to the ISP hosting a web site advertised in a SPAM, even if the origin of the spam seems to be elsewhere. Be aware that the spam could be an attack on the advertised site; the perpetrator knows the site will be deluged with complaints and their reputation will be damaged. Any spam with an electronic address in it is suspect because most spammers know they're unwelcome and won't make themselves accessible.",
      "ja": "スパムメッセージがWWWサイトのようなインターネットサーバーを宣伝する場合、そのサーバーを使用できるようにネットワークに接続する必要があります。したがって、そのアドレスを追跡できます。スパムの起源が他の場所にあるように見える場合でも、スパムで宣伝されているWebサイトをホストするISPに文句を言うことが適切です。スパムは広告されたサイトへの攻撃である可能性があることに注意してください。加害者は、サイトが苦情で派遣され、その評判が損なわれることを知っています。電子アドレスが入ったスパムは、ほとんどのスパンマーが歓迎されないことを知っており、自分自身にアクセスしやすくないため、疑わしいです。"
    },
    {
      "indent": 3,
      "text": "Here is an example mail header:",
      "ja": "これがメールヘッダーの例です。"
    },
    {
      "indent": 0,
      "text": "----\nFrom friendlymail@209.214.12.258.com Thu Feb 26 20:32:47 1998\nReceived: from clio.sc.intel.com by Ludwig.sc.intel.com (4.1/SMI-4.1)\n        id AA05377; Thu, 26 Feb 98 20:32:46 PST\nReceived: from 209.214.12.258.com (209.214.12.258.com [208.26.102.16])\n        by clio.sc.intel.com (8.8.6/8.8.5) with ESMTP id UAA29637\n        for <sallyh@intel.com>; Thu, 26 Feb 1998 20:33:30 -0800 (PST)\nReceived: ok\nX-Sender: promo1@gotosportsbook.com\nX-Advertisement: <a href=\"http://www.opt-out.com\">\nClick here to be removed.\nDate: Thu, 26 Feb 1998 23:23:03 -0500\nFrom: Sent By <promo1@gotosportsbook.com>\nReply-To: Sent By <promo1@gotosportsbook.com>\nTo: friend@bulkmailer\nSubject: Ad: FREE $50 in Sportsbook & Casino\nX-Mailer: AK-Mail 3.0b [eng] (unregistered)\nMime-Version: 1.0\nContent-Type: text/plain; charset=us-ascii\nContent-Transfer-Encoding: 7bit\nSender: friendlymail@aqua.258.com\nMessage-Id: <bulk.6508.19980226232535@aqua.258.com>\nStatus: R\n----",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Doing a traceroute on an IP address or DNS address will show what domains provide IP connectivity from you to that address.",
      "ja": "IPアドレスまたはDNSアドレスでTracerouteを実行すると、どのドメインがお客様からそのアドレスへのIP接続を提供するかが表示されます。"
    },
    {
      "indent": 3,
      "text": "Using whois and nslookup, one can try to determine who is administratively responsible for a domain.",
      "ja": "Whoisとnslookupを使用して、誰がドメインに管理上責任を負うかを判断しようとすることができます。"
    },
    {
      "indent": 3,
      "text": "In simple cases, a user of a responsible site may be exploiting an account or a weakness in dial-up security; in those cases a complaint to a single site may be sufficient. However, it may be appropriate to complain to more than one domain, especially when it looks like the spammers run their own system.",
      "ja": "単純な場合、責任あるサイトのユーザーは、アカウントまたはダイヤルアップセキュリティの弱点を活用している場合があります。そのような場合、単一のサイトへの苦情で十分かもしれません。ただし、特にスパマーが独自のシステムを実行しているように見える場合は、複数のドメインに文句を言うことが適切かもしれません。"
    },
    {
      "indent": 3,
      "text": "If you look at the traceroute to an address, you will normally see a series of domains between you and that address, with one or more wide-area/national Internet Service Providers in the middle and \"smaller\" networks/domains on either end. It may be appropriate to complain to the domains nearer the source, up to and including the closest wide-area ISP. However, this is a judgement call.",
      "ja": "アドレスへのTracerouteを見ると、通常、あなたとそのアドレスの間に一連のドメインが表示され、中央に1つ以上の幅広いエリア/ナショナルインターネットサービスプロバイダーが、両端に「より小さな」ネットワーク/ドメインが表示されます。ソースに近いドメインに不満を言うことが適切かもしれません。ただし、これは判断の呼びかけです。"
    },
    {
      "indent": 3,
      "text": "If an intermediate site appears to be a known, responsible domain, stopping your complaints at this point makes sense.",
      "ja": "中間サイトが既知の領域であると思われる場合、責任あるドメイン、この時点で苦情を停止することは理にかなっています。"
    },
    {
      "indent": 0,
      "text": "Authors' Information",
      "ja": "著者の情報"
    },
    {
      "indent": 3,
      "text": "Sally Hambridge Intel Corp, SC11-321 2200 Mission College blvd Santa Clara, CA 95052",
      "ja": "Sally Hambridge Intel Corp、SC11-321 2200 Mission College Blvd Santa Clara、CA 95052"
    },
    {
      "indent": 3,
      "text": "EMail: sallyh@ludwig.sc.intel.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Albert Lunde Northwestern University Suite 1400 1603 Orrington Avenue Evanston, IL 60201",
      "ja": "アルバートルンデノースウェスタン大学スイート1400 1603オリントンアベニューエヴァンストン、イリノイ60201"
    },
    {
      "indent": 3,
      "text": "EMail: Albert-Lunde@nwu.edu",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（1999）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}