{
  "title": {
    "text": "RFC 2472 - IP Version 6 over PPP",
    "ja": "RFC 2472 - PPP上でのIPバージョン6"
  },
  "number": 2472,
  "created_at": "2019-10-26 22:00:14.926172+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         D. Haskin\nRequest for Comments: 2472                                     E. Allen\nObsoletes: 2023                                      Bay Networks, Inc.\nCategory: Standards Track                                 December 1998",
      "raw": true
    },
    {
      "indent": 25,
      "text": "IP Version 6 over PPP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Point-to-Point Protocol (PPP) [1] provides a standard method of encapsulating Network Layer protocol information over point-to-point links. PPP also defines an extensible Link Control Protocol, and proposes a family of Network Control Protocols (NCPs) for establishing and configuring different network-layer protocols.",
      "ja": "ポイントツーポイントプロトコル（PPP）[1]は、ポイントツーポイントリンク上でネットワークレイヤプロトコル情報をカプセル化する標準的な方法を提供します。 PPPはまた、拡張可能なリンク制御プロトコルを定義し、確立し、異なるネットワーク層プロトコルを設定するためのネットワーク制御プロトコル（NCP）のファミリーを提案しています。"
    },
    {
      "indent": 3,
      "text": "This document defines the method for transmission of IP Version 6 [2] packets over PPP links as well as the Network Control Protocol (NCP) for establishing and configuring the IPv6 over PPP. It also specifies the method of forming IPv6 link-local addresses on PPP links.",
      "ja": "このドキュメントは、PPPの上でIPv6を確立し、構成するためのPPPリンク、並びにネットワーク制御プロトコル（NCP）オーバーIPバージョン6 [2]パケットの伝送のための方法を定義します。また、PPPリンク上でのIPv6リンクローカルアドレスを形成する方法を指定します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.     Introduction ..........................................    2\n     1.1.  Specification of Requirements .....................    2\n2.     Sending IPv6 Datagrams ................................    2\n3.     A PPP Network Control Protocol for IPv6 ...............    3\n4.     IPV6CP Configuration Options ..........................    4\n     4.1.  Interface-Identifier ..............................    4\n     4.2.  IPv6-Compression-Protocol..........................    9\n5.     Stateless Autoconfiguration and Link-Local Addresses ..   10\n6      Security Considerations ...............................   11\n7      Acknowledgments .......................................   11\n8      Changes from RFC-2023 .................................   11\n9      References ............................................   12\n10     Authors' Addresses ....................................   13",
      "raw": true
    },
    {
      "indent": 3,
      "text": "11     Full Copyright Statement ..............................   14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "PPP has three main components:",
      "ja": "PPPは3つの主要なコンポーネントがあります。"
    },
    {
      "indent": 3,
      "text": "1) A method for encapsulating datagrams over serial links.",
      "ja": "1）シリアルリンクにわたってデータグラムをカプセル化するための方法。"
    },
    {
      "indent": 3,
      "text": "2) A Link Control Protocol (LCP) for establishing, configuring, and testing the data-link connection.",
      "ja": "2）を確立、設定、およびデータリンク接続をテストするためのリンク制御プロトコル（LCP）。"
    },
    {
      "indent": 3,
      "text": "3) A family of Network Control Protocols (NCPs) for establishing and configuring different network-layer protocols.",
      "ja": "3）を確立し、異なるネットワーク層プロトコルを設定するためのネットワーク制御プロトコル（NCP）のファミリー。"
    },
    {
      "indent": 3,
      "text": "In order to establish communications over a point-to-point link, each end of the PPP link must first send LCP packets to configure and test the data link. After the link has been established and optional facilities have been negotiated as needed by the LCP, PPP must send NCP packets to choose and configure one or more network-layer protocols. Once each of the chosen network-layer protocols has been configured, datagrams from each network-layer protocol can be sent over the link.",
      "ja": "ポイントツーポイントリンクを介して通信を確立するために、PPPリンクの各端部は、第1のデータリンクを設定し、テストするためにLCPパケットを送信しなければなりません。リンクが確立され、LCPの必要に応じてオプションの施設が交渉された後、PPPは、1つ以上のネットワーク層プロトコルを選択し、設定するためにNCPパケットを送信する必要があります。選択されたネットワーク層プロトコルの各々が構成されたら、各ネットワーク層プロトコルからのデータグラムは、リンクを介して送信することができます。"
    },
    {
      "indent": 3,
      "text": "In this document, the NCP for establishing and configuring the IPv6 over PPP is referred as the IPv6 Control Protocol (IPV6CP).",
      "ja": "この文書では、PPP上のIPv6を確立し、構成するためのNCPは、IPv6制御プロトコル（IPV6CP）と呼ばれます。"
    },
    {
      "indent": 3,
      "text": "The link will remain configured for communications until explicit LCP or NCP packets close the link down, or until some external event occurs (power failure at the other end, carrier drop, etc.).",
      "ja": "リンクは、明示的なLCPまたはNCPパケットがダウンリンクを閉じるまで、または何らかの外部イベントが（等他端に電源障害、キャリア降下）が発生するまでの通信のために構成残ります。"
    },
    {
      "indent": 0,
      "text": "1.1. Specification of Requirements",
      "section_title": true,
      "ja": "1.1。要件の仕様"
    },
    {
      "indent": 3,
      "text": "In this document, several words are used to signify the requirements of the specification.",
      "ja": "このドキュメントでは、いくつかの単語は、仕様の要件を意味するために使用されています。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [7].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[7]で説明されるように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Sending IPv6 Datagrams",
      "section_title": true,
      "ja": "2. IPv6のデータグラムを送信します"
    },
    {
      "indent": 3,
      "text": "Before any IPv6 packets may be communicated, PPP MUST reach the Network-Layer Protocol phase, and the IPv6 Control Protocol MUST reach the Opened state.",
      "ja": "任意のIPv6パケットを伝達することができる前に、PPPはネットワーク層プロトコルフェーズに達しなければならない、とIPv6制御プロトコルはOpened状態に達しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Exactly one IPv6 packet is encapsulated in the Information field of PPP Data Link Layer frames where the Protocol field indicates type hex 0057 (Internet Protocol Version 6).",
      "ja": "正確に1つのIPv6パケットは、プロトコルフィールドがタイプ六角0057（インターネットプロトコルバージョン6）を示すPPP Data Link Layerフレームの情報フィールドにカプセル化されています。"
    },
    {
      "indent": 3,
      "text": "The maximum length of an IPv6 packet transmitted over a PPP link is the same as the maximum length of the Information field of a PPP data link layer frame. PPP links supporting IPv6 MUST allow the information field at least as large as the minimum link MTU size required for IPv6 [2].",
      "ja": "PPPリンクを介して送信されたIPv6パケットの最大長は、PPPデータリンク層フレームの情報フィールドの最大長さと同じです。 IPv6をサポートするPPPリンクは、IPv6のために必要な最小リンクMTUサイズなどの情報フィールドは、少なくとも同じ大き可能にしなければならない[2]。"
    },
    {
      "indent": 0,
      "text": "3. A PPP Network Control Protocol for IPv6",
      "section_title": true,
      "ja": "IPv6のための3. A PPPネットワーク制御プロトコル"
    },
    {
      "indent": 3,
      "text": "The IPv6 Control Protocol (IPV6CP) is responsible for configuring, enabling, and disabling the IPv6 protocol modules on both ends of the point-to-point link. IPV6CP uses the same packet exchange mechanism as the Link Control Protocol (LCP). IPV6CP packets may not be exchanged until PPP has reached the Network-Layer Protocol phase. IPV6CP packets received before this phase is reached should be silently discarded.",
      "ja": "IPv6制御プロトコル（IPV6CP）は、設定可能、及びポイントツーポイントリンクの両端でIPv6プロトコルモジュールを無効にする責任があります。 IPV6CPは、リンク制御プロトコル（LCP）と同じパケット交換メカニズムを使用しています。 PPPはネットワーク層プロトコルフェーズに達するまで、IPV6CPパケットは交換されない場合があります。静かに捨てられるべきです。この段階に到達する前に、IPV6CPパケットを受信しました。"
    },
    {
      "indent": 3,
      "text": "The IPv6 Control Protocol is exactly the same as the Link Control Protocol [1] with the following exceptions:",
      "ja": "IPv6の制御プロトコルは、以下の例外を除き、リンク制御プロトコル[1]と全く同じです。"
    },
    {
      "indent": 5,
      "text": "Data Link Layer Protocol Field",
      "ja": "データリンク層プロトコルフィールド"
    },
    {
      "indent": 10,
      "text": "Exactly one IPV6CP packet is encapsulated in the Information\nfield of PPP Data Link Layer frames where the Protocol field\nindicates type hex 8057 (IPv6 Control Protocol).",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Code field",
      "ja": "Codeフィールド"
    },
    {
      "indent": 10,
      "text": "Only Codes 1 through 7 (Configure-Request, Configure-Ack,\nConfigure-Nak, Configure-Reject, Terminate-Request,\nTerminate-Ack and Code-Reject) are used.  Other Codes should\nbe treated as unrecognized and should result in Code-Rejects.",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Timeouts",
      "ja": "タイムアウト"
    },
    {
      "indent": 10,
      "text": "IPV6CP packets may not be exchanged until PPP has reached the\nNetwork-Layer Protocol phase.  An implementation should be\nprepared to wait for Authentication and Link Quality\nDetermination to finish before timing out waiting for a\nConfigure-Ack or other response.  It is suggested that an\nimplementation give up only after user intervention or a\nconfigurable amount of time.",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Configuration Option Types",
      "ja": "設定オプションの種類"
    },
    {
      "indent": 10,
      "text": "IPV6CP has a distinct set of Configuration Options.",
      "ja": "IPV6CP構成オプションの明確なセットがあります。"
    },
    {
      "indent": 0,
      "text": "4. IPV6CP Configuration Options",
      "section_title": true,
      "ja": "4. IPV6CP設定オプション"
    },
    {
      "indent": 3,
      "text": "IPV6CP Configuration Options allow negotiation of desirable IPv6 parameters. IPV6CP uses the same Configuration Option format defined for LCP [1], with a separate set of Options. If a Configuration Option is not included in a Configure-Request packet, the default value for that Configuration Option is assumed.",
      "ja": "IPV6CP設定オプションは望ましいIPv6パラメータのネゴシエーションを可能にします。 IPV6CPオプションの別個のセットと、LCP [1]のために定義された同一の構成オプションのフォーマットを使用します。設定オプションが設定要求パケットに含まれていない場合は、その設定オプションのデフォルト値が仮定されます。"
    },
    {
      "indent": 3,
      "text": "Up-to-date values of the IPV6CP Option Type field are specified in the most recent \"Assigned Numbers\" RFC [4]. Current values are assigned as follows:",
      "ja": "IPV6CPオプションタイプフィールドの値は、最新の「Assigned Numbers」に指定されている最新のRFC [4]。次のように現在の値が割り当てられています。"
    },
    {
      "indent": 7,
      "text": "1       Interface-Identifier\n2       IPv6-Compression-Protocol",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The only IPV6CP options defined in this document are Interface-Identifier and IPv6-Compression-Protocol. Any other IPV6CP configuration options that can be defined over time are to be defined in separate documents.",
      "ja": "この文書で定義された唯一のIPV6CPオプションは、インターフェイス識別子とIPv6-圧縮・プロトコルです。時間をかけて定義することができ、他のIPV6CP設定オプションは、別の文書で定義されるべきです。"
    },
    {
      "indent": 0,
      "text": "4.1. Interface-Identifier",
      "section_title": true,
      "ja": "4.1。インターフェイス識別子"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 5,
      "text": "This Configuration Option provides a way to negotiate a unique 64- bit interface identifier to be used for the address autoconfiguration [3] at the local end of the link (see section 5). A Configure-Request MUST contain exactly one instance of the Interface-Identifier option [1]. The interface identifier MUST be unique within the PPP link; i.e. upon completion of the negotiation different Interface-Identifier values are to be selected for the ends of the PPP link. The interface identifier MAY also be unique over a broader scope.",
      "ja": "この構成オプションは、リンクのローカル・エンドのアドレス自動設定[3]のために使用される一意の64ビットのインタフェース識別子を交渉する方法を提供する（セクション5を参照）。設定要求は、インターフェース識別子オプション[1]のうちの正確に1つのインスタンスを含まなければなりません。インタフェース識別子は、PPPリンク内で一意でなければなりません。即ち交渉異なるインタフェース識別子値の完了時には、PPPリンクの端部のために選択されるべきです。インタフェース識別子はまた、より広い範囲で固有のものとすることができます。"
    },
    {
      "indent": 5,
      "text": "Before this Configuration Option is requested, an implementation chooses its tentative Interface-Identifier. The non-zero value of the tentative Interface-Identifier SHOULD be chosen such that the value is both unique to the link and, if possible, consistently reproducible across initializations of the IPV6CP finite state machine (administrative Close and reOpen, reboots, etc). The rationale for preferring a consistently reproducible unique interface identifier to a completely random interface identifier is to provide stability to global scope addresses that can be formed from the interface identifier.",
      "ja": "この設定オプションが要求される前に、実装は、その仮インターフェイス識別子を選択します。仮インターフェイス識別子の非ゼロ値は、値がリンクに固有と、可能であれば、IPV6CP有限状態マシンの初期化を横切って一貫して再現性のある（管理閉じて再度開き、再起動など）の両方であるように選択されるべきです。完全にランダムなインターフェイス識別子に一貫して再現性のある一意のインタフェース識別子を好むための理論的根拠は、インタフェース識別子から形成することができるグローバルスコープアドレスに安定性を提供することです。"
    },
    {
      "indent": 5,
      "text": "Assuming that interface identifier bits are numbered from 0 to 63 in canonical bit order where the most significant bit is the bit number 0, the bit number 6 is the \"u\" bit (universal/local bit in IEEE EUI-64 [5] terminology) which indicates whether or not the interface identifier is based on a globally unique IEEE identifier (EUI-48 or EUI-64 [5]) (see the case 1 below). It is set to one (1) if a globally unique IEEE identifier is used to derive the interface identifier, and it is set to zero (0) otherwise.",
      "ja": "そのインターフェース識別子ビットが最上位ビットはビット番号0の正規ビット順に0から63まで番号が付けられていると仮定すると、ビット数6は、「U」ビット（ユニバーサル/ローカルビットIEEE EUI-64 [5]用語であります）は（EUI-48またはEUI-64 [5]）（1）以下の場合を参照して、インタフェース識別子はグローバルにユニークなIEEE識別子に基づいているか否かを示します。グローバルにユニークなIEEE識別子がインターフェース識別子を導出するために使用され、そしてそれはそうでなければゼロ（0）に設定されている場合には、1（1）に設定されています。"
    },
    {
      "indent": 5,
      "text": "The following are methods for choosing the tentative Interface Identifier in the preference order:",
      "ja": "以下は、優先順に仮のインタフェース識別子を選択するための方法です。"
    },
    {
      "indent": 5,
      "text": "1) If an IEEE global identifier (EUI-48 or EUI-64) is available anywhere on the node, it should be used to construct the tentative Interface-Identifier due to its uniqueness properties. When extracting an IEEE global identifier from another device on the node, care should be taken to that the extracted identifier is presented in canonical ordering [8].",
      "ja": "IEEEグローバル識別子（EUI-48またはEUI-64）の任意の場所ノードで利用可能である場合1）、その一意の特性に仮インターフェイス識別子を構築するために使用されるべきです。ノード上の他のデバイスからIEEEグローバル識別子を抽出するとき、注意が抽出された識別子が正規の順序で提示されていることに注意すべきである[8]。"
    },
    {
      "indent": 8,
      "text": "The only transformation from an EUI-64 identifier is to invert the \"u\" bit (universal/local bit in IEEE EUI-64 terminology). For example, for a globally unique EUI-64 identifier of the form:",
      "ja": "EUI-64識別子からのみの変換は、「U」ビット（IEEE EUI-64用語ユニバーサル/ローカルビット）を反転することです。例えば、フォームのグローバルにユニークなEUI-64識別子のために："
    },
    {
      "indent": 3,
      "text": "most-significant                                    least-significant\nbit                                                               bit\n|0              1|1              3|3              4|4              6|\n|0              5|6              1|2              7|8              3|\n+----------------+----------------+----------------+----------------+\n|cccccc0gcccccccc|cccccccceeeeeeee|eeeeeeeeeeeeeeee|eeeeeeeeeeeeeeee|\n+----------------+----------------+----------------+----------------+",
      "raw": true
    },
    {
      "indent": 8,
      "text": "where \"c\" are the bits of the assigned company_id, \"0\" is the\nvalue of the universal/local bit to indicate global scope, \"g\"\nis group/individual bit, and \"e\" are the bits of the extension\nidentifier,",
      "raw": true
    },
    {
      "indent": 8,
      "text": "the IPv6 interface identifier would be of the form:",
      "ja": "IPv6インタフェース識別子の形式は次のようになります。"
    },
    {
      "indent": 3,
      "text": "most-significant                                    least-significant\nbit                                                               bit\n|0              1|1              3|3              4|4              6|\n|0              5|6              1|2              7|8              3|\n+----------------+----------------+----------------+----------------+\n|cccccc1gcccccccc|cccccccceeeeeeee|eeeeeeeeeeeeeeee|eeeeeeeeeeeeeeee|\n+----------------+----------------+----------------+----------------+",
      "raw": true
    },
    {
      "indent": 8,
      "text": "The only change is inverting the value of the universal/local\nbit.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "In the case of a EUI-48 identifier, it is first converted to the EUI-64 format by inserting two bytes, with hexadecimal values of 0xFF and 0xFE, in the middle of the 48 bit MAC (between the company_id and extension-identifier portions of the EUI-48 value). For example, for a globally unique 48 bit EUI-48 identifier of the form:",
      "ja": "EUI-48識別子の場合、第1のcompany_idおよび拡張識別子部分の間（48ビットMACの途中で、は0xFFと0xFEの16進数の値と、2つのバイトを挿入することにより、EUI-64フォーマットに変換されEUI-48値の）。例えば、フォームのグローバルにユニークな48ビットEUI-48識別子のために："
    },
    {
      "indent": 3,
      "text": "most-significant                   least-significant\nbit                                              bit\n|0              1|1              3|3              4|\n|0              5|6              1|2              7|\n+----------------+----------------+----------------+\n|cccccc0gcccccccc|cccccccceeeeeeee|eeeeeeeeeeeeeeee|\n+----------------+----------------+----------------+",
      "raw": true
    },
    {
      "indent": 8,
      "text": "where \"c\" are the bits of the assigned company_id, \"0\" is the\nvalue of the universal/local bit to indicate global scope, \"g\"\nis group/individual bit, and \"e\" are the bits of the extension\nidentifier, the IPv6 interface identifier would be of the form:",
      "raw": true
    },
    {
      "indent": 3,
      "text": "most-significant                                    least-significant\nbit                                                               bit\n|0              1|1              3|3              4|4              6|\n|0              5|6              1|2              7|8              3|\n+----------------+----------------+----------------+----------------+\n|cccccc1gcccccccc|cccccccc11111111|11111110eeeeeeee|eeeeeeeeeeeeeeee|\n+----------------+----------------+----------------+----------------+",
      "raw": true
    },
    {
      "indent": 5,
      "text": "2) If an IEEE global identifier is not available a different source of uniqueness should be used. Suggested sources of uniqueness include link-layer addresses, machine serial numbers, et cetera.",
      "ja": "IEEEグローバル識別子を使用できない場合は2）一意性の異なるソースを使用すべきです。一意の提案ソースがリンク層アドレス、マシンのシリアル番号、エトセトラを含みます。"
    },
    {
      "indent": 8,
      "text": "In this case the \"u\" bit of the interface identifier MUST be set to zero (0).",
      "ja": "この場合、インタフェース識別子の「U」ビットがゼロ（0）に設定しなければなりません。"
    },
    {
      "indent": 5,
      "text": "3) If a good source of uniqueness cannot be found, it is recommended that a random number be generated. In this case the \"u\" bit of the interface identifier MUST be set to zero (0).",
      "ja": "ユニークさの良い情報源を見つけることができない場合は3）、乱数を生成することをお勧めします。この場合、インタフェース識別子の「U」ビットがゼロ（0）に設定しなければなりません。"
    },
    {
      "indent": 5,
      "text": "Good sources [1] of uniqueness or randomness are required for the Interface-Identifier negotiation to succeed. If neither a unique number or a random number can be generated it is recommended that a zero value be used for the Interface-Identifier transmitted in the Configure-Request. In this case the PPP peer may provide a valid non-zero Interface-Identifier in its response as described below. Note that if at least one of the PPP peers is able to generate separate non-zero numbers for itself and its peer, the identifier negotiation will succeed.",
      "ja": "[1]ユニークさやランダム性の良い情報源は、成功するためのインターフェイス識別子の交渉のために必要とされます。固有番号またはランダム数のいずれも生成することができる場合、ゼロの値が設定要求で送信されたインターフェイス識別子に使用することが推奨されます。以下に説明するようにこの場合、PPPピアは、その応答に有効な非ゼロのインターフェイス識別子を提供することができます。 PPPピアの少なくとも一つは、それ自体とそのピアの別の非ゼロ数字を生成することができる場合、識別子交渉が成功することに注意してください。"
    },
    {
      "indent": 5,
      "text": "When a Configure-Request is received with the Interface-Identifier Configuration Option and the receiving peer implements this option, the received Interface-Identifier is compared with the Interface-Identifier of the last Configure-Request sent to the peer. Depending on the result of the comparison an implementation MUST respond in one of the following ways:",
      "ja": "設定要求を受信した場合、インタフェース識別子設定オプション及び受信ピアがこのオプションを実装して、受信したインターフェイス識別子は、ピアに送信された最後の設定要求のインターフェイス識別子と比較されます。比較の結果に応じて、実装は、次のいずれかの方法で応答しなければなりません："
    },
    {
      "indent": 5,
      "text": "If the two Interface-Identifiers are different but the received Interface-Identifier is zero, a Configure-Nak is sent with a non-zero Interface-Identifier value suggested for use by the remote peer. Such a suggested Interface-Identifier MUST be different from the Interface-Identifier of the last Configure-Request sent to the peer. It is recommended that the value suggested be consistently reproducible across initializations of the IPV6CP finite state machine (administrative Close and reOpen, reboots, etc). The \"u\" universal/local) bit of the suggested identifier MUST be set to zero (0) regardless of its source unless the globally unique EUI-48/EUI-64 derived identifier is provided for the exclusive use by the remote peer.",
      "ja": "2種類のインタフェース、識別子が異なっているが、受信されたインターフェイス識別子がゼロであれば、設定否定応答は、非ゼロインタフェース識別子値は、リモートピアで使用するために提案して送信されます。そのような提案インターフェイス識別子は、ピアに送信された最後の設定要求のインターフェイス識別子異なっていなければなりません。 （など、行政を閉じて再度開いた、再起動します）推奨値がIPV6CP有限状態マシンの初期化全体で一貫して再現することをお勧めします。提案識別子の「U」ユニバーサル/ローカル）ビットがゼロ（0）にかかわらず、そのソースのグローバルにユニークなEUI-48 / EUI-64由来の識別子がリモートピアによる排他的使用のために提供されない限り、に設定しなければなりません。"
    },
    {
      "indent": 5,
      "text": "If the two Interface-Identifiers are different and the received Interface-Identifier is not zero, the Interface-Identifier MUST be acknowledged, i.e. a Configure-Ack is sent with the requested Interface-Identifier, meaning that the responding peer agrees with the Interface-Identifier requested.",
      "ja": "2インターフェイス-識別子が異なっており、受け取ったインターフェイス識別子がゼロでない場合は、インターフェイス識別子は認めなければならない、すなわち設定肯定応答は、応答するピアがInterface-と一致することを意味し、要求されたインターフェイス識別子と共に送られます識別子は、要求されました。"
    },
    {
      "indent": 5,
      "text": "If the two Interface-Identifiers are equal and are not zero, a Configure-Nak MUST be sent specifying a different non-zero Interface-Identifier value suggested for use by the remote peer. It is recommended that the value suggested be consistently reproducible across initializations of the IPV6CP finite state machine (administrative Close and reOpen, reboots, etc). The \"u\" universal/local) bit of the suggested identifier MUST be set to zero (0) regardless of its source unless the globally unique EUI-48/EUI-64 derived identifier is provided for the exclusive use by the remote peer.",
      "ja": "2種類のインタフェース、識別子が等しく、ゼロでない場合は、設定否定応答は、異なる非ゼロインタフェース識別子値は、リモートピアで使用するために提案指定送らなければなりません。 （など、行政を閉じて再度開いた、再起動します）推奨値がIPV6CP有限状態マシンの初期化全体で一貫して再現することをお勧めします。提案識別子の「U」ユニバーサル/ローカル）ビットがゼロ（0）にかかわらず、そのソースのグローバルにユニークなEUI-48 / EUI-64由来の識別子がリモートピアによる排他的使用のために提供されない限り、に設定しなければなりません。"
    },
    {
      "indent": 5,
      "text": "If the two Interface-Identifiers are equal to zero, the Interface-Identifiers negotiation MUST be terminated by transmitting the Configure-Reject with the Interface-Identifier value set to zero. In this case a unique Interface-Identifier can not be negotiated.",
      "ja": "2種類のインタフェース、識別子がゼロに等しい場合、インタフェース識別子、ネゴシエーションがゼロに設定されたインタフェース識別子値と設定が拒否送信することによって終了しなければなりません。この場合、独自のインターフェイス識別子を交渉することはできません。"
    },
    {
      "indent": 5,
      "text": "If a Configure-Request is received with the Interface-Identifier Configuration Option and the receiving peer does not implement this option, Configure-Rej is sent.",
      "ja": "設定要求がインターフェイス識別子設定オプションと受信ピアで受信された場合は、このオプションを実装していない、設定、レジが送信されます。"
    },
    {
      "indent": 5,
      "text": "A new Configure-Request SHOULD NOT be sent to the peer until normal processing would cause it to be sent (that is, until a Configure-Nak is received or the Restart timer runs out).",
      "ja": "新しい設定要求は、通常の処理は、それが送信される原因となるまで（設定否定応答が受信されるまで、つまりまたは再起動タイマーが切れる）ピアに送るべきではありません。"
    },
    {
      "indent": 5,
      "text": "A new Configure-Request MUST NOT contain the Interface-Identifier option if a valid Interface-Identifier Configure-Reject is received.",
      "ja": "新しい設定要求は、インターフェイス識別子のオプションを含んでいなければならない場合は、有効なインターフェイス識別子を設定拒否を受信します。"
    },
    {
      "indent": 5,
      "text": "Reception of a Configure-Nak with a suggested Interface-Identifier different from that of the last Configure-Nak sent to the peer indicates a unique Interface-Identifier. In this case a new Configure-Request MUST be sent with the identifier value suggested in the last Configure-Nak from the peer. But if the received Interface-Identifier is equal to the one sent in the last Configure-Nak, a new Interface-Identifier MUST be chosen. In this case, a new Configure-Request SHOULD be sent with the new tentative Interface-Identifier. This sequence (transmit Configure-Request, receive Configure-Request, transmit Configure-Nak, receive Configure-Nak) might occur a few times, but it is extremely unlikely to occur repeatedly. More likely, the Interface-Identifiers chosen at either end will quickly diverge, terminating the sequence.",
      "ja": "最後の設定否定応答とは異なる示唆したインターフェイス識別子を持つ通信設定否定応答の受信は、独自のインターフェイス識別子を示してピアに送信しました。この場合、新しい設定要求は、ピアからの最後の通信設定否定応答で提案されている識別子の値を送らなければなりません。受信インターフェイス識別子が最後の通信設定否定応答で送信されたものに等しい場合でも、新しいインターフェイス識別子を選ばなければなりません。この場合、新しい設定要求は、新しい仮インターフェイス識別子を用いて送信されるべきです。このシーケンスは、（設定否定応答を送信し、設定要求を受け、設​​定要求を送信し、通信設定否定応答を受信）数回発生する場合がありますが、繰り返し発生する極めてまれです。それどころか、両端に選ばれたインタフェース-識別子はすぐにシーケンスを終了、発散します。"
    },
    {
      "indent": 5,
      "text": "If negotiation of the Interface-Identifier is required, and the peer did not provide the option in its Configure-Request, the option SHOULD be appended to a Configure-Nak. The tentative value of the Interface-Identifier given must be acceptable as the remote Interface-Identifier; i.e. it should be different from the identifier value selected for the local end of the PPP link. The next Configure-Request from the peer may include this option. If the next Configure-Request does not include this option the peer MUST NOT send another Configure-Nak with this option included. It should assume that the peer's implementation does not support this option.",
      "ja": "インターフェイス識別子の交渉が必要とされ、ピアがその設定要求でオプションを提供しなかった場合は、オプションが設定否定応答に付加されるべきです。所定のインターフェイス識別子の暫定値は、リモートインターフェイス識別子として許容されなければなりません。すなわち、それは、PPPリンクのローカルエンドのために選択された識別子の値と異なるなければなりません。ピアからの次の設定要求は、このオプションを含めることができます。次の設定要求は、このオプションが含まれていない場合は、ピアが含まれ、このオプションで、別の設定否定応答を送ってはいけません。これは、ピアの実装では、このオプションをサポートしていないことを前提とすべきです。"
    },
    {
      "indent": 5,
      "text": "By default, an implementation SHOULD attempt to negotiate the Interface-Identifier for its end of the PPP connection.",
      "ja": "デフォルトでは、実装では、PPP接続の終わりのためのインターフェイス識別子を交渉しようとすべきです。"
    },
    {
      "indent": 3,
      "text": "A summary of the Interface-Identifier Configuration Option format is shown below. The fields are transmitted from left to right.",
      "ja": "インターフェイス識別子設定オプションフォーマットの概要は以下に示されています。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     | Interface-Identifier (MS Bytes)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                     Interface-Identifier (cont)\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\nInterface-Identifier (LS Bytes) |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 7,
      "text": "1",
      "ja": "１"
    },
    {
      "indent": 5,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 7,
      "text": "10",
      "ja": "１０"
    },
    {
      "indent": 5,
      "text": "Interface-Identifier",
      "ja": "インターフェイス識別子"
    },
    {
      "indent": 7,
      "text": "The 64-bit Interface-Identifier which is very likely to be unique on the link or zero if a good source of uniqueness can not be found.",
      "ja": "ユニークさの良いソースが見つからない場合は、リンクまたはゼロに一意である可能性が非常に高い64ビットのインターフェイス識別子。"
    },
    {
      "indent": 5,
      "text": "Default",
      "ja": "デフォルト"
    },
    {
      "indent": 7,
      "text": "If no valid interface identifier can be successfully negotiated, no default Interface-Identifier value should be assumed. The procedures for recovering from such a case are unspecified. One approach is to manually configure the interface identifier of the interface.",
      "ja": "有効なインタフェース識別子が正常にネゴシエートできない場合は、デフォルトのインターフェイス識別子の値が想定されるべきではありません。そのような場合から回復するための手順は不定です。一つのアプローチは、手動インタフェースのインタフェース識別子を設定することです。"
    },
    {
      "indent": 0,
      "text": "4.2. IPv6-Compression-Protocol",
      "section_title": true,
      "ja": "4.2。 IPv6の圧縮、プロトコル"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 5,
      "text": "This Configuration Option provides a way to negotiate the use of a specific IPv6 packet compression protocol. The IPv6-Compression-Protocol Configuration Option is used to indicate the ability to receive compressed packets. Each end of the link must separately request this option if bi-directional compression is desired. By default, compression is not enabled.",
      "ja": "この設定オプションは、特定のIPv6パケット圧縮プロトコルの使用を交渉する方法を提供します。 IPv6の圧縮・プロトコル設定オプションは、圧縮されたパケットを受信する能力を示すために使用されます。双方向の圧縮が望まれる場合には、リンクの各端部は、個別に、このオプションを要求しなければなりません。デフォルトでは、圧縮が有効になっていません。"
    },
    {
      "indent": 5,
      "text": "IPv6 compression negotiated with this option is specific to IPv6 datagrams and is not to be confused with compression resulting from negotiations via Compression Control Protocol (CCP), which potentially effect all datagrams.",
      "ja": "このオプションと交渉のIPv6圧縮は、IPv6データグラムに特異的であり、潜在的にすべてのデータグラムを行う圧縮制御プロトコル（CCP）を介して交渉から生じる圧縮と混同されるべきではありません。"
    },
    {
      "indent": 3,
      "text": "A summary of the IPv6-Compression-Protocol Configuration Option format is shown below. The fields are transmitted from left to right.",
      "ja": "IPv6の-Compression-Protocolのフォーマットの概要は以下の通りです。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     |   IPv6-Compression-Protocol   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Data ...\n+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 7,
      "text": "2",
      "ja": "２"
    },
    {
      "indent": 5,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 7,
      "text": ">= 4",
      "ja": "＞＝ ４"
    },
    {
      "indent": 5,
      "text": "IPv6-Compression-Protocol",
      "ja": "IPv6の圧縮、プロトコル"
    },
    {
      "indent": 7,
      "text": "The IPv6-Compression-Protocol field is two octets and indicates the compression protocol desired. Values for this field are always the same as the PPP Data Link Layer Protocol field values for that same compression protocol.",
      "ja": "IPv6の圧縮プロトコルフィールドは、2つのオクテットであり、所望の圧縮プロトコルを示します。このフィールドの値は常にその同じ圧縮プロトコルのPPPデータリンク層プロトコルフィールドの値と同じです。"
    },
    {
      "indent": 7,
      "text": "No IPv6-Compression-Protocol field values are currently assigned. Specific assignments will be made in documents that define specific compression algorithms.",
      "ja": "いいえIPv6の圧縮・プロトコルフィールドの値は、現在割り当てられていません。具体的な割り当ては、特定の圧縮アルゴリズムを定義する文書で行われます。"
    },
    {
      "indent": 5,
      "text": "Data",
      "ja": "データ"
    },
    {
      "indent": 7,
      "text": "The Data field is zero or more octets and contains additional data as determined by the particular compression protocol.",
      "ja": "データフィールドはゼロ以上のオクテットであり、特定の圧縮プロトコルによって決定されるような追加のデータを含みます。"
    },
    {
      "indent": 5,
      "text": "Default",
      "ja": "デフォルト"
    },
    {
      "indent": 7,
      "text": "No IPv6 compression protocol enabled.",
      "ja": "何のIPv6圧縮プロトコルが有効になっていません。"
    },
    {
      "indent": 0,
      "text": "5. Stateless Autoconfiguration and Link-Local Addresses",
      "section_title": true,
      "ja": "5.ステートレス自動設定およびリンクローカルアドレス"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier of IPv6 unicast addresses [6] of a PPP interface, SHOULD be negotiated in the IPV6CP phase of the PPP connection setup (see section 4.1). If no valid Interface Identifier has been successfully negotiated, procedures for recovering from such a case are unspecified. One approach is to manually configure the Interface Identifier of the interface.",
      "ja": "[6] PPPインタフェースのIPv6ユニキャストアドレスのインタフェース識別子は、（セクション4.1を参照）PPP接続設定のIPV6CPフェーズで交渉されるべきです。有効なインタフェース識別子が正常に交渉されていない場合、そのような場合から回復するための手順は、指定されていません。一つのアプローチは、手動インタフェースのインタフェース識別子を設定することです。"
    },
    {
      "indent": 3,
      "text": "As long as the Interface Identifier is negotiated in the IPV6CP phase of the PPP connection setup, it is redundant to perform duplicate address detection as a part of the IPv6 Stateless Autoconfiguration protocol [3]. Therefore it is recommended that for PPP links with the IPV6CP Interface-Identifier option enabled the default value of the DupAddrDetectTransmits autoconfiguration variable [3] be zero.",
      "ja": "限りインタフェース識別子は、PPP接続設定のIPV6CPフェーズで交渉されているように、IPv6ステートレス自動設定プロトコル[3]の一部として重複アドレス検出を実行するために冗長です。したがって、IPV6CPインタフェース識別子オプションを使用してPPPリンクがDupAddrDetectTransmits自動変数のデフォルト値を有効にするために、[3]がゼロであることが推奨されます。"
    },
    {
      "indent": 3,
      "text": "Link-local addresses of PPP interfaces have the following format:",
      "ja": "PPPインタフェースのリンクローカルアドレスの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "| 10 bits  |        54 bits         |          64 bits            |\n+----------+------------------------+-----------------------------+\n|1111111010|           0            |    Interface Identifier     |\n+----------+------------------------+-----------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The most significant 10 bits of the address is the Link-Local prefix FE80::. 54 zero bits pad out the address between the Link-Local prefix and the Interface Identifier fields.",
      "ja": "アドレスの最上位10ビットリンクローカルプレフィックスFE80 ::です。リンクローカルプレフィクスおよびインタフェース識別子フィールドとの間のアドレスアウト54ゼロビットパッド。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IPv6 Control Protocol extension to PPP can be used with all defined PPP authentication and encryption mechanisms.",
      "ja": "PPPへのIPv6制御プロトコルの拡張機能は、すべての定義されたPPPの認証と暗号化メカニズムを使用することができます。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7.謝辞"
    },
    {
      "indent": 3,
      "text": "This document borrows from the Magic-Number LCP option and as such is partially based on previous work done by the PPP working group.",
      "ja": "この文書では、マジック・ナンバーのLCPオプションから借用し、そのように部分的にPPPワーキンググループによって行われ、以前の仕事に基づいています。"
    },
    {
      "indent": 1,
      "text": "8. Changes from",
      "section_title": true,
      "ja": "8.変更から"
    },
    {
      "indent": 3,
      "text": "The following changes were made from RFC-2023 \"IP Version 6 over PPP\":",
      "ja": "次の変更は、RFC-2023「PPPオーバーIPバージョン6」から作られました。"
    },
    {
      "indent": 3,
      "text": "- Changed to use \"Interface Identifier\" instead of the \"Interface Token\" term according to the terminology adopted in [6].",
      "ja": " -  [6]に採用用語によれば「インタフェース識別子」の代わりに「インターフェイストークン」という用語を使用するように変更。"
    },
    {
      "indent": 3,
      "text": "- Increased the size of Interface Identifier to 64 bits according to the newly adopted IPv6 addressing architecture [6].",
      "ja": " - 新たに採用されたIPv6アドレス体系[6]に記載の64ビットインタフェース識別子のサイズを増加。"
    },
    {
      "indent": 3,
      "text": "- Added methods for selection of an interface identifier that is consistently reproducible across initializations of the IPV6CP finite state machine.",
      "ja": " -  IPV6CP有限状態機械の初期化を横切って一貫して再現性のあるインタフェース識別子を選択するための方法を追加しました。"
    },
    {
      "indent": 3,
      "text": "- Added the interface identifier selection methods for generating globally unique interface identifier from an unique an IEEE global identifier when it is available anywhere on the node.",
      "ja": " - それはどこでもノード上で利用可能である場合一意IEEEグローバル識別子からグローバルに一意のインタフェース識別子を生成するためのインタフェース識別子選択方法を追加しました。"
    },
    {
      "indent": 3,
      "text": "- Changed to send a Configure-Nak instead a Configure-Ack in response to receiving a Configure-Request with a zero Interface-Identifier value.",
      "ja": " - ゼロインタフェース識別子値設定要求を受信することに応答して設定否定応答代わり設定肯定応答を送信するように変更。"
    },
    {
      "indent": 3,
      "text": "- Replaced the value assignment of the IPv6-Compression-Protocol field of the IPv6-Compression-Protocol Configuration option with the text stating that no IPv6-Compression-Protocol field values are currently assigned and that specific assignments will be made in documents that define specific compression algorithms.",
      "ja": " - 何のIPv6圧縮プロトコルフィールドの値が現在割り当てられていないと、その特定の割り当てが特定の定義文書に行われることを述べたテキストでのIPv6-圧縮・プロトコル設定オプションのIPv6の圧縮-Protocolフィールドの値の割り当てを置き換え圧縮アルゴリズム。"
    },
    {
      "indent": 3,
      "text": "- Added new and updated references.",
      "ja": " - 新規および更新の参照を追加しました。"
    },
    {
      "indent": 3,
      "text": "- Minor text clarifications and improvements.",
      "ja": " - マイナーテキストの明確化と改善。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Simpson, W., \"The Point-to-Point Protocol\", STD 51, RFC 1661, July 1994.",
      "ja": "[1]シンプソン、W.、 \"ポイントツーポイントプロトコル\"、STD 51、RFC 1661、1994年7月。"
    },
    {
      "indent": 3,
      "text": "[2] Deering, S., and R. Hinden, Editors, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[2]デアリング、S.、およびR. Hindenと、エディタ、 \"インターネットプロトコルバージョン6（IPv6）の仕様\"、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[3] Thomson, S., and T. Narten, \"IPv6 Stateless Address Autoconfiguration\", RFC 2462, December 1998.",
      "ja": "[3]トムソン、S.、およびT. Narten氏、 \"IPv6のステートレスアドレス自動設定\"、RFC 2462、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[4] Reynolds, J., and J. Postel, \"Assigned Numbers\", STD 2, RFC 1700, October 1994. See also: http://www.iana.org/numbers.html",
      "ja": "[4]レイノルズ、J.、およびJ.ポステル、 \"割り当て番号\"、STD 2、RFC 1700、1994年10月を見る：http://www.iana.org/numbers.html"
    },
    {
      "indent": 3,
      "text": "[5] IEEE, \"Guidelines for 64-bit Global Identifier (EUI-64) Registration Authority\", http://standards.ieee.org/db/oui/tutorials/EUI64.html, March 1997.",
      "ja": "[5]、http://standards.ieee.org/db/oui/tutorials/EUI64.html、1997年3月IEEE、 \"64ビットのグローバル識別子（EUI-64）登録機関のガイドライン\"。"
    },
    {
      "indent": 3,
      "text": "[6] Hinden, R., and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 2373, July 1998.",
      "ja": "[6] HindenとR.、およびS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 2373、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[7] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels,\" BCP 14, RFC 2119, March 1997.",
      "ja": "[7]ブラドナーの、S.、 \"のRFCsにおける使用のためのキーワードは、要件レベルを示すために、\" BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[8] Narten T., and C. Burton, \"A Caution On The Canonical Ordering Of Link-Layer Addresses\", RFC 2469, December 1998.",
      "ja": "[8] Narten氏T.、およびC.バートン、「リンク層アドレスの正規の順序に注意」、RFC 2469、1998年12月。"
    },
    {
      "indent": 0,
      "text": "10. Authors' Addresses",
      "section_title": true,
      "ja": "10.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dimitry Haskin Bay Networks, Inc. 600 Technology Park Billerica, MA 01821",
      "ja": "Dimitry Haskinベイネットワーク株式会社600テクノロジーパークビレリカ、MA 01821"
    },
    {
      "indent": 3,
      "text": "EMail: dhaskin@baynetworks.com",
      "ja": "メールアドレス：dhaskin@baynetworks.com"
    },
    {
      "indent": 3,
      "text": "Ed Allen Bay Networks, Inc. 600 Technology Park Billerica, MA 01821",
      "ja": "エド・アレンベイネットワーク株式会社600テクノロジーパークビレリカ、MA 01821"
    },
    {
      "indent": 3,
      "text": "EMail: eallen@baynetworks.com",
      "ja": "メールアドレス：eallen@baynetworks.com"
    },
    {
      "indent": 0,
      "text": "11. Full Copyright Statement",
      "section_title": true,
      "ja": "11.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}