{
  "title": {
    "text": "RFC 2418 - IETF Working Group Guidelines and Procedures",
    "ja": "RFC 2418 - IETFワーキンググループガイドラインと手順"
  },
  "number": 2418,
  "created_at": "2019-10-24 09:58:35.034074+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         S. Bradner\nRequest for Comments: 2418                                        Editor\nObsoletes: 1603                                       Harvard University\nBCP: 25                                                   September 1998\nCategory: Best Current Practice",
      "raw": true
    },
    {
      "indent": 23,
      "text": "    IETF Working Group\nGuidelines and Procedures",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントはインターネットコミュニティのためのインターネットBest Current Practicesを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Internet Engineering Task Force (IETF) has responsibility for developing and reviewing specifications intended as Internet Standards. IETF activities are organized into working groups (WGs). This document describes the guidelines and procedures for formation and operation of IETF working groups. It also describes the formal relationship between IETF participants WG and the Internet Engineering Steering Group (IESG) and the basic duties of IETF participants, including WG Chairs, WG participants, and IETF Area Directors.",
      "ja": "IETF（Internet Engineering Task Force）は、インターネット標準として意図仕様を開発し、見直しのために責任を負っています。 IETF活動はワーキンググループ（作業部会）に編成されています。この文書は、IETFワーキンググループの形成・運用のためのガイドラインと手順を説明します。また、IETFの参加者WGとインターネットEngineering Steering Group（IESG）とWGチェア、WGの参加者、およびIETFエリアの取締役を含むIETFの参加者の基本的な任務、との正式な関係を説明しています。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "Abstract .........................................................  1\n1. Introduction ..................................................  2\n  1.1. IETF approach to standardization ..........................  4\n  1.2. Roles within a Working Group ..............................  4\n2. Working group formation .......................................  4\n  2.1. Criteria for formation ....................................  4\n  2.2. Charter ...................................................  6\n  2.3. Charter review & approval .................................  8\n  2.4. Birds of a feather (BOF) ..................................  9\n3. Working Group Operation ....................................... 10\n  3.1. Session planning .......................................... 11\n  3.2. Session venue ............................................. 11\n  3.3. Session management ........................................ 13\n  3.4. Contention and appeals .................................... 15",
      "raw": true
    },
    {
      "indent": 3,
      "text": "4. Working Group Termination ..................................... 15\n5. Rechartering a Working Group .................................. 15\n6. Staff Roles ................................................... 16\n  6.1. WG Chair .................................................. 16\n  6.2. WG Secretary .............................................. 18\n  6.3. Document Editor ........................................... 18\n  6.4. WG Facilitator ............................................ 18\n  6.5. Design teams .............................................. 19\n  6.6. Working Group Consultant .................................. 19\n  6.7. Area Director ............................................. 19\n7. Working Group Documents ....................................... 19\n  7.1. Session documents ......................................... 19\n  7.2. Internet-Drafts (I-D) ..................................... 19\n  7.3. Request For Comments (RFC) ................................ 20\n  7.4. Working Group Last-Call ................................... 20\n  7.5. Submission of documents ................................... 21\n8. Review of documents ........................................... 21\n9. Security Considerations ....................................... 22\n10. Acknowledgments .............................................. 23\n11. References ................................................... 23\n12. Editor's Address ............................................. 23\nAppendix:  Sample Working Group Charter .......................... 24\nFull Copyright Statement ......................................... 26",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Internet, a loosely-organized international collaboration of autonomous, interconnected networks, supports host-to-host communication through voluntary adherence to open protocols and procedures defined by Internet Standards. There are also many isolated interconnected networks, which are not connected to the global Internet but use the Internet Standards. Internet Standards are developed in the Internet Engineering Task Force (IETF). This document defines guidelines and procedures for IETF working groups. The Internet Standards Process of the IETF is defined in [1]. The organizations involved in the IETF Standards Process are described in [2] as are the roles of specific individuals.",
      "ja": "インターネット、自律、相互接続されたネットワークの緩く組織化国際協力は、インターネット標準で定義されたプロトコルと手順を開くために自主的な順守を介してホストからホストへの通信をサポートしています。グローバルインターネットに接続されているが、インターネット標準を使用していない多くの孤立相互接続されたネットワークは、もあります。インターネット標準は、IETF（Internet Engineering Task Force）で開発されています。この文書は、IETFワーキンググループのためのガイドラインと手順を定義します。 IETFインターネット標準化過程[1]で定義されています。特定の個人の役割があるとしてIETF標準化過程に関与する組織は、[2]に記載されています。"
    },
    {
      "indent": 3,
      "text": "The IETF is a large, open community of network designers, operators, vendors, users, and researchers concerned with the Internet and the technology used on it. The primary activities of the IETF are performed by committees known as working groups. There are currently more than 100 working groups. (See the IETF web page for an up-to-date list of IETF Working Groups - http://www.ietf.org.) Working groups tend to have a narrow focus and a lifetime bounded by the completion of a specific set of tasks, although there are exceptions.",
      "ja": "IETFは、インターネットおよびそれに使用される技術に関わるネットワーク設計者、事業者、ベンダー、ユーザー、および研究者の大規模な、オープンなコミュニティです。 IETFの主な活動は、ワーキンググループとして知られている委員会によって行われています。 100以上のワーキンググループは現在ありません。 （IETFワーキンググループの最新リストについては、IETFのWebページを参照してください - 。http://www.ietf.org）ワーキンググループは、狭い焦点との特定のセットの完了に囲まれた寿命を持っている傾向がありますタスク、例外はありますが。"
    },
    {
      "indent": 3,
      "text": "For management purposes, the IETF working groups are collected together into areas, with each area having a separate focus. For example, the security area deals with the development of security-related technology. Each IETF area is managed by one or two Area Directors (ADs). There are currently 8 areas in the IETF but the number changes from time to time. (See the IETF web page for a list of the current areas, the Area Directors for each area, and a list of which working groups are assigned to each area.)",
      "ja": "管理目的のために、IETFワーキンググループは、別々の焦点を有する各領域で、領域に一緒に集められます。例えば、セキュリティエリアは、セキュリティ関連技術の開発を扱っています。各IETF面積は、1人のまたは2つのエリアディレクター（ADS）によって管理されています。 8つのIETF内の領域が、時間から時間までの数の変更は現在ありません。 （現在のエリア、各エリアのエリアディレクター、およびワーキンググループが各領域に割り当てられているかのリストのリストについては、IETFのWebページを参照してください。）"
    },
    {
      "indent": 3,
      "text": "In many areas, the Area Directors have formed an advisory group or directorate. These comprise experienced members of the IETF and the technical community represented by the area. The specific name and the details of the role for each group differ from area to area, but the primary intent is that these groups assist the Area Director(s), e.g., with the review of specifications produced in the area.",
      "ja": "多くの地域では、地域取締役は諮問グループや理事を形成しています。これらは、IETFや地域によって表される技術コミュニティの経験豊富なメンバーを含みます。地域で生産仕様のレビューに、例えば、特定の名称及び各グループの役割の詳細は、領域に領域から異なるが、主な目的は、これらの基はAreaディレクター（複数可）を支援することです。"
    },
    {
      "indent": 3,
      "text": "The IETF area directors are selected by a nominating committee, which also selects an overall chair for the IETF. The nominations process is described in [3].",
      "ja": "IETF領域ディレクターはまた、IETFのための全体的な椅子を選択する指名委員会によって選択されます。指名プロセスは、[3]に記載されています。"
    },
    {
      "indent": 3,
      "text": "The area directors sitting as a body, along with the IETF Chair, comprise the Internet Engineering Steering Group (IESG). The IETF Executive Director is an ex-officio participant of the IESG, as are the IAB Chair and a designated Internet Architecture Board (IAB) liaison. The IESG approves IETF Standards and approves the publication of other IETF documents. (See [1].)",
      "ja": "体としてシッティングエリアディレクターは、IETF議長と一緒に、インターネット技術グループ（IESG）をステアリング含みます。 IAB議長と指定されたインターネットアーキテクチャ委員会（IAB）リエゾンあるとしてIETFのエグゼクティブ・ディレクターは、IESGの職権参加しています。 IESGは、IETF標準規格を承認し、他のIETFの文書の公開を承認します。 （[1]参照）。"
    },
    {
      "indent": 3,
      "text": "A small IETF Secretariat provides staff and administrative support for the operation of the IETF.",
      "ja": "小さなIETF事務局は、IETFの操作のためのスタッフと管理サポートを提供します。"
    },
    {
      "indent": 3,
      "text": "There is no formal membership in the IETF. Participation is open to all. This participation may be by on-line contribution, attendance at face-to-face sessions, or both. Anyone from the Internet community who has the time and interest is urged to participate in IETF meetings and any of its on-line working group discussions. Participation is by individual technical contributors, rather than by formal representatives of organizations.",
      "ja": "IETFでの正式なメンバーシップはありません。参加はすべてに開かれています。この参加は、オンライン寄与、対面セッションに出席、または両方によるものであってもよいです。時間と関心を持っているインターネットコミュニティからの誰もがIETFミーティングやその上のオンラインワーキンググループの議論のいずれかに参加することを促しています。参加は、むしろ組織の正式な代表者によるよりも、個々の技術的な貢献者です。"
    },
    {
      "indent": 3,
      "text": "This document defines procedures and guidelines for the formation and operation of working groups in the IETF. It defines the relations of working groups to other bodies within the IETF. The duties of working group Chairs and Area Directors with respect to the operation of the working group are also defined. When used in this document the key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" are to be interpreted as described in RFC 2119 [6]. RFC 2119 defines the use of these key words to help make the intent of standards track documents as clear as possible. The same key words are used in this document to help smooth WG operation and reduce the chance for confusion about the processes.",
      "ja": "このドキュメントは、IETFでのワーキンググループの形成・運用のための手順とガイドラインを定義します。これは、IETF内の他の機関にワーキンググループの関係を定義します。ワーキンググループの操作に対するワーキンググループチェアとAreaディレクターの職務も定義されています。このドキュメントのキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\" を使用する場合、 \"NOT SHALL\"、 \"推奨\"、 \"すべきではない\" \"べきである\" \"ないものと\"、 \"MAY\"、および「オプションRFC 2119に記載されているように「解釈されるべきである[6]。 RFC 2119は、可能な限り明確な基準トラック文書の意図を支援するために、これらのキーワードの使用を定義します。同じキーワードがスムーズWGの操作を支援し、プロセスについての混乱のための機会を減らすために、このドキュメントで使用されています。"
    },
    {
      "indent": 0,
      "text": "1.1. IETF approach to standardization",
      "section_title": true,
      "ja": "1.1。標準化へのアプローチIETF"
    },
    {
      "indent": 3,
      "text": "Familiarity with The Internet Standards Process [1] is essential for a complete understanding of the philosophy, procedures and guidelines described in this document.",
      "ja": "[1]インターネット標準化プロセスに精通しているが、この文書で説明する考え方、手順、およびガイドラインを完全に理解するために不可欠です。"
    },
    {
      "indent": 0,
      "text": "1.2. Roles within a Working Group",
      "section_title": true,
      "ja": "1.2。ワーキンググループ内での役割"
    },
    {
      "indent": 3,
      "text": "The document, \"Organizations Involved in the IETF Standards Process\" [2] describes the roles of a number of individuals within a working group, including the working group chair and the document editor. These descriptions are expanded later in this document.",
      "ja": "文書、「IETF標準化過程にかかわる組織」[2]ワーキンググループの議長と文書エディタなどの作業グループ内の個人の数、の役割を説明しています。これらの記述は、このドキュメントの後半で展開されます。"
    },
    {
      "indent": 0,
      "text": "2. Working group formation",
      "section_title": true,
      "ja": "2.ワーキンググループの形成"
    },
    {
      "indent": 3,
      "text": "IETF working groups (WGs) are the primary mechanism for development of IETF specifications and guidelines, many of which are intended to be standards or recommendations. A working group may be established at the initiative of an Area Director or it may be initiated by an individual or group of individuals. Anyone interested in creating an IETF working group MUST obtain the advice and consent of the IETF Area Director(s) in whose area the working group would fall and MUST proceed through the formal steps detailed in this section.",
      "ja": "IETFワーキンググループ（作業部会）そのうちの多くは標準や勧告であることが意図され、IETF仕様やガイドラインの開発のための主要なメカニズムです。ワーキンググループは、地域ディレクターの主導で確立することができるか、それは個人の個人またはグループによって開始することができます。地域ワーキンググループは下落するだろうと、このセクションで詳述正式な手順を続行する必要があります。IETFエリアディレクター（S）の助言と同意を得なければならないIETFワーキンググループを作成するに興味がある人。"
    },
    {
      "indent": 3,
      "text": "Working groups are typically created to address a specific problem or to produce one or more specific deliverables (a guideline, standards specification, etc.). Working groups are generally expected to be short-lived in nature. Upon completion of its goals and achievement of its objectives, the working group is terminated. A working group may also be terminated for other reasons (see section 4). Alternatively, with the concurrence of the IESG, Area Director, the WG Chair, and the WG participants, the objectives or assignment of the working group may be extended by modifying the working group's charter through a rechartering process (see section 5).",
      "ja": "ワーキンググループは、通常、特定の問題に対処するために1つ以上の具体的な成果（ガイドライン、標準仕様など）を生成するために作成されます。ワーキンググループは、一般的に自然の中で短命であると予想されます。その目標とその目標の達成が完了すると、ワーキンググループが終了されます。ワーキンググループは、他の理由（セクション4を参照）で終了することができます。あるいは、IESG、Areaディレクター、WG議長、およびWG参加者の同意を得て、目標やワーキンググループの割り当てがrecharteringプロセスを通してワーキンググループの憲章を変更することによって拡張することができる（セクション5を参照）。"
    },
    {
      "indent": 0,
      "text": "2.1. Criteria for formation",
      "section_title": true,
      "ja": "2.1。形成のための基準"
    },
    {
      "indent": 3,
      "text": "When determining whether it is appropriate to create a working group, the Area Director(s) and the IESG will consider several issues:",
      "ja": "ワーキンググループを作成することが適切であるかどうかを判断する場合には、エリアディレクター（S）とIESGは、いくつかの問題を検討します。"
    },
    {
      "indent": 4,
      "text": "- Are the issues that the working group plans to address clear and relevant to the Internet community?",
      "ja": " - ワーキンググループは、インターネットコミュニティに明確と関連する対処する予定の問題はありますか？"
    },
    {
      "indent": 4,
      "text": "- Are the goals specific and reasonably achievable, and achievable within a reasonable time frame?",
      "ja": " - 具体的かつ合理的に達成可能な目標であり、合理的な期間内に達成可能？"
    },
    {
      "indent": 4,
      "text": "- What are the risks and urgency of the work, to determine the level of effort required?",
      "ja": " - 必要な労力のレベルを決定するために、作業の危険性と緊急性は何ですか？"
    },
    {
      "indent": 4,
      "text": "- Do the working group's activities overlap with those of another working group? If so, it may still be appropriate to create the working group, but this question must be considered carefully by the Area Directors as subdividing efforts often dilutes the available technical expertise.",
      "ja": " - ワーキンググループの活動は、他のワーキンググループと重複しますか？もしそうなら、まだワーキンググループを作成するのが適切かもしれないが、この質問は、多くの場合、可能な技術的専門知識を希釈細分化する取り組みとして、地域のディレクターによって慎重に考慮しなければなりません。"
    },
    {
      "indent": 4,
      "text": "- Is there sufficient interest within the IETF in the working group's topic with enough people willing to expend the effort to produce the desired result (e.g., a protocol specification)? Working groups require considerable effort, including management of the working group process, editing of working group documents, and contributing to the document text. IETF experience suggests that these roles typically cannot all be handled by one person; a minimum of four or five active participants in the management positions are typically required in addition to a minimum of one or two dozen people that will attend the working group meetings and contribute on the mailing list. NOTE: The interest must be broad enough that a working group would not be seen as merely the activity of a single vendor.",
      "ja": " - 所望の結果を得るための努力を費やすことをいとわない十分な人々（例えば、プロトコル仕様）とのワーキンググループのトピックにIETF内に十分な関心がありますか？ワーキンググループは、ワーキンググループ文書の編集、および文書テキストに貢献し、ワーキンググループ・プロセスの管理を含め、かなりの努力が必要です。 IETFの経験は、これらの役割は通常、すべて一人で扱うことができないことを示唆しています。管理職で四人の、五積極的な参加者の最小値は、通常はワーキンググループの会合に出席し、メーリングリストに貢献する1または2ダースの人々の最小値に加えて必要とされています。注：利息はワーキンググループは、単一のベンダーの単なる活動として見られることはないだろうと十分に広くなければなりません。"
    },
    {
      "indent": 4,
      "text": "- Is there enough expertise within the IETF in the working group's topic, and are those people interested in contributing in the working group?",
      "ja": " - ワーキンググループのトピックにIETF内の十分な専門知識があり、そしてそれらの人々は、ワーキンググループに貢献することに興味がありますか？"
    },
    {
      "indent": 4,
      "text": "- Does a base of interested consumers (end-users) appear to exist for the planned work? Consumer interest can be measured by participation of end-users within the IETF process, as well as by less direct means.",
      "ja": " - 興味のある消費者（エンドユーザー）のベースは、計画された仕事のために存在するように表示されていますか？消費者の関心は、IETFプロセス内だけでなく、あまり直接的な手段によって、エンドユーザーの参加によって測定することができます。"
    },
    {
      "indent": 4,
      "text": "- Does the IETF have a reasonable role to play in the determination of the technology? There are many Internet-related technologies that may be interesting to IETF members but in some cases the IETF may not be in a position to effect the course of the technology in the \"real world\". This can happen, for example, if the technology is being developed by another standards body or an industry consortium.",
      "ja": " -  IETFは、技術の決意でプレーする合理的な役割を持っていますか？ IETFメンバーに面白いかもしれないが、いくつかのケースではIETFは、「現実世界」における技術のコースを達成する立場にないかもしれない多くのインターネット関連技術があります。技術は、他の標準化団体や業界団体によって開発されている場合、これは、例えば、発生する可能性があります。"
    },
    {
      "indent": 4,
      "text": "- Are all known intellectual property rights relevant to the proposed working group's efforts issues understood?",
      "ja": " - すべての既知の知的財産権は、理解し、提案ワーキンググループの努力の問題に関連していますか？"
    },
    {
      "indent": 4,
      "text": "- Is the proposed work plan an open IETF effort or is it an attempt to \"bless\" non-IETF technology where the effect of input from IETF participants may be limited?",
      "ja": " - 提案された作業計画は、オープンIETFの努力ですかIETF参加者からの入力の影響が制限される場合があり非IETFの技術を「祝福」する試みているのですか？"
    },
    {
      "indent": 4,
      "text": "- Is there a good understanding of any existing work that is relevant to the topics that the proposed working group is to pursue? This includes work within the IETF and elsewhere.",
      "ja": " - 提案されたワーキンググループが追求しているトピックに関連するすべての既存の作業をよく理解はありますか？これは、IETF内および他の場所での作業が含まれています。"
    },
    {
      "indent": 4,
      "text": "- Do the working group's goals overlap with known work in another standards body, and if so is adequate liaison in place?",
      "ja": " - ワーキンググループの目標は、他の標準化団体で知られている作業と重複し、その代わりに、適切な連絡窓口がある場合はありますか？"
    },
    {
      "indent": 3,
      "text": "Considering the above criteria, the Area Director(s), using his or her best judgement, will decide whether to pursue the formation of the group through the chartering process.",
      "ja": "上記の基準を考慮すると、エリアディレクター（S）は、彼または彼女の最善の判断を使用して、チャータープロセスを通じてグループの形成を追求するかどうかを決定します。"
    },
    {
      "indent": 0,
      "text": "2.2. Charter",
      "section_title": true,
      "ja": "2.2。チャーター"
    },
    {
      "indent": 3,
      "text": "The formation of a working group requires a charter which is primarily negotiated between a prospective working group Chair and the relevant Area Director(s), although final approval is made by the IESG with advice from the Internet Architecture Board (IAB). A charter is a contract between a working group and the IETF to perform a set of tasks. A charter:",
      "ja": "ワーキンググループの形成は、最終的な承認はインターネットアーキテクチャ委員会（IAB）からのアドバイスでIESGによってなされるが、主に、将来のワーキンググループの議長との関連エリアディレクター（S）との間で交渉されたチャーターが必要です。憲章は、一連のタスクを実行するためのワーキンググループとIETFとの間の契約です。チャーター："
    },
    {
      "indent": 3,
      "text": "1. Lists relevant administrative information for the working group;\n2. Specifies the direction or objectives of the working group and\n   describes the approach that will be taken to achieve the goals;\n   and\n3. Enumerates a set of milestones together with time frames for their\n   completion.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "When the prospective Chair(s), the Area Director and the IETF Secretariat are satisfied with the charter form and content, it becomes the basis for forming a working group. Note that an Area Director MAY require holding an exploratory Birds of a Feather (BOF) meeting, as described below, to gage the level of support for a working group before submitting the charter to the IESG and IAB for approval.",
      "ja": "将来の椅子、AreaディレクターとIETF事務局は、チャーター形式と内容に満足している場合、それはワーキンググループを形成するための基礎となります。エリアディレクターは、以下に述べるように、承認のためにIESGとIABにチャーターを提出する前に、ワーキンググループのためのサポートのレベルをゲージし、フェザー（BOF）会議の探索鳥を保持している必要とするかもしれないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Charters may be renegotiated periodically to reflect the current status, organization or goals of the working group (see section 5). Hence, a charter is a contract between the IETF and the working group which is committing to meet explicit milestones and delivering specific \"products\".",
      "ja": "チャーターは（セクション5を参照）現在の状況、組織やワーキンググループの目標を反映するために定期的に再交渉することができます。したがって、憲章は、IETFと明示的なマイルストーンを満たすためにコミットすると、特定の「製品」を提供しているワーキンググループとの間の契約です。"
    },
    {
      "indent": 3,
      "text": "Specifically, each charter consists of the following sections:",
      "ja": "具体的には、各チャーターは、以下のセクションで構成されています。"
    },
    {
      "indent": 3,
      "text": "Working group name A working group name should be reasonably descriptive or identifiable. Additionally, the group shall define an acronym (maximum 8 printable ASCII characters) to reference the group in the IETF directories, mailing lists, and general documents.",
      "ja": "グループ名を作業するワーキンググループ名は、合理的に記述または特定可能でなければなりません。さらに、グループはIETFディレクトリ、メーリングリスト、および一般的な文書でグループを参照するように頭文字（最大8印刷可能なASCII文字）を定義しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Chair(s) The working group may have one or more Chairs to perform the administrative functions of the group. The email address(es) of the Chair(s) shall be included. Generally, a working group is limited to two chairs.",
      "ja": "椅子ワーキンググループは、グループの管理機能を実行するために、1つ以上の椅子を持っていることがあります。椅子のメールアドレス（複数可）が含まれなければなりません。一般的に、ワーキンググループは、2つの椅子に制限されています。"
    },
    {
      "indent": 3,
      "text": "Area and Area Director(s) The name of the IETF area with which the working group is affiliated and the name and electronic mail address of the associated Area Director(s).",
      "ja": "エリアとエリアディレクター（S）ワーキンググループが所属するIETFエリアと関連エリアディレクター（複数可）の名前と電子メールアドレスの名前。"
    },
    {
      "indent": 3,
      "text": "Responsible Area Director The Area Director who acts as the primary IESG contact for the working group.",
      "ja": "ワーキンググループの主IESG接点として機能する責任エリアディレクターザ・エリアディレクター。"
    },
    {
      "indent": 3,
      "text": "Mailing list An IETF working group MUST have a general Internet mailing list. Most of the work of an IETF working group will be conducted on the mailing list. The working group charter MUST include:",
      "ja": "リストアンIETFワーキンググループのメーリングリストは、一般的なインターネットのメーリングリストを持たなければなりません。 IETFワーキンググループの作業のほとんどは、メーリングリストで行われます。ワーキンググループ憲章は含める必要があります。"
    },
    {
      "indent": 6,
      "text": "1. The address to which a participant sends a subscription request and the procedures to follow when subscribing,",
      "ja": "1.参加者へのアドレスは、サブスクリプション要求と加入する際に従うべき手順を送信し、"
    },
    {
      "indent": 6,
      "text": "2. The address to which a participant sends submissions and special procedures, if any, and",
      "ja": "2.参加者が提出し、特別な手順を送信するに住所があれば、と"
    },
    {
      "indent": 6,
      "text": "3. The location of the mailing list archive. A message archive MUST be maintained in a public place which can be accessed via FTP or via the web.",
      "ja": "3.メーリングリストのアーカイブの場所。メッセージのアーカイブは、FTP経由またはWeb経由でアクセスすることができる公共の場所で維持しなければなりません。"
    },
    {
      "indent": 9,
      "text": "As a service to the community, the IETF Secretariat operates a mailing list archive for working group mailing lists. In order to take advantage of this service, working group mailing lists MUST include the address \"wg_acronym-archive@lists.ietf.org\" (where \"wg_acronym\" is the working group acronym) in the mailing list in order that a copy of all mailing list messages be recorded in the Secretariat's archive. Those archives are located at ftp://ftp.ietf.org/ietf-mail-archive. For robustness, WGs SHOULD maintain an additional archive separate from that maintained by the Secretariat.",
      "ja": "地域社会へのサービスとして、IETF事務局は、グループメーリングリストを操作するためのメーリングリストのアーカイブを運営しています。すべてのコピーの順で、このサービスを利用するためには、グループのメーリングリストがアドレスを含まなければならない作業「wg_acronym-archive@lists.ietf.org」（「wg_acronymは」ワーキンググループの頭文字です）メーリングリストでメーリングリストのメッセージは、事務局のアーカイブに記録されます。これらのアーカイブはftp://ftp.ietf.org/ietf-mail-archiveに位置しています。ロバスト性のために、のWGは、事務局によって維持されるものとは別の追加のアーカイブを維持しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Description of working group The focus and intent of the group shall be set forth briefly. By reading this section alone, an individual should be able to decide whether this group is relevant to their own work. The first paragraph must give a brief summary of the problem area, basis, goal(s) and approach(es) planned for the working group. This paragraph can be used as an overview of the working group's effort.",
      "ja": "ワーキンググループの説明グループの焦点と意図を簡単に記載されなければなりません。一人でこのセクションを読み取ることにより、個人はこのグループは、自分の仕事に関連しているかどうかを決定することができるはずです。最初の段落は、ワーキンググループのために計画された問題領域、ベース、目標（S）とアプローチ（ES）の簡単な要約を与える必要があります。この段落は、ワーキンググループの取り組みの概要として使用することができます。"
    },
    {
      "indent": 6,
      "text": "To facilitate evaluation of the intended work and to provide on-going guidance to the working group, the charter must describe the problem being solved and should discuss objectives and expected impact with respect to:",
      "ja": "意図した作品の評価を容易にするために、オン行くワーキンググループへのガイダンスを提供するために、憲章は解決されている問題を記述しなければならないとに対する目的や期待への影響を議論する必要があります。"
    },
    {
      "indent": 9,
      "text": "- Architecture - Operations - Security - Network management - Scaling - Transition (where applicable)",
      "ja": " - アーキテクチャ - 運用 - セキュリティ - ネットワーク管理 - スケーリング - トランジション（適用）"
    },
    {
      "indent": 3,
      "text": "Goals and milestones The working group charter MUST establish a timetable for specific work items. While this may be renegotiated over time, the list of milestones and dates facilitates the Area Director's tracking of working group progress and status, and it is indispensable to potential participants identifying the critical moments for input. Milestones shall consist of deliverables that can be qualified as showing specific achievement; e.g., \"Internet-Draft finished\" is fine, but \"discuss via email\" is not. It is helpful to specify milestones for every 3-6 months, so that progress can be gauged easily. This milestone list is expected to be updated periodically (see section 5).",
      "ja": "目標とマイルストーンは、ワーキンググループ憲章は、特定の作業項目のためのタイムテーブルを確立する必要があります。これは時間をかけて再交渉することができるが、マイルストーンと日付のリストは、ワーキンググループの進捗とステータスのエリアディレクターの追跡を容易にし、そしてそれは、入力のための重要な瞬間を特定する可能性のある参加者に不可欠です。マイルストーンは、具体的な成果を示すよう修飾することができます成果で構成されなければなりません。例えば、「インターネットドラフトが終わっ」「電子メールを介して話し合う」罰金ですが、ではありません。進捗状況を簡単に測ることができるように、3〜6ヶ月毎のためのマイルストーンを指定すると便利です。このマイルストーンのリストは、（セクション5を参照）定期的に更新される予定です。"
    },
    {
      "indent": 6,
      "text": "An example of a WG charter is included as Appendix A.",
      "ja": "WG憲章の例は付録Aとして含まれています"
    },
    {
      "indent": 0,
      "text": "2.3. Charter review & approval",
      "section_title": true,
      "ja": "2.3。憲章のレビュー＆承認"
    },
    {
      "indent": 3,
      "text": "Proposed working groups often comprise technically competent participants who are not familiar with the history of Internet architecture or IETF processes. This can, unfortunately, lead to good working group consensus about a bad design. To facilitate working group efforts, an Area Director may assign a Consultant from among the ranks of senior IETF participants. (Consultants are described in section 6.) At the discretion of the Area Director, approval of a new WG may be withheld in the absence of sufficient consultant resources.",
      "ja": "提案されたワーキンググループは、多くの場合、インターネットアーキテクチャやIETFプロセスの歴史に精通していない技術的に有能な参加者を含みます。これは、残念ながら、悪いデザインの良いワーキンググループコンセンサスにつながることができます。ワーキンググループの取り組みを促進するために、エリアディレクターは、シニアIETF参加者のランクの中からコンサルタントを割り当てることができます。エリアディレクターの裁量で（コンサルタントは、セクション6に記載されている）、新しいWGの承認は、十分なコンサルタント資源が存在しない場合に留保することができます。"
    },
    {
      "indent": 3,
      "text": "Once the Area Director (and the Area Directorate, as the Area Director deems appropriate) has approved the working group charter, the charter is submitted for review by the IAB and approval by the IESG. After a review period of at least a week the proposed charter is posted to the IETF-announce mailing list as a public notice that the formation of the working group is being considered. At the same time the proposed charter is also posted to the \"new-work\" mailing list. This mailing list has been created to let qualified representatives from other standards organizations know about pending IETF working groups. After another review period lasting at least a week the IESG MAY approve the charter as-is, it MAY request that changes be made in the charter, or MAY decline to approve chartering of the working group",
      "ja": "エリアディレクター（エリアディレクターとして、また地域総局は、適切と判断）したら憲章がIESGによってIABによる審査と承認のために提出され、ワー​​キンググループ憲章を承認しました。少なくとも1週間の審査期間の後、提案憲章は、ワーキンググループの形成が検討されていることを公告としてIETF-announceメーリングリストに投稿されています。同時に、提案憲章はまた、「新しい仕事」メーリングリストに投稿されています。このメーリングリストは、他の標準化団体からの資格の代表が保留中のIETFワーキンググループについて知っているように作成されています。少なくとも一週間持続別の審査期間の後IESGは、あるとして、それは変更がチャーターで行うことを要求することができる、憲章を承認することができる、またはワーキンググループのチャーターの承認を拒否することができます"
    },
    {
      "indent": 3,
      "text": "If the IESG approves the formation of the working group it remands the approved charter to the IETF Secretariat who records and enters the information into the IETF tracking database. The working group is announced to the IETF-announce a by the IETF Secretariat.",
      "ja": "IESGがワーキンググループの形成を承認した場合には、IETF追跡データベースに情報を記録し、入るIETF事務局に承認された憲章をremands。ワーキンググループは、IETF事務局によってIETFアナウンスに発表されます。"
    },
    {
      "indent": 0,
      "text": "2.4. Birds of a Feather (BOF)",
      "section_title": true,
      "ja": "2.4。フェザーの鳥（BOF）"
    },
    {
      "indent": 3,
      "text": "Often it is not clear whether an issue merits the formation of a working group. To facilitate exploration of the issues the IETF offers the possibility of a Birds of a Feather (BOF) session, as well as the early formation of an email list for preliminary discussion. In addition, a BOF may serve as a forum for a single presentation or discussion, without any intent to form a working group.",
      "ja": "多くの場合、それは問題のメリットワーキンググループを形成するかどうかは明らかではありません。問題の探査を容易にするために、IETFはフェザー（BOF）のセッションだけでなく、予備的な議論のための電子メールリストの早期形成の鳥の可能性を提供しています。また、BOFは、ワーキンググループを形成するために、任意の意図せずに、単一のプレゼンテーションや議論の場として機能することができます。"
    },
    {
      "indent": 3,
      "text": "A BOF is a session at an IETF meeting which permits \"market research\" and technical \"brainstorming\". Any individual may request permission to hold a BOF on a subject. The request MUST be filed with a relevant Area Director who must approve a BOF before it can be scheduled. The person who requests the BOF may be asked to serve as Chair of the BOF.",
      "ja": "BOFは「市場調査」と技術的な「ブレーンストーミング」を許可するIETF会議でのセッションです。任意の個人が対象でBOFを開催する許可を要求することができます。要求は、それがスケジュールすることができる前にBOFを承認する必要があり、関連するエリアディレクターに提出しなければなりません。 BOFを要求した人は、BOFの議長として機能するように求められることがあります。"
    },
    {
      "indent": 3,
      "text": "The Chair of the BOF is also responsible for providing a report on the outcome of the BOF. If the Area Director approves, the BOF is then scheduled by submitting a request to agenda@ietf.org with copies to the Area Director(s). A BOF description and agenda are required before a BOF can be scheduled.",
      "ja": "BOFの議長はまた、BOFの結果に関する報告書を提供する責任があります。エリアディレクターが承認した場合、BOFは、その後エリアディレクター（複数可）にコピーしてagenda@ietf.orgするための要求を提出することによって、予定されています。 BOFをスケジュールすることができる前にBOFの説明と議題が必要とされています。"
    },
    {
      "indent": 3,
      "text": "Available time for BOFs is limited, and BOFs are held at the discretion of the ADs for an area. The AD(s) may require additional assurances before authorizing a BOF. For example,",
      "ja": "BOFsのために利用できる時間が限られており、BOFsは、地域の広告の裁量で開催されています。 AD（複数可）BOFを許可する前に、追加の保証を必要とするかもしれません。例えば、"
    },
    {
      "indent": 4,
      "text": "- The Area Director MAY require the establishment of an open email list prior to authorizing a BOF. This permits initial exchanges and sharing of framework, vocabulary and approaches, in order to make the time spent in the BOF more productive.",
      "ja": " - エリアディレクターは前にBOFを認可するオープン電子メールリストの確立が必要な場合があります。これは、BOFに費やされる時間がより生産的にするために、最初の交換やフレームワーク、語彙やアプローチの共有を可能にします。"
    },
    {
      "indent": 4,
      "text": "- The Area Director MAY require that a BOF be held, prior to establishing a working group (see section 2.2).",
      "ja": " - エリアディレクターは、ワーキンググループを確立する前に（セクション2.2を参照）、BOFが開催されることを要求することができます。"
    },
    {
      "indent": 4,
      "text": "- The Area Director MAY require that there be a draft of the WG charter prior to holding a BOF.",
      "ja": " - エリアディレクターはWG憲章の草案は、前BOFを保持することがあることが必要な場合があります。"
    },
    {
      "indent": 4,
      "text": "- The Area Director MAY require that a BOF not be held until an Internet-Draft describing the proposed technology has been published so it can be used as a basis for discussion in the BOF.",
      "ja": " - エリアディレクターは、BOFでの議論のための基礎として使用できるように提案されている技術が公開されている記述BOFは、インターネットドラフトまで開催されていないことを要求することができます。"
    },
    {
      "indent": 3,
      "text": "In general, a BOF on a particular topic is held only once (ONE slot at one IETF Plenary meeting). Under unusual circumstances Area Directors may, at their discretion, allow a BOF to meet for a second time. BOFs are not permitted to meet three times. Note that all other things being equal, WGs will be given priority for meeting space over BOFs. Also, occasionally BOFs may be held for other purposes than to discuss formation of a working group.",
      "ja": "一般的に、特定のトピックに関するBOFは、（1回のIETF総会会議で一つのスロット）に一度だけ保持されます。異常な状況下では地域の取締役は、その裁量で、BOFは二回目の満たすことを可能にします。 BOFsは、3回を満たすために許可されていません。他のすべてのものが等しいことに注意してください、のWGはBOFs上のスペースを満たすための優先順位が与えられます。また、時折BOFsはワーキンググループの形成を議論するよりも他の目的のために保持してもよいです。"
    },
    {
      "indent": 3,
      "text": "Usually the outcome of a BOF will be one of the following:",
      "ja": "通常、BOFの結果は、次のいずれかになります。"
    },
    {
      "indent": 4,
      "text": "- There was enough interest and focus in the subject to warrant the formation of a WG;",
      "ja": " -  WGの形成を保証するために対象に十分な関心と焦点がありました。"
    },
    {
      "indent": 4,
      "text": "- While there was a reasonable level of interest expressed in the BOF some other criteria for working group formation was not met (see section 2.1).",
      "ja": " - 興味の合理的なレベルが存在したが（セクション2.1を参照）ワーキンググループを形成するためのいくつかの他の基準が満たされなかったBOFで発現。"
    },
    {
      "indent": 4,
      "text": "- The discussion came to a fruitful conclusion, with results to be written down and published, however there is no need to establish a WG; or",
      "ja": " - 結果は、しかし、WGを設置する必要がなく、ダウン書かれ、公表されるとの議論は、実りある結論に達しました。または"
    },
    {
      "indent": 4,
      "text": "- There was not enough interest in the subject to warrant the formation of a WG.",
      "ja": " -  WGの形成を保証するために対象に十分な関心がありませんでした。"
    },
    {
      "indent": 0,
      "text": "3. Working Group Operation",
      "section_title": true,
      "ja": "3.ワーキンググループの操作"
    },
    {
      "indent": 3,
      "text": "The IETF has basic requirements for open and fair participation and for thorough consideration of technical alternatives. Within those constraints, working groups are autonomous and each determines most of the details of its own operation with respect to session participation, reaching closure, etc. The core rule for operation is that acceptance or agreement is achieved via working group \"rough consensus\". WG participants should specifically note the requirements for disclosure of conflicts of interest in [2].",
      "ja": "IETFは、オープンでフェアな参加と技術的な代替案を徹底的に検討するための基本的な要件があります。これらの制約の範囲内など、ワーキンググループは自律的であり、それぞれは、セッション参加に対する自身の動作の詳細の大部分を決定し、閉鎖に至る操作のコアルールは受諾又は契約がグループ「ラフコンセンサスを」作業を介して達成されることです。 WGの参加者は、具体的で利益相反の開示の要件に注意しなければならない[2]。"
    },
    {
      "indent": 3,
      "text": "A number of procedural questions and issues will arise over time, and it is the function of the Working Group Chair(s) to manage the group process, keeping in mind that the overall purpose of the group is to make progress towards reaching rough consensus in realizing the working group's goals and objectives.",
      "ja": "手続き上の質問や問題の数は、時間の経過とともに生じることになる、グループの全体的な目的はラフコンセンサスに到達に向けた進展を作ることであることを念頭に置いて、グループ・プロセスを管理するための作業部会議長（S）の関数であり、ワーキンググループの目標と目的を実現します。"
    },
    {
      "indent": 3,
      "text": "There are few hard and fast rules on organizing or conducting working group activities, but a set of guidelines and practices has evolved over time that have proven successful. These are listed here, with actual choices typically determined by the working group participants and the Chair(s).",
      "ja": "そこワーキンググループ活動を組織または導電性には、いくつかのハードと高速のルールがありますが、ガイドラインと実践のセットが成功を収めてきた時間をかけて進化してきました。これらは、通常、ワーキンググループ参加者と椅子によって決定される実際の選択肢で、ここに記載されています。"
    },
    {
      "indent": 0,
      "text": "3.1. Session planning",
      "section_title": true,
      "ja": "3.1。セッションプランニング"
    },
    {
      "indent": 3,
      "text": "For coordinated, structured WG interactions, the Chair(s) MUST publish a draft agenda well in advance of the actual session. The agenda should contain at least:",
      "ja": "コーディネート、構造化されたWGの相互作用については、議長（複数）は、実際のセッションの事前に議題案を公表しなければなりません。議題は、少なくとも含まれている必要があります。"
    },
    {
      "indent": 3,
      "text": "- The items for discussion; - The estimated time necessary per item; and - A clear indication of what documents the participants will need to read before the session in order to be well prepared.",
      "ja": " - 議論のためのアイテム。 - アイテムごとに必要な推定時間。そして - 参加者を文書化するものの明確な兆候は十分に準備するために、セッションの前に読む必要があります。"
    },
    {
      "indent": 3,
      "text": "Publication of the working group agenda shall include sending a copy of the agenda to the working group mailing list and to agenda@ietf.org.",
      "ja": "ワーキンググループの議題の公表は、ワーキンググループのメーリングリストに議題のコピーを送信含まなければならないとagenda@ietf.orgします。"
    },
    {
      "indent": 3,
      "text": "All working group actions shall be taken in a public forum, and wide participation is encouraged. A working group will conduct much of its business via electronic mail distribution lists but may meet periodically to discuss and review task status and progress, to resolve specific issues and to direct future activities. IETF Plenary meetings are the primary venue for these face-to-face working group sessions, and it is common (though not required) that active \"interim\" face-to-face meetings, telephone conferences, or video conferences may also be held. Interim meetings are subject to the same rules for advance notification, reporting, open participation, and process, which apply to other working group meetings.",
      "ja": "すべてのワーキンググループのアクションが公開フォーラムに講じなければならない、と幅広い参加が奨励されます。ワーキンググループは、電子メール配信リストを経由してその事業の多くを行いますが、特定の問題を解決し、今後の活動を指揮するために、タスクのステータスと進行状況を議論し、検討するために定期的に会うことがあります。 IETF総会会議は、これら対面ワーキンググループセッションのための主要な場所であり、それはアクティブ「暫定」対面会議、電話会議、ビデオ会議も保持されてもよいことは（必須ではないが）一般的です。中間会合は、他のワーキンググループミーティングに適用される事前通知、レポート作成、オープン参加、およびプロセスのための同じ規則、の対象となります。"
    },
    {
      "indent": 3,
      "text": "All working group sessions (including those held outside of the IETF meetings) shall be reported by making minutes available. These minutes should include the agenda for the session, an account of the discussion including any decisions made, and a list of attendees. The Working Group Chair is responsible for insuring that session minutes are written and distributed, though the actual task may be performed by someone designated by the Working Group Chair. The minutes shall be submitted in printable ASCII text for publication in the IETF Proceedings, and for posting in the IETF Directories and are to be sent to: minutes@ietf.org",
      "ja": "（IETF会合の外で開催されたものを含む）すべてのワーキンググループセッションでは分が利用可能にすることによって報告されなければなりません。これらの分は、セッションの議題、行われたすべての意思決定を含め議論のアカウント、および参加者のリストを含める必要があります。作業部会議長は、実際の作業は、作業部会議長が指定する誰かによって行うことができるものの、セッション分は、書かれて配布されることを保証する責任があります。分、およびIETFディレクトリに掲載するためにIETF議事録出版のための印刷可能なASCIIテキストに提出しなければならないとに送信されるようにされていますminutes@ietf.org"
    },
    {
      "indent": 0,
      "text": "3.2. Session venue",
      "section_title": true,
      "ja": "3.2。セッション会場"
    },
    {
      "indent": 3,
      "text": "Each working group will determine the balance of email and face-to-face sessions that is appropriate for achieving its milestones. Electronic mail permits the widest participation; face-to-face meetings often permit better focus and therefore can be more efficient for reaching a consensus among a core of the working group participants. In determining the balance, the WG must ensure that its process does not serve to exclude contribution by email-only participants. Decisions reached during a face-to-face meeting about topics or issues which have not been discussed on the mailing list, or are significantly different from previously arrived mailing list consensus MUST be reviewed on the mailing list.",
      "ja": "各ワーキンググループは、そのマイルストーンを達成するための適切な電子メールや対面セッションのバランスを決定します。電子メールは、最も広い参加を許可します。対面会議は、多くの場合、より良いフォーカスを可能にし、したがって、ワーキンググループ参加者のコア間の合意に到達するためのより効率的にすることができます。バランスの決定では、WGは、そのプロセスは、電子メールのみの参加者の貢献を除外するのに役立つていないことを確認する必要があります。メーリングリストで議論、あるいは大幅に以前に到着したメーリングリストのコンセンサスとは異なりますされていないトピックや問題について、対面会議中に到達した決定は、メーリングリストに見直さなければなりません。"
    },
    {
      "indent": 3,
      "text": "IETF Meetings If a WG needs a session at an IETF meeting, the Chair must apply for time-slots as soon as the first announcement of that IETF meeting is made by the IETF Secretariat to the WG-chairs list. Session time is a scarce resource at IETF meetings, so placing requests early will facilitate schedule coordination for WGs requiring the same set of experts.",
      "ja": "WGは、IETF会議でのセッションを必要とする場合はIETFミーティングでは、議長は、すぐにそのIETF会議の最初の発表はWG議長リストにIETF事務局によって行われるようタイムスロットを申請しなければなりません。セッション時間は、IETF会合で希少資源であるため、配置の要求は、早期の専門家の同じセットを必要とするのWGのスケジュール調整を容易にするであろう。"
    },
    {
      "indent": 3,
      "text": "The application for a WG session at an IETF meeting MUST be made to the IETF Secretariat at the address agenda@ietf.org. Some Area Directors may want to coordinate WG sessions in their area and request that time slots be coordinated through them. If this is the case it will be noted in the IETF meeting announcement. A WG scheduling request MUST contain:",
      "ja": "IETF会議でWGセッションのためのアプリケーションは、アドレスagenda@ietf.orgでIETF事務局に行わなければなりません。いくつかのエリアの取締役は、その地域におけるWGのセッションを調整したいとのタイムスロットは、それらを介して調整されることを要求することができます。この場合には、IETFミーティングの発表に注目されるであろう。 WGスケジューリング要求が含まれていなければなりません："
    },
    {
      "indent": 3,
      "text": "- The working group name and full title;\n- The amount of time requested;\n- The rough outline of the WG agenda that is expected to be covered;\n- The estimated number of people that will attend the WG session;\n- Related WGs that should not be scheduled for the same time slot(s);\n  and\n- Optionally a request can be added for the WG session to be\n  transmitted over the Internet in audio and video.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "NOTE: While open discussion and contribution is essential to working group success, the Chair is responsible for ensuring forward progress. When acceptable to the WG, the Chair may call for restricted participation (but not restricted attendance!) at IETF working group sessions for the purpose of achieving progress. The Working Group Chair then has the authority to refuse to grant the floor to any individual who is unprepared or otherwise covering inappropriate material, or who, in the opinion of the Chair is disrupting the WG process. The Chair should consult with the Area Director(s) if the individual persists in disruptive behavior.",
      "ja": "注：オープンな議論と貢献は、ワーキンググループの成功に不可欠である一方、議長は前進を確保する責任があります。ときにWGに受け入れ、議長は制限され、参加を呼びかけ（ただし、出席を制限されない！）もIETFでの進展を達成するために、グループセッションを作業します。作業部会議長は、議長の意見では、準備ができていないか、そうでない場合は、不適切な材料をカバーする、または誰がどの個人に床を付与することを拒否する権限は、WGのプロセスを中断されています。個人が破壊的行動で解決しない場合は、議長は、エリアディレクター（S）に相談してください。"
    },
    {
      "indent": 3,
      "text": "On-line It can be quite useful to conduct email exchanges in the same manner as a face-to-face session, with published schedule and agenda, as well as on-going summarization and consensus polling.",
      "ja": "オンライン起こって要約し、コンセンサスポーリングをだけでなく、公表されたスケジュール及び議題で、対面セッションと同様に、電子メールのやり取りを行うためには非常に便利です。"
    },
    {
      "indent": 3,
      "text": "Many working group participants hold that mailing list discussion is the best place to consider and resolve issues and make decisions. The choice of operational style is made by the working group itself. It is important to note, however, that Internet email discussion is possible for a much wider base of interested persons than is attendance at IETF meetings, due to the time and expense required to attend.",
      "ja": "多くのワーキンググループの参加者は、メーリングリストの議論は考慮して問題を解決し、意思決定をするのに最適な場所であることを保持します。運用スタイルの選択は、ワーキンググループ自体によって行われます。しかし、そのインターネット電子メールの議論が出席出席するために必要な時間と費用のためにIETF会合、であるよりも、興味を持った人のはるかに広いベースのために可能である、注意することが重要です。"
    },
    {
      "indent": 3,
      "text": "As with face-to-face sessions occasionally one or more individuals may engage in behavior on a mailing list which disrupts the WG's progress. In these cases the Chair should attempt to discourage the behavior by communication directly with the offending individual rather than on the open mailing list. If the behavior persists then the Chair must involve the Area Director in the issue. As a last resort and after explicit warnings, the Area Director, with the approval of the IESG, may request that the mailing list maintainer block the ability of the offending individual to post to the mailing list. (If the mailing list software permits this type of operation.) Even if this is done, the individual must not be prevented from receiving messages posted to the list. Other methods of mailing list control may be considered but must be approved by the AD(s) and the IESG.",
      "ja": "対面セッションと同じように、時々1人以上の個人がWGの進捗状況を乱すメーリングリストで行動に従事することができます。これらのケースでは議長が直接問題のある個人というよりオープンなメーリングリストで通信によって行動を阻止しようとしなければなりません。動作が解決しない場合は、議長は、この問題にエリアディレクターを伴う必要があります。最後の手段として明示的な警告の後、エリアディレクターは、IESGの承認を得て、メーリングリストのメンテナがメーリングリストに投稿する問題の個々の能力をブロックすることを要求することができます。 （メーリングリストソフトウェアは、このタイプの動作を許可する場合。）これが行われる場合であっても、個人がリストに投稿されたメッセージを受信することを防止することはできません。メーリングリストコントロールの他の方法を考えてもよいが、AD（S）とIESGによって承認されなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.3. Session management",
      "section_title": true,
      "ja": "3.3。セッション管理"
    },
    {
      "indent": 3,
      "text": "Working groups make decisions through a \"rough consensus\" process. IETF consensus does not require that all participants agree although this is, of course, preferred. In general, the dominant view of the working group shall prevail. (However, it must be noted that \"dominance\" is not to be determined on the basis of volume or persistence, but rather a more general sense of agreement.) Consensus can be determined by a show of hands, humming, or any other means on which the WG agrees (by rough consensus, of course). Note that 51% of the working group does not qualify as \"rough consensus\" and 99% is better than rough. It is up to the Chair to determine if rough consensus has been reached.",
      "ja": "ワーキンググループは、「ラフコンセンサス」プロセスを経て決定を下します。 IETFコンセンサスは、これは、もちろん、好ましいが、すべての参加者が同意している必要はありません。一般的には、ワーキンググループの支配的な観点が優先するものとします。コンセンサスは、ハミング、挙手によって決定することができる（ただし、。「支配」とは、ボリュームまたは持続性ではなく、合意のより一般的な意味に基づいて決定されるものではないことに注意しなければならない）、または任意の他の手段その上WGは、（もちろん、ラフコンセンサスで）同意します。ワーキンググループの51％が「ラフコンセンサス」としての資格はありませんし、99％がラフよりも優れていることに注意してください。それはラフコンセンサスに達しているかどうかを判断するために議長に任されています。"
    },
    {
      "indent": 3,
      "text": "It can be particularly challenging to gauge the level of consensus on a mailing list. There are two different cases where a working group may be trying to understand the level of consensus via a mailing list discussion. But in both cases the volume of messages on a topic is not, by itself, a good indicator of consensus since one or two individuals may be generating much of the traffic.",
      "ja": "メーリングリスト上のコンセンサスのレベルを測ることは特に挑戦することができます。ワーキンググループは、メーリングリストの議論を通じて合意のレベルを理解しようとすることができる二つの異なる場合があります。しかし、どちらの場合も、トピックのメッセージの量ではなく、それ自体で1人のまたは2つの個人以来、コンセンサスの良い指標は、トラフィックの多くを生成することができます。"
    },
    {
      "indent": 3,
      "text": "In the case where a consensus which has been reached during a face-to-face meeting is being verified on a mailing list the people who were in the meeting and expressed agreement must be taken into account. If there were 100 people in a meeting and only a few people on the mailing list disagree with the consensus of the meeting then the consensus should be seen as being verified. Note that enough time should be given to the verification process for the mailing list readers to understand and consider any objections that may be raised on the list. The normal two week last-call period should be sufficient for this.",
      "ja": "対面会議中に達した合意は、メーリングリスト上で検証されている場合は、会議にあったとの合意を表明し、人々を考慮に入れなければなりません。会議では100人と、メーリングリスト上の唯一の少数の人々があった場合は、コンセンサスが確認されていると見なされるべきである会議の合意に反対。メーリングリストの読者がリストに上昇させることができる異議を理解し、検討するための十分な時間が検証プロセスに与えられるべきであることに注意してください。通常2週間の最後の呼び出しの期間は、このために十分なはずです。"
    },
    {
      "indent": 3,
      "text": "The other case is where the discussion has been held entirely over the mailing list. The determination of the level of consensus may be harder to do in this case since most people subscribed to mailing lists do not actively participate in discussions on the list. It is left to the discretion of the working group chair how to evaluate the level of consensus. The most common method used is for the working group chair to state what he or she believes to be the consensus view and. at the same time, requests comments from the list about the stated conclusion.",
      "ja": "議論はメーリングリスト上で完全に開催されてきたところ、他の場合です。メーリングリストに加入し、ほとんどの人が積極的にリスト上の議論に参加していないので、コンセンサスのレベルの決意が、この場合に行うのは難しいかもしれません。それは、どのようなコンセンサスのレベルを評価するためのワーキンググループの議長の裁量に任されています。使用される最も一般的な方法は、彼または彼女は多数の見解であると信じるものを述べるワーキンググループの議長のためであると。同時に、述べた結論に関するリストからのコメントを要求します。"
    },
    {
      "indent": 3,
      "text": "The challenge to managing working group sessions is to balance the need for open and fair consideration of the issues against the need to make forward progress. The working group, as a whole, has the final responsibility for striking this balance. The Chair has the responsibility for overseeing the process but may delegate direct process management to a formally-designated Facilitator.",
      "ja": "ワーキンググループセッションを管理するための課題は、前進を作る必要に対する課題のオープンで公正な検討の必要性のバランスを取ることです。ワーキンググループは、全体として、このバランスをとるための最終的な責任を負っています。議長は、プロセスを監督する責任を負っているが、正式に指定ファシリテーターへの直接プロセス管理を委任することができます。"
    },
    {
      "indent": 3,
      "text": "It is occasionally appropriate to revisit a topic, to re-evaluate alternatives or to improve the group's understanding of a relevant decision. However, unnecessary repeated discussions on issues can be avoided if the Chair makes sure that the main arguments in the discussion (and the outcome) are summarized and archived after a discussion has come to conclusion. It is also good practice to note important decisions/consensus reached by email in the minutes of the next 'live' session, and to summarize briefly the decision-making history in the final documents the WG produces.",
      "ja": "代替案を再評価したり、関連する意思決定のグループの理解を向上させるために、トピックを再訪する時折適切です。議長は、議論は結論に達した後に議論（と結果）の主な引数はまとめてアーカイブされていることを確認する場合は、問題についての不必要な繰り返しの議論を回避することができます。また、次の「ライブ」セッションの数分でメールが到達した重要な決定/コンセンサスに注意すること、およびWGが作成する最終文書に簡単に意思決定の歴史を要約することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "To facilitate making forward progress, a Working Group Chair may wish to decide to reject or defer the input from a member, based upon the following criteria:",
      "ja": "前方に進歩して容易にするために、作業部会議長は、次の基準に基づいて、メンバーからの入力を拒否または延期することを決定したいことがあります。"
    },
    {
      "indent": 3,
      "text": "Old The input pertains to a topic that already has been resolved and is redundant with information previously available;",
      "ja": "古い入力はすでに解決されているトピックに関連する情報以前に利用可能と冗長です。"
    },
    {
      "indent": 3,
      "text": "Minor The input is new and pertains to a topic that has already been resolved, but it is felt to be of minor import to the existing decision;",
      "ja": "マイナー入力は新しく、すでに解決されているトピックに関連するが、既存の意思決定にマイナーな輸入のように感じられます。"
    },
    {
      "indent": 3,
      "text": "Timing The input pertains to a topic that the working group has not yet opened for discussion; or",
      "ja": "入力タイミングは、ワーキンググループは、まだ議論のために開いていないことを話題に関係します。または"
    },
    {
      "indent": 3,
      "text": "Scope The input is outside of the scope of the working group charter.",
      "ja": "スコープの入力はワーキンググループ憲章の範囲外です。"
    },
    {
      "indent": 0,
      "text": "3.4. Contention and appeals",
      "section_title": true,
      "ja": "3.4。競合とアピール"
    },
    {
      "indent": 3,
      "text": "Disputes are possible at various stages during the IETF process. As much as possible the process is designed so that compromises can be made, and genuine consensus achieved; however, there are times when even the most reasonable and knowledgeable people are unable to agree. To achieve the goals of openness and fairness, such conflicts must be resolved by a process of open review and discussion.",
      "ja": "紛争は、IETFプロセス中の様々な段階で可能です。できるだけ多くのプロセスが妥協を行うことができるように設計され、本物のコンセンサスが達成されます。しかし、も、最も合理的かつ博識の人が同意することができない時間があります。開放性と公平性の目標を達成するために、このような競合は公開審査と議論の過程で解決されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Formal procedures for requesting a review of WG, Chair, Area Director or IESG actions and conducting appeals are documented in The Internet Standards Process [1].",
      "ja": "WG、椅子、エリアディレクターやIESG行動の見直しを要求し、控訴を行うための正式な手順は、インターネット標準化過程[1]に記載されています。"
    },
    {
      "indent": 0,
      "text": "4. Working Group Termination",
      "section_title": true,
      "ja": "4.作業部会終了"
    },
    {
      "indent": 3,
      "text": "Working groups are typically chartered to accomplish a specific task or tasks. After the tasks are complete, the group will be disbanded. However, if a WG produces a Proposed or Draft Standard, the WG will frequently become dormant rather than disband (i.e., the WG will no longer conduct formal activities, but the mailing list will remain available to review the work as it moves to Draft Standard and Standard status.)",
      "ja": "ワーキンググループは、通常、特定のタスクまたはタスクを達成するためにチャーターされています。作業が完了したら、グループは解散します。 WGは、提案や規格案を作成する場合は、WGは、頻繁に（すなわち、WGは、もはや正式な活動を行っていないだろうが、それは標準のドラフトに移動するようメーリングリストは、作業を確認するために利用できるまま休止状態になるのではなく解散しますそして標準の状態。）"
    },
    {
      "indent": 3,
      "text": "If, at some point, it becomes evident that a working group is unable to complete the work outlined in the charter, or if the assumptions which that work was based have been modified in discussion or by experience, the Area Director, in consultation with the working group can either:",
      "ja": "、いくつかの点で、それはワーキンググループがチャーターで概説した作業を完了することができないことが明らかになった場合、またはその仕事は基づいていた仮定は議論や経験によって変更された場合は、と協議の地域ディレクター、ワーキンググループのいずれかを実行できます。"
    },
    {
      "indent": 3,
      "text": "1. Recharter to refocus its tasks, 2. Choose new Chair(s), or 3. Disband.",
      "ja": "1. Recharterは2.新しい椅子、または3解散を選択し、そのタスクを再フォーカスします。"
    },
    {
      "indent": 3,
      "text": "If the working group disagrees with the Area Director's choice, it may appeal to the IESG (see section 3.4).",
      "ja": "ワーキンググループは、地域ディレクターの選択に同意しない場合は、IESG（セクション3.4を参照）に上訴することができます。"
    },
    {
      "indent": 0,
      "text": "5. Rechartering a Working Group",
      "section_title": true,
      "ja": "5.ワーキンググループをRechartering"
    },
    {
      "indent": 3,
      "text": "Updated milestones are renegotiated with the Area Director and the IESG, as needed, and then are submitted to the IESG Secretariat: iesg-secretary@ietf.org.",
      "ja": "更新されたマイルストーンは、必要に応じて、地域ディレクターとIESGと再交渉され、その後、IESG事務局に提出されていますiesg-secretary@ietf.org。"
    },
    {
      "indent": 3,
      "text": "Rechartering (other than revising milestones) a working group follows the same procedures that the initial chartering does (see section 2). The revised charter must be submitted to the IESG and IAB for approval. As with the initial chartering, the IESG may approve new charter as-is, it may request that changes be made in the new charter (including having the Working Group continue to use the old charter), or it may decline to approve the rechartered working group. In the latter case, the working group is disbanded.",
      "ja": "（マイルストーンを修正以外）Recharteringワーキンググループは、最初の用船は（セクション2を参照）ない同一の手順に従います。改訂憲章は、承認のためにIESGとIABに提出しなければなりません。そのまま初期用船と同じように、IESGは新しい憲章を承認することができる、それは変更が（ワーキンググループが古いチャーターを使用し続けたなどの）新しい憲章に行われることを要求することができる、またはそれはrechartered作業の承認を拒否することができますグループ。後者の場合、ワーキンググループが解散されます。"
    },
    {
      "indent": 0,
      "text": "6. Staff Roles",
      "section_title": true,
      "ja": "6.スタッフの役割"
    },
    {
      "indent": 3,
      "text": "Working groups require considerable care and feeding. In addition to general participation, successful working groups benefit from the efforts of participants filling specific functional roles. The Area Director must agree to the specific people performing the WG Chair, and Working Group Consultant roles, and they serve at the discretion of the Area Director.",
      "ja": "ワーキンググループは、かなりのケアと摂食が必要です。一般の参加に加えて、成功したワーキンググループは、特定の機能的役割を埋める参加者の努力の恩恵を受ける。エリアディレクターはWGの議長を行い、特定の人に同意し、ワーキンググループのコンサルタントの役割、そして、彼らは地域ディレクターの裁量で奉仕しなければなりません。"
    },
    {
      "indent": 0,
      "text": "6.1. WG Chair",
      "section_title": true,
      "ja": "6.1。 WGの議長"
    },
    {
      "indent": 3,
      "text": "The Working Group Chair is concerned with making forward progress through a fair and open process, and has wide discretion in the conduct of WG business. The Chair must ensure that a number of tasks are performed, either directly or by others assigned to the tasks.",
      "ja": "作業部会議長は、公正かつオープンなプロセスを前方に前進してと懸念している、とWGの業務の遂行に広い裁量権を持っています。議長は、直接またはタスクに割り当てられた他の人が、タスクの数が行われていることを確認しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Chair has the responsibility and the authority to make decisions, on behalf of the working group, regarding all matters of working group process and staffing, in conformance with the rules of the IETF. The AD has the authority and the responsibility to assist in making those decisions at the request of the Chair or when circumstances warrant such an intervention.",
      "ja": "議長は責任とIETFの規則に準拠して、ワーキンググループのプロセスと人員のすべての事項について、ワーキンググループを代表して、意思決定をする権限を持っています。 ADは状況がこのような介入を正当化する際議長またはの要求に応じて、これらの意思決定を支援するための権限と責任を持っています。"
    },
    {
      "indent": 3,
      "text": "The Chair's responsibility encompasses at least the following:",
      "ja": "議長の責任は、少なくとも以下を包含する："
    },
    {
      "indent": 3,
      "text": "Ensure WG process and content management",
      "ja": "WGのプロセスとコンテンツ管理を確認してください"
    },
    {
      "indent": 6,
      "text": "The Chair has ultimate responsibility for ensuring that a working group achieves forward progress and meets its milestones. The Chair is also responsible to ensure that the working group operates in an open and fair manner. For some working groups, this can be accomplished by having the Chair perform all management-related activities. In other working groups -- particularly those with large or divisive participation -- it is helpful to allocate process and/or secretarial functions to other participants. Process management pertains strictly to the style of working group interaction and not to its content. It ensures fairness and detects redundancy. The secretarial function encompasses document editing. It is quite common for a working group to assign the task of specification Editor to one or two participants. Sometimes, they also are part of the design team, described below.",
      "ja": "議長は、ワーキンググループが前進を実現し、そのマイルストーンを満たしていることを確実にするための最終的な責任を持っています。議長は、ワーキンググループはオープンで公正な方法で動作することを保証するためにも責任があります。いくつかのワーキンググループでは、これは、議長がすべての管理に関連する活動を行うことによって達成することができます。大規模または分裂参加して特に -   - 他のワーキンググループでは、他の参加者にプロセスおよび/または秘書の機能を割り当てることが有用です。プロセス管理は厳密にワーキンググループの相互作用のスタイルにではなく、その内容に関係します。これは、公平性を確保し、冗長性を検出します。秘書機能は、文書編集を包含する。ワーキンググループは、1人のまたは2つの参加者に仕様エディタのタスクを割り当てることは非常に一般的です。時には、彼らはまた、後述の設計チームの一部です。"
    },
    {
      "indent": 3,
      "text": "Moderate the WG email list",
      "ja": "WGの電子メールリストを緩和"
    },
    {
      "indent": 6,
      "text": "The Chair should attempt to ensure that the discussions on this list are relevant and that they converge to consensus agreements. The Chair should make sure that discussions on the list are summarized and that the outcome is well documented (to avoid repetition). The Chair also may choose to schedule organized on-line \"sessions\" with agenda and deliverables. These can be structured as true meetings, conducted over the course of several days (to allow participation across the Internet).",
      "ja": "議長は、このリスト上の議論が関連していることと、彼らは合意協定に収束することを保証するために試みるべきです。議長は、リスト上の議論が要約されていることを確認する必要がありますし、結果が十分に立証されていること（重複を避けるため）。議長はまた、議題と成果と整理のオンライン「セッション」をスケジュールすることもできます。これらは、数日間にわたって行われ、真の会合、（インターネット全体の参加を許可する）として構成することができます。"
    },
    {
      "indent": 6,
      "text": "Organize, prepare and chair face-to-face and on-line formal sessions.",
      "ja": "対面にして、オンラインでの正式なセッション、整理の準備と椅子。"
    },
    {
      "indent": 3,
      "text": "Plan WG Sessions",
      "ja": "プランWGセッション"
    },
    {
      "indent": 6,
      "text": "The Chair must plan and announce all WG sessions well in advance (see section 3.1).",
      "ja": "議長は、（セクション3.1を参照）事前に全てのWGセッションを計画して発表する必要があります。"
    },
    {
      "indent": 3,
      "text": "Communicate results of sessions",
      "ja": "セッションの結果を伝えます"
    },
    {
      "indent": 6,
      "text": "The Chair and/or Secretary must ensure that minutes of a session are taken and that an attendance list is circulated (see section 3.1).",
      "ja": "議長および/または長官はセッションの分が取られていることを確認し、出席者のリストを循環していること（セクション3.1を参照）しなければなりません。"
    },
    {
      "indent": 6,
      "text": "Immediately after a session, the WG Chair MUST provide the Area Director with a very short report (approximately one paragraph, via email) on the session.",
      "ja": "すぐにセッションの後、WG議長は、セッション上の非常に短い報告書（電子メールを介して約1つの段落）とエリアディレクターを提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Distribute the workload",
      "ja": "ワークロードを配布"
    },
    {
      "indent": 6,
      "text": "Of course, each WG will have participants who may not be able (or want) to do any work at all. Most of the time the bulk of the work is done by a few dedicated participants. It is the task of the Chair to motivate enough experts to allow for a fair distribution of the workload.",
      "ja": "もちろん、各WGは、まったく仕事をすることができる（またはたく）しないことがあり、参加者を持つことになります。時間のほとんどは、作業の大部分は、いくつかの専用の参加者によって行われます。ワークロードの公平な分配を可能にするのに十分な専門家をやる気にさせる議長の作業です。"
    },
    {
      "indent": 3,
      "text": "Document development",
      "ja": "ドキュメント開発"
    },
    {
      "indent": 6,
      "text": "Working groups produce documents and documents need authors. The Chair must make sure that authors of WG documents incorporate changes as agreed to by the WG (see section 6.3).",
      "ja": "ワーキンググループは、文書や文書が著者を必要とする生産します。議長は、WG（6.3節を参照）に合意したWG文書の作成者が変更を組み込むことを確認する必要があります。"
    },
    {
      "indent": 3,
      "text": "Document publication",
      "ja": "ドキュメントの出版"
    },
    {
      "indent": 6,
      "text": "The Chair and/or Document Editor will work with the RFC Editor to ensure document conformance with RFC publication requirements [5] and to coordinate any editorial changes suggested by the RFC Editor. A particular concern is that all participants are working from the same version of a document at the same time.",
      "ja": "議長及び/又は文書エディタ[5] RFC公開要件文書の適合性を確保するためにRFCエディタで動作し、RFCエディタにより提案された編集上の変更を調整します。特定の懸念は、すべての参加者が同時に文書の同じバージョンから作業しているということです。"
    },
    {
      "indent": 3,
      "text": "Document implementations",
      "ja": "ドキュメントの実装"
    },
    {
      "indent": 6,
      "text": "Under the procedures described in [1], the Chair is responsible for documenting the specific implementations which qualify the specification for Draft or Internet Standard status along with documentation about testing of the interoperation of these implementations.",
      "ja": "[1]に記載の手順の下では、議長は、これらの実装の相互運用のテストに関するドキュメントと共にドラフト又はインターネット標準状態の仕様を修飾する特定の実装を記録する責任があります。"
    },
    {
      "indent": 0,
      "text": "6.2. WG Secretary",
      "section_title": true,
      "ja": "6.2。 WG長官"
    },
    {
      "indent": 3,
      "text": "Taking minutes and editing working group documents often is performed by a specifically-designated participant or set of participants. In this role, the Secretary's job is to record WG decisions, rather than to perform basic specification.",
      "ja": "多くの場合、特に指定参加者によって行われるか、参加者の設定されている分、編集作業グループ文書を取ります。この役割では、秘書の仕事は、基本的な仕様を実行するのではなく、WGの決定を記録することです。"
    },
    {
      "indent": 0,
      "text": "6.3. Document Editor",
      "section_title": true,
      "ja": "6.3。ドキュメントエディタ"
    },
    {
      "indent": 3,
      "text": "Most IETF working groups focus their efforts on a document, or set of documents, that capture the results of the group's work. A working group generally designates a person or persons to serve as the Editor for a particular document. The Document Editor is responsible for ensuring that the contents of the document accurately reflect the decisions that have been made by the working group.",
      "ja": "ほとんどのIETFワーキンググループは文書に努力を集中する、またはドキュメントのセット、それがグループの作業の結果をキャプチャします。ワーキンググループは、一般的に、人または人が、特定の文書のためのエディタとして機能するように指定します。ドキュメントエディタは、ドキュメントの内容が正確にワーキンググループによって行われた決定を反映していることを確実にする責任があります。"
    },
    {
      "indent": 3,
      "text": "As a general practice, the Working Group Chair and Document Editor positions are filled by different individuals to help ensure that the resulting documents accurately reflect the consensus of the working group and that all processes are followed.",
      "ja": "一般的なプラクティスとして、ワーキンググループ議長とドキュメントエディタの位置は、結果の文書が正確にワーキンググループの総意を反映しているとし、すべてのプロセスに従っていることを保証するために、異なる個人によって満たされています。"
    },
    {
      "indent": 0,
      "text": "6.4. WG Facilitator",
      "section_title": true,
      "ja": "6.4。 WGファシリテーター"
    },
    {
      "indent": 3,
      "text": "When meetings tend to become distracted or divisive, it often is helpful to assign the task of \"process management\" to one participant. Their job is to oversee the nature, rather than the content, of participant interactions. That is, they attend to the style of the discussion and to the schedule of the agenda, rather than making direct technical contributions themselves.",
      "ja": "会議は気を取らや不和になる傾向があるとき、多くの場合、一人の参加者に、「プロセス管理」のタスクを割り当てると便利です。彼らの仕事は、参加者の相互作用のため、むしろコンテンツよりも、自然を監督することです。つまり、彼らは議論のスタイルにし、議題のスケジュールに出席するのではなく、直接の技術的な貢献を自分で作ります。"
    },
    {
      "indent": 0,
      "text": "6.5. Design teams",
      "section_title": true,
      "ja": "6.5。設計チーム"
    },
    {
      "indent": 3,
      "text": "It is often useful, and perhaps inevitable, for a sub-group of a working group to develop a proposal to solve a particular problem. Such a sub-group is called a design team. In order for a design team to remain small and agile, it is acceptable to have closed membership and private meetings. Design teams may range from an informal chat between people in a hallway to a formal set of expert volunteers that the WG chair or AD appoints to attack a controversial problem. The output of a design team is always subject to approval, rejection or modification by the WG as a whole.",
      "ja": "ワーキンググループのサブグループは、特定の問題を解決するための提案を開発することは、しばしば有益な、そしておそらく避けられません。このようなサブグループは、設計チームと呼ばれています。小型で機敏なままに、設計チームのためには、閉じられたメンバーシップとプライベートの会合を持つことが可能です。設計チームは、WGの議長やADが論争の問題を攻撃するために任命専門家のボランティアの正式なセットに廊下で人と人との非公式のチャットの範囲とすることができます。設計チームの出力は常に全体としてWGによって承認、却下または変更の対象となります。"
    },
    {
      "indent": 0,
      "text": "6.6. Working Group Consultant",
      "section_title": true,
      "ja": "6.6。ワーキンググループのコンサルタント"
    },
    {
      "indent": 3,
      "text": "At the discretion of the Area Director, a Consultant may be assigned to a working group. Consultants have specific technical background appropriate to the WG and experience in Internet architecture and IETF process.",
      "ja": "エリアディレクターの裁量で、コンサルタントは、ワーキンググループに割り当てることができます。コンサルタントは、インターネットアーキテクチャとIETFの過程で特定の技術WGへの適切な背景と経験を持っています。"
    },
    {
      "indent": 0,
      "text": "6.7. Area Director",
      "section_title": true,
      "ja": "6.7。エリアディレクター"
    },
    {
      "indent": 3,
      "text": "Area Directors are responsible for ensuring that working groups in their area produce coherent, coordinated, architecturally consistent and timely output as a contribution to the overall results of the IETF.",
      "ja": "エリア取締役は、そのエリア内のワーキンググループは、IETFの全体的な結果への貢献としてコヒーレント、コーディネート、建築一貫性とタイムリーな出力を生成することを確保する責任があります。"
    },
    {
      "indent": 0,
      "text": "7. Working Group Documents",
      "section_title": true,
      "ja": "7.ワーキンググループドキュメント"
    },
    {
      "indent": 0,
      "text": "7.1. Session documents",
      "section_title": true,
      "ja": "7.1。セッションのドキュメント"
    },
    {
      "indent": 3,
      "text": "All relevant documents to be discussed at a session should be published and available as Internet-Drafts at least two weeks before a session starts. Any document which does not meet this publication deadline can only be discussed in a working group session with the specific approval of the working group chair(s). Since it is important that working group members have adequate time to review all documents, granting such an exception should only be done under unusual conditions. The final session agenda should be posted to the working group mailing list at least two weeks before the session and sent at that time to agenda@ietf.org for publication on the IETF web site.",
      "ja": "セッションで議論されるすべての関連文書は、2週間のセッションを開始する前に、少なくとも公開され、インターネットドラフトとして利用されなければなりません。この出版物の期限を満たしていない任意の文書では、唯一のワーキンググループ議長（複数可）の具体的な承認を得てワーキンググループセッションで議論することができます。それが重要であるので、ワーキンググループのメンバーは、異常な状況でのみ行われるべきで、そのような例外を認める、すべてのドキュメントを確認するための十分な時間を持っていること。最後のセッションの議題は、少なくとも2週間のセッションの前にワーキンググループのメーリングリストに投稿し、IETFのWebサイト上で公表のためagenda@ietf.orgし、その時点で送信する必要があります。"
    },
    {
      "indent": 0,
      "text": "7.2. Internet-Drafts (I-D)",
      "section_title": true,
      "ja": "7.2。インターネットドラフト（I-D）"
    },
    {
      "indent": 3,
      "text": "The Internet-Drafts directory is provided to working groups as a resource for posting and disseminating in-process copies of working group documents. This repository is replicated at various locations around the Internet. It is encouraged that draft documents be posted as soon as they become reasonably stable.",
      "ja": "インターネットドラフトディレクトリは、ワーキンググループの文書のインプロセスのコピーを掲示し、普及のためのリソースとしてワーキンググループに提供されます。このリポジトリは、インターネットの周りの様々な場所で複製されます。ドラフト文書は、すぐに彼らは合理的に安定して投稿することを奨励されています。"
    },
    {
      "indent": 3,
      "text": "It is stressed here that Internet-Drafts are working documents and have no official standards status whatsoever. They may, eventually, turn into a standards-track document or they may sink from sight. Internet-Drafts are submitted to: internet-drafts@ietf.org",
      "ja": "インターネットドラフトは作業文書であり、一切公式の標準のステータスを持っていないことをここで強調されています。彼らは、最終的には、標準トラック文書に変身したり、彼らが視界から沈むことがあります。 internet-drafts@ietf.org：インターネットドラフトはに提出されています"
    },
    {
      "indent": 3,
      "text": "The format of an Internet-Draft must be the same as for an RFC [2]. Further, an I-D must contain:",
      "ja": "インターネットドラフトのフォーマットは、RFC [2]と同じでなければなりません。さらに、I-Dが含まれている必要があります："
    },
    {
      "indent": 3,
      "text": "- Beginning, standard, boilerplate text which is provided by the Secretariat on their web site and in the ftp directory; - The I-D filename; and - The expiration date for the I-D.",
      "ja": " - 始まり、標準、自分のWebサイト上やFTPディレクトリに事務局から提供された定型文。 -  I-Dのファイル名。そして、 -  I-Dの有効期限。"
    },
    {
      "indent": 3,
      "text": "Complete specification of requirements for an Internet-Draft are found in the file \"1id-guidelines.txt\" in the Internet-Drafts directory at an Internet Repository site. The organization of the Internet-Drafts directory is found in the file \"1id-organization\" in the Internet-Drafts directory at an Internet Repository site. This file also contains the rules for naming Internet-Drafts. (See [1] for more information about Internet-Drafts.)",
      "ja": "インターネットドラフトのための要件の完全な仕様は、インターネットリポジトリサイトでインターネットドラフトディレクトリ内のファイル「1ID-guidelines.txt」に記載されています。インターネットドラフトディレクトリの組織は、インターネットリポジトリサイトでインターネットドラフトディレクトリ内のファイル「1ID組織」に含まれています。このファイルには、インターネットドラフトを命名するための規則が含まれています。 （インターネットドラフトの詳細については、[1]を参照してください。）"
    },
    {
      "indent": 0,
      "text": "7.3. Request For Comments (RFC)",
      "section_title": true,
      "ja": "7.3。要求のコメント（RFC）"
    },
    {
      "indent": 3,
      "text": "The work of an IETF working group often results in publication of one or more documents, as part of the Request For Comments (RFCs) [1] series. This series is the archival publication record for the Internet community. A document can be written by an individual in a working group, by a group as a whole with a designated Editor, or by others not involved with the IETF.",
      "ja": "IETFワーキンググループの作業は、多くの場合、コメントに対する要求（RFCの）[1]シリーズの一部として、1つ以上の文書の刊行になります。このシリーズは、インターネットコミュニティのためのアーカイブ出版レコードです。文書は、指定されたエディタで全体として基によって、またはIETFに関与しない他の人が、ワーキンググループ内の個々によって書き込むことができます。"
    },
    {
      "indent": 3,
      "text": "NOTE: The RFC series is a publication mechanism only and publication does not determine the IETF status of a document. Status is determined through separate, explicit status labels assigned by the IESG on behalf of the IETF. In other words, the reader is reminded that all Internet Standards are published as RFCs, but NOT all RFCs specify standards [4].",
      "ja": "注：RFCシリーズは唯一の出版メカニズムであり、出版物、文書のIETF状態を決定するものではありません。ステータスは、IETFの代わりに、IESGによって割り当てられた個別の、明示的なステータスラベルを通して決定されます。言い換えれば、読者は、すべてのインターネット標準がRFCとして公開されていることに留意され、すべてではないのRFCが基準を指定する[4]。"
    },
    {
      "indent": 0,
      "text": "7.4. Working Group Last-Call",
      "section_title": true,
      "ja": "7.4。ワーキンググループラストコール"
    },
    {
      "indent": 3,
      "text": "When a WG decides that a document is ready for publication it may be submitted to the IESG for consideration. In most cases the determination that a WG feels that a document is ready for publication is done by the WG Chair issuing a working group Last-Call. The decision to issue a working group Last-Call is at the discretion of the WG Chair working with the Area Director. A working group Last-Call serves the same purpose within a working group that an IESG Last-Call does in the broader IETF community (see [1]).",
      "ja": "WGは、文書が、それは考慮のためにIESGに提出することができる出版の準備ができていると判断した場合。ほとんどの場合、WGは、ドキュメントが出版の準備ができていると感じていることを決意は、WGの議長は、ワーキンググループラストコールを発行することによって行われます。ワーキンググループラストコールを発行するという決定は、エリアディレクターと協力WG議長の裁量です。ワーキンググループラストコールIESGラストコールが広いIETFコミュニティでないワーキンググループ内で同じ目的を果たす（参照[1]）。"
    },
    {
      "indent": 0,
      "text": "7.5. Submission of documents",
      "section_title": true,
      "ja": "7.5。書類の提出"
    },
    {
      "indent": 3,
      "text": "Once that a WG has determined at least rough consensus exists within the WG for the advancement of a document the following must be done:",
      "ja": "WGが決定したことをしたら、少なくとも大まかなコンセンサスは以下を行わなければならない文書の発展のためにWG内に存在します："
    },
    {
      "indent": 3,
      "text": "- The version of the relevant document exactly as agreed to by the WG MUST be in the Internet-Drafts directory.",
      "ja": " -  WGが合意どおりに関連するドキュメントのバージョンは、インターネットドラフトディレクトリに存在する必要があります。"
    },
    {
      "indent": 3,
      "text": "- The relevant document MUST be formatted according to section 7.3.",
      "ja": " - 関連するドキュメントは、セクション7.3に従ってフォーマットする必要があります。"
    },
    {
      "indent": 3,
      "text": "- The WG Chair MUST send email to the relevant Area Director. A copy of the request MUST be also sent to the IESG Secretariat. The mail MUST contain the reference to the document's ID filename, and the action requested. The copy of the message to the IESG Secretariat is to ensure that the request gets recorded by the Secretariat so that they can monitor the progress of the document through the process.",
      "ja": " -  WG議長は、関連するエリアディレクターに電子メールを送らなければなりません。要求のコピーもIESG事務局に送らなければなりません。メールには、ドキュメントのIDファイル名への参照を含まなければならない、とアクションが要求されました。 IESG事務局へのメッセージのコピーが、彼らはプロセスを通じて文書の進行状況を監視できるように、要求は事務局が記録されることを確実にするためです。"
    },
    {
      "indent": 3,
      "text": "Unless returned by the IESG to the WG for further development, progressing of the document is then the responsibility of the IESG. After IESG approval, responsibility for final disposition is the joint responsibility of the RFC Editor, the WG Chair and the Document Editor.",
      "ja": "さらなる発展のためにWGにIESGによって返さない限り、文書の進行は、その後、IESGの責任です。 IESGの承認後、最終処分の責任はRFC編集者、WGの議長とドキュメントエディタの共同責任です。"
    },
    {
      "indent": 0,
      "text": "8. Review of documents",
      "section_title": true,
      "ja": "ドキュメントの8."
    },
    {
      "indent": 3,
      "text": "The IESG reviews all documents submitted for publication as RFCs. Usually minimal IESG review is necessary in the case of a submission from a WG intended as an Informational or Experimental RFC. More extensive review is undertaken in the case of standards-track documents.",
      "ja": "IESGはRFCとして公表のために提出されたすべての文書をレビューします。通常、最小限のIESGレビューは情報や実験的RFCとして意図WGからの提出の場合に必要です。より広範なレビューは標準トラック文書の場合に行われます。"
    },
    {
      "indent": 3,
      "text": "Prior to the IESG beginning their deliberations on standards-track documents, IETF Secretariat will issue a \"Last-Call\" to the IETF mailing list (see [1]). This Last Call will announce the intention of the IESG to consider the document, and it will solicit final comments from the IETF within a period of two weeks. It is important to note that a Last-Call is intended as a brief, final check with the Internet community, to make sure that no important concerns have been missed or misunderstood. The Last-Call should not serve as a more general, in-depth review.",
      "ja": "IESGが標準トラック文書で審議を開始する前に、IETF事務局は、IETFメーリングリストへの「ラストコール」を発行します（[1]を参照）。この最後のコールは、ドキュメントを検討するIESGの意向を発表し、それが2週間の期間内に、IETFから、最終的な意見を募集します。何も重要​​な懸念は見逃していないか、誤解されていることを確認するために、最後のコールがインターネットコミュニティとの短い、最終チェックとして意図されていることに注意することが重要です。ラストコールは、より一般的な、綿密なレビューとして役立つべきではありません。"
    },
    {
      "indent": 3,
      "text": "The IESG review takes into account responses to the Last-Call and will lead to one of these possible conclusions:",
      "ja": "IESGのレビュー最終コールにアカウントの応答にとり、これらの可能な結論の一つにつながります。"
    },
    {
      "indent": 3,
      "text": "1. The document is accepted as is for the status requested. This fact will be announced by the IETF Secretariat to the IETF mailing list and to the RFC Editor.",
      "ja": "1.文書が要求された状態のためであるとして受け入れられています。この事実は、IETFメーリングリストへとRFCエディタにIETF事務局によって発表されます。"
    },
    {
      "indent": 3,
      "text": "2. The document is accepted as-is but not for the status requested. This fact will be announced by the IETF Secretariat to the IETF mailing list and to the RFC Editor (see [1] for more details).",
      "ja": "2.文書はなく、要求された状態のためであるとして受け入れられています。この事実は、IETFメーリングリストへとRFCエディタ（詳細は[1]を参照）にIETF事務局によって発表されます。"
    },
    {
      "indent": 3,
      "text": "3. Changes regarding content are suggested to the author(s)/WG. Suggestions from the IESG must be clear and direct, so as to facilitate working group and author correction of the specification. If the author(s)/WG can explain to the satisfaction of the IESG why the changes are not necessary, the document will be accepted for publication as under point 1, above. If the changes are made the revised document may be resubmitted for IESG review.",
      "ja": "内容に関する3.変更は、著者（複数可）/ WGに提案されています。仕様のワーキンググループや著者補正を容易にするためにIESGからの提案は、明確かつ直接的である必要があります。著者（S）場合、変更は必要ない理由/ WGはIESGの満足に説明することができ、文書は、上記の点1下のように出版のために受理されるであろう。変更が行われる場合に改訂された文書は、IESGレビューのために再送信することができます。"
    },
    {
      "indent": 3,
      "text": "4. Changes are suggested by the IESG and a change in status is recommended. The process described above for 3 and 2 are followed in that order.",
      "ja": "4.変更がIESGによって提案され、ステータスの変化が推奨されます。 3及び2について上述した処理は、その順序に従います。"
    },
    {
      "indent": 3,
      "text": "5. The document is rejected. Any document rejection will be accompanied by specific and thorough arguments from the IESG. Although the IETF and working group process is structured such that this alternative is not likely to arise for documents coming from a working group, the IESG has the right and responsibility to reject documents that the IESG feels are fatally flawed in some way.",
      "ja": "5.文書は拒否されます。任意の文書の拒絶はIESGから特定し、徹底した引数を伴うことになります。 IETFおよびワーキンググループのプロセスは、この代替は、ワーキンググループからの文書に起こりにくいように構成されているが、IESGはIESGの感触が致命的に何らかの方法で欠陥がある文書を拒絶する権利と責任を持っています。"
    },
    {
      "indent": 6,
      "text": "If any individual or group of individuals feels that the review treatment has been unfair, there is the opportunity to make a procedural complaint. The mechanism for this type of complaints is described in [1].",
      "ja": "個人の任意の個人またはグループは、レビュー処理が不公平されていることを感じた場合は、手続き上の苦情をする機会があります。苦情のこのタイプの機構は、[1]に記載されています。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Documents describing IETF processes, such as this one, do not have an impact on the security of the network infrastructure or of Internet applications.",
      "ja": "など、この一つとしてIETFのプロセスを、記述した文書は、ネットワークインフラストラクチャのか、インターネットアプリケーションのセキュリティに影響を与えません。"
    },
    {
      "indent": 3,
      "text": "It should be noted that all IETF working groups are required to examine and understand the security implications of any technology they develop. This analysis must be included in any resulting RFCs in a Security Considerations section. Note that merely noting a significant security hole is no longer sufficient. IETF developed technologies should not add insecurity to the environment in which they are run.",
      "ja": "すべてのIETFワーキンググループは、彼らが開発するあらゆる技術のセキュリティへの影響を調査し、理解する必要があることに留意すべきです。この分析は、セキュリティの考慮セクションのいずれかの結果としてのRFCに含まれている必要があります。単に重要なセキュリティホールに注意することはもはや十分ではないことに注意してください。 IETF開発した技術は、彼らが実行される環境に不安を追加しないでください。"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgments",
      "section_title": true,
      "ja": "10.謝辞"
    },
    {
      "indent": 3,
      "text": "This revision of this document relies heavily on the previous version (RFC 1603) which was edited by Erik Huizer and Dave Crocker. It has been reviewed by the Poisson Working Group.",
      "ja": "このドキュメントのこの改正は、エリックHuizerとDaveクロッカーによって編集された以前のバージョン（RFC 1603）に大きく依存しています。これは、ポアソン作業部会で検討されています。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., Editor, \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "ja": "[1]ブラドナーの、S.、エディタ、 \"インターネット標準化プロセス - リビジョン3\"、BCP 9、RFC 2026、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[2] Hovey, R., and S. Bradner, \"The Organizations involved in the IETF Standards Process\", BCP 11, RFC 2028, October 1996.",
      "ja": "[2] Hovey、R.、およびS.ブラドナー、BCP 11、 \"IETF標準化過程に関与する組織\"、RFC 2028、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[3] Gavin, J., \"IAB and IESG Selection, Confirmation, and Recall Process: Operation of the Nominating and Recall Committees\", BCP 10, RFC 2282, February 1998.",
      "ja": "[3]のGavin、J.、 \"IABとIESG選択、確認、およびリコール処理：指名の動作とリコール委員会\"、BCP 10、RFC 2282、1998年2月。"
    },
    {
      "indent": 3,
      "text": "[4] Huitema, C., J. Postel, S. Crocker, \"Not all RFCs are Standards\", RFC 1796, April 1995.",
      "ja": "[4]のHuitema、C.、J.ポステル、S.クロッカー、 \"すべてのRFCが標準わけではありません\"、RFC 1796、1995年4月を。"
    },
    {
      "indent": 3,
      "text": "[5] Postel, J., and J. Reynolds, \"Instructions to RFC Authors\", RFC 2223, October 1997.",
      "ja": "[5]ポステル、J.、およびJ.レイノルズ、 \"RFC作者への指示\"、RFC 2223、1997年10月。"
    },
    {
      "indent": 3,
      "text": "[6] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Level\", BCP 14, RFC 2119, March 1997.",
      "ja": "[6]ブラドナーの、S.、BCP 14、RFC 2119、1997マーチ \"のRFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 0,
      "text": "12. Editor's Address",
      "section_title": true,
      "ja": "12.編集者の住所"
    },
    {
      "indent": 3,
      "text": "Scott Bradner Harvard University 1350 Mass Ave. Cambridge MA 02138 USA",
      "ja": "スコット・ブラッドナーハーバード大学1350質量アベニュー。ケンブリッジMA 02138 USA"
    },
    {
      "indent": 3,
      "text": "Phone +1 617 495 3864 EMail: sob@harvard.edu",
      "ja": "電話+1 617 495 3864 Eメール：sob@harvard.edu"
    },
    {
      "indent": 3,
      "text": "Appendix: Sample Working Group Charter",
      "ja": "付録：ワーキンググループ憲章のサンプル"
    },
    {
      "indent": 3,
      "text": "Working Group Name: IP Telephony (iptel)",
      "ja": "ワーキンググループ名：IPテレフォニー（iptel）"
    },
    {
      "indent": 3,
      "text": "IETF Area: Transport Area",
      "ja": "IETFエリア：トランスポートエリア"
    },
    {
      "indent": 3,
      "text": "Chair(s): Jonathan Rosenberg <jdrosen@bell-labs.com>",
      "ja": "椅子：ジョナサン・ローゼンバーグ<jdrosen@bell-labs.com>"
    },
    {
      "indent": 3,
      "text": "Transport Area Director(s): Scott Bradner <sob@harvard.edu> Allyn Romanow <allyn@mci.net>",
      "ja": "交通エリアディレクター（S）：スコット・ブラッドナー<sob@harvard.edu>アリンRomanow <allyn@mci.net>"
    },
    {
      "indent": 3,
      "text": "Responsible Area Director: Allyn Romanow <allyn@mci.net>",
      "ja": "責任エリア監督：アリンRomanow <allyn@mci.net>"
    },
    {
      "indent": 3,
      "text": "Mailing Lists: General Discussion:iptel@lists.research.bell-labs.com To Subscribe: iptel-request@lists.research.bell-labs.com Archive: http://www.bell-labs.com/mailing-lists/siptel",
      "ja": "メーリングリスト：一般的なディスカッション：iptel@lists.research.bell-labs.com登録：iptel-request@lists.research.bell-labs.comアーカイブ：http://www.bell-labs.com/mailing-lists / siptel"
    },
    {
      "indent": 3,
      "text": "Description of Working Group:",
      "ja": "ワーキンググループの説明："
    },
    {
      "indent": 3,
      "text": "Before Internet telephony can become a widely deployed service, a number of protocols must be deployed. These include signaling and capabilities exchange, but also include a number of \"peripheral\" protocols for providing related services.",
      "ja": "インターネット電話が広く展開サービスになることができます前に、多数のプロトコルを展開する必要があります。これらは、シグナリングおよび機能交換を含むが、関連サービスを提供するための「周辺」プロトコルの数が含まれます。"
    },
    {
      "indent": 3,
      "text": "The primary purpose of this working group is to develop two such supportive protocols and a frameword document. They are:",
      "ja": "このワーキンググループの主な目的は、2つのこのような支援のプロトコルやframewordドキュメントを開発することです。彼らです："
    },
    {
      "indent": 3,
      "text": "1. Call Processing Syntax. When a call is setup between two endpoints, the signaling will generally pass through several servers (such as an H.323 gatekeeper) which are responsible for forwarding, redirecting, or proxying the signaling messages. For example, a user may make a call to j.doe@bigcompany.com. The signaling message to initiate the call will arrive at some server at bigcompany. This server can inform the caller that the callee is busy, forward the call initiation request to another server closer to the user, or drop the call completely (among other possibilities). It is very desirable to allow the callee to provide input to this process, guiding the server in its decision on how to act. This can enable a wide variety of advanced personal mobility and call agent services.",
      "ja": "1.コール処理の構文。コールが2つのエンドポイント間の設定がある場合、シグナリングは、一般的にリダイレクト、またはシグナリングメッセージをプロキシ、転送に関与している（例えば、H.323ゲートキーパーのような）複数のサーバを通過することになります。例えば、ユーザはj.doe@bigcompany.comへの呼び出しを行うことができます。通話を開始するためのシグナリングメッセージはbigcompanyで、いくつかのサーバーに到着します。呼び出し先がビジー状態である、発信者に知らせることができる。このサーバーは、ユーザーに近い別のサーバーへのコールの開始要求を転送する、または（他の可能性の中でも）完全にコールをドロップします。呼び出し先が行動する方法については、その決定にサーバーを導く、このプロセスへの入力を提供できるようにすることが非常に望ましいです。これは高度なパーソナルモビリティの多種多様を有効にし、エージェントサービスを呼び出すことができます。"
    },
    {
      "indent": 3,
      "text": "Such preferences can be expressed in a call processing syntax, which can be authored by the user (or generated automatically by some tool), and then uploaded to the server. The group will develop this syntax, and specify means of securely transporting and extending it. The result will be a single standards track RFC.",
      "ja": "そのような選好は、ユーザによって作成（またはいくつかのツールによって自動的に生成）し、サーバーにアップロードすることができる呼処理構文で表現することができます。グループは、この構文を開発し、安全に輸送し、それを拡張する手段を指定します。結果は、単一の標準トラックRFCになります。"
    },
    {
      "indent": 3,
      "text": "2. In addition, the group will write a service model document, which describes the services that are enabled by the call processing syntax, and discusses how the syntax can be used. This document will result in a single RFC.",
      "ja": "2.また、グループは、呼処理の構文で有効になっているサービスを記述するサービスモデルの文書を、書き込み、および構文を使用することができます方法について説明します。この文書は、単一のRFCになります。"
    },
    {
      "indent": 3,
      "text": "3. Gateway Attribute Distribution Protocol. When making a call between an IP host and a PSTN user, a telephony gateway must be used. The selection of such gateways can be based on many criteria, including client expressed preferences, service provider preferences, and availability of gateways, in addition to destination telephone number. Since gateways outside of the hosts' administrative domain might be used, a protocol is required to allow gateways in remote domains to distribute their attributes (such as PSTN connectivity, supported codecs, etc.) to entities in other domains which must make a selection of a gateway. The protocol must allow for scalable, bandwidth efficient, and very secure transmission of these attributes. The group will investigate and design a protocol for this purpose, generate an Internet Draft, and advance it to RFC as appropriate.",
      "ja": "3.ゲートウェイは、配布プロトコル属性。 IPホストとPSTNユーザ間の通話を行う場合、電話ゲートウェイを使用しなければなりません。そのようなゲートウェイの選択は、宛先電話番号に加えて、クライアント発現選好、サービスプロバイダの好み、およびゲートウェイの可用性を含め、多くの基準に基づくことができます。ホストの管理ドメインの外部ゲートウェイが使用されるかもしれないので、プロトコルは、リモート・ドメイン内のゲートウェイの選択を行う必要があり、他のドメイン内のエンティティに（等PSTN接続、サポートされるコーデック、等）の属性を分配することを可能にするために必要とされますゲートウェイ。プロトコルは、これらの属性の、スケーラブルで効率的な帯域幅、および非常に安全な伝送を可能にしなければなりません。グループが調査し、この目的のためにプロトコルを設計し、インターネットドラフトを生成し、かつ、適切なRFCにそれを進めます。"
    },
    {
      "indent": 3,
      "text": "Goals and Milestones:",
      "ja": "目標とマイルストーン："
    },
    {
      "indent": 3,
      "text": "May 98 Issue first Internet-Draft on service framework Jul 98 Submit framework ID to IESG for publication as an RFC. Aug 98 Issue first Internet-Draft on Call Processing Syntax Oct 98 Submit Call processing syntax to IESG for consideration as a Proposed Standard. Dec 98 Achieve consensus on basics of gateway attribute distribution protocol Jan 99 Submit Gateway Attribute Distribution protocol to IESG for consideration as a RFC (info, exp, stds track TB",
      "ja": "98は7月98はRFCとして公表のためにIESGにフレームワークIDを送信するサービスフレームワーク上で最初のインターネットドラフトを発行することができます。コール処理構文10月98上の8月98号最初のインターネットドラフトは、提案された標準として考慮のためにIESGへのコール処理の構文を提出してください。 12月98月99ゲートウェイは、RFC（情報として考慮のためにIESGに配布プロトコル属性提出ゲートウェイ属性配信プロトコルの基本について合意を達成し、EXP、性感染症は、TBを追跡"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}