{
  "title": {
    "text": "RFC 2379 - RSVP over ATM Implementation Guidelines",
    "ja": "RFC 2379 - ATMの実装ガイドラインを超えるRSVP"
  },
  "number": 2379,
  "created_at": "2019-10-23 22:16:45.523136+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          L. Berger\nRequest for Comments: 2379                                  FORE Systems\nBCP: 24                                                      August 1998\nCategory: Best Current Practice",
      "raw": true
    },
    {
      "indent": 16,
      "text": "RSVP over ATM Implementation Guidelines",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントはインターネットコミュニティのためのインターネットBest Current Practicesを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo presents specific implementation guidelines for running RSVP over ATM switched virtual circuits (SVCs). The general problem is discussed in [6]. Implementation requirements are discussed in [2]. Integrated Services to ATM service mappings are covered in [3]. The full set of documents present the background and information needed to implement Integrated Services and RSVP over ATM.",
      "ja": "このメモはATM仮想回線（SVC）を切り替える上でRSVPを実行するための具体的な実装ガイドラインを提示します。一般的な問題は、[6]に記載されています。実装要件は、[2]に記載されています。 ATMサービスのマッピングに統合されたサービスは、[3]覆われています。文書のフルセットは、ATM上で統合サービスとRSVPを実装するために必要な背景情報を提示します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This memo discusses running IP over ATM in an environment where SVCs are used to support QoS flows and RSVP is used as the internet level QoS signaling protocol. It applies when using CLIP/ION, LANE2.0 and MPOA methods for supporting IP over ATM. The general issues related to running RSVP[4] over ATM have been covered in several papers including [6] and other earlier work. This document is intended as a companion to [6,2] and as a guide to implementers. The reader should be familiar with both documents.",
      "ja": "このメモは、SVCのは、QoSのフローをサポートするために使用され、RSVPはシグナリングプロトコルのインターネットレベルのQoSとして使用されている環境で、ATM上でIPを実行しているについて説明します。 CLIP / ION、LANE2.0およびATM上でIPをサポートするためのMPOAの方法を使用するときに適用されます。 [4] ATM上でRSVPを実行に関連する一般的な問題は、[6]と他の初期の作品を含む、いくつかの論文でカバーされています。この文書は[6,2]にコンパニオンように実装するためのガイドとして意図されています。読者は両方の文書に精通している必要があります。"
    },
    {
      "indent": 3,
      "text": "This document provides a recommended set of functionality for implementations using ATM UNI3.x and 4.0, while allowing for more sophisticated approaches. We expect some vendors to additionally provide some of the more sophisticated approaches described in [6], and some networks to only make use of such approaches. The recommended set of functionality is defined to ensure predictability and interoperability between different implementations. Requirements for RSVP over ATM implementations are provided in [2].",
      "ja": "より洗練されたアプローチを可能にしながらこの文書では、ATM UNI3.xおよび4.0を使用して実装するための機能の推奨セットを提供します。私たちは、いくつかのベンダーはさらに、このようなアプローチを利用するだけに、[6]で説明され、より洗練されたアプローチの一部、および一部のネットワークを提供することを期待します。機能の推奨セットは異なる実装間の予測可能性と相互運用性を確保するために定義されています。 RSVP over ATM実装するための要件は、[2]に設けられています。"
    },
    {
      "indent": 3,
      "text": "This document uses the same terms and assumption stated in [2]. Additionally, the key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [5].",
      "ja": "この文書では、[2]に記載された同じ条件及び仮定を使用しています。また、キーワードは \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、および \"OPTIONAL\" この中RFC 2119に記載されるように文書が解釈されるべきである[5]。"
    },
    {
      "indent": 0,
      "text": "2. Implementation Recommendations",
      "section_title": true,
      "ja": "2.実装の推奨事項"
    },
    {
      "indent": 3,
      "text": "This section provides implementation guidelines for implementation of RSVP over ATM. Several recommendations are common for all, RSVP sessions, both unicast and multicast. There are also recommendations that are unique to unicast and multicast session types.",
      "ja": "このセクションでは、ATM上でRSVPを実装するための実装ガイドラインを提供します。いくつかの勧告は、ユニキャストとマルチキャストの両方、RSVPセッションのすべてに共通です。ユニキャストとマルチキャストセッションタイプに固有のものである勧告もあります。"
    },
    {
      "indent": 0,
      "text": "2.1 RSVP Message VC Usage",
      "section_title": true,
      "ja": "2.1 RSVPメッセージVCの使用状況"
    },
    {
      "indent": 3,
      "text": "The general issues related to which VC should be used for RSVP messages is covered in [6]. It discussed several implementation options including: mixed control and data, single control VC per session, single control VC multiplexed among sessions, and multiple VCs multiplexed among sessions. QoS for control VCs was also discussed. The general discussion is not repeated here and [6] should be reviewed for detailed information.",
      "ja": "VCは、RSVPメッセージに使用すべき関連する一般的な問題は、[6]に覆われています。混合制御およびデータ、セッションごとに単一の制御VC、セッション間で多重化単一の制御VC、およびセッション間で多重された複数のVC：それはいくつかの実装オプションを議論しました。コントロールVCのためのQoSも議論されました。一般的な議論はここでは繰り返されていないと、[6]の詳細情報については見直されるべきです。"
    },
    {
      "indent": 3,
      "text": "RSVP over ATM implementations SHOULD send RSVP control (messages) over the best effort data path, see figure 1. It is permissible to allow a user to override this behavior. The stated approach minimizes VC requirements since the best effort data path will need to exist in order for RSVP sessions to be established and in order for RSVP reservations to be initiated. The specific best effort paths that will be used by RSVP are: for unicast, the same VC used to reach the unicast destination; and for multicast, the same VC that is used for best effort traffic destined to the IP multicast group. Note that for multicast there may be another best effort VC that is used to carry session data traffic, i.e., for data that is both in the multicast group and matching a sessions protocol and port.",
      "ja": "RSVP over ATM実装は、ユーザがこの動作を無効にできるようにすることが許容される図1を参照して、ベストエフォート型のデータパス上でRSVP制御（メッセージ）を送信すべきです。ベストエフォート型のデータパスは、RSVP予約が開始されるために確立されるRSVPセッションのために、順番に順番に存在する必要がありますので、述べたアプローチは、VCの要件を最小限に抑えることができます。 RSVPによって使用される特定のベストエフォートパスは、次のとおりです。ユニキャストのために、同じVCはユニキャストの目的地に到達するために使用されます。マルチキャスト、IPマルチキャストグループ宛てのベストエフォートトラフィックのために使用されるのと同じVCのために。マルチキャストのために、すなわち、マルチキャストグループおよびセッションプロトコルおよびポートを一致の両方であるデータのために、セッション・データ・トラフィックを伝送するために使用される別のベストエフォートのVCが存在し得ることに留意されたいです。"
    },
    {
      "indent": 28,
      "text": "Data Flow ==========>",
      "raw": true
    },
    {
      "indent": 20,
      "text": "               QoS VCs\n+-----+    -------------->   +----+\n|     |  -------------->     |    |\n| Src |                      | R1 |\n|     |   Best Effort VC(s)  |    |\n+-----+  <-----------------> +----+\n             /\\\n             ||\n             ||\n         RSVP Control\n           Messages",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Figure 1: RSVP Control Message VC Usage",
      "ja": "図1：制御メッセージVCの使用をRSVP"
    },
    {
      "indent": 3,
      "text": "The disadvantage of this approach is that best effort VCs may not provide the reliability that RSVP needs. However the best effort path is expected to satisfy RSVP reliability requirements in most networks. Especially since RSVP allows for a certain amount of packet loss without any loss of state synchronization.",
      "ja": "この方法の欠点は、ベストエフォート型VCはニーズをRSVP信頼性を提供しないことです。しかし、ベストエフォートパスはほとんどのネットワークでのRSVPの信頼性要件を満たすことが期待されています。 RSVPは、状態同期を失うことなく、パケット損失の一定量を可能にする、特に以来。"
    },
    {
      "indent": 0,
      "text": "2.2 Aggregation",
      "section_title": true,
      "ja": "2.2集約"
    },
    {
      "indent": 3,
      "text": "As discussed in [6], data associated with multiple RSVP sessions can be sent using the same shared VCs. Implementation of such \"aggregation\" models is still a matter for research. Therefore, RSVP over ATM implementations SHOULD use independent VCs for each RSVP reservation.",
      "ja": "[6]で説明したように、複数のRSVPセッションに関連するデータは、同じ共有VCを使用して送信することができます。こうした「集約」モデルの実装はまだ研究のための問題です。したがって、ATM実装上RSVPは、各RSVP予約のための独立したVCを使用すべきです。"
    },
    {
      "indent": 0,
      "text": "2.3 Short-Cuts",
      "section_title": true,
      "ja": "2.3ショートカット"
    },
    {
      "indent": 3,
      "text": "Short-cuts allow ATM attached routers and hosts to directly establish point-to-point VCs across LIS boundaries, i.e., the VC end-points are on different IP subnets. Short-cut support for unicast traffic has been defined in [7] and [1]. The ability for short-cuts and RSVP to interoperate has been raised as a general question. The area of concern is the ability to handle asymmetric short-cuts. Specifically how RSVP can handle the case where a downstream short-cut may not have a matching upstream short-cut. In this case, which is shown in figure 2, PATH and RESV messages following different paths.",
      "ja": "ショートカットは、すなわち、VCエンドポイントが異なるIPサブネット上にある、直接LISの境界を越えて、ポイントツーポイントVCを確立するために、ATM接続されたルータとホストを可能にします。ユニキャストトラフィックのためのショートカットをサポートで定義されている[7]と[1]。ショートカットと相互運用するRSVPのための能力は、一般的な問題として提起されてきました。関心領域は、非対称ショートカットを処理する能力です。具体的にはどのようにRSVPは、下流ショートカットがマッチング上流のショートカットを有していなくてもよい場合を扱うことができます。図2に示されている。この場合において、PATHとRESVメッセージは異なる経路を以下。"
    },
    {
      "indent": 8,
      "text": "               ______\n              /      \\\n   +-------- / Router \\ <-------+\n   |         \\        /         |   <....... RESVs Follow\n   |          \\______/          |            Hop-by-hop Path\n   |                            |\n   |                            |\n   V           QoS VCs          |\n+-----+    ==============>   +----+\n|     |  ==============>     |    |\n| Src |                      | R1 |\n|     |   Best Effort VC(s)  |    |\n+-----+  <=================> +----+",
      "raw": true
    },
    {
      "indent": 14,
      "text": "       /\\\n       ::                        Data Paths:\n       ::                        ----> Hop-by-hop (routed)\n PATHs and Data                  ====> Short-cut\nFollow Short-cut\n       Path",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Figure 2: Asymmetric RSVP Message Forwarding With ATM Short-Cuts",
      "ja": "図2：ATMショートカット非対称RSVPメッセージ転送"
    },
    {
      "indent": 3,
      "text": "Examination of RSVP shows that the protocol already includes mechanisms that allows support of the asymmetric paths. The mechanism is the same one used to support RESV messages arriving at the wrong router and the wrong interface. RSVP messages are only processed when they arrive at the proper interface. When messages arrive on the wrong interface, they are forwarded by RSVP. The proper interface is indicated in the NHOP object of the message. So, existing RSVP mechanisms will support the asymmetric paths that can occur when using short-cuts.",
      "ja": "RSVPの検査は、プロトコルが既に非対称経路のサポートを可能にする機構を含むことを示しています。メカニズムは間違っルータと誤ったインターフェイスに到着RESVメッセージをサポートするために使用されるのと同じものです。彼らは適切なインターフェイスに到着したときRSVPメッセージにのみ処理されます。メッセージは間違ったインターフェイスに到着すると、彼らはRSVPによって転送されます。適切なインターフェイスは、メッセージのNHOPオブジェクト内に示されています。したがって、既存のRSVPメカニズムがショートカットを使用する場合に発生する可能性が非対称パスをサポートします。"
    },
    {
      "indent": 3,
      "text": "The short-cut model of VC establishment still poses several issues when running with RSVP. The major issues are dealing with established best effort short-cuts, when to establish short-cuts, and QoS only short-cuts. These issues will need to be addressed by RSVP implementations.",
      "ja": "RSVPを実行する際にVC確立の短いカットモデルは、まだいくつかの問題を提起します。主要な問題は、唯一のショートカットショートカット、およびQoSを確立する際に、設立ベストエフォートのショートカットを扱っています。これらの問題は、RSVPの実装によって対処する必要があります。"
    },
    {
      "indent": 3,
      "text": "The key issue to be addressed by RSVP over ATM implementations is when to establish a short-cut for a QoS data flow. RSVP over ATM implementations SHOULD simply follow best effort traffic. When a short-cut has been established for best effort traffic to a destination or next-hop, that same end-point SHOULD be used when setting up RSVP triggered VCs for QoS traffic to the same destination or next-hop. This will happen naturally when PATH messages are forwarded over the best effort short-cut. Note that in this approach, when best effort short-cuts are never established, RSVP triggered QoS short-cuts will also never be established.",
      "ja": "QoSデータフローのためのショートカットを確立する際にRSVP over ATM実装によって対処すべき重要な問題があります。 RSVP over ATM実装は、単純にベストエフォートトラフィックに従ってください。ショートカットは、RSVPを設定するときに同じエンドポイントを使用することを、目的地へのベストエフォートトラフィックまたはネクストホップのために確立された場合には、同じ宛先またはネクストホップへのQoSトラフィックのためのVCを引き起こしました。 PATHメッセージはベストエフォートのショートカットを介して転送されているとき、これは自然に起こります。ベストエフォートショートカットが確立されることはありません、このアプローチで、RSVPはショートカットも確立されることはありませんQoSをトリガーすることに注意してください。"
    },
    {
      "indent": 0,
      "text": "2.4 Data VC Management for Heterogeneous Sessions",
      "section_title": true,
      "ja": "ヘテロジニアスセッションの2.4データVCの管理"
    },
    {
      "indent": 3,
      "text": "Heterogeneous sessions can only occur with multicast RSVP sessions. The issues relating to data VC management of heterogeneous sessions are covered in detail in [6] and are not repeated in this document. In summary, heterogeneity occurs when receivers request different levels of QoS within a single session and also when some receivers do not request any QoS. Both types of heterogeneity are shown in figure 3.",
      "ja": "異機種混在のセッションにのみマルチキャストRSVPセッションで発生する可能性があります。異種セッションのデータVCの管理に関連する問題は、[6]で詳しく説明されており、この文書では繰り返しません。受信機は、単一のセッション内でのQoSの異なるレベルを要求したときにも、いくつかの受信機が任意のQoSを要求しないとき要約すると、不均一が発生します。異質の両方のタイプは、図3に示されています。"
    },
    {
      "indent": 14,
      "text": "                      +----+\n             +------> | R1 |\n             |        +----+\n             |\n             |        +----+\n+-----+ -----+   +--> | R2 |\n|     | ---------+    +----+        Receiver Request Types:\n| Src |                             ---->  QoS 1 and QoS 2\n|     | .........+    +----+        ....>  Best-Effort\n+-----+ .....+   +..> | R3 |\n             :        +----+\n         /\\  :\n         ||  :        +----+\n         ||  +......> | R4 |\n         ||           +----+\n       Single\n    IP Mulicast\n       Group",
      "raw": true
    },
    {
      "indent": 20,
      "text": "Figure 3: Types of Multicast Receivers",
      "ja": "図3：マルチキャストレシーバの種類"
    },
    {
      "indent": 3,
      "text": "[6] provides four models for dealing with heterogeneity: full heterogeneity, limited heterogeneity, homogeneous, and modified homogeneous models. The key issue to be addressed by an implementation is providing requested QoS downstream. One of, or some combination of, the discussed models [6] may be used to provide the requested QoS. Unfortunately, none of the described models is the right answer for all cases. For some networks, e.g. public WANs, it is likely that the limited heterogeneous model or a hybrid limited-full heterogeneous model will be desired. In other networks, e.g. LANs, it is likely that a the modified homogeneous model will be desired.",
      "ja": "完全な不均一、限られた不均一、均質で、そして修飾均質モデル：[6]不均一性に対処するための4つのモデルを提供します。実装によって対処すべき重要な問題は、下流要求されたQoSを提供しています。一つ、またはいくつかの組合せ、議論モデル[6]は要求されたQoSを提供するために使用されてもよいです。残念ながら、説明したモデルはいずれも、すべてのケースのために正しい答えではありません。一部のネットワークでは、例えば公共のWAN、限られた異種のモデルやハイブリッド限定フル異質モデルを希望される可能性があります。他のネットワークでは、例えばLANに、修正均質モデルが希望される可能性があります。"
    },
    {
      "indent": 3,
      "text": "Since there is not one model that satisfies all cases, implementations SHOULD implement one of either the limited heterogeneity model or the modified homogeneous model. Implementations SHOULD support both approaches and provide the ability to select which method is actually used, but are not required to do so.",
      "ja": "すべてのケースを満たす一つのモデルが存在しないので、実装は、限られた異質モデルまたは修飾均質モデルのいずれかのいずれかを実装する必要があります。実装は両方のアプローチをサポートし、実際に使用されていますが、その必要はありませんどの方法を選択する機能を提供すべきです。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The same considerations stated in [4] and [8] apply to this document. There are no additional security issues raised in this document.",
      "ja": "で述べた同じ考慮事項が[4]、[8]この文書に適用されます。この文書で提起さ​​れた追加のセキュリティ上の問題はありません。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgments",
      "section_title": true,
      "ja": "4.謝辞"
    },
    {
      "indent": 3,
      "text": "This work is based on earlier drafts and comments from the ISSLL working group. The author would like to acknowledge their contribution, most notably Steve Berson who coauthored one of the drafts.",
      "ja": "この作品は、以前のドラフトとISSLLワーキンググループからのコメントに基づいています。作者は彼らの貢献、ドラフトの1を共著最も顕著なのスティーブ・ベルソンを確認したいと思います。"
    },
    {
      "indent": 0,
      "text": "5. Author's Address",
      "section_title": true,
      "ja": "5.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Lou Berger FORE Systems 1595 Spring Hill Road 5th Floor Vienna, VA 22182",
      "ja": "ルー・バーガーFOREシステムズ1595スプリングヒルロード5階ウィーン、VA 22182"
    },
    {
      "indent": 3,
      "text": "Phone: +1 703-245-4527 EMail: lberger@fore.com",
      "ja": "電話：+1 703-245-4527電子メール：lberger@fore.com"
    },
    {
      "indent": 0,
      "text": "REFERENCES",
      "ja": "REFERENCES"
    },
    {
      "indent": 3,
      "text": "[1] The ATM Forum, \"MPOA Baseline Version 1\", May 1997.",
      "ja": "[1] ATMフォーラム、 \"MPOAベースラインバージョン1\"、1997年5月。"
    },
    {
      "indent": 3,
      "text": "[2] Berger, L., \"RSVP over ATM Implementation Requirements\", RFC 2380, August 1998.",
      "ja": "[2]バーガー、L.、RFC 2380、1998年8月 \"ATM実装要件の上にRSVPを\"。"
    },
    {
      "indent": 3,
      "text": "[3] Borden, M., and M. Garrett, \"Interoperation of Controlled-Load and Guaranteed-Service with ATM\", RFC 2381, August 1998.",
      "ja": "[3]ボーデン、M.、およびM.ギャレット、 \"制御・ロードの相互運用およびATMでの保証・サービス\"、RFC 2381、1998年8月。"
    },
    {
      "indent": 3,
      "text": "[4] Braden, R., Zhang, L., Berson, S., Herzog, S., and S. Jamin, \"Resource ReSerVation Protocol (RSVP) -- Version 1 Functional Specification\", RFC 2205, September 1997.",
      "ja": "[4]ブレーデン、R.、チャン、L.、Berson氏、S.、ハーツォグ、S.、およびS.ヤミン、 \"リソース予約プロトコル（RSVP） - バージョン1機能仕様\"、RFC 2205、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[5] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[5]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[6] Crawley, E., Berger, L., Berson, S., Baker, F., Borden, M., and J. Krawczyk, \"A Framework for Integrated Services and RSVP over ATM\", RFC 2382, August 1998.",
      "ja": "[6]クローリー、E.、バーガー、L.、Berson氏、S.、ベイカー、F.、ボーデン、M.、およびJ. Krawczyk、 \"統合サービスのためのフレームワークおよびATM上でRSVP\"、RFC 2382、1998年8月。"
    },
    {
      "indent": 3,
      "text": "[7] Luciani, J., Katz, D., Piscitello, D., and B. Cole, \"NBMA Next Hop Resolution Protocol (NHRP)\", RFC 2332, April 1998.",
      "ja": "[7]ルチアーニ、J.、カッツ、D.、Piscitello、D.、およびB.コール、 \"NBMAネクストホップ解決プロトコル（NHRP）\"、RFC 2332、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[8] Perez, M., Liaw, F., Grossman, D., Mankin, A., Hoffman, E., and A. Malis, \"ATM Signalling Support for IP over ATM\", RFC 1755, February 1995.",
      "ja": "[8]ペレス、M.、Liaw、F.、グロスマン、D.、マンキン、A.、ホフマン、E.、およびA. Malis、 \"ATMオーバーIP用のATMシグナリングサポート\"、RFC 1755、1995年2月。"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}