{
  "title": {
    "text": "RFC 2563 - DHCP Option to Disable Stateless Auto-Configuration in IPv4 Clients",
    "ja": "RFC 2563 - DHCPオプションは、IPv4クライアントでステートレス自動設定を無効にします"
  },
  "number": 2563,
  "created_at": "2019-10-23 11:09:49.740521+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           R. Troll\nRequest for Comments: 2563                                 @Home Network\nCategory: Standards Track                                       May 1999",
      "raw": true
    },
    {
      "indent": 2,
      "text": "DHCP Option to Disable Stateless Auto-Configuration in IPv4 Clients",
      "ja": "DHCPオプションは、IPv4クライアントでステートレス自動設定を無効にします"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Operating Systems are now attempting to support ad-hoc networks of two or more systems, while keeping user configuration at a minimum. To accommodate this, in the absence of a central configuration mechanism (DHCP), some OS's are automatically choosing a link-local IP address which will allow them to communicate only with other hosts on the same link. This address will not allow the OS to communicate with anything beyond a router. However, some sites depend on the fact that a host with no DHCP response will have no IP address. This document describes a mechanism by which DHCP servers are able to tell clients that they do not have an IP address to offer, and that the client should not generate an IP address it's own.",
      "ja": "最低でユーザ設定を維持しながら、オペレーティングシステムは現在、2系統以上のアドホックネットワークをサポートしようとしています。中央構成メカニズム（DHCP）が存在しない場合に、これに対応するために、いくつかのOSが自動的にそれらは、同じリンク上の他のホストと通信できるようになりますリンクローカルIPアドレスを選択しています。このアドレスは、OSがルータを越えたものと通信することはできません。しかし、いくつかのサイトではありませんDHCP応答でホストにはIPアドレスを持っていないという事実に依存しています。この文書では、DHCPサーバは、彼らが提供するIPアドレスを持っていないことをクライアントに伝えることができますするメカニズムを説明し、クライアントはそれ自身のIPアドレスを生成してはならないこと。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "With computers becoming a larger part of everyday life, operating systems must be able to support a larger range of operating environments. One aspect of this support is the selection of an IP address. The Dynamic Host Configuration Protocol [DHCP] provides a superb method by which site administrators may supply IP addresses (and other network parameters) to network devices. However, some operating environments are not centrally maintained, and operating systems must now be able to handle this quickly and easily.",
      "ja": "コンピュータが日常生活の大きな部分になってきてと、オペレーティング・システムは、オペレーティング環境のより広い範囲をサポートすることができなければなりません。このサポートの一の態様は、IPアドレスの選択です。動的ホスト構成プロトコル[DHCP]は、サイト管理者がネットワークデバイスにIPアドレス（およびその他のネットワークパラメータ）を供給する可能性があることにより、優れた方法を提供します。しかし、いくつかの動作環境は、集中管理されていない、およびオペレーティングシステムは現在、迅速かつ容易にこれを処理できなければなりません。"
    },
    {
      "indent": 3,
      "text": "IPv6 accounts for this, and allows an IPv6 stack to assign itself a global address in the absence of any other mechanism for configuration [IPv6SAC]. However, Operating System designers can't wait for IPv6 support everywhere. They need to be able to assume they will have IPv4 addresses, so that they may communicate with one another even in the smallest networks.",
      "ja": "IPv6はこの占め、及びIPv6スタックは[IPv6SAC】構成のための任意の他の機構が存在しない場合にグローバルアドレス自体を割り当てることができます。ただし、オペレーティングシステムの設計者は、どこにでもIPv6サポートを待つことができません。彼らは、彼らも、最小のネットワークで相互に通信できるように、彼らは、IPv4アドレスを持つことになりますと仮定することができるようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "This document looks at three types of network nodes, and how IPv4 address auto-configuration may be disabled on a per-subnet (or even per-node) basis. The three types of network nodes are:",
      "ja": "この文書では、ネットワーク・ノードの三種類を見て、どのようにIPv4のアドレス自動構成ごとのサブネット（あるいは、ノードごとの）ベースで無効にすることができます。ネットワーク・ノードの三種類があります："
    },
    {
      "indent": 3,
      "text": "* A node for which the site administrator will hand out configuration information,",
      "ja": "*サイト管理者が設定情報を配るなるためノード、"
    },
    {
      "indent": 3,
      "text": "* A node on a network segment for which there is no site administrator, and",
      "ja": "*ネットワークセグメント上のノードは、そのためそこには、サイトの管理者ではない、と"
    },
    {
      "indent": 3,
      "text": "* A node on a network segment that has a central site administrator, and that administrator chooses not to hand out any configuration information to the node.",
      "ja": "*中央サイトの管理者であり、その管理者がノードに構成情報を配るしないことを選択したネットワークセグメント上のノード。"
    },
    {
      "indent": 3,
      "text": "The difference between the second and third cases is the clients behavior.",
      "ja": "第二と第三のケースとの間の差は、クライアントの動作です。"
    },
    {
      "indent": 3,
      "text": "In one case, the node may assign itself an IP address, and have full connectivity with other nodes on the local wire. In the last case, the node is not told what to do, and while it may assign itself a network address in the same way as case #2, this may not be what the central administrator wants.",
      "ja": "あるケースでは、ノードは、それ自身のIPアドレスを割り当て、ローカル配線上の他のノードとの完全な接続性を有していてもよいです。最後のケースでは、ノードは、何をすべきかを告げていない、そしてそれはケース＃2と同じように、それ自体にネットワークアドレスを割り当てるかもしれないが、これは、中央管理者が何を望んではないかもしれません。"
    },
    {
      "indent": 3,
      "text": "The first scenario is handled by the current DHCP standard. However, the current DHCP specification [DHCP] says servers must silently ignore requests from hosts they do not know. Because of this, DHCP clients are unable to determine whether they are on a subnet with no administration, or with administration that is choosing not to hand out addresses.",
      "ja": "最初のシナリオは、現在のDHCP標準によって処理されます。しかし、現在のDHCP仕様[DHCP]は、サーバは静かに、彼らは知っていないホストからの要求を無視しなければならないと言います。このため、DHCPクライアントは、投与なし、またはアドレスを配るしないように選択された投与によるサブネット上にあるかどうかを判断することはできません。"
    },
    {
      "indent": 3,
      "text": "This document describes a method by which DHCP clients will be able to determine whether or not the network is being centrally administrated, allowing it to intelligently determine whether or not it should assign itself a \"link-local\" address.",
      "ja": "この文書では、DHCPクライアントは、それがインテリジェントそれ自体が「リンクローカル」アドレスを割り当てる必要があるかどうかを判断することができ、ネットワークは集中管理されているか否かを決定することができるであろうする方法を記載しています。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in the Document",
      "section_title": true,
      "ja": "1.1. ドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [KEYWORDS].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[キーワード]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.2. Terminology",
      "section_title": true,
      "ja": "1.2. 用語"
    },
    {
      "indent": 3,
      "text": "DHCP client A DHCP client is an Internet host using DHCP to obtain configuration parameters such as a network address.",
      "ja": "DHCPクライアントA DHCPクライアントは、ネットワークアドレスなどの設定パラメータを取得するためにDHCPを使用してインターネットホストです。"
    },
    {
      "indent": 3,
      "text": "DHCP server A DHCP server is an Internet host that returns configuration parameters to DHCP clients.",
      "ja": "DHCPサーバDHCPサーバは、DHCPクライアントに設定パラメータを返すインターネットホストです。"
    },
    {
      "indent": 0,
      "text": "2. The Auto-Configure Option",
      "section_title": true,
      "ja": "2.自動configureオプションに"
    },
    {
      "indent": 3,
      "text": "This option code is used to ask whether, and be notified if, auto-configuration should be disabled on the local subnet. The auto-configure option is an 8-bit number.",
      "ja": "このオプションコードは、かどうかを尋ねるために使用され、自動設定がローカルサブネット上で無効にする必要があり、場合に通知します。自動設定オプションは、8ビットの数です。"
    },
    {
      "indent": 7,
      "text": " Code   Len   Value\n+-----+-----+-----+\n| 116 |  1  |  a  |\n+-----+-----+-----+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The code for this option is 116, and its length is 1.",
      "ja": "このオプションのためのコードは116であり、その長さは1です。"
    },
    {
      "indent": 3,
      "text": "This code, along with the IP address assignment, will allow a DHCP client to determine whether or not it should generate a link-local IP address.",
      "ja": "このコードは、IPアドレスの割り当てとともに、DHCPクライアントは、それがリンクローカルIPアドレスを生成する必要があるかどうかを決定することができます。"
    },
    {
      "indent": 0,
      "text": "2.1. Auto-Configure Values",
      "section_title": true,
      "ja": "2.1. 自動設定値"
    },
    {
      "indent": 3,
      "text": "The auto-configure option uses the following values:",
      "ja": "自動設定オプションは、次の値を使用します。"
    },
    {
      "indent": 12,
      "text": "DoNotAutoConfigure     0\nAutoConfigure          1",
      "raw": true
    },
    {
      "indent": 3,
      "text": "When a server responds with the value \"AutoConfigure\", the client MAY generate a link-local IP address if appropriate. However, if the server responds with \"DoNotAutoConfigure\", the client MUST NOT generate a link-local IP address, possibly leaving it with no IP address.",
      "ja": "サーバは値「AUTOCONFIGURE」と応答すると、適切な場合、クライアントはリンクローカルIPアドレスを生成してもよいです。サーバは「DoNotAutoConfigure」で応答した場合ただし、クライアントはおそらくいないIPアドレスでそれを残して、リンクローカルIPアドレスを生成してはなりません。"
    },
    {
      "indent": 0,
      "text": "2.2. DHCP Client Behavior",
      "section_title": true,
      "ja": "2.2.  DHCPクライアントの動作"
    },
    {
      "indent": 3,
      "text": "Clients that have auto-configuration capabilities MUST add the Auto-Configure option to the list of options included in its initial DHCPDISCOVER message. ([DHCP] Section 4.4.1) At this time, the option's value should be set to \"AutoConfigure\".",
      "ja": "自動構成機能を持っているクライアントは、その初期のDHCPDISCOVERメッセージに含まれるオプションのリストに自動設定オプションを追加する必要があります。 （[DHCP]セクション4.4.1）この時点では、オプションの値は、「AUTOCONFIGURE」に設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "When a DHCPOFFER is received, it is handled as described in [DHCP], section 4.4.1, with one exception. If the 'yiaddr' field is 0x00000000, the Auto-Configure option must be consulted. If this option is set to \"AutoConfigure\", then the DHCPOFFER MUST be ignored, and the DHCP client MAY generate a link-local IP address. However, if this option is set to \"DoNotAutoConfigure\", then the DHCPOFFER MUST be ignored, and the client MUST NOT generate a link-local IP address.",
      "ja": "DHCPOFFERを受信したときに1つの例外を除いて、[DHCP]、セクション4.4.1で説明したように、それが処理されます。 「yiaddr」フィールドが0x00000000の場合には、自動設定オプションが相談する必要があります。このオプションは、「自動設定する」に設定されている場合、DHCPOFFERを無視しなければなりませんし、DHCPクライアントがリンクローカルIPアドレスを生成してもよいです。このオプションは、「DoNotAutoConfigure」に設定されている場合は、その後、DHCPOFFERを無視しなければなりません、そして、クライアントはリンクローカルIPアドレスを生成してはなりません。"
    },
    {
      "indent": 3,
      "text": "If a DHCP client receives any DHCPOFFER which contains a 'yiaddr' of 0x00000000, and the Auto-Configure flag says \"DoNotAutoConfigure\", in the absence of a DHCPOFFER with a valid 'yiaddr', the DHCP client MUST NOT generate a link-local IP address. The amount of time a DHCP client waits to collect any other DHCPOFFERs is implementation dependant.",
      "ja": "DHCPクライアントは0x00000000のの「yiaddr」を含むすべてのDHCPOFFERを受信し、自動設定フラグが有効な「yiaddr」はDHCPOFFERが存在しない場合に、「DoNotAutoConfigure」と言う場合は、DHCPクライアントはリンクローカルを生成してはなりませんIPアドレス。 DHCPクライアントは、他のDHCPOFFERsを収集するために待機する時間は実装依存です。"
    },
    {
      "indent": 3,
      "text": "DHCPOFFERs with a 'yiaddr' of 0x00000000 will only be sent by DHCP servers supporting the Auto-Configure option when the DHCPDISCOVER contained the Auto-Configure option. Since the DHCPDISCOVER will only contain the Auto-Configure option when a DHCP client knows how to handle it, there will be no inter-operability problems.",
      "ja": "0x00000000のの「yiaddr」がDHCPOFFERsはDHCPDISCOVERが自動設定オプションが含まれて自動設定オプションをサポートしているDHCPサーバによって送信されます。 DHCPクライアントはそれを処理する方法を知っているときDHCPDISCOVERのみ自動設定オプションが含まれていますので、何の相互運用性の問題は存在しません。"
    },
    {
      "indent": 3,
      "text": "If the DHCP server does have an address to offer, the message states are the same as those described in [DHCP], section 3.",
      "ja": "DHCPサーバが提供するアドレスを持っていない場合は、メッセージの状態が[DHCP]に記載されたものと同じであり、セクション3。"
    },
    {
      "indent": 3,
      "text": "The following depicts the difference in responses for non-registered DHCP clients that support the \"Auto-Configure\" option on networks that have DHCP servers that support auto-configuration and networks with DHCP servers that do not.",
      "ja": "以下はないDHCPサーバで自動設定とネットワークをサポートDHCPサーバーがあるネットワーク上の「自動設定」オプションをサポートして非登録DHCPクライアントの応答の違いを示しています。"
    },
    {
      "indent": 18,
      "text": "      Network         Client          Network\n(no auto-configure)               (auto-configure)",
      "raw": true
    },
    {
      "indent": 21,
      "text": "     v               v               v\n     |               |               |\n     |     Begins initialization     |\n     |               |               |\n     | _____________/|\\____________  |\n     |/DHCPDISCOVER  | DHCPDISCOVER \\|\n     |               |               |\n Determines          |          Determines\nconfiguration        |         configuration\n     |               |               |\n     |               |  ____________/|\n     |               | /DHCPOFFER    |\n     |               |/              |\n     |               |               |\n     |       Collects replies        |\n     |               |               |\n     |     Selects configuration     |\n     |               |               |\n     |--AutoConfigs--|- NO IP ADDR --|\n     .               .               .\n     .               .               .\n     |               |               |\n     |      Graceful shutdown        |\n     |               |               |\n     |               |               |\n     v               v               v",
      "raw": true
    },
    {
      "indent": 0,
      "text": "2.3. DHCP Server Behavior",
      "section_title": true,
      "ja": "2.3.  DHCPサーバーの動作"
    },
    {
      "indent": 3,
      "text": "When a DHCP server receives a DHCPDISCOVER, it MUST be processed as described in [DHCP], section 4.3.1. However, if no address is chosen for the host, a few additional steps MUST be taken.",
      "ja": "DHCPサーバは、DHCPDISCOVERを受信した場合[DHCP]に記載されているように、それを処理しなければなりません、セクション4.3.1。何のアドレスがホスト用に選択されていない場合は、いくつかの追加の手順がとられなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the DHCPDISCOVER does not contain the Auto-Configure option, it is not answered.",
      "ja": "DHCPDISCOVERが自動設定オプションが含まれていない場合は、それが答えていません。"
    },
    {
      "indent": 3,
      "text": "If the DHCPDISCOVER contains the Auto-Configure option, and the site administrator has specified that Auto-Configuration should be disabled on the subnet the DHCPDISCOVER is originating from, or for the client originating the request, then a DHCPOFFER MUST be sent to the DHCP client. This offer MUST be for the address 0x00000000, and the Auto-Configure option MUST be set to \"DoNotAutoConfigure\".",
      "ja": "DHCPDISCOVERは自動設定オプションが含まれており、サイト管理者は、自動設定がDHCPDISCOVERから発信されたサブネット上で無効にされるべきであると指定している、または要求元のクライアントのために、その後、DHCPOFFERがDHCPクライアントに送信する必要がある場合。このオファーは、アドレス0x00000000のためでなければならない、と自動設定オプションは、「DoNotAutoConfigure」に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the site administrator allows auto-configuration on the originating subnet, the DHCPDISCOVER is not answered as before.",
      "ja": "サイト管理者は、元のサブネット上の自動設定を可能にした場合、DHCPDISCOVERは、以前のように答えていません。"
    },
    {
      "indent": 0,
      "text": "2.4. Mixed Environments",
      "section_title": true,
      "ja": "2.4. 混在環境"
    },
    {
      "indent": 3,
      "text": "Environments containing a mixture of clients and servers that do and do not support the Auto-Configure option will not be a problem. Every DHCP transaction is between a Server and a Client, and the possible mixed scenarios between these two are listed below.",
      "ja": "やると問題になることはありません自動設定オプションをサポートしていないクライアントとサーバの混合物を含む環境。すべてのDHCPトランザクションは、サーバーとクライアントの間で、これら二つの間の可能な混合のシナリオは以下のとおりです。"
    },
    {
      "indent": 0,
      "text": "2.4.1. Client Supports, Server Does Not",
      "section_title": true,
      "ja": "2.4.1. クライアントは、サーバーはしない、サポート"
    },
    {
      "indent": 3,
      "text": "If a DHCP client sends a request that contains the Auto-Configure tag, a DHCP server that does not know what this tag is will respond normally. According to [DHCP] Section 4.3.1, the server MUST NOT return a value for that parameter.",
      "ja": "DHCPクライアントが自動設定タグを含むリクエストを送信する場合は、このタグが何であるかを知らないDHCPサーバーが正常に応答します。 [DHCP]セクション4.3.1によると、サーバはそのパラメータの値を返してはなりません。"
    },
    {
      "indent": 3,
      "text": "In this case, the server will either respond with a valid DHCPOFFER, or it will not respond at all. In both cases, a DHCP client that supports this option will never care what the state of the option is, and may auto-configure.",
      "ja": "この場合、サーバーは有効なDHCPOFFERで応答するか、またはそれは全く反応しません。どちらの場合も、このオプションをサポートしているDHCPクライアントは、オプションの状態であり、自動設定することも気にすることはありません。"
    },
    {
      "indent": 0,
      "text": "2.4.2. Servers Supports, Client Does Not",
      "section_title": true,
      "ja": "2.4.2. サーバはクライアントがいない、サポート"
    },
    {
      "indent": 3,
      "text": "If the Auto-Configure option is not present in the DHCPDISCOVER, the server will do nothing about it. The client will auto-configure if it doesn't receive a response and believes that's what it should do.",
      "ja": "自動設定オプションがDHCPDISCOVERに存在しない場合、サーバはそれについて何もしません。それが応答を受信し、それはそれが何をすべきかだと考えていない場合、クライアントは、自動設定されます。"
    },
    {
      "indent": 3,
      "text": "This scenario SHOULD not occur, as any stacks that implement an auto-configuration mechanism MUST implement this option as well.",
      "ja": "自動設定メカニズムを実装する任意のスタックは、同様にこのオプションを実装しなければならないとして、このシナリオでは、発生しません。"
    },
    {
      "indent": 0,
      "text": "2.5. Interaction With Other DHCP Messages",
      "section_title": true,
      "ja": "2.5. その他のDHCPメッセージとの対話"
    },
    {
      "indent": 3,
      "text": "As this option only affects the initial IP address selection, it does not apply to subsequent DHCP messages. If the DHCP client received a lease from a DHCP server, future DHCP messages (RENEW, INFORM, ACK, etc.) have no need to fall over into an auto- configuration state.",
      "ja": "このオプションは、最初のIPアドレスの選択に影響を与えるとして、それ以降のDHCPメッセージには適用されません。 DHCPクライアントがDHCPサーバーからリースを受け取った場合は、将来のDHCPメッセージは、（など、ACK、INFORM、RENEW）自動設定状態に倒れるする必要がありません。"
    },
    {
      "indent": 3,
      "text": "If the DHCP client's lease expires, the client falls back into the INIT state, and the initial DHCPDISCOVER is sent as before.",
      "ja": "DHCPクライアントのリースの期限が切れた場合、クライアントはバックINIT状態に陥ると、初期のDHCPDISCOVERは、以前のように送信されます。"
    },
    {
      "indent": 0,
      "text": "2.5.1. DHCPRELEASE Messages",
      "section_title": true,
      "ja": "2.5.1.  DHCPRELEASEメッセージ"
    },
    {
      "indent": 3,
      "text": "DHCPRELEASEs occur exactly as described in [DHCP], section 4.4.6. When a DHCP client is done with a lease, it MAY notify the server that it is finished. For this to occur, the DHCP client already received a DHCP lease, and the state of Auto-Configuration on the local wire does not matter.",
      "ja": "DHCPRELEASEsは、[DHCP]に記載のとおりにセクション4.4.6を生じます。 DHCPクライアントがリースで行われた場合、それが終了すると、サーバーに通知してもよいです。そのためには、DHCPクライアントがすでにDHCPリースを受け、地元のワイヤ上の自動設定の状態は関係ありません。"
    },
    {
      "indent": 0,
      "text": "2.5.2. DHCPDECLINE Messages",
      "section_title": true,
      "ja": "2.5.2.  DHCPDECLINEメッセージ"
    },
    {
      "indent": 3,
      "text": "A DHCPDECLINE is sent by the DHCP client when it determines the network address it is attempting to use is already in use. As a network address has been tested, it must have been offered by the DHCP Server, and the state of Auto-Configuration on the local wire does not matter.",
      "ja": "それは、使用しようとしているネットワークアドレスがすでに使用中であると判断したときにDHCPDECLINEは、DHCPクライアントによって送信されます。ネットワークアドレスがテストされたように、それは、DHCPサーバーによって提供されている必要があります。また、ローカル線の自動設定の状態は関係ありません。"
    },
    {
      "indent": 0,
      "text": "2.5.3. DHCPINFORM Messages",
      "section_title": true,
      "ja": "2.5.3.  DHCPINFORMメッセージ"
    },
    {
      "indent": 3,
      "text": "DHCPINFORMs should be handled as described in [DHCP], section 4.4.3. No changes are necessary.",
      "ja": "[DHCP]に記載されているようにDHCPINFORMsは、セクション4.4.3、取り扱われるべきです。変更する必要はありません。"
    },
    {
      "indent": 0,
      "text": "2.6. Message Option",
      "section_title": true,
      "ja": "2.6. メッセージオプション"
    },
    {
      "indent": 3,
      "text": "If the DHCP server would like to tell a client why it is not allowed to auto-configure, it MAY add the Message option to the response. This option is defined in [DHCPOPT], Section 9.9.",
      "ja": "それは自動設定に許可されていない理由をDHCPサーバがクライアントに通知したい場合、それはレスポンスへのメッセージオプションを追加するかもしれません。このオプションは、[DHCPOPT]、セクション9.9で定義されています。"
    },
    {
      "indent": 3,
      "text": "If the DHCP client receives a response with the Message option set, it MUST provide this information to the administrator of the DHCP client. How this information is provided is implementation dependant.",
      "ja": "DHCPクライアントは、メッセージオプションが設定されたレスポンスを受信した場合、DHCPクライアントの管理者にこの情報を提供しなければなりません。どのようにこの情報が提供されることは実装依存です。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "DHCP per se currently provides no authentication or security mechanisms. Potential exposures to attack are discussed in section 7 of the DHCP protocol specification [DHCP].",
      "ja": "DHCP自体には現在、認証やセキュリティメカニズムを提供していません。攻撃に対する潜在的なエクスポージャーは、DHCPプロトコル仕様[DHCP]のセクション7に記載されています。"
    },
    {
      "indent": 3,
      "text": "This mechanism does add one other potential attack. Malicious users on a subnet may respond to all DHCP requests with responses telling DHCP clients that they should NOT auto-configure on the local wire. On a network where Auto-Configuration is required, this will cause all DHCP clients to not choose an address.",
      "ja": "このメカニズムは、一つの他の潜在的な攻撃を追加しません。サブネット上の悪意のあるユーザーはローカル線で自動設定すべきではありませんDHCPクライアントを伝える応答を持つすべてのDHCP要求に応答することができます。自動設定が必要とされているネットワークでは、これはすべてのDHCPクライアントがアドレスを選択しないようになります。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgments",
      "section_title": true,
      "ja": "4.謝辞"
    },
    {
      "indent": 3,
      "text": "This idea started at a joint Common Solutions Group / Microsoft meeting at Microsoft in May, 1998. The IP stacks in Win98 and NT5 assign themselves an IP address (in a specific subnet) in the absence of a responding DHCP server, and this is causing headaches for many sites that actually rely on machines not getting IP addresses when the DHCP servers do not know them.",
      "ja": "このアイデアは、IPが応答DHCPサーバが存在しない場合には、それ自体が（特定のサブネット内の）IPアドレスを割り当てWin98のとNT5にスタック、およびこれが原因となっている1998年、月にMicrosoftの共同共通ソリューショングループ/マイクロソフトの会議で開始しましたDHCPサーバがそれらを知っていないときに実際にIPアドレスを取得していないマシンに依存している多くのサイトのための頭痛の種。"
    },
    {
      "indent": 3,
      "text": "Walter Wong proposed a solution that would allow the DHCP servers to tell clients not to do this. His initial solution would not work without slight modifications to DHCP itself. This document describes those modifications.",
      "ja": "ウォルター・ウォンは、DHCPサーバがこれを実行しないようにクライアントに指示することが可能になる解決策を提案しました。彼の最初のソリューションは、自分自身をDHCPに若干の修正なしに動作しないでしょう。この文書では、これらの変更について説明します。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IANA has assigned option number 116 for this option.",
      "ja": "IANAは、このオプションのオプション番号116を割り当てています。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 3,
      "text": "[DHCP] Droms, R., \"Dynamic Host Configuration Protocol\", RFC 2131, March 1997.",
      "ja": "[DHCP] Droms、R.、 \"動的ホスト構成プロトコル\"、RFC 2131、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[DHCPOPT] Alexander, S. and R. Droms, \"DHCP Options and BOOTP Vendor Extension\", RFC 2132, March 1997.",
      "ja": "[DHCPOPT]アレクサンダー、S.とR. Droms、 \"DHCPオプションとBOOTPベンダー拡張\"、RFC 2132、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[IPv6SAC] Thomson, S. and T. Narten, \"IPv6 Stateless Address Autoconfiguration\", RFC 2462, December 1998.",
      "ja": "[IPv6SAC]トムソン、S.とT. Narten氏、 \"IPv6のステートレスアドレス自動設定\"、RFC 2462、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[KEYWORDS] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[キーワード]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "7. Author's Address",
      "section_title": true,
      "ja": "7.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ryan Troll @Home Network 425 Broadway Redwood City, CA 94063",
      "ja": "ライアントロール@Homeネットワーク425ブロードウェイレッドウッドシティ、CA 94063"
    },
    {
      "indent": 3,
      "text": "Phone: (650) 556-6031 EMail: rtroll@corp.home.net",
      "ja": "電話：（650）556-6031 Eメール：rtroll@corp.home.net"
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}