{
  "title": {
    "text": "RFC 2780 - IANA Allocation Guidelines For Values In the Internet Protocol and Related Headers",
    "ja": "RFC 2780 - インターネットプロトコルおよび関連するヘッダーの値のIANA割り当てガイドライン"
  },
  "number": 2780,
  "created_at": "2024-01-29 07:17:22.770105+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         S. Bradner\nRequest for Comments: 2780                            Harvard University\nBCP: 37                                                        V. Paxson\nCategory: Best Current Practice                                    ACIRI\n                                                              March 2000",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": " IANA Allocation Guidelines For Values In the Internet Protocol and Related Headers",
      "ja": "インターネットプロトコルおよび関連するヘッダーの値のIANA割り当てガイドライン"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネットの最良のプラクティスを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo provides guidance for the IANA to use in assigning parameters for fields in the IPv4, IPv6, ICMP, UDP and TCP protocol headers.",
      "ja": "このメモは、IANAがIPv4、IPv6、ICMP、UDP、およびTCPプロトコルヘッダーのフィールドのパラメーターを割り当てる際に使用するためのガイダンスを提供します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "For many years the Internet Assigned Numbers Authority (IANA) (www.iana.org) has allocated parameter values for fields in protocols which have been created or are maintained by the Internet Engineering Task Force (IETF). Starting a few years ago the IETF began to provide the IANA with guidance for the assignment of parameters for fields in newly developed protocols. Unfortunately this type of guidance was not consistently provided for the fields in protocols developed before 1998. This memo attempts to codify existing IANA practice used in the assignment of parameters in the specific case of some of these protocols. It is expected that additional memos will be developed in the future to codify existing practice in other cases.",
      "ja": "インターネットは長年にわたって、番号を割り当てられた番号（IANA）（www.iana.org）が、インターネットエンジニアリングタスクフォース（IETF）によって作成または維持されているプロトコルのフィールドのパラメーター値を割り当ててきました。数年前、IETFは、新しく開発されたプロトコル内のフィールドのパラメーターの割り当てのガイダンスをIANAに提供し始めました。残念ながら、このタイプのガイダンスは、1998年以前に開発されたプロトコルのフィールドに一貫して提供されていません。このメモは、これらのプロトコルの特定のケースでパラメーターの割り当てで使用される既存のIANAプラクティスを成文化しようとします。他のケースで既存の慣行を成文化するために、追加のメモが将来開発されることが期待されています。"
    },
    {
      "indent": 3,
      "text": "This memo addresses the fields within the IPv4, IPv6, ICMP, UDP and TCP protocol headers for which the IANA assigns values.",
      "ja": "このメモは、IANAが値を割り当てるIPv4、IPv6、ICMP、UDP、およびTCPプロトコルヘッダー内のフィールドに対応しています。"
    },
    {
      "indent": 3,
      "text": "The terms \"Specification Required\", \"Expert Review\", \"IESG Approval\", \"IETF Consensus\", and \"Standards Action\", are used in this memo to refer to the processes described in [CONS].",
      "ja": "「必要な仕様」、「専門家のレビュー」、「IESG承認」、「IETFコンセンサス」、および「標準アクション」という用語は、[Cons]で説明されているプロセスを参照するためにこのメモで使用されます。"
    },
    {
      "indent": 0,
      "text": "2. Temporary Assignments",
      "section_title": true,
      "ja": "2. 一時的な割り当て"
    },
    {
      "indent": 3,
      "text": "From time to time temporary assignments are made in the values for fields in these headers for use in experiments. IESG Approval is required for any such temporary assignments.",
      "ja": "実験で使用するために、これらのヘッダーのフィールドの値に一時的な割り当てが行われます。このような一時的な割り当てには、IESGの承認が必要です。"
    },
    {
      "indent": 0,
      "text": "3. Version field in the IP header.",
      "ja": "3. IPヘッダーのバージョンフィールド。"
    },
    {
      "indent": 3,
      "text": "The first field in the IP header of all current versions of IP is the Version field. New values in the Version field define new versions of the IP protocol and are allocated only after an IETF Standards Action. It should be noted that some of the Version number bits are used by TCP/IP header compression schemes. Specifically, the hi-order bit of the Version field is also used by TCP/IP header compression [HC], while the three hi-order bits are used by IP Header Compression [IPHC].",
      "ja": "IPのすべてのバージョンのIPヘッダーの最初のフィールドは、バージョンフィールドです。バージョンフィールドの新しい値は、IPプロトコルの新しいバージョンを定義し、IETF標準アクションの後にのみ割り当てられます。バージョン番号ビットの一部は、TCP/IPヘッダー圧縮スキームで使用されていることに注意してください。具体的には、バージョンフィールドの高温ビットはTCP/IPヘッダー圧縮[HC]でも使用され、3つの高次ビットはIPヘッダー圧縮[IPHC]で使用されます。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations for fields in the IPv4 header",
      "section_title": true,
      "ja": "4. IPv4ヘッダーのフィールドに関するIANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IPv4 header [V4] contains the following fields that carry values assigned by the IANA: Version, Type of Service, Protocol, Source Address, Destination Address, and Option Type.",
      "ja": "IPv4ヘッダー[V4]には、IANAによって割り当てられた値を伝える次のフィールドが含まれています：バージョン、サービスの種類、プロトコル、ソースアドレス、宛先アドレス、およびオプションタイプ。"
    },
    {
      "indent": 0,
      "text": "4.1 IPv4 IP Version field",
      "section_title": true,
      "ja": "4.1 IPv4 IPバージョンフィールド"
    },
    {
      "indent": 3,
      "text": "The IPv4 Version field is always 4.",
      "ja": "IPv4バージョンフィールドは常に4です。"
    },
    {
      "indent": 0,
      "text": "4.2 IPv4 Type of Service field",
      "section_title": true,
      "ja": "4.2 IPv4サービスフィールドのタイプ"
    },
    {
      "indent": 3,
      "text": "The Type of Service field described in [V4] has been superseded[DIFF] by the 6-bit Differentiated Services (DS) field and a 2-bit field which is currently reserved. The IANA allocates values in the DS field following the IANA Considerations section in [DIFF]. [ECN] describes an experimental use of the 2-bit \"currently unused\" field. Other experimental uses of this field may be assigned after IESG Approval processes. Permanent values in this field are allocated following a Standards Action process.",
      "ja": "[V4]で説明されているサービスフィールドのタイプは、6ビットの差別化されたサービス（DS）フィールドと現在予約されている2ビットフィールドによって引き継がれています。IANAは、[DIFF]のIANA考慮事項セクションに従って、DSフィールドに値を割り当てます。[ECN]は、2ビットの「現在使用されていない」フィールドの実験的使用について説明しています。このフィールドの他の実験的使用は、IESG承認プロセスの後に割り当てられる場合があります。この分野の永続的な値は、標準のアクションプロセスに従って割り当てられます。"
    },
    {
      "indent": 0,
      "text": "4.3 IPv4 Protocol field",
      "section_title": true,
      "ja": "4.3 IPv4プロトコルフィールド"
    },
    {
      "indent": 3,
      "text": "IANA allocates values from the IPv4 Protocol name space following an Expert Review, IESG Approval or Standards Action process. The Expert Review process should only be used in those special cases where non-disclosure information is involved. In these cases the expert(s) should be designated by the IESG.",
      "ja": "IANAは、専門家のレビュー、IESG承認、または標準アクションプロセスに続いて、IPv4プロトコル名スペースから値を割り当てます。専門家のレビュープロセスは、非開示情報が関与している特別な場合にのみ使用する必要があります。これらの場合、専門家はIESGによって指定されるべきです。"
    },
    {
      "indent": 0,
      "text": "4.4 IPv4 Source and Destination addresses",
      "section_title": true,
      "ja": "4.4 IPv4ソースおよび宛先アドレス"
    },
    {
      "indent": 3,
      "text": "The IPv4 source and destination addresses use the same namespace but do not necessarily use the same values. Values in these fields fall into a number of ranges defined in [V4] and [MULT].",
      "ja": "IPv4ソースと宛先アドレスは同じ名前空間を使用しますが、必ずしも同じ値を使用するわけではありません。これらのフィールドの値は、[V4]および[Mult]で定義された多くの範囲に分類されます。"
    },
    {
      "indent": 0,
      "text": "4.4.1 IPv4 Unicast addresses",
      "section_title": true,
      "ja": "4.4.1 IPv4ユニキャストアドレス"
    },
    {
      "indent": 3,
      "text": "The Internet Corporation for Assigned Names and Numbers (ICANN) recently accepted responsibility for the formulation of specific guidelines for the allocation of the values from the IPv4 unicast address space (values 0.0.0.0 through 223.255.255.255 ) other than values from the ranges 0/8 (which was reserved in [AN80]) and 127/8 (from which the loopback address has been taken) along with other values already assigned by the IETF for special functions or purposes. (For example, the private addresses defined in RFC 1918.) Further assignments in the 0/8 and 127/8 ranges require a Standards Action process since current IP implementations may break if this is done.",
      "ja": "割り当てられた名前と数字（ICANN）のインターネットコーポレーションは、範囲0/の値以外のIPv4ユニキャストアドレス空間（値0.0.0.0.0〜2255.255.255）からの値の割り当てに関する特定のガイドラインの策定に対する責任を最近受け入れました。8（[AN80]で予約されていた）および127/8（ループバックアドレスが取得された）と、特別な機能または目的のためにIETFによってすでに割り当てられている他の値。（たとえば、RFC 1918で定義されているプライベートアドレス。）0/8および127/8の範囲でのさらなる割り当てには、これが行われた場合に現在のIP実装が破損する可能性があるため、標準アクションプロセスが必要です。"
    },
    {
      "indent": 0,
      "text": "4.4.2 IPv4 Multicast addresses",
      "section_title": true,
      "ja": "4.4.2 IPv4マルチキャストアドレス"
    },
    {
      "indent": 3,
      "text": "IPv4 addresses that fall in the range from 224.0.0.0 through 239.255.255.255 are known as multicast addresses. The IETF through its normal processes has assigned a number of IPv4 multicast addresses for special purposes. For example, [ADSCP] assigned a number of IPv4 multicast address to correspond to IPv6 scoped multicast addresses. Also, the values in the range from 224.0.0.0 to 224.0.0.255 , inclusive, are reserved by the IANA for the use of routing protocols and other low-level topology discovery or maintenance protocols, such as gateway discovery and group membership reporting. (See the IANA web page) New values in this range are assigned following an IESG Approval or Standards Action process. Assignments of individual multicast address follow an Expert Review, IESG Approval or Standards Action process. Until further work is done on multicast protocols, large-scale assignments of IPv4 multicast addresses is not recommended.",
      "ja": "IPv4アドレスは、224.0.0.0から239.255.255.255の範囲に分類されます。マルチキャストアドレスとして知られています。通常のプロセスを介したIETFは、特別な目的で多数のIPv4マルチキャストアドレスを割り当てました。たとえば、[ADSCP]は、IPv6スコープマルチキャストアドレスに対応するように、多数のIPv4マルチキャストアドレスを割り当てました。また、224.0.0.0から224.0.0.255の範囲の値は、ルーティングプロトコルやその他の低レベルのトポロジの発見またはゲートウェイの発見やグループメンバーシップの報告などのその他の低レベルトポロジの発見またはメンテナンスプロトコルの使用のためにIANAによって予約されています。（IANA Webページを参照）この範囲の新しい値は、IESGの承認または標準アクションプロセスに従って割り当てられます。個々のマルチキャストアドレスの割り当ては、専門家のレビュー、IESGの承認、または標準アクションプロセスに従います。マルチキャストプロトコルに関するさらなる作業が行われるまで、IPv4マルチキャストアドレスの大規模な割り当ては推奨されません。"
    },
    {
      "indent": 3,
      "text": "From time to time, there are requests for temporary assignment of multicast space for experimental purposes. These will originate in an IESG Approval process and should be for a limited duration such as one year.",
      "ja": "時々、実験目的でマルチキャストスペースを一時的に割り当てるリクエストがあります。これらはIESGの承認プロセスに由来し、1年などの限られた期間である必要があります。"
    },
    {
      "indent": 0,
      "text": "4.4.3 IPv4 Reserved addresses",
      "section_title": true,
      "ja": "4.4.3 IPv4予約アドレス"
    },
    {
      "indent": 3,
      "text": "IPv4 addresses in the range from 240.0.0.0 through 255.255.255.254 are reserved [AN81, MULT] and compliant IPv4 implementations will discard any packets that make use of them. Addresses in this range are not to be assigned unless an IETF Standards Action modifies the IPv4 protocol in such a way as to make these addresses valid. Address 255.255.255.255 is the limited broadcast address.",
      "ja": "240.0.0.0〜255.255.255.254の範囲のIPv4アドレスは予約されており[AN81、MULT]、準拠したIPv4実装は、それらを利用するパケットを破棄します。この範囲のアドレスは、これらのアドレスを有効にするようにIPv4プロトコルを変更しない限り、IETF標準のアクションがIPv4プロトコルを変更しない限り、割り当てられません。アドレス255.255.255.255は、限られた放送アドレスです。"
    },
    {
      "indent": 0,
      "text": "4.5 IPv4 Option Type field",
      "section_title": true,
      "ja": "4.5 IPv4オプションタイプフィールド"
    },
    {
      "indent": 3,
      "text": "The IANA allocates values from the IPv4 Option Type name space following an IESG Approval, IETF Consensus or Standards Action process.",
      "ja": "IANAは、IESGの承認、IETFコンセンサス、または標準アクションプロセスに続いて、IPv4オプションタイプの名前のスペースから値を割り当てます。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations for fields in the IPv6 header",
      "section_title": true,
      "ja": "5. IPv6ヘッダーのフィールドに関するIANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IPv6 header [V6] contains the following fields that carry values assigned from IANA-managed name spaces: Version (by definition always 6 in IPv6), Traffic Class, Next Header, Source and Destination Address. In addition, the IPv6 Hop-by-Hop Options and Destination Options extension headers include an Option Type field with values assigned from an IANA-managed name space.",
      "ja": "IPv6ヘッダー[V6]には、IANAが管理した名前スペースから割り当てられた値を伝える次のフィールドが含まれています。さらに、IPv6ホップバイホップオプションと宛先オプションエクステンションヘッダーには、IANAが管理した名前スペースから割り当てられた値を持つオプションタイプフィールドが含まれています。"
    },
    {
      "indent": 0,
      "text": "5.1 IPv6 Version field",
      "section_title": true,
      "ja": "5.1 IPv6バージョンフィールド"
    },
    {
      "indent": 3,
      "text": "The IPv6 Version field is always 6.",
      "ja": "IPv6バージョンフィールドは常に6です。"
    },
    {
      "indent": 0,
      "text": "5.2 IPv6 Traffic Class field",
      "section_title": true,
      "ja": "5.2 IPv6トラフィッククラスフィールド"
    },
    {
      "indent": 3,
      "text": "The IPv6 Traffic Class field is described in [DIFF] as a 6- bit Differentiated Services (DS) field and a 2-bit field which is currently reserved. See Section 4.2 for assignment guidelines for these fields.",
      "ja": "IPv6トラフィッククラスフィールドは、[DIFF]では、6ビット差別化されたサービス（DS）フィールドと現在予約されている2ビットフィールドとして説明されています。これらのフィールドの割り当てガイドラインについては、セクション4.2を参照してください。"
    },
    {
      "indent": 0,
      "text": "5.3 IPv6 Next Header field",
      "section_title": true,
      "ja": "5.3 IPv6次のヘッダーフィールド"
    },
    {
      "indent": 3,
      "text": "The IPv6 Next Header field carries values from the same name space as the IPv4 Protocol name space. These values are allocated as discussed in Section 4.3.",
      "ja": "IPv6 Next Headerフィールドは、IPv4プロトコル名スペースと同じ名前空間から値を運びます。これらの値は、セクション4.3で説明されているように割り当てられます。"
    },
    {
      "indent": 0,
      "text": "5.4 IPv6 Source and Destination Unicast Addresses",
      "section_title": true,
      "ja": "5.4 IPv6ソースおよび宛先ユニキャストアドレス"
    },
    {
      "indent": 3,
      "text": "The IPv6 Source and Destination address fields both use the same values and are described in [V6AD]. The addresses are divided into ranges defined by a variable length Format Prefix (FP).",
      "ja": "IPv6ソースと宛先アドレスフィールドはどちらも同じ値を使用し、[v6ad]で説明されています。アドレスは、可変長い形式のプレフィックス（FP）で定義された範囲に分割されます。"
    },
    {
      "indent": 0,
      "text": "5.4.1 IPv6 Aggregatable Global Unicast Addresses",
      "section_title": true,
      "ja": "5.4.1 IPv6集計可能なグローバルユニキャストアドレス"
    },
    {
      "indent": 3,
      "text": "The IANA was given responsibility for all IPv6 address space by the IAB in [V6AA]. Recently the IANA agreed to specific guidelines for the assignment of values in the Aggregatable Global Unicast Addresses FP (FP 001) formulated by the Regional Internet Registries.",
      "ja": "IANAには、[V6AA]のIABによってすべてのIPv6アドレススペースに対して責任が与えられました。最近、IANAは、地域のインターネットレジストリによって策定された集約可能なグローバルユニキャストアドレスFP（FP 001）の値の割り当てに関する特定のガイドラインに同意しました。"
    },
    {
      "indent": 0,
      "text": "5.4.2 IPv6 Anycast Addresses",
      "section_title": true,
      "ja": "5.4.2 IPv6 Anycastアドレス"
    },
    {
      "indent": 3,
      "text": "IPv6 anycast addresses are defined in [V6AD]. Anycast addresses are allocated from the unicast address space and anycast addresses are syntactically indistinguishable from unicast addresses. Assignment of IPv6 Anycast subnet addresses follows the process described in [V6AD]. Assignment of other IPv6 Anycast addresses follows the process used for IPv6 Aggregatable Global Unicast Addresses. (section 5.4.1)",
      "ja": "IPv6 Anycastアドレスは[V6AD]で定義されています。Anycastアドレスはユニキャストアドレススペースから割り当てられ、AnyCastアドレスはユニキャストアドレスと構文的に区別できません。IPv6 Anycast Subnetアドレスの割り当ては、[V6AD]で説明されているプロセスに従います。他のIPv6 Anycastアドレスの割り当ては、IPv6 Aggregatable Global Unicastアドレスに使用されるプロセスに従います。（セクション5.4.1）"
    },
    {
      "indent": 0,
      "text": "5.4.3 IPv6 Multicast Addresses",
      "section_title": true,
      "ja": "5.4.3 IPv6マルチキャストアドレス"
    },
    {
      "indent": 3,
      "text": "IPv6 multicast addresses are defined in [V6AD]. They are identified by a FP of 0xFF. Assignment guidelines for IPv6 multicast addresses are described in [MASGN].",
      "ja": "IPv6マルチキャストアドレスは[V6AD]で定義されています。それらは0xffのFPによって識別されます。IPv6マルチキャストアドレスの割り当てガイドラインは、[MASGN]で説明されています。"
    },
    {
      "indent": 0,
      "text": "5.4.4 IPv6 Unassigned and Reserved IPv6 Format Prefixes",
      "section_title": true,
      "ja": "5.4.4 IPv6は、割り当てられず、予約されていないIPv6形式のプレフィックス"
    },
    {
      "indent": 3,
      "text": "The responsibility for assigning values in each of the \"unassigned\" and \"reserved\" Format Prefixes is delegated by IESG Approval or Standards Action processes since the rules for processing these Format Prefixes in IPv6 implementations have not been defined.",
      "ja": "IPv6実装でこれらの形式のプレフィックスを処理するためのルールが定義されていないため、IESGの承認または標準のアクションプロセスによって、「割り当てられていない」および「予約済み」形式のプレフィックスのそれぞれに値を割り当てる責任は委任されます。"
    },
    {
      "indent": 0,
      "text": "5.5 IPv6 Hop-by-Hop and Destination Option Fields",
      "section_title": true,
      "ja": "5.5 IPv6ホップバイホップと宛先オプションフィールド"
    },
    {
      "indent": 3,
      "text": "Values for the IPv6 Hop-by-Hop Options and Destination Options fields are allocated using an IESG Approval, IETF Consensus or Standards Action processes.",
      "ja": "IPv6ホップバイホップオプションと宛先オプションフィールドの値は、IESG承認、IETFコンセンサス、または標準アクションプロセスを使用して割り当てられます。"
    },
    {
      "indent": 0,
      "text": "5.6 IPv6 Neighbor Discovery Fields",
      "section_title": true,
      "ja": "5.6 IPv6ネイバーディスカバリーフィールド"
    },
    {
      "indent": 3,
      "text": "The IPv6 Neighbor Discovery header [NDV6] contains the following fields that carry values assigned from IANA- managed name spaces: Type, Code and Option Type.",
      "ja": "IPv6 Neighbor Discoveryヘッダー[NDV6]には、IANA-管理された名前スペース（タイプ、コード、オプションタイプ）から割り当てられた値を運ぶ以下のフィールドが含まれています。"
    },
    {
      "indent": 3,
      "text": "Values for the IPv6 Neighbor Discovery Type, Code, and Option Type fields are allocated using an IESG Approval or Standards Action process.",
      "ja": "IPv6ネイバーディスカバリータイプ、コード、およびオプションタイプフィールドの値は、IESG承認または標準アクションプロセスを使用して割り当てられます。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations for fields in the IPv4 ICMP header",
      "section_title": true,
      "ja": "6. IPv4 ICMPヘッダーのフィールドに関するIANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IPv4 ICMP header [ICMP] contains the following fields that carry values assigned from IANA-managed name spaces: Type and Code. Code field values are defined relative to a specific Type value.",
      "ja": "IPv4 ICMPヘッダー[ICMP]には、IANAが管理した名前スペース（タイプとコード）から割り当てられた値を伝える次のフィールドが含まれています。コードフィールド値は、特定の型値に対して定義されます。"
    },
    {
      "indent": 3,
      "text": "Values for the IPv4 ICMP Type fields are allocated using an IESG Approval or Standards Action processes. Code Values for existing IPv4 ICMP Type fields are allocated using IESG Approval or Standards Action processes. The policy for assigning Code values for new IPv4 ICMP Types should be defined in the document defining the new Type value.",
      "ja": "IPv4 ICMPタイプフィールドの値は、IESGの承認または標準アクションプロセスを使用して割り当てられます。既存のIPv4 ICMPタイプフィールドのコード値は、IESG承認または標準のアクションプロセスを使用して割り当てられます。新しいIPv4 ICMPタイプのコード値を割り当てるためのポリシーは、新しいタイプ値を定義するドキュメントで定義する必要があります。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations for fields in the IPv6 ICMP header",
      "section_title": true,
      "ja": "7. IPv6 ICMPヘッダーのフィールドに関するIANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IPv6 ICMP header [ICMPV6] contains the following fields that carry values assigned from IANA-managed name spaces: Type and Code. Code field values are defined relative to a specific Type value.",
      "ja": "IPv6 ICMPヘッダー[ICMPv6]には、IANAが管理した名前スペースから割り当てられた値（タイプとコード）を運ぶ以下のフィールドが含まれています。コードフィールド値は、特定の型値に対して定義されます。"
    },
    {
      "indent": 3,
      "text": "Values for the IPv6 ICMP Type fields are allocated using an IESG Approval or Standards Action processes. Code Values for existing IPv6 ICMP Type fields are allocated using IESG Approval or Standards Action processes. The policy for assigning Code values for new IPv6 ICMP Types should be defined in the document defining the new Type value.",
      "ja": "IPv6 ICMPタイプフィールドの値は、IESGの承認または標準アクションプロセスを使用して割り当てられます。既存のIPv6 ICMPタイプフィールドのコード値は、IESG承認または標準のアクションプロセスを使用して割り当てられます。新しいIPv6 ICMPタイプのコード値を割り当てるためのポリシーは、新しいタイプ値を定義するドキュメントで定義する必要があります。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations for fields in the UDP header",
      "section_title": true,
      "ja": "8. UDPヘッダーのフィールドに関するIANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The UDP header [UDP] contains the following fields that carry values assigned from IANA-managed name spaces: Source and Destination Port.",
      "ja": "UDPヘッダー[UDP]には、IANAが管理した名前スペースから割り当てられた値を伝える次のフィールドが含まれています：ソースと宛先ポート。"
    },
    {
      "indent": 3,
      "text": "Both the Source and Destination Port fields use the same namespace. Values in this namespace are assigned following a Specification Required, Expert Review, IESG Approval, IETF Consensus, or Standards Action process. Note that some assignments may involve non-disclosure information.",
      "ja": "ソースポートフィールドと宛先ポートフィールドの両方が同じ名前空間を使用しています。この名前空間の値は、必要な仕様、エキスパートレビュー、IESG承認、IETFコンセンサス、または標準アクションプロセスに従って割り当てられます。一部の割り当てには、非公開情報が含まれる場合があることに注意してください。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations for fields in the TCP header",
      "section_title": true,
      "ja": "9. TCPヘッダーのフィールドに関するIANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The TCP header [TCP] contains the following fields that carry values assigned from IANA-managed name spaces: Source and Destination Port, Reserved Bits, and Option Kind.",
      "ja": "TCPヘッダー[TCP]には、IANAが管理した名前スペースから割り当てられた値を伝える次のフィールドが含まれています：ソースと宛先ポート、予約ビット、およびオプションの種類があります。"
    },
    {
      "indent": 0,
      "text": "9.1 TCP Source and Destination Port fields",
      "section_title": true,
      "ja": "9.1 TCPソースおよび宛先ポートフィールド"
    },
    {
      "indent": 3,
      "text": "Both the Source and Destination Port fields use the same namespace. Values in this namespace are assigned following a Specification Required, Expert Review, IESG Approval, IETF Consensus, or Standards Action process. Note that some assignments may involve non-disclosure information.",
      "ja": "ソースポートフィールドと宛先ポートフィールドの両方が同じ名前空間を使用しています。この名前空間の値は、必要な仕様、エキスパートレビュー、IESG承認、IETFコンセンサス、または標準アクションプロセスに従って割り当てられます。一部の割り当てには、非公開情報が含まれる場合があることに注意してください。"
    },
    {
      "indent": 0,
      "text": "9.2 Reserved Bits in TCP Header",
      "section_title": true,
      "ja": "9.2 TCPヘッダーの予約ビット"
    },
    {
      "indent": 3,
      "text": "The reserved bits in the TCP header are assigned following a Standards Action process.",
      "ja": "TCPヘッダーの予約ビットは、標準アクションプロセスに従って割り当てられます。"
    },
    {
      "indent": 0,
      "text": "9.3 TCP Option Kind field",
      "section_title": true,
      "ja": "9.3 TCPオプションの種類フィールド"
    },
    {
      "indent": 3,
      "text": "Values in the Option Kind field are assigned following an IESG Approval or Standards Action process.",
      "ja": "Option Kindフィールドの値は、IESGの承認または標準アクションプロセスに従って割り当てられます。"
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "ja": "10. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Security analyzers such as firewalls and network intrusion detection monitors often rely on unambiguous interpretations of the fields described in this memo. As new values for the fields are assigned, existing security analyzers that do not understand the new values may fail, resulting in either loss of connectivity if the analyzer declines to forward the unrecognized traffic, or loss of security if it does forward the traffic and the new values are used as part of an attack. This vulnerability argues for high visibility (which the Standards Action and IETF Consensus processes ensure) for the assignments whenever possible.",
      "ja": "ファイアウォールやネットワーク侵入検出モニターなどのセキュリティアナライザーは、このメモに記載されているフィールドの明確な解釈に依存していることがよくあります。フィールドの新しい値が割り当てられると、新しい値が失敗する可能性がある既存のセキュリティアナライザーが失敗する可能性があり、アナライザーが認識されていないトラフィックの転送を拒否した場合、またはトラフィックとトラフィックを転送した場合のセキュリティの損失のいずれかをもたらします。新しい値は攻撃の一部として使用されます。この脆弱性は、可能な限り割り当ての高い可視性（標準アクションとIETFコンセンサスプロセスが保証する）について主張しています。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11. 参考文献"
    },
    {
      "indent": 3,
      "text": "[ADSCP] Meyer, D., \"Administratively Scoped IP Multicast\", RFC 2365, July 1998.",
      "ja": "[ADSCP] Meyer、D。、「管理上スコープIPマルチキャスト」、RFC 2365、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[AN80] Postel, J., \"Assigned Numbers\", RFC 758, August 1979.",
      "ja": "[AN80] POSTEL、J。、「割り当てられた番号」、RFC 758、1979年8月。"
    },
    {
      "indent": 3,
      "text": "[AN81] Postel, J., \"Assigned Numbers\", RFC 790, September 1981.",
      "ja": "[AN81] Postel、J。、「割り当てられた番号」、RFC 790、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[CONS] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[Cons] Narten、T。およびH. Alvestrand、「RFCSでIANA考慮事項セクションを書くためのガイドライン」、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 3,
      "text": "[DIFF] Nichols, K., Blake, S., Baker, F. and D. Black, \"Definition of the Differentiated Services Field (DS Field) in the IPv4 and IPv6 Headers\", RFC 2474, December 1998.",
      "ja": "[Diff] Nichols、K.、Blake、S.、Baker、F。、およびD. Black、「IPv4およびIPv6ヘッダーの差別化されたサービスフィールド（DSフィールド）の定義」、RFC 2474、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[ECN] Ramakrishnan, K. and S. Floyd, \"A Proposal to add Explicit Congestion Notification (ECN) to IP\", RFC 2481, January 1999.",
      "ja": "[ECN] Ramakrishnan、K。およびS. Floyd、「IPに明示的な混雑通知（ECN）を追加する提案」、RFC 2481、1999年1月。"
    },
    {
      "indent": 3,
      "text": "[HC] Jacobson, V., \"Compressing TCP/IP headers for low-speed serial links\", RFC 1144, February 1990.",
      "ja": "[HC] Jacobson、V。、「低速シリアルリンクのTCP/IPヘッダーの圧縮」、RFC 1144、1990年2月。"
    },
    {
      "indent": 3,
      "text": "[ICMP] Postel, J., \"Internet Control Message Protocol\", STD 5, RFC 792, September 1981.",
      "ja": "[ICMP] Postel、J。、「インターネットコントロールメッセージプロトコル」、STD 5、RFC 792、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[ICMPV6] Conta, A. and S. Deering, \"Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6)\", RFC 2463, December 1998.",
      "ja": "[ICMPV6] Conta、A。およびS. Deering、「インターネットプロトコルバージョン6（IPv6）のインターネット制御メッセージプロトコル（ICMPV6）」、RFC 2463、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[IPHC] Degermark, M., Nordgren, S. and B. Pink, \"IP Header Compression\", RFC 2507, February 1999.",
      "ja": "[IPHC] Degermark、M.、Nordgren、S。、およびB. Pink、「IPヘッダー圧縮」、RFC 2507、1999年2月。"
    },
    {
      "indent": 3,
      "text": "[MASGN] Hinden, R. and S. Deering, \"IPv6 Multicast Address Assignments\", RFC 2375, July 1998.",
      "ja": "[Masgn] Hinden、R。and S. Deering、「IPv6マルチキャストアドレスの割り当て」、RFC 2375、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[MULT] Deering, S., \"Host extensions for IP multicasting\", RFC 988, July 1986.",
      "ja": "[Mult] Deering、S。、「IPマルチキャストのホスト拡張」、RFC 988、1986年7月。"
    },
    {
      "indent": 3,
      "text": "[NDV6] Narten, T., Nordmark, E. and W. Simpson, \"Neighbor Discovery for IP Version 6 (IPv6)\", RFC 2461, December 1998.",
      "ja": "[Ndv6] Narten、T.、Nordmark、E。およびW. Simpson、「IPバージョン6（IPv6）の近隣発見」、RFC 2461、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[TCP] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981.",
      "ja": "[TCP] Postel、J。、「トランスミッションコントロールプロトコル」、STD 7、RFC 793、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[UDP] Postel, J., \"User Datagram Protocol\", STD 6, RFC 768, August 1980.",
      "ja": "[UDP] Postel、J。、「ユーザーデータグラムプロトコル」、STD 6、RFC 768、1980年8月。"
    },
    {
      "indent": 3,
      "text": "[V4] Postel, J., \"Internet Protocol\", STD 5, RFC 791, September, 1981.",
      "ja": "[V4] Postel、J。、「インターネットプロトコル」、STD 5、RFC 791、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[V6] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[V6] Deering、S。およびR. Hinden、「インターネットプロトコル、バージョン6（IPv6）仕様」、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[V6AA] IAB, IESG, \"IPv6 Address Allocation Management\", RFC 1881, December 1995.",
      "ja": "[V6AA] IAB、IESG、「IPv6アドレス割り当て管理」、RFC 1881、1995年12月。"
    },
    {
      "indent": 3,
      "text": "[V6AD] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 2373, July 1998.",
      "ja": "[V6ad] Hinden、R。およびS. Deering、「IPバージョン6アドレス指定アーキテクチャ」、RFC 2373、1998年7月。"
    },
    {
      "indent": 0,
      "text": "12. Authors' Addresses",
      "section_title": true,
      "ja": "12. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Scott Bradner Harvard University Cambridge MA - USA 02138",
      "ja": "スコット・ブラッドナー・ハーバード大学ケンブリッジMA -USA 02138"
    },
    {
      "indent": 3,
      "text": "Phone: +1 617 495 3864\nEMail: sob@harvard.edu",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Vern Paxson ACIRI / ICSI 1947 Center Street, Suite 600 Berkeley, CA - USA 94704-1198",
      "ja": "Vern Paxson Aciri / Icsi 1947 Center Street、Suite 600 Berkeley、CA -USA 94704-1198"
    },
    {
      "indent": 3,
      "text": "Phone: +1 510 666 2882\nEMail: vern@aciri.org",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "13. Full Copyright Statement",
      "section_title": true,
      "ja": "13. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}