{
  "title": {
    "text": "RFC 2984 - Use of the CAST-128 Encryption Algorithm in CMS",
    "ja": "RFC 2984 - CMSでのCAST-128暗号化アルゴリズムの使用"
  },
  "number": 2984,
  "created_at": "2024-01-04 05:17:22.457282+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           C. Adams\nRequest for Comments: 2984                          Entrust Technologies\nCategory: Standards Track                                   October 2000",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Use of the CAST-128 Encryption Algorithm in CMS",
      "ja": "CMSでのCAST-128暗号化アルゴリズムの使用"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document specifies how to incorporate CAST-128 (RFC2144) into the S/MIME Cryptographic Message Syntax (CMS) as an additional algorithm for symmetric encryption. The relevant OIDs and processing steps are provided so that CAST-128 may be included in the CMS specification (RFC2630) for symmetric content and key encryption.",
      "ja": "このドキュメントは、対称暗号化の追加アルゴリズムとして、CAST-128（RFC2144）をS/MIME暗号化メッセージ構文（CMS）に組み込む方法を指定します。関連するOIDと処理手順が提供されているため、CAST-128が対称コンテンツとキー暗号化のためにCMS仕様（RFC2630）に含まれるようになります。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document (in uppercase, as shown) are to be interpreted as described in [RFC2119].",
      "ja": "「必須」、「必要」、「必須」、「必要」、「必要はない」、「推奨」、「5月」、および「オプション」（図のように大文字で）は次のとおりです。[RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1. Motivation",
      "section_title": true,
      "ja": "1. モチベーション"
    },
    {
      "indent": 3,
      "text": "S/MIME (Secure/Multipurpose Internet Mail Extensions) [SMIME2, SMIME3] is a set of specifications for the secure transport of MIME objects. In the current (S/MIME v3) specifications the mandatory-to-implement symmetric algorithm for content encryption and key encryption is triple-DES (3DES). While this is perfectly acceptable in many cases because the security of 3DES is generally considered to be high, for some environments 3DES may be seen to be too slow. In part to help alleviate such performance concerns, S/MIME has allowed any number of (optional) additional algorithms to be used for symmetric content and key encryption.",
      "ja": "S/MIME（Secure/Multipurpose Internet Mail Extensions）[SMIME2、SMIME3]は、MIMEオブジェクトの安全な輸送の仕様のセットです。現在（S/MIME V3）仕様では、コンテンツの暗号化とキー暗号化のための必須の対称アルゴリズムは、トリプルDE（3DE）です。3DEのセキュリティは一般的に高いと考えられるため、多くの場合、これは完全に受け入れられますが、一部の環境では3DEが遅すぎると見られる場合があります。そのようなパフォーマンスの懸念を軽減するために部分的には、S/MIMEは、対称コンテンツとキー暗号化に使用される（オプションの）追加のアルゴリズムを使用することを許可しました。"
    },
    {
      "indent": 3,
      "text": "The CAST-128 encryption algorithm [RFC2144, Adams] is a well-studied symmetric cipher that has a number of appealing features, including relatively high performance and a variable key size (from 40 bits to 128 bits). It is available royalty-free and license-free for commercial and non-commercial uses worldwide [IPR], and therefore is widely used in a number of applications around the Internet. It thus seems to be a suitable optional encryption algorithm for S/MIME.",
      "ja": "CAST-128暗号化アルゴリズム[RFC2144、Adams]は、比較的高いパフォーマンスと可変キーサイズ（40ビットから128ビット）など、多くの魅力的な機能を備えた適切に研究された対称的な暗号です。世界中の商業用および非営利目的の使用が利用可能であり、ライセンスフリーであるため、インターネット周辺の多くのアプリケーションで広く使用されています。したがって、S/MIMEに適したオプション暗号化アルゴリズムのようです。"
    },
    {
      "indent": 3,
      "text": "This document describes how to use CAST-128 within the S/MIME CMS specification.",
      "ja": "このドキュメントでは、S/MIME CMS仕様内でCAST-128を使用する方法について説明します。"
    },
    {
      "indent": 0,
      "text": "2. Specification",
      "section_title": true,
      "ja": "2. 仕様"
    },
    {
      "indent": 3,
      "text": "This section provides the OIDs and processing information necessary for CAST-128 to be used for content and key encryption in CMS.",
      "ja": "このセクションでは、CAST-128がCMSのコンテンツとキー暗号化に使用するために必要なOIDと処理情報を提供します。"
    },
    {
      "indent": 0,
      "text": "2.1 OIDs for Content and Key Encryption",
      "section_title": true,
      "ja": "2.1 コンテンツとキー暗号化用のOID"
    },
    {
      "indent": 3,
      "text": "CAST-128 is added to the set of optional symmetric encryption algorithms in CMS by providing two unique object identifiers (OIDs). One OID defines the content encryption algorithm and the other defines the key encryption algorithm. Thus a CMS agent can apply CAST-128 either for content or key encryption by selecting the corresponding object identifier, supplying the required parameter, and starting the program code.",
      "ja": "CAST-128は、2つの一意のオブジェクト識別子（OID）を提供することにより、CMSのオプションの対称暗号化アルゴリズムのセットに追加されます。1つのOIDはコンテンツ暗号化アルゴリズムを定義し、もう1つはキー暗号化アルゴリズムを定義します。したがって、CMSエージェントは、対応するオブジェクト識別子を選択し、必要なパラメーターを供給し、プログラムコードを開始することにより、コンテンツまたはキー暗号化にCAST-128を適用できます。"
    },
    {
      "indent": 3,
      "text": "For content encryption the use of CAST-128 in cipher block chaining (CBC) mode is RECOMMENDED. The key length is variable (from 40 to 128 bits in 1-octet increments).",
      "ja": "コンテンツ暗号化の場合、暗号ブロックチェーン（CBC）モードでのCAST-128の使用をお勧めします。キーの長さは可変です（1オクテットの増分で40〜128ビット）。"
    },
    {
      "indent": 3,
      "text": "The CAST-128 content-encryption algorithm in CBC mode has the following object identifier:",
      "ja": "CBCモードのCAST-128コンテンツエンクロリットアルゴリズムには、次のオブジェクト識別子があります。"
    },
    {
      "indent": 5,
      "text": "cast5CBC OBJECT IDENTIFIER ::= {iso(1) member-body(2)\n    us(840) nt(113533) nsn(7) algorithms(66) 10}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The parameter associated with this object identifier contains the initial vector IV and the key length:",
      "ja": "このオブジェクト識別子に関連付けられたパラメーターには、初期ベクトルIVとキーの長さが含まれます。"
    },
    {
      "indent": 5,
      "text": "cast5CBCParameters ::= SEQUENCE {\n    iv         OCTET STRING DEFAULT 0,\n    -- Initialization vector\n    keyLength  INTEGER\n    -- Key length, in bits\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Comments regarding the use of the IV may be found in [RFC2144].",
      "ja": "IVの使用に関するコメントは、[RFC2144]に記載されている場合があります。"
    },
    {
      "indent": 3,
      "text": "The key-wrap/unwrap procedures used to encrypt/decrypt a CAST-128 content-encryption key with a CAST-128 key-encryption key are specified in Section 2.2. Generation and distribution of key-encryption keys are beyond the scope of this document.",
      "ja": "CAST-128キー暗号化キーを使用して、CAST-128コンテンツ暗号化キーを暗号化/復号化するために使用されるキーWRAP/UNWRAP手順は、セクション2.2に指定されています。キー暗号キーの生成と分布は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 3,
      "text": "The CAST-128 key-encryption algorithm has the following object identifier:",
      "ja": "CAST-128 Key-Encryptionアルゴリズムには、次のオブジェクト識別子があります。"
    },
    {
      "indent": 5,
      "text": "cast5CMSkeywrap OBJECT IDENTIFIER ::= { iso(1)\n    member-body(2) us(840) nt(113533) nsn(7)\n    algorithms(66) 15}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The parameter associated with this object identifier contains only the key length (because the key wrapping procedure itself defines how and when to use an IV):",
      "ja": "このオブジェクト識別子に関連付けられているパラメーターには、キーの長さのみが含まれています（キーラッピング手順自体がIVを使用する方法と時期を定義するため）："
    },
    {
      "indent": 5,
      "text": "cast5CMSkeywrapParameter ::= INTEGER\n  -- key length, in bits",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "2.2 Key Wrapping and Unwrapping",
      "section_title": true,
      "ja": "2.2 キーラッピングとアンラッピング"
    },
    {
      "indent": 3,
      "text": "CAST-128 key wrapping and unwrapping is done in conformance with CMS [RFC2630].",
      "ja": "CAST-128キーラッピングとアンラッピングは、CMS [RFC2630]に準拠して行われます。"
    },
    {
      "indent": 0,
      "text": "2.2.1 CAST-128 Key Wrap",
      "section_title": true,
      "ja": "2.2.1 CAST-128キーラップ"
    },
    {
      "indent": 3,
      "text": "Key wrapping with CAST-128 is identical to [RFC2630], Sections 12.6.1 and 12.6.4, with \"RC2\" replaced by \"CAST-128\" in the introduction to 12.6.4. Only 128-bit CAST-128 keys may be used as key-encryption keys, and they MUST be used with the cast5CMSkeywrapParameter set to 128. It is RECOMMENDED that the size of the content-encryption key and the size of the key-encryption key be equal (since the security of the content will be at most the smaller of these two values).",
      "ja": "CAST-128を使用したキーラッピングは[RFC2630]、セクション12.6.1および12.6.4と同一であり、「RC2」は12.6.4の概要で「CAST-128」に置き換えられます。キー暗号化キーとして使用できるはずの128ビットのCAST-128キーのみが128に設定されたCAST5CMSKEYWRAPPARAMETERで使用する必要があります。コンテンツ暗号化キーのサイズとキー暗号化キーのサイズを推奨することをお勧めします。平等になる（コンテンツのセキュリティは最大でこれらの2つの値のうち少ないため）。"
    },
    {
      "indent": 0,
      "text": "2.2.2 CAST-128 Key Unwrap",
      "section_title": true,
      "ja": "2.2.2 CAST-128キーアンラップ"
    },
    {
      "indent": 3,
      "text": "Key unwrapping with CAST-128 is identical to [RFC2630], Sections 12.6.1 and 12.6.5, with \"RC2\" replaced by \"CAST-128\" in the introduction to 12.6.5.",
      "ja": "CAST-128のキーアンラッピングは[RFC2630]、セクション12.6.1および12.6.5と同一であり、「RC2」は12.6.5の紹介で「CAST-128」に置き換えられます。"
    },
    {
      "indent": 0,
      "text": "3. Using CAST-128 in S/MIME Clients",
      "section_title": true,
      "ja": "3. S/MIMEクライアントでCAST-128を使用します"
    },
    {
      "indent": 3,
      "text": "An S/MIME client SHOULD announce the set of cryptographic functions it supports by using the S/MIME capabilities attribute. This attribute provides a partial list of OIDs of cryptographic functions and MUST be signed by the client. The functions' OIDs SHOULD be logically separated in functional categories and MUST be ordered with respect to their preference. If an S/MIME client is required to support symmetric encryption with CAST-128, the capabilities attribute MUST contain the cast5CBC OID specified above in the category of symmetric algorithms. The parameter associated with this OID (see above) MUST be used to indicate supported key length. For example, when the supported key length is 128 bits, the SMIMECapability SEQUENCE representing CAST-128 MUST be DER-encoded as the following hexadecimal string: 301106092A864886F67D07420A300402020080.",
      "ja": "S/MIMEクライアントは、S/MIME機能属性を使用してサポートする暗号化機能のセットを発表する必要があります。この属性は、暗号化関数のOIDの部分的なリストを提供し、クライアントが署名する必要があります。関数のOIDは、機能的なカテゴリで論理的に分離する必要があり、それらの好みに関して順序付けられる必要があります。S/MIMEクライアントがCAST-128で対称暗号化をサポートする必要がある場合、機能属性には、対称アルゴリズムのカテゴリに上記のCAST5CBC OIDを含める必要があります。このOIDに関連付けられたパラメーター（上記参照）を使用して、サポートされているキー長を示す必要があります。たとえば、サポートされているキーの長さが128ビットの場合、CAST-128を表すスミメカセビリティシーケンスは、次の16進数文字列としてderエンコードする必要があります：301106092A864886F67D07420A300402020080。"
    },
    {
      "indent": 3,
      "text": "When a sending agent creates an encrypted message, it has to decide which type of encryption algorithm to use. In general the decision process involves information obtained from the capabilities lists included in messages received from the recipient, as well as other information such as private agreements, user preferences, legal restrictions, and so on. If users require CAST-128 for symmetric encryption, it MUST be supported by the S/MIME clients on both the sending and receiving side, and it MUST be set in the user preferences.",
      "ja": "送信エージェントが暗号化されたメッセージを作成する場合、使用する暗号化アルゴリズムのタイプを決定する必要があります。一般に、決定プロセスには、受信者から受け取ったメッセージに含まれる機能リストから得られた情報、および民間契約、ユーザーの好み、法的制限などのその他の情報が含まれます。ユーザーが対称暗号化にCAST-128を必要とする場合、送信側と受信側の両方のS/MIMEクライアントによってサポートされる必要があり、ユーザーの設定で設定する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document specifies the use of the CAST-128 symmetric cipher for encrypting the content of a CMS message and for encrypting the symmetric key used to encrypt the content of a CMS message. Although CAST-128 allows keys of variable length to be used, it must be recognized that smaller key sizes (e.g., 40, 56, or 64 bits) may be unacceptably weak for some environments. The use of larger key sizes (e.g., 128 bits) is always RECOMMENDED (when relevant import, export, or other laws permit). It is also RECOMMENDED that the size of the content-encryption key and the size of the key-encryption key be equal (since the security of the content will be at most the smaller of these two values).",
      "ja": "このドキュメントは、CMSメッセージのコンテンツを暗号化するためのCAST-128対称暗号の使用と、CMSメッセージのコンテンツを暗号化するために使用される対称キーを暗号化するための使用を指定します。CAST-128を使用すると、さまざまな長さのキーを使用できますが、一部の環境では、より小さなキーサイズ（40、56、または64ビットなど）が容認できないほど弱いことを認識する必要があります。より大きなキーサイズ（たとえば、128ビット）の使用が常に推奨されます（関連する輸入、輸出、またはその他の法律が許可される場合）。また、コンテンツ暗号化キーのサイズとキー暗号化キーのサイズを等しくすることもお勧めします（コンテンツのセキュリティは、これらの2つの値のうちで最小になるため）。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "参考文献"
    },
    {
      "indent": 3,
      "text": "[Adams] C. Adams, \"Constructing Symmetric Ciphers using the CAST Design Procedure\", Designs, Codes, and Cryptography, vol.12, no.3, November 1997, pp.71-104.",
      "ja": "[Adams] C. Adams、「キャストデザイン手順を使用した対称暗号の構築」、デザイン、コード、および暗号化、Vol.12、No.3、1997年11月、pp.71-104。"
    },
    {
      "indent": 3,
      "text": "[IPR] See the \"IETF Page of Intellectual Property Rights Notices\", http://www.ietf.cnri.reston.va.us/ipr.html",
      "ja": "[IPR]「知的財産権の通知のIETFページ」、http：//www.ietf.cnri.reston.va.us/ipr.htmlを参照してください"
    },
    {
      "indent": 3,
      "text": "[RFC2144] Adams, C., \"The CAST-128 Encryption Algorithm\", RFC 2144, May 1997.",
      "ja": "[RFC2144] Adams、C。、「The Cast-128暗号化アルゴリズム」、RFC 2144、1997年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2630] Housley, R., \"Cryptographic Message Syntax\", RFC 2630, June 1999.",
      "ja": "[RFC2630] Housley、R。、「暗号化メッセージ構文」、RFC 2630、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[SMIME2] Dusse, S., Hoffman, P., Ramsdell, B., Lundblade, L. and L. Repka, \"S/MIME Version 2 Message Specification\", RFC 2311, March 1998.",
      "ja": "[SMIME2] Dusse、S.、Hoffman、P.、Ramsdell、B.、Lundblade、L。and L. Repka、「S/Mimeバージョン2メッセージ仕様」、RFC 2311、1998年3月。"
    },
    {
      "indent": 13,
      "text": "Dusse, S., Hoffman, P., Ramsdell, B. and J. Weinstein, \"S/MIME Version 2 Certificate Handling\", RFC 2312, March 1998.",
      "ja": "Dusse、S.、Hoffman、P.、Ramsdell、B。、およびJ. Weinstein、「S/Mimeバージョン2証明書処理」、RFC 2312、1998年3月。"
    },
    {
      "indent": 3,
      "text": "[SMIME3] Ramsdell, B., \"S/MIME Version 3 Certificate Handling\", RFC 2632, June 1999.",
      "ja": "[SMIME3] Ramsdell、B。、「S/Mimeバージョン3証明書処理」、RFC 2632、1999年6月。"
    },
    {
      "indent": 13,
      "text": "Ramsdell, B., \"S/MIME Version 3 Message Specification\", RFC 2633, June 1999.",
      "ja": "Ramsdell、B。、「S/Mimeバージョン3メッセージ仕様」、RFC 2633、1999年6月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Carlisle Adams Entrust Technologies 1000 Innovation Drive, Kanata, Ontario, Canada K2K 3E7",
      "ja": "Carlisle Adamsはテクノロジーを委託し、カナダ、オンタリオ州カナタのイノベーションドライブを委託しますK2K 3E7"
    },
    {
      "indent": 3,
      "text": "EMail: cadams@entrust.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}