{
  "title": {
    "text": "RFC 2489 - Procedure for Defining New DHCP Options",
    "ja": "RFC 2489 - 定義新しいDHCPオプションのための手順"
  },
  "number": 2489,
  "created_at": "2019-10-27 02:42:43.663092+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           R. Droms\nRequest for Comments: 2489                           Bucknell University\nBCP: 29                                                     January 1999\nCategory: Best Current Practice",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Procedure for Defining New DHCP Options",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントはインターネットコミュニティのためのインターネットBest Current Practicesを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Dynamic Host Configuration Protocol (DHCP) provides a framework for passing configuration information to hosts on a TCP/IP network. Configuration parameters and other control information are carried in tagged data items that are stored in the 'options' field of the DHCP message. The data items themselves are also called \"options.\"",
      "ja": "DHCP（Dynamic Host Configuration Protocol）は、TCP / IPネットワーク上のホストに設定情報を渡すためのフレームワークを提供します。設定パラメータとその他の制御情報は、DHCPメッセージの「オプション」フィールドに格納されているタグ付きデータ項目に運ばれます。データ項目自体はまた、「オプション」と呼ばれます。"
    },
    {
      "indent": 3,
      "text": "New DHCP options may be defined after the publication of the DHCP specification to accommodate requirements for conveyance of new configuration parameters. This document describes the procedure for defining new DHCP options.",
      "ja": "新しいDHCPオプションは、新しい設定パラメータの搬送のための要件に対応するために、DHCP仕様の公開後に定義することができます。この文書は、新しいDHCPオプションを定義するための手順を説明します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Dynamic Host Configuration Protocol (DHCP) [1] provides a framework for passing configuration information to hosts on a TCP/IP network. Configuration parameters and other control information are carried in tagged data items that are stored in the 'options' field of the DHCP message. The data items themselves are also called \"options.\" [2]",
      "ja": "動的ホスト構成プロトコル（DHCP）[1] TCP / IPネットワーク上のホストに設定情報を渡すためのフレームワークを提供します。設定パラメータとその他の制御情報は、DHCPメッセージの「オプション」フィールドに格納されているタグ付きデータ項目に運ばれます。データ項目自体はまた、「オプション」と呼ばれます。 [2]"
    },
    {
      "indent": 3,
      "text": "This document describes the procedure for defining new DHCP options. The procedure will guarantee that:",
      "ja": "この文書は、新しいDHCPオプションを定義するための手順を説明します。手順はそれを保証します。"
    },
    {
      "indent": 3,
      "text": "* allocation of new option numbers is coordinated from a single authority, * new options are reviewed for technical correctness and appropriateness, and * documentation for new options is complete and published.",
      "ja": "*新しいオプション番号の割り当ては、単一の機関からコーディネートされ、*新しいオプションは、技術的な正当性と妥当性について検討し、*新しいオプションのドキュメントは完全で公開されています。"
    },
    {
      "indent": 3,
      "text": "As indicated in \"Guidelines for Writing an IANA Considerations Section in RFCs\" (see references), IANA acts as a central authority for assignment of numbers such as DHCP option codes. The new procedure outlined in this document will provide guidance to IANA in the assignment of new option codes.",
      "ja": "「RFCでIANA問題部に書くためのガイドライン」（参考文献を参照）に示されるように、IANAは、このようなDHCPオプションコードのような番号の割り当てのための中央機関として機能します。このドキュメントで概説新しいプロシージャは、新しいオプションコードの割り当てにIANAへのガイダンスを提供します。"
    },
    {
      "indent": 0,
      "text": "2. Overview and background",
      "section_title": true,
      "ja": "2.概要と背景"
    },
    {
      "indent": 3,
      "text": "The procedure described in this document modifies and clarifies the procedure for defining new options in RFC 2131 [2]. The primary modification is to the time at which a new DHCP option is assigned an option number. In the procedure described in this document, the option number is not assigned until specification for the option is about to be published as an RFC.",
      "ja": "この文書に記載された手順を変更し、RFC 2131に新しいオプションを定義するための手順を明確にした[2]。主な変更は、新しいDHCPオプションはオプション番号を割り当てされた時間にあります。オプションの仕様はRFCとして公開されようとしているまで、このドキュメントで説明する手順では、オプション番号が割り当てられていません。"
    },
    {
      "indent": 3,
      "text": "Since the publication of RFC 2132, the option number space for publically defined DHCP options (1-127) has almost been exhausted. Many of the defined option numbers have not been followed up with Internet Drafts submitted to the DHC WG. There has been a lack of specific guidance to IANA from the DHC WG as to the assignment of DHCP option numbers",
      "ja": "RFC 2132の出版以来、公に定義されたDHCPオプション（1-127）のオプション数のスペースがほとんど使い果たされています。定義されたオプション番号の多くは、DHC WGに提出インターネットドラフトで追跡されていません。 DHCPオプション番号の割り当てに関して、DHC WGからIANAへの具体的な指針がないことがありました"
    },
    {
      "indent": 3,
      "text": "The procedure as specified in RFC 2132 does not clearly state that new options are to be reviewed individually for technical correctness, appropriateness and complete documentation. RFC 2132 also does not require that new options are to be submitted to the IESG for review, and that the author of the option specification is responsible for bringing new options to the attention of the IESG. Finally, RFC 2132 does not make clear that newly defined options are not to be incorporated into products, included in other specifications or otherwise used until the specification for the option is published as an RFC.",
      "ja": "RFC 2132で指定された手順は明らかに新しいオプションが技術的な正確性、妥当性および完全なドキュメントのために、個別に検討されるべきであることを述べるものではありません。 RFC 2132はまた、新しいオプションがレビューのためにIESGに提出されることを必要とせず、オプション仕様の作者は、IESGの注意に新しいオプションをもたらすための責任があること。最後に、RFC 2132には、オプションの仕様はRFCとして公開されるまで、新たに定義されたオプションは、他の仕様に含めるか、またはそれ以外の使用、製品に組み込まれていないことが明らかになりません。"
    },
    {
      "indent": 3,
      "text": "In the future, new DHCP option codes will be assigned by IETF consensus. New DHCP options will be documented in RFCs approved by the IESG, and the codes for those options will be assigned at the time the relevant RFCs are published. Typically, the IESG will seek input on prospective assignments from appropriate sources (e.g., a relevant Working Group if one exists). Groups of related options may be combined into a single specification and reviewed as a set by the IESG. Prior to assignment of an option code, it is not appropriate to incorporate new options into products, include the specification in other documents or otherwise make use of the new options.",
      "ja": "将来的には、新しいDHCPオプションコードは、IETFの合意によって割り当てられます。新しいDHCPオプションはIESGによって承認されたRFCで文書化され、それらのオプションのためのコードは、関連するRFCが公開されている時に割り当てられます。典型的には、IESGは、適切な供給源（例えば、関連するワーキンググループが存在する場合）から、将来の割り当ての入力を求めます。関連オプションのグループは、単一の仕様に合わせて、IESGによってセットとして検討されてもよいです。オプションコードの割り当てに先立ち、それが製品に新しいオプションを組み込むことは適切ではない、仕様書その他の文書またはそうでなければ、新たなオプションを利用することがあります。"
    },
    {
      "indent": 3,
      "text": "The DHCP option number space (1-254) is split into two parts. The site-specific options (128-254) are defined as \"Private Use\" and require no review by the DHC WG. The public options (1-127) are defined as \"Specification Required\" and new options must be reviewed prior to assignment of an option number by IANA. The details of the review process are given in the following section of this document.",
      "ja": "DHCPオプション数のスペース（1-254）は、2つの部分に分割されます。サイト固有のオプション（128から254）は、「私用」として定義され、DHC WGによって何の審査が必要とされていません。公共のオプション（1-127）は、「仕様が必要」と定義され、新しいオプションがIANAによってオプション番号の割り当てに先立って検討する必要があります。レビュープロセスの詳細は、このドキュメントの次のセクションに記載されています。"
    },
    {
      "indent": 0,
      "text": "3. Procedure",
      "section_title": true,
      "ja": "3.手順"
    },
    {
      "indent": 3,
      "text": "The author of a new DHCP option will follow these steps to obtain approval for the option and publication of the specification of the option as an RFC:",
      "ja": "新しいDHCPオプションの作者は、RFCとしてオプションの指定のオプションと公開のための承認を得るために、次の手順を実行します："
    },
    {
      "indent": 3,
      "text": "1. The author devises the new option.",
      "section_title": true,
      "ja": "1.著者は、新しいオプションを策定します。"
    },
    {
      "indent": 3,
      "text": "2. The author documents the new option, leaving the option code as \"To Be Determined\" (TBD), as an Internet Draft.",
      "ja": "2.著者は「未定」としてインターネットドラフトとして、（TBD）オプションコードを残して、新しいオプションを説明します。"
    },
    {
      "indent": 6,
      "text": "The requirement that the new option be documented as an Internet Draft is a matter of expediency. In theory, the new option could be documented on the back of an envelope for submission; as a practical matter, the specification will eventually become an Internet Draft as part of the review process.",
      "ja": "新しいオプションは、インターネットドラフトとして文書化する要件は便宜の問題です。理論的には、新しいオプションは、提出のための封筒の裏に文書化することができ、実際問題として、仕様が最終的にレビュープロセスの一環として、インターネットドラフトになります。"
    },
    {
      "indent": 3,
      "text": "3. The author submits the Internet Draft for review by the IESG. Preferably, the author will submit the Internet Draft to the DHC Working Group, but the author may choose to submit the Internet Draft directly to the IESG.",
      "ja": "3.著者はIESGによる検討のためのインターネットドラフトを提出します。好ましくは、著者はDHC作業部会にインターネットドラフトを提出しますが、著者はIESGに直接インターネットドラフトを提出することもできます。"
    },
    {
      "indent": 6,
      "text": "Note that simply publishing the new option as an Internet Draft does not automatically bring the option to the attention of the IESG. The author of the new option must explicitly forward a request for action on the new option to the DHC WG or the IESG.",
      "ja": "単にインターネットドラフトとして新しいオプションを公開すると、自動的にIESGの注意に選択肢を持っていないことに注意してください。新しいオプションの作者は、明示的にDHC WGまたはIESGに新しいオプションに対するアクションの要求を転送する必要があります。"
    },
    {
      "indent": 3,
      "text": "4. The specification of the new option is reviewed by the IESG. The specification is reviewed by the DHC WG (if it exists) or by the IETF. If the option is accepted for inclusion in the DHCP specification, the specification of the option is published as an RFC. It may be published as either a standards-track or a non-standards-track RFC.",
      "ja": "4.新しいオプションの仕様はIESGによって見直されます。仕様は、（存在する場合）DHC WGによって、またはIETFによってレビューされています。オプションはDHCP仕様に含めるために受理された場合、オプションの仕様はRFCとして公開されています。これは、標準化過程または非標準トラックRFCのどちらかとして公開することができます。"
    },
    {
      "indent": 3,
      "text": "5. At the time of publication as an RFC, IANA assigns a DHCP option number to the new option.",
      "ja": "5. RFCとして公開時点で、IANAは新しいオプションにDHCPオプション番号を割り当てます。"
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "ja": "4.参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Droms, R., \"Dynamic Host Configuration Protocol\", RFC 2131, March 1997.",
      "ja": "[1] Droms、R.、 \"動的ホスト構成プロトコル\"、RFC 2131、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Alexander, S. and R. Droms, \"DHCP Options and BOOTP Vendor Extensions\", RFC 2132, March 1997.",
      "ja": "[2]アレクサンダー、S.とR. Droms、 \"DHCPオプションとBOOTPベンダー拡張機能\"、RFC 2132、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[3] Droms, R. and K. Fong, \"NetWare/IP Domain Name and Information\", RFC 2142, November 1997.",
      "ja": "[3] Droms、R.とK.フォン、 \"NetWareの/ IPドメイン名と情報\"、RFC 2142、1997年11月。"
    },
    {
      "indent": 3,
      "text": "[4] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[4] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Information that creates or updates an option number assignment needs to be authenticated.",
      "ja": "作成またはオプション番号の割り当てを更新した情報は、認証する必要があります。"
    },
    {
      "indent": 3,
      "text": "An analysis of security issues is required for all newly defined DHCP options. The description of security issues in the specification of new options must be as accurate as possible. The specification for a new option may reference the \"Security Considerations\" section in the DHCP specification [1]; e.g. (from \"NetWare/IP Domain Name and Information\" [3]):",
      "ja": "セキュリティ問題の分析はすべて新しく定義されたDHCPオプションのために必要とされます。新しいオプションの仕様におけるセキュリティ問題の記述は、可能な限り正確でなければなりません。新しいオプションの仕様は、DHCP仕様の「セキュリティの考慮事項」のセクションを参照して、[1];例えば（ \"NetWareの/ IPドメイン名と情報\" から[3]）："
    },
    {
      "indent": 6,
      "text": "DHCP currently provides no authentication or security mechanisms. Potential exposures to attack are discussed in section 7 of the DHCP protocol specification [RFC 2131].",
      "ja": "DHCPは現在、認証やセキュリティメカニズムを提供していません。攻撃に対する潜在的なエクスポージャーは、DHCPプロトコル仕様[RFC 2131]のセクション7に記載されています。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "RFC 2132 provided guidance to the IANA on the procedure it should follow when assigning option numbers for new DHCP options. This document updates and replaces those instructions. In particular, IANA is requested to assign DHCP option numbers only for options that have been approved for publication as RFCs; i.e., documents that have been approved through \"IETF consensus\" as defined in RFC 2434 [4].",
      "ja": "RFC 2132には、新しいDHCPオプションのオプション番号を割り当てるときに、それは従うべき手順にIANAへの指導を提供します。このドキュメントの更新とは、それらの命令を置き換えます。具体的には、IANAはRFCとして公表のために承認されているオプションのためのDHCPオプション番号を割り当てるように要求されます。即ち、RFC 2434で定義される「IETFコンセンサス」を介して承認された文書[4]。"
    },
    {
      "indent": 0,
      "text": "7. Author's Address",
      "section_title": true,
      "ja": "7.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ralph Droms Computer Science Department 323 Dana Engineering Bucknell University Lewisburg, PA 17837",
      "ja": "ラルフDromsコンピュータサイエンス学部323ダナエンジニアリングバックネル大学ルイスバーグ、PA 17837"
    },
    {
      "indent": 3,
      "text": "Phone: (717) 524-1145 EMail: droms@bucknell.edu",
      "ja": "電話：（717）524-1145 Eメール：droms@bucknell.edu"
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}