{
  "title": {
    "text": "RFC 2423 - VPIM Voice Message MIME Sub-type Registration",
    "ja": "RFC 2423 - VPIMボイスメッセージMIMEサブタイプ登録"
  },
  "number": 2423,
  "created_at": "2019-10-24 11:28:28.612455+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         G. Vaudreuil\nRequest for Comments: 2423                             Lucent Technologies\nObsoletes: 1911                                                 G. Parsons\nCategory: Standards Track                                 Northern Telecom\n                                                            September 1998",
      "raw": true
    },
    {
      "indent": 23,
      "text": "    VPIM Voice Message\nMIME Sub-type Registration",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Overview",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes the registration of the MIME sub-type multipart/voice-message for use with the Voice Profile for Internet Mail (VPIM). A full description of usage can be found in the VPIM v2 specification.",
      "ja": "この文書は、インターネットメール（VPIM）用の音声プロファイルで使用するためのMIMEサブタイプマルチパート/音声メッセージの登録について説明します。使用の完全な説明は、VPIM v2の仕様に見出すことができます。"
    },
    {
      "indent": 0,
      "text": "1. Abstract",
      "section_title": true,
      "ja": "1.要約"
    },
    {
      "indent": 3,
      "text": "This document describes the registration of the MIME sub-type multipart/voice-message for use with the Voice Profile for Internet Mail (VPIM). A full description of usage can be found in the VPIM v2 specification [VPIM2]. This document revises an earlier sub-type registration in RFC 1911 [VPIM1].",
      "ja": "この文書は、インターネットメール（VPIM）用の音声プロファイルで使用するためのMIMEサブタイプマルチパート/音声メッセージの登録について説明します。使用の完全な説明は、VPIM v2の仕様[VPIM2]に見出すことができます。この文書では、[VPIM1] RFC 1911年以前のサブタイプの登録を修正します。"
    },
    {
      "indent": 0,
      "text": "2. VPIM Scope",
      "section_title": true,
      "ja": "2. VPIMスコープ"
    },
    {
      "indent": 3,
      "text": "The VPIM specification defines a restricted profile of the Internet multimedia messaging protocols for use between voice processing platforms. These platforms have historically been special-purpose computers and often do not have the same facilities normally associated with a traditional Internet Email-capable computer. As a result, VPIM also specifies additional functionality as it is needed. The profile is intended to specify the minimum common set of features to allow interworking between compliant systems.",
      "ja": "VPIM仕様では、音声処理プラットフォーム間での使用のためのインターネットのマルチメディア・メッセージング・プロトコルの制限されたプロファイルを定義します。これらのプラットフォームは、歴史的に特別な目的のコンピュータとなっていると、多くの場合、通常、従来のインターネットメール対応のコンピュータに関連付けられている同じ施設を持っていません。その結果、VPIMも、それを必要とするなどの追加機能を指定します。プロファイルは、準拠したシステム間のインターワーキングを可能にするための機能の最小共通セットを指定することを意図しています。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [REQ].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[REQ]で説明されるように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Voice Message Interchange",
      "section_title": true,
      "ja": "3.ボイスメッセージインターチェンジ"
    },
    {
      "indent": 0,
      "text": "3.1 multipart/voice-message",
      "section_title": true,
      "ja": "3.1マルチパート/ボイスメッセージ"
    },
    {
      "indent": 3,
      "text": "The MIME sub-type multipart/voice-message is defined to hold specific media contents that are interchanged in messages between voice messaging systems described in [VPIM2]. Essentially, the sub-type provides a simple wrapper that easily identifies the entire content as being the components of a single voice message. The sub-type is identical in semantics and syntax to multipart/mixed, as defined in [MIME2]. As such, it may be safely interpreted as a multipart/mixed by systems that do not understand the sub-type (only the identification as a voice message would be lost).",
      "ja": "MIMEサブタイプマルチパート/ボイスメッセージは、[VPIM2]に記載のボイスメッセージシステムとの間のメッセージで交換される特定のメディアコンテンツを保持するために定義されています。本質的に、サブタイプを容易に単一のボイスメッセージの構成要素であるとして全体の内容を識別する単純なラッパーを提供します。サブタイプは、[MIME2]で定義されるように、multipart / mixedのために意味論と構文に同一です。このように、安全に、サブタイプを理解していないシステムによって混合マルチパート/（音声メッセージとしてのみ識別が失われる）として解釈することができます。"
    },
    {
      "indent": 3,
      "text": "This mechanism allows the insertion of an explanatory preamble (e.g. VPIM voice message attached) for recipients who read the message with pre-MIME software, since the preamble will be ignored by MIME-compliant software.",
      "ja": "プリアンブルはMIME準拠ソフトウェアによって無視されるので、このメカニズムは、事前MIMEソフトウェアでメッセージを読む受信者の説明プリアンブル（添付例えばVPIM音声メッセージ）の挿入を可能にします。"
    },
    {
      "indent": 3,
      "text": "In addition to the MIME required boundary parameter, a version parameter is also required for this sub-type. This is to distinguish, this refinement of the sub-type from the previous definition in [VPIM1]. The value of the version parameter is \"2.0\" if the content conforms to the requirements of [VPIM2]. Should there be further revisions of this content type, there MUST be backwards compatibility (i.e. systems implementing version n can read version 2, and systems implementing version 2 can read version 2 contents within a version n). The default version value (when the parameter is missing) is 1, indicating the content conforms to the requirements of [VPIM1].",
      "ja": "MIME必要な境界パラメータに加えて、バージョンパラメータは、このサブタイプのために必要とされます。これは、[VPIM1]の前の定義から、サブタイプのこの改良を区別することです。コンテンツは、[VPIM2]の要件に準拠している場合、バージョンパラメータの値が「2.0」です。このコンテンツタイプの更なる改訂があるべきで、後方互換性（バージョンnを実装即ちシステムがバージョン2を読み取ることができ、およびバージョン2を実装するシステムがバージョンn内のバージョン2つの内容を読み取ることができる）が存在していなければなりません。デフォルトのバージョンの値（パラメータが欠落している）コンテンツ[VPIM1]の要件に適合するを示し、1です。"
    },
    {
      "indent": 3,
      "text": "[VPIM2] describes the restriction that only specific media types,\napplicable to voice messaging, are valid `next-level' contents of\nthis sub-type (when version=2.0).  They are: audio/*, image/*,\nmessage/rfc822 and application/directory.  The multipart provides for\nthe packaging of as many of these contents as is necessary.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3.2 VPIM v2 Usage",
      "section_title": true,
      "ja": "3.2 VPIM v2の使い方"
    },
    {
      "indent": 3,
      "text": "The multipart/voice-message sub-type is a primary component of the VPIM specification [VPIM2]. All VPIM Messages MUST contain this sub-type to identify the wrapping of a voice message. The contents of this wrapper can vary from only one audio/32KADPCM content to a complex set of related and nested contents.",
      "ja": "マルチパート/ボイスメッセージのサブタイプは、VPIM仕様[VPIM2]の主要成分です。すべてのVPIMメッセージは音声メッセージのラッピングを識別するために、このサブタイプを含まなければなりません。このラッパーの内容は、関連するとネストされたコンテンツの複雑なセットにのみつのオーディオ/ 32KADPCMコンテンツから変化させることができます。"
    },
    {
      "indent": 3,
      "text": "Typically, if more than one audio segment is present, the first is the spoken name of the originator, the second is the spoken subject, and the third is the voice message itself. This order, however, MUST NOT be assumed in any case. Further, the order that the contents appear SHOULD be the order in which they are presented to the user.",
      "ja": "複数のオーディオセグメントが存在する場合、典型的には、まず、発信者の音声名は、第二は、被写体話され、そして第三は、音声メッセージ自体です。この順序は、しかし、どのような場合に想定されてはなりません。さらに、内容が表示される順序は、それらがユーザに提示される順序であるべきです。"
    },
    {
      "indent": 3,
      "text": "The spoken name segment, if available, shall contain the name of the message sender in the voice of the sender. The length of the spoken name segment must not exceed 12 seconds.",
      "ja": "音声名セグメントは、利用可能な場合、送信者の声でメッセージの送信者の名前を含まなければなりません。音声名セグメントの長さは12秒を超えてはなりません。"
    },
    {
      "indent": 3,
      "text": "The spoken subject segment, if available, shall contain the subject of the message sender in the voice of the sender. The length of the spoken subject segment must not exceed 20 seconds.",
      "ja": "発話主題セグメントは、利用可能な場合、送信者の声でメッセージ送信者の主題を含まなければなりません。話さ被験者セグメントの長さが20秒を超えてはなりません。"
    },
    {
      "indent": 3,
      "text": "The directory information part, if present, will contain information specific to the orginator of the voice message.",
      "ja": "ディレクトリ情報の一部は、存在する場合、音声メッセージの発信元に固有の情報が含まれています。"
    },
    {
      "indent": 3,
      "text": "Refer to the VPIM v2 Specification for details on proper usage.",
      "ja": "適切な使用法の詳細については、VPIM v2の仕様を参照してください。"
    },
    {
      "indent": 0,
      "text": "4. IANA Registration",
      "section_title": true,
      "ja": "4. IANA登録"
    },
    {
      "indent": 3,
      "text": "To: ietf-types@iana.org Subject: Registration of MIME media type multipart/voice-message",
      "ja": "To：ietf-types@iana.org件名：MIMEメディアタイプマルチパート/音声メッセージの登録"
    },
    {
      "indent": 3,
      "text": "MIME media type name: multipart",
      "ja": "MIMEメディアタイプ名：マルチパート"
    },
    {
      "indent": 3,
      "text": "MIME subtype name: voice-message",
      "ja": "MIMEサブタイプ名：音声メッセージ"
    },
    {
      "indent": 3,
      "text": "Required parameters: boundary, version",
      "ja": "必須パラメータ：境界、バージョン"
    },
    {
      "indent": 6,
      "text": "The use of boundary is defined in [MIME2]",
      "ja": "境界の使用は、[MIME2]で定義されています"
    },
    {
      "indent": 6,
      "text": "The version parameter that contains the value \"2.0\" if enclosed content conforms to [VPIM2]. The absence of this parameter indicates conformance to the previous version defined in RFC 1911 [VPIM1].",
      "ja": "値「2.0」が含まれているバージョンパラメータ囲まれたコンテンツは、[VPIM2]に準拠している場合。このパラメータが存在しない場合は、RFC 1911 [VPIM1]で定義された以前のバージョンへの適合性を示します。"
    },
    {
      "indent": 3,
      "text": "Optional parameters: none",
      "ja": "オプションのパラメータ：なし"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: 7bit, 8bit or Binary",
      "ja": "エンコードの考慮事項：7ビット、8ビットまたはバイナリ"
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "ja": "セキュリティの考慮事項："
    },
    {
      "indent": 6,
      "text": "This definition identifies the content as being a voice message. In some environments (though likely not the majority), the loss of the anonymity of the content may be a security issue.",
      "ja": "この定義は、音声メッセージとしてコンテンツを識別します。一部の環境（そうではないが大半）では、コンテンツの匿名性の喪失は、セキュリティ上の問題になることがあります。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations:",
      "ja": "相互運用性の考慮事項："
    },
    {
      "indent": 6,
      "text": "Systems developed to conform with [VPIM1] may not conform to this registration. Specifically, the required version will likely be absent, in this case the recipient system should still be able to accept the message and will be able to handle the content. The VPIM v1 positional identification, however, would likely be lost.",
      "ja": "[VPIM1]に適合するように開発されたシステムは、この登録に適合しない場合があります。具体的には、必要なバージョンは、おそらく、この場合、受信側システムは、まだメッセージを受け入れることができなければならず、コンテンツを扱うことができるようになり、存在しないであろう。 VPIM v1の位置特定は、しかし、可能性が失われてしまいます。"
    },
    {
      "indent": 3,
      "text": "Published specification: This document [VPIM2]",
      "ja": "公開された仕様：このドキュメント[VPIM2]"
    },
    {
      "indent": 3,
      "text": "Applications which use this media type:",
      "ja": "このメディアタイプを使用するアプリケーション："
    },
    {
      "indent": 5,
      "text": "Primarily voice messaging",
      "ja": "主に音声メッセージング"
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "ja": "追加情報："
    },
    {
      "indent": 5,
      "text": "Magic number(s): ? File extension(s): .VPM Macintosh File Type Code(s): VPIM",
      "ja": "マジックナンバー（S）：？ファイルの拡張子（S）：.VPMマッキントッシュファイルタイプコード（S）：VPIM"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "ja": "詳細のために連絡する人とEメールアドレス："
    },
    {
      "indent": 5,
      "text": "Glenn W. Parsons Glenn.Parsons@Nortel.ca",
      "ja": "グレンW.パーソンズGlenn.Parsons@Nortel.ca"
    },
    {
      "indent": 5,
      "text": "Gregory M. Vaudreuil Greg.Vaudreuil@Octel.Com",
      "ja": "グレゴリーM.ヴォードルイユGreg.Vaudreuil@Octel.Com"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図している用法：COMMON"
    },
    {
      "indent": 3,
      "text": "Author/Change controller:",
      "ja": "著者/変更コントローラ："
    },
    {
      "indent": 5,
      "text": "Glenn W. Parsons & Gregory M. Vaudreuil",
      "ja": "グレンW.パーソンズ＆グレゴリーM.ヴォードルイユ"
    },
    {
      "indent": 0,
      "text": "5. Authors' Addresses",
      "section_title": true,
      "ja": "5.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Glenn W. Parsons Northern Telecom P.O. Box 3511, Station C Ottawa, ON K1Y 4H7 Canada",
      "ja": "グレンW.パーソンズノーザン・テレコムの私書箱K1Y 4H7カナダのボックス3511、駅のCオタワ、"
    },
    {
      "indent": 3,
      "text": "Phone: +1-613-763-7582 Fax: +1-613-763-4461 EMail: Glenn.Parsons@Nortel.ca",
      "ja": "電話：+ 1-613-763-7582ファックス：+ 1-613-763-4461 Eメール：Glenn.Parsons@Nortel.ca"
    },
    {
      "indent": 3,
      "text": "Gregory M. Vaudreuil Lucent Technologies 17080 Dallas Parkway Dallas, TX 75248-1905 United States",
      "ja": "グレゴリーM.ヴォードルイユルーセント・テクノロジーズ17080のダラスパークウェイダラス、TX 75248から1905米国"
    },
    {
      "indent": 3,
      "text": "Phone/Fax: +1-972-733-2722 EMail: GregV@Lucent.Com",
      "ja": "電話/ FAX：+ 1-972-733-2722 Eメール：GregV@Lucent.Com"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 3,
      "text": "[MIME2] Freed, N., and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part Two: Media Types \", RFC 2046, November 1996.",
      "ja": "[MIME2]解放され、N.、およびN. Borenstein、 \"マルチパーパスインターネットメールエクステンション（MIME）パート2：メディアタイプ\"、RFC 2046、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[MIME4] Freed, N., Klensin, J., and J. Postel, \"Multipurpose Internet Mail Extensions (MIME) Part Four: Registration Procedures\", RFC 2048, November 1996.",
      "ja": "[MIME4]解放され、N.、Klensin、J.、およびJ.ポステル、 \"多目的インターネットメール拡張（MIME）第四部：登録手順\"、RFC 2048、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[VPIM1] Vaudreuil, G., \"Voice Profile for Internet Mail\", RFC 1911, February 1996.",
      "ja": "[VPIM1]ヴォードルイユ、G.、 \"インターネットメール用の音声プロファイル\"、RFC 1911、1996年2月。"
    },
    {
      "indent": 3,
      "text": "[VPIM2] Vaudreuil, G., and G. Parsons, \"Voice Profile for Internet Mail - version 2\", RFC 2421, September 1998.",
      "ja": "[VPIM2]ヴォードルイユ、G.、およびG.パーソンズ、 \"インターネットメール用の音声プロファイル - バージョン2\"、RFC 2421、1998年9月。"
    },
    {
      "indent": 3,
      "text": "[REQ] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[REQ]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "ja": "7.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implmentation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、そのimplmentationを支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\"",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています権利または特定の目的に対する商品性または適合性の黙示の保証を侵害し。」"
    }
  ]
}