{
  "title": {
    "text": "RFC 2463 - Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6) Specification",
    "ja": "RFC 2463 - インターネットプロトコルバージョン6（IPv6）仕様のインターネット制御メッセージプロトコル（ICMPv6）"
  },
  "number": 2463,
  "created_at": "2020-08-16 20:10:31.690325+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           A. Conta\nRequest for Comments: 2463                                        Lucent\nObsoletes: 1885                                               S. Deering\nCategory: Standards Track                                  Cisco Systems\n                                                           December 1998",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "Internet Control Message Protocol (ICMPv6) for the Internet Protocol Version 6 (IPv6) Specification",
      "ja": "インターネットプロトコルバージョン6（IPv6）仕様のインターネット制御メッセージプロトコル（ICMPv6）"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document specifies a set of Internet Control Message Protocol (ICMP) messages for use with version 6 of the Internet Protocol (IPv6).",
      "ja": "このドキュメントでは、インターネットプロトコル（IPv6）のバージョン6で使用するインターネット制御メッセージプロトコル（ICMP）メッセージのセットを指定します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 6,
      "text": "1. Introduction........................................2\n2. ICMPv6 (ICMP for IPv6)..............................2\n      2.1 Message General Format.......................2\n      2.2 Message Source Address Determination.........3\n      2.3 Message Checksum Calculation.................4\n      2.4 Message Processing Rules.....................4\n3. ICMPv6 Error Messages...............................6\n      3.1 Destination Unreachable Message..............6\n      3.2 Packet Too Big Message...................... 8\n      3.3 Time Exceeded Message....................... 9\n      3.4 Parameter Problem Message...................10\n4. ICMPv6 Informational Messages......................11\n      4.1 Echo Request Message........................11\n      4.2 Echo Reply Message..........................12\n5. Security Considerations............................13\n6. References.........................................14\n7. Acknowledgments....................................15",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "8. Authors' Addresses.................................16\nAppendix A - Changes since RFC 1885...................17\nFull Copyright Statement..............................18",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Internet Protocol, version 6 (IPv6) is a new version of IP. IPv6 uses the Internet Control Message Protocol (ICMP) as defined for IPv4 [RFC-792], with a number of changes. The resulting protocol is called ICMPv6, and has an IPv6 Next Header value of 58.",
      "ja": "インターネットプロトコルバージョン6（IPv6）は、IPの新しいバージョンです。 IPv6は、IPv4 [RFC-792]で定義されているインターネット制御メッセージプロトコル（ICMP）を使用しますが、いくつかの変更があります。結果のプロトコルはICMPv6と呼ばれ、IPv6 Next Header値は58です。"
    },
    {
      "indent": 3,
      "text": "This document describes the format of a set of control messages used in ICMPv6. It does not describe the procedures for using these messages to achieve functions like Path MTU discovery; such procedures are described in other documents (e.g., [PMTU]). Other documents may also introduce additional ICMPv6 message types, such as Neighbor Discovery messages [IPv6-DISC], subject to the general rules for ICMPv6 messages given in section 2 of this document.",
      "ja": "このドキュメントでは、ICMPv6で使用される一連の制御メッセージの形式について説明します。これらのメッセージを使用してパスMTU検出などの機能を実現する手順については説明しません。そのような手順は、他の文書（[PMTU]など）に記載されています。他のドキュメントでは、このドキュメントのセクション2に記載されているICMPv6メッセージの一般的なルールに従って、近隣探索メッセージ[IPv6-DISC]などの追加のICMPv6メッセージタイプを紹介する場合もあります。"
    },
    {
      "indent": 3,
      "text": "Terminology defined in the IPv6 specification [IPv6] and the IPv6 Routing and Addressing specification [IPv6-ADDR] applies to this document as well.",
      "ja": "IPv6仕様[IPv6]およびIPv6ルーティングおよびアドレッシング仕様[IPv6-ADDR]で定義されている用語は、このドキュメントにも適用されます。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC-2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 [RFC-2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. ICMPv6 (ICMP for IPv6)",
      "section_title": true,
      "ja": "2. ICMPv6（IPv6のICMP）"
    },
    {
      "indent": 3,
      "text": "ICMPv6 is used by IPv6 nodes to report errors encountered in processing packets, and to perform other internet-layer functions, such as diagnostics (ICMPv6 \"ping\"). ICMPv6 is an integral part of IPv6 and MUST be fully implemented by every IPv6 node.",
      "ja": "ICMPv6は、パケットの処理で発生したエラーを報告し、診断（ICMPv6 \"ping\"）などの他のインターネット層機能を実行するためにIPv6ノードによって使用されます。 ICMPv6はIPv6の不可欠な部分であり、すべてのIPv6ノードによって完全に実装する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1 Message General Format",
      "section_title": true,
      "ja": "2.1 メッセージの一般的な形式"
    },
    {
      "indent": 3,
      "text": "ICMPv6 messages are grouped into two classes: error messages and informational messages. Error messages are identified as such by having a zero in the high-order bit of their message Type field values. Thus, error messages have message Types from 0 to 127; informational messages have message Types from 128 to 255.",
      "ja": "ICMPv6メッセージは、エラーメッセージと情報メッセージの2つのクラスに分類されます。エラーメッセージは、メッセージのTypeフィールド値の上位ビットがゼロであることによって識別されます。したがって、エラーメッセージには0〜127のメッセージタイプがあります。情報メッセージのメッセージタイプは128〜255です。"
    },
    {
      "indent": 3,
      "text": "This document defines the message formats for the following ICMPv6 messages:",
      "ja": "このドキュメントでは、次のICMPv6メッセージのメッセージ形式を定義しています。"
    },
    {
      "indent": 8,
      "text": "ICMPv6 error messages:",
      "ja": "ICMPv6エラーメッセージ："
    },
    {
      "indent": 13,
      "text": "1 Destination Unreachable (see section 3.1) 2 Packet Too Big (see section 3.2) 3 Time Exceeded (see section 3.3) 4 Parameter Problem (see section 3.4)",
      "ja": "1到達不能な宛先（セクション3.1を参照）2パケットが大きすぎます（セクション3.2を参照）3時間超過（セクション3.3を参照）4パラメータの問題（セクション3.4を参照）"
    },
    {
      "indent": 8,
      "text": "ICMPv6 informational messages:",
      "ja": "ICMPv6情報メッセージ："
    },
    {
      "indent": 13,
      "text": "128 Echo Request (see section 4.1) 129 Echo Reply (see section 4.2)",
      "ja": "128エコー要求（セクション4.1を参照）129エコー応答（セクション4.2を参照）"
    },
    {
      "indent": 3,
      "text": "Every ICMPv6 message is preceded by an IPv6 header and zero or more IPv6 extension headers. The ICMPv6 header is identified by a Next Header value of 58 in the immediately preceding header. (NOTE: this is different than the value used to identify ICMP for IPv4.)",
      "ja": "すべてのICMPv6メッセージの前には、IPv6ヘッダーと0個以上のIPv6拡張ヘッダーが付いています。 ICMPv6ヘッダーは、直前のヘッダーの58の次ヘッダー値によって識別されます。 （注：これは、IPv4のICMPを識別するために使用される値とは異なります。）"
    },
    {
      "indent": 3,
      "text": "The ICMPv6 messages have the following general format:",
      "ja": "ICMPv6メッセージの形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     Code      |          Checksum             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n+                         Message Body                          +\n|                                                               |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The type field indicates the type of the message. Its value determines the format of the remaining data.",
      "ja": "タイプフィールドは、メッセージのタイプを示します。その値は、残りのデータのフォーマットを決定します。"
    },
    {
      "indent": 3,
      "text": "The code field depends on the message type. It is used to create an additional level of message granularity.",
      "ja": "コードフィールドはメッセージタイプによって異なります。これは、メッセージの細分性の追加レベルを作成するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The checksum field is used to detect data corruption in the ICMPv6 message and parts of the IPv6 header.",
      "ja": "チェックサムフィールドは、ICMPv6メッセージおよびIPv6ヘッダーの一部のデータ破損を検出するために使用されます。"
    },
    {
      "indent": 0,
      "text": "2.2 Message Source Address Determination",
      "section_title": true,
      "ja": "2.2 メッセージ送信元アドレスの決定"
    },
    {
      "indent": 3,
      "text": "A node that sends an ICMPv6 message has to determine both the Source and Destination IPv6 Addresses in the IPv6 header before calculating the checksum. If the node has more than one unicast address, it must choose the Source Address of the message as follows:",
      "ja": "ICMPv6メッセージを送信するノードは、チェックサムを計算する前に、IPv6ヘッダーの送信元IPv6アドレスと宛先IPv6アドレスの両方を決定する必要があります。ノードに複数のユニキャストアドレスがある場合、次のようにメッセージの送信元アドレスを選択する必要があります。"
    },
    {
      "indent": 4,
      "text": "(a) If the message is a response to a message sent to one of the node's unicast addresses, the Source Address of the reply must be that same address.",
      "ja": "（a）メッセージがノードのユニキャストアドレスの1つに送信されたメッセージへの応答である場合、応答の送信元アドレスは同じアドレスでなければなりません。"
    },
    {
      "indent": 4,
      "text": "(b) If the message is a response to a message sent to a multicast or anycast group in which the node is a member, the Source Address of the reply must be a unicast address belonging to the interface on which the multicast or anycast packet was received.",
      "ja": "（b）メッセージが、ノードがメンバーであるマルチキャストまたはエニーキャストグループに送信されたメッセージへの応答である場合、応答の送信元アドレスは、マルチキャストまたはエニーキャストパケットがあったインターフェイスに属するユニキャストアドレスである必要があります。受け取った。"
    },
    {
      "indent": 4,
      "text": "(c) If the message is a response to a message sent to an address that does not belong to the node, the Source Address should be that unicast address belonging to the node that will be most helpful in diagnosing the error. For example, if the message is a response to a packet forwarding action that cannot complete successfully, the Source Address should be a unicast address belonging to the interface on which the packet forwarding failed.",
      "ja": "（c）メッセージがノードに属していないアドレスに送信されたメッセージに対する応答である場合、送信元アドレスは、エラーの診断に最も役立つノードに属するユニキャストアドレスである必要があります。たとえば、メッセージが正常に完了できないパケット転送アクションへの応答である場合、送信元アドレスは、パケット転送が失敗したインターフェイスに属するユニキャストアドレスである必要があります。"
    },
    {
      "indent": 4,
      "text": "(d) Otherwise, the node's routing table must be examined to determine which interface will be used to transmit the message to its destination, and a unicast address belonging to that interface must be used as the Source Address of the message.",
      "ja": "（d）それ以外の場合は、ノードのルーティングテーブルを調べて、メッセージを宛先に送信するために使用するインターフェイスを決定し、そのインターフェイスに属するユニキャストアドレスをメッセージの送信元アドレスとして使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.3 Message Checksum Calculation",
      "section_title": true,
      "ja": "2.3 メッセージチェックサムの計算"
    },
    {
      "indent": 3,
      "text": "The checksum is the 16-bit one's complement of the one's complement sum of the entire ICMPv6 message starting with the ICMPv6 message type field, prepended with a \"pseudo-header\" of IPv6 header fields, as specified in [IPv6, section 8.1]. The Next Header value used in the pseudo-header is 58. (NOTE: the inclusion of a pseudo-header in the ICMPv6 checksum is a change from IPv4; see [IPv6] for the rationale for this change.)",
      "ja": "チェックサムは、ICMPv6メッセージタイプフィールドで始まるICMPv6メッセージ全体の1の補数の16ビットの1の補数であり、[IPv6、セクション8.1]で指定されているように、IPv6ヘッダーフィールドの「疑似ヘッダー」が前に付加されます。疑似ヘッダーで使用される次のヘッダー値は58です（注：ICMPv6チェックサムに疑似ヘッダーを含めることはIPv4からの変更です。この変更の根拠については[IPv6]を参照してください。）"
    },
    {
      "indent": 3,
      "text": "For computing the checksum, the checksum field is set to zero.",
      "ja": "チェックサムを計算するために、チェックサムフィールドはゼロに設定されます。"
    },
    {
      "indent": 0,
      "text": "2.4 Message Processing Rules",
      "section_title": true,
      "ja": "2.4 メッセージ処理ルール"
    },
    {
      "indent": 3,
      "text": "Implementations MUST observe the following rules when processing ICMPv6 messages (from [RFC-1122]):",
      "ja": "実装では、ICMPv6メッセージを処理する際に（[RFC-1122]から）次の規則を遵守する必要があります。"
    },
    {
      "indent": 4,
      "text": "(a) If an ICMPv6 error message of unknown type is received, it MUST be passed to the upper layer.",
      "ja": "（a）不明なタイプのICMPv6エラーメッセージを受信した場合、それを上位層に渡す必要があります。"
    },
    {
      "indent": 4,
      "text": "(b) If an ICMPv6 informational message of unknown type is received, it MUST be silently discarded.",
      "ja": "（b）未知のタイプのICMPv6情報メッセージが受信された場合、それは黙って破棄されなければならない（MUST）。"
    },
    {
      "indent": 4,
      "text": "(c) Every ICMPv6 error message (type < 128) includes as much of the IPv6 offending (invoking) packet (the packet that caused the error) as will fit without making the error message packet exceed the minimum IPv6 MTU [IPv6].",
      "ja": "（c）すべてのICMPv6エラーメッセージ（タイプ<128）には、IPv6違反（呼び出し）パケット（エラーの原因となったパケット）が含まれ、エラーメッセージパケットが最小IPv6 MTU [IPv6]を超えることはありません。"
    },
    {
      "indent": 4,
      "text": "(d) In those cases where the internet-layer protocol is required to pass an ICMPv6 error message to the upper-layer process, the upper-layer protocol type is extracted from the original packet (contained in the body of the ICMPv6 error message) and used to select the appropriate upper-layer process to handle the error.",
      "ja": "（d）ICMPv6エラーメッセージを上位層プロセスに渡すためにインターネット層プロトコルが必要な場合は、上位層プロトコルタイプが元のパケットから抽出されます（ICMPv6エラーメッセージの本文に含まれています）。エラーを処理する適切な上位層プロセスを選択するために使用されます。"
    },
    {
      "indent": 8,
      "text": "If the original packet had an unusually large amount of extension headers, it is possible that the upper-layer protocol type may not be present in the ICMPv6 message, due to truncation of the original packet to meet the minimum IPv6 MTU [IPv6] limit. In that case, the error message is silently dropped after any IPv6-layer processing.",
      "ja": "元のパケットに異常に大量の拡張ヘッダーが含まれていた場合、元のパケットが最小IPv6 MTU [IPv6]の制限を満たすために切り捨てられるため、ICMPv6メッセージに上位層プロトコルタイプが存在しない可能性があります。その場合、エラーメッセージは、IPv6レイヤーの処理後に警告なしにドロップされます。"
    },
    {
      "indent": 4,
      "text": "(e) An ICMPv6 error message MUST NOT be sent as a result of receiving:",
      "ja": "（e）受信の結果として、ICMPv6エラーメッセージを送信してはなりません（MUST NOT）："
    },
    {
      "indent": 9,
      "text": "(e.1) an ICMPv6 error message, or",
      "ja": "（e.1）ICMPv6エラーメッセージ、または"
    },
    {
      "indent": 9,
      "text": "(e.2) a packet destined to an IPv6 multicast address (there are two exceptions to this rule: (1) the Packet Too Big Message - Section 3.2 - to allow Path MTU discovery to work for IPv6 multicast, and (2) the Parameter Problem Message, Code 2 - Section 3.4 - reporting an unrecognized IPv6 option that has the Option Type highest-order two bits set to 10), or",
      "ja": "（e.2）IPv6マルチキャストアドレス宛のパケット（このルールには2つの例外があります：（1）パケットが大きすぎるメッセージ-セクション3.2-パスMTUディスカバリがIPv6マルチキャストで機能できるようにすること、および（2）パラメータ問題メッセージ、コード2-セクション3.4-オプションタイプの最上位2ビットが10に設定されている認識されないIPv6オプションの報告）、または"
    },
    {
      "indent": 9,
      "text": "(e.3) a packet sent as a link-layer multicast, (the exception from e.2 applies to this case too), or",
      "ja": "（e.3）リンク層マルチキャストとして送信されたパケット（e.2からの例外はこの場合にも適用されます）、または"
    },
    {
      "indent": 9,
      "text": "(e.4) a packet sent as a link-layer broadcast, (the exception from e.2 applies to this case too), or",
      "ja": "（e.4）リンク層ブロードキャストとして送信されたパケット（e.2からの例外はこの場合にも適用されます）、または"
    },
    {
      "indent": 9,
      "text": "(e.5) a packet whose source address does not uniquely identify a single node -- e.g., the IPv6 Unspecified Address, an IPv6 multicast address, or an address known by the ICMP message sender to be an IPv6 anycast address.",
      "ja": "（e.5）送信元アドレスが単一のノードを一意に識別しないパケット-たとえば、IPv6未指定アドレス、IPv6マルチキャストアドレス、またはICMPメッセージ送信者がIPv6エニーキャストアドレスであることがわかっているアドレス。"
    },
    {
      "indent": 4,
      "text": "(f) Finally, in order to limit the bandwidth and forwarding costs incurred sending ICMPv6 error messages, an IPv6 node MUST limit the rate of ICMPv6 error messages it sends. This situation may occur when a source sending a stream of erroneous packets fails to heed the resulting ICMPv6 error messages. There are a variety of ways of implementing the rate-limiting function, for example:",
      "ja": "（f）最後に、ICMPv6エラーメッセージの送信で発生する帯域幅と転送コストを制限するために、IPv6ノードは送信するICMPv6エラーメッセージのレートを制限する必要があります。この状況は、エラーのあるパケットのストリームを送信するソースが、結果のICMPv6エラーメッセージに留意できない場合に発生する可能性があります。レート制限機能を実装するには、さまざまな方法があります。次に例を示します。"
    },
    {
      "indent": 9,
      "text": "(f.1) Timer-based - for example, limiting the rate of transmission of error messages to a given source, or to any source, to at most once every T milliseconds.",
      "ja": "（f.1）タイマーベース-たとえば、特定のソースまたは任意のソースへのエラーメッセージの送信レートを、最大でTミリ秒に1回に制限します。"
    },
    {
      "indent": 9,
      "text": "(f.2) Bandwidth-based - for example, limiting the rate at which error messages are sent from a particular interface to some fraction F of the attached link's bandwidth.",
      "ja": "（f.2）帯域幅ベース-たとえば、エラーメッセージが特定のインターフェイスから送信されるレートを、接続されているリンクの帯域幅の一部Fに制限します。"
    },
    {
      "indent": 8,
      "text": "The limit parameters (e.g., T or F in the above examples) MUST be configurable for the node, with a conservative default value (e.g., T = 1 second, NOT 0 seconds, or F = 2 percent, NOT 100 percent).",
      "ja": "制限パラメーター（上記の例ではTまたはF）は、控えめなデフォルト値（T = 1秒、NOT 0秒、またはF = 2パーセント、NOT 100パーセント）でノードに対して構成可能である必要があります。"
    },
    {
      "indent": 3,
      "text": "The following sections describe the message formats for the above ICMPv6 messages.",
      "ja": "以下のセクションでは、上記のICMPv6メッセージのメッセージ形式について説明します。"
    },
    {
      "indent": 0,
      "text": "3. ICMPv6 Error Messages",
      "section_title": true,
      "ja": "3. ICMPv6エラーメッセージ"
    },
    {
      "indent": 0,
      "text": "3.1 Destination Unreachable Message",
      "section_title": true,
      "ja": "3.1 宛先到達不能メッセージ"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     Code      |          Checksum             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                             Unused                            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    As much of invoking packet                 |\n+                as will fit without the ICMPv6 packet          +\n|                exceeding the minimum IPv6 MTU [IPv6]          |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "IPv6 Fields:",
      "ja": "IPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Destination Address",
      "ja": "宛先アドレス"
    },
    {
      "indent": 18,
      "text": "Copied from the Source Address field of the invoking packet.",
      "ja": "呼び出しパケットの送信元アドレスフィールドからコピーされます。"
    },
    {
      "indent": 3,
      "text": "ICMPv6 Fields:",
      "ja": "ICMPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Type 1",
      "ja": "タイプ1"
    },
    {
      "indent": 3,
      "text": "Code 0 - no route to destination 1 - communication with destination administratively prohibited 2 - (not assigned) 3 - address unreachable 4 - port unreachable",
      "ja": "コード0-宛先へのルートがない1-管理上禁止されている宛先との通信2-（割り当てられていない）3-アドレスに到達できない4-ポートに到達できない"
    },
    {
      "indent": 3,
      "text": "Unused This field is unused for all code values. It must be initialized to zero by the sender and ignored by the receiver.",
      "ja": "未使用このフィールドは、すべてのコード値で未使用です。送信者はゼロに初期化し、受信者は無視する必要があります。"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 3,
      "text": "A Destination Unreachable message SHOULD be generated by a router, or by the IPv6 layer in the originating node, in response to a packet that cannot be delivered to its destination address for reasons other than congestion. (An ICMPv6 message MUST NOT be generated if a packet is dropped due to congestion.)",
      "ja": "Destination Unreachableメッセージは、輻輳以外の理由で宛先アドレスに配信できないパケットに応答して、ルーターまたは発信元ノードのIPv6レイヤーによって生成される必要があります（SHOULD）。 （輻輳によりパケットがドロップされた場合、ICMPv6メッセージを生成してはならない（MUST NOT）。"
    },
    {
      "indent": 3,
      "text": "If the reason for the failure to deliver is lack of a matching entry in the forwarding node's routing table, the Code field is set to 0 (NOTE: this error can occur only in nodes that do not hold a \"default route\" in their routing tables).",
      "ja": "配信に失敗した理由が、転送ノードのルーティングテーブルに一致するエントリがない場合、コードフィールドは0に設定されます（注：このエラーは、ルーティングに「デフォルトルート」を保持していないノードでのみ発生する可能性がありますテーブル）。"
    },
    {
      "indent": 3,
      "text": "If the reason for the failure to deliver is administrative prohibition, e.g., a \"firewall filter\", the Code field is set to 1.",
      "ja": "配信に失敗した理由が「ファイアウォールフィルター」などの管理上の禁止である場合、コードフィールドは1に設定されます。"
    },
    {
      "indent": 3,
      "text": "If there is any other reason for the failure to deliver, e.g., inability to resolve the IPv6 destination address into a corresponding link address, or a link-specific problem of some sort, then the Code field is set to 3.",
      "ja": "IPv6宛先アドレスを対応するリンクアドレスに解決できない、またはリンク固有の何らかの問題など、配信に失敗した理由が他にある場合、コードフィールドは3に設定されます。"
    },
    {
      "indent": 3,
      "text": "A destination node SHOULD send a Destination Unreachable message with Code 4 in response to a packet for which the transport protocol (e.g., UDP) has no listener, if that transport protocol has no alternative means to inform the sender.",
      "ja": "トランスポートプロトコルに送信者に通知する代替手段がない場合、宛先ノードは、トランスポートプロトコル（UDPなど）にリスナーがないパケットに応答して、コード4の宛先到達不能メッセージを送信する必要があります（SHOULD）。"
    },
    {
      "indent": 3,
      "text": "Upper layer notification",
      "ja": "上位層通知"
    },
    {
      "indent": 3,
      "text": "A node receiving the ICMPv6 Destination Unreachable message MUST notify the upper-layer process.",
      "ja": "ICMPv6 Destination Unreachableメッセージを受信するノードは、上位層プロセスに通知する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2 Packet Too Big Message",
      "section_title": true,
      "ja": "3.2 パケットが大きすぎるメッセージ"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     Code      |          Checksum             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                             MTU                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    As much of invoking packet                 |\n+               as will fit without the ICMPv6 packet           +\n|               exceeding the minimum IPv6 MTU [IPv6]           |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "IPv6 Fields:",
      "ja": "IPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Destination Address",
      "ja": "宛先アドレス"
    },
    {
      "indent": 18,
      "text": "Copied from the Source Address field of the invoking packet.",
      "ja": "呼び出しパケットの送信元アドレスフィールドからコピーされます。"
    },
    {
      "indent": 3,
      "text": "ICMPv6 Fields:",
      "ja": "ICMPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Type 2",
      "ja": "タイプ2"
    },
    {
      "indent": 3,
      "text": "Code Set to 0 (zero) by the sender and ignored by the receiver",
      "ja": "コードは送信者によって0（ゼロ）に設定され、受信者によって無視されます"
    },
    {
      "indent": 3,
      "text": "MTU The Maximum Transmission Unit of the next-hop link.",
      "ja": "MTUネクストホップリンクの最大転送単位。"
    },
    {
      "indent": 2,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 3,
      "text": "A Packet Too Big MUST be sent by a router in response to a packet that it cannot forward because the packet is larger than the MTU of the outgoing link. The information in this message is used as part of the Path MTU Discovery process [PMTU].",
      "ja": "大きすぎるパケットは、パケットが発信リンクのMTUよりも大きいため転送できないパケットに応答して、ルーターから送信する必要があります。このメッセージの情報は、パスMTUディスカバリプロセス[PMTU]の一部として使用されます。"
    },
    {
      "indent": 3,
      "text": "Sending a Packet Too Big Message makes an exception to one of the rules of when to send an ICMPv6 error message, in that unlike other messages, it is sent in response to a packet received with an IPv6 multicast destination address, or a link-layer multicast or link-layer broadcast address.",
      "ja": "パケットが大きすぎるメッセージを送信すると、ICMPv6エラーメッセージを送信するタイミングの規則の1つに例外が発生します。他のメッセージとは異なり、IPv6マルチキャスト宛先アドレスまたはリンク層で受信されたパケットに応答して送信されます。マルチキャストまたはリンク層のブロードキャストアドレス。"
    },
    {
      "indent": 3,
      "text": "Upper layer notification",
      "ja": "上位層通知"
    },
    {
      "indent": 3,
      "text": "An incoming Packet Too Big message MUST be passed to the upper-layer process.",
      "ja": "着信パケットが大きすぎるメッセージは、上位層プロセスに渡される必要があります。"
    },
    {
      "indent": 0,
      "text": "3.3 Time Exceeded Message",
      "section_title": true,
      "ja": "3.3 時間超過メッセージ"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     Code      |          Checksum             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                             Unused                            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    As much of invoking packet                 |\n+               as will fit without the ICMPv6 packet           +\n|               exceeding the minimum IPv6 MTU [IPv6]           |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "IPv6 Fields:",
      "ja": "IPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Destination Address Copied from the Source Address field of the invoking packet.",
      "ja": "呼び出しパケットの送信元アドレスフィールドからコピーされた宛先アドレス。"
    },
    {
      "indent": 3,
      "text": "ICMPv6 Fields:",
      "ja": "ICMPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Type 3",
      "ja": "タイプ3"
    },
    {
      "indent": 3,
      "text": "Code 0 - hop limit exceeded in transit",
      "ja": "コード0-転送中にホップ制限を超えました"
    },
    {
      "indent": 18,
      "text": "1 - fragment reassembly time exceeded",
      "ja": "1-フラグメント再構成時間を超えました"
    },
    {
      "indent": 3,
      "text": "Unused This field is unused for all code values. It must be initialized to zero by the sender and ignored by the receiver.",
      "ja": "未使用このフィールドは、すべてのコード値で未使用です。送信者はゼロに初期化し、受信者は無視する必要があります。"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 3,
      "text": "If a router receives a packet with a Hop Limit of zero, or a router decrements a packet's Hop Limit to zero, it MUST discard the packet and send an ICMPv6 Time Exceeded message with Code 0 to the source of the packet. This indicates either a routing loop or too small an initial Hop Limit value.",
      "ja": "ルーターがホップ制限がゼロのパケットを受信するか、ルーターがパケットのホップ制限をゼロにデクリメントする場合、ルーターはパケットを破棄し、コード0のICMPv6時間超過メッセージをパケットの送信元に送信する必要があります。これは、ルーティングループまたは初期ホップ制限値が小さすぎることを示しています。"
    },
    {
      "indent": 3,
      "text": "The rules for selecting the Source Address of this message are defined in section 2.2.",
      "ja": "このメッセージの送信元アドレスを選択するためのルールは、セクション2.2で定義されています。"
    },
    {
      "indent": 3,
      "text": "Upper layer notification",
      "ja": "上位層通知"
    },
    {
      "indent": 3,
      "text": "An incoming Time Exceeded message MUST be passed to the upper-layer process.",
      "ja": "着信Time Exceededメッセージは、上位層プロセスに渡される必要があります。"
    },
    {
      "indent": 0,
      "text": "3.4 Parameter Problem Message",
      "section_title": true,
      "ja": "3.4 パラメータ問題メッセージ"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     Code      |          Checksum             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                            Pointer                            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    As much of invoking packet                 |\n+               as will fit without the ICMPv6 packet           +\n|               exceeding the minimum IPv6 MTU [IPv6]           |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "IPv6 Fields:",
      "ja": "IPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Destination Address",
      "ja": "宛先アドレス"
    },
    {
      "indent": 18,
      "text": "Copied from the Source Address field of the invoking packet.",
      "ja": "呼び出しパケットの送信元アドレスフィールドからコピーされます。"
    },
    {
      "indent": 3,
      "text": "ICMPv6 Fields:",
      "ja": "ICMPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Type 4",
      "ja": "タイプ4"
    },
    {
      "indent": 3,
      "text": "Code 0 - erroneous header field encountered",
      "ja": "コード0-誤ったヘッダーフィールドが検出されました"
    },
    {
      "indent": 18,
      "text": "1 - unrecognized Next Header type encountered",
      "ja": "1-認識されない次のヘッダータイプが検出されました"
    },
    {
      "indent": 18,
      "text": "2 - unrecognized IPv6 option encountered",
      "ja": "2-認識されないIPv6オプションが検出されました"
    },
    {
      "indent": 3,
      "text": "Pointer Identifies the octet offset within the invoking packet where the error was detected.",
      "ja": "ポインタエラーが検出された呼び出しパケット内のオクテットオフセットを識別します。"
    },
    {
      "indent": 18,
      "text": "The pointer will point beyond the end of the ICMPv6 packet if the field in error is beyond what can fit in the maximum size of an ICMPv6 error message.",
      "ja": "エラーのあるフィールドがICMPv6エラーメッセージの最大サイズに収まる範囲を超えている場合、ポインターはICMPv6パケットの終わりを超えてポイントします。"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 3,
      "text": "If an IPv6 node processing a packet finds a problem with a field in the IPv6 header or extension headers such that it cannot complete processing the packet, it MUST discard the packet and SHOULD send an ICMPv6 Parameter Problem message to the packet's source, indicating the type and location of the problem.",
      "ja": "パケットを処理するIPv6ノードがIPv6ヘッダーまたは拡張ヘッダーのフィールドに問題を見つけて、パケットの処理を完了できない場合は、パケットを破棄し、タイプを示すICMPv6パラメーター問題メッセージをパケットの送信元に送信する必要があります（SHOULD）。問題の場所。"
    },
    {
      "indent": 0,
      "text": " The pointer identifies the octet of the original packet's header where the error was detected. For example, an ICMPv6 message with Type field = 4, Code field = 1, and Pointer field = 40 would indicate that the IPv6 extension header following the IPv6 header of the original packet holds an unrecognized Next Header field value.",
      "ja": "ポインターは、エラーが検出された元のパケットのヘッダーのオクテットを識別します。たとえば、タイプフィールド= 4、コードフィールド= 1、およびポインターフィールド= 40のICMPv6メッセージは、元のパケットのIPv6ヘッダーに続くIPv6拡張ヘッダーが、認識されない次のヘッダーフィールド値を保持することを示します。"
    },
    {
      "indent": 3,
      "text": "Upper layer notification",
      "ja": "上位層通知"
    },
    {
      "indent": 3,
      "text": "A node receiving this ICMPv6 message MUST notify the upper-layer process.",
      "ja": "このICMPv6メッセージを受信するノードは、上位層プロセスに通知する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. ICMPv6 Informational Messages",
      "section_title": true,
      "ja": "4. ICMPv6情報メッセージ"
    },
    {
      "indent": 0,
      "text": "4.1 Echo Request Message",
      "section_title": true,
      "ja": "4.1 エコー要求メッセージ"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     Code      |          Checksum             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Identifier          |        Sequence Number        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Data ...\n+-+-+-+-+-",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "IPv6 Fields:",
      "ja": "IPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Destination Address",
      "ja": "宛先アドレス"
    },
    {
      "indent": 18,
      "text": "Any legal IPv6 address.",
      "ja": "正当なIPv6アドレス。"
    },
    {
      "indent": 3,
      "text": "ICMPv6 Fields:",
      "ja": "ICMPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Type 128",
      "ja": "タイプ128"
    },
    {
      "indent": 3,
      "text": "Code 0",
      "ja": "コード0"
    },
    {
      "indent": 3,
      "text": "Identifier An identifier to aid in matching Echo Replies to this Echo Request. May be zero.",
      "ja": "識別子このエコー要求に対するエコー応答の照合を支援する識別子。ゼロかもしれません。"
    },
    {
      "indent": 3,
      "text": "Sequence Number",
      "ja": "シーケンス番号"
    },
    {
      "indent": 18,
      "text": "A sequence number to aid in matching Echo Replies to this Echo Request. May be zero.",
      "ja": "エコー応答をこのエコー要求に一致させるのに役立つシーケンス番号。ゼロかもしれません。"
    },
    {
      "indent": 3,
      "text": "Data Zero or more octets of arbitrary data.",
      "ja": "データ0個以上の任意のデータのオクテット。"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 3,
      "text": "Every node MUST implement an ICMPv6 Echo responder function that receives Echo Requests and sends corresponding Echo Replies. A node SHOULD also implement an application-layer interface for sending Echo Requests and receiving Echo Replies, for diagnostic purposes.",
      "ja": "すべてのノードは、エコー要求を受信して​​対応するエコー応答を送信するICMPv6エコー応答機能を実装する必要があります。ノードは、診断目的で、エコー要求を送信し、エコー応答を受信するためのアプリケーション層インターフェイスも実装する必要があります（SHOULD）。"
    },
    {
      "indent": 3,
      "text": "Upper layer notification",
      "ja": "上位層通知"
    },
    {
      "indent": 3,
      "text": "Echo Request messages MAY be passed to processes receiving ICMP messages.",
      "ja": "エコー要求メッセージは、ICMPメッセージを受信するプロセスに渡される場合があります。"
    },
    {
      "indent": 0,
      "text": "4.2 Echo Reply Message",
      "section_title": true,
      "ja": "4.2 エコー応答メッセージ"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     Code      |          Checksum             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Identifier          |        Sequence Number        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Data ...\n+-+-+-+-+-",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "IPv6 Fields:",
      "ja": "IPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Destination Address",
      "ja": "宛先アドレス"
    },
    {
      "indent": 18,
      "text": "Copied from the Source Address field of the invoking Echo Request packet.",
      "ja": "呼び出しエコーリクエストパケットのソースアドレスフィールドからコピーされます。"
    },
    {
      "indent": 3,
      "text": "ICMPv6 Fields:",
      "ja": "ICMPv6フィールド："
    },
    {
      "indent": 3,
      "text": "Type 129",
      "ja": "タイプ129"
    },
    {
      "indent": 3,
      "text": "Code 0",
      "ja": "コード0"
    },
    {
      "indent": 3,
      "text": "Identifier The identifier from the invoking Echo Request message.",
      "ja": "識別子呼び出しエコー要求メッセージからの識別子。"
    },
    {
      "indent": 3,
      "text": "Sequence The sequence number from the invoking Echo Request Number message.",
      "ja": "シーケンス呼び出しエコー要求番号メッセージからのシーケンス番号。"
    },
    {
      "indent": 3,
      "text": "Data The data from the invoking Echo Request message.",
      "ja": "データ呼び出しエコー要求メッセージからのデータ。"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 3,
      "text": "Every node MUST implement an ICMPv6 Echo responder function that receives Echo Requests and sends corresponding Echo Replies. A node SHOULD also implement an application-layer interface for sending Echo Requests and receiving Echo Replies, for diagnostic purposes.",
      "ja": "すべてのノードは、エコー要求を受信して​​対応するエコー応答を送信するICMPv6エコー応答機能を実装する必要があります。ノードは、診断目的で、エコー要求を送信し、エコー応答を受信するためのアプリケーション層インターフェイスも実装する必要があります（SHOULD）。"
    },
    {
      "indent": 3,
      "text": "The source address of an Echo Reply sent in response to a unicast Echo Request message MUST be the same as the destination address of that Echo Request message.",
      "ja": "ユニキャストエコー要求メッセージへの応答として送信されるエコー応答の送信元アドレスは、そのエコー要求メッセージの宛先アドレスと同じである必要があります。"
    },
    {
      "indent": 3,
      "text": "An Echo Reply SHOULD be sent in response to an Echo Request message sent to an IPv6 multicast address. The source address of the reply MUST be a unicast address belonging to the interface on which the multicast Echo Request message was received.",
      "ja": "エコー応答は、IPv6マルチキャストアドレスに送信されるエコー要求メッセージへの応答として送信する必要があります（SHOULD）。応答のソースアドレスは、マルチキャストエコー要求メッセージが受信されたインターフェイスに属するユニキャストアドレスでなければなりません。"
    },
    {
      "indent": 3,
      "text": "The data received in the ICMPv6 Echo Request message MUST be returned entirely and unmodified in the ICMPv6 Echo Reply message.",
      "ja": "ICMPv6エコー要求メッセージで受信されたデータは、完全に返され、ICMPv6エコー応答メッセージで変更されていない必要があります。"
    },
    {
      "indent": 3,
      "text": "Upper layer notification",
      "ja": "上位層通知"
    },
    {
      "indent": 3,
      "text": "Echo Reply messages MUST be passed to the process that originated an Echo Request message. It may be passed to processes that did not originate the Echo Request message.",
      "ja": "エコー応答メッセージは、エコー要求メッセージを発信したプロセスに渡す必要があります。エコー要求メッセージを発信しなかったプロセスに渡される可能性があります。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 0,
      "text": "5.1 Authentication and Encryption of ICMP messages",
      "section_title": true,
      "ja": "5.1 ICMPメッセージの認証と暗号化"
    },
    {
      "indent": 3,
      "text": "ICMP protocol packet exchanges can be authenticated using the IP Authentication Header [IPv6-AUTH]. A node SHOULD include an Authentication Header when sending ICMP messages if a security association for use with the IP Authentication Header exists for the destination address. The security associations may have been created through manual configuration or through the operation of some key management protocol.",
      "ja": "ICMPプロトコルのパケット交換は、IP認証ヘッダー[IPv6-AUTH]を使用して認証できます。 IP認証ヘッダーで使用するセキュリティアソシエーションが宛先アドレスに存在する場合、ICMPメッセージを送信するときにノードは認証ヘッダーを含める必要があります（SHOULD）。セキュリティアソシエーションは、手動構成またはいくつかのキー管理プロトコルの操作によって作成された可能性があります。"
    },
    {
      "indent": 3,
      "text": "Received Authentication Headers in ICMP packets MUST be verified for correctness and packets with incorrect authentication MUST be ignored and discarded.",
      "ja": "ICMPパケットで受信した認証ヘッダーは、正しいことを確認する必要があり、不正な認証を持つパケットは無視して破棄する必要があります。"
    },
    {
      "indent": 3,
      "text": "It SHOULD be possible for the system administrator to configure a node to ignore any ICMP messages that are not authenticated using either the Authentication Header or Encapsulating Security Payload. Such a switch SHOULD default to allowing unauthenticated messages.",
      "ja": "システム管理者は、認証ヘッダーまたはカプセル化セキュリティペイロードのいずれかを使用して認証されていないICMPメッセージを無視するようにノードを構成することが可能である必要があります（SHOULD）。このようなスイッチは、デフォルトで非認証メッセージを許可する必要があります（SHOULD）。"
    },
    {
      "indent": 3,
      "text": "Confidentiality issues are addressed by the IP Security Architecture and the IP Encapsulating Security Payload documents [IPv6-SA, IPv6- ESP].",
      "ja": "機密性の問題は、IPセキュリティアーキテクチャとIPカプセル化セキュリティペイロードのドキュメント[IPv6-SA、IPv6- ESP]で対処されています。"
    },
    {
      "indent": 0,
      "text": "5.2 ICMP Attacks",
      "section_title": true,
      "ja": "5.2 ICMP攻撃"
    },
    {
      "indent": 3,
      "text": "ICMP messages may be subject to various attacks. A complete discussion can be found in the IP Security Architecture [IPv6-SA]. A brief discussion of such attacks and their prevention is as follows:",
      "ja": "ICMPメッセージは、さまざまな攻撃を受ける可能性があります。完全な議論はIP Security Architecture [IPv6-SA]にあります。このような攻撃とその防止についての簡単な説明は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "1. ICMP messages may be subject to actions intended to cause the receiver believe the message came from a different source than the message originator. The protection against this attack can be achieved by applying the IPv6 Authentication mechanism [IPv6-Auth] to the ICMP message.",
      "ja": "1. ICMPメッセージは、メッセージの発信者とは異なるソースからのメッセージであると受信者に信じ込ませるためのアクションの対象となる場合があります。この攻撃に対する保護は、ICMPメッセージにIPv6認証メカニズム[IPv6-Auth]を適用することで実現できます。"
    },
    {
      "indent": 3,
      "text": "2. ICMP messages may be subject to actions intended to cause the message or the reply to it go to a destination different than the message originator's intention. The ICMP checksum calculation provides a protection mechanism against changes by a malicious interceptor in the destination and source address of the IP packet carrying that message, provided the ICMP checksum field is protected against change by authentication [IPv6-Auth] or encryption [IPv6-ESP] of the ICMP message.",
      "ja": "2. ICMPメッセージは、メッセージまたはメッセージへの返信がメッセージの発信者の意図とは異なる宛先に送られることを意図したアクションの対象となる場合があります。 ICMPチェックサムフィールドは、認証[IPv6-Auth]または暗号化[IPv6-ESP]による変更から保護されている場合、そのメッセージを運ぶIPパケットの宛先および送信元アドレスの悪意のあるインターセプターによる変更に対する保護メカニズムを提供します] ICMPメッセージの。"
    },
    {
      "indent": 3,
      "text": "3. ICMP messages may be subject to changes in the message fields, or payload. The authentication [IPv6-Auth] or encryption [IPv6-ESP] of the ICMP message is a protection against such actions.",
      "ja": "3. ICMPメッセージは、メッセージフィールドまたはペイロードの変更の影響を受ける場合があります。 ICMPメッセージの認証[IPv6-Auth]または暗号化[IPv6-ESP]は、このようなアクションに対する保護です。"
    },
    {
      "indent": 3,
      "text": "4. ICMP messages may be used as attempts to perform denial of service attacks by sending back to back erroneous IP packets. An implementation that correctly followed section 2.4, paragraph (f) of this specifications, would be protected by the ICMP error rate limiting mechanism.",
      "ja": "4. ICMPメッセージは、誤ったIPパケットを連続して送信することにより、サービス拒否攻撃を実行する試みとして使用される場合があります。この仕様のセクション2.4、パラグラフ（f）に正しく従った実装は、ICMPエラーレート制限メカニズムによって保護されます。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 3,
      "text": "[IPv6] Deering, S. and R. Hinden, \"Internet Protocol, Version 6, (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[IPv6] Deering、S。およびR. Hinden、「インターネットプロトコル、バージョン6、（IPv6）仕様」、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[IPv6-ADDR] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 2373, July 1998.",
      "ja": "[IPv6-ADDR] Hinden、R。およびS. Deering、「IPバージョン6アドレス指定アーキテクチャ」、RFC 2373、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[IPv6-DISC] Narten, T., Nordmark, E. and W. Simpson, \"Neighbor Discovery for IP Version 6 (IPv6)\", RFC 2461, December 1998.",
      "ja": "[IPv6-DISC] Narten、T.、Nordmark、E。およびW. Simpson、「Neighbor Discovery for IP Version 6（IPv6）」、RFC 2461、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC-792] Postel, J., \"Internet Control Message Protocol\", STD 5, RFC 792, September 1981.",
      "ja": "[RFC-792] Postel、J。、「インターネット制御メッセージプロトコル」、STD 5、RFC 792、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC-1122] Braden, R., \"Requirements for Internet Hosts - Communication Layers\", STD 5, RFC 1122, August 1989.",
      "ja": "[RFC-1122] Braden、R。、「インターネットホストの要件-通信層」、STD 5、RFC 1122、1989年8月。"
    },
    {
      "indent": 3,
      "text": "[PMTU] McCann, J., Deering, S. and J. Mogul, \"Path MTU Discovery for IP version 6\", RFC 1981, August 1996.",
      "ja": "[PMTU] McCann、J.、Deering、S。、およびJ. Mogul、「IPバージョン6のPath MTU Discovery」、RFC 1981、1996年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC-2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[IPv6-SA] Kent, S. and R. Atkinson, \"Security Architecture for the Internet Protocol\", RFC 2401, November 1998.",
      "ja": "[IPv6-SA]ケント、S。、およびR.アトキンソン、「インターネットプロトコルのセキュリティアーキテクチャ」、RFC 2401、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[IPv6-Auth] Kent, S. and R. Atkinson, \"IP Authentication Header\", RFC 2402, November 1998.",
      "ja": "[IPv6-Auth] Kent、S。およびR. Atkinson、「IP Authentication Header」、RFC 2402、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[IPv6-ESP] Kent, S. and R. Atkinson, \"IP Encapsulating Security Protocol (ESP)\", RFC 2406, November 1998.",
      "ja": "[IPv6-ESP]ケント、S。、およびR.アトキンソン、「IPカプセル化セキュリティプロトコル（ESP）」、RFC 2406、1998年11月。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgments",
      "section_title": true,
      "ja": "7. 謝辞"
    },
    {
      "indent": 3,
      "text": "The document is derived from previous ICMP drafts of the SIPP and IPng working group.",
      "ja": "このドキュメントは、SIPPおよびIPngワーキンググループの以前のICMPドラフトから派生しています。"
    },
    {
      "indent": 3,
      "text": "The IPng working group and particularly Robert Elz, Jim Bound, Bill Simpson, Thomas Narten, Charlie Lynn, Bill Fink, Scott Bradner, Dimitri Haskin, and Bob Hinden (in chronological order) provided extensive review information and feedback.",
      "ja": "IPngワーキンググループ、特にRobert Elz、Jim Bound、Bill Simpson、Thomas Narten、Charlie Lynn、Bill Fink、Scott Bradner、Dimitri Haskin、およびBob Hinden（年代順）は、広範なレビュー情報とフィードバックを提供しました。"
    },
    {
      "indent": 0,
      "text": "8. Authors' Addresses",
      "section_title": true,
      "ja": "8. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Alex Conta Lucent Technologies Inc. 300 Baker Ave, Suite 100 Concord, MA 01742 USA",
      "ja": "Alex Conta Lucent Technologies Inc.300 Baker Ave、Suite 100 Concord、MA 01742 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 978 287-2842\nEMail: aconta@lucent.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Stephen Deering Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134-1706 USA",
      "ja": "Stephen Deering Cisco Systems、Inc. 170 West Tasman Drive San Jose、CA 95134-1706 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 527-8213\nEMail: deering@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Appendix A - Changes from RFC 1885",
      "ja": "付録A-RFC 1885からの変更"
    },
    {
      "indent": 3,
      "text": "Version 2-02",
      "ja": "バージョン2-02"
    },
    {
      "indent": 4,
      "text": "- Excluded mentioning informational replies from paragraph (f.2) of section 2.4. - In \"Upper layer notification\" sections changed \"upper-layer protocol\" and \"User Interface\" to \"process\". - Changed section 5.2, item 2 and 3 to also refer to AH authentication. - Removed item 5. from section 5.2 on denial of service attacks. - Updated phone numbers and Email addresses in the \"Authors' Addresses\" section.",
      "ja": "- セクション2.4のパラグラフ（f.2）からの情報提供の返信について言及することは除外されます。 -「上位層通知」セクションで、「上位層プロトコル」と「ユーザーインターフェイス」を「プロセス」に変更しました。 -セクション5.2、項目2および3を変更して、AH認証も参照するようにしました。 -サービス拒否攻撃のセクション5.2から項目5を削除しました。 -「著者のアドレス」セクションの電話番号とメールアドレスを更新しました。"
    },
    {
      "indent": 3,
      "text": "Version 2-01",
      "ja": "バージョン2-01"
    },
    {
      "indent": 4,
      "text": "- Replaced all references to \"576 octets\" as the maximum for an ICMP message size with \"minimum IPv6 MTU\" as defined by the base IPv6 specification. - Removed rate control from informational messages. - Added requirement that receivers ignore Code value in Packet Too Big message. - Removed \"Not a Neighbor\" (code 2) from destination unreachable message. - Fixed typos and update references.",
      "ja": "- ICMPメッセージサイズの最大値としての「576オクテット」へのすべての参照を、ベースIPv6仕様で定義されている「最小IPv6 MTU」に置き換えました。 -情報メッセージからレート制御を削除しました。 -レシーバーがPacket Too Bigメッセージのコード値を無視するという要件を追加しました。 -宛先到達不能メッセージから「Not a Neighbor」（コード2）を削除しました。 -タイプミスの修正と参照の更新。"
    },
    {
      "indent": 3,
      "text": "Version 2-00",
      "ja": "バージョン2-00"
    },
    {
      "indent": 4,
      "text": "- Applied rate control to informational messages - Removed section 2.4 on Group Management ICMP messages - Removed references to IGMP in Abstract and Section 1. - Updated references to other IPv6 documents - Removed references to RFC-1112 in Abstract, and Section 1, and to RFC-1191 in section 1, and section 3.2 - Added security section - Added Appendix A - changes",
      "ja": "- 情報メッセージへの適用レート制御-グループ管理ICMPメッセージのセクション2.4を削除-アブストラクトおよびセクション1のIGMPへの参照を削除-他のIPv6ドキュメントへの参照を更新-アブストラクトおよびセクション1のRFC-1112、およびRFCへの参照を削除セクション1の-1191、およびセクション3.2-セキュリティセクションの追加-付録Aの追加-変更"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントとその翻訳はコピーして他のユーザーに提供することができ、コメントまたはその他の方法で説明したり、その実装を支援する二次的著作物は、いかなる種類の制限なしに、全体または一部を準備、コピー、公開、および配布することができますただし、上記の著作権表示とこの段落は、そのようなすべてのコピーと派生物に含まれています。ただし、このドキュメント自体は、著作権に関する通知を削除したり、インターネットソサエティや他のインターネット組織への参照を削除したりするなど、いかなる方法でも変更できません。ただし、インターネット標準を開発する目的で必要な場合は除きます。インターネット標準のプロセスに従うか、または必要に応じて、それを英語以外の言語に翻訳する必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記で付与された制限付きのアクセス許可は永続的であり、インターネットソサエティまたはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は「現状有姿」で提供され、インターネット社会およびインターネット技術タスクフォースは、明示または黙示を問わず、ここに記載されている情報の使用が保証するものに限定されないいかなる保証も含め、一切の保証を否認します。商品性または特定の目的への適合性に関する権利または黙示の保証を侵害すること。"
    }
  ]
}