{
  "title": {
    "text": "RFC 2224 - NFS URL Scheme",
    "ja": "RFC 2224 - NFS URLスキーム"
  },
  "number": 2224,
  "created_at": "2019-10-21 19:23:47.089626+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        B. Callaghan\nRequest for Comments: 2224                         Sun Microsystems, Inc.\nCategory: Informational                                      October 1997",
      "raw": true
    },
    {
      "indent": 29,
      "text": "NFS URL Scheme",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1997). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1997）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "A new URL scheme, 'nfs' is defined. It is used to refer to files and directories on NFS servers using the general URL syntax defined in RFC 1738, \"Uniform Resource Locators (URL)\".",
      "ja": "新しいURLスキーム、「NFSは」が定義されています。 RFC 1738で定義されている一般的なURL構文、「ユニフォームリソースロケータ（URL）」を使用してNFSサーバー上のファイルやディレクトリを参照するために使用されます。"
    },
    {
      "indent": 3,
      "text": "This scheme uses the public filehandle and multi-component lookup [RFC2054, RFC2055] to access server data with a minimum of protocol overhead.",
      "ja": "この方式は、公開ファイルハンドルおよびプロトコルオーバーヘッドを最小限に抑えて、サーバデータにアクセスするためのマルチコンポーネントルックアップ[RFC2054、RFC2055]を使用します。"
    },
    {
      "indent": 3,
      "text": "The NFS protocol provides access to shared filesystems across networks. It is designed to be machine, operating system, network architecture, and transport protocol independent. The protocol currently exists in two versions: version 2 [RFC1094] and version 3 [RFC1813], both built on ONC RPC [RFC1831] at its associated eXternal Data Representation (XDR) [RFC1832] and Binding Protocol [RFC1833].",
      "ja": "NFSプロトコルは、ネットワーク全体で共有ファイルシステムへのアクセスを提供します。マシン、オペレーティングシステム、ネットワークアーキテクチャ、およびトランスポート・プロトコルに依存しないように設計されています。プロトコルは、現在、2つのバージョンが存在する：バージョン2 [RFC1094]とバージョン3 [RFC1813]、それに関連する外部データ表現（XDR）[RFC1832]および結合プロトコル[RFC1833]でONC RPC [RFC1831]に基づいて構築両方。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 6,
      "text": "1.    URL Syntax . . . . . . . . . . . . . . . . . . . . . . .  2\n2.    URL Evaluation . . . . . . . . . . . . . . . . . . . . .  2\n3.    Server Connection  . . . . . . . . . . . . . . . . . . .  2\n4.    NFS Version  . . . . . . . . . . . . . . . . . . . . . .  2\n5.    Public Filehandle  . . . . . . . . . . . . . . . . . . .  3\n5.1     NFS Version 2 Public Filehandle  . . . . . . . . . . .  3\n5.2     NFS Version 3 Public Filehandle  . . . . . . . . . . .  3\n6.    Multi-component Lookup . . . . . . . . . . . . . . . . .  3\n6.1     Absolute vs Relative Pathname  . . . . . . . . . . . .  4\n6.2     Symbolic Links . . . . . . . . . . . . . . . . . . . .  5\n7.    Mount Protocol . . . . . . . . . . . . . . . . . . . . .  6\n8.    Bibliography . . . . . . . . . . . . . . . . . . . . . .  7\n9.    Security Considerations  . . . . . . . . . . . . . . . .  8",
      "raw": true
    },
    {
      "indent": 6,
      "text": "10.   BNF for NFS URL Scheme . . . . . . . . . . . . . . . . .  9\n11.   Acknowledgements . . . . . . . . . . . . . . . . . . . . 10\n12.   Author's Address . . . . . . . . . . . . . . . . . . . . 10\n13.   Full Copyright Statement . . . . . . . . . . . . . . . . 11",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. URL Syntax",
      "section_title": true,
      "ja": "1. URL構文"
    },
    {
      "indent": 3,
      "text": "An NFS URL is based on the Common Internet Scheme Syntax described in section 3.1 of RFC 1738. It has the general form:",
      "ja": "NFSのURLは共通インターネットスキームの構文に基づいていることが一般的な形式を持っているRFC 1738のセクション3.1で説明します："
    },
    {
      "indent": 8,
      "text": "nfs://<host>:<port><url-path>",
      "ja": "NFS：// <ホスト>：<ポート> <URLパス>"
    },
    {
      "indent": 3,
      "text": "The \":<port>\" part is optional. If omitted then port 2049 is assumed. The <url-path> is also optional.",
      "ja": "「：<ポート>」の部分はオプションです。その後、省略した場合、ポート2049が想定されます。 <URLパス>もオプションです。"
    },
    {
      "indent": 3,
      "text": "The <url-path> is a hierarchical directory path of the form /<directory>/<directory>/<directory>/.../<name>. The <url-path> must consist only of characters within the US-ASCII character set. Within a <directory> or <name> component the character \"/\" is reserved and must be encoded as described in Section 2.2 of RFC 1738. If <url-path> is omitted or consists solely of \"/\", it must default to the path \".\".",
      "ja": "<URLパス>は、フォーム/ <ディレクトリ> / <ディレクトリ> / <ディレクトリ> /.../ <名前>の階層ディレクトリ・パスです。 <URL-path>はUS-ASCII文字セット内の文字のみで構成する必要があります。 <ディレクトリ>内または<URLパス>が省略または単に「/」の構成されている場合は、<名前>要素の文字「/」予約されており、RFC 1738のセクション2.2で説明したようにエンコードする必要があり、それがデフォルトにしなければなりませんパス \"。\"。"
    },
    {
      "indent": 0,
      "text": "2. URL Evaluation",
      "section_title": true,
      "ja": "2. URL評価"
    },
    {
      "indent": 3,
      "text": "A client must evaluate an NFS URL by a method known as WebNFS [RFC2054, RFC2055]. This method provides easy passage through firewalls and proxy servers, as well as using a minimum number of messages. The WebNFS method is defined for NFS versions 2 and 3. It assumes that the server registers on TCP or UDP port 2049 and supports the public filehandle and multi-component lookup semantics as described in the following sections.",
      "ja": "クライアントがWebNFSのとして知られている方法[RFC2054、RFC2055]でNFSのURLを評価しなければなりません。この方法は簡単で、ファイアウォールやプロキシサーバを通過するだけでなく、メッセージの最小数を使用しています。 WebNFSの方法は、NFSバージョン2および3のために定義されているこれは、以下のセクションに記載されているように、サーバTCPまたはUDPポート2049上のレジスタと、パブリックファイルハンドルとマルチコンポーネントルックアップ・セマンティクスをサポートしていることを前提としています。"
    },
    {
      "indent": 0,
      "text": "3. Server Connection",
      "section_title": true,
      "ja": "3.サーバー接続"
    },
    {
      "indent": 3,
      "text": "The client must first attempt to create a TCP connection to <host> using the <port> specified. If :<port> is omitted, then port 2049 will be used. If the server refuses the TCP connection, then the client will use UDP.",
      "ja": "クライアントは、最初に指定された<ポート>を使用して、<ホスト>へのTCP接続を作成しようとしなければなりません。場合：<ポート>が省略され、その後、ポート2049が使用されます。サーバーがTCP接続を拒否した場合、クライアントはUDPを使用します。"
    },
    {
      "indent": 0,
      "text": "4. NFS Version",
      "section_title": true,
      "ja": "4. NFSバージョン"
    },
    {
      "indent": 3,
      "text": "The client must first attempt to use NFS version 3. If the server returns an RPC PROG_MISMATCH error then the client must assume that NFS version 3 is not supported, and retry the operation with an NFS version 2 public filehandle.",
      "ja": "クライアントは、最初のサーバは、クライアントがNFSバージョン3がサポートされていないことを前提としなければならないのRPC PROG_MISMATCHエラーを返す場合はNFSバージョン3を使用しようとすると、NFSバージョン2のパブリックファイルハンドルを使用して操作を再試行する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Public Filehandle",
      "section_title": true,
      "ja": "5.公共ファイルハンドル"
    },
    {
      "indent": 3,
      "text": "NFS filehandles are normally created by the server and used to identify uniquely a particular file or directory on the server. The client does not normally create filehandles or have any knowledge of the contents of a filehandle.",
      "ja": "NFSファイルハンドルは通常、サーバーによって作成され、独自にサーバー上の特定のファイルやディレクトリを識別するために使用されています。クライアントは通常、ファイルハンドルを作成したり、ファイルハンドルの内容のいずれかの知識を持っていません。"
    },
    {
      "indent": 3,
      "text": "The public filehandle is an an exception. It is an NFS filehandle with a reserved value and special semantics that allow an initial filehandle to be obtained. A WebNFS client uses the public filehandle as an initial filehandle rather than using the MOUNT protocol. Since NFS version 2 and version 3 have different filehandle formats, the public filehandle is defined differently for each.",
      "ja": "公共ファイルハンドルは例外です。これは、予約済みの値と初期ファイルハンドルを取得することを可能にする特別なセマンティクスを持つNFSファイルハンドルです。 WebNFSのクライアントではなく、MOUNTプロトコルを使用するよりも、最初のファイルハンドルとして公共ファイルハンドルを使用しています。 NFSバージョン2及びバージョン3は、異なるファイルハンドル形式を有しているので、パブリックファイルハンドルをごとに異なって定義されています。"
    },
    {
      "indent": 3,
      "text": "The public filehandle is a zero filehandle. For NFS version 2 this is a filehandle with 32 zero octets. A version 3 public filehandle has zero length.",
      "ja": "公共ファイルハンドルがゼロでファイルハンドルです。 NFSバージョン2の場合、これは32ゼロオクテットとファイルハンドルです。バージョン3公共ファイルハンドルは、ゼロの長さを有します。"
    },
    {
      "indent": 0,
      "text": "5.1 NFS Version 2 Public Filehandle",
      "section_title": true,
      "ja": "5.1 NFSバージョン2公開ファイルハンドル"
    },
    {
      "indent": 3,
      "text": "A version 2 filehandle is defined in RFC 1094 as an opaque value occupying 32 octets. A version 2 public filehandle has a zero in each octet, i.e. all zeros.",
      "ja": "バージョン2のファイルハンドルは、32個のオクテットを占める不透明な値として、RFC 1094で定義されています。バージョン2公共ファイルハンドル、すなわち、全てゼロを各オクテットでゼロを有しています。"
    },
    {
      "indent": 3,
      "text": " 1                                                             32\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|0|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5.2 NFS Version 3 Public Filehandle",
      "section_title": true,
      "ja": "5.2 NFSバージョン3公開ファイルハンドル"
    },
    {
      "indent": 3,
      "text": "A version 3 filehandle is defined in RFC 1813 as a variable length opaque value occupying up to 64 octets. The length of the filehandle is indicated by an integer value contained in a 4 octet value which describes the number of valid octets that follow. A version 3 public filehandle has a length of zero.",
      "ja": "バージョン3ファイルハンドルは64オクテットまで占有可変長の不透明値としてRFC 1813に定義されています。ファイルハンドルの長さは、以下の有効なオクテットの数を記述する4オクテット値に含まれる整数値で示されています。バージョン3公共ファイルハンドルは、ゼロの長さを有します。"
    },
    {
      "indent": 3,
      "text": "+-+-+-+-+\n|   0   |\n+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "6. Multi-component Lookup",
      "section_title": true,
      "ja": "前記多成分ルックアップ"
    },
    {
      "indent": 3,
      "text": "Normally the NFS LOOKUP request (version 2 or 3) takes a directory filehandle along with the name of a directory member, and returns the filehandle of the directory member. If a client needs to evaluate a pathname that contains a sequence of components, then beginning with the directory filehandle of the first component it must issue a series of LOOKUP requests one component at a time. For instance, evaluation of the path \"a/b/c\" will generate separate LOOKUP requests for each component of the pathname \"a\", \"b\", and \"c\".",
      "ja": "通常NFS LOOKUP要求（バージョン2または3）ディレクトリメンバーの名前と一緒に、ディレクトリファイルハンドルを取り、ディレクトリ部材のファイルハンドルを返します。クライアントはコンポーネントの配列を含むパス名を評価する必要がある場合、それはLOOKUPのシリーズを発行しなければならない最初のコンポーネントのディレクトリのファイルハンドルから始まるは、一度に1つのコンポーネントを要求します。例えば、パスの評価「/ B / C」は、パス名「A」、「B」、および「C」の各コンポーネントの別個のルックアップ要求を生成します。"
    },
    {
      "indent": 3,
      "text": "A LOOKUP request that uses the public filehandle can provide a pathname containing multiple components. The server is expected to evaluate the entire pathname and return a filehandle for the final component.",
      "ja": "公共ファイルハンドルを使用してルックアップ要求は、複数の構成要素を含むパス名を提供することができます。サーバーは、パス名全体を評価し、最終的なコンポーネントのファイルハンドルを返すことが期待されています。"
    },
    {
      "indent": 3,
      "text": "For example, rather than evaluate the path \"a/b/c\" as:",
      "ja": "例えば、パス「/ B / C」とを評価するのではなく："
    },
    {
      "indent": 8,
      "text": "LOOKUP  FH=0x0  \"a\"  --->\n                     <---  FH=0x1\nLOOKUP  FH=0x1  \"b\"  --->\n                     <---  FH=0x2\nLOOKUP  FH=0x2  \"c\"  --->\n                     <---  FH=0x3",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Relative to the public filehandle these three LOOKUP requests can be replaced by a single multi-component lookup:",
      "ja": "これら三つのLOOKUP要求は、単一のマルチコンポーネントのルックアップに置き換えることができ、公開ファイルハンドルからの相対："
    },
    {
      "indent": 8,
      "text": "LOOKUP  FH=0x0  \"a/b/c\"  --->\n                         <---  FH=0x3",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Multi-component lookup is supported only for LOOKUP requests relative to the public filehandle.",
      "ja": "多成分のルックアップは、公共ファイルハンドルに対するLOOKUP要求に対してのみサポートされています。"
    },
    {
      "indent": 3,
      "text": "The <url-path> of the NFS URL must be evaluated as a multi-component lookup. This implies that the path components are delimited by slashes and the characters that make up the path must be in the printable US-ASCII character set. Characters not in the \"unreserved\" set (see BNF description below) may be included in pathname components but must be escaped.",
      "ja": "NFS URLの<URLパス>マルチコンポーネントのルックアップとして評価されなければなりません。これは、パスを構成するスラッシュで区切られたパスコンポーネントや文字が印刷可能なUS-ASCII文字セットでなければならないことを意味します。ない「未予約」セット内の文字は、パス名の構成要素に含まれていてもよい（以下BNFの説明を参照）が、エスケープされなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the <url-path> is empty or consists solely of \"/\", the client must send a multi-component lookup for the pathname \".\".",
      "ja": "<URLパス>が空であるか、または単に「/」で構成されている場合、クライアントはパス名のためのマルチコンポーネントルックアップを送信しなければなりません「」。"
    },
    {
      "indent": 0,
      "text": "6.1 Absolute vs. Relative Pathname",
      "section_title": true,
      "ja": "相対パス名対絶対6.1"
    },
    {
      "indent": 3,
      "text": "A multi-component pathname that begins with a slash character is considered \"absolute\" and will be evaluated relative to the server's root. A pathname that does not begin with a slash is \"relative\" and will be evaluated relative to the directory with which the public filehandle is associated.",
      "ja": "スラッシュ文字で始まるマルチコンポーネントパス名は「絶対的」とみなされ、サーバーのルートからの相対評価されます。スラッシュで始まらないパス名は「相対的」であると公共ファイルハンドルが関連付けられているディレクトリからの相対評価されます。"
    },
    {
      "indent": 3,
      "text": "Note that the initial \"/\" that introduces the <url-path> of an NFS URL must not be passed to the server for multi-component lookup since the pathname is to be evaluated relative to the public filehandle directory. For example, if the public filehandle is associated with the server's directory \"/a/b/c\" then the URL:",
      "ja": "パス名は、公共ファイルハンドルディレクトリからの相対評価されるので、NFSのURLの<URLパス>を紹介している「/」初期は、多成分のルックアップのためにサーバに渡されてはならないことに注意してください。例えば、公共ファイルハンドルをサーバのディレクトリに関連付けられている場合は、「/ A / B / C」その後、URL："
    },
    {
      "indent": 8,
      "text": "nfs://server/d/e/f",
      "ja": "NFS：//サーバー/ D / E / F"
    },
    {
      "indent": 3,
      "text": "will be evaluated with a multi-component lookup of the path \"d/e/f\" relative to the server's directory \"/a/b/c\" while the URL:",
      "ja": "URLながらパスのマルチコンポーネントのルックアップとサーバーのディレクトリへの相対的な「/ A / B / C」「D / E / F」に評価されます。"
    },
    {
      "indent": 8,
      "text": "nfs://server//a/b/c/d/e/f",
      "ja": "NFS：//サーバー// A / B / C / D / E / F"
    },
    {
      "indent": 3,
      "text": "will locate the same file with an absolute multi-component lookup of the path \"/a/b/c/d/e/f\" relative to the server's filesystem root. Notice that a double slash is required at the beginning of the path.",
      "ja": "経路の絶対的なマルチコンポーネントルックアップ「/ A / B / C / D / E / F」サーバのファイルシステムのルートに対して同じファイルを検索します。ダブルスラッシュは、パスの先頭に必要とされることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Not all WebNFS servers can support arbitrary use of absolute paths. Clearly, the server must not return a filehandle if the path identifies a file or directory that is not exported by the server. In addition, some servers will not return a filehandle if the path names a file or directory in an exported filesystem different from the one that is associated with the public filehandle.",
      "ja": "すべてではないWebNFSのサーバーには、絶対パスの任意の使用をサポートすることができます。パスはサーバーによってエクスポートされていないファイルまたはディレクトリを識別する場合明らかに、サーバーは、ファイルハンドルを返してはいけません。また、一部のサーバーは、パス名、公開ファイルハンドルに関連付けられているものとは異なるエクスポートファイルシステム内のファイルまたはディレクトリであればファイルハンドルを返しません。"
    },
    {
      "indent": 0,
      "text": "6.2 Symbolic Links",
      "section_title": true,
      "ja": "6.2シンボリックリンク"
    },
    {
      "indent": 3,
      "text": "The NFS protocol supports symbolic links, which are the filesystem equivalent of a relative URL. If a WebNFS client retrieves a filehandle for a symbolic link (as indicated by the file type attribute) then it should send a READLINK request to the server to retrieve the path comprising the symbolic link.",
      "ja": "NFSプロトコルは、相対URLのファイルシステムと同等ですシンボリックリンクをサポートしています。 （ファイルタイプ属性によって示されるように）のWebNFSクライアントがシンボリックリンクのファイルハンドルを取得する場合、それはシンボリックリンクを備えたパスを取得するためにサーバーにREADLINK要求を送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "This path should then be combined with the URL which referenced the symbolic link according to the rules described in RFC 1808. If the relative URL in the symbolic link text is to be resolved successfully then it must contain only ASCII characters and conform to the syntax described in RFC 1808. Note that this allows a symbolic link to contain an entire URL and it may specify a scheme that is not necessarily an NFS URL.",
      "ja": "このパスは、シンボリックリンクテキスト内の相対URLは、それはASCII文字のみが含まれていると説明した構文に準拠している必要があり正常に解決される場合は、RFC 1808で説明したルールに従ってシンボリックリンクを参照したURLと組み合わせる必要がRFC 1808ノートでは、これは全体のURLを格納するためのシンボリックリンクを可能にし、それが必ずしもNFSのURLではありませんスキームを指定することもできる。ということ"
    },
    {
      "indent": 3,
      "text": "A symbolic link path that begins with a slash will be evaluated as an absolute path relative to the directory associated with the public filehandle which may not be the same as the server's system root directory. If symbolic links with absolute paths are to be evaluated correctly on both client and server then the public filehandle must be associated with the system root directory.",
      "ja": "スラッシュで始まるシンボリックリンク経路は、サーバーのシステムのルートディレクトリと同じではないかもしれない公共ファイルハンドルに関連付けられたディレクトリからの相対絶対パスとして評価されます。絶対パスで、シンボリックリンクは、クライアントとサーバーの両方で正しく評価されるようにしている場合は、公共ファイルハンドルは、システムのルートディレクトリに関連付けられている必要があります。"
    },
    {
      "indent": 3,
      "text": "For example, if the symbolic link is named by the URL",
      "ja": "たとえば、シンボリックリンクはURLで命名された場合"
    },
    {
      "indent": 8,
      "text": "nfs://server/a/b",
      "ja": "NFS：//サーバー/ A / B"
    },
    {
      "indent": 3,
      "text": "then the following examples show how a new URL can be formed from the symbolic link text:",
      "ja": "次の例では、新しいURLは、シンボリックリンクテキストから形成することができる方法を示しています。"
    },
    {
      "indent": 9,
      "text": "c = nfs://server/a/c",
      "ja": "C = NFS：//サーバー/ A / C"
    },
    {
      "indent": 9,
      "text": "c/d = nfs://server/a/c/d",
      "ja": "C / D = NFS：//サーバー/ A / C / D"
    },
    {
      "indent": 9,
      "text": "../c = nfs://server/c",
      "ja": "../c = NFS：//サーバー/ C"
    },
    {
      "indent": 9,
      "text": "/c/d = nfs://server/c/d",
      "ja": "/ C / D = NFS：//サーバー/ C / D"
    },
    {
      "indent": 9,
      "text": "nfs://server2/a/b = nfs://server2/a/b",
      "ja": "NFS：// SERVER2 / A / B = NFS：// SERVER2 / A / B"
    },
    {
      "indent": 0,
      "text": "7. Mount Protocol",
      "section_title": true,
      "ja": "7.マウントプロトコル"
    },
    {
      "indent": 3,
      "text": "The NFS URL may have limited use for naming files on servers that do not support the public filehandle and multi-component lookup.",
      "ja": "NFS URLは、公共ファイルハンドルとマルチコンポーネントルックアップをサポートしていないサーバー上のファイルに名前を付けるための限られた用途を有し得ます。"
    },
    {
      "indent": 3,
      "text": "If the server returns an NFS3ERR_STALE, NFS3ERR_INVAL, or NFS3ERR_BADHANDLE error in response to the client's use of a public filehandle, then the client should attempt to resolve the <url-path> to a filehandle using the MOUNT protocol.",
      "ja": "サーバが公共ファイルハンドルのクライアントの使用に応じてNFS3ERR_STALE、NFS3ERR_INVAL、またはNFS3ERR_BADHANDLEエラーを返した場合、クライアントは、MOUNTプロトコルを使用してファイルハンドルへの<url-path>を解決しようとすべきです。"
    },
    {
      "indent": 3,
      "text": "Version 1 of the MOUNT protocol is described in Appendix A of RFC 1094 and version 3 in Appendix I of RFC 1813. Version 2 of the MOUNT protocol is identical to version 1 except for the addition of a procedure MOUNTPROC_PATHCONF which returns POSIX pathconf information from the server.",
      "ja": "MOUNTプロトコルのバージョン1はRFC 1813 MOUNTプロトコルのバージョン2の付録IにRFC 1094とバージョン3の付録Aに記載されていることからPOSIXのpathconf情報を返す手順MOUNTPROC_PATHCONFの添加を除いてバージョン1と同一でありますサーバ。"
    },
    {
      "indent": 3,
      "text": "Note that the pathname sent to the server in the MOUNTPROC_MNT request is assumed to be a server native path, rather than a slash-separated path described by RFC 1738. Hence, the MOUNT protocol can reasonably be expected to map a <url-path> to a filehandle only on servers that support slash-separated ASCII native paths. In general, servers that do not support WebNFS access or slash-separated ASCII native paths should not advertise NFS URLs.",
      "ja": "MOUNTPROC_MNT要求がサーバネイティブパスであると仮定され、サーバに送信されたパス名は、むしろしたがってRFC 1738によって記載スラッシュで区切られたパスより、MOUNTプロトコルが合理<URL-path>をマッピングすることが期待できることに注意してください唯一のスラッシュで区切られたASCIIネイティブパスをサポートするサーバー上のファイルハンドルへ。一般的には、WebNFSのアクセスをサポートしたりしていないサーバースラッシュが区切りのASCIIネイティブパスは、NFS URLを宣伝するべきではありません。"
    },
    {
      "indent": 3,
      "text": "At this point the client must already have some indication as to which version of the NFS protocol is supported on the server. Since the filehandle format differs between NFS versions 2 and 3, the client must select the appropriate version of the MOUNT protocol. MOUNT versions 1 and 2 return only NFS version 2 filehandles, whereas MOUNT version 3 returns NFS version 3 filehandles.",
      "ja": "NFSプロトコルのバージョンには、サーバーでサポートされているように、この時点で、クライアントは、すでにいくつかの兆候を持っている必要があります。ファイルハンドル形式は、NFSバージョン2と3の間で異なるため、クライアントは、MOUNTプロトコルの適切なバージョンを選択しなければなりません。 MOUNTバージョン1および2リターンのみNFSバージョン2つのファイルハンドル、MOUNTバージョンに対し3戻るNFSバージョン3つのファイルハンドル。"
    },
    {
      "indent": 3,
      "text": "Unlike the NFS service, the MOUNT service is not registered on a well-known port. The client must use the PORTMAP service to locate the server's MOUNT port before it can transmit a MOUNTPROC_MNT request to retrieve the filehandle corresponding to the requested path.",
      "ja": "NFSサービスとは異なり、MOUNTサービスは、よく知られたポート上で登録されていません。それは要求されたパスに対応するファイルハンドルを取得するMOUNTPROC_MNT要求を送信する前に、クライアントは、サーバのMOUNTポートを見つけるためにportmapサービスを使用する必要があります。"
    },
    {
      "indent": 7,
      "text": "Client                                       Server\n------                                       ------",
      "raw": true
    },
    {
      "indent": 7,
      "text": "-------------- MOUNT port ? -------------->  Portmapper\n<-------------- Port=984 ------------------",
      "raw": true
    },
    {
      "indent": 7,
      "text": "------- Filehandle for /export/foo ?  ---->  Mountd @ port 984\n<--------- Filehandle=0xf82455ce0..  ------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "NFS servers commonly use a client's successful MOUNTPROC_MNT request request as an indication that the client has \"mounted\" the filesystem and may maintain this information in a file that lists the filesystems that clients currently have mounted. This information is removed from the file when the client transmits an MOUNTPROC_UMNT request. Upon receiving a successful reply to a MOUNTPROC_MNT request, a WebNFS client should send a MOUNTPROC_UMNT request to prevent an accumulation of \"mounted\" records on the server.",
      "ja": "NFSサーバは、一般的に、クライアントがファイルシステムを「マウント」していると、クライアントが現在マウントしているファイルシステムを一覧表示し、ファイルにこの情報を維持することができることを示すものとして、クライアントの成功MOUNTPROC_MNTリクエスト要求を使用しています。この情報は、クライアントがMOUNTPROC_UMNT要求を送信したファイルから削除されます。 MOUNTPROC_MNT要求に対する正常な応答を受信すると、WebNFSのクライアントは、サーバー上のレコードを「マウント」の蓄積を防ぐためにMOUNTPROC_UMNT要求を送信する必要があります。"
    },
    {
      "indent": 0,
      "text": "8.0 Bibliography",
      "section_title": true,
      "ja": "8.0参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1738] Berners-Lee, T., Masinter, L. and M. McCahill, \"Uniform Resource Locators (URL),\" RFC 1738, December 1994.",
      "ja": "[RFC1738]バーナーズ=リー、T.、Masinter、LとM. McCahill、 \"ユニフォームリソースロケータ（URL）、\" RFC 1738、1994年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC1808] Fielding, R., \"Relative Uniform Resource Locators,\" RFC 1808, June 1995.",
      "ja": "[RFC1808]フィールディング、R.、 \"相対的なユニフォームリソースロケータ、\" RFC 1808、1995年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC1831] Srinivasan, R., \"RPC: Remote Procedure Call Protocol Specification Version 2,\" RFC 1831, August 1995.",
      "ja": "[RFC1831]スリニバサン、R.、 \"RPC：リモートプロシージャコールプロトコル仕様バージョン2、\" RFC 1831、1995年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC1832] Srinivasan, R., \"XDR: External Data Representation Standard,\" RFC 1832, August 1995.",
      "ja": "[RFC1832]スリニバサン、R.、 \"XDR：外部データ表現標準、\" RFC 1832、1995年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC1833] Srinivasan, R., \"Binding Protocols for ONC RPC Version 2,\" RFC 1833, August 1995.",
      "ja": "[RFC1833]スリニバサン、R.、 \"ONC RPCバージョン2のプロトコルバインディング、\" RFC 1833、1995年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC1094] Sun Microsystems, Inc., \"Network Filesystem Specification,\" RFC 1094, March 1989.",
      "ja": "[RFC1094]サン・マイクロシステムズ社、 \"ネットワークファイルシステムの仕様、\" RFC 1094、1989年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC1813] Callaghan, B., Pawlowski, B. and P. Staubach, \"NFS Version 3 Protocol Specification,\" RFC 1813, June 1995.",
      "ja": "[RFC1813]キャラハン、B.、ポロウスキー、B.およびP.ストーバック、 \"NFSバージョン3プロトコル仕様、\" RFC 1813、1995年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2054] Callaghan, B., \"WebNFS Client Specification,\" RFC 2054, October 1996.",
      "ja": "[RFC2054]キャラハン、B.、 \"WebNFSのクライアント仕様、\" RFC 2054、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2055] Callaghan, B., \"WebNFS Server Specification,\" RFC 2055, October 1996.",
      "ja": "[RFC2055]キャラハン、B.、 \"WebNFSのサーバー仕様、\" RFC 2055、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[Sandberg] Sandberg, R., D. Goldberg, S. Kleiman, D. Walsh, B. Lyon, \"Design and Implementation of the Sun Network Filesystem,\" USENIX Conference Proceedings, USENIX Association, Berkeley, CA, Summer 1985. The basic paper describing the SunOS implementation of the NFS version 2 protocol, and discusses the goals, protocol specification and trade-offs.",
      "ja": "[サンドバーグ]サンドバーグ、R.、D.ゴールドバーグ、S.クレイマン、D.ウォルシュ、B.リヨン、「日ネットワークファイルシステムの設計と実装、」USENIX会議議事録、USENIX協会、バークレー、CA、夏1985ザ・基本的な紙は、NFSバージョン2プロトコルのSunOSの実装を記述し、目標、プロトコル仕様とトレードオフについて説明します。"
    },
    {
      "indent": 3,
      "text": "[X/OpenNFS] X/Open Company, Ltd., X/Open CAE Specification: Protocols for X/Open Internetworking: XNFS, X/Open Company, Ltd., Apex Plaza, Forbury Road, Reading Berkshire, RG1 1AX, United Kingdom, 1991. This is an indispensable reference for the NFS and accompanying protocols, including the Lock Manager and the Portmapper.",
      "ja": "[X / OpenNFS] X /株式会社Openカンパニー、X /オープンCAE仕様：X / Openのインターネットワーキングのためのプロトコル：XNFS、X / Open Company、Ltd.が、アペックスプラザ、フォーベリー道路、読書バークシャー、RG1 1AX、イギリス、1991これはNFSとロック・マネージャとポートマッパを含む添付のプロトコル、のために不可欠なリファレンスです。"
    },
    {
      "indent": 3,
      "text": "[X/OpenPCNFS] X/Open Company, Ltd., X/Open CAE Specification: Protocols for X/Open Internetworking: (PC)NFS, Developer's Specification, X/Open Company, Ltd., Apex Plaza, Forbury Road, Reading Berkshire, RG1 1AX, United Kingdom, 1991. This is an indispensable reference for NFS protocol and accompanying protocols, including the Lock Manager and the Portmapper.",
      "ja": "[X / OpenPCNFS] X / Open Company、Ltd.が、X / OpenのCAE仕様：X / Openのインターネットワーキングのためのプロトコル：（PC）NFS、開発者の仕様書、X / Open Company、Ltd.が、アペックスプラザ、フォーベリー道路、読書バークシャー、RG1 1AX、イギリス、1991年には、これはロック・マネージャとポートマッパを含むNFSプロトコルおよび添付のプロトコル、のために不可欠なリファレンスです。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Since the WebNFS server features are based on NFS protocol versions 2 and 3, the RPC based security considerations described in RFC 1094, RFC 1831, and RFC 1832 apply here also.",
      "ja": "WebNFSのサーバ機能はNFSプロトコルバージョン2及び3に基づいているので、RPCベースのセキュリティRFC 1094、RFC 1831に記載さ考察、およびRFC 1832もまた、ここに当てはまります。"
    },
    {
      "indent": 3,
      "text": "Server implementors should be careful when implementing multi-component lookup that the client cannot obtain unauthorized access to files or directories. For example: a path that includes multiple occurrences of \"../\" may locate a filesystem outside of the exported filesystem associated with the public filehandle.",
      "ja": "クライアントは、ファイルやディレクトリへの不正アクセスを得ることができないマルチコンポーネントのルックアップを実装する際にサーバの実装者は注意しなければなりません。たとえば、次の複数の発生を含むパス「../」パブリックファイルハンドルに関連付けられているエクスポートファイルシステムの外にファイルシステムを見つけることができます。"
    },
    {
      "indent": 3,
      "text": "Clients and servers may separately negotiate secure connection schemes for authentication, data integrity, and privacy.",
      "ja": "クライアントとサーバーは、別途認証、データの整合性、およびプライバシーのための安全な接続方式を交渉することができます。"
    },
    {
      "indent": 0,
      "text": "10. BNF for NFS URL Scheme",
      "section_title": true,
      "ja": "NFS URLスキーム10. BNF"
    },
    {
      "indent": 3,
      "text": "The syntax of the NFS URL is a subset of the Generic URL syntax described in RFC 1738. An NFS URL does not include user or password components, nor does it recognize \"?\" query or \"#\" fragment components. nfsURL = \"nfs\" \":\" relativeURL relativeURL = net_path | abs_path | rel_path net_path = \"//\" hostport [ abs_path ] abs_path = \"/\" rel_path rel_path = [ path_segments ]",
      "ja": "NFSのURLの構文は、ユーザーやパスワードのコンポーネントが含まれていない、またそれが認識しないNFSのURL RFC 1738で説明一般的なURL構文のサブセットです「？」クエリまたは「＃」フラグメントコンポーネント。 nfsURLは= \"NFS\" \"：\" relativeURL relativeURL = net_path |腹筋_経路| rel_path net_path = \"//\" ホスト側[腹筋_経路]腹筋_経路= \"/\" rel_path rel_path = [path_segments]"
    },
    {
      "indent": 6,
      "text": "hostport = host [ \":\" port ] host = hostname | hostnumber hostname = *( domainlabel \".\" ) toplabel domainlabel = alphanum | alphanum *( alphanum | \"-\" ) alphanum toplabel = alpha | alpha *( alphanum | \"-\" ) alphanum hostnumber = 1*digit \".\" 1*digit \".\" 1*digit \".\" 1*digit port = *digit",
      "ja": "ホスト側=ホスト[ \"：\" ポート]ホスト=ホスト名| hostnumberホスト名= *（ \"\" domainlabel）toplabel domainlabel = alphanum | alphanum *（alphanum | \" - \"）alphanum toplabel =アルファ|アルファ*（alphanum | \" - \"）alphanum hostnumber = 1 *数字 \"\" 1 *数字 \"\" 1 *数字 \"\" 1 * 2桁のポート= *桁"
    },
    {
      "indent": 6,
      "text": "url-path = [ \"/\" ] path_segments path_segments = segment *( \"/\" segment ) segment = *pchar pchar = unreserved | escaped | \":\" | \"@\" | \"&\" | \"=\" | \"+\"",
      "ja": "予約されていないURLパス= [ \"/\"] path_segments path_segments =セグメント*（ \"/\" セグメント）セグメント= * PChar型のPChar型= |エスケープ| \"：\" | \"@\" | \"＆\" | \"=\" | \"+\""
    },
    {
      "indent": 6,
      "text": "reserved = \";\" | \"/\" | \"?\" | \":\" | \"@\" | \"&\" | \"=\" | \"+\" unreserved = alpha | digit | mark mark = \"$\" | \"-\" | \"_\" | \".\" | \"!\" | \"~\" | \"*\" | \"'\" | \"(\" | \")\" | \",\"",
      "ja": "=予約 \";\" | \"/\" | \"？\" | \"：\" | \"@\" | \"＆\" | \"=\" | \"+\" 予約されていない=アルファ|数字|マークマーク= \"$\" | \" - \" | \"_\" | \"\" | \"！\" | \"〜\" | \"*\" | \"'\" | \"（\" | \"）\" | \"\""
    },
    {
      "indent": 6,
      "text": "escaped = \"%\" hex hex hex = digit | \"A\" | \"B\" | \"C\" | \"D\" | \"E\" | \"F\" | \"a\" | \"b\" | \"c\" | \"d\" | \"e\" | \"f\"",
      "ja": "エスケープ=「％」の六角六角六角=数字| \"A\" | \"B\" | \"C\" | \"D\" | \"E\" | \"F\" | 「」| \"B\" | \"C\" | \"D\" | \"E\" | \"F\""
    },
    {
      "indent": 6,
      "text": "alphanum = alpha | digit alpha = lowalpha | upalpha",
      "ja": "alphanum =アルファ|桁のアルファ= lowalpha | upalpha"
    },
    {
      "indent": 6,
      "text": "lowalpha = \"a\" | \"b\" | \"c\" | \"d\" | \"e\" | \"f\" | \"g\" | \"h\" | \"i\" | \"j\" | \"k\" | \"l\" | \"m\" | \"n\" | \"o\" | \"p\" | \"q\" | \"r\" | \"s\" | \"t\" | \"u\" | \"v\" | \"w\" | \"x\" | \"y\" | \"z\" upalpha = \"A\" | \"B\" | \"C\" | \"D\" | \"E\" | \"F\" | \"G\" | \"H\" | \"I\" | \"J\" | \"K\" | \"L\" | \"M\" | \"N\" | \"O\" | \"P\" | \"Q\" | \"R\" | \"S\" | \"T\" | \"U\" | \"V\" | \"W\" | \"X\" | \"Y\" | \"Z\" digit = \"0\" | \"1\" | \"2\" | \"3\" | \"4\" | \"5\" | \"6\" | \"7\" | \"8\" | \"9\"",
      "ja": "lowalpha = \"\" | \"B\" | \"C\" | \"D\" | \"E\" | \"F\" | \"G\" | \"H\" | \"I\" | \"J\" | \"K\" | \"L\" | \"M\" | \"n\" は| \"O\" | \"P\" | \"Q\" | \"R\" | \"S\" | \"T\" | \"U\" | \"V\" | \"W\" | \"X\" | \"Y\" | \"Z\" upalpha = \"A\" | \"B\" | \"C\" | \"D\" | \"E\" | \"F\" | \"G\" | \"H\" | \"I\" | \"J\" | \"K\" | \"L\" | \"M\" | \"N\" | \"O\" | \"P\" | \"Q\" | \"R\" | \"S\" | \"T\" | \"U\" | \"V\" | \"W\" | \"X\" | \"Y\" | \"Z\" の数字= \"0\" | \"1\" | \"2\" | \"3\" | \"4\" | \"5\" | \"6\" | \"7\" | \"8\" | \"9\""
    },
    {
      "indent": 0,
      "text": "11. Acknowledgements",
      "section_title": true,
      "ja": "11.謝辞"
    },
    {
      "indent": 3,
      "text": "This specification was extensively reviewed by the NFS group at SunSoft and brainstormed by Michael Eisler.",
      "ja": "この仕様は、広範囲のSunSoftでNFSグループで検討し、マイケル・アイスラーによって出し合いました。"
    },
    {
      "indent": 0,
      "text": "12. Author's Address",
      "section_title": true,
      "ja": "12.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Address comments related to this RFC to:",
      "ja": "このRFCに関連するコメントを住所："
    },
    {
      "indent": 6,
      "text": "brent@eng.sun.com",
      "ja": "ｂれんｔ＠えんｇ。すん。こｍ"
    },
    {
      "indent": 3,
      "text": "Brent Callaghan Sun Microsystems, Inc. Mailstop Mpk17-201, 901 San Antonio Road, Palo Alto, California 94303",
      "ja": "ブレントキャラハンサン・マイクロシステムズ株式会社メールストップMpk17-201、901サンアントニオの道、パロアルト、カリフォルニア94303"
    },
    {
      "indent": 3,
      "text": "Phone: 1-415-786-5067 EMail: brent.callaghan@eng.sun.com Fax: 1-415-786-5896",
      "ja": "電話：1-415-786-5067 Eメール：brent.callaghan@eng.sun.comファックス：1-415-786-5896"
    },
    {
      "indent": 0,
      "text": "13. Full Copyright Statement",
      "section_title": true,
      "ja": "13.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1997). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1997）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implmentation may be prepared, copied, published andand distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピー、公表andand配布することができることを説明したり、そのimplmentationを支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\"",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています権利または特定の目的に対する商品性または適合性の黙示の保証を侵害し。」"
    }
  ]
}