{
  "title": {
    "text": "RFC 2754 - RPS IANA Issues",
    "ja": "RFC 2754 - RPS IANA問題"
  },
  "number": 2754,
  "created_at": "2019-10-29 19:23:22.861022+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                    C. Alaettinoglu\nRequest for Comments: 2754                                       USC/ISI\nCategory: Informational                                    C. Villamizar\n                                                           Avici Systems\n                                                             R. Govindan\n                                                                 USC/ISI\n                                                            January 2000",
      "raw": true
    },
    {
      "indent": 28,
      "text": "RPS IANA Issues",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "RPS Security [2] requires certain RPSL [1] objects in the IRR to be hierarchically delegated. The set of objects that are at the root of this hierarchy needs to be created and digitally signed by IANA. This paper presents these seed objects and lists operations required from IANA.",
      "ja": "RPSセキュリティ[2] IRRのオブジェクトが階層的に委任されている[1]特定のRPSLを必要とします。この階層のルートにあるオブジェクトのセットが作成され、デジタルIANAによって署名する必要があります。本論文では、これらの種のオブジェクトを提示し、IANAから必要な操作を示しています。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119.",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119に記載されるように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1 Initial Seed",
      "ja": "1初期シード"
    },
    {
      "indent": 3,
      "text": "A public key of IANA needs to be distributed with the software implementations of Distributed Routing Policy System [3]. An initial set of seed objects are needed to be signed with this key. The following transaction (the transaction format is defined in [3]) contains these objects and is signed by this key: mntner: mnt-iana descr: iana's maintainer admin-c: JKR1 tech-c: JKR1 upd-to: JKRey@ISI.EDU mnt-nfy: JKRey@ISI.EDU auth: pgpkey-7F6AA1B9 mnt-by: mnt-iana referral-by: mnt-iana source: IANA",
      "ja": "IANAの公開鍵は、分散型ルーティングポリシーシステムのソフトウェア実装[3]と一緒に配布する必要があります。シードオブジェクトの最初のセットは、この鍵で署名される必要があります。次のトランザクション（トランザクションフォーマットは[3]で定義されている）は、これらのオブジェクトが含まれており、このキーによって署名されていますのmntner：mntを-IANAのDESCR：IANAのメンテナ管理者-C：JKR1ハイテク-C：JKR1 UPD-へ：JKRey @ ISI .EDUのMNT-NFY：JKRey@ISI.EDU AUTH：pgpkey-7F6AA1B9のMNT-によって：MNT-IANAの紹介・バイ：MNT-IANAソース：IANA"
    },
    {
      "indent": 3,
      "text": "key-cert: pgpkey-7F6AA1B9\nmethod: pgp\nowner:  iana-root (est. Nov 98) <iana@iana.org>\nfingerpr: 71 09 2E 37 71 B8 0A 9C  3B 28 98 B4 F1 21 13 BB\ncertif: # this is the real IANA key\n+ -----BEGIN PGP PUBLIC KEY BLOCK-----\n+ Version: 2.6.2\n+\n+ mQCNAzZJ52sAAAEEAJ//C01YnlaGuXyrC16V7FphkRvBmcNU22TPOzrKnKjnWjH5\n+ sJ5UQnGOpyhDc796gqBjY+lTLvPB9sFGJPWgxfNk2JQaxxLTD+tfqSsiURc/srpp\n+ XohFAVR/fez8MOecISwvNpFh5VADuFuoNi7ZLuOwVTC4tM5RU0NJa8l/aqG5AAUR\n+ tCdpYW5hLXJvb3QgKGVzdC4gTm92IDk4KSA8aWFuYUBpYW5hLm9yZz4=\n+ =sF4q\n+ -----END PGP PUBLIC KEY BLOCK-----\nmnt-by: mnt-iana\nsource: IANA",
      "raw": true
    },
    {
      "indent": 3,
      "text": "repository: IANA repository-cert: PGPKEY-88BAC849 query-address: http://www.iana.org response-auth-type: none submit-address: http://www.iana.org submit-auth-type: none expire: 0000 04:00:00 heartbeat-interval: 0000 01:00:00 admin-c: JKR1 tech-c: JKR1 mnt-by: mnt-iana source: IANA as-block: AS0 - AS65535 descr: as number space country: us admin-c: JKR1 tech-c: JKR1 status: UNALLOCATED source: IANA mnt-by: mnt-iana mnt-lower: mnt-iana",
      "ja": "リポジトリ：IANAリポジトリ-CERT：PGPKEY-88BAC849問合せアドレス：http://www.iana.org応答-AUTH型：なし提出-アドレス：http://www.iana.org提出-AUTH型：なし有効期限が切れる：0000 4時00分00秒ハートビートインターバル：0000 1時○○分00秒管理者-C：JKR1ハイテク-C：JKR1 MNT-によって：MNT-IANAソース：IANAのようにブロック：AS0  -  AS65535のDESCR：番号のスペースとして国：私たちの管理者-C：JKR1ハイテク-C：JKR1ステータス：UNALLOCATEDソース：IANA MNT-によって：mntを-IANA MNT-下：MNT-IANA"
    },
    {
      "indent": 3,
      "text": "inetnum: 0.0.0.0 - 255.255.255.255 netname: Internet descr: ip number space country: us admin-c: JKR1 tech-c: JKR1 status: UNALLOCATED source: IANA mnt-by: mnt-iana mnt-lower: mnt-iana",
      "ja": "inetnum：0.0.0.0  -  255.255.255.255ネット名：インターネットDESCR：IP番号空間の国：私たちの管理者-C：JKR1ハイテク-C：JKR1ステータス：UNALLOCATEDソース：IANA MNT-によって：mntを-IANA MNT-下：mntに、IANA"
    },
    {
      "indent": 3,
      "text": "timestamp: 19991001 01:00:00 +00:00",
      "ja": "タイムスタンプ：19991001 1時00分00秒00：00"
    },
    {
      "indent": 3,
      "text": "signature:\n+ -----BEGIN PGP SIGNATURE-----\n+ Version: 2.6.2\n+\n+ iQCVAwUBOAd3YENJa8l/aqG5AQFVdAP9Ho2TSLGXiDi6v1McsKY4obO32EtP44Jv\n+ tpNWiRRz47WIpMBmzUrQajBDNNXzwq9r9mGC75Pg0MMwTDfvA47o6mnIGdT9XyZz\n+ s9HlDGOqhklIjHOxXFDrBiz3u7eWEf3vmDCXt6UYg9lUtRKefkWtR5wD1Q1zDMSc\n+ 7Ya7PE6X8SU=\n+ =sAft\n+ -----END PGP SIGNATURE-----",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The above text has no extra white space characters at the end of each line, and contains no tab characters. All blank line sequences contain only a single blank line. The page break in the text is also a single blank line.",
      "ja": "上記のテキストは、各行の末尾に余分な空白文字を持っていない、と何のタブ文字が含まれていません。すべての空白行のシーケンスは、単一の空白行が含まれています。テキストでの改ページは、単一の空白行です。"
    },
    {
      "indent": 3,
      "text": "In this case, we assumed that IANA runs its own repository. However this is not a requirement. Instead, it may publish this transaction with an existing routing registry.",
      "ja": "この場合、私たちは、IANAは、独自のリポジトリを実行することを想定しました。しかし、これは必須ではありません。代わりに、既存のルーティングレジストリでこのトランザクションを発行することがあります。"
    },
    {
      "indent": 0,
      "text": "2 IANA Assignments",
      "ja": "2つのIANAの割り当て"
    },
    {
      "indent": 3,
      "text": "Each time IANA makes an assignment, it needs to create inetnum and as-block objects as appropriate and digitally sign them using the key in its key-cert object. For example: as-block: AS0 - AS500 descr: arin's space country: us status: ALLOCATED source: iana delegated: arin mnt-by: mnt-iana",
      "ja": "IANAが割り当てを作るたびに、適宜のinetnumおよびAS-ブロックオブジェクトを作成し、デジタルでその鍵証明書のオブジェクトのキーを使用して署名する必要があります。たとえば、次のようにブロック：AS0  -  AS500のDESCR：ARINの宇宙国：私たちのステータス：ALLOCATEDソース：IANAは委任：ARINのMNT-によって：mntに、IANA"
    },
    {
      "indent": 3,
      "text": "inetnum: 128.0.0.0 - 128.255.255.255 netname: Internet portion descr: ip number space country: us status: ALLOCATED source: iana delegated: arin mnt-by: mnt-iana",
      "ja": "inetnum：128.0.0.0  -  128.255.255.255ネット名：インターネット部DESCR：IP番号空間の国：私たちのステータス：ALLOCATEDソース：IANAは委任：ARIN MNT-によって：mntに、IANA"
    },
    {
      "indent": 0,
      "text": "3 Creating Routing Repositories",
      "ja": "3ルーティングリポジトリの作成"
    },
    {
      "indent": 3,
      "text": "To enable a new routing repository, a repository object, a maintainer object and a key-cert object need to be created and digitally signed by IANA. For example:",
      "ja": "新しいルーティングリポジトリを有効にするには、リポジトリオブジェクト、メンテナオブジェクトとキー証明書オブジェクトが作成され、デジタルIANAによって署名する必要があります。例えば："
    },
    {
      "indent": 5,
      "text": "mntner: mnt-ripe descr: RIPE's maintainer auth: <ripe's choice> mnt-by: mnt-ripe referral-by: mnt-iana admin-c: . . . tech-c: . . . upd-to: . . . mnt-nfy: . . . source: RIPE",
      "ja": "mntner：mntに熟しDESCR：RIPEのメンテナ払い：<熟したの選択> MNT-によって：MNT-熟し紹介・バイ：mntを-IANAの管理者-C：。 。 。ハイテクC：。 。 。 UPD-に：。 。 。 MNT-NFY：。 。 。ソース：RIPE"
    },
    {
      "indent": 5,
      "text": "key-cert: pgpkey-979979\nmethod: pgp\nowner:  . . .\nfingerpr: . . .\ncertif: # this key is for illustration only\n+       -----BEGIN PGP PUBLIC KEY BLOCK-----\n+       Version: PGP for Personal Privacy 5.0\n+\n+       . . .\n+       -----END PGP PUBLIC KEY BLOCK-----\nmnt-by: mnt-ripe\nsource: RIPE repository:         RIPE\nquery-address:      whois://whois.ripe.net\nresponse-auth-type: PGPKEY-23F5CE35 # pointer to key-cert object\nresponse-auth-type: none\nremarks:            you can request rsa signature on queries\nremarks:            PGP required on submissions\nsubmit-address:     mailto://auto-dbm@ripe.net\nsubmit-address:     rps-query://whois.ripe.net:43\nsubmit-auth-type:   pgp-key, crypt-pw, mail-from\nremarks:            these are the authentication types supported\nmnt-by:             maint-ripe-db\nexpire:             0000 04:00:00\nheartbeat-interval: 0000 01:00:00\n...\nremarks:            admin and technical contact, etc\nsource:             RIPE",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This very first transaction of a new repository is placed in the new repository, not in the IANA repository.",
      "ja": "新しいリポジトリのこの非常に最初のトランザクションがないIANAリポジトリで、新しいリポジトリに配置されます。"
    },
    {
      "indent": 0,
      "text": "4 Security Considerations",
      "ja": "4つのセキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Routing policy system security document [2] defines an hierarchical authorization model for objects stored in the routing registries. This document specifies the seed objects and the actions need to be taken by IANA to maintain the root of that authorization hierarchy.",
      "ja": "ルーティングポリシーシステムのセキュリティ文書[2]は、ルーティング・レジストリに格納されたオブジェクトの階層的な認可モデルを定義します。この文書では、シードオブジェクトを指定し、アクションは、その承認階層のルートを維持するために、IANAによって取られる必要があります。"
    },
    {
      "indent": 0,
      "text": "5 IANA Considerations",
      "ja": "5つのIANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This whole document is for detailed consideration by IANA.",
      "ja": "この文書全体ではIANAによって詳細な検討のためです。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "リファレンス"
    },
    {
      "indent": 3,
      "text": "[1] Alaettinoglu, C., Bates, T., Gerich, E., Karrenberg, D., Meyer, D., Terpstra, M. and C. Villamizar, \"Routing Policy Specification Language (RPSL)\", RFC 2622, June 1999.",
      "ja": "[1] Alaettinoglu、C.、ベイツ、T.、Gerich、E.、Karrenberg、D.、マイヤー、D.、テルプストラ、M.とC. Villamizar、 \"ルーティングポリシー仕様言語（RPSL）\"、RFC 2622、 1999年6月。"
    },
    {
      "indent": 3,
      "text": "[2] Villamizar, C., Alaettinouglu, C., Meyer, D., Murphy, S. and C. Orange, \"Routing Policy System Security\", RFC 2725, December 1999.",
      "ja": "[2] Villamizar、C.、Alaettinouglu、C.、マイヤー、D.、マーフィー、S.とC.オレンジ、 \"ルーティングポリシーシステム・セキュリティ\"、RFC 2725、1999年12月。"
    },
    {
      "indent": 3,
      "text": "[3] Villamizar, C., Alaettinouglu, C., Govindan, R. and D. Meyer, \"Distributed Routing Policy System\", Work in Progress.",
      "ja": "[3] Villamizar、C.、Alaettinouglu、C.、ゴヴィンダン、R.およびD.マイヤー、 \"ルーティングポリシー分散システム\" が進行中で働いています。"
    },
    {
      "indent": 0,
      "text": "6 Authors' Addresses",
      "ja": "6本の著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Cengiz Alaettinoglu USC Information Sciences Institute",
      "ja": "チンギスAlaettinogl USC情報科学研究所"
    },
    {
      "indent": 3,
      "text": "EMail: cengiz@isi.edu",
      "ja": "メールアドレス：cengiz@isi.edu"
    },
    {
      "indent": 3,
      "text": "Curtis Villamizar Avici Systems",
      "ja": "カーティスVillamizar Aviciシステム"
    },
    {
      "indent": 3,
      "text": "EMail: curtis@avici.com",
      "ja": "メールアドレス：curtis@avici.com"
    },
    {
      "indent": 3,
      "text": "Ramesh Govindan USC Information Sciences Institute",
      "ja": "ラメシュ・ガバインダンUSC情報科学研究所"
    },
    {
      "indent": 3,
      "text": "EMail: govindan@isi.edu",
      "ja": "メールアドレス：govindan@isi.edu"
    },
    {
      "indent": 0,
      "text": "7 Notices",
      "ja": "7つの注意事項"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、そのような権限下で、ライセンスがたりないかもしれない可能性があるためにどの本書または程度に記載されている技術の実装や使用に関係すると主張される可能性があります任意の知的財産やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能。また、そうした権利を特定するために取り組んできたことを表していないん。スタンダードトラックおよび標準関連文書における権利に関するIETFの手続きの情報は、BCP-11に記載されています。権利の主張のコピーは、出版のために利用可能とライセンスの保証が利用できるようにする、または本仕様の実装者または利用者が、そのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、その注意にこの標準を実践するために必要な場合があり技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 IETF専務に情​​報を扱ってください。"
    },
    {
      "indent": 0,
      "text": "8 Full Copyright Statement",
      "ja": "8フル著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}