{
  "title": {
    "text": "RFC 2352 - A Convention For Using Legal Names as Domain Names",
    "ja": "RFC 2352 - ドメイン名と氏名権を使用するための条約"
  },
  "number": 2352,
  "created_at": "2019-10-23 13:47:24.423544+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         O. Vaughan\nRequest for Comments: 2352                           Vaughan Enterprises\nObsoletes: 2240                                                 May 1998\nCategory: Informational",
      "raw": true
    },
    {
      "indent": 11,
      "text": "A Convention For Using Legal Names as Domain Names",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "RFC Editor's Note",
      "ja": "RFC編集者のメモ"
    },
    {
      "indent": 3,
      "text": "This RFC is an independent submission that discusses a possible convention for allocating domain names based on corporate and other names as registered by law.",
      "ja": "このRFCは、法律で登録して、企業や他の名前に基づいてドメイン名を割り当てるための可能な規則を説明し、独立し提出します。"
    },
    {
      "indent": 3,
      "text": "It appears to depend on corporations changing their domain names from their present form to more cumbersome handles, such as changing cisco.com to cisco-systems.co.ca.us or ibm.com to international-business-machines.co.ny.us, without giving them an incentive to do so, such as deprecating the .com and .net gTLDs. It also appears to legislate the structure each national registry applies to its name space, something which the document itself asserts is within national purview and not for global standardization.",
      "ja": "このような国際的なビジネス-machines.co.nyにcisco-systems.co.ca.usするcisco.comまたはibm.comを変更するなど、より面倒なハンドルに彼らの現在の形から自分のドメイン名を変更する企業に依存するように表示されます。私たちは、彼らにインセンティブを与えることなく、そのような.COMと.NETのgTLDを卑下として、そうします。また、各国家登録簿は、その名前空間、自身が主張する文書が国家の範囲内ではなくグローバルな標準化のためにあるものに適用される構造を法制化するように見えます。"
    },
    {
      "indent": 3,
      "text": "It may not be politically feasible to implement as described.",
      "ja": "説明するように実装するために政治的に実現可能ではないかもしれません。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.   Introduction . . . . . . . . . . . . . . . . . . . . . . . . 2",
      "section_title": true,
      "raw": true
    },
    {
      "indent": 3,
      "text": "2.   Overview of the domain space . . . . . . . . . . . . . . . . 2",
      "section_title": true,
      "raw": true
    },
    {
      "indent": 3,
      "text": "3.   Possible solutions to name exhaustion  . . . . . . . . . . . 4",
      "section_title": true,
      "raw": true
    },
    {
      "indent": 3,
      "text": "4.   Proposed solution  . . . . . . . . . . . . . . . . . . . . . 4\n4.1   The world is not flat so why should domains be? . . . . . . 4\n4.2   The case for legal names  . . . . . . . . . . . . . . . . . 5\n4.3   Allocation of legal sub-domains . . . . . . . . . . . . . . 5\n4.4   Allocation of miscellaneous sub-domains . . . . . . . . . . 6\n4.5   Identifiers in non-ASCII languages  . . . . . . . . . . . . 6\n4.6   Non-textual identifiers . . . . . . . . . . . . . . . . . . 7\n5.   Security Considerations  . . . . . . . . . . . . . . . . . . 7",
      "raw": true
    },
    {
      "indent": 3,
      "text": "6.   References . . . . . . . . . . . . . . . . . . . . . . . . . 7",
      "section_title": true,
      "raw": true
    },
    {
      "indent": 3,
      "text": "7.   Authors' Address . . . . . . . . . . . . . . . . . . . . . . 7",
      "section_title": true,
      "raw": true
    },
    {
      "indent": 3,
      "text": "8.   Full Copyright Statement . . . . . . . . . . . . . . . . . . 8",
      "section_title": true,
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The purpose of this memo is to focus discussion on the particular problems with the exhaustion of the top level domain space in the Internet and the possible conflicts that can occur when multiple organisations are vying for the same name. The proposed solutions in this document are intended as a framework for development, such that a general consensus will emerge as to the appropriate solution to the problems in each case, leading eventually to the adoption of standards.",
      "ja": "このメモの目的は、複数の組織が同じ名前を争っているときに発生することができ、インターネットのトップレベルドメイン空間との衝突の可能性の枯渇を持つ特定の問題に議論を集中することです。この文書で提案された解決策は、一般的なコンセンサスが基準の採用に最終的につながる、それぞれの場合に問題に適切な溶液へとして出現するように開発するためのフレームワークとして意図されています。"
    },
    {
      "indent": 0,
      "text": "2. Overview of the domain space",
      "section_title": true,
      "ja": "ドメイン空間の2の概要"
    },
    {
      "indent": 3,
      "text": "Presently the domain space is organised as a heirarchical tree-structured namespace with several top level domains (TLDs), and sub-domains beneath them. The initial TLDs allocated and rationale are documented in RFC 920 [1].",
      "ja": "現在、ドメイン空間は、それらの下にいくつかのトップレベルドメイン（TLDの）、およびサブドメインを持つ階層的ツリー構造のネームスペースとして編成されています。初期割り当てのTLDと理論的根拠は、RFC 920 [1]に記載されています。"
    },
    {
      "indent": 3,
      "text": "The TLDs are functionally split up into 'generic' top-level domains (gTLDs) and two-letter ISO 3166 country domains for every country in which Internet connectivity is provided. The allocation of sub-domains under these TLDs is entirely up to the registry for that TLD. The registry may decide to allocate further levels of structure or merely allocate domains in a 'flat' manner.",
      "ja": "TLDには、機能的にインターネット接続が提供されているすべての国のための「一般的な」トップレベルドメイン（gTLDを）と、2文字のISO 3166国のドメインに分割されています。これらのTLDの下のサブドメインの割り当ては、完全にそのTLDのレジストリまでです。レジストリは、構造体の更なるレベルを割り当てるか、単に「平坦な」方法でドメインを割り当てることを決定することができます。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 6,
      "text": "     +-----+         +----+                       +----+\n     | COM |         | UK |                       | FR |\n     +-----+         +----+                       +----+\n        |             |  |                         |  |\n +---------+     +----+  +----+     +--------------+  +-----+\n | VAUGHAN |     | AC |  | CO |     | UNIV-AVIGNON |  | AXA |\n +---------+     +----+  +----+     +--------------+  +-----+\n    |              |        |              |             |\n+------+    +---------+  +----------+   +-----+      +------+\n| UNIX |    | NEWPORT |  | CITYDESK |   | SOL |      | MAIL |\n+------+    +---------+  +----------+   +-----+      +------+\n                 |            |\n              +----+       +-----+\n              | NS |       | FTP |\n              +----+       +-----+",
      "raw": true
    },
    {
      "indent": 7,
      "text": "1. Flat gTLD 2. Heirarchical country 3. Flat country",
      "section_title": true,
      "ja": "1.フラットgTLDの2階層国3.フラット国"
    },
    {
      "indent": 3,
      "text": "In the example we see that the gTLDs are inherently flat, as organisations are allocated domain names directly under the TLD. With the country domains however, the domain allocation policy can vary widely from country to country, and it does. Some may choose to implement a functional sub-structure mirroring the gTLDs, some may choose to implement a geographical sub-structure, and some may choose to have no sub-structure at all.",
      "ja": "例では、組織がTLD直下のドメイン名を割り当てられているとしてのgTLDは、本質的に平坦であることがわかります。国が一方のドメインと、ドメイン配分方針は国によって大きく異なることができ、そしてそれはありません。いくつかは、いくつかの地理的なサブ構造を実装することを選択することができ、いくつかは全くのサブ構造を持たないことを選択すること、のgTLDをミラーリング機能のサブ構造を実装することを選択できます。"
    },
    {
      "indent": 3,
      "text": "In the first case the organisation is clearly a commercial one, as it is allocatged under the \"COM\" TLD. However, there is no information as to the country the organisation is based in. In the third case, we know that the organisation is based in France (FR), but without studying the actual organisation name we do not know what type of organisation it is. In the second case, we know the country that both organisations are based in (UK), and by following the heirarchy, we can deduce that the first is an academic organisation (AC), and the second is commercial (CO).",
      "ja": "それは、「COM」TLDの下allocatgedされる最初のケースでは、組織は、明らかに、市販の一つです。組織がに基づいて国にしかし、何の情報はありません。三番目のケースでは、我々は組織がフランス（FR）に基づいていることを知っているが、実際の組織名を勉強せずに、私たちはどのような種類の組織のことを知りませんです。後者の場合には、我々は両方の組織が（UK）に基づいていること、国を知っているし、階層構造に従うことによって、我々は最初の学術団体（AC）であると推測することができ、第二は、商用（CO）です。"
    },
    {
      "indent": 3,
      "text": "While the system is flexible in not enforcing a strict heirarchy, it can lead to exhaustion of domain names in the generic space and lead to conflicts between organisations who may both have a legitimate claim to have a particular name.",
      "ja": "システムは、厳密な階層構造を強制ではないに柔軟であるが、それは一般的な空間でのドメイン名の枯渇につながるとの両方の特定の名前を持っている正当な主張を持って組織間の紛争につながることができます。"
    },
    {
      "indent": 0,
      "text": "3. Possible solutions to name exhaustion",
      "section_title": true,
      "ja": "名前の枯渇に3可能な解決策"
    },
    {
      "indent": 3,
      "text": "With such a flexible system, there are many ways of preventing the name space being exhausted. A solution proposed by [2] is to create more gTLDs to allow organisations with the same name to be registered uniquely under different TLDs (FIRM, STORE, WEB, ARTS, REC, INFO and NOM). However, this has several disadvantages as discussed below:",
      "ja": "柔軟なシステムでは、排気される名前空間を防止する多くの方法があります。 [2]で提案された解決策は、同じ名前の組織が異なるのTLD（FIRM、STORE、WEB、ARTS、REC、INFOおよびNOM）の下に一意に登録されることを可能にする複数のgTLDを作成することです。後述のようにしかし、これにはいくつかの欠点があります。"
    },
    {
      "indent": 3,
      "text": "a) It creates confusion in users mind as to what TLD refers to a particular organisation. For example, MCDONALDS.COM maybe the fast food corporation and MCDONALDS.FIRM maybe a firm of lawyers, but how is the user supposed to know which is which?",
      "ja": "何TLD特定の組織を指しするようA）これにより、ユーザーの心の中に混乱を作成します。例えば、MCDONALDS.COMは多分ファーストフード企業と多分MCDONALDS.FIRM弁護士の事務所は、どのユーザーがどのであるかを知ることになっているが、？"
    },
    {
      "indent": 3,
      "text": "b) To prevent the above confusion, big corporations will simply reserve all the different variations of the name, ie. IBM.COM, IBM.FIRM, IBM.STORE etc. Thus we haven't solved the name exhaustion or conflict problems, in fact we have made it worse.",
      "ja": "B）上記の混乱を防ぐために、大企業は単につまり、名前のすべての異なるバリエーションを予約します。 IBM.COM、IBM.FIRM、IBM.STOREなどしたがって、私たちは、実際に我々はそれが悪化している、名前の枯渇や競合の問題を解決していません。"
    },
    {
      "indent": 3,
      "text": "c) Names of legitimate trade mark holders or other legally held names can still be acquired by anybody, leading to potential conflicts.",
      "ja": "C）合法的な商標の所有者の名前またはその他の法的に開催された名前はまだ潜在的な紛争につながる、誰でも取得することができます。"
    },
    {
      "indent": 3,
      "text": "Another set of possible solutions are discussed by The World Intellectual Property Organisation [4] but this only addresses dispute resolution when trademarks are used as domain names under gTLDs, and not in the full legal context of their origin of registration.",
      "ja": "可能な解決策の別のセット世界知的所有権機関で議論されている[4]が、商標はのgTLDの下ではなく、登録の彼らの起源の完全な法的文脈におけるドメイン名として使用され、このアドレスのみの紛争解決。"
    },
    {
      "indent": 0,
      "text": "4. Proposed solution",
      "section_title": true,
      "ja": "4.提案するソリューション"
    },
    {
      "indent": 3,
      "text": "With the aforementioned problems in mind, it is not a good idea to create new gTLDs which merely overlap the existing ones. As the domain name system is heirarchical it would seem a good idea to expand on the existing structure rather than creating several duplicate structures.",
      "ja": "心の中で前述した問題で、単に既存のものと重複する新gTLDを作成するのは良いアイデアではありません。ドメインネームシステムは、階層的であるとして、むしろ、いくつかの重複した構造体を作成するよりも、既存の構造に展開する良いアイデアを思われます。"
    },
    {
      "indent": 0,
      "text": "4.1 The world is not flat so why should domains be?",
      "section_title": true,
      "ja": "4.1世界は平坦ではないので、なぜドメインはすべきですか？"
    },
    {
      "indent": 3,
      "text": "With the expansion of the Internet to a truly global medium, the notion that there can only be one commercial entity, one orgnisation, and one network provider etc. with the same name seems impossible. This is the situation that the present system finds itself in. There is a constantly spiralling number of disputes over who 'owns' or 'deserves' a certain name, with an increasing number ending in unnecessary and costly legal action. This is not something that the providers of a domain name service should concern themselves with, but yet with the present system, this seems inevitable.",
      "ja": "真にグローバルなメディアへのインターネットの拡大に​​伴い、唯一営利団体、1 orgnisation、および1つのネットワーク・プロバイダが同じ名前を持つなどがあり得ること概念は不可能です。これは、本システムはで自分自身を発見している状況である。「所有」や不要と費用のかかる訴訟で終わる増加して、特定の名前を「値する」誰紛争の絶えずスパイラル数があります。これは、ドメインネームサービスの提供者は、自分自身との懸念すべきものではありませんが、まだ本発明のシステムで、これは避けられないようです。"
    },
    {
      "indent": 0,
      "text": "4.2 The case for legal names",
      "section_title": true,
      "ja": "氏名権について4.2の場合"
    },
    {
      "indent": 3,
      "text": "This proposal allows for country-code-based domain names that are related to legally registered names in the country (or locality, state or province within that country) that they are based in, by creating a functional heirarchy beneath the country TLD.",
      "ja": "この提案は、合法的に彼らは国のTLDの下に、機能階層構造を作成することにより、中基づいていること（その国の中や地域、州または県）国の名前を登録することが関係している国コードベースのドメイン名が可能になります。"
    },
    {
      "indent": 3,
      "text": "This proposal does not seek to do away with gTLDs, but rather suggests that a legal name should be sought first and then, if desired, a generic name could be used alongside it. The organisation would then, in case of any disputes, have a legally-held name which no other organisation could have any claim to.",
      "ja": "この提案はのgTLDを廃止することを求めるのではなく、法律上の名前が最初に必要に応じて、その後、一般名はそれと一緒に使用することができ求めるべきであることを示唆していません。組織は、その後、任意の紛争の場合には、他の組織はにどんな主張を持っていない可能性が合法的にホールドされた名前を持っているでしょう。"
    },
    {
      "indent": 3,
      "text": "This proposal has several advantages:",
      "ja": "この提案は、いくつかの利点があります。"
    },
    {
      "indent": 3,
      "text": "a) The process of deciding what names belong to which organisation is no longer a function of the domain name registry, but of the company name or trade mark registration authority in the given locality. This means that disputes over names cannot arise as all names are unique within the context of the legal name.",
      "ja": "a）はどのような名前を決定するプロセスが属する組織がなく、与えられた地域で会社名や商標登録機関の、もはやドメイン名レジストリの関数であるとします。これは、すべての名前が正式名称のコンテキスト内で一意であるとして名をめぐる紛争が生じないことを意味します。"
    },
    {
      "indent": 3,
      "text": "b) As all names are unique, there should be no exhaustion (deliberately or otherwise) of 'desirable' names by other concerns, as all the owners of legally-held names will automatically have the right to the relevant domain name.",
      "ja": "すべての名前が一意であるとして法的開催された名前のすべての所有者は、自動的に関連するドメイン名への権利を持つことになりますとb）に示すように、他の懸念は '望ましいの名前のない消耗（故意またはそれ以外）があってはなりません。"
    },
    {
      "indent": 0,
      "text": "4.3 Allocation of legal sub-domains",
      "section_title": true,
      "ja": "法律上のサブドメインの4.3配分"
    },
    {
      "indent": 6,
      "text": "The sub-domain identifiers should be created from the existing\nindentifiers for company names and trade marks within the given\nlocality, state, province or country.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "The general form of such a sub-domain is:",
      "ja": "そのようなサブドメインの一般的な形態です。"
    },
    {
      "indent": 6,
      "text": "<legal-token>.<locality-identifier(s)>.<iso3166-country>",
      "ja": "<リーガルトークン>。<局所性識別子（S）>。<ISO3166カントリー>"
    },
    {
      "indent": 6,
      "text": "For example:",
      "ja": "例えば："
    },
    {
      "indent": 6,
      "text": "LTD.UK for limited companies in the UK PLC.UK for public limited companies in the UK TM.FR for trademarks in France INC.<state>.US } LTD.<state>.US } for incorpated bodies in the US CO.<state>.US } (each is equivalent) CORP.<state>.US } LLC.<state>.US for limited liability companies in the US GMBH.DE for German companies",
      "ja": "フランスINCでの商標のための英国TM.FRで公開有限会社英国PLC.UKで限られた企業のためのLTD.UK。<状態> .US} LTD。<状態> .US}米国のCOでincorpated体のために。 <状態> .US}（それぞれが同等である）CORP。<状態> .US} LLC。ドイツ企業のための米国GMBH.DEでの有限責任会社のための<状態> .US"
    },
    {
      "indent": 3,
      "text": "The registry for the appropriate upper level country, state, province or locality domain should create entries in these sub-domains based on the laws for allocating such legal names in that particular country, state, province or locality. Specifically, the full legal name should be used, but omitting the legal token (eg. Ltd, Corp, etc.) as this will be determined by the choice of upper level domain. ALL spaces within the name should be converted to hyphens '-' and other punctuation either disregarded or also converted into hyphens.",
      "ja": "適切な上位国、州、地方や地域ドメインのレジストリは、その特定の国、州、地方または地域で、そのような法律上の名前を割り当てるための法律に基づいてこれらのサブドメイン内のエントリを作成する必要があります。具体的には、正式名称を使用する必要がありますが、このような法的トークン（例えば株式会社、株式会社など）を省略すると、上位レベルのドメインの選択によって決定されます。 「 - 」名内のすべてのスペースをハイフンに変換する必要がありますし、他の句読点はどちらか無視か、また、ハイフンに変換されます。"
    },
    {
      "indent": 3,
      "text": "For holders of international trademarks and other international names, the gTLD \"INT\" can be used in place of the country identifier. For example:",
      "ja": "国際商標および他の国際名の所有者については、gTLDの「INTは、」国識別子の代わりに使用することができます。例えば："
    },
    {
      "indent": 6,
      "text": "TM.INT } for international trademarks REG.INT }",
      "ja": "国際商標についてTM.INT}} REG.INT"
    },
    {
      "indent": 0,
      "text": "4.4 Allocation of miscellaneous sub-domains",
      "section_title": true,
      "ja": "その他のサブドメインの4.4割り振り"
    },
    {
      "indent": 3,
      "text": "In countries that do not have existing sub-structure it is strongly recommended that along with the creation of legal sub-domains described here, that other sub-domains be created for commercial entities, organisations, and academic entities to reduce remaining conflicts from organisations that are not legally-registered.",
      "ja": "他のサブドメインはその団体から、残りの競合を減らすために営利団体、機関、および学術エンティティを作成することを、ここで説明する法的なサブドメインの作成と一緒にいることを強く推奨されている既存のサブ構造を持っていない国では法的に登録されていません。"
    },
    {
      "indent": 3,
      "text": "For example:\n                  +------------------+\n               | ISO 3166 country | . . . . . . / / . .\n               +------------------+        .           .\n                |       |        |         .           .\n            +-----+  +-----+  +-----+   +-----+    +-------+\n            | AC/ |  | CO/ |  | OR/ |   | LTD |    | state |\n            | EDU |  | COM |  | ORG |   +-----+    +-------+\n            +-----+  +-----+  +-----+                  |\n                                                    +-----+\n                                                    | INC |\n                                                    +-----+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.5 Identifiers in non-ASCII languages",
      "section_title": true,
      "ja": "非ASCII言語で4.5識別子"
    },
    {
      "indent": 3,
      "text": "The representation of any domain element is limited to the ASCII character set of alphabetic characters, digits and the hyphen, as described in RFC 1035 [3]. The representation of names in languages that use other character sets is limited by that definition or any future update.",
      "ja": "RFC 1035に記載されているように、任意のドメイン要素の表現は、アルファベット文字、数字、ハイフンのASCII文字セットに制限されている[3]。他の文字セットを使用する言語の名前の表現は、その定義または任意の将来のアップデートによって制限されています。"
    },
    {
      "indent": 0,
      "text": "4.6 Non-textual identifiers",
      "section_title": true,
      "ja": "4.6非テキスト識別子"
    },
    {
      "indent": 3,
      "text": "The registration of non-textual trade marks such as logos or three dimensional shapes under this scheme is beyond the scope of this document. It is unlikely that these marks will need to be used in the way that domain names are used presently, but their use is not explicitly prohibited.",
      "ja": "そのようなこのスキームの下でロゴや3次元形状などの非テキストトレードマークの登録は、このドキュメントの範囲を超えています。これらのマークは、ドメイン名が現在使用されているが、その使用は、明示的に禁止されていないような方法で使用する必要があることはほとんどありません。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This memo raises no issues relating to network security. However, when delegating entries in sub-domains, the registries must ensure that the application contains sufficient evidence of the legal rights to a given name.",
      "ja": "このメモは、ネットワークセキュリティに関する一切の問題を提起していません。サブドメイン内のエントリを委任する場合しかし、レジストリは、アプリケーションが指定した名前に法的権利の十分な証拠が含まれていることを確認する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 3,
      "text": "[1] Postel J., and J. Reynolds , \"Domain Requirements\", RFC 920, October 1984.",
      "ja": "[1]ポステルJ.、およびJ.レイノルズ、 \"ドメイン要件\"、RFC 920、1984年10月。"
    },
    {
      "indent": 3,
      "text": "[2] \"Generic Top Level Domains - Memoranding of Understanding\", <URL:http://www.gtld-mou.org/>",
      "ja": "[2] \"ジェネリックトップレベルドメイン - 理解のMemoranding\"、<URL：のhttp：//www.gtld-mou.org/>"
    },
    {
      "indent": 3,
      "text": "[3] Mockapetris, P., \"Domain names - Implementation and Specification\", STD 13, RFC 1035, November 1987.",
      "ja": "[3] Mockapetris、P.、 \"ドメイン名 - 実装と仕様\"、STD 13、RFC 1035、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[4] \"Trademarks and Internet Domain Names\", <URL:http://www.wipo.int/eng/internet/domains/>",
      "ja": "[4] \"商標とインターネットドメイン名\"、<URL：のhttp：//www.wipo.int/eng/internet/domains/>"
    },
    {
      "indent": 0,
      "text": "7. Author's Address",
      "section_title": true,
      "ja": "7.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Owain Vaughan Vaughan Enterprises PO Box 155 Newport NP9 6YX UK",
      "ja": "Owainヴォーンヴォーン企業私書箱155ニューポートNP9 6YX英国"
    },
    {
      "indent": 3,
      "text": "Phone: +44 1633 677849/822164 Fax: +44 1633 663706 EMail: owain@vaughan.com",
      "ja": "電話：+44 1633 822164分の677849ファックス：+44 1633 663706 Eメール：owain@vaughan.com"
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}