{
  "title": {
    "text": "RFC 2873 - TCP Processing of the IPv4 Precedence Field",
    "ja": "RFC 2873 - IPv4優先順位フィールドのTCP処理"
  },
  "number": 2873,
  "created_at": "2024-01-18 17:17:56.884200+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            X. Xiao\nRequest for Comments: 2873                               Global Crossing\nCategory: Standards Track                                      A. Hannan\n                                                                    iVMG\n                                                               V. Paxson\n                                                              ACIRI/ICSI\n                                                               E. Crabbe\n                                                   Exodus Communications\n                                                               June 2000",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "TCP Processing of the IPv4 Precedence Field",
      "ja": "IPv4優先順位フィールドのTCP処理"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo describes a conflict between TCP [RFC793] and DiffServ [RFC2475] on the use of the three leftmost bits in the TOS octet of an IPv4 header [RFC791]. In a network that contains DiffServ-capable nodes, such a conflict can cause failures in establishing TCP connections or can cause some established TCP connections to be reset undesirably. This memo proposes a modification to TCP for resolving the conflict.",
      "ja": "このメモは、IPv4ヘッダー[RFC791]のTOSオクテットの3つの左端ビットの使用に関するTCP [RFC793]とdiffserv [RFC2475]の間の競合について説明しています。DiffServ対応ノードを含むネットワークでは、このような競合により、TCP接続の確立に障害を引き起こすか、確立されたTCP接続が望ましくないことを引き起こす可能性があります。このメモは、紛争を解決するためのTCPへの変更を提案しています。"
    },
    {
      "indent": 3,
      "text": "Because the IPv6 [RFC2460] traffic class octet does not have any defined meaning except what is defined in RFC 2474, and in particular does not define precedence or security parameter bits, there is no conflict between TCP and DiffServ on the use of any bits in the IPv6 traffic class octet.",
      "ja": "IPv6 [RFC2460]トラフィッククラスのOctetは、RFC 2474で定義されているものを除いて定義された意味を持たず、特に優先順位またはセキュリティパラメータービットを定義していないため、TCPとDiffservの間に矛盾はありません。IPv6トラフィッククラスOctet。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "In TCP, each connection has a set of states associated with it. Such states are reflected by a set of variables stored in the TCP Control Block (TCB) of both ends. Such variables may include the local and remote socket number, precedence of the connection, security level and compartment, etc. Both ends must agree on the setting of the precedence and security parameters in order to establish a connection and keep it open.",
      "ja": "TCPでは、各接続にはそれに関連する一連の状態があります。このような状態は、両端のTCP制御ブロック（TCB）に保存されている一連の変数に反映されます。このような変数には、ローカルおよびリモートのソケット番号、接続の優先順位、セキュリティレベル、コンパートメントなどが含まれます。両端は、接続を確立して開いたままにするために、優先順位とセキュリティパラメーターの設定に同意する必要があります。"
    },
    {
      "indent": 3,
      "text": "There is no field in the TCP header that indicates the precedence of a segment. Instead, the precedence field in the header of the IP packet is used as the indication. The security level and compartment are likewise carried in the IP header, but as IP options rather than a fixed header field. Because of this difference, the problem with precedence discussed in this memo does not apply to them.",
      "ja": "TCPヘッダーには、セグメントの優先順位を示すフィールドはありません。代わりに、IPパケットのヘッダーの優先順位フィールドが表示として使用されます。セキュリティレベルとコンパートメントは、同様にIPヘッダーに含まれていますが、固定ヘッダーフィールドではなくIPオプションとして配信されます。この違いのため、このメモで説明されている優先順位の問題はそれらには適用されません。"
    },
    {
      "indent": 3,
      "text": "TCP requires that the precedence (and security parameters) of a connection must remain unchanged during the lifetime of the connection. Therefore, for an established TCP connection with precedence, the receipt of a segment with different precedence indicates an error. The connection must be reset [RFC793, pp. 36, 37, 40, 66, 67, 71].",
      "ja": "TCPでは、接続の優先順位（およびセキュリティパラメーター）が、接続の寿命の間、変更されないままでなければならないことが必要です。したがって、優先順位を持つ確立されたTCP接続の場合、優先順位が異なるセグメントの受領はエラーを示します。接続をリセットする必要があります[RFC793、pp。36、37、40、66、67、71]。"
    },
    {
      "indent": 3,
      "text": "With the advent of DiffServ, intermediate nodes may modify the Differentiated Services Codepoint (DSCP) [RFC2474] of the IP header to indicate the desired Per-hop Behavior (PHB) [RFC2475, RFC2597, RFC2598]. The DSCP includes the three bits formerly known as the precedence field. Because any modification to those three bits will be considered illegal by endpoints that are precedence-aware, they may cause failures in establishing connections, or may cause established connections to be reset.",
      "ja": "DIFFSERVの出現により、中間ノードはIPヘッダーの差別化されたサービスCodePoint（DSCP）[RFC2474]を変更して、所望のPER-HOP挙動（PHB）[RFC2475、RFC2597、RFC2598]を示す場合があります。DSCPには、以前は優先順位フィールドとして知られていた3つのビットが含まれています。これらの3つのビットの変更は、優先順位を付与するエンドポイントによって違法と見なされるため、接続の確立に障害を引き起こすか、確立された接続をリセットする可能性があります。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "Segment: the unit of data that TCP sends to IP",
      "ja": "セグメント：TCPがIPに送信するデータの単位"
    },
    {
      "indent": 3,
      "text": "Precedence Field: the three leftmost bits in the TOS octet of an IPv4 header. Note that in DiffServ, these three bits may or may not be used to denote the precedence of the IP packet. There is no precedence field in the traffic class octet in IPv6.",
      "ja": "優先順位フィールド：IPv4ヘッダーのTOSオクテットの3つの左端ビット。diffservでは、これらの3つのビットを使用して、IPパケットの優先順位を示す場合と使用できない場合があります。IPv6のトラフィッククラスOctetに優先順位フィールドはありません。"
    },
    {
      "indent": 3,
      "text": "TOS Field: bits 3-6 in the TOS octet of IPv4 header [RFC 1349].",
      "ja": "TOSフィールド：IPv4ヘッダー[RFC 1349]のTOSオクテットのビット3-6。"
    },
    {
      "indent": 3,
      "text": "MBZ field: Must Be Zero",
      "ja": "MBZフィールド：ゼロでなければなりません"
    },
    {
      "indent": 3,
      "text": "The structure of the TOS octet is depicted below:",
      "ja": "TOSオクテットの構造を以下に示します。"
    },
    {
      "indent": 16,
      "text": "   0     1     2     3     4     5     6     7\n+-----+-----+-----+-----+-----+-----+-----+-----+\n|   PRECEDENCE    |          TOS          | MBZ |\n+-----+-----+-----+-----+-----+-----+-----+-----+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "DS Field: the TOS octet of an IPv4 header is renamed the Differentiated Services (DS) Field by DiffServ.",
      "ja": "DSフィールド：IPv4ヘッダーのTOSオクテットは、DiffServによってDisidemated Services（DS）フィールドに名前が変更されます。"
    },
    {
      "indent": 3,
      "text": "The structure of the DS field is depicted below:",
      "ja": "DSフィールドの構造を以下に示します。"
    },
    {
      "indent": 16,
      "text": "  0   1   2   3   4   5   6   7\n+---+---+---+---+---+---+---+---+\n|         DSCP          |  CU   |\n+---+---+---+---+---+---+---+---+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "DSCP: Differentiated Service Code Point, the leftmost 6 bits in the DS field.",
      "ja": "DSCP：DSフィールドの左端6ビット、差別化されたサービスコードポイント。"
    },
    {
      "indent": 3,
      "text": "CU: currently unused.",
      "ja": "CU：現在未使用。"
    },
    {
      "indent": 3,
      "text": "Per-hop Behavior (PHB): a description of the externally observable forwarding treatment applied at a differentiated services-compliant node to a behavior aggregate.",
      "ja": "PER-HOP Behavior（PHB）：差別化されたサービスに準拠したノードで適用された外部的に観察可能な転送処理の説明は、動作の集合体に適用されます。"
    },
    {
      "indent": 0,
      "text": "3. Problem Description",
      "section_title": true,
      "ja": "3. 問題の説明"
    },
    {
      "indent": 3,
      "text": "The manipulation of the DSCP to achieve the desired PHB by DiffServ-capable nodes may conflict with TCP's use of the precedence field. This conflict can potentially cause problems for TCP implementations that conform to RFC 793. First, page 36 of RFC 793 states:",
      "ja": "DIFFSERV対応ノードによる目的のPHBを達成するためのDSCPの操作は、TCPの優先順位フィールドの使用と競合する可能性があります。この競合は、RFC 793に準拠するTCP実装の問題を引き起こす可能性があります。まず、RFC 793の36ページは次のとおりです。"
    },
    {
      "indent": 7,
      "text": "If the connection is in any non-synchronized state (LISTEN, SYN-SENT, SYN-RECEIVED), and the incoming segment acknowledges something not yet sent (the segment carries an unacceptable ACK), or if an incoming segment has a security level or compartment which does not exactly match the level and compartment requested for the connection, a reset is sent. If our SYN has not been acknowledged and the precedence level of the incoming segment is higher than the precedence level requested then either raise the local precedence level (if allowed by the user and the system) or send a reset; or if the precedence level of the incoming segment is lower than the precedence level requested then continue as if the precedence matched exactly (if the remote TCP cannot raise the precedence level to match ours this will be detected in the next segment it sends, and the connection will be terminated then). If our SYN has been acknowledged (perhaps in this incoming segment) the precedence level of the incoming segment must match the local precedence level exactly, if it does not a reset must be sent.",
      "ja": "接続が非同期状態（聞き、syn-sent、syn-received）にあり、着信セグメントがまだ送信されていないもの（セグメントには許容できないACKが含まれている）、または着信セグメントにセキュリティレベルがある場合、またはセキュリティレベルがある場合、または接続の要求されたレベルとコンパートメントと正確に一致しないコンパートメントは、リセットが送信されます。Synが認められておらず、着信セグメントの優先レベルが要求された優先レベルよりも高い場合、ローカルの優先レベル（ユーザーとシステムが許可されている場合）を上げるか、リセットを送信します。または、受信セグメントの優先順位レベルが要求された優先レベルよりも低い場合、優先順位が正確に一致しているかのように継続します（リモートTCPが私たちのものと一致するように優先度レベルを上げることができない場合、これは送信する次のセグメントで検出されます。接続は終了します）。synが（おそらくこの着信セグメントで）認められている場合、着信セグメントの優先レベルは、リセットを送信する必要がない場合、ローカルの優先順位レベルと正確に一致する必要があります。"
    },
    {
      "indent": 3,
      "text": "This leads to Problem #1: For a precedence-aware TCP module, if during TCP's synchronization process, the precedence fields of the SYN and/or ACK packets are modified by the intermediate nodes, resulting in the received ACK packet having a different precedence from the precedence picked by this TCP module, the TCP connection cannot be established, even if both modules actually agree on an identical precedence for the connection.",
      "ja": "これは問題＃1につながります：優先順位を付けるTCPモジュールの場合、TCPの同期プロセス中に、Synおよび/またはACKパケットの優先フィールドが中間ノードによって変更され、受信したACKパケットが異なる優先順位を持つことになります。このTCPモジュールによって選択された優先順位は、両方のモジュールが実際に接続の同一の優先順位に同意しても、TCP接続を確立することはできません。"
    },
    {
      "indent": 3,
      "text": "Then, on page 37, RFC 793 states:",
      "ja": "次に、37ページで、RFC 793は次のように述べています。"
    },
    {
      "indent": 7,
      "text": "If the connection is in a synchronized state (ESTABLISHED, FIN-WAIT-1, FIN-WAIT-2, CLOSE-WAIT, CLOSING, LAST-ACK, TIME-WAIT), security level, or compartment, or precedence which does not exactly match the level, and compartment, and precedence requested for the connection, a reset is sent and connection goes to the CLOSED state.",
      "ja": "接続が同期された状態（確立された、Fin-Wait-1、Fin-Wait-2、Close-Wait、閉鎖、Last-ack、Time-Wait）、セキュリティレベル、またはコンパートメント、または正確ではない優先順位にある場合レベル、コンパートメント、および接続の要求された優先順位を一致させると、リセットが送信され、接続が閉じた状態になります。"
    },
    {
      "indent": 3,
      "text": "This leads to Problem #2: For a precedence-aware TCP module, if the precedence field of a received segment from an established TCP connection has been changed en route by the intermediate nodes so as to be different from the precedence specified during the connection setup, the TCP connection will be reset.",
      "ja": "これは問題＃2につながります：優先順位を付けるTCPモジュールの場合、確立されたTCP接続からの受信セグメントの優先順位フィールドが、接続セットアップ中に指定された優先順位とは異なるように、中間ノードによって途中で変更された場合、TCP接続がリセットされます。"
    },
    {
      "indent": 3,
      "text": "Each of problems #1 and #2 has a mirroring problem. They cause TCP connections that must be reset according to RFC 793 not to be reset.",
      "ja": "＃1と＃2のそれぞれには、ミラーリングの問題があります。それらは、RFC 793に従ってリセットされないようにリセットする必要があるTCP接続を引き起こします。"
    },
    {
      "indent": 3,
      "text": "Problem #3: A TCP connection may be established between two TCP modules that pick different precedence, because the precedence fields of the SYN and ACK packets are modified by intermediate nodes, resulting in both modules thinking that they are in agreement for the precedence of the connection.",
      "ja": "問題＃3：SynとACKパケットの優先フィールドが中間ノードによって変更され、両方のモジュールが同意していると考えているため、異なる優先順位を選択する2つのTCPモジュール間にTCP接続が確立される場合があります。繋がり。"
    },
    {
      "indent": 3,
      "text": "Problem #4: A TCP connection has been established normally by two TCP modules that pick the same precedence. But in the middle of the data transmission, one of the TCP modules changes the precedence of its segments. According to RFC 793, the TCP connection must be reset. In a DiffServ-capable environment, if the precedence of the segments is altered by intermediate nodes such that it retains the expected value when arriving at the other TCP module, the connection will not be reset.",
      "ja": "問題＃4：TCP接続は通常、同じ優先順位を選択する2つのTCPモジュールによって確立されています。ただし、データ送信の途中では、TCPモジュールの1つがセグメントの優先順位を変更します。RFC 793によると、TCP接続をリセットする必要があります。Diffserv対応環境では、セグメントの優先順位が中間ノードによって変更され、他のTCPモジュールに到着するときに期待値を保持する場合、接続はリセットされません。"
    },
    {
      "indent": 0,
      "text": "4. Proposed Modification to TCP",
      "section_title": true,
      "ja": "4. TCPへの提案された変更"
    },
    {
      "indent": 3,
      "text": "The proposed modification to TCP is that TCP must ignore the precedence of all received segments. More specifically:",
      "ja": "TCPの提案された変更は、TCPが受信したすべてのセグメントの優先順位を無視する必要があることです。すなわち："
    },
    {
      "indent": 3,
      "text": "(1) In TCP's synchronization process, the TCP modules at both ends must ignore the precedence fields of the SYN and SYN ACK packets. The TCP connection will be established if all the conditions specified by RFC 793 are satisfied except the precedence of the connection.",
      "ja": "(1) TCPの同期プロセスでは、両端のTCPモジュールは、SynおよびSyn ACKパケットの優先フィールドを無視する必要があります。RFC 793で指定されたすべての条件が接続の優先順位を除いて満たされる場合、TCP接続が確立されます。"
    },
    {
      "indent": 3,
      "text": "(2) After a connection is established, each end sends segments with its desired precedence. The precedence picked by one end of the TCP connection may be the same or may be different from the precedence picked by the other end (because precedence is ignored during connection setup time). The precedence fields may be changed by the intermediate nodes too. In either case, the precedence of the received packets will be ignored by the other end. The TCP connection will not be reset in either case.",
      "ja": "(2) 接続が確立された後、各端は目的の優先順位を持つセグメントを送信します。TCP接続の一方の端によって選択される優先順位は同じであるか、もう一方の端によって選択された優先順位とは異なる場合があります（接続のセットアップ時間中に優先順位が無視されるため）。優先フィールドは、中間ノードによっても変更される場合があります。どちらの場合でも、受信したパケットの優先順位は反対側によって無視されます。どちらの場合も、TCP接続はリセットされません。"
    },
    {
      "indent": 3,
      "text": "Problems #1 and #2 are solved by this proposed modification. Problems #3 and #4 become non-issues because TCP must ignore the precedence. In a DiffServ-capable environment, the two cases described in problems #3 and #4 should be allowed.",
      "ja": "問題＃1と＃2は、この提案された変更によって解決されます。TCPは優先順位を無視する必要があるため、問題＃3と＃4は問題ではありません。diffserv対応環境では、問題＃3と＃4で説明されている2つのケースを許可する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "A TCP implementation that terminates a connection upon receipt of any segment with an incorrect precedence field, regardless of the correctness of the sequence numbers in the segment's header, poses a serious denial-of-service threat, as all an attacker must do to terminate a connection is guess the port numbers and then send two segments with different precedence values; one of them is certain to terminate the connection. Accordingly, the change to TCP processing proposed in this memo would yield a significant gain in terms of that TCP implementation's resilience.",
      "ja": "セグメントのヘッダーのシーケンス番号の正しさに関係なく、誤った優先順位フィールドを持つセグメントの受領時に接続を終了するTCP実装は、すべての攻撃者が終了するためにしなければならないように、深刻なサービス拒否の脅威をもたらします。接続は、ポート番号を推測してから、優先値が異なる2つのセグメントを送信します。そのうちの1つは、接続を終了することが確実です。したがって、このメモで提案されているTCP処理の変更は、そのTCP実装の回復力に関して大きな利益をもたらします。"
    },
    {
      "indent": 3,
      "text": "On the other hand, the stricter processing rules of RFC 793 in principle make TCP spoofing attacks more difficult, as the attacker must not only guess the victim TCP's initial sequence number, but also its precedence setting.",
      "ja": "一方、RFC 793のより厳格な処理ルールは、原則としてTCPのスプーフィング攻撃をより困難にします。攻撃者は、被害者TCPの初期シーケンス番号だけでなく、その優先順位設定も推測する必要があるためです。"
    },
    {
      "indent": 3,
      "text": "Finally, the security issues of each PHB group are addressed in the PHB group's specification [RFC2597, RFC2598].",
      "ja": "最後に、各PHBグループのセキュリティ問題は、PHBグループの仕様[RFC2597、RFC2598]で対処されています。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "Our thanks to Al Smith for his careful review and comments.",
      "ja": "彼の慎重なレビューとコメントをしてくれたアル・スミスに感謝します。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC791] Postel, J., \"Internet Protocol\", STD 5, RFC 791, September 1981.",
      "ja": "[RFC791] Postel、J。、「インターネットプロトコル」、STD 5、RFC 791、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, September 1981.",
      "ja": "[RFC793] Postel、J。、「トランスミッションコントロールプロトコル」、STD 7、RFC 793、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC1349] Almquist, P., \"Type of Service in the Internet Protocol Suite\", RFC 1349, July 1992.",
      "ja": "[RFC1349] Almquist、P。、「インターネットプロトコルスイートのサービスの種類」、RFC 1349、1992年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[RFC2460] Deering、S。およびR. Hinden、「インターネットプロトコル、バージョン6（IPv6）仕様」、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2474] Nichols, K., Blake, S., Baker, F. and D. Black, \"Definition of the Differentiated Services Field (DS Field) in the IPv4 and IPv6 Headers\", RFC 2474, December 1998.",
      "ja": "[RFC2474] Nichols、K.、Blake、S.、Baker、F。、およびD. Black、「IPv4およびIPv6ヘッダーの差別化されたサービスフィールド（DSフィールド）の定義」、RFC 2474、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2475] Blake, S., Black, D., Carlson, M., Davies, E., Wang, Z. and W. Weiss, \"An Architecture for Differentiated Services\", RFC 2475, December 1998.",
      "ja": "[RFC2475] Blake、S.、Black、D.、Carlson、M.、Davies、E.、Wang、Z。、およびW. Weiss、「差別化されたサービスの建築」、RFC 2475、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2597] Heinanen, J., Baker, F., Weiss, W. and J. Wroclawski, \"Assured Forwarding PHB Group\", RFC 2587, June 1999.",
      "ja": "[RFC2597] Heinanen、J.、Baker、F.、Weiss、W。and J. Wroclawski、「Assured Forwarding PHB Group」、RFC 2587、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2598] Jacobson, V., Nichols, K. and K. Poduri, \"An Expedited Forwarding PHB\", RFC 2598, June 1999.",
      "ja": "[RFC2598] Jacobson、V.、Nichols、K。およびK. Poduri、「迅速な転送PHB」、RFC 2598、1999年6月。"
    },
    {
      "indent": 0,
      "text": "8. Authors' Addresses",
      "section_title": true,
      "ja": "8. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Xipeng Xiao Global Crossing 141 Caspian Court Sunnyvale, CA 94089 USA",
      "ja": "Xipeng Xiao Global Crossing 141 Caspian Court Sunnyvale、CA 94089 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408-543-4801\nEMail: xipeng@gblx.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Alan Hannan iVMG, Inc. 112 Falkirk Court Sunnyvale, CA 94087 USA",
      "ja": "Alan Hannan IVMG、Inc。112 Falkirk Court Sunnyvale、CA 94087 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408-749-7084\nEMail: alan@ivmg.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Edward Crabbe Exodus Communications 2650 San Tomas Expressway Santa Clara, CA 95051 USA",
      "ja": "エドワードクラブエクソダスコミュニケーション2650サントーマスエクスプレスウェイサンタクララ、カリフォルニア95051 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408-346-1544\nEMail: edc@explosive.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Vern Paxson ACIRI/ICSI 1947 Center Street Suite 600 Berkeley, CA 94704-1198 USA",
      "ja": "Vern Paxson Aciri/Icsi 1947 Center Street Suite 600 Berkeley、CA 94704-1198 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 510-666-2882\nEMail: vern@aciri.org",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "ja": "9. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}