{
  "title": {
    "text": "RFC 2657 - LDAPv2 Client vs. the Index Mesh",
    "ja": "RFC 2657 - LDAPV2クライアントとインデックスメッシュ"
  },
  "number": 2657,
  "created_at": "2024-02-12 11:17:56.162440+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        R. Hedberg\nRequest for Comment: 2657                                     Catalogix\nCategory: Experimental                                      August 1999",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 20,
      "text": "LDAPv2 Client vs. the Index Mesh",
      "ja": "LDAPV2クライアントとインデックスメッシュ"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティの実験プロトコルを定義します。いかなる種類のインターネット標準を指定しません。改善のための議論と提案が要求されます。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（1999）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "LDAPv2 clients as implemented according to RFC 1777 [1] have no notion on referral. The integration between such a client and an Index Mesh, as defined by the Common Indexing Protocol [2], heavily depends on referrals and therefore needs to be handled in a special way. This document defines one possible way of doing this.",
      "ja": "RFC 1777 [1]に従って実装されているLDAPV2クライアントは、紹介に関する概念を持っていません。一般的なインデックス作成プロトコル[2]で定義されているように、このようなクライアントとインデックスメッシュ間の統合は、紹介に大きく依存するため、特別な方法で処理する必要があります。このドキュメントでは、これを行う1つの可能な方法を定義します。"
    },
    {
      "indent": 0,
      "text": "1. Background",
      "section_title": true,
      "ja": "1. 背景"
    },
    {
      "indent": 3,
      "text": "During the development of the Common Indexing Protocol (CIP), one of the underlying assumptions was that the interaction between clients and the Index Mesh Servers [1] would heavily depend on the passing of referrals. Protocols like LDAPv2 [2] that lack this functionality need to compensate for it by some means. The way chosen in this memo is to add more intelligence into the client. There are two reasons behind this decision. First, this is not a major enhancement that is needed and secondly, that the intelligence when dealing with the Index Mesh, with or the knowledge about referrals, eventually has to go into the client.",
      "ja": "一般的なインデックスプロトコル（CIP）の開発中、根本的な仮定の1つは、クライアントとインデックスメッシュサーバー[1]との相互作用が紹介の通過に大きく依存することでした。LDAPV2 [2]のようなプロトコルは、この機能を欠いている必要があります。このメモで選択された方法は、クライアントにインテリジェンスを追加することです。この決定の背後には2つの理由があります。第一に、これは必要な主要な強化ではなく、第二に、インデックスメッシュ、または紹介に関する知識を扱う際の知性が最終的にクライアントに入る必要があることです。"
    },
    {
      "indent": 0,
      "text": "2. The clients view of the Index Mesh",
      "section_title": true,
      "ja": "2. インデックスメッシュのクライアントビュー"
    },
    {
      "indent": 3,
      "text": "If a LDAPv2 client is going to be able to interact with the Index Mesh, the Mesh has to appear as something that is understandable to the client. Basically, this consists of representing the index servers and their contained indexes in a defined directory information tree (DIT) [3,4] structure and a set of object classes and attribute types that have been proven to be useful in this context.",
      "ja": "LDAPV2クライアントがインデックスメッシュと対話できる場合、メッシュはクライアントが理解できるものとして表示する必要があります。基本的に、これは、定義されたディレクトリ情報ツリー（DIT）[3,4]構造と、このコンテキストで有用であることが証明されたオブジェクトクラスと属性タイプのセットに、インデックスサーバーとその含有されたインデックスを表すことで構成されています。"
    },
    {
      "indent": 0,
      "text": "2.1 The CIP Object Classes",
      "section_title": true,
      "ja": "2.1 CIPオブジェクトクラス"
    },
    {
      "indent": 3,
      "text": "Object class descriptions are written according to the BNF defined in [5].",
      "ja": "オブジェクトクラスの説明は、[5]で定義されているBNFに従って記述されます。"
    },
    {
      "indent": 0,
      "text": "2.1.1 cIPIndex",
      "section_title": true,
      "ja": "2.1.1 cipindex"
    },
    {
      "indent": 3,
      "text": "The cIPIndex objectClass, if present in a entry, allows it to hold one indexvalue and information connected to this value.",
      "ja": "cipindex ObjectClassは、エントリに存在する場合、この値に接続された1つのインデックスバリューと情報を保持できます。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.3.9 NAME 'cIPIndex' SUP 'top' STRUCTURAL MUST ( extendedDSI $ idx ) MAY ( indexOCAT ) )",
      "ja": "（1.2.752.17.3.9 name 'cipindex' sup 'top' structural must（extendeddsi $ idx）5月（indexocat））"
    },
    {
      "indent": 0,
      "text": "2.1.2 cIPDataSet",
      "section_title": true,
      "ja": "2.1.2 cipdataset"
    },
    {
      "indent": 3,
      "text": "The cIPDataSet objectClass, if present in a entry, allows it to hold information concerning one DataSet.",
      "ja": "cipdatasetオブジェクトクラスは、エントリに存在する場合、1つのデータセットに関する情報を保持できます。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.3.10 NAME 'cIPDataSet' SUP 'top' STRUCTURAL MUST ( dSI $ searchBase ) MAY ( indexOCAT $ description $ indexType $ accessPoint $ protocolVersion $ polledBy $ updateIntervall $ securityOption $ supplierURI $ consumerURI $ baseURI $ attributeNamespace $ consistencyBase ) )",
      "ja": "（1.2.752.17.3.10 name 'cipdataset' sup 'top' structural must（dsi $ searchbase）5月（indexocat $ description $ cassionpoint $ protocolversion $ protocolversion $ updateintintervall $ securityoption $ supplieruri $ supplierui $ supplierui $ baseuri $属性$属性$属性ベース））"
    },
    {
      "indent": 0,
      "text": "2.2 The CIP attributeTypes",
      "section_title": true,
      "ja": "2.2 CIP属性タイプ"
    },
    {
      "indent": 3,
      "text": "The attributes idx, indexOCAT, extendedDSI, description, cIPIndexType, baseURI, dSI are used by a client accessing the index server. The other attributes (accesspoint, protocolVersion, polledBy, updateIntervall, consumerURI, supplierURI and securityOption, attributeNamespace, consistencyBase) are all for usage in server to server interactions.",
      "ja": "属性IDX、IndexOCAT、拡張DSI、説明、CIPINDEXTYPE、Baseuri、DSIは、インデックスサーバーにアクセスするクライアントが使用します。その他の属性（AccessPoint、Protocolversion、PolledBy、UpdateIntervall、Consumeruri、SupplieruriおよびSecurityOption、AttributeNamesPace、ConsecencyBase）はすべて、サーバーからサーバーへの対話で使用されます。"
    },
    {
      "indent": 0,
      "text": "2.2.1 idx",
      "section_title": true,
      "ja": "2.2.1 idx"
    },
    {
      "indent": 3,
      "text": "The index value, normally used as part of the RDN.",
      "ja": "通常、RDNの一部として使用されるインデックス値。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.20 NAME 'idx' EQUALITY caseIgnoreIA5Match SYNTAX IA5String SINGLE-VALUE )",
      "ja": "（1.2.752.17.1.20 name 'idx' equality caseignoreia5match Syntax ia5string単一価値）"
    },
    {
      "indent": 0,
      "text": "2.2.2 dSI",
      "section_title": true,
      "ja": "2.2.2 DSI"
    },
    {
      "indent": 3,
      "text": "DataSet Identifier, a unique identifier for one particular set of information. This should be an OID, but stored in a stringformat.",
      "ja": "データセット識別子、1つの特定の情報セットの一意の識別子。これはOIDである必要がありますが、StringFormatに保存されます。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.21 NAME 'dSI' EQUALITY caseIgnoreIA5Match SYNTAX IA5String )",
      "ja": "（1.2.752.17.1.21 name 'dsi' equality caseignoreia5match構文ia5string）"
    },
    {
      "indent": 0,
      "text": "2.2.3 indexOCAT",
      "section_title": true,
      "ja": "2.2.3 インデックスキャット"
    },
    {
      "indent": 3,
      "text": "Describes the type of data that is stored in this entry, by using objectcClasses and attributeTypes. The information is stored as a objectClass name followed by a space and then an attributeType name. A typical example when dealing with whitepages information would be \"person cn\".",
      "ja": "ObjectCclassesと属性タイプを使用して、このエントリに保存されているデータのタイプについて説明します。情報は、オブジェクトクラス名として保存され、その後にスペースと属性名が付いています。ホワイトページ情報を扱う際の典型的な例は、「人CN」です。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.28 NAME 'indexOCAT' EQUALITY caseIgnoreIA5Match SYNTAX IA5String )",
      "ja": "（1.2.752.17.1.28名「indexocat」equality caseignoreia5match構文ia5string）"
    },
    {
      "indent": 0,
      "text": "2.2.5 supplierURI",
      "section_title": true,
      "ja": "2.2.5 サプライヤーリ"
    },
    {
      "indent": 3,
      "text": "A URI describing which protocols, hostnames and ports should be used by an indexserver to interact with servers carrying indexinformation representing this dataSet.",
      "ja": "このデータセットを表すインデックス情報を運ぶサーバーと対話するために、インデックスサーバーがどのプロトコル、ホスト名、およびポートを使用するかを説明するURI。"
    },
    {
      "indent": 3,
      "text": " ( 1.2.752.17.1.22 NAME 'supplierURI' EQUALITY caseIgnoreIA5Match SYNTAX IA5String )",
      "ja": "（1.2.752.17.1.22 name 'supplieruri' equality caseignoreia5match構文ia5string）"
    },
    {
      "indent": 0,
      "text": "2.2.6 baseURI",
      "section_title": true,
      "ja": "2.2.6 ベースリ"
    },
    {
      "indent": 3,
      "text": "The attribute value for this attribute is a LDAP URI. One can envisage other URI syntaxes, if the client knows about more access protocols besides LDAP, and the interaction between the client and the server can not use referrals for some reason.",
      "ja": "この属性の属性値はLDAP URIです。クライアントがLDAP以外のアクセスプロトコルを知っている場合、他のURI構文を想像でき、クライアントとサーバーの間の相互作用は何らかの理由で紹介を使用できません。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.26 NAME 'baseURI' EQUALITY caseExactIA5Match SYNTAX IA5String )",
      "ja": "（1.2.752.17.1.26 name 'baseuri' equality caseexactia5match構文ia5string）"
    },
    {
      "indent": 0,
      "text": "2.2.7 protocolVersion",
      "section_title": true,
      "ja": "2.2.7 プロトコルバージョン"
    },
    {
      "indent": 3,
      "text": "At present, the Common Indexing Protocol version should be 3.",
      "ja": "現在、共通のインデックス作成プロトコルバージョンは3でなければなりません。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.27 NAME 'protocolVersion' EQUALITY numericStringMatch SYNTAX numericString )",
      "ja": "（1.2.752.17.1.27 name 'protocolversion' equality numericstringmatch構文numericstring）"
    },
    {
      "indent": 0,
      "text": "2.2.8 cIPIndexType",
      "section_title": true,
      "ja": "2.2.8 cipindextype"
    },
    {
      "indent": 3,
      "text": "The type of index Object that is used to pass around index information.",
      "ja": "インデックス情報を渡すために使用されるインデックスオブジェクトのタイプ。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.29 NAME 'cIPIndexType' EQUALITY caseIgnoreIA5Match SYNTAX IA5String )",
      "ja": "（1.2.752.17.1.29名「cipindextype 'equality caseignoreia5match Syntax Ia5string）"
    },
    {
      "indent": 0,
      "text": "2.2.10 polledBy",
      "section_title": true,
      "ja": "2.2.10 Polledby"
    },
    {
      "indent": 3,
      "text": "The Distinguished Name of Index servers that polls data from this indexserver.",
      "ja": "このIndexServerからデータを投票するインデックスサーバーの著名な名前。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.30 NAME 'polledBy' EQUALITY distinguishedNameMatch SYNTAX DN )",
      "ja": "（1.2.752.17.1.30名前「Polledby」等式著作権damematch構文dn）"
    },
    {
      "indent": 0,
      "text": "2.2.11 updateIntervall",
      "section_title": true,
      "ja": "2.2.11 updateintervall"
    },
    {
      "indent": 3,
      "text": "The maximum duration in seconds between the generation of two updates by the supplier server.",
      "ja": "サプライヤーサーバーによる2つの更新の生成の間の数秒での最大期間。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.31 Name 'updateIntervall' EQUALITY numericStringMatch SYNTAX numericString SINGLE-VALUE )",
      "ja": "（1.2.752.17.1.31 name 'updateintervall' equality numericstringmatchシングルバリューnumericstring）"
    },
    {
      "indent": 0,
      "text": "2.2.12 securityOption",
      "section_title": true,
      "ja": "2.2.12 セキュリティオプション"
    },
    {
      "indent": 3,
      "text": "Whether and how the supplier server should sign and encrypt the update before sending it to the consumer server.",
      "ja": "サプライヤーサーバーが消費者サーバーに送信する前に、サプライヤーサーバーがアップデートに署名して暗号化するかどうか。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.32 NAME 'securityOption' EQUALITY caseIgnoreIA5Match SYNTAX IA5String SINGLE-VALUE )",
      "ja": "（1.2.752.17.1.32 name 'securityoption' equality caseignoreia5match構文ia5string単一価値）"
    },
    {
      "indent": 0,
      "text": "2.2.13 extendedDSI",
      "section_title": true,
      "ja": "2.2.13 拡張dsi"
    },
    {
      "indent": 3,
      "text": "DataSet Identifier possibly followed by a space and a taglist, the later as specified by [6].",
      "ja": "データセット識別子に続いて、スペースとタグリストが続き、後に[6]で指定されています。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.33 NAME 'extendedDSI' EQUALITY caseIgnoreIA5Match SYNTAX IA5String )",
      "ja": "（1.2.752.17.1.33 name 'extendeddsi' equality caseignoreia5match構文ia5string）"
    },
    {
      "indent": 0,
      "text": "2.2.14 consumerURI",
      "section_title": true,
      "ja": "2.2.14 消費者"
    },
    {
      "indent": 3,
      "text": "A URI describing which means a server can accept indexinformation. An example being a mailto URI for MIME email based index transport.",
      "ja": "サーバーがインデックス情報を受け入れることを意味するURIを説明します。例は、MIME電子メールベースのインデックストランスポートのMailTo URIです。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.34 NAME 'consumerURI' EQUALITY caseExactIA5Match SYNTAX IA5String )",
      "ja": "（1.2.752.17.1.34 name 'Consumeruri' equality caseexactia5match構文ia5string）"
    },
    {
      "indent": 0,
      "text": "2.2.15 attributeNamespace",
      "section_title": true,
      "ja": "2.2.15 aTtivitionENAMESPACE"
    },
    {
      "indent": 3,
      "text": "Any consumer supplier pair has to agree on what attribute that should be used and also possibly the meaning of the attributenames. The value of this attribute should, for example, be a URI pointing to a document wherein the agreement is described.",
      "ja": "消費者のサプライヤーのペアは、使用すべき属性と、おそらく属性の意味に同意する必要があります。この属性の値は、たとえば、契約が記載されている文書を指すURIでなければなりません。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.35 NAME 'attributeNamespace' EQUALITY caseExactIA5Match SYNTAX IA5String )",
      "ja": "（1.2.752.17.1.35名「astributeNamespace」equality caseexactia5match Syntax Ia5string）"
    },
    {
      "indent": 0,
      "text": "2.2.16 consistencyBase",
      "section_title": true,
      "ja": "2.2.16 一貫性ベース"
    },
    {
      "indent": 3,
      "text": "This attribute is specifically used by consumer supplier pairs that use the tagged index object [6].",
      "ja": "この属性は、タグ付きインデックスオブジェクト[6]を使用する消費者サプライヤーペアによって特別に使用されています。"
    },
    {
      "indent": 3,
      "text": "( 1.2.752.17.1.36 NAME 'consistencyBase' EQUALITY caseExactIA5Match SYNTAX IA5String )",
      "ja": "（1.2.752.17.1.36 name 'consecencybase' equality caseexactia5match構文ia5string）"
    },
    {
      "indent": 0,
      "text": "3. The interaction between a client and the Index Mesh",
      "section_title": true,
      "ja": "3. クライアントとインデックスメッシュ間の相互作用"
    },
    {
      "indent": 3,
      "text": "A client interaction with the Index Mesh consists of a couple of rather well defined actions. The first being to find a suitable index to start with, then to transverse the Index Mesh and finally to query the servers holding the original data. Note when reading this text that what is discussed here is the client's perception of the DIT, how it is in fact implemented is not discussed.",
      "ja": "インデックスメッシュとのクライアントの相互作用は、いくつかのかなり明確に定義されたアクションで構成されています。最初は、開始するのに適したインデックスを見つけてから、インデックスメッシュを横断し、最後に元のデータを保持しているサーバーを照会することです。ここで議論されているのは、クライアントのDITに対する認識であること、このテキストを読むとき、それが実際に実装されている方法は議論されていません。"
    },
    {
      "indent": 0,
      "text": "3.1 Finding a Index Mesh",
      "section_title": true,
      "ja": "3.1 インデックスメッシュを見つける"
    },
    {
      "indent": 3,
      "text": "This approach depends on the fact that every index server partaking in an Index Mesh is represented in the DIT by a entry of the type cIPDataSet, and has a distinguished name (DN) which most significant relative distinguished name (RDN) has the attributetype dSI. Therefore, finding a suitable indexserver to start the search from is a matter of searching the DIT at a suitable place for objects with the objectClass cIPIndexObject. Every found entry can then be evaluated by looking at the description value as well as the indexOCAT value. The description string should be a human readable and understandable text that describes what the index server is indexing. An example of such a string could be, \"This index covers all employees at Swedish Universities and University Colleges that has an email account\". The indexOCAT attribute supplies information about which kind of entries and which attributes within these entries that the index information has emanated from. For example, if the indexOCAT attribute value is \"person cn\", one can deduce that this is an index over persons and not over roles, and that it is the attribute commonName that is indexed.",
      "ja": "このアプローチは、インデックスメッシュに参加するすべてのインデックスサーバーが、型cipdatasetのエントリによってDITで表され、最も重要な相対著名な名前（RDN）が属性DSIを持っている際立った名前（DN）を持っているという事実に依存します。したがって、検索を開始するために適切なIndexServerを見つけることは、ObjectClass CipindExoBjectを使用してオブジェクトに適した場所でDITを検索する問題です。その後、すべての発見されたエントリは、説明値とインデックスキャット値を調べることで評価できます。説明文字列は、インデックスサーバーがインデックス作成しているものを説明する人間の読みやすく理解できるテキストである必要があります。このような文字列の例は、「このインデックスは、電子メールアカウントを持っているスウェーデンの大学や大学の大学のすべての従業員を対象としています」ということです。IndexOCAT属性は、インデックス情報が発現したこれらのエントリ内のエントリの種類とどの属性に関する情報を提供します。たとえば、IndexOCAT属性値が「個人CN」である場合、これは役割を超えるのではなく、人よりもインデックスであり、インデックス化されたのは属性CommonNameであると推測できます。"
    },
    {
      "indent": 0,
      "text": "3.2 Searching the mesh",
      "section_title": true,
      "ja": "3.2 メッシュの検索"
    },
    {
      "indent": 3,
      "text": "Each index server has its information represented in the DIT as a very flat tree. In fact, it is only one level deep.",
      "ja": "各インデックスサーバーには、DITで非常にフラットなツリーとして表される情報があります。実際、深さは1つのレベルです。"
    },
    {
      "indent": 6,
      "text": "                      0 Indexservers cIPDataSet\n                     /|\\\n                    / | \\\n                   /  |  \\\n                  0       0\ncIPDataSet entries     cIPIndex entries\none for each DataSet   one for each index value\nthat this server has   that this indexserver\ngathered indexes from. has.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "A search then consists of a set of searches. The first being the search for the index entries that contains an indexvalue that matches what the user is looking for, and the second a search based on the DSI information in the extendedDSI attribute values returned from the first search. In the case of the the cIPIndexType being tagged-index, the taglists should be compared to find which DSI it might be useful to pose further queries to.",
      "ja": "検索は、一連の検索で構成されます。1つ目は、ユーザーが探しているものに一致するインデックスバリューを含むインデックスエントリの検索であり、2番目は、最初の検索から返された拡張DSI属性値のDSI情報に基づく検索です。cipindextypeがタグ付きインデックスである場合、キャッチリストを比較する必要があります。"
    },
    {
      "indent": 3,
      "text": "When doing these types of searches, the client should be aware of the fact that the index values disregarding their origin (attributeTypes) always are stored in the index server as values of the idx attribute.",
      "ja": "これらのタイプの検索を実行する場合、クライアントは、その原点（属性）を無視するインデックス値がIDX属性の値としてインデックスサーバーに常に保存されるという事実を認識する必要があります。"
    },
    {
      "indent": 3,
      "text": "The object of the second search is to get information on the different DataSet involved, and should normally be performed as a read. Since the DataSet information probably will remain quite stable over time, this information lends itself very well to caching. If at this stage there is more than one DataSet involved, the User interface might use the description value to aid the user in choosing which one to proceed with. The content of the searchBase value of the DataSet tells the client whether it represents another index server (the most significant part of the dn is a dSI attribute) or if it is a end server.",
      "ja": "2番目の検索のオブジェクトは、関係するさまざまなデータセットに関する情報を取得することであり、通常は読み取りとして実行する必要があります。データセット情報はおそらく時間の経過とともに非常に安定したままであるため、この情報はキャッシュに非常に役立ちます。この段階で複数のデータセットが関係している場合、ユーザーインターフェイスは説明値を使用して、ユーザーがどの進行するかを選択するのを支援する場合があります。データセットの検索ベース値のコンテンツは、クライアントが別のインデックスサーバー（DNの最も重要な部分はDSI属性）を表すか、それがエンドサーバーであるかを示します。"
    },
    {
      "indent": 0,
      "text": "3.3 Querying the end server",
      "section_title": true,
      "ja": "3.3 エンドサーバーのクエリ"
    },
    {
      "indent": 3,
      "text": "When finally reaching the end server/servers that probably has the sought for information, the information in the indexOCAT attribute can be used to produce an appropriate filter. If a search for \"Rol*\" in an index having an indexOCAT attribute value of \"person cn\" returns an idx entry with the idx value of \"Roland\", then an appropriate filter to use might be \"&(|(cn=* roland *)(cn=roland *)(cn=* roland))(objectclass=person)\". A complete example of a search process is given in Appendix A.",
      "ja": "おそらく情報を求めているエンドサーバー/サーバーに最終的に到達すると、IndexOCAT属性の情報を使用して適切なフィルターを生成できます。「人cn」のインデックスキャット属性値を持つインデックスで「rol*」の検索が「roland」のidx値を持つidxエントリを返す場合、使用する適切なフィルターは「＆（cn =*」かもしれません。ROLAND *）（CN = ROLAND *）（CN = *ROLAND））（ObjectClass = Person） \"。検索プロセスの完全な例は、付録Aに記載されています。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Since this memo deals with client behavior, it does not add anything that either enhances or diminishes the security features that exists in LDAPv2.",
      "ja": "このメモはクライアントの動作を扱っているため、LDAPV2に存在するセキュリティ機能を強化または減少させるものは追加されません。"
    },
    {
      "indent": 0,
      "text": "5. Internationalization",
      "section_title": true,
      "ja": "5. 国際化"
    },
    {
      "indent": 3,
      "text": "As with security, this memo neither enhances or diminishes the handling of internationalization in LDAPv2.",
      "ja": "セキュリティと同様に、このメモは、LDAPV2の国際化の取り扱いを強化または減少させません。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Yeong, W., Howes, T. and S. Kille, \"Lightweight Directory Access Protocol\", RFC 1777, March 1995.",
      "ja": "[1] Yeong、W.、Howes、T。およびS. Killee、「Lightweight Directory Access Protocol」、RFC 1777、1995年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Allen, J. and M. Mealling \"The Architecture of the Common Indexing Protocol (CIP)\", RFC 2651, August 1999.",
      "ja": "[2] Allen、J.およびM. Mealling「Common Indexing Protocol（CIP）のアーキテクチャ」、RFC 2651、1999年8月。"
    },
    {
      "indent": 3,
      "text": "[3] The Directory: Overview of Concepts, Models and Service. CCITT Recommendation X.500, 1988.",
      "ja": "[3] ディレクトリ：概念、モデル、サービスの概要。CCITT推奨X.500、1988。"
    },
    {
      "indent": 3,
      "text": "[4] Information Processing Systems -- Open Systems Interconnection -- The Directory: Overview of Concepts, Models and Service. ISO/IEC JTC 1/SC21; International Standard 9594-1, 1988.",
      "ja": "[4] 情報処理システム - オープンシステムの相互接続 - ディレクトリ：概念、モデル、サービスの概要。ISO/IEC JTC 1/SC21;国際標準9594-1、1988。"
    },
    {
      "indent": 3,
      "text": "[5] Wahl, M., Coulbeck, A., Howes, T. and S. Kille, \"Lightweight Directory Access Protocol (v3): Attribute Syntax Definitions\", RFC 2252, December 1997.",
      "ja": "[5] Wahl、M.、Coulbeck、A.、Howes、T。and S. Kille、「Lightweight Directory Access Protocol（V3）：属性構文定義」、RFC 2252、1997年12月。"
    },
    {
      "indent": 3,
      "text": "[6] Hedberg, R., Greenblatt, B., Moats, R. and M. Wahl, \"A Tagged Index Object for use in the Common Indexing Protocol\", RFC 2654, August 1999.",
      "ja": "[6] Hedberg、R.、Greenblatt、B.、Moats、R。、およびM. Wahl、「共通インデックスプロトコルで使用するタグ付きインデックスオブジェクト」、RFC 2654、1999年8月。"
    },
    {
      "indent": 0,
      "text": "7. Author's Address",
      "section_title": true,
      "ja": "7. 著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Roland Hedberg Catalogix Dalsveien 53 0387 Oslo, Norway",
      "ja": "Roland Hedberg Catalogix Dalsveien 53 0387オスロ、ノルウェー"
    },
    {
      "indent": 3,
      "text": "Phone: +47 23 08 29 96\nEMail: roland@catalogix.ac.se",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Appendix A - Sample Session",
      "ja": "付録A-サンプルセッション"
    },
    {
      "indent": 3,
      "text": "Below is a sample of a session between a LDAPv2 client and an index server mesh as specified in this memo.",
      "ja": "以下は、このメモで指定されているように、LDAPV2クライアントとインデックスサーバーメッシュのセッションのサンプルです。"
    },
    {
      "indent": 3,
      "text": "The original question of the session is to find the email address of a person by the name, \"Roland Hedberg\", who is working at \"Umea University\" in Sweden.",
      "ja": "セッションの元の質問は、スウェーデンの「Umea University」で働いている「Roland Hedberg」という名前で人のメールアドレスを見つけることです。"
    },
    {
      "indent": 3,
      "text": "Step 1.",
      "ja": "ステップ1。"
    },
    {
      "indent": 3,
      "text": "A singlelevel search with the baseaddress \"c=SE\" and the filter \"(objectclass=cipDataset)\" was issued.",
      "ja": "Baseaddress \"c = se\"とフィルター「objectclass = cipdataset）を使用したシングルレベル検索が発行されました。"
    },
    {
      "indent": 3,
      "text": "The following results were received:",
      "ja": "次の結果が受けられました。"
    },
    {
      "indent": 3,
      "text": "DN: dSI=1.2.752.17.5.0,c=SE\ndsi= 1.2.752.17.5.0\ndescription= \"index over employees with emailaddresses within Swedish\nhigher education\"\nindexOCAT= \"cn person\"\ncIPIndexType= \"x-tagged-index-1\" ;\nsearchBase= \"dsi=1.2.752.17.5.0,c=SE\"\nprotocolVersion = 3",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "DN: dSI=1.2.752.23.1.3,c=SE\ndsi= 1.2.752.23.1.3\ndescription= \"index over Swedish lawyers\"\nindexOCAT= \"cn person\"\ncIPIndexType= \"x-tagged-index-1\" ;\nsearchBase= \"dsi=1.2.752.23.1.3,c=SE\"\nprotocolVersion = 3",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Step 2.",
      "ja": "ステップ2。"
    },
    {
      "indent": 3,
      "text": "Since the first index seemed to cover the interesting population, a single level search with the baseaddress \"dsi=1.2.752.17.5.0,c=SE\" and the filter \"(|(idx=roland)(idx=hedberg))\" was issued.",
      "ja": "最初のインデックスは興味深い母集団をカバーしているように見えたため、Baseaddress「DSI = 1.2.752.17.5.0、C = SE」、およびフィルター「（IDX = ROLAND）（IDX = Hedberg））を使用した単一レベルの検索がありました。発行済み。"
    },
    {
      "indent": 3,
      "text": "The following results were received:",
      "ja": "次の結果が受けられました。"
    },
    {
      "indent": 3,
      "text": "DN: idx=Roland,dSI=1.2.752.17.5.0,c=SE\nidx= Roland\nextendedDSI= 1.2.752.17.5.10 1,473,612,879,1024\nextendedDSI= 1.2.752.17.5.14 35,78,150,200\nextendedDSI= 1.2.752.17.5.16 187,2031,3167,5284,6034-6040\nextendedDSI= 1.2.752.17.5.17 17\n   DN: idx=Hedberg,dSI=1.2.752.17.5.0,c=SE\nidx= Hedberg\nextendedDSI= 1.2.752.17.5.8  24,548-552,1066\nextendedDSI= 1.2.752.17.5.10 473,512,636,777,1350\nextendedDSI= 1.2.752.17.5.14 84,112,143,200\nextendedDSI= 1.2.752.17.5.15 1890-1912\nextendedDSI= 1.2.752.17.5.17 44",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "A comparison between the two sets of extendedDSIs shows that two datasets 1.2.752.17.5.10 and 1.2.752.17.5.14 contains persons named \"Roland\" and \"Hedberg\". Therefore, the next step would be to see what the datasets represent. A comparison like this should normally not be left to the user.",
      "ja": "拡張DSISの2つのセットの比較は、2つのデータセット1.2.752.17.5.10および1.2.752.17.5.14に「Roland」と「Hedberg」という名前の人が含まれていることを示しています。したがって、次のステップは、データセットが何を表すかを確認することです。このような比較は、通常、ユーザーに任されるべきではありません。"
    },
    {
      "indent": 3,
      "text": "Step. 3",
      "ja": "ステップ。3"
    },
    {
      "indent": 3,
      "text": "Two baselevel searches, one for \"dsi=1.2.752.17.5.10,dsi=1.2.752.17.5.0,c=SE\" and the other for \"dsi=1.2.752.17.5.14,dsi=1.2.752.17.5.0,c=SE\" with the filter \"(objectclass=cipdataset)\" were issued.",
      "ja": "2つのベースレベル検索、1つは「DSI = 1.2.752.17.5.10、DSI = 1.2.752.17.5.0、C = SE」、もう1つは「DSI = 1.2.752.17.5.14、DSI = 1.2.752.17.5.5、C =se \"with the Filter\"（objectclass = cipdataset）が発行されました。"
    },
    {
      "indent": 3,
      "text": "The following results were received:",
      "ja": "次の結果が受けられました。"
    },
    {
      "indent": 3,
      "text": "DN: dSI=1.2.752.17.5.10,dSI=1.2.752.17.5.0,c=SE\ndsi= 1.2.752.17.5.10\ndescription= \"Employees at Umea University,Sweden\"\nindexOCAT= \"person cn\"\nsearchBase= \"o=Umea Universitet,c=SE\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "respectively",
      "ja": "それぞれ各々夫夫夫々"
    },
    {
      "indent": 3,
      "text": "DN: dSI=1.2.752.17.5.14,dSI=1.2.752.17.5.0,c=SE\ndsi= 1.2.752.17.5.14\ndescription= \"Employees at Lund University,Sweden\"\nindexOCAT= \"person cn\"\nsearchBase= \"o=Lunds Universitet,c=SE\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Step 4",
      "ja": "ステップ4"
    },
    {
      "indent": 3,
      "text": "Based on the descriptions for the two datasets, \"1.2.752.17.5.10\" was chosen as the best to proceed with. From the searchbase attribute value, it was clear that this was a base server. The query now has to be somewhat modified. One possibility would be to issue a query with the baseobject \"o=Umea Universitet,c=SE\" and the filter \"(&(cn=Roland Hedberg)(objectclass=person))\"",
      "ja": "2つのデータセットの説明に基づいて、「1.2.752.17.5.10」が進むのに最適なものとして選択されました。SearchBase属性値から、これがベースサーバーであることは明らかでした。クエリをいくらか変更する必要があります。1つの可能性は、BaseObject「O = Umea Universitet、C = SE」およびフィルターでクエリを発行することです。"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（1999）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}