{
  "title": {
    "text": "RFC 2928 - Initial IPv6 Sub-TLA ID Assignments",
    "ja": "RFC 2928 - 初期IPv6サブTLA ID割り当て"
  },
  "number": 2928,
  "created_at": "2024-01-11 13:17:23.137603+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          R. Hinden\nRequest for Comments: 2928                                         Nokia\nCategory: Informational                                       S. Deering\n                                                                   Cisco\n                                                                 R. Fink\n                                                                    LBNL\n                                                                 T. Hain\n                                                               Microsoft\n                                                          September 2000",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 18,
      "text": "Initial IPv6 Sub-TLA ID Assignments",
      "ja": "初期IPv6サブTLA ID割り当て"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document defines initial assignments of IPv6 Sub-Top-Level Aggregation Identifiers (Sub-TLA ID) to the Address Registries. It is intended as technical input to the Internet Assigned Numbers Authority (IANA) from the Internet Engineering Task Force (IETF) Internet Protocol Next Generation (IPNG) and Next Generation Transition (NGTRANS) working groups, as an input to the process of developing guidelines for the allocation of IPv6 addresses.",
      "ja": "このドキュメントでは、IPv6サブトップレベルの集約識別子（サブTLA ID）のアドレスレジストリへの初期割り当てを定義します。インターネットへのインターネットエンジニアリングタスクフォース（IETF）インターネットプロトコル（IPNG）および次世代移行（NGTRANS）のワーキンググループからインターネットに割り当てられた数字局（IANA）への技術的入力として、ガイドラインの開発プロセスへの入力として意図されています。IPv6アドレスの割り当て用。"
    },
    {
      "indent": 3,
      "text": "This document was originally developed to provide advice to IANA in the fall of 1998 and is being published at this time for the historical record. The Internet Architecture Board (IAB) subsequently requested that the IANA delegate these assignments to the Address Registries. The IANA did this and the Address Registries are now using them to assign IPv6 addresses.",
      "ja": "この文書は、1998年の秋にIanaにアドバイスを提供するために開発されたものであり、現時点で歴史的記録のために公開されています。インターネットアーキテクチャ委員会（IAB）はその後、IANAがこれらの割り当てをアドレスレジストリに委任するよう要求しました。IANAはこれを行い、アドレスレジストリはそれらを使用してIPv6アドレスを割り当てています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document was originally developed to provide advice to IANA in the fall of 1998 and is being published at this time for the historical record. The IAB subsequently requested that the IANA delegate these assignments to the Address Registries. The IANA did this and the Address Registries are now using them to assign IPv6 addresses.",
      "ja": "この文書は、1998年の秋にIanaにアドバイスを提供するために開発されたものであり、現時点で歴史的記録のために公開されています。IABはその後、IANAがこれらの割り当てをアドレスレジストリに委任するよう要求しました。IANAはこれを行い、アドレスレジストリはそれらを使用してIPv6アドレスを割り当てています。"
    },
    {
      "indent": 3,
      "text": "This document defines initial assignments of IPv6 Sub-TLA Aggregation Identifiers (Sub-TLA ID) to the Address Registries. It is intended as technical input to the IANA from the IETF IP Next Generation (IPNG) and Next Generation Transition (NGTRANS) working groups, as an input to the process of developing guidelines for the allocation of IPv6 addresses.",
      "ja": "このドキュメントでは、IPv6サブTLA集約識別子（サブTLA ID）のアドレスレジストリへの初期割り当てを定義します。IPv6アドレスの割り当てのガイドラインを開発するプロセスへの入力として、IETF IP Next Generation（IPNG）およびNext Generation Transition（NGTRANS）ワーキンググループからのIANAへの技術的な入力として意図されています。"
    },
    {
      "indent": 3,
      "text": "The IAB and IESG have authorized the Internet Assigned Numbers Authority (IANA) as the appropriate entity to have the responsibility for the management of the IPv6 address space as defined in [ALLOC].",
      "ja": "IABとIESGは、[ALLOC]で定義されているIPv6アドレス空間の管理の責任を持つための適切なエンティティとしてインターネットを割り当てられた数字当局（IANA）を許可しました。"
    },
    {
      "indent": 3,
      "text": "The proposed initial assignment described in the document is consistent with:",
      "ja": "ドキュメントで説明されている提案された初期割り当ては、次のものと一致しています。"
    },
    {
      "indent": 6,
      "text": "- RFC 2373,\"IP Version 6 Addressing Architecture\" [ARCH] - RFC 2374 \"An Aggregatable Global Unicast Address Format\" [AGGR] - RFC 2450 \"Proposed TLA and NLA Assignment Rules\" [TLA-RULES]",
      "ja": "- RFC 2373、「IPバージョン6アドレス指定アーキテクチャ」[Arch] -RFC 2374 \"集合可能なグローバルユニキャストアドレス形式\" [Aggr] -RFC 2450 \"提案されたTLAおよびNLA割り当てルール\" [TLA -Rules]"
    },
    {
      "indent": 0,
      "text": "2. Background",
      "section_title": true,
      "ja": "2. 背景"
    },
    {
      "indent": 3,
      "text": "[TLA-RULES] specifies that TLA assignments will be done in two stages. The first stage is to allocate a Sub-TLA ID. This document specifies the initial assignments of Sub-TLA ID's to the Registries.",
      "ja": "[TLA-Rule]は、TLA割り当てが2つの段階で行われることを指定します。最初の段階は、サブTLA IDを割り当てることです。このドキュメントは、レジストリへのサブTLA IDの初期割り当てを指定します。"
    },
    {
      "indent": 3,
      "text": "As defined in [TLA-RULES] Section 5.1:",
      "ja": "[TLA-Rule]で定義されているように、セクション5.1："
    },
    {
      "indent": 5,
      "text": "\"Sub-TLA ID's are assigned out of TLA ID 0x0001 as follows. Note that use of the Reserved field to create the Sub-TLA field is specific to TLA ID 0x0001. It does not affect any other TLA.",
      "ja": "「サブTLA IDは次のようにTLA ID 0x0001から割り当てられます。サブTLAフィールドを作成するために予約済みフィールドを使用することはTLA ID 0x0001に固有であることに注意してください。他のTLAには影響しません。"
    },
    {
      "indent": 9,
      "text": "| 3  |    13    |    13   |       19      |\n+----+----------+---------+---------------+\n| FP |   TLA    | Sub-TLA |       NLA     |\n|    |   ID     |         |       ID      |\n+----+----------+---------+---------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "where:",
      "ja": "ただし："
    },
    {
      "indent": 7,
      "text": "FP = 001 = Format Prefix",
      "ja": "fp = 001 =フォーマットプレフィックス"
    },
    {
      "indent": 10,
      "text": "This is the Format Prefix used to identify aggregatable global unicast addresses.",
      "ja": "これは、集計可能なグローバルユニキャストアドレスを識別するために使用される形式のプレフィックスです。"
    },
    {
      "indent": 7,
      "text": "TLA ID = 0x0001 = Top-Level Aggregation Identifier",
      "ja": "TLA ID = 0x0001 =トップレベルの集約識別子"
    },
    {
      "indent": 10,
      "text": "This is the TLA ID assigned by the IANA for Sub-TLA allocation.",
      "ja": "これは、サブTLA割り当てのためにIANAによって割り当てられたTLA IDです。"
    },
    {
      "indent": 7,
      "text": "Sub-TLA ID = Sub-TLA Aggregation Identifier",
      "ja": "サブTLA ID =サブTLA集約識別子"
    },
    {
      "indent": 10,
      "text": "The Sub-TLA ID field is used by the registries for initial allocations to organizations meeting the requirements in Section 5.2 of this document. The IANA will assign small blocks (e.g., few hundred) of Sub-TLA ID's to registries. The registries will assign the Sub-TLA ID's to organizations meeting the requirements specified in Section 5.2. When the registries have assigned all of their Sub-TLA ID's they can request that the IANA give them another block. The blocks do not have to be contiguous. The IANA may also assign Sub-TLA ID's to organizations directly. This includes the temporary TLA assignment for testing and experimental usage for activities such as the 6bone or new approaches like exchanges.",
      "ja": "サブTLA IDフィールドは、このドキュメントのセクション5.2の要件を満たす組織への初期割り当てのためにレジストリによって使用されます。IANAは、レジストリに小さなブロック（たとえば、数百）のサブTLA IDを割り当てます。レジストリは、セクション5.2で指定された要件を満たすサブTLA IDを組織に割り当てます。レジストリがすべてのサブTLA IDを割り当てた場合、IANAに別のブロックを与えるように要求できます。ブロックは隣接する必要はありません。IANAは、サブTLA IDを組織に直接割り当てることもできます。これには、テストのための一時的なTLA割り当てと、6boneなどのアクティビティや交換などの新しいアプローチのための実験的使用が含まれます。"
    },
    {
      "indent": 7,
      "text": "NLA ID = Next-Level Aggregation Identifier",
      "ja": "NLA ID = NEXT-LEVEL Aggregation Identifier"
    },
    {
      "indent": 10,
      "text": "Next-Level Aggregation ID's are used by organizations assigned a TLA ID to create an addressing hierarchy and to identify sites. The organization can assign the top part of the NLA ID in a manner to create an addressing hierarchy appropriate to its network.\"",
      "ja": "次のレベルの集約IDは、アドレス指定階層を作成し、サイトを特定するためにTLA IDを割り当てられた組織で使用されます。組織は、ネットワークに適したアドレス指定階層を作成するために、NLA IDの最上部を方法で割り当てることができます。」"
    },
    {
      "indent": 3,
      "text": "Note: In the above quote from [TLA-RULES] the references to \"Section 5.2\" refer to section 5.2 in [TLA-RULES].",
      "ja": "注：[TLA-Rule]からの上記の引用では、「セクション5.2」への参照は、[TLA-Rule]のセクション5.2を参照しています。"
    },
    {
      "indent": 0,
      "text": "3. Initial Assignments",
      "section_title": true,
      "ja": "3. 初期割り当て"
    },
    {
      "indent": 3,
      "text": "As specified in [TLA-RULES], Sub-TLA ID assignments are made in blocks. The initial Sub-TLA ID assignments to IP address registries are in blocks of 64 Sub-TLA IDs. These assignments are listed below.",
      "ja": "[TLA-Rule]で指定されているように、サブTLA IDの割り当てはブロックで作成されます。IPアドレスレジストリへの最初のサブTLA ID割り当ては、64のサブTLA IDのブロックにあります。これらの割り当ては以下にリストされています。"
    },
    {
      "indent": 1,
      "text": "Binary Value      IPv6 Prefix Range                 Assignment\n----------------  -------------------------------   -------------------\n0000 000X XXXX X  2001:0000::/29 - 2001:01F8::/29   IANA\n0000 001X XXXX X  2001:0200::/29 - 2001:03F8::/29   APNIC\n0000 010X XXXX X  2001:0400::/29 - 2001:05F8::/29   ARIN\n0000 011X XXXX X  2001:0600::/29 - 2001:07F8::/29   RIPE NCC\n0000 100X XXXX X  2001:0800::/29 - 2001:09F8::/29   (future assignment)\n0000 101X XXXX X  2001:0A00::/29 - 2001:0BF8::/29   (future assignment)\n0000 110X XXXX X  2001:0C00::/29 - 2001:0DF8::/29   (future assignment)\n0000 111X XXXX X  2001:0E00::/29 - 2001:0FF8::/29   (future assignment)\n0001 000X XXXX X  2001:1000::/29 - 2001:11F8::/29   (future assignment)\n  .   .    .\n  .   .    .\n  .   .    .\n1111 111X XXXX X  2001:FE00::/29 - 2001:FFF8::/29   (future assignment)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 1,
      "text": "Where \"X\" indicates \"0\" or \"1\".",
      "ja": "ここで、「x」は「0」または「1」を示します。"
    },
    {
      "indent": 3,
      "text": "All other Sub-TLA ID values not listed above are reserved.",
      "ja": "上記の他のすべてのサブTLA ID値は予約されています。"
    },
    {
      "indent": 3,
      "text": "When a registry has assigned all of the Sub-TLA IDs in their block they can request that the IANA provide another block. The blocks assigned to a registry do not have to be contiguous.",
      "ja": "レジストリがブロック内のすべてのサブTLA IDを割り当てた場合、IANAが別のブロックを提供するように要求できます。レジストリに割り当てられたブロックは隣接する必要はありません。"
    },
    {
      "indent": 3,
      "text": "The block of Sub-TLA IDs assigned to the IANA (i.e., 2001:0000::/29 - 2001:01F8::/29) is for assignment for testing and experimental usage to support activities such as the 6bone, and for new approaches like exchanges.",
      "ja": "IANAに割り当てられたサブTLA IDのブロック（つまり、2001：0000 ::/29-2001：01F8 ::/29）は、6BONEなどのアクティビティをサポートするためのテストと実験的使用の割り当ておよび新しいアプローチのためのものです。交換のように。"
    },
    {
      "indent": 0,
      "text": "4. Acknowledgments",
      "section_title": true,
      "ja": "4. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to express their thanks to Joyce K. Reynolds, Thomas Narten, Kim Hubbard, Mirjam Kuehne, and Brian Carpenter for their help with this document.",
      "ja": "著者は、この文書を支援してくれたジョイス・K・レイノルズ、トーマス・ナルテン、キム・ハバード、ミルジャム・キューネ、ブライアン・カーペンターに感謝します。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "IPv6 addressing documents do not have any direct impact on Internet infrastructure security. Authentication of IPv6 packets is defined in [AUTH]. Authentication of the ownership of prefixes to avoid \"prefix stealing\" is a related security issue but is beyond the scope of this document.",
      "ja": "IPv6アドレス指定ドキュメントは、インターネットインフラストラクチャのセキュリティに直接影響を与えません。IPv6パケットの認証は[auth]で定義されています。「プレフィックス盗む」を回避するためのプレフィックスの所有権の認証は、関連するセキュリティの問題ですが、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 3,
      "text": "[AGGR] Hinden, R., Deering, S. and M. O'Dell, \"An Aggregatable Global Unicast Address Format\", RFC 2374, July 1998.",
      "ja": "[Aggr] Hinden、R.、Deering、S。and M. O'dell、「集計可能なグローバルユニキャストアドレス形式」、RFC 2374、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[ALLOC] IAB and IESG, \"IPv6 Address Allocation Management\", RFC 1881, December 1995.",
      "ja": "[Alloc] IABおよびIESG、「IPv6アドレス配分管理」、RFC 1881、1995年12月。"
    },
    {
      "indent": 3,
      "text": "[ARCH] Hinden, R., \"IP Version 6 Addressing Architecture\", RFC 2373, July 1998.",
      "ja": "[Arch] Hinden、R。、「IPバージョン6アドレス指定アーキテクチャ」、RFC 2373、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[AUTH] Kent, S. and R. Atkinson, \"IP Authentication Header\", RFC 2402, November 1998.",
      "ja": "[Auth] Kent、S。およびR. Atkinson、「IP認証ヘッダー」、RFC 2402、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[IPV6] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[IPv6] Deering、S。and R. Hinden、「インターネットプロトコル、バージョン6（IPv6）仕様」、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "ja": "[RFC2026] Bradner、S。、「インターネット標準プロセス - リビジョン3」、BCP 9、RFC 2026、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[TLA-RULES] Hinden, R., \"Proposed TLA and NLA Assignment Rules\", RFC 2450, December 1998.",
      "ja": "[TLA-rules] Hinden、R。、「提案されたTLAおよびNLA割り当て規則」、RFC 2450、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[TST-ALLOC] Hinden, R., Fink R. and J. Postel, \"IPv6 Testing Address Allocation\", RFC 2471, December 1998.",
      "ja": "[TST-Alloc] Hinden、R.、Fink R.およびJ. Postel、「IPv6テストアドレス割り当て」、RFC 2471、1998年12月。"
    },
    {
      "indent": 0,
      "text": "7. Authors' Addresses",
      "section_title": true,
      "ja": "7. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Robert M. Hinden Nokia 313 Fairchild Drive Mountain View, CA 94043 USA",
      "ja": "ロバートM.ヒンデンノキア313フェアチャイルドドライブマウンテンビュー、カリフォルニア94043 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650 625-2004\nEMail: hinden@iprg.nokia.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Stephen E. Deering Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134-1706 USA",
      "ja": "Stephen E. Deering Cisco Systems、Inc。170 West Tasman Drive San Jose、CA 95134-1706 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 527-8213\nEMail: deering@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Robert L. Fink Lawrence Berkeley National Lab 1 Cyclotron Rd. Bldg 50A, Room 3111 Berkeley, CA 94720 USA",
      "ja": "ロバートL.フィンクローレンスバークレーナショナルラボ1サイクロトロンロードBLDG 50A、ルーム3111バークレー、CA 94720 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 510 486-5692\nEMail: rlfink@lbl.gov",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Tony Hain Microsoft",
      "ja": "トニー・ハイン・マイクロソフト"
    },
    {
      "indent": 3,
      "text": "Phone: +1 425 703-6619\nEMail: tonyhain@microsoft.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}