{
  "title": {
    "text": "RFC 2339 - An Agreement Between the Internet Society, the IETF, and Sun Microsystems, Inc. in the matter of NFS V.4 Protocols",
    "ja": "RFC 2339 - NFS V.4プロトコルに関するInternet Society、IETF、およびSun Microsystems、Inc.間の合意"
  },
  "number": 2339,
  "created_at": "2020-08-16 12:18:32.879114+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                               The Internet Society\nRequest for Comments: 2339                              Sun Microsystems\nCategory: Informational                                         May 1998",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "An Agreement Between the Internet Society, the IETF, and Sun Microsystems, Inc. in the matter of NFS V.4 Protocols",
      "ja": "NFS V.4プロトコルに関するInternet Society、IETF、およびSun Microsystems、Inc.間の合意"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準も規定していません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This Request for Comments records an agreement between Sun Microsystems, Inc. and the Internet Society to permit the flow of Sun's Network File System specifications into the Internet Standards process conducted by the Internet Engineering Task Force.",
      "ja": "このRequest for Commentsは、Sun Microsystems、Inc.とインターネットソサエティの間の合意を記録したもので、Sunのネットワークファイルシステム仕様をインターネット技術標準化委員会が実施するインターネット標準プロセスに流すことを許可しています。"
    },
    {
      "indent": 0,
      "text": "Note:",
      "ja": "注意："
    },
    {
      "indent": 3,
      "text": "This RFC is NOT a standard. It is an official public record of an agreement between Sun Microsystems and the Internet Society. The referenced RFCs 1094 dated March 1989 (\"NFS: Network File System Protocol Specification\") and 1813 dated June 1995 (\"NFS Version 3 Protocol Specification\") are not attached to the document below, but are incorporated by reference.",
      "ja": "このRFCは標準ではありません。これは、Sun Microsystemsとインターネット協会の間の合意の公式な公開記録です。 1989年3月付けの参照RFC 1094（「NFS：ネットワークファイルシステムプロトコル仕様」）および1995年6月付けの1813（「NFSバージョン3プロトコル仕様」）は、以下のドキュメントには添付されていませんが、参照により組み込まれます。"
    },
    {
      "indent": 18,
      "text": "AGREEMENT BETWEEN THE INTERNET SOCIETY, THE IETF, AND SUN MICROSYSTEMS, INC. IN THE MATTER OF NFS V.4 PROTOCOLS",
      "ja": "NFS V.4プロトコルの問題におけるインターネット社会、IETF、およびSUN MICROSYSTEMS、INC。の間の合意"
    },
    {
      "indent": 3,
      "text": "This Agreement is made this 3rd day of March, 1998 by and between Sun Microsystems, Inc. (\"Donor\") and the Internet Society. In consideration of the mutual covenants and conditions set forth below, the parties hereto agree as follows:",
      "ja": "本契約は、1998年3月3日、Sun Microsystems、Inc.（「寄付者」）とインターネット協会の間で締結されます。下記の相互の規約および条件を考慮して、当事者は以下のとおり合意します。"
    },
    {
      "indent": 3,
      "text": "1. License Grant. For good and valuable consideration, receipt and sufficiency of which is hereby acknowledged, and solely for the purpose specified in Paragraph 2 below, Donor hereby grants to the Internet Society (\"Licensees\" which, for the purposes of this Agreement, shall include the Internet Engineering Task Force (\"IETF\"), the IETF Secretariat, and their respective members, officers, employees, contractors and participating individuals) a cost-free, perpetual, non-exclusive, worldwide right and license under any copyrights owned or otherwise licensable by Donor, under any Sun patent rights that are essential to practice the Specification, and any other Sun intellectual property rights to use, reproduce, distribute, perform, display and prepare derivative works of the Specification, and to authorize others to do so. For the purposes of this Agreement, \"Specification\" means the technical specification described more fully in Exhibit A, which Donor will make available as the initial point for development of the specification for NFS Version 4 as described hereunder, together with any technical specifications based thereon developed by Licensees.",
      "ja": "1. ライセンス付与。良質で価値のある検討のために、受領と十分性がここに認められ、以下の第2項に指定されている目的のためだけに、ドナーは本契約によりインターネット協会（以下「ライセンス契約者」といいます。エンジニアリングタスクフォース（「IETF」）、IETF事務局、およびそれぞれのメンバー、役員、従業員、請負業者、および参加者）が所有する、またはその他の方法でライセンスを取得できる著作権に基づく無償の永続的な非独占的な世界的権利およびライセンス仕様の実践に不可欠なサンの特許権、および仕様の派生物を使用、複製、配布、実行、表示、および準備し、他者にそうすることを許可するサンの知的財産権に基づくドナー。本契約において、「仕様」とは別紙Aでより詳細に説明されている技術仕様を意味します。ドナーは、以下に記載されているNFSバージョン4の仕様を開発するための最初のポイントとして、それに基づく技術仕様とともに提供します。ライセンシーによって開発されました。"
    },
    {
      "indent": 3,
      "text": "2. Statement of Purpose. The licenses granted in Section 1 are granted for the sole purpose of seeking to make the Specification an Internet standard.",
      "ja": "2. 目的説明書。セクション1で付与されたライセンスは、仕様をインターネット標準にすることを目的とする唯一の目的で付与されます。"
    },
    {
      "indent": 3,
      "text": "3. Evolution of the Specification. Donor further grants to Licensees a worldwide right and license to further evolve, develop and modify the Specification for the purpose of making the Specification an Internet Standard through the Internet Standardization Process (as specified in RFC 2026); Donor may not grant a license involving the Specification to any other party, including any standards group, that would authorize such party to evolve, develop, modify or promote the Specification as a standard. In particular, Donor acknowledges that if it performs any evolution, development or modification of the Specification outside of the Internet Standardization Process, that this should be clearly indicated as being a non-standard development, and that no reference to the Internet Standards Process is allowed for any such Specification developed outside of the Internet Standards Process.",
      "ja": "3. 仕様の進化。ドナーはさらに、インターネット標準化プロセス（RFC 2026で指定されているとおり）を通じてインターネット標準にするために、仕様をさらに発展、開発、変更するための世界的な権利とライセンスをライセンシーに付与します。ドナーは、規格を含む他の当事者に対して、規格を発展、開発、変更、または宣伝することを許可する、規格グループを含む他の当事者にライセンスを付与することはできません。特に、ドナーは、インターネット標準化プロセス以外で仕様の進化、開発、または変更を行う場合、これが非標準の開発であることを明確に示す必要があり、インターネット標準プロセスへの参照は許可されないことを認めます。インターネット標準プロセス外で開発されたそのような仕様。"
    },
    {
      "indent": 3,
      "text": "4. Non-Confidentiality. Donor hereby acknowledges that Licensees assume no obligation to maintain any confidentiality with respect to the Specification licensed hereunder. Licensees acknowledge that any rights not expressly granted herein are reserved by Donor. Donor represents that, to the best of its knowledge, there are no infringement claims against the Specification.",
      "ja": "4. 非機密保持。提供者は、ここで、ライセンシーが、本契約に基づいてライセンスされた仕様に関して機密性を維持する義務を負わないことを認めます。ライセンシーは、ここに明示的に付与されていないいかなる権利もドナーによって留保されることを認めます。ドナーは、その知る限り、仕様に対する侵害の主張はないことを表明します。"
    },
    {
      "indent": 3,
      "text": "5. Future License. Donor hereby acknowledges that Licensees have no duty to publish or otherwise use or disseminate the Specification, including, in particular, an obligation to raise the Specification to the Internet standards-track. Provided that the Specification is elevated to \"Proposed Standard\" level within 24 months of the execution of this Agreement, Donor hereby agrees to license the Specification to others at no charge and otherwise under substantially similar terms as those granted to Licensee herein (with the exception that such use of the Specification by such Licensees shall be for purposes of implementing and complying with the Standard rather than for making the Specification an Internet Standard), so long as such licensees of the Specification implement and comply with the Internet standard. In the event the Specification is not elevated to \"Proposed Standard\" level within 24 months of the execution of this Agreement, then the license granted in Section 3 of this agreement shall terminate.",
      "ja": "5. 将来のライセンス。ドナーは、ここに、ライセンシーが、特にインターネットの標準化に向けて仕様を引き上げる義務を含め、仕様を公開またはその他の方法で使用または普及する義務がないことを認めます。仕様が本契約の締結後24か月以内に「提案された標準」レベルに引き上げられた場合、ドナーは、本契約をライセンシーに付与されたものと実質的に同様の条件（ただし、このようなライセンシーによる仕様の使用は、仕様をインターネット標準にすることよりも、仕様をインターネット標準にするためではなく、標準を実装および準拠することを目的とするものとします。本契約の履行から24か月以内に仕様が「提案された標準」レベルに引き上げられない場合、本契約のセクション3で付与されたライセンスは終了します。"
    },
    {
      "indent": 3,
      "text": "6. DISCLAIMER OF WARRANTY. THE SPECIFICATION IS PROVIDED TO LICENSEES \"AS IS\", AND ALL REPRESENTATIONS AND WARRANTIES, EXPRESS OR IMPLIED, INCLUDING FITNESS FOR A PARTICULAR PURPOSE. MERCHANTABILITY AND NONINFRINGEMENT ARE HEREBY DISCLAIMED.",
      "ja": "6. 保証の否認。仕様は、「現状のまま」のライセンシー、および明示または黙示を問わず、特定の目的への適合性を含むすべての表明および保証に提供されます。商品性および非侵害性は、ここに否認されます。"
    },
    {
      "indent": 3,
      "text": "7. LIMITATION OF LIABILITY. IN NO EVENT WILL DONOR BE LIABLE FOR ANY LOST REVENUE, PROFITS OR DATA, OR FOR DIRECT, SPECIAL, INDIRECT, CONSEQUENTIAL, INCIDENTAL OR PUNITIVE DAMAGES, HOWEVER CAUSED AND REGARDLESS OF THEORY OF LIABILITY ARISING OUT OF THE USE OR INABILITY TO USE THE SPECIFICATION, EVEN IF DONOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.",
      "ja": "7. 責任の制限。いかなる場合においても、収益、利益、データの損失、または直接的、特別、間接的、結果的、偶発的、または懲罰的損害について、利用または不利用に起因する責任の理論に関係なく、寄付者は責任を負わないものとします。 、ドナーがそのような損害の可能性について知らされていたとしても。"
    },
    {
      "indent": 3,
      "text": "8. Acknowledgment. Donor agrees to permit Licensees to use Donor's name and address to indicate the original source of the Specification.",
      "ja": "8. 了承。ドナーは、ライセンシーがドナーの名前と住所を使用して仕様の元のソースを示すことを許可することに同意します。"
    },
    {
      "indent": 0,
      "text": " 9. Miscellaneous. This Agreement constitutes the entire agreement between the parties concerning its subject matter, and supersedes all prior written or oral agreements and discussions. All additions or modifications to this agreement must be made in writing and must be signed by an authorized representative of each party. If any term or condition of this Agreement is declared void or unenforceable as provided herein or by a court of competent jurisdiction, the remaining provisions shall remain in full force and effect. The parties agree to comply strictly with all applicable export control laws and regulations. Where no U.S. Federal law governs, this agreement will be governed by the law of the State of California without reference to its conflict of laws provision.",
      "ja": "9.その他。本契約は、その主題に関する当事者間の完全な合意を構成し、事前の書面または口頭によるすべての合意および議論に優先します。この契約の追加または変更はすべて書面で行う必要があり、各当事者の正式な代表者が署名する必要があります。本契約の条項または条件が、本書または管轄の裁判所によって無効または実施不可能であると宣言された場合でも、残りの規定は引き続き完全に効力を有するものとします。当事者は、適用されるすべての輸出管理法および規制を厳格に遵守することに同意します。米国連邦法が適用されない場合、本契約は、抵触法の規定に関係なく、カリフォルニア州法に準拠します。"
    },
    {
      "indent": 3,
      "text": "IN WITNESS WHEREOF, the parties hereto have caused this Agreement to be executed by their duly authorized representatives.",
      "ja": "その証拠として、本契約の当事者は正当に権限を与えられた代表者によって本契約が履行されるようにしました。"
    },
    {
      "indent": 3,
      "text": "Signature /S/ Rich Green Date 3 March 1998 Name Rich Green Title VP Solaris SunSoft, Inc.",
      "ja": "署名/ S /リッチグリーン日付1998年3月3日名前リッチグリーンタイトルVP Solaris SunSoft、Inc."
    },
    {
      "indent": 3,
      "text": "Signature /S/ Donald M. Heath Date 6 March 1998 Name Donald M. Heath Title President and CEO of the Internet Society",
      "ja": "署名/ S /ドナルドM.ヒース日付1998年3月6日名前ドナルドM.ヒースタイトルインターネット協会の社長兼CEO"
    },
    {
      "indent": 3,
      "text": "Exhibit A The specifications embodied in RFCs 1094 and 1813, minus the portions of RFCs 1094 and 1813 that assume that NFS Version 2 and Version 3 operate over XDR and ONC RPC.* The control of ONC RPC program number 100003 (NFS) for the purpose of generating Version numbers 4 and onward.",
      "ja": "資料A RFC 1094および1813で具体化された仕様から、NFSバージョン2およびバージョン3がXDRおよびONC RPCで動作すると想定するRFC 1094および1813の部分を差し引いたもの。*この目的のためのONC RPCプログラム番号100003（NFS）の制御バージョン番号4以降の生成。"
    },
    {
      "indent": 3,
      "text": "*Note: ISOC already has a license to use XDR and ONC RPC (see IETF RFC 1790), and thus may determine whether or not to create an NFS Version 4 that uses XDR and/or ONC RPC.",
      "ja": "*注意：ISOCにはすでにXDRおよびONC RPCを使用するライセンスがあり（IETF RFC 1790を参照）、XDRやONC RPCを使用するNFSバージョン4を作成するかどうかを決定する場合があります。"
    },
    {
      "indent": 0,
      "text": "Security Considerations",
      "ja": "セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Since this document records an agreement rather than describes a technology security is not directly effected but, that said, one of the aims of an IETF NFS working group should be to ensure that a standards track NFS protocol has adequate security.",
      "ja": "このドキュメントはテクノロジーのセキュリティに直接影響を与えるものではなく、合意を記録しているため、IETF NFSワーキンググループの目的の1つは、NFSプロトコルが適切なセキュリティを確保していることを確認することです。"
    },
    {
      "indent": 0,
      "text": "Editor's Address",
      "ja": "編集者の住所"
    },
    {
      "indent": 3,
      "text": "Scott Bradner Harvard University 1350 Mass Ave. Rm 876 Cambridge, MA 02138",
      "ja": "スコットブラッドナーハーバード大学1350 Mass Ave. Rm 876 Cambridge、MA 02138"
    },
    {
      "indent": 3,
      "text": "Phone: +1 617 495 3864\nEMail: sob@harvard.edu",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントとその翻訳はコピーして他のユーザーに提供することができ、コメントまたはその他の方法で説明したり、その実装を支援する二次的著作物は、いかなる種類の制限なしに、全体または一部を準備、コピー、公開、および配布することができますただし、上記の著作権表示とこの段落は、そのようなすべてのコピーと派生物に含まれています。ただし、このドキュメント自体は、著作権に関する通知を削除したり、インターネットソサエティや他のインターネット組織への参照を削除したりするなど、いかなる方法でも変更できません。ただし、インターネット標準を開発する目的で必要な場合は除きます。インターネット標準のプロセスに従うか、または必要に応じて、それを英語以外の言語に翻訳する必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記で付与された制限付きのアクセス許可は永続的であり、インターネットソサエティまたはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は「現状有姿」で提供され、インターネット社会およびインターネット技術タスクフォースは、明示または黙示を問わず、ここに記載されている情報の使用が保証するものに限定されないいかなる保証も含め、一切の保証を否認します。商品性または特定の目的への適合性に関する権利または黙示の保証を侵害すること。"
    }
  ]
}