{
  "title": {
    "text": "RFC 2318 - The text/css Media Type",
    "ja": "RFC 2318 - テキスト/ CSSメディアタイプ"
  },
  "number": 2318,
  "created_at": "2019-10-23 02:58:44.573245+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                             H. Lie\nRequest for Comments: 2318                                        B. Bos\nCategory: Informational                                        C. Lilley\n                                                                     W3C\n                                                              March 1998",
      "raw": true
    },
    {
      "indent": 24,
      "text": "The text/css Media Type",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Cascading Style Sheets (CSS) is a style sheet language for the World Wide Web. CSS style sheets have been in use since October 1995 using the Media Type text/css without registration; this memo seeks to regularize that position.",
      "ja": "カスケーディングスタイルシート（CSS）は、ワールド・ワイド・ウェブのためのスタイルシート言語です。 CSSスタイルシートは、登録なしでメディアタイプがtext / cssのを使用して1995年10月以来使用されています。このメモは、その位置を定例化することを目指しています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The World Wide Web Consortium has issued a Recommendation [1], which defines Cascading Style Sheets, level 1. This memo provides information about the text/css Media Type.",
      "ja": "ワールドワイドウェブコンソーシアムは、カスケーディング・スタイル・シートを定義する、[1]レベル1を勧告を発行したこのメモは、テキスト/ CSSメディアタイプについての情報を提供します。"
    },
    {
      "indent": 0,
      "text": "2. Cascading Style Sheets",
      "section_title": true,
      "ja": "2.カスケーディング・スタイル・シート"
    },
    {
      "indent": 3,
      "text": "Cascading Style Sheets (CSS) is a style sheet language for the World Wide Web. It describes the presentation (e.g. fonts, colors and spacing) of structured documents. CSS is human readable and writable, and expresses style in common desktop publishing terminology.",
      "ja": "カスケーディングスタイルシート（CSS）は、ワールド・ワイド・ウェブのためのスタイルシート言語です。これは、構造化文書のプレゼンテーション（例えば、フォント、色、間隔）について説明します。 CSSは、人間の読み取りおよび書き込み可能であり、一般的なデスクトップパブリッシング用語でスタイルを表現します。"
    },
    {
      "indent": 3,
      "text": "CSS style sheets have been in use since October 1995 using the Media Type text/css without registration; this memo seeks to regularize that position.",
      "ja": "CSSスタイルシートは、登録なしでメディアタイプがtext / cssのを使用して1995年10月以来使用されています。このメモは、その位置を定例化することを目指しています。"
    },
    {
      "indent": 3,
      "text": "A CSS style sheet can be either: (1) external - the style sheet is linked to a document through a URI and exists as a separate object on the Web. The media type text/css is used when fetching the object, for example in the Content-Type and Accept header fields of HTTP [2].",
      "ja": "CSSスタイルシートは、いずれであってもよい：（1）外部 - スタイルシートは、URIを介してドキュメントにリンクされ、ウェブ上の別個のオブジェクトとして存在しています。メディアタイプtext / cssのオブジェクトをフェッチする際のContent-Typeに、例えば、使用されるとHTTPのヘッダフィールドを許可されている[2]。"
    },
    {
      "indent": 3,
      "text": "(2) internal - the style sheet is contained within the document. A typical scenario is an HTML [3] document that contains a style sheet within the STYLE element. Due to this close relationship, HTML and CSS share the same top-level name (\"text\").",
      "ja": "（2）内部 - スタイルシートは、文書内に含まれます。典型的なシナリオは、スタイル要素内のスタイルシートを含むHTML [3]文書です。これによって密接な関係、HTMLやCSSに同じトップレベル名（「テキスト」）を共有しています。"
    },
    {
      "indent": 0,
      "text": "4. Registration Information",
      "section_title": true,
      "ja": "4.登録情報"
    },
    {
      "indent": 7,
      "text": "To: ietf-types@iana.org\nSubject: Registration of MIME media type text/css",
      "raw": true
    },
    {
      "indent": 7,
      "text": "MIME media type name: text",
      "ja": "MIMEメディアタイプ名：テキスト"
    },
    {
      "indent": 7,
      "text": "MIME subtype name: css",
      "ja": "MIMEサブタイプ名：CSS"
    },
    {
      "indent": 7,
      "text": "Required parameters: none",
      "ja": "必須パラメータ：なし"
    },
    {
      "indent": 7,
      "text": "Optional parameters: charset",
      "ja": "オプションのパラメータ：文字セット"
    },
    {
      "indent": 7,
      "text": "The syntax of CSS is expressed in US-ASCII, but a CSS file can contain strings which may use any Unicode character. Any charset that is a superset of US-ASCII may be used; US-ASCII, iso-8859-X and utf-8 are recommended.",
      "ja": "CSSの構文はUS-ASCIIで表現されますが、CSSファイルには、任意のUnicode文字を使用することができ、文字列を含めることができます。 US-ASCIIのスーパーセットである任意の文字セットを使用することができます。 US-ASCII、ISO-8859-XおよびUTF-8が推奨されています。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations:",
      "ja": "エンコードの考慮事項："
    },
    {
      "indent": 7,
      "text": "For use with transports that are not 8-bit clean, quoted-\nprintable encoding is recommended since the majority of\ncharacters will be CSS syntax and thus US-ASCII",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "ja": "セキュリティの考慮事項："
    },
    {
      "indent": 7,
      "text": "Applying a style sheet to a document may hide information\notherwise visible. For example, a very small font size may be\nspecified, or the display of certain document elements may be\nturned off.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "CSS style sheets consist of declarative property/value pairs assigned to element selectors. They contain no executable code.",
      "ja": "CSSスタイルシート要素セレクタに割り当てられた宣言プロパティ/値のペアで構成されています。彼らは、実行可能コードが含まれていません。"
    },
    {
      "indent": 7,
      "text": "As with HTML documents, CSS style sheets may contain links to other media (images, sounds, fonts, other style sheets) and those links are typically followed automatically by software, resulting in the transfer of files without the explicit request of the user for each one. The security considerations of each linked file are those of the individual registered types.",
      "ja": "HTML文書と同じように、CSSスタイルシートは、他のメディアへのリンクが含まれていてもよい（画像、サウンド、フォント、他のスタイルシート）と、これらのリンクは、通常、それぞれのユーザーの明示的な要求せずにファイルの転送で、その結果、ソフトウェアによって自動的に追跡されます1。各リンクされたファイルのセキュリティ上の考慮事項は、個々の登録タイプのものです。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations:",
      "ja": "相互運用性の考慮事項："
    },
    {
      "indent": 7,
      "text": "CSS has proven to be widely interoperable across computer\nplatforms, across Web browsers of different makes, and for import\nand export in multiple authoring tools.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Published specification: see [1]",
      "ja": "公開された仕様：[1]参照"
    },
    {
      "indent": 3,
      "text": "Applications which use this media type:",
      "ja": "このメディアタイプを使用するアプリケーション："
    },
    {
      "indent": 7,
      "text": "CSS is device-, platform- and vendor-neutral and is supported by\na wide range of Web user agents and authoring tools for\nformatting HTML and XML documents.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "ja": "追加情報："
    },
    {
      "indent": 7,
      "text": "Magic number(s): none\nFile extension(s): .css\nMacintosh File Type Code(s): \"css \"\nObject Identifier(s) or OID(s): none",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "ja": "詳細のために連絡する人とEメールアドレス："
    },
    {
      "indent": 7,
      "text": "The authors of this memo.",
      "ja": "このメモの作者。"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図している用法：COMMON"
    },
    {
      "indent": 5,
      "text": "Author/Change controller:",
      "ja": "著者/変更コントローラ："
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Lie, H., and B. Bos, \"Cascading Style Sheets, level 1\", W3C Recommendation REC-CSS1-961217, http://www.w3.org/TR/REC-CSS1-961217, December 1996.",
      "ja": "[1]リー、H.、およびB.ボス、 \"カスケーディングスタイルシート、レベル1\"、W3C勧告REC-CSS1-961217、http://www.w3.org/TR/REC-CSS1-961217、1996年12月。"
    },
    {
      "indent": 3,
      "text": "[2] Fielding, R., Gettys, J., Mogul, J., Nielsen, H., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2068, January 1997.",
      "ja": "[2]フィールディング、R.、ゲティス、J.、モーグル、J.、ニールセン、H.、およびT.バーナーズ - リー、 \"ハイパーテキスト転送プロトコル -  HTTP / 1.1\"、RFC 2068、1997年1月。"
    },
    {
      "indent": 3,
      "text": "[3] Raggett, D., Le Hors, A. and I. Jacobs, \"HTML 4.0 Specification\", W3C Recommendation REC-html40-971218, http://www.w3.org/TR/REC-html40, December 1997.",
      "ja": "[3] Raggett、D.、ル・オードブル、A.およびI.ジェイコブス、 \"HTML 4.0仕様書\"、W3C勧告REC-html40-971218、http://www.w3.org/TR/REC-html40、1997年12月。"
    },
    {
      "indent": 0,
      "text": "6. Authors' Addresses",
      "section_title": true,
      "ja": "6.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Hakon Lie W3C/INRIA 2004, route des Lucioles - B.P. 93 06902 Sophia Antipolis Cedex FRANCE",
      "ja": "ホーコンリーW3C / INRIA 2004ルートデLucioles  -  PB 93 06902ソフィアアンティポリスセデックスFRANCE"
    },
    {
      "indent": 3,
      "text": "Phone: +33 (0)492387771 Fax: +33 (0)493657765 EMail: howcome@w3.org",
      "ja": "電話：+33（0）492387771ファックス：+33（0）493657765 Eメール：howcome@w3.org"
    },
    {
      "indent": 3,
      "text": "Bert Bos 2004, route des Lucioles - B.P. 93 06902 Sophia Antipolis Cedex FRANCE",
      "ja": "バート・ボス、2004年、ルートデLucioles  -  PB 93 06902ソフィアアンティポリスセデックスFRANCE"
    },
    {
      "indent": 3,
      "text": "Phone: +33 (0)492387692 Fax: +33 (0)493657765 EMail: bert@w3.org",
      "ja": "電話：+33（0）492387692ファックス：+33（0）493657765 Eメール：bert@w3.org"
    },
    {
      "indent": 3,
      "text": "Chris Lilley 2004, route des Lucioles - B.P. 93 06902 Sophia Antipolis Cedex FRANCE",
      "ja": "クリス・リレイ2004ルートデLucioles  -  PB 93 06902ソフィアアンティポリスセデックスFRANCE"
    },
    {
      "indent": 3,
      "text": "Phone: +33 (0)492387987 Fax: +33 (0)493657765 EMail: chris@w3.org",
      "ja": "電話：+33（0）492387987ファックス：+33（0）493657765 Eメール：chris@w3.org"
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "ja": "7.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implmentation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、そのimplmentationを支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\"",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています権利または特定の目的に対する商品性または適合性の黙示の保証を侵害し。」"
    }
  ]
}