{
  "title": {
    "text": "RFC 2643 - Cabletron's SecureFast VLAN Operational Model",
    "ja": "RFC 2643 - CabletronのSecureFast VLAN運用モデル"
  },
  "number": 2643,
  "created_at": "2019-10-28 06:40:26.789329+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          D. Ruffen\nRequest for Comments: 2643                                        T. Len\nCategory: Informational                                       J. Yanacek\n                                          Cabletron Systems Incorporated\n                                                             August 1999",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Cabletron's SecureFast VLAN Operational Model\n                 Version 1.8",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Cabletron's SecureFast VLAN (SFVLAN) product implements a distributed connection-oriented switching protocol that provides fast forwarding of data packets at the MAC layer. The product uses the concept of virtual LANs (VLANs) to determine the validity of call connection requests and to scope the broadcast of certain flooded messages.",
      "ja": "CabletronのSecureFast VLAN（SFVLAN）製品は、MAC層でのデータパケットの高速転送を提供する分散コネクション型スイッチングプロトコルを実装します。製品には、特定の浸水のメッセージの放送呼接続要求のと範囲の妥当性を判断するためにVLAN（仮想LAN）の概念を使用しています。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction.............................................  3\n   1.1 Data Conventions.....................................  3\n   1.2 Definitions of Commonly Used Terms...................  4\n2. SFVLAN Overview..........................................  6\n   2.1 Features.............................................  7\n   2.2 VLAN Principles......................................  8\n       2.2.1 Default, Base and Inherited VLANs..............  8\n       2.2.2 VLAN Configuration Modes.......................  8\n             2.2.2.1 Endstations............................  8\n             2.2.2.2 Ports..................................  9\n             2.2.2.3 Order of Precedence....................  9\n       2.2.3 Ports with Multiple VLAN Membership............ 10\n   2.3 Tag/Length/Value Method of Addressing................ 10\n   2.4 Architectural Overview............................... 11\n3. Base Services............................................ 13\n4. Call Processing.......................................... 14\n   4.1 Directory Service Center............................. 14\n       4.1.1 Local Add Server............................... 15",
      "raw": true
    },
    {
      "indent": 3,
      "text": "       4.1.2 Inverse Resolve Server......................... 15\n       4.1.3 Local Delete Server............................ 18\n   4.2 Topology Service Center.............................. 18\n       4.2.1 Neighbor Discovery Server...................... 18\n       4.2.2 Spanning Tree Server........................... 18\n             4.2.2.1 Creating and Maintaining\n                                the Spanning Tree........... 19\n             4.2.2.2 Remote Blocking........................ 19\n       4.2.3 Link State Server.............................. 20\n   4.3 Resolve Service Center............................... 21\n       4.3.1 Table Server................................... 22\n       4.3.2 Local Server................................... 22\n       4.3.3 Subnet Server.................................. 22\n       4.3.4 Interswitch Resolve Server..................... 22\n       4.3.5 Unresolvable Server............................ 23\n       4.3.6 Block Server................................... 23\n   4.4 Policy Service Center................................ 24\n       4.4.1 Unicast Rules Server........................... 24\n   4.5 Connect Service Center............................... 25\n       4.5.1 Local Server................................... 25\n       4.5.2 Link State Server.............................. 25\n       4.5.3 Directory Server............................... 26\n   4.6 Filter Service Center................................ 26\n   4.7 Path Service Center.................................. 26\n       4.7.1 Link State Server.............................. 26\n       4.7.2 Spanning Tree Server........................... 27\n   4.8 Flood Service Center................................. 27\n       4.8.1 Tag-Based Flood Server......................... 27\n5. Monitoring Call Connections.............................. 27\n   5.1 Definitions.......................................... 27\n   5.2 Tapping a Connection................................. 28\n       5.2.1 Types of Tap Connections....................... 28\n       5.2.2 Locating the Probe and Establishing\n                                the Tap Connection.......... 29\n       5.2.3 Status Field................................... 30\n   5.3 Untapping a Connection............................... 31\n6. Interswitch Message Protocol (ISMP)...................... 32\n   6.1 General Packet Structure............................. 32\n       6.1.1 Frame Header................................... 32\n       6.1.2 ISMP Packet Header............................. 33\n             6.1.2.1 Version 2.............................. 33\n             6.1.2.2 Version 3.............................. 34\n       6.1.3 ISMP Message Body.............................. 35\n   6.2 Interswitch BPDU Message............................. 35\n   6.3 Interswitch Remote Blocking Message.................. 36\n   6.4 Interswitch Resolve Message.......................... 37\n       6.4.1 Prior to Version 1.8........................... 37\n       6.4.2 Version 1.8.................................... 41",
      "raw": true
    },
    {
      "indent": 3,
      "text": "   6.5 Interswitch New User Message......................... 46\n   6.6 Interswitch Tag-Based Flood Message.................. 49\n       6.6.1 Prior to Version 1.8........................... 49\n       6.6.2 Version 1.8.................................... 52\n   6.7 Interswitch Tap/Untap Message........................ 55\n7. Security Considerations.................................. 58\n8. References............................................... 58\n9. Authors' Addresses....................................... 59\n10. Full Copyright Statement................................ 60",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This memo is being distributed to members of the Internet community in order to solicit reactions to the proposals contained herein. While the specification discussed here may not be directly relevant to the research problems of the Internet, it may be of interest to researchers and implementers.",
      "ja": "このメモはここに含まれた提案に対する反応を勧誘するために、インターネットコミュニティのメンバーに配布されています。ここで説明する仕様は、インターネットの研究の問題に直接関係ないかもしれませんが、それは研究者や実装に興味があるかもしれ。"
    },
    {
      "indent": 0,
      "text": "1.1 Data Conventions",
      "section_title": true,
      "ja": "1.1データの表記"
    },
    {
      "indent": 3,
      "text": "The methods used in this memo to describe and picture data adhere to the standards of Internet Protocol documentation [RFC1700]. In particular:",
      "ja": "記述した画像データは、インターネットプロトコルドキュメント[RFC1700]の基準を遵守するために、このメモで使用される方法。特に："
    },
    {
      "indent": 6,
      "text": "The convention in the documentation of Internet Protocols is to express numbers in decimal and to picture data in \"big-endian\" order. That is, fields are described left to right, with the most significant octet on the left and the least significant octet on the right.",
      "ja": "インターネットプロトコルのドキュメントの規則は、小数点以下の数字を表現すると、「ビッグエンディアン」の順番でデータを描くことです。これは、フィールドが右に左と最下位オクテットの最も重要なオクテットで、右に左に説明されているされています。"
    },
    {
      "indent": 6,
      "text": "The order of transmission of the header and data described in this document is resolved to the octet level. Whenever a diagram shows a group of octets, the order of transmission of those octets is the normal order in which they are read in English.",
      "ja": "ヘッダと、この文書に記載されたデータの送信の順序は、オクテットレベルに解決されます。図はオクテットのグループを示したときはいつでも、それらのオクテットの送信の順序は、英語で読まれる通常の順序です。"
    },
    {
      "indent": 6,
      "text": "Whenever an octet represents a numeric quantity the left most bit in the diagram is the high order or most significant bit. That is, the bit labeled 0 is the most significant bit.",
      "ja": "オクテットが数値を表すときは常に図中最も左のビットが高位または最上位ビットです。つまり、ビットは0が最上位ビットであるラベル。"
    },
    {
      "indent": 6,
      "text": "Similarly, whenever a multi-octet field represents a numeric quantity the left most bit of the whole field is the most significant bit. When a multi-octet quantity is transmitted the most significant octet is transmitted first.",
      "ja": "マルチオクテットフィールドが数値を表すときはいつでも同様に、フィールド全体の最も左のビットが最上位ビットです。マルチオクテット量を送信する際に最も重要なオクテットが最初に送信されます。"
    },
    {
      "indent": 0,
      "text": "1.2 Definitions of Commonly Used Terms",
      "section_title": true,
      "ja": "一般的に使用される用語の定義1.2"
    },
    {
      "indent": 3,
      "text": "This section contains a collection of definitions for terms that have a specific meaning for the SFVLAN product and that are used throughout the text.",
      "ja": "このセクションでは、SFVLAN製品の特定の意味を持っており、それがテキストで使用されている用語の定義のコレクションが含まれています。"
    },
    {
      "indent": 3,
      "text": "Switch ID",
      "ja": "スイッチのID"
    },
    {
      "indent": 6,
      "text": "A 10-octet value that uniquely identifies an SFVLAN switch within the switch fabric. The value consists of the 6-octet base MAC address of the switch, followed by 4 octets of zeroes.",
      "ja": "一意スイッチファブリック内SFVLANスイッチを識別する10オクテットの値。値がゼロの4つのオクテットに続くスイッチの6オクテットベースMACアドレスからなります。"
    },
    {
      "indent": 3,
      "text": "Network link",
      "ja": "ネットワークリンク"
    },
    {
      "indent": 6,
      "text": "The physical connection between two switches. A network link is associated with a network interface (or port) of a switch.",
      "ja": "二つのスイッチ間の物理的接続。ネットワークリンクは、スイッチのネットワークインタフェース（またはポート）に関連付けられます。"
    },
    {
      "indent": 3,
      "text": "Network port",
      "ja": "ネットワークポート"
    },
    {
      "indent": 6,
      "text": "An interface on a switch that attaches to another switch.",
      "ja": "別のスイッチに接続するスイッチ上のインターフェイス。"
    },
    {
      "indent": 3,
      "text": "Access port",
      "ja": "アクセスポート"
    },
    {
      "indent": 6,
      "text": "An interface on a switch that attaches to a user endstation.",
      "ja": "ユーザーのエンドステーションに接続するスイッチ上のインターフェイス。"
    },
    {
      "indent": 3,
      "text": "Port ID",
      "ja": "ポートID"
    },
    {
      "indent": 6,
      "text": "A 10-octet value that uniquely identifies an interface of a switch. The value consists of the 6-octet base MAC address of the switch, followed by the 4-octet local port number of the interface.",
      "ja": "一意スイッチのインタフェースを識別する10オクテットの値。値は、インターフェイスの4オクテットローカルポート番号に続くスイッチの6オクテットベースMACアドレスからなります。"
    },
    {
      "indent": 3,
      "text": "Neighboring switches",
      "ja": "隣接スイッチ"
    },
    {
      "indent": 6,
      "text": "Two switches attached to a common (network) link.",
      "ja": "一般的な（ネットワーク）リンクに取り付けられた2つのスイッチ。"
    },
    {
      "indent": 3,
      "text": "Call connection",
      "ja": "コールの接続"
    },
    {
      "indent": 6,
      "text": "A mapping of user traffic through a switch that correlates the source and destination address pair specified within the packet to an inport and outport pair on the switch.",
      "ja": "スイッチオンのInportおよびアウトポートペアにパケット内で指定された送信元および宛先アドレスペアを対応付けるスイッチを介してユーザトラフィックのマッピング。"
    },
    {
      "indent": 3,
      "text": "Call connection path",
      "ja": "コールの接続経路"
    },
    {
      "indent": 6,
      "text": "A set of 0 to 7 network links over which user traffic travels between the source and destination endstations. Call connection paths are selected from a list of alternate equal cost paths calculated by the VLS protocol [IDvlsp], and are chosen to load balance traffic across the fabric.",
      "ja": "0~7ネットワークリンクのセットは、その上にユーザトラフィックは、送信元と宛先のエンドステーション間を移動します。呼接続経路は、VLSプロトコル[IDvlsp]によって算出代替の等コストパスのリストから選択され、そして織物を横切ってバランスのトラフィックをロードするように選択されます。"
    },
    {
      "indent": 3,
      "text": "Ingress switch",
      "ja": "イングレススイッチ"
    },
    {
      "indent": 6,
      "text": "The owner switch of the source endstation of a call connection. That is, the source endstation is attached to one of the local access ports of the switch.",
      "ja": "呼接続のソースエンドステーションの所有者スイッチ。つまり、ソース・エンドステーションは、スイッチのローカルアクセスポートの一方に取り付けられています。"
    },
    {
      "indent": 3,
      "text": "Egress switch",
      "ja": "出力スイッチ"
    },
    {
      "indent": 6,
      "text": "The owner switch of the destination endstation of a call connection. That is, the destination endstation is attached to one of the local access ports of the switch.",
      "ja": "呼接続の宛先エンドステーションの所有者スイッチ。つまり、宛先エンドステーションは、スイッチのローカルアクセスポートの一方に取り付けられています。"
    },
    {
      "indent": 3,
      "text": "Intermediate switches",
      "ja": "中間スイッチ"
    },
    {
      "indent": 6,
      "text": "Any switch along the call connection path on which user traffic enters and leaves over network links. Note that the following types of connections have no intermediate switches:",
      "ja": "ユーザトラフィックが入り、ネットワークリンクを介して出るに呼接続パスに沿って任意のスイッチ。次の接続タイプは何の中間スイッチを持っていないことに注意してください："
    },
    {
      "indent": 6,
      "text": "- Call connections between source and destination endstations that are attached to the same switch -- that is, the ingress switch is the same as the egress switch. Note also that the path for this type of connection consists of 0 network links.",
      "ja": " - 同じスイッチに接続されたソースと宛先エンドステーションとの間の呼接続 - つまり、入口スイッチは出力スイッチと同じです。このタイプの接続のためのパスは0ネットワークリンクから構成されていることにも注意してください。"
    },
    {
      "indent": 6,
      "text": "- Call connections where the ingress and egress switches are physical neighbors connected by a single network link. The path for this type of connection consists of a single network link.",
      "ja": " - 入力および出力スイッチは、単一のネットワークリンクで接続された物理的な隣接している接続を呼び出します。このタイプの接続のためのパスは、単一のネットワークリンクで構成されています。"
    },
    {
      "indent": 3,
      "text": "InterSwitch Message protocol (ISMP)",
      "ja": "インタースイッチメッセージプロトコル（ISMP）"
    },
    {
      "indent": 6,
      "text": "The protocol used for interswitch communication between SFVLAN switches.",
      "ja": "SFVLANスイッチ間インター通信に使用するプロトコル。"
    },
    {
      "indent": 3,
      "text": "Undirected messages",
      "ja": "無向メッセージ"
    },
    {
      "indent": 6,
      "text": "Messages that are (potentially) sent to all SFVLAN switches in the switch fabric -- that is, they are not directed to any particular switch. ISMP messages with a message type of 5, 7 or 8 are undirected messages.",
      "ja": "（潜在的に）スイッチファブリック内のすべてのSFVLANスイッチに送信されるメッセージは - すなわち、それらは、任意の特定のスイッチに向けられていません。 5、7または8のメッセージ・タイプのISMPメッセージは無向メッセージです。"
    },
    {
      "indent": 3,
      "text": "Switch flood path",
      "ja": "スイッチの洪水パス"
    },
    {
      "indent": 6,
      "text": "The path used to send undirected messages throughout the switch fabric. The switch flood path is formed using a spanning tree algorithm that provides a single path through the switch fabric that guarantees loop-free delivery to every other SFVLAN switch in the fabric.",
      "ja": "パスは、スイッチファブリック全体で無向メッセージを送信するために使用されます。スイッチ洪水路は、ファブリック内の他のすべてのSFVLANスイッチにループフリーの配信を保証するスイッチファブリックを介して単一の経路を提供するスパニングツリーアルゴリズムを使用して形成されています。"
    },
    {
      "indent": 3,
      "text": "Upstream Neighbor",
      "ja": "上流隣接"
    },
    {
      "indent": 6,
      "text": "That switch attached to the inport of the switch flood path -- that is, the switch from which undirected messages are received. Note that each switch receiving an undirected message has, at most, one upstream neighbor, and the originator of any undirected ISMP message has no upstream neighbors.",
      "ja": "、無向メッセージが受信されるスイッチである - そのスイッチは、スイッチ洪水路のInportに取り付けられます。注無向メッセージを受信した各スイッチが有することを、最大で、1つのアップストリーム隣接、及び任意無向ISMPメッセージの発信者には上流の近隣を有していません。"
    },
    {
      "indent": 3,
      "text": "Downstream Neighbors",
      "ja": "下流の隣人"
    },
    {
      "indent": 6,
      "text": "Those switches attached to all outports of the switch flood path except the port on which the undirected message was received. Note that for each undirected message some number of switches have no downstream neighbors.",
      "ja": "無向メッセージを受信したポート以外のスイッチ洪水路の全てのOutportに取り付けられたこれらのスイッチ。各無向メッセージのためのスイッチの一部の数は何の下流の隣人を持っていないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Virtual LAN (VLAN) identifier",
      "ja": "仮想LAN（VLAN）識別"
    },
    {
      "indent": 6,
      "text": "A VLAN is a logical grouping of ports and endstations such that all ports and endstations in the VLAN appear to be on the same physical (or extended) LAN segment even though they may be geographically separated.",
      "ja": "VLANは、ポートおよびVLAN内のすべてのポートとエンドステーションは、それらが地理的に分離することができるにもかかわらず、同一の物理的（または拡張）LANセグメント上にあるように見えるようにエンドステーションの論理グループです。"
    },
    {
      "indent": 6,
      "text": "A VLAN identifier consists of a variable-length string of octets. The first octet in the string contains the number of octets in the remainder of the string -- the actual VLAN identifier value. A VLAN identifier can be from 1 to 16 octets long.",
      "ja": "VLAN識別子はオクテットの可変長の文字列で構成されています。実際のVLAN識別子の値 - 文字列の最初のオクテットは、文字列の残りのオクテットの数を含んでいます。 VLAN識別子の長さは1〜16オクテットであることができます。"
    },
    {
      "indent": 3,
      "text": "VLAN policy",
      "ja": "VLANポリシー"
    },
    {
      "indent": 6,
      "text": "Each VLAN has an assigned policy value used to determine whether a particular call connection can be established. SFVLAN recognizes two policy values: Open and Secure.",
      "ja": "各VLANは、特定の呼接続が確立できるかどうかを決定するために使用される割り当てられたポリシー値を有します。オープンかつセキュア：SFVLANは、2つのポリシーの値を認識します。"
    },
    {
      "indent": 0,
      "text": "2. SFVLAN Overview",
      "section_title": true,
      "ja": "2. SFVLAN概要"
    },
    {
      "indent": 3,
      "text": "Cabletron's SecureFast VLAN (SFVLAN) product implements a distributed connection-oriented switching protocol that provides fast forwarding of data packets at the MAC layer.",
      "ja": "CabletronのSecureFast VLAN（SFVLAN）製品は、MAC層でのデータパケットの高速転送を提供する分散コネクション型スイッチングプロトコルを実装します。"
    },
    {
      "indent": 0,
      "text": "2.1 Features",
      "section_title": true,
      "ja": "2.1特長"
    },
    {
      "indent": 3,
      "text": "Within a connection-oriented switching network, user traffic is routed through the switch fabric based on the source and destination address (SA/DA) pair found in the arriving packet. For each SA/DA pair encountered by a switch, a \"connection\" is programmed into the switch hardware. This connection maps the SA/DA pair and the port on which the packet was received to a specific outport over which the packet is to be forwarded. Thus, once a connection has been established, all packets with a particular SA/DA pair arriving on a particular inport are automatically forwarded by the switch hardware out the specified outport.",
      "ja": "コネクション型スイッチングネットワーク内で、ユーザトラフィックは、送信元および宛先アドレス到着パケットに見出される（SA / DA）ペアに基づいて、スイッチファブリックを介してルーティングされます。スイッチが遭遇する各SA / DAペアについて、「接続」は、スイッチハードウェアにプログラムされます。この接続はSA / DAペアとパケットは、パケットが転送されるその上、特定のアウトポートに受信されたポートをマッピングします。接続が確立された後このように、特定のSA / DAペアが特定のInportに到着すると、すべてのパケットが自動的に指定されたアウトポートアウトスイッチハードウェアによって転送されます。"
    },
    {
      "indent": 3,
      "text": "A distributed switching environment requires that each switch be capable of processing all aspects of the call processing and switching functionality. Thus, each switch must synchronize its various databases with all other switches in the fabric or be capable of querying other switches for information it does not have locally.",
      "ja": "分散スイッチング環境では、各スイッチが呼処理のすべての側面を処理し、機能を切り替え可能であることを必要とします。従って、各スイッチは、ファブリック内の他のすべてのスイッチとその様々なデータベースを同期させるか、局所的に有していない情報については、他のスイッチを照会することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "SFVLAN accomplishes the above objectives by providing the following features:",
      "ja": "SFVLANは、次の機能を提供することにより、上記の目的を達成します："
    },
    {
      "indent": 3,
      "text": "- A virtual directory of the entire switch fabric.",
      "ja": " - 全体スイッチファブリックの仮想ディレクトリ。"
    },
    {
      "indent": 3,
      "text": "- Call processing for IP, IPX and MAC protocols.",
      "ja": " -  IP、IPXおよびMACプロトコルのための処理を呼び出します。"
    },
    {
      "indent": 3,
      "text": "- Automatic call connection, based on VLAN policy.",
      "ja": " - 自動呼接続、VLANポリシーに基づいて。"
    },
    {
      "indent": 3,
      "text": "- Automatic call rerouting around failed switches and links.",
      "ja": " - 周りの再ルーティングの自動呼び出しは、スイッチとのリンクが失敗しました。"
    },
    {
      "indent": 3,
      "text": "In addition, SFVLAN optimizes traffic flow across the switch fabric by providing the following features:",
      "ja": "また、SFVLANは、次の機能を提供することにより、スイッチファブリック全体のトラフィックフローを最適化します。"
    },
    {
      "indent": 3,
      "text": "- Broadcast interception and address resolution at the ingress port.",
      "ja": " - 入力ポートでのブロードキャスト傍受とアドレス解決。"
    },
    {
      "indent": 3,
      "text": "- Broadcast scoping, restricting the flooding of broadcast packets to only those ports that belong to the same VLAN as the packet source.",
      "ja": " - ブロードキャストスコーピング、パケットの送信元と同じVLANに所属するポートだけにブロードキャストパケットのフラッディングを制限します。"
    },
    {
      "indent": 3,
      "text": "- A single loop-free path (spanning tree) used for the flooding of undirected interswitch control messages. Only switches running the SFVLAN switching protocol are included in this spanning tree calculation -- that is, traditional bridges or routers configured for bridging are not included.",
      "ja": " - 単一ループのないパス（スパニングツリー）無向インター制御メッセージのフラッディングのために使用されます。のみSFVLANスイッチングプロトコルを実行しているスイッチこのスパニングツリーの計算に含まれている - すなわち、架橋のために構成さ伝統的なブリッジまたはルータが含まれていません。"
    },
    {
      "indent": 3,
      "text": "- Interception of both service and route advertisements with readvertisement sourced from the MAC address of the original advertiser.",
      "ja": " - オリジナルの広告主のMACアドレスを送信元再広告の両方のサービスとルート広告の傍受。"
    },
    {
      "indent": 0,
      "text": "2.2 VLAN Principles",
      "section_title": true,
      "ja": "2.2 VLANの原則"
    },
    {
      "indent": 3,
      "text": "Each SFVLAN switch port, along with its attached endstations, belongs to one or more virtual LANs (VLANs). A VLAN is a logical grouping of ports and endstations such that all ports and endstations in the VLAN appear to be on the same physical (or extended) LAN segment even though they may be geographically separated.",
      "ja": "各SFVLANスイッチポートは、その添付エンドステーションと一緒に、一つ以上のVLAN（仮想LAN）に属します。 VLANは、ポートおよびVLAN内のすべてのポートとエンドステーションは、それらが地理的に分離することができるにもかかわらず、同一の物理的（または拡張）LANセグメント上にあるように見えるようにエンドステーションの論理グループです。"
    },
    {
      "indent": 3,
      "text": "VLAN assignments are used to determine the validity of call connection requests and to scope the broadcast of certain flooded messages.",
      "ja": "VLAN割り当ては、特定の浸水メッセージの放送呼接続要求のと範囲の妥当性を判断するために使用されています。"
    },
    {
      "indent": 0,
      "text": "2.2.1 Default, Base and Inherited VLANs",
      "section_title": true,
      "ja": "2.2.1デフォルト、ベースと継承されたVLAN"
    },
    {
      "indent": 3,
      "text": "Each port is explicitly assigned to a default VLAN. At start-up, the default VLAN to which all ports are assigned is the base VLAN -- a permanent, non-deletable VLAN to which all ports belong at all times.",
      "ja": "各ポートは、明示的にデフォルトのVLANに割り当てられます。すべてのポートが常に属する永久、非消去可能なVLAN  - 起動時には、すべてのポートが割り当てられているデフォルトのVLANベースVLANです。"
    },
    {
      "indent": 3,
      "text": "The network administrator can change the default VLAN of a port from the base VLAN to any other unique VLAN by using a management application known here as the VLAN Manager. A port's default VLAN is persistent -- that is, it is preserved across a switch reset.",
      "ja": "ネットワーク管理者は、VLANマネージャとしてここに知られている管理アプリケーションを使用して、任意の他のユニークなVLANにベースVLANからポートのデフォルトVLANを変更することができます。ポートのデフォルトVLANは永続的である - つまり、それはスイッチがリセットしても保持されます。"
    },
    {
      "indent": 3,
      "text": "When an endstation attaches to a port for the first time, it inherits the default VLAN of the port. Using the VLAN Manager, the network administrator can reassign an endstation to another VLAN.",
      "ja": "エンドステーションが初めてポートに接続する場合は、ポートのデフォルトVLANを継承します。 VLANマネージャを使用して、ネットワーク管理者は、別のVLANにエンドステーションを再割り当てすることができます。"
    },
    {
      "indent": 6,
      "text": "Note:",
      "ja": "注意："
    },
    {
      "indent": 9,
      "text": "When all ports and all endstations belong to the base VLAN, the switch fabric behaves like an 802.1D bridging system.",
      "ja": "すべてのポートとすべてのエンドステーションがベースVLANに属している場合、スイッチ・ファブリックは、802.1Dブリッジングシステムのように振る舞います。"
    },
    {
      "indent": 0,
      "text": "2.2.2 VLAN Configuration Modes",
      "section_title": true,
      "ja": "2.2.2 VLANコンフィギュレーションモード"
    },
    {
      "indent": 3,
      "text": "For both ports and endstations, there are a variety of VLAN configuration types, or modes.",
      "ja": "ポートおよびエンドステーションの両方について、VLAN設定の種類、または様々なモードが存在します。"
    },
    {
      "indent": 0,
      "text": "2.2.2.1 Endstations",
      "section_title": true,
      "ja": "2.2.2.1エンドステーション"
    },
    {
      "indent": 3,
      "text": "For endstations, there are two VLAN configuration modes: inherited and static.",
      "ja": "継承と静的：エンドステーションの場合は、2つのVLANコンフィギュレーションモードがあります。"
    },
    {
      "indent": 3,
      "text": "- Inherited",
      "ja": "- 継承されました"
    },
    {
      "indent": 6,
      "text": "An inherited endstation becomes a member of its port's default VLAN.",
      "ja": "継承されたエンドステーションは、そのポートのデフォルトVLANのメンバーになります。"
    },
    {
      "indent": 3,
      "text": "- Static",
      "ja": " - 静的"
    },
    {
      "indent": 6,
      "text": "A static port becomes a member of the VLAN to which it has been assigned by the VLAN Manager.",
      "ja": "静的ポートは、VLANマネージャによって割り当てられているVLANのメンバーになります。"
    },
    {
      "indent": 3,
      "text": "The default configuration mode for an endstation is inherited.",
      "ja": "エンドステーションのデフォルトのコンフィギュレーションモードを継承しています。"
    },
    {
      "indent": 0,
      "text": "2.2.2.2 Ports",
      "section_title": true,
      "ja": "2.2.2.2ポート"
    },
    {
      "indent": 3,
      "text": "For ports, there are two VLAN configuration modes: normal and locked.",
      "ja": "ノーマルとロック：ポートの場合、2つのVLANコンフィギュレーションモードがあります。"
    },
    {
      "indent": 3,
      "text": "- Normal",
      "ja": " - ノーマル"
    },
    {
      "indent": 6,
      "text": "All inherited endstations on a normal port become members of the port's default VLAN. All static endstations are members of the VLAN to which they were mapped by the VLAN Manager.",
      "ja": "通常のポート上のすべての継承されたエンドステーションは、ポートのデフォルトVLANのメンバーになります。すべての静的エンドステーションは、それらがVLANマネージャによってマップされた先のVLANのメンバーです。"
    },
    {
      "indent": 6,
      "text": "If the VLAN Manager reassigns the default VLAN of a normal port, the VLAN(s) for the attached endstations may or may not change, depending on the VLAN configuration mode of each endstation. All inherited endstations will become members of the new default VLAN. All others will retain membership in their previously mapped VLANs.",
      "ja": "VLANマネージャは、通常のポートのデフォルトVLANを再割り当てする場合、添付のエンドステーションのためのVLAN（複数可）または各エンドステーションのVLANコンフィギュレーションモードに応じて、変更してもしなくてもよいです。すべての継承されたエンドステーションは、新しいデフォルトVLANのメンバーになります。他のすべては、その以前にマッピングされたVLANのメンバーシップを保持します。"
    },
    {
      "indent": 3,
      "text": "- Locked",
      "ja": " - ロック"
    },
    {
      "indent": 6,
      "text": "All endstations attached to a locked port can be members only of the port's default VLAN.",
      "ja": "ロックされたポートに接続されているすべてのエンドステーションは、専用ポートのデフォルトVLANのメンバーになることができます。"
    },
    {
      "indent": 6,
      "text": "If the VLAN Manager reconfigures a normal port to be a locked port, all endstations attached to the port become members of the port's default VLAN, regardless of any previous VLAN membership.",
      "ja": "VLANマネージャは、通常のポートがロックされたポートであることを再設定する場合は、ポートに接続されているすべてのエンドステーションは関係なく、以前のVLANメンバーシップの、ポートのデフォルトVLANのメンバーになります。"
    },
    {
      "indent": 3,
      "text": "The default configuration mode for ports is normal.",
      "ja": "ポートのデフォルトコンフィギュレーションモードは正常です。"
    },
    {
      "indent": 0,
      "text": "2.2.2.3 Order of Precedence",
      "section_title": true,
      "ja": "優先順位の順序2.2.2.3"
    },
    {
      "indent": 3,
      "text": "On a normal port, static VLAN membership prevails over inherited membership.",
      "ja": "通常のポートでは、スタティックVLANメンバーシップを継承し、会員に優先するものとします。"
    },
    {
      "indent": 3,
      "text": "On a locked port, default VLAN membership prevails over any static VLAN membership.",
      "ja": "ロックされたポートでは、デフォルトのVLANメンバーシップは、任意の静的VLANメンバーシップに優先するものとします。"
    },
    {
      "indent": 3,
      "text": "If a statically assigned endstation moves from a locked port back to a normal port, the endstation's static VLAN membership must be preserved.",
      "ja": "静的に割り当てられたエンドステーションが正常に戻ったポートにロックされたポートから移動した場合、エンドステーションの静的VLANメンバーシップが保存されなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.2.3 Ports with Multiple VLAN Membership",
      "section_title": true,
      "ja": "複数のVLANメンバーシップを持つ2.2.3ポート"
    },
    {
      "indent": 3,
      "text": "A port can belong to multiple VLANs, based on the VLAN membership of its attached endstations.",
      "ja": "ポートは接続エンドステーションのVLANメンバーシップに基づいて、複数のVLANに属することができます。"
    },
    {
      "indent": 3,
      "text": "For example, consider a port with three endstations, a default VLAN of \"blue\" and the following endstation VLAN assignments:",
      "ja": "たとえば、3つのエンドステーション、「青」のデフォルトVLANと、次のエンドステーションのVLANが割り当てられたポートを考慮してください。"
    },
    {
      "indent": 3,
      "text": "- One of the endstations is statically assigned to VLAN \"red.\" - Another endstation is statically assigned to VLAN \"green.\" - The third endstation inherits the default VLAN of \"blue.\"",
      "ja": " - エンドステーションの一つは、静的VLANに割り当てられている「赤」。 - もう一つのエンドステーションは、静的VLANに割り当てられている「緑の。」 - 第三エンドステーションはデフォルトのVLAN継承する「青」を"
    },
    {
      "indent": 3,
      "text": "In this instance, the port is explicitly a member of VLAN \"blue.\" But note that it is also implicitly a member of VLAN \"red\" and VLAN \"green.\" Any tag-based flooding (Section 4.8) directed to any one of the three VLANs (\"red,\" \"green,\" or \"blue\") will be forwarded out the port.",
      "ja": "この例では、ポートは明示的にVLANのメンバーである「青いです。」しかし、それは暗黙的にもVLAN「赤」とVLANのメンバーであることに注意してください「グリーン」。 3つのVLANのいずれか1つを対象とする任意のタグベースのフラッディング（セクション4.8）（「「赤」緑」または「青」）ポートから転送されます。"
    },
    {
      "indent": 0,
      "text": "2.3 Tag/Length/Value Method of Addressing",
      "section_title": true,
      "ja": "2.3アドレッシングのタグ/長さ/値の方法"
    },
    {
      "indent": 3,
      "text": "Within most computer networks, the concept of \"address\" is somewhat elusive because different protocols can (and do) use different addressing schemes and formats. For example, Ethernet (physical layer) addresses are six octets long, while IP (network layer) addresses are only four octets long.",
      "ja": "異なるアドレス指定方式と形式を使用して異なるプロトコルができる（と行う）ので、ほとんどのコンピュータ・ネットワーク内では、「アドレス」の概念はややとらえどころのないです。例えば、イーサネット（物理層）アドレスは6つのオクテット長、一方、IP（ネットワーク層）アドレスは、4オクテット長されています。"
    },
    {
      "indent": 3,
      "text": "To distinguish between the various protocol-specific forms of addressing, many software modules within the SFVLAN product specify addresses in a format known as Tag/Length/Value (TLV). This format uses a variable-length construct as shown below:",
      "ja": "アドレッシングの様々なプロトコルの特定の形態を区別するために、SFVLAN製品内の多くのソフトウェア・モジュールは、タグ/長さ/値（TLV）として知られている形式のアドレスを指定します。以下に示すように、このフォーマットは、可変長の構築物を使用しています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              Tag                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Value length  |                                               |\n+-+-+-+-+-+-+-+-+                                               +\n|                          Address value                        |\n:                                                               :\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Tag",
      "ja": "鬼ごっこ"
    },
    {
      "indent": 6,
      "text": "This 4-octet field specifies the type of address contained in the structure. The following address types are currently supported:",
      "ja": "この4オクテットのフィールドは、構造体に含まれるアドレスのタイプを指定します。次のアドレスの種類は、現在サポートされています。"
    },
    {
      "indent": 9,
      "text": "Tag name Value Address type",
      "ja": "タグ名の値アドレスのタイプ"
    },
    {
      "indent": 9,
      "text": "aoMacDx 1 DX ethernet dst/src/type aoIpxSap 2 Sap aoIpxRIP 3 RIP aoInstYP 4 YP (YP name and version) aoInstUDP 5 UDP (Port #) aoIpxIpx 6 Ipx aoInetIP 7 IP (Net address) aoInetRPC 8 RPC (Program #) aoInetRIP 9 INET RIP aoMacDXMcast 10 Multicast unknown type aoAtDDP 11 AppleTalk DDP aoEmpty 12 (no address type specified) aoVlan 13 VLAN identifier aoHostName 14 Host name aoNetBiosName 15 NetBIOS name aoNBT 16 NetBIOS on TCP name aoInetIPMask 17 IP Subnet Mask aoIpxSap8022 18 Sap 8022 type service aoIpxSapSnap 19 Sap Snap type service aoIpxSapEnet 20 Sap Enet type service aoDHCPXID 21 DHCP Transaction ID aoIpMcastRx 22 IP class D receiver aoIpMcastTx 23 IP class D sender aoIpxRip8022 24 Ipx Rip 8022 type service aoIpxRipSnap 25 Ipx Rip type service aoIpxRipEnet 26 Ipx Rip Enet service aoATM 27 ATM aoATMELAN 28 ATM LAN Emulation Name",
      "ja": "aoMacDx 1 DXイーサネットDST / SRC /タイプaoIpxSap 2樹液aoIpxRIP 3 RIP aoInstYP 4 YP（YP名とバージョン）aoInstUDP 5 UDP（ポート＃）aoIpxIpx 6 IPX aoInetIP 7 IP（ネットアドレス）aoInetRPC 8 RPC（プログラム＃）aoInetRIP 9 INET RIP aoMacDXMcast 10マルチキャスト未知のタイプaoAtDDP 11 AppleTalkのDDP aoEmpty 12（指定なしアドレスタイプ）は13 VLAN識別子aoHostName 14ホスト名が15のNetBIOS名がTCP名aoInetIPMask 17 IPサブネットaoIpxSap8022 18樹液8022型サービスマスクaoIpxSapSnap 19に16のNetBIOSをaoNBT aoNetBiosName aoVlan SAPスナップ型サービスaoIpxSapEnet​​ 20 SAP Enetモジュール型サービスは21 DHCPトランザクションID aoIpMcastRx 22 IPクラスDレシーバ23はIPクラスD送信者が24 IPXリップ8022型サービスaoIpxRipSnap 25 IPXリップ型サービスはaoIpxRipEnet​​ aoIpxRip8022 aoIpMcastTx aoDHCPXID 26 IPXリップEnetモジュールサービスaoATM 27 ATM aoATMELAN 28 ATM LANエミュレーション名"
    },
    {
      "indent": 3,
      "text": "Value length",
      "ja": "値の長さ"
    },
    {
      "indent": 6,
      "text": "This 1-octet field contains the length of the value of the address. The value here depends on the address type and actual value.",
      "ja": "この1オクテットのフィールドは、アドレスの値の長さが含まれています。ここでの値は、アドレスの種類と実際の値に依存します。"
    },
    {
      "indent": 3,
      "text": "Address value",
      "ja": "アドレス値"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains the value of the address. The length of this field is stored in the Value length field.",
      "ja": "この可変長フィールドには、アドレスの値が含まれています。このフィールドの長さは、値の長さフィールドに格納されています。"
    },
    {
      "indent": 0,
      "text": "2.4 Architectural Overview",
      "section_title": true,
      "ja": "2.4アーキテクチャの概要"
    },
    {
      "indent": 3,
      "text": "The SFVLAN software executes in the switch CPU and consists of the following elements as shown in Figure 1:",
      "ja": "SFVLANソフトウェアは、スイッチCPUに実行され、図1に示すように、以下の要素で構成されています。"
    },
    {
      "indent": 3,
      "text": "- The SFVLAN base services that handles traffic intercepted by the switch hardware. The base services are described in Section 3.",
      "ja": " - スイッチのハードウェアによって傍受トラフィックを処理SFVLAN基本サービス。基本サービスは、第3節で説明されています。"
    },
    {
      "indent": 3,
      "text": "+------------------------------------------------------+\n|                                              +-----+ |\n|                         +------------+       |  I  | |\n|                         |  CALL TAP  <--(8)-->  N  | |\n|                         +------------+       |  T  | |\n|                                              |  E  | |\n|      +-----------+      +------------+       |  R  | |\n|      |   PATH    |      |  TOPOLOGY  |       |  S  | |\n|      |           |      |            |       |  W  | |\n|      | Lnk state <------>  Lnk state <--(3)-->  I  | | Flood path\n|      |           |      |            |       |  T  <----(5,7,8)-->\n|      | Span tree <------>  Span tree <--(4)-->  C  | |\n|      +--^--------+      |            |       |  H  | |\n|         |               |  Discovery <--(2)-->     | |\n|         |               +------------+       |  M  | |\n|         |                                    |  E  | |\n|  +------^--+            +--------+           |  S  | |\n|  | CONNECT >---------+--> FILTER |           |  S  | |\n|  +--^------+         |  +--------+           |  A  | |  specific\n|     |                |                       |  G  | | netwrk lnks\n|     |       +--------^-+     +-------+       |  E  <----(2,3,4)-->\n|     +-------<  POLICY  |     | FLOOD >--(7)-->     | |\n|             +------^---+     +-^-----+       |  P  | |\n|                    |           |             |  R  | |\n| +-----------+    +-^-----------V-+           |  O  | |\n| | DIRECTORY <---->    RESOLVE    <------(5)-->  T  | |\n| +-----^-----+    +---^-----------+           |  O  | |\n|       |              |                       |  C  | |\n|       |    +---------^-----------+           |  O  | |\n|       +----<    Base Services    |           |  L  | |\n|            +-----^---------------+           +-----+ |\n+------------------|-----------------------------------+\n Switch CPU        |\n                   | Host control port\n             +-----O----------------+\n             |     ^ no cnx         |\n   Layer 2   |     |                |\n  ---------->O-----+--------------->O----------->\n   SA/DA pr  |          known cnx   |\n             +----------------------+\n              Switch hardware",
      "raw": true
    },
    {
      "indent": 19,
      "text": "Figure 1: SFVLAN Architectural Overview",
      "ja": "図1：SFVLANアーキテクチャの概要"
    },
    {
      "indent": 3,
      "text": "- Eight call processing service centers that provide the essential services required to process call connections. The call processing service centers are described in Section 4.",
      "ja": " - 呼接続を処理するために必要不可欠なサービスを提供八の呼処理サービスセンター。呼処理サービスセンターは、第4章で説明されています。"
    },
    {
      "indent": 3,
      "text": "- A Call Tap module that supports the monitoring of call connections. The Call Tap module is described in Section 5.",
      "ja": " - 呼接続の監視をサポートコールをタップモジュール。コールタップモジュールは、第5節に記載されています。"
    },
    {
      "indent": 3,
      "text": "- The InterSwitch Message Protocol (ISMP) that provides a consistent method of encapsulating and transmitting control messages exchanged between SFVLAN switches. (Note that ISMP is not a discrete software module. Instead, its functionality is distributed among those service centers and software modules that need to communicate with other switches in the fabric.) The Interswitch Message Protocol and the formats of the individual interswitch messages are described in Section 6.",
      "ja": " - 制御メッセージをカプセル化して送信の一貫した方法を提供するのInterSwitchメッセージプロトコル（ISMP）がSFVLANスイッチとの間で交換しました。 （ISMP離散ソフトウェアモジュールではないことに留意されたい。その代わりに、その機能は、ファブリック内の他のスイッチと通信する必要のあるサービスセンターとソフトウェアモジュールの間で分散されている。）スイッチ間のメッセージプロトコルおよび個々のインターメッセージのフォーマットが記載されています第6インチ"
    },
    {
      "indent": 0,
      "text": "3. Base Services",
      "section_title": true,
      "ja": "3.基本サービス"
    },
    {
      "indent": 3,
      "text": "The SFVLAN base services act as the interface between the switch hardware and the SFVLAN service centers running on the switch CPU. This relationship is shown in Figure 2. This figure is a replication of the bottom portion of Figure 1.",
      "ja": "SFVLAN基本サービスは、スイッチのハードウェアおよびスイッチのCPU上で実行されているSFVLANサービスセンターとの間のインターフェイスとして機能します。この関係は、この図は、図1の底部分の複製である図2に示されています。"
    },
    {
      "indent": 12,
      "text": "|    Directory       Resolve                   |\n|        ^              ^                      |\n|        |              |                      |\n|        |    +---------^-----------+          |\n|        +----<    Base Services    |          |\n|             +-----^---------------+          |\n+-------------------|--------------------------+\n Switch CPU         |\n                    | Host control port\n              +-----O----------------+\n              |     ^ no cnx         |\n    Layer 2   |     |                |\n   ---------->O-----+--------------->O----------->\n    SA/DA pr  |          known cnx   |\n              +----------------------+\n               Switch hardware",
      "raw": true
    },
    {
      "indent": 24,
      "text": "Figure 2: Base Services",
      "ja": "図2：基本サービス"
    },
    {
      "indent": 3,
      "text": "During normal operation of the switch, data packets arriving at any one of the local switch ports are examined in the switch hardware. If the packet's source and destination address (SA/DA) pair match a known connection, the hardware simply forwards the packet out the outport specified by the connection.",
      "ja": "スイッチの通常の動作中に、ローカルスイッチポートのいずれかに到着するデータパケットは、スイッチハードウェアで検討されています。パケットのソースおよび宛先アドレス（SA / DA）ペアが既知の接続に一致する場合、ハードウェアは、単に接続することによって指定されたアウトポートからパケットを転送します。"
    },
    {
      "indent": 3,
      "text": "If the SA/DA pair do not match any known connection, the hardware diverts the packet to the host control port where it is picked up by the SFVLAN base services. The base services generate a structure known as a state box that tracks the progress of the call connection request as the request moves through the call processing service centers.",
      "ja": "SA / DAペアは、任意の既知の接続と一致しない場合、ハードウェアは、それがSFVLAN基本サービスによってピックアップされているホスト制御ポートにパケットを転送します。基本サービスは、要求が呼処理サービスセンターを通って移動するように呼接続要求の進捗を追跡する状態ボックスとして知られる構造を生成します。"
    },
    {
      "indent": 3,
      "text": "After creating the call's state box, the base services check to determine if the call is a duplicate of a call already being processed. If not, a request is issued to the Directory Service Center (Section 4.1) to add the call's source address to the local Node and Alias Tables. The base services then hand the call off to the Resolve Service Center (Section 4.3) for further processing.",
      "ja": "コールの状態ボックスを作成した後、基本サービスは、コールがすでに処理されているコールの複製であるかどうかを判断するために確認してください。そうでない場合、要求はローカル・ノードと別名テーブルへのコールの送信元アドレスを追加するには、ディレクトリサービスセンター（4.1節）に発行されます。基本サービスは、さらなる処理のためにサービスセンターを解決します（4.3節）への呼び出しをハンドオフ。"
    },
    {
      "indent": 0,
      "text": "4. Call Processing",
      "section_title": true,
      "ja": "4.コール処理"
    },
    {
      "indent": 3,
      "text": "Call connection processing is handled by a set of eight service centers, each with one or more servers. The servers within a service center are called in a particular sequence. Each server records the results of its processing in the call connection request state box and passes the state box to the next server in the sequence.",
      "ja": "呼接続処理は、1つまたは複数のサーバーで8つのサービスセンター、各セットによって処理されます。サービスセンター内のサーバーは、特定の順序で呼び出されます。各サーバは、呼接続要求の状態]ボックスに、その処理の結果を記録し、サーバを順番に状態ボックスを渡します。"
    },
    {
      "indent": 3,
      "text": "In the sections that follow, servers are listed in the order in which they are called.",
      "ja": "以下のセクションでは、サーバは、それらが呼び出される順に表示されます。"
    },
    {
      "indent": 0,
      "text": "4.1 Directory Service Center",
      "section_title": true,
      "ja": "4.1ディレクトリサービスセンター"
    },
    {
      "indent": 3,
      "text": "The Directory Service Center is responsible for cataloging the MAC addresses and alias information for both local and remote endstations. The information is stored in two tables -- the Node Table and the Alias Table.",
      "ja": "ディレクトリサービスセンターでは、ローカルとリモートの両方のエンドステーションのMACアドレスとエイリアス情報をカタログする責任があります。ノードテーブルとエイリアステーブル - 情報は、2つのテーブルに格納されています。"
    },
    {
      "indent": 3,
      "text": "- The Node Table contains the MAC addresses of endstations attached to the local switch. It also contains a cache of remote endstations detected by the Resolve Service Center (Section 4.3). Every entry in the Node Table has one or more corresponding entries in the Alias Table.",
      "ja": " - ノードテーブルは、ローカルスイッチに接続されたエンドステーションのMACアドレスが含まれています。また、解決サービスセンター（4.3節）によって検出されたリモートエンドステーションのキャッシュが含まれています。ノードテーブル内のすべてのエントリは、別名テーブルに1つまたは複数の対応するエントリがあります。"
    },
    {
      "indent": 3,
      "text": "- The Alias Table contains protocol alias information for each endstation. An endstation alias can be a network address (such as an IP or IPX address), a VLAN identifier, or any other protocol identifier. Since every endstation is a member of at least one VLAN (the default VLAN for the port), there is always at least one entry in the Alias Table for each entry in the Node Table.",
      "ja": " - エイリアステーブルには、各エンドステーションのプロトコルエイリアス情報を含みます。エンドステーションエイリアスは、VLAN識別子、または他の任意のプロトコル識別子（例えば、IPまたはIPXアドレスなど）のネットワークアドレスとすることができます。すべてのエンドステーションは、少なくとも1つのVLAN（ポートのデフォルトVLAN）のメンバーであるので、ノードテーブルの各エントリの別名テーブル内の少なくとも1つのエントリが常に存在します。"
    },
    {
      "indent": 6,
      "text": "Note:",
      "ja": "注意："
    },
    {
      "indent": 9,
      "text": "The Node and Alias Tables must remain synchronized. That is, when an endstation's final alias is removed from the Alias Table, the endstation entry is removed from the Node Table.",
      "ja": "ノードとエイリアステーブルが同期されたままでなければなりません。エンドステーションの最後のエイリアスがエイリアステーブルから削除された場合には、エンドステーションエントリは、ノードテーブルから削除されています。"
    },
    {
      "indent": 3,
      "text": "Note that the total collection of all Node Tables and Alias Tables across all switches is known as the \"virtual\" directory of the switch fabric. The virtual directory contains address mappings of all known endstations in the fabric.",
      "ja": "すべてのスイッチ上のすべてのノードテーブルとエイリアステーブルの総回収は、スイッチファブリックの「仮想」ディレクトリとして知られていることに留意されたいです。仮想ディレクトリは、ファブリック内のすべての既知のエンドステーションのアドレスのマッピングが含まれています。"
    },
    {
      "indent": 0,
      "text": "4.1.1 Local Add Server",
      "section_title": true,
      "ja": "4.1.1ローカルサーバの追加"
    },
    {
      "indent": 3,
      "text": "The Directory Local Add server adds entries to the local Node or Alias Tables. It is called by the base services (Section 3) to add a local endstation and by the Interswitch Resolve (Section 4.3.4) server to add an endstation discovered on a remote switch.",
      "ja": "ディレクトリローカルサーバの追加ローカル・ノードまたは別名テーブルにエントリを追加します。リモートスイッチ上で発見されたエンドステーションを追加するために基本サービス（第3節）ローカルエンドステーションを追加することにより、およびスイッチ間の解決（4.3.4項）、サーバーによって呼び出されます。"
    },
    {
      "indent": 0,
      "text": "4.1.2 Inverse Resolve Server",
      "section_title": true,
      "ja": "4.1.2逆解決サーバー"
    },
    {
      "indent": 3,
      "text": "The Directory Inverse Resolve server is invoked when a new endstation has been discovered on the local switch (that is, when the Local Add server was successful in adding the endstation). The server provides two functions:",
      "ja": "新しいエンドステーションは、ローカルスイッチ（ローカルの追加サーバーがエンドステーションの追加に成功したときには、ある）に発見された際にディレクトリ逆の解決サーバが起動されます。サーバーは、2つの機能を提供します。"
    },
    {
      "indent": 3,
      "text": "- It populates the Node and Alias Tables with local entries during switch initialization.",
      "ja": " - それは、スイッチの初期化時に地元のエントリを持つノードと別名テーブルに移入されます。"
    },
    {
      "indent": 3,
      "text": "- It processes a new endstation discovered after the fabric topology has converged to a stable state.",
      "ja": " - それは、ファブリックトポロジが安定状態に収束した後に発見された新しいエンドステーションを処理します。"
    },
    {
      "indent": 3,
      "text": "In both instances, the processing is identical.",
      "ja": "両方の場合において、処理は同一です。"
    },
    {
      "indent": 3,
      "text": "When a new endstation is detected on one of the switch's local ports, the Inverse Resolve server sends an Interswitch New User request message (Section 6.5) over the switch flood path to all other switches in the fabric. The purpose of the Interswitch New User request is two-fold:",
      "ja": "新しいエンドステーションがスイッチのローカルポートの1つで検出されると、逆解決サーバは、ファブリック内の他のすべてのスイッチにスイッチ洪水のパスを介してスイッチ間の新規ユーザの要求メッセージ（6.5節）を送信します。スイッチ間の新しいユーザー要求の目的は二つあります："
    },
    {
      "indent": 3,
      "text": "- It informs the other switches of the new endstation address. Any entries for that endstation in the local databases of other switches should be dealt with appropriately.",
      "ja": " - これは、新しいエンドステーションアドレスの他のスイッチに通知します。他のスイッチのローカルデータベースでのそのエンドステーションのための任意のエントリは、適切に対処されなければなりません。"
    },
    {
      "indent": 3,
      "text": "- It requests information about any static VLAN(s) to which the endstation has been assigned.",
      "ja": " - それは、エンドステーションが割り当てられている任意のスタティックVLAN（複数可）に関する情報を要求します。"
    },
    {
      "indent": 3,
      "text": "When a switch receives an Interswitch New User request message from one of its upstream neighbors, it first forwards the message to all its downstream neighbors. No actual processing or VLAN resolution is attempted until the message reaches the end of the switch flood path and begins its trip back along the return path. This ensures that all switches in the fabric receive notification of the new user and have synchronized their databases.",
      "ja": "スイッチは、その上流の隣人の1からスイッチ間の新規ユーザの要求メッセージを受信すると、それは最初にすべてのその下流のネイバーにメッセージを転送します。メッセージは、スイッチ洪水パスの終わりに達するとバックのリターンパスに沿って旅を開始するまでは、実際の処理またはVLAN解像度が試行されません。これは、ファブリック内のすべてのスイッチは、新規ユーザの通知を受け取り、そのデータベースを同期していることを保証します。"
    },
    {
      "indent": 3,
      "text": "If a switch receives an Interswitch New User request message but has no downstream neighbors, it does the following:",
      "ja": "スイッチは、スイッチ間の新規ユーザの要求メッセージを受信するが、何の下流の隣人を持っていない場合は、次のことを行います。"
    },
    {
      "indent": 3,
      "text": "- If the endstation was previously connected to one of the switch's local ports, the switch formulates an Interswitch New User Response message by loading the VLAN identifier(s) of the static VLAN(s) to which the endstation was assigned, along with its own MAC address. (VLAN identifiers are stored in Tag/Length/Value (TLV) format. See Section 2.3.) The switch then sets the message status field to NewUserAck, and returns the message to its upstream (requesting) neighbor.",
      "ja": " - エンドステーションが以前スイッチのローカルポートの一つに接続された場合、スイッチは、エンドステーションは、それ自身と一緒に、割り当てられた静的VLAN（複数可）のVLAN識別子（複数可）をロードすることによって、スイッチ間の新しいユーザ応答メッセージを定式化Macアドレス。 （VLAN識別子は、タグ/長さ/値（TLV）形式で格納されている。第2.3節を参照。）スイッチは、次にNewUserAckにメッセージのステータスフィールドを設定し、その上流（要求）隣人にメッセージを返します。"
    },
    {
      "indent": 6,
      "text": "Otherwise, the switch sets the status field to NewUserUnknown and returns the message to its upstream neighbor.",
      "ja": "そうでない場合、スイッチはNewUserUnknownにステータスフィールドを設定し、その上流隣にメッセージを返します。"
    },
    {
      "indent": 3,
      "text": "- The switch then deletes the endstation from its local database, as well as any entries associated with the endstation in its connection table.",
      "ja": " - スイッチは、そのローカルデータベースからエンドステーション、ならびにその接続テーブルにエンドステーションに関連付けられたすべてのエントリを削除します。"
    },
    {
      "indent": 3,
      "text": "When a switch forwards an Interswitch New User request message to its downstream neighbors, it keeps track of the number of requests it has sent out and does not respond back to its upstream neighbor until all requests have been responded to.",
      "ja": "スイッチは、その下流の隣人にスイッチ間の新しいユーザー要求メッセージを転送するとき、それが送出したとすべての要求に応えがされるまで、その上流の隣人に戻って応答しない要求の数を追跡します。"
    },
    {
      "indent": 3,
      "text": "- As each response is received, the switch checks the status field of the message. If the status is NewUserAck, the switch retains the information in that response. When all requests have been responded to, the switch returns the NewUserAck response to its upstream neighbor.",
      "ja": " - 各応答が受信されると、スイッチは、メッセージの状態フィールドをチェックします。ステータスがNewUserAckである場合、スイッチは、その応答内の情報を保持します。すべての要求がに応えてきたときに、スイッチは、その上流の隣人にNewUserAck応答を返します。"
    },
    {
      "indent": 3,
      "text": "- If all the Interswitch New User Request messages have been responded to with a status of NewUserUnknown, the switch checks to see if the endstation was previously connected to one of its local ports. If so, the switch formulates an Interswitch New User Response message by loading the VLAN identifier(s) of the static VLAN(s) to which the endstation was assigned, along with its own MAC address. The switch then sets the message status field to NewUserAck, and returns the message to its upstream (requesting) neighbor.",
      "ja": " - すべてのスイッチ間の新しいユーザ要求メッセージがNewUserUnknownの状態で応答されている場合は、エンドステーションが以前にそのローカルポートの1つに接続された場合、スイッチかどうかを確認します。その場合、スイッチは、自身のMACアドレスと共に、エンドステーションが割り当てられたために、静的なVLAN（複数可）のVLAN識別子（複数可）をロードすることによって、スイッチ間の新しいユーザ応答メッセージを定式化します。スイッチはNewUserAckにメッセージのステータスフィールドを設定し、その上流（要求）ネイバーにメッセージを返します。"
    },
    {
      "indent": 6,
      "text": "Otherwise, the switch sets the status field to NewUserUnknown and returns the message to its upstream neighbor.",
      "ja": "そうでない場合、スイッチはNewUserUnknownにステータスフィールドを設定し、その上流隣にメッセージを返します。"
    },
    {
      "indent": 3,
      "text": "- The switch then deletes the endstation from its local database, as well as any entries associated with the endstation in its connection table.",
      "ja": " - スイッチは、そのローカルデータベースからエンドステーション、ならびにその接続テーブルにエンドステーションに関連付けられたすべてのエントリを削除します。"
    },
    {
      "indent": 3,
      "text": "When the originating switch has received responses to all the Interswitch New User Request messages it has sent, it does the following:",
      "ja": "元のスイッチは、それが送信されたすべてのスイッチ間の新しいユーザーの要求メッセージに対する応答を受信した場合には、次のことを行います。"
    },
    {
      "indent": 3,
      "text": "- If it has received a response message with a status of NewUserAck, it loads the new VLAN information into its local database.",
      "ja": " - それはNewUserAckの状態に応答メッセージを受信した場合、それはそのローカルデータベースに新しいVLAN情報をロードします。"
    },
    {
      "indent": 3,
      "text": "- If all responses have been received with a status of NewUserUnknown, the originating switch assumes that the endstation was not previously connected anywhere in the network and assigns it to a VLAN according to the VLAN membership rules and order of precedence.",
      "ja": " - すべての応答がNewUserUnknownの状態で受信された場合は、元のスイッチは、エンドステーションが以前にネットワークのどこに接続されていなかったことを想定し、VLANメンバーシップのルールと優先順位に従ってVLANに割り当てます。"
    },
    {
      "indent": 3,
      "text": "If any Interswitch New User Request message has not been responded to within a certain predetermined time (currently 5 seconds), the originating switch recalculates the switch flood path and resends the Interswitch New User Request message.",
      "ja": "任意のスイッチ間の新しいユーザ要求メッセージは、ある一定の時間（現在は5秒）以内に反応していない場合は、元のスイッチは、スイッチの洪水のパスを再計算し、スイッチ間の新規ユーザの要求メッセージを再送信します。"
    },
    {
      "indent": 0,
      "text": "4.1.3 Local Delete Server",
      "section_title": true,
      "ja": "4.1.3ローカルサーバーの削除"
    },
    {
      "indent": 3,
      "text": "The Directory Local Delete server removes entries (both local and remote) from the local Node and Alias Tables. It is invoked when an endstation, previously known to be attached to one switch, has been moved and discovered on another switch.",
      "ja": "ディレクトリローカルサーバがローカル・ノードと別名テーブルから（ローカルとリモートの両方）のエントリを削除し削除します。以前に一つのスイッチに接続することが知られているエンドステーションは、別のスイッチに移動し、発見されたときに呼び出されます。"
    },
    {
      "indent": 3,
      "text": "Note also that remote entries are cached and are purged from the tables on a first-in/first-out basis as space is needed in the cache.",
      "ja": "リモートエントリがキャッシュされ、スペースがキャッシュ内で必要とされているよう先入れ/先出し基づいてテーブルから削除されていることにも注意してください。"
    },
    {
      "indent": 0,
      "text": "4.2 Topology Service Center",
      "section_title": true,
      "ja": "4.2トポロジサービスセンター"
    },
    {
      "indent": 3,
      "text": "The Topology Service Center is responsible for maintaining three databases relating to the topology of the switch fabric:",
      "ja": "トポロジサービスセンターは、スイッチファブリックのトポロジに関連する3つのデータベースを維持する責任があります。"
    },
    {
      "indent": 3,
      "text": "- The topology table of SFVLAN switches that are physical neighbors to the local switch.",
      "ja": " - ローカルスイッチに物理的に隣接しているSFVLANスイッチのトポロジテーブル。"
    },
    {
      "indent": 3,
      "text": "- The spanning tree that defines the loop-free switch flood path used for transmitting undirected interswitch messages.",
      "ja": " - 無向インターメッセージを送信するために使用されるループフリースイッチ洪水路を画定するスパニングツリー。"
    },
    {
      "indent": 3,
      "text": "- The directed graph that is used to calculate the best path(s) for call connections.",
      "ja": " - 呼接続のための最善の経路（単数または複数）を計算するために使用される有向グラフ。"
    },
    {
      "indent": 0,
      "text": "4.2.1 Neighbor Discovery Server",
      "section_title": true,
      "ja": "4.2.1近隣探索サーバ"
    },
    {
      "indent": 3,
      "text": "The Topology Neighbor Discovery server uses Interswitch Keepalive messages to detect the switch's neighbors and establish the topology of the switching fabric. Interswitch Keepalive messages are exchanged in accordance with Cabletron's VlanHello protocol, described in detail in [IDhello].",
      "ja": "トポロジ近隣探索サーバは、スイッチのネイバーを検出し、スイッチングファブリックのトポロジを確立するために、スイッチ間キープアライブメッセージを使用しています。インターキープアライブメッセージは、[IDhello]に詳細に記載CabletronのVlanHelloプロトコルに従って交換されます。"
    },
    {
      "indent": 0,
      "text": "4.2.2 Spanning Tree Server",
      "section_title": true,
      "ja": "4.2.2スパニングツリーのサーバー"
    },
    {
      "indent": 3,
      "text": "The Topology Spanning Tree server is invoked by the Topology Neighbor Discovery server when a neighboring SFVLAN switch is either discovered or lost -- that is, when the operational status of a network link changes.",
      "ja": "つまり、時にネットワークリンクの変更の動作状態 - トポロジスパニングツリーサーバは、隣接SFVLANスイッチを発見したり失われているいずれかのトポロジ近隣探索サーバによって呼び出されます。"
    },
    {
      "indent": 3,
      "text": "The Spanning Tree server exchanges interswitch messages with neighboring SFVLAN switches to calculate the switch flood path over which undirected interswitch messages are sent. There are two parts to this process:",
      "ja": "隣接SFVLANスイッチとスパニングツリーサーバ交換インターメッセージは、インターメッセージが送信される無向その上スイッチフラッド経路を算出します。このプロセスには2つの部分があります。"
    },
    {
      "indent": 3,
      "text": "- Creating and maintaining the spanning tree - Remote blocking",
      "ja": " - リモートブロック - スパニングツリーの作成と維持"
    },
    {
      "indent": 0,
      "text": "4.2.2.1 Creating and Maintaining the Spanning Tree",
      "section_title": true,
      "ja": "4.2.2.1スパニングツリーの作成と保守"
    },
    {
      "indent": 3,
      "text": "In a network with redundant network links, a packet traveling between switches can potentially be caught in an infinite loop -- an intolerable situation in a networking environment. However, it is possible to reduce a network topology to a single configuration (known as a spanning tree) such that there is, at most, one path between any two switches.",
      "ja": "ネットワーク環境での耐え難い状況 - 冗長ネットワークリンクを含むネットワークでは、スイッチ間を移動するパケットは、潜在的に無限ループでキャッチすることができます。しかし、任意の2つのスイッチ間の1つの経路は、最大で、存在するように、（スパニングツリーとして知られている）単一の構成にネットワークトポロジを低減することができます。"
    },
    {
      "indent": 3,
      "text": "Within the SFVLAN product, the spanning tree is created and maintained using the Spanning Tree Algorithm defined by the IEEE 802.1d standard.",
      "ja": "SFVLAN製品の中では、スパニングツリーが作成され、IEEE 802.1D準拠の標準で定義されたスパニングツリーアルゴリズムを使用して維持されています。"
    },
    {
      "indent": 6,
      "text": "Note:",
      "ja": "注意："
    },
    {
      "indent": 9,
      "text": "A detailed discussion of this algorithm is beyond the scope of this document. See [IEEE] for more information.",
      "ja": "このアルゴリズムの詳細については、このドキュメントの範囲を超えています。詳細については、[IEEE]を参照してください。"
    },
    {
      "indent": 3,
      "text": "To implement the Spanning Tree Algorithm, SFVLAN switches exchange Interswitch BPDU messages (Section 6.2) containing encapsulated IEEE-compliant 802.2 Bridge Protocol Data Units (BPDUs). There are two types of BPDUs:",
      "ja": "スパニングツリーアルゴリズムを実装するには、SFVLANは、カプセル化されたIEEE 802.2準拠のブリッジプロトコルデータユニット（BPDUを）を含む交流スイッチ間BPDUメッセージ（6.2節）を切り替えます。 BPDUに次の2種類があります。"
    },
    {
      "indent": 3,
      "text": "- Configuration (CFG) BPDUs are exchanged during the switch discovery process, following the receipt of an Interswitch Keepalive message. They are used to create the initial the spanning tree.",
      "ja": " - 構成（CFG）BPDUはスイッチ間キープアライブメッセージの受信後に、スイッチ発見プロセス中に交換されます。彼らは、最初のスパニングツリーを作成するために使用されています。"
    },
    {
      "indent": 3,
      "text": "- Topology Change Notification (TCN) BPDUs are exchanged when changes in the network topology are detected. They are used to redefine the spanning tree to reflect the current topology.",
      "ja": " - トポロジ変更通知（TCN）BPDUがネットワークトポロジの変更が検出されたときに交換されます。これらは、現在のトポロジを反映するために、スパニングツリーを再定義するために使用されています。"
    },
    {
      "indent": 3,
      "text": "See [IEEE] for detailed descriptions of these BPDUs.",
      "ja": "これらのBPDUの詳細な説明については、[IEEE]を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.2.2.2 Remote Blocking",
      "section_title": true,
      "ja": "4.2.2.2リモートブロッキング"
    },
    {
      "indent": 3,
      "text": "After the spanning tree has been computed, each network port on an SFVLAN switch will be in one of two states:",
      "ja": "スパニングツリーは、計算された後、SFVLANスイッチ上の各ネットワーク・ポートは、2つの状態のいずれかであろう。"
    },
    {
      "indent": 3,
      "text": "- Forwarding. A port in the Forwarding state will be used to transmit all ISMP messages.",
      "ja": " - 転送。フォワーディングステートのポートは、すべてのISMPメッセージを送信するために使用されます。"
    },
    {
      "indent": 3,
      "text": "- Blocking. A port in the Blocking state will not be used to forward undirected ISMP messages. Blocking the rebroadcast of these messages on selected ports prevents message duplication arising from multiple paths that exist in the network topology. Note that all other types of ISMP message will be transmitted.",
      "ja": " - ブロッキング。ブロッキングステートのポートは、無向ISMPメッセージを転送するために使用されることはありません。選択されたポートでこれらのメッセージの再放送を遮断することは、ネットワークトポロジに存在する複数の経路から生じるメッセージの重複を防止します。 ISMPメッセージの他のすべてのタイプが送信されることに注意してください。"
    },
    {
      "indent": 6,
      "text": "Note:",
      "ja": "注意："
    },
    {
      "indent": 9,
      "text": "The IEEE 802.1d standard specifies other port states used during the initial creation of the spanning tree. These states are not relevant to the discussion here.",
      "ja": "IEEE 802.1D規格では、スパニングツリーの初期作成時に使用される他のポートの状態を指定します。これらの状態は、ここでの議論には関係ありません。"
    },
    {
      "indent": 3,
      "text": "Note that although a port in the Blocking state will not forward undirected ISMP messages, it may still receive them. Any such message received will ultimately be discarded, but at the cost of CPU time necessary to process the packet.",
      "ja": "ブロッキングステートのポートは無向ISMPメッセージを転送しませんが、それはまだそれらを受け取ることがあります。受信された任意のこのようなメッセージは、最終的に廃棄されるが、必要に応じてCPU時間を犠牲にしてパケットを処理します。"
    },
    {
      "indent": 3,
      "text": "To prevent the transmission of undirected messages to a port, the port's owner switch can set remote blocking on the link by sending an Interswitch Remote Blocking message (Section 6.3) out over the port. This notifies the switch on the other end of the link that undirected messages should not be sent over the link, regardless of the state of the sending port.",
      "ja": "ポートに無向メッセージの送信を防止するためには、ポートの所有者スイッチはポートを介して外にスイッチ間のリモートブロッキングメッセージ（6.3節）を送信することによって、リンクをブロックするリモート設定することができます。これは関係なく、送信ポートの状態の、無向メッセージがリンクを介して送信されるべきではないと、リンクの反対側のスイッチに通知します。"
    },
    {
      "indent": 3,
      "text": "Each SFVLAN switch sends an Interswitch Remote Blocking message out over all its blocked network ports every 5 seconds. A flag within the message indicates whether remote blocking should be turned on or off over the link.",
      "ja": "各SFVLANスイッチは、そのすべてのブロックされたネットワークポートごとに5秒以上スイッチ間のリモートブロッキングメッセージを送信します。メッセージ内のフラグは、リモートブロッキングがリンクを介してオンまたはオフされるべきかどうかを示します。"
    },
    {
      "indent": 0,
      "text": "4.2.3 Link State Server",
      "section_title": true,
      "ja": "4.2.3リンク状態サーバー"
    },
    {
      "indent": 3,
      "text": "The Topology Link State server is invoked by any process that detects a change in the state of the network links of the local switch. These changes include (but are not limited to) changes in operational or administrative status of the link, path \"cost\" or bandwidth.",
      "ja": "トポロジリンクステートサーバーは、ローカルスイッチのネットワークリンクの状態の変化を検知する任意のプロセスによって呼び出されます。これらの変更は、（限定されるものではないが）、リンク、パス「コスト」や帯域幅の運用や管理ステータスの変更を。"
    },
    {
      "indent": 3,
      "text": "The Link State server runs Cabletron's Virtual LAN Link State (VLS) protocol which exchanges interswitch messages with neighboring SFVLAN switches to calculate the set of best paths between the local switch and all other switches in the fabric. (The VLS protocol is described in detail in [IDvlsp].)",
      "ja": "リンクステートサーバーは、ローカルスイッチおよびファブリック内の他のすべてのスイッチ間で最良のパスのセットを計算するために、隣接SFVLANスイッチとスイッチ間でメッセージを交換Cabletronの仮想LANリンクステート（VLS）プロトコルを実行します。 （VLSプロトコルは[IDvlsp]に詳細に記載されています。）"
    },
    {
      "indent": 3,
      "text": "The Link State server also notifies the Connect Service Center (Section 4.5) of any remote links that have failed, thereby necessitating potential tear-down of current connections.",
      "ja": "リンクステートサーバも、それによって現在の接続の潜在的な涙ダウンを必要と、失敗している任意のリモートリンクの接続サービスセンター（4.5節）を通知します。"
    },
    {
      "indent": 0,
      "text": "4.3 Resolve Service Center",
      "section_title": true,
      "ja": "4.3サービスセンターを解決"
    },
    {
      "indent": 3,
      "text": "The Resolve Service Center is responsible for resolving the destination address of broadcast data packets (such as an IP ARP packet) to a unicast MAC address to be used in mapping the call connection. To do this, the Resolve Service Center attempts to resolve such broadcast packets directly at the access port of the ingress switch.",
      "ja": "解決サービスセンターの呼接続をマッピングに使用するユニキャストMACアドレスに（たとえば、IP ARPパケットなど）の放送データパケットの宛先アドレスを解決する責任があります。これを行うには、解決サービスセンターは入力スイッチのアクセスポートに直接、このようなブロードキャストパケットを解決しようとします。"
    },
    {
      "indent": 3,
      "text": "Address resolution is accomplished as follows:",
      "ja": "次のようにアドレス解決が実現されます。"
    },
    {
      "indent": 3,
      "text": "1) First, an attempt is made to resolve the address from the switch's local databases by calling the following servers:",
      "ja": "1）まず、試みは次のサーバを呼び出すことにより、スイッチのローカルデータベースからのアドレスを解決するためになされています。"
    },
    {
      "indent": 6,
      "text": "- The Table server attempts to resolve the address from the Resolve Table (Section 4.3.1).",
      "ja": " - 表サーバーが解決表（セクション4.3.1）からアドレスを解決しようとします。"
    },
    {
      "indent": 6,
      "text": "- Next, the Local server attempts to resolve the address from the Node and Alias Tables (Section 4.3.2).",
      "ja": " - 次に、ローカルサーバは、ノードとエイリアステーブル（4.3.2）からのアドレスを解決しようとします。"
    },
    {
      "indent": 6,
      "text": "- If the address is not found in these tables but is an IP address, the Resolve Subnet server (Section 4.3.3) is also called.",
      "ja": " - アドレスは、これらの表に見つかりましたが、IPアドレスであるされていない場合は、解決サブネットサーバ（4.3.3）も呼ばれています。"
    },
    {
      "indent": 3,
      "text": "2) If the address cannot be resolved locally, the Interswitch Resolve server (Section 4.3.4) is called to access the \"virtual directory\" by sending an Interswitch Resolve request message out over the switch flood path.",
      "ja": "アドレスがローカルで解決できない場合は2）、スイッチ間の解決サーバー（4.3.4項）は、スイッチの洪水のパスを介してスイッチ間の解決要求メッセージを送出することによって、「仮想ディレクトリ」にアクセスするために呼び出されます。"
    },
    {
      "indent": 3,
      "text": "3) If the address cannot be resolved either locally or via an Interswitch Resolve message -- that is, the destination endstation is unknown to any switch, perhaps because it has never transmitted a packet to its switch -- the following steps are taken:",
      "ja": "3）アドレスは、ローカルまたはスイッチ間の解決メッセージを介して解決できない場合 - つまり、先のエンドステーションは、そのスイッチにパケットを送信したことがないかもしれないので、任意のスイッチが認識していない - 以下のステップがとられています。"
    },
    {
      "indent": 6,
      "text": "- The Unresolvable server (Section 4.3.5) is called to record the unresolved packet.",
      "ja": " - 解決できないサーバー（4.3.5）は、未解決のパケットを記録するために呼び出されます。"
    },
    {
      "indent": 6,
      "text": "- The Block server (Section 4.3.6) is called to determine whether the address should be added to the Block Table.",
      "ja": " - ブロック・サーバ（セクション4.3.6）は、アドレスブロックテーブルに追加されるべきかどうかを決定するために呼び出されます。"
    },
    {
      "indent": 6,
      "text": "- The Flood Service Center (Section 4.8) is called to broadcast the packet to other SFVLAN switches using a tag-based flooding mechanism.",
      "ja": " - 洪水サービスセンター（4.8節）は、他のSFVLANにパケットをブロードキャストするために呼び出されるタグベースのフラッディングメカニズムを使用して切り替えます。"
    },
    {
      "indent": 0,
      "text": "4.3.1 Table Server",
      "section_title": true,
      "ja": "4.3.1テーブルサーバ"
    },
    {
      "indent": 3,
      "text": "The Resolve Table server maintains the Resolve Table which contains a collection of addresses that might not be resolvable in the normal fashion. This table typically contains such things as the addresses of \"quiet\" devices that do not send data packets or special mappings of IP addresses behind a router. Entries can be added to or deleted from the Resolve Table via an external management application.",
      "ja": "解決表サーバーは、通常の方法で解決できない場合がありますアドレスのコレクションが含まれている解決表を維持します。この表は、典型的には、データパケットまたはルータの背後にあるIPアドレスの特別なマッピングを送信しない「静かな」デバイスのアドレスのようなものが含まれています。エントリが追加または外部の管理アプリケーションを介して解決テーブルから削除することができます。"
    },
    {
      "indent": 0,
      "text": "4.3.2 Local Server",
      "section_title": true,
      "ja": "4.3.2ローカルサーバー"
    },
    {
      "indent": 3,
      "text": "The Resolve Local server checks the Node and Alias Tables maintained by the Directory Service Center (Section 4.1) to determine if it can resolve the address.",
      "ja": "解決ローカルサーバーは、ノードとそれがアドレスを解決できるかどうかを判断するために、ディレクトリサービスセンター（4.1節）によって維持別名テーブルをチェックします。"
    },
    {
      "indent": 0,
      "text": "4.3.3 Subnet Server",
      "section_title": true,
      "ja": "4.3.3サブネットサーバー"
    },
    {
      "indent": 3,
      "text": "If the address to be resolved is an IP address but cannot be resolved via the standard processing described above, the Resolve Subnet server applies the subnet mask to the IP address and then does a lookup in the Resolve Table.",
      "ja": "解決すべきアドレスはIPアドレスであるが、上記の標準的な処理を経て解決できない場合は、解決サブネットサーバは、IPアドレスにサブネットマスクを適用して、解決テーブル内のルックアップを行います。"
    },
    {
      "indent": 0,
      "text": "4.3.4 Interswitch Resolve Server",
      "section_title": true,
      "ja": "4.3.4スイッチ間の解決サーバー"
    },
    {
      "indent": 3,
      "text": "If the address cannot be resolved locally, the Interswitch Resolve server accesses the \"virtual directory\" by sending an Interswitch Resolve request message (Section 6.4) out over the switch flood path. The Interswitch Resolve request message contains the destination address as it was received within the packet, along with a list of requested addressing information.",
      "ja": "アドレスがローカルで解決できない場合は、スイッチ間の解決サーバは、スイッチの洪水のパスを介して外にスイッチ間の解決要求メッセージ（6.4節）を送信することにより、「仮想ディレクトリ」にアクセス。それは要求されたアドレス情報のリストとともに、パケット内に受信されたようにスイッチ間解決要求メッセージは、宛先アドレスを含みます。"
    },
    {
      "indent": 3,
      "text": "When a switch receives an Interswitch Resolve request message from one of its upstream neighbors, it checks to see if the destination endstation is connected to one of its local access ports. If so, it formulates an Interswitch Resolve response message by filling in the requested address information, along with its own MAC address. It then sets the message status field to ResolveAck, and returns the message to its upstream (requesting) neighbor.",
      "ja": "スイッチは、その上流の近隣のいずれかからスイッチ間解決要求メッセージを受信すると、宛先エンドステーションは、そのローカルアクセスポートの一つに接続されているかどうかをチェック。もしそうなら、それはそれ自身のMACアドレスと共に、要求されたアドレス情報に充填することによりスイッチ間の解決応答メッセージを作成します。その後ResolveAckにメッセージのステータスフィールドを設定し、その上流（要求）ネイバーにメッセージを返します。"
    },
    {
      "indent": 3,
      "text": "If the receiving switch cannot resolve the address, it forwards the Interswitch Resolve request message to its downstream neighbors. If the switch has no downstream neighbors, it sets the message status field to Unknown, and returns the message to its upstream (requesting) neighbor.",
      "ja": "受信スイッチがアドレスを解決できない場合は、その下流の隣人へのスイッチ間解決要求メッセージを転送します。スイッチは何の下流の隣人を持っていない場合は、それが不明にメッセージのステータスフィールドを設定し、その上流（要求）隣人へのメッセージを返します。"
    },
    {
      "indent": 3,
      "text": "When a switch forwards an Interswitch Resolve request message to its downstream neighbors, it keeps track of the number of requests it has sent out and received back. It will only respond back to its upstream (requesting) neighbor when one of the following conditions occurs:",
      "ja": "スイッチは、その下流の隣人にスイッチ間の解決要求メッセージを転送するとき、それが出て送信され、戻って受信した要求の数を追跡します。次のいずれかの条件が発生した場合にのみ、その上流（要求）ネイバーに戻って応答します。"
    },
    {
      "indent": 3,
      "text": "- It receives any response with a status of ResolveAck",
      "ja": " - それはResolveAckの状態で任意の応答を受け取ります"
    },
    {
      "indent": 3,
      "text": "- All downstream neighbors have responded with a status of Unknown",
      "ja": " - すべての下流の隣人は不明の状態に対応してきました"
    },
    {
      "indent": 3,
      "text": "Any Interswitch Resolve request message that is not responded to within a certain predetermined time (currently 5 seconds) is assumed to have a response status of Unknown.",
      "ja": "ある所定の時間（現在は5秒）内に応答しなかっされているすべてのスイッチ間の解決要求メッセージが不明の応答ステータスを持っていると想定されます。"
    },
    {
      "indent": 3,
      "text": "When the Interswitch Resolve server receives a successful Interswitch Resolve response message, it records the resolved address information in the remote cache of its local directory for use in resolving later packets for the same endstation. Note that this process results in each switch building its own unique copy of the virtual directory containing only the endstation addresses in which it is interested.",
      "ja": "スイッチ間の解決サーバーが成功したスイッチ間の解決応答メッセージを受信すると、同じエンドステーションのために、後でパケットの解決に使用するために、そのローカルディレクトリのリモートキャッシュで解決されたアドレス情報を記録します。それぞれにこのプロセスの結果は、それが興味を持っている唯一のエンドステーションアドレスを含む仮想ディレクトリの独自のコピーを作成するスイッチがあります。"
    },
    {
      "indent": 0,
      "text": "4.3.5 Unresolvable Server",
      "section_title": true,
      "ja": "4.3.5解決できないサーバー"
    },
    {
      "indent": 3,
      "text": "The Unresolvable server is called when a packet destination address cannot be resolved. The server records the packet in a table that can then be examined to determine which endstations are generating unresolvable traffic.",
      "ja": "パケットの宛先アドレスが解決できない場合解決できないサーバーが呼び出されます。サーバは、次に、エンドステーションは解決できないトラフィックを生成しているかを決定するために調べることができるテーブル内のパケットを記録します。"
    },
    {
      "indent": 3,
      "text": "Also, if a particular destination is repeatedly seen to be unresolvable, the server calls the Block server (Section 4.3.6) to determine whether the address should be blocked.",
      "ja": "特定の宛先を繰り返し解決できないことが分かる場合も、サーバは、アドレスがブロックされるべきかどうかを決定するためにブロックサーバー（4.3.6項）を呼び出します。"
    },
    {
      "indent": 0,
      "text": "4.3.6 Block Server",
      "section_title": true,
      "ja": "4.3.6ブロックサーバー"
    },
    {
      "indent": 3,
      "text": "The Resolve Block server is called when a particular destination has been repeatedly seen to be unresolvable. This typically happens when, unknown to the packet source, the destination endstation is either not currently available or no longer exists.",
      "ja": "特定の宛先を繰り返し、解決不能であることを見てきたときの解決ブロックサーバーが呼び出されます。先のエンドステーションがないか現在利用可能か、もはや存在する場合、パケット送信元に未知の、これが一般的に起こります。"
    },
    {
      "indent": 3,
      "text": "If the Block server determines that the unresolved address has exceeded a configurable request threshold, the address is added to the server's Block Table. Interswitch Resolve request messages for addresses listed in the Block Table are sent less frequently, thereby reducing the amount of Interswitch Resolve traffic throughout the fabric.",
      "ja": "ブロックサーバーが未解決のアドレスが設定を要求するしきい値を超えていると判断した場合、アドレスは、サーバのブロックテーブルに追加されます。ブロック表に記載されているアドレスのインター解決要求メッセージは、それによって、ファブリック全体にインターを解決トラフィックの量を減少させる、より少ない頻度で送信されます。"
    },
    {
      "indent": 3,
      "text": "If an address listed in the Block Table is later successfully resolved by and Interswitch Resolve request message, the address is removed from the table.",
      "ja": "ブロック表に記載されているアドレスを後で正常解決要求メッセージによって、およびスイッチ間解決されている場合は、アドレスがテーブルから削除されます。"
    },
    {
      "indent": 0,
      "text": "4.4 Policy Service Center",
      "section_title": true,
      "ja": "4.4ポリシーサービスセンター"
    },
    {
      "indent": 3,
      "text": "Once the destination address of the call packet has been resolved, the Policy Service Center is called to determine the validity of the requested call connection based on the VLAN policy of the source and destination VLANs.",
      "ja": "通話パケットの宛先アドレスが解決されたら、ポリシーサービスセンターでは、送信元と送信先のVLANのVLANポリシーに基づいて要求された呼接続の有効性を判断するために呼び出されます。"
    },
    {
      "indent": 0,
      "text": "4.4.1 Unicast Rules Server",
      "section_title": true,
      "ja": "4.4.1ユニキャストルールサーバ"
    },
    {
      "indent": 3,
      "text": "The Policy Unicast Rules server recognizes two VLAN policy values: Open or Secure. The default policy for all VLANs is Open.",
      "ja": "オープンまたはSecure：ポリシーユニキャストルールサーバは、2つのVLANポリシー値を認識します。すべてのVLANのデフォルトポリシーはオープンです。"
    },
    {
      "indent": 3,
      "text": "The policy value is used as follows when determining the validity of a requested call connection:",
      "ja": "要求された呼接続の有効性を判断する際、次のようにポリシーの値が使用されます。"
    },
    {
      "indent": 3,
      "text": "- If the VLAN policy of either the source or destination cannot be determined, the Filter Service Center is called to establish a filter (i.e., blocked) for the SA/DA pair.",
      "ja": " - 送信元または送信先のVLANポリシーが決定できない場合は、フィルタサービスセンターは、SA / DAペアに対して（すなわち、ブロック）フィルタを確立するために呼び出されます。"
    },
    {
      "indent": 3,
      "text": "- If the source and destination endstations belong to the same VLAN, then the connection is permitted regardless of the VLAN policy.",
      "ja": " - 送信元および宛先エンドステーションが同じVLANに属している場合、接続に関係なくVLANポリシーの許可されています。"
    },
    {
      "indent": 3,
      "text": "- If the source and destination endstations belong to different VLANs, but both VLANs are running with an Open policy, then the connection is permitted, providing cut-through switching between different VLAN(s).",
      "ja": " - 送信元および宛先エンドステーションは、異なるVLANに属しているが、両方のVLANがオープンポリシーで実行している場合、その接続は、異なるVLAN（S）との間のカットスルースイッチングを提供し、許可されています。"
    },
    {
      "indent": 3,
      "text": "- If the source and destination endstations belong to different VLANs and one or both of the VLANs are running with a Secure policy, then the Flood Service Center (Section 4.8) is called to broadcast the packet to other SFVLAN switches having ports or endstations that belong to the same VLAN as the packet source.",
      "ja": " - 送信元と送信先エンドステーションは、Secureポリシーで実行されている異なるVLANとVLANの一方または両方に属している場合には、洪水サービスセンター（4.8節）が属しているポートまたはエンドステーションを持つスイッチ他SFVLANにパケットをブロードキャストするために呼び出されますパケットソースと同じVLANに。"
    },
    {
      "indent": 6,
      "text": "Note that if any of the VLANs to which the source or destination belong has a Secure policy, then the policy used in the above algorithm is Secure.",
      "ja": "送信元または宛先が属するVLANのいずれかがSecureポリシーを持っている場合、上記のアルゴリズムで使用されるポリシーが安全であることに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "4.5 Connect Service Center",
      "section_title": true,
      "ja": "4.5接続サービスセンター"
    },
    {
      "indent": 3,
      "text": "Once the Policy Service Center (Section 4.4) has determined that a requested call connection is valid, the Connect Service Center is called to set up the connection. Note that connectivity between two endstations within the fabric is established on a switch-by-switch basis as the call progresses through the fabric toward its destination. No synchronization is needed between switches to establish an end-to-end connection.",
      "ja": "ポリシーサービスセンター（4.4節）が要求された呼接続が有効であると判断したら、接続サービスセンターは、接続を設定するために呼び出されます。呼がその宛先に向かってファブリックを介して進行するにつれて、ファブリック内の二つのエンドステーション間の接続は、スイッチによってスイッチ基づいて確立されることに注意してください。何同期は、エンドツーエンドの接続を確立するために、スイッチ間で必要ありません。"
    },
    {
      "indent": 3,
      "text": "The Connect Service Center maintains a Connection Table containing information for all connections currently active on the switch's local ports.",
      "ja": "接続サービスセンターでは、スイッチのローカルポート上で現在アクティブなすべての接続のための接続テーブル含む情報を保持しています。"
    },
    {
      "indent": 3,
      "text": "Connections are removed from the Connection Table when one of the endstations is moved to a new switch (Section 4.1.2) or when the Topology Link State server (Section 4.2.3) notifies the Connect Service Center that a network link has failed. Otherwise, connections are not automatically aged out or removed from the Connection Table until a certain percentage threshold (HiMark) of table capacity is reached and resources are needed. At that point, some number of connections (typically 100) are aged out and removed at one time.",
      "ja": "エンドステーションの一つは、新しいスイッチ（セクション4.1.2）時やトポロジリンクステートサーバ（4.2.3）はネットワークリンクに障害が発生したこと接続サービスセンターに通知に移動したときに接続が接続テーブルから削除されます。そうでなければ、接続は自動的に期限切れまたはテーブル容量の一定割合閾値（HiMark）が到達するとリソースが必要になるまで接続テーブルから削除されません。その時点で、接続のいくつかの数（典型的には100）が期限切れにされており、一度に除去しました。"
    },
    {
      "indent": 0,
      "text": "4.5.1 Local Server",
      "section_title": true,
      "ja": "4.5.1ローカルサーバー"
    },
    {
      "indent": 3,
      "text": "If the destination endstation resides on the local switch, the Connect Local server establishes a connection between the source and destination ports. Note that if the source and destination both reside on the same physical port, a filter connection is established by calling the Filter Service Center (Section 4.6).",
      "ja": "宛先エンドステーションは、ローカルスイッチ上にある場合、接続、ローカルサーバは、送信元ポートと宛先ポートとの間の接続を確立します。送信元と宛先の両方が同一の物理ポートに存在する場合、フィルタ接続は、フィルタサービスセンター（4.6節）を呼び出すことによって確立されることに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "4.5.2 Link State Server",
      "section_title": true,
      "ja": "4.5.2リンク状態サーバー"
    },
    {
      "indent": 3,
      "text": "The Connect Link State server is called if the destination endstation of the proposed connection does not reside on the local switch.",
      "ja": "提案されている接続先のエンドステーションは、ローカルスイッチ上に存在しない場合、接続リンクステートサーバーが呼び出されます。"
    },
    {
      "indent": 3,
      "text": "The server executes a call to the Path Link State server (Section 4.7.1) which returns up to three \"best\" paths of equal cost from the local switch to the destination switch. If more than one path is returned, the server chooses a path that provides the best load balancing of user traffic across the fabric.",
      "ja": "サーバーは、パスの宛先スイッチにローカルスイッチから等しいコストの3「最良」のパスまで返すリンクステートサーバ（セクション4.7.1）への呼び出しを実行します。複数のパスが返された場合、サーバは、ファブリック全体でユーザトラフィックの最高の負荷分散を提供し、パスを選択します。"
    },
    {
      "indent": 0,
      "text": "4.5.3 Directory Server",
      "section_title": true,
      "ja": "4.5.3ディレクトリサーバ"
    },
    {
      "indent": 3,
      "text": "The Connect Directory server is called if the Connect Link State server is unable to provide a path for some reason.",
      "ja": "接続リンクステートサーバが何らかの理由でパスを提供することができない場合は接続Directoryサーバーが呼び出されます。"
    },
    {
      "indent": 3,
      "text": "The server examines the local directory to determine on which switch the destination endstation resides. If the port of access to the destination switch is known, then a connection is established using that port as the outport of the connection.",
      "ja": "サーバーは、どの先のエンドステーションが常駐切り替えるかを決定するためにローカルディレクトリを調べます。宛先スイッチへのアクセスポートが既知である場合、接続は、接続のアウトポートとして、ポートを使用して確立されます。"
    },
    {
      "indent": 0,
      "text": "4.6 Filter Service Center",
      "section_title": true,
      "ja": "4.6サービスセンターフィルター"
    },
    {
      "indent": 3,
      "text": "The Filter Service Center is responsible for establishing filtered connections. This service center is called by the Connect Local server (Section 4.5.1) if the source and destination endstations reside on the same physical port, and by the Policy Service Center (Section 4.4) if the VLAN of either the source or destination is indeterminate.",
      "ja": "フィルターサービスセンターを濾過接続を確立する責任があります。ソースまたは宛先のいずれかのVLANが不確定である場合に、送信元と宛先エンドステーションが同じ物理ポート上、およびポリシーサービスセンター（4.4節）で存在する場合、このサービスセンターを接続し、ローカルサーバ（4.5.1）によって呼び出されます。"
    },
    {
      "indent": 3,
      "text": "A filter connection is programmed in the switch hardware with no specified outport. That is, the connection is programmed to discard any traffic for that SA/DA pair.",
      "ja": "フィルタの接続は指定しないアウトポートとスイッチのハードウェアにプログラムされています。これは、接続がそのSA / DAペアのすべてのトラフィックを廃棄するようにプログラムされています。"
    },
    {
      "indent": 0,
      "text": "4.7 Path Service Center",
      "section_title": true,
      "ja": "4.7パスサービスセンター"
    },
    {
      "indent": 3,
      "text": "The Path Service Center is responsible for determining the path from a source to a destination.",
      "ja": "パスサービスセンターは、送信元から宛先へのパスを決定する責任があります。"
    },
    {
      "indent": 0,
      "text": "4.7.1 Link State Server",
      "section_title": true,
      "ja": "4.7.1リンク状態サーバー"
    },
    {
      "indent": 3,
      "text": "The Path Link State server is called by the Connect Link State server (Section 4.5.2) to return up to three best paths of equal cost between a source and destination pair of endstations. These best paths are calculated by the Topology Link State server (Section 4.2.3).",
      "ja": "パスリンクステートサーバーは、エンドステーションの送信元と宛先のペアの間に等しいコストの3つの最高のパスまで戻るには接続リンクステートサーバ（4.5.2）によって呼び出されます。これらのベストパスがトポロジリンクステートサーバ（4.2.3）により算出されています。"
    },
    {
      "indent": 3,
      "text": "The Path Link State server is also called by the Connect Service Center to return a complete source-to-destination path consisting of a list of individual switch port names. A switch port name consists of the switch base MAC address and a port instance relative to the switch.",
      "ja": "パスリンクステートサーバーは、個々のスイッチポート名のリストから成る、完全なソースから宛先へのパスを返すために、接続サービスセンターと呼ばれています。スイッチポート名は、スイッチベースのMACアドレスとスイッチに対するポートのインスタンスから成ります。"
    },
    {
      "indent": 0,
      "text": "4.7.2 Spanning Tree Server",
      "section_title": true,
      "ja": "4.7.2スパニングツリーのサーバー"
    },
    {
      "indent": 3,
      "text": "The Path Spanning Tree server is called by any server needing to forward an undirected message out over the switch flood path. The server returns a port mask indicating which local ports are currently enabled as outports of the switch flood path. The switch flood path is calculated by the Topology Spanning Tree server (Section 4.2.2).",
      "ja": "パススパニングツリーサーバは、スイッチ洪水パス上無向メッセージを転送する必要が任意のサーバによって呼び出されます。サーバは、ローカルポートが現在スイッチ洪水路のOutportとして有効になっているかを示すポートマスクを返します。スイッチ洪水パスがトポロジスパニングツリーサーバ（4.2.2）により算出されます。"
    },
    {
      "indent": 0,
      "text": "4.8 Flood Service Center",
      "section_title": true,
      "ja": "4.8洪水サービスセンター"
    },
    {
      "indent": 3,
      "text": "If the Resolve Service Center (Section 4.3) is unable to resolve the destination address of a packet, it invokes the Flood Service Center to broadcast the unresolved packet.",
      "ja": "解決サービスセンター（4.3節）は、パケットの宛先アドレスを解決できない場合は、未解決のパケットをブロードキャストする洪水サービスセンターを呼び出します。"
    },
    {
      "indent": 0,
      "text": "4.8.1 Tag-Based Flood Server",
      "section_title": true,
      "ja": "4.8.1タグベース洪水サーバー"
    },
    {
      "indent": 3,
      "text": "The Tag-Based Flood server encapsulates the unresolved packet into an Interswitch Tag-Based Flood message (Section 6.6), along with a list of Virtual LAN identifiers specifying those VLANs to which the source endstation belongs. The message is then sent out over the switch flood path to all other switches in the fabric.",
      "ja": "タグベースの洪水サーバーは、ソースエンドステーションが属するこれらのVLANを指定して、仮想LAN識別子のリストとともに、スイッチ間タグベースの洪水のメッセージ（6.6節）に未解決のパケットをカプセル化します。メッセージは、ファブリック内の他のすべてのスイッチにスイッチフラッド経路上に送出されます。"
    },
    {
      "indent": 3,
      "text": "When a switch receives an Interswitch Tag-Based Flood message, it examines the encapsulated header to determine the VLAN(s) to which the packet should be sent. If any of the switch's local access ports belong to one or more of the specified VLANs, the switch strips off the tag-based header and forwards the original packet out the appropriate access port(s).",
      "ja": "スイッチは、スイッチ間タグベースのフラッドメッセージを受信すると、パケットを送信すべきVLAN（複数可）を決定するために、カプセル化ヘッダを調べ。スイッチのローカルアクセスポートのいずれかが指定されたVLANの1つ以上に属している場合、スイッチは、タグベースのヘッダを取り除き、適切なアクセスポート（複数可）を、元のパケットを転送します。"
    },
    {
      "indent": 3,
      "text": "The switch also forwards the entire encapsulated packet along the switch flood path to its downstream neighboring switches, if any.",
      "ja": "もしあれば、スイッチはまた、その下流の隣接スイッチにスイッチ洪水経路に沿って全体のカプセル化されたパケットを転送します。"
    },
    {
      "indent": 0,
      "text": "5. Monitoring Call Connections",
      "section_title": true,
      "ja": "5.モニタリングコールの接続"
    },
    {
      "indent": 3,
      "text": "The SecureFast VLAN product permits monitoring of user traffic moving between two endstations by establishing a call tap on the connection between the two stations. Traffic can be monitored in one or both directions along the connection path.",
      "ja": "SecureFast VLAN製品は、2つのステーション間の接続にコールタップを確立することにより、2つのエンドステーション間を移動するユーザトラフィックのモニタリングが可能になります。トラフィックは1かの接続経路に沿って両方向に監視することができます。"
    },
    {
      "indent": 0,
      "text": "5.1 Definitions",
      "section_title": true,
      "ja": "5.1定義"
    },
    {
      "indent": 3,
      "text": "In addition to the terms defined in Section 1.2, the following terms are used in this description of the call tap process.",
      "ja": "セクション1.2で定義された用語に加えて、以下の用語は、呼タッププロセスのこの説明で使用されています。"
    },
    {
      "indent": 3,
      "text": "Originating Switch",
      "ja": "発信スイッチ"
    },
    {
      "indent": 6,
      "text": "The originating switch is the switch that requests the call tap. Any switch along a call connection path may request a tap on that call connection.",
      "ja": "元のスイッチは、コールタップを要請するスイッチです。呼接続パスに沿って任意のスイッチは、呼接続にタップを要求することができます。"
    },
    {
      "indent": 3,
      "text": "Probe",
      "ja": "調査"
    },
    {
      "indent": 6,
      "text": "The tap probe is the device to receive a copy of the call connection data. The probe is attached to a port on the probe switch.",
      "ja": "タッププローブは、呼接続データのコピーを受信するための装置です。プローブは、プローブのスイッチ上のポートに接続されています。"
    },
    {
      "indent": 3,
      "text": "Probe Switch",
      "ja": "プローブ・スイッチ"
    },
    {
      "indent": 6,
      "text": "The probe switch (also known as the terminating switch) is the switch to which the probe is attached. The probe switch can be anywhere in the topology.",
      "ja": "（また、終端スイッチとして知られている）プローブスイッチは、プローブが接続されているスイッチです。プローブスイッチは、トポロジ内の任意の場所にすることができます。"
    },
    {
      "indent": 0,
      "text": "5.2 Tapping a Connection",
      "section_title": true,
      "ja": "5.2接続をタップします"
    },
    {
      "indent": 3,
      "text": "A request to tap a call connection between two endstations can originate on any switch along the call connection path -- the ingress switch, the egress switch, or any of the intermediate switches. The call connection must have already been established before a call tap request can be issued. The probe device can be attached to any switch in the topology.",
      "ja": "入口スイッチ、出力スイッチ、または中間スイッチのいずれか - 要求は、呼接続経路に沿った任意のスイッチで発信可能な2つのエンドステーション間の呼接続をタップします。コールタップ要求が発行される前に、呼接続がすでに確立されている必要があります。プローブ装置は、トポロジ内のすべてのスイッチに接続することができます。"
    },
    {
      "indent": 0,
      "text": "5.2.1 Types of Tap Connections",
      "section_title": true,
      "ja": "タップ接続の種類5.2.1"
    },
    {
      "indent": 3,
      "text": "A call tap is enabled by setting up an auxiliary tap connection associated with the call being monitored. Since the tap must originate on a switch somewhere along the call connection path, the tap connection path will pass through one or more of the switches along the call path. However, since the probe switch can be anywhere in the switch fabric, the tap path and the call path may diverge at some point.",
      "ja": "コールタップは監視されている呼に関連する補助タップ接続を設定することによってイネーブルされます。タップがどこ呼接続経路に沿ってスイッチに属しなければならないので、タップ接続経路は、通話経路に沿ってスイッチの一つ以上を通過します。プローブスイッチはどこでも、スイッチファブリックであることができるので、タップ経路および呼経路は、いくつかの点で発散することができます。"
    },
    {
      "indent": 3,
      "text": "Therefore, on each switch along the tap path, the tap connection is established in one of three ways:",
      "ja": "したがって、タップ経路に沿った各スイッチで、タップ接続は、3つの方法のいずれかで確立されています。"
    },
    {
      "indent": 3,
      "text": "- The existing call connection is used with no modification.",
      "ja": " - 既存の呼接続が変更なしで使用されています。"
    },
    {
      "indent": 9,
      "text": "When both the call path and tap path pass through the switch,\nand the inport and outports of both connections are identical,\nthe switch uses the existing call connection to route the tap.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "- The existing call connection is modified.",
      "ja": " - 既存の呼接続が変更されます。"
    },
    {
      "indent": 9,
      "text": "When both the call path and tap path pass through the switch,\nbut the call path outport is different from the tap path\noutport, the switch enables an extra outport in either one or\nboth directions of the call connection, depending on the\ndirection of the tap.  This happens under two conditions.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "- If the switch is also the probe switch, an extra outport is enabled to the probe.",
      "ja": " - スイッチは、プローブのスイッチである場合は、余分なアウトポートは、プローブに有効になります。"
    },
    {
      "indent": 3,
      "text": "- If the switch is the point at which the call path and the tap path diverge, an extra outport is enabled to the downstream neighbor on that leg of the switch flood path on which the probe switch is located.",
      "ja": " - スイッチは、コール・パスとタップパスが発散するポイントがある場合は、追加のアウトポートは、プローブスイッチが配置されているスイッチの洪水パスの足の下流隣人に有効になります。"
    },
    {
      "indent": 3,
      "text": "- A new connection is established.",
      "ja": " - 新しい接続が確立されています。"
    },
    {
      "indent": 9,
      "text": "If the call path does not pass through the switch (because the\ntap path has diverged from the call path), a completely new\nconnection is established for the tap.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5.2.2 Locating the Probe and Establishing the Tap Connection",
      "section_title": true,
      "ja": "5.2.2プローブの場所とタップ接続の確立"
    },
    {
      "indent": 3,
      "text": "To establish a call tap, the originating switch formats an Interswitch Tap request message (Section 6.7) and sends it out over the switch flood path to all other switches in the topology.",
      "ja": "コールタップを確立するには、元のスイッチは、スイッチ間をタップ要求メッセージ（6.7節）をフォーマットして、トポロジ内の他のすべてのスイッチにスイッチ洪水のパスを介して送出します。"
    },
    {
      "indent": 6,
      "text": "Note:",
      "ja": "注意："
    },
    {
      "indent": 9,
      "text": "If the originating switch is also the probe switch, no Interswitch Tap request message is necessary.",
      "ja": "発信スイッチは、プローブのスイッチである場合、スイッチ間タップ要求メッセージは不要です。"
    },
    {
      "indent": 3,
      "text": "As the Interswitch Tap request message travels out along the switch flood path, each switch receiving the message checks to see if it is the probe switch and does the following:",
      "ja": "スイッチ間タップ要求メッセージがスイッチフラッド経路に沿って移動するように、メッセージを受信した各スイッチは、プローブのスイッチであり、以下のないかどうかをチェック。"
    },
    {
      "indent": 3,
      "text": "- If the switch is the probe switch, it establishes the tap connection by either setting up a new connection or modifying the call connection, as appropriate (see Section 5.2.1). It then reformats the Tap request message to be a Tap response message with a status indicating that the probe has been found, and sends the message back to its upstream neighbor.",
      "ja": " - スイッチがプローブスイッチである場合、それは新たな接続を設定するか、適切な呼接続を、（セクション5.2.1を参照）を変更するのいずれかによってタップ接続を確立します。これは、プローブが発見されたことを示すステータスでタップ応答メッセージであることがタップ要求メッセージを再フォーマットし、その上流の隣接するバックメッセージを送信します。"
    },
    {
      "indent": 3,
      "text": "- If the switch is not the probe switch, it forwards the Tap request message to all its downstream neighbors (if any).",
      "ja": " - スイッチがプローブスイッチでない場合、それはすべてのダウンストリームネイバー（もしあれば）にタップ要求メッセージを転送します。"
    },
    {
      "indent": 3,
      "text": "- If the switch is not the probe switch and has no downstream neighbors, it reformats the Tap request message to be a Tap response message with a status indicating that the probe is not located on that leg of the switch flood path. It then sends the response message back to its upstream neighbor.",
      "ja": " - スイッチがプローブスイッチされず、下流の近隣を有していない場合は、プローブがスイッチ洪水路の脚上に配置されていないことを示すステータスでタップ応答メッセージであることがタップ要求メッセージを再フォーマットします。これは、その上流の隣人に応答メッセージを返信します。"
    },
    {
      "indent": 6,
      "text": "When a switch forwards an Interswitch Tap request message to its downstream neighbors, it keeps track of the number of requests it has sent out.",
      "ja": "スイッチは、その下流の隣人にスイッチ間をタップ要求メッセージを転送するとき、それが送出した要求の数を追跡します。"
    },
    {
      "indent": 3,
      "text": "- If a response is received with a status indicating that the probe switch is located somewhere downstream, the switch establishes the appropriate type of tap connection (see Section 5.2.1). It then formats a Tap response message with a status indicating that the probe has been found and passes the message to its upstream neighbor.",
      "ja": " - 応答がプローブスイッチがどこか下流に配置されていることを示すステータスで受信された場合、スイッチは、タップ接続（セクション5.2.1を参照）の適切なタイプを確立します。これは、プローブが見出され、その上流隣にメッセージを渡すされたことを示すステータスでタップ応答メッセージをフォーマットします。"
    },
    {
      "indent": 3,
      "text": "- If no responses are received with a status indicating that the probe switch is located downstream, the switch formats a Tap response message with a status indicating that the probe has not been found and passes the message to its upstream neighbor.",
      "ja": " - 何も応答がプローブスイッチが下流に配置されていることを示すステータスで受信されない場合、スイッチは、プローブが見出され、その上流隣にメッセージを渡すされていないことを示すステータスでタップ応答メッセージをフォーマットします。"
    },
    {
      "indent": 0,
      "text": "5.2.3 Status Field",
      "section_title": true,
      "ja": "5.2.3ステータスフィールド"
    },
    {
      "indent": 3,
      "text": "The status field of the Interswitch Tap request/response message contains information about the state of the tap. Some of these status values are transient and are merely used to track the progress of the tap request. Other status values are stored in the tap table of each switch along the tap path for use when the tap is torn down. The possible status values are as follows:",
      "ja": "スイッチ間をタップし、要求/応答メッセージのステータスフィールドは、タップの状態に関する情報が含まれています。これらのステータス値の一部は一時的なものと、単にタップ要求の進捗状況を追跡するために使用されています。タップが切断されたときに他のステータス値を使用するためのタップ経路に沿って各スイッチのタップテーブルに格納されています。次のように可能なステータス値は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- StatusUnassigned. This is the initial status of the Interswitch Tap request message.",
      "ja": " -  StatusUnassigned。これは、スイッチ間をタップリクエストメッセージの初期状態です。"
    },
    {
      "indent": 3,
      "text": "- OutportDecisionUnknown. The tap request is still moving downstream along the switch flood path. The probe switch had not yet been found.",
      "ja": " -  OutportDecisionUnknown。タップ要求は、まだスイッチ洪水の経路に沿って下流に移動しています。プローブスイッチは、まだ発見されていませんでした。"
    },
    {
      "indent": 3,
      "text": "- ProbeNotFound. The probe switch is not located on this leg of the switch flood path.",
      "ja": " -  ProbeNotFound。プローブスイッチは、スイッチの洪水パスのこの脚の上に配置されていません。"
    },
    {
      "indent": 3,
      "text": "- DisableOutport. The probe switch is located on this leg of the switch flood path, and the switch has had to either modify the call connection or establish a new connection to implement the tap (see Section 5.2.1). When the tap is torn down, the switch will have to disable any additional outports that have been enabled for the tap.",
      "ja": " -  DisableOutport。プローブスイッチはスイッチ洪水パスのこの足の上に配置され、スイッチが呼接続を変更したり、タップを実装するための新しい接続を確立するかがあった（5.2.1項を参照してください）。タップが切断されると、スイッチはタップのために有効にされているすべての追加のOutportを無効にする必要があります。"
    },
    {
      "indent": 3,
      "text": "- KeepOutport. The probe switch is located on this leg of the switch flood path, and the switch was able to route the tap over the existing call path (see Section 5.2.1). Any ports used for",
      "ja": " -  KeepOutport。プローブスイッチは、スイッチの洪水パスのこの足の上に位置しており、スイッチは既存のコールのパスを超えるタップが（5.2.1項を参照）をルーティングすることができましたさ。するために使用される任意のポート"
    },
    {
      "indent": 6,
      "text": "the tap will remain enabled when the tap is torn down.",
      "ja": "タップが切断されたときにタップが有効のままになります。"
    },
    {
      "indent": 0,
      "text": "5.3 Untapping a Connection",
      "section_title": true,
      "ja": "5.3接続をたどり着けます"
    },
    {
      "indent": 3,
      "text": "A request to untap a call connection must be issued on the tap originating switch -- that is, the same switch that issued the tap request.",
      "ja": "、タップ要求を発行した同じスイッチである - 呼接続をアンタップする要求は、スイッチを元のタップで発行する必要があります。"
    },
    {
      "indent": 3,
      "text": "To untap a call connection, the originating switch sends an Interswitch Untap request message (Section 6.7) out over the switch flood path to all other switches in the topology. The message is sent over the switch flood path, rather than the tap connection path, to ensure that all switches that know of the tap are properly notified, even if the switch topology has changed since the tap was established.",
      "ja": "呼接続をアンタップし、発信スイッチは、トポロジ内の他のすべてのスイッチにスイッチフラッド経路にわたってスイッチ間アンタップ要求メッセージ（セクション6.7）を送信します。メッセージはタップが設立されてからスイッチトポロジが変更された場合でも、タップの知っているすべてのスイッチが適切に通知されることを保証するために、むしろタップの接続経路よりも、スイッチの洪水のパスを介して送信されます。"
    },
    {
      "indent": 3,
      "text": "When a switch receives an Interswitch Untap request message, it checks to see if it is handling a tap for the specified call connection. If so, the switch disables the tap connection, as follows:",
      "ja": "スイッチは、スイッチ間アンタップ要求メッセージを受信すると、それが指定された呼接続用のタップを処理しているかどうかを確認します。その場合は、次のように、スイッチは、タップ接続を無効にします。"
    },
    {
      "indent": 3,
      "text": "- If a new connection was added for the tap, the connection is deleted from the connection table.",
      "ja": " - 新しい接続をタップために添加した場合は、接続が接続テーブルから削除されます。"
    },
    {
      "indent": 3,
      "text": "- If additional outports were enabled on the call connection, they are disabled.",
      "ja": " - 追加のOutportは、呼接続で有効になっていた場合、彼らが無効になっています。"
    },
    {
      "indent": 3,
      "text": "The switch then forwards the Interswitch Untap request message to its downstream neighbor (if any). If the switch has no downstream neighbors, it formats an untap response and sends the message back to its upstream neighbor.",
      "ja": "スイッチは、その下流の隣接（もしあれば）にスイッチ間アンタップ要求メッセージを転送します。スイッチは何の下流の隣人を持っていない場合、それはアンタップ応答をフォーマットし、その上流の隣人に戻ってメッセージを送信します。"
    },
    {
      "indent": 3,
      "text": "When a switch forwards an Interswitch Untap request message to its downstream neighbors, it keeps track of the number of requests it has sent out and does not respond back to its upstream neighbor until all untap requests have been responded to. Once all responses have been received, the switch handles any final cleanup for the tap and then sends a single Interswitch Untap response message to its upstream neighbor.",
      "ja": "スイッチは、その下流の隣人にスイッチ間アンタップ要求メッセージを転送するとき、それが送出した、すべてのアンタップ・リクエストがに反応されるまで、その上流の隣人に戻って応答しない要求の数を追跡します。一旦、全ての応答が受信された、スイッチはタップのための任意の最終的なクリーンアップを処理し、その上流の隣人に、単一のスイッチ間アンタップ応答メッセージを送信します。"
    },
    {
      "indent": 0,
      "text": "6. Interswitch Message Protocol (ISMP)",
      "section_title": true,
      "ja": "前記スイッチ間メッセージプロトコル（ISMP）"
    },
    {
      "indent": 3,
      "text": "The InterSwitch Message protocol (ISMP) provides a consistent method of encapsulating and transmitting messages exchanged between switches to create and maintain the databases and provide other control services and functionality required by the SFVLAN product.",
      "ja": "インタースイッチメッセージプロトコル（ISMP）をカプセル化したメッセージを作成し、データベースを維持し、SFVLAN製品によって必要とされる他の制御サービス及び機能を提供するために、スイッチ間で交換伝送の一貫した方法を提供します。"
    },
    {
      "indent": 0,
      "text": "6.1 General Packet Structure",
      "section_title": true,
      "ja": "6.1一般的なパケットの構造"
    },
    {
      "indent": 3,
      "text": "ISMP packets are of variable length and have the following general structure:",
      "ja": "ISMPパケットは、可変長であり、以下の一般構造を有します："
    },
    {
      "indent": 3,
      "text": "- Frame header - ISMP packet header - ISMP message body",
      "ja": " - フレームヘッダ -  ISMPパケットのヘッダー -  ISMPメッセージボディ"
    },
    {
      "indent": 3,
      "text": "Each of these packet segments is discussed separately in the following subsections.",
      "ja": "これらのパケットセグメントの各々は、以下のサブセクションで個別に説明されています。"
    },
    {
      "indent": 0,
      "text": "6.1.1 Frame Header",
      "section_title": true,
      "ja": "6.1.1フレームヘッダ"
    },
    {
      "indent": 3,
      "text": "ISMP packets are encapsulated within an IEEE 802-compliant frame using a standard header as shown below:",
      "ja": "以下に示すようにISMPパケットは、標準ヘッダを使用して、IEEE 802準拠のフレーム内にカプセル化されます。"
    },
    {
      "indent": 3,
      "text": "    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n00 |                                                               |\n   +      Destination address      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n04 |                               |                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+        Source address         +\n08 |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n12 |             Type              |                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +\n16 |                                                               |\n   +                                                               +\n   :                                                               :",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Destination address",
      "ja": "宛先アドレス"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the Media Access Control (MAC) address of the multicast channel over which all switches in the fabric receive ISMP packets. Except where otherwise noted, this field contains the multicast address of the control channel over which all switches in the fabric receive ISMP packets -- a value of 01- 00-1D-00-00-00.",
      "ja": "この6オクテットフィールドは、ファブリック内のすべてのスイッチがISMPパケットを受信し、その上、マルチキャストチャネルのメディアアクセス制御（MAC）アドレスを含みます。 01- 00-1D-00-00-00の値 - 特記する場合を除いて、このフィールドは、ファブリック内のすべてのスイッチは、ISMPパケットを受信し、その上の制御チャネルのマ​​ルチキャストアドレスを含みます。"
    },
    {
      "indent": 3,
      "text": "Source address",
      "ja": "ソースアドレス"
    },
    {
      "indent": 6,
      "text": "Except where otherwise noted, this 6-octet field contains the physical (MAC) address of the switch originating the ISMP packet.",
      "ja": "特記する場合を除いて、この6オクテットフィールドはISMPパケットを発信スイッチの物理（MAC）アドレスを含みます。"
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "This 2-octet field identifies the type of data carried within the frame. Except where otherwise noted, the type field of ISMP packets contains the value 0x81FD.",
      "ja": "この2オクテットフィールドは、フレーム内に運ばれたデータのタイプを識別する。特に指定がない限り、ISMPパケットのタイプフィールドは値0x81FDが含まれています。"
    },
    {
      "indent": 0,
      "text": "6.1.2 ISMP Packet Header",
      "section_title": true,
      "ja": "6.1.2 ISMPパケットヘッダ"
    },
    {
      "indent": 3,
      "text": "There are two versions of the ISMP packet header in use by the SecureFast VLAN product.",
      "ja": "SecureFast VLAN製品で使用されているISMPパケットヘッダの2つのバージョンがあります。"
    },
    {
      "indent": 0,
      "text": "6.1.2.1 Version 2",
      "section_title": true,
      "ja": "6.1.2.1バージョン2"
    },
    {
      "indent": 3,
      "text": "The version 2 ISMP packet header consists of 6 octets, as shown below:",
      "ja": "以下に示すようにバージョン2 ISMPパケットヘッダは、6つのオクテットで構成されています。"
    },
    {
      "indent": 3,
      "text": "    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n00 |///////////////////////////////////////////////////////////////|\n   ://////// Frame header /////////////////////////////////////////:\n   +//////// (14 octets)  /////////+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n12 |///////////////////////////////|            Version            |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n16 |       ISMP message type       |        Sequence number        |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n20 |                                                               |\n   +                                                               +\n   :                                                               :",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Frame header",
      "ja": "フレームヘッダ"
    },
    {
      "indent": 6,
      "text": "This 14-octet field contains the frame header (Section 6.1.1).",
      "ja": "この14オクテットフィールドは、フレームヘッダ（セクション6.1.1）が含まれています。"
    },
    {
      "indent": 3,
      "text": "Version",
      "ja": "版"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the version number of the InterSwitch Message Protocol to which this ISMP packet adheres. This document describes ISMP Version 2.0.",
      "ja": "この2オクテットのフィールドは、このISMPパケットが付着するのInterSwitchメッセージプロトコルのバージョン番号が含まれています。この文書では、ISMPバージョン2.0について説明します。"
    },
    {
      "indent": 3,
      "text": "ISMP message type",
      "ja": "ISMPメッセージタイプ"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains a value indicating which type of ISMP message is contained within the message body. The following table lists each ISMP message, along with its message type and the section within this document that describes the message in detail:",
      "ja": "この2オクテットフィールドはISMPメッセージのタイプは、メッセージ本体内に含まれているかを示す値を含みます。次の表は、メッセージタイプ、詳細にメッセージを記載し、この文書内のセクションと共に、各ISMPメッセージを示します。"
    },
    {
      "indent": 9,
      "text": "Message Name Type Description",
      "ja": "メッセージ名タイプ説明"
    },
    {
      "indent": 9,
      "text": "Interswitch Link State message 3 See note below Interswitch BPDU message 4 Section 6.2 Interswitch Remote Blocking message 4 Section 6.3 Interswitch Resolve message 5 Section 6.4 Interswitch New User message 5 Section 6.5 Interswitch Tag-Based Flood message 7 Section 6.6 Interswitch Tap/Untap message 8 Section 6.7",
      "ja": "スイッチ間BPDUメッセージ4節6.2のインターリモートブロッキングメッセージ4 6.3節スイッチ間解決メッセージ5節6.4のインター新規ユーザーのメッセージ5 6.5節スイッチ間のタグベースの洪水のメッセージ7節6.6のインタータップ/アンタップメッセージ8節以下のスイッチ間リンクステートメッセージ3を参照してくださいノート6.7"
    },
    {
      "indent": 6,
      "text": "Note:",
      "ja": "注意："
    },
    {
      "indent": 9,
      "text": "The Link State messages used by the VLS Protocol are not described in this document. For a detailed description of these messages, see [IDvlsp].",
      "ja": "VLSプロトコルで使用されるリンクステートメッセージは、この文書に記載されていません。これらのメッセージの詳細については、[IDvlsp]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Sequence number",
      "ja": "シーケンス番号"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains an internally generated sequence number used by the various protocol handlers for internal synchronization of messages.",
      "ja": "この2オクテットのフィールドは、メッセージの内部同期のための様々なプロトコルハンドラによって使用される内部生成されたシーケンス番号を含みます。"
    },
    {
      "indent": 0,
      "text": "6.1.2.2 Version 3",
      "section_title": true,
      "ja": "6.1.2.2バージョン3"
    },
    {
      "indent": 3,
      "text": "The version 3 ISMP packet header is used only by the Interswitch Keepalive message. That message is not described in this document. For a detailed description of the version 3 ISMP packet header, see [IDhello].",
      "ja": "バージョン3 ISMPパケットヘッダのみスイッチ間キープアライブメッセージによって使用されます。そのメッセージは、この文書に記述されていません。バージョン3 ISMPパケットヘッダの詳細については、[IDhello]参照。"
    },
    {
      "indent": 0,
      "text": "6.1.3 ISMP Message Body",
      "section_title": true,
      "ja": "6.1.3 ISMPメッセージ本文"
    },
    {
      "indent": 3,
      "text": "The ISMP message body is a variable-length field containing the actual data of the ISMP message. The length and content of this field are determined by the value found in the message type field.",
      "ja": "ISMPメッセージ本体はISMPメッセージの実際のデータを含む可変長フィールドです。このフィールドの長さと内容は、メッセージタイプフィールドで見つかった値によって決定されます。"
    },
    {
      "indent": 3,
      "text": "See the following sections for the exact format of each message type.",
      "ja": "各メッセージタイプの正確な形式は、次の各項を参照してください。"
    },
    {
      "indent": 0,
      "text": "6.2 Interswitch BPDU Message",
      "section_title": true,
      "ja": "6.2スイッチ間BPDUメッセージ"
    },
    {
      "indent": 3,
      "text": "The Interswitch BPDU message consists of a variable number of octets, as shown below:",
      "ja": "以下に示すようにスイッチ間BPDUメッセージは、オクテットの可変数で構成されています。"
    },
    {
      "indent": 3,
      "text": "    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n00 |                                                               |\n   +                         Frame header /                        +\n   :                   ISMP packet header (type 4)                 :\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n20 |            Version            |            Opcode             |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n24 |          Message flags        |                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +\n28 |                                                               |\n   :                          BPDU packet                          :\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Frame header/ISMP packet header",
      "ja": "フレームヘッダー/ ISMPパケットヘッダ"
    },
    {
      "indent": 6,
      "text": "This 20-octet field contains the frame header and the ISMP packet header.",
      "ja": "この20オクテットフィールドは、フレームヘッダとISMPパケットヘッダを含んでいます。"
    },
    {
      "indent": 3,
      "text": "Version",
      "ja": "版"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the version number of the message type. This document describes ISMP message type 4, version 1.",
      "ja": "この2オクテットのフィールドは、メッセージタイプのバージョン番号が含まれています。この文書では、ISMPメッセージタイプ4、バージョン1が記載されています。"
    },
    {
      "indent": 3,
      "text": "Opcode",
      "ja": "オペコード"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the operation type of the message. For an Interswitch BPDU message, the value should be 1.",
      "ja": "この2オクテットのフィールドは、メッセージの動作タイプが含まれています。スイッチ間BPDUメッセージの場合、値は1であるべきです。"
    },
    {
      "indent": 3,
      "text": "Message flags",
      "ja": "メッセージフラグ"
    },
    {
      "indent": 6,
      "text": "This 2-octet field is currently unused. It is reserved for future use.",
      "ja": "この2オクテットのフィールドには、現在使用されていません。これは、将来の使用のために予約されています。"
    },
    {
      "indent": 3,
      "text": "BPDU packet",
      "ja": "BPDUパケット"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains an IEEE-compliant 802.2 Bridge Protocol Data Unit. See [IEEE] for a detailed description of the contents of this field.",
      "ja": "この可変長フィールドには、IEEE準拠802.2ブリッジプロトコルデータユニットが含まれています。このフィールドの内容の詳細については、[IEEE]を参照してください。"
    },
    {
      "indent": 0,
      "text": "6.3 Interswitch Remote Blocking Message",
      "section_title": true,
      "ja": "6.3スイッチ間のリモートブロッキングメッセージ"
    },
    {
      "indent": 3,
      "text": "The Interswitch Remote Blocking message consists of 30 octets, as shown below:",
      "ja": "以下に示すようにスイッチ間リモートブロッキングメッセージは、30個のオクテットで構成されています。"
    },
    {
      "indent": 3,
      "text": "    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n00 |                                                               |\n   +                         Frame header /                        +\n   :                   ISMP packet header (type 4)                 :\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n20 |            Version            |           Opcode              |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n24 |          Message flags        |        Blocking flag ...      |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n28 |       ... Blocking flag       |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Frame header/ISMP packet header",
      "ja": "フレームヘッダー/ ISMPパケットヘッダ"
    },
    {
      "indent": 6,
      "text": "This 20-octet field contains the frame header and the ISMP packet header.",
      "ja": "この20オクテットフィールドは、フレームヘッダとISMPパケットヘッダを含んでいます。"
    },
    {
      "indent": 3,
      "text": "Version",
      "ja": "版"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the version number of the message type. This document describes ISMP message type 4, version 1.",
      "ja": "この2オクテットのフィールドは、メッセージタイプのバージョン番号が含まれています。この文書では、ISMPメッセージタイプ4、バージョン1が記載されています。"
    },
    {
      "indent": 3,
      "text": "Opcode",
      "ja": "オペコード"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the operation type of the message. Valid values are as follows:",
      "ja": "この2オクテットのフィールドは、メッセージの動作タイプが含まれています。有効な値は次のとおりです："
    },
    {
      "indent": 9,
      "text": "2 Enable/disable remote blocking 3 Acknowledge previously received Remote Blocking message",
      "ja": "2有効/無効にするには、リモート先に受信したリモートのブロッキングメッセージを確認3をブロック"
    },
    {
      "indent": 3,
      "text": "Message flags",
      "ja": "メッセージフラグ"
    },
    {
      "indent": 9,
      "text": "This 2-octet field is currently unused.  It is reserved for\nfuture use.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Blocking flag",
      "ja": "ブロッキングフラグ"
    },
    {
      "indent": 9,
      "text": "This 4-octet field contains a flag indicating the state of\nremote blocking on the link over which the message was\nreceived.  A value of 1 indicates remote blocking is on and no\nundirected ISMP messages should be sent over the link.  A value\nof 0 indicates remote blocking is off.  This flag is irrelevant\nif the operation type (Opcode) of the message has a value of 3.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "6.4 Interswitch Resolve Message",
      "section_title": true,
      "ja": "6.4スイッチ間の解決メッセージ"
    },
    {
      "indent": 3,
      "text": "There are two versions of the Interswitch Resolve message used by the SecureFast VLAN product.",
      "ja": "SecureFast VLAN製品で使用されるスイッチ間の解決メッセージの2つのバージョンがあります。"
    },
    {
      "indent": 0,
      "text": "6.4.1 Prior to Version 1.8",
      "section_title": true,
      "ja": "6.4.1バージョン1.8より前"
    },
    {
      "indent": 3,
      "text": "The Interswitch Resolve message used by SFVLAN prior to version 1.8 consists of a variable number of octets, as shown below:",
      "ja": "以下に示すように前のバージョン1.8にSFVLANによって使用されるスイッチ間の解決メッセージは、オクテットの可変数で構成されています。"
    },
    {
      "indent": 3,
      "text": "     0                   1                   2                   3\n     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n 00 |                                                               |\n    +                         Frame header /                        +\n    :                   ISMP packet header (type 5)                 :\n    |                                                               |\n    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n 20 |           Version             |            Opcode             |\n    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n 24 |            Status             |           Call Tag            |\n    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n 28 |                                                               |\n    +     Source MAC of packet      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n 32 |                               |                               |\n    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+     Originating switch MAC    +\n 36 |                                                               |\n    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n 40 |                                                               |\n    +       Owner switch MAC        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n 44 |                               |                               |\n    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +\n 48 |                                                               |\n    :                   Known destination address                   :\n    |                                                               |\n    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n  n |     Count     |                                               |\n    +-+-+-+-+-+-+-+-+                                               +\nn+4 |                         Resolve list                          |\n    :                                                               :\n    |                                                               |\n    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 10,
      "text": "n = 46 + length of known address TLV",
      "ja": "既知のアドレスTLVのN = 46 +長さ"
    },
    {
      "indent": 3,
      "text": "In the following description of the message fields, the term \"originating\" switch refers to the switch that issued the original Interswitch Resolve request. The term \"owner\" switch refers to that switch to which the destination endstation is attached. And the term \"responding\" switch refers to either the \"owner\" switch or to a switch at the end of the switch flood path that does not own the endstation but issues an Interswitch Resolve response because it has no downstream neighbors.",
      "ja": "メッセージフィールドの以下の説明において、用語「発信」スイッチは、元のスイッチ間の解決要求を発行したスイッチを指します。用語「所有者」スイッチは、宛先エンドステーションが接続されているそのスイッチを指します。そして、スイッチを「応答」という用語は、いずれかの「所有者」スイッチまたはそれは下流の隣人を持っていないため、応答を解決エンドステーションが、問題スイッチ間を所有していないスイッチ洪水のパスの最後にスイッチを指します。"
    },
    {
      "indent": 3,
      "text": "With the exception of the resolve list (which has a different size and format in a Resolve response message), all fields of an Interswitch Resolve message are allocated by the originating switch, and unless otherwise noted below, are written by the originating switch.",
      "ja": "（解決応答メッセージに異なるサイズ及びフォーマットを有する）解決リストを除いて、スイッチ間の解決メッセージのすべてのフィールドは、発信スイッチによって割り当てられ、そうでなければ以下の注記がない限り、発信スイッチによって書かれています。"
    },
    {
      "indent": 3,
      "text": "Frame header/ISMP packet header",
      "ja": "フレームヘッダー/ ISMPパケットヘッダ"
    },
    {
      "indent": 6,
      "text": "This 20-octet field contains the frame header and the ISMP packet header.",
      "ja": "この20オクテットフィールドは、フレームヘッダとISMPパケットヘッダを含んでいます。"
    },
    {
      "indent": 3,
      "text": "Version",
      "ja": "版"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the version number of the message type. This document describes ISMP message type 5, version 1.",
      "ja": "この2オクテットのフィールドは、メッセージタイプのバージョン番号が含まれています。この文書では、ISMPメッセージタイプ5、バージョン1を説明します。"
    },
    {
      "indent": 3,
      "text": "Opcode",
      "ja": "オペコード"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the operation code of the message. Valid values are as follows:",
      "ja": "この2オクテットのフィールドは、メッセージの動作コードを含みます。有効な値は次のとおりです："
    },
    {
      "indent": 9,
      "text": "1 The message is a Resolve request. 2 The message is a Resolve response. 3 (unused in Resolve messages) 4 (unused in Resolve messages)",
      "ja": "1メッセージは、解決要求です。 2メッセージが解決応答です。 （解決メッセージの未使用）4（解決メッセージの未使用）3"
    },
    {
      "indent": 6,
      "text": "The originating switch writes a value of 1 to this field, while the responding switch writes a value of 2.",
      "ja": "応答スイッチは2の値を書き込みながら、発信スイッチは、このフィールドに1の値を書き込みます。"
    },
    {
      "indent": 3,
      "text": "Status",
      "ja": "状態"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the status of a Resolve response message. Valid values are as follows:",
      "ja": "この2オクテットのフィールドは解決応答メッセージのステータスが含まれています。有効な値は次のとおりです："
    },
    {
      "indent": 9,
      "text": "0 The Resolve request succeeded (ResolveAck). 1 (unused) 2 The Resolve request failed (Unknown).",
      "ja": "0解決要求は（ResolveAck）成功しました。 1（未使用）2解決要求（不明）が失敗しました。"
    },
    {
      "indent": 6,
      "text": "This field is written by the responding switch.",
      "ja": "このフィールドは、応答スイッチによって書かれています。"
    },
    {
      "indent": 3,
      "text": "Call tag",
      "ja": "コールタグ"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the call tag of the endstation packet for which this Resolve request is issued. The call tag is a 16- bit value (generated by the originating switch) that uniquely identifies the packet.",
      "ja": "この2オクテットのフィールドは、この解決要求が発行されたエンドステーションパケットの呼び出しタグが含まれています。呼び出しタグを一意パケットを識別（発信スイッチによって生成される）16ビットの値です。"
    },
    {
      "indent": 3,
      "text": "Source MAC of packet",
      "ja": "パケットの送信元MAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the endstation that originated the packet identified by the call tag.",
      "ja": "この6オクテットのフィールドは、コールのタグで識別されるパケットを発信したエンドステーションの物理（MAC）アドレスが含まれています。"
    },
    {
      "indent": 3,
      "text": "Originating switch MAC",
      "ja": "発信スイッチMAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the switch that issued the original Resolve request.",
      "ja": "この6オクテットのフィールドは、元の解決要求を発行したスイッチの物理（MAC）アドレスが含まれています。"
    },
    {
      "indent": 3,
      "text": "Owner switch MAC",
      "ja": "所有者スイッチMAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the switch to which the destination endstation is attached -- that is, the switch that was able to resolve the requested addressing information. This field is written by the owner switch.",
      "ja": "、要求されたアドレス情報を解決することができたスイッチである - この6オクテットのフィールドは、宛先エンドステーションが接続されているスイッチの物理（MAC）アドレスを含みます。このフィールドは、所有者のスイッチによって書かれています。"
    },
    {
      "indent": 6,
      "text": "If the status of the response is Unknown, this field is irrelevant.",
      "ja": "応答のステータスが不明の場合、このフィールドは無関係です。"
    },
    {
      "indent": 3,
      "text": "Known destination address",
      "ja": "既知の送信先アドレス"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains the known attribute of the destination endstation address. This address is stored in Tag/Length/Value format. (See Section 2.3.)",
      "ja": "この可変長フィールドには、宛先エンドステーションアドレスの既知の属性が含まれています。このアドレスは、タグ/長さ/値の形式で格納されます。 （2.3節を参照してください。）"
    },
    {
      "indent": 3,
      "text": "Count",
      "ja": "カウント"
    },
    {
      "indent": 6,
      "text": "This 1-octet field contains the number of address attributes requested or returned. This is the number of items in the resolve list.",
      "ja": "この1オクテットのフィールドは、要求されたか、返されたアドレスの属性の数が含まれています。これは、解決リスト内の項目の数です。"
    },
    {
      "indent": 3,
      "text": "Resolve list",
      "ja": "解決リスト"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains a list of the address attributes either requested by the originating switch or returned by the owner switch. Note that in a Resolve request message, this list contains only the tags of the requested address attributes (see Section 2.3). On the other hand, a Resolve response message with a status of ResolveAck contains the full TLV of each resolved address attribute. The number of entries in the list is specified in the count field.",
      "ja": "この可変長フィールドは、発信スイッチによって要求されたり、所有者のスイッチによって返されたいずれかの属性のアドレスのリストが含まれています。解決要求メッセージに、このリストは（2.3​​節を参照）を要求されたアドレス属性のタグのみが含まれていることに注意してください。一方、ResolveAckの状況と解決応答メッセージは、各解決されたアドレス属性の完全なTLVが含まれています。リストのエントリ数は、カウント・フィールドで指定されています。"
    },
    {
      "indent": 6,
      "text": "In an Interswitch Resolve response message, this field is irrelevant if the status of the response is Unknown.",
      "ja": "スイッチ間解決応答メッセージに、このフィールドは、応答のステータスが不明の場合は無関係です。"
    },
    {
      "indent": 0,
      "text": "6.4.2 Version 1.8",
      "section_title": true,
      "ja": "6.4.2バージョン1.8"
    },
    {
      "indent": 3,
      "text": "The Interswitch Resolve message used by SFVLAN version 1.8 consists of a variable number of octets, as shown below:",
      "ja": "以下に示すようにSFVLANバージョン1.8によって使用されるスイッチ間の解決メッセージは、オクテットの可変数で構成されています。"
    },
    {
      "indent": 0,
      "text": "       0                   1                   2                   3\n       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   00 |                                                               |\n      +                         Frame header /                        +\n      :                   ISMP packet header (type 5)                 :\n      |                                                               |\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   20 |           Version             |            Opcode             |\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   24 |            Status             |           Call Tag            |\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   28 |                                                               |\n      +     Source MAC of packet      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   32 |                               |                               |\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+     Originating switch MAC    +\n   36 |                                                               |\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   40 |                                                               |\n      +       Owner switch MAC        +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   44 |                               |                               |\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +\n   48 |                                                               |\n      :                   Known destination address                   :\n      |                                                               |\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n    n |     Count     |                                               |\n      +-+-+-+-+-+-+-+-+                                               +\n  n+4 |                         Resolve list                          |\n      :                                                               :\n      |                                                               |\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   n1 |                                                               |\n      +    Actual dest switch MAC     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n      |                               |                               |\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+     Downlink chassis MAC      +\n n1+8 |                                                               |\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\nn1+12 |                                                               |\n      +      Actual chassis MAC       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n      |                               |                               |\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +\nn1+20 |                                                               |\n      +                          Domain name                          +\n      :                                                               :\n      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n           n = 46 + length of known address TLV\n           n1 = n + length of Resolve list",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In the following description of the message fields, the term \"originating\" switch refers to the switch that issued the original Interswitch Resolve request. The term \"owner\" switch refers to that switch to which the destination endstation is attached. And the term \"responding\" switch refers to either the \"owner\" switch or to a switch at the end of the switch flood path that does not own the endstation but issues an Interswitch Resolve response because it has no downstream neighbors.",
      "ja": "メッセージフィールドの以下の説明において、用語「発信」スイッチは、元のスイッチ間の解決要求を発行したスイッチを指します。用語「所有者」スイッチは、宛先エンドステーションが接続されているそのスイッチを指します。そして、スイッチを「応答」という用語は、いずれかの「所有者」スイッチまたはそれは下流の隣人を持っていないため、応答を解決エンドステーションが、問題スイッチ間を所有していないスイッチ洪水のパスの最後にスイッチを指します。"
    },
    {
      "indent": 3,
      "text": "With the exception of the resolve list (which has a different size and format in a Resolve response message) and the four fields following the resolve list, all fields of an Interswitch Resolve message are allocated by the originating switch, and unless otherwise noted below, are written by the originating switch.",
      "ja": "（解決応答メッセージに異なるサイズ及びフォーマットを有する）解決リストの例外と解決リスト次の4つのフィールドと、スイッチ間の解決メッセージのすべてのフィールドは、発信スイッチによって割り当てられ、そうでなければ以下の注記がない限りされ発信スイッチによって書かれています。"
    },
    {
      "indent": 3,
      "text": "Frame header/ISMP packet header",
      "ja": "フレームヘッダー/ ISMPパケットヘッダ"
    },
    {
      "indent": 6,
      "text": "This 20-octet field contains the frame header and the ISMP packet header.",
      "ja": "この20オクテットフィールドは、フレームヘッダとISMPパケットヘッダを含んでいます。"
    },
    {
      "indent": 3,
      "text": "Version",
      "ja": "版"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the version number of the message type. This section describes version 3 of the Interswitch Resolve message.",
      "ja": "この2オクテットのフィールドは、メッセージタイプのバージョン番号が含まれています。このセクションでは、スイッチ間の解決メッセージのバージョン3を説明します。"
    },
    {
      "indent": 3,
      "text": "Opcode",
      "ja": "オペコード"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the operation code of the message. Valid values are as follows:",
      "ja": "この2オクテットのフィールドは、メッセージの動作コードを含みます。有効な値は次のとおりです："
    },
    {
      "indent": 9,
      "text": "1 The message is a Resolve request. 2 The message is a Resolve response. 3 (unused in Resolve messages) 4 (unused in Resolve messages)",
      "ja": "1メッセージは、解決要求です。 2メッセージが解決応答です。 （解決メッセージの未使用）4（解決メッセージの未使用）3"
    },
    {
      "indent": 6,
      "text": "The originating switch writes a value of 1 to this field, while the responding switch writes a value of 2.",
      "ja": "応答スイッチは2の値を書き込みながら、発信スイッチは、このフィールドに1の値を書き込みます。"
    },
    {
      "indent": 3,
      "text": "Status",
      "ja": "状態"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the status of a Resolve response message. Valid values are as follows:",
      "ja": "この2オクテットのフィールドは解決応答メッセージのステータスが含まれています。有効な値は次のとおりです："
    },
    {
      "indent": 9,
      "text": "0 The Resolve request succeeded (ResolveAck). 1 (unused) 2 The Resolve request failed (Unknown).",
      "ja": "0解決要求は（ResolveAck）成功しました。 1（未使用）2解決要求（不明）が失敗しました。"
    },
    {
      "indent": 6,
      "text": "This field is written by the responding switch.",
      "ja": "このフィールドは、応答スイッチによって書かれています。"
    },
    {
      "indent": 3,
      "text": "Call tag",
      "ja": "コールタグ"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the call tag of the endstation packet for which this Resolve request is issued. The call tag is a 16- bit value (generated by the originating switch) that uniquely identifies the packet.",
      "ja": "この2オクテットのフィールドは、この解決要求が発行されたエンドステーションパケットの呼び出しタグが含まれています。呼び出しタグを一意パケットを識別（発信スイッチによって生成される）16ビットの値です。"
    },
    {
      "indent": 3,
      "text": "Source MAC of packet",
      "ja": "パケットの送信元MAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the endstation that originated the packet identified by the call tag.",
      "ja": "この6オクテットのフィールドは、コールのタグで識別されるパケットを発信したエンドステーションの物理（MAC）アドレスが含まれています。"
    },
    {
      "indent": 3,
      "text": "Originating switch MAC",
      "ja": "発信スイッチMAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the switch that issued the original Resolve request.",
      "ja": "この6オクテットのフィールドは、元の解決要求を発行したスイッチの物理（MAC）アドレスが含まれています。"
    },
    {
      "indent": 3,
      "text": "Owner switch MAC",
      "ja": "所有者スイッチMAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the switch to which the destination endstation is attached -- that is, the switch that was able to resolve the requested addressing information. This field is written by the owner switch.",
      "ja": "、要求されたアドレス情報を解決することができたスイッチである - この6オクテットのフィールドは、宛先エンドステーションが接続されているスイッチの物理（MAC）アドレスを含みます。このフィールドは、所有者のスイッチによって書かれています。"
    },
    {
      "indent": 6,
      "text": "If the status of the response is Unknown, this field is irrelevant.",
      "ja": "応答のステータスが不明の場合、このフィールドは無関係です。"
    },
    {
      "indent": 3,
      "text": "Known destination address",
      "ja": "既知の送信先アドレス"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains the known attribute of the destination endstation address. This address is stored in Tag/Length/Value format.",
      "ja": "この可変長フィールドには、宛先エンドステーションアドレスの既知の属性が含まれています。このアドレスは、タグ/長さ/値の形式で格納されます。"
    },
    {
      "indent": 3,
      "text": "Count",
      "ja": "カウント"
    },
    {
      "indent": 6,
      "text": "This 1-octet field contains the number of address attributes requested or returned. This is the number of items in the resolve list.",
      "ja": "この1オクテットのフィールドは、要求されたか、返されたアドレスの属性の数が含まれています。これは、解決リスト内の項目の数です。"
    },
    {
      "indent": 3,
      "text": "Resolve list",
      "ja": "解決リスト"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains a list of the address attributes either requested by the originating switch or returned by the owner switch. Note that in a Resolve request message, this list contains only the tags of the requested address attributes. On the other hand, a Resolve response message with a status of ResolveAck contains the full TLV of each resolved address attribute. The number of entries in the list is specified in the count field.",
      "ja": "この可変長フィールドは、発信スイッチによって要求されたり、所有者のスイッチによって返されたいずれかの属性のアドレスのリストが含まれています。解決要求メッセージに、このリストは、要求されたアドレス属性のタグのみが含まれていることに注意してください。一方、ResolveAckの状況と解決応答メッセージは、各解決されたアドレス属性の完全なTLVが含まれています。リストのエントリ数は、カウント・フィールドで指定されています。"
    },
    {
      "indent": 6,
      "text": "In an Interswitch Resolve response message, this field is irrelevant if the status of the response is Unknown.",
      "ja": "スイッチ間解決応答メッセージに、このフィールドは、応答のステータスが不明の場合は無関係です。"
    },
    {
      "indent": 3,
      "text": "Actual destination switch MAC",
      "ja": "実際の宛先スイッチのMAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the actual switch within the chassis to which the endstation is attached. If the status of the response is Unknown, this field is irrelevant.",
      "ja": "この6オクテットフィールドは、エンドステーションが取り付けられているシャーシ内の実際のスイッチの物理（MAC）アドレスを含みます。応答のステータスが不明の場合、このフィールドは無関係です。"
    },
    {
      "indent": 3,
      "text": "Downlink chassis MAC",
      "ja": "ダウンリンクシャーシのMAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the downlink chassis. If the status of the response is Unknown, this field is irrelevant.",
      "ja": "この6オクテットフィールドは、ダウンリンクシャーシの物理（MAC）アドレスを含みます。応答のステータスが不明の場合、このフィールドは無関係です。"
    },
    {
      "indent": 3,
      "text": "Actual chassis MAC",
      "ja": "実際のシャーシMAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the uplink chassis. If the status of the response is Unknown, this field is irrelevant.",
      "ja": "この6オクテットフィールドは、アップリンクシャーシの物理（MAC）アドレスを含みます。応答のステータスが不明の場合、このフィールドは無関係です。"
    },
    {
      "indent": 3,
      "text": "Domain name",
      "ja": "ドメイン名"
    },
    {
      "indent": 6,
      "text": "This 16-octet field contains the ASCII name of the domain. If the status of the response is Unknown, this field is irrelevant.",
      "ja": "この16オクテットのフィールドは、ドメインのASCII名が含まれています。応答のステータスが不明の場合、このフィールドは無関係です。"
    },
    {
      "indent": 0,
      "text": "6.5 Interswitch New User Message",
      "section_title": true,
      "ja": "6.5スイッチ間の新しいユーザー・メッセージ"
    },
    {
      "indent": 3,
      "text": "The Interswitch New User message consists of a variable number of octets, as shown below:",
      "ja": "下記に示すように、スイッチ間の新しいユーザー・メッセージは、オクテットの可変数で構成されています。"
    },
    {
      "indent": 3,
      "text": "    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n00 |                                                               |\n   +                         Frame header /                        +\n   :                   ISMP packet header (type 5)                 :\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n20 |           Version             |            Opcode             |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n24 |            Status             |           Call Tag            |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n28 |                                                               |\n   +     Source MAC of packet      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n32 |                               |                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+     Originating switch MAC    +\n36 |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n40 |                                                               |\n   +   Previous owner switch MAC   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n44 |                               |                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +\n48 |                                                               :\n   :                    MAC address of new user                    +\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n70 |     Count     |                                               |\n   +-+-+-+-+-+-+-+-+                                               +\n74 |                          Resolve list                         |\n   :                                                               :\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In the following description of the message fields, the term \"originating\" switch refers to the switch that issued the original Interswitch New User request. The term \"previous owner\" switch refers to that switch to which the endstation was previously attached. And the term \"responding\" switch refers to either the \"previous owner\" switch or to a switch at the end of the switch flood path that did not own the endstation but issues an Interswitch New User response because it has no downstream neighbors.",
      "ja": "メッセージフィールドの以下の説明では、用語「発信元」スイッチは、元のスイッチ間の新規ユーザの要求を発行したスイッチを指します。用語「前所有者」スイッチは、エンドステーションが以前に取り付けたために、そのスイッチを指します。そして、スイッチを「応答」という用語は、「以前の所有者」スイッチのいずれかまたはそれが下流の隣人を持っていないので、エンドステーションが、問題のスイッチ間の新規ユーザの応答を所有していなかったスイッチ洪水のパスの最後にスイッチを指します。"
    },
    {
      "indent": 3,
      "text": "With the exception of the resolve list, all fields of an Interswitch New User message are allocated by the originating switch, and unless otherwise noted below, are written by the originating switch.",
      "ja": "解決リストの例外を除いて、スイッチ間の新規ユーザのメッセージのすべてのフィールドが、発信スイッチによって割り当てられ、そうでない場合は、以下の注記がない限り、発信スイッチによって書かれています。"
    },
    {
      "indent": 3,
      "text": "Frame header/ISMP packet header",
      "ja": "フレームヘッダー/ ISMPパケットヘッダ"
    },
    {
      "indent": 6,
      "text": "This 20-octet field contains the frame header and the ISMP packet header.",
      "ja": "この20オクテットフィールドは、フレームヘッダとISMPパケットヘッダを含んでいます。"
    },
    {
      "indent": 3,
      "text": "Version",
      "ja": "版"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the version number of the message type. This document describes ISMP message type 5, version 1.",
      "ja": "この2オクテットのフィールドは、メッセージタイプのバージョン番号が含まれています。この文書では、ISMPメッセージタイプ5、バージョン1を説明します。"
    },
    {
      "indent": 3,
      "text": "Opcode",
      "ja": "オペコード"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the operation code of the message. Valid values are as follows:",
      "ja": "この2オクテットのフィールドは、メッセージの動作コードを含みます。有効な値は次のとおりです："
    },
    {
      "indent": 9,
      "text": "1 (unused in a New User message) 2 (unused in a New User message) 3 The message is a New User request. 4 The message is a New User response.",
      "ja": "1（新しいユーザメッセージの未使用）2（新規ユーザメッセージの未使用）3メッセージは、新しいユーザの要求です。 4メッセージは、新しいユーザーの応答です。"
    },
    {
      "indent": 6,
      "text": "The originating switch writes a value of 3 to this field, while the responding switch writes a value of 4.",
      "ja": "応答スイッチは4の値を書き込みながら、発信スイッチは、このフィールドに3の値を書き込みます。"
    },
    {
      "indent": 3,
      "text": "Status",
      "ja": "状態"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the status of a New User response message. Valid values are as follows:",
      "ja": "この2オクテットのフィールドは、新しいユーザーの応答メッセージのステータスが含まれています。有効な値は次のとおりです："
    },
    {
      "indent": 9,
      "text": "0 VLAN resolution successful (NewUserAck) 1 (unused) 2 VLAN resolution unsuccessful (NewUserUnknown)",
      "ja": "失敗0 VLAN解像度成功（NewUserAck）1（未使用）2 VLAN解像度（NewUserUnknown）"
    },
    {
      "indent": 6,
      "text": "This field is written by the responding switch.",
      "ja": "このフィールドは、応答スイッチによって書かれています。"
    },
    {
      "indent": 3,
      "text": "Call tag",
      "ja": "コールタグ"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the call tag of the endstation packet for which this New User request is issued. The call tag is a 16- bit value (generated by the originating switch) that uniquely identifies the packet that caused the switch to identify the endstation as a new user.",
      "ja": "この2オクテットのフィールドは、この新しいユーザーの要求が発行されたエンドステーションパケットの呼び出しタグが含まれています。呼び出しタグを一意スイッチが新規ユーザーとしてエンドステーションを識別するために起因するパケットを識別（発信スイッチによって生成される）16ビットの値です。"
    },
    {
      "indent": 3,
      "text": "Source MAC of packet",
      "ja": "パケットの送信元MAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the endstation that originated the packet identified by the call tag.",
      "ja": "この6オクテットのフィールドは、コールのタグで識別されるパケットを発信したエンドステーションの物理（MAC）アドレスが含まれています。"
    },
    {
      "indent": 3,
      "text": "Originating switch MAC",
      "ja": "発信スイッチMAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the switch that issued the original New User request.",
      "ja": "この6オクテットのフィールドは、元の新規ユーザの要求を発行したスイッチの物理（MAC）アドレスが含まれています。"
    },
    {
      "indent": 3,
      "text": "Previous owner switch MAC",
      "ja": "前の所有者のスイッチのMAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the switch to which the endstation was previously attached -- that is, the switch that was able to resolve the VLAN information. This field is written by the previous owner switch.",
      "ja": "、VLAN情報を解決することができたスイッチである - この6オクテットフィールドは、エンドステーションが以前に装着したスイッチの物理（MAC）アドレスを含みます。このフィールドは、以前の所有者のスイッチによって書かれています。"
    },
    {
      "indent": 6,
      "text": "If the status of the response is Unknown, this field is irrelevant.",
      "ja": "応答のステータスが不明の場合、このフィールドは無関係です。"
    },
    {
      "indent": 3,
      "text": "MAC address of new user",
      "ja": "新規ユーザのMACアドレス"
    },
    {
      "indent": 6,
      "text": "This 24-octet field contains the physical (MAC) address of the new user endstation, stored in Tag/Length/Value format.",
      "ja": "この24オクテットのフィールドは、タグ/長さ/値の形式で保存された新しいユーザーエンドステーションの物理（MAC）アドレスが含まれています。"
    },
    {
      "indent": 3,
      "text": "Count",
      "ja": "カウント"
    },
    {
      "indent": 6,
      "text": "This 1-octet field contains the number of VLAN identifiers returned. This is the number of items in the resolve list. This field is written by the previous owner switch.",
      "ja": "この1オクテットのフィールドが返されたVLAN識別子の数が含まれています。これは、解決リスト内の項目の数です。このフィールドは、以前の所有者のスイッチによって書かれています。"
    },
    {
      "indent": 6,
      "text": "If the status of the response is Unknown, this field and the resolve list are irrelevant.",
      "ja": "応答のステータスが不明である場合は、このフィールドと決意リストは無関係です。"
    },
    {
      "indent": 3,
      "text": "Resolve list",
      "ja": "解決リスト"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains a list of the VLAN identifiers of all static VLANs to which the endstation belongs, stored in Tag/Length/Value format (see Section 2.3). The number of entries in the list is specified in the count field. This list is written by the previous owner switch.",
      "ja": "この可変長フィールドには、エンドステーションが属するすべての静的VLANを、タグ/長さ/値の形式で保存された（2.3節を参照）のVLAN識別子のリストが含まれています。リストのエントリ数は、カウント・フィールドで指定されています。このリストは、以前の所有者のスイッチによって書かれています。"
    },
    {
      "indent": 6,
      "text": "If the status of the response is Unknown, this field is irrelevant.",
      "ja": "応答のステータスが不明の場合、このフィールドは無関係です。"
    },
    {
      "indent": 0,
      "text": "6.6 Interswitch Tag-Based Flood Message",
      "section_title": true,
      "ja": "6.6スイッチ間のタグベースの洪水のメッセージ"
    },
    {
      "indent": 3,
      "text": "There are two versions of the Interswitch Tag-Based Flood message used by the SecureFast VLAN product.",
      "ja": "SecureFast VLAN製品で使用されるスイッチ間のタグベース洪水メッセージの2つのバージョンがあります。"
    },
    {
      "indent": 0,
      "text": "6.6.1 Prior to Version 1.8",
      "section_title": true,
      "ja": "6.6.1バージョン1.8より前"
    },
    {
      "indent": 3,
      "text": "The Interswitch Tag-Based Flood message used by SFVLAN prior to version 1.8 consists of a variable number of octets, as shown below:",
      "ja": "以下に示すように前のバージョン1.8にSFVLANによって使用されるスイッチ間のタグベースフラッドメッセージは、オクテットの可変数で構成されています。"
    },
    {
      "indent": 3,
      "text": "    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n00 |                                                               |\n   +                         Frame header /                        +\n   :                   ISMP packet header (type 7)                 :\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n20 |           Version             |            Opcode             |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n24 |            Status             |           Call Tag            |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n28 |                                                               |\n   +     Source MAC of packet      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n32 |                               |                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+     Originating switch MAC    +\n36 |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n40 |     Count     |                                               |\n   +-+-+-+-+-+-+-+-+                                               +\n44 |                           VLAN list                           |\n   :                                                               :\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n n |                                                               |\n   +                                                               +\n   :                        Original packet                        :\n   +                                                               +\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 9,
      "text": "n = 41 + length of VLAN list",
      "ja": "VLANリストのN = 41 +長さ"
    },
    {
      "indent": 3,
      "text": "Frame header/ISMP packet header",
      "ja": "フレームヘッダー/ ISMPパケットヘッダ"
    },
    {
      "indent": 6,
      "text": "This 20-octet field contains the frame header and the ISMP packet header.",
      "ja": "この20オクテットフィールドは、フレームヘッダとISMPパケットヘッダを含んでいます。"
    },
    {
      "indent": 3,
      "text": "Version",
      "ja": "版"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the version number of the message type. This document describes ISMP message type 7, version 1.",
      "ja": "この2オクテットのフィールドは、メッセージタイプのバージョン番号が含まれています。この文書では、ISMPメッセージタイプ7、バージョン1を説明します。"
    },
    {
      "indent": 3,
      "text": "Opcode",
      "ja": "オペコード"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the operation code of the message. The value here should be 1, indicating the message is a flood request.",
      "ja": "この2オクテットのフィールドは、メッセージの動作コードを含みます。ここでの値は、メッセージが洪水の要求であることを示す、1でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Status",
      "ja": "状態"
    },
    {
      "indent": 6,
      "text": "This 2-octet field is currently unused. It is reserved for future use.",
      "ja": "この2オクテットのフィールドには、現在使用されていません。これは、将来の使用のために予約されています。"
    },
    {
      "indent": 3,
      "text": "Call tag",
      "ja": "コールタグ"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the call tag of the endstation packet encapsulated within this tag-based flood message. The call tag is a 16-bit value (generated by the originating switch) that uniquely identifies the packet.",
      "ja": "この2オクテットのフィールドは、このタグベースの洪水のメッセージ内にカプセル化エンドステーションパケットの呼び出しタグが含まれています。呼び出しタグを一意パケットを識別（発信スイッチによって生成される）16ビットの値です。"
    },
    {
      "indent": 3,
      "text": "Source MAC of packet",
      "ja": "パケットの送信元MAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the endstation that originated the packet identified by the call tag.",
      "ja": "この6オクテットのフィールドは、コールのタグで識別されるパケットを発信したエンドステーションの物理（MAC）アドレスが含まれています。"
    },
    {
      "indent": 3,
      "text": "Originating switch MAC",
      "ja": "発信スイッチMAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the switch that issued the original tag-based flooded message.",
      "ja": "この6オクテットフィールドは、元のタグベースのフラッディングメッセージを発行したスイッチの物理（MAC）アドレスを含みます。"
    },
    {
      "indent": 3,
      "text": "Count",
      "ja": "カウント"
    },
    {
      "indent": 6,
      "text": "This 1-octet field contains the number of VLAN identifiers included in the VLAN list.",
      "ja": "この1オクテットのフィールドは、VLANリストに含まVLAN識別子の数が含まれています。"
    },
    {
      "indent": 3,
      "text": "VLAN list",
      "ja": "VLANリスト"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains a list of the VLAN identifiers of all VLANs to which the source endstation belongs. Each entry in this list has the following format:",
      "ja": "この可変長フィールドには、ソースエンドステーションが属するすべてのVLANのVLAN IDのリストが含まれています。このリストの各エントリの形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Value length  |                                               |\n+-+-+-+-+-+-+-+-+                                               +\n|                        VLAN identifier value                  |\n:                                                               :\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "The 1-octet value length field contains the length of the VLAN identifier. VLAN identifiers can be from 1 to 16 characters long.",
      "ja": "1オクテットの値の長さフィールドは、VLAN識別子の長さを含みます。 VLAN IDは1〜16文字であることができます。"
    },
    {
      "indent": 3,
      "text": "Original packet",
      "ja": "元のパケット"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains the original packet as sent by the source endstation.",
      "ja": "ソースエンドステーションによって送信されたように、この可変長フィールドには、元のパケットが含まれています。"
    },
    {
      "indent": 0,
      "text": "6.6.2 Version 1.8",
      "section_title": true,
      "ja": "6.6.2バージョン1.8"
    },
    {
      "indent": 3,
      "text": "The Interswitch Tag-Based Flood message used by SFVLAN version 1.8 consists of a variable number of octets, as shown below:",
      "ja": "以下に示すようにSFVLANバージョン1.8によって使用されるスイッチ間のタグベースフラッドメッセージは、オクテットの可変数で構成されています。"
    },
    {
      "indent": 6,
      "text": "Note:",
      "ja": "注意："
    },
    {
      "indent": 9,
      "text": "SFVLAN version 1.8 also recognizes the Interswitch Tag-Based Flood message as described in Section 6.6.1.",
      "ja": "6.6.1項で説明したようにSFVLANバージョン1.8はまた、スイッチ間のタグベース洪水のメッセージを認識します。"
    },
    {
      "indent": 3,
      "text": "    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n00 |                                                               |\n   +                         Frame header /                        +\n   :                   ISMP packet header (type 7)                 :\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n20 |       VLAN identifier         |           Version             |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n24 |           Opcode              |            Status             |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n28 |          Call tag             |                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+     Source MAC of packet      +\n32 |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n36 |                                                               |\n   +    Originating switch MAC     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n40 |                               |     Count     |               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+               +\n44 |                                                               |\n   :                           VLAN list                           :\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n n |                                                               |\n   +                                                               +\n   :                        Original packet                        :\n   +                                                               +\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 12,
      "text": "n = 41 + length of VLAN list",
      "ja": "VLANリストのN = 41 +長さ"
    },
    {
      "indent": 3,
      "text": "Frame header/ISMP packet header",
      "ja": "フレームヘッダー/ ISMPパケットヘッダ"
    },
    {
      "indent": 6,
      "text": "This 20-octet field contains the frame header and the ISMP packet header.",
      "ja": "この20オクテットフィールドは、フレームヘッダとISMPパケットヘッダを含んでいます。"
    },
    {
      "indent": 6,
      "text": "- The frame header source address contains a value of 02-00-1D-00-xx-yy, where xx-yy is a value set by the VLAN Manager application to tag the frame header with the VLAN identifier. This value ranges from 2 to 4095. For example, a value of 100 would be set as 00-64.",
      "ja": " - フレームヘッダの送信元アドレスは、XX-yyはVLAN識別子を持つフレームヘッダをタグ付けするVLANマネージャアプリケーションによって設定された値である02-00-1D-00-XX-YYの値を含みます。この値は例えば2から4095の範囲で、100の値が00から64に設定されることになります。"
    },
    {
      "indent": 6,
      "text": "- The frame header type field contains a value of 0x81FF. Note that this differs from all other ISMP messages.",
      "ja": " - フレームヘッダタイプフィールドは0x81FFの値を含みます。これは、他のすべてのISMPメッセージは異なることに注意してください。"
    },
    {
      "indent": 3,
      "text": "VLAN identifier",
      "ja": "VLAN識別"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the VLAN identifier of the packet source.",
      "ja": "この2オクテットのフィールドは、パケットの送信元のVLAN識別子が含まれています。"
    },
    {
      "indent": 3,
      "text": "Version",
      "ja": "版"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the version number of the message type. This section describes version 2 of the Interswitch Tag-Based Flood message.",
      "ja": "この2オクテットのフィールドは、メッセージタイプのバージョン番号が含まれています。このセクションでは、スイッチ間のタグベース洪水メッセージのバージョン2を説明します。"
    },
    {
      "indent": 3,
      "text": "Opcode",
      "ja": "オペコード"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the operation code of the message. Valid values here are as follows:",
      "ja": "この2オクテットのフィールドは、メッセージの動作コードを含みます。次のようにここでの有効な値は以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "1 The message is a flood request. The original packet is complete within this message.",
      "ja": "1メッセージは、洪水の要求です。元のパケットは、このメッセージ内で完了です。"
    },
    {
      "indent": 6,
      "text": "2 The message is a fragmented flood request. The first portion of the original packet is contained in this message.",
      "ja": "2メッセージは、断片化洪水要求です。元のパケットの第1の部分は、このメッセージに含まれています。"
    },
    {
      "indent": 6,
      "text": "3 The message is a fragmented flood request. The second portion of the original packet is contained in this message.",
      "ja": "3メッセージは、断片化洪水要求です。元のパケットの第2の部分は、このメッセージに含まれています。"
    },
    {
      "indent": 3,
      "text": "Status",
      "ja": "状態"
    },
    {
      "indent": 6,
      "text": "This 2-octet field is currently unused. It is reserved for future use.",
      "ja": "この2オクテットのフィールドには、現在使用されていません。これは、将来の使用のために予約されています。"
    },
    {
      "indent": 3,
      "text": "Call tag",
      "ja": "コールタグ"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the call tag of the endstation packet encapsulated within this tag-based flood message. The call tag is a 16-bit value (generated by the originating switch) that uniquely identifies the packet.",
      "ja": "この2オクテットのフィールドは、このタグベースの洪水のメッセージ内にカプセル化エンドステーションパケットの呼び出しタグが含まれています。呼び出しタグを一意パケットを識別（発信スイッチによって生成される）16ビットの値です。"
    },
    {
      "indent": 3,
      "text": "Source MAC of packet",
      "ja": "パケットの送信元MAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the endstation that originated the packet identified by the call tag.",
      "ja": "この6オクテットのフィールドは、コールのタグで識別されるパケットを発信したエンドステーションの物理（MAC）アドレスが含まれています。"
    },
    {
      "indent": 3,
      "text": "Originating switch MAC",
      "ja": "発信スイッチMAC"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the switch that issued the original tag-based flooded message.",
      "ja": "この6オクテットフィールドは、元のタグベースのフラッディングメッセージを発行したスイッチの物理（MAC）アドレスを含みます。"
    },
    {
      "indent": 3,
      "text": "Count",
      "ja": "カウント"
    },
    {
      "indent": 6,
      "text": "This 1-octet field contains the number of VLAN identifiers included in the VLAN list.",
      "ja": "この1オクテットのフィールドは、VLANリストに含まVLAN識別子の数が含まれています。"
    },
    {
      "indent": 3,
      "text": "VLAN list",
      "ja": "VLANリスト"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains a list of the VLAN identifiers of all VLANs to which the source endstation belongs. Each entry in this list has the following format:",
      "ja": "この可変長フィールドには、ソースエンドステーションが属するすべてのVLANのVLAN IDのリストが含まれています。このリストの各エントリの形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Value length  |                                               |\n+-+-+-+-+-+-+-+-+                                               +\n|                        VLAN identifier value                  |\n:                                                               :\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "The 1-octet value length field contains the length of the VLAN identifier. VLAN identifiers can be from 1 to 16 characters long.",
      "ja": "1オクテットの値の長さフィールドは、VLAN識別子の長さを含みます。 VLAN IDは1〜16文字であることができます。"
    },
    {
      "indent": 3,
      "text": "Original packet",
      "ja": "元のパケット"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains the original packet as sent by the source endstation.",
      "ja": "ソースエンドステーションによって送信されたように、この可変長フィールドには、元のパケットが含まれています。"
    },
    {
      "indent": 0,
      "text": "6.7 Interswitch Tap/Untap Message",
      "section_title": true,
      "ja": "6.7スイッチ間をタップ/アンタップメッセージ"
    },
    {
      "indent": 3,
      "text": "The Interswitch Tap/Untap message consists of a variable number of octets, as shown below:",
      "ja": "以下に示すようにスイッチ間タップ/アンタップメッセージは、オクテットの可変数で構成されています。"
    },
    {
      "indent": 3,
      "text": "    0                   1                   2                   3\n    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n00 |                                                               |\n   +                         Frame header /                        +\n   :                   ISMP packet header (type 8)                 :\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n20 |            Version            |            Opcode             |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n24 |             Status            |          Error code           |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n28 |           Header type         |         Header length         |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n32 |            Direction          |                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+       Probe switch MAC        +\n36 |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n40 |                           Probe port                          |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n44 |                                                               |\n   +                                                               +\n48 |                           (Reserved)                          |\n   +                                                               +\n52 |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n56 |                                                               |\n   +                                                               +\n   |                             Header                            |\n   +                                                               +\n   |                                                               |\n   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Frame header/ISMP packet header",
      "ja": "フレームヘッダー/ ISMPパケットヘッダ"
    },
    {
      "indent": 6,
      "text": "This 20-octet field contains the frame header and the ISMP packet header.",
      "ja": "この20オクテットフィールドは、フレームヘッダとISMPパケットヘッダを含んでいます。"
    },
    {
      "indent": 3,
      "text": "Version",
      "ja": "版"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the version number of the message type. This document describes ISMP message type 8, version 1.",
      "ja": "この2オクテットのフィールドは、メッセージタイプのバージョン番号が含まれています。この文書では、ISMPメッセージタイプ8、バージョン1を説明します。"
    },
    {
      "indent": 3,
      "text": "Opcode",
      "ja": "オペコード"
    },
    {
      "indent": 6,
      "text": "tet field contains the operation type of the message. ues are as follows:",
      "ja": "TETフィールドは、メッセージの動作タイプが含まれています。次のようにUEは以下のとおりです。"
    },
    {
      "indent": 9,
      "text": "1 The message is a Tap request. 2 The message is a Tap response. 3 The message is an Untap request. 4 The message is an Untap response.",
      "ja": "1メッセージは、タップ要求です。 2メッセージは、タップ応答です。 3メッセージはアンタップ要求です。 4メッセージはアンタップ応答です。"
    },
    {
      "indent": 3,
      "text": "Status",
      "ja": "状態"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the current status of the tap request. Valid values are as follows:",
      "ja": "この2オクテットのフィールドは、タップ要求の現在の状態が含まれています。有効な値は次のとおりです："
    },
    {
      "indent": 9,
      "text": "1 Switch must disable outport on untap. (DisableOutport) 2 Switch must keep outports on untap. (KeepOutport) 3 Probe not found this leg of spanning tree. (ProbeNotFound) 4 Still searching for probe switch. (OutportDecisionUnknown) 5 Unassigned. (StatusUnassigned) 6 (reserved) 7 (reserved) 8 (reserved) 9 (reserved)",
      "ja": "1つのスイッチはアンタップ上のアウトポートを無効にする必要があります。 （DisableOutport）2スイッチはアンタップ上のOutportを維持する必要があります。 （KeepOutport）3プローブは、スパニングツリーのこの足が見つかりません。 （ProbeNotFound）図4は、さらに、プローブスイッチを探し。 （OutportDecisionUnknown）5未使用。 （StatusUnassigned）6（予約）7（予約）8（予約）9（予約）"
    },
    {
      "indent": 6,
      "text": "See Section 5.2.3 for details on the use of this field.",
      "ja": "このフィールドの使用の詳細については、5.2.3項を参照してください。"
    },
    {
      "indent": 3,
      "text": "Error code",
      "ja": "エラーコード"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the response message error code of the requested operation. Valid values are as follows:",
      "ja": "この2オクテットのフィールドは、要求された操作の応答メッセージのエラーコードが含まれています。有効な値は次のとおりです："
    },
    {
      "indent": 9,
      "text": "1 Operation successful. (NoError) 2 No response heard from downstream neighbor. (Timeout) 3 Port does not exist on probe switch. (BadPort) 4 Message invalid. (InvalidMessage) 5 Version number invalid. (IncompatibleVersions)",
      "ja": "1つの操作に成功。 （NOERROR）川下の隣人から聞い2応答がありません。 （タイムアウト）3ポートは、プローブのスイッチに存在しません。無効（BadPort）4メッセージ。 （InvalidMessage）5バージョン番号無効。 （IncompatibleVersions）"
    },
    {
      "indent": 3,
      "text": "Header type",
      "ja": "ヘッダタイプ"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the type of information contained in the header field. Currently, valid values are as follows:",
      "ja": "この2オクテットフィールドは、ヘッダフィールドに含まれる情報のタイプを含みます。次のように現在、有効な値は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "1 (reserved) 2 Header contains destination and source endstation MAC addresses.",
      "ja": "1（予約）2ヘッダーは、宛先及びソースエンドステーションのMACアドレスを含みます。"
    },
    {
      "indent": 3,
      "text": "Header length",
      "ja": "ヘッダ長"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains the length of the header field. Currently, this field always contains a value of 12.",
      "ja": "この2オクテットフィールドは、ヘッダフィールドの長さを含みます。現在、このフィールドは常に12の値が含まれています。"
    },
    {
      "indent": 3,
      "text": "Direction",
      "ja": "方向"
    },
    {
      "indent": 6,
      "text": "This 2-octet field contains a value indicating the type of tap. Valid values are as follows:",
      "ja": "この2オクテットフィールドは、タップの種類を示す値を含みます。有効な値は次のとおりです："
    },
    {
      "indent": 6,
      "text": "1 (reserved) 2 Tap is bi-directional and data should be captured flowing in either direction over the connection. 3 Tap is uni-directional and data should be captured only when it flows from the source to the destination.",
      "ja": "1（予約）2タップは、双方向であり、データが接続を介していずれかの方向に流れる取り込まれるべきです。 3タップは一方向であり、それはソースから宛先に流れるときにのみデータがキャプチャされるべきです。"
    },
    {
      "indent": 3,
      "text": "Probe switch MAC",
      "ja": "プローブは、MACを切り替えます"
    },
    {
      "indent": 6,
      "text": "This 6-octet field contains the physical (MAC) address of the switch to which the probe is attached.",
      "ja": "この6オクテットフィールドは、プローブが接続されているスイッチの物理（MAC）アドレスを含みます。"
    },
    {
      "indent": 3,
      "text": "Probe port",
      "ja": "プローブポート"
    },
    {
      "indent": 6,
      "text": "This 4-octet field contains the logical port number (on the probe switch) to which the probe is attached.",
      "ja": "この4オクテットフィールドは、プローブが取り付けられる（プローブスイッチオン）論理ポート番号が含まれています。"
    },
    {
      "indent": 3,
      "text": "Reserved",
      "ja": "予約済み"
    },
    {
      "indent": 6,
      "text": "These 12 octets are reserved.",
      "ja": "これらの12個のオクテットは予約されています。"
    },
    {
      "indent": 3,
      "text": "Header",
      "ja": "ヘッダ"
    },
    {
      "indent": 6,
      "text": "This variable-length field contains the header that identifies the connection being tapped. The length of the header is stored in the length field.",
      "ja": "この可変長フィールドは、タップされた接続を識別するヘッダを含んでいます。ヘッダの長さは、長さフィールドに格納されます。"
    },
    {
      "indent": 6,
      "text": "Currently, this field is 12 octets long and contains the 6-octet physical address of the connection's destination endstation, followed by the 6-octet physical address of the connection's source endstation, as shown below:",
      "ja": "現在、このフィールドは12オクテット長であり、以下に示すように、接続のソースエンドステーションの6オクテットの物理アドレスに続いて、接続の宛先エンドステーション、の6オクテットの物理アドレスが含まれています。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n+    Destination MAC address    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                               |                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+      Source MAC address       +\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Requested call connections are established or denied based on the VLAN policy of the source and destination addresses specified within the packet. Section 4.4.1 discusses this process in detail.",
      "ja": "要求された呼接続が確立またはパケット内で指定された送信元アドレスと宛先アドレスのVLANポリシーに基づいて拒否されます。 4.4.1項では詳細にこのプロセスを説明します。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 3,
      "text": "[RFC1700] Reynolds, J. and J. Postel, \"Assigned Numbers\", STD 2, RFC 1700, October 1994.",
      "ja": "[RFC1700]レイノルズ、J.およびJ.ポステル、 \"割り当て番号\"、STD 2、RFC 1700、1994年10月。"
    },
    {
      "indent": 3,
      "text": "[IEEE] \"IEEE Standard 802.1d -- 1990\"",
      "ja": "[IEEE] \"IEEE標準802.1D  -  1990\""
    },
    {
      "indent": 3,
      "text": "[IDvlsp] Kane, L., \"Cabletron's VLS Protocol Specification\", RFC 2642, August 1999.",
      "ja": "[IDvlsp]ケイン、L.、 \"CabletronのVLSプロトコル仕様\"、RFC 2642、1999年8月。"
    },
    {
      "indent": 3,
      "text": "[IDhello] Hamilton, D. and D. Ruffen, \"Cabletron's VlanHello Protocol Specification\", RFC 2641, August 1999.",
      "ja": "[IDhello]ハミルトン、D.とD. Ruffen、 \"CabletronのVlanHelloプロトコル仕様\"、RFC 2641、1999年8月。"
    },
    {
      "indent": 0,
      "text": "9. Authors' Addresses",
      "section_title": true,
      "ja": "9.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dave Ruffen Cabletron Systems, Inc. Post Office Box 5005 Rochester, NH 03866-5005",
      "ja": "デイブRuffen Cabletron Systems、Inc.の私書箱5005ロチェスター、NH 03866から5005"
    },
    {
      "indent": 3,
      "text": "Phone: (603) 332-9400 EMail: ruffen@ctron.com",
      "ja": "電話：（603）332-9400 Eメール：ruffen@ctron.com"
    },
    {
      "indent": 3,
      "text": "Ted Len Cabletron Systems, Inc. Post Office Box 5005 Rochester, NH 03866-5005",
      "ja": "テッド・レンCabletron Systems、Inc.の私書箱5005ロチェスター、NH 03866から5005"
    },
    {
      "indent": 3,
      "text": "Phone: (603) 332-9400 EMail: len@ctron.com",
      "ja": "電話：（603）332-9400 Eメール：len@ctron.com"
    },
    {
      "indent": 3,
      "text": "Judy Yanacek Cabletron Systems, Inc. Post Office Box 5005 Rochester, NH 03866-5005",
      "ja": "ジュディYanacek Cabletron Systems、Inc.の私書箱5005ロチェスター、NH 03866から5005"
    },
    {
      "indent": 3,
      "text": "Phone: (603) 332-9400 EMail: jyanacek@ctron.com",
      "ja": "電話：（603）332-9400 Eメール：jyanacek@ctron.com"
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "ja": "10.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}