{
  "title": {
    "text": "RFC 2592 - Definitions of Managed Objects for the Delegation of Management Script",
    "ja": "RFC 2592 - 管理スクリプトの委任のための管理対象オブジェクトの定義"
  },
  "number": 2592,
  "created_at": "2019-10-27 06:43:38.170260+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            D. Levi\nRequest for Comments: 2592                               Nortel Networks\nCategory: Standards Track                               J. Schoenwaelder\n                                                         TU Braunschweig\n                                                                May 1999",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Definitions of Managed Objects for the\n   Delegation of Management Scripts",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes a set of managed objects that allow the delegation of management scripts to distributed managers.",
      "ja": "このメモは、インターネットコミュニティでのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、分散管理者に管理スクリプトの委任を許可する管理対象オブジェクトの集合を記述する。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction .................................................   2\n2. The SNMP Management Framework ................................   2\n3. Overview .....................................................   3\n3.1 Terms ......................................................    4\n4. Requirements and Design Issues ..............................    5\n4.1 Script Languages ...........................................    5\n4.2 Script Transfer ............................................    6\n4.3 Script Execution ...........................................    7\n5. The Structure of the MIB .....................................   8\n5.1 The smLanguageGroup ........................................    9\n5.2 The smScriptGroup ..........................................    9\n5.3 The smCodeGroup ............................................   10\n5.4 The smLaunchGroup ..........................................   10\n5.5 The smRunGroup .............................................   11\n6 Definitions ..................................................   11\n7. Usage Examples ...............................................  41\n7.1 Pushing a script via SNMP ..................................   41",
      "raw": true
    },
    {
      "indent": 3,
      "text": "7.2 Pulling a script from a URL ................................   42\n7.3 Modifying an existing script ...............................   42\n7.4 Removing an existing script ................................   43\n7.5 Creating a launch button ...................................   43\n7.6 Launching a script .........................................   44\n7.7 Terminating a script .......................................   44\n7.8 Removing a launch button ...................................   45\n8. VACM Configuration Examples ..................................  45\n8.1 Sandbox for guests .........................................   45\n8.2 Sharing scripts ............................................   46\n8.3 Emergency scripts ..........................................   47\n9. IANA Considerations ..........................................  48\n10. Security Considerations .....................................  48\n11. Intellectual Property .......................................  49\n12.  Acknowledgments ............................................. 49\n13. References ..................................................  50\n14. Editors' Addresses ..........................................  52\n16. Full Copyright Statement ....................................  53",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes a set of managed objects that allow the delegation of management scripts to distributed managers.",
      "ja": "このメモは、インターネットコミュニティでのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、分散管理者に管理スクリプトの委任を許可する管理対象オブジェクトの集合を記述する。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [21].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119 [21]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. The SNMP Management Framework",
      "section_title": true,
      "ja": "2. SNMP管理フレームワークに"
    },
    {
      "indent": 3,
      "text": "The SNMP Management Framework presently consists of five major components:",
      "ja": "SNMP Management Frameworkは現在、5つの主要コンポーネントから構成されています。"
    },
    {
      "indent": 6,
      "text": "o An overall architecture, described in RFC 2271 [1].",
      "ja": "RFC 2271に記載され、全体的なアーキテクチャ、O [1]。"
    },
    {
      "indent": 6,
      "text": "o Mechanisms for describing and naming objects and events for the purpose of management. The first version of this Structure of Management Information (SMI) is called SMIv1 and described in STD 16, RFC 1155 [2], STD 16, RFC 1212 [3] and RFC 1215 [4]. The second version, called SMIv2, is described in STD 58, RFC 2578 [5], RFC 2579 [6] and RFC 2580 [7].",
      "ja": "管理の目的のためにオブジェクトとイベントを記述し、命名するためのメカニズムO。管理情報（SMI）のこのような構造の最初のバージョンはSTD 16、[2]でSMIv1と呼ばれ、STD 16、RFC 1155に記載され、RFC 1212 [3]及びRFC 1215 [4]。第二のSMIv2と呼ばれるバージョン、STD 58、RFC 2578に記載されている[5]、RFC 2579 [6]およびRFC 2580 [7]。"
    },
    {
      "indent": 6,
      "text": "o Message protocols for transferring management information. The first version of the SNMP message protocol is called SNMPv1 and described in STD 15, RFC 1157 [8]. A second version of the SNMP message protocol, which is not an Internet standards track protocol, is called SNMPv2c and described in RFC 1901 [9] and RFC 1906 [10]. The third version of the message protocol is called SNMPv3 and described in RFC 1906 [10], RFC 2272 [11] and RFC 2274 [12].",
      "ja": "管理情報を転送するためのOメッセージプロトコル。 SNMPメッセージプロトコルの最初のバージョンは、[8]のSNMPv1と呼ばれ、STD 15、RFC 1157に記載されています。インターネット標準トラックプロトコルでないSNMPメッセージプロトコルの第2のバージョンは、SNMPv2cのと呼ばれ、RFC 1901年に記載されている[9]およびRFC 1906 [10]。メッセージプロトコルの第三のバージョンのSNMPv3と呼ばれ、RFC 1906年に記載されている[10]、RFC 2272 [11]およびRFC 2274 [12]。"
    },
    {
      "indent": 6,
      "text": "o Protocol operations for accessing management information. The first set of protocol operations and associated PDU formats is described in STD 15, RFC 1157 [8]. A second set of protocol operations and associated PDU formats is described in RFC 1905 [13].",
      "ja": "管理情報にアクセスするためのOプロトコル操作。プロトコル操作と関連PDU形式の第一セットは、STD 15、RFC 1157に記載されている[8]。プロトコル操作と関連PDU形式の第2のセットは、RFC 1905 [13]に記載されています。"
    },
    {
      "indent": 6,
      "text": "o A set of fundamental applications described in RFC 2273 [14] and the view-based access control mechanism described in RFC 2275 [15].",
      "ja": "O RFC 2273 [14]とビューベースアクセス制御メカニズムに記載の基本的なアプリケーションのセットは、RFC 2275 [15]に記載します。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. Objects in the MIB are defined using the mechanisms defined in the SMI.",
      "ja": "管理対象オブジェクトが仮想情報店を介してアクセスされ、管理情報ベースまたはMIBと呼ばれます。 MIBのオブジェクトは、SMIで定義されたメカニズムを使用して定義されています。"
    },
    {
      "indent": 3,
      "text": "MIB conforming to the SMIv1 can be produced through the appropriate translations. The resulting translated MIB must be semantically equivalent, except where objects or events are omitted because no translation is possible (use of Counter64). Some machine readable information in SMIv2 will be converted into textual descriptions in SMIv1 during the translation process. However, this loss of machine readable information is not considered to change the semantics of the MIB.",
      "ja": "SMIv1に従うMIBは、適切な翻訳を介して製造することができます。得られた翻訳されたMIBには翻訳（Counter64のの使用）が可能ではないので、オブジェクトまたはイベントが省略されている場合を除いて、意味的に等価でなければなりません。 SMIv2のいくつかの機械読み取り可能な情報には、翻訳プロセスの間、SMIv1の原文の記述に変換されます。しかし、機械読み取り可能な情報のこの損失がMIBの意味論を変えると考えられません。"
    },
    {
      "indent": 0,
      "text": "3. Overview",
      "section_title": true,
      "ja": "3.概要"
    },
    {
      "indent": 3,
      "text": "The Script MIB module defined in this memo can be used to delegate management functions to distributed managers. Management functions are defined as management scripts written in a management scripting language. This MIB makes no assumptions about the language itself and even allows distribution of compiled native code, if an implementation is able to execute native code under the control of this MIB.",
      "ja": "このメモで定義されたスクリプトMIBモジュールは、分散マネージャに管理機能を委任するために使用することができます。管理機能は、管理スクリプト言語で記述された管理スクリプトとして定義されています。このMIBは、言語自体について何ら仮定を行わず、実装は、このMIBの制御下でネイティブコードを実行することができる場合であっても、コンパイルされたネイティブコードの配布を可能にします。"
    },
    {
      "indent": 3,
      "text": "The Script MIB defines a standard interface for the delegation of management functions based on the Internet management framework. In particular, it provides the following capabilities:",
      "ja": "スクリプトMIBは、インターネット管理フレームワークに基づいた管理機能の委任のための標準インターフェースを定義します。特に、次の機能を提供します。"
    },
    {
      "indent": 3,
      "text": "1. Capabilities to transfer management scripts to a distributed manager.",
      "ja": "1.機能は、分散管理者に管理スクリプトを転送します。"
    },
    {
      "indent": 3,
      "text": "2. Capabilities for initiating, suspending, resuming and terminating management scripts.",
      "ja": "管理スクリプトを開始、一時停止、再開、および終了するための2機能。"
    },
    {
      "indent": 3,
      "text": "3. Capabilities to transfer arguments for management scripts.",
      "section_title": true,
      "ja": "3.機能は、管理スクリプトの引数を転送します。"
    },
    {
      "indent": 3,
      "text": "4. Capabilities to monitor and control running management scripts.",
      "section_title": true,
      "ja": "4.機能を監視するために、制御は管理スクリプトを実行しています。"
    },
    {
      "indent": 3,
      "text": "5. Capabilities to transfer the results produced by running management scripts.",
      "ja": "5.機能は、管理スクリプトを実行することによって生成された結果を転送します。"
    },
    {
      "indent": 3,
      "text": "This memo does not address any additional topics like the generation of notifications or how to address remote agents from a Script MIB implementation.",
      "ja": "このメモは通知の生成方法やスクリプトMIBの実装からリモートエージェントに対処するためのような任意の追加のトピックを扱っていません。"
    },
    {
      "indent": 0,
      "text": "3.1. Terms",
      "section_title": true,
      "ja": "3.1. 条項"
    },
    {
      "indent": 3,
      "text": "This section defines the terms used throughout this memo.",
      "ja": "このセクションでは、このメモ全体で使用される用語を定義します。"
    },
    {
      "indent": 3,
      "text": "o A `distributed manager' is a processing entity which is capable of performing network management functions. For the scope of this memo, a distributed manager is assumed to implement the Script MIB.",
      "ja": "O `分散マネージャは、」ネットワーク管理機能を実行することができる処理エンティティです。このメモの範囲のために、分散管理者は、スクリプトMIBを実装するものとします。"
    },
    {
      "indent": 3,
      "text": "o A `higher-level manager', or just `manager', is a processing entity or human who initiates and controls the operations performed by one or more distributed managers.",
      "ja": "`上位マネージャO「または単に`マネージャ」、一つ以上の分散マネージャの動作を開始し、制御処理エンティティまたはヒトです。"
    },
    {
      "indent": 3,
      "text": "o A `management script' is a set of instructions written in an executable language which implements a management function.",
      "ja": "O `管理スクリプトは、」管理機能を実現する実行可能な言語で記述された命令のセットです。"
    },
    {
      "indent": 3,
      "text": "o A `management scripting language' is a language used to write management scripts. Note, the term scripting language does not imply that the language must have the characteristics of scripting languages (e.g. string orientation, interpretation, weak typing). The MIB defined in this memo also allows to control management scripts written in arbitrary compiled system programming languages.",
      "ja": "O `管理スクリプト言語は、」管理スクリプトを記述するために使用される言語です。注意、長期スクリプト言語は、言語はスクリプト言語（例えば、文字列の向き、解釈、弱い型付け）の特性を持っていなければならないことを意味するものではありません。このメモで定義されたMIBはまた、任意のコンパイルされたシステムのプログラミング言語で書かれた管理スクリプトを制御することができます。"
    },
    {
      "indent": 3,
      "text": "o A `distributed manager' can be decomposed into an `SNMP entity' which implements the Script MIB defined in this memo and the `runtime system' that executes scripts. The Script MIB sees the runtime system as the managed resource which is controlled by the MIB.",
      "ja": "O `分散マネージャは、このメモで定義されたスクリプトMIBとスクリプトを実行する`ランタイムシステム」を実装「`SNMPエンティティに分解することができます」。スクリプトMIBは、MIBによって制御されている管理対象リソースとしてのランタイムシステムを見ています。"
    },
    {
      "indent": 8,
      "text": "The runtime system can act as an SNMP application, according to\nthe SNMP architecture defined in RFC 2271 [1]. For example, a\nruntime system which sends SNMP requests to other SNMP entities\nwill act as a command generator application. The SNMP applications in the runtime system may use the same SNMP engine\nwhich also serves the command responder application used to\nimplement the Script MIB, but they are not required to do so.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o A `launch button' is the conceptual button used to start the execution of a management script. It assignes control parameters to a management script. In particular, it defines the ownership of the scripts started from a launch button. The ownership can be used by the language runtime system to enforce security profiles on a running management script.",
      "ja": "O `起動ボタンは、」管理スクリプトの実行を開始するために使用概念のボタンです。これは、管理スクリプトに制御パラメータをassignes。特に、スクリプトの所有権は、起動ボタンから起動を定義します。所有権が実行している管理スクリプトのセキュリティプロファイルを適用するために、言語のランタイムシステムで使用することができます。"
    },
    {
      "indent": 0,
      "text": "4. Requirements and Design Issues",
      "section_title": true,
      "ja": "4.要件と設計上の問題"
    },
    {
      "indent": 3,
      "text": "This section discusses some general requirements that have influenced the design of the Script MIB.",
      "ja": "このセクションでは、スクリプトMIBのデザインに影響を与えたいくつかの一般的な要件について説明します。"
    },
    {
      "indent": 3,
      "text": "o The Script MIB must not make any assumptions about specific languages or runtime systems.",
      "ja": "OスクリプトMIBは、特定の言語やランタイムシステムについての仮定をしてはいけません。"
    },
    {
      "indent": 3,
      "text": "o The Script MIB must provide mechanisms that help to avoid new management problems (e.g. script version problems).",
      "ja": "OスクリプトMIBは、新しい管理上の問題（例えば、スクリプト・バージョンの問題を）避けるために役立つメカニズムを提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The Script MIB must provide SNMP interfaces to all functions required to delegate management scripts. However, other protocols might be used in addition if they provide a significant improvement in terms of convenience for implementation or performance.",
      "ja": "OスクリプトMIBは、管理スクリプトを委任するために必要なすべての機能へのSNMPインターフェースを提供する必要があります。彼らは、実装やパフォーマンスのための利便性の面で大幅な改善を提供する場合しかし、他のプロトコルを追加して使用される可能性があります。"
    },
    {
      "indent": 3,
      "text": "o The Script MIB must be organized so that access can be controlled effectively by using view-based access control [15].",
      "ja": "アクセスは、ビューベースのアクセス制御を使用することによって効果的に制御することができるように、OスクリプトMIBは、[15]に編成されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The following sections discuss some design issues in more detail.",
      "ja": "次のセクションでは、より詳細にいくつかの設計上の問題を議論します。"
    },
    {
      "indent": 0,
      "text": "4.1. Script Languages",
      "section_title": true,
      "ja": "4.1. スクリプト言語"
    },
    {
      "indent": 3,
      "text": "The Script MIB defined in this memo makes no assumption about the script language. This MIB can therefore be used in combination with different languages (such as Tcl or Java) and/or different versions of the same language. No assumptions are made about the format in which management scripts are transferred.",
      "ja": "このメモで定義されたスクリプトMIBは、スクリプト言語についての仮定を行いません。このMIBは、したがって、（例えばTclのまたはJavaのような）別の言語、および/または同じ言語の異なるバージョンと組み合わせて使用​​することができます。何の仮定は、管理スクリプトが転送されるフォーマットについて行われていません。"
    },
    {
      "indent": 3,
      "text": "The Script MIB provides access to information about the language versions supported by a Script MIB implementation so that a manager can learn about the capabilities provided by an implementation. Languages and language versions are identified as follows:",
      "ja": "スクリプトMIBは、管理者は、実装によって提供される機能について学ぶことができるようにスクリプトMIBの実装でサポートされている言語バージョンに関する情報へのアクセスを提供します。次のように言語と言語のバージョンが識別されます。"
    },
    {
      "indent": 3,
      "text": "1. The language is identified by an object identifier. Object identifier for well-known languages will be registered by the Internet Assigned Numbers Authority (IANA). Enterprise specific languages can also be registered in the enterprise specific OID subtree.",
      "ja": "1言語は、オブジェクト識別子によって識別されます。よく知られている言語のオブジェクト識別子は、Internet Assigned Numbers Authority（IANA）によって登録されます。エンタープライズ固有の言語はまた、企業固有のOIDサブツリーに登録することができます。"
    },
    {
      "indent": 3,
      "text": "2. A particular version of a language is identified by a language version number. The combination of a language object identifier and a language version is in most cases sufficient to decide whether a script can be executed or not.",
      "ja": "2.言語の特定のバージョンは、言語バージョン番号によって識別されます。言語オブジェクト識別子および言語バージョンの組み合わせは、スクリプトが実行できるかどうかを判断するために、ほとんどのケースで十分です。"
    },
    {
      "indent": 3,
      "text": "3. Different implementations of the same language version might have differences due to ambiguities in the language definition or additional language features provided by an implementor. An additional object identifier value is provided which identifies the organization which provides the implementation of a language. This might be used by scripts that require a particular implementation of a language.",
      "ja": "同じ言語バージョンの3異なる実装は、言語定義における曖昧か実装によって提供される追加の言語機能による違いがあるかもしれません。追加のオブジェクト識別子の値は、言語の実装を提供する組織を識別するが提供されます。これは、言語の特定の実装を必要とするスクリプトによって使用される可能性があります。"
    },
    {
      "indent": 3,
      "text": "4. Finally, there might be different versions of a language implementation. A version number for the language implementation is provided so that the manager can also distinguish between different implementations from the same organization of a particular language version.",
      "ja": "4.最後に、言語の実装の異なるバージョンがある可能性があります。マネージャは、特定の言語バージョンの同じ組織からの異なる実装を区別できるように、言語実装のバージョン番号が提供されます。"
    },
    {
      "indent": 3,
      "text": "The version numbers can either be used by a manager to select the language version required to execute a particular script or to select a script that fits the language versions supported by a particular Script MIB implementation.",
      "ja": "バージョン番号は、いずれかの特定のスクリプトを実行するか、特定のスクリプトMIBの実装によってサポートされている言語のバージョンに合ったスクリプトを選択するために必要な言語バージョンを選択するために管理者が使用することができます。"
    },
    {
      "indent": 3,
      "text": "An additional table lists language extensions that provide features not provided by the core language. Language extensions are usually required to turn a general purpose language into a management language. In many cases, language extensions will come in the form of libraries that provide capabilities like sending SNMP requests to remote SNMP agents or accessing the local MIB instrumentation. Every extension is associated with a language and carries its own version numbers.",
      "ja": "追加のテーブルには、コア言語で提供されていない機能を提供する言語拡張を示しています。言語拡張は、通常、管理言語に汎用言語をオンにする必要があります。多くの場合、言語拡張は、リモートSNMPエージェントにSNMP要求を送信するか、ローカルMIB計装へのアクセスなどの機能を提供するライブラリの形で来ます。すべての拡張は、言語に関連付けられており、独自のバージョン番号を運びます。"
    },
    {
      "indent": 0,
      "text": "4.2. Script Transfer",
      "section_title": true,
      "ja": "4.2. スクリプト転送"
    },
    {
      "indent": 3,
      "text": "There are two different ways to transfer management scripts to a distributed manager. The first approach requires that the manager pushes the script to the distributed manager. This is therefore called the `push model'. The second approach is the `pull model' where the manager tells the distributed manager the location of the script and the distributed manager retrieves the script itself.",
      "ja": "分散管理者に管理スクリプトを転送するには、2つの異なる方法があります。最初のアプローチは、管理者は、分散管理者にスクリプトをプッシュすることが必要です。したがって、これは、 `プッシュモデル」と呼ばれます。第2のアプローチは、管理者がスクリプトの位置と分散マネージャは、スクリプト自体を検索分散マネージャに指示 `プルモデル」です。"
    },
    {
      "indent": 3,
      "text": "The MIB defined in this memo supports both models. The `push model' is realized by a table which allows a manager to write scripts by sending a sequence of SNMP set requests. The script can be split into several fragments in order to deal with SNMP message size limitations.",
      "ja": "このメモで定義されたMIBは、両方のモデルをサポートしています。 `プッシュモデルは、」管理者がSNMP SET要求のシーケンスを送信することにより、スクリプトを書くことができますテーブルによって実現されます。このスクリプトは、SNMPメッセージのサイズ制限に対処するために、いくつかの断片に分割することができます。"
    },
    {
      "indent": 3,
      "text": "The `pull model' is realized by the use of Uniform Resource Locators (URLs) [17] that point to the script source. The manager writes the URL which points to the script source to the distributed manager by sending an SNMP set request. The distributed manager is then responsible for retrieving the document using the protocol specified in the URL. This allows the use of protocols like FTP [18] or HTTP [19] to transfer large management scripts efficiently.",
      "ja": "`プルモデルは、」スクリプト・ソースに[17]その点ユニフォームリソースロケータ（URL）を使用することによって実現されます。マネージャは、SNMP設定要求を送信することにより、分散管理者にスクリプトのソースを指すURLを書き込みます。分散マネージャは、URLで指定されたプロトコルを使用して文書を検索する責任があります。これは、効率的に大きな管理スクリプトを転送するFTP [18]またはHTTP [19]などのプロトコルの使用を可能にします。"
    },
    {
      "indent": 3,
      "text": "The Script MIB also allows management scripts that are hard-wired into the Script MIB implementation. Built-in scripts can either be implemented in a language runtime system, or they can be built natively into the Script MIB implementation. The implementation of the `push model' or the `pull model' is not required.",
      "ja": "スクリプトMIBはまた、スクリプトMIBの実装にハード配線されている管理スクリプトを可能にします。内蔵のスクリプトは、どちらの言語のランタイムシステムに実装することも、スクリプトMIBの実装にネイティブに構築することができます。 `プッシュモデル「または`プルモデル」の実装が必要とされていません。"
    },
    {
      "indent": 3,
      "text": "Scripts can be stored in non-volatile storage. This allows a distributed manager to restart scripts if it is restarted (off-line restart). A manager is not required to push scripts back into the distributed manager after a restart if the script is backed up in non-volatile storage.",
      "ja": "スクリプトは、不揮発性ストレージに格納することができます。これは、それが（オフライン再起動）を再起動された場合、分散管理者がスクリプトを再起動することができます。管理者は、スクリプトは、不揮発性記憶装置にバックアップされている場合、再起動後に戻っ分散マネージャにスクリプトをプッシュする必要はありません。"
    },
    {
      "indent": 3,
      "text": "Every script is identified by an administratively assigned name. This name may be used to derive the name which is used to access the script in non-volatile storage. This mapping is implementation specific. However, the mapping must ensure that the Script MIB implementation can handle scripts with the same administrative name owned by different managers. One way to achieve this is to use the script owner in addition to the script name in order to derive the internal name used to refer to a particular script in non-volatile storage.",
      "ja": "すべてのスクリプトは管理上割り当てられた名前で識別されます。この名前は、不揮発性ストレージ内のスクリプトにアクセスするために使用される名前を導出するために使用することができます。このマッピングは、実装固有のものです。しかし、マッピングは、スクリプトMIBの実装が異なる管理者が所有している同じ管理名でスクリプトを処理できることを確認する必要があります。これを達成する1つの方法は、不揮発性記憶装置内の特定のスクリプトを参照するために使用される内部名を導出するために、スクリプト名に加えて、スクリプトの所有者を使用することです。"
    },
    {
      "indent": 0,
      "text": "4.3. Script Execution",
      "section_title": true,
      "ja": "4.3. スクリプトの実行"
    },
    {
      "indent": 3,
      "text": "The Script MIB permits execution of several instances of the same or different management scripts. Script arguments are passed as OCTET STRING values. Scripts return a single result value which is also an OCTET STRING value. The semantic interpretation of result values is left to the invoking manager or other management scripts. A script invoker must understand the format and semantics of both the arguments and the results of the scripts that it invokes.",
      "ja": "スクリプトMIBは、同一または異なる管理スクリプトの複数のインスタンスの実行を許可します。スクリプトの引数は、オクテット文字列値として渡されます。スクリプトはまた、オクテット文字列値である単一の結果値を返します。結果値の意味解釈は、呼び出し元の管理者またはその他の管理スクリプトに任されています。スクリプトの呼び出しは、引数とそれが呼び出すスクリプトの結果の両方の形式と意味を理解する必要があります。"
    },
    {
      "indent": 3,
      "text": "Scripts can also export complex results through a MIB interface. This allows a management application to access and use script results in the same manner as it processes any other MIB data. However, the Script MIB does not provide any special support for the implementation of MIBs through scripts.",
      "ja": "スクリプトはまた、MIBインタフェースを介して、複雑な結果をエクスポートすることができます。これは、他のMIBデータを処理するように管理アプリケーションは、同様にスクリプトの結果にアクセスして使用することを可能にします。しかし、スクリプトMIBは、スクリプト経由のMIBの実装のための特別なサポートを提供していません。"
    },
    {
      "indent": 3,
      "text": "Runtime errors terminate active scripts. An exit code and a human readable error message is left in the MIB. A notification containing the exit code, the error message and a timestamp is generated when a script terminates with an error exit code.",
      "ja": "ランタイムエラーは、アクティブスクリプトを終了します。終了コードと人間が読めるエラーメッセージがMIBに残されます。スクリプトがエラー終了コードで終了したときに終了コード、エラーメッセージおよびタイムスタンプを含む通知が生成されます。"
    },
    {
      "indent": 3,
      "text": "Script arguments and results do not have any size limitations other than the limits imposed by the SMI and the SNMP protocol. However, implementations of this MIB might have further restrictions. A script designer might therefore choose to return the results via other mechanisms if the script results can be very large. One possibility is to return a URL as a script result which points to the file containing the script output.",
      "ja": "スクリプトの引数と結果はSMIとSNMPプロトコルによる制限以外の任意のサイズの制限はありません。しかし、このMIBの実装はさらなる制限がある場合があります。スクリプトの設計者は、したがって、スクリプトの結果は非常に大きくなる可能性があれば、他の機構を介して結果を返すことを選択するかもしれません。一つの可能​​性は、スクリプトの出力を含むファイルを指すスクリプト結果としてURLを返すことです。"
    },
    {
      "indent": 3,
      "text": "Executing scripts have a status object attached which allows script execution to be suspended, resumed, or aborted. The precise semantics of the suspend and resume operations are language and runtime system dependent. Some runtime systems may choose to not implement the suspend/resume operations.",
      "ja": "実行スクリプトが再開、または中止され、スクリプトの実行を中断することを可能に取り付けられた状態オブジェクトを有しています。一時停止と再開の操作の正確な意味は、言語とランタイムシステムに依存しています。いくつかのランタイムシステムは、サスペンド/レジュームオペレーションを実装しないことを選択できます。"
    },
    {
      "indent": 3,
      "text": "A history of finished scripts is kept in the MIB. A script invoker can collect results at a later point in time (offline operation). Control objects can be used to control how entries in the history are aged out if the table fills up.",
      "ja": "完成したスクリプトの履歴は、MIBに保存されます。スクリプトの呼び出しは、時間（オフライン操作）における後の時点で結果を収集することができます。コントロールオブジェクトは、テーブルがいっぱいになった場合の歴史の中でエントリが期限切れ方法を制御するために使用することができます。"
    },
    {
      "indent": 0,
      "text": "5. The Structure of the MIB",
      "section_title": true,
      "ja": "5. MIBの構造"
    },
    {
      "indent": 3,
      "text": "This section presents the structure of the MIB. The objects are arranged into the following groups:",
      "ja": "このセクションでは、MIBの構造を示しています。オブジェクトは、以下のグループに配置されています。"
    },
    {
      "indent": 3,
      "text": "o language group (smLanguageGroup)",
      "ja": "Oの言語グループ（smLanguageGroup）"
    },
    {
      "indent": 3,
      "text": "o script group (smScriptGroup)",
      "ja": "Oスクリプトグループ（smScriptGroup）"
    },
    {
      "indent": 3,
      "text": "o script code group (smCodeGroup)",
      "ja": "Oスクリプトコード群（smCodeGroup）"
    },
    {
      "indent": 3,
      "text": "o script launch group (smLaunchGroup)",
      "ja": "Oスクリプトの起動・グループ（smLaunchGroup）"
    },
    {
      "indent": 3,
      "text": "o running script group (smRunGroup)",
      "ja": "O実行中のスクリプトグループ（smRunGroup）"
    },
    {
      "indent": 0,
      "text": "5.1. The smLanguageGroup",
      "section_title": true,
      "ja": "5.1.  smLanguageGroup"
    },
    {
      "indent": 3,
      "text": "The smLanguageGroup is used to provide information about the languages and the language extensions supported by a Script MIB implementation. This group includes two tables. The smLangTable lists all languages supported by a Script MIB implementation and the smExtsnTable lists the extensions that are available for a given language.",
      "ja": "smLanguageGroupは、言語やスクリプトMIBの実装でサポートされている言語拡張についての情報を提供するために使用されます。このグループには、2つのテーブルを含んでいます。 smLangTableスクリプトMIBの実装でサポートされているすべての言語を一覧表示し、smExtsnTableは、特定の言語で利用可能な拡張を示しています。"
    },
    {
      "indent": 0,
      "text": "5.2. The smScriptGroup",
      "section_title": true,
      "ja": "5.2.  smScriptGroup"
    },
    {
      "indent": 3,
      "text": "The smScriptGroup consists of a single table, called the smScriptTable. The smScriptTable lists all scripts known to a Script MIB implementation. The smScriptTable contains objects that allow the following operations:",
      "ja": "smScriptGroupは、単一のテーブルで構成され、smScriptTableと呼ばれます。 smScriptTableスクリプトMIBの実装に知られているすべてのスクリプトを示しています。 smScriptTableは、以下の操作を許可するオブジェクトが含まれています。"
    },
    {
      "indent": 3,
      "text": "o download scripts from a URL (pull model)",
      "ja": "O URL（プルモデル）からスクリプトをダウンロード"
    },
    {
      "indent": 3,
      "text": "o read scripts from local non-volatile storage",
      "ja": "Oローカル不揮発性ストレージからスクリプトを読んで"
    },
    {
      "indent": 3,
      "text": "o store scripts in local non-volatile storage",
      "ja": "ローカル不揮発性ストレージ内のOストアスクリプト"
    },
    {
      "indent": 3,
      "text": "o delete scripts from local non-volatile storage",
      "ja": "Oローカル不揮発性ストレージからスクリプトを削除します"
    },
    {
      "indent": 3,
      "text": "o list permanent scripts (that can not be changed or removed)",
      "ja": "Oリスト永久スクリプト（つまり、変更または削除することはできません）"
    },
    {
      "indent": 3,
      "text": "o read and modify the script status (enabled, disabled, editing)",
      "ja": "O読み、スクリプトのステータス（有効、無効、編集）を変更"
    },
    {
      "indent": 3,
      "text": "A status object called smScriptOperStatus allows a manager to obtain the current status of a script. It is also used to provide an error indication if an attempt to invoke one of the operations listed above fails. The status change of a script can be requested by modifying the associated smScriptAdminStatus object.",
      "ja": "smScriptOperStatus呼ばれるステータスオブジェクトマネージャは、スクリプトの現在のステータスを得ることができます。また、失敗した上記のいずれかの操作を起動しようとするとエラー表示を提供するために使用されます。スクリプトのステータスの変更は、関連するsmScriptAdminStatusオブジェクトを修正することを要求することができます。"
    },
    {
      "indent": 3,
      "text": "The source of a script is defined by the smScriptSource object. This object may contain a URL pointing to a remote location which provides access to the management script. The script source is read from the smCodeTable (described below) or from non-volatile storage if the smScriptSource object contains an empty URL. The smScriptStorageType object is used to distinguish between scripts read from non-volatile storage and scripts read from the smCodeTable.",
      "ja": "スクリプトのソースはsmScriptSourceオブジェクトによって定義されます。このオブジェクトは、管理スクリプトへのアクセスを提供するリモート・ロケーションを指し示すURLを含むことができます。 smScriptSourceオブジェクトが空のURLが含まれている場合、スクリプトのソースはsmCodeTable（後述）から、または不揮発性記憶装置から読み出されます。 smScriptStorageTypeオブジェクトはsmCodeTableから読み出され、不揮発性記憶装置から読み出されたスクリプトおよびスクリプトを区別するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Scripts are automatically loaded once the smScriptAdminStatus object is set to `enabled'. Loading a script includes retrieving the script (probably from a remote location), compiling the script for languages that require a compilation step, and making the code available to the runtime system. The smScriptOperStatus object is used to indicate the status of the loading process. This object will start in the state `retrieving', switch to the state `compiling' and finally reach the state `enabled'. Errors during the retrieval or compilation phase will result in an error state such as `compilationFailed'.",
      "ja": "smScriptAdminStatusオブジェクトは `「有効に設定されると、スクリプトは自動的にロードされます。スクリプトをロードすると、（おそらく、遠隔地から）スクリプトを取得するコンパイル工程を必要とする言語のスクリプトをコンパイルし、ランタイムシステムに利用可能なコードを作る含みます。 smScriptOperStatusオブジェクトは、ロード処理のステータスを示すために使用されます。このオブジェクトは「コンパイル `状態に切り替える」状態`検索で開始し、最終的に状態に到達します `「有効。検索またはコンパイルフェーズ中のエラーは、 `「compilationFailedとしてエラー状態になります。"
    },
    {
      "indent": 0,
      "text": "5.3. The smCodeGroup",
      "section_title": true,
      "ja": "5.3.  smCodeGroup"
    },
    {
      "indent": 3,
      "text": "The smCodeGroup consists of a single table, called the smCodeTable, which provides the ability to transfer and modify scripts via SNMP set requests. In particular, the smCodeTable allows the following operations:",
      "ja": "smCodeGroupは、単一のテーブルで構成され、SNMP SET要求を経由してスクリプトを転送し、変更する機能を提供しsmCodeTableは、と呼ばれます。特に、smCodeTableは、次の操作を可能にします。"
    },
    {
      "indent": 3,
      "text": "o download scripts via SNMP (push model)",
      "ja": "SNMP経由O・ダウンロード・スクリプト（プッシュモデル）"
    },
    {
      "indent": 3,
      "text": "o modify scripts via SNMP (editing)",
      "ja": "O SNMP経由でスクリプトを変更（編集）"
    },
    {
      "indent": 3,
      "text": "The smCodeTable lists the code of a script. A script can be fragmented over multiple rows of the smCodeTable in order to handle SNMP message size limitations. Modifications of the smCodeTable are only possible if the associated smScriptOperStatus object has the value `editing'. The Script MIB implementation reloads the modified script code once the smScriptOperStatus changes to `enabled' again.",
      "ja": "smCodeTableは、スクリプトのコードを示しています。スクリプトは、SNMPメッセージサイズの制限を処理するためにsmCodeTableの複数の行を上に断片化することができます。関連smScriptOperStatusオブジェクトは値 '編集」を有する場合smCodeTableの修正のみ可能です。 smScriptOperStatusが再び「有効 `に変更したら、スクリプトMIBの実装が変更されたスクリプトコードをリロードします。"
    },
    {
      "indent": 3,
      "text": "The implementation of the smCodeGroup is optional.",
      "ja": "smCodeGroupの実装はオプションです。"
    },
    {
      "indent": 0,
      "text": "5.4. The smLaunchGroup",
      "section_title": true,
      "ja": "5.4.  smLaunchGroup"
    },
    {
      "indent": 3,
      "text": "The smLaunchGroup contains a single table, the smLaunchTable. An entry in the smLaunchTable represents a launch button which can be used to start a script. The smLaunchTable allows the following operations:",
      "ja": "smLaunchGroupは、単一のテーブル、smLaunchTableが含まれています。 smLaunchTableのエントリは、スクリプトを起動するために使用することができます起動ボタンを表します。 smLaunchTableには、次の操作ができます。"
    },
    {
      "indent": 3,
      "text": "o associate a script with an owner used during script execution",
      "ja": "Oスクリプトの実行時に使用される所有者とスクリプトを関連付けます"
    },
    {
      "indent": 3,
      "text": "o provide arguments and parameters for script invocation",
      "ja": "Oスクリプトの呼び出しの引数とパラメータを提供"
    },
    {
      "indent": 3,
      "text": "o invoke scripts with a single set operation",
      "ja": "O単一セット操作でスクリプトを呼び出します"
    },
    {
      "indent": 3,
      "text": "The smLaunchTable describes scripts and their parameters that are ready to be launched. An entry in the smLaunchTable attaches an argument to a script and control values which, for example, define the maximum number of times that a script invoked from a particular row in the smLaunchTable may be running concurrently.",
      "ja": "smLaunchTableはスクリプトと起動する準備ができている彼らのパラメータについて説明します。 smLaunchTableのエントリは、例えば、smLaunchTable内の特定の行から呼び出されたスクリプトを同時に実行することができる最大回数を定義し、スクリプトと制御値の引数を付加します。"
    },
    {
      "indent": 3,
      "text": "An entry in the smLaunchTable also defines the owner which will be used to associate permissions with the script execution.",
      "ja": "smLaunchTableのエントリは、スクリプトの実行に権限を関連付けるために使用される所有者を定義します。"
    },
    {
      "indent": 0,
      "text": "5.5. The smRunGroup",
      "section_title": true,
      "ja": "5.5.  smRunGroup"
    },
    {
      "indent": 3,
      "text": "The smRunGroup contains a single table, called the smRunTable, which lists all scripts that are currently running or have terminated recently. The smRunTable contains objects that allow the following operations:",
      "ja": "smRunGroupは、単一のテーブルが含まれている、現在実行中または最近終了したすべてのスクリプトを示していますsmRunTableは、と呼ばれます。 smRunTableは、以下の操作を許可するオブジェクトが含まれています。"
    },
    {
      "indent": 3,
      "text": "o retrieve status information from running scripts",
      "ja": "Oスクリプトを実行しているからステータス情報を取得します"
    },
    {
      "indent": 3,
      "text": "o control running scripts (suspend, resume, abort)",
      "ja": "O制御実行中のスクリプト（中止、中断、再開）"
    },
    {
      "indent": 3,
      "text": "o retrieve results from recently terminated scripts",
      "ja": "O最近終了したスクリプトから結果を取得します"
    },
    {
      "indent": 3,
      "text": "o control the remaining maximum lifetime of a running script",
      "ja": "O実行スクリプトの残りの最大寿命を制御します"
    },
    {
      "indent": 3,
      "text": "o control how long script results are accessible",
      "ja": "Oスクリプトの結果がアクセス可能である時間の長さを制御"
    },
    {
      "indent": 3,
      "text": "Every row in the smRunTable contains the argument passed during script invocation, the result produced by the script and the script exit code. The smRunTable also provides information about the current run state as well as start and end time-stamps. There are three writable objects in the smRunTable. The smRunLifeTime object defines the maximum time a running script may run before it is terminated by the Script MIB implementation. The smRunExpireTime object defines the time that a completed script can stay in the smRunTable before it is aged out. The smRunControl object allows running scripts to be suspended, resumed, or aborted.",
      "ja": "smRunTableのすべての行は、スクリプト呼び出し中に渡される引数、スクリプトおよびスクリプトの終了コードによって生成された結果を含んでいます。 smRunTableは、現在の実行状態だけでなく、開始と終了のタイムスタンプに関する情報を提供します。 smRunTableで3つの書き込み可能なオブジェクトがあります。 smRunLifeTimeオブジェクトは、それがスクリプトMIBの実装によって終了される前に、実行中のスクリプトが実行可能な最大時間を定義します。 smRunExpireTimeオブジェクトは、それが期限切れになる前に完成したスクリプトはsmRunTableに滞在できる時間を定義します。 smRunControlオブジェクトを再開、または中止され、実行中のスクリプトが中断することができます。"
    },
    {
      "indent": 0,
      "text": "6. Definitions",
      "section_title": true,
      "ja": "6.定義"
    },
    {
      "indent": 3,
      "text": "DISMAN-SCRIPT-MIB DEFINITIONS ::= BEGIN",
      "raw": true
    },
    {
      "indent": 3,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, NOTIFICATION-TYPE, Integer32, Unsigned32, mib-2 FROM SNMPv2-SMI",
      "ja": "SNMPv2の-SMIからの輸入MODULE-IDENTITY、OBJECT-TYPE、NOTIFICATION-TYPE、構文Integer32、Unsigned32の、MIB-2"
    },
    {
      "indent": 7,
      "text": "RowStatus, TimeInterval, DateAndTime, StorageType, DisplayString\n    FROM SNMPv2-TC",
      "raw": true
    },
    {
      "indent": 7,
      "text": "MODULE-COMPLIANCE, OBJECT-GROUP, NOTIFICATION-GROUP FROM SNMPv2-CONF",
      "ja": "MODULE-COMPLIANCE、OBJECT-GROUP、NOTIFICATION-GROUPのSNMPv2-CONF FROM"
    },
    {
      "indent": 7,
      "text": "SnmpAdminString FROM SNMP-FRAMEWORK-MIB;",
      "ja": "SNMP-FRAMEWORK-MIBかられるSnmpAdminString。"
    },
    {
      "indent": 3,
      "text": "scriptMIB MODULE-IDENTITY LAST-UPDATED \"9902221800Z\"",
      "ja": "scriptMIBのMODULE-IDENTITY LAST-UPDATED \"9902221800Z\""
    },
    {
      "indent": 7,
      "text": "ORGANIZATION \"IETF Distributed Management Working Group\"\nCONTACT-INFO\n    \"David B. Levi\n     Nortel Networks\n     4401 Great America Parkway\n     Santa Clara, CA 95052-8185\n     U.S.A.\n     Tel: +1 423 686 0432\n     E-mail: dlevi@nortelnetworks.com",
      "raw": true
    },
    {
      "indent": 7,
      "text": "     Juergen Schoenwaelder\n     TU Braunschweig\n     Bueltenweg 74/75\n     38106 Braunschweig\n     Germany\n     Tel: +49 531 391-3283\n     E-mail: schoenw@ibr.cs.tu-bs.de\"\nDESCRIPTION\n    \"This MIB module defines a set of objects that allow to\n     delegate management scripts to distributed managers.\"\n::= { mib-2 64 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- -- The groups defined within this MIB module: --",
      "ja": " -   - このMIBモジュール内で定義されたグループ： - "
    },
    {
      "indent": 3,
      "text": "smObjects       OBJECT IDENTIFIER ::= { scriptMIB 1 }\nsmNotifications OBJECT IDENTIFIER ::= { scriptMIB 2 }\nsmConformance   OBJECT IDENTIFIER ::= { scriptMIB 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- -- Script language and language extensions. -- -- This group defines tables which list the languages and the -- language extensions supported by a script MIB implementation. -- Languages are uniquely identified by object identifier values. --",
      "ja": " -   - スクリプト言語と言語拡張。 -   - スクリプトMIBの実装でサポートされている言語拡張 - このグループは、言語とリストのテーブルを定義します。 - 言語は、一意のオブジェクト識別子値によって識別されます。 - "
    },
    {
      "indent": 3,
      "text": "smLangTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmLangEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table lists supported script languages.\"\n    ::= { smObjects 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLangEntry OBJECT-TYPE SYNTAX SmLangEntry",
      "ja": "smLangEntryのOBJECT-TYPE SYNTAX SmLangEntry"
    },
    {
      "indent": 7,
      "text": "MAX-ACCESS  not-accessible\nSTATUS      current\nDESCRIPTION\n    \"An entry describing a particular language.\"\nINDEX { smLangIndex }\n::= { smLangTable 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "SmLangEntry ::= SEQUENCE {\n    smLangIndex         Integer32,\n    smLangLanguage      OBJECT IDENTIFIER,\n    smLangVersion       SnmpAdminString,\n    smLangVendor        OBJECT IDENTIFIER,\n    smLangRevision      SnmpAdminString,\n    smLangDescr         SnmpAdminString\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLangIndex OBJECT-TYPE SYNTAX Integer32 (1..2147483647) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The locally arbitrary, but unique identifier associated with this language entry.",
      "ja": "smLangIndexのOBJECT-TYPE構文Integer32（1 2147483647）MAX-ACCESSステータス現在の説明は「この言語のエントリに関連付けられたローカルには任意ですが、ユニークな識別子。"
    },
    {
      "indent": 12,
      "text": "The value is expected to remain constant at least from one\nre-initialization of the entity's network management system\nto the next re-initialization.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "     Note, the data type and the range of this object must be\n     consistent with the definition of smScriptLanguage.\"\n::= { smLangEntry 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLangLanguage OBJECT-TYPE\n    SYNTAX      OBJECT IDENTIFIER\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The globally unique identification of the language.\"\n    ::= { smLangEntry 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLangVersion OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The version number of the language. The zero-length string shall be used if the language does not have a version number.",
      "ja": "smLangVersion OBJECT-TYPE構文れるSnmpAdminString（SIZE（0 32））MAX-ACCESS read-only説明「言語のバージョン番号。言語は、バージョン番号を持っていない場合、長さゼロの文字列を使用しなければなりません。"
    },
    {
      "indent": 7,
      "text": "     It is suggested that the version number consist of one or\n     more decimal numbers separated by dots, where the first\n     number is called the major version number.\"\n::= { smLangEntry 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLangVendor OBJECT-TYPE\n    SYNTAX      OBJECT IDENTIFIER\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"An object identifer which identifies the vendor who\n         provides the implementation of the language. This object\n         identifer SHALL point to the object identifier directly\n         below the enterprise object identifier {1 3 6 1 4 1}\n         allocated for the vendor. The value must be the object\n         identifier {0 0} if the vendor is not known.\"\n    ::= { smLangEntry 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLangRevision OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The version number of the language implementation. The value of this object must be an empty string if version number of the implementation is unknown.",
      "ja": "smLangRevision OBJECT-TYPE構文れるSnmpAdminString（SIZE（0 32））MAX-ACCESS read-only説明「言語実装のバージョン番号。インプリメンテーションのバージョン番号である場合、このオブジェクトの値は空の文字列でなければなりません未知の。"
    },
    {
      "indent": 7,
      "text": "     It is suggested that the value consist of one or more\n     decimal numbers separated by dots, where the first\n     number is called the major version number.\"\n::= { smLangEntry 5 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLangDescr OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"A textual description of the language.\"\n    ::= { smLangEntry 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smExtsnTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmExtsnEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table lists supported language extensions.\"\n    ::= { smObjects 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smExtsnEntry OBJECT-TYPE\n    SYNTAX      SmExtsnEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"An entry describing a particular language extension.\"\n    INDEX { smLangIndex, smExtsnIndex }\n    ::= { smExtsnTable 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "SmExtsnEntry ::= SEQUENCE {\n    smExtsnIndex        Integer32,\n    smExtsnExtension    OBJECT IDENTIFIER,\n    smExtsnVersion      SnmpAdminString,\n    smExtsnVendor       OBJECT IDENTIFIER,\n    smExtsnRevision     SnmpAdminString,\n    smExtsnDescr        SnmpAdminString\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smExtsnIndex OBJECT-TYPE SYNTAX Integer32 (1..2147483647) MAX-ACCESS not-accessible STATUS current",
      "ja": "smExtsnIndexのOBJECT-TYPE構文Integer32（1 2147483647）MAX-ACCESSステータス現在の"
    },
    {
      "indent": 7,
      "text": "DESCRIPTION\n    \"The locally arbitrary, but unique identifier associated\n     with this language extension entry.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "     The value is expected to remain constant at least from one\n     re-initialization of the entity's network management system\n     to the next re-initialization.\"\n::= { smExtsnEntry 1}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smExtsnExtension OBJECT-TYPE\n    SYNTAX      OBJECT IDENTIFIER\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The globally unique identification of the language\n         extension.\"\n    ::= { smExtsnEntry 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smExtsnVersion OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The version number of the language extension.",
      "ja": "smExtsnVersion OBJECT-TYPE構文れるSnmpAdminString（SIZE（0 32））MAX-ACCESS read-only説明「言語拡張のバージョン番号。"
    },
    {
      "indent": 7,
      "text": "     It is suggested that the version number consist of one or\n     more decimal numbers separated by dots, where the first\n     number is called the major version number.\"\n::= { smExtsnEntry 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smExtsnVendor OBJECT-TYPE\n    SYNTAX      OBJECT IDENTIFIER\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"An object identifer which identifies the vendor who\n         provides the implementation of the extension. The\n         object identifer value should point to the OID node\n         directly below the enterprise OID {1 3 6 1 4 1}\n         allocated for the vendor. The value must by the object\n         identifier {0 0} if the vendor is not known.\"\n    ::= { smExtsnEntry 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smExtsnRevision OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The version number of the extension implementation. The value of this object must be an empty string if version number of the implementation is unknown.",
      "ja": "smExtsnRevision OBJECT-TYPE構文れるSnmpAdminString（SIZE（0 32））MAX-ACCESS read-only説明「拡張機能の実装のバージョン番号。インプリメンテーションのバージョン番号である場合、このオブジェクトの値は空の文字列でなければなりません未知の。"
    },
    {
      "indent": 7,
      "text": "     It is suggested that the value consist of one or more\n     decimal numbers separated by dots, where the first\n     number is called the major version number.\"\n::= { smExtsnEntry 5 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smExtsnDescr OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"A textual description of the language extension.\"\n    ::= { smExtsnEntry 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "--\n-- Scripts known by the Script MIB implementation.\n--\n-- This group defines a table which lists all known scripts.\n-- Scripts can be added and removed through manipulation of the\n-- smScriptTable.\n-- smScriptObjects OBJECT IDENTIFIER ::= { smObjects 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmScriptEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table lists and describes locally known scripts.\"\n    ::= { smScriptObjects 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptEntry OBJECT-TYPE\n    SYNTAX      SmScriptEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"An entry describing a particular script. Every script that\n         is stored in non-volatile memory is required to appear in\n         this script table.\"\n    INDEX { smScriptOwner, smScriptName }\n    ::= { smScriptTable 1 }\nSmScriptEntry ::= SEQUENCE {\n    smScriptOwner       SnmpAdminString,\n    smScriptName        SnmpAdminString,\n    smScriptDescr       SnmpAdminString,\n    smScriptLanguage    Integer32,\n    smScriptSource      DisplayString,\n    smScriptAdminStatus INTEGER,\n    smScriptOperStatus  INTEGER,\n    smScriptStorageType StorageType,\n    smScriptRowStatus   RowStatus\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptOwner OBJECT-TYPE\n    SYNTAX      SnmpAdminString (SIZE (0..32))\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The manager who owns this row in the smScriptTable.\"\n    ::= { smScriptEntry 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptName OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The locally-unique, administratively assigned name for this script. This object allows an smScriptOwner to have multiple entries in the smScriptTable.",
      "ja": "smScriptNameのOBJECT-TYPE SYNTAXれるSnmpAdminString MAX-ACCESSステータス現在の説明は「このスクリプトのローカルでユニークな、管理上割り当てられた名前。このオブジェクトはsmScriptOwnerがsmScriptTableに複数のエントリを持つことができます。"
    },
    {
      "indent": 7,
      "text": "     This value of this object may be used to derive the name\n     (e.g. a file name) which is used by the Script MIB\n     implementation to access the script in non-volatile\n     storage. The details of this mapping are implementation\n     specific. However, the mapping needs to ensure that scripts\n     created by different owners with the same script name do not\n     map to the same name in non-volatile storage.\"\n::= { smScriptEntry 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptDescr OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"A description of the purpose of the script.\"\n    ::= { smScriptEntry 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptLanguage OBJECT-TYPE SYNTAX Integer32 (0..2147483647) MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object type identifies an entry in the smLangTable which is used to execute this script. The special value 0 may be used by hard-wired scripts that can not be modified and that are executed by internal functions.",
      "ja": "smScriptLanguageのOBJECT-TYPE構文Integer32（0 2147483647）MAX-ACCESSリード作成ステータス現在の説明は「このオブジェクトタイプの値は、このスクリプトを実行するために使用されるsmLangTableのエントリを識別する。特別な値0が使用することができます修飾することができず、ハードワイヤードスクリプトは内部機能によって実行されます。"
    },
    {
      "indent": 7,
      "text": "     Note, the data type and the range of this object must be\n     consistent with the definition of smLangIndex.\"\n::= { smScriptEntry 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptSource OBJECT-TYPE SYNTAX DisplayString MAX-ACCESS read-create STATUS current DESCRIPTION \"This object either contains a reference to the script source or an empty string. A reference must be given in the form of a Uniform Resource Locator (URL) as defined in RFC 2396. The allowed character sets and the encoding rules defined in RFC 2396 section 2 apply.",
      "ja": "smScriptSourceのOBJECT-TYPE構文DisplayString MAX-ACCESSはリード作成ステータス現在の説明は「このオブジェクトのいずれかスクリプト源または空の文字列への参照を含む。で定義されている基準は、ユニフォームリソースロケータ（URL）の形式で与えられなければなりませんRFC 2396 RFC 2396のセクション2で定義された許容文字セットと符号化規則が適用されます。"
    },
    {
      "indent": 12,
      "text": "When the smScriptAdminStatus object is set to `enabled',\nthe Script MIB implementation will `pull' the script\nsource from the URL contained in this object if the URL\nis not empty.",
      "raw": true
    },
    {
      "indent": 12,
      "text": "An empty URL indicates that the script source is loaded from local storage. The script is read from the smCodeTable if the value of smScriptStorageType is volatile. Otherwise, the script is read from non-volatile storage.",
      "ja": "空のURLは、スクリプトのソースがローカルストレージからロードされていることを示しています。 smScriptStorageTypeの値が揮発性である場合、スクリプトはsmCodeTableから読み込まれます。そうしないと、スクリプトは、不揮発性記憶装置から読み込まれます。"
    },
    {
      "indent": 12,
      "text": "Note: This document does not mandate implementation of any specific URL scheme. A attempt to load a script from a nonsupported URL scheme will cause the smScriptOperStatus to report an `unknownProtocol' error.",
      "ja": "注意：この文書は、特定のURLスキームの実装を強制しません。サポート対象外のURLスキームからスクリプトをロードしようとすると、smScriptOperStatusは `unknownProtocol」エラーを報告するようになります。"
    },
    {
      "indent": 3,
      "text": "         Set requests to change this object are invalid if the\n         value of smScriptOperStatus is `enabled', `editing',\n         `retrieving' or `compiling' and will result in an\n         inconsistentValue error.\"\n    DEFVAL { ''H }\n    ::= { smScriptEntry 5 }\nsmScriptAdminStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    enabled(1),\n                    disabled(2),\n                    editing(3)\n                }\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The value of this object indicates the desired status of\n         the script. See the definition of smScriptOperStatus for\n         a description of the values.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "     When the smScriptAdminStatus object is set to `enabled' and\n     the smScriptOperStatus is `disabled' or one of the error\n     states, the Script MIB implementation will `pull' the script\n     source from the URL contained in the smScriptSource object\n     if the URL is not empty.\"\nDEFVAL { disabled }\n::= { smScriptEntry 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptOperStatus OBJECT-TYPE SYNTAX INTEGER { enabled(1), disabled(2), editing(3), retrieving(4), compiling(5), noSuchScript(6), accessDenied(7), wrongLanguage(8), wrongVersion(9), compilationFailed(10), noResourcesLeft(11), unknownProtocol(12), protocolFailure(13), genericError(14) } MAX-ACCESS read-only STATUS current DESCRIPTION \"The actual status of the script in the runtime system. The value of this object is only meaningful when the value of the smScriptRowStatus object is `active'.",
      "ja": "smScriptOperStatusのOBJECT-TYPE SYNTAX INTEGER {イネーブル（1）、無効（2）、編集（3）、（5）コンパイル、（4）検索、noSuchScript（6）、アクセス拒否（7）、wrongLanguage（8）、wrongVersion（9 ）、compilationFailed（10）、noResourcesLeft（11）、unknownProtocol（12）、protocolFailure（13）、genericError（14）} MAX-ACCESS read-only説明「ランタイムシステムにおけるスクリプトの実際のステータス。値このオブジェクトのsmScriptRowStatusオブジェクトの値が「'アクティブである場合にのみ意味があります。"
    },
    {
      "indent": 12,
      "text": "The smScriptOperStatus object may have the following values:\n- `enabled' indicates that the script is available and can\n   be started by a launch table entry.",
      "raw": true
    },
    {
      "indent": 12,
      "text": "- `disabled' indicates that the script can not be used.",
      "ja": " - 「`無効には、スクリプトが使用できないことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `editing' indicates that the script can be modified in the smCodeTable.",
      "ja": " -  `編集は」スクリプトがsmCodeTableに変更することができることを示しています。"
    },
    {
      "indent": 12,
      "text": "- `retrieving' indicates that the script is currently being loaded from non-volatile storage or a remote system.",
      "ja": " -  `取り出すには、」スクリプトは、現在、不揮発性ストレージまたはリモートシステムからロードされていることを示しています。"
    },
    {
      "indent": 12,
      "text": "- `compiling' indicates that the script is currently being compiled by the runtime system.",
      "ja": " -  `コンパイルするには、」スクリプトが現在ランタイムシステムによってコンパイルされていることを示しています。"
    },
    {
      "indent": 12,
      "text": "- `noSuchScript' indicates that the script does not exist at the smScriptSource.",
      "ja": " -  `noSuchScriptは」スクリプトがsmScriptSourceに存在しないことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `accessDenied' indicates that the script can not be loaded from the smScriptSource due to a lack of permissions.",
      "ja": " -  `」アクセス拒否スクリプトは権限が不足しているためsmScriptSourceからロードすることができないことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `wrongLanguage' indicates that the script can not be loaded from the smScriptSource because of a language mismatch.",
      "ja": " -  `wrongLanguageは」スクリプトが原因で、言語の不一致smScriptSourceからロードすることができないことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `wrongVersion' indicates that the script can not be loaded from the smScriptSource because of a language version mismatch.",
      "ja": " -  `wrongVersionは」スクリプトが原因言語バージョンの不一致smScriptSourceからロードすることができないことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `compilationFailed' indicates that the compilation failed.",
      "ja": " -  `compilationFailedは、」コンパイルが失敗したことを示します。"
    },
    {
      "indent": 12,
      "text": "- `noResourcesLeft' indicates that the runtime system does not have enough resources to load the script.",
      "ja": " -  `noResourcesLeftは、」ランタイムシステムは、スクリプトをロードするために十分なリソースを持っていないことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `unknownProtocol' indicates that the script could not be loaded from the smScriptSource because the requested protocol is not supported.",
      "ja": " -  `unknownProtocolは、」要求されたプロトコルがサポートされていないため、スクリプトがsmScriptSourceからロードすることができなかったことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `protocolFailure' indicates that the script could not be loaded from the smScriptSource because of a protocol failure.",
      "ja": " -  `protocolFailureは」スクリプトが原因プロトコル障害のsmScriptSourceからロードすることができなかったことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `genericError' indicates that the script could not be loaded due to an error condition not listed above.",
      "ja": " -  `genericErrorは」スクリプトが原因上記に記載されていないエラー条件にロードすることができなかったことを示しています。"
    },
    {
      "indent": 12,
      "text": "The `retrieving' and `compiling' states are transient states which will either lead to one of the error states or the `enabled' state. The `disabled' and `editing' states are administrative states which are only reached by explicit management operations.",
      "ja": "`検索「と`コンパイル」の状態がエラー状態のいずれか `有効」状態につながるいずれかの過渡状態です。 `無効「と`編集」の状態は、明示的な管理操作によって到達されている管理状態です。"
    },
    {
      "indent": 7,
      "text": "     All launch table entries that refer to this script table\n     entry shall have an smLaunchOperStatus value of `disabled'\n     when the value of this object is not `enabled'.\"\nDEFVAL { disabled }\n::= { smScriptEntry 7 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptStorageType OBJECT-TYPE SYNTAX StorageType MAX-ACCESS read-create STATUS current DESCRIPTION \"This object defines whether this row and the script controlled by this row are kept in volatile storage and lost upon reboot or if this row is backed up by non-volatile or permanent storage.",
      "ja": "smScriptStorageType OBJECT-TYPE構文StorageType MAX-ACCESSリード作成ステータス現在の説明は「このオブジェクトは、この行かどうかを定義し、この行によって制御スクリプトは、この行が非揮発性でバックアップされ、再起動時又は場合、揮発性ストレージに保持され、失われ又は永続的なストレージ。"
    },
    {
      "indent": 12,
      "text": "The script controlled by this row is written into local\nnon-volatile storage if the following condition becomes\ntrue:",
      "raw": true
    },
    {
      "indent": 12,
      "text": "(a) the URL contained in the smScriptSource object is empty and (b) the smScriptStorageType is `nonVolatile' and (c) the smScriptOperStatus is `enabled'",
      "ja": "（A）smScriptSourceオブジェクトに含まれるURLは空であり、（B）smScriptStorageTypeは `不揮発性で「及び（c）smScriptOperStatusが`有効になっています」"
    },
    {
      "indent": 12,
      "text": "Setting this object to `volatile' removes a script from non-volatile storage if the script controlled by this row has been in non-volatile storage before. Attempts to set this object to permanent will always fail with an inconsistentValue error.",
      "ja": "この行によって制御スクリプトが前に不揮発性記憶されている場合 `揮発性へのこのオブジェクトを設定することは、不揮発性記憶装置からスクリプトを除去します。永久にこのオブジェクトを設定する試みは常にinconsistentValueエラーで失敗します。"
    },
    {
      "indent": 12,
      "text": "The value of smScriptStorageType is only meaningful if the value of the corresponding RowStatus object is `active'.",
      "ja": "smScriptStorageTypeの値は、対応するRowStatusオブジェクトの値が「'アクティブである場合のみ有効です。"
    },
    {
      "indent": 7,
      "text": "     If smScriptStorageType has the value permanent(4), then all\n     objects whose MAX-ACCESS value is read-create must be\n     writable, with the exception of the smScriptStorageType and\n     smScriptRowStatus objects, which shall be read-only.\"\nDEFVAL { volatile }\n::= { smScriptEntry 8 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"A control that allows entries to be added and removed from this table.",
      "ja": "smScriptRowStatusのOBJECT-TYPE構文RowStatus MAX-ACCESSリード作成ステータス現在の説明「エントリが追加され、このテーブルから削除されることを可能にする制御。"
    },
    {
      "indent": 12,
      "text": "Changing the smScriptRowStatus from `active' to `notInService'\nwill remove the associated script from the runtime system.\nThe value of smScriptOperStatus will be reset to `disabled'.",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Deleting conceptual rows from this table includes the deletion of all resources associated with this row. This implies that a script stored in non-volatile storage is removed from non-volatile storage.",
      "ja": "この表から概念的な行を削除すると、この列に関連付けられたすべてのリソースの削除を含みます。これは、非揮発性記憶装置に記憶されたスクリプトは、不揮発性記憶装置から除去されることを意味します。"
    },
    {
      "indent": 12,
      "text": "An entry may not exist in the `active' state unless all required objects in the entry have appropriate values. Rows that are not complete or not in service are not known by the script runtime system.",
      "ja": "エントリに必要なすべてのオブジェクトが適切な値を持っていない限り、エントリは `アクティブ」状態で存在しなくてもよいです。サービスには完了するか、いないされていない行は、スクリプトランタイムシステムによって知られていません。"
    },
    {
      "indent": 12,
      "text": "Attempts to `destroy' a row or to set a row `notInService' while the script is executing will result in an inconsistentValue error.",
      "ja": "スクリプトの実行中 `破壊「行または列を設定する` notInServiceの」への試みはinconsistentValueエラーをもたらすであろう。"
    },
    {
      "indent": 7,
      "text": "     Attempts to `destroy' a row or to set a row `notInService'\n     where the value of the smScriptStorageType object is\n     `permanent' or `readOnly' will result in an\n     inconsistentValue error.\"\n::= { smScriptEntry 9 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "--\n-- Access to script code via SNMP\n--\n-- The smCodeTable allows script code to be read and modified\n-- via SNMP.\n-- smCodeTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmCodeEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table contains the script code for scripts that are\n         written via SNMP write operations.\"\n    ::= { smScriptObjects 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smCodeEntry OBJECT-TYPE\n    SYNTAX      SmCodeEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"An entry describing a particular fragment of a script.\"\n    INDEX { smScriptOwner, smScriptName, smCodeIndex }\n    ::= { smCodeTable 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "SmCodeEntry ::= SEQUENCE {\n    smCodeIndex         Unsigned32,\n    smCodeText          OCTET STRING,\n    smCodeRowStatus     RowStatus\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smCodeIndex OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The index value identifying this code fragment.\"\n    ::= { smCodeEntry 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smCodeText OBJECT-TYPE\n    SYNTAX      OCTET STRING (SIZE (1..1024))\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The code that makes up a fragment of a script. The format\n         of this code fragment depends on the script language which\n         is identified by the associated smScriptLanguage object.\"\n    ::= { smCodeEntry 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smCodeRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"A control that allows entries to be added and removed from",
      "ja": "smCodeRowStatusのOBJECT-TYPE構文RowStatus MAX-ACCESSはリード作成ステータス現在の説明「エントリから追加および削除することを可能にする制御"
    },
    {
      "indent": 7,
      "text": "     this table.\"\n::= { smCodeEntry 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- -- Script execution. -- -- This group defines tables which allow script execution to be -- initiated, suspended, resumed, and terminated. It also provides -- a mechanism for keeping a history of recent script executions -- and their results. --",
      "ja": " -   - スクリプトの実行。 -   - 、開始中断、再開、および終了 - このグループには、スクリプトの実行ができるようにするテーブルを定義します。また、提供 - 最近のスクリプトの実行の履歴を維持するためのメカニズム - とその結果を。 - "
    },
    {
      "indent": 3,
      "text": "smRunObjects OBJECT IDENTIFIER ::= { smObjects 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmLaunchEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table lists and describes scripts that are ready\n         to be executed together with their parameters.\"\n    ::= { smRunObjects 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchEntry OBJECT-TYPE\n    SYNTAX      SmLaunchEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"An entry describing a particular executable script.\"\n    INDEX { smLaunchOwner, smLaunchName }\n    ::= { smLaunchTable 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "SmLaunchEntry ::= SEQUENCE {\n    smLaunchOwner               SnmpAdminString,\n    smLaunchName                SnmpAdminString,\n    smLaunchScriptOwner         SnmpAdminString,\n    smLaunchScriptName          SnmpAdminString,\n    smLaunchArgument            OCTET STRING,\n    smLaunchMaxRunning          Unsigned32,\n    smLaunchMaxCompleted        Unsigned32,\n    smLaunchLifeTime            TimeInterval,\n    smLaunchExpireTime          TimeInterval,\n    smLaunchStart               Integer32,\n    smLaunchControl             INTEGER,\n    smLaunchAdminStatus         INTEGER,\n    smLaunchOperStatus          INTEGER,\n    smLaunchRunIndexNext        Integer32,\n    smLaunchStorageType         StorageType, smLaunchRowStatus           RowStatus\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchOwner OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS not-accessible STATUS current DESCRIPTION",
      "ja": "smLaunchOwner OBJECT-TYPE SYNTAXれるSnmpAdminString（SIZE（0 32））MAX-ACCESSステータス現在の説明"
    },
    {
      "indent": 7,
      "text": "    \"The manager who owns this row in the smLaunchTable. Every\n     instance of a running script started from a particular entry\n     in the smLaunchTable (i.e. entries in the smRunTable) will be\n     owned by the same smLaunchOwner used to index the entry in\n     the smLaunchTable. This owner is not necessarily the same as\n     the owner of the script itself (smLaunchScriptOwner).\"\n::= { smLaunchEntry 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchName OBJECT-TYPE\n    SYNTAX      SnmpAdminString (SIZE (1..32))\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The locally-unique, administratively assigned name for this\n         launch table entry. This object allows an smLaunchOwner to\n         have multiple entries in the smLaunchTable. The smLaunchName\n         is an arbitrary name that must be different from any other\n         smLaunchTable entries with the same smLaunchOwner but can be\n         the same as other entries in the smLaunchTable with different\n         smLaunchOwner values. Note that the value of smLaunchName\n         is not related in any way to the name of the script being\n         launched.\"\n    ::= { smLaunchEntry 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchScriptOwner OBJECT-TYPE\n    SYNTAX      SnmpAdminString (SIZE (0..32))\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The value of this object in combination with the value of\n         smLaunchScriptName identifies the script that can be\n         launched from this smLaunchTable entry. Attempts to write\n         this object will fail with an inconsistentValue error if\n         the value of smLaunchOperStatus is `enabled'.\"\n    ::= { smLaunchEntry 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchScriptName OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-create",
      "ja": "smLaunchScriptNameのOBJECT-TYPE SYNTAXれるSnmpAdminString（SIZE（0 32））MAX-ACCESSはリード作成します"
    },
    {
      "indent": 7,
      "text": "STATUS      current\nDESCRIPTION\n    \"The value of this object in combination with the value of\n     the smLaunchScriptOwner identifies the script that can be\n     launched from this smLaunchTable entry. Attempts to write\n     this objects will fail with an inconsistentValue error if\n     the value of smLaunchOperStatus is `enabled'.\"\n::= { smLaunchEntry 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchArgument OBJECT-TYPE\n    SYNTAX      OCTET STRING\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The argument supplied to the script. When a script is\n         invoked, the value of this object is used to initialize\n         the smRunArgument object.\"\n    DEFVAL { ''H }\n    ::= { smLaunchEntry 5 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchMaxRunning OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The maximum number of concurrently running scripts that may\n         be invoked from this entry in the smLaunchTable. Lowering the\n         current value of this object does not affect any scripts that\n         are already executing.\"\n    DEFVAL { 1 }\n    ::= { smLaunchEntry 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchMaxCompleted OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The maximum number of finished scripts invoked from this\n         entry in the smLaunchTable allowed to be retained in the\n         smRunTable. Whenever the value of this object is changed\n         and whenever a script terminates, entries in the smRunTable\n         are deleted if necessary until the number of completed\n         scripts is smaller than the value of this object. Scripts\n         whose smRunEndTime value indicates the oldest completion\n         time are deleted first.\"\n    DEFVAL { 1 }\n    ::= { smLaunchEntry 7 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchLifeTime OBJECT-TYPE\n    SYNTAX      TimeInterval\n    UNITS       \"centi-seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The default maximum amount of time a script launched\n         from this entry may run. The value of this object is used\n         to initialize the smRunLifeTime object when a script is\n         launched. Changing the value of an smLaunchLifeTime\n         instance does not affect scripts previously launched from\n         this entry.\"\n    DEFVAL { 360000 }\n    ::= { smLaunchEntry 8 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchExpireTime OBJECT-TYPE\n    SYNTAX      TimeInterval\n    UNITS       \"centi-seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The default maximum amount of time information about a\n         script launched from this entry is kept in the smRunTable\n         after the script has completed execution.  The value of\n         this object is used to initialize the smRunExpireTime\n         object when a script is launched. Changing the value of an\n         smLaunchExpireTime instance does not affect scripts\n         previously launched from this entry.\"\n    DEFVAL { 360000 }\n    ::= { smLaunchEntry 9 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchStart OBJECT-TYPE SYNTAX Integer32 (0..2147483647) MAX-ACCESS read-create STATUS current DESCRIPTION \"This object is used to start the execution of scripts. When retrieved, the value will be the value of smRunIndex for the last script that started execution by manipulating this object. The value will be zero if no script started execution yet.",
      "ja": "smLaunchStartのOBJECT-TYPE構文Integer32（0 2147483647）MAX-ACCESSはリード作成しますステータス現在の説明は「このオブジェクトは、スクリプトの実行を開始するために使用される。取得した場合、値は最後に起動スクリプトのsmRunIndexの値になります何のスクリプトはまだ実行を開始しない場合は、このオブジェクトを操作することによって実行。値はゼロになります。"
    },
    {
      "indent": 12,
      "text": "A script is started by setting this object to an unused\nsmRunIndex value. A new row in the smRunTable will be\ncreated which is indexed by the value supplied by the\nset-request in addition to the value of smLaunchOwner and\nsmLaunchName. An unused value can be obtained by reading\nthe smLaunchRunIndexNext object.",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Setting this object to the special value 0 will start the script with a self-generated smRunIndex value. The consequence is that the script invoker has no reliable way to determine the smRunIndex value for this script invocation and that the invoker has therefore no way to obtain the results from this script invocation. The special value 0 is however useful for scheduled script invocations.",
      "ja": "特別な値0にこのオブジェクトを設定する自己生成smRunIndex値でスクリプトを起動します。結果は、スクリプト呼び出しこのスクリプト呼び出しのsmRunIndex値を決定するための信頼できる方法がないことと呼び出ししたがって、このスクリプトの呼び出しの結果を取得する方法がないことです。特別な値0は、スケジュールスクリプトの呼び出しのためにしかし便利です。"
    },
    {
      "indent": 12,
      "text": "If this object is set, the following checks must be performed:",
      "ja": "このオブジェクトが設定されている場合は、以下のチェックを実行する必要があります。"
    },
    {
      "indent": 12,
      "text": "1) The value of the smLaunchOperStatus object in this entry of the smLaunchTable must be `enabled'. 2) The values of smLaunchScriptOwner and smLaunchScriptName of this row must identify an existing entry in the smScriptTable. 3) The value of smScriptOperStatus of this entry must be `enabled'. 4) The principal performing the set operation must have read access to the script. This must be checked by calling the isAccessAllowed abstract service interface defined in RFC 2271 on the row in the smScriptTable identified by smLaunchScriptOwner and smLaunchScriptName. The isAccessAllowed abstract service interface must be called on all columnar objects in the smScriptTable with a MAX-ACCESS value different than `not-accessible'. The test fails as soon as a call indicates that access is not allowed. 5) If the value provided by the set operation is not 0, a check must be made that the value is currently not in use. Otherwise, if the value provided by the set operation is 0, a suitable unused value must be generated. 6) The number of currently executing scripts invoked from this smLaunchTable entry must be less than smLaunchMaxRunning.",
      "ja": "1）smLaunchTableのこのエントリにsmLaunchOperStatusオブジェクトの値は '」を有効にする必要があります。 2）smLaunchScriptOwnerとこの行のsmLaunchScriptNameの値はsmScriptTableの既存のエントリを識別しなければなりません。 3）このエントリのsmScriptOperStatusの値は、 `」有効にする必要があります。 4）集合演算を行う主体は、スクリプトへの読み取りアクセス権がなければなりません。これはsmLaunchScriptOwnerとsmLaunchScriptNameで識別smScriptTableの行にRFC 2271で定義されてisAccessAllowedの抽象サービスインタフェースを呼び出すことによってチェックされなければなりません。 isAccessAllowedの抽象サービスインタフェースは、「`アクセス不可能とは異なるMAX-ACCESS値を持つsmScriptTable内のすべての円柱状のオブジェクトで呼び出さなければなりません。呼び出しはアクセスが許可されていないことを示しているように、テストはすぐに失敗します。セット動作によって提供される値が0でない場合は5）、チェック値が現在使用されていないと判断されなければなりません。セット動作によって提供される値が0であればそうでない場合、適当な未使用の値が生成されなければなりません。 6）このsmLaunchTableエントリから呼び出され、現在実行中のスクリプトの数がsmLaunchMaxRunning未満でなければなりません。"
    },
    {
      "indent": 12,
      "text": "Attempts to start a script will fail with an inconsistentValue error if one of the checks described above fails.",
      "ja": "上記のチェックのいずれかが失敗した場合にはinconsistentValueエラーで失敗するスクリプトを起動しようとします。"
    },
    {
      "indent": 12,
      "text": "Otherwise, if all checks have been passed, a new entry in the smRunTable will be created indexed by smLaunchOwner, smLaunchName and the new value for smRunIndex. The value of smLaunchArgument will be copied into smRunArgument, the value of smLaunchLifeTime will be copied to smRunLifeTime, and the value of smLaunchExpireTime will be copied to smRunExpireTime.",
      "ja": "すべてのチェックが渡されている場合はそれ以外の場合は、smRunTableに新しいエントリはsmLaunchOwner、smLaunchNameとsmRunIndexの新しい値でインデックス化が作成されます。 smLaunchArgumentの値はsmLaunchLifeTimeの値がsmRunLifeTimeにコピーされ、smLaunchExpireTimeの値がsmRunExpireTimeにコピーされ、smRunArgumentにコピーされます。"
    },
    {
      "indent": 12,
      "text": "The smRunStartTime will be set to the current time and the smRunState will be set to `initializing' before the script execution is initiated in the appropriate runtime system.",
      "ja": "smRunStartTimeは、現在の時刻に設定され、スクリプトの実行が適切なランタイムシステムで開始される前にsmRunStateは `初期化」に設定されます。"
    },
    {
      "indent": 7,
      "text": "     Note, the data type and the range of this object must\n     be consistent with the smRunIndex object. Since this\n     object might be written from the scheduling MIB, the\n     data type Integer32 rather than Unsigned32 is used.\"\nDEFVAL { 0 }\n::= { smLaunchEntry 10 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchControl OBJECT-TYPE SYNTAX INTEGER { abort(1), suspend(2), resume(3), nop(4) } MAX-ACCESS read-create STATUS current DESCRIPTION \"This object is used to request a state change for all running scripts in the smRunTable that were started from this row in the smLaunchTable.",
      "ja": "smLaunchControlのOBJECT-TYPE SYNTAX INTEGERは、{（1）、（2）、レジュームサスペンドアボート（3）、NOP（4）} MAX-ACCESSリード作成ステータス現在の説明は「このオブジェクトは、実行中のすべてのスクリプトの状態の変更を要求するために使用されていますsmLaunchTableにこの行から開始したsmRunTableインチ"
    },
    {
      "indent": 7,
      "text": "     Setting this object to abort(1), suspend(2) or resume(3)\n     will set the smRunControl object of all applicable rows\n     in the smRunTable to abort(1), suspend(2) or resume(3)\n     respectively. The phrase `applicable rows' means the set of\n     rows which were created from this entry in the smLaunchTable\n     and whose value of smRunState allows the corresponding\n     state change as described in the definition of the\n     smRunControl object. Setting this object to nop(4) has no\n     effect.\"\nDEFVAL { nop }\n::= { smLaunchEntry 11 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchAdminStatus OBJECT-TYPE SYNTAX INTEGER { enabled(1), disabled(2) } MAX-ACCESS read-create STATUS current DESCRIPTION",
      "ja": "smLaunchAdminStatusのOBJECT-TYPE SYNTAX INTEGER {イネーブル（1）、無効（2）} MAX-ACCESSはリード作成ステータス現在の説明"
    },
    {
      "indent": 7,
      "text": "    \"The value of this object indicates the desired status of\n     this launch table entry.\"\nDEFVAL { disabled }\n::= { smLaunchEntry 12 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchOperStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    enabled(1),\n                    disabled(2)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The value of this object indicates the actual status of\n         this launch table entry. An `enabled' launch table\n         entry can be used to start scripts while a `disabled'\n         launch table entry will refuse any attempts to start\n         scripts. The value `enabled' requires that the\n         smLaunchRowStatus object is active. The value\n         `disabled' requires that there are no entries in the\n         smRunTable associated with this smLaunchTable entry.\"\n    DEFVAL { disabled }\n    ::= { smLaunchEntry 13 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchRunIndexNext OBJECT-TYPE SYNTAX Integer32 (1..2147483647) MAX-ACCESS read-only STATUS current DESCRIPTION \"This variable is used for creating rows in the smRunTable. The value of this variable is a currently unused value for smRunIndex, which can be written into the smLaunchStart object associated with this row to launch a script.",
      "ja": "smLaunchRunIndexNext OBJECT-TYPE構文Integer32（1 2147483647）MAX-ACCESS read-only説明は「この変数はsmRunTableの行を作成するために使用される。この変数の値を書き込むことができるsmRunIndex、のために現在使用されていない値です。この行に関連付けられているsmLaunchStartオブジェクトにスクリプトを起動します。"
    },
    {
      "indent": 12,
      "text": "The value returned when reading this variable must be unique\nfor the smLaunchOwner and smLauchName associated with this\nrow. Subsequent attempts to read this variable must return\ndifferent values.",
      "raw": true
    },
    {
      "indent": 12,
      "text": "This variable will return the special value 0 if no new rows can be created.",
      "ja": "新しい行が作成できない場合は、この変数は特別な値0を返します。"
    },
    {
      "indent": 7,
      "text": "     Note, the data type and the range of this object must be\n     consistent with the definition of smRunIndex.\"\n::= { smLaunchEntry 14 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchStorageType OBJECT-TYPE SYNTAX StorageType",
      "ja": "smLaunchStorageTypeのOBJECT-TYPE SYNTAX StorageType"
    },
    {
      "indent": 7,
      "text": "MAX-ACCESS  read-create\nSTATUS      current\nDESCRIPTION\n    \"This object defines if this row is kept in volatile storage\n     and lost upon reboot or if this row is backed up by stable\n     storage.",
      "raw": true
    },
    {
      "indent": 12,
      "text": "The value of smLaunchStorageType is only meaningful if the\nvalue of the corresponding RowStatus object is active.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "     If smLaunchStorageType has the value permanent(4), then all\n     objects whose MAX-ACCESS value is read-create must be\n     writable, with the exception of the smLaunchStorageType and\n     smLaunchRowStatus objects, which shall be read-only.\"\nDEFVAL { volatile }\n::= { smLaunchEntry 15 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"A control that allows entries to be added and removed from this table.",
      "ja": "smLaunchRowStatusのOBJECT-TYPE構文RowStatus MAX-ACCESSリード作成ステータス現在の説明「エントリが追加され、このテーブルから削除されることを可能にする制御。"
    },
    {
      "indent": 12,
      "text": "Attempts to `destroy' a row or to set a row `notInService'\nwhile scripts started from this launch table entry are\nrunning will result in an inconsistentValue error.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "     Attempts to `destroy' a row or to set a row `notInService'\n     where the value of the smLaunchStorageType object is\n     `permanent' or `readOnly' will result in an\n     inconsistentValue error.\"\n::= { smLaunchEntry 16 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmRunEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table lists and describes scripts that are currently\n         running or have been running in the past.\"\n    ::= { smRunObjects 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunEntry OBJECT-TYPE SYNTAX SmRunEntry MAX-ACCESS not-accessible",
      "ja": "smRunEntryのOBJECT-TYPE SYNTAX SmRunEntryアクセス不可能なMAX-ACCESS"
    },
    {
      "indent": 7,
      "text": "STATUS      current\nDESCRIPTION\n    \"An entry describing a particular running or finished\n     script.\"\nINDEX { smLaunchOwner, smLaunchName, smRunIndex }\n::= { smRunTable 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "SmRunEntry ::= SEQUENCE {\n    smRunIndex          Integer32,\n    smRunArgument       OCTET STRING,\n    smRunStartTime      DateAndTime,\n    smRunEndTime        DateAndTime,\n    smRunLifeTime       TimeInterval,\n    smRunExpireTime     TimeInterval,\n    smRunExitCode       INTEGER,\n    smRunResult         OCTET STRING,\n    smRunControl        INTEGER,\n    smRunState          INTEGER,\n    smRunError          SnmpAdminString\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunIndex OBJECT-TYPE SYNTAX Integer32 (1..2147483647) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The locally arbitrary, but unique identifier associated with this running or finished script. This value must be unique for all rows in the smRunTable with the same smLaunchOwner and smLaunchName.",
      "ja": "smRunIndex OBJECT-TYPE構文Integer32（1 2147483647）MAX-ACCESSステータス現在の説明は「でローカルには任意ですが、この実行中または終了スクリプトに関連付けられた一意の識別子。この値は、smRunTable内のすべての行に対して一意である必要があります同じsmLaunchOwnerとsmLaunchName。"
    },
    {
      "indent": 7,
      "text": "     Note, the data type and the range of this object must be\n     consistent with the definition of smLaunchRunIndexNext\n     and smLaunchStart.\"\n::= { smRunEntry 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunArgument OBJECT-TYPE\n    SYNTAX      OCTET STRING\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The argument supplied to the script when it started.\"\n    DEFVAL { ''H }\n    ::= { smRunEntry 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunStartTime OBJECT-TYPE SYNTAX DateAndTime MAX-ACCESS read-only",
      "ja": "smRunStartTimeのOBJECT-TYPE SYNTAXのDateAndTime MAX-ACCESS読み取り専用"
    },
    {
      "indent": 7,
      "text": "STATUS      current\nDESCRIPTION\n    \"The date and time when the execution started. The value\n     '0000000000000000'H is returned if the script has not\n     started yet.\"\nDEFVAL { '0000000000000000'H }\n::= { smRunEntry 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunEndTime OBJECT-TYPE\n    SYNTAX      DateAndTime\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The date and time when the execution terminated. The value\n         '0000000000000000'H is returned if the script has not\n         terminated yet.\"\n    DEFVAL { '0000000000000000'H }\n    ::= { smRunEntry 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunLifeTime OBJECT-TYPE SYNTAX TimeInterval UNITS \"centi-seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"This object specifies how long the script can execute. This object returns the remaining time that the script may run. The object is initialized with the value of the associated smLaunchLifeTime object and ticks backwards. The script is aborted immediately when the value reaches 0.",
      "ja": "smRunLifeTimeのOBJECT-TYPE SYNTAX時間間隔の単位は「センチ秒」MAX-ACCESS読み取りと書き込みステータス現在の説明は「このオブジェクトはスクリプトが実行できる時間を指定します。このオブジェクトは、スクリプトが実行可能というの残り時間を返します。オブジェクトがで初期化されます関連smLaunchLifeTimeオブジェクトの値および下位ティック値が0に達したとき。スクリプトが直ちに中止されます。"
    },
    {
      "indent": 12,
      "text": "The value of this object may be set in order to increase or\nreduce the remaining time that the script may run. Setting\nthis value to 0 will abort script execution immediately,\nand, if the value of smRunExpireTime is also 0, will remove\nthis entry from the smRunTable once it has terminated.",
      "raw": true
    },
    {
      "indent": 12,
      "text": "The value of smRunLifeTime reflects the real-time execution time as seen by the outside world. The value of this object will always be 0 for a script that finished execution, that is smRunState has the value `terminated'.",
      "ja": "smRunLifeTimeの値は、外の世界で見られるように、リアルタイムの実行時間を反映しています。このオブジェクトの値は常にそれがsmRunState「の値 `終了を持っている、実行が終了するスクリプトの場合は0になります。"
    },
    {
      "indent": 7,
      "text": "     The value of smRunLifeTime does not change while a script\n     is suspended, that is smRunState has the value `suspended'.\n     Note, this does not affect set operations. It is legal to\n     modify smRunLifeTime via set operations while a script is\n     suspended.\"\n::= { smRunEntry 5 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunExpireTime OBJECT-TYPE SYNTAX TimeInterval UNITS \"centi-seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"This value specifies how long this row can exist in the smRunTable after the script has terminated. This object returns the remaining time that the row may exist before it is aged out. The object is initialized with the value of the associated smLaunchExpireTime object and ticks backwards. The entry in the smRunTable is destroyed when the value reaches 0 and the smRunState has the value `terminated'.",
      "ja": "smRunExpireTimeのOBJECT-TYPE SYNTAX時間間隔の単位は「センチ秒」MAX-ACCESS読み取りと書き込みステータス現在の説明は「この値は、スクリプトが終了した後、この行はsmRunTableに存在できる時間を指定します。このオブジェクトは、残り時間を返す行がかもしれないことそれが期限切れになる前に存在する。オブジェクトは、関連smLaunchExpireTimeオブジェクトの値で初期化され、値が0に達するとsmRunState値 '終了」を有する場合後方。smRunTableのエントリが破壊されティック。"
    },
    {
      "indent": 7,
      "text": "     The value of this object may be set in order to increase or\n     reduce the remaining time that the row may exist.  Setting\n     the value to 0 will destroy this entry as soon as the\n     smRunState has the value `terminated'.\"\n::= { smRunEntry 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunExitCode OBJECT-TYPE SYNTAX INTEGER { noError(1), halted(2), lifeTimeExceeded(3), noResourcesLeft(4), languageError(5), runtimeError(6), invalidArgument(7), securityViolation(8), genericError(9) } MAX-ACCESS read-only STATUS current DESCRIPTION \"The value of this object indicates the reason why a script finished execution. The smRunExitCode code may have one of the following values:",
      "ja": "smRunExitCodeのOBJECT-TYPE SYNTAX INTEGERは{NOERROR（1）、（2）、lifeTimeExceeded（3）、noResourcesLeft（4）、languageError（5）はRuntimeError（6）、invalidArgument（7）、セキュリティ違反（8）、genericError（9停止しました）} MAX-ACCESS read-only説明は「このオブジェクトの値は、スクリプトの実行が終了した理由が示すsmRunExitCodeコードは、次のいずれかの値を有することができます。："
    },
    {
      "indent": 12,
      "text": "- `noError', which indicates that the script completed\n   successfully without errors;",
      "raw": true
    },
    {
      "indent": 12,
      "text": "- `halted', which indicates that the script was halted by a request from an authorized manager;",
      "ja": " -  `スクリプトが認証マネージャからの要求によって停止されたことを示す、「停止。"
    },
    {
      "indent": 12,
      "text": "- `lifeTimeExceeded', which indicates that the script exited because a time limit was exceeded;",
      "ja": " -  `制限時間を超えたため、スクリプトが終了したことを示す、「lifeTimeExceeded。"
    },
    {
      "indent": 12,
      "text": "- `noResourcesLeft', which indicates that the script exited because it ran out of resources (e.g. memory);",
      "ja": " - それはリソース（例えばメモリ）が不足しているため、スクリプトが終了したことを示している `noResourcesLeft」、。"
    },
    {
      "indent": 12,
      "text": "- `languageError', which indicates that the script exited because of a language error (e.g. a syntax error in an interpreted language);",
      "ja": " - スクリプトが原因言語エラーの終了したことを示し `languageError」、（例えば、インタプリタ言語の構文エラー）。"
    },
    {
      "indent": 12,
      "text": "- `runtimeError', which indicates that the script exited due to a runtime error (e.g. a division by zero);",
      "ja": " - による実行時エラーにスクリプトが終了したことを示している `はRuntimeError」、（ゼロによる除算など）。"
    },
    {
      "indent": 12,
      "text": "- `invalidArgument', which indicates that the script could not be run because of invalid script arguments;",
      "ja": " - スクリプトが無効なため、スクリプトの引数を実行することができなかったことを示している `invalidArgument」;"
    },
    {
      "indent": 12,
      "text": "- `securityViolation', which indicates that the script exited due to a security violation;",
      "ja": " - スクリプトは、セキュリティ違反により終了したことを示している `セキュリティ違反」;"
    },
    {
      "indent": 12,
      "text": "- `genericError', which indicates that the script exited for an unspecified reason.",
      "ja": " - スクリプトが指定されていない理由で終了したことを示している `genericError」、。"
    },
    {
      "indent": 7,
      "text": "     If the script has not yet begun running, or is currently\n     running, the value will be `noError'.\"\nDEFVAL { noError }\n::= { smRunEntry 7 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunResult OBJECT-TYPE\n    SYNTAX      OCTET STRING\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The result value produced by the running script. Note that\n         the result may change while the script is executing.\"\n    DEFVAL { ''H }\n    ::= { smRunEntry 8 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunControl OBJECT-TYPE SYNTAX INTEGER { abort(1), suspend(2), resume(3), nop(4) } MAX-ACCESS read-write STATUS current DESCRIPTION \"The value of this object indicates the desired status of the script execution defined by this row.",
      "ja": "smRunControl OBJECT-TYPE構文INTEGERが{（1）、（2）、再開（3）サスペンドアボート、NOP（4）} MAX-ACCESS読み取りと書き込みステータス現在の説明「このオブジェクトの値は、スクリプトの実行の所望の状態を示しこの行によって定義されます。"
    },
    {
      "indent": 12,
      "text": "Setting this object to `abort' will abort execution if the value of smRunState is `initializing', `executing',\n`suspending', `suspended' or `resuming'. Setting this object\nto `abort' when the value of smRunState is `aborting' or\n`terminated' will result in an inconsistentValue error.",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Setting this object to `suspend' will suspend execution if the value of smRunState is `executing'. Setting this object to `suspend' will cause an inconsistentValue error if the value of smRunState is not `executing'.",
      "ja": "`一時停止するには、このオブジェクトを設定することは「smRunStateの値が`実行された場合に実行を停止します」。 `中断にこのオブジェクトを設定すると、「smRunStateの値が`実行されていない場合はinconsistentValueエラーが発生します」。"
    },
    {
      "indent": 12,
      "text": "Setting this object to `resume' will resume execution if the value of smRunState is `suspending' or `suspended'. Setting this object to `resume' will cause an inconsistentValue error if the value of smRunState is not `suspending' or `suspended'.",
      "ja": "または `「`中断、再開にこのオブジェクトを設定すると、「smRunStateの値が `中断された場合に実行を再開します」。または `「`中断、再開にこのオブジェクトを設定すると、「smRunStateの値は `中断されていない場合にはinconsistentValueエラーが発生します」。"
    },
    {
      "indent": 7,
      "text": "     Setting this object to nop(4) has no effect.\"\nDEFVAL { nop }\n::= { smRunEntry 9 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunState OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    initializing(1),\n                    executing(2),\n                    suspending(3),\n                    suspended(4),\n                    resuming(5),\n                    aborting(6),\n                    terminated(7)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The value of this object indicates the script's execution\n         status.  If the script has been invoked but has not yet\n         begun execution, the value will be `initializing'. If the\n         script is running, the value will be `executing'. A script\n         which received a request to suspend execution but which\n         did not actually suspend execution will be `suspending'.\n         A script which has suspended execution will be `suspended'.\n         A script which received a request to resume execution but\n         which is not yet running is `resuming'. The resuming state\n         will finally lead to the `executing' state. A script which\n         received a request to abort execution but which is still\n         running is `aborting'. A script which stopped execution\n         is `terminated'.\"\n    ::= { smRunEntry 10 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunError OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \"This contains a descriptive error message if the script terminates in an abnormally. An implementation must store a descriptive error message in this object if the script exits with the smRunExitCode `genericError'.",
      "ja": "スクリプトが異常に終了した場合smRunErrorのOBJECT-TYPE SYNTAXれるSnmpAdminString MAX-ACCESS read-onlyステータス現在の説明は「これは、わかりやすいエラーメッセージが含まれています。スクリプトはsmRunExitCode `で終了した場合、実装は、このオブジェクトでわかりやすいエラーメッセージを格納する必要がありgenericError 」。"
    },
    {
      "indent": 7,
      "text": "     The value of this object is the zero-length string as long\n     as the smRunExitCode has the value `noError'\"\nDEFVAL { ''H }\n::= { smRunEntry 11 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- -- Notifications. The definition of smTraps makes notification -- registrations reversible (see STD 58, RFC 2578). --",
      "ja": " -   - 通知。 smTrapsの定義は、通知を行う - リバーシブル登録（STD 58、RFC 2578を参照してください）。 - "
    },
    {
      "indent": 3,
      "text": "smTraps OBJECT IDENTIFIER ::= { smNotifications 0 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptAbort NOTIFICATION-TYPE\n    OBJECTS     { smRunExitCode, smRunEndTime, smRunError }\n    STATUS      current\n    DESCRIPTION\n        \"This notification is generated whenever a running script\n         terminates with an smRunExitCode unequal to `noError'.\"\n    ::= { smTraps 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptResult NOTIFICATION-TYPE OBJECTS { smRunResult } STATUS current DESCRIPTION \"This notification can be used by scripts to notify other management applications about script results. It can be used to notify managers about a script result.",
      "ja": "smScriptResultのNOTIFICATION-TYPEオブジェクト{smRunResult}ステータス現在の説明は「この通知は、スクリプト結果に関する他の管理アプリケーションに通知するためにスクリプトで使用することができる。スクリプトの結果について管理者に通知するために使用することができます。"
    },
    {
      "indent": 7,
      "text": "     This notification is not automatically generated by the\n     script MIB implementation. It is the responsibility of\n     the executing script to emit this notification where it\n     is appropriate to do so.\"\n::= { smTraps 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- conformance information\nsmCompliances OBJECT IDENTIFIER ::= { smConformance 1 }\nsmGroups      OBJECT IDENTIFIER ::= { smConformance 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- compliance statements",
      "ja": " - コンプライアンスステートメント"
    },
    {
      "indent": 3,
      "text": "smCompliance MODULE-COMPLIANCE\n    STATUS      current\n    DESCRIPTION\n        \"The compliance statement for SNMP entities which implement\n         the script MIB.\"\n    MODULE      -- this module\n    MANDATORY-GROUPS {\n            smLanguageGroup, smScriptGroup, smLaunchGroup, smRunGroup\n    }\n    GROUP   smCodeGroup\n    DESCRIPTION\n        \"The smCodeGroup is mandatory only for those implementations\n         that support the downloading of scripts via SNMP.\"\n    OBJECT  smScriptSource\n    MIN-ACCESS  read-only\n    DESCRIPTION\n        \"The smScriptSource object is read-only for implementations\n         that are not able to download script code from a URL.\"\n    OBJECT smLaunchArgument\n    DESCRIPTION\n        \"A compliant implementation has to support a minimum size\n         for smLaunchArgument of 255 octets.\"\n    OBJECT smRunArgument\n    DESCRIPTION\n        \"A compliant implementation has to support a minimum size\n         for smRunArgument of 255 octets.\"\n    OBJECT smRunResult\n    DESCRIPTION\n        \"A compliant implementation has to support a minimum size\n         for smRunResult of 255 octets.\"\n    OBJECT smRunState\n    DESCRIPTION\n        \"A compliant implementation does not have to support script\n         suspension and the smRunState `suspended'. Such an\n         implementation will change into the `suspending' state\n         when the smRunControl is set to `suspend' and remain in this\n         state until smRunControl is set to `resume' or the script\n         terminates.\"\n    ::= { smCompliances 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLanguageGroup OBJECT-GROUP\n    OBJECTS {\n        smLangLanguage,\n        smLangVersion,\n        smLangVendor,\n        smLangRevision, smLangDescr,\n        smExtsnExtension,\n        smExtsnVersion,\n        smExtsnVendor,\n        smExtsnRevision,\n        smExtsnDescr\n    }\n    STATUS      current\n    DESCRIPTION\n        \"A collection of objects providing information about the\n         capabilities of the scripting engine.\"\n    ::= { smGroups 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smScriptGroup OBJECT-GROUP\n    OBJECTS {\n        smScriptDescr,\n        smScriptLanguage,\n        smScriptSource,\n        smScriptAdminStatus,\n        smScriptOperStatus,\n        smScriptStorageType,\n        smScriptRowStatus\n    }\n    STATUS      current\n    DESCRIPTION\n        \"A collection of objects providing information about\n         installed scripts.\"\n    ::= { smGroups 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smCodeGroup OBJECT-GROUP\n    OBJECTS {\n        smCodeText,\n        smCodeRowStatus\n    }\n    STATUS      current\n    DESCRIPTION\n        \"A collection of objects used to download or modify scripts\n         by using SNMP set requests.\"\n    ::= { smGroups 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smLaunchGroup OBJECT-GROUP\n    OBJECTS {\n        smLaunchScriptOwner,\n        smLaunchScriptName,\n        smLaunchArgument,\n        smLaunchMaxRunning,\n        smLaunchMaxCompleted,\n        smLaunchLifeTime, smLaunchExpireTime,\n        smLaunchStart,\n        smLaunchControl,\n        smLaunchAdminStatus,\n        smLaunchOperStatus,\n        smLaunchRunIndexNext,\n        smLaunchStorageType,\n        smLaunchRowStatus\n    }\n    STATUS      current\n    DESCRIPTION\n        \"A collection of objects providing information about scripts\n         that can be launched.\"\n    ::= { smGroups 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smRunGroup OBJECT-GROUP\n    OBJECTS {\n        smRunArgument,\n        smRunStartTime,\n        smRunEndTime,\n        smRunLifeTime,\n        smRunExpireTime,\n        smRunExitCode,\n        smRunResult,\n        smRunState,\n        smRunControl,\n        smRunError\n    }\n    STATUS      current\n    DESCRIPTION\n        \"A collection of objects providing information about running\n         scripts.\"\n    ::= { smGroups 5 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "smNotificationsGroup NOTIFICATION-GROUP\n    NOTIFICATIONS {\n        smScriptAbort,\n        smScriptResult\n    }\n    STATUS      current\n    DESCRIPTION\n        \"The notifications emitted by the script MIB.\"\n    ::= { smGroups 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "7. Usage Examples",
      "section_title": true,
      "ja": "7.使用例"
    },
    {
      "indent": 3,
      "text": "This section presents some examples that explain how a manager can use the Script MIB defined in this memo. The purpose of these examples is to explain the steps that are normally used to delegate management scripts.",
      "ja": "このセクションでは、管理者はこのメモで定義されたスクリプトMIBを使用する方法を説明し、いくつかの例を示します。これらの例の目的は、通常、管理スクリプトを委任するために使用されている手順を説明することです。"
    },
    {
      "indent": 0,
      "text": "7.1. Pushing a script via SNMP",
      "section_title": true,
      "ja": "7.1.  SNMP経由でスクリプトを押します"
    },
    {
      "indent": 3,
      "text": "This example explains the steps performed by a manager to push a script into a distributed manager.",
      "ja": "この例では、分散管理者にスクリプトをプッシュするマネージャによって実行されるステップを説明します。"
    },
    {
      "indent": 3,
      "text": "1. The manager first checks the smLanguageTable and the smExtensionTable in order to select the appropriate script or language.",
      "ja": "1.マネージャは、最初に適切なスクリプトまたは言語を選択するためにsmLanguageTableとsmExtensionTableをチェックします。"
    },
    {
      "indent": 3,
      "text": "2. The manager creates a row in the smScriptTable by issuing an SNMP set-request. The smScriptRowStatus object is set to `createAndWait' and the smScriptSource object is set to an empty string. The smScriptLanguage object is set to the language in which the script was written. The smScriptStorageType object is set to `volatile' to indicate that the script will be loaded via the smCodeTable. The smScriptOwner is set to a string which identifies the principal who owns the new row. The smScriptName defines the administratively assigned unique name for the script.",
      "ja": "2.管理者は、SNMPセット要求を発行することによってsmScriptTableの行を作成します。 smScriptRowStatusオブジェクトは `createAndWaitに」に設定されており、smScriptSourceオブジェクトが空の文字列に設定されています。 smScriptLanguageオブジェクトは、スクリプトが書かれた言語に設定されています。 smScriptStorageTypeオブジェクトは、スクリプトがsmCodeTable経由でロードされることを示すために「`揮発性に設定されています。 smScriptOwnerは、新しい行を所有するプリンシパルを識別する文字列に設定されています。 smScriptNameは、スクリプトの管理上割り当てられた一意の名前を定義します。"
    },
    {
      "indent": 3,
      "text": "3. The manager sets the smScriptRowStatus object to `active' and the smScriptAdminStatus object to `editing'.",
      "ja": "3.マネージャは `の編集およびsmScriptAdminStatusオブジェクトのアクティブ`にsmScriptRowStatusオブジェクトを設定します。"
    },
    {
      "indent": 3,
      "text": "4. The manager pushes the script to the distributed manager by issuing a couple of SNMP set-requests to fill the smCodeTable.",
      "ja": "4.管理者は、smCodeTableを埋めるためにSNMPセット - リクエストのカップルを発行することにより、分散マネージャにスクリプトをプッシュ。"
    },
    {
      "indent": 3,
      "text": "5. Once the whole script has been transferred, the manager sends a set-request to set the smScriptAdminStatus object to `enabled'. The Script MIB implementation now makes the script accessible to the runtime system. This might include the compilation of the script if the language requires a compilation step.",
      "ja": "スクリプト全体が転送された後5、マネージャーは `「有効にsmScriptAdminStatusオブジェクトを設定するには、Set-要求を送信します。スクリプトMIBの実装は現在、ランタイムシステムへのスクリプトがアクセスできるようになります。言語はコンパイルのステップを必要とする場合、これは、スクリプトのコンパイルが含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "6. The manager polls the smScriptOperStatus object until the value is either `enabled' or one of the error status codes. The script can only be used if the value of smScriptOperStatus is `enabled'.",
      "ja": "6.値までマネージャをポーリングsmScriptOperStatusオブジェクトのいずれか `有効」またはエラーステータスコードのいずれかです。 smScriptOperStatusの値が `」有効になっている場合、スクリプトにのみ使用することができます。"
    },
    {
      "indent": 3,
      "text": "7. If the manager wants to store the script in local non-volatile storage, it should send a set-request which changes the smScriptStorageType object to `nonVolatile'.",
      "ja": "7.管理者がローカル不揮発性ストレージにスクリプトを保存したい場合、それは `不揮発性」にsmScriptStorageTypeオブジェクトを変更し、セットのリクエストを送信する必要があります。"
    },
    {
      "indent": 0,
      "text": "7.2. Pulling a script from a URL",
      "section_title": true,
      "ja": "7.2.  URLからスクリプトを引っ張ります"
    },
    {
      "indent": 3,
      "text": "This example explains the steps performed by a manager to cause a distributed manager to pull a script from a URL.",
      "ja": "この例では、URLからスクリプトを引くために、分散マネージャを引き起こすために管理者によって実行されるステップを説明します。"
    },
    {
      "indent": 3,
      "text": "1. The manager first checks the smLanguageTable and the smExtensionTable in order to select the appropriate script or language.",
      "ja": "1.マネージャは、最初に適切なスクリプトまたは言語を選択するためにsmLanguageTableとsmExtensionTableをチェックします。"
    },
    {
      "indent": 3,
      "text": "2. The manager creates a row in the smScriptTable by issuing an SNMP set-request. The smScriptRowStatus object is set to `createAndWait' and the smScriptSource object is set to the URL which points to the script source. The smScriptLanguage object is set to the language in which the script was written. The smScriptOwner is set to a string which identifies the principal who owns the new row. The smScriptName defines the administratively assigned unique name for the script.",
      "ja": "2.管理者は、SNMPセット要求を発行することによってsmScriptTableの行を作成します。 smScriptRowStatusオブジェクトは `createAndWaitに」に設定されており、smScriptSourceオブジェクトは、スクリプトのソースを指すURLに設定されています。 smScriptLanguageオブジェクトは、スクリプトが書かれた言語に設定されています。 smScriptOwnerは、新しい行を所有するプリンシパルを識別する文字列に設定されています。 smScriptNameは、スクリプトの管理上割り当てられた一意の名前を定義します。"
    },
    {
      "indent": 3,
      "text": "3. The manager sets the smScriptRowStatus object to `active'.",
      "section_title": true,
      "ja": "3.マネージャは `アクティブにsmScriptRowStatusオブジェクトを設定します。"
    },
    {
      "indent": 3,
      "text": "4. The manager sends a set-request to set the smScriptAdminStatus object to `enabled'. The Script MIB implementation now makes the script accessible to the runtime system. This causes a retrieval operation to pull the script from the URL stored in smScriptSource. This retrieval operation might be followed by a compile operation if the language requires a compilation step.",
      "ja": "4.管理者は、 `「有効にsmScriptAdminStatusオブジェクトを設定するには、Set-要求を送信します。スクリプトMIBの実装は現在、ランタイムシステムへのスクリプトがアクセスできるようになります。これはsmScriptSourceに保存されているURLからスクリプトを引っ張って検索操作の原因となります。言語はコンパイルのステップを必要とする場合、この検索操作は、コンパイル作業が続いている可能性があります。"
    },
    {
      "indent": 3,
      "text": "5. The manager polls the smScriptOperStatus object until the value is either `enabled' or one of the error status codes. The script can only be used if the value of smScriptOperStatus is `enabled'.",
      "ja": "5.値までマネージャーをポーリングsmScriptOperStatusオブジェクトは、どちらか `有効」またはエラーステータスコードのいずれかです。 smScriptOperStatusの値が `」有効になっている場合、スクリプトにのみ使用することができます。"
    },
    {
      "indent": 3,
      "text": "6. If the manager wants to store the script in local non-volatile storage, it should send a set-request which changes the smScriptStorageType object to `nonVolatile'.",
      "ja": "6.マネージャはローカル不揮発性ストレージにスクリプトを保存したい場合、それは `不揮発性」にsmScriptStorageTypeオブジェクトを変更し、セットのリクエストを送信する必要があります。"
    },
    {
      "indent": 0,
      "text": "7.3. Modifying an existing script",
      "section_title": true,
      "ja": "7.3. 既存のスクリプトを変更します"
    },
    {
      "indent": 3,
      "text": "This section explains how a manager can modify a script by sending SNMP set-requests.",
      "ja": "このセクションでは、マネージャは、SNMPセット - リクエストを送信することにより、スクリプトを変更する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. First, the script is de-activated by setting the smScriptAdminStatus to `disabled'.",
      "ja": "1.まず、スクリプトが `無効にsmScriptAdminStatusを設定することで、非活性化されます。"
    },
    {
      "indent": 3,
      "text": "2. The manager polls the smScriptOperStatus object until the value is `disabled'.",
      "ja": "2.マネージャーをポーリングsmScriptOperStatusオブジェクト値が「`無効になるまで。"
    },
    {
      "indent": 3,
      "text": "3. The manager sets smScriptSource to an empty string and smScriptAdminStatus to `editing'. This makes the script source available in the smCodeTable.",
      "ja": "3.管理者は `編集」に空の文字列とsmScriptAdminStatusにsmScriptSourceを設定します。これはsmCodeTableで利用可能なスクリプトのソースを作ります。"
    },
    {
      "indent": 3,
      "text": "4. The manager polls the smScriptOperStatus object until the value is `editing'.",
      "ja": "4.マネージャのポーリングsmScriptOperStatusオブジェクト値が '編集」ですまで。"
    },
    {
      "indent": 3,
      "text": "5. The manager sends SNMP set-requests to modify the script in the smCodeTable.",
      "ja": "5.マネージャはsmCodeTableにスクリプトを変更するSNMPセット - リクエストを送信します。"
    },
    {
      "indent": 3,
      "text": "6. The manager sends a set-request to set the smScriptAdminStatus object to `enabled'. The Script MIB implementation now makes the script accessible to the runtime system. This might include the compilation of the script if the language requires a compilation step.",
      "ja": "6.マネージャは `「enabledにsmScriptAdminStatusオブジェクトを設定するためのセット要求を送信します。スクリプトMIBの実装は現在、ランタイムシステムへのスクリプトがアクセスできるようになります。言語はコンパイルのステップを必要とする場合、これは、スクリプトのコンパイルが含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "7. The manager polls the smScriptOperStatus object until the value is either `enabled' or one of the error status codes. The script can only be used if the value of smScriptOperStatus is `enabled'.",
      "ja": "7.値までマネージャーをポーリングsmScriptOperStatusオブジェクトは、どちらか `有効」またはエラーステータスコードのいずれかです。 smScriptOperStatusの値が `」有効になっている場合、スクリプトにのみ使用することができます。"
    },
    {
      "indent": 0,
      "text": "7.4. Removing an existing script",
      "section_title": true,
      "ja": "7.4. 既存のスクリプトを削除します"
    },
    {
      "indent": 3,
      "text": "This section explains how a manager can remove a script from a distributed manager.",
      "ja": "このセクションでは、マネージャは、分散マネージャからスクリプトを削除する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. First, the manager sets the smScriptAdminStatus to `disabled'. This will ensure that no new scripts can be started while running scripts finish their execution.",
      "ja": "1.まず、管理者が `無効にsmScriptAdminStatusを設定します。これは、実行中のスクリプトがその実行を終了しながら、新しいスクリプトが開始されないことを保証します。"
    },
    {
      "indent": 3,
      "text": "2. The manager polls the smScriptOperStatus object until the value is `disabled'.",
      "ja": "2.マネージャーをポーリングsmScriptOperStatusオブジェクト値が「`無効になるまで。"
    },
    {
      "indent": 3,
      "text": "3. The manager sends an SNMP set-request to change the smScriptRowStatus object to `destroy'. This will remove the row and all associated resources from the Script MIB implementation.",
      "ja": "3.管理者は、「破棄 `にsmScriptRowStatusオブジェクトを変更するには、SNMP設定要求を送信します。これは、スクリプトMIBの実装から行と関連するすべてのリソースを削除します。"
    },
    {
      "indent": 0,
      "text": "7.5. Creating a launch button",
      "section_title": true,
      "ja": "7.5. 起動ボタンを作成します"
    },
    {
      "indent": 3,
      "text": "This section explains how a manager can create a launch button for starting a script.",
      "ja": "このセクションでは、管理者がスクリプトを起動するための起動ボタンを作成する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. The manager, who is identified by an smLaunchOwner value, first chooses a name for the new row in the smLaunchTable. The manager sends an SNMP set-request to set the smLaunchRowStatus object for this smLaunchOwner and smLaunchName to `createAndWait'.",
      "ja": "1. smLaunchOwner値によって識別されるマネージャは、最初smLaunchTableに新しい行の名前を選択します。マネージャは、このsmLaunchOwnerとsmLaunchName `createAndWaitに」にするためにsmLaunchRowStatusオブジェクトを設定するためのSNMP設定要求を送信します。"
    },
    {
      "indent": 3,
      "text": "2. The manager fills the new smLaunchTable row with all required parameters. The smLaunchScriptOwner and smLaunchScriptName values point to the script that should be started from this launch button.",
      "ja": "2.管理者は、すべての必要なパラメータを使用して新しいsmLaunchTable行を埋めます。 smLaunchScriptOwnerとsmLaunchScriptName値は、この起動ボタンから開始されなければならないスクリプトを指します。"
    },
    {
      "indent": 3,
      "text": "3. The manager sends a set-request to change smLaunchAdminStatus to `enabled' once the new smLaunchTable row is complete.",
      "ja": "3.監督は新しいsmLaunchTable行が完了すると、 `」有効にするsmLaunchAdminStatusを変更するには、Set-要求を送信します。"
    },
    {
      "indent": 3,
      "text": "4. The manager polls the smLaunchOperStatus object until the value is `enabled'.",
      "ja": "4.マネージャのポーリングは値までsmLaunchOperStatusオブジェクトは `」有効になっています。"
    },
    {
      "indent": 0,
      "text": "7.6. Launching a script",
      "section_title": true,
      "ja": "7.6. スクリプトの起動"
    },
    {
      "indent": 3,
      "text": "This section explains the suggested way to launch a script from a given launch button.",
      "ja": "このセクションでは、与えられた起動ボタンからスクリプトを起動することが示唆方法を説明します。"
    },
    {
      "indent": 3,
      "text": "1. The manager first retrieves the value of smLaunchRunIndexNext from the launch button selected to start the script.",
      "ja": "1.マネージャは、最初のスクリプトを開始するために選択された発射ボタンからsmLaunchRunIndexNextの値を取得します。"
    },
    {
      "indent": 3,
      "text": "2. The manager sends an SNMP set-request to set the smLaunchStart object to the value obtained in step 1. This will launch the script if all necessary pre-conditions are satisfied (see the definition of smLaunchStart for more details). The manager can also provide the smLaunchArgument in the same set-request that is used to start the script. Upon successful start, a new row will be created in the smRunTable indexed by smLaunchOwner, smLaunchName and the value written to smLaunchStart.",
      "ja": "2.マネージャは、（詳細はsmLaunchStartの定義を参照）、すべての必要な事前条件が満足される場合、これは、スクリプトを起動するステップ1で得られた値にsmLaunchStartオブジェクトを設定するためのSNMP設定要求を送信します。管理者は、スクリプトを起動するために使用される同じセット要求にsmLaunchArgumentを提供することができます。正常に起動すると、新しい行がsmLaunchOwner、smLaunchNameとsmLaunchStartに書き込まれた値でインデックスさsmRunTableに作成されます。"
    },
    {
      "indent": 3,
      "text": "Note, the first step is not required. A manager can also try to guess an unused value for smRunIndex if he wants to start script in a single transaction. A manager can also use the special value 0 if he does not care about the results produced by the script.",
      "ja": "注意、最初のステップは必要ありません。管理者はまた、彼は、単一のトランザクションでスクリプトを起動したい場合smRunIndexのため、未使用の値を推測しようとすることができます。彼はスクリプトによって生成された結果を気にしない場合、管理者は、特別な値0を使用することができます。"
    },
    {
      "indent": 0,
      "text": "7.7. Terminating a script",
      "section_title": true,
      "ja": "7.7. スクリプトの終了"
    },
    {
      "indent": 3,
      "text": "This section explains two ways to terminate a running script. The first approach is as follows:",
      "ja": "このセクションでは、実行中のスクリプトを終了する2つの方法を説明します。次のように最初のアプローチは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "1. The manager sets the smRunControl object of the running script or the smLaunchControl object of the launch button used to start the running script to `abort'. Setting smLaunchControl will abort all running scripts started from the launch button while smRunControl will only abort the running script associated with the smRunControl instance.",
      "ja": "1.管理者は、実行中のスクリプトや `アボート」に実行するスクリプトを起動するために使用する起動ボタンのsmLaunchControlオブジェクトのsmRunControlオブジェクトを設定します。 smRunControlのみsmRunControlインスタンスに関連付けられた実行中のスクリプトを中断する一方smLaunchControlは、すべての実行中のスクリプトを中断します設定すると、起動ボタンから開始しました。"
    },
    {
      "indent": 3,
      "text": "The second way to terminate a script is to set the smRunLifeTime to zero which causes the runtime system to terminate the script with a `lifeTimeExceeded' exit code:",
      "ja": "スクリプトを終了させる第二の方法は `lifeTimeExceeded」終了コードでスクリプトを終了するランタイムシステムを引き起こすゼロにsmRunLifeTimeを設定することです。"
    },
    {
      "indent": 3,
      "text": "1. The manager changes the value of smRunLifeTime to 0. This causes the Script MIB implementation to abort the script because the remaining life time has expired.",
      "ja": "1.管理者は、これは、残りの人生の時間が経過したため、スクリプトMIBの実装は、スクリプトを中止する原因となる0にsmRunLifeTimeの値を変更します。"
    },
    {
      "indent": 3,
      "text": "Note, changing the smRunLifeTime value can also be used to increase the permitted lifetime of a running script. For example, a manager can choose to set smRunLifeTime to a small fixed time interval and increase the value periodically. This strategy has the nice effect that scripts terminate automatically if the manager loses contact with the Script MIB engine.",
      "ja": "smRunLifeTime値を変更しても、実行中のスクリプトの許可寿命を増加させるために使用することができ、留意されたいです。たとえば、管理者は、小さな一定の時間間隔にsmRunLifeTimeを設定し、定期的に値を増加させるために選択することができます。この戦略は、管理者がスクリプトMIBエンジンとの接触を失った場合、スクリプトは自動的に終了素敵な効果があります。"
    },
    {
      "indent": 0,
      "text": "7.8. Removing a launch button",
      "section_title": true,
      "ja": "7.8. 起動ボタンを削除します"
    },
    {
      "indent": 3,
      "text": "This section explains how a manager can remove a launch button from a distributed manager.",
      "ja": "このセクションでは、マネージャは、分散マネージャから起動ボタンを削除する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. First, the manager sets the smLaunchAdminStatus to `disabled'. This will ensure that no new scripts can be started from this launch button while running script will finish their execution.",
      "ja": "1.まず、管理者が `無効にsmLaunchAdminStatusを設定します。これは、その実行を終了するスクリプトを実行している間は、新たなスクリプトが、この起動ボタンから起動できないことを保証します。"
    },
    {
      "indent": 3,
      "text": "2. The manager polls the smLaunchOperStatus object until the value is `disabled'.",
      "ja": "2.マネージャーをポーリングsmLaunchOperStatusオブジェクト値が「`無効になるまで。"
    },
    {
      "indent": 3,
      "text": "3. The manager sends an SNMP set-request to change the smLaunchRowStatus object to `destroy'. This will remove the row and all associated resources from the Script MIB implementation.",
      "ja": "3.管理者は、「破棄 `にsmLaunchRowStatusオブジェクトを変更するには、SNMP設定要求を送信します。これは、スクリプトMIBの実装から行と関連するすべてのリソースを削除します。"
    },
    {
      "indent": 0,
      "text": "8. VACM Configuration Examples",
      "section_title": true,
      "ja": "8. VACMの設定例"
    },
    {
      "indent": 3,
      "text": "This section shows how the view-based access control model defined in RFC 2275 [15] can be configured to control access to the script MIB.",
      "ja": "このセクションでは、RFC 2275 [15]で定義されたビューベースアクセス制御モデルは、スクリプトMIBへのアクセスを制御するように構成することができる方法を示しています。"
    },
    {
      "indent": 0,
      "text": "8.1. Sandbox for guests",
      "section_title": true,
      "ja": "8.1. ゲストのためのサンドボックス"
    },
    {
      "indent": 3,
      "text": "The first example demonstrates how to configure VACM to give the members of the VACM group \"guest\" limited access to the script MIB. The MIB views defined below give the members of the \"guest\" group a sandbox where they can install and start their own scripts, but not access any other scripts maintained by the Script MIB implementation.",
      "ja": "最初の例では、VACMグループのメンバーに「ゲスト」スクリプトMIBへの制限されたアクセスを提供するためにVACMを構成する方法を示しています。以下に定義するMIBビューは、「ゲスト」グループのメンバーに彼らがインストールして、独自のスクリプトを起動しますが、スクリプトMIBの実装によって維持され、他のスクリプトにアクセスすることはできませんサンドボックスを与えます。"
    },
    {
      "indent": 6,
      "text": "vacmAccessReadView.\"guest\".\"\".usm.authNoPriv = \"guestReadView\" vacmAccessWriteView.\"guest\".\"\".usm.authNoPriv = \"guestWriteView\"",
      "ja": "vacmAccessReadView。 \"ゲスト\"。 \"\"。usm.authNoPriv = \"guestReadView\" vacmAccessWriteView。 \"ゲスト\"。 \"\"。usm.authNoPriv = \"guestWriteView\""
    },
    {
      "indent": 3,
      "text": "The guestReadView grants read access to the smLangTable, the smExtsnTable and to all the table entries owned by \"guest\":",
      "ja": "guestReadView補助金はsmLangTable、smExtsnTableと「ゲスト」が所有するすべてのテーブルエントリへのアクセスをお読みください。"
    },
    {
      "indent": 6,
      "text": "guestReadView: smLangTable (included) smExtsnTable (included) smScriptObjects.*.*.*.\"guest\" (included) smRunObjects.*.*.*.\"guest\" (included)",
      "ja": "guestReadView：smLangTable（付属）smExtsnTable（付属）smScriptObjects * * * \"ゲスト\"（付属）smRunObjects * * * \"ゲスト\"（付属）。。。。。。。。"
    },
    {
      "indent": 3,
      "text": "The guestWriteView grants write access to all the table entries owned by \"guest\":",
      "ja": "guestWriteView補助金は、「ゲスト」が所有するすべてのテーブルエントリへのアクセスを記述します。"
    },
    {
      "indent": 6,
      "text": "guestWriteView: smScriptObjects.*.*.*.\"guest\" (included) smRunObjects.*.*.*.\"guest\" (included)",
      "ja": "guestWriteView：。。。。。。。。smScriptObjects * * * \"ゲスト\"（付属）smRunObjects * * * \"ゲスト\"（付属）"
    },
    {
      "indent": 0,
      "text": "8.2. Sharing scripts",
      "section_title": true,
      "ja": "8.2. スクリプトを共有"
    },
    {
      "indent": 3,
      "text": "This example demonstrates how VACM can be used to share a repository of scripts between the members of the \"senior\" and the members of the \"junior\" VACM group:",
      "ja": "この例では、VACMは「先輩」のメンバーと「ジュニア」VACMグループのメンバー間のスクリプトのリポジトリを共有するために使用することができます方法を示しています。"
    },
    {
      "indent": 6,
      "text": "vacmAccessReadView.\"junior\".\"\".usm.authNoPriv = \"juniorReadView\" vacmAccessWriteView.\"junior\".\"\".usm.authNoPriv = \"juniorWriteView\"",
      "ja": "vacmAccessReadView。 \"ジュニア\"。 \"\"。usm.authNoPriv = \"juniorReadView\" vacmAccessWriteView。 \"ジュニア\"。 \"\"。usm.authNoPriv = \"juniorWriteView\""
    },
    {
      "indent": 6,
      "text": "juniorReadView: smLangTable (included) smExtsnTable (included) smScriptObjects.*.*.*.\"junior\" (included) smRunObjects.*.*.*.\"junior\" (included) smScriptObjects.*.*.*.\"utils\" (included)",
      "ja": "juniorReadView：smLangTable（付属）smExtsnTable（付属）smScriptObjects * * * \"ジュニア\"（付属）smRunObjects * * * \"ジュニア\"（付属）smScriptObjects * * * \"utilsの\"（。。。。。。。。。。。。含まれています）"
    },
    {
      "indent": 6,
      "text": "juniorWriteView: smScriptObjects.*.*.*.\"junior\" (included) smRunObjects.*.*.*.\"junior\" (included)",
      "ja": "juniorWriteView：smScriptObjects * * * \"ジュニア\"（付属）smRunObjects * * * \"ジュニア\"（付属）。。。。。。。。"
    },
    {
      "indent": 3,
      "text": "The definitions above allow the members of the \"junior\" VACM group to start the scripts owned by \"utils\" in addition to the script the members of the \"junior\" VACM group installed themself. This is accomplished by giving the members of \"junior\" read access to scripts in \"utils\". This allows members of \"junior\" to create entries in the smLauchTable which refer to scripts in \"utils\", and to launch those scripts using these entries in the smLaunchTable.",
      "ja": "上記の定義は、「ジュニア」VACMグループのメンバーは、「ジュニア」VACMグループのメンバーは、その人自身をインストールスクリプトに加えて、「utilsの」が所有しているスクリプトを起動することができます。これは、「ジュニア」のメンバーは、「utilsの」中のスクリプトへの読み取りアクセス権を与えることによって達成されます。これは、「ジュニア」のメンバーは、「utilsの」中のスクリプトを参照してくださいsmLauchTableにエントリを作成するために、そしてsmLaunchTableでこれらのエントリを使用してそれらのスクリプトを起動することができます。"
    },
    {
      "indent": 6,
      "text": "vacmAccessReadView.\"senior\".\"\".usm.authNoPriv = \"seniorReadView\" vacmAccessWriteView.\"senior\".\"\".usm.authNoPriv = \"seniorWriteView\"",
      "ja": "vacmAccessReadView。 \"先輩\"。 \"\"。usm.authNoPriv = \"seniorReadView\" vacmAccessWriteView。 \"先輩\"。 \"\"。usm.authNoPriv = \"seniorWriteView\""
    },
    {
      "indent": 6,
      "text": "seniorReadView: smLangTable (included) smExtsnTable (included) smScriptObjects.*.*.*.\"senior\" (included) smRunObjects.*.*.*.\"senior\" (included) smScriptObjects.*.*.*.\"utils\" (included)",
      "ja": "seniorReadView：smLangTable（付属）smExtsnTable（付属）smScriptObjects * * * \"シニア\"（付属）smRunObjects * * * \"シニア\"（付属）smScriptObjects * * * \"utilsの\"（。。。。。。。。。。。。含まれています）"
    },
    {
      "indent": 6,
      "text": "seniorWriteView: smScriptObjects.*.*.*.\"senior\" (included) smRunObjects.*.*.*.\"senior\" (included) smScriptObjects.*.*.*.\"utils\" (included)",
      "ja": "seniorWriteView：。。。。。。。。。。。。smScriptObjects * * * \"シニア\"（付属）smRunObjects * * * \"シニア\"（付属）smScriptObjects * * * \"utilsの\"（付属）"
    },
    {
      "indent": 3,
      "text": "The definitions for the members of the \"senior\" VACM group allow to start the scripts owned by \"utils\" in addition to the script the members of the \"senior\" VACM group installed themself. The third write access rule in the seniorWriteView also grants the permission to install scripts owned by \"utils\". The members of the \"senior\" VACM group therefore have the permissions to install and modify scripts that can be called by the members of the \"junior\" VACM group.",
      "ja": "「シニア」VACMグループのメンバーの定義は、「シニア」VACMグループのメンバーは、その人自身をインストールスクリプトに加えて、「utilsの」が所有しているスクリプトを起動することができます。 seniorWriteViewで3回目のライトアクセスルールも「utilsの」が所有しているスクリプトをインストールするための権限を付与します。 「シニア」VACMグループのメンバーは、したがって、「ジュニア」VACMグループのメンバーによって呼び出すことができるスクリプトをインストールし、変更する権限を持っています。"
    },
    {
      "indent": 0,
      "text": "8.3. Emergency scripts",
      "section_title": true,
      "ja": "8.3. 緊急時のスクリプト"
    },
    {
      "indent": 3,
      "text": "This example demonstrates how VACM can be used to allow the members of the \"junior\" VACM group to launch scripts that are executed with the permissions associated with the \"emergency\" owner. This works by adding the following rules to the juniorReadView and the juniorWriteView:",
      "ja": "この例では、VACMは、「ジュニア」VACMグループのメンバーが「緊急」の所有者に関連付けられた権限で実行されるスクリプトを起動できるようにするために使用する方法を示しています。これはjuniorReadViewとjuniorWriteViewに次のルールを追加することで動作します。"
    },
    {
      "indent": 6,
      "text": "juniorReadView: smScriptObjects.*.*.*.\"emergency\" (included) smRunObjects.*.*.*.\"emergency\" (included)",
      "ja": "juniorReadView：。。。。。。。。smScriptObjects * * * \"緊急\"（付属）smRunObjects * * * \"緊急\"（付属）"
    },
    {
      "indent": 6,
      "text": "juniorWriteView smLaunchStart.\"emergency\" (included) smLaunchArgument.\"emergency\" (included)",
      "ja": "juniorWriteView smLaunchStart。 \"緊急\"（付属）smLaunchArgument。 \"緊急\"（付属）"
    },
    {
      "indent": 3,
      "text": "The rules added to the juniorReadView grant read access to the scripts, the launch buttons and the results owned by \"emergency\". The rules added to the juniorWriteView grant write permissions to the smLaunchStart and smLaunchArgument variables ownded by \"emergency\". Members of the \"junior\" VACM group can therefore start scripts that will execute under the owner \"emergency\".",
      "ja": "juniorReadView助成金に追加したルールは、起動ボタンと「緊急」が所有して結果をスクリプトへのアクセスをお読みください。ルールは、「緊急」でownded smLaunchStartとsmLaunchArgument変数にjuniorWriteView付与書き込み権限を追加しました。 「ジュニア」VACMグループのメンバーは、したがって、所有者「緊急」の下で実行されるスクリプトを起動することができます。"
    },
    {
      "indent": 6,
      "text": "seniorReadView: smScriptObjects.*.*.*.\"emergency\" (included) smRunObjects.*.*.*.\"emergency\" (included)",
      "ja": "seniorReadView：smScriptObjects * * * \"緊急\"（付属）smRunObjects * * * \"緊急\"（付属）。。。。。。。。"
    },
    {
      "indent": 6,
      "text": "seniorWriteView: smScriptObjects.*.*.*.\"emergency\" (included) smRunObjects.*.*.*.\"emergency\" (included)",
      "ja": "seniorWriteView：smScriptObjects * * * \"緊急\"（付属）smRunObjects * * * \"緊急\"（付属）。。。。。。。。"
    },
    {
      "indent": 3,
      "text": "The rules added to the seniorReadView and the seniorWriteView will give the members of the \"senior\" VACM group the rights to install emergency scripts and to configure appropriate launch buttons.",
      "ja": "seniorReadViewとseniorWriteViewに追加したルールは、「シニア」VACMグループのメンバー緊急スクリプトをインストールするには、適切な起動ボタンを設定する権利を与えます。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The Internet Assigned Numbers Authority (IANA) is responsible for maintaining a MIB module which provides OID registrations for well-known languages. The IANA language registry is intented to reduce interoperability problems by providing a single list of well-known languages. However, it is of course still possible to register languages in private OID spaces. Registering languages in private spaces is especially attractive if a language is used for experimentation or if a language is only used in environments where the distribution of MIB modules with the language registration does not cause any maintenance problems.",
      "ja": "IANA（Internet Assigned Numbers Authority）は、よく知られた言語のためのOIDの登録を提供するMIBモジュールを維持する責任があります。 IANA言語レジストリは、よく知られている言語の単一のリストを提供することにより、相互運用性の問題を軽減するためにintentedされます。しかし、民間のOID空間に言語を登録するにはまだもちろん可能です。言語は、実験のために使用されている場合や言語のみの環境で使用されている場合、言語の登録とMIBモジュールの分布は、任意のメンテナンスの問題が発生しない場合にプライベートスペースでの言語を登録することは特に魅力的です。"
    },
    {
      "indent": 3,
      "text": "Any additions or changes to the list of languages registered via IANA require Designated Expert Review as defined in the IANA guidelines [20]. The Designated Expert will be selected by the IESG Area Director for the IETF Operations and Management Area.",
      "ja": "IANAガイドライン[20]で定義されるようにIANAによって登録言語のリストに任意の追加や変更は、専門家レビューを指定必要。指定専門家は、IETF操作と管理領域のためのIESGエリアディレクターによって選択されます。"
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "ja": "10.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This MIB provides the ability to distribute applications written in an arbitrary language to remote systems in a network. The security features of the languages available in a particular implementation should be taken into consideration when deploying an implementation of this MIB.",
      "ja": "このMIBは、ネットワーク内のリモートシステムに、任意の言語で書かれたアプリケーションを配布する能力を提供します。このMIBの実装を展開するときに特定の実装で使用可能な言語のセキュリティ機能を考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "To facilitate the provisioning of access control by a security administrator using the View-Based Access Control Model (VACM) defined in RFC 2275 [15] for tables in which multiple users may need to independently create or modify entries, the initial index is used as an \"owner index\". Such an initial index has a syntax of SnmpAdminString, and can thus be trivially mapped to a securityName or groupName as defined in VACM, in accordance with a security policy.",
      "ja": "RFC 2275で定義されたビューベースアクセス制御モデル（VACM）を使用して、セキュリティ管理者がアクセス制御のプロビジョニングを容易にするために、[15]複数のユーザが独立にエントリを作成または変更する必要がある可能性のあるテーブルに対して、初期のインデックスは次のように使用されています「所有者インデックス」。そのような初期のインデックスはれるSnmpAdminStringの構文を有し、セキュリティポリシーに従って、VACMで定義され、したがって自明のsecurityNameまたはグループ名にマッピングすることができます。"
    },
    {
      "indent": 3,
      "text": "All entries in related tables belonging to a particular user will have the same value for this initial index. For a given user's entries in a particular table, the object identifiers for the information in these entries will have the same subidentifiers (except for the \"column\" subidentifier) up to the end of the encoded owner index. To configure VACM to permit access to this portion of the table, one would create vacmViewTreeFamilyTable entries with the value of vacmViewTreeFamilySubtree including the owner index portion, and vacmViewTreeFamilyMask \"wildcarding\" the column subidentifier. More elaborate configurations are possible.",
      "ja": "特定のユーザーに属する関連するテーブルのすべてのエントリは、この初期のインデックスのための同じ値を持つことになります。特定のテーブル内の指定されたユーザのエントリを、これらのエントリの情報のためのオブジェクト識別子は、符号化された所有者インデックスの終わりまで（「列」サブ識別子を除いて）同じサブ識別子を有することになります。テーブルのこの部分へのアクセスを可能にするためにVACMを構成するには、一つは、所有者インデックス部分を含むvacmViewTreeFamilySubtreeの値、およびvacmViewTreeFamilyMask「ワイルドカード」欄のサブ識別子でvacmViewTreeFamilyTableのエントリを作成します。より複雑な構成が可能です。"
    },
    {
      "indent": 3,
      "text": "The VACM access control mechanism described above provides control over SNMP access to Script MIB objects. There are a number of other access control issues that are outside of the scope of this MIB. For example, access control on URLs, especially those that use the file scheme, must be realized by the underlying operating system. A mapping of the owner index value to a local operating system security user identity should be used by an implementation of this MIB to control access to operating system resources when resolving URLs or executing scripts.",
      "ja": "上記VACMアクセス制御機構は、スクリプトMIBオブジェクトへのSNMPアクセスの制御を提供します。このMIBの範囲の外にある他のアクセス制御の問題がいくつかあります。例えば、URLを、fileスキームを使用することを特に上のアクセス制御は、基礎となるオペレーティング・システムによって実現されなければなりません。ローカル・オペレーティング・システムのセキュリティ・ユーザ・アイデンティティに所有者指標値のマッピングは、URLを解決するか、スクリプトを実行するときに、オペレーティング・システム・リソースへのアクセスを制御するために、このMIBの実装によって使用されるべきです。"
    },
    {
      "indent": 0,
      "text": "11. Intellectual Property",
      "section_title": true,
      "ja": "11.知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、そのような権限下で、ライセンスがたりないかもしれない可能性があるためにどの本書または程度に記載されている技術の実装や使用に関係すると主張される可能性があります任意の知的財産やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能。また、そうした権利を特定するために取り組んできたことを表していないん。スタンダードトラックおよび標準関連文書における権利に関するIETFの手続きの情報は、BCP-11に記載されています。権利の主張のコピーは、出版のために利用可能とライセンスの保証が利用できるようにする、または本仕様の実装者または利用者が、そのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、その注意にこの標準を実践するために必要な場合があり技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 IETF専務に情​​報を扱ってください。"
    },
    {
      "indent": 0,
      "text": "12. Acknowledgments",
      "section_title": true,
      "ja": "12.謝辞"
    },
    {
      "indent": 3,
      "text": "This document was produced by the IETF Distributed Management (DISMAN) working group.",
      "ja": "このドキュメントはIETF分散管理（DISMAN）ワーキンググループによって作成されました。"
    },
    {
      "indent": 0,
      "text": "13. References",
      "section_title": true,
      "ja": "13.参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Harrington, D., Presuhn, R. and B. Wijnen, \"An Architecture for Describing SNMP Management Frameworks\", RFC 2271, January 1998.",
      "ja": "[1]ハリントン、D.、PresuhnとR.とB. Wijnen、、RFC 2271、1998年1月 \"SNMP管理フレームワークを記述するためのアーキテクチャ\"。"
    },
    {
      "indent": 3,
      "text": "[2] Rose, M. and K. McCloghrie, \"Structure and Identification of Management Information for TCP/IP-based Internets\", STD 16, RFC 1155, May 1990.",
      "ja": "[2]ローズ、M.、およびK. McCloghrie、 \"構造とTCP / IPベースのインターネットのための経営情報の識別\"、STD 16、RFC 1155、1990年5月を。"
    },
    {
      "indent": 3,
      "text": "[3] Rose, M. and K. McCloghrie, \"Concise MIB Definitions\", STD 16, RFC 1212, March 1991.",
      "ja": "[3]ローズ、M.、およびK. McCloghrie、 \"簡潔なMIB定義\"、STD 16、RFC 1212、1991年3月。"
    },
    {
      "indent": 3,
      "text": "[4] Rose, M., \"A Convention for Defining Traps for use with the SNMP\", RFC 1215, March 1991.",
      "ja": "[4]ローズ、M.、 \"SNMPとの使用のためのDefining Trapsのための条約\"、RFC 1215、1991年3月。"
    },
    {
      "indent": 3,
      "text": "[5] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[5] McCloghrie、K.、パーキンス、D.、Schoenwaelder、J.、ケース、J.、ローズ、M.およびS. Waldbusser、 \"経営情報バージョン2（SMIv2）の構造\"、STD 58、RFC 2578、 1999年4月。"
    },
    {
      "indent": 3,
      "text": "[6] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[6] McCloghrie、K.、パーキンス、D.、Schoenwaelder、J.、ケース、J.、ローズ、M.およびS. Waldbusser、 \"SMIv2のためのテキストの表記法\"、STD 58、RFC 2579、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[7] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "ja": "[7] McCloghrie、K.、パーキンス、D.、Schoenwaelder、J.、ケース、J.、ローズ、M.およびS. Waldbusser、STD 58、RFC 2580、1999年4月 \"SMIv2のための順応文\"。"
    },
    {
      "indent": 3,
      "text": "[8] Case, J., Fedor, M., Schoffstall, M. and J. Davin, \"Simple Network Management Protocol\", STD 15, RFC 1157, May 1990.",
      "ja": "[8]ケース、J.、ヒョードル、M.、Schoffstall、M.、およびJ.デーヴィン、 \"簡単なネットワーク管理プロトコル\"、STD 15、RFC 1157、1990年5月。"
    },
    {
      "indent": 3,
      "text": "[9] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Introduction to Community-based SNMPv2\", RFC 1901, January 1996.",
      "ja": "[9]ケース、J.、McCloghrie、K.、ローズ、M.およびS. Waldbusser、 \"コミュニティベースのSNMPv2の概要\"、RFC 1901、1996年1月。"
    },
    {
      "indent": 3,
      "text": "[10] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Transport Mappings for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1906, January 1996.",
      "ja": "[10]ケース、J.、McCloghrie、K.、ローズ、M.、およびS. Waldbusser、RFC 1906 \"簡易ネットワーク管理プロトコル（SNMPv2）のバージョン2のための交通マッピング\"、1996年1月。"
    },
    {
      "indent": 3,
      "text": "[11] Case, J., Harrington D., Presuhn R. and B. Wijnen, \"Message Processing and Dispatching for the Simple Network Management Protocol (SNMP)\", RFC 2272, January 1998.",
      "ja": "[11]ケース、J.、ハリントンD.、Presuhn R.とB. Wijnenの、 \"メッセージ処理と簡単なネットワーク管理プロトコル（SNMP）のための派遣\"、RFC 2272、1998年1月。"
    },
    {
      "indent": 3,
      "text": "[12] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", RFC 2274, January 1998.",
      "ja": "[12]ブルーメンソール、U.とB. Wijnenの、 \"ユーザベースセキュリティモデル（USM）簡易ネットワーク管理プロトコル（SNMPv3の）のバージョン3のために\"、RFC 2274、1998年1月。"
    },
    {
      "indent": 3,
      "text": "[13] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Protocol Operations for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1905, January 1996.",
      "ja": "[13]ケース、J.、McCloghrie、K.、ローズ、M.およびS. Waldbusser、 \"簡単なネットワーク管理プロトコルのバージョン2のためのプロトコル操作（SNMPv2の）\"、RFC 1905、1996年1月。"
    },
    {
      "indent": 3,
      "text": "[14] Levi, D., Meyer, P. and B. Stewart, \"SNMPv3 Applications\", RFC 2273, January 1998.",
      "ja": "[14]レビ、D.、マイヤー、P.とB.スチュワート、 \"SNMPv3のアプリケーション\"、RFC 2273、1998年1月。"
    },
    {
      "indent": 3,
      "text": "[15] Wijnen, B., Presuhn, R. and K. McCloghrie, \"View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)\", RFC 2275, January 1998.",
      "ja": "[15] Wijnenの、B.、Presuhn、R.とK. McCloghrie、 \"簡易ネットワーク管理プロトコルのためのビューベースアクセス制御モデル（VACM）（SNMP）\"、RFC 2275、1998年1月。"
    },
    {
      "indent": 3,
      "text": "[16] Hovey, R. and S. Bradner, \"The Organizations Involved in the IETF Standards Process\", BCP 11, RFC 2028, October 1996.",
      "ja": "[16] Hovey、R.およびS.ブラドナー、BCP 11、RFC 2028、1996年10月 \"IETF標準化プロセスに関与する組織\"。"
    },
    {
      "indent": 3,
      "text": "[17] Berners-Lee, T., Fielding, R. and L. Masinter, \" Uniform Resource Identifiers (URI): Generic Syntax\", RFC 2396, August 1998.",
      "ja": "[17]バーナーズ=リー、T.、フィールディング、R.、およびL. Masinter、 \"統一資源識別子（URI）：一般的な構文\"、RFC 2396、1998年8月。"
    },
    {
      "indent": 3,
      "text": "[18] Postel, J. and J. Reynolds, \"File Transfer Protocol\", STD 9, RFC 959, October 1985.",
      "ja": "[18]ポステル、J.、およびJ.レイノルズ、 \"ファイル転送プロトコル\"、STD 9、RFC 959、1985年10月。"
    },
    {
      "indent": 3,
      "text": "[19] Fielding, R., Gettys, J., Mogul, J., Frystyk, H. and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2068, January 1997.",
      "ja": "[19]フィールディング、R.、ゲティス、J.、モーグル、J.、Frystyk、H.、およびT.バーナーズ - リー、 \"ハイパーテキスト転送プロトコル -  HTTP / 1.1\"、RFC 2068、1997年1月。"
    },
    {
      "indent": 3,
      "text": "[20] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "、BCP 26、RFC 2434、1998年10月[20] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"。"
    },
    {
      "indent": 3,
      "text": "[21] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[21]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "14. Editors' Addresses",
      "section_title": true,
      "ja": "14.エディタのアドレス"
    },
    {
      "indent": 3,
      "text": "David B. Levi Nortel Networks 4401 Great America Parkway Santa Clara, CA 95052-8185 U.S.A.",
      "ja": "デビッド・B・レビNortel Networksの4401グレートアメリカパークウェイサンタクララ、カリフォルニア州95052から8185 U.S.A."
    },
    {
      "indent": 3,
      "text": "Phone: +1 423 686 0432 EMail: dlevi@nortelnetworks.com",
      "ja": "電話：+1 423 686 0432 Eメール：dlevi@nortelnetworks.com"
    },
    {
      "indent": 3,
      "text": "Juergen Schoenwaelder TU Braunschweig Bueltenweg 74/75 38106 Braunschweig Germany",
      "ja": "ユルゲンSchoenwaelder TUブラウンシュバイクBültenweg75分の74 38106ブラウンシュヴァイク、ドイツ"
    },
    {
      "indent": 3,
      "text": "Phone: +49 531 391-3683 EMail: schoenw@ibr.cs.tu-bs.de",
      "ja": "電話：+49 531 391-3683 Eメール：schoenw@ibr.cs.tu-bs.de"
    },
    {
      "indent": 0,
      "text": "16. Full Copyright Statement",
      "section_title": true,
      "ja": "16.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1999）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}