{
  "title": {
    "text": "RFC 2606 - Reserved Top Level DNS Names",
    "ja": "RFC 2606 - 予約済みのトップレベルDNS名"
  },
  "number": 2606,
  "created_at": "2020-08-14 21:24:17.056036+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     D. Eastlake\nRequest for Comments: 2606                                  A. Panitz\nBCP: 32                                                     June 1999\nCategory: Best Current Practice",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 22,
      "text": "Reserved Top Level DNS Names",
      "ja": "予約済みのトップレベルDNS名"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントでは、インターネットコミュニティのためのインターネットのベストプラクティスを示し、改善のためのディスカッションと提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（1999）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "To reduce the likelihood of conflict and confusion, a few top level domain names are reserved for use in private testing, as examples in documentation, and the like. In addition, a few second level domain names reserved for use as examples are documented.",
      "ja": "競合や混乱の可能性を減らすために、いくつかのトップレベルドメイン名は、ドキュメントなどの例として、プライベートテストで使用するために予約されています。さらに、例として使用するために予約されているいくつかの第2レベルのドメイン名が文書化されています。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction............................................1\n2. TLDs for Testing, & Documentation Examples..............2\n3. Reserved Example Second Level Domain Names..............2\n4. IANA Considerations.....................................3\n5. Security Considerations.................................3\nReferences.................................................3\nAuthors' Addresses.........................................4\nFull Copyright Statement...................................5",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The global Internet Domain Name System is documented in [RFC 1034, 1035, 1591] and numerous additional Requests for Comment. It defines a tree of names starting with root, \".\", immediately below which are top level domain names such as \".com\" and \".us\". Below top level domain names there are normally additional levels of names.",
      "ja": "グローバルなインターネットドメインネームシステムは、[RFC 1034、1035、1591]と多数の追加のコメント要求に文書化されています。これは、「.com」や「.us」などの最上位のドメイン名である、ルート「.」で始まる名前のツリーを定義します。トップレベルのドメイン名の下には、通常、追加のレベルの名前があります。"
    },
    {
      "indent": 0,
      "text": "2. TLDs for Testing, & Documentation Examples",
      "section_title": true,
      "ja": "2. テスト用のTLD、およびドキュメントの例"
    },
    {
      "indent": 3,
      "text": "There is a need for top level domain (TLD) names that can be used for creating names which, without fear of conflicts with current or future actual TLD names in the global DNS, can be used for private testing of existing DNS related code, examples in documentation, DNS related experimentation, invalid DNS names, or other similar uses.",
      "ja": "グローバルDNSの現在または将来の実際のTLD名との競合を恐れずに、既存のDNS関連コードのプライベートテストに使用できる名前の作成に使用できるトップレベルドメイン（TLD）名が必要です。例ドキュメンテーション、DNS関連の実験、無効なDNS名、またはその他の同様の用途。"
    },
    {
      "indent": 3,
      "text": "For example, without guidance, a site might set up some local additional unused top level domains for testing of its local DNS code and configuration. Later, these TLDs might come into actual use on the global Internet. As a result, local attempts to reference the real data in these zones could be thwarted by the local test versions. Or test or example code might be written that accesses a TLD that is in use with the thought that the test code would only be run in a restricted testbed net or the example never actually run. Later, the test code could escape from the testbed or the example be actually coded and run on the Internet. Depending on the nature of the test or example, it might be best for it to be referencing a TLD permanently reserved for such purposes.",
      "ja": "たとえば、ガイダンスがなければ、サイトはローカルのDNSコードと構成をテストするために、追加の未使用のトップレベルドメインをいくつかセットアップする場合があります。その後、これらのTLDがグローバルインターネットで実際に使用されるようになる可能性があります。その結果、ローカルでこれらのゾーンの実際のデータを参照しようとすると、ローカルのテストバージョンによって妨害される可能性があります。または、テストコードが制限されたテストベッドネットでのみ実行されるか、サンプルが実際には実行されないという考えで、使用中のTLDにアクセスするテストまたはサンプルコードが記述される場合があります。後で、テストコードがテストベッドからエスケープされるか、サンプルが実際にコーディングされてインターネット上で実行されます。テストまたは例の性質によっては、そのような目的のために永続的に予約されたTLDを参照することが最善の場合があります。"
    },
    {
      "indent": 3,
      "text": "To safely satisfy these needs, four domain names are reserved as listed and described below.",
      "ja": "これらのニーズを安全に満たすために、4つのドメイン名が予約されています。"
    },
    {
      "indent": 14,
      "text": ".test\n.example\n.invalid\n.localhost",
      "raw": true
    },
    {
      "indent": 6,
      "text": "\".test\" is recommended for use in testing of current or new DNS related code.",
      "ja": "「.test」は、現在または新しいDNS関連コードのテストで使用することをお勧めします。"
    },
    {
      "indent": 6,
      "text": "\".example\" is recommended for use in documentation or as examples.",
      "ja": "「.example」は、ドキュメントまたは例として使用することをお勧めします。"
    },
    {
      "indent": 6,
      "text": "\".invalid\" is intended for use in online construction of domain names that are sure to be invalid and which it is obvious at a glance are invalid.",
      "ja": "「.invalid」は、確実に無効であり、一目で無効であることが明らかなドメイン名のオンライン構築で使用することを目的としています。"
    },
    {
      "indent": 6,
      "text": "The \".localhost\" TLD has traditionally been statically defined in host DNS implementations as having an A record pointing to the loop back IP address and is reserved for such use. Any other use would conflict with widely deployed code which assumes this use.",
      "ja": "「.localhost」TLDは、ループバックIPアドレスを指すAレコードを持つものとしてホストDNS実装で静的に定義されており、そのような使用のために予約されています。その他の使用は、この使用を前提とする広く展開されているコードと競合します。"
    },
    {
      "indent": 0,
      "text": "3. Reserved Example Second Level Domain Names",
      "section_title": true,
      "ja": "3. 予約済みの第2レベルドメイン名の例"
    },
    {
      "indent": 3,
      "text": "The Internet Assigned Numbers Authority (IANA) also currently has the following second level domain names reserved which can be used as examples.",
      "ja": "Internet Assigned Numbers Authority（IANA）には、現在、例として使用できる次の第2レベルのドメイン名も予約されています。"
    },
    {
      "indent": 8,
      "text": "example.com\nexample.net\nexample.org",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has agreed to the four top level domain name reservations specified in this document and will reserve them for the uses indicated.",
      "ja": "IANAは、このドキュメントで指定されている4つのトップレベルドメイン名予約に同意し、示された用途のためにそれらを予約します。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Confusion and conflict can be caused by the use of a current or future top level domain name in experimentation or testing, as an example in documentation, to indicate invalid names, or as a synonym for the loop back address. Test and experimental software can escape and end up being run against the global operational DNS. Even examples used \"only\" in documentation can end up being coded and released or cause conflicts due to later real use and the possible acquisition of intellectual property rights in such \"example\" names.",
      "ja": "ドキュメントの例として、無効な名前を示すために、またはループバックアドレスの同義語として、実験またはテストで現在または将来のトップレベルドメイン名を使用することにより、混乱と競合が発生する可能性があります。テストおよび実験的なソフトウェアは、脱出して、グローバルな運用DNSに対して実行される可能性があります。ドキュメントで「のみ」使用されている例でさえ、コード化およびリリースされたり、後で実際に使用したり、そのような「例」の名前で知的財産権を取得したりするために競合が発生する可能性があります。"
    },
    {
      "indent": 3,
      "text": "The reservation of several top level domain names for these purposes will minimize such confusion and conflict.",
      "ja": "これらの目的のためにいくつかのトップレベルドメイン名を予約することで、このような混乱と競合を最小限に抑えることができます。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC 1034] Mockapetris, P., \"Domain names - concepts and facilities\", STD 13, RFC 1034, November 1987.",
      "ja": "[RFC 1034] Mockapetris、P。、「ドメイン名-概念と機能」、STD 13、RFC 1034、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC 1035] Mockapetris, P., \"Domain names - implementation and specification\", STD 13, RFC 1035, November 1987.",
      "ja": "[RFC 1035] Mockapetris、P。、「ドメイン名-実装と仕様」、STD 13、RFC 1035、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC 1591] Postel, J., \"Domain Name System Structure and Delegation\", RFC 1591, March 1994.",
      "ja": "[RFC 1591] Postel、J。、「ドメインネームシステムの構造と委任」、RFC 1591、1994年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Donald E. Eastlake 3rd IBM 65 Shindegan Hill Road, RR #1 Carmel, NY 10512",
      "ja": "ドナルドE.イーストレイク3rd IBM 65 Shindegan Hill Road、RR＃1 Carmel、NY 10512"
    },
    {
      "indent": 3,
      "text": "Phone: +1 914-276-1668(h)\n       +1 914-784-7913(w)\nFAX:   +1 914-784-3833(3)\nEMail: dee3@us.ibm.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Aliza R. Panitz 500 Stamford Dr. No. 310 Newark, DE 19711 USA",
      "ja": "アリザR.パニッツ500スタンフォード博士番号。 310 Newark、DE 19711 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 302-738-1554\nEMail: buglady@fuschia.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（1999）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントとその翻訳はコピーして他のユーザーに提供することができ、コメントまたはその他の方法で説明したり、その実装を支援する二次的著作物は、いかなる種類の制限なしに、全体または一部を準備、コピー、公開、および配布することができます。 、ただし、上記の著作権表示とこの段落は、そのようなすべてのコピーと派生物に含まれています。ただし、このドキュメント自体は、著作権に関する通知を削除したり、インターネットソサエティや他のインターネット組織への参照を削除したりするなど、いかなる方法でも変更できません。ただし、インターネット標準を開発する目的で必要な場合は除きます。インターネット標準のプロセスに従うか、または必要に応じて、それを英語以外の言語に翻訳する必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記で付与された制限付きのアクセス許可は永続的であり、インターネットソサエティまたはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は「現状有姿」で提供され、インターネット社会およびインターネット技術タスクフォースは、明示または黙示を問わず、ここに記載されている情報の使用が保証するものに限定されないいかなる保証も含め、一切の保証を否認します。商品性または特定の目的への適合性に関する権利または黙示の保証を侵害すること。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能への資金提供は、現在Internet Societyから提供されています。"
    }
  ]
}
