{
  "title": {
    "text": "RFC 2364 - PPP Over AAL5",
    "ja": "RFC 2364 - AAL5上のPPP"
  },
  "number": 2364,
  "created_at": "2019-10-23 18:07:19.355776+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           G. Gross\nRequest for Comments: 2364                           Lucent Technologies\nCategory: Standards Track                                      M. Kaycee\n                                                                Paradyne\n                                                                  A. Lin\n                                                         Shasta Networks\n                                                                A. Malis\n                                                   Ascend Communications\n                                                             J. Stephens\n                                                          Cayman Systems\n                                                               July 1998",
      "raw": true
    },
    {
      "indent": 29,
      "text": "PPP Over AAL5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Point-to-Point Protocol (PPP) [1] provides a standard method for transporting multi-protocol datagrams over point-to-point links.",
      "ja": "ポイントツーポイントプロトコル（PPP）[1]は、ポイントツーポイントリンク上でマルチプロトコルデータグラムを輸送するための標準的な方法を提供します。"
    },
    {
      "indent": 3,
      "text": "This document describes the use of ATM Adaptation Layer 5 (AAL5) for framing PPP encapsulated packets.",
      "ja": "このドキュメントは、PPPカプセル化されたパケットをフレーミングするためのATMアダプテーションレイヤ5（AAL5）の使用を記載しています。"
    },
    {
      "indent": 0,
      "text": "Applicability",
      "ja": "適用性"
    },
    {
      "indent": 3,
      "text": "This specification is intended for those implementations which desire to use the facilities which are defined for PPP, such as the Link Control Protocol, Network-layer Control Protocols, authentication, and compression. These capabilities require a point-to-point relationship between the peers, and are not designed for the multi-point relationships which are available in ATM and other multi-access environments.",
      "ja": "この仕様は、リンク制御プロトコルとしてPPPのために定義されている設備、ネットワーク層制御プロトコル、認証、および圧縮を使用することを望むそれらの実装のために意図されています。これらの機能は、ピア間のポイントツーポイントの関係を必要とし、ATMや他のマルチアクセス環境で使用可能なマルチポイント関係のために設計されていません。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "ATM AAL5 protocol is designed to provide virtual connections between end stations attached to the same network. These connections offer a packet delivery service that includes error detection, but does not do error correction.",
      "ja": "ATM AAL5プロトコルは同じネットワークに接続されたエンドステーションとの間の仮想接続を提供するように設計されています。これらの接続は、エラー検出を含むパケット配信サービスを提供していますが、誤り訂正を行いません。"
    },
    {
      "indent": 3,
      "text": "Most existing implementations of PPP use ISO 3309 HDLC as a basis for their framing [3].",
      "ja": "PPPのほとんどの既存の実装は、[3]彼らのフレーミングの基礎としてISO 3309 HDLCを使用します。"
    },
    {
      "indent": 3,
      "text": "When an ATM network is configured with point-to-point connections, PPP can use AAL5 as a framing mechanism.",
      "ja": "ATMネットワークは、ポイントツーポイント接続で構成されている場合、PPPフレーミング機構としてAAL5を使用することができます。"
    },
    {
      "indent": 0,
      "text": "2. Conventions",
      "section_title": true,
      "ja": "2.表記"
    },
    {
      "indent": 3,
      "text": "The keywords MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD NOT, RECOMMENDED, MAY, and OPTIONAL, when they appear in this document, are to be interpreted as described in [10].",
      "ja": "彼らは、この文書に表示される[10]で説明したように解釈される際のキーワードは、REQUIREDは、、、、、MAY、推奨、およびオプションのすべきでないないものとものとしてはなりませんしなければなりません。"
    },
    {
      "indent": 0,
      "text": "3. AAL5 Layer Service Interface",
      "section_title": true,
      "ja": "3. AAL5レイヤサービスインタフェース"
    },
    {
      "indent": 3,
      "text": "The PPP layer treats the underlying ATM AAL5 layer service as a bit-synchronous point-to-point link. In this context, the PPP link corresponds to an ATM AAL5 virtual connection. The virtual connection MUST be full-duplex, point to point, and it MAY be either dedicated (i.e. permanent, set up by provisioning) or switched (set up on demand). In addition, the PPP/AAL5 service interface boundary MUST meet the following requirements:",
      "ja": "PPP層は、ビット同期ポイントツーポイントリンクとして下層のATM AAL5レイヤサービスを扱います。この文脈では、PPPリンクはATM AAL5仮想接続に対応しています。仮想接続を指すように、全二重、ポイントしていなければなりません、そして、それは専用（プロビジョニングによって設定され、すなわち、永久的）または（必要に応じて設定）に切り替えいずれであってもよいです。また、PPP / AAL5サービスインタフェース境界は、次の要件を満たす必要があります。"
    },
    {
      "indent": 8,
      "text": "Interface Format - The PPP/AAL5 layer boundary presents an octet\nservice interface to the AAL5 layer.  There is no provision for\nsub-octets to be supplied or accepted.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Transmission Rate - The PPP layer does not impose any restrictions regarding transmission rate or the underlying ATM layer traffic descriptor parameters.",
      "ja": "伝送速度は -  PPP層は、伝送速度や根底にあるATMレイヤトラフィック記述子パラメータに関する制限はありません。"
    },
    {
      "indent": 8,
      "text": "Control Signals - The AAL5 layer MUST provide control signals to the PPP layer which indicate when the virtual connection link has become connected or disconnected. These provide the \"Up\" and",
      "ja": "制御信号 -  AAL5層は、仮想接続リンクが接続または切断になったときを示すPPP層に制御信号を提供しなければなりません。これらは、「アップ」を提供し、"
    },
    {
      "indent": 8,
      "text": "\"Down\" events to the LCP state machine [1] within the PPP layer.",
      "ja": "PPP層内LCP状態​​機械に「ダウン」イベント[1]。"
    },
    {
      "indent": 0,
      "text": "4. Multi-Protocol Encapsulation",
      "section_title": true,
      "ja": "4.マルチプロトコルカプセル化"
    },
    {
      "indent": 3,
      "text": "This specification uses the principles, terminology, and frame structure described in \"Multiprotocol Encapsulation over ATM Adaptation Layer 5\" [4].",
      "ja": "この仕様は、「ATMアダプテーション・レイヤ5の上にマルチプロトコルカプセル化」に記載された原理、用語、及びフレーム構造を使用する[4]。"
    },
    {
      "indent": 3,
      "text": "The purpose of this specification is not to document what is already standardized in [4], but to specify how the mechanisms described in [4] are to be used to map PPP onto an AAL5-based ATM network. Section 1 within [4] defines the two mechanisms for identifying the Protocol Data Unit (PDU) payload field's protocol type: virtual circuit based multiplexing, and Logical Link Control (LLC) encapsulation. In the former technique, the payload's protocol type is implicitly agreed to by the end points for each virtual circuit using provisioning or control plane procedures. When using the LLC encapsulation technique, the payload's protocol type is explicitly identified on a per PDU basis by an in-band LLC header, followed by the payload data.",
      "ja": "本明細書の目的は、既に[4]において標準化されたものを文書化するが、で説明されたメカニズムは、[4] AAL5ベースのATMネットワークにPPPをマッピングするために使用される方法を指定しないことです。仮想回線ベースの多重化、および論理リンク制御（LLC）カプセル化：[4]内のセクション1は、プロトコルデータユニット（PDU）のペイロードフィールドのプロトコルタイプを識別するための2つのメカニズムを定義します。前者の技術では、ペイロードのプロトコルタイプは、暗黙的にプロビジョニングまたは制御プレーンの手順を使用して、各仮想回線のエンドポイントに同意します。 LLCカプセル化技術を使用する場合、ペイロードのプロトコルタイプは、明示的に、インバンドLLCヘッダによってPDUごとに識別されたペイロードデータが続きます。"
    },
    {
      "indent": 3,
      "text": "When transporting a PPP payload over AAL5, an implementation:",
      "ja": "AAL5、実装上のPPPペイロードを輸送する場合："
    },
    {
      "indent": 8,
      "text": "1. MUST support virtual circuit multiplexed PPP payloads as\ndescribed in section 5 below by mutual configuration or\nnegotiation of both end points.  This technique is referred to\nas \"VC-multiplexed PPP\".",
      "raw": true
    },
    {
      "indent": 8,
      "text": "2. MUST support LLC encapsulated PPP payloads on PVCs as described in section 6 below by mutual configuration or negotiation of both end points. This technique is referred to as \"LLC encapsulated PPP\".",
      "ja": "2. LLCをサポートしなければなりません両方のエンドポイントの相互設定またはネゴシエーションによって以下のセクション6で説明したようにPVCでPPPペイロードをカプセル化。この技術は、「LLCは、PPPをカプセル化」と呼ばれています。"
    },
    {
      "indent": 8,
      "text": "3. For SVC set up, an implementation MUST negotiate using the Q.2931 [9] Annex C procedure, encoding the Broadband Lower Layer Interface (B-LLI) information element to signal either VC-multiplexed PPP or LLC encapsulated PPP. The details of this control plane procedure are described in section 7.",
      "ja": "SVCについて3. VC多重化PPPまたはLLCのいずれかを知らせるために広帯域下位レイヤインタフェース（B-LLI）情報要素をコードする、実装はQ.2931 [9]附属書Cの手順を使用してネゴシエートする必要があり、設定PPPカプセル化。この制御プレーンの手順の詳細はセクション7に記載されています。"
    },
    {
      "indent": 3,
      "text": "If an implementation is connecting through a Frame Relay/ATM FRF.8 [7] service inter-working unit to an RFC 1973 [6] end point, then it MUST use LLC encapsulated PPP payloads. Frame Relay/ATM FRF.8 inter-working units are exempted from the requirement to support VC-multiplexed PPP. This exemption allows the FR/ATM IWU to remain compliant with FRF.8 when the PPP over AAL5 end point is inter-operating with an RFC 1973 end point.",
      "ja": "実装は、RFC 1973にフレーム・リレー/ ATM FRF.8を通して[6]のエンドポイントを[7]のサービスインターワーキングユニットを接続している場合、それはLLCを使用しなければならないPPPペイロードをカプセル化。フレームリレー/ ATM FRF.8インターワーキングユニットはVC多重化PPPをサポートするための要件を免除されています。この免除は、PPP AAL5上のエンドポイントは、RFC 1973のエンドポイントとの相互動作しているとき、FR / ATM IWUはFRF.8準拠を維持することができます。"
    },
    {
      "indent": 0,
      "text": "5. Virtual Circuit Multiplexed PPP Over AAL5",
      "section_title": true,
      "ja": "5. AAL5オーバー仮想回線多重化されたPPP"
    },
    {
      "indent": 3,
      "text": "The AAL5 PDU format is shown in figure 1:",
      "ja": "AAL5 PDUフォーマットは図1に示されています。"
    },
    {
      "indent": 18,
      "text": "      AAL5 CPCS-PDU Format\n+-------------------------------+\n|             .                 |\n|             .                 |\n|        CPCS-PDU Payload       |\n|     up to 2^16 - 1 octets)    |\n|             .                 |\n+-------------------------------+\n|      PAD ( 0 - 47 octets)     |\n+-------------------------------+ -------\n|       CPCS-UU (1 octet )      |    ^\n+-------------------------------+    |\n|         CPI (1 octet )        |    |\n+-------------------------------+CPCS-PDU Trailer\n|        Length (2 octets)      |    |\n+-------------------------------|    |\n|         CRC (4 octets)        |    V\n+-------------------------------+ -------\n                 Figure 1",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The Common Part Convergence Sub-layer (CPCS)-PDU Payload field contains user information up to 2^16 - 1 octets.",
      "ja": "1オクテット - 共通パート・コンバージェンス・サブレイヤ（CPCS）-PDUペイロードフィールドは、2 ^ 16までのユーザー情報が含まれています。"
    },
    {
      "indent": 3,
      "text": "The PAD field pads the CPCS-PDU to fit exactly into the ATM cells such that the last 48 octet cell payload created by the SAR sublayer will have the CPCS-PDU Trailer right justified in the cell.",
      "ja": "パッドフィールドパッドCPCS-PDUは、SARサブレイヤによって作成された最後の48オクテットのセルのペイロードは、細胞におけるCPCS-PDUトレーラーが右寄せになりますようにATMセルに正確に収まるようにします。"
    },
    {
      "indent": 3,
      "text": "The CPCS-UU (User-to-User indication) field is used to transparently transfer CPCS user to user information. The field has no function under the multi-protocol ATM encapsulation described in this memo and can be set to any value.",
      "ja": "CPCS-UU（ユーザ対ユーザ指示）フィールドは透過ユーザ情報にCPCSユーザを転送するために使用されます。フィールドは、このメモに記載のマルチプロトコルATMカプセル化の下では機能を持たず、任意の値に設定することができます。"
    },
    {
      "indent": 3,
      "text": "The CPI (Common Part Indicator) field aligns the CPCS-PDU trailer to 64 bits. Possible additional functions are for further study in ITU-T. When only the 64 bit alignment function is used, this field shall be coded as 0x00.",
      "ja": "CPI（共通部インジケータ）フィールドは64ビットにCPCS-PDUトレーラを整列させます。可能性のある追加機能は、ITU-Tでのさらなる研究のためのものです。のみ64ビットアライメント機能を使用する場合、このフィールドは0×00として符号化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Length field indicates the length, in octets, of the Payload field. The maximum value for the Length field is 65535 octets. A Length field coded as 0x00 is used for the abort function.",
      "ja": "Lengthフィールドは、ペイロードフィールドのオクテットで、長さを示します。 Lengthフィールドの最大値は65535オクテットです。 0x00のように符号化された長さフィールドは、アボート機能のために使用されます。"
    },
    {
      "indent": 3,
      "text": "The CRC field protects the entire CPCS-PDU except the CRC field itself.",
      "ja": "CRCフィールドは、CRCフィールド自体を除いて全体CPCS-PDUを保護します。"
    },
    {
      "indent": 3,
      "text": "A VC-multiplexed PPP frame SHALL constitute the CPCS-PDU payload and is defined as:",
      "ja": "VC多重化PPPフレームは、CPCS-PDUのペイロードを構成するものとして定義されます。"
    },
    {
      "indent": 15,
      "text": "+-------------+-------------+---------+\n| Protocol ID | Information | Padding |\n|  8/16 bits  |             |         |\n+-------------+-------------+---------+\n                 Figure 2",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Each of these fields are specifically defined in [1].",
      "ja": "これらのフィールドの各々は、具体的には[1]で定義されています。"
    },
    {
      "indent": 0,
      "text": "6. LLC Encapsulated PPP Over AAL5",
      "section_title": true,
      "ja": "6. LLCカプセル化PPPオーバーAAL5"
    },
    {
      "indent": 3,
      "text": "LLC encapsulated PPP over AAL5 is the alternative technique to VC-multiplexed PPP over AAL5.",
      "ja": "LLCは、AAL5上のPPPをカプセル化されたAAL5オーバーVC-多重PPPへの代替技術です。"
    },
    {
      "indent": 3,
      "text": "The AAL5 CPCS-PDU payload field is encoded as shown in figure 3. The pertinent fields in that diagram are:",
      "ja": "：その図の該当フィールドがあり、図3に示すように、AAL5 CPCS-PDUペイロードフィールドが符号化されます"
    },
    {
      "indent": 8,
      "text": "1. LLC header: 2 bytes encoded to specify a source SAP and\ndestination SAP of routed OSI PDU (values 0xFE 0xFE), followed\nby an Un-numbered Information (UI) frame type (value 0x03).",
      "raw": true
    },
    {
      "indent": 8,
      "text": "2. Network Layer Protocol IDentifier (NLPID) representing PPP, (value 0xCF).",
      "ja": "PPP、（値0xCF）を表す。2.ネットワーク層プロトコル識別子（NLPID）。"
    },
    {
      "indent": 8,
      "text": "3. the PPP protocol identifier field, which can be either 1 or 2 octets long. See reference [1].",
      "ja": "3. 1つのまたは2オクテット長とすることができるPPPプロトコル識別子フィールドは、。 [1]参照を参照。"
    },
    {
      "indent": 8,
      "text": "4. followed by the PPP information field as per Figure 2.",
      "section_title": true,
      "ja": "4は図2の通りPPP情報フィールドが続きます。"
    },
    {
      "indent": 18,
      "text": "+-------------------------+ --------\n|  Destination SAP (0xFE) |     ^\n+-------------------------+     |\n|  Source SAP (0xFE)      | LLC header\n+-------------------------+     |\n|  Frame Type = UI (0x03) |     V\n+-------------------------+ --------\n|  NLPID = PPP (0xCF)     |\n+-------------------------+ --------\n|   Protocol Identifier   |     ^\n|     (8 or 16 bits)      |     |\n+-------------------------+ PPP payload\n|          .              |     |\n|          .              |     |\n|  PPP information field  |     |\n|          .              |     |\n|          .              |     |\n+-------------------------+     |\n|        padding          |     V\n+-------------------------+ --------\n|  PAD ( 0 - 47 octets)   |\n+-------------------------+ --------\n|  CPCS-UU (1 octet )     |     ^\n+-------------------------+     |\n|    CPI (1 octet )       |     |\n+-------------------------+CPCS-PDU Trailer\n|   Length (2 octets)     |     |\n+-------------------------|     |\n|    CRC (4 octets)       |     V\n+-------------------------+ --------",
      "raw": true
    },
    {
      "indent": 29,
      "text": "Figure 3",
      "ja": "図3"
    },
    {
      "indent": 3,
      "text": "The end points MAY be bi-laterally provisioned to send other LLC-encapsulated protocols besides PPP across the same virtual connection. However, they MUST NOT send packets belonging to any protocol that has an active NCP within the PPP session. Implementations SHOULD do packet scheduling that minimizes the performance impact on the quality of service commitments associated with both the LLC-encapsulated PPP and non-PPP protocol flows.",
      "ja": "エンドポイントは、双横方向に同じ仮想接続を介してPPP以外の他のLLCカプセル化プロトコルを送信するようにプロビジョニングされるかもしれません。しかし、彼らはPPPセッション内でアクティブなNCPを持っている任意のプロトコルに属するパケットを送ってはいけません。実装はLLCカプセル化PPPと非PPPプロトコルフローの両方に関連するサービスのコミットメントの品質上のパフォーマンスへの影響を最小限に抑え、パケットスケジューリングを行う必要があります。"
    },
    {
      "indent": 0,
      "text": "7. Out-Of-Band Control Plane Signaling",
      "section_title": true,
      "ja": "7.アウトオブバンド制御プレーンシグナリング"
    },
    {
      "indent": 3,
      "text": "When originating a switched virtual circuit AAL5 connection, the caller MUST request in the SETUP message either VC-multiplexed PPP, LLC-encapsulated PPP, or else both VC-multiplexed and LLC-encapsulated PPP. When a caller is offering both techniques, the two",
      "ja": "交換仮想回線AAL5接続を発信するときに、呼び出し側は、SETUPメッセージVC-多重PPP、LLCカプセル化PPP、または他の両方のVC-多重化およびLLCカプセル化PPPのいずれかに要求しなければなりません。呼び出し側は、両方の技術を提供している場合には、2"
    },
    {
      "indent": 3,
      "text": "B-LLI IEs are encoded within a Broadband Repeat Indicator IE in the order of their preference. The called implementation MUST be able to accept an incoming call that offers LLC-encapsulated PPP in the caller's request. The called implementation MUST reject a call set up request that only offers an encapsulation that it does not support. Implementations originating a call offering both protocol encapsulation techniques MUST be able to negotiate the use of LLC-encapsulated PPP.",
      "ja": "B-LLI IEは、その優先順にインジケータIEを繰り返しブロードバンド内で符号化されます。呼ばれる実装は、呼び出し側の要求にLLCカプセル化PPPを提供しています着信コールを受け入れることができなければなりません。呼ばれる実装は、それがサポートされていないカプセル化を提供しています要求を呼設定を拒絶しなければなりません。両方のプロトコルのカプセル化技術を提供してコールを発信する実装はLLCカプセル化PPPの使用を交渉できなければなりません。"
    },
    {
      "indent": 3,
      "text": "When originating a virtual circuit multiplexed call that is to carry a PPP payload, the ITU Q.2931 [9] B-LLI element user information layer 3 protocol field is encoded to select ISO/IEC TR 9577 [5] in octet 7. The extension octets specify an IPI value of PPP (0xCF). By definition, the first bytes of the AAL5 frame's payload field will always contain a PPP header followed by a packet.",
      "ja": "PPPペイロードを運ぶためにある仮想回線多重コールを発信するとき、ITU Q.2931 [9] B-LLI要素のユーザ情報レイヤ3プロトコルフィールドは、[5]オクテット7.にISO / IEC TR 9577を選択するために符号化されます拡張オクテットはPPP（0xCF）のIPI値を指定します。定義により、AAL5フレームのペイロードフィールドの最初のバイトは常にパケットに続くPPPヘッダを含むであろう。"
    },
    {
      "indent": 3,
      "text": "When originating an LLC encapsulated call that is to carry a PPP payload, the ITU Q.2931 B-LLI element user information layer 2 protocol field is encoded to select LAN Logical Link Control (ISO/IEC8802-2) in octet 6. See RFC 1755 [8] appendix A for an example. By definition, the first bytes of the AAL5 frame's payload field will contain an LLC header, followed by a NLPID and the PPP payload.",
      "ja": "PPPペイロードを運ぶことであるLLCカプセル化されたコールを発信するとき、ITU Q.2931 B-LLI要素のユーザ情報レイヤ2プロトコルフィールドは、オクテット6参照RFCにLAN論理リンク制御（ISO / IEC8802-2）を選択するために符号化されます例えば1755 [8]付録A。定義により、AAL5フレームのペイロードフィールドの最初のバイトはNLPIDとPPPペイロードが続くLLCヘッダを含むであろう。"
    },
    {
      "indent": 0,
      "text": "8. Detection And Recovery From Unsolicited PPP Encapsulation Transitions",
      "section_title": true,
      "ja": "迷惑PPPカプセル化遷移8.検出と回復"
    },
    {
      "indent": 3,
      "text": "When the virtual connection loses state, the PPP encapsulation technique may uni-laterally and unexpectedly change across such transitions. Detection and recovery procedures are defined for the following state transitions:",
      "ja": "仮想接続状態を失うと、PPPカプセル化技術は、横方向にUNIと予期せずにそのような遷移を横切って変化してもよいです。検出とリカバリ手順は、次の状態遷移のために定義されています。"
    },
    {
      "indent": 8,
      "text": "VC-multiplexed PPP changing to LLC encapsulated PPP",
      "ja": "LLCに変更VC多重化PPPは、PPPカプセル化"
    },
    {
      "indent": 8,
      "text": "LLC encapsulated PPP changing to VC-multiplexed PPP",
      "ja": "LLCは、PPPは、VC-多重PPPに変更し、カプセル化"
    },
    {
      "indent": 3,
      "text": "When LLC-encapsulated PPP is being used, the inital 6 octets of the LCP packets contain the sequence: fe-fe-03-cf-c0-21. This sequence constitutes the first 6 octets of the AAL5 frame. In the case of VC-multiplexed PPP, initial LCP packets contain the sequence c0-21. This sequence constitutes the first 2 octets of an AAL5 frame. When a LCP Configure-Request packet is received and recognized, the PPP link enters Link Establishment phase.",
      "ja": "FE-FE-03-CF-c0-21：LLCカプセル化PPPが使用されている場合には、LCPパケットのinital 6つのオクテットのシーケンスが含まれています。この配列は、AAL5フレームの最初の6つのオクテットを構成しています。 VC-多重PPPの場合は、最初のLCPパケットは、シーケンスc0-21が含まれています。この配列は、AAL5フレームの最初の2つのオクテットを構成します。 LCP設定要求パケットを受信して​​認識されると、PPPリンクがリンク確立フェーズに入ります。"
    },
    {
      "indent": 3,
      "text": "Once PPP has entered the Network-layer Protocol phase, and successfully negotiated a particular NCP for a PPP Protocol, if a frame arrives using an alternate but equivalent data encapsulation as defined in [4], then the PPP Link MUST:",
      "ja": "で定義されたフレームが代替同等のデータカプセル化を使用して到着した場合、PPPはその後PPPリンク、[4]、しなければならないネットワーク層プロトコル・フェーズに入り、正常にPPPプロトコルの特定のNCPを交渉した後："
    },
    {
      "indent": 8,
      "text": "For a SVC, immediately clear the call with the cause value 111,\n\"protocol error, unspecified\".",
      "raw": true
    },
    {
      "indent": 8,
      "text": "For a PVC: tear down the active NCPs, SHOULD generate an error message, enter the Termination state, and silently drop all received packets.",
      "ja": "PVCのために：、エラーメッセージを生成する必要が、アクティブのNCPを切断終了状態を入力し、静かにすべての受信パケットをドロップします。"
    },
    {
      "indent": 3,
      "text": "These policies prevent \"black-holes\" that occur when the peer loses state. An implementation which requires PPP link configuration, and other PPP negotiated features (such as authentication), MAY enter Termination state when configuration fails.",
      "ja": "これらのポリシーは、ピアが状態を失ったときに発生する「ブラックホール」を防ぎます。コンフィギュレーションが失敗したときにPPPリンク構成、及び（認証など）他のPPP交渉さの特徴を必要と実装は、終了状態を入力することもできます。"
    },
    {
      "indent": 0,
      "text": "9. LCP Configuration Options",
      "section_title": true,
      "ja": "9. LCP設定オプション"
    },
    {
      "indent": 3,
      "text": "The Magic Number LCP configuration option is RECOMMENDED, and the Protocol Field Compression (PFC) option is NOT RECOMMENDED. An implementation MUST NOT request any of the following options, and MUST reject a request for such an option:",
      "ja": "マジックナンバーLCP設定オプションが推奨され、およびプロトコルフィールド圧縮（PFC）オプションは推奨されません。実装は、次のいずれかのオプションを要求してはならない、とそのようなオプションの要求を拒絶しなければなりません。"
    },
    {
      "indent": 8,
      "text": "Field Check Sequence (FCS) Alternatives,",
      "ja": "フィールドチェックシーケンス（FCS）代替、"
    },
    {
      "indent": 8,
      "text": "Address-and-Control-Field-Compression (ACFC),",
      "ja": "アドレス・コントロール・フィールド圧縮（ACFC）、"
    },
    {
      "indent": 8,
      "text": "Asynchronous-Control-Character-Map (ACCM)",
      "ja": "非同期制御文字-マップ（ACCM）"
    },
    {
      "indent": 3,
      "text": "The Maximum-Receive-Unit (MRU) option MUST NOT be negotiated to a larger size than the maximum CPCS-SDU size specified in the associated direction for the virtual connection's traffic contract.",
      "ja": "最大受信・ユニット（MRU）オプションは、仮想接続のトラフィック契約のために関連した方向に指定された最大CPCS-SDUサイズよりも大きいサイズに交渉してはいけません。"
    },
    {
      "indent": 3,
      "text": "When viewed peer to peer, a PPP link may be bridged over multiple physical layer sections. For each such AAL5 section, the LCP framing options MUST be actively negotiated by the bridging convertors independently of the LCP framing options in use by other physical layer sections.",
      "ja": "ピアツーピアを見たときに、PPPリンクが複数の物理層部分の上に架橋されていてもよいです。このような各AAL5部のために、LCPフレーミングオプションは積極独立他の物理層部分で使用されているLCPフレーミングオプションのブリッジ変換器によって交渉しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Implementation Note: When an ATM AAL5 PVC is in the \"Stopped\" state, it is RECOMMENDED that the implementation wait for Configure-Requests. See the implementation option in reference [1] section 4.2, the \"Stopped State\" sub-section.",
      "ja": "実装上の注意：ATM AAL5 PVCは「停止」状態にある場合には、実装は通信設定要求を待つことが推奨されます。文献[1]のセクション4.2で実装オプション、「停止状態」のサブセクションを参照。"
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "ja": "10.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Generally, ATM networks are virtual circuit based, and security is implicit in the public data networking service provider's administration of Permanent Virtual Circuits (PVCs) between the network boundaries. The probability of a security breach caused by mis-routed ATM cells is considered to be negligible.",
      "ja": "一般的には、ATMネットワークは、仮想回線ベースであり、セキュリティ、ネットワーク境界間の相手先固定接続（PVC）の公開データ・ネットワーキング・サービス・プロバイダーの管理では暗黙的です。ミスルーティングされたATMセルに起因するセキュリティ侵害の可能性は無視できると考えられています。"
    },
    {
      "indent": 3,
      "text": "When a public ATM network supports Switched Virtual Circuits, the protocol model becomes analogous to traditional voice band modem dial up over the Public Telephone Switched Network (PTSN). The same PAP/CHAP authentication protocols that are already widely in use for Internet dial up access are leveraged. As a consequence, PPP over AAL5 security is at parity with those practices already established by the existing Internet infrastructure.",
      "ja": "公衆ATMネットワークは、交換仮想回線をサポートしている場合は、プロトコルモデルは、従来の音声帯域モデムに類似なり公衆電話ネットワーク（PTSN）をスイッチ上でダイヤルアップ。インターネットダイヤルアップアクセスのために広く利用されているすでに同じPAP / CHAP認証プロトコルがレバレッジです。その結果、AAL5のセキュリティ上のPPPは、既存のインターネットインフラストラクチャによって確立されたものプラクティスとパリティです。"
    },
    {
      "indent": 3,
      "text": "Those applications that require stronger security are encouraged to use authentication headers, or encrypted payloads, and/or ATM-layer security services.",
      "ja": "より強力なセキュリティを必要とするアプリケーションは、認証ヘッダ、または暗号化されたペイロード、および/またはATM層のセキュリティサービスを使用することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "When using LLC-encapsulated PPP over a virtual connection, an end point can not assume that the PPP session authentication and related security mechanisms also secure the other LLC encapsulated flows on that same virtual connection.",
      "ja": "仮想接続を介してLLCカプセル化PPPを使用する場合、エンドポイントは、PPPセッション認証と関連するセキュリティメカニズムは、他のLLCを確保することを前提とすることができない同じ仮想接続上でフローをカプセル化。"
    },
    {
      "indent": 0,
      "text": "11. Acknowledgments",
      "section_title": true,
      "ja": "11.謝辞"
    },
    {
      "indent": 3,
      "text": "This design is based on work performed in ADSL Forum's Packet Mode Working Group. It is inspired by \"PPP in Frame Relay\", RFC 1973, by William Simpson. Special thanks to Phil Rakity of Flowpoint, Tim Kwok of Microsoft, and David Allan of Nortel for their constructive review and commentary.",
      "ja": "この設計は、ADSLフォーラムのパケットモードワーキンググループで実行される作業に基づいています。これは、ウィリアム・シンプソンによって、「フレームリレーでPPP」、RFC 1973に触発されています。彼らの建設的なレビューと解説のためFlowpointのフィルRakity、マイクロソフトのティム・クォック、およびNortelのデビッド・アランに感謝します。"
    },
    {
      "indent": 0,
      "text": "12. References",
      "section_title": true,
      "ja": "12.参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Simpson, W., Editor, \"The Point-to-Point Protocol (PPP)\", STD 51, RFC 1661, July 1994.",
      "ja": "[1]シンプソン、W.、エディタ、 \"ポイントツーポイントプロトコル（PPP）\"、STD 51、RFC 1661、1994年7月。"
    },
    {
      "indent": 3,
      "text": "[2] The ATM Forum, \"Frame based User-to-Network Interface (FUNI) Specification v2\", af-saa-0088.000, May 1997.",
      "ja": "[2] ATMフォーラム、 \"フレームベースのユーザネットワークインターフェイス（FUNI）仕様V2\"、AF-SAA-0088.000、1997年5月を。"
    },
    {
      "indent": 3,
      "text": "[3] Simpson, W., Editor, \"PPP in HDLC-like Framing\", STD 51, RFC 1662, July 1994.",
      "ja": "[3]シンプソン、W.、エディタ、 \"PPP HDLC様のフレーミングに\" STD 51、RFC 1662、1994年7月。"
    },
    {
      "indent": 3,
      "text": "[4] Heinanen, J., \"Multiprotocol Interconnect over AAL5\", RFC 1483, July 1993.",
      "ja": "[4] Heinanen、J.、 \"AAL5上マルチインターコネクト\"、RFC 1483、1993年7月。"
    },
    {
      "indent": 3,
      "text": "[5] ISO/IEC DTR 9577.2, \"Information technology - Telecommunications and Information exchange between systems - Protocol Identification in the network layer\", 1995-08-16.",
      "ja": "[5] ISO / IEC DTR 9577.2、「情報技術 - システム間のテレコミュニケーションと情報交換 - ネットワーク層におけるプロトコル識別」、1995年8月16日。"
    },
    {
      "indent": 3,
      "text": "[6] Simpson, W., \"PPP in Frame Relay\", RFC 1973, June 1996.",
      "ja": "[6]シンプソン、W.、 \"フレームリレーでPPP\"、RFC 1973、1996年6月。"
    },
    {
      "indent": 3,
      "text": "[7] The Frame Relay Forum, \"Frame Relay/ATM PVC Service Inter-working Implementation Agreement\", FRF.8, April 1995.",
      "ja": "[7]フレームリレーフォーラム、「フレームリレー/ ATM PVCサービスインターワーキング実装合意書」、FRF.8、1995年4月を。"
    },
    {
      "indent": 3,
      "text": "[8] Perez, M., Liaw, F., Mankin, A., Hoffman, E., Grossman, D., and A. Malis, \"ATM Signaling Support for IP over ATM\", RFC 1755, February 1995.",
      "ja": "[8]ペレス、M.、Liaw、F.、マンキン、A.、ホフマン、E.、グロスマン、D.、およびA. Malis、 \"ATMオーバーIP用のATMシグナリングサポート\"、RFC 1755、1995年2月。"
    },
    {
      "indent": 3,
      "text": "[9] International Telecommunication Union, \"Broadband Integrated Service Digital Network (B-ISDN) Digital Subscriber Signaling System No.2 (DSS2) User Network Interface Layer 3 Specification for Basic Call/Connection Control\", ITU-T Recommendation Q.2931, (International Telecommunication Union: Geneva, 2/95)",
      "ja": "[9]国際電気通信連合、ITU-T勧告Q.2931「基本的なコール/接続制御のための広帯域統合サービスデジタル網（B-ISDN）ディジタル加入者線信号方式2号（DSS2）ユーザネットワークインターフェイスレイヤ3仕様」、 （国際電気通信連合：ジュネーブ、95分の2）"
    },
    {
      "indent": 3,
      "text": "[10] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[10]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "Chair's Address",
      "ja": "議長の住所"
    },
    {
      "indent": 3,
      "text": "The working group can be contacted via the current chair:",
      "ja": "現在のいすを通してワーキンググループに連絡することができます。"
    },
    {
      "indent": 3,
      "text": "Karl Fox Ascend Communications 3518 Riverside Drive, Suite 101 Columbus, Ohio 43221",
      "ja": "カール・フォックスアセンドコミュニケーションズ3518リバーサイドドライブ、スイート101コロンバス、オハイオ州43221"
    },
    {
      "indent": 3,
      "text": "EMail: karl@ascend.com",
      "ja": "メールアドレス：karl@ascend.com"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Questions about this memo can also be directed to:",
      "ja": "このメモに関する質問も対象とすることができます。"
    },
    {
      "indent": 3,
      "text": "George Gross Lucent Technologies, Inc 184 Liberty Corner Road Warren, NJ 07059",
      "ja": "ジョージ・グロスルーセント・テクノロジーズ社184リバティコーナー道路ウォーレン、NJ 07059"
    },
    {
      "indent": 3,
      "text": "Phone: +1.908.580.4589 EMail: gmgross@lucent.com",
      "ja": "電話：+1.908.580.4589電子メール：gmgross@lucent.com"
    },
    {
      "indent": 3,
      "text": "Manu Kaycee Paradyne Corporation 21 Bear Meadow Road Londonderry, NH 03053-2168",
      "ja": "マヌーKayceeパラダイン社21ベア草原の道ロンドンデリー、NH 03053から2168"
    },
    {
      "indent": 3,
      "text": "Phone: +1.603.434.6088 EMail: mjk@nj.paradyne.com",
      "ja": "電話：+1.603.434.6088電子メール：mjk@nj.paradyne.com"
    },
    {
      "indent": 3,
      "text": "Arthur Lin Shasta Networks Inc. 249 Humboldt Court Sunnyvale, CA 94089-1300",
      "ja": "アーサー・林シャスタネットワークス株式会社249フンボルト裁判所サニーベール、CA 94089から1300"
    },
    {
      "indent": 3,
      "text": "Phone: +1.408.747.5051 EMail: alin@shastanets.com",
      "ja": "電話：+1.408.747.5051電子メール：alin@shastanets.com"
    },
    {
      "indent": 3,
      "text": "Andrew Malis Ascend Communications, Inc. 1 Robbins Road Westford, MA 01886",
      "ja": "アンドリューMalisアセンドコミュニケーションズ株式会社1ロビンス・ロードウェストフォード、MA 01886"
    },
    {
      "indent": 3,
      "text": "Phone: +1.978.952.7414 EMail: malis@ascend.com",
      "ja": "電話：+1.978.952.7414電子メール：malis@ascend.com"
    },
    {
      "indent": 3,
      "text": "John Stephens Cayman Systems, Inc. 100 Maple Street Stoneham, MA 02180",
      "ja": "ジョン・スティーブンスケイマンSystems、Inc.の100メープルストリートストーンハム、MA 02180"
    },
    {
      "indent": 3,
      "text": "Phone: +1.617.279.1101 EMail: john@cayman.com",
      "ja": "電話：+1.617.279.1101電子メール：john@cayman.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}