{
  "title": {
    "text": "RFC 2443 - A Distributed MARS Service Using SCSP",
    "ja": "RFC 2443 - SCSPを用いた分散MARSサービス"
  },
  "number": 2443,
  "created_at": "2019-10-24 17:15:56.863398+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         J. Luciani\nRequest for Comments: 2443                                  Bay Networks\nCategory: Experimental                                          A. Gallo\n                                                                     IBM\n                                                           November 1998",
      "raw": true
    },
    {
      "indent": 17,
      "text": "A Distributed MARS Service Using SCSP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a method for distributing a MARS service within a LIS[1]. This method uses the Server Cache Synchronization Protocol (SCSP)[2] to synchronize the MARS Server databases within a LIS. When SCSP is used to synchronize the caches of MARS Servers in a LIS, the LIS defines the boundary of an SCSP Server Group (SG).",
      "ja": "この文書では、LIS [1]内MARSサービスを配信するための方法を説明します。この方法は、[2] LIS内火星Serverデータベースを同期するためにサーバキャッシュ同期プロトコル（SCSP）を使用しています。 SCSPはLISにMARSサーバーのキャッシュを同期するために使用された場合は、LISはSCSP Serverグループ（SG）の境界を定義します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The keywords MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD NOT, RECOMMENDED, MAY, and OPTIONAL, when they appear in this document, are to be interpreted as described in [5].",
      "ja": "キーワードは、REQUIREDは、、、、、MAYを推奨、オプション、彼らは、この文書に表示されたときに、で説明したように解釈されるすべきでないないものとものとしてはなりませんしなければならない[5]。"
    },
    {
      "indent": 3,
      "text": "The MARS is an extended analog of the ATMARP Server introduced in [4]. It provides the necessary connection and addressing services required by layer 3 multicast services over ATM. There are three basic elements to the MARS model. First, the MARS Server which manages and distributes layer 3 group membership information to the LIS. Second, MARS Clients which register with and query a single MARS Server for layer 3 multicast information. Third, MCS Clients which register with a single MARS Server and provide layer 3 multicast forwarding services for a LIS.",
      "ja": "MARSは、[4]に導入ATMARPサーバの拡張されたアナログです。これは、必要な接続およびATM上にレイヤ3マルチキャストサービスに必要なサービスをアドレッシングを提供します。 MARSモデルには3つの基本要素があります。まず、管理し、LISにレイヤ3グループメンバーシップ情報を配信MARSサーバー。第二に、に登録し、レイヤ3マルチキャスト情報のための単一のMARSサーバーを照会MARSクライアント。単一MARSサーバに登録し、LISのためのレイヤ3マルチキャスト転送サービスを提供する第三に、MCSクライアント。"
    },
    {
      "indent": 3,
      "text": "Both MARS Clients and MCS Clients explicitly register with the MARS Server before exchanging layer 3 multicast information. During the registration process MARS Clients are place on the Cluster Control VC (CCVC) and MCS Clients are placed on the Server Control VC (SCVC). Both the CCVC and SCVC are then used to propagate layer 3 multicast updates to the clients which make up a LIS. During the registration process MARS Clients are also assigned a unique Cluster Member ID (CMI) which is used to identify reflected packets in the presence of MCS Clients.",
      "ja": "MARSクライアントおよびMCSクライアントの両方を明示的にレイヤ3マルチキャスト情報を交換する前に、MARSサーバに登録します。登録プロセスの間、MARSのクライアントはクラスタコントロールVC（CCVC）上の場所であり、MCSクライアントは、サーバーコントロールVC（SCVC）上に配置されています。 CCVCとSCVCの両方が、その後LISを構成しているクライアントにレイヤ3回のマルチキャスト更新を伝播するために使用されています。登録プロセス中にMARSクライアントは、MCSクライアントの存在に反映パケットを識別するために使用される一意のクラスタメンバのID（CMI）が割り当てられます。"
    },
    {
      "indent": 3,
      "text": "In the Distributed MARS Model there MAY be multiple MARS Servers in a given LIS, and since any MARS Server within the LIS MUST be able to provide layer 3 multicast information about any multicast group within the LIS, there MUST be a method by which to synchronize multicast information across all MARS Servers within the LIS.",
      "ja": "分散MARSモデル内の指定されたLIS内の複数のMARSサーバが存在してもよく、LIS内の任意のMARSサーバがLIS内の任意のマルチキャストグループに関するレイヤ3マルチキャスト情報を提供することができなければならないので、同期させることにより、方法がなければなりませんLIS内のすべてのMARSサーバの間でマルチキャスト情報。"
    },
    {
      "indent": 3,
      "text": "The Server Cache Synchronization Protocol (SCSP) solves the generalized server synchronization/cache-replication problem for distributed databases, and thus SCSP MAY be applied to the MARS Server database synchronization problem within a LIS. When SCSP is used to synchronize the caches of MARS Servers in a LIS, the LIS defines the boundary of and SCSP Server Group (SG).",
      "ja": "サーバキャッシュ同期プロトコル（SCSP）は、分散データベースのための一般的なサーバーの同期/キャッシュ複製の問題を解決するため、SCSPはLIS内MARSサーバのデータベースの同期の問題に適用することができます。 SCSPはLISにMARSサーバーのキャッシュを同期するために使用された場合は、LISは、のとSCSPサーバーグループ（SG）の境界を定義します。"
    },
    {
      "indent": 3,
      "text": "SCSP is defined in two parts: the protocol independent part and the client/server protocol specific part. The protocol independent part is specified in [2] whereas this document will specify the client/server protocol specific part where the MARS Server is the client/server protocol.",
      "ja": "プロトコルの独立した部分と、クライアント/サーバプロトコルの特定の部分：SCSPは2つの部分で定義されています。この文書は、クライアント/サーバプロトコルMARSサーバは、クライアント/サーバプロトコルである特定の部分を指定するであろう一方、プロトコルに依存しない部分は、[2]で指定されています。"
    },
    {
      "indent": 0,
      "text": "2. Overview",
      "section_title": true,
      "ja": "2.概要"
    },
    {
      "indent": 3,
      "text": "All MARS Servers belonging to a LIS are said to belong to a Server Group (SG). A SG is identified by, not surprisingly, its SGID which is contained in a field in all SCSP packets. All SCSP packets contain a Protocol ID (PID) field as well. This PID field is set to 0x0003 to signify that SCSP is synchronizing MARS Server databases as opposed to synchronizing some other protocol's databases. (see Section B.2.0.1 of [2] for more details). In general, PIDs for SCSP will be assigned by IANA upon request given that a client/server protocol specific specification has been written. In the case of MARS Servers, the client/server protocol specific specification was written at the same time as SCSP, and thus a PID=0x0003 was assigned in [2].",
      "ja": "LISに属するすべてのMARSサーバーは、サーバーグループ（SG）に属していると言われています。 SGは、すべてのSCSPパケットのフィールドに含まれるそのSGID、驚くことではないが、によって識別されます。すべてのSCSPパケットは、同様のプロトコルID（PID）フィールドが含まれています。このPIDフィールドは、いくつかの他のプロトコルのデータベースを同期とは対照的に、SCSPがMARS Serverデータベースを同期していることを意味する0x0003に設定されています。 （詳細については[2]のセクションB.2.0.1を参照のこと）。一般的に、SCSP用のPIDは、クライアント/サーバプロトコル固有の仕様が書き込まれたことを考えると、要求に応じてIANAによって割り当てられます。 MARSサーバの場合には、クライアント/サーバ・プロトコル固有の仕様は、SCSPと同時に書かれたので、PID = 0x0003 [2]に割り当てました。"
    },
    {
      "indent": 3,
      "text": "SCSP places no topological requirements upon a MARS Server SG. Obviously, however, the resultant graph of MARS Servers must span the set of MARS Servers being synchronized. For more information about the client/server protocol independent part of SCSP, the reader is encouraged to see [2].",
      "ja": "SCSPはMARSサーバSGには何トポロジカルな要件を課すません。明らかに、しかし、MARSサーバーの結果のグラフは、同期されMARSサーバーのセットにまたがる必要があります。 SCSPのクライアント/サーバ・プロトコル独立部の詳細については、読者は[2]を参照することが推奨されます。"
    },
    {
      "indent": 3,
      "text": "When a SG is using SCSP for synchronization, a MARS Client or MCS Client will register with only one MARS Server although it is allowed to choose any MARS Server in the SG for this registration. At registration time the MARS Client or MCS Client will be added to that MARS Servers respective CCVC or SCVC. Also, MARS Clients will be issued a unique CMI for the entire LIS. This document assumes at a minimum each MARS Server in the SG will be configured with a unique range of CMIs to assign to clients registering with that MARS Server. Use of some external means for allocating CMIs to MARS Servers in a SG is possible but beyond the scope of this document.",
      "ja": "SGは、同期のためにSCSPを使用している場合は、この登録のためのSG内の任意のMARSサーバーを選択することが許可されているものの、MARSクライアントまたはMCSクライアントは、唯一のMARSサーバーに登録します。登録時にはMARS ClientまたはMCSクライアントは、MARSサーバのそれぞれのCCVCまたはSCVCに追加されます。また、MARSクライアントが全体のLISのためのユニークなCMIが発行されます。この文書では、SGの各MARS ServerはそのMARSサーバーに登録し、クライアントに割り当てるためのCMIのユニークな範囲で構成され、最低でも前提としています。 SGにMARSサーバーへのCMIを割り当てるためのいくつかの外部手段を使用することは可能ですが、この文書の範囲を超えています。"
    },
    {
      "indent": 3,
      "text": "When a MARS Client or MCS Client successfully registers with a MARS Server in the SG that MARS Server will propagate the registration information to its peer MARS Servers. The same propagation will occur for any subsequent group membership information learned from the clients. The peer MARS Server will then update its group membership database and propagate the information out its own CCVC or SCVC if needed.",
      "ja": "MARS ClientまたはMCSクライアントが正常にMARSサーバーがピアMARSサーバーに登録情報を伝搬しますSGでMARSサーバーに登録する場合。同じ伝播は、クライアントから学んだ、後続のグループメンバーシップ情報のために発生します。ピアMARS Serverは、そのグループ・メンバーシップデータベースを更新し、必要に応じて、独自のCCVCまたはSCVCから情報を伝播します。"
    },
    {
      "indent": 3,
      "text": "In the case of a MARS Server failure all peer MARS Servers in the SG MUST flush the client/group membership information learned from the failed MARS Server. The clients belonging to the failed MARS Servers CCVC and SCVC will migrate to the next available MARS Server as specified in Section 5.3 of [1]. When a client detects a failure of its MARS, it steps to the next backup MARS Server and attempts to register with the server. If the registration is successful the client will re-join all of its previous group membership information. If the registration fails, the process repeats until a functional MARS Server is found.",
      "ja": "MARSサーバーに障害が発生した場合にはすべてが失敗したMARSサーバーから学んクライアント/グループメンバーシップ情報をフラッシュする必要がありますSGにMARSサーバーをピア。 [1]の5.3節で指定された失敗したMARSサーバーCCVCとSCVCに属するクライアントは、次の利用可能なMARSサーバーに移行します。クライアントがMARSの障害を検出すると、それは次のバックアップMARSサーバーに段階的に説明し、サーバに登録しようとします。登録が成功した場合、クライアントは、その前のグループメンバーシップ情報のすべてを再参加します。登録に失敗した場合は、機能MARSサーバーが見つかるまで、プロセスが繰り返されます。"
    },
    {
      "indent": 3,
      "text": "Determining the operational state of a MARS Servers in a SG requires that each MARS Server send out an \"alive\" or \"heartbeat\" message similar to the MARS Redirect message sent out on the CCVC or SCVC for MARS Clients. However, this message will only be sent to MARS Servers in the SG and is from here on defined as the MARS Server Redirect Entry.",
      "ja": "SGにMARSサーバの動作状態を決定することは、各MARS ServerがMARSクライアント用CCVCまたはSCVCで送信MARSリダイレクトメッセージに似た「生きている」または「ハートビート」メッセージを送信する必要があります。しかし、このメッセージはSGでMARSサーバーに送信され、ここからMARSサーバーリダイレクトエントリとして定義になっております。"
    },
    {
      "indent": 3,
      "text": "In order to detect that a MARS Server failure has occurred each server MUST update it's MARS Server Redirect Entry state at least every 2 minutes, it is RECOMMENDED that it is updated every 1 minute. Failure to receive two consecutive MARS Server Redirect Entry updates from a given MARS Server in the SG will cause all membership information learned from this server to be flushed. The MARS Server Redirect Entry state is also used to create the MARS_REDIRECT_MAP messages sent out on CCVC for each MARS Server in the SG. The ordering of each server learned will be based on the MARS Servers SCSP Sender ID. The ordering of the MARS_REDIRECT_MAP will first contain the list of MARS Servers learned via MARS Server Redirect Entry updates in ascending order based on the SCSP Sender ID, followed by any externally configured or learned backup MARS Servers.",
      "ja": "MARSサーバの障害は、各サーバーはそれを更新しなければならないが発生したことを検出するためには、少なくとも2分ごとに、それは1分ごとに更新することをお勧めしMARSサーバーリダイレクトエントリ状態です。 SG内の指定されたMARSサーバーから二つの連続MARSサーバーリダイレクトエントリの更新を受信に失敗すると、このサーバから学んだすべての会員情報がフラッシュされることになります。 MARSサーバーリダイレクトエントリ状態もSG内の各MARS ServerのCCVCで送信MARS_REDIRECT_MAPメッセージを作成するために使用されます。学んだ各サーバの順序は、MARSサーバーSCSP送信者IDに基づいて行われます。 MARS_REDIRECT_MAPの順序は、最初に任意の外部で構成されたかを学んだバックアップMARSサーバーに続くSCSP送信者IDに基づいて昇順にMARSサーバーリダイレクトエントリの更新を介して学習MARSサーバーのリストが含まれます。"
    },
    {
      "indent": 3,
      "text": "In the case of a MARS Client or MCS Client failure where the client is unexpectedly removed from the CCVC or SCVC the MARS Server MUST notify its peer SG members via a proxy deregister for that client. Upon receiving a proxy deregister request from a peer SG member all membership information for the deregistering client MUST be removed. Any Clients sending multicast data to the failed client should also receive an unexpected removal of this client which will intern cause the sending client to revalidate the multicast groups current membership as outlined in Section 5.1.5.1 of [1].",
      "ja": "クライアントが予期せず、プロキシを介してピアSGのメンバーに通知しなければならないMARSサーバーがそのクライアントの登録解除CCVC又はSCVCから除去されるMARSクライアントまたはMCSクライアントに障害が発生した場合に。ピアSG部材から登録抹消クライアントのすべてのメンバーシップ情報をプロキシ登録解除要求を受信すると除去されなければなりません。失敗したクライアントへのマルチキャストデータを送信するクライアントもインターンが[1]のセクション5.1.5.1に概説されているよう送信するクライアントがマルチキャストグループを現在のメンバーシップを再検証するようになります。このクライアントの予想外の除去を受けるべきです。"
    },
    {
      "indent": 0,
      "text": "3. Format of the CSA Record MARS Specific Part",
      "section_title": true,
      "ja": "CSA録音MARS特定の部分の3フォーマット"
    },
    {
      "indent": 3,
      "text": "CSA Records in SCSP contain a \"Client/Server Protocol Specific Part\" which contains the non-protocol independent information for a given server's cache entry.",
      "ja": "SCSPでCSAレコードは、特定のサーバーのキャッシュエントリの非プロトコルに依存しない情報が含まれている「クライアント/サーバプロトコル特定の部分」が含まれています。"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        Hardware Type          |        Protocol Type          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              SNAP                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     SNAP      |   Unused      |    Version    |   State       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Flags              |       Cluster Member ID       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Src Addr Len  | Group Addr Len| ATM Addr T/L  |ATM SubAddr T/L|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source Protocol Address             (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source ATM Address                  (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source ATM SubAddress               (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Minimum Multicast Group Address     (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Maximum Multicast Group Address     (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Hardware Type Defines the type of \"link layer\" addresses being carried. This value is the ATM Forum 'address family number' specified in [3] as 15 decimal (0x000F). This is the mar$afn field defined in [1].",
      "ja": "ハードウェアの種類を搭載している「リンク層」アドレスのタイプを定義します。この値は、15進（0x000F）[3]で指定されたATMフォーラムの「アドレスファミリー番号」です。これは、[1]で定義された傷$ AFNフィールドです。"
    },
    {
      "indent": 3,
      "text": "Protocol Type This field is the protocol type number for the protocol using MARS from [3]. (IPv4 is 0x0800). This is the mar$pro.type field from [1].",
      "ja": "プロトコルタイプこのフィールドは、[3]からMARSを使用してプロトコルのプロトコルタイプ番号です。 （IPv4が0x0800です）。これは、[1]から傷の$ pro.typeフィールドです。"
    },
    {
      "indent": 3,
      "text": "Protocol SNAP This field is the optional protocol SNAP extension to protocol type. This is the mar$pro.snap field from [1].",
      "ja": "議定書は、このフィールドには、プロトコルタイプにオプションのプロトコルSNAPの拡張であるSNAP。これは、[1]から傷の$ pro.snapフィールドです。"
    },
    {
      "indent": 3,
      "text": "Version Number 0 MARS Specific part of the CSA record. 0x01 Reserved for NHRP. 0x02 - 0xEF Reserved for future use by the IETF. 0xF0 - 0xFE Allocated for use by the ATM Forum. 0xFF Experimental/Local use. Version Number for this document MUST be set to 0x00.",
      "ja": "バージョン番号0 MARS CSAレコードの特定の部分。 0x01のはNHRPのために予約されています。 0×02  -  IETFにより、将来の使用のために予約0xEFという。 0xF0  -  0xFEのは、ATMフォーラムで使用するために割り当てられました。 0xFFの実験/ローカル使用。このドキュメントのバージョン番号は0x00に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "State 1 MARS Server Redirect Entry. 2 MCS Serve/Register request. 3 MARS Client Join/Register request. 4 MARS Client Leave/Deregister request. 5 MCS Unserve/Deregister request.",
      "ja": "状態1 MARSサーバーリダイレクトエントリ。 2 MCSは、/登録要求をサーブ。 3 MARSクライアントは要求を登録/参加します。 4 MARSクライアント休暇/登録解除要求。 5 MCS Unserve /登録解除要求。"
    },
    {
      "indent": 5,
      "text": "All other State values should cause the CSA to be discarded.",
      "ja": "他のすべての状態値はCSAを廃棄する原因となる必要があります。"
    },
    {
      "indent": 3,
      "text": "Flags The flags field is used to contain several flags and is similar to the mar$flags field from [1]. mar$flags Bit 15 - mar$flags.layer3grp Bit 13 - mar$flags.register Bit 0-7 - mar$flags.sequence",
      "ja": "フラグフラグフィールドは、いくつかのフラグを格納するために使用して、[1]から傷$フラグフィールドに似ていています。 marの$ flags.layer3grpビット13  -   - マー$ flags.registerビット0-7  - マル$ flags.sequence傷$フラグは、15ビット"
    },
    {
      "indent": 7,
      "text": "All remaining bits are reserved and MUST be zero. The\nmars$flags.sequence field is of local significance only to the\nLocal Server (LS).",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Cluster Member CMI This field contains the CMI which uniquely identifies each endpoint within a LIS. This is the mar$cmi field from [1].",
      "ja": "クラスタメンバーCMIは、このフィールドは、一意LIS内の各エンドポイントを識別するCMIを含んでいます。これは、[1]から傷の$ CMIフィールドです。"
    },
    {
      "indent": 3,
      "text": "Src Addr Len This field contains the length of the Source Protocol Address field. For IPv4, the value is 4 if an address is specified. A null (non-existent) address MUST be coded as zero length, and no space allocated for it in the message body. This is the mar$spln field from [1].",
      "ja": "SRC ADDRレンは、このフィールドは、送信元プロトコルアドレスフィールドの長さが含まれています。アドレスが指定されている場合はIPv4の場合、値は4です。ヌル（存在しない）アドレスはゼロ長さ、及びメッセージボディにそれのために割り当てられないスペースとして符号化されなければなりません。これは、[1]から傷の$ splnフィールドです。"
    },
    {
      "indent": 3,
      "text": "Group Addr Len This field contains the length of the Group Protocol Address field. For IPv4, the value is 4 if an address is specified. A null (non-existent) address MUST be coded as zero length, and no space allocated for it in the message body. This is the mar$tpln field from [1].",
      "ja": "グループADDRレンは、このフィールドは、グループプロトコル・アドレス・フィールドの長さが含まれています。アドレスが指定されている場合はIPv4の場合、値は4です。ヌル（存在しない）アドレスはゼロ長さ、及びメッセージボディにそれのために割り当てられないスペースとして符号化されなければなりません。これは、[1]から傷の$ tplnフィールドです。"
    },
    {
      "indent": 3,
      "text": "ATM Addr T/L This field contains the type and length of the Source ATM Address field. The type and length encoding is described in Section 5.1.2 of [1].",
      "ja": "ATM ADDR T / Lこのフィールドは、送信元ATMアドレスフィールドのタイプと長さが含まれています。タイプと長符号[1]のセクション5.1.2に記載されています。"
    },
    {
      "indent": 3,
      "text": "ATM SubAddr T/L This field contains the type and length of the Source ATM SubAddress field. The type and length encoding is described in Section 5.1.2 of [1].",
      "ja": "ATM SubAddr T / Lこのフィールドは、Source ATMサブアドレスフィールドの型と長さが含まれています。タイプと長符号[1]のセクション5.1.2に記載されています。"
    },
    {
      "indent": 3,
      "text": "Source Protocol Address This is the internetwork address for the source of an address binding in a MARS server cache entry. If null, no storage will be allocated. This is the mar$spa field from [1].",
      "ja": "このソース・プロトコル・アドレスは、MARSサーバーのキャッシュエントリーにバインディングアドレスのソースのインターネットアドレスです。 nullの場合、ストレージが割り当てられません。これは、[1]から傷$スパ場です。"
    },
    {
      "indent": 3,
      "text": "Source ATM Address This is the Source's ATM address of an address binding in a MARS server cache entry. The address, if specified, is E.164 or ATM Forum NSAPA. This is the mar$sha field from [1].",
      "ja": "ソースATMこれはMARSサーバキャッシュエントリーに結合アドレスの送信元のATMアドレスです。アドレスは、指定された場合は、E.164またはATMフォーラムNSAPAです。これは、[1]から傷$舎フィールドです。"
    },
    {
      "indent": 3,
      "text": "Source ATM SubAddress This is the Source's ATM subaddress of an address binding in a MARS server cache entry. The subaddress, if specified, is an ATM Forum NSAPA. If null, no storage will be allocated. This is the mar$ssa field from [1].",
      "ja": "ソースATMサブアドレスは、これがMARSサーバキャッシュエントリーに結合アドレスの送信元のATMサブアドレスです。サブアドレスは、指定された場合、ATMフォーラムNSAPAです。 nullの場合、ストレージが割り当てられません。これは、[1]から傷の$ SSAフィールドです。"
    },
    {
      "indent": 3,
      "text": "Minimum Multicast Group Address This is the internetwork address of the lower bound on the range of multicast group addresses for the address binding in a MARS server cache entry. If null, no storage will be allocated. This is the mar$min.N field from [1].",
      "ja": "最小マルチキャストグループは、これがMARSサーバキャッシュエントリーにバインドアドレスのマルチキャストグループアドレスの範囲の下限のインターネットアドレスです。 nullの場合、ストレージが割り当てられません。これは、[1]から傷$ min.Nフィールドです。"
    },
    {
      "indent": 3,
      "text": "Maximum Multicast Group Address This is the internetwork address of the upper bound on the range of multicast group addresses for the address binding in a MARS server cache entry. If null, no storage will be allocated. This is the mar$max.N field from [1].",
      "ja": "この最大のマルチキャストグループアドレスは、MARSサーバーのキャッシュエントリーにバインドアドレスのマルチキャストグループアドレスの範囲の上限のインターネットアドレスです。 nullの場合、ストレージが割り当てられません。これは、[1]から傷$ max.Nフィールドです。"
    },
    {
      "indent": 0,
      "text": "4. Values for SCSP Protocol Independent Part",
      "section_title": true,
      "ja": "SCSPプロトコル独立パート4.値"
    },
    {
      "indent": 3,
      "text": "The following sections give values for fields of the SCSP Protocol Independent Part of the various SCSP messages.",
      "ja": "次のセクションでは、さまざまなSCSPメッセージのSCSPプロトコル独立パートのフィールドに値を与えます。"
    },
    {
      "indent": 0,
      "text": "4.1 Values for the SCSP \"Mandatory Common Part\"",
      "section_title": true,
      "ja": "SCSP「必須共通パート」の4.1の値"
    },
    {
      "indent": 3,
      "text": "Protocol ID = 0x0003 Sender ID Len = 0x04 Recvr ID Len = 0x04",
      "ja": "プロトコルID = 0x0003のSender IDレン= 0x04のRecvr IDレン= 0x04の"
    },
    {
      "indent": 3,
      "text": "See Section B.2.0.1 of [2] for a detailed description of these fields.",
      "ja": "これらのフィールドの詳細については、[2]のセクションB.2.0.1を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.2 Values for the SCSP \"CSAS Record\"",
      "section_title": true,
      "ja": "SCSP「CSAS記録」のために4.2の値"
    },
    {
      "indent": 3,
      "text": "Cache Key Len = 0x04 Orig ID Len = 0x04",
      "ja": "キャッシュキーレン= 0x04のORIG IDレン= 0x04の"
    },
    {
      "indent": 3,
      "text": "See Section B.2.0.2 of [2] for a detailed description of these fields.",
      "ja": "これらのフィールドの詳細については、[2]のセクションB.2.0.2を参照してください。"
    },
    {
      "indent": 0,
      "text": "5. Detailed State Descriptions",
      "section_title": true,
      "ja": "5.詳細な状態の説明"
    },
    {
      "indent": 0,
      "text": "5.1 MARS Server Redirect Entry.",
      "section_title": true,
      "ja": "5.1 MARSサーバーリダイレクトエントリ。"
    },
    {
      "indent": 3,
      "text": "The MARS Server Redirect Entry is used to determine the operational state of a MARS Server in the SG. Each server MUST update it's MARS Server Redirect Entry state at least every 2 minutes, it is RECOMMENDED that it is updated every 1 minute.",
      "ja": "MARSサーバーリダイレクトエントリがSGでMARSサーバの動作状態を決定するために使用されます。それを更新しなければならない各サーバには、2分ごとに、少なくとも、それは1分ごとに更新することをお勧めしMARSサーバーリダイレクトエントリ状態です。"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        Hardware Type          |        Protocol Type          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              SNAP                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     SNAP      |   Unused      |    Version    |   State       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Flags              |       Cluster Member ID       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Src Addr Len  | Group Addr Len| ATM Addr T/L  |ATM SubAddr T/L|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source ATM Address                  (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source ATM SubAddress               (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Hardware Type This value is the ATM Forum 'address family number' specified in [3] as 15 decimal (0x000F).",
      "ja": "ハードウェアタイプは、この値は、15進（0x000F）[3]で指定されたATMフォーラムの「アドレスファミリー番号」です。"
    },
    {
      "indent": 3,
      "text": "Protocol Type This field is the protocol type number for the protocol using MARS from [3]. (IPv4 is 0x0800).",
      "ja": "プロトコルタイプこのフィールドは、[3]からMARSを使用してプロトコルのプロトコルタイプ番号です。 （IPv4が0x0800です）。"
    },
    {
      "indent": 3,
      "text": "Protocol SNAP This field is the optional protocol SNAP extension to protocol type. This is the mar$pro.snap field from [1].",
      "ja": "議定書は、このフィールドには、プロトコルタイプにオプションのプロトコルSNAPの拡張であるSNAP。これは、[1]から傷の$ pro.snapフィールドです。"
    },
    {
      "indent": 3,
      "text": "Version Number Version Number for this document MUST be set to 0x00.",
      "ja": "この文書のバージョン番号バージョン番号は0x00に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "State State value is coded as 1 decimal for a MARS Server Redirect Entry.",
      "ja": "状態状態の値がMARSサーバーリダイレクトエントリのための1つの小数として符号化されます。"
    },
    {
      "indent": 3,
      "text": "The Flags, Cluster Member ID, Src Addr Len, and Group Addr Len fields are unused and set to zero.",
      "ja": "国旗、クラスタメンバーID、SrcのADDRレン、およびグループADDRレンフィールドは未使用でゼロに設定されています。"
    },
    {
      "indent": 3,
      "text": "The ATM Addr T/L, ATM SubAddr T/L, Source ATM Address, and Source ATM SubAddress fields define the ATM address for the source of the MARS Server Redirect Entry in the SG. The coding for these fields are the same as described in Section 3 of this document.",
      "ja": "ATM ADDR T / L、ATM SubAddr T / L、送信元ATMアドレス、および送信元ATMサブアドレスフィールドはSGでMARSサーバーリダイレクトエントリのソースのためのATMアドレスを定義します。これらのフィールドの符号化は、このドキュメントのセクション3に記載したのと同じです。"
    },
    {
      "indent": 3,
      "text": "Failure to receive two consecutive MARS Server Redirect Entry updates from a given MARS Server in the SG will cause all membership information learned from this server to be flushed. When a valid MARS Server Redirect Entry update is received the source of this update will be placed into the table of backup MARS Servers sent in the MARS_REDIRECT_MAP message. The ordering of servers in the MARS_REDIRECT_MAP will first contain the list of MARS Servers learned via MARS Server Redirect Entry updates in ascending order based on the SCSP Sender ID, followed by any externally configured or learned backup MARS Servers. The format of the MARS_REDIRECT_MAP can be found in Section 5.4.3 of [1].",
      "ja": "SG内の指定されたMARSサーバーから二つの連続MARSサーバーリダイレクトエントリの更新を受信に失敗すると、このサーバから学んだすべての会員情報がフラッシュされることになります。有効MARSサーバーリダイレクトエントリ更新が受信されると、このアップデートのソースはMARS_REDIRECT_MAPメッセージで送信されたバックアップMARSサーバーのテーブルに置かれます。 MARS_REDIRECT_MAP内のサーバの順序は、最初に任意の外部で構成されたかを学んだバックアップMARSサーバーに続くSCSP送信者IDに基づいて昇順にMARSサーバーリダイレクトエントリの更新を介して学習MARSサーバーのリストが含まれます。 MARS_REDIRECT_MAPのフォーマットは、[1]のセクション5.4.3に見出すことができます。"
    },
    {
      "indent": 0,
      "text": "5.2 MCS Serve/Register request.",
      "section_title": true,
      "ja": "5.2 MCSは、/登録要求をサーブ。"
    },
    {
      "indent": 3,
      "text": "The MCS Serve/Register request is used to propagate the registering or servicing of specific groups by an MCS Client within the SG domain. It is similar to an MARS_MSERV request defined in Section 6.2.2 and 6.2.3 of [1]. When a MARS Server in the SG successfully adds a new MCS Client to it's SCVC or adds MCS support for a specific group it MUST send a MCS Serve/Register request to the SG. An MCS Client can only register with one MARS Server in the SG.",
      "ja": "MCSは、/登録要求がSGドメイン内のMCSクライアントによって登録または特定のグループのサービスを伝播するために使用されるサーブ。これは、セクション6.2.2と[1]の6.2.3で定義されたMARS_MSERV要求と同様です。 SGでMARS Serverが正常に新しいMCSクライアントを追加すると、それがSGへの要求を登録/サーブMCSを送らなければなりませんSCVCだか特定のグループのMCSのサポートを追加します。 MCSクライアントはSGで1台のMARSサーバーに登録することができます。"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        Hardware Type          |        Protocol Type          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              SNAP                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     SNAP      |   Unused      |    Version    |   State       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Flags              |       Cluster Member ID       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Src Addr Len  | Group Addr Len| ATM Addr T/L  |ATM SubAddr T/L|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source Protocol Address             (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source ATM Address                  (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source ATM SubAddress               (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Minimum Multicast Group Address     (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Maximum Multicast Group Address     (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Hardware Type This value is the ATM Forum 'address family number' specified in [3] as 15 decimal (0x000F).",
      "ja": "ハードウェアタイプは、この値は、15進（0x000F）[3]で指定されたATMフォーラムの「アドレスファミリー番号」です。"
    },
    {
      "indent": 3,
      "text": "Protocol Type This field is the protocol type number for the protocol using MARS from [3]. (IPv4 is 0x0800).",
      "ja": "プロトコルタイプこのフィールドは、[3]からMARSを使用してプロトコルのプロトコルタイプ番号です。 （IPv4が0x0800です）。"
    },
    {
      "indent": 3,
      "text": "Protocol SNAP This field is the optional protocol SNAP extension to protocol type. This is the mar$pro.snap field from [1].",
      "ja": "議定書は、このフィールドには、プロトコルタイプにオプションのプロトコルSNAPの拡張であるSNAP。これは、[1]から傷の$ pro.snapフィールドです。"
    },
    {
      "indent": 3,
      "text": "Version Number Version Number for this document MUST be set to 0x00.",
      "ja": "この文書のバージョン番号バージョン番号は0x00に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "State State value is coded as 2 decimal for a MCS Serve/Register request.",
      "ja": "状態状態値はMCSサーブ/登録要求のための2進として符号化されます。"
    },
    {
      "indent": 3,
      "text": "Flags The flags field is used to contain several flags:",
      "ja": "フラグフラグフィールドは、いくつかのフラグを格納するために使用されます："
    },
    {
      "indent": 7,
      "text": "mar$flags\n   Bit 15   - mar$flags.layer3grp\n   Bit 13   - mar$flags.register\n   Bit 0-7  - mar$flags.sequence",
      "raw": true
    },
    {
      "indent": 5,
      "text": "The mar$flags.register bit MUST be set the same as in the originating MARS_MSERV request. The mar$flags.layer3grp bit MUST be zero and the mar$flags.sequence bits are of local significance only to the LS.",
      "ja": "傷の$ flags.registerビットは、発信MARS_MSERV要求と同様に設定しなければなりません。傷の$ flags.layer3grpビットがゼロでなければならないと傷の$ flags.sequenceビットはLSにローカル重要です。"
    },
    {
      "indent": 3,
      "text": "Cluster Member CMI This field contains the CMI assigned by the MARS Server which processed the MARS_MSERV request and uniquely identifies the MCS Client in the MARS server cache.",
      "ja": "クラスタメンバーCMIは、このフィールドはMARS_MSERV要求を処理し、一意MARSサーバのキャッシュにMCSクライアントを特定MARSサーバによって割り当てられたCMIが含まれています。"
    },
    {
      "indent": 3,
      "text": "Src Addr Len This field contains the length of the Source Protocol Address field. For IPv4, the value is 4 if an address is specified. A null (non-existent) address MUST be coded as zero length, and no space allocated for it in the message body.",
      "ja": "SRC ADDRレンは、このフィールドは、送信元プロトコルアドレスフィールドの長さが含まれています。アドレスが指定されている場合はIPv4の場合、値は4です。ヌル（存在しない）アドレスはゼロ長さ、及びメッセージボディにそれのために割り当てられないスペースとして符号化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Group Addr Len This field contains the length of the Group Protocol Address field. If the register bit in the flags field is set to 1 in the request this field MUST be zero. If the register bit is zero in the flags field the value of this field for IPv4 is 4.",
      "ja": "グループADDRレンは、このフィールドは、グループプロトコル・アドレス・フィールドの長さが含まれています。フラグフィールド内のレジスタビットが要求に1に設定されている場合、このフィールドはゼロでなければなりません。レジスタ・ビットは、フラグフィールドにゼロである場合、IPv4のこのフィールドの値は4です。"
    },
    {
      "indent": 3,
      "text": "ATM Addr T/L This field contains the type and length of the Source ATM Address field for the MCS Client that originated the MARS_MSERV request. The type and length encoding is described in Section 3.",
      "ja": "ATM ADDR T / LこのフィールドはMARS_MSERV要求を発したMCSクライアントのソースATMアドレスフィールドのタイプと長さが含まれています。タイプと長符号化はセクション3に記載されています。"
    },
    {
      "indent": 3,
      "text": "ATM SubAddr T/L This field contains the type and length of the Source ATM SubAddress field for the MCS Client that originated the MARS_MSERV request. The type and length encoding is described in Section 3.",
      "ja": "ATM SubAddr T / LこのフィールドはMARS_MSERV要求を発したMCSクライアントのソースATMサブアドレスフィールドのタイプと長さが含まれています。タイプと長符号化はセクション3に記載されています。"
    },
    {
      "indent": 3,
      "text": "Source Protocol Address This is the internetwork address for the source of an address binding in a MARS server cache entry. If Src Addr Len is set to zero no storage will be allocated.",
      "ja": "このソース・プロトコル・アドレスは、MARSサーバーのキャッシュエントリーにバインディングアドレスのソースのインターネットアドレスです。 SrcのADDRレンが何のストレージをゼロしないように設定されている場合は割り当てられます。"
    },
    {
      "indent": 3,
      "text": "Source ATM Address This is the MCS Client's ATM address of an address binding in a MARS server cache entry. The address is E.164 or ATM Forum NSAPA.",
      "ja": "ソースATMこれはMARSサーバキャッシュエントリーに結合アドレスのMCSクライアントのATMアドレスです。アドレスは、E.164またはATMフォーラムNSAPAです。"
    },
    {
      "indent": 3,
      "text": "Source ATM SubAddress This is the MCS Client's ATM subaddress of an address binding in a MARS server cache entry. The subaddress, if specified, is an ATM Forum NSAPA. If null, no storage will be allocated.",
      "ja": "ソースATMサブアドレスは、これがMARSサーバキャッシュエントリーに結合アドレスのMCSクライアントのATMサブアドレスです。サブアドレスは、指定された場合、ATMフォーラムNSAPAです。 nullの場合、ストレージが割り当てられません。"
    },
    {
      "indent": 3,
      "text": "Minimum Multicast Group Address This is the internetwork address of the lower bound on the range of multicast group addresses for the address binding in a MARS server cache entry. If Group Addr Len is set to zero no storage will be allocated.",
      "ja": "最小マルチキャストグループは、これがMARSサーバキャッシュエントリーにバインドアドレスのマルチキャストグループアドレスの範囲の下限のインターネットアドレスです。グループADDRレンが何のストレージをゼロしないように設定されている場合は割り当てられます。"
    },
    {
      "indent": 3,
      "text": "Maximum Multicast Group Address This is the internetwork address of the upper bound on the range of multicast group addresses for the address binding in a MARS server cache entry. If Group Addr Len is set to zero no storage will be allocated.",
      "ja": "この最大のマルチキャストグループアドレスは、MARSサーバーのキャッシュエントリーにバインドアドレスのマルチキャストグループアドレスの範囲の上限のインターネットアドレスです。グループADDRレンが何のストレージをゼロしないように設定されている場合は割り当てられます。"
    },
    {
      "indent": 3,
      "text": "An MCS Client can only register with one MARS Server in the SG and is only placed on the SCVC for the MARS Server for which it is registered with.",
      "ja": "MCSクライアントはSGで1 MARSサーバーに登録することができますし、それだけが登録されているMARS ServerのSCVCの上に置かれています。"
    },
    {
      "indent": 3,
      "text": "When a MCS Client Serve/Register request specifying a group address is received by a MARS Server it MUST create a cache entry associated with this client. In addition to adding the cache entry it MUST send out a MARS_MIGRATE message on it's CCVC. This is needed so that clients using a mesh topology can migrate to a server based topology. Details regarding the MARS_MIGRATE message can be found in Section 5.1.6 of [1].",
      "ja": "MCS Clientがサーブするとき/リクエストには、このクライアントに関連付けられたキャッシュエントリを作成する必要がありMARSサーバーによって受信されたグループアドレスを指定して登録します。キャッシュエントリを追加することに加えて、それはそれはCCVCだ上MARS_MIGRATEメッセージを送らなければなりません。メッシュトポロジーを使用して、クライアントがサーバーベースのトポロジに移行できるようにするために必要とされています。 MARS_MIGRATEメッセージに関する詳細は、[1]のセクション5.1.6に見出すことができます。"
    },
    {
      "indent": 0,
      "text": "5.3 MARS Client Join/Register request.",
      "section_title": true,
      "ja": "5.3 MARSクライアントは要求を登録/参加します。"
    },
    {
      "indent": 3,
      "text": "The MARS Client Join/Register request is used to propagate the registering or joining of specific group ranges by MARS Clients within the SG domain. It is similar to the MARS_JOIN request defined in Sections 5.2.1 to 5.2.3 of [1]. When a MARS Server in the SG successfully registers a new MARS Client or a registered client joins a specific group address range the MARS Server MUST send a MARS Client Join/Register request to the SG. A MARS Client can only register with one MARS Server in the SG and is placed only on that servers CCVC.",
      "ja": "参加/登録要求が特定のグループの登録や参加を伝播するために使用されるMARS ClientはSGドメイン内MARSクライアントでの範囲です。これは、[1]の5.2.3にセクション5.2.1で定義されたMARS_JOIN要求と同様です。 SGでMARSサーバーが正常に新しいMARSクライアントを登録するか、登録されたクライアントは、MARS ServerがMARSクライアントは/参加SGへの要求を登録送らなければなりません特定のグループアドレスの範囲に参加すると。 MARSクライアントはSGで1 MARSサーバーに登録することができますし、それだけでサーバCCVCの上に置かれています。"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        Hardware Type          |        Protocol Type          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              SNAP                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     SNAP      |   Unused      |    Version    |   State       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Flags              |       Cluster Member ID       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Src Addr Len  | Group Addr Len| ATM Addr T/L  |ATM SubAddr T/L|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source Protocol Address             (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source ATM Address                  (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source ATM SubAddress               (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Minimum Multicast Group Address     (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Maximum Multicast Group Address     (variable length)     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Hardware Type This value is the ATM Forum 'address family number' specified in [3] as 15 decimal (0x000F).",
      "ja": "ハードウェアタイプは、この値は、15進（0x000F）[3]で指定されたATMフォーラムの「アドレスファミリー番号」です。"
    },
    {
      "indent": 3,
      "text": "Protocol Type This field is the protocol type number for the protocol using MARS from [3]. (IPv4 is 0x0800).",
      "ja": "プロトコルタイプこのフィールドは、[3]からMARSを使用してプロトコルのプロトコルタイプ番号です。 （IPv4が0x0800です）。"
    },
    {
      "indent": 3,
      "text": "Protocol SNAP This field is the optional protocol SNAP extension to protocol type. This is the mar$pro.snap field from [1].",
      "ja": "議定書は、このフィールドには、プロトコルタイプにオプションのプロトコルSNAPの拡張であるSNAP。これは、[1]から傷の$ pro.snapフィールドです。"
    },
    {
      "indent": 3,
      "text": "Version Number Version Number for this document MUST be set to 0x00.",
      "ja": "この文書のバージョン番号バージョン番号は0x00に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "State State value is coded as 3 decimal for a MARS Client Join/Register request.",
      "ja": "状態状態値は、MARSクライアント参加/登録要求のための3小数点として符号化されます。"
    },
    {
      "indent": 3,
      "text": "Flags The flags field is used to contain several flags:",
      "ja": "フラグフラグフィールドは、いくつかのフラグを格納するために使用されます："
    },
    {
      "indent": 7,
      "text": "mar$flags\n   Bit 15   - mar$flags.layer3grp\n   Bit 13   - mar$flags.register\n   Bit 0-7  - mar$flags.sequence",
      "raw": true
    },
    {
      "indent": 5,
      "text": "The mars$flags.layer3grp and mar$flags.register bits MUST be set the same as in the originating MARS_JOIN request. The mar$flags.sequence bits are of local significance only to the LS.",
      "ja": "MARSは$ flags.layer3grpとマール$ flags.registerビットは、発信MARS_JOIN要求と同じに設定しなければなりません。傷の$ flags.sequenceビットはLSにローカル重要です。"
    },
    {
      "indent": 3,
      "text": "Cluster Member CMI This field contains the CMI assigned by the MARS Server which processed the MARS_JOIN request and uniquely identifies the MARS Client in the MARS server cache.",
      "ja": "クラスタメンバーCMIは、このフィールドはMARS_JOIN要求を処理し、一意MARSサーバのキャッシュにMARSクライアントを特定MARSサーバによって割り当てられたCMIが含まれています。"
    },
    {
      "indent": 3,
      "text": "Src Addr Len This field contains the length of the Source Protocol Address field. For IPv4, the value is 4 if an address is specified. A null (non-existent) address MUST be coded as zero length, and no space allocated for it in the message body.",
      "ja": "SRC ADDRレンは、このフィールドは、送信元プロトコルアドレスフィールドの長さが含まれています。アドレスが指定されている場合はIPv4の場合、値は4です。ヌル（存在しない）アドレスはゼロ長さ、及びメッセージボディにそれのために割り当てられないスペースとして符号化されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Group Addr Len This field contains the length of the Group Protocol Address field. If the register bit in the flags field is set to 1 in the request this field MUST be zero. If the register bit is zero in the flags field the value of this field for IPv4 is 4.",
      "ja": "グループADDRレンは、このフィールドは、グループプロトコル・アドレス・フィールドの長さが含まれています。フラグフィールド内のレジスタビットが要求に1に設定されている場合、このフィールドはゼロでなければなりません。レジスタ・ビットは、フラグフィールドにゼロである場合、IPv4のこのフィールドの値は4です。"
    },
    {
      "indent": 3,
      "text": "ATM Addr T/L This field contains the type and length of the Source ATM Address field for the MARS Client that originated the MARS_JOIN request. The type and length encoding is described in Section 3.",
      "ja": "ATM ADDR T / LこのフィールドはMARS_JOIN要求を発信しMARSクライアントのソースATMアドレスフィールドのタイプと長さが含まれています。タイプと長符号化はセクション3に記載されています。"
    },
    {
      "indent": 3,
      "text": "ATM SubAddr T/L This field contains the type and length of the Source ATM SubAddress field for the MARS Client that originated the MARS_JOIN request. The type and length encoding is described in Section 3.",
      "ja": "ATM SubAddr T / LこのフィールドはMARS_JOIN要求を発信しMARSクライアントのソースATMサブアドレスフィールドのタイプと長さが含まれています。タイプと長符号化はセクション3に記載されています。"
    },
    {
      "indent": 3,
      "text": "Source Protocol Address This is the internetwork address for the source of an address binding in a MARS server cache entry. If Src Addr Len is set to zero no storage will be allocated.",
      "ja": "このソース・プロトコル・アドレスは、MARSサーバーのキャッシュエントリーにバインディングアドレスのソースのインターネットアドレスです。 SrcのADDRレンが何のストレージをゼロしないように設定されている場合は割り当てられます。"
    },
    {
      "indent": 3,
      "text": "Source ATM Address This is the MARS Client's ATM address of an address binding in a MARS server cache entry. The address is E.164 or ATM Forum NSAPA.",
      "ja": "ソースATMこれはMARSサーバキャッシュエントリーに結合アドレスのMARSクライアントのATMアドレスです。アドレスは、E.164またはATMフォーラムNSAPAです。"
    },
    {
      "indent": 3,
      "text": "Source ATM SubAddress This is the MARS Client's ATM subaddress of an address binding in a MARS server cache entry. The subaddress, if specified, is an ATM Forum NSAPA. If null, no storage will be allocated.",
      "ja": "ソースATMサブアドレスは、これがMARSサーバキャッシュエントリーに結合アドレスのMARSクライアントのATMサブアドレスです。サブアドレスは、指定された場合、ATMフォーラムNSAPAです。 nullの場合、ストレージが割り当てられません。"
    },
    {
      "indent": 3,
      "text": "Minimum Multicast Group Address This is the internetwork address of the lower bound on the range of multicast group addresses for the address binding in a MARS server cache entry. If Group Addr Len is set to zero no storage will be allocated.",
      "ja": "最小マルチキャストグループは、これがMARSサーバキャッシュエントリーにバインドアドレスのマルチキャストグループアドレスの範囲の下限のインターネットアドレスです。グループADDRレンが何のストレージをゼロしないように設定されている場合は割り当てられます。"
    },
    {
      "indent": 3,
      "text": "Maximum Multicast Group Address This is the internetwork address of the upper bound on the range of multicast group addresses for the address binding in a MARS server cache entry. If Group Addr Len is set to zero no storage will be allocated.",
      "ja": "この最大のマルチキャストグループアドレスは、MARSサーバーのキャッシュエントリーにバインドアドレスのマルチキャストグループアドレスの範囲の上限のインターネットアドレスです。グループADDRレンが何のストレージをゼロしないように設定されている場合は割り当てられます。"
    },
    {
      "indent": 3,
      "text": "An MARS Client can only register with one MARS Server in the SG and is only placed on the CCVC for the MARS Server for which it is registered with. If the mar$flags.layer3grp is set to 1 than the Minimum and Maximum Multicast Group Addresses MUST be equal for IPv4.",
      "ja": "MARSクライアントはSGで1 MARSサーバーに登録することができますし、それだけが登録されているMARS ServerのCCVCの上に置かれています。傷の$ flags.layer3grpが1に設定されている場合の最小値と最大値のマルチキャストグループアドレスはIPv4の同じでなければなりません。"
    },
    {
      "indent": 3,
      "text": "When a MARS Client Join/Register request is sent with the mar$flags.register bit set to 1 all of the servers in the SG will create a cache entry for this client using the information in the request.",
      "ja": "MARSクライアントが参加すると/登録要求は、SG内のすべてのサーバーは、要求の情報を使用して、このクライアントのキャッシュエントリを作成します。1に設定されたmarの$ flags.registerビットで送信されます。"
    },
    {
      "indent": 3,
      "text": "When a registered MARS Client issues a MARS_JOIN for a specific group address range a MARS Client Join/Register request MUST be sent to the servers in the SG. The actions taken by each server in the SG depend on previous group membership actions and MCS supported groups.",
      "ja": "登録MARSクライアントが特定のグループアドレスの範囲のためのMARS_JOINを発行するとMARSクライアントは、/登録要求がSG内のサーバーに送信する必要がありましょう。 SG内の各サーバが実行したアクションは、前のグループメンバーシップアクションに依存し、MCSは、グループをサポートしていました。"
    },
    {
      "indent": 3,
      "text": "Each MARS Server MUST perform the necessary redistribution and hole punching algorithms before propagating this request to the CCVC and SCVC on each server. The redistribution and hole punching algorithms used for propagating join requests to the CCVC are the same as defined in Sections 6.1.2 and 6.2.4 of [1]. If the originating MARS_JOIN request is a duplicate of a previously joined range or contains no group address range than a MARS Client Join/Register MUST NOT be sent to the SG.",
      "ja": "各MARSサーバーは、各サーバーのCCVCとSCVCにこの要求を伝播する前に、必要に応じて再配分し、パンチのアルゴリズムを実行しなければなりません。 CCVCへ参加要求を伝播するために使用される再分配と穴パンチアルゴリズムは、セクション6.1.2および6.2.4で定義されたものと同じである[1]。発信元MARS_JOIN要求は以前に入社範囲の重複しているか、MARSクライアント/登録に参加しましょよりもグループアドレスの範囲が含まれていない場合はSGに送ってはいけません。"
    },
    {
      "indent": 3,
      "text": "The redistribution and hole punching algorithms used for propagating join requests as MARS_SJOIN request on a SCVC is the same as Section 6.2.4 except for the following. Only the MARS Servers which contain the registered MCS Clients for the target group ranges should propagate this information to their SCVCs.",
      "ja": "SCVC上MARS_SJOIN要求として参加要求を伝播するために使用され、再分配と穴パンチアルゴリズムは、以下を除いて、6.2.4項と同じです。唯一のターゲットグループ範囲の登録MCSクライアントが含まれているMARSサーバーはそのSCVCsにこの情報を伝播する必要があります。"
    },
    {
      "indent": 0,
      "text": "5.4 MARS Client Leave/Deregister request.",
      "section_title": true,
      "ja": "5.4 MARSクライアントはリクエストの登録を解除/ままにしておきます。"
    },
    {
      "indent": 3,
      "text": "The MARS Client Leave/Deregister request is used to propagate the deregistering or leaving of specific group ranges by registered MARS Clients within the SG domain. It is similar to the MARS_LEAVE request defined in Sections 5.2.1 to 5.2.3 of [1]. When a MARS Server in the SG successfully deregisters a registered MARS Client or a registered client leaves a specific group address range for which it had joined the MARS Server MUST send a MARS Client Leave/Deregister request to the SG. If a registered MARS Client is unexpectedly removed from the CCVC the MARS Server MUST act as a proxy and send a MARS Client Leave/Deregister request to the SG.",
      "ja": "MARSクライアント休暇/登録解除要求が登録抹消を伝播するために使用されるか、または特定のグループのままにされたSGドメイン内の登録MARSクライアントでの範囲です。これは、[1]の5.2.3にセクション5.2.1で定義されたMARS_LEAVE要求と同様です。 SGでMARS Serverが正常に登録MARSクライアントの登録を解除または登録されたクライアントは、MARS ServerはSGへのMARSクライアント休暇/登録解除要求を送らなければなりません参加していた対象の特定のグループアドレスの範囲を離れたとき。登録MARS Clientが予期せずCCVCから削除された場合MARSサーバーはプロキシとして動作し、SGにMARSクライアント休暇/登録解除要求を送らなければなりません。"
    },
    {
      "indent": 3,
      "text": "The format and meanings of the fields in a MARS Client Leave/Deregister request are the same as in Section 5.3 except the State is coded as 4 decimal for a MARS Client Leave/Deregister request.",
      "ja": "フォーマットとMARSクライアント脱退/登録解除要求のフィールドの意味はMARSクライアント脱退/登録解除要求の4小数としてコード化されている状態を除いて、セクション5.3と同じです。"
    },
    {
      "indent": 3,
      "text": "When a MARS Client Leave/Deregister request is sent with the mar$flags.register bit set to 1 all of the servers in the SG receiving this update MUST purge all cache entries for this client.",
      "ja": "MARSクライアント休暇/登録解除要求が1に設定されたmarの$ flags.registerビットで送信される場合、この更新を受けSG内のすべてのサーバーは、このクライアントのすべてのキャッシュエントリを削除しなければなりません。"
    },
    {
      "indent": 3,
      "text": "When a registered MARS Client issues a MARS_LEAVE for a specific group address range a MARS Client LEAVE/Deregister request MUST be sent to the servers in the SG. The actions taken by each server in the SG depend on previous group membership actions and MCS supported groups.",
      "ja": "登録MARSクライアントが特定のグループアドレスの範囲のためのMARS_LEAVEを発行するとMARSクライアントLEAVE /登録解除要求は、SG内のサーバーに送らなければなりません。 SG内の各サーバが実行したアクションは、前のグループメンバーシップアクションに依存し、MCSは、グループをサポートしていました。"
    },
    {
      "indent": 3,
      "text": "Each MARS Server MUST perform the necessary redistribution and hole punching algorithms before propagating this request to the CCVC and SCVC on each server. The redistribution and hole punching algorithms used for propagating leave requests to the CCVC are the same as defined in Sections 6.1.2 and 6.2.4 of [1]. If the originating MARS_LEAVE request does not correspond to a previously joined range or contains no group address range than a MARS Client Leave/Deregister MUST NOT be sent to the SG.",
      "ja": "各MARSサーバーは、各サーバーのCCVCとSCVCにこの要求を伝播する前に、必要に応じて再配分し、パンチのアルゴリズムを実行しなければなりません。 CCVCに休暇要求を伝搬するために使用される再分配と穴パンチアルゴリズムは、セクション6.1.2および6.2.4で定義されたものと同じである[1]。元のMARS_LEAVE要求は以前に入社範囲に対応したりMARSクライアント休暇/登録解除よりもグループアドレスの範囲が含まれていないいない場合はSGに送ってはいけません。"
    },
    {
      "indent": 3,
      "text": "The redistribution and hole punching algorithms used for propagating leave requests as MARS_SLEAVE requests on a SCVC is the same as Section 6.2.4 except for the following. Only the MARS Servers which contain the registered MCS Clients for the target group ranges should propagate this information to their SCVCs.",
      "ja": "SCVC上MARS_SLEAVE要求として休暇申請を伝播するために使用され、再分配と穴パンチアルゴリズムは、以下を除いて、6.2.4項と同じです。唯一のターゲットグループ範囲の登録MCSクライアントが含まれているMARSサーバーはそのSCVCsにこの情報を伝播する必要があります。"
    },
    {
      "indent": 0,
      "text": "5.5 MCS Unserve/Deregister request.",
      "section_title": true,
      "ja": "5.5 MCS Unserve /登録解除要求。"
    },
    {
      "indent": 3,
      "text": "The MCS Unserve/Deregister request is used to propagate the deregistering or unservicing of specific groups by a registered MCS Client within the SG domain. It is similar to an MARS_MUNSERV request defined in Section 6.2.2 and 6.2.3 of [1]. When a MARS Server in the SG successfully deregisters a registered MCS Client or registered MCS Client stops serving a specific group address range for which it had serviced the MARS Server MUST send a MCS Unserve/Deregister request to the SG. If a registered MCS Client is unexpectedly removed from the SCVC the MARS Server owning the SCVC MUST act as a proxy and send a MCS Unserve/Deregister request to the SG.",
      "ja": "MCS Unserve /登録解除要求は、SGドメイン内の登録MCSクライアントによって登録抹消または特定のグループのunservicingを伝播するために使用されます。これは、セクション6.2.2と[1]の6.2.3で定義されたMARS_MUNSERV要求と同様です。 SGでMARSサーバーが正常に登録MCSクライアントまたは登録MCSクライアントの登録を解除すると、それはMARS ServerはSGへのMCS Unserve /登録解除要求を送信しなければならないサービスを提供いたため、特定のグループアドレスの範囲を提供を停止します。登録したMCS Clientが予期せずSCVCから削除された場合SCVCを所有しているMARSサーバーはプロキシとして動作し、SGへのMCS Unserve /登録解除要求を送らなければなりません。"
    },
    {
      "indent": 3,
      "text": "The format and meanings of the fields in a MCS Unserve/Deregister request are the same as in Section 5.2 except the State is coded as 5 decimal for a MCS Unserve/Deregister request.",
      "ja": "フォーマット及びMCS Unserve /登録解除要求のフィールドの意味はMCS Unserve /登録解除要求の5小数としてコード化されている状態を除いて、セクション5.2と同じです。"
    },
    {
      "indent": 3,
      "text": "When a MCS Client Unserve/Deregister request is sent with the mar$flags.register bit set to 1 all of the servers in the SG receiving this update MUST purge all cache entries for this client.",
      "ja": "MCSクライアントUnserve /登録解除要求が1に設定されたmarの$ flags.registerビットで送信される場合、この更新を受けSG内のすべてのサーバーは、このクライアントのすべてのキャッシュエントリを削除しなければなりません。"
    },
    {
      "indent": 3,
      "text": "When a registered MCS Client issues a MARS_MUNSERV for a specific group address range being served a MCS Client Unserve/Deregister request MUST be sent to the servers in the SG. The members of the SG that receive this update must then clear the cache entry associated with this MCS Client.",
      "ja": "登録したMCS Clientが特定のグループアドレスの範囲のためのMARS_MUNSERVを発行するとMCSクライアントUnserve /登録解除要求はSGのサーバに送らなければなりません提供されています。この更新プログラムを受けるSGのメンバーは、このMCSクライアントに関連付けられたキャッシュエントリをクリアする必要があります。"
    },
    {
      "indent": 3,
      "text": "In addition to clearing one or more cache entries associated with receiving a MCS Client Unserve/Deregister request each MARS Server in the SG MUST send out a MARS_LEAVE message on it's CCVC in order for clients to change back to a mesh topology.",
      "ja": "MCSクライアントUnserve /登録解除要求を受信すると関連する1つ以上のキャッシュエントリをクリアすることに加えてSG内の各MARS Serverは、クライアントがバックメッシュトポロジに変更するためにCCVCだ上MARS_LEAVEメッセージを送らなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There is no mechanism to encrypt the CSA Record MARS Specific Part of the message exchanged between servers. However, there are base SCSP security features in the SCSP Protocol Independent part [2] which can be used to protect against attacks.",
      "ja": "サーバ間で交換されたメッセージのCSA録音MARS特定の部分を暗号化するメカニズムはありません。しかし、ベースSCSPのセキュリティ機能は、[2]攻撃から保護するために使用することができSCSPプロトコル独立部分にあります。"
    },
    {
      "indent": 3,
      "text": "Any SCSP MARS is susceptible to Denial of Service (DOS) attacks. A rouge MARS Client can inundate its Server with MARS packets. This is a base MARS problem as currently defined by [1]. A rouge host can also inundate its neighboring SCSP MARS with SCSP packets. However, if the authentication option is used, the SCSP MARS databases will not become corrupted, as the bogus packets will be discarded when the authentication check fails.",
      "ja": "どれSCSP MARSは、サービス拒否（DoS）攻撃を受けやすいです。ルージュMARSクライアントは、MARSパケットでそのサーバーを浸水することができます。これは、現在[1]で定義されたベースMARSの問題です。ルージュのホストは、SCSPパケットとその周辺SCSP MARSを浸水することができます。認証オプションが使用されている場合は認証チェックが失敗したときに偽のパケットが破棄されるようにしかし、SCSP MARSデータベースは、破損していないだろう。"
    },
    {
      "indent": 3,
      "text": "Due to the pair wise authentication model of SCSP MARS, the information received from any properly authenticated server is trusted and propagated throughout the server group. Consequently, if security of any SCSP MARS server is compromised, the entire database becomes vulnerable to corruption originating from the compromised server.",
      "ja": "SCSP MARS、任意の適切に認証サーバから受信した情報のペアワイズ認証モデルに信頼され、サーバグループ全体に伝播。任意SCSP MARSサーバのセキュリティが侵害された場合、結果として、データベース全体が損なわサーバから発信破損に対して脆弱になります。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "リファレンス"
    },
    {
      "indent": 3,
      "text": "[1] Armitage, G., \"Support for Multicast over UNI 3.0/3.1 based ATM Networks\", RFC 2022, November 1996.",
      "ja": "[1]アーミテージ、G.、 \"UNI 3.0 / 3.1以上のマルチキャストのサポートベースのATMネットワーク\"、RFC 2022、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[2] Luciani, J., Armitage, G., Halpern, J. and N. Doraswamy, \"Server Cache Synchronization Protocol\", RFC 2334, April 1998.",
      "ja": "[2]ルチアーニ、J.、アーミテージ、G.、ハルパーン、J.とN. Doraswamy、 \"サーバキャッシュ同期プロトコル\"、RFC 2334、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[3] Reynolds, J. and J. Postel, \"Assigned Numbers\", STD 2, RFC 1700, October 1994. See also: http://www.iana.org/numbers.html",
      "ja": "[3]レイノルズ、J.およびJ.ポステル、 \"割り当て番号\"、STD 2、RFC 1700、1994年10月を見る：http://www.iana.org/numbers.html"
    },
    {
      "indent": 3,
      "text": "[4] Laubach, M., \"Classic IP and ARP over ATM\", RFC 1577, January 1994.",
      "ja": "[4]ラウバッハ、M.、 \"クラシックIPおよびATM上ARP\"、RFC 1577、1994年1月。"
    },
    {
      "indent": 3,
      "text": "[5] Bradner, S., \"Key Words for use in RFCs to Indicate Requirement Levels,\" BCP 14, RFC 2119, March 1997.",
      "ja": "[5]ブラドナーの、S.、 \"のRFCsにおける使用のためのキーワードは、要件レベルを示すために、\" BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Grenville Armitage for his previous distributed MARS work and also the members of the ION working group of the IETF, whose review and discussion of this document has been invaluable.",
      "ja": "著者は、彼の前に分散MARSワークとも見直し、この文書の議論貴重となっているIETFのIONワーキンググループのメンバーのグレンヴィルアーミテージに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "James V. Luciani Bay Networks, Inc. 3 Federal Street, BL3-04 Billerica, MA 01821",
      "ja": "ジェームスV.ルチアーニベイネットワーク株式会社3連邦ストリート、BL3-04ビレリカ、MA 01821"
    },
    {
      "indent": 3,
      "text": "Phone: +1-508-916-4734 EMail: luciani@baynetworks.com",
      "ja": "電話：+ 1-508-916-4734 Eメール：luciani@baynetworks.com"
    },
    {
      "indent": 3,
      "text": "Anthony M. Gallo IBM, Networking Hardware Division Dept. M6LA/B664 P.O. Box 12195 Research Triangle Park, NC 27709",
      "ja": "アンソニー・M.ギャロIBM、ネットワークハードウェア事業本部M6LA / B664の私書箱12195リサーチトライアングルパーク、NC 27709箱"
    },
    {
      "indent": 3,
      "text": "Phone: +1-919-254-9889 EMail: gallo@raleigh.ibm.com",
      "ja": "電話：+ 1-919-254-9889 Eメール：gallo@raleigh.ibm.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}