{
  "title": {
    "text": "RFC 2763 - Dynamic Hostname Exchange Mechanism for IS-IS",
    "ja": "RFC 2763 - IS-ISの動的ホスト名交換メカニズム"
  },
  "number": 2763,
  "created_at": "2024-01-31 13:17:46.683192+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           N. Shen\nRequest for Comments: 2763                                Siara Systems\nCategory: Informational                                         H. Smit\n                                                          Cisco Systems\n                                                          February 2000",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 18,
      "text": "Dynamic Hostname Exchange Mechanism for IS-IS",
      "ja": "IS-ISの動的ホスト名交換メカニズム"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "Currently, there does not exist a simple and dynamic mechanism for routers running IS-IS to learn about symbolic hostnames. This document defines a new TLV which allows the IS-IS routers to flood their name to system ID mapping information across the IS-IS network.",
      "ja": "現在、ランニングを実行するルーターには、シンボリックホスト名について学習するためのシンプルで動的なメカニズムは存在しません。このドキュメントでは、IS-ISルーターがIS-ISネットワーク全体のシステムIDマッピング情報に名前をあふれさせる新しいTLVを定義します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "IS-IS uses a 1-8 byte system ID (normally 6 bytes) to represent a node in the network. For management and operation reasons, network operators need to check the status of IS-IS adjacencies, entries in the routing table and the content of the IS-IS link state database. It is obvious that, when looking at diagnostics information, hexadecimal representations of systemIDs and LSP identifiers are less clear than symbolic names.",
      "ja": "IS-ISは、1〜8バイトシステムID（通常6バイト）を使用して、ネットワーク内のノードを表します。管理および運用上の理由については、ネットワークオペレーターは、IS隣接のステータス、ルーティングテーブルのエントリ、IS-ISリンク状態データベースのコンテンツを確認する必要があります。診断情報を見ると、SystemssとLSPの識別子の16進表現がシンボリック名よりも明確ではないことは明らかです。"
    },
    {
      "indent": 3,
      "text": "One way to overcome this problem is to define a name-to-systemID mapping on a router. This mapping can be used bidirectionally. E.g., to find symbolic names for systemIDs, and to find systemIDs for symbolic names. One way to build this table of mappings is by static definitions. Among network administrators who use IS-IS as their IGP it is current practice to define such static mappings.",
      "ja": "この問題を克服する1つの方法は、ルーターで名前からシステムへのマッピングを定義することです。このマッピングは双方向で使用できます。たとえば、Systemidsのシンボリック名を見つけ、象徴的な名前のSystemidsを見つけること。このマッピングのテーブルを構築する1つの方法は、静的定義です。IS-ISをIGPとして使用するネットワーク管理者の間で、このような静的マッピングを定義することは現在の実践です。"
    },
    {
      "indent": 3,
      "text": "Thus every router has to maintain a table with mappings between router names and systemIDs. These tables need to contain all names and systemIDs of all routers in the network.",
      "ja": "したがって、すべてのルーターは、ルーター名とSystemIDSの間のマッピングを備えたテーブルを維持する必要があります。これらのテーブルには、ネットワーク内のすべてのルーターのすべての名前とシステムを含める必要があります。"
    },
    {
      "indent": 3,
      "text": "There are several ways one could build such a table. One is via static configurations. Another scheme that could be implemented is via DNS lookups. In this document we propose a third solution. We hope the proposed solution is easier and more manageable than static mapping or DNS schemes.",
      "ja": "そのようなテーブルを構築する方法はいくつかあります。1つは静的構成を介してです。実装できるもう1つのスキームは、DNSルックアップを介してです。このドキュメントでは、3番目のソリューションを提案します。提案されたソリューションが、静的マッピングまたはDNSスキームよりも簡単で管理しやすいことを願っています。"
    },
    {
      "indent": 0,
      "text": "2. Possible solutions",
      "section_title": true,
      "ja": "2. 可能な解決策"
    },
    {
      "indent": 3,
      "text": "The obvious drawback of static configuration of mappings is the issue of scalability and maintainability. The network operators have to maintain the name tables. They have to maintain an entry in the table for every router in the network. They have to maintain this table on each router in the network. The effort to create and maintain these static tables grows with the total number of routers on the network. Changing the name or systemID of one router, or adding one new router introduced will affect the configurations of all the other routers on the network. This will make it very likely that those static tables are outdated.",
      "ja": "マッピングの静的構成の明らかな欠点は、スケーラビリティと保守性の問題です。ネットワークオペレーターは、名前テーブルを維持する必要があります。ネットワーク内のすべてのルーターのテーブル内にエントリを維持する必要があります。ネットワーク内の各ルーターにこのテーブルを維持する必要があります。これらの静的テーブルを作成および維持する努力は、ネットワーク上のルーターの総数とともに成長します。1つのルーターの名前またはSystemIDを変更するか、導入された1つの新しいルーターを追加すると、ネットワーク上の他のすべてのルーターの構成に影響します。これにより、これらの静的テーブルが時代遅れである可能性が非常に高くなります。"
    },
    {
      "indent": 3,
      "text": "Having one table that can be updated in a centralized place would be helpful. One could imagine using the DNS system for this. A drawback is that during the time of network problems, the response time of DNS services might not be satisfactory or the DNS services might not even be available. Another possible drawback might be the added complexity of DNS. Also, some DNS implementations might not support A and PTR records for CLNS NSAPs.",
      "ja": "一元化された場所で更新できるテーブルを1つ持っておくことが役立ちます。これにDNSシステムを使用することを想像できます。欠点は、ネットワークの問題の時点で、DNSサービスの応答時間が満足のいくものではないか、DNSサービスさえ利用できない可能性があることです。別の考えられる欠点は、DNSの複雑さが追加されることです。また、一部のDNS実装は、CLNS NSAPのAおよびPTRレコードをサポートしていない場合があります。"
    },
    {
      "indent": 3,
      "text": "A third way to build dynamic mappings would be to use the transport mechanism of the routing protocol itself to advertise symbolic names in IS-IS link-state PDU. This document defines a new TLV which allows the IS-IS routers to include the name to systemID mapping information in their LSPs. This will allow simple and reliable transport of name mapping information across the IS-IS network.",
      "ja": "動的マッピングを構築する3番目の方法は、ルーティングプロトコル自体のトランスポートメカニズムを使用して、IS-ISリンク状態のPDUでシンボリック名を宣伝することです。このドキュメントでは、IS-ISルーターがLSPのSystemIDマッピング情報に名前を含めることができる新しいTLVを定義します。これにより、IS-ISネットワーク全体の名前マッピング情報のシンプルで信頼できる輸送が可能になります。"
    },
    {
      "indent": 0,
      "text": "3. The Dynamic Hostname TLV",
      "section_title": true,
      "ja": "3. 動的ホスト名TLV"
    },
    {
      "indent": 3,
      "text": "The Dynamic hostname TLV is defined here as TLV type 137.",
      "ja": "動的ホスト名TLVは、ここでTLVタイプ137として定義されています。"
    },
    {
      "indent": 9,
      "text": "LENGTH - total length of the value field.",
      "ja": "長さ - 値フィールドの全長。"
    },
    {
      "indent": 9,
      "text": "VALUE - a string of 1 to 255 bytes.",
      "ja": "値 -  1〜255バイトの文字列。"
    },
    {
      "indent": 3,
      "text": "The Dynamic hostname TLV is optional. This TLV may be present in any fragment of a non-pseudo node LSP. The value field identifies the symbolic name of the router originating the LSP. This symbolic name can be the FQDN for the router, it can be a subset of the FQDN or any string operators want to use for the router. The use of FQDN or a subset of it is strongly recommended. The content of this value is a domain name, see RFC 2181. The string is not null-terminated. The systemID of this router can be derived from the LSP identifier.",
      "ja": "動的ホスト名TLVはオプションです。このTLVは、非pseudoノードLSPの断片に存在する場合があります。値フィールドは、LSPを発信するルーターの象徴的な名前を識別します。この象徴的な名前は、ルーターのFQDNである可能性があります。これは、FQDNのサブセットまたはルーターに使用したい文字列演算子にすることができます。FQDNまたはそのサブセットの使用を強くお勧めします。この値のコンテンツはドメイン名です。RFC2181を参照してください。文字列はヌル終了しません。このルーターのSystemIDは、LSP識別子から導出できます。"
    },
    {
      "indent": 3,
      "text": "If this TLV is present in a pseudo node LSP, then it should not be interpreted as the DNS hostname of the router.",
      "ja": "このTLVが擬似ノードLSPに存在する場合、ルーターのDNSホスト名として解釈されるべきではありません。"
    },
    {
      "indent": 0,
      "text": "4. Implementation",
      "section_title": true,
      "ja": "4. 実装"
    },
    {
      "indent": 3,
      "text": "The Dynamic Hostname TLV is optional. When originating an LSP, a router may decide to include this TLV in its LSP. Upon receipt of an LSP with the dynamic hostname TLV, a router may decide to ignore this TLV, or to install the symbolic name and systemID in its hostname mapping table.",
      "ja": "動的ホスト名TLVはオプションです。LSPを発信する場合、ルーターはこのTLVをLSPに含めることを決定する場合があります。ダイナミックホスト名TLVを使用してLSPを受信すると、ルーターはこのTLVを無視するか、ホスト名マッピングテーブルにシンボリック名とSystemIDをインストールすることを決定する場合があります。"
    },
    {
      "indent": 3,
      "text": "A router may also optionally insert this TLV in it's pseudo node LSP for the association of a symbolic name to a local LAN.",
      "ja": "ルーターは、オプションでこのTLVを擬似ノードLSPに挿入して、シンボリック名とローカルLANに関連付けます。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document raises no new security issues for IS-IS. However, it is encouraged to use authentications for IS-IS routing protocol. The authentication mechanism for IS-IS protocol is specified in [1] and it is being enhanced within IETF in [2].",
      "ja": "このドキュメントは、IS-ISの新しいセキュリティの問題を提起しません。ただし、IS-ISルーティングプロトコルに認証を使用することをお勧めします。IS-ISプロトコルの認証メカニズムは[1]で指定されており、[2]のIETF内で強化されています。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Enke Chen and Yakov Rekhter for their comments on this work.",
      "ja": "著者は、この作品についてのコメントについて、エンケ・チェンとヤコフ・レクターに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 3,
      "text": "[1] ISO, \"Intermediate system to Intermediate system routing information exchange protocol for use in conjunction with the Protocol for providing the Connectionless-mode Network Service (ISO 8473),\" ISO/IEC 10589:1992.",
      "ja": "[1] ISO、「Connectionless-Mode Network Service（ISO 8473）を提供するためのプロトコルと組み合わせて使用するための情報交換プロトコルを中間システムにルーティングする中間システム（ISO 8473）」、ISO/IEC 10589：1992。"
    },
    {
      "indent": 3,
      "text": "[2] Li, T., \"IS-IS HMAC-MD5 Authentication\", Work in Progress.",
      "ja": "[2] Li、T。、「is-is hmac-md5認証」、進行中の作業。"
    },
    {
      "indent": 0,
      "text": "8. Authors' Addresses",
      "section_title": true,
      "ja": "8. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Naiming Shen Siara Systems, Inc. 1195 Borregas Avenue Sunnyvale, CA, 94089",
      "ja": "Naiming Shen Siara Systems、Inc。1195 Borregas Avenue Sunnyvale、CA、94089"
    },
    {
      "indent": 3,
      "text": "EMail: naiming@siara.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Henk Smit Cisco Systems, Inc. 170 Tasman Drive San Jose, CA, 95134",
      "ja": "Henk Smit Cisco Systems、Inc。170 Tasman Drive San Jose、CA、95134"
    },
    {
      "indent": 3,
      "text": "EMail: hsmit@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "ja": "9. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}