{
  "title": {
    "text": "RFC 2323 - IETF Identification and Security Guidelines",
    "ja": "RFC 2323 - IETFの同定およびセキュリティガイドライン"
  },
  "number": 2323,
  "created_at": "2019-10-23 03:39:13.779676+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          A. Ramos\nRequest for Comments: 2323                                          ISI\nCategory: Informational                                    1 April 1998",
      "raw": true
    },
    {
      "indent": 14,
      "text": "IETF Identification and Security Guidelines",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "1. Abstract",
      "section_title": true,
      "ja": "1.要約"
    },
    {
      "indent": 3,
      "text": "This RFC is meant to represent a guideline by which the IETF conferences may run more effeciently with regards to identification and security protocols, with specific attention paid to a particular sub-group within the IETF: \"facial hairius extremis\".",
      "ja": "「顔のhairiusのエクストリミス」：このRFCはIETF会議はIETF内の特定のサブグループに支払わ特定の注意を払って、識別およびセキュリティプロトコルに関して、よりeffeciently実行できたことにより、ガイドラインを表すように意図されています。"
    },
    {
      "indent": 3,
      "text": "This document will shed further illumination on these problems and provide some possible solutions.",
      "ja": "この文書では、これらの問題に、さらに照明を当てると、いくつかの可能な解決策を提供します。"
    },
    {
      "indent": 3,
      "text": "This memo provides entertainment for the Internet community. It does not specify an Internet standard of any kind, but is rather unstandard, actually. Please laugh loud and hard.",
      "ja": "このメモはインターネットコミュニティのためのエンターテイメントを提供しています。それは実際には、どんな種類のインターネット標準を指定するのではなく、unstandardではありません。大声で、ハード笑ってください。"
    },
    {
      "indent": 0,
      "text": "2. Introduction",
      "section_title": true,
      "ja": "2.はじめに"
    },
    {
      "indent": 3,
      "text": "It has come to the attention of THEY [1] that a certain \"facial hairius extremesis\" of the male variety of the species \"homo sapien\" of the sub-culture \"computeris extrordinarisis\" have overrun the IETF conferences and thus led to the break-down of many identification and safety protocols.",
      "ja": "それは「computeris extrordinarisisは」IETF会議をオーバーランし、これブレークにつながっている[1]のサブカルチャーの種「ヒト」の男性の様々な特定の「顔のhairiusのextremesis」というTHEYの注意に来ました多くの識別と安全なプロトコルの-down。"
    },
    {
      "indent": 0,
      "text": "3. Per Capita (Anecdotal) Evidence",
      "section_title": true,
      "ja": "3.一人当たり（逸話）証拠"
    },
    {
      "indent": 3,
      "text": "While collecting research about the sub-group \"facial hairius extremis\" (FHE), it was noted that the per capita appearance of FHEs at IETFs was largely disproportional with the existence of FHEs in the world-at-large. In fact, the existence of facial hair at all within the IETF community is extraordinarily common among the males of the group. Apart from ZZ-Top and WWF Wrestling, it is not possible to find more facial hair within any occupational group. In this author's own experience the average amount of men with long-term facial hair is less than 20%. Long-term versus short-term facial hair is a very important distinction as short-term facial hair, also known as the temporary illness \"goatee universitis\" (which symptoms range from full goatees to the less popular chin-goatee) is a common affliction for university-based males. Per capita (temporary) facial hair can go as high as 40%. However, among the males of the IETF the per capita long-term facial hair is as high as 60% [2].",
      "ja": "サブグループ「顔面hairiusのエクストリミス」（FHE）についての研究を収集しながら、それがIETFsでFHEsの一人当たりの外観は、世界的に大でFHEsの存在と大幅に不均衡であることが注目されました。実際には、全くIETFコミュニティ内の顔の毛の存在は、グループの男性の間で非常に一般的です。別にZZトップとWWFレスリングから、どんな職業グループ内でより多くの顔の毛を発見することはできません。この著者自身の経験では、長期顔の毛を持つ男性の平均量は20％未満です。短期的な顔の毛対長期も（症状がフルgoateesがからあまり人気の顎長めの範囲で）一時的な病気「あごひげのuniversitis」として知られている短期の顔の毛のような非常に重要な違いは、共通の悩みです大学ベースの男性のための。一人当たり（一時的な）顔の毛が40％と高く行くことができます。しかし、IETFの男性のうち一人当たり長期顔の毛が60％と高くなる[2]。"
    },
    {
      "indent": 3,
      "text": "Ordinarily, this abundance of long-term FHE would not require that an RFC be written. However, increasingly there have been issues regarding mistaken identification. For security purposes as well as ease of identification, this RFC will serve to clarify these issues and hopefully provide a solution for them.",
      "ja": "通常、長期FHEのこの豊富はRFCが書かれることを必要としません。しかし、ますます誤解識別に関する問題がありました。セキュリティの目的だけでなく、識別を容易にするために、このRFCは、これらの問題を明確にし、うまくいけば、彼らのためにソリューションを提供するのに役立つであろう。"
    },
    {
      "indent": 0,
      "text": "4. Mistaken Identification Syndrome (or \"Are you --jon. or Scott?\")",
      "section_title": true,
      "ja": "4.誤った識別症候群（または「あなたは--jonです。またはスコット？」）"
    },
    {
      "indent": 3,
      "text": "I was speaking to a very well-known network researcher, I'll call him --jon., who tells me that he is often mistaken for a SOBbing Harvard person. --jon. says, \"People tell someone to look for me or him and say that I'm about so-tall with a big white beard, and suddenly people are coming up to me and saying, 'Hi Scott' and he often tells me that he is mistakenly hailed as, '--jon.'. Often the mistake is made solely on the appearance of our facial hair.\"",
      "ja": "私は非常によく知られているネットワークの研究者に話していた、私は彼を--jon呼ぶことにします。、彼は多くの場合、すすり泣くハーバード人と間違えていることを私に告げる者。 --jon。人々は私や彼を見て、私は大きな白いひげで約ので、背の高いだと言うことを誰かに伝え、そして突然の人が私のところに来て言っている、 『こんにちはスコット』と彼はしばしば彼と私に伝えます」、と言います誤って、として歓迎される「--jon。」多くの間違いは、私たちの顔の毛の外観にのみ行われます。」"
    },
    {
      "indent": 3,
      "text": "Another story --jon. told me is that once a woman called looking for a computer researcher but only having a first name and physical description. The receiptionist asked for the description and the woman said she was looking for an older Caucasian man with a beard. The receptionist reportedly blurted out, \"they all have beards!!!!\"",
      "ja": "もう一つのストーリー--jon。コンピュータ研究者を探しているだけ最初の名前と物理的な説明を持つと呼ばれる女性一回ということである私に言いました。 receiptionistは、説明を求めた女性は、彼女がひげの高齢白人男性を探していたと述べました。受付は伝え、「彼らはすべてのひげを持っている!!!!」口走っ"
    },
    {
      "indent": 3,
      "text": "On a more personal note, two researchers who were both employed at USC/ISI shaved their very famous facial hair and were both unrecognizable to friends and co-workers alike. If it weren't for B.M.'s Grateful Dead T-shirts and lack of shoes, or R.V.M.'s voice I would have never recognized them.",
      "ja": "より多くの個人的なノートでは、両方のUSC / ISIで採用された2人の研究者は非常に有名な顔の毛を剃り、両方を問わず、友人や同僚に認識できました。それはB.M.のグレイトフルデッドTシャツと靴の欠如、またはR.V.M.の声がなかったら、私はそれを認識したことがないでしょう。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "It is obvious to this researcher that facial hair of any variety is a very recognizable characteristic. Indeed, when giving a description of a male who has facial hair, it is always one of the first characteristics given. Ordinarily this would not be a problem, since facial hair in the world at large is below 20%. However, when used as a description at IETFs, disaster can insue.",
      "ja": "これは、任意の様々な顔の毛は非常に認識可能な特性であることを、この研究者には自明です。顔の毛を持つ男性の記述を与えたときに実際に、それは常に与えられた最初の特徴の一つです。大規模で、世界の顔の毛が20％を下回っているため、通常これは問題ではありません。 IETFsで説明として使用した場合しかし、災害がinsueことができます。"
    },
    {
      "indent": 0,
      "text": "6. Solutions",
      "section_title": true,
      "ja": "6.ソリューション"
    },
    {
      "indent": 3,
      "text": "There are two parts to my proposed solution: the role of the seeker and the role of the FHE.",
      "ja": "求職者の役割とFHEの役割：私の提案した解決策には2つの部分があります。"
    },
    {
      "indent": 3,
      "text": "For those who are seeking a FHE of known identity:",
      "ja": "既知のアイデンティティのFHEを求めている人のために："
    },
    {
      "indent": 6,
      "text": "-It is important to recognize these men as individuals.",
      "ja": " - それは、個人として、これらの男性を認識することが重要です。"
    },
    {
      "indent": 9,
      "text": "Just because a man has the facial hair you are looking for, please stop to inquire if you have the correct person. Think of what a blow it is to a person's ego to be constantly misidentified, and think of how annoying it is to be hailed by someone across a crowded IETF room and they are yelling the WRONG NAME. So remember to look, identify, and ask BEFORE you begin rambling on about some Internet stuff.",
      "ja": "男は、あなたが探している顔の毛を持っているからといって、あなたが正しい人を持っている場合は、お問い合わせはおやめください。それは絶えず誤認されるように、人のエゴにあるもの打撃を考え、それが混雑したIETF部屋の向こうの誰かによって賞賛されるべきであると彼らは間違った名前を叫んでいるか迷惑なのだと思います。だから、見て識別し、そしてあなたには、いくつかのインターネット上のものについてとりとめ始める前に確認することを忘れないでください。"
    },
    {
      "indent": 3,
      "text": "For the FHE:",
      "ja": "FHEの場合："
    },
    {
      "indent": 6,
      "text": "-Give proper signals when being sought.",
      "ja": "求められている-Give適切な信号。"
    },
    {
      "indent": 9,
      "text": "If someone mistakenly calls you the wrong name, do not lose heart. Count to 10 and commonly reply, \"You must have mistaken me for so-and-so, I am not that person.\", and walk away. Also, if someone calls you from across a room, raise your your arm, smile and wave vigorously in affirmation or raise your arm, shake your head and give them a sign that you are not who they are looking for. As an FHE it is part of your responsibility to understand that facial hair is an extremely identifiable physical characteristic. Understand that non-FHE people do not mean any harm.",
      "ja": "誰かが誤って間違った名前あなたを呼び出すと、心を失うことはありません。 10まで数え、一般的に答える、「あなたはとても-と、そのための私を誤解している必要があり、私はその人ではないよ。」と、離れて歩いてください。また、誰かが部屋の向こうからあなたを呼び出して、あなたのあなたの腕を上げ、笑顔と肯定激しく振ったり、腕を上げ、頭を横に振ると、彼らにあなたは彼らが探しているされていない記号を与えた場合。 FHEとして、それはあなたの責任の一部は、顔の毛が非常に特定できる物理的な特性であることを理解することです。非FHEの人はどんな害を意味するものではありませんことを理解しています。"
    },
    {
      "indent": 0,
      "text": "7. Conclusion",
      "section_title": true,
      "ja": "7.おわりに"
    },
    {
      "indent": 3,
      "text": "In closing, I hope you found this RFC worthwhile and that it raised some interesting points. I also hope that I was able to further the cause of FHE and to make everyone's life a little bit easier. ;^)",
      "ja": "最後に、私はあなたがこのRFCは、価値のある発見し、それはいくつかの興味深い点を提起することを願っています。また、私はFHEの原因を促進するために、みんなの生活が少し楽にすることができたことを願っています。 ; ^）"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 3,
      "text": "[1] THEY THEY, \"We Who Everyone Quotes But Doesn't Know Who We Are\", Pop Culture, April 1998.",
      "ja": "[1]彼らは、ポップカルチャー、1998年4月に「誰もがしかし、引用我々は我々が誰であるか知っていません」。"
    },
    {
      "indent": 3,
      "text": "[2] 60% of IETF men have facial hair A. Ramos, \"Damn, A Lot Of Men Here Have Facial Hair\", ISI Talk, September 1997.",
      "ja": "[2] IETFの男性の60％は、顔の毛A.ラモスは、ISIの話、1997年9月「くそー、ここで男性の多くはひげを持って」います。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "I would like to thank the men of ISI who inspired me to write this RFC. I hope that my work will make life easier for you, and that the cases of mistaken identity will not be as common in the future because of this RFC. I understand your plight and feel for you. Good luck.",
      "ja": "私はこのRFCを書くために私にインスピレーションを得たISIの男性に感謝したいと思います。私は私の仕事はあなたのための生活を楽にし、人違いのケースがあるため、このRFCの将来のように一般的ではないだろうということを願っています。私はあなたの窮状を理解し、あなたのために感じます。幸運を。"
    },
    {
      "indent": 3,
      "text": "Thanks to my life partner, Martin, who's reoccuring affliction of goatee universitis is a constant source of joy for me.",
      "ja": "私の人生のパートナーのおかげで、あごひげの大学の苦悩を繰り返していますマーティンは、私にとって喜びの一定の源です。"
    },
    {
      "indent": 0,
      "text": "10. Author's Address",
      "section_title": true,
      "ja": "10.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Alegre Ramos USC/ISI 4676 Admiralty Way #1001 Marina del Rey, CA 90292",
      "ja": "ラモス・アレグレUSC / ISI 4676アドミラルティ・ウェイ＃1001マリナ・デル・レイ、CA 90292"
    },
    {
      "indent": 3,
      "text": "Phone: 310-822-1511 x153 EMail: ramos@isi.edu",
      "ja": "電話番号：310-822-1511 x153メール：ramos@isi.edu"
    },
    {
      "indent": 0,
      "text": "11. Full Copyright Statement",
      "section_title": true,
      "ja": "11.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}