{
  "title": {
    "text": "RFC 2302 - Tag Image File Format (TIFF) - image/tiff MIME Sub-type Registration",
    "ja": "RFC 2302 - タグ画像ファイル形式（TIFF）-画像/ tiff MIMEサブタイプ登録"
  },
  "number": 2302,
  "created_at": "2020-08-16 11:20:11.569994+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         G. Parsons\nRequest for Comments: 2302                              Northern Telecom\nCategory: Standards Track                                    J. Rafferty\n                                                    Human Communications\n                                                               S. Zilles\n                                                     Adobe Systems, Inc.\n                                                              March 1998",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "Tag Image File Format (TIFF) - image/tiff MIME Sub-type Registration",
      "ja": "タグ画像ファイル形式（TIFF）-画像/ tiff MIMEサブタイプ登録"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Overview",
      "ja": "概観"
    },
    {
      "indent": 3,
      "text": "This document describes the registration of the MIME sub-type image/tiff. The baseline encoding is defined by [TIFF].",
      "ja": "このドキュメントでは、MIMEサブタイプのimage / tiffの登録について説明します。ベースラインエンコーディングは[TIFF]によって定義されます。"
    },
    {
      "indent": 0,
      "text": "Internet Fax Working Group",
      "ja": "インターネットFAXワーキンググループ"
    },
    {
      "indent": 3,
      "text": "This document is a product of the IETF Internet Fax Working Group. All comments on this document should be forwarded to the email distribution list at <ietf-fax@imc.org>.",
      "ja": "このドキュメントは、IETF Internet Fax Working Groupの製品です。このドキュメントに関するすべてのコメントは、<ietf-fax@imc.org>の電子メール配布リストに転送する必要があります。"
    },
    {
      "indent": 0,
      "text": "1. Abstract",
      "section_title": true,
      "ja": "1. 概要"
    },
    {
      "indent": 3,
      "text": "This document describes the registration of the MIME sub-type image/tiff. The baseline encoding is defined by [TIFF]. This document refines an earlier sub-type registration in RFC 1528 [TPC.INT].",
      "ja": "このドキュメントでは、MIMEサブタイプのimage / tiffの登録について説明します。ベースラインエンコーディングは[TIFF]によって定義されます。このドキュメントでは、RFC 1528 [TPC.INT]の以前のサブタイプ登録を改良しています。"
    },
    {
      "indent": 0,
      "text": "2. TIFF Definition",
      "section_title": true,
      "ja": "2. TIFFの定義"
    },
    {
      "indent": 3,
      "text": "TIFF (Tag Image File Format) Revision 6.0 is defined in detail by Adobe in [TIFF]. The documentation can be obtained from Adobe at:",
      "ja": "TIFF（タグ画像ファイル形式）リビジョン6.0は、アドビによって[TIFF]で詳細に定義されています。ドキュメントはアドビから入手できます。"
    },
    {
      "indent": 5,
      "text": "Adobe Developers Association Adobe Systems Incorporated 345 Park Avenue San Jose, CA 95110-2704",
      "ja": "Adobe Developers Association Adob​​e Systems Incorporated 345 Park Avenue San Jose、CA 95110-2704"
    },
    {
      "indent": 5,
      "text": "Phone: +1-408-536-6000\nFax:   +1-408-537-6000",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "A copy of this specification can also be found in:\nftp://ftp.adobe.com/pub/adobe/devrelations/devtechnotes/pdffiles/\ntiff6.pdf",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "While a brief scope and feature description is provided in this section as background information, the reader is directed to the original TIFF specification [TIFF] to obtain complete feature and technical details.",
      "ja": "このセクションでは、背景情報として範囲と機能について簡単に説明しますが、完全な機能と技術的な詳細については、元のTIFF仕様[TIFF]を参照してください。"
    },
    {
      "indent": 1,
      "text": "2.1 TIFF Scope",
      "section_title": true,
      "ja": "2.1 TIFFスコープ"
    },
    {
      "indent": 3,
      "text": "TIFF describes image data that typically comes from scanners, frame grabbers, and paint- and photo-retouching programs. TIFF is not a printer language or page description language. The purpose of TIFF is to describe and store raster image data. A primary goal of TIFF is to provide a rich environment within which applications can exchange image data. This richness is required to take advantage of the varying capabilities of scanners and other imaging devices. Though TIFF is a rich format, it can easily be used for simple scanners and applications as well because the number of required fields is small.",
      "ja": "TIFFは、通常、スキャナー、フレームグラバー、ペイントおよび写真レタッチプログラムから取得される画像データを記述します。 TIFFは、プリンター言語またはページ記述言語ではありません。 TIFFの目的は、ラスターイメージデータを記述および格納することです。 TIFFの主な目的は、アプリケーションが画像データを交換できるリッチな環境を提供することです。この豊富さは、スキャナーやその他のイメージングデバイスのさまざまな機能を活用するために必要です。 TIFFはリッチなフォーマットですが、必要なフィールドの数が少ないため、単純なスキャナーやアプリケーションにも簡単に使用できます。"
    },
    {
      "indent": 0,
      "text": "2.2 TIFF Features",
      "section_title": true,
      "ja": "2.2 TIFFの機能"
    },
    {
      "indent": 3,
      "text": "Some of the features of TIFF (from [TIFF]) are:",
      "ja": "TIFFの機能の一部（[TIFF]から）："
    },
    {
      "indent": 4,
      "text": "- TIFF is capable of describing bilevel, grayscale, palette-color, and full-color image data in several color spaces.",
      "ja": "- TIFFは、バイレベル、グレースケール、パレットカラー、フルカラーの画像データをいくつかの色空間で記述することができます。"
    },
    {
      "indent": 4,
      "text": "- TIFF includes a number of compression schemes that allow developers to choose the best space or time tradeoff for their applications.",
      "ja": "- TIFFには、開発者がアプリケーションに最適な空間または時間のトレードオフを選択できるようにする多数の圧縮スキームが含まれています。"
    },
    {
      "indent": 4,
      "text": "- TIFF is designed to be extensible and to evolve gracefully as new needs arise.",
      "ja": "- TIFFは拡張可能で、新しいニーズが発生したときに優雅に進化するように設計されています。"
    },
    {
      "indent": 4,
      "text": "- TIFF allows the inclusion of an unlimited amount of private or special-purpose information.",
      "ja": "- TIFFでは、無制限の量の個人情報または特定目的の情報を含めることができます。"
    },
    {
      "indent": 0,
      "text": "3. MIME Definition",
      "section_title": true,
      "ja": "3. MIME定義"
    },
    {
      "indent": 0,
      "text": "3.1 image/tiff",
      "section_title": true,
      "ja": "3.1 画像/ティフ"
    },
    {
      "indent": 3,
      "text": "The image/tiff content-type was previously defined in RFC 1528 as containing TIFF 6.0 encoded image data, with specific reference made to a subset known as TIFF Class F. This document re-defines the original image/tiff definition to refer to all of the profiles and extensions that build on TIFF 6.0 [TIFF] encoded image data, consistent with existing practice for TIFF aware Internet applications. This definition is further enhanced by introducing the new \"application parameter\" (section 3.2) to enable identification of a specific subset of TIFF and TIFF extensions for the encoded image data.",
      "ja": "image / tiff content-typeは、TIFF 6.0エンコードされた画像データを含むものとして、RFC 1528で以前に定義され、TIFFクラスFと呼ばれるサブセットへの特定の参照が行われました。このドキュメントは、すべてを参照するために元の画像/ tiff定義を再定義しますTIFF 6.0 [TIFF]でエンコードされた画像データに基づいて構築されたプロファイルと拡張機能。これは、TIFF対応のインターネットアプリケーションの既存の慣行と一致しています。この定義は、新しい「アプリケーションパラメータ」（セクション3.2）を導入することでさらに強化され、エンコードされた画像データのTIFFおよびTIFF拡張の特定のサブセットを識別できるようになります。"
    },
    {
      "indent": 0,
      "text": "3.2 Application parameter",
      "section_title": true,
      "ja": "3.2 アプリケーションパラメータ"
    },
    {
      "indent": 3,
      "text": "There are cases where it may be useful to identify the application applicable to the content of an image/tiff body. Typically, this would be used to assist the recipient in dispatching a suitable rendering package to handle the display or processing of the image file. As a result, an optional \"application\" parameter is defined for image/tiff to identify a particular application's subset of TIFF and TIFF extensions for the encoded image data, if it is known. No values are defined in this document.",
      "ja": "image / tiff bodyのコンテンツに適用できるアプリケーションを特定することが役立つ場合があります。通常、これは、受信者が適切なレンダリングパッケージをディスパッチして画像ファイルの表示または処理を処理するのを支援するために使用されます。その結果、画像/ tiffのオプションの「アプリケーション」パラメーターが定義され、特定のアプリケーションのTIFFおよび既知の場合は、エンコードされた画像データのTIFF拡張のサブセットを識別します。このドキュメントでは値は定義されていません。"
    },
    {
      "indent": 3,
      "text": "Example using a fictional value 'foo':",
      "ja": "架空の値「foo」を使用した例："
    },
    {
      "indent": 17,
      "text": "Content-type: image/tiff; application=foo",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "There is no default value for application, as the absence of the application parameter indicates that the encoded TIFF image is Baseline TIFF or that it is not necessary to identify the application. It is up to the recipient's implementation to determine the application (if necessary) and render the image to the user.",
      "ja": "アプリケーションパラメータがない場合は、エンコードされたTIFF画像がベースラインTIFFであること、またはアプリケーションを識別する必要がないことを示すため、アプリケーションのデフォルト値はありません。アプリケーションを決定し（必要な場合）、イメージをユーザーにレンダリングするのは受信者の実装です。"
    },
    {
      "indent": 0,
      "text": "4. IANA Registration",
      "section_title": true,
      "ja": "4. IANA登録"
    },
    {
      "indent": 3,
      "text": "To: ietf-types@iana.org\nSubject: Registration of Standard MIME media type image/tiff",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "MIME media type name: image",
      "ja": "MIMEメディアタイプ名：画像"
    },
    {
      "indent": 3,
      "text": "MIME subtype name: tiff",
      "ja": "MIMEサブタイプ名：tiff"
    },
    {
      "indent": 0,
      "text": " Required parameters: none Optional parameters: application",
      "ja": "必須パラメーター：なしオプションパラメーター：アプリケーション"
    },
    {
      "indent": 6,
      "text": "There is no format specified for the value of this parameter in addition to that specified by [MIME1]. Various applications of TIFF may define values as required. New values should be defined in standards track RFCs and the values should be registered with IANA, using the registration form included in Appendix A. There is no default value for application, as the absence of the application parameter indicates that the encoded TIFF image is Baseline TIFF or that it is not necessary to identify the application. It is up to the implementation to determine the application (if necessary) and render the image to the user.",
      "ja": "このパラメーターの値には、[MIME1]で指定されている形式以外に、形式は指定されていません。 TIFFのさまざまなアプリケーションでは、必要に応じて値を定義できます。新しい値は標準トラックRFCで定義する必要があり、値は付録Aに含まれる登録フォームを使用してIANAに登録する必要があります。アプリケーションパラメータがない場合は、エンコードされたTIFF画像がベースラインであることを示すため、アプリケーションにデフォルト値はありません。 TIFFまたはアプリケーションを識別する必要はありません。アプリケーションを決定し（必要な場合）、イメージをユーザーにレンダリングするのは実装次第です。"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: Binary or Base-64 generally preferred",
      "ja": "エンコードに関する考慮事項：バイナリまたはBase-64が一般的に推奨されます"
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "ja": "セキュリティに関する考慮事項："
    },
    {
      "indent": 6,
      "text": "TIFF utilizes a structure which can store image data and attributes of this image data. The fields defined in the TIFF specification are of a descriptive nature and provide information that is useful to facilitate viewing and rendering of images by a recipient. As such, the fields currently defined in the TIFF specification do not in themselves create additional security risks, since the fields are not used to induce any particular behavior by the recipient application.",
      "ja": "TIFFは、画像データとこの画像データの属性を格納できる構造を利用しています。 TIFF仕様で定義されているフィールドは説明的な性質のものであり、受信者による画像の表示とレンダリングを容易にするのに役立つ情報を提供します。したがって、TIFF仕様で現在定義されているフィールドは、それ自体では追加のセキュリティリスクを引き起こしません。これは、フィールドが受信者アプリケーションによる特定の動作の誘導に使用されないためです。"
    },
    {
      "indent": 6,
      "text": "TIFF has an extensible structure, so that it is theoretically possible that fields could be defined in the future which could be used to induce particular actions on the part of the recipient, thus presenting additional security risks, but this type of capability is not supported in the referenced TIFF specification. Indeed, the definition of fields which would include such processing instructions is inconsistent with the goals and spirit of the TIFF specification.",
      "ja": "TIFFは拡張可能な構造を持っているため、受信者側で特定のアクションを誘発するために使用できるフィールドを将来的に定義でき、追加のセキュリティリスクをもたらす可能性がありますが、このタイプの機能はサポートされていません参照されるTIFF仕様。実際、そのような処理命令を含むフィールドの定義は、TIFF仕様の目標と精神と矛盾しています。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations:",
      "ja": "相互運用性に関する考慮事項："
    },
    {
      "indent": 0,
      "text": " The ability of implementations to handle all the defined applications (or profiles within applications) of TIFF may not be ubiquitous. As a result, implementations may decode and attempt to display the encoded TIFF image data only to determine that the image cannot be rendered. The presence of the application parameter may aid in allowing this determination before dispatching for rendering. However, it should be noted that the parameter value is not intended to convey levels of capabilities for a particular application.",
      "ja": "TIFFのすべての定義済みアプリケーション（またはアプリケーション内のプロファイル）を処理する実装の機能は、ユビキタスではない可能性があります。その結果、実装では、エンコードされたTIFF画像データをデコードして表示しようとするだけで、画像をレンダリングできないと判断できます。アプリケーションパラメータの存在は、レンダリングのためにディスパッチする前にこの決定を許可するのに役立ちます。ただし、パラメータ値は特定のアプリケーションの機能レベルを伝えることを目的としていないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Published specification:",
      "ja": "公開された仕様："
    },
    {
      "indent": 6,
      "text": "TIFF (Tag Image File Format) is defined in: TIFF (TM) Revision 6.0 - Final - June 3, 1992",
      "ja": "TIFF（タグ画像ファイル形式）は、TIFF（TM）リビジョン6.0-最終版-1992年6月3日で定義されています。"
    },
    {
      "indent": 6,
      "text": "Adobe Developers Association Adobe Systems Incorporated 345 Park Avenue San Jose, CA 95110-2704",
      "ja": "Adobe Developers Association Adob​​e Systems Incorporated 345 Park Avenue San Jose、CA 95110-2704"
    },
    {
      "indent": 6,
      "text": "Phone: +1-408-536-6000\nFax:   +1-408-537-6000",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "A copy of this specification can be found in:\nftp://ftp.adobe.com/pub/adobe/devrelations/devtechnotes/pdff\niles/tiff6.pdf",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Applications which use this media type:",
      "ja": "このメディアタイプを使用するアプリケーション："
    },
    {
      "indent": 6,
      "text": "Imaging, fax, messaging and multi-media",
      "ja": "イメージング、ファックス、メッセージング、マルチメディア"
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "ja": "追加情報："
    },
    {
      "indent": 6,
      "text": "Magic number(s):\n     II (little-endian):  49 49 42 00 hex\n     MM (big-endian):     4D 4D 00 42 hex\nFile extension(s): .TIF\nMacintosh File Type Code(s): TIFF",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "ja": "詳細について連絡する人とメールアドレス："
    },
    {
      "indent": 6,
      "text": "Glenn W. Parsons Glenn.Parsons@Nortel.ca",
      "ja": "Glenn W. Parsons Glenn.Parsons@Nortel.ca"
    },
    {
      "indent": 6,
      "text": "James Rafferty Jrafferty@worldnet.att.net",
      "ja": "James Rafferty Jrafferty@worldnet.att.net"
    },
    {
      "indent": 6,
      "text": "Stephen Zilles szilles@adobe.com",
      "ja": "スティーブン・ジルszilles@adobe.com"
    },
    {
      "indent": 6,
      "text": "Intended usage: COMMON",
      "ja": "使用目的：COMMON"
    },
    {
      "indent": 6,
      "text": "Change controller: Stephen Zilles",
      "ja": "コントローラーの変更：Stephen Zilles"
    },
    {
      "indent": 0,
      "text": "5. Authors' Addresses",
      "section_title": true,
      "ja": "5. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Glenn W. Parsons Northern Telecom P.O. Box 3511, Station C Ottawa, ON K1Y 4H7 Canada Phone: +1-613-763-7582 Fax: +1-613-763-2697 Email: Glenn.Parsons@Nortel.ca",
      "ja": "グレンW.パーソンズノーザンテレコムP.O. Box 3511、ステーションCオタワ、オンK1Y 4H7カナダ電話：+ 1-613-763-7582ファックス：+ 1-613-763-2697メール：Glenn.Parsons@Nortel.ca"
    },
    {
      "indent": 3,
      "text": "James Rafferty Human Communications 12 Kevin Drive Danbury, CT 06811-2901 USA Phone: +1-203-746-4367 Fax: +1-203-746-4367 Email: Jrafferty@worldnet.att.net",
      "ja": "James Rafferty Human Communications 12 Kevin Drive Danbury、CT 06811-2901 USA電話：+ 1-203-746-4367ファックス：+ 1-203-746-4367メール：Jrafferty@worldnet.att.net"
    },
    {
      "indent": 3,
      "text": "Stephen Zilles Adobe Systems Inc. Mailstop W14 345 Park Avenue San Jose, CA 95110-2704 USA Voice: +1-408-536-4766 Fax: +1-408-536-4042 Email: szilles@adobe.com",
      "ja": "Stephen Zilles Adob​​e Systems Inc. Mailstop W14 345 Park Avenue San Jose、CA 95110-2704 USA Voice：+ 1-408-536-4766 Fax：+ 1-408-536-4042 Email：szilles@adobe.com"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6. 参考文献"
    },
    {
      "indent": 3,
      "text": "[MIME1] Freed, N.  and N. Borenstein,  \"Multipurpose Internet Mail\n     Extensions (MIME) Part One: Format of Internet Message Bodies\",\n     RFC 2045, November 1996.\n[MIME4] Freed, N. and N. Borenstein,  \"Multipurpose Internet Mail\n     Extensions (MIME) Part Four: Registration Procedures\", RFC 2048,\n     November 1996.\n[TIFF] Adobe Developers Association, TIFF (TM) Revision 6.0 - Final,\n     June 3, 1992.\n[TPC.INT] Malamud, C. and M. Rose, \"Principles of Operation for the\n     TPC.INT Subdomain:  Remote Printing -- Technical Procedures\",\n     RFC 1528, October 1993.\n[TIFFPLUS] McIntyre, L., Zilles, S., Buckley, R., Venable, D.,\n     Parsons, G., and J. Rafferty, \"File Format for Internet Fax\",\n     RFC 2301, March 1998.\n[TIFF] Parsons, G., and J. Rafferty, \"Tag Image File Format\n     TIFF) -- R Profile for Facsimile, RFC 2306, March 1998.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Appendix A: IANA Registration form for new values of Application Parameter",
      "ja": "付録A：アプリケーションパラメータの新しい値のIANA登録フォーム"
    },
    {
      "indent": 3,
      "text": "To: IANA@isi.edu Subject: Registration of new values for the Application parameter of image/tiff",
      "ja": "宛先：IANA@isi.edu件名：image / tiffのApplicationパラメーターの新しい値の登録"
    },
    {
      "indent": 3,
      "text": "MIME type name:",
      "ja": "MIMEタイプ名："
    },
    {
      "indent": 3,
      "text": "image/tiff",
      "ja": "画像/ティフ"
    },
    {
      "indent": 3,
      "text": "Optional Parameter:",
      "ja": "オプションパラメータ："
    },
    {
      "indent": 3,
      "text": "Application",
      "ja": "応用"
    },
    {
      "indent": 3,
      "text": "New Value(s):",
      "ja": "新しい値："
    },
    {
      "indent": 3,
      "text": "Application=foo",
      "ja": "Application = foo"
    },
    {
      "indent": 3,
      "text": "Description of Use:",
      "ja": "使用の説明："
    },
    {
      "indent": 3,
      "text": "foo - (\"foo\" is a fictional new value used in this message as an example, it is to be replaced with the new value being registered. Include a short description of the use of the new value here. This must include reference to a standards track RFC for the complete description; the use of the value must be defined completely enough for independent implementation. )",
      "ja": "foo-（ \"foo\"は、このメッセージで例として使用されている架空の新しい値です。これは、登録されている新しい値に置き換えられます。新しい値の使用についての短い説明をここに含めてください。これには、標準は完全な記述のためにRFCを追跡します;値の使用は独立した実装のために十分に定義されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Security Considerations:",
      "ja": "セキュリティに関する考慮事項："
    },
    {
      "indent": 3,
      "text": "(Any additional security considerations that may be introduced by use of the new parameter should be defined here or in the referenced standards track RFC.)",
      "ja": "（新しいパラメーターの使用によって導入される可能性のある追加のセキュリティの考慮事項は、ここで、または参照される標準トラックRFCで定義する必要があります。）"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "ja": "詳細について連絡する人とメールアドレス："
    },
    {
      "indent": 3,
      "text": "(fill in contact information)",
      "ja": "（連絡先情報を記入してください）"
    },
    {
      "indent": 3,
      "text": "INFORMATION TO THE SUBMITTER:",
      "ja": "提出者への情報："
    },
    {
      "indent": 3,
      "text": "The accepted registrations will be listed in the \"Assigned Numbers\" series of RFCs. The information in the registration form is freely distributable.",
      "ja": "承認された登録は、RFCの「割り当てられた番号」シリーズにリストされます。登録フォームの情報は自由に配布できます。"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントとその翻訳はコピーして他のユーザーに提供することができ、コメントまたはその他の方法で説明したり、その実装を支援する二次的著作物は、いかなる種類の制限なしに、全体または一部を準備、コピー、公開、および配布することができますただし、上記の著作権表示とこの段落は、そのようなすべてのコピーと派生物に含まれています。ただし、このドキュメント自体は、著作権に関する通知を削除したり、インターネットソサエティや他のインターネット組織への参照を削除したりするなど、いかなる方法でも変更できません。ただし、インターネット標準を開発する目的で必要な場合は除きます。インターネット標準のプロセスに従うか、または必要に応じて、それを英語以外の言語に翻訳する必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記で付与された制限付きのアクセス許可は永続的であり、インターネットソサエティまたはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は「現状有姿」で提供され、インターネット社会およびインターネット技術タスクフォースは、明示または黙示を問わず、ここに記載されている情報の使用が保証するものに限定されない一切の保証を含みません。商品性または特定の目的への適合性に関する権利または黙示の保証を侵害すること。"
    }
  ]
}