{
  "title": {
    "text": "RFC 2782 - A DNS RR for specifying the location of services (DNS SRV)",
    "ja": "RFC 2782 - サービスの位置を特定するためのDNS RR（DNSのSRV）"
  },
  "number": 2782,
  "created_at": "2019-10-30 04:10:29.223748+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     A. Gulbrandsen\nRequest for Comments: 2782                            Troll Technologies\nObsoletes: 2052                                                 P. Vixie\nCategory: Standards Track                   Internet Software Consortium\n                                                               L. Esibov\n                                                         Microsoft Corp.\n                                                           February 2000",
      "raw": true
    },
    {
      "indent": 7,
      "text": "A DNS RR for specifying the location of services (DNS SRV)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a DNS RR which specifies the location of the server(s) for a specific protocol and domain.",
      "ja": "この文書は、特定のプロトコルおよびドメインのサーバ（複数可）の位置を指定するDNS RRを記述する。"
    },
    {
      "indent": 0,
      "text": "Overview and rationale",
      "ja": "概要と根拠"
    },
    {
      "indent": 3,
      "text": "Currently, one must either know the exact address of a server to contact it, or broadcast a question.",
      "ja": "現在、人はそれを連絡するサーバーの正確なアドレスを知っている、または質問をブロードキャストする必要があります。"
    },
    {
      "indent": 3,
      "text": "The SRV RR allows administrators to use several servers for a single domain, to move services from host to host with little fuss, and to designate some hosts as primary servers for a service and others as backups.",
      "ja": "SRV RRは、管理者が少しの手間でホストするために、およびバックアップなどのサービスと他人のためにプライマリサーバとして、いくつかのホストを指定するホストからのサービスを移動するために、単一のドメインに対して複数のサーバーを使用することができます。"
    },
    {
      "indent": 3,
      "text": "Clients ask for a specific service/protocol for a specific domain (the word domain is used here in the strict RFC 1034 sense), and get back the names of any available servers.",
      "ja": "クライアントは、特定のドメインのための特定のサービス/プロトコル（ワードドメインは、厳密なRFC 1034意味で使用されている）を求めると、使用可能な任意のサーバーの名前を取り戻します。"
    },
    {
      "indent": 3,
      "text": "Note that where this document refers to \"address records\", it means A RR's, AAAA RR's, or their most modern equivalent.",
      "ja": "この文書は「アドレスレコード」を指し、それはRRの、AAAA RRの、または彼らの最も近代的な同等のものを意味することに注意してください。"
    },
    {
      "indent": 0,
      "text": "Definitions",
      "ja": "定義"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"SHOULD\", \"SHOULD NOT\" and \"MAY\" used in this document are to be interpreted as specified in [BCP 14]. Other terms used in this document are defined in the DNS specification, RFC 1034.",
      "ja": "、、および本書で使用される「場合がある」、「SHOULD NOTは」「べきである」「してはいけません」のキーワード「MUST」は、[BCP 14]で指定されるように解釈されるべきです。この文書で使用される他の用語は、DNSの仕様、RFC 1034で定義されています。"
    },
    {
      "indent": 0,
      "text": "Applicability Statement",
      "ja": "適用性に関する声明"
    },
    {
      "indent": 3,
      "text": "In general, it is expected that SRV records will be used by clients for applications where the relevant protocol specification indicates that clients should use the SRV record. Such specification MUST define the symbolic name to be used in the Service field of the SRV record as described below. It also MUST include security considerations. Service SRV records SHOULD NOT be used in the absence of such specification.",
      "ja": "一般的には、SRVレコードは、関連するプロトコル仕様は、クライアントがSRVレコードを使用する必要があることを示しているアプリケーションのためにクライアントによって使用されることが期待されます。そのような仕様は、以下に説明するようにSRVレコードのサービスの分野で使用される記号名を定義しなければなりません。また、セキュリティ上の考慮事項を含まなければなりません。サービスSRVレコードは、そのような仕様が存在しない場合には使用すべきではありません。"
    },
    {
      "indent": 0,
      "text": "Introductory example",
      "ja": "入門例"
    },
    {
      "indent": 3,
      "text": "If a SRV-cognizant LDAP client wants to discover a LDAP server that supports TCP protocol and provides LDAP service for the domain example.com., it does a lookup of",
      "ja": "SRV-認識し、LDAPクライアントは、TCPプロトコルをサポートし、ドメインexample.comのためのLDAPサービスを提供します。LDAPサーバーを検出したい場合、それはのルックアップを行い"
    },
    {
      "indent": 6,
      "text": "_ldap._tcp.example.com",
      "ja": "＿ｌだｐ。＿ｔｃｐ。えぁｍｐぇ。こｍ"
    },
    {
      "indent": 3,
      "text": "as described in [ARM]. The example zone file near the end of this memo contains answering RRs for an SRV query.",
      "ja": "[ARM]に記載されているように。このメモの終わり近く例ゾーンファイルは、SRVクエリのRRを答える含まれています。"
    },
    {
      "indent": 3,
      "text": "Note: LDAP is chosen as an example for illustrative purposes only, and the LDAP examples used in this document should not be considered a definitive statement on the recommended way for LDAP to use SRV records. As described in the earlier applicability section, consult the appropriate LDAP documents for the recommended procedures.",
      "ja": "注：LDAPは、説明のみを目的のための例として選択され、そしてこのドキュメントで使用されるLDAPの例は、LDAPは、SRVレコードを使用するための推奨方法に決定的な声明を考えるべきではありません。以前の適用のセクションで説明したように、推奨手順については、適切なLDAP文書を参照してください。"
    },
    {
      "indent": 0,
      "text": "The format of the SRV RR",
      "ja": "SRV RRの形式"
    },
    {
      "indent": 3,
      "text": "Here is the format of the SRV RR, whose DNS type code is 33:",
      "ja": "ここでDNSタイプコードが33であるのSRV RRの形式は次のとおりです。"
    },
    {
      "indent": 8,
      "text": "_Service._Proto.Name TTL Class SRV Priority Weight Port Target",
      "ja": "_Service._Proto.Name TTLクラスSRV優先重ポートターゲット"
    },
    {
      "indent": 8,
      "text": "(There is an example near the end of this document.)",
      "ja": "（この文書の終わり近くに例があります。）"
    },
    {
      "indent": 3,
      "text": "Service The symbolic name of the desired service, as defined in Assigned Numbers [STD 2] or locally. An underscore (_) is prepended to the service identifier to avoid collisions with DNS labels that occur in nature.",
      "ja": "ローカルに割り当てられた番号で定義されるように、所望のサービスのシンボル名をサービス[STD 2]または。アンダースコア（_）は、自然界に存在DNSラベルとの衝突を避けるために、サービス識別子の前に付加されます。"
    },
    {
      "indent": 8,
      "text": "Some widely used services, notably POP, don't have a single\nuniversal name.  If Assigned Numbers names the service\nindicated, that name is the only name which is legal for SRV\nlookups.  The Service is case insensitive.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Proto The symbolic name of the desired protocol, with an underscore (_) prepended to prevent collisions with DNS labels that occur in nature. _TCP and _UDP are at present the most useful values for this field, though any name defined by Assigned Numbers or locally may be used (as for Service). The Proto is case insensitive.",
      "ja": "下線（_）を有するプロト所望のプロトコルの記号名は、天然に存在DNSラベルとの衝突を防止するために付加しました。任意の名前が割り当てられた番号によって定義されるか、または局所的に（サービスのように）使用されてもよい_tcpおよび_udpは、現在このフィールドのための最も有用な値です。プロトは大文字と小文字を区別しません。"
    },
    {
      "indent": 3,
      "text": "Name The domain this RR refers to. The SRV RR is unique in that the name one searches for is not this name; the example near the end shows this clearly.",
      "ja": "このRRが参照するドメインの名前を指定します。この名前ではないためにSRV RRはその名1件の検索でユニークです。終了間際の例では、これを明確に示しています。"
    },
    {
      "indent": 3,
      "text": "TTL Standard DNS meaning [RFC 1035].",
      "ja": "TTL標準DNSの意味[RFC 1035]。"
    },
    {
      "indent": 3,
      "text": "Class Standard DNS meaning [RFC 1035]. SRV records occur in the IN Class.",
      "ja": "クラスの標準DNSの意味[RFC 1035]。 SRVレコードは、INクラスで発生します。"
    },
    {
      "indent": 3,
      "text": "Priority The priority of this target host. A client MUST attempt to contact the target host with the lowest-numbered priority it can reach; target hosts with the same priority SHOULD be tried in an order defined by the weight field. The range is 0-65535. This is a 16 bit unsigned integer in network byte order.",
      "ja": "優先順位このターゲットホストの優先順位。クライアントは、それが到達できる最も低い番号を優先的にターゲットホストに連絡しようとしなければなりません。同じ優先度を持つターゲットホストは、体重フィールドによって定義された順序で試行されてください。範囲は0〜65535です。これは、ネットワークバイト順で16ビットの符号なし整数です。"
    },
    {
      "indent": 3,
      "text": "Weight A server selection mechanism. The weight field specifies a relative weight for entries with the same priority. Larger weights SHOULD be given a proportionately higher probability of being selected. The range of this number is 0-65535. This is a 16 bit unsigned integer in network byte order. Domain administrators SHOULD use Weight 0 when there isn't any server selection to do, to make the RR easier to read for humans (less noisy). In the presence of records containing weights greater than 0, records with weight 0 should have a very small chance of being selected.",
      "ja": "体重サーバ選択機構。重みフィールドは、同じ優先順位を持つエントリの相対的な重みを指定します。より大きな重みが選択されているのに比例してより高い確率を与えられるべきです。この番号の範囲は0〜65535です。これは、ネットワークバイト順で16ビットの符号なし整数です。行うには、任意のサーバーの選択がない場合、ドメイン管理者は、（ノイズの少ない）人のために読むためにRRを容易にするために、重み0を使用すべきです。 0より大きい重みを含むレコードの存在下で、重量が0のレコードが選択されるの非常に小さなチャンスを有するべきです。"
    },
    {
      "indent": 8,
      "text": "In the absence of a protocol whose specification calls for the\nuse of other weighting information, a client arranges the SRV\nRRs of the same Priority in the order in which target hosts, specified by the SRV RRs, will be contacted. The following\nalgorithm SHOULD be used to order the SRV RRs of the same\npriority:",
      "raw": true
    },
    {
      "indent": 8,
      "text": "To select a target to be contacted next, arrange all SRV RRs (that have not been ordered yet) in any order, except that all those with weight 0 are placed at the beginning of the list.",
      "ja": "次の連絡をする対象を選択するには、任意の順序で（まだ注文されていない）すべてのSRV RRを手配重量0でそのすべてのものをリストの先頭に配置されている除きます。"
    },
    {
      "indent": 8,
      "text": "Compute the sum of the weights of those RRs, and with each RR associate the running sum in the selected order. Then choose a uniform random number between 0 and the sum computed (inclusive), and select the RR whose running sum value is the first in the selected order which is greater than or equal to the random number selected. The target host specified in the selected SRV RR is the next one to be contacted by the client. Remove this SRV RR from the set of the unordered SRV RRs and apply the described algorithm to the unordered SRV RRs to select the next target host. Continue the ordering process until there are no unordered SRV RRs. This process is repeated for each Priority.",
      "ja": "これらのRRの重みの和を計算し、各RRと選択された順序で実行されている合計を関連付けます。次いで0和計算（両端を含む）の間で一様乱数を選択し、その実行中の合計値よりも大きいか、または選択された乱数と等しい選択された順序で最初にRRを選択します。選択したSRV RRで指定されたターゲットホストは、クライアントから連絡される次の1です。順不同のSRV RRのセットからこのSRV RRを削除し、次のターゲットホストを選択するために、順不同のSRV RRのに説明したアルゴリズムを適用します。いないSRVのRRがなくなるまで、注文プロセスを続行します。このプロセスは、優先度毎に繰り返されます。"
    },
    {
      "indent": 3,
      "text": "Port The port on this target host of this service. The range is 0- 65535. This is a 16 bit unsigned integer in network byte order. This is often as specified in Assigned Numbers but need not be.",
      "ja": "ポートこのサービスのこのターゲットホスト上のポート。範囲は、これはネットワークバイト順に16ビットの符号なし整数であり、0〜65535です。これは、割り当てられた番号に指定されていることが多いですが、である必要はありません。"
    },
    {
      "indent": 3,
      "text": "Target The domain name of the target host. There MUST be one or more address records for this name, the name MUST NOT be an alias (in the sense of RFC 1034 or RFC 2181). Implementors are urged, but not required, to return the address record(s) in the Additional Data section. Unless and until permitted by future standards action, name compression is not to be used for this field.",
      "ja": "ターゲットホストのドメイン名を対象としています。この名前のための1つまたは複数のアドレスレコードが存在しなければならず、名前は（RFC 1034やRFC 2181の意味での）エイリアスにすることはできません。実装者は、追加データセクションにアドレスレコード（複数可）を返すように、促したが、必須ではありません。ないと将来の規格の作用によって許可されるまで、名前圧縮は、この分野で使用されるものではありません。"
    },
    {
      "indent": 8,
      "text": "A Target of \".\" means that the service is decidedly not\navailable at this domain.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Domain administrator advice",
      "ja": "ドメイン管理者のアドバイス"
    },
    {
      "indent": 3,
      "text": "Expecting everyone to update their client applications when the first server publishes a SRV RR is futile (even if desirable). Therefore SRV would have to coexist with address record lookups for existing protocols, and DNS administrators should try to provide address records to support old clients:",
      "ja": "最初のサーバがSRV RRを発行したときに誰もが自分のクライアントアプリケーションを更新するために期待すること（望ましくさえあれば）無益です。したがって、SRVは、既存のプロトコルのためのアドレスレコードの検索と共存しなければならない、とDNS管理者は、古いクライアントをサポートするためにアドレスレコードを提供しようとする必要があります。"
    },
    {
      "indent": 6,
      "text": "- Where the services for a single domain are spread over several hosts, it seems advisable to have a list of address records at the same DNS node as the SRV RR, listing reasonable (if perhaps suboptimal) fallback hosts for Telnet, NNTP and other protocols likely to be used with this name. Note that some programs only try the first address they get back from e.g. gethostbyname(), and we don't know how widespread this behavior is.",
      "ja": " - 単一ドメインのためのサービスが複数のホストに広がっている場合は、Telnet、NNTPおよび他のプロトコルのための（おそらく、次善の場合）合理的な代替ホストをリスト、SRVのRRと同じDNSノードにアドレスレコードのリストを持っていることをお勧めらしいですこの名前で使用される可能性が高いです。いくつかのプログラムは、彼らだけが、例えばから取り戻す最初のアドレスを試すことに注意してくださいgethostbyname（）、そして私たちは、この動作がどのように広まっ知りません。"
    },
    {
      "indent": 6,
      "text": "- Where one service is provided by several hosts, one can either provide address records for all the hosts (in which case the round-robin mechanism, where available, will share the load equally) or just for one (presumably the fastest).",
      "ja": " - 一つのサービスが複数のホストによって提供される場合、一方は（ラウンドロビン機構は、利用可能な、均等に負荷を共有している場合）、すべてのホストのアドレスレコードを提供するか、または単にのための1つの（おそらく最も速いです）。"
    },
    {
      "indent": 6,
      "text": "- If a host is intended to provide a service only when the main server(s) is/are down, it probably shouldn't be listed in address records.",
      "ja": " - ホストがメインサーバ（複数可）/ダウンしているときにのみサービスを提供することを意図している場合、それはおそらくアドレスレコードに記載されているべきではありません。"
    },
    {
      "indent": 6,
      "text": "- Hosts that are referenced by backup address records must use the port number specified in Assigned Numbers for the service.",
      "ja": " - バックアップアドレスレコードによって参照されているホストはサービスのために割り当てられた番号で指定したポート番号を使用する必要があります。"
    },
    {
      "indent": 6,
      "text": "- Designers of future protocols for which \"secondary servers\" is not useful (or meaningful) may choose to not use SRV's support for secondary servers. Clients for such protocols may use or ignore SRV RRs with Priority higher than the RR with the lowest Priority for a domain.",
      "ja": " - 「セカンダリサーバは」有用な（または意味のある）されていないため、将来のプロトコルの設計者は、セカンダリサーバのためのSRVのサポートを使用しないことを選択できます。そのようなプロトコルのためのクライアントは、ドメインの最も優先度の低いRRよりも高い優先順位を持つSRVのRRを使用するか、無視することがあります。"
    },
    {
      "indent": 3,
      "text": "Currently there's a practical limit of 512 bytes for DNS replies. Until all resolvers can handle larger responses, domain administrators are strongly advised to keep their SRV replies below 512 bytes.",
      "ja": "現在、DNS応答のための512バイトの実用上の制限があります。すべてのリゾルバがより大きな応答を処理できるようになるまで、ドメイン管理者は強く、512バイト以下の彼らのSRV応答を維持することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "All round numbers, wrote Dr. Johnson, are false, and these numbers are very round: A reply packet has a 30-byte overhead plus the name of the service (\"_ldap._tcp.example.com\" for instance); each SRV RR adds 20 bytes plus the name of the target host; each NS RR in the NS section is 15 bytes plus the name of the name server host; and finally each A RR in the additional data section is 20 bytes or so, and there are A's for each SRV and NS RR mentioned in the answer. This size estimate is extremely crude, but shouldn't underestimate the actual answer size by much. If an answer may be close to the limit, using a DNS query tool (e.g. \"dig\") to look at the actual answer is a good idea.",
      "ja": "すべてのラウンドの数字は、ジョンソン博士が書いた、偽であり、これらの数字は非常に丸いです：応答パケットは、30バイトのオーバーヘッドを加えた（例えば「_ldap._tcp.example.com」）サービスの名前を持っています。各SRV RRは20バイトを加えたターゲット・ホストの名前を追加します。 NSセクションの各NS RRは15のバイトとネームサーバのホスト名です。そして最後に、追加のデータセクション内の各A RRは20バイト程度である、との回答で述べた各SRVとNSのRRのためのがあります。このサイズ推定値は極めて粗製のですが、ずっとによって、実際の答えの大きさを過小評価してはいけません。答えは、実際の答えを見てDNSクエリツール（例えば「DIG」）を使用して、限界に近いかもしれない場合は良いアイデアです。"
    },
    {
      "indent": 0,
      "text": "The \"Weight\" field",
      "ja": "「ウェイト」フィールド"
    },
    {
      "indent": 3,
      "text": "Weight, the server selection field, is not quite satisfactory, but the actual load on typical servers changes much too quickly to be kept around in DNS caches. It seems to the authors that offering administrators a way to say \"this machine is three times as fast as that one\" is the best that can practically be done.",
      "ja": "体重、サーバ選択フィールドは、非常に満足のいくものではないが、典型的なサーバー上の実際の負荷は、DNSキャッシュの中を維持することがあまりにも急速に変化します。これにより、管理者は、実質的に行うことができるよう最善である「このマシンは、早くその1として3倍である」と言うための方法を提供することを筆者には思えます。"
    },
    {
      "indent": 3,
      "text": "The only way the authors can see of getting a \"better\" load figure is asking a separate server when the client selects a server and contacts it. For short-lived services an extra step in the connection establishment seems too expensive, and for long-lived services, the load figure may well be thrown off a minute after the connection is established when someone else starts or finishes a heavy job.",
      "ja": "クライアントがサーバーとの連絡先を選択したときに著者は、「より良い」ロード・フィギュアを得るための見ることができる唯一の方法は、別のサーバーを求めています。短命サービスの場合、接続の確立中に余分なステップは、あまりにも高価と思われる、との接続が確立された後に他の誰かが始まるや重い仕事を終えると長寿命のサービスのため、負荷のフィギュアはよく分をオフにスローされる可能性があります。"
    },
    {
      "indent": 3,
      "text": "Note: There are currently various experiments at providing relative network proximity estimation, available bandwidth estimation, and similar services. Use of the SRV record with such facilities, and in particular the interpretation of the Weight field when these facilities are used, is for further study. Weight is only intended for static, not dynamic, server selection. Using SRV weight for dynamic server selection would require assigning unreasonably short TTLs to the SRV RRs, which would limit the usefulness of the DNS caching mechanism, thus increasing overall network load and decreasing overall reliability. Server selection via SRV is only intended to express static information such as \"this server has a faster CPU than that one\" or \"this server has a much better network connection than that one\".",
      "ja": "注意：様々な実験は、相対的なネットワーク近接推定、利用可能な帯域幅推定、および同様のサービスを提供することを現在ありません。このような施設でのSRVレコードの使用、特に、これらの施設が使用されているWeightフィールドの解釈は、今後の検討課題です。重量が唯一の静的、動的ではない、サーバー選択のために意図されます。動的サーバ選択のためのSRV重みを使用すると、このようにして、ネットワーク全体の負荷を増加させ、全体的な信頼性を低下させる、DNSキャッシング機構の有用性を制限するのSRV RRを、不当に短いTTLを割り当てる必要とするであろう。 SRVを介してサーバの選択は、のみ、または「このサーバはそれよりもはるかに優れたネットワーク接続を持っている」「このサーバは、1つのより速いCPUを持っている」などの静的な情報を表現することを意図しています。"
    },
    {
      "indent": 0,
      "text": "The Port number",
      "ja": "ポート番号"
    },
    {
      "indent": 3,
      "text": "Currently, the translation from service name to port number happens at the client, often using a file such as /etc/services.",
      "ja": "現在、サービス名からポート番号への変換は、多くの場合、/ etc / servicesのようファイルを使用して、クライアントで発生します。"
    },
    {
      "indent": 3,
      "text": "Moving this information to the DNS makes it less necessary to update these files on every single computer of the net every time a new service is added, and makes it possible to move standard services out of the \"root-only\" port range on unix.",
      "ja": "DNSにこの情報を移動すると、ネットのすべての単一のコンピュータに新しいサービスが追加されるたびにこれらのファイルを更新することはあまり必要になり、それが可能なUNIX上の「ルートのみの」ポート範囲外の標準サービスを移動することができます。"
    },
    {
      "indent": 0,
      "text": "Usage rules",
      "ja": "使用規則"
    },
    {
      "indent": 3,
      "text": "A SRV-cognizant client SHOULD use this procedure to locate a list of servers and connect to the preferred one:",
      "ja": "SRV-認識し、クライアントは、サーバのリストを探し、好ましいものに接続するには、この手順を使用する必要があります。"
    },
    {
      "indent": 8,
      "text": "Do a lookup for QNAME=_service._protocol.target, QCLASS=IN,\nQTYPE=SRV.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "If the reply is NOERROR, ANCOUNT>0 and there is at least one SRV RR which specifies the requested Service and Protocol in the reply:",
      "ja": "返事はNOERROR、ANCOUNT> 0であると回答して要求されたサービスとプロトコルを指定する少なくとも一つのSRV RRが存在する場合："
    },
    {
      "indent": 12,
      "text": "If there is precisely one SRV RR, and its Target is \".\"\n(the root domain), abort.",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Else, for all such RR's, build a list of (Priority, Weight, Target) tuples",
      "ja": "そうでなければ、このようなすべてのRRのために、（優先度、体重、目標）タプルのリストを構築"
    },
    {
      "indent": 12,
      "text": "Sort the list by priority (lowest number first)",
      "ja": "優先度（第一最低数）によってリストをソート"
    },
    {
      "indent": 12,
      "text": "Create a new empty list",
      "ja": "新しい空のリストを作成します。"
    },
    {
      "indent": 12,
      "text": "For each distinct priority level While there are still elements left at this priority level",
      "ja": "各個別の優先度レベルのために、この優先レベルで左の要素が残っているものの"
    },
    {
      "indent": 20,
      "text": "Select an element as specified above, in the\ndescription of Weight in \"The format of the SRV\nRR\" Section, and move it to the tail of the new\nlist",
      "raw": true
    },
    {
      "indent": 12,
      "text": "For each element in the new list",
      "ja": "新しいリストの各要素について"
    },
    {
      "indent": 16,
      "text": "query the DNS for address records for the Target or\nuse any such records found in the Additional Data\nsection of the earlier SRV response.",
      "raw": true
    },
    {
      "indent": 15,
      "text": " for each address record found, try to connect to the (protocol, address, service).",
      "ja": "見つかったそれぞれのアドレスレコードのために、（プロトコル、アドレス、サービス）に接続しよう。"
    },
    {
      "indent": 8,
      "text": "else",
      "ja": "他"
    },
    {
      "indent": 12,
      "text": "Do a lookup for QNAME=target, QCLASS=IN, QTYPE=A",
      "ja": "QNAME =ターゲットのルックアップ、QCLASS =では、QTYPE = Aを実行します。"
    },
    {
      "indent": 11,
      "text": " for each address record found, try to connect to the (protocol, address, service)",
      "ja": "見つかったそれぞれのアドレスレコードのために、（プロトコル、アドレス、サービス）に接続しよう"
    },
    {
      "indent": 0,
      "text": "Notes:",
      "ja": "ノート："
    },
    {
      "indent": 3,
      "text": "- Port numbers SHOULD NOT be used in place of the symbolic service or protocol names (for the same reason why variant names cannot be allowed: Applications would have to do two or more lookups).",
      "ja": " - （バリアント名は許可されない理由と同じ理由のために：アプリケーションは、2件の以上の検索を行う必要があります）ポート番号は、シンボリックサービスまたはプロトコル名の代わりに使用されるべきではありません。"
    },
    {
      "indent": 3,
      "text": "- If a truncated response comes back from an SRV query, the rules described in [RFC 2181] shall apply.",
      "ja": " - 切り捨て応答がSRVクエリーから戻ってきた場合は、[RFC 2181]で説明されたルールを適用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "- A client MUST parse all of the RR's in the reply.",
      "ja": " - クライアントは、応答でRRの全てを解析する必要があります。"
    },
    {
      "indent": 3,
      "text": "- If the Additional Data section doesn't contain address records for all the SRV RR's and the client may want to connect to the target host(s) involved, the client MUST look up the address record(s). (This happens quite often when the address record has shorter TTL than the SRV or NS RR's.)",
      "ja": " - 追加データセクションには、すべてのSRV RRのためのアドレスレコードが含まれていないと、クライアントがターゲットホスト（複数可）関与に接続する可能性がある場合は、クライアントがアドレスレコード（複数可）をルックアップする必要があります。 （アドレスレコードは、SRVかNS RR年代より短いTTLを持っているとき、これはかなり頻繁に発生します。）"
    },
    {
      "indent": 3,
      "text": "- Future protocols could be designed to use SRV RR lookups as the means by which clients locate their servers.",
      "ja": " - 今後のプロトコルは、クライアントがサーバーを検索する手段としてSRV RRの検索を使用するように設計することができます。"
    },
    {
      "indent": 0,
      "text": "Fictional example",
      "ja": "架空の例"
    },
    {
      "indent": 3,
      "text": "This example uses fictional service \"foobar\" as an aid in understanding SRV records. If ever service \"foobar\" is implemented, it is not intended that it will necessarily use SRV records. This is (part of) the zone file for example.com, a still-unused domain:",
      "ja": "この例では、SRVレコードを理解する上で助けとして架空のサービス「foobarに」を使用しています。これまでサービス「foobarには」実装されている場合は、必ずしもSRVレコードを使用することを意図するものではありません。これは、example.comのゾーンファイル（の一部）、まだ未使用のドメインです。"
    },
    {
      "indent": 6,
      "text": "$ORIGIN example.com. @ SOA server.example.com. root.example.com. ( 1995032001 3600 3600 604800 86400 ) NS server.example.com. NS ns1.ip-provider.net. NS ns2.ip-provider.net. ; foobar - use old-slow-box or new-fast-box if either is ; available, make three quarters of the logins go to ; new-fast-box. _foobar._tcp SRV 0 1 9 old-slow-box.example.com. SRV 0 3 9 new-fast-box.example.com. ; if neither old-slow-box or new-fast-box is up, switch to ; using the sysdmin's box and the server SRV 1 0 9 sysadmins-box.example.com. SRV 1 0 9 server.example.com. server A 172.30.79.10 old-slow-box A 172.30.79.11 sysadmins-box A 172.30.79.12 new-fast-box A 172.30.79.13 ; NO other services are supported *._tcp SRV 0 0 0 . *._udp SRV 0 0 0 .",
      "ja": "$ ORIGIN example.comの。 @ SOA server.example.com。 root.example.com。 （1995032001 3600 3600 604800 86400）NS server.example.com。 NS ns1.ip-provider.net。 NS ns2.ip-provider.net。 ; foob​​arには - のいずれかである場合には古い遅い箱か、新しい高速-ボックスを使用します。利用可能に行くログインの四分の三を作ります。新高速ボックス。 _foobar._tcpのSRV 0 1~9 old-slow-box.example.com。 SRV 0 3 9 new-fast-box.example.com。 ;どちらも古い遅い箱か、新しい高速・ボックスがアップしている場合、に切り替えます。 sysdminのボックスとサーバSRV 1 0 9 sysadmins-box.example.comを使用。 SRV 1 0 9 server.example.com。サーバー172.30.79.10古い遅い箱A 172.30.79.11 172.30.79.12新しい高速-ボックスA 172.30.79.13をシステム管理者-BOX。他のサービスでは、TCP SRV 0 0 0 * ._サポートされていません。 * ._ UDP SRV 0 0 0。"
    },
    {
      "indent": 3,
      "text": "In this example, a client of the \"foobar\" service in the \"example.com.\" domain needs an SRV lookup of \"_foobar._tcp.example.com.\" and possibly A lookups of \"new-fast-box.example.com.\" and/or the other hosts named. The size of the SRV reply is approximately 365 bytes:",
      "ja": "この例では、中に「foobarの」サービスのクライアント「example.com。」ドメインは、のSRVルックアップ必要「_foobar._tcp.example.comを。」 「new-fast-box.example.com。」と、おそらく検索および/または他のホストは、指定されました。 SRV応答のサイズは約365バイトです。"
    },
    {
      "indent": 6,
      "text": "30 bytes general overhead 20 bytes for the query string, \"_foobar._tcp.example.com.\" 130 bytes for 4 SRV RR's, 20 bytes each plus the lengths of \"new-fast-box\", \"old-slow-box\", \"server\" and \"sysadmins-box\" - \"example.com\" in the query section is quoted here and doesn't need to be counted again. 75 bytes for 3 NS RRs, 15 bytes each plus the lengths of \"server\", \"ns1.ip-provider.net.\" and \"ns2\" - again, \"ip-provider.net.\" is quoted and only needs to be counted once. 120 bytes for the 6 address records (assuming IPv4 only) mentioned by the SRV and NS RR's.",
      "ja": "クエリ文字列のための一般的な30バイトのオーバーヘッド20バイト「_foobar._tcp.example.com。」 4 SRV RRさん、20バイトの各プラス「新高速ボックス」の長さは130バイトで、「古いスローボックス」、「サーバ」および「システム管理者・ボックス」 - クエリ]セクションで、「example.com」でありますここに引用して、再びカウントする必要はありません。 3つのNS資源レコードのための75バイト、15バイト毎プラス「サーバ」の長さは、「ns1.ip-provider.net。」そして \"NS2\"  - 再び、 \"ip-provider.net。\"引用された一度だけカウントされる必要があります。 SRVとNS RR用の言及（IPv4のみを想定）6アドレスレコードの120バイト。"
    },
    {
      "indent": 0,
      "text": "IANA Considerations",
      "ja": "IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IANA has assigned RR type value 33 to the SRV RR. No other IANA services are required by this document.",
      "ja": "IANAは、SRV RRにRRタイプ値33が割り当てられています。他のIANAサービスは、この文書で必要ありません。"
    },
    {
      "indent": 0,
      "text": "Changes from RFC 2052",
      "ja": "RFC 2052からの変更点"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 2052. The major change from that previous, experimental, version of this specification is that now the protocol and service labels are prepended with an underscore, to lower the probability of an accidental clash with a similar name used for unrelated purposes. Aside from that, changes are only intended to increase the clarity and completeness of the document. This document especially clarifies the use of the Weight field of the SRV records.",
      "ja": "この文書は、この仕様のそれ以前の、実験、バージョンからの主な変更は、現在のプロトコルおよびサービスラベルは無関係な目的で使用される類似した名前で、偶発的衝突の確率を下げるために、前にアンダースコアを付けていることであるRFC 2052を廃止します。それはさておき、変更は文書のみの明快さと完成度を高めることを意図しています。この文書では、特にSRVレコードの重みフィールドの使用を明確にしています。"
    },
    {
      "indent": 0,
      "text": "Security Considerations",
      "ja": "セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The authors believe this RR to not cause any new security problems. Some problems become more visible, though.",
      "ja": "著者は、このRRはどんな新しいセキュリティ問題を引き起こしていないと信じています。いくつかの問題は、しかし、より多くの目に見えるようになります。"
    },
    {
      "indent": 3,
      "text": "- The ability to specify ports on a fine-grained basis obviously changes how a router can filter packets. It becomes impossible to block internal clients from accessing specific external services, slightly harder to block internal users from running unauthorized services, and more important for the router operations and DNS operations personnel to cooperate.",
      "ja": " - きめ細かい基づいてポートを指定する機能は、明らかに、ルータがパケットをフィルタリングする方法を変更します。ルータの操作とDNSの運用担当者が協力することは、不正なサービスを実行しているから、内部ユーザーをブロックするために少し難しく、特定の外部サービスにアクセスする内部クライアントをブロックすることが不可能となり、そしてより重要。"
    },
    {
      "indent": 3,
      "text": "- There is no way a site can keep its hosts from being referenced as servers. This could lead to denial of service.",
      "ja": " - サイトは、サーバとして参照されることから、そのホストを保つことができる方法はありません。これは、サービス拒否につながる可能性があります。"
    },
    {
      "indent": 3,
      "text": "- With SRV, DNS spoofers can supply false port numbers, as well as host names and addresses. Because this vulnerability exists already, with names and addresses, this is not a new vulnerability, merely a slightly extended one, with little practical effect.",
      "ja": " -  SRVでは、DNSのスプーファは、偽のポート番号だけでなく、ホスト名とアドレスを供給することができます。この脆弱性は、名前とアドレスで、すでに存在しているので、これは、少し実用的な効果を持つだけで、わずかに延長1、新しい脆弱性ではありません。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "リファレンス"
    },
    {
      "indent": 3,
      "text": "STD 2: Reynolds, J., and J. Postel, \"Assigned Numbers\", STD 2, RFC 1700, October 1994.",
      "ja": "STD 2：レイノルズ、J.、およびJ.ポステル、 \"割り当て番号\"、STD 2、RFC 1700、1994年10月。"
    },
    {
      "indent": 3,
      "text": "RFC 1034: Mockapetris, P., \"Domain names - concepts and facilities\", STD 13, RFC 1034, November 1987.",
      "ja": "RFC 1034：Mockapetris、P.、 \"ドメイン名 - 概念と施設\"、STD 13、RFC 1034、1987年11月。"
    },
    {
      "indent": 3,
      "text": "RFC 1035: Mockapetris, P., \"Domain names - Implementation and Specification\", STD 13, RFC 1035, November 1987.",
      "ja": "RFC 1035：Mockapetris、P.、 \"ドメイン名 - 実装と仕様\"、STD 13、RFC 1035、1987年11月。"
    },
    {
      "indent": 3,
      "text": "RFC 974: Partridge, C., \"Mail routing and the domain system\", STD 14, RFC 974, January 1986.",
      "ja": "RFC 974：ヤマウズラ、C.、 \"メールのルーティングとドメインシステム\"、STD 14、RFC 974、1986年1月。"
    },
    {
      "indent": 3,
      "text": "BCP 14: Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "BCP 14：ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "RFC 2181: Elz, R. and R. Bush, \"Clarifications to the DNS Specification\", RFC 2181, July 1997.",
      "ja": "RFC 2181：エルツ、R.とR.ブッシュ大統領、 \"DNS仕様の明確化\"、RFC 2181、1997年7月。"
    },
    {
      "indent": 3,
      "text": "RFC 2219: Hamilton, M. and R. Wright, \"Use of DNS Aliases for Network Services\", BCP 17, RFC 2219, October 1997.",
      "ja": "RFC 2219：ハミルトン、M.とR.ライト、 \"ネットワークサービスのためのDNS別名の使用\"、BCP 17、RFC 2219、1997年10月。"
    },
    {
      "indent": 3,
      "text": "BCP 14: Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "BCP 14：ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "ARM: Armijo, M., Esibov, L. and P. Leach, \"Discovering LDAP Services with DNS\", Work in Progress.",
      "ja": "ARM：Armijo、M.、Esibov、L.およびP.リーチ、 \"DNSで発見LDAPサービス\" が進行中で働いています。"
    },
    {
      "indent": 3,
      "text": "KDC-DNS: Hornstein, K. and J. Altman, \"Distributing Kerberos KDC and Realm Information with DNS\", Work in Progress.",
      "ja": "KDC-DNS：Hornstein、K.とJ.アルトマン、 \"DNSと配布のKerberos KDCとレルム情報\" が進行中で働いています。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The algorithm used to select from the weighted SRV RRs of equal priority is adapted from one supplied by Dan Bernstein.",
      "ja": "等しい優先度の重み付けSRV RRの中から選択するために使用されるアルゴリズムは、ダンバーンスタインによって供給されたものから適合されています。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Arnt Gulbrandsen Troll Tech Waldemar Thranes gate 98B N-0175 Oslo, Norway",
      "ja": "ARNT Gulbrandsenのトロールテックヴァルダマー・スレインゲート98B N-0175オスロ、ノルウェー"
    },
    {
      "indent": 3,
      "text": "Fax: +47 22806380 Phone: +47 22806390 EMail: arnt@troll.no",
      "ja": "ファックス：+47 22806380電話：+47 22806390 Eメール：arnt@troll.no"
    },
    {
      "indent": 3,
      "text": "Paul Vixie Internet Software Consortium 950 Charter Street Redwood City, CA 94063",
      "ja": "ポール・ヴィクシーインターネットSoftware Consortiumの950憲章通りカリフォルニア州レッドウッドシティー94063"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650 779 7001",
      "ja": "電話：+1 650 779 7001"
    },
    {
      "indent": 3,
      "text": "Levon Esibov Microsoft Corporation One Microsoft Way Redmond, WA 98052",
      "ja": "レヴォンEsibovマイクロソフト社1マイクロソフト道、レッドモンド、ワシントン98052"
    },
    {
      "indent": 3,
      "text": "EMail: levone@microsoft.com",
      "ja": "メールアドレス：levone@microsoft.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}