{
  "title": {
    "text": "RFC 2575 - View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)",
    "ja": "RFC 2575 - シンプルなネットワーク管理プロトコル（SNMP）のビューベースのアクセス制御モデル（VACM）"
  },
  "number": 2575,
  "created_at": "2024-02-24 05:18:03.507199+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          B. Wijnen\nRequest for Comments: 2575                     IBM T. J. Watson Research\nObsoletes: 2275                                               R. Presuhn\nCategory: Standards Track                             BMC Software, Inc.\n                                                           K. McCloghrie\n                                                     Cisco Systems, Inc.\n                                                              April 1999",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)",
      "ja": "シンプルなネットワーク管理プロトコル（SNMP）のビューベースのアクセス制御モデル（VACM）"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（1999）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes the View-based Access Control Model for use in the SNMP architecture [RFC2571]. It defines the Elements of Procedure for controlling access to management information. This document also includes a MIB for remotely managing the configuration parameters for the View-based Access Control Model.",
      "ja": "このドキュメントでは、SNMPアーキテクチャで使用するビューベースのアクセス制御モデル[RFC2571]について説明します。管理情報へのアクセスを制御するための手順の要素を定義します。このドキュメントには、ビューベースのアクセス制御モデルの構成パラメーターをリモートで管理するためのMIBも含まれています。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction 2 1.2. Access Control 3 1.3. Local Configuration Datastore 3 2. Elements of the Model 3 2.1. Groups 3 2.2. securityLevel 4 2.3. Contexts 4 2.4. MIB Views and View Families 4 2.4.1. View Subtree 5 2.4.2. ViewTreeFamily 5 2.5. Access Policy 6 3. Elements of Procedure 6 3.1. Overview of isAccessAllowed Process 8 3.2. Processing the isAccessAllowed Service Request 9 4. Definitions 10 5. Intellectual Property 27 6. Acknowledgements 28 7. Security Considerations 29 7.1. Recommended Practices 29 7.2. Defining Groups 30 7.3. Conformance 30 7.4. Access to the SNMP-VIEW-BASED-ACM-MIB 30 8. References 31 9. Editors' Addresses 32 A.1. Installation Parameters 33 B. Change Log 37 C. Full Copyright Statement 38",
      "ja": "1. はじめに2 1.2。アクセス制御3 1.3。ローカル構成データストア3 2.モデル3の要素2.1。グループ3 2.2。SecurityLevel 4 2.3。コンテキスト4 2.4。MIBビューとビューファミリ4 2.4.1。サブツリー5 2.4.2を表示します。ViewTreefamily 5 2.5。アクセスポリシー6 3.手順の要素6 3.1。ISACCESSALLOWED PROCESS 8 3.2の概要。ISACCESSALLOWEDサービスリクエストの処理9 4.定義10 5.知的財産27 6.謝辞28 7.セキュリティ上の考慮事項29 7.1。推奨されるプラクティス29 7.2。グループの定義30 7.3。適合30 7.4。SNMP-ViewベースのACM-MIB 30へのアクセス30 8.参照31 9.編集者アドレス32 A.1。インストールパラメーター33 B.ログ37 C.フル著作権ステートメント38"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Architecture for describing Internet Management Frameworks [RFC2571] describes that an SNMP engine is composed of:",
      "ja": "インターネット管理フレームワーク[RFC2571]を説明するためのアーキテクチャは、SNMPエンジンが構成されていることを説明しています。"
    },
    {
      "indent": 5,
      "text": "1) a Dispatcher 2) a Message Processing Subsystem, 3) a Security Subsystem, and 4) an Access Control Subsystem.",
      "ja": "1) ディスパッチャー2）メッセージ処理サブシステム、3）セキュリティサブシステム、および4）アクセス制御サブシステム。"
    },
    {
      "indent": 3,
      "text": "Applications make use of the services of these subsystems.",
      "ja": "アプリケーションは、これらのサブシステムのサービスを利用しています。"
    },
    {
      "indent": 3,
      "text": "It is important to understand the SNMP architecture and its terminology to understand where the View-based Access Control Model described in this document fits into the architecture and interacts with other subsystems within the architecture. The reader is expected to have read and understood the description and terminology of the SNMP architecture, as defined in [RFC2571].",
      "ja": "このドキュメントで説明されているビューベースのアクセス制御モデルがアーキテクチャに適合し、アーキテクチャ内の他のサブシステムと対話する場所を理解するには、SNMPアーキテクチャとその用語を理解することが重要です。読者は、[RFC2571]で定義されているように、SNMPアーキテクチャの説明と用語を読んで理解したことが期待されています。"
    },
    {
      "indent": 3,
      "text": "The Access Control Subsystem of an SNMP engine has the responsibility for checking whether a specific type of access (read, write, notify) to a particular object (instance) is allowed.",
      "ja": "SNMPエンジンのアクセス制御サブシステムには、特定のオブジェクト（インスタンス）への特定のタイプのアクセス（読み取り、書き込み、通知）が許可されているかどうかを確認する責任があります。"
    },
    {
      "indent": 3,
      "text": "It is the purpose of this document to define a specific model of the Access Control Subsystem, designated the View-based Access Control Model. Note that this is not necessarily the only Access Control Model.",
      "ja": "このドキュメントの目的は、ビューベースのアクセス制御モデルを指定したアクセス制御サブシステムの特定のモデルを定義することです。これが必ずしも唯一のアクセス制御モデルではないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「「しない」、「そうでない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、[RFC2119]に記載されているように解釈される。"
    },
    {
      "indent": 0,
      "text": "1.2. Access Control",
      "section_title": true,
      "ja": "1.2. アクセス制御"
    },
    {
      "indent": 3,
      "text": "Access Control occurs (either implicitly or explicitly) in an SNMP entity when processing SNMP retrieval or modification request messages from an SNMP entity. For example a Command Responder application applies Access Control when processing requests that it received from a Command Generator application. These requests contain Read Class and Write Class PDUs as defined in [RFC2571].",
      "ja": "SNMP検索またはSNMPエンティティからの変更要求メッセージを処理する際に、SNMPエンティティでアクセス制御が（暗黙的または明示的に）発生します。たとえば、コマンドレスポンダーアプリケーションは、コマンドジェネレーターアプリケーションから受信したリクエストを処理するときにアクセス制御を適用します。これらの要求には、[RFC2571]で定義されているように、読み取りクラスと書き込みクラスのPDUが含まれています。"
    },
    {
      "indent": 3,
      "text": "Access Control also occurs in an SNMP entity when an SNMP notification message is generated (by a Notification Originator application). These notification messages contain Notification Class PDUs as defined in [RFC2571].",
      "ja": "SNMP通知メッセージが生成されると、SNMPエンティティでもアクセス制御が発生します（通知オリジネーターアプリケーションによって）。これらの通知メッセージには、[RFC2571]で定義されている通知クラスPDUが含まれています。"
    },
    {
      "indent": 3,
      "text": "The View-based Access Control Model defines a set of services that an application (such as a Command Responder or a Notification Originator application) can use for checking access rights. It is the responsibility of the application to make the proper service calls for access checking.",
      "ja": "ビューベースのアクセス制御モデルは、アクセス権のチェックに使用できるアプリケーション（コマンドレスポンダーや通知元のアプリケーションなど）が使用できる一連のサービスを定義します。アクセスチェックのための適切なサービス呼び出しを行うことは、申請の責任です。"
    },
    {
      "indent": 0,
      "text": "1.3. Local Configuration Datastore",
      "section_title": true,
      "ja": "1.3. ローカル構成データストア"
    },
    {
      "indent": 3,
      "text": "To implement the model described in this document, an SNMP entity needs to retain information about access rights and policies. This information is part of the SNMP engine's Local Configuration Datastore (LCD). See [RFC2571] for the definition of LCD.",
      "ja": "このドキュメントに記載されているモデルを実装するには、SNMPエンティティがアクセス権とポリシーに関する情報を保持する必要があります。この情報は、SNMPエンジンのローカル構成データストア（LCD）の一部です。LCDの定義については、[RFC2571]を参照してください。"
    },
    {
      "indent": 3,
      "text": "In order to allow an SNMP entity's LCD to be remotely configured, portions of the LCD need to be accessible as managed objects. A MIB module, the View-based Access Control Model Configuration MIB, which defines these managed object types is included in this document.",
      "ja": "SNMPエンティティのLCDをリモートで構成できるようにするには、LCDの一部に管理されたオブジェクトとしてアクセスできる必要があります。これらの管理されたオブジェクトタイプを定義するビューベースのアクセス制御モデル構成MIBであるMIBモジュールは、このドキュメントに含まれています。"
    },
    {
      "indent": 0,
      "text": "2. Elements of the Model",
      "section_title": true,
      "ja": "2. モデルの要素"
    },
    {
      "indent": 3,
      "text": "This section contains definitions to realize the access control service provided by the View-based Access Control Model.",
      "ja": "このセクションには、ビューベースのアクセス制御モデルが提供するアクセス制御サービスを実現するための定義が含まれています。"
    },
    {
      "indent": 0,
      "text": "2.1. Groups",
      "section_title": true,
      "ja": "2.1. グループ"
    },
    {
      "indent": 3,
      "text": "A group is a set of zero or more <securityModel, securityName> tuples on whose behalf SNMP management objects can be accessed. A group defines the access rights afforded to all securityNames which belong to that group. The combination of a securityModel and a securityName maps to at most one group. A group is identified by a groupName.",
      "ja": "グループは、SNMP管理オブジェクトに代わってアクセスできるゼロ以上の<securityModel、SecurityName> Tulpleのセットです。グループは、そのグループに属するすべてのセキュリティ名に与えられるアクセス権を定義します。セキュリティモデルとセキュリティ名の組み合わせは、最大1つのグループへのマップです。グループはグループ名で識別されます。"
    },
    {
      "indent": 3,
      "text": "The Access Control module assumes that the securityName has already been authenticated as needed and provides no further authentication of its own.",
      "ja": "Access Controlモジュールは、SecurityNameが必要に応じてすでに認証されていると想定しており、独自の認証を提供しません。"
    },
    {
      "indent": 3,
      "text": "The View-based Access Control Model uses the securityModel and the securityName as inputs to the Access Control module when called to check for access rights. It determines the groupName as a function of securityModel and securityName.",
      "ja": "ビューベースのアクセス制御モデルは、アクセス権をチェックするために呼び出されたときに、SecurityModelとSecurityNameをアクセス制御モジュールへの入力として使用します。SecurityModelとSecurityNameの関数としてグループ名を決定します。"
    },
    {
      "indent": 0,
      "text": "2.2. securityLevel",
      "section_title": true,
      "ja": "2.2. セキュリティレベル"
    },
    {
      "indent": 3,
      "text": "Different access rights for members of a group can be defined for different levels of security, i.e., noAuthNoPriv, authNoPriv, and authPriv. The securityLevel identifies the level of security that will be assumed when checking for access rights. See the SNMP Architecture document [RFC2571] for a definition of securityLevel.",
      "ja": "グループのメンバーのさまざまなアクセス権を、さまざまなレベルのセキュリティ、つまりnoauthnopriv、authnopriv、およびauthprivに対して定義できます。SecurityLevelは、アクセス権をチェックするときに想定されるセキュリティのレベルを特定します。SecurityLevelの定義については、SNMPアーキテクチャドキュメント[RFC2571]を参照してください。"
    },
    {
      "indent": 3,
      "text": "The View-based Access Control Model requires that the securityLevel is passed as input to the Access Control module when called to check for access rights.",
      "ja": "ビューベースのアクセス制御モデルでは、アクセス権をチェックするために呼び出されたときに、SecurityLevelがアクセス制御モジュールへの入力として渡される必要があります。"
    },
    {
      "indent": 0,
      "text": "2.3. Contexts",
      "section_title": true,
      "ja": "2.3. コンテキスト"
    },
    {
      "indent": 3,
      "text": "An SNMP context is a collection of management information accessible by an SNMP entity. An item of management information may exist in more than one context. An SNMP entity potentially has access to many contexts. Details about the naming of management information can be found in the SNMP Architecture document [RFC2571].",
      "ja": "SNMPコンテキストは、SNMPエンティティがアクセスできる管理情報のコレクションです。管理情報の項目は、複数のコンテキストで存在する場合があります。SNMPエンティティは、潜在的に多くのコンテキストにアクセスできます。管理情報の命名に関する詳細については、SNMPアーキテクチャドキュメント[RFC2571]を参照してください。"
    },
    {
      "indent": 3,
      "text": "The View-based Access Control Model defines a vacmContextTable that lists the locally available contexts by contextName.",
      "ja": "ビューベースのアクセス制御モデルは、コンテキスト名でローカルで利用可能なコンテキストをリストするvacmcontexttableを定義します。"
    },
    {
      "indent": 0,
      "text": "2.4. MIB Views and View Families",
      "section_title": true,
      "ja": "2.4. MIBは家族を見て見る"
    },
    {
      "indent": 3,
      "text": "For security reasons, it is often valuable to be able to restrict the access rights of some groups to only a subset of the management information in the management domain. To provide this capability, access to a context is via a \"MIB view\" which details a specific set of managed object types (and optionally, the specific instances of object types) within that context. For example, for a given context, there will typically always be one MIB view which provides access to all management information in that context, and often there will be other MIB views each of which contains some subset of the information. So, the access allowed for a group can be restricted in the desired manner by specifying its rights in terms of the particular (subset) MIB view it can access within each appropriate context.",
      "ja": "セキュリティ上の理由から、一部のグループのアクセス権を管理ドメイン内の管理情報のサブセットのみに制限できることがしばしば価値があります。この機能を提供するために、コンテキストへのアクセスは「MIBビュー」を介して行われます。これは、そのコンテキスト内の特定の管理オブジェクトタイプ（およびオプションのオブジェクトタイプの特定のインスタンス）のセットを詳述します。たとえば、特定のコンテキストでは、通常、そのコンテキストですべての管理情報へのアクセスを提供するMIBビューが常に1つあり、多くの場合、それぞれが情報のサブセットを含む他のMIBビューがあります。そのため、各適切なコンテキスト内でアクセスできる特定の（サブセット）MIBビューに関して、その権利を指定することにより、グループに許可されているアクセスを目的の方法で制限できます。"
    },
    {
      "indent": 3,
      "text": "Since managed object types (and their instances) are identified via the tree-like naming structure of ISO's OBJECT IDENTIFIERs [ISO-ASN.1, RFC2578], it is convenient to define a MIB view as the combination of a set of \"view subtrees\", where each view subtree is a subtree within the managed object naming tree. Thus, a simple MIB view (e.g., all managed objects within the Internet Network Management Framework) can be defined as a single view subtree, while more complicated MIB views (e.g., all information relevant to a particular network interface) can be represented by the union of multiple view subtrees.",
      "ja": "管理されたオブジェクトタイプ（およびそのインスタンス）は、ISOのオブジェクト識別子[ISO-ASN.1、RFC2578]のツリーのような命名構造を介して識別されるため、MIBビューを「ビューサブツリーズのセットの組み合わせとして定義するのが便利です。\"、各ビューサブツリーは、管理されたオブジェクトの命名ツリー内のサブツリーです。したがって、単純なMIBビュー（たとえば、インターネットネットワーク管理フレームワーク内のすべての管理オブジェクト）は単一のビューサブツリーとして定義できますが、より複雑なMIBビュー（たとえば、特定のネットワークインターフェイスに関連するすべての情報）は、複数のビューサブツリーの組合。"
    },
    {
      "indent": 3,
      "text": "While any set of managed objects can be described by the union of some number of view subtrees, situations can arise that would require a very large number of view subtrees. This could happen, for example, when specifying all columns in one conceptual row of a MIB table because they would appear in separate subtrees, one per column, each with a very similar format. Because the formats are similar, the required set of subtrees can easily be aggregated into one structure. This structure is named a family of view subtrees after the set of subtrees that it conceptually represents. A family of view subtrees can either be included or excluded from a MIB view.",
      "ja": "管理されたオブジェクトのセットは、いくつかのビューサブツリーの結合によって説明できますが、非常に多数のビューサブツリーを必要とする状況が発生する可能性があります。これは、たとえば、MIBテーブルの1つの概念的行にすべての列を指定するときに発生する可能性があります。これは、それぞれが非常に類似した形式を持つ個別のサブツリーに表示されるためです。形式は類似しているため、必要なサブツリーのセットを1つの構造に簡単に集約できます。この構造は、概念的に表すサブツリーのセットにちなんで、サブツリーのファミリーと名付けられています。ビューサブツリーファミリーは、MIBビューから含めるか、除外できます。"
    },
    {
      "indent": 0,
      "text": "2.4.1. View Subtree",
      "section_title": true,
      "ja": "2.4.1. サブツリーを表示します"
    },
    {
      "indent": 3,
      "text": "A view subtree is the set of all MIB object instances which have a common ASN.1 OBJECT IDENTIFIER prefix to their names. A view subtree is identified by the OBJECT IDENTIFIER value which is the longest OBJECT IDENTIFIER prefix common to all (potential) MIB object instances in that subtree.",
      "ja": "ビューサブツリーは、一般的なASN.1オブジェクト識別子のプレフィックスを備えたすべてのMIBオブジェクトインスタンスのセットです。ビューサブツリーは、そのサブツリーのすべての（潜在的な）MIBオブジェクトインスタンスに共通の最長オブジェクト識別子プレフィックスであるオブジェクト識別子値によって識別されます。"
    },
    {
      "indent": 0,
      "text": "2.4.2. ViewTreeFamily",
      "section_title": true,
      "ja": "2.4.2. viewtreefamily"
    },
    {
      "indent": 3,
      "text": "A family of view subtrees is a pairing of an OBJECT IDENTIFIER value (called the family name) together with a bit string value (called the family mask). The family mask indicates which sub-identifiers of the associated family name are significant to the family's definition.",
      "ja": "ビューサブツリーファミリーは、オブジェクト識別子値（姓と呼ばれる）と少し文字列値（ファミリーマスクと呼ばれる）のペアリングです。ファミリマスクは、関連する姓のどのサブ識別子が家族の定義にとって重要であるかを示します。"
    },
    {
      "indent": 3,
      "text": "For each possible managed object instance, that instance belongs to a particular ViewTreeFamily if both of the following conditions are true:",
      "ja": "可能なマネージドオブジェクトインスタンスごとに、そのインスタンスは、次の条件の両方が真である場合、特定のビューツリーファミリーに属します。"
    },
    {
      "indent": 3,
      "text": "- the OBJECT IDENTIFIER name of the managed object instance contains at least as many sub-identifiers as does the family name, and",
      "ja": "- マネージドオブジェクトインスタンスのオブジェクト識別子名には、姓と同じくらい多くのサブ識別子が含まれています。"
    },
    {
      "indent": 3,
      "text": "- each sub-identifier in the OBJECT IDENTIFIER name of the managed object instance matches the corresponding sub-identifier of the family name whenever the corresponding bit of the associated family mask is non-zero.",
      "ja": "- Object Identifier Nameの各サブIdentifierは、Managed Object Instanceの名前が、関連するファミリマスクの対応するビットがゼロではない場合はいつでも、姓の対応するサブIDENTIFIERと一致します。"
    },
    {
      "indent": 3,
      "text": "When the configured value of the family mask is all ones, the view subtree family is identical to the single view subtree identified by the family name.",
      "ja": "ファミリマスクの構成された値がすべてである場合、ビューサブツリーファミリは、姓によって識別される単一ビューサブツリーと同じです。"
    },
    {
      "indent": 3,
      "text": "When the configured value of the family mask is shorter than required to perform the above test, its value is implicitly extended with ones. Consequently, a view subtree family having a family mask of zero length always corresponds to a single view subtree.",
      "ja": "ファミリマスクの構成値が上記のテストを実行するのに必要なものよりも短い場合、その値は暗黙的に拡張されます。その結果、長さがゼロのファミリーマスクを持つビューサブツリーファミリは、常に単一ビューサブツリーに対応します。"
    },
    {
      "indent": 0,
      "text": "2.5. Access Policy",
      "section_title": true,
      "ja": "2.5. アクセスポリシー"
    },
    {
      "indent": 3,
      "text": "The View-based Access Control Model determines the access rights of a group, representing zero or more securityNames which have the same access rights. For a particular context, identified by contextName, to which a group, identified by groupName, has access using a particular securityModel and securityLevel, that group's access rights are given by a read-view, a write-view and a notify-view.",
      "ja": "ビューベースのアクセス制御モデルは、同じアクセス権を持つゼロ以上のセキュリティ名を表すグループのアクセス権を決定します。ContextNameで識別される特定のコンテキストでは、グループ名で識別されたグループが特定のSecurityModelとSecurityLevelを使用してアクセスできます。そのグループのアクセス権は、読み取りビュー、書き込みビュー、Notify-Viewによって与えられます。"
    },
    {
      "indent": 3,
      "text": "The read-view represents the set of object instances authorized for the group when reading objects. Reading objects occurs when processing a retrieval operation (when handling Read Class PDUs).",
      "ja": "read-viewは、オブジェクトを読むときにグループに対して承認されたオブジェクトインスタンスのセットを表します。読み取りオブジェクトは、検索操作を処理するときに発生します（読み取りクラスPDUを処理するとき）。"
    },
    {
      "indent": 3,
      "text": "The write-view represents the set of object instances authorized for the group when writing objects. Writing objects occurs when processing a write operation (when handling Write Class PDUs).",
      "ja": "書き込みビューは、オブジェクトを作成するときにグループに対して承認されたオブジェクトインスタンスのセットを表します。ライティングオブジェクトは、書き込み操作を処理するとき（書き込みクラスPDUを処理するとき）発生します。"
    },
    {
      "indent": 3,
      "text": "The notify-view represents the set of object instances authorized for the group when sending objects in a notification, such as when sending a notification (when sending Notification Class PDUs).",
      "ja": "Notify-viewは、通知を送信するとき（通知クラスPDUを送信するとき）など、通知内のオブジェクトを送信するときにグループに対して承認されたオブジェクトインスタンスのセットを表します。"
    },
    {
      "indent": 0,
      "text": "3. Elements of Procedure",
      "section_title": true,
      "ja": "3. 手順の要素"
    },
    {
      "indent": 3,
      "text": "This section describes the procedures followed by an Access Control module that implements the View-based Access Control Model when checking access rights as requested by an application (for example a Command Responder or a Notification Originator application). The abstract service primitive is:",
      "ja": "このセクションでは、アプリケーションの要求に応じてアクセス権をチェックするときにビューベースのアクセス制御モデルを実装するアクセス制御モジュールが続く手順について説明します（たとえば、コマンドレスポンダーや通知オリジネーターアプリケーション）。抽象サービスプリミティブは次のとおりです。"
    },
    {
      "indent": 5,
      "text": "statusInformation = -- success or errorIndication isAccessAllowed( securityModel -- Security Model in use securityName -- principal who wants access securityLevel -- Level of Security viewType -- read, write, or notify view contextName -- context containing variableName variableName -- OID for the managed object )",
      "ja": "StatusInFormation =  - 成功またはエラーインジケーションISACCESSALLOWED（securityModel-セキュリティモデル使用のセキュリティモデル - セキュリティレベルを希望するプリンシパル - セキュリティビュータイプのレベル - 読み取り、書き込み、または通知Vieblename variablenameを含むコンテキスト -  oid for forマネージドオブジェクト）"
    },
    {
      "indent": 3,
      "text": "The abstract data elements are:",
      "ja": "抽象データ要素は次のとおりです。"
    },
    {
      "indent": 5,
      "text": "statusInformation - one of the following: accessAllowed - a MIB view was found and access is granted. notInView - a MIB view was found but access is denied. The variableName is not in the configured MIB view for the specified viewType (e.g., in the relevant entry in the vacmAccessTable). noSuchView - no MIB view found because no view has been configured for specified viewType (e.g., in the relevant entry in the vacmAccessTable). noSuchContext - no MIB view found because of no entry in the vacmContextTable for specified contextName. noGroupName - no MIB view found because no entry has been configured in the vacmSecurityToGroupTable for the specified combination of securityModel and securityName. noAccessEntry - no MIB view found because no entry has been configured in the vacmAccessTable for the specified combination of contextName, groupName (from vacmSecurityToGroupTable), securityModel and securityLevel. otherError - failure, an undefined error occurred. securityModel - Security Model under which access is requested. securityName - the principal on whose behalf access is requested. securityLevel - Level of Security under which access is requested. viewType - view to be checked (read, write or notify). contextName - context in which access is requested. variableName - object instance to which access is requested.",
      "ja": "StatusInformation-次のいずれか：AccessAllowed -MIBビューが見つかり、アクセスが許可されています。notinview- MIBビューが見つかりましたが、アクセスは拒否されます。variablenameは、指定されたViewTypeの構成されたMIBビュー（たとえば、vacmacsTableの関連するエントリ）にはありません。nosuchview-指定されたViewType用のビューが構成されていないため、MIBビューは見つかりません（たとえば、vacmaccesstableの関連するエントリ）。nosuchcontext-指定されたコンテキスト名のvacmcontexttableにエントリがないために見つかったMIBビューはありません。nogroupName -securitymodelとsecurityNameの指定された組み合わせのためにvacmsecuritytoproptableでエントリが構成されていないため、MIBビューは見つかりません。noaccessentry-コンテキスト名、groupName（vacmsecurityTogroutable）、securitymodel、securitylevelの指定された組み合わせのvacmaccesStableでエントリが構成されていないため、MIBビューは見つかりません。otherError-障害、未定義のエラーが発生しました。SecurityModel-アクセスが要求されるセキュリティモデル。securityName-当たり前のアクセスが要求されているプリンシパル。SecurityLevel-アクセスが要求されるセキュリティのレベル。ViewType-確認する表示（読み取り、書き込み、または通知）。コンテキスト名 - アクセスが要求されるコンテキスト。variablename-アクセスが要求されるオブジェクトインスタンス。"
    },
    {
      "indent": 0,
      "text": "3.1. Overview of isAccessAllowed Process",
      "section_title": true,
      "ja": "3.1. ISACCESSALLOWEDプロセスの概要"
    },
    {
      "indent": 1,
      "text": "The following picture shows how the decision for access control is made by the View-based Access Control Model.",
      "ja": "次の画像は、アクセス制御の決定がビューベースのアクセス制御モデルによってどのように行われるかを示しています。"
    },
    {
      "indent": 1,
      "text": "+--------------------------------------------------------------------+\n|                                                                    |\n|      +-> securityModel -+                                          |\n|      |   (a)            |                                          |\n| who -+                  +-> groupName ----+                        |\n| (1)  |                  |   (x)           |                        |\n|      +-> securityName --+                 |                        |\n|          (b)                              |                        |\n|                                           |                        |\n| where -> contextName ---------------------+                        |\n| (2)      (e)                              |                        |\n|                                           |                        |\n|                                           |                        |\n|      +-> securityModel -------------------+                        |\n|      |   (a)                              |                        |\n| how -+                                    +-> viewName -+          |\n| (3)  |                                    |   (y)       |          |\n|      +-> securityLevel -------------------+             |          |\n|          (c)                              |             +-> yes/no |\n|                                           |             | decision |\n| why ---> viewType (read/write/notify) ----+             | (z)      |\n| (4)      (d)                                            |          |\n|                                                         |          |\n| what --> object-type ------+                            |          |\n| (5)      (m)               |                            |          |\n|                            +-> variableName (OID) ------+          |\n|                            |   (f)                                 |\n| which -> object-instance --+                                       |\n| (6)      (n)                                                       |\n|                                                                    |\n+--------------------------------------------------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 1,
      "text": "How the decision for isAccessAllowed is made.",
      "ja": "Isaccessallowedの決定がどのように行われますか。"
    },
    {
      "indent": 1,
      "text": "1) Inputs to the isAccessAllowed service are:",
      "ja": "1) ISACCESSALLOWEDサービスへの入力は次のとおりです。"
    },
    {
      "indent": 4,
      "text": "(a)       securityModel    -- Security Model in use\n(b)       securityName     -- principal who wants to access\n(c)       securityLevel    -- Level of Security\n(d)       viewType         -- read, write, or notify view\n(e)       contextName      -- context containing variableName\n    (f)       variableName     -- OID for the managed object\n                           -- this is made up of:\n                              - object-type (m)\n                              - object-instance (n)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 1,
      "text": "2) The partial \"who\" (1), represented by the securityModel (a) and the securityName (b), are used as the indices (a,b) into the vacmSecurityToGroupTable to find a single entry that produces a group, represented by groupName (x).",
      "ja": "2) SecurityModel（a）およびSecurityName（b）で表される部分的な「WHO」（1）は、グループ名（グループ名で表されるグループを生成する単一のエントリを見つけるために、インデックス（a、b）としてvacmsecuritytogruptableに使用されます）バツ）。"
    },
    {
      "indent": 1,
      "text": "3) The \"where\" (2), represented by the contextName (e), the \"who\", represented by the groupName (x) from the previous step, and the \"how\" (3), represented by securityModel (a) and securityLevel (c), are used as indices (e,x,a,c) into the vacmAccessTable to find a single entry that contains three MIB views.",
      "ja": "3) コンテキスト名（e）、「who」で表される「where」（2）は、前のステップのグループ名（x）で表され、securitymodel（a）とsecuritylevelで表される「how」（3）（c）は、インデックス（E、X、A、C）としてVacmAccesStableに使用され、3つのMIBビューを含む単一のエントリを見つけます。"
    },
    {
      "indent": 1,
      "text": "4) The \"why\" (4), represented by the viewType (d), is used to select the proper MIB view, represented by a viewName (y), from the vacmAccessEntry selected in the previous step. This viewName (y) is an index into the vacmViewTreeFamilyTable and selects the set of entries that define the variableNames which are included in or excluded from the MIB view identified by the viewName (y).",
      "ja": "4) ViewType（d）で表される「Why」（4）は、前のステップで選択されたvacmaccessentryから、ビュー名（y）で表される適切なMIBビューを選択するために使用されます。このViewName（Y）は、VacmViewTreeFamilyTableのインデックスであり、ViewName（Y）で識別されたMIBビューに含まれる、または除外されたVariablenamesを定義するエントリのセットを選択します。"
    },
    {
      "indent": 1,
      "text": "5) The \"what\" (5) type of management data and \"which\" (6) particular instance, represented by the variableName (f), is then checked to be in the MIB view or not, e.g., the yes/no decision (z).",
      "ja": "5) 「what」（5）管理データのタイプと「who」（6）variablename（f）で表される特定のインスタンスは、mibビューにあるかどうかを確認します。たとえば、yes/noの決定（z）。"
    },
    {
      "indent": 0,
      "text": "3.2. Processing the isAccessAllowed Service Request",
      "section_title": true,
      "ja": "3.2. ISACCESSALLOWEDサービスリクエストの処理"
    },
    {
      "indent": 3,
      "text": "This section describes the procedure followed by an Access Control module that implements the View-based Access Control Model whenever it receives an isAccessAllowed request.",
      "ja": "このセクションでは、ISACCESSALLOWEDリクエストを受信するたびにビューベースのアクセス制御モデルを実装するアクセス制御モジュールが続く手順について説明します。"
    },
    {
      "indent": 3,
      "text": "1) The vacmContextTable is consulted for information about the SNMP context identified by the contextName. If information about this SNMP context is absent from the table, then an errorIndication (noSuchContext) is returned to the calling module.",
      "ja": "1) VacmContextTableは、ContextNameで識別されたSNMPコンテキストに関する情報については、相談してください。このSNMPコンテキストに関する情報がテーブルに存在しない場合、エラーインジケーション（nosuchContext）が呼び出しモジュールに返されます。"
    },
    {
      "indent": 3,
      "text": "2) The vacmSecurityToGroupTable is consulted for mapping the securityModel and securityName to a groupName. If the information about this combination is absent from the table, then an errorIndication (noGroupName) is returned to the calling module.",
      "ja": "2) vacmsecurityTogroutableは、SecurityModelとSecurityNameをグループ名にマッピングするために相談します。この組み合わせに関する情報がテーブルにない場合、エラーインド（nogroupName）が呼び出しモジュールに返されます。"
    },
    {
      "indent": 3,
      "text": "3) The vacmAccessTable is consulted for information about the groupName, contextName, securityModel and securityLevel. If information about this combination is absent from the table, then an errorIndication (noAccessEntry) is returned to the calling module.",
      "ja": "3) GroupName、ContextName、SecurityModel、およびSecurityLevelの情報については、VacmaccesStableを参照してください。この組み合わせに関する情報がテーブルに存在しない場合、エラーインジケーション（noaccessentry）が呼び出しモジュールに返されます。"
    },
    {
      "indent": 3,
      "text": "4) a) If the viewType is \"read\", then the read view is used for checking access rights.",
      "ja": "4) a）ViewTypeが「読み取り」の場合、読み取りビューはアクセス権のチェックに使用されます。"
    },
    {
      "indent": 6,
      "text": "b) If the viewType is \"write\", then the write view is used for checking access rights.",
      "ja": "b) ViewTypeが「書き込み」の場合、書き込みビューはアクセス権の確認に使用されます。"
    },
    {
      "indent": 6,
      "text": "c) If the viewType is \"notify\", then the notify view is used for checking access rights.",
      "ja": "c) ViewTypeが「Notify」の場合、Notify Viewはアクセス権のチェックに使用されます。"
    },
    {
      "indent": 6,
      "text": "If the view to be used is the empty view (zero length viewName) then an errorIndication (noSuchView) is returned to the calling module.",
      "ja": "使用するビューが空のビュー（ゼロの長さのビュー名）である場合、エラーインド化（nosuchview）が呼び出しモジュールに返されます。"
    },
    {
      "indent": 3,
      "text": "5) a) If there is no view configured for the specified viewType, then an errorIndication (noSuchView) is returned to the calling module.",
      "ja": "5) a）指定されたViewType用に構成されているビューがない場合、エラーインジケーション（nosuchview）が呼び出しモジュールに返されます。"
    },
    {
      "indent": 6,
      "text": "b) If the specified variableName (object instance) is not in the MIB view (see DESCRIPTION clause for vacmViewTreeFamilyTable in section 4), then an errorIndication (notInView) is returned to the calling module.",
      "ja": "b) 指定されたvariablename（オブジェクトインスタンス）がMIBビューにない場合（セクション4のvacmviewtreefamilytableの説明条項を参照）、エラーインディネーション（notinview）が呼び出しモジュールに返されます。"
    },
    {
      "indent": 9,
      "text": "Otherwise,",
      "ja": "さもないと、"
    },
    {
      "indent": 6,
      "text": "c) The specified variableName is in the MIB view. A statusInformation of success (accessAllowed) is returned to the calling module.",
      "ja": "c) 指定されたvariablenameはMIBビューにあります。成功のステータス情報（AccessAllowed）が呼び出しモジュールに返されます。"
    },
    {
      "indent": 0,
      "text": "4. Definitions",
      "section_title": true,
      "ja": "4. 定義"
    },
    {
      "indent": 0,
      "text": "SNMP-VIEW-BASED-ACM-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "IMPORTS\n    MODULE-COMPLIANCE, OBJECT-GROUP       FROM SNMPv2-CONF\n    MODULE-IDENTITY, OBJECT-TYPE,\n    snmpModules                           FROM SNMPv2-SMI\n    TestAndIncr,\n    RowStatus, StorageType                FROM SNMPv2-TC\n    SnmpAdminString,\n    SnmpSecurityLevel,\n    SnmpSecurityModel                     FROM SNMP-FRAMEWORK-MIB;",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "snmpVacmMIB MODULE-IDENTITY LAST-UPDATED \"9901200000Z\" -- 20 Jan 1999, midnight ORGANIZATION \"SNMPv3 Working Group\" CONTACT-INFO \"WG-email: snmpv3@lists.tislabs.com Subscribe: majordomo@lists.tislabs.com In message body: subscribe snmpv3",
      "ja": "SNMPVACMMIBモジュールIDINTITY最終的な「9901200000Z」 -  1999年1月20日、ミッドナイト組織「SNMPV3ワーキンググループ」wg-email：snmpv3@lists.tislabs.com購読：majordomo@lists.tislabs.com：snmpv3を購読します"
    },
    {
      "indent": 18,
      "text": "Chair: Russ Mundy Trusted Information Systems postal: 3060 Washington Rd Glenwood MD 21738 USA email: mundy@tislabs.com phone: +1-301-854-6889",
      "ja": "議長：Russ Mundy Trusted Information Systems Postal：3060 Washington Rd Glenwood MD 21738 USAメール：mundy@tislabs.com電話：1-301-854-6889"
    },
    {
      "indent": 18,
      "text": "Co-editor: Bert Wijnen IBM T.J. Watson Research postal: Schagen 33 3461 GL Linschoten Netherlands email: wijnen@vnet.ibm.com phone: +31-348-432-794",
      "ja": "共同編集者：Bert Wijnen IBM T.J.ワトソン研究郵便：シェーゲン33 3461 GL Linschotenオランダメールメール：wijnen@vnet.ibm.com電話：31-348-432-794"
    },
    {
      "indent": 18,
      "text": "Co-editor: Randy Presuhn BMC Software, Inc postal: 965 Stewart Drive Sunnyvale, CA 94086 USA email: randy_presuhn@bmc.com phone: +1-408-616-3100",
      "ja": "共同編集者：Randy Presuhn BMC Software、Inc Postal：965 Stewart Drive Sunnyvale、CA 94086 USAメール：Randy_presuhn@bmc.com電話：1-408-616-3100"
    },
    {
      "indent": 0,
      "text": " Co-editor: Keith McCloghrie Cisco Systems, Inc. postal: 170 West Tasman Drive San Jose, CA 95134-1706 USA email: kzm@cisco.com phone: +1-408-526-5260 \" DESCRIPTION \"The management information definitions for the View-based Access Control Model for SNMP. \" -- Revision history REVISION \"9901200000Z\" -- 20 Jan 1999, midnight DESCRIPTION \"Clarifications, published as RFC2575\"",
      "ja": "共同編集者：Keith McCloghrie Cisco Systems、Inc。Postal：170 West Tasman Drive San Jose、CA 95134-1706 USAメール：kzm@cisco.com電話：1-408-526-5260 \"説明\"SNMPのビューベースのアクセス制御モデル。\" - リビジョン履歴改訂\" 9901200000Z \" -  1999年1月20日、真夜中の説明「明確化、RFC2575として公開」"
    },
    {
      "indent": 4,
      "text": "REVISION \"9711200000Z\" -- 20 Nov 1997, midnight DESCRIPTION \"Initial version, published as RFC2275\"",
      "ja": "リビジョン「9711200000Z」 -  1997年11月20日、真夜中の説明「初期バージョン、RFC2275として公開されています」"
    },
    {
      "indent": 4,
      "text": "::= { snmpModules 16 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Administrative assignments ****************************************",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmMIBObjects      OBJECT IDENTIFIER ::= { snmpVacmMIB 1 }\nvacmMIBConformance  OBJECT IDENTIFIER ::= { snmpVacmMIB 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Information about Local Contexts **********************************",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmContextTable OBJECT-TYPE SYNTAX SEQUENCE OF VacmContextEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The table of locally available contexts.",
      "ja": "VacmContextExtentableオブジェクトタイプの構文シーケンスvacmcontextententry max-accessアクセス不可能なステータス現在の説明 \"ローカル利用可能なコンテキストのテーブル。"
    },
    {
      "indent": 17,
      "text": "This table provides information to SNMP Command Generator applications so that they can properly configure the vacmAccessTable to control access to all contexts at the SNMP entity.",
      "ja": "このテーブルは、SNMPコマンドジェネレーターアプリケーションに情報を提供して、SNMPエンティティのすべてのコンテキストへのアクセスを制御するためにvacmaccesStableを適切に構成できるようにします。"
    },
    {
      "indent": 17,
      "text": "This table may change dynamically if the SNMP entity allows that contexts are added/deleted dynamically (for instance when its configuration changes). Such changes would happen only if the management instrumentation at that SNMP entity recognizes more (or fewer) contexts.",
      "ja": "SNMPエンティティがそのコンテキストを動的に追加/削除できる場合（たとえば、構成が変更されたとき）、このテーブルは動的に変更される場合があります。このような変更は、そのSNMPエンティティでの管理手段がより多く（または少ない）コンテキストを認識している場合にのみ発生します。"
    },
    {
      "indent": 17,
      "text": "The presence of entries in this table and of entries in the vacmAccessTable are independent. That is, a context identified by an entry in this table is not necessarily referenced by any entries in the vacmAccessTable; and the context(s) referenced by an entry in the vacmAccessTable does not necessarily currently exist and thus need not be identified by an entry in this table.",
      "ja": "このテーブルにエントリの存在とvacmaccesStableのエントリの存在は独立しています。つまり、このテーブルのエントリによって識別されるコンテキストは、必ずしもvacmacesstableのエントリによって参照されるわけではありません。また、vacmaccessTableのエントリによって参照されるコンテキストは、必ずしも現在存在するわけではないため、この表のエントリによって識別する必要はありません。"
    },
    {
      "indent": 17,
      "text": "This table must be made accessible via the default context so that Command Responder applications have a standard way of retrieving the information.",
      "ja": "このテーブルは、コマンドレスポンダーアプリケーションに情報を取得する標準的な方法を持つように、デフォルトのコンテキストからアクセスできるようにする必要があります。"
    },
    {
      "indent": 4,
      "text": "             This table is read-only. It cannot be configured via\n             SNMP.\n            \"\n::= { vacmMIBObjects 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmContextEntry OBJECT-TYPE\n    SYNTAX       VacmContextEntry\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION \"Information about a particular context.\"\n    INDEX       {\n                  vacmContextName\n                }\n    ::= { vacmContextTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "VacmContextEntry ::= SEQUENCE\n    {\n        vacmContextName SnmpAdminString\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmContextName OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS read-only STATUS current DESCRIPTION \"A human readable name identifying a particular context at a particular SNMP entity.",
      "ja": "vacmContextNameオブジェクトタイプ構文SNMPADMINSTRING（サイズ（0..32））最大アクセス読み取り専用ステータス現在の説明 \"特定のSNMPエンティティで特定のコンテキストを識別する人間の読み取り可能な名前。"
    },
    {
      "indent": 4,
      "text": "             The empty contextName (zero length) represents the\n             default context.\n            \"\n::= { vacmContextEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Information about Groups ******************************************",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmSecurityToGroupTable OBJECT-TYPE\n    SYNTAX       SEQUENCE OF VacmSecurityToGroupEntry\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION \"This table maps a combination of securityModel and\n                 securityName into a groupName which is used to define\n                 an access control policy for a group of principals.\n                \"\n    ::= { vacmMIBObjects 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmSecurityToGroupEntry OBJECT-TYPE\n    SYNTAX       VacmSecurityToGroupEntry\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION \"An entry in this table maps the combination of a\n                 securityModel and securityName into a groupName.\n                \"\n    INDEX       {\n                  vacmSecurityModel,\n                  vacmSecurityName\n                }\n    ::= { vacmSecurityToGroupTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "VacmSecurityToGroupEntry ::= SEQUENCE\n    {\n        vacmSecurityModel               SnmpSecurityModel,\n        vacmSecurityName                SnmpAdminString,\n        vacmGroupName                   SnmpAdminString,\n        vacmSecurityToGroupStorageType  StorageType,\n        vacmSecurityToGroupStatus       RowStatus\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmSecurityModel OBJECT-TYPE SYNTAX SnmpSecurityModel(1..2147483647) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The Security Model, by which the vacmSecurityName referenced by this entry is provided.",
      "ja": "vacmsecurityModelオブジェクトタイプ構文SNMPSECURITYMODEL（1..2147483647）最大アクセスはアクセス不可能な現在の説明 \"このエントリによって参照されるvacmsecurityNameが提供されます。"
    },
    {
      "indent": 4,
      "text": "             Note, this object may not take the 'any' (0) value.\n            \"\n::= { vacmSecurityToGroupEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmSecurityName OBJECT-TYPE\n    SYNTAX       SnmpAdminString (SIZE(1..32))\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION \"The securityName for the principal, represented in a\n                 Security Model independent format, which is mapped by\n                 this entry to a groupName.\n                \"\n    ::= { vacmSecurityToGroupEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmGroupName OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(1..32)) MAX-ACCESS read-create STATUS current DESCRIPTION \"The name of the group to which this entry (e.g., the combination of securityModel and securityName) belongs.",
      "ja": "vacmgroupNameオブジェクトタイプ構文SNMPADMINSTRING（サイズ（1..32））最大アクセスREAD-CREATEステータス現在の説明 \"このエントリ（たとえば、SecurityModelとSecurityNameの組み合わせ）が属するグループの名前。"
    },
    {
      "indent": 4,
      "text": "             This groupName is used as index into the\n             vacmAccessTable to select an access control policy.\n             However, a value in this table does not imply that an\n             instance with the value exists in table vacmAccesTable.\n            \"\n::= { vacmSecurityToGroupEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmSecurityToGroupStorageType OBJECT-TYPE SYNTAX StorageType MAX-ACCESS read-create STATUS current DESCRIPTION \"The storage type for this conceptual row. Conceptual rows having the value 'permanent' need not allow write-access to any columnar objects in the row. \" DEFVAL { nonVolatile }",
      "ja": "vacmsecuritytogroupStorageTypeオブジェクトタイプ構文StorageType max-access read-createステータス現在の説明 \"この概念的行のストレージタイプ。値「永続」を持つ概念行は、行の柱のオブジェクトへの書き込みアクセスを許可する必要はありません。」}"
    },
    {
      "indent": 4,
      "text": "::= { vacmSecurityToGroupEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmSecurityToGroupStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"The status of this conceptual row.",
      "ja": "vacmsecurityTogroupStatus Object-Type Syntax RowStatus Max-Access Read-Createステータス現在の説明 \"この概念行のステータス。"
    },
    {
      "indent": 17,
      "text": "Until instances of all corresponding columns are appropriately configured, the value of the corresponding instance of the vacmSecurityToGroupStatus column is 'notReady'.",
      "ja": "対応するすべての列のインスタンスが適切に構成されるまで、VacmsecurityTogroupStatus列の対応するインスタンスの値は「準備ができていない」です。"
    },
    {
      "indent": 17,
      "text": "In particular, a newly created row cannot be made active until a value has been set for vacmGroupName.",
      "ja": "特に、vacmgroupNameの値が設定されるまで、新しく作成された行をアクティブにすることはできません。"
    },
    {
      "indent": 17,
      "text": "The RowStatus TC [RFC2579] requires that this DESCRIPTION clause states under which circumstances other objects in this row can be modified:",
      "ja": "RowStatus TC [RFC2579]では、この説明条項が、この行の他のオブジェクトを変更できる状況に基づいて、次のように述べていることが必要です。"
    },
    {
      "indent": 4,
      "text": "             The value of this object has no effect on whether\n             other objects in this conceptual row can be modified.\n            \"\n::= { vacmSecurityToGroupEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Information about Access Rights ***********************************",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAccessTable OBJECT-TYPE SYNTAX SEQUENCE OF VacmAccessEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The table of access rights for groups.",
      "ja": "vacmaccessentryのvacmaccessTableオブジェクトタイプの構文シーケンスvacmaccessentry max-accessアクセス不可能なステータス現在の説明 \"グループのアクセス権の表。"
    },
    {
      "indent": 17,
      "text": "Each entry is indexed by a groupName, a contextPrefix, a securityModel and a securityLevel. To determine whether access is allowed, one entry from this table needs to be selected and the proper viewName from that entry must be used for access control checking.",
      "ja": "各エントリは、GroupName、ContextPrefix、SecurityModel、SecurityLevelによってインデックス付けされます。アクセスが許可されているかどうかを判断するには、このテーブルから1つのエントリを選択する必要があり、そのエントリからの適切なビュー名をアクセス制御チェックに使用する必要があります。"
    },
    {
      "indent": 17,
      "text": "To select the proper entry, follow these steps:",
      "ja": "適切なエントリを選択するには、次の手順に従ってください。"
    },
    {
      "indent": 17,
      "text": "1) the set of possible matches is formed by the intersection of the following sets of entries: the set of entries with identical vacmGroupName the union of these two sets: - the set with identical vacmAccessContextPrefix - the set of entries with vacmAccessContextMatch value of 'prefix' and matching vacmAccessContextPrefix intersected with the union of these two sets: - the set of entries with identical vacmSecurityModel - the set of entries with vacmSecurityModel value of 'any' intersected with the set of entries with vacmAccessSecurityLevel value less than or equal to the requested securityLevel",
      "ja": "1) 可能な一致のセットは、次のエントリのセットの交差点によって形成されます。これらの2つのセットの同一のvacmgroupNameのエントリのセット： - 同一のvacmacesscontextprefixのセット -  quacmaccesscontextmatch値の 'frefix'のvacmacscontextmatch値のセットvacmacessContextPrefixの一致するこれら2つのセットの結合と交差しています。-同一のfacmsecurityModelのエントリのセット -  facmsecuritymodel値のエントリのセットは、facmacesssecuritylevel値のセットと交差した「任意」のセットと、要求されたSecurityLevelseLevelに等しいか等しいか"
    },
    {
      "indent": 17,
      "text": "2) if this set has only one member, we're done otherwise, it comes down to deciding how to weight the preferences between ContextPrefixes, SecurityModels, and SecurityLevels as follows: a) if the subset of entries with securityModel matching the securityModel in the message is not empty, then discard the rest. b) if the subset of entries with vacmAccessContextPrefix matching the contextName in the message is not empty, then discard the rest c) discard all entries with ContextPrefixes shorter than the longest one remaining in the set d) select the entry with the highest securityLevel",
      "ja": "2) このセットにメンバーが1つしかない場合、それ以外の場合は、ContextPrefixes、SecurityModels、およびSecurityLevelsの間の好みを次のように重み付けする方法を決定することになります。a）SecurityModelのサブセットのサブセットがメッセージ内のSecurityModelに一致する場合です。空ではない後、残りを破棄します。b）メッセージのコンテキスト名を一致させるvacmacessContextPrefixを使用したエントリのサブセットが空になっていない場合、残りを破棄しますc）セットに残っている最も長いものよりも短いコンテキストペリフィックスですべてのエントリを破棄しますd）最高のセキュリティレベルでエントリを選択します"
    },
    {
      "indent": 4,
      "text": "             Please note that for securityLevel noAuthNoPriv, all\n             groups are really equivalent since the assumption that\n             the securityName has been authenticated does not hold.\n            \"\n::= { vacmMIBObjects 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAccessEntry OBJECT-TYPE SYNTAX VacmAccessEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"An access right configured in the Local Configuration Datastore (LCD) authorizing access to an SNMP context.",
      "ja": "vacmaccessentryオブジェクトタイプ構文facmaccessentry max-access accessable not accessable current current current \"ローカル構成データストア（lcd）で構成されたアクセス権がSNMPコンテキストへのアクセスを許可します。"
    },
    {
      "indent": 4,
      "text": " Entries in this table can use an instance value for object vacmGroupName even if no entry in table vacmAccessSecurityToGroupTable has a corresponding value for object vacmGroupName. \" INDEX { vacmGroupName, vacmAccessContextPrefix, vacmAccessSecurityModel, vacmAccessSecurityLevel }",
      "ja": "このテーブルのエントリは、テーブルにエントリがvacmaccesssecuritytogroutableにオブジェクトvacmgroupNameに対応する値を持っていなくても、オブジェクトvacmgroupNameのインスタンス値を使用できます。\"index {vacmgroupName、vacmacessContextPrefix、vacmacesssecurityModel、vacmacesssecurityLevel}"
    },
    {
      "indent": 4,
      "text": "::= { vacmAccessTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "VacmAccessEntry ::= SEQUENCE\n    {\n        vacmAccessContextPrefix    SnmpAdminString,\n        vacmAccessSecurityModel    SnmpSecurityModel,\n        vacmAccessSecurityLevel    SnmpSecurityLevel,\n        vacmAccessContextMatch     INTEGER,\n        vacmAccessReadViewName     SnmpAdminString,\n        vacmAccessWriteViewName    SnmpAdminString,\n        vacmAccessNotifyViewName   SnmpAdminString,\n        vacmAccessStorageType      StorageType,\n        vacmAccessStatus           RowStatus\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAccessContextPrefix OBJECT-TYPE\n    SYNTAX       SnmpAdminString (SIZE(0..32))\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION \"In order to gain the access rights allowed by this\n                 conceptual row, a contextName must match exactly\n                 (if the value of vacmAccessContextMatch is 'exact')\n                 or partially (if the value of vacmAccessContextMatch\n                 is 'prefix') to the value of the instance of this\n                 object.\n                \"\n    ::= { vacmAccessEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAccessSecurityModel OBJECT-TYPE\n    SYNTAX       SnmpSecurityModel\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION \"In order to gain the access rights allowed by this\n                 conceptual row, this securityModel must be in use.\n                \"\n    ::= { vacmAccessEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAccessSecurityLevel OBJECT-TYPE SYNTAX SnmpSecurityLevel MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The minimum level of security required in order to gain the access rights allowed by this conceptual row. A securityLevel of noAuthNoPriv is less than authNoPriv which in turn is less than authPriv.",
      "ja": "vacmaccesssecuritylevel object-type sntax snmpsecuritylevel max-access not-accessable current現在の説明 \"この概念の行によって許可されているアクセス権を獲得するために必要なセキュリティの最小レベル。。"
    },
    {
      "indent": 4,
      "text": "             If multiple entries are equally indexed except for\n             this vacmAccessSecurityLevel index, then the entry\n                 which has the highest value for\n             vacmAccessSecurityLevel is selected.\n            \"\n::= { vacmAccessEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAccessContextMatch OBJECT-TYPE SYNTAX INTEGER { exact (1), -- exact match of prefix and contextName prefix (2) -- Only match to the prefix } MAX-ACCESS read-create STATUS current DESCRIPTION \"If the value of this object is exact(1), then all rows where the contextName exactly matches vacmAccessContextPrefix are selected.",
      "ja": "vacmacessContextMatchオブジェクトタイプSyntax Integer {exact（1）、 - プレフィックスとコンテキスト名の正確な一致プレフィックス（2） - プレフィックスと一致する} max-access read-createステータス現在の説明 \"このオブジェクトの値が正確である場合（1）次に、コンテキスト名がvacmacessContextPrefixと正確に一致するすべての行が選択されます。"
    },
    {
      "indent": 4,
      "text": "             If the value of this object is prefix(2), then all\n             rows where the contextName whose starting octets\n             exactly match vacmAccessContextPrefix are selected.\n             This allows for a simple form of wildcarding.\n            \"\nDEFVAL      { exact }\n::= { vacmAccessEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAccessReadViewName OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of an instance of this object identifies the MIB view of the SNMP context to which this conceptual row authorizes read access.",
      "ja": "vacmaccessreadViewName Object-Type Syntax SnmpadMinstring（size（0..32））max-access read-createステータス現在の説明 \"このオブジェクトのインスタンスの値は、この概念的行が読み取りアクセスを認証するSNMPコンテキストのMIBビューを識別します。"
    },
    {
      "indent": 4,
      "text": "             The identified MIB view is that one for which the\n             vacmViewTreeFamilyViewName has the same value as the\n             instance of this object; if the value is the empty\n             string or if there is no active MIB view having this\n             value of vacmViewTreeFamilyViewName, then no access\n             is granted.\n            \"\nDEFVAL      { ''H }   -- the empty string\n::= { vacmAccessEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAccessWriteViewName OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of an instance of this object identifies the MIB view of the SNMP context to which this conceptual row authorizes write access.",
      "ja": "vacmacesswriteViewNameオブジェクトタイプの構文SNMPADMINSTRING（サイズ（0..32））Max-Access Read-Createステータス現在の説明 \"このオブジェクトのインスタンスの値は、この概念の列が書き込みアクセスを許可するSNMPコンテキストのMIBビューの値を識別します。"
    },
    {
      "indent": 4,
      "text": "             The identified MIB view is that one for which the\n             vacmViewTreeFamilyViewName has the same value as the\n             instance of this object; if the value is the empty\n             string or if there is no active MIB view having this\n             value of vacmViewTreeFamilyViewName, then no access\n             is granted.\n            \"\nDEFVAL      { ''H }   -- the empty string\n::= { vacmAccessEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAccessNotifyViewName OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of an instance of this object identifies the MIB view of the SNMP context to which this conceptual row authorizes access for notifications.",
      "ja": "vacmaccessnotifyViewName object-type sntax snmpadminstring（size（0..32））max-access read-createステータス現在の説明 \"このオブジェクトのインスタンスの値は、この概念の列が通知のためのアクセスを認証するSNMPコンテキストのMIBビューのMIBビューを識別します。。"
    },
    {
      "indent": 4,
      "text": "             The identified MIB view is that one for which the\n             vacmViewTreeFamilyViewName has the same value as the\n             instance of this object; if the value is the empty\n             string or if there is no active MIB view having this\n             value of vacmViewTreeFamilyViewName, then no access\n             is granted.\n            \"\nDEFVAL      { ''H }   -- the empty string\n::= { vacmAccessEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAccessStorageType OBJECT-TYPE SYNTAX StorageType MAX-ACCESS read-create STATUS current DESCRIPTION \"The storage type for this conceptual row.",
      "ja": "vacmacessstorageTypeオブジェクトタイプ構文StorageType Max-Access Read-Createステータス現在の説明 \"この概念行のストレージタイプ。"
    },
    {
      "indent": 4,
      "text": "             Conceptual rows having the value 'permanent' need not\n             allow write-access to any columnar objects in the row.\n            \"\nDEFVAL      { nonVolatile }\n::= { vacmAccessEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmAccessStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"The status of this conceptual row.",
      "ja": "vacmaccessstatus object-type構文rowstatus max-access read-createステータス現在の説明 \"この概念行のステータス。"
    },
    {
      "indent": 17,
      "text": "The RowStatus TC [RFC2579] requires that this DESCRIPTION clause states under which circumstances other objects in this row can be modified:",
      "ja": "RowStatus TC [RFC2579]では、この説明条項が、この行の他のオブジェクトを変更できる状況に基づいて、次のように述べていることが必要です。"
    },
    {
      "indent": 4,
      "text": "             The value of this object has no effect on whether\n             other objects in this conceptual row can be modified.\n            \"\n::= { vacmAccessEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Information about MIB views ***************************************",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Support for instance-level granularity is optional.\n--\n-- In some implementations, instance-level access control\n-- granularity may come at a high performance cost.  Managers\n-- should avoid requesting such configurations unnecessarily.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmMIBViews     OBJECT IDENTIFIER ::= { vacmMIBObjects 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmViewSpinLock OBJECT-TYPE SYNTAX TestAndIncr MAX-ACCESS read-write STATUS current DESCRIPTION \"An advisory lock used to allow cooperating SNMP Command Generator applications to coordinate their use of the Set operation in creating or modifying views.",
      "ja": "vacmviewspinlock object-type syntax testandincr max-access read-writeステータス現在の説明 \"SNMPコマンドジェネレーターアプリケーションを協力して、ビューを作成または変更する際にセット操作の使用を調整できるようにするために使用されるアドバイザリーロック。"
    },
    {
      "indent": 17,
      "text": "When creating a new view or altering an existing view, it is important to understand the potential interactions with other uses of the view. The vacmViewSpinLock should be retrieved. The name of the view to be created should be determined to be unique by the SNMP Command Generator application by consulting the vacmViewTreeFamilyTable. Finally, the named view may be created (Set), including the advisory lock. If another SNMP Command Generator application has altered the views in the meantime, then the spin lock's value will have changed, and so this creation will fail because it will specify the wrong value for the spin lock.",
      "ja": "新しいビューを作成したり、既存のビューを変更したりする場合、ビューの他の使用との潜在的な相互作用を理解することが重要です。vacmviewspinlockを取得する必要があります。作成されるビューの名前は、vacmviewTreeFamilyTableに相談することにより、SNMPコマンドジェネレーターアプリケーションによって一意であると判断する必要があります。最後に、アドバイザリーロックを含む名前付きビュー（セット）が作成される場合があります。その間に別のSNMPコマンドジェネレーターアプリケーションがビューを変更した場合、スピンロックの値が変更されるため、この作成はスピンロックの間違った値を指定するため失敗します。"
    },
    {
      "indent": 4,
      "text": "             Since this is an advisory lock, the use of this lock\n             is not enforced.\n            \"\n::= { vacmMIBViews 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmViewTreeFamilyTable OBJECT-TYPE SYNTAX SEQUENCE OF VacmViewTreeFamilyEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Locally held information about families of subtrees within MIB views.",
      "ja": "vacmviewtreefamilytableオブジェクトタイプの構文シーケンスvacmviewtreefamilyentry max-accessはアクセス不可能なステータス現在の説明 \"mibビュー内のサブツリーのファミリーに関するローカルに保持されている情報。"
    },
    {
      "indent": 17,
      "text": "Each MIB view is defined by two sets of view subtrees: - the included view subtrees, and - the excluded view subtrees. Every such view subtree, both the included and the excluded ones, is defined in this table.",
      "ja": "各MIBビューは、2セットのビューサブツリーで定義されます。このようなビューサブツリーはすべて、含まれているものと除外されたものの両方が、このテーブルで定義されています。"
    },
    {
      "indent": 17,
      "text": "To determine if a particular object instance is in a particular MIB view, compare the object instance's OBJECT IDENTIFIER with each of the MIB view's active entries in this table. If none match, then the object instance is not in the MIB view. If one or more match, then the object instance is included in, or excluded from, the MIB view according to the value of vacmViewTreeFamilyType in the entry whose value of vacmViewTreeFamilySubtree has the most sub-identifiers. If multiple entries match and have the same number of sub-identifiers (when wildcarding is specified with the value of vacmViewTreeFamilyMask), then the lexicographically greatest instance of vacmViewTreeFamilyType determines the inclusion or exclusion.",
      "ja": "特定のオブジェクトインスタンスが特定のMIBビューにあるかどうかを判断するには、オブジェクトインスタンスのオブジェクト識別子をこのテーブルの各ビューのアクティブエントリと比較します。一致しない場合、オブジェクトインスタンスはMIBビューにありません。1つ以上一致する場合、オブジェクトインスタンスは、vacmviewtreefamilysubtreeの価値が最もサブアイデンティファイアーを持っているエントリ内のvacmviewtreefamilytypeの値に従ってMIBビューに含まれるか、除外されます。複数のエントリが一致し、同じ数のサブ識別子を持っている場合（vacmviewtreefamilymaskの値でワイルドカードが指定されている場合）、vacmviewtreefamilytypeの辞書的に最大のインスタンスが包含または除外を決定します。"
    },
    {
      "indent": 17,
      "text": "An object instance's OBJECT IDENTIFIER X matches an active entry in this table when the number of sub-identifiers in X is at least as many as in the value of vacmViewTreeFamilySubtree for the entry, and each sub-identifier in the value of vacmViewTreeFamilySubtree matches its corresponding sub-identifier in X. Two sub-identifiers match either if the corresponding bit of the value of vacmViewTreeFamilyMask for the entry is zero (the 'wild card' value), or if they are equal.",
      "ja": "オブジェクトインスタンスのオブジェクト識別子Xは、Xのサブ識別子の数が少なくともエントリのVacmViewTreeFamilySubtreeの値と同じくらいの場合、このテーブルのアクティブなエントリと一致し、VacmviewTreefamilySubtreeの値の各サブ識別子が対応する一致と一致しますXのサブIDENTIFIER。エントリのVacmViewTreefamilyMaskの対応するビットがゼロ（「ワイルドカード」値）、またはそれらが等しい場合、2つのサブ識別子が一致します。"
    },
    {
      "indent": 17,
      "text": "A 'family' of subtrees is the set of subtrees defined by a particular combination of values of vacmViewTreeFamilySubtree and vacmViewTreeFamilyMask. In the case where no 'wild card' is defined in the vacmViewTreeFamilyMask, the family of subtrees reduces to a single subtree.",
      "ja": "サブツリーの「ファミリー」は、vacmviewtreefamilysubtreeとvacmviewtreefamilymaskの値の特定の組み合わせによって定義されるサブツリーのセットです。vacmviewtreefamilymaskで「ワイルドカード」が定義されていない場合、サブツリーのファミリーは単一のサブツリーに減少します。"
    },
    {
      "indent": 17,
      "text": "When creating or changing MIB views, an SNMP Command Generator application should utilize the vacmViewSpinLock to try to avoid collisions. See DESCRIPTION clause of vacmViewSpinLock.",
      "ja": "MIBビューを作成または変更するとき、SNMPコマンドジェネレーターアプリケーションは、vacmviewspinlockを利用して衝突を避けようとする必要があります。vacmviewspinlockの説明条項を参照してください。"
    },
    {
      "indent": 17,
      "text": "When creating MIB views, it is strongly advised that first the 'excluded' vacmViewTreeFamilyEntries are created and then the 'included' entries.",
      "ja": "MIBビューを作成するとき、最初に「除外された」vacmviewTreefamilyentriesが作成され、次に「含まれている」エントリが作成されることが強くお勧めします。"
    },
    {
      "indent": 17,
      "text": "When deleting MIB views, it is strongly advised that first the 'included' vacmViewTreeFamilyEntries are deleted and then the 'excluded' entries.",
      "ja": "MIBビューを削除すると、最初に「fackmviewtreefamilyentriesが削除され、次に「除外」エントリが削除されることが強くお勧めします。"
    },
    {
      "indent": 4,
      "text": "             If a create for an entry for instance-level access\n             control is received and the implementation does not\n             support instance-level granularity, then an\n             inconsistentName error must be returned.\n            \"\n::= { vacmMIBViews 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmViewTreeFamilyEntry OBJECT-TYPE SYNTAX VacmViewTreeFamilyEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Information on a particular family of view subtrees included in or excluded from a particular SNMP context's MIB view.",
      "ja": "vacmviewtreefamilyentryオブジェクトタイプ構文vacmviewtreefamilyentry max-access not-accessable current current \"特定のSNMPコンテキストのMIBビューに含まれる、または除外された特定のビューサブツリーの情報に関する情報。"
    },
    {
      "indent": 17,
      "text": "Implementations must not restrict the number of families of view subtrees for a given MIB view, except as dictated by resource constraints on the overall number of entries in the vacmViewTreeFamilyTable.",
      "ja": "実装は、VacmViewTreeFamilyTableのエントリの総数に関するリソースの制約によって決定される場合を除き、特定のMIBビューのビューサブツリーのファミリー数を制限してはなりません。"
    },
    {
      "indent": 4,
      "text": "             If no conceptual rows exist in this table for a given\n             MIB view (viewName), that view may be thought of as\n             consisting of the empty set of view subtrees.\n            \"\nINDEX       { vacmViewTreeFamilyViewName,\n              vacmViewTreeFamilySubtree\n            }\n::= { vacmViewTreeFamilyTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "VacmViewTreeFamilyEntry ::= SEQUENCE\n    {\n        vacmViewTreeFamilyViewName     SnmpAdminString,\n        vacmViewTreeFamilySubtree      OBJECT IDENTIFIER,\n        vacmViewTreeFamilyMask         OCTET STRING,\n        vacmViewTreeFamilyType         INTEGER,\n        vacmViewTreeFamilyStorageType  StorageType,\n        vacmViewTreeFamilyStatus       RowStatus\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmViewTreeFamilyViewName OBJECT-TYPE\n    SYNTAX       SnmpAdminString (SIZE(1..32))\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION \"The human readable name for a family of view subtrees.\n                \"\n    ::= { vacmViewTreeFamilyEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmViewTreeFamilySubtree OBJECT-TYPE\n    SYNTAX       OBJECT IDENTIFIER\n    MAX-ACCESS   not-accessible\n    STATUS       current\n    DESCRIPTION \"The MIB subtree which when combined with the\n                 corresponding instance of vacmViewTreeFamilyMask\n                 defines a family of view subtrees.\n                \"\n    ::= { vacmViewTreeFamilyEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmViewTreeFamilyMask OBJECT-TYPE SYNTAX OCTET STRING (SIZE (0..16)) MAX-ACCESS read-create STATUS current DESCRIPTION \"The bit mask which, in combination with the corresponding instance of vacmViewTreeFamilySubtree, defines a family of view subtrees.",
      "ja": "vacmviewTreefamilyMaskオブジェクトタイプの構文オクタックスストリング（サイズ（0..16））最大アクセス読み取りステータス現在の説明 \"vacmviewtreefamilysubtreeの対応するインスタンスと組み合わせて、ビュービューサブトリーの家族を定義するビットマスク。"
    },
    {
      "indent": 17,
      "text": "Each bit of this bit mask corresponds to a sub-identifier of vacmViewTreeFamilySubtree, with the most significant bit of the i-th octet of this octet string value (extended if necessary, see below) corresponding to the (8*i - 7)-th sub-identifier, and the least significant bit of the i-th octet of this octet string corresponding to the (8*i)-th sub-identifier, where i is in the range 1 through 16.",
      "ja": "このビットマスクの各ビットは、vacmviewtreefamilysubtreeのサブ識別子に対応しており、（8*i-7） - に対応するこのオクテット文字列値のi番目のオクテット（必要に応じて、以下を参照）の最も重要なビットを持っています。Thサブインテッドフィアー、および（8*i）-thサブ識別子に対応するこのオクテット文字列のi番目のオクテットの最も有意なビット。私は1〜16の範囲にあります。"
    },
    {
      "indent": 17,
      "text": "Each bit of this bit mask specifies whether or not the corresponding sub-identifiers must match when determining if an OBJECT IDENTIFIER is in this family of view subtrees; a '1' indicates that an exact match must occur; a '0' indicates 'wild card', i.e., any sub-identifier value matches.",
      "ja": "このビットマスクの各ビットは、オブジェクト識別子がこのビューサブツリーファミリーにあるかどうかを判断する際に、対応するサブ識別子が一致するかどうかを指定します。「1」は、正確な一致が発生しなければならないことを示します。「0」は、「ワイルドカード」、つまり、サブインテッド値の値が一致することを示します。"
    },
    {
      "indent": 17,
      "text": "Thus, the OBJECT IDENTIFIER X of an object instance is contained in a family of view subtrees if, for each sub-identifier of the value of vacmViewTreeFamilySubtree, either:",
      "ja": "したがって、オブジェクトインスタンスのオブジェクト識別子xは、vacmviewtreefamilysubtreeの値の各サブ識別子に対して、次のように、視野下位のファミリーに含まれています。"
    },
    {
      "indent": 19,
      "text": "the i-th bit of vacmViewTreeFamilyMask is 0, or",
      "ja": "vacmviewtreefamilymaskのi番目のビットは0です"
    },
    {
      "indent": 19,
      "text": "the i-th sub-identifier of X is equal to the i-th sub-identifier of the value of vacmViewTreeFamilySubtree.",
      "ja": "xのi番目のサブ識別子は、vacmviewtreefamilysubtreeの値のi番目のサブ識別子に等しくなります。"
    },
    {
      "indent": 17,
      "text": "If the value of this bit mask is M bits long and there are more than M sub-identifiers in the corresponding instance of vacmViewTreeFamilySubtree, then the bit mask is extended with 1's to be the required length.",
      "ja": "このビットマスクの値がMビットの長さであり、VacmViewTreefamilySubtreeの対応するインスタンスにMサブインテッドインを超える場合、ビットマスクは必要な長さに1を拡張します。"
    },
    {
      "indent": 17,
      "text": "Note that when the value of this object is the zero-length string, this extension rule results in a mask of all-1's being used (i.e., no 'wild card'), and the family of view subtrees is the one view subtree uniquely identified by the corresponding instance of vacmViewTreeFamilySubtree.",
      "ja": "このオブジェクトの値がゼロ長さの文字列である場合、この拡張ルールはAll-1のマスクを使用する（つまり、「ワイルドカード」なし）、ビューサブツリーファミリーはサブツリーのファミリーであることが1つのビューサブツリーであるというものです。vacmviewtreefamilysubtreeの対応するインスタンスによって識別されます。"
    },
    {
      "indent": 4,
      "text": "             Note that masks of length greater than zero length\n             do not need to be supported. In this case this\n             object is made read-only.\n            \"\nDEFVAL      { ''H }\n::= { vacmViewTreeFamilyEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmViewTreeFamilyType OBJECT-TYPE\n    SYNTAX       INTEGER  { included(1), excluded(2) }\n    MAX-ACCESS   read-create\n    STATUS       current\n    DESCRIPTION \"Indicates whether the corresponding instances of\n                 vacmViewTreeFamilySubtree and vacmViewTreeFamilyMask\n                 define a family of view subtrees which is included in\n                 or excluded from the MIB view.\n                \"\n    DEFVAL      { included }\n    ::= { vacmViewTreeFamilyEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmViewTreeFamilyStorageType OBJECT-TYPE SYNTAX StorageType MAX-ACCESS read-create STATUS current DESCRIPTION \"The storage type for this conceptual row.",
      "ja": "vacmviewtreefamilystorageTypeオブジェクトタイプ構文storageType max-access read-createステータス現在の説明 \"この概念行のストレージタイプ。"
    },
    {
      "indent": 4,
      "text": "             Conceptual rows having the value 'permanent' need not\n                 allow write-access to any columnar objects in the row.\n            \"\nDEFVAL      { nonVolatile }\n::= { vacmViewTreeFamilyEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmViewTreeFamilyStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"The status of this conceptual row.",
      "ja": "vacmviewtreefamilystatus object-type syntax rowstatus max-access read-createステータス現在の説明 \"この概念的行のステータス。"
    },
    {
      "indent": 17,
      "text": "The RowStatus TC [RFC2579] requires that this DESCRIPTION clause states under which circumstances other objects in this row can be modified:",
      "ja": "RowStatus TC [RFC2579]では、この説明条項が、この行の他のオブジェクトを変更できる状況に基づいて、次のように述べていることが必要です。"
    },
    {
      "indent": 4,
      "text": "             The value of this object has no effect on whether\n             other objects in this conceptual row can be modified.\n            \"\n::= { vacmViewTreeFamilyEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Conformance information *******************************************",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmMIBCompliances  OBJECT IDENTIFIER ::= { vacmMIBConformance 1 }\nvacmMIBGroups       OBJECT IDENTIFIER ::= { vacmMIBConformance 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Compliance statements *********************************************",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmMIBCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for SNMP engines which implement the SNMP View-based Access Control Model configuration MIB. \" MODULE -- this module MANDATORY-GROUPS { vacmBasicGroup }",
      "ja": "vacmmibcomplianceモジュールコンプライアンス状態現在"
    },
    {
      "indent": 8,
      "text": "OBJECT vacmAccessContextMatch MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "Object vacmacessContextmatch min-access読み取り専用説明「書き込みアクセスは不要です。」"
    },
    {
      "indent": 8,
      "text": "OBJECT vacmAccessReadViewName MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "オブジェクトvacmaccessreadviewname min-access読み取り専用説明「書き込みアクセスは不要です。」"
    },
    {
      "indent": 8,
      "text": "OBJECT vacmAccessWriteViewName MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\" OBJECT vacmAccessNotifyViewName MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "オブジェクトvacmacesswriteviewname min-access読み取り専用説明「書き込みアクセスは不要です。」オブジェクトvacmaccessnotifyViewName min-access読み取り専用説明「書き込みアクセスは不要です。」"
    },
    {
      "indent": 8,
      "text": "OBJECT vacmAccessStorageType MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "Object vacmaccesstorageType min-access読み取り専用説明「書き込みアクセスは不要です。」"
    },
    {
      "indent": 8,
      "text": "OBJECT vacmAccessStatus MIN-ACCESS read-only DESCRIPTION \"Create/delete/modify access to the vacmAccessTable is not required. \"",
      "ja": "Object vacmaccessstatus min-access読み取り専用説明"
    },
    {
      "indent": 8,
      "text": "OBJECT vacmViewTreeFamilyMask WRITE-SYNTAX OCTET STRING (SIZE (0)) MIN-ACCESS read-only DESCRIPTION \"Support for configuration via SNMP of subtree families using wild-cards is not required. \"",
      "ja": "オブジェクトvacmviewtreefamilymask write-syntax octet string（size（0））min-access read-only説明「ワイルドカードを使用したサブツーファミリーのSNMPを介した構成のサポートは必要ありません。」"
    },
    {
      "indent": 8,
      "text": "OBJECT vacmViewTreeFamilyType MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "オブジェクトvacmviewtreefamilytype min-access読み取り専用説明「書き込みアクセスは不要です。」"
    },
    {
      "indent": 8,
      "text": "OBJECT vacmViewTreeFamilyStorageType MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "オブジェクトvacmviewtreefamilystorageType min-access読み取り専用説明「書き込みアクセスは不要です」。"
    },
    {
      "indent": 4,
      "text": "    OBJECT        vacmViewTreeFamilyStatus\n    MIN-ACCESS    read-only\n    DESCRIPTION  \"Create/delete/modify access to the\n                  vacmViewTreeFamilyTable is not required.\n                 \"\n::= { vacmMIBCompliances 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Units of conformance **********************************************",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "vacmBasicGroup OBJECT-GROUP\n    OBJECTS {\n              vacmContextName,\n              vacmGroupName,\n              vacmSecurityToGroupStorageType,\n              vacmSecurityToGroupStatus,\n              vacmAccessContextMatch,\n              vacmAccessReadViewName,\n              vacmAccessWriteViewName,\n              vacmAccessNotifyViewName,\n              vacmAccessStorageType,\n              vacmAccessStatus,\n              vacmViewSpinLock,\n              vacmViewTreeFamilyMask,\n              vacmViewTreeFamilyType,\n              vacmViewTreeFamilyStorageType,\n              vacmViewTreeFamilyStatus\n            }\n    STATUS       current\n    DESCRIPTION \"A collection of objects providing for remote\n                 configuration of an SNMP engine which implements\n                 the SNMP View-based Access Control Model.\n                \"\n    ::= { vacmMIBGroups 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "5. Intellectual Property",
      "section_title": true,
      "ja": "5. 知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、知的財産またはその他の権利の有効性または範囲に関して、この文書に記載されているテクノロジーの実装または使用に関連すると主張される可能性のある他の権利、またはそのような権利に基づくライセンスがどの程度であるかについての程度に関連する可能性があるという立場はありません。利用可能;また、そのような権利を特定するために努力したことも表明していません。標準トラックおよび標準関連のドキュメントの権利に関するIETFの手順に関する情報は、BCP-11に記載されています。出版のために利用可能にされた権利の請求のコピーと、利用可能になるライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を得ることができますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、関心のある当事者に、この基準を実践するために必要な技術をカバーする可能性のある著作権、特許、または特許出願、またはその他の独自の権利を注意深く招待するよう招待しています。情報をIETFエグゼクティブディレクターに宛ててください。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "This document is the result of the efforts of the SNMPv3 Working Group. Some special thanks are in order to the following SNMPv3 WG members:",
      "ja": "このドキュメントは、SNMPV3ワーキンググループの努力の結果です。次のSNMPV3 WGメンバーに特別な感謝をお勧めします。"
    },
    {
      "indent": 3,
      "text": "Harald Tveit Alvestrand (Maxware) Dave Battle (SNMP Research, Inc.) Alan Beard (Disney Worldwide Services) Paul Berrevoets (SWI Systemware/Halcyon Inc.) Martin Bjorklund (Ericsson) Uri Blumenthal (IBM T.J. Watson Research Center) Jeff Case (SNMP Research, Inc.) John Curran (BBN) Mike Daniele (Compaq Computer Corporation) T. Max Devlin (Eltrax Systems) John Flick (Hewlett Packard) Rob Frye (MCI) Wes Hardaker (U.C.Davis, Information Technology - D.C.A.S.) David Harrington (Cabletron Systems Inc.) Lauren Heintz (BMC Software, Inc.) N.C. Hien (IBM T.J. Watson Research Center) Michael Kirkham (InterWorking Labs, Inc.) Dave Levi (SNMP Research, Inc.) Louis A Mamakos (UUNET Technologies Inc.) Joe Marzot (Nortel Networks) Paul Meyer (Secure Computing Corporation) Keith McCloghrie (Cisco Systems) Bob Moore (IBM) Russ Mundy (TIS Labs at Network Associates) Bob Natale (ACE*COMM Corporation) Mike O'Dell (UUNET Technologies Inc.) Dave Perkins (DeskTalk) Peter Polkinghorne (Brunel University) Randy Presuhn (BMC Software, Inc.) David Reeder (TIS Labs at Network Associates) David Reid (SNMP Research, Inc.) Aleksey Romanov (Quality Quorum) Shawn Routhier (Epilogue) Juergen Schoenwaelder (TU Braunschweig) Bob Stewart (Cisco Systems) Mike Thatcher (Independent Consultant) Bert Wijnen (IBM T.J. Watson Research Center) The document is based on recommendations of the IETF Security and Administrative Framework Evolution for SNMP Advisory Team. Members of that Advisory Team were:",
      "ja": "Harald Tveit Alvestrand（Maxware）Dave Battle（SNMP Research、Inc。）Alan Beard（Disney Worldwide Services）Paul Berrevoets（SWI Systemware/Halcyon Inc.）Martin Bjorklund（Ericsson）Uri Blumenthal（IBM T.J. Watson Research Center）Jeff（SNMPResearch、Inc。）John Curran（BBN）Mike Daniele（Compaq Computer Corporation）T. Max Devlin（Eltrax Systems）John Flick（Hewlett Packard）Rob Frye（MCI）Wes Hardaker（U.C.Davis、Information Technology -D.C.A.S。）David Harrington（Cabletron Systems Inc.）Lauren Heintz（BMC Software、Inc。）N.C。Hien（IBM T.J. Watson Research Center）Michael Kirkham（Interworking Labs、Inc。）Dave Levi（SNMP Research、Inc。）Louii a Mamakos（Uunet Technologies Inc.）Joe Marzot（Nortel Networks）Paul Meyer（Secure Computing Corporation）Keith McCloghrie（Cisco Systems）Bob Moore（IBM）Russ Mundy（Network AssociatesのTis Labs））Dave Perkins（Desktalk）Peter Polkinghorne（Brunel University）Randy Presuhn（BMC Software、Inc。）David Reeder（TIS Labs at Network Associates）David Reid（SNMP Research、Inc。）Aleksey Romanov（Quality Quorum）Shawn Routhier（epilogue）Juergen Schoenwaelder（Tu Braunschweig）Bob Stewart（Cisco Systems）Mike Satcher（独立コンサルタント）Bert Wijnen（IBM T.J.Watson Research Center）このドキュメントは、SNMPアドバイザリーチームのIETFセキュリティおよび管理フレームワークの進化の推奨に基づいています。そのアドバイザリーチームのメンバーは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "David Harrington (Cabletron Systems Inc.) Jeff Johnson (Cisco Systems) David Levi (SNMP Research Inc.) John Linn (Openvision) Russ Mundy (Trusted Information Systems) chair Shawn Routhier (Epilogue) Glenn Waters (Nortel) Bert Wijnen (IBM T. J. Watson Research Center)",
      "ja": "David Harrington（Cabletron Systems Inc.）Jeff Johnson（Cisco Systems）David Levi（SNMP Research Inc.）John Linn（OpenVision）Russ Mundy（信頼できる情報システム）議長Shawn Routhier（Epilogue）Glenn Waters（Nortel）Bert Wijnen（IBM T. J.ワトソン研究センター）"
    },
    {
      "indent": 3,
      "text": "As recommended by the Advisory Team and the SNMPv3 Working Group Charter, the design incorporates as much as practical from previous RFCs and drafts. As a result, special thanks are due to the authors of previous designs known as SNMPv2u and SNMPv2*:",
      "ja": "アドバイザリーチームとSNMPV3ワーキンググループチャーターが推奨しているように、この設計には以前のRFCとドラフトから実用的なものが組み込まれています。その結果、SNMPV2UおよびSNMPV2*として知られる以前のデザインの著者による特別な感謝のおかげです。"
    },
    {
      "indent": 3,
      "text": "Jeff Case (SNMP Research, Inc.) David Harrington (Cabletron Systems Inc.) David Levi (SNMP Research, Inc.) Keith McCloghrie (Cisco Systems) Brian O'Keefe (Hewlett Packard) Marshall T. Rose (Dover Beach Consulting) Jon Saperia (BGS Systems Inc.) Steve Waldbusser (International Network Services) Glenn W. Waters (Bell-Northern Research Ltd.)",
      "ja": "ジェフケース（SNMP Research、Inc。）David Harrington（Cabletron Systems Inc.）David Levi（SNMP Research、Inc。）Keith McCloghrie（Cisco Systems）Brian O'Keefe（Hewlett Packard）Marshall T. Rose（Dover Beach Consulting）JonSaperia（BGS Systems Inc.）Steve Waldbusser（International Network Services）Glenn W. Waters（Bell-Northern Research Ltd.）"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 0,
      "text": "7.1. Recommended Practices",
      "section_title": true,
      "ja": "7.1. 推奨されるプラクティス"
    },
    {
      "indent": 3,
      "text": "This document is meant for use in the SNMP architecture. The View-based Access Control Model described in this document checks access rights to management information based on:",
      "ja": "このドキュメントは、SNMPアーキテクチャで使用するためのものです。このドキュメントで説明されているビューベースのアクセス制御モデルは、次のことに基づいて管理情報へのアクセス権をチェックします。"
    },
    {
      "indent": 3,
      "text": "- contextName, representing a set of management information at the managed system where the Access Control module is running. - groupName, representing a set of zero or more securityNames. The combination of a securityModel and a securityName is mapped into a group in the View-based Access Control Model. - securityModel under which access is requested. - securityLevel under which access is requested. - operation performed on the management information. - MIB views for read, write or notify access.",
      "ja": "- ContextNameは、アクセス制御モジュールが実行されている管理システムでの一連の管理情報を表します。 - グループ名、ゼロ以上のセキュリティ名のセットを表します。SecurityModelとSecurityNameの組み合わせは、ビューベースのアクセス制御モデルのグループにマッピングされます。 - アクセスが要求されるセキュリティモデル。 - アクセスが要求されるセキュリティレベル。 - 管理情報で実行された操作。-Read、書き込み、または通知アクセスのMIBビュー。"
    },
    {
      "indent": 3,
      "text": "When the User-based Access Control module is called for checking access rights, it is assumed that the calling module has ensured the authentication and privacy aspects as specified by the securityLevel that is being passed.",
      "ja": "ユーザーベースのアクセス制御モジュールがアクセス権をチェックするために呼び出されると、通話モジュールは、合格しているSecurityLevelによって指定された認証とプライバシーの側面を確保していると想定されています。"
    },
    {
      "indent": 3,
      "text": "When creating entries in or deleting entries from the vacmViewTreeFamilyTable it is important to do such in the sequence as recommended in the DESCRIPTION clause of the vacmViewTreeFamilyTable definition. Otherwise unwanted access may be granted while changing the entries in the table.",
      "ja": "vacmviewTreeFamilyTable定義の説明句で推奨されるように、vacmviewTreeFamilyTableからエントリを作成または削除する場合、シーケンスでそのようなことを行うことが重要です。それ以外の場合は、テーブル内のエントリを変更する際に、不要なアクセスが許可される場合があります。"
    },
    {
      "indent": 0,
      "text": "7.2. Defining Groups",
      "section_title": true,
      "ja": "7.2. グループの定義"
    },
    {
      "indent": 3,
      "text": "The groupNames are used to give access to a group of zero or more securityNames. Within the View-Based Access Control Model, a groupName is considered to exist if that groupName is listed in the vacmSecurityToGroupTable.",
      "ja": "グループ名は、ゼロ以上のセキュリティ名のグループへのアクセスを提供するために使用されます。ビューベースのアクセス制御モデル内では、そのグループ名がvacmsecurityTogroutableにリストされている場合、グループ名が存在すると見なされます。"
    },
    {
      "indent": 3,
      "text": "By mapping the combination of a securityModel and securityName into a groupName, an SNMP Command Generator application can add/delete securityNames to/from a group, if proper access is allowed.",
      "ja": "SecurityModelとSecurityNameの組み合わせをGroupNameにマッピングすることにより、SNMPコマンドジェネレーターアプリケーションは、適切なアクセスが許可されている場合、グループにセキュリティ名を追加/削除できます。"
    },
    {
      "indent": 3,
      "text": "Further it is important to realize that the grouping of <securityModel, securityName> tuples in the vacmSecurityToGroupTable does not take securityLevel into account. It is therefore important that the security administrator uses the securityLevel index in the vacmAccessTable to separate noAuthNoPriv from authPriv and/or authNoPriv access.",
      "ja": "さらに、<securitymodel、securityname> tulplesのグループ化がvacmsecuritytogrouptableのTulpleのグループ化は、SecurityLevelを考慮していないことを認識することが重要です。したがって、セキュリティ管理者がvacmaccesStableのセキュリティレベルインデックスを使用して、noauthnoprivをauthprivおよび/またはauthnoprivアクセスから分離することが重要です。"
    },
    {
      "indent": 0,
      "text": "7.3. Conformance",
      "section_title": true,
      "ja": "7.3. 適合"
    },
    {
      "indent": 3,
      "text": "For an implementation of the View-based Access Control Model to be conformant, it MUST implement the SNMP-VIEW-BASED-ACM-MIB according to the vacmMIBCompliance. It also SHOULD implement the initial configuration, described in appendix A.",
      "ja": "ビューベースのアクセス制御モデルを順応させるためには、vacmmibcomplianceに従ってSNMP-ViewベースのACM-MIBを実装する必要があります。また、付録Aで説明する初期構成も実装する必要があります。"
    },
    {
      "indent": 0,
      "text": "7.4. Access to the SNMP-VIEW-BASED-ACM-MIB",
      "section_title": true,
      "ja": "7.4. SNMP-ViewベースのACM-MIBへのアクセス"
    },
    {
      "indent": 3,
      "text": "The objects in this MIB control the access to all MIB data that is accessible via the SNMP engine and they may be considered sensitive in many environments. It is important to closely control (both read and write) access to these to these MIB objects by using appropriately configured Access Control models (for example the View-based Access Control Model as specified in this document).",
      "ja": "このMIBのオブジェクトは、SNMPエンジンを介してアクセス可能なすべてのMIBデータへのアクセスを制御し、多くの環境で敏感であると見なされる場合があります。適切に構成されたアクセス制御モデル（このドキュメントで指定されているビューベースのアクセス制御モデル）を使用して、これらのMIBオブジェクトへのこれらへのこれらへのアクセスを厳密に制御することが重要です。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D. and J. Schoenwaelder, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[RFC2578] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「管理情報の構造バージョン2（SMIV2）」、STD 58、RFC 2578、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D. and J. Schoenwaelder, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[RFC2579] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「SMIV2のテキストコンベンション」、STD 58、RFC 2579、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2571] Harrington, D., Presuhn, R. and B. Wijnen, \"An Architecture for describing SNMP Management Frameworks\", RFC 2571, April 1999.",
      "ja": "[RFC2571] Harrington、D.、Presuhn、R。およびB. Wijnen、「SNMP管理フレームワークを説明するためのアーキテクチャ」、RFC 2571、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2572] Case, J., Harrington, D., Presuhn, R. and B. Wijnen, \"Message Processing and Dispatching for the Simple Network Management Protocol (SNMP)\", RFC 2572, April 1999.",
      "ja": "[RFC2572] Case、J.、Harrington、D.、Presuhn、R。、およびB. Wijnen、「シンプルネットワーク管理プロトコル（SNMP）のメッセージ処理とディスパッチ」、RFC 2572、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2574] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", RFC 2574, April 1999.",
      "ja": "[RFC2574] Blumenthal、U.およびB. Wijnen、「単純なネットワーク管理プロトコル（SNMPV3）のバージョン3のユーザーベースのセキュリティモデル（USM）」、RFC 2574、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[ISO-ASN.1] Information processing systems - Open Systems Interconnection - Specification of Abstract Syntax Notation One (ASN.1), International Organization for Standardization. International Standard 8824, (December, 1987).",
      "ja": "[ISO -ASN.1]情報処理システム - オープンシステムの相互接続 - 抽象的構文表記1（ASN.1）の仕様、国際標準化機関。国際標準8824（1987年12月）。"
    },
    {
      "indent": 0,
      "text": "9. Editors' Addresses",
      "section_title": true,
      "ja": "9. 編集者のアドレス"
    },
    {
      "indent": 3,
      "text": "Bert Wijnen IBM T. J. Watson Research Schagen 33 3461 GL Linschoten Netherlands",
      "ja": "Bert Wijnen Ibm T. J. Watson Research Schagen 33 3461 GL Linschotenオランダ"
    },
    {
      "indent": 3,
      "text": "Phone:      +31-348-432-794\nEMail:      wijnen@vnet.ibm.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Randy Presuhn BMC Software, Inc 965 Stewart Drive Sunnyvale, CA 94086 USA",
      "ja": "Randy Presuhn BMC Software、Inc 965 Stewart Drive Sunnyvale、CA 94086 USA"
    },
    {
      "indent": 3,
      "text": "Phone:      +1-408-616-3100\nEMail:      randy_presuhn@bmc.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Keith McCloghrie Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134-1706 USA",
      "ja": "Keith McCloghrie Cisco Systems、Inc。170 West Tasman Drive San Jose、CA 95134-1706 USA"
    },
    {
      "indent": 3,
      "text": "Phone:      +1-408-526-5260\nEMail:      kzm@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "APPENDIX A - Installation",
      "ja": "付録A-インストール"
    },
    {
      "indent": 0,
      "text": "A.1. Installation Parameters",
      "section_title": true,
      "ja": "A.1. インストールパラメーター"
    },
    {
      "indent": 3,
      "text": "During installation, an authoritative SNMP engine which supports this View-based Access Control Model SHOULD be configured with several initial parameters. These include for the View-based Access Control Model:",
      "ja": "インストール中、このビューベースのアクセス制御モデルをサポートする権威あるSNMPエンジンは、いくつかの初期パラメーターで構成する必要があります。これらには、ビューベースのアクセス制御モデル用に含まれます。"
    },
    {
      "indent": 0,
      "text": "1) A security configuration",
      "ja": "1) セキュリティ構成"
    },
    {
      "indent": 3,
      "text": "The choice of security configuration determines if initial configuration is implemented and if so how. One of three possible choices is selected:",
      "ja": "セキュリティ構成の選択により、初期構成が実装されているかどうか、およびその場合は決定します。可能な3つの選択肢の1つが選択されます。"
    },
    {
      "indent": 8,
      "text": "- initial-minimum-security-configuration - initial-semi-security-configuration - initial-no-access-configuration",
      "ja": "- Initial-Minimum-Security-configuration-初期セミセキュリティ構成 - 初期ノーアクセス構成"
    },
    {
      "indent": 3,
      "text": "In the case of a initial-no-access-configuration, there is no initial configuration, and so the following steps are irrelevant.",
      "ja": "初期のアクセス構成の場合、初期構成はないため、次の手順は無関係です。"
    },
    {
      "indent": 0,
      "text": "2) A default context",
      "ja": "2) デフォルトのコンテキスト"
    },
    {
      "indent": 3,
      "text": "One entry in the vacmContextTable with a contextName of \"\" (the empty string), representing the default context. Note that this table gets created automatically if a default context exists.",
      "ja": "デフォルトのコンテキストを表す \"\"（空の文字列）のコンテキスト名を持つvacmcontexttableの1つのエントリ。デフォルトのコンテキストが存在する場合、このテーブルは自動的に作成されることに注意してください。"
    },
    {
      "indent": 5,
      "text": "vacmContextName \"\"",
      "ja": "vacmContextName \"\""
    },
    {
      "indent": 0,
      "text": "3) An initial group",
      "ja": "3) 初期グループ"
    },
    {
      "indent": 3,
      "text": "One entry in the vacmSecurityToGroupTable to allow access to group \"initial\".",
      "ja": "グループ「初期」へのアクセスを許可するために、facmsecuritytogroutableの1つのエントリ。"
    },
    {
      "indent": 5,
      "text": "vacmSecurityModel 3 (USM) vacmSecurityName \"initial\" vacmGroupName \"initial\" vacmSecurityToGroupStorageType anyValidStorageType vacmSecurityToGroupStatus active",
      "ja": "vacmsecurityModel 3（USM）facmsecurityName \"firting\" vacmgroupName \"firting\" vacmsecuritytogroupStorageType anyvalidStorageType facmsecuritytogroupStatus Active"
    },
    {
      "indent": 0,
      "text": "4) Initial access rights",
      "ja": "4) 初期アクセス権"
    },
    {
      "indent": 3,
      "text": "Three entries in the vacmAccessTable as follows:",
      "ja": "次のように、vacmaccesStableの3つのエントリ："
    },
    {
      "indent": 3,
      "text": "- read-notify access for securityModel USM, securityLevel \"noAuthNoPriv\" on behalf of securityNames that belong to the group \"initial\" to the <restricted> MIB view in the default context with contextName \"\".",
      "ja": "- read-notify securitymodel usm、securitylevel \"noauthnopriv\" contextName \"\"を使用して、デフォルトコンテキストで<rimitided> mibビューに「初期」に属するSecurityNamesに代わって \"noauthnopriv\"。"
    },
    {
      "indent": 3,
      "text": "- read-write-notify access for securityModel USM, securityLevel \"authNoPriv\" on behalf of securityNames that belong to the group \"initial\" to the <internet> MIB view in the default context with contextName \"\".",
      "ja": "- contextName \"\"を使用してデフォルトのコンテキストで<internet> mibビューに「initert> mibビュー」に属するセキュリティ名に代わって、securitymodel usmのread-write-notifyアクセス、securitylevel \"authnopriv\"。"
    },
    {
      "indent": 3,
      "text": "- if privacy is supported, read-write-notify access for securityModel USM, securityLevel \"authPriv\" on behalf of securityNames that belong to the group \"initial\" to the <internet> MIB view in the default context with contextName \"\".",
      "ja": "- プライバシーがサポートされている場合は、SecurityModel USMのRead-Write-Notify Access、ContextName \"\"を使用してデフォルトコンテキストで<インターネット> MIBビューに「初期」に属するSecurityNamesに代わって、SecurityLevel \"AuthPriv\"。"
    },
    {
      "indent": 3,
      "text": "That translates into the following entries in the vacmAccessTable.",
      "ja": "これは、vacmacesstableの次のエントリに変換されます。"
    },
    {
      "indent": 3,
      "text": "- One entry to be used for unauthenticated access (noAuthNoPriv):",
      "ja": "- 認可されていないアクセスに使用される1つのエントリ（noauthnopriv）："
    },
    {
      "indent": 5,
      "text": "vacmGroupName                    \"initial\"\nvacmAccessContextPrefix          \"\"\nvacmAccessSecurityModel          3 (USM)\nvacmAccessSecurityLevel          noAuthNoPriv\nvacmAccessContextMatch           exact\nvacmAccessReadViewName           \"restricted\"\nvacmAccessWriteViewName          \"\"\nvacmAccessNotifyViewName         \"restricted\"\nvacmAccessStorageType            anyValidStorageType\nvacmAccessStatus                 active",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "- One entry to be used for authenticated access (authNoPriv) with optional privacy (authPriv):",
      "ja": "- オプションのプライバシー（AuthPRIV）を備えた認証アクセス（authnopriv）に使用される1つのエントリ："
    },
    {
      "indent": 5,
      "text": "vacmGroupName                    \"initial\"\nvacmAccessContextPrefix          \"\"\nvacmAccessSecurityModel          3 (USM)\nvacmAccessSecurityLevel          authNoPriv\nvacmAccessContextMatch           exact\nvacmAccessReadViewName           \"internet\"\nvacmAccessWriteViewName          \"internet\"\nvacmAccessNotifyViewName         \"internet\"\nvacmAccessStorageType            anyValidStorageType\nvacmAccessStatus                 active",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5) Two MIB views, of which the second one depends on the security configuration.",
      "ja": "5) 2つのMIBビューは、2つ目のMIBビューがセキュリティ構成に依存します。"
    },
    {
      "indent": 3,
      "text": "- One view, the <internet> view, for authenticated access:",
      "ja": "- 認証されたアクセスのための1つのビュー、<インターネット>ビュー："
    },
    {
      "indent": 6,
      "text": "- the <internet> MIB view is the following subtree: \"internet\" (subtree 1.3.6.1)",
      "ja": "- <インターネット> MIBビューは次のサブツリーです：「インターネット」（サブツリー1.3.6.1）"
    },
    {
      "indent": 3,
      "text": "- A second view, the <restricted> view, for unauthenticated access. This view is configured according to the selected security configuration:",
      "ja": "- 2番目のビュー、<restrited>ビュー、認識されていないアクセス。このビューは、選択したセキュリティ構成に従って構成されています。"
    },
    {
      "indent": 6,
      "text": "- For the initial-no-access-configuration there is no default initial configuration, so no MIB views are pre-scribed.",
      "ja": "- 初期のないアクセス構成の場合、デフォルトの初期構成はないため、MIBビューは事前に解決されません。"
    },
    {
      "indent": 6,
      "text": "- For the initial-semi-secure-configuration:",
      "ja": "- 初期のセミセキュアコンフィグレーザーの場合："
    },
    {
      "indent": 9,
      "text": "the <restricted> MIB view is the union of these subtrees:\n(a) \"system\"       (subtree 1.3.6.1.2.1.1)      [RFC1907]\n(b) \"snmp\"         (subtree 1.3.6.1.2.1.11)     [RFC1907]\n(c) \"snmpEngine\"   (subtree 1.3.6.1.6.3.10.2.1) [RFC2571]\n(d) \"snmpMPDStats\" (subtree 1.3.6.1.6.3.11.2.1) [RFC2572]\n(e) \"usmStats\"     (subtree 1.3.6.1.6.3.15.1.1) [RFC2574]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "- For the initial-minimum-secure-configuration:",
      "ja": "- 初期最小セキュアコンフィグレーザーの場合："
    },
    {
      "indent": 9,
      "text": "the <restricted> MIB view is the following subtree. \"internet\" (subtree 1.3.6.1)",
      "ja": "<rimted> mibビューは次のサブツリーです。「インターネット」（サブツリー1.3.6.1）"
    },
    {
      "indent": 3,
      "text": "This translates into the following \"internet\" entry in the vacmViewTreeFamilyTable:",
      "ja": "これは、vacmviewtreefamilytableの次の「インターネット」エントリに変換されます。"
    },
    {
      "indent": 2,
      "text": "                              minimum-secure      semi-secure\n                              ----------------    ---------------\nvacmViewTreeFamilyViewName    \"internet\"          \"internet\"\nvacmViewTreeFamilySubtree     1.3.6.1             1.3.6.1\nvacmViewTreeFamilyMask        \"\"                  \"\"\nvacmViewTreeFamilyType        1 (included)        1 (included)\nvacmViewTreeFamilyStorageType anyValidStorageType anyValidStorageType\nvacmViewTreeFamilyStatus      active              active",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In addition it translates into the following \"restricted\" entries in the vacmViewTreeFamilyTable:",
      "ja": "さらに、vacmviewtreefamilytableの次の「制限付き」エントリに変換されます。"
    },
    {
      "indent": 2,
      "text": "                              minimum-secure      semi-secure\n                              ----------------    ---------------\nvacmViewTreeFamilyViewName    \"restricted\"        \"restricted\"\nvacmViewTreeFamilySubtree     1.3.6.1             1.3.6.1.2.1.1\nvacmViewTreeFamilyMask        \"\"                  \"\"\nvacmViewTreeFamilyType        1 (included)        1 (included)\nvacmViewTreeFamilyStorageType anyValidStorageType anyValidStorageType\nvacmViewTreeFamilyStatus      active              active",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "vacmViewTreeFamilyViewName                        \"restricted\"\nvacmViewTreeFamilySubtree                         1.3.6.1.2.1.11\nvacmViewTreeFamilyMask                            \"\"\nvacmViewTreeFamilyType                            1 (included)\nvacmViewTreeFamilyStorageType                     anyValidStorageType\nvacmViewTreeFamilyStatus                          active",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "vacmViewTreeFamilyViewName                        \"restricted\"\nvacmViewTreeFamilySubtree                         1.3.6.1.6.3.10.2.1\nvacmViewTreeFamilyMask                            \"\"\nvacmViewTreeFamilyType                            1 (included)\nvacmViewTreeFamilyStorageType                     anyValidStorageType\nvacmViewTreeFamilyStatus                          active",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "vacmViewTreeFamilyViewName                        \"restricted\"\nvacmViewTreeFamilySubtree                         1.3.6.1.6.3.11.2.1\nvacmViewTreeFamilyMask                            \"\"\nvacmViewTreeFamilyType                            1 (included)\nvacmViewTreeFamilyStorageType                     anyValidStorageType\nvacmViewTreeFamilyStatus                          active",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "vacmViewTreeFamilyViewName                        \"restricted\"\nvacmViewTreeFamilySubtree                         1.3.6.1.6.3.15.1.1\nvacmViewTreeFamilyMask                            \"\"\nvacmViewTreeFamilyType                            1 (included)\nvacmViewTreeFamilyStorageType                     anyValidStorageType\nvacmViewTreeFamilyStatus                          active",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "B. Change Log",
      "ja": "B.ログを変更します"
    },
    {
      "indent": 3,
      "text": "Changes made since RFC2275:",
      "ja": "RFC2275以降の変更："
    },
    {
      "indent": 3,
      "text": "- Added text to vacmSecurityToGroupStatus DESCRIPTION clause to clarify under which conditions an entry in the vacmSecurityToGroupTable can be made active. - Added REVISION clauses to MODULE-IDENTITY - Clarified text in vacmAccessTable DESCRIPTION clause. - Added a DEFVAL clause to vacmAccessContextMatch object. - Added missing columns in Appendix A and re-arranged for clarity. - Fixed oids in appendix A. - Use the PDU Class terminology instead of RFC1905 PDU types. - Added section 7.4 about access control to the MIB. - Fixed references to new/revised documents - Fix Editor contact information. - fixed spelling errors - removed one vacmAccesEntry from sample in appendix A. - made some more clarifications. - updated acknowledgement section.",
      "ja": "- vacmsecuritytogroupStatus説明句にテキストを追加して、vacmsecuritytogroutableのエントリをアクティブにする条件を明確にするために。 - モジュール同一性にリビジョン条項を追加 -  vacmaccesStable説明条項で明確にしたテキスト。-facmacessContextMatchオブジェクトにdefval句を追加しました。 - 付録Aに不足している列を追加し、明確に再配置しました。 - 付録AのOIDを修正しました。 -RFC1905 PDUタイプの代わりにPDUクラスの用語を使用します。-MIBへのアクセス制御に関するセクション7.4を追加しました。 - 新しい/改訂されたドキュメントへの参照を修正 - エディターの連絡先情報を修正します。 - スペルエラーを修正 - 付録Aのサンプルから1つのvacmacceententryを削除しました - さらに説明しました。 - 更新された確認セクション。"
    },
    {
      "indent": 0,
      "text": "C. Full Copyright Statement",
      "ja": "C.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（1999）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}