{
  "title": {
    "text": "RFC 2872 - Application and Sub Application Identity Policy Element for Use with RSVP",
    "ja": "RFC 2872 - RSVPで使用するアプリケーションおよびサブアプリケーションIDポリシーエレメント"
  },
  "number": 2872,
  "created_at": "2019-10-31 14:19:42.857980+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        Y. Bernet\nRequest for Comments: 2872                                  R. Pabbati\nCategory: Standards Track                                    Microsoft\n                                                             June 2000",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Application and Sub Application Identity Policy Element for\n                       Use with RSVP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Conventions used in this document",
      "ja": "この文書で使用されている表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "RSVP [RFC 2205] signaling messages typically include policy data objects, which in turn contain policy elements. Policy elements may describe user and/or application information, which may be used by RSVP aware network elements to apply appropriate policy decisions to a traffic flow. This memo details the usage of policy elements that provide application information.",
      "ja": "RSVP [RFC 2205]のシグナリングメッセージは、典型的には、順番に、ポリシー要素を含むポリシーデータオブジェクトを含みます。ポリシーエレメントは、トラフィックフローに適切なポリシー決定を適用するRSVPアウェアネットワーク要素によって使用され得る、ユーザ及び/又はアプリケーションの情報を記述してもよいです。このメモは、アプリケーションの情報を提供するポリシー要素の使用方法を詳しく説明しています。"
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1。概要"
    },
    {
      "indent": 3,
      "text": "RSVP aware network elements may act as policy enforcement points (PEPs). These work together with policy decision points (PDPs) to enforce QoS policy. Briefly, PEPs extract policy information from RSVP signaling requests and compare the information against information stored by a PDP in a (possibly remotely located) policy database or directory. A policy decision is made based on the results of the comparison.",
      "ja": "RSVP対応のネットワーク要素は、ポリシー実施ポイント（のPEP）として作用することができます。これらは、QoSポリシーを適用するポリシー決定ポイント（PDPの）と連携して動作します。簡潔に述べると、のPEPは、RSVPシグナリング要求からポリシー情報を抽出し（おそらく遠隔に位置する）ポリシーデータベースまたはディレクトリにPDPによって格納された情報に対する情報を比較します。政策決定は、比較の結果に基づいて行われます。"
    },
    {
      "indent": 3,
      "text": "One type of policy information describes the application on behalf of which an RSVP signaling request is generated. When application policy information is available, network administrators are able to manage QoS based on application type. So, for example, a network administrator may establish a policy that prioritizes known mission-critical applications over games.",
      "ja": "ポリシー情報の一のタイプは、RSVPシグナリング要求が生成されるの代わりにアプリケーションを記述する。アプリケーションポリシー情報が利用可能な場合、ネットワーク管理者は、アプリケーションの種類に基づいてQoSを管理することができます。したがって、たとえば、ネットワーク管理者は、ゲームオーバー、既知のミッションクリティカルなアプリケーションの優先順位を付けポリシーを確立することができます。"
    },
    {
      "indent": 3,
      "text": "This memo describes a structure for a policy element that can be used to identify application traffic flows. The policy element includes a number of attributes, one of which is a policy locator. This policy locator includes the following hierarchically ordered sub-elements (in descending levels of hierarchy):",
      "ja": "このメモは、アプリケーショントラフィックフローを識別するために使用できるポリシー要素の構造が記載されています。ポリシーエレメントは、ポリシー・ロケータであるそのうちの一つの属性の数を含みます。このポリシーロケータは、（階層のレベルの降順で）次の階層的に順序付けられたサブ要素が含まれています。"
    },
    {
      "indent": 6,
      "text": "1. identifier that uniquely identifies the application vendor 2. identifier of the application 3. version number of the application 4. sub-application identifier",
      "ja": "一意のアプリケーション4.サブアプリケーション識別子のアプリケーション3.バージョン番号のアプリケーションベンダ2識別子を識別する1識別子"
    },
    {
      "indent": 3,
      "text": "An arbitrary number of sub-application identifiers may be included in the policy locator. An example of such an identifier is 'print transaction'.",
      "ja": "サブアプリケーション識別子の任意の数は、ポリシーロケータに含まれていてもよいです。このような識別子の例は、「プリント取引」です。"
    },
    {
      "indent": 3,
      "text": "This memo specifies the structure of the application policy element and proposes keywords for the sub-elements at each level of the hierarchy. It does not enumerate specific values for the sub-elements: such an enumeration is beyond the scope of this memo.",
      "ja": "このメモは、アプリケーションポリシー要素の構造を指定し、階層の各レベルでのサブエレメントのキーワードを提案しています。これは、サブ要素の特定の値を列挙しない：そのような列挙は、このメモの範囲を超えています。"
    },
    {
      "indent": 0,
      "text": "2. Simple Application Identity Policy Element Structure",
      "section_title": true,
      "ja": "2.簡単なアプリケーションIDポリシー要素の構造"
    },
    {
      "indent": 3,
      "text": "General application identity policy elements are defined in [RFC2752]. These are policy elements with a P-type of AUTH_APP. Following the policy element header is a list of authentication attributes.",
      "ja": "一般的なアプリケーションアイデンティティ方針要素は[RFC2752]で定義されています。これらはAUTH_APPのP型とポリシー要素です。ポリシー要素ヘッダーに続いて、認証属性のリストです。"
    },
    {
      "indent": 3,
      "text": "The first authentication attribute is of the A-type POLICY_LOCATOR. The sub-type of the POLICY_LOCATOR attribute is of type ASCII_DN [RFC1779] or UNICODE_DN. The actual attribute data is formatted as an X.500 distinguished name (DN), representing a globally unique identifier, the application, version number and sub-application in a hierarchical structure. The POLICY_LOCATOR attribute contains keywords as described in section 2. For further details on the format of the POLICY_LOCATOR attribute, see [RFC2752].",
      "ja": "最初の認証属性はA型POLICY_LOCATORです。 POLICY_LOCATOR属性のサブタイプは、タイプASCII_DN [RFC1779]またはUNICODE_DNです。実際の属性データは、階層構造内のグローバル一意識別子、アプリケーション、バージョン番号とサブアプリケーションを表す、X.500識別名（DN）としてフォーマットされます。 POLICY_LOCATOR属性はPOLICY_LOCATOR属性のフォーマットの詳細についてはセクション2で説明したようにキーワードが含まれている、[RFC2752]を参照します。"
    },
    {
      "indent": 3,
      "text": "The second authentication attribute is of the A-type CREDENTIAL. The sub-type of the CREDENTIAL attribute is of type ASCII_ID or UNICODE_ID. The actual attribute data is an ASCII or Unicode string representing the application name. This structure is illustrated in the following diagram:",
      "ja": "第二の認証属性は、A型の資格です。 CREDENTIAL属性のサブタイプは、タイプASCII_IDまたはUNICODE_IDです。実際の属性データは、アプリケーション名を表すASCIIまたはUnicode文字列です。この構造は、以下の図に示されています。"
    },
    {
      "indent": 6,
      "text": "         0              1               2               3\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    PE Length (8)              |   P-type = AUTH_APP           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Attribute Length           |   A-type =    |  Sub-type =   |\n|                               | POLICY_LOCATOR|   ASCII_DN    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Application policy locator attribute data in X.500 DN format  |\n|                         (see below)                           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Attribute Length           |   A-type =    |  Sub-type =   |\n|                               |   CREDENTIAL  |   ASCII_ID    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Application name as ASCII string              |\n|                         (e.g. SAP.EXE)                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The following keywords are recommended although others MAY be used:",
      "ja": "他の人が使用してもよいが、次のキーワードをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Key  Attribute\n--------------\nGUID Globally Unique Identifier (optional)\nAPP  Application Name\nVER  Application Version Number\nSAPP Sub Application (optional)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The following are examples of conformant policy locators:",
      "ja": "次準拠ポリシーロケータの例は以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "\"APP=SAP, VER=1.1, SAPP=Print\"",
      "ja": "\"APP = SAP、VER = 1.1 = SAPPを印刷します\""
    },
    {
      "indent": 3,
      "text": "\"GUID=http://www.microsoft.com/apps, APP=MyApplication, VER=1.2.3\"",
      "ja": "\"GUID =のhttp：//www.microsoft.com/apps、APP = MyApplicationを、VER = 1.2.3\""
    },
    {
      "indent": 3,
      "text": "The APP, VER and SAPP attributes SHOULD describe the application to a human reader in as unique and unambiguous a way as possible. The GUID attribute MAY be used when absolute uniqueness of application identification is required and its contents MUST be an identifier from a globally-unique source (e.g. domain names as assigned by the corresponding registration authorities). Note that publication of the chosen identifiers in a suitable format is strongly encouraged.",
      "ja": "APP、VERとSAPPは、できるだけユニークかつ明白な方法で人間の読者にアプリケーションを記述するべき属性。アプリケーション識別の絶対的な一意性が要求される場合にGUID属性を使用することができ、その内容は、グローバルに一意なソースからの識別子（対応する登録機関によって割り当てられた、例えば、ドメイン名）でなければなりません。適したフォーマットで選ばれた識別子のパブリケーションが強く推奨されていることに注意してください。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The proposed simple policy element does not guarantee that element is indeed associated with the application it claims to be associated with. In order to provide such guarantees, it is necessary to sign applications. Signed application policy elements may be proposed at a future date. Note that, typically, the application policy element will be included in an RSVP message with an encrypted and authenticated user policy element. A level of security is provided by trusting the application policy element only if the user policy element is trusted.",
      "ja": "提案されたシンプルなポリシー要素は、その要素が実際にそれが関連付けられたことを主張したアプリケーションに関連付けられている保証するものではありません。そのような保証を提供するためには、アプリケーションに署名する必要があります。署名されたアプリケーションのポリシー要素は将来の日付で提案することができます。なお、一般的に、アプリケーションポリシー要素は、暗号化および認証されたユーザポリシー要素とRSVPメッセージに含まれます。セキュリティのレベルは、ユーザーのポリシー要素が信頼されている場合にのみ、アプリケーションポリシー要素を信頼することにより提供されます。"
    },
    {
      "indent": 3,
      "text": "All RSVP integrity considerations apply to the message containing the application policy element.",
      "ja": "すべてのRSVPの整合性の考慮事項は、アプリケーションポリシー要素を含むメッセージに適用されます。"
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "ja": "4.参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2205] Braden, R., Zhang, L., Berson, L., Herzog, S. and S. Jamin, \"Resource Reservation Protocol (RSVP) - Version 1 Functional Specification\", RFC 2205, September 1997.",
      "ja": "[RFC2205]ブレーデン、R.、チャン、L.、ベルソン、L.、ヘルツォーク、S.とS.ヤミン、 \"リソース予約プロトコル（RSVP） - バージョン1の機能的な仕様\"、RFC 2205、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC1779] Kille, S., \"A String Representation of Distinguished Names\", RFC 1779, March 1995.",
      "ja": "[RFC1779] Kille、S.、 \"識別名の文字列表現\"、RFC 1779、1995年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2752] Yadav, S., Yavatkar, R., Pabbati, R,. Ford, P., Moore, T. and S. Herzog, \"Identity Representation for RSVP\", RFC 2752, January 2000.",
      "ja": "[RFC2752] Yadavが、S.、Yavatkar、R.、Pabbati、R ,.フォード、P.、ムーア、T.とS.ヘルツォーク、 \"RSVPのID表現\"、RFC 2752、2000年1月。"
    },
    {
      "indent": 3,
      "text": "[ASCII] Coded Character Set -- 7-Bit American Standard Code for Information Interchange, ANSI X3.4-1986.",
      "ja": "情報交換、ANSI X3.4-1986のために7ビットの米国標準コード -  [ASCII]文字セットをコード化されました。"
    },
    {
      "indent": 3,
      "text": "[UNICODE] The Unicode Consortium, \"The Unicode Standard, Version 2.0\", Addison-Wesley, Reading, MA, 1996.",
      "ja": "[UNICODE]ユニコードコンソーシアム、 \"Unicode規格、バージョン2.0\"、アディソン・ウェスリー、リーディング、MA、1996。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgments",
      "section_title": true,
      "ja": "5.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Tim Moore, Shai Mohaban, Andrew Smith, Ulrich Homann and other contributors to the IETF's RAP WG for their input.",
      "ja": "ティム・ムーア、シャイMohaban、アンドリュー・スミス、ウルリッヒ・ホーマンとその入力のためのIETFのRAP WGへの協力者に感謝します。"
    },
    {
      "indent": 0,
      "text": "6. Authors' Addresses",
      "section_title": true,
      "ja": "6.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Yoram Bernet Microsoft One Microsoft Way Redmond, WA 98052",
      "ja": "よらｍ べｒねｔ みｃろそｆｔ おね みｃろそｆｔ わｙ れｄもんｄ、 わ ９８０５２"
    },
    {
      "indent": 3,
      "text": "Phone: (425) 936-9568 EMail: yoramb@microsoft.com",
      "ja": "電話：（425）936-9568 Eメール：yoramb@microsoft.com"
    },
    {
      "indent": 3,
      "text": "Ramesh Pabbati One Microsoft Way Redmond, WA 98052",
      "ja": "ラメシュPabbati 1つのマイクロソフト道、レッドモンド、WA 98052"
    },
    {
      "indent": 3,
      "text": "EMail: rameshpa@microsoft.com",
      "ja": "メールアドレス：rameshpa@microsoft.com"
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "ja": "7.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}