{
  "title": {
    "text": "RFC 2842 - Capabilities Advertisement with BGP-4",
    "ja": "RFC 2842 - BGP-4と機能広告"
  },
  "number": 2842,
  "created_at": "2019-10-31 05:07:18.328936+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        R. Chandra\nRequest for Comments: 2842                        Redback Networks Inc.\nCategory: Standards Track                                    J. Scudder\n                                                          cisco Systems\n                                                               May 2000",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Capabilities Advertisement with BGP-4",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Currently BGP-4 [BGP-4] requires that when a BGP speaker receives an OPEN message with one or more unrecognized Optional Parameters, the speaker must terminate BGP peering. This complicates introduction of new capabilities in BGP.",
      "ja": "現在、BGP-4 [BGP-4]はBGPスピーカは、1つまたは複数の認識できないオプションパラメータでOPENメッセージを受信したとき、スピーカーがBGPピアリングを終了している必要があります。これは、BGPの新機能の導入を複雑にしています。"
    },
    {
      "indent": 3,
      "text": "This document defines new Optional Parameter, called Capabilities, that is expected to facilitate introduction of new capabilities in BGP by providing graceful capability advertisement without requiring that BGP peering be terminated.",
      "ja": "この文書では、それはBGPピアリングが終了することを必要とせず、優雅な機能広告を提供することにより、BGPの新機能の導入を促進することが期待され、機能と呼ばれる新しいオプション・パラメータを定義します。"
    },
    {
      "indent": 0,
      "text": "1. Overview of Operations",
      "section_title": true,
      "ja": "事業の概要"
    },
    {
      "indent": 3,
      "text": "When a BGP speaker that supports capabilities advertisement sends an OPEN message to its BGP peer, the message may include an Optional Parameter, called Capabilities. The parameter lists the capabilities supported by the speaker.",
      "ja": "能力の広告をサポートしているBGPスピーカは、そのBGPピアにOPENメッセージを送信すると、メッセージは、能力と呼ばれるオプションのパラメータを含むことができます。パラメータは、スピーカーでサポートされている機能を示しています。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker determines the capabilities supported by its peer by examining the list of capabilities present in the Capabilities Optional Parameter carried by the OPEN message that the speaker receives from the peer.",
      "ja": "BGPスピーカーはスピーカーがピアから受け取るOPENメッセージによって運ば能力任意パラメータに存在する機能のリストを調べることによって、そのピアでサポートされている機能を決定します。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker that supports a particular capability may use this capability with its peer after the speaker determines (as described above) that the peer supports this capability.",
      "ja": "（上記のように）スピーカがピアがこの機能をサポートすることを決定した後に特定の機能をサポートするBGPスピーカは、そのピアとこの機能を使用することができます。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker determines that its peer doesn't support capabilities advertisement, if in response to an OPEN message that carries the Capabilities Optional Parameter, the speaker receives a NOTIFICATION message with the Error Subcode set to Unsupported Optional Parameter. In this case the speaker should attempt to re-establish a BGP connection with the peer without sending to the peer the Capabilities Optional Parameter.",
      "ja": "BGPスピーカは機能オプションのパラメータを運ぶOPENメッセージに応答して、スピーカーがサポートされていないオプションのパラメータに設定エラーサブコードでNOTIFICATIONメッセージを受信した場合、そのピアが、能力の広告をサポートしていないと判断しました。この場合、スピーカーはピアに能力任意パラメータを送信せずに、ピアとのBGP接続を再確立しようとしなければなりません。"
    },
    {
      "indent": 3,
      "text": "If a BGP speaker that supports a certain capability determines that its peer doesn't support this capability, the speaker may send a NOTIFICATION message to the peer, and terminate peering. The Error Subcode in the message is set to Unsupported Capability. The message should contain the capability (capabilities) that causes the speaker to send the message. The decision to send the message and terminate peering is local to the speaker. Such peering should not be re-established automatically.",
      "ja": "特定の機能をサポートしているBGPスピーカは、そのピアがこの機能をサポートしていないと判断された場合、スピーカーがピアに通知メッセージを送信し、ピアリングを終了することができます。メッセージ中のエラーサブコードはサポートされていない機能に設定されています。メッセージは、メッセージを送信するために、スピーカーの原因となる機能（能力）が含まれている必要があります。メッセージを送信し、ピアリングを終了するという決定は、スピーカーにローカルです。このようなピアリングは自動的に再確立するべきではありません。"
    },
    {
      "indent": 0,
      "text": "2. Capabilities Optional Parameter (Parameter Type 2):",
      "section_title": true,
      "ja": "2.能力任意パラメータ（パラメータタイプ2）："
    },
    {
      "indent": 3,
      "text": "This is an Optional Parameter that is used by a BGP speaker to convey to its BGP peer the list of capabilities supported by the speaker.",
      "ja": "これは、BGPスピーカーによってサポートされる機能のリストをピアに伝えるためにBGPスピーカーによって使用されるオプションのパラメータです。"
    },
    {
      "indent": 3,
      "text": "The parameter contains one or more triples <Capability Code, Capability Length, Capability Value>, where each triple is encoded as shown below:",
      "ja": "パラメーターは、一つ以上のトリプル以下に示すように、各トリプルが符号化された<機能コード、機能長、能力値>を、含まれています。"
    },
    {
      "indent": 6,
      "text": "+------------------------------+\n| Capability Code (1 octet)    |\n+------------------------------+\n| Capability Length (1 octet)  |\n+------------------------------+\n| Capability Value (variable)  |\n+------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The use and meaning of these fields are as follows:",
      "ja": "次のようにこれらのフィールドを使用すると意味は以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "Capability Code:",
      "ja": "能力コード："
    },
    {
      "indent": 9,
      "text": "Capability Code is a one octet field that unambiguously identifies individual capabilities.",
      "ja": "能力コードは、明確に、個々の能力を特定する1つのオクテットのフィールドです。"
    },
    {
      "indent": 6,
      "text": "Capability Length:",
      "ja": "能力の長さ："
    },
    {
      "indent": 9,
      "text": "Capability Length is a one octet field that contains the length of the Capability Value field in octets.",
      "ja": "能力の長さはオクテット単位で能力値フィールドの長さを含む1つのオクテットのフィールドです。"
    },
    {
      "indent": 6,
      "text": "Capability Value:",
      "ja": "能力値："
    },
    {
      "indent": 9,
      "text": "Capability Value is a variable length field that is interpreted according to the value of the Capability Code field.",
      "ja": "能力値は、機能コード・フィールドの値に応じて解釈される可変長フィールドです。"
    },
    {
      "indent": 3,
      "text": "A particular capability, as identified by its Capability Code, may occur more than once within the Optional Parameter.",
      "ja": "特定の機能は、その能力コードにより識別されるように、任意パラメータ内で複数回発生する可能性があります。"
    },
    {
      "indent": 0,
      "text": "3. Extensions to Error Handling",
      "section_title": true,
      "ja": "エラー処理する3.拡張機能"
    },
    {
      "indent": 3,
      "text": "This document defines new Error Subcode - Unsupported Capability. The value of this Subcode is 7. The Data field in the NOTIFICATION message lists the set of capabilities that cause the speaker to send the message. Each such capability is encoded the same way as it was encoded in the received OPEN message.",
      "ja": "サポートされていない機能 - この文書は、新しいエラーサブコードを定義します。このサブコードの値は、通知メッセージにデータフィールドは、メッセージを送信するためにスピーカーを引き起こす一連の機能を一覧表示します7です。各そのような能力は、それが受信したオープンメッセージに符号化されたのと同じ方法で符号化されます。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "Section 4 defines a Capability Optional Parameter along with an Capability Code field. IANA is expected to create and maintain the registry for Capability Code values. Capability Code value 0 is reserved. Capability Code values 1 through 63 are to be assigned by IANA using the \"IETF Consensus\" policy defined in RFC2434. Capability Code values 64 through 127 are to be assigned by IANA, using the \"First Come First Served\" policy defined in RFC2434. Capability Code values 128 through 255 are for \"Private Use\" as defined in RFC2434.",
      "ja": "第4章では能力コードフィールドとともに能力任意パラメータを定義します。 IANAは能力コード値のためのレジストリを作成し、維持することが期待されます。能力コード値0は予約されています。機能コード値1〜63は、RFC2434で定義された「IETFコンセンサス」ポリシーを使用して、IANAによって割り当てられるべきです。機能コード127を介して、64がRFC2434で定義された「まず最初に配信是非」ポリシーを使用して、IANAによって割り当てられる値。能力コードは、128〜255は、RFC2434で定義された「私用」のためにされている値。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This extension to BGP does not change the underlying security issues inherent in the existing BGP [Heffernan].",
      "ja": "BGPへのこの拡張は、既存のBGP [Heffernanの]に固有の基本的なセキュリティ問題を変更しません。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank members of the IDR Working Group for their review and comments.",
      "ja": "作者は彼らのレビューとコメントをIDR作業部会のメンバーに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 3,
      "text": "[BGP-4] Rekhter, Y. and T. Li, \"A Border Gateway Protocol 4 (BGP-4)\", RFC 1771, March 1995.",
      "ja": "[BGP-4] Rekhter、Y.、およびT.李、 \"ボーダーゲートウェイプロトコル4（BGP-4）\"、RFC 1771、1995年3月。"
    },
    {
      "indent": 3,
      "text": "[Heffernan] Heffernan, A., \"Protection of BGP Sessions via the TCP MD5 Signature Option\", RFC 2385, August 1998.",
      "ja": "[Heffernanの] Heffernanの、A.、 \"TCP MD5署名オプションを使用してBGPセッションの保護\"、RFC 2385、1998年8月。"
    },
    {
      "indent": 0,
      "text": "8. Authors' Addresses",
      "section_title": true,
      "ja": "8.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ravi Chandra Redback Networks Inc. 350, Holger Way San Jose, CA 95134",
      "ja": "ラヴィチャンドラレッドバックネットワークス350、ホルガー・ウェイサンノゼ、CA 95134"
    },
    {
      "indent": 3,
      "text": "EMail: rchandra@redback.com",
      "ja": "メールアドレス：rchandra@redback.com"
    },
    {
      "indent": 3,
      "text": "John G. Scudder Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134",
      "ja": "ジョン・G.スカダーシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、CA 95134"
    },
    {
      "indent": 3,
      "text": "EMail: jgs@cisco.com",
      "ja": "メールアドレス：jgs@cisco.com"
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "ja": "9.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}