{
  "title": {
    "text": "RFC 2729 - Taxonomy of Communication Requirements for Large-scale Multicast Applications",
    "ja": "RFC 2729 - 大規模なマルチキャストアプリケーションの通信要件の分類"
  },
  "number": 2729,
  "created_at": "2024-02-04 13:17:20.609819+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          P. Bagnall\nRequest for Comments: 2729                                     R. Briscoe\nCategory: Informational                                        A. Poppitt\n                                                                       BT\n                                                            December 1999",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "Taxonomy of Communication Requirements for Large-scale Multicast Applications",
      "ja": "大規模なマルチキャストアプリケーションの通信要件の分類"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（1999）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The intention of this memo is to define a classification system for the communication requirements of any large-scale multicast application (LSMA). It is very unlikely one protocol can achieve a compromise between the diverse requirements of all the parties involved in any LSMA. It is therefore necessary to understand the worst-case scenarios in order to minimize the range of protocols needed. Dynamic protocol adaptation is likely to be necessary which will require logic to map particular combinations of requirements to particular mechanisms. Standardizing the way that applications define their requirements is a necessary step towards this. Classification is a first step towards standardization.",
      "ja": "このメモの意図は、大規模なマルチキャストアプリケーション（LSMA）の通信要件の分類システムを定義することです。1つのプロトコルが、あらゆるLSMAに関与するすべての関係者の多様な要件間の妥協を達成できる可能性は非常に低いです。したがって、必要なプロトコルの範囲を最小限に抑えるために、最悪のシナリオを理解する必要があります。特定の要件の組み合わせを特定のメカニズムにマッピングするためにロジックが必要な動的プロトコル適応が必要になる可能性があります。アプリケーションが要件を定義する方法を標準化することは、これに向けて必要なステップです。分類は、標準化に向けた最初のステップです。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction . . . . . . . . . . . . . . . . . . . . . . 2\n2. Definitions of Sessions. . . . . . . . . . . . . . . . . 3\n3. Taxonomy . . . . . . . . . . . . . . . . . . . . . . . . 4\n  3.1. Summary of Communications Parameters . . . . . . . . 4\n  3.2. Definitions, types and strictest requirements. . . . 5\n    3.2.1. Types  . . . . . . . . . . . . . . . . . . . . . 6\n    3.2.2. Reliability  . . . . . . . . . . . . . . . . . . 7\n      3.2.2.1. Packet Loss  . . . . . . . . . . . . . . . . 7\n      3.2.2.2. Component Reliability  . . . . . . . . . . . 8\n    3.2.3. Ordering . . . . . . . . . . . . . . . . . . . . 9\n    3.2.4. Timeliness . . . . . . . . . . . . . . . . . . . 9\n    3.2.5. Session Control  . . . . . . . . . . . . . . . .13\n    3.2.6. Session Topology . . . . . . . . . . . . . . . .16\n    3.2.7. Directory  . . . . . . . . . . . . . . . . . . .17\n    3.2.8. Security . . . . . . . . . . . . . . . . . . . .17\n      3.2.8.1. Security Dynamics  . . . . . . . . . . . . .23\n    3.2.9. Payment & Charging . . . . . . . . . . . . . . .24\n4. Security Considerations  . . . . . . . . . . . . . . . .25\n5. References   . . . . . . . . . . . . . . . . . . . . . .25\n6. Authors' Addresses . . . . . . . . . . . . . . . . . . .26\n7. Full Copyright Statement . . . . . . . . . . . . . . . .27",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This taxonomy consists of a large number of parameters that are considered useful for describing the communication requirements of LSMAs. To describe a particular application, each parameter would be assigned a value. Typical ranges of values are given wherever possible. Failing this, the type of any possible values is given. The parameters are collected into ten or so higher level categories, but this is purely for convenience.",
      "ja": "この分類法は、LSMAの通信要件を説明するのに役立つと考えられる多数のパラメーターで構成されています。特定のアプリケーションを説明するために、各パラメーターに値が割り当てられます。可能な限り、値の典型的な範囲が与えられます。これに失敗すると、考えられる値のタイプが与えられます。パラメーターは10かそこらの高いレベルのカテゴリに収集されますが、これは純粋に便利なものです。"
    },
    {
      "indent": 3,
      "text": "The parameters are pitched at a level considered meaningful to application programmers. However, they describe communications not applications - the terms '3D virtual world', or 'shared TV' might imply communications requirements, but they don't accurately describe them. Assumptions about the likely mechanism to achieve each requirement are avoided where possible.",
      "ja": "パラメーターは、アプリケーションプログラマーにとって意味のあるレベルでピッチングされます。ただし、アプリケーションではなく通信を説明します - 「3D仮想世界」という用語、または「共有TV」は通信要件を暗示する可能性がありますが、それらは正確に説明していません。各要件を達成する可能性のあるメカニズムに関する仮定は、可能であれば避けられます。"
    },
    {
      "indent": 3,
      "text": "While the parameters describe communications, it will be noticed that few requirements concerning routing etc. are apparent. This is because applications have few direct requirements on these second order aspects of communications. Requirements in these areas will have to be inferred from application requirements (e.g. latency).",
      "ja": "パラメーターは通信を説明していますが、ルーティングなどに関する要件はほとんどないことが明らかになります。これは、アプリケーションが通信のこれらの2次の側面に関する直接的な要件がほとんどないためです。これらの領域の要件は、アプリケーション要件（レイテンシなど）から推測する必要があります。"
    },
    {
      "indent": 3,
      "text": "The taxonomy is likely to be useful in a number of ways:",
      "ja": "分類法は、さまざまな方法で役立つ可能性があります。"
    },
    {
      "indent": 3,
      "text": "1. Most simply, it can be used as a checklist to create a requirements statement for a particular LSMA. Example applications will be classified [bagnall98] using the taxonomy in order to exercise (and improve) it",
      "ja": "1. 最も簡単に言えば、特定のLSMAの要件ステートメントを作成するためのチェックリストとして使用できます。サンプルアプリケーションは、それを行使する（および改善）するために分類法を使用して分類されます[Bagnall98]"
    },
    {
      "indent": 3,
      "text": "2. Because strictest requirement have been defined for many parameters, it will be possible to identify worst case scenarios for the design of protocols",
      "ja": "2. 多くのパラメーターに対して最も厳格な要件が定義されているため、プロトコルの設計の最悪のシナリオを特定することが可能です"
    },
    {
      "indent": 3,
      "text": "3. Because the scope of each parameter has been defined (per session, per receiver etc.), it will be possible to highlight where heterogeneity is going to be most marked",
      "ja": "3. 各パラメーターの範囲が定義されているため（セッションごと、レシーバーごとなど）、不均一性が最もマークされる場所を強調表示することが可能です"
    },
    {
      "indent": 3,
      "text": "4. It is a step towards standardization of the way LSMAs define their communications requirements. This could lead to standard APIs between applications and protocol adaptation middleware",
      "ja": "4. これは、LSMAが通信要件を定義する方法の標準化に向けた一歩です。これにより、アプリケーションとプロトコル適応ミドルウェアの間の標準APIにつながる可能性があります"
    },
    {
      "indent": 3,
      "text": "5. Identification of limitations in current Internet technology for LSMAs to be added to the LSMA limitations memo [limitations]",
      "ja": "5. LSMAがLSMA制限メモに追加するための現在のインターネットテクノロジーの制限の特定[制限]"
    },
    {
      "indent": 3,
      "text": "6. Identification of gaps in Internet Engineering Task Force (IETF) working group coverage",
      "ja": "6. インターネットエンジニアリングタスクフォース（IETF）ワーキンググループのカバレッジにおけるギャップの識別"
    },
    {
      "indent": 3,
      "text": "This approach is intended to complement that used where application scenarios for Distributed Interactive Simulation (DIS) are proposed in order to generate network design metrics (values of communications parameters). Instead of creating the communications parameters from the applications, we try to imagine applications that might be enabled by stretching communications parameters.",
      "ja": "このアプローチは、ネットワーク設計メトリック（通信パラメーターの値）を生成するために、分散インタラクティブシミュレーション（DIS）のアプリケーションシナリオが提案されている場所を補完することを目的としています。アプリケーションから通信パラメーターを作成する代わりに、通信パラメーターを伸ばすことで有効になる可能性のあるアプリケーションを想像しようとします。"
    },
    {
      "indent": 0,
      "text": "2. Definition of Sessions",
      "section_title": true,
      "ja": "2. セッションの定義"
    },
    {
      "indent": 3,
      "text": "The following terms have no agreed definition, so they will be defined for this document.",
      "ja": "次の用語には合意された定義がないため、このドキュメントでは定義されます。"
    },
    {
      "indent": 3,
      "text": "Session a happening or gathering consisting of flows of information related by a common description that persists for a non-trivial time (more than a few seconds) such that the participants (be they humans or applications) are involved and interested at intermediate times. A session may be defined recursively as a super-set of other sessions.",
      "ja": "セッションAの発生または収集は、参加者（人間であろうとアプリケーションであろうと）が関与し、中間時間に関心があるように、非自明な時間（数秒以上）に持続する一般的な説明に関連する情報の流れからなる。セッションは、他のセッションのスーパーセットとして再帰的に定義される場合があります。"
    },
    {
      "indent": 3,
      "text": "Secure session a session with restricted access",
      "ja": "制限されたアクセスを備えたセッションセッション"
    },
    {
      "indent": 3,
      "text": "A session or secure session may be a sub and/or super set of a multicast group. A session can simultaneously be both a sub and a super-set of a multicast group by spanning a number of groups while time-sharing each group with other sessions.",
      "ja": "セッションまたは安全なセッションは、マルチキャストグループのサブおよび/またはスーパーセットです。セッションは、各グループを他のセッションでタイムシェア化しながら、多くのグループにまたがることにより、マルチキャストグループのサブとスーパーセットの両方であることが同時に行われます。"
    },
    {
      "indent": 0,
      "text": "3. Taxonomy",
      "section_title": true,
      "ja": "3. 分類"
    },
    {
      "indent": 0,
      "text": "3.1 Summary of Communications Parameters",
      "section_title": true,
      "ja": "3.1 通信パラメーターの概要"
    },
    {
      "indent": 3,
      "text": "Before the communications parameters are defined, typed and given worst-case values, they are simply listed for convenience. Also for convenience they are collected under classification headings.",
      "ja": "通信パラメーターが定義され、入力され、最悪の値が与えられる前に、それらは単純に便利にリストされています。また、便利なため、それらは分類見出しの下で収集されます。"
    },
    {
      "indent": 6,
      "text": "Reliability  . . . . . . . . . . . . . . . . . . . . . . 3.2.1\n   Packet loss . . . . . . . . . . . . . . . . . . . . 3.2.1.1\n      Transactional\n      Guaranteed\n      Tolerated loss\n      Semantic loss\n   Component reliability . . . . . . . . . . . . . . . 3.2.1.2\n      Setup fail-over time\n      Mean time between failures\n      Fail over time during a stream\nOrdering . . . . . . . . . . . . . . . . . . . . . . . . 3.2.2\n   Ordering type\nTimeliness . . . . . . . . . . . . . . . . . . . . . . . 3.2.3\n   Hard Realtime\n   Synchronicity\n   Burstiness\n   Jitter\n   Expiry\n   Latency\n   Optimum bandwidth\n   Tolerable bandwidth\n   Required by time and tolerance\n   Host performance\n   Fair delay\n   Frame size\n   Content size\nSession Control  . . . . . . . . . . . . . . . . . . . . 3.2.4\n   Initiation\n   Start time\n   End time\n   Duration\n   Active time\n   Session Burstiness\n   Atomic join\n   Late join allowed ?\n         Temporary leave allowed ?\n   Late join with catch-up allowed ?\n   Potential streams per session\n   Active streams per sessions\nSession Topology . . . . . . . . . . . . . . . . . . . . 3.2.5\n   Number of senders\n   Number of receivers\nDirectory  . . . . . . . . . . . . . . . . . . . . . . . 3.2.6\n   Fail-over time-out (see Reliability: fail-over time)\n   Mobility\nSecurity . . . . . . . . . . . . . . . . . . . . . . . . 3.2.7\n   Authentication strength\n   Tamper-proofing\n   Non-repudiation strength\n   Denial of service\n   Action restriction\n   Privacy\n   Confidentiality\n   Retransmit prevention strength\n   Membership criteria\n   Membership principals\n   Collusion prevention\n   Fairness\n   Action on compromise\nSecurity dynamics  . . . . . . . . . . . . . . . . . . . 3.2.8\n   Mean time between compromises\n   Compromise detection time limit\n   compromise recovery time limit\nPayment & Charging . . . . . . . . . . . . . . . . . . . 3.2.9\n   Total Cost\n   Cost per time\n   Cost per Mb",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.2 Definitions, types and strictest requirements",
      "section_title": true,
      "ja": "3.2 定義、タイプ、および最も厳格な要件"
    },
    {
      "indent": 3,
      "text": "The terms used in the above table are now defined for the context of this document. Under each definition, the type of their value is given and where possible worst-case values and example applications that would exhibit this requirement.",
      "ja": "上記の表で使用される用語は、このドキュメントのコンテキストに対して定義されています。各定義の下では、その値のタイプが与えられ、可能性のある最悪の値とこの要件を示すアプリケーションの例が与えられます。"
    },
    {
      "indent": 3,
      "text": "There is no mention of whether a communication is a stream or a discrete interaction. An attempt to use this distinction as a way of characterizing communications proved to be remarkably unhelpful and was dropped.",
      "ja": "通信がストリームであるか離散相互作用であるかについての言及はありません。コミュニケーションを特徴付ける方法としてこの区別を使用する試みは、著しく役に立たないことが判明し、削除されました。"
    },
    {
      "indent": 0,
      "text": "3.2.1 Types",
      "section_title": true,
      "ja": "3.2.1 種類"
    },
    {
      "indent": 3,
      "text": "Each requirement has a type. The following is a list of all the types used in the following definitions.",
      "ja": "各要件にはタイプがあります。以下は、次の定義で使用されるすべてのタイプのリストです。"
    },
    {
      "indent": 3,
      "text": "Application Benchmark",
      "ja": "アプリケーションベンチマーク"
    },
    {
      "indent": 6,
      "text": "This is some measure of the processor load of an application, in some architecture neutral unit. This is non-trivial since the processing an application requires may change radically with different hardware, for example, a video client with and without hardware support.",
      "ja": "これは、一部のアーキテクチャニュートラルユニットで、アプリケーションのプロセッサロードのある程度の尺度です。これは、アプリケーションが必要とする処理が異なるハードウェア、たとえばハードウェアサポートの有無にかかわらずビデオクライアントで根本的に変更される可能性があるため、非自明です。"
    },
    {
      "indent": 3,
      "text": "Bandwidth Measured in bits per second, or a multiple of.",
      "ja": "帯域幅は1秒あたり、または倍数で測定されます。"
    },
    {
      "indent": 3,
      "text": "Boolean",
      "ja": "ブールブーリアン"
    },
    {
      "indent": 3,
      "text": "Abstract Currency An abstract currency is one which is adjusted to take inflation into account. The simplest way of doing this is to use the value of a real currency on a specific date. It is effectively a way of assessing the cost of something in \"real terms\". An example might be 1970 US$. Another measure might be \"average man hours\".",
      "ja": "抽象通貨抽象通貨は、インフレを考慮に入れるように調整された通貨です。これを行う最も簡単な方法は、特定の日付で実際の通貨の値を使用することです。事実上、何かのコストを「実際の用語」で評価する方法です。例は1970 US $です。別の尺度は「平均的な男時間」かもしれません。"
    },
    {
      "indent": 3,
      "text": "Currency - current local",
      "ja": "通貨 - 現在のローカル"
    },
    {
      "indent": 3,
      "text": "Data Size",
      "ja": "データサイズ"
    },
    {
      "indent": 3,
      "text": "Date (time since epoch)",
      "ja": "日付（エポック以来の時刻）"
    },
    {
      "indent": 3,
      "text": "Enumeration",
      "ja": "列挙"
    },
    {
      "indent": 3,
      "text": "Fraction",
      "ja": "分数"
    },
    {
      "indent": 3,
      "text": "Identifiers A label used to distinguish different parts of a communication",
      "ja": "識別子通信のさまざまな部分を区別するために使用されるラベル"
    },
    {
      "indent": 3,
      "text": "Integer",
      "ja": "整数"
    },
    {
      "indent": 3,
      "text": "Membership list/rule",
      "ja": "メンバーシップリスト/ルール"
    },
    {
      "indent": 3,
      "text": "Macro A small piece of executable code used to describe policies",
      "ja": "マクロポリシーを説明するために使用される実行可能性コードの小さな部分"
    },
    {
      "indent": 3,
      "text": "Time",
      "ja": "時間"
    },
    {
      "indent": 0,
      "text": "3.2.2 Reliability",
      "section_title": true,
      "ja": "3.2.2 信頼性"
    },
    {
      "indent": 0,
      "text": "3.2.2.1 Packet Loss",
      "section_title": true,
      "ja": "3.2.2.1 パケットロス"
    },
    {
      "indent": 3,
      "text": "Transactional",
      "ja": "トランザクション"
    },
    {
      "indent": 6,
      "text": "When multiple operations must occur atomically, transactional communications guarantee that either all occur or none occur and a failure is flagged.",
      "ja": "複数の操作が原子的に発生する必要がある場合、トランザクション通信は、すべてが発生するか、何も発生しないことを保証し、障害がフラグを立てます。"
    },
    {
      "indent": 6,
      "text": "Type: Boolean Meaning: Transactional or Not transaction Strictest Requirement: Transactional Scope: per stream Example Application: Bank credit transfer, debit and credit must be atomic. NB: Transactions are potentially much more complex, but it is believed this is an application layer problem.",
      "ja": "タイプ：ブールの意味：トランザクションまたはトランザクションの厳格な要件：トランザクションスコープ：ストリームごとの例アプリケーション：銀行クレジット転送、デビット、クレジットは原子でなければなりません。NB：トランザクションは潜在的にはるかに複雑ですが、これはアプリケーションレイヤーの問題であると考えられています。"
    },
    {
      "indent": 3,
      "text": "Guaranteed",
      "ja": "保証されています"
    },
    {
      "indent": 6,
      "text": "Guarantees communications will succeed under certain conditions.",
      "ja": "コミュニケーションが特定の条件下で成功することを保証します。"
    },
    {
      "indent": 6,
      "text": "Type: Enumerated Meaning: Deferrable - if communication fails it will be deferred until a time when it will be successful. Guaranteed - the communication will succeed so long as all necessary components are working. No guarantee - failure will not be reported. Strictest Requirement: Deferrable Example Application: Stock quote feed - Guaranteed Scope: per stream NB: The application will need to set parameters to more fully define Guarantees, which the middleware may translate into, for example, queue lengths.",
      "ja": "タイプ：列挙された意味：延期可能 - 通信が失敗した場合、成功するまで延期されます。保証 - 必要なすべてのコンポーネントが機能している限り、通信は成功します。保証なし - 障害は報告されません。最も厳格な要件：延期可能な例アプリケーション：ストック引用符供給 - 保証範囲：ストリームごとのNB：アプリケーションは、パラメーターをより完全に定義するためにパラメーターを設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Tolerated loss",
      "ja": "容認された損失"
    },
    {
      "indent": 6,
      "text": "This specifies the proportion of data from a communication that can be lost before the application becomes completely unusable.",
      "ja": "これは、アプリケーションが完全に使用できなくなる前に失われる可能性のある通信からのデータの割合を指定します。"
    },
    {
      "indent": 6,
      "text": "Type: Fraction Meaning: fraction of the stream that can be lost Strictest Requirement: 0% Scope: per stream Example Application: Video - 20%",
      "ja": "タイプ：分数の意味：失われる可能性のあるストリームの割合で最も厳格な要件：0％スコープ：ストリームごとの例アプリケーション：ビデオ-20％"
    },
    {
      "indent": 3,
      "text": "Semantic loss",
      "ja": "セマンティック損失"
    },
    {
      "indent": 6,
      "text": "The application specifies how many and which parts of the communication can be discarded if necessary.",
      "ja": "アプリケーションは、必要に応じて通信の数とどの部分を破棄できるかを指定します。"
    },
    {
      "indent": 6,
      "text": "Type: Identifiers, name disposable application level frames Meaning: List of the identifiers of application frames which may be lost Strictest Requirement: No loss allowed Scope: per stream",
      "ja": "タイプ：識別子、名前の使い捨てアプリケーションレベルのフレームの意味：最も厳格な要件を失う可能性のあるアプリケーションフレームの識別子のリスト：損失なし範囲：ストリームあたり"
    },
    {
      "indent": 6,
      "text": "Example Application: Video feed - P frames may be lost, I frames not",
      "ja": "サンプルアプリケーション：ビデオフィード-Pフレームが失われる可能性があります、私はフレームではありません"
    },
    {
      "indent": 0,
      "text": "3.2.2.2. Component Reliability",
      "section_title": true,
      "ja": "3.2.2.2. コンポーネントの信頼性"
    },
    {
      "indent": 3,
      "text": "Setup Fail-over time",
      "ja": "セットアップフェールオーバー時間"
    },
    {
      "indent": 6,
      "text": "The time before a failure is detected and a replacement component is invoked. From the applications point of view this is the time it may take in exceptional circumstances for a channel to be set-up. It is not the \"normal\" operating delay before a channel is created.",
      "ja": "障害が検出され、交換コンポーネントが呼び出される前の時間。アプリケーションの観点からは、これはチャネルがセットアップされるために例外的な状況にかかるかもしれない時間です。チャネルが作成される前の「通常の」動作遅延ではありません。"
    },
    {
      "indent": 6,
      "text": "Type:                  Time\nStrictest Requirement: Web server - 1 second\nScope:                 per stream\nExample Application:   Name lookup - 5 seconds",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Mean time between failures",
      "ja": "平均故障間隔"
    },
    {
      "indent": 6,
      "text": "The mean time between two consecutive total failures of the channel.",
      "ja": "チャネルの2つの連続した総障害の間の平均時間。"
    },
    {
      "indent": 6,
      "text": "Type: Time Strictest Requirement: Indefinite Scope: per stream Example Application: Telephony - 1000 hours",
      "ja": "タイプ：時間厳密な要件：不定範囲：ストリームごとの例の例アプリケーション：テレフォニー-1000時間"
    },
    {
      "indent": 3,
      "text": "Fail over time during a stream",
      "ja": "ストリーム中に時間の経過とともに失敗します"
    },
    {
      "indent": 6,
      "text": "The time between a stream breaking and a replacement being set up.",
      "ja": "ストリーム破壊と交換の間の時間。"
    },
    {
      "indent": 6,
      "text": "Type: Time Strictest Requirement: Equal to latency requirement Scope: per stream Example Application: File Transfer - 10sec",
      "ja": "タイプ：最も厳密な要件：レイテンシー要件に等しい範囲：ストリームごとの例アプリケーション：ファイル転送-10秒"
    },
    {
      "indent": 0,
      "text": "3.2.3. Ordering",
      "section_title": true,
      "ja": "3.2.3. 注文"
    },
    {
      "indent": 3,
      "text": "Ordering type",
      "ja": "注文タイプ"
    },
    {
      "indent": 6,
      "text": "Specifies what ordering must be preserved for the application",
      "ja": "アプリケーションのために順序付けを保存する必要があるものを指定します"
    },
    {
      "indent": 6,
      "text": "Type:                  {\n                         Enumeration timing,\n                         Enumeration sequencing,\n                         Enumeration causality\n                       }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Meaning: Timing - the events are timestamped Global Per Sender none Sequencing - the events are sequenced in order of occurrence Global Per Sender none Causality - the events form a graph relating cause and effect Global Per Sender none Strictest Requirement: Global, Global, Global Scope: per stream Example Application: Game - { none, per sender, global } (to make sure being hit by bullet occurs after the shot is fired!)",
      "ja": "意味：タイミング - イベントはセンダーごとのタイムスタンプのグローバルシーケンスなし - イベントは発生の順にシーケンスされますセンダーごとのグローバルなしの因果関係 - イベントはセンダーごとのグローバルを形成します。：ストリームごとの例アプリケーション：ゲーム -  {なし、送信者、グローバル}（ショットが発射された後に弾丸に襲われることを確認するために！）"
    },
    {
      "indent": 0,
      "text": "3.2.4. Timeliness",
      "section_title": true,
      "ja": "3.2.4. 適時性"
    },
    {
      "indent": 3,
      "text": "Hard real- time",
      "ja": "ハードリアルタイム"
    },
    {
      "indent": 6,
      "text": "There is a meta-requirement on timeliness. If hard real-time is required then the interpretation of all the other requirements changes. Failures to achieve the required timeliness must be reported before the communication is made. By contrast soft real-time means that there is no guarantee that an event will occur in time. However statistical measures can be used to indicate the probability of completion in the required time, and policies such as making sure the probability is 95% or better could be used.",
      "ja": "適時性にはメタレシールがあります。ハードリアルタイムが必要な場合、他のすべての要件の解釈が変更されます。コミュニケーションが行われる前に、必要な適時性を達成するための失敗を報告する必要があります。対照的に、ソフトリアルタイムは、イベントが時間内に発生するという保証がないことを意味します。ただし、統計的測定を使用して、必要な時間の完了確率を示すことができ、確率が95％以上であることを確認するなどのポリシーを使用できます。"
    },
    {
      "indent": 6,
      "text": "Type: Boolean Meaning: Hard or Soft realtime Strictest Requirement: Hard Scope: per stream Example Application: Medical monitor - Hard",
      "ja": "タイプ：ブールの意味：ハードまたはソフトリアルタイムの厳格な要件：ハードスコープ：ストリームごとの例アプリケーション：医療モニター - ハード"
    },
    {
      "indent": 3,
      "text": "Synchronicity",
      "ja": "同期性"
    },
    {
      "indent": 6,
      "text": "To make sure that separate elements of a session are correctly synchronized with respect to each other",
      "ja": "セッションの別々の要素が互いに正しく同期されていることを確認するために"
    },
    {
      "indent": 6,
      "text": "Type: Time Meaning: The maximum time drift between streams Strictest Requirement: 80ms for human perception Scope: per stream pair/set Example Application: TV lip-sync value 80ms NB: the scope is not necessarily the same as the session. Some streams may no need to be sync'd, (say, a score ticker in a football match",
      "ja": "タイプ：時間の意味：ストリーム間の最大時間ドリフトが最も要件：人間の知覚範囲の80ms：ストリームごとにペア/セット例：テレビリップシンク値80ms NB：スコープは必ずしもセッションと同じではありません。一部のストリームは同期する必要はないかもしれません（たとえば、サッカーの試合のスコアティッカー"
    },
    {
      "indent": 3,
      "text": "Burstiness",
      "ja": "バーティネス"
    },
    {
      "indent": 6,
      "text": "This is a measure of the variance of bandwidth requirements over time.",
      "ja": "これは、帯域幅要件の時間の経過に伴う分散の尺度です。"
    },
    {
      "indent": 6,
      "text": "Type: Fraction Meaning: either: Variation in b/w as fraction of b/w for variable b/w communications or duty cycle (fraction of time at peak b/w) for intermittent b/w communications. Strictest Requirement: Variation = max b/w Duty cycle ~ 0 Scope: per stream Example Application: Sharing video clips, with chat channel - sudden bursts as clips are swapped. Compressed Audio - difference between silence and talking NB: More detailed analysis of communication flow (e.g. max rate of b/w change or Fourier Transform of the b/w requirement) is possible but as complexity increases usefulness and computability decrease.",
      "ja": "タイプ：分数の意味：どちらか：断続的なB/W通信の変数B/W通信またはデューティサイクル（ピークB/Wでの時間の割合）のB/WのB/Wの割合としてのB/Wの割合。最も厳格な要件：バリエーション=最大B/Wデューティサイクル〜0スコープ：ストリームごとの例アプリケーション：ビデオクリップの共有チャットチャネル - クリップが交換されるにつれて突然のバースト。圧縮オーディオ - サイレンスとトーキングNBの違い：通信フローのより詳細な分析（たとえば、B/W変化の最大レートまたはB/W要件のフーリエ変換）は可能ですが、複雑さが増加するにつれて有用性と計算可能性が低下します。"
    },
    {
      "indent": 3,
      "text": "Jitter",
      "ja": "ジッター"
    },
    {
      "indent": 6,
      "text": "Jitter is a measure of variance in the time taken for communications to traverse from the sender (application) to the receiver, as seen from the application layer.",
      "ja": "ジッターは、アプリケーション層から見たように、通信が送信者（アプリケーション）から受信機へと移動するために取られた時間の分散の尺度です。"
    },
    {
      "indent": 6,
      "text": "Type: Time Meaning: Maximum permissible time variance Strictest Requirement: <1ms Scope: per stream Example Application: audio streaming - <1ms NB: A jitter requirement implies that the communication is a real-time stream. It makes relatively little sense for a file transfer for example.",
      "ja": "タイプ：時間の意味：最大許容時間分散最大要件：<1msスコープ：ストリームごとの例アプリケーション：オーディオストリーミング -  <1ms NB：ジッター要件は、通信がリアルタイムストリームであることを意味します。たとえば、ファイル転送については比較的意味がありません。"
    },
    {
      "indent": 3,
      "text": "Expiry",
      "ja": "有効期限"
    },
    {
      "indent": 29,
      "text": "This specifies how long the information being transferred remains valid for.",
      "ja": "これは、転送される情報がどのくらいの期間有効であるかを指定します。"
    },
    {
      "indent": 6,
      "text": "Type: Date Meaning: Date at which data expires Strictest Requirement: For ever Scope: per stream Example Application: key distribution - now+3600 seconds (valid for at least one hour)",
      "ja": "タイプ：日付の意味：データが最も有効な日付の最も厳格な要件：永遠に範囲：ストリームごとの例アプリケーション：キーディストリビューション-3600秒（少なくとも1時間有効）"
    },
    {
      "indent": 3,
      "text": "Latency",
      "ja": "遅延"
    },
    {
      "indent": 29,
      "text": "Time between initiation and occurrence of an action from application perspective.",
      "ja": "アプリケーションの観点からのアクションの開始と発生の間の時間。"
    },
    {
      "indent": 6,
      "text": "Type: Time Strictest Requirement: Near zero for process control apps Scope: per stream Example Application: Audio conference 20ms NB: Where an action consists of several distinct sequential parts the latency budget must be split over those parts. For process control the requirement may take any value.",
      "ja": "タイプ：タイム厳密な要件：プロセス制御アプリのゼロに近いスコープ：ストリームごとの例アプリケーション：オーディオカンファレンス20ms NB：アクションがいくつかの明確なシーケンシャルパーツで構成されている場合、レイテンシ予算はそれらの部品に分割する必要があります。プロセス制御の場合、要件は任意の価値を取ることができます。"
    },
    {
      "indent": 3,
      "text": "Optimum Bandwidth",
      "ja": "最適な帯域幅"
    },
    {
      "indent": 6,
      "text": "Bandwidth required to complete communication in time",
      "ja": "時間内に通信を完了するために必要な帯域幅"
    },
    {
      "indent": 6,
      "text": "Type: Bandwidth Strictest Requirement: No upper limit Scope: per stream Example Application: Internet Phone 8kb/s",
      "ja": "タイプ：帯域幅の厳格な要件：上限なし範囲：ストリームごとの例例：インターネット電話8kb/s"
    },
    {
      "indent": 3,
      "text": "Tolerable Bandwidth",
      "ja": "許容可能な帯域幅"
    },
    {
      "indent": 6,
      "text": "Minimum bandwidth that application can tolerate",
      "ja": "そのアプリケーションが許容できる最小帯域幅"
    },
    {
      "indent": 6,
      "text": "Type: Bandwidth Strictest Requirement: No upper limit Scope: per stream Example Application: Internet phone 4kb/s",
      "ja": "タイプ：帯域幅の厳格な要件：上限なし範囲：ストリームごとの例例：インターネット電話4kb/s"
    },
    {
      "indent": 3,
      "text": "Required by time and tolerance",
      "ja": "時間と耐性によって必要です"
    },
    {
      "indent": 6,
      "text": "Time communication should complete by and time when failure to complete renders communication useless (therefore abort).",
      "ja": "時間通信は、完了しなかった場合に通信が役に立たない場合に完了する必要があります（したがって、中止）。"
    },
    {
      "indent": 6,
      "text": "Type:                  {\n                         Date - preferred complete time,\n                         Date - essential complete time\n                       }\nStrictest Requirement: Both now.\nScope:                 per stream\nExample Application:   Email - Preferred 5 minutes & Essential in\n                       1 day\nNB:                    Bandwidth * Duration = Size; only two of\n                       these parameters may be specified. An API\n                       though could allow application authors to\n                       think in terms of any two.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Host performance",
      "ja": "ホストのパフォーマンス"
    },
    {
      "indent": 6,
      "text": "Ability of host to create/consume communication",
      "ja": "コミュニケーションを作成/消費するホストの能力"
    },
    {
      "indent": 6,
      "text": "Type: Application benchmark Meaning: Level of resources required by Application Strictest Requirement: Full consumption Scope: per stream Example Application: Video - consume 15 frames a second NB: Host performance is complex since load, media type, media quality, h/w assistance, and encoding scheme all affect the processing load. These are difficult to predict prior to a communication starting. To some extent these will need to be measured and modified as the communication proceeds.",
      "ja": "タイプ：アプリケーションベンチマークの意味：アプリケーションで必要なリソースのレベル厳密な要件：完全な消費範囲：ストリームごとの例：ビデオ - 消費15フレームA 2番目のNB：ホストパフォーマンスはロード、メディアタイプ、メディア品質、H/W支援以来複雑です、およびエンコードスキームはすべて処理荷重に影響します。これらは、通信開始前に予測するのが難しいです。ある程度、これらは通信が進行するにつれて測定し、変更する必要があります。"
    },
    {
      "indent": 3,
      "text": "Frame size",
      "ja": "フレームサイズ"
    },
    {
      "indent": 6,
      "text": "Size of logical data packets from application perspective",
      "ja": "アプリケーションの観点からの論理データパケットのサイズ"
    },
    {
      "indent": 6,
      "text": "Type: data size Strictest Requirement: 6 bytes (gaming) Scope: per stream Example Application: video = data size of single frame update",
      "ja": "タイプ：データサイズの最も厳格な要件：6バイト（ゲーム）スコープ：ストリームごとの例アプリケーション：ビデオ=シングルフレームアップデートのデータサイズ"
    },
    {
      "indent": 3,
      "text": "Content size",
      "ja": "コンテンツサイズ"
    },
    {
      "indent": 6,
      "text": "The total size of the content (not relevant for continuous media)",
      "ja": "コンテンツの合計サイズ（継続的なメディアには関係ありません）"
    },
    {
      "indent": 6,
      "text": "Type: data size Strictest Requirement: N/A Scope: per stream Example Application: document transfer, 4kbytes",
      "ja": "タイプ：データサイズの最も厳格な要件：n/aスコープ：ストリームごとの例アプリケーション：ドキュメント転送、4kbytes"
    },
    {
      "indent": 0,
      "text": "3.2.5. Session Control",
      "section_title": true,
      "ja": "3.2.5. セッション制御"
    },
    {
      "indent": 3,
      "text": "Initiation",
      "ja": "開始"
    },
    {
      "indent": 6,
      "text": "Which initiation mechanism will be used.",
      "ja": "どの開始メカニズムが使用されます。"
    },
    {
      "indent": 6,
      "text": "Type: Enumeration Meaning: Announcement - session is publicly announced via a mass distribution system Invitation - specific participants are explicitly invited, e.g. my email Directive - specific participants are forced to join the session Strictest Requirement: Directive Scope: per stream Example Application: Corporate s/w update - Directive",
      "ja": "タイプ：列挙の意味：アナウンス - セッションは大規模な流通システムの招待状を介して公開されます - 特定の参加者は明示的に招待されます。私の電子メールディレクティブ - 特定の参加者はセッションに参加することを余儀なくされています。"
    },
    {
      "indent": 3,
      "text": "Start Time",
      "ja": "始まる時間"
    },
    {
      "indent": 6,
      "text": "Time sender starts sending!",
      "ja": "時間送信者が送信を開始します！"
    },
    {
      "indent": 6,
      "text": "Type: Date Strictest Requirement: Now Scope: per stream Example Application: FTP - at 3am",
      "ja": "タイプ：最も厳格な要件：今範囲：ストリームごとの例の例アプリケーション：FTP-午前3時"
    },
    {
      "indent": 3,
      "text": "End Time",
      "ja": "終了時間"
    },
    {
      "indent": 6,
      "text": "Type:                  Date\nStrictest Requirement: Now\nScope:                 per stream\nExample Application:   FTP - Now+30mins",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Duration",
      "ja": "間隔"
    },
    {
      "indent": 6,
      "text": "(end time) - (start time) = (duration), therefore only two of\nthree should be specified.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Type:                  Time\nStrictest Requirement: - 0ms for discrete, indefinite for streams\nScope:                 per stream\nExample Application:   audio feed - 60mins",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Active Time",
      "ja": "アクティブな時間"
    },
    {
      "indent": 6,
      "text": "Total time session is active, not including breaks",
      "ja": "総時間セッションはアクティブであり、休憩は含まれません"
    },
    {
      "indent": 6,
      "text": "Type: Time Strictest Requirement: equals duration Scope: per stream Example Application: Spectator sport transmission",
      "ja": "タイプ：時間厳密な要件：等しい期間範囲：ストリームごとの例アプリケーション：観客スポーツ伝達"
    },
    {
      "indent": 3,
      "text": "Session Burstiness",
      "ja": "セッションの破裂"
    },
    {
      "indent": 6,
      "text": "Expected level of burstiness of the session",
      "ja": "セッションの予想レベルのバースト"
    },
    {
      "indent": 6,
      "text": "Type:                  Fraction\nMeaning:               Variance as a fraction of maximum bandwidth\nStrictest Requirement: =bandwidth\nScope:                 per stream\nExample Application:   commentary & slide show: 90% of max",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Atomic join",
      "ja": "アトミック結合"
    },
    {
      "indent": 6,
      "text": "Session fails unless a certain proportion of the potential participants accept an invitation to join. Alternatively, may be specified as a specific numeric quorum.",
      "ja": "潜在的な参加者の一定の割合が参加への招待を受け入れない限り、セッションは失敗します。あるいは、特定の数値Quorumとして指定される場合があります。"
    },
    {
      "indent": 6,
      "text": "Type: Fraction (proportion required) or int (quorum) Strictest Requirement: 1.0 (proportion) Example Application: price list update, committee meeting Scope: per stream or session NB: whether certain participants are essential is application dependent.",
      "ja": "タイプ：分数（割合が必要）またはINT（Quorum）最も厳しい要件：1.0（割合）例：価格表の更新、委員会会議の範囲：ストリームまたはセッションNB：特定の参加者が不可欠であるかどうかはアプリケーションに依存します。"
    },
    {
      "indent": 3,
      "text": "Late join allowed ?",
      "ja": "遅い結合許可？"
    },
    {
      "indent": 6,
      "text": "Does joining a session after it starts make sense",
      "ja": "セッションに参加してから理にかなっています"
    },
    {
      "indent": 6,
      "text": "Type: Boolean Strictest Requirement: allowed Scope: per stream or session Example Application: game - not allowed NB: An application may wish to define an alternate session if late join is not allowed",
      "ja": "タイプ：ブールの厳格な要件：許可スコープ：ストリームごとのセッション例アプリケーション：ゲーム - 許可されていないNB：アプリケーションが遅れて結合が許可されていない場合に代替セッションを定義することを希望する場合があります"
    },
    {
      "indent": 3,
      "text": "Temporary leave allowed ?",
      "ja": "一時的な休暇が許可されていますか？"
    },
    {
      "indent": 6,
      "text": "Does leaving and then coming back make sense for session",
      "ja": "出発してから戻ってくるのはセッションに理にかなっています"
    },
    {
      "indent": 6,
      "text": "Type: Boolean Strictest Requirement: allowed Scope: per stream or session Example Application: FTP - not allowed",
      "ja": "タイプ：ブールの厳格な要件：許可スコープ：ストリームごとまたはセッション例アプリケーション：FTP-許可されていない"
    },
    {
      "indent": 3,
      "text": "Late join with catch-up allowed ?",
      "ja": "キャッチアップ許可に遅れて参加しますか？"
    },
    {
      "indent": 6,
      "text": "Is there a mechanism for a late joiner to see what they've missed",
      "ja": "遅いジョイナーが見逃したものを見るためのメカニズムはありますか"
    },
    {
      "indent": 6,
      "text": "Type: Boolean Strictest Requirement: allowed Scope: per stream or session Example Application: sports event broadcast, allowed NB: An application may wish to define an alternate session if late join is not allowed",
      "ja": "タイプ：ブールの厳格な要件：許可スコープ：ストリームまたはセッションの例の例アプリケーション：スポーツイベント放送、許可NB：アプリケーションが遅れて結合が許可されていない場合は代替セッションを定義したい場合があります"
    },
    {
      "indent": 3,
      "text": "Potential streams per session",
      "ja": "セッションごとの潜在的なストリーム"
    },
    {
      "indent": 6,
      "text": "Total number of streams that are part of session, whether being consumed or not",
      "ja": "消費されるかどうかにかかわらず、セッションの一部であるストリームの総数"
    },
    {
      "indent": 6,
      "text": "Type: Integer Strictest Requirement: No upper limit Scope: per session Example Application: football match mcast - multiple camera's, commentary, 15 streams",
      "ja": "タイプ：整数の厳格な要件：上限なし範囲：セッションごとの例アプリケーション：フットボールマッチmcast-複数のカメラ、解説、15ストリーム"
    },
    {
      "indent": 3,
      "text": "Active streams per sessions (i.e. max app can handle)",
      "ja": "セッションごとのアクティブストリーム（つまり、最大アプリが処理できます）"
    },
    {
      "indent": 6,
      "text": "Maximum number of streams that an application can consume simultaneously",
      "ja": "アプリケーションが同時に消費できるストリームの最大数"
    },
    {
      "indent": 6,
      "text": "Type: Integer Strictest Requirement: No upper limit Scope: per session Example Application: football match mcast - 6, one main video, four user selected, one audio commentary",
      "ja": "タイプ：整数の厳格な要件：上限範囲なし：セッションごとの例アプリケーション：フットボールマッチMCAST -6、1つのメインビデオ、4人のユーザーが選択、1つのオーディオ解説"
    },
    {
      "indent": 0,
      "text": "3.2.6. Session Topology",
      "section_title": true,
      "ja": "3.2.6. セッショントポロジ"
    },
    {
      "indent": 3,
      "text": "Note: topology may be dynamic. One of the challenges in designing adaptive protocol frameworks is to predict the topology before the first join.",
      "ja": "注：トポロジーは動的である可能性があります。適応プロトコルフレームワークを設計する際の課題の1つは、最初の結合の前にトポロジを予測することです。"
    },
    {
      "indent": 3,
      "text": "Number of senders",
      "ja": "送信者の数"
    },
    {
      "indent": 6,
      "text": "The number of senders is a result the middleware may pass up to the application",
      "ja": "送信者の数は、ミドルウェアがアプリケーションに渡すことができる結果です"
    },
    {
      "indent": 6,
      "text": "Type: Integer Strictest Requirement: No upper limit Scope: per stream Example Application: network MUD - 100",
      "ja": "タイプ：整数の厳格な要件：上限なし範囲：ストリームごとの例の例アプリケーション：ネットワーク泥-100"
    },
    {
      "indent": 3,
      "text": "Number of receivers",
      "ja": "受信機の数"
    },
    {
      "indent": 6,
      "text": "The number of receivers is a results the middleware may pass up to the application",
      "ja": "受信機の数は、ミドルウェアがアプリケーションに渡すことができる結果です"
    },
    {
      "indent": 6,
      "text": "Type: Integer Strictest Requirement: No upper limit Scope: per stream Example Application: video mcast - 100,000",
      "ja": "タイプ：整数の厳格な要件：上限なし範囲：ストリームごとの例の例アプリケーション：ビデオmcast -100,000"
    },
    {
      "indent": 0,
      "text": "3.2.7. Directory",
      "section_title": true,
      "ja": "3.2.7. ディレクトリ"
    },
    {
      "indent": 3,
      "text": "Fail-over timeout (see Reliability: fail-over time)",
      "ja": "フェールオーバータイムアウト（信頼性：フェイルオーバー時間を参照）"
    },
    {
      "indent": 3,
      "text": "Mobility",
      "ja": "可動性"
    },
    {
      "indent": 6,
      "text": "Defines restrictions on when directory entries may be changed",
      "ja": "ディレクトリエントリがいつ変更されるかの制限を定義します"
    },
    {
      "indent": 6,
      "text": "Type: Enumeration Meaning: while entry is in use while entry in unused never Strictest Requirement: while entry is in use Scope: per stream Example Application: voice over mobile phone, while entry is in use (as phone gets new address when changing cell).",
      "ja": "タイプ：列挙の意味：未使用のエントリ中にエントリが使用されている間、決して厳格な要件はありません：エントリは使用されています範囲：ストリームごとの例：携帯電話の音声、エントリは使用中です（電話はセルを変更するときに新しいアドレスを取得するため）。"
    },
    {
      "indent": 0,
      "text": "3.2.8. Security",
      "section_title": true,
      "ja": "3.2.8. 安全"
    },
    {
      "indent": 3,
      "text": "The strength of any security arrangement can be stated as the expected cost of mounting a successful attack. This allows mechanisms such as physical isolation to be considered alongside encryption mechanisms. The cost is measured in an abstract currency, such as 1970 UD$ (to inflation proof).",
      "ja": "セキュリティの取り決めの強さは、攻撃を成功させるための予想コストとして述べることができます。これにより、物理的な分離などのメカニズムを暗号化メカニズムとともに考慮することができます。コストは、1970 UD $（インフレ証明）などの抽象通貨で測定されます。"
    },
    {
      "indent": 3,
      "text": "Security is an orthogonal requirement. Many requirements can have a security requirement on them which mandates that the cost of causing the system to fail to meet that requirement is more than the specified amount. In terms of impact on other requirements though, security does potentially have a large impact so when a system is trying to determine which mechanisms to use and whether the requirements can be met security will clearly be a major influence.",
      "ja": "セキュリティは直交要件です。多くの要件には、システムがその要件を満たすことに失敗するコストが指定された金額を超えていることを義務付けるセキュリティ要件を持つことができます。ただし、他の要件に影響を与えるという点では、セキュリティが大きな影響を与える可能性があるため、システムが使用するメカニズムと要件を満たすことができるかどうかを決定しようとする場合、セキュリティが明らかに大きな影響を与えます。"
    },
    {
      "indent": 3,
      "text": "Authentication Strength",
      "ja": "認証強度"
    },
    {
      "indent": 6,
      "text": "Authentication aims to ensure that a principal is who they claim to be. For each role in a communication, (e.g. sender, receiver) there is a strength for the authentication of the principle who has taken on that role. The principal could be a person, organization or other legal entity. It could not be a process since a process has no legal representation.",
      "ja": "認証は、元本が彼らが誰であるかを確実にすることを目的としています。コミュニケーションにおける各役割（送信者、受信者など）について、その役割を引き受けた原則の認証には強みがあります。校長は、人、組織、またはその他の法人である可能性があります。プロセスには法的な代理がないため、プロセスではありません。"
    },
    {
      "indent": 6,
      "text": "Type: Abstract Currency Meaning: That the cost of hijacking a role is in excess of the specified amount. Each role is a different requirement.",
      "ja": "タイプ：抽象通貨の意味：役割をハイジャックするコストは、指定された金額を超えていること。各役割は異なる要件です。"
    },
    {
      "indent": 6,
      "text": "Strictest Requirement: budget of largest attacker Scope: per stream Example Application: inter-governmental conference",
      "ja": "最も厳格な要件：最大攻撃者の予算範囲：ストリームごとの例例：政府間会議"
    },
    {
      "indent": 3,
      "text": "Tamper-proofing",
      "ja": "改ざん防止"
    },
    {
      "indent": 6,
      "text": "This allows the application to specify how much security will be applied to ensuring that a communication is not tampered with. This is specified as the minimum cost of successfully tampering with the communication. Each non-security requirement has a tamper-proofing requirement attached to it.",
      "ja": "これにより、アプリケーションは、通信が改ざんされないようにするために、セキュリティを適用する量を指定できます。これは、通信を改ざんに正常に改ざんする最低コストとして指定されています。各セキュリティ要件には、改ざん防止要件が付属しています。"
    },
    {
      "indent": 6,
      "text": "Requirement: The cost of tampering with the communication is in excess of the specified amount.",
      "ja": "要件：通信を改ざんするコストは、指定された金額を超えています。"
    },
    {
      "indent": 6,
      "text": "Type:                  {\n                         Abstract Currency,\n                         Abstract Currency,\n                         Abstract Currency\n                       }\nMeaning:               cost to alter or destroy data,\n                       cost to replay data (successfully),\n                       cost to interfere with timeliness.\nScope:                 per stream\nStrictest Requirement: Each budget of largest attacker\nExample Application:   stock price feed",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Non-repudiation strength",
      "ja": "非繰り返し強度"
    },
    {
      "indent": 6,
      "text": "The non-repudiation strength defines how much care is taken to make sure there is a reliable audit trail on all interactions. It is measured as the cost of faking an audit trail, and therefore being able to \"prove\" an untrue event. There are a number of possible parameters of the event that need to be proved. The following list is not exclusive but shows the typical set of requirements.",
      "ja": "非繰り返しの強度は、すべてのインタラクションに信頼できる監査証跡があることを確認するために、どれだけの注意が必要かを定義します。これは、監査証跡を偽造するコストとして測定されるため、真実でないイベントを「証明」することができます。証明する必要があるイベントには、多くの可能なパラメーターがあります。次のリストは排他的ではありませんが、典型的な一連の要件を示しています。"
    },
    {
      "indent": 6,
      "text": "1. Time 2. Ordering (when relative to other events) 3. Whom 4. What (the event itself)",
      "ja": "1. 時間2.注文（他のイベントに関連する場合）3。WHO 4.何（イベント自体）"
    },
    {
      "indent": 6,
      "text": "There are a number of events that need to be provable. 1. sender proved sent 2. receiver proves received 3. sender proves received.",
      "ja": "証明可能なイベントがいくつかあります。 1.送信者が送信されたことを証明します2.受信者が受信されることを証明します3.送信者が受け取ったことを証明します。"
    },
    {
      "indent": 6,
      "text": "Type: Abstract Currency Meaning: minimum cost of faking or denying an event Strictest Requirement: Budget of largest attacker Scope: per stream Example Application: Online shopping system",
      "ja": "タイプ：抽象通貨の意味：イベントの最低コストのイベントの拒否最小要件：最大の攻撃者範囲の予算：ストリームごとの例アプリケーション：オンラインショッピングシステム"
    },
    {
      "indent": 3,
      "text": "Denial of service",
      "ja": "サービス拒否"
    },
    {
      "indent": 6,
      "text": "There may be a requirement for some systems (999,911,112 emergency services access for example) that denial of service attacks cannot be launched. While this is difficult (maybe impossible) in many systems at the moment it is still a requirement, just one that can't be met.",
      "ja": "一部のシステム（たとえば999,911,112の緊急サービスアクセスなど）には、サービス拒否攻撃を開始できないという要件があるかもしれません。現時点では、多くのシステムではこれは困難です（おそらく不可能）それは依然として要件であり、満たすことができないものだけです。"
    },
    {
      "indent": 6,
      "text": "Type: Abstract Currency Meaning: Cost of launching a denial of service attack is greater than specified amount. Strictest Requirement: budget of largest attacker Scope: per stream Example Application: web hosting, to prevent individual hackers stalling system.",
      "ja": "タイプ：抽象通貨の意味：サービス拒否攻撃を開始するコストは、指定された金額よりも大きくなります。最も厳格な要件：最大の攻撃者範囲の予算：ストリームごとの例アプリケーション：Webホスティング、個々のハッカーの失速システムを防ぐため。"
    },
    {
      "indent": 3,
      "text": "Action restriction",
      "ja": "アクション制限"
    },
    {
      "indent": 6,
      "text": "For any given communication there are a two actions, send and receive. Operations like adding to members to a group are done as a send to the membership list. Examining the list is a request to and receive from the list. Other actions can be generalized to send and receive on some communication, or are application level not comms level issues.",
      "ja": "特定のコミュニケーションには、送信と受信の2つのアクションがあります。メンバーにグループに追加するなどの操作は、メンバーシップリストへの送信として行われます。リストを調べることは、リストからのリクエストと受信です。他のアクションを一般化して、何らかの通信を送信および受信するか、Commsレベルの問題ではなくアプリケーションレベルです。"
    },
    {
      "indent": 6,
      "text": "Type: Membership list/rule for each action. Meaning: predicate for determining permission for role Strictest Requirement: Send and receive have different policies. Scope: per stream Example Application: TV broadcast, sender policy defines transmitter, receiver policy is null. NB: Several actions may share the same membership policy.",
      "ja": "タイプ：各アクションのメンバーシップリスト/ルール。意味：役割の許可を決定するための述語最も厳密な要件：送信と受信には、異なるポリシーがあります。範囲：ストリームごとの例アプリケーション：テレビ放送、送信者ポリシーは送信機を定義し、レシーバーポリシーはnullです。NB：いくつかのアクションが同じメンバーシップポリシーを共有する場合があります。"
    },
    {
      "indent": 3,
      "text": "Privacy",
      "ja": "プライバシー"
    },
    {
      "indent": 6,
      "text": "Privacy defines how well obscured a principals identity is. This could be for any interaction. A list of participants may be obscured, a sender may obscure their identity when they send. There are also different types of privacy. For example knowing two messages were sent by the same person breaks the strongest type of privacy even if the identity of that sender is still unknown. For each \"level\" of privacy there is a cost associated with violating it. The requirement is that this cost is excessive for the attacker.",
      "ja": "プライバシーは、プリンシパルのアイデンティティがどれほどうまく不明瞭になっているかを定義します。これは、どんな相互作用にもかかる可能性があります。参加者のリストが不明瞭になる場合があります。送信者は、送信中にアイデンティティを不明瞭にする場合があります。また、さまざまな種類のプライバシーがあります。たとえば、同じ人によって2つのメッセージが送信されたことを知ることは、その送信者の身元がまだ不明であっても、最も強力なタイプのプライバシーを破ります。プライバシーの「レベル」ごとに、ITに違反することに関連するコストがあります。要件は、このコストが攻撃者にとって過剰であることです。"
    },
    {
      "indent": 6,
      "text": "Type:                  {\n                         Abstract Currency,\n                         Abstract Currency,\n                         Abstract Currency,\n                         Abstract Currency\n                       }\nMeaning:               Level of privacy, expected cost to violate\n                       privacy level for:-\n                       openly identified - this is the unprotected\n                           case\n                       anonymously identified  - (messages from\n                           the same sender can be linked)\n                       unadvertised (but traceable) - meaning that\n                           traffic can be detected and traced to\n                           it's source or destination, this is a\n                           breach if the very fact that two\n                           specific principals are communicating\n                           is sensitive.\n                       undetectable\nStrictest Requirement: All levels budget of attacker\nScope:                 per stream\nExample Application:   Secret ballot voting system\n                       openly identified - budget of any\n                           interested party\n                       anonymously identified - zero\n                       unadvertised - zero\n                       undetectable - zero",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Confidentiality",
      "ja": "機密性"
    },
    {
      "indent": 6,
      "text": "Confidentiality defines how well protected the content of a communication is from snooping.",
      "ja": "機密性は、通信のコンテンツがスヌーピングからどれだけよく保護されているかを定義します。"
    },
    {
      "indent": 6,
      "text": "Type: Abstract Currency Meaning: Level of Confidentiality, the cost of gaining illicit access to the content of a stream Strictest Requirement: budget of attacker Scope: per stream Example Application: Secure email - value of transmitted information",
      "ja": "タイプ：抽象通貨の意味：機密性のレベル、ストリームのコンテンツへの違法アクセスを得るコストが最も厳格な要件：攻撃者の予算：ストリームごとの例アプリケーション：セキュア電子メール - 送信情報の値"
    },
    {
      "indent": 3,
      "text": "Retransmit prevention strength",
      "ja": "予防強度を再送信します"
    },
    {
      "indent": 6,
      "text": "This is extremely hard at the moment. This is not to say it's not a requirement.",
      "ja": "これは現時点で非常に難しいです。これは、それが要件ではないということではありません。"
    },
    {
      "indent": 6,
      "text": "Type: Abstract Currency Meaning: The cost of retransmitting a secure piece of information should exceed the specified amount. Strictest Requirement: Cost of retransmitting value of information Scope: per stream",
      "ja": "タイプ：抽象通貨の意味：安全な情報を再送信するコストは、指定された金額を超える必要があります。最も厳格な要件：情報の再送信コスト情報範囲：ストリームごと"
    },
    {
      "indent": 3,
      "text": "Membership Criteria",
      "ja": "メンバーシップ基準"
    },
    {
      "indent": 6,
      "text": "If a principal attempts to participate in a communication then a check will be made to see if it is allowed to do so. The requirement is that certain principals will be allowed, and others excluded. Given the application is being protected from network details there are only two types of specification available, per user, and per organization (where an organization may contain other organizations, and each user may be a member of multiple organizations). Rules could however be built on properties of a user, for example does the user own a key? Host properties could also be used, so users on slow hosts or hosts running the wrong OS could be excluded.",
      "ja": "プリンシパルがコミュニケーションに参加しようとする場合、チェックが行われ、それが許可されているかどうかを確認します。要件は、特定の校長が許可され、他の校長は除外されることです。アプリケーションがネットワークの詳細から保護されていることを考えると、ユーザーごとと組織ごと（組織に他の組織が含まれる場合があり、各ユーザーが複数の組織のメンバーになる場合がある場合、利用可能な2種類の仕様のみがあります。ただし、ルールはユーザーのプロパティに基づいて構築できます。たとえば、ユーザーはキーを所有していますか？ホストプロパティも使用できるため、間違ったOSを実行している低速ホストまたはホストのユーザーは除外できます。"
    },
    {
      "indent": 6,
      "text": "Type: Macros Meaning: Include or exclude users (list) organizations (list) hosts (list) user properties (rule) org properties (rule) hosts properties (rule) Strictest Requirement: List of individual users Scope: per stream Example Application: Corporate video-conference - organization membership",
      "ja": "タイプ：マクロの意味：ユーザー（リスト）組織（リスト）ホスト（リスト）のホスト（リスト）ユーザープロパティ（ルール）ORGプロパティ（ルール）ホストプロパティ（ルール）最も厳格な要件：個々のユーザーのリスト範囲：ストリームごとの例アプリケーション：コーポレートビデオ会議 - 組織メンバーシップ"
    },
    {
      "indent": 3,
      "text": "Collusion prevention",
      "ja": "共謀防止"
    },
    {
      "indent": 6,
      "text": "Which aspects of collusion it is required to prevent. Collusion is defined as malicious co-operation between members of a secure session. Superficially, it would appear that collusion is not a relevant threat in a multicast, because everyone has the same information, however, wherever there is differentiation, it can be exploited.",
      "ja": "それが予防する必要がある共謀のどの側面。共謀は、安全なセッションのメンバー間の悪意のある協力として定義されます。表面的には、共謀はマルチキャストの関連する脅威ではないように思われます。なぜなら、誰もが同じ情報を持っているからです。"
    },
    {
      "indent": 6,
      "text": "Type: { Abstract Currency, Abstract Currency, Abstract Currency",
      "ja": "タイプ：{要約通貨、抽象通貨、抽象通貨"
    },
    {
      "indent": 6,
      "text": " } Meaning: time race collusion - cost of colluding key encryption key (KEK) sharing - cost of colluding sharing of differential QoS (not strictly collusion as across sessions not within one) - cost of colluding Strictest Requirement: For all threats cost attackers combined resources Scope: per stream Example Application: A race where delay of the start signal may be allowed for, but one participant may fake packet delay while receiving the start signal from another participant. NB: Time race collusion is the most difficult one to prevent. Also note that while these may be requirements for some systems this does not mean there are necessarily solutions. Setting tough requirements may result in the middleware being unable to create a valid channel.",
      "ja": "}意味：タイムレースの共謀 - キー暗号化キー（KEK）共有の共謀のコスト - 微分QoSの共有共有のコスト（1つ以内ではないセッション全体で厳密に共謀しない） - 共謀のコストが厳格な要件：すべての脅威のコスト攻撃者のリソースを組み合わせたリソース範囲：ストリームごとの例アプリケーション：スタート信号の遅延が許可される場合がありますが、1人の参加者は、別の参加者から開始信号を受信している間にパケット遅延を偽造する場合があります。NB：タイムレースの共謀は、予防するのが最も難しいものです。また、これらは一部のシステムの要件である可能性がありますが、これは必ずしも解決策があるという意味ではありません。困難な要件を設定すると、ミドルウェアが有効なチャネルを作成できなくなる可能性があります。"
    },
    {
      "indent": 3,
      "text": "Fairness",
      "ja": "公平性"
    },
    {
      "indent": 6,
      "text": "Fairness is a meta-requirement of many other requirements. Of particular interest are Reliability and Timeliness requirements. When a communication is first created the creator may wish to specify a set of requirements for these parameters. Principals which join later may wish to set tighter limits. Fairness enforces a policy that any improvement is requirement by one principal must be matched by all others, in effect requirements can only be set for the whole group. This increases the likelihood that requirements of this kind will fail to be met. If fairness if not an issue then some parts of the network can use more friendly methods to achieve those simpler requirements.",
      "ja": "公平性は、他の多くの要件のメタ要請です。特に興味深いのは、信頼性と適時性の要件です。コミュニケーションが最初に作成されると、作成者はこれらのパラメーターの一連の要件を指定したい場合があります。後で参加するプリンシパルは、より厳しい制限を設定したい場合があります。公平性は、1人のプリンシパルによる要件が他のすべてのものと一致しなければならないというポリシーを実施します。これにより、この種の要件が満たされない可能性が高まります。公平性が問題でない場合は、ネットワークの一部の部分がより友好的な方法を使用して、これらの単純な要件を実現できます。"
    },
    {
      "indent": 6,
      "text": "Type: Level of variance of the requirement that needs to be fair. For example, if the latency requirement states within 2 seconds, the level of fairness required may be that variations in latency are not more than 0.1s. This has in fact become an issue in online gaming (e.g. Quake) Meaning: The variance of performance with respect to any other requirement is less than the specified amount. Scope: per stream, per requirement Example Application: Networked game, latency to receive positions of players must be within 5ms for all players.",
      "ja": "タイプ：公平である必要がある要件の分散レベル。たとえば、レイテンシ要件が2秒以内に状態になっている場合、必要な公平性のレベルは、レイテンシの変動が0.1秒以内であるということです。これは、実際にはオンラインゲーム（例：Quake）の意味で問題になりました。他の要件に関するパフォーマンスの分散は、指定された金額よりも少ないです。範囲：要件ごとに、要件ごとの例アプリケーション：ネットワーク化されたゲーム、プレイヤーのポジションを受信するレイテンシは、すべてのプレーヤーの5ms以内でなければなりません。"
    },
    {
      "indent": 3,
      "text": "Action on compromise",
      "ja": "妥協に関するアクション"
    },
    {
      "indent": 6,
      "text": "The action to take on detection of compromise (until security reassured).",
      "ja": "妥協の検出を引き受けるための行動（セキュリティが安心するまで）。"
    },
    {
      "indent": 6,
      "text": "Type: Enumeration Meaning: warn but continue pause abort Scope: Per stream Strictest Requirement: pause Example Application: Secure video conference - if intruder alert, everyone is warned, but they can continue while knowing not to discuss sensitive matters (cf. catering staff during a meeting).",
      "ja": "タイプ：列挙の意味：警告しますが、一時停止範囲：ストリームごとに最も厳密な要件：一時停止例アプリケーション：セキュアビデオ会議 - 侵入者アラートの場合、誰もが警告されますが、デリケートな問題について議論しないように継続できます（ケータリングスタッフを参照してください。打ち合わせ、会議）。"
    },
    {
      "indent": 0,
      "text": "3.2.8.1. Security Dynamics",
      "section_title": true,
      "ja": "3.2.8.1. セキュリティダイナミクス"
    },
    {
      "indent": 6,
      "text": "Security dynamics are the temporal properties of the security mechanisms that are deployed. They may affect other requirements such as latency or simply be a reflection of the security limitations of the system. The requirements are often concerned with abnormal circumstances (e.g. system violation).",
      "ja": "セキュリティダイナミクスは、展開されているセキュリティメカニズムの時間的特性です。それらは、レイテンシなどの他の要件に影響を与えるか、単にシステムのセキュリティの制限を反映している可能性があります。要件は、多くの場合、異常な状況（システム違反など）に関係しています。"
    },
    {
      "indent": 3,
      "text": "Mean time between compromises",
      "ja": "妥協の間の平均時間"
    },
    {
      "indent": 6,
      "text": "This is not the same as the strength of a system. A fairly weak system may have a very long time between compromises because it is not worth breaking in to, or it is only worth it for very few people. Mean time between compromises is a combination of strength, incentive and scale.",
      "ja": "これは、システムの強度と同じではありません。かなり弱いシステムは、妥協の間に非常に長い時間があるかもしれません。なぜなら、それは侵入する価値がないか、それだけの価値が非常に少ないためです。妥協の平均時間は、強度、インセンティブ、スケールの組み合わせです。"
    },
    {
      "indent": 6,
      "text": "Type: Time Scope: Per stream Strictest Requirement: indefinite Example Application: Secure Shell - 1500hrs",
      "ja": "タイプ：時間範囲：ストリームごとの最も厳格な要件：無期限の例アプリケーション：セキュアシェル-1500時間"
    },
    {
      "indent": 3,
      "text": "Compromise detection time limit",
      "ja": "妥協の検出時間制限"
    },
    {
      "indent": 6,
      "text": "The average time it must take to detect a compromise (one predicted in the design of the detection system, that is).",
      "ja": "妥協を検出するためにかかる平均時間（検出システムの設計で予測されるもの、つまり）。"
    },
    {
      "indent": 6,
      "text": "Type: Time Scope: Per stream Strictest Requirement: Round trip time Example Application: Secure Shell - 2secs",
      "ja": "タイプ：時間範囲：ストリームごとの最も厳格な要件：往復時間の例アプリケーション：セキュアシェル-2秒"
    },
    {
      "indent": 3,
      "text": "Compromise recovery time limit",
      "ja": "妥協回収時間制限"
    },
    {
      "indent": 6,
      "text": "The maximum time it must take to re-seal the security after a breach. This combined with the compromise detection time limit defines how long the system must remain inactive to avoid more security breaches. For example if a compromise is detected in one minute, and recovery takes five, then one minute of traffic is now insecure and the members of the communication must remain silent for four minutes after detection while security is re-established.",
      "ja": "違反の後にセキュリティを再統合するために必要な最大時間。これは、妥協の検出時間制限と組み合わされて、セキュリティ侵害を回避するためにシステムが非アクティブなままでなければならない期間を定義します。たとえば、妥協が1分で検出され、回復に5回検出された場合、1分間のトラフィックが不安定になり、セキュリティが再確立されている間、通信のメンバーは検出後4分間沈黙を保つ必要があります。"
    },
    {
      "indent": 6,
      "text": "Type: Time Scope: Per stream Strictest Requirement: 1 second Example Application: Audio conference - 10 seconds",
      "ja": "タイプ：時間範囲：ストリームごとの最も厳格な要件：1秒の例アプリケーション：オーディオ会議-10秒"
    },
    {
      "indent": 0,
      "text": "3.2.9. Payment & Charging",
      "section_title": true,
      "ja": "3.2.9. 支払いと充電"
    },
    {
      "indent": 3,
      "text": "Total Cost",
      "ja": "総費用"
    },
    {
      "indent": 6,
      "text": "The total cost of communication must be limited to this amount. This would be useful for transfer as opposed to stream type applications.",
      "ja": "通信の総コストは、この金額に制限する必要があります。これは、ストリームタイプアプリケーションとは対照的に、転送に役立ちます。"
    },
    {
      "indent": 6,
      "text": "Type:                  Currency\nMeaning:               Maximum charge allowed\nScope:                 Per user per stream\nStrictest Requirement: Free\nExample Application:   File Transfer: comms cost must be < 1p/Mb",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Cost per Time",
      "ja": "時間あたりの費用"
    },
    {
      "indent": 6,
      "text": " This is the cost per unit time. Some applications may not be able to predict the duration of a communication. It may be more meaningful for those to be able to specify price per time instead. Type: Currency per timeS",
      "ja": "これは単位時間あたりのコストです。一部のアプリケーションは、通信の期間を予測できない場合があります。代わりに、時間ごとに価格を指定できるようにすることは、より意味があるかもしれません。タイプ：通貨あたりの通貨"
    },
    {
      "indent": 6,
      "text": "Scope:                 Per user per stream\nStrictest Requirement: Free\nExample Application:   Video Conference - 15p / minute",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Cost per Mb",
      "ja": "MBあたりのコスト"
    },
    {
      "indent": 6,
      "text": "This is the cost per unit of data. Some communications may be charged by the amount of data transferred. Some applications may prefer to specify requirements in this way.",
      "ja": "これは、データ単位あたりのコストです。一部の通信は、転送されるデータの量によって請求される場合があります。一部のアプリケーションは、この方法で要件を指定することを好む場合があります。"
    },
    {
      "indent": 6,
      "text": "Type:                  Currency per data size\nScope:                 Per user per stream\nStrictest Requirement: Free\nExample Application:   Email advertising - 15p / Mb",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "See comprehensive security section of taxonomy.",
      "ja": "分類法の包括的なセキュリティセクションを参照してください。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5. 参考文献"
    },
    {
      "indent": 3,
      "text": "[Bagnall98] Bagnall Peter, Poppitt Alan, Example LSMA classifications, BT Tech report, <URL:http://www.labs.bt.com/projects/mware/>",
      "ja": "[Bagnall98] Bagnall Peter、Poppitt Alan、例LSMA分類、BT Tech Report、<url：http：//www.labs.bt.com/projects/mware/>"
    },
    {
      "indent": 3,
      "text": "[limitations] Pullen, M., Myjak, M. and C. Bouwens, \"Limitations of Internet Protocol Suite for Distributed Simulation in the Large Multicast Environment\", RFC 2502, February 1999.",
      "ja": "[制限] Pullen、M.、Myjak、M。、およびC. Bouwens、「大規模なマルチキャスト環境での分散シミュレーションのためのインターネットプロトコルスイートの制限」、RFC 2502、1999年2月。"
    },
    {
      "indent": 3,
      "text": "[rmodp] Open Distributed Processing Reference Model (RM-ODP), ISO/IEC 10746-1 to 10746-4 or ITU-T (formerly CCITT) X.901 to X.904. Jan 1995.",
      "ja": "[RMODP]オープン分散処理参照モデル（RM-ODP）、ISO/IEC 10746-1から10746-4またはITU-T（以前はCCITT）X.901からX.904。1995年1月。"
    },
    {
      "indent": 3,
      "text": "[blaze95] Blaze, Diffie, Rivest, Schneier, Shimomura, Thompson and Wiener, Minimal Key Lengths for Symmetric Ciphers to Provide Adequate Commercial Security, January 1996.",
      "ja": "[Blaze95] Blaze、Diffie、Rivest、Schneier、Shimomura、Thompson、Wiener、1996年1月、適切な商業セキュリティを提供する対称的な暗号の最小限のキー長。"
    },
    {
      "indent": 0,
      "text": "6. Authors' Addresses",
      "section_title": true,
      "ja": "6. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Peter Bagnall c/o B54/77 BT Labs Martlesham Heath Ipswich, IP5 3RE England",
      "ja": "Peter Bagnall C/O B54/77 BT LABS MARTLESHAM HEATH IPSWICH、IP5 3REイングランド"
    },
    {
      "indent": 3,
      "text": "EMail: pete@surfaceeffect.com\nHome page: http://www.surfaceeffect.com/people/pete/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Bob Briscoe B54/74 BT Labs Martlesham Heath Ipswich, IP5 3RE England",
      "ja": "Bob Briscoe B54/74 BT LABS MARTLESHAM HEATH IPSWICH、IP5 3REイングランド"
    },
    {
      "indent": 3,
      "text": "Phone: +44 1473 645196\nFax:   +44 1473 640929\nEMail: bob.briscoe@bt.com\nHome page: http://www.labs.bt.com/people/briscorj/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Alan Poppitt B54/77 BT Labs Martlesham Heath Ipswich, IP5 3RE England",
      "ja": "Alan Poppitt B54/77 BT LABS MARTLESHAM HEATH IPSWICH、IP5 3REイングランド"
    },
    {
      "indent": 3,
      "text": "Phone: +44 1473 640889\nFax:   +44 1473 640929\nEMail: apoppitt@jungle.bt.co.uk\nHome page: http://www.labs.bt.com/people/poppitag/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "ja": "7. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1999). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（1999）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}