{
  "title": {
    "text": "RFC 2401 - Security Architecture for the Internet Protocol",
    "ja": "RFC 2401 - インターネットプロトコルのためのセキュリティアーキテクチャ"
  },
  "number": 2401,
  "created_at": "2019-10-24 04:01:23.390574+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            S. Kent\nRequest for Comments: 2401                                      BBN Corp\nObsoletes: 1825                                              R. Atkinson\nCategory: Standards Track                                  @Home Network\n                                                           November 1998",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Security Architecture for the Internet Protocol",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 0,
      "text": "1. Introduction........................................................3\n  1.1 Summary of Contents of Document..................................3\n  1.2 Audience.........................................................3\n  1.3 Related Documents................................................4\n2. Design Objectives...................................................4\n  2.1 Goals/Objectives/Requirements/Problem Description................4\n  2.2 Caveats and Assumptions..........................................5\n3. System Overview.....................................................5\n  3.1 What IPsec Does..................................................6\n  3.2 How IPsec Works..................................................6\n  3.3 Where IPsec May Be Implemented...................................7\n4. Security Associations...............................................8\n  4.1 Definition and Scope.............................................8\n  4.2 Security Association Functionality..............................10\n  4.3 Combining Security Associations.................................11\n  4.4 Security Association Databases..................................13\n     4.4.1 The Security Policy Database (SPD).........................14\n     4.4.2 Selectors..................................................17\n     4.4.3 Security Association Database (SAD)........................21\n  4.5 Basic Combinations of Security Associations.....................24\n  4.6 SA and Key Management...........................................26\n     4.6.1 Manual Techniques..........................................27\n     4.6.2 Automated SA and Key Management............................27\n     4.6.3 Locating a Security Gateway................................28\n  4.7 Security Associations and Multicast.............................29",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5. IP Traffic Processing..............................................30\n  5.1 Outbound IP Traffic Processing..................................30\n     5.1.1 Selecting and Using an SA or SA Bundle.....................30\n     5.1.2 Header Construction for Tunnel Mode........................31\n        5.1.2.1 IPv4 -- Header Construction for Tunnel Mode...........31\n        5.1.2.2 IPv6 -- Header Construction for Tunnel Mode...........32\n  5.2 Processing Inbound IP Traffic...................................33\n     5.2.1 Selecting and Using an SA or SA Bundle.....................33\n     5.2.2 Handling of AH and ESP tunnels.............................34\n6. ICMP Processing (relevant to IPsec)................................35\n  6.1 PMTU/DF Processing..............................................36\n     6.1.1 DF Bit.....................................................36\n     6.1.2 Path MTU Discovery (PMTU)..................................36\n        6.1.2.1 Propagation of PMTU...................................36\n        6.1.2.2 Calculation of PMTU...................................37\n        6.1.2.3 Granularity of PMTU Processing........................37\n        6.1.2.4 PMTU Aging............................................38\n7. Auditing...........................................................39\n8. Use in Systems Supporting Information Flow Security................39\n  8.1 Relationship Between Security Associations and Data Sensitivity.40\n  8.2 Sensitivity Consistency Checking................................40\n  8.3 Additional MLS Attributes for Security Association Databases....41\n  8.4 Additional Inbound Processing Steps for MLS Networking..........41\n  8.5 Additional Outbound Processing Steps for MLS Networking.........41\n  8.6 Additional MLS Processing for Security Gateways.................42\n9. Performance Issues.................................................42\n10. Conformance Requirements..........................................43\n11. Security Considerations...........................................43\n12. Differences from RFC 1825.........................................43\nAcknowledgements......................................................44\nAppendix A -- Glossary................................................45\nAppendix B -- Analysis/Discussion of PMTU/DF/Fragmentation Issues.....48\n  B.1 DF bit..........................................................48\n  B.2 Fragmentation...................................................48\n  B.3 Path MTU Discovery..............................................52\n     B.3.1 Identifying the Originating Host(s)........................53\n     B.3.2 Calculation of PMTU........................................55\n     B.3.3 Granularity of Maintaining PMTU Data.......................56\n     B.3.4 Per Socket Maintenance of PMTU Data........................57\n     B.3.5 Delivery of PMTU Data to the Transport Layer...............57\n     B.3.6 Aging of PMTU Data.........................................57\nAppendix C -- Sequence Space Window Code Example......................58\nAppendix D -- Categorization of ICMP messages.........................60\nReferences............................................................63\nDisclaimer............................................................64\nAuthor Information....................................................65\nFull Copyright Statement..............................................66",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 0,
      "text": "1.1 Summary of Contents of Document",
      "section_title": true,
      "ja": "文書の内容の概要1.1"
    },
    {
      "indent": 3,
      "text": "This memo specifies the base architecture for IPsec compliant systems. The goal of the architecture is to provide various security services for traffic at the IP layer, in both the IPv4 and IPv6 environments. This document describes the goals of such systems, their components and how they fit together with each other and into the IP environment. It also describes the security services offered by the IPsec protocols, and how these services can be employed in the IP environment. This document does not address all aspects of IPsec architecture. Subsequent documents will address additional architectural details of a more advanced nature, e.g., use of IPsec in NAT environments and more complete support for IP multicast. The following fundamental components of the IPsec security architecture are discussed in terms of their underlying, required functionality. Additional RFCs (see Section 1.3 for pointers to other documents) define the protocols in (a), (c), and (d).",
      "ja": "このメモは、IPsec準拠のシステムのための基本アーキテクチャを指定します。アーキテクチャの目標は、IPv4とIPv6の両方の環境では、IP層でのトラフィックのための様々なセキュリティサービスを提供することです。この文書では、そのようなシステム、その構成要素とそれらがどのように相互に及びIP環境に一緒に収まるの目標を説明します。また、IPsecプロトコルによって提供されるセキュリティサービスを説明し、どのようにこれらのサービスは、IP環境で使用することができます。この文書は、IPsecアーキテクチャのすべての側面に対処しません。以降の文書は、NAT環境およびIPマルチキャストのためのより完全なサポートでは、例えば、より高度な性質のIPsecの使用を追加アーキテクチャの詳細に対処します。 IPsecセキュリティアーキテクチャの以下の基本的なコンポーネントは、その基礎となる、必要な機能性の観点から議論されています。追加のRFC（他の文書へのポインタについては、セクション1.3を参照）は、（a）、（c）のプロトコルを定義し、（D）。"
    },
    {
      "indent": 8,
      "text": "a. Security Protocols -- Authentication Header (AH) and\n   Encapsulating Security Payload (ESP)\nb. Security Associations -- what they are and how they work,\n   how they are managed, associated processing\nc. Key Management -- manual and automatic (The Internet Key\n   Exchange (IKE))\nd. Algorithms for authentication and encryption",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This document is not an overall Security Architecture for the Internet; it addresses security only at the IP layer, provided through the use of a combination of cryptographic and protocol security mechanisms.",
      "ja": "このドキュメントはインターネットの全体的なセキュリティアーキテクチャではありません。それだけで、暗号化およびプロトコルのセキュリティメカニズムの組み合わせの使用を介して提供IP層でのセキュリティに対処します。"
    },
    {
      "indent": 3,
      "text": "The keywords MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD NOT, RECOMMENDED, MAY, and OPTIONAL, when they appear in this document, are to be interpreted as described in RFC 2119 [Bra97].",
      "ja": "彼らは、この文書に表示されるRFC 2119 [Bra97]で説明したように解釈される際のキーワードは、REQUIREDは、、、、、MAY、推奨、およびオプションのすべきでないないものとものとしてはなりませんしなければなりません。"
    },
    {
      "indent": 0,
      "text": "1.2 Audience",
      "section_title": true,
      "ja": "1.2対象読者"
    },
    {
      "indent": 3,
      "text": "The target audience for this document includes implementers of this IP security technology and others interested in gaining a general background understanding of this system. In particular, prospective users of this technology (end users or system administrators) are part of the target audience. A glossary is provided as an appendix to help fill in gaps in background/vocabulary. This document assumes that the reader is familiar with the Internet Protocol, related networking technology, and general security terms and concepts.",
      "ja": "このドキュメントの対象読者は、このIPセキュリティ技術と、このシステムの一般的な背景の理解を得ることに興味を持って他人の実装が含まれています。具体的には、この技術の将来のユーザは（エンドユーザーまたはシステム管理者）ターゲットオーディエンスの一部です。用語集は、バックグラウンド/語彙のギャップを埋めるのに役立つ付録として提供されます。この文書は、読者がインターネットプロトコル、関連するネットワーク技術、および一般的なセキュリティ用語と概念に精通していることを前提としています。"
    },
    {
      "indent": 0,
      "text": "1.3 Related Documents",
      "section_title": true,
      "ja": "1.3関連ドキュメント"
    },
    {
      "indent": 3,
      "text": "As mentioned above, other documents provide detailed definitions of some of the components of IPsec and of their inter-relationship. They include RFCs on the following topics:",
      "ja": "前述したように、他の文書は、IPsecのとそれらの相互関係の部品のいくつかの詳細な定義を提供しています。彼らは、以下のトピックに関するRFCを含めます："
    },
    {
      "indent": 8,
      "text": "a. \"IP Security Document Roadmap\" [TDG97] -- a document\n   providing guidelines for specifications describing encryption\n   and authentication algorithms used in this system.\nb. security protocols -- RFCs describing the Authentication\n   Header (AH) [KA98a] and Encapsulating Security Payload (ESP)\n   [KA98b] protocols.\nc. algorithms for authentication and encryption -- a separate\n   RFC for each algorithm.\nd. automatic key management -- RFCs on \"The Internet Key\n   Exchange (IKE)\" [HC98], \"Internet Security Association and\n   Key Management Protocol (ISAKMP)\" [MSST97],\"The OAKLEY Key\n   Determination Protocol\" [Orm97], and \"The Internet IP\n   Security Domain of Interpretation for ISAKMP\" [Pip98].",
      "raw": true
    },
    {
      "indent": 0,
      "text": "2. Design Objectives",
      "section_title": true,
      "ja": "2.設計目標"
    },
    {
      "indent": 0,
      "text": "2.1 Goals/Objectives/Requirements/Problem Description",
      "section_title": true,
      "ja": "2.1目標/目的/要件/問題の説明"
    },
    {
      "indent": 3,
      "text": "IPsec is designed to provide interoperable, high quality, cryptographically-based security for IPv4 and IPv6. The set of security services offered includes access control, connectionless integrity, data origin authentication, protection against replays (a form of partial sequence integrity), confidentiality (encryption), and limited traffic flow confidentiality. These services are provided at the IP layer, offering protection for IP and/or upper layer protocols.",
      "ja": "IPsecが相互運用可能、高品質、IPv4およびIPv6のため、暗号ベースのセキュリティを提供するように設計されています。提供されるセキュリティサービスのセットは、アクセス制御、コネクションレスインテグリティ、データ送信元認証、リプレイに対する保護（部分的なシーケンスインテグリティの形式）、機密性（暗号化）、および限定されたトラフィックフローの機密性を含んでいます。これらのサービスは、IPおよび/または上位層プロトコルの保護を提供し、IP層において提供されています。"
    },
    {
      "indent": 3,
      "text": "These objectives are met through the use of two traffic security protocols, the Authentication Header (AH) and the Encapsulating Security Payload (ESP), and through the use of cryptographic key management procedures and protocols. The set of IPsec protocols employed in any context, and the ways in which they are employed, will be determined by the security and system requirements of users, applications, and/or sites/organizations.",
      "ja": "これらの目的は、2つのトラフィックセキュリティプロトコルを使用して満たされている、認証ヘッダー（AH）とカプセル化セキュリティペイロード（ESP）、および暗号鍵管理手順とプロトコルを使用して。 IPsecどんな文脈で用いたプロトコル、およびそれらが採用される方法のセットは、ユーザー、アプリケーション、および/またはサイト/組織のセキュリティとシステム要件によって決定されます。"
    },
    {
      "indent": 3,
      "text": "When these mechanisms are correctly implemented and deployed, they ought not to adversely affect users, hosts, and other Internet components that do not employ these security mechanisms for protection of their traffic. These mechanisms also are designed to be algorithm-independent. This modularity permits selection of different sets of algorithms without affecting the other parts of the implementation. For example, different user communities may select different sets of algorithms (creating cliques) if required.",
      "ja": "これらのメカニズムは正しく実装して展開されたとき、彼らは悪彼らのトラフィックを保護するため、これらのセキュリティ・メカニズムを採用していないユーザ、ホスト、および他のインターネットコンポーネントに影響を与えるべきではありません。これらのメカニズムは、アルゴリズムに依存しないように設計されています。このモジュールは、実装の他の部分に影響を与えることなく、アルゴリズムの異なるセットの選択を可能にします。例えば、異なるユーザコミュニティは必要に応じてアルゴリズム（クリークを作成）の異なるセットを選択してもよいです。"
    },
    {
      "indent": 3,
      "text": "A standard set of default algorithms is specified to facilitate interoperability in the global Internet. The use of these algorithms, in conjunction with IPsec traffic protection and key management protocols, is intended to permit system and application developers to deploy high quality, Internet layer, cryptographic security technology.",
      "ja": "デフォルトのアルゴリズムの標準セットは、グローバルなインターネットでの相互運用性を促進するために指定されています。これらのアルゴリズムの使用は、IPsecトラフィックの保護と鍵管理プロトコルと連動して、高品質、インターネット層、暗号化セキュリティ技術を導入するためのシステムおよびアプリケーション開発者を可能にすることを意図しています。"
    },
    {
      "indent": 0,
      "text": "2.2 Caveats and Assumptions",
      "section_title": true,
      "ja": "2.2警告および仮定"
    },
    {
      "indent": 3,
      "text": "The suite of IPsec protocols and associated default algorithms are designed to provide high quality security for Internet traffic. However, the security offered by use of these protocols ultimately depends on the quality of the their implementation, which is outside the scope of this set of standards. Moreover, the security of a computer system or network is a function of many factors, including personnel, physical, procedural, compromising emanations, and computer security practices. Thus IPsec is only one part of an overall system security architecture.",
      "ja": "IPsecプロトコルと関連付けられているデフォルトのアルゴリズムのスイートは、インターネットトラフィックのための高品質なセキュリティを提供するために設計されています。しかし、これらのプロトコルを使用することによって提供されるセキュリティは、最終的には標準規格のこのセットの範囲外であるそれらの実装の品質に依存します。また、コンピュータシステムやネットワークのセキュリティは、人員、物理的、手続き的、妥協発散、及びコンピュータ・セキュリティ・プラクティスを含む多くの要因の関数です。したがって、IPsecは、システム全体のセキュリティアーキテクチャの一部でしかありません。"
    },
    {
      "indent": 3,
      "text": "Finally, the security afforded by the use of IPsec is critically dependent on many aspects of the operating environment in which the IPsec implementation executes. For example, defects in OS security, poor quality of random number sources, sloppy system management protocols and practices, etc. can all degrade the security provided by IPsec. As above, none of these environmental attributes are within the scope of this or other IPsec standards.",
      "ja": "最後に、IPsecの使用によってもたらされるセキュリティは、IPsec実装が実行される動作環境の多くの側面に決定的に依存しています。例えば、等OSのセキュリティ、乱数源、ずさんなシステム管理プロトコルと実践の質の悪い、の欠陥は、すべてのは、IPsecによって提供されるセキュリティを低下させる可能性があります。上記のように、これらの環境属性のどれもが、このまたは他のIPsec規格の範囲内ではありません。"
    },
    {
      "indent": 0,
      "text": "3. System Overview",
      "section_title": true,
      "ja": "3.システムの概要"
    },
    {
      "indent": 3,
      "text": "This section provides a high level description of how IPsec works, the components of the system, and how they fit together to provide the security services noted above. The goal of this description is to enable the reader to \"picture\" the overall process/system, see how it fits into the IP environment, and to provide context for later sections of this document, which describe each of the components in more detail.",
      "ja": "このセクションでは、IPsecがどのように動作するかの高レベルの記述、システムのコンポーネントを提供し、どのように彼らは、上記のセキュリティサービスを提供するために一緒に収まります。この説明の目的は、読者への「絵」全体のプロセス/システムを有効にするにはIP環境にどのように適合するかを見て、より詳細に各コンポーネントを説明し、このドキュメントの後のセクションのためのコンテキストを提供することです。"
    },
    {
      "indent": 3,
      "text": "An IPsec implementation operates in a host or a security gateway environment, affording protection to IP traffic. The protection offered is based on requirements defined by a Security Policy Database (SPD) established and maintained by a user or system administrator, or by an application operating within constraints established by either of the above. In general, packets are selected for one of three processing modes based on IP and transport layer header information (Selectors, Section 4.4.2) matched against entries in the database (SPD). Each packet is either afforded IPsec security services, discarded, or allowed to bypass IPsec, based on the applicable database policies identified by the Selectors.",
      "ja": "IPsec実装は、IPトラフィックに保護を与える、ホストまたはセキュリティゲートウェイ環境で動作します。提供される保護は、ユーザーまたはシステム管理者によって、または上記のいずれかによって確立された制約の範囲内で動作するアプリケーションによって確立され、維持セキュリティポリシーデータベース（SPD）によって定義された要件に基づいています。一般的に、パケットは、IPとデータベース（SPD）内のエントリと照合トランスポート層ヘッダ情報（セレクタ、セクション4.4.2）に基づいて、3つの処理モードのいずれかのために選択されます。各パケットは、IPsecセキュリティサービスを与え、廃棄、またはセレクタで識別される該当するデータベースのポリシーに基づいてIPsecを、バイパスを許可されますか。"
    },
    {
      "indent": 0,
      "text": "3.1 What IPsec Does",
      "section_title": true,
      "ja": "IPsecは何3.1"
    },
    {
      "indent": 3,
      "text": "IPsec provides security services at the IP layer by enabling a system to select required security protocols, determine the algorithm(s) to use for the service(s), and put in place any cryptographic keys required to provide the requested services. IPsec can be used to protect one or more \"paths\" between a pair of hosts, between a pair of security gateways, or between a security gateway and a host. (The term \"security gateway\" is used throughout the IPsec documents to refer to an intermediate system that implements IPsec protocols. For example, a router or a firewall implementing IPsec is a security gateway.)",
      "ja": "IPsecは、要求されたサービスを提供するために必要な暗号鍵をサービス（複数可）に使用するアルゴリズム（複数可）を決定し、所定の位置に入れ、必要なセキュリティ・プロトコルを選択するためのシステムを有効にすることで、IP層でのセキュリティサービスを提供します。 IPsecは、セキュリティゲートウェイのペア間、またはセキュリティゲートウェイとホストの間、ホストのペア間の1つ以上の「パス」を保護するために使用することができます。 （用語「セキュリティゲートウェイが」IPsecプロトコルを実装中間システムを参照するためのIPsec文書全体を通して使用される。例えば、ルータやIPsecを実装するファイアウォールはセキュリティゲートウェイです。）"
    },
    {
      "indent": 3,
      "text": "The set of security services that IPsec can provide includes access control, connectionless integrity, data origin authentication, rejection of replayed packets (a form of partial sequence integrity), confidentiality (encryption), and limited traffic flow confidentiality. Because these services are provided at the IP layer, they can be used by any higher layer protocol, e.g., TCP, UDP, ICMP, BGP, etc.",
      "ja": "IPsecが提供するセキュリティサービスのセットは、アクセス制御、コネクションレスインテグリティ、データ送信元認証、リプレイパケットの拒否（部分的なシーケンスインテグリティの形式）、機密性（暗号化）、および限定されたトラフィックフローの機密性を含んでいます。これらのサービスはIP層において提供されているので、それらは任意の上位層プロトコル、例えば、TCP、UDP、ICMP、BGPなどで使用することができます"
    },
    {
      "indent": 3,
      "text": "The IPsec DOI also supports negotiation of IP compression [SMPT98], motivated in part by the observation that when encryption is employed within IPsec, it prevents effective compression by lower protocol layers.",
      "ja": "IPsecのDOIはまた、暗号化のIPsec内で使用されるとき、それは、より低いプロトコル層によって効果的な圧縮を防止することを観察することによって部分的に動機付けIP圧縮[SMPT98]のネゴシエーションをサポートします。"
    },
    {
      "indent": 0,
      "text": "3.2 How IPsec Works",
      "section_title": true,
      "ja": "3.2どのようにIPsecの作品"
    },
    {
      "indent": 3,
      "text": "IPsec uses two protocols to provide traffic security -- Authentication Header (AH) and Encapsulating Security Payload (ESP). Both protocols are described in more detail in their respective RFCs [KA98a, KA98b].",
      "ja": "認証ヘッダー（AH）とカプセル化セキュリティペイロード（ESP） -  IPsecはトラフィックセキュリティを提供するために、2つのプロトコルを使用しています。両方のプロトコルは、それぞれのRFC [KA98a、KA98b]に詳細に記載されています。"
    },
    {
      "indent": 8,
      "text": "o The IP Authentication Header (AH) [KA98a] provides\n  connectionless integrity, data origin authentication, and an\n  optional anti-replay service.\no The Encapsulating Security Payload (ESP) protocol [KA98b] may\n  provide confidentiality (encryption), and limited traffic flow\n  confidentiality.  It also may provide connectionless integrity, data origin authentication, and an anti-replay\n  service.  (One or the other set of these security services\n  must be applied whenever ESP is invoked.)\no Both AH and ESP are vehicles for access control, based on the\n  distribution of cryptographic keys and the management of\n  traffic flows relative to these security protocols.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "These protocols may be applied alone or in combination with each other to provide a desired set of security services in IPv4 and IPv6. Each protocol supports two modes of use: transport mode and tunnel mode. In transport mode the protocols provide protection primarily for upper layer protocols; in tunnel mode, the protocols are applied to tunneled IP packets. The differences between the two modes are discussed in Section 4.",
      "ja": "これらのプロトコルは、IPv4とIPv6のセキュリティサービスの所望のセットを提供するために、相互に単独または組み合わせて適用することができます。トランスポートモードとトンネルモード：各プロトコルは、使用の二つのモードをサポートします。トランスポートモードでは、プロトコルは、主に上位層プロトコルのための保護を提供します。トンネルモードでは、プロトコルは、トンネルIPパケットに適用されます。 2つのモードの違いは、第4節で議論されています。"
    },
    {
      "indent": 3,
      "text": "IPsec allows the user (or system administrator) to control the granularity at which a security service is offered. For example, one can create a single encrypted tunnel to carry all the traffic between two security gateways or a separate encrypted tunnel can be created for each TCP connection between each pair of hosts communicating across these gateways. IPsec management must incorporate facilities for specifying:",
      "ja": "IPsecはユーザ（またはシステム管理者）は、セキュリティサービスが提供される粒度を制御することを可能にします。例えば、一方が2つのセキュリティゲートウェイまたは別個暗号化トンネルとの間のすべてのトラフィックがこれらのゲートウェイを介して通信するホストの各対の間にそれぞれのTCP接続のために作成することができる運ぶために単一の暗号化されたトンネルを作成することができます。 IPsecの管理が指定するための設備を組み込む必要があります。"
    },
    {
      "indent": 8,
      "text": "o which security services to use and in what combinations\no the granularity at which a given security protection should be\n  applied\no the algorithms used to effect cryptographic-based security",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Because these security services use shared secret values (cryptographic keys), IPsec relies on a separate set of mechanisms for putting these keys in place. (The keys are used for authentication/integrity and encryption services.) This document requires support for both manual and automatic distribution of keys. It specifies a specific public-key based approach (IKE -- [MSST97, Orm97, HC98]) for automatic key management, but other automated key distribution techniques MAY be used. For example, KDC-based systems such as Kerberos and other public-key systems such as SKIP could be employed.",
      "ja": "これらのセキュリティサービスは、共有秘密値（暗号化キー）を使用しているため、IPsecは場所にこれらのキーを置くためのメカニズムの個別のセットに依存しています。 （キーは認証/暗号化の整合性とサービスのために使用されます。）この文書は、キーの手動および自動配布のためのサポートが必要です。自動キー管理のために、他の自動化された鍵配布技術が使用されてもよい - それは、特定の公開鍵ベースのアプローチ（[MSST97、Orm97、HC98] IKE）を指定します。例えば、そのようなケルベロスなどSKIPなどの他の公開鍵システムとしてKDCベースのシステムを使用することができます。"
    },
    {
      "indent": 0,
      "text": "3.3 Where IPsec May Be Implemented",
      "section_title": true,
      "ja": "IPsecを実装することができる3.3"
    },
    {
      "indent": 3,
      "text": "There are several ways in which IPsec may be implemented in a host or in conjunction with a router or firewall (to create a security gateway). Several common examples are provided below:",
      "ja": "IPsecは（セキュリティゲートウェイを作成するために）ホストまたはルータやファイアウォールと連携して実施することができるいくつかの方法があります。いくつかの一般的な例を以下に提供されています。"
    },
    {
      "indent": 8,
      "text": "a. Integration of IPsec into the native IP implementation.  This\n   requires access to the IP source code and is applicable to\n   both hosts and security gateways.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "b. \"Bump-in-the-stack\" (BITS) implementations, where IPsec is implemented \"underneath\" an existing implementation of an IP protocol stack, between the native IP and the local network drivers. Source code access for the IP stack is not required in this context, making this implementation approach appropriate for use with legacy systems. This approach, when it is adopted, is usually employed in hosts.",
      "ja": "B。 「バンプ・スタックの」IPsecがネイティブIPとローカルネットワークドライバの間で、IPプロトコルスタックの「下に」既存の実装が実現される（BITS）の実装、。 IPスタックのソースコードへのアクセスは、レガシーシステムでの使用に適し、この実装アプローチを作り、この文脈では必要ありません。これを採用した場合、このアプローチは、通常のホストで使用されます。"
    },
    {
      "indent": 8,
      "text": "c. The use of an outboard crypto processor is a common design feature of network security systems used by the military, and of some commercial systems as well. It is sometimes referred to as a \"Bump-in-the-wire\" (BITW) implementation. Such implementations may be designed to serve either a host or a gateway (or both). Usually the BITW device is IP addressable. When supporting a single host, it may be quite analogous to a BITS implementation, but in supporting a router or firewall, it must operate like a security gateway.",
      "ja": "C。船外暗号プロセッサの使用は、同様に、軍が使用したネットワークセキュリティシステムの共通設計上の特徴であり、いくつかの商用システムの。これは時々「バンプ・イン・ザ・ワイヤ」（BITW）実装と呼ばれています。そのような実装は、ホストまたはゲートウェイ（あるいは両方）を提供するように設計することができます。通常、BITWデバイスは、IPアドレス指定可能です。単一のホストをサポートしている場合は、BITS実装に非常に類似したかもしれないが、ルーターまたはファイアウォールをサポートするには、セキュリティゲートウェイのように動作しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Security Associations",
      "section_title": true,
      "ja": "4.セキュリティアソシエーション"
    },
    {
      "indent": 3,
      "text": "This section defines Security Association management requirements for all IPv6 implementations and for those IPv4 implementations that implement AH, ESP, or both. The concept of a \"Security Association\" (SA) is fundamental to IPsec. Both AH and ESP make use of SAs and a major function of IKE is the establishment and maintenance of Security Associations. All implementations of AH or ESP MUST support the concept of a Security Association as described below. The remainder of this section describes various aspects of Security Association management, defining required characteristics for SA policy management, traffic processing, and SA management techniques.",
      "ja": "このセクションでは、すべてのIPv6実装のためとAH、ESP、または両方を実装し、それらのIPv4の実装のためのセキュリティアソシエーションの管理要件を定義します。 「セキュリティアソシエーション」（SA）の概念は、IPsecの基本です。 AHとESPの両方がSAを利用すると、IKEの主要な機能は、セキュリティアソシエーションの確立と維持です。後述のようにAHまたはESPのすべての実装は、セキュリティアソシエーションの概念をサポートしなければなりません。このセクションの残りの部分は、SAポリシー管理、トラフィック処理、SA管理技術に要求される特性を定義する、セキュリティアソシエーション管理のさまざまな側面を記述する。"
    },
    {
      "indent": 0,
      "text": "4.1 Definition and Scope",
      "section_title": true,
      "ja": "4.1定義と範囲"
    },
    {
      "indent": 3,
      "text": "A Security Association (SA) is a simplex \"connection\" that affords security services to the traffic carried by it. Security services are afforded to an SA by the use of AH, or ESP, but not both. If both AH and ESP protection is applied to a traffic stream, then two (or more) SAs are created to afford protection to the traffic stream. To secure typical, bi-directional communication between two hosts, or between two security gateways, two Security Associations (one in each direction) are required.",
      "ja": "セキュリティアソシエーション（SA）、それによって運ばれるトラフィックにセキュリティサービスを提供シンプレックス「接続」です。セキュリティサービスは、両方ではなく、AH、またはESPを使用してSAに与えています。 AHとESP保護の両方がトラフィックストリームに適用されている場合は、2つ（またはそれ以上）のSAは、トラフィックストリームに保護を提供するために作成されます。 2つのホスト間、または2つのセキュリティゲートウェイとの間の典型的な、双方向通信を確保するために、2つのセキュリティアソシエーション（各方向に1つずつ）が必要です。"
    },
    {
      "indent": 3,
      "text": "A security association is uniquely identified by a triple consisting of a Security Parameter Index (SPI), an IP Destination Address, and a security protocol (AH or ESP) identifier. In principle, the Destination Address may be a unicast address, an IP broadcast address, or a multicast group address. However, IPsec SA management mechanisms currently are defined only for unicast SAs. Hence, in the discussions that follow, SAs will be described in the context of point-to-point communication, even though the concept is applicable in the point-to-multipoint case as well.",
      "ja": "セキュリティアソシエーションは、一意のセキュリティパラメータインデックス（SPI）、IP宛先アドレス、およびセキュリティプロトコル（AHまたはESP）識別子からなる三重によって識別されます。原則として、宛先アドレスがユニキャストアドレス、IPブロードキャストアドレス、またはマルチキャストグループアドレスであってもよいです。しかし、IPsecのSA管理の仕組みは現在、ユニキャストSAの定義されています。したがって、以下の説明では、SAは概念は同様にポイント・ツー・マルチポイントの場合に適用可能であっても、ポイント・ツー・ポイント通信の文脈で説明します。"
    },
    {
      "indent": 3,
      "text": "As noted above, two types of SAs are defined: transport mode and tunnel mode. A transport mode SA is a security association between two hosts. In IPv4, a transport mode security protocol header appears immediately after the IP header and any options, and before any higher layer protocols (e.g., TCP or UDP). In IPv6, the security protocol header appears after the base IP header and extensions, but may appear before or after destination options, and before higher layer protocols. In the case of ESP, a transport mode SA provides security services only for these higher layer protocols, not for the IP header or any extension headers preceding the ESP header. In the case of AH, the protection is also extended to selected portions of the IP header, selected portions of extension headers, and selected options (contained in the IPv4 header, IPv6 Hop-by-Hop extension header, or IPv6 Destination extension headers). For more details on the coverage afforded by AH, see the AH specification [KA98a].",
      "ja": "上述のように、SAの二つのタイプが定義されている：トランスポートモードとトンネルモード。トランスポートモードSAは、2つのホスト間のセキュリティアソシエーションです。 IPv4では、トランスポート・モードのセキュリティ・プロトコル・ヘッダは、直ちにIPヘッダと任意のオプションの後に、任意の上位層プロトコル（例えば、TCPまたはUDP）の前に現れます。 IPv6では、セキュリティプロトコルヘッダは、ベースIPヘッダおよび拡張後に表示されますが、先のオプションの前または後に、上位層プロトコルの前に表示されることがあります。 ESPの場合には、トランスポートモードSAは、これらの上位層プロトコルのためではなく、IPヘッダまたはESPヘッダに先行する任意の拡張ヘッダのセキュリティサービスを提供します。 AHの場合には、保護はまた、（IPv4ヘッダに含まれる、IPv6のホップバイホップ拡張ヘッダ、またはIPv6宛先拡張ヘッダ）オプションは、IPヘッダの選択された部分まで延長拡張ヘッダの部分を選択し、選択され。 AHによって与えられるカバレッジの詳細については、[KA98a] AH仕様を参照してください。"
    },
    {
      "indent": 3,
      "text": "A tunnel mode SA is essentially an SA applied to an IP tunnel. Whenever either end of a security association is a security gateway, the SA MUST be tunnel mode. Thus an SA between two security gateways is always a tunnel mode SA, as is an SA between a host and a security gateway. Note that for the case where traffic is destined for a security gateway, e.g., SNMP commands, the security gateway is acting as a host and transport mode is allowed. But in that case, the security gateway is not acting as a gateway, i.e., not transiting traffic. Two hosts MAY establish a tunnel mode SA between themselves. The requirement for any (transit traffic) SA involving a security gateway to be a tunnel SA arises due to the need to avoid potential problems with regard to fragmentation and reassembly of IPsec packets, and in circumstances where multiple paths (e.g., via different security gateways) exist to the same destination behind the security gateways.",
      "ja": "トンネルモードSAは、本質的にSAがIPトンネルに適用されます。セキュリティアソシエーションの両端は、セキュリティゲートウェイであるときはいつでも、SAはトンネルモードでなければなりません。ホストとセキュリティゲートウェイとの間のSAのようしたがって、2つのセキュリティゲートウェイ間のSAは、常にトンネルモードSAです。ホストと輸送モードが許可されるトラフィックは、セキュリティゲートウェイを宛先とする場合、例えば、SNMPコマンドで、セキュリティゲートウェイが機能していることに留意されたいです。しかし、その場合には、セキュリティゲートウェイは、トラフィックを通過いない、すなわち、ゲートウェイとして動作していません。二つのホストは、それらの間のトンネルモードSAを確立することができます。異なるセキュリティゲートウェイを介して、例えば、（SAは、IPsecパケットのフラグメンテーションおよび再組み立てに関する潜在的な問題を回避する必要性に起因して生じるトンネルするセキュリティゲートウェイを含む、そして状況に複数の経路の任意の（通過トラフィック）SAの要件）セキュリティゲートウェイの背後にある同じ宛先に存在します。"
    },
    {
      "indent": 3,
      "text": "For a tunnel mode SA, there is an \"outer\" IP header that specifies the IPsec processing destination, plus an \"inner\" IP header that specifies the (apparently) ultimate destination for the packet. The security protocol header appears after the outer IP header, and before the inner IP header. If AH is employed in tunnel mode, portions of the outer IP header are afforded protection (as above), as well as all of the tunneled IP packet (i.e., all of the inner IP header is protected, as well as higher layer protocols). If ESP is employed, the protection is afforded only to the tunneled packet, not to the outer header.",
      "ja": "トンネルモードSAは、IPsec処理先を指定する「外側」IPヘッダに加え、パケットの（明らかに）最終的な宛先を指定し、「内側」IPヘッダがあります。セキュリティ・プロトコル・ヘッダは、外側IPヘッダの後に表示され、内側のIPヘッダの前に。 AHがトンネルモードで使用される場合、外側のIPヘッダの部分は、（上記のように）保護、ならびにトンネル化IPパケットの全て（すなわち、内側IPヘッダのすべての保護され、並びに上位層プロトコル）を得れます。 ESPを使用する場合、保護はしない外側のヘッダに、唯一のトンネリングされたパケットに与えられます。"
    },
    {
      "indent": 3,
      "text": "In summary, a) A host MUST support both transport and tunnel mode. b) A security gateway is required to support only tunnel mode. If it supports transport mode, that should be used only when the security gateway is acting as a host, e.g., for network management.",
      "ja": "要約すると、A）ホストは、トランスポートとトンネルモードの両方をサポートしなければなりません。 b）は、セキュリティゲートウェイは、トンネルモードのみをサポートするために必要とされます。それは、トランスポートモードをサポートしている場合、それはセキュリティゲートウェイは、ネットワーク管理のために、例えば、ホストとして動作している場合にのみ使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.2 Security Association Functionality",
      "section_title": true,
      "ja": "4.2セキュリティアソシエーションの機能"
    },
    {
      "indent": 3,
      "text": "The set of security services offered by an SA depends on the security protocol selected, the SA mode, the endpoints of the SA, and on the election of optional services within the protocol. For example, AH provides data origin authentication and connectionless integrity for IP datagrams (hereafter referred to as just \"authentication\"). The \"precision\" of the authentication service is a function of the granularity of the security association with which AH is employed, as discussed in Section 4.4.2, \"Selectors\".",
      "ja": "SAが提供するセキュリティサービスのセットが選択されたセキュリティプロトコル、SAモード、SAのエンドポイント上、およびプロトコル内のオプションサービスの選挙によって異なります。例えば、AHは、データ発信元認証と（以下、単に「認証」と呼ばれる）IPデータグラムのためのコネクションレス整合性を提供します。 4.4.2、「セレクタ」で説明したように、認証サービスの「精度」は、AHが使用されるセキュリティアソシエーションの粒度の関数です。"
    },
    {
      "indent": 3,
      "text": "AH also offers an anti-replay (partial sequence integrity) service at the discretion of the receiver, to help counter denial of service attacks. AH is an appropriate protocol to employ when confidentiality is not required (or is not permitted, e.g , due to government restrictions on use of encryption). AH also provides authentication for selected portions of the IP header, which may be necessary in some contexts. For example, if the integrity of an IPv4 option or IPv6 extension header must be protected en route between sender and receiver, AH can provide this service (except for the non-predictable but mutable parts of the IP header.)",
      "ja": "AHは、サービス攻撃のカウンター拒否を助けるために、受信機の裁量で抗リプレイ（部分配列の整合性）サービスを提供しています。 AHは、機密性が（による暗号化の使用に関する政府の規制に、例えば、または許可されていません）が必要とされていない場合に利用するために適切なプロトコルです。 AHはまた、いくつかの状況において必要かもしれないIPヘッダの選択された部分のための認証を提供します。例えば、IPv4のオプションまたはIPv6拡張ヘッダの完全性は、送信側と受信側との間の途中で保護されなければならない場合、AHは、（IPヘッダの非予測できるが、可変部分を除く。）は、このサービスを提供することができます"
    },
    {
      "indent": 3,
      "text": "ESP optionally provides confidentiality for traffic. (The strength of the confidentiality service depends in part, on the encryption algorithm employed.) ESP also may optionally provide authentication (as defined above). If authentication is negotiated for an ESP SA, the receiver also may elect to enforce an anti-replay service with the same features as the AH anti-replay service. The scope of the authentication offered by ESP is narrower than for AH, i.e., the IP header(s) \"outside\" the ESP header is(are) not protected. If only the upper layer protocols need to be authenticated, then ESP authentication is an appropriate choice and is more space efficient than use of AH encapsulating ESP. Note that although both confidentiality and authentication are optional, they cannot both be omitted. At least one of them MUST be selected.",
      "ja": "ESPは、必要に応じて、トラフィックの機密性を提供します。 （機密性サービスの強度は、使用する暗号化アルゴリズムに一部依存する。）（上記で定義した通り）ESPはまた、必要に応じて認証を提供することができます。認証がESP SAのために交渉されている場合、受信機は、AHアンチリプレイサービスと同じ機能を持つアンチリプレイサービスを適用することを選択することができます。 ESPが提供する認証の範囲AHよりも狭くなっている、すなわち、IPヘッダ（S）（ARE）ESPヘッダが「外部」が保護されていません。唯一の上位層プロトコルが認証する必要がある場合には、ESP認証は適切な選択であり、AHカプセル化ESPを使用するよりも効率的に多くのスペースです。機密性と認証の両方がオプションであるが、彼らは両方とも省略することができないことに注意してください。それらのうちの少なくとも1つは選択する必要があります。"
    },
    {
      "indent": 3,
      "text": "If confidentiality service is selected, then an ESP (tunnel mode) SA between two security gateways can offer partial traffic flow confidentiality. The use of tunnel mode allows the inner IP headers to be encrypted, concealing the identities of the (ultimate) traffic source and destination. Moreover, ESP payload padding also can be invoked to hide the size of the packets, further concealing the external characteristics of the traffic. Similar traffic flow confidentiality services may be offered when a mobile user is assigned a dynamic IP address in a dialup context, and establishes a (tunnel mode) ESP SA to a corporate firewall (acting as a security gateway). Note that fine granularity SAs generally are more vulnerable to traffic analysis than coarse granularity ones which are carrying traffic from many subscribers.",
      "ja": "機密性サービスが選択されている場合には、2つのセキュリティゲートウェイ間のESP（トンネルモード）SAは、部分的なトラフィックフローの機密性を提供することができます。トンネルモードを使用することは、（最終的な）トラフィックの送信元および宛先のアイデンティティを隠す、内側IPヘッダが暗号化されることを可能にします。また、ESPペイロードパディングはまた、トラフィックの外部特性を隠す、パケットの大きさを隠すために呼び出すことができます。同様のトラフィックフロー機密性サービスは、（セキュリティゲートウェイとして機能する）モバイルユーザがダイヤルアップ・コンテキストの動的IPアドレスが割り当てられている場合に提供され、企業のファイアウォールに（トンネルモード）ESP SAを確立することができます。細かい粒度SAは、一般的に多くの加入者からのトラフィックを運んでいるの粗い粒度のものよりもトラフィック解析に対してより脆弱であることに注意してください。"
    },
    {
      "indent": 0,
      "text": "4.3 Combining Security Associations",
      "section_title": true,
      "ja": "4.3セキュリティアソシエーションを組み合わせます"
    },
    {
      "indent": 3,
      "text": "The IP datagrams transmitted over an individual SA are afforded protection by exactly one security protocol, either AH or ESP, but not both. Sometimes a security policy may call for a combination of services for a particular traffic flow that is not achievable with a single SA. In such instances it will be necessary to employ multiple SAs to implement the required security policy. The term \"security association bundle\" or \"SA bundle\" is applied to a sequence of SAs through which traffic must be processed to satisfy a security policy. The order of the sequence is defined by the policy. (Note that the SAs that comprise a bundle may terminate at different endpoints. For example, one SA may extend between a mobile host and a security gateway and a second, nested SA may extend to a host behind the gateway.)",
      "ja": "個々のSA上で送信されたIPデータグラムは、正確に一つのセキュリティプロトコル、AHまたはESPのどちらかではなく、両方によって保護を与えています。時には、セキュリティポリシーは、単一のSAで達成可能ではない、特定のトラフィックフローのためのサービスの組み合わせのために呼び出すことができます。そのような場合には必要なセキュリティポリシーを実装するために複数のSAを使用することが必要になります。用語「セキュリティアソシエーションバンドル」または「SAバンドルは」トラフィックがセキュリティポリシーを満たすために処理されなければならない、それを通してSAのシーケンスに適用されます。シーケンスの順序は、ポリシーで定義されています。 （バンドルを含むSAが異なるエンドポイントで終了してもよいことに留意されたい。例えば、一つのSAがモバイルホストとセキュリティゲートウェイと第二との間に延びることができる、ネストされたSAはゲートウェイの背後のホストに延びていてもよいです。）"
    },
    {
      "indent": 3,
      "text": "Security associations may be combined into bundles in two ways: transport adjacency and iterated tunneling.",
      "ja": "トランスポート隣接と反復トンネリング：セキュリティアソシエーションは、2つの方法で束に組み合わせることができます。"
    },
    {
      "indent": 11,
      "text": "o Transport adjacency refers to applying more than one\n  security protocol to the same IP datagram, without invoking\n  tunneling.  This approach to combining AH and ESP allows\n  for only one level of combination; further nesting yields\n  no added benefit (assuming use of adequately strong\n  algorithms in each protocol) since the processing is\n  performed at one IPsec instance at the (ultimate)\n  destination.",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Host 1 --- Security ---- Internet -- Security --- Host 2\n | |        Gwy 1                      Gwy 2        | |\n | |                                                | |\n | -----Security Association 1 (ESP transport)------- |\n |                                                    |\n -------Security Association 2 (AH transport)----------",
      "raw": true
    },
    {
      "indent": 11,
      "text": "o Iterated tunneling refers to the application of multiple layers of security protocols effected through IP tunneling. This approach allows for multiple levels of nesting, since each tunnel can originate or terminate at a different IPsec site along the path. No special treatment is expected for ISAKMP traffic at intermediate security gateways other than what can be specified through appropriate SPD entries (See Case 3 in Section 4.5)",
      "ja": "O反復トンネリングは、IPトンネルを介して行うセキュリティプロトコルの複数の層の適用を指します。各トンネルは、経路に沿った別のIPsecサイトで発信または終了することができるので、このアプローチは、ネストの複数のレベルを可能にします。特別な治療法は、適切なSPDのエントリを指定することができるもの以外の中間のセキュリティゲートウェイでのISAKMPトラフィックに対して予想されていない（4.5節にケース3を参照してください）"
    },
    {
      "indent": 13,
      "text": "There are 3 basic cases of iterated tunneling -- support is required only for cases 2 and 3.:",
      "ja": "反復トンネリングの3つの基本的な例があります - サポートは唯一の例2及び3のために必要です："
    },
    {
      "indent": 13,
      "text": "1. both endpoints for the SAs are the same -- The inner and outer tunnels could each be either AH or ESP, though it is unlikely that Host 1 would specify both to be the same, i.e., AH inside of AH or ESP inside of ESP.",
      "ja": "SAの1両方のエンドポイントは同じである - ホスト1の両方が内部AHまたはESPの内部同じ、すなわち、AHであることを指定するとは考えにくいですが、内側および外側のトンネルは、それぞれ、AHまたはESPのいずれかとすることができますESP。"
    },
    {
      "indent": 16,
      "text": "Host 1 --- Security ---- Internet -- Security --- Host 2\n | |        Gwy 1                      Gwy 2        | |\n | |                                                | |\n | -------Security Association 1 (tunnel)---------- | |\n |                                                    |\n ---------Security Association 2 (tunnel)--------------",
      "raw": true
    },
    {
      "indent": 13,
      "text": "2. one endpoint of the SAs is the same -- The inner and uter tunnels could each be either AH or ESP.",
      "ja": "SAの前記一方のエンドポイントが同じである - 内側及びuterトンネルはそれぞれAHまたはESPのいずれかとすることができます。"
    },
    {
      "indent": 16,
      "text": "Host 1 --- Security ---- Internet -- Security --- Host 2\n | |        Gwy 1                      Gwy 2         |\n | |                                     |           |\n | ----Security Association 1 (tunnel)----           |\n |                                                   |\n ---------Security Association 2 (tunnel)-------------",
      "raw": true
    },
    {
      "indent": 13,
      "text": "3. neither endpoint is the same -- The inner and outer tunnels could each be either AH or ESP.",
      "ja": "3.どちらのエンドポイントは、同じである - 内側および外側のトンネルがそれぞれAHまたはESPのいずれかとすることができます。"
    },
    {
      "indent": 16,
      "text": "Host 1 --- Security ---- Internet -- Security --- Host 2\n |          Gwy 1                      Gwy 2         |\n |            |                          |           |\n |            --Security Assoc 1 (tunnel)-           |\n |                                                   |\n -----------Security Association 2 (tunnel)-----------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "These two approaches also can be combined, e.g., an SA bundle could be constructed from one tunnel mode SA and one or two transport mode SAs, applied in sequence. (See Section 4.5 \"Basic Combinations of Security Associations.\") Note that nested tunnels can also occur where neither the source nor the destination endpoints of any of the tunnels are the same. In that case, there would be no host or security gateway with a bundle corresponding to the nested tunnels.",
      "ja": "これらの2つのアプローチを組み合わせることもでき、例えば、SAバンドルを順次適用、1つのトンネルモードSA 1つのまたは2つのトランスポートモードSAから構築することができます。 （セクション4.5「セキュリティアソシエーションの基本的な組み合わせ」を参照してください。）ソースやトンネルのいずれかの宛先エンドポイントのいずれもが同じでどこネストされたトンネルが発生することもありますので注意してください。その場合には、ネストされたトンネルに対応するバンドルとは、ホストまたはセキュリティゲートウェイが存在しないであろう。"
    },
    {
      "indent": 3,
      "text": "For transport mode SAs, only one ordering of security protocols seems appropriate. AH is applied to both the upper layer protocols and (parts of) the IP header. Thus if AH is used in a transport mode, in conjunction with ESP, AH SHOULD appear as the first header after IP, prior to the appearance of ESP. In that context, AH is applied to the ciphertext output of ESP. In contrast, for tunnel mode SAs, one can imagine uses for various orderings of AH and ESP. The required set of SA bundle types that MUST be supported by a compliant IPsec implementation is described in Section 4.5.",
      "ja": "トランスポートモードSAのために、セキュリティプロトコルの一つだけ順序は適切と思われます。 AHは、上位層プロトコルとIPヘッダ（の一部）の両方に適用されます。 AHは、トランスポートモードで使用される場合したがって、ESPに関連して、AH前ESPの外観にIP後の最初のヘッダとして表示されます。その意味で、AHはESPの暗号文出力に適用されます。対照的に、トンネルモードのSAのために、人はAHとESPの様々な順序のための用途を想像することができます。準拠したIPsec実装でサポートしなければならないSAバンドルタイプの必要なセットは、4.5節に記述されています。"
    },
    {
      "indent": 0,
      "text": "4.4 Security Association Databases",
      "section_title": true,
      "ja": "4.4セキュリティアソシエーションデータベース"
    },
    {
      "indent": 3,
      "text": "Many of the details associated with processing IP traffic in an IPsec implementation are largely a local matter, not subject to standardization. However, some external aspects of the processing must be standardized, to ensure interoperability and to provide a minimum management capability that is essential for productive use of IPsec. This section describes a general model for processing IP traffic relative to security associations, in support of these interoperability and functionality goals. The model described below is nominal; compliant implementations need not match details of this model as presented, but the external behavior of such implementations must be mappable to the externally observable characteristics of this model.",
      "ja": "IPsec実装で処理IPトラフィックに関連した内容の多くは、大部分は標準化の対象地域の問題ではありません。しかし、処理のいくつかの外部側面は、相互運用性を確保するためとIPsecの生産的使用のために不可欠な最低限の管理機能を提供するために、標準化されなければなりません。このセクションでは、これらの相互運用性と機能性の目標を支援するために、セキュリティアソシエーションにIPトラフィックの相対を処理するための一般的なモデルについて説明します。以下に説明するモデルは、公称です。準拠した実装が提示され、このモデルの詳細と一致する必要はありませんが、そのような実装の外部動作は、このモデルの外部から観察可能な特徴にマッピング可能でなければなりません。"
    },
    {
      "indent": 3,
      "text": "There are two nominal databases in this model: the Security Policy Database and the Security Association Database. The former specifies the policies that determine the disposition of all IP traffic inbound or outbound from a host, security gateway, or BITS or BITW IPsec implementation. The latter database contains parameters that are associated with each (active) security association. This section also defines the concept of a Selector, a set of IP and upper layer protocol field values that is used by the Security Policy Database to map traffic to a policy, i.e., an SA (or SA bundle).",
      "ja": "セキュリティポリシーデータベースとセキュリティアソシエーションデータベース：このモデルでは2つの名目のデータベースがあります。前者はホスト、セキュリティゲートウェイ、またはBITSまたはBITW IPsec実装からのインバウンドまたはアウトバウンドのすべてのIPトラフィックの処分を決定するポリシーを指定します。後者のデータベースは、各（アクティブ）セキュリティアソシエーションに関連付けられているパラメータが含まれています。このセクションでは、セレクタの概念、IPおよびポリシーへのトラフィックをマップするためにセキュリティポリシーデータベースによって使用される上位層プロトコルフィールド値、すなわち、SA（またはSAバンドル）のセットを定義します。"
    },
    {
      "indent": 3,
      "text": "Each interface for which IPsec is enabled requires nominally separate inbound vs. outbound databases (SAD and SPD), because of the directionality of many of the fields that are used as selectors. Typically there is just one such interface, for a host or security gateway (SG). Note that an SG would always have at least 2 interfaces, but the \"internal\" one to the corporate net, usually would not have IPsec enabled and so only one pair of SADs and one pair of SPDs would be needed. On the other hand, if a host had multiple interfaces or an SG had multiple external interfaces, it might be necessary to have separate SAD and SPD pairs for each interface.",
      "ja": "IPsecは有効になっている各インターフェイスには、理由のセレクタとして使用されている分野の多くの方向性の名目上の別々のインバウンド対アウトバウンドデータベース（SADとSPD）が必要です。典型的には、ホストまたはセキュリティゲートウェイ（SG）のためだけにそのようなインタフェースがあります。 SGは常に、少なくとも2つのインタフェースを持っているだろうが、企業ネットへの1つ「内部」は、通常、IPsecが有効になっており、これだけのSADの1組とのSPDの1組が必要とされるであろうがないことに注意してください。ホストが複数のインターフェイスまたはSGは、複数の外部インターフェイスを持っていた一方、インターフェイスごとに別々のSADとSPDペアを持つことが必要かもしれません。"
    },
    {
      "indent": 0,
      "text": "4.4.1 The Security Policy Database (SPD)",
      "section_title": true,
      "ja": "セキュリティポリシーデータベースを4.4.1（SPD）"
    },
    {
      "indent": 3,
      "text": "Ultimately, a security association is a management construct used to enforce a security policy in the IPsec environment. Thus an essential element of SA processing is an underlying Security Policy Database (SPD) that specifies what services are to be offered to IP datagrams and in what fashion. The form of the database and its interface are outside the scope of this specification. However, this section does specify certain minimum management functionality that must be provided, to allow a user or system administrator to control how IPsec is applied to traffic transmitted or received by a host or transiting a security gateway.",
      "ja": "最終的には、セキュリティアソシエーションは、IPsec環境でのセキュリティポリシーを強制するために使用される管理構造です。したがって、SA処理の重要な要素は、サービスはIPデータグラムに、どのような形で提供されるものを指定する基礎となるセキュリティポリシーデータベース（SPD）です。データベースとそのインターフェースの形態は、本明細書の範囲外です。しかしながら、このセクションでは、ユーザまたはシステム管理者は、IPSecトラフィックを送信または受信ホストによってまたはセキュリティゲートウェイを通過するに適用される方法を制御できるようにするために、提供されなければならない特定の最小管理機能を指定しません。"
    },
    {
      "indent": 3,
      "text": "The SPD must be consulted during the processing of all traffic (INBOUND and OUTBOUND), including non-IPsec traffic. In order to support this, the SPD requires distinct entries for inbound and outbound traffic. One can think of this as separate SPDs (inbound vs. outbound). In addition, a nominally separate SPD must be provided for each IPsec-enabled interface.",
      "ja": "SPDは、非IPsecトラフィックを含む、すべてのトラフィック（インバウンドとアウトバウンド）、の処理中に協議しなければなりません。これをサポートするためには、SPDは、インバウンドとアウトバウンドのトラフィックのための明確なエントリが必要です。一つは、（アウトバウンド対インバウンド）、別のSPDと考えることができます。加えて、名目上の別々のSPDは、それぞれのIPsec対応のインターフェイスのために提供されなければなりません。"
    },
    {
      "indent": 3,
      "text": "An SPD must discriminate among traffic that is afforded IPsec protection and traffic that is allowed to bypass IPsec. This applies to the IPsec protection to be applied by a sender and to the IPsec protection that must be present at the receiver. For any outbound or inbound datagram, three processing choices are possible: discard, bypass IPsec, or apply IPsec. The first choice refers to traffic that is not allowed to exit the host, traverse the security gateway, or be delivered to an application at all. The second choice refers to traffic that is allowed to pass without additional IPsec protection. The third choice refers to traffic that is afforded IPsec protection, and for such traffic the SPD must specify the security services to be provided, protocols to be employed, algorithms to be used, etc.",
      "ja": "SPDは、IPsecをバイパスすることが許可されているIPsec保護やトラフィックを与えているトラフィックを区別しなければなりません。これは、送信者が受信側とに存在しなければならないIPsec保護に適用されるIPsec保護に適用されます。任意の送信または受信データグラムのために、3つの処理の選択が可能です、バイパスIPsecを破棄、またはIPsecを適用します。最初の選択肢は、ホストを終了するセキュリティゲートウェイを通過、または、すべてのアプリケーションに配信することを許可されていないトラフィックを指します。 2番目の選択肢は、追加のIPsec保護なしで通過を許可されたトラフィックを指します。第三の選択肢は、IPsec保護を与えているトラフィックを意味し、そのようなトラフィックのためにSPD等提供するセキュリティサービス、使用するプロトコル、使用されるアルゴリズムを指定する必要があります"
    },
    {
      "indent": 3,
      "text": "For every IPsec implementation, there MUST be an administrative interface that allows a user or system administrator to manage the SPD. Specifically, every inbound or outbound packet is subject to processing by IPsec and the SPD must specify what action will be taken in each case. Thus the administrative interface must allow the user (or system administrator) to specify the security processing to be applied to any packet entering or exiting the system, on a packet by packet basis. (In a host IPsec implementation making use of a socket interface, the SPD may not need to be consulted on a per packet basis, but the effect is still the same.) The management interface for the SPD MUST allow creation of entries consistent with the selectors defined in Section 4.4.2, and MUST support (total) ordering of these entries. It is expected that through the use of wildcards in various selector fields, and because all packets on a single UDP or TCP connection will tend to match a single SPD entry, this requirement will not impose an unreasonably detailed level of SPD specification. The selectors are analogous to what are found in a stateless firewall or filtering router and which are currently manageable this way.",
      "ja": "すべてのIPsec実装の場合は、ユーザーまたはシステム管理者がSPDを管理することを可能にする管理インタフェースがあるに違いありません。具体的には、すべてのインバウンドまたはアウトバウンドパケットは、IPsecとSPDによる処理の対象となるそれぞれの場合にとられるアクションを指定しなければなりません。こうして管理インタフェースは、ユーザ（またはシステム管理者）は、パケット単位でパケットに、システムに入るまたは出るすべてのパケットに適用されるべきセキュリティ処理を指定できるようにしなければなりません。 （ソケットインタフェースのホストのIPsec実装を作る使用の際には、SPDは、パケットごとに相談する必要はないかもしれませんが、効果は同じです。）管理インターフェイスをSPDはと一致したエントリの作成を許可しなければならないためにセレクタは、セクション4.4.2で定義され、これらのエントリの（合計）の順序付けをサポートしなければなりません。単一のUDPまたはTCP接続上の全てのパケットが単一のSPDエントリと一致する傾向があるので、様々なセレクタフィールドのワイルドカードの使用を介して、及び、この要件はSPD仕様の不当詳細なレベルを課さないことが予想されます。セレクタは、ステートレスファイアウォールやフィルタリングルーターで見ているものに類似しており、現在はこのように管理されています。"
    },
    {
      "indent": 3,
      "text": "In host systems, applications MAY be allowed to select what security processing is to be applied to the traffic they generate and consume. (Means of signalling such requests to the IPsec implementation are outside the scope of this standard.) However, the system administrator MUST be able to specify whether or not a user or application can override (default) system policies. Note that application specified policies may satisfy system requirements, so that the system may not need to do additional IPsec processing beyond that needed to meet an application's requirements. The form of the management interface is not specified by this document and may differ for hosts vs. security gateways, and within hosts the interface may differ for socket-based vs. BITS implementations. However, this document does specify a standard set of SPD elements that all IPsec implementations MUST support.",
      "ja": "ホスト・システムでは、アプリケーションは、セキュリティ処理は、彼らが生成し、消費するトラフィックに適用されるものを選択できるようにしてもよいです。 （IPsec実装にそのような要求をシグナリングする手段は、この規格の範囲外である。）しかし、システム管理者は、ユーザまたはアプリケーションが（デフォルト）システムポリシーを無効にすることができるかどうかを指定できなければなりません。システムは、アプリケーションの要件を満たすために必要なものを超えて追加のIPsec処理を行う必要がないように、システム要件を満たすことがあり、そのアプリケーション指定されたポリシーに注意してください。管理インターフェースの形態は、この文書で指定されていないとセキュリティゲートウェイ対ホストに対して異なっていてもよい、及びホスト内のインタフェースは、ソケットベースのBITS実装対のために異なっていてもよいです。しかし、この文書は、すべてのIPsec実装がサポートしなければならないSPD要素の標準セットを指定しません。"
    },
    {
      "indent": 3,
      "text": "The SPD contains an ordered list of policy entries. Each policy entry is keyed by one or more selectors that define the set of IP traffic encompassed by this policy entry. (The required selector types are defined in Section 4.4.2.) These define the granularity of policies or SAs. Each entry includes an indication of whether traffic matching this policy will be bypassed, discarded, or subject to IPsec processing. If IPsec processing is to be applied, the entry includes an SA (or SA bundle) specification, listing the IPsec protocols, modes, and algorithms to be employed, including any nesting requirements. For example, an entry may call for all matching traffic to be protected by ESP in transport mode using 3DES-CBC with an explicit IV, nested inside of AH in tunnel mode using HMAC/SHA-1. For each selector, the policy entry specifies how to derive the corresponding values for a new Security Association Database (SAD, see Section 4.4.3) entry from those in the SPD and the packet (Note that at present, ranges are only supported for IP addresses; but wildcarding can be expressed for all selectors):",
      "ja": "SPDは、ポリシーエントリの順序付きリストが含まれています。各ポリシーエントリは、このポリシーエントリに包含されるIPトラフィックのセットを定義する1つのまたは複数のセレクタをキーとしています。 （必要なセレクタタイプは、セクション4.4.2で定義されている。）これらは、ポリシーまたはSAの粒度を定義します。各エントリは、このポリシーに一致するトラフィックは、バイパス廃棄、またはIPsec処理の対象とするかどうかの指示を含みます。 IPsec処理が適用される場合、エントリは、IPsecプロトコル、モード、およびアルゴリズムは、任意の入れ子要件を含む、使用するリスト、SA（またはSAバンドル）仕様を含みます。例えば、エントリはHMAC / SHA-1を使用して、トンネルモードでAHの内側にネストされた明示的なIVと3DES-CBCを使用して、トランスポート・モードでESPによって保護されるすべての一致トラフィックを要求してもよいです。各セレクタについて、ポリシーエントリは、新しいセキュリティアソシエーションデータベースの対応する値を導出する方法を指定します（SAD、4.4.3項を参照）、SPDとパケットのものからのエントリーは（現時点では、範囲はIPだけのためにサポートされていることに注意してくださいアドレス;しかし、ワイルドカードは、すべてのセレクタのために表現することができます）。"
    },
    {
      "indent": 11,
      "text": "a. use the value in the packet itself -- This will limit use\n   of the SA to those packets which have this packet's value\n   for the selector even if the selector for the policy entry\n   has a range of allowed values or a wildcard for this\n   selector.\nb. use the value associated with the policy entry -- If this\n   were to be just a single value, then there would be no\n   difference between (b) and (a).  However, if the allowed\n   values for the selector are a range (for IP addresses) or wildcard, then in the case of a range,(b) would enable use\n   of the SA by any packet with a selector value within the\n   range not just by packets with the selector value of the\n   packet that triggered the creation of the SA.  In the case\n   of a wildcard, (b) would allow use of the SA by packets\n   with any value for this selector.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "For example, suppose there is an SPD entry where the allowed value for source address is any of a range of hosts (192.168.2.1 to 192.168.2.10). And suppose that a packet is to be sent that has a source address of 192.168.2.3. The value to be used for the SA could be any of the sample values below depending on what the policy entry for this selector says is the source of the selector value:",
      "ja": "例えば、送信元アドレスの許容値は、ホスト（192.168.2.10に192.168.2.1）の範囲のいずれかであるSPDエントリがあると仮定する。そして、パケットが192.168.2.3の送信元アドレスを持っている送信されることを想定。 SAのために使用される値は、この選択のためのポリシーエントリは、セレクタ値のソースである言うことに応じて、次のサンプル値のいずれかとすることができます。"
    },
    {
      "indent": 11,
      "text": "source for the  example of\nvalue to be     new SAD\nused in the SA  selector value\n--------------- ------------\na. packet       192.168.2.3 (one host)\nb. SPD entry    192.168.2.1 to 192.168.2.10 (range of hosts)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note that if the SPD entry had an allowed value of wildcard for the source address, then the SAD selector value could be wildcard (any host). Case (a) can be used to prohibit sharing, even among packets that match the same SPD entry.",
      "ja": "SPDエントリは、送信元アドレスのためのワイルドカードの許容値を有していた場合、SADセレクタ値はワイルドカード（任意のホスト）であってもよいことに留意されたいです。 （a）の場合であっても同一のSPDエントリと一致するパケットのうち、共有を禁止するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "As described below in Section 4.4.3, selectors may include \"wildcard\" entries and hence the selectors for two entries may overlap. (This is analogous to the overlap that arises with ACLs or filter entries in routers or packet filtering firewalls.) Thus, to ensure consistent, predictable processing, SPD entries MUST be ordered and the SPD MUST always be searched in the same order, so that the first matching entry is consistently selected. (This requirement is necessary as the effect of processing traffic against SPD entries must be deterministic, but there is no way to canonicalize SPD entries given the use of wildcards for some selectors.) More detail on matching of packets against SPD entries is provided in Section 5.",
      "ja": "4.4.3項で後述するように、セレクタは、「ワイルドカード」のエントリを含むことができ、従って、2つのエントリのためのセレクタは重複してもよいです。 （これは、ルータまたはパケットフィルタリングファイアウォールでACLまたはフィルタエントリに生じるオーバーラップに類似している。）このように、一貫した、予測可能な処理を確保するために、SPDエントリを注文する必要があり、そのようSPDは常に同じ順序で検索されなければなりません最初に一致したエントリが一貫して選択されます。 （SPDエントリに対するトラフィックを処理する効果が決定的でなければならないようにこの要件が必要であるが、いくつかのセレクタのためのワイルドカードの使用を指定されたSPDエントリを正規化する方法はありません。）SPDエントリに対するパケットのマッチングに関するさらなる詳細はセクションに設けられています5。"
    },
    {
      "indent": 3,
      "text": "Note that if ESP is specified, either (but not both) authentication or encryption can be omitted. So it MUST be possible to configure the SPD value for the authentication or encryption algorithms to be \"NULL\". However, at least one of these services MUST be selected, i.e., it MUST NOT be possible to configure both of them as \"NULL\".",
      "ja": "ESPが指定されている場合は、どちらか（両方ではない）は、認証や暗号化を省略することができることに注意してください。だから、「NULL」であることを認証または暗号化アルゴリズムのためのSPD値を設定することは可能でなければなりません。しかし、これらのサービスのうちの少なくとも一つは、すなわち、「NULL」としてそれらの両方を設定することも可能にすることはできません、選択しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The SPD can be used to map traffic to specific SAs or SA bundles. Thus it can function both as the reference database for security policy and as the map to existing SAs (or SA bundles). (To accommodate the bypass and discard policies cited above, the SPD also",
      "ja": "SPDは特定のSAまたはSAバンドルへのトラフィックをマップするために使用することができます。したがって、セキュリティポリシーの参照データベースとして、既存のSA（またはSAバンドル）にマップの両方として機能することができます。 （バイパスを収容し、また、ポリシーが上記に引用SPDを捨て"
    },
    {
      "indent": 3,
      "text": "MUST provide a means of mapping traffic to these functions, even though they are not, per se, IPsec processing.) The way in which the SPD operates is different for inbound vs. outbound traffic and it also may differ for host vs. security gateway, BITS, and BITW implementations. Sections 5.1 and 5.2 describe the use of the SPD for outbound and inbound processing, respectively.",
      "ja": "それらは、それ自体、IPsec処理でなくても、これらの関数にマッピングトラフィックの手段を提供しなければならない。）SPDが動作する方法は、アウトバウンドトラフィック対受信のために異なるであり、それはまた、セキュリティゲートウェイ対ホストに異なっていてもよいです、BITS、BITWおよび実装。セクション5.1および5.2は、それぞれ、アウトバウンドおよびインバウンド処理用のSPDの使用を記載しています。"
    },
    {
      "indent": 3,
      "text": "Because a security policy may require that more than one SA be applied to a specified set of traffic, in a specific order, the policy entry in the SPD must preserve these ordering requirements, when present. Thus, it must be possible for an IPsec implementation to determine that an outbound or inbound packet must be processed thorough a sequence of SAs. Conceptually, for outbound processing, one might imagine links (to the SAD) from an SPD entry for which there are active SAs, and each entry would consist of either a single SA or an ordered list of SAs that comprise an SA bundle. When a packet is matched against an SPD entry and there is an existing SA or SA bundle that can be used to carry the traffic, the processing of the packet is controlled by the SA or SA bundle entry on the list. For an inbound IPsec packet for which multiple IPsec SAs are to be applied, the lookup based on destination address, IPsec protocol, and SPI should identify a single SA.",
      "ja": "セキュリティポリシーは、複数のSAは、特定の順序で、トラフィックの指定されたセットに適用することが必要な場合がありますので、SPD内のポリシーエントリが存在するこれらの発注要件を、保持しなければなりません。これにより、発信または着信パケットは、SASの完全なシーケンスを処理しなければならないことを決定するためにIPsec実装可能でなければなりません。概念的に、送信処理のために、一方がアクティブのSAが存在であるためSPDエントリから（SAD）がリンクを想像し、各エントリは、単一のSAまたはSAバンドルを含むSAの順序付けられたリストのいずれかから成ります。パケットがSPDエントリと照合し、トラフィックを搬送するために使用することができる既存のSAまたはSAバンドルが存在する場合には、パケットの処理は、リスト上のSAまたはSAバンドルエントリによって制御されます。複数のIPsec SAが適用されるべきであるため、インバウンドIPsecパケットは、宛先アドレス、IPsecプロトコル、およびSPIに基づく検索は単一のSAを識別すべきです。"
    },
    {
      "indent": 3,
      "text": "The SPD is used to control the flow of ALL traffic through an IPsec system, including security and key management traffic (e.g., ISAKMP) from/to entities behind a security gateway. This means that ISAKMP traffic must be explicitly accounted for in the SPD, else it will be discarded. Note that a security gateway could prohibit traversal of encrypted packets in various ways, e.g., having a DISCARD entry in the SPD for ESP packets or providing proxy key exchange. In the latter case, the traffic would be internally routed to the key management module in the security gateway.",
      "ja": "SPDは、セキュリティゲートウェイの背後にあるエンティティへ/からセキュリティおよび鍵管理トラフィック（例えば、ISAKMP）などのIPsecシステムを通るすべてのトラフィックの流れを制御するために使用されます。これは、ISAKMPトラフィックは明示的に破棄され、他の、SPDに計上しなければならないことを意味しています。セキュリティゲートウェイは、例えば、ESPパケットのSPDにおける廃棄エントリーを有するか、または代理キー交換を提供し、様々な方法で暗号化されたパケットの横断を禁止することができることに留意されたいです。後者の場合、トラフィックは内部セキュリティゲートウェイでの鍵管理モジュールにルーティングされることになります。"
    },
    {
      "indent": 0,
      "text": "4.4.2 Selectors",
      "section_title": true,
      "ja": "4.4.2セレクタ"
    },
    {
      "indent": 3,
      "text": "An SA (or SA bundle) may be fine-grained or coarse-grained, depending on the selectors used to define the set of traffic for the SA. For example, all traffic between two hosts may be carried via a single SA, and afforded a uniform set of security services. Alternatively, traffic between a pair of hosts might be spread over multiple SAs, depending on the applications being used (as defined by the Next Protocol and Port fields), with different security services offered by different SAs. Similarly, all traffic between a pair of security gateways could be carried on a single SA, or one SA could be assigned for each communicating host pair. The following selector parameters MUST be supported for SA management to facilitate control of SA granularity. Note that in the case of receipt of a packet with an ESP header, e.g., at an encapsulating security gateway or BITW implementation, the transport layer protocol, source/destination ports, and Name (if present) may be \"OPAQUE\", i.e., inaccessible because of encryption or fragmentation. Note also that both Source and Destination addresses should either be IPv4 or IPv6.",
      "ja": "SA（またはSAバンドル）は、SAに対するトラフィックのセットを定義するために使用されるセレクタに応じて、きめの細かいまたは粗い粒度であってもよいです。例えば、2つのホスト間のすべてのトラフィックは、単一のSAを介して行われ、セキュリティサービスの一様なセットを与えてもよいです。あるいは、ホストのペア間のトラフィックは、異なるのSAによって提供される異なるセキュリティサービスと、（次のプロトコルおよびポートフィールドによって定義されるように）使用されているアプリケーションに応じて、複数のSAに広がるかもしれません。同様に、セキュリティゲートウェイのペア間のすべてのトラフィックは、単一のSA上に担持することができ、または1つのSAは、各通信ホスト対に対して割り当てることができます。以下のセレクタパラメータは、SAの粒度の制御を容易にするために、SA管理のためにサポートしなければなりません。すなわち、ESPヘッダを持つパケットを受信した場合に、例えば、カプセル化セキュリティゲートウェイまたはBITW実装では、トランスポート層プロトコル、送信元/宛先ポート、及び名前（存在する場合）は、「OPAQUE」であってもよいことに留意されたいですなぜなら、暗号化または断片化のアクセスできない。送信元アドレスと宛先アドレスの両方がIPv4またはIPv6のいずれかである必要がありことにも注意してください。"
    },
    {
      "indent": 6,
      "text": "- Destination IP Address (IPv4 or IPv6): this may be a single IP address (unicast, anycast, broadcast (IPv4 only), or multicast group), a range of addresses (high and low values (inclusive), address + mask, or a wildcard address. The last three are used to support more than one destination system sharing the same SA (e.g., behind a security gateway). Note that this selector is conceptually different from the \"Destination IP Address\" field in the <Destination IP Address, IPsec Protocol, SPI> tuple used to uniquely identify an SA. When a tunneled packet arrives at the tunnel endpoint, its SPI/Destination address/Protocol are used to look up the SA for this packet in the SAD. This destination address comes from the encapsulating IP header. Once the packet has been processed according to the tunnel SA and has come out of the tunnel, its selectors are \"looked up\" in the Inbound SPD. The Inbound SPD has a selector called destination address. This IP destination address is the one in the inner (encapsulated) IP header. In the case of a transport'd packet, there will be only one IP header and this ambiguity does not exist. [REQUIRED for all implementations]",
      "ja": " - 宛先IPアドレス（IPv4またはIPv6）：これは、単一のIPアドレス（ユニキャスト、エニーキャスト、ブロードキャスト（IPv4の場合のみ）、またはマルチキャストグループ）であってもよい、アドレス（高い及び低い値（両端を含む）、アドレス+マスクの範囲またはワイルドカードアドレス。最後の3つは、同じSAを共有する複数の宛先システム（例えば、セキュリティゲートウェイの背後にある）をサポートするために使用されている。このセレクタは、<送信先IPで「宛先IPアドレス」フィールドから概念的に異なることに注意してください住所、IPsecのプロトコル、SPI>タプルが一意にSAを識別するために使用されるトンネリングされたパケットは、トンネルのエンドポイントに到達すると、そのSPI /宛先アドレス/プロトコルがSADでこのパケットのためにSAを検索するために使用されている。この宛先アドレスが来ますカプセル化IPヘッダから、パケットがトンネルSAに従って処理され、トンネルから出た後、そのセレクタがインバウンドSPDの「ルックアップ」される。インバウンドSPDは、宛先アドレスと呼ばれるセレクタを有している。このIP宛先アドレスはInneの1つですR（カプセル化）IPヘッダ。 transport'dパケットの場合には、そこに1つのIPヘッダとなり、この曖昧さは存在しません。 [すべての実装のために必須]"
    },
    {
      "indent": 6,
      "text": "- Source IP Address(es) (IPv4 or IPv6): this may be a single IP address (unicast, anycast, broadcast (IPv4 only), or multicast group), range of addresses (high and low values inclusive), address + mask, or a wildcard address. The last three are used to support more than one source system sharing the same SA (e.g., behind a security gateway or in a multihomed host). [REQUIRED for all implementations]",
      "ja": " - 送信元IPアドレス（ES）（IPv4またはIPv6）：これは、単一のIPアドレス（ユニキャスト、エニーキャスト、ブロードキャスト（IPv4の場合のみ）、またはマルチキャストグループ）、アドレスの範囲（高い及び低い値を含む）、アドレス+マスクであってもよいです、またはワイルドカードアドレス。最後の3つは、同じSAを（例えば、セキュリティゲートウェイの背後にある、またはマルチホームホストで）共有する複数のソースシステムをサポートするために使用されます。 [すべての実装のために必須]"
    },
    {
      "indent": 6,
      "text": "- Name: There are 2 cases (Note that these name forms are supported in the IPsec DOI.) 1. User ID a. a fully qualified user name string (DNS), e.g., mozart@foo.bar.com b. X.500 distinguished name, e.g., C = US, SP = MA, O = GTE Internetworking, CN = Stephen T. Kent. 2. System name (host, security gateway, etc.) a. a fully qualified DNS name, e.g., foo.bar.com b. X.500 distinguished name c. X.500 general name",
      "ja": " - 名前：2例（これらの名前形式は、IPsecのDOIでサポートされていることに注意してください。）1.ユーザーID aがあります。完全修飾ユーザー名の文字列（DNS）、例えば、mozart@foo.bar.com B。 X.500識別名、例えば、C = US、SP = MA、O = GTEインターネットワーキング、CN =スティーブンT.ケント。 2.システム名（ホスト、セキュリティゲートウェイ、等）A。完全修飾DNS名、たとえば、foo.bar.com bの。 X.500識別名c。 X.500の一般名"
    },
    {
      "indent": 8,
      "text": "NOTE: One of the possible values of this selector is \"OPAQUE\".",
      "ja": "注：このセレクタの可能な値のうちの1つは、「OPAQUE」です。"
    },
    {
      "indent": 8,
      "text": "[REQUIRED for the following cases. Note that support for name forms other than addresses is not required for manually keyed SAs. o User ID - native host implementations - BITW and BITS implementations acting as HOSTS with only one user - security gateway implementations for INBOUND processing. o System names -- all implementations]",
      "ja": "[次の場合に必要です。アドレス以外の名前形式のためにそのサポートが手動で鍵付きSAの必要ありません。 OユーザーID  - ネイティブホスト実装 -  BITWつのみユーザとホストとして働くBITS実装 -  Inbound処理のためにセキュリティゲートウェイ実装。 Oシステム名 - すべての実装]"
    },
    {
      "indent": 6,
      "text": "- Data sensitivity level: (IPSO/CIPSO labels) [REQUIRED for all systems providing information flow security as per Section 8, OPTIONAL for all other systems.]",
      "ja": " - データの感度レベル：（IPSO / CIPSOラベル）[他のすべてのシステムのためのOPTIONAL項8に従って情報フローセキュリティを提供するすべてのシステムに必要。]"
    },
    {
      "indent": 6,
      "text": "- Transport Layer Protocol: Obtained from the IPv4 \"Protocol\" or the IPv6 \"Next Header\" fields. This may be an individual protocol number. These packet fields may not contain the Transport Protocol due to the presence of IP extension headers, e.g., a Routing Header, AH, ESP, Fragmentation Header, Destination Options, Hop-by-hop options, etc. Note that the Transport Protocol may not be available in the case of receipt of a packet with an ESP header, thus a value of \"OPAQUE\" SHOULD be supported. [REQUIRED for all implementations]",
      "ja": " - トランスポート層プロトコル：IPv4の「プロトコル」またはIPv6の「次ヘッダ」フィールドから得られます。これは、個々のプロトコル番号であってもよいです。これらのパケットフィールドは、トランスポートプロトコルがないことに注意してくださいによるIP拡張ヘッダ、例えば、ルーティングヘッダー、AH、ESP、フラグメンテーションヘッダー、宛先オプション、ホップバイホップオプションなどの存在にトランスポートプロトコルを含めることはできませんしたがって、「OPAQUE」の値がサポートされるべきであり、ESPヘッダを持つパケットを受信した場合に利用可能です。 [すべての実装のために必須]"
    },
    {
      "indent": 8,
      "text": "NOTE: To locate the transport protocol, a system has to chain through the packet headers checking the \"Protocol\" or \"Next Header\" field until it encounters either one it recognizes as a transport protocol, or until it reaches one that isn't on its list of extension headers, or until it encounters an ESP header that renders the transport protocol opaque.",
      "ja": "注：トランスポートプロトコルを見つけるために、システムは、それはどちらか遭遇したことは、トランスポートプロトコルとして認識するもの、またはそれがないものに達するまでまで、「プロトコル」または「次ヘッダ」フィールドをチェックし、パケットのヘッダをチェーンにありその拡張ヘッダのリスト、またはそれが不透明なトランスポートプロトコルをレンダリングESPヘッダに遭遇するまで。"
    },
    {
      "indent": 6,
      "text": "- Source and Destination (e.g., TCP/UDP) Ports: These may be individual UDP or TCP port values or a wildcard port. (The use of the Next Protocol field and the Source and/or Destination Port fields (in conjunction with the Source and/or Destination Address fields), as an SA selector is sometimes referred to as \"session-oriented keying.\"). Note that the source and destination ports may not be available in the case of receipt of a packet with an ESP header, thus a value of \"OPAQUE\" SHOULD be supported.",
      "ja": " - ソースおよびデスティネーション（例えば、TCP / UDP）ポート：これらは個々のUDPまたはTCPポート値またはワイルドカードのポートであってもよいです。 （SAセレクタとしてソースおよび/または宛先アドレスフィールド）と併せて次のプロトコルフィールドソースおよび/または宛先ポートフィールド（の使用は、と呼ばれることもある「セッション指向キーイング。」）。送信元ポートと宛先ポートは、このように「OPAQUE」の値がサポートされるべきであり、ESPヘッダを持つパケットを受信した場合に利用可能ではないかもしれないことに留意されたいです。"
    },
    {
      "indent": 8,
      "text": "The following table summarizes the relationship between the \"Next Header\" value in the packet and SPD and the derived Port Selector value for the SPD and SAD.",
      "ja": "次の表は、「次ヘッダ」パケット内の値とSPDとSPDとSADのための導出ポートセレクタ値との関係をまとめたもの。"
    },
    {
      "indent": 10,
      "text": "Next Hdr        Transport Layer   Derived Port Selector Field\nin Packet       Protocol in SPD   Value in SPD and SAD\n--------        ---------------   ---------------------------\nESP             ESP or ANY        ANY (i.e., don't look at it)\n-don't care-    ANY               ANY (i.e., don't look at it)\nspecific value  specific value    NOT ANY (i.e., drop packet)\n   fragment\nspecific value  specific value    actual port selector field\n   not fragment",
      "raw": true
    },
    {
      "indent": 8,
      "text": "If the packet has been fragmented, then the port information may not be available in the current fragment. If so, discard the fragment. An ICMP PMTU should be sent for the first fragment, which will have the port information. [MAY be supported]",
      "ja": "パケットが断片化されている場合は、ポート情報は、現在の断片で利用可能ではないかもしれません。その場合は、フラグメントを捨てます。 ICMP PMTUは、ポート情報を有することになる最初の断片のために送られるべきです。 [サポートされるかもしれ]"
    },
    {
      "indent": 3,
      "text": "The IPsec implementation context determines how selectors are used. For example, a host implementation integrated into the stack may make use of a socket interface. When a new connection is established the SPD can be consulted and an SA (or SA bundle) bound to the socket. Thus traffic sent via that socket need not result in additional lookups to the SPD/SAD. In contrast, a BITS, BITW, or security gateway implementation needs to look at each packet and perform an SPD/SAD lookup based on the selectors. The allowable values for the selector fields differ between the traffic flow, the security association, and the security policy.",
      "ja": "IPsec実装のコンテキストは、セレクタの使用方法を決定します。例えば、スタックに組み込まれたホスト実装ではソケットインタフェースを利用することができます。新しい接続が確立されるとSPDを相談することができ、SA（またはSAバンドル）がソケットにバインドされました。したがって、そのソケット経由で送信されたトラフィックは、SAD SPD /への追加のルックアップにつながる必要はありません。これとは対照的に、BITS、BITW、またはセキュリティゲートウェイの実装では、各パケットを見て、セレクタに基づいてSPD / SAD検索を実行する必要があります。セレクタフィールドの許容値は、トラフィックフロー、セキュリティアソシエーション、およびセキュリティポリシー間で異なります。"
    },
    {
      "indent": 3,
      "text": "The following table summarizes the kinds of entries that one needs to be able to express in the SPD and SAD. It shows how they relate to the fields in data traffic being subjected to IPsec screening. (Note: the \"wild\" or \"wildcard\" entry for src and dst addresses includes a mask, range, etc.)",
      "ja": "次の表は、1つのSPDとSADに表現できるようにする必要があるエントリの種類をまとめたものです。それは彼らがのIPsecスクリーニングに供されているデータトラフィック内のフィールドにどのように関係するかを示しています。 （注：「ワイルド」又はSRCおよびdstアドレスは、「ワイルドカード」エントリマスクを含む、範囲、等）"
    },
    {
      "indent": 1,
      "text": "Field         Traffic Value       SAD Entry            SPD Entry\n--------      -------------   ----------------   --------------------\nsrc addr      single IP addr  single,range,wild  single,range,wildcard\ndst addr      single IP addr  single,range,wild  single,range,wildcard\nxpt protocol* xpt protocol    single,wildcard    single,wildcard\nsrc port*     single src port single,wildcard    single,wildcard\ndst port*     single dst port single,wildcard    single,wildcard\nuser id*      single user id  single,wildcard    single,wildcard\nsec. labels   single value    single,wildcard    single,wildcard",
      "raw": true
    },
    {
      "indent": 7,
      "text": "* The SAD and SPD entries for these fields could be \"OPAQUE\"\n  because the traffic value is encrypted.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "NOTE: In principle, one could have selectors and/or selector values in the SPD which cannot be negotiated for an SA or SA bundle. Examples might include selector values used to select traffic for discarding or enumerated lists which cause a separate SA to be created for each item on the list. For now, this is left for future versions of this document and the list of required selectors and selector values is the same for the SPD and the SAD. However, it is acceptable to have an administrative interface that supports use of selector values which cannot be negotiated provided that it does not mislead the user into believing it is creating an SA with these selector values. For example, the interface may allow the user to specify an enumerated list of values but would result in the creation of a separate policy and SA for each item on the list. A vendor might support such an interface to make it easier for its customers to specify clear and concise policy specifications.",
      "ja": "注：原則として、1は、SAまたはSAバンドルのために交渉することはできませんSPDのセレクタおよび/またはセレクタ値を持つことができます。例としては、リスト上の各項目のために作成される個別のSAを引き起こすリストを破棄または列挙のためのトラフィックを選択するために使用されるセレクタ値が含まれる場合があります。今のところ、これは、このドキュメントの将来のバージョン放置され、必要なセレクタとセレクタ値のリストは、SPDとSADのために同じです。しかし、これらのセレクタ値を持つSAを作成している信じるようにユーザに誤解しないことを条件とするネゴシエートできないセレクタ値の使用をサポートする管理インターフェースを有することが許容されます。例えば、インタフェースは、ユーザが、値の列挙リストを指定することを可能にし得るが、リストの各項目のための別のポリシーとSAの作成をもたらします。ベンダーは、それが簡単に顧客が明確で簡潔なポリシー仕様を指定できるようにすること、そのようなインタフェースをサポートする場合があります。"
    },
    {
      "indent": 0,
      "text": "4.4.3 Security Association Database (SAD)",
      "section_title": true,
      "ja": "4.4.3セキュリティアソシエーションデータベース（SAD）"
    },
    {
      "indent": 3,
      "text": "In each IPsec implementation there is a nominal Security Association Database, in which each entry defines the parameters associated with one SA. Each SA has an entry in the SAD. For outbound processing, entries are pointed to by entries in the SPD. Note that if an SPD entry does not currently point to an SA that is appropriate for the packet, the implementation creates an appropriate SA (or SA Bundle) and links the SPD entry to the SAD entry (see Section 5.1.1). For inbound processing, each entry in the SAD is indexed by a destination IP address, IPsec protocol type, and SPI. The following parameters are associated with each entry in the SAD. This description does not purport to be a MIB, but only a specification of the minimal data items required to support an SA in an IPsec implementation.",
      "ja": "各IPsec実装では、各エントリは1つのSAに関連するパラメータを定義するには、公称セキュリティアソシエーションデータベースは、そこにあります。各SAはSADにエントリを持っています。 Outbound処理の場合、エントリはSPD内のエントリによって指し示されています。 SPDエントリは、現在のパケットのために適切なSAを指していない場合、実装は適切なSA（またはSAバンドル）を作成し、SADエントリ（5.1.1項を参照）にSPDエントリをリンクすることに注意してください。インバウンド処理のために、SADの各エントリは、宛先IPアドレス、IPsecプロトコルタイプ、およびSPIによってインデックス付けされます。以下のパラメータがSAD内の各エントリに関連付けられています。この説明は、MIBが、IPsec実装でSAをサポートするために必要な最小限のデータ項目の唯一の仕様であることを意味しません。"
    },
    {
      "indent": 3,
      "text": "For inbound processing: The following packet fields are used to look up the SA in the SAD:",
      "ja": "Inbound処理の場合：以下のパケットフィールドは、SADにSAをルックアップするために使用されます。"
    },
    {
      "indent": 9,
      "text": "o Outer Header's Destination IP address: the IPv4 or IPv6\n  Destination address.\n  [REQUIRED for all implementations]\no IPsec Protocol: AH or ESP, used as an index for SA lookup\n  in this database.  Specifies the IPsec protocol to be\n  applied to the traffic on this SA.\n  [REQUIRED for all implementations]\no SPI: the 32-bit value used to distinguish among different\n  SAs terminating at the same destination and using the same\n  IPsec protocol.\n  [REQUIRED for all implementations]",
      "raw": true
    },
    {
      "indent": 3,
      "text": "For each of the selectors defined in Section 4.4.2, the SA entry in the SAD MUST contain the value or values which were negotiated at the time the SA was created. For the sender, these values are used to decide whether a given SA is appropriate for use with an outbound packet. This is part of checking to see if there is an existing SA that can be used. For the receiver, these values are used to check that the selector values in an inbound packet match those for the SA (and thus indirectly those for the matching policy). For the receiver, this is part of verifying that the SA was appropriate for this packet. (See Section 6 for rules for ICMP messages.) These fields can have the form of specific values, ranges, wildcards, or \"OPAQUE\" as described in section 4.4.2, \"Selectors\". Note that for an ESP SA, the encryption algorithm or the authentication algorithm could be \"NULL\". However they MUST not both be \"NULL\".",
      "ja": "セクション4.4.2で定義されたセレクタのそれぞれについて、SADにSAエントリは、SAが作成された時点でネゴシエートされた値または値を含まなければなりません。送信者のために、これらの値が与えられたSAは、アウトバウンドパケットでの使用に適しているかどうかを判断するために使用されています。これは使用することができ、既存のSAがあるかどうかをチェックするの一部です。受信機のために、これらの値は、インバウンドパケットのセレクタ値は、SAのもの（したがって間接的マッチングポリシーのもの）と一致することを確認するために使用されます。受信機の場合、これはSAがこのパケットのために適切であったことを確認する部分です。セクション4.4.2、「セレクタ」に記載されているように（ICMPメッセージのための規則については、セクション6を参照。）これらのフィールドは、特定値の形態を有することができ、範囲ワイルドカード、または「OPAQUE」。 ESP SAのために、暗号化アルゴリズムや認証アルゴリズムは「NULL」かもしれないことに注意してください。しかし、彼らは両方とも「NULL」であってはなりません。"
    },
    {
      "indent": 3,
      "text": "The following SAD fields are used in doing IPsec processing:",
      "ja": "以下SADのフィールドはIPsec処理を行う際に使用されます。"
    },
    {
      "indent": 9,
      "text": "o Sequence Number Counter: a 32-bit value used to generate the\n  Sequence Number field in AH or ESP headers.\n  [REQUIRED for all implementations, but used only for outbound\n  traffic.]\no Sequence Counter Overflow: a flag indicating whether overflow\n  of the Sequence Number Counter should generate an auditable\n  event and prevent transmission of additional packets on the\n  SA.\n  [REQUIRED for all implementations, but used only for outbound\n  traffic.]\no Anti-Replay Window: a 32-bit counter and a bit-map (or\n  equivalent) used to determine whether an inbound AH or ESP\n  packet is a replay.\n  [REQUIRED for all implementations but used only for inbound\n  traffic. NOTE: If anti-replay has been disabled by the\n  receiver, e.g., in the case of a manually keyed SA, then the\n  Anti-Replay Window is not used.]\no AH Authentication algorithm, keys, etc.\n  [REQUIRED for AH implementations]\no ESP Encryption algorithm, keys, IV mode, IV, etc.\n  [REQUIRED for ESP implementations]\no ESP authentication algorithm, keys, etc. If the\n  authentication service is not selected, this field will be\n  null.\n  [REQUIRED for ESP implementations]\no Lifetime of this Security Association: a time interval after\n  which an SA must be replaced with a new SA (and new SPI) or\n  terminated, plus an indication of which of these actions\n  should occur.  This may be expressed as a time or byte count,\n  or a simultaneous use of both, the first lifetime to expire\n  taking precedence. A compliant implementation MUST support\n  both types of lifetimes, and must support a simultaneous use\n  of both.  If time is employed, and if IKE employs X.509\n  certificates for SA establishment, the SA lifetime must be\n  constrained by the validity intervals of the certificates,\n  and the NextIssueDate of the CRLs used in the IKE exchange for the SA.  Both initiator and responder are responsible for\n  constraining SA lifetime in this fashion.\n  [REQUIRED for all implementations]",
      "raw": true
    },
    {
      "indent": 11,
      "text": "NOTE: The details of how to handle the refreshing of keys when SAs expire is a local matter. However, one reasonable approach is: (a) If byte count is used, then the implementation SHOULD count the number of bytes to which the IPsec algorithm is applied. For ESP, this is the encryption algorithm (including Null encryption) and for AH, this is the authentication algorithm. This includes pad bytes, etc. Note that implementations SHOULD be able to handle having the counters at the ends of an SA get out of synch, e.g., because of packet loss or because the implementations at each end of the SA aren't doing things the same way. (b) There SHOULD be two kinds of lifetime -- a soft lifetime which warns the implementation to initiate action such as setting up a replacement SA and a hard lifetime when the current SA ends. (c) If the entire packet does not get delivered during the SAs lifetime, the packet SHOULD be discarded.",
      "ja": "注：SAはローカルの問題である有効期限が切れたときに、キーのリフレッシュを処理する方法の詳細。しかしながら、合理的なアプローチがある：バイトカウントを使用する場合（A）、実装は、IPsecアルゴリズムが適用されたバイトの数をカウントします。 ESPの場合、これは（ヌル暗号化を含む）とAHのために、これは認証アルゴリズムで暗号化アルゴリズムです。これは、パケットロスのかSAの各端部の実装は、物事をやっていないので、例えば、実装は、SAの端部のカウンタは同期の出た処理することができるように注意してくださいなど、パッドバイトを含んでいます同じ方法。このような電流SAが終了したときに交換SAとハード寿命を設定するようにアクションを開始するために、実装に警告ソフト寿命 - （b）の寿命の二種類があるべきです。パケット全体がSAのライフタイム中に配信されない場合は（C）、パケットが破棄されるべきです。"
    },
    {
      "indent": 9,
      "text": "o IPsec protocol mode: tunnel, transport or wildcard. Indicates which mode of AH or ESP is applied to traffic on this SA. Note that if this field is \"wildcard\" at the sending end of the SA, then the application has to specify the mode to the IPsec implementation. This use of wildcard allows the same SA to be used for either tunnel or transport mode traffic on a per packet basis, e.g., by different sockets. The receiver does not need to know the mode in order to properly process the packet's IPsec headers.",
      "ja": "O IPsecプロトコルモード：トンネル、輸送またはワイルドカード。 AHまたはESPのモードは、このSA上のトラフィックに適用されていることを示します。このフィールドは、SAの送信側の「ワイルドカード」である場合、アプリケーションはIPsec実装にモードを指定しなければならないことに注意してください。ワイルドカードの使用は、同じSAが異なるソケットによるパケットごとにトンネル又はトランスポートモードトラフィック、例えば、いずれかのために使用されることを可能にします。受信機は、適切にパケットのIPsecのヘッダを処理するためにモードを知っている必要はありません。"
    },
    {
      "indent": 11,
      "text": "[REQUIRED as follows, unless implicitly defined by context: - host implementations must support all modes - gateway implementations must support tunnel mode]",
      "ja": "[暗黙的コンテキストによって定義されない限り、次のように必須： - ホスト実装がすべてのモードをサポートしなければならない - ゲートウェイの実装は、トンネルモードをサポートしなければなりません]"
    },
    {
      "indent": 11,
      "text": "NOTE: The use of wildcard for the protocol mode of an inbound SA may add complexity to the situation in the receiver (host only). Since the packets on such an SA could be delivered in either tunnel or transport mode, the security of an incoming packet could depend in part on which mode had been used to deliver it. If, as a result, an application cared about the SA mode of a given packet, then the application would need a mechanism to obtain this mode information.",
      "ja": "注：インバウンドSAのプロトコルモードのためのワイルドカードの使用は、受信機（ホストのみ）の状況に複雑さを追加することができます。 SAは、いずれかのトンネル又はトランスポートモードで配信することができるようにパケットので、着信パケットのセキュリティは、それを送達するために使用されていたモードに部分的に依存する可能性があります。 、結果として、アプリケーションは、与えられたパケットのSAモードを気にした場合、アプリケーションは、このモードの情報を取得する仕組みが必要になります。"
    },
    {
      "indent": 9,
      "text": "o Path MTU: any observed path MTU and aging variables. See Section 6.1.2.4 [REQUIRED for all implementations but used only for outbound traffic]",
      "ja": "OパスMTU：任意の観測パスMTUと高齢化変数。 [すべての実装のために必須ですが、唯一のアウトバウンドトラフィックに使用]セクション6.1.2.4を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.5 Basic Combinations of Security Associations",
      "section_title": true,
      "ja": "4.5セキュリティアソシエーションの基本的な組み合わせ"
    },
    {
      "indent": 3,
      "text": "This section describes four examples of combinations of security associations that MUST be supported by compliant IPsec hosts or security gateways. Additional combinations of AH and/or ESP in tunnel and/or transport modes MAY be supported at the discretion of the implementor. Compliant implementations MUST be capable of generating these four combinations and on receipt, of processing them, but SHOULD be able to receive and process any combination. The diagrams and text below describe the basic cases. The legend for the diagrams is:",
      "ja": "このセクションでは、準拠のIPsecホストまたはセキュリティゲートウェイによってサポートされなければならないセキュリティアソシエーションの組み合わせの4つの例を記載しています。トンネルおよび/またはトランスポートモードにおけるAHおよび/またはESPのさらなる組み合わせは、実装者の裁量でサポートされるかもしれません。対応する実装は、それらを処理する、これらの4つの組み合わせを生成し、受信時に可能でなければならないが、任意の組み合わせを受信して​​処理することができるべきです。下の図とテキストは、基本的な例を説明します。図の凡例は次のとおりです。"
    },
    {
      "indent": 8,
      "text": "==== = one or more security associations (AH or ESP, transport\n       or tunnel)\n---- = connectivity (or if so labelled, administrative boundary)\nHx   = host x\nSGx  = security gateway x\nX*   = X supports IPsec",
      "raw": true
    },
    {
      "indent": 3,
      "text": "NOTE: The security associations below can be either AH or ESP. The mode (tunnel vs transport) is determined by the nature of the endpoints. For host-to-host SAs, the mode can be either transport or tunnel.",
      "ja": "注：以下のセキュリティアソシエーションはAHまたはESPのいずれかになります。モード（トランスポート対トンネル）は、エンドポイントの性質によって決定されます。ホスト間のSAのために、モードは、トランスポートまたはトンネルのいずれかであり得ます。"
    },
    {
      "indent": 3,
      "text": "Case 1. The case of providing end-to-end security between 2 hosts across the Internet (or an Intranet).",
      "ja": "ケース1インターネット（またはイントラネット）を横切って2つのホスト間のエンドツーエンドのセキュリティを提供する場合。"
    },
    {
      "indent": 16,
      "text": " ====================================\n |                                  |\nH1* ------ (Inter/Intranet) ------ H2*",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Note that either transport or tunnel mode can be selected by the hosts. So the headers in a packet between H1 and H2 could look like any of the following:",
      "ja": "トランスポートまたはトンネルモードのいずれかがホストによって選択することができることに留意されたいです。だから、H1とH2の間のパケットのヘッダーには、次のいずれかのようになります。"
    },
    {
      "indent": 13,
      "text": "     Transport                  Tunnel\n-----------------          ---------------------\n1. [IP1][AH][upper]        4. [IP2][AH][IP1][upper]\n2. [IP1][ESP][upper]       5. [IP2][ESP][IP1][upper]\n3. [IP1][AH][ESP][upper]",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Note that there is no requirement to support general nesting, but in transport mode, both AH and ESP can be applied to the packet. In this event, the SA establishment procedure MUST ensure that first ESP, then AH are applied to the packet.",
      "ja": "一般的なネスティングをサポートするための要件が​​ないことに注意してください、しかし、トランスポートモードでは、AHとESPの両方をパケットに適用することができます。この場合には、SAの確立手順は、最初のESPは、その後、AHは、パケットに適用されていることを確認しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Case 2. This case illustrates simple virtual private networks support.",
      "ja": "ケース2.この場合は、単純な仮想プライベートネットワークのサポートを示しています。"
    },
    {
      "indent": 2,
      "text": "                     ===========================\n                     |                         |\n---------------------|----                  ---|-----------------------\n|                    |   |                  |  |                      |\n|  H1 -- (Local --- SG1* |--- (Internet) ---| SG2* --- (Local --- H2  |\n|        Intranet)       |                  |          Intranet)      |\n--------------------------                  ---------------------------\n    admin. boundary                               admin. boundary",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Only tunnel mode is required here.  So the headers in a packet\nbetween SG1 and SG2 could look like either of the following:",
      "raw": true
    },
    {
      "indent": 16,
      "text": "        Tunnel\n---------------------\n4. [IP2][AH][IP1][upper]\n5. [IP2][ESP][IP1][upper]",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Case 3. This case combines cases 1 and 2, adding end-to-end security between the sending and receiving hosts. It imposes no new requirements on the hosts or security gateways, other than a requirement for a security gateway to be configurable to pass IPsec traffic (including ISAKMP traffic) for hosts behind it.",
      "ja": "このケース3の場合は、送信側と受信側ホストとの間のエンドツーエンドのセキュリティを追加して、ケース1と2を組み合わせました。これは、その背後のホストに対して（ISAKMPトラフィックを含む）のIPsecトラフィックを通過させる構成であることをホストまたはセキュリティゲートウェイの要件以外のセキュリティゲートウェイに新たな要件を課していません。"
    },
    {
      "indent": 2,
      "text": "   ===============================================================\n   |                                                             |\n   |                 =========================                   |\n   |                 |                       |                   |\n---|-----------------|----                ---|-------------------|---\n|  |                 |   |                |  |                   |  |\n| H1* -- (Local --- SG1* |-- (Internet) --| SG2* --- (Local --- H2* |\n|        Intranet)       |                |          Intranet)      |\n--------------------------                ---------------------------\n     admin. boundary                            admin. boundary",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Case 4. This covers the situation where a remote host (H1) uses the Internet to reach an organization's firewall (SG2) and to then gain access to some server or other machine (H2). The remote host could be a mobile host (H1) dialing up to a local PPP/ARA server (not shown) on the Internet and then crossing the Internet to the home organization's firewall (SG2), etc. The details of support for this case, (how H1 locates SG2, authenticates it, and verifies its authorization to represent H2) are discussed in Section 4.6.3, \"Locating a Security Gateway\".",
      "ja": "ケース4は、これは、リモートホスト（H1）が組織のファイアウォール（SG2）に到達し、その後、いくつかのサーバまたは他のマシン（H2）へのアクセスを得るためにインターネットを使用して、状況をカバーしています。リモートホストは、この場合のサポートの詳細など、モバイルホスト（H1）は、インターネット上のローカルPPP / ARAサーバー（図示せず）にダイヤルアップして、ホーム組織のファイアウォール（SG2）にインターネットを横断する、かもしれません、（H1は、SG2を見つけ、それを認証し、H2を表すためにその許可を確認する方法）は、「セキュリティゲートウェイの検索」、4.6.3項で説明されています。"
    },
    {
      "indent": 8,
      "text": "======================================================\n|                                                    |\n|==============================                      |\n||                            |                      |\n||                         ---|----------------------|---\n||                         |  |                      |  |\nH1* ----- (Internet) ------| SG2* ---- (Local ----- H2* |\n      ^                    |           Intranet)        |\n      |                    ------------------------------\ncould be dialup              admin. boundary (optional)\nto PPP/ARA server",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Only tunnel mode is required between H1 and SG2. So the choices for the SA between H1 and SG2 would be one of the ones in case 2. The choices for the SA between H1 and H2 would be one of the ones in case 1.",
      "ja": "のみトンネルモードはH1とSG2との間に必要とされます。そうH1とSG2間のSAの選択肢は、H1とH2との間のSAの選択肢は、ケース1におけるものの一つであろうケース2におけるものの一つであろう。"
    },
    {
      "indent": 8,
      "text": "Note that in this case, the sender MUST apply the transport header before the tunnel header. Therefore the management interface to the IPsec implementation MUST support configuration of the SPD and SAD to ensure this ordering of IPsec header application.",
      "ja": "この場合、送信者は、トンネルヘッダの前にトランスポートヘッダを適用しなければならないことに留意されたいです。したがって、IPsec実装に管理インターフェイスは、IPsecヘッダアプリケーションのこの順序を保証するために、SPDとSADの構成をサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "As noted above, support for additional combinations of AH and ESP is optional. Use of other, optional combinations may adversely affect interoperability.",
      "ja": "上述したように、AHとESPの追加の組み合わせのサポートはオプションです。その他、オプションの組み合わせを使用すると、悪の相互運用性に影響を与える可能性があります。"
    },
    {
      "indent": 0,
      "text": "4.6 SA and Key Management",
      "section_title": true,
      "ja": "4.6 SAと鍵の管理"
    },
    {
      "indent": 3,
      "text": "IPsec mandates support for both manual and automated SA and cryptographic key management. The IPsec protocols, AH and ESP, are largely independent of the associated SA management techniques, although the techniques involved do affect some of the security services offered by the protocols. For example, the optional anti-replay services available for AH and ESP require automated SA management. Moreover, the granularity of key distribution employed with IPsec determines the granularity of authentication provided. (See also a discussion of this issue in Section 4.7.) In general, data origin authentication in AH and ESP is limited by the extent to which secrets used with the authentication algorithm (or with a key management protocol that creates such secrets) are shared among multiple possible sources.",
      "ja": "IPsecのマンデートは、手動および自動のSAと暗号鍵管理の両方に対応しています。関連する技術は、プロトコルによって提供されるセキュリティサービスの一部に影響を与えないものの、IPsecプロトコル、AHとESPは、関連するSA管理技術に大きく依存しています。例えば、AHとESPで利用可能なオプションのアンチリプレイサービスは、自動SA管理が必要です。また、IPSecを用い鍵配布の粒度は、提供された認証の粒度を決定します。 （また、セクション4.7でこの問題の説明を参照。）一般的に、AHとESPのデータ発信元認証は、その（またはそのような秘密を生成する鍵管理プロトコル）認証アルゴリズムを使用する秘密が共有される程度によって制限されます複数の可能なソースの中。"
    },
    {
      "indent": 3,
      "text": "The following text describes the minimum requirements for both types of SA management.",
      "ja": "次のテキストは、SA管理の両方のタイプの最小要件について説明します。"
    },
    {
      "indent": 0,
      "text": "4.6.1 Manual Techniques",
      "section_title": true,
      "ja": "4.6.1マニュアルのテクニック"
    },
    {
      "indent": 3,
      "text": "The simplest form of management is manual management, in which a person manually configures each system with keying material and security association management data relevant to secure communication with other systems. Manual techniques are practical in small, static environments but they do not scale well. For example, a company could create a Virtual Private Network (VPN) using IPsec in security gateways at several sites. If the number of sites is small, and since all the sites come under the purview of a single administrative domain, this is likely to be a feasible context for manual management techniques. In this case, the security gateway might selectively protect traffic to and from other sites within the organization using a manually configured key, while not protecting traffic for other destinations. It also might be appropriate when only selected communications need to be secured. A similar argument might apply to use of IPsec entirely within an organization for a small number of hosts and/or gateways. Manual management techniques often employ statically configured, symmetric keys, though other options also exist.",
      "ja": "管理の最も簡単な形式は、人が手動で他のシステムとの通信を保護するために、関連する材料およびセキュリティアソシエーション管理データをキーイングで各システムを構成する、手動の管理です。マニュアルの技術は、小さな、静的な環境では実用的であるが、彼らはうまくスケールしません。例えば、同社はいくつかの部位でセキュリティゲートウェイにIPsecを使用して仮想プライベートネットワーク（VPN）を作成することができます。すべてのサイトが単一の管理ドメインの権限の下に来るので、サイトの数が少なく、場合、これは手動の管理技術のための実行可能な状況である可能性が高いです。他の宛先へのトラフィックを保護していないながら、この場合、セキュリティゲートウェイは、選択的に、手動で設定されているキーを使用して、組織内の他のサイトからのトラフィックを保護することがあります。唯一の選択された通信を確保する必要がある場合にも適切であるかもしれません。同様の議論は完全にホストおよび/またはゲートウェイの数が少ないため、組織内でのIPsecの使用に適用される場合があります。他のオプションも存在するものの、手動管理技術は、多くの場合、静的に設定され、対称鍵を採用します。"
    },
    {
      "indent": 0,
      "text": "4.6.2 Automated SA and Key Management",
      "section_title": true,
      "ja": "4.6.2自動SAおよびキー管理"
    },
    {
      "indent": 3,
      "text": "Widespread deployment and use of IPsec requires an Internet-standard, scalable, automated, SA management protocol. Such support is required to facilitate use of the anti-replay features of AH and ESP, and to accommodate on-demand creation of SAs, e.g., for user- and session-oriented keying. (Note that the notion of \"rekeying\" an SA actually implies creation of a new SA with a new SPI, a process that generally implies use of an automated SA/key management protocol.)",
      "ja": "広範な展開とIPsecの使用は、インターネット標準でスケーラブルな、自動化され、SA管理プロトコルが必要です。このようなサポートは、AHとESPのアンチリプレイ機能の使用を容易にするために、そしてUSER-およびセッション別鍵のために、例えば、SAのオンデマンド作成に対応するために必要です。 （「再入力」の概念は、SAが実際に新しいSPI、一般的に自動化されたSA /鍵管理プロトコルを使用することを意味プロセスで新しいSAの作成を意味することに注意してください。）"
    },
    {
      "indent": 3,
      "text": "The default automated key management protocol selected for use with IPsec is IKE [MSST97, Orm97, HC98] under the IPsec domain of interpretation [Pip98]. Other automated SA management protocols MAY be employed.",
      "ja": "IPsecで使用するために選択されたデフォルトの自動化された鍵管理プロトコルは、[Pip98]解釈のIPSecドメインの下でIKE [MSST97、Orm97、HC98]です。その他の自動化されたSA管理プロトコルを使用することができます。"
    },
    {
      "indent": 3,
      "text": "When an automated SA/key management protocol is employed, the output from this protocol may be used to generate multiple keys, e.g., for a single ESP SA. This may arise because:",
      "ja": "自動SA /鍵管理プロトコルが使用される場合、このプロトコルからの出力は、単一ESP SAのために、例えば、複数のキーを生成するために使用され得ます。これは、発生することがあります。"
    },
    {
      "indent": 7,
      "text": "o the encryption algorithm uses multiple keys (e.g., triple DES)\no the authentication algorithm uses multiple keys\no both encryption and authentication algorithms are employed",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The Key Management System may provide a separate string of bits for each key or it may generate one string of bits from which all of them are extracted. If a single string of bits is provided, care needs to be taken to ensure that the parts of the system that map the string of bits to the required keys do so in the same fashion at both ends of the SA. To ensure that the IPsec implementations at each end of the SA use the same bits for the same keys, and irrespective of which part of the system divides the string of bits into individual keys, the encryption key(s) MUST be taken from the first (left-most, high-order) bits and the authentication key(s) MUST be taken from the remaining bits. The number of bits for each key is defined in the relevant algorithm specification RFC. In the case of multiple encryption keys or multiple authentication keys, the specification for the algorithm must specify the order in which they are to be selected from a single string of bits provided to the algorithm.",
      "ja": "キー管理システムは、各キーのビットの別々の文字列を提供することができるか、それはそれらのすべてが抽出されるビットのうちの1つの文字列を生成してもよいです。ビットの単一の列が設けられている場合、注意が必要なキーにビット列をマッピングするシステムの部分は、SAの両端に同じ様式で行うように注意する必要があります。 SAの各端部にIPsec実装は、個々のキーにビット列を分割し、そしてかかわらず、システムのどの部分が同じ鍵に対して同じビットを使用することを保証するために、暗号鍵（単数または複数）は、最初から取らなければなりません（一番左の、上位）ビットと認証鍵（単数または複数）は、残りのビットから取らなければなりません。各キーのビット数は、関連アルゴリズム仕様RFCに定義されています。複数の暗号化キーまたは複数の認証キーの場合には、アルゴリズムの仕様は、それらがアルゴリズムに提供ビットの単一列から選択される順序を指定しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.6.3 Locating a Security Gateway",
      "section_title": true,
      "ja": "セキュリティゲートウェイの検索4.6.3"
    },
    {
      "indent": 3,
      "text": "This section discusses issues relating to how a host learns about the existence of relevant security gateways and once a host has contacted these security gateways, how it knows that these are the correct security gateways. The details of where the required information is stored is a local matter.",
      "ja": "このセクションでは、ホストは、関連するセキュリティゲートウェイの存在を、ホストが、それはこれらが正しいセキュリティ・ゲートウェイであることを知っているか、これらのセキュリティ・ゲートウェイに接触した後、学習方法に関連する問題について説明します。必要な情報が格納されている場所の詳細はローカルの問題です。"
    },
    {
      "indent": 3,
      "text": "Consider a situation in which a remote host (H1) is using the Internet to gain access to a server or other machine (H2) and there is a security gateway (SG2), e.g., a firewall, through which H1's traffic must pass. An example of this situation would be a mobile host (Road Warrior) crossing the Internet to the home organization's firewall (SG2). (See Case 4 in the section 4.5 Basic Combinations of Security Associations.) This situation raises several issues:",
      "ja": "リモートホスト（H1）は、サーバや他のマシン（H2）へのアクセスを得るためにインターネットを使用しており、H1のトラフィックが通過しなければならない例えばセキュリティゲートウェイ（SG2）、ファイアウォールが、が存在する状況を考えてみましょう。このような状況の例は、ホーム組織のファイアウォール（SG2）にインターネットを横断するモバイルホスト（ロードウォリアー）になります。 （セキュリティアソシエーションのセクション4.5基本的な組み合わせでケース4を参照してください。）このような状況は、いくつかの問題が発生します。"
    },
    {
      "indent": 8,
      "text": "1. How does H1 know/learn about the existence of the security\n   gateway SG2?\n2. How does it authenticate SG2, and once it has authenticated\n   SG2, how does it confirm that SG2 has been authorized to\n   represent H2?\n3. How does SG2 authenticate H1 and verify that H1 is authorized\n   to contact H2?\n4. How does H1 know/learn about backup gateways which provide\n   alternate paths to H2?",
      "raw": true
    },
    {
      "indent": 3,
      "text": "To address these problems, a host or security gateway MUST have an administrative interface that allows the user/administrator to configure the address of a security gateway for any sets of destination addresses that require its use. This includes the ability to configure:",
      "ja": "これらの問題に対処するために、ホストまたはセキュリティゲートウェイでは、ユーザー/管理者がその使用を必要と宛先アドレスのいずれかのセットのためのセキュリティゲートウェイのアドレスを設定することを可能にする管理インタフェースを持たなければなりません。これは、設定する機能が含まれています。"
    },
    {
      "indent": 8,
      "text": "o the requisite information for locating and authenticating the\n  security gateway and verifying its authorization to represent\n  the destination host.\no the requisite information for locating and authenticating any\n  backup gateways and verifying their authorization to represent\n  the destination host.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "It is assumed that the SPD is also configured with policy information that covers any other IPsec requirements for the path to the security gateway and the destination host.",
      "ja": "SPDは、セキュリティゲートウェイと宛先ホストへの経路のための任意の他のIPsec要件をカバーするポリシー情報が設定されているものとします。"
    },
    {
      "indent": 3,
      "text": "This document does not address the issue of how to automate the discovery/verification of security gateways.",
      "ja": "この文書では、セキュリティゲートウェイの発見/検証を自動化する方法の問題に対処しません。"
    },
    {
      "indent": 0,
      "text": "4.7 Security Associations and Multicast",
      "section_title": true,
      "ja": "4.7セキュリティアソシエーションとマルチキャスト"
    },
    {
      "indent": 3,
      "text": "The receiver-orientation of the Security Association implies that, in the case of unicast traffic, the destination system will normally select the SPI value. By having the destination select the SPI value, there is no potential for manually configured Security Associations to conflict with automatically configured (e.g., via a key management protocol) Security Associations or for Security Associations from multiple sources to conflict with each other. For multicast traffic, there are multiple destination systems per multicast group. So some system or person will need to coordinate among all multicast groups to select an SPI or SPIs on behalf of each multicast group and then communicate the group's IPsec information to all of the legitimate members of that multicast group via mechanisms not defined here.",
      "ja": "セキュリティアソシエーションの受信配向は、ユニキャストトラフィックの場合には、宛先システムは、通常のSPI値を選択する、ことを意味します。宛先は、SPI値を選択して有することにより、自動的に設定との競合を手動で設定されたセキュリティアソシエーションのための可能性は存在しない（例えば、鍵管理プロトコルを介して）セキュリティアソシエーション又はセキュリティアソシエーションのために複数のソースから互いに競合することができます。マルチキャストトラフィックの場合、マルチキャストグループごとに複数の宛先システムがあります。だから、いくつかのシステムや人は、各マルチキャストグループを代表してSPIまたはのSPIを選択し、ここで定義されていないメカニズムを介して、そのマルチキャストグループの正当なメンバーの全員にグループのIPsecの情報を通信するために、すべてのマルチキャストグループ間の調整が必要になります。"
    },
    {
      "indent": 3,
      "text": "Multiple senders to a multicast group SHOULD use a single Security Association (and hence Security Parameter Index) for all traffic to that group when a symmetric key encryption or authentication algorithm is employed. In such circumstances, the receiver knows only that the message came from a system possessing the key for that multicast group. In such circumstances, a receiver generally will not be able to authenticate which system sent the multicast traffic. Specifications for other, more general multicast cases are deferred to later IPsec documents.",
      "ja": "対称鍵暗号化や認証アルゴリズムを採用した場合、マルチキャストグループへの複数の送信者は、そのグループへのすべてのトラフィックのために、単一のセキュリティ協会（したがって、セキュリティパラメータインデックス）を使用する必要があります。このような状況では、受信機は、メッセージがそのマルチキャストグループのための鍵を有するシステムから来たことだけを知っています。このような状況では、受信機は、一般的にマルチキャストトラフィックを送信したシステム認証することができません。他の、より一般的なマルチキャストの場合の仕様は、後のIPsec文書に延期されています。"
    },
    {
      "indent": 3,
      "text": "At the time this specification was published, automated protocols for multicast key distribution were not considered adequately mature for standardization. For multicast groups having relatively few members, manual key distribution or multiple use of existing unicast key distribution algorithms such as modified Diffie-Hellman appears feasible. For very large groups, new scalable techniques will be needed. An example of current work in this area is the Group Key Management Protocol (GKMP) [HM97].",
      "ja": "この仕様が公開された時点では、マルチキャスト鍵配布のための自動化されたプロトコルは、適切に標準化のために成熟すると考えられていませんでした。比較的少ないメンバを有するマルチキャストグループに対して、そのような修飾されたディフィー・ヘルマン等の既存のユニキャスト鍵配布アルゴリズムの手動鍵配布または複数の使用が可能で現れます。非常に大規模なグループのために、新しいスケーラブルな技術が必要になります。この分野での現在の仕事の例は、グループ鍵管理プロトコル（GKMP）[HM97]です。"
    },
    {
      "indent": 0,
      "text": "5. IP Traffic Processing",
      "section_title": true,
      "ja": "5. IPトラフィック処理"
    },
    {
      "indent": 3,
      "text": "As mentioned in Section 4.4.1 \"The Security Policy Database (SPD)\", the SPD must be consulted during the processing of all traffic (INBOUND and OUTBOUND), including non-IPsec traffic. If no policy is found in the SPD that matches the packet (for either inbound or outbound traffic), the packet MUST be discarded.",
      "ja": "「セキュリティポリシーデータベース（SPD）は、」4.4.1項で述べたように、SPDは、非IPsecトラフィックを含む、すべてのトラフィック（インバウンドとアウトバウンド）の処理、中に相談する必要があります。ポリシーが（インバウンドまたはアウトバウンドトラフィックのための）パケットに一致するSPDに見つからない場合、パケットは捨てなければなりません。"
    },
    {
      "indent": 3,
      "text": "NOTE: All of the cryptographic algorithms used in IPsec expect their input in canonical network byte order (see Appendix in RFC 791) and generate their output in canonical network byte order. IP packets are also transmitted in network byte order.",
      "ja": "注：IPsecのに使用される暗号化アルゴリズムのすべての標準的なネットワークバイトオーダーでの入力を期待する（RFC 791の付録を参照）、正規のネットワークバイトオーダーでの出力を生成します。 IPパケットは、ネットワークバイトオーダーで送信されています。"
    },
    {
      "indent": 0,
      "text": "5.1 Outbound IP Traffic Processing",
      "section_title": true,
      "ja": "5.1アウトバウンドIPトラフィック処理"
    },
    {
      "indent": 0,
      "text": "5.1.1 Selecting and Using an SA or SA Bundle",
      "section_title": true,
      "ja": "5.1.1 SAまたはSAバンドルの選択と使用"
    },
    {
      "indent": 3,
      "text": "In a security gateway or BITW implementation (and in many BITS implementations), each outbound packet is compared against the SPD to determine what processing is required for the packet. If the packet is to be discarded, this is an auditable event. If the traffic is allowed to bypass IPsec processing, the packet continues through \"normal\" processing for the environment in which the IPsec processing is taking place. If IPsec processing is required, the packet is either mapped to an existing SA (or SA bundle), or a new SA (or SA bundle) is created for the packet. Since a packet's selectors might match multiple policies or multiple extant SAs and since the SPD is ordered, but the SAD is not, IPsec MUST:",
      "ja": "セキュリティゲートウェイまたはBITW実装（および多くのBITS実装において）において、各発信パケットは、パケットのために必要とされるものの処理を決定するためにSPDと比較されます。パケットが破棄される場合、これは監査対象イベントとなります。トラフィックがIPsec処理をバイパスすることが許可されている場合、パケットはIPsec処理が行われている環境のための「通常」の処理まで続きます。 IPsec処理が必要な場合、パケットは、いずれかの既存のSA（またはSAバンドル）、または新しいSA（またはSAバンドル）パケットのために作成さにマッピングされます。パケットのセレクタは、複数のポリシーまたは複数の現存のSAと一致する可能性があり、SPDが発注されていますが、SADではないため、IPsecはなければならないからです："
    },
    {
      "indent": 11,
      "text": "1. Match the packet's selector fields against the outbound\n   policies in the SPD to locate the first appropriate\n   policy, which will point to zero or more SA bundles in the\n   SAD.",
      "raw": true
    },
    {
      "indent": 11,
      "text": "2. Match the packet's selector fields against those in the SA bundles found in (1) to locate the first SA bundle that matches. If no SAs were found or none match, create an appropriate SA bundle and link the SPD entry to the SAD entry. If no key management entity is found, drop the packet.",
      "ja": "一致する最初のSAバンドルを検索する（1）に見出さSAバンドルのものに対して2マッチパケットのセレクタフィールド。何SAが見つからないか、どれもが一致した場合には、適切なSAバンドルを作成し、SADエントリにSPDエントリをリンクします。何の鍵管理エンティティが見つからない場合は、パケットをドロップします。"
    },
    {
      "indent": 11,
      "text": "3. Use the SA bundle found/created in (2) to do the required IPsec processing, e.g., authenticate and encrypt.",
      "ja": "3（2）、例えば、必要なIPsec処理を行う認証し、暗号化するで作成/見出さSAバンドルを使用します。"
    },
    {
      "indent": 3,
      "text": "In a host IPsec implementation based on sockets, the SPD will be consulted whenever a new socket is created, to determine what, if any, IPsec processing will be applied to the traffic that will flow on that socket.",
      "ja": "新しいソケットが作成されるたびに、ソケットに基づくホストのIPsec実装では、SPDがあれば、IPsec処理は、そのソケットに流入するトラフィックに適用されるかを決定するために、相談されます。"
    },
    {
      "indent": 3,
      "text": "NOTE: A compliant implementation MUST not allow instantiation of an ESP SA that employs both a NULL encryption and a NULL authentication algorithm. An attempt to negotiate such an SA is an auditable event.",
      "ja": "注：準拠した実装は、NULL暗号化およびNULL認証アルゴリズムの両方を使用するESP SAのインスタンス化を許してはなりません。そのようなSAを交渉しようとする試みは、監査対象イベントとなります。"
    },
    {
      "indent": 0,
      "text": "5.1.2 Header Construction for Tunnel Mode",
      "section_title": true,
      "ja": "トンネルモードのための5.1.2ヘッダー建設"
    },
    {
      "indent": 3,
      "text": "This section describes the handling of the inner and outer IP headers, extension headers, and options for AH and ESP tunnels. This includes how to construct the encapsulating (outer) IP header, how to handle fields in the inner IP header, and what other actions should be taken. The general idea is modeled after the one used in RFC 2003, \"IP Encapsulation with IP\":",
      "ja": "このセクションでは、内側と外側のIPヘッダ、拡張ヘッダ、そしてAHおよびESPトンネルのオプションの取り扱いについて説明しています。これは、内側のIPヘッダ内のフィールドを処理する方法を封入（外側）IPヘッダを構築する方法を含み、他のどのようなアクションが取られるべきです。一般的な考えは、「IPとIPカプセル化」、RFC 2003で使用されるものの後にモデル化されています。"
    },
    {
      "indent": 8,
      "text": "o The outer IP header Source Address and Destination Address\n  identify the \"endpoints\" of the tunnel (the encapsulator and\n  decapsulator).  The inner IP header Source Address and\n  Destination Addresses identify the original sender and\n  recipient of the datagram, (from the perspective of this\n  tunnel), respectively.  (see footnote 3 after the table in\n  5.1.2.1 for more details on the encapsulating source IP\n  address.)\no The inner IP header is not changed except to decrement the TTL\n  as noted below, and remains unchanged during its delivery to\n  the tunnel exit point.\no No change to IP options or extension headers in the inner\n  header occurs during delivery of the encapsulated datagram\n  through the tunnel.\no If need be, other protocol headers such as the IP\n  Authentication header may be inserted between the outer IP\n  header and the inner IP header.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The tables in the following sub-sections show the handling for the different header/option fields (constructed = the value in the outer field is constructed independently of the value in the inner).",
      "ja": "以下のサブセクションの表は、（=外側のフィールドの値が内部に独立した値で構成されて構築された）異なるヘッダ/オプションのフィールドの処理を示します。"
    },
    {
      "indent": 0,
      "text": "5.1.2.1 IPv4 -- Header Construction for Tunnel Mode",
      "section_title": true,
      "ja": "5.1.2.1のIPv4  - トンネルモードのヘッダ建設"
    },
    {
      "indent": 3,
      "text": "                     <-- How Outer Hdr Relates to Inner Hdr -->\n                     Outer Hdr at                 Inner Hdr at\nIPv4                 Encapsulator                 Decapsulator\n  Header fields:     --------------------         ------------\n    version          4 (1)                        no change\n    header length    constructed                  no change\n    TOS              copied from inner hdr (5)    no change\n    total length     constructed                  no change\n    ID               constructed                  no change\n    flags (DF,MF)    constructed, DF (4)          no change\n    fragmt offset    constructed                  no change",
      "raw": true
    },
    {
      "indent": 3,
      "text": " TTL constructed (2) decrement (2) protocol AH, ESP, routing hdr no change checksum constructed constructed (2) src address constructed (3) no change dest address constructed (3) no change Options never copied no change",
      "ja": "TTL構築（2）デクリメント（2）プロトコルAH、ESP、ルーティングHDR構築変化チェックサムを構築しない（2）SRCアドレスが構築構築（3）変化なしの宛先アドレス（3）変化オプションは何の変化もコピーされたことがありません"
    },
    {
      "indent": 8,
      "text": "1. The IP version in the encapsulating header can be different\n   from the value in the inner header.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "2. The TTL in the inner header is decremented by the encapsulator prior to forwarding and by the decapsulator if it forwards the packet. (The checksum changes when the TTL changes.)",
      "ja": "2.内部ヘッダ内のTTLは、従来、パケットを転送する場合、転送およびカプセル開放装置によってカプセル化することによりデクリメントされます。 （チェックサムは場合TTLの変更を変更します。）"
    },
    {
      "indent": 11,
      "text": "Note: The decrementing of the TTL is one of the usual actions that takes place when forwarding a packet. Packets originating from the same node as the encapsulator do not have their TTL's decremented, as the sending node is originating the packet rather than forwarding it.",
      "ja": "注意：TTLのデクリメントは、パケットを転送する際に行われる通常のアクションのいずれかです。送信ノードがパケットを発信するのではなく、それを転送しているとカプセル化と同じノードから発信されたパケットは、そのTTLのデクリメントはありません。"
    },
    {
      "indent": 8,
      "text": "3. src and dest addresses depend on the SA, which is used to determine the dest address which in turn determines which src address (net interface) is used to forward the packet.",
      "ja": "3. SRCおよびDESTアドレスが順番にパケットを転送するために使用されるSRCアドレス（ネットインターフェース）を決定する宛先アドレスを決定するために使用されるSAに依存します。"
    },
    {
      "indent": 11,
      "text": "NOTE: In principle, the encapsulating IP source address can be any of the encapsulator's interface addresses or even an address different from any of the encapsulator's IP addresses, (e.g., if it's acting as a NAT box) so long as the address is reachable through the encapsulator from the environment into which the packet is sent. This does not cause a problem because IPsec does not currently have any INBOUND processing requirement that involves the Source Address of the encapsulating IP header. So while the receiving tunnel endpoint looks at the Destination Address in the encapsulating IP header, it only looks at the Source Address in the inner (encapsulated) IP header.",
      "ja": "注：（それはNATボックスとして機能するなら、例えば）原則として、カプセル化IPソースアドレスがあれば、アドレスは介して到達可能であるように、カプセル化のインターフェイスアドレスまたはカプセル化のIPアドレスのいずれとも異なる偶数アドレスのいずれかとすることができますパケットが送信されるに環境からカプセル化。 IPsecは現在、カプセル化IPヘッダの送信元アドレスを必要とする任意のINBOUND処理の要件を持っていないので、これは問題ありません。受信トンネルエンドポイントは、カプセル化IPヘッダ内の宛先アドレスを見つつ、それだけ内側（カプセル化）IPヘッダのソースアドレスを調べ。"
    },
    {
      "indent": 8,
      "text": "4. configuration determines whether to copy from the inner header (IPv4 only), clear or set the DF.",
      "ja": "4.構成は、内部ヘッダ（IPv4のみ）からコピークリアまたはDFを設定するか否かを判定する。"
    },
    {
      "indent": 8,
      "text": "5. If Inner Hdr is IPv4 (Protocol = 4), copy the TOS. If Inner Hdr is IPv6 (Protocol = 41), map the Class to TOS.",
      "ja": "前記内側HDRは、IPv4（プロトコル= 4）である場合、TOSをコピーします。内側ヘッダがIPv6（プロトコル= 41）であれば、TOSにクラスをマッピングします。"
    },
    {
      "indent": 0,
      "text": "5.1.2.2 IPv6 -- Header Construction for Tunnel Mode",
      "section_title": true,
      "ja": "5.1.2.2 IPv6の - トンネルモードのヘッダ建設"
    },
    {
      "indent": 3,
      "text": "See previous section 5.1.2 for notes 1-5 indicated by (footnote number).",
      "ja": "（脚注番号）で示されるノート1-5前のセクション5.1.2を参照。"
    },
    {
      "indent": 3,
      "text": "                     <-- How Outer Hdr  Relates Inner Hdr --->\n                     Outer Hdr at                 Inner Hdr at\nIPv6                 Encapsulator                 Decapsulator\n  Header fields:     --------------------         ------------\n    version          6 (1)                        no change\n    class            copied or configured (6)     no change\n    flow id          copied or configured         no change\n    len              constructed                  no change\n    next header      AH,ESP,routing hdr           no change\n    hop limit        constructed (2)              decrement (2)\n    src address      constructed (3)              no change\n    dest address     constructed (3)              no change\n  Extension headers  never copied                 no change",
      "raw": true
    },
    {
      "indent": 8,
      "text": "6. If Inner Hdr is IPv6 (Next Header = 41), copy the Class.  If\n   Inner Hdr is IPv4 (Next Header = 4), map the TOS to Class.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5.2 Processing Inbound IP Traffic",
      "section_title": true,
      "ja": "5.2処理インバウンドIPトラフィック"
    },
    {
      "indent": 3,
      "text": "Prior to performing AH or ESP processing, any IP fragments are reassembled. Each inbound IP datagram to which IPsec processing will be applied is identified by the appearance of the AH or ESP values in the IP Next Protocol field (or of AH or ESP as an extension header in the IPv6 context).",
      "ja": "AHまたはESP処理を実行する前に、任意のIPフラグメントが再組み立てされています。 IPsec処理が適用されるために、各受信IPデータグラムは、（IPv6のコンテキストの拡張ヘッダとして、またはAHまたはESPの）IP次のプロトコルフィールドにAHまたはESP値の出現によって識別されます。"
    },
    {
      "indent": 3,
      "text": "Note: Appendix C contains sample code for a bitmask check for a 32 packet window that can be used for implementing anti-replay service.",
      "ja": "注意：付録Cは、アンチリプレイサービスを実装するために使用することができる32パケットウィンドウのビットマスクチェックのサンプルコードが含まれています。"
    },
    {
      "indent": 0,
      "text": "5.2.1 Selecting and Using an SA or SA Bundle",
      "section_title": true,
      "ja": "5.2.1 SAまたはSAバンドルの選択と使用"
    },
    {
      "indent": 3,
      "text": "Mapping the IP datagram to the appropriate SA is simplified because of the presence of the SPI in the AH or ESP header. Note that the selector checks are made on the inner headers not the outer (tunnel) headers. The steps followed are:",
      "ja": "適切なSAへのIPデータグラムをマッピングするためにAHまたはESPヘッダ内のSPIの存在の単純化されます。セレクタチェックが内部ヘッダではない外側の（トンネル）ヘッダ上に形成されていることに留意されたいです。続く手順は次のとおりです。"
    },
    {
      "indent": 11,
      "text": "1. Use the packet's destination address (outer IP header),\n   IPsec protocol, and SPI to look up the SA in the SAD.  If\n   the SA lookup fails, drop the packet and log/report the\n   error.",
      "raw": true
    },
    {
      "indent": 11,
      "text": "2. Use the SA found in (1) to do the IPsec processing, e.g., authenticate and decrypt. This step includes matching the packet's (Inner Header if tunneled) selectors to the selectors in the SA. Local policy determines the specificity of the SA selectors (single value, list, range, wildcard). In general, a packet's source address MUST match the SA selector value. However, an ICMP packet received on a tunnel mode SA may have a source address other than that bound to the SA and thus such packets should be permitted as exceptions to this check. For an ICMP packet, the selectors from the enclosed problem packet (the source and destination addresses and ports should be swapped) should be checked against the selectors for the SA. Note that some or all of these selectors may be inaccessible because of limitations on how many bits of the problem packet the ICMP packet is allowed to carry or due to encryption. See Section 6.",
      "ja": "2. SAを使用して、（1）、IPsec処理を行い、例えば、認証および解読するために発見しました。このステップでは、SA内のセレクタにセレクタ（トンネリングされている場合は内側ヘッダ）のパケットのマッチングを含んでいます。ローカルポリシーは、SAセレクタ（単一の値、リスト、範囲、ワイルドカード）の特異性を決定します。一般に、パケットの送信元アドレスは、SAのセレクタ値と一致しなければなりません。しかしながら、ICMPパケットは、SAに結合し、したがって、そのようなパケットはこのチェックの例外として許可されるべきである以外のソースアドレスを有することができるトンネルモードSA上で受信されました。 ICMPパケットを、同封問題パケット（送信元と宛先のアドレスおよびポートが交換されなければならない）からセレクタSAのセレクタに対してチェックされるべきです。これらのセレクタの一部またはすべてが原因暗号化に問題がパケットのICMPパケットを運ぶために許可されているどのように多くのビットのかによる制限のためアクセスできないことに注意してください。第6章を参照してください。"
    },
    {
      "indent": 14,
      "text": "Do (1) and (2) for every IPsec header until a Transport Protocol Header or an IP header that is NOT for this system is encountered. Keep track of what SAs have been used and their order of application.",
      "ja": "トランスポートプロトコルヘッダーまたはこのシステムにされていないIPヘッダに遭遇するまで、すべてのIPsecヘッダのために（1）及び（2）を行います。 SAが使用されているかどうかのトラックおよびそれらの適用順序を保管してください。"
    },
    {
      "indent": 11,
      "text": "3. Find an incoming policy in the SPD that matches the packet. This could be done, for example, by use of backpointers from the SAs to the SPD or by matching the packet's selectors (Inner Header if tunneled) against those of the policy entries in the SPD.",
      "ja": "3.パケットに一致するSPDで受信ポリシーを検索します。 （トンネリングされている場合は内側ヘッダ）これは、SPD内のポリシーエントリのそれらに対して例えば、SPDへのSAからのバックポインタを使用することによって、またはパケットのセレクタを照合することによって、行うことができます。"
    },
    {
      "indent": 11,
      "text": "4. Check whether the required IPsec processing has been applied, i.e., verify that the SA's found in (1) and (2) match the kind and order of SAs required by the policy found in (3).",
      "ja": "必要なIPsec処理、すなわち、SAの（1）に見られることを確認し、適用し、（2）（3）に見出されるポリシーによって要求されるSAの種類と順序と一致されているかどうかを確認4.。"
    },
    {
      "indent": 14,
      "text": "NOTE: The correct \"matching\" policy will not necessarily be the first inbound policy found. If the check in (4) fails, steps (3) and (4) are repeated until all policy entries have been checked or until the check succeeds.",
      "ja": "注：正しい「マッチング」政策は、必ずしも最初に見つかった着信ポリシーではありません。 （4）内のチェックが失敗した場合は、ステップ（3）と、すべてのポリシーエントリをチェックしたり、チェックが成功するまでされるまで、（4）を繰り返します。"
    },
    {
      "indent": 3,
      "text": "At the end of these steps, pass the resulting packet to the Transport Layer or forward the packet. Note that any IPsec headers processed in these steps may have been removed, but that this information, i.e., what SAs were used and the order of their application, may be needed for subsequent IPsec or firewall processing.",
      "ja": "これらのステップの終わりには、トランスポート層への結果のパケットを渡すか、パケットを転送します。これらの手順で処理任意のIPsecヘッダが除去されてもよいことに留意されたいが、この情報は、すなわち、何のSAを使用し、それらのアプリケーションの順序は、後続のIPsecまたはファイアウォール処理のために必要とされるかもしれません。"
    },
    {
      "indent": 3,
      "text": "Note that in the case of a security gateway, if forwarding causes a packet to exit via an IPsec-enabled interface, then additional IPsec processing may be applied.",
      "ja": "転送がIPSec対応インタフェースを介して終了したパケットを引き起こす場合、セキュリティゲートウェイの場合には、追加のIPsec処理が適用されてもよいことに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "5.2.2 Handling of AH and ESP tunnels",
      "section_title": true,
      "ja": "AHとESPトンネルの5.2.2取扱い"
    },
    {
      "indent": 3,
      "text": "The handling of the inner and outer IP headers, extension headers, and options for AH and ESP tunnels should be performed as described in the tables in Section 5.1.",
      "ja": "第5.1節の表に記載されているように、内側および外側IPヘッダ、拡張ヘッダ、そしてAHおよびESPトンネルのオプションの処理が実行されるべきです。"
    },
    {
      "indent": 0,
      "text": "6. ICMP Processing (relevant to IPsec)",
      "section_title": true,
      "ja": "6. ICMP処理（IPsecのに関連します）"
    },
    {
      "indent": 3,
      "text": "The focus of this section is on the handling of ICMP error messages. Other ICMP traffic, e.g., Echo/Reply, should be treated like other traffic and can be protected on an end-to-end basis using SAs in the usual fashion.",
      "ja": "このセクションの焦点は、ICMPエラーメッセージの処理にあります。他のICMPトラフィックは、例えば、エコー/応答は、他のトラフィックと同じように扱われるべきであり、通常の方法でSAを使用して、エンドツーエンドベースで保護することができます。"
    },
    {
      "indent": 3,
      "text": "An ICMP error message protected by AH or ESP and generated by a router SHOULD be processed and forwarded in a tunnel mode SA. Local policy determines whether or not it is subjected to source address checks by the router at the destination end of the tunnel. Note that if the router at the originating end of the tunnel is forwarding an ICMP error message from another router, the source address check would fail. An ICMP message protected by AH or ESP and generated by a router MUST NOT be forwarded on a transport mode SA (unless the SA has been established to the router acting as a host, e.g., a Telnet connection used to manage a router). An ICMP message generated by a host SHOULD be checked against the source IP address selectors bound to the SA in which the message arrives. Note that even if the source of an ICMP error message is authenticated, the returned IP header could be invalid. Accordingly, the selector values in the IP header SHOULD also be checked to be sure that they are consistent with the selectors for the SA over which the ICMP message was received.",
      "ja": "ICMPエラーメッセージAHまたはESPによって保護され、ルータによって生成されたトンネルモードSAで処理し、転送されるべきです。ローカルポリシーは、それがトンネルの宛先エンドでルータによって送信元アドレスチェックに供されたか否かを判定する。トンネルの発信側のルータが他のルータからICMPエラーメッセージを転送している場合、送信元アドレスチェックが失敗することに留意されたいです。 （SAは、例えばホスト、ルータを管理するために使用されるTelnet接続として機能するルータに確立されていない限り）ルータによってAHまたはESPによって保護され、生成されたICMPメッセージは、トランスポートモードSA上で転送されてはいけません。ホストによって生成されたICMPメッセージは、メッセージが到着したSAに結合された送信元IPアドレスセレクタに対してチェックする必要があります。 ICMPエラーメッセージの送信元が認証されていても、返されたIPヘッダが無効であることに留意されたいです。従って、IPヘッダ内のセレクタ値はまた、彼らはICMPメッセージを受信した上にSAのセレクタと一致していることを確認するためにチェックすべきです。"
    },
    {
      "indent": 3,
      "text": "The table in Appendix D characterize ICMP messages as being either host generated, router generated, both, unknown/unassigned. ICMP messages falling into the last two categories should be handled as determined by the receiver's policy.",
      "ja": "付録Dの表には、いずれかのホスト生成し、両方、不明/未割り当て、生成されたルータであるとしてICMPメッセージを特徴付けます。受信者の政策によって決定された最後の二つのカテゴリーに落下するICMPメッセージを処理する必要があります。"
    },
    {
      "indent": 3,
      "text": "An ICMP message not protected by AH or ESP is unauthenticated and its processing and/or forwarding may result in denial of service. This suggests that, in general, it would be desirable to ignore such messages. However, it is expected that many routers (vs. security gateways) will not implement IPsec for transit traffic and thus strict adherence to this rule would cause many ICMP messages to be discarded. The result is that some critical IP functions would be lost, e.g., redirection and PMTU processing. Thus it MUST be possible to configure an IPsec implementation to accept or reject (router) ICMP traffic as per local security policy.",
      "ja": "AHまたはESPによって保護されていないICMPメッセージは認証され、その処理及び/又は転送は、サービスの拒否をもたらすことができます。これは、一般的に、このようなメッセージを無視することが望ましいであろう、ということを示唆しています。しかし、（セキュリティゲートウェイ対）多くのルータはトランジットトラフィックのためのIPsecを実装しないであろうと、この規則のため厳守は多くのICMPメッセージを廃棄する原因となることが期待されます。その結果は、いくつかの重要なIP機能は、例えば、リダイレクトやPMTU処理を失われるだろうということです。したがって、受け入れるか、またはローカルセキュリティポリシーに従って（ルータ）ICMPトラフィックを拒否するIPsec実装を構成することが可能でなければなりません。"
    },
    {
      "indent": 3,
      "text": "The remainder of this section addresses how PMTU processing MUST be performed at hosts and security gateways. It addresses processing of both authenticated and unauthenticated ICMP PMTU messages. However, as noted above, unauthenticated ICMP messages MAY be discarded based on local policy.",
      "ja": "このセクションの残りの部分は、PMTU処理がホストとセキュリティゲートウェイで実行しなければなりませんどのように対処しています。これは、両方の認証され、認証されていないICMP PMTUメッセージの処理に対応しています。しかし、上述のように、未認証のICMPメッセージは、ローカルポリシーに基づいて破棄されることがあります。"
    },
    {
      "indent": 0,
      "text": "6.1 PMTU/DF Processing",
      "section_title": true,
      "ja": "6.1 PMTU / DF処理"
    },
    {
      "indent": 0,
      "text": "6.1.1 DF Bit",
      "section_title": true,
      "ja": "6.1.1 DFビット"
    },
    {
      "indent": 3,
      "text": "In cases where a system (host or gateway) adds an encapsulating header (ESP tunnel or AH tunnel), it MUST support the option of copying the DF bit from the original packet to the encapsulating header (and processing ICMP PMTU messages). This means that it MUST be possible to configure the system's treatment of the DF bit (set, clear, copy from encapsulated header) for each interface. (See Appendix B for rationale.)",
      "ja": "システム（ホストまたはゲートウェイ）がカプセル化ヘッダ（ESPトンネルまたはAHトンネル）を追加する場合には、カプセル化ヘッダに元のパケットのDFビットをコピー（およびICMP PMTUメッセージを処理する）のオプションをサポートしなければなりません。各インタフェースのDFビット（セット、カプセル化されたヘッダからクリア、コピー）のシステムの処理を構成することが可能でなければならないことを意味します。 （根拠については、付録Bを参照してください。）"
    },
    {
      "indent": 0,
      "text": "6.1.2 Path MTU Discovery (PMTU)",
      "section_title": true,
      "ja": "6.1.2パスMTUディスカバリ（PMTU）"
    },
    {
      "indent": 3,
      "text": "This section discusses IPsec handling for Path MTU Discovery messages. ICMP PMTU is used here to refer to an ICMP message for:",
      "ja": "このセクションでは、パスMTUディスカバリメッセージのIPsec取り扱いについて説明します。 ICMP PMTUはのためのICMPメッセージを参照するために、ここで使用されます。"
    },
    {
      "indent": 11,
      "text": "IPv4 (RFC 792):\n        - Type = 3 (Destination Unreachable)\n        - Code = 4 (Fragmentation needed and DF set)\n        - Next-Hop MTU in the low-order 16 bits of the second\n          word of the ICMP header (labelled \"unused\" in RFC\n          792), with high-order 16 bits set to zero",
      "raw": true
    },
    {
      "indent": 11,
      "text": "IPv6 (RFC 1885): - Type = 2 (Packet Too Big) - Code = 0 (Fragmentation needed) - Next-Hop MTU in the 32 bit MTU field of the ICMP6 message",
      "ja": "IPv6（RFC 1885）： - タイプ= 2（パケット過大） - コード= 0（断片化に必要） -  ICMP6メッセージの32ビットMTUフィールドの次のホップMTU"
    },
    {
      "indent": 0,
      "text": "6.1.2.1 Propagation of PMTU",
      "section_title": true,
      "ja": "PMTUの6.1.2.1伝播"
    },
    {
      "indent": 3,
      "text": "The amount of information returned with the ICMP PMTU message (IPv4 or IPv6) is limited and this affects what selectors are available for use in further propagating the PMTU information. (See Appendix B for more detailed discussion of this topic.)",
      "ja": "ICMP PMTUメッセージ（IPv4またはIPv6）で返される情報の量が制限され、これはセレクタがさらにPMTU情報の伝播に使用するための使用可能な影響を与えます。 （この話題のより詳細な議論については、付録Bを参照してください。）"
    },
    {
      "indent": 3,
      "text": "o PMTU message with 64 bits of IPsec header -- If the ICMP PMTU message contains only 64 bits of the IPsec header (minimum for IPv4), then a security gateway MUST support the following options on a per SPI/SA basis:",
      "ja": "IPsecヘッダの64ビットのO PMTUメッセージ -  ICMP PMTUメッセージがIPsecヘッダ（IPv4の最小値）の64ビットのみが含まれている場合、セキュリティゲートウェイはあたりSPI / SAに基づいて、次のオプションをサポートしなければなりません。"
    },
    {
      "indent": 8,
      "text": "a. if the originating host can be determined (or the possible\n   sources narrowed down to a manageable number), send the PM\n   information to all the possible originating hosts.\nb. if the originating host cannot be determined, store the PMTU\n   with the SA and wait until the next packet(s) arrive from the\n   originating host for the relevant security association.  If the packet(s) are bigger than the PMTU, drop the packet(s),\n   and compose ICMP PMTU message(s) with the new packet(s) and\n   the updated PMTU, and send the ICMP message(s) about the\n   problem to the originating host. Retain the PMTU information\n   for any message that might arrive subsequently (see Section\n   6.1.2.4, \"PMTU Aging\").",
      "raw": true
    },
    {
      "indent": 3,
      "text": "o PMTU message with >64 bits of IPsec header -- If the ICMP message contains more information from the original packet then there may be enough non-opaque information to immediately determine to which host to propagate the ICMP/PMTU message and to provide that system with the 5 fields (source address, destination address, source port, destination port, transport protocol) needed to determine where to store/update the PMTU. Under such circumstances, a security gateway MUST generate an ICMP PMTU message immediately upon receipt of an ICMP PMTU from further down the path.",
      "ja": "IPsecヘッダの> 64ビットのO PMTUメッセージ -  ICMPメッセージは、元のパケットからのより多くの情報が含まれている場合は直ちにICMP / PMTUメッセージを伝播するため、そのシステムを提供することを目的とするホストに決定するために、十分な不透明の情報があるかもしれません保存する場所を決定するのに必要な5つのフィールド（ソースアドレス、宛先アドレス、送信元ポート、宛先ポート、トランスポートプロトコル）と/ PMTUを更新します。このような状況下では、セキュリティゲートウェイは、さらに経路ダウンからICMP PMTUを受信すると直ちにICMP PMTUメッセージを生成しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Distributing the PMTU to the Transport Layer -- The host mechanism for getting the updated PMTU to the transport layer is unchanged, as specified in RFC 1191 (Path MTU Discovery).",
      "ja": "トランスポート層にPMTUを配布○ -  RFC 1191（経路MTU探索）で指定されたトランスポート層に更新PMTUを取得するためのホスト・メカニズム、変更されません。"
    },
    {
      "indent": 0,
      "text": "6.1.2.2 Calculation of PMTU",
      "section_title": true,
      "ja": "PMTUの6.1.2.2計算"
    },
    {
      "indent": 3,
      "text": "The calculation of PMTU from an ICMP PMTU MUST take into account the addition of any IPsec header -- AH transport, ESP transport, AH/ESP transport, ESP tunnel, AH tunnel. (See Appendix B for discussion of implementation issues.)",
      "ja": "AHトランスポート、ESP輸送、AH / ESPトランスポート、ESPトンネル、AHトンネル -  ICMP PMTUからPMTUの計算を考慮に任意のIPsecヘッダの追加を取らなければなりません。 （実装上の問題の議論については、付録Bを参照してください。）"
    },
    {
      "indent": 3,
      "text": "Note: In some situations the addition of IPsec headers could result in an effective PMTU (as seen by the host or application) that is unacceptably small. To avoid this problem, the implementation may establish a threshold below which it will not report a reduced PMTU. In such cases, the implementation would apply IPsec and then fragment the resulting packet according to the PMTU. This would result in a more efficient use of the available bandwidth.",
      "ja": "注：いくつかの状況でのIPsecヘッダの付加は許容できないほど小さい（ホストまたはアプリケーションによって見られるように）有効なPMTUが生じる可能性があります。この問題を回避するために、実装はそれが減少PMTUを報告しませんそれより下のしきい値を設定することができます。そのような場合、実装は、IPsecを適用すると、その後PMTUに従って得られたパケットを断片化します。これは、利用可能な帯域幅をより効率的に使用してしまいます。"
    },
    {
      "indent": 0,
      "text": "6.1.2.3 Granularity of PMTU Processing",
      "section_title": true,
      "ja": "PMTU処理の6.1.2.3粒度"
    },
    {
      "indent": 3,
      "text": "In hosts, the granularity with which ICMP PMTU processing can be done differs depending on the implementation situation. Looking at a host, there are 3 situations that are of interest with respect to PMTU issues (See Appendix B for additional details on this topic.):",
      "ja": "宿主において、粒度はれるICMP PMTU処理は、実装状況によって異なる行うことができます。ホストを見ると、PMTU問題に関して興味のある3つの状況があります（このトピックの詳細については、付録Bを参照してください。）："
    },
    {
      "indent": 8,
      "text": "a. Integration of IPsec into the native IP implementation\nb. Bump-in-the-stack implementations, where IPsec is implemented\n   \"underneath\" an existing implementation of a TCP/IP protocol\n   stack, between the native IP and the local network drivers",
      "raw": true
    },
    {
      "indent": 8,
      "text": "c. No IPsec implementation -- This case is included because it is relevant in cases where a security gateway is sending PMTU information back to a host.",
      "ja": "C。 IPsec実装なしません - それは、セキュリティゲートウェイがホストに戻すPMTU情報を送信している場合に該当するので、この場合は含まれています。"
    },
    {
      "indent": 3,
      "text": "Only in case (a) can the PMTU data be maintained at the same granularity as communication associations. In (b) and (c), the IP layer will only be able to maintain PMTU data at the granularity of source and destination IP addresses (and optionally TOS), as described in RFC 1191. This is an important difference, because more than one communication association may map to the same source and destination IP addresses, and each communication association may have a different amount of IPsec header overhead (e.g., due to use of different transforms or different algorithms).",
      "ja": "場合にのみ（A）PMTUデータは通信アソシエーションと同じ粒度で維持することができます。 RFC 1191に記載されているようにこれは重要な違いである、（b）及び（c）、IP層が唯一のソースおよび宛先IPアドレスの粒度でPMTUデータを維持することができる（および必要に応じてTOS）であろうに、よりため一つの通信協会は、同じ送信元および宛先IPアドレスにマッピングすることができる、及び各通信協会は、（異なる変換または異なるアルゴリズムを使用することにより、例えば、）のIPsecヘッダのオーバーヘッドの異なる量を有していてもよいです。"
    },
    {
      "indent": 3,
      "text": "Implementation of the calculation of PMTU and support for PMTUs at the granularity of individual communication associations is a local matter. However, a socket-based implementation of IPsec in a host SHOULD maintain the information on a per socket basis. Bump in the stack systems MUST pass an ICMP PMTU to the host IP implementation, after adjusting it for any IPsec header overhead added by these systems. The calculation of the overhead SHOULD be determined by analysis of the SPI and any other selector information present in a returned ICMP PMTU message.",
      "ja": "PMTUの計算と個別通信協会の粒度でPMTUsのサポートの実装はローカルの問題です。ただし、ホストのIPsecのソケットベースの実装は、ソケット単位で情報を維持する必要があります。スタックシステムにバンプこれらのシステムによって追加された任意のIPsecヘッダのオーバーヘッドのためにそれを調整した後、ホストIP実装にICMP PMTUを通過しなければなりません。オーバーヘッドの計算は、SPIの分析と戻さICMP PMTUメッセージ中に存在する任意の他の選択情報によって決定されるべきです。"
    },
    {
      "indent": 0,
      "text": "6.1.2.4 PMTU Aging",
      "section_title": true,
      "ja": "6.1.2.4 PMTUのエージング"
    },
    {
      "indent": 3,
      "text": "In all systems (host or gateway) implementing IPsec and maintaining PMTU information, the PMTU associated with a security association (transport or tunnel) MUST be \"aged\" and some mechanism put in place for updating the PMTU in a timely manner, especially for discovering if the PMTU is smaller than it needs to be. A given PMTU has to remain in place long enough for a packet to get from the source end of the security association to the system at the other end of the security association and propagate back an ICMP error message if the current PMTU is too big. Note that if there are nested tunnels, multiple packets and round trip times might be required to get an ICMP message back to an encapsulator or originating host.",
      "ja": "特に発見するため、すべてのシステム（ホストまたはゲートウェイ）IPsecを実装し、PMTU情報を維持することで、セキュリティアソシエーション（トランスポートまたはトンネル）に関連PMTUは「熟成」なければならず、適時にPMTUを更新するための場所に置くいくつかの機構PMTUは、それが必要以上に小さい場合。与えられたPMTUは、セキュリティアソシエーションのもう一方の端にシステムにセキュリティアソシエーションのソース端から取得し、現在のPMTUが大きすぎる場合は、ICMPエラーメッセージをバック伝播するパケットのために十分な長さの場所に残ることがあります。ネストされたトンネルが存在する場合、複数のパケットおよび往復時間が戻ってカプセル化または元ホストにICMPメッセージを取得するために必要とされるかもしれないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Systems SHOULD use the approach described in the Path MTU Discovery document (RFC 1191, Section 6.3), which suggests periodically resetting the PMTU to the first-hop data-link MTU and then letting the normal PMTU Discovery processes update the PMTU as necessary. The period SHOULD be configurable.",
      "ja": "システムは、定期的に最初のホップデータリンクMTUにPMTUをリセットした後、通常のPMTU探索が更新を必要に応じてPMTUを処理させることを示唆しているパスMTU探索文書（RFC 1191、セクション6.3）に記載の手法を使用すべきです。期間は設定可能であるべきです。"
    },
    {
      "indent": 0,
      "text": "7. Auditing",
      "section_title": true,
      "ja": "7.監査"
    },
    {
      "indent": 3,
      "text": "Not all systems that implement IPsec will implement auditing. For the most part, the granularity of auditing is a local matter. However, several auditable events are identified in the AH and ESP specifications and for each of these events a minimum set of information that SHOULD be included in an audit log is defined. Additional information also MAY be included in the audit log for each of these events, and additional events, not explicitly called out in this specification, also MAY result in audit log entries. There is no requirement for the receiver to transmit any message to the purported transmitter in response to the detection of an auditable event, because of the potential to induce denial of service via such action.",
      "ja": "ないIPsecを実装するすべてのシステムが監査機能を実装します。ほとんどの部分については、監査の粒度は、ローカルの問題です。しかし、いくつかの監査可能イベントは、AHとESPの仕様および監査ログに含まれるべき情報の最小セットが定義されているこれらのイベントのそれぞれに対して識別されます。追加情報は、また、これらのイベント、および追加のイベントごとに、監査ログに含まれるかもしれ、明示的にも監査ログエントリになることがあり、この仕様で呼び出しません。受信機があるため、このような作用を介してサービス拒否攻撃を誘発する可能性を、監査可能なイベントの検出に応答して主張送信機へのメッセージを送信するための要件はありません。"
    },
    {
      "indent": 0,
      "text": "8. Use in Systems Supporting Information Flow Security",
      "section_title": true,
      "ja": "インフォメーションフローセキュリティをサポートしているシステムで8."
    },
    {
      "indent": 3,
      "text": "Information of various sensitivity levels may be carried over a single network. Information labels (e.g., Unclassified, Company Proprietary, Secret) [DoD85, DoD87] are often employed to distinguish such information. The use of labels facilitates segregation of information, in support of information flow security models, e.g., the Bell-LaPadula model [BL73]. Such models, and corresponding supporting technology, are designed to prevent the unauthorized flow of sensitive information, even in the face of Trojan Horse attacks. Conventional, discretionary access control (DAC) mechanisms, e.g., based on access control lists, generally are not sufficient to support such policies, and thus facilities such as the SPD do not suffice in such environments.",
      "ja": "さまざまな感度レベルの情報は、単一のネットワーク上で実行されてもよいです。情報ラベル（例えば、未分類、企業独自の、秘密）DoD85、DoD87]は、多くの場合、そのような情報を区別するために使用されます。ラベルの使用は、情報をサポートするセキュリティモデル、例えば、ベルLaPadulaモデル[BL73]を流れ、情報の分離を容易にします。このようなモデル、および対応する支援技術は、さえトロイの木馬攻撃に直面して、機密情報の不正流通を防止するために設計されています。 、アクセス制御リストに基づいて、例えば、従来の、随意アクセス制御（DAC）のメカニズムは、一般的にそのようなポリシーをサポートするのに十分ではないので、そのようなSPDなどの施設は、そのような環境では十分でありません。"
    },
    {
      "indent": 3,
      "text": "In the military context, technology that supports such models is often referred to as multi-level security (MLS). Computers and networks often are designated \"multi-level secure\" if they support the separation of labelled data in conjunction with information flow security policies. Although such technology is more broadly applicable than just military applications, this document uses the acronym \"MLS\" to designate the technology, consistent with much extant literature.",
      "ja": "軍事的文脈では、このようなモデルをサポートしています技術は、多くの場合、マルチレベルセキュリティ（MLS）と呼ばれています。彼らは情報フローセキュリティポリシーと併せてラベル付きデータの分離をサポートしている場合、コンピュータやネットワークは、多くの場合、「マルチレベルのセキュア」に指定されています。このような技術は、単なる軍事用途よりも、より広く適用可能であるが、本書は多くの現存する文献と一致技術を、指定する「MLS」の頭文字を使用しています。"
    },
    {
      "indent": 3,
      "text": "IPsec mechanisms can easily support MLS networking. MLS networking requires the use of strong Mandatory Access Controls (MAC), which unprivileged users or unprivileged processes are incapable of controlling or violating. This section pertains only to the use of these IP security mechanisms in MLS (information flow security policy) environments. Nothing in this section applies to systems not claiming to provide MLS.",
      "ja": "IPsecのメカニズムを簡単にMLSネットワーキングをサポートすることができます。 MLSネットワークは非特権ユーザまたは非特権プロセスが制御又は違反することができない強力な強制アクセス制御（MAC）の使用を必要とします。このセクションでは、唯一のMLS（情報フローセキュリティポリシー）環境におけるこれらのIPセキュリティメカニズムの使用に関する。このセクションで何もMLSを提供すると主張しませシステムに適用されません。"
    },
    {
      "indent": 3,
      "text": "As used in this section, \"sensitivity information\" might include implementation-defined hierarchic levels, categories, and/or releasability information.",
      "ja": "このセクションで使用されるように、「感度情報が」実装定義階層レベル、カテゴリ、及び/又は離型情報を含むかもしれません。"
    },
    {
      "indent": 3,
      "text": "AH can be used to provide strong authentication in support of mandatory access control decisions in MLS environments. If explicit IP sensitivity information (e.g., IPSO [Ken91]) is used and confidentiality is not considered necessary within the particular operational environment, AH can be used to authenticate the binding between sensitivity labels in the IP header and the IP payload (including user data). This is a significant improvement over labeled IPv4 networks where the sensitivity information is trusted even though there is no authentication or cryptographic binding of the information to the IP header and user data. IPv4 networks might or might not use explicit labelling. IPv6 will normally use implicit sensitivity information that is part of the IPsec Security Association but not transmitted with each packet instead of using explicit sensitivity information. All explicit IP sensitivity information MUST be authenticated using either ESP, AH, or both.",
      "ja": "AH MLS環境における強制アクセス制御の決定を支援する強力な認証を提供するために使用することができます。明示的なIP感度情報（例えば、IPSO [Ken91]）が使用され、機密性は、特定の動作環境内で必要であると考えていない、AHは、IPヘッダとIPペイロードに感度ラベルとの間の結合を認証するために使用することができる場合（ユーザデータを含みます）。これは感度情報は、IPヘッダとユーザデータへの情報のない認証または暗号の結合が存在しなくても信頼されている標識されたIPv4ネットワーク上有意な改善です。 IPv4ネットワークは、または明示的なラベルを使用しない場合があります。 IPv6は、通常のIPsecセキュリティアソシエーションの一部ではなく、明示的な感性情報を利用して、各パケットを送信していない暗黙の感度情報を使用します。すべての明示的なIP感度情報は、ESP、AH、あるいはその両方を使用して認証されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Encryption is useful and can be desirable even when all of the hosts are within a protected environment, for example, behind a firewall or disjoint from any external connectivity. ESP can be used, in conjunction with appropriate key management and encryption algorithms, in support of both DAC and MAC. (The choice of encryption and authentication algorithms, and the assurance level of an IPsec implementation will determine the environments in which an implementation may be deemed sufficient to satisfy MLS requirements.) Key management can make use of sensitivity information to provide MAC. IPsec implementations on systems claiming to provide MLS SHOULD be capable of using IPsec to provide MAC for IP-based communications.",
      "ja": "暗号化は有用であり、すべてのホストが保護された環境の中で、例えば、任意の外部の接続からのファイアウォールまたはばらばらの背後にある場合でも、望ましい可能性があります。 ESPは、DACとMACの両方をサポートするために、適切な鍵管理および暗号化アルゴリズムと組み合わせて、使用することができます。 （暗号化および認証アルゴリズムの選択、および実装は、MLSの要件を満たすのに十分と考え可能な環境を決定するIPsec実装の保証レベル。）キー管理は、MACを提供するために感度情報を利用することができます。 MLSを提供すると主張システム上のIPsec実装は、IPベースの通信のためのMACを提供するためにIPsecを使用することができなければなりません。"
    },
    {
      "indent": 0,
      "text": "8.1 Relationship Between Security Associations and Data Sensitivity",
      "section_title": true,
      "ja": "セキュリティアソシエーションとデータ感度と8.1の関係"
    },
    {
      "indent": 3,
      "text": "Both the Encapsulating Security Payload and the Authentication Header can be combined with appropriate Security Association policies to provide multi-level secure networking. In this case each SA (or SA bundle) is normally used for only a single instance of sensitivity information. For example, \"PROPRIETARY - Internet Engineering\" must be associated with a different SA (or SA bundle) from \"PROPRIETARY - Finance\".",
      "ja": "カプセル化セキュリティペイロードおよび認証ヘッダの両方がマルチレベルのセキュアなネットワークを提供するために、適切なセキュリティアソシエーションポリシーと組み合わせることができます。この場合、各SA（またはSAバンドル）は、通常感度情報の単一のインスタンスに使用されます。たとえば、「PROPRIETARY  - インターネットエンジニアリング」「 - 金融専有」とは異なるSA（またはSAバンドル）と関連付けられている必要があります。"
    },
    {
      "indent": 0,
      "text": "8.2 Sensitivity Consistency Checking",
      "section_title": true,
      "ja": "8.2感度整合性チェック"
    },
    {
      "indent": 3,
      "text": "An MLS implementation (both host and router) MAY associate sensitivity information, or a range of sensitivity information with an interface, or a configured IP address with its associated prefix (the latter is sometimes referred to as a logical interface, or an interface alias). If such properties exist, an implementation SHOULD compare the sensitivity information associated with the packet against the sensitivity information associated with the interface or address/prefix from which the packet arrived, or through which the packet will depart. This check will either verify that the sensitivities match, or that the packet's sensitivity falls within the range of the interface or address/prefix.",
      "ja": "MLSの実装（ホストとルーターの両方）は感度情報を関連付ける、またはインタフェース感度情報の範囲、またはそれに関連する接頭辞設定されたIPアドレスは、（後者は時々論理インターフェイス、またはインターフェイスエイリアスと呼ばれます） 。このような特性が存在する場合、実装は、パケットが到着し、またはそこを通ってパケットが出発し、そこからインタフェースまたはアドレス/プレフィックスに関連付けられた感度情報に対するパケットに関連付けられた感度情報を比較すべきです。このチェックは、いずれかの感度が一致していることを確認、またはパケットの感度がインタフェースまたはアドレス/プレフィックスの範囲内になるでしょう。"
    },
    {
      "indent": 3,
      "text": "The checking SHOULD be done on both inbound and outbound processing.",
      "ja": "チェックは、インバウンドとアウトバウンドの両方の処理に行われるべきです。"
    },
    {
      "indent": 0,
      "text": "8.3 Additional MLS Attributes for Security Association Databases",
      "section_title": true,
      "ja": "8.3追加のMLSは、セキュリティアソシエーションデータベースの属性"
    },
    {
      "indent": 3,
      "text": "Section 4.4 discussed two Security Association databases (the Security Policy Database (SPD) and the Security Association Database (SAD)) and the associated policy selectors and SA attributes. MLS networking introduces an additional selector/attribute:",
      "ja": "4.4節では、2つのセキュリティアソシエーションデータベース（セキュリティポリシーデータベース（SPD）とセキュリティアソシエーションデータベース（SAD））とSA属性に関連するポリシーセレクタとを議論しました。 MLSネットワーキングでは、追加のセレクタ/属性を導入しています。"
    },
    {
      "indent": 11,
      "text": "- Sensitivity information.",
      "ja": " - 感度情報。"
    },
    {
      "indent": 3,
      "text": "The Sensitivity information aids in selecting the appropriate algorithms and key strength, so that the traffic gets a level of protection appropriate to its importance or sensitivity as described in section 8.1. The exact syntax of the sensitivity information is implementation defined.",
      "ja": "セクション8.1で説明したように、トラフィックは、その重要性又は感度に適切な保護のレベルを取得するように感度情報は、適切なアルゴリズム及び鍵強度を選択するのに役立ちます。感度情報の正確な構文は、実装が定義されています。"
    },
    {
      "indent": 0,
      "text": "8.4 Additional Inbound Processing Steps for MLS Networking",
      "section_title": true,
      "ja": "8.4 MLSネットワーキング用の追加インバウンド処理ステップ"
    },
    {
      "indent": 3,
      "text": "After an inbound packet has passed through IPsec processing, an MLS implementation SHOULD first check the packet's sensitivity (as defined by the SA (or SA bundle) used for the packet) with the interface or address/prefix as described in section 8.2 before delivering the datagram to an upper-layer protocol or forwarding it.",
      "ja": "着信パケットがIPsec処理を通過した後に配信する前に、セクション8.2で説明したように、MLS実装は、最初のインターフェイスまたはアドレス/プレフィックスと（パケットのために使用されるSA（またはSAバンドル）によって定義されるような）パケットの感度をチェックしてください上位層プロトコルまたはそれを転送するデータグラム。"
    },
    {
      "indent": 3,
      "text": "The MLS system MUST retain the binding between the data received in an IPsec protected packet and the sensitivity information in the SA or SAs used for processing, so appropriate policy decisions can be made when delivering the datagram to an application or forwarding engine. The means for maintaining this binding are implementation specific.",
      "ja": "MLSシステムは、アプリケーションにデータグラムを送達またはエンジンを転送する際に適切な政策決定を行うことができ、処理のために使用されるのIPsec保護パケット及びSAまたはSASでの感度情報で受信したデータとの間の結合を保持しなければなりません。この結合を維持するための手段は、実装固有のものです。"
    },
    {
      "indent": 0,
      "text": "8.5 Additional Outbound Processing Steps for MLS Networking",
      "section_title": true,
      "ja": "8.5 MLSネットワーキング用の追加アウトバウンド処理手順"
    },
    {
      "indent": 3,
      "text": "An MLS implementation of IPsec MUST perform two additional checks besides the normal steps detailed in section 5.1.1. When consulting the SPD or the SAD to find an outbound security association, the MLS implementation MUST use the sensitivity of the data to select an appropriate outbound SA or SA bundle. The second check comes before forwarding the packet out to its destination, and is the sensitivity consistency checking described in section 8.2.",
      "ja": "IPsecのMLS実装は、セクション5.1.1で詳述通常の手順以外に二つの追加チェックを実行しなければなりません。アウトバウンドのセキュリティアソシエーションを見つけるために、SPDまたはSADに相談すると、MLSの実装は、適切なアウトバウンドSAまたはSAバンドルを選択するために、データの機密性を使用しなければなりません。第2のチェックは、その先に外にパケットを転送する前に来て、セクション8.2で説明したチェック感度の一貫性です。"
    },
    {
      "indent": 0,
      "text": "8.6 Additional MLS Processing for Security Gateways",
      "section_title": true,
      "ja": "セキュリティゲートウェイの8.6の追加MLS処理"
    },
    {
      "indent": 3,
      "text": "An MLS security gateway MUST follow the previously mentioned inbound and outbound processing rules as well as perform some additional processing specific to the intermediate protection of packets in an MLS environment.",
      "ja": "MLSセキュリティゲートウェイは、前述のインバウンドとアウトバウンドの処理ルールに従うだけでなく、MLS環境におけるパケットの中間の保護に固有の追加処理を実行しなければなりません。"
    },
    {
      "indent": 3,
      "text": "A security gateway MAY act as an outbound proxy, creating SAs for MLS systems that originate packets forwarded by the gateway. These MLS systems may explicitly label the packets to be forwarded, or the whole originating network may have sensitivity characteristics associated with it. The security gateway MUST create and use appropriate SAs for AH, ESP, or both, to protect such traffic it forwards.",
      "ja": "セキュリティゲートウェイは、ゲートウェイによって転送されたパケットを発信MLSシステム用のSAを作成、アウトバウンドプロキシとして作用することができます。これらのMLSシステムは、明示的に転送するパケットにラベルを付けたり、全体発信ネットワークは、それに関連付けられた感度特性を有することができます。セキュリティゲートウェイは、作成して転送し、そのようなトラフィックにそれを保護するために、AH、ESP、または両方のために適切なSAを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Similarly such a gateway SHOULD accept and process inbound AH and/or ESP packets and forward appropriately, using explicit packet labeling, or relying on the sensitivity characteristics of the destination network.",
      "ja": "同様に、このようなゲートウェイは、受け入れ、インバウンドAHおよび/またはESPパケットを処理し、明示的なパケットの標識を使用して、または宛先ネットワークの感度特性に依存して、適切に転送すべきです。"
    },
    {
      "indent": 0,
      "text": "9. Performance Issues",
      "section_title": true,
      "ja": "9.パフォーマンスの問題"
    },
    {
      "indent": 3,
      "text": "The use of IPsec imposes computational performance costs on the hosts or security gateways that implement these protocols. These costs are associated with the memory needed for IPsec code and data structures, and the computation of integrity check values, encryption and decryption, and added per-packet handling. The per-packet computational costs will be manifested by increased latency and, possibly, reduced throughout. Use of SA/key management protocols, especially ones that employ public key cryptography, also adds computational performance costs to use of IPsec. These per-association computational costs will be manifested in terms of increased latency in association establishment. For many hosts, it is anticipated that software-based cryptography will not appreciably reduce throughput, but hardware may be required for security gateways (since they represent aggregation points), and for some hosts.",
      "ja": "IPsecの使用は、これらのプロトコルを実装するホストまたはセキュリティゲートウェイ上の計算性能コストを課します。これらの費用は、暗号化と復号化、IPsecのコードとデータ構造のために必要なメモリ、および整合性チェック値の計算に関連した、およびパケットごとの処理を追加しています。パケット毎の計算コストは​​、おそらく、全体で減少し、待ち時間の増加によって明らかとされます。また、SA /鍵管理プロトコル、公開鍵暗号を採用し、特にもの、の使用は、IPsecの使用に計算性能コストを追加します。これらのあたり会合計算コストは​​、アソシエーションの確立における待ち時間の増加という点で明らかにされます。多くのホストの場合には、ソフトウェアベースの暗号化は、かなりのスループットを低下させないだろうが、（それらが凝集点を表すので）ハードウェアは、セキュリティゲートウェイのために必要となる場合があり、そしていくつかのホストのためと予想されます。"
    },
    {
      "indent": 3,
      "text": "The use of IPsec also imposes bandwidth utilization costs on transmission, switching, and routing components of the Internet infrastructure, components not implementing IPsec. This is due to the increase in the packet size resulting from the addition of AH and/or ESP headers, AH and ESP tunneling (which adds a second IP header), and the increased packet traffic associated with key management protocols. It is anticipated that, in most instances, this increased bandwidth demand will not noticeably affect the Internet infrastructure. However, in some instances, the effects may be significant, e.g., transmission of ESP encrypted traffic over a dialup link that otherwise would have compressed the traffic.",
      "ja": "IPsecのの使用はまた、帯域幅の利用伝送のコスト、スイッチング、およびインターネットインフラストラクチャのルーティングコンポーネントを課しコンポーネントは、IPsecを実装していません。これは、パケットのAHおよび/またはESPヘッダを付加したサイズ、（第2のIPヘッダを付加）AHとESPトンネリング、および鍵管理プロトコルに関連した増加したパケット・トラフィックの増加にあります。ほとんどの場合、この帯域幅の増加の需要が著しくインターネットインフラストラクチャに影響を与えないだろう、と予想されます。しかし、いくつかの例では、影響が大きくなる可能性があり、例えば、ESPの送信は、そうでない場合は、トラフィックを圧縮していたダイヤルアップリンク上のトラフィックを暗号化。"
    },
    {
      "indent": 3,
      "text": "Note: The initial SA establishment overhead will be felt in the first packet. This delay could impact the transport layer and application. For example, it could cause TCP to retransmit the SYN before the ISAKMP exchange is done. The effect of the delay would be different on UDP than TCP because TCP shouldn't transmit anything other than the SYN until the connection is set up whereas UDP will go ahead and transmit data beyond the first packet.",
      "ja": "注意：最初のSA確立のオーバーヘッドは、最初のパケットに感じられるだろう。この遅延は、トランスポート層とアプリケーションに影響を与える可能性があります。例えば、それは、ISAKMP交換が行われる前にTCPがSYNを再送する可能性があります。接続が設定されるまで、TCPがSYN以外のものを送信してはならないので、UDPは、先に行くと、最初のパケットを超えてデータを伝送するのに対し、遅延の影響は、TCPよりもUDP上で異なるだろう。"
    },
    {
      "indent": 3,
      "text": "Note: As discussed earlier, compression can still be employed at layers above IP. There is an IETF working group (IP Payload Compression Protocol (ippcp)) working on \"protocol specifications that make it possible to perform lossless compression on individual payloads before the payload is processed by a protocol that encrypts it. These specifications will allow for compression operations to be performed prior to the encryption of a payload by IPsec protocols.\"",
      "ja": "注意：前述のように、圧縮はまだIP上の層で使用することができます。ペイロードが、それを暗号化プロトコルによって処理される前に、個々のペイロードに可逆圧縮を実行することを可能にするプロトコル仕様」に取り組んでIETFワーキンググループ（IPペイロード圧縮プロトコル（IPPCP））があります。これらの仕様は、圧縮操作が可能になりますIPsecプロトコルによってペイロードの暗号化に先立って行うことができます。」"
    },
    {
      "indent": 0,
      "text": "10. Conformance Requirements",
      "section_title": true,
      "ja": "10.適合性要件"
    },
    {
      "indent": 3,
      "text": "All IPv4 systems that claim to implement IPsec MUST comply with all requirements of the Security Architecture document. All IPv6 systems MUST comply with all requirements of the Security Architecture document.",
      "ja": "IPsecは、セキュリティアーキテクチャ文書のすべての要件を遵守しなければならない実装すると主張するすべてのIPv4システム。すべてのIPv6システムは、セキュリティアーキテクチャ文書のすべての要件を遵守しなければなりません。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The focus of this document is security; hence security considerations permeate this specification.",
      "ja": "この文書の焦点はセキュリティです。したがって、セキュリティ上の考慮事項は、この仕様に浸透します。"
    },
    {
      "indent": 1,
      "text": "12. Differences from",
      "section_title": true,
      "ja": "から12の違い"
    },
    {
      "indent": 3,
      "text": "This architecture document differs substantially from RFC 1825 in detail and in organization, but the fundamental notions are unchanged. This document provides considerable additional detail in terms of compliance specifications. It introduces the SPD and SAD, and the notion of SA selectors. It is aligned with the new versions of AH and ESP, which also differ from their predecessors. Specific requirements for supported combinations of AH and ESP are newly added, as are details of PMTU management.",
      "ja": "このアーキテクチャ文書は詳細にし、組織内のRFC 1825は実質的に異なるが、基本的な概念は変更されません。この文書では、コンプライアンス仕様の面でかなりの追加の詳細を提供します。これは、SPDとSAD、およびSAセレクタの概念を導入しています。また、前任者とは異なり、AHとESPの新バージョン、と整列しています。 PMTU管理の詳細がそうであるように、AHとESPのサポートされる組み合わせのための具体的な要件が新たに追加されます。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Many of the concepts embodied in this specification were derived from or influenced by the US Government's SP3 security protocol, ISO/IEC's NLSP, the proposed swIPe security protocol [SDNS, ISO, IB93, IBK93], and the work done for SNMP Security and SNMPv2 Security.",
      "ja": "この仕様書で具体概念の多くが由来または米国政府のSP3セキュリティプロトコル、ISO / IECのNLSP、提案したswIPeセキュリティプロトコル[SDNS、ISO、IB93、IBK93]、およびSNMPセキュリティおよびSNMPv2のために行われた作業に影響を受けましたセキュリティ。"
    },
    {
      "indent": 3,
      "text": "For over 3 years (although it sometimes seems *much* longer), this document has evolved through multiple versions and iterations. During this time, many people have contributed significant ideas and energy to the process and the documents themselves. The authors would like to thank Karen Seo for providing extensive help in the review, editing, background research, and coordination for this version of the specification. The authors would also like to thank the members of the IPsec and IPng working groups, with special mention of the efforts of (in alphabetic order): Steve Bellovin, Steve Deering, James Hughes, Phil Karn, Frank Kastenholz, Perry Metzger, David Mihelcic, Hilarie Orman, Norman Shulman, William Simpson, Harry Varnis, and Nina Yuan.",
      "ja": "3年以上の（それは時々*ずっと*長いようだが）のために、このドキュメントは、複数のバージョンと繰り返しを経て発展してきました。この間、多くの人々は、プロセスやドキュメント自体に重大なアイデアとエネルギーを貢献してきました。著者は、このバージョンの仕様のレビュー、編集、背景調査、およびコーディネートに大規模な支援を提供するためのカレンソに感謝したいと思います。著者らはまた、（アルファベット順）の努力の特別な言及で、IPsecとのIPngワーキンググループのメンバーに感謝したいと思います：スティーブBellovin氏、スティーブデアリング、ジェームズ・ヒューズ、フィル・カーン、フランクKastenholzと、ペリーメッツガー、デビッドMihelcic 、ヒラリーオーマン、ノーマン・シュルマン、ウィリアム・シンプソン、ハリーVarnis、そしてニーナ元。"
    },
    {
      "indent": 0,
      "text": "Appendix A -- Glossary",
      "ja": "付録A  - 用語集"
    },
    {
      "indent": 3,
      "text": "This section provides definitions for several key terms that are employed in this document. Other documents provide additional definitions and background information relevant to this technology, e.g., [VK83, HA94]. Included in this glossary are generic security service and security mechanism terms, plus IPsec-specific terms.",
      "ja": "このセクションでは、この文書で使用されているいくつかの重要な用語の定義を提供します。他の文書は、[VK83、HA94]、例えば、この技術に関連する追加の定義と背景情報を提供しています。一般的なセキュリティサービスとセキュリティメカニズムに関して、プラスのIPsec特有の用語は、この用語集に含まれます。"
    },
    {
      "indent": 5,
      "text": "Access Control Access control is a security service that prevents unauthorized use of a resource, including the prevention of use of a resource in an unauthorized manner. In the IPsec context, the resource to which access is being controlled is often: o for a host, computing cycles or data o for a security gateway, a network behind the gateway or bandwidth on that network.",
      "ja": "アクセス制御アクセス制御は、不正な方法でリソースの使用の防止を含むリソースの不正使用を防ぐセキュリティサービスです。 IPsecのコンテキストでは、制御されているアクセスするためのリソースがしばしばある：セキュリティゲートウェイ、そのネットワーク上のゲートウェイまたは帯域幅の背後にあるネットワークのホスト、計算サイクルまたはデータOのためのO。"
    },
    {
      "indent": 5,
      "text": "Anti-replay [See \"Integrity\" below]",
      "ja": "アンチリプレイ[以下の「整合性」を参照してください]"
    },
    {
      "indent": 5,
      "text": "Authentication This term is used informally to refer to the combination of two nominally distinct security services, data origin authentication and connectionless integrity. See the definitions below for each of these services.",
      "ja": "認証は、この用語は、二つの名目上の個別のセキュリティサービス、データ発信元認証とコネクションレスインテグリティの組み合わせを参照するために非公式に使用されています。これらの各サービスについて、以下の定義を参照してください。"
    },
    {
      "indent": 5,
      "text": "Availability Availability, when viewed as a security service, addresses the security concerns engendered by attacks against networks that deny or degrade service. For example, in the IPsec context, the use of anti-replay mechanisms in AH and ESP support availability.",
      "ja": "可用性可用性は、セキュリティサービスとして見た場合、拒否またはサービスを低下させるネットワークに対する攻撃によって生じるセキュリティ上の懸念に対処しています。例えば、IPsecのコンテキストで、AHとESP支持可用性におけるアンチリプレイメカニズムの使用。"
    },
    {
      "indent": 5,
      "text": "Confidentiality Confidentiality is the security service that protects data from unauthorized disclosure. The primary confidentiality concern in most instances is unauthorized disclosure of application level data, but disclosure of the external characteristics of communication also can be a concern in some circumstances. Traffic flow confidentiality is the service that addresses this latter concern by concealing source and destination addresses, message length, or frequency of communication. In the IPsec context, using ESP in tunnel mode, especially at a security gateway, can provide some level of traffic flow confidentiality. (See also traffic analysis, below.)",
      "ja": "機密性機密性は、不正な開示からデータを保護するセキュリティサービスです。ほとんどの場合、一次機密性の懸念は、アプリケーションレベルのデータの不正な開示であるが、通信の外部特性の開示はまた、いくつかの状況において懸念することができます。トラフィックフロー機密性は、送信元および宛先アドレス、メッセージ長、または通信の頻度を隠蔽することにより、この後者の懸念に対処するサービスです。 IPsecのコンテキストにおいて、特にセキュリティゲートウェイにおいて、トンネル・モードでESPを使用して、トラフィックフローの機密性のあるレベルを提供することができます。 （以下、また、トラフィック分析を参照してください。）"
    },
    {
      "indent": 5,
      "text": "Encryption Encryption is a security mechanism used to transform data from an intelligible form (plaintext) into an unintelligible form (ciphertext), to provide confidentiality. The inverse transformation process is designated \"decryption\". Oftimes the term \"encryption\" is used to generically refer to both processes.",
      "ja": "暗号化暗号化は、機密性を提供するために、理解不能な形式（暗号文）にわかりやすい形式（平文）からのデータを変換するために使用されるセキュリティメカニズムです。逆変換プロセスは「解読」に指定されています。一般的に両方のプロセスを参照するために用語「暗号化」が使用されてOftimes。"
    },
    {
      "indent": 5,
      "text": "Data Origin Authentication Data origin authentication is a security service that verifies the identity of the claimed source of data. This service is usually bundled with connectionless integrity service.",
      "ja": "データ発信元認証データ発信元認証はデータの主張ソースの身元を確認するセキュリティサービスです。このサービスは通常、コネクションレスインテグリティサービスにバンドルされています。"
    },
    {
      "indent": 5,
      "text": "Integrity Integrity is a security service that ensures that modifications to data are detectable. Integrity comes in various flavors to match application requirements. IPsec supports two forms of integrity: connectionless and a form of partial sequence integrity. Connectionless integrity is a service that detects modification of an individual IP datagram, without regard to the ordering of the datagram in a stream of traffic. The form of partial sequence integrity offered in IPsec is referred to as anti-replay integrity, and it detects arrival of duplicate IP datagrams (within a constrained window). This is in contrast to connection-oriented integrity, which imposes more stringent sequencing requirements on traffic, e.g., to be able to detect lost or re-ordered messages. Although authentication and integrity services often are cited separately, in practice they are intimately connected and almost always offered in tandem.",
      "ja": "整合性の整合性は、データへの変更が検出可能であることを保証するセキュリティサービスです。整合性は、アプリケーションの要件に合わせて、様々な種類があります。コネクションレスおよび部分配列の整合性の形式：IPsecは整合性の二つの形式をサポートしています。コネクションレスの整合性は、トラフィックのストリームにおけるデータグラムの順序に関係なく、個々のIPデータグラムの変更を検出するサービスです。 IPsecの中で提供される部分配列の完全性の形態は、アンチリプレイ完全性と呼ばれ、それは（制約ウィンドウ内で）重複したIPデータグラムの到着を検出します。これは、紛失または再注文したメッセージを検出できるようにするには、例えば、トラフィックのより厳しいシーケンス要件を課し接続指向の整合性とは対照的です。認証と完全性サービスは、多くの場合、個別に引用されていますが、実際に彼らが密接に接続されており、ほとんど常にタンデムで提供されます。"
    },
    {
      "indent": 5,
      "text": "Security Association (SA) A simplex (uni-directional) logical connection, created for security purposes. All traffic traversing an SA is provided the same security processing. In IPsec, an SA is an internet layer abstraction implemented through the use of AH or ESP.",
      "ja": "セキュリティアソシエーション（SA）セキュリティ目的のために作成されたシンプレックス（単方向）論理接続、。 SAを通過するすべてのトラフィックは同じセキュリティ処理を提供します。 IPsecのでは、SAはAHまたはESPを使用して実装され、インターネット層の抽象化です。"
    },
    {
      "indent": 5,
      "text": "Security Gateway A security gateway is an intermediate system that acts as the communications interface between two networks. The set of hosts (and networks) on the external side of the security gateway is viewed as untrusted (or less trusted), while the networks and hosts and on the internal side are viewed as trusted (or more trusted). The internal subnets and hosts served by a security gateway are presumed to be trusted by virtue of sharing a common, local, security administration. (See \"Trusted Subnetwork\" below.) In the IPsec context, a security gateway is a point at which AH and/or ESP is implemented in order to serve a set of internal hosts, providing security services for these hosts when they communicate with external hosts also employing IPsec (either directly or via another security gateway).",
      "ja": "セキュリティゲートウェイは、セキュリティゲートウェイは、2つのネットワーク間の通信インターフェースとして機能する中間システムです。ネットワークとホストと内部側が信頼できる（以上信頼できる）として見ている間、セキュリティゲートウェイの外側のホスト（及びネットワーク）の集合は、信頼できない（以下信頼）と見なされます。セキュリティゲートウェイによってサービス内部サブネットとホストは、共通の、局所、セキュリティ管理を共有によって信頼されると推定されます。 （以下「信頼サブネットワーク」を参照。）のIPsec文脈では、セキュリティゲートウェイがポイントされたAHおよび/またはESPは、それらが、外部と通信するときに、これらのホストのセキュリティサービスを提供し、内部ホストのセットを提供するために実装されていますホストはまた、IPsecを（直接または別のセキュリティゲートウェイを介して）使用します。"
    },
    {
      "indent": 5,
      "text": "SPI Acronym for \"Security Parameters Index\". The combination of a destination address, a security protocol, and an SPI uniquely identifies a security association (SA, see above). The SPI is carried in AH and ESP protocols to enable the receiving system to select the SA under which a received packet will be processed. An SPI has only local significance, as defined by the creator of the SA (usually the receiver of the packet carrying the SPI); thus an SPI is generally viewed as an opaque bit string. However, the creator of an SA may choose to interpret the bits in an SPI to facilitate local processing.",
      "ja": "「セキュリティパラメータインデックス」のためのSPIの頭字語。送信先アドレスの組み合わせ、セキュリティプロトコル、およびSPI一意のセキュリティアソシエーション（SA、上記を参照）を識別する。 SPIは、受信したパケットが処理されるの下でSAを選択するために受信システムを可能にするために、AHとESPプロトコルで運ばれます。 SA（SPIを運ぶパケットの通常の受信機）の作成者によって定義されたSPIは、ローカルな意味を有します。このようにSPIは、一般的に不透明なビット列と見なされます。しかし、SAの作成者は、ローカル処理を容易にするために、SPIのビットを解釈することを選択することができます。"
    },
    {
      "indent": 5,
      "text": "Traffic Analysis The analysis of network traffic flow for the purpose of deducing information that is useful to an adversary. Examples of such information are frequency of transmission, the identities of the conversing parties, sizes of packets, flow identifiers, etc. [Section 8.6\">Sch94]",
      "ja": "トラフィック分析敵にとって有用な情報を推定するためのネットワークのトラフィックフローの分析。そのような情報の例としては、等送信の周波数、会話の当事者のアイデンティティ、パケットのサイズ、フロー識別子である[セクション8.6\" > Sch94]"
    },
    {
      "indent": 5,
      "text": "Trusted Subnetwork A subnetwork containing hosts and routers that trust each other not to engage in active or passive attacks. There also is an assumption that the underlying communications channel (e.g., a LAN or CAN) isn't being attacked by other means.",
      "ja": "信頼されたサブネットワーク能動的または受動的な攻撃に関与しないように相互に信頼ホストおよびルータを含むサブネットワーク。また、基礎となる通信チャネル（例えば、LANまたはCAN）は、他の手段によって攻撃されていないという仮定があります。"
    },
    {
      "indent": 0,
      "text": "Appendix B -- Analysis/Discussion of PMTU/DF/Fragmentation Issues",
      "ja": "付録B  -  PMTU / DF /断片化の問題の分析/ディスカッション"
    },
    {
      "indent": 0,
      "text": "B.1 DF bit",
      "ja": "B.1 DFビット"
    },
    {
      "indent": 3,
      "text": "In cases where a system (host or gateway) adds an encapsulating header (e.g., ESP tunnel), should/must the DF bit in the original packet be copied to the encapsulating header?",
      "ja": "システム（ホストまたはゲートウェイ）がカプセル化ヘッダを付加する場合には（例えば、ESPトンネル）/元のパケット内のDFビットがカプセル化ヘッダにコピーされなければならない必要がありますか？"
    },
    {
      "indent": 3,
      "text": "Fragmenting seems correct for some situations, e.g., it might be appropriate to fragment packets over a network with a very small MTU, e.g., a packet radio network, or a cellular phone hop to mobile node, rather than propagate back a very small PMTU for use over the rest of the path. In other situations, it might be appropriate to set the DF bit in order to get feedback from later routers about PMTU constraints which require fragmentation. The existence of both of these situations argues for enabling a system to decide whether or not to fragment over a particular network \"link\", i.e., for requiring an implementation to be able to copy the DF bit (and to process ICMP PMTU messages), but making it an option to be selected on a per interface basis. In other words, an administrator should be able to configure the router's treatment of the DF bit (set, clear, copy from encapsulated header) for each interface.",
      "ja": "断片化は、いくつかの状況、例えばのために正しいと思われる、それはモバイルノードに、例えば、パケット無線ネットワーク、または携帯電話ホップ非常に小さいMTUを持つネットワーク上のフラグメントパケットに適したものではなく、ために非常に小さなPMTUをバック伝播する可能性がありますパスの残りの部分を使用します。他の状況では、断片化が必要なPMTU制約に関する以降のルータからのフィードバックを得るためにDFビットを設定することが適切であるかもしれません。これらの状況の両方の存在は、特定のネットワーク「リンク」上断片化するかどうかを決定するためにシステムを可能にするための主張、すなわち、実装DFビットをコピーすることができるようにする（およびICMP PMTUメッセージを処理すること）を必要とするため、それインタフェースごとに選択するオプション作ります。換言すれば、管理者は、各インタフェースに対して（セット、クリア、カプセル化されたヘッダからコピー）DFビットのルータの処理を設定することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "Note: If a bump-in-the-stack implementation of IPsec attempts to apply different IPsec algorithms based on source/destination ports, it will be difficult to apply Path MTU adjustments.",
      "ja": "注：のIPsecのバンプ・イン・スタック実装は、ソース/宛先ポートに基づいて、異なるIPsecアルゴリズムを適用しようとする場合は、パスMTU調整を適用することは困難であろう。"
    },
    {
      "indent": 0,
      "text": "B.2 Fragmentation",
      "ja": "B.2の断片化"
    },
    {
      "indent": 3,
      "text": "If required, IP fragmentation occurs after IPsec processing within an IPsec implementation. Thus, transport mode AH or ESP is applied only to whole IP datagrams (not to IP fragments). An IP packet to which AH or ESP has been applied may itself be fragmented by routers en route, and such fragments MUST be reassembled prior to IPsec processing at a receiver. In tunnel mode, AH or ESP is applied to an IP packet, the payload of which may be a fragmented IP packet. For example, a security gateway, \"bump-in-the-stack\" (BITS), or \"bump-in-the-wire\" (BITW) IPsec implementation may apply tunnel mode AH to such fragments. Note that BITS or BITW implementations are examples of where a host IPsec implementation might receive fragments to which tunnel mode is to be applied. However, if transport mode is to be applied, then these implementations MUST reassemble the fragments prior to applying IPsec.",
      "ja": "必要な場合は、IPフラグメンテーションは、IPsec実装内でIPsec処理後に発生します。このように、トランスポートモードAHまたはESPは、（断片をIPにない）IPデータグラム全体に対してのみ適用されます。 AHまたはESPが適用されたIPパケット自体が途中ルータによって断片化することができ、そのようなフラグメントは、受信機でIPsec処理の前に再組み立てしなければなりません。トンネルモードでは、AHまたはESPは、IPパケットに適用され、ペイロードは、その断片化されたIPパケットであってもよいです。例えば、セキュリティゲートウェイ、（BITS）を「インスタックバンプ」、または「バンプ・イン・ザ・ワイヤ」（BITW）IPsec実装は、そのようなフラグメントにトンネルモードAHを適用することができます。 BITSまたはBITW実装がホストIPsec実装は、トンネルモードが適用される断片を受ける可能性がある場合の例であることに留意されたいです。トランスポート・モードが適用される場合は、これらの実装は、IPsecを適用する前にフラグメントを再構築しなければなりません。"
    },
    {
      "indent": 3,
      "text": "NOTE: IPsec always has to figure out what the encapsulating IP header fields are. This is independent of where you insert IPsec and is intrinsic to the definition of IPsec. Therefore any IPsec implementation that is not integrated into an IP implementation must include code to construct the necessary IP headers (e.g., IP2):",
      "ja": "注：IPsecは常にカプセル化IPヘッダフィールドが何であるかを把握する必要があります。これは、IPsecを挿入する場所には依存しないとIPsecの定義に固有​​のものです。したがって、IP実装に統合されていない任意のIPsec実装は、必要なIPヘッダ（例えば、IP2）を構築するためのコードを含める必要があります。"
    },
    {
      "indent": 8,
      "text": "o AH-tunnel --> IP2-AH-IP1-Transport-Data\no ESP-tunnel -->  IP2-ESP_hdr-IP1-Transport-Data-ESP_trailer",
      "raw": true
    },
    {
      "indent": 3,
      "text": "*********************************************************************",
      "ja": "*********************************************************************"
    },
    {
      "indent": 3,
      "text": "Overall, the fragmentation/reassembly approach described above works for all cases examined.",
      "ja": "全体として、上記フラグメンテーション/再アセンブリアプローチを調べ、すべての場合で動作します。"
    },
    {
      "indent": 1,
      "text": "                             AH Xport   AH Tunnel  ESP Xport  ESP Tunnel\nImplementation approach      IPv4 IPv6  IPv4 IPv6  IPv4 IPv6  IPv4 IPv6\n-----------------------      ---- ----  ---- ----  ---- ----  ---- ----\nHosts (integr w/ IP stack)     Y    Y     Y    Y     Y    Y     Y    Y\nHosts (betw/ IP and drivers)   Y    Y     Y    Y     Y    Y     Y    Y\nS. Gwy (integr w/ IP stack)               Y    Y                Y    Y\nOutboard crypto processor *",
      "raw": true
    },
    {
      "indent": 8,
      "text": "* If the crypto processor system has its own IP address, then it\n  is covered by the security gateway case.  This box receives\n  the packet from the host and performs IPsec processing.  It\n  has to be able to handle the same AH, ESP, and related\n  IPv4/IPv6 tunnel processing that a security gateway would have\n  to handle.  If it doesn't have it's own address, then it is\n  similar to the bump-in-the stack implementation between IP and\n  the network drivers.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The following analysis assumes that:",
      "ja": "以下の分析はそれを前提としています。"
    },
    {
      "indent": 8,
      "text": "1. There is only one IPsec module in a given system's stack.\n   There isn't an IPsec module A (adding ESP/encryption and\n   thus) hiding the transport protocol, SRC port, and DEST port\n   from IPsec module B.\n2. There are several places where IPsec could be implemented (as\n   shown in the table above).\n        a. Hosts with integration of IPsec into the native IP\n           implementation.  Implementer has access to the source\n           for the stack.\n        b. Hosts with bump-in-the-stack implementations, where\n           IPsec is implemented between IP and the local network\n           drivers.  Source access for stack is not available;\n           but there are well-defined interfaces that allows the\n           IPsec code to be incorporated into the system.",
      "raw": true
    },
    {
      "indent": 8,
      "text": " c. Security gateways and outboard crypto processors with integration of IPsec into the stack. 3. Not all of the above approaches are feasible in all hosts. But it was assumed that for each approach, there are some hosts for whom the approach is feasible.",
      "ja": "C。スタックへのIPsecの統合とセキュリティゲートウェイとアウトボード暗号プロセッサ。 3.わけではありません上記のアプローチのすべては、すべてのホストで実行可能です。しかし、それは、それぞれのアプローチのために、アプローチが可能である誰のために、いくつかのホストがあると仮定しました。"
    },
    {
      "indent": 3,
      "text": "For each of the above 3 categories, there are IPv4 and IPv6, AH transport and tunnel modes, and ESP transport and tunnel modes -- for a total of 24 cases (3 x 2 x 4).",
      "ja": "24例（3×2×4）の合計 - 上記の3つのカテゴリーの各々について、IPv4およびIPv6、AHトランスポートモードとトンネルモード、およびESPトランスポートモードとトンネルモードがあります。"
    },
    {
      "indent": 3,
      "text": "Some header fields and interface fields are listed here for ease of reference -- they're not in the header order, but instead listed to allow comparison between the columns. (* = not covered by AH authentication. ESP authentication doesn't cover any headers that precede it.)",
      "ja": "彼らは、ヘッダの順序ではないですが、代わりに列間の比較を可能にするために記載されている - いくつかのヘッダーフィールドとインタフェースフィールドは、参照を容易にするためにここに記載されています。 （* = AH認証でカバーされていない。ESP認証は、それに先行する任意のヘッダをカバーしていません。）"
    },
    {
      "indent": 13,
      "text": "                                IP/Transport Interface\nIPv4            IPv6            (RFC 1122 -- Sec 3.4)\n----            ----            ----------------------\nVersion = 4     Version = 6\nHeader Len\n*TOS            Class,Flow Lbl  TOS\nPacket Len      Payload Len     Len\nID                              ID (optional)\n*Flags                          DF\n*Offset\n*TTL            *Hop Limit      TTL\nProtocol        Next Header\n*Checksum\nSrc Address     Src Address     Src Address\nDst Address     Dst Address     Dst Address\nOptions?        Options?        Opt",
      "raw": true
    },
    {
      "indent": 13,
      "text": "? = AH covers Option-Type and Option-Length, but might not cover Option-Data.",
      "ja": "？ = AHはオプション・タイプとオプション長をカバーしていますが、オプション・データをカバーしない場合があります。"
    },
    {
      "indent": 3,
      "text": "The results for each of the 20 cases is shown below (\"works\" = will work if system fragments after outbound IPsec processing, reassembles before inbound IPsec processing). Notes indicate implementation issues.",
      "ja": "20例それぞれの結果は、（アウトバウンドIPsec処理後のシステムフラグメントは、インバウンドIPsec処理の前に再構成した場合、「作品」は=動作する）を以下に示します。ノートには、実装上の問題を示しています。"
    },
    {
      "indent": 4,
      "text": "a. Hosts (integrated into IP stack) o AH-transport --> (IP1-AH-Transport-Data) - IPv4 -- works - IPv6 -- works o AH-tunnel --> (IP2-AH-IP1-Transport-Data) - IPv4 -- works - IPv6 -- works",
      "ja": "A。ホスト（IPスタックに組み込ま）O AH輸送 - >（IP1-AH-トランスポートデータ） - のIPv4  - 動作 -  IPv6を -  AHトンネルoを動作 - >（IP2-AH-IP1-トランスポートデータ） -  IPv4の - 作品 -  IPv6の - 作品"
    },
    {
      "indent": 10,
      "text": "o ESP-transport --> (IP1-ESP_hdr-Transport-Data-ESP_trailer)\n          - IPv4 -- works\n          - IPv6 -- works\no ESP-tunnel -->  (IP2-ESP_hdr-IP1-Transport-Data-ESP_trailer)\n          - IPv4 -- works\n          - IPv6 -- works",
      "raw": true
    },
    {
      "indent": 4,
      "text": "b. Hosts (Bump-in-the-stack) -- put IPsec between IP layer and network drivers. In this case, the IPsec module would have to do something like one of the following for fragmentation and reassembly. - do the fragmentation/reassembly work itself and send/receive the packet directly to/from the network layer. In AH or ESP transport mode, this is fine. In AH or ESP tunnel mode where the tunnel end is at the ultimate destination, this is fine. But in AH or ESP tunnel modes where the tunnel end is different from the ultimate destination and where the source host is multi-homed, this approach could result in sub-optimal routing because the IPsec module may be unable to obtain the information needed (LAN interface and next-hop gateway) to direct the packet to the appropriate network interface. This is not a problem if the interface and next-hop gateway are the same for the ultimate destination and for the tunnel end. But if they are different, then IPsec would need to know the LAN interface and the next-hop gateway for the tunnel end. (Note: The tunnel end (security gateway) is highly likely to be on the regular path to the ultimate destination. But there could also be more than one path to the destination, e.g., the host could be at an organization with 2 firewalls. And the path being used could involve the less commonly chosen firewall.) OR - pass the IPsec'd packet back to the IP layer where an extra IP header would end up being pre-pended and the IPsec module would have to check and let IPsec'd fragments go by. OR - pass the packet contents to the IP layer in a form such that the IP layer recreates an appropriate IP header",
      "ja": "B。ホストは（バンプ・イン・スタック） -  IPレイヤとネットワークドライバ間のIPsecを置きます。この場合、IPsecモジュールは、断片化と再構築のために、次のいずれかのような何かをしなければならないでしょう。 - 断片化/再組み立て作業自体を行うと、直接に/ネットワーク層からのパケットを送信/受信します。 AHまたはESPトランスポートモードでは、これは大丈夫です。トンネルの端部は最終的な宛先であるAHまたはESPトンネルモードでは、これは問題です。しかし、トンネルの端部は最終的な宛先とは異なり、ソースホストがマルチホームであるIPsecモジュールは、必要な情報を得ることができないかもしれないので、このアプローチは、準最適ルーティングをもたらす可能性がAHまたはESPトンネルモードで（LAN適切なネットワークインタフェースにパケットを指示するインターフェイスとネクストホップゲートウェイ）。インターフェイスとネクストホップゲートウェイが最終目的地のためのトンネルエンドで同じである場合、これは問題ではありません。それらが異なる場合でも、その後、IPsecは、LANインターフェイスとトンネルエンドのネクストホップゲートウェイを知っている必要があります。 （注：トンネルエンド（セキュリティゲートウェイ）は、最終的な宛先への定期的なパス上にある可能性が高いしかし、また、例えば、目的地までの複数の経路が存在することができ、ホストは2つのファイアウォールを持つ組織であり得ます。 。そして、パスはあまり一般的に選ばれたファイアウォールを伴う可能性が使用されている）OR  - 余分なIPヘッダは終わるだろうIP層に戻ってIPsec'dパケットを渡す前保留されていると、IPsecモジュールは、IPsecをチェックしてみましょうする必要がありますD」フラグメントはで行きます。 OR  -  IP層が適切なIPヘッダを再現するような形態でIP層にパケットの内容を渡します"
    },
    {
      "indent": 7,
      "text": "At the network layer, the IPsec module will have access to the following selectors from the packet -- SRC address, DST address, Next Protocol, and if there's a transport layer header --> SRC port and DST port. One cannot assume IPsec has access to the Name. It is assumed that the available selector information is sufficient to figure out the relevant Security Policy entry and Security Association(s).",
      "ja": "> SRCポートおよびDSTポート - トランスポート層ヘッダがあるかどうSRCアドレス、DSTアドレス、次プロトコル、および - ネットワーク層では、IPsecモジュールはパケットから次のセレクタにアクセスする必要があります。一つは、IPsecが名前へのアクセス権を持っていると仮定することはできません。利用可能なセレクタ情報は、適切なセキュリティポリシーエントリとセキュリティアソシエーションを理解するのに十分であると仮定されます。"
    },
    {
      "indent": 10,
      "text": "o AH-transport --> (IP1-AH-Transport-Data) - IPv4 -- works - IPv6 -- works o AH-tunnel --> (IP2-AH-IP1-Transport-Data) - IPv4 -- works - IPv6 -- works o ESP-transport --> (IP1-ESP_hdr-Transport-Data-ESP_trailer) - IPv4 -- works - IPv6 -- works o ESP-tunnel --> (IP2-ESP_hdr-IP1-Transport-Data-ESP_trailer) - IPv4 -- works - IPv6 -- works",
      "ja": "AH-輸送O  - >（IP1-AH-トランスポートデータ） - のIPv4  - 動作 -  IPv6を -  AHトンネルoを動作 - >（IP2-AH-IP1-トランスポートデータ） - のIPv4  - 動作 - IPv6  -  ESP-輸送oを動作 - >（IP1-ESP_hdr・トランスポート・データESP_trailer） - のIPv4  - 動作 -  IPv6を -  ESPトンネルoを動作 - >（IP2-ESP_hdr-IP1-トランスポートData-用ESP_trailer） -  IPv4が - 作品 -  IPv6を - 作品"
    },
    {
      "indent": 4,
      "text": "c. Security gateways -- integrate IPsec into the IP stack",
      "ja": "C。セキュリティ・ゲートウェイ -  IPスタックにIPsecを統合"
    },
    {
      "indent": 7,
      "text": "NOTE: The IPsec module will have access to the following selectors from the packet -- SRC address, DST address, Next Protocol, and if there's a transport layer header --> SRC port and DST port. It won't have access to the User ID (only Hosts have access to User ID information.) Unlike some Bump-in-the-stack implementations, security gateways may be able to look up the Source Address in the DNS to provide a System Name, e.g., in situations involving use of dynamically assigned IP addresses in conjunction with dynamically updated DNS entries. It also won't have access to the transport layer information if there is an ESP header, or if it's not the first fragment of a fragmented message. It is assumed that the available selector information is sufficient to figure out the relevant Security Policy entry and Security Association(s).",
      "ja": "NOTE：> SRCポートおよびDSTポート -   - トランスポート層ヘッダがあるかどうSRCアドレス、DSTアドレス、次プロトコル、およびIPsecモジュールはパケットから次のセレクタにアクセスする必要があります。これは、いくつかのバンプ・イン・スタックの実装とは異なり、セキュリティゲートウェイは、システムを提供するために、DNSのソースアドレスを検索することができるかもしれ（ホストのみがユーザID情報へのアクセス権を持っている。）ユーザーIDにアクセスすることができません動的に更新DNSエントリと一緒に動的に割り当てられたIPアドレスの使用を伴う状況では、例えば、名前を付けます。 ESPヘッダが存在する場合、それはまた、トランスポート層の情報へのアクセス権を持っていないか、またはそれは断片化メッセージの最初のフラグメントではない場合。利用可能なセレクタ情報は、適切なセキュリティポリシーエントリとセキュリティアソシエーションを理解するのに十分であると仮定されます。"
    },
    {
      "indent": 10,
      "text": "o AH-tunnel --> (IP2-AH-IP1-Transport-Data) - IPv4 -- works - IPv6 -- works o ESP-tunnel --> (IP2-ESP_hdr-IP1-Transport-Data-ESP_trailer) - IPv4 -- works - IPv6 -- works",
      "ja": "O AHトンネル - >（IP2-AH-IP1-トランスポートデータ） -  IPv4アドレス - 動作 -  IPv6を -  ESPトンネルoを動作 - >（IP2-ESP_hdr-IP1-トランスポートデータESP_trailer） - のIPv4 - 作品 -  IPv6の - 作品"
    },
    {
      "indent": 3,
      "text": "**********************************************************************",
      "ja": "**********************************************************************"
    },
    {
      "indent": 0,
      "text": "B.3 Path MTU Discovery",
      "ja": "B.3パスMTUディスカバリー"
    },
    {
      "indent": 3,
      "text": "As mentioned earlier, \"ICMP PMTU\" refers to an ICMP message used for Path MTU Discovery.",
      "ja": "前述したように、「ICMP PMTUは、」パスMTU発見のために使用されるICMPメッセージを指します。"
    },
    {
      "indent": 3,
      "text": "The legend for the diagrams below in B.3.1 and B.3.3 (but not B.3.2) is:",
      "ja": "B.3.1およびB.3.3（ただしB.3.2）で以下の図の凡例です。"
    },
    {
      "indent": 8,
      "text": "==== = security association (AH or ESP, transport or tunnel)",
      "ja": "==== =セキュリティアソシエーション（AHまたはESP、トランスポートまたはトンネル）"
    },
    {
      "indent": 8,
      "text": "---- = connectivity (or if so labelled, administrative boundary)\n.... = ICMP message (hereafter referred to as ICMP PMTU) for",
      "raw": true
    },
    {
      "indent": 16,
      "text": "IPv4:\n- Type = 3 (Destination Unreachable)\n- Code = 4 (Fragmentation needed and DF set)\n- Next-Hop MTU in the low-order 16 bits of the second\n  word of the ICMP header (labelled unused in RFC 792),\n  with high-order 16 bits set to zero",
      "raw": true
    },
    {
      "indent": 16,
      "text": "IPv6 (RFC 1885): - Type = 2 (Packet Too Big) - Code = 0 (Fragmentation needed and DF set) - Next-Hop MTU in the 32 bit MTU field of the ICMP6",
      "ja": "IPv6（RFC 1885）： - タイプ= 2（パケット過大） - コード= 0（断片化が必要とDFセット） -  ICMP6の32ビットMTUフィールドの次のホップMTU"
    },
    {
      "indent": 8,
      "text": "Hx = host x Rx = router x SGx = security gateway x X* = X supports IPsec",
      "ja": "HX =ホストXのRx =ルータのx SGxの=セキュリティゲートウェイのx X * = Xは、IPsecをサポートしています"
    },
    {
      "indent": 0,
      "text": "B.3.1 Identifying the Originating Host(s)",
      "ja": "元ホスト（複数可）を識別B.3.1"
    },
    {
      "indent": 0,
      "text": "The amount of information returned with the ICMP message is limited and this affects what selectors are available to identify security associations, originating hosts, etc. for use in further propagating the PMTU information.",
      "ja": "ICMPメッセージで返される情報の量が制限され、これはセレクタがさらにPMTU情報を伝播する際に使用するためなど、ホスト発信、セキュリティアソシエーションを識別するために利用可能であるかに影響します。"
    },
    {
      "indent": 0,
      "text": "In brief... An ICMP message must contain the following information from the \"offending\" packet: - IPv4 (RFC 792) -- IP header plus a minimum of 64 bits",
      "ja": "簡単に... ICMPメッセージは「違反」パケットから次の情報を含まなければならない： -  IPv4の（RFC 792） -  IPヘッダーと64ビットの最小値を"
    },
    {
      "indent": 0,
      "text": "Accordingly, in the IPv4 context, an ICMP PMTU may identify only the first (outermost) security association. This is because the ICMP PMTU may contain only 64 bits of the \"offending\" packet beyond the IP header, which would capture only the first SPI from AH or ESP. In the IPv6 context, an ICMP PMTU will probably provide all the SPIs and the selectors in the IP header, but maybe not the SRC/DST ports (in the transport header) or the encapsulated (TCP, UDP, etc.) protocol. Moreover, if ESP is used, the transport ports and protocol selectors may be encrypted.",
      "ja": "したがって、IPv4の文脈において、ICMP PMTUは最初の（最も外側の）セキュリティアソシエーションを識別することができます。 ICMP PMTUは、AHまたはESPからの最初のSPIを取り込むことになるIPヘッダを越えて「違反」パケットのみの64ビットを含む可能性があるためです。 IPv6のコンテキストでは、ICMP PMTUはおそらく、多分すべてのSPIとIPヘッダ内のセレクタはなく、（トランスポートヘッダ内）SRC / DSTポートまたはカプセル化（TCP、UDPなど）プロトコルを提供します。 ESPを使用する場合はさらに、トランスポートポートとプロトコルセレクタは暗号化されてもよいです。"
    },
    {
      "indent": 0,
      "text": "Looking at the diagram below of a security gateway tunnel (as mentioned elsewhere, security gateways do not use transport mode)...",
      "ja": "セキュリティゲートウェイトンネルの下の図を見て（他の場所で述べたように、セキュリティゲートウェイは、トランスポートモードを使用しません）..."
    },
    {
      "indent": 3,
      "text": "  H1   ===================           H3\n    \\  |                 |          /\nH0 -- SG1* ---- R1 ---- SG2* ---- R2 -- H5\n    /  ^        |                   \\\n  H2   |........|                    H4",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Suppose that the security policy for SG1 is to use a single SA to SG2 for all the traffic between hosts H0, H1, and H2 and hosts H3, H4, and H5. And suppose H0 sends a data packet to H5 which causes R1 to send an ICMP PMTU message to SG1. If the PMTU message has only the SPI, SG1 will be able to look up the SA and find the list of possible hosts (H0, H1, H2, wildcard); but SG1 will have no way to figure out that H0 sent the traffic that triggered the ICMP PMTU message.",
      "ja": "SG1のセキュリティポリシーは、ホストH0、H1、およびH2とホストH3、H4、及びH5間のすべてのトラフィックのためにSG2に単一のSAを使用することであると仮定する。そして、H0がSG1にICMP PMTUメッセージを送信するためにR1を引き起こしH5にデータパケットを送信したとします。 PMTUメッセージが唯一のSPIを持っている場合は、SG1はSAを検索し、可能なホスト（H0、H1、H2、ワイルドカード）のリストを見つけることができるようになります。しかし、SG1はH0がICMP PMTUメッセージを引き起こしたトラフィックを送ったことを把握する方法がありませんでしょう。"
    },
    {
      "indent": 6,
      "text": "original        after IPsec     ICMP\npacket          processing      packet\n--------        -----------     ------\n                                IP-3 header (S = R1, D = SG1)\n                                ICMP header (includes PMTU)\n                IP-2 header     IP-2 header (S = SG1, D = SG2)\n                ESP header      minimum of 64 bits of ESP hdr (*)\nIP-1 header     IP-1 header\nTCP header      TCP header\nTCP data        TCP data\n                ESP trailer",
      "raw": true
    },
    {
      "indent": 6,
      "text": "(*) The 64 bits will include enough of the ESP (or AH) header to include the SPI. - ESP -- SPI (32 bits), Seq number (32 bits) - AH -- Next header (8 bits), Payload Len (8 bits), Reserved (16 bits), SPI (32 bits)",
      "ja": "（*）64ビットは、SPIを含むようにESP（またはAH）ヘッダを十分に含まれます。 -  ESP  -  SPI（32ビット）、配列番号（32ビット） -  AH  - 次のヘッダ（8ビ​​ット）、ペイロードレン（8ビット）、リザーブ（16ビット）、SPI（32ビット）"
    },
    {
      "indent": 3,
      "text": "This limitation on the amount of information returned with an ICMP message creates a problem in identifying the originating hosts for the packet (so as to know where to further propagate the ICMP PMTU information). If the ICMP message contains only 64 bits of the IPsec header (minimum for IPv4), then the IPsec selectors (e.g., Source and Destination addresses, Next Protocol, Source and Destination ports, etc.) will have been lost. But the ICMP error message will still provide SG1 with the SPI, the PMTU information and the source and destination gateways for the relevant security association.",
      "ja": "ICMPメッセージで返される情報の量に関するこの制限は、（さらにICMP PMTU情報を伝播する場所を知っているように）パケットの発信元のホストを識別する際に問題が生じます。 ICMPメッセージは、IPsecヘッダのみ64ビット（IPv4の最小値）が含まれている場合、その後のIPsecセレクタ（例えば、発信元および宛先アドレス、次のプロトコル、送信元ポートと宛先ポートなど）が失われているであろう。しかし、ICMPエラーメッセージはまだSPI、PMTU情報と関連するセキュリティアソシエーションの送信元と送信先のゲートウェイとのSG1を提供します。"
    },
    {
      "indent": 3,
      "text": "The destination security gateway and SPI uniquely define a security association which in turn defines a set of possible originating hosts. At this point, SG1 could: a. send the PMTU information to all the possible originating hosts. This would not work well if the host list is a wild card or if many/most of the hosts weren't sending to SG1; but it might work if the SPI/destination/etc mapped to just one or a small number of hosts. b. store the PMTU with the SPI/etc and wait until the next packet(s) arrive from the originating host(s) for the relevant security association. If it/they are bigger than the PMTU, drop the packet(s), and compose ICMP PMTU message(s) with the new packet(s) and the updated PMTU, and send the originating host(s) the ICMP message(s) about the problem. This involves a delay in notifying the originating host(s), but avoids the problems of (a).",
      "ja": "先のセキュリティゲートウェイとSPI一意順に可能発信ホストのセットを定義するセキュリティアソシエーションを定義します。この時点で、可能性SG1：。すべての可能な元のホストにPMTU情報を送信します。ホストリストがワイルドカードである場合、これはうまく機能しないだろうか、多くの場合/ホストのほとんどは、SG1に送信されませんでした。 SPI /宛先/などがちょうど1または少数のホストをマッピングした場合、それはうまくいくかもしれません。 B。 SPI /などでPMTUを保存し、次のパケット（単数または複数）は、関連するセキュリティアソシエーションのために元ホスト（S）から到着するまで待ちます。それは/彼らはPMTUよりも大きいしている場合、（パケット（複数可）をドロップし、新しいパケット（S）と、更新PMTUでICMP PMTUメッセージ（複数可）を構成し、発信元ホスト（S）ICMPメッセージを送る秒）問題について。これは、送信元ホスト（単数または複数）を通知の遅延を含むが、（A）の問題を回避します。"
    },
    {
      "indent": 3,
      "text": "Since only the latter approach is feasible in all instances, a security gateway MUST provide such support, as an option. However, if the ICMP message contains more information from the original packet, then there may be enough information to immediately determine to which host to propagate the ICMP/PMTU message and to provide that system with the 5 fields (source address, destination address, source port, destination port, and transport protocol) needed to determine where to store/update the PMTU. Under such circumstances, a security gateway MUST generate an ICMP PMTU message immediately upon receipt of an ICMP PMTU from further down the path. NOTE: The Next Protocol field may not be contained in the ICMP message and the use of ESP encryption may hide the selector fields that have been encrypted.",
      "ja": "のみ後者のアプローチは、すべてのインスタンスで実行可能であるため、セキュリティゲートウェイは、オプションとして、そのようなサポートを提供しなければなりません。 ICMPメッセージは、元のパケットからのより多くの情報が含まれている場合は、直ちにICMP / PMTUメッセージを伝播し、5つのフィールド（ソースアドレス、宛先アドレス、送信元とそのシステムを提供することを目的とするホストに決定するために十分な情報があるかもしれませんポート、宛先ポート、およびトランスポート・プロトコル）は、/保存PMTUを更新する場所を決定する必要がありました。このような状況下では、セキュリティゲートウェイは、さらに経路ダウンからICMP PMTUを受信すると直ちにICMP PMTUメッセージを生成しなければなりません。注：次のプロトコルフィールドはICMPメッセージに含まれていなくてもよいとESP暗号化を使用すると、暗号化されているセレクタフィールドを隠すことがあります。"
    },
    {
      "indent": 0,
      "text": "B.3.2 Calculation of PMTU",
      "ja": "PMTUのB.3.2計算"
    },
    {
      "indent": 3,
      "text": "The calculation of PMTU from an ICMP PMTU has to take into account the addition of any IPsec header by H1 -- AH and/or ESP transport, or ESP or AH tunnel. Within a single host, multiple applications may share an SPI and nesting of security associations may occur. (See Section 4.5 Basic Combinations of Security Associations for description of the combinations that MUST be supported). The diagram below illustrates an example of security associations between a pair of hosts (as viewed from the perspective of one of the hosts.) (ESPx or AHx = transport mode)",
      "ja": "AHおよび/またはESP輸送、またはESPまたはAHトンネル -  ICMP PMTUからPMTUの計算は、考慮H1によるあらゆるIPsecヘッダの追加を取る必要があります。単一のホスト内で、複数のアプリケーションがSPIを共有してもよいし、セキュリティアソシエーションのネストが発生する可能性があります。 （サポートしなければならない組み合わせの説明については、セキュリティアソシエーションのセクション4.5基本的な組み合わせを参照してください）。 （ホストのいずれかの観点から見て）以下の図は、ホストのペア間のセキュリティアソシエーションの一例を示す図である（ESPxではまたはAHXは、トランスポートモードを=）"
    },
    {
      "indent": 11,
      "text": "Socket 1 -------------------------|\n                                  |\nSocket 2 (ESPx/SPI-A) ---------- AHx (SPI-B) -- Internet",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In order to figure out the PMTU for each socket that maps to SPI-B, it will be necessary to have backpointers from SPI-B to each of the 2 paths that lead to it -- Socket 1 and Socket 2/SPI-A.",
      "ja": "ソケット1およびソケット2 / SPI-A  -  SPI-Bにマップする各ソケットに対するPMTUを把握するために、それにつながる2つのパスのそれぞれにSPI-Bからのバックポインタを有することが必要であろう。"
    },
    {
      "indent": 0,
      "text": "B.3.3 Granularity of Maintaining PMTU Data",
      "ja": "PMTUデータを保持するのB.3.3粒度"
    },
    {
      "indent": 3,
      "text": "In hosts, the granularity with which PMTU ICMP processing can be done differs depending on the implementation situation. Looking at a host, there are three situations that are of interest with respect to PMTU issues:",
      "ja": "宿主において、粒度はれるPMTU ICMP処理は、実装状況によって異なる行うことができます。ホストを見ると、PMTU問題に関して興味のある3つの状況があります。"
    },
    {
      "indent": 3,
      "text": "a. Integration of IPsec into the native IP implementation b. Bump-in-the-stack implementations, where IPsec is implemented \"underneath\" an existing implementation of a TCP/IP protocol stack, between the native IP and the local network drivers c. No IPsec implementation -- This case is included because it is relevant in cases where a security gateway is sending PMTU information back to a host.",
      "ja": "A。ネイティブIP実装へのIPsecの統合。バンプ・イン・スタックIPsecがネイティブIPとローカルネットワークドライバcと、TCP / IPプロトコルスタックの「下に」既存の実装が実現されている実装を、。 IPsec実装なしません - それは、セキュリティゲートウェイがホストに戻すPMTU情報を送信している場合に該当するので、この場合は含まれています。"
    },
    {
      "indent": 3,
      "text": "Only in case (a) can the PMTU data be maintained at the same granularity as communication associations. In the other cases, the IP layer will maintain PMTU data at the granularity of Source and Destination IP addresses (and optionally TOS/Class), as described in RFC 1191. This is an important difference, because more than one communication association may map to the same source and destination IP addresses, and each communication association may have a different amount of IPsec header overhead (e.g., due to use of different transforms or different algorithms). The examples below illustrate this.",
      "ja": "場合にのみ（A）PMTUデータは通信アソシエーションと同じ粒度で維持することができます。 RFC 1191に記載されているように他の場合には、IP層は、複数の通信アソシエーションがにマッピングすることができるので、これは、重要な違いであり、送信元および宛先IPアドレス（および必要に応じてTOS /クラス）の粒度でPMTUデータを維持します同じ送信元および宛先IPアドレス、及び各通信協会は、（異なる変換または異なるアルゴリズムを使用することにより、例えば、）のIPsecヘッダのオーバーヘッドの異なる量を有していてもよいです。以下の例は、これを説明します。"
    },
    {
      "indent": 3,
      "text": "In cases (a) and (b)... Suppose you have the following situation. H1 is sending to H2 and the packet to be sent from R1 to R2 exceeds the PMTU of the network hop between them.",
      "ja": "例では（a）と（b）...あなたは次のような状況があるとします。 H1は、H2に送信され、R1からR2に送信されるパケットは、それらの間のネットワークホップのPMTUを超えます。"
    },
    {
      "indent": 16,
      "text": " ==================================\n |                                |\nH1* --- R1 ----- R2 ---- R3 ---- H2*\n ^       |\n |.......|",
      "raw": true
    },
    {
      "indent": 3,
      "text": "If R1 is configured to not fragment subscriber traffic, then R1 sends an ICMP PMTU message with the appropriate PMTU to H1. H1's processing would vary with the nature of the implementation. In case (a) (native IP), the security services are bound to sockets or the equivalent. Here the IP/IPsec implementation in H1 can store/update the PMTU for the associated socket. In case (b), the IP layer in H1 can store/update the PMTU but only at the granularity of Source and Destination addresses and possibly TOS/Class, as noted above. So the result may be sub-optimal, since the PMTU for a given SRC/DST/TOS/Class will be the subtraction of the largest amount of IPsec header used for any communication association between a given source and destination.",
      "ja": "R1は、加入者トラフィックをフラグメント化しないように構成されている場合、R1はH1に対して適切なPMTUを持つICMP PMTUメッセージを送信します。 H1の処理は、実装の性質によって変化します。 （a）の場合（ネイティブIP）、セキュリティサービスは、ソケットまたは同等にバインドされています。ここでH1におけるIP / IPsec実装は、関連するソケットのPMTUを更新/保存することができます。上述したように、ケース（b）において、H1におけるIP層はPMTUを更新するだけ送信元と宛先のアドレスおよびおそらくTOS /クラスの粒度で/格納することができます。所与のSRC / DST / TOS /クラスのPMTUが所与の送信元と宛先との間の任意の通信アソシエーションのために使用されるIPsecヘッダの最大量の減算であるのでその結果は、準最適であってもよいです。"
    },
    {
      "indent": 3,
      "text": "In case (c), there has to be a security gateway to have any IPsec processing. So suppose you have the following situation. H1 is sending to H2 and the packet to be sent from SG1 to R exceeds the PMTU of the network hop between them.",
      "ja": "ケース（c）において、任意のIPsec処理を持っているセキュリティゲートウェイが存在しなければなりません。ですから、次のような状況があるとします。 H1は、H2に送信され、そしてRにSG1から送信されるパケットは、それらの間のネットワークホップのPMTUを超えます。"
    },
    {
      "indent": 16,
      "text": "         ================\n         |              |\nH1 ---- SG1* --- R --- SG2* ---- H2\n ^       |\n |.......|",
      "raw": true
    },
    {
      "indent": 3,
      "text": "As described above for case (b), the IP layer in H1 can store/update the PMTU but only at the granularity of Source and Destination addresses, and possibly TOS/Class. So the result may be sub-optimal, since the PMTU for a given SRC/DST/TOS/Class will be the subtraction of the largest amount of IPsec header used for any communication association between a given source and destination.",
      "ja": "ケース（B）について上述したように、H1におけるIP層/格納PMTUを更新するだけ送信元および宛先アドレスの粒度で、そしておそらくTOS /クラスことができます。所与のSRC / DST / TOS /クラスのPMTUが所与の送信元と宛先との間の任意の通信アソシエーションのために使用されるIPsecヘッダの最大量の減算であるのでその結果は、準最適であってもよいです。"
    },
    {
      "indent": 0,
      "text": "B.3.4 Per Socket Maintenance of PMTU Data",
      "ja": "PMTUデータのソケットメンテナンスパーB.3.4"
    },
    {
      "indent": 3,
      "text": "Implementation of the calculation of PMTU (Section B.3.2) and support for PMTUs at the granularity of individual \"communication associations\" (Section B.3.3) is a local matter. However, a socket-based implementation of IPsec in a host SHOULD maintain the information on a per socket basis. Bump in the stack systems MUST pass an ICMP PMTU to the host IP implementation, after adjusting it for any IPsec header overhead added by these systems. The determination of the overhead SHOULD be determined by analysis of the SPI and any other selector information present in a returned ICMP PMTU message.",
      "ja": "PMTU（セクションB.3.2）の計算と、個々の「通信協会」（セクションB.3.3）の粒度でPMTUsのサポートの実装はローカルの問題です。ただし、ホストのIPsecのソケットベースの実装は、ソケット単位で情報を維持する必要があります。スタックシステムにバンプこれらのシステムによって追加された任意のIPsecヘッダのオーバーヘッドのためにそれを調整した後、ホストIP実装にICMP PMTUを通過しなければなりません。オーバーヘッドの決意は、SPIの分析と戻さICMP PMTUメッセージ中に存在する任意の他の選択情報によって決定されるべきです。"
    },
    {
      "indent": 0,
      "text": "B.3.5 Delivery of PMTU Data to the Transport Layer",
      "ja": "トランスポート層にPMTUデータのB.3.5配信"
    },
    {
      "indent": 3,
      "text": "The host mechanism for getting the updated PMTU to the transport layer is unchanged, as specified in RFC 1191 (Path MTU Discovery).",
      "ja": "RFC 1191（経路MTU探索）で指定されたトランスポート層に更新PMTUを取得するためのホストのメカニズムは、変更されません。"
    },
    {
      "indent": 0,
      "text": "B.3.6 Aging of PMTU Data",
      "ja": "PMTUデータのB.3.6エージング"
    },
    {
      "indent": 3,
      "text": "This topic is covered in Section 6.1.2.4.",
      "ja": "このトピックは、セクション6.1.2.4で覆われています。"
    },
    {
      "indent": 0,
      "text": "Appendix C -- Sequence Space Window Code Example",
      "ja": "付録C  - シーケンススペースウィンドウコードの例"
    },
    {
      "indent": 3,
      "text": "This appendix contains a routine that implements a bitmask check for a 32 packet window. It was provided by James Hughes (jim_hughes@stortek.com) and Harry Varnis (hgv@anubis.network.com) and is intended as an implementation example. Note that this code both checks for a replay and updates the window. Thus the algorithm, as shown, should only be called AFTER the packet has been authenticated. Implementers might wish to consider splitting the code to do the check for replays before computing the ICV. If the packet is not a replay, the code would then compute the ICV, (discard any bad packets), and if the packet is OK, update the window.",
      "ja": "この付録では、32パケットウィンドウのビットマスクチェックを実装ルーチンが含まれています。これは、ジェームス・ヒューズ（jim_hughes@stortek.com）とハリーVarnis（hgv@anubis.network.com）によって提供され、実施例として意図されています。このコードはリプレイをチェックして、ウィンドウを更新し、両方のことに注意してください。パケットが認証された後このようなアルゴリズムは、示されるように、のみ呼び出されるべきです。実装者はICVを計算する前にリプレイのチェックを行うには、コードを分割を検討したいかもしれません。パケットがリプレイされていない場合、コードはICV、（任意の不正なパケットを破棄）を計算します、そしてパケットがOKであれば、ウィンドウを更新します。"
    },
    {
      "indent": 0,
      "text": "#include <stdio.h> #include <stdlib.h> typedef unsigned long u_long;",
      "ja": "書式#include <stdio.hに>する#include <stdlib.h>に含まのtypedef unsigned long型u_longの。"
    },
    {
      "indent": 0,
      "text": "enum {\n    ReplayWindowSize = 32\n};",
      "raw": true
    },
    {
      "indent": 0,
      "text": "u_long bitmap = 0;                 /* session state - must be 32 bits */\nu_long lastSeq = 0;                     /* session state */",
      "raw": true
    },
    {
      "indent": 0,
      "text": "/* Returns 0 if packet disallowed, 1 if packet permitted */\nint ChkReplayWindow(u_long seq);",
      "raw": true
    },
    {
      "indent": 0,
      "text": "int ChkReplayWindow(u_long seq) { u_long diff;",
      "ja": "INT ChkReplayWindow（u_longの配列）{u_longの差分。"
    },
    {
      "indent": 0,
      "text": "    if (seq == 0) return 0;             /* first == 0 or wrapped */\n    if (seq > lastSeq) {                /* new larger sequence number */\n        diff = seq - lastSeq;\n        if (diff < ReplayWindowSize) {  /* In window */\n            bitmap <<= diff;\n            bitmap |= 1;                /* set bit for this packet */\n        } else bitmap = 1;          /* This packet has a \"way larger\" */\n        lastSeq = seq;\n        return 1;                       /* larger is good */\n    }\n    diff = lastSeq - seq;\n    if (diff >= ReplayWindowSize) return 0; /* too old or wrapped */\n    if (bitmap & ((u_long)1 << diff)) return 0; /* already seen */\n    bitmap |= ((u_long)1 << diff);              /* mark as seen */\n    return 1;                           /* out of order but good */\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "char string_buffer[512];",
      "ja": "チャーstring_buffer [512]。"
    },
    {
      "indent": 0,
      "text": "#define STRING_BUFFER_SIZE sizeof(string_buffer)",
      "ja": "#define STRING_BUFFER_SIZEはsizeof（string_buffer）"
    },
    {
      "indent": 0,
      "text": "int main() {\n    int result;\n    u_long last, current, bits;",
      "raw": true
    },
    {
      "indent": 4,
      "text": "printf(\"Input initial state (bits in hex, last msgnum):\\n\");\nif (!fgets(string_buffer, STRING_BUFFER_SIZE, stdin)) exit(0);\nsscanf(string_buffer, \"%lx %lu\", &bits, &last);\nif (last != 0)\nbits |= 1;\nbitmap = bits;\nlastSeq = last;\nprintf(\"bits:%08lx last:%lu\\n\", bitmap, lastSeq);\nprintf(\"Input value to test (current):\\n\");",
      "raw": true
    },
    {
      "indent": 0,
      "text": "    while (1) {\n        if (!fgets(string_buffer, STRING_BUFFER_SIZE, stdin)) break;\n        sscanf(string_buffer, \"%lu\", &current);\n        result = ChkReplayWindow(current);\n        printf(\"%-3s\", result ? \"OK\" : \"BAD\");\n        printf(\" bits:%08lx last:%lu\\n\", bitmap, lastSeq);\n    }\n    return 0;\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Appendix D -- Categorization of ICMP messages",
      "ja": "付録D  -  ICMPメッセージの分類"
    },
    {
      "indent": 0,
      "text": "The tables below characterize ICMP messages as being either host generated, router generated, both, unassigned/unknown. The first set are IPv4. The second set are IPv6.",
      "ja": "以下の表は、いずれかのホスト生成し、両方の、割り当てられていない/不明、生成されたルータであるとしてICMPメッセージを特徴付けます。最初のセットは、IPv4です。第二セットは、IPv6あります。"
    },
    {
      "indent": 32,
      "text": "IPv4",
      "ja": "IPv4の"
    },
    {
      "indent": 0,
      "text": "Type    Name/Codes                                             Reference\n========================================================================\nHOST GENERATED:\n  3     Destination Unreachable\n         2  Protocol Unreachable                               [RFC792]\n         3  Port Unreachable                                   [RFC792]\n         8  Source Host Isolated                               [RFC792]\n        14  Host Precedence Violation                          [RFC1812]\n 10     Router Selection                                       [RFC1256]",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Type    Name/Codes                                             Reference\n========================================================================\nROUTER GENERATED:\n  3     Destination Unreachable\n         0  Net Unreachable                                    [RFC792]\n         4  Fragmentation Needed, Don't Fragment was Set       [RFC792]\n         5  Source Route Failed                                [RFC792]\n         6  Destination Network Unknown                        [RFC792]\n         7  Destination Host Unknown                           [RFC792]\n         9  Comm. w/Dest. Net. is Administratively Prohibited  [RFC792]\n        11  Destination Network Unreachable for Type of Service[RFC792]\n  5     Redirect\n         0  Redirect Datagram for the Network (or subnet)      [RFC792]\n         2  Redirect Datagram for the Type of Service & Network[RFC792]\n  9     Router Advertisement                                   [RFC1256]\n 18     Address Mask Reply                                     [RFC950]",
      "raw": true
    },
    {
      "indent": 0,
      "text": "                                IPv4\nType    Name/Codes                                             Reference\n========================================================================\nBOTH ROUTER AND HOST GENERATED:\n  0     Echo Reply                                             [RFC792]\n  3     Destination Unreachable\n         1  Host Unreachable                                   [RFC792]\n        10  Comm. w/Dest. Host is Administratively Prohibited  [RFC792]\n        12  Destination Host Unreachable for Type of Service   [RFC792]\n        13  Communication Administratively Prohibited          [RFC1812]\n        15  Precedence cutoff in effect                        [RFC1812]\n  4     Source Quench                                          [RFC792]\n  5     Redirect\n         1  Redirect Datagram for the Host                     [RFC792]\n         3  Redirect Datagram for the Type of Service and Host [RFC792]\n  6     Alternate Host Address                                 [JBP]\n  8     Echo                                                   [RFC792]\n 11     Time Exceeded                                          [RFC792]\n 12     Parameter Problem                              [RFC792,RFC1108]\n 13     Timestamp                                              [RFC792]\n 14     Timestamp Reply                                        [RFC792]\n 15     Information Request                                    [RFC792]\n 16     Information Reply                                      [RFC792]\n 17     Address Mask Request                                   [RFC950]\n 30     Traceroute                                             [RFC1393]\n 31     Datagram Conversion Error                              [RFC1475]\n 32     Mobile Host Redirect                                   [Johnson]\n 39     SKIP                                                   [Markson]\n 40     Photuris                                               [Simpson]",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Type    Name/Codes                                             Reference\n========================================================================\nUNASSIGNED TYPE OR UNKNOWN GENERATOR:\n  1     Unassigned                                             [JBP]\n  2     Unassigned                                             [JBP]\n  7     Unassigned                                             [JBP]\n 19     Reserved (for Security)                                [Solo]\n 20-29  Reserved (for Robustness Experiment)                   [ZSu]\n 33     IPv6 Where-Are-You                                     [Simpson]\n 34     IPv6 I-Am-Here                                         [Simpson]\n 35     Mobile Registration Request                            [Simpson]\n 36     Mobile Registration Reply                              [Simpson]\n 37     Domain Name Request                                    [Simpson]\n 38     Domain Name Reply                                      [Simpson]\n 41-255 Reserved                                               [JBP]",
      "raw": true
    },
    {
      "indent": 32,
      "text": "IPv6",
      "ja": "IPv6の"
    },
    {
      "indent": 0,
      "text": "Type    Name/Codes                                             Reference\n========================================================================\nHOST GENERATED:\n  1     Destination Unreachable                                [RFC 1885]\n         4  Port Unreachable",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Type    Name/Codes                                             Reference\n========================================================================\nROUTER GENERATED:\n  1     Destination Unreachable                                [RFC1885]\n         0  No Route to Destination\n         1  Comm. w/Destination is Administratively Prohibited\n         2  Not a Neighbor\n         3  Address Unreachable\n  2     Packet Too Big                                         [RFC1885]\n         0\n  3     Time Exceeded                                          [RFC1885]\n         0  Hop Limit Exceeded in Transit\n         1  Fragment reassembly time exceeded",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Type    Name/Codes                                             Reference\n========================================================================\nBOTH ROUTER AND HOST GENERATED:\n  4     Parameter Problem                                      [RFC1885]\n         0  Erroneous Header Field Encountered\n         1  Unrecognized Next Header Type Encountered\n         2  Unrecognized IPv6 Option Encountered",
      "raw": true
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "リファレンス"
    },
    {
      "indent": 3,
      "text": "[BL73] Bell, D.E. & LaPadula, L.J., \"Secure Computer Systems: Mathematical Foundations and Model\", Technical Report M74- 244, The MITRE Corporation, Bedford, MA, May 1973.",
      "ja": "[BL73]ベル、D.E. ＆LaPadula、L.J.、「コンピュータシステムセキュア：数理基礎とモデル」、技術報告書M74- 244、MITRE社、ベッドフォード、マサチューセッツ州、1973年5月を。"
    },
    {
      "indent": 3,
      "text": "[Bra97] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Level\", BCP 14, RFC 2119, March 1997.",
      "ja": "[Bra97]ブラドナーの、S.、BCP 14、RFC 2119、1997年3月 \"のRFCsにおける使用のためのキーワードは、要求レベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[DoD85] US National Computer Security Center, \"Department of Defense Trusted Computer System Evaluation Criteria\", DoD 5200.28-STD, US Department of Defense, Ft. Meade, MD., December 1985.",
      "ja": "[DoD85】米国国家のコンピュータセキュリティセンターは、米国国防総省5200.28-STD、防衛、フォートの米国務省「国防総省はコンピュータシステム評価基準を信頼できます」。ミード、MD。、1985年12月。"
    },
    {
      "indent": 3,
      "text": "[DoD87] US National Computer Security Center, \"Trusted Network Interpretation of the Trusted Computer System Evaluation Criteria\", NCSC-TG-005, Version 1, US Department of Defense, Ft. Meade, MD., 31 July 1987.",
      "ja": "[DoD87】米国国家のコンピュータセキュリティセンター、「信頼されたコンピュータシステム評価基準の信頼できるネットワーク解釈」、NCSC-TG-005、バージョン1、防衛、フォートの米国務省。ミード、MD。、1987年7月31日。"
    },
    {
      "indent": 3,
      "text": "[HA94] Haller, N., and R. Atkinson, \"On Internet Authentication\", RFC 1704, October 1994.",
      "ja": "\"インターネット認証について\" [HA94]ハラー、N.、およびR.アトキンソン、RFC 1704、1994年10月。"
    },
    {
      "indent": 3,
      "text": "[HC98] Harkins, D., and D. Carrel, \"The Internet Key Exchange (IKE)\", RFC 2409, November 1998.",
      "ja": "[HC98]ハーキンズ、D.、およびD.カレル、 \"インターネットキー交換（IKE）\"、RFC 2409、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[HM97] Harney, H., and C. Muckenhirn, \"Group Key Management Protocol (GKMP) Architecture\", RFC 2094, July 1997.",
      "ja": "[HM97]ハーニー、H.、およびC. Muckenhirn、 \"グループ鍵管理プロトコル（GKMP）アーキテクチャ\"、RFC 2094、1997年7月。"
    },
    {
      "indent": 3,
      "text": "[ISO] ISO/IEC JTC1/SC6, Network Layer Security Protocol, ISO-IEC DIS 11577, International Standards Organisation, Geneva, Switzerland, 29 November 1992.",
      "ja": "[ISO] ISO / IEC JTC1 / SC6、ネットワーク層セキュリティプロトコル、ISO-IEC DIS 11577、国際標準化機構、ジュネーブ、スイス、1992年11月29日。"
    },
    {
      "indent": 3,
      "text": "[IB93] John Ioannidis and Matt Blaze, \"Architecture and Implementation of Network-layer Security Under Unix\", Proceedings of USENIX Security Symposium, Santa Clara, CA, October 1993.",
      "ja": "[IB93]ジョン・P・A・ヨアニディスとマット・ブレイズ、「建築とUnixの下では、ネットワーク・レイヤ・セキュリティの実装」、USENIXセキュリティシンポジウム、カリフォルニア州サンタクララ、1993年10月の議事。"
    },
    {
      "indent": 3,
      "text": "[IBK93] John Ioannidis, Matt Blaze, & Phil Karn, \"swIPe: Network-Layer Security for IP\", presentation at the Spring 1993 IETF Meeting, Columbus, Ohio",
      "ja": "[IBK93]ジョン・P・A・ヨアニディス、マット・ブレイズ、＆フィル・カーン、「たswIPe：IPのネットワーク・レイヤ・セキュリティ」、春1993 IETFミーティング、コロンバス、オハイオ州でのプレゼンテーション"
    },
    {
      "indent": 3,
      "text": "[KA98a] Kent, S., and R. Atkinson, \"IP Authentication Header\", RFC 2402, November 1998.",
      "ja": "[KA98a]ケント、S.、およびR.アトキンソン、 \"IP認証ヘッダー\"、RFC 2402、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[KA98b] Kent, S., and R. Atkinson, \"IP Encapsulating Security Payload (ESP)\", RFC 2406, November 1998.",
      "ja": "[KA98b]ケント、S.、およびR.アトキンソン、 \"IPカプセル化セキュリティペイロード（ESP）\"、RFC 2406、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[Ken91] Kent, S., \"US DoD Security Options for the Internet Protocol\", RFC 1108, November 1991.",
      "ja": "[Ken91]ケント、S.、 \"インターネットプロトコルのための米国国防総省のセキュリティオプション\"、RFC 1108、1991年11月。"
    },
    {
      "indent": 3,
      "text": "[MSST97] Maughan, D., Schertler, M., Schneider, M., and J. Turner, \"Internet Security Association and Key Management Protocol (ISAKMP)\", RFC 2408, November 1998.",
      "ja": "[MSST97]モーガン、D.、Schertler、M.、シュナイダー、M.、およびJ.ターナー、 \"インターネットセキュリティ協会と鍵管理プロトコル（ISAKMP）\"、RFC 2408、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[Orm97] Orman, H., \"The OAKLEY Key Determination Protocol\", RFC 2412, November 1998.",
      "ja": "[Orm97]オーマン、H.、 \"OAKLEYキー決定プロトコル\"、RFC 2412、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[Pip98] Piper, D., \"The Internet IP Security Domain of Interpretation for ISAKMP\", RFC 2407, November 1998.",
      "ja": "[Pip98]パイパー、D.、 \"ISAKMPのための解釈のインターネットIPセキュリティー領域\"、RFC 2407、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[Sch94] Bruce Schneier, Applied Cryptography, Section 8.6, John Wiley & Sons, New York, NY, 1994.",
      "ja": "[Sch94]ブルース・シュナイアー、応用暗号、8.6節、John Wiley＆Sons、ニューヨーク、NY、1994。"
    },
    {
      "indent": 3,
      "text": "[SDNS] SDNS Secure Data Network System, Security Protocol 3, SP3, Document SDN.301, Revision 1.5, 15 May 1989, published in NIST Publication NIST-IR-90-4250, February 1990.",
      "ja": "[SDNS] SDNSは、データネットワークシステム、セキュリティプロトコル3、SP3、NIST公報NIST-IR-90から4250に掲載された文書SDN.301、リビジョン1.5、1989年5月15日、1990年2月を固定します。"
    },
    {
      "indent": 3,
      "text": "[SMPT98] Shacham, A., Monsour, R., Pereira, R., and M. Thomas, \"IP Payload Compression Protocol (IPComp)\", RFC 2393, August 1998.",
      "ja": "[SMPT98] Shacham、A.、Monsour、R.、ペレイラ、R.、およびM.トーマス、 \"IPペイロード圧縮プロトコル（IPCompの）\"、RFC 2393、1998年8月。"
    },
    {
      "indent": 3,
      "text": "[TDG97] Thayer, R., Doraswamy, N., and R. Glenn, \"IP Security Document Roadmap\", RFC 2411, November 1998.",
      "ja": "[TDG97]セイヤー、R.、Doraswamy、N.、およびR.グレン、 \"IPセキュリティドキュメントロードマップ\"、RFC 2411、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[VK83] V.L. Voydock & S.T. Kent, \"Security Mechanisms in High-level Networks\", ACM Computing Surveys, Vol. 15, No. 2, June 1983.",
      "ja": "[VK83] V.L. Voydock＆S。T.ケント、「高レベルのネットワークのセキュリティ機構」、ACMコンピューティング調査、巻。 15、第2号、1983年6月。"
    },
    {
      "indent": 0,
      "text": "Disclaimer",
      "ja": "免責条項"
    },
    {
      "indent": 3,
      "text": "The views and specification expressed in this document are those of the authors and are not necessarily those of their employers. The authors and their employers specifically disclaim responsibility for any problems arising from correct or incorrect implementation or use of this design.",
      "ja": "この文書で見解と仕様は著者のものであり、必ずしもその雇用者のそれではありません。著者およびその雇用者は、具体的に正しいか間違って実装またはこの設計の利用から生じるいかなる問題の責任を負いかねます。"
    },
    {
      "indent": 0,
      "text": "Author Information",
      "ja": "著者の情報"
    },
    {
      "indent": 3,
      "text": "Stephen Kent BBN Corporation 70 Fawcett Street Cambridge, MA 02140 USA",
      "ja": "スティーブン・ケントBBN社70フォーセットストリート、ケンブリッジ、MA 02140 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 (617) 873-3988 EMail: kent@bbn.com",
      "ja": "電話：+1（617）873-3988 Eメール：kent@bbn.com"
    },
    {
      "indent": 3,
      "text": "Randall Atkinson @Home Network 425 Broadway Redwood City, CA 94063 USA",
      "ja": "ランドール・アトキンソン@Homeネットワーク425ブロードウェイレッドウッドシティ、CA 94063 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 (415) 569-5000 EMail: rja@corp.home.net",
      "ja": "電話：+1（415）569-5000 Eメール：rja@corp.home.net"
    },
    {
      "indent": 0,
      "text": "Copyright (C) The Internet Society (1998). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（1998）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    }
  ]
}