{
  "title": {
    "text": "RFC 3335 - MIME-based Secure Peer-to-Peer Business Data Interchange over the Internet",
    "ja": "RFC 3335 - MIMEベースのセキュアピアツーピアビジネスデータは、インターネット上で交換します"
  },
  "number": 3335,
  "created_at": "2023-11-19 17:18:01.254877+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         T. Harding\nRequest for Comments: 3335                              Cyclone Commerce\nCategory: Standards Track                                    R. Drummond\n                                                          Drummond Group\n                                                                 C. Shih\n                                                           Gartner Group\n                                                          September 2002",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": " MIME-based Secure Peer-to-Peer Business Data Interchange over the Internet",
      "ja": "MIMEベースのセキュアピアツーピアビジネスデータは、インターネット上で交換します"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes how to exchange structured business data securely using SMTP transport for Electronic Data Interchange, (EDI - either the American Standards Committee X12 or UN/EDIFACT, Electronic Data Interchange for Administration, Commerce and Transport), XML or other data used for business to business data interchange. The data is packaged using standard MIME content-types. Authentication and privacy are obtained by using Cryptographic Message Syntax (S/MIME) or OpenPGP security body parts. Authenticated acknowledgements make use of multipart/signed replies to the original SMTP message.",
      "ja": "このドキュメントでは、電子データインターチェンジのSMTPトランスポートを使用して構造化されたビジネスデータを安全に交換する方法について説明します（EDI-アメリカ標準委員会X12またはUN/EDIFACTのいずれか、管理、商業、輸送のための電子データ交換）、XMLまたはビジネスに使用されるその他のデータビジネスデータインターチェンジへ。データは、標準のMIMEコンテンツタイプを使用してパッケージ化されています。認証とプライバシーは、暗号化メッセージの構文（S/MIME）またはOpenPGPセキュリティボディパーツを使用して取得されます。認証された謝辞は、元のSMTPメッセージへのMultiPart/署名された返信を使用します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.0   Introduction .................................................3\n2.0   Overview .....................................................4\n2.1   Purpose of a Security Guideline for MIME EDI .................4\n2.2   Definitions ..................................................4\n2.2.1 Terms ........................................................4\n2.2.2 The Secure Transmission Loop .................................5\n2.2.3 Definition of Receipts .......................................5\n2.3   Assumptions ..................................................6\n2.3.1 EDI Process Assumptions ......................................6\n2.3.2 Flexibility Assumptions ......................................7\n3.0   Referenced RFCs and Their Contribution .......................8\n3.1   RFC 821 SMTP [7] .............................................8\n3.2   RFC 822 Text Message Format [3] ..............................8\n3.3   RFC 1847 MIME Security Multiparts [6] ........................8\n3.4   RFC 1892 Multipart/Report [9] ................................8\n3.5   RFC 1767 EDI Content [2] .....................................9\n3.6   RFC 2015, 3156, 2440 PGP/MIME [4] ............................9\n3.7   RFC 2045, 2046, and 2049 MIME [1] ............................9\n3.8   RFC 2298 Message Disposition Notification [5] ................9\n3.9   RFC 2633 and 2630 S/MIME Version 3 Message Specifications [8] 9\n4.0   Structure of an EDI MIME Message - Applicability .............9\n4.1   Introduction .................................................9\n4.2   Structure of an EDI MIME Message - PGP/MIME .................10\n4.2.1 No Encryption, No Signature .................................10\n4.2.2 No Encryption, Signature ....................................10\n4.2.3 Encryption, No Signature ....................................10\n4.2.4 Encryption, Signature .......................................10\n4.3   Structure of an EDI MIME Message - S/MIME ...................10\n4.3.1 No encryption, No Signature..................................10\n4.3.2 No encryption, Signature ....................................10\n4.3.3 Encryption, No Signature ....................................11\n4.3.4 Encryption, Signature .......................................11\n5.0   Receipts ....................................................11\n5.1   Introduction ................................................11\n5.2   Requesting a Signed Receipt .................................13\n5.2.1 Additional Signed Receipt Considerations ....................16\n5.3   Message Disposition Notification Format .....................17\n5.3.1 Message Disposition Notification Extensions .................18\n5.3.2 Disposition Mode, Type, and Modifier Use ....................19\n5.4   Message Disposition Notification Processing .................21\n5.4.1 Large File Processing .......................................21\n5.4.2 Example .....................................................22\n6.0   Public Key Certificate Handling .............................24\n6.1   Near Term Approach ..........................................24\n6.2   Long Term Approach ..........................................24\n7.0   Security Considerations .....................................25\n   8.0   Acknowledgments .............................................26\n9.0   References ..................................................26\nAppendix IANA Registration Form ...................................28\nAuthors' Addresses ................................................28\nFull Copyright Statement ..........................................29",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1.0 Introduction",
      "section_title": true,
      "ja": "1.0 はじめに"
    },
    {
      "indent": 3,
      "text": "Previous work on Internet EDI focused on specifying MIME content types for EDI data ([2] RFC 1767). This document expands on RFC 1767 to specify use of a comprehensive set of data security features, specifically data privacy, data integrity/authenticity, non-repudiation of origin and non-repudiation of receipt. This document also recognizes contemporary RFCs and is attempting to \"re-invent\" as little as possible. While this document focuses specifically on EDI data, any other data type is also supported.",
      "ja": "インターネットEDIに関する以前の研究は、EDIデータのMIMEコンテンツタイプの指定に焦点を当てていました（[2] RFC 1767）。このドキュメントは、RFC 1767で拡張され、データセキュリティ機能の包括的なセット、特にデータのプライバシー、データの整合性/信頼性、原点の非繰り返し、領収書の非和解の使用を指定します。このドキュメントはまた、現代のRFCを認識しており、可能な限り「再発明」しようとしています。このドキュメントは特にEDIデータに焦点を当てていますが、他のデータ型もサポートされています。"
    },
    {
      "indent": 3,
      "text": "With an enhancement in the area of \"receipts\", as described below (5.2), secure Internet MIME based EDI can be accomplished by using and complying with the following RFCs:",
      "ja": "以下（5.2）のように、「領収書」の分野で強化されているため、インターネットMIMEベースの安全なEDIは、次のRFCを使用および準拠することで実現できます。"
    },
    {
      "indent": 6,
      "text": "-RFC 821 SMTP -RFC 822 Text Message Formats -RFC 1767 EDI Content Type -RFC 1847 Security Multiparts for MIME -RFC 1892 Multipart/Report -RFC 2015, 3156, 2440 MIME/PGP",
      "ja": "-RFC 821 SMTP -RFC 822テキストメッセージフォーマット-RFC 1767 EDIコンテンツタイプ-RFC 1847 MIME -RFC 1892 MultiPart/Report -RFC 2015、3156、2440 Mime/Pgpのセキュリティマルチパート"
    },
    {
      "indent": 6,
      "text": "-RFC 2045 to 2049 MIME RFCs -RFC 2298 Message Disposition Notification -RFC 2630, 2633 S/MIME v3 Specification",
      "ja": "-RFC 2045から2049 MIME RFCS -RFC 2298メッセージ処分通知-RFC 2630、2633 S/MIME V3仕様"
    },
    {
      "indent": 3,
      "text": "Our intent here is to define clearly and precisely how these are used together, and what is required by user agents to be compliant with this document.",
      "ja": "ここでの私たちの意図は、これらがどのように使用されるか、そしてユーザーエージェントがこのドキュメントに準拠するために必要なものを明確かつ正確に定義することです。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119.",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「「しない」、「そうでない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、RFC 2119に記載されているとおりに解釈されます。"
    },
    {
      "indent": 0,
      "text": "2.0 Overview",
      "section_title": true,
      "ja": "2.0 概要"
    },
    {
      "indent": 0,
      "text": "2.1 Purpose of a Security Guideline for MIME EDI",
      "section_title": true,
      "ja": "2.1 Mime EDIのセキュリティガイドラインの目的"
    },
    {
      "indent": 3,
      "text": "The purpose of these specifications is to ensure interoperability between EDI user agents, invoking some or all of the commonly expected security features. This document is also NOT limited to strict EDI use, but applies to any electronic commerce application where business data needs to be exchanged over the Internet in a secure manner.",
      "ja": "これらの仕様の目的は、EDIユーザーエージェント間の相互運用性を確保し、一般的に期待されるセキュリティ機能の一部またはすべてを呼び出すことです。このドキュメントは、厳密なEDI使用に限定されませんが、ビジネスデータを安全な方法でインターネットで交換する必要がある電子商取引アプリケーションに適用されます。"
    },
    {
      "indent": 0,
      "text": "2.2 Definitions",
      "section_title": true,
      "ja": "2.2 定義"
    },
    {
      "indent": 0,
      "text": "2.2.1 Terms",
      "section_title": true,
      "ja": "2.2.1 条項"
    },
    {
      "indent": 3,
      "text": "EDI Electronic Data Interchange",
      "ja": "EDI電子データインターチェンジ"
    },
    {
      "indent": 3,
      "text": "EC Electronic Commerce",
      "ja": "ECエレクトロニックコマース"
    },
    {
      "indent": 3,
      "text": "Receipt The functional message that is sent from a receiver to a sender to acknowledge receipt of an EDI/EC interchange.",
      "ja": "受信者から送信者に送信される機能的なメッセージを受領して、EDI/ECインターチェンジの受領を確認します。"
    },
    {
      "indent": 3,
      "text": "Signed Receipt Same as above, but with a digital signature.",
      "ja": "上記と同じ署名領収書ですが、デジタル署名があります。"
    },
    {
      "indent": 3,
      "text": "Message Disposition The Internet messaging format used to Notification convey a receipt. This term is used interchangeably with receipt. A signed MDN is a signed receipt.",
      "ja": "メッセージ処分通知に使用されるインターネットメッセージング形式は領収書を伝えます。この用語は、領収書と同じ意味で使用されます。署名されたMDNは署名された領収書です。"
    },
    {
      "indent": 3,
      "text": "Non-repudiation of NRR is a \"legal event\" that occurs when Receipt (NRR) the original sender of an EDI/EC interchange has verified the signed receipt coming back from the receiver. NRR IS NOT a functional or a technical message.",
      "ja": "NRRの非繰り返しは、領収書（NRR）が領収書（NRR）で発生する「法的イベント」であり、EDI/ECインターチェンジの元の送信者がレシーバーから戻ってくる署名領収書を確認しました。NRRは機能的なメッセージでも技術的なメッセージでもありません。"
    },
    {
      "indent": 3,
      "text": "PGP/MIME Digital envelope security based on the Pretty Good Privacy (PGP) standard (Zimmerman), integrated with MIME Security Multiparts [6].",
      "ja": "PGP/MIMEデジタルエンベロープセキュリティMIMEセキュリティマルチパートと統合された、Pretty Good Privacy（PGP）Standard（Zimmerman）に基づいた[6]。"
    },
    {
      "indent": 3,
      "text": "S/MIME A format and protocol for adding Cryptographic signature and/or encryption services to Internet MIME messages.",
      "ja": "S/MIMEインターネットMIMEメッセージに暗号化署名および/または暗号化サービスを追加するための形式とプロトコル。"
    },
    {
      "indent": 0,
      "text": "2.2.2 The secure transmission loop",
      "section_title": true,
      "ja": "2.2.2 安全な伝送ループ"
    },
    {
      "indent": 3,
      "text": "This document's focus is on the formats and protocols for exchanging EDI content that has had security applied to it using the Internet's messaging environment.",
      "ja": "このドキュメントの焦点は、インターネットのメッセージング環境を使用してセキュリティを適用したEDIコンテンツを交換するための形式とプロトコルにあります。"
    },
    {
      "indent": 3,
      "text": "The \"secure transmission loop\" for EDI involves one organization sending a signed and encrypted EDI interchange to another organization, requesting a signed receipt, followed later by the receiving organization sending this signed receipt back to the sending organization. In other words, the following transpires:",
      "ja": "EDIの「Secure Transmission Loop」には、署名済みおよび暗号化されたEDIインターチェンジを別の組織に送信し、署名付き領収書をリクエストし、その後、この署名済みの領収書を送信組織に送信します。言い換えれば、次のことが延期されます。"
    },
    {
      "indent": 5,
      "text": "-The organization sending EDI/EC data signs and encrypts the data using either PGP/MIME or S/MIME. In addition, the message will request a signed receipt to be returned to the sender of the message.",
      "ja": "-EDI/ECデータサインを送信し、PGP/MIMEまたはS/MIMEのいずれかを使用してデータを暗号化します。さらに、メッセージは、署名入りの領収書を要求して、メッセージの送信者に返送されます。"
    },
    {
      "indent": 5,
      "text": "-The receiving organization decrypts the message and verifies the signature, resulting in verified integrity of the data and authenticity of the sender.",
      "ja": " - 受信組織はメッセージを復号化し、署名を検証し、その結果、データの整合性と送信者の信頼性が確認されます。"
    },
    {
      "indent": 5,
      "text": "-The receiving organization then returns a signed receipt to the sending organization in the form of a message disposition notification message. This signed receipt will contain the hash of the signature from the received message, indicating to the sender that the received message was verified and/or decrypted properly.",
      "ja": " - 受信組織は、メッセージ処分通知メッセージの形で署名された領収書を送信組織に返送します。この署名された領収書には、受信したメッセージからの署名のハッシュが含まれ、受信したメッセージが検証され、/または適切に復号化されたことを送信者に示します。"
    },
    {
      "indent": 3,
      "text": "The above describes functionality which, if implemented, would satisfy all security requirements. This specification, however, leaves full flexibility for users to decide the degree to which they want to deploy those security features with their trading partners.",
      "ja": "上記は、実装された場合、すべてのセキュリティ要件を満たす機能について説明しています。ただし、この仕様により、ユーザーは、これらのセキュリティ機能を取引パートナーに展開したい程度を決定するための完全な柔軟性を残しています。"
    },
    {
      "indent": 0,
      "text": "2.2.3 Definition of receipts",
      "section_title": true,
      "ja": "2.2.3 領収書の定義"
    },
    {
      "indent": 3,
      "text": "The term used for both the functional activity and message for acknowledging receipt of an EDI/EC interchange is receipt, or signed receipt. The first term is used if the acknowledgment is for an interchange resulting in a receipt which is NOT signed. The second term is used if the acknowledgment is for an interchange resulting in a receipt which IS signed. The method used to request a receipt or a signed receipt is defined in RFC 2298, \"An Extensible Message Format for Message Disposition Notifications\".",
      "ja": "EDI/EC Interchangeの受領を確認するための機能的活動とメッセージの両方に使用される用語は、領収書または署名された領収書です。最初の用語は、承認がインターチェンジの場合に使用され、署名されていない領収書になります。2番目の用語は、承認がインターチェンジの場合に使用され、署名された領収書になります。領収書または署名済みの領収書をリクエストするために使用される方法は、RFC 2298「メッセージ処分通知の拡張可能なメッセージ形式」で定義されています。"
    },
    {
      "indent": 3,
      "text": "The \"rule\" is:",
      "ja": "「ルール」は次のとおりです。"
    },
    {
      "indent": 5,
      "text": "- If a receipt is requested, explicitly specifying that the receipt be signed, then the receipt MUST be returned with a signature.",
      "ja": "- 領収書が要求された場合、領収書に署名されることを明示的に指定する場合、領収書は署名で返品する必要があります。"
    },
    {
      "indent": 5,
      "text": "- If a receipt is requested, explicitly specifying that the receipt be signed, but the recipient cannot support the requested protocol format or requested MIC algorithms, then a receipt, either signed or unsigned SHOULD be returned.",
      "ja": "- 領収書が要求された場合、領収書に署名されることを明示的に指定しますが、受信者は要求されたプロトコル形式または要求されたマイクアルゴリズムをサポートできない場合、署名または署名のいずれかの領収書を返品する必要があります。"
    },
    {
      "indent": 5,
      "text": "- If a signature is not explicitly requested, or if the signed receipt request parameter is not recognized by the UA, a receipt may or may not be returned. This behavior is consistent with the MDN RFC 2298.",
      "ja": "- 署名が明示的に要求されていない場合、または署名された領収書リクエストパラメーターがUAによって認識されない場合、領収書が返される場合と返されない場合があります。この動作は、MDN RFC 2298と一致しています。"
    },
    {
      "indent": 3,
      "text": "A term often used in combination with receipts is \"Non-Repudiation of Receipt (NRR). NRR refers to a legal event which occurs only when the original sender of an interchange has verified the signed receipt coming back from recipient of the message. Note that NRR is not possible without signatures.",
      "ja": "領収書と組み合わせてよく使用される用語は「領収書（NRR）の非繰り返しです。NRRは、インターチェンジの元の送信者がメッセージの受信者から戻ってくる署名領収書を確認した場合にのみ発生する法的イベントを指します。注意してください。NRRは署名なしでは不可能です。"
    },
    {
      "indent": 0,
      "text": "2.3 Assumptions",
      "section_title": true,
      "ja": "2.3 仮定"
    },
    {
      "indent": 0,
      "text": "2.3.1 EDI Process Assumptions",
      "section_title": true,
      "ja": "2.3.1 EDIプロセスの仮定"
    },
    {
      "indent": 3,
      "text": "-Encrypted object is an EDI Interchange This specification assumes that a typical EDI interchange is the lowest level object that will be subject to security services.",
      "ja": " - 暗号化されたオブジェクトはEDIインターチェンジです。この仕様は、典型的なEDIインターチェンジがセキュリティサービスの対象となる最も低いレベルのオブジェクトであると想定しています。"
    },
    {
      "indent": 4,
      "text": "In ANSI X12, this means anything between, and including segments ISA and IEA. In EDIFACT, this means anything between, and including, segments UNA/UNB and UNZ. In other words, the EDI interchanges including envelope segments remain intact and unreadable during secure transport.",
      "ja": "ANSI X12では、これはISAとIEAの間にあるものを意味します。edifactでは、これはセグメントUNA/UNBとUNZの間の何でも意味します。言い換えれば、エンベロープセグメントを含むEDIインターチェンジは、安全な輸送中はそのままで読めないままです。"
    },
    {
      "indent": 3,
      "text": "-EDI envelope headers are encrypted Congruent with the above statement, EDI envelope headers are NOT visible in the MIME package. In order to optimize routing from existing commercial EDI networks (called Value Added Networks or VANs) to the Internet, work may need to be done in the future to define ways to pull out some of the envelope information to make them visible; however, this specification does not go into any detail on this.",
      "ja": "-EDIエンベロープヘッダーは上記のステートメントと一致する暗号化されており、EDIエンベロープヘッダーはMIMEパッケージには見えません。既存の商用EDIネットワーク（付加価値ネットワークまたはバンと呼ばれる）からインターネットへのルーティングを最適化するには、エンベロープ情報の一部を引き出すためにそれらを見えるようにする方法を定義するために、将来作業を行う必要がある場合があります。ただし、この仕様はこれについて詳しく説明しません。"
    },
    {
      "indent": 3,
      "text": "-X12.58 and UN/EDIFACT security considerations The most common EDI standards bodies, ANSI X12 and EDIFACT, have defined internal provisions for security. X12.58 is the security mechanism for ANSI X12 and AUTACK provides security for EDIFACT. This specification DOES NOT dictate use or non-use of these security standards. They are both fully compatible, though possibly redundant, with this specification.",
      "ja": "-X12.58およびUN/EDIFACTセキュリティの考慮事項最も一般的なEDI標準団体であるANSI X12およびEDIFACTは、セキュリティに関する内部規定を定義しています。X12.58はANSI X12のセキュリティメカニズムであり、Autackはエディファクトのセキュリティを提供します。この仕様は、これらのセキュリティ基準の使用または不使用を決定するものではありません。これらは両方とも、この仕様とは冗長性であるかもしれませんが、完全に互換性があります。"
    },
    {
      "indent": 0,
      "text": "2.3.2 Flexibility Assumptions",
      "section_title": true,
      "ja": "2.3.2 柔軟性の仮定"
    },
    {
      "indent": 3,
      "text": "-Encrypted or unencrypted data",
      "ja": " - 暗号化または暗号化されていないデータ"
    },
    {
      "indent": 4,
      "text": "This specification allows for EDI message exchange where the EDI data can either be un-protected or protected by means of encryption.",
      "ja": "この仕様により、EDIデータが暗号化によって保護されていないか、保護されているEDIメッセージ交換が可能になります。"
    },
    {
      "indent": 3,
      "text": "-Signed or unsigned data",
      "ja": " - 署名または署名されていないデータ"
    },
    {
      "indent": 4,
      "text": "This specification allows for EDI message exchange with or without digital signature of the original EDI transmission.",
      "ja": "この仕様により、元のEDI送信のデジタル署名の有無にかかわらずEDIメッセージ交換が可能になります。"
    },
    {
      "indent": 3,
      "text": "-Use of receipt or not",
      "ja": " - 領収書を使用するかどうか"
    },
    {
      "indent": 4,
      "text": "This specification allows for EDI message transmission with or without a request for receipt notification. If a signed receipt notification is requested however, a mic value is REQUIRED as part of the returned receipt, unless an error condition occurs in which a mic value cannot be returned. In error cases, an un-signed receipt or MDN SHOULD be returned with the correct \"disposition modifier\" error value.",
      "ja": "この仕様により、領収書通知のリクエストの有無にかかわらず、EDIメッセージ送信が可能になります。ただし、署名された領収書通知が要求された場合、マイク値を返すことができないエラー条件が発生しない限り、返された領収書の一部としてマイク値が必要です。エラーの場合、正しい「処分修飾子」エラー値で、署名されていない領収書またはMDNを返す必要があります。"
    },
    {
      "indent": 3,
      "text": "-Formatting choices",
      "ja": " - フォーミットの選択"
    },
    {
      "indent": 4,
      "text": "This specification defines the use of two methods for formatting EDI contents that have security applied to it:",
      "ja": "この仕様では、セキュリティが適用されているEDIコンテンツをフォーマットするための2つの方法の使用を定義します。"
    },
    {
      "indent": 4,
      "text": "-PGP/MIME -S/MIME",
      "ja": "-pgp/mime -s/mime"
    },
    {
      "indent": 4,
      "text": "This specification relies on the guidelines set forth in RFC 2015/3156/2440, as reflected in [4] \"MIME Security with Pretty Good Privacy\" (PGP); OpenPGP Message Format, and RFC 2633/2630 [8] \"S/MIME Version 3 Message Specification; Cryptographic Message Syntax\". PGP/MIME or S/MIME as defined in this Applicability statement.",
      "ja": "この仕様は、[4]「Mime Security with Pretty Privacy」（PGP）に反映されているように、RFC 2015/3156/2440に記載されているガイドラインに依存しています。OpenPGPメッセージ形式、およびRFC 2633/2630 [8]「S/MIMEバージョン3メッセージ仕様、暗号化メッセージ構文」。このアプリケーションステートメントで定義されているPGP/MIMEまたはS/MIME。"
    },
    {
      "indent": 3,
      "text": "-Hash function, message digest choices",
      "ja": "-hash関数、メッセージダイジェストの選択"
    },
    {
      "indent": 4,
      "text": "When a signature is used, it is RECOMMENDED that the SHA1 hash algorithm be used for all outgoing messages, and that both MD5 and SHA1 be supported for incoming messages.",
      "ja": "署名が使用される場合、すべての発信メッセージにSHA1ハッシュアルゴリズムを使用し、MD5とSHA1の両方を着信メッセージにサポートすることをお勧めします。"
    },
    {
      "indent": 4,
      "text": "In summary, the following eight permutations are possible in any given trading relationship:",
      "ja": "要約すると、特定の取引関係で次の8つの順列が可能です。"
    },
    {
      "indent": 4,
      "text": "(1) Sender sends unencrypted data, does NOT request a receipt.",
      "ja": "(1) 送信者は暗号化されていないデータを送信し、領収書を要求しません。"
    },
    {
      "indent": 4,
      "text": "(2) Sender sends unencrypted data, requests a signed or unsigned receipt. The receiver sends back the signed or unsigned receipt.",
      "ja": "(2) 送信者は、暗号化されていないデータを送信し、署名済みまたは署名されていない領収書を要求します。受信者は、署名された領収書または署名されていない領収書を送り返します。"
    },
    {
      "indent": 4,
      "text": "(3) Sender sends encrypted data, does NOT request a receipt.",
      "ja": "(3) 送信者は暗号化されたデータを送信し、領収書を要求しません。"
    },
    {
      "indent": 4,
      "text": "(4) Sender sends encrypted data, requests a signed or unsigned receipt. The receiver sends back the signed or unsigned receipt.",
      "ja": "(4) 送信者は暗号化されたデータを送信し、署名された領収書または署名されていない領収書を要求します。受信者は、署名された領収書または署名されていない領収書を送り返します。"
    },
    {
      "indent": 4,
      "text": "(5) Sender sends signed data, does NOT request a signed or unsigned receipt.",
      "ja": "(5) 送信者は署名されたデータを送信し、署名済みまたは署名されていない領収書を要求しません。"
    },
    {
      "indent": 4,
      "text": "(6) Sender sends signed data, requests a signed or unsigned receipt. Receiver sends back the signed or unsigned receipt.",
      "ja": "(6) 送信者は署名されたデータを送信し、署名された領収書または署名されていない領収書を要求します。レシーバーは、署名された領収書または署名されていない領収書を送り返します。"
    },
    {
      "indent": 4,
      "text": "(7) Sender sends encrypted and signed data, does NOT request a signed or unsigned receipt.",
      "ja": "(7) 送信者は暗号化されたデータと署名データを送信し、署名された領収書または署名されていない領収書を要求しません。"
    },
    {
      "indent": 4,
      "text": "(8) Sender sends encrypted and signed data, requests a signed or unsigned receipt. Receiver sends back the signed or unsigned receipt.",
      "ja": "(8) 送信者は、暗号化されたデータと署名データを送信し、署名済みまたは署名されていない領収書を要求します。レシーバーは、署名された領収書または署名されていない領収書を送り返します。"
    },
    {
      "indent": 3,
      "text": "NOTE: Users can choose any of the eight possibilities, but only example (8), when a signed receipt is requested, offers the whole suite of security features described in the \"Secure transmission loop\" above.",
      "ja": "注：ユーザーは8つの可能性のいずれかを選択できますが、署名された領収書が要求された場合の例（8）のみが、上記の「セキュア送信ループ」で説明されているセキュリティ機能のスイート全体を提供します。"
    },
    {
      "indent": 0,
      "text": "3.0 Referenced RFCs and Their Contribution",
      "section_title": true,
      "ja": "3.0 RFCSとその貢献を参照しました"
    },
    {
      "indent": 0,
      "text": "3.1 RFC 821 SMTP [7]",
      "section_title": true,
      "ja": "3.1 RFC 821 SMTP [7]"
    },
    {
      "indent": 3,
      "text": "This is the core mail transfer standard that all MTAs need to adhere to.",
      "ja": "これは、すべてのMTAが遵守する必要があるコアメール転送標準です。"
    },
    {
      "indent": 0,
      "text": "3.2 RFC 822 Text Message Format [3]",
      "section_title": true,
      "ja": "3.2 RFC 822テキストメッセージフォーマット[3]"
    },
    {
      "indent": 3,
      "text": "Defines message header fields and the parts making up a message.",
      "ja": "メッセージヘッダーフィールドとメッセージを構成するパーツを定義します。"
    },
    {
      "indent": 0,
      "text": "3.3 RFC 1847 MIME Security Multiparts [6]",
      "section_title": true,
      "ja": "3.3 RFC 1847 MIMEセキュリティマルチパート[6]"
    },
    {
      "indent": 3,
      "text": "This document defines security multiparts for MIME: multipart/encrypted and multipart/signed.",
      "ja": "このドキュメントでは、MIMEのセキュリティマルチパート：MultiPART/暗号化およびマルチパート/署名を定義しています。"
    },
    {
      "indent": 0,
      "text": "3.4 RFC 1892 Multipart/report [9]",
      "section_title": true,
      "ja": "3.4 RFC 1892マルチパート/レポート[9]"
    },
    {
      "indent": 3,
      "text": "This RFC defines the use of the multipart/report content type, something that the MDN RFC 2298 builds upon.",
      "ja": "このRFCは、MDN RFC 2298が構築するマルチパート/レポートコンテンツタイプの使用を定義します。"
    },
    {
      "indent": 0,
      "text": "3.5 RFC 1767 EDI Content [2]",
      "section_title": true,
      "ja": "3.5 RFC 1767 EDIコンテンツ[2]"
    },
    {
      "indent": 3,
      "text": "This RFC defines the use of content type \"application\" for ANSI X12 (application/EDI-X12), EDIFACT (application/EDIFACT) and mutually defined EDI (application/EDI-Consent).",
      "ja": "このRFCは、ANSI X12（Application/EDI-X12）、Edifact（Application/Edifact）、および相互に定義されたEDI（Application/EDI-Consent）のコンテンツタイプ「アプリケーション」の使用を定義します。"
    },
    {
      "indent": 0,
      "text": "3.6 RFC 2015, 3156, 2440 PGP/MIME [4]",
      "section_title": true,
      "ja": "3.6 RFC 2015、3156、2440 PGP/MIME [4]"
    },
    {
      "indent": 3,
      "text": "These RFCs define the use of content types \"multipart/encrypted\", \"multipart/signed\", \"application/pgp encrypted\" and \"application/pgp-signature\" for defining MIME PGP content.",
      "ja": "これらのRFCは、MIME PGPコンテンツを定義するための「MultiPart/暗号化」、「MultiPart/Signed」、「Application/PGP暗号化」、「アプリケーション/PGPシグネチャ」の使用を定義します。"
    },
    {
      "indent": 0,
      "text": "3.7 RFC 2045, 2046, and 2049 MIME [1]",
      "section_title": true,
      "ja": "3.7 RFC 2045、2046、および2049 Mime [1]"
    },
    {
      "indent": 3,
      "text": "These are the basic MIME standards, upon which all MIME related RFCs build, including this one. Key contributions include definition of \"content type\", \"sub-type\" and \"multipart\", as well as encoding guidelines, which establishes 7-bit US-ASCII as the canonical character set to be used in Internet messaging.",
      "ja": "これらは、すべてのMIME関連のRFCが構築する基本的なMIME基準です。重要な貢献には、「コンテンツタイプ」、「サブタイプ」、「マルチパート」の定義、およびインターネットメッセージングで使用される標準文字セットとして7ビットのUS-ASCIIを確立するエンコードガイドラインが含まれます。"
    },
    {
      "indent": 0,
      "text": "3.8 RFC 2298 Message Disposition Notification [5]",
      "section_title": true,
      "ja": "3.8 RFC 2298メッセージ処分通知[5]"
    },
    {
      "indent": 3,
      "text": "This Internet RFC defines how a message disposition notification (MDN) is requested, and the format and syntax of the MDN. The MDN is the basis upon which receipts and signed receipts are defined in this specification.",
      "ja": "このインターネットRFCは、メッセージ処分通知（MDN）の要求、およびMDNの形式と構文を定義します。MDNは、この仕様で領収書と署名された領収書が定義される根拠です。"
    },
    {
      "indent": 0,
      "text": "3.9 RFC 2633 and 2630 S/MIME Version 3 Message Specifications [8]",
      "section_title": true,
      "ja": "3.9 RFC 2633および2630 S/MIMEバージョン3メッセージ仕様[8]"
    },
    {
      "indent": 3,
      "text": "This specification describes how MIME shall carry CMS Objects.",
      "ja": "この仕様は、MIMEがCMSオブジェクトをどのように運ぶかについて説明します。"
    },
    {
      "indent": 0,
      "text": "4.0 Structure of an EDI MIME Message - Applicability",
      "section_title": true,
      "ja": "4.0 EDI MIMEメッセージの構造 - 適用可能性"
    },
    {
      "indent": 0,
      "text": "4.1 Introduction",
      "section_title": true,
      "ja": "4.1 はじめに"
    },
    {
      "indent": 3,
      "text": "The structures below are described hierarchically in terms of which RFC's are applied to form the specific structure. For details of how to code in compliance with all RFC's involved, turn directly to the RFC's referenced.",
      "ja": "以下の構造は、RFCが適用されて特定の構造を形成するという点で階層的に説明されています。関与するすべてのRFCに準拠してコーディングする方法の詳細については、RFCの参照に直接目を向けてください。"
    },
    {
      "indent": 3,
      "text": "Also, these structures describe the initial transmission only. Receipts, and requests for receipts are handled in section 5.",
      "ja": "また、これらの構造は初期伝送のみを記述しています。領収書と領収書のリクエストは、セクション5で処理されます。"
    },
    {
      "indent": 0,
      "text": "4.2 Structure of an EDI MIME Message - PGP/MIME",
      "section_title": true,
      "ja": "4.2 EDI MIMEメッセージの構造-PGP/MIME"
    },
    {
      "indent": 0,
      "text": "4.2.1 No Encryption, No Signature",
      "section_title": true,
      "ja": "4.2.1 暗号化も署名もありません"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045 -RFC1767 (application/EDIxxxx or /xml)",
      "ja": "-RFC822/2045 -RFC1767（アプリケーション/EDIXXXXまたは/XML）"
    },
    {
      "indent": 0,
      "text": "4.2.2 No Encryption, Signature",
      "section_title": true,
      "ja": "4.2.2 暗号化なし、署名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC1847 (multipart/signed)\n    -RFC1767 (application/EDIxxxx or /xml)\n    -RFC2015/2440/3156 (application/pgp-signature)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4.2.3 Encryption, No Signature",
      "section_title": true,
      "ja": "4.2.3 暗号化、署名なし"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC1847 (multipart/encrypted)\n    -RFC2015/2440/3156 (application/pgp-encrypted)\n      -\"Version: 1\"\n    -RFC2015/2440/3156 (application/octet-stream)\n      -RFC1767 (application/EDIxxxx or /xml) (encrypted)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4.2.4 Encryption, Signature",
      "section_title": true,
      "ja": "4.2.4 暗号化、署名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC1847 (multipart/encrypted)\n    -RFC2015/2440/3156 (application/pgp-encrypted)\n      -\"Version: 1\"\n    -RFC2015/2440/3156 (application/octet-stream)\n      -RFC1847 (multipart/signed)(encrypted)\n        -RFC1767 (application/EDIxxxx or /xml)(encrypted)\n        -RFC2015/2440/3156 (application/pgp-signature)(encrypted)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4.3 Structure of an EDI MIME Message - S/MIME",
      "section_title": true,
      "ja": "4.3 edimimeメッセージの構造-S/Mime"
    },
    {
      "indent": 0,
      "text": "4.3.1 No Encryption, No Signature",
      "section_title": true,
      "ja": "4.3.1 暗号化も署名もありません"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045 -RFC1767 (application/EDIxxxx or /xml)",
      "ja": "-RFC822/2045 -RFC1767（アプリケーション/EDIXXXXまたは/XML）"
    },
    {
      "indent": 0,
      "text": "4.3.2 No Encryption, Signature",
      "section_title": true,
      "ja": "4.3.2 暗号化なし、署名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC1847 (multipart/signed)\n    -RFC1767 (application/EDIxxxx or /xml)\n    -RFC2633 (application/pkcs7-signature)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4.3.3 Encryption, No Signature",
      "section_title": true,
      "ja": "4.3.3 暗号化、署名なし"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC2633 (application/pkcs7-mime)\n    -RFC1767 (application/EDIxxxx or /xml) (encrypted)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4.3.4 Encryption, Signature",
      "section_title": true,
      "ja": "4.3.4 暗号化、署名"
    },
    {
      "indent": 3,
      "text": "-RFC822/2045\n  -RFC2633 (application/pkcs7-mime)\n    -RFC1847 (multipart/signed) (encrypted)\n      -RFC1767 (application/EDIxxxx or /xml) (encrypted)\n      -RFC2633 (application/pkcs7-signature) (encrypted)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.0 Receipts",
      "section_title": true,
      "ja": "5.0 領収書"
    },
    {
      "indent": 0,
      "text": "5.1 Introduction",
      "section_title": true,
      "ja": "5.1 はじめに"
    },
    {
      "indent": 3,
      "text": "In order to support non-repudiation of receipt (NRR), a signed receipt, based on digitally signing a message disposition notification, is to be implemented by a receiving trading partner's UA (User Agent). The message disposition notification, specified by RFC 2298 is digitally signed by a receiving trading partner as part of a multipart/signed MIME message.",
      "ja": "領収書（NRR）の非繰り返しをサポートするために、メッセージの処分通知へのデジタル署名に基づく署名済みの領収書は、受信トレーディングパートナーのUA（ユーザーエージェント）によって実装されます。RFC 2298で指定されたメッセージ処分通知は、マルチパート/署名されたMIMEメッセージの一部として受信トレーディングパートナーによってデジタル署名されています。"
    },
    {
      "indent": 3,
      "text": "The following support for signed receipts is REQUIRED:",
      "ja": "署名された領収書の次のサポートが必要です。"
    },
    {
      "indent": 3,
      "text": "1) The ability to create a multipart/report; where the report-type = disposition-notification.",
      "ja": "1) マルチパート/レポートを作成する機能。ここで、レポート-Type =処分 - 解釈。"
    },
    {
      "indent": 3,
      "text": "2) The ability to calculate a message integrity check (MIC) on the received message. The calculated MIC value will be returned to the sender of the message inside the signed receipt.",
      "ja": "2) 受信したメッセージでメッセージ整合性チェック（MIC）を計算する機能。計算されたマイク値は、署名された領収書内のメッセージの送信者に返されます。"
    },
    {
      "indent": 3,
      "text": "4) The ability to create a multipart/signed content with the message disposition notification as the first body part, and the signature as the second body part.",
      "ja": "4) メッセージ処分通知を使用して、最初のボディパーツとしてのマルチパート/署名コンテンツを作成する機能、および2番目のボディパートとしての署名。"
    },
    {
      "indent": 3,
      "text": "5) The ability to return the signed receipt to the sending trading partner.",
      "ja": "5) 署名された領収書を送信貿易相手パートナーに返却する機能。"
    },
    {
      "indent": 3,
      "text": "The signed receipt is used to notify a sending trading partner that requested the signed receipt that:",
      "ja": "署名された領収書は、署名された領収書に次のように要求した送信貿易相手のパートナーに通知するために使用されます。"
    },
    {
      "indent": 3,
      "text": "1) The receiving trading partner acknowledges receipt of the sent EDI Interchange.",
      "ja": "1) 受信トレーディングパートナーは、送信されたEDIインターチェンジの受領を認めています。"
    },
    {
      "indent": 3,
      "text": "2) If the sent message was signed, then the receiving trading partner has authenticated the sender of the EDI Interchange.",
      "ja": "2) 送信されたメッセージに署名された場合、受信トレーディングパートナーはEDIインターチェンジの送信者を認証しました。"
    },
    {
      "indent": 3,
      "text": "3) If the sent message was signed, then the receiving trading partner has verified the integrity of the sent EDI Interchange.",
      "ja": "3) 送信されたメッセージに署名された場合、受信トレーディングパートナーは送信されたEDIインターチェンジの完全性を確認しました。"
    },
    {
      "indent": 3,
      "text": "Regardless of whether the EDI Interchange was sent in S/MIME or PGP/MIME format, the receiving trading partner's UA MUST provide the following basic processing:",
      "ja": "EDIインターチェンジがS/MIMEまたはPGP/MIME形式で送信されたかどうかに関係なく、受信トレーディングパートナーのUAは次の基本処理を提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "1) If the sent EDI Interchange is encrypted, then the encrypted symmetric key and initialization vector (if applicable) is decrypted using the receiver's private key.",
      "ja": "1) 送信されたEDIインターチェンジが暗号化されている場合、暗号化された対称キーと初期化ベクトル（該当する場合）は、受信機の秘密キーを使用して復号化されます。"
    },
    {
      "indent": 3,
      "text": "2) The decrypted symmetric encryption key is then used to decrypt the EDI Interchange.",
      "ja": "2) 次に、復号化された対称暗号化キーを使用して、EDIインターチェンジを復号化します。"
    },
    {
      "indent": 3,
      "text": "3) The receiving trading partner authenticates signatures in a message using the sender's public key. The authentication algorithm performs the following:",
      "ja": "3) 受信トレーディングパートナーは、送信者の公開キーを使用してメッセージ内の署名を認証します。認証アルゴリズムは次のことを実行します。"
    },
    {
      "indent": 6,
      "text": "a) The message integrity check (MIC or Message Digest), is decrypted using the sender's public key.",
      "ja": "a) メッセージの整合性チェック（マイクまたはメッセージダイジェスト）は、送信者の公開キーを使用して復号化されます。"
    },
    {
      "indent": 6,
      "text": "b) A MIC on the signed contents (the MIME header and encoded EDI object, as per RFC 1767) in the message received is calculated using the same one-way hash function that the sending trading partner used.",
      "ja": "b) 受信したメッセージの署名されたコンテンツのマイク（MIMEヘッダーとエンコードされたEDIオブジェクト、RFC 1767に従って）は、送信する取引パートナーが使用したのと同じ一方向ハッシュ関数を使用して計算されます。"
    },
    {
      "indent": 6,
      "text": "c) The MIC extracted from the message that was sent, and the MIC calculated using the same one-way hash function that the sending trading partner used is compared for equality.",
      "ja": "c) 送信されたメッセージから抽出されたマイクと、送信貿易パートナーが使用したのと同じ一方向ハッシュ関数を使用して計算されたMICは、平等と比較されます。"
    },
    {
      "indent": 3,
      "text": "4) The receiving trading partner formats the MDN and sets the calculated MIC into the \"Received-content-MIC\" extension field.",
      "ja": "4) 受信トレーディングパートナーはMDNをフォーマットし、計算されたマイクを「受信コンテンツマイク」拡張フィールドに設定します。"
    },
    {
      "indent": 3,
      "text": "5) The receiving trading partner creates a multipart/signed MIME message according to RFC 1847.",
      "ja": "5) 受信トレーディングパートナーは、RFC 1847に従ってマルチパート/署名されたMIMEメッセージを作成します。"
    },
    {
      "indent": 3,
      "text": "6) The MDN is the first part of the multipart/signed message, and the digital signature is created over this MDN, including its MIME headers.",
      "ja": "6) MDNはMultiPart/署名されたメッセージの最初の部分であり、MIMEヘッダーを含むこのMDNにデジタル署名が作成されます。"
    },
    {
      "indent": 3,
      "text": "7) The second part of the multipart/signed message contains the digital signature. The \"protocol\" option specified in the second part of the multipart/signed is as follows:",
      "ja": "7) MultiPart/署名されたメッセージの2番目の部分には、デジタル署名が含まれています。マルチパート/署名の第2部で指定された「プロトコル」オプションは次のとおりです。"
    },
    {
      "indent": 6,
      "text": "S/MIME: protocol = \"application/pkcs-7-signature\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "PGP/MIME: protocol = \"application/pgp-signature\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "8) The signature information is formatted according to S/MIME or PGP/MIME specifications.",
      "ja": "8) 署名情報は、S/MIMEまたはPGP/MIME仕様に従ってフォーマットされます。"
    },
    {
      "indent": 3,
      "text": "The EDI Interchange and the RFC 1767 MIME EDI content header, can actually be part of a multi-part MIME content-type. When the EDI Interchange is part of a multi-part MIME content-type, the MIC MUST be calculated across the entire multi-part content, including the MIME headers.",
      "ja": "EDIインターチェンジとRFC 1767 MIME EDIコンテンツヘッダーは、実際にはマルチパートMIMEコンテンツタイプの一部になります。EDIインターチェンジがマルチパートMIMEコンテンツタイプの一部である場合、MIMEヘッダーを含むマルチパートコンテンツ全体でマイクを計算する必要があります。"
    },
    {
      "indent": 3,
      "text": "The signed MDN, when received by the sender of the EDI Interchange can be used by the sender:",
      "ja": "EDIインターチェンジの送信者が受信した場合、署名されたMDNは、送信者が使用できます。"
    },
    {
      "indent": 3,
      "text": "1) As an acknowledgment that the EDI Interchange sent, was delivered and acknowledged by the receiving trading partner. The receiver does this by returning the original message id of the sent message in the MDN portion of the signed receipt.",
      "ja": "1) EDIインターチェンジが送信されたという認識として、受信トレーディングパートナーによって配信され、認められました。受信者は、署名された領収書のMDN部分に送信されたメッセージの元のメッセージIDを返すことにより、これを行います。"
    },
    {
      "indent": 3,
      "text": "2) As an acknowledgment that the integrity of the EDI Interchange was verified by the receiving trading partner. The receiver does this by returning the calculated MIC of the received EDI Interchange (and 1767 MIME headers) in the \"Received-content-MIC\" field of the signed MDN.",
      "ja": "2) EDIインターチェンジの完全性が受信トレーディングパートナーによって検証されたという認識として。受信者は、署名されたMDNの「受信コンテンツマイック」フィールドで受信したEDIインターチェンジ（および1767 MIMEヘッダー）の計算マイクを返すことにより、これを行います。"
    },
    {
      "indent": 3,
      "text": "3) As an acknowledgment that the receiving trading partner has authenticated the sender of the EDI Interchange.",
      "ja": "3) 受信トレーディングパートナーがEDIインターチェンジの送信者を認証したという認識として。"
    },
    {
      "indent": 3,
      "text": "4) As a non-repudiation of receipt when the signed MDN is successfully verified by the sender with the receiving trading partner's public key and the returned mic value inside the MDN is the same as the digest of the original message.",
      "ja": "4) 署名されたMDNが受信トレーディングパートナーの公開キーを使用して送信者によって正常に検証された場合の領収書の非和解として、MDN内の返されたマイク値は、元のメッセージのダイジェストと同じです。"
    },
    {
      "indent": 0,
      "text": "5.2 Requesting a Signed Receipt",
      "section_title": true,
      "ja": "5.2 署名済みの領収書をリクエストします"
    },
    {
      "indent": 3,
      "text": "Message Disposition Notifications are requested as per RFC 2298,",
      "ja": "メッセージ処分通知は、RFC 2298に従って要求されます。"
    },
    {
      "indent": 3,
      "text": "\"An Extensible Message Format for Message Disposition Notification\". A request that the receiving user agent issue a message disposition notification is made by placing the following header into the message to be sent: MDN-request-header = \"Disposition-notification-to\" \":\" mail-address",
      "ja": "「メッセージ処分通知のための拡張可能なメッセージ形式」。受信ユーザーエージェントがメッセージ処分通知を発行するというリクエストは、送信されるメッセージに次のヘッダーを配置することにより行われます。MDN-Request-Header = \"Disoge-notification-to\" \"：\" Mail-Address"
    },
    {
      "indent": 3,
      "text": "The mail-address field is specified as an RFC 822 user@domain address, and is the return address for the message disposition notification.",
      "ja": "メールアドレスフィールドは、RFC 822ユーザー@ドメインアドレスとして指定されており、メッセージ処分通知の返品アドレスです。"
    },
    {
      "indent": 3,
      "text": "In addition to requesting a message disposition notification, a message disposition notification that is digitally signed, or what has been referred to as a signed receipt, can be requested by placing the following in the message header following the \"Disposition-Notification-To\" line.",
      "ja": "メッセージ処分通知を要求することに加えて、デジタル署名されたメッセージ処分通知、または署名された領収書と呼ばれているものは、「処分 - 解釈」ラインに続いてメッセージヘッダーに以下を配置することで要求できます。。"
    },
    {
      "indent": 3,
      "text": "Disposition-notification-options = \"Disposition-Notification-Options\" \":\" disposition-notification-parameters",
      "ja": "気質 - 節解決= \"気質 - ノット化 - オプション\" \"：\"気質 - 解釈 - パラメーター"
    },
    {
      "indent": 3,
      "text": "where",
      "ja": "ただし"
    },
    {
      "indent": 5,
      "text": "disposition-notification-parameters =\n                  parameter *(\";\" parameter)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "where",
      "ja": "ただし"
    },
    {
      "indent": 5,
      "text": "parameter = attribute \"=\" importance \", \" 1#value\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "where",
      "ja": "ただし"
    },
    {
      "indent": 5,
      "text": "importance = \"required\" | \"optional\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "So the Disposition-notification-options string could be:",
      "ja": "したがって、気質 -  notification-options文字列は次のとおりです。"
    },
    {
      "indent": 5,
      "text": "signed-receipt-protocol=optional, <protocol symbol>;\nsigned-receipt-micalg=optional, <micalg1>, <micalg2>,...;",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The currently supported values for <protocol symbol> are \"pkcs7-signature\", for the S/MIME detached signature format, or \"pgp-signature\", for the pgp signature format.",
      "ja": "<プロトコルシンボル>の現在サポートされている値は、S/MIMEデタッチされた署名形式、またはPGP署名形式の「PGP-Signature」の「PKCS7シグネチャ」です。"
    },
    {
      "indent": 3,
      "text": "The currently supported values for MIC algorithm values are:",
      "ja": "マイクアルゴリズム値の現在サポートされている値は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Algorithm Value used",
      "ja": "使用されるアルゴリズム値"
    },
    {
      "indent": 3,
      "text": "MD5 md5 SHA-1 sha1 (Historical Note: Some early implementations of EDIINT emitted and expected \"rsa-md5\" and \"rsa-sha1\" for the micalg parameter.) Receiving agents SHOULD be able to recover gracefully from a micalg parameter value that they do not recognize.",
      "ja": "MD5 MD5 SHA-1 SHA1（歴史的注：Micalgパラメーターの「RSA-MD5」および「RSA-SHA1」が発現し、予想されるEDIINTのいくつかの早期実装。認識しないでください。"
    },
    {
      "indent": 3,
      "text": "An example of a formatted options line would be as follows:",
      "ja": "フォーマットされたオプションラインの例は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Disposition-notification-options: signed-receipt-protocol=optional, pkcs7-signature; signed-receipt-micalg=optional, sha1, md5",
      "ja": "気質 - 節解決書：signed-receipt-protocol = optional、pkcs7-signature;signed-receipt-micalg = optional、sha1、md5"
    },
    {
      "indent": 3,
      "text": "The semantics of the \"signed-receipt-protocol\" parameter is as follows:",
      "ja": "「Signed-Receipt-Protocol」パラメーターのセマンティクスは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "1) The \"signed-receipt-protocol\" parameter is used to request a signed receipt from the recipient trading partner. The \"signed-receipt-protocol\" parameter also specifies the format in which the signed receipt should be returned to the requester.",
      "ja": "1) 「Signed-Receipt-Protocol」パラメーターは、受信者取引パートナーに署名された領収書を要求するために使用されます。「Signed-Receipt-Protocol」パラメーターは、署名された領収書をリクエスターに返送する形式も指定します。"
    },
    {
      "indent": 6,
      "text": "The \"signed-receipt-micalg\" parameter is a list of MIC algorithms preferred by the requester for use in signing the returned receipt. The list of MIC algorithms should be honored by the recipient from left to right.",
      "ja": "「Signed-Receipt-Micalg」パラメーターは、返品された領収書に署名する際に使用するために要求者が好むマイクアルゴリズムのリストです。マイクアルゴリズムのリストは、受信者が左から右に尊重する必要があります。"
    },
    {
      "indent": 6,
      "text": "Both the \"signed-receipt-protocol\" and the \"signed-receipt-micalg\" option parameters are REQUIRED when requesting a signed receipt.",
      "ja": "署名済みの領収書を要求する際には、「署名されたReceipt-Protocol」と「Signed-Receipt-Micalg」オプションパラメーターの両方が必要です。"
    },
    {
      "indent": 3,
      "text": "2) The \"importance\" attribute of \"Optional\" is defined in the MDN RFC 2298 and has the following meaning:",
      "ja": "2) 「オプション」の「重要性」属性は、MDN RFC 2298で定義されており、次の意味があります。"
    },
    {
      "indent": 6,
      "text": "Parameters with an importance of \"Optional\" permit a UA that does not understand the particular options parameter to still generate a MDN in response to a request for a MDN. A UA that does not understand the \"signed-receipt-protocol\" parameter, or the \"signed-receipt-micalg\" will obviously not return a signed receipt.",
      "ja": "「オプション」の重要性を持つパラメーターは、特定のオプションパラメーターを理解していないUAに、MDNのリクエストに応じてMDNを生成することを許可します。「Signed-Receipt-Protocol」パラメーターを理解していないUA、または「Signed-Receipt-Micalg」は明らかに署名済みの領収書を返さないでしょう。"
    },
    {
      "indent": 6,
      "text": "The importance of \"Optional\" is used for the signed receipt parameters because it is RECOMMENDED that an MDN be returned to the requesting trading partner even if the recipient could not sign it.",
      "ja": "「オプション」の重要性は、受信者が署名できなかったとしても、MDNを要求トレーディングパートナーに返すことをお勧めするため、署名された領収書パラメーターに使用されます。"
    },
    {
      "indent": 6,
      "text": "The returned MDN will contain information on the disposition of the message as well as why the MDN could not be signed. See the Disposition field in section 5.3 for more information.",
      "ja": "返されたMDNには、メッセージの処分に関する情報と、MDNに署名できなかった理由が含まれます。詳細については、セクション5.3の処分フィールドを参照してください。"
    },
    {
      "indent": 6,
      "text": "Within an EDI trading relationship, if a signed receipt is expected and is not returned, then the validity of the transaction is up to the trading partners to resolve. In general, if a signed receipt is required in the trading relationship and is not received, the transaction will likely not be considered valid.",
      "ja": "EDI取引関係の中で、署名された領収書が予想され、返されない場合、取引の有効性は取引パートナー次第です。一般に、取引関係に署名された領収書が必要であり、受け取られていない場合、取引は有効とは見なされない可能性があります。"
    },
    {
      "indent": 0,
      "text": "5.2.1 Additional Signed Receipt Considerations",
      "section_title": true,
      "ja": "5.2.1 追加の署名された領収書の考慮事項"
    },
    {
      "indent": 3,
      "text": "The \"rules\" stated in Section 2.2.3 for signed receipts are as follows:",
      "ja": "署名された領収書については、セクション2.2.3に記載されている「ルール」は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "1) When a receipt is requested, explicitly specifying that the receipt be signed, then the receipt MUST be returned with a signature.",
      "ja": "1) 領収書が要求された場合、領収書に署名されることを明示的に指定する場合、領収書は署名で返品する必要があります。"
    },
    {
      "indent": 3,
      "text": "2) When a receipt is requested, explicitly specifying that the receipt be signed, but the recipient cannot support either the requested protocol format, or requested MIC algorithms, then either a signed or unsigned receipt SHOULD be returned.",
      "ja": "2) 領収書が要求された場合、領収書に署名されることを明示的に指定しますが、受信者は要求されたプロトコル形式または要求されたマイクアルゴリズムのいずれをサポートできない場合、署名済みまたは署名されていない領収書を返品する必要があります。"
    },
    {
      "indent": 3,
      "text": "3) When a signature is not explicitly requested, or if the signed receipt request parameter is not recognized by the UA, then no receipt, an unsigned receipt, or a signed receipt MAY be returned by the recipient.",
      "ja": "3) 署名が明示的に要求されていない場合、または署名された領収書要求パラメーターがUAによって認識されない場合、領収書、署名されていない領収書、または署名済みの領収書を受信者が返品することができます。"
    },
    {
      "indent": 3,
      "text": "NOTE: For Internet EDI, it is RECOMMENDED that when a signature is not explicitly requested, or if parameters are not recognized, that the UA send back at a minimum, an unsigned receipt. If a signed receipt however was always returned as a policy, whether requested or not, then any false unsigned receipts can be repudiated.",
      "ja": "注：インターネットEDIの場合、署名が明示的に要求されていない場合、またはパラメーターが認識されない場合、UAが最低で署名されていない領収書を送信することをお勧めします。ただし、署名された領収書が常にポリシーとして返送された場合、要求されているかどうかにかかわらず、誤った署名されていない領収書は拒否されます。"
    },
    {
      "indent": 3,
      "text": "When a request for a signed receipt is made, but there is an error in processing the contents of the message, a signed receipt MUST still be returned. The request for a signed receipt SHALL still be honored, though the transaction itself may not be valid. The reason for why the contents could not be processed MUST be set in the \"disposition-field\".",
      "ja": "署名済みの領収書のリクエストが行われますが、メッセージの内容を処理する際にエラーがある場合、署名済みの領収書は引き続き返品する必要があります。署名された領収書の要求は依然として尊重されますが、トランザクション自体は有効ではない場合があります。内容を処理できなかった理由は、「処理場」に設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "When a request for a signed receipt is made, the \"Received-content-MIC\" MUST always be returned to the requester. The\"Received-content-MIC\" MUST be calculated as follows:",
      "ja": "署名済みの領収書のリクエストが行われた場合、「受信コンテンツマイク」は常にリクエスターに返送する必要があります。「受信コンテンツマイク」は次のように計算する必要があります。"
    },
    {
      "indent": 3,
      "text": "- For any signed messages, the MIC to be returned is calculated on the RFC1767 MIME header and content. Canonicalization as specified in RFC 1848 MUST be performed before the MIC is calculated, since the sender requesting the signed receipt was also REQUIRED to canonicalize.",
      "ja": "- 署名されたメッセージの場合、返されるマイクはRFC1767 MIMEヘッダーとコンテンツで計算されます。RFC 1848で指定されている正規化は、マイクが計算される前に実行する必要があります。これは、署名された領収書を要求する送信者も正規化するために必要であるためです。"
    },
    {
      "indent": 3,
      "text": "- For encrypted, unsigned messages, the MIC to be returned is calculated on the decrypted RFC 1767 MIME header and content. The content after decryption MUST be canonicalized before the MIC is calculated.",
      "ja": "- 暗号化された、署名されていないメッセージの場合、返されるマイクは、復号化されたRFC 1767 MIMEヘッダーとコンテンツで計算されます。復号化後のコンテンツは、マイクが計算される前に正規化する必要があります。"
    },
    {
      "indent": 3,
      "text": "- For unsigned, unencrypted messages, the MIC MUST be calculated over the message contents prior to Content-Transfer-Encoding and without the MIME or any other RFC 822 headers, since these are sometimes altered or reordered by MTAs.",
      "ja": "- 署名されていない、暗号化されていないメッセージの場合、MTAによって変更または再注文されることがあるため、コンテンツ転送エンコードの前に、MIMEまたはその他のRFC 822ヘッダーなしでメッセージコンテンツを介してMICを計算する必要があります。"
    },
    {
      "indent": 0,
      "text": "5.3 Message Disposition Notification Format",
      "section_title": true,
      "ja": "5.3 メッセージ処分通知形式"
    },
    {
      "indent": 3,
      "text": "The format of a message disposition notification is specified in RFC 2298. For use in Internet EDI, the following format will be used:",
      "ja": "メッセージ処分通知の形式はRFC 2298で指定されています。インターネットEDIで使用するために、次の形式を使用します。"
    },
    {
      "indent": 3,
      "text": "- content-type - per RFC 1892 and the RFC 2298 specification",
      "ja": "- コンテンツタイプ-RFC1892およびRFC 2298仕様あたり"
    },
    {
      "indent": 3,
      "text": "- reporting-ua-field - per RFC 2298 specification",
      "ja": "- REPORTING-UA-FIELD-RFC 2298仕様あたり"
    },
    {
      "indent": 3,
      "text": "- MDN-gateway-field - per RFC 2298 specification",
      "ja": "- MDN-Gateway-Field-RFC 2298仕様あたり"
    },
    {
      "indent": 3,
      "text": "- original-recipient-field - per RFC 2298 specification",
      "ja": "- Original-Recipient-Field-RFC 2298仕様あたり"
    },
    {
      "indent": 3,
      "text": "- final-recipient-field - per RFC 2298 specification",
      "ja": "- Final-Recipient-Field-RFC 2298仕様あたり"
    },
    {
      "indent": 3,
      "text": "- original-message-id-field - per RFC 2298 specification",
      "ja": "- ORIGINAL-MESSAGE-ID-FIELD-RFC 2298仕様あたり"
    },
    {
      "indent": 3,
      "text": "- disposition-field - the following \"disposition-mode\" values SHOULD be used for Internet EDI:",
      "ja": "- 処分場 - インターネットEDIには、次の「処分モード」値を使用する必要があります。"
    },
    {
      "indent": 5,
      "text": "\"automatic-action\" - The disposition described by the disposition type was a result of an automatic action, rather than an explicit instruction by the user for this message.",
      "ja": "「自動アクション」 - 処分タイプによって記述された処分は、このメッセージのユーザーによる明示的な指示ではなく、自動アクションの結果でした。"
    },
    {
      "indent": 5,
      "text": "\"manual-action\" - The disposition described by the disposition type was a result of an explicit instruction by the user rather than some sort of automatically performed action.",
      "ja": "「マニュアルアクション」 - 処分タイプによって記述された処分は、何らかの自動的に実行されたアクションではなく、ユーザーによる明示的な指示の結果でした。"
    },
    {
      "indent": 5,
      "text": "\"MDN-sent-automatically\" - The MDN was sent because the UA had previously been configured to do so.",
      "ja": "「MDN-Sent-Automatical」 -  UAが以前に設定されていたため、MDNが送信されました。"
    },
    {
      "indent": 5,
      "text": "\"MDN-sent-manually\" - The user explicitly gave permission for this particular MDN to be sent. \"MDN-sent-manually\" is meaningful with \"manual-action\", but not with \"automatic-action\".",
      "ja": "「MDN-SENT-HARNAILL」 - ユーザーは、この特定のMDNが送信される許可を明示的に与えました。「MDN-SENT-HARNAILL」は「手動アクション」で意味がありますが、「自動アクション」では意味がありません。"
    },
    {
      "indent": 3,
      "text": "- disposition-field - the following \"disposition-type\" values SHOULD be used for Internet EDI:",
      "ja": "- 処分場 - インターネットEDIには、次の「処分型」値を使用する必要があります。"
    },
    {
      "indent": 5,
      "text": "\"processed\" - The message has been processed in some manner (e.g., printed, faxed, forwarded, gatewayed) without being displayed to the user. The user may or may not see the message later.",
      "ja": "「処理」 - メッセージは、ユーザーに表示されることなく、何らかの方法で処理されています（たとえば、印刷、ファックス、転送、ゲートウェイ）。ユーザーは、後でメッセージを表示する場合と表示される場合があります。"
    },
    {
      "indent": 5,
      "text": "\"failed\" - A failure occurred that prevented the proper generation of an MDN. More information about the cause of the failure may be contained in a Failure field. The \"failed\" disposition type is not to be used for the situation in which there is some problem in processing the message other than interpreting the request for an MDN. The \"processed\" or other disposition type with appropriate disposition modifiers is to be used in such situations.",
      "ja": "「失敗」 -  MDNの適切な生成を妨げる障害が発生しました。障害の原因に関する詳細情報は、障害フィールドに含まれる場合があります。「失敗した」処分タイプは、MDNのリクエストを解釈する以外にメッセージの処理に問題がある状況に使用されるべきではありません。適切な気質修飾子を備えた「処理済み」またはその他の処分タイプは、そのような状況で使用されます。"
    },
    {
      "indent": 3,
      "text": "- disposition-field - the following \"disposition-modifier\" values SHOULD be used for Internet EDI:",
      "ja": "- 処分場 - インターネットEDIには、次の「処分モジー」値を使用する必要があります。"
    },
    {
      "indent": 5,
      "text": "\"error\" - An error of some sort occurred that prevented successful processing of the message. Further information is contained in an Error field.",
      "ja": "「エラー」 - メッセージの処理の成功を妨げるある種のエラーが発生しました。詳細情報はエラーフィールドに含まれています。"
    },
    {
      "indent": 5,
      "text": "\"warning\" - The message was successfully processed but some sort of exceptional condition occurred. Further Information is contained in a Warning field.",
      "ja": "「警告」 - メッセージは正常に処理されましたが、ある種の例外的な状態が発生しました。詳細情報は、警告フィールドに含まれています。"
    },
    {
      "indent": 0,
      "text": "5.3.1 Message Disposition Notification Extensions",
      "section_title": true,
      "ja": "5.3.1 メッセージ処分通知拡張機能"
    },
    {
      "indent": 3,
      "text": "The following \"extension field\" will be added in order to support signed receipts for RFC 1767 MIME content type and multipart MIME content types that include the RFC 1767 MIME content type. The extension field\" defined below follows the \"disposition-field\" in the MDN.",
      "ja": "RFC 1767 MIMEコンテンツタイプとRFC 1767 MIMEコンテンツタイプを含むマルチパートMIMEコンテンツタイプの署名入り領収書をサポートするために、次の「拡張フィールド」が追加されます。以下に定義されている拡張フィールドは、MDNの「処分場」に従います。"
    },
    {
      "indent": 3,
      "text": "The \"Received-content-MIC\" extension field is set when the integrity of the received message is verified. The MIC is the base64 encoded quantity computed over the received message with a hash function. For details of \"what\" the \"Received-content-MIC\" should be calculated over, see Section 5.2.1. The algorithm used to calculate the \"Received-content-MIC\" value MUST be the same as the \"micalg\" value used by the sender in the multipart/signed message. When no signature is received, or the mic-alg parameter is not supported then it is RECOMMENDED that the SHA1 algorithm be used to calculate the MIC on the received message or message contents.",
      "ja": "受信したメッセージの整合性が検証されている場合、「受信コンテンツマイク」拡張フィールドが設定されます。マイクは、ハッシュ関数を使用して受信したメッセージで計算されたbase64エンコード数量です。「what」の「受信コンテンツマイク」の詳細については、セクション5.2.1を参照してください。「受信コンテンツマイク」値を計算するために使用されるアルゴリズムは、MultiPart/署名されたメッセージで送信者が使用する「Micalg」値と同じでなければなりません。署名が受信されない場合、またはMIC-ALGパラメーターがサポートされていない場合は、SHA1アルゴリズムを使用して、受信したメッセージまたはメッセージコンテンツのMICを計算することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "This field is set only when the contents of the message are processed successfully. This field is used in conjunction with the recipient's signature on the MDN in order for the sender to verify \"non-repudiation of receipt\".",
      "ja": "このフィールドは、メッセージの内容が正常に処理された場合にのみ設定されます。このフィールドは、送信者が「領収書の非和解」を確認するために、MDNに関する受信者の署名と併せて使用されます。"
    },
    {
      "indent": 3,
      "text": "- extension field = \"Received-content-MIC\" \":\" MIC",
      "ja": "- 拡張フィールド= \"受信-Content-MIC\" \"：\""
    },
    {
      "indent": 5,
      "text": "where:",
      "ja": "ただし："
    },
    {
      "indent": 5,
      "text": "<MIC> = <base64MicValue> \",\" <micalg>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "<base64MicValue> = the result of one way hash function, base64 encoded.",
      "ja": "<base64micvalue> = 1つの方法のハッシュ関数の結果、base64エンコード。"
    },
    {
      "indent": 5,
      "text": "< micalg> = the micalg value defined in RFC1847, an IANA registered MIC algorithm ID token.",
      "ja": "<micalg> = rfc1847で定義されたmicalg値、IANA登録マイクアルゴリズムIDトークン。"
    },
    {
      "indent": 0,
      "text": "5.3.2 Disposition Mode, Type, and Modifier Use",
      "section_title": true,
      "ja": "5.3.2 処分モード、タイプ、および修飾子の使用"
    },
    {
      "indent": 3,
      "text": "Guidelines for use of the \"disposition-mode\", \"disposition-type\", and \"disposition-modifier\" fields within Internet EDI are discussed in this section. The \"disposition-mode\", \"disposition-type', and \"disposition-modifier' fields are described in detail in RFC 2298. The \"disposition-mode', \"disposition-type\" and \"disposition-modifier\" values SHOULD be used as follows:",
      "ja": "インターネットEDI内の「処分モード」、「気質型」、および「処分モジー」フィールドを使用するためのガイドラインについては、このセクションで説明します。「処分モード」、「気質型」、および「処分モジー」フィールドは、RFC 2298で詳細に説明されています。次のように："
    },
    {
      "indent": 0,
      "text": "5.3.2.1 Successful Processing",
      "section_title": true,
      "ja": "5.3.2.1 処理の成功"
    },
    {
      "indent": 3,
      "text": "When the request for a receipt or signed receipt, and the received message contents are successfully processed by the receiving EDI UA, a receipt or MDN SHOULD be returned with the \"disposition-type\" set to there is no explicit way for a user to control the sending of the MDN, then the first part of the \"disposition-mode\" should be set to \"automatic-action\". When the MDN is being sent under user configurable control, then the first part of the \"disposition-mode\" should be set to \"manual-action\". Since a request for a signed receipt should always be honored, the user MUST not be allowed to configure the UA to not send a signed receipt when the sender requests one.",
      "ja": "領収書または署名された領収書のリクエスト、および受信したメッセージコンテンツが受信したEDI UAによって正常に処理される場合、ユーザーが制御するための明示的な方法はありません。MDNの送信は、「処分モード」の最初の部分を「自動アクション」に設定する必要があります。MDNがユーザー設定可能な制御の下で送信されている場合、「処分モード」の最初の部分は「手動アクション」に設定する必要があります。署名済みの領収書のリクエストは常に尊重される必要があるため、ユーザーは、送信者が要求したときに署名済みの領収書を送信しないようにUAを構成することを許可されてはなりません。"
    },
    {
      "indent": 3,
      "text": "The second part of the \"disposition-mode\" is set to \"MDN-sent-manually\" if the user gave explicit permission for the MDN to be sent. Again, the user MUST not be allowed to explicitly refuse to send a signed receipt when the sender requests one. The second part of the \"disposition-mode\" is set to \"MDN-sent-automatically\" whenever the EDI UA sends the MDN automatically, regardless of whether the sending was under a user's, administrator's, or under software control.",
      "ja": "「処分モード」の2番目の部分は、ユーザーがMDNを送信するために明示的な許可を与えた場合、「MDN-Sent-sent-sent」に設定されます。繰り返しますが、送信者が要求したときに、ユーザーが署名された領収書の送信を明示的に拒否することを許可されてはなりません。「処分モード」の2番目の部分は、EDI UAがユーザー、管理者、またはソフトウェア管理下にあるかどうかにかかわらず、EDI UAがMDNを自動的に送信するたびに「MDN-Sent-Automatical」に設定されます。"
    },
    {
      "indent": 3,
      "text": "Since EDI content is generally handled automatically by the EDI UA, a request for a receipt or signed receipt will generally return the following in the \"disposition-field\":",
      "ja": "EDIコンテンツは通常、EDI UAによって自動的に処理されるため、領収書または署名された領収書のリクエストは通常、「処分場」で以下を返します。"
    },
    {
      "indent": 5,
      "text": "Disposition: automatic-action/MDN-sent-automatically; processed",
      "ja": "処分：自動アクション/MDN-Sent-Automatical;処理"
    },
    {
      "indent": 3,
      "text": "Note this specification does not restrict the use of the \"disposition-mode\" to just automatic actions. Manual actions are valid as long as it is kept in mind that a request for a signed receipt MUST be honored.",
      "ja": "この仕様は、自動アクションのみに「処分モード」を使用することを制限していません。手動アクションは、署名された領収書のリクエストを尊重する必要があることを念頭に置いている限り有効です。"
    },
    {
      "indent": 0,
      "text": "5.3.2.2 Unprocessed Content",
      "section_title": true,
      "ja": "5.3.2.2 未処理のコンテンツ"
    },
    {
      "indent": 3,
      "text": "The request for a signed receipt requires the use of two \"disposition-notification-options\", which specify the protocol format of the returned signed receipt, and the MIC algorithm used to calculate the mic over the message contents. The \"disposition-field\" values that should be used in the case where the message content is being rejected or ignored, for instance if the EDI UA determines that a signed receipt cannot be returned because it does not support the requested protocol format, so the EDI UA chooses not to process the message contents itself, should be specified in the MDN \"disposition-field\" as follows:",
      "ja": "署名された領収書のリクエストには、返された署名された領収書のプロトコル形式を指定する2つの「気質 - 解釈オプション」の使用と、メッセージコンテンツ上のマイクを計算するために使用されるマイクアルゴリズムが必要です。たとえば、メッセージコンテンツが拒否または無視されている場合に使用する必要がある「処分フィールド」値。たとえば、EDI UAが要求されたプロトコル形式をサポートしていないために署名された領収書を返すことができないと判断した場合、EDI UAは、メッセージの内容自体を処理しないことを選択し、次のようにMDN「処分場」で指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Disposition: \"disposition-mode\"; failed/Failure: unsupported format",
      "ja": "処分：「処分モード」;失敗/障害：サポートされていない形式"
    },
    {
      "indent": 3,
      "text": "The syntax of the \"failed\" \"disposition-type\" is general, allowing the sending of any textual information along with the \"failed\" \"disposition-type\". For use in Internet EDI, the following \"failed\" values are defined:",
      "ja": "「失敗した」「処分型」の構文は一般的であり、「失敗した」「処分型」とともにテキスト情報を送信できます。インターネットEDIで使用するために、次の「失敗した」値が定義されています。"
    },
    {
      "indent": 3,
      "text": "\"Failure: unsupported format\" \"Failure: unsupported MIC-algorithms\"",
      "ja": "「障害：サポートされていない形式」「失敗：サポートされていないマイクアルゴリズム」"
    },
    {
      "indent": 0,
      "text": "5.3.2.3 Content Processing Errors",
      "section_title": true,
      "ja": "5.3.2.3 コンテンツ処理エラー"
    },
    {
      "indent": 3,
      "text": "When errors occur processing the received message content, the \"disposition-field\" should be set to the \"processed\" \"disposition-type\" value and the \"error\" \"disposition-modifier\" value. For use in Internet EDI, the following \"error\" \"disposition-modifier\" values are defined:",
      "ja": "受信したメッセージコンテンツを処理するエラーが発生した場合、「処理型」を「処理された」「処理型」値と「エラー」「処分モジー」値に設定する必要があります。インターネットEDIで使用するために、次の「エラー」「処分モジー」値が定義されています。"
    },
    {
      "indent": 3,
      "text": "\"Error: decryption-failed\" - the receiver could not decrypt the message contents.",
      "ja": "「エラー：復号化された」 - レシーバーはメッセージの内容を解読できませんでした。"
    },
    {
      "indent": 3,
      "text": "\"Error: authentication-failed\" - the receiver could not authenticate the sender.",
      "ja": "「エラー：認証装置」 - 受信者は送信者を認証できませんでした。"
    },
    {
      "indent": 3,
      "text": "\"Error: integrity-check-failed\" - the receiver could not verify content integrity.",
      "ja": "「エラー：Integrity-Check-Failed」 - 受信者はコンテンツの整合性を検証できませんでした。"
    },
    {
      "indent": 3,
      "text": "\"Error: unexpected-processing-error\" - a catch-all for any additional processing errors.",
      "ja": "「エラー：予期しない処理エラー」 - 追加の処理エラーのキャッチオール。"
    },
    {
      "indent": 3,
      "text": "An example of how the \"disposition-field\" would look when content processing errors are detected is as follows:",
      "ja": "コンテンツ処理エラーが検出されたときに「処分場」がどのように見えるかの例は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Disposition: \"disposition-mode\"; processed/Error: decryption-failed",
      "ja": "処分：「処分モード」;処理/エラー：復号化された"
    },
    {
      "indent": 0,
      "text": "5.3.2.4 Content Processing Warnings",
      "section_title": true,
      "ja": "5.3.2.4 コンテンツ処理警告"
    },
    {
      "indent": 3,
      "text": "Situations arise in EDI where even if a trading partner cannot be authenticated correctly, the trading partners still agree to continue processing the EDI transactions. Transaction reconciliation is done between the trading partners at a later time. In the content processing warning situations as described above, the \"disposition-field\" SHOULD be set to the \"processed\" \"disposition-type\" value, and the \"warning\" \"disposition-modifier\" value. For use in Internet EDI, the following \"warning\" \"disposition-modifier\" values are defined:",
      "ja": "EDIでは状況が発生し、取引パートナーを正しく認証できなくても、取引パートナーは依然としてEDIトランザクションの処理を継続することに同意します。取引調整は、後で取引パートナー間で行われます。上記のコンテンツ処理警告状況では、「処理型」を「処理された」「処理型」値に設定する必要があり、「警告」「処分モジュア」値が値に設定する必要があります。インターネットEDIで使用するために、次の「警告」「処分モジー」値が定義されています。"
    },
    {
      "indent": 3,
      "text": "\"Warning: authentication-failed, processing continued\"",
      "ja": "「警告：認証が請求され、処理が継続されます」"
    },
    {
      "indent": 3,
      "text": "An example of how the \"disposition-field\" would look when content processing warnings are detected is as follows:",
      "ja": "コンテンツ処理警告が検出されたときに「処分場」がどのように見えるかの例は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Disposition: \"disposition-mode\"; processed/Warning: authentication-failed, processing continued",
      "ja": "処分：「処分モード」;処理/警告：認証が除外され、処理が続きました"
    },
    {
      "indent": 0,
      "text": "5.4 Message Disposition Notification Processing",
      "section_title": true,
      "ja": "5.4 メッセージ処分通知処理"
    },
    {
      "indent": 0,
      "text": "5.4.1 Large File Processing",
      "section_title": true,
      "ja": "5.4.1 大きなファイル処理"
    },
    {
      "indent": 3,
      "text": "Large EDI Interchanges sent via SMTP can be automatically fragmented by some message transfer agents. A subtype of message/partial, is defined in RFC 2045 [1] to allow large objects to be delivered as separate pieces of mail and to be automatically reassembled by the receiving user agent. Using message/partial, can help alleviate fragmentation of large messages by different message transfer agents, but does not completely eliminate the problem. It is still possible that a piece of a partial message, upon re-assembly, may prove to contain a partial message as well. This is allowed by the Internet standards, and it is the responsibility of the user agent to reassemble the fragmented pieces.",
      "ja": "SMTPを介して送信される大きなEDIインターチェンジは、一部のメッセージ転送エージェントによって自動的に断片化できます。メッセージ/部分のサブタイプは、RFC 2045 [1]で定義されており、大きなオブジェクトを別々のメールとして配信し、受信ユーザーエージェントによって自動的に再組み立てされます。メッセージ/部分的な使用は、異なるメッセージ転送エージェントによる大きなメッセージの断片化を軽減するのに役立ちますが、問題を完全に排除しません。再組み立て時に、部分的なメッセージの一部が部分的なメッセージを含むことが証明される可能性があります。これはインターネット標準で許可されており、断片化されたピースを再組み立てするのはユーザーエージェントの責任です。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that the size of the EDI Interchange sent via SMTP be configurable so that if fragmentation is needed, then message/partial can be used to send the large EDI Interchange in smaller pieces. RFC 2045 [1] defines the use of Content-Type: message/partial.",
      "ja": "SMTP経由で送信されるEDIインターチェンジのサイズを構成可能にすることをお勧めします。これにより、断片化が必要な場合は、メッセージ/部分を使用して大きなEDIインターチェンジを小さなピースで送信できます。RFC 2045 [1]は、コンテンツタイプの使用を定義しています：メッセージ/部分的。"
    },
    {
      "indent": 3,
      "text": "Note: Support of the message/partial content type for use in Internet EDI is OPTIONAL and in the absence of knowledge that the recipient supports partial it SHOULD NOT be used.",
      "ja": "注：インターネットEDIで使用するためのメッセージ/部分コンテンツタイプのサポートはオプションであり、受信者が使用すべきではない部分的なサポートをサポートする知識がない場合は、使用しないでください。"
    },
    {
      "indent": 3,
      "text": "The receiving UA is required to re-assemble the original message before sending the message disposition notification to the original sender of the message. A message disposition notification is used to specify the disposition of the entire message that was sent, and should not be returned by a processing UA until the entire message is received, even if the received message requires re-assembling.",
      "ja": "受信UAは、メッセージの処分通知をメッセージの元の送信者に送信する前に、元のメッセージを再組み立てする必要があります。メッセージ処分通知は、送信されたメッセージ全体の処分を指定するために使用されます。受信したメッセージに再アセンブを必要とする場合でも、メッセージ全体が受信されるまで処理UAによって返されるべきではありません。"
    },
    {
      "indent": 0,
      "text": "5.4.2 Example",
      "section_title": true,
      "ja": "5.4.2 例"
    },
    {
      "indent": 3,
      "text": "The following is an example of a signed receipt returned by a UA after successfully processing a MIME EDI content type. The sending trading partner has requested a return signed receipt.",
      "ja": "以下は、MIME EDIコンテンツタイプの処理に正常に処理した後、UAによって返された署名済みの領収書の例です。送信する取引パートナーは、返品署名の領収書を要求しました。"
    },
    {
      "indent": 3,
      "text": "This example follows the S/MIME application/pkcs-7-signature format.",
      "ja": "この例は、S/MIMEアプリケーション/PKCS-7-署名形式に従います。"
    },
    {
      "indent": 3,
      "text": "NOTE: This example is provided as an illustration only, and is not considered part of the protocol specification. If an example conflicts with the protocol definitions specified above or in the other referenced RFCs, the example is wrong.",
      "ja": "注：この例はイラストとしてのみ提供されており、プロトコル仕様の一部とは見なされません。例が、上記または他の参照されたRFCSで指定されたプロトコル定義と競合する場合、例は間違っています。"
    },
    {
      "indent": 8,
      "text": "To: <recipient email>\nSubject:\nFrom: <sender email>\nDate: <date>\nMime-Version: 1.0\nContent-Type: multipart/signed; boundary=\"separator\";\n  micalg=sha1; protocol=\"application/pkcs7-signature\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "  --separator\n& Content-Type:  multipart/report; report-type=disposition\n&   notification;  boundary=\"xxxxx\"\n&\n& --xxxxx\n& Content-Type: text/plain\n&\n& The message sent to Recipient <Recipient@cyclonesoftware.com>\n& has been received, the EDI Interchange was successfully\n& decrypted and its integrity was verified.  In addition, the",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "& sender of the message, Sender <Edi_Sender@cyclonesoftware.com> & was authenticated as the originator of the message. There is & no guarantee however that the EDI Interchange was & syntactically correct, or was received by the EDI & application. & & --xxxxx & Content-Type: message/disposition-notification & & Reporting-UA: Interchange.cyclonesoftware.com (CI 2.2) & Original-Recipient: rfc822; Edi_Recipient@cyclonesoftware.com & Final-Recipient: rfc822; Edi_Recipient@cyclonesoftware.com & Original-Message-ID: <17759920005.12345@cyclonesoftware.com > & Disposition: automatic-action/MDN-sent-automatically; processed & Received-content-MIC: Q2hlY2sgSW50XwdyaXRIQ, sha1 & & --xxxxx & Content-Type: message/rfc822 & & To: <recipient email> & Subject: & & [additional header fields go here] & & --xxxxx--",
      "ja": "＆メッセージの送信者、送信者<edi_sender@cyclonesoftware.com>＆メッセージの発信者として認証されました。ただし、EDIインターチェンジが構文的に正しい、またはEDI＆アプリケーションによって受信されたという保証はありません。＆＆-xxxxx＆content-type：message/disoge-notification＆＆＆reporting-ua：interchange.cyclonesoftware.com（CI 2.2）＆original-recipient：rfc822;edi_recipient@cyclonesoftware.com＆final-Recipient：rfc822;edi_recipient@cyclonesoftware.com＆original-message-id：<17759920005.12345@cyclonesoftware.com>＆dision：autitatic-active/mdn-sent-automalict;Processed＆Receive-Content-MIC：Q2HLY2SGSW50XWDYAXRIQ、SHA1＆＆＆-XXXXX＆Content-Type：Message/RFC822＆＆to：<Recositient Email>＆＆[＆＆[＆＆[追加ヘッダーフィールド]＆＆--xxxxx- - "
    },
    {
      "indent": 8,
      "text": "--separator\nContent-Type: application/pkcs7-signature; name=smime.p7s;\nContent-Transfer-Encoding: base64\nContent-Disposition: attachment; filename=smime.p7s",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "MIIHygYJKoZIhvcNAQcDoIIHuzCCB7cCAQAxgfIwge8CAQAwg ZgwgYMxFjAUBgNVBAMTDVRlcnJ5IEhhcmRpbmcxEDAOBgNVBA oTB0NZQ0xPTkUxDDAKBgNVBAsTA04vQTEQMA4GA1UEBxMHU=",
      "ja": "miihygijkozihvcnaqccdoiihuzccb7ccaqaxgfiwge8caqawg zgwgymxfjaubgnvbamtdvrlcnj5iehhhcmrpbmcxedaobgnvba otb0nzq0xptkptkuxddakbgnbasta04g4g4gpasta04gpasta04gpasta04gpasta"
    },
    {
      "indent": 6,
      "text": "--separator--",
      "ja": " - セパレーター - "
    },
    {
      "indent": 3,
      "text": "Notes:",
      "ja": "ノート："
    },
    {
      "indent": 3,
      "text": "-The lines preceded with \"&\" is what the signature is calculated over.",
      "ja": " - 「＆」が先行する行は、署名が計算されるものです。"
    },
    {
      "indent": 4,
      "text": "(For details on how to prepare the multipart/signed with protocol = \"application/pkcs7-signature\" see the \"S/MIME Message Specification, PKCS Security Services for MIME\".)",
      "ja": "（MultiPart/signed with Multipart/signedを準備する方法の詳細= \"Application/PKCS7-Signature\"を参照してください。"
    },
    {
      "indent": 3,
      "text": "Note: As specified by RFC 1892 [9], returning the original or portions of the original message in the third body part of the multipart/report is not required. This is an optional body part. It is RECOMMENDED that the received headers from the original message be placed in the third body part, as they can be helpful in tracking problems.",
      "ja": "注：RFC 1892 [9]で指定されているように、マルチパート/レポートの3番目のボディ部分で元のメッセージのオリジナルまたは部分を返す必要はありません。これはオプションのボディの部分です。元のメッセージから受信したヘッダーは、問題の追跡に役立つ可能性があるため、3番目のボディ部分に配置することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Also note that the textual first body part of the multipart/report can be used to include a more detailed explanation of the error conditions reported by the disposition headers. The first body part of the multipart/report when used in this way, allows a person to better diagnose a problem in detail.",
      "ja": "また、マルチパート/レポートのテキストの最初のボディ部分を使用して、気質ヘッダーによって報告されたエラー条件のより詳細な説明を含めることができることに注意してください。マルチパート/レポートの最初のボディ部分は、この方法で使用される場合、人が問題を詳細に診断することを可能にします。"
    },
    {
      "indent": 0,
      "text": "6.0 Public Key Certificate Handling",
      "section_title": true,
      "ja": "6.0 公開鍵の証明書処理"
    },
    {
      "indent": 0,
      "text": "6.1 Near Term Approach",
      "section_title": true,
      "ja": "6.1 短期的なアプローチ"
    },
    {
      "indent": 3,
      "text": "In the near term, the exchange of public keys and certification of these keys must be handled as part of the process of establishing a trading partnership. The UA and/or EDI application interface must maintain a database of public keys used for encryption or signatures, in addition to the mapping between EDI trading partner ID and RFC 822 [3] email address. The procedures for establishing a trading partnership and configuring the secure EDI messaging system might vary among trading partners and software packages.",
      "ja": "短期的には、公開鍵の交換とこれらのキーの認証は、取引パートナーシップを確立するプロセスの一環として処理する必要があります。UAおよび/またはEDIアプリケーションインターフェイスは、EDIトレーディングパートナーIDとRFC 822 [3]メールアドレスの間のマッピングに加えて、暗号化または署名に使用されるパブリックキーのデータベースを維持する必要があります。取引パートナーシップを確立し、安全なEDIメッセージングシステムを構成する手順は、取引パートナーとソフトウェアパッケージによって異なる場合があります。"
    },
    {
      "indent": 3,
      "text": "For systems which make use of X.509 certificates, it is RECOMMENDED that trading partners self-certify each other if an agreed upon certification authority is not used. It is highly RECOMMENDED that when trading partners are using S/MIME, that they also exchange public key certificates using the recommendations specified in the S/MIME Version 3 Message Specification. The message formats and S/MIME conformance requirements for certificate exchange are specified in this document.",
      "ja": "X.509証明書を使用するシステムの場合、合意された認定機関が使用されない場合、取引パートナーはお互いを自己認証することをお勧めします。取引パートナーがS/MIMEを使用している場合、S/MIMEバージョン3メッセージ仕様で指定された推奨事項を使用して公開キー証明書も交換することを強くお勧めします。このドキュメントでは、メッセージフォーマットとS/MIMEの適合要件がこのドキュメントで指定されています。"
    },
    {
      "indent": 3,
      "text": "This applicability statement does NOT require the use of a certification authority. The use of a certification authority is therefore OPTIONAL.",
      "ja": "この適用性声明は、認証機関の使用を必要としません。したがって、認証機関の使用はオプションです。"
    },
    {
      "indent": 0,
      "text": "6.2 Long Term Approach",
      "section_title": true,
      "ja": "6.2 長期的なアプローチ"
    },
    {
      "indent": 3,
      "text": "In the long term, additional Internet-EDI standards may be developed to simplify the process of establishing a trading partnership, including the third party authentication of trading partners, as well as attributes of the trading relationship.",
      "ja": "長期的には、取引パートナーの第三者認証や取引関係の属性など、取引パートナーシップを確立するプロセスを簡素化するために、追加のインターネットEDI標準が開発される場合があります。"
    },
    {
      "indent": 0,
      "text": "7.0 Security Considerations",
      "section_title": true,
      "ja": "7.0 セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This entire document is concerned with secure transport of business to business data, and considers both privacy and authentication issues.",
      "ja": "このドキュメント全体は、ビジネスデータへのビジネスの安全な輸送に関するものであり、プライバシーと認証の問題の両方を考慮しています。"
    },
    {
      "indent": 3,
      "text": "Extracted from S/MIME Version 2 Message Specification:",
      "ja": "S/MIMEバージョン2のメッセージ仕様から抽出："
    },
    {
      "indent": 3,
      "text": "40-bit encryption is considered weak by most cryptographers. Using weak cryptography offers little actual security over sending plain text. However, other features of S/MIME, such as the specification of tripleDES or AES and the ability to announce stronger cryptographic capabilities to parties with whom you communicate, allow senders to create messages that use strong encryption. Using weak cryptography is never recommended unless the only alternative is no cryptography. When feasible, sending and receiving agents should inform senders and recipients the relative cryptographic strength of messages.",
      "ja": "40ビット暗号化は、ほとんどの暗号化者によって弱いと見なされます。弱い暗号化を使用すると、プレーンテキストの送信に対する実際のセキュリティはほとんどありません。ただし、3倍またはAEの仕様など、S/MIMEの他の機能や、コミュニケーションをとる当事者により強力な暗号化機能を発表する能力により、送信者は強力な暗号化を使用するメッセージを作成できます。唯一の代替手段が暗号化されていない場合を除き、弱い暗号化を使用することは決して推奨されません。実行可能な場合、送信および受信エージェントは、送信者と受信者にメッセージの相対的な暗号的な強さを通知する必要があります。"
    },
    {
      "indent": 3,
      "text": "Extracted from S/MIME Version 2 Certificate Handling:",
      "ja": "S/MIMEバージョン2の証明書処理から抽出："
    },
    {
      "indent": 3,
      "text": "When processing certificates, there are many situations where the processing might fail. Because the processing may be done by a user agent, a security gateway, or other program, there is no single way to handle such failures. Just because the methods to handle the failures has not been listed, however, the reader should not assume that they are not important. The opposite is true: if a certificate is not provably valid and associated with the message, the processing software should take immediate and noticeable steps to inform the end user about it.",
      "ja": "証明書を処理する場合、処理が失敗する可能性のある多くの状況があります。処理はユーザーエージェント、セキュリティゲートウェイ、またはその他のプログラムによって行われる可能性があるため、そのような障害を処理する方法はありません。ただし、障害を処理する方法がリストされていないからといって、読者はそれらが重要ではないと想定すべきではありません。逆の場合は、証明書が有効でなくメッセージに関連付けられていない場合、処理ソフトウェアは、エンドユーザーにそれを通知するために即座に顕著な手順を実行する必要があります。"
    },
    {
      "indent": 3,
      "text": "Some of the many places where signature and certificate checking might fail include:",
      "ja": "署名と証明書のチェックが失敗する可能性のある多くの場所のいくつかは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- no certificate chain leads to a trusted CA - no ability to check the CRL for a certificate - an invalid CRL was received - the CRL being checked is expired - the certificate is expired - the certificate has been revoked",
      "ja": "- 信頼できるCAにつながる証明書チェーンはありません - 証明書をCRLにチェックする能力はありません - 無効なCRLが受信されました - チェックされているCRLの有効期限が切れます - 証明書は失効します - 証明書は取り消されました"
    },
    {
      "indent": 3,
      "text": "There are certainly other instances where a certificate may be invalid, and it is the responsibility of the processing software to check them all thoroughly, and to decide what to do if the check fails.",
      "ja": "確かに証明書が無効になる可能性のある他のインスタンスがあり、処理ソフトウェアの責任であり、それらをすべて徹底的にチェックし、チェックが失敗した場合に何をすべきかを決定することです。"
    },
    {
      "indent": 0,
      "text": "8.0 Acknowledgments",
      "section_title": true,
      "ja": "8.0 謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks go out to the previous authors of the MIME-based Secure EDI IETF Draft: Mats Jansson.",
      "ja": "MimeベースのSecure EDI IETFドラフトの前の著者に感謝します：Mats Jansson。"
    },
    {
      "indent": 3,
      "text": "The authors would like to extend special thanks to Carl Hage, Jun Ding, Dale Moberg, and Karen Rosenthal for providing the team with valuable, and very thorough feedback. Without participants like those cited above, these efforts become hard to complete in a way useful to the users and implementers of the technology.",
      "ja": "著者は、チームに貴重で非常に徹底的なフィードバックを提供してくれたCarl Hage、Jun Ding、Dale Moberg、Karen Rosenthalに感謝します。上記のような参加者がいなければ、これらの取り組みは、テクノロジーのユーザーと実装者にとって有用な方法で完了するのが難しくなります。"
    },
    {
      "indent": 3,
      "text": "In addition, the authors would like to thank Harald Alvestrand, Jim Galvin, and Roger Fajman for their guidance and input.",
      "ja": "さらに、著者は、ハラルド・アルベスランド、ジム・ガルビン、ロジャー・ファジマンの指導と意見に感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "9.0 References",
      "section_title": true,
      "ja": "9.0 参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Borenstein, N. and N. Freed, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "ja": "[1] Borenstein、N。およびN. Freed、「多目的インターネットメール拡張機能（MIME）パート1：インターネットメッセージボディの形式」、RFC 2045、1996年11月。"
    },
    {
      "indent": 8,
      "text": "Borenstein, N. and N. Freed, \"Multipurpose Internet Mail Extensions (MIME) Part Two: Media Types\", RFC 2046, November 1996.",
      "ja": "Borenstein、N。およびN. Freed、「多目的インターネットメールエクステンション（MIME）パート2：メディアタイプ」、RFC 2046、1996年11月。"
    },
    {
      "indent": 8,
      "text": "Borenstein, N. and N. Freed, \"Multipurpose Internet Mail Extensions (MIME) Part Five: Conformance Criteria and Examples\", RFC 2049, November 1996.",
      "ja": "Borenstein、N。およびN. Freed、「多目的インターネットメールエクステンション（MIME）パート5：適合基準と例」、RFC 2049、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[2] Crocker, D., \"MIME Encapsulation of EDI Objects\", RFC 1767, March 1995.",
      "ja": "[2] Crocker、D。、「EDIオブジェクトのMIMEカプセル化」、RFC 1767、1995年3月。"
    },
    {
      "indent": 3,
      "text": "[3] Resnick, P., \"Internet Message Format\", RFC 2822, April 2001.",
      "ja": "[3] Resnick、P。、「インターネットメッセージフォーマット」、RFC 2822、2001年4月。"
    },
    {
      "indent": 3,
      "text": "[4] Elkins, M., \"MIME Security With Pretty Good Privacy (PGP)\", RFC 2015, October 1996.",
      "ja": "[4] Elkins、M。、「Pretty Good Privacy（PGP）のMime Security」、RFC 2015、1996年10月。"
    },
    {
      "indent": 8,
      "text": "Callas, J., Donnerhacke, L., Finney, H. and R.Thayer \"OpenPGP Message Format\", RFC 2440, November 1998.",
      "ja": "Callas、J.、Donnerhacke、L.、Finney、H。and R.Thayer \"OpenPGP Message Format\"、RFC 2440、1998年11月。"
    },
    {
      "indent": 8,
      "text": "Elkins, M., Del Torto, D., Levien, R. and T. Roessler \"MIME Security with OpenPGP\", RFC 3156, August 2001.",
      "ja": "Elkins、M.、Del Torto、D.、Levien、R。、およびT. Roessler \"Mime Security with OpenPGP\"、RFC 3156、2001年8月。"
    },
    {
      "indent": 3,
      "text": "[5] Fajman, R., \"An Extensible Message Format for Message Disposition Notifications\", RFC 2298, March 1998.",
      "ja": "[5] Fajman、R。、「メッセージ処分通知のための拡張可能なメッセージ形式」、RFC 2298、1998年3月。"
    },
    {
      "indent": 3,
      "text": "[6] Galvin, J., Murphy, S., Crocker, S. and N. Freed, \"Security Multiparts for MIME: Multipart/Signed and Multipart/Encrypted\", RFC 1847, October 1995.",
      "ja": "[6] Galvin、J.、Murphy、S.、Crocker、S。、およびN. Freed、「Mimeのセキュリティマルチパート：MultiPart/Signed and MultiPart/暗号化」、RFC 1847、1995年10月。"
    },
    {
      "indent": 3,
      "text": "[7] Klensin, J., \"Simple Mail Transfer Protocol\", RFC 2821, April 1982.",
      "ja": "[7] Klensin、J。、「Simple Mail Transfer Protocol」、RFC 2821、1982年4月。"
    },
    {
      "indent": 3,
      "text": "[8] Ramsdell, B., \"S/MIME Version 3 Message Specification; Cryptographic Message Syntax\", RFC 2633, June 1999.",
      "ja": "[8] Ramsdell、B。、「S/MIMEバージョン3メッセージ仕様、暗号化メッセージの構文」、RFC 2633、1999年6月。"
    },
    {
      "indent": 8,
      "text": "Housley, R., \"Cryptographic Message Syntax\", RFC 2630, June 1999.",
      "ja": "Housley、R。、「暗号化メッセージ構文」、RFC 2630、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[9] Vaudreuil, G., \"The Multipart/Report Content Type for the Reporting of Mail System Administrative Messages\", RFC 1892, January 1996.",
      "ja": "[9] Vaudreuil、G。、「メールシステム管理メッセージのレポートのマルチパート/レポートコンテンツタイプ」、RFC 1892、1996年1月。"
    },
    {
      "indent": 0,
      "text": "Appendix IANA Registration Form",
      "ja": "付録IANA登録フォーム"
    },
    {
      "indent": 0,
      "text": "A.1 IANA registration of the signed-receipt-protocol content disposition parameter",
      "section_title": true,
      "ja": "A.1 IANA署名付きReceipt-Protocolコンテンツ処分パラメーターの登録"
    },
    {
      "indent": 6,
      "text": "Parameter-name: signed-receipt-protocol Syntax: See section 5.2 of this document Specification: See section 5.2 of this document",
      "ja": "パラメーター名：署名されたReceipt-Protocol Syntax：このドキュメントの仕様のセクション5.2を参照：このドキュメントのセクション5.2を参照してください"
    },
    {
      "indent": 0,
      "text": "A.2 IANA registration of the signed-receipt-micalg content disposition parameter",
      "section_title": true,
      "ja": "A.2 IANA署名付きReceipt-Micalgコンテンツ処分パラメーターの登録"
    },
    {
      "indent": 6,
      "text": "Parameter-name: signed-receipt-micalg Syntax: See section 5.2 of this document Specification: See section 5.2 of this document",
      "ja": "パラメーター名：署名されたReceipt-Micalg構文：このドキュメントの仕様のセクション5.2を参照してください：このドキュメントのセクション5.2を参照してください"
    },
    {
      "indent": 0,
      "text": "A.3 IANA registration of the Received-content-MIC MDN extension field name",
      "section_title": true,
      "ja": "A.3 IANA-CONTENT-MIC MDN拡張フィールド名のIANA登録"
    },
    {
      "indent": 6,
      "text": "Extension field name: Received-content-MIC Syntax: See section 5.3.1 of this document Specification: See section 5.3.1 of this document",
      "ja": "拡張フィールド名：受信-Content-MIC構文：このドキュメントの仕様のセクション5.3.1を参照：このドキュメントのセクション5.3.1を参照してください"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Terry Harding Cyclone Commerce 8388 E. Hartford Drive Scottsdale, Arizona 85255, USA",
      "ja": "テリーハーディングサイクロンコマース8388 E.ハートフォードドライブスコッツデール、アリゾナ85255、米国"
    },
    {
      "indent": 3,
      "text": "EMail: tharding@cyclonecommerce.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Chuck Shih Gartner Group 251 River Oaks Parkway San Jose, CA 95134-1913 USA",
      "ja": "チャックシーガートナーグループ251リバーオークスパークウェイサンノゼ、カリフォルニア95134-1913 USA"
    },
    {
      "indent": 3,
      "text": "EMail: chuck.shih@gartner.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Rik Drummond Drummond Group P.O. Box 101567 Ft. Worth, TX 76105 USA",
      "ja": "Rik Drummond Drummond Group P.O.ボックス101567 ft。ワース、TX 76105 USA"
    },
    {
      "indent": 3,
      "text": "EMail: rik@drummondgroup.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があり、それについてコメントまたは説明する派生作品、またはその実装を支援することができます。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns. v This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。v本書に含まれるこのドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット協会とインターネットエンジニアリングタスクフォースは、本書の情報の使用が行われるという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害しないでください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}