{
  "title": {
    "text": "RFC 3441 - Asynchronous Transfer Mode (ATM) Package for the Media Gateway Control Protocol (MGCP)",
    "ja": "RFC 3441 - 非同期転送モードメディアゲートウェイコントロールプロトコル（MGCP）について（ATM）パッケージ"
  },
  "number": 3441,
  "created_at": "2019-10-28 10:41:43.399235+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           R. Kumar\nRequest for Comments: 3441                                 Cisco Systems\nCategory: Informational                                     January 2003",
      "raw": true
    },
    {
      "indent": 13,
      "text": "  Asynchronous Transfer Mode (ATM) Package\nfor the Media Gateway Control Protocol (MGCP)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes an Asynchronous Transfer Mode (ATM) package for the Media Gateway Control Protocol (MGCP). This package includes new Local Connection Options, ATM-specific events and signals, and ATM connection parameters. Also included is a description of codec and profile negotiation. It extends the MGCP that is currently being deployed in a number of products. Implementers should be aware of developments in the IETF Megaco Working Group and ITU SG16, which are currently working on a potential successor to this protocol.",
      "ja": "この文書では、メディアゲートウェイコントロールプロトコル（MGCP）のための非同期転送モード（ATM）のパッケージを記述する。このパッケージには、新しいローカル接続オプション、ATM固有のイベントや信号、およびATM接続パラメータを含んでいます。また、コーデックとプロフィール交渉の記述も含まれています。これは、現在の製品の数に展開されているMGCPを拡張します。実装者は、現在、このプロトコルへの潜在的な後継に取り組んでいるIETF Megacoの作業部会とITU SG16の発展、注意する必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.0  Conventions Used in this Document..............................2\n2.0  Introduction...................................................2\n3.0  Local Connection Options.......................................3\n  3.1 ATM Bearer Connection.........................................4\n  3.2 ATM Adaptation Layer (AAL)....................................8\n  3.3 Service Layer................................................15\n  3.4 ATM Bearer Traffic Management................................19\n  3.5 AAL Dimensioning.............................................27\n4.0 Signals and Events.............................................30\n5.0 Connection Parameters..........................................35\n6.0 Negotiation of Profiles and Codecs in ATM Applications.........37\n  6.1  Consistency of Parameters...................................37\n  6.2  Codec/Profile Negotiation in ATM Networks...................38\n7.0  Security Considerations.......................................45\n8.0  IANA Considerations...........................................45\n9.0  References....................................................45\n10.0 Acronyms......................................................48",
      "raw": true
    },
    {
      "indent": 3,
      "text": "11.0 Acknowledgements..............................................49\n12.0 Author's Address..............................................49\n13.0 Full Copyright Statement......................................50",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1.0 Conventions Used in this Document",
      "section_title": true,
      "ja": "この文書で使用されている1.0表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119.",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14、RFC 2119に記載されるように解釈されます。"
    },
    {
      "indent": 3,
      "text": "MGCP identifiers are case-insensitive. This includes package names, event names, local connection options and other elements of the MGCP header.",
      "ja": "MGCP識別子は大文字と小文字を区別しません。これは、パッケージ名、イベント名、ローカル接続オプション及びMGCPヘッダの他の要素を含みます。"
    },
    {
      "indent": 0,
      "text": "2.0 Introduction",
      "section_title": true,
      "ja": "2.0はじめに"
    },
    {
      "indent": 3,
      "text": "The Media Gateway Control Protocol or MGCP [36] is used to control voice media gateways from external call control elements. Even though the bearer network might be IP, ATM, TDM or a mix of these, MGCP is transported over IP. Packages such as the MGCP CAS packages [38] are modular sets of parameters such as connection options, signal, event and statistics definitions that can be used to extend it into specific contexts. A related, IP-based mechanism for the description of ATM connections [18] has been generated by the IETF MMUSIC group. Due to the IP-centric nature of all aspects of the MGCP device control protocol, and for consistency with other MGCP package definitions, it is desirable to publish the MGCP ATM package in an IETF document.",
      "ja": "メディアゲートウェイコントロールプロトコルまたはMGCP [36]は、外部コール制御エレメントからの音声メディアゲートウェイを制御するために使用されます。ベアラネットワークは、IP、ATM、TDMまたはこれらの組み合わせであるかもしれないにもかかわらず、MGCPは、IP上で転送されます。そのようなMGCP CASパッケージ[38]などのパッケージは、特定のコンテキストにそれを拡張するために使用することができる接続オプション、信号、イベントおよび統計定義のようなパラメータのモジュラーセットです。 ATM接続の説明については、関連、IPベースのメカニズム[18] IETF MMUSICグループによって生成されました。 MGCPデバイス制御プロトコルのすべての側面のIP中心の性質上、他のMGCPパッケージの定義との整合性のために、IETF文書内のMGCP ATMパッケージを公開することが望ましいです。"
    },
    {
      "indent": 3,
      "text": "MGCP [36] allows the auditing of endpoints for package versions supported. The package version for the MGCP ATM package, as specified in this document, is 0. Even if the ATM package is the default package for some endpoints, the package prefix \"atm\" shall not be omitted in local connection option names, event names, signal names etc. If the ATM package is the default package for an endpoint, it will be listed as the first package in the audit response list. It is not necessary for the MGCP ATM package to be the default package for ATM to be supported on an endpoint.",
      "ja": "MGCPは、[36]サポートされているパッケージのバージョンのエンドポイントの監査を可能にします。 MGCP ATMパッケージのパッケージのバージョンは、この文書で指定されるように、ATMパッケージは、いくつかのエンドポイントのために、パッケージの接頭辞が「ATM」のローカル接続オプション名、イベント名を省略してはならないデフォルトのパッケージであっても0です。信号名などのATMパッケージは、エンドポイントのデフォルトのパッケージであるならば、それは監査応答リストの最初のパッケージとして表示されます。 MGCP ATMパッケージにはATMがエンドポイントでサポートされるようにするには、デフォルトのパッケージである必要はありません。"
    },
    {
      "indent": 3,
      "text": "The ATM package in this document consists of Local Connection Options (Section 3.0), Events and Signals (Section 4.0) and ATM Statistics Parameters (Section 5.0). Section 6.1 has guidelines for consistency in the use of Local Connection Options. Section 6.2 describes codec and profile negotiation. Section 7.0 addresses security considerations.",
      "ja": "この文書に記載されているATMパッケージは、ローカル接続オプション（セクション3.0）、イベントとシグナル（セクション4.0）とATMの統計パラメータ（セクション5.0）で構成されています。 6.1節は、ローカル接続オプションを使用することで一貫性のためのガイドラインを持っています。 6.2節は、コーデックとプロファイル交渉について説明します。セクション7.0アドレスのセキュリティの考慮事項。"
    },
    {
      "indent": 3,
      "text": "In the ATM networks addressed in this document, services are carried directly over ATM without an intervening IP layer. The Local Connection Options, Events, Signals and Statistics Parameters described in this section are not needed for VoIP calls which can be carried, in whole or in part, over an ATM network. In that case, the constructs defined elsewhere for IP are sufficient.",
      "ja": "ネットワークは、本書で扱わATMでは、サービスが介在IP層なしでATM上で直接実行されています。 VoIPはATMネットワーク上で、全体的または部分的に実施することができる呼び出すために、このセクションで説明するローカル接続オプション、イベント、シグナルおよび統計パラメータは必要ありません。その場合には、IPのために別の場所で定義された構築物は十分です。"
    },
    {
      "indent": 3,
      "text": "The ATM local connection option names, event names and signal names MUST always have an \"atm\" package prefix. Backward compatibility with older implementations that use X-atm as the package name is desirable.",
      "ja": "ATMローカル接続オプション名、イベント名と信号名は、常に「ATM」パッケージ接頭辞を持たなければなりません。パッケージ名としてX-ATMを使用する古い実装との下位互換性は望ましいです。"
    },
    {
      "indent": 3,
      "text": "MGCP grammar [36] must be followed with regard to the use of white spaces. The examples in this document attempt to follow MGCP grammar in this and all other respects.",
      "ja": "MGCP文法[36]ホワイトスペースの使用に関して従わなければなりません。この他のすべての点でMGCP文法に従うように、このドキュメントの試みの例。"
    },
    {
      "indent": 0,
      "text": "3.0 Local Connection Options",
      "section_title": true,
      "ja": "3.0ローカル接続オプション"
    },
    {
      "indent": 3,
      "text": "The Local Connection Options (LCOs) defined in this section are specific to ATM applications. Like other LCOs, these can be used in commands to create connections, modify connections and audit connections. However, unless noted otherwise below, they are not to be returned when an endpoint is audited for capabilities.",
      "ja": "このセクションで定義されたローカル接続オプション（LCOS）は、ATMアプリケーションに特有です。他のLCOSと同様に、これらは、接続および監査の接続を変更し、接続を作成するためのコマンドで使用することができます。そうでない場合は、以下の記載のない限り、しかし、彼らは、エンドポイントが機能するために監査されたときに返されることはありません。"
    },
    {
      "indent": 3,
      "text": "ATM Local Connection Options are divided into the following categories: ATM bearer connection, ATM adaptation layer, service layer, ATM bearer traffic management and AAL dimensioning.",
      "ja": "接続、ATMアダプテーション層、サービス層ベアラATM、トラフィック管理とAALの寸法ベアラATM：ATMローカル接続オプションは、次のカテゴリに分類されています。"
    },
    {
      "indent": 3,
      "text": "When parameter values are represented in decimal format, leading zeros are omitted.",
      "ja": "パラメータ値は10進数形式で表されている場合、先頭のゼロは省略されています。"
    },
    {
      "indent": 0,
      "text": "3.1 ATM Bearer Connection",
      "section_title": true,
      "ja": "3.1 ATMベアラコネクション"
    },
    {
      "indent": 3,
      "text": "These local connection options are used to parameterize ATM bearer connections.",
      "ja": "これらのローカル接続オプションは、ATMベアラ接続をパラメータ化するために使用されています。"
    },
    {
      "indent": 3,
      "text": "TABLE 1: Local Connection Options for ATM Bearers\n+---------+---------------+---------------------------------------+\n|  LCO    |    Meaning    |           Values                      |\n+---------+---------------+---------------------------------------+\n|   ct    | Connection    |AAL1, AAL1_SDT, AAL1_UDT, AAL2, AAL3/4,|\n|         | Type          |AAL5, USER_DEFINED_AAL                 |\n+---------+---------------+---------------------------------------+\n|   vc    |VC/Bearer type | PVC, SVC, CID                         |\n+---------+---------------+---------------------------------------+\n|   se    | Enable path   | on, off                               |\n|         | set-up        |                                       |\n+---------+---------------+---------------------------------------+\n|   ci    | Connection    | See below                             |\n|         | Element       |                                       |\n|         | Identifier    |                                       |\n+---------+---------------+---------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Connection type (ct): This parameter describes the ATM adaptation layer. The values that can be assigned to it are: AAL1, AAL1_SDT, AAL1_UDT, AAL2, AAL3/4, AAL5 and USER_DEFINED_AAL. The user defined adaptation layer is per amendment 2 of ITU-T Q.2931.",
      "ja": "接続タイプ（CT）：このパラメータは、ATMアダプテーション層が記載されています。それに割り当てることができる値は、次のとおりAAL1、AAL1_SDT、AAL1_UDT、AAL2、AAL3 / 4、AAL5とUSER_DEFINED_AAL。ユーザ定義のアダプテーション層は、ITU-T Q.2931の改正2当たりです。"
    },
    {
      "indent": 3,
      "text": "Type of Bearer/VC (vc): This indicates whether a PVC, CID or an SVC is to be used for an ATM connection. Possible values are: PVC, SVC or CID. Omitting this parameter will result in the use of a default, which could be embedded or provisioned. The value \"PVC\" covers both classical PVCs and SPVCs. The value \"CID\" covers subchannels within AAL1 [35] and AAL2 [10] virtual circuits. A value of \"SVC\" for atm/vc does not necessarily imply that the addressed media gateway should initiate signaling for bearer set-up, since this might be done by another node such as the far-end media gateway.",
      "ja": "ベアラ/ VC（VC）の種類：これはPVC、CIDまたはSVCは、ATM接続に使用されるべきかどうかを示します。可能な値は以下のとおりです。PVC、SVCまたはCID。このパラメータを省略すると、埋め込みまたはプロビジョニングすることができ、デフォルトの使用になります。値「PVC」は、古典的なPVCおよびSPVCの両方をカバーしています。値 \"CID\" は、AAL1 [35]及びAAL2 [10]仮想回路内のサブチャネルをカバーします。 ATM / VCの「SVC」の値は、必ずしもこのような遠端メディアゲートウェイなどの他のノードによって行われるかもしれないので、アドレス指定され、メディアゲートウェイは、ベアラセットアップのためのシグナリングを開始すべきことを意味するものではありません。"
    },
    {
      "indent": 3,
      "text": "Enable path set-up (se): This local connection option is used to explicitly enable or disable the use of bearer signaling for path set-up. Permitted values of this local connection option are \"on\" and \"off\". Examples of bearer signaling are SVC signaling, ITU Q.2630.1 signaling and combinations thereof. Examples of such combinations are the set-up of an AAL2 SVC and the assignment of a CID within it or the set-up of a concatenation of an AAL2 single-CID SVC and a CID channel within a multiplexed AAL2 VC. This parameter can be used with both the backward and forward bearer connection set-up methods. In the former case, the call-terminating gateway sets up the bearer connection. In the latter case, the call-originating gateway sets up the bearer connection.",
      "ja": "パスのセットアップ（SE）を有効にする：このローカル接続オプションは、明示的にパスのセットアップのためのベアラシグナリングの使用を有効または無効にするために使用されます。このローカル接続オプションの許容値は、「オン」と「オフ」です。ベアラシグナリングの例は、SVCシグナリング、ITU Q.2630.1シグナリングおよびそれらの組み合わせです。このような組み合わせの例としては、AAL2 SVCのセットアップとその中のCIDまたはAAL2シングルCID SVCの連結及び多重AAL2 VC内のCIDチャネルのセットアップの割り当てです。このパラメータは、両方の前後ベアラ接続セットアップ方法で使用することができます。前者の場合、呼終端ゲートウェイは、ベアラ接続を設定します。後者の場合には、呼発信ゲートウェイは、ベアラ接続を設定します。"
    },
    {
      "indent": 3,
      "text": "This option may or may not be used in conjunction with atm/sc event notification. When this option and the atm/sc event notification are omitted, creating and modifying connection commands, the call agent is deferring any relevant decision to set up an ATM or AAL2 connection to the media gateways. In the absence of this parameter, a media gateway's autonomous decision to set up an ATM or AAL2 path via bearer signaling depends on default/provisioned behaviors, such as the applicability and nature (backward/forward) of a bearer connection set-up model, the network type ('nt'), connection type ('atm/ct') and bearer type/VC ('atm/vc') local connection options, and the media gateway's awareness of whether it is the originating gateway or terminating gateway in a call. This awareness may be based on the presence or absence of an SDP remote connection descriptor in the initial create connection command.",
      "ja": "このオプションは、またはATM / SCイベント通知と併せて使用してもしなくてもよいです。このオプションとATM / SCイベント通知は、接続コマンドを作成および修正、省略されている場合は、コールエージェントは、メディアゲートウェイにATMまたはAAL2接続を設定するには関連するすべての意思決定を延期しています。ベアラシグナリングは、ベアラコネクションセットアップモデルの適用性及び性質（逆方向/順方向）として、デフォルト/プロビジョニングされた行動に依存介してこのパラメータの非存在下で、メディアゲートウェイの自律的な決定は、ATMまたはAAL2パスを設定するために、ネットワークタイプ（「NT」）、接続タイプ（「ATM / CT」）とベアラタイプ/ VC（「ATM / VC」）ローカル接続オプション、それが発信ゲートウェイ又は終端ゲートウェイであるかどうかのメディアゲートウェイの意識呼び出し。この意識は、接続コマンドを作成して初期におけるSDPのリモート接続記述子の有無に基づくことができます。"
    },
    {
      "indent": 3,
      "text": "Connection Element Identifier (ci): This indicates the Virtual Circuit or CID to be used for the bearer connection. It is used when the call agent manages VC and/or CID resources in the bearer network.",
      "ja": "接続エレメントID（CI）：これは、ベアラ接続のために使用される仮想回線又はCIDを示します。コールエージェントは、ベアラネットワークにVCおよび/またはCIDリソースを管理するときに使用されます。"
    },
    {
      "indent": 3,
      "text": "The ci parameter can be in one of the following formats:",
      "ja": "CIパラメータは、次のいずれかの形式にすることができます。"
    },
    {
      "indent": 6,
      "text": "* VCCI-<vcci> * VCCI-<vcci>/CID-<cid> * <ATMaddressType>-<ATMaddress>/VCCI-<vcci> * <ATMaddress>/VCCI-<vcci> * <ATMaddressType>-<ATMaddress>/VCCI-<vcci>/CID-<cid> * <ATMaddress>/VCCI-<vcci>/CID-<cid> * BCG-<bcg>/VCCI-<vcci> * BCG-<bcg>/VCCI-<vcci>/CID-<cid> * BCG-<bcg>/VPI-<vpi>/VCI-<vci> * BCG-<bcg>/VPI-<vpi>/VCI-<vci>/CID-<cid> * PORT-<portId>/VPI-<vpi>/VCI-<vci> * PORT-<portId>/VPI-<vpi>/VCI-<vci>/CID-<cid> * VPCI-<vpci>/VCI-<vci> * VPCI-<vpci>/VCI-<vci>/CID-<cid> * <ATMaddressType>-<ATMaddress>/VPCI-<vpci>/VCI-<vci> * <ATMaddress>/VPCI-<vpci>/VCI-<vci> * <ATMaddressType>-<ATMaddress>/VPCI-<vpci>/VCI-<vci>/CID-<cid> * <ATMaddress>/VPCI-<vpci>/VCI-<vci>/CID-<cid>",
      "ja": "* VCCI- <VCCI> * VCCI- <VCCI> / CID-の<cid> * <ATMaddressType>  -  <ATMADDRESS> / VCCI- <VCCI> * <ATMADDRESS> / VCCI- <VCCI> * <ATMaddressType>  -  <ATMADDRESS> / VCCI- <VCCI> / CID-の<cid> * <ATMADDRESS> / VCCI- <VCCI> / CID-の<cid> * BCG- <BCG> / VCCI- <VCCI> * BCG- <BCG> / VCCI- < VCCI> / CID-の<cid> * BCG- <BCG> / VPI- <VPI> / VCI- <VCI> * BCG- <BCG> / VPI- <VPI> / VCI- <VCI> / CID-の<cid> * PORT- <PORTID> / VPI- <VPI> / VCI- <VCI> * PORT- <PORTID> / VPI- <VPI> / VCI- <VCI> / CID-の<cid> * VPCI- <VPCI> / VCI -  <VCI> * VPCI- <VPCI> / VCI- <VCI> / CID-の<cid> * <ATMaddressType>  -  <ATMADDRESS> / VPCI- <VPCI> / VCI- <VCI> * <ATMADDRESS> / VPCI- < VPCI> / VCI- <VCI> * <ATMaddressType>  -  <ATMADDRESS> / VPCI- <VPCI> / VCI- <VCI> / CID-の<cid> * <ATMADDRESS> / VPCI- <VPCI> / VCI- <VCI> / CID-の<cid>"
    },
    {
      "indent": 3,
      "text": "The subparameters of the ci parameter are defined as follows:",
      "ja": "次のようにCIパラメータのサブパラメータが定義されています。"
    },
    {
      "indent": 3,
      "text": "|--------------|-----------------------|----------------------------|\n| Subparameter |    Meaning            |   Representation           |\n|--------------|-----------------------|----------------------------|\n|     vcci     | VC connection Id      | Decimal Integer            |\n|              |                       | (16-bit equivalent)        |\n|--------------|-----------------------|----------------------------|\n|     cid      | Channel Id            | Decimal Integer            |\n|              |                       | (8-bit equivalent)         |\n|--------------|-----------------------|----------------------------|\n|ATMaddressType| ATM address type      | \"NSAP\", \"E164\", \"GWID\",    |\n|              |                       | \"ALIAS\"                    |\n|--------------|-----------------------|----------------------------|\n| ATMaddress   | ATM address           | 40 hex digits   (\"NSAP\")   |\n|              |                       | upto 15 digits (\"EI64\")    |\n|              |                       | upto 32  chars (\"GWID\")    |\n|              |                       | upto 32  chars (\"ALIAS\")   |\n|--------------|-----------------------|----------------------------|\n|    bcg       |Bearer Connection Group| Decimal Integer            |\n|              |                       | (8-bit equivalent)         |\n|--------------|-----------------------|----------------------------|\n|    vpi       |    Virtual Path Id    | Decimal Integer            |\n|              |                       | (8 or 12-bit equivalent)   |\n|--------------|-----------------------|----------------------------|\n|    vci       |    Virtual Channel Id | Decimal Integer            |\n|              |                       | (16-bit equivalent)        |\n|--------------|-----------------------|----------------------------|\n|    portID    |    Port Id            | Decimal Integer            |\n|              |                       | (32-bit equivalent)        |\n|--------------|-----------------------|----------------------------|\n|    vpci      |    VP connection ID   | Decimal Integer            |\n|              |                       | (16-bit equivalent)        |\n|--------------|-----------------------|----------------------------|",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The CID, or Channel ID, can refer to AAL1 as well as AAL2 applications. In AAL1 applications based on [35], it refers to the octet position, starting from one, within an n x 64 SDT frame.",
      "ja": "CID、またはチャネルIDは、AAL1と同様にAAL2アプリケーションを参照することができます。 [35]に基づいて、AAL1アプリケーションでは、これは、n×64 SDTフレーム内で、1から始まる、オクテット位置を指します。"
    },
    {
      "indent": 3,
      "text": "The VPCI is a 16 bit field defined in Section 4.5.16 of ITU Q.2931. The VPCI is similar to the VPI, except for its width and the fact that it retains its value across VP crossconnects.",
      "ja": "VPCIは、ITU Q.2931のセクション4.5.16で定義された16ビットのフィールドです。 VPCIは、その幅と、それはVPのクロスコネクト全体でその値を保持しているという事実を除いて、VPIに似ています。"
    },
    {
      "indent": 3,
      "text": "The VCCI is a 16 bit field defined in ITU Recommendation Q.2941.2 [14]. The VCCI is similar to the VCI, except for the fact that it retains its value across VC crossconnects.",
      "ja": "VCCIは、ITU勧告Q.2941.2 [14]で定義された16ビットのフィールドです。 VCCIは、それがVCクロスコネクト全体でその値を保持しているという事実を除いて、VCIに似ています。"
    },
    {
      "indent": 3,
      "text": "In general, <vpci> and <vcci> values are unique between a pair of nodes. When they are unique between a pair of nodes, but not unique within a network, they need to be qualified at any node, by the ATM address of the remote node. These parameters can be pre-provisioned or signaled via SVC signaling messages. When VPCI and VCCI values are pre-provisioned, administrations have the option of provisioning them uniquely in a network. In this case, the ATM address of the far end is not needed to qualify these parameters.",
      "ja": "一般に、<VPCI>と<VCCI>の値は、ノードの対の間の独特です。これらは、ノードの対の間のユニークが、ネットワーク内で一意でない場合、それらは、リモートノードのATMアドレスによって、任意のノードで修飾される必要があります。これらのパラメータは、事前プロビジョニングまたはSVCシグナリングメッセージを介してシグナリングすることができます。 VPCIとVCCIの値が事前にプロビジョニングされている場合には、投与は、ネットワーク内で一意にプロビジョニングするオプションがあります。この場合、遠端のATMアドレスは、これらのパラメータを修飾する必要はありません。"
    },
    {
      "indent": 3,
      "text": "The <portId> parameter is used to identify the physical trunk port on an ATM module. It can be represented as a decimal or hex number of up to 32 digits.",
      "ja": "<PORTID>パラメータは、ATMモジュール上の物理トランクポートを識別するために使用されます。それは、最大32桁の10進数または16進数の数として表すことができます。"
    },
    {
      "indent": 3,
      "text": "In some applications, it is meaningful to bundle a set of connections between a pair of ATM nodes into a bearer connection group. The <bcg> subparameter is an eight bit field that allows the bundling of up to 255 VPCs or VCCs.",
      "ja": "いくつかの用途では、ベアラ接続グループにATMノードのペア間の接続のセットをバンドルすることが有意義です。 <BCG>サブパラメータには、最大255件のVPCまたはのVCCのバンドルを可能にする8ビットのフィールドです。"
    },
    {
      "indent": 3,
      "text": "In some applications, it is necessary to wildcard some elements of the ci local connection option. The \"$\" wildcard character can be substituted for some of the terms of this parameter. While wildcarding, the constant strings that qualify the terms in the ci parameter are retained. The concatenation <ATMaddressType>- <ATMaddress> can be wildcarded in the following ways:",
      "ja": "一部のアプリケーションでは、CIのローカル接続オプションのいくつかの要素をワイルドカードが必要です。 「$」ワイルドカード文字は、このパラメータの用語のいくつかのために置換することができます。ワイルドカードが、CIパラメータの条項に資格定数文字列が保持されます。連結<ATMaddressType>  -  <ATMADDRESS>は、次の方法でワイルドカードすることができます。"
    },
    {
      "indent": 6,
      "text": "* The entire concatenation, <ATMaddressType>-<ATMaddress>, is replaced with a \"$\". * <ATMaddress> is replaced with a \"$\", but <ATMaddressType> is not.",
      "ja": "*全体の連結は、<ATMaddressType>  -  <ATMADDRESS>、 \"$\" に置き換えられています。 * <ATMADDRESS> \"$\" に置き換えられますが、<ATMaddressType>がありません。"
    },
    {
      "indent": 3,
      "text": "Examples of wildcarding the ci parameter in the AAL1 and AAL5 contexts are: VCCI-$, BCG-100/VPI-20/VCI-$.",
      "ja": "AAL1とAAL5文脈でCIパラメータをワイルドカードの例は以下のとおりです。VCCI- $、BCG-100 / VPI-20 / VCI- $。"
    },
    {
      "indent": 3,
      "text": "Examples of wildcarding the ci parameter in the AAL2 context are: VCCI- 40/CID-$, BCG-100/VPI-20/VCI-120/CID-$.",
      "ja": "AAL2コンテキストでCIパラメータをワイルドカードの例は、VCCI- 40 / CID- $、BCG-100 / VPI-20 / VCI-120 / CID- $。"
    },
    {
      "indent": 3,
      "text": "If the addressType is NSAP, the address is expressed in the standard dotted hex form. This is a string of 40 hex digits, with dots after the 2nd, 6th, 10th, 14th, 18th, 22nd, 26th, 30th, 34th and 38th digits. The \"0x\" prefix is not used, since this is always represented in hex. The last octet of the NSAP address is the 'selector' field that is available for non-standard use. For example:",
      "ja": "addressType型がNSAPである場合、アドレスは標準点線進形式で表現されます。これは第二、第六、10日、14日、18日、22日、26日、30日、第34回と第38回の数字の後にドットで、40進数の文字列です。これは、常に進で表現されているのでプレフィクス「0x」は、使用されていません。 NSAPアドレスの最後のオクテットは、非標準的な使用のために利用可能である「セレクタ」フィールドです。例えば："
    },
    {
      "indent": 2,
      "text": "L: atm/ci:NSAP-47.0091.8100.0000.0060.3e64.fd01.0060.3e64.fd01.00/ VCCI-65",
      "ja": "L：ATM /たち：NSAP-47.0091.8100.0000.0060.3e64.fd01.0060.3e64.fd01.00 / VCCI-65"
    },
    {
      "indent": 3,
      "text": "If the ATMaddressType is E164, the ATMaddress is expressed as a decimal number with up to 15 digits. For example:",
      "ja": "ATMアドレスタイプE 164である場合、ATMアドレスは、最大15桁の10進数として表現されます。例えば："
    },
    {
      "indent": 6,
      "text": "L: atm/ci:E164-9738294382/VCCI-100",
      "ja": "L：ATM /おE164-9738294382 / VCCI-100"
    },
    {
      "indent": 3,
      "text": "The E.164 numbers used can be in the International Format E.164 or conform to a private numbering plan.",
      "ja": "使用E.164番号は、国際フォーマットのE.164であるか、またはプライベート番号計画に適合することができます。"
    },
    {
      "indent": 3,
      "text": "If the ATMaddressType is GWID, it means that the address is a Gateway Identifier or Node Alias. This may or may not be globally unique. In this format, the ATMaddress is expressed as an alphanumeric string (\"A\"-\"Z\", \"a\"-\"z\", \"0\" - \"9\",\".\",\"-\",\"_\"). For example:",
      "ja": "ATMaddressTypeがGWIDであれば、それはアドレスがゲートウェイの識別子またはノードの別名であることを意味しています。これは、またはグローバルに一意であってもなくてもよいです。この形式では、ATMADDRESSは、英数字の文字列（ -  \"Z\"、 \"A\"  -  \"Z\"、 \"0\"  -  \"9\"、 \"\" \" - \"、 \"_\" \"A\"）として表現されます。例えば："
    },
    {
      "indent": 7,
      "text": "L: atm/ci:GWID-officeABCmgx101vism12",
      "ja": "L：ATM / CI：GWID-officeABCmgx101vism12"
    },
    {
      "indent": 3,
      "text": "The keyword \"ALIAS\" can be substituted for \"GWID\". For example:",
      "ja": "キーワード「ALIASは」「GWID」の代わりに使用することができます。例えば："
    },
    {
      "indent": 7,
      "text": "L: atm/ci:ALIAS-officeABCmgx101vism12",
      "ja": "L：ATM / CI：ALIAS-officeABCmgx101vism12"
    },
    {
      "indent": 3,
      "text": "An example of a GWID (ALIAS) is the CLLI code used for telecom equipment. For all practical purposes, it should be adequate for the GWID (ALIAS) to be a variable length string with a maximum size of 32 characters.",
      "ja": "GWID（エイリアス）の例では、通信機器に使用されるCLLIコードです。 GWID（別名）32文字の最大サイズが可変長の文字列であるためにすべての実用的な目的のために、それが適切であるべきです。"
    },
    {
      "indent": 3,
      "text": "When an endpoint supporting the ATM package is audited for capabilities, the following local connection options from Section 3.1 shall be returned: connection type (atm/ct) and VC/bearer type (atm/vc). If more than one value is supported, these shall be expressed as a list of semicolon-separated values. Although this is not very useful, it is permissible for these values to have overlapping semantics (e.g., AAL1 and AAL1_SDT). An example of returning, in audit response, the local connection options defined in Section 3.1 is:",
      "ja": "ATMパッケージを支える終点が機能するために監査されている場合は、3.1節から次のローカル接続オプションが返されなければならない：接続タイプ（気圧/ CT）およびVC /ベアラタイプ（ATM / VCを）。複数の値がサポートされている場合、これらはセミコロンで区切られた値のリストとして表現されなければなりません。これは非常に便利ではありませんが、これらの値は重複セマンティクス（例えば、AAL1とAAL1_SDT）を持っているために許されています。監査応答して、復帰の例は、セクション3.1で定義されたローカル接続オプションがあります。"
    },
    {
      "indent": 6,
      "text": "A: atm/ct:AAL1_SDT;AAL2, atm/vc:PVC;CID",
      "ja": "：ATM / CT：AAL1_SDT、AAL2、ATM / VC：PVC、CID"
    },
    {
      "indent": 0,
      "text": "3.2 ATM Adaptation Layer (AAL)",
      "section_title": true,
      "ja": "A.oはなかったOdbtaatリア（）"
    },
    {
      "indent": 3,
      "text": "These local connection options are used to parameterize the ATM adaptation layer (AAL). These are further classified as: generic AAL connection options, AAL1-related connection options and AAL2-related connection options. Currently, there are no local connection options defined in this category that pertain to AAL5.",
      "ja": "これらのローカル接続オプションは、ATMアダプテーションレイヤ（AAL）をパラメータ化するために使用されています。一般的なAAL接続オプション、AAL1関連の接続オプションとAAL2関連の接続オプション：これらは、さらにとして分類されています。現在、AAL5に関係するこのカテゴリで定義されたローカル接続オプションはありません。"
    },
    {
      "indent": 3,
      "text": "TABLE 2: Generic Local Connection Options for the AAL\n+---------+---------------+---------------------------------------+\n|  LCO    |    Meaning    |           Values                      |\n+---------+---------------+---------------------------------------+\n| aalApp  | Application   |itu_h323c,af83,AAL5_SSCOP,             |\n|         |               |itu_i3661_unassured, itu_i3661_assured |\n|         |               |itu_i3662, itu_i3651, itu_i3652,       |\n|         |               |itu_i3653, itu_i3654,                  |\n|         |               |FRF5, FRF8, FRF11,itu_h2221            |\n+---------+---------------+---------------------------------------+\n|   sbc   | Subchannel    | 1...24 for T1-based applications      |\n|         | Count         | 1...31 for E1-based applications      |\n+---------+---------------+---------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "AAL application (aalApp): This connection option specifies the controlling standard for an application layer above the ATM adaptation layer. Other strings can be defined. If used, these need to be prefixed with an \"X-\".",
      "ja": "AALアプリケーション（aalApp）：この接続オプションは、ATMアダプテーションレイヤ上のアプリケーション層のための制御規格を指定します。他の文字列を定義することができます。使用している場合、これらは「X-」で始まるする必要があります。"
    },
    {
      "indent": 6,
      "text": "\"itu_h323c\" Annex C of H.323 which specifies direct RTP on AAL5 [12].",
      "ja": "AAL5 [12]に直接RTPを指定するH.323の \"itu_h323c\" 附属書C。"
    },
    {
      "indent": 6,
      "text": "\"af83\" af-vtoa-0083.001, which specifies variable size AAL5 PDUs with PCM voice and a null SSCS [13].",
      "ja": "\"af83\" AF-VTOA-0083.001、PCM音声及びヌルSSCS [13]を用いて可変サイズAAL5 PDUを特定します。"
    },
    {
      "indent": 6,
      "text": "\"AAL5_SSCOP\" SSCOP as defined in ITU Q.2110 [14] running over an AAL5 CPS [27]. No information is provided regarding any layers above SSCOP such as Service Specific Coordination Function (SSCF) layers.",
      "ja": "\"AAL5_SSCOP\" SSCOP AAL5 CPS [27]上で実行されている[14] ITU Q.2110で定義されています。何の情報は、サービス依存コーディネーション機能（SSCF）層としてSSCOP上記の任意の層について提供されていません。"
    },
    {
      "indent": 6,
      "text": "\"itu_i3661_unassured\" SSCS with unassured transmission, per ITU I.366.1 [11].",
      "ja": "ITU I.366.1 [11]あたり、unassured送信とSSCS \"をitu_i3661_unassured\"。"
    },
    {
      "indent": 6,
      "text": "\"itu_i3661_assured\" SSCS with assured transmission, per ITU I.366.1 [11]. This uses SSCOP [14].",
      "ja": "ITU I.366.1 [11]あたり、保証伝送とSSCS \"をitu_i3661_assured\"。これは、SSCOP [14]を使用しています。"
    },
    {
      "indent": 6,
      "text": "\"itu_i3662\" SSCS per ITU I.366.2 [2].",
      "ja": "ITU SSCS I.366.2当たり \"Itu_i3662\" [2]。"
    },
    {
      "indent": 6,
      "text": "\"itu_i3651\" Frame relay SSCS per ITU I.365.1 [15].",
      "ja": "\"Itu_i3651\" フレームリレーITUあたりSSCS I.365.1 [15]。"
    },
    {
      "indent": 6,
      "text": "\"itu_i3652\" Service-specific coordination function, as defined in ITU I.365.2, for Connection Oriented Network Service (SSCF-CONS) [16]. This uses SSCOP [14].",
      "ja": "コネクション型ネットワークサービス（SSCF-CONS）のために、ITU I.365.2で定義される \"itu_i3652\" サービス固有の調整機能、[16]。これは、SSCOP [14]を使用しています。"
    },
    {
      "indent": 6,
      "text": "\"itu_i3653\" Service-specific coordination function, as defined in ITU I.365.3, for Connection Oriented Transport Service (SSCF-COTS) [17]. This uses SSCOP [14].",
      "ja": "コネクション指向トランスポートサービス（SSCF-COTS）[17]のために、ITU I.365.3で定義される \"itu_i3653\" サービス固有の調整機能、。これは、SSCOP [14]を使用しています。"
    },
    {
      "indent": 6,
      "text": "\"itu_i3654\" Service-specific coordination function, as defined in ITU I.365.4 [28].",
      "ja": "ITU I.365.4 [28]で定義されるように「itu_i3654」サービス固有の調整機能、。"
    },
    {
      "indent": 6,
      "text": "\"FRF5\" Use of the FRF.5 frame relay standard [23], which references ITU I.365.1 [15].",
      "ja": "ITU I.365.1 [15]を参照FRF.5フレームリレー標準[23]の \"FRF5\" 使用。"
    },
    {
      "indent": 6,
      "text": "\"FRF8\" Use of the FRF.8 frame relay standard [24]. This implies a null SSCS and the mapping of the frame relay header into the ATM header.",
      "ja": "FRF.8フレームリレー標準[24]の「FRF8」使用。これはヌルSSCSとATMヘッダにフレームリレーヘッダのマッピングを意味しています。"
    },
    {
      "indent": 6,
      "text": "\"FRF11\" Use of the FRF.11 frame relay standard [25].",
      "ja": "FRF.11フレームリレー標準[25]の「FRF11」使用。"
    },
    {
      "indent": 6,
      "text": "\"itu_h2221\" Use of the ITU standard H.222.1 for audiovisual communication over AAL5 [22].",
      "ja": "AAL5上視聴覚通信のためのITU標準H.222.1の「itu_h2221」使用[22]。"
    },
    {
      "indent": 3,
      "text": "Subchannel count (sbc): This parameter indicates the number of DS0s in an n x 64 connection. Such connections use an ATM adaptation layer 1 (ATM forum af-vtoa-78) or 2 (ITU I.366.2). For T1-based applications, it can take on integral values in the inclusive range [1...24]. For E1-based applications, it can take on integral values in the inclusive range [1...31]. When this parameter is omitted, the subchannel count must be known by other means.",
      "ja": "サブチャネル数（SBC）：このパラメータは、X 64接続nはDS0の数を示します。そのような接続は、ATMアダプテーションレイヤ1（ATMフォーラムAF-VTOA-78）または2（ITU I.366.2）を使用します。 T1ベースのアプリケーションのために、それが包含範囲[1 ... 24]の積分値を取ることができます。 E1ベースのアプリケーションでは、包括的な範囲[1 ... 31]に整数値を取ることができます。このパラメータが省略されている場合、サブチャネル数は、他の手段によって知られなければなりません。"
    },
    {
      "indent": 3,
      "text": "TABLE 3: Local Connection Options for AAL Type 1\n+---------+---------------+---------------------------------------+\n|  LCO    |    Meaning    |           Values                      |\n+---------+---------------+---------------------------------------+\n|   pf    | Partial fill  | 1...48                                |\n|         |               |                                       |\n+---------+---------------+---------------------------------------+\n|   crt   | Clock Recovery|  NULL, SRTS, ADAPTIVE                 |\n|         | Type          |                                       |\n+---------+---------------+---------------------------------------+\n|   fe    | FEC enable    | NULL, DELAY_SENSITIVE,LOSS_SENSITIVE  |\n+---------+---------------+---------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Partial Fill Count (pf): When present, the 'pf' parameter is used to indicate the fill level of cells. When this local connection option is absent, then other means (such as provisionable defaults) are used to determine the presence and level of partial fill.",
      "ja": "パーシャルフィルカウント（PF）：「PF」パラメータは、細胞の充填レベルを示すために使用される存在。このローカル接続オプションが存在しない場合、その後、（例えばプロビジョニングデフォルトのような）他の手段は、部分充填の存在およびレベルを決定するために使用されます。"
    },
    {
      "indent": 3,
      "text": "This parameter indicates the number of non-pad payload octets, not including any AAL SAR or convergence sublayer octets. For example, in some AAL1 applications that use partially filled cells with padding at the end, this attribute indicates the number of leading payload octets not including any AAL overhead.",
      "ja": "このパラメータは、任意のAAL SAR又は収束サブレイヤオクテットを含まない非パッドペイロードのオクテットの数を示します。例えば、最後のパディングで部分的に充填されたセルを使用するいくつかのAAL1アプリケーションでは、この属性は、任意のAALオーバーヘッドを含まない主要ペイロードのオクテットの数を示します。"
    },
    {
      "indent": 3,
      "text": "In general, permitted values of the pf parameter are integers in the range 1 - 48 inclusive. However, this upper bound is different for different adaptations since the AAL overhead, if any, is different. If a specified partial fill (e.g. 47) is greater than or equal to the maximum fill (in this example, 46 for AAL1 P-cells), then complete fill (46 in this example) is used. Using a 'partial' fill of 48 effectively disables partial fill. Values below or above the permissible range of 1-48 MUST be rejected with an error code of 532 {Unsupported value(s) in LocalConnectionOptions}.",
      "ja": "包括48  - 一般的には、PFパラメータの許容値は、範囲1の整数です。しかし、いずれの場合には、この上限は、AALオーバーヘッド以来、さまざまな適応のために異なっている、異なっています。指定されたパーシャルフィル（例えば47）よりも大きいか（AAL1 P細胞は、この例では、46）最大充填に等しい場合、完全な充填（この例では46）が使用されます。 48の「部分的」塗りつぶしを使用すると、効果的に部分充填を無効にします。 1-48の許容範囲以下または以上の値が{LocalConnectionOptionsでサポートされていない値（S）} 532のエラーコードで拒否されなければなりません。"
    },
    {
      "indent": 3,
      "text": "In the AAL1 context, this parameter applies uniformly to both P and non-P cells. In AAL1 applications that do not distinguish between P and non-P cells, a value of 47 indicates complete fill (i.e., the absence of partial fill). In AAL1 applications that distinguish between P and non-P cells, a value of 46 indicates no padding in P-cells and a padding of one in non-P cells.",
      "ja": "AAL1の文脈では、このパラメータはPと非P細胞の両方に均一に適用されます。 Pと非P細胞を区別しないAAL1アプリケーションで、47の値は、完全な充填（パーシャルフィルの、すなわち、非存在）を示します。 Pおよび非P細胞を区別AAL1アプリケーションで、46の値は、P-細胞および非P細胞中の1つのパディングでパディングがないことを示します。"
    },
    {
      "indent": 3,
      "text": "If partial fill is enabled (i.e., there is padding in at least some cells), then AAL1 structures must not be split across cell boundaries. These shall fit in any cell. Hence, their size shall be less than or equal to the partial fill size. Further, the partial fill size is preferably an integer multiple of the structure size. If it is not, then the partial fill size stated in the local connection options shall be truncated to an integer multiple of the structure size (e.g., a partial fill size of 40 is truncated to 36 to support six 6 x 64 channels).",
      "ja": "部分充填が有効になっている場合（すなわち、少なくともいくつかの細胞内でのパディングがあります）、その後、AAL1構造は、セルの境界を越えて分割してはいけません。これらは、任意のセルに収まるものとします。したがって、それらのサイズは、パーシャルフィルサイズ以下でなければなりません。さらに、パーシャルフィルサイズは、好ましくは、構造サイズの整数倍です。そうでない場合、ローカル接続オプションに記載されたパーシャルフィルサイズ（例えば、40の部分的充填サイズを6つの6×64チャネルをサポートするために、36に切り捨てられる）構造サイズの整数倍に切り捨てなければなりません。"
    },
    {
      "indent": 3,
      "text": "Clock recovery type (crt): This is used in AAL1 UDT (unstructured data transfer) applications only. It can be assigned the values: \"NULL\", \"SRTS\", or \"ADAPTIVE\". A value of \"NULL\" is equivalent to omitting this parameter and implies that the stream (T1 or E1) encapsulated in ATM is either synchronous to the ATM network or is re-timed, before AAL1 encapsulation, via slip buffers. The default value used in the absence of this LCO can be hardcoded or provisioned.",
      "ja": "クロック・リカバリ・タイプ（CRT）：これは、AAL1 UDT（非構造化データ転送）のみのアプリケーションで使用されています。 「NULL」、「SRTS」、または「適応」：これは、値を割り当てることができます。 「NULL」の値は、このパラメータを省略すると等価であり、ATM中にカプセル化ストリーム（T1またはE1）は、いずれかのATM網に同期し又はスリップバッファを介して、AAL1カプセル化の前に、再タイミングであることを意味します。このLCOが存在しない場合に使用されるデフォルト値はハードコードまたはプロビジョニングすることができます。"
    },
    {
      "indent": 3,
      "text": "Forward Error Correction Enable (fe): This indicates whether FEC, as defined in ITU I.363.1 [1], is enabled or not. Possible values are: \"NULL\", \"DELAY_SENSITIVE\" and \"LOSS_SENSITIVE\". FEC can be enabled differently for delay-sensitive and loss-sensitive connections. A \"NULL\" value implies disabling FEC for an AAL1 connection.",
      "ja": "前方誤り訂正（FE）を有効にする：これは、ITU I.363.1 [1]で定義されるようにFECは、イネーブルされているか否かを示します。可能な値は以下のとおりです。「NULL」、「DELAY_SENSITIVE」と「LOSS_SENSITIVE」。 FECは、遅延に敏感と損失に敏感な接続のために別々に有効にすることができます。 「NULL」値はAAL1接続のためにFECを無効にすることを意味します。"
    },
    {
      "indent": 3,
      "text": "TABLE 4: Local Connection Options for AAL Type 2\n+---------+---------------+---------------------------------------+\n|  LCO    |    Meaning    |           Values                      |\n+---------+---------------+---------------------------------------+\n|   pfl   | Profile List  |  See below                            |\n|         |               |                                       |\n+---------+---------------+---------------------------------------+\n| smplCPS | Simplified CPS|  on, off                              |\n|         | [21]          |                                       |\n+---------+---------------+---------------------------------------+\n|   tmcu  | Combined use  | Integer microseconds                  |\n|         | timer         | (32-bit equivalent)                   |\n+---------+---------------+---------------------------------------+\n|  aalsap |Service access | AUDIO, MULTIRATE                      |\n|         |point          |                                       |\n+---------+---------------+---------------------------------------+\n|   cktmd | Circuit mode  | on, off                               |\n|         |               |                                       |\n+---------+---------------+---------------------------------------+\n|   frmd  | Frame mode    | on,off                                |\n|         | enable        |                                       |\n+---------+---------------+---------------------------------------+\n| genpcm  | Generic PCM   | PCMA, PCMU                            |\n|         | setting       |                                       |\n+---------+---------------+---------------------------------------+\n|  ted    | Transmission  | on,off                                |\n|         |error detection|                                       |\n+---------+---------------+---------------------------------------+\n|rastimer | SSSAR         |                                       |\n|         | reassembly    | Integer microseconds                  |\n|         | timer         | (32-bit equivalent)                   |\n+---------+---------------+---------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Profile List (pfl): This is a list of profiles. Profile types are followed by profile numbers for each type. The ordering of profiles can imply preference, with the most preferred profile first. There can be multiple instances of the same profile type in this list. Spaces are used as delimiters within this list. Therefore, to comply with MGCP syntax [36], it is necessary to enclose this list in double quotes.",
      "ja": "プロフィール一覧（PFL）：これは、プロファイルのリストです。プロファイルタイプは各タイプ用のプロファイル番号が続いています。プロファイルの順序は、最初に、最も好ましいプロファイルで、好みを暗示することができます。このリスト内の同じプロファイルタイプの複数のインスタンスが存在する場合があります。スペースは、このリスト内の区切り文字として使用されています。したがって、[36] MGCP構文に準拠するために、二重引用符でこのリストを囲むことが必要です。"
    },
    {
      "indent": 3,
      "text": "The format of the pfl parameter is as follows:",
      "ja": "次のようにPFLパラメータの形式は、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "\"<profileType#1><format list#1><profileType#2><format list#2> ... <profileType #M><format list#M>\"",
      "ja": "\"<profileTypeが＃1> <フォーマットリスト＃1> <profileTypeが＃2> <フォーマットリスト＃2> ... <profileTypeが#M> <フォーマットリスト＃のM>\""
    },
    {
      "indent": 3,
      "text": "where <format list#i> has the form <profile#i_1>...<profile#i_N>",
      "ja": "<フォーマットリスト＃i>は、フォームがある<プロフィール＃をI_1> ... <プロフィール＃値In>"
    },
    {
      "indent": 3,
      "text": "The <profileType> parameter indicates the type of profile. It is expressed in the format AAL2/<profileClass> where <profileClass> identifies the source of the definition of the profile.",
      "ja": "<profileTypeが>パラメータは、プロファイルの種類を示します。それはフォーマットAAL2で発現される/ <profileClass> <profileClass>プロファイルの定義のソースを識別する。"
    },
    {
      "indent": 3,
      "text": "The <profileClass> can be assigned a string value indicating the source of the subsequent profile numbers until the next <profileType> field. The following rules apply to the contents of the <profileClass> field:",
      "ja": "<profileClass>次<profileTypeが>フィールドまで、後続のプロファイル番号のソースを示す文字列値を割り当てることができます。次の規則は、<profileClass>フィールドの内容に適用されます。"
    },
    {
      "indent": 6,
      "text": "- <profileClass> = \"ITU\" indicates profiles defined by ITU. Examples: profiles defined in the I.366.2 specification [2]. - <profileClass> = \"ATMF\" indicates profiles defined by ATM forum. Examples: profiles defined in af-vtoa-0113 [3] or af-vmoa-0145.000 [21]. - <profileClass> = \"custom\" indicates profiles defined by a corporation or a multi-vendor agreement. Since there is no standard administration of this convention, care should be taken to preclude inconsistencies within the scope of a deployment. - <profileClass> = <corporateName> An equipment vendor or service provider can use its registered, globally unique corporate name (e.g., Cisco, Telcordia etc.) as a string value of the <profileClass>. It is suggested that organizations maintain consistent definitions of the advertised AAL2 profiles that bear their corporate name. - The <profileClass> can be based on IEEE Standard 802-1990, Section 5.1, which defines the globally unique, IEEE-administered, three-octet OUIs used in MAC addresses and protocol identifiers. In this case, the <profileClass> field shall be assigned a string value of \"IEEE:\" concatenated with <oui> where <oui> is the hex representation of a three-octet field identical to the IEEE OUI. Since this is always represented in hex, the \"0x\" prefix is not used. Leading zeros may be omitted. For example, \"IEEE:00000C\" and \"IEEE:C\" both refer to Cisco Systems, Inc.",
      "ja": " -  <profileClass> = \"ITUは\" ITUによって定義されたプロファイルを示しています。例：I.366.2仕様で定義されたプロファイル[2]。 -  <profileClass> = \"ATMFは、\" ATMフォーラムで定義されたプロファイルを示しています。例：AF-VTOA-0113で定義されたプロファイル[3]またはAF-vmoa-0145.000 [21]。 -  <profileClass> =「カスタム」は、企業またはマルチベンダー契約で定義されたプロファイルを示しています。この大会の標準的な管理はありませんので、注意が展開の範囲内の矛盾を排除するために取られるべきです。 -  <profileClass> = <corporateName>機器ベンダーやサービスプロバイダーは、<profileClass>の文字列値としてその登録され、グローバルに一意の企業名（例えば、シスコ、Telcordiaのなど）を使用することができます。組織が企業の名前を負担宣伝AAL2プロファイルの一貫した定義を維持することが示唆されます。 -  <profileClass> IEEE規格802-1990、MACアドレス、プロトコル識別子で使用されるグローバルに一意な、IEEE投与、三オクテットのOUIを定義するセクション5.1、に基づくことができます。 「IEEE：」この場合、<profileClass>フィールドは、文字列値を割り当てなければならない<OUI>と連結する。ここで、<OUI> IEEE OUIと同様の3オクテットフィールドの16進表現です。これは、常に進で表現されているので、プレフィクス「0x」が使用されていません。先頭のゼロを省略することができます。例えば、「IEEE：00000C」と「IEEE：C」の両方シスコシステムズ、株式会社を参照してください。"
    },
    {
      "indent": 3,
      "text": "The <profile#> parameter is expressed as a decimal number in the range 1-255.",
      "ja": "<プロファイル＃>パラメータが範囲1-255の10進数として表現されます。"
    },
    {
      "indent": 3,
      "text": "An example of the use of the pfl parameter is:",
      "ja": "PFLパラメータの使用例は以下のとおりです。"
    },
    {
      "indent": 0,
      "text": "L: atm/pfl:\"AAL2/ITU 8 AAL2/ATMF 7 8 AAL2/custom 100 AAL2/cisco 200\"",
      "ja": "L：ATM / PFL： \"AAL2 / ITU 8 AAL2 / ATMF 7 8 AAL2 /カスタム100 AAL2 /シスコ200\""
    },
    {
      "indent": 3,
      "text": "The syntax for pfl can be represented compactly in the following ABNF (RFC2234) form:",
      "ja": "PFLの構文は次のABNF（RFC2234）の形でコンパクトに表すことができます。"
    },
    {
      "indent": 5,
      "text": "pfl = \"%x22\" 1*(profileType (1*profile#))\"%x22\" profileType = \"AAL2/\" profileClass space profile# = 1-255 space ; decimal integer followed by space profileClass = \"ATMF\"/\"ITU\"/\"custom\"/corporateName/(\"IEEE:\" oui) corporateName = 1*ALPHA ;one or more alphanumeric characters oui = 1*6 HEXDIG; 1-6 hex digits per IEEE Standard 802-1990 space = %d32",
      "ja": "PFL = \"％X22\" 1 *（profileTypeが（1 *プロファイル＃）） \"％X22\" profileTypeが= \"AAL2 /\" profileClass空間プロファイル＃1 = 1-255空間。空間profileClass = \"ATMF\" / \"ITU\" / \"カスタム\" / corporateName /（ \"IEEE\" OUI）、続いて10進整数、一つ以上の英数字OUI = 1 * 6 HEXDIG corporateName = 1 * ALPHA。 IEEE規格802-1990スペース=％のD32あたり1-6進数字"
    },
    {
      "indent": 3,
      "text": "Simplified CPS (smplCPS): This enables the AAL2 CPS simplification described in [21]. It can be assigned the following values: on, off. Under this simplification, each ATM cell contains exactly one AAL2 packet. If necessary, octets at the end of the cell are padded with zeros.",
      "ja": "簡略化CPS（smplCPS）：これは、[21]に記載のAAL2 CPSの簡略化を可能にします。これは、以下の値を割り当てることができます：ON、OFF。この単純化の下では、各ATMセルは、1つのAAL2パケットが含まれています。必要であれば、セルの末尾のオクテットにはゼロが埋め込まれます。"
    },
    {
      "indent": 3,
      "text": "AAL2 combined use timer (tmcu): This is defined in ITU I.363.2 [10]. It is an integer number of microseconds, represented as the decimal equivalent of 32 bits.",
      "ja": "AAL2併用タイマ（TMCU）：これは、ITU I. 363.2で定義されている[10]。これは32ビットの10進数として表さマイクロ秒の整数です。"
    },
    {
      "indent": 3,
      "text": "AAL service access point (aalsap): The service access point for AAL2 is defined in ITU I.366.2 [2]. The aalsap local connection option can take on the following string values: AUDIO, MULTIRATE.",
      "ja": "AALサービスアクセスポイント（aalsap）：AAL2のためのサービス・アクセス・ポイントは、ITU I.366.2で定義されている[2]。 AUDIO、マルチレート：aalsapローカル接続オプションには、次の文字列値を取ることができます。"
    },
    {
      "indent": 3,
      "text": "Circuit mode (cktmd): This is used to enable circuit mode data [2]. It can be assigned a value of \"on\" or \"off\".",
      "ja": "回路モード（cktmd）：これは、回路モードデータを有効にするために使用されている[2]。これは、「オン」または「オフ」の値を割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "Frame mode (frmd): This is used to enable frame mode data [2]. It can be assigned a value of \"on\" or \"off\".",
      "ja": "フレームモード（FRMD）：これは、フレーム・モード・データを有効にするために使用されている[2]。これは、「オン」または「オフ」の値を割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "Generic PCM setting (genpcm): This indicates whether generic PCM encoding in AAL2 profiles is A-law or Mu-law. It can be assigned the string values of \"PCMA\" and \"PCMU\".",
      "ja": "一般的なPCMの設定（genpcm）：これはAAL2プロファイルの一般的なPCMエンコーディングが-lawまたはmu-法則であるかどうかを示します。それは「PCMA」と「PCMU」の文字列値を割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "Transmission error detection (ted): Transmission error detection is defined in ITU I.366.1 [11]. The ted local connection option can take on the following values: on, off. This local connection option is useful in qualifying the aalApp local connection option, when the value of the latter is \"itu_i3661_unassured\".",
      "ja": "伝送エラー検出（テッド）：伝送誤り検出をITU I.366.1 [11]で定義されています。テッドローカル接続オプションは以下の値を取ることができます：ON、OFF。このローカル接続オプションは、後者の値が「itu_i3661_unassured」であるとき、aalAppローカル接続オプションを適格に有用です。"
    },
    {
      "indent": 3,
      "text": "SSSAR reassembly timer (rastimer): This is defined in ITU I.366.1 [11]. It is an integer number of microseconds, represented as the decimal equivalent of 32 bits.",
      "ja": "SSSAR再組立タイマー（rastimer）：これは、ITU I.366.1 [11]で定義されています。これは32ビットの10進数として表さマイクロ秒の整数です。"
    },
    {
      "indent": 3,
      "text": "When an endpoint supporting the ATM package is audited for capabilities, the following local connection options from Section 3.2 shall be returned: application (atm/aalApp). Further, if one of the values atm/ct is \"AAL2\", the following additional local connection options shall be returned: profile list (atm/pfl), simplified CPS (atm/smplCPS), service access point (atm/aalsap), circuit mode enable(atm/cktmd), frame mode enable (atm/frmd) and generic PCM setting (atm/genpcm). If more than one value is supported, these shall be expressed as a list of semicolon-separated values. For atm/smplCPS, atm/cktmd and atm/frmd, an audit can return \"on\", \"off\" or \"on;off\" depending on whether the mode is mandatory, unsupported or optional for the endpoint.",
      "ja": "ATMパッケージを支える終点が機能するために監査されている場合は、3.2節から次のローカル接続オプションが返されなければならない：アプリケーション（気圧/ aalApp）。値のいずれかがATM / CTは \"AAL2\" であればさらに、次の追加のローカル接続オプションが返されなければならない：プロファイルリスト（ATM / PFL）、簡素化CPS（気圧/ smplCPS）、サービス・アクセス・ポイント（ATM / aalsap）、回路のイネーブルモード（ATM / cktmd）、フレームモードがイネーブル（ATM / FRMD）および汎用PCM設定（ATM / genpcm）。複数の値がサポートされている場合、これらはセミコロンで区切られた値のリストとして表現されなければなりません。 ATM / smplCPS、ATM / cktmdおよびATM / FRMDために、監査は、「オフ」または「オン、オフ」、「オン」に戻すことができるモードは、エンドポイントのために、サポートされていない必須またはオプションであるかどうかに応じ。"
    },
    {
      "indent": 3,
      "text": "An example of returning, in audit response, the local connection options defined in Section 3.2 is:",
      "ja": "監査応答して、復帰の例は、セクション3.2で定義されたローカル接続オプションがあります。"
    },
    {
      "indent": 3,
      "text": "A: atm/aalApp:itu_i3662, atm/pfl:\"AAL2/ATMF 7 8\", smplCPS:on;off, aalsap:MULTIRATE, cktmd:off, frmd:off, genpcm:PCMU;PCMA",
      "ja": "：ATM / aalApp：itu_i3662、ATM / PFL： \"AAL2 / ATMF 7 8\"、smplCPS：オン、オフ、aalsap：マルチレート、cktmd：オフ、FRMD：オフ、genpcm：PCMUと、PCMA"
    },
    {
      "indent": 0,
      "text": "3.3 Service Layer",
      "section_title": true,
      "ja": "3.3サービス層"
    },
    {
      "indent": 3,
      "text": "TABLE 5: Local Connection Options for the Service Layer\n+--------------+---------------+----------------------------------+\n|  LCO         |    Meaning    |           Values                 |\n+--------------+---------------+----------------------------------+\n|  vsel        | Voice codec   | See below                        |\n|              | Selection     |                                  |\n+--------------+---------------+----------------------------------+\n|  dsel        | Data codec    | See below                        |\n|              | Selection     |                                  |\n+--------------+---------------+----------------------------------+\n|  fsel        | Fax codec     | See below                        |\n|              | Selection     |                                  |\n+--------------+---------------+----------------------------------+\n|  ccnf        | Codec         | Even number (4 - 32) hex digits  |\n|              | Configuration |                                  |\n+--------------+---------------+----------------------------------+\n|  usi         | ISUP User     | Two hex digits                   |\n|              | Information   |                                  |\n+--------------+---------------+----------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Voice codec selection (vsel): This is a prioritized list of one or more 3-tuples describing voice service. Each vsel 3-tuple indicates a codec, an optional packet length and an optional packetization period.",
      "ja": "音声コーデックの選択（VSEL）：これは音声サービスを記述する1つ以上の3つのタプルの優先順位リストです。各VSEL 3タプルは、コーデック、オプションのパケット長および任意のパケット化期間を示します。"
    },
    {
      "indent": 3,
      "text": "The vsel local connection option is structured as follows:",
      "ja": "次のようにVSELローカル接続オプションが構成されています。"
    },
    {
      "indent": 6,
      "text": "\"<encodingName #1> <packetLength #1><packetTime #1> <encodingName #2> <packetLength #2><packetTime #2> ... <encodingName #N> <packetLength #N><packetTime #N>\"",
      "ja": "\"<encodingName＃1> <packetLength＃1> <packetTime＃1> <encodingName＃2> <packetLength＃2> <packetTime＃2> ... <encodingName #N> <packetLength #N> <packetTime＃N>\""
    },
    {
      "indent": 3,
      "text": "where the <encodingName> refers to a codec name such as PCMU, G726- 32, G729 etc. See [18] and [34] for a list of codecs with static payload types. The <packetLength> is a decimal integer representation of the packet length in octets. The <packetTime> is a decimal integer representation of the packetization interval in microseconds.",
      "ja": "ここで、<encodingName>例えばG729などPCMU、G726- 32、コーデックとして名前を指し、静的ペイロードタイプとコーデックのリストを参照されたい[18]及び[34]。 <packetLength>オクテットのパケット長の10進整数表現です。 <packetTime>は、マイクロ秒単位のパケット化間隔の10進整数表現です。"
    },
    {
      "indent": 3,
      "text": "Voiceband data codec selection (dsel): This is a prioritized list of one or more 3-tuples describing voiceband data passthrough service. Each dsel 3-tuple indicates a codec, an optional packet length and an optional packetization period. Depending on the application, the dsel local connection option may or may not cover facsimile service. This is indicated via an <fxIncl> flag preceding the list of 3- tuples. This flag indicates whether the dsel list explicitly addresses facsimile (\"on\" value) or not (\"off\" value). This flag can also be set to \"-\", which is equivalent to setting it to \"off\".",
      "ja": "音声帯域データコーデック選択（DSEL）：これは、音声帯域データパススルーサービスを記述する1つまたは複数の3タプルの優先順位リストです。各DSEL 3タプルは、コーデック、オプションのパケット長および任意のパケット化期間を示します。アプリケーションに応じて、DSELローカル接続オプションは、ファクシミリサービスをカバーしていない場合があります。これは3-タプルのリストに先行<fxIncl>フラグを介して指示されます。このフラグはDSELリストが明示的か（「オフ」値）（値「オン」）、ファクシミリに対処するかどうかを示します。このフラグも設定することができ、「 - 」、「オフ」に設定するに相当します。"
    },
    {
      "indent": 3,
      "text": "If <fxIncl> is \"on\", then it is rarely useful to also include an fsel option. However, it is syntactically correct to do so as long as the dsel and fsel options include an identical set of 3-tuples, perhaps in a different order.",
      "ja": "<fxIncl>が「ON」であるならば、それはまた、FSELオプションを含めることがまれに有用です。しかし、おそらく、異なる順序で、限りDSELとFSELオプションが3タプルの同じセットを含むように行うことが構文的に正しいです。"
    },
    {
      "indent": 3,
      "text": "If <fxIncl> is \"off\", then any fsel list may still be ignored if the media gateway does not provide separate treatment of voiceband data passthrough and fax. Since, in this case, there is no distinct facsimile service from the media gateway's perspective, any fsel list does not apply.",
      "ja": "<fxIncl>が「オフ」である場合、メディアゲートウェイは、音声帯域データパススルーやファックスの別の治療法を提供しない場合、任意のFSELリストはまだ無視することができます。この場合には、メディアゲートウェイの観点から明確なファクシミリサービスがないため、任意FSELリストが適用されません。"
    },
    {
      "indent": 3,
      "text": "The dsel local connection option is structured as follows:",
      "ja": "次のようにDSELローカル接続オプションが構成されています。"
    },
    {
      "indent": 6,
      "text": "\"<fxIncl> <encodingName #1> <packetLength #1><packetTime #1> <encodingName #2> <packetLength #2><packetTime #2> ... <encodingName #N> <packetLength #N><packetTime #N>\"",
      "ja": "「<fxIncl> <encodingName＃1> <packetLength＃1> <packetTime＃1> <encodingName＃2> <packetLength＃2> <packetTime＃2> ... <encodingName #N> <packetLength #N> <packetTime＃ N>」"
    },
    {
      "indent": 3,
      "text": "where the <encodingName> refers to a codec name such as PCMU, G726- 32, G729 etc. The <packetLength> is a decimal integer representation of the packet length in octets. The <packetTime> is a decimal integer representation of the packetization interval in microseconds.",
      "ja": "ここで、<encodingName>例えばPCMU、G726- 32、としてコーデック名を参照G729等<packetLength>オクテットのパケット長の10進整数表現です。 <packetTime>は、マイクロ秒単位のパケット化間隔の10進整数表現です。"
    },
    {
      "indent": 3,
      "text": "Facsimile codec selection (fsel): This is a prioritized list of one or more 3-tuples describing fax service. Each fsel 3-tuple indicates a codec, an optional packet length and an optional packetization period. If the dsel option includes facsimile, the fsel connection option should be consistent with it. Each fsel 3-tuple indicates a codec, an optional packet length and an optional packetization period. The fsel local connection option is structured as follows:",
      "ja": "ファクシミリコーデック選択（FSEL）：これはファックスサービスを記述する1つ以上の3つのタプルの優先順位リストです。各FSEL 3タプルは、コーデック、オプションのパケット長および任意のパケット化期間を示します。 DSELオプションは、ファクシミリが含まれている場合は、FSEL接続オプションはそれと一致している必要があります。各FSEL 3タプルは、コーデック、オプションのパケット長および任意のパケット化期間を示します。次のようにFSELローカル接続オプションが構成されています。"
    },
    {
      "indent": 9,
      "text": "\"<encodingName #1> <packetLength #1><packetTime #1>\n<encodingName #2> <packetLength #2><packetTime #2>\n...\n<encodingName #N> <packetLength #N><packetTime #N>\"",
      "raw": true
    },
    {
      "indent": 3,
      "text": "where the <encodingName> refers to a codec name such as PCMU, G726- 32, G729 etc. The <packetLength> is a decimal integer representation of the packet length in octets. The <packetTime> is a decimal integer representation of the packetization interval in microseconds.",
      "ja": "ここで、<encodingName>例えばPCMU、G726- 32、としてコーデック名を参照G729等<packetLength>オクテットのパケット長の10進整数表現です。 <packetTime>は、マイクロ秒単位のパケット化間隔の10進整数表現です。"
    },
    {
      "indent": 3,
      "text": "Since spaces are used as delimiters within the vsel, dsel and fsel lists, it is necessary to enclose these lists in double quotes [36].",
      "ja": "スペースはVSEL、DSELとFSELリスト内の区切り文字として使用されるので、二重引用符[36]にこれらのリストを囲むことが必要です。"
    },
    {
      "indent": 3,
      "text": "The vsel, fsel and dsel parameters complement the rest of the local connection options and should be consistent with them.",
      "ja": "VSEL​​、FSELとDSELのパラメータは、ローカル接続オプションの残りの部分を補完し、それらと一致する必要があります。"
    },
    {
      "indent": 3,
      "text": "Examples of the use of these parameters are:",
      "ja": "これらのパラメータの使用例は以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "L: atm/vsel:\"G729 10 10000 G726-32 40 10000\" L: atm/dsel:\"off PCMA 10 10000 G726-32 40 10000\" L: atm/fsel:\"PCMU 40 5000 G726-32 20 5000\" L: atm/vsel:\"G729 10 10000 G726-32 40 10000\" L: atm/dsel:\"on PCMA 10 10000 G726-32 40 10000\"",
      "ja": "L：ATM / VSEL： \"G729 10 10000 G726-32 40 10000\" L：ATM / DSEL： \"PCMA 10オフ10000 G726-32 40 10000\" L：ATM / FSEL： \"PCMU 40 G726-32 20 5000 5000\" L ：ATM / VSEL： \"G729 10万G726-32 40万\" L：ATM / DSEL： \"10000 G726-32 40万PCMA 10の\""
    },
    {
      "indent": 3,
      "text": "The <packetLength>and <packetTime> can be set to \"-\" when not needed. A <fxIncl> value of \"-\" is equivalent to setting it to \"off\". For example:",
      "ja": "必要のないとき - 「」<packetLength>と<packetTime>は、に設定することができます。 <fxIncl>値が「 - 」を「オフ」に設定することと同じです。例えば："
    },
    {
      "indent": 6,
      "text": "L: atm/vsel:\"G729 - - G726-32 - -\" L: atm/dsel:\"- G729 - - G726-32 - -\" L: atm/fsel:\"G729-24 - -\"",
      "ja": "L：ATM / VSEL： \"G729  -   -  G726-32  -   - \" L：ATM / DSEL： \" -  G729  -   -  G726-32  -   - \" L：ATM / FSEL： \"G729-24  -   - \""
    },
    {
      "indent": 3,
      "text": "The vsel, dsel and fsel local connection options can be used in the AAL1, AAL2 and AAL5 contexts. The <packetLength> and <packetTime> are not meaningful in the AAL1 case and should be set to \"-\". In the AAL2 case, these local connection options indicate the preferred use of some or all of the rows in a given profile table. If multiple 3- tuples are present, they can indicate a preferentially ordered assignment of some rows in that profile to voice, voiceband data passthrough or facsimile service (e.g., row A preferred to row B etc). If multiple profiles are specified in the pfl parameter (described in section 3.2), the profile qualified by these local connection options is the first profile in the list.",
      "ja": "VSEL​​、DSELおよびFSELローカル接続オプションはAAL1、AAL2とAAL5文脈で使用することができます。 「 - 」<packetLength>と<packetTime>は、AAL1の場合は意味がありませんとに設定する必要があります。 AAL2の場合、これらのローカル接続オプションは、特定のプロファイルテーブル内の行の一部または全部の好ましい使用を示します。複数3-タプルが存在する場合、それらは音声、音声帯域データパススルーまたはファクシミリサービスにそのプロファイル内のいくつかの行優先順序付き割り当てを示すことができる（例えば、Bなどを行ことが好ましい行）。複数のプロファイルが（セクション3.2を参照）PFLパラメータで指定されている場合、これらのローカル接続オプションで修飾プロファイルは、リストの最初のプロファイルです。"
    },
    {
      "indent": 3,
      "text": "Codec configuration (ccnf): This is used to convey the contents of the single codec information element (IE) defined in [30]. The contents of this IE are: a single-octet Organizational Identifier (OID) field, followed by a single-octet Codec Type field, followed by zero or more octets of a codec configuration bit-map. The semantics of the codec configuration bit-map are specific to the organization[30, 31]. Since this bit-map is always represented in hex format, the \"0x\" prefix is omitted. Leading zeros are not omitted. For example:",
      "ja": "コーデック設定（ccnf）：これは、[30]で定義された単一コーデック情報要素（IE）の内容を伝えるために使用されます。このIEの内容は、コーデック構成ビットマップのゼロオクテット以上続く単一オクテットコーデックタイプフィールド、続いて単一オクテット組織識別子（OID）フィールド、。コーデック構成ビットマップのセマンティクスは[30、31]組織に特異的です。このビットマップは、常に進形式で表現されているので、プレフィクス「0x」は省略されています。先頭のゼロは省略されていません。例えば："
    },
    {
      "indent": 6,
      "text": "L: atm/ccnf:01080C",
      "ja": "L：ATM / ccnf：01080C"
    },
    {
      "indent": 3,
      "text": "indicates an Organizational Identifier of 0x01(the ITU-T). Using [57], the second octet (0x08) indicates a codec type of G.726 (ADPCM). The last octet, 0x0C indicates that 16 kbps and 24 kbps rates are NOT supported, while the 32 kbps and 40 kbps rates ARE supported.",
      "ja": "0x01の（ITU-T）の組織識別子を示します。 [57]を用いて、第2オクテット（0×08）は、G.726（ADPCM）のコーデックタイプを示します。最後のオクテットは、0x0Cのは32 kbpsの40 kbpsの速度がサポートされていますが16 kbpsのと24 kbpsの速度は、サポートされていないことを示しています。"
    },
    {
      "indent": 3,
      "text": "ISUP User Information (usi): This is used to convey the contents of the 'User Information Layer 1 protocol' field within the bearer capability information element defined in Section 4.5.5 of [32], and reiterated as the user service information element (IE) in Section 3.57 of [33]. The 'User Information Layer 1 protocol' field consists of the five least significant bits of Octet 5 of this information element.",
      "ja": "ISUPユーザ情報（USI）：これは、[32]のセクション4.5.5で定義されたベアラ能力情報エレメント内に「ユーザ情報レイヤ1つのプロトコル」フィールドの内容を伝えるために使用され、（ユーザサービス情報要素として繰り返し[33]のセクション3.57にIE）。 「ユーザ情報レイヤ1プロトコル」フィールドは、この情報要素のオクテット5の5つの最下位ビットで構成されています。"
    },
    {
      "indent": 3,
      "text": "The usi LCO represented as a string of two hex digits. The \"0x\" prefix is omitted since this value is always hexadecimal. These hex digits are constructed from an octet with three leading '0' bits and the last five bits equal to the 'User Information Layer 1 protocol' field described above. Digits to the left are more significant than digits to the right. The resulting values of the usi local connection option are as follows:",
      "ja": "USIのLCOは、2進数の文字列として表現しました。この値は常に進数であるため、プレフィクス「0x」は省略されています。これら進数字は、上記の「ユーザ情報レイヤ1つのプロトコル」フィールドに等しい3大「0」ビットと最後の5ビットでオクテットから構成されています。左の数字は右側の桁よりも重要です。次のようにUSIローカル接続オプションの結果の値は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "VALUE MEANING 0x01 CCITT standardized rate adaption V.110 and X.30 0x02 Recommendation G.711 Mu-law 0x03 Recommendation G.711 A-law 0x04 Recommendation G.721 32 kbps ADPCM and Recommendation I.460 0x05 Recommendations H.221 and H.242 0x06 Recommendation H.223 and H.245 0x07 Non-ITU-T standardized rate adaption 0x08 ITU-T standardized rate adaption V.120 0x09 CCITT standardized rate adaption X.31 HDLC flag stuffing",
      "ja": "値意味0x01のCCITT標準化レート適応V.110およびX.30 0x02の勧告G.711μ法の0x03の勧告G.711 A法則0x04の勧告G.721 32 kbpsのADPCMと勧告I.460 0x05の勧告H.221及びH 0.242 0x06の勧告H.223とH.245 0x07の非ITU-T標準化レート適応0x08にITU-T標準化レート適応V.120 0x09のCCITT標準化レート適応X.31 HDLCフラグスタッフィング"
    },
    {
      "indent": 0,
      "text": "3.4 ATM Bearer Traffic Management",
      "section_title": true,
      "ja": "3.4 ATMベアラトラフィック管理"
    },
    {
      "indent": 3,
      "text": "These local connection options are used to convey ATM traffic parameters.",
      "ja": "これらのローカル接続オプションは、ATMトラフィックパラメータを伝えるために使用されています。"
    },
    {
      "indent": 3,
      "text": "TABLE 6: Local Connection Options for ATM bearer traffic management\n+---------+---------------+---------------------------------------+\n| ATM LCO |    Meaning    |           Values                      |\n+---------+---------------+---------------------------------------+\n| atc     | ATM transfer  |CBR, nrt-VBR, rt-VBR, UBR, ABR, GFR,   |\n|         | capability or |DBR,SBR,ABT/IT,ABT/DT                  |\n|         | service       |                                       |\n|         | category      |                                       |\n+---------+---------------+---------------------------------------+\n| sbt     |atc subtype    | 1...5                                 |\n+---------+---------------+---------------------------------------+\n| qos     | QoS class     | 0...5                                 |\n+---------+---------------+---------------------------------------+\n| bcob    |Broadband      | 0...31                                |\n|         |Connection     |(Defined values listed below)          |\n|         |-Oriented      |                                       |\n|         |Bearer Class   |                                       |\n+---------+---------------+---------------------------------------+\n| eetim   |End-to-end     |on,off                                 |\n|         |timing required|                                       |\n+---------+---------------+---------------------------------------+\n| stc     |Susceptibility | 0...3                                 |\n|         |to clipping    |(Defined values listed below)          |\n+---------+---------------+---------------------------------------+\n| upcc    |User plane     |0...3                                  |\n|         |connection     |(Defined values listed below)          |\n|         |configuration  |                                       |\n+---------+---------------+---------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "+---------+---------------+---------------------------------------+\n| aqf     |ATM QoS        | List, see below                       |\n|         |parameters,    |                                       |\n|         |forward        |                                       |\n|         |direction      |                                       |\n+---------+---------------+---------------------------------------+\n| aqb     |ATM QoS        | List, see below                       |\n|         |parameters,    |                                       |\n|         |backward       |                                       |\n|         |direction      |                                       |\n+---------+---------------+---------------------------------------+\n| adf0+1  |ATM traffic    | List, see below                       |\n|         |descriptor,    |                                       |\n|         |forward        |                                       |\n|         |direction,     |                                       |\n|         |CLP-independent|                                       |\n+---------+---------------+---------------------------------------+\n| adf0    |ATM traffic    | List, see below                       |\n|         |descriptor,    |                                       |\n|         |forward        |                                       |\n|         |direction,     |                                       |\n|         |CLP=0          |                                       |\n+---------+---------------+---------------------------------------+\n| adb0+1  |ATM traffic    | List, see below                       |\n|         |descriptor,    |                                       |\n|         |backward       |                                       |\n|         |direction,     |                                       |\n|         |CLP-independent|                                       |\n+---------+---------------+---------------------------------------+\n| adb     |ATM traffic    | List, see below                       |\n|         |descriptor,    |                                       |\n|         |backward       |                                       |\n|         |direction,     |                                       |\n|         |CLP=0          |                                       |\n+---------+---------------+---------------------------------------+\n| abrf    |ABR parameters,| List, see below                       |\n|         |forward        |                                       |\n|         |direction      |                                       |\n+---------+---------------+---------------------------------------+\n| abrb    |ABR parameters,| List, see below                       |\n|         |backward       |                                       |\n|         |direction      |                                       |\n+---------+---------------+---------------------------------------+\n|abrSetup |ABR connection | List, see below                       |\n|         |set-up         |                                       |\n|         |parameters     |                                       |\n+---------+---------------+---------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "ATM transfer capability (atc): This parameter indicates the ATM Transfer Capability described in ITU I.371 [19], equivalent to the ATM Service Category described in the UNI 4.1 Traffic Management specification [8]. In applications conforming to ITU I.371, this parameter can be assigned the following values: DBR, SBR, ABT/IT, ABT/DT, ABR. In applications conforming to the UNI 4.1 Traffic Management specification, this parameter can be assigned the following values: CBR, nrt-VBR, rt-VBR, UBR, ABR, GFR.",
      "ja": "ATM転送能力（ATC）：このパラメータは、ITU I.371に記載のATM転送能力を示している[19]、UNI 4.1トラフィック管理仕様で説明ATMサービスカテゴリに相当する[8]。 DBR、SBR、ABT / IT、ABT / DT、ABR：ITU I.371に準拠したアプリケーションでは、このパラメータは以下の値を割り当てることができます。 CBR、NRT-VBR、RT-VBR、UBR、ABR、GFR：UNI 4.1トラフィック管理仕様に準拠したアプリケーションでは、このパラメータは次の値を割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "Subtype (sbt): This qualifies the atc local connection option. It can be assigned integer values of 1...5. The following combinations of the atc and sbt local connection options are meaningful:",
      "ja": "サブタイプ（SBT）：これは、ATCローカル接続オプションを修飾します。これは、1 ... 5の整数値を割り当てることができます。 ATCの以下の組み合わせとSBTローカル接続オプションは意味があります："
    },
    {
      "indent": 0,
      "text": "atc sbt Resulting transport",
      "ja": "SBT結果の輸送ATC"
    },
    {
      "indent": 0,
      "text": "CBR/DBR 1 Voiceband signal transport (ITU G.711, G.722, I.363) CBR/DBR 2 Circuit transport (ITU I.363) CBR/DBR 4 High-quality audio signal transport (ITU I.363) CBR/DBR 5 Video signal transport (ITU I.363) nrt-VBR 1 nrt-VBR.1 nrt-VBR 2 nrt-VBR.2 nrt-VBR 3 nrt-VBR.3 rt-VBR 1 rt-VBR.1 rt-VBR 2 rt-VBR.2 rt-VBR 3 rt-VBR.3 UBR 1 UBR.1 UBR 2 UBR.2 GFR 1 GFR.1 GFR 2 GRR.2 SBR 1 SBR1 SBR 2 SBR2 SBR 3 SBR3",
      "ja": "CBR / DBR 1つの音声帯域信号伝送（ITU G.711、G.722、I.363）CBR / DBR 2回路トランスポート（ITU I.363）CBR / DBR 4高品質オーディオ信号トランスポート（ITU I.363）CBR / DBR 5ビデオ信号のトランスポート（ITU I.363）NRT-VBR 1 NRT-VBR.1 NRT-VBR 2 NRT-VBR.2 NRT-VBR 3 NRT-VBR.3 RT-VBR 1 RT-VBR.1 RT- VBR 2 RT-VBR.2 RT-VBR 3 RT-VBR.3 UBR 1 UBR.1 UBR 2 UBR.2 GFR 1 GFR.1 GFR 2 GRR.2 SBR 1 SBR1 SBR 2 SBR2 SBR 3 SBR3"
    },
    {
      "indent": 3,
      "text": "Subtypes for the atc values of CBR or DBR are per [29]. Subtypes for the remaining atc values are per [8] and [19].",
      "ja": "CBRまたはDBRのATC値のサブタイプは、[29]あたりです。残りATC値のサブタイプごとである、[8]、[19]。"
    },
    {
      "indent": 3,
      "text": "QoS class (qos): This indicates the QoS class specified in ITU I.2965.1 [4]. It can take on the integer decimal values in the range 0 - 5. These values are mapped into QoS classes as follows:",
      "ja": "QoSクラス（QOS）：これは、[4] ITU I.2965.1で指定されたQoSクラスを示します。これは、0の範囲の整数小数の値をとることができます -  5.次のようにこれらの値はQoSクラスにマップされます。"
    },
    {
      "indent": 6,
      "text": "----------------------------------------------------------\n|      VALUE          |           MEANING                |\n----------------------------------------------------------\n|        0            |         Default QoS              |\n----------------------------------------------------------\n|        1            |         Stringent                |\n----------------------------------------------------------\n|        2            |         Tolerant                 |\n----------------------------------------------------------\n|        3            |         Bi-level                 |\n----------------------------------------------------------\n|        4            |         Unbounded                |\n----------------------------------------------------------\n|        5            |      Stringent bi-level          |\n----------------------------------------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Broadband Connection-Oriented Bearer Class (bcob): The bcob local connection option indicates the Broadband Connection-Oriented Bearer Class specified in ITU Q.2961.2 [5]. It is represented as a decimal number in the range 0 - 31, or its hex equivalent (range 0x0 - 0x1F). The following values are currently defined:",
      "ja": "ブロードバンド接続指向ベアラクラス（bcob）：bcobローカル接続オプションは、ITU Q.2961.2 [5]で指定されたブロードバンド接続指向ベアラクラスを示します。 31、またはそのヘクス当量（範囲0x0の -   -  0x1Fの）それが小数範囲0の数値として表されています。次の値が現在定義されています："
    },
    {
      "indent": 6,
      "text": "----------------------------------------------------------\n|      VALUE          |         MEANING                  |\n----------------------------------------------------------\n|        1            |         BCOB-A                   |\n----------------------------------------------------------\n|        3            |         BCOB-C                   |\n----------------------------------------------------------\n|        5            |  Frame relaying bearer service   |\n----------------------------------------------------------\n|        16           |         BCOB-X                   |\n----------------------------------------------------------\n|        24           | BCOB-VP (transparent VP service) |\n----------------------------------------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "End-to-end timing (eetim): This indicates whether end-to-end timing is required (Table 4-8 of [29]). It can be assigned a value of \"on\" or \"off\".",
      "ja": "エンド・ツー・エンドのタイミング（eetim）：これは、エンドツーエンドのタイミングが（[29]の表4-8）が必要であるかどうかを示します。これは、「オン」または「オフ」の値を割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "Susceptibility to clipping (stc): The stc local connection option indicates susceptibility to clipping. It is represented as a decimal number in the range 0 - 3, or its hex equivalent (range 0x0 - 0x3). All values except those listed below are reserved.",
      "ja": "（STC）をクリッピングに対する感受性：STCローカル接続オプションは、クリッピングに対する感受性を示しています。 3、またはそのヘクス当量（範囲0x0の -   - を0x3）には範囲0の10進数として表現されます。以下に列挙したものを除くすべての値が予約されています。"
    },
    {
      "indent": 6,
      "text": "----------------------------------------------------------\n|      VALUE          |           MEANING                |\n----------------------------------------------------------\n|        0            |  Not susceptible to clipping     |\n----------------------------------------------------------\n|        1            |  Susceptible to clipping         |\n----------------------------------------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "User plane connection configuration (upcc): The upcc local connection option is represented as a decimal number in the range 0 - 3, or its hex equivalent (range 0x0 - 0x3). All values except those listed below are reserved.",
      "ja": "ユーザプレーン接続形態（upcc）：upccローカル接続オプションは範囲0の10進数として表現される -  3、またはそのヘクス当量（範囲は0x0  -  0x3の）。以下に列挙したものを除くすべての値が予約されています。"
    },
    {
      "indent": 6,
      "text": "----------------------------------------------------------\n|      VALUE          |           MEANING                |\n----------------------------------------------------------\n|        0            |  Point to point                  |\n----------------------------------------------------------\n|        1            |  Point to multipoint             |\n----------------------------------------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "ATM QoS parameters, forward direction (aqf) and backward direction (aqb): Here, forward is the direction away from the media gateway, backward is the direction towards the gateway. If the directional convention used by bearer signaling at the gateway is different, then appropriate translations must be done by the media gateway. These parameters have the following format:",
      "ja": "ATM QoSパラメータ、順方向（AQF）及び逆方向（AQB）：ここで、フォワード離れメディアゲートウェイからの方向であり、後方ゲートウェイに向かう方向です。ゲートウェイにベアラシグナリングで使用される指向慣例が異なる場合は、適切な翻訳は、メディアゲートウェイによって行われなければなりません。これらのパラメータの形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "\"<cdvType><acdv><ccdv><eetd><cmtd><aclr>\"",
      "ja": "\"<cdvType> <acdv> <ccdv> <eetd> <cmtd> <ACLR>\""
    },
    {
      "indent": 3,
      "text": "Since spaces are used in this list, it must be enclosed in double quotes for MGCP compliance [36].",
      "ja": "スペースはこのリストで使用されているので、それは[36] MGCPのコンプライアンスのための二重引用符で囲む必要があります。"
    },
    {
      "indent": 3,
      "text": "The <cdvType> parameter can take on the string values of \"PP\" and \"2P\". These refer to the peak-to-peak and two-point CDV as defined in UNI 4.0 [6] and ITU Q.2965.2 [7] respectively.",
      "ja": "<cdvType>パラメータは、「PP」と「2P」の文字列の値を取ることができます。 [7]は、それぞれUNI 4.0 [6]、ITU Q.2965.2で定義されるように、これらは、ピーク・ツー・ピークと二点CDVを指します。"
    },
    {
      "indent": 3,
      "text": "The CDV parameters, <acdv> and <ccdv>, refer to the acceptable and cumulative CDVs respectively. These are expressed in units of microseconds and represented as the decimal or hex equivalent of 24- bit fields. These use the cell loss ratio, <aclr>, as the \"alpha\" quantiles defined in the ATMF TM 4.1 specification [8] and in ITU I.356 [9].",
      "ja": "CDVパラメータは、<acdv>と<ccdv>、それぞれ許容される累積CDVsを指します。これらは、マイクロ秒の単位で表現し、24ビット・フィールドの10進数または16進数同等物として表現されます。これらは、[9] [8]とITU I.356にATMF TM 4.1仕様で定義された \"アルファ\" 変位値として、<ACLR>、セル損失率を使用します。"
    },
    {
      "indent": 3,
      "text": "The transit delay parameters, <eetd> and <cmtd>, refer to the end-to-end and cumulative transit delays respectively in milliseconds. These are represented as the decimal equivalents of 16-bit fields. These parameters are defined in Q.2965.2 [7], UNI 4.0 [8] and Q.2931 [29].",
      "ja": "トランジット遅延パラメータ、<eetd>及び<cmtd>は、ミリ秒単位でそれぞれエンド・エンドへと累積通過遅延を指します。これらは、16ビットフィールドの小数点等価物として表されます。これらのパラメータは、Q.2965.2 [7]、UNI 4.0で定義されている[8]とQ.2931 [29]。"
    },
    {
      "indent": 3,
      "text": "The <aclr> parameter refers to forward and backward acceptable cell loss ratios. This is the ratio between the number of cells lost and the number of cells transmitted. It is expressed as the decimal or hex equivalent of an 8-bit field. This field expresses an order of magnitude n, where n is an integer in the range 1-15. The Cell Loss Ratio takes on the value 10 raised to the power of minus n.",
      "ja": "<ACLR>パラメータは、前後に許容されるセル損失率を意味します。これは、失われた細胞の数と送信されたセルの数との比です。これは8ビットのフィールドの10進数または16進数同等物として表現されます。このフィールドは、nは1~15の範囲の整数であり、大きさNの順序を表します。セル廃棄率はマイナスのn乗した値10になります。"
    },
    {
      "indent": 3,
      "text": "If any of these parameters is not specified, is inapplicable or is implied, then it is set to \"-\".",
      "ja": "これらのパラメータのいずれかが指定されていない場合は、適用できない場合、または暗示され、それがに設定されています「 - 」。"
    },
    {
      "indent": 3,
      "text": "Examples of the use of the aqf and aqb local connection options are:",
      "ja": "AQFとAQBローカル接続オプションの使用例は以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "L: atm/aqf:\"PP 8125 3455 32000 - 11\" L: atm/aqb:\"PP 4675 2155 18000 - 12\"",
      "ja": "L：ATM / AQF： \"PP 8125 3455 32000から11\" L：ATM / AQB： \"PP 4675 2155 18000から12\""
    },
    {
      "indent": 3,
      "text": "This implies a forward acceptable peak-to-peak CDV of 8.125 ms, a backward acceptable peak-to-peak CDV of 4.675 ms, forward cumulative peak-to-peak CDV of 3.455 ms, a backward cumulative peak-to-peak CDV of 2.155 ms, a forward end-to-end transit delay of 32 ms, a backward end-to-end transit delay of 18 ms, an unspecified forward cumulative transit delay, an unspecified backward cumulative transit delay, a forward cell loss ratio of 10 raised to minus 11 and a backward cell loss ratio of 10 to the minus 12.",
      "ja": "これは、8.125ミリ秒、4.675ミリ秒、3.455ミリ秒の前方累積ピークツーピークCDVの後方に許容されるピークツーピークCDV、後方累積ピークツーピークCDVの前方に許容されるピークツーピークCDVを暗示します2.155ミリ秒、32ミリ秒の前方エンド・ツー・エンド伝送遅延、18ミリ秒の後方エンド・ツー・エンド伝送遅延、不特定フォワード累積通過遅延、不特定後方累積通過遅延、10の前方セル損失率11マイナス10〜12の後方セル損失比マイナスに上げ。"
    },
    {
      "indent": 3,
      "text": "ATM traffic descriptors, forward direction CLP=0+1 (adf0+1), backward direction CLP=0+1 (adb0+1), forward direction CLP=0 (adf0), backward direction CLP=0 (adb0): Here, forward is the direction away from the media gateway, backward is the direction towards the gateway. If the directional convention used by bearer signaling at the gateway is different, then appropriate translations must be done by the media gateway. The adf0+1, adb0+1, adf0 and adb0 local connection options have the following format:",
      "ja": "ATMトラフィック記述子、順方向CLP = 0 + 1（adf0 + 1）、逆方向のCLP = 0 + 1（adb0 + 1）、順方向CLP = 0（adf0）、逆方向のCLP = 0（adb0）：ここで、前方、後方ゲートウェイに向かう方向であり、方向離れるメディアゲートウェイからです。ゲートウェイにベアラシグナリングで使用される指向慣例が異なる場合は、適切な翻訳は、メディアゲートウェイによって行われなければなりません。 adf0 + 1、+ 1 adb0、adf0とadb0ローカル接続オプションの形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "\"<pcr><scr><mbs><cdvt><mcr><mfs><fd><te>\"",
      "ja": "\"<Pcrの> <SCR> <MBS> <CDVT> <MCR> <MF> <FD> <目>\""
    },
    {
      "indent": 3,
      "text": "Since spaces are used in these lists, they must be enclosed in double quotes for MGCP compliance [36].",
      "ja": "スペースはこれらのリストに使用されているので、MGCPのコンプライアンス[36]のための二重引用符で囲む必要があります。"
    },
    {
      "indent": 3,
      "text": "These parameters are defined per the ATMF TM 4.1 specification [8]. Each of these parameters can be set to \"-\" if the intent is to not specify it via MGCP. These definitions are listed briefly in Table 7 below.",
      "ja": "これらのパラメータはATMF TM 4.1仕様ごとに定義されている[8]。これらの各パラメータは次のように設定することができます「 - 」意図はMGCPを経由して、それを指定しないことである場合。これらの定義は、以下の表7に簡潔に記載されています。"
    },
    {
      "indent": 3,
      "text": "TABLE 7: ATM Traffic Descriptor Parameters",
      "ja": "表7：ATMトラフィック記述子パラメータ"
    },
    {
      "indent": 3,
      "text": "PARAMETER MEANING UNITS pcr Peak Cell Rate Cells per second scr Sustained Cell Rate Cells per second mbs Maximum Burst Size Cells cdvt Cell Delay Variation Tolerance Microseconds mcr Minimum Cell Rate Cells per second mfs Maximum Frame Size Cells fd Frame Discard Allowed on/off te CLP tagging enabled on/off",
      "ja": "パラメータ意味UNITS PCR秒あたりのピークセルレート細胞最大フレームサイズのセルが破棄がオン/オフTE CLPタギングに可フレームにFD秒MFSあたりのセル遅延変動許容値（マイクロ秒）MCR最小セル・レート細胞CDVT二MBS最大バーストサイズのセルあたりSCR維持セル・レート細胞オン/オフが有効"
    },
    {
      "indent": 3,
      "text": "The pcr, scr, cdvt and mbs can be represented as the decimal equivalents of 24-bit fields. The mbs and mfs can be represented as the decimal equivalents of 16-bit fields.",
      "ja": "PCR、SCR、CDVTおよびMBSは、24ビットフィールドの小数点等価物として表すことができます。 MBSとMFSは16ビットフィールドの小数点等価物として表すことができます。"
    },
    {
      "indent": 3,
      "text": "Examples of these local connection options are:",
      "ja": "これらのローカル接続オプションの例としては、以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "L: atm/adf0+1:\"200 100 20 - - - on -\", atm/adf0:\"200 80 15 - - - - off\", atm/adb0+1:\"200 100 20 - - - on -\", atm/adb0:\"200 80 15 - - - - off\"",
      "ja": "L：ATM / adf0 + 1： \"200 100 20  -   -   - オン - \"、ATM / adf0： \"200 80 15  -   -   -   - オフ\"、ATM / adb0 + 1： \"200 100 20  -   -   - オン - \" 、ATM / adb0： \"200 80 15  -   -   -   - オフ\""
    },
    {
      "indent": 3,
      "text": "This implies a forward and backward PCR of 200 cells per second for all cells regardless of CLP, forward and backward PCR of 200 cells per second for cells with CLP=0, a forward and backward SCR of 100 cells per second for all cells regardless of CLP, a forward and backward SCR of 80 cells per second for cells with CLP=0, a forward and backward MBS of 20 cells for all cells regardless of CLP, a forward and backward MBS of 15 cells for cells with CLP=0, an unspecified CDVT which can be known by other means, and an MCR and MFS which are unspecified because they are inapplicable. Frame discard is enabled in both the forward and backward directions. Tagging is not enabled in either direction.",
      "ja": "これは関係なく、関係なくCLPの全てのセルについて、毎秒100個の細胞の= 0 CLP有する細胞毎秒200個の細胞、前後SCRの順方向および逆方向PCRをすべてのセルに対して、毎秒200個の細胞の前方及び後方PCRを暗示しますCLP、CLP = 0のセルのための毎秒80個の細胞の前方および後方SCRかかわらず、CLPのすべてのセルの20個のセルの前後MBS、CLP = 0、を有する細胞15個の細胞の前方及び後方MBS彼らは適用できないので、不特定の他の手段によって知ることができるCDVT、およびMCRおよびMFSは、指定されていません。フレーム廃棄は、前後方向の両方で有効になっています。タグ付けは、どちらの方向にも有効ではありません。"
    },
    {
      "indent": 3,
      "text": "ABR parameters, forward direction (abrf) and backward direction (abrb): Here, forward is the direction away from the media gateway, backward is the direction towards the gateway. If the convention used by bearer signaling at the gateway is different, then appropriate translations must be done by the media gateway. The abrf and abrb local connection options have the following format:",
      "ja": "ABRパラメータ、順方向（abrf）及び逆方向（AbrBの）：ここで、フォワード離れメディアゲートウェイからの方向であり、後方ゲートウェイに向かう方向です。ゲートウェイにベアラシグナリングで使用される慣例が異なる場合は、適切な翻訳は、メディアゲートウェイによって行われなければなりません。 abrfおよびAbrBのローカル接続オプションの形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "\"<nrm><trm><cdf><adtf>\"",
      "ja": "\"<NRM> <TRM> <CDF> <ADTF>\""
    },
    {
      "indent": 3,
      "text": "Since spaces are used in these lists, they must be enclosed in double quotes for MGCP compliance [36].",
      "ja": "スペースはこれらのリストに使用されているので、MGCPのコンプライアンス[36]のための二重引用符で囲む必要があります。"
    },
    {
      "indent": 3,
      "text": "These ABR parameters are defined per [6] and [8]. Their definition is summarized in Table 8 below. In MGCP, these are represented as the decimal equivalent of the binary fields mentioned below. If any of these parameters is meant to be left unspecified, it is set to \"- \".",
      "ja": "これらABRパラメータはごとに定義されている[6]、[8]。彼らの定義は、以下の表8に要約されています。 MGCPでは、これらは下記のバイナリフィールドの10進数として表されます。 「 - 」これらのパラメータのいずれかが未指定のままにすることを意図している場合は、それがに設定されています。"
    },
    {
      "indent": 0,
      "text": "TABLE 8: ABR Parameters\n+-----------+---------------------------------+-----------------------+\n| PARAMETER |            MEANING              | FIELD SIZE            |\n+-----------+---------------------------------+-----------------------+\n|  NRM      | Maximum number of cells per     |    3 bits             |\n|           | forward Resource Management cell|                       |\n+-----------+---------------------------------+-----------------------+\n|  TRM      | Maximum time between            |    3 bits             |\n|           |forward Resource Management cells|                       |\n+-----------+---------------------------------+-----------------------+\n|  CDF      | Cutoff Decrease Factor          |    3 bits             |\n+-----------+---------------------------------+-----------------------+\n|  ADTF     | Allowed Cell Rate Decrease      |    10 bits            |\n|           | Time Factor                     |                       |\n+-----------+---------------------------------+-----------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "ABR set-up parameters (abrSetup): This local connection option is used to indicate the ABR parameters needed during call/connection establishment (Section 10.1.2.2 of the UNI 4.0 signaling specification [6]). The abrSetup local connection option has the following format:",
      "ja": "ABR設定パラメータ（abrSetup）：このローカル接続オプションは、呼/接続確立中に必要ABRパラメータを示すために使用される（UNI 4.0シグナリング仕様のセクション10.1.2.2 [6]）。 abrSetupローカル接続オプションの形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "\"<ficr><bicr><ftbe><btbe><crmrtt><frif><brif><frdf><brdf>\"",
      "ja": "\"<Ficr> <bicr> <ftbe> <btbe> <crmrtt> <frif> <メイン> <frdf> <BRDF>\""
    },
    {
      "indent": 3,
      "text": "Since spaces are used in this list, it must be enclosed in double quotes for MGCP compliance [36].",
      "ja": "スペースはこのリストで使用されているので、それは[36] MGCPのコンプライアンスのための二重引用符で囲む必要があります。"
    },
    {
      "indent": 3,
      "text": "These parameters are defined per [6]. Their definitions are listed briefly in Table 9 below. In these definitions, forward is the direction away from the media gateway, backward is the direction towards the gateway. If the convention used by bearer signaling at the gateway is different, then appropriate translations must be done by the media gateway. If any of these parameters is meant to be left unspecified, it is set to \"-\".",
      "ja": "これらのパラメータは、[6]ごとに定義されています。それらの定義は、以下の表9に簡潔に記載されています。これらの定義では、前方、後方ゲートウェイに向かう方向であり、方向離れるメディアゲートウェイからです。ゲートウェイにベアラシグナリングで使用される慣例が異なる場合は、適切な翻訳は、メディアゲートウェイによって行われなければなりません。 「 - 」これらのパラメータのいずれかが未指定のままにすることを意図している場合は、それがに設定されています。"
    },
    {
      "indent": 0,
      "text": "TABLE 9: ABR Set-up Parameters\n+-----------+----------------------------------+---------------------+\n| PARAMETER |            MEANING               | REPRESENTATION      |\n+-----------+----------------------------------+---------------------+\n| <ficr>    | Forward Initial Cell Rate        | Decimal equivalent  |\n|           |(Cells per second)                | of 24-bit field     |\n+-----------+----------------------------------+---------------------+\n| <bicr>    | Backward Initial Cell Rate       | Decimal equivalent  |\n|           | (Cells per second)               | of 24-bit field     |\n+-----------+----------------------------------+---------------------+\n| <ftbe>    | Forward transient buffer         | Decimal equivalent  |\n|           | exposure (Cells)                 | of 24-bit field     |\n+-----------+----------------------------------+---------------------+\n| <btbe>    | Backward transient buffer        | Decimal equivalent  |\n|           | exposure (Cells)                 | of 24-bit field     |\n+-----------+----------------------------------+---------------------+\n| <crmrtt>  | Cumulative RM round-trip time    | Decimal equivalent  |\n|           | (Microseconds)                   | of 24-bit field     |\n+-----------+----------------------------------+---------------------+\n| <frif>    | Forward rate increase factor     | Decimal integer     |\n|           | (used to derive cell count)      | 0 -15               |\n+-----------+----------------------------------+---------------------+\n| <brif>    | Backward rate increase factor    | Decimal integer     |\n|           | (used to derive cell count)      | 0 -15               |\n+-----------+----------------------------------+---------------------+\n| <frdf>    | Forward rate decrease factor     | Decimal integer     |\n|           | (used to derive cell count)      | 0 -15               |\n+-----------+----------------------------------+---------------------+\n| <brdf>    | Backward rate decrease factor    | Decimal integer     |\n|           | (used to derive cell count)      | 0 -15               |\n+-----------+----------------------------------+---------------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3.5 AAL Dimensioning",
      "section_title": true,
      "ja": "3.5 AAL寸法"
    },
    {
      "indent": 3,
      "text": "The Local Connection Options in Table 10 are used to dimension the operation of the AAL. In these parameters, forward is the direction away from the media gateway. Backward is the direction towards the media gateway. These parameters are represented as decimal integers in the ranges listed in Table 10.",
      "ja": "表10のローカル接続オプションは、AALの動作をディメンションするために使用されます。これらのパラメータでは、フォワード方向離れるメディアゲートウェイからです。後方メディアゲートウェイに向かう方向です。これらのパラメータは、表10に記載されている範囲内の小数点整数として表現されます。"
    },
    {
      "indent": 3,
      "text": "TABLE 10: Local Connection Options used to dimension the AAL\n+---------+---------------+---------------------------------------+\n|  LCO    |    Meaning    | Values (Decimal Integer)              |\n+---------+---------------+---------------------------------------+\n|   str   | Structure     |  1...65,535                           |\n|         | Size          |                                       |\n+---------+---------------+---------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "+---------+---------------+---------------------------------------+\n| cbrRate | CBR rate      | Bit map per Table 4-6 of [29]         |\n+---------+---------------+---------------------------------------+\n|  fcpcs  | Forward       | AAL2: 45 or 64                        |\n|         | maximum CPCS  | AAL5: 1-65,535                        |\n|         | SDU size      |                                       |\n+---------+---------------+---------------------------------------+\n|  bcpcs  | Backward      | AAL2: 45 or 64                        |\n|         | maximum CPCS  | AAL5: 1-65,535                        |\n|         | SDU size      |                                       |\n+---------+---------------+---------------------------------------+\n|fSDUrate | Forward       | 24-bit equivalent                     |\n|         | maximum AAL2  |                                       |\n|         | CPS SDU rate  |                                       |\n+---------+---------------+---------------------------------------+\n|bSDUrate | Backward      | 24-bit equivalent                     |\n|         | maximum AAL2  |                                       |\n|         | CPS SDU rate  |                                       |\n+---------+---------------+---------------------------------------+\n| ffrm    |Forward maximum| 1-65,535                              |\n|         |frame block    |                                       |\n|         |size           |                                       |\n+---------+---------------+---------------------------------------+\n| bfrm    |Backward       | 1-65,535                              |\n|         |maximum frame  |                                       |\n|         |block size     |                                       |\n+---------+---------------+---------------------------------------+\n|fsssar   |Forward maximum| 1-65,568                              |\n|         |SSSAR-SDU      |                                       |\n|         |size           |                                       |\n+---------+---------------+---------------------------------------+\n|bsssar   |Backward       | 1-65,568                              |\n|         |maximum SSSAR  |                                       |\n|         |SDU size       |                                       |\n+---------+---------------+---------------------------------------+\n|fsscopsdu|Forward maximum| 1-65,528                              |\n|         |SSCOP-SDU      |                                       |\n|         |size           |                                       |\n+---------+---------------+---------------------------------------+\n|         |               |                                       |\n|bsscopsdu|Backward       | 1-65,528                              |\n|         |maximum SSCOP  |                                       |\n|         |SDU size       |                                       |\n+---------+---------------+---------------------------------------+\n|fsscopuu |Forward maximum| 1-65,524                              |\n|         |SSCOP-UU field |                                       |\n|         |size           |                                       |\n+---------+---------------+---------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "+---------+---------------+---------------------------------------+\n|bsscopuu |Backward       | 1-65,524                              |\n|         |maximum SSCOP  |                                       |\n|         |UU size        |                                       |\n+---------+---------------+---------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Structured Data Transfer Block Size (str): This parameter is meaningful only when structured AAL1 is used. It indicates the size (in octets) of the block used for structured data transfer. If not included as a local connection option, the structure size is to be known by other means. For instance, af-vtoa-78 [20] fixes the structure size for n x 64 service, with or without CAS. The L: atm/str parameter is coded as the decimal equivalent of a 16-bit field [29]. The theoretical maximum value of this parameter is 65,535, although most services use much less.",
      "ja": "構造化データ転送ブロックサイズ（文字列）：このパラメータは、構造化AAL1が使用されている場合にのみ意味があります。これは、構造化されたデータ転送のために使用されるブロックの（オクテットで）サイ​​ズを示します。ローカル接続オプションとして含まれていない場合は、構造体のサイズは、他の手段によって知られるようになります。例えば、AF-VTOA-78 [20]またはCASことなく、N×64サービスのための構造サイズを固定します。 L：ATM / STRパラメータは、16ビットのフィールド[29]の10進数として符号化されます。ほとんどのサービスはあまり使用していますが、このパラメータの理論上の最大値は、65,535です。"
    },
    {
      "indent": 3,
      "text": "CBR Rate (cbrRate): This is a hexadecimal representation of the bit map defined in Table 4-6 of ITU Q.2931 [29]. This is represented as exactly two hex digits. For example:",
      "ja": "CBRレート（cbrRate）：これは、ITU Q.2931の表4-6に定義されたビットマップの16進表現である[29]。これは、正確に2桁の16進数で表されます。例えば："
    },
    {
      "indent": 6,
      "text": "L: atm/cbrRate:04",
      "ja": "L：ATM / cbrRate：04"
    },
    {
      "indent": 3,
      "text": "implies a CBR rate of 1.544 Mbps.",
      "ja": "1.544 MbpsでのCBR率を意味します。"
    },
    {
      "indent": 3,
      "text": "Forward maximum CPCS-SDU size (fcpcs): This is the maximum size of the AAL2 or AA5 CPCS SDU in the forward direction.",
      "ja": "順方向最大CPCS-SDUサイズ（fcpcs）：これは、順方向AAL2またはAA5 CPCS SDUの最大サイズです。"
    },
    {
      "indent": 3,
      "text": "Backward maximum CPCS-SDU size (bcpcs): This is the maximum size of the AAL2 or AA5 CPCS SDU in the backward direction.",
      "ja": "逆方向最大CPCS-SDUサイズ（bcpcs）：これは、逆方向のAAL2またはAA5 CPCS SDUの最大サイズです。"
    },
    {
      "indent": 3,
      "text": "Forward maximum AAL2 CPCS-SDU rate (fSDUrate): This is the maximum rate of the AAL2 CPCS-SDUs in the forward direction.",
      "ja": "フォワード最大AAL2 CPCS-SDUレート（fSDUrate）：これは、順方向AAL2 CPCS-SDUの最大速度です。"
    },
    {
      "indent": 3,
      "text": "Backward maximum AAL2 CPCS-SDU rate (bSDUrate): This is the maximum rate of the AAL2 CPCS-SDUs in the backward direction.",
      "ja": "後方最大AAL2 CPCS-SDUレート（bSDUrate）：これは、逆方向にAAL2 CPCS-SDUの最大速度です。"
    },
    {
      "indent": 3,
      "text": "The fSDUrate and bSDUrate local connection options can be used to rate-limit AAL2 CIDs, especially when used in the SSSAR [1] and frame mode [2] contexts.",
      "ja": "[1] SSSARで使用され、フレームモード[2]コンテキスト場合fSDUrateとbSDUrateローカル接続オプションは、特に、レート制限のAAL2 CIDのために使用することができます。"
    },
    {
      "indent": 3,
      "text": "Forward maximum frame mode block size (ffrm): This is the maximum size, in the forward direction, of the AAL2 frame mode data unit (I.366.2) [2].",
      "ja": "フォワード最大フレームモードブロックサイズ（ffrm）：これはAAL2フレームモードデータユニット（I.366.2）の順方向、[2]において、最大サイズです。"
    },
    {
      "indent": 3,
      "text": "Backward maximum frame mode block size (bfrm): This is the maximum size, in the backward direction, of the AAL2 frame mode data unit (I.366.2) [2].",
      "ja": "後方最大フレームモードのブロックサイズ（BFRM）：これはAAL2フレームモードデータユニット（I.366.2）から、逆方向に、最大サイズである[2]。"
    },
    {
      "indent": 3,
      "text": "Forward maximum SSSAR-SDU size (fsssar): This is the maximum size, in the forward direction, of the AAL2-based SSSAR-SDU (I.366.1) [1].",
      "ja": "フォワード最大SSSAR-SDUサイズ（fsssar）：これは、最大サイズで、順方向、AAL2ベースのSSSAR-SDU（I.366.1）[1]。"
    },
    {
      "indent": 3,
      "text": "Backward maximum SSSAR-SDU size (bsssar): This is the maximum size, in the backward direction, of the AAL2-based SSSAR-SDU (I.366.1) [1].",
      "ja": "後方最大SSSAR-SDUサイズ（bsssar）：これは最大サイズで、逆方向に、AAL2ベースのSSSAR-SDU（I.366.1）[1]。"
    },
    {
      "indent": 3,
      "text": "Forward maximum SSCOP-SDU size (fsscopsdu): This is the maximum size, in the forward direction, of the AAL2-based SSCOP-SDU (I.366.1) [1].",
      "ja": "フォワード最大SSCOP-SDUサイズ（fsscopsdu）：これはAAL2ベースのSSCOP-SDU（I.366.1）の順方向、[1]において、最大サイズです。"
    },
    {
      "indent": 3,
      "text": "Backward maximum SSCOP-SDU size (bsscopsdu): This is the maximum size, in the backward direction, of the AAL2-based SSCOP-SDU (I.366.1) [1].",
      "ja": "後方最大SSCOP-SDUサイズ（bsscopsdu）：これは最大サイズで、逆方向に、AAL2ベースのSSCOP-SDU（I.366.1）[1]。"
    },
    {
      "indent": 3,
      "text": "Forward maximum SSCOP-UU size (fsscopuu): This is the maximum size, in the forward direction, of the AAL2-based SSCOP-UU field(I.366.1) [1].",
      "ja": "フォワード最大SSCOP-UUサイズ（fsscopuu）：これはAAL2ベースのSSCOP-UUフィールド（I.366.1）から、順方向に、最大サイズである[1]。"
    },
    {
      "indent": 3,
      "text": "Backward maximum SSCOP-UU size (bsscopuu): This is the maximum size, in the backward direction, of the AAL2-based SSCOP- UU field (I.366.1) [1].",
      "ja": "後方最大SSCOP-UUサイズ（bsscopuu）：これはAAL2ベースSSCOP- UUフィールド（I.366.1）から、逆方向に、最大サイズである[1]。"
    },
    {
      "indent": 0,
      "text": "4.0 Signals and Events",
      "section_title": true,
      "ja": "4.0シグナルとイベント"
    },
    {
      "indent": 3,
      "text": "Standard MGCP syntax and keywords [36] are used in Table 11 to define the events in this package. Since these are all connection events, they cannot be requested for endpoints. For consistency with MGCP [36], it is required that the suffix @<connection-id> NOT be omitted even if there is only one connection to an endpoint. This suffix can also be wildcarded per MGCP rules.",
      "ja": "標準MGCP構文とキーワード[36]このパッケージのイベントを定義するために、表11に使用されます。これらは、すべての接続イベントなので、彼らは、エンドポイントのために要求することはできません。 MGCP [36]との整合性のために、エンドポイントへの唯一つの接続がある場合でも、サフィックス@ <接続ID>は省略することがないことが要求されます。この接尾辞は、MGCPルールごとにワイルドカードすることができます。"
    },
    {
      "indent": 3,
      "text": "There are no auditable event-states associated with the ATM package.",
      "ja": "ATMパッケージに関連付けられた監査対象イベントの状態がありません。"
    },
    {
      "indent": 3,
      "text": "Set-up complete (\"sc\"):",
      "ja": "セットアップ完了し（「SC」）："
    },
    {
      "indent": 3,
      "text": "Within the RequestedEvents (R:) structure, \"sc\" is used to request notification of successful ATM or AAL2 connection set-up. The ATM OR AAL2 bearer path is ready for subscriber payload carriage when this notification is sent.",
      "ja": "RequestedEvents（R ​​:)構造内に、「SC」が成功したATMまたはAAL2接続セットアップの通知を要求するために使用されます。この通知が送信されたときATM OR AAL2ベアラ経路は、加入者ペイロードキャリッジの準備ができています。"
    },
    {
      "indent": 3,
      "text": "This could be the set-up of an SVC, the assignment of an AAL2 CID path and combinations thereof. Examples of such combinations are the set-up of an AAL2 SVC and the assignment of a CID within it or the set-up of a concatenation of an AAL2 single-CID SVC and a CID channel within a multiplexed AAL2 VC.",
      "ja": "これは、SVC、AAL2 CIDパスおよびそれらの組み合わせの割り当てのセットアップであってもよいです。このような組み合わせの例としては、AAL2 SVCのセットアップとその中のCIDまたはAAL2シングルCID SVCの連結及び多重AAL2 VC内のCIDチャネルのセットアップの割り当てです。"
    },
    {
      "indent": 3,
      "text": "This event is included for backward compatibility. It is preferred that the call agent and the media gateway rely on provisional acknowledgements in the case in which connection set-up has a long latency. However, if this event is requested, the media gateway must issue notification of connection set-up via this event. In this case, a provisional acknowledgement is not very useful, and full acknowledgement of the create connection or modify connection need not be deferred until connection set up.",
      "ja": "このイベントは、下位互換性のために含まれています。コールエージェントとメディアゲートウェイは、接続セットアップが長い待ち時間を有する場合には仮の肯定応答に依存していることが好ましいです。このイベントは、要求された場合は、メディア・ゲートウェイは、このイベントを経由して接続セットアップの通知を発行する必要があります。この場合、暫定承認は非常に有用ではありません、との接続を作成または変更、接続の完全な承認は、接続セットアップまで延期する必要はありません。"
    },
    {
      "indent": 3,
      "text": "The designated trigger for an ATM OR AAL2 connection set-up is an \"on\" value of the L: atm/se local connection option provided with a create or modify connection command. However, it is recognized that certain applications use the presence of an atm/sc event notification to initiate the set-up of an ATM or AAL2 connection.",
      "ja": "作成または変更、接続コマンドで提供さ気圧/ SEローカル接続オプション：ATM OR AAL2接続セットアップのための指定されたトリガは、Lの値が「オン」です。しかし、特定のアプリケーションは、ATMまたはAAL2接続のセットアップを開始するために、ATM / SCイベント通知の存在を使用することが認識されます。"
    },
    {
      "indent": 3,
      "text": "TABLE 11: Signals and Events in the ATM package\n|---------------|-----------------------|-----|------|--------------|\n|    SYMBOL     |  DEFINITION           | R   |   S  |   DURATION   |\n|---------------|-----------------------|-----|------|--------------|\n|      sc       |  Bearer path set-up   |  C  |      |              |\n|               |  complete             |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n|      sf       |  Bearer path set-up   |  C  |      |              |\n|               |  failed               |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n|      ec       |  Enable CAS via       |     |  oo  |              |\n|               |  type 3 packets       |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n|     etd       |  Enable DTMF tone     |     |  oo  |              |\n|               |  forwarding via       |     |      |              |\n|               |  packets              |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n|     etm       |  Enable MF tone       |     |  oo  |              |\n|               |  forwarding via       |     |      |              |\n|               |  packets              |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n|     etr1      |  Enable MF-R1 tone    |     |  oo  |              |\n|               |  forwarding via       |     |      |              |\n|               |  packets              |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n|     etr2      |  Enable MF-R2 tone    |     |  oo  |              |\n|               |  forwarding via       |     |      |              |\n|               |  packets              |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n| uc (string)   |  Used codec changed   |  C  |      |              |\n|               |  to codec named by    |     |      |              |\n|               |  the string           |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n| ptime (#)     |  Packetization period |  C  |      |              |\n|               |  changed to #         |     |      |              |\n|---------------|-----------------------|-----|------|--------------|",
      "raw": true
    },
    {
      "indent": 3,
      "text": "|---------------|-----------------------|-----|------|--------------|\n| pftrans (#)   |  Profile element      |  C  |      |              |\n|               |  changed to  row #    |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n| cle  (#)      |  Cell Loss            |  C  |      |              |\n|               |  threshold (# )       |     |      |              |\n|               |  exceeded             |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n| pl   (#)      |  Packet Loss Threshold|  C  |      |              |\n|               |  exceeded (# )        |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n| qa            |  Quality Alert        |  C  |      |              |\n|               |                       |     |      |              |\n|---------------|-----------------------|-----|------|--------------|\n| of   (#)      |  Operation failure:   |  C  |      |              |\n|               |  Loss of connectivity |     |      |              |\n|               |  with reason code #   |     |      |              |\n-------------------------------------------------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Set-up failed (\"sf\"):",
      "ja": "セットアップは、（「SF」）を失敗しました："
    },
    {
      "indent": 3,
      "text": "Within the RequestedEvents (R:) structure, \"sf\" is used to request notification of a failed ATM OR AAL2 connection set-up. The ATM OR AAL2 connection set-ups addressed by \"sf\" are the same as for the \"sc\" event.",
      "ja": "RequestedEvents（R ​​:)構造内に、「SF」が失敗したATM OR AAL2接続セットアップの通知を要求するために使用されます。 「SF」によって対処ATM OR AAL2接続のセットアップは、「SC」イベントと同じです。"
    },
    {
      "indent": 3,
      "text": "In some ATM OR AAL2 applications with SVC set-up or bearer-signalled AAL2 path assignment, the \"sf\" event might not be used. In these cases, the following options are available:",
      "ja": "SVCのセットアップまたはベアラ合図AAL2パスの割り当てと、いくつかのATM OR AAL2アプリケーションでは、「SF」イベントは使用されない場合があります。これらのケースでは、次のオプションが用意されています。"
    },
    {
      "indent": 6,
      "text": "* the call agent receives a spontaneous delete from the media gateway with an appropriate reason code (902). * the call agent receives the \"of\" event described below with the optional reason code (902).",
      "ja": "*コールエージェントは適切な理由コード（902）とメディアゲートウェイからの自発的削除を受信します。 *コールエージェントは、オプションの理由コード（902）を用いて以下に説明する「の」イベントを受信します。"
    },
    {
      "indent": 3,
      "text": "Enable CAS via type 3 packets (\"ec\"):",
      "ja": "タイプ3のパケット（「EC」）を介してCASを有効にします。"
    },
    {
      "indent": 3,
      "text": "This signal indicates that the media gateway is to forward CAS signaling via type 3 packets on an AAL2 connection. This does not preclude the call agent from requesting notification of CAS state changes. On receiving this signal request, the gateway sustains a bidirectional type 3 CAS protocol over the AAL2 path. This comes to an end when the request is cancelled through a subsequent NotificationRequest command or when the VoAAL2 connection is deleted.",
      "ja": "この信号は、メディアゲートウェイは、AAL2接続のタイプ3パケットを介してCASシグナリングを転送することであることを示しています。これは、CASの状態変化の通知を要求するからコールエージェントを排除するものではありません。この信号要求を受信すると、ゲートウェイは、AAL2経路上の双方向型3 CASプロトコルを維持します。要求は、その後のNotificationRequestコマンドによってキャンセルされた場合、またはするVoAAL2接続が削除されたときに終了します。"
    },
    {
      "indent": 3,
      "text": "Enable DTMF tones via type 3 packets (\"etd\"):",
      "ja": "タイプ3のパケット（「ETD」）を経由してDTMFトーンを有効にします。"
    },
    {
      "indent": 3,
      "text": "A gateway will ignore this signal request if it normally forwards and receives DTMF tones via type 3 packets. This signal indicates that the media gateway is to forward and receive DTMF tones via type 3 packets on an AAL2 connection. This does not preclude the call agent from requesting notification of DTMF tones.",
      "ja": "それは通常転送し、タイプ3パケットを介してDTMFトーンを受信した場合、ゲートウェイは、この信号要求を無視します。この信号は、メディアゲートウェイは、AAL2接続で3パケットを転送し、型を介してDTMFトーンを受信することを示しています。これは、DTMFトーンの通知を要求してから、コールエージェントを排除するものではありません。"
    },
    {
      "indent": 3,
      "text": "Enable MF tones via type 3 packets (\"etm\"):",
      "ja": "タイプ3パケット（ \"ETM\"）を介して、MFトーンを有効にします："
    },
    {
      "indent": 3,
      "text": "A gateway will ignore this signal request if it normally forwards and receives MF tones via type 3 packets. This signal indicates that the media gateway is to forward and receive MF tones via type 3 packets on an AAL2 connection. This does not preclude the call agent from requesting notification of MF tones. This signal request does not specify the MF tone type, which is known by other means.",
      "ja": "それは通常転送し、タイプ3パケットを介してMFトーンを受信した場合、ゲートウェイは、この信号要求を無視します。この信号は、メディアゲートウェイは、AAL2接続で3パケットを転送し、型を介してMFトーンを受信することを示しています。これは、MFトーンの通知を要求してから、コールエージェントを排除するものではありません。この信号要求は、他の手段によって知られているMFトーンタイプを指定していません。"
    },
    {
      "indent": 3,
      "text": "Enable R1 MF tones via type 3 packets (\"etr1\"):",
      "ja": "タイプ3パケット（ \"ETR1\"）を介して、R1 MFトーンを有効にします："
    },
    {
      "indent": 3,
      "text": "A gateway will ignore this signal request if it normally forwards and receives R1 MF tones via type 3 packets. This signal indicates that the media gateway is to forward and receive R1 MF tones via type 3 packets on an AAL2 connection. This does not preclude the call agent from requesting notification of R1 MF tones.",
      "ja": "それは通常転送し、タイプ3パケットを介してR1 MFトーンを受信した場合、ゲートウェイは、この信号要求を無視します。この信号は、メディアゲートウェイは、AAL2接続で3パケットを転送し、型を介してR1 MFトーンを受信することを示しています。これは、R1 MFトーンの通知を要求してから、コールエージェントを排除するものではありません。"
    },
    {
      "indent": 3,
      "text": "Enable R2 MF tones via type 3 packets (\"etr2\"):",
      "ja": "タイプ3パケット（ \"ETR2\"）を介してR2 MFトーンを有効にします："
    },
    {
      "indent": 3,
      "text": "A gateway will ignore this signal request if it normally forwards and receives R2 MF tones via type 3 packets. This signal indicates that the media gateway is to forward and receive R2 MF tones via type 3 packets on an AAL2 connection. This does not preclude the call agent from requesting notification of R2 MF tones.",
      "ja": "それは通常転送し、タイプ3パケットを介してR2 MFトーンを受信した場合、ゲートウェイは、この信号要求を無視します。この信号は、メディアゲートウェイは、AAL2接続で3パケットを転送し、型を介してR2 MFトーンを受信することを示しています。これは、R2 MFトーンの通知を要求してから、コールエージェントを排除するものではありません。"
    },
    {
      "indent": 3,
      "text": "Used codec changed (\"uc (string)\"):",
      "ja": "使用されるコーデック変更（ \"UC（文字列）\"）："
    },
    {
      "indent": 3,
      "text": "If armed via an R:atm/uc, a media gateway signals a codec change through an O:atm/uc. The alphanumeric string in parentheses is optional. It is the encoding name of the codec to which the switch is made. Although this event can be used with all ATM adaptations (AAL1, AAL2 and AAL5):",
      "ja": "R介し武装場合：ATM / UC：ATM / UC、メディアゲートウェイは、Oを介してコーデックの変更を通知します。括弧内の英数字の文字列はオプションです。これは、スイッチが行われるとコーデックのエンコーディング名です。このイベントは、すべてのATM適応（AAL1、AAL2およびAAL5）で使用することができますが。"
    },
    {
      "indent": 6,
      "text": "* The pftrans event is more suited to AAL2 applications. * Codec switches do not generally occur mid-call in AAL1 applications.",
      "ja": "* pftransイベントは、AAL2アプリケーションに適しています。 *コーデックスイッチは、一般的にAAL1アプリケーションで通話中に発生しません。"
    },
    {
      "indent": 3,
      "text": "Packet time changed (\"ptime(#)\"):",
      "ja": "パケット時間（ \"PTIME（＃）\"）に変更："
    },
    {
      "indent": 3,
      "text": "If armed via an R:atm/ptime, a media gateway signals a packetization period change through an O:atm/ptime. The decimal number in parentheses is optional. It is the new packetization period in milliseconds. In AAL2 applications, the pftrans event can be used to cover packetization period changes (and codec changes).",
      "ja": "R介し武装場合：ATM / PTIME：ATM / PTIME、メディアゲートウェイは、Oを介してパケット化周期変更信号を送ります。括弧の10進数は任意です。これは、ミリ秒単位で新しいパケット化期間です。 AAL2アプリケーションで、pftransイベントは、パケット化周期の変更（およびコーデックの変更）をカバーするために使用することができます。"
    },
    {
      "indent": 3,
      "text": "Profile element changed (\"pftrans(#)\"):",
      "ja": "プロフィール要素は、（ \"pftrans（＃）\"）に変更しました："
    },
    {
      "indent": 3,
      "text": "If armed via an R:atm/pftrans, a media gateway signals a mid-call profile element change through an O:atm/ptime. This event is used with AAL2 adaptation only. A profile element is a row in a profile table. Profile elements indicating silence should not trigger this event. The decimal number in parentheses is optional. It is the row number to which the switch is made. Rows are counted downward, beginning from 1.",
      "ja": "R介し武装場合：ATM / PTIME：ATM / pftrans、メディアゲートウェイはOスルー、通話プロファイル要素の変更を知らせます。このイベントは、AAL2アダプテーションのみで使用されています。プロファイル要素がプロファイル・テーブルの行です。沈黙を示すプロファイル要素は、このイベントをトリガしてはなりません。括弧の10進数は任意です。これは、スイッチが行われた行番号です。行は1から始めて、下方にカウントされます。"
    },
    {
      "indent": 3,
      "text": "Cell loss exceeded (\"cle(#)\"):",
      "ja": "セル損失は、（ \"CLE（＃）\"）を超え："
    },
    {
      "indent": 3,
      "text": "This event indicates that the cell loss rate exceeds the threshold #. If the threshold is omitted in the requested events and observed events parameters, it is known by other means. The optional decimal number is the number of dropped cells per 100,000 cells. For example, cle(10) indicates cells are being dropped at a rate of 1 in 10,000 cells.",
      "ja": "このイベントは、セル損失率がしきい値＃を超えていることを示します。しきい値が要求されたイベントと観察されたイベントのパラメータでは省略されている場合は、他の手段によって知られています。オプションの10進数は、100,000細胞あたりのドロップセルの数です。例えば、CLE（10）細胞が、1〜10,000の細胞の割合で廃棄される示します。"
    },
    {
      "indent": 3,
      "text": "Packet loss exceeded (\"ple(#)\"):",
      "ja": "パケット損失は（ \"PLE（＃）\"）を超え："
    },
    {
      "indent": 3,
      "text": "This event indicates that the packet loss rate exceeds the threshold #. If the threshold is omitted in the requested events and observed events parameters, it is known by other means. The optional decimal number is the number of dropped packets per 100,000 packets. For example, ple(10) indicates packets are being dropped at a rate of 1 in 10,000 packets.",
      "ja": "このイベントは、パケット損失率がしきい値＃を超えていることを示します。しきい値が要求されたイベントと観察されたイベントのパラメータでは省略されている場合は、他の手段によって知られています。オプション進数、10万のパケットあたりのドロップされたパケットの数です。例えば、PLE（10）は、パケットが1万でのパケットの割合で廃棄される示します。"
    },
    {
      "indent": 3,
      "text": "When the bearer connection uses an AAL2 CID within a multiplexed VCC rather than an entire VCC, the 'ple' event is used instead of 'cle'. The packets are AAL2 CPS PDUs.",
      "ja": "ベアラ接続を多重VCC全体ではなくVCC内AAL2 CIDを使用する場合、「PLE」イベントではなく、「CLE」を使用します。パケットはAAL2 CPS PDUのです。"
    },
    {
      "indent": 3,
      "text": "Quality alert (\"qa\"):",
      "ja": "品質のアラート（ \"QA\"）："
    },
    {
      "indent": 3,
      "text": "This event indicates that the bearer path fails to any predetermined combination of quality criteria such as loss, delay, jitter etc. This criterion is not defined and is left to the application. The gateway reports this quality violation to the call agent if armed to do so.",
      "ja": "このイベントは、ベアラ・パスがこの基準が定義されていないような損失、遅延、ジッター等の品質基準の任意の所定の組合せに失敗し、アプリケーションに任されていることを示しています。そうするために武装した場合にゲートウェイがコールエージェントにこの品質違反を報告します。"
    },
    {
      "indent": 3,
      "text": "Report failure (\"of (#)\"):",
      "ja": "（ \"（＃）の\"）失敗を報告："
    },
    {
      "indent": 3,
      "text": "This indicates a connection failure. It can also indicate failure to establish a connection, in lieu of \"sf\".",
      "ja": "これは、接続の失敗を示しています。また、「SF」の代わりに、接続の確立に失敗したことを示すことができます。"
    },
    {
      "indent": 3,
      "text": "The most common response to these events is for the media gateway to delete the connection. Some applications might choose to report an \"of\" with the appropriate reason code, a decimal number, optionally included in parentheses. Reason codes are the same as for spontaneous deletes by the gateway.",
      "ja": "これらのイベントに最も一般的な応答は、接続を削除するには、メディアゲートウェイのためです。一部のアプリケーションでは、必要に応じて括弧内に含まれる適切な理由コード10進数、で「の」を報告することを選択するかもしれません。理由コードは、ゲートウェイによって自発的削除と同じです。"
    },
    {
      "indent": 0,
      "text": "5.0 Connection Parameters",
      "section_title": true,
      "ja": "5.0接続パラメータ"
    },
    {
      "indent": 3,
      "text": "The MGCP connection parameters structure is returned in an autonomous delete connection message, and in a response to a delete or audit connection command. The standard connections parameters [36] it contains are redefined below for ATM. Also, a new extension parameter specific to the ATM package is defined.",
      "ja": "MGCP接続パラメータ構造が自律削除接続メッセージに、削除又は監査接続コマンドに応答して返されます。それが含まれている[36]標準の接続パラメータは、ATMのために下に再定義されています。また、ATMパッケージに固有の新しい拡張パラメータが定義されます。"
    },
    {
      "indent": 3,
      "text": "The standard connection parameters redefined for ATM are:",
      "ja": "ATMのために再定義標準の接続パラメータは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Number of packets sent: If a VCC is assigned to the connection, this is the total number of ATM cells transmitted for the duration of the connection. If a CID within an AAL2 VCC is assigned to the connection, it is the number of AAL2 common part sublayer (CPS) packets transmitted for the duration of the connection.",
      "ja": "送信されたパケットの数：VCCが接続に割り当てられている場合、これは接続の持続時間のために送信されるATMセルの総数です。 AAL2 VCC内のCIDが接続に割り当てられている場合、それは、接続の持続時間のために送信AAL2共通部サブレイヤ（CPS）パケットの数です。"
    },
    {
      "indent": 3,
      "text": "Number of octets sent: If a VCC is assigned to the connection, this is the total number of ATM payload octets transmitted for the duration of the connection. If a CID within an AAL2 VCC is assigned to the connection, this is the total number of AAL2 CPS payload octets transmitted for the duration of the connection.",
      "ja": "送信されたオクテットの数：VCCが接続に割り当てられている場合、これは、接続の持続時間のために送信ATMペイロードのオクテットの総数です。 AAL2 VCC内のCIDが接続に割り当てられている場合、これは、接続の持続時間のために送信AAL2 CPSペイロードのオクテットの総数です。"
    },
    {
      "indent": 3,
      "text": "Number of packets received: If a VCC is assigned to the connection, this is the total number of ATM cells received for the duration of the connection. If a CID within an AAL2 VCC is assigned to the connection, it is the number of AAL2 common part sublayer (CPS) packets received for the duration of the connection.",
      "ja": "パケットの数は、受信された：VCCが接続に割り当てられている場合、これは、接続の持続時間にわたって受信したATMセルの総数です。 AAL2 VCC内のCIDが接続に割り当てられている場合、それはAAL2共通部サブレイヤ（CPS）パケットの数は、接続の期間中に受信されます。"
    },
    {
      "indent": 3,
      "text": "Number of octets received: If a VCC is assigned to the connection, this is the total number of ATM payload octets received for the duration of the connection. If a CID within an AAL2 VCC is assigned to the connection, this is the total number of AAL2 CPS payload octets received for the duration of the connection.",
      "ja": "オクテットの数は、受信された：VCCが接続に割り当てられている場合、これは、接続の持続時間にわたって受信したATMペイロードのオクテットの総数です。 AAL2 VCC内のCIDが接続に割り当てられている場合、これは、接続の持続時間のために受信AAL2 CPSペイロードのオクテットの総数です。"
    },
    {
      "indent": 3,
      "text": "Number of packets lost: If a VCC is assigned to the connection, this is the total number of ATM cells lost for the duration of the connection, in the direction towards the gateway. If a CID within an",
      "ja": "失われたパケットの数：VCCが接続に割り当てられている場合、これはATMセルの総数は、ゲートウェイに向かう方向に、接続の持続時間にわたって失われます。もし内のCID"
    },
    {
      "indent": 3,
      "text": "AAL2 VCC is assigned to the connection, it is the number of AAL2 common part sublayer (CPS) packets lost for the duration of the connection, in the direction towards the gateway. If these losses cannot be assessed, then the gateway omits this parameter.",
      "ja": "AAL2 VCCが接続に割り当てられ、それがゲートウェイに向かう方向に、接続の期間中に失わAAL2共通部サブレイヤ（CPS）パケットの数です。これらの損失を評価することができない場合は、ゲートウェイは、このパラメータを省略します。"
    },
    {
      "indent": 3,
      "text": "Interarrival jitter: If a VCC is assigned to the connection, this is the interarrival jitter for ATM cells. If a CID within an AAL2 VCC is assigned to the connection, this is the interarrival jitter for AAL2 common part sublayer (CPS) packets. If this cannot be determined, then it is omitted or set to 0.",
      "ja": "interarrivalジッタ：VCCが接続に割り当てられている場合、これはATMセルのためのinterarrivalジッタです。 AAL2 VCC内のCIDが接続に割り当てられている場合、これはAAL2共通部サブレイヤ（CPS）パケットの到着間ジッタです。これは決定できない場合、それは省略するか、0に設定されています。"
    },
    {
      "indent": 3,
      "text": "Average Transmission Delay: This should be understood to be the average cell transmission delay in both cases: VCC assignment and CID assignment to the connection. This requires the use of ATM performance monitoring techniques. If it is not possible to assess this delay, it is omitted or set to 0.",
      "ja": "平均伝送遅延：VCCの割り当ておよび接続にCIDの割り当て：これは、両方の場合における平均セル伝送遅延であると理解されるべきです。これは、ATMのパフォーマンスモニタリング技術を使用する必要があります。それはこの遅延を評価することができない場合、それは省略するか、0に設定されています。"
    },
    {
      "indent": 3,
      "text": "The following extension parameter is defined for the connection parameters structure:",
      "ja": "次の拡張パラメータは、接続パラメータの構造のために定義されています。"
    },
    {
      "indent": 3,
      "text": "Connection qualification (\"atm/CQ\"): This qualifies the connection with enough granularity to be able to use the other connection parameters without a priori knowledge of network or connection type. Defined values are:",
      "ja": "接続資格（「ATM / CQ」）は：これは、ネットワーク又は接続タイプの先験的な知識なしに、他の接続パラメータを使用することができるようにするために十分な粒度との接続を修飾します。定義された値は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "1 ATM Virtual Circuit Connection (VCC)",
      "ja": "1つのATM仮想回線接続（VCC）"
    },
    {
      "indent": 6,
      "text": "2 AAL2 Channel Identifier (CID)",
      "ja": "2 AAL2チャネル識別子（CID）"
    },
    {
      "indent": 6,
      "text": "3 Direct transfer i.e., without an ATM or other packet path",
      "ja": "すなわち、ATMまたは他のパケットパスなしで3直接転送"
    },
    {
      "indent": 3,
      "text": "When omitted, the connection parameters must be interpreted on one of the following bases:",
      "ja": "省略した場合、接続パラメータは、次の基地の一つに解釈されなければなりません。"
    },
    {
      "indent": 6,
      "text": "* The default interpretations for MGCP in Ref. 36. * The call agent's prior knowledge, if it governs the type of network and connection through the network type 'nt' LCO [Ref. 36] and/or the connection type 'ct' LCO defined here. * The call agent's snooping of the local connection descriptor provided by one or more media gateway. This is used to determine the network and connection type.",
      "ja": "*文献[MGCPのデフォルトの解釈。 36. *コールエージェントの事前の知識を、それがネットワークタイプを介してネットワークとの接続の種類を管理する場合は、「NT」LCO [参考文献。 36]及び/又はここで定義された接続タイプ「CT」LCO。 * 1つ以上のメディアゲートウェイによって提供されるローカル接続記述子のコールエージェントのスヌーピング。これは、ネットワークと接続タイプを決定するために使用されます。"
    },
    {
      "indent": 3,
      "text": "An example of connection parameter encoding for an ATM VCC is the following:",
      "ja": "ATM VCCの接続パラメータ符号化の一例は以下の通りであります："
    },
    {
      "indent": 3,
      "text": "P: PS=1245, OS=59760, PR=1244, OR=59712, PL=20, JI=0, LA=0,atm/CQ=1",
      "ja": "W：1 = PS = 1245、デュー= 59760 = 1244および= 59712で、第二= 20、G = 0、LA = 0、ATM /"
    },
    {
      "indent": 3,
      "text": "Note that the PL value refers to the receive direction and is unrelated to PS. Also, since atm/CQ=1, these parameters refer to ATM cells rather than to AAL2 CPS packets.",
      "ja": "PL値が受信方向を意味し、PSとは無関係であることに留意されたいです。また、ATM以来/ CQ = 1は、これらのパラメータはなくAAL2 CPSパケットによりATMセルを指します。"
    },
    {
      "indent": 3,
      "text": "As in other applications, any of these parameters can be omitted if not relevant to an application. Also, the entire P: structure is optional.",
      "ja": "アプリケーションに関連していない場合は、他のアプリケーションと同様に、これらのパラメータのいずれかを省略することができます。また、全体のP：構造は任意です。"
    },
    {
      "indent": 3,
      "text": "When connection parameters are audited, all parameters normally returned with a delete connection are returned. This includes the connection qualification parameter, atm/CQ.",
      "ja": "接続パラメータが監査されている場合、正常に削除接続して返されるすべてのパラメータが返されます。これは、接続の資格パラメータ、ATM / CQを含んでいます。"
    },
    {
      "indent": 3,
      "text": "The measurement or estimation of some or all of these connection parameters might not be feasible or beneficial in some applications. In such cases, these may be individually omitted, or the entire connection parameters structure, which is optional in MGCP, might be omitted. Further, parameters which indicate impairments might be set to 0 to nullify their impact, if any.",
      "ja": "これらの接続パラメータの一部またはすべての測定または推定が可能か、一部のアプリケーションでは有益ではないかもしれません。このような場合には、これらは、個々に省略されてもよい、またはMGCPで任意である全体の接続パラメータ構造は、省略されるかもしれません。さらに、障害を示すパラメータは、もしあれば、その影響を無効にするために0に設定されるかもしれません。"
    },
    {
      "indent": 0,
      "text": "6.0 Negotiation of Profiles and Codecs in ATM Applications",
      "section_title": true,
      "ja": "ATMアプリケーションでのプロファイルとコーデックの6.0交渉"
    },
    {
      "indent": 0,
      "text": "6.1 Consistency of Parameters",
      "section_title": true,
      "ja": "パラメータの6.1一貫性"
    },
    {
      "indent": 3,
      "text": "For ATM networks, the \"nt\" local connection option in MGCP must be set to \"ATM\".",
      "ja": "ATMネットワークの場合、MGCPで「NT」のローカル接続オプションは、「ATM」に設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "In any ATM application, the following Local Connection Options should not be used:",
      "ja": "すべてのATMアプリケーションでは、以下のローカル接続オプションを使用すべきではありません。"
    },
    {
      "indent": 6,
      "text": "Type of service, L: t Resource reservation, L: r",
      "ja": "トンのリソース予約、L：サービス、LタイプR"
    },
    {
      "indent": 3,
      "text": "This is because the Local Connection Options listed in Table 6 provide information equivalent to the L: t and L: r local connection options.",
      "ja": "TおよびL：ローカル接続オプションをrは、表6に列挙されたローカル接続オプションがLに相当する情報を提供するためです。"
    },
    {
      "indent": 3,
      "text": "The following Local Connection Option is not meaningful in the AAL1 case and should not be used:",
      "ja": "以下のローカル接続オプションは、AAL1のケースでは意味がないため、使用しないでください。"
    },
    {
      "indent": 6,
      "text": "Packetization period, L: p",
      "ja": "パケット化期間、L：P"
    },
    {
      "indent": 3,
      "text": "In AAL2 applications, the following Local Connection Options should not be used:",
      "ja": "AAL2アプリケーションでは、以下のローカル接続オプションを使用すべきではありません。"
    },
    {
      "indent": 6,
      "text": "Encoding algorithm, L: a Packetization period, L: p",
      "ja": "符号化アルゴリズム、L：パケット化期間、L：P"
    },
    {
      "indent": 3,
      "text": "The following ATM Local Connection Options provide equivalent information in the AAL2 case:",
      "ja": "次ATMローカル接続オプションは、AAL2の場合には同等の情報を提供します。"
    },
    {
      "indent": 3,
      "text": "Profile list, L: atm/pfl Priority list of voice codec selections, L: atm/vsel Priority list of voiceband data passthrough codec selections, L: atm/dsel Priority list of fax codec selections, L: atm/fsel",
      "ja": "プロファイルリスト、L：音声コーデックの選択のATM / PFL優先順位リスト、L：音声帯域データパススルーコーデックの選択のATM / VSEL優先順位リスト、L：ファックスコーデックの選択のATM / DSEL優先順位リスト、L：ATM / FSEL"
    },
    {
      "indent": 3,
      "text": "The use of a disallowed local connection option should be flagged with a return code of 524 (inconsistent local connection options). Although it is not recommended that these be ignored, it is recognized some applications choose to do so for the sake of backward compatibility. Note that the inconsistency in this case is between the local connection option (e.g., L:a) and the application (e.g., AAL2) which does not allow it.",
      "ja": "禁止ローカル接続オプションの使用は、524（一貫性のないローカル接続オプション）の戻りコードでフラグを立てなければなりません。これらを無視することはお勧めできませんが、いくつかのアプリケーションは、下位互換性のためにそうすることを選択した認識されています。それを許可しないアプリケーション（例えば、AAL2）：この場合、矛盾の（a例えば、L）ローカル接続オプションの間であることに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "6.2 Codec/Profile Negotiation in ATM Networks",
      "section_title": true,
      "ja": "6.2 ATMネットワークにおけるコーデック/プロファイル交渉"
    },
    {
      "indent": 3,
      "text": "In AAL1 and AAL5 applications, codec negotiation is similar to the IP case, although some of the local connection options and SDP connection descriptor parameters are different. See [18] for conventions for the use of the Session Description Protocol [26] in the ATM context.",
      "ja": "ローカル接続オプションとSDP接続記述子パラメータのいくつかは異なるがAAL1とAAL5のアプリケーションでは、コーデックのネゴシエーションは、IPの場合と同様です。 ATMのコンテキストでセッション記述プロトコル[26]を使用するための規則のために[18]を参照してください。"
    },
    {
      "indent": 3,
      "text": "In AAL2 applications, the L:a and L:p parameters are disallowed. Profile negotiation takes the place of codec negotiation. The remainder of this section addresses how this is done.",
      "ja": "AAL2アプリケーションでは、L：AとL：p個のパラメータが許可されていません。プロフィール交渉はコーデック交渉の行われます。このセクションの残りの部分では、これがどのように行われるか対応しています。"
    },
    {
      "indent": 3,
      "text": "The specifics of the AAL2 bearer are not germane to profile negotiation. The bearer could be PVC-based or SVC-based, based on single-CID or multi-CID VCs, subcell multiplexed or not.",
      "ja": "AAL2ベアラーの詳細は交渉をプロファイルに密接ではありません。 CID-シングルまたはマルチCIDのVCに基づいて、ベアラPVCベースまたはSVCベースことができるが、多重化されたサブセルか。"
    },
    {
      "indent": 3,
      "text": "The most general case involves different prioritized lists of profiles at the originating gateway, the terminating gateway, the originating call agent and the terminating call agent. Whether these lists are based on network policies, end subscriber service level agreements or equipment design is immaterial to the profile negotiation that is done as part of the connection establishment process. It is also irrelevant whether these lists are hardcoded defaults or provisionable. In the connection establishment process, a series of ordered intersections is performed. This leaves a single ordered list in the end. The highest priority profile in this list is the selected profile.",
      "ja": "最も一般的な場合には、発信ゲートウェイ、終端ゲートウェイ、発信呼エージェントと着信呼エージェントでプロファイルの異なる優先順位リストが含まれます。これらのリストは、ネットワークポリシー、エンドユーザのサービスレベル契約や機器の設計に基づいているかどうかは、接続確立プロセスの一部として行われているプロファイル交渉に重要ではありません。これらのリストには、ハードコードデフォルトまたはプロビジョニングされているかどうかも無関係です。接続確立プロセスでは、順序付けられた交差点のシリーズが行われます。これは、最終的には、単一の順序付きリストを残します。このリストで最も優先順位の高いプロファイルは、選択したプロファイルです。"
    },
    {
      "indent": 3,
      "text": "The call agent conveys its priority list through the pfl local connection option. The gateway conveys intersection results through the media information line in SDP [18]. Whether these lists imply a real priority or not, a profile is, as a general rule, preferred to profiles that follow it in a list.",
      "ja": "コールエージェントは、PFLローカル接続オプションを通じて、優先順位リストを伝えます。ゲートウェイは、SDP内のメディア情報ライン[18]を介して交差結果を伝えます。これらのリストは、実際の優先順位を意味するものではありかどうかは、プロファイルは、原則として、リストでそれに続くプロファイルに好ましいです。"
    },
    {
      "indent": 3,
      "text": "Each media gateway has a policy for assigning priorities to different lists (inter-list priority) which is different from the positional ordering of profiles within a list (intra-list priority). This policy might be a hardcoded default or provisioned. The inter-list priority specifies an ordering of the following lists with respect to each other:",
      "ja": "各メディアゲートウェイは、リスト内のプロファイルの位置順序（イントラリストの優先順位）とは異なる別のリストに優先順位を割り当てるためのポリシー（インターリストの優先度）を有しています。このポリシーは、ハードコーディングされたデフォルトまたはプロビジョニングかもしれません。インターリストの優先順位は、互いに関して、以下のリストの順序を指定します。"
    },
    {
      "indent": 6,
      "text": "* 'C-list', which is the priority list from the call agent, received through L: atm/pfl. * 'R-list', which is the priority list from the remote end, received through the SDP remote connection descriptor. * 'L-list', which is the local priority list, hardcoded or provisioned.",
      "ja": "*「C-リスト」、コールエージェントから優先度リストである、Lを介して受信した：ATM / PFL。リモートエンドからの優先度リストである*「R-リスト」は、SDPのリモート接続記述子を介して受信しました。 *「L-list」の、ハードコードさやプロビジョニング、ローカル優先順位リストです。"
    },
    {
      "indent": 3,
      "text": "Depending on the application, different inter-list priorities may be used in cases where the gateway originates and terminates a call.",
      "ja": "用途に応じて、異なるインターリストの優先順位は、ゲートウェイは、コールを発信し、終了する場合に使用することができます。"
    },
    {
      "indent": 3,
      "text": "The policy mentioned above will vary depending on the type, capabilities and deployment of the media gateway. Network administrations or equipment vendors will provision/default this policy for various reasons such as resource usage optimization, quality of service, likelihood of finding a common profile etc.",
      "ja": "上記ポリシーは、メディアゲートウェイの種類、機能及び配置に依存して変化します。ネットワーク行政や機器ベンダーが提供/などのリソース使用量の最適化、サービスの品質、共通プロファイルを見つけるの可能性など、さまざまな理由のために、このポリシーをデフォルト設定されます"
    },
    {
      "indent": 3,
      "text": "When doing an ordered intersection of lists, the intra-list priorities of the highest priority list are used. Any profile that cannot be supported due to resource (bandwidth, processing power etc.) limitations is eliminated from the intersection.",
      "ja": "リストの順序付き交差点を行う場合、最も高い優先度リストの内リストの優先順位が使用されています。リソース（帯域幅、処理能力など）の制限のために支持することができない任意のプロファイルは、交差点から排除されます。"
    },
    {
      "indent": 3,
      "text": "In the absence of one or more of these lists, the remaining list(s) are used in the profile selection process. If the call agent does not provide a list of profiles, the C-list is absent. In this case, the intersection of the C-list, R-list and L-list simply becomes the intersection of the R-list and the L-list. If the R-list is also absent, no intersection is performed and the result of this null operation is the L-list. Previous values, if any, of the C-list and R-list are not used.",
      "ja": "これらのリストのうちの1つまたは複数の不存在下で、残りのリスト（S）は、プロファイル選択プロセスで使用されています。コールエージェントは、プロファイルのリストを提供していない場合は、C-リストは存在しません。この場合、C-リスト、R-リスト及びL-リストの交差点は、単にR-リスト及びL-リストとの交点となります。 Rリストも存在しない場合、交点が行われないと、このヌル演算の結果は、L-リストです。 C-リストおよびR-リストの前の値は、もしあれば、使用されていません。"
    },
    {
      "indent": 3,
      "text": "The process of profile negotiation is as shown below:",
      "ja": "以下に示すように、プロファイル交渉のプロセスは、次のとおりです。"
    },
    {
      "indent": 10,
      "text": "ORIGINATING                     TERMINATING\n      GATEWAY                           GATEWAY",
      "raw": true
    },
    {
      "indent": 3,
      "text": "(1) On receiving CRCX\n    do a policy-based ordered\n    intersection of the C-list,\n    and L-list. No R-list present.\n                      ---------------------------------->\n                      (2)Send resulting ordered list\n                         to the terminating gateway\n                         via SDP.",
      "raw": true
    },
    {
      "indent": 30,
      "text": "                 (3) On receiving CRCX do\n                     a policy-based\n                     ordered\n                     intersection of the\n                     C-list, R-list and\n                     L-list.\n                 (4) The highest priority\n                     profile in the\n                     resulting\n                     list is the\n                     selected\n                      profile.\n<-----------------------------------\n (5) Send selected profile\n     to the originating gateway\n     via SDP.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Prior to receiving the final profile in step 5, if the originating gateway has indicated multiple profiles in step 2, the originating gateway does not always have a usable basis for decoding AAL2 packets. This is because a combination of packet length and UUI (user-to-user indication) codepoint range may indicate different codecs in different profiles. The time lag between when the terminating gateways start sending AAL2 packets and when the originating gateway becomes aware of the selected AAL2 profile should be minimized so that any ensuing clipping of the front-end of the audio stream is tolerable for voice circuits. It is unlikely that this will introduce errors in modem or fax circuits since these will not have entered their user data transfer phase at this time.",
      "ja": "発信ゲートウェイが、ステップ2で複数のプロファイルを示している場合、ステップ5において、最終的なプロファイルを受信する前に、発信側ゲートウェイは常に復号AAL2パケットの使用可能な根拠を有していません。パケット長とUUI（ユーザ対ユーザ指示）コードポイント範囲の組み合わせが異なるプロファイルで異なるコーデックを示すことができるからです。オーディオストリームのフロントエンドの任意のその後のクリッピングは、音声回路のための許容されるように、発信側ゲートウェイが選択されたAAL2プロファイルの認識になったときに、終端ゲートウェイはAAL2パケットの送信を開始したときの間の時間差が最小化されるべきです。これらは、この時点で、ユーザーのデータ転送フェーズに入っていないので、これはモデムまたはFAX回線でのエラーを導入することはほとんどありません。"
    },
    {
      "indent": 3,
      "text": "When connection establishment is complete, there is only one profile associated with a connection. This implies that both endpoints are ready to receive, on the fly, packets that comply with any row in the profile. Some applications may elect to associate profile rows with one or more of the following service types: voice service, voiceband data (modem) passthrough service and fax service. This binding can be by default, through provisioning or as part of profile negotiation during call establishment. Such service type associations, when communicated to another entity, are advisory and do not limit the requirement for supporting, at any time, on-the-fly switches to any profile element.",
      "ja": "接続確立が完了すると、接続に関連付けられた唯一つのプロファイルがあります。これは、両方のエンドポイントが、その場で、プロファイル内の任意の行に準拠するパケットを受信する準備ができていることを意味します。音声サービス、音声帯域データ（モデム）パススルーサービスおよびファックスサービス：一部のアプリケーションでは、次のいずれかのサービスタイプ以上で、プロファイルの行を関連付けるために選ぶことができます。これは、結合は、プロビジョニングを介して、または呼確立時のプロファイルネゴシエーションの一部として、デフォルトですることができます。別のエンティティに伝達そのようなサービスの種類の関連付け、顧問であり、いつでも、任意のプロファイル要素にオンザフライスイッチをサポートするための要件を限定するものではありません。"
    },
    {
      "indent": 3,
      "text": "Media gateways can have internal default (or provisioned) bindings between service types and profile elements. Note that not all of these bindings might be meaningful in an application context (e.g., the fax service binding might be ignored and omitted). As part of profile negotiation, applications might choose to coordinate those bindings that are meaningful. When this is done, the vsel, dsel and fsel LCOs described in this document, and the vsel, dsel and fsel media attribute lines [18] are used to effect this coordination. Using these constructs, entities such as call agents and media gateways can indicate preferred bindings for the first, most preferred profile in a profile list.",
      "ja": "メディアゲートウェイは、内部のデフォルト（またはプロビジョニング）サービスタイプとプロファイル要素間のバインディングを持つことができます。これらのバインディングのないすべてのアプリケーション・コンテキストで意味あるかもしれないことに注意してください（例えば、結合ファックスサービスは無視され、省略される場合があります）。プロフィール交渉の一環として、アプリケーションは有意義であるそれらのバインディングを調整することを選択するかもしれません。この文書に記載され、これが行われ、VSEL、DSELとFSEL LCOS、およびVSEL、DSELとFSELメディア属性行[18]この調整を行うために使用されます。これらの構築物を用いて、そのようなコールエージェントとメディアゲートウェイなどのエンティティは、プロファイルリストの最初の、最も好ましいプロファイルの優先バインディングを示すことができます。"
    },
    {
      "indent": 3,
      "text": "When performing ordered intersections of the C-list, L-list and R-list in the call flow above, media gateways MUST use the inter-list priority to choose between a service to profile row binding suggested by the call agent, the remote gateway or it own internal (provisioned or default) binding. Thus, a service type to profile row binding inherits its relative priority from the profile list generated by the same source. If the C-list has the highest priority, and the first profile in the C-list is selected as the first profile of the intersected list, then any service type to profile row bindings provided by the call agent via the vsel, dsel and fsel LCOs are associated with the first profile. If the R-list has the highest priority, and the first profile in the R-list is selected as the first profile of the intersected list, then any service type to profile row bindings provided by the remote gateway via the vsel, dsel and fsel SDP attributes [18] are associated with the first profile. If the L-list has the highest priority, then any internal (default or provisioned) service to profile row bindings are associated with the first profile. At the end of profile negotiation (step 4 in the call flow above), there is one profile selected by the terminating media gateway. It MAY convey any applicable service type to profile row bindings for this profile to the originating gateway via the vsel, dsel and fsel SDP attributes [18].",
      "ja": "上記コールフローにおけるC-リスト、L-リストおよびR-リストの順序付き交差点を行う場合、メディアゲートウェイは、コールエージェント、リモート・ゲートウェイによって示唆結合行プロファイルにサービス間で選択する間リストの優先順位を使用しなければなりませんまたはそれは内部結合（プロビジョニングまたはデフォルト）を所有しています。したがって、結合行プロファイルするサービスタイプが同じソースによって生成されたプロファイルリストから、その相対的な優先順位を継承します。 Cリストは、最も高い優先度を有し、そしてC-リストの最初のプロファイルが交差リストの最初のプロファイルとして選択された場合、任意のサービスタイプがVSEL、DSELとFSELを介して、コールエージェントによって提供される行のバインディングをプロファイリングしますLCOSは、最初のプロファイルに関連付けられています。 Rリストは、最も高い優先度を有し、そしてR-リストの最初のプロファイルが交差リストの最初のプロファイルとして選択された場合、任意のサービスタイプがVSEL、DSELとFSELを介してリモート・ゲートウェイによって提供される行のバインディングをプロファイリングしますSDP属性[18]は最初のプロファイルに関連付けられています。 L-リストは最も高い優先順位を有する場合、任意の内部（デフォルトまたはプロビジョニング）サービスは、行バインディングをプロファイリングするための最初のプロファイルに関連付けられています。プロファイルネゴシエーション（上記コールフローのステップ4）の終了時に、終端メディアゲートウェイにより選択された1つのプロファイルが存在します。これは、VSELを介して発信ゲートウェイにDSELを、このプロファイルの列バインディングをプロファイリングするために、任意の適用可能なサービスの種類を伝えることができるとFSEL SDP属性[18]。"
    },
    {
      "indent": 3,
      "text": "If the first profile in the intersected list is not the first profile in the highest priority profile list, then any service to profile row bindings associated with the highest priority profile list cannot be used with the first (or only profile) in the intersected list. In this case, the originating or terminating media gateway MUST attempt to associate internal (default or provisioned) service to profile row bindings with the first (or only profile) in the intersected list.",
      "ja": "交差リストの最初のプロファイルは最も優先順位の高いプロファイルリストの最初のプロファイルでない場合、任意のサービスプロファイルに行最も優先順位の高いプロファイルリストに関連付けられているバインディングが交差リスト内の最初の（または唯一のプロファイル）と一緒に使用することができません。この場合、発信又は終端するメディアゲートウェイが交差リスト内の最初の（または唯一のプロファイル）と行・バインディングをプロファイルする内部（デフォルトまたはプロビジョニング）サービスを関連付けしようとしなければなりません。"
    },
    {
      "indent": 3,
      "text": "Since there is more than one service type, it is possible that the service type to profile row bindings for the first profile in the intersected list be derived from different sources (the call agent, the remote media gateway, internal defaults or provisioning). For consistency, if the voiceband data (passthrough) service mappings include fax, then a different set of fax service mappings cannot apply to the profile under consideration. If applied in this case, the set of fax service mappings must include the same codecs, packet lengths and packetization periods as the voiceband data service mappings. However, they may be in a different order.",
      "ja": "複数のサービスの種類があるので、サービスの種類が異なるソース（コールエージェント、リモートメディアゲートウェイ、内部デフォルトまたはプロビジョニング）に由来する交差リストの最初のプロファイルの行バインディングをプロファイリングすることが可能です。音声帯域データ（パススルー）サービスマッピングは、ファックス、ファックスサービスマッピングの後、別のセットが含まれている場合に一貫性を保つため、検討中のプロファイルに適用することはできません。この場合に適用した場合、ファックスサービスマッピングのセットは、音声帯域データサービスのマッピングと同じコーデック、パケット長およびパケット化期間を含める必要があります。しかし、彼らは異なる順序であってもよいです。"
    },
    {
      "indent": 3,
      "text": "If the media gateway lumps fax service with voiceband data (modem) passthrough service, then it can ignore any fax service to profile row bindings provided by another entity such as the call agent or the remote gateway. From the media gateway's perspective, there is no distinct fax service in this case. In this case, the media gateway will not indicate a separate preference for the use of certain profile rows in conjunction with fax service.",
      "ja": "メディアゲートウェイは、音声帯域データ（モデム）パススルーサービスとファックスサービスを塊場合、それは、コールエージェントまたはリモートゲートウェイなどの別のエンティティによって提供されるプロファイル行バインディングに任意のFAXサービスを無視することができます。メディアゲートウェイの視点から、この場合には明確なファックスサービスはありません。この場合、メディアゲートウェイは、FAXサービスと併せて特定のプロファイルの行を使用するための別選好を示さないであろう。"
    },
    {
      "indent": 3,
      "text": "It is possible that the procedure described in this section for associating service types with profile rows fail to yield mappings between a given service type and the row(s) of the first profile in the intersected list of profiles. This is acceptable since these bindings are merely indications of the preferred codecs and packetizations in the context of a given service. They do not obviate the AAL2 requirement that, given a profile that is bound to a connection, a transmitter may switch to any profile row on the fly.",
      "ja": "プロファイルの行とサービスタイプを関連付けるために、このセクションで説明する手順は、プロファイルの交差リストの最初のプロファイルの所与のサービスタイプと行との間のマッピングを得ることができない可能性があります。これらのバインディングは、単に指定されたサービスのコンテキストにおいて好ましいコーデックとpacketizationsの指標であるので、これは許容可能です。彼らは、接続にバインドされているプロファイルが与えられると、送信機はその場でどのプロファイル行に切り替えてもよいAAL2要件を排除していません。"
    },
    {
      "indent": 3,
      "text": "An example of profile negotiation:",
      "ja": "プロフィール交渉の例："
    },
    {
      "indent": 3,
      "text": "The L-list at gateway #1, which is the originating gateway in this example, is:",
      "ja": "この例では、発信ゲートウェイであるゲートウェイ＃1、でL-listは、次のとおりです。"
    },
    {
      "indent": 6,
      "text": "custom 100, itu 3, itu 1, itu 8",
      "ja": "カスタム100、第三、第一、8"
    },
    {
      "indent": 3,
      "text": "The L-list at gateway #2, which is the terminating gateway in this example, is:",
      "ja": "この例では、終端ゲートウェイであるゲートウェイ＃2におけるL-listは、次のとおりです。"
    },
    {
      "indent": 6,
      "text": "itu 2, itu 3, itu 1, itu 5",
      "ja": "第二、第三、第一、5"
    },
    {
      "indent": 3,
      "text": "The originating call agent sends the following profile list (C-list) to the originating gateway in the first create connection command:",
      "ja": "発呼エージェントは、最初の接続コマンドを作成するに発信ゲートウェイに次のプロファイルリスト（C-リスト）を送信します。"
    },
    {
      "indent": 6,
      "text": "itu 8, itu 9, atmf 7, itu 3, itu 1, custom 100",
      "ja": "7 ATMF第八、第九、第三、第一、カスタム100"
    },
    {
      "indent": 3,
      "text": "Further, the originating call agent qualifies the first profile in its list with the following service type bindings:",
      "ja": "さらに、発信コールエージェントは、以下のサービスタイプのバインディングとそのリストの最初のプロファイルは、資格："
    },
    {
      "indent": 6,
      "text": "L: atm/vsel:\"G729 10 10000\", atm/dsel:\"on PCMU 40 5000\"",
      "ja": "L：ATM / VSEL： \"G729 10万\"、気圧/ DSEL： \"5000 PCMU 40の\""
    },
    {
      "indent": 3,
      "text": "There is no atm/fsel local connection option. Facsimile is included with voiceband data in the atm/dsel local connection option.",
      "ja": "何のATM / FSELローカル接続オプションがありません。ファクシミリは、ATM / DSELローカル接続オプションで音声帯域データに含まれています。"
    },
    {
      "indent": 3,
      "text": "In step 1 at the originating gateway, there is no remote connection descriptor, hence no R-list. The policy for originating calls at gateway #1 is:",
      "ja": "発信側ゲートウェイでステップ1において、いかなるリモート接続記述子、したがってないR-リストは存在しません。ゲートウェイ＃1での通話を発信するための方針は以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "C-List > R-list > L-list",
      "ja": "C-一覧> R-リスト> L-リスト"
    },
    {
      "indent": 3,
      "text": "where '>' means 'has higher priority than'. The term 'R-list' can be omitted from this series of inequalities since, in case under study, profile negotiation does not include any further ordered intersections at the originating gateway.",
      "ja": "どこ「>」が「がより高い優先度を持っている」という意味。研究対象の場合には、プロファイルの交渉が発信ゲートウェイで任意の更なる注文交差点が含まれていない、ので、用語「R-リストは、」不平等のこのシリーズから省略することができます。"
    },
    {
      "indent": 3,
      "text": "In accordance with this policy, the originating gateway performs an ordered intersection of the C-list and the L-list to produce:",
      "ja": "この方針に従って、発信側ゲートウェイは、C-リストおよび生成するL-リストの順序付き交差点を実行します。"
    },
    {
      "indent": 6,
      "text": "itu 8, itu 3, itu 1, custom 100",
      "ja": "、第三、第一、カスタム100 8ました"
    },
    {
      "indent": 3,
      "text": "Since the C-list has the highest priority and the first profile in the intersected profile list is also the first profile in the C-list, the service bindings provided by the originating call agent are associated with the first profile, itu 8. The originating gateway sends this result(intersected profile list and service bindings for the first profile, itu 8) via the SDP remote session descriptor to the terminating gateway. The service bindings are expressed as follows [18]:",
      "ja": "Cリストは、最も高い優先順位と交差プロファイルリストの最初のプロファイルはまた、C-リストの最初のプロファイルであるているので、発呼エージェントによって提供されるサービスバインディングは、最初のプロファイルに関連付けられている発信8 ITUゲートウェイは、終端ゲートウェイへのリモートSDPセッション記述を介して（ITU 8、最初のプロファイルの交差プロファイルリストとサービスバインディング）この結果を送信します。次のようにサービスバインディングが発現されている[18]。"
    },
    {
      "indent": 6,
      "text": "a=vsel:G729 10 10000 a=dsel:on PCMU 40 5000",
      "ja": "= VSEL：G729 10万= DSEL：PCMU 40 5000に"
    },
    {
      "indent": 3,
      "text": "The intersected profile list produced by gateway 1 becomes the R-list for gateway #2. The terminating call agent sends the following profile list (C-list) to the terminating gateway in the first create connection command:",
      "ja": "ゲートウェイ1により産生さ交差プロファイルリストは、ゲートウェイ＃2のR-リストとなります。着信コールエージェントは、最初の接続コマンドを作成するに終端ゲートウェイに次のプロファイルリスト（C-リスト）を送信します。"
    },
    {
      "indent": 6,
      "text": "itu 1, itu 4, itu 3, custom 110, custom 100, itu 2",
      "ja": "第1、第4、第三の、カスタム110、カスタム100、2"
    },
    {
      "indent": 3,
      "text": "Any service bindings (not shown) sent by the terminating call agent apply to the first profile in this list, itu 1.",
      "ja": "着信呼エージェントによって送信されたサービスバインディング（図示しない）1 ITU、このリストの最初のプロファイルに適用されます。"
    },
    {
      "indent": 3,
      "text": "The policy for terminating calls at gateway #2 is:",
      "ja": "ゲートウェイ＃2で呼を終了するためのポリシーです。"
    },
    {
      "indent": 6,
      "text": "R-list > L-list > C-list",
      "ja": "Rリスト> L-リスト> C-リスト"
    },
    {
      "indent": 3,
      "text": "Using this policy, gateway #2 produces the following ordered intersection of R-list, L-list and C-list:",
      "ja": "このポリシーを使用して、ゲートウェイ＃2はR-リスト、L-リスト及びC-リストの次の順序の交差点を生成します。"
    },
    {
      "indent": 6,
      "text": "itu 3, itu 1",
      "ja": "第一"
    },
    {
      "indent": 3,
      "text": "The first profile in this list, itu 3, is to be used for this connection. Gateway 2 indicates this to the call agent through the SDP local connection descriptor.",
      "ja": "このリストの最初のプロファイル、ITU 3は、この接続のために使用されます。ゲートウェイ2は、SDPローカル接続記述子を通じてコールエージェントにこれを示しています。"
    },
    {
      "indent": 3,
      "text": "Note that the service bindings provided by the originating gateway have not been specified with respect to itu 3. Therefore, these cannot be used even though the R-list has the highest priority at the terminating gateway. Any existing internal (default or provisioned) service bindings for AAL2 profile itu 3 must be associated by the terminating gateway with the selected profile, itu 3. Those service bindings that are internally unavailable are left unspecified.",
      "ja": "発信ゲートウェイによって提供されるサービスバインディングをしたがって3. ITUに対して指定されていないことに留意されたい、これらはR-リストは、終端ゲートウェイで最も高い優先度を有していても使用することができません。 AAL2プロファイルITU 3の既存の（デフォルトまたはプロビジョニング）内部サービスバインディングが選択されたプロファイルと終端ゲートウェイによって関連付けられている必要があり、内部で利用できないITU 3.これらのサービスバインディングは未指定のままにされています。"
    },
    {
      "indent": 3,
      "text": "Since the internal service type bindings do exist for the profile itu 3 at the terminating gateway, they are selected and bound to the connection. In these, fax service is lumped with voiceband data passthrough. These bindings are indicated to the originating gateway via the following SDP media attribute lines:",
      "ja": "内部サービスタイプバインディングが終端ゲートウェイにおける輪郭ITU 3のために存在しないので、それらを選択し、接続に結合されています。これらには、ファックスサービスは、音声帯域データパススルーに集中しています。これらのバインディングは、以下のSDPメディア属性ラインを介して発信ゲートウェイに示されています。"
    },
    {
      "indent": 6,
      "text": "a=vsel:G726-32 20 5000 G726-24 15 5000 a=dsel:on PCMU 40 5000 G726-40 25 5000",
      "ja": "= VSEL：G726-32 20 5000 G726-24 15 5000 = DSEL：PCMU 40 5000 G726-40 25 5000に"
    },
    {
      "indent": 3,
      "text": "The vsel line maps voice service to certain rows in the itu 3 profile table. The dsel line maps voiceband data service to certain rows in the itu 3 profile table. The \"on\" in the dsel line indicates that voiceband data includes fax, otherwise a separate fsel line might have been used. Two codecs each are indicated for voice and for voiceband data, with the first codec being the preferred one. Although the originating gateway is not constrained by these advisory indications of profile element to service type mapping, applications may choose to limit on-the-fly switches based on the current service state (voice, voiceband data etc.). If done, this provides greater simplicity at the expense of flexibility.",
      "ja": "VSEL​​ラインは、ITU 3プロファイルテーブル内の特定の行に音声サービスをマッピングします。 DSELラインは、ITU 3プロファイルテーブル内の特定の行への音声帯域データサービスをマッピングします。 「オン」DSELラインに音声帯域データは、そうでない場合は、別FSELラインが使用されている可能性があり、ファックスが含まれていることを示しています。二つコーデック各々は、第コーデックは好ましいものであることと、音声および音声帯域データのために示されています。発信ゲートウェイがサービスタイプへのマッピングプロファイル要素のこれらの諮問指示によって制約されていないが、アプリケーションは、現在のサービス状態（音声、音声帯域データ等）に基づいてオンザフライスイッチを制限することを選択することができます。行われた場合、これは柔軟性を犠牲にしてより大きな単純さを提供します。"
    },
    {
      "indent": 0,
      "text": "7.0 Security Considerations",
      "section_title": true,
      "ja": "7.0セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The ATM package extends the base Media Gateway Control Protocol (MGCP) [36]. This package specifies no additional security requirements or recommendations over those of the base MGCP protocol.",
      "ja": "ATMパッケージは、ベースメディアゲートウェイ制御プロトコル（MGCP）[36]を延びています。このパッケージは、ベースMGCPプロトコルのものよりも追加のセキュリティ要件や推奨を指定します。"
    },
    {
      "indent": 0,
      "text": "8.0 IANA Considerations",
      "section_title": true,
      "ja": "8.0 IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The ATM package described in this document has been registered as an MGCP package under the name \"atm\", without the quotes. The current version of this package is 0 (default). This registration has been completed per the IANA considerations in the MGCP specification [36].",
      "ja": "この文書で説明したATMパッケージは、引用符なしで、名前「気圧」の下のMGCPパッケージとして登録されています。このパッケージの現在のバージョンは、0（デフォルト）です。この登録は、[36] MGCP仕様にIANA問題ごとに完了しました。"
    },
    {
      "indent": 3,
      "text": "The contact for the MGCP ATM package is the author of this document (Section 12).",
      "ja": "MGCP ATMパッケージの接触は、この文書（第12条）の著者です。"
    },
    {
      "indent": 0,
      "text": "9.0 References",
      "section_title": true,
      "ja": "9.0参考資料"
    },
    {
      "indent": 3,
      "text": "[1] ITU-T I.366.1, B-ISDN ATM Adaptation Layer Specification: Type 1 AAL.",
      "ja": "[1] ITU-TのI.366.1、B-ISDN ATMアダプテーションレイヤ仕様：タイプ1 AAL。"
    },
    {
      "indent": 3,
      "text": "[2] ITU-T I.366.2, AAL Type 2 Reassembly Service Specific Convergence Sublayer for Trunking, Nov. 2000.",
      "ja": "[2] ITU-T I.366.2、トランキング、2000年11月のためのAALタイプ2再構成サービス特定収束サブレイヤ。"
    },
    {
      "indent": 3,
      "text": "[3] af-vtoa-0113.000, ATM trunking using AAL2 for narrowband services.",
      "ja": "[3] AF-VTOA-0113.000、ATMは、狭帯域サービスのためのAAL2を使用してトランキング。"
    },
    {
      "indent": 3,
      "text": "[4] ITU Q. 2965.1, Digital subscriber signalling system no.2 (DSS 2) - Support of Quality of Service classes.",
      "ja": "[4] ITU Q. 2965.1、デジタル加入者シグナリングシステム番号2（DSS 2） - サービスクラスの品質のサポート。"
    },
    {
      "indent": 3,
      "text": "[5] ITU Q.2961, Digital subscriber signalling system no.2 (DSS 2) - additional traffic parameters. Also, Amendment 2 to Q.2961.",
      "ja": "[5] ITU Q.2961、デジタル加入者シグナリングシステム番号2（DSS 2） - 追加のトラフィックパラメータ。また、Q.2961に修正2。"
    },
    {
      "indent": 3,
      "text": "[6] ATMF UNI 4.0 Signaling Specification, af-sig-0061.000.",
      "ja": "の-0061.000 [6] ATMF UNI 4.0シグナリング仕様。"
    },
    {
      "indent": 3,
      "text": "[7] ITU Q. 2965.2, Digital subscriber signalling system no.2 (DSS 2) - Signalling of individual Quality of Service parameters.",
      "ja": "[7] ITU Q. 2965.2、デジタル加入者シグナリングシステム番号2（DSS 2） - サービスパラメータの個々の品質のシグナリング。"
    },
    {
      "indent": 3,
      "text": "[8] ATMF Traffic Management Specification, Version 4.1, af-tm-0121.000.",
      "ja": "[8] ATMFトラフィック管理仕様、バージョン4.1、AF-TM-0121.000。"
    },
    {
      "indent": 3,
      "text": "[9] I.356, BISDN ATM layer cell transfer performance.",
      "ja": "[9] I.356、BISDN ATMレイヤセル転送性能。"
    },
    {
      "indent": 3,
      "text": "[10] ITU-T I.363.2, B-ISDN ATM Adaptation Layer Specification: Type 2 AAL, Sept. 1997.",
      "ja": "[10] ITU-T I. 363.2、B-ISDN ATMアダプテーションレイヤ仕様：タイプ2 AAL、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[11] ITU-T I.366.1, Segmentation and Reassembly Service Specific Convergence Sublayer for AAL Type 2, June 1998.",
      "ja": "[11] AALタイプ2のためのITU-T I.366.1、分割及び再組立てサービス特定コンバージェンスサブレイヤ、1998年6月。"
    },
    {
      "indent": 3,
      "text": "[12] H.323-2, Packet-based multimedia communications systems.",
      "ja": "[12] H.323-2、パケットベースのマルチメディア通信システム。"
    },
    {
      "indent": 3,
      "text": "[13] af-vtoa-0083.000, Voice and Telephony Over ATM to the Desktop.",
      "ja": "[13] AF-VTOA-0083.000、デスクトップへの音声およびテレフォニーオーバーATM。"
    },
    {
      "indent": 3,
      "text": "[14] Q.2110, B-ISDN ATM adaptation layer - service specific connection oriented protocol (SSCOP).",
      "ja": "[14] Q.2110、B-ISDN ATMアダプテーションレイヤ - サービス特定コネクション型プロトコル（SSCOP）。"
    },
    {
      "indent": 3,
      "text": "[15] I.365.1,Frame relaying service specific convergence sublayer (FR-SSCS).",
      "ja": "[15] I.365.1、フレーム中継サービス特定収束サブレイヤ（FR-SSCS）。"
    },
    {
      "indent": 3,
      "text": "[16] I.365.2, B-ISDN ATM adaptation layer sublayers: service specific coordination function to provide the connection oriented network service.",
      "ja": "[16] I.365.2、B-ISDN ATMアダプテーションレイヤのサブレイヤ：接続指向のネットワークサービスを提供するサービス特定コーディネーション機能。"
    },
    {
      "indent": 3,
      "text": "[17] I.365.3, B-ISDN ATM adaptation layer sublayers: service specific coordination function to provide the connection-oriented transport service.",
      "ja": "[17] I.365.3、B-ISDN ATMアダプテーションレイヤのサブレイヤ：コネクション型トランスポート・サービスを提供するサービス特定コーディネーション機能。"
    },
    {
      "indent": 3,
      "text": "[18] Kumar, R. and M. Mostafa, \"Conventions for the use of the Session Description Protocol (SDP) for ATM Bearer Connections\", RFC 3108, May 2001.",
      "ja": "[18]クマー、R.及びM.モスタファ、 \"ATMベアラ接続のためのセッション記述プロトコル（SDP）を使用するための規則\"、RFC 3108、2001年5月。"
    },
    {
      "indent": 3,
      "text": "[19] ITU I.371, Traffic Control and Congestion Control in the BISDN.",
      "ja": "BISDNに[19] ITU I.371、トラフィック制御と輻輳制御。"
    },
    {
      "indent": 3,
      "text": "[20] ATMF Circuit Emulation Service (CES) Interoperability Specification, af-vtoa-0078.000.",
      "ja": "[20] ATMF回線エミュレーションサービス（CES）の相互運用性仕様、VTOA-の-0078.000。"
    },
    {
      "indent": 3,
      "text": "[21] af-vmoa-0145.000, Voice and Multimedia over ATM, Loop Emulation Service using AAL2.",
      "ja": "[21] AF-vmoa-0145.000、AAL2を使用して音声およびマルチメディアATM上、ループエミュレーションサービス。"
    },
    {
      "indent": 3,
      "text": "[22] ITU-T H.222.1, Multimedia multiplex and synchronization for audiovisual communication in ATM environments.",
      "ja": "[22] ITU-T H.222.1、ATM環境での映像通信のためのマルチメディア多重化および同期。"
    },
    {
      "indent": 3,
      "text": "[23] FRF.5, Frame Relay/ATM PVC Network Interworking Implementation Agreement.",
      "ja": "[23] FRF.5は、フレームリレー/ ATM PVCネットワーク実装合意書をインターワーキング。"
    },
    {
      "indent": 3,
      "text": "[24] FRF.8, Frame Relay/ATM PVC Service Interworking Implementation Agreement.",
      "ja": "[24] FRF.8は、フレームリレー/ ATM PVCサービスは、実装合意書をインターワーキング。"
    },
    {
      "indent": 3,
      "text": "[25] FRF.11, Voice over Frame Relay Implementation Agreement.",
      "ja": "[25] FRF.11、音声フレームリレーの実装協定を超えます。"
    },
    {
      "indent": 3,
      "text": "[26] Handley, M. and V. Jacobson, \"SDP: Session Description Protocol\", RFC 2327, April 1998.",
      "ja": "[26]ハンドレー、M.およびV. Jacobsonの \"SDP：セッション記述プロトコル\"、RFC 2327、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[27] ITU-T I.363.5, B-ISDN ATM Adaptation Layer Specification: Type 5 AAL, Aug. 1996.",
      "ja": "[27] ITU-T I.363.5、B-ISDN ATMアダプテーションレイヤ仕様：タイプ5 AAL、1996年8月。"
    },
    {
      "indent": 3,
      "text": "[28] I.365.4, B-ISDN ATM adaptation layer sublayers: Service specific convergence sublayer for HDLC applications.",
      "ja": "[28] I.365.4、B-ISDN ATMアダプテーションレイヤのサブレイヤ：HDLCアプリケーションのためのサービス特定収束サブレイヤ。"
    },
    {
      "indent": 3,
      "text": "[29] ITU-T Q.2931, B-ISDN Application Protocol for Access Signaling.",
      "ja": "アクセスシグナリングのための[29] ITU-T Q.2931、B-ISDNアプリケーションプロトコル。"
    },
    {
      "indent": 3,
      "text": "[30] ITU Q.765.5, Application Transport Mechanism - Bearer Independent Call Control.",
      "ja": "[30] ITU Q.765.5、アプリケーション転送メカニズム - ベアラ独立呼制御。"
    },
    {
      "indent": 3,
      "text": "[31] http://www.3gpp.org/ftp/Specs for specifications related to 3GPP, including AMR codecs.",
      "ja": "[31] http://www.3gpp.org/ftp/Specs AMRコーデックを含む3GPP、に関する仕様について。"
    },
    {
      "indent": 3,
      "text": "[32] ITU Q.931, Digital Subscriber Signaling System No. 1: Network Layer.",
      "ja": "[32] ITU Q.931、デジタル加入者シグナリングシステム1号：ネットワーク層。"
    },
    {
      "indent": 3,
      "text": "[33] ITU Q.763, SS7 - ISUP formats and codes.",
      "ja": "[33] ITU Q.763、SS7  -  ISUPフォーマットとコード。"
    },
    {
      "indent": 3,
      "text": "[34] http://www.iana.org/assignments/rtp-parameters",
      "ja": "「３４」 ｈっｔｐ：／／ｗっｗ。いあな。おｒｇ／あっしｇんめんｔｓ／ｒｔｐーぱらめてｒｓ"
    },
    {
      "indent": 3,
      "text": "[35] ATMF Voice and Telephony over ATM - ATM Trunking using AAL1 for Narrowband Services, version 1.0, af-vtoa-0089.000, July 1997.",
      "ja": "ATM上の[35] ATMF音声とテレフォニー - 狭帯域サービス、バージョン1.0のためのAAL1を使用してATMトランキング、AF-VTOA-0089.000、1997年7月。"
    },
    {
      "indent": 3,
      "text": "[36] Andreasen, F. and B. Foster, \"Media Gateway Control Protocol (MGCP) Version 1.0\", RFC 3435, January 2003.",
      "ja": "[36]アンドレア、F.およびB.フォスター、 \"メディアゲートウェイコントロールプロトコル（MGCP）バージョン1.0\"、RFC 3435、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[37] Handley, M. and V. Jacobson, \"SDP: Session Description Protocol\", RFC 2327, April 1998.",
      "ja": "[37]ハンドレー、M.およびV. Jacobsonの \"SDP：セッション記述プロトコル\"、RFC 2327、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[38] Foster, B., \"MGCP CAS Packages\", RFC 3064, February 2001.",
      "ja": "[38]フォスター、B.、 \"MGCP CASパッケージ\"、RFC 3064、2001年2月。"
    },
    {
      "indent": 0,
      "text": "10.0 Acronyms",
      "section_title": true,
      "ja": "10.0略語"
    },
    {
      "indent": 3,
      "text": "AAL ATM Adaptation Layer ABR Available Bit Rate ABT/DT ATM Block Transfer/Delayed Transmission ABT/IT ATM Block Transfer/Immediate Transmission ATM Asynchronous Transfer Mode ATMF ATM Forum BCG Bearer Connection Group CAS Channel Associated Signaling CBR Constant Bit Rate CDV Cell Delay Variation CDVT Cell Delay Variation Tolerance CID Channel Identifier CLR Cell Loss Ratio CPS Common Part Sublayer DBR Deterministic Bit Rate FEC Forward Error Correction FRF Frame Relay Format GFR Guaranteed Frame Rate GWID Gateway Identifier IP Internet Protocol ITU International Telecommunications Union LCO Local Connection Option MBS Maximum Burst Size MCR Minimum Cell Rate MFS Maximum Frame Size MGCP Media Gateway Control Protocol nrt-VBR Non-real-time Variable Bit Rate NSAP Network Service Access Point PCR Peak Cell Rate PDU Protocol Data Unit PVC Permanent Virtual Circuit QoS Quality of Service rt-VBR Real-time Variable Bit Rate SAR Segmentation and Re-assembly SCR Sustained Cell Rate SDT Structured Data Transfer SDU Service Data Unit SPVC Switched Permanent Virtual Circuit SRTS Synchronous Residual Time-Stamp SSCOP Service-specific Connection Oriented Protocol SSSAR Service-specific Segmentation and Re-assembly SVC Switched Virtual Circuit TDM Time-Division Multiplexing UBR Unspecified Bit Rate UDT Unstructured Data Transfer VC Virtual Circuit",
      "ja": "AAL ATMアダプテーションレイヤのABR使用可能ビットレートABT / DT ATMブロック転送/遅延送信ABT / IT ATMブロック転送/直接送信ATM非同期転送モードATMF ATMフォーラムBCGベアラ接続グループCASチャネル連携信号CBR固定ビットレートCDVのセル遅延変動CDVTセル遅延変動許容CIDチャネル識別子CLRセル廃棄率CPS共通パートサブレイヤDBR決定的ビットレートFEC前方誤り訂正のFRFフレームリレー形式GFR保証フレームレートGWIDゲートウェイの識別子IPインターネットプロトコルITU国際電気通信連合LCOローカル接続オプションは、最大バーストサイズMCRをMBSサービスRT-VBRリアルタイムの最小セルレートMFS最大フレームサイズMGCPメディアゲートウェイコントロールプロトコルNRT-VBR非リアルタイム可変ビットレートNSAPネットワークサービスアクセスポイントPCRピークセルレートPDUプロトコルデータユニットPVCパーマネント・バーチャル・サーキットのQoS品質可変ビットレートSARセグメンテーションと再アセンブリSCR維持セル・レートSDT StructurデータがSDUサービスデータユニットSPVCは、SVCは、仮想回線TDM時分割多重UBR未指定ビットレートUDT非構造化データを交換恒久仮想回線SRTS同期残余タイムスタンプSSCOPサービス固有コネクション型プロトコルSSSARサービス固有のセグメンテーションと再アセンブリを交換転送編VC仮想回線を転送"
    },
    {
      "indent": 3,
      "text": "VCCI Virtual Circuit Connection Identifier VCI Virtual Circuit Identifier VP Virtual Path VPCI Virtual Path Connection Identifier VPI Virtual Path Identifier",
      "ja": "VCCI仮想回線接続識別子VCIバーチャルサーキット識別子VP仮想パスVPCI仮想パス接続識別子VPI仮想パス識別子"
    },
    {
      "indent": 0,
      "text": "11.0 Acknowledgements",
      "section_title": true,
      "ja": "11.0謝辞"
    },
    {
      "indent": 3,
      "text": "The author wishes to thank several colleagues at Cisco and the industry who have contributed towards the development of the MGCP ATM package, and who have implemented and tested these constructs. Special thanks are due to Bill Foster, Flemming Andreasen, Raghu Thirumalai Rajan, Joe Stone, Hisham Abdelhamid, Joseph Swaminathan, Sushma Srikanth, Amit Agrawal, Mohamed Mostafa, Latha Idury, David Auerbach and Robert Biskner of Cisco systems and to Mahamood Hussain of Hughes Software Systems for their contributions. Finally, thanks are due to Scott Bradner for guiding the final phase of the publication of this document.",
      "ja": "著者は、シスコおよびMGCP ATMパッケージの開発、そして誰が実施され、これらの構成をテストしている方に貢献してきた業界で、いくつかの同僚に感謝したいです。特別な感謝は、シスコシステムのビル・フォスター、フレミングAndreasenの、ラグーティルマライラジャン、ジョー・ストーン、ヒシャムAbdelhamid、ジョセフ・スワミナサン、Sushmaスリカンス、アミットAgrawalさん、モハメド・ムスタファ、Latha Idury、デビッド・アウエルバッハとロバートBisknerへとヒューズのMahamoodフセインによるものです彼らの貢献のためのソフトウェアシステム。最後に、おかげで、この文書の出版物の最終段階を案内するためのスコット・ブラッドナーによるものです。"
    },
    {
      "indent": 0,
      "text": "12.0 Author's Address",
      "section_title": true,
      "ja": "12.0著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Rajesh Kumar Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134-1706",
      "ja": "ラジェッシュクマーシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、CA 95134-1706"
    },
    {
      "indent": 3,
      "text": "Phone: 1-408-527-0811 EMail: rkumar@cisco.com",
      "ja": "電話：1-408-527-0811 Eメール：rkumar@cisco.com"
    },
    {
      "indent": 0,
      "text": "13.0 Full Copyright Statement",
      "section_title": true,
      "ja": "13.0完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}