{
  "title": {
    "text": "RFC 3634 - Key Distribution Center (KDC) Server Address Sub-option for the Dynamic Host Configuration Protocol (DHCP) CableLabs Client Configuration (CCC) Option",
    "ja": "RFC 3634 - キーディストリビューションセンター（KDC）ダイナミックホスト構成プロトコル（DHCP）CableLabsクライアント構成（CCC）オプションのサーバーアドレスサブオプション"
  },
  "number": 3634,
  "created_at": "2023-10-13 07:17:55.645890+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          K. Luehrs\nRequest for Comments: 3634                                     CableLabs\nCategory: Standards Track                                      R. Woundy\n                                                           Comcast Cable\n                                                           J. Bevilacqua\n                                                              N. Davoust\n                                                         YAS Corporation\n                                                           December 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Key Distribution Center (KDC) Server Address Sub-option for the Dynamic Host Configuration Protocol (DHCP) CableLabs Client Configuration (CCC) Option",
      "ja": "キーディストリビューションセンター（KDC）ダイナミックホスト構成プロトコル（DHCP）CableLabsクライアント構成（CCC）オプションのサーバーアドレスサブオプション"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document defines a new sub-option for the CableLabs Client Configuration (CCC) Dynamic Host Configuration Protocol (DHCP) option code for conveying the network addresses of Key Distribution Center (KDC) servers.",
      "ja": "このドキュメントでは、キーディストリビューションセンター（KDC）サーバーのネットワークアドレスを操作するためのCableLabsクライアント構成（CCC）動的ホスト構成プロトコル（DHCP）オプションコードの新しいサブオプションを定義します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "A CableLabs Client Configuration (CCC) Dynamic Host Configuration Protocol (DHCP) Option code providing the Key Distribution Center (KDC) server address will be needed for CableHome-compliant residential gateways configured to use Kerberos for authentication as the first step in establishing a secure SNMPv3 link between the Portal Service (PS) logical element [2,3] in residential gateways, and the SNMP entity in the cable operator's data network.",
      "ja": "CableLabsクライアント構成（CCC）ダイナミックホスト構成プロトコル（DHCP）オプションコードキーディストリビューションセンター（KDC）サーバーアドレスを提供するケーブルホームに準拠した住宅ゲートウェイには、安全なSNMPV3住宅ゲートウェイのポータルサービス（PS）論理要素[2,3]と、ケーブルオペレーターのデータネットワークのSNMPエンティティとのリンク。"
    },
    {
      "indent": 3,
      "text": "The CCC DHCP option code will be used to address specific needs of CableLabs client devices during their configuration processes. This document proposes a sub-option for the CCC DHCP option.",
      "ja": "CCC DHCPオプションコードは、構成プロセス中にCableLabsクライアントデバイスの特定のニーズに対応するために使用されます。このドキュメントは、CCC DHCPオプションのサブオプションを提案しています。"
    },
    {
      "indent": 3,
      "text": "Configuration of a class of CableLabs client devices described in [2] and [3] will require a DHCP sub-option to provide the client with the network address of a KDC server in the cable operator's data network.",
      "ja": "[2]および[3]で説明されているCableLabsクライアントデバイスのクラスの構成では、ケーブルオペレーターのデータネットワーク内のKDCサーバーのネットワークアドレスをクライアントに提供するためにDHCPサブオプションが必要です。"
    },
    {
      "indent": 3,
      "text": "The class of devices assumed in [2] and [3] is unlike the class of devices considered in [1], which perform a DNS lookup of the Kerberos Realm name to find the KDC server network address.",
      "ja": "[2]および[3]で想定されるデバイスのクラスは、Kerberos Realm NameのDNSルックアップを実行してKDCサーバーネットワークアドレスを見つける[1]で考慮されるデバイスのクラスとは異なります。"
    },
    {
      "indent": 3,
      "text": "This document proposes a sub-option of the CCC DHCP option code for use with CableLabs client devices. The proposed sub-option encodes an identifier for the network address of each of one or more Key Distribution Center servers with which the CableLabs client device exchanges security information.",
      "ja": "このドキュメントでは、CableLabsクライアントデバイスで使用するためのCCC DHCPオプションコードのサブオプションを提案しています。提案されたサブオプションは、CableLabsクライアントデバイスがセキュリティ情報を交換する1つ以上のキー配布センターサーバーのそれぞれのネットワークアドレスの識別子をエンコードします。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"SHOULD\", \"SHOULD NOT\" and \"MAY\" in this document are to be interpreted as described in BCP 14, RFC 2119 [4].",
      "ja": "このドキュメントの「必須」、「そうでなければならない」、「そうでなければならない」、「すべきではない」、「そうすべきではない」は、BCP 14、RFC 2119 [4]に記載されているように解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "2. Key Distribution Center IP Address Sub-option",
      "section_title": true,
      "ja": "2. キー配布センターIPアドレスサブオプション"
    },
    {
      "indent": 3,
      "text": "CableHome specifications will specify the Key Distribution Center network address encoding as a sub-option of the CCC DHCP Option code. This field will be used to inform the client device of the network address of one or more Key Distribution Center servers.",
      "ja": "CableHome仕様は、CCC DHCPオプションコードのサブオプションとしてエンコードするキーディストリビューションセンターネットワークアドレスを指定します。このフィールドは、クライアントデバイスに1つ以上のキー配布センターサーバーのネットワークアドレスを通知するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The encoding of the KDC Server Address sub-option will adhere to the format of an IPv4 address. The minimum length for this option is 4 octets, and the length MUST always be a multiple of 4. If multiple KDC Servers are listed, they MUST be listed in decreasing order of priority. The format of the KDC Server Address sub-option of the CCC option code is as shown below:",
      "ja": "KDCサーバーアドレスのサブオプションのエンコードは、IPv4アドレスの形式に準拠します。このオプションの最小長は4オクテットで、長さは常に4の倍数でなければなりません。複数のKDCサーバーがリストされている場合、優先度の低下でリストする必要があります。KDCサーバーアドレスのフォーマットは、CCCオプションコードのサブオプションを示しています。"
    },
    {
      "indent": 3,
      "text": " SubOpt  Len      Address 1               Address 2\n+------+-----+-----+-----+-----+-----+-----+-----+--\n|  10  |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...\n+------+-----+-----+-----+-----+-----+-----+-----+--",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document relies upon the DHCP protocol [5] for authentication and security, i.e., it does not provide security in excess of what DHCP is (or will be) providing. Potential exposures to attack in the DHCP protocol are discussed in section 7 of the DHCP protocol specification [5] and in Authentication for DHCP Messages [6].",
      "ja": "このドキュメントは、認証とセキュリティのためにDHCPプロトコル[5]に依存しています。つまり、DHCPが提供する（または提供する）ものを超えるセキュリティを提供しません。DHCPプロトコルでの攻撃への潜在的な暴露については、DHCPプロトコル仕様[5]のセクション7およびDHCPメッセージの認証[6]で説明します。"
    },
    {
      "indent": 3,
      "text": "The CCC option can be used to misdirect network traffic by providing incorrect DHCP server addresses, incorrect provisioning server addresses, and incorrect Kerberos realm names to a CableLabs client device. This misdirection can lead to several threat scenarios. A Denial of Service (DoS) attack can result from address information being simply invalid. A man-in-the-middle attack can be mounted by providing addresses to a potential snooper. A malicious service provider can steal customers from the customer selected service provider, by altering the Kerberos realm designation.",
      "ja": "CCCオプションは、誤ったDHCPサーバーアドレス、誤ったプロビジョニングサーバーアドレス、および誤ったKerberos Realm NameをCableLabsクライアントデバイスに提供することにより、ネットワークトラフィックを誤って指示するために使用できます。この誤解は、いくつかの脅威シナリオにつながる可能性があります。サービス拒否（DOS）攻撃は、アドレス情報が単純に無効であることから生じる可能性があります。潜在的なスヌーパーに住所を提供することにより、中間の攻撃を取り付けることができます。悪意のあるサービスプロバイダーは、Kerberos Realmの指定を変更することにより、顧客選択サービスプロバイダーから顧客を盗むことができます。"
    },
    {
      "indent": 3,
      "text": "These threats are mitigated by several factors.",
      "ja": "これらの脅威は、いくつかの要因によって軽減されます。"
    },
    {
      "indent": 3,
      "text": "Within the cable delivery architecture required by CableLabs' PacketCable, DOCSIS, and CableHome specifications, the DHCP client is connected to a network through a cable modem and the Cable Modem Termination System (CMTS). The CMTS is explicitly configured with a set of DHCP servers to which DHCP requests are forwarded. Further, a correctly configured CMTS will only allow downstream traffic from specific IP addresses/ ranges.",
      "ja": "CableLabsのPacketCable、DocSIS、およびCablehome仕様が必要とするケーブル配信アーキテクチャ内で、DHCPクライアントはケーブルモデムとケーブルモデム終端システム（CMTS）を介してネットワークに接続されています。CMTSは、DHCP要求が転送されるDHCPサーバーのセットで明示的に構成されています。さらに、正しく構成されたCMTは、特定のIPアドレス/範囲からの下流トラフィックのみを許可します。"
    },
    {
      "indent": 3,
      "text": "Assuming that server addresses were successfully spoofed to the point that a malicious client device was able to contact a KDC, the client device must still present valid certificates to the KDC before being service enabled. Given the computational overhead of the certificate validation process, this situation could present a DoS opportunity.",
      "ja": "サーバーアドレスが悪意のあるクライアントデバイスがKDCに連絡することができるという点まで正常にスプーフィングされたと仮定すると、クライアントデバイスはサービスを有効にする前に、KDCに有効な証明書を提示する必要があります。証明書の検証プロセスの計算オーバーヘッドを考えると、この状況はDOSの機会を提示する可能性があります。"
    },
    {
      "indent": 3,
      "text": "It is possible for a malicious (although certificate enabled) service provider to redirect a customer from the customer's selected service provider. It is assumed that all service providers permitted onto an access providers network are trusted entities that will cooperate to ensure peaceful coexistence. If a service provider is found to be redirecting customers, this should be handled as an administrative matter between the access provider and the service provider.",
      "ja": "悪意のある（証明書を有効にしているものの）サービスプロバイダーが、顧客の選択されたサービスプロバイダーから顧客をリダイレクトすることが可能です。アクセスプロバイダーネットワークに許可されているすべてのサービスプロバイダーは、平和的な共存を確保するために協力する信頼できるエンティティであると想定されています。サービスプロバイダーが顧客をリダイレクトしていることがわかった場合、これはアクセスプロバイダーとサービスプロバイダーの間の管理上の問題として処理する必要があります。"
    },
    {
      "indent": 3,
      "text": "Another safeguard that can be taken by service providers to limit their exposure to their KDC server(s) is to configure their network so that the KDC(s) reside on a separate subnetwork.",
      "ja": "KDCサーバーへの露出を制限するためにサービスプロバイダーが取得できるもう1つの保護手段は、KDCが別のサブネットワークに存在するようにネットワークを構成することです。"
    },
    {
      "indent": 3,
      "text": "Service providers can further protect their KDC server(s) by placing a firewall in front of the KDC(s) only allowing connections needed for its current provisioning processes. The IP temporary addresses given the client devices from the DHCP server could be sent directly to the firewall from the DHCP server to open a hole for Kerberos messages only for those particular IP addresses for a short period of time. If this was used it would be recommended that service providers authenticate their DHCP server to the KDC as well. This could be done via password authentication rather than digital certificate due to the co-location of the DHCP server to the KDC.",
      "ja": "サービスプロバイダーは、現在のプロビジョニングプロセスに必要な接続のみをKDCの前に配置することにより、KDCサーバーをさらに保護できます。DHCPサーバーからクライアントデバイスを考慮したIP一時アドレスは、DHCPサーバーからファイアウォールに直接送信して、特定のIPアドレスに対してのみKerberosメッセージの穴を開けることができます。これが使用された場合は、サービスプロバイダーがDHCPサーバーをKDCに認証することをお勧めします。これは、DHCPサーバーのKDCへのコロケーションにより、デジタル証明書ではなくパスワード認証を介して実行できます。"
    },
    {
      "indent": 3,
      "text": "Finally, Kerberos requires mutual client-server authentication. Therefore, the client device must authenticate itself with its digital certificate and the KDC is required to authenticate it to the client device. If a hacker tries to redirect the client device by replacing the service provider-configured KDC Server Address sub-option with another IP address, it is not likely to be a valid service provider's KDC server and authentication will fail.",
      "ja": "最後に、Kerberosは相互のクライアントサーバー認証を必要とします。したがって、クライアントデバイスはデジタル証明書を使用して認証する必要があり、KDCはクライアントデバイスに認証するために必要です。ハッカーが、サービスプロバイダーに構成されたKDCサーバーアドレスサブオプションを別のIPアドレスに置き換えてクライアントデバイスをリダイレクトしようとする場合、有効なサービスプロバイダーのKDCサーバーであり、認証が失敗する可能性があります。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The KDC Server Address sub-option described in this document is intended to be a sub-option of the CableLabs Client Configuration (CCC) option described in [1]. IANA has assigned and registered sub-option code 10 of the CCC option to the KDC Server Address sub-option.",
      "ja": "このドキュメントで説明されているKDCサーバーアドレスサブオプションは、[1]で説明されているCableLabsクライアント構成（CCC）オプションのサブオプションであることを目的としています。IANAは、CCCオプションのサブオプションコード10をKDCサーバーアドレスサブオプションに割り当てて登録しました。"
    },
    {
      "indent": 0,
      "text": "5. Intellectual Property Statement",
      "section_title": true,
      "ja": "5. 知的財産声明"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、知的財産またはその他の権利の有効性または範囲に関して、この文書に記載されているテクノロジーの実装または使用に関連すると主張される可能性のある他の権利、またはそのような権利に基づくライセンスがどの程度であるかについての程度に関連する可能性があるという立場はありません。利用可能;また、そのような権利を特定するために努力したことも表明していません。標準トラックおよび標準関連のドキュメントの権利に関するIETFの手順に関する情報は、BCP-11に記載されています。出版のために利用可能にされた権利の請求のコピーと、利用可能になるライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を得ることができますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、関心のある当事者に、この基準を実践するために必要な技術をカバーする可能性のある著作権、特許、または特許出願、またはその他の独自の権利を注意深く招待するよう招待しています。情報をIETFエグゼクティブディレクターに宛ててください。"
    },
    {
      "indent": 0,
      "text": "6. Normative References",
      "section_title": true,
      "ja": "6. 引用文献"
    },
    {
      "indent": 3,
      "text": "[1] Beser, B. and P. Duffy, \"DHCP Option for CableLabs Client Configuration\", RFC 3495, March 2003.",
      "ja": "[1] Beser、B。およびP. Duffy、「CableLabsクライアント構成のDHCPオプション」、RFC 3495、2003年3月。"
    },
    {
      "indent": 3,
      "text": "[2] \"CableHome 1.1 Specification\", CableLabs, http://www.cablelabs.com/projects/cablehome/specifications/.",
      "ja": "[2] 「ケーブルホーム1.1仕様」、cablelabs、http：//www.cablelabs.com/projects/cablehome/spifications/。"
    },
    {
      "indent": 3,
      "text": "[3] \"CableHome 1.0 Specification\", CableLabs, http://www.cablelabs.com/projects/cablehome/specifications/.",
      "ja": "[3] 「ケーブルホーム1.0仕様」、cablelabs、http：//www.cablelabs.com/projects/cablehome/spifications/。"
    },
    {
      "indent": 3,
      "text": "[4] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[4] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[5] Droms, R., \"Dynamic Host Configuration Protocol\", RFC 2131, March 1997.",
      "ja": "[5] DROMS、R。、「動的ホスト構成プロトコル」、RFC 2131、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[6] Droms, R. and W. Arbaugh, \"Authentication for DHCP Messages\", RFC 3118, June 2001",
      "ja": "[6] Droms、R。and W. Arbaugh、「DHCPメッセージの認証」、RFC 3118、2001年6月"
    },
    {
      "indent": 0,
      "text": "7. Authors' Addresses",
      "section_title": true,
      "ja": "7. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Kevin Luehrs CableLabs 858 Coal Creek Circle Louisville, CO 80027",
      "ja": "Kevin Luehrs CableLabs 858 Coal Creek Circle Louisville、Co 80027"
    },
    {
      "indent": 3,
      "text": "Phone: (303) 661-9100 EMail: k.luehrs@cablelabs.com",
      "ja": "電話：（303）661-9100メール：k.luehrs@cablelabs.com"
    },
    {
      "indent": 3,
      "text": "Richard Woundy Comcast Cable 27 Industrial Drive Chelmsford, MA 01824",
      "ja": "リチャード・ウッキング・コムキャストケーブル27インダストリアルドライブチェルムスフォード、マサチューセッツ州01824"
    },
    {
      "indent": 3,
      "text": "Phone: (978) 244-4010 EMail: richard_woundy@cable.comcast.com",
      "ja": "電話：（978）244-4010メール：richard_woundy@cable.comcast.com"
    },
    {
      "indent": 3,
      "text": "John Bevilacqua YAS Corporation 300 Brickstone Square Andover, MA 01810",
      "ja": "John Bevilacqua Yas Corporation 300 Brickstone Square Andover、MA 01810"
    },
    {
      "indent": 3,
      "text": "Phone: (978) 749-9999 EMail: john@yas.com",
      "ja": "電話：（978）749-9999メール：john@yas.com"
    },
    {
      "indent": 3,
      "text": "Nancy Davoust YAS Corporation 300 Brickstone Square Andover, MA 01810",
      "ja": "ナンシーダボストヤスコーポレーション300ブリックストーンスクエアアンドーバー、マサチューセッツ州01810"
    },
    {
      "indent": 3,
      "text": "Phone: (978) 749-9999 EMail: nancy@yas.com",
      "ja": "電話：（978）749-9999メール：nancy@yas.com"
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会やその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}