{
  "title": {
    "text": "RFC 3702 - Authentication, Authorization, and Accounting Requirements for the Session Initiation Protocol (SIP)",
    "ja": "RFC 3702 - 認証、認可、およびセッション開始プロトコル（SIP）のための会計要件"
  },
  "number": 3702,
  "created_at": "2019-10-21 04:50:38.601322+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        J. Loughney\nRequest for Comments: 3702                                         Nokia\nCategory: Informational                                     G. Camarillo\n                                                                Ericsson\n                                                           February 2004",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "    Authentication, Authorization, and Accounting\nRequirements for the Session Initiation Protocol (SIP)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2004）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "As Session Initiation Protocol (SIP) services are deployed on the Internet, there is a need for authentication, authorization, and accounting of SIP sessions. This document sets out the basic requirements for this work.",
      "ja": "セッション開始プロトコル（SIP）サービスは、インターネット上で展開される、認証、許可、およびSIPセッションの会計処理の必要性があります。この文書では、この作品のための基本的な要件を定めています。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n    1.1.  RADIUS . . . . . . . . . . . . . . . . . . . . . . . . .  3\n    1.2.  Terminology and Acronyms . . . . . . . . . . . . . . . .  4\n    1.3.  Requirements Language. . . . . . . . . . . . . . . . . .  4\n2.  Requirements . . . . . . . . . . . . . . . . . . . . . . . . .  4\n    2.1.  Common Requirements. . . . . . . . . . . . . . . . . . .  5\n          2.1.1.  Communication within the Same Domain . . . . . .  5\n          2.1.2.  Communication between Different Domains. . . . .  5\n          2.1.3.  Discovery. . . . . . . . . . . . . . . . . . . .  5\n          2.1.4.  Ability to Integrate Different Networks,\n                  Services and Users . . . . . . . . . . . . . . .  5\n          2.1.5.  Updating SIP Server Entries. . . . . . . . . . .  5\n          2.1.6.  SIP Session Changes. . . . . . . . . . . . . . .  5\n          2.1.7.  Reliable Transfer of Protocol Messages . . . . .  5\n          2.1.8.  Call Setup Times . . . . . . . . . . . . . . . .  6\n          2.1.9.  Security . . . . . . . . . . . . . . . . . . . .  6\n    2.2.  Authentication Requirements. . . . . . . . . . . . . . .  6\n          2.2.1.  Authentication Based on SIP Requests . . . . . .  6\n          2.2.2.  Flexible Authentication of SIP Requests. . . . .  6",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "    2.3.  Authorization Requirements . . . . . . . . . . . . . . .  6\n          2.3.1.  Ability to Authorize SIP Requests. . . . . . . .  7\n          2.3.2.  Information Transfer . . . . . . . . . . . . . .  7\n          2.3.3.  User De-authorization. . . . . . . . . . . . . .  7\n          2.3.4.  User Re-authorization. . . . . . . . . . . . . .  7\n          2.3.5.  Support for Credit Control . . . . . . . . . . .  7\n    2.4.  Accounting Requirements. . . . . . . . . . . . . . . . .  8\n          2.4.1.  Separation of Accounting Information . . . . . .  8\n          2.4.2.  Accounting Information Related to Session\n                  Progression. . . . . . . . . . . . . . . . . . .  8\n          2.4.3.  Accounting Information Not Related to Session\n                  Progression. . . . . . . . . . . . . . . . . . .  9\n          2.4.4.  Support for One-Time and Session-based\n                  Accounting Records . . . . . . . . . . . . . . .  9\n          2.4.5.  Support for Accounting on Different Media\n                  Components . . . . . . . . . . . . . . . . . . .  9\n          2.4.6.  Configuration of Accounting Generation\n                   Parameters. . . . . . . . . . . . . . . . . . .  9\n          2.4.7.  Support for Arbitrary Correlations . . . . . . .  9\n3.  Scenarios. . . . . . . . . . . . . . . . . . . . . . . . . . . 10\n    3.1.  WLAN Roaming Using Third Party Service Providers . . . . 11\n    3.2.  Conditional Authorization. . . . . . . . . . . . . . . . 12\n4.  Security Considerations. . . . . . . . . . . . . . . . . . . . 12\n5.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 12\n6.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n    6.1.  Normative References . . . . . . . . . . . . . . . . . . 13\n    6.2.  Informative References . . . . . . . . . . . . . . . . . 13\n7.  Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . 14\n8.  Full Copyright Statement . . . . . . . . . . . . . . . . . . . 15",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The AAA working group is chartered to work on authentication, authorization, and accounting solutions for the Internet. This work consists of a base protocol, applications, end-to-end security application, and a general architecture for providing these services [3]. The AAA working group has specified applicability of AAA-based solutions for a number of protocols (e.g., AAA requirements for Mobile IP [4]).",
      "ja": "AAAワーキンググループは、インターネットのための認証、許可、アカウンティング・ソリューション上で動作するようにチャーターされます。この作業は、ベースプロトコル、アプリケーション、エンドツーエンドのセキュリティアプリケーション、および[3]は、これらのサービスを提供するための一般的なアーキテクチャから成ります。 AAAワーキンググループは、プロトコルの数のAAAベースのソリューションの適用を指定している（例えば、モバイルIPのためのAAA要件[4]）。"
    },
    {
      "indent": 3,
      "text": "SIP is a signalling protocol for creating, modifying, and terminating different types of sessions, such as Internet phone calls, multimedia distribution, and multimedia conferences [1]. SIP sessions have needs for session authentication, authorization, and accounting (AAA).",
      "ja": "SIPは、インターネット電話通話、マルチメディア配信、およびマルチメディア会議などのセッションの種類を、作成、変更、および終了するためのシグナリングプロトコルである[1]。 SIPセッションは、セッション認証、許可、アカウンティング（AAA）のためのニーズを持っています。"
    },
    {
      "indent": 3,
      "text": "In order to authenticate and authorize users, it is typically more convenient for SIP entities to communicate with an AAA sever than to attempt to store user credentials and profiles locally. SIP entities use the SIP-AAA interface to access the AAA server.",
      "ja": "ローカルユーザーの資格情報とプロファイルを保存しようとするよりも、ユーザーを認証し、認証するためには、通常のAAAサーバと通信するためのSIPエンティティのためのより便利です。 SIPエンティティは、AAAサーバにアクセスするためのSIP-AAAインタフェースを使用しています。"
    },
    {
      "indent": 3,
      "text": "This document provides requirements for the interface between SIP entities and AAA servers. While accounting requirements are discussed, this document does not cover SIP charging or billing mechanisms.",
      "ja": "この文書では、SIPエンティティとAAAサーバ間のインタフェースのための要件を提供します。会計上の要件が説明されていますが、この文書は、SIPの充電や課金の仕組みをカバーしていません。"
    },
    {
      "indent": 3,
      "text": "One possible use of this document would be to create an AAA application for SIP. Any protocol meeting the requirements outlined by this document could be used. Possible candidates, among others, are Diameter [3] and XML-based protocols following the web-services model.",
      "ja": "このドキュメントの一つの可能​​な使用は、SIPのためのAAAアプリケーションを作成することです。このドキュメントで概説要件を満たす任意のプロトコルを使用することができます。可能性のある候補者は、とりわけ、直径[3]およびWebサービスモデル以下のXMLベースのプロトコルです。"
    },
    {
      "indent": 0,
      "text": "1.1. RADIUS",
      "section_title": true,
      "ja": "1.1。半径"
    },
    {
      "indent": 3,
      "text": "The main purpose of this document is to provide input to designers working on AAA applications using new protocols, such as Diameter and XML-based protocols. Nevertheless, a few limited RADIUS [5] extensions may meet some of the requirements in this document (for instance, some of the authentication requirements). We expect that while RADIUS with these limited extensions will meet particular functional requirements, it will not meet other important requirements. The following are some requirements that are not expected to be met by RADIUS:",
      "ja": "この文書の主な目的は、このような直径とXMLベースのプロトコルなどの新しいプロトコルを使用して、AAAのアプリケーションに取り組んでデザイナーへの入力を提供することです。それにもかかわらず、いくつかの限られたRADIUSは、[5]の拡張機能は、（例えば、認証要件の一部）この文書の要件の一部を満たしていることがあります。我々は、これらの限定された拡張子を持つRADIUSは、特定の機能要件を満たしていますが、それは他の重要な要件を満たしていないことを期待しています。以下は、RADIUSによって満たされることが期待されていないいくつかの要件は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "1. Section 2.1.3: RADIUS does not support a discovery feature.",
      "ja": "1.セクション2.1.3：RADIUSが発見機能をサポートしていません。"
    },
    {
      "indent": 6,
      "text": "2. Section 2.1.7: RADIUS does not support reliable message delivery.",
      "ja": "2.セクション2.1.7：RADIUSは信頼性の高いメッセージ配信をサポートしていません。"
    },
    {
      "indent": 3,
      "text": "The following list contains the requirements that can be met by RADIUS or RADIUS extensions.",
      "ja": "以下のリストは、RADIUSまたはRADIUSの拡張機能によって満たすことができる要件が含まれています。"
    },
    {
      "indent": 6,
      "text": "1. Section 2.1.2: Communication between domains does not scale well in RADIUS. As a result, inter-domain communications are typically handled using a proxy architecture [6].",
      "ja": "1.セクション2.1.2：ドメイン間の通信は、RADIUSでうまくスケールしません。結果として、ドメイン間の通信は、典型的には、プロキシアーキテクチャを使用して処理されている[6]。"
    },
    {
      "indent": 6,
      "text": "2. Section 2.1.5: RADIUS clients would need to support Dynamic Authorization [7].",
      "ja": "2.セクション2.1.5：RADIUSクライアントはダイナミックな承認をサポートする必要がある[7]。"
    },
    {
      "indent": 6,
      "text": "3. Section 2.1.9: RADIUS clients would need to rely on a lower-layer security protocol, such as IPSec, to perform mutual authentication.",
      "ja": "3.セクション2.1.9：RADIUSクライアントが相互認証を実行するために、IPSecなど、下位層のセキュリティプロトコルに依存する必要があります。"
    },
    {
      "indent": 6,
      "text": "4. Section 2.3.3: RADIUS clients would need to support Dynamic Authorization [7].",
      "ja": "4.セクション2.3.3：RADIUSクライアントはダイナミックな承認をサポートする必要がある[7]。"
    },
    {
      "indent": 6,
      "text": "5. Section 2.3.4: RADIUS clients would need to support Dynamic Authorization [7].",
      "ja": "5.セクション2.3.4：RADIUSクライアントはダイナミックな承認をサポートする必要がある[7]。"
    },
    {
      "indent": 0,
      "text": "1.2. Terminology and Acronyms",
      "section_title": true,
      "ja": "1.2。用語と略語"
    },
    {
      "indent": 3,
      "text": "AAA: Authentication, Authorization, and Accounting",
      "ja": "AAA：認証、認可、アカウンティング"
    },
    {
      "indent": 3,
      "text": "Accounting: The collection of resource consumption data for the purposes of capacity and trend analysis, cost allocation, auditing, and billing. Accounting management requires that resource consumption be measured, rated, assigned, and communicated between appropriate parties [8].",
      "ja": "会計：容量と傾向分析、コスト配分、監査、および請求の目的のためのリソース消費データの収集。課金管理は、リソースの消費量が[8]、測定評価、割り当てられ、そして適切な当事者間で通信されることを必要とします。"
    },
    {
      "indent": 3,
      "text": "Accounting with credit control: The application checks the end user's account for coverage for the requested service event charge prior to execution of that service event.",
      "ja": "与信管理と会計：アプリケーションは、その前のサービスイベントの実行に要求されたサービスイベント料金でカバレッジのためのエンドユーザーのアカウントをチェックします。"
    },
    {
      "indent": 3,
      "text": "Home AAA Server: Server where user with which the user maintains an account relationship.",
      "ja": "ホームAAAサーバ：ユーザーユーザーは、アカウントの関係を保持しているサーバー。"
    },
    {
      "indent": 3,
      "text": "SIP: Session Initiation Protocol",
      "ja": "SIP：セッション開始プロトコル"
    },
    {
      "indent": 3,
      "text": "SIP proxies: SIP proxies are nodes which forward SIP requests and responses, as well as make policy decisions.",
      "ja": "SIPプロキシ：SIPプロキシは、SIPリクエストとレスポンス前方ノードであり、同様に政策決定を行います。"
    },
    {
      "indent": 3,
      "text": "UAC: User Agent Client",
      "ja": "UAC：ユーザー・エージェント・クライアント"
    },
    {
      "indent": 3,
      "text": "UAS: User Agent Server",
      "ja": "WHO：ユーザエージェントサーバ"
    },
    {
      "indent": 0,
      "text": "1.3. Requirements Language",
      "section_title": true,
      "ja": "1.3。要件言語"
    },
    {
      "indent": 3,
      "text": "In this document, the key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" are to be interpreted as described in BCP 14, RFC 2119 [2].",
      "ja": "この文書では、キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"NOT SHALL\"、 \"推奨\"、 \"すべきではない\" \"べきである\" \"ないものと\"、 \"MAY\"、および \"オプション\" BCP 14、RFC 2119に記載されているように[2]に解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "2. Requirements",
      "section_title": true,
      "ja": "2.要件"
    },
    {
      "indent": 3,
      "text": "In this section, we list the requirements. Protocol solutions are not required to satisfy requirements for services that they do not support. For example, a solution that provides authentication services but not accounting services does not need to fulfill the accounting requirements. It is expected that solutions will fulfill the general requirements, plus the requirements for the specific services they are providing.",
      "ja": "このセクションでは、要件をリストアップ。プロトコル・ソリューションは、それらがサポートしていないサービスのための要件を満たすために必要とされていません。例えば、認証サービスではなく、会計サービスを提供するソリューションは、会計上の要件を満たす必要がありません。ソリューションは、彼らが提供している特定のサービスのための一般的な要件に加え、要件を満たすことが期待されます。"
    },
    {
      "indent": 3,
      "text": "Section 2.1 lists general requirements, Section 2.2 lists requirements related to authentication, Section 2.3 lists requirements related to authorization, and Section 2.4 lists requirements related to accounting.",
      "ja": "2.1リストの一般的な要件、認証に関連する2.2リストの要件は、2.3節のリストの要件は、認可に関連して、2.4節のリストの要件は、会計に関連します。"
    },
    {
      "indent": 0,
      "text": "2.1. Common Requirements",
      "section_title": true,
      "ja": "2.1。共通要件"
    },
    {
      "indent": 3,
      "text": "This section outlines general requirements on the SIP-AAA interface.",
      "ja": "このセクションでは、SIP-AAAインターフェイスの一般的な要件を概説します。"
    },
    {
      "indent": 0,
      "text": "2.1.1. Communication within the Same Domain",
      "section_title": true,
      "ja": "2.1.1。同じドメイン内のコミュニケーション"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST support communications between a SIP entity and an AAA server that belong to the same domain.",
      "ja": "SIP-AAAインタフェースは、同じドメインに属するSIPエンティティとAAAサーバ間の通信をサポートしなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.1.2. Communication between Different Domains",
      "section_title": true,
      "ja": "2.1.2。異なるドメイン間の通信"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST support communications between a SIP entity in one domain and an AAA server in another domain. This MAY involve a proxy or a redirect server architecture between both entities.",
      "ja": "SIP-AAAインタフェースは、一つのドメインと別のドメイン内のAAAサーバ内のSIPエンティティ間の通信をサポートしなければなりません。これは、両方のエンティティ間のプロキシまたはリダイレクトサーバーアーキテクチャを含むことができます。"
    },
    {
      "indent": 0,
      "text": "2.1.3. Discovery",
      "section_title": true,
      "ja": "2.1.3。発見"
    },
    {
      "indent": 3,
      "text": "With the information contained in the SIP messages, the SIP-AAA interface SHOULD be able to deduce the particular AAA server that has to be queried.",
      "ja": "SIPメッセージに含まれる情報を用いて、SIP-AAAインタフェースを照会しなければならない特定のAAAサーバを推定することができるべきです。"
    },
    {
      "indent": 0,
      "text": "2.1.4. Ability to Integrate Different Networks, Services and Users",
      "section_title": true,
      "ja": "2.1.4。異なるネットワークス、サービスとユーザーを統合する能力"
    },
    {
      "indent": 3,
      "text": "The basic AAA architecture MUST be access independent. Service providers have to be able to provide AAA services for SIP, irrespective of access method or technology.",
      "ja": "基本的なAAAアーキテクチャは、アクセス独立していなければなりません。サービスプロバイダは関係なく、アクセス方法や技術の、SIPのためのAAAサービスを提供できるようにする必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1.5. Updating SIP Server Entries",
      "section_title": true,
      "ja": "2.1.5。 SIPサーバのエントリを更新します"
    },
    {
      "indent": 3,
      "text": "When required, the SIP-AAA interface MUST allow the AAA server to update the information that a SIP entity has about a user.",
      "ja": "必要な場合に、SIP-AAAインタフェースは、AAAサーバは、SIPエンティティがユーザに関するたという情報を更新することを可能にしなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.1.6. SIP Session Changes",
      "section_title": true,
      "ja": "2.1.6。 SIPセッションの変更"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST allow a SIP entity to inform the AAA server about changes in the SIP session that may affect the authorization, authentication, or accounting for that SIP session.",
      "ja": "SIP-AAAインタフェースは、SIPエンティティは、認可、認証、またはそのSIPセッションの会計処理に影響を与える可能性があるSIPセッションの変更に関するAAAサーバに通知することを可能にしなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.1.7. Reliable Transfer of Protocol Messages",
      "section_title": true,
      "ja": "2.1.7。プロトコルメッセージの信頼性の高い転送"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface SHOULD provide a reliable transfer of AAA protocol messages between the SIP entity and the AAA server.",
      "ja": "SIP-AAAインタフェースは、SIPエンティティとAAAサーバの間でAAAプロトコルメッセージの信頼性のある転送を提供するべきです。"
    },
    {
      "indent": 0,
      "text": "2.1.8. Call Setup Times",
      "section_title": true,
      "ja": "2.1.8。コールセットアップ時間"
    },
    {
      "indent": 3,
      "text": "AAA SHOULD NOT unduly burden call setup times where appropriate. It may be reasonable to support some delay during registration, but delay during on-going sessions (especially real-time) is problematic.",
      "ja": "AAAは、適切な場合には、不当に負担の呼設定時間べきではありません。登録時に多少の遅延をサポートするのが妥当かもしれませんが、現在進行セッション（特にリアルタイム）の間の遅延が問題となります。"
    },
    {
      "indent": 0,
      "text": "2.1.9. Security",
      "section_title": true,
      "ja": "2.1.9。セキュリティ"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface is a potential target of an attack. An eavesdropper may attempt to obtain confidential data by sniffing messages. Additionally, an active attacker may attempt to modify, insert, or replay messages between the SIP entity and the AAA server. Attackers may also attempt to impersonate legitimate SIP entities or AAA servers.",
      "ja": "SIP-AAAインタフェースは、攻撃の潜在的な標的です。盗聴者は、メッセージを盗聴することにより、機密データを取得しようとすることができます。また、活発な攻撃者は、変更しようとする挿入、またはSIPエンティティとAAAサーバの間でメッセージを再生することができます。攻撃者はまた、合法的なSIPエンティティまたはAAAサーバを偽装しようとすることができます。"
    },
    {
      "indent": 3,
      "text": "To address these threats, the SIP-AAA interface MUST support confidentiality, data origin authentication, integrity, and replay protection. In addition to this, bi-directional authentication between the SIP entity and the AAA server MUST be supported as well.",
      "ja": "これらの脅威に対処するために、SIP-AAAインタフェースは、機密性、データ発信元認証、完全性、および再生保護をサポートしなければなりません。これに加えて、SIPエンティティとAAAサーバとの間の双方向の認証もサポートしなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.2. Authentication Requirements",
      "section_title": true,
      "ja": "2.2。認証要件"
    },
    {
      "indent": 3,
      "text": "This section outlines requirements on the SIP-AAA interface related to authentication.",
      "ja": "このセクションでは、認証に関連するSIP-AAAインターフェイス上の要件の概要を説明します。"
    },
    {
      "indent": 0,
      "text": "2.2.1. Authentication Based on SIP Requests",
      "section_title": true,
      "ja": "2.2.1。 SIPの要求に基づいて認証"
    },
    {
      "indent": 3,
      "text": "The home AAA server MUST be able to authenticate a user based on any SIP request, except CANCELs and ACKs for non-2xx final responses.",
      "ja": "ホームAAAサーバは、非2xxの最終応答のためキャンセルし、ACKを除いて、任意のSIP要求に基づいてユーザを認証することができなければなりません。"
    },
    {
      "indent": 6,
      "text": "CANCELs and ACKs for non-2xx final responses are hop-by-hop requests that can be generated by proxies that do not have the user's credentials.",
      "ja": "非2xxの最終応答のためキャンセルし、ACKは、ユーザーの資格情報を持っていないプロキシによって生成することができるホップバイホップ要求です。"
    },
    {
      "indent": 0,
      "text": "2.2.2. Flexible Authentication of SIP Requests",
      "section_title": true,
      "ja": "2.2.2。 SIP要求の柔軟な認証"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST be flexible enough to accommodate a variety of authentication mechanisms used to authenticate SIP requests. In particular, the SIP-AAA interface MUST be able to accommodate all the authentication mechanisms mandated by the SIP specifications (e.g., Digest authentication).",
      "ja": "SIP-AAAインタフェースは、SIP要求を認証するために使用される認証メカニズムの多様を収容するのに十分に柔軟でなければなりません。具体的には、SIP-AAAインタフェースはSIP仕様（例えば、ダイジェスト認証）によって義務付けすべての認証メカニズムを収容することができなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.3. Authorization Requirements",
      "section_title": true,
      "ja": "2.3。許可の要件"
    },
    {
      "indent": 3,
      "text": "This section outlines requirements on the SIP-AAA interface related to authorization.",
      "ja": "このセクションでは、認可に関連したSIP-AAAインターフェイス上の要件の概要を説明します。"
    },
    {
      "indent": 0,
      "text": "2.3.1. Ability to Authorize SIP Requests",
      "section_title": true,
      "ja": "2.3.1。 SIPリクエストを承認する能力"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST allow AAA servers to authorize any SIP request, except CANCELs and ACKs for non-2xx final responses.",
      "ja": "SIP-AAAインタフェースは、AAAサーバが非2xxの最終応答のためキャンセルし、ACKを除いて、任意のSIPリクエストを承認することを可能にしなければなりません。"
    },
    {
      "indent": 6,
      "text": "CANCELs and ACKs for non-2xx final responses are hop-by-hop requests that can be generated by proxies. SIP servers receiving a CANCEL or a ACK for a non-2xx final response do not challenge them, as they would do with an end-to-end request. Instead, they check at the transport or network layer that the entity sending the CANCEL or the ACK is the same as the one that generated the request being canceled or acked.",
      "ja": "非2xxの最終応答のためキャンセルし、ACKは、プロキシによって生成することができるホップバイホップ要求です。彼らは、エンドツーエンドのリクエストで行うように非2xxの最終的な応答のためのCANCELまたはACKを受信SIPサーバは、それらに挑戦しません。その代わりに、彼らは、企業がCANCEL送信トランスポートまたはネットワーク層で確認するか、ACKは、キャンセル又はACKされている要求を生成したものと同じです。"
    },
    {
      "indent": 0,
      "text": "2.3.2. Information Transfer",
      "section_title": true,
      "ja": "2.3.2。情報伝達"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST allow transferring a wide range or set of information to be used to make an authorization decision. In particular, the SIP-AAA interface MUST allow an AAA server that is making an authorization decision to deliver the user profile to the SIP entity. Such a user profile may provide further information about the authorization decision to the SIP entity.",
      "ja": "SIP-AAAインタフェースが許可決定を行うために使用される広い範囲又は情報の組を転送できるようにしなければなりません。具体的には、SIP-AAAインタフェースは、SIPエンティティにユーザプロファイルを提供する許可決定を行っているAAAサーバを許可する必要があります。このようなユーザプロファイルは、SIPエンティティに認可判断についてのさらなる情報を提供することができます。"
    },
    {
      "indent": 3,
      "text": "For instance, a SIP proxy receives an INVITE from user A addressed to user B. The SIP proxy queries an AAA server and gets the following answer: user A is authorized to call user B, as long as the requests are routed through a particular SIP proxy server C. In this case, the SIP proxy needs to use SIP loose routing techniques to forward the INVITE so that it traverses SIP proxy C before reaching user B.",
      "ja": "ユーザAが特定のSIPを介し限り要求がルーティングされるように、ユーザBを呼び出すことを許可されている：例えば、SIPプロキシは、AAAサーバを照会し、次の回答を取得し、AがユーザBにザSIPプロキシ宛ユーザからINVITEを受信しますこの場合、プロキシサーバC.、SIPプロキシは、それがユーザBに到達する前にSIPプロキシCを横切るようにINVITEを転送するSIPルーズルーティング技術を使用する必要があります"
    },
    {
      "indent": 0,
      "text": "2.3.3. User De-authorization",
      "section_title": true,
      "ja": "2.3.3。ユーザーデ承認"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST allow the AAA server to inform a SIP entity when a particular user is no longer authorized to perform a particular task, even if it is an ongoing task.",
      "ja": "SIP-AAAインタフェースは、特定のユーザがもはやそれは進行中の作業であっても、特定のタスクを実行することを許可されている場合、AAAサーバは、SIPエンティティに通知しないようにする必要があります。"
    },
    {
      "indent": 0,
      "text": "2.3.4. User Re-authorization",
      "section_title": true,
      "ja": "2.3.4。ユーザーの再認証"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST allow the AAA server to inform a SIP entity that a particular authorization has been refreshed, and therefore, the user is still authorized to perform a particular task.",
      "ja": "SIP-AAAインタフェースは、AAAサーバは、特定の権限が更新されているので、ユーザは依然として、特定のタスクを実行することを許可されているSIPエンティティに通知することを可能にしなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.3.5. Support for Credit Control",
      "section_title": true,
      "ja": "2.3.5。与信管理のサポート"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST support credit control. That is, the AAA server has to be able to check the end user's account for coverage for the requested service event charge before authorizing execution of that service event. Note that this requirement is related to accounting as well.",
      "ja": "SIP-AAAインタフェースは、与信管理をサポートしなければなりません。これは、AAAサーバは、そのサービスのイベントの実行を許可する前に要求されたサービスイベント担当のカバレッジのためのエンドユーザーのアカウントをチェックできるようにしている、です。この要件が同様に会計処理に関連していることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Credit control is useful to implement prepaid services where all chargeable events related to a specific account are withheld from the end user when the credit of that account is exhausted or expired.",
      "ja": "与信管理は、そのアカウントのクレジットが使い果たさまたは有効期限が切れているときに、特定のアカウントに関連するすべての有料イベントは、エンドユーザーから源泉徴収されているプリペイドサービスを実装するのに有用です。"
    },
    {
      "indent": 0,
      "text": "2.4. Accounting Requirements",
      "section_title": true,
      "ja": "2.4。会計の要件"
    },
    {
      "indent": 3,
      "text": "This section outlines requirements on the SIP-AAA interface related to accounting. Accounting is more than simple charging. Accounting may be a simple list of services accessed, servers accessed, duration of session, etc. Charging for SIP sessions can be extremely complex and requires some additional study. It is not the intent of this section to focus on charging.",
      "ja": "このセクションでは、会計処理に関連したSIP-AAAインターフェイス上の要件の概要を説明します。会計は、単純な充電以上のものです。会計は非常に複雑になることがSIPセッション用充電アクセスサービス、アクセスサーバ、セッションの継続時間などの簡単なリストであることと、いくつかの追加調査が必要となることがあります。充電に焦点を当てることはこの節の意図するところではありません。"
    },
    {
      "indent": 6,
      "text": "The information available to be accounted is different at SIP proxies and at SIP UAs. When end-to-end encryption is used, proxies do not have access to some parts of the SIP messages, while UAs have access to the whole messages. In addition to this, UAs typically have information about the session itself (e.g., number of audio packets exchanged during an audio session). Therefore, even if the SIP-AAA interface provides a means to transfer a wide range of data, some SIP nodes may not have access to it. In order to design a network, it is important to analyze which SIP nodes will be able to generate the desired account records.",
      "ja": "考慮されるために利用可能な情報は、SIPプロキシで異なり、SIPのUAです。エンドツーエンドの暗号化を使用する場合はUAが全体のメッセージへのアクセス権を持っている一方で、プロキシは、SIPメッセージのいくつかの部分にアクセスすることはできません。これに加えて、UAは、典型的には、セッション自体に関する情報（例えば、オーディオパケットの数は、オーディオセッションの間に交換）しています。したがって、SIP-AAAインタフェースがデータの広い範囲を転送する手段を提供する場合であっても、いくつかのSIPノードはそれへのアクセス権を有していなくてもよいです。ネットワークを設計するためには、ノードは、所望のアカウントレコードを生成することができるであろうどのSIP分析することが重要です。"
    },
    {
      "indent": 0,
      "text": "2.4.1. Separation of Accounting Information",
      "section_title": true,
      "ja": "2.4.1。会計情報の分離"
    },
    {
      "indent": 3,
      "text": "AAA accounting messages MUST be able to provide granular information based on different parameters.",
      "ja": "AAAアカウンティングメッセージは異なるパラメータに基づいて、粒状の情報を提供できなければなりません。"
    },
    {
      "indent": 3,
      "text": "For example, it should be possible to separate \"session duration\" information from other information generated via additional services (e.g., 3-way calling). Separating accounting information makes it possible to provide accounting information to different parties based upon different aspects of the session.",
      "ja": "例えば、追加のサービス（例えば、3方向通話）を介して生成された他の情報から「セッション継続時間」の情報を分離することが可能であるべきです。会計情報を分離するセッションのさまざまな側面に基づいて別の関係者に会計情報を提供することが可能となります。"
    },
    {
      "indent": 0,
      "text": "2.4.2. Accounting Information Related to Session Progression",
      "section_title": true,
      "ja": "2.4.2。セッションの進行に関連する会計情報"
    },
    {
      "indent": 3,
      "text": "There MUST be support in the SIP-AAA interface for accounting transfers where the information contained in the accounting data has a direct bearing on the establishment, progression, and termination of a session (e.g., reception of a BYE request).",
      "ja": "会計データに含まれる情報は、セッションの確立、進行、及び終了に直接ベアリングを有する会計転送のSIP-AAAインタフェースのサポートがなければなりません（例えば、BYE要求の受信）。"
    },
    {
      "indent": 0,
      "text": "2.4.3. Accounting Information Not Related to Session Progression",
      "section_title": true,
      "ja": "2.4.3。会計情報は、セッションの進行に関連していません"
    },
    {
      "indent": 3,
      "text": "There MUST be support in the SIP-AAA interface for accounting transfers where the information contained in the accounting data does NOT have a direct bearing on the establishment, progression, and termination of a session (e.g., an instant MESSAGE that is not related to any session).",
      "ja": "会計データに含まれる情報は、直接の設立に関するベアリング、進行、およびセッションの終了（例えば、任意に関連していないインスタントメッセージを持っていない会計上の転送のためのSIP-AAAインターフェイスでサポートが存在でなければなりませんセッション）。"
    },
    {
      "indent": 0,
      "text": "2.4.4. Support for One-Time and Session-based Accounting Records",
      "section_title": true,
      "ja": "2.4.4。ワンタイムとセッションベースの会計記録のサポート"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST allow SIP servers to provide relevant accounting information for billing and inter-network settlement purposes to the AAA servers. Both one-time event accounting records and session based (START, INTERIM, STOP records) accounting MUST be supported.",
      "ja": "SIP-AAAインタフェースは、SIPサーバは、AAAサーバへの課金およびネットワーク間決済目的のために関連する会計情報を提供するために、許容しなければなりません。ベースのワンタイムイベントの会計記録とセッションの両方（START、INTERIM、記録をSTOP）会計をサポートしなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.4.5. Support for Accounting on Different Media Components",
      "section_title": true,
      "ja": "2.4.5。異なるメディアコンポーネントの会計のサポート"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST support accounting per media component (e.g., voice and video). That is, the SIP-AAA interface MUST be able to provide the AAA server with the types (e.g., voice and video) of the media streams of a given session.",
      "ja": "SIP-AAAインタフェースは、メディアコンポーネント（例えば、音声およびビデオ）あたりのアカウンティングをサポートしなければなりません。すなわち、SIP-AAAインタフェースが与えられたセッションのメディアストリームのタイプ（例えば、音声およびビデオ）とAAAサーバを提供することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "Note, however, that some SIP entities do not have access to this information, which is typically carried in session descriptions. An example of a SIP entity with access to this information is a SIP UA (e.g., a gateway towards the PSTN).",
      "ja": "いくつかのSIPエンティティは、通常、セッション記述に運ばれ、この情報へのアクセスを持っていないこと、しかし、注意してください。この情報へのアクセス権を持つSIPエンティティの例は、SIP UA（例えば、PSTNゲートウェイに向かって）です。"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST enable different parties to be charged per media component.",
      "ja": "SIP-AAAインタフェースは、メディアコンポーネントごとに課金される異なる当事者を有効にする必要があります。"
    },
    {
      "indent": 0,
      "text": "2.4.6. Configuration of Accounting Generation Parameters",
      "section_title": true,
      "ja": "2.4.6。会計生成パラメータの設定"
    },
    {
      "indent": 3,
      "text": "The SIP-AAA interface MUST allow AAA servers to communicate parameters for accounting generation.",
      "ja": "SIP-AAAインタフェースは、AAAサーバは、会計上の世代のためのパラメータを通信できるようにしなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.4.7. Support for Arbitrary Correlations",
      "section_title": true,
      "ja": "2.4.7。任意の相関のサポート"
    },
    {
      "indent": 3,
      "text": "Some networks need to be able to relate accounting information to some aspect of the SIP messages involved. So, the SIP-AAA interface MUST allow the AAA server to correlate a particular AAA session with any aspect of the SIP messages. For example, an AAA server that receives accounting information about a SIP dialog may be interested in knowing the Call-ID of the SIP dialog.",
      "ja": "一部のネットワークは、関係するSIPメッセージのいくつかの側面にアカウンティング情報を関連付けることができるようにする必要があります。だから、SIP-AAAインタフェースは、AAAサーバは、SIPメッセージのいずれかの態様で特定のAAAセッションを相関することを可能にしなければなりません。例えば、SIPダイアログに関する会計情報を受信AAAサーバは、Call-IDをSIPダイアログのを知ることに興味があるかもしれません。"
    },
    {
      "indent": 0,
      "text": "3. Scenarios",
      "section_title": true,
      "ja": "3.シナリオ"
    },
    {
      "indent": 3,
      "text": "This section outlines some possible scenarios for SIP and AAA interaction. These are purely illustrative examples and do not impose any requirements.",
      "ja": "このセクションでは、SIPおよびAAAの相互作用のためのいくつかの可能なシナリオの概要を説明します。これらは単に例示例であり、いずれかの要件を課しません。"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows the typical call flow between a SIP proxy that communicates to an AAA server that performs authentication and authorization. All the examples are based on this flow.",
      "ja": "図1は、認証および許可を行うAAAサーバと通信し、SIPプロキシとの間の典型的なコールフローを示します。すべての例は、このフローに基づいています。"
    },
    {
      "indent": 10,
      "text": "SIP            SIP            AAA\nUAC           Proxy          Server",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "|              |              |\n|---METHOD---->|              |\n|              |--Is it OK?-->|\n|              |              |\n|              |<-----OK------|\n|              |              |\n|              |              |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Figure 1: Call flow over the SIP-AAA interface",
      "ja": "図1：SIP-AAAインタフェースを介してコールフロー"
    },
    {
      "indent": 3,
      "text": "The SIP proxy receives a request with certain credentials. The SIP UAC that generated the request may have included the credentials after having been challenged by the proxy using a 407 (Proxy Authentication Required) response. The SIP proxy sends a request to the AAA server asking if it is OK to provide a particular service for this request. The service may be simply routing forward the request or may consist of a more complex service. The AAA server checks that the credentials are correct (authentication), and checks the user profile. The user profile indicates that it is OK to provide the service, and responds to the SIP proxy. The SIP proxy provides the service requested by the SIP UAC.",
      "ja": "SIPプロキシは、特定の資格情報を使用して要求を受け取ります。要求を生​​成したSIP UAC 407（プロキシ認証が必要）応答を使用してプロキシによって挑戦された後に認証情報を含んでいてもよいです。 SIPプロキシは、この要求の特定のサービスを提供するために、OKであるかどうかを尋ねるAAAサーバに要求を送信します。サービスは、単にフォワード要求をルーティングしてもよいし、より複雑なサービスから構成されてもよいです。 AAAサーバは、認証情報が正しい（認証）であることを確認し、ユーザプロファイルをチェックします。ユーザープロファイルは、サービスを提供するために、OKであることを示し、およびSIPプロキシに応答します。 SIPプロキシは、SIP UACにより要求されたサービスを提供します。"
    },
    {
      "indent": 0,
      "text": "3.1. WLAN Roaming Using Third Party Service Providers",
      "section_title": true,
      "ja": "3.1。サードパーティのサービスプロバイダを使用してローミングWLAN"
    },
    {
      "indent": 3,
      "text": "User A wants to establish a voice session over the Internet with user B. User A wants its SIP signalling to be routed through SIP proxy C, because it provides a call log service (i.e., SIP proxy C sends an email to user A once a month with the duration of all the calls made during the month).",
      "ja": "ユーザーAは、Aは、それがコールログサービスCは、一度、ユーザAに電子メールを送信する（すなわち、SIPプロキシが提供されるため、そのSIPシグナリングは、SIPプロキシC経由でルーティングすることを希望するユーザBのユーザーとインターネット上で音声セッションを確立することを望んでいます月の間に行われたすべての通話時間と月）。"
    },
    {
      "indent": 8,
      "text": "                  SIP               AAA\nUser A          Proxy C            Server           User B",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "|                |                 |                |\n|----INVITE----->|                 |                |\n|                |                 |                |\n|<-----407-------|                 |                |\n|                |                 |                |\n|------ACK------>|                 |                |\n|                |                 |                |\n|----INVITE----->|                 |                |\n|                |---Is this OK?-->|                |\n|                |                 |                |\n|                |<------OK--------|                |\n|                |                 |                |\n|                |---------INVITE------------------>|\n|                |                 |                |\n|                |-Accounting msg->|                |\n|                |                 |                |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Figure 2: WLAN roaming user",
      "ja": "図2：WLANローミングユーザー"
    },
    {
      "indent": 3,
      "text": "User A accesses the Internet using a WLAN access outside his home domain. User A, user B, SIP proxy C, and the home AAA server of user A are all in different domains.",
      "ja": "ユーザAは、自分のホームドメイン外のWLANアクセスを使用してインターネットにアクセスします。ユーザA、ユーザB、SIPプロキシC、および利用者AのホームAAAサーバは、すべての異なるドメインにあります。"
    },
    {
      "indent": 3,
      "text": "SIP proxy C challenges the initial INVITE from user A with a 407 (Proxy Authentication Required) response, and user A reissues the INVITE including his credentials. SIP proxy C consults user A's home AAA server, which confirms that the credentials belong to user A and that SIP proxy C can go ahead and provide its service for that call. SIP proxy C routes the INVITE forward towards user B and sends an accounting message to the AAA server, which will be used later to charge user A for the service provided by SIP proxy C.",
      "ja": "SIPプロキシCは、初期には407（プロキシ認証が必要）応答で、ユーザAからINVITE挑戦し、ユーザAは、自分の資格情報を含むINVITEを再発行します。 SIPプロキシCは、資格情報は、ユーザAに属し、そのSIPプロキシCは先に行くと、その呼のためのサービスを提供できることを確認し、ユーザAのホームAAAサーバを、相談します。 SIPプロキシCルートは、ユーザBに向かって前方にINVITEとSIPプロキシC.が提供するサービスのためのユーザAを充電するために後で使用されるAAAサーバにアカウンティングメッセージを送信します。"
    },
    {
      "indent": 0,
      "text": "3.2. Conditional Authorization",
      "section_title": true,
      "ja": "3.2。条件付き承認"
    },
    {
      "indent": 3,
      "text": "User A is not in his home domain, but he still uses SIP proxy C (which is in user's A home domain) as the outbound proxy for an INVITE. SIP proxy C consults the home AAA server, which indicates that requests from user A have to be routed through SIP proxy D. SIP proxy C uses SIP loose routing so that the INVITE traverses D before reaching its destination. SIP proxy D will provide a call log service for user A.",
      "ja": "ユーザAは、自分のホームドメインではないが、彼はまだINVITEのためのアウトバウンドプロキシとして（ユーザーにホームドメインの場合）SIPプロキシCを使用しています。 SIPプロキシCは、ユーザAからの要求は、SIPプロキシD. SIPプロキシCを介してルーティングされなければならないことを示し、ホームAAAサーバは、INVITEようにSIPルーズルーティングを使用してその宛先に到達する前にDを横断調べ。 SIPプロキシDは、ユーザAのコールログサービスを提供します"
    },
    {
      "indent": 8,
      "text": "                  SIP                    AAA         SIP\nUser A          Proxy C                 Server     Proxy D",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "|                |                      |           |\n|----INVITE----->|                      |           |\n|                |                      |           |\n|<-----407-------|                      |           |\n|                |                      |           |\n|------ACK------>|                      |           |\n|                |                      |           |\n|----INVITE----->|                      |           |\n|                |------Is this OK?---->|           |\n|                |                      |           |\n|                |<-OK if routed thru D-|           |\n|                |                      |           |\n|                |---------INVITE------------------>|\n|                |                      |           |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Figure 3: Conditional Authorization",
      "ja": "図3：条件付き承認"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Security is a critical requirement of the SIP-AAA Interface. Section 2.1.9 describes the threats and security requirements. Sections 2.2 and 2.3 elaborate on the authentication and authorization requirements.",
      "ja": "セキュリティは、SIP-AAAインターフェイスの重要な要件です。セクション2.1.9は、脅威とセキュリティ要件について説明します。セクション2.2と2.3の認証と認可の要件について詳しく説明。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "ja": "5.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank the participants of the SIP interim meeting, May 2002 for their comments. The authors would also thank Harri Hakala, Mary Barns, Pete McCann, Jari Arkko, Aki Niemi, Juha Heinanen, Henry Sinnreich, Allison Mankin, and Bernard Aboba for their comments.",
      "ja": "作者は彼らのコメントのためSIP暫定会議、2002年5月の参加者に感謝したいと思います。著者はまた、彼らのコメントのためにハッリHakala、メアリーバーンズ、ピートマッキャン、ヤリArkko、アキニエミ、ユハHeinanen、ヘンリーSinnreich、アリソンマンキン、およびバーナードAbobaに感謝します。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank the authors of the \"AAA Requirements for IP Telephony/Multimedia\" document, as it provided a basis for some of the information contained in this document.",
      "ja": "それは、この文書に含まれる情報の一部のための基礎を提供して著者は、文書「IPテレフォニー/マルチメディアのためのAAA要件」の作者に感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M. and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "ja": "[1]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\"、 RFC 3261、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[2] Bradner, S., \"Key words for use in RFCs to indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[2]ブラドナーの、S.、 \"要件レベルを示すRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月を。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[3] Calhoun, P., Loughney, J., Guttman, E., Zorn, G. and J. Arkko, \"Diameter Base Protocol\", RFC 3588, September 2003.",
      "ja": "[3]カルフーン、P.、Loughney、J.、ガットマン、E.、ゾルン、G.およびJ. Arkko、 \"直径ベースプロトコル\"、RFC 3588、2003年9月。"
    },
    {
      "indent": 3,
      "text": "[4] Glass, S., Hiller, T., Jacobs, S. and C. Perkins, \"Mobile IP Authentication, Authorization, and Accounting Requirements\", RFC 2977, October 2000.",
      "ja": "[4]ガラス、S.、ヒラー、T.、ジェイコブス、S.およびC.パーキンス、 \"モバイルIP認証、認可、およびアカウンティング要件\"、RFC 2977、2000年10月。"
    },
    {
      "indent": 3,
      "text": "[5] Rigney, C., Willens, S., Rubens, A. and W. Simpson, \"Remote Authentication Dial in User Service (RADIUS)\", RFC 2865, June 2000.",
      "ja": "[5] Rigney、C.、ウィレンス、S.、ルーベン、A.とW.シンプソン、RFC 2865、2000年6月 \"ユーザーサービス（RADIUS）におけるリモート認証ダイヤル\"。"
    },
    {
      "indent": 3,
      "text": "[6] Aboba, B. and J. Vollbrecht, \"Proxy Chaining and Policy Implementation in Roaming\", RFC 2607, June 1999.",
      "ja": "[6] Aboba、B.、およびJ. Vollbrecht、 \"ローミング中のプロキシ連鎖とポリシー実装\"、RFC 2607、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[7] Chiba, M., Dommety, G., Eklund, M., Mitton, D. and B. Aboba, \"Dynamic Authorization Extensions to Remote Authentication Dial in User Service (RADIUS)\", RFC 3576, July 2003.",
      "ja": "[7]千葉、M.、Dommety、G.、エクランド、M.、ミトン、D.とB. Abobaを、 \"ダイナミックな承認拡張機能は、ユーザーサービス（RADIUS）におけるリモート認証ダイヤルへ\"、RFC 3576、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[8] Aboba, B., Arkko, J. and D. Harrington, \"Introduction to Accounting Management\", RFC 2975, October 2000.",
      "ja": "[8] Aboba、B.、Arkko、J.とD.ハリントン、 \"会計管理の概要\"、RFC 2975、2000年10月。"
    },
    {
      "indent": 0,
      "text": "7. Authors' Addresses",
      "section_title": true,
      "ja": "7.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "John Loughney Nokia Itamerenkatu 11-13 00180 Helsinki Finland",
      "ja": "じょｈん ぉうｇｈねｙ のきあ いためれんかつ １１ー１３ ００１８０ へｌしんき ふぃんぁんｄ"
    },
    {
      "indent": 3,
      "text": "EMail: John.Loughney@nokia.com",
      "ja": "メールアドレス：John.Loughney@nokia.com"
    },
    {
      "indent": 3,
      "text": "Gonzalo Camarillo Ericsson Advanced Signalling Research Lab. FIN-02420 Jorvas Finland",
      "ja": "ゴンサロ・カマリロエリクソン高度なシグナリング研究所。 FIN-02420 Jorvasフィンランド"
    },
    {
      "indent": 3,
      "text": "EMail: Gonzalo.Camarillo@ericsson.com",
      "ja": "メールアドレス：Gonzalo.Camarillo@ericsson.com"
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78 and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（C）インターネット協会（2004）。この文書では、BCP 78に含まれる権利、ライセンスおよび制限があり、そこに記載された以外、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}