{
  "title": {
    "text": "RFC 3633 - IPv6 Prefix Options for Dynamic Host Configuration Protocol (DHCP) version 6",
    "ja": "RFC 3633 - 動的ホスト構成プロトコル（DHCP）バージョン6のIPv6プレフィックスオプション"
  },
  "number": 3633,
  "created_at": "2019-10-20 09:30:52.544906+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           O. Troan\nRequest for Comments: 3633                                      R. Droms\nCategory: Standards Track                                  Cisco Systems\n                                                           December 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "              IPv6 Prefix Options for\nDynamic Host Configuration Protocol (DHCP) version 6",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Prefix Delegation options provide a mechanism for automated delegation of IPv6 prefixes using the Dynamic Host Configuration Protocol (DHCP). This mechanism is intended for delegating a long-lived prefix from a delegating router to a requesting router, across an administrative boundary, where the delegating router does not require knowledge about the topology of the links in the network to which the prefixes will be assigned.",
      "ja": "プレフィックス委任オプションは、DHCP（Dynamic Host Configuration Protocol）を使用して、IPv6プレフィックスの自動化された委任のためのメカニズムを提供します。このメカニズムは、委任ルータは、プレフィックスが割り当てられることになるために、ネットワーク内のリンクのトポロジーに関する知識を必要としない管理境界にまたがって、要求元のルータに委譲ルータから長寿命のプレフィックスを委任するためのものです。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.   Introduction . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.   DHCPv6 specification dependency  . . . . . . . . . . . . . .   3\n3.   Terminology  . . . . . . . . . . . . . . . . . . . . . . . .   3\n4.   Requirements . . . . . . . . . . . . . . . . . . . . . . . .   3\n5.   Model and Applicability  . . . . . . . . . . . . . . . . . .   3\n     5.1.  Example network architecture . . . . . . . . . . . . .   4\n6.   Identity Association for Prefix Delegation . . . . . . . . .   5\n7.   Overview of DHCP with Prefix Delegation  . . . . . . . . . .   6\n8.   Interface Selection  . . . . . . . . . . . . . . . . . . . .   7\n9.   Identity Association for Prefix Delegation Option  . . . . .   7\n10.  IA_PD Prefix option  . . . . . . . . . . . . . . . . . . . .   9\n11.  Delegating Router Solicitation . . . . . . . . . . . . . . .  11\n     11.1. Requesting router behavior . . . . . . . . . . . . . .  11\n     11.2. Delegating router behavior . . . . . . . . . . . . . .  11\n12.  Requesting router initiated prefix delegation  . . . . . . .  12",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "     12.1. Requesting router behavior . . . . . . . . . . . . . .  12\n     12.2. Delegating Router behavior . . . . . . . . . . . . . .  14\n13.  Prefix Delegation reconfiguration  . . . . . . . . . . . . .  15\n     13.1. Delegating Router behavior . . . . . . . . . . . . . .  15\n     13.2. Requesting Router behavior . . . . . . . . . . . . . .  15\n14.  Relay agent behavior . . . . . . . . . . . . . . . . . . . .  15\n15.  Security Considerations  . . . . . . . . . . . . . . . . . .  16\n16.  IANA Considerations  . . . . . . . . . . . . . . . . . . . .  16\n17.  Intellectual Property Statement. . . . . . . . . . . . . . .  17\n18.  References . . . . . . . . . . . . . . . . . . . . . . . . .  17\n     18.1. Normative References . . . . . . . . . . . . . . . . .  17\n     18.2. Informative References . . . . . . . . . . . . . . . .  17\n19.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . .  18\n20.  Authors' Addresses . . . . . . . . . . . . . . . . . . . . .  18\n21.  Full Copyright Statement . . . . . . . . . . . . . . . . . .  19",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document describes new options for Dynamic Host Configuration Protocol (DHCP) that provide a mechanism for the delegation of IPv6 prefixes [1]. Through these options, a delegating router can delegate prefixes to authorized requesting routers.",
      "ja": "この文書では、[1] IPv6プレフィックスの委任のためのメカニズムを提供する動的ホスト構成プロトコル（DHCP）のための新しいオプションについて説明します。これらのオプションを通じて、委任ルータは、許可要求ルータへのプレフィックスを委任することができます。"
    },
    {
      "indent": 3,
      "text": "The prefix delegation mechanism described in this document is intended for simple delegation of prefixes from a delegating router to requesting routers. It is appropriate for situations in which the delegating router does not have knowledge about the topology of the networks to which the requesting router is attached, and the delegating router does not require other information aside from the identity of the requesting router to choose a prefix for delegation. For example, these options would be used by a service provider to assign a prefix to a Customer Premise Equipment (CPE) device acting as a router between the subscriber's internal network and the service provider's core network.",
      "ja": "この文書で説明したプレフィックス委任メカニズムは、要求ルータへの委任ルータからプレフィックスを簡単に委任するためのものです。これは、委任ルータが要求ルータが接続されているネットワークのトポロジーに関する知識を持っていないような状況に適しており、委任するルータは、接頭辞を選択するように要求ルータのアイデンティティとは別に、他の情報を必要としません委任。例えば、これらのオプションは、加入者の内部ネットワークとサービスプロバイダのコアネットワークとの間のルータとして動作する顧客宅内機器（CPE）デバイスにプレフィックスを割り当てるためにサービスプロバイダによって使用されるであろう。"
    },
    {
      "indent": 3,
      "text": "Many applications expect stable addresses. Even though this mechanism makes automatic renumbering easier, it is expected that prefixes have a long lifespan. During renumbering it is expected that the old and the new prefix co-exist for some time.",
      "ja": "多くのアプリケーションでは、安定したアドレスを期待しています。このメカニズムは、自動リナンバリングが容易になりますにもかかわらず、接頭辞が長い寿命を持つことが期待されます。リナンバリングの際には、古いものと新しいプレフィックスがしばらく共存することを期待されています。"
    },
    {
      "indent": 3,
      "text": "The design of this prefix delegation mechanism meets the requirements for prefix delegation in Requirements for IPv6 prefix delegation [6].",
      "ja": "このプレフィックス委任メカニズムの設計は、IPv6プレフィックス委任[6]の要件にプレフィックス委任のための要件を満たしています。"
    },
    {
      "indent": 3,
      "text": "Note that this use of DHCP is not bound to the assignment of IP addresses or other configuration information to hosts, and that no mechanism is currently available to communicate delegated prefixes to a DHCP server that serves such a function. This may be an item of future work, should usage warrant.",
      "ja": "DHCPのこの使用は、IPアドレスまたはホストに他の構成情報の割り当てに結合していないこと、およびメカニズムは、そのような機能を果たすDHCPサーバに委任プレフィックスを通信するために現在利用可能ではないことに留意されたいです。これはすべき用法令状、将来の仕事のアイテムかもしれません。"
    },
    {
      "indent": 0,
      "text": "2. DHCPv6 specification dependency",
      "section_title": true,
      "ja": "2. DHCPv6の仕様依存性"
    },
    {
      "indent": 3,
      "text": "This document describes new DHCPv6 options for IPv6 prefix delegation. This document should be read in conjunction with the DHCPv6 specification, RFC 3315 [2], for a complete specification of the Prefix Delegation options and mechanism. Definitions for terms and acronyms not specifically defined in this document are defined in RFC 3315.",
      "ja": "この文書は、IPv6プレフィックス委任のための新しいDHCPv6オプションについて説明します。この文書は、DHCPv6の仕様と併せて読まれるべき、RFC 3315 [2]、プレフィックス委任オプションと機構の完全な仕様。特にこの文書で定義されていない用語と略語の定義は、RFC 3315で定義されています。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3.用語"
    },
    {
      "indent": 3,
      "text": "This document uses the terminology defined in RFC 2460 [1] and RFC 3315. In addition, this document uses the following terms:",
      "ja": "この文書はまた、[1] RFC 2460で定義された用語を使用して、RFC 3315、この文献は、次の用語を使用します。"
    },
    {
      "indent": 3,
      "text": "requesting router: The router that acts as a DHCP client and is requesting prefix(es) to be assigned.",
      "ja": "ルータを要求する：DHCPクライアントとして動作し、割り当てられるプレフィックス（複数可）を要求しているルータを。"
    },
    {
      "indent": 3,
      "text": "delegating router: The router that acts as a DHCP server, and is responding to the prefix request.",
      "ja": "ルータ委任：DHCPサーバとして動作するルータを、プレフィックス要求に応答しています。"
    },
    {
      "indent": 3,
      "text": "Identity Association for Prefix Delegation (IA_PD): A collection of prefixes assigned to the requesting router. Each IA_PD has an associated IAID. A requesting router may have more than one IA_PD assigned to it; for example, one for each of its interfaces.",
      "ja": "プレフィックス委任のためのアイデンティティ協会（IA_PD）：要求ルータに割り当てられたプレフィックスのコレクション。各IA_PDは、関連するIAIDを持っています。要求ルータは、それに割り当てられた複数のIA_PDを有していてもよいです。例えば、そのインターフェースのそれぞれに1つずつ。"
    },
    {
      "indent": 0,
      "text": "4. Requirements",
      "section_title": true,
      "ja": "4.要件"
    },
    {
      "indent": 3,
      "text": "The keywords MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD NOT, RECOMMENDED, MAY, and OPTIONAL, when they appear in this document, are to be interpreted as described in BCP 14, RFC 2119 [3].",
      "ja": "キーワードは、REQUIREDは、、、、、これらは本文書に現れる場合BCP 14、RFC 2119に記載されているように、[3]に解釈されるべきである、MAY、推奨、およびOPTIONALすべきでないないものSHALL NOTしなければならないしなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Model and Applicability",
      "section_title": true,
      "ja": "5.モデルと適用"
    },
    {
      "indent": 3,
      "text": "The model of operation for prefix delegation is as follows. A delegating router is provided IPv6 prefixes to be delegated to requesting routers. Examples of ways in which the delegating router may be provided these prefixes are given in Section 12.2. A requesting router requests prefix(es) from the delegating router, as described in Section 12.1. The delegating router chooses prefix(es) for delegation, and responds with prefix(es) to the requesting router. The requesting router is then responsible for the delegated prefix(es). For example, the requesting router might assign a subnet from a delegated prefix to one of its interfaces, and begin sending router advertisements for the prefix on that link.",
      "ja": "次のようにプレフィックス委任のための操作のモデルがあります。委任ルータは、要求元のルータに委任するIPv6プレフィックスを提供します。委任ルータは、これらのプレフィックスを提供することが可能な方法の例は、セクション12.2に記載されています。 12.1節で説明するように要求するルータは、委任するルータからのプレフィックス（複数可）を要求します。委任ルータは、代表団のための接頭語（es）を選択し、要求元のルータにプレフィックス（複数可）を使用して応答します。要求ルータは、委任プレフィックス（複数可）を担当しています。例えば、要求元のルータは、そのインターフェイスのいずれかに委任プレフィックスからサブネットを割り当てると、そのリンク上のプレフィックスのルータ通知の送信を開始することがあります。"
    },
    {
      "indent": 3,
      "text": "Each prefix has an associated valid and preferred lifetime, which constitutes an agreement about the length of time over which the requesting router is allowed to use the prefix. A requesting router can request an extension of the lifetimes on a delegated prefix and is required to terminate the use of a delegated prefix if the valid lifetime of the prefix expires.",
      "ja": "各プレフィックスは、要求ルータが接頭辞を使用することが許される時間の長さについての合意を構成関連する有効かつ好ましい寿命を持っています。要求ルータは、委任プレフィックスの寿命の延長を要求することができますし、プレフィックスの有効期間が満了した場合、委任プレフィックスの使用を終了するために必要です。"
    },
    {
      "indent": 3,
      "text": "This prefix delegation mechanism would be appropriate for use by an ISP to delegate a prefix to a subscriber, where the delegated prefix would possibly be subnetted and assigned to the links within the subscriber's network.",
      "ja": "このプレフィックス委任メカニズムは、委任されたプレフィックスが、おそらくサブネットと加入者のネットワーク内のリンクに割り当てられる加入者、にプレフィックスを委任するISPで使用するために適切であろう。"
    },
    {
      "indent": 0,
      "text": "5.1. Example network architecture",
      "section_title": true,
      "ja": "5.1. 例のネットワークアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "Figure 1 illustrates a network architecture in which prefix delegation could be used.",
      "ja": "図1は、プレフィックス委譲を使用することができたネットワークアーキテクチャを示す図です。"
    },
    {
      "indent": 0,
      "text": "                 ______________________                 \\\n                /                      \\                 \\\n               |    ISP core network    |                 \\\n                \\__________ ___________/                   |\n                           |                               |\n                   +-------+-------+                       |\n                   |  Aggregation  |                       | ISP\n                   |    device     |                       | network\n                   |  (delegating  |                       |\n                   |    router)    |                       |\n                   +-------+-------+                       |\n                           |                              /\n                           |DSL to subscriber            /\n                           |premises                    /\n                           |\n                    +------+------+                     \\\n                    |     CPE     |                      \\\n                    | (requesting |                       \\\n                    |   router)   |                        |\n                    +----+---+----+                        |\n                         |   |                             | Subscriber\n  ---+-------------+-----+- -+-----+-------------+---      | network\n     |             |               |             |         |\n+----+-----+ +-----+----+     +----+-----+ +-----+----+    |\n|Subscriber| |Subscriber|     |Subscriber| |Subscriber|   /\n|    PC    | |    PC    |     |    PC    | |    PC    |  /\n+----------+ +----------+     +----------+ +----------+ /",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Figure 1: An example of prefix delegation.",
      "ja": "図1：プレフィックス委任の例。"
    },
    {
      "indent": 3,
      "text": "In this example, the delegating router is configured with a set of prefixes to be used for assignment to customers at the time of each customer's first connection to the ISP service. The prefix delegation process begins when the requesting router requests configuration information through DHCP. The DHCP messages from the requesting router are received by the delegating router in the aggregation device. When the delegating router receives the request, it selects an available prefix or prefixes for delegation to the requesting router. The delegating router then returns the prefix or prefixes to the requesting router.",
      "ja": "この例では、委任ルータは、ISPのサービスに各顧客の最初の接続時には顧客への割り当てに使用する接頭語のセットで構成されています。要求ルータはDHCPを通じて設定情報を要求したときにプレフィックス委任プロセスが開始されます。要求ルータからDHCPメッセージが集約デバイスで委任するルータによって受信されます。委任ルータが要求を受信すると、要求元のルータへの委任のために利用できる接頭辞や接頭辞を選択します。委任ルータは、要求ルータに接頭辞や接頭辞を返します。"
    },
    {
      "indent": 3,
      "text": "The requesting router subnets the delegated prefix and assigns the longer prefixes to links in the subscriber's network. In a typical scenario based on the network shown in Figure 1, the requesting router subnets a single delegated /48 prefix into /64 prefixes and assigns one /64 prefix to each of the links in the subscriber network.",
      "ja": "要求ルータは、委任プレフィックスをサブネットと加入者のネットワーク内のリンクに長いプレフィックスを割り当てます。図1に示したネットワークに基づいて、典型的なシナリオでは、要求ルータは/ 64プレフィックスに単一の委任/ 48プレフィックスをサブネットと加入者ネットワーク内の各リンクに1/64プレフィックスを割り当てます。"
    },
    {
      "indent": 3,
      "text": "The prefix delegation options can be used in conjunction with other DHCP options carrying other configuration information to the requesting router. The requesting router may, in turn, then provide DHCP service to hosts attached to the internal network. For example, the requesting router may obtain the addresses of DNS and NTP servers from the ISP delegating router, and then pass that configuration information on to the subscriber hosts through a DHCP server in the requesting router.",
      "ja": "プレフィックス委任オプションは、要求ルータに他の構成情報を運ぶ他のDHCPオプションと組み合わせて使用​​することができます。要求ルータは、今度は、内部ネットワークに接続されたホストにDHCPサービスを提供することができます。例えば、要求ルータは、ルータを委任ISPからDNSとNTPサーバのアドレスを取得してもよいし、次いで要求ルータにDHCPサーバを介して加入者のホストに上の設定情報を渡します。"
    },
    {
      "indent": 0,
      "text": "6. Identity Association for Prefix Delegation",
      "section_title": true,
      "ja": "プレフィックス委任6.アイデンティティ協会"
    },
    {
      "indent": 3,
      "text": "An IA_PD is a construct through which a delegating router and a requesting router can identify, group and manage a set of related IPv6 prefixes. Each IA_PD consists of an IAID and associated configuration information. An IA_PD for prefixes is the equivalent of an IA (described in RFC 3315) for addresses.",
      "ja": "IA_PDは委任ルータと要求ルータは、特定のグループと関連したIPv6プレフィックスの集合を管理できるような構築物です。各IA_PDはIAIDおよび関連する構成情報から成ります。プレフィクスのIA_PDは、アドレスの（RFC 3315に記載）IAのと等価です。"
    },
    {
      "indent": 3,
      "text": "An IA_PD is different from an IA, in that it does not need to be associated with exactly one interface. One IA_PD can be associated with the requesting router, with a set of interfaces or with exactly one interface. A requesting router must create at least one distinct IA_PD. It may associate a distinct IA_PD with each of its downstream network interfaces and use that IA_PD to obtain a prefix for that interface from the delegating router.",
      "ja": "それは正確に一つのインタフェースに関連付けする必要がない点でIA_PDは、IAは異なっています。一IA_PDは、インタフェースのセットまたは正確に一つのインタフェースと、要求ルータに関連付けることができます。要求ルータは、少なくとも1つの異なるIA_PDを作成する必要があります。これは、その下流のネットワーク・インターフェースのそれぞれと異なるIA_PDを関連付けるとIA_PDが委任ルータからそのインタフェースのプレフィックスを取得することを使用することができます。"
    },
    {
      "indent": 3,
      "text": "The IAID uniquely identifies the IA_PD and must be chosen to be unique among the IA_PD IAIDs on the requesting router. The IAID is chosen by the requesting router. For any given use of an IA_PD by the requesting router, the IAID for that IA_PD MUST be consistent across restarts of the requesting router. The requesting router may maintain consistency either by storing the IAID in non-volatile storage or by using an algorithm that will consistently produce the same IAID as long as the configuration of the requesting router has not changed. If the requesting router uses only one IAID, it can use a well-known value, e.g., zero.",
      "ja": "IAID一意IA_PDを識別し、要求ルータにIA_PD IAIDs中で一意となるように選択されなければなりません。 IAIDは、要求ルータによって選択されています。要求ルータによってIA_PDの任意の使用のために、そのIA_PDためIAIDは、要求ルータの再起動にわたって一貫していなければなりません。要求ルータは、いずれかの不揮発性記憶装置にIAIDを記憶することによって、または一貫している限り、要求ルータの設定が変更されていない同じIAIDを生成するアルゴリズムを使用して一貫性を維持することができます。要求ルータは一IAIDを使用する場合、それはよく知られている値、例えば、ゼロを使用することができます。"
    },
    {
      "indent": 3,
      "text": "The configuration information in an IA_PD consists of one or more IPv6 prefixes along with the times T1 and T2 for the IA_PD. See section 9 for the representation of an IA_PD in a DHCP message.",
      "ja": "IA_PDの構成情報はIA_PDための時間T1とT2と一緒に一つまたは複数のIPv6プレフィックスから構成されています。 DHCPメッセージでIA_PDの表現のためのセクション9を参照してください。"
    },
    {
      "indent": 0,
      "text": "7. Overview of DHCP with Prefix Delegation",
      "section_title": true,
      "ja": "プレフィックス委任とDHCPの7の概要"
    },
    {
      "indent": 3,
      "text": "Prefix delegation with DHCP is independent of address assignment with DHCP. A requesting router can use DHCP for just prefix delegation or for prefix delegation along with address assignment and other configuration information.",
      "ja": "DHCPとプレフィックス委任は、DHCPでのアドレスの割り当てとは無関係です。要求ルータは、アドレスの割り当てやその他の設定情報と一緒にちょうどプレフィックス委譲のためまたはプレフィックス委任のためにDHCPを使用することができます。"
    },
    {
      "indent": 3,
      "text": "A requesting router first creates an IA_PD and assigns it an IAID. The requesting router then transmits a Solicit message containing an IA_PD option describing the IA_PD. Delegating routers that can delegate prefixes to the IA_PD respond to the requesting router with an Advertise message.",
      "ja": "要求ルータは最初IA_PDを作成し、それをIAIDを割り当てます。要求ルータは、次にIA_PDを記述するIA_PDオプションを含む要請メッセージを送信します。 IA_PDにプレフィックスを委任できる委任ルータは、広告メッセージと要求してルータに対応しています。"
    },
    {
      "indent": 3,
      "text": "The requesting router may include prefixes in the IA_PDs as a hint to the delegating router about specific prefixes for which the requesting router has a preference.",
      "ja": "要求ルータは、要求ルータは、優先順位を持っている固有のプレフィックス約委任ルータへのヒントとしてIA_PDsにプレフィックスを含むことができます。"
    },
    {
      "indent": 3,
      "text": "When the requesting router has identified a delegating router, the requesting router uses a Request message to populate the IA_PDs with prefixes. The requesting router includes one or more IA_PD options in the Request message. The delegating router returns prefixes and other information about the IA_PDs to the requesting router in IA_PD options in a Reply message. The requesting router records the lifetimes for the delegated prefix(es) and uses the prefix(es) as described in the previous section.",
      "ja": "要求ルータは委任ルータを特定している場合は、要求ルータは接頭辞IA_PDsを移入するために要求メッセージを使用しています。要求ルータは、要求メッセージ内の1つまたは複数のIA_PDオプションが含まれています。委任ルータは、プレフィックスと応答メッセージでIA_PDオプションで要求するルータにIA_PDsに関するその他の情報を返します。要求ルータは、委任プレフィックス（複数可）のためのライフタイムを記録し、前のセクションで説明したように接頭語（ES）を使用しています。"
    },
    {
      "indent": 3,
      "text": "Before the valid lifetime on each delegated prefix expires, the requesting router includes the prefix in an IA_PD option sent in a Renew message to the delegating router. The delegating router responds by returning the prefix with updated lifetimes to the requesting router.",
      "ja": "各委任プレフィックスの有効期間が満了する前に、要求元のルータが委任するルータに更新メッセージで送信IA_PDオプションで接頭辞が含まれています。委任ルータは、要求ルータへの更新寿命と接頭辞を返すことによって応答します。"
    },
    {
      "indent": 0,
      "text": "8. Interface Selection",
      "section_title": true,
      "ja": "8.インターフェースの選択"
    },
    {
      "indent": 3,
      "text": "Delegated prefixes are not associated with a particular interface in the same way as addresses are for address assignment, and the rules described in section 16, \"Client Source Address and Interface Selection\" of RFC 3315 do not apply.",
      "ja": "委任プレフィックスは、アドレスがアドレスの割り当てにあるのと同じ方法で、特定のインターフェイスに関連付けられていない、とセクション16、RFC 3315の「クライアント送信元アドレスおよびインターフェースの選択」で説明したルールは適用されません。"
    },
    {
      "indent": 3,
      "text": "When a requesting router sends a DHCP message, it SHOULD be sent on the interface associated with the upstream router (ISP network). The upstream interface is typically determined by configuration. This rule applies even in the case where a separate IA_PD is used for each downstream interface.",
      "ja": "要求ルータは、DHCPメッセージを送信する場合は、上流のルータ（ISPネットワーク）に関連付けられたインターフェイス上で送信されるべきです。アップストリームインターフェイスは、典型的には、構成によって決定されます。このルールは、さらに別IA_PD各ダウンストリームインターフェイスのために使用される場合にも当てはまります。"
    },
    {
      "indent": 3,
      "text": "When a requesting router sends a DHCP message directly to a delegating router using unicast (after receiving the Server Unicast option from that delegating router), the source address SHOULD be an address from the upstream interface and which is suitable for use by the delegating router in responding to the requesting router.",
      "ja": "要求ルータは、（その委任ルータからサーバユニキャストオプションを受信した後に）ユニキャストを使用して委任ルータに直接DHCPメッセージを送信すると、送信元アドレスは、アップストリームインタフェースからのアドレスであることとに委任ルータによって使用するのに適しているべきです要求ルータへの対応。"
    },
    {
      "indent": 0,
      "text": "9. Identity Association for Prefix Delegation Option",
      "section_title": true,
      "ja": "プレフィックス委任オプション9.アイデンティティ協会"
    },
    {
      "indent": 3,
      "text": "The IA_PD option is used to carry a prefix delegation identity association, the parameters associated with the IA_PD and the prefixes associated with it.",
      "ja": "IA_PDオプションは、プレフィックス委任ID関係、IA_PDおよびそれに関連する接頭辞に関連するパラメータを運ぶために使用されます。"
    },
    {
      "indent": 3,
      "text": "The format of the IA_PD option is:",
      "ja": "IA_PDオプションの形式は次のとおりです。"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         OPTION_IA_PD          |         option-length         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         IAID (4 octets)                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              T1                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              T2                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n.                                                               .\n.                          IA_PD-options                        .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "option-code: OPTION_IA_PD (25)",
      "ja": "オプションコード：OPTION_IA_PD（25）"
    },
    {
      "indent": 3,
      "text": "option-length: 12 + length of IA_PD-options field.",
      "ja": "オプションの長さ：IA_PD・オプション・フィールドの12 +長さ。"
    },
    {
      "indent": 3,
      "text": "IAID: The unique identifier for this IA_PD; the IAID must be unique among the identifiers for all of this requesting router's IA_PDs.",
      "ja": "IAID：このIA_PDの一意の識別子。 IAIDは、この要求ルータのIA_PDsのすべての識別子の中で一意でなければなりません。"
    },
    {
      "indent": 3,
      "text": "T1: The time at which the requesting router should contact the delegating router from which the prefixes in the IA_PD were obtained to extend the lifetimes of the prefixes delegated to the IA_PD; T1 is a time duration relative to the current time expressed in units of seconds.",
      "ja": "T1：要求ルータはIA_PDでプレフィックスがIA_PDに委任プレフィックスの寿命を延ばすために得られた元の委任ルータに連絡すべき時刻; T1は、秒の単位で表さ現在時刻からの相対時間期間です。"
    },
    {
      "indent": 3,
      "text": "T2: The time at which the requesting router should contact any available delegating router to extend the lifetimes of the prefixes assigned to the IA_PD; T2 is a time duration relative to the current time expressed in units of seconds.",
      "ja": "T2：要求ルータがIA_PDに割り当てられたプレフィックスの寿命を延長するために使用可能な任意の委任ルータに連絡するべき時間。 T2は、秒の単位で表さ現在時刻からの相対時間期間です。"
    },
    {
      "indent": 3,
      "text": "IA_PD-options: Options associated with this IA_PD.",
      "ja": "IA_PD-オプション：このIA_PDに関連したオプション。"
    },
    {
      "indent": 3,
      "text": "The IA_PD-options field encapsulates those options that are specific to this IA_PD. For example, all of the IA_PD Prefix Options carrying the prefixes associated with this IA_PD are in the IA_PD-options field.",
      "ja": "IA_PD・オプション・フィールドは、このIA_PDに固有のこれらのオプションをカプセル化します。たとえば、このIA_PDに関連付けられている接頭辞を運ぶIA_PDプレフィックスオプションのすべてがIA_PD・オプション・フィールドです。"
    },
    {
      "indent": 3,
      "text": "An IA_PD option may only appear in the options area of a DHCP message. A DHCP message may contain multiple IA_PD options.",
      "ja": "IA_PDオプションは、DHCPメッセージのオプション領域に表示されることがあります。 DHCPメッセージは、複数のIA_PDオプションが含まれていてもよいです。"
    },
    {
      "indent": 3,
      "text": "The status of any operations involving this IA_PD is indicated in a Status Code option in the IA_PD-options field.",
      "ja": "このIA_PDを含むすべての操作のステータスがIA_PD・オプション・フィールド内のステータスコードオプションで示されています。"
    },
    {
      "indent": 3,
      "text": "Note that an IA_PD has no explicit \"lifetime\" or \"lease length\" of its own. When the valid lifetimes of all of the prefixes in a IA_PD have expired, the IA_PD can be considered as having expired. T1 and T2 are included to give delegating routers explicit control over when a requesting router should contact the delegating router about a specific IA_PD.",
      "ja": "IA_PDは、明示的な「寿命」や、独自の「リース期間」を持っていないことに注意してください。 IA_PDにおける接頭辞のすべての有効寿命は期限が切れている場合は、IA_PDの有効期限が切れたと考えることができます。 T1とT2は、委任ルータに要求して、ルータが特定のIA_PDに関する委任ルータに連絡する必要がある場合を明示的に制御を与えるために含まれています。"
    },
    {
      "indent": 3,
      "text": "In a message sent by a requesting router to a delegating router, values in the T1 and T2 fields indicate the requesting router's preference for those parameters. The requesting router sets T1 and T2 to zero if it has no preference for those values. In a message sent by a delegating router to a requesting router, the requesting router MUST use the values in the T1 and T2 fields for the T1 and T2 parameters. The values in the T1 and T2 fields are the number of seconds until T1 and T2.",
      "ja": "委任ルータに要求ルータによって送信されたメッセージに、T1とT2フィールドの値は、これらのパラメータを要求するルータの優先度を示します。それはそれらの値のための好みを持っていない場合、要求ルーターはゼロにT1とT2を設定します。要求ルータに委任ルータによって送信されたメッセージに、要求ルータは、T1とT2のパラメータのT1とT2フィールドの値を使用しなければなりません。 T1とT2フィールドの値は、T1とT2までの秒数です。"
    },
    {
      "indent": 3,
      "text": "The delegating router selects the T1 and T2 times to allow the requesting router to extend the lifetimes of any prefixes in the",
      "ja": "委任ルータは、要求ルータが任意のプレフィックスの寿命を延ばすことができるようにT1とT2の時間を選択します"
    },
    {
      "indent": 3,
      "text": "IA_PD before the lifetimes expire, even if the delegating router is unavailable for some short period of time. Recommended values for T1 and T2 are .5 and .8 times the shortest preferred lifetime of the prefixes in the IA_PD that the delegating router is willing to extend, respectively. If the time at which the prefixes in an IA_PD are to be renewed is to be left to the discretion of the requesting router, the delegating router sets T1 and T2 to 0.",
      "ja": "IA_PDは寿命が委任するルータは、時間のいくつかの短い期間のために利用できない場合でも、有効期限が切れる前に。 T1とT2の推奨値は、委任ルータはそれぞれ、延長する意思があることIA_PDにおけるプレフィックスの0.5及び0.8倍最短好ましい寿命です。 IA_PDでプレフィックスが更新されるべき時刻が要求ルータの裁量に任されるべきである場合、委任ルータは0にT1とT2を設定します。"
    },
    {
      "indent": 3,
      "text": "If a delegating router receives an IA_PD with T1 greater than T2, and both T1 and T2 are greater than 0, the delegating router ignores the invalid values of T1 and T2 and processes the IA_PD as though the delegating router had set T1 and T2 to 0.",
      "ja": "委任ルータがT2より大きいT1とIA_PDを受信し、T1とT2の両方が0より大きい場合、委任ルータは、T1とT2の無効な値を無視し、委任ルータが0にT1とT2を設定していたかのようIA_PDを処理します。"
    },
    {
      "indent": 3,
      "text": "If a requesting router receives an IA_PD with T1 greater than T2, and both T1 and T2 are greater than 0, the client discards the IA_PD option and processes the remainder of the message as though the delegating router had not included the IA_PD option.",
      "ja": "要求ルータがT2より大きいT1とIA_PDを受信し、T1とT2の両方が0よりも大きい場合、クライアントはIA_PDオプションを破棄し、委任ルータはIA_PDオプションが含まれていなかったかのようにメッセージの残りの部分を処理します。"
    },
    {
      "indent": 0,
      "text": "10. IA_PD Prefix option",
      "section_title": true,
      "ja": "10. IA_PD Prefixオプション"
    },
    {
      "indent": 3,
      "text": "The IA_PD Prefix option is used to specify IPv6 address prefixes associated with an IA_PD. The IA_PD Prefix option must be encapsulated in the IA_PD-options field of an IA_PD option.",
      "ja": "IA_PD PrefixオプションはIA_PDに関連付けられたIPv6アドレスのプレフィックスを指定するために使用されます。 IA_PD PrefixオプションはIA_PDオプションのIA_PD・オプションフィールドにカプセル化する必要があります。"
    },
    {
      "indent": 3,
      "text": "The format of the IA_PD Prefix option is:",
      "ja": "IA_PD Prefixオプションの形式は次のとおりです。"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        OPTION_IAPREFIX        |         option-length         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      preferred-lifetime                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        valid-lifetime                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| prefix-length |                                               |\n+-+-+-+-+-+-+-+-+          IPv6 prefix                          |\n|                           (16 octets)                         |\n|                                                               |\n|                                                               |\n|                                                               |\n|               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               |                                               .\n+-+-+-+-+-+-+-+-+                                               .\n.                       IAprefix-options                        .\n.                                                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "option-code: OPTION_IAPREFIX (26)",
      "ja": "オプションコード：OPTION_IAPREFIX（26）"
    },
    {
      "indent": 3,
      "text": "option-length: 25 + length of IAprefix-options field",
      "ja": "オプションの長さ：IAprefix・オプション・フィールドの25 +長さ"
    },
    {
      "indent": 3,
      "text": "preferred-lifetime: The recommended preferred lifetime for the IPv6 prefix in the option, expressed in units of seconds. A value of 0xFFFFFFFF represents infinity.",
      "ja": "有利な一生：オプションでのIPv6プレフィックスの推奨推奨期間は、秒単位で表されます。 0xFFFFFFFFの値は無限を表します。"
    },
    {
      "indent": 3,
      "text": "valid-lifetime: The valid lifetime for the IPv6 prefix in the option, expressed in units of seconds. A value of 0xFFFFFFFF represents infinity.",
      "ja": "有効な一生：オプションでのIPv6プレフィックスの有効期間は、秒単位で表されます。 0xFFFFFFFFの値は無限を表します。"
    },
    {
      "indent": 3,
      "text": "prefix-length: Length for this prefix in bits",
      "ja": "プレフィックス長：ビットでこのプレフィックスの長さ"
    },
    {
      "indent": 3,
      "text": "IPv6-prefix: An IPv6 prefix",
      "ja": "IPv6のプレフィックス：IPv6プレフィックス"
    },
    {
      "indent": 3,
      "text": "IAprefix-options: Options associated with this prefix",
      "ja": "IAprefix-オプション：この接頭辞に関連付けられているオプション"
    },
    {
      "indent": 3,
      "text": "In a message sent by a requesting router to a delegating router, the values in the fields can be used to indicate the requesting router's preference for those values. The requesting router may send a value of zero to indicate no preference. A requesting router may set the IPv6 prefix field to zero and a given value in the prefix-length field to indicate a preference for the size of the prefix to be delegated.",
      "ja": "委任ルータに要求ルータによって送信されたメッセージに、フィールドの値はこれらの値を要求するルータの優先度を示すために使用することができます。要求ルータには優先度を示さないためにゼロの値を送信することができます。要求ルータは、委任されているプレフィックスのサイズに対する好みを示すために、接頭辞長フィールドゼロにIPv6プレフィックスフィールドと指定された値を設定してもよいです。"
    },
    {
      "indent": 3,
      "text": "In a message sent by a delegating router the preferred and valid lifetimes should be set to the values of AdvPreferredLifetime and AdvValidLifetime as specified in section 6.2.1, \"Router Configuration Variables\" of RFC 2461 [4], unless administratively configured.",
      "ja": "管理上設定しない限り、委任ルータによって送信されるメッセージに好適と有効寿命は、[4] RFC 2461のセクション6.2.1で指定され、「ルータの設定変数」としてAdvPreferredLifetimeとAdvValidLifetimeの値に設定されるべきです。"
    },
    {
      "indent": 3,
      "text": "A requesting router discards any prefixes for which the preferred lifetime is greater than the valid lifetime. A delegating router ignores the lifetimes set by the requesting router if the preferred lifetime is greater than the valid lifetime and ignores the values for T1 and T2 set by the requesting router if those values are greater than the preferred lifetime.",
      "ja": "要求ルータは、推奨期間は有効期間よりも大きいために任意のプレフィックスを破棄します。委任ルータは、好適寿命が有効期間よりも大きく、これらの値は、好適寿命よりも大きい場合に要求ルータによって設定されたT1とT2の値を無視する場合に要求ルータによって設定された寿命を無視します。"
    },
    {
      "indent": 3,
      "text": "The values in the preferred and valid lifetimes are the number of seconds remaining for each lifetime.",
      "ja": "優先および有効寿命の値は、それぞれの生涯の残りの秒数です。"
    },
    {
      "indent": 3,
      "text": "An IA_PD Prefix option may appear only in an IA_PD option. More than one IA_PD Prefix Option can appear in a single IA_PD option.",
      "ja": "IA_PD PrefixオプションはIA_PDオプションで表示されることがあります。複数のIA_PD prefixオプションは、単一IA_PDオプションで表示されます。"
    },
    {
      "indent": 3,
      "text": "The status of any operations involving this IA_PD Prefix option is indicated in a Status Code option in the IAprefix-options field.",
      "ja": "このIA_PD Prefixオプションを含むすべての操作のステータスがIAprefix・オプション・フィールド内のステータスコードオプションで示されています。"
    },
    {
      "indent": 0,
      "text": "11. Delegating Router Solicitation",
      "section_title": true,
      "ja": "11.委任ルーター要請"
    },
    {
      "indent": 3,
      "text": "The requesting router locates and selects a delegating router in the same way as described in section 17, \"DHCP Server Solicitation\" of RFC 3315. The details of the solicitation process are described in this section.",
      "ja": "要求ルータは、要請処理の詳細については、このセクションで説明されているRFC 3315のセクション17に記載され、「DHCPサーバーの要請」と同様に委任ルータを検索し、選択します。"
    },
    {
      "indent": 0,
      "text": "11.1. Requesting router behavior",
      "section_title": true,
      "ja": "11.1. 要求ルータの動作"
    },
    {
      "indent": 3,
      "text": "The requesting router creates and transmits a Solicit message as described in sections 17.1.1, \"Creation of Solicit Messages\" and 17.1.2, \"Transmission of Solicit Messages\" of RFC 3315. The requesting router creates an IA_PD and assigns it an IAID. The requesting router MUST include the IA_PD option in the Solicit message.",
      "ja": "要求ルータが作成され、セクション17.1.1に記載されているように、「作成要請のメッセージ」を要請メッセージを送信し、17.1.2は、RFC 3315要求ルータの「要請メッセージの送信は」IA_PDを作成しIAIDそれを割り当てます。要求ルータは、要請メッセージでIA_PDオプションを含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "The requesting router processes any received Advertise messages as described in section 17.1.3, \"Receipt of Advertise Messages\" of RFC 3315. The requesting router MAY choose to consider the presence of advertised prefixes in its decision about which delegating router to respond to.",
      "ja": "要求ルータは、任意のセクション17.1.3、要求元のルータが応答するようにルータを委任について、その決定でアドバタイズプレフィックスの存在を考慮することを選ぶかもしれRFC 3315の「広告メッセージの受信」で説明したように広告メッセージを受け取って処理します。"
    },
    {
      "indent": 3,
      "text": "The requesting router MUST ignore any Advertise message that includes a Status Code option containing the value NoPrefixAvail, with the exception that the requesting router MAY display the associated status message to the user.",
      "ja": "要求ルータは、任意の要求ルータは、ユーザに関連するステータスメッセージが表示されることがことを除いて、値NoPrefixAvailを含む状態コードオプションを含むメッセージを宣伝無視しなければなりません。"
    },
    {
      "indent": 0,
      "text": "11.2. Delegating router behavior",
      "section_title": true,
      "ja": "11.2. 委任ルータの動作"
    },
    {
      "indent": 3,
      "text": "The delegating router sends an Advertise message to the requesting router in the same way as described in section 17.2.2, \"Creation and transmission of Advertise messages\" of RFC 3315. If the message contains an IA_PD option and the delegating router is configured to delegate prefix(es) to the requesting router, the delegating router selects the prefix(es) to be delegated to the requesting router. The mechanism through which the delegating router selects prefix(es) for delegation is not specified in this document. Examples of ways in which the delegating router might select prefix(es) for a requesting router include: static assignment based on subscription to an ISP; dynamic assignment from a pool of available prefixes; selection based on an external authority such as a RADIUS server using the Framed-IPv6-Prefix option as described in RFC 3162 [5].",
      "ja": "委任ルータは、メッセージがIA_PDオプションと委譲ルーターを委任するように設定されている含まれている場合はセクション17.2.2、「創造と広告メッセージの送信」RFC 3315の中で説明したのと同じ方法で、要求元のルータにメッセージを送り、広告します要求ルータに接頭語（ES）は、委任ルータは接頭語（ES）が要求ルータに委任することを選択します。委任ルータは、委任のための接頭語（ES）を選択するメカニズムはこの文書で指定されていません。委任ルータが要求ルータに接頭語（ES）を選択可能性のある方法の例としては、静的な割り当てをISPへのサブスクリプションに基づきます。使用可能なプレフィクスのプールから動的に割り当てます。 RFC 3162に記載されるように入れる-のIPv6プレフィックス・オプションを使用してこのようなRADIUSサーバなどの外部権限に基づいて選択[5]。"
    },
    {
      "indent": 3,
      "text": "If the requesting router includes an IA_PD Prefix option in the IA_PD option in its Solicit message, the delegating router MAY choose to use the information in that option to select the prefix(es) or prefix size to be delegated to the requesting router.",
      "ja": "要求ルータはその要請メッセージでIA_PDオプションでIA_PD Prefixオプションが含まれている場合は、委譲ルータが要求ルータに委譲する接頭語（ES）またはプレフィックスのサイズを選択するには、そのオプション内の情報を使用することもできます。"
    },
    {
      "indent": 3,
      "text": "The delegating router sends an Advertise message to the requesting router in the same way as described in section, \"Creation and transmission of Advertise messages\" of RFC 3315. The delegating router MUST include an IA_PD option, identifying any prefix(es) that the delegating router will delegate to the requesting router.",
      "ja": "委任ルータは、「創造と広告メッセージの送信」RFC 3315のは、委任ルータは委任する任意の接頭語（ES）を識別する、IA_PDオプションを含まなければなりません、セクションに記載したのと同じ方法で、要求ルータに広告メッセージを送信します。ルータが要求ルータに委譲します。"
    },
    {
      "indent": 3,
      "text": "If the delegating router will not assign any prefixes to any IA_PDs in a subsequent Request from the requesting router, the delegating router MUST send an Advertise message to the requesting router that includes the IA_PD with no prefixes in the IA_PD and a Status Code option in the IA_PD containing status code NoPrefixAvail and a status message for the user, a Server Identifier option with the delegating router's DUID and a Client Identifier option with the requesting router's DUID.",
      "ja": "委任ルータが要求ルータからの後続のリクエストで任意のIA_PDsに任意の接頭辞を割り当てない場合は、委譲ルータがIA_PDでプレフィックスなしでIA_PDとでステータスコードオプションが含まれて要求するルータに広告メッセージを送らなければなりませんステータスコードNoPrefixAvailおよびユーザーのステータスメッセージ、委任ルータのDUIDとサーバ識別子オプションと要求するルータのDUIDとクライアント識別子オプションを含むIA_PD。"
    },
    {
      "indent": 0,
      "text": "12. Requesting router initiated prefix delegation",
      "section_title": true,
      "ja": "12.要求ルータ開始プレフィックス委譲"
    },
    {
      "indent": 3,
      "text": "A requesting router uses the same message exchanges as described in section 18, \"DHCP Client-Initiated Configuration Exchange\" of RFC 3315 to obtain or update prefix(es) from a delegating router. The requesting router and the delegating router use the IA_PD Prefix option to exchange information about prefix(es) in much the same way IA Address options are used for assigned addresses.",
      "ja": "セクション18に記載されるように要求ルータは、同じメッセージ交換を使用して、委任ルータから取得するRFC 3315または更新プレフィックス（ES）の「DHCPクライアントが開始する構成交換」。要求ルータと委譲ルータはIAアドレスオプションが割り当てられたアドレスに使用されているのと同じ方法で接頭語（ES）についての情報を交換するIA_PD Prefixオプションを使用します。"
    },
    {
      "indent": 0,
      "text": "12.1. Requesting router behavior",
      "section_title": true,
      "ja": "12.1. 要求ルータの動作"
    },
    {
      "indent": 3,
      "text": "The requesting router uses a Request message to populate IA_PDs with prefixes. The requesting router includes one or more IA_PD options in the Request message. The delegating router then returns the prefixes for the IA_PDs to the requesting router in IA_PD options in a Reply message.",
      "ja": "要求ルータは接頭辞IA_PDsを移入するために要求メッセージを使用しています。要求ルータは、要求メッセージ内の1つまたは複数のIA_PDオプションが含まれています。委任ルータは、応答メッセージでIA_PDオプションで要求してルータにIA_PDsのための接頭辞を返します。"
    },
    {
      "indent": 3,
      "text": "The requesting router includes IA_PD options in any Renew, or Rebind messages sent by the requesting router. The IA_PD option includes all of the prefixes the requesting router currently has associated with that IA_PD.",
      "ja": "要求ルータは、要求ルータによって送信された更新、または再バインドのメッセージにIA_PDのオプションが含まれています。 IA_PDオプションは要求ルータが現在そのIA_PDに関連付けられたプレフィックスのすべてが含まれています。"
    },
    {
      "indent": 3,
      "text": "In some circumstances the requesting router may need verification that the delegating router still has a valid binding for the requesting router. Examples of times when a requesting router may ask for such verification include:",
      "ja": "いくつかの状況では、要求ルータは、委任するルータは、まだ要求ルータのための有効なバインディングを持っていることを検証する必要があるかもしれません。要求ルータは、このような検証を求めることができる時間の例は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o The requesting router reboots.",
      "ja": "O要求ルータが再起動します。"
    },
    {
      "indent": 3,
      "text": "o The requesting router's upstream link flaps.",
      "ja": "要求ルータの上流のリンクフラップO。"
    },
    {
      "indent": 3,
      "text": "o The requesting router is physically disconnected from a wired connection.",
      "ja": "O要求ルータは、有線接続から物理的に切断されます。"
    },
    {
      "indent": 3,
      "text": "If such verification is needed the requesting router MUST initiate a Rebind/Reply message exchange as described in section 18.1.4, \"Creation and Transmission of Rebind Messages\" of RFC 3315, with the exception that the retransmission parameters should be set as for the Confirm message, described in section 18.1.2, \"Creation and Transmission of Confirm Messages\" of RFC 3315. The requesting router includes any IA_PDs, along with prefixes associated with those IA_PDs in its Rebind message.",
      "ja": "そのような検証は、再送パラメータを確認するために設定されるべきであることを除いて、セクション18.1.4、「創造と再バインドメッセージの送信」RFC 3315の中に記載されるように要求ルータは/再結合を開始するメッセージ交換を返信しなければならない必要な場合セクション18.1.2に記載されたメッセージ、RFC 3315の「確認メッセージの作成及び送信は、」要求ルータは、その再結合メッセージにそれらIA_PDsに関連付けられたプレフィクスと一緒に、任意IA_PDsを含みます。"
    },
    {
      "indent": 3,
      "text": "Each prefix has valid and preferred lifetimes whose durations are specified in the IA_PD Prefix option for that prefix. The requesting router uses Renew and Rebind messages to request the extension of the lifetimes of a delegated prefix.",
      "ja": "各プレフィックスは、その期間そのプレフィックスのIA_PD Prefixオプションで指定されている有効な、好ましい寿命を持っています。要求ルータは、委任プレフィックスの寿命の延長を要求するメッセージを更新し、再バインド使用しています。"
    },
    {
      "indent": 3,
      "text": "The requesting router uses a Release message to return a delegated prefix to a delegating router. The prefixes to be released MUST be included in the IA_PDs.",
      "ja": "要求ルータは、委任するルータに委任プレフィックスを返すためにリリースメッセージを使用しています。発売されるプレフィックスはIA_PDsに含めなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Confirm and Decline message types are not used with Prefix Delegation.",
      "ja": "確認と衰退のメッセージタイプは、プレフィクス委任で使用されていません。"
    },
    {
      "indent": 3,
      "text": "Upon the receipt of a valid Reply message, for each IA_PD the requesting router assigns a subnet from each of the delegated prefixes to each of the links to which the associated interfaces are attached, with the following exception: the requesting router MUST NOT assign any delegated prefixes or subnets from the delegated prefix(es) to the link through which it received the DHCP message from the delegating router.",
      "ja": "有効な応答メッセージを受信すると、各IA_PDを要求ルータは、関連するインターフェイスは以下の例外を除いて、結合しているリンクのそれぞれに委任プレフィックスのそれぞれからサブネットを割り当てる：要求ルータは、任意の委任を割り当ててはいけませんそれが委任するルータからDHCPメッセージを受信して​​リンクへの委任プレフィックス（複数可）からプレフィックスまたはサブネット。"
    },
    {
      "indent": 3,
      "text": "When a requesting router subnets a delegated prefix, it must assign additional bits to the prefix to generate unique, longer prefixes. For example, if the requesting router in Figure 1 were delegated 3FFE:FFFF:0::/48, it might generate 3FFE:FFFF:0:1::/64 and 3FFE:FFFF:0:2::/64 for assignment to the two links in the subscriber network. If the requesting router were delegated 3FFE:FFFF:0::/48 and 3FFE:FFFF:5::/48, it might assign 3FFE:FFFF:0:1::/64 and 3FFE:FFFF:5:1::/64 to one of the links, and 3FFE:FFFF:0:2::/64 and 3FFE:FFFF:5:2::/64 for assignment to the other link.",
      "ja": "要求ルータが委任プレフィックスをサブネットとき、それはユニークな、長いプレフィックスを生成するために、接頭辞に追加のビットを割り当てる必要があります。 FFFF：図1の要求ルータは3FFE委任された場合、例えば、0 :: / 48を、それが3FFEを生成するかもしれない：FFFF：0：1 :: / 64と3FFE：FFFF：0：2 :: / 64の割り当てのために加入者ネットワーク内の2つのリンクへ。要求ルータが委任された場合は3FFE：FFFF：0 :: / 48と3FFE：FFFF：5 :: / 48、それは3FFEを割り当てることができます：FFFF：0：1 :: / 64と3FFE：FFFF：5：1 ::を他のリンクへの割り当てのために2 :: / 64：リンクのいずれかに/ 64、および3FFE：FFFF：0：2 :: / 64と3FFE：FFFF：5。"
    },
    {
      "indent": 3,
      "text": "If the requesting router assigns a delegated prefix to a link to which the router is attached, and begins to send router advertisements for the prefix on the link, the requesting router MUST set the valid lifetime in those advertisements to be no later than the valid lifetime specified in the IA_PD Prefix option. A requesting router MAY use the preferred lifetime specified in the IA_PD Prefix option.",
      "ja": "要求ルータはルータが接続されているリンクへの委任プレフィックスを割り当て、リンク上のプレフィックスのルータ通知を送信するために開始した場合、要求元のルータは、遅くとも有効寿命よりならないように、これらの広告で有効期間を設定しなければなりませんIA_PD Prefixオプションで指定されました。要求ルータはIA_PD Prefixオプションで指定した優先寿命を使用するかもしれません。"
    },
    {
      "indent": 3,
      "text": "Handling of Status Codes options in received Reply messages is described in section 18.1.8, \"Receipt of Reply Messages\" of RFC 3315. The NoPrefixAvail Status Code is handled in the same manner as the NoAddrsAvail Status Code.",
      "ja": "受信した応答メッセージにステータスコードオプションの取り扱いはセクション18.1.8に記載され、RFC 3315の「応答メッセージの受信を」NoPrefixAvailステータスコードはNoAddrsAvailステータスコードと同じ方法で処理されます。"
    },
    {
      "indent": 0,
      "text": "12.2. Delegating Router behavior",
      "section_title": true,
      "ja": "12.2. 委任ルータの動作"
    },
    {
      "indent": 3,
      "text": "When a delegating router receives a Request message from a requesting router that contains an IA_PD option, and the delegating router is authorized to delegate prefix(es) to the requesting router, the delegating router selects the prefix(es) to be delegated to the requesting router. The mechanism through which the delegating router selects prefix(es) for delegation is not specified in this document. Section 11.2 gives examples of ways in which a delegating router might select the prefix(es) to be delegated to a requesting router.",
      "ja": "委任ルータはIA_PDオプションが含まれている要求するルータからの要求メッセージを受信して​​、委任ルータが要求ルータに接頭語（es）を委任することを許可された場合、委任するルータは、要求に委譲されるように接頭語（ES）を選択しますルータ。委任ルータは、委任のための接頭語（ES）を選択するメカニズムはこの文書で指定されていません。 11.2節は、委任ルータは、プレフィックス（複数可）を要求ルータに委任することを選択する可能性のある方法の例を示します。"
    },
    {
      "indent": 3,
      "text": "A delegating router examines the prefix(es) identified in IA_PD Prefix options (in an IA_PD option) in Renew and Rebind messages and responds according to the current status of the prefix(es). The delegating router returns IA_PD Prefix options (within an IA_PD option) with updated lifetimes for each valid prefix in the message from the requesting router. If the delegating router finds that any of the prefixes are not in the requesting router's binding entry, the delegating router returns the prefix to the requesting router with lifetimes of 0.",
      "ja": "委任ルータは、接頭語（ES）の現在の状態に応じて内のメッセージを更新し、再バインド（IA_PDオプションで）IA_PDプレフィックスオプションで識別接頭語（ES）を検査し、応答します。委任ルータは、要求ルータからのメッセージで有効な各プレフィックスの更新寿命を持つ（IA_PDオプション内）IA_PDプレフィックスオプションを返します。委任するルータは、プレフィックスのいずれかを要求するルータのバインディングエントリしていないと認める場合には、委任ルータは0の寿命の要求ルータに接頭辞を返します。"
    },
    {
      "indent": 3,
      "text": "The delegating router behaves as follows when it cannot find a binding for the requesting router's IA_PD:",
      "ja": "それは要求ルータのIA_PDのバインディングを見つけることができないとき、次のように委任ルータは動作します。"
    },
    {
      "indent": 3,
      "text": "Renew message: If the delegating router cannot find a binding for the requesting router's IA_PD the delegating router returns the IA_PD containing no prefixes with a Status Code option set to NoBinding in the Reply message.",
      "ja": "メッセージを更新：委任ルータは委任ルータは、応答メッセージにNoBindingに設定ステータスコードオプションを使用して何の接頭辞を含まないIA_PDを返す要求するルータのIA_PDのバインディング見つけることができない場合。"
    },
    {
      "indent": 3,
      "text": "Rebind message: If the delegating router cannot find a binding for the requesting router's IA_PD and the delegating router determines that the prefixes in the IA_PD are not appropriate for the link to which the requesting router's interface is attached according to the delegating routers explicit configuration, the delegating router MAY send a Reply message to the requesting router containing the IA_PD with the lifetimes of the prefixes in the IA_PD set to zero. This Reply constitutes an explicit notification to the requesting router that the prefixes in the IA_PD are no longer valid. If the delegating router is unable to determine if the prefix is not appropriate for the link, the Rebind message is discarded.",
      "ja": "メッセージを再バインド：委任ルータが要求ルータのIA_PDのために結合し、委任するルータは、IA_PDで接頭辞が要求するルータのインターフェイスを委任するルータ明示的な設定に応じて装着されたリンクのために適切でないと判断した見つけることができない場合ルータを委任することはゼロに設定IA_PDでのプレフィックスの寿命とIA_PDを含む要求ルータに返信メッセージを送信することができます。この返信はIA_PDで接頭辞は、もはや有効で要求ルータへの明示的な通知を構成しています。プレフィックスは、リンクのために適切でない場合は委任ルータは決定できない場合、再バインドメッセージは破棄されます。"
    },
    {
      "indent": 3,
      "text": "A delegating router may mark any prefix(es) in IA_PD Prefix options in a Release message from a requesting router as \"available\", dependent on the mechanism used to acquire the prefix, e.g., in the case of a dynamic pool.",
      "ja": "委任ルータは、「利用可能」として動的プールの場合には、例えば、プレフィックスを取得するために使用されるメカニズムに依存要求ルータからReleaseメッセージにおけるIA_PDプレフィックスオプションの任意の接頭語（es）をマークすることができます。"
    },
    {
      "indent": 3,
      "text": "The delegating router MUST include an IA_PD Prefix option or options (in an IA_PD option) in Reply messages sent to a requesting router.",
      "ja": "委任ルータは、要求元のルータに送信された応答メッセージに（IA_PDオプションで）IA_PD Prefixオプションまたはオプションを含まなければなりません。"
    },
    {
      "indent": 0,
      "text": "13. Prefix Delegation reconfiguration",
      "section_title": true,
      "ja": "13.プレフィックス委任の再構成"
    },
    {
      "indent": 3,
      "text": "This section describes prefix delegation in Reconfigure message exchanges.",
      "ja": "このセクションでは、再設定のメッセージ交換にプレフィックス委任について説明します。"
    },
    {
      "indent": 0,
      "text": "13.1. Delegating Router behavior",
      "section_title": true,
      "ja": "13.1. 委任ルータの動作"
    },
    {
      "indent": 3,
      "text": "The delegating router initiates a configuration message exchange with a requesting router, as described in section 19, \"DHCP Server-Initiated Configuration Exchange\" of RFC 3315, by sending a Reconfigure message (acting as a DHCP server) to the requesting router, as described in section 19.1, \"Server Behavior\" of RFC 3315. The delegating router specifies the IA_PD option in the Option Request option to cause the requesting router to include an IA_PD option to obtain new information about delegated prefix(es).",
      "ja": "セクション19で説明したように委譲ルータが説明するように、要求元のルータに（DHCPサーバとして機能する）再設定メッセージを送信することにより、RFC 3315の「DHCPサーバ起動の設定交流」、要求元のルータとコンフィギュレーションメッセージの交換を開始しますセクション19.1で、RFC 3315委任ルータの「サーバの動作は、」委任プレフィックス（複数可）に関する新しい情報を入手するIA_PDオプションを含めるように要求するルータを引き起こすオプション要求オプションでIA_PDオプションを指定します。"
    },
    {
      "indent": 0,
      "text": "13.2. Requesting Router behavior",
      "section_title": true,
      "ja": "13.2. 要求ルータの動作"
    },
    {
      "indent": 3,
      "text": "The requesting router responds to a Reconfigure message, acting as a DHCP client, received from a delegating router as described in section 19.4, \"Client Behavior\" of RFC 3315. The requesting router MUST include the IA_PD Prefix option(s) (in an IA_PD option) for prefix(es) that have been delegated to the requesting router by the delegating router from which the Reconfigure message was received.",
      "ja": "セクション19.4で説明したように要求して、ルータがDHCPクライアントとして機能し、再設定メッセージに応答し、委任するルータから受信し、RFC 3315の「クライアントの動作」IA_PDでIA_PD Prefixオプション（複数可）（含まなければならない要求ルータ再設定メッセージを受信した委譲ルータによって要求ルータに委任されている接頭語（ES）用オプション）。"
    },
    {
      "indent": 0,
      "text": "14. Relay agent behavior",
      "section_title": true,
      "ja": "14.リレーエージェントの動作"
    },
    {
      "indent": 3,
      "text": "A relay agent forwards messages containing Prefix Delegation options in the same way as described in section 20, \"Relay Agent Behavior\" of RFC 3315.",
      "ja": "リレーエージェントは、セクション20、RFC 3315の「リレーエージェントの動作」で説明したのと同じ方法で、プレフィックス委任オプションを含むメッセージを転送します。"
    },
    {
      "indent": 3,
      "text": "If a delegating router communicates with a requesting router through a relay agent, the delegating router may need a protocol or other out-of-band communication to add routing information for delegated prefixes into the provider edge router.",
      "ja": "委任ルータは、リレーエージェントを介して要求元のルータと通信する場合、委任ルータは、プロバイダエッジルータに委任プレフィックスのためのルーティング情報を追加するプロトコルまたは他の帯域外通信を必要とするかもしれません。"
    },
    {
      "indent": 0,
      "text": "15. Security Considerations",
      "section_title": true,
      "ja": "15.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Security considerations in DHCP are described in section 23, \"Security Considerations\" of RFC 3315.",
      "ja": "DHCPのセキュリティ上の考慮事項は、セクション23、RFC 3315の「セキュリティの考慮事項」で説明されています。"
    },
    {
      "indent": 3,
      "text": "A rogue delegating router can issue bogus prefixes to a requesting router. This may cause denial of service due to unreachability.",
      "ja": "不正な委譲ルータが要求ルータににせの接頭辞を発行することができます。これは、到達不能にサービス拒否を引き起こす可能性があります。"
    },
    {
      "indent": 3,
      "text": "A malicious requesting router may be able to mount a denial of service attack by repeated requests for delegated prefixes that exhaust the delegating router's available prefixes.",
      "ja": "悪質な要求ルータは、委任ルータの利用可能プレフィックスを使い果たし委任プレフィックスを繰り返し要求することにより、サービス拒否攻撃をマウントすることができるかもしれません。"
    },
    {
      "indent": 3,
      "text": "To guard against attacks through prefix delegation, requesting routers and delegating routers SHOULD use DHCP authentication as described in section 21, \"Authentication of DHCP messages\" of RFC 3315. For point to point links, where one trusts that there is no man in the middle, or one trusts layer two authentication, DHCP authentication or IPsec may not be necessary. Because a requesting router and delegating routers must each have at least one assigned IPv6 address, the routers may be able to use IPsec for authentication of DHCPv6 messages. The details of using IPsec for DHCPv6 are under development.",
      "ja": "、プレフィックス委譲による攻撃から保護ルータを要求し、セクション21で説明したように委任するルータは1つがだれが真ん中に存在しないことを信頼したリンクを、ポイントツーポイントの場合は、RFC 3315の「DHCPメッセージの認証を」DHCP認証を使用すべきか、または1つの信頼レイヤ2つの認証、DHCP認証またはIPsecは必要ではないかもしれません。ルータを要求し、委任ルータは、それぞれが、少なくとも1つの割り当てられたIPv6アドレスを持っていなければならないので、ルーターはDHCPv6のメッセージを認証するためにIPsecを使用することができます。 DHCPv6のためにIPsecを使用しての詳細については、開発中です。"
    },
    {
      "indent": 3,
      "text": "Networks configured with delegated prefixes should be configured to preclude intentional or inadvertent inappropriate advertisement of these prefixes.",
      "ja": "委任プレフィックスで構成されたネットワークは、これらのプレフィックスの故意または不注意による不適切な広告を排除するように設定する必要があります。"
    },
    {
      "indent": 0,
      "text": "16. IANA Considerations",
      "section_title": true,
      "ja": "16. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned option codes to:",
      "ja": "IANAは、にオプションコードを割り当てています："
    },
    {
      "indent": 3,
      "text": "OPTION_IA_PD (25)",
      "ja": "OPTION_IA_PD（25）"
    },
    {
      "indent": 3,
      "text": "OPTION_IAPREFIX (26)",
      "ja": "OPTION_IAPREFIX（26）"
    },
    {
      "indent": 3,
      "text": "from the option-code space as defined in section 24.3, \"DHCP Options\" of RFC 3315.",
      "ja": "オプションコード空間からRFC 3315のセクション24.3、「DHCPオプション」で定義されています。"
    },
    {
      "indent": 3,
      "text": "IANA has assigned status code 6 to:",
      "ja": "IANAは、ステータスコード6を割り当てています："
    },
    {
      "indent": 3,
      "text": "NoPrefixAvail: Delegating router has no prefixes available to assign to the IAPD(s)",
      "ja": "NoPrefixAvail：委任ルータは、IAPD（複数可）に割り当てるために利用可能なプレフィックスを持っていません"
    },
    {
      "indent": 3,
      "text": "from the status-code space as defined in section 24.4, \"Status Codes\" of RFC 3315.",
      "ja": "ステータス・コード空間からのセクション24.4で定義され、RFC 3315の「ステータスコード」。"
    },
    {
      "indent": 0,
      "text": "17. Intellectual Property Statement",
      "section_title": true,
      "ja": "17.知的財産権に関する声明"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、そのような権限下で、ライセンスがたりないかもしれない可能性があるためにどの本書または程度に記載されている技術の実装や使用に関係すると主張される可能性があります任意の知的財産やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能。また、そうした権利を特定するために取り組んできたことを表していないん。スタンダードトラックおよび標準関連文書における権利に関するIETFの手続きの情報は、BCP-11に記載されています。権利の主張のコピーは、出版のために利用可能とライセンスの保証が利用できるようにする、または本仕様の実装者または利用者が、そのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、その注意にこの標準を実践するために必要な場合があり技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 IETF専務に情​​報を扱ってください。"
    },
    {
      "indent": 0,
      "text": "18. References",
      "section_title": true,
      "ja": "18.参考文献"
    },
    {
      "indent": 0,
      "text": "18.1. Normative References",
      "section_title": true,
      "ja": "18.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[1]デアリング、S.とR. Hindenと \"インターネットプロトコル、バージョン6（IPv6）の仕様\"、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[2] Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C. and M. Carney, \"Dynamic Host Configuration Protocol for IPv6 (DHCPv6)\", RFC 3315, July 2003.",
      "ja": "[2] Droms、R.、バウンド、J.、フォルツ、B.、レモン、T.、パーキンス、C.及びM.カーニー、 \"IPv6のための動的ホスト構成プロトコル（DHCPv6）\"、RFC 3315、2003年7月。"
    },
    {
      "indent": 3,
      "text": "[3] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[3]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[4] Narten, T., Nordmark, E. and W. Simpson, \"Neighbor Discovery for IP Version 6 (IPv6)\", RFC 2461, December 1998.",
      "ja": "[4] Narten氏、T.、Nordmarkと、E.およびW.シンプソン、 \"IPバージョン6のための近隣探索（IPv6）の\"、RFC 2461、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[5] Aboba, B., Zorn, G. and D. Mitton, \"RADIUS and IPv6\", RFC 3162, August 2001.",
      "ja": "[5] Aboba、B.、ゾルン、G.およびD.ミットン、 \"RADIUSとIPv6\"、RFC 3162、2001年8月。"
    },
    {
      "indent": 0,
      "text": "18.2. Informative References",
      "section_title": true,
      "ja": "18.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[6] Miyakawa, S. and R. Droms, \"Requirements for IPv6 prefix delegation\", Work in Progress, August 2003.",
      "ja": "[6]宮川、S.とR. Dromsは、 \"IPv6プレフィックス委任のための要件\"、進歩、2003年8月に作業します。"
    },
    {
      "indent": 0,
      "text": "19. Acknowledgements",
      "section_title": true,
      "ja": "19.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks for the input and review by (in alphabetical order) Steve Deering, Dave Forster, Brian Haberman, Tatuya Jinmei, Shin Miyakawa, Pekka Savola, Bernie Volz, Trevor Warwick and Toshi Yamasaki.",
      "ja": "スティーブデアリング、デイブ・フォースター、ブライアンハーバーマン、達也神明、宮川晋、ペッカSavola、バーニーフォルツ、トレバー・ワーウィックとトシ山崎（アルファベット順）で入力し、レビューしてくれてありがとう。"
    },
    {
      "indent": 0,
      "text": "20. Authors' Addresses",
      "section_title": true,
      "ja": "20.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ole Troan Cisco Systems 250 Longwater Avenue Reading RG2 6GB United Kingdom",
      "ja": "オレTroanシスコシステムズ250 Longwaterアベニュー読書RG2 6ギガバイトイギリス"
    },
    {
      "indent": 3,
      "text": "Phone: +44 20 8824 8666 EMail: ot@cisco.com",
      "ja": "電話：+44 20 8824 8666 Eメール：ot@cisco.com"
    },
    {
      "indent": 3,
      "text": "Ralph Droms Cisco Systems 1414 Massachusetts Avenue Boxborough, MA 01719 USA",
      "ja": "ラルフDromsシスコシステムズ1414年マサチューセッツアベニューボックスボロー、MA 01719 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 978 936 1674 EMail: rdroms@cisco.com",
      "ja": "電話：+1 978 936 1674 Eメール：rdroms@cisco.com"
    },
    {
      "indent": 0,
      "text": "21. Full Copyright Statement",
      "section_title": true,
      "ja": "21.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の制限は永続的なものであり、インターネットソサエティもしくはその継承者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}