{
  "title": {
    "text": "RFC 3134 - Terminology for ATM ABR Benchmarking",
    "ja": "RFC 3134 - ATM ABRベンチマークのための用語"
  },
  "number": 3134,
  "created_at": "2019-10-24 05:02:12.428861+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            J. Dunn\nRequest for Comments: 3134                                     C. Martin\nCategory: Informational                                        ANC, Inc.\n                                                               June 2001",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Terminology for ATM ABR Benchmarking",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo discusses and defines terms associated with performance benchmarking tests and the results of these tests in the context of Asynchronous Transfer Mode (ATM) based switching devices supporting ABR (Available Bit Rate). The terms defined in this memo will be used in addition to terms defined in RFCs 1242, 2285, and 2544 and 2761. This memo is a product of the Benchmarking Methodology Working Group (BMWG) of the Internet Engineering Task Force (IETF).",
      "ja": "このメモは、説明し、性能ベンチマークテスト、ABR（使用可能ビットレート）をサポートするスイッチング素子基づく非同期転送モード（ATM）の文脈におけるこれらの試験の結果に関連した用語を定義します。このメモで定義された用語のRFC 1242、2285年に定義された用語に加えて使用され、2544年と2761.このメモはインターネットエンジニアリングタスクフォース（IETF）のベンチマーク手法ワーキンググループ（BMWG）の製品です。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document provides terminology for benchmarking ATM based switching devices supporting ABR. It extends terminology already defined for benchmarking network interconnect devices in RFC's 1242, 2285, and 2544 and 2761. Although some of the definitions in this memo may be applicable to a broader group of network interconnect devices, the primary focus of the terminology in this memo is on ATM ABR.",
      "ja": "この文書では、ABRをサポートするATMベースのスイッチングデバイスのベンチマークのための専門用語を提供します。このメモで定義の一部は、ネットワーク相互接続装置のより広範なグループに適用することができるが、このメモにおける用語の主要な焦点、既にRFCの1242におけるベンチマークネットワーク相互接続装置に対して定義された用語、2285、及び2544と2761.を拡張しますATM ABRです。"
    },
    {
      "indent": 3,
      "text": "This memo contains two major sections: Background and Definitions. The background section provides the reader with an overview of the technology and IETF formalisms. The definitions section is split into two sub-sections. The formal definitions sub-section is provided as a courtesy to the reader. The measurement definitions sub-section contains performance metrics with inherent units.",
      "ja": "背景と定義：このメモは、2つの主要なセクションが含まれています。背景のセクションでは技術やIETF形式主義の概要を読者に提供します。定義セクションは、2つのサブセクションに分割されます。正式な定義は、サブセクションは、読者へのサービスの一環として提供されます。測定定義のサブセクションでは、固有のユニットのパフォーマンス・メトリックを含んでいます。"
    },
    {
      "indent": 3,
      "text": "This document assumes that necessary services are available and active. For example, IP connectivity requires SSCOP connectivity between signaling entities. Further, it is assumed that the SUT has the ability to configure ATM addresses (via hard coded addresses, ILMI or PNNI neighbor discovery), has the ability to run SSCOP, and has the ability to perform signaled call setups (via UNI or PNNI signaling). Finally, this document presents only the terminology associated with benchmarking IP performance over ATM; therefore, it does not represent a total compilation of ATM test terminology.",
      "ja": "この文書では、必要なサービスが利用でき、アクティブであることを前提としています。例えば、IP接続は、シグナリングエンティティ間のSSCOP接続が必要です。さらに、SUTは（ハードコード化されたアドレスを介して、ILMIまたはPNNIネイバー発見）のATMアドレスを設定する機能を有していることが想定される、SSCOPを実行する能力を有し、UNIまたはPNNIシグナリングを介してシグナリングコールセットアップを（実行する能力を有します）。最後に、この文書では、ATM上のベンチマークIPのパフォーマンスに関連した唯一の用語を提示します。したがって、それはATMテストの用語の総まとめを表すものではありません。"
    },
    {
      "indent": 3,
      "text": "The BMWG produces two major classes of documents: Benchmarking Terminology documents and Benchmarking Methodology documents. The Terminology documents present the benchmarks and other related terms. The Methodology documents define the procedures required to collect the benchmarks cited in the corresponding Terminology documents.",
      "ja": "ベンチマーク用語の文書やベンチマーキング方法論の文書：BMWGは、文書の2つの主要なクラスを生成します。用語の文書は、ベンチマークやその他の関連する用語を提示します。方法論の文書は、対応する用語の文書に引用ベンチマークを収集するために必要な手順を定義します。"
    },
    {
      "indent": 0,
      "text": "2. Existing Definitions.",
      "section_title": true,
      "ja": "2.既存の定義。"
    },
    {
      "indent": 3,
      "text": "RFC 1242, \"Benchmarking Terminology for Network Interconnect Devices\", should be consulted before attempting to make use of this document. RFC 2544, \"Benchmarking Methodology for Network Interconnect Devices\", contains discussions of a number of terms relevant to the benchmarking of switching devices and should be consulted. RFC 2285, \"Benchmarking Terminology for LAN Switching Devices\", contains a number of terms pertaining to traffic distributions and datagram interarrival. RFC 2761, \"Terminology for ATM Benchmarking\", contains a number terms pertaining to traffic management [TM4.0, TM4.1]. Many of the metrics defined in RFC 2761 (e.g., CDV, CER, CLR, CMR, and CTD) also apply to ABR performance benchmarking. These metrics will not be redefined in this document. For the sake of clarity and continuity, this RFC adopts the template for definitions set out in Section 2 of RFC 1242.",
      "ja": "RFC 1242は、「ネットワークの相互接続デバイスのためのベンチマーキング用語」、この文書を使用するように試みる前に相談する必要があります。 RFC 2544には、「ネットワークの相互接続デバイスのためのベンチマーキング方法論」は、スイッチング素子のベンチマーキングに関連する用語の数の議論が含まれており、相談する必要があります。 RFC 2285には、「LANスイッチングデバイスのためのベンチマーキング用語」、トラフィック分布やデータグラムのinterarrivalに関連する用語の数が含まれています。 RFC 2761、「ATMベンチマーキングのための用語」、[TM4.0、TM4.1]トラフィック管理に関連する数の用語が含まれています。 （例えば、CDV、CER、CLR、CMR、およびCTD）RFC 2761で定義されたメトリックの多くは、ABRの性能ベンチマークに適用されます。これらのメトリックは、このドキュメントで再定義されることはありません。明快さと継続性のために、このRFCは、RFC 1242のセクション2に定めた定義のテンプレートを採用しています。"
    },
    {
      "indent": 0,
      "text": "II. Definitions",
      "ja": "II。定義"
    },
    {
      "indent": 3,
      "text": "The definitions presented in this section have been divided into two groups. The first group is formal definitions, which are required in the definitions of the performance metrics but are not themselves strictly metrics. These definitions are subsumed from other work done in other working groups both inside and outside the IETF. They are provided as a courtesy to the reader.",
      "ja": "このセクションに示された定義は、2つのグループに分けられています。最初のグループは、パフォーマンス・メトリックの定義に必要な厳密メトリクスそのものではありませんされている正式な定義は、あります。これらの定義は、IETFの内側と外側の両方の他のワーキンググループで行われ、他の仕事から包含されています。彼らは、読者への礼儀として提供されています。"
    },
    {
      "indent": 0,
      "text": "1. Formal Definitions",
      "section_title": true,
      "ja": "1.正式な定義"
    },
    {
      "indent": 0,
      "text": "1.1. Definition Format (from )",
      "section_title": true,
      "ja": "1.1。定義フォーマット（から）"
    },
    {
      "indent": 3,
      "text": "Term to be defined.",
      "ja": "用語を定義します。"
    },
    {
      "indent": 3,
      "text": "Definition: The specific definition for the term.",
      "ja": "定義：用語のための具体的な定義。"
    },
    {
      "indent": 3,
      "text": "Discussion: A brief discussion of the term, its application and any restrictions on measurement procedures.",
      "ja": "ディスカッション：用語、そのアプリケーションおよび測定手順に制限の簡単な説明。"
    },
    {
      "indent": 3,
      "text": "Specification: The working group and document in which the terms are specified and are listed in the references section.",
      "ja": "仕様：用語が指定されており、参考文献のセクションにリストされているワーキンググループとドキュメント。"
    },
    {
      "indent": 0,
      "text": "1.2. Related Definitions.",
      "section_title": true,
      "ja": "1.2。関連定義。"
    },
    {
      "indent": 0,
      "text": "1.2.1. Allowed Cell Rate (ACR)",
      "section_title": true,
      "ja": "1.2.1。許可セルレート（ACR）"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter, ACR is the current rate (cells/second) at which a source is allowed to send.",
      "ja": "定義：ABRサービスパラメータ、ACRは、ソースが送信することを許可された現在のレート（細胞/秒）です。"
    },
    {
      "indent": 3,
      "text": "Discussion: For ABR traffic, ACR constitutes the actual data throughput for a particular VC. The time change of this value effects TCP round trip time calculations, which in turn effects TCP throughput.",
      "ja": "議論は：ABRトラフィックの場合、ACRは、特定のVCのための実際のデータ・スループットを構成しています。この値の効果のTCPのラウンドトリップ時間の計算の時間変化、ターン効果におけるTCPスループット。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.2. ACR Decrease Time Factor (ADTF)",
      "section_title": true,
      "ja": "1.2.2。 ACR時間ファクタ（ADTF）を下げます"
    },
    {
      "indent": 3,
      "text": "Definition: This is the time permitted between sending RM-cells before the rate is decreased to ICR (Initial Cell Rate). The time units are .01 to 10.23 seconds with a granularity of 10 ms.",
      "ja": "定義：このレートはICR（初期セル・レート）に減少する前にRM-セルの送信間で許可時間です。時間単位は10ミリ秒の粒度で0.01 10.23秒です。"
    },
    {
      "indent": 3,
      "text": "Discussion: For ABR traffic, ADTF constitutes the time rate of the ACR. This value effects TCP round trip time calculations, which in turn effects TCP throughput.",
      "ja": "考察：ABRトラフィックの場合、ADTFはACRの時間速度を構成しています。この値は、効果ターンで効果のTCPスループットTCPのラウンドトリップ時間の計算を、。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.3. Additive Increase Rate (AIR)",
      "section_title": true,
      "ja": "1.2.3。添加剤増加率（AIR）"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter, AIR controls the rate at which the cell transmission rate increases. It is signaled as AIRF, where",
      "ja": "定義：ABRサービスパラメータ、AIRは、セル伝送レートが増加速度を制御します。それはAIRF、と知らされます"
    },
    {
      "indent": 7,
      "text": "AIRF = AIR*Nrm/PCR.",
      "ja": "* NRM / PCR ON AIRF =。"
    },
    {
      "indent": 3,
      "text": "Discussion: For ABR traffic, AIR effects the time rate of change of the ACR. This value effects TCP round trip time calculations, which in turn effects TCP throughput.",
      "ja": "考察：ABRトラフィックの場合、AIRは、ACRの時間変化率に影響を与えます。この値は、効果ターンで効果のTCPスループットTCPのラウンドトリップ時間の計算を、。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.4. Additive Increase Rate Factor (AIRF)",
      "section_title": true,
      "ja": "1.2.4。添加剤増加率因子（AIRF）"
    },
    {
      "indent": 3,
      "text": "Definition: Refer to AIR.",
      "ja": "定義：AIRを参照してください。"
    },
    {
      "indent": 3,
      "text": "Discussion: Refer to AIR.",
      "ja": "ディスカッション：AIRを参照してください。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.5. Available Bit Rate (ABR)",
      "section_title": true,
      "ja": "1.2.5。使用可能ビットレート（ABR）"
    },
    {
      "indent": 3,
      "text": "Definition: ABR is an ATM layer service category for which the limiting ATM layer transfer characteristics provided by the network may change subsequent to connection establishment. A flow control mechanism is specified which supports several types of feedback to control the source rate in response to changing ATM layer transfer characteristics.",
      "ja": "定義：ABRは、ネットワークによって提供される限定的なATMレイヤ伝達特性は、接続確立後に変更することができるためにATMレイヤサービスカテゴリです。流量制御機構は、ATMレイヤ伝達特性の変化に応じてソースレートを制御するためのフィードバックのいくつかのタイプをサポートする指定されました。"
    },
    {
      "indent": 3,
      "text": "Discussion: It is expected that an end-system that adapts its traffic in accordance with the feedback will experience a low cell loss ratio and obtain a fair share of the available bandwidth according to a network specific allocation policy. Cell delay variation is not controlled in this service, although admitted cells are not delayed unnecessarily.",
      "ja": "ディスカッション：フィードバックに基づいてそのトラフィックを適応させ、エンドシステムが低セル損失率を経験し、ネットワークの特定の割り当てポリシーに応じて利用可能な帯域幅の公正なシェアを獲得することが期待されます。入院細胞を不必要に遅延していないが、セル遅延変動は、このサービスでは制御されません。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.6. Available Bit Rate (ABR) Compliance (Conformance)",
      "section_title": true,
      "ja": "1.2.6。使用可能ビットレート（ABR）コンプライアンス（準拠）"
    },
    {
      "indent": 3,
      "text": "Definition: ABR connection conformance refers to the behavior specified for ABR destination and switches, but allows for delays between the source and the UNI [UNI3.1, UNI4.0], which may perturb the traffic flow.",
      "ja": "定義：ABR接続適合はABR宛先スイッチに指定された動作を意味するが、交通の流れを乱すことができるソースとUNI [UNI3.1、UNI4.0]、の間の遅延を可能にします。"
    },
    {
      "indent": 3,
      "text": "Discussion: The cells on an ABR connection applies to CLP=0 cells, which are tested upon arrival. At the arrival point, each cell is identified as conforming or non-conforming. The minimal conformance definition for ABR is GCRA((1/PCR),t1), where PCR is defined for CLP=0 flow.",
      "ja": "ディスカッション：ABR接続上の細胞は、到着時にテストされるCLP = 0のセルに適用されます。到着時点で、各セルは適合又は不適合として識別されます。 ABRの最小適合性定義は、PCRは、CLP = 0の流れのために定義されるGCRA（（1 / PCR）、T1）です。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.7. BN",
      "section_title": true,
      "ja": "1.o.h.ベン"
    },
    {
      "indent": 3,
      "text": "Definition: The BN bit in the RM-cell indicated whether the RM-cell is a BECN cell or not.",
      "ja": "定義：RM-細胞におけるBNビットはRMセルはBECNセルであるか否かを示します。"
    },
    {
      "indent": 3,
      "text": "Discussion: If BN=0, the RM cells were generated by the source. If BN=1, the RM cells were generated by the destination or a switch.",
      "ja": "議論：BN = 0の場合、RMセルがソースによって生成されました。 BN = 1の場合、RMセルが宛先またはスイッチによって生成されました。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.8. CCR",
      "section_title": true,
      "ja": "1.2.8。 CCR"
    },
    {
      "indent": 3,
      "text": "Definition: The CCR field in the RM-cell is set by the source to its current ACR. CCR is formatted as a rate.",
      "ja": "定義：RMセル内のCCRフィールドは、現在のACRにソースによって設定されています。 CCRは、レートとしてフォーマットされます。"
    },
    {
      "indent": 3,
      "text": "Discussion: For BECN cells, CCR=0.",
      "ja": "ディスカッション：BECN細胞については、CCR = 0。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.9. Cell Blocks (CB)",
      "section_title": true,
      "ja": "1.2.9。セルブロック（CB）"
    },
    {
      "indent": 3,
      "text": "Definition: Cell blocks are a sequence of N cells transmitted consecutively on a given connection.",
      "ja": "定義：セルブロックは、指定された接続上で連続的に送信されたN個のセルの配列です。"
    },
    {
      "indent": 3,
      "text": "Discussion: A cell block will normally correspond to the number of information cells transmitted between successive OAM cells.",
      "ja": "ディスカッション：セルブロックは、通常、連続したOAMセルとの間で伝送される情報セルの数に対応するであろう。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.10. Congestion Indication (CI)",
      "section_title": true,
      "ja": "1.2.10。輻輳表示（CI）"
    },
    {
      "indent": 3,
      "text": "Definition: The CI bit in the RM-cell allows a network element to indicate that there is congestion in the network.",
      "ja": "定義：RM-細胞におけるCIビットがネットワーク要素がネットワーク内に輻輳が存在することを示すことを可能にします。"
    },
    {
      "indent": 3,
      "text": "Discussion: When the source receives a backward RM-cell with CI=1, ACR is decreased. When the destination turns around a forward RM-cell, the CI is set to 1 to indicate that the previously received data cell had the EFCI state set.",
      "ja": "議論：ソースは、CI = 1と逆方向RMセルを受信すると、ACRが減少します。宛先が前方RMセルの周りに回転するとき、CIは、以前に受信されたデータセルは、EFCI状態セットを持っていたことを示すために1に設定されています。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.11. Cutoff Decrease Factor (CDF)",
      "section_title": true,
      "ja": "1.2.11。カットオフ低減ファクタ（CDF）"
    },
    {
      "indent": 3,
      "text": "Definition: CDF controls the decrease in ACR (Allowed Cell Rate) associated with CRM (missing RM cell count).",
      "ja": "定義：CDFは、CRM（行方不明RMセル数）に関連したACRの減少（許可セル速度）を制御します。"
    },
    {
      "indent": 3,
      "text": "Discussion: For ABR traffic, CDF effects the time rate of change of the ACR. This value effects TCP round trip time calculations, which in turn effects TCP throughput.",
      "ja": "考察：ABRトラフィックの場合、CDFは、ACRの時間変化率に影響を与えます。この値は、効果ターンで効果のTCPスループットTCPのラウンドトリップ時間の計算を、。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.12. DIR",
      "section_title": true,
      "ja": "1.2.12。 DIR"
    },
    {
      "indent": 3,
      "text": "Definition: The DIR bit in the RM-cell indicates which direction of data flow is associated with the RM-cell. DIR is changed from 0 to 1 when an RM-cell is turned around at the destination.",
      "ja": "定義：RM-細胞におけるDIRビットは、データ・フローの方向をRMセルに関連付けられているかを示します。 RMセルが先に周りになっている場合DIRが0から1に変更されます。"
    },
    {
      "indent": 3,
      "text": "Discussion: A forward RM-cell is indicated by DIR=0 and is associated with data cells flowing in the same direction. A backward RM-cell is indicated by DIR=1 and is associated with data cells flowing in the opposite direction.",
      "ja": "議論：フォワードRMセルがDIR = 0で示され、同じ方向に流れるデータセルに関連付けられています。逆方向RMセルは、DIR = 1で示され、反対方向に流れるデータセルに関連付けられています。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.13. Explicit Rate (ER)",
      "section_title": true,
      "ja": "1.2.13。明示レート（ER）"
    },
    {
      "indent": 3,
      "text": "Definition: The ER field in the RM-cell is used to limit the source ACR to a specific value. For each RM-cell, ER is set by the source to a requested rate (e.g., PCR). It may be reduced by any network element in the path to a value that the element can sustain. ER is formatted as a rate.",
      "ja": "定義：RM-細胞におけるERフィールドが特定の値にソースACRを制限するために使用されます。各RMセルのために、ERは、要求された速度（例えば、PCR）のソースによって設定されています。これは、要素が耐えることができる値へのパス内の任意のネットワーク要素によって減少させることができます。 ERは、レートとしてフォーマットされます。"
    },
    {
      "indent": 3,
      "text": "Discussion: None.",
      "ja": "ディスカッション：なし。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.14. Feedback",
      "section_title": true,
      "ja": "1.2.14。フィードバック"
    },
    {
      "indent": 3,
      "text": "Definition: Information carried in the backward RM-cells provided by the network elements and/or the destination back to the source.",
      "ja": "定義：ネットワーク要素及び/又はバックソースに宛先によって提供される逆方向RM細胞に運ばれる情報。"
    },
    {
      "indent": 3,
      "text": "Discussion: Feedback may include information in the ER field, or the CI or NI bits of each backward RM-cell.",
      "ja": "議論：フィードバックERフィールドの情報、又は各逆方向RMセルのCIまたはNIビットを含むことができます。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.15. Ideal Transmission Time (ITT)",
      "section_title": true,
      "ja": "1.2.15。理想的な送信時間（ITT）"
    },
    {
      "indent": 3,
      "text": "Definition: The transmission time for ABR CLP=0 cells, if the difference between itself and the transmission time for the previous CLP=0 cell on the connection is greater than or equal to the minimum: a) the inverse of the ACR in effect immediately after the transmission time of the first of the two cells b) the inverse of the ACR in effect immediately before the transmission time of the second of the two cells.",
      "ja": "定義：ABRのCLP = 0のセルのための送信時間、自身と接続に関する以前のCLP = 0のセルのための送信時間との差が最小値以上である場合は、a）有効なACRの逆直ちに効果におけるACRのB）逆直ちに2つのセルの第二の送信時間前に2つのセルの最初の伝送時間後。"
    },
    {
      "indent": 3,
      "text": "Discussion: The transmission time for the first cell on the connection is automatically an ITT.",
      "ja": "議論：接続上の最初のセルのための送信時間を自動的ITTあります。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.16. Initial Cell Rate (ICR)",
      "section_title": true,
      "ja": "1.2.16。初期セル・レート（ICR）"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter, in cells/sec, that is the rate at which a source should send initially and after an idle period.",
      "ja": "定義：ABRサービスパラメータは、セル/秒で、それは元が最初とアイドル期間後に送信しなければならない速度です。"
    },
    {
      "indent": 3,
      "text": "Discussion: none.",
      "ja": "ディスカッション：なし。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.17. In-Rate Cells",
      "section_title": true,
      "ja": "1.2.17。インレートセル"
    },
    {
      "indent": 3,
      "text": "Definition: In-Rate ABR cells are sent with CLP=0.",
      "ja": "定義：インレートABRセルがCLP = 0で送信されます。"
    },
    {
      "indent": 3,
      "text": "Discussion: ABR RM-cells shall be sent with CLP=0 except in certain circumstances, See Out-of-Rate Cells. All other ABR cells shall be sent with CLP=0.",
      "ja": "ディスカッション：ABR RM-細胞は、アウトオブレートセルを参照してください、特定の状況を除き、CLP = 0で送信されなければなりません。他のすべてのABRセルはCLP = 0で送信されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.18. Minimum Cell Rate (MCR)",
      "section_title": true,
      "ja": "1.2.18。最小セル・レート（MCR）"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service traffic descriptor, in cells/sec, that is the rate at which the source is always allowed to send.",
      "ja": "定義：ABRサービストラフィック記述子、セル/秒で、それはソースが常時送信可能なレートです。"
    },
    {
      "indent": 3,
      "text": "Discussion: MCR may be set to zero. The bandwidth available from the network may vary, but shall not become less than MCR.",
      "ja": "ディスカッション：MCRはゼロに設定することができます。ネットワークから利用可能な帯域幅は変更される場合がありますが、MCRより小さくなってはなりません。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.19. Mrm",
      "section_title": true,
      "ja": "1.2.19。 MRM"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter that controls allocation of bandwidth between forward W-cells, backward RM-cells, and data cells.",
      "ja": "定義：前方W-細胞、後方RM-セル、およびデータセル間の帯域幅の割り当てを制御ABRサービスパラメータ。"
    },
    {
      "indent": 3,
      "text": "Discussion: none.",
      "ja": "ディスカッション：なし。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.20. No Increase (NI)",
      "section_title": true,
      "ja": "１。２。２０。 の いんｃれあせ （に）"
    },
    {
      "indent": 3,
      "text": "Definition: The NI bit in the RM-cell is used to prevent a source from increasing its ACR. NI does not require any decrease in value.",
      "ja": "定義：RM-細胞におけるNIビットは、そのACRを増加させるからソースを防止するために使用されます。 NIは、価値の減少を必要としません。"
    },
    {
      "indent": 3,
      "text": "Discussion: None.",
      "ja": "ディスカッション：なし。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.21. Nrm",
      "section_title": true,
      "ja": "2.1.21。 NRM"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter, Nrm is the maximum number of cells a source may send for each forward RM-cell.",
      "ja": "定義：ABRサービスパラメータ、NRMがソースが各順方向RMセルのために送信することができるセルの最大数です。"
    },
    {
      "indent": 3,
      "text": "Discussion: none.",
      "ja": "ディスカッション：なし。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.22. Out-of-Rate Cells",
      "section_title": true,
      "ja": "1.2.22。細胞アウトのレート"
    },
    {
      "indent": 3,
      "text": "Definition: Out-of-Rate ABR cells are sent with CLP=1.",
      "ja": "定義：アウト・オブ・レートABRセルはCLP = 1で送信されます。"
    },
    {
      "indent": 3,
      "text": "Discussion: This may be used to enable a rate increase for a connection that has an ACR=0. The source would generate out-of-rate cells to probe the network to learn when it may increase its rate.",
      "ja": "議論は：これは、ACR = 0を有する接続用の速度の増加を可能にするために使用されてもよいです。ソースは、その速度を増加させることができる時に学習したネットワークをプローブするアウトオブ率細胞生成することになります。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.23. Rate Decrease Factor (RDF)",
      "section_title": true,
      "ja": "1.2.23。レート低減ファクタ（RDF）"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter, RDF controls the decrease in the cell transmission rate. RDF is a power of 2 from 1/32,768 to 1.",
      "ja": "定義：ABRサービスパラメータは、RDFは、セル伝送速度の低下を制御します。 RDFは、1〜1 / 32,768から2のべき乗です。"
    },
    {
      "indent": 3,
      "text": "Discussion: For ABR traffic, RDF effects the time rate of change of the ACR. This value effects TCP round trip time calculations, which in turn effects TCP throughput.",
      "ja": "考察：ABRトラフィックの場合、RDFはACRの時間変化率に影響を与えます。この値は、効果ターンで効果のTCPスループットTCPのラウンドトリップ時間の計算を、。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.24. Rate Increase Factor (RIF)",
      "section_title": true,
      "ja": "1.2.24。レート増加ファクタ（RIF）"
    },
    {
      "indent": 3,
      "text": "Definition: This controls the amount by which the cell transmission rate may increase upon receipt of a RM-cell. The additive increase rate AIR=PCR*RIF. RIF is a power of 2, ranging from 1/32,768 to 1.",
      "ja": "定義：これは、セル伝送レートをRMセルの受信時に増やすことができる量を制御します。添加剤の増加率AIR = PCR * RIF。 RIFは、1 / 32,768〜1の範囲の、2のべき乗です。"
    },
    {
      "indent": 3,
      "text": "Discussion: For ABR traffic, RIF effects the time rate of change of the ACR. This value effects TCP round trip time calculations, which in turn effects TCP throughput.",
      "ja": "考察：ABRトラフィックの場合、RIFは、ACRの時間変化率に影響を与えます。この値は、効果ターンで効果のTCPスループットTCPのラウンドトリップ時間の計算を、。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.25. Resource Management (RM) Cells",
      "section_title": true,
      "ja": "1.2.25。リソース管理（RM）セル"
    },
    {
      "indent": 3,
      "text": "Definition: RM cells are used to convey network status (available bandwidth, congestion levels) and request peak cell rates for ATM blocks. The RM cell has the following format:",
      "ja": "定義：RMセルは、ATMブロックのネットワーク状況（利用可能な帯域幅、輻輳レベル）と要求ピークセルレートを伝えるために使用されています。 RMセルの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "Header: 5 bytes, same as the ATM cell header Protocol ID: 3 bytes, protocol ID value is 1 for ABR service Function specific field: 45 bytes, data required for the specific protocol (See DIR, BN, CI, NI, ER, CCR, and MCR for field information.) Rsvd: 6 bytes, reserved for future specification EDC: 10 bytes, CRC-10 error detection code computed over the cell payload .ti6 (except the CRC-10 field) and used to check for data corruption",
      "ja": "ヘッダ：ATMセルのヘッダのプロトコルIDと同じ5バイト、3バイト、プロトコルID値がABRサービス機能の特定のフィールドのために、1：45バイト、特定のプロトコルのために必要なデータ（ER、DIR、BN、CI、NIを参照フィールド情報のためのCCR、およびMCR）RSVD：将来の仕様EDCのために予約6バイト、10のバイト、CRC-10誤り検出符号CRC-10フィールドを除くセルペイロード.ti6（にわたって計算）とデータを確認するために使用汚職"
    },
    {
      "indent": 3,
      "text": "Discussion: RM information can exist at the VP and/or VC level. VP level cells are identified with a VCI value of 6. VC level cells are identified with a PT of 6. See DIR, BN, CI, NI, ER, CCR, and MCR for additional protocol field information.",
      "ja": "ディスカッション：RM情報は、VPおよび/またはVCレベルで存在することができます。 VPのレベルセルは、追加のプロトコルフィールドについて6参照DIRのPT、BN、CI、NI、ER、CCR、およびMCRで識別される6 VCレベルセルのVCI値で識別されます。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.26. Severely Errored Cell Block (SECB)",
      "section_title": true,
      "ja": "1.2.26。重大エラーセルブロック（SECB）"
    },
    {
      "indent": 3,
      "text": "Definition: A severely cell block outcome occurs when more than M errored cells, lost cells, or misinserted cell outcomes are observed in a received cell block.",
      "ja": "定義：Mエラーセル、失われた細胞、または誤挿入セルよりも多くの成果を受信したセルブロックにおいて観察されたときひどくセルブロック結果が生じます。"
    },
    {
      "indent": 3,
      "text": "Discussion: none.",
      "ja": "ディスカッション：なし。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.1",
      "ja": "仕様：AF TM4.1"
    },
    {
      "indent": 0,
      "text": "1.2.27. Tagged Cell Rate (TCR)",
      "section_title": true,
      "ja": "1.2.27。タグ付けされたセル・レート（TCR）"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter, TCR limits the rate at which a source may send out-of-rate forward RM-cells. TCR is a constant fixed at 10 cells/second.",
      "ja": "定義：ABRサービスパラメータは、TCRのソースはアウトオブ率前方RM-セルを送信することが速度を制限します。 TCR /秒10個の細胞で固定定数です。"
    },
    {
      "indent": 3,
      "text": "Discussion: none.",
      "ja": "ディスカッション：なし。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.28. TDF",
      "section_title": true,
      "ja": "1.2.28。 TDF"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter, TDF controls the decrease in ACR associated with TOF. TDF is signaled as TDFF, where TDF=TDFF/RDF times the smallest power of 2 greater or equal to PCR. TDF is in units of 1/seconds.",
      "ja": "定義：ABRサービスパラメータ、TDFはTOFに関連付けられたACRの低下を制御します。 TDFは、TDF = TDFF / RDFの2倍大きいか、またはPCRに等しい最小の電力をTDFF、としてシグナリングされます。 TDFは、1 /秒の単位です。"
    },
    {
      "indent": 3,
      "text": "Discussion: For ABR traffic, TDF effects the time rate of change of the ACR. This value effects TCP round trip time calculations, which in turn effects TCP throughput.",
      "ja": "考察：ABRトラフィックの場合、TDFは、ACRの時間変化率に影響を与えます。この値は、効果ターンで効果のTCPスループットTCPのラウンドトリップ時間の計算を、。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.29. TDFF",
      "section_title": true,
      "ja": "1.2.29。 TDFF"
    },
    {
      "indent": 3,
      "text": "Definition: Refer to TDF. TDFF is either zero or a power of two in the range 1/64 to 1 in units of 1 /cells.",
      "ja": "定義：TDFを参照してください。 TDFFは、ゼロまたは1 /セル単位で1の範囲1/64で2の累乗のいずれかです。"
    },
    {
      "indent": 3,
      "text": "Discussion: Refer to TDF.",
      "ja": "ディスカッション：TDFを参照してください。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 3,
      "text": "1.2.30. Time Out Factor (TOF)",
      "section_title": true,
      "ja": "1.2.30。タイムアウト因子（TOF）"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter, TOF controls the maximum time permitted between sending forward RM-cells before a rate decrease is required. It is signaled as TOFF where TOF=TOFF+1. TOFF is a power of 2 in the range: 1/8 to 4,096.",
      "ja": "定義：ABRサービスパラメータは、TOFは、レートの減少が必要とされる前に、前方RM-セルの送信の間に許容される最大時間を制御します。それはTOFF TOF = TOFF + 1としてシグナリングされます。 TOFFは、範囲内の2の累乗である：4,096 1/8。"
    },
    {
      "indent": 3,
      "text": "Discussion: For ABR traffic, TOF effects the time rate of change of the ACR. This value effects TCP round trip time calculations, which in turn effects TCP throughput.",
      "ja": "考察：ABRトラフィックの場合、TOFは、ACRの時間変化率に影響を与えます。この値は、効果ターンで効果のTCPスループットTCPのラウンドトリップ時間の計算を、。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.31. Time Out Factor (TOFF)",
      "section_title": true,
      "ja": "1.2.31。タイムアウト因子（TOFF）"
    },
    {
      "indent": 3,
      "text": "Definition: Refer to TOF.",
      "ja": "定義：TOFを参照してください。"
    },
    {
      "indent": 3,
      "text": "Discussion: none.",
      "ja": "ディスカッション：なし。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.32. Trm",
      "section_title": true,
      "ja": "1.2.32。 TRM"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter that provides an upper bound on the time between forward RM-cells for an active source. It is 100 times a power of two with a range of 100*2-7 to 100*20",
      "ja": "定義：アクティブソースのための前方RM-セル間の時間の上限を提供ABRサービスパラメータ。これは、* 20 100〜100 * 2-7の範囲を有する2つの100倍の電力であります"
    },
    {
      "indent": 3,
      "text": "Discussion: For ABR traffic, Trm effects the time rate of change of the ACR. This value effects TCP round trip time calculations, which in turn effects TCP throughput.",
      "ja": "考察：ABRトラフィックの場合、TRMがACRの時間変化率に影響を与えます。この値は、効果ターンで効果のTCPスループットTCPのラウンドトリップ時間の計算を、。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.33. Virtual Source/Virtual Destination (VSND)",
      "section_title": true,
      "ja": "1.2.33。仮想発信元/仮想着信先（VSND）"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR connection may be divided into two or more separately controlled ABR segments. Each ABR control segment, except the first, is sourced by a virtual source. A virtual source implements the behavior of an ABR source endpoint. Backward RM-cells received by a virtual source are removed from the connection. Each ABR control segment, except the last, is terminated by a virtual destination. A virtual destination assumes the behavior of an ABR destination endpoint. Forward RM-cells received by a virtual destination are turned around and not forwarded to the next segment of the connection.",
      "ja": "定義：ABR接続は、2つの以上の別々に制御されたABRセグメントに分割することができます。各ABR制御セグメントは、最初のを除いては、仮想源によって供給されます。仮想ソースは、ABRのソースエンドポイントの動作を実装します。仮想源によって受信後方RM-細胞は、接続から除去されます。各ABR制御セグメントは、最後を除いて、仮想先で終了します。仮想先は、ABRの宛先エンドポイントの動作を前提としています。仮想宛先によって受信された順方向RM-細胞が振り向くと、接続の次のセグメントに転送されません。"
    },
    {
      "indent": 3,
      "text": "Discussion: none.",
      "ja": "ディスカッション：なし。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.34. Xrm Decrease Factor (XDM)",
      "section_title": true,
      "ja": "1.2.34。 XRM減少因子（XDM）"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter, XDF controls the decrease in ACR associated with Xrm. It is a power of two in range: [0, 1].",
      "ja": "定義：ABRサービスパラメータ、XDFはXRMに関連付けられたACRの低下を制御します。 [0、1]：これは、範囲の2の累乗です。"
    },
    {
      "indent": 3,
      "text": "Discussion: For ABR traffic, XDM effects the time rate of change of the ACR. This value effects TCP round trip time calculations, which in turn effects TCP throughput.",
      "ja": "ディスカッション：ABRトラフィックの場合、XDMはACRの時間変化率に影響を与えます。この値は、効果ターンで効果のTCPスループットTCPのラウンドトリップ時間の計算を、。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "1.2.35. Xrm",
      "section_title": true,
      "ja": "1.2.35。 WAVE"
    },
    {
      "indent": 3,
      "text": "Definition: An ABR service parameter, Xrm limits the number of forward RM-cells which may be sent in the absence of received backward PM-cells. The range is 0-255.",
      "ja": "定義：ABRサービスパラメータ、XRMは、受信下位PM-細胞の非存在下で送られるかもしれない前方RM-細胞の数を制限します。範囲は0〜255です。"
    },
    {
      "indent": 3,
      "text": "Discussion: For ABR traffic, Xrm effects the time rate of change of the ACR. This value effects TCP round trip time calculations, which in turn effects TCP throughput.",
      "ja": "考察：ABRトラフィックの場合、XRMは、ACRの時間変化率に影響を与えます。この値は、効果ターンで効果のTCPスループットTCPのラウンドトリップ時間の計算を、。"
    },
    {
      "indent": 3,
      "text": "Specification: AF-TM4.0",
      "ja": "仕様：AF TM4.0"
    },
    {
      "indent": 0,
      "text": "2. Performance Metrics",
      "section_title": true,
      "ja": "2.パフォーマンス・メトリック"
    },
    {
      "indent": 0,
      "text": "2.1. Definition Format (from )",
      "section_title": true,
      "ja": "2.1。定義フォーマット（から）"
    },
    {
      "indent": 3,
      "text": "Metric to be defined.",
      "ja": "メトリックが定義されます。"
    },
    {
      "indent": 3,
      "text": "Definition: The specific definition for the metric.",
      "ja": "定義：メトリックの特定の定義。"
    },
    {
      "indent": 3,
      "text": "Discussion: A brief discussion of the metric, its application and any restrictions on measurement procedures.",
      "ja": "ディスカッション：メトリック、そのアプリケーションおよび測定手順に制限の簡単な説明。"
    },
    {
      "indent": 3,
      "text": "Measurement units: Intrinsic units used to quantify this metric. This includes subsidiary units; e.g., microseconds are acceptable if the intrinsic unit is seconds.",
      "ja": "測定単位：このメトリックを定量化するために使用される固有のユニット。これは、補助ユニットを含みます。固有単位は秒である場合、例えば、マイクロ秒が許容されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Definitions",
      "section_title": true,
      "ja": "2.2。定義"
    },
    {
      "indent": 0,
      "text": "2.2.1. ABR Rate Decrease Response Time (ARDRT)",
      "section_title": true,
      "ja": "2.2.1。 ABRレート減少応答時間（ARDRT）"
    },
    {
      "indent": 3,
      "text": "Definition: The amount of time required by the SUT to adjust its transmission rate based on an ABR rate decrease request.",
      "ja": "定義：ABRレート減少要求に基づいて、その伝送レートを調整するためにSUTが必要とする時間の量。"
    },
    {
      "indent": 3,
      "text": "Discussion: During the ARDRT, cells transmitted by the SUT may be dropped by the network due to traffic policing. These dropped cells may contain a portion of an IP datagram. This may cause IP and TCP packet loss.",
      "ja": "ディスカッション：ARDRT中は、SUTが送信した細胞は、トラフィックポリシングのためにネットワークによって廃棄されることがあります。これらのドロップされた細胞は、IPデータグラムの部分が含まれていてもよいです。これは、IPおよびTCPパケット損失が発生することがあります。"
    },
    {
      "indent": 3,
      "text": "Measurement Units: seconds",
      "ja": "測定単位：秒"
    },
    {
      "indent": 0,
      "text": "2.2.2. ABR Rate Increase Response Time (ARIRT)",
      "section_title": true,
      "ja": "2.2.2。 ABRレート増加応答時間（ARIRT）"
    },
    {
      "indent": 3,
      "text": "Definition: The amount of time required by the SUT to adjust its transmission rate based on an ABR rate increase request.",
      "ja": "定義：ABRレート増加要求に基づいて、その伝送レートを調整するためにSUTが必要とする時間の量。"
    },
    {
      "indent": 3,
      "text": "Discussion: During the ARIRT, the SUT will not fully utilize the available bandwidth. This will negatively impact IP and TCP throughput.",
      "ja": "ディスカッション：ARIRT中は、SUTが完全に利用可能な帯域幅を利用しません。これは、負IPやTCPスループットに影響を与えます。"
    },
    {
      "indent": 3,
      "text": "Measurement Units: seconds",
      "ja": "測定単位：秒"
    },
    {
      "indent": 0,
      "text": "2.2.3. RM-Cell Delay Variation (RM-CDV)",
      "section_title": true,
      "ja": "2.2.3。 RM-セル遅延変動（RM-CDV）"
    },
    {
      "indent": 3,
      "text": "Definition: The variation in RM-cell transfer delay (RM-CTD) of RM-cells associated with a given traffic load, orientation and distribution, as well as an integration period. RM-CDV = max (RM-CTD) - min (RM-CTD) where max and min indicate the maximum and minimum over the integration period, respectively.",
      "ja": "定義：指定されたトラフィック負荷、配向および分布、ならびに積分期間に関連付けられたRM-細胞のRMセル転送遅延の変動（RM-CTD）。 RM-CDV = MAX（RM-CTD） - 分（RM-CTD）maxおよびminは、それぞれ、積分期間にわたる最大値及び最小値を示しています。"
    },
    {
      "indent": 3,
      "text": "Discussion: RM-CDV is a component of RM-cell transfer delay, induced by buffering and RM-cell scheduling.",
      "ja": "議論：RM-CDVは、バッファリングおよびRM-セルスケジューリングによって誘導されるRMセル転送遅延、の構成要素です。"
    },
    {
      "indent": 3,
      "text": "RM-CDV effects the time required to notify the source of a change in the condition of the network. This in turn effects TCP round trip time calculations. Large values of RM-CDV will adversely effect TCP throughput and cause SAR timeout.",
      "ja": "RM-CDVは、ネットワークの状態の変化の原因を通知するために必要な時間に影響を与えます。このターン効果TCPラウンドトリップ時間の計算インチRM-CDVの大きな値は、効果のTCPスループットに悪影響を与えるとSARのタイムアウトが発生します。"
    },
    {
      "indent": 3,
      "text": "Measurement Units: seconds",
      "ja": "測定単位：秒"
    },
    {
      "indent": 0,
      "text": "2.2.4. RM-Cell Error Ratio (RM-CER)",
      "section_title": true,
      "ja": "2.2.4。 RMセル・エラー率（RM-CER）"
    },
    {
      "indent": 3,
      "text": "Definition: The ratio of RM-cells with payload errors in a transmission in relation to the total number of RM-cells sent in a transmission associated with a given traffic load, orientation and distribution, as well as an integration period. Note that errors occurring in the RM-cell header will cause RM-cell loss at the ATM layer. Note further that multiple errors in a payload will only be counted as one cell payload error.",
      "ja": "定義：指定されたトラフィック負荷、配向および分布、ならびに積分期間に関連付けられた送信で送られたRM-細胞の総数に対する送信ペイロードエラーのRM細胞の割合。 RMセルのヘッダに発生したエラーは、ATMレイヤでRMセル損失を引き起こすことに注意してください。ペイロード内の複数のエラーが唯一のセルペイロードエラーとしてカウントされることにさらに留意されたいです。"
    },
    {
      "indent": 5,
      "text": "RM-CER = RM-Cells with payload errors / Total RM-Cells Transmitted.",
      "ja": "RM-CER =ペイロードエラー/総RM細胞とRM-細胞を送信。"
    },
    {
      "indent": 3,
      "text": "Discussion: The measurement is taken over a time interval and is desirable to be measured on an in-service circuit. RM-CER effects the time required to notify the source of a change in the condition of the network. This in turn effects TCP round trip time calculations. Large values of RM-CER will adversely effect TCP throughput and cause SAR timeout.",
      "ja": "議論：測定は時間間隔にわたって採取し、インサービスの回線で測定することが望ましいされます。 RM-CERは、ネットワークの状態の変化の原因を通知するために必要な時間に影響を与えます。このターン効果TCPラウンドトリップ時間の計算インチRM-CERの大きな値は、効果のTCPスループットに悪影響を与えるとSARのタイムアウトが発生します。"
    },
    {
      "indent": 3,
      "text": "Measurement Units: dimensionless.",
      "ja": "測定単位：無次元。"
    },
    {
      "indent": 0,
      "text": "2.2.5. RM-Cell Loss Ratio (RM-CLR)",
      "section_title": true,
      "ja": "2.2.5。 RM-セル廃棄率（RM-CLR）"
    },
    {
      "indent": 3,
      "text": "Definition: The ratio of lost RM-cells in a transmission in relation to the total RM-cells sent in a transmission associated with a given traffic load, orientation and distribution, as well as an integration period.",
      "ja": "定義：指定されたトラフィック負荷、配向および分布、ならびに積分期間に関連付けられた送信で送られた総RM-細胞に関して送信中に失わRM-細胞の割合。"
    },
    {
      "indent": 6,
      "text": "RM-CLR = Lost RM-Cells / Total RM-Cells Transmitted.",
      "ja": "RM-CLR =ロストRM-細胞/総RM-細胞を送信します。"
    },
    {
      "indent": 3,
      "text": "Discussion: The objective is to minimize RM-CLR. It is expressed as an order of magnitude, having a range of 10^-1 to 10^-15 and unspecified.",
      "ja": "ディスカッション：目的はRM-CLRを最小限にすることです。これは、10 ^ -15および不特定に10 ^ -1の範囲を有する、大きさの順序として表現されます。"
    },
    {
      "indent": 3,
      "text": "RM-CLR effects the time required to notify the source of a change in the condition of the network. This in turn effects TCP round trip time calculations. Large values of RM-CLR will adversely effect TCP throughput and cause SAR timeout.",
      "ja": "RM-CLRは、ネットワークの状態の変化の原因を通知するために必要な時間に影響を与えます。このターン効果TCPラウンドトリップ時間の計算インチRM-CLRの大きな値は、効果のTCPスループットに悪影響を与えるとSARのタイムアウトが発生します。"
    },
    {
      "indent": 3,
      "text": "Measurement Units: dimensionless.",
      "ja": "測定単位：無次元。"
    },
    {
      "indent": 0,
      "text": "2.2.6. RM-Cell Misinsertion Ratio (RM-CMR)",
      "section_title": true,
      "ja": "2.2.6。 RM-セル誤挿入率（RM-CMR）"
    },
    {
      "indent": 3,
      "text": "Definition: The ratio of RM-cells received at an endpoint that were not originally transmitted by the source end in relation to the total number of RM-cells properly transmitted associated with a given traffic load, orientation and distribution, as well as an integration period.",
      "ja": "定義：元々正しく指定されたトラフィック負荷、配向および分布、ならびに積分期間に関連付けられて送信RM-細胞の総数に関連してソース端によって送信されなかったエンドポイントで受信されたRM-細胞の割合。"
    },
    {
      "indent": 6,
      "text": "RM-CMR = Misinserted RM-Cells / Total RM-Cells Transmitted.",
      "ja": "RM-CMR =誤挿入RM-細胞/総RM-細胞を送信します。"
    },
    {
      "indent": 3,
      "text": "Discussion: The measurement is taken over a time interval and is desirable to be measured on an in-service circuit.",
      "ja": "議論：測定は時間間隔にわたって採取し、インサービスの回線で測定することが望ましいされます。"
    },
    {
      "indent": 3,
      "text": "RM-CMR effects the time required to notify the source of a change in the condition of the network. This in turn effects TCP round trip time calculations. Large values of RM-CMR will adversely effect TCP throughput and cause SAR timeout.",
      "ja": "RM-CMRは、ネットワークの状態の変化の原因を通知するために必要な時間に影響を与えます。このターン効果TCPラウンドトリップ時間の計算インチRM-CMRの大きな値は、効果のTCPスループットに悪影響を与えるとSARのタイムアウトが発生します。"
    },
    {
      "indent": 3,
      "text": "Measurement Units: dimensionless.",
      "ja": "測定単位：無次元。"
    },
    {
      "indent": 0,
      "text": "2.2.7. RM-CRC Error Ratio",
      "section_title": true,
      "ja": "2.2.7。 RM-CRCエラー率"
    },
    {
      "indent": 3,
      "text": "Definition: The ratio of RM-cells received at an endpoint which contain an invalid CRC in relation to the total number of RM-cells properly transmitted associated with a given traffic load, orientation and distribution, as well as an integration period.",
      "ja": "定義：適切に指定されたトラフィック負荷、配向および分布、ならびに積分期間に関連付けられて送信RM-細胞の総数に関連して、無効なCRCを含むエンドポイントで受信されたRM-細胞の割合。"
    },
    {
      "indent": 3,
      "text": "Discussion: RM-CRC errors cause ATM RM-cells to be lost.",
      "ja": "ディスカッション：RM-CRCエラーがATM RM-細胞が失われ。"
    },
    {
      "indent": 3,
      "text": "RM-CRC effects the time required to notify the source of a change in the condition of the network. This in turn effects TCP round trip time calculations. Large values of RM-CRC will adversely effect TCP throughput and cause SAR timeout.",
      "ja": "RM-CRCは、ネットワークの状態の変化のソースに通知するために必要な時間に影響を与えます。このターン効果TCPラウンドトリップ時間の計算インチRM-CRCの大きな値は、効果のTCPスループットに悪影響を与えるとSARのタイムアウトが発生します。"
    },
    {
      "indent": 3,
      "text": "Measurement Units: dimensionless",
      "ja": "測定単位：無次元"
    },
    {
      "indent": 0,
      "text": "2.2.8. RM-Cell Transfer Delay (RM-CTD)",
      "section_title": true,
      "ja": "2.2.8。 RM-セル転送遅延（RM-CTD）"
    },
    {
      "indent": 3,
      "text": "Definition: The elapsed time between a RM-cell exit event at the measurement point 1 (e.g., at the source UNI) and the corresponding RM-cell entry event at a measurement point 2 (e.g., the destination UNI) for a particular connection.",
      "ja": "定義：測定点1におけるRMセル終了イベント間の経過時間（例えば、ソースUNIで）、測定点2に対応するRM-細胞侵入イベント（例えば、宛先UNI）特定の接続のために。"
    },
    {
      "indent": 3,
      "text": "Discussion: The RM-cell transfer delay between two measurement points is the sum of the total inter-ATM node transmission delay and the total ATM node processing delay. This number is a constant and should not adversely effect performance.",
      "ja": "議論：2つの測定点間のRMセル転送遅延は、全間ATMノードの伝送遅延との合計ATMノード処理遅延の合計です。この数は一定であると効果のパフォーマンスに悪影響を与えるべきではありません。"
    },
    {
      "indent": 3,
      "text": "Measurement units: seconds",
      "ja": "測定単位：秒"
    },
    {
      "indent": 0,
      "text": "2.2.9. Severely Errored Cell Block Ratio (SECBR)",
      "section_title": true,
      "ja": "2.2.9。重大エラーセルブロック率（SECBR）"
    },
    {
      "indent": 3,
      "text": "Definition: The ratio of severely errored cell blocks in a transmission in relation to the total cell blocks sent in a transmission associated with a given traffic load, orientation and distribution, as well as an integration period.",
      "ja": "定義：指定されたトラフィック負荷、配向および分布、ならびに積分期間に関連付けられた送信で送られた総セルブロックに関して伝送における重大エラーセルブロックの比率。"
    },
    {
      "indent": 6,
      "text": "SECBR = Severely Errored Cell Blocks/Total Transmitted Cell Blocks",
      "ja": "SECBR =重大エラーセルブロック/総透過セルブロック"
    },
    {
      "indent": 3,
      "text": "Discussion: SECBR may cause the SUT to drop cells that may contain a portion of an IP datagram. This may cause IP and TCP packet loss.",
      "ja": "ディスカッション：SECBRは、IPデータグラムの部分を含むことができ、細胞をドロップするようにSUTを引き起こす可能性があります。これは、IPおよびTCPパケット損失が発生することがあります。"
    },
    {
      "indent": 3,
      "text": "Measurement Units: dimensionless.",
      "ja": "測定単位：無次元。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "As this document is solely for providing terminology and describes neither a protocol nor an implementation, there are no security considerations associated with this document.",
      "ja": "この文書は、専門用語を提供するためだけにあり、プロトコルも実装どちらを記述したように、このドキュメントに関連したセキュリティ上の考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "ja": "4.参考文献"
    },
    {
      "indent": 3,
      "text": "[AF-TM4.0] ATM Forum, Traffic Management Specification Version 4.0, af-tm-0056.00, April 1996.",
      "ja": "[AF TM4.0] TM 0056.00のATMフォーラム、トラフィック管理仕様バージョン4.0、1996年4月。"
    },
    {
      "indent": 3,
      "text": "[AF-TM4.1] ATM Forum, Traffic Management Specification Version 4.1, af-tm-0121.000, March 1999.",
      "ja": "TM 0121.000の[AF TM4.1] ATMフォーラム、トラフィック管理仕様バージョン4.1、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[AF-UNI3.1] ATM Forum, User Network Interface Specification Version 3.1, September 1994.",
      "ja": "[AF-UNI3.1] ATMフォーラム、ユーザネットワークインターフェース仕様バージョン3.1、1994年9月。"
    },
    {
      "indent": 3,
      "text": "[AF-UNI4.0] ATM Forum, User Network Interface Specification Version 4.0, July 1996.",
      "ja": "[AF-UNI4.0] ATMフォーラム、ユーザネットワークインターフェース仕様バージョン4.0、1996年7月。"
    },
    {
      "indent": 0,
      "text": "5. Editors' Addresses",
      "section_title": true,
      "ja": "5.エディタのアドレス"
    },
    {
      "indent": 3,
      "text": "Jeffrey Dunn Advanced Network Consultants, Inc. 4214 Crest Place Ellicott City, MD 21043 USA",
      "ja": "ジェフリー・ダン高度ネットワークコンサルタンツ株式会社4214クレスト場所エリコットシティー、MD 21043 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 (410) 750-1700 EMail: Jeffrey.Dunn@worldnet.att.net",
      "ja": "電話：+1（410）750-1700 Eメール：Jeffrey.Dunn@worldnet.att.net"
    },
    {
      "indent": 3,
      "text": "Cynthia Martin Advanced Network Consultants, Inc. 4214 Crest Place Ellicott City, MD 21043 USA",
      "ja": "シンシアマーティン高度なネットワークコンサルタンツ株式会社4214クレスト場所エリコットシティー、MD 21043 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 (410) 750-1700 EMail: Cynthia.E.Martin@worldnet.att.net",
      "ja": "電話：+1（410）750-1700 Eメール：Cynthia.E.Martin@worldnet.att.net"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}