{
  "title": {
    "text": "RFC 3003 - The audio/mpeg Media Type",
    "ja": "RFC 3003 - オーディオ/MPEGメディアタイプ"
  },
  "number": 3003,
  "created_at": "2024-01-01 15:17:33.368289+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         M. Nilsson\nRequest for Comments: 3003                                 November 2000\nCategory: Standards Track",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 23,
      "text": "The audio/mpeg Media Type",
      "ja": "オーディオ/MPEGメディアタイプ"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The audio layers of the MPEG-1 and MPEG-2 standards are in frequent use on the internet, but there is no uniform Multipurpose Internet Mail Extension (MIME) type for these files. The intention of this document is to define the media type audio/mpeg to refer to this kind of contents.",
      "ja": "MPEG-1およびMPEG-2標準のオーディオレイヤーは、インターネットで頻繁に使用されていますが、これらのファイルには均一な多目的インターネットメールエクステンション（MIME）タイプはありません。このドキュメントの意図は、この種のコンテンツを参照するためにメディアタイプのオーディオ/MPEGを定義することです。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1. MPEG audio",
      "section_title": true,
      "ja": "1. MPEGオーディオ"
    },
    {
      "indent": 3,
      "text": "The audio compression defined as layer I, layer II and layer III in the MPEG-1 [MPEG-1] and MPEG-2 [MPEG-2] standards is a popular method of compressing audio with a low quality loss. The compressed audio is split into several small data frames, each containing a frame header and compressed audio data.",
      "ja": "MPEG-1 [MPEG-1]およびMPEG-2 [MPEG-2]標準のレイヤーI、レイヤーII、およびレイヤーIIIとして定義されたオーディオ圧縮は、低品質の損失でオーディオを圧縮する一般的な方法です。圧縮オーディオは、フレームヘッダーと圧縮オーディオデータを含むいくつかの小さなデータフレームに分割されます。"
    },
    {
      "indent": 3,
      "text": "The mime type audio/mpeg defines a elementary byte stream containing MPEG frames according to [MPEG-1] and [MPEG-2], possibly interspersed with non MPEG data. Non MPEG data is data without MPEG synchronization or in other ways not possible to decompress without error.",
      "ja": "MIMEタイプオーディオ/MPEGは、[MPEG-1]および[MPEG-2]に従ってMPEGフレームを含む基本バイトストリームを定義し、おそらく非MPEGデータが散在しています。非MPEGデータは、MPEGの同期を伴わないデータまたはエラーなしで減圧することができない他の方法です。"
    },
    {
      "indent": 3,
      "text": "Typically MPEG audio meta data is concatenated with the MPEG stream, e.g., the meta data format ID3 puts a 128 byte data block in the end of the stream while ID3v2 [ID3V2] prepends a data block of variable size to the stream.",
      "ja": "通常、MPEGオーディオメタデータはMPEGストリームと連結されています。たとえば、Metaデータ形式ID3はストリームの最後に128バイトのデータブロックを配置し、ID3v2 [ID3v2]は変数サイズのデータブロックをストリームに前提としています。"
    },
    {
      "indent": 3,
      "text": "NOTE: MPEG audio was not designed as a file format but as a format for transmitting audio streams. As such, it does not have any well defined way of including meta data along with audio information. Some products embed meta data using zero amplitude frames or disguised as transmission errors. Others embed the MPEG data in WAV format.",
      "ja": "注：MPEGオーディオは、ファイル形式としてではなく、オーディオストリームを送信するための形式として設計されています。そのため、メタデータとオーディオ情報を含める方法を明確に定義していません。一部の製品は、ゼロ振幅フレームを使用してメタデータを埋め込み、伝送エラーとして偽装しています。その他は、MPEGデータをWAV形式で埋め込みました。"
    },
    {
      "indent": 3,
      "text": "NOTE: The audio/MPS mime type is in use in addition to the audio/mpeg. The MPA [RFC 1890] sub-type refers to MPEG audio when it is segmented and send as a Realtime Transport Protocol (RTP) payload.",
      "ja": "注：オーディオ/MPEのタイプは、オーディオ/MPEGに加えて使用されています。MPA [RFC 1890]サブタイプは、セグメント化されたMPEGオーディオを指し、リアルタイムトランスポートプロトコル（RTP）ペイロードとして送信します。"
    },
    {
      "indent": 0,
      "text": "2. Registration Information",
      "section_title": true,
      "ja": "2. 登録情報"
    },
    {
      "indent": 3,
      "text": "To: ietf-types@iana.org Subject: Registration of MIME media type audio/mpeg",
      "ja": "宛先：ietf-types@iana.org件名：Mime Media Type Audio/MPEGの登録"
    },
    {
      "indent": 3,
      "text": "MIME media type name: audio",
      "ja": "MIMEメディアタイプ名：オーディオ"
    },
    {
      "indent": 3,
      "text": "MIME subtype name: mpeg",
      "ja": "mimeサブタイプ名：mpeg"
    },
    {
      "indent": 3,
      "text": "Required parameters: none",
      "ja": "必要なパラメーター：なし"
    },
    {
      "indent": 3,
      "text": "Optional parameters: none",
      "ja": "オプションのパラメーター：なし"
    },
    {
      "indent": 3,
      "text": "Encoding considerations:",
      "ja": "考慮事項のエンコード："
    },
    {
      "indent": 7,
      "text": "For use over internet it is assumed that lower layers take care of transmission errors, so audio/mpeg data MAY include MPEG frames generated without the optional cyclic redundancy checks (CRC) for improved audio quality.",
      "ja": "インターネットを介して使用するには、下層が送信エラーに対応するため、オーディオ/MPEGデータには、オーディオ品質が向上するためのオプションの循環冗長チェック（CRC）なしで生成されたMPEGフレームが含まれる場合があります。"
    },
    {
      "indent": 7,
      "text": "The MPEG audio data is binary data, and must be encoded for non-binary transport; the Base64 encoding is suitable for Email. Note that the MPEG audio data does not compress easily using lossless compression.",
      "ja": "MPEGオーディオデータはバイナリデータであり、非バイナリトランスポート用にエンコードする必要があります。Base64エンコーディングは、電子メールに適しています。MPEGオーディオデータは、ロスレス圧縮を使用して簡単に圧縮されないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Security considerations:",
      "ja": "セキュリティ上の考慮事項："
    },
    {
      "indent": 8,
      "text": "MPEG is a tagged data format, and some tags are available for private use. As such, arbitrary material could potentially be transferred in the MPEG stream, including executable content. Tagged data containing executable content SHOULD never be sent and MUST not be executed if it is received.",
      "ja": "MPEGはタグ付きデータ形式であり、一部のタグはプライベートで使用できます。そのため、実行可能コンテンツを含むMPEGストリームで任意の材料を転送する可能性があります。実行可能ファイルコンテンツを含むタグ付きデータは送信されないでください。受信した場合は実行しないでください。"
    },
    {
      "indent": 32,
      "text": "NOTE",
      "ja": "注記"
    },
    {
      "indent": 12,
      "text": "The requirement that such content not be executed on receipt is especially important since situations exist where content will be generated independently and therefore could contain executable content that the sender is unaware of.",
      "ja": "そのようなコンテンツが領収書で実行されないという要件は、コンテンツが独立して生成される状況が存在するため、送信者が気付いていない実行可能なコンテンツを含める可能性があるため、特に重要です。"
    },
    {
      "indent": 8,
      "text": "Audio/mpeg objects are not signed or encrypted internally. External security mechanisms must be employed to ensure content confidentiality",
      "ja": "オーディオ/MPEGオブジェクトは、内部で署名または暗号化されていません。コンテンツの機密性を確保するために、外部セキュリティメカニズムを採用する必要があります"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations:",
      "ja": "相互運用性の考慮事項："
    },
    {
      "indent": 7,
      "text": "MPEG audio has proven to be widely interoperable across computer platforms.",
      "ja": "MPEGオーディオは、コンピュータープラットフォーム間で広く相互運用可能であることが証明されています。"
    },
    {
      "indent": 3,
      "text": "Published specification: see [MPEG-1] and [MPEG-2]",
      "ja": "公開された仕様：[MPEG-1]および[MPEG-2]を参照してください"
    },
    {
      "indent": 3,
      "text": "Applications which use this media type:",
      "ja": "このメディアタイプを使用するアプリケーション："
    },
    {
      "indent": 7,
      "text": "MPEG audio is device-, platform- and vendor-neutral and is supported by a wide range of encoders and decoders (players).",
      "ja": "MPEGオーディオは、デバイス、プラットフォーム、ベンダーの中立であり、幅広いエンコーダーとデコーダー（プレーヤー）によってサポートされています。"
    },
    {
      "indent": 3,
      "text": "Additional information:",
      "ja": "追加情報："
    },
    {
      "indent": 7,
      "text": "Magic number(s): none\nFile extension(s): .mp1, .mp2, .mp3\nMacintosh File Type Code(s): MPEG\nObject Identifier(s) or OID(s): none",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information:",
      "ja": "詳細については、連絡先への個人およびメールアドレス："
    },
    {
      "indent": 7,
      "text": "The author of this document.",
      "ja": "このドキュメントの著者。"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図された使用法：共通"
    },
    {
      "indent": 3,
      "text": "Author/Change controller: Martin Nilsson (see section 5)",
      "ja": "著者/変更コントローラー：Martin Nilsson（セクション5を参照）"
    },
    {
      "indent": 3,
      "text": "3. Security Considerations",
      "ja": "3. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Security considerations are discussed in the security considerations clause of the MIME registration in section 2.",
      "ja": "セキュリティ上の考慮事項は、セクション2のMIME登録のセキュリティに関する考慮事項条項で説明されています。"
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "ja": "4. 参考文献"
    },
    {
      "indent": 3,
      "text": "[ID3v2] Martin Nilsson, \"ID3 tag version 2.3.0\". <url:http://www.id3.org/id3v2.3.0.txt>",
      "ja": "[ID3v2] Martin Nilsson、「ID3タグバージョン2.3.0」。<url：http：//www.id3.org/id3v2.3.0.txt>"
    },
    {
      "indent": 3,
      "text": "[MPEG-1] ISO/IEC 11172-3:1993. Coding of moving pictures and associated audio for digital storage media at up to about 1,5 Mbit/s, Part 3: Audio. Technical committee / subcommittee: JTC 1 / SC 29",
      "ja": "[MPEG-1] ISO/IEC 11172-3：1993。最大約1,5 Mbit/sのデジタルストレージメディア用の移動写真と関連するオーディオのコーディング、パート3：オーディオ。技術委員会 /小委員会：JTC 1 / SC 29"
    },
    {
      "indent": 3,
      "text": "[MPEG-2] ISO/IEC 13818-3:1995 Generic coding of moving pictures and associated audio information, Part 3: Audio. Technical committee / subcommittee: JTC 1 / SC 29",
      "ja": "[MPEG-2] ISO/IEC 13818-3：1995移動写真と関連するオーディオ情報の汎用コーディング、パート3：オーディオ。技術委員会 /小委員会：JTC 1 / SC 29"
    },
    {
      "indent": 5,
      "text": "and",
      "ja": "そしてと及びアンド並びに且つ兼又共それですると亦だからそれからはたまた"
    },
    {
      "indent": 5,
      "text": "ISO/IEC DIS 13818-3 Generic coding of moving pictures and associated audio information, Part 3: Audio (Revision of ISO/IEC 13818-3:1995)",
      "ja": "ISO/IEC DIS 13818-3移動写真と関連するオーディオ情報の一般的なコーディング、パート3：オーディオ（ISO/IEC 13818-3：1995の改訂）"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "5. Author's Address",
      "section_title": true,
      "ja": "5. 著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Martin Nilsson Rydsvagen 246 C. 30 S-584 34 Linkoping Sweden",
      "ja": "Martin Nilsson Rydsvagen 246 C. 30 S-584 34 Linkoping Sweden"
    },
    {
      "indent": 3,
      "text": "EMail: nilsson@id3.org",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6. Full Copyright Statement",
      "section_title": true,
      "ja": "6. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2000）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}