{
  "title": {
    "text": "RFC 3331 - Signaling System 7 (SS7) Message Transfer Part 2 (MTP2) - User Adaptation Layer",
    "ja": "RFC 3331 - シグナリングシステム7（SS7）メッセージ転送パート2（MTP2） - ユーザー適応レイヤー"
  },
  "number": 3331,
  "created_at": "2023-11-20 09:18:04.782006+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       K. Morneault\nRequest for Comments: 3331                                 Cisco Systems\nCategory: Standards Track                                       R. Dantu\n                                                                 NetRake\n                                                           G. Sidebottom\n                                                   Signatus Technologies\n                                                             B. Bidulock\n                                                                 OpenSS7\n                                                                J. Heitz\n                                                                  Lucent\n                                                          September 2002",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Signaling System 7 (SS7) Message Transfer Part 2 (MTP2) - User Adaptation Layer",
      "ja": "シグナリングシステム7（SS7）メッセージ転送パート2（MTP2） - ユーザー適応レイヤー"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document defines a protocol for the backhauling of Signaling System 7 Message Transfer Part 2 (SS7 MTP2) User signalling messages over IP using the Stream Control Transmission Protocol (SCTP). This protocol would be used between a Signalling Gateway (SG) and Media Gateway Controller (MGC). It is assumed that the SG receives SS7 signalling over a standard SS7 interface using the SS7 Message Transfer Part (MTP) to provide transport. The Signalling Gateway would act as a Signalling Link Terminal.",
      "ja": "このドキュメントでは、シグナリングシステムのバックホールのプロトコルを定義します7メッセージ転送パート2（SS7 MTP2）ユーザーシグナリングメッセージは、ストリーム制御伝送プロトコル（SCTP）を使用してIPを使用します。このプロトコルは、シグナリングゲートウェイ（SG）とメディアゲートウェイコントローラー（MGC）の間で使用されます。SGは、SS7メッセージ転送パーツ（MTP）を使用して標準のSS7インターフェイスを介してSS7シグナル伝達を受信して輸送を提供すると想定されています。信号ゲートウェイは、信号リンク端子として機能します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction.............................................. 2\n  1.1  Scope.................................................. 3\n  1.2  Terminology............................................ 3\n  1.3  M2UA Overview.......................................... 5\n  1.4  Services Provided by the M2UA Adaptation Layer......... 7\n  1.5  Functions Provided by the M2UA Layer................... 9\n  1.6  Definition of the M2UA Boundaries..................... 12\n2.  Conventions.............................................. 16\n3.  Protocol Elements........................................ 16\n  3.1  Common Message Header................................. 16\n  3.2  M2UA Message Header................................... 22\n  3.3  M2UA Messages......................................... 23\n4.  Procedures............................................... 58\n  4.1  Procedures to Support the M2UA-User Layer............. 58\n  4.2  Receipt of Primitives from the Layer Management....... 59\n  4.3  AS and ASP State Maintenance.......................... 61\n  4.4  Link Key Management Procedures........................ 73\n5.  Examples of MTP2 User Adaptation (M2UA) Procedures....... 75\n  5.1  Establishment of associations between SGP and MGC..... 75\n       examples\n  5.2  ASP Traffic Fail-over Examples........................ 77\n  5.3  SGP to MGC, MTP Level 2 to MTP Level 3 Boundary\n       Procedures............................................ 78\n6.  Timer Values............................................. 85\n7.  Security Considerations.................................. 85\n  7.1 Threats................................................ 85\n  7.2 Protecting Confidentiality............................. 86\n8.  IANA Considerations...................................... 86\n  8.1 SCTP Payload Protocol Identifier....................... 86\n  8.2 M2UA Protocol Extensions............................... 86\n9.  Acknowledgements......................................... 87\n10. References............................................... 88\nAppendix A: Signalling Network Architecture.................. 90\nAuthors' Addresses........................................... 92\nFull Copyright Statement..................................... 94",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document defines a protocol for the backhauling of SS7 [1] MTP2 User [2] [3] [4] (i.e. MTP3) signalling messages over IP using the Stream Control Transmission Protocol (SCTP) [8]. This protocol would be used between a Signalling Gateway (SG) and Media Gateway Controller (MGC).",
      "ja": "このドキュメントは、SS7 [1] MTP2ユーザー[2] [3] [4]（つまりMTP3）のバックホールのプロトコルを定義し、Stream Control Transmission Protocol（SCTP）[8]を使用してIPを介してシグナル伝達メッセージを定義します。このプロトコルは、シグナリングゲートウェイ（SG）とメディアゲートウェイコントローラー（MGC）の間で使用されます。"
    },
    {
      "indent": 0,
      "text": "1.1 Scope",
      "section_title": true,
      "ja": "1.1 範囲"
    },
    {
      "indent": 3,
      "text": "There is a need for Switched Circuit Network (SCN) signalling protocol delivery from a Signalling Gateway (SG) to a Media Gateway Controller (MGC) [9]. The delivery mechanism addresses the following objectives:",
      "ja": "シグナリングゲートウェイ（SG）からメディアゲートウェイコントローラー（MGC）へのスイッチング回路ネットワーク（SCN）シグナル伝達プロトコルの配信が必要です[9]。配信メカニズムは、次の目的に対応しています。"
    },
    {
      "indent": 3,
      "text": "* Support for MTP Level 2 / MTP Level 3 interface boundary\n\n* Support for communication between Layer Management modules on SG and MGC\n\n* Support for management of SCTP active associations between the SG and MGC",
      "ja": "* MTPレベル2 / MTPレベル3インターフェイス境界のサポート\n\n* SGとMGCのレイヤー管理モジュール間の通信のサポート\n\n* SGとMGCの間のSCTPアクティブ関連の管理のサポート"
    },
    {
      "indent": 3,
      "text": "The SG will terminate up to MTP Level 2 and the MGC will terminate MTP Level 3 and above. In other words, the SG will transport MTP Level 3 messages over an IP network to a MGC.",
      "ja": "SGはMTPレベル2まで終了し、MGCはMTPレベル3以上を終了します。言い換えれば、SGはMTPレベル3メッセージをIPネットワークを介してMGCに輸送します。"
    },
    {
      "indent": 0,
      "text": "1.2 Terminology",
      "section_title": true,
      "ja": "1.2 用語"
    },
    {
      "indent": 3,
      "text": "Application Server (AS) - A logical entity serving a specific application instance. An example of an Application Server is a MGC handling the MTP Level 3 and call processing for SS7 links terminated by the Signalling Gateways. Practically speaking, an AS is modeled at the SG as an ordered list of one or more related Application Server Processes (e.g., primary, secondary, tertiary, ...).",
      "ja": "Application Server（AS） - 特定のアプリケーションインスタンスにサービスを提供する論理エンティティ。アプリケーションサーバーの例は、MTPレベル3を処理するMGCと、信号ゲートウェイによって終了したSS7リンクの呼び出し処理です。実際に言えば、AはSGで1つ以上の関連アプリケーションサーバープロセスの順序リストとしてモデル化されています（例：プライマリ、セカンダリ、三次、...）。"
    },
    {
      "indent": 3,
      "text": "Application Server Process (ASP) - A process instance of an Application Server. Examples of Application Server Processes are active or standby MGC instances.",
      "ja": "アプリケーションサーバープロセス（ASP） - アプリケーションサーバーのプロセスインスタンス。アプリケーションサーバープロセスの例は、アクティブまたはスタンバイMGCインスタンスです。"
    },
    {
      "indent": 3,
      "text": "Association - An association refers to a SCTP association. The association will provide the transport for the delivery of protocol data units for one or more interfaces.",
      "ja": "協会 - 協会はSCTP協会を指します。協会は、1つ以上のインターフェイスのプロトコルデータユニットの配信のための輸送を提供します。"
    },
    {
      "indent": 3,
      "text": "Backhaul - Refers to the transport of signalling from the point of interface for the associated data stream (i.e., SG function in the MGU) back to the point of call processing (i.e., the MGCU), if this is not local [9].",
      "ja": "バックホール - 関連するデータストリーム（つまり、MGUのSG関数）のインターフェイスポイントからのシグナリングの輸送を、これがローカルでない場合、コール処理ポイント（つまり、MGCU）に戻ります[9]。"
    },
    {
      "indent": 3,
      "text": "Fail-over - The capability to reroute signalling traffic as required to an alternate Application Server Process within an Application Server in the event of failure or unavailability of a currently used Application Server Process. Fail-back MAY apply upon the return to service of a previously unavailable Application Server Process.",
      "ja": "フェールオーバー - 障害または現在使用されているアプリケーションサーバープロセスの利用不能の場合に、アプリケーションサーバー内の代替アプリケーションサーバープロセスに必要な信号トラフィックを再ルーティングする機能。フェールバックは、以前に利用できなかったアプリケーションサーバープロセスのサービスに戻ると適用される場合があります。"
    },
    {
      "indent": 3,
      "text": "Host - The computing platform that the ASP process is running on.",
      "ja": "ホスト -  ASPプロセスが実行されているコンピューティングプラットフォーム。"
    },
    {
      "indent": 3,
      "text": "Interface - For the purposes of this document, an interface is a SS7 signalling link.",
      "ja": "インターフェイス - このドキュメントの目的のために、インターフェイスはSS7シグナリングリンクです。"
    },
    {
      "indent": 3,
      "text": "Interface Identifier - The Interface Identifier identifies the physical interface at the SG for which the signalling messages are sent/received. The format of the Interface Identifier parameter can be text or integer, the values of which are assigned according to network operator policy. The values used are of local significance only, coordinated between the SG and ASP.",
      "ja": "インターフェイス識別子 - インターフェイス識別子は、信号メッセージが送信/受信されるSGの物理インターフェイスを識別します。インターフェイス識別子パラメーターの形式はテキストまたは整数であり、その値はネットワークオペレーターポリシーに従って割り当てられます。使用される値は、SGとASPの間で調整された局所的な重要性のみです。"
    },
    {
      "indent": 3,
      "text": "Layer Management - Layer Management is a nodal function in an SG or ASP that handles the inputs and outputs between the M2UA layer and a local management entity.",
      "ja": "レイヤー管理 - レイヤー管理は、M2UA層とローカル管理エンティティの間の入力と出力を処理するSGまたはASPの節点関数です。"
    },
    {
      "indent": 3,
      "text": "Link Key - The link key is a locally unique (between ASP and SG) value that identifies a registration request for a particular Signalling Data Link and Signalling Terminal pair.",
      "ja": "リンクキー - リンクキーは、特定のシグナリングデータリンクとシグナリング端子ペアの登録要求を識別するローカルに一意の（ASPとSGの間）値です。"
    },
    {
      "indent": 3,
      "text": "MTP - The Message Transfer Part of the SS7 protocol",
      "ja": "MTP -SS7プロトコルのメッセージ転送部分"
    },
    {
      "indent": 3,
      "text": "MTP2 - MTP Level 2, the signalling data link layer of SS7",
      "ja": "MTP2 -MTPレベル2、SS7のシグナリングデータリンクレイヤー"
    },
    {
      "indent": 3,
      "text": "MTP3 - MTP Level 3, the signalling network layer of SS7",
      "ja": "MTP3 -MTPレベル3、SS7のシグナリングネットワークレイヤー"
    },
    {
      "indent": 3,
      "text": "MTP2-User - A protocol that uses the services of MTP Level 2 (i.e. MTP3).",
      "ja": "MTP2 -USER -MTPレベル2のサービスを使用するプロトコル（つまり、MTP3）。"
    },
    {
      "indent": 3,
      "text": "Network Byte Order: Most significant byte first, a.k.a Big Endian.",
      "ja": "ネットワークバイトの順序：最も重要なバイト最初、別名Big Endian。"
    },
    {
      "indent": 3,
      "text": "Signalling Data Link - An SDL refers to a specific communications facility that connects two Signalling Link Terminals.",
      "ja": "シグナリングデータリンク-SDLは、2つのシグナリングリンク端子を接続する特定の通信施設を指します。"
    },
    {
      "indent": 3,
      "text": "Signalling Gateway (SG) - An SG is a signalling agent at the edge of the IP network. An SG appears to the SS7 as one or more Signalling Link Terminals that are connected to one or more Signalling Data Links in the SS7 network. An SG contains a set of one or more unique Signalling Gateway Processes, on which one or more is normally actively processing traffic. Where an SG contains more than one SGP, the SG is a logical entity.",
      "ja": "Signaling Gateway（SG）-SGは、IPネットワークの端にあるシグナル伝達剤です。SGは、SS7ネットワークの1つ以上のシグナルデータリンクに接続されている1つまたは複数のシグナルリンク端子としてSS7に表示されます。SGには、1つ以上の一意のシグナリングゲートウェイプロセスのセットが含まれており、1つ以上の1つ以上が通常、トラフィックをアクティブに処理します。SGに複数のSGPが含まれている場合、SGは論理エンティティです。"
    },
    {
      "indent": 3,
      "text": "Signalling Gateway Process (SGP) - A process instance that uses M2UA to communicate to and from a Signalling Link Terminal. It serves as an active, backup or load-sharing process of a Signalling Gateway.",
      "ja": "Signaling Gateway Process（SGP） -  M2UAを使用して信号リンク端子と通信するプロセスインスタンス。これは、信号ゲートウェイのアクティブ、バックアップ、または負荷共有プロセスとして機能します。"
    },
    {
      "indent": 3,
      "text": "Signalling Link Terminal (SLT) - Refers to the means of performing all of the functions defined at MTP level 2 regardless of their implementation [2,3].",
      "ja": "シグナリングリンク端子（SLT） - 実装に関係なく、MTPレベル2で定義されたすべての機能を実行する手段を指します[2,3]。"
    },
    {
      "indent": 3,
      "text": "Stream - A stream refers to an SCTP stream; a unidirectional logical channel established from one SCTP endpoint to another associated SCTP endpoint, within which all user messages are delivered in-sequence except for those submitted to the unordered delivery service.",
      "ja": "ストリーム - ストリームはSCTPストリームを指します。あるSCTPエンドポイントから別の関連するSCTPエンドポイントに確立された単方向論理チャネル。内部では、すべてのユーザーメッセージが順序付けられていない配信サービスに提出されたものを除き、シーケンスで配信されます。"
    },
    {
      "indent": 0,
      "text": "1.3 M2UA Overview",
      "section_title": true,
      "ja": "1.3 M2UAの概要"
    },
    {
      "indent": 3,
      "text": "The framework architecture that has been defined for SCN signalling transport over IP [9] uses two components: a signalling common transport protocol and an adaptation module to support the services expected by a particular SCN signalling protocol from its underlying protocol layer.",
      "ja": "IPを介したSCNシグナル伝達輸送用に定義されているフレームワークアーキテクチャ[9]は、2つのコンポーネントを使用します。シグナリング共通輸送プロトコルと適応モジュールを使用して、基礎となるプロトコル層から特定のSCNシグナリングプロトコルによって期待されるサービスをサポートします。"
    },
    {
      "indent": 3,
      "text": "Within this framework architecture, this document defines a SCN adaptation module that is suitable for the transport of SS7 MTP2 User messages. The only SS7 MTP2 User is MTP3. The M2UA uses the services of the Stream Control Transmission Protocol [8] as the underlying reliable signalling common transport protocol.",
      "ja": "このフレームワークアーキテクチャ内では、このドキュメントでは、SS7 MTP2ユーザーメッセージの輸送に適したSCN適応モジュールを定義しています。唯一のSS7 MTP2ユーザーはMTP3です。M2UAは、基礎となる信頼できるシグナリング共通輸送プロトコルとして、ストリーム制御伝送プロトコル[8]のサービスを使用しています。"
    },
    {
      "indent": 3,
      "text": "In a Signalling Gateway, it is expected that the SS7 MTP2-User signalling is transmitted and received from the PSTN over a standard SS7 network interface, using the SS7 Message Transfer Part Level 1 and Level 2 [2,3,4] to provide reliable transport of the MTP3-User signalling messages to and from an SS7 Signalling End Point (SEP) or Signalling Transfer Point (STP). The SG then provides an interworking of transport functions with the IP transport, in order to transfer the MTP2-User signalling messages to and from an Application Server Process where the peer MTP2-User protocol layer exists.",
      "ja": "シグナリングゲートウェイでは、SS7 MTP2ユーザーシグナル伝達が標準のSS7ネットワークインターフェイスを介してPSTNから送信および受信されると予想されます。SS7シグナル伝達エンドポイント（SEP）またはシグナル伝達ポイント（STP）との間で、MTP3ユーザーシグナリングメッセージの輸送。次に、SGは、ピアMTP2ユーザープロトコル層が存在するアプリケーションサーバープロセスにMTP2ユーザーシグナリングメッセージを転送するために、IPトランスポートとの輸送機能の相互作用を提供します。"
    },
    {
      "indent": 0,
      "text": "1.3.1 Example - SG to MGC",
      "section_title": true,
      "ja": "1.3.1 例-SGからMGC"
    },
    {
      "indent": 3,
      "text": "In a Signalling Gateway, it is expected that the SS7 signalling is received over a standard SS7 network termination, using the SS7 Message Transfer Part (MTP) to provide transport of SS7 signalling messages to and from an SS7 Signalling End Point (SEP) or SS7 Signalling Transfer Point (STP). In other words, the SG acts as a Signalling Link Terminal (SLT) [2,3]. The SG then provides an interworking of transport functions with IP Signalling Transport, in order to transport the MTP3 signalling messages to the MGC where the peer MTP3 protocol layer exists, as shown below:",
      "ja": "シグナリングゲートウェイでは、SS7メッセージ転送パーツ（MTP）を使用して、SS7メッセージ転送パーツ（MTP）を使用して、SS7シグナル伝達メッセージをSS7シグナル伝達エンドポイント（SEP）またはSS7からの輸送を提供するSS7シグナル伝達が標準のSS7ネットワーク終了を介して受信されることが予想されます。シグナル伝達転送点（STP）。言い換えれば、SGはシグナルリンク端子（SLT）[2,3]として機能します。次に、SGは、以下に示すように、PEER MTP3プロトコル層が存在するMGCにMTP3シグナリングメッセージを輸送するために、IPシグナル伝達輸送との輸送機能の相互作用を提供します。"
    },
    {
      "indent": 7,
      "text": "******    SS7    ******      IP     *******\n*SEP *-----------* SG *-------------* MGC *\n******           ******             *******",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "+----+                              +----+\n|S7UP|                              |S7UP|\n+----+                              +----+\n|MTP +                              |MTP |\n| L3 |            (NIF)             |L3  |\n+----+         +----+----+          +----+\n|MTP |         |MTP |M2UA|          |M2UA|\n|    |         |    +----+          +----+\n|L2  |         |L2  |SCTP|          |SCTP|\n|L1  |         |L1  +----+          +----+\n|    |         |    |IP  |          |IP  |\n+----+         +---------+          +----+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "NIF - Nodal Interworking Function SEP - SS7 Signalling Endpoint IP - Internet Protocol SCTP - Stream Control Transmission Protocol (Reference [8])",
      "ja": "NIF -NODALインターワーキング機能SEP -SS7シグナル伝達エンドポイントIP -Internet Protocol SCTP -Stream Control Transmission Protocol（参照[8]）"
    },
    {
      "indent": 11,
      "text": "Figure 1 M2UA in the SG to MGC Application",
      "ja": "図1 SGからMGCアプリケーションのM2UA"
    },
    {
      "indent": 3,
      "text": "Note: STPs MAY be present in the SS7 path between the SEP and the SG.",
      "ja": "注：STPは、SEPとSGの間のSS7パスに存在する場合があります。"
    },
    {
      "indent": 3,
      "text": "It is recommended that the M2UA use the services of the Stream Control Transmission Protocol (SCTP) [8] as the underlying reliable common signalling transport protocol. The use of SCTP provides the following features:",
      "ja": "M2UAは、基礎となる信頼できる共通シグナル伝達輸送プロトコルとして、Stream Control Transmission Protocol（SCTP）[8]のサービスを使用することをお勧めします。SCTPの使用は、次の機能を提供します。"
    },
    {
      "indent": 3,
      "text": "- explicit packet-oriented delivery (not stream-oriented) - sequenced delivery of user messages within multiple streams, with an option for order-of-arrival delivery of individual user messages, - optional multiplexing of user messages into SCTP datagrams,",
      "ja": "- 明示的なパケット指向の配信（ストリーム指向ではない） - 個々のユーザーメッセージの順序配信の順序付けのオプションを備えた複数のストリーム内のユーザーメッセージのシーケンスされた配信 - ユーザーメッセージのSCTPデータグラムへのオプションの多重化、"
    },
    {
      "indent": 3,
      "text": "- network-level fault tolerance through the support of multi-homing at either or both ends of an association, - resistance to flooding and masquerade attacks, and - data segmentation to conform to discovered path MTU size",
      "ja": "- 関連性のいずれかまたは両端でのマルチホーミングのサポート、洪水および仮面舞踏会攻撃に対する抵抗、および発見された経路MTUサイズに準拠するデータセグメンテーションを通じてのネットワークレベルの断層トレランス"
    },
    {
      "indent": 3,
      "text": "There are scenarios without redundancy requirements and scenarios in which redundancy is supported below the transport layer. In these cases, the SCTP functions above MAY NOT be a requirement and TCP can be used as the underlying common transport protocol.",
      "ja": "冗長性要件のないシナリオと、輸送層の下で冗長性がサポートされるシナリオがあります。これらの場合、上記のSCTP関数は要件ではなく、TCPは基礎となる一般的な輸送プロトコルとして使用できます。"
    },
    {
      "indent": 0,
      "text": "1.3.2 ASP Fail-over Model and Terminology",
      "section_title": true,
      "ja": "1.3.2 ASPフェールオーバーモデルと用語"
    },
    {
      "indent": 3,
      "text": "The M2UA layer supports ASP fail-over functions in order to support a high availability of call and transaction processing capability. All MTP2-User messages incoming to a SGP from the SS7 network are assigned to the unique Application Server, based on the Interface Identifier of the message.",
      "ja": "M2UAレイヤーは、通話およびトランザクション処理機能の高度な可用性をサポートするために、ASPフェイルオーバー関数をサポートします。SS7ネットワークからSGPに着信するすべてのMTP2ユーザーメッセージは、メッセージのインターフェイス識別子に基づいて、一意のアプリケーションサーバーに割り当てられます。"
    },
    {
      "indent": 3,
      "text": "The M2UA layer supports a n+k redundancy model (active-standby, load sharing, broadcast) where n is the minimum number of redundant ASPs required to handle traffic and k ASPs are available to take over for a failed or unavailable ASP. Note that 1+1 active/standby redundancy is a subset of this model. A simplex 1+0 model is also supported as a subset, with no ASP redundancy.",
      "ja": "M2UA層は、N K冗長モデル（アクティブスタンド、負荷共有、ブロードキャスト）をサポートします。ここで、Nはトラフィックを処理するために必要な冗長ASPの最小数であり、K ASPは失敗または利用できないASPのために引き継ぐことができます。1 1アクティブ/スタンバイ冗長性は、このモデルのサブセットであることに注意してください。シンプレックス1 0モデルもサブセットとしてサポートされており、ASP冗長性はありません。"
    },
    {
      "indent": 0,
      "text": "1.3.3 Client/Server Model",
      "section_title": true,
      "ja": "1.3.3 クライアント/サーバーモデル"
    },
    {
      "indent": 3,
      "text": "It is recommended that the SGP and ASP be able to support both client and server operation. The peer endpoints using M2UA SHOULD be configured so that one always takes on the role of client and the other the role of server for initiating SCTP associations. The default orientation would be for the SGP to take on the role of server while the ASP is the client. In this case, ASPs SHOULD initiate the SCTP association to the SGP.",
      "ja": "SGPとASPは、クライアントとサーバーの両方の操作をサポートできることをお勧めします。M2UAを使用したピアエンドポイントを構成して、1つが常にクライアントの役割を引き受けるように設定する必要があります。デフォルトのオリエンテーションは、ASPがクライアントである間、SGPがサーバーの役割を引き受けることです。この場合、ASPはSCTP協会をSGPに開始する必要があります。"
    },
    {
      "indent": 3,
      "text": "The SCTP and TCP Registered User Port Number Assignment for M2UA is 2904.",
      "ja": "M2UAのSCTPおよびTCP登録ユーザーポート番号の割り当ては2904です。"
    },
    {
      "indent": 0,
      "text": "1.4 Services Provided by the M2UA Adaptation Layer",
      "section_title": true,
      "ja": "1.4 M2UA適応層が提供するサービス"
    },
    {
      "indent": 3,
      "text": "The SS7 MTP3/MTP2(MTP2-User) interface is retained at the termination point in the IP network, so that the M2UA protocol layer is required to provide the equivalent set of services to its users as provided by the MTP Level 2 to MTP Level 3.",
      "ja": "SS7 MTP3/MTP2（MTP2-USER）インターフェイスはIPネットワークの終了点で保持されるため、M2UAプロトコル層は、MTPレベル2からMTPレベルまでのサービスセットをユーザーに提供するために必要です。3。"
    },
    {
      "indent": 0,
      "text": "1.4.1 Support for MTP Level 2 / MTP Level 3 interface boundary",
      "section_title": true,
      "ja": "1.4.1 MTPレベル2 / MTPレベル3インターフェイス境界のサポート"
    },
    {
      "indent": 3,
      "text": "M2UA supports a MTP Level 2 / MTP Level 3 interface boundary that enables a seamless, or as seamless as possible, operation of the MTP2-User peers in the SS7 and IP domains. An example of the primitives that need to be supported can be found in [10].",
      "ja": "M2UAは、SS7およびIPドメインのMTP2ユーザーピアの操作を可能にするシームレスまたはシームレスを可能にするMTPレベル2 / MTPレベル3インターフェイス境界をサポートします。サポートする必要があるプリミティブの例は、[10]に記載されています。"
    },
    {
      "indent": 0,
      "text": "1.4.2 Support for communication between Layer Management modules on SG and MGC",
      "section_title": true,
      "ja": "1.4.2 SGとMGCのレイヤー管理モジュール間の通信のサポート"
    },
    {
      "indent": 3,
      "text": "The M2UA layer needs to provide some messages that will facilitate communication between Layer Management modules on the SG and MGC. To facilitate reporting of errors that arise because of the backhauling MTP Level 3 scenario, the following primitive is defined:",
      "ja": "M2UAレイヤーは、SGとMGCのレイヤー管理モジュール間の通信を容易にするメッセージを提供する必要があります。MTPレベル3のシナリオをバックホールするために発生するエラーの報告を容易にするために、次の原始が定義されています。"
    },
    {
      "indent": 3,
      "text": "M-ERROR",
      "ja": "m-error"
    },
    {
      "indent": 3,
      "text": "The M-ERROR message is used to indicate an error with a received M2UA message (e.g., an interface identifier value is not known to the SG).",
      "ja": "m-errorメッセージは、受信したM2UAメッセージを使用したエラーを示すために使用されます（たとえば、SGにはインターフェイス識別子値が知られていません）。"
    },
    {
      "indent": 0,
      "text": "1.4.3 Support for management of active associations between SG and MGC",
      "section_title": true,
      "ja": "1.4.3 SGとMGCの間のアクティブな関連の管理のためのサポート"
    },
    {
      "indent": 3,
      "text": "The M2UA layer on the SG keeps the state of the configured ASPs. A set of primitives between M2UA layer and the Layer Management are defined below to help the Layer Management manage the association(s) between the SG and the MGC. The M2UA layer can be instructed by the Layer Management to establish a SCTP association to a peer M2UA node. This procedure can be achieved using the M-SCTP ESTABLISH primitive.",
      "ja": "SG上のM2UA層は、構成されたASPの状態を維持します。M2UA層とレイヤー管理の間の一連のプリミティブを以下に定義して、層管理がSGとMGCの間の関連性を管理するのに役立ちます。M2UA層は、レイヤー管理によって指示され、SCTP関連をピアM2UAノードに確立することができます。この手順は、M-SCTP確立の原始を使用して達成できます。"
    },
    {
      "indent": 3,
      "text": "M-SCTP_ESTABLISH",
      "ja": "M-SCTP_ESTABLISH"
    },
    {
      "indent": 3,
      "text": "The M-SCTP_ESTABLISH primitive is used to request, indicate and confirm the establishment of a SCTP association to a peer M2UA node.",
      "ja": "M-SCTP_ESTABLISH PRIMITITITは、ピアM2UAノードへのSCTP関連の確立を要求、示し、確認するために使用されます。"
    },
    {
      "indent": 3,
      "text": "M-SCTP_RELEASE",
      "ja": "M-SCTP_RELEASE"
    },
    {
      "indent": 3,
      "text": "The M-SCTP_RELEASE primitives are used to request, indicate, and confirm the release of a SCTP association to a peer M2UA node.",
      "ja": "M-SCTP_RELEASE Primitivesは、SCTPアソシエーションのピアM2UAノードへのリリースを要求、示し、確認するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The M2UA layer MAY also need to inform the status of the SCTP association(s) to the Layer Management. This can be achieved using the following primitive.",
      "ja": "M2UAレイヤーは、SCTP協会のステータスをレイヤー管理に通知する必要がある場合もあります。これは、次の原始を使用して実現できます。"
    },
    {
      "indent": 3,
      "text": "M-SCTP_STATUS",
      "ja": "m-sctp_status"
    },
    {
      "indent": 3,
      "text": "The M-SCTP_STATUS primitive is used to request and indicate the status of underlying SCTP association(s).",
      "ja": "M-SCTP_STATUSプリミティブは、基礎となるSCTP協会のステータスを要求して示すために使用されます。"
    },
    {
      "indent": 3,
      "text": "The Layer Management MAY need to inform the M2UA layer of an AS/ASP status (i.e., failure, active, etc.), so that messages can be exchanged between M2UA layer peers to stop traffic to the local M2UA user. This can be achieved using the following primitive.",
      "ja": "レイヤー管理は、AS/ASPステータスのM2UAレイヤー（つまり、障害、アクティブなど）の通知する必要がある場合があります。そのため、M2UA層ピア間でメッセージを交換して、ローカルM2UAユーザーへのトラフィックを停止できます。これは、次の原始を使用して実現できます。"
    },
    {
      "indent": 3,
      "text": "M-ASP_STATUS",
      "ja": "M-ASP_STATUS"
    },
    {
      "indent": 3,
      "text": "The ASP status is stored inside the M2UA layer on both the SG and MGC sides. The M-ASP_STATUS primitive can be used by Layer Management to request the status of the Application Server Process from the M2UA layer. This primitive can also be used to indicate the status of the Application Server Process.",
      "ja": "ASPステータスは、SG側とMGC側の両方のM2UA層内に保存されます。M-ASP_STATUSプリミティブは、レイヤー管理によって使用され、M2UAレイヤーからアプリケーションサーバープロセスのステータスを要求できます。このプリミティブは、アプリケーションサーバープロセスのステータスを示すためにも使用できます。"
    },
    {
      "indent": 3,
      "text": "M-ASP_MODIFY",
      "ja": "m-asp_modify"
    },
    {
      "indent": 3,
      "text": "The M-ASP_MODIFY primitive can be used by Layer Management to modify the status of the Application Server Process. In other words, the Layer Management on the ASP side uses this primitive to initiate the ASPM procedures.",
      "ja": "M-ASP_Modify Primitiveは、レイヤー管理によって使用され、アプリケーションサーバープロセスのステータスを変更できます。言い換えれば、ASP側のレイヤー管理は、この原始を使用してASPM手順を開始します。"
    },
    {
      "indent": 3,
      "text": "M-AS_STATUS",
      "ja": "m-as_status"
    },
    {
      "indent": 3,
      "text": "The M-AS_STATUS primitive can be used by Layer Management to request the status of the Application Server. This primitive can also be used to indicate the status of the Application Server.",
      "ja": "M-AS_STATUSプリミティブは、アプリケーションサーバーのステータスを要求するためにレイヤー管理によって使用できます。このプリミティブは、アプリケーションサーバーのステータスを示すためにも使用できます。"
    },
    {
      "indent": 0,
      "text": "1.5 Functions Provided by the M2UA Layer",
      "section_title": true,
      "ja": "1.5 M2UAレイヤーによって提供される関数"
    },
    {
      "indent": 0,
      "text": "1.5.1 Mapping",
      "section_title": true,
      "ja": "1.5.1 マッピング"
    },
    {
      "indent": 3,
      "text": "The M2UA layer MUST maintain a map of an Interface ID to a physical interface on the Signalling Gateway. A physical interface would be a V.35 line, T1 line/time slot, E1 line/time slot, etc. The M2UA layer MUST also maintain a map of the Interface Identifier to SCTP association and to the related stream within the association.",
      "ja": "M2UAレイヤーは、シグナリングゲートウェイの物理インターフェイスにインターフェイスIDのマップを維持する必要があります。物理インターフェイスは、V.35ライン、T1ライン/タイムスロット、E1ライン/タイムスロットなどです。M2UAレイヤーは、SCTPアソシエーションおよび関連する関連ストリームのインターフェイス識別子のマップも維持する必要があります。"
    },
    {
      "indent": 3,
      "text": "The SGP maps an Interface Identifier to an SCTP association/stream only when an ASP sends an ASP Active message for a particular Interface Identifier. It must be noted, however, that this mapping is dynamic and could change at any time due to a change of ASP state. This mapping could even temporarily be invalid, for example during fail-over of one ASP to another. Therefore, the SGP MUST maintain the states of AS/ASP and reference them during the routing of any messages to an AS/ASP.",
      "ja": "SGPは、ASPが特定のインターフェイス識別子にASPアクティブメッセージを送信する場合にのみ、SCTPアソシエーション/ストリームにインターフェイス識別子をマッピングします。ただし、このマッピングは動的であり、ASP状態の変更によりいつでも変更される可能性があることに注意する必要があります。このマッピングは、たとえば、あるASPが別のASPに失敗したときに、一時的に無効である可能性があります。したがって、SGPはAS/ASPの状態を維持し、AS/ASPへのメッセージのルーティング中にそれらを参照する必要があります。"
    },
    {
      "indent": 3,
      "text": "Note that only one SGP SHOULD provide Signalling Link Terminal services to an SS7 link. Therefore, within an SG, an Application Server SHOULD be active for only one SGP at any given point in time.",
      "ja": "SS7リンクに信号リンク端子サービスを提供するSGPは1つだけであることに注意してください。したがって、SG内では、アプリケーションサーバーは、特定の時点で1つのSGPのみでアクティブになる必要があります。"
    },
    {
      "indent": 3,
      "text": "An example of the logical view of the relationship between an SS7 link, Interface Identifier, AS and ASP in an SGP is shown below:",
      "ja": "SS7リンク、インターフェイス識別子、AS、およびSGPのASP間の関係の論理的ビューの例を以下に示します。"
    },
    {
      "indent": 3,
      "text": "            /-------------------------------------------------+\n           /   /----------------------------------------------|--+\n          /   /                                               v  |\n         /   /    +----+             act+-----+   +-------+ -+--+|-+-\nSS7 link1-------->|IID |-+          +-->| ASP |-->| Assoc |      v\n           /      +----+ |  +----+  |   +-----+   +-------+ -+--+--+-\n          /              +->| AS |--+                        Streams\n         /        +----+ |  +----+   stb+-----+\nSS7 link2-------->|IID |-+              | ASP |\n                  +----+                +-----+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "where IID = Interface Identifier",
      "ja": "ここで、IID =インターフェイス識別子"
    },
    {
      "indent": 3,
      "text": "A SGP MAY support more than one AS. An AS MAY support more than one Interface Identifier.",
      "ja": "SGPは複数のASをサポートする場合があります。Aは、複数のインターフェイス識別子をサポートする場合があります。"
    },
    {
      "indent": 0,
      "text": "1.5.2 Support for the management of SCTP associations between the SGPs and ASPs",
      "section_title": true,
      "ja": "1.5.2 SGPとASPの間のSCTP関連の管理へのサポート"
    },
    {
      "indent": 3,
      "text": "The M2UA layer at the SG maintains the availability state of all configured ASPs, in order to manage the SCTP associations and the traffic between the SG and ASPs. As well, the active/inactive state of remote ASP(s) are also maintained. The Active ASP(s) are the one(s) currently receiving traffic from the SG.",
      "ja": "SGのM2UA層は、SCTP関連とSGとASPの間のトラフィックを管理するために、構成されたすべてのASPの可用性状態を維持します。同様に、リモートASPのアクティブ/非アクティブ状態も維持されます。アクティブなASPは、現在SGからトラフィックを受け取っているものです。"
    },
    {
      "indent": 3,
      "text": "The M2UA layer MAY be instructed by local management to establish an SCTP association to a peer M2UA node. This can be achieved using the M-SCTP_ESTABLISH primitive to request, indicate and confirm the establishment of an SCTP association with a peer M2UA node.",
      "ja": "M2UA層は、PEER M2UAノードへのSCTP関連を確立するようにローカル管理者によって指示される場合があります。これは、M-SCTP_ESTABLISH PRIMITITITを使用して実現して、ピアM2UAノードとのSCTP関連の確立を要求、示し、確認することができます。"
    },
    {
      "indent": 3,
      "text": "The M2UA layer MAY also need to inform local management of the status of the underlying SCTP associations using the M-SCTP_STATUS request and the indication primitive. For example, the M2UA MAY inform local management of the reason for the release of an SCTP association, determined either locally within the M2UA layer or by a primitive from the SCTP.",
      "ja": "M2UA層は、M-SCTP_STATUSリクエストと表示原始を使用して、基礎となるSCTP関連のステータスを現地管理に通知する必要がある場合もあります。たとえば、M2UAは、M2UA層内またはSCTPからの原始によって局所的に決定されるSCTP関連のリリースの理由をローカルマネジメントに通知する場合があります。"
    },
    {
      "indent": 3,
      "text": "Also the M2UA layer may need to inform the local management of the change in status of an ASP or AS. This may be achieved using the M-ASP STATUS request or M-AS_STATUS request primitives.",
      "ja": "また、M2UA層は、ASPまたはASのステータスの変更をローカル管理に通知する必要がある場合があります。これは、M-ASPステータスリクエストまたはM-AS_STATUSリクエストプリミティブを使用して達成できます。"
    },
    {
      "indent": 0,
      "text": "1.5.3 Status of ASPs",
      "section_title": true,
      "ja": "1.5.3 ASPのステータス"
    },
    {
      "indent": 3,
      "text": "The M2UA layer on the SG MUST maintain the state of the ASPs it is supporting. The state of an ASP changes because of the reception of peer-to-peer messages (ASPM messages as described in Section 3.3.2) or the reception of indications from the local SCTP association. The ASP state transition procedures are described in Section 4.3.1.",
      "ja": "SG上のM2UA層は、サポートしているASPの状態を維持する必要があります。ASPの状態は、ピアツーピアメッセージ（セクション3.3.2で説明されているASPMメッセージ）またはローカルSCTP協会からの適応症の受信のために変化します。ASP状態遷移手順については、セクション4.3.1で説明します。"
    },
    {
      "indent": 3,
      "text": "At a SGP, an Application Server list MAY contain active and inactive ASPs to support ASP fail-over procedures. When, for example, both a primary and a backup ASP are available, the M2UA peer protocol is required to control which ASP is currently active. The ordered list of ASPs within a logical Application Server is kept updated in the SGP to reflect the active Application Server Process.",
      "ja": "SGPでは、アプリケーションサーバーリストには、ASPフェイルオーバー手順をサポートするためのアクティブおよび非アクティブなASPが含まれている場合があります。たとえば、プライマリとバックアップASPの両方が利用可能な場合、M2UAピアプロトコルは、現在アクティブであるASPを制御するために必要です。論理アプリケーションサーバー内のASPの順序付けリストは、アクティブなアプリケーションサーバープロセスを反映するためにSGPで更新され続けます。"
    },
    {
      "indent": 3,
      "text": "Also the M2UA layer MAY need to inform the local management of the change in status of an ASP or AS. This can be achieved using the M-ASP_STATUS or M-AS_STATUS primitives.",
      "ja": "また、M2UA層は、ASPまたはASのステータスの変更をローカル管理に通知する必要がある場合があります。これは、M-ASP_STATUSまたはM-AS_STATUSプリミティブを使用して実現できます。"
    },
    {
      "indent": 0,
      "text": "1.5.4 SCTP Specifics",
      "section_title": true,
      "ja": "1.5.4 SCTP詳細"
    },
    {
      "indent": 0,
      "text": "1.5.4.1 SCTP Stream Management",
      "section_title": true,
      "ja": "1.5.4.1 SCTPストリーム管理"
    },
    {
      "indent": 3,
      "text": "SCTP allows a user specified number of streams to be opened during initialization of the association. It is the responsibility of the M2UA layer to ensure proper management of these streams. Because of the unidirectional nature of streams, a M2UA layer is not aware of the stream information from its peer M2UA layer. For this reason, the Interface Identifier is in the M2UA message header.",
      "ja": "SCTPを使用すると、協会の初期化中にユーザー指定のストリームを開くことができます。これらのストリームの適切な管理を確保することは、M2UA層の責任です。ストリームの単方向性のため、M2UA層は、ピアM2UA層からのストリーム情報を認識していません。このため、インターフェイス識別子はM2UAメッセージヘッダーにあります。"
    },
    {
      "indent": 3,
      "text": "The use of SCTP streams within M2UA is recommended in order to minimize transmission and buffering delay, thereby, improving the overall performance and reliability of the signalling elements. A separate SCTP stream can be used for each SS7 link. Or, an implementation may choose to split the SS7 link across several streams based on SLS. This method may be of particular interest for high speed SS7 links (MTP3b) since high speed links have a 24-bit sequence number and the stream sequence number is 16-bits.",
      "ja": "M2UA内のSCTPストリームの使用は、送信とバッファリングの遅延を最小限に抑えるために推奨され、それにより、シグナリング要素の全体的なパフォーマンスと信頼性が向上します。SS7リンクごとに別のSCTPストリームを使用できます。または、実装では、SLSに基づいていくつかのストリームにSS7リンクを分割することを選択する場合があります。この方法は、高速リンクの24ビットシーケンス番号があり、ストリームシーケンス番号は16ビットであるため、高速SS7リンク（MTP3B）に特に興味深い場合があります。"
    },
    {
      "indent": 3,
      "text": "SCTP Stream '0' SHOULD NOT be used for MTP2 User Adaptation (MAUP) messages (see Section 3) since stream '0' SHOULD only be used for ASP Management (ASPM) messages (see Section 4.3.3).",
      "ja": "SCTPストリーム '0'は、MTP2ユーザー適応（MAUP）メッセージ（セクション3を参照）に使用しないでください。Stream '0'はASP管理（ASPM）メッセージにのみ使用する必要があります（セクション4.3.3を参照）。"
    },
    {
      "indent": 0,
      "text": "1.5.5 Seamless SS7 Network Management Interworking",
      "section_title": true,
      "ja": "1.5.5 シームレスなSS7ネットワーク管理インターワーキング"
    },
    {
      "indent": 3,
      "text": "The M2UA layer on the SGP SHOULD pass an indication of unavailability of the M2UA-User (MTP3) to the local Layer Management, if the currently active ASP moves from the ACTIVE state. The actions taken by M2UA on the SGP with regards to MTP Level 2 should be in accordance with the appropriate MTP specifications.",
      "ja": "SGP上のM2UA層は、現在アクティブなASPがアクティブ状態から移動する場合、M2UAユーザー（MTP3）の利用不能（MTP3）をローカル層管理に渡す必要があります。MTPレベル2に関してSGPでM2UAが講じたアクションは、適切なMTP仕様に従っている必要があります。"
    },
    {
      "indent": 0,
      "text": "1.5.6 Flow Control / Congestion",
      "section_title": true,
      "ja": "1.5.6 フロー制御 /混雑"
    },
    {
      "indent": 3,
      "text": "It is possible for the M2UA layer to be informed of the IP network congestion onset and abatement by means of an implementation dependent function (i.e. an indication from the SCTP). The handling of this congestion indication by M2UA is implementation dependent. However, the actions taken by the SG should be in accordance with the appropriate MTP specification and should enable SS7 functionality (e.g. flow control) to be correctly maintained.",
      "ja": "M2UA層に、実装依存関数（つまり、SCTPからの表示）によってIPネットワークの混雑の開始と削減を通知することができます。M2UAによるこの輻輳兆候の取り扱いは、実装に依存しています。ただし、SGがとるアクションは、適切なMTP仕様に従って行われ、SS7機能（フロー制御など）を正しく維持できるようにする必要があります。"
    },
    {
      "indent": 0,
      "text": "1.5.7 Audit of SS7 Link State",
      "section_title": true,
      "ja": "1.5.7 SS7リンク状態の監査"
    },
    {
      "indent": 3,
      "text": "After a fail-over of one ASP to another ASP, it may be necessary for the M2UA on the ASP to audit the current SS7 link state to ensure consistency. The M2UA on the SGP would respond to the audit request with information regarding the current state of the SS7 link (i.e. in-service, out-of-service, congestion state, LPO/RPO state).",
      "ja": "あるASPが別のASPに失敗した後、ASPのM2UAが現在のSS7リンク状態を監査して一貫性を確保する必要があるかもしれません。SGPのM2UAは、SS7リンクの現状に関する情報（つまり、インサービス、サービス外、渋滞状態、LPO/RPO状態）を使用して監査リクエストに応答します。"
    },
    {
      "indent": 0,
      "text": "1.6 Definition of the M2UA Boundaries",
      "section_title": true,
      "ja": "1.6 M2UA境界の定義"
    },
    {
      "indent": 0,
      "text": "1.6.1 Definition of the M2UA / MTP Level 3 boundary",
      "section_title": true,
      "ja": "1.6.1 M2UA / MTPレベル3境界の定義"
    },
    {
      "indent": 3,
      "text": "DATA ESTABLISH RELEASE STATE DATA RETRIEVAL DATA RETRIEVAL COMPLETE",
      "ja": "データは、リリース状態データ検索データの検索を完了します"
    },
    {
      "indent": 0,
      "text": "1.6.2 Definition of the M2UA / MTP Level 2 boundary",
      "section_title": true,
      "ja": "1.6.2 M2UA / MTPレベル2境界の定義"
    },
    {
      "indent": 3,
      "text": "DATA ESTABLISH RELEASE STATE DATA RETRIEVAL DATA RETRIEVAL COMPLETE",
      "ja": "データは、リリース状態データ検索データの検索を完了します"
    },
    {
      "indent": 0,
      "text": "1.6.3 Definition of the Lower Layer Boundary between M2UA and SCTP",
      "section_title": true,
      "ja": "1.6.3 M2UAとSCTPの間の下層境界の定義"
    },
    {
      "indent": 3,
      "text": "The upper layer and layer management primitives provided by SCTP are provided in Reference [8] Section 10.",
      "ja": "SCTPが提供する上層および層管理プリミティブは、参照[8]セクション10に記載されています。"
    },
    {
      "indent": 0,
      "text": "1.6.4 Definition of Layer Management / M2UA Boundary",
      "section_title": true,
      "ja": "1.6.4 レイヤー管理 / M2UA境界の定義"
    },
    {
      "indent": 3,
      "text": "M-SCTP_ESTABLISH request Direction: LM -> M2UA Purpose: LM requests ASP to establish an SCTP association with an SGP.",
      "ja": "M -SCTP_ESTABLISHリクエスト方向：LM-> M2UA目的：LMは、SGPとSCTP関連を確立するようaspを要求します。"
    },
    {
      "indent": 3,
      "text": "M-SCTP_ESTABLISH confirm Direction: M2UA -> LM Purpose: ASP confirms to LM that it has established an SCTP association with an SGP.",
      "ja": "M -SCTP_ESTABLISHの確認方向：M2UA-> LM目的：ASPは、SGPとSCTP関連を確立したことをLMに確認します。"
    },
    {
      "indent": 3,
      "text": "M-SCTP_ESTABLISH indication Direction: M2UA -> LM Purpose: SGP informs LM that an ASP has established an SCTP association.",
      "ja": "M -SCTP_ESTABLISH表示方向：M2UA-> LM目的：SGPは、ASPがSCTP協会を設立したことをLMに通知します。"
    },
    {
      "indent": 3,
      "text": "M-SCTP_RELEASE request Direction: LM -> M2UA Purpose: LM requests ASP to release an SCTP association with SGP.",
      "ja": "M -SCTP_RELEASEリクエストの方向：LM-> M2UA目的：LMは、SGPとのSCTP関連をリリースするようにASPを要求します。"
    },
    {
      "indent": 3,
      "text": "M-SCTP_RELEASE confirm Direction: M2UA -> LM Purpose: ASP confirms to LM that it has released SCTP association with SGP.",
      "ja": "M -SCTP_RELEASEの確認方向：M2UA-> LM目的：ASPは、SCPとSGPとの関連をリリースしたことをLMに確認します。"
    },
    {
      "indent": 3,
      "text": "M-SCTP_RELEASE indication Direction: M2UA -> LM Purpose: SGP informs LM that ASP has released an SCTP association.",
      "ja": "M -SCTP_RELEASE表示方向：M2UA-> LM目的：SGPは、ASPがSCTP協会をリリースしたことをLMに通知します。"
    },
    {
      "indent": 3,
      "text": "M-SCTP_RESTART indication Direction: M2UA -> LM Purpose: M2UA informs LM that a SCTP Restart indication has been received.",
      "ja": "M -SCTP_RESTART表示方向：M2UA-> LM目的：M2UAはLMにSCTPの再起動指示が受信されたことを通知します。"
    },
    {
      "indent": 3,
      "text": "M-SCTP_STATUS request Direction: LM -> M2UA Purpose: LM requests M2UA to report status of SCTP association.",
      "ja": "M -SCTP_STATUSリクエスト方向：LM-> M2UA目的：LMは、M2UAにSCTP Associationのステータスを報告するよう要求します。"
    },
    {
      "indent": 3,
      "text": "M-SCTP_STATUS indication Direction: M2UA -> LM Purpose: M2UA reports status of SCTP association.",
      "ja": "M -SCTP_STATUS指示方向：M2UA-> LM目的：M2UAレポートSCTP Associationのステータス。"
    },
    {
      "indent": 3,
      "text": "M-ASP_STATUS request Direction: LM -> M2UA Purpose: LM requests SGP to report status of remote ASP.",
      "ja": "M -ASP_STATUSリクエスト方向：LM-> M2UA目的：LMは、SGPにリモートASPのステータスを報告するように要求します。"
    },
    {
      "indent": 3,
      "text": "M-ASP_STATUS indication Direction: M2UA -> LM Purpose: SGP reports status of remote ASP.",
      "ja": "M -ASP_STATUS指示方向：M2UA-> LM目的：SGPは、リモートASPのステータスを報告します。"
    },
    {
      "indent": 3,
      "text": "M-AS_STATUS request Direction: LM -> M2UA Purpose: LM requests SG to report status of AS.",
      "ja": "m -as_status要求方向：lm-> m2ua目的：lmは、sgにasのステータスを報告するように要求します。"
    },
    {
      "indent": 3,
      "text": "M-AS_STATUS indication Direction: M2UA -> LM Purpose: SG reports status of AS.",
      "ja": "M -AS_STATUS指示方向：M2UA-> LM目的：SGはASのステータスを報告します。"
    },
    {
      "indent": 3,
      "text": "M-NOTIFY indication Direction: M2UA -> LM Purpose: ASP reports that it has received a NOTIFY message from its peer.",
      "ja": "m -notify表示方向：M2UA-> lm目的：ASPは、ピアから通知メッセージを受信したと報告しています。"
    },
    {
      "indent": 3,
      "text": "M-ERROR indication Direction: M2UA -> LM Purpose: ASP or SGP reports that it has received an ERROR message from its peer.",
      "ja": "m -error表示方向：M2UA-> lm目的：ASPまたはSGPは、ピアからエラーメッセージを受信したと報告しています。"
    },
    {
      "indent": 3,
      "text": "M-ASP_UP request Direction: LM -> M2UA Purpose: LM requests ASP to start its operation and send an ASP UP message to the SGP.",
      "ja": "M -ASP_UP要求方向：LM-> M2UA目的：LMはASPの操作を開始し、SGPにASPアップメッセージを送信するよう要求します。"
    },
    {
      "indent": 3,
      "text": "M-ASP_UP confirm Direction: M2UA -> LM Purpose: ASP reports that it has received an ASP UP Acknowledgment message from the SGP.",
      "ja": "M -ASP_UP確認指示：M2UA-> LM目的：ASPは、SGPからASP Up Aumponedmentメッセージを受信したと報告しています。"
    },
    {
      "indent": 3,
      "text": "M-ASP_DOWN request Direction: LM -> M2UA Purpose: LM requests ASP to stop its operation and send an ASP DOWN message to the SGP.",
      "ja": "M -ASP_DOWNリクエスト方向：LM-> M2UA目的：LMは、ASPの操作を停止し、SGPにASPダウンメッセージを送信するよう要求します。"
    },
    {
      "indent": 3,
      "text": "M-ASP_DOWN confirm Direction: M2UA -> LM Purpose: ASP reports that is has received an ASP DOWN Acknowledgment message from the SGP.",
      "ja": "M -ASP_DOWNの確認指示：M2UA-> LM目的：ASPレポートは、SGPからASPダウン承認メッセージを受信しました。"
    },
    {
      "indent": 3,
      "text": "M-ASP_ACTIVE request Direction: LM -> M2UA Purpose: LM requests ASP to send an ASP ACTIVE message to the SGP.",
      "ja": "M -ASP_ACTIVEリクエストの方向：LM-> M2UA目的：LMは、ASPにASPアクティブメッセージをSGPに送信するよう要求します。"
    },
    {
      "indent": 3,
      "text": "M-ASP_ACTIVE confirm Direction: M2UA -> LM Purpose: ASP reports that is has received an ASP ACTIVE Acknowledgment message from the SGP.",
      "ja": "m -asp_activeの確認方向：M2UA-> lm目的：ASPレポートは、SGPからASPアクティブな確認メッセージを受信しました。"
    },
    {
      "indent": 3,
      "text": "M-ASP_INACTIVE request Direction: LM -> M2UA Purpose: LM requests ASP to send an ASP INACTIVE message to the SGP.",
      "ja": "M -ASP_INACTIVEリクエストの方向：LM-> M2UA目的：LMは、ASPにSGPにASPの非アクティブメッセージを送信するよう要求します。"
    },
    {
      "indent": 3,
      "text": "M-ASP_INACTIVE confirm Direction: M2UA -> LM Purpose: ASP reports that is has received an ASP INACTIVE Acknowledgment message from the SGP.",
      "ja": "m -asp_inactiveの確認方向：M2UA-> lm目的：ASPレポートは、SGPからASPの非アクティブな承認メッセージを受け取っています。"
    },
    {
      "indent": 3,
      "text": "M-LINK_KEY_REG Request Direction: LM -> M2UA Purpose: LM requests ASP to register Link Key with SG by sending REG REQ message.",
      "ja": "m -link_key_regリクエスト方向：lm-> m2ua目的：lm要求は、reg reqメッセージを送信して、sgにリンクキーを登録します。"
    },
    {
      "indent": 3,
      "text": "M-LINK_KEY_REG Confirm Direction: M2UA -> LM Purpose: ASP reports to LM that it has successfully received a REG RSP message from SG.",
      "ja": "m -link_key_regの確認方向：M2UA-> lm目的：ASPは、sgからREG RSPメッセージを正常に受信したことをLMに報告します。"
    },
    {
      "indent": 3,
      "text": "M-LINK_KEY_REG Indication Direction: M2UA -> LM Purpose: SG reports to LM that it has successfully processed an incoming REG REQ message from ASP.",
      "ja": "m -link_key_reg指示方向：M2UA-> lm目的：SGは、ASPからの着信Reg Reqメッセージの処理に正常に処理されたことをLMに報告します。"
    },
    {
      "indent": 3,
      "text": "M-LINK_KEY_DEREG Request Direction: LM -> M2UA Purpose: LM requests ASP to de-register Link Key with SG by sending DEREG REQ message.",
      "ja": "m-link_key_dereg要求方向：lm-> m2ua目的：lmは、dereg reqメッセージを送信して、sgでリンクキーを登録するためのASPを要求します。"
    },
    {
      "indent": 3,
      "text": "M-LINK_KEY_DEREG Confirm Direction: M2UA -> LM Purpose: ASP reports to LM that it has successfully received a DEREG RSP message from SG.",
      "ja": "m -link_key_deregの指示の確認：M2UA-> lm目的：ASPは、SGからDereg RSPメッセージを正常に受信したことをLMに報告します。"
    },
    {
      "indent": 3,
      "text": "M-LINK_KEY_DEREG Indication Direction: M2UA -> LM Purpose: SG reports to LM that it has successfully processed an incoming DEREG REQ message from ASP.",
      "ja": "m -link_key_dereg表示方向：M2UA-> lm目的：SGは、ASPからの着信Dereg Reqメッセージを正常に処理したことをLMに報告します。"
    },
    {
      "indent": 0,
      "text": "2.0 Conventions",
      "section_title": true,
      "ja": "2.0 規約"
    },
    {
      "indent": 3,
      "text": "The keywords MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD NOT, RECOMMENDED, NOT RECOMMENDED, MAY, and OPTIONAL, when they appear in this document, are to be interpreted as described in [RFC2119].",
      "ja": "キーワードは、このドキュメントに表示される場合、[RFC2119]に記載されているように解釈される場合、必要な、必須、必要は、推奨、推奨、推奨、推奨、推奨、推奨、推奨、推奨、およびオプションでなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.0 Protocol Elements",
      "section_title": true,
      "ja": "3.0 プロトコル要素"
    },
    {
      "indent": 3,
      "text": "This section describes the format of various messages used in this protocol.",
      "ja": "このセクションでは、このプロトコルで使用されるさまざまなメッセージの形式について説明します。"
    },
    {
      "indent": 0,
      "text": "3.1 Common Message Header",
      "section_title": true,
      "ja": "3.1 一般的なメッセージヘッダー"
    },
    {
      "indent": 3,
      "text": "The protocol messages for MTP2-User Adaptation require a message structure that contains a version, message class, message type, message length, and message contents. This message header is common among all signalling protocol adaptation layers:",
      "ja": "MTP2ユーザー適応のプロトコルメッセージには、バージョン、メッセージクラス、メッセージタイプ、メッセージの長さ、メッセージの内容を含むメッセージ構造が必要です。このメッセージヘッダーは、すべてのシグナル伝達プロトコル適応レイヤーの間で一般的です。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Version    |     Spare     | Message Class | Message Type  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Message Length                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 18,
      "text": "Figure 2 Common Message Header",
      "ja": "図2一般的なメッセージヘッダー"
    },
    {
      "indent": 3,
      "text": "All fields in an M2UA message MUST be transmitted in the network byte order, unless otherwise stated.",
      "ja": "M2UAメッセージ内のすべてのフィールドは、特に明記しない限り、ネットワークバイト順序で送信する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.1.1 Version",
      "section_title": true,
      "ja": "3.1.1 バージョン"
    },
    {
      "indent": 3,
      "text": "The version field contains the version of the M2UA adaptation layer. The supported versions are:",
      "ja": "バージョンフィールドには、M2UA適応レイヤーのバージョンが含まれています。サポートされているバージョンは次のとおりです。"
    },
    {
      "indent": 9,
      "text": "Value    Version\n-----    -------\n  1      Release 1.0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.1.2 Spare",
      "section_title": true,
      "ja": "3.1.2 予備の"
    },
    {
      "indent": 3,
      "text": "The Spare field is 8-bits. It SHOULD be set to all '0's by the sender and ignored by the receiver.",
      "ja": "スペアフィールドは8ビットです。送信者によってすべての「0」に設定され、受信機によって無視される必要があります。"
    },
    {
      "indent": 0,
      "text": "3.1.3 Message Class",
      "section_title": true,
      "ja": "3.1.3 メッセージクラス"
    },
    {
      "indent": 3,
      "text": "The following List contains the valid Message Classes:",
      "ja": "次のリストには、有効なメッセージクラスが含まれています。"
    },
    {
      "indent": 3,
      "text": "Message Class: 8 bits (unsigned integer)",
      "ja": "メッセージクラス：8ビット（符号なし整数）"
    },
    {
      "indent": 0,
      "text": "     0      Management (MGMT) Message [IUA/M2UA/M3UA/SUA]\n     1      Transfer Messages [M3UA]\n     2      SS7 Signalling Network Management (SSNM) Messages [M3UA/SUA]\n     3      ASP State Maintenance (ASPSM) Messages [IUA/M2UA/M3UA/SUA]\n     4      ASP Traffic Maintenance (ASPTM) Messages [IUA/M2UA/M3UA/SUA]\n     5      Q.921/Q.931 Boundary Primitives Transport (QPTM)\n            Messages [IUA]\n     6      MTP2 User Adaptation (MAUP) Messages [M2UA]\n     7      Connectionless Messages [SUA]\n     8      Connection-Oriented Messages [SUA]\n     9      Routing Key Management (RKM) Messages (M3UA)\n    10      Interface Identifier Management (IIM) Messages (M2UA)\n 11 to 127  Reserved by the IETF\n128 to 255  Reserved for IETF-Defined Message Class extensions",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.1.4 Message Type",
      "section_title": true,
      "ja": "3.1.4 メッセージタイプ"
    },
    {
      "indent": 3,
      "text": "The following List contains the Message Types for the valid Message Classes:",
      "ja": "次のリストには、有効なメッセージクラスのメッセージタイプが含まれています。"
    },
    {
      "indent": 3,
      "text": "MTP2 User Adaptation (MAUP) Messages",
      "ja": "MTP2ユーザー適応（MAUP）メッセージ"
    },
    {
      "indent": 3,
      "text": " 0 Reserved 1 Data 2 Establish Request 3 Establish Confirm 4 Release Request 5 Release Confirm 6 Release Indication 7 State Request 8 State Confirm 9 State Indication 10 Data Retrieval Request 11 Data Retrieval Confirm 12 Data Retrieval Indication 13 Data Retrieval Complete Indication 14 Congestion Indication 15 Data Acknowledge 16 to 127 Reserved by the IETF 128 to 255 Reserved for IETF-Defined MAUP extensions Application Server Process State Maintenance (ASPSM) messages",
      "ja": "0予約1データ2リクエストを確立する3リリースの確立4リリース要求5リリース6リリース表示7状態リクエスト8状態確認9状態表示10データ検索リクエスト11データ検索IETF 128から255によって予約されている16〜127を認める"
    },
    {
      "indent": 3,
      "text": " 0 Reserved 1 ASP Up (UP) 2 ASP Down (DOWN) 3 Heartbeat (BEAT) 4 ASP Up Ack (UP ACK) 5 ASP Down Ack (DOWN ACK) 6 Heartbeat Ack (BEAT ACK) 7 to 127 Reserved by the IETF 128 to 255 Reserved for IETF-Defined ASPSM extensions",
      "ja": "0予約済み1 ASP UP（UP）2 ASP DOWN（ダウン）3ハートビート（ビート）4 ASP ACK（UP ACK）5 ASP Down ACK（Down ACK）6 HeartBeat ACK（Beat ACK）7〜127 IETF 128IETF定義のASPSMエクステンション用に予約されている255へ"
    },
    {
      "indent": 3,
      "text": "Application Server Process Traffic Maintenance (ASPTM) messages",
      "ja": "アプリケーションサーバープロセストラフィックメンテナンス（ASPTM）メッセージ"
    },
    {
      "indent": 3,
      "text": " 0 Reserved 1 ASP Active (ACTIVE) 2 ASP Inactive (INACTIVE) 3 ASP Active Ack (ACTIVE ACK) 4 ASP Inactive Ack (INACTIVE ACK) 5 to 127 Reserved by the IETF 128 to 255 Reserved for IETF-Defined ASPTM extensions",
      "ja": "0予約済み1 ASPアクティブ（アクティブ）2 ASP不活性（非アクティブ）3 ASPアクティブACK（アクティブACK）4 ASP不活性ACK（非アクティブACK）5〜127 IETF 128から255によってIETF定義のASPTM拡張機能のために予約されています"
    },
    {
      "indent": 3,
      "text": "Management (MGMT) Messages",
      "ja": "管理（MGMT）メッセージ"
    },
    {
      "indent": 3,
      "text": " 0 Error (ERR) 1 Notify (NTFY) 2 to 127 Reserved by the IETF 128 to 255 Reserved for IETF-Defined MGMT extensions",
      "ja": "0エラー（err）1 notify（ntfy）2〜127 IETF 128から255によって予約されているIETF定義のMGMTエクステンションの予約"
    },
    {
      "indent": 3,
      "text": "Interface Identifier Management (IIM) Messages",
      "ja": "インターフェイス識別子管理（IIM）メッセージ"
    },
    {
      "indent": 3,
      "text": " 0 Reserved 1 Registration Request (REG REQ) 2 Registration Response (REG RSP) 3 Deregistration Request (DEREG REQ) 4 Deregistration Response (DEREG RSP) 5 to 127 Reserved by the IETF 128 to 255 Reserved for IETF-Defined IIM extensions",
      "ja": "0予約済み1登録要求（REG REQ）2登録応答（REG RSP）3 Deregistration Request（dereg Req）4 Deregistration Response（dereg RSP）5〜127 IETF 128から255により予約されているIETF定義IIM拡張機能"
    },
    {
      "indent": 0,
      "text": "3.1.5 Message Length",
      "section_title": true,
      "ja": "3.1.5 メッセージの長さ"
    },
    {
      "indent": 3,
      "text": "The Message Length defines the length of the message in octets, including the header. The Message Length MUST include parameter padding bytes, if any. The Message Length MUST NOT be longer than a MTP3 message [2,3,4,5] plus the length of the common and M2UA message headers.",
      "ja": "メッセージの長さは、ヘッダーを含むオクテットのメッセージの長さを定義します。メッセージの長さには、パラメーターパディングバイトが含まれている必要があります。メッセージの長さは、MTP3メッセージ[2,3,4,5]に加えて、共通およびM2UAメッセージヘッダーの長さよりも長くてはなりません。"
    },
    {
      "indent": 0,
      "text": "3.1.6 Variable-Length Parameter Format",
      "section_title": true,
      "ja": "3.1.6 変数長パラメーター形式"
    },
    {
      "indent": 3,
      "text": "M2UA messages consist of a Common Header followed by zero or more variable-length parameters, as defined by the message type. The variable-length parameters contained in a message are defined in a Tag-Length-Value format as shown below.",
      "ja": "M2UAメッセージは、メッセージタイプで定義されているように、共通のヘッダーとそれに続くゼロ以上の可変長パラメーターで構成されています。メッセージに含まれる変数長さのパラメーターは、以下に示すように、タグ長価値形式で定義されています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Parameter Tag        |       Parameter Length        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                       Parameter Value                         /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Mandatory parameters MUST be placed before optional parameters in a message.",
      "ja": "必須パラメーターは、メッセージ内のオプションパラメーターの前に配置する必要があります。"
    },
    {
      "indent": 3,
      "text": "Parameter Tag: 16 bits (unsigned integer)",
      "ja": "パラメータータグ：16ビット（符号なし整数）"
    },
    {
      "indent": 3,
      "text": "The Type field is a 16 bit identifier of the type of parameter. It takes a value of 0 to 65534. The common parameters used by the adaptation layers are in the range of 0x00 to 0xff. The M2UA specific parameters have Tags in the range 0x300 to 0x3ff.",
      "ja": "タイプフィールドは、パラメーターのタイプの16ビット識別子です。0〜65534の値が必要です。適応層で使用される一般的なパラメーターは、0x00〜0xffの範囲です。M2UA固有のパラメーターには、0x300〜0x3ffの範囲にタグがあります。"
    },
    {
      "indent": 3,
      "text": "The common parameter tags (used by all User Adaptation layers) that M2UA uses are defined below:",
      "ja": "M2UAが使用する一般的なパラメータータグ（すべてのユーザー適応レイヤーで使用）を以下に定義します。"
    },
    {
      "indent": 6,
      "text": "Parameter Value     Parameter Name\n---------------     --------------\n      0 (0x00)       Reserved\n      1 (0x01)       Interface Identifier (Integer)\n      2 (0x02)       Unused\n      3 (0x03)       Interface Identifier (Text)\n      4 (0x04)       Info String\n      5 (0x05)       Unused\n      6 (0x06)       Unused\n      7 (0x07)       Diagnostic Information\n      8 (0x08)       Interface Identifier (Integer Range)\n      9 (0x09)       Heartbeat Data\n     10 (0x0a)       Unused\n     11 (0x0b)       Traffic Mode Type\n     12 (0x0c)       Error Code\n     13 (0x0d)       Status Type/Information\n     14 (0x0e)       Unused\n     15 (0x0f)       Unused\n     16 (0x10)       Unused\n     17 (0x11)       ASP Identifier\n     18 (0x12)       Unused\n     19 (0x13)       Correlation Id\n    18-255           Reserved",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The M2UA specific parameter Tags defined are as follows:",
      "ja": "定義されたM2UA固有のパラメータータグは次のとおりです。"
    },
    {
      "indent": 6,
      "text": "Parameter Value     Parameter Name\n---------------     --------------\n  768 (0x0300)      Protocol Data 1\n  769 (0x0301)      Protocol Data 2 (TTC)\n  770 (0x0302)      State Request\n  771 (0x0303)      State Event\n  772 (0x0304)      Congestion Status\n  773 (0x0305)      Discard Status\n  774 (0x0306)      Action\n  775 (0x0307)      Sequence Number\n  776 (0x0308)      Retrieval Result\n  777 (0x0309)      Link Key\n  778 (0x030a)      Local-LK-Identifier\n  779 (0x030b)      Signalling Data Terminal (SDT) Identifier\n  780 (0x030c)      Signalling Data Link (SDL) Identifier\n  781 (0x030d)      Registration Result\n  782 (0x030e)      Registration Status\n  783 (0x030f)      De-Registration Result\n  784 (0x0310)      De-Registration Status",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Parameter Length: 16 bits (unsigned integer)",
      "ja": "パラメーターの長さ：16ビット（符号なし整数）"
    },
    {
      "indent": 3,
      "text": "The Parameter Length field contains the size of the parameter in bytes, including the Parameter Tag, Parameter Length, and Parameter Value fields. Thus, a parameter with a zero-length Parameter Value field would have a Length field of 4. The Parameter Length does not include any padding bytes.",
      "ja": "パラメーター長いフィールドには、パラメータータグ、パラメーター長、パラメーター値フィールドなど、バイト内のパラメーターのサイズが含まれています。したがって、ゼロの長さのパラメーター値フィールドを持つパラメーターの長さフィールドは4です。パラメーターの長さには、パディングバイトは含まれません。"
    },
    {
      "indent": 3,
      "text": "Parameter Value: variable-length.",
      "ja": "パラメーター値：変数長。"
    },
    {
      "indent": 3,
      "text": "The Parameter Value field contains the actual information to be transferred in the parameter.",
      "ja": "パラメーター値フィールドには、パラメーターに転送される実際の情報が含まれています。"
    },
    {
      "indent": 3,
      "text": "The total length of a parameter (including Tag, Parameter Length and Value fields) MUST be a multiple of 4 bytes. If the length of the parameter is not a multiple of 4 bytes, the sender pads the Parameter at the end (i.e., after the Parameter Value field) with all zero bytes. The length of the padding is NOT included in the parameter length field. A sender MUST NOT pad with more than 3 bytes. The receiver MUST ignore the padding bytes.",
      "ja": "パラメーターの総長さ（タグ、パラメーターの長さ、値フィールドを含む）は、4バイトの倍数でなければなりません。パラメーターの長さが4バイトの倍数でない場合、送信者は、すべてのゼロバイトを持つ最後のパラメーター（つまり、パラメーター値フィールドの後）にパッドをパッドします。パディングの長さは、パラメーターの長さフィールドに含まれていません。送信者は、3バイト以上のパッドをパッドしてはなりません。受信機は、パディングバイトを無視する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2 M2UA Message Header",
      "section_title": true,
      "ja": "3.2 M2UAメッセージヘッダー"
    },
    {
      "indent": 3,
      "text": "In addition to the common message header, there will be a M2UA specific message header. The M2UA specific message header will immediately follow the common message header, but will only be used with MAUP messages.",
      "ja": "一般的なメッセージヘッダーに加えて、M2UA固有のメッセージヘッダーがあります。M2UA固有のメッセージヘッダーは、すぐに共通のメッセージヘッダーに続きますが、MAUPメッセージでのみ使用されます。"
    },
    {
      "indent": 3,
      "text": "This message header will contain the Interface Identifier. The Interface Identifier identifies the physical interface at the SG for which the signalling messages are sent/received. The format of the Interface Identifier parameter can be text or integer, the values of which are assigned according to network operator policy. The values used are of local significance only, coordinated between the SG and ASP.",
      "ja": "このメッセージヘッダーには、インターフェイス識別子が含まれます。インターフェイス識別子は、信号メッセージが送信/受信されるSGの物理インターフェイスを識別します。インターフェイス識別子パラメーターの形式はテキストまたは整数であり、その値はネットワークオペレーターポリシーに従って割り当てられます。使用される値は、SGとASPの間で調整された局所的な重要性のみです。"
    },
    {
      "indent": 3,
      "text": "The integer formatted Interface Identifier MUST be supported. The text formatted Interface Identifier MAY optionally be supported.",
      "ja": "整数フォーマットされたインターフェイス識別子をサポートする必要があります。テキストフォーマットされたインターフェイス識別子がオプションでサポートされる場合があります。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0x1)           |           Length=8            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier (integer)                |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Figure 3 M2UA Message Header (Integer-based Interface Identifier)",
      "ja": "図3M2UAメッセージヘッダー（整数ベースのインターフェイス識別子）"
    },
    {
      "indent": 3,
      "text": "The Tag value for the Integer-based Interface Identifier is 0x1. The length is always set to a value of 8.",
      "ja": "整数ベースのインターフェイス識別子のタグ値は0x1です。長さは常に8の値に設定されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0x3)           |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                   Interface Identifier (text)                 /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "Figure 4 M2UA Message Header (Text-based Interface Identifier)",
      "ja": "図4M2UAメッセージヘッダー（テキストベースのインターフェイス識別子）"
    },
    {
      "indent": 3,
      "text": "The Tag value for the Text-based Interface Identifier is 0x3. The encoding of the Identifier is ANSI X3.4-1986 [7]. The maximum string length of the text-based Interface Identifier is 255 octets. The tag length is equal to the string length of the Interface Identifier name plus four bytes for the Tag and Length fields.",
      "ja": "テキストベースのインターフェイス識別子のタグ値は0x3です。識別子のエンコーディングはANSI X3.4-1986です[7]。テキストベースのインターフェイス識別子の最大文字列長は255オクテットです。タグの長さは、インターフェイス識別子名の文字列長に加えて、タグと長さのフィールドの4バイトに等しくなります。"
    },
    {
      "indent": 0,
      "text": "3.3 M2UA Messages",
      "section_title": true,
      "ja": "3.3 M2UAメッセージ"
    },
    {
      "indent": 3,
      "text": "The following section defines the messages and parameter contents. The M2UA messages will use the common message header (Figure 2) and the M2UA message header (Figure 3 and Figure 4).",
      "ja": "次のセクションでは、メッセージとパラメーターの内容を定義します。M2UAメッセージは、一般的なメッセージヘッダー（図2）とM2UAメッセージヘッダー（図3と図4）を使用します。"
    },
    {
      "indent": 0,
      "text": "3.3.1 MTP2 User Adaptation Messages",
      "section_title": true,
      "ja": "3.3.1 MTP2ユーザー適応メッセージ"
    },
    {
      "indent": 0,
      "text": "3.3.1.1 Data",
      "section_title": true,
      "ja": "3.3.1.1 データ"
    },
    {
      "indent": 3,
      "text": "The Data message contains an SS7 MTP2-User Protocol Data Unit (PDU). The Data message contains the following parameter:",
      "ja": "データメッセージには、SS7 MTP2ユーザープロトコルデータユニット（PDU）が含まれています。データメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "Protocol Data (mandatory) Correlation Id (optional)",
      "ja": "プロトコルデータ（必須）相関ID（オプション）"
    },
    {
      "indent": 3,
      "text": "The format for the Data Message parameters is as follows:",
      "ja": "データメッセージパラメーターの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x300)           |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                       Protocol Data                           /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x13)            |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Correlation Id                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The Protocol Data field contains the MTP2-User application message in network byte order starting with the Signalling Information Octet (SIO). The Correlation Id parameter uniquely identifies the MSU carried in the Protocol Data within an AS. This Correlation Id parameter is assigned by the sending M2UA. The purpose of the Correlation Id is to permit the newly active ASP to synchronize its processing of the traffic in each ordered stream with other ASPs in the broadcast group.",
      "ja": "プロトコルデータフィールドには、シグナル情報Octet（SIO）から始まるネットワークバイト順序でのMTP2ユーザーアプリケーションメッセージが含まれています。相関IDパラメーターは、AS内のプロトコルデータに含まれるMSUを一意に識別します。この相関IDパラメーターは、送信M2UAによって割り当てられます。相関IDの目的は、新たにアクティブなASPが、放送グループの他のASPと順序付けられた各ストリームのトラフィックの処理を同期させることを許可することです。"
    },
    {
      "indent": 3,
      "text": "The format for a Data Message with TTC PDU parameters is as follows:",
      "ja": "TTC PDUパラメーターを使用したデータメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x301)           |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                    TTC Protocol Data                          /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Tag (0x13)           |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Correlation Id                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The Protocol Data field contains the MTP2-User application message in network byte order starting with the Length Indicator (LI) octet. The Japanese TTC variant uses the spare bits of the LI octet for priority.",
      "ja": "プロトコルデータフィールドには、長さインジケーター（LI）Octetから始まるネットワークバイト順序でのMTP2ユーザーアプリケーションメッセージが含まれています。日本のTTCバリアントは、優先順位のためにLiオクテットの予備のビットを使用しています。"
    },
    {
      "indent": 3,
      "text": "The length of the Protocol Data and TTC Protocol Data MUST NOT exceed the length of a MTP2-User application message [2,3,5].",
      "ja": "プロトコルデータの長さとTTCプロトコルデータは、MTP2ユーザーアプリケーションメッセージの長さを超えてはなりません[2,3,5]。"
    },
    {
      "indent": 0,
      "text": "3.3.1.2 Data Acknowledge Message",
      "section_title": true,
      "ja": "3.3.1.2 データはメッセージを確認します"
    },
    {
      "indent": 3,
      "text": "The Data Acknowledge message contains the Correlation Id of the Data message that the sending M2UA is acknowledging as successfully processed to the peer M2UA.",
      "ja": "データを確認するメッセージには、送信M2UAがピアM2UAに成功裏に処理されていると認めているというデータメッセージの相関IDが含まれています。"
    },
    {
      "indent": 3,
      "text": "The Data Acknowledge message contains the following parameter:",
      "ja": "データを確認するメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "Correlation Id Mandatory",
      "ja": "相関IDが必須"
    },
    {
      "indent": 3,
      "text": "The following format MUST be used for the Data Ack Message:",
      "ja": "次の形式は、データACKメッセージに使用する必要があります。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Tag (0x13)           |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Correlation Id                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The Correlation Id parameter of the Data message and the Data Ack message provide a mechanism, for those SG implementations capable of taking advantage of them, to obtain an acknowledgment that the MSU has been transferred to the M2UA peer before acknowledging the MSU to the SS7 peer, removing the risk of losing messages due to association failure or SCTP congestion.",
      "ja": "データメッセージとデータACKメッセージの相関IDパラメーターは、それらを利用できるSG実装にメカニズムを提供し、MSUがSS7ピアにMSUを認める前にM2UAピアに転送されたことを認識します。、関連性の障害またはSCTPの混雑によるメッセージを紛失するリスクを削除します。"
    },
    {
      "indent": 3,
      "text": "The Data Ack message MUST be sent if a Correlation Id parameter is received from the peer. Otherwise, the Data Ack message MUST NOT be sent.",
      "ja": "Peerから相関IDパラメーターが受信された場合、データACKメッセージを送信する必要があります。それ以外の場合、データACKメッセージを送信してはなりません。"
    },
    {
      "indent": 3,
      "text": "If the Data Acknowledge is not sent for Correlation Id(s) or is sent with Invalid Correlation Id(s), the SS7 link will eventually fail due to lack of MTP Level 2 acknowledgments of the SS7 peer's MSUs.",
      "ja": "データが相関IDに送信されない場合、または無効な相関IDで送信される場合、SS7ピアのMSUのMTPレベル2の確認がないため、SS7リンクは最終的に失敗します。"
    },
    {
      "indent": 0,
      "text": "3.3.1.3 Establish (Request, Confirmation)",
      "section_title": true,
      "ja": "3.3.1.3 確立（リクエスト、確認）"
    },
    {
      "indent": 3,
      "text": "The Establish Request message is used to establish the SS7 link or to indicate that the channel has been established. The MGC controls the state of the SS7 link. When the MGC desires the SS7 link to be in-service, it will send the Establish Request message. Note that the SGP MAY already have the SS7 link established at its layer. If so, upon receipt of an Establish Request, the SGP takes no action except to send an Establish Confirm.",
      "ja": "確立リクエストメッセージは、SS7リンクを確立するか、チャネルが確立されていることを示すために使用されます。MGCは、SS7リンクの状態を制御します。MGCがSS7リンクをインサービスに希望する場合、確立リクエストメッセージが送信されます。SGPには、その層にSS7リンクが既に確立されている可能性があることに注意してください。もしそうなら、確立された要求を受け取ったとき、SGPは確立の確認を送信する以外に措置を講じません。"
    },
    {
      "indent": 3,
      "text": "When the MGC sends an M2UA Establish Request message, the MGC MAY start a timer. This timer would be stopped upon receipt of an M2UA Establish Confirm. If the timer expires, the MGC would resend the M2UA Establish Request message and restart the timer. In other words, the MGC MAY continue to request the establishment of the data link on a periodic basis until the desired state is achieved or some other action is taken (notify the Management Layer).",
      "ja": "MGCがM2UAを確立する要求メッセージを送信すると、MGCはタイマーを開始する場合があります。このタイマーは、M2UA確立確認の受領時に停止されます。タイマーの有効期限が切れた場合、MGCはM2UAを再送信し、リクエストメッセージを確立し、タイマーを再起動します。言い換えれば、MGCは、目的の状態が達成されるか、その他のアクションが実行されるまで、定期的にデータリンクの確立を要求し続ける場合があります（管理層に通知）。"
    },
    {
      "indent": 3,
      "text": "The mode (Normal or Emergency) for bringing the SS7 link in service is defaulted to Normal. The State Request (described in Section 3.3.1.5 below) can be used to change the mode to Emergency.",
      "ja": "SS7リンクを使用するモード（通常または緊急）は、デフォルトで正常になります。状態要求（以下のセクション3.3.1.5で説明）を使用して、モードを緊急事態に変更できます。"
    },
    {
      "indent": 0,
      "text": "3.3.1.4 Release (Request, Indication, Confirmation)",
      "section_title": true,
      "ja": "3.3.1.4 リリース（リクエスト、表示、確認）"
    },
    {
      "indent": 3,
      "text": "This Release Request message is used to release the channel. The Release Confirm and Indication messages are used to indicate that the channel has been released.",
      "ja": "このリリース要求メッセージは、チャネルのリリースに使用されます。リリースの確認メッセージと表示メッセージは、チャネルがリリースされたことを示すために使用されます。"
    },
    {
      "indent": 0,
      "text": "3.3.1.5 State Request",
      "section_title": true,
      "ja": "3.3.1.5 州の要求"
    },
    {
      "indent": 3,
      "text": "The State Request message can be sent from a MGC to cause an action on a particular SS7 link supported by the Signalling Gateway Process. The SGP sends a State Confirm to the MGC if the action has been successfully completed. The State Confirm reflects that state value received in the State Request message.",
      "ja": "状態要求メッセージは、MGCから送信して、信号ゲートウェイプロセスでサポートされている特定のSS7リンクでアクションを引き起こすことができます。SGPは、アクションが正常に完了した場合、州の確認をMGCに送信します。州の確認は、州の要求メッセージで受け取った状態価値を反映しています。"
    },
    {
      "indent": 3,
      "text": "The State Request message contains the following parameter:",
      "ja": "状態要求メッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 4,
      "text": "State (mandatory)",
      "ja": "状態（必須）"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x302)           |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                             State                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The valid values for State are shown in the following table.",
      "ja": "状態の有効な値を次の表に示します。"
    },
    {
      "indent": 6,
      "text": "      Define           Value        Description\nSTATUS_LPO_SET          0x0      Request local processor outage\nSTATUS_LPO_CLEAR        0x1      Request local processor outage\n                                 recovered\nSTATUS_EMER_SET         0x2      Request emergency alignment\nSTATUS_EMER_CLEAR       0x3      Request normal alignment (cancel\n                                 emergency)\nSTATUS_FLUSH_BUFFERS    0x4      Flush or clear receive, transmit\n                                 and retransmit queues\nSTATUS_CONTINUE         0x5      Continue or Resume\nSTATUS_CLEAR_RTB        0x6      Clear the retransmit queue\nSTATUS_AUDIT            0x7      Audit state of link\nSTATUS_CONG_CLEAR       0x8      Congestion cleared\nSTATUS_CONG_ACCEPT      0x9      Congestion accept\nSTATUS_CONG_DISCARD     0xa      Congestion discard",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.3.1.6 State Confirm",
      "section_title": true,
      "ja": "3.3.1.6 状態確認"
    },
    {
      "indent": 3,
      "text": "The State Confirm message will be sent by the SGP in response to a State Request from the MGC. The State Confirm reflects that state value received in the State Request message.",
      "ja": "州の確認メッセージは、MGCからの状態要求に応じてSGPによって送信されます。州の確認は、州の要求メッセージで受け取った状態価値を反映しています。"
    },
    {
      "indent": 3,
      "text": "The State Confirm message contains the following parameter:",
      "ja": "状態確認メッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 4,
      "text": "State (mandatory)",
      "ja": "状態（必須）"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x302)           |           Length = 8          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                             State                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   The valid values for State are shown in the following table.  The\nvalue of the State field SHOULD reflect the value received in the\nState Request message.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "      Define           Value        Description\nSTATUS_LPO_SET          0x0      Request local processor outage\nSTATUS_LPO_CLEAR        0x1      Request local processor outage\n                                 recovered\nSTATUS_EMER_SET         0x2      Request emergency alignment\nSTATUS_EMER_CLEAR       0x3      Request normal alignment (cancel\n                                 emergency)\nSTATUS_FLUSH_BUFFERS    0x4      Flush or clear receive, transmit\n                                 and retransmit queues\nSTATUS_CONTINUE         0x5      Continue or Resume\nSTATUS_CLEAR_RTB        0x6      Clear the retransmit queue\nSTATUS_AUDIT            0x7      Audit state of link\nSTATUS_CONG_CLEAR       0x8      Congestion cleared\nSTATUS_CONG_ACCEPT      0x9      Congestion accept\nSTATUS_CONG_DISCARD     0xa      Congestion discard",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.3.1.7 State Indication",
      "section_title": true,
      "ja": "3.3.1.7 状態兆候"
    },
    {
      "indent": 3,
      "text": "The MTP2 State Indication message can be sent from a SGP to an ASP to indicate a condition on a SS7 link.",
      "ja": "MTP2状態表示メッセージは、SGPからSS7リンクの条件を示すASPに送信できます。"
    },
    {
      "indent": 3,
      "text": "The State Indication message contains the following parameter:",
      "ja": "状態表示メッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 4,
      "text": "Event (mandatory)",
      "ja": "イベント（必須）"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x303)           |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                             Event                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The valid values for Event are shown in the following table.",
      "ja": "イベントの有効な値を次の表に示します。"
    },
    {
      "indent": 6,
      "text": "    Define            Value          Description\nEVENT_RPO_ENTER        0x1      Remote entered processor outage\nEVENT_RPO_EXIT         0x2      Remote exited processor outage\nEVENT_LPO_ENTER        0x3      Link entered processor outage\nEVENT_LPO_EXIT         0x4      Link exited processor outage",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.3.1.8 Congestion Indication",
      "section_title": true,
      "ja": "3.3.1.8 混雑の兆候"
    },
    {
      "indent": 3,
      "text": "The Congestion Indication message can be sent from a Signalling Gateway Process to an ASP to indicate the congestion status and discard status of a SS7 link. When the MSU buffer fill increases above an Onset threshold or decreases below an Abatement threshold or crosses a Discard threshold in either direction, the SGP SHALL send a congestion indication message when it supports SS7 MTP2 variants that support multiple congestion levels.",
      "ja": "うっ血指示メッセージは、信号ゲートウェイプロセスからASPまで送信して、SS7リンクの輻輳状態を示し、ステータスを破棄することができます。MSUバッファーフィルが発症のしきい値を超えて増加するか、削減のしきい値を下回るか、どちらの方向にも破棄のしきい値を超えた場合、SGPは、複数の輻輳レベルをサポートするSS7 MTP2バリアントをサポートする場合、鬱血指示メッセージを送信します。"
    },
    {
      "indent": 3,
      "text": "The SGP SHALL send the message only when there is actually a change in either the discard level or the congestion level to report, meaning it is different from the previously sent message. In addition, the SGP SHALL use an implementation dependent algorithm to limit the frequency of congestion indication messages.",
      "ja": "SGPは、実際に廃棄レベルまたは輻輳レベルのいずれかに変更がある場合にのみ、メッセージを送信するものとします。つまり、以前に送信されたメッセージとは異なります。さらに、SGPは、輻輳表示メッセージの頻度を制限するために、実装依存アルゴリズムを使用するものとします。"
    },
    {
      "indent": 3,
      "text": "An implementation may optionally send Congestion Indication messages on a \"high priority\" stream in order to potentially reduce delay.",
      "ja": "実装は、遅延を潜在的に減らすために、オプションで「優先度の高い」ストリームに渋滞表示メッセージを送信する場合があります。"
    },
    {
      "indent": 3,
      "text": "The Congestion Indication message contains the following parameters:",
      "ja": "輻輳表示メッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 4,
      "text": "Congestion Status (mandatory) Discard Status (optional)",
      "ja": "混雑ステータス（必須）廃棄ステータス（オプション）"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x304)           |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Congestion Status                       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x305)           |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Discard Status                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The valid values for Congestion Status and Discard Status are shown in the following table.",
      "ja": "輻輳状態と破棄ステータスの有効な値を次の表に示します。"
    },
    {
      "indent": 10,
      "text": "  Define        Value        Description\nLEVEL_NONE       0x0       No congestion\nLEVEL_1          0x1       Congestion Level 1\nLEVEL_2          0x2       Congestion Level 2\nLEVEL_3          0x3       Congestion Level 3",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "For SS7 networks that do not support multiple levels of congestion, only the LEVEL_NONE and LEVEL_3 values will be used. For SS7 networks that support multiple levels of congestion, it is possible for all values to be used. Refer to [2], [3] and [12] for more details on the Congestion and Discard Status of SS7 signalling links.",
      "ja": "複数のレベルの輻輳をサポートしていないSS7ネットワークの場合、level_noneとlevel_3値のみが使用されます。複数のレベルの混雑をサポートするSS7ネットワークの場合、すべての値を使用することが可能です。SS7シグナリングリンクの輻輳と廃棄ステータスの詳細については、[2]、[3]、[12]を参照してください。"
    },
    {
      "indent": 0,
      "text": "3.3.1.9 Retrieval Request",
      "section_title": true,
      "ja": "3.3.1.9 検索リクエスト"
    },
    {
      "indent": 3,
      "text": "The MTP2 Retrieval Request message is used during the MTP Level 3 changeover procedure to request the BSN, to retrieve PDUs from the transmit and retransmit queues or to flush PDUs from the retransmit queue. Examples of the use of Retrieval Request for SS7 Link Changeover are provided in Section 5.3.6.",
      "ja": "MTP2検索要求メッセージは、MTPレベル3の切り替え手順で使用され、BSNを要求し、送信からPDUを取得してキューを再送信するか、再送信キューからPDUを洗い流します。SS7リンクの切り替えの検索要求の使用の例は、セクション5.3.6に記載されています。"
    },
    {
      "indent": 3,
      "text": "The Retrieval Request message contains the following parameters:",
      "ja": "検索要求メッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 4,
      "text": "Action (mandatory) Sequence Number (optional)",
      "ja": "アクション（必須）シーケンス番号（オプション）"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x306)           |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                            Action                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x307)           |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Sequence Number                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The valid values for Action are shown in the following table.",
      "ja": "アクションの有効な値を次の表に示します。"
    },
    {
      "indent": 6,
      "text": " Define Value Description ACTION_RTRV_BSN 0x1 Retrieve the backward sequence number ACTION_RTRV_MSGS 0x2 Retrieve the PDUs from the transmit and retransmit queues",
      "ja": "値の説明を定義しますaction_rtrv_bsn 0x1後方シーケンス番号を取得するaction_rtrv_msgs 0x2送信および再送信キューからpdusを取得します"
    },
    {
      "indent": 3,
      "text": "In the Retrieval Request message, the Sequence Number field SHOULD NOT be present if the Action field is ACTION_RTRV_BSN. The Sequence Number field contains the Forward Sequence Number (FSN) of the far end if the Action is ACTION_RTRV_MSGS.",
      "ja": "取得要求メッセージでは、アクションフィールドがaction_rtrv_bsnである場合、シーケンス番号フィールドは存在しないでください。アクションがaction_rtrv_msgsである場合、シーケンス番号フィールドには、遠端の前方シーケンス番号（FSN）が含まれます。"
    },
    {
      "indent": 0,
      "text": "3.3.1.10 Retrieval Confirm",
      "section_title": true,
      "ja": "3.3.1.10 検索確認"
    },
    {
      "indent": 3,
      "text": "The MTP2 Retrieval Confirm message is sent by the Signalling Gateway in response to a Retrieval Request message. Examples of the use of the Retrieval Confirm for SS7 Link Changeover are provided in Section 5.3.6.",
      "ja": "MTP2検索の確認メッセージは、検索要求メッセージに応じてSignaling Gatewayによって送信されます。SS7リンクの切り替えの検索確認の例は、セクション5.3.6に記載されています。"
    },
    {
      "indent": 3,
      "text": "The Retrieval Confirm message contains the following parameters:",
      "ja": "検索確認メッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 4,
      "text": "Action (mandatory) Result (mandatory) Sequence Number (optional)",
      "ja": "アクション（必須）結果（必須）シーケンス番号（オプション）"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x306)           |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                            Action                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x308)           |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                            Result                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x307)           |          Length = 8           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Sequence Number                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The valid values for Action are the same as in Retrieval Request.",
      "ja": "アクションの有効な値は、検索要求と同じです。"
    },
    {
      "indent": 3,
      "text": "The values for Result are shown below:",
      "ja": "結果の値を以下に示します。"
    },
    {
      "indent": 6,
      "text": " Define Value Description RESULT_SUCCESS 0x0 Action successful RESULT_FAILURE 0x1 Action failed",
      "ja": "値を定義する説明result_success 0x0アクション成功result_failure 0x1アクション失敗"
    },
    {
      "indent": 3,
      "text": "When the Signalling Gateway Process sends a Retrieval Confirm to a Retrieval Request, it echos the Action field. If the Action was ACTION_RTRV_BSN and the SGP successfully retrieved the BSN, the SGP will put the Backward Sequence Number (BSN) in the Sequence Number field and will indicate a success in the Result field. If the BSN could not be retrieved, the Sequence Number field will not be included and the Result field will indicate failure.",
      "ja": "Signaling Gateway Processが検索の確認を検索要求に送信すると、アクションフィールドが反映されます。アクションがaction_rtrv_bsnであり、SGPがBSNを正常に取得した場合、SGPはシーケンス番号フィールドに後方シーケンス番号（BSN）を配置し、結果フィールドで成功を示します。BSNを取得できなかった場合、シーケンス番号フィールドは含まれず、結果フィールドは障害を示します。"
    },
    {
      "indent": 3,
      "text": "For a Retrieval Confirm with Action of ACTION_RTRV_MSGS, the value of the Result field will indicate success or failure. A failure means that the buffers could not be retrieved. The Sequence Number field is not used with ACTION_RTRV_MSGS.",
      "ja": "Action_rtrv_msgsのアクションを使用して検索確認の場合、結果フィールドの値は成功または失敗を示します。障害とは、バッファーを取得できないことを意味します。シーケンス番号フィールドは、action_rtrv_msgsでは使用されません。"
    },
    {
      "indent": 0,
      "text": "3.3.1.11 Retrieval Indication",
      "section_title": true,
      "ja": "3.3.1.11 検索兆候"
    },
    {
      "indent": 3,
      "text": "The Retrieval Indication message is sent by the Signalling Gateway with a PDU from the transmit or retransmit queue. The Retrieval Indication message does not contain the Action or Sequence Number fields, just a MTP3 Protocol Data Unit (PDU) from the transmit or retransmit queue. Examples of the use of the Retrieval Indication for SS7 Link Changeover are provided in Section 5.3.6.",
      "ja": "検索指示メッセージは、送信または再送信キューからPDUを使用して、信号ゲートウェイによって送信されます。検索表示メッセージには、送信または再送信キューからのMTP3プロトコルデータユニット（PDU）のみのアクションまたはシーケンス番号フィールドが含まれていません。SS7リンクの切り替えの検索表示の使用例は、セクション5.3.6に記載されています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Tag (0x300)          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                       Protocol Data                           /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "For TTC Data messages, the following parameter will be used to indicate a TTC PDU which starts at LI.",
      "ja": "TTCデータメッセージの場合、次のパラメーターを使用して、LIで始まるTTC PDUを示します。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Tag (0x301)          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     TTC Protocol Data                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The M2UA implementation MAY consider the use of the bundling feature of SCTP for Retrieval Indication messages.",
      "ja": "M2UAの実装では、検索表示メッセージのためにSCTPのバンドル機能の使用を検討する場合があります。"
    },
    {
      "indent": 0,
      "text": "3.3.1.12 Retrieval Complete Indication",
      "section_title": true,
      "ja": "3.3.1.12 検索完全な表示"
    },
    {
      "indent": 3,
      "text": "The MTP2 Retrieval Complete Indication message is exactly the same as the MTP2 Retrieval Indication message except that it also indicates that retrieval is complete. In addition, it MAY contain a PDU (which MUST be the last PDU) from the transmit or retransmit queue.",
      "ja": "MTP2検索完全表示メッセージは、検索が完了したことも示すことを除いて、MTP2検索表示メッセージとまったく同じです。さらに、送信または再送信キューからのPDU（最後のPDUである必要があります）が含まれる場合があります。"
    },
    {
      "indent": 0,
      "text": "3.3.2 Application Server Process Maintenance (ASPM) Messages",
      "section_title": true,
      "ja": "3.3.2 アプリケーションサーバープロセスメンテナンス（ASPM）メッセージ"
    },
    {
      "indent": 3,
      "text": "The ASPM messages will only use the common message header.",
      "ja": "ASPMメッセージは、一般的なメッセージヘッダーのみを使用します。"
    },
    {
      "indent": 0,
      "text": "3.3.2.1 ASP Up (ASPUP)",
      "section_title": true,
      "ja": "3.3.2.1 ASP Up（Aspup）"
    },
    {
      "indent": 3,
      "text": "The ASP Up (ASPUP) message is used to indicate to a remote M2UA peer that the Adaptation layer is ready to receive traffic or maintenance messages.",
      "ja": "ASP Up（ASPUP）メッセージは、リモートM2UAピアに、適応レイヤーがトラフィックまたはメンテナンスメッセージを受信する準備ができていることを示すために使用されます。"
    },
    {
      "indent": 3,
      "text": "The ASPUP message contains the following parameters",
      "ja": "Aspupメッセージには、次のパラメーターが含まれています"
    },
    {
      "indent": 6,
      "text": "ASP Identifier (optional) Info String (optional)",
      "ja": "ASP識別子（オプション）情報文字列（オプション）"
    },
    {
      "indent": 3,
      "text": "Note: The ASP Identifier MUST be used where the SGP cannot identify the ASP by pre-configured address/port number information (e.g., where an ASP is resident on a Host using dynamic address/port number assignment).",
      "ja": "注：SGPが事前に構成されたアドレス/ポート番号情報でASPを識別できない場合、ASP識別子を使用する必要があります（たとえば、ASPがダイナミックアドレス/ポート番号の割り当てを使用してホストに居住している場合）。"
    },
    {
      "indent": 3,
      "text": "The format for ASPUP Message parameters is as follows:",
      "ja": "Aspupメッセージパラメーターの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0x11)          |             Length = 8        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        ASP Identifier*                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0x4)           |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The optional ASP Identifier parameter would contain a unique value that is locally significant among the ASPs that support an AS. The SGP should save the ASP Identifier to be used, if necessary, with the Notify message (see Section 3.3.3.2).",
      "ja": "オプションのASP識別子パラメーターには、ASをサポートするASPの間で局所的に重要な一意の値が含まれます。SGPは、必要に応じて、通知メッセージを使用して使用するASP識別子を保存する必要があります（セクション3.3.3.2を参照）。"
    },
    {
      "indent": 3,
      "text": "The optional INFO String parameter can carry any meaningful UTF-8 [6] character string along with the message. Length of the INFO String parameter is from 0 to 255 octets. No procedures are presently identified for its use but the INFO String MAY be used for debugging purposes.",
      "ja": "オプションの情報文字列パラメーターは、意味のあるUTF-8 [6]文字文字列をメッセージとともに運ぶことができます。情報文字列パラメーターの長さは0〜255オクテットです。現在、その使用に関する手順は特定されていませんが、情報文字列はデバッグの目的で使用される場合があります。"
    },
    {
      "indent": 0,
      "text": "3.3.2.2 ASP Up Ack",
      "section_title": true,
      "ja": "3.3.2.2 ASP ACK"
    },
    {
      "indent": 3,
      "text": "The ASP Up Ack message is used to acknowledge an ASP Up message received from a remote M2UA peer.",
      "ja": "ASP Up ACKメッセージは、リモートM2UAピアから受信したASPアップメッセージを確認するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The ASPUP Ack message contains the following parameters:",
      "ja": "Aspup ACKメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "INFO String (optional)",
      "ja": "情報文字列（オプション）"
    },
    {
      "indent": 3,
      "text": "The format for ASPUP Ack Message parameters is as follows:",
      "ja": "Aspup ACKメッセージパラメーターの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0x4)           |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The format and description of the optional Info String parameter is the same as for the ASP UP message (See Section 3.3.2.1).",
      "ja": "オプションの情報文字列パラメーターの形式と説明は、ASPアップメッセージと同じです（セクション3.3.2.1を参照）。"
    },
    {
      "indent": 0,
      "text": "3.3.2.3 ASP Down (ASPDN)",
      "section_title": true,
      "ja": "3.3.2.3 ASPダウン（ASPDN）"
    },
    {
      "indent": 3,
      "text": "The ASP Down (ASPDN) message is used to indicate to a remote M2UA peer that the adaptation layer is not ready to receive traffic or maintenance messages.",
      "ja": "ASPダウン（ASPDN）メッセージは、リモートM2UAピアに、適応レイヤーがトラフィックまたはメンテナンスメッセージを受信する準備ができていないことを示すために使用されます。"
    },
    {
      "indent": 3,
      "text": "The ASPDN message contains the following parameters",
      "ja": "ASPDNメッセージには、次のパラメーターが含まれています"
    },
    {
      "indent": 7,
      "text": "INFO String (optional)",
      "ja": "情報文字列（オプション）"
    },
    {
      "indent": 3,
      "text": "The format for the ASPDN message parameters is as follows:",
      "ja": "ASPDNメッセージパラメーターの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0x4)           |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The format and description of the optional Info String parameter is the same as for the ASP Up message (See Section 3.3.2.1).",
      "ja": "オプションの情報文字列パラメーターの形式と説明は、ASPアップメッセージと同じです（セクション3.3.2.1を参照）。"
    },
    {
      "indent": 0,
      "text": "3.3.2.4 ASP Down Ack",
      "section_title": true,
      "ja": "3.3.2.4 ASPダウンACK"
    },
    {
      "indent": 3,
      "text": "The ASP Down Ack message is used to acknowledge an ASP Down message received from a remote M2UA peer.",
      "ja": "ASPダウンACKメッセージは、リモートM2UAピアから受け取ったASPダウンメッセージを確認するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The ASP Down Ack message contains the following parameters:",
      "ja": "ASPダウンACKメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 7,
      "text": "INFO String (optional)",
      "ja": "情報文字列（オプション）"
    },
    {
      "indent": 3,
      "text": "The format for the ASPDN Ack message parameters is as follows:",
      "ja": "ASPDN ACKメッセージパラメーターの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0x4)           |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The format and description of the optional Info String parameter is the same as for the ASP UP message (See Section 3.3.2.1).",
      "ja": "オプションの情報文字列パラメーターの形式と説明は、ASPアップメッセージと同じです（セクション3.3.2.1を参照）。"
    },
    {
      "indent": 0,
      "text": "3.3.2.5 Heartbeat (BEAT)",
      "section_title": true,
      "ja": "3.3.2.5 ハートビート（ビート）"
    },
    {
      "indent": 3,
      "text": "The Heartbeat message is optionally used to ensure that the M2UA peers are still available to each other.",
      "ja": "ハートビートメッセージは、M2UAピアが互いに利用できるようにするためにオプションで使用されます。"
    },
    {
      "indent": 3,
      "text": "The BEAT message contains the following parameter:",
      "ja": "ビートメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 7,
      "text": "Heartbeat Data Optional",
      "ja": "ハートビートデータオプション"
    },
    {
      "indent": 3,
      "text": "The format for the BEAT message is as follows:",
      "ja": "ビートメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x0009       |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                       Heartbeat Data                          /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The sending node defines the Heartbeat Data field contents. It may include a Heartbeat Sequence Number and/or time stamp, or other implementation specific details.",
      "ja": "送信ノードは、ハートビートデータフィールドの内容を定義します。ハートビートシーケンス番号および/またはタイムスタンプ、またはその他の実装固有の詳細が含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "The receiver of a Heartbeat message does not process this field as it is only of significance to the sender. The receiver echoes the content of the Heartbeat Data in a BEAT ACK message.",
      "ja": "ハートビートメッセージの受信者は、送信者にとって重要であるため、このフィールドを処理しません。レシーバーは、Beat ACKメッセージにハートビートデータのコンテンツをエコーします。"
    },
    {
      "indent": 0,
      "text": "3.3.2.6 Heartbeat Ack (BEAT ACK)",
      "section_title": true,
      "ja": "3.3.2.6 ハートビートACK（ビートACK）"
    },
    {
      "indent": 3,
      "text": "The Heartbeat ACK message is sent in response to a BEAT message. A peer MUST send a BEAT ACK in response to a BEAT message. It includes all the parameters of the received Heartbeat message, without any change.",
      "ja": "ハートビートACKメッセージは、ビートメッセージに応じて送信されます。ピアは、ビートメッセージに応じてビートACKを送信する必要があります。これには、変更されていない、受信したハートビートメッセージのすべてのパラメーターが含まれています。"
    },
    {
      "indent": 3,
      "text": "The BEAT ACK message contains the following parameter:",
      "ja": "Beat ACKメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 7,
      "text": "Heartbeat Data Optional",
      "ja": "ハートビートデータオプション"
    },
    {
      "indent": 3,
      "text": "The format for the BEAT ACK message is as follows:",
      "ja": "Beat ACKメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Tag = 0x0009       |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                       Heartbeat Data                          /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The sending node defines the Heartbeat Data field contents. It may include a Heartbeat Sequence Number and/or time stamp, or other implementation specific details.",
      "ja": "送信ノードは、ハートビートデータフィールドの内容を定義します。ハートビートシーケンス番号および/またはタイムスタンプ、またはその他の実装固有の詳細が含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "The receiver of a Heartbeat message does not process this field as it is only of significance to the sender. The receiver echoes the content of the Heartbeat Data in a BEAT ACK message.",
      "ja": "ハートビートメッセージの受信者は、送信者にとって重要であるため、このフィールドを処理しません。レシーバーは、Beat ACKメッセージにハートビートデータのコンテンツをエコーします。"
    },
    {
      "indent": 0,
      "text": "3.3.2.7 ASP Active (ASPAC)",
      "section_title": true,
      "ja": "3.3.2.7 ASPアクティブ（ASPAC）"
    },
    {
      "indent": 3,
      "text": "The ASPAC message is sent by an ASP to indicate to an SGP that it is Active and ready to be used.",
      "ja": "ASPACメッセージは、ASPによって送信され、SGPにアクティブで使用できることをSGPに示すことができます。"
    },
    {
      "indent": 3,
      "text": "The ASPAC message contains the following parameters:",
      "ja": "ASPACメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "Traffic Mode Type (optional) Interface Identifier (optional) - Combination of integer and integer ranges, OR - string (text formatted) INFO String (optional)",
      "ja": "トラフィックモードタイプ（オプション）インターフェイス識別子（オプション） - 整数と整数範囲の組み合わせ、または - 文字列（テキストフォーマット）情報文字列（オプション）"
    },
    {
      "indent": 3,
      "text": "The format for the ASPAC message using integer formatted Interface Identifiers is as follows:",
      "ja": "整数形式のインターフェイス識別子を使用したASPACメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0xb)           |            Length = 8         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Traffic Mode Type                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Tag (0x1=integer)         |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Interface Identifiers*                    /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Tag (0x8=integer range)    |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier Start1*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier Stop1*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier Start2*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier Stop2*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n  .                                                            .\n  .                                                            .\n  .                                                            .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier StartN*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier StopN*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\              Additional Interface Identifiers                 /\n/                    of Tag Type 0x1 or 0x8                     \\\n\\                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x4)             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   The format for the ASPAC message using text formatted (string)\nInterface Identifiers is as follows:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0xb)           |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Traffic Mode Type                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|       Tag (0x3=string)        |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Interface Identifier*                     /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\              Additional Interface Identifiers                 /\n/                       of Tag Type 0x3                         \\\n\\                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x4)             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The Traffic Mode Type parameter identifies the traffic mode of operation of the ASP within an AS. The valid values for Type are shown in the following table:",
      "ja": "トラフィックモードタイプパラメーターは、AS内のASPのトラフィック動作モードを識別します。タイプの有効な値を次の表に示します。"
    },
    {
      "indent": 6,
      "text": "Value          Description\n 0x1            Override\n 0x2            Load-share\n 0x3            Broadcast",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Within a particular AS, only one Traffic Mode Type can be used. The Override value indicates that the ASP is operating in Override mode, where the ASP takes over all traffic in an Application Server (i.e., primary/backup operation), over-riding any currently active ASPs in the AS. In Load-share mode, the ASP will share in the traffic distribution with any other currently active ASPs. In Broadcast mode, all of the Active ASPs receive all message traffic in the Application Server.",
      "ja": "特定のAS内で、使用するトラフィックモードタイプは1つだけです。オーバーライド値は、ASPがオーバーライドモードで動作していることを示しています。ASPはアプリケーションサーバーのすべてのトラフィック（つまり、プライマリ/バックアップ操作）を引き継ぎ、ASの現在活動的なASPをオーバーライドします。負荷シェアモードでは、ASPは、現在アクティブな他のASPと交通量の分配を共有します。ブロードキャストモードでは、すべてのアクティブなASPがアプリケーションサーバーのすべてのメッセージトラフィックを受信します。"
    },
    {
      "indent": 3,
      "text": "The optional Interface Identifiers parameter contains a list of Interface Identifier integers (Type 0x1 or Type 0x8) or text strings (Type 0x3)indexing the Application Server traffic that the sending ASP is configured/registered to receive. If integer formatted Interface Identifiers are being used, the ASP can also send ranges of Interface Identifiers (Type 0x8). Interface Identifier types Integer (0x1) and Integer Range (0x8) are allowed in the same message. Text formatted Interface Identifiers (0x3) cannot be used with either Integer (0x1) or Integer Range (0x8) types.",
      "ja": "オプションのインターフェイス識別子パラメーターには、インターフェイス識別子整数（タイプ0x1またはタイプ0x8）またはテキスト文字列（タイプ0x3）のリストが含まれています。整数形式のインターフェイス識別子が使用されている場合、ASPはインターフェイス識別子の範囲を送信することもできます（タイプ0x8）。インターフェイス識別子タイプの整数（0x1）および整数範囲（0x8）は、同じメッセージで許可されています。テキストフォーマットされたインターフェイス識別子（0x3）は、整数（0x1）または整数範囲（0x8）タイプでは使用できません。"
    },
    {
      "indent": 3,
      "text": "If no Interface Identifiers are included, the message is for all provisioned Interface Identifiers within the AS(s) in which the ASP is provisioned. If only a subset of Interface Identifiers for an AS are included, the ASP is noted as Active for all the Interface Identifiers provisioned for that AS.",
      "ja": "インターフェイス識別子が含まれていない場合、メッセージはASPがプロビジョニングされるAS内のすべてのプロビジョニングされたインターフェイス識別子に対してです。ASのインターフェイス識別子のサブセットのみが含まれている場合、ASPは、そのためにプロビジョニングされたすべてのインターフェイス識別子に対してアクティブであると認められます。"
    },
    {
      "indent": 3,
      "text": "Note: If the optional Interface Identifier parameter is present, the integer formatted Interface Identifier MUST be supported, while the text formatted Interface Identifier MAY be supported.",
      "ja": "注：オプションのインターフェイス識別子パラメーターが存在する場合、整数形式のインターフェイス識別子をサポートする必要があり、テキストフォーマットインターフェイス識別子がサポートされる場合があります。"
    },
    {
      "indent": 3,
      "text": "An SGP that receives an ASPAC with an incorrect or unsupported Traffic Mode Type for a particular Interface Identifier will respond with an Error Message (Cause: Unsupported Traffic Handling Mode).",
      "ja": "特定のインターフェイス識別子の誤ったまたはサポートされていないトラフィックモードタイプでASPACを受信するSGPは、エラーメッセージ（原因：サポートされていないトラフィックハンドリングモード）で応答します。"
    },
    {
      "indent": 3,
      "text": "The format and description of the optional Info String parameter is the same as for the ASP UP message (See Section 3.3.2.1).",
      "ja": "オプションの情報文字列パラメーターの形式と説明は、ASPアップメッセージと同じです（セクション3.3.2.1を参照）。"
    },
    {
      "indent": 0,
      "text": "3.3.2.8 ASP Active Ack",
      "section_title": true,
      "ja": "3.3.2.8 ASPアクティブACK"
    },
    {
      "indent": 3,
      "text": "The ASP Active (ASPAC) Ack message is used to acknowledge an ASP Active message received from a remote M2UA peer.",
      "ja": "ASP Active（ASPAC）ACKメッセージは、リモートM2UAピアから受信したASPアクティブメッセージを確認するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The ASPAC Ack message contains the following parameters:",
      "ja": "ASPAC ACKメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "Traffic Mode Type (optional) Interface Identifier (optional) - Combination of integer and integer ranges, OR - string (text formatted) INFO String (optional)",
      "ja": "トラフィックモードタイプ（オプション）インターフェイス識別子（オプション） - 整数と整数範囲の組み合わせ、または - 文字列（テキストフォーマット）情報文字列（オプション）"
    },
    {
      "indent": 3,
      "text": "The format for the ASPAC Ack message with Integer-formatted Interface Identifiers is as follows:",
      "ja": "整数形式のインターフェイス識別子を使用したASPAC ACKメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0xb)           |            Length = 8         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Traffic Mode Type                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Tag (0x1=integer)         |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Interface Identifiers*                    /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Tag (0x8=integer range)    |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier Start1*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier Stop1*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier Start2*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier Stop2*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n .                                                            .\n .                                                            .\n .                                                            .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier StartN*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier StopN*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\              Additional Interface Identifiers                 /\n/                    of Tag Type 0x1 or 0x8                     \\\n\\                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x4)             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   The format for the ASP Active Ack message using text formatted\n(string) Interface Identifiers is as follows:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0xb)           |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Traffic Mode Type                         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|       Tag (0x3=string)        |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Interface Identifier*                     /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\              Additional Interface Identifiers                 /\n/                       of Tag Type 0x3                         \\\n\\                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x4)             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The format and description of the optional Info String parameter is the same as for the ASP Up message (See Section 3.3.2.1).",
      "ja": "オプションの情報文字列パラメーターの形式と説明は、ASPアップメッセージと同じです（セクション3.3.2.1を参照）。"
    },
    {
      "indent": 3,
      "text": "The format of the optional Interface Identifier parameter is the same as for the ASP Active message (See Section 3.3.2.7).",
      "ja": "オプションのインターフェイス識別子パラメーターの形式は、ASPアクティブメッセージと同じです（セクション3.3.2.7を参照）。"
    },
    {
      "indent": 3,
      "text": "The format and description of the optional Info String parameter is the same as for the ASP Up message (See Section 3.3.2.1).",
      "ja": "オプションの情報文字列パラメーターの形式と説明は、ASPアップメッセージと同じです（セクション3.3.2.1を参照）。"
    },
    {
      "indent": 0,
      "text": "3.3.2.9 ASP Inactive (ASPIA)",
      "section_title": true,
      "ja": "3.3.2.9 ASP非アクティブ（ASPIA）"
    },
    {
      "indent": 3,
      "text": "The ASP Inactive (ASPIA) message is sent by an ASP to indicate to an SGP that it is no longer an active ASP to be used from within a list of ASPs. The SGP will respond with an ASPIA Ack message and either discard incoming messages or buffer for a timed period and then discard.",
      "ja": "ASPの非アクティブ（ASPIA）メッセージは、ASPによってSGPに使用されるアクティブなASPではなく、ASPのリスト内から使用されるアクティブなASPではないことを示すASPによって送信されます。SGPは、Aspia ACKメッセージで応答し、タイミング期間中、着信メッセージまたはバッファーを破棄してから破棄します。"
    },
    {
      "indent": 3,
      "text": "The ASPIA message contains the following parameters:",
      "ja": "ASPIAメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "Interface Identifiers (optional) - Combination of integer and integer ranges, OR - string (text formatted) INFO String (optional)",
      "ja": "インターフェイス識別子（オプション） - 整数と整数範囲の組み合わせ、または - 文字列（テキストフォーマット）情報文字列（オプション）"
    },
    {
      "indent": 3,
      "text": "The format for the ASP Inactive message parameters using Integer formatted Interface Identifiers is as follows:",
      "ja": "整数形式のインターフェイス識別子を使用したASP非アクティブメッセージパラメーターの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Tag (0x1=integer)         |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Interface Identifiers*                    /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Tag (0x8=integer range)    |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier Start1*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier Stop1*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier Start2*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier Stop2*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n .                                                            .\n .                                                            .\n .                                                            .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier StartN*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier StopN*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\              Additional Interface Identifiers                 /\n/                    of Tag Type 0x1 or 0x8                     \\\n\\                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0x4)           |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   The format for the ASP Inactive message using text formatted (string)\nInterface Identifiers is as follows:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|       Tag (0x3=string)        |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Interface Identifier*                     /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\              Additional Interface Identifiers                 /\n/                      of Tag Type 0x3                          \\\n\\                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x4)             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The format of the optional Interface Identifier parameter is the same as for the ASP Active message (See Section 3.3.2.7).",
      "ja": "オプションのインターフェイス識別子パラメーターの形式は、ASPアクティブメッセージと同じです（セクション3.3.2.7を参照）。"
    },
    {
      "indent": 3,
      "text": "The format and description of the optional Info String parameter is the same as for the ASP Up message (See Section 3.3.2.1).",
      "ja": "オプションの情報文字列パラメーターの形式と説明は、ASPアップメッセージと同じです（セクション3.3.2.1を参照）。"
    },
    {
      "indent": 3,
      "text": "The optional Interface Identifiers parameter contains a list of Interface Identifier integers indexing the Application Server traffic that the sending ASP is configured/registered to receive, but does not want to receive at this time.",
      "ja": "オプションのインターフェイス識別子パラメーターには、送信ASPが受信するように構成/登録されているが、現時点では受信したくないアプリケーションサーバートラフィックをインデックス作成するインターフェイス識別子整数のリストが含まれています。"
    },
    {
      "indent": 0,
      "text": "3.3.2.10 ASP Inactive Ack",
      "section_title": true,
      "ja": "3.3.2.10 ASP不活性ACK"
    },
    {
      "indent": 3,
      "text": "The ASP Inactive (ASPIA) Ack message is used to acknowledge an ASP Inactive message received from a remote M2UA peer.",
      "ja": "ASPの非アクティブ（ASPIA）ACKメッセージは、リモートM2UAピアから受け取ったASP非アクティブメッセージを確認するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The ASPIA Ack message contains the following parameters:",
      "ja": "ASPIA ACKメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "Interface Identifiers (optional) - Combination of integer and integer ranges, OR - string (text formatted) INFO String (optional)",
      "ja": "インターフェイス識別子（オプション） - 整数と整数範囲の組み合わせ、または - 文字列（テキストフォーマット）情報文字列（オプション）"
    },
    {
      "indent": 3,
      "text": "The format for the ASPIA Ack message is as follows:",
      "ja": "ASPIA ACKメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Tag (0x1=integer)         |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Interface Identifiers*                    /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Tag (0x8=integer range)    |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier Start1*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier Stop1*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier Start2*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier Stop2*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n .                                                             .\n .                                                             .\n .                                                             .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier StartN*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier StopN*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\              Additional Interface Identifiers                 /\n/                    of Tag Type 0x1 or 0x8                     \\\n\\                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x4)             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   The format for the ASP Inactive Ack message using text formatted\n(string) Interface Identifiers is as follows:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|       Tag (0x3=string)        |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Interface Identifier*                     /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\              Additional Interface Identifiers                 /\n/                      of Tag Type 0x3                          \\\n\\                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x4)             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The format of the optional Interface Identifier parameter is the same as for the ASP Active message (See Section 3.3.2.7).",
      "ja": "オプションのインターフェイス識別子パラメーターの形式は、ASPアクティブメッセージと同じです（セクション3.3.2.7を参照）。"
    },
    {
      "indent": 3,
      "text": "The format and description of the optional Info String parameter is the same as for the ASP Up message (See Section 3.3.2.1).",
      "ja": "オプションの情報文字列パラメーターの形式と説明は、ASPアップメッセージと同じです（セクション3.3.2.1を参照）。"
    },
    {
      "indent": 0,
      "text": "3.3.3 Layer Management (MGMT) Messages",
      "section_title": true,
      "ja": "3.3.3 レイヤー管理（MGMT）メッセージ"
    },
    {
      "indent": 0,
      "text": "3.3.3.1 Error (ERR)",
      "section_title": true,
      "ja": "3.3.3.1 エラー（err）"
    },
    {
      "indent": 3,
      "text": "The Error (ERR) message is used to notify a peer of an error event associated with an incoming message. For example, the message type might be unexpected given the current state, or a parameter value might be invalid.",
      "ja": "エラー（ERR）メッセージは、着信メッセージに関連付けられたエラーイベントをピアに通知するために使用されます。たとえば、現在の状態を考慮して、メッセージタイプが予想外になるか、パラメーター値が無効である場合があります。"
    },
    {
      "indent": 3,
      "text": "An Error message MUST not be generated in response to other Error messages.",
      "ja": "他のエラーメッセージに応じてエラーメッセージを生成してはなりません。"
    },
    {
      "indent": 3,
      "text": "The ERR message contains the following parameters:",
      "ja": "ERRメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "Error Code (mandatory) Interface Identifier (optional) Diagnostic Information (optional)",
      "ja": "エラーコード（必須）インターフェイス識別子（オプション）診断情報（オプション）"
    },
    {
      "indent": 3,
      "text": "The format for the ERR message is as follows:",
      "ja": "ERRメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0xc)           |            Length = 8         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Error Code                           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Tag (0x1, 0x3, or 0x8)    |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Interface Identifier(s)*                  /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0x7)           |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Diagnostic Information*                   /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The Error Code parameter indicates the reason for the Error Message. The Error parameter value can be one of the following values:",
      "ja": "エラーコードパラメーターは、エラーメッセージの理由を示します。エラーパラメーター値は、次の値のいずれかになります。"
    },
    {
      "indent": 6,
      "text": "Invalid Version                        0x1\nInvalid Interface Identifier           0x2\nUnsupported Message Class              0x3\nUnsupported Message Type               0x4\nUnsupported Traffic Handling Mode      0x5\nUnexpected Message                     0x6\nProtocol Error                         0x7\nUnsupported Interface Identifier Type  0x8\nInvalid Stream Identifier              0x9\nNot Used in M2UA                       0xa\nNot Used in M2UA                       0xb\nNot Used in M2UA                       0xc\nRefused - Management Blocking          0xd\nASP Identifier Required                0xe\nInvalid ASP Identifier                 0xf\nASP Active for Interface Identifier(s) 0x10\nInvalid Parameter Value                0x11\nParameter Field Error                  0x12\nUnexpected Parameter                   0x13\nNot Used in M2UA                       0x14\nNot Used in M2UA                       0x15\nMissing Parameter                      0x16",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The \"Invalid Version\" error would be sent if a message was received with an invalid or unsupported version. The Error message would contain the supported version in the Common header. The Error message could optionally provide the supported version in the Diagnostic Information area.",
      "ja": "無効またはサポートされていないバージョンでメッセージが受信された場合、「無効なバージョン」エラーが送信されます。エラーメッセージには、共通ヘッダーにサポートされているバージョンが含まれます。エラーメッセージは、オプションで診断情報領域でサポートされているバージョンを提供できます。"
    },
    {
      "indent": 3,
      "text": "The \"Invalid Interface Identifier\" error would be sent by a SGP if an ASP sends a message (i.e. an ASP Active message) with an invalid (not configured) Interface Identifier value. One of the optional Interface Identifier parameters (Integer-based, text-based or integer range) MUST be used with this error code to identify the invalid Interface Identifier(s) received.",
      "ja": "ASPが無効な（構成されていない）インターフェイス識別子値を持つメッセージ（つまりASPアクティブメッセージ）を送信する場合、「無効なインターフェイス識別子」エラーはSGPによって送信されます。オプションのインターフェイス識別子パラメーターの1つ（整数ベース、テキストベース、または整数範囲）をこのエラーコードとともに使用して、受信した無効なインターフェイス識別子を識別する必要があります。"
    },
    {
      "indent": 3,
      "text": "The \"Unsupported Traffic Handling Mode\" error would be sent by a SGP if an ASP sends an ASP Active with an unsupported Traffic Handling Mode. An example would be a case in which the SGP did not support load-sharing. One of the optional Interface Identifier parameters (Integer-based, text-based or integer range) MAY be used with this error code to identify the Interface Identifier(s).",
      "ja": "ASPがサポートされていないトラフィックハンドリングモードを使用してASPがアクティブを送信する場合、「サポートされていないトラフィックハンドリングモード」エラーはSGPによって送信されます。例は、SGPが負荷分担をサポートしなかった場合です。オプションのインターフェイス識別子パラメーターの1つ（整数ベース、テキストベース、または整数範囲）をこのエラーコードで使用して、インターフェイス識別子を識別できます。"
    },
    {
      "indent": 3,
      "text": "The \"Unexpected Message\" error would be sent by an ASP if it received a MAUP message from an SGP while it was in the Inactive state.",
      "ja": "「予期しないメッセージ」エラーは、SGPが非アクティブ状態にある間にSGPからMAUPメッセージを受け取った場合、ASPによって送信されます。"
    },
    {
      "indent": 3,
      "text": "The \"Protocol Error\" error would be sent for any protocol anomaly (i.e. a bogus message).",
      "ja": "「プロトコルエラー」エラーは、プロトコルの異常（つまり、偽のメッセージ）に対して送信されます。"
    },
    {
      "indent": 3,
      "text": "The \"Invalid Stream Identifier\" error would be sent if a message was received on an unexpected SCTP stream (i.e. a MGMT message was received on a stream other than \"0\").",
      "ja": "予期しないSCTPストリームでメッセージが受信された場合、「無効なストリーム識別子」エラーが送信されます（つまり、「0」以外のストリームでMGMTメッセージが受信されました）。"
    },
    {
      "indent": 3,
      "text": "The \"Unsupported Interface Identifier Type\" error would be sent by a SGP if an ASP sends a Text formatted Interface Identifier and the SGP only supports Integer formatted Interface Identifiers. When the ASP receives this error, it will need to resend its message with an Integer formatted Interface Identifier.",
      "ja": "ASPがテキストフォーマットインターフェイス識別子を送信し、SGPがIntegerフォーマットインターフェイス識別子のみをサポートする場合、ASPがテキストフォーマットされたインターフェイス識別子を送信する場合、「サポートされていないインターフェイス識別子タイプ」エラーはSGPによって送信されます。ASPがこのエラーを受信すると、整数フォーマットされたインターフェイス識別子でメッセージを再送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "The \"Unsupported Message Class\" error would be sent if a message with an unexpected or unsupported Message Class is received.",
      "ja": "「サポートされていないメッセージクラス」エラーは、予期しないまたはサポートされていないメッセージクラスを含むメッセージが受信された場合に送信されます。"
    },
    {
      "indent": 3,
      "text": "The \"Refused - Management Blocking\" error is sent when an ASP Up or ASP Active message is received and the request is refused for management reasons (e.g., management lock-out\").",
      "ja": "「拒否された - 管理ブロッキング」エラーは、ASPアップアップまたはASPアクティブメッセージが受信され、管理上の理由（例：管理ロックアウト \"）のためにリクエストが拒否されたときに送信されます。"
    },
    {
      "indent": 3,
      "text": "The \"ASP Identifier Required\" is sent by a SGP in response to an ASPUP message which does not contain an ASP Identifier parameter when the SGP requires one. The ASP SHOULD resend the ASPUP message with an ASP Identifier.",
      "ja": "「ASP識別子が必要」は、SGPが必要な場合にASP識別子パラメーターを含まないASPUPメッセージに応じてSGPによって送信されます。ASPは、ASP識別子を使用してASPUPメッセージを再送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "The \"Invalid ASP Identifier\" is sent by a SGP in response to an ASPUP message with an invalid (i.e. non-unique) ASP Identifier.",
      "ja": "「無効なASP識別子」は、無効な（つまり非統一）ASP識別子を備えたASPUPメッセージに応じてSGPによって送信されます。"
    },
    {
      "indent": 3,
      "text": "The \"ASP Currently Active for Interface Identifier(s)\" error is sent by a SGP when a Deregistration request is received from an ASP that is active for Interface Identifier(s) specified in the Deregistration request. One of the optional Interface Identifier parameters (Integer-based, text-based or integer range) MAY be used with this error code to identify the Interface Identifier(s).",
      "ja": "「インターフェイス識別子に対して現在アクティブになっている」エラーは、Deregistrationリクエストで指定されたインターフェイス識別子に対してアクティブなASPから登録要求が受信されると、SGPによって送信されます。オプションのインターフェイス識別子パラメーターの1つ（整数ベース、テキストベース、または整数範囲）をこのエラーコードで使用して、インターフェイス識別子を識別できます。"
    },
    {
      "indent": 3,
      "text": "The \"Invalid Parameter Value \" error is sent if a message is received with an invalid parameter value (e.g., a State Request with an an undefined State).",
      "ja": "「無効なパラメーター値」エラーは、無効なパラメーター値（未定義の状態を持つ状態要求など）でメッセージが受信された場合に送信されます。"
    },
    {
      "indent": 3,
      "text": "The \"Parameter Field Error\" would be sent if a message with a parameter has a wrong length field.",
      "ja": "パラメーターを持つメッセージに長さのフィールドが間違っている場合、「パラメーターフィールドエラー」が送信されます。"
    },
    {
      "indent": 3,
      "text": "The \"Unexpected Parameter\" error would be sent if a message contains an invalid parameter.",
      "ja": "メッセージに無効なパラメーターが含まれている場合、「予期しないパラメーター」エラーが送信されます。"
    },
    {
      "indent": 3,
      "text": "The \"Missing Parameter\" error would be sent if a mandatory parameter was not included in a message.",
      "ja": "必須パラメーターがメッセージに含まれていない場合、「欠落パラメーター」エラーが送信されます。"
    },
    {
      "indent": 3,
      "text": "The optional Diagnostic information can be any information germane to the error condition, to assist in the identification of the error condition. In the case of an Invalid Version Error Code the Diagnostic information includes the supported Version parameter. In the other cases, the Diagnostic information SHOULD be the first 40 bytes of the offending message.",
      "ja": "オプションの診断情報は、エラー条件の識別を支援するために、エラー条件に対応する情報を任意のものにすることができます。無効なバージョンエラーコードの場合、診断情報にはサポートされているバージョンパラメーターが含まれます。他のケースでは、診断情報は問題の最初の40バイトでなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.3.3.2 Notify (NTFY)",
      "section_title": true,
      "ja": "3.3.3.2 Notify（ntfy）"
    },
    {
      "indent": 3,
      "text": "The Notify message is used to provide an autonomous indication of M2UA events to an M2UA peer.",
      "ja": "Notifyメッセージは、M2UAピアにM2UAイベントの自律的な兆候を提供するために使用されます。"
    },
    {
      "indent": 3,
      "text": "The NTFY message contains the following parameters:",
      "ja": "NTFYメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "Status Type (mandatory) Status Information (mandatory) ASP Identifier (optional) Interface Identifiers (optional) INFO String (optional)",
      "ja": "ステータスタイプ（必須）ステータス情報（必須）ASP識別子（オプション）インターフェイス識別子（オプション）情報文字列（オプション）"
    },
    {
      "indent": 3,
      "text": "The format for the Notify message with Integer-formatted Interface Identifiers is as follows:",
      "ja": "整数形式のインターフェイス識別子を使用したNotifyメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0xd)           |            Length = 8         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        Status Type            |      Status Information       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0x11)          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        ASP Identifier*                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Tag (0x1=integer)         |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Interface Identifiers*                    /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    Tag (0x8=integer range)    |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier Start1*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier Stop1*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier Start2*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier Stop2*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n .                                                             .\n .                                                             .\n .                                                             .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Interface Identifier StartN*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                  Interface Identifier StopN*                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\              Additional Interface Identifiers                 /\n/                    of Tag Type 0x1 or 0x8                     \\\n\\                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x4)             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   The format for the Notify message with Text-formatted Interface\nIdentifiers is as follows:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0xd)           |            Length = 8         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|        Status Type            |      Status Information       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|           Tag (0x11)          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        ASP Identifier*                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|       Tag (0x3=string)        |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                     Interface Identifier*                     /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\              Additional Interface Identifiers                 /\n/                        of Tag Type 0x3                        \\\n\\                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag (0x4)             |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               \\\n\\                          INFO String*                         /\n/                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The Status Type parameter identifies the type of the Notify message. The following are the valid Status Type values:",
      "ja": "ステータスタイプパラメーターは、Notifyメッセージのタイプを識別します。以下は、有効なステータスタイプの値です。"
    },
    {
      "indent": 6,
      "text": "Value Description 0x1 Application Server state change (AS_State_Change) 0x2 Other",
      "ja": "値説明0x1アプリケーションサーバー状態変更（as_state_change）0x2その他"
    },
    {
      "indent": 3,
      "text": "The Status Information parameter contains more detailed information for the notification, based on the value of the Status Type. If the Status Type is AS_State_Change the following Status Information values are used:",
      "ja": "ステータス情報パラメーターには、ステータスタイプの値に基づいて、通知の詳細情報が含まれています。ステータスタイプがas_state_changeの場合、次のステータス情報値が使用されます。"
    },
    {
      "indent": 6,
      "text": "Value Description 1 reserved 2 Application Server Inactive (AS_Inactive) 3 Application Server Active (AS_Active) 4 Application Server Pending (AS_Pending)",
      "ja": "値説明1予約済み2アプリケーションサーバーInactive（AS_INACTIVE）3アプリケーションサーバーActive（AS_ACTIVE）4アプリケーションサーバーPENDENS（AS_PENDING）"
    },
    {
      "indent": 3,
      "text": "These notifications are sent from an SGP to an ASP upon a change in status of a particular Application Server. The value reflects the new state of the Application Server. The Interface Identifiers of the AS MAY be placed in the message if desired.",
      "ja": "これらの通知は、特定のアプリケーションサーバーのステータスの変更により、SGPからASPに送信されます。値は、アプリケーションサーバーの新しい状態を反映しています。ASのインターフェイス識別子は、必要に応じてメッセージに配置できます。"
    },
    {
      "indent": 3,
      "text": "If the Status Type is Other, then the following Status Information values are defined:",
      "ja": "ステータスタイプが他の場合、次のステータス情報値が定義されています。"
    },
    {
      "indent": 6,
      "text": "Value Description 1 Insufficient ASP resources active in AS 2 Alternate ASP Active 3 ASP Failure",
      "ja": "値の説明1 2代替ASPアクティブ3 ASP障害としてアクティブにアクティブ不十分なASPリソース"
    },
    {
      "indent": 3,
      "text": "In the Insufficient ASP Resources case, the SGP is indicating to an ASP-INACTIVE ASP(s) in the AS that another ASP is required in order to handle the load of the AS (Load-sharing mode). For the Alternate ASP Active case, the formerly Active ASP is informed when an alternate ASP transitions to the ASP Active state in Override mode. The ASP Identifier (if available) of the Alternate ASP MUST be placed in the message. For the ASP Failure case, the SGP is indicating to ASP(s) in the AS that one of the ASPs has transitioned to ASP-DOWN. The ASP Identifier (if available) of the failed ASP MUST be placed in the message.",
      "ja": "ASPリソースが不十分な場合、SGPは、AS（負荷シェアリングモード）の負荷を処理するために別のASPが必要であるASのASP不活性ASPを示しています。代替ASPアクティブケースの場合、以前はアクティブなASPが、オーバーライドモードのASPアクティブ状態に代替のASPが移行すると通知されます。代替ASPのASP識別子（利用可能な場合）をメッセージに配置する必要があります。ASP障害の場合、SGPはASPの1つがASPダウンに移行したASのASPを示しています。故障したASPのASP識別子（利用可能な場合）をメッセージに配置する必要があります。"
    },
    {
      "indent": 3,
      "text": "For each of the Status Information values in Status Type Other, the Interface Identifiers of the affected AS MAY be placed in the message if desired.",
      "ja": "ステータスタイプのステータス情報値のそれぞれについて、必要に応じてメッセージに配置される可能性のある影響を受ける場合のインターフェイス識別子。"
    },
    {
      "indent": 3,
      "text": "The format of the optional Interface Identifier parameter is the same as for the ASP Active message (See Section 3.3.2.7).",
      "ja": "オプションのインターフェイス識別子パラメーターの形式は、ASPアクティブメッセージと同じです（セクション3.3.2.7を参照）。"
    },
    {
      "indent": 3,
      "text": "The format and description of the optional Info String parameter is the same as for the ASP Up message (See Section 3.3.2.1).",
      "ja": "オプションの情報文字列パラメーターの形式と説明は、ASPアップメッセージと同じです（セクション3.3.2.1を参照）。"
    },
    {
      "indent": 0,
      "text": "3.3.4 Interface Identifier Management (IIM) Messages",
      "section_title": true,
      "ja": "3.3.4 インターフェイス識別子管理（IIM）メッセージ"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier Management messages are optional. They are used to support the automatic allocation of Signalling Terminals or Signalling Data Links [2][3].",
      "ja": "インターフェイス識別子管理メッセージはオプションです。これらは、シグナリング端子または信号データリンクの自動割り当てをサポートするために使用されます[2] [3]。"
    },
    {
      "indent": 0,
      "text": "3.3.4.1 Registration Request (REG REQ)",
      "section_title": true,
      "ja": "3.3.4.1 登録リクエスト（Reg Req）"
    },
    {
      "indent": 3,
      "text": "The REG REQ message is sent by an ASP to indicate to a remote M2UA peer that it wishes to register one or more given Link Keys with the remote peer. Typically, an ASP would send this message to an SGP, and expect to receive a REG RSP in return with an associated Interface Identifier value.",
      "ja": "Reg Reqメッセージは、ASPによって送信され、リモートM2UAピアに、1つ以上の指定されたリンクキーをリモートピアに登録したいことが示されます。通常、ASPはこのメッセージをSGPに送信し、関連するインターフェイス識別子値と見返りにREG RSPを受信することを期待します。"
    },
    {
      "indent": 3,
      "text": "The REG REQ message contains the following parameter:",
      "ja": "REG REQメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "Link Key (mandatory)",
      "ja": "リンクキー（必須）"
    },
    {
      "indent": 3,
      "text": "The format for the REG REQ message is as follows",
      "ja": "Reg Reqメッセージの形式は次のとおりです"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag = 0x0309          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                           Link Key 1                          /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                              ...                              /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag = 0x0309          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                           Link Key n                          /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Link Key: fixed length",
      "ja": "リンクキー：固定長"
    },
    {
      "indent": 6,
      "text": "The Link Key parameter is mandatory. The sender of this message expects that the receiver of this message will create a Link Key entry and assign a unique Interface Identifier value to it, if the Link Key entry does not yet exist.",
      "ja": "リンクキーパラメーターは必須です。このメッセージの送信者は、このメッセージの受信者がリンクキーエントリを作成し、リンクキーエントリがまだ存在しない場合、一意のインターフェイス識別子値を割り当てることを期待しています。"
    },
    {
      "indent": 6,
      "text": "The Link Key parameter may be present multiple times in the same message. This is used to allow the registration of multiple Link Keys in a single message.",
      "ja": "リンクキーパラメーターは、同じメッセージに複数回存在する場合があります。これは、単一のメッセージで複数のリンクキーを登録できるようにするために使用されます。"
    },
    {
      "indent": 3,
      "text": "The format of the Link Key parameter is as follows:",
      "ja": "リンクキーパラメーターの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Local-LK-Identifier                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                 Signalling Data Terminal Identifier           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   Signalling Data Link Identifier             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Local-LK-Identifier: 32-bit integer",
      "ja": "Local-LK-Identifier：32ビット整数"
    },
    {
      "indent": 6,
      "text": "The mandatory Local-LK-Identifier field is used to uniquely (between ASP and SGP) identify the registration request. The Identifier value is assigned by the ASP, and is used to correlate the response in a REG RSP message with the original registration request. The Identifier value MUST remain unique until the REG RSP is received.",
      "ja": "必須のローカルLK-IDINTIFIERフィールドは、登録要求を識別するために（ASPとSGPの間）一意に（ASPとSGPの間）使用されます。識別子値はASPによって割り当てられ、REG RSPメッセージの応答を元の登録要求と相関させるために使用されます。識別子値は、REG RSPを受信するまで一意のままでなければなりません。"
    },
    {
      "indent": 6,
      "text": "The format of the Local-LK-Identifier field is as follows:",
      "ja": "Local-LK-Identifierフィールドの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag = 0x030a          |         Length = 8            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    Local-LK-Identifier value                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   Signalling Data Terminal Identifier",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "The Signalling Data Terminal Identifier parameter is mandatory. It identifies the Signalling Data Terminal associated with the SS7 link for which the ASP is registering. The format is as follows:",
      "ja": "信号データ端子識別子パラメーターが必須です。ASPが登録しているSS7リンクに関連付けられた信号データ端末を識別します。フォーマットは次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag = 0x030b          |         Length = 8            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Reserved             |        SDT Identifier         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "The SDT Identifier is a 32-bit unsigned value which may only be significant to 12 or 14 bits depending on the SS7 variant which is supported by the MTP Level 3 at the ASP. Insignificant SDT Identifier bits are coded 0.",
      "ja": "SDT識別子は、ASPのMTPレベル3でサポートされているSS7バリアントに応じて、12ビットまたは14ビットにのみ有意である可能性がある32ビットの署名値です。重要ではないSDT識別子ビットはコード化されています。"
    },
    {
      "indent": 3,
      "text": "Signalling Data Link Identifier",
      "ja": "シグナリングデータリンク識別子"
    },
    {
      "indent": 6,
      "text": "The Signalling Data Link Identifier parameter is mandatory. It identifies the Signalling Data Link Identifier associated with the SS7 link for which the ASP is registering. The format is as follows:",
      "ja": "信号データリンク識別子パラメーターは必須です。ASPが登録しているSS7リンクに関連付けられた信号データリンク識別子を識別します。フォーマットは次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag = 0x030c          |         Length = 8            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Reserved             |        SDL Identifier         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "The SDL Identifier is a 32-bit unsigned value which may only be significant to 12 or 14 bits depending on the SS7 variant which is supported by the MTP Level 3 at the ASP. Insignificant SDLI bits are coded 0.",
      "ja": "SDL識別子は、ASPのMTPレベル3でサポートされているSS7バリアントに応じて、12ビットまたは14ビットにのみ有意である可能性がある32ビットの非署名値です。取るに足らないsdliビットはコード化されています0。"
    },
    {
      "indent": 0,
      "text": "3.3.4.2 Registration Response (REG RSP)",
      "section_title": true,
      "ja": "3.3.4.2 登録応答（REG RSP）"
    },
    {
      "indent": 3,
      "text": "The REG RSP message is used as a response to the REG REQ message from a remote M2UA peer. It contains indications of success/failure for registration requests and returns a unique Interface Identifier value for successful registration requests, to be used in subsequent M2UA Traffic Management protocol.",
      "ja": "REG RSPメッセージは、リモートM2UAピアからのREG REQメッセージへの応答として使用されます。登録要求の成功/失敗の兆候が含まれており、登録要求を成功させるために一意のインターフェイス識別子値を返し、その後のM2UAトラフィック管理プロトコルで使用します。"
    },
    {
      "indent": 3,
      "text": "The REG RSP message contains the following parameter:",
      "ja": "REG RSPメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "Registration Results (mandatory)",
      "ja": "登録結果（必須）"
    },
    {
      "indent": 3,
      "text": "The format for the REG RSP message is as follows:",
      "ja": "REG RSPメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag = 0x030d          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                    Registration Result 1                      /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                              ...                              /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag = 0x030d          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                    Registration Result n                      /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Registration Results: fixed length",
      "ja": "登録結果：固定長"
    },
    {
      "indent": 6,
      "text": "The Registration Results parameter contains one or more results, each containing the registration status for a single Link Key in the REG REQ message. The number of results in a single REG RSP message MAY match the number of Link Key parameters found in the corresponding REG REQ message. The format of each result is as follows:",
      "ja": "登録結果パラメーターには1つ以上の結果が含まれており、それぞれにreg reqメッセージの単一のリンクキーの登録ステータスが含まれています。単一のREG RSPメッセージの結果の数は、対応するREG REQメッセージで見つかったリンクキーパラメーターの数と一致する場合があります。各結果の形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Local-LK-Identifier                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Registration Status                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Interface Identifier                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   Local-LK-Identifier:  32-bit integer",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "The Local-LK-Identifier contains the same value as found in the matching Link Key parameter found in the REG REQ message. The format of the Local-LK-Identifier is shown in Section 3.3.4.1.",
      "ja": "Local-LK-Identifierには、Reg Reqメッセージにある一致するリンクキーパラメーターにあるのと同じ値が含まれています。Local-LK-Identifierの形式は、セクション3.3.4.1に示されています。"
    },
    {
      "indent": 3,
      "text": "Registration Status: 32-bit integer",
      "ja": "登録ステータス：32ビット整数"
    },
    {
      "indent": 6,
      "text": "The Registration Result Status field indicates the success or the reason for failure of a registration request.",
      "ja": "登録結果ステータスフィールドは、登録要求の成功または失敗の理由を示します。"
    },
    {
      "indent": 6,
      "text": "Its values may be one of the following:",
      "ja": "その値は次のいずれかです。"
    },
    {
      "indent": 12,
      "text": "0 Successfully Registered 1 Error - Unknown 2 Error - Invalid SDLI 3 Error - Invalid SDTI 4 Error - Invalid Link Key 5 Error - Permission Denied 6 Error - Overlapping (Non-unique) Link Key 7 Error - Link Key not Provisioned 8 Error - Insufficient Resources",
      "ja": "0正常に登録された1エラー - 不明2エラー - 無効なSDLI 3エラー - 無効なSDTI 4エラー - 無効なリンクキー5エラー - 許可拒否6エラー - オーバーラップ（非ユニーク）リンクキー7エラー - リンクキーなしプロビジョニング8エラー - 不十分なリソース"
    },
    {
      "indent": 6,
      "text": "The format of the Registration Status field is as follows:",
      "ja": "登録ステータスフィールドの形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag = 0x030e          |         Length = 8            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Registration Status                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Interface Identifier: 32-bit integer",
      "ja": "インターフェイス識別子：32ビット整数"
    },
    {
      "indent": 6,
      "text": "The Interface Identifier field contains the Interface Identifier for the associated Link Key if the registration is successful. It is set to \"0\" if the registration was not successful. The format of integer-based and text-based Interface Identifier parameters are shown in Section 3.2.",
      "ja": "インターフェイス識別子フィールドには、登録が成功した場合、関連するリンクキーのインターフェイス識別子が含まれています。登録が成功しなかった場合、「0」に設定されています。整数ベースおよびテキストベースのインターフェイス識別子パラメーターの形式をセクション3.2に示します。"
    },
    {
      "indent": 0,
      "text": "3.3.4.3 De-Registration Request (DEREG REQ)",
      "section_title": true,
      "ja": "3.3.4.3 登録解除リクエスト（dereg req）"
    },
    {
      "indent": 3,
      "text": "The DEREG REQ message is sent by an ASP to indicate to a remote M2UA peer that it wishes to de-register a given Interface Identifier. Typically, an ASP would send this message to an SGP, and expects to receive a DEREG RSP in return reflecting the Interface Identifier and containing a de-registration status.",
      "ja": "dereg reqメッセージは、特定のインターフェイス識別子を解除したいことをリモートM2UAピアに示すためにASPによって送信されます。通常、ASPはこのメッセージをSGPに送信し、インターフェイス識別子を反映し、登録解除ステータスを含むDereg RSPを受け取ることを期待しています。"
    },
    {
      "indent": 3,
      "text": "The DEREG REQ message contains the following parameter:",
      "ja": "dereg reqメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "Interface Identifier (mandatory)",
      "ja": "インターフェイス識別子（必須）"
    },
    {
      "indent": 3,
      "text": "The format for the DEREG REQ message is as follows:",
      "ja": "dereg reqメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Tag = 0x1 or 0x3          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                    Interface Identifier 1                     /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                              ...                              /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Tag = 0x1 or 0x3          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                    Interface Identifier n                     /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Interface Identifier",
      "ja": "インターフェイス識別子"
    },
    {
      "indent": 6,
      "text": "The Interface Identifier parameter contains a Interface Identifier indexing the Application Server traffic that the sending ASP is currently registered to receive from the SGP but now wishes to de-register. The format of integer-based and text-based Interface Identifier parameters are shown in Section 3.2.",
      "ja": "インターフェイス識別子パラメーターには、SGPから受信するために送信ASPが現在登録されているが、現在は登録を希望するアプリケーションサーバートラフィックをインデックスするインターフェイス識別子インデックスが含まれています。整数ベースおよびテキストベースのインターフェイス識別子パラメーターの形式をセクション3.2に示します。"
    },
    {
      "indent": 0,
      "text": "3.3.4.4 De-Registration Response (DEREG RSP)",
      "section_title": true,
      "ja": "3.3.4.4 登録解除（dereg rsp）"
    },
    {
      "indent": 3,
      "text": "The DEREG RSP message is used as a response to the DEREG REQ message from a remote M2UA peer.",
      "ja": "Dereg RSPメッセージは、リモートM2UAピアからのDereg Reqメッセージへの応答として使用されます。"
    },
    {
      "indent": 3,
      "text": "The DEREG RSP message contains the following parameter:",
      "ja": "Dereg RSPメッセージには、次のパラメーターが含まれています。"
    },
    {
      "indent": 6,
      "text": "De-Registration Results (mandatory)",
      "ja": "登録解除結果（必須）"
    },
    {
      "indent": 3,
      "text": "The format for the DEREG RSP message is as follows:",
      "ja": "Dereg RSPメッセージの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag = 0x030f          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                  De-Registration Result 1                     /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                              ...                              /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag = 0x030f          |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n\\                                                               \\\n/                  De-Registration Result n                     /\n\\                                                               \\\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "De-Registration Results: fixed length",
      "ja": "登録解除結果：固定長"
    },
    {
      "indent": 6,
      "text": "The De-Registration Results parameter contains one or more results, each containing the de-registration status for a single Interface Identifier in the DEREG REQ message. The number of results in a single DEREG RSP message MAY match the number of Interface Identifier parameters found in the corresponding DEREG REQ message. The format of each result is as follows:",
      "ja": "登録解除結果パラメーターには1つ以上の結果が含まれており、それぞれがDEREG REQメッセージの単一のインターフェイス識別子の登録脱レジスタレーションステータスを含んでいます。単一のDereg RSPメッセージの結果の数は、対応するDereg Reqメッセージにあるインターフェイス識別子パラメーターの数と一致する場合があります。各結果の形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                      Interface Identifier                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     De-Registration Status                    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Interface Identifier: 32-bit integer",
      "ja": "インターフェイス識別子：32ビット整数"
    },
    {
      "indent": 6,
      "text": "The Interface Identifier field contains the Interface Identifier value of the matching Link Key to de-register, as found in the DEREG REQ. The format of integer-based and text-based Interface Identifier parameters are shown in Section 3.2.",
      "ja": "インターフェイス識別子フィールドには、dereg reqに見られるように、一致するリンクキーのインターフェイス識別子値が削除されます。整数ベースおよびテキストベースのインターフェイス識別子パラメーターの形式をセクション3.2に示します。"
    },
    {
      "indent": 3,
      "text": "De-Registration Status: 32-bit integer",
      "ja": "再登録ステータス：32ビット整数"
    },
    {
      "indent": 6,
      "text": "The De-Registration Result Status field indicates the success or the reason for failure of the de-registration.",
      "ja": "登録解除結果ステータスフィールドは、登録解除の成功または失敗の理由を示します。"
    },
    {
      "indent": 6,
      "text": "Its values may be one of the following:",
      "ja": "その値は次のいずれかです。"
    },
    {
      "indent": 12,
      "text": "0 Successfully De-registered 1 Error - Unknown 2 Error - Invalid Interface Identifier 3 Error - Permission Denied 4 Error - Not Registered",
      "ja": "0正常に登録された1エラー - 不明2エラー - 無効なインターフェイス識別子3エラー - 許可拒否4エラー - 登録されていない"
    },
    {
      "indent": 6,
      "text": "The format of the De-Registration Status field is as follows:",
      "ja": "登録ステータスフィールドの形式は次のとおりです。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         Tag = 0x0310          |         Length = 8            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                    De-Registration Status                     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4.0 Procedures",
      "section_title": true,
      "ja": "4.0 手順"
    },
    {
      "indent": 3,
      "text": "The M2UA layer needs to respond to various primitives it receives from other layers as well as messages it receives from the peer-to-peer messages. This section describes various procedures involved in response to these events.",
      "ja": "M2UA層は、他のレイヤーから受け取るさまざまなプリミティブや、ピアツーピアのメッセージから受け取るメッセージに応答する必要があります。このセクションでは、これらのイベントに対応するために関与するさまざまな手順について説明します。"
    },
    {
      "indent": 0,
      "text": "4.1 Procedures to Support the M2UA-User Layer",
      "section_title": true,
      "ja": "4.1 M2UAユーザー層をサポートする手順"
    },
    {
      "indent": 3,
      "text": "These procedures achieve the M2UA layer \"Transport of MTP Level 2 / MTP Level 3 boundary\" service.",
      "ja": "これらの手順は、M2UA層「MTPレベル2 / MTPレベル3境界の輸送」サービスを実現します。"
    },
    {
      "indent": 0,
      "text": "4.1.1 MTP Level 2 / MTP Level 3 Boundary Procedures",
      "section_title": true,
      "ja": "4.1.1 MTPレベル2 / MTPレベル3境界手順"
    },
    {
      "indent": 3,
      "text": "On receiving a primitive from the local upper layer, the M2UA layer will send the corresponding MAUP message (see Section 3) to its peer. The M2UA layer MUST fill in various fields of the common and specific headers correctly. In addition the message SHOULD be sent on the SCTP stream that corresponds to the SS7 link.",
      "ja": "ローカルの上層から原始を受信すると、M2UA層は、対応するMAUPメッセージ（セクション3を参照）をピアに送信します。M2UA層は、一般的なヘッダーと特定のヘッダーのさまざまなフィールドを正しく埋める必要があります。さらに、メッセージは、SS7リンクに対応するSCTPストリームに送信する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.1.2 MAUP Message Procedures",
      "section_title": true,
      "ja": "4.1.2 maupメッセージ手順"
    },
    {
      "indent": 3,
      "text": "On receiving MAUP messages from a peer M2UA layer, the M2UA layer on an SG or MGC needs to invoke the corresponding layer primitives to the local MTP Level 2 or MTP Level 3 layer.",
      "ja": "ピアM2UAレイヤーからMAUPメッセージを受信すると、SGまたはMGCのM2UAレイヤーは、対応するレイヤープリミティブをローカルMTPレベル2またはMTPレベル3レイヤーに呼び出す必要があります。"
    },
    {
      "indent": 0,
      "text": "4.2 Receipt of Primitives from the Layer Management",
      "section_title": true,
      "ja": "4.2 レイヤー管理からのプリミティブの受領"
    },
    {
      "indent": 3,
      "text": "On receiving primitives from the local Layer Management, the M2UA layer will take the requested action and provide an appropriate response primitive to Layer Management.",
      "ja": "ローカル層管理からプリミティブを受信すると、M2UA層は要求されたアクションを取り、層管理に原始的な適切な応答を提供します。"
    },
    {
      "indent": 3,
      "text": "An M-SCTP_ESTABLISH request primitive from Layer Management at an ASP will initiate the establishment of an SCTP association. The M2UA layer will attempt to establish an SCTP association with the remote M2UA peer by sending an SCTP-ASSOCIATE primitive to the local SCTP layer.",
      "ja": "ASPでのレイヤー管理からのM-SCTP_ESTABLISHリクエストは、SCTP協会の確立を開始します。M2UAレイヤーは、SCTP関連原始をローカルSCTP層に送信することにより、リモートM2UAピアとのSCTP関連を確立しようとします。"
    },
    {
      "indent": 3,
      "text": "When an SCTP association has been successfully established, the SCTP will send an SCTP-COMMUNICATION_UP notification primitive to the local M2UA layer. At the SGP that initiated the request, the M2UA layer will send an M-SCTP_ESTABLISH confirm primitive to Layer Management when the association setup is complete. At the peer M2UA layer, an M-SCTP_ESTABLISH indication primitive is sent to Layer Management upon successful completion of an incoming SCTP association setup.",
      "ja": "SCTP協会が正常に確立された場合、SCTPはSCTP-Communication_up通知をローカルM2UA層にプリミティブに送信します。リクエストを開始したSGPでは、M2UAレイヤーは、Associationのセットアップが完了したときにM-SCTP_ESTABLISH確認プリミティブをレイヤー管理に送信します。ピアM2UAレイヤーでは、M-SCTP_ESTABLISH INDICONICITIONプリミティブが、着信SCTPアソシエーションのセットアップが正常に完了すると、レイヤー管理に送信されます。"
    },
    {
      "indent": 3,
      "text": "An M-SCTP_RELEASE request primitive from Layer Management initiates the shutdown of an SCTP association. The M2UA layer accomplishes a graceful shutdown of the SCTP association by sending an SCTP-SHUTDOWN primitive to the SCTP layer.",
      "ja": "レイヤー管理からのM-SCTP_RELEASEリクエストプリミティブは、SCTP協会のシャットダウンを開始します。M2UA層は、SCTP層にSCTP-Shutdownプリミティブを送信することにより、SCTP関連の優雅なシャットダウンを達成します。"
    },
    {
      "indent": 3,
      "text": "When the graceful shutdown of the SCTP association has been accomplished, the SCTP layer returns an SCTP-SHUTDOWN_COMPLETE notification primitive to the local M2UA layer. At the M2UA Layer that initiated the request, the M2UA layer will send an M-SCTP_RELEASE confirm primitive to Layer Management when the association shutdown is complete. At the peer M2UA Layer, an M-SCTP_RELEASE indication primitive is sent to Layer Management upon abort or successful shutdown of an SCTP association.",
      "ja": "SCTP協会の優雅なシャットダウンが達成されると、SCTPレイヤーはSCTP-Shutdown_complete通知をローカルM2UAレイヤーの原始的な通知を返します。リクエストを開始したM2UAレイヤーでは、M2UAレイヤーがM-SCTP_RELEESEを送信し、Associationのシャットダウンが完了したときに層管理にプリミティブを確認します。ピアM2UAレイヤーでは、M-SCTP_RELEESE表示プリミティブが、SCTP協会の中止または成功したシャットダウン時に層管理に送信されます。"
    },
    {
      "indent": 3,
      "text": "An M-SCTP_STATUS request primitive supports a Layer Management query of the local status of a particular SCTP association. The M2UA layer simply maps the M-SCTP_STATUS request primitive to an SCTP-STATUS primitive to the SCTP layer. When the SCTP responds, the M2UA layer maps the association status information to an M-SCTP_STATUS confirm primitive. No peer protocol is invoked.",
      "ja": "M-SCTP_STATUSリクエストPrimitiveは、特定のSCTP協会のローカルステータスのレイヤー管理クエリをサポートします。M2UAレイヤーは、単にM-SCTP_STATUS要求をMAPPITITITIVETITITITIVETS TO SCCTP Layerにマッピングします。SCTPが応答すると、M2UAレイヤーはAssociationステータス情報をM-SCTP_STATUSにマッピングします。ピアプロトコルは呼び出されません。"
    },
    {
      "indent": 3,
      "text": "Similar LM-to-M2UA-to-SCTP and/or SCTP-to-M2UA-to-LM primitive mappings can be described for the various other SCTP Upper Layer primitives in RFC 2960 [8] such as INITIALIZE, SET PRIMARY, CHANGE HEARTBEAT, REQUEST HEARTBEAT, GET SRTT REPORT, SET FAILURE THRESHOLD, SET PROTOCOL PARAMETERS, DESTROY SCTP INSTANCE, SEND FAILURE, AND NETWORK STATUS CHANGE. Alternatively, these SCTP Upper Layer primitives (and Status as well) can be considered for modeling purposes as a Layer Management interaction directly with the SCTP Layer.",
      "ja": "同様のLM-T-M2UA-to-SCTPおよび/またはSCTP-to-M2UA-to-LMプリミティブマッピングは、初期化、プライマリの設定、ハートビートの変更など、RFC 2960 [8]の他のさまざまなSCTP上層プリミティブについて説明できます。、ハートビートを要求し、SRTTレポートを取得し、障害しきい値を設定し、プロトコルパラメーターを設定し、SCTPインスタンスを破壊し、障害を送信し、ネットワークステータスの変更を行います。あるいは、これらのSCTP上層プリミティブ（およびステータスも同様に）を、SCTP層との層管理の相互作用としてモデリング目的で考慮することができます。"
    },
    {
      "indent": 3,
      "text": "M-NOTIFY indication and M-ERROR indication primitives indicate to Layer Management the notification or error information contained in a received M2UA Notify or Error message respectively. These indications can also be generated based on local M2UA events.",
      "ja": "m-notifyの表示とm-error表示プリミティブは、受信したM2UA通知またはエラーメッセージにそれぞれ含まれる通知またはエラー情報を層管理に示します。これらの適応症は、ローカルM2UAイベントに基づいて生成することもできます。"
    },
    {
      "indent": 3,
      "text": "An M-ASP_STATUS request primitive supports a Layer Management query of the status of a particular local or remote ASP. The M2UA layer responds with the status in an M-ASP_STATUS confirm primitive. No M2UA peer protocol is invoked.",
      "ja": "M-ASP_STATUSリクエストプリミティブは、特定のローカルまたはリモートASPのステータスのレイヤー管理クエリをサポートします。M2UAレイヤーは、M-ASP_STATUSの原始的な確認のステータスで応答します。M2UAピアプロトコルは呼び出されません。"
    },
    {
      "indent": 3,
      "text": "An M-AS_STATUS request supports a Layer Management query of the status of a particular AS. The M2UA responds with an M-AS_STATUS confirm primitive. No M2UA peer protocol is invoked.",
      "ja": "M-AS_STATUSリクエストは、特定のASのステータスのレイヤー管理クエリをサポートします。M2UAは、M-AS_STATUSの原始確認で応答します。M2UAピアプロトコルは呼び出されません。"
    },
    {
      "indent": 3,
      "text": "M-ASP_UP request, M-ASP_DOWN request, M-ASP_ACTIVE request and M-ASP_INACTIVE request primitives allow Layer Management at an ASP to initiate state changes. Upon successful completion, a corresponding confirm primitive is provided by the M2UA layer to Layer Management. If an invocation is unsuccessful, an Error indication primitive is provided in the primitive. These requests result in outgoing ASP Up, ASP Down, ASP Active and ASP Inactive messages to the remote M2UA peer at an SGP.",
      "ja": "M-ASP_UPリクエスト、M-ASP_DOWNリクエスト、M-ASP_ACTIVEリクエスト、およびM-ASP_INACTIVEリクエストPrimitivesにより、ASPでレイヤー管理が状態の変更を開始できます。正常に完了すると、M2UA層から層管理に対応する確認原始が提供されます。呼び出しが失敗した場合、プリミティブでエラー表示プリミティブが提供されます。これらの要求により、SGPでのリモートM2UAピアに対するASPダウン、ASPダウン、ASPアクティブ、ASPの非アクティブなメッセージが発信されます。"
    },
    {
      "indent": 0,
      "text": "4.2.1 Receipt of M2UA Peer Management Messages",
      "section_title": true,
      "ja": "4.2.1 M2UAピア管理メッセージの受信"
    },
    {
      "indent": 3,
      "text": "Upon successful state changes resulting from reception of ASP Up, ASP Down, ASP Active and ASP Inactive messages from a peer M2UA, the M2UA layer SHOULD invoke corresponding M-ASP_UP, M-ASP_DOWN, M-ASP_ACTIVE and M-ASP_INACTIVE, M-AS_ACTIVE, M-AS_INACTIVE, and M-AS_DOWN indication primitives to the local Layer Management.",
      "ja": "ピアM2UAからのASP、ASPダウン、ASPアクティブ、ASPの非アクティブなメッセージの受容に起因する状態の変化が成功すると、M2UAレイヤーは対応するM-ASP_UP、M-ASP_DOWN、M-ASP_ACTIVE、M-ASP_INACTIVE、M-AS_ACTIVEを呼び出す必要があります、m-as_inactive、およびm-as_downの表示プリミティブは、ローカル層管理に対するプリミティブです。"
    },
    {
      "indent": 3,
      "text": "M-NOTIFY indication and M-ERROR indication primitives indicate to Layer Management the notification or error information contained in a received M2UA Notify or Error message. These indications can also be generated based on local M2UA events.",
      "ja": "m-notifyの表示とm-error表示プリミティブは、受信したM2UA通知またはエラーメッセージに含まれる通知またはエラー情報を層管理に示します。これらの適応症は、ローカルM2UAイベントに基づいて生成することもできます。"
    },
    {
      "indent": 3,
      "text": "All MGMT messages, except BEAT and BEAT Ack, SHOULD be sent with sequenced delivery to ensure ordering. All MGMT messages, with the exception of ASPTM, BEAT and BEAT Ack messages, SHOULD be sent on SCTP stream '0'. All ASPTM messages SHOULD be sent on the stream which normally carries the data traffic to which the message applies. BEAT and BEAT Ack messages MAY be sent using out-of-order delivery, and MAY be sent on any stream.",
      "ja": "beat and beat ackを除くすべてのMGMTメッセージは、注文を確実にするためにシーケンスされた配信で送信する必要があります。すべてのMGMTメッセージは、ASPTMを除き、ACKメッセージを打ち負かし、倒すことを除き、SCTPストリーム '0'で送信する必要があります。すべてのASPTMメッセージは、通常、メッセージが適用されるデータトラフィックを運ぶストリームに送信する必要があります。beat and beat ackメッセージは、オーダーアウトオブオーダー配信を使用して送信され、任意のストリームで送信される場合があります。"
    },
    {
      "indent": 0,
      "text": "4.3 AS and ASP State Maintenance",
      "section_title": true,
      "ja": "4.3 ASおよびASP状態のメンテナンス"
    },
    {
      "indent": 3,
      "text": "The M2UA layer on the SGP maintains the state of each remote ASP, in each Application Server that the ASP is configured to receive traffic, as input to the M2UA message distribution function.",
      "ja": "SGP上のM2UAレイヤーは、各アプリケーションサーバーで、M2UAメッセージ分布関数への入力として、ASPがトラフィックを受信するように構成されているという各アプリケーションサーバーの各リモートASPの状態を維持します。"
    },
    {
      "indent": 0,
      "text": "4.3.1 ASP States",
      "section_title": true,
      "ja": "4.3.1 ASP州"
    },
    {
      "indent": 3,
      "text": "The state of each remote ASP, in each AS that it is configured to operate, is maintained in the M2UA layer in the SGP. The state of a particular ASP in a particular AS changes due to events. The events include:",
      "ja": "各リモートASPの状態は、それぞれが動作するように構成されているように、SGPのM2UA層で維持されます。イベントによる変化として特定のASPの特定のASPの状態。イベントには以下が含まれます："
    },
    {
      "indent": 3,
      "text": "* Reception of messages from the peer M2UA layer at the ASP;\n\n* Reception of some messages from the peer M2UA layer at other ASPs in the AS (e.g., ASP Active message indicating \"Override\");\n\n* Reception of indications from the SCTP layer; or\n\n* Local Management intervention.",
      "ja": "* ASPでのピアM2UAレイヤーからのメッセージの受信。\n\n* ASの他のASPでのピアM2UAレイヤーからのいくつかのメッセージの受信（たとえば、「オーバーライド」を示すASPアクティブメッセージ）;\n\n* SCTP層からの適応症の受信。または\n\n*ローカル管理介入。"
    },
    {
      "indent": 3,
      "text": "The ASP state transition diagram is shown in Figure 5. The possible states of an ASP are:",
      "ja": "ASP状態遷移図を図5に示します。ASPの可能な状態は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "ASP-DOWN: The remote M2UA peer at the ASP is unavailable and/or the related SCTP association is down. Initially all ASPs will be in this state. An ASP in this state SHOULD NOT be sent any M2UA messages, with the exception of Heartbeat, ASP Down Ack and Error messages.",
      "ja": "ASPダウン：ASPのリモートM2UAピアは利用できず、関連するSCTP協会がダウンしています。当初、すべてのASPがこの状態になります。この状態のASPは、ハートビート、ASPダウンACK、エラーメッセージを除き、M2UAメッセージを送信しないでください。"
    },
    {
      "indent": 3,
      "text": "ASP-INACTIVE: The remote M2UA peer at the ASP is available (and the related SCTP association is up) but application traffic is stopped. In this state the ASP MAY be sent any non-MAUP M2UA messages.",
      "ja": "ASP-Inactive：ASPのリモートM2UAピアが利用可能です（および関連するSCTPアソシエーションは増加しています）が、アプリケーショントラフィックは停止します。この状態では、ASPに非maup m2UAメッセージが送信される場合があります。"
    },
    {
      "indent": 3,
      "text": "ASP-ACTIVE: The remote M2UA peer at the ASP is available and application traffic is active (for a particular Interface Identifier or set of Interface Identifiers).",
      "ja": "ASPアクティブ：ASPのリモートM2UAピアが利用可能で、アプリケーショントラフィックがアクティブになります（特定のインターフェイス識別子またはインターフェイス識別子のセットの場合）。"
    },
    {
      "indent": 20,
      "text": "Figure 5: ASP State Transition Diagram",
      "ja": "図5：ASP状態遷移図"
    },
    {
      "indent": 5,
      "text": "                                 +--------------+\n                                 |  ASP-ACTIVE  |\n          +----------------------|              |\n          |      Other   +-------|              |\n          |   ASP in AS  |       +--------------+\n          |   Overrides  |           ^     |\n          |              |    ASP    |     | ASP\n          |              |    Active |     | Inactive\n          |              |           |     v\n          |              |       +--------------+\n          |              |       |              |\n          |              +------>| ASP-INACTIVE |\n          |                      +--------------+\n          |                          ^     |\nASP Down/ |                     ASP  |     | ASP Down /\nSCTP CDI/ |                     Up   |     | SCTP CDI/\nSCTP RI   |                          |     v SCTP RI\n          |                      +--------------+\n          |                      |              |\n          +--------------------->|   ASP-DOWN   |\n                                 |              |\n                                 +--------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "SCTP CDI: The SCTP CDI denotes the local SCTP layer's Communication Down Indication to the Upper Layer Protocol (M2UA) on an SGP. The local SCTP layer will send this indication when it detects the loss of connectivity to the ASP's peer SCTP layer. SCTP CDI is understood as either a SHUTDOWN_COMPLETE notification or COMMUNICATION_LOST notification from the SCTP layer.",
      "ja": "SCTP CDI：SCTP CDIは、SGPの上層層プロトコル（M2UA）への局所的なSCTP層の通信を示しています。ローカルSCTP層は、ASPのピアSCTP層への接続の損失を検出すると、この兆候を送信します。SCTP CDIは、SCTPレイヤーからのshutdown_complete通知またはcommunication_lost通知のいずれかとして理解されています。"
    },
    {
      "indent": 3,
      "text": "SCTP RI: The local SCTP layer's Restart indication to the upper layer protocol (M2UA) on an SG. The local SCTP will send this indication when it detects a restart from the ASP's peer SCTP layer.",
      "ja": "SCTP RI：SG上の上層プロトコル（M2UA）に対するローカルSCTP層の再起動表示。ローカルSCTPは、ASPのピアSCTPレイヤーから再起動を検出すると、この表示を送信します。"
    },
    {
      "indent": 0,
      "text": "4.3.2 AS States",
      "section_title": true,
      "ja": "4.3.2 州として"
    },
    {
      "indent": 3,
      "text": "The state of the AS is maintained in the M2UA layer on the SGP. The state of an AS changes due to events. These events include:",
      "ja": "ASの状態は、SGPのM2UA層で維持されます。イベントによるASの変化の状態。これらのイベントには以下が含まれます。"
    },
    {
      "indent": 6,
      "text": "* ASP state transitions * Recovery timer triggers",
      "ja": "* ASP状態移行 *回復タイマートリガー"
    },
    {
      "indent": 3,
      "text": "The possible states of an AS are:",
      "ja": "Asの可能な状態："
    },
    {
      "indent": 3,
      "text": "AS-DOWN: The Application Server is unavailable. This state implies that all related ASPs are in the ASP-DOWN state for this AS. Initially the AS will be in this state. An Application Server MUST be in the AS-DOWN state before it can be removed from a configuration.",
      "ja": "AS Down：アプリケーションサーバーは利用できません。この状態は、関連するすべてのASPがこのASのASPダウン状態にあることを意味します。最初はこの状態になります。アプリケーションサーバーは、構成から削除する前に、ASダウン状態にある必要があります。"
    },
    {
      "indent": 3,
      "text": "AS-INACTIVE: The Application Server is available but no application traffic is active (i.e., one or more related ASPs are in the ASP-INACTIVE state, but none in the ASP-ACTIVE state). The recovery timer T(r) is not running or has expired.",
      "ja": "不活性：アプリケーションサーバーは利用可能ですが、アプリケーショントラフィックはアクティブではありません（つまり、1つ以上の関連ASPがASP不活性状態にありますが、ASP活性状態にはありません）。回復タイマーT（R）が実行されていないか、期限切れになっています。"
    },
    {
      "indent": 3,
      "text": "AS-ACTIVE: The Application Server is available and application traffic is active. This state implies that at least one ASP is in the ASP-ACTIVE state.",
      "ja": "AS-Active：アプリケーションサーバーが利用可能で、アプリケーショントラフィックがアクティブです。この状態は、少なくとも1つのASPがASP活性状態にあることを意味します。"
    },
    {
      "indent": 3,
      "text": "AS-PENDING: An active ASP has transitioned to ASP-INACTIVE or ASP-DOWN and it was the last remaining active ASP in the AS. A recovery timer T(r) SHOULD be started and all incoming signalling messages SHOULD be queued by the SGP. If an ASP becomes ASP-ACTIVE before T(r) expires, the AS is moved to the AS-ACTIVE state and all the queued messages will be sent to the ASP.",
      "ja": "保留中：アクティブなASPはASP不活性またはASPダウンに移行し、ASの最後の残りのアクティブASPでした。回復タイマーT（R）を開始する必要があり、すべての着信シグナリングメッセージはSGPがキューに掲載する必要があります。t（r）が有効になる前にASPがASP活性になると、ASがアクティブな状態に移動され、すべてのキューに囲まれたメッセージがASPに送信されます。"
    },
    {
      "indent": 3,
      "text": "If T(r) expires before an ASP becomes ASP-ACTIVE, the SGP stops queuing messages and discards all previously queued messages. The AS will move to the AS-INACTIVE state if at least one ASP is in the ASP-INACTIVE state, otherwise it will move to the AS-DOWN state.",
      "ja": "ASPがASPアクティブになる前にt（r）が期限切れになった場合、SGPはメッセージをキューイングする停止を停止し、以前にキューに登録されたすべてのメッセージを破棄します。ASは、少なくとも1つのASPがASP不活性状態にある場合、非アクティブな状態に移動します。そうでなければ、それはダウン状態に移動します。"
    },
    {
      "indent": 3,
      "text": "Figure 6 shows an example AS state machine for the case where the AS/ASP data is pre-configured. For other cases where the AS/ASP configuration data is created dynamically, there would be differences in the state machine, especially at the creation of the AS.",
      "ja": "図6は、AS/ASPデータが事前に構成されている場合の状態マシンとしての例を示しています。AS/ASP構成データが動的に作成される他のケースでは、特にASの作成時に状態マシンに違いがあります。"
    },
    {
      "indent": 3,
      "text": "For example, where the AS/ASP configuration data is not created until Registration of the first ASP, the AS-INACTIVE state is entered directly upon the first successful REG REQ from an ASP. Another example is where the AS/ASP configuration data is not created until the first ASP successfully enters the ASP-ACTIVE state. In this case the AS-ACTIVE state is entered directly.",
      "ja": "たとえば、AS/ASP構成データが最初のASPの登録まで作成されない場合、AS ASPからの最初の成功したRec Reqに直接入力されます。別の例は、AS/ASP構成データがASP活性状態に正常に入るまで作成されない場合です。この場合、アクティブな状態が直接入力されます。"
    },
    {
      "indent": 20,
      "text": "Figure 6: AS State Transition Diagram",
      "ja": "図6：状態遷移図として"
    },
    {
      "indent": 3,
      "text": "     +----------+   one ASP trans to ACTIVE   +-------------+\n     |    AS-   |---------------------------->|     AS-     |\n     | INACTIVE |                             |   ACTIVE    |\n     |          |<---                         |             |\n     +----------+    \\                        +-------------+\n        ^   |         \\ Tr Expiry,                ^    |\n        |   |          \\ at least one             |    |\n        |   |           \\ ASP in ASP-INACTIVE     |    |\n        |   |            \\                        |    |\n        |   |             \\                       |    |\n        |   |              \\                      |    |\none ASP |   | all ASP       \\            one ASP  |    | Last ACTIVE\ntrans   |   | trans to       \\           trans to |    | ASP trans to\nto      |   | ASP-DOWN        -------\\   ASP-     |    | ASP-INACTIVE\nASP-    |   |                         \\  ACTIVE   |    | or ASP-DOWN\nINACTIVE|   |                          \\          |    | (start Tr)\n        |   |                           \\         |    |\n        |   |                            \\        |    |\n        |   v                             \\       |    v\n     +----------+                          \\  +-------------+\n     |          |                           --|             |\n     | AS-DOWN  |                             | AS-PENDING  |\n     |          |                             |  (queuing)  |\n     |          |<----------------------------|             |\n     +----------+    Tr Expiry and no ASP     +-------------+\n                     in ASP-INACTIVE state",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Tr = Recovery Timer",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4.3.3 M2UA Management Procedures for Primitives",
      "section_title": true,
      "ja": "4.3.3 プリミティブのM2UA管理手順"
    },
    {
      "indent": 3,
      "text": "Before the establishment of an SCTP association the ASP state at both the SGP and ASP is assumed to be in the state ASP-DOWN.",
      "ja": "SCTP協会が設立される前に、SGPとASPの両方のASP状態が州にあると想定されています。"
    },
    {
      "indent": 3,
      "text": "Once the SCTP association is established (see Section 4.2.1) and assuming that the local M2UA-User is ready, the local M2UA ASP Maintenance (ASPM) function will initiate the relevant procedures, using the ASP Up/ASP Down/ASP Active/ASP Inactive messages to convey the ASP state to the SGP (see Section 4.3.4).",
      "ja": "SCTP協会が確立され（セクション4.2.1を参照）、ローカルM2UAユーザーの準備が整っていると仮定すると、ローカルM2UA ASPメンテナンス（ASPM）関数がASP UP/ASP Active/ASP Active/を使用して関連する手順を開始します。ASP状態をSGPに伝えるASP非アクティブメッセージ（セクション4.3.4を参照）。"
    },
    {
      "indent": 3,
      "text": "If the M2UA layer subsequently receives an SCTP-COMMUNICATION_DOWN or SCTP-RESTART indication primitive from the underlying SCTP layer, it will inform the Layer Management by invoking the M-SCTP_STATUS indication primitive. The state of the ASP will be moved to ASP-DOWN.",
      "ja": "その後、M2UA層がSCTP-Communication_DownまたはSCTP-Restartの指示プリミティブを基にするSCTPレイヤーから受信した場合、M-SCTP_STATUS Indication Primitiveを呼び出すことによりレイヤー管理を通知します。ASPの状態はASPダウンに移動されます。"
    },
    {
      "indent": 3,
      "text": "In the case of SCTP-COMMUNICATION_DOWN, the SCTP client MAY try to re-establish the SCTP association. This MAY be done by the M2UA layer automatically, or Layer Management MAY re-establish using the M-SCTP_ESTABLISH request primitive.",
      "ja": "SCTP-Communication_Downの場合、SCTPクライアントはSCTP協会を再確立しようとする場合があります。これは、M2UAレイヤーによって自動的に行われる場合があります。または、レイヤー管理は、M-SCTP_ESTABLISHリクエストPrimitiveを使用して再確立する場合があります。"
    },
    {
      "indent": 3,
      "text": "In the case of an SCTP-RESTART indication at an ASP, the ASP is now considered by its M2UA peer to be in the ASP-DOWN state. The ASP, if it is to recover, must begin any recovery with the ASP-Up procedure.",
      "ja": "ASPでのSCTP-Restartの表示の場合、ASPは現在、M2UAピアによってASPダウン状態にあると見なされています。ASPは、回復する場合、Asp-Upの手順で回復を開始する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3.4 ASPM Procedures for Peer-to-Peer Messages",
      "section_title": true,
      "ja": "4.3.4 ピアツーピアメッセージのASPM手順"
    },
    {
      "indent": 0,
      "text": "4.3.4.1 ASP Up Procedures",
      "section_title": true,
      "ja": "4.3.4.1 ASPアップ手順"
    },
    {
      "indent": 3,
      "text": "After an ASP has successfully established an SCTP association to an SGP, the SGP waits for the ASP to send an ASP Up message, indicating that the ASP M2UA peer is available. The ASP is always the initiator of the ASP Up message. This action MAY be initiated at the ASP by an M-ASP_UP request primitive from Layer Management or MAY be initiated automatically by an M2UA management function.",
      "ja": "ASPがSGPにSCTP関連を正常に確立した後、SGPはASPがASPアップメッセージを送信するのを待ち、ASP M2UAピアが利用可能であることを示します。ASPは常にASPアップメッセージのイニシエーターです。このアクションは、レイヤー管理からのM-ASP_UPリクエストのプリミティブによってASPで開始されるか、M2UA管理機能によって自動的に開始される場合があります。"
    },
    {
      "indent": 3,
      "text": "When an ASP Up message is received at an SGP and internally the remote ASP is in the ASP-DOWN state and not considered locked-out for local management reasons, the SGP marks the remote ASP in the state ASP-INACTIVE and informs Layer Management with an M-ASP_Up indication primitive. If the SGP is aware, via current configuration data, which Application Servers the ASP is configured to operate in, the SGP updates the ASP state to ASP-INACTIVE in each AS that it is a member.",
      "ja": "ASP UpメッセージがSGPで受信され、内部的にはASPがASPダウン状態にある場合、ローカル管理上の理由でロックアウトと見なされていない場合、SGPは州のASP不活性のリモートASPをマークし、レイヤー管理に通知します。M-ASP_UP表示プリミティブ。SGPが現在の構成データを介して認識している場合、ASPが動作するように構成されているアプリケーションサーバーを介して、SGPはそれがメンバーであるように、それぞれのASP状態をそれぞれにASP不活性に更新します。"
    },
    {
      "indent": 3,
      "text": "Alternatively, the SGP may move the ASP into a pool of Inactive ASPs available for future configuration within Application Server(s), determined in a subsequent Registration Request or ASP Active procedure. If the ASP Up message contains an ASP Identifier, the SGP should save the ASP Identifier for that ASP. The SGP MUST send an ASP Up Ack message in response to a received ASP Up message even if the ASP is already marked as ASP-INACTIVE at the SGP.",
      "ja": "あるいは、SGPは、ASPを、後続の登録要求またはASPアクティブな手順で決定するアプリケーションサーバー内の将来の構成に利用可能な非アクティブASPのプールに移動する場合があります。ASPアップメッセージにASP識別子が含まれている場合、SGPはそのASPのASP識別子を保存する必要があります。SGPは、ASPがSGPでASP不活性として既にマークされている場合でも、受信したASPアップメッセージに応じてASP Up ACKメッセージを送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "If for any local reason (e.g., management lock-out) the SGP cannot respond with an ASP Up Ack message, the SGP responds to an ASP Up message with an Error message with Reason \"Refused - Management Blocking\".",
      "ja": "現地の理由（例：管理ロックアウト）の場合、SGPはASP Up ACKメッセージで応答できない場合、SGPは理由「拒否 - 管理ブロッキング」を伴うエラーメッセージでASPアップメッセージに応答します。"
    },
    {
      "indent": 3,
      "text": "At the ASP, the ASP Up Ack message received is not acknowledged. Layer Management is informed with an M-ASP_UP confirm primitive.",
      "ja": "ASPでは、受信したASP Up ACKメッセージは認められていません。レイヤー管理には、M-ASP_UPのプリミティブ確認が付いています。"
    },
    {
      "indent": 3,
      "text": "When the ASP sends an ASP Up message it starts timer T(ack). If the ASP does not receive a response to an ASP Up message within T(ack), the ASP MAY restart T(ack) and resend ASP Up messages until it receives an ASP Up Ack message. T(ack) is provisionable, with a default of 2 seconds. Alternatively, retransmission of ASP Up messages MAY be put under control of Layer Management. In this method, expiry of T(ack) results in an M-ASP_UP confirm primitive carrying a negative indication.",
      "ja": "ASPがASPアップメッセージを送信すると、タイマーT（ACK）が開始されます。ASPがT（ACK）内のASPアップメッセージへの応答を受け取らない場合、ASPはT（ACK）を再起動し、ASP Up ACKメッセージを受信するまでASPを再送信できます。T（ACK）は、デフォルトの2秒で提供可能です。あるいは、ASPアップメッセージの再送信は、レイヤー管理の制御下に置かれる場合があります。この方法では、T（ACK）の有効期限は、否定的な適応症を運ぶ原始を確認するM-ASP_UPになります。"
    },
    {
      "indent": 3,
      "text": "The ASP MUST wait for the ASP Up Ack message before sending any other M2UA messages (e.g., ASP Active or REG REQ). If the SGP receives any other M2UA messages before an ASP Up message is received (other than ASP Down - see Section 4.3.4.2), the SGP MAY discard them.",
      "ja": "ASPは、他のM2UAメッセージ（ASP ActiveまたはReg Reqなど）を送信する前に、ASP Up ACKメッセージを待つ必要があります。SGPがASPアップメッセージを受信する前に他のM2UAメッセージを受信した場合（ASPダウン以外 - セクション4.3.4.2を参照）、SGPはそれらを破棄する場合があります。"
    },
    {
      "indent": 3,
      "text": "If an ASP Up message is received and internally the remote ASP is in the ASP-ACTIVE state, an ASP Up Ack message is returned, as well as an Error message (\"Unexpected Message), and the remote ASP state is changed to ASP-INACTIVE in all relevant Application Servers.",
      "ja": "ASPアップメッセージが受信され、内部的にリモートASPがASPアクティブ状態にある場合、ASP Up ACKメッセージが返され、エラーメッセージが返され（「予期しないメッセージ）、リモートASP状態がASPに変更されます。関連するすべてのアプリケーションサーバーで非アクティブ。"
    },
    {
      "indent": 3,
      "text": "If an ASP Up message is received and internally the remote ASP is already in the ASP-INACTIVE state, an ASP Up Ack message is returned and no further action is taken.",
      "ja": "ASPアップメッセージが受信され、内部的にリモートASPがすでにASP不活性状態にある場合、ASP Up ACKメッセージが返され、それ以上のアクションは実行されません。"
    },
    {
      "indent": 0,
      "text": "4.3.4.1.1 M2UA Version Control",
      "section_title": true,
      "ja": "4.3.4.1.1 M2UAバージョンコントロール"
    },
    {
      "indent": 3,
      "text": "If an ASP Up message with an unsupported version is received, the receiving end responds with an Error message, indicating the version the receiving node supports and notifies Layer Management.",
      "ja": "サポートされていないバージョンを含むASPアップメッセージが受信された場合、受信側はエラーメッセージで応答し、受信ノードがサポートし、レイヤー管理に通知するバージョンを示します。"
    },
    {
      "indent": 3,
      "text": "This is useful when protocol version upgrades are being performed in a network. A node upgraded to a newer version SHOULD support the older versions used on other nodes it is communicating with. Because ASPs initiate the ASP Up procedure it is assumed that the Error message would normally come from the SGP.",
      "ja": "これは、プロトコルバージョンのアップグレードがネットワークで実行されている場合に役立ちます。新しいバージョンにアップグレードされたノードは、通信している他のノードで使用される古いバージョンをサポートする必要があります。ASPSはASPアップ手順を開始するため、エラーメッセージは通常SGPから得られると想定されています。"
    },
    {
      "indent": 0,
      "text": "4.3.4.2 ASP Down Procedures",
      "section_title": true,
      "ja": "4.3.4.2 ASPダウン手順"
    },
    {
      "indent": 3,
      "text": "The ASP will send an ASP Down message to an SGP when the ASP wishes to be removed from service in all Application Servers that it is a member and no longer receive any MAUP or ASPTM messages. This action MAY be initiated at the ASP by an M-ASP_DOWN request primitive from Layer Management or MAY be initiated automatically by an M2UA management function.",
      "ja": "ASPは、ASPがメンバーであり、MAUPまたはASPTMメッセージを受け取らないというすべてのアプリケーションサーバーでサービスから削除されることを希望する場合、SGPにASPダウンメッセージを送信します。このアクションは、レイヤー管理からのM-ASP_DOWNリクエストのプリミティブによってASPで開始されるか、M2UA管理機能によって自動的に開始される場合があります。"
    },
    {
      "indent": 3,
      "text": "Whether the ASP is permanently removed from any AS is a function of configuration management. In the case where the ASP previously used the Registration procedures (see Section 4.4) to register within Application Servers but has not unregistered from all of them prior to sending the ASP Down message, the SGP MUST consider the ASP as unregistered in all Application Servers that it is still a member.",
      "ja": "ASPが構成管理の関数であるASから永久に削除されるかどうか。ASPが以前に登録手順（セクション4.4を参照）を使用してアプリケーションサーバー内に登録したが、ASPダウンメッセージを送信する前にそれらすべてから登録されていない場合、SGPはASPをすべてのアプリケーションサーバーで未登録と見なす必要があります。それはまだメンバーです。"
    },
    {
      "indent": 3,
      "text": "The SGP marks the ASP as ASP-DOWN, informs Layer Management with an M-ASP_Down indication primitive, and returns an ASP Down Ack message to the ASP.",
      "ja": "SGPはASPをASPダウンとしてマークし、M-ASP_DOWN IDINCATION PRIMITITITを使用してレイヤー管理に通知し、ASPダウンACKメッセージをASPに返します。"
    },
    {
      "indent": 3,
      "text": "The SGP MUST send an ASP Down Ack message in response to a received ASP Down message from the ASP even if the ASP is already marked as ASP-DOWN at the SGP.",
      "ja": "SGPは、ASPがSGPでASPダウンとして既にマークされている場合でも、ASPから受け取ったASPダウンメッセージに応じてASPダウンACKメッセージを送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "At the ASP, the ASP Down Ack message received is not acknowledged. Layer Management is informed with an M-ASP_DOWN confirm primitive. If the ASP receives an ASP Down Ack without having sent an ASP Down message, the ASP SHOULD now consider itself as in the ASP-DOWN state. If the ASP was previously in the ASP-ACTIVE or ASP_INACTIVE state, the ASP SHOULD then initiate procedures to return itself to its previous state.",
      "ja": "ASPでは、受信したASPダウンACKメッセージは認められていません。レイヤー管理には、M-ASP_DOWNのプリミティブ確認が付いています。ASPがASPダウンメッセージを送信せずにASPダウンACKを受け取った場合、ASPはASPダウン状態のように自分自身を考慮する必要があります。ASPが以前にASPアクティブまたはASP_INACTIVE状態にあった場合、ASPは以前の状態に戻る手順を開始する必要があります。"
    },
    {
      "indent": 3,
      "text": "When the ASP sends an ASP Down message it starts timer T(ack). If the ASP does not receive a response to an ASP Down message within T(ack), the ASP MAY restart T(ack) and resend ASP Down messages until it receives an ASP Down Ack message. T(ack) is provisionable, with a default of 2 seconds. Alternatively, retransmission of ASP Down messages MAY be put under control of Layer Management. In this method, expiry of T(ack) results in an M-ASP_DOWN confirm primitive carrying a negative indication.",
      "ja": "ASPがASPダウンメッセージを送信すると、タイマーT（ACK）が開始されます。ASPがT（ACK）内のASPダウンメッセージへの応答を受け取らない場合、ASPはASPダウンACKメッセージを受信するまでT（ACK）を再起動し、ASPダウンメッセージを再送信できます。T（ACK）は、デフォルトの2秒で提供可能です。あるいは、ASPダウンメッセージの再送信は、レイヤー管理の制御下に置かれる場合があります。この方法では、T（ACK）の有効期限は、否定的な適応症を運ぶM-ASP_DOWNの原始を確認します。"
    },
    {
      "indent": 0,
      "text": "4.3.4.3 ASP Active Procedures",
      "section_title": true,
      "ja": "4.3.4.3 ASPアクティブな手順"
    },
    {
      "indent": 3,
      "text": "Anytime after the ASP has received an ASP Up Ack message from the SGP, the ASP MAY send an ASP Active message to the SGP indicating that the ASP is ready to start processing traffic. This action MAY be initiated at the ASP by an M-ASP_ACTIVE request primitive from Layer Management or MAY be initiated automatically by a M2UA management function. In the case where an ASP wishes to process the traffic for more than one Application Server across a common SCTP association, the ASP Active message(s) SHOULD contain a list of one or more Interface Identifiers to indicate for which Application Servers the ASP Active message applies. It is not necessary for the ASP to include any Interface Identifiers of interest in a single ASP Active message, thus requesting to become active in all Interface Identifiers at the same time. Multiple ASP Active messages MAY be used to activate within the Application Servers independently, or in sets. In the case where an ASP Active message does not contain a Interface Identifier parameter, the receiver must know, via configuration data, of which Application Server(s) the ASP is a member.",
      "ja": "ASPがSGPからASP Up ACKメッセージを受け取った後、ASPはASPアクティブメッセージをSGPに送信する場合があり、ASPがトラフィックの処理を開始する準備ができていることを示します。このアクションは、レイヤー管理からのM-ASP_ACTIVEリクエストの原始によってASPで開始されるか、M2UA管理機能によって自動的に開始される場合があります。ASPが共通のSCTPアソシエーション全体で複数のアプリケーションサーバーのトラフィックを処理することを希望する場合、ASPアクティブメッセージには、ASPアクティブメッセージをサーバーするアプリケーションを示すために、1つ以上のインターフェイス識別子のリストを含める必要があります適用されます。ASPが単一のASPアクティブメッセージに関心のあるインターフェイス識別子を含める必要はないため、すべてのインターフェイス識別子で同時にアクティブになることを要求します。複数のASPアクティブメッセージを使用して、アプリケーションサーバー内で個別に、またはセット内でアクティブ化できます。ASP Activeメッセージにインターフェイス識別子パラメーターが含まれていない場合、受信者は構成データを介して、ASPがメンバーであるアプリケーションサーバーを知る必要があります。"
    },
    {
      "indent": 3,
      "text": "For the Application Servers that the ASP can successfully activate, the SGP responds with one or more ASP Active Ack messages, including the associated Interface Identifier(s) and reflecting any Traffic Mode Type value present in the related ASP Active message. The Interface Identifier parameter MUST be included in the ASP Active Ack message(s) if the received ASP Active message contained any Interface Identifiers. Depending on any Traffic Mode Type request in the ASP Active message or local configuration data if there is no request, the SGP moves the ASP to the correct ASP traffic state within the associated Application Server(s). Layer Management is informed with an M-ASP_Active indication. If the SGP receives any Data messages before an ASP Active message is received, the SGP MAY discard them. By sending an ASP Active Ack message, the SGP is now ready to receive and send traffic for the related Interface Identifier(s). The ASP SHOULD NOT send MAUP messages for the related Interface Identifier(s) before receiving an ASP Active Ack message, or it will risk message loss.",
      "ja": "ASPが正常にアクティブにできるアプリケーションサーバーの場合、SGPは、関連するインターフェイス識別子を含む1つ以上のASPアクティブACKメッセージで応答し、関連するASPアクティブメッセージに存在するトラフィックモードタイプの値を反映します。受信したASP Activeメッセージにインターフェイス識別子が含まれている場合、インターフェイス識別子パラメーターはASP Active ACKメッセージに含める必要があります。ASPアクティブメッセージまたはローカル構成データのトラフィックモードタイプ要求に応じて、リクエストがない場合、SGPはASPを関連するアプリケーションサーバー内の正しいASPトラフィック状態に移動します。レイヤー管理には、M-ASP_ACTIVE表示が付いています。ASPアクティブメッセージを受信する前にSGPがデータメッセージを受信した場合、SGPはそれらを破棄する場合があります。ASPアクティブACKメッセージを送信することにより、SGPは関連するインターフェイス識別子のトラフィックを受信して送信する準備ができました。ASPは、ASPアクティブなACKメッセージを受信する前に、関連するインターフェイス識別子のMAUPメッセージを送信しないでください。そうしないと、メッセージの損失が危険にさらされます。"
    },
    {
      "indent": 3,
      "text": "Multiple ASP Active Ack messages MAY be used in response to an ASP Active message containing multiple Interface Identifiers, allowing the SGP to independently acknowledge the ASP Active message for different (sets of) Interface Identifiers. The SGP MUST send an Error message (\"Invalid Interface Identifier\") for each Interface Identifier value that cannot be successfully activated.",
      "ja": "複数のASPアクティブなACKメッセージを使用して、複数のインターフェイス識別子を含むASPアクティブメッセージに応じて使用でき、SGPが異なる（セットの）インターフェイス識別子のASPアクティブメッセージを独立して確認できるようにします。SGPは、各インターフェイス識別子値に対して正常にアクティブ化できないエラーメッセージ（「無効なインターフェイス識別子」）を送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "In the case where an \"out-of-the-blue\" ASP Active message is received (i.e., the ASP has not registered with the SG or the SG has no static configuration data for the ASP), the message MAY be silently discarded.",
      "ja": "「青い」ASPアクティブメッセージが受信された場合（つまり、ASPがSGに登録していないか、SGにASPの静的な構成データがない場合）、メッセージは静かに廃棄される場合があります。"
    },
    {
      "indent": 3,
      "text": "The SGP MUST send an ASP Active Ack message in response to a received ASP Active message from the ASP, if the ASP is already marked in the ASP-ACTIVE state at the SGP.",
      "ja": "SGPは、ASPがSGPのASP活性状態ですでにマークされている場合、ASPからの受信ASPアクティブメッセージに応じてASPアクティブACKメッセージを送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "At the ASP, the ASP Active Ack message received is not acknowledged. Layer Management is informed with an M-ASP_ACTIVE confirm primitive. It is possible for the ASP to receive Data message(s) before the ASP Active Ack message as the ASP Active Ack and Data messages from an SG may be sent on different SCTP streams. Message loss is possible as the ASP does not consider itself in the ASP-ACTIVE state until reception of the ASP Active Ack message.",
      "ja": "ASPでは、受信したASPアクティブACKメッセージは認められていません。レイヤー管理には、M-ASP_ACTIVEの原始的な確認が付いています。ASP Active ACKメッセージの前にASPがデータメッセージを受信する可能性があります。ASPアクティブACKとSGからのデータメッセージは、異なるSCTPストリームで送信される可能性があります。ASPがASPアクティブACKメッセージを受信するまで、ASPはASPアクティブ状態では自分自身を考慮していないため、メッセージの損失が可能です。"
    },
    {
      "indent": 3,
      "text": "When the ASP sends an ASP Active message it starts timer T(ack). If the ASP does not receive a response to an ASP Active message within T(ack), the ASP MAY restart T(ack) and resend ASP Active message(s) until it receives an ASP Active Ack message. T(ack) is provisionable, with a default of 2 seconds. Alternatively, retransmission of ASP Active messages MAY be put under the control of Layer Management. In this method, expiry of T(ack) results in an M-ASP_ACTIVE confirm primitive carrying a negative indication.",
      "ja": "ASPがASPアクティブメッセージを送信すると、タイマーT（ACK）が開始されます。ASPがT（ACK）内のASPアクティブメッセージへの応答を受け取らない場合、ASPはT（ACK）を再起動し、ASPアクティブACKメッセージを受信するまでASPアクティブメッセージを再送信できます。T（ACK）は、デフォルトの2秒で提供可能です。あるいは、ASPアクティブメッセージの再送信は、レイヤー管理の制御下に置かれる場合があります。この方法では、T（ACK）の有効期限は、否定的な兆候を運ぶM-ASP_activeの原始的な確認をもたらします。"
    },
    {
      "indent": 3,
      "text": "There are three modes of Application Server traffic handling in the SGP M2UA layer: Override, Load share and Broadcast. When included, the Traffic Mode Type parameter in the ASP Active message indicates the traffic handling mode to be used in a particular Application Server. If the SGP determines that the mode indicated in an ASP Active message is unsupported or incompatible with the mode currently configured for the AS, the SGP responds with an Error message (\"Unsupported / Invalid Traffic Handling Mode\"). If the traffic handling mode of the Application Server is not already known via configuration data, the traffic handling mode indicated in the first ASP Active message causing the transition of the Application Server state to AS-ACTIVE MAY be used to set the mode.",
      "ja": "SGP M2UAレイヤーには、オーバーライド、ロード共有、ブロードキャストの3つのアプリケーションサーバートラフィックの取り扱いがあります。含まれる場合、ASPアクティブメッセージのトラフィックモードタイプパラメーターは、特定のアプリケーションサーバーで使用されるトラフィックハンドリングモードを示します。SGPがASPアクティブメッセージに示されているモードが、AS用に現在構成されているモードとサポートされていないか、互換性がないことを決定した場合、SGPはエラーメッセージ（「サポートされていない /無効なトラフィックハンドリングモード」）で応答します。アプリケーションサーバーのトラフィックハンドリングモードが構成データを介してまだわかっていない場合、アプリケーションサーバーの状態をアクティブに遷移させる最初のASPアクティブメッセージに示されたトラフィックハンドリングモードを使用してモードを設定することができます。"
    },
    {
      "indent": 3,
      "text": "In the case of an Override mode AS, reception of an ASP Active message at an SGP causes the (re)direction of all traffic for the AS to the ASP that sent the ASP Active message. Any previously active ASP in the AS is now considered to be in the state ASP-INACTIVE and SHOULD no longer receive traffic from the SGP within the AS. The SGP then MUST send a Notify message (\"Alternate ASP Active\") to the previously active ASP in the AS, and SHOULD stop traffic to/from that ASP. The ASP receiving this Notify MUST consider itself now in the ASP-INACTIVE state, if it is not already aware of this via inter-ASP communication with the Overriding ASP.",
      "ja": "オーバーライドモードの場合、SGPでのASPアクティブメッセージの受信により、ASPアクティブメッセージを送信したASPのすべてのトラフィックの（再）方向が発生します。現在のASで以前にアクティブなASPは、現在は州のASP不活性であると考えられており、AS内のSGPからトラフィックを受け取ってはなりません。SGPは、ASの以前にアクティブなASPに通知メッセージ（「代替ASPアクティブ」）を送信する必要があり、そのASPとの間でトラフィックを停止する必要があります。この通知を受け取っているASPは、ASPがASP間通信を介してこれをまだ認識していない場合、ASP不活性状態で自分自身を考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "In the case of a Load-share mode AS, reception of an ASP Active message at an SGP causes the direction of traffic to the ASP sending the ASP Active message, in addition to all the other ASPs that are currently active in the AS. The algorithm at the SGP for load-sharing traffic within an AS to all the active ASPs is implementation dependent. The algorithm could, for example be round-robin or based on information in the Data message (e.g., such as the SLS in the Routing Label).",
      "ja": "ASのロードシェアモードの場合、SGPでのASPアクティブメッセージを受信すると、ASPが現在アクティブである他のすべてのASPに加えて、ASPアクティブメッセージをASPアクティブメッセージを送信するためのトラフィックの方向が発生します。すべてのアクティブなASPに関するAS内の負荷共有トラフィックのSGPのアルゴリズムは、実装に依存しています。アルゴリズムは、たとえば、ラウンドロビンまたはデータメッセージの情報に基づいている可能性があります（例：ルーティングラベルのSLSなど）。"
    },
    {
      "indent": 3,
      "text": "An SGP, upon reception of an ASP Active message for the first ASP in a Load share AS, MAY choose not to direct traffic to a newly active ASP until it determines that there are sufficient resources to handle the expected load (e.g., until there are \"n\" ASPs in state ASP-ACTIVE in the AS).",
      "ja": "SGPは、負荷シェアの最初のASPに対するASPアクティブメッセージを受信すると、予想される負荷を処理するのに十分なリソースがあると判断するまで、新しくアクティブなASPにトラフィックを向けないことを選択できます（例えば、あるまで、\"n\" as）as）のASP。"
    },
    {
      "indent": 3,
      "text": "All ASPs within a load-sharing mode AS must be able to process any Data message received for the AS, to accommodate any potential fail-over or balancing of the offered load.",
      "ja": "ロードシェアリングモード内のすべてのASPは、ASに対して受信したデータメッセージを処理できる必要があります。"
    },
    {
      "indent": 3,
      "text": "In the case of a Broadcast mode AS, reception of an ASP Active message at an SGP causes the direction of traffic to the ASP sending the ASP Active message, in addition to all the other ASPs that are currently active in the AS. The algorithm at the SGP for broadcasting traffic within an AS to all the active ASPs is a simple broadcast algorithm, where every message is sent to each of the active ASPs.",
      "ja": "ASの放送モードの場合、SGPでASPアクティブメッセージを受信すると、ASで現在活動している他のすべてのASPに加えて、ASPアクティブメッセージの送信のトラフィックの方向が発生します。すべてのアクティブなASPに関するAS内の放送トラフィックのためのSGPのアルゴリズムは、すべてのメッセージが各アクティブASPに送信される単純なブロードキャストアルゴリズムです。"
    },
    {
      "indent": 3,
      "text": "An SGP, upon reception of an ASP Active message for the first ASP in a Broadcast AS, MAY choose not to direct traffic to a newly active ASP until it determines that there are sufficient resources to handle the expected load (e.g., until there are \"n\" ASPs in state ASP-ACTIVE in the AS).",
      "ja": "SGPは、放送の最初のASPのASPアクティブメッセージを受信したときに、予想される負荷を処理するのに十分なリソースがあると判断するまで、新しくアクティブなASPにトラフィックを向けないことを選択する場合があります（例えば、あるまで、」n \"ASのASP-ActiveのASPS）。"
    },
    {
      "indent": 3,
      "text": "Whenever an ASP in a Broadcast mode AS becomes ASP-ACTIVE, the SGP MUST tag the first DATA message broadcast in each SCTP stream with a unique Correlation Id parameter. The purpose of this Correlation Id is to permit the newly active ASP to synchronize its processing of traffic in each ordered stream with the other ASPs in the broadcast group.",
      "ja": "ASPアクティブになるようにブロードキャストモードのASPがASPを使用するたびに、SGPは、一意の相関IDパラメーターを使用して、各SCTPストリームの最初のデータメッセージブロードキャストにタグを付ける必要があります。この相関IDの目的は、新たにアクティブなASPが放送グループの他のASPとの各順序付けられたストリームのトラフィックの処理を同期させることを許可することです。"
    },
    {
      "indent": 0,
      "text": "4.3.4.4 ASP Inactive Procedures",
      "section_title": true,
      "ja": "4.3.4.4 ASP不活性手順"
    },
    {
      "indent": 3,
      "text": "When an ASP wishes to withdraw from receiving traffic within an AS, the ASP sends an ASP Inactive message to the SGP. This action MAY be initiated at the ASP by an M-ASP_INACTIVE request primitive from Layer Management or MAY be initiated automatically by an M2UA management function. In the case where an ASP is processing the traffic for more than one Application Server across a common SCTP association, the ASP Inactive message contains one or more Interface Identifiers to indicate for which Application Servers the ASP Inactive message applies. In the case where an ASP Inactive message does not contain a Interface Identifier parameter, the receiver must know, via configuration data, of which Application Servers the ASP is a member and move the ASP to the ASP-INACTIVE state in all Application Servers. In the case of an Override mode AS, where another ASP has already taken over the traffic within the AS with an ASP Active (\"Override\") message, the ASP that sends the ASP Inactive message is already considered by the SGP to be in the state ASP-INACTIVE. An ASP Inactive Ack message is sent to the ASP, after ensuring that all traffic is stopped to the ASP.",
      "ja": "ASPがAS内のトラフィックの受信から撤退したい場合、ASPはASPの非アクティブなメッセージをSGPに送信します。このアクションは、レイヤー管理からのM-ASP_INACTIVEリクエストの原始によってASPで開始されるか、M2UA管理機能によって自動的に開始される場合があります。ASPが共通のSCTPアソシエーション全体で複数のアプリケーションサーバーのトラフィックを処理している場合、ASPの非アクティブメッセージには、ASPの非アクティブメッセージが適用されるアプリケーションサーバーを示す1つ以上のインターフェイス識別子が含まれています。ASPの非アクティブメッセージにインターフェイス識別子パラメーターが含まれていない場合、受信者は構成データを介して、ASPサーバーがメンバーであり、ASPをすべてのアプリケーションサーバーのASP不活性状態に移動する必要があります。オーバーライドモードの場合、ASPアクティブ（「オーバーライド」）メッセージを使用してASのAS内のトラフィックを既に引き継いでいる場合、ASPの非アクティブメッセージを送信するASPは、SGPがすでにSGPにあると見なしています。状態ASP不活性。すべてのトラフィックがASPに停止することを保証した後、ASPの非アクティブACKメッセージがASPに送信されます。"
    },
    {
      "indent": 3,
      "text": "In the case of a Load-share mode AS, the SGP moves the ASP to the ASP-INACTIVE state and the AS traffic is re-allocated across the remaining ASPs in the state ASP-ACTIVE, as per the load-sharing algorithm currently used within the AS. A Notify message (\"Insufficient ASP resources active in AS\") MAY be sent to all inactive ASPs, if required. An ASP Inactive Ack message is sent to the ASP after all traffic is halted and Layer Management is informed with an M-ASP_INACTIVE indication primitive.",
      "ja": "ロードシェアモードの場合、SGPはASPをASP不活性状態に移動し、現在使用されている負荷シェアリングアルゴリズムに従って、ASP-ASP-Activeの残りのASPでトラフィックが再割り当てされます。AS内。必要に応じて、通知メッセージ（ \"ASP不十分なASPリソースAS AS]）は、すべての非アクティブASPに送信される場合があります。ASPの非アクティブACKメッセージがASPに送信され、すべてのトラフィックが停止し、M-ASP_INACTIVE表示プリミティブでレイヤー管理が通知されます。"
    },
    {
      "indent": 3,
      "text": "In the case of a Broadcast mode AS, the SGP moves the ASP to the ASP-INACTIVE state and the AS traffic is broadcast only to the remaining ASPs in the state ASP-ACTIVE. A Notify message (\"Insufficient ASP resources active in AS\") MAY be sent to all inactive ASPs, if required. An ASP Inactive Ack message is sent to the ASP after all traffic is halted and Layer Management is informed with an M-ASP_INACTIVE indication primitive.",
      "ja": "放送モードの場合、SGPはASPをASP不活性状態に移動し、ASトラフィックはASP-Activeの残りのASPにのみ放送されます。必要に応じて、通知メッセージ（ \"ASP不十分なASPリソースAS AS]）は、すべての非アクティブASPに送信される場合があります。ASPの非アクティブACKメッセージがASPに送信され、すべてのトラフィックが停止し、M-ASP_INACTIVE表示プリミティブでレイヤー管理が通知されます。"
    },
    {
      "indent": 3,
      "text": "Multiple ASP Inactive Ack messages MAY be used in response to an ASP Inactive message containing multiple Interface Identifiers, allowing the SGP to independently acknowledge for different (sets of) Interface Identifiers. The SGP sends an Error message (\"Invalid Interface Identifier\") for each invalid or not configured Interface Identifier value in a received ASP Inactive message.",
      "ja": "複数のASP不活性ACKメッセージは、複数のインターフェイス識別子を含むASPの非アクティブメッセージに応じて使用される場合があり、SGPが異なる（セットの）インターフェイス識別子を個別に認めることができます。SGPは、受信したASPの非アクティブメッセージで、無効または構成されていないインターフェイス識別子値ごとにエラーメッセージ（「無効なインターフェイス識別子」）を送信します。"
    },
    {
      "indent": 3,
      "text": "The SGP MUST send an ASP Inactive Ack message in response to a received ASP Inactive message from the ASP and the ASP is already marked as ASP-INACTIVE at the SGP.",
      "ja": "SGPは、ASPからの受け取ったASPの非アクティブメッセージに応じてASPの非アクティブACKメッセージを送信する必要があり、ASPはすでにSGPでASP不活性としてマークされています。"
    },
    {
      "indent": 3,
      "text": "At the ASP, the ASP Inactive Ack message received is not acknowledged. Layer Management is informed with an M-ASP_INACTIVE confirm primitive. If the ASP receives an ASP Inactive Ack without having sent an ASP Inactive message, the ASP SHOULD now consider itself as in the ASP-INACTIVE state. If the ASP was previously in the ASP-ACTIVE state, the ASP SHOULD then initiate procedures to return itself to its previous state.",
      "ja": "ASPでは、受信したASPの非アクティブACKメッセージは認められていません。レイヤー管理には、M-ASP_INACTIVE ADMING PRIMITITITが付いています。ASPがASPの非アクティブメッセージを送信せずにASPの非アクティブACKを受け取った場合、ASPはASP不活性状態のように自分自身を考慮する必要があります。ASPが以前にASP活性状態にあった場合、ASPは以前の状態に戻る手順を開始する必要があります。"
    },
    {
      "indent": 3,
      "text": "When the ASP sends an ASP Inactive message it starts timer T(ack). If the ASP does not receive a response to an ASP Inactive message within T(ack), the ASP MAY restart T(ack) and resend ASP Inactive messages until it receives an ASP Inactive Ack message. T(ack) is provisionable, with a default of 2 seconds. Alternatively, retransmission of ASP Inactive messages MAY be put under the control of Layer Management. In this method, expiry of T(ack) results in a M-ASP_Inactive confirm primitive carrying a negative indication.",
      "ja": "ASPがASPの非アクティブメッセージを送信すると、タイマーT（ACK）が開始されます。ASPがT（ACK）内のASP非アクティブメッセージへの応答を受け取らない場合、ASPはASPの非アクティブACKメッセージを受信するまでT（ACK）を再起動し、ASPの非アクティブメッセージを再送信できます。T（ACK）は、デフォルトの2秒で提供可能です。あるいは、ASPの非アクティブメッセージの再送信は、レイヤー管理の制御下に置かれる場合があります。この方法では、T（ACK）の有効期限は、否定的な適応症を運ぶM-ASP_INACTIVEの原始的な確認をもたらします。"
    },
    {
      "indent": 3,
      "text": "If no other ASPs in the Application Server are in the state ASP-ACTIVE, the SGP MUST send a Notify message (\"AS-Pending\") to all of the ASPs in the AS which are in the state ASP-INACTIVE. The SGP SHOULD start buffering the incoming messages for T(r)seconds, after which messages MAY be discarded. T(r) is configurable by the network operator. If the SGP receives an ASP Active message from an ASP in the AS before expiry of T(r), the buffered traffic is directed to that ASP and the timer is canceled. If T(r) expires, the AS is moved to the AS-INACTIVE state.",
      "ja": "アプリケーションサーバー内の他のASPが州のASPアクティブにない場合、SGPは州のASP不活性にあるASのすべてのASPに通知メッセージ（「As-Pending」）を送信する必要があります。SGPは、T（R）秒間の受信メッセージのバッファリングを開始する必要があります。その後、メッセージが破棄される可能性があります。T（r）は、ネットワーク演算子が構成できます。SGPがT（r）の前に有効期限が切れる前にASPからASPアクティブメッセージを受信した場合、バッファリングされたトラフィックがそのASPに向けられ、タイマーがキャンセルされます。t（r）が有効になると、ASは不活性状態に移動されます。"
    },
    {
      "indent": 0,
      "text": "4.3.4.5 Notify Procedures",
      "section_title": true,
      "ja": "4.3.4.5 手順に通知します"
    },
    {
      "indent": 3,
      "text": "A Notify message reflecting a change in the AS state MUST be sent to all ASPs in the AS, except those in the ASP-DOWN state, with appropriate Status Information and any ASP Identifier of the failed ASP. At the ASP, Layer Management is informed with an M-NOTIFY indication primitive. The Notify message MUST be sent whether the AS state change was a result of an ASP failure or reception of an ASP State Management (ASPSM) / ASP Traffic Management (ASPTM) message. In the second case, the Notify message MUST be sent after any related acknowledgment messages (e.g., ASP Up Ack, ASP Down Ack, ASP Active Ack, or ASP Inactive Ack).",
      "ja": "AS状態の変更を反映した通知メッセージは、ASPダウン状態のASのすべてを除き、適切なステータス情報とASPのASPの失敗の識別子を除き、ASのすべてのASPに送信する必要があります。ASPでは、レイヤー管理はM-notify表示プリミティブで通知されます。AS AS状態の変更がASPの失敗またはASP州管理（ASPSM） / ASPトラフィック管理（ASPTM）メッセージの受容の結果であるかどうかにかかわらず、通知メッセージを送信する必要があります。2番目のケースでは、Notifyメッセージは、関連する確認メッセージの後に送信する必要があります（たとえば、ASP Up ACK、ASP Down ACK、ASP Active ACK、またはASP Inactive ACK）。"
    },
    {
      "indent": 3,
      "text": "In the case where a Notify (\"AS-PENDING\") message is sent by an SGP that now has no ASPs active to service the traffic, or where a Notify (\"Insufficient ASP resources active in AS\") message MUST be sent in the Load share or Broadcast mode, the Notify message does not explicitly compel the ASP(s) receiving the message to become active. The ASPs remain in control of what (and when) traffic action is taken.",
      "ja": "通知（ \"As-Pending\"）メッセージがSGPによって送信される場合、現在トラフィックにサービスを提供するためにASPがアクティブになっていない場合、または通知（「ASP不十分なASPリソースAS」）メッセージを送信する必要があります。共有モードまたはブロードキャストモードをロードすると、Notifyメッセージは、アクティブになるためにメッセージを受信するASPを明示的に強制しません。ASPは、トラフィックアクションがどのような（およびいつ）実行されるかを制御し続けています。"
    },
    {
      "indent": 3,
      "text": "In the case where a Notify message does not contain a Interface Identifier parameter, the receiver must know, via configuration data, of which Application Servers the ASP is a member and take the appropriate action in each AS.",
      "ja": "Notifyメッセージにインターフェイス識別子パラメーターが含まれていない場合、受信者は構成データを介して、ASPがメンバーであり、それぞれのASで適切なアクションを実行する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3.4.6 Heartbeat Procedures",
      "section_title": true,
      "ja": "4.3.4.6 ハートビート手順"
    },
    {
      "indent": 3,
      "text": "The optional Heartbeat procedures MAY be used when operating over transport layers that do not have their own heartbeat mechanism for detecting loss of the transport association (i.e., other than SCTP).",
      "ja": "オプションのハートビート手順は、輸送協会の損失を検出するための独自のハートビートメカニズム（つまり、SCTP以外）を持たない輸送層を介して動作する場合に使用できます。"
    },
    {
      "indent": 3,
      "text": "Either M2UA peer may optionally send Heartbeat messages periodically, subject to a provisionable timer T(beat). Upon receiving a Heartbeat message, the M2UA peer MUST respond with a Heartbeat Ack message.",
      "ja": "M2UAピアは、配置可能なタイマーT（ビート）の対象となる、オプションで定期的にハートビートメッセージを送信する場合があります。ハートビートメッセージを受信すると、M2UAピアはハートビートACKメッセージで応答する必要があります。"
    },
    {
      "indent": 3,
      "text": "If no Heartbeat Ack message (or any other M2UA message) is received from the M2UA peer within 2*T(beat), the remote M2UA peer is considered unavailable. Transmission of Heartbeat messages is stopped and the signalling process SHOULD attempt to re-establish communication if it is configured as the client for the disconnected M2UA peer.",
      "ja": "2*t（beat）内のM2UAピアからハートビートACKメッセージ（または他のM2UAメッセージ）が受信されない場合、リモートM2UAピアは利用できないと見なされます。ハートビートメッセージの送信が停止し、シグナリングプロセスが、切断されたM2UAピアのクライアントとして構成されている場合、通信を再確立しようとするはずです。"
    },
    {
      "indent": 3,
      "text": "The Heartbeat message may optionally contain an opaque Heartbeat Data parameter that MUST be echoed back unchanged in the related Heartbeat Ack message. The sender, upon examining the contents of the returned Heartbeat Ack message, MAY choose to consider the remote M2UA peer as unavailable. The contents/format of the Heartbeat Data parameter is implementation-dependent and only of local interest to the original sender. The contents may be used, for example, to support a Heartbeat sequence algorithm (to detect missing Heartbeats), and/or a time stamp mechanism (to evaluate delays).",
      "ja": "ハートビートメッセージには、オプションで、関連するハートビートACKメッセージに変更されていない背中に反映する必要がある不透明なハートビートデータパラメーターが含まれている場合があります。送信者は、返されたハートビートACKメッセージの内容を調べると、リモートM2UAピアを利用できないと考えることを選択できます。ハートビートデータパラメーターの内容/形式は、実装依存であり、元の送信者にとって現地の関心のみです。内容は、たとえば、ハートビートシーケンスアルゴリズム（欠落しているハートビートを検出するため）および/またはタイムスタンプメカニズム（遅延を評価する）をサポートするために使用できます。"
    },
    {
      "indent": 3,
      "text": "Note: Heartbeat related events are not shown in Figure 5 \"ASP state transition diagram\".",
      "ja": "注：ハートビート関連のイベントは、図5「ASP状態遷移図」には示されていません。"
    },
    {
      "indent": 0,
      "text": "4.4 Link Key Management Procedures",
      "section_title": true,
      "ja": "4.4 キー管理手順をリンクします"
    },
    {
      "indent": 3,
      "text": "The Interface Identifier Management procedures are optional. They can be used to support automatic allocation of Signalling Terminals or Signalling Data Links [2][3].",
      "ja": "インターフェイス識別子管理手順はオプションです。これらを使用して、シグナリング端子または信号データリンクの自動割り当てをサポートすることができます[2] [3]。"
    },
    {
      "indent": 0,
      "text": "4.4.1 Registration",
      "section_title": true,
      "ja": "4.4.1 登録"
    },
    {
      "indent": 3,
      "text": "An ASP MAY dynamically register with an SGP as an ASP within an Application Server for individual Interface Identifier(s) using the REG REQ message. A Link Key parameter in the REG REQ specifies the parameters associated with the Link Key.",
      "ja": "ASPは、REG REQメッセージを使用して、個々のインターフェイス識別子のアプリケーションサーバー内のASPとしてSGPに動的に登録できます。reg reqのリンクキーパラメーターは、リンクキーに関連付けられたパラメーターを指定します。"
    },
    {
      "indent": 3,
      "text": "The SGP examines the contents of the received Link Key parameters (SDLI and SDTI) and compares them with the currently provisioned Interface Identifiers. If the received Link Key matches an existing SGP Link Key entry, and the ASP is not currently included in the list of ASPs for the related Application Server, the SGP MAY authorize the ASP to be added to the AS. Or, if the Link Key does not currently exist and the received Link Key data is valid and unique, an SGP supporting dynamic configuration MAY authorize the creation of a new Interface Identifier and related Application Server and add the ASP to the new AS. In either case, the SGP returns a Registration Response message to the ASP, containing the same Local-LK-Identifier as provided in the initial request, a Registration Result \"Successfully Registered\" and the Interface Identifier. A unique method of Interface Identifier valid assignment at the SG/SGP is implementation dependent but MUST be guaranteed to be unique for each Application server or Link Key served by SGP.",
      "ja": "SGPは、受信したリンクキーパラメーター（SDLIおよびSDTI）の内容を調べ、現在提供されているインターフェイス識別子と比較します。受信したリンクキーが既存のSGPリンクキーエントリと一致し、ASPが現在関連するアプリケーションサーバーのASPのリストに含まれていない場合、SGPはASPをASに追加することを許可する場合があります。または、リンクキーが現在存在せず、受信したリンクキーデータが有効で一意である場合、SGPをサポートする動的構成は、新しいインターフェイス識別子と関連アプリケーションサーバーの作成を承認し、ASPを新しいASに追加する場合があります。どちらの場合でも、SGPは、最初の要求で提供されているのと同じローカルLK-Identifier、登録結果が「正常に登録」、インターフェイス識別子を含むASPへの登録応答メッセージを返します。SG/SGPでのインターフェイス識別子有効な割り当ての一意の方法は実装依存ですが、SGPが提供する各アプリケーションサーバーまたはリンクキーに対して一意であることを保証する必要があります。"
    },
    {
      "indent": 3,
      "text": "If the SGP determines that the received Link Key data is invalid, or contains invalid parameter values, the SGP returns a Registration Response message to the ASP, containing a Registration Result \"Error - Invalid Link Key\", \"Error - Invalid SDTI\", \"Error - Invalid SDLI\" as appropriate.",
      "ja": "SGPが受信したリンクキーデータが無効であるか、無効なパラメーター値を含むことを決定した場合、SGPは登録結果「エラー - 無効リンクキー」、「エラー - 無効-SDTI」、「無効なSDTI」を含むASPへの登録応答メッセージを返します。エラー - 必要に応じて、無効なsdli \"。"
    },
    {
      "indent": 3,
      "text": "If the SGP determines that the Link Key parameter overlaps with an existing Link Key entry, the SGP returns a Registration Response message to the ASP, with a Registration Status of \"Error - Overlapping (Non-Unique) Link Key\". An incoming signalling message received at an SGP cannot match against more than one Link Key.",
      "ja": "SGPが既存のリンクキーエントリとリンクキーパラメーターが重複すると判断した場合、SGPは登録応答メッセージをASPに返し、登録ステータス「エラー - オーバーラップ（非ユニーク）リンクキー」の登録ステータスを返します。SGPで受信した着信シグナリングメッセージは、複数のリンクキーと一致することはできません。"
    },
    {
      "indent": 3,
      "text": "If the SGP does not authorize the registration request, the SGP returns a REG RSP message to the ASP containing the Registration Result \"Error - Permission Denied\".",
      "ja": "SGPが登録要求を承認しない場合、SGPは登録結果「エラー - 許可拒否」を含むASPにREG RSPメッセージを返します。"
    },
    {
      "indent": 3,
      "text": "If an SGP determines that a received Link Key does not currently exist and the SGP does not support dynamic configuration, the SGP returns a Registration Response message to the ASP, containing a Registration Result \"Error - Link Key not Provisioned\".",
      "ja": "SGPが受信したリンクキーが現在存在しないと判断し、SGPが動的構成をサポートしていないと判断した場合、SGPはASPへの登録応答メッセージを返します。"
    },
    {
      "indent": 3,
      "text": "If an SGP determines that a received Link Key does not currently exist and the SGP supports dynamic reconfiguration but does not have the capacity to add new Link Key and Application Server entries, the SGP returns a Registration Response message to the ASP, containing a Registration Result \"Error - Insufficient Resources\".",
      "ja": "SGPが受信リンクキーが現在存在しないことを決定し、SGPが動的再構成をサポートしているが、新しいリンクキーとアプリケーションサーバーエントリを追加する能力がない場合、SGPは登録結果を含むASPへの登録応答メッセージを返します「エラー - リソース不足」。"
    },
    {
      "indent": 3,
      "text": "An ASP MAY register multiple Link Keys at once by including a number of Link Key parameters in a single REG REQ message. The SGP MAY respond to each registration request in a single REG RSP message, indicating the success or failure result for each Link Key in a separate Registration Result parameter. Alternatively, the SGP MAY respond with multiple REG RSP messages, each with one or more Registration Result parameters. The ASP uses the Local-LK-Identifier parameter to correlate the requests with the responses.",
      "ja": "ASPは、単一のReg Reqメッセージに多数のリンクキーパラメーターを含めることにより、複数のリンクキーを一度に登録できます。SGPは、単一のREG RSPメッセージで各登録要求に応答し、個別の登録結果パラメーターの各リンクキーの成功または障害の結果を示します。あるいは、SGPは複数のREG RSPメッセージで応答する場合があり、それぞれが1つ以上の登録結果パラメーターを備えています。ASPは、Local-LK-Identifierパラメーターを使用して、リクエストを応答と相関させます。"
    },
    {
      "indent": 0,
      "text": "4.4.2 Deregistration",
      "section_title": true,
      "ja": "4.4.2 解雇"
    },
    {
      "indent": 3,
      "text": "An ASP MAY dynamically de-register with an SGP as an ASP within an Application Server for individual Interface Identifier(s) using the DEREG REQ message. A Interface Identifier parameter in the DEREG REQ specifies which Interface Identifier to de-register.",
      "ja": "ASPは、DEREG REQメッセージを使用して、個々のインターフェイス識別子のアプリケーションサーバー内のASPとしてSGPを動的に登録することができます。DEREG REQのインターフェイス識別子パラメーターは、登録するためのインターフェイス識別子を指定します。"
    },
    {
      "indent": 3,
      "text": "The SGP examines the contents of the received Interface Identifier parameter and validates that the ASP is currently registered in the Application Server(s) related to the included Interface Identifier(s). If validated, the ASP is de-registered as an ASP in the related Application Server.",
      "ja": "SGPは、受信されたインターフェイス識別子パラメーターの内容を調べ、ASPが現在含まれているインターフェイス識別子に関連するアプリケーションサーバーに登録されていることを検証します。検証されている場合、ASPは関連するアプリケーションサーバーのASPとして解放されます。"
    },
    {
      "indent": 3,
      "text": "The deregistration procedure does not necessarily imply the deletion of Link Key and Application Server configuration data at the SGP. Other ASPs may continue to be associated with the Application Server, in which case the Link Key data CANNOT be deleted. If a Deregistration results in no more ASPs in an Application Server, an SGP MAY delete the Link Key data.",
      "ja": "規制緩和手順は、SGPでのリンクキーおよびアプリケーションサーバー構成データの削除を必ずしも意味するものではありません。他のASPは引き続きアプリケーションサーバーに関連付けられている可能性があります。その場合、リンクキーデータを削除することはできません。登録がアプリケーションサーバーにASPがなくなった場合、SGPはリンクキーデータを削除する場合があります。"
    },
    {
      "indent": 3,
      "text": "The SGP acknowledges the de-registration required by returning a DEREG RSP to the requesting ASP. The result of the de-registration is found in the Deregistration Result parameter, indicating success or failure with cause.",
      "ja": "SGPは、Dereg RSPを要求ASPに返すことで必要な登録解除を認めています。登録解除の結果は、登録結果パラメーターにあり、原因による成功または失敗を示しています。"
    },
    {
      "indent": 3,
      "text": "An ASP MAY de-register multiple Interface Identifiers at once by including a number of Interface Identifiers in a single DEREG REQ message. The SGP MUST respond to each deregistration request in a single DEREG RSP message, indicating the success or failure result for each Interface Identifier in a separate Deregistration Result parameter.",
      "ja": "ASPは、単一のdereg reqメッセージに多くのインターフェイス識別子を含めることにより、複数のインターフェイス識別子を一度に登録することができます。SGPは、単一のDereg RSPメッセージの各登録要求に応答する必要があり、個別の登録結果パラメーターの各インターフェイス識別子の成功または障害の結果を示します。"
    },
    {
      "indent": 0,
      "text": "5.0 Examples of MTP2 User Adaptation (M2UA) Procedures",
      "section_title": true,
      "ja": "5.0 MTP2ユーザー適応（M2UA）手順の例"
    },
    {
      "indent": 0,
      "text": "5.1 Establishment of associations between SGP and MGC examples",
      "section_title": true,
      "ja": "5.1 SGPとMGCの例との関連の確立"
    },
    {
      "indent": 0,
      "text": "5.1.1 Single ASP in an Application Server (1+0 sparing)",
      "section_title": true,
      "ja": "5.1.1 アプリケーションサーバーの単一ASP（1 0スパーリング）"
    },
    {
      "indent": 3,
      "text": "This scenario shows the example M2UA message flows for the establishment of traffic between an SGP and an ASP, where only one ASP is configured within an AS (no backup). It is assumed that the SCTP association is already set-up.",
      "ja": "このシナリオは、SGPとASP間のトラフィックの確立のためのM2UAメッセージフローの例を示しています。AS（バックアップなし）内で1つのASPのみが構成されています。SCTP協会はすでにセットアップされていると想定されています。"
    },
    {
      "indent": 16,
      "text": "SGP                       ASP1\n |\n |<---------ASP Up----------|\n |--------ASP Up Ack------->|\n |                          |\n |<-------ASP Active--------|\n |------ASP Active Ack----->|\n |                          |\n |------NTFY(AS-ACTIVE)---->|",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.1.2 Single ASP in an Application Server (1+0 sparing) with Dynamic Registration",
      "section_title": true,
      "ja": "5.1.2 動的登録を伴うアプリケーションサーバー（1 0スパーリング）の単一ASP"
    },
    {
      "indent": 3,
      "text": "This scenario is the same as the one shown in Section 5.1.1 except with a dynamic registration (automatic allocation) of an Interface Identifier(s).",
      "ja": "このシナリオは、インターフェイス識別子の動的登録（自動割り当て）を除いて、セクション5.1.1に示されているシナリオと同じです。"
    },
    {
      "indent": 16,
      "text": "SGP                       ASP1\n |\n |<---------ASP Up----------|\n |--------ASP Up Ack------->|\n |                          |\n |<--------REG REQ----------|\n |------REG REQ RESP------->|\n |                          |\n |<-------ASP Active--------|\n |------ASP Active Ack----->|\n |                          |\n |------NTFY(AS-ACTIVE)---->|",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.1.3 Two ASPs in Application Server (1+1 sparing)",
      "section_title": true,
      "ja": "5.1.3 アプリケーションサーバーの2つのASP（1 1スパーリング）"
    },
    {
      "indent": 3,
      "text": "This scenario shows the example M2UA message flows for the establishment of traffic between an SGP and two ASPs in the same Application Server, where ASP1 is configured to be active and ASP2 to be standby in the event of communication failure or the withdrawal from service of ASP1. ASP2 MAY act as a hot, warm, or cold standby depending on the extent to which ASP1 and ASP2 share call/transaction state or can communicate call state under failure/withdrawal events.",
      "ja": "このシナリオは、同じアプリケーションサーバーでSGPと2つのASP間のトラフィックの確立のためのM2UAメッセージフローの例を示しています。ここで、ASP1は、通信障害またはASP1のサービスからの撤回からの撤回の場合に、ASP1がスタンバイになるように構成されています。。ASP2は、ASP1とASP2がコール/トランザクション状態を共有する程度に応じて、ホット、ウォーム、またはコールドのスタンバイとして機能するか、失敗/引き出しイベントの下でコール状態を通信できる場合があります。"
    },
    {
      "indent": 10,
      "text": "SGP                       ASP1                       ASP2\n |                         |                          |\n |<--------ASP Up----------|                          |\n |-------ASP Up Ack------->|                          |\n |                         |                          |\n |<-----------------------------ASP Up----------------|\n |----------------------------ASP Up Ack------------->|\n |                         |                          |\n |                         |                          |\n |<-------ASP Active-------|                          |\n |-----ASP Active Ack----->|                          |\n |                         |                          |\n |                         |                          |\n |-----NTFY(AS-ACTIVE)---->|                          |\n |                         |                          |\n |------------------NTFY(AS-ACTIVE)------------------>|",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.2 ASP Traffic Fail-over Examples",
      "section_title": true,
      "ja": "5.2 ASPトラフィックフェールオーバーの例"
    },
    {
      "indent": 0,
      "text": "5.2.1 (1+1 Sparing, withdrawal of ASP, backup Override)",
      "section_title": true,
      "ja": "5.2.1 （1 1スパーリング、ASPの撤回、バックアップオーバーライド）"
    },
    {
      "indent": 3,
      "text": "Following on from the example in Section 5.1.2, and ASP withdraws from service:",
      "ja": "セクション5.1.2の例に続き、ASPはサービスから撤退します。"
    },
    {
      "indent": 9,
      "text": "SGP                       ASP1                       ASP2\n  |                         |                          |\n  |<-----ASP Inactive-------|                          |\n  |----ASP Inactive Ack---->|                          |\n  |                         |                          |\n  |----NTFY(AS-PENDING)---->|                          |\n  |------------------NTFY(AS-PENDING)----------------->|\n  |                         |                          |\n  |<------------------------------ ASP Active----------|\n  |-----------------------------ASP Active Ack-------->|\n  |                         |                          |\n  |-----NTFY(AS-ACTIVE)---->|                          |\n  |------------------NTFY(AS-ACTIVE)------------------>|\n  |                         |                          |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In this case, the SGP notifies ASP2 that the AS has moved to the AS-PENDING state. ASP2 sends ASP Active to bring the AS back to the AS-ACTIVE state. If ASP2 did not send the ASP Active message before T(r) expired, the SGP would send a NOTIFY (AS-DOWN).",
      "ja": "この場合、SGPはASP2に、ASが維持状態に移動したことを通知します。ASP2はASPをアクティブに送り、ASをアクティブな状態に戻します。ASP2がt（r）の有効期限が切れる前にASPアクティブメッセージを送信しなかった場合、SGPは通知（as-down）を送信します。"
    },
    {
      "indent": 3,
      "text": "Note: If the SGP detects loss of the M2UA peer (through a detection of SCTP failure), the initial SGP-ASP1 ASP Inactive message exchange would not occur.",
      "ja": "注：SGPがM2UAピアの損失を検出した場合（SCTP障害の検出を通じて）、初期SGP-ASP1 ASPの不活性なメッセージ交換は発生しません。"
    },
    {
      "indent": 5,
      "text": "     SGP                       ASP1                       ASP2\n      |                         |                          |\n(detects SCTP failure)\n      |------------------NTFY(AS-PENDING)----------------->|\n      |                         |                          |\n      |<------------------------------ ASP Active----------|\n      |-----------------------------ASP Active Ack-------->|\n      |                         |                          |\n      |------------------NTFY(AS-ACTIVE)------------------>|\n      |                         |                          |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.2.2 (1+1 Sparing, backup Override)",
      "section_title": true,
      "ja": "5.2.2 （1 1スパーリング、バックアップオーバーライド）"
    },
    {
      "indent": 3,
      "text": "Following on from the example in Section 5.1.2, and ASP2 wishes to override ASP1 and take over the traffic:",
      "ja": "セクション5.1.2の例に続いて、ASP2はASP1をオーバーライドし、トラフィックを引き継ぎたいと考えています。"
    },
    {
      "indent": 10,
      "text": "SGP                       ASP1                       ASP2\n |                         |                          |\n |<-------------------------------ASP Active----------|\n |-----------------------------ASP Active Ack-------->|\n |----NTFY(Alt ASP-Act)--->|                          |\n |                         |                          |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In this case, the SGP notifies ASP1 that an alternative ASP has overridden it.",
      "ja": "この場合、SGPはASP1に代替ASPがそれをオーバーライドしたことを通知します。"
    },
    {
      "indent": 0,
      "text": "5.3 SGP to MGC, MTP Level 2 to MTP Level 3 Boundary Procedures",
      "section_title": true,
      "ja": "5.3 SGPからMGC、MTPレベル2からMTPレベル3の境界手順"
    },
    {
      "indent": 3,
      "text": "When the M2UA layer on the ASP has a MAUP message to send to the SGP, it will do the following:",
      "ja": "ASP上のM2UAレイヤーにSGPに送信するMAUPメッセージがある場合、次のことを行います。"
    },
    {
      "indent": 6,
      "text": "- Determine the correct SGP",
      "ja": "- 正しいSGPを決定します"
    },
    {
      "indent": 6,
      "text": "- Find the SCTP association to the chosen SGP",
      "ja": "- 選択したSGPのSCTP協会を見つけます"
    },
    {
      "indent": 6,
      "text": "- Determine the correct stream in the SCTP association based on the SS7 link",
      "ja": "- SS7リンクに基づいてSCTP協会の正しいストリームを決定する"
    },
    {
      "indent": 6,
      "text": "- Fill in the MAUP message, fill in M2UA Message Header, fill in Common Header",
      "ja": "- maupメッセージに記入し、M2UAメッセージヘッダーに記入し、共通ヘッダーに記入します"
    },
    {
      "indent": 6,
      "text": "- Send the MAUP message to the remote M2UA peer in the SGP, over the SCTP association",
      "ja": "- SCTP協会を介して、SGPのリモートM2UAピアにMaupメッセージを送信します"
    },
    {
      "indent": 3,
      "text": "When the M2UA layer on the SGP has a MAUP message to send to the ASP, it will do the following:",
      "ja": "SGPのM2UAレイヤーにASPに送信するMAUPメッセージがある場合、次のことを行います。"
    },
    {
      "indent": 6,
      "text": "- Determine the AS for the Interface Identifier",
      "ja": "- インターフェイス識別子のASを決定します"
    },
    {
      "indent": 6,
      "text": "- Determine the Active ASP (SCTP association) within the AS",
      "ja": "- as内のアクティブなASP（SCTP Association）を決定する"
    },
    {
      "indent": 6,
      "text": "- Determine the correct stream in the SCTP association based on the SS7 link",
      "ja": "- SS7リンクに基づいてSCTP協会の正しいストリームを決定する"
    },
    {
      "indent": 6,
      "text": "- Fill in the MAUP message, fill in M2UA Message Header, fill in Common Header",
      "ja": "- maupメッセージに記入し、M2UAメッセージヘッダーに記入し、共通ヘッダーに記入します"
    },
    {
      "indent": 6,
      "text": "- Send the MAUP message to the remote M2UA peer in the ASP, over the SCTP association",
      "ja": "- SCTP協会を介して、ASPのリモートM2UAピアにmaupメッセージを送信する"
    },
    {
      "indent": 0,
      "text": "5.3.1 SS7 Link Alignment",
      "section_title": true,
      "ja": "5.3.1 SS7リンクアライメント"
    },
    {
      "indent": 3,
      "text": "The MGC can request that a SS7 link be brought into alignment using the normal or emergency procedure [2][3]. An example of the message flow to bring a SS7 link in-service using the normal alignment procedure is shown below.",
      "ja": "MGCは、通常または緊急の手順[2] [3]を使用して、SS7リンクをアライメントにすることを要求できます。通常のアライメント手順を使用してSS7リンク内のサービスを提供するメッセージフローの例を以下に示します。"
    },
    {
      "indent": 7,
      "text": "MTP2            M2UA                  M2UA               MTP3\n SGP             SGP                   ASP                ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "<----Start Req---|<---Establish Req----|<----Start Req------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "---In Serv Ind-->|----Establish Cfm--->|----In Serv Ind---->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "An example of the message flow to bring a SS7 link in-service using the emergency alignment procedure.",
      "ja": "緊急アライメント手順を使用してSS7リンク内のサービスを提供するメッセージフローの例。"
    },
    {
      "indent": 1,
      "text": "MTP2            M2UA                               M2UA           MTP3\n SGP             SGP                                ASP            ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "<----Emer Req----|<--State Req (STATUS_EMER_SET)----|<----Emer Req---",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "-----Emer Cfm--->|---State Cfm (STATUS_EMER_SET)--->|----Emer Cfm---->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "<---Start Req----|<-------Establish Req-------------|<---Start Req----",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "---In Serv Ind-->|--------Establish Cfm------------>|---In Serv Ind-->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.3.2 SS7 Link Release",
      "section_title": true,
      "ja": "5.3.2 SS7リンクリリース"
    },
    {
      "indent": 3,
      "text": "The MGC can request that a SS7 link be taken out-of-service. It uses the Release Request message as shown below.",
      "ja": "MGCは、SS7リンクをサービス外に使用することを要求できます。以下に示すように、リリース要求メッセージを使用します。"
    },
    {
      "indent": 5,
      "text": "MTP2               M2UA                  M2UA                MTP3\n SGP                SGP                   ASP                 ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "<-----Stop Req-----|<---Release Req------|<-----Stop Req------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "--Out of Serv Ind->|----Release Cfm----->|--Out of Serv Ind-->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The SGP can autonomously indicate that a SS7 link has gone out-of-service as shown below.",
      "ja": "SGPは、以下に示すように、SS7リンクがサービス外になったことを自律的に示すことができます。"
    },
    {
      "indent": 7,
      "text": "MTP2           M2UA                  M2UA              MTP3\n SGP            SGP                   ASP               ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "--Out of Serv->|----Release Ind----->|--Out of Serv-->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.3.3 Set and Clear Local Processor Outage",
      "section_title": true,
      "ja": "5.3.3 ローカルプロセッサの停止を設定してクリアします"
    },
    {
      "indent": 3,
      "text": "The MGC can set a Local Processor Outage condition. It uses the State Request message as shown below.",
      "ja": "MGCは、ローカルプロセッサの停止条件を設定できます。以下に示すように、状態要求メッセージを使用します。"
    },
    {
      "indent": 2,
      "text": "MTP2            M2UA                               M2UA           MTP3\n SGP             SGP                                ASP            ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "<----LPO Req----|<---State Req (STATUS_LPO_SET)----|<----LPO Req---",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-----LPO Cfm--->|----State Cfm (STATUS_LPO_SET)--->|----LPO Cfm---->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The MGC can clear a Local Processor Outage condition. It uses the State Request message as shown below.",
      "ja": "MGCは、ローカルプロセッサの停止条件をクリアできます。以下に示すように、状態要求メッセージを使用します。"
    },
    {
      "indent": 2,
      "text": "MTP2            M2UA                               M2UA          MTP3\n SGP             SGP                                ASP           ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "<---LPO Req---|<---State Req (STATUS_LPO_CLEAR)----|<----LPO Req---",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "----LPO Cfm-->|----State Cfm (STATUS_LPO_CLEAR)--->|----LPO Cfm---->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.3.4 Notification of Remote Processor Outage",
      "section_title": true,
      "ja": "5.3.4 リモートプロセッサ停止の通知"
    },
    {
      "indent": 3,
      "text": "The SGP can indicate that Remote has entered or exited the Processor Outage condition for a SS7 link. It uses the State Indication message as shown below.",
      "ja": "SGPは、SS7リンクのプロセッサ停止条件をリモートに入力または終了したことを示すことができます。以下に示すように、状態表示メッセージを使用します。"
    },
    {
      "indent": 1,
      "text": "MTP2           M2UA                                M2UA           MTP3\n SGP            SGP                                 ASP            ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "----RPO Ind---->|----State Ind (EVENT_RPO_ENTER)-->|-----RPO Ind---->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "-RPO Rcvr Ind-->|----State Ind (EVENT_RPO_EXIT)--->|--RPO Rcvr Ind-->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.3.5 Notification of SS7 Link Congestion",
      "section_title": true,
      "ja": "5.3.5 SS7リンクの混雑の通知"
    },
    {
      "indent": 3,
      "text": "The SGP can indicate that a SS7 link has become congested. It uses the Congestion Indication message as shown below.",
      "ja": "SGPは、SS7リンクが混雑していることを示すことができます。以下に示すように、輻輳表示メッセージを使用します。"
    },
    {
      "indent": 1,
      "text": "MTP2           M2UA                                M2UA           MTP3\n SGP            SGP                                 ASP            ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "----Cong Ind---->|--------Cong Ind (STATUS)------->|----Cong Ind---->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "-Cong Cease Ind->|--------Cong Ind (STATUS)------->|-Cong Cease Ind->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.3.6 SS7 Link Changeover",
      "section_title": true,
      "ja": "5.3.6 SS7リンク切り替え"
    },
    {
      "indent": 3,
      "text": "An example of the message flow for an error free changeover is shown below. In this example, there were three messages in the retransmission queue that needed to be retrieved.",
      "ja": "エラーのない切り替えのメッセージフローの例を以下に示します。この例では、再送信キューには、取得する必要がある3つのメッセージがありました。"
    },
    {
      "indent": 2,
      "text": "MTP2          M2UA                            M2UA             MTP3\n SGP           SGP                             ASP              ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "<-Rtrv BSN Req-|<--Rtrv Req (ACTION_RTRV_BSN)--|<--Rtrv BSN Req---\n                            (seq_num = 0)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-Rtrv BSN Cfm->|---Rtrv Cfm (ACTION_RTRV_BSN)->|---Rtrv BSN Cfm-->\n                            (seq_num = BSN)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "<-Rtrv Msg Req-|<-Rtrv Req (ACTION_RTRV_MSGS)--|<--Rtrv Msg Req---\n                            (seq_num = FSN)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-Rtrv Msg Cfm->|--Rtrv Cfm (ACTION_RTRV_MSGS)->|---Rtrv Msg Cfm-->\n                            (seq_num = 0)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-Rtrv Msg Ind->|---------Retrieval Ind ------->|---Rtrv Msg Ind-->\n-Rtrv Msg Ind->|---------Retrieval Ind ------->|---Rtrv Msg Ind-->\n-Rtrv Msg Ind->|---------Retrieval Ind ------->|---Rtrv Msg Ind-->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-Rtrv Compl Ind->|----Retrieval Compl Ind ---->|-Rtrv Compl Ind-->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Note: The number of Retrieval Indication is dependent on the number of messages in the retransmit queue that have been requested. Only one Retrieval Complete Indication SHOULD be sent.",
      "ja": "注：検索指示の数は、要求された再送信キュー内のメッセージの数に依存します。検索完全な表示は1つだけ送信されます。"
    },
    {
      "indent": 3,
      "text": "An example of a message flow with an error retrieving the BSN is shown below.",
      "ja": "BSNを取得するエラーがあるメッセージフローの例を以下に示します。"
    },
    {
      "indent": 2,
      "text": "MTP2          M2UA                            M2UA             MTP3\n SGP           SGP                             ASP              ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "<-Rtrv BSN Req-|<--Rtrv Req (ACTION_RTRV_BSN)--|<--Rtrv BSN Req---",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-BSN Not Rtrv->|---Rtrv Cfm (ACTION_RTRV_BSN)->|---BSN Not Rtrv-->\n                            (seq_num = -1)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "An example of a message flow with an error retrieving the messages is shown below.",
      "ja": "メッセージを取得するエラーがあるメッセージフローの例を以下に示します。"
    },
    {
      "indent": 3,
      "text": "<-Rtrv BSN Req-|<--Rtrv Req (ACTION_RTRV_BSN)--|<--Rtrv BSN Req---",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-Rtrv BSN Cfm->|---Rtrv Cfm (ACTION_RTRV_BSN)->|---Rtrv BSN Cfm-->\n                            (seq_num = BSN)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "<-Rtrv Msg Req-|<-Rtrv Req (ACTION_RTRV_MSGS)--|<--Rtrv Msg Req---\n                            (seq_num = FSN)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-Rtrv Msg Cfm->|--Rtrv Cfm (ACTION_RTRV_MSGS)->|---Rtrv Msg Cfm-->\n                            (seq_num = -1)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "An example of a message flow for a request to drop messages (clear retransmission buffers) is shown below.",
      "ja": "メッセージをドロップするリクエストのメッセージフローの例（明確な再送信バッファー）を以下に示します。"
    },
    {
      "indent": 2,
      "text": "MTP2          M2UA                            M2UA             MTP3\n SGP           SGP                             ASP              ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 1,
      "text": "-Clr RTB Req----|<-StateReq (STATUS_CLEAR_RTB)--|<--Clr RTB Req-----",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 1,
      "text": "-Clr RTB Req--->|-StateCfm (STATUS_CLEAR_RTB)-->|---Clr RTB Req---->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.3.7 Flush and Continue",
      "section_title": true,
      "ja": "5.3.7 フラッシュして続行します"
    },
    {
      "indent": 3,
      "text": "The following message flow shows a request to flush buffers.",
      "ja": "次のメッセージフローは、バッファをフラッシュするリクエストを示しています。"
    },
    {
      "indent": 2,
      "text": "MTP2            M2UA                              M2UA          MTP3\n SGP             SGP                               ASP           ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "<--Flush Req----|<-State Req (STATUS_FLUSH_BUFS)--|<---Flush Req--",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "---Flush Cfm--->|--State Cfm (STATUS_FLUSH_BUFS)->|---Flush Cfm--> The following message flow shows a request to continue.",
      "ja": "---フラッシュCFM ---> |  - ステートCFM（status_flush_bufs） - > | ---フラッシュcfm->次のメッセージフローには、続行するリクエストが表示されます。"
    },
    {
      "indent": 2,
      "text": "MTP2            M2UA                              M2UA          MTP3\n SGP             SGP                               ASP           ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "<---Cont Req----|<--State Req (STATUS_CONTINUE)---|<---Cont Req---",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "----Cont Cfm--->|---State Cfm (STATUS_CONTINUE)-->|----Cont Cfm-->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5.3.8 Auditing of SS7 link state",
      "section_title": true,
      "ja": "5.3.8 SS7リンク状態の監査"
    },
    {
      "indent": 3,
      "text": "It may be necessary for the ASP to audit the current state of a SS7 link. The flows below show an example of the request and all the potential responses.",
      "ja": "ASPがSS7リンクの現在の状態を監査する必要がある場合があります。以下のフローは、リクエストの例とすべての潜在的な応答を示しています。"
    },
    {
      "indent": 3,
      "text": "Below is an example in which the SS7 link is out-of-service.",
      "ja": "以下は、SS7リンクがサービス外である例です。"
    },
    {
      "indent": 1,
      "text": "MTP2           M2UA                              M2UA           MGMT\n SGP            SGP                               ASP            ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "|<----State Req (STATUS_AUDIT)----|<----Audit-------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 65,
      "text": "MTP3 ASP",
      "ja": "mtp3 asp"
    },
    {
      "indent": 17,
      "text": "|-----------Release Ind---------->|-Out of Serv Ind->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 65,
      "text": "MGMT ASP",
      "ja": "mgmt asp"
    },
    {
      "indent": 17,
      "text": "|-----State Cfm (STATUS_AUDIT)--->|----Audit Cfm--->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Below is an example in which the SS7 link is in-service.",
      "ja": "以下は、SS7リンクがサービスである例です。"
    },
    {
      "indent": 1,
      "text": "MTP2           M2UA                              M2UA           MGMT\n SGP            SGP                               ASP            ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "|<----State Req (STATUS_AUDIT)----|<----Audit-------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 65,
      "text": "MTP3 ASP",
      "ja": "mtp3 asp"
    },
    {
      "indent": 17,
      "text": "|-----------Establish Cfm-------->|---In Serv Ind-->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 65,
      "text": "MGMT ASP",
      "ja": "mgmt asp"
    },
    {
      "indent": 17,
      "text": "|-----State Cfm (STATUS_AUDIT)--->|----Audit Cfm--->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Below is an example in which the SS7 link is in-service, but congested.",
      "ja": "以下は、SS7リンクがサービスであるが混雑している例です。"
    },
    {
      "indent": 1,
      "text": "MTP2           M2UA                              M2UA           MGMT\n SGP            SGP                               ASP            ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "|<----State Req (STATUS_AUDIT)----|<----Audit-------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 65,
      "text": "MTP3 ASP",
      "ja": "mtp3 asp"
    },
    {
      "indent": 17,
      "text": "|-----------Establish Cfm-------->|---In Serv Ind-->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "|----------Congestion Ind-------->|---Cong Ind----->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 65,
      "text": "MGMT ASP",
      "ja": "mgmt asp"
    },
    {
      "indent": 17,
      "text": "|-----State Cfm (STATUS_AUDIT)--->|----Audit Cfm--->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Below is an example in which the SS7 link is in-service, but in Remote Processor Outage.",
      "ja": "以下は、SS7リンクがインサービスであるが、リモートプロセッサの停止である例です。"
    },
    {
      "indent": 1,
      "text": "MTP2           M2UA                              M2UA           MGMT\n SGP            SGP                               ASP            ASP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "|<----State Req (STATUS_AUDIT)----|<---Audit Req----",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 65,
      "text": "MTP3 ASP",
      "ja": "mtp3 asp"
    },
    {
      "indent": 17,
      "text": "|-----------Establish Ind-------->|---In Serv Ind-->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "|---State Ind (EVENT_RPO_ENTER)-->|----RPO Enter--->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 65,
      "text": "MGMT ASP",
      "ja": "mgmt asp"
    },
    {
      "indent": 17,
      "text": "|-----State Cfm (STATUS_AUDIT)--->|----Audit Cfm--->",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.0 Timer Values",
      "section_title": true,
      "ja": "6.0 タイマー値"
    },
    {
      "indent": 3,
      "text": "The recommended default values for M2UA timers are:",
      "ja": "M2UAタイマーの推奨デフォルト値は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "T(r) 2 seconds T(ack) 2 seconds T(beat) Heartbeat Timer 30 seconds",
      "ja": "T（R）2秒T（ACK）2秒T（ビート）ハートビートタイマー30秒"
    },
    {
      "indent": 0,
      "text": "7.0 Security Considerations",
      "section_title": true,
      "ja": "7.0 セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "M2UA is designed to carry signalling messages for telephony services. As such, M2UA MUST involve the security needs of several parties: the end users of the services; the network providers and the applications involved. Additional requirements MAY come from local regulation. While having some overlapping security needs, any security solution SHOULD fulfill all of the different parties' needs.",
      "ja": "M2UAは、テレフォニーサービス用のシグナリングメッセージを携帯するように設計されています。そのため、M2UAには、いくつかの関係者のセキュリティニーズが必要です。サービスのエンドユーザー。ネットワークプロバイダーと関連するアプリケーション。追加の要件は、現地の規制から生じる場合があります。重複するセキュリティニーズがありますが、セキュリティソリューションはすべてのさまざまな当事者のニーズを満たす必要があります。"
    },
    {
      "indent": 0,
      "text": "7.1 Threats",
      "section_title": true,
      "ja": "7.1 脅威"
    },
    {
      "indent": 3,
      "text": "There is no quick fix, one-size-fits-all solution for security. As a transport protocol, M2UA has the following security objectives:",
      "ja": "セキュリティのためのクイックフィックス、ワンサイズのすべてのソリューションはありません。輸送プロトコルとして、M2UAには次のセキュリティ目標があります。"
    },
    {
      "indent": 6,
      "text": "* Availability of reliable and timely user data transport.\n\n* Integrity of user data transport.\n\n* Confidentiality of user data.",
      "ja": "*信頼できるタイムリーなユーザーデータトランスポートの可用性。\n\n*ユーザーデータトランスポートの整合性。\n\n*ユーザーデータの機密性。"
    },
    {
      "indent": 3,
      "text": "M2UA runs on top of SCTP. SCTP [8] provides certain transport related security features, such as:",
      "ja": "M2UAはSCTPの上で実行されます。SCTP [8]は、次のような特定の輸送関連のセキュリティ機能を提供します。"
    },
    {
      "indent": 6,
      "text": "* Blind Denial of Service Attacks * Flooding * Masquerade * Improper Monopolization of Services",
      "ja": "* 盲目のサービス拒否攻撃 *洪水 *仮面舞踏会 *サービスの不適切な独占"
    },
    {
      "indent": 3,
      "text": "When M2UA is running in a professionally managed corporate or service provider network, it is reasonable to expect that this network includes an appropriate security policy framework. The \"Site Security Handbook\" [13] SHOULD be consulted for guidance.",
      "ja": "M2UAが専門的に管理されているコーポレートまたはサービスプロバイダーネットワークで実行されている場合、このネットワークに適切なセキュリティポリシーフレームワークが含まれることを期待することは合理的です。「サイトセキュリティハンドブック」[13]は、ガイダンスについて参照する必要があります。"
    },
    {
      "indent": 3,
      "text": "When the network in which M2UA runs in involves more than one party, it MAY NOT be reasonable to expect that all parties have implemented security in a sufficient manner. In such a case, it is recommended that IPSEC is used to ensure confidentiality of user payload. Consult [14] for more information on configuring IPSEC services.",
      "ja": "M2UAが実行されるネットワークに複数の当事者が関与する場合、すべての当事者が十分な方法でセキュリティを実装していることを期待することは合理的ではないかもしれません。そのような場合、ユーザーペイロードの機密性を確保するためにIPSECを使用することをお勧めします。IPSECサービスの構成の詳細については、[14]に相談してください。"
    },
    {
      "indent": 0,
      "text": "7.2 Protecting Confidentiality",
      "section_title": true,
      "ja": "7.2 機密性の保護"
    },
    {
      "indent": 3,
      "text": "Particularly for mobile users, the requirement for confidentiality MAY include the masking of IP addresses and ports. In this case application level encryption is not sufficient; IPSEC ESP SHOULD be used instead. Regardless of which level performs the encryption, the IPSEC ISAKMP service SHOULD be used for key management.",
      "ja": "特にモバイルユーザーにとって、機密性の要件には、IPアドレスとポートのマスキングが含まれる場合があります。この場合、アプリケーションレベルの暗号化は十分ではありません。代わりにIPSEC ESPを使用する必要があります。どのレベルが暗号化を実行するかに関係なく、IPSEC ISAKMPサービスをキー管理に使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "8.0 IANA Considerations",
      "section_title": true,
      "ja": "8.0 IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "8.1 SCTP Payload Protocol Identifier",
      "section_title": true,
      "ja": "8.1 SCTPペイロードプロトコル識別子"
    },
    {
      "indent": 3,
      "text": "A request will be made to IANA to assign an M2UA value for the Payload Protocol Identifier in SCTP Payload Data chunk. The following SCTP Payload Protocol Identifier has been registered:",
      "ja": "IANAには、SCTPペイロードデータチャンクのペイロードプロトコル識別子にM2UA値を割り当てるリクエストが行われます。次のSCTPペイロードプロトコル識別子が登録されています。"
    },
    {
      "indent": 9,
      "text": "M2UA \"2\"",
      "ja": "M2UA \"2\""
    },
    {
      "indent": 3,
      "text": "The SCTP Payload Protocol Identifier is included in each SCTP Data chunk, to indicate which protocol the SCTP is carrying. This Payload Protocol Identifier is not directly used by SCTP but MAY be used by certain network entities to identify the type of information being carried in a Data chunk.",
      "ja": "SCTPペイロードプロトコル識別子は、各SCTPデータチャンクに含まれており、SCTPが携帯しているプロトコルを示します。このペイロードプロトコル識別子は、SCTPで直接使用されるのではなく、特定のネットワークエンティティで使用されて、データチャンクで運ばれる情報の種類を識別することができます。"
    },
    {
      "indent": 3,
      "text": "The User Adaptation peer MAY use the Payload Protocol Identifier as a way of determining additional information about the data being presented to it by SCTP.",
      "ja": "ユーザー適応ピアは、SCTPによって提示されているデータに関する追加情報を決定する方法として、ペイロードプロトコル識別子を使用する場合があります。"
    },
    {
      "indent": 0,
      "text": "8.2 M2UA Protocol Extensions",
      "section_title": true,
      "ja": "8.2 M2UAプロトコル拡張"
    },
    {
      "indent": 3,
      "text": "This protocol may also be extended through IANA in three ways:",
      "ja": "このプロトコルは、3つの方法でIANAを介して拡張することもできます。"
    },
    {
      "indent": 6,
      "text": "-- through definition of additional message classes,\n-- through definition of additional message types, and\n-- through definition of additional message parameters.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The definition and use of new message classes, types and parameters is an integral part of SIGTRAN adaptation layers. Thus, these extensions are assigned by IANA through an IETF Consensus action as defined in [RFC2434].",
      "ja": "新しいメッセージクラス、タイプ、パラメーターの定義と使用は、シグトラン適応レイヤーの不可欠な部分です。したがって、これらの拡張機能は、[RFC2434]で定義されているIETFコンセンサスアクションを通じてIANAによって割り当てられます。"
    },
    {
      "indent": 3,
      "text": "The proposed extension must in no way adversely affect the general working of the protocol.",
      "ja": "提案された拡張は、プロトコルの一般的な作業に決して悪影響を及ぼさないでください。"
    },
    {
      "indent": 0,
      "text": "8.2.1 IETF Defined Message Classes",
      "section_title": true,
      "ja": "8.2.1 IETFはメッセージクラスを定義しました"
    },
    {
      "indent": 3,
      "text": "The documentation for a new message class MUST include the following information:",
      "ja": "新しいメッセージクラスのドキュメントには、次の情報を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "(a) A long and short name for the message class. (b) A detailed description of the purpose of the message class.",
      "ja": "(a) メッセージクラスの長くて短い名前。（b）メッセージクラスの目的の詳細な説明。"
    },
    {
      "indent": 0,
      "text": "8.2.2 IETF Defined Message Types",
      "section_title": true,
      "ja": "8.2.2 IETFはメッセージタイプを定義しました"
    },
    {
      "indent": 3,
      "text": "Documentation of the message type MUST contain the following information:",
      "ja": "メッセージタイプのドキュメントには、次の情報が含まれている必要があります。"
    },
    {
      "indent": 3,
      "text": "(a) A long and short name for the new message type. (b) A detailed description of the structure of the message. (c) A detailed definition and description of intended use of each field within the message. (d) A detailed procedural description of the use of the new message type within the operation of the protocol. (e) A detailed description of error conditions when receiving this message type.",
      "ja": "(a) 新しいメッセージタイプの長くて短い名前。（b）メッセージの構造の詳細な説明。（c）メッセージ内の各フィールドの使用の使用の詳細な定義と説明。（d）プロトコルの操作内での新しいメッセージタイプの使用に関する詳細な手続き的説明。（e）このメッセージタイプを受信するときのエラー条件の詳細な説明。"
    },
    {
      "indent": 3,
      "text": "When an implementation receives a message type which it does not support, it MUST respond with an Error (ERR) message with an Error Code of Unsupported Message Type.",
      "ja": "実装がサポートされていないメッセージタイプを受信した場合、サポートされていないメッセージタイプのエラーコードを使用してエラー（ERR）メッセージで応答する必要があります。"
    },
    {
      "indent": 0,
      "text": "8.2.3 IETF-defined TLV Parameter Extension",
      "section_title": true,
      "ja": "8.2.3 IETF定義のTLVパラメーター拡張機能"
    },
    {
      "indent": 3,
      "text": "Documentation of the message parameter MUST contain the following information:",
      "ja": "メッセージパラメーターのドキュメントには、次の情報が含まれている必要があります。"
    },
    {
      "indent": 3,
      "text": "(a) Name of the parameter type. (b) Detailed description of the structure of the parameter field. This structure MUST conform to the general type-length-value format described in Section 3.1.5. (c) Detailed definition of each component of the parameter value. (d) Detailed description of the intended use of this parameter type, and an indication of whether and under what circumstances multiple instances of this parameter type may be found within the same message type.",
      "ja": "(a) パラメータータイプの名前。（b）パラメーターフィールドの構造の詳細な説明。この構造は、セクション3.1.5で説明されている一般的なタイプ長価値形式に準拠する必要があります。（c）パラメーター値の各コンポーネントの詳細な定義。（d）このパラメータータイプの意図された使用の詳細な説明、およびこのパラメータータイプの複数のインスタンスが同じメッセージタイプ内にあるかどうかを示しているかどうかを示しています。"
    },
    {
      "indent": 0,
      "text": "9.0 Acknowledgments",
      "section_title": true,
      "ja": "9.0 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Tom George (Alcatel) for contribution of text and effort on the specification.",
      "ja": "著者は、テキストの貢献と仕様に関する努力について、Tom George（Alcatel）に感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank John Loughney, Neil Olson, Michael Tuexen, Nikhil Jain, Steve Lorusso, Dan Brendes, Joe Keller, Heinz Prantner, Barry Nagelberg, Naoto Makinae, Joyce Archibald, Mark Kobine, Nitin Tomar, Harsh Bhondwe and Karen King for their valuable comments and suggestions.",
      "ja": "著者は、ジョン・ラウニー、ニール・オルソン、マイケル・トゥエクセン、ニキル・ジャイン、スティーブ・ロルーソ、ダン・ブレンデス、ジョー・ケラー、ハインツ・プラントナー、バリー・ナゲルバーグ、直西マキナエ、ジョイス・アーチボルド、マーク・コビン、ニティン・トマール、ハーシュ・ブンドウェ、カレン・キングに感謝したいと思います。彼らの貴重なコメントと提案のために。"
    },
    {
      "indent": 0,
      "text": "10.0 References",
      "section_title": true,
      "ja": "10.0 参考文献"
    },
    {
      "indent": 0,
      "text": "10.1 Normative",
      "section_title": true,
      "ja": "10.1 規範"
    },
    {
      "indent": 3,
      "text": "[1] ITU-T Recommendation Q.700, 'Introduction To ITU-T Signalling System No. 7 (SS7)'",
      "ja": "[1] ITU-Tの推奨Q.700、「ITU-Tシグナル伝達システムの紹介7（SS7）」"
    },
    {
      "indent": 3,
      "text": "[2] ITU-T Recommendation Q.701-Q.705, 'Signalling System No. 7 (SS7) - Message Transfer Part (MTP)'",
      "ja": "[2] ITU-Tの推奨Q.701-Q.705、「シグナリングシステムNo. 7（SS7） - メッセージ転送パーツ（MTP）」"
    },
    {
      "indent": 3,
      "text": "[3] ANSI T1.111 'Signalling System Number 7 - Message Transfer Part'",
      "ja": "[3] ANSI T1.111 'シグナリングシステム番号7-メッセージ転送部品'"
    },
    {
      "indent": 3,
      "text": "[4] Bellcore GR-246-CORE 'Bell Communications Research Specification of Signalling System Number 7', Volume 1, December 1995",
      "ja": "[4] ベルコアGR-246コア「ベルコミュニケーション研究仕様シグナルシステム番号7」、第1巻、1995年12月"
    },
    {
      "indent": 3,
      "text": "[5] Telecommunication Technology Committee (TTC) Standard JT-Q704, Message Transfer Part Signaling Network Functions, April 28, 1992.",
      "ja": "[5] Telecommunication Technology Committee（TTC）Standard JT-Q704、メッセージ転送パーツシグナリングネットワーク機能、1992年4月28日。"
    },
    {
      "indent": 3,
      "text": "[6] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", RFC 2279, January 1998.",
      "ja": "[6] Yergeau、F。、「UTF-8、ISO 10646の変換形式」、RFC 2279、1998年1月。"
    },
    {
      "indent": 3,
      "text": "[7] Coded Character Set--7-Bit American Standard Code for Information Interchange, ANSI X3.4-1986.",
      "ja": "[7] コード化された文字セット - 情報インターチェンジのための7ビットアメリカ標準コード、ANSI X3.4-1986。"
    },
    {
      "indent": 0,
      "text": "10.2 Informative",
      "section_title": true,
      "ja": "10.2 有益な"
    },
    {
      "indent": 3,
      "text": "[8] Stewart, R., Xie, Q., Morneault, K., Sharp, C., Schwarzbauer, H., Taylor, T., Rytina, I., Kalla, M., Zhang, L. and V. Paxson, \"Stream Control Transmission Protocol\", RFC 2960, October 2000.",
      "ja": "[8] Stewart、R.、Xie、Q.、Morneault、K.、Sharp、C.、Schwarzbauer、H.、Taylor、T.、Rytina、I.、Kalla、M.、Zhang、L。and V. Paxson、」Stream Control Transmission Protocol \"、RFC 2960、2000年10月。"
    },
    {
      "indent": 3,
      "text": "[9] Ong, L., Rytina, I., Garcia, M., Schwarzbauer, H., Coene, L., Lin, H., Juhasz, I., Holdrege, M. and C. Sharp, \"Architectural Framework for Signalling Transport\", RFC 2719, October 1999.",
      "ja": "[9] Ong、L.、Rytina、I.、Garcia、M.、Schwarzbauer、H.、Coene、L.、Lin、H.、Juhasz、I.、Holdrege、M。and C. Sharp、「信号輸送のための建築枠組み」\"、RFC 2719、1999年10月。"
    },
    {
      "indent": 3,
      "text": "[10] ITU-T Recommendation Q.2140, 'B-ISDN ATM Adaptation Layer', February 1995",
      "ja": "[10] ITU-Tの推奨Q.2140、「B-ISDN ATM適応レイヤー」、1995年2月"
    },
    {
      "indent": 3,
      "text": "[11] ITU-T Recommendation Q.2210, 'Message transfer part level 3 functions and messages using the services of ITU-T Recommendation Q.2140', August 1995",
      "ja": "[11] ITU-Tの推奨事項Q.2210、 'メッセージ転送パーツレベル3の機能とメッセージを使用したメッセージとメッセージQ.2140'、1995年8月"
    },
    {
      "indent": 3,
      "text": "[12] ITU-T Recommendation Q.751.1, 'Network Element Management Information Model for the Message Transfer Part', October 1995",
      "ja": "[12] ITU-Tの推奨Q.751.1、「メッセージ転送パーツのネットワーク要素管理情報モデル」、1995年10月"
    },
    {
      "indent": 3,
      "text": "[13] Fraser, B., \"Site Security Handbook\", FYI 8, RFC 2196, September 1997.",
      "ja": "[13] Fraser、B。、「サイトセキュリティハンドブック」、FYI 8、RFC 2196、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[14] Kent, S. and R. Atkinson, \"Security Architecture for the Internet Protocol\", RFC 2401, November 1998.",
      "ja": "[14] Kent、S。およびR. Atkinson、「インターネットプロトコルのセキュリティアーキテクチャ」、RFC 2401、1998年11月。"
    },
    {
      "indent": 0,
      "text": "Appendix A: Signalling Network Architecture",
      "ja": "付録A：シグナリングネットワークアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "A Signalling Gateway will support the transport of MTP2-User signalling traffic received from the SS7 network to one or more distributed ASPs (e.g., MGCs). Clearly, the M2UA protocol description cannot in itself meet any performance and reliability requirements for such transport. A physical network architecture is required, with data on the availability and transfer performance of the physical nodes involved in any particular exchange of information. However, the M2UA protocol is flexible enough to allow its operation and management in a variety of physical configurations that will enable Network Operators to meet their performance and reliability requirements.",
      "ja": "シグナリングゲートウェイは、SS7ネットワークから1つ以上の分散ASP（MGCなど）に受け取ったMTP2ユーザーシグナリングトラフィックの輸送をサポートします。明らかに、M2UAプロトコルの説明は、そのような輸送のパフォーマンスと信頼性の要件を満たすことはできません。物理ネットワークアーキテクチャが必要であり、特定の情報交換に関与する物理ノードの可用性と転送パフォーマンスに関するデータが必要です。ただし、M2UAプロトコルは、ネットワークオペレーターがパフォーマンスと信頼性の要件を満たすことができるさまざまな物理的構成での運用と管理を可能にするほど柔軟です。"
    },
    {
      "indent": 3,
      "text": "To meet the stringent SS7 signalling reliability and performance requirements for carrier grade networks, these Network Operators should ensure that there is no single point of failure provisioned in the end-to-end network architecture between an SS7 node and an IP ASP.",
      "ja": "キャリアグレードネットワークの厳しいSS7シグナル伝達の信頼性とパフォーマンス要件を満たすために、これらのネットワークオペレーターは、SS7ノードとIP ASPの間にエンドツーエンドネットワークアーキテクチャにプロビジョニングされている単一の障害ポイントがないことを確認する必要があります。"
    },
    {
      "indent": 3,
      "text": "Depending of course on the reliability of the SGP and ASP functional elements, this can typically be met by spreading SS7 links in a SS7 linkset [1] across SGPs or SGs, the provision of redundant QoS-bounded IP network paths for SCTP Associations between SCTP End Points, and redundant Hosts. The distribution of ASPs within the available Hosts is also important. For a particular Application Server, the related ASPs MAY be distributed over at least two Hosts.",
      "ja": "もちろん、SGPおよびASP機能要素の信頼性に応じて、これは通常、SGPまたはSGSにSS7リンクセット[1]にSS7リンクを拡散することで満たすことができます。エンドポイント、および冗長ホスト。利用可能なホスト内のASPの分布も重要です。特定のアプリケーションサーバーの場合、関連するASPは少なくとも2つのホストに分布する場合があります。"
    },
    {
      "indent": 3,
      "text": "An example of logical network architecture relevant to carrier-grade operation in the IP network domain is shown in Figure 7 below:",
      "ja": "IPネットワークドメインのキャリアグレード操作に関連する論理ネットワークアーキテクチャの例を以下の図7に示します。"
    },
    {
      "indent": 3,
      "text": "     **************                              **************\n     *  ********__*______________________________*__********  * Host1\nSG1  *  * SGP1 *__*________________       _______*__* ASP1 *  *\n     *  ********  *                |     |       *  ********  *\n     *      .     *                |     |       *            *\n     *      .     *                |     |       **************\n     **************                |     |\n                                   |     |\n     **************                |     |\n     *  ********__*______________________|\nSG2  *  * SGP2 *__*________        |\n     *  ********  *        |       |\n     *      .     *        |       |\n     *      .     *        |       |\n     **************        |       |             **************\n                           |       |_____________*__********  * Host2\n                           |_____________________*__* ASP2 *  *\n            .                                    *  ********  *\n            .            SCTP Associations       *            *\n            .                                    **************\n                                                         .\n                                                         .\n                                                         .",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 21,
      "text": "Figure 7: Logical Model Example",
      "ja": "図7：論理モデルの例"
    },
    {
      "indent": 3,
      "text": "To avoid a single point of failure, it is recommended that a minimum of two ASPs be configured in an AS list, resident in separate hosts and, therefore, available over different SCTP associations. For example, in the network shown in Figure 7, all messages for the Interface Identifiers could be sent to ASP1 in Host1 or ASP2 in Host2. The AS list at SGP1 might look like the following:",
      "ja": "単一の障害点を回避するには、ASリストで最低2つのASPを構成することをお勧めします。たとえば、図7に示すネットワークでは、インターフェイス識別子のすべてのメッセージをHost1のASP1またはHOST2のASP2に送信できます。SGP1のASリストは、次のように見えるかもしれません。"
    },
    {
      "indent": 9,
      "text": "Interface Identifiers - Application Server #1\n    ASP1/Host1  - State = Active\n    ASP2/Host2  - State = Inactive",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In this 1+1 redundancy case, ASP1 in Host1 would be sent any incoming message for the Interface Identifiers registered. ASP2 in Host2 would normally be brought to the active state upon failure of ASP1/Host1. In this example, both ASPs are Inactive or Active, meaning that the related SCTP association and far-end M2UA peer is ready.",
      "ja": "この1 1冗長性の場合、HOST1のASP1は、登録されているインターフェイス識別子の着信メッセージが送信されます。Host2のASP2は、通常、ASP1/host1の故障とともにアクティブ状態に持ち込まれます。この例では、両方のASPは非アクティブまたはアクティブです。つまり、関連するSCTP関連とファーエンドM2UAピアの準備ができていることを意味します。"
    },
    {
      "indent": 3,
      "text": "For carrier grade networks, Operators should ensure that under failure or isolation of a particular ASP, stable calls or transactions are not lost. This implies that ASPs need, in some cases, to share the call/-transaction state or be able to pass the call/transaction state between each other. Also, in the case of ASPs performing call processing, coordination MAY be required with the related Media Gateway to transfer the MGC control for a particular trunk termination. However, this sharing or communication is outside the scope of this document.",
      "ja": "キャリアグレードのネットワークの場合、オペレーターは特定のASPの障害または分離の下で、安定した呼び出しまたは取引が失われないようにする必要があります。これは、ASPが、場合によっては、呼び出し/トランザクションの状態を共有するか、互いにコール/トランザクションの状態を渡すことができることを意味します。また、ASPがコール処理を実行している場合、特定のトランク終了のためにMGCコントロールを転送するために、関連するメディアゲートウェイの調整が必要になる場合があります。ただし、この共有または通信は、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "11.0 Authors' Addresses",
      "section_title": true,
      "ja": "11.0 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ken Morneault Cisco Systems Inc. 13615 Dulles Technology Drive Herndon, VA. 20171 USA",
      "ja": "Ken Morneault Cisco Systems Inc. 13615 Dulles Technology Drive Herndon、VA。20171 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-703-484-3323\nEMail: kmorneau@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Ram Dantu, Ph.D. NetRake Corporation 3000 Technology Drive Plano, TX 75074 USA",
      "ja": "Ram Dantu、Ph.D。Netrake Corporation 3000 Technology Drive Plano、TX 75074 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-214-291-1111\nEMail: rdantu@netrake.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Greg Sidebottom Signatus Technologies Kanata, Ontario, Canada",
      "ja": "カナダ、オンタリオ州カナタのグレッグサイドボトムシグナタステクノロジーズ"
    },
    {
      "indent": 3,
      "text": "EMail: greg@signatustechnologies.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Brian Bidulock OpenSS7 Corporation 1469 Jeffreys Crescent Edmonton, AB T6L 6T1 Canada",
      "ja": "ブライアン・ビドロックOpensS7 Corporation 1469 Jeffreys Crescent Edmonton、AB T6L 6T1 Canada"
    },
    {
      "indent": 3,
      "text": "Phone: +1-780-490-1141 EMail: bidulock@openss7.org Jacob Heitz Lucent Technologies 1701 Harbor Bay Parkway Alameda, CA, 94502 USA",
      "ja": "電話：1-780-490-1141メール：Bidulock@openss7.org Jacob Heitz Lucent Technologies 1701 Harbor Bay Parkway Alameda、CA、94502 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-510-747-2917\nEMail: jheitz@lucent.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があり、それについてコメントまたは説明する派生作品、またはその実装を支援することができます。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}