{
  "title": {
    "text": "RFC 3044 - Using The ISSN (International Serial Standard Number) as URN (Uniform Resource Names) within an ISSN-URN Namespace",
    "ja": "RFC 3044 - ISSN-urnネームスペース内でISSN（国際シリアル標準番号）をURN（ユニフォームリソース名）として使用する"
  },
  "number": 3044,
  "created_at": "2023-12-27 09:17:56.430130+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       S. Rozenfeld\nRequest for Comments: 3044                     ISSN International Centre\nCategory: Informational                                     January 2001",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Using The ISSN (International Serial Standard Number) as URN (Uniform Resource Names) within an ISSN-URN Namespace",
      "ja": "ISSN-urnネームスペース内でISSN（国際シリアル標準番号）をURN（ユニフォームリソース名）として使用する"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document presents how the ISSN - International Standard Serial Number - which is a persistent number for unique identification of serials widely recognised and used in the bibliographic world, can be supported within the Uniform Resource Name (URN) framework as a specific URN namespace identifier.",
      "ja": "このドキュメントでは、ISSN-国際標準シリアル番号 - これは、書誌世界で広く認識および使用されているシリアルの一意の識別のための永続的な数字であり、特定のURN名空間識別子としてユニフォームリソース名（URN）フレームワーク内でサポートされる方法を示しています。"
    },
    {
      "indent": 3,
      "text": "An ISSN URN resolution system using the ISSN identifier as Uniform resource Name within an ISN URN Namespace has been developed by the ISSN International Centre (ISSN-IC) and is operating as a demonstrator to evaluate all requirements to deploy it in an operational environment.",
      "ja": "ISN識別子をISN urnネームスペース内の統一リソース名として使用するISSN URN解像度システムは、ISSN International Center（ISSN-IC）によって開発されており、運用環境にすべての要件を展開するためのすべての要件を評価するためのデモンストレーターとして動作しています。"
    },
    {
      "indent": 3,
      "text": "This proceeds from concepts and proposals developed in several IETF RFCs emphasising the way to implement and to use \"recognised\" existing numbering system within the URN framework (RFC 2248, RFC 2141, RFC 2611).",
      "ja": "これは、URNフレームワーク内で「認識された」既存の番号付けシステムを実装および使用する方法を強調するいくつかのIETF RFCで開発された概念と提案から進みます（RFC 2248、RFC 2141、RFC 2611）。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ..................................................  2\n2. The ISSN system ...............................................  3\n  2.1 The ISSN code ..............................................  3\n  2.2  Construction of ISSN ......................................  3\n  2.3 The ISSN Bibliographic record ..............................  4\n  2.4 The ISSN Network ...........................................  4\n  2.5 The ISSN Register ..........................................  5\n3. The ISSN and URN ..............................................  5\n  3.1 compatibility ..............................................  5\n  3.2 identification and access ..................................  7\n4  Resolution ....................................................  7\n  4.1 Overview of the ISSN URN Resolution system .................  8\n  4.2 Global Resolution ..........................................  9\n5. Registration of an ISSN URN Namespace ......................... 10\n6. Security Considersations ...................................... 13\n7. References .................................................... 13\n8. Contact information and useful links .......................... 14\n9. Full Copyright Statement ...................................... 15",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The ISSN International Centre has undertaken in 1999-2000 an URN implementation taking advantage of the functional compatibility between the ISSN and the URN.",
      "ja": "ISSN International Centerは、1999年から2000年に、ISSNとURNの間の機能的互換性を利用して、URN実装を実施しました。"
    },
    {
      "indent": 3,
      "text": "The present implementation at the ISSN-IC Centre based on IETF RFCs on URN includes a centralised resolution system which allows direct access to electronic resources by using the ISSN identifiers as Uniform Resource Names within an ISSN URN Namespace.",
      "ja": "URN上のIETF RFCSに基づくISSN-ICセンターでの現在の実装には、ISSN識別子をISSN URNネームスペース内のユニフォームリソース名として使用することにより、電子リソースに直接アクセスできる集中解像度システムが含まれています。"
    },
    {
      "indent": 3,
      "text": "It demonstrates that the URN can integrate existing identifiers from well established identification schemes used by the bibliographic community.",
      "ja": "これは、urnが、書誌コミュニティが使用する十分に確立された識別スキームから既存の識別子を統合できることを示しています。"
    },
    {
      "indent": 3,
      "text": "Nevertheless, to deploy this demonstrator into a wider operational system a responsible body or infrastructure is needed to assign namespaces and manage an RDS/NAPTR global resolution framework. It is intended here that serials refer to all forms of serials published in printed form as well as in form of electronic resources. Since this document contains a Registration form for an ISSN URN Namespace, this form also includes some paragraphs already present in other parts of this document.",
      "ja": "それにもかかわらず、このデモンストレーターをより広い運用システムに展開するには、名前空間を割り当ててRDS/NAPTRグローバル解像度フレームワークを管理するために、責任あるボディまたはインフラストラクチャが必要です。ここでは、シリアルは、印刷された形式および電子リソースの形式で公開されたあらゆる形式のシリアルを指すことを意図しています。このドキュメントにはISSN URNネームスペースの登録フォームが含まれているため、このフォームには、このドキュメントの他の部分に既に存在するいくつかの段落も含まれています。"
    },
    {
      "indent": 3,
      "text": "All figures and descriptions are dated 13 July 2000.",
      "ja": "すべての数字と説明の日付は2000年7月13日です。"
    },
    {
      "indent": 0,
      "text": "2. The ISSN system",
      "section_title": true,
      "ja": "2. ISSNシステム"
    },
    {
      "indent": 3,
      "text": "The ISSN system results from a joint UNESCO and ICSU-AB working group on bibliographic descriptions set up in 1967 in order to establish a world registry of serial titles currently issued, stored or archived.",
      "ja": "ISSNシステムは、現在発行、保存、またはアーカイブされているシリアルタイトルの世界登録を確立するために、1967年に設定された書誌記述に関するユネスコとICSU-ABの共同ワーキンググループに起因します。"
    },
    {
      "indent": 3,
      "text": "Today, the ISSN system which is defined by an International standard (ISO 3297), relies on two main data elements:",
      "ja": "今日、国際標準（ISO 3297）によって定義されているISSNシステムは、2つの主要なデータ要素に依存しています。"
    },
    {
      "indent": 3,
      "text": "The International Standard Serial Number which is a unique identifier for a specific serial publication.",
      "ja": "特定のシリアル出版物の一意の識別子である国際標準シリアル番号。"
    },
    {
      "indent": 3,
      "text": "The key-title, which is a unique name assigned to a serial, and is inseparably linked with its ISSN.",
      "ja": "キータイトルは、シリアルに割り当てられた一意の名前であり、ISSNと不可分にリンクされています。"
    },
    {
      "indent": 3,
      "text": "And on a well established framework: the ISSN International network.",
      "ja": "そして、確立された枠組みについて：ISSN International Network。"
    },
    {
      "indent": 0,
      "text": "2.1 The ISSN code",
      "section_title": true,
      "ja": "2.1 ISSNコード"
    },
    {
      "indent": 3,
      "text": "The ISSN - International Standard Serials Number is defined in the ISO standard 3297:1998 as a code for the unique identification of serials.",
      "ja": "ISSN -International Standard Serials Numberは、ISO Standard 3297：1998で、シリアルの一意の識別のためのコードとして定義されています。"
    },
    {
      "indent": 3,
      "text": "This standard states that:",
      "ja": "この基準は次のように述べています。"
    },
    {
      "indent": 3,
      "text": "Each ISSN is a unique identifier for a specific serial publication. ISSN are applicable to the entire population of serials, whether past, present or to be published in the foreseeable future, whatever the medium of publication.",
      "ja": "各ISSNは、特定のシリアル出版物のユニークな識別子です。ISSNは、出版物の媒体が何であれ、過去、現在、または予見可能な将来に公開されるかどうかにかかわらず、シリアルの全集団に適用されます。"
    },
    {
      "indent": 3,
      "text": "Serials include periodicals, newspapers, annuals (such as reports, yearbooks, directories, etc.), and the journals, series, memoirs, proceedings, transactions, etc., of societies.",
      "ja": "シリアルには、定期刊行物、新聞、年次（レポート、年鑑、ディレクトリなど）、および社会のジャーナル、シリーズ、回顧録、手続き、取引などが含まれます。"
    },
    {
      "indent": 3,
      "text": "Today, ISSN are assigned to data bases and electronic serial resources. Further broadening of the scope to continuing resources is under discussion.",
      "ja": "今日、ISSNはデータベースと電子シリアルリソースに割り当てられています。継続的なリソースへの範囲のさらなる拡大が議論されています。"
    },
    {
      "indent": 0,
      "text": "2.2 Construction of ISSN",
      "section_title": true,
      "ja": "2.2 ISSNの建設"
    },
    {
      "indent": 3,
      "text": "The ISO 3297 standard states that:",
      "ja": "ISO 3297標準は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "An ISSN consists of eight digits in arabic numerals 0 to 9, except the last digit which is a check digit and can be sometimes an X. The ISSN has no internal meaningful elements to identify language, country, publisher [or medium.] The check digit is always located in the extreme right position and is calculated on a modulus 11 basis with weights 8 to 2, using X in lieu of 10 where 10 would occur as a check digit.",
      "ja": "ISSNは、チェックディジットで時々Xであることがある最後の数字を除き、アラビア語の数字0から9の8桁で構成されています。ISSNには、言語、国、出版社[または中程度]を識別するための内部意味の要素がありません。数字は常に極端な位置に位置し、10から2の重みで弾性11ベースで計算されます。10の代わりにxを使用して、10桁として10が発生します。"
    },
    {
      "indent": 3,
      "text": "Each ISSN is inseparably linked a \"the key title\". The Key title is a form of the title which is constructed in order to avoid duplicates so that each key title is unique in the ISSN Data base also named the ISSN Register. ISSN and key titles are equivalent, they both identify without ambiguity a same serial.",
      "ja": "各ISSNは、「キータイトル」と不可分にリンクされています。キータイトルは、重複を避けるために構築されたタイトルの形式であり、各キータイトルがISSNレジスタとも呼ばれるISSNデータベースでユニークになるようにします。ISSNとキータイトルは同等であり、どちらもあいまいさなしで同じシリアルを特定します。"
    },
    {
      "indent": 3,
      "text": "When printed or displayed the ISSN is preceded by the ISSN prefix and a space, and shall appear as two groups of four digits separated by a hyphen.",
      "ja": "印刷または表示すると、ISSNの前にISSNプレフィックスとスペースがあり、ハイフンで区切られた4桁の2つのグループとして表示されます。"
    },
    {
      "indent": 3,
      "text": "examples ISSN 0000-0019 ISSN 1560-1560",
      "ja": "例ISSN 0000-0019 ISSN 1560-1560"
    },
    {
      "indent": 3,
      "text": "ISSN are constructed and distributed by the ISSN International Centre to National Centres for assignment.",
      "ja": "ISSNは、ISSNインターナショナルセンターによって国立任務センターに建設および配布されています。"
    },
    {
      "indent": 0,
      "text": "2.3 The ISSN Bibliographic record",
      "section_title": true,
      "ja": "2.3 ISSN書誌レコード"
    },
    {
      "indent": 3,
      "text": "It contains in addition to the ISSN and key-title some thirty bibliographic data elements enabling the unambiguous and secure identification of a serial.",
      "ja": "ISSNに加えて、キータイトルに加えて、30の書誌データ要素をキーにして、シリアルの明確で安全な識別を可能にします。"
    },
    {
      "indent": 3,
      "text": "One characteristic of an ISSN bibliographic record is that it contains other ISSN in linking fields in order to establish relationships between the given serial and a set of other related serials already identified.",
      "ja": "ISSNの書誌記録の1つの特徴は、特定のシリアルと既に特定された他の関連シリアルのセットとの関係を確立するために、リンクフィールドに他のISSNが含まれていることです。"
    },
    {
      "indent": 3,
      "text": "To recognise and to allow access to serial resources in digital form, the ISSN format has included additional data elements:",
      "ja": "ISSN形式には、デジタル形式のシリアルリソースへのアクセスを認識し、アクセスできるようにするために、追加のデータ要素が含まれています。"
    },
    {
      "indent": 3,
      "text": "- A medium code which indicates the medium of the given serial - A linking field to express relations between the different forms of \"equivalent\" serials on different media (from printed version to online as well as from online to printed) - The location of an electronic resource: the URLs of a given resource.",
      "ja": "- 指定されたシリアルの媒体を示す中程度のコード - さまざまなメディア（印刷版からオンライン、オンラインから印刷まで）の異なる形式の「同等の」シリアルの関係を表すためのリンクフィールド - 電子の場所リソース：特定のリソースのURL。"
    },
    {
      "indent": 0,
      "text": "2.4 The ISSN network",
      "section_title": true,
      "ja": "2.4 ISSNネットワーク"
    },
    {
      "indent": 3,
      "text": "It is the operational structure, main functions of which are:",
      "ja": "それは運用構造であり、その主な機能は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- collecting the material which needs to be identified - assigning the ISSN and the key title to a serial for unambiguous identification - creating and editing bibliographic records in ISSN format",
      "ja": "- 識別する必要がある資料の収集 -  ISSNとキータイトルを明確な識別のためのシリアルに割り当てる -  ISSN形式で書誌レコードの作成と編集"
    },
    {
      "indent": 3,
      "text": "- making available the bibliographic records",
      "ja": "- 書誌レコードを利用可能にします"
    },
    {
      "indent": 3,
      "text": "It consists of:",
      "ja": "それは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- National Centres - 69 centres - responsible for the identification of serials published in their respective countries. Records created by National Centres are transmitted to the ISSN-IC for validation and update of the ISSN Register.",
      "ja": "- ナショナルセンター-69センター - それぞれの国で公開されたシリアルの識別を担当しています。National Centersによって作成された記録は、ISSNレジスタの検証と更新のためにISSN-ICに送信されます。"
    },
    {
      "indent": 3,
      "text": "- The International Centre which co-ordinates the network and acts as a National Centre for serials published by International institutions and by countries with no National Centre. It collects and checks all bibliographic records to update in a consistent way the ISSN Register.",
      "ja": "- ネットワークを調整し、国際機関や国立センターのない国によって発行された連続国立センターとして機能する国際センター。すべての書誌レコードを収集およびチェックして、ISSNレジスタを一貫した方法で更新します。"
    },
    {
      "indent": 6,
      "text": "It maintains the ISSN Register and makes it available.",
      "ja": "ISSNレジスタを維持し、利用可能にします。"
    },
    {
      "indent": 0,
      "text": "2.5 The ISSN Register",
      "section_title": true,
      "ja": "2.5 ISSNレジスタ"
    },
    {
      "indent": 3,
      "text": "It is a data base controlled and maintained by the ISSN-IC. It consists in 970 000 bibliographic records stored in ISSN-MARC format (a subset of USMARC format ) which are available on different media (CD-ROM, DAT, and on the Internet).",
      "ja": "ISSN-ICによって制御および維持されているデータベースです。これは、ISSN-MARC形式（USMARC形式のサブセット）に保存されている970 000の書誌レコードで構成されており、異なるメディア（CD-ROM、DAT、およびインターネット）で利用できます。"
    },
    {
      "indent": 0,
      "text": "3. THE ISSN AND URN",
      "section_title": true,
      "ja": "3. ISSNとurn"
    },
    {
      "indent": 0,
      "text": "3.1 ISSN compliance with URN requirements",
      "section_title": true,
      "ja": "3.1 URN要件へのISSNコンプライアンス"
    },
    {
      "indent": 3,
      "text": "The different specifications and requirements on URNs have been studied from the following documents:",
      "ja": "URNのさまざまな仕様と要件は、次のドキュメントから研究されています。"
    },
    {
      "indent": 3,
      "text": "URN Syntax (RFC 2141, May 1997 - R. Moats)",
      "ja": "URN構文（RFC 2141、1997年5月-R。Moats）"
    },
    {
      "indent": 3,
      "text": "Using Existing Bibliographic Identifiers as Uniform Resource Names (RFC 2288 February 1998 - C. Lynch, R. Daniel)",
      "ja": "既存の書誌識別子をユニフォームリソース名として使用する（RFC 2288 1998年2月-C。リンチ、R。ダニエル）"
    },
    {
      "indent": 3,
      "text": "Functional Requirements for Uniform Resource Names (RFC 1737, December 1994 - K. Sollins, L. Masinter)",
      "ja": "ユニフォームリソース名の機能要件（RFC 1737、1994年12月-K。ソリンズ、L。"
    },
    {
      "indent": 3,
      "text": "URN Namespace Definition Mechanisms (RFC 2611, June 1999 - L. Daigle, R. Iannella)",
      "ja": "urnネームスペース定義メカニズム（RFC 2611、1999年6月-L。Daigle、R。Iannella）"
    },
    {
      "indent": 3,
      "text": "A URN Namespace for IETF Documents (RFC 2648, August 1999 - R. Moats)",
      "ja": "IETFドキュメント用のurnネームスペース（RFC 2648、1999年8月 -  R.モート）"
    },
    {
      "indent": 3,
      "text": "Requirements for URNs' functional capabilities (from RFC 1737) Global scope: A URN is a name with global scope which does not imply a location. It has the same meaning everywhere.",
      "ja": "urnsの機能能力の要件（RFC 1737から）グローバル範囲：urnは、場所を意味しないグローバル範囲の名前です。どこでも同じ意味を持っています。"
    },
    {
      "indent": 3,
      "text": "- Applicable for ISSN. Accordingly to ISO standard 3297 there is no limitations for serial resource identification.",
      "ja": "- ISSNに適用されます。したがって、ISO Standard 3297には、シリアルリソース識別に制限はありません。"
    },
    {
      "indent": 3,
      "text": "Global uniqueness: The same URN will never be assigned to two different resources.",
      "ja": "グローバルな一意性：同じurnが2つの異なるリソースに割り当てられることはありません。"
    },
    {
      "indent": 3,
      "text": "- Applicable for ISSN. By definition an ISSN is assigned to one and only one serial resource. Once assigned, an ISSN is never re-assigned.",
      "ja": "- ISSNに適用されます。定義により、ISSNは1つのシリアルリソースに1つだけに割り当てられます。割り当てられたら、ISSNが再割り当てされることはありません。"
    },
    {
      "indent": 3,
      "text": "Persistence: The lifetime of a URN is permanent.",
      "ja": "持続性：urの寿命は永続的です。"
    },
    {
      "indent": 3,
      "text": "- Applicable for ISSN. All ISSN are registered in the ISSN Register data base which covers current serial resources as well as ceased.",
      "ja": "- ISSNに適用されます。すべてのISSNは、現在のシリアルリソースをカバーし、停止するISSNレジスタデータベースに登録されています。"
    },
    {
      "indent": 3,
      "text": "Scalability: URNs can be assigned to any resource that might conceivably be available on the network, for hundreds of years.",
      "ja": "スケーラビリティ：URNは、何百年もの間、ネットワークで利用可能になる可能性のあるリソースに割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "- Applicable for ISSN. More than 98500000 ISSN have yet been assigned.",
      "ja": "- ISSNに適用されます。98500000を超えるISSNはまだ割り当てられています。"
    },
    {
      "indent": 3,
      "text": "Legacy support: The scheme must permit the support of existing legacy naming systems.",
      "ja": "レガシーサポート：スキームは、既存のレガシーネーミングシステムのサポートを許可する必要があります。"
    },
    {
      "indent": 3,
      "text": "- Applicable for ISSN. By definition the ISSN system is a legacy identification system for serial resources.",
      "ja": "- ISSNに適用されます。定義上、ISSNシステムは、シリアルリソースのレガシー識別システムです。"
    },
    {
      "indent": 3,
      "text": "Independence: It is solely the responsibility of a name issuing authority to determine the conditions under which it will issue a name.",
      "ja": "独立：それは、名前を発行する条件を決定する名前の発行機関の責任のみです。"
    },
    {
      "indent": 3,
      "text": "- Applicable for ISSN. By definition of the ISSN system.",
      "ja": "- ISSNに適用されます。ISSNシステムの定義により。"
    },
    {
      "indent": 3,
      "text": "Resolution: For URNs that have corresponding URLs, there must be some feasible mechanism to translate a URN to a URL.",
      "ja": "解像度：対応するURLを持つurnの場合、URNをURLに変換するための実行可能なメカニズムが必要です。"
    },
    {
      "indent": 3,
      "text": "- Applicable for ISSN. The ISSN-IC has developed an ISSN URN resolver which translates one given ISSN into one or several URLs.",
      "ja": "- ISSNに適用されます。ISSN-ICは、ISSNを1つまたは複数のURLに変換するISSN URNリゾルバーを開発しました。"
    },
    {
      "indent": 3,
      "text": "In addition to these basic requirements on the functional elements of the URNs, there are other requirements for how they are encoded in a string:",
      "ja": "urの機能要素に関するこれらの基本的な要件に加えて、それらが文字列でエンコードされる方法には他の要件があります。"
    },
    {
      "indent": 3,
      "text": "Single encoding, Simple comparison, Simple human transcribability, Transport friendliness, Machine consumption, Text recognition.",
      "ja": "単一のエンコーディング、シンプルな比較、単純な人間の転写性、輸送の親しみやすさ、機械消費、テキスト認識。"
    },
    {
      "indent": 3,
      "text": "- Applicable to ISSN. As defined in the ISO standard the ISSN is a very simple and short character string which fully responds to those requirements.",
      "ja": "- ISSNに適用されます。ISO標準で定義されているように、ISSNは非常にシンプルで短い文字列であり、それらの要件に完全に応答します。"
    },
    {
      "indent": 3,
      "text": "Considering the aim of the ISSN, its framework and new developments for electronic serial resources identification, we can state that the ISSN fulfills all expressed URN requirements.",
      "ja": "ISSNの目的、そのフレームワーク、電子シリアルリソースの識別のための新しい開発を考慮すると、ISSNはすべての表明されたURN要件を満たしていると述べることができます。"
    },
    {
      "indent": 3,
      "text": "Syntax requirements",
      "ja": "構文要件"
    },
    {
      "indent": 3,
      "text": "Considering syntax requirements (RFC2141) for an URN namespace and the URN syntax, an ISSN based URN namespace is compliant with such requirements since it does not use any reserved characters.",
      "ja": "URNネームスペースとURN構文の構文要件（RFC2141）を考慮すると、ISSNベースのURNネームスペースは、予約された文字を使用しないため、そのような要件に準拠しています。"
    },
    {
      "indent": 3,
      "text": "In RFC 2288 (4.2 Encoding Considerations and Lexical Equivalence) it is stated that:",
      "ja": "RFC 2288（4.2に関する考慮事項と語彙の等価性のエンコード）では、次のように述べられています。"
    },
    {
      "indent": 3,
      "text": "There is no problem representing ISSN in the namespace - specific string of URNs since all characters valid in the ISSN are valid in the namespace-specific URN string, and %-encoding is never required.",
      "ja": "ISSNで有効なすべての文字が名前空間固有のURN文字列で有効であり、％エンコードは決して不要であるため、名前空間でISSNを表す問題はありません。"
    },
    {
      "indent": 3,
      "text": "Example: urn:ISSN:1046-8188",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Supplementary comparison rules are also appropriate for the ISSN namespace, hyphens should be dropped prior to comparison and occurrences of 'x' normalised to uppercase.",
      "ja": "補足的な比較ルールは、ISSNの名前空間にも適しています。比較と大文字に正規化された「X」の発生の前にハイフンをドロップする必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2 Identification and access",
      "section_title": true,
      "ja": "3.2 識別とアクセス"
    },
    {
      "indent": 3,
      "text": "The role of an URN is also to provide safe access to the characteristics of a resource and to the resource itself. One may view an ISSN bibliographic record as a metadata since it contains different data information on the resource which is to be identified, described, located and/or accessed.",
      "ja": "URNの役割は、リソースの特性とリソース自体への安全なアクセスを提供することでもあります。ISSN書誌レコードは、特定、説明、配置、および/またはアクセスするリソース上のさまざまなデータ情報が含まれているため、メタデータと見なすことがあります。"
    },
    {
      "indent": 3,
      "text": "The ISSN is widely used as an identification number for serial resources. Since the ISSN Network provides the URLs corresponding to the identified resources the ISSN is now also a tool for the location and access to resources on the Internet. This is achieved by an ISSN URN resolution system.",
      "ja": "ISSNは、シリアルリソースの識別番号として広く使用されています。ISSNネットワークは特定されたリソースに対応するURLを提供するため、ISSNはインターネット上のリソースへの場所とアクセスのためのツールでもあります。これは、ISSN URN解像度システムによって達成されます。"
    },
    {
      "indent": 0,
      "text": "4. RESOLUTION",
      "section_title": true,
      "ja": "4. 解決"
    },
    {
      "indent": 3,
      "text": "The different specifications and requirements on URN resolution have been studied from the following documents:",
      "ja": "URN解像度に関するさまざまな仕様と要件は、次のドキュメントから研究されています。"
    },
    {
      "indent": 3,
      "text": "URI Resolution Services Necessary for URN Resolution (RFC 2483, January 1999 - M. Mealling) Resolution of Uniform Resource Identifiers using the Domain Name System (RFC 2168 June 1997 - R. Daniel, M. Mealling )",
      "ja": "URI解像度サービス（RFC 2483、1999年1月-M. Mealling）ドメイン名システムを使用した均一なリソース識別子の解像度（RFC 2168 1997年6月-R。ダニエル、M。ミールリング）"
    },
    {
      "indent": 3,
      "text": "Architectural Principles of Uniform Resource Name Resolution (RFC 2276, January 1998 - K. Sollins )",
      "ja": "均一なリソース名の解決の建築原理（RFC 2276、1998年1月-K.ソリンズ）"
    },
    {
      "indent": 0,
      "text": "4.1. Overview of the ISSN URN Resolution system",
      "section_title": true,
      "ja": "4.1. ISSN URN解像度システムの概要"
    },
    {
      "indent": 3,
      "text": "Using ISSN as Uniform Resource Name implies that some mapping mechanism is provided to ensure a reliable access to available resources when using Internet tools like a standard Web browser.",
      "ja": "ISSNを均一なリソース名として使用することは、標準のWebブラウザなどのインターネットツールを使用するときに利用可能なリソースへの信頼できるアクセスを確保するために、いくつかのマッピングメカニズムが提供されることを意味します。"
    },
    {
      "indent": 3,
      "text": "From the technical point of view this has led to develop within our system the different pieces of software and services required to fulfill such aim.",
      "ja": "技術的な観点から、これは私たちのシステム内で、そのような目的を達成するために必要なさまざまなソフトウェアとサービスの開発につながりました。"
    },
    {
      "indent": 3,
      "text": "The resolution software be able to translate a given ISSN-URN into electronic locations:",
      "ja": "解像度ソフトウェアは、特定のISSN-urnを電子位置に変換できるようにします。"
    },
    {
      "indent": 3,
      "text": "- location of the bibliographic description or metadata - location of the periodical itself (if it is in electronic form).",
      "ja": "- 書誌記述またはメタデータの位置 - 定期刊行物自体の場所（電子形式の場合）。"
    },
    {
      "indent": 3,
      "text": "These electronic locations are expressed in form of URLs for which persistence is not ensured. As a consequence the URLs which are stored for resolution have to be checked and updated to ensure relevant mapping with the corresponding URNs.",
      "ja": "これらの電子位置は、持続性が保証されていないURLの形で表されます。結果として、解像度のために保存されているURLは、対応するURNとの関連マッピングを確保するためにチェックおよび更新する必要があります。"
    },
    {
      "indent": 3,
      "text": "The URLs which are stored in the database must be checked regularly for accuracy and if changes occur they have to be reported in the ISSN-URN resolver database.",
      "ja": "データベースに保存されているURLは、正確性を定期的にチェックする必要があり、変更が発生した場合は、ISSN-hurn Resolverデータベースで報告する必要があります。"
    },
    {
      "indent": 3,
      "text": "The browser has to include the URN facility which allows to express the location of a given resource in form of an ISSN, this means that if the standard browsers do not include the URN option a \"plug-in\" is to be developed.",
      "ja": "ブラウザには、特定のリソースの場所をISSNの形で表現できるURN機能を含める必要があります。これは、標準のブラウザにURNオプションが含まれていない場合、「プラグイン」を開発することを意味します。"
    },
    {
      "indent": 3,
      "text": "Thus, four types of developments have been considered:",
      "ja": "したがって、4種類の開発が考慮されています。"
    },
    {
      "indent": 3,
      "text": "Design and implementation of a resolver:",
      "ja": "リゾルバーの設計と実装："
    },
    {
      "indent": 3,
      "text": "- In a first step a global centralised resolution system has been developed and implemented on one resolution server located at the ISSN International Centre.",
      "ja": "- 最初のステップでは、ISSN International Centerにある1つの解像度サーバーにグローバルな集中解像度システムが開発および実装されました。"
    },
    {
      "indent": 3,
      "text": "It ensures effective mapping between a given ISSN and one or several URL(s) which implies that \"multiple resolution\" is performed by design and implementation of an ISSN-URL mapping file.",
      "ja": "特定のISSNと1つまたは複数のURL間の効果的なマッピングが保証されます。これは、ISSN-URLマッピングファイルの設計と実装によって「複数の解像度」が実行されることを意味します。"
    },
    {
      "indent": 3,
      "text": "- Today, the principal method to map ISSN with URLs is to extract them from ISSN registered records and to store them in a separate file structured specially for the resolution process. Besides, other ways to get URLs for bibliographic resources identified by ISSN are tested. Management data as well as attributes are linked to URLs in order to recognise objects handled by the resolver.",
      "ja": "- 今日、ISSNをURLにマッピングする主要な方法は、ISSN登録レコードからそれらを抽出し、解像度プロセスのために特別に構成された別のファイルに保存することです。また、ISSNによって特定された書誌リソースのURLを取得する他の方法がテストされています。管理データと属性は、リゾルバーによって処理されるオブジェクトを認識するためにURLにリンクされています。"
    },
    {
      "indent": 3,
      "text": "Design and implementation of an URL checker:",
      "ja": "URLチェッカーの設計と実装："
    },
    {
      "indent": 3,
      "text": "- In order to control the persistence and the accessibility to ISSN-URN a robot called the \"URL Watcher\" has been written to control the status of all URLs stored in the ISSN-URL mapping file. Broken or redirected URLs are detected and stored to permit efficient resolution.",
      "ja": "- ISSN-hurnへの持続性とアクセシビリティを制御するために、「URLウォッチャー」と呼ばれるロボットが書かれており、ISSN-URLマッピングファイルに保存されているすべてのURLのステータスを制御しています。壊れたまたはリダイレクトされたURLは、効率的な解像度を可能にするために検出および保存されます。"
    },
    {
      "indent": 3,
      "text": "Design and implementation of a browser plug-in:",
      "ja": "ブラウザプラグインの設計と実装："
    },
    {
      "indent": 3,
      "text": "- The existing browsers do not include today the URN \"protocol\" functionality. One expect to have it implemented in a near future. A plug-in for Netscape communicator and MS-Explorer has been developed and is available.",
      "ja": "- 既存のブラウザには、今日のURN「プロトコル」機能は含まれていません。近い将来に実装することを期待しています。Netscape CommunicatorとMS-Explorer用のプラグインが開発されており、利用可能です。"
    },
    {
      "indent": 3,
      "text": "This enables to enter directly the ISSN preceded by the string \"urn:ISSN:\" in the browsers address box instead of typing the URL and as result to get displayed the bibliographic record or/and the online resource. Clicking on an ISSN on an HTML page gives the same result.",
      "ja": "これにより、文字列「urn：ISSN：」が先行するISSNを直接入力できます。これは、URLを入力する代わりにブラウザアドレスボックスに、その結果、書誌レコードまたはオンラインリソースを表示するために表示されます。HTMLページでISSNをクリックすると同じ結果が得られます。"
    },
    {
      "indent": 6,
      "text": "example: urn:ISSN:1560-1560",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4.2 Global resolution",
      "section_title": true,
      "ja": "4.2 グローバルな決議"
    },
    {
      "indent": 3,
      "text": "Since the ISSN system is not addressing a local environment (like a given Library) and is expected to be linked to other URNs (or other identification services) for identification of serial related resources having other levels of granularity, we have to consider an evolution of the present resolution implementation to a global resolution system.",
      "ja": "ISSNシステムはローカル環境（特定のライブラリのような）に対処しておらず、他のレベルの粒度を持つシリアル関連リソースの識別のために他のURN（または他の識別サービス）にリンクされることが期待されるため、の進化を考慮する必要があります。グローバル解像度システムへの現在の解像度の実装。"
    },
    {
      "indent": 3,
      "text": "Resolution and especially global resolution is considered as a major issue for becoming an ISSN URN Namespace.",
      "ja": "解像度、特にグローバルな解像度は、ISSNのurnネームスペースになるための主要な問題と見なされます。"
    },
    {
      "indent": 3,
      "text": "This is expressed in the following statement (from RFC 2611, \"URN Namespace Definition Mechanisms\"): Process for identifier resolution:",
      "ja": "これは、次のステートメントで表されています（RFC 2611、「urnネームスペース定義メカニズム」から）：識別子解像度のプロセス："
    },
    {
      "indent": 6,
      "text": "If a namespace is intended to be accessible for global resolution, it must be registered in an RDS (Resolution Discovery System, see [RFC2276]) such as NAPTR. Resolution then proceeds according to standard URI resolution processes, and the mechanisms of the RDS.",
      "ja": "名前空間がグローバル解像度のためにアクセスできることを意図している場合、NAPTRなどのRDS（解像度発見システム、[RFC2276]を参照）に登録する必要があります。解像度は、標準のURI解像度プロセスとRDSのメカニズムに従って進行します。"
    },
    {
      "indent": 3,
      "text": "Our present views and evaluations to be integrated in such RDS System for global resolution for an ISSN URN Namespace are mainly based on concepts and proposals from the following RFCs:",
      "ja": "ISSN URNネームスペースのグローバル解像度のためにこのようなRDSシステムに統合される私たちの現在の見解と評価は、主に次のRFCからの概念と提案に基づいています。"
    },
    {
      "indent": 3,
      "text": "RFC 2276 for RDS architecture for global resolution, RFC 2168 for the NAPTR DNS extension,",
      "ja": "Global ResolutionのRDSアーキテクチャ用のRFC 2276、NAPTR DNS拡張のRFC 2168、"
    },
    {
      "indent": 3,
      "text": "From a technical point of view our present resolution system is flexible enough to take place in a RDS/NAPTR resolution framework.",
      "ja": "技術的な観点からは、現在の解像度システムは、RDS/NAPTR解像度フレームワークで行われるほど柔軟です。"
    },
    {
      "indent": 0,
      "text": "5. Namespace registration",
      "section_title": true,
      "ja": "5. 名前空間登録"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "ja": "名前空間ID："
    },
    {
      "indent": 6,
      "text": "ISSN",
      "ja": "ISSN"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "ja": "登録情報："
    },
    {
      "indent": 6,
      "text": "Version 1 Date: 2000-08-28",
      "ja": "バージョン1日付：2000-08-28"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "ja": "名前空間の登録者を宣言する："
    },
    {
      "indent": 6,
      "text": "Name: S. ROZENFELD (Mr.)",
      "ja": "名前：S。Rozenfeld（Mr.）"
    },
    {
      "indent": 6,
      "text": "E-mail: rozenfeld@issn.org",
      "ja": "電子メール：rozenfeld@issn.org"
    },
    {
      "indent": 6,
      "text": "Affiliation: ISSN International Centre",
      "ja": "所属：ISSNインターナショナルセンター"
    },
    {
      "indent": 6,
      "text": "Address: 20, rue Bachaumont 75002 PARIS FRANCE",
      "ja": "住所：20、Rue Bachaumont 75002 Paris France"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure:",
      "ja": "構文構造の宣言："
    },
    {
      "indent": 3,
      "text": "In accordance with the ISO standard 3297 - Information and documentation International Standard Serial Number(ISSN)-(1998) The ISSN consists of eight digits in Arabic numerals 0 to 9, except the last digit which is a check digit and can sometimes be an X. The ISSN has no internal meaningful elements to identify language, country, publisher.",
      "ja": "ISO Standard 3297-情報とドキュメントに従って、国際標準シリアル番号（ISSN） - （1998）ISSNは、チェックディジットで時々Xになることができる最後の数字を除き、アラビア数字0から9の8桁で構成されています。 。ISSNには、言語、国、出版社を特定するための内部意味のある要素がありません。"
    },
    {
      "indent": 3,
      "text": "The check digit is always located in the extreme right position and is calculated on a modulus 11 basis with weights 8 to 2, using X in lieu of 10 where 10 would occur as a check digit.",
      "ja": "チェックディジットは常に極端な位置にあり、10から2の重みで係数11ベースで計算されます。10の代わりにxを使用して、10桁として10が発生します。"
    },
    {
      "indent": 3,
      "text": "Each ISSN is inseparably linked to the serials title \"the key title\" which is a constructed form of the title in order to avoid duplicates so that each key title is unique within the ISSN Data base. ISSN and key titles are equivalent, they both identify without ambiguity a same serial.",
      "ja": "各ISSNは、重複を避けるためにタイトルの構築された形式であるシリアルタイトル「キータイトル」に切り離されています。ISSNとキータイトルは同等であり、どちらもあいまいさなしで同じシリアルを特定します。"
    },
    {
      "indent": 3,
      "text": "When printed or displayed the ISSN is preceded by the ISSN prefix and a space, and shall appear as two groups of four digits separated by a hyphen",
      "ja": "印刷または表示されると、ISSNの前にISSNプレフィックスとスペースがあり、ハイフンで区切られた4桁の2つのグループとして表示されます"
    },
    {
      "indent": 6,
      "text": "Therefore the ISSN structure is as follows:",
      "ja": "したがって、ISSN構造は次のとおりです。"
    },
    {
      "indent": 9,
      "text": "NNNN-NNNC",
      "ja": "nnnnnnc"
    },
    {
      "indent": 10,
      "text": "where N is a Digit character [0..9] C is either a Digit character or letter \"X\" [0..9,X] C is the check character",
      "ja": "ここで、nは数字文字[0..9] cは数字文字または文字「x」[0..9、x] cはチェック文字です"
    },
    {
      "indent": 6,
      "text": "An ISSN URN Namespace structure is conformant to URN syntax requirements (RFC 2141).",
      "ja": "ISSN URNネームスペース構造は、URN構文要件（RFC 2141）に適合しています。"
    },
    {
      "indent": 9,
      "text": "examples urn:ISSN:0259-000X\n         urn:ISSN:1560-1560",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Relevant ancillary documentation:",
      "ja": "関連する補助文書："
    },
    {
      "indent": 9,
      "text": "ISO 3279 Information and documentation - International Standard Serial Number (ISSN)",
      "ja": "ISO 3279情報とドキュメント - 国際標準シリアル番号（ISSN）"
    },
    {
      "indent": 9,
      "text": "The ISSN: an identifier for serials in digital form. Compatibility with the URN framework. (ISSN International Centre - January 1999)",
      "ja": "ISSN：デジタル形式のシリアルの識別子。URNフレームワークとの互換性。（ISSNインターナショナルセンター -  1999年1月）"
    },
    {
      "indent": 9,
      "text": "The ISSN-URN project. (ISSN International Centre - October 1999)",
      "ja": "ISSN-urnプロジェクト。（ISSNインターナショナルセンター -  1999年10月）"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "ja": "識別子の一意性の考慮事項："
    },
    {
      "indent": 6,
      "text": "Uniqueness is guaranteed by ISSN definition.",
      "ja": "一意性は、ISSN定義によって保証されます。"
    },
    {
      "indent": 6,
      "text": "As defined in the ISO 3279 each ISSN is a \"unique\" identifier for a specific serial publication.",
      "ja": "ISO 3279で定義されているように、各ISSNは特定のシリアル出版物の「一意の」識別子です。"
    },
    {
      "indent": 6,
      "text": "A different ISSN is assigned to each publication issued on different media.",
      "ja": "別のISSNが異なるメディアで発行された各出版物に割り当てられます。"
    },
    {
      "indent": 6,
      "text": "An ISSN is never re-assigned.",
      "ja": "ISSNが再割り当てされることはありません。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "ja": "識別子の持続性の考慮事項："
    },
    {
      "indent": 6,
      "text": "Persistence of ISSN is guaranteed by the maintenance and update of the ISSN Register by the ISSN Centres. Even records for \"ceased\" publications still remain in the ISSN database, and links between serials belonging to a same \"family\" are expressed with related ISSN within the records. This linking mechanism extends the current Identifier persistence concept.",
      "ja": "ISSNの持続性は、ISSNセンターによるISSNレジスタのメンテナンスと更新によって保証されます。「停止した」出版物の記録でさえ、まだISSNデータベースに残っており、同じ「ファミリー」に属するシリアル間のリンクは、レコード内の関連するISSNで表現されています。このリンクメカニズムは、現在の識別子持続性の概念を拡張します。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "ja": "識別子割り当てのプロセス："
    },
    {
      "indent": 6,
      "text": "The ISSN network consisting in 68 National Centres and the International Centre:",
      "ja": "68の国立センターと国際センターで構成されるISSNネットワーク："
    },
    {
      "indent": 6,
      "text": "- collects the material to be identified - checks for identification all types of serials including electronic serial resources. - assigns an ISSN to each different periodical. - establish the bibliographic record. - makes available the data.",
      "ja": "- 識別される資料を収集します - 電子シリアルリソースを含むあらゆる種類のシリアルを識別するためのチェック。-ISSNを各異なる定期刊行物に割り当てます。 - 書誌記録を確立します。 - データを利用可能にします。"
    },
    {
      "indent": 6,
      "text": "The data consisting in bibliographic records is centralised at the ISSN International Centre for global uniqueness checking. A given ISSN refers to one and only one form of the title, he key-title which is a key element of the bibliographic record as well as the ISSN.",
      "ja": "書誌記録で構成されるデータは、ISSNインターナショナルセンターフォーグローバルユニークネスチェックに集中しています。特定のISSNは、1つの1つの形式のタイトルを指します。彼は、書誌レコードの重要な要素であり、ISSNです。"
    },
    {
      "indent": 6,
      "text": "Today, the ISSN database contains more than 950 000 bibliographic records and a special attention is given to electronic publication resources and related metadata, and the way to access them.",
      "ja": "今日、ISSNデータベースには950 000以上の書誌記録が含まれており、電子出版リソースと関連するメタデータに特別な注意が払われています。"
    },
    {
      "indent": 3,
      "text": "Process for identifier resolution:",
      "ja": "識別子解像度のプロセス："
    },
    {
      "indent": 6,
      "text": "As a first step the ISSN International Centre has developed a centralised ISSN-URN resolver with multiple resolution capabilities which runs as a demonstrator.",
      "ja": "ISSN International Centerは、最初のステップとして、デモンストレーターとして実行される複数の解像度機能を備えた集中化されたISSN-HURNリゾルバーを開発しました。"
    },
    {
      "indent": 6,
      "text": "In a second step we expect the ISSN Namespace to be accessible for global resolution and to provide a set of resolution services compliant with the RDS/NAPTR proposals.",
      "ja": "2番目のステップでは、ISSNネームスペースにグローバルな解像度のためにアクセスし、RDS/NAPTR提案に準拠した一連の解像度サービスを提供することが期待されます。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "ja": "語彙の等価性のルール："
    },
    {
      "indent": 6,
      "text": "The check digit if 'X' is case-sensitive. Thus, if \"x\" is found it must be translated in upper case.",
      "ja": "「x」が症例に敏感な場合、チェックディジット。したがって、「x」が見つかった場合は、大文字で翻訳する必要があります。"
    },
    {
      "indent": 6,
      "text": "The hyphen between the 4th and the 5th digit can be omitted",
      "ja": "4桁目と5桁目の間のハイフンは省略できます"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "ja": "urn構文への適合："
    },
    {
      "indent": 6,
      "text": "There are no characters reserved.",
      "ja": "予約されているキャラクターはありません。"
    },
    {
      "indent": 0,
      "text": "Security Considerations",
      "ja": "セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Because this namespace defines no additional reserved characters it does not add any security consideration.",
      "ja": "この名前空間は追加の予約された文字を定義しないため、セキュリティに関する考慮事項は追加されません。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "ja": "検証メカニズム："
    },
    {
      "indent": 6,
      "text": "None specified today.",
      "ja": "今日は指定されていません。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "ja": "範囲："
    },
    {
      "indent": 6,
      "text": "Global.",
      "ja": "グローバル。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Security issues are discussed in section 5.",
      "ja": "セキュリティの問題については、セクション5で説明します。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 3,
      "text": "[1] ISO 3279 Information and documentation - International Standard Serial Number (ISSN)",
      "ja": "[1] ISO 3279情報とドキュメント - 国際標準シリアル番号（ISSN）"
    },
    {
      "indent": 3,
      "text": "[2] The ISDS Manual - ISSN International Centre (Paris, 1983) (under revision)",
      "ja": "[2] ISDSマニュアル-ISSNインターナショナルセンター（パリ、1983）（改訂中）"
    },
    {
      "indent": 3,
      "text": "[3] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "ja": "[3] Moats、R。、「urn構文」、RFC 2141、1997年5月。"
    },
    {
      "indent": 3,
      "text": "[4] Sollins, K. and L. Masinter, \"Functional Requirements for Uniform Resource Names\", RFC 1737, December 1994.",
      "ja": "[4] Sollins、K。およびL. Masinter、「制服名の機能要件」、RFC 1737、1994年12月。"
    },
    {
      "indent": 3,
      "text": "[5] Lynch, C., Preston, C. and R. Daniel, \"Using Existing Bibliographic Identifiers as Uniform Resource Names\", RFC 2288, February 1998.",
      "ja": "[5] Lynch、C.、Preston、C。、およびR. Daniel、「既存の書誌識別子をユニフォームリソース名として使用する」、RFC 2288、1998年2月。"
    },
    {
      "indent": 3,
      "text": "[6] Daniel, R. and M. Mealling, \"Resolution of Uniform Resource Identifiers using the Domain Name System\", RFC 2168, June 1997.",
      "ja": "[6] Daniel、R。およびM. Mealling、「ドメイン名システムを使用した均一なリソース識別子の解像度」、RFC 2168、1997年6月。"
    },
    {
      "indent": 3,
      "text": "[7] Sollins, D., \"Architectural Principles of Uniform Resource Name Resolution\", RFC 2276, January 1998.",
      "ja": "[7] Sollins、D。、「均一なリソース名の解決の建築原理」、RFC 2276、1998年1月。"
    },
    {
      "indent": 0,
      "text": "8. Contact Information and useful links",
      "section_title": true,
      "ja": "8. 連絡先情報と有用なリンク"
    },
    {
      "indent": 3,
      "text": "Slawek Rozenfeld (Mr.) Head, Computer Section ISSN International Centre 20, rue Bachaumont 750002 PARIS FRANCE",
      "ja": "Slawek Rozenfeld（Mr.）Head、コンピューターセクションISSNインターナショナルセンター20、Rue Bachaumont 750002パリフランス"
    },
    {
      "indent": 3,
      "text": "EMail: rozenfeld@issn.org\n       issnic@issn.org",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "ISSN Web site http://www.issn.org ISSN-URN links http://www.issn.org/urn/",
      "ja": "ISSN Webサイトhttp://www.issn.org Issn-urnリンクhttp://www.issn.org/urn/"
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "ja": "9. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があり、それについてコメントまたは説明する派生作品、またはその実装を支援することができます。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}