{
  "title": {
    "text": "RFC 3337 - Class Extensions for PPP over Asynchronous Transfer Mode Adaptation Layer 2",
    "ja": "RFC 3337 - 非同期転送モード適応層2上のPPPのためのクラスの拡張"
  },
  "number": 3337,
  "created_at": "2019-10-27 03:28:03.203928+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        B. Thompson\nRequest for Comments: 3337                                      T. Koren\nCategory: Standards Track                                  Cisco Systems\n                                                               B. Buffam\n                                                         Seaway Networks\n                                                           December 2002",
      "raw": true
    },
    {
      "indent": 10,
      "text": "           Class Extensions for PPP over\nAsynchronous Transfer Mode Adaptation Layer 2 (AAL2)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2002）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The Point-to-Point Protocol (PPP) over Asynchronous Transfer Mode (ATM) Adaptation Layer 2 defines the encapsulation that allows a PPP session to be transported over an ATM virtual circuit using the ATM Adaptation Layer 2 (AAL2) adaptation layer. This document defines a set of class extensions to PPP over AAL2 that implement equivalent functionality to Multi Class Multi Link PPP over a single ATM virtual circuit. Instead of using Multi Link PPP as the basis for fragmentation functionality, this document uses the functionality of the Segmentation and Reassembly Service Specific Convergence Sublayer that is already required as the basic encapsulation format of PPP over AAL2.",
      "ja": "非同期転送モード（ATM）アダプテーションレイヤ2上のポイントツーポイントプロトコル（PPP）は、PPPセッションがATMアダプテーションレイヤ2（AAL2）適応層を使用してATM仮想回線上を搬送されることを可能にするカプセル化を定義します。この文書では、単一のATM仮想回線を超えるマルチクラスマルチリンクPPPと同等の機能を実装するAAL2上のPPPへのクラスの拡張機能のセットを定義します。代わりに、断片化機能のための基礎としてのマルチリンクPPPを使用しての、この文書は、すでにAAL2上のPPPの基本的なカプセル化フォーマットとして要求されセグメンテーション組立サービス依存コンバージェンスサブレイヤの機能を使用しています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Using AAL2 as an adaptation layer for PPP transport over ATM provides a bandwidth efficient transport for IP applications that generate small packets. An example IP application that generates small packets is RTP encapsulated voice (Voice over IP).",
      "ja": "ATMを介したPPP輸送のためのアダプテーション層としてAAL2を使用すると、小さなパケットを生成するIPアプリケーションのための帯域幅効率的な輸送を提供します。小さなパケットを生成する例IPアプリケーションは、RTPカプセル化された音声（ボイスオーバーIP）です。"
    },
    {
      "indent": 3,
      "text": "In addition to bandwidth efficiency, real-time applications such as voice require low latency. RFC 2689 [2] describes an architecture for providing transport services for real time applications on low bit rate links. The main components of the architecture are: a real-time encapsulation format for asynchronous and synchronous low-bitrate links, a header compression architecture optimized for real-time flows, elements of negotiation protocols used between routers (or between hosts and routers), and announcement protocols used by applications to allow this negotiation to take place.",
      "ja": "帯域幅の効率化に加えて、音声などのリアルタイムアプリケーションは、低遅延を必要とします。 RFC 2689 [2]低ビットレートのリンク上でリアルタイムアプリケーションのための輸送サービスを提供するためのアーキテクチャについて説明します。アーキテクチャの主要なコンポーネントは、次のとおり、非同期および同期の低ビットレートのリンク、リアルタイムフローに対して最適化されたヘッダ圧縮アーキテクチャ、ルータ（またはホストとルータの間）の間で使用されるネゴシエーションプロトコルの要素のためのリアルタイムのカプセル化フォーマット、およびこの交渉が行わできるようにするためにアプリケーションで使用される発表プロトコル。"
    },
    {
      "indent": 3,
      "text": "Multi Class Multi Link PPP [3] defines a fragment-oriented solution for the real-time encapsulation format part of the architecture defined in [2], i.e., for the queues-of-fragments type sender. As described in more detail in the architecture document, a real-time encapsulation format is required to guarantee low latency in the presence of large non real time packets. For example, a 1500 byte packet on a 128 kbit/s ATM virtual circuit makes this link unavailable for the transmission of real-time information for about 100 ms. This adds a worst-case delay that causes real-time applications to operate with round-trip delays that are too high for many interactive tasks. Multi Class Multi Link PPP defines a set of extensions of Multi Link PPP [4] that enable the sender to fragment the packets of various priorities into multiple classes of fragments, allowing high-priority packets to be sent between fragments of lower priorities.",
      "ja": "マルチクラスマルチリンクPPPは、[3]、すなわち、キュー・オブ・フラグメントを送信者を入力し、[2]で定義されたアーキテクチャのリアルタイムのカプセル化フォーマット部分の断片指向ソリューションを定義します。アーキテクチャ文書に詳細に記載されているように、リアルタイムのカプセル化フォーマットは、大きな非リアルタイムパケットの存在下で、低レイテンシを保証するために必要とされます。例えば、128キロビット/秒のATM仮想回路上の1500バイトのパケットは、約100ミリ秒のリアルタイム情報の伝送のために、このリンクが使用できなくなります。これは、多くのインタラクティブなタスクには高すぎる往復遅延で動作するリアルタイムアプリケーションを引き起こし、最悪の場合の遅延が追加されます。マルチクラスマルチリンクPPPは、優先度の高いパケットが低い優先度のフラグメントの間で送信されることを可能にする、フラグメントの複数のクラスに様々な優先度のパケットを断片化するために、送信者を有効にマルチリンクPPP [4]の拡張機能のセットを定義します。"
    },
    {
      "indent": 3,
      "text": "This document defines a set of class extensions to PPP over AAL2 [1] that implement equivalent functionality to Multi Class Multi Link PPP over a single ATM virtual circuit. Instead of using Multi Link PPP as the basis for fragmentation functionality, this document uses the functionality of the Service Specific Segmentation and Reassembly Sublayer (SSSAR) [5] that is already required as the basic encapsulation format of PPP over AAL2.",
      "ja": "この文書では、[1]、単一のATM仮想回線を超えるマルチクラスマルチリンクPPPと同等の機能を実装するAAL2上のPPPへのクラスの拡張機能のセットを定義します。代わりに、断片化機能のための基礎として、マルチリンクPPPを使用しての、この文書は、サービス固有のセグメンテーションとリアセンブリサブレイヤ（SSSAR）[5]既にAAL2上PPPの基本的なカプセル化フォーマットとして必要とされるの機能を使用します。"
    },
    {
      "indent": 3,
      "text": "In addition to providing fragmentation, the real time transport service must allow high priority fragments to be sent between fragments of lower priorities. This can be accomplished in PPP over AAL2 by allowing a single PPP session to span multiple AAL2 CPS [6] Channel Identifiers. Once a PPP session spans multiple AAL2 Channel IDs, the Channel ID can be used to identify the class that a fragment belongs to. Fragments belonging to a high priority class can be sent using a particular AAL2 Channel ID. Fragments of lower priority classes can be sent using different AAL2 Channel IDs. Once multiple fragment classes are identified using different AAL2 Channel IDs, the AAL2 CPS layer can be used to send fragments belonging to a high priority class between fragments of lower priorities.",
      "ja": "断片化を提供することに加えて、リアルタイム・トランスポート・サービスは、優先度の高い断片は、優先度の低いフラグメントの間で送信することができるようにする必要があります。これは、複数のAAL2 CPS [6]チャネル識別子にまたがる単一のPPPセッションを可能にすることにより、AAL2上PPPで達成することができます。 PPPセッションは、複数のAAL2チャネルIDにまたがると、チャネルIDは、フラグメントが属するクラスを識別するために使用することができます。優先度の高いクラスに属するフラグメントは、特定のAAL2チャンネルIDを使用して送信することができます。優先度の低いクラスの断片が異なるAAL2チャネルIDを使用して送信することができます。一旦複数のフラグメントクラスが異なるAAL2チャネルIDを使用して同定され、AAL2 CPS層は、より低い優先度のフラグメント間の優先度の高いクラスに属するフラグメントを送信するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "The class based extensions to PPP over AAL2 use existing services of the AAL2 SSCS and CPS layers already specified in PPP over AAL2. Because of this, the extensions described in this document may be viewed as a desirable alternative to Multi Class Multi Link PPP in providing a class based transport service with PPP over AAL2.",
      "ja": "すでにAAL2上でPPPに指定されたAAL2 SSCSとCPS層のAAL2の使用既存のサービス上のPPPへのクラスベースの拡張機能。このため、このドキュメントで説明する機能拡張は、AAL2上でPPPを持つクラスベースのトランスポート・サービスを提供するマルチクラスマルチリンクPPPの望ましい代替として見ることができます。"
    },
    {
      "indent": 0,
      "text": "1.1. Specification Language",
      "section_title": true,
      "ja": "1.1。仕様言語"
    },
    {
      "indent": 3,
      "text": "The keywords MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD NOT, RECOMMENDED, MAY, and OPTIONAL, when they appear in this document, are to be interpreted as described in [7].",
      "ja": "キーワードは、REQUIREDは、、、、、MAYを推奨、オプション、彼らは、この文書に表示されたときに、で説明したように解釈されるすべきでないないものとものとしてはなりませんしなければならない[7]。"
    },
    {
      "indent": 0,
      "text": "2. Requirements",
      "section_title": true,
      "ja": "2.要件"
    },
    {
      "indent": 3,
      "text": "This document assumes the same service requirements as defined in Multi Class Multi Link PPP [3]. The reader is referred to section 2 of Multi Class Multi Link PPP for the general requirements of a multi class fragmentation / preemption service.",
      "ja": "マルチクラスマルチリンクPPP [3]で定義されている。この文書では、同じサービス要件を前提としています。読者はマルチクラスフラグメンテーション/プリエンプションサービスの一般的な要件のためのマルチクラスマルチリンクPPPのセクション2と呼ばれます。"
    },
    {
      "indent": 0,
      "text": "3. Class Extensions for PPP over AAL2",
      "section_title": true,
      "ja": "AAL2上のPPPのための3クラスの拡張"
    },
    {
      "indent": 3,
      "text": "PPP over AAL2 uses the Service Specific Segmentation and Reassembly Sublayer (SSSAR) [5] for the AAL type 2. The SSSAR sub-layer is used to segment PPP packets into frames that can be transported using the AAL2 CPS. The SSSAR sub-layer uses different AAL2 UUI code-points to indicate whether a segment is the last segment of a packet or not. SSSAR provides basic fragmentation functionality for all packets encapsulated using PPP over AAL2. The SSSAR layer fragments all packets into 64 byte fragments.",
      "ja": "AAL2上PPP [5] AALタイプ2用SSSAR副層をAAL2 CPSを使用して輸送することができるフレームにセグメントPPPパケットに使用されるサービス固有のセグメンテーションとリアセンブリサブレイヤ（SSSAR）を使用します。 SSSAR副層は、セグメントは、パケットの最後のセグメントであるか否かを示すために、異なるAAL2 UUIコードポイントを使用します。 SSSARはAAL2上でPPPを使用してカプセル化されたすべてのパケットのための基本的なフラグメンテーション機能を提供します。 SSSAR層は、64のバイトの断片にすべてのパケットをフラグメント化。"
    },
    {
      "indent": 3,
      "text": "The AAL2 CPS layer defines a Channel ID that is used to identify multiple streams of packets within a single ATM Virtual Circuit. In this document, the AAL2 CPS Channel ID is used to identify the preemption class that a packet fragment belongs to. Since the Channel ID is used to identify different preemption classes, packet fragments from each class of traffic MUST be assigned to different Channel IDs. In addition, each PPP session MUST have at least as many Channel IDs assigned as there are different classes of preemptible traffic.",
      "ja": "AAL2 CPS層は、単一​​のATM仮想回路内のパケットの複数のストリームを識別するために使用されるチャネルIDを定義します。この文書では、AAL2 CPSチャネルIDは、パケットの断片が属するプリエンプションクラスを識別するために使用されます。チャンネルIDが異なるプリエンプションクラスを識別するために使用されているため、トラフィックの各クラスからのパケットのフラグメントは、異なるチャネルIDに割り当てる必要があります。また、各PPPセッションはプリエンプティブトラフィックの異なるクラスがあるとして割り当てられ、少なくともとして多くのチャネルIDを持たなければなりません。"
    },
    {
      "indent": 3,
      "text": "To allow PPP packets to be assigned to different preemption classes, PPP packets must be classified into multiple preemption classes as they are fragmented using SSSAR. Many classification methods may be used to determine the class that a particular PPP packet belongs to. The architecture document [2] describes possible alternatives that MAY be used to implement a real time classification scheme.",
      "ja": "彼らはSSSARを用いて断片化されるPPPパケットは異なるプリエンプションのクラスに割り当てることができるようにするには、PPPパケットは、複数のプリエンプションのクラスに分類されなければなりません。多くの分類方法は、特定のPPPパケットが属するクラスを決定するために使用することができます。アーキテクチャドキュメント[2]は、リアルタイムの分類方式を実装するために使用し得る可能性のある代替案を説明しています。"
    },
    {
      "indent": 3,
      "text": "Once packets have been classified into different preemption classes, each class of traffic is then assigned a different Channel ID. Since fragments from each traffic class are now transmitted using separate Channel ID, the AAL2 CPS layer can be used to schedule fragments from the different classes. The AAL2 CPS specification [6] does not specify a method for scheduling AAL2 CPS payloads from different Channel IDs. The scheduling method required at the AAL2 CPS layer depends upon the real time requirements of applications using this service. Some real-time applications MAY require the use of a priority based CID scheduler. Other applications MAY only require a fair or weighted fair CID scheduler. Implementations of PPP over AAL2 real time transport extensions SHOULD implement AAL2 CPS CID schedulers that meet the requirements of multi-class real time applications.",
      "ja": "パケットは異なるプリエンプションのクラスに分類されていたら、トラフィックの各クラスは、異なるチャネルIDが割り当てられます。各トラフィッククラスからのフラグメントは、現在別のチャネルIDを使用して送信されるので、AAL2のCPS層は、異なるクラスからのフラグメントをスケジュールするために使用することができます。 AAL2 CPS仕様[6]異なるチャネルIDからAAL2のCPSペイロードをスケジューリングするための方法を指定していません。 AAL2 CPSレイヤで必要なスケジューリング方法は、このサービスを利用したアプリケーションのリアルタイム要件に依存します。いくつかのリアルタイムアプリケーションは、優先順位ベースのCIDスケジューラの使用が必要な場合があります。他のアプリケーションでは、唯一の公正または重み付け公平CIDスケジューラが必要な場合があります。 AAL2リアルタイムトランスポート拡張上のPPPの実装は、マルチクラスリアルタイムアプリケーションの要件を満たしてAAL2 CPS CIDスケジューラを実装する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Example Implementation: Class Based Extensions for Voice Service",
      "section_title": true,
      "ja": "4.実装例：音声サービスのためのクラスベースの拡張"
    },
    {
      "indent": 3,
      "text": "When PPP over AAL2 is used to transport both voice and non-voice packets over low bandwidth ATM virtual circuits, it may be necessary to preempt the transmission of a large data packet in order to transmit a voice packet with minimal delay. The example implementation described below shows an example of how the class extensions for PPP over AAL2 can be used to support a real time voice transport service over low bandwidth AAL2 virtual circuits. To guarantee low latency and loss for voice transport, the ATM virtual circuit in this example must be provisioned using a real time traffic class such as VBRnrt or VBRrt.",
      "ja": "AAL2上PPPは、低帯域幅のATM仮想回線上で音声および非音声パケットの両方を搬送するために使用される場合、最小の遅延で音声パケットを送信するために大規模なデータパケットの送信を先取りする必要があるかもしれません。下記の実装例ではAAL2上のPPPのクラスの拡張機能は、低帯域幅のAAL2仮想回線を超えるリアルタイムの音声トランスポート・サービスをサポートするために使用することができる方法の一例を示しています。音声伝送のための低遅延と損失を保証するために、この例では、ATM仮想回線は、このようなVBRnrtやVBRrtとしてリアルタイムトラフィッククラスを使用してプロビジョニングする必要があります。"
    },
    {
      "indent": 3,
      "text": "For the simple voice service described above, 2 classes are sufficient to guarantee low latency for voice packets. The PPP over AAL2 session in this case can be configured to run across 2 AAL2 CPS Channel IDs. One channel ID is used to transport large data packets while the other channel ID is used to transport real time voice packets.",
      "ja": "上記の単純な音声サービスの場合は、2クラスは、音声パケットのための低遅延を保証するのに十分です。この場合、PPP AAL2以上のセッションが2つのAAL2 CPSチャネルID渡って実行するように設定することができます。一つのチャネルIDは他のチャネルIDは、リアルタイムの音声パケットを転送するために使用されている間、大きなデータパケットを転送するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Packets that arrive at the PPP interface must first be classified as either belonging to the real time class or belonging to the data class. A simple classifier that can be used to classify packets at this layer is packet size.",
      "ja": "PPPインターフェイスに到着したパケットは、最初にどちらかのリアルタイムクラスに属するか、データクラスに属するものとして分類されなければなりません。この層でパケットを分類するために使用することができる単純な分類器は、パケットサイズです。"
    },
    {
      "indent": 3,
      "text": "Large packets are assigned to the non-real time (or data) traffic class and small packets are assigned to the real time traffic class. The packet size used to discriminate between real time and non-real time packets may vary based on the application and transmission rate of the virtual circuit.",
      "ja": "大きなパケットが非リアルタイム（またはデータ）トラフィッククラスに割り当てられ、小さなパケットをリアルタイムトラフィッククラスに割り当てられます。リアルタイムおよび非リアルタイムパケットを区別するために使用されるパケットサイズは、仮想回線のアプリケーションと伝送速度に基づいて変化してもよいです。"
    },
    {
      "indent": 3,
      "text": "Once packets have been classified, they are now fragmented using the SSSAR layer of PPP over AAL2. Separate instances of the SSSAR fragmentation function run on each of the 2 Channel IDs assigned to the PPP session.",
      "ja": "パケットが分類されていたら、彼らは今AAL2上のPPPのSSSAR層を用いて断片化されています。 SSSARフラグメンテーション機能の個別のインスタンスは、PPPセッションに割り当てられた2つのチャネルIDのそれぞれで実行されます。"
    },
    {
      "indent": 3,
      "text": "Fragments coming from the SSSAR functions are now scheduled into the AAL2 virtual circuit using the AAL2 CPS layer. Most AAL2 SAR implementations currently implement fair scheduling across multiple AAL2 Channel IDs. Since the AAL2 CPS scheduler implements fair scheduling, real time fragments will wait for at most one non-real time fragment to be transmitted on the AAL2 virtual circuit before being scheduled.",
      "ja": "SSSAR機能から来るのフラグメントは、現在、AAL2 CPSレイヤを使用してAAL2仮想回路に予定されています。ほとんどのAAL2 SAR実装は現在、複数のAAL2チャネルIDを越え公平なスケジューリングを実装します。 AAL2 CPSスケジューラが公平なスケジューリングを実装しているため、リアルタイムの断片は、スケジュールされる前に、AAL2仮想回線上で送信される最大1つの非リアルタイムフラグメントを待ちます。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Operation of this protocol is believed to be no more and no less secure than operation of PPP over AAL2 [1].",
      "ja": "このプロトコルの動作は、[1] AAL2上もはやとPPPの動作を下回らない安全でないと考えられています。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank James Carlson for his contributions to this proposal.",
      "ja": "作者はこの提案への貢献のためのジェームズ・カールソンに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 3,
      "text": "[1] Thompson, B., Koren, T. and B. Buffam, \"PPP Over Asynchronous Transfer Mode Adaptation Layer 2\", RFC 3336, December 2002.",
      "ja": "[1]トンプソン、B.、コレン、T.とB. Buffam、 \"PPPオーバー非同期転送モードアダプテーションレイヤ2\"、RFC 3336、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[2] Bormann, C., \"Providing Integrated Services over Low-bitrate Links\", RFC 2689, September 1999.",
      "ja": "[2]ボルマン、C.、 \"低ビットレートリンク上で統合サービスの提供\"、RFC 2689、1999年9月を。"
    },
    {
      "indent": 3,
      "text": "[3] Bormann, C., \"The Multi-Class Extension to Multi-Link PPP\", RFC 2686 September 1999.",
      "ja": "[3]、RFC 2686 1999年9月、 \"マルチリンクPPPへのマルチクラス拡張\" ボルマン、C.を、。"
    },
    {
      "indent": 3,
      "text": "[4] Sklower, K., Lloyd, B., McGregor, G., Carr, D. and T. Coradetti, \"The PPP Multilink Protocol (MP)\", RFC 1990, August 1996.",
      "ja": "[4] Sklower、K.、ロイド、B.、マクレガー、G.、カー、D.およびT. Coradetti、 \"PPPマルチリンクプロトコル（MP）\"、RFC 1990、1996年8月。"
    },
    {
      "indent": 3,
      "text": "[5] International Telecommunications Union, \"Segmentation and Reassembly Service Specific Convergence Sublayer for the AAL type 2\", ITU-T Recommendation I.366.1, June 1998.",
      "ja": "[5]国際電気通信連合、「AALタイプ2のための分割組立サービス依存コンバージェンスサブレイヤ」、ITU-T勧告I.366.1、1998年6月。"
    },
    {
      "indent": 3,
      "text": "[6] International Telecommunications Union, \"BISDN ATM Adaptation layer specification: Type 2 AAL(AAL2)\", ITU-T Recommendation I.363.2, September 1997.",
      "ja": "[6]国際電気通信連合、 \"BISDN ATMアダプテーションレイヤ仕様：タイプ2 AAL（AAL2）\"、ITU-T勧告I. 363.2、1997年9月。"
    },
    {
      "indent": 3,
      "text": "[7] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[7]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 0,
      "text": "8. Authors' Addresses",
      "section_title": true,
      "ja": "8.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Bruce Thompson Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 USA",
      "ja": "ブルース・トンプソンシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 527-0446 EMail: brucet@cisco.com",
      "ja": "電話：+1 408 527-0446 Eメール：brucet@cisco.com"
    },
    {
      "indent": 3,
      "text": "Bruce Buffam Seaway Networks One Chrysalis Way, Suite 300, Ottawa, Canada K2G-6P9",
      "ja": "ブルース・Buffam水路網の一つクリサリス・ウェイ、スイート300、オタワ、カナダK2G-6P9"
    },
    {
      "indent": 3,
      "text": "Phone: +1 613 723-9161 EMail: bruce@seawaynetworks.com",
      "ja": "電話：+1 613 723-9161 Eメール：bruce@seawaynetworks.com"
    },
    {
      "indent": 3,
      "text": "Tmima Koren Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134 USA",
      "ja": "Tmimaコレンシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 527-6169 EMail: tmima@cisco.com",
      "ja": "電話：+1 408 527-6169 Eメール：tmima@cisco.com"
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "ja": "9.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2002）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}