{
  "title": {
    "text": "RFC 3049 - TN3270E Service Location and Session Balancing",
    "ja": "RFC 3049 - TN3270Eサービスの場所とセッションバランス"
  },
  "number": 3049,
  "created_at": "2023-12-26 13:17:20.347969+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          J. Naugle\nRequest for Comments: 3049                             K. Kasthurirangan\nCategory: Standards Track                                            IBM\n                                                              G. Ledford\n                                                      Zephyr Development\n                                                            January 2001",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "TN3270E Service Location and Session Balancing",
      "ja": "TN3270Eサービスの場所とセッションバランス"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document discusses the implementation of Service Location Protocol (SLP) and session balancing with a TN3270E emulator in a client server implementation with a TN3270E server.",
      "ja": "このドキュメントでは、TN3270Eサーバーを使用したクライアントサーバーの実装でのTN3270Eエミュレーターとのサービスロケーションプロトコル（SLP）とセッションのバランスをとるセッションの実装について説明します。"
    },
    {
      "indent": 3,
      "text": "Application program developer's can locate TN3270E services and load balance among those services (3270 host sessions), by using this SLP support.",
      "ja": "アプリケーションプログラム開発者は、このSLPサポートを使用して、これらのサービス（3270ホストセッション）の間でTN3270Eサービスと負荷バランスを見つけることができます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction and Terminology .................................  2\n   1.1 Terminology ..............................................  2\n2. An Overview of RFC 2165 ......................................  3\n   2.1 SLP Agents ...............................................  3\n   2.2 Service Agents ...........................................  3\n   2.3 User Agents ..............................................  4\n3. TN3270E Server Environment and Load ..........................  4\n   3.1 TnN3270E Server Load .....................................  4\n4. TN3270E Client Configuration .................................  6\n   4.1 SLP Scope ................................................  6\n   4.2 DA-Discovery Time-Out ....................................  6\n   4.3 SA-Discovery Time-Out ....................................  7\n5. TN3270E Client Implementation Information ....................  7\n   5.1 Overview .................................................  7\n      5.2 How to Obtain List of TN3270E Servers Supporting SLP .....  8\n   5.3 TN3270E Sample Client Flow ...............................  9\n      5.3.1 Open the SLP connection .............................  9\n      5.3.2 Query the list of TN3270E servers ...................  9\n      5.3.3 Forward Looking Example using SLPv2 ................. 10\n      5.3.4 Determine loading of each TN3270E server ............ 10\n   5.4 Recommendations .......................................... 11\n6. Sample Trace Flow of SLP and Session Balancing ............... 11\n7. Service Templates and Service Registration ................... 12\n   7.1 The TN3270E Service Type Template ........................ 12\n   7.2 The Server Service Template .............................. 16\n   7.3 Template Contact Information ............................. 17\n   7.4 Security Considerations .................................. 17\n   7.5 Sample TN3270 Service Registration Message ............... 18\n   7.6 Sample Server Service Registration Message ............... 19\n8. References ................................................... 19\n9. Authors' Addresses ........................................... 20\n10. Full Copyright Statement .................................... 21",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction and Terminology",
      "section_title": true,
      "ja": "1. 紹介と用語"
    },
    {
      "indent": 3,
      "text": "This document will provide information on Service Location Protocol implementation to discover TN3270E servers in a network and session balance among those servers. This implementation follows the standards track RFC 2165, Service Location Protocol [1] but also provides some examples when using Service Location Protocol version 2 to be forward looking. Service Location Protocol version 2 is documented in RFC 2608 [4] and RFC 2609 [2].",
      "ja": "このドキュメントでは、サービスロケーションプロトコルの実装に関する情報を提供して、これらのサーバー間のネットワーク内のTN3270Eサーバーとセッションバランスを発見します。この実装は、RFC 2165のService Location Protocol [1]の標準トラックに従いますが、サービスロケーションプロトコルバージョン2を使用して前進する場合の例も提供します。サービスロケーションプロトコルバージョン2は、RFC 2608 [4]およびRFC 2609 [2]に文書化されています。"
    },
    {
      "indent": 0,
      "text": "1.1 Terminology",
      "section_title": true,
      "ja": "1.1 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [1].",
      "ja": "「必須」、「そうしない」、「必須」、「shall」、「shall \"、\" ingle \"、\" should \"、\" not \"、\" becommended \"、\" bay \"、および「optional」は、RFC 2119 [1]に記載されているように解釈される。"
    },
    {
      "indent": 3,
      "text": "Session Balance - This refers to the ability of TN3270E client to use server load information to establish a TN3270E connection to the TN3270E server with the least load at that time. The purpose is to distribute the connection of TN3270E sessions among more than one TN3270E server, and one server will not be excessively loaded. The term \"load balance\" is a more general term, with respect to server load, and in this document we are focusing on the TN3270E session connections to least loaded servers.",
      "ja": "セッションバランス - これは、TN3270Eクライアントがサーバー負荷情報を使用して、当時の負荷が最小のTN3270EサーバーへのTN3270E接続を確立する機能を指します。目的は、TN3270Eセッションの接続を複数のTN3270Eサーバー間で配布することであり、1つのサーバーは過度にロードされません。「ロードバランス」という用語は、サーバーの負荷に関してより一般的な用語であり、このドキュメントでは、最小のロードされたサーバーへのTN3270Eセッション接続に焦点を当てています。"
    },
    {
      "indent": 3,
      "text": "SNA Gateway - A Systems Network Architecture (SNA) gateway allows multiple LAN-attached workstations to access SNA hosts through one or more physical connections to one or more hosts. A SNA gateway acts as a protocol converter between workstations attached to a LAN and a WAN host line. It typically would support the SNA protocols LU 0, 1, 2, 3, and dependent LU 6.2 (APPC). SNA gateways typically include a TN3270E server capability.",
      "ja": "SNAゲートウェイ-Systems Network Architecture（SNA）Gatewayを使用すると、複数のLAN接続されたワークステーションが1つ以上の物理的接続を介してSNAホストにアクセスできます。SNAゲートウェイは、LANに接続されたワークステーションとWANホストライン間のプロトコルコンバーターとして機能します。通常、SNAプロトコルLu 0、1、2、3、および依存Lu 6.2（APPC）をサポートします。SNAゲートウェイには、通常、TN3270Eサーバー機能が含まれます。"
    },
    {
      "indent": 3,
      "text": "LU Pool - The Logical Units (LUs) defined in the gateway can be dedicated to a particular workstation or pooled among multiple workstations. Pooling allows workstations to share common Logical Units (LUs), which increases the efficiency of the LUs and reduces the configuration and startup requirements at the host. When a client connects to the gateway, the gateway retrieves an LU from the pool to establish a session. The LU is returned to the pool for access by other workstations when the session is ended.",
      "ja": "LUプール - ゲートウェイで定義されている論理ユニット（LUS）は、特定のワークステーション専用または複数のワークステーションの間でプールされます。プーリングにより、ワークステーションは共通の論理ユニット（LUS）を共有できます。これにより、LUSの効率が向上し、ホストの構成要件と起動要件が削減されます。クライアントがゲートウェイに接続すると、ゲートウェイはプールからLUを取得してセッションを確立します。LUは、セッションが終了したときに他のワークステーションからアクセスするためにプールに戻されます。"
    },
    {
      "indent": 3,
      "text": "Commserver Service Type Template - Commserver service type is defined as an SNA Gateway server as previously defined above in this terminology section. A template describing the attributes for this service type is in section 7.2.",
      "ja": "Commserver Service Type Template -Commserverサービスタイプは、この用語セクションで上記で以前に定義されたSNAゲートウェイサーバーとして定義されます。このサービスタイプの属性を説明するテンプレートは、セクション7.2にあります。"
    },
    {
      "indent": 0,
      "text": "2. An overview of RFC 2165",
      "section_title": true,
      "ja": "2. RFC 2165の概要"
    },
    {
      "indent": 3,
      "text": "RFC 2165, Service Location Protocol (SLP) [1], provides an automatic way for clients to discover services within an administrative domain.",
      "ja": "RFC 2165、Service Location Protocol（SLP）[1]は、クライアントが管理ドメイン内でサービスを発見する自動的な方法を提供します。"
    },
    {
      "indent": 3,
      "text": "These services have various attributes associated with them from which a client can base a service selection. The basic design involves the use of three agent types. These are: User Agents (UA's), Service Agents (SA's) and Directory Agents (DA's).",
      "ja": "これらのサービスには、クライアントがサービスの選択を基にすることができるさまざまな属性があります。基本設計には、3つのエージェントタイプの使用が含まれます。これらは、ユーザーエージェント（UA）、サービスエージェント（SA）、ディレクトリエージェント（DA）です。"
    },
    {
      "indent": 0,
      "text": "2.1 SLP Agents",
      "section_title": true,
      "ja": "2.1 SLPエージェント"
    },
    {
      "indent": 3,
      "text": "User Agents are used to query Service Agents or Directory Agents. They acquire/request service information based upon the desired attributes and service needed for the user application.",
      "ja": "ユーザーエージェントは、サービスエージェントまたはディレクトリエージェントを照会するために使用されます。ユーザーアプリケーションに必要な希望の属性とサービスに基づいて、サービス情報を取得/要求します。"
    },
    {
      "indent": 3,
      "text": "Service Agents represent a specific service and advertise service information.",
      "ja": "サービスエージェントは特定のサービスを表し、サービス情報を宣伝します。"
    },
    {
      "indent": 3,
      "text": "Directory Agents act as a central collection point for service registration information by Service Agents which is later requested by \"user agents\" in \"intranets\".",
      "ja": "ディレクトリエージェントは、「イントラネット」の「ユーザーエージェント」によって後に要求されるサービスエージェントによるサービス登録情報の中心的な収集ポイントとして機能します。"
    },
    {
      "indent": 0,
      "text": "2.2 Service Agents",
      "section_title": true,
      "ja": "2.2 サービスエージェント"
    },
    {
      "indent": 3,
      "text": "The service registers itself with the service agent so that the SA can start advertising this information over the network. The process of registration consists of the service giving the SA all relevant configuration information and attribute tag/value list pairs specific to this service. The Service template is an abstract schema that applies to the service type. The service template for TN3270E is shown later, contains the URL which is the address of the server with the port, which should be used to connect to it. The URL also contains the service type which in this case is TN3270. The template also contains all the other attributes associated with this service.",
      "ja": "サービスは、SAがネットワーク上でこの情報を宣伝し始めることができるように、サービスエージェントにそれ自体を登録します。登録のプロセスは、このサービスに固有のすべての関連する構成情報と属性タグ/値リストペアを提供するサービスで構成されています。サービステンプレートは、サービスタイプに適用される抽象的なスキーマです。TN3270Eのサービステンプレートには、後で表示されます。これには、ポートに接続するために使用する必要があるサーバーのアドレスであるURLが含まれています。URLには、この場合はTN3270であるサービスタイプも含まれています。テンプレートには、このサービスに関連付けられた他のすべての属性も含まれています。"
    },
    {
      "indent": 0,
      "text": "2.3 User Agents",
      "section_title": true,
      "ja": "2.3 ユーザーエージェント"
    },
    {
      "indent": 3,
      "text": "The User Agent working on the TN3270E client's behalf retrieves service information from the Service Agent(s) or a Directory Agent. Based on the gathered information and required attributes the TN3270E client or user can decide whether or not to connect with a particular server. Based on the service advertisements from various TN3270E servers, the client looks at the load attribute and can decide to connect to the least loaded server. If by the time it connects to that particular TN3270E server, the server becomes unavailable it can try connecting to the next server in its list (ie: the second least loaded server whose advertisement was retrieved by the client/user agent).",
      "ja": "TN3270Eクライアントに代わって作業するユーザーエージェントは、サービスエージェントまたはディレクトリエージェントからサービス情報を取得します。収集された情報と必要な属性に基づいて、TN3270Eクライアントまたはユーザーは、特定のサーバーに接続するかどうかを決定できます。さまざまなTN3270Eサーバーのサービス広告に基づいて、クライアントはLoad属性を調べ、最小限のロードサーバーに接続することを決定できます。その特定のTN3270Eサーバーに接続する頃には、サーバーが利用可能になり、リスト内の次のサーバーに接続してみることができます（つまり、クライアント/ユーザーエージェントによって広告が取得された2番目の最小ロードサーバー）。"
    },
    {
      "indent": 0,
      "text": "3. TN3270E Server Environment and Load",
      "section_title": true,
      "ja": "3. TN3270Eサーバー環境とロード"
    },
    {
      "indent": 3,
      "text": "TN3270E Servers are pervasive in today's networked environment. SLP provides emulator clients with a way to discover TN3270E servers in the network and session balance among the servers. The TN3270E servers could be distributed across different SNA gateways with different connection methods to hosts. The use of LU pools provides an easy way for administrators to provide users access to hosts. Administrators can add users to LU pools that have pre-configured LU's with specific attributes, like LU types and model types.",
      "ja": "TN3270Eサーバーは、今日のネットワーク化された環境に広まっています。SLPは、エミュレータクライアントに、ネットワーク内のTN3270Eサーバーを発見し、サーバー間のセッションバランスを発見する方法を提供します。TN3270Eサーバーは、さまざまな接続方法をホストに備えたさまざまなSNAゲートウェイに分散できます。LUプールを使用すると、管理者がユーザーにホストにアクセスできるように簡単にできます。管理者は、LUタイプやモデルタイプなどの特定の属性を持つLUを事前に構成したLUプールにユーザーを追加できます。"
    },
    {
      "indent": 3,
      "text": "These LU pools would typically have LUs from several different gateways assigned, and as members of the LU pool make TN3270E session connections, they would be making connections to different TN3270E servers, with different load factors, so that session balancing could be accomplished. The use of LU pools is not a requirement for SLP and session balancing. A TN3270E client could obtain a session by using SLP and session balancing to locate the least loaded server in the network. On a service request a wild card \"*\" could be used when asking for LUPOOL if the emulator doesn't care which device types are supported in given pools or if it can assume given pools support only certain device types.",
      "ja": "これらのLUプールは通常、いくつかの異なるゲートウェイから割り当てられており、LUプールのメンバーがTN3270Eセッション接続を行うと、異なる負荷係数を使用して異なるTN3270Eサーバーに接続するため、セッションのバランスをとることができます。LUプールの使用は、SLPとセッションのバランスの要件ではありません。TN3270Eクライアントは、SLPとセッションのバランスを使用して、ネットワーク内のロードされたサーバーが最小のサーバーを見つけることでセッションを取得できます。サービスリクエストでは、エミュレーターが特定のプールでどのデバイスタイプがサポートされているかを気にしないかどうか、または特定のプールが特定のデバイスタイプのみをサポートすると仮定できるかどうかをループールに依頼するときに、ワイルドカード「*」を使用できます。"
    },
    {
      "indent": 0,
      "text": "3.1 TN3270E Server Load",
      "section_title": true,
      "ja": "3.1 TN3270Eサーバーの負荷"
    },
    {
      "indent": 3,
      "text": "TN3270E servers providing load information, SHOULD include number of sessions available, not in current use, as part of the calculation in determining the total load for the server. There can be other factors that might have an effect on server load. An example would be if a server is not dedicated to only SNA traffic, and is handling other processes, like file services and print services, etc. It is beyond the scope of this document to standardize the method of individual server load calculations. Different vendors server's may calculate load information based upon factors they consider important, and methods for calculating load may change over time.",
      "ja": "負荷情報を提供するTN3270Eサーバーには、サーバーの合計負荷を決定する際の計算の一部として、現在使用していないセッションの数を含める必要があります。サーバーの負荷に影響を与える可能性のある他の要因があります。例としては、サーバーがSNAトラフィックのみに専念しておらず、ファイルサービスや印刷サービスなどの他のプロセスを処理している場合です。このドキュメントの範囲を超えて、個々のサーバーロード計算の方法を標準化します。さまざまなベンダーサーバーは、重要と考える要因に基づいて負荷情報を計算する場合があり、負荷を計算する方法は時間とともに変化する場合があります。"
    },
    {
      "indent": 3,
      "text": "If the TN3270E server coexists in a network with other TN server implementations using SLP for session balancing, TN3270E server load could be adjusted to compensate for differences in load calculations.",
      "ja": "TN3270Eサーバーが、セッションバランスのためにSLPを使用して他のTNサーバーの実装とネットワーク内で共存する場合、TN3270Eサーバーの負荷を調整して、負荷計算の違いを補うことができます。"
    },
    {
      "indent": 3,
      "text": "One way to allow TN3270E server administrators to compensate for differences in implementations of calculating server load measurement is to provide the ability to modify the load calculation on the TN3270E server. An element of control can be provided by allowing the administrator to modify the load measurement, by using an integral number between 0 and 100 (100 being the highest) to change the load. This load measurement acts as an additional factor on the server's actual load calculation, so that the administrator could bias up or down, the likelihood of that server being selected by a TN3270E client.",
      "ja": "TN3270Eサーバー管理者が、サーバー負荷測定の計算の実装の違いを補正できるようにする1つの方法は、TN3270Eサーバーの負荷計算を変更する機能を提供することです。管理者が負荷測定を変更できるようにすることで、負荷を変更するために0〜100（100）の間の積分数を使用することにより、制御の要素を提供できます。この負荷測定は、サーバーの実際の負荷計算の追加係数として機能するため、管理者が上下にバイアスをかけることができるように、そのサーバーがTN3270Eクライアントによって選択される可能性があります。"
    },
    {
      "indent": 3,
      "text": "Load MUST be defined as one of the attributes for the TN3270E server. The Load attribute provided at the server will allow clients to determine which server to make a connection. If a UA provides only a Service Type, in an Attribute Request, then the reply includes all attributes and all values for that Service Type, and Load would be included. Attribute Requests MAY include a select clause, so you could be returned just load information. For more information on Attribute Requests refer to Service Location Protocol [1].",
      "ja": "負荷は、TN3270Eサーバーの属性の1つとして定義する必要があります。サーバーで提供されるロード属性により、クライアントは接続を作成するサーバーを決定できます。UAが属性要求でサービスタイプのみを提供する場合、返信にはそのサービスタイプのすべての属性とすべての値が含まれ、負荷が含まれます。属性要求にはSelect句が含まれる場合があるため、情報を読み込むだけです。属性要求の詳細については、サービスロケーションプロトコル[1]を参照してください。"
    },
    {
      "indent": 3,
      "text": "An application could issue a Service Request to locate a TN3270E server. Then an application designed to perform least-load location of a TN3270E service, could issue a series of Attribute Requests to obtain the load measurement of each server specified with a URL. It would specify a select clause similar to the one below to receive only load information.",
      "ja": "アプリケーションは、TN3270Eサーバーを見つけるためのサービスリクエストを発行できます。次に、TN3270Eサービスの最小負荷位置を実行するように設計されたアプリケーションは、URLで指定された各サーバーの負荷測定を取得するために、一連の属性要求を発行できます。これは、ロード情報のみを受信するために、以下の句と同様の選択句を指定します。"
    },
    {
      "indent": 3,
      "text": "URL = service:tn3270://9.37.51.254:23 Attribute filter = LOAD",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The attribute LOAD would be returned along with its value. The application could then issue other Attribute Request calls for each URL.",
      "ja": "属性の負荷はその値とともに返されます。アプリケーションは、各URLの他の属性要求呼び出しを発行できます。"
    },
    {
      "indent": 3,
      "text": "The application would then select the least loaded server as a connection target. If it tries to connect to a server and that connection fails, it could then try to connect to the next least-loaded server.",
      "ja": "アプリケーションは、接続ターゲットとして最小のロードされたサーバーを選択します。サーバーに接続しようとし、その接続が失敗した場合、次の最小ロードされたサーバーに接続しようとする可能性があります。"
    },
    {
      "indent": 0,
      "text": "4. TN3270E Client Configuration",
      "section_title": true,
      "ja": "4. TN3270Eクライアント構成"
    },
    {
      "indent": 0,
      "text": "4.1 SLP Scope",
      "section_title": true,
      "ja": "4.1 SLPスコープ"
    },
    {
      "indent": 3,
      "text": "Scope is a parameter used to control and manage access by clients to servers in a network. It is the same as the Service Location Protocol scope defined in RFC 2165 [1]. The control scope provides is necessary for two reasons:",
      "ja": "Scopeは、ネットワーク内のサーバーへのクライアントによるアクセスを制御および管理するために使用されるパラメーターです。これは、RFC 2165 [1]で定義されているサービスロケーションプロトコルスコープと同じです。コントロールスコープが提供する2つの理由で必要です。"
    },
    {
      "indent": 3,
      "text": "As your network, the number of clients, and the number of servers grow, it becomes necessary to partition access to those servers by the growing number of clients in order to reduce overall traffic on the network. It allows administrators to organize users and servers into administrative groups.",
      "ja": "ネットワーク、クライアントの数、およびサーバーの数が増えると、ネットワーク上の全体的なトラフィックを削減するために、クライアントの数が増えてこれらのサーバーにアクセスすることが必要になります。これにより、管理者はユーザーとサーバーを管理グループに整理できます。"
    },
    {
      "indent": 3,
      "text": "The meaning of the values of scope is defined by the administrator of the network. These values can represent any entity. Commonly, they fall along either departmental, geographical, or organizational lines.",
      "ja": "スコープの値の意味は、ネットワークの管理者によって定義されます。これらの値は、任意のエンティティを表すことができます。一般的に、彼らは部門、地理、または組織のいずれかに沿って落ちます。"
    },
    {
      "indent": 3,
      "text": "Each TN3270E server can be assigned to a single scope or multiple scopes. TN3270E clients using these servers can be configured for a single specific scope. If TN3270E clients are not configured with a scope they MUST use the scope \"default\".",
      "ja": "各TN3270Eサーバーは、単一のスコープまたは複数のスコープに割り当てることができます。これらのサーバーを使用するTN3270Eクライアントは、単一の特定の範囲に合わせて構成できます。TN3270Eクライアントがスコープで構成されていない場合、スコープ「デフォルト」を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "SLP Service Agents and Directory Agents (DA) need to reside in the network that support the TN3270E server with configured scopes.",
      "ja": "SLPサービスエージェントとディレクトリエージェント（DA）は、構成されたスコープでTN3270Eサーバーをサポートするネットワークに居住する必要があります。"
    },
    {
      "indent": 3,
      "text": "Attribute information for Service Types pertaining to a specific scope can be obtained from Directory Agents (DA). The DA will not return a result unless the requested scope matches.",
      "ja": "特定のスコープに関連するサービスタイプの属性情報は、ディレクトリエージェント（DA）から取得できます。要求されたスコープが一致しない限り、DAは結果を返しません。"
    },
    {
      "indent": 3,
      "text": "For more information on SLP scope refer to Service Location Protocol [1].",
      "ja": "SLPスコープの詳細については、サービスロケーションプロトコル[1]を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.2 DA Discovery time-out",
      "section_title": true,
      "ja": "4.2 DAディスカバリータイムアウト"
    },
    {
      "indent": 3,
      "text": "The DA Discovery time-out value, is used to control how long the SLP API must wait to discover Directory Agents (DAs) in the network. The discovery request is a multicast, and the amount of time required to gather all DA responses might vary depending on many factors. If there are no DAs in the network, this time-out value can be set to zero to indicate that no DA discovery is to be done. The time-out is expressed in milliseconds. Time-out intervals and default values should be handled as described in RFC 2165 [1].",
      "ja": "DAディスカバリータイムアウト値は、SLP APIがネットワーク内のディレクトリエージェント（DAS）を発見するのを待つ時間を制御するために使用されます。発見要求はマルチキャストであり、すべてのDA応答を収集するのに必要な時間は、多くの要因によって異なる場合があります。ネットワークにDASがない場合、このタイムアウト値をゼロに設定して、DAの発見が行われないことを示すことができます。タイムアウトはミリ秒で表されます。タイムアウト間隔とデフォルト値は、RFC 2165 [1]に記載されているように処理する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3 SA Multicast time-out",
      "section_title": true,
      "ja": "4.3 SAマルチキャストタイムアウト"
    },
    {
      "indent": 3,
      "text": "The SA Multicast time-out value, is used to control how long the SLP API must wait to discover services, attributes, or service types in a network without at least one DA that supports the scope of the request. In this situation, these requests are multicast and the User Agent waits the time-out value to gather the multiple responses that are returned. The time-out is expressed in milliseconds. Time-out intervals and default values should be handled as described in RFC 2165 [1].",
      "ja": "SAマルチキャストのタイムアウト値は、SLP APIがリクエストの範囲をサポートする少なくとも1つのDAなしで、ネットワーク内のサービス、属性、またはサービスタイプを発見するのを待つ時間を制御するために使用されます。この状況では、これらの要求はマルチキャストであり、ユーザーエージェントはタイムアウト値を待って、返される複数の応答を収集します。タイムアウトはミリ秒で表されます。タイムアウト間隔とデフォルト値は、RFC 2165 [1]に記載されているように処理する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. TN3270E Client Implementation Information",
      "section_title": true,
      "ja": "5. TN3270Eクライアントの実装情報"
    },
    {
      "indent": 0,
      "text": "5.1 Overview",
      "section_title": true,
      "ja": "5.1 概要"
    },
    {
      "indent": 3,
      "text": "A TN3270E client that implements TN3270E SLP session balancing does not need to configure an IP Host Address or TCP Port for the TN3270E server it desires to connect to. Instead, the IP Host Address and TCP Port of the least loaded TN3270E server is discovered by using the SLP session balancing described in this document.",
      "ja": "TN3270E SLPセッションのバランスを実装するTN3270Eクライアントは、接続したいTN3270EサーバーのIPホストアドレスまたはTCPポートを構成する必要はありません。代わりに、このドキュメントに記載されているSLPセッションのバランスを使用して、最小限のTN3270EサーバーのIPホストアドレスとTCPポートが発見されます。"
    },
    {
      "indent": 3,
      "text": "The discovery of the least loaded TN3270E server is done entirely outside of and before the TN3270E telnet negotiation. Once the IP Host address and TCP Port of the least loaded TN3270E server is discovered, the TN3270E client can then start normal TN3270E telnet negotiation.",
      "ja": "最小のロードされたTN3270Eサーバーの発見は、TN3270E Telnetネゴシエーションの外側および前後に行われます。最小負荷のTN3270EサーバーのIPホストアドレスとTCPポートが発見されると、TN3270Eクライアントは通常のTN3270E Telnet交渉を開始できます。"
    },
    {
      "indent": 3,
      "text": "The TN3270E client MUST allow for configuration of the following parameters. These SLP specific configuration items are covered by configuration parameters in the SLP API [5].",
      "ja": "TN3270Eクライアントは、次のパラメーターの構成を許可する必要があります。これらのSLP固有の構成項目は、SLP API [5]の構成パラメーターでカバーされています。"
    },
    {
      "indent": 3,
      "text": "Enable SLP Session Balancing",
      "ja": "SLPセッションのバランスを有効にします"
    },
    {
      "indent": 3,
      "text": "This configuration parameter indicates whether or not SLP session balancing is enabled. If it is enabled the following three configuration parameters MUST also be configurable. If this parameter is disabled, SLP session balancing is not supported and normal TN3270E telnet negotiation is performed.",
      "ja": "この構成パラメーターは、SLPセッションのバランスが有効かどうかを示します。有効になっている場合、次の3つの構成パラメーターも設定可能でなければなりません。このパラメーターが無効になっている場合、SLPセッションのバランスはサポートされておらず、通常のTN3270E Telnet交渉が実行されます。"
    },
    {
      "indent": 3,
      "text": "Scope Name The scope name is a text string that specifies a group of TN3270E servers. The scope name can be used to identify groups of TN3270E servers in a departmental or geographic setting. For example, if the scope name is Building-D, then the SLP session balancing would search all TN3270E servers in the Building-D scope to find the least loaded TN3270E server.",
      "ja": "スコープ名スコープ名は、TN3270Eサーバーのグループを指定するテキスト文字列です。スコープ名は、部門または地理的設定でTN3270Eサーバーのグループを識別するために使用できます。たとえば、スコープ名がBuilding-Dの場合、SLPセッションのバランスは、Building-Dスコープ内のすべてのTN3270Eサーバーを検索して、ロードされていないTN3270Eサーバーを見つけます。"
    },
    {
      "indent": 3,
      "text": "If the scope name is blank, then the scope name is not used. This is referred to as unscoped. It should be noted as in section 4.1 above that any reference to unscoped services applies to Service Location Protocol version 1 only [1]. Service Location Protocol version 2 doesn't allow unscoped services but does allow the use of default scope [4]. In this case all TN3270E servers, with or without scope names, can be used to satisfy the request for least loaded TN3270E servers. In order to cut down on network overhead, it is recommended that either all servers be scoped or no servers be scoped. Refer back to section 4.1 for more discussion of scope.",
      "ja": "スコープ名が空白の場合、スコープ名は使用されません。これは、unscopedと呼ばれます。上記のセクション4.1のように、Unscopedサービスへの参照はサービスロケーションプロトコルバージョン1のみに適用されることに注意する必要があります[1]。Service Location Protocolバージョン2では、非クープされたサービスが許可されていませんが、デフォルトスコープ[4]の使用が許可されています。この場合、スコープ名の有無にかかわらず、すべてのTN3270Eサーバーを使用して、最小のロードされたTN3270Eサーバーのリクエストを満たすことができます。ネットワークオーバーヘッドを削減するには、すべてのサーバーをスコープするか、サーバーをスコープしないことをお勧めします。範囲の詳細については、セクション4.1を参照してください。"
    },
    {
      "indent": 3,
      "text": "DA Discovery Time Out Value",
      "ja": "DAディスカバリータイムアウト値"
    },
    {
      "indent": 3,
      "text": "This value is specified in milliseconds and is fully described in section 4.2 of this document.",
      "ja": "この値はミリ秒単位で指定されており、このドキュメントのセクション4.2で完全に説明されています。"
    },
    {
      "indent": 3,
      "text": "SA Multicast Time Out Value",
      "ja": "SAマルチキャストタイムアウト値"
    },
    {
      "indent": 3,
      "text": "This value is specified in milliseconds and is fully described in section 4.3 of this document.",
      "ja": "この値はミリ秒単位で指定されており、このドキュメントのセクション4.3で完全に説明されています。"
    },
    {
      "indent": 0,
      "text": "5.2 How to obtain the list of TN3270E servers supporting SLP",
      "section_title": true,
      "ja": "5.2 SLPをサポートするTN3270Eサーバーのリストを取得する方法"
    },
    {
      "indent": 3,
      "text": "A TN3270E client that implements SLP session balancing uses API calls to obtain the list of TN3270E servers supporting SLP session balancing.",
      "ja": "SLPセッションのバランスを実装するTN3270Eクライアントは、API呼び出しを使用して、SLPセッションのバランスをサポートするTN3270Eサーバーのリストを取得します。"
    },
    {
      "indent": 3,
      "text": "The following Service Location Version 2 API [5] calls, could be used with TN3270E SLP session balancing:",
      "ja": "次のサービスロケーションバージョン2 API [5]呼び出しは、TN3270E SLPセッションのバランスで使用できます。"
    },
    {
      "indent": 3,
      "text": "SLPOpen - returns an SLPHandle handle to be used",
      "ja": "slpopen-使用するslphandleハンドルを返します"
    },
    {
      "indent": 3,
      "text": "SLPFindSrvs - issues the query for services",
      "ja": "SLPFINDSRVS-サービスのクエリを発行します"
    },
    {
      "indent": 3,
      "text": "SLPFindAttrs - returns service attributes matching the attribute ids for the indicated service URL or service type.",
      "ja": "SLPFINDATTRS-指定されたサービスURLまたはサービスタイプの属性IDを一致させるサービス属性を返します。"
    },
    {
      "indent": 3,
      "text": "SLPClose - frees all resources associated with the handle.",
      "ja": "slpclose-ハンドルに関連付けられたすべてのリソースを解放します。"
    },
    {
      "indent": 0,
      "text": "5.3 TN3270E Sample Client Flow",
      "section_title": true,
      "ja": "5.3 TN3270Eサンプルクライアントフロー"
    },
    {
      "indent": 0,
      "text": "5.3.1 Open the SLP connection",
      "section_title": true,
      "ja": "5.3.1 SLP接続を開きます"
    },
    {
      "indent": 3,
      "text": "The TN3270E client must first open a handle with the SLP User Agent. For Service Location Protocol version 2, SLPOpen API call [5] The SA multicast time out and DA discovery time out values would be passed as parameters to the SLPOpen API call.",
      "ja": "TN3270Eクライアントは、最初にSLPユーザーエージェントを使用してハンドルを開く必要があります。サービスロケーションプロトコルバージョン2の場合、SLPOPEN APIコール[5] SAマルチキャストタイムアウトとDAディスカバリータイムアウト値は、SLPOPEN API呼び出しのパラメーターとして渡されます。"
    },
    {
      "indent": 0,
      "text": "5.3.2 Query the list of TN3270E servers",
      "section_title": true,
      "ja": "5.3.2 TN3270Eサーバーのリストをクエリします"
    },
    {
      "indent": 3,
      "text": "The TN3270E client then queries for the list of TN3270E servers supporting SLP. This is done by using the Service Request API call.",
      "ja": "TN3270Eクライアントは、SLPをサポートするTN3270Eサーバーのリストをクエリします。これは、サービスリクエストAPI呼び出しを使用して行われます。"
    },
    {
      "indent": 3,
      "text": "The request string contains information that determines which type of TN3270E servers that this client desires to connect to. The request string can contain the scope name, pool name, session type and 3270 screen size.",
      "ja": "要求文字列には、このクライアントが接続したいTN3270Eサーバーのタイプを決定する情報が含まれています。要求文字列には、スコープ名、プール名、セッションタイプ、3270画面サイズを含めることができます。"
    },
    {
      "indent": 3,
      "text": "The SLPv1 query string has the following format:",
      "ja": "SLPV1クエリ文字列には、次の形式があります。"
    },
    {
      "indent": 3,
      "text": "TN3270/<scope name>/LUPOOL/ == <pool name><TAB><device type>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The <scope name> is the name of the scope that is configured for the TN3270E client. If the scope is blank or null (unscoped request), then the scope is not inserted into the request string.",
      "ja": "<スコープ名>は、TN3270Eクライアント用に構成されているスコープの名前です。スコープが空白またはnull（unscoped request）の場合、スコープは要求文字列に挿入されません。"
    },
    {
      "indent": 3,
      "text": "The <pool name> is a 1 to 8 character upper case string that indicates the name of the pool to which the TN3270E client desires to connect. For SLP session balancing, the same pool name must be configured on different TN3270E servers.",
      "ja": "<プール名>は、TN3270Eクライアントが接続したいプールの名前を示す1〜8文字の高度な文字列です。SLPセッションバランスの場合、同じプール名を異なるTN3270Eサーバーで構成する必要があります。"
    },
    {
      "indent": 3,
      "text": "The <TAB> is the '/t' tab character which is hexadecimal 0x09. the <TAB> is a literal and is used as a separator.",
      "ja": "<tab>は、16進0x09である「/t」タブ文字です。<tab>は文字通りで、セパレーターとして使用されます。"
    },
    {
      "indent": 3,
      "text": "The <device type> can be any of the following:",
      "ja": "<デバイスタイプ>は次のいずれかにすることができます。"
    },
    {
      "indent": 4,
      "text": "3270DSC for TN3270E device type IBM-3287-1 3270002 for TN3270E device types IBM-3278-2 and IBM-3278-2-E 3270003 for TN3270E device types IBM-3278-3 and IBM-3278-3-E 3270004 for TN3270E device types IBM-3278-4 and IBM-3278-4-E 3270005 for TN3270E device types IBM-3278-5 and IBM-3278-5-E * for TN3270E device type IBM-DYNAMIC",
      "ja": "TN3270Eの3270DSCデバイスタイプIBM-3287-1 3270002 TN3270EデバイスタイプIBM-3278-2およびIBM-3278-2-E 3270003タイプIBM-3278-4およびIBM-3278-4-E 3270005 TN3270EデバイスタイプIBM-3278-5およびIBM-3278-5-E *"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 3,
      "text": "For a TN3270E client searching for TN3270E servers in the ENGINEERING scope for a model 2 screen size and LUPOOL name pool2, the following request SLPv1 string would be constructed:",
      "ja": "モデル2スクリーンサイズとループール名プール2のエンジニアリング範囲でTN3270Eサーバーを検索するTN3270Eクライアントの場合、次の要求SLPV1文字列が構築されます。"
    },
    {
      "indent": 3,
      "text": "\"TN3270/ENGINEERING/LUPOOL/ == POOL2<TAB>3270002\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Note: The \" characters before and after the string are not part of the request string.",
      "ja": "注：「文字列の前後の文字は、要求文字列の一部ではありません。"
    },
    {
      "indent": 0,
      "text": "5.3.3 Forward Looking Example for SLPv2",
      "section_title": true,
      "ja": "5.3.3 SLPV2の前向きな例"
    },
    {
      "indent": 3,
      "text": "For SLPv2 the scope and service type are no longer part of the query string. These are now separate fields in the message. The service type name is required to have the \"service:\" prepended. The service type field would look like \"service:TN3270\", and the scope field would be a comma separated list of scopes. A scope name is always required in SLPv2, if no other name is known, the scope name \"DEFAULT\" is used. The example below uses the same parameters as used in above section 5.3.2.",
      "ja": "SLPV2の場合、スコープとサービスタイプはクエリ文字列の一部ではなくなりました。これらは、メッセージ内の個別のフィールドになりました。「サービス：サービス：」が必要です。サービスタイプフィールドは「サービス：TN3270」のように見え、スコープフィールドはスコープのコンマ分離リストになります。SLPV2では常にスコープ名が必要です。他の名前がわからない場合、スコープ名「デフォルト」が使用されます。以下の例は、上記のセクション5.3.2で使用されているのと同じパラメーターを使用します。"
    },
    {
      "indent": 3,
      "text": "Example: Service Type: service:TN3270 Scope string: ENGINEERING The query string would have the following format:",
      "ja": "例：サービスタイプ：サービス：TN3270スコープ文字列：エンジニアリングクエリ文字列には次の形式があります。"
    },
    {
      "indent": 11,
      "text": "(LUPOOL=<POOL2> <32700002>)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In SLPv2 queries, all whitespace is compressed to a single space character during matching, so the identity of the separator character does not matter. The tab character could be added for readability, but it will not affect the outcome of the query.",
      "ja": "SLPV2クエリでは、すべての空白がマッチング中に単一のスペース文字に圧縮されるため、セパレーター文字のアイデンティティは重要ではありません。タブ文字は読みやすくするために追加できますが、クエリの結果には影響しません。"
    },
    {
      "indent": 0,
      "text": "5.3.4 Determine loading of each TN3270E server",
      "section_title": true,
      "ja": "5.3.4 各TN3270Eサーバーのロードを決定します"
    },
    {
      "indent": 3,
      "text": "An attribute request for \"service:tn3270e\" specifying the attribute LOAD can be made and you will get back all the available loads. Say these are 35,88,78. You can then issue a service request for all tn3270E servers with \"LOAD<40\" for instance. Even if the load changes between the time you get the attribute reply and when you issue the request, you will still get the best the network has to offer.",
      "ja": "属性負荷を指定する「サービス：TN3270E」の属性要求を作成すると、利用可能なすべての負荷を取り戻すことができます。これらが35,88,78だとします。その後、たとえば「Load <40」ですべてのTN3270Eサーバーのサービスリクエストを発行できます。属性の返信を取得するまでに負荷が変更されたとしても、リクエストを発行した場合でも、ネットワークが提供する最善を尽くします。"
    },
    {
      "indent": 3,
      "text": "The TN3270E client then uses the TN3270E server's IP Host address to start normal Telnet TN3270E negotiation.",
      "ja": "TN3270Eクライアントは、TN3270EサーバーのIPホストアドレスを使用して、通常のTELNET TN3270Eネゴシエーションを開始します。"
    },
    {
      "indent": 0,
      "text": "5.4 Recommendations",
      "section_title": true,
      "ja": "5.4 推奨事項"
    },
    {
      "indent": 3,
      "text": "The TN3270E client SHOULD display the IP hostname and TCP Port that is being used for the TN3270E connection. This gives the user knowledge of which TN3270E server the session is connected to. For example, the IP host address could be displayed in the window system status bar.",
      "ja": "TN3270Eクライアントは、TN3270E接続に使用されているIPホスト名とTCPポートを表示する必要があります。これにより、ユーザーにセッションが接続されているTN3270Eサーバーの知識が得られます。たとえば、IPホストアドレスをウィンドウシステムステータスバーに表示できます。"
    },
    {
      "indent": 3,
      "text": "The TN3270E client SHOULD display the resource name that is returned by the TN3270E server after connection and TN3270E negotiation is completed. This gives the user knowledge of which LU resource name in the LUPOOL the session is connected to. For example, the resource name could be displayed in the Windows status bar, or even in the 3270 OIA line.",
      "ja": "TN3270Eクライアントは、接続後にTN3270Eサーバーによって返されるリソース名を表示する必要があり、TN3270Eネゴシエーションが完了します。これにより、セッションが接続されているループールのLUリソース名の知識がユーザーになります。たとえば、リソース名は、Windowsステータスバー、または3270 OIAラインに表示できます。"
    },
    {
      "indent": 3,
      "text": "In the event that after the TN3270E client has determined the least loaded server and the connection to that server fails for some reason, the connection should be closed and an attempt made to connect to other TN3270E servers in the list of least loaded servers.",
      "ja": "TN3270Eクライアントがロードされたサーバーが最小になり、そのサーバーへの接続が何らかの理由で失敗した後、接続を閉じ、最小限のロードサーバーのリストの他のTN3270Eサーバーに接続しようとする試みが行われた場合。"
    },
    {
      "indent": 3,
      "text": "For example, a TN3270E server may reject a connection to a specific pool if the pool is full, or if the device type does not match what is available in the pool. If this occurs, then an attempt to other least loaded TN3270E servers SHOULD be performed.",
      "ja": "たとえば、TN3270Eサーバーは、プールがいっぱいの場合、またはデバイスタイプがプールで利用可能なものと一致しない場合、特定のプールへの接続を拒否する場合があります。これが発生した場合、他の最も負荷のないTN3270Eサーバーへの試みを実行する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. Sample Trace Flow of SLP and Session Balancing",
      "section_title": true,
      "ja": "6. SLPのトレースフローとセッションバランスをサンプリングします"
    },
    {
      "indent": 3,
      "text": "This sample trace flow is provided for informational purposes only.",
      "ja": "このサンプルトレースフローは、情報提供のみで提供されます。"
    },
    {
      "indent": 3,
      "text": "SLP API: Service Request: TN3270//LUPOOL == POOL2 3270002/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "SLP API: Service Reply: service:tn3270://206.109.45.139:23",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "SLP API: Service Reply: service:tn3270://206.109.45.140:23",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Connecting to 206.109.45.139:23...",
      "ja": "206.109.45.139:23への接続..."
    },
    {
      "indent": 3,
      "text": "TerminalType=NVT",
      "ja": "TerminalType = nvt"
    },
    {
      "indent": 3,
      "text": "Connection established",
      "ja": "接続が確立されました"
    },
    {
      "indent": 3,
      "text": "Recv <- DO TN3270E",
      "ja": "recv <-do tn3270e"
    },
    {
      "indent": 3,
      "text": "Send -> WILL TN3270E",
      "ja": "send-> will tn3270e"
    },
    {
      "indent": 3,
      "text": "TerminalType=TN3270E",
      "ja": "TerminalType = TN3270E"
    },
    {
      "indent": 3,
      "text": "Recv <- SEND DEVICE_TYPE\n   Send -> DEVICE_TYPE REQUEST IBM-3278-2-E CONNECT POOL2",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Recv <- DEVICE_TYPE IS IBM-3278-2-E CONNECT TN8003",
      "ja": "Recv <-Device_TypeはIBM-3278-2-E Connect TN8003です"
    },
    {
      "indent": 3,
      "text": "Send -> FUNCTIONS REQUEST BIND_IMAGE SYSREQ",
      "ja": "send-> functions bind_image sysreqを要求します"
    },
    {
      "indent": 3,
      "text": "Recv <- FUNCTIONS IS BIND_IMAGE SYSREQ",
      "ja": "recv < - 関数はbind_image sysreqです"
    },
    {
      "indent": 0,
      "text": "7. Service Templates and Service Registration",
      "section_title": true,
      "ja": "7. サービステンプレートとサービス登録"
    },
    {
      "indent": 3,
      "text": "The Service Location Protocol uses the \"service:\" URL scheme name to define URLs called \"service: URLs\". These schemes provide a way for clients to obtain configuration information that is needed to establish a 3270 session through the TN3270E server. The Service Location Protocol provides for service: URLs to be registered and discovered.",
      "ja": "Service Location Protocolでは、「サービス：」というURLスキーム名を使用して、「サービス：URLS」と呼ばれるURLを定義します。これらのスキームは、クライアントがTN3270Eサーバーを介して3270セッションを確立するために必要な構成情報を取得する方法を提供します。Service Location Protocolは、登録および検出されるURLを提供します。"
    },
    {
      "indent": 3,
      "text": "Service Registration These service registrations contain a service: URL, and possible attributes associated with that service. The service registration information are shown below for the server.",
      "ja": "サービス登録これらのサービス登録には、サービスに関連する可能性のある属性が含まれています。そのサービスに関連付けられています。サービス登録情報は、サーバーの以下に示されています。"
    },
    {
      "indent": 3,
      "text": "Service Templates Service templates are documents defining in a formal way the attributes associated with that service that a client may want to use. For more information on service templates please refer to, Service Templates and service: Schemes. [2]. The server service template and TN3270 service templates are shown below.",
      "ja": "サービステンプレートサービステンプレートは、クライアントが使用したいサービスに関連する属性を正式な方法で定義するドキュメントです。サービステンプレートの詳細については、サービステンプレートとサービス：スキームを参照してください。[2]。サーバーサービステンプレートとTN3270サービステンプレートを以下に示します。"
    },
    {
      "indent": 0,
      "text": "7.1 The TN3270E Service Type Template",
      "section_title": true,
      "ja": "7.1 TN3270Eサービスタイプテンプレート"
    },
    {
      "indent": 3,
      "text": "The 'service:tn3270:' template defined below conforms to the grammar described in \"Service Templates and service: Schemes\". Please refer to [2] for detailed explanation of the syntax.",
      "ja": "「サービス：TN3270： '以下に定義されているテンプレートは、「サービステンプレートとサービス：スキーム」に記載されている文法に準拠しています。構文の詳細な説明については、[2]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Name of submitters: Jim Naugle <jnaugle@us.ibm.com> Gregg Ledford <gledford@zephyrcorp.com> K. Kasthurirangan <kasthuri@us.ibm.com> Language of service template: en Security Considerations: Service Location Protocol can help clients discover security services supported by the TN3270E server. If security services are important or required, using SLP authentication, and protected scopes in Service Location Protocol version 1 is recommended [1]. Well known ciphersuite names are used in the template [3].",
      "ja": "提出者の名前：Jim Naugle <jnaugle@us.ibm.com> Gregg ledford <gledford@zephyrcorp.com> K. Kasthurirangan <kasthuri@us.ibm.com>サービステンプレート：セキュリティ上の考慮事項：サービスロケーションプロトコルが役立つことができますクライアントは、TN3270Eサーバーによってサポートされているセキュリティサービスを発見します。セキュリティサービスが重要または必要な場合は、SLP認証を使用し、サービスのプロトコルバージョン1で保護されたスコープを推奨します[1]。よく知られているciphersuite名はテンプレートで使用されています[3]。"
    },
    {
      "indent": 3,
      "text": "Template text:\n----------------------template begins here -------------------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "template-type=tn3270e",
      "ja": "Template-Type = TN3270E"
    },
    {
      "indent": 3,
      "text": "template-version=1.0",
      "ja": "テンプレート-version = 1.0"
    },
    {
      "indent": 3,
      "text": "template-description= The tn3270 service provides 3270 gateway access to an SNA network via the TN3270 protocol. The attributes reflect the types of 3270 devices, LU Pools, and load information available on the server.",
      "ja": "TEMPLATE-DSCRIPTION = TN3270サービスは、TN3270プロトコルを介してSNAネットワークへの3270ゲートウェイアクセスを提供します。属性は、サーバーで利用可能な3270デバイス、LUプール、ロード情報のタイプを反映しています。"
    },
    {
      "indent": 3,
      "text": "template-url-syntax=\n# service:tn3270://<hostname>:<port>\n# <hostname>\n# <port>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "load=integer # This is the load balancing quantity to use in determining the # least loaded TN3270E server to attach to for the service. The #range of valid values is an integral 0 to 100 with 0 indicating the #lowest possible load and 100 the highest",
      "ja": "Load = Integer＃これは、サービスに添付する＃最小ロードされたTN3270Eサーバーを決定する際に使用する負荷分散量です。有効な値の#rangeは積分0〜100で、#lowestの可能な負荷を示し、100が最高を示しています"
    },
    {
      "indent": 3,
      "text": "LUPool=string X M L\n# This attribute takes on one or more values as defined below.\n# The <TAB> char.  0x09 is literal and will be used as a separator.\n#\n#\n#   <pool name> = <name> / <name> \"<TAB>\" <dev type>\n#   <name>      = 1*ALPHANUM\n#                 \"3270DSC\"\n#\n#\n#\n#\n# Identifies the LU pool names of LU pools available for use on this\n# service with the associated device types supported in each pool.\n# Each value is a record where the first token is the pool name of\n# the pool and the second token is a device type supported in that\n# pool.  A pool name without a device type indicates that LUs of\n# unknown type are included in the pool.  Records associated with a\n# given pool name are repeated for each supported device type.  A\n# given pool is included in a registration request if any PU profile\n# that contributes at least one LU to the pool is active on the\n# server.  The range of valid dev_types are:\n#\n# dev_type    Meaning\n#",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "# 3270002 Lu Type 2 Model 2 # # 3270003 Lu Type 2 Model 3 # # 3270004 Lu Type 2 Model 4 # # 3270005 Lu Type 2 Model 5 # # 3270DSC Printer LU #",
      "ja": "＃3270002 LUタイプ2モデル2"
    },
    {
      "indent": 3,
      "text": "BIND=keyword # The server supports the SNA bind image TN3270E function.",
      "ja": "bind = keyword＃サーバーは、SNAバインド画像TN3270E関数をサポートします。"
    },
    {
      "indent": 3,
      "text": "DATA=keyword # The non-SNA 3270 data stream is supported by server.",
      "ja": "データ=キーワード＃非SNA 3270データストリームはサーバーによってサポートされています。"
    },
    {
      "indent": 3,
      "text": "RESPONSES=keyword # The server supports SNA response mode.",
      "ja": "応答=キーワード＃サーバーはSNA応答モードをサポートします。"
    },
    {
      "indent": 3,
      "text": "SCS=keyword # The server supports SNA 3270 SCS data stream.",
      "ja": "SCS =キーワード＃サーバーはSNA 3270 SCSデータストリームをサポートしています。"
    },
    {
      "indent": 3,
      "text": "SYSREQ=keyword # The SYSREQ keyboard key is supported on server.",
      "ja": "sysreq = keyword＃sysreqキーボードキーはサーバーでサポートされています。"
    },
    {
      "indent": 3,
      "text": "RFC1576=keyword # RFC1576 options supported.",
      "ja": "RFC1576 =キーワード＃RFC1576オプションがサポートされています。"
    },
    {
      "indent": 3,
      "text": "RFC1646=keyword # RFC1646 options supported.",
      "ja": "RFC1646 =キーワード＃RFC1646オプションがサポートされています。"
    },
    {
      "indent": 3,
      "text": "RFC2355=keyword # RFC2355 options supported.",
      "ja": "RFC2355 =キーワード＃RFC2355オプションがサポートされています。"
    },
    {
      "indent": 3,
      "text": "security=string M # This is the security technique supported on the server. # The defined values are: NONE SSLV3",
      "ja": "セキュリティ=文字列M＃これはサーバーでサポートされるセキュリティ手法です。＃定義された値は次のとおりです。なしSSLV3"
    },
    {
      "indent": 3,
      "text": "Ciphersuites=string M # Cipher specifications supported by this server. # Additional values will be defined in future templates. NULL_NULL, NULL_MD5, NULL_SHA, RC4_MD5_EXPORT, RC4_MD5_US, RC4_SHA_US, RC2_MD5_EXPORT, DES_SHA_EXPORT, TRIPLE_DES_SHA_US",
      "ja": "ciphersuites =文字列M＃このサーバーでサポートされているCipher仕様。＃追加の値は、将来のテンプレートで定義されます。null_null、null_md5、null_sha、rc4_md5_export、rc4_md5_us、rc4_sha_us、rc2_md5_export、des_sha_export、triple_des_sha_us"
    },
    {
      "indent": 3,
      "text": "platform=string X\n# This is the network operating system platform underlying the\n# advertising service.  The defined values are:\n#\n# IW          Server uses IntranetWare or NetWare operating system\n#\n# NT          Server uses the Microsoft NT operating system\n#\n# OS2         Server uses the OS2 operating system\n#\n# AIX         Server uses the AIX operating system\n#\nIW,NT,OS2,AIX",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "protocol=string X # This is the protocol(s) supported by the server providing this # service. The defined values are: # # IP Server supports client connections over IP (TCP/IP or # UDP/IP) # # IPX Server supports client connections over IPX (SPX/IPX) # IP,IPX",
      "ja": "Protocol = string x＃これは、この＃サービスを提供するサーバーによってサポートされるプロトコルです。定義された値は次のとおりです。＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃ipxサーバーは、ipx（spx/ipx）＃ip、ipx経由のクライアント接続をサポートしています"
    },
    {
      "indent": 3,
      "text": "server name=string # This is the name of the server that was configured during # installation.",
      "ja": "サーバー名=文字列＃これは、＃インストール中に構成されたサーバーの名前です。"
    },
    {
      "indent": 3,
      "text": "release=string X # This is the version and release level of the server advertising # services. Its format is vv.rr.mm where \"vv\" is the major version # number, \"rr\" is the minor version number, and \"mm\" is the # modification level. All numbers are padded on the left with zeroes # to two characters. # Example: version 3, release 0, mod level 0 is \"03.00.00\"",
      "ja": "リリース=文字列X＃これは、サーバー広告＃サービスのバージョンとリリースレベルです。その形式はVV.RR.MMで、「VV」はメジャーバージョン＃番号、「RR」はマイナーバージョン番号、「MM」は＃修正レベルです。すべての数字は、左側にゼロ＃から2文字のパッドで埋められています。＃例：バージョン3、リリース0、modレベル0は「03.00.00」です"
    },
    {
      "indent": 3,
      "text": "------------------template ends here -------------------------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7.2 Server Service Type Template",
      "section_title": true,
      "ja": "7.2 サーバーサービスタイプテンプレート"
    },
    {
      "indent": 3,
      "text": "The 'service:commserver:' template defined below conforms to the grammar described in \"Service Templates and service: Schemes\". Please refer to [2] for detailed explanation of the syntax.",
      "ja": "「サービス：Commserver： '以下に定義されているテンプレート」は、「サービステンプレートとサービス：スキーム」に記載されている文法に準拠しています。構文の詳細な説明については、[2]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Name of submitters: Jim Naugle <jnaugle@us.ibm.com> Gregg Ledford <gledford@zephyrcorp.com> K. Kasthurirangan <kasthuri@us.ibm.com> Language of service template: en Security Considerations: Service Location Protocol can help clients discover security services supported by the TN3270E server. If security services are important or required, using SLP authentication, and protected scopes [1] is recommended.",
      "ja": "提出者の名前：Jim Naugle <jnaugle@us.ibm.com> Gregg ledford <gledford@zephyrcorp.com> K. Kasthurirangan <kasthuri@us.ibm.com>サービステンプレート：セキュリティ上の考慮事項：サービスロケーションプロトコルが役立つことができますクライアントは、TN3270Eサーバーによってサポートされているセキュリティサービスを発見します。セキュリティサービスが重要または必要な場合は、SLP認証を使用し、保護されたスコープ[1]を使用して推奨されます。"
    },
    {
      "indent": 3,
      "text": "Template text:",
      "ja": "テンプレートテキスト："
    },
    {
      "indent": 3,
      "text": "-------------------template begins below this line------------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "template-type=commserver",
      "ja": "Template-Type = commserver"
    },
    {
      "indent": 3,
      "text": "template-version=1.0",
      "ja": "テンプレート-version = 1.0"
    },
    {
      "indent": 3,
      "text": "template-description= The server service type is registered whenever the communications software is loaded on the server. It describes generic attributes of the server. These attributes are also repeated on the other service types provided.",
      "ja": "Template-description =サーバーサービスタイプは、通信ソフトウェアがサーバーにロードされるたびに登録されます。サーバーの一般的な属性について説明します。これらの属性は、提供された他のサービスタイプでも繰り返されます。"
    },
    {
      "indent": 3,
      "text": "template-url-syntax=\n # service:commserver://<hostname>:<port>\n # <hostname>\n # <port>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "platform=string X\n # This is the network operating system platform underlying the\n # advertising service.  The defined values are:\n #\n # IW          Server uses Novell IntranetWare or NetWare operating\n #             system\n # NT          Server uses the Microsoft NT operating system\n #\n # OS2         Server uses the OS2 operating system\n #\n # AIX         Server uses the AIX operating system\n #\n IW,NT,OS2,AIX",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "protocol=string X # This is the protocol(s) supported by the server providing this # service. The defined values are: # # IP Server supports client connections over IP (TCP/IP or # UDP/IP) # # IPX Server supports client connections over IPX (SPX/IPX) # IP,IPX",
      "ja": "Protocol = string x＃これは、この＃サービスを提供するサーバーによってサポートされるプロトコルです。定義された値は次のとおりです。＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃＃ipxサーバーは、ipx（spx/ipx）＃ip、ipx経由のクライアント接続をサポートしています"
    },
    {
      "indent": 3,
      "text": "server name=string # This is the name of the server that was configured during # installation.",
      "ja": "サーバー名=文字列＃これは、＃インストール中に構成されたサーバーの名前です。"
    },
    {
      "indent": 3,
      "text": "release=string X # This is the version and release level of the commserver # advertising services. Its format is vv.rr.mm where \"vv\" is the # major version number, \"rr\" is the minor version number, and \"mm\" # is the modification level. All numbers are padded on the left with # zeroes to two characters. # # Example: version 3, release 0, mod level 0 is \"03.00.00\"",
      "ja": "リリース=文字列X＃これは、Commserver＃広告サービスのバージョンとリリースレベルです。その形式はVV.RR.MMで、「VV」は＃メジャーバージョン番号、「RR」はマイナーバージョン番号、「MM」＃は変更レベルです。すべての数字は、左側に＃ゼロで2文字のパッドで埋められています。＃＃例：バージョン3、リリース0、modレベル0は「03.00.00」です"
    },
    {
      "indent": 3,
      "text": "---------------------template ends above this line---------------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7.3 Template Contact Information",
      "section_title": true,
      "ja": "7.3 テンプレートの連絡先情報"
    },
    {
      "indent": 3,
      "text": "Jim Naugle <jnaugle@us.ibm.com>\nKasthuri Kasthurirangan <kasthuri@us.ibm.com>\nGregg Ledford <gledford@zephyrcorp.com>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7.4 Security Considerations",
      "section_title": true,
      "ja": "7.4 セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Service type templates provide information that is used to interpret information obtained by the Service Location Protocol. If these templates are modified or if false templates are distributed, services may not correctly register themselves, or clients might not be able to interpret service information.",
      "ja": "サービスタイプテンプレートは、サービスロケーションプロトコルによって取得された情報を解釈するために使用される情報を提供します。これらのテンプレートが変更されている場合、または誤ったテンプレートが配布されている場合、サービスは正しく登録されない場合や、クライアントがサービス情報を解釈できない場合があります。"
    },
    {
      "indent": 3,
      "text": "The service: URLs themselves specify the service access point and protocol for a particular service type. These service: URLs could be distributed and indicate the location of a service other than that normally wanted to used. SLP [1] provides an authentication mechanism that allows service: URLs of registered services to be signed and for the signatures to be verified by clients.",
      "ja": "サービス：URL自体は、特定のサービスタイプのサービスアクセスポイントとプロトコルを指定します。これらのサービス：URLを配布し、通常使用したい以外のサービスの場所を示すことができます。SLP [1]は、登録サービスのURLを署名し、署名をクライアントによって検証できるようにする認証メカニズムを提供します。"
    },
    {
      "indent": 3,
      "text": "Service Location Protocol can help clients discover security services supported by the TN3270E server. If security services are important or required, using SLP authentication, and protected scopes [1] is recommended.",
      "ja": "サービスロケーションプロトコルは、クライアントがTN3270Eサーバーでサポートされているセキュリティサービスを発見するのに役立ちます。セキュリティサービスが重要または必要な場合は、SLP認証を使用し、保護されたスコープ[1]を使用して推奨されます。"
    },
    {
      "indent": 0,
      "text": "7.5 Sample TN3270 Service Registration Message",
      "section_title": true,
      "ja": "7.5 サンプルTN3270サービス登録メッセージ"
    },
    {
      "indent": 3,
      "text": "URL: service:tn3270://<addr-spec>:<port-number> Attributes:",
      "ja": "URL：サービス：TN3270：// <AddR-Spec>：<port-Number>属性："
    },
    {
      "indent": 3,
      "text": "[(SCOPE=<string>),]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "(RELEASE=03.00.00),",
      "ja": "（リリース= 03.00.00）、"
    },
    {
      "indent": 3,
      "text": "(PLATFORM=IW),",
      "ja": "（プラットフォーム= IW）、"
    },
    {
      "indent": 3,
      "text": "(PROTOCOL=IP),",
      "ja": "（プロトコル= IP）、"
    },
    {
      "indent": 3,
      "text": "(SERVERNAME=<string>),",
      "ja": "（servername = <string>）、"
    },
    {
      "indent": 3,
      "text": "(LOAD=<integer 0 to 100>),",
      "ja": "（load = <integer 0〜100>）、"
    },
    {
      "indent": 3,
      "text": "[(LUPOOL=pool-name0/tANY,",
      "ja": "[（lupool = pool-name0/tany、"
    },
    {
      "indent": 3,
      "text": "pool-name1/tdevice_type1,",
      "ja": "pool-name1/tdevice_type1、"
    },
    {
      "indent": 3,
      "text": "pool-name2/tdevice-type2, ...",
      "ja": "プール名2/デバイスタイプ2、..."
    },
    {
      "indent": 3,
      "text": "pool-namen/tdevice-typen)]",
      "ja": "プールナメン/tdevice-typen）]"
    },
    {
      "indent": 3,
      "text": "BIND,",
      "ja": "練る、"
    },
    {
      "indent": 3,
      "text": "DATA,",
      "ja": "データ、"
    },
    {
      "indent": 3,
      "text": "RESPONSES,",
      "ja": "反応、"
    },
    {
      "indent": 3,
      "text": "SCS,",
      "ja": "SCS、"
    },
    {
      "indent": 3,
      "text": "SYSREQ,",
      "ja": "sysreq、"
    },
    {
      "indent": 3,
      "text": "(SECURITY=NONE),",
      "ja": "（セキュリティ=なし）、"
    },
    {
      "indent": 3,
      "text": "RFC1576,",
      "ja": "RFC1576、"
    },
    {
      "indent": 3,
      "text": "RFC1646,",
      "ja": "RFC1646、"
    },
    {
      "indent": 3,
      "text": "RFC2355",
      "ja": "RFC2355"
    },
    {
      "indent": 0,
      "text": "7.6 Sample Server Service Registration Message",
      "section_title": true,
      "ja": "7.6 サンプルサーバーサービス登録メッセージ"
    },
    {
      "indent": 3,
      "text": "URL:service:commserver://<addr-spec>:<port-number>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Attributes:  [(SCOPE=<string>),]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "(RELEASE=03.00.00),",
      "ja": "（リリース= 03.00.00）、"
    },
    {
      "indent": 3,
      "text": "(PLATFORM=IW),",
      "ja": "（プラットフォーム= IW）、"
    },
    {
      "indent": 3,
      "text": "(PROTOCOL=IP),",
      "ja": "（プロトコル= IP）、"
    },
    {
      "indent": 3,
      "text": "(SERVERNAME=<string>)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Veizades, J., Guttman, E., Perkins, C., and S. Kaplan, \"Service Location Protocol\", RFC 2165, July 1997.",
      "ja": "[1] Veizades、J.、Guttman、E.、Perkins、C。、およびS. Kaplan、「Service Location Protocol」、RFC 2165、1997年7月。"
    },
    {
      "indent": 3,
      "text": "[2] Guttman, E., Perkins, C. and J. Kempf, \"Service Templates and service: Schemes\", RFC 2609, June 1999.",
      "ja": "[2] Guttman、E.、Perkins、C。and J. Kempf、「サービステンプレートとサービス：スキーム」、RFC 2609、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[3] Dierks, T. and C. Allen, \"The TLS Protocol Version 1.0\", RFC 2246, January 1999.",
      "ja": "[3] Dierks、T。およびC. Allen、「TLSプロトコルバージョン1.0」、RFC 2246、1999年1月。"
    },
    {
      "indent": 3,
      "text": "[4] Guttman, E., Perkins, C., Veizades, J. and M. Day, \"Service Location Protocol Version 2\", RFC 2608, June 1999.",
      "ja": "[4] Guttman、E.、Perkins、C.、Veizades、J。and M. Day、「Service Location Protocolバージョン2」、RFC 2608、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[5] Kempf, J. and E. Guttman, \"An API for Service Location\", RFC 2614, June 1999.",
      "ja": "[5] Kempf、J。およびE. Guttman、「サービス場所のAPI」、RFC 2614、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[6] Bradner, S., \"Key Words for Use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[6] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "9. Authors' Addresses",
      "section_title": true,
      "ja": "9. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jim Naugle IBM P.O. Box 12195 Research Triangle Park, N.C. 27709-2195 USA",
      "ja": "ジム・ノーグル・イブムP.O.Box 12195 Research Triangle Park、N.C。27709-2195 USA"
    },
    {
      "indent": 3,
      "text": "Phone: (919) 254-8789 EMail: jnaugle@us.ibm.com",
      "ja": "電話：（919）254-8789メール：jnaugle@us.ibm.com"
    },
    {
      "indent": 3,
      "text": "Kasthuri Kasthurirangan IBM P.O. Box 12195 Research Triangle Park, N.C. 27709-2195 USA",
      "ja": "Kasthuri Kasthurirangan Ibm P.O.Box 12195 Research Triangle Park、N.C。27709-2195 USA"
    },
    {
      "indent": 3,
      "text": "Phone: (919) 254-5721 EMail: kasthuri@us.ibm.com",
      "ja": "電話：（919）254-5721メール：kasthuri@us.ibm.com"
    },
    {
      "indent": 3,
      "text": "Gregg Ledford Zephyr Development Corporation 8 Greenway Plaza Suite 1400 Houston, Texas 77046 USA",
      "ja": "グレッグレッドフォードゼファー開発コーポレーション8グリーンウェイプラザスイート1400テキサス州ヒューストン77046 USA"
    },
    {
      "indent": 3,
      "text": "Phone: (713) 623-0089 EMail: gledford@zephyrcorp.com",
      "ja": "電話：（713）623-0089メール：gledford@zephyrcorp.com"
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "ja": "10. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}