{
  "title": {
    "text": "RFC 3574 - Transition Scenarios for 3GPP Networks",
    "ja": "RFC 3574 - 3GPPネットワークの遷移シナリオ"
  },
  "number": 3574,
  "created_at": "2023-10-21 05:17:33.223646+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                   J. Soininen, Ed.\nRequest for Comments: 3574                                         Nokia\nCategory: Informational                                      August 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 16,
      "text": "Transition Scenarios for 3GPP Networks",
      "ja": "3GPPネットワークの遷移シナリオ"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes different scenarios in Third Generation Partnership Project (3GPP) defined packet network, i.e., General Packet Radio Service (GPRS) that would need IP version 6 and IP version 4 transition. The focus of this document is on the scenarios where the User Equipment (UE) connects to nodes in other networks, e.g., in the Internet. GPRS network internal transition scenarios, i.e., between different GPRS elements in the network, are out of scope. The purpose of the document is to list the scenarios for further discussion and study.",
      "ja": "このドキュメントでは、第三世代のパートナーシッププロジェクト（3GPP）定義されたパケットネットワーク、つまりIPバージョン6およびIPバージョン4トランジションが必要な一般的なパケットラジオサービス（GPRS）のさまざまなシナリオについて説明します。このドキュメントの焦点は、ユーザー機器（UE）が他のネットワーク、たとえばインターネットのノードに接続するシナリオにあります。GPRSネットワーク内部遷移シナリオ、つまり、ネットワーク内の異なるGPRS要素間は範囲外です。ドキュメントの目的は、さらに議論と研究のためにシナリオをリストすることです。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Scope of the Document. . . . . . . . . . . . . . . . . . . . .  2\n3.  Brief Description of the 3GPP Network Environment. . . . . . .  2\n    3.1 GPRS Architecture Basics . . . . . . . . . . . . . . . . .  3\n    3.2 IP Multimedia Core Network Subsystem (IMS) . . . . . . . .  3\n4.  Transition Scenarios . . . . . . . . . . . . . . . . . . . . .  5\n    4.1 GPRS Scenarios . . . . . . . . . . . . . . . . . . . . . .  5\n    4.2 IMS Scenarios  . . . . . . . . . . . . . . . . . . . . . .  8\n5.  Security Considerations. . . . . . . . . . . . . . . . . . . .  9\n6.  Contributing Authors . . . . . . . . . . . . . . . . . . . . . 10\n7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 10\n8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 10\n    8.1.  Normative References . . . . . . . . . . . . . . . . . . 10\n    8.2.  Informative References . . . . . . . . . . . . . . . . . 11\n9.  Editor's Address . . . . . . . . . . . . . . . . . . . . . . . 11\n10. Full Copyright Statement . . . . . . . . . . . . . . . . . . . 12",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document describes the transition scenarios in 3GPP packet data networks that might come up in the deployment phase of IPv6. The main purpose of this document is to identify and to document those scenarios for further discussion and study them in the v6ops working group.",
      "ja": "このドキュメントでは、IPv6の展開フェーズで登場する可能性のある3GPPパケットデータネットワークの遷移シナリオについて説明します。このドキュメントの主な目的は、これらのシナリオを特定し、さらに議論するために文書化し、V6OPSワーキンググループでそれらを研究することです。"
    },
    {
      "indent": 3,
      "text": "Just a brief overview of the 3GPP packet data network, GPRS, is given to help the reader to better understand the transition scenarios. A better overview of the 3GPP specified GPRS can be found for example from [6]. The GPRS architecture is defined in [1].",
      "ja": "3GPPパケットデータネットワークであるGPRSの簡単な概要が与えられ、読者が遷移シナリオをよりよく理解できるようになります。3GPP指定されたGPRSのより良い概要は、[6]から例えて見つけることができます。GPRSアーキテクチャは[1]で定義されています。"
    },
    {
      "indent": 0,
      "text": "2. Scope of the Document",
      "section_title": true,
      "ja": "2. ドキュメントの範囲"
    },
    {
      "indent": 3,
      "text": "The scope is to describe the possible transition scenarios in the 3GPP defined GPRS network where a UE connects to, or is contacted from, the Internet or another UE. The document describes scenarios with and without the usage of the SIP-based (Session Initiation Protocol [5]) IP Multimedia Core Network Subsystem (IMS). The 3GPP releases 1999, 4, and 5 are considered as the basis.",
      "ja": "範囲は、UEがインターネットまたは別のUEに接続する、または接触する3GPP定義のGPRSネットワークの遷移シナリオを記述することです。このドキュメントでは、SIPベースの（セッション開始プロトコル[5]）IPマルチメディアコアネットワークサブシステム（IMS）の使用の有無にかかわらずシナリオについて説明します。3GPPリリース1999、4、および5は基礎と見なされます。"
    },
    {
      "indent": 3,
      "text": "Out of scope are scenarios inside the GPRS network, i.e., on the different interfaces of the GPRS network. This document neither changes 3GPP specifications, nor proposes changes to the current specifications.",
      "ja": "範囲外は、GPRSネットワーク内のシナリオ、つまりGPRSネットワークのさまざまなインターフェイスにあります。このドキュメントは、3GPP仕様を変更せず、現在の仕様の変更を提案しません。"
    },
    {
      "indent": 3,
      "text": "In addition, the possible transition scenarios are described. The solutions will be documented in a separate document.",
      "ja": "さらに、可能な遷移シナリオについて説明します。ソリューションは別のドキュメントに文書化されます。"
    },
    {
      "indent": 3,
      "text": "All the possible scenarios are listed here. Further analysis may show that some of the scenarios are not actually relevant in this context.",
      "ja": "考えられるシナリオはすべてここにリストされています。さらなる分析では、このコンテキストではシナリオの一部が実際には関連していないことが示される場合があります。"
    },
    {
      "indent": 0,
      "text": "3. Brief Description of the 3GPP Network Environment",
      "section_title": true,
      "ja": "3. 3GPPネットワーク環境の簡単な説明"
    },
    {
      "indent": 3,
      "text": "This section describes the most important concepts of the 3GPP environment for understanding the transition scenarios. The first part of the description gives a brief overview to the GPRS network as such. The second part concentrates on the IP Multimedia Core Network Subsystem (IMS).",
      "ja": "このセクションでは、遷移シナリオを理解するための3GPP環境の最も重要な概念について説明します。説明の最初の部分は、GPRSネットワークの簡単な概要を示しています。2番目の部分は、IPマルチメディアコアネットワークサブシステム（IMS）に集中しています。"
    },
    {
      "indent": 0,
      "text": "3.1. GPRS Architecture Basics",
      "section_title": true,
      "ja": "3.1. GPRSアーキテクチャの基本"
    },
    {
      "indent": 3,
      "text": "This section gives an overview to the most important concepts of the 3GPP packet architecture. For more detailed description, please see [1].",
      "ja": "このセクションでは、3GPPパケットアーキテクチャの最も重要な概念の概要を説明します。詳細については、[1]を参照してください。"
    },
    {
      "indent": 3,
      "text": "From the point of view of this document, the most relevant 3GPP architectural elements are the User Equipment (UE), and the Gateway GPRS Support Node (GGSN). A simplified picture of the architecture is shown in Figure 1.",
      "ja": "このドキュメントの観点から見ると、最も関連性の高い3GPPアーキテクチャ要素は、ユーザー機器（UE）とゲートウェイGPRSサポートノード（GGSN）です。構造の単純化された画像を図1に示します。"
    },
    {
      "indent": 3,
      "text": "The UE is the mobile phone. It can either be an integrated device comprising a combined GPRS part, and the IP stack, or it might be a separate GPRS device, and separate equipment with the IP stack, e.g., a laptop.",
      "ja": "UEは携帯電話です。組み合わせたGPRS部品とIPスタックを含む統合デバイスであるか、別のGPRSデバイスであり、IPスタック、たとえばラップトップを備えた個別の機器である可能性があります。"
    },
    {
      "indent": 3,
      "text": "The GGSN serves as an anchor-point for the GPRS mobility management. It also serves as the default router for the UE.",
      "ja": "GGSNは、GPRSモビリティ管理のアンカーポイントとして機能します。また、UEのデフォルトルーターとしても機能します。"
    },
    {
      "indent": 3,
      "text": "The Peer node mentioned in the picture refers to a node with which the UE is communicating.",
      "ja": "写真に記載されているピアノードは、UEが通信しているノードを指します。"
    },
    {
      "indent": 5,
      "text": " --         ----       ************       ---------\n|UE|- ... -|GGSN|--+--* IPv4/v6 NW *--+--|Peer node|\n --         ----       ************       ---------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Figure 1: Simplified GPRS Architecture",
      "ja": "図1：簡略化されたGPRSアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "There is a dedicated link between the UE and the GGSN called the Packet Data Protocol (PDP) Context. This link is created through the PDP Context activation process. During the activation the UE is configured with its IP address and other information needed to maintain IP access, e.g., DNS server address. There are three different types of PDP Contexts: IPv4, IPv6, and Point-to-Point Protocol (PPP).",
      "ja": "UEとPacket Data Protocol（PDP）コンテキストと呼ばれるGGSNの間には専用のリンクがあります。このリンクは、PDPコンテキストアクティベーションプロセスを通じて作成されます。アクティベーション中、UEはIPアドレスと、DNSサーバーアドレスなどのIPアクセスを維持するために必要なその他の情報で構成されます。PDPコンテキストには、IPv4、IPv6、およびポイントツーポイントプロトコル（PPP）の3つの異なるタイプがあります。"
    },
    {
      "indent": 3,
      "text": "A UE can have one or more simultaneous PDP Contexts open to the same or to different GGSNs. The PDP Context can be either of the same or different types.",
      "ja": "UEは、同じまたは異なるGGSNに開かれた1つ以上の同時のPDPコンテキストを持つことができます。PDPコンテキストは、同じタイプまたは異なるタイプのいずれかです。"
    },
    {
      "indent": 0,
      "text": "3.2. IP Multimedia Core Network Subsystem (IMS)",
      "section_title": true,
      "ja": "3.2. IPマルチメディアコアネットワークサブシステム（IMS）"
    },
    {
      "indent": 3,
      "text": "IP Multimedia Core Network Subsystem (IMS) is an architecture for supporting multimedia services via a SIP infrastructure. It is specified in 3GPP Release 5. This section provides an overview of the 3GPP IMS and is not intended to be comprehensive. A more detailed description can be found in [2], [3] and [4].",
      "ja": "IPマルチメディアコアネットワークサブシステム（IMS）は、SIPインフラストラクチャを介してマルチメディアサービスをサポートするためのアーキテクチャです。3GPPリリース5で指定されています。このセクションでは、3GPP IMSの概要を説明し、包括的であることを意図していません。より詳細な説明は、[2]、[3]、[4]に記載されています。"
    },
    {
      "indent": 3,
      "text": "The IMS comprises a set of SIP proxies, servers, and registrars. In addition, there are Media Gateways (MGWs) that offer connections to non-IP networks such as the Public Switched Telephony Network (PSTN). A simplified overview of the IMS is depicted in figure 2.",
      "ja": "IMSは、一連のSIPプロキシ、サーバー、およびレジストラで構成されています。さらに、Public Switched Telephony Network（PSTN）などの非IPネットワークへの接続を提供するメディアゲートウェイ（MGW）があります。IMSの単純化された概要を図2に示します。"
    },
    {
      "indent": 5,
      "text": "        +-------------+  +-------------------------------------+\n        |             |  |                           +------+  |\n        |             |  |                           |S-CSCF|---\n  |     |             |  |                           +------+  |\n+-|+    |             |  |                            /        |\n|  |    |   SIP Sig.  |  |    +------+          +------+       |\n|  |----|------+------|--|----|P-CSCF|----------|I-CSCF|       |\n|  |    |             |  |    +------+          +------+       |\n|  |-----------+------------------------------------------------\n+--+    |  User traf. |  |                                     |\n UE     |             |  |                                     |\n        | GPRS access |  |     IP Multimedia CN Subsystem      |\n        +-------------+  +-------------------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "Figure 2: Overview of the 3GPP IMS architecture",
      "ja": "図2：3GPP IMSアーキテクチャの概要"
    },
    {
      "indent": 3,
      "text": "The SIP proxies, servers, and registrars shown in Figure 2 are as follows.",
      "ja": "図2に示すSIPプロキシ、サーバー、およびレジストラは次のとおりです。"
    },
    {
      "indent": 5,
      "text": "- P-CSCF (Proxy-Call Session Control Function) is the first contact point within the IMS for the subscriber.",
      "ja": "- P-CSCF（プロキシコールセッション制御機能）は、サブスクライバーのIMS内の最初の接触点です。"
    },
    {
      "indent": 5,
      "text": "- I-CSCF (Interrogating-CSCF) is the contact point within an operator's network for all connections destined to a subscriber of that network operator, or a roaming subscriber currently located within that network operator's service area.",
      "ja": "- I-CSCF（Interrogating-CSCF）は、そのネットワークオペレーターのサブスクライバー、またはそのネットワークオペレーターのサービスエリア内に現在配置されているローミングサブスクライバーに向けられたすべての接続のオペレーターのネットワーク内の接触点です。"
    },
    {
      "indent": 5,
      "text": "- S-CSCF (Serving-CSCF) performs the session control services for the subscriber. It also acts as a SIP Registrar.",
      "ja": "- S-CSCF（サービングCSCF）は、サブスクライバーのセッション制御サービスを実行します。また、SIPレジストラとしても機能します。"
    },
    {
      "indent": 3,
      "text": "IMS capable UEs utilize the GPRS network as an access network for accessing the IMS. Thus, a UE has to have an activated PDP Context to the IMS before it can proceed to use the IMS services. The PDP Context activation is explained briefly in section 3.1.",
      "ja": "IMS有能uesは、GPRSネットワークをIMSにアクセスするためのアクセスネットワークとして利用しています。したがって、UEはIMSサービスを使用する前に、IMSに対して有効化されたPDPコンテキストを持たなければなりません。PDPコンテキストのアクティベーションについては、セクション3.1で簡単に説明します。"
    },
    {
      "indent": 3,
      "text": "The IMS is exclusively IPv6. Thus, the activated PDP Context is of PDP Type IPv6. This means that a 3GPP IP Multimedia terminal uses exclusively IPv6 to access the IMS, and the IMS SIP server and proxy support exclusively IPv6. Hence, all the traffic going to the IMS is IPv6, even if the UE is dual stack capable - this comprises both signaling and user traffic.",
      "ja": "IMSは独占的にIPv6です。したがって、アクティブ化されたPDPコンテキストはPDPタイプIPv6です。これは、3GPP IPマルチメディア端末がIMSのみにアクセスするためにのみIPv6を使用し、IMS SIPサーバーとプロキシはIPv6のみをサポートすることを意味します。したがって、UEがデュアルスタックが能力であっても、IMSに送られるすべてのトラフィックはIPv6です。これは、シグナリングとユーザートラフィックの両方で構成されています。"
    },
    {
      "indent": 3,
      "text": "This, of course, does not prevent the usage of other unrelated services (e.g., corporate access) on IPv4.",
      "ja": "もちろん、これはIPv4での他の無関係なサービス（例：コーポレートアクセス）の使用を妨げません。"
    },
    {
      "indent": 0,
      "text": "4. Transition Scenarios",
      "section_title": true,
      "ja": "4. 遷移シナリオ"
    },
    {
      "indent": 3,
      "text": "This section is divided into two main parts - GPRS scenarios, and scenarios with the IP Multimedia Subsystem (IMS). The first part - GPRS scenarios - concentrates on scenarios with a User Equipment (UE) connecting to services in the Internet, e.g., mail, web. The second part - IMS scenarios - then describes how an IMS capable UE can connect to other SIP-capable nodes in the Internet using the IMS services.",
      "ja": "このセクションは、GPRSシナリオとIPマルチメディアサブシステム（IMS）のシナリオの2つの主要な部分に分割されています。最初の部分-GPRSシナリオ - インターネット内のサービスに接続するユーザー機器（UE）を使用してシナリオに集中します。たとえば、メール、Web。2番目の部分 -  IMSシナリオ - は、IMSサービスを使用してIMS対応のUEがインターネット内の他のSIP対応ノードにどのように接続できるかを説明します。"
    },
    {
      "indent": 0,
      "text": "4.1. GPRS Scenarios",
      "section_title": true,
      "ja": "4.1. GPRSシナリオ"
    },
    {
      "indent": 3,
      "text": "This section describes the scenarios that might occur when a GPRS UE contacts services, or nodes outside the GPRS network, e.g., web-server in the Internet.",
      "ja": "このセクションでは、GPRSがサービスに連絡したときに発生する可能性のあるシナリオ、またはGPRSネットワークの外側のノード、たとえばインターネットのWebサーバーなどについて説明します。"
    },
    {
      "indent": 3,
      "text": "Transition scenarios of the GPRS internal interfaces are outside of the scope of this document.",
      "ja": "GPRS内部インターフェイスの遷移シナリオは、このドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "The following scenarios are described here. In all of the scenarios, the UE is part of a network where there is at least one router of the same IP version, i.e., GGSN, and it is connecting to a node in a different network.",
      "ja": "次のシナリオについては、ここで説明します。すべてのシナリオで、UEは同じIPバージョン、つまりGGSNの少なくとも1つのルーターがあるネットワークの一部であり、別のネットワーク内のノードに接続しています。"
    },
    {
      "indent": 3,
      "text": "The scenarios here apply also for PDP Context type Point-to-Point Protocol (PPP) where PPP is terminated at the GGSN. On the other hand, where the PPP PDP Context is terminated e.g., at an external ISP, the environment is the same as for general ISP cases.",
      "ja": "ここでのシナリオは、PDPコンテキストタイプポイントツーポイントプロトコル（PPP）にも適用されます。ここで、PPPはGGSNで終了します。一方、PPP PDPコンテキストが終了する場合、例：外部ISPでは、環境は一般的なISPの場合と同じです。"
    },
    {
      "indent": 6,
      "text": "1) Dual Stack UE connecting to IPv4 and IPv6 nodes 2) IPv6 UE connecting to an IPv6 node through an IPv4 network 3) IPv4 UE connecting to an IPv4 node through an IPv6 network 4) IPv6 UE connecting to an IPv4 node 5) IPv4 UE connecting to an IPv6 node",
      "ja": "1) IPv4およびIPv6ノードに接続するデュアルスタックUE 2）IPv4ネットワークを介してIPv6ノードに接続するIPv6 UE 3）IPv6ネットワークを介してIPv4ノードに接続するIPv4 UE 4）IPv4ノードに接続するIPv6 UEIPv6ノード"
    },
    {
      "indent": 3,
      "text": "1) Dual Stack UE connecting to IPv4 and IPv6 nodes",
      "ja": "1) IPv4およびIPv6ノードに接続するデュアルスタックUE"
    },
    {
      "indent": 6,
      "text": "The GPRS system has been designed in a manner that there is the possibility to have simultaneous IPv4, and IPv6 PDP Contexts open. Thus, in cases where the UE is dual stack capable, and in the network there is a GGSN (or separate GGSNs) that supports both connections to IPv4 and IPv6 networks, it is possible to connect to both at the same time. Figure 3 depicts this scenario.",
      "ja": "GPRSシステムは、同時のIPv4とIPv6 PDPコンテキストを開く可能性があるように設計されています。したがって、UEがデュアルスタックに対応する場合、ネットワークには、IPv4とIPv6ネットワークへの両方の接続をサポートするGGSN（または個別のGGSN）があります。同時に両方に接続することができます。図3は、このシナリオを示しています。"
    },
    {
      "indent": 7,
      "text": "+-------------+\n|             |\n|     UE      |                                    +------+\n|             |                                    | IPv4 |\n|             |                                   /|      |\n|------|------+                                  / +------+\n| IPv6 | IPv4 |                     +--------+  /\n+-------------+       IPv4          |        | /\n    |      |------------------------|        |/\n    |                               |        |\n    |                 IPv6          |  GGSN  |\\\n    |-------------------------------|        | \\\n                    +-----------+   |        |  \\  +------+\n                    | GPRS Core |   |        |   \\ | IPv6 |\n                    +-----------+   +--------+    \\|      |\n                                                   +------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Figure 3: Dual-Stack Case",
      "ja": "図3：デュアルスタックケース"
    },
    {
      "indent": 6,
      "text": "However, the IPv4 addresses may be a scarce resource for the mobile operator or an ISP. In that case, it might not be possible for the UE to have a globally unique IPv4 address allocated all the time. Hence, the UE could either activate the IPv4 PDP Context only when needed, or be allocated an IPv4 address from a private address space.",
      "ja": "ただし、IPv4アドレスは、モバイルオペレーターまたはISPにとって希少なリソースである可能性があります。その場合、UEが常にグローバルに一意のIPv4アドレスを割り当てていることは不可能かもしれません。したがって、UEは、必要なときにのみIPv4 PDPコンテキストをアクティブにするか、プライベートアドレススペースからIPv4アドレスを割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "2) IPv6 UE connecting to an IPv6 node through an IPv4 network",
      "ja": "2) IPv4ネットワークを介してIPv6ノードに接続するIPv6UE"
    },
    {
      "indent": 6,
      "text": "Especially in the initial stages of IPv6 deployment, there are cases where an IPv6 node would need to connect to the IPv6 Internet through a network that is IPv4. For instance, this can be seen in current fixed networks, where the access is provided via IPv4 only, but there is an IPv6 network deeper in the Internet. This scenario is shown in Figure 4.",
      "ja": "特にIPv6展開の初期段階では、IPv6ノードがIPv4であるネットワークを介してIPv6インターネットに接続する必要がある場合があります。たとえば、これは現在の固定ネットワークで見ることができます。ここでは、アクセスはIPv4を介してのみ提供されますが、インターネットにはIPv6ネットワークが深くなっています。このシナリオを図4に示します。"
    },
    {
      "indent": 8,
      "text": "+------+                  +------+\n|      |                  |      |                 +------+\n|  UE  |------------------|      |-----------------|      |\n|      |    +-----------+ | GGSN |     +---------+ | IPv6 |\n| IPv6 |    | GPRS Core | |      |     | IPv4 Net| |      |\n+------+    +-----------+ +------+     +---------+ +------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 16,
      "text": "Figure 4: IPv6 nodes communicating over IPv4",
      "ja": "図4：IPv4を介して通信するIPv6ノード"
    },
    {
      "indent": 6,
      "text": "In this case, in the GPRS system, the UE would be IPv6 capable, and the GPRS network would provide an IPv6 capable GGSN in the network. However, there is an IPv4 network between the GGSN, and the peer node.",
      "ja": "この場合、GPRSシステムでは、UEはIPv6対応になり、GPRSネットワークはネットワークでIPv6対応GGSNを提供します。ただし、GGSNとピアノードの間にはIPv4ネットワークがあります。"
    },
    {
      "indent": 3,
      "text": "3) IPv4 UE connecting to an IPv4 node through an IPv6 network",
      "ja": "3) IPv6ネットワークを介してIPv4ノードに接続するIPv4UE"
    },
    {
      "indent": 6,
      "text": "Further in the future, there are cases where the legacy UEs are still IPv4 only, capable of connecting only to the legacy IPv4 Internet. However, the GPRS operator network has already been upgraded to IPv6. Figure 5 represents this scenario.",
      "ja": "さらに、将来的には、レガシーUEがまだIPv4のみであり、レガシーIPv4インターネットにのみ接続できる場合があります。ただし、GPRSオペレーターネットワークはすでにIPv6にアップグレードされています。図5は、このシナリオを表しています。"
    },
    {
      "indent": 7,
      "text": "+------+                  +------+\n|      |                  |      |                 +------+\n|  UE  |------------------|      |-----------------|      |\n|      |    +-----------+ | GGSN |     +---------+ | IPv4 |\n| IPv4 |    | GPRS Core | |      |     | IPv6 Net| |      |\n+------+    +-----------+ +------+     +---------+ +------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "Figure 5: IPv4 nodes communicating over IPv6",
      "ja": "図5：IPv6を介して通信するIPv4ノード"
    },
    {
      "indent": 6,
      "text": "In this case, the operator would still provide an IPv4 capable GGSN, and a connection through the IPv6 network to the IPv4 Internet.",
      "ja": "この場合、オペレーターは引き続きIPv4対応GGSNを提供し、IPv6ネットワークを介してIPv4インターネットへの接続を提供します。"
    },
    {
      "indent": 3,
      "text": "4) IPv6 UE connecting to an IPv4 node",
      "ja": "4) IPv4ノードに接続するIPv6 UE"
    },
    {
      "indent": 6,
      "text": "In this scenario, an IPv6 UE connects to an IPv4 node in the IPv4 Internet. As an example, an IPv6 UE connects to an IPv4 web server in the legacy Internet. In the figure 6, this kind of possible installation is described.",
      "ja": "このシナリオでは、IPv6 UEがIPv4インターネットのIPv4ノードに接続します。例として、IPv6 UEはレガシーインターネットのIPv4 Webサーバーに接続します。図6では、この種の可能なインストールについて説明します。"
    },
    {
      "indent": 7,
      "text": "+------+                  +------+\n|      |                  |      |     +---+    +------+\n|  UE  |------------------|      |-----|   |----|      |\n|      |    +-----------+ | GGSN |     | ? |    | IPv4 |\n| IPv6 |    | GPRS Core | |      |     |   |    |      |\n+------+    +-----------+ +------+     +---+    +------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Figure 6: IPv6 node communicating with IPv4 node",
      "ja": "図6：IPv4ノードと通信するIPv6ノード"
    },
    {
      "indent": 3,
      "text": "5) IPv4 UE connecting to an IPv6 node",
      "ja": "5) IPv4ノードに接続するIPv4 UE"
    },
    {
      "indent": 6,
      "text": "This is similar to the case above, but in the opposite direction. Here an IPv4 UE connects to an IPv6 node in the IPv6 Internet. As an example, a legacy IPv4 UE is connected to an IPv6 server in the IPv6 Internet. Figure 7 depicts this configuration.",
      "ja": "これは上記のケースに似ていますが、反対方向です。ここでは、IPv6インターネットのIPv4ノードに接続します。例として、Legacy IPv4 UEはIPv6インターネットのIPv6サーバーに接続されています。図7は、この構成を示しています。"
    },
    {
      "indent": 7,
      "text": "+------+                  +------+\n|      |                  |      |     +---+    +------+\n|  UE  |------------------|      |-----|   |----|      |\n|      |    +-----------+ | GGSN |     | ? |    | IPv6 |\n| IPv4 |    | GPRS Core | |      |     |   |    |      |\n+------+    +-----------+ +------+     +---+    +------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Figure 7: IPv4 node communicating with IPv6 node",
      "ja": "図7：IPv6ノードと通信するIPv4ノード"
    },
    {
      "indent": 0,
      "text": "4.2. IMS Scenarios",
      "section_title": true,
      "ja": "4.2. IMSシナリオ"
    },
    {
      "indent": 3,
      "text": "As described in section 3.2, IMS is exclusively IPv6. Thus, the number of possible transition scenarios is reduced dramatically. In the following, the possible transition scenarios are listed.",
      "ja": "セクション3.2で説明されているように、IMSは独占的にIPv6です。したがって、可能な移行シナリオの数は劇的に減少します。以下では、可能な遷移シナリオがリストされています。"
    },
    {
      "indent": 6,
      "text": "1) UE connecting to a node in an IPv4 network through IMS 2) Two IPv6 IMS connected via an IPv4 network",
      "ja": "1) IMSを介してIPv4ネットワーク内のノードに接続するUE 2）IPv4ネットワークを介して接続されている2つのIPv6IMS"
    },
    {
      "indent": 3,
      "text": "1) UE connecting to a node in an IPv4 network through IMS",
      "ja": "1) IMSを介してIPv4ネットワーク内のノードに接続するUE"
    },
    {
      "indent": 6,
      "text": "This scenario occurs when an IMS UE (IPv6) connects to a node in the IPv4 Internet through the IMS, or vice versa. This happens when the other node is a part of a different system than 3GPP, e.g., a fixed PC, with only IPv4 capabilities. This scenario is shown in the Figure 8.",
      "ja": "このシナリオは、IMS UE（IPv6）がIMSを介してIPv4インターネットのノードに接続する場合、またはその逆の場合に発生します。これは、他のノードが3GPPとは異なるシステムの一部である場合に発生します。たとえば、IPv4機能のみを備えた固定PCです。このシナリオを図8に示します。"
    },
    {
      "indent": 7,
      "text": "+------+     +------+     +-----+\n|      |     |      |     |     |  +---+  +------+\n|  UE  |-...-|      |-----| IMS |--|   |--|      |\n|      |     | GGSN |     |     |  | ? |  | IPv4 |\n| IPv6 |     |      |     |     |  |   |  |      |\n+------+     +------+     +-----+  +---+  +------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Figure 8: IMS UE connecting to an IPv4 node",
      "ja": "図8：IPv4ノードに接続するIMS UE"
    },
    {
      "indent": 3,
      "text": "2) Two IPv6 IMS connected via an IPv4 network",
      "ja": "2) IPv4ネットワークを介して接続された2つのIPv6IMS"
    },
    {
      "indent": 6,
      "text": "At the early stages of IMS deployment, there may be cases where two IMS islands are only connected via an IPv4 network such as the legacy Internet. See Figure 9 for illustration.",
      "ja": "IMS展開の初期段階では、2つのIMS島がレガシーインターネットなどのIPv4ネットワークを介してのみ接続されている場合があります。図9を参照してください。"
    },
    {
      "indent": 7,
      "text": "+------+     +------+     +-----+          +-----+\n|      |     |      |     |     |          |     |\n|  UE  |-...-|      |-----| IMS |----------|     |\n|      |     | GGSN |     |     | +------+ | IMS |\n| IPv6 |     |      |     |     | | IPv4 | |     |\n+------+     +------+     +-----+ +------+ +-----+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Figure 9: Two IMS islands connected over IPv4",
      "ja": "図9：IPv4で接続されている2つのIMS島"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document describes possible transition scenarios for 3GPP networks for future study. Solutions and mechanism are explored in other documents. The description of the 3GPP network scenarios does not have any security issues.",
      "ja": "このドキュメントでは、将来の調査のための3GPPネットワークの可能な移行シナリオについて説明します。ソリューションとメカニズムは、他のドキュメントで検討されています。3GPPネットワークシナリオの説明には、セキュリティの問題はありません。"
    },
    {
      "indent": 0,
      "text": "6. Contributing Authors",
      "section_title": true,
      "ja": "6. 貢献している著者"
    },
    {
      "indent": 3,
      "text": "This document is a result of a joint effort of a design team. The members of the design team are listed in the following.",
      "ja": "このドキュメントは、設計チームの共同努力の結果です。デザインチームのメンバーは以下にリストされています。"
    },
    {
      "indent": 6,
      "text": "Alain Durand, Sun Microsystems <Alain.Durand@sun.com>",
      "ja": "Alain Durand、Sun Microsystems <alain.durand@sun.com>"
    },
    {
      "indent": 6,
      "text": "Karim El-Malki, Ericsson Radio Systems <Karim.El-Malki@era.ericsson.se>",
      "ja": "Karim El-Malki、Ericsson Radio Systems <Karim.el-malki@era.ericsson.se>"
    },
    {
      "indent": 6,
      "text": "Niall Richard Murphy, Enigma Consulting Limited <niallm@enigma.ie>",
      "ja": "Niall Richard Murphy、Enigma Consulting Limited <niallm@enigma.ie>"
    },
    {
      "indent": 6,
      "text": "Hugh Shieh, AT&T Wireless <hugh.shieh@attws.com>",
      "ja": "Hugh Shieh、AT＆T Wireless <hugh.shieh@attws.com>"
    },
    {
      "indent": 6,
      "text": "Jonne Soininen, Nokia <jonne.soininen@nokia.com>",
      "ja": "Jonne Soininen、Nokia <jonne.soininen@nokia.com>"
    },
    {
      "indent": 6,
      "text": "Hesham Soliman, Ericsson Radio Systems <hesham.soliman@era.ericsson.se>",
      "ja": "Hesham Soliman、Ericsson Radio Systems <hesham.soliman@era.ericsson.se>"
    },
    {
      "indent": 6,
      "text": "Margaret Wasserman, Wind River <mrw@windriver.com>",
      "ja": "マーガレットワッサーマン、ウィンドリバー<mrw@windriver.com>"
    },
    {
      "indent": 6,
      "text": "Juha Wiljakka, Nokia <juha.wiljakka@nokia.com>",
      "ja": "Juha Wiljakka、Nokia <juha.wiljakka@nokia.com>"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Basavaraj Patil, Tuomo Sipila, Fred Templin, Rod Van Meter, Pekka Savola, Francis Dupont, Christine Fisher, Alain Baudot, Rod Walsh, and Jens Staack for good input, and comments that helped writing this document.",
      "ja": "著者は、Basavaraj Patil、Tuomo Sipila、Fred Templin、Rod Van Meter、Pekka Savola、Francis Dupont、Christine Fisher、Alain Baudot、Rod Walsh、Jens Staackに感謝します。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[1] 3GPP TS 23.060 v 5.2.0, \"General Packet Radio Service (GPRS); Service description; Stage 2(Release 5)\", June 2002.",
      "ja": "[1] 3GPP TS 23.060 V 5.2.0、「General Packet Radio Service（GPRS）;サービス説明;ステージ2（リリース5）」、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[2] 3GPP TS 23.228 v 5.3.0, \" IP Multimedia Subsystem (IMS); Stage 2(Release 5)\", January 2002.",
      "ja": "[2] 3GPP TS 23.228 V 5.3.0、「IPマルチメディアサブシステム（IMS）、ステージ2（リリース5）」、2002年1月。"
    },
    {
      "indent": 3,
      "text": "[3] 3GPP TS 24.228 V5.0.0, \"Signalling flows for the IP multimedia call control based on SIP and SDP; Stage 3 (Release 5)\", March 2002.",
      "ja": "[3] 3GPP TS 24.228 V5.0.0、「SIPおよびSDPに基づくIPマルチメディアコールコントロールのシグナリングフロー、ステージ3（リリース5）」、2002年3月。"
    },
    {
      "indent": 3,
      "text": "[4] 3GPP TS 24.229 V5.0.0, \"IP Multimedia Call Control Protocol based on SIP and SDP; Stage 3 (Release 5)\", March 2002.",
      "ja": "[4] 3GPP TS 24.229 V5.0.0、「SIPとSDPに基づくIPマルチメディアコールコントロールプロトコル、ステージ3（リリース5）」、2002年3月。"
    },
    {
      "indent": 3,
      "text": "[5] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M. and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "ja": "[5] Rosenberg、J.、Schulzrinne、H.、Camarillo、G.、Johnston、A.、Peterson、J.、Sparks、R.、Handley、M.、E。Schooler、 \"SIP：SESSION INIATIATION Protocol\"、RFC 3261、2002年6月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[6] Wasserman, M., \"Recommendations for IPv6 in Third Generation Partnership Project (3GPP) Standards\", RFC 3314, September 2002.",
      "ja": "[6] Wasserman、M。、「第3世代パートナーシッププロジェクト（3GPP）規格におけるIPv6の推奨」、RFC 3314、2002年9月。"
    },
    {
      "indent": 0,
      "text": "9. Editor's Address",
      "section_title": true,
      "ja": "9. 編集者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jonne Soininen Nokia 313 Fairchild Dr. Mountain View, CA, USA",
      "ja": "Jonne Soininen Nokia 313 Fairchild Dr. Mountain View、CA、USA、"
    },
    {
      "indent": 3,
      "text": "Phone:  +1-650-864-6794\nEMail:  jonne.soininen@nokia.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "ja": "10. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会やその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}