{
  "title": {
    "text": "RFC 3197 - Applicability Statement for DNS MIB Extensions",
    "ja": "RFC 3197 - DNS MIB拡張機能の適用性ステートメント"
  },
  "number": 3197,
  "created_at": "2023-12-06 15:17:18.796397+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         R. Austein\nRequest for Comments: 3197                                 InterNetShare\nCategory: Informational                                    November 2001",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": "Applicability Statement for DNS MIB Extensions",
      "ja": "DNS MIB拡張機能の適用性ステートメント"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document explains why, after more than six years as proposed standards, the DNS Server and Resolver MIB extensions were never deployed, and recommends retiring these MIB extensions by moving them to Historical status.",
      "ja": "このドキュメントでは、提案された標準として6年以上後、DNSサーバーとリゾルバーMIB拡張機能が展開されなかった理由を説明し、これらのMIB拡張機能を歴史的地位に移動させることでこれらのMIB拡張機能を廃止することを推奨しています。"
    },
    {
      "indent": 0,
      "text": "1. History",
      "section_title": true,
      "ja": "1. 歴史"
    },
    {
      "indent": 3,
      "text": "The road to the DNS MIB extensions was paved with good intentions.",
      "ja": "DNS MIBエクステンションへの道は、善意で舗装されました。"
    },
    {
      "indent": 3,
      "text": "In retrospect, it's obvious that the working group never had much agreement on what belonged in the MIB extensions, just that we should have some. This happened during the height of the craze for MIB extensions in virtually every protocol that the IETF was working on at the time, so the question of why we were doing this in the first place never got a lot of scrutiny. Very late in the development cycle we discovered that much of the support for writing the MIB extensions in the first place had come from people who wanted to use SNMP SET operations to update DNS zones on the fly. Examination of the security model involved, however, led us to conclude that this was not a good way to do dynamic update and that a separate DNS Dynamic Update protocol would be necessary.",
      "ja": "振り返ってみると、ワーキンググループがMIBエクステンションに属しているものについてあまり合意したことがないことは明らかです。これは、IETFが当時取り組んでいたほぼすべてのプロトコルで、MIB拡張の流行の高さの間に起こったため、そもそもなぜこれを行っていたのかという問題は、多くの精査を受けませんでした。開発サイクルの非常に遅れて、そもそもMIB拡張機能を作成するためのサポートの多くが、SNMPセット操作を使用してDNSゾーンをその場で更新したい人から来ていることを発見しました。ただし、関連するセキュリティモデルの調査により、これは動的な更新を行う良い方法ではなく、別のDNSダイナミック更新プロトコルが必要であると結論付けることになりました。"
    },
    {
      "indent": 3,
      "text": "The MIB extensions started out being fairly specific to one particular DNS implementation (BIND-4.8.3); as work progressed, the BIND-specific portions were rewritten to be as implementation-neutral as we knew how to make them, but somehow every revision of the MIB extensions managed to create new counters that just happened to closely match statistics kept by some version of BIND. As a result, the MIB extensions ended up being much too big, which raised a number of concerns with the network management directorate, but the WG resisted every attempt to remove any of these variables. In the end, large portions of the MIB extensions were moved into optional groups in an attempt to get the required subset down to a manageable size.",
      "ja": "MIBエクステンションは、特定のDNS実装（Bind-4.8.3）にかなり固有のものです。作業が進むにつれて、バインド固有の部分は、それらを作成する方法を知っていたのと同じくらい実装中立になるように書き直されましたが、どういうわけか、MIB拡張機能のすべての改訂は、いくつかのバージョンによって保持されている統計を密接に一致させる新しいカウンターを作成することができました。練る。その結果、MIB拡張機能は大きすぎて大きくなり、ネットワーク管理局に多くの懸念を引き起こしましたが、WGはこれらの変数のいずれかを削除するあらゆる試みに抵抗しました。最終的に、必要なサブセットを管理可能なサイズに下げるために、MIB拡張機能の大部分がオプションのグループに移動されました。"
    },
    {
      "indent": 3,
      "text": "The DNS Server and Resolver MIB extensions were one of the first attempts to write MIB extensions for a protocol usually considered to be at the application layer. Fairly early on it became clear that, while it was certainly possible to write MIB extensions for DNS, the SMI was not really designed with this sort of thing in mind. A case in point was the attempt to provide direct indexing into the caches in the resolver MIB extensions: while arguably the only sane way to do this for a large cache, this required much more complex indexing clauses than is usual, and ended up running into known length limits for object identifiers in some SNMP implementations.",
      "ja": "DNSサーバーとResolver MIB拡張機能は、通常アプリケーションレイヤーと見なされるプロトコルのMIB拡張機能を書き込む最初の試みの1つでした。かなり早い段階で、DNSのMIB拡張機能を書くことは確かに可能であったが、SMIはこの種のことを念頭に置いて実際に設計されていないことが明らかになった。適切なケースは、Resolver MIB拡張機能のキャッシュへの直接インデックスを提供しようとする試みでした。間違いなく大規模なキャッシュでこれを行う唯一の正気な方法ですが、これには通常よりもはるかに複雑なインデックス作成条項が必要であり、最終的に走りました一部のSNMP実装におけるオブジェクト識別子の既知の長さ制限。"
    },
    {
      "indent": 3,
      "text": "Furthermore, the lack of either real proxy MIB support in SNMP managers or a standard subagent protocol meant that there was no reasonable way to implement the MIB extensions in the dominant implementation (BIND). When the AgentX subagent protocol was developed a few years later, we initially hoped that this would finally clear the way for an implementation of the DNS MIB extensions, but by the time AgentX was a viable protocol it had become clear that nobody really wanted to implement these MIB extensions.",
      "ja": "さらに、SNMPマネージャーにおける実際のプロキシMIBサポートまたは標準的なサブエージェントプロトコルのいずれかのいずれかが、支配的な実装（BIND）にMIB拡張機能を実装する合理的な方法がないことを意味しました。数年後にAgentX Subagentプロトコルが開発されたとき、当初、これがDNS MIB拡張機能の実装の方法を最終的にクリアすることを望んでいましたが、AgentXが実行可能なプロトコルであった頃には、誰も実際に実装したくないことが明らかになりました。これらのMIB拡張機能。"
    },
    {
      "indent": 3,
      "text": "Finally, the MIB extensions took much too long to produce. In retrospect, this should have been a clear warning sign, particularly when the WG had clearly become so tired of the project that the authors found it impossible to elicit any comments whatsoever on the documents.",
      "ja": "最後に、MIBエクステンションの生成に時間がかかりすぎました。振り返ってみると、これは明確な警告サインであったはずです。特に、WGがプロジェクトに非常に疲れていたため、著者は文書に関するコメントを何でも引き出すことは不可能だと感じました。"
    },
    {
      "indent": 0,
      "text": "2. Lessons",
      "section_title": true,
      "ja": "2. レッスン"
    },
    {
      "indent": 3,
      "text": "Observations based on the preceding list of mistakes, for the benefit of anyone else who ever attempts to write DNS MIB extensions again:",
      "ja": "DNS MIB拡張機能を再び書き込もうとする他の人の利益のために、過ちの前のリストに基づいた観察："
    },
    {
      "indent": 3,
      "text": "- Define a clear set of goals before writing any MIB extensions. Know who the constituency is and make sure that what you write solves their problem.",
      "ja": "- MIB拡張機能を作成する前に、明確な一連の目標を定義します。選挙区が誰であるかを知り、あなたが書いたものが彼らの問題を解決することを確認してください。"
    },
    {
      "indent": 3,
      "text": "- Keep the MIB extensions short, and don't add variables just because somebody in the WG thinks they'd be a cool thing to measure.",
      "ja": "- MIB拡張機能を短く保ち、WGの誰かが測定するのがクールだと思っているという理由だけで変数を追加しないでください。"
    },
    {
      "indent": 3,
      "text": "- If some portion of the task seems to be very hard to do within the SMI, that's a strong hint that SNMP is not the right tool for whatever it is that you're trying to do.",
      "ja": "- タスクの一部がSMI内で行うのが非常に難しいと思われる場合、それはSNMPがあなたがやろうとしていることは何でも適切なツールではないという強いヒントです。"
    },
    {
      "indent": 3,
      "text": "- If the entire project is taking too long, perhaps that's a hint too.",
      "ja": "- プロジェクト全体が時間がかかりすぎている場合、おそらくそれもヒントです。"
    },
    {
      "indent": 0,
      "text": "3. Recommendation",
      "section_title": true,
      "ja": "3. おすすめ"
    },
    {
      "indent": 3,
      "text": "In view of the community's apparent total lack of interest in deploying these MIB extensions, we recommend that RFCs 1611 and 1612 be reclassified as Historical documents.",
      "ja": "これらのMIB拡張機能の展開に関心があるコミュニティの明らかな完全な欠如を考慮して、RFCS 1611および1612を履歴文書として再分類することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Re-classifying an existing MIB document from Proposed Standard to Historic should not have any negative impact on security for the Internet.",
      "ja": "提案された基準から歴史的に既存のMIBドキュメントを再分類することは、インターネットのセキュリティにマイナスの影響を与えることはありません。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "Getting rid of the DNS MIB extensions should not impose any new work on IANA.",
      "ja": "DNS MIB拡張機能を取り除くことは、IANAに新しい作業を課すべきではありません。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6. 謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank all the people who were involved in this project over the years for their optimism and patience, misguided though it may have been.",
      "ja": "著者は、長年にわたってこのプロジェクトに関与していたすべての人々に、楽観主義と忍耐に感謝したいと思っています。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 3,
      "text": "[DNS-SERVER-MIB] Austein, R. and J. Saperia, \"DNS Server MIB Extensions\", RFC 1611, May 1994.",
      "ja": "[DNS-Server-Mib] Austein、R。およびJ. Saperia、「DNS Server MIB Extensions」、RFC 1611、1994年5月。"
    },
    {
      "indent": 3,
      "text": "[DNS-RESOLVER-MIB] Austein, R. and J. Saperia, \"DNS Resolver MIB Extensions\", RFC 1612, May 1994.",
      "ja": "[DNS-Resolver-Mib] Austein、R。およびJ. Saperia、「DNS Resolver MIB Extensions」、RFC 1612、1994年5月。"
    },
    {
      "indent": 3,
      "text": "[DNS-DYNAMIC-UPDATE] Vixie, P., Thomson, S., Rekhter, Y. and J. Bound, \"Dynamic Updates in the Domain Name System (DNS UPDATE)\", RFC 2136, April 1997.",
      "ja": "[DNS-Dynamic-Update] Vixie、P.、Thomson、S.、Rekhter、Y。およびJ. Bound、「ドメイン名システムの動的更新（DNSアップデート）」、RFC 2136、1997年4月。"
    },
    {
      "indent": 3,
      "text": "[AGENTX] Daniele, M., Wijnen, B., Ellison, M., and D. Francisco, \"Agent Extensibility (AgentX) Protocol Version 1\", RFC 2741, January 2000.",
      "ja": "[Agentx] Daniele、M.、Wijnen、B.、Ellison、M。、およびD. Francisco、「Agent Extensibility（AgentX）プロトコルバージョン1」、RFC 2741、2000年1月。"
    },
    {
      "indent": 0,
      "text": "8. Author's Address",
      "section_title": true,
      "ja": "8. 著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Rob Austein InterNetShare, Incorporated 325M Sharon Park Drive, Suite 308 Menlo Park, CA 94025 USA",
      "ja": "Rob Austein InternetShare、Incorporated 325m Sharon Park Drive、Suite 308 Menlo Park、CA 94025 USA"
    },
    {
      "indent": 3,
      "text": "EMail: sra@hactrn.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "ja": "9. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}