{
  "title": {
    "text": "RFC 3791 - Survey of IPv4 Addresses in Currently Deployed IETF Routing Area Standards Track and Experimental Documents",
    "ja": "RFC 3791 - IPv4の調査は、現在展開IETFルーティングエリア標準化過程と実験ドキュメント内のアドレス"
  },
  "number": 3791,
  "created_at": "2019-10-22 15:27:31.474881+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          C. Olvera\nRequest for Comments: 3791                                   Consulintel\nCategory: Informational                                    P. Nesser, II\n                                              Nesser & Nesser Consulting\n                                                               June 2004",
      "raw": true
    },
    {
      "indent": 6,
      "text": "       Survey of IPv4 Addresses in Currently Deployed\nIETF Routing Area Standards Track and Experimental Documents",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（C）インターネット協会（2004）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This investigation work seeks to document all usage of IPv4 addresses in currently deployed IETF Routing Area documented standards. In order to successfully transition from an all IPv4 Internet to an all IPv6 Internet, many interim steps will be taken. One of these steps is the evolution of current protocols that have IPv4 dependencies. It is hoped that these protocols (and their implementations) will be redesigned to be network address independent, but failing that will at least dually support IPv4 and IPv6. To this end, all Standards (Full, Draft, and Proposed) as well as Experimental RFCs will be surveyed and any dependencies will be documented.",
      "ja": "この調査の仕事は、IPv4のすべての使用は、現在配備IETFルーティングエリアに文書化規格に対応し文書化することを目指しています。正常にすべてのIPv6インターネットにすべてのIPv4インターネットから移行するために、多くの中間ステップが取られます。これらのステップの一つは、IPv4の依存関係を持っている現在のプロトコルの進化です。これらのプロトコル（およびその実装は）独立したネットワークアドレスに再設計されることが期待され、それに失敗すると、少なくとも二重IPv4およびIPv6をサポートします。このためには、すべての標準（フル、ドラフト、および提案された）だけでなく、実験的RFCが調査され、すべての依存関係が記載されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction. . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Document Organization . . . . . . . . . . . . . . . . . . . .   2\n3.  Full Standards. . . . . . . . . . . . . . . . . . . . . . . .   3\n4.  Draft Standards . . . . . . . . . . . . . . . . . . . . . . .   3\n5.  Proposed Standards. . . . . . . . . . . . . . . . . . . . . .   3\n6.  Experimental RFCs . . . . . . . . . . . . . . . . . . . . . .   7\n7.  Summary of Results. . . . . . . . . . . . . . . . . . . . . .   9\n8.  Security Considerations . . . . . . . . . . . . . . . . . . .  12\n9.  Acknowledgements. . . . . . . . . . . . . . . . . . . . . . .  12\n10. References. . . . . . . . . . . . . . . . . . . . . . . . . .  13\n    10.1. Normative References . . . . . . . . . . . . . . . . . . 13\n    10.2. Informative References . . . . . . . . . . . . . . . . . 13",
      "raw": true
    },
    {
      "indent": 3,
      "text": "11. Authors' Addresses. . . . . . . . . . . . . . . . . . . . . .  14\n12. Full Copyright Statement. . . . . . . . . . . . . . . . . . .  15",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This work aims to document all usage of IPv4 addresses in currently deployed IETF Routing Area documented standards. Also, throughout this document there are discussions on how routing protocols might be updated to support IPv6 addresses.",
      "ja": "この作品は、IPv4のすべての使用は、現在配備IETFルーティングエリアに文書化規格に対応し文書化することを目指しています。また、この文書全体のIPv6アドレスをサポートするように更新される可能性がありますどのようなルーティングプロトコルに関する議論があります。"
    },
    {
      "indent": 3,
      "text": "This material was originally presented within a single document, but in an effort to have the information in a manageable form, it has subsequently been split into 7 documents conforming to the current IETF main areas (Application [2], Internet [3], Operations & Management [4], Routing [this document], Security [5], Sub-IP [6] and Transport [7]).",
      "ja": "この材料は、もともと単一の文書内に提示されたが、管理可能な形式で情報を持たせる努力において、それは続いて（現在のIETFの主な領域に適合7つのドキュメントに分割されたアプリケーション[2]、インターネット[3]、オペレーション＆管理[4]、ルーティング[このドキュメント]、セキュリティ[5]、サブIP [6]と交通[7]）。"
    },
    {
      "indent": 3,
      "text": "The general overview, methodology used during documentation and scope of the investigation for the whole 7 documents can be found in the introduction of this set of documents [1].",
      "ja": "一般的な概要は、ドキュメント全体7つのドキュメントの調査の範囲中に使用される方法は、ドキュメントのこのセットの導入に見出すことができる[1]。"
    },
    {
      "indent": 3,
      "text": "It is important to mention that to perform this study the following classes of IETF standards are investigated: Full, Draft, and Proposed, as well as Experimental. Informational, BCP and Historic RFCs are not addressed. RFCs that have been obsoleted by either newer versions or as they have transitioned through the standards process are also not covered.",
      "ja": "フル、ドラフト、提案、同様の実験を：IETF標準の以下のクラスを調べている。この研究を実行することを言及することは重要です。情報、BCPや歴史的なRFCは対処されていません。いずれかの新しいバージョンによって廃止されているか、彼らは標準化プロセスを通じて移行したとしてもカバーされていないのRFC。"
    },
    {
      "indent": 0,
      "text": "2. Document Organization",
      "section_title": true,
      "ja": "2.本書の構成"
    },
    {
      "indent": 3,
      "text": "The main Sections of this document are described below.",
      "ja": "この文書の主なセクションは、以下に記載されています。"
    },
    {
      "indent": 3,
      "text": "Sections 3, 4, 5, and 6 each describe the raw analysis of Full, Draft, Proposed Standards and Experimental RFCs. Each RFC is discussed in its turn starting with RFC 1 and ending (around) RFC 3100. The comments for each RFC are \"raw\" in nature. That is, each RFC is discussed in a vacuum and problems or issues discussed do not \"look ahead\" to see if the problems have already been fixed.",
      "ja": "セクション3、4、5、及び6はそれぞれフル、ドラフト、提案された標準及び実験RFCの生の分析を記載します。各RFCは、各RFCのコメントは、自然の中で「生」であり、RFC 1から始まり、（周り）RFC 3100を終了し、その順番で説明されています。これは、各RFCは、問題はすでに修正されているかどうかを確認するために「先読み」していない議論真空や問題点や問題に議論されています。"
    },
    {
      "indent": 3,
      "text": "Section 7 is an analysis of the data presented in Sections 3, 4, 5, and 6. It is here that all of the results are considered as a whole and the problems that have been resolved in later RFCs are correlated.",
      "ja": "セクション7は、結果のすべてが全体としてみなされ、それ以降のRFCsで解決された問題が相関していることをここであり、セクション3に提示されたデータの分析である4、5、および6。"
    },
    {
      "indent": 0,
      "text": "3. Full Standards",
      "section_title": true,
      "ja": "3.フル・規格"
    },
    {
      "indent": 3,
      "text": "Full Internet Standards (most commonly simply referred to as \"Standards\") are fully mature protocol specification that are widely implemented and used throughout the Internet.",
      "ja": "（最も一般的に、単に「基準」という。）のフルインターネット規格は広く実装し、インターネット全体で使用されている完全に成熟したプロトコル仕様です。"
    },
    {
      "indent": 0,
      "text": "3.1. (STD 57) RIP Version 2 Protocol Applicability Statement",
      "section_title": true,
      "ja": "3.1.  （STD 57）RIPバージョン2プロトコルに適用ステートメント"
    },
    {
      "indent": 3,
      "text": "RIPv2 is only intended for IPv4 networks.",
      "ja": "RIPv2のは、IPv4ネットワークのみを対象としています。"
    },
    {
      "indent": 0,
      "text": "3.2. (STD 54) OSPF Version 2",
      "section_title": true,
      "ja": "3.2.  （STD 54）OSPFバージョン2"
    },
    {
      "indent": 3,
      "text": "This RFC defines a protocol for IPv4 routing. It is highly assumptive about address formats being IPv4 in nature.",
      "ja": "このRFCは、IPv4ルーティングのためのプロトコルを定義します。それは自然の中でのIPv4であるアドレス形式について非常に仮定です。"
    },
    {
      "indent": 0,
      "text": "3.3. (STD 56) RIP Version 2",
      "section_title": true,
      "ja": "3.3.  （STD 56）RIPバージョン2"
    },
    {
      "indent": 3,
      "text": "RIPv2 is only intended for IPv4 networks.",
      "ja": "RIPv2のは、IPv4ネットワークのみを対象としています。"
    },
    {
      "indent": 0,
      "text": "4. Draft Standards",
      "section_title": true,
      "ja": "4.ドラフト規格"
    },
    {
      "indent": 3,
      "text": "Draft Standards represent the penultimate standard level in the IETF. A protocol can only achieve draft standard when there are multiple, independent, interoperable implementations. Draft Standards are usually quite mature and widely used.",
      "ja": "ドラフト規格は、IETFにおける最後から二番目の標準レベルを表します。プロトコルは、複数の独立した、相互運用可能な実装がある場合にドラフト標準を達成することができます。ドラフト規格は通常、非常に成熟し、広く使用されています。"
    },
    {
      "indent": 0,
      "text": "4.1. A Border Gateway Protocol 4 (BGP-4)",
      "section_title": true,
      "ja": "4.1. ボーダーゲートウェイプロトコル4（BGP-4）"
    },
    {
      "indent": 3,
      "text": "This RFC defines a protocol used for exchange of IPv4 routing information and does not support IPv6 as is defined.",
      "ja": "このRFCは、IPv4ルーティング情報の交換に使用されるプロトコルを定義し、定義されたとおりでIPv6をサポートしていません。"
    },
    {
      "indent": 0,
      "text": "4.2. Application of the Border Gateway Protocol in the Internet",
      "ja": "4.2. インターネットでのボーダゲイトウェイプロトコルの応用"
    },
    {
      "indent": 3,
      "text": "This RFC is a discussion of the use of BGP-4 on the Internet.",
      "ja": "このRFCは、インターネット上のBGP-4の使用についての考察です。"
    },
    {
      "indent": 0,
      "text": "4.3. Capabilities Advertisement with BGP-4",
      "section_title": true,
      "ja": "4.3.  BGP-4と機能広告"
    },
    {
      "indent": 3,
      "text": "Although the protocol enhancements have no IPv4 dependencies, the base protocol, BGP-4, is IPv4 only.",
      "ja": "プロトコルの拡張はないIPv4の依存性を持たないが、基本プロトコル、BGP-4は、IPv4のみです。"
    },
    {
      "indent": 0,
      "text": "5. Proposed Standards",
      "section_title": true,
      "ja": "5.提案された標準"
    },
    {
      "indent": 3,
      "text": "Proposed Standards are introductory level documents. There are no requirements for even a single implementation. In many cases Proposed are never implemented or advanced in the IETF standards process. They therefore are often just proposed ideas that are presented to the Internet community. Sometimes flaws are exposed or they are one of many competing solutions to problems. In these later cases, no discussion is presented as it would not serve the purpose of this discussion.",
      "ja": "提案された標準は、入門レベルの文書です。でも、単一の実装のための要件はありません。提案多くの場合、実装されることはありませんか、IETF標準化プロセスに進みました。したがって、これらは、多くの場合、インターネットコミュニティに提示されているだけで、提案のアイデアです。時には欠陥が露出したり、彼らが問題に多くの競合ソリューションの一つですされています。この後の例では、何の議論は、それがこの議論の目的を果たすないだろうと提示されていません。"
    },
    {
      "indent": 0,
      "text": "5.1. Use of OSI IS-IS for routing in TCP/IP and dual environments",
      "ja": "5.1.  OSIの使用は、TCP / IPやデュアル環境でのルーティングのためIS-IS"
    },
    {
      "indent": 3,
      "text": "This document specifies a protocol for the exchange of IPv4 routing information.",
      "ja": "この文書は、IPv4ルーティング情報を交換するためのプロトコルを指定します。"
    },
    {
      "indent": 0,
      "text": "5.2. Applicability Statement for OSPF",
      "section_title": true,
      "ja": "5.2.  OSPFのための適用性に関する声明"
    },
    {
      "indent": 3,
      "text": "This document discusses a version of OSPF that is limited to IPv4.",
      "ja": "この文書では、IPv4に制限されているOSPFのバージョンについて説明します。"
    },
    {
      "indent": 0,
      "text": "5.3. Default Route Advertisement In BGP2 and BGP3 Version of The Border Gateway Protocol",
      "ja": "5.3.  BGP2でデフォルトルートの通知やボーダーゲートウェイプロトコルのバージョンBGP3"
    },
    {
      "indent": 3,
      "text": "BGP2 and BGP3 are both deprecated and therefore are not discussed in this document.",
      "ja": "BGP2とBGP3は両方廃止され、したがって、この文書で説明されていません。"
    },
    {
      "indent": 0,
      "text": "5.4. An Architecture for Inter-Domain Policy Routing",
      "section_title": true,
      "ja": "5.4. ドメイン間ポリシールーティングのためのアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "The architecture described in this document has no IPv4 dependencies.",
      "ja": "この文書で説明するアーキテクチャにはIPv4の依存関係を持っていません。"
    },
    {
      "indent": 0,
      "text": "5.5. Inter-Domain Policy Routing Protocol Specification: Version 1 (IDPR)",
      "ja": "5.5. ドメイン間ポリシールーティングプロトコル仕様：バージョン1（IDPR）"
    },
    {
      "indent": 3,
      "text": "There are no IPv4 dependencies in this protocol.",
      "ja": "このプロトコルにはIPv4の依存関係はありません。"
    },
    {
      "indent": 0,
      "text": "5.6. Applicability Statement for the Implementation of Classless Inter-Domain Routing (CIDR)",
      "ja": "5.6. クラスレスドメイン間ルーティング（CIDR）の実装のための適用性に関する声明"
    },
    {
      "indent": 3,
      "text": "This document deals exclusively with IPv4 addressing issue.",
      "ja": "この文書では、IPv4アドレス指定の問題を独占的に扱っています。"
    },
    {
      "indent": 0,
      "text": "5.7. An Architecture for IP Address Allocation with CIDR",
      "section_title": true,
      "ja": "5.7.  CIDRとのIPアドレス割り当てのためのアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "This document deals exclusively with IPv4 addressing issue.",
      "ja": "この文書では、IPv4アドレス指定の問題を独占的に扱っています。"
    },
    {
      "indent": 0,
      "text": "5.8. Classless Inter-Domain Routing (CIDR): an Address Assignment and Aggregation Strategy",
      "ja": "5.8. クラスレスドメイン間ルーティング（CIDR）：アドレス割り当ておよび集約戦略"
    },
    {
      "indent": 3,
      "text": "This document deals exclusively with IPv4 addressing issue.",
      "ja": "この文書では、IPv4アドレス指定の問題を独占的に扱っています。"
    },
    {
      "indent": 0,
      "text": "5.9. Extensions to RIP to Support Demand Circuits",
      "section_title": true,
      "ja": "5.9. 要求サーキットをサポートするためのRIPの拡張機能"
    },
    {
      "indent": 3,
      "text": "This protocol is an extension to a protocol for exchanging IPv4 routing information.",
      "ja": "このプロトコルは、IPv4ルーティング情報を交換するためのプロトコルの拡張です。"
    },
    {
      "indent": 0,
      "text": "5.10. Multicast Extensions to OSPF",
      "section_title": true,
      "ja": "5.10.  OSPFへのマルチキャスト拡張機能"
    },
    {
      "indent": 3,
      "text": "This document defines the use of IPv4 multicast to an IPv4 only routing protocol.",
      "ja": "この文書は、IPv4のみルーティングプロトコルへのIPv4マルチキャストの使用を規定します。"
    },
    {
      "indent": 0,
      "text": "5.11. Extending OSPF to Support Demand Circuits",
      "section_title": true,
      "ja": "5.11. 要求サーキットをサポートするためのOSPFを拡張"
    },
    {
      "indent": 3,
      "text": "There are no IPv4 dependencies in this protocol other than the fact that it is a new functionality for a routing protocol that only supports IPv4 networks.",
      "ja": "それが唯一のIPv4ネットワークをサポートしているルーティングプロトコルのための新しい機能であるという事実以外に、このプロトコルにはIPv4の依存関係はありません。"
    },
    {
      "indent": 0,
      "text": "5.12. BGP Communities Attribute",
      "section_title": true,
      "ja": "5.12.  BGPコミュニティ属性"
    },
    {
      "indent": 3,
      "text": "Although the protocol enhancements have no IPv4 dependencies, the base protocol, BGP-4, is IPv4 only.",
      "ja": "プロトコルの拡張はないIPv4の依存性を持たないが、基本プロトコル、BGP-4は、IPv4のみです。"
    },
    {
      "indent": 0,
      "text": "5.13. RIPng for IPv6",
      "section_title": true,
      "ja": "5.13.  IPv6のためのRIPng"
    },
    {
      "indent": 3,
      "text": "This RFC documents a protocol for exchanging IPv6 routing information and is not discussed in this document.",
      "ja": "このRFCは、IPv6ルーティング情報を交換するためのプロトコルを文書化し、この文書で議論されていません。"
    },
    {
      "indent": 0,
      "text": "5.14. Triggered Extensions to RIP to Support Demand Circuits",
      "section_title": true,
      "ja": "5.14. 要求サーキットをサポートするためのRIPのトリガ拡張機能"
    },
    {
      "indent": 3,
      "text": "This RFC defines an enhancement for an IPv4 routing protocol and while it has no IPv4 dependencies it is inherently limited to IPv4.",
      "ja": "このRFCは、IPv4ルーティングプロトコルの拡張を定義し、それが本来のIPv4に限定されないIPv4の依存性を有していないいます。"
    },
    {
      "indent": 0,
      "text": "5.15. Virtual Router Redundancy Protocol (VRRP)",
      "section_title": true,
      "ja": "5.15. 仮想ルータ冗長プロトコル（VRRP）"
    },
    {
      "indent": 3,
      "text": "This protocol is IPv4 specific, there are numerous references to 32- bit IP addresses.",
      "ja": "このプロトコルは、IPv4固有の、32ビットのIPアドレスへの多数の参照があります。"
    },
    {
      "indent": 0,
      "text": "5.16. The OSPF Opaque LSA Option",
      "section_title": true,
      "ja": "5.16.  OSPF不透明LSAオプション"
    },
    {
      "indent": 3,
      "text": "There are no IPv4 dependencies in this protocol other than the fact that it is a new functionality for a routing protocol that only supports IPv4 networks.",
      "ja": "それが唯一のIPv4ネットワークをサポートしているルーティングプロトコルのための新しい機能であるという事実以外に、このプロトコルにはIPv4の依存関係はありません。"
    },
    {
      "indent": 0,
      "text": "5.17. BGP Route Flap Damping",
      "section_title": true,
      "ja": "5.17.  BGPルートフラップダンピング"
    },
    {
      "indent": 3,
      "text": "The protocol enhancements have no IPv4 dependencies, even though the base protocol, BGP-4, is IPv4 only routing protocol.",
      "ja": "プロトコルの拡張はないIPv4の依存性を持たない、たとえ基本プロトコル、BGP-4は、IPv4の唯一のルーティングプロトコルです。"
    },
    {
      "indent": 0,
      "text": "5.18. Use of BGP-4 Multiprotocol Extensions for IPv6 Inter-Domain Routing",
      "ja": "5.18.  IPv6のドメイン間ルーティングのためのBGP-4マルチプロトコル拡張機能の使用"
    },
    {
      "indent": 3,
      "text": "This RFC documents IPv6 routing methods and is not discussed in this document.",
      "ja": "このRFCはIPv6ルーティング方法を文書化し、この文書で説明されていません。"
    },
    {
      "indent": 0,
      "text": "5.19. OSPF for IPv6",
      "section_title": true,
      "ja": "5.19.  IPv6のOSPF"
    },
    {
      "indent": 3,
      "text": "This document defines an IPv6 specific protocol and is not discussed in this document.",
      "ja": "この文書は、IPv6特定のプロトコルを定義し、この文書で議論されていません。"
    },
    {
      "indent": 0,
      "text": "5.20. Generic Routing Encapsulation (GRE)",
      "section_title": true,
      "ja": "5.20. 汎用ルーティングカプセル化（GRE）"
    },
    {
      "indent": 3,
      "text": "This protocol is only defined for IPv4. The document states in the Appendix:",
      "ja": "このプロトコルはIPv4のみのために定義されています。付録のドキュメントの状態："
    },
    {
      "indent": 6,
      "text": "o IPv6 as Delivery and/or Payload Protocol",
      "ja": "配達および/またはペイロードプロトコルとしてIPv6のO"
    },
    {
      "indent": 3,
      "text": "This specification describes the intersection of GRE currently deployed by multiple vendors. IPv6 as delivery and/or payload protocol is not included.",
      "ja": "この仕様は、現在、複数のベンダーによって展開GREの交差点を説明しています。送達および/またはペイロードプロトコルとしてIPv6が含まれていません。"
    },
    {
      "indent": 0,
      "text": "5.21. BGP Route Reflection - An Alternative to Full Mesh IBGP",
      "section_title": true,
      "ja": "5.21.  BGPルートリフレクション - フルメッシュIBGPへの代替"
    },
    {
      "indent": 3,
      "text": "Although the protocol enhancements have no IPv4 dependencies, the base protocol, BGP-4, is IPv4 only routing protocol. This specification updates but does not obsolete RFC 1966.",
      "ja": "プロトコルの拡張はないIPv4の依存性を持たないが、基本プロトコル、BGP-4は、IPv4の唯一のルーティングプロトコルです。この仕様の更新が、時代遅れではないRFC 1966を行います。"
    },
    {
      "indent": 0,
      "text": "5.22. Multiprotocol Extensions for BGP-4",
      "section_title": true,
      "ja": "5.22.  BGP-4のためのマルチプロトコル拡張機能"
    },
    {
      "indent": 3,
      "text": "In the Abstract:",
      "ja": "要約には："
    },
    {
      "indent": 3,
      "text": "Currently BGP-4 is capable of carrying routing information only for IPv4. This document defines extensions to BGP-4 to enable it to carry routing information for multiple Network Layer protocols (e.g., IPv6, IPX, etc...). The extensions are backward compatible - a router that supports the extensions can interoperate with a router that doesn't support the extensions.",
      "ja": "現在BGP-4は、IPv4のみのためのルーティング情報を搬送することが可能です。この文書は、複数のネットワーク層プロトコル（例えば、IPv6の、IPXなど）のためのルーティング情報を搬送することを可能にするために、BGP-4への拡張を定義します。拡張子は、下位互換性がある - の拡張をサポートしていないルータと相互運用できる機能拡張をサポートするルータ。"
    },
    {
      "indent": 3,
      "text": "The document is therefore not examined further in this document.",
      "ja": "文書は、そのため、この文書でさらに検討されていません。"
    },
    {
      "indent": 0,
      "text": "5.23. Key and Sequence Number Extensions to GRE",
      "section_title": true,
      "ja": "5.23.  GREのキーと一連番号拡大"
    },
    {
      "indent": 3,
      "text": "There are no IPv4 dependencies in this protocol.",
      "ja": "このプロトコルにはIPv4の依存関係はありません。"
    },
    {
      "indent": 0,
      "text": "5.24. Router Renumbering for IPv6",
      "section_title": true,
      "ja": "5.24.  IPv6のルータリナンバリング"
    },
    {
      "indent": 3,
      "text": "The RFC defines an IPv6 only document and is not concerned in this survey.",
      "ja": "RFCは、IPv6のみの文書を定義し、この調査では関係ありません。"
    },
    {
      "indent": 0,
      "text": "5.25. Route Refresh Capability for BGP-4",
      "section_title": true,
      "ja": "5.25.  BGP-4のためのルートリフレッシュ機能"
    },
    {
      "indent": 3,
      "text": "Although the protocol enhancements have no IPv4 dependencies, the base protocol, BGP-4, is IPv4 only routing protocol.",
      "ja": "プロトコルの拡張はないIPv4の依存性を持たないが、基本プロトコル、BGP-4は、IPv4の唯一のルーティングプロトコルです。"
    },
    {
      "indent": 0,
      "text": "5.26. Autonomous System Confederations for BGP",
      "section_title": true,
      "ja": "5.26.  BGPのための自律システムコンフェデレーションズ"
    },
    {
      "indent": 3,
      "text": "Although the protocol enhancements have no IPv4 dependencies, the base protocol, BGP-4, is IPv4 only routing protocol.",
      "ja": "プロトコルの拡張はないIPv4の依存性を持たないが、基本プロトコル、BGP-4は、IPv4の唯一のルーティングプロトコルです。"
    },
    {
      "indent": 0,
      "text": "5.27. The OSPF Not-So-Stubby Area (NSSA) Option",
      "section_title": true,
      "ja": "5.27.  OSPFない準スタブエリア（NSSA）オプション"
    },
    {
      "indent": 3,
      "text": "This document defines an extension to an IPv4 routing protocol.",
      "ja": "この文書は、IPv4ルーティングプロトコルの拡張を定義します。"
    },
    {
      "indent": 0,
      "text": "5.28. Carrying Label Information in BGP-4",
      "section_title": true,
      "ja": "5.28.  BGP-4でラベル情報を運びます"
    },
    {
      "indent": 3,
      "text": "There are no IPv4 dependencies in this protocol.",
      "ja": "このプロトコルにはIPv4の依存関係はありません。"
    },
    {
      "indent": 0,
      "text": "5.29. Extensions to IPv6 Neighbor Discovery for Inverse Discovery Specification",
      "ja": "5.29. 逆ディスカバリー仕様のIPv6近隣探索の拡張"
    },
    {
      "indent": 3,
      "text": "This is an IPv6 related document and is not discussed in this document.",
      "ja": "これは、IPv6関連の文書であり、この文書で説明されていません。"
    },
    {
      "indent": 0,
      "text": "6. Experimental RFCs",
      "section_title": true,
      "ja": "6.実験のRFC"
    },
    {
      "indent": 3,
      "text": "Experimental RFCs typically define protocols that do not have wide scale implementation or usage on the Internet. They are often propriety in nature or used in limited arenas. They are documented to the Internet community in order to allow potential interoperability or some other potential useful scenario. In a few cases they are presented as alternatives to the mainstream solution to an acknowledged problem.",
      "ja": "実験的RFCは、通常、インターネット上の広いスケールの実装や使用していないプロトコルを定義します。彼らは多くの場合、自然の中で妥当または制限された競技場で使用されています。彼らは、潜在的な相互運用性またはいくつかの他の潜在的に有用なシナリオを可能にするためにインターネットコミュニティに文書化されています。いくつかのケースでは、彼らは認め問題の主流の解決策の代替として提示されています。"
    },
    {
      "indent": 0,
      "text": "6.1. Distance Vector Multicast Routing Protocol (DVMRP)",
      "section_title": true,
      "ja": "6.1. 距離ベクトルマルチキャストルーティングプロトコル（DVMRP）"
    },
    {
      "indent": 3,
      "text": "This document defines a protocol for IPv4 multicast routing.",
      "ja": "この文書は、IPv4マルチキャストルーティングのためのプロトコルを定義します。"
    },
    {
      "indent": 0,
      "text": "6.2. An Experiment in DNS Based IP Routing",
      "section_title": true,
      "ja": "6.2.  DNSベースのIPルーティングで実験"
    },
    {
      "indent": 3,
      "text": "This proposal is IPv4 limited:",
      "ja": "この提案は、IPv4が制限されます。"
    },
    {
      "indent": 3,
      "text": "This record is designed for easy general purpose extensions in the DNS, and its content is a text string. The RX record will contain three fields: A record identifier, A cost indicator, and An IP address.",
      "ja": "このレコードは、DNSで簡単に汎用拡張のために設計されており、その内容はテキスト文字列です。レコード識別子、コストインジケータ、およびIPアドレス：RXレコードは、3つのフィールドが含まれています。"
    },
    {
      "indent": 3,
      "text": "The three strings will be separated by a single comma. An example of record would thus be:",
      "ja": "3つの文字列は、単一のカンマで区切られます。レコードの例は、このように次のようになります。"
    },
    {
      "indent": 3,
      "text": "___________________________________________________________________\n|         domain          |   type |   record |   value           |\n|            -            |        |          |                   |\n|*.27.32.192.in-addr.arpa |   IP   |    TXT   |   RX, 10, 10.0.0.7|\n|_________________________|________|__________|___________________|",
      "raw": true
    },
    {
      "indent": 3,
      "text": "which means that for all hosts whose IP address starts by the three octets \"192.32.27\" the IP host \"10.0.0.7\" can be used as a gateway, and that the preference value is 10.",
      "ja": "これは、そのIPアドレスのすべてのホストに対して「192.32.27」の3つのオクテットによってIPホスト「10.0.0.7」のゲートウェイとして使用することができるが開始され、嗜好値が10であることをことを意味します。"
    },
    {
      "indent": 0,
      "text": "6.3. RAP: Internet Route Access Protocol",
      "section_title": true,
      "ja": "6.3.  RAP：インターネットルートアクセスプロトコル"
    },
    {
      "indent": 3,
      "text": "This document defines an IPv7 routing protocol and has been abandoned by the IETF as a feasible design. It is not considered in this document.",
      "ja": "この文書では、IPv7ルーティングプロトコルを定義し、実現可能な設計としてIETFによって放棄されています。それは、このドキュメントでは考慮されていません。"
    },
    {
      "indent": 0,
      "text": "6.4. OSPF Database Overflow",
      "section_title": true,
      "ja": "6.4.  OSPFデータベースオーバーフロー"
    },
    {
      "indent": 3,
      "text": "There are no IPv4 dependencies in this protocol other than the fact that it is a new functionality for a routing protocol that only supports IPv4 networks.",
      "ja": "それが唯一のIPv4ネットワークをサポートしているルーティングプロトコルのための新しい機能であるという事実以外に、このプロトコルにはIPv4の依存関係はありません。"
    },
    {
      "indent": 0,
      "text": "6.5. A BGP/IDRP Route Server alternative to a full mesh routing",
      "ja": "6.5. フルメッシュルーティングにBGP / IDRPルートサーバの代替"
    },
    {
      "indent": 3,
      "text": "This protocol is both IPv4 and IPv6 aware and needs no changes.",
      "ja": "このプロトコルは、IPv4とIPv6の両方を認識しており、何も変更を必要としません。"
    },
    {
      "indent": 0,
      "text": "6.6. BGP Route Reflection An alternative to full mesh IBGP",
      "section_title": true,
      "ja": "6.6.  BGPルートリフレクションは、フルメッシュIBGPへの代替"
    },
    {
      "indent": 3,
      "text": "Although the protocol enhancements have no IPv4 dependencies, the base protocol, BGP-4, is IPv4 only routing protocol. This specification has been updated by RFC 2796.",
      "ja": "プロトコルの拡張はないIPv4の依存性を持たないが、基本プロトコル、BGP-4は、IPv4の唯一のルーティングプロトコルです。この仕様はRFC 2796で更新されています。"
    },
    {
      "indent": 0,
      "text": "6.7. Core Based Trees (CBT version 2) Multicast Routing",
      "section_title": true,
      "ja": "6.7. コアベースツリー（CBTバージョン2）マルチキャストルーティング"
    },
    {
      "indent": 3,
      "text": "The document specifies a protocol that depends on IPv4 multicast. There are many packet formats defined that show IPv4 usage.",
      "ja": "文書は、IPv4マルチキャストに依存プロトコルを指定します。 IPv4の使用方法を示して定義された多くのパケットフォーマットがあります。"
    },
    {
      "indent": 0,
      "text": "6.8. Core Based Trees (CBT) Multicast Routing Architecture",
      "section_title": true,
      "ja": "6.8. コアベースの木（CBT）マルチキャストルーティングのアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "See previous Section for the IPv4 limitation in this protocol.",
      "ja": "このプロトコルでIPv4の制限のために、前のセクションを参照してください。"
    },
    {
      "indent": 0,
      "text": "6.9. Intra-LIS IP multicast among routers over ATM using Sparse Mode PIM",
      "ja": "6.9. 希薄モードPIMを使用してATM上のルータ間のイントラLIS IPマルチキャスト"
    },
    {
      "indent": 3,
      "text": "This protocol is designed for IPv4 multicast.",
      "ja": "このプロトコルはIPv4のマルチキャストのために設計されています。"
    },
    {
      "indent": 0,
      "text": "6.10. Protocol Independent Multicast-Sparse Mode (PIM-SM): Protocol Specification",
      "ja": "6.10. プロトコル独立マルチキャスト - スパースモード（PIM-SM）：プロトコル仕様"
    },
    {
      "indent": 3,
      "text": "This protocol is both IPv4 and IPv6 aware and needs no changes.",
      "ja": "このプロトコルは、IPv4とIPv6の両方を認識しており、何も変更を必要としません。"
    },
    {
      "indent": 0,
      "text": "6.11. QoS Routing Mechanisms and OSPF Extensions",
      "section_title": true,
      "ja": "6.11.  QoSルーティングメカニズムとOSPF拡張機能"
    },
    {
      "indent": 3,
      "text": "There are IPv4 dependencies in this protocol. It requires the use of the IPv4 TOS header field.",
      "ja": "このプロトコルでIPv4の依存関係があります。これは、IPv4のTOSヘッダーフィールドの使用を必要とします。"
    },
    {
      "indent": 0,
      "text": "7. Summary of Results",
      "section_title": true,
      "ja": "結果の概要7。"
    },
    {
      "indent": 3,
      "text": "In the initial survey of RFCs, 23 positives were identified out of a total of 46, broken down as follows:",
      "ja": "RFCの最初の調査では、23個の陽性は、以下のように分解、46の合計のうち、同定されました。"
    },
    {
      "indent": 9,
      "text": "Standards:                         3 out of  3 or 100.00%\nDraft Standards:                   1 out of  3 or  33.33%\nProposed Standards:               13 out of 29 or  44.83%\nExperimental RFCs:                 6 out of 11 or  54.54%",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Of those identified many require no action because they document outdated and unused protocols, while others are document protocols that are actively being updated by the appropriate working groups. Additionally there are many instances of standards that should be updated but do not cause any operational impact if they are not updated. The remaining instances are documented below. The authors have attempted to organize the results in a format that allows easy reference to other protocol designers. The assignment of statements has been based entirely on the authors perceived needs for updates and should not be taken as an official statement.",
      "ja": "その中で、彼らは時代遅れで、未使用のプロトコルを文書化するため、他の人が積極的に適切なワーキンググループによって更新されている文書プロトコルですが、多くは、何のアクションを必要としない同定しました。また、更新する必要がありますが、それらが更新されていない場合はすべての業務への影響を起こさない水準の多くのインスタンスがあります。残りのインスタンスは、以下の文書化されています。著者は、他のプロトコル設計者に簡単に参照することができます形式で結果を整理しようとしてきました。文の割り当ては、アップデートの必要性を認知著者に完全に基づいていると公式声明として解釈されるべきではありません。"
    },
    {
      "indent": 0,
      "text": "7.1. Standards",
      "section_title": true,
      "ja": "7.1. 規格"
    },
    {
      "indent": 0,
      "text": "7.1.1. STD 57 RIP Version 2 Protocol Applicability Statement ()",
      "section_title": true,
      "ja": "7.1.1.  STD 57 RIPバージョン2プロトコルに適用ステートメント（）"
    },
    {
      "indent": 3,
      "text": "This problem has been fixed by RFC 2081, RIPng Protocol Applicability Statement.",
      "ja": "この問題は、RFC 2081、RIPngのプロトコル適用性に関する声明で固定されています。"
    },
    {
      "indent": 0,
      "text": "7.1.2. STD 54 OSPF Version 2 ()",
      "section_title": true,
      "ja": "7.1.2.  STD 54 OSPFバージョン2（）"
    },
    {
      "indent": 3,
      "text": "This problem has been fixed by RFC 2740, OSPF for IPv6.",
      "ja": "この問題は、IPv6のOSPF、RFC 2740で固定されています。"
    },
    {
      "indent": 0,
      "text": "7.1.3. STD 56 RIP Version 2 ()",
      "section_title": true,
      "ja": "7.1.3.  STD 56 RIPバージョン2（）"
    },
    {
      "indent": 3,
      "text": "This problem has been fixed by RFC 2080, RIPng for IPv6.",
      "ja": "この問題は、IPv6のためのRIPng、RFC 2080で固定されています。"
    },
    {
      "indent": 0,
      "text": "7.2. Draft Standards",
      "section_title": true,
      "ja": "7.2. ドラフト規格"
    },
    {
      "indent": 0,
      "text": "7.2.1. Border Gateway Protocol 4 ()",
      "section_title": true,
      "ja": "7.2.1. ボーダーゲートウェイプロトコル4（）"
    },
    {
      "indent": 3,
      "text": "This problem has been fixed in RFC 2858 Multiprotocol Extensions for BGP-4, RFC 2545 Use of BGP-4 Multiprotocol Extensions for IPv6 Inter-Domain Routing, and in [8].",
      "ja": "この問題は、マルチプロトコル拡張BGP-4については、RFC 2858で修正された、IPv6のドメイン間ルーティングのためのBGP-4マルチプロトコル拡張機能のRFC 2545を使用すると、中に[8]。"
    },
    {
      "indent": 3,
      "text": "RFC 2858 extends BGP to support multi-protocol extensions that allows routing information for other address families to be exchanged. RFC 2545 further extends RFC 2858 for full support of exchanging IPv6 routing information and additionally clarifies support of the extended BGP-4 protocol using TCP+IPv6 as a transport mechanism. RFC 1771, 2858 & 2545 must be supported in order to provide full IPv6 support.",
      "ja": "RFC 2858は、他のアドレスファミリーを交換するためのルーティング情報を可能にするマルチプロトコル拡張をサポートするために、BGPを拡張します。 RFC 2545は、さらに、ルーティング情報を交換するのIPv6を完全にサポートするためのRFC 2858を拡張し、さらに転送メカニズムとしてTCP + IPv6を使用して、拡張BGP-4プロトコルのサポートを明確。 RFC 1771、2858＆2545は、完全なIPv6サポートを提供するために支持されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Note also that all the BGP extensions analyzed previously in this memo function without changes with the updated version of BGP-4.",
      "ja": "すべてのBGPの拡張機能は、BGP-4の更新版で変更を加えることなく、このメモ機能では、以前に分析されていることにも注意してください。"
    },
    {
      "indent": 0,
      "text": "7.3. Proposed Standards",
      "section_title": true,
      "ja": "7.3. 提案された標準"
    },
    {
      "indent": 0,
      "text": "7.3.1. Use of OSI IS-IS for routing in TCP/IP and dual environments (RFC 1195)",
      "ja": "7.3.1.  OSIの使用は、TCP / IPやデュアル環境でのルーティングのためIS-IS（RFC 1195）"
    },
    {
      "indent": 3,
      "text": "This problem is being addressed by the IS-IS WG [9].",
      "ja": "この問題は、IS-IS WGによって対処されている[9]。"
    },
    {
      "indent": 0,
      "text": "7.3.2. Applicability Statement for OSPFv2 ()",
      "section_title": true,
      "ja": "7.3.2.  OSPFv2のための適用性ステートメント（）"
    },
    {
      "indent": 3,
      "text": "This problem has been resolved in RFC 2740, OSPF for IPv6.",
      "ja": "この問題は、IPv6のOSPF、RFC 2740で解決されました。"
    },
    {
      "indent": 0,
      "text": "7.3.3. Applicability of CIDR ()",
      "section_title": true,
      "ja": "7.3.3.  CIDRの適用（）"
    },
    {
      "indent": 3,
      "text": "The contents of this specification has been treated in various IPv6 addressing architecture RFCs, see RFC 3513 & 3587.",
      "ja": "本明細書の内容は、RFC 3513および3587を参照して、アーキテクチャのRFCに対処する種々のIPv6で処理されています。"
    },
    {
      "indent": 0,
      "text": "7.3.4. CIDR Architecture ()",
      "section_title": true,
      "ja": "7.3.4. シドル​​アーキテクチャ（）"
    },
    {
      "indent": 3,
      "text": "The contents of this specification has been treated in various IPv6 addressing architecture RFCs, see RFC 3513 & 3587.",
      "ja": "本明細書の内容は、RFC 3513および3587を参照して、アーキテクチャのRFCに対処する種々のIPv6で処理されています。"
    },
    {
      "indent": 0,
      "text": "7.3.5. Classless Inter-Domain Routing (CIDR): an Address Assignment and Aggregation Strategy ()",
      "ja": "7.3.5. クラスレスドメイン間ルーティング（CIDR）：アドレス割り当ておよび集約戦略（）"
    },
    {
      "indent": 3,
      "text": "The contents of this specification has been treated in various IPv6 addressing architecture RFCs, see RFC 3513 & 3587.",
      "ja": "本明細書の内容は、RFC 3513および3587を参照して、アーキテクチャのRFCに対処する種々のIPv6で処理されています。"
    },
    {
      "indent": 0,
      "text": "7.3.6. RIP Extensions for Demand Circuits ()",
      "section_title": true,
      "ja": "7.3.6. デマンド回路用RIP拡張機能（）"
    },
    {
      "indent": 3,
      "text": "This problem has been addressed in RFC 2080, RIPng for IPv6.",
      "ja": "この問題は、IPv6のためのRIPng、RFC 2080で解決されています。"
    },
    {
      "indent": 0,
      "text": "7.3.7. OSPF Multicast Extensions ()",
      "section_title": true,
      "ja": "7.3.7.  OSPFマルチキャスト拡張機能（）"
    },
    {
      "indent": 3,
      "text": "This functionality has been covered in RFC 2740, OSPF for IPv6.",
      "ja": "この機能は、OSPFのIPv6のために、RFC 2740で説明されています。"
    },
    {
      "indent": 0,
      "text": "7.3.8. OSPF For Demand Circuits ()",
      "section_title": true,
      "ja": "7.3.8. デマンド回路用のOSPF（）"
    },
    {
      "indent": 3,
      "text": "This functionality has been covered in RFC 2740, OSPF for IPv6.",
      "ja": "この機能は、OSPFのIPv6のために、RFC 2740で説明されています。"
    },
    {
      "indent": 0,
      "text": "7.3.9. RIP Triggered Extensions for Demand Circuits ()",
      "section_title": true,
      "ja": "7.3.9. デマンド回路用RIPのトリガ拡張機能（）"
    },
    {
      "indent": 3,
      "text": "This functionality is provided in RFC 2080, RIPng for IPv6.",
      "ja": "この機能は、IPv6のためのRIPng、RFC 2080で提供されます。"
    },
    {
      "indent": 0,
      "text": "7.3.10. Virtual Router Redundancy Protocol (VRRP)()",
      "section_title": true,
      "ja": "7.3.10. 仮想ルータ冗長プロトコル（VRRP）（）"
    },
    {
      "indent": 3,
      "text": "The problems identified are being addressed by the VRRP WG [10].",
      "ja": "識別された問題は、VRRP WG [10]によって対処されています。"
    },
    {
      "indent": 0,
      "text": "7.3.11. OSPF Opaque LSA Option ()",
      "section_title": true,
      "ja": "7.3.11.  OSPF不透明LSAオプション（）"
    },
    {
      "indent": 3,
      "text": "This problem has been fixed by RFC 2740, OSPF for IPv6. Opaque options support is an inbuilt functionality in OSPFv3.",
      "ja": "この問題は、IPv6のOSPF、RFC 2740で固定されています。不透明なオプションのサポートは、OSPFv3の中に作り付けの機能です。"
    },
    {
      "indent": 0,
      "text": "7.3.12. Generic Routing Encapsulation (GRE)()",
      "section_title": true,
      "ja": "7.3.12. 汎用ルーティングカプセル化（GRE）（）"
    },
    {
      "indent": 3,
      "text": "Even though GRE tunneling over IPv6 has been implemented and used, its use has not been formally specified. Clarifications are required.",
      "ja": "IPv6を介しGREトンネリングが実装され、使用されているにもかかわらず、その使用は、正式に指定されていません。明確化が必要とされています。"
    },
    {
      "indent": 0,
      "text": "7.3.13. OSPF NSSA Option ()",
      "section_title": true,
      "ja": "7.3.13.  OSPF NSSAオプション（）"
    },
    {
      "indent": 3,
      "text": "This functionality has been covered in RFC 2740, OSPF for IPv6.",
      "ja": "この機能は、OSPFのIPv6のために、RFC 2740で説明されています。"
    },
    {
      "indent": 0,
      "text": "7.4. Experimental RFCs",
      "section_title": true,
      "ja": "7.4. 実験のRFC"
    },
    {
      "indent": 0,
      "text": "7.4.1. Distance Vector Multicast Routing Protocol ()",
      "section_title": true,
      "ja": "7.4.1. 距離ベクトルマルチキャストルーティングプロトコル（）"
    },
    {
      "indent": 3,
      "text": "This protocol is a routing protocol for IPv4 multicast routing. It is no longer in use and need not be redefined.",
      "ja": "このプロトコルは、IPv4マルチキャストルーティングのためのルーティングプロトコルです。これは、現在使用されていませんし、再定義する必要はありません。"
    },
    {
      "indent": 0,
      "text": "7.4.2. An Experiment in DNS Based IP Routing ()",
      "section_title": true,
      "ja": "7.4.2.  DNSベースのIPルーティングでの実験（）"
    },
    {
      "indent": 3,
      "text": "This protocol relies on IPv4 DNS RR, but is no longer relevant has never seen much use; no action is necessary.",
      "ja": "このプロトコルは、IPv4のDNS RRに依存していませんが、もはや多くの使用を見たことがなかった関連性があります。処置は必要ありません。"
    },
    {
      "indent": 0,
      "text": "7.4.3. Core Based Trees (CBT version 2) Multicast Routing ()",
      "section_title": true,
      "ja": "7.4.3. コアベースツリー（CBTバージョン2）マルチキャストルーティング（）"
    },
    {
      "indent": 3,
      "text": "This protocol relies on IPv4 IGMP Multicast and a new protocol standard may be produced. However, the multicast routing protocol has never been in much use and is no longer relevant; no action is necessary.",
      "ja": "このプロトコルはIPv4のIGMPマルチキャストに依存しており、新しいプロトコル標準を製造することができます。しかし、マルチキャストルーティングプロトコルは、あまり使用されたことがないと、もはや関連しています。処置は必要ありません。"
    },
    {
      "indent": 0,
      "text": "7.4.4. Core Based Trees (CBT) Multicast Routing Architecture ()",
      "section_title": true,
      "ja": "7.4.4. コアベースの木（CBT）マルチキャストルーティングアーキテクチャ（）"
    },
    {
      "indent": 3,
      "text": "See previous Section for the limitation in this protocol.",
      "ja": "このプロトコルの制限のために、前のセクションを参照してください。"
    },
    {
      "indent": 0,
      "text": "7.4.5. Intra-LIS IP multicast among routers over ATM using Sparse Mode PIM ()",
      "ja": "7.4.5. 希薄モードPIMを使用してATM上のルータのうちイントラLIS IPマルチキャスト（）"
    },
    {
      "indent": 3,
      "text": "This protocol is designed for IPv4 multicast. However, Intra-LIS IP multicast among routers over ATM is not believed to be relevant anymore. A new mechanism may be defined for IPv6 multicast.",
      "ja": "このプロトコルはIPv4のマルチキャストのために設計されています。しかし、ATM上でルータ間イントラLIS IPマルチキャストはもはや適切ではないと考えられます。新機構は、IPv6マルチキャストのために定義することができます。"
    },
    {
      "indent": 0,
      "text": "7.4.6. QoS Routing Mechanisms and OSPF Extensions ()",
      "section_title": true,
      "ja": "7.4.6.  QoSルーティングメカニズムとOSPF拡張機能（）"
    },
    {
      "indent": 3,
      "text": "QoS extensions for OSPF were never used for OSPFv2, and there seems to be little need for them in OSPFv3.",
      "ja": "OSPFのためのQoSの拡張機能は、OSPFv2のために使用されていない、とのOSPFv3での彼らのために少し必要があるように思いませんでした。"
    },
    {
      "indent": 3,
      "text": "However, if necessary, an update to this document could simply define the use of the IPv6 Traffic Class field since it is defined to be exactly the same as the IPv4 TOS field.",
      "ja": "必要であれば、IPv4のTOSフィールドとまったく同じになるように定義されているのでしかし、このドキュメントの更新は、単にIPv6のトラフィッククラスフィールドの使用を定義することができます。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document examines the IPv6-readiness of routing specification; this does not have security considerations in itself.",
      "ja": "この文書は、ルーティング仕様のIPv6に準備状況を調べます。これは、それ自体ではセキュリティ上の配慮を持っていません。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "The original author, Philip J. Nesser II, would like to acknowledge the support of the Internet Society in the research and production of this document.",
      "ja": "原作者、フィリップJ. Nesser IIは、この文書の研究と生産におけるインターネット協会の支援を承認したいと思います。"
    },
    {
      "indent": 3,
      "text": "He also would like to thanks his partner in all ways, Wendy M. Nesser.",
      "ja": "彼はまた、すべての方法で彼のパートナー、ウェンディーM. Nesser感謝したいと思います。"
    },
    {
      "indent": 3,
      "text": "Cesar Olvera would like to thanks Pekka Savola for an extended guidance and comments for the edition of this document, and Jordi Palet for his support and reviews.",
      "ja": "セザールオルベラは、この文書の版のための拡張された指導とコメントしてくれてありがとうペッカSavolaに好きで、彼のサポートやレビューのためのジョルディPaletでしょう。"
    },
    {
      "indent": 3,
      "text": "Additionally, he would further like to thank Andreas Bergstrom, Brian Carpenter, Jeff Haas, Vishwas Manral, Gabriela Medina, Venkata Naidu, Jeff Parker and Curtis Villamizar for valuable feedback.",
      "ja": "さらに、彼はさらに貴重なフィードバックのためにアンドレアス・バーグストロム、ブライアン・カーペンター、ジェフ・ハース、Vishwas Manral、ガブリエラ・メディナ、ヴェンカタNaidu、ジェフ・パーカーとカーティスVillamizarに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Nesser, II, P. and A. Bergstrom, Editor, \"Introduction to the Survey of IPv4 Addresses in Currently Deployed IETF Standards\", RFC 3789, June 2004.",
      "ja": "[1] Nesser、II、P.およびA.ベルイストローム、エディタを、RFC 3789、2004年6月 \"のIPv4の調査の概要は、現在展開IETF標準のアドレス\"。"
    },
    {
      "indent": 3,
      "text": "[2] Sofia, R. and P. Nesser, II, \"Survey of IPv4 Addresses in Currently Deployed IETF Application Area Standards\", RFC 3795, June 2004.",
      "ja": "[2]ソフィア、R.とP. Nesser、IIを、RFC 3795、2004年6月 \"のIPv4の調査は、現在展開IETFアプリケーション領域の標準のアドレス\"。"
    },
    {
      "indent": 3,
      "text": "[3] Mickles, C. and P. Nesser, II, \"Internet Area: Survey of IPv4 Addresses Currently Deployed IETF Standards\", RFC 3790, June 2004.",
      "ja": "[3] Mickles、C.およびP. Nesser、IIを、：、RFC 3790、2004年6月 \"インターネットエリアのIPv4の調査は、現在展開IETF標準のアドレス\"。"
    },
    {
      "indent": 3,
      "text": "[4] Nesser, II, P. and A. Bergstrom, \"Survey of IPv4 addresses in Currently Deployed IETF Operations & Management Area Standards\", RFC 3796, June 2004.",
      "ja": "[4] Nesser、II、P.およびA.バーグストロムを、RFC 3796、2004年6月 \"のIPv4の調査は、現在展開IETF操作と管理領域の標準のアドレス\"。"
    },
    {
      "indent": 3,
      "text": "[5] Nesser, II, P. and A. Bergstrom. \"Survey of IPv4 Addresses in Currently Deployed IETF Security Area Standards\", RFC 3792, June 2004.",
      "ja": "[5] Nesser、II、P.及びA.バーグストロム。 、RFC 3792、2004年6月「のIPv4の調査は、現在展開IETFセキュリティエリア標準のアドレス」。"
    },
    {
      "indent": 3,
      "text": "[6] Nesser, II, P. and A. Bergstrom. \"Survey of IPv4 Addresses in Currently Deployed IETF Sub-IP Area Standards\", RFC 3793, June 2004.",
      "ja": "[6] Nesser、II、P.及びA.バーグストロム。 、RFC 3793、2004年6月「のIPv4の調査は、現在展開IETFサブIPエリア標準のアドレス」。"
    },
    {
      "indent": 3,
      "text": "[7] Nesser, II, P. and A. Bergstrom \"Survey of IPv4 Addresses in Currently Deployed IETF Transport Area Standards\", RFC 3794, June 2004.",
      "ja": "[7] Nesser、II、P.およびA.ベルイストローム、RFC 3794、2004年6月 \"のIPv4の調査は、現在展開IETF交通エリア標準のアドレス\"。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[8] Chen, E. and J. Yuan, \"AS-wide Unique BGP Identifier for BGP-4\", Work in Progress, December 2003.",
      "ja": "[8]チェン、E.およびJ.元、 \"BGP-4のためのASワイドユニークBGP識別子\"、進歩、2003年12月の作業。"
    },
    {
      "indent": 3,
      "text": "[9] Hopps, C., \"Routing IPv6 with IS-IS\", Work in Progress, January 2003.",
      "ja": "[9] Hoppsが、C.、 \"IS-ISとルーティングのIPv6\"、進歩、2003年1月の作業。"
    },
    {
      "indent": 3,
      "text": "[10] Hinden, R., \"Virtual Router Redundancy Protocol for IPv6\", Work in Progress, February 2004.",
      "ja": "[10] HindenとR.、 \"IPv6の仮想ルータ冗長プロトコル\"、進歩、2004年2月に作業。"
    },
    {
      "indent": 0,
      "text": "11. Authors' Addresses",
      "section_title": true,
      "ja": "11.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Please contact the authors with any questions, comments or suggestions at:",
      "ja": "でご質問、コメントや提案を作者に連絡してください："
    },
    {
      "indent": 3,
      "text": "Cesar Olvera Morales Researcher Consulintel San Jose Artesano, 1 28108 - Alcobendas Madrid, Spain",
      "ja": "セザールオルベラモラレスサンノゼ職人研究Consulintel 1 28108  - アルコベンダスマドリード、スペイン"
    },
    {
      "indent": 3,
      "text": "Phone: +34 91 151 81 99 Fax: +34 91 151 81 98 EMail: cesar.olvera@consulintel.es",
      "ja": "電話：+34 91 151 81 99ファックス：+34 91 151 81 98 Eメール：cesar.olvera@consulintel.es"
    },
    {
      "indent": 3,
      "text": "Philip J. Nesser II Principal Nesser & Nesser Consulting 13501 100th Ave NE, #5202 Kirkland, WA 98034",
      "ja": "フィリップJ. Nesser II校長Nesser＆Nesserコンサルティング13501第百アヴェNE、＃5202カークランド、WA 98034"
    },
    {
      "indent": 3,
      "text": "Phone: +1 425 481 4303 EMail: phil@nesser.com",
      "ja": "電話：+1 425 481 4303 Eメール：phil@nesser.com"
    },
    {
      "indent": 0,
      "text": "12. Full Copyright Statement",
      "section_title": true,
      "ja": "12.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（C）インターネット協会（2004）。この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}