{
  "title": {
    "text": "RFC 3188 - Using National Bibliography Numbers as Uniform Resource Names",
    "ja": "RFC 3188 - ユニフォームリソース名として全国書誌番号の使用"
  },
  "number": 3188,
  "created_at": "2019-10-24 18:42:15.768853+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          J. Hakala\nRequest for Comments: 3188                   Helsinki University Library\nCategory: Informational                                     October 2001",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Using National Bibliography Numbers as\n        Uniform Resource Names",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document discusses how national bibliography numbers (persistent and unique identifiers assigned by the national libraries) can be supported within the URN (Uniform Resource Names) framework and the syntax for URNs defined in RFC 2141. Much of the discussion is based on the ideas expressed in RFC 2288.",
      "ja": "この文書では、表現のアイデアに基づいているURN（ユニフォームリソース名）のフレームワークとの議論の多くはRFC 2141で定義されたURNの構文内でサポートすることができますどのように全国書誌番号（国立図書館によって割り当てられた永続的かつ一意の識別子）を議論しますRFC 2288インチ"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "As part of the validation process for the development of URNs the IETF working group agreed that it is important to demonstrate that the current URN syntax proposal can accommodate existing identifiers from well established namespaces. One such infrastructure for assigning and managing names comes from the bibliographic community. Bibliographic identifiers function as names for objects that exist both in print and, increasingly, in electronic formats. RFC 2288 [Lynch] investigated the feasibility of using three identifiers (ISBN, ISSN and SICI) as URNs.",
      "ja": "URNの開発のための検証プロセスの一環として、IETFワーキンググループは、現在のURN構文案が十分に確立名前空間からの既存の識別子を収容することができることを実証することが重要であることに合意しました。名前を割り当て、管理するための一つのそのようなインフラストラクチャは、書誌コミュニティから来ています。書誌識別子は、電子フォーマットで、ますます、プリントの両方に存在し、オブジェクトの名前として機能します。 RFC 2288 [リンチ]のURNのように3つの識別子（ISBN、ISSN、およびSICI）を使用することの実現可能性を検討しました。"
    },
    {
      "indent": 3,
      "text": "This document will analyse the usage of national bibliography numbers (NBNs) as URNs. The need to extend analysis to new identifier systems was briefly discussed in RFC 2288 as well, with the following summary: \"The issues involved in supporting those additional identifiers are anticipated to be broadly similar to those involved in supporting ISBNs, ISSNs, and SICIs\".",
      "ja": "この文書では、URNのよう全国書誌番号（NBNS）の使用状況を分析します。新しい識別子システムへの分析を拡張する必要が簡単に以下の要約で、同様RFC 2288で説明しました：「これらの追加の識別子を支援に関わる問題は、ISBNコードを支援する関係者に広く類似していると予想される、ISSNs、およびSICIs」 。"
    },
    {
      "indent": 3,
      "text": "A registration request for acquiring a Namespace Identifier (NID) \"NBN\" for national bibliography numbers has been written by the National Library of Finland on the request of the Conference of Directors of National Libraries (CDNL) and the Conference of the European National Librarians (CENL). Chapter 5 contains a URN namespace registration request modeled according to the template in RFC 2611.",
      "ja": "全国書誌番号の名前空間識別子（NID）「NBN」を取得するための登録要求には国立図書館（CDNL）と欧州の国立図書館の会議（取締役の会議の要求にフィンランド国立図書館によって書かれていますCENL）。第5章では、RFC 2611でテンプレートに従ってモデル化URN名前空間の登録要求が含まれています。"
    },
    {
      "indent": 3,
      "text": "The document at hand is part of a global co-operation of the national libraries to foster identification of electronic documents in general and utilisation of URNs in particular. Some national libraries, including the national libraries of Finland, Norway and Sweden, are already assigning NBN-based URNs for electronic resources.",
      "ja": "手元の文書は、電子文書、一般的に、特にURNの活用の識別を促進するための国家図書館のグローバルな協力の一環です。フィンランド、ノルウェー、スウェーデンの国立図書館を含むいくつかの国立図書館は、すでに電子リソースのためのNBNベースのURNを割り当てています。"
    },
    {
      "indent": 3,
      "text": "We have used the URN Namespace Identifier \"NBN\" for the national bibliographic numbers in examples below.",
      "ja": "私たちは、以下の例では全国書誌番号のURN名前空間識別子「NBN」を使用していました。"
    },
    {
      "indent": 0,
      "text": "2. Identification vs. Resolution",
      "section_title": true,
      "ja": "2.識別と。解決"
    },
    {
      "indent": 3,
      "text": "As a rule the national bibliography numbers identify finite, manageably-sized objects, but these objects may still be large enough that resolution to a hierarchical system is appropriate.",
      "ja": "原則として全国書誌番号が有限、管理可能なサイズのオブジェクトを識別し、これらのオブジェクトは依然として階層システムにその解像度が適切である十分な大きさでもよいです。"
    },
    {
      "indent": 3,
      "text": "The materials identified by a national bibliography number may exist only in printed or other physical form, not electronically. The best that a resolver will be able to offer in this case is bibliographic data from a national bibliography database, including information about where the physical resource is stored in a national library's holdings.",
      "ja": "全国書誌番号によって識別される材料がない電子的にのみ印刷または他の物理的形態で存在し得ます。リゾルバが、この場合に提供できるようになりますよう最善のは、物理的なリソースが国立図書館の保有に格納されている場所についての情報を含む全国書誌データベースから書誌データ、です。"
    },
    {
      "indent": 3,
      "text": "The URN Framework provides resolution services that may be used to describe any differences between the resource identified by a URN and the resource that would be returned as a result of resolving that URN. However, NBNs will be used for instance to identify resources in digital Web archives created by harvester robot applications. In this case, NBN will identify exactly the resource the user expects to see.",
      "ja": "URN FrameworkはURNによって識別されたリソースとそのURNを解決した結果として返されるリソースとの間の差異を説明するために使用することができる解決サービスを提供します。しかし、NBNSは収穫ロボットのアプリケーションで作成されたデジタルのWebアーカイブ内のリソースを識別するために、インスタンスのために使用されます。この場合、NBNは、ユーザーが見ることを期待正確にリソースを識別します。"
    },
    {
      "indent": 0,
      "text": "3. National bibliography numbers",
      "section_title": true,
      "ja": "3.全国書誌番号"
    },
    {
      "indent": 0,
      "text": "3.1 Overview",
      "section_title": true,
      "ja": "3.1概要"
    },
    {
      "indent": 3,
      "text": "National Bibliography Number (NBN) is a generic name referring to a group of identifier systems utilised by the national libraries and only by them for identification of deposited publications which lack an identifier, or to descriptive metadata (cataloging) that describes the resources. In many countries legal (or voluntary) deposit is being extended to electronic publications.",
      "ja": "全国書誌番号（NBN）は、国立図書館によってのみ、それらが利用する識別子システムのグループを指す総称である識別子が不足している、またはリソースを記述する記述メタデータ（目録）に寄託出版物の同定のため。多くの国で法的（または自発的）堆積物は、電子出版物に拡張されています。"
    },
    {
      "indent": 3,
      "text": "Each national library uses its own NBN strings independently of other national libraries; there is no global authority which controls them. For this reason NBNs are unique only on national level. When used as URNs, NBN strings must be augmented with a controlled prefix such as country code. These prefixes guarantee uniqueness of the NBN-based URNs on the global scale.",
      "ja": "各国立図書館には、独立して、他の国立図書館の独自のNBN文字列を使用しています。それらを制御グローバルな権限がありません。このため、NBNSは唯一の国家レベルで一意です。 URNのとして使用する場合、NBN文字列は、そのような国コードとして制御する接頭辞で拡張する必要があります。これらの接頭辞は、グローバル規模でのNBNベースのURNの一意性を保証します。"
    },
    {
      "indent": 3,
      "text": "NBNs have traditionally been given to documents that do not have a publisher-assigned identifier, but are cataloged to the national bibliography. NBNs can be seen as a fall-back mechanism: if no other, better established identifier such as ISBN can be given, an NBN is assigned. In principle, NBN usage enables identification of any Internet document. Local policies may limit the NBN usage to a much smaller subset of documents.",
      "ja": "NBNSは、伝統的に出版社-IDが割り当てられていない文書に与えられているが、全国書誌にカタログ化されています。 NBNSは、フォールバック機構として見ることができる：例えばISBNなどの他、良好設立識別子が与えられていないことができれば、NBNが割り当てられます。原則として、NBNの使用量は、任意のインターネット文書の識別を可能にします。ローカルポリシーは、文書のはるかに小さいサブセットにNBNの使用を制限する可能性があります。"
    },
    {
      "indent": 3,
      "text": "Some national libraries (e.g., Finland, Norway, Sweden) have established Web-based URN generators, which enable authors and publishers to fetch NBN-based URNs for their network documents. At least national libraries of Sweden and Finland are harvesting and archiving domestic Web documents (and a number of other libraries plan to start this activity), and long-time preservation of these materials requires persistent and unique identification. NBNs can be and are in fact already used as internal identifiers in these Web archives.",
      "ja": "いくつかの国立図書館（例えば、フィンランド、ノルウェー、スウェーデン）は、ネットワーク文書のNBNベースのURNを取得するために、著者や出版社を可能にするWebベースのURNの発電機を、確立しています。少なくとも、スウェーデンとフィンランドの国立図書館は、収穫とアーカイブ国内のWebドキュメントを（およびその他のライブラリの数は、この活動を開始する予定）、およびこれらの材料の長期保存は、永続的かつユニークな識別を必要としています。 NBNSは、することができ、実際には、既にこれらのWebアーカイブに内部識別子として使用されています。"
    },
    {
      "indent": 3,
      "text": "Both syntax and scope of NBNs can be decided by each national library independently. Typically, an NBN consist of one or more letters and/or digits. This simple syntax makes NBNs infinitely extensible and very suitable for e.g., naming of the Web documents. For instance the application used by the national library of Finland for Web harvesting creates NBNs which are based on the MD5 checksum of the archived resource.",
      "ja": "NBNSの構文と範囲の両方が独立して、各国立図書館によって決定することができます。典型的には、NBNは、一つ以上の文字および/または数字から成ります。この単純な構文は、Webドキュメントの命名、NBNSは無限に拡張可能で、例えばのために非常に適しています。たとえば、ウェブ収穫のためのフィンランドの国立図書館で使用されるアプリケーションは、アーカイブされたリソースのMD5チェックサムに基づいていますNBNSを作成します。"
    },
    {
      "indent": 0,
      "text": "3.2 F-code",
      "section_title": true,
      "ja": "3.2 F-コード"
    },
    {
      "indent": 3,
      "text": "F-code is the NBN used by the National Library of Finland.",
      "ja": "F-コードフィンランド国立図書館で使用さNBNです。"
    },
    {
      "indent": 3,
      "text": "F-codes have been used since early 20th century to identify catalogue cards and later MARC records in the national bibliography. In 1998 the national library decided to enable the Finnish authors and publishers to assign F-codes to their Internet documents, if these documents do not qualify for other identifiers such as ISBN. F-codes, embedded into URNs, can be fetched from the URN generator (http://www.lib.helsinki.fi/cgi-bin/urn.pl) developed in co-operation between the national library of Finland and the Lund University library, NETLAB unit. Attached to the generator there is a user guide (http://www.lib.helsinki.fi/meta/URN-opas.html; only in Finnish), which tells the users how to use URNs.",
      "ja": "F-コードは、全国書誌に目録カード以降MARCレコードを識別するために、20世紀初頭から使用されています。 1998年には国立図書館は、これらの文書は、ISBNなどの他の識別子の要件を満たしていない場合は、自分のインターネット文書にF-コードを割り当てるためにフィンランドの作家や出版社を有効にすることを決めました。 URNに埋め込まれたF-コードは、フィンランドとルンドの国立図書館間の協力で開発されたURNジェネレータ（http://www.lib.helsinki.fi/cgi-bin/urn.pl）からフェッチすることができます大学図書館、NETLABユニット。 URNを使用する方法をユーザーに指示しており、;発電機に取り付けられたユーザーガイド（のみフィンランドにおけるhttp://www.lib.helsinki.fi/meta/URN-opas.html）があります。"
    },
    {
      "indent": 3,
      "text": "F-codes are also used within the Web harvesting and archiving software (http://www.csc.fi/sovellus/nedlib/), which has been built for the Networked European Deposit Library (NEDLIB) project (see http://www.kb.nl/nedlib). NEDLIB harvester calculates MD5 checksum for each archived resource, and then builds an NBN-based URN from the checksum. The URN serves then as a unique identifier to the archived resource. Traditional identifiers can not be used for this purpose, since there may for instance be several variants of a book which (quite rightly so) all have the same ISBN. Moreover, identifiers embedded into a document do not necessarily belong to the document itself; thus the Web archiving application can not trust the identifiers embedded into the body of the document.",
      "ja": "F-コードはまた、（HTTPを参照してくださいネットワーク欧州のデポジット・ライブラリー（NEDLIB）プロジェクトのために構築されたウェブ収穫およびアーカイブソフトウェア（http://www.csc.fi/sovellus/nedlib/）、内で使用されている：// www.kb.nl/nedlib）。 NEDLIBハーベスタは、各アーカイブリソースのMD5チェックサムを算出し、チェックサムからNBNベースURNを構築します。 URNは、アーカイブされたリソースに一意の識別子として、次に働きます。例えば同じISBNを持っている（かなり当然のように）すべての本のいくつかの亜種が存在する可能性があるため、伝統的な識別子は、この目的のために使用することはできません。また、文書に埋め込まれた識別子は、必ずしも文書自体に属していません。これのWebアーカイブアプリケーションは、文書の本文に埋め込まれた識別子を信頼することはできません。"
    },
    {
      "indent": 3,
      "text": "The F-code built by the URN generator consist of:",
      "ja": "URNジェネレータによって構築されたF-コードはで構成されています。"
    },
    {
      "indent": 3,
      "text": "Prefix (for example fe) Year (YYYY; for example 1999) Number (for example 1055)",
      "ja": "接頭語（例えばFE）年（例えば1055用）（YYYY例えば1999）数"
    },
    {
      "indent": 3,
      "text": "The generator also adds namespace identifier \"NBN\" and ISO 3166 country code. Thus a URN based on F-code would in this case be for instance urn:nbn:fi-fe19991055.",
      "ja": "発電機はまた、名前空間識別子「NBN」とISO 3166国コードを追加します。 NBN：FI-fe19991055したがってFコードに基づいたURNは、この場合、インスタンスURNのためであろう。"
    },
    {
      "indent": 3,
      "text": "URNs created by the Web archiving application have similar overall structure, except that prefix (which may be defined by the operator) is fea and year is not used. An example: urn:nbn:fi-fea-5c5875e6e49ae649cad63e5ee4f6c346.",
      "ja": "ウェブアーカイブアプリケーションによって作成されたURNはFEAで、年が使用されていない（オペレータによって定義することができる）という接頭辞を除いて、同様の全体的な構造を有しています。例：URN：NBN：FI-FEA-5c5875e6e49ae649cad63e5ee4f6c346。"
    },
    {
      "indent": 3,
      "text": "F-codes never need any special encoding when used as URNs, since they consist of alphanumeric codes only (0-9, a-z). This is often the case for other national libraries' NBN systems as well.",
      "ja": "URNとして使用されるときに英数字コードのみ（0-9、-Z）から成るので、F-コードは、特別な符号化を必要としません。これは、同様に、多くの場合、他の国立図書館NBNシステムの場合です。"
    },
    {
      "indent": 0,
      "text": "3.3 Encoding Considerations and Lexical Equivalence",
      "section_title": true,
      "ja": "3.3符号化の考慮事項と字句等価"
    },
    {
      "indent": 3,
      "text": "Embedding NBNs within the URN framework usually presents no particular encoding problems, since all of the characters that can appear in commonly used NBN systems can be expressed in special encoding, as described in RFC 2141 [MOATS].",
      "ja": "URNの枠組み内NBNSを埋め込むことは、通常、RFC 2141 [堀]に記載されているように一般的に使用されるNBNシステムに表示できる文字の全てが、特別な符号化で表現することができるので、特に符号化の問題を提示しません。"
    },
    {
      "indent": 3,
      "text": "When an NBN is used as a URN, the namespace specific string will consist of three parts: prefix, consisting of either a two-letter ISO 3166 country code or other registered string, delimiting character which is either hyphen (-) or colon (:), and NBN string assigned by the national library. Delimiting characters are not lexically equivalent.",
      "ja": "ハイフン（ - ）のいずれかである文字区切り、2文字のISO 3166国コードや他の登録文字列のいずれかからなる、接頭辞やコロン（：NBNはURNとして使用する場合、名前空間の特定の文字列は、以下の3つの部分で構成されます：国立図書館によって割り当て）、およびNBN文字列。区切り文字は、辞書的に同等ではありません。"
    },
    {
      "indent": 3,
      "text": "Hyphen is always used for separating the prefix and the NBN string.",
      "ja": "ハイフンは常にプレフィックスとNBN文字列を分離するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Colon is used as the delimiting character if and only if a country code-based NBN namespace is split further in smaller sub-namespaces. If there are several national libraries in one country, these libraries can split their national namespace into smaller parts using this method.",
      "ja": "コロンは、区切り文字として使用されている場合にのみ国コードベースのNBN名前空間はさらに小さいサブ名前空間で分割されている場合。一つの国でいくつかの国立図書館がある場合は、これらのライブラリは、このメソッドを使用して小さな部分に自国の名前空間を分割することができます。"
    },
    {
      "indent": 3,
      "text": "A national library may also assign a trusted organisation(s) its own sub-namespace. For instance, the national library of Finland has given Statistics Finland (http://www.stat.fi/index_en.html) a sub-namespace \"st\" (e.g., urn:nbn:fi:st:). The Finnish Council of State (http://www.vn.fi/vn/english/index.htm) will use sub-namespace \"vn\" (e.g., urn:nbn:fi:vn).",
      "ja": "国立図書館はまた、信頼できる組織（s）は、独自のサブ名前空間を割り当てることができます。例えば、フィンランド国立図書館が与えられたフィンランド統計局（http://www.stat.fi/index_en.html）サブ名前空間「ST」（例えば、URN：NBN：Fiの：ST :)。国家のフィンランド評議会（http://www.vn.fi/vn/english/index.htm）は、サブ名前空間 \"VN\"（：NBN：Fiの：例えば、URNをVN）を使用します。"
    },
    {
      "indent": 3,
      "text": "Non-ISO 3166-prefixes, if used, must be registered on the global level. The Library of Congress will maintain the central register of reserved codes. This register will be available to the national libraries and other users in the Web.",
      "ja": "非ISO 3166-プレフィックス、使用している場合、グローバルレベルで登録する必要があります。米国議会図書館は、予約コードの中央のレジスタを維持します。このレジスタは、Webの国立図書館や他のユーザーに利用できるようになります。"
    },
    {
      "indent": 3,
      "text": "Sub-namespace codes beneath a country-code-based namespace need to be registered on the national level by the national library which assigned the code. The national register must be available in the Web and should also be linked to the global register maintained by the Library of Congress.",
      "ja": "国コードベースの名前空間の下にサブ名前空間のコードは、コードを割り当てられ、国家図書館で全国レベルに登録する必要があります。国内登録は、Webで利用可能でなければならず、また、米国議会図書館によって維持グローバルレジスタにリンクされなければなりません。"
    },
    {
      "indent": 3,
      "text": "Two-letter codes may not be used as non-ISO prefixes, since all such codes are reserved for existing and possible future ISO country codes. If there are several national libraries in one country who use the same prefix - for instance, a country code -, they need to agree on how to split the namespace between them.",
      "ja": "このようなすべてのコードは、既存および将来のISO国コードのために予約されているので、二文字のコードは、非ISOの接頭辞として使用することはできません。例えば、国コード -   - 同じプレフィックスを使用する一つの国のいくつかの国立図書館がある場合、それらは、それらの間の名前空間を分割する方法に同意する必要があります。"
    },
    {
      "indent": 3,
      "text": "Models: URN:NBN:<ISO 3166 country code>-<assigned NBN string> URN:NBN:<ISO 3166 country code>:<sub-namespace code>-<assigned NBN string> URN:NBN:<non-ISO 3166 prefix>-<assigned NBN string>",
      "ja": "モデル：URN：NBN：<ISO 3166国コード>  -  <割り当てられたNBN文字列> URN：NBN：<ISO 3166国コード>：<サブ名前空間コード>  -  <割り当てられたNBN文字列> URN：NBN：<非ISO 3166プレフィックス>  -  <割り当てられたNBN文字列>"
    },
    {
      "indent": 3,
      "text": "Examples: URN:NBN:fi-fe19981001 (A \"real\" URN assigned by the National Library of Finland).",
      "ja": "例：URN：NBN：FI-fe19981001（フィンランド国立図書館によって割り当てられた \"本物\" URN）。"
    },
    {
      "indent": 0,
      "text": "3.4 Resolution of NBN-based URNs",
      "section_title": true,
      "ja": "NBNベースのURNの3.4決議"
    },
    {
      "indent": 3,
      "text": "The (usually) country code-based prefix part of the URN namespace specific string will provide a guide to where to find a resolution service, and the NBN register will identify the assigning agency. Once the NBN-based URN resolution is in global usage, the number of prefixes will slowly approach and may eventually exceed the number of national libraries.",
      "ja": "（通常は）URN名前空間の特定の文字列の国コードベースの接頭部は、解像度サービスを検索する場所にガイドを提供し、そしてNBNレジスタが割り当て機関を識別する。 NBNベースのURN解決はグローバル使用になると、プレフィックスの数が徐々に近づき、最終的に国立図書館の数を超えることがあります。"
    },
    {
      "indent": 3,
      "text": "If NBN assignment for a given country is limited to the national bibliography database, then all NBN-based URNs for that country will be resolved there. In one model these databases contain detailed resource descriptions including URLs, which will point both to the copy of the document in the Internet and to the copy in the national library's (legal) deposit collection. Due to the limitations in the usage of legal deposit documents it is possible that the deposited electronic materials can not be delivered in electronic form outside the premises of the national library.",
      "ja": "特定の国のNBNの割り当てが全国書誌データベースに限定されている場合は、その国のすべてのNBNベースのURNが解決されます。一つのモデルでは、これらのデータベースは、インターネットでの文書のコピーに、国立図書館の（法的）預金コレクション内のコピーの両方を指しますされ、URLを含む詳細なリソース記述が含まれています。納本文書の使用量の制限により堆積電子材料は、国立図書館の敷地外に電子形式で配信することができない可能性があります。"
    },
    {
      "indent": 3,
      "text": "If it is possible for the authors and publishers to retrieve NBNs to Web documents and there is no obligation to deposit thus identified documents to the national library, URN resolution service is not possible without a national Web index and archive, maintained by the national library or other organisation(s). A Web index/archive will also resolve machine-generated URNs to the archived Web documents.",
      "ja": "著者や出版社がWeb文書にNBNSを取得することが可能であり、国立図書館にこのように同定された文書を堆積する義務がない場合は、URN解決サービスは、全国のWebインデックスとアーカイブなしでは不可能である、国立図書館によって維持されるか、または他の組織（複数可）。ウェブインデックス/アーカイブには、アーカイブされたWebドキュメントに機械生成のURNを解決します。"
    },
    {
      "indent": 0,
      "text": "3.5 Additional considerations",
      "section_title": true,
      "ja": "3.5その他の考慮事項"
    },
    {
      "indent": 3,
      "text": "Guidelines adopted by each national library define when different versions of a work should be assigned the same or differing NBNs. These rules apply only if identifier assignment is done manually. If identifiers are allocated programmatically, the only criteria that can be used is that two documents which are identical on the bit level (have the same MD5 checksum) are deemed identical and should receive the same NBN. The likelihood of this happening to dissimilar documents is about 2^64, according to the RFC 1321.",
      "ja": "仕事の異なるバージョンが同じまたは異なるNBNSを割り当てる必要がある場合に、各国立図書館で採択されたガイドラインを定義します。これらのルールは、識別子の割り当てを手動で行われている場合にのみ適用されます。識別子が、プログラムに割り当てられている場合、使用することができる唯一の基準は、ビットレベル（同じMD5チェックサムを持っている）に同一である二つの文書が同一とみなされ、同じNBNを受けるべきであるということです。異種のドキュメントへのこの出来事の可能性は、RFC 1321によると、約2 ^ 64です。"
    },
    {
      "indent": 3,
      "text": "The rules governing the usage of NBNs are less strict than those specifying the usage of ISBN or other, better established identifiers. Since the NBNs have up to now been given only by the personnel (cataloguers) working in the national libraries, the identifier assignment has in practice been well co-ordinated.",
      "ja": "NBNSの使用を管理する規則は、ISBNまたは他の、より良好設立識別子の使用を指定するものより厳格です。 NBNSは今だけ国立図書館で働く職員（目録）によって与えられてまでいるので、識別子の割り当ては、実際にうまく協調されています。"
    },
    {
      "indent": 3,
      "text": "A NBN-based URN will resolve to single instance of the work if identifier assignment has been automatic. Given the nature of NBNs it is also likely that different versions of the same work will receive different NBNs even if the identifier is given manually.",
      "ja": "識別子割り当てが自動されている場合NBNベースURNは、ワークの単一のインスタンスに解決します。 NBNSの性質を考えると、識別子を手動で指定された場合でも、同じ仕事の異なるバージョンが異なるNBNSを受けることもありそうです。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document proposes means of encoding several existing bibliographic identifiers within the URN framework. This document does not discuss resolution except at a very generic level; thus questions of secure or authenticated resolution mechanisms are out of scope. It does not address means of validating the integrity or authenticating the source or provenance of URNs that contain bibliographic identifiers. Issues regarding intellectual property rights associated with objects identified by the various bibliographic identifiers are also beyond the scope of this document, as are questions about rights to the databases that might be used to construct resolvers.",
      "ja": "この文書では、URNの枠組みの中で、いくつかの既存の書誌の識別子を符号化する手段を提案しています。この文書では、非常に一般的なレベルで除い解像度については説明しません。したがって、セキュアまたは認証された解決メカニズムの問題は適用範囲外です。これは、整合性を検証したり書誌識別子が含まれているのURNのソースまたは出所を認証する手段に対応していません。リゾルバを構築するために使用されるかもしれないデータベースへの権利についての質問がそうであるように、様々な書誌識別子で特定されたオブジェクトに関連付けられた知的財産権に関する問題は、この文書の範囲外でもあります。"
    },
    {
      "indent": 0,
      "text": "5. Namespace registration",
      "section_title": true,
      "ja": "5.名前空間の登録"
    },
    {
      "indent": 3,
      "text": "URN Namespace ID Registration for the National Bibliography Number (NBN)",
      "ja": "全国書誌番号（NBN）のためのURN名前空間IDの登録"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "ja": "名前空間ID："
    },
    {
      "indent": 3,
      "text": "NBN",
      "ja": "NBN"
    },
    {
      "indent": 3,
      "text": "This Namespace ID has been in production use in demonstrator systems since summer 1998; thousands of URNs from this namespace have already been delivered in Finland, Sweden and Norway.",
      "ja": "この名前空間IDは、夏1998年から実証システムの生産に使用されています。この名前空間からのURNの数千人はすでに、フィンランド、スウェーデン、ノルウェーで配信されています。"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "ja": "登録情報："
    },
    {
      "indent": 3,
      "text": "Version: 3 Date: 2001-01-30 The first registration of the NID \"NBN\" was done via the URN WG in 1998. The second, slightly edited registration request was done in 1999.",
      "ja": "バージョン：3日：2001-01-30 NID「NBN」の最初の登録が第二、少し編集した登録要求が1999年に行われた1998年にURN WGを介して行われました。"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "ja": "名前空間の宣言された登録者："
    },
    {
      "indent": 3,
      "text": "Name: Juha Hakala E-mail: juha.hakala@helsinki.fi Affiliation: Helsinki University Library - The National Library of Finland, Conference of European National Librarians (CENL) and Conference of Directors of National Libraries (CDNL) Address: P.O.Box 26, 00014 Helsinki University, Finland",
      "ja": "名前：ユハHakala Eメール：juha.hakala@helsinki.fi所属：ヘルシンキ大学図書館 - フィンランド国立図書館、ヨーロッパの国立図書館の会議（CENL）と国立図書館（CDNL）アドレスの取締役会議：私書箱26 、00014ヘルシンキ大学、フィンランド"
    },
    {
      "indent": 3,
      "text": "Both CENL and CDNL made decisions to foster the usage of URNs during 1998. The latter organisation has set up a working group for this purpose. One item in the common work plan is utilisation of national bibliography numbers as URNs for identification of grey literature published in the Internet. The NBN namespace will be available for free for all national libraries in the world.",
      "ja": "CENLとCDNLはどちらも後者の組織は、この目的のためにワーキンググループを設置している1998年の間のURNの利用を促進するための意思決定をしました。灰色文献の同定のためのURNはインターネットに公開された一般的な作業計画における一つの項目は、全国書誌番号の利用です。 NBN名前空間は、世界のすべての国立図書館のために無料で利用できるようになります。"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure:",
      "ja": "構文構造の宣言："
    },
    {
      "indent": 3,
      "text": "The namespace specific string will consist of three parts:",
      "ja": "名前空間の特定の文字列は、以下の3つの部分で構成されます："
    },
    {
      "indent": 3,
      "text": "prefix, consisting of either a two-letter ISO 3166 country code or other registered string and sub-namespace codes,",
      "ja": "接頭辞、2文字のISO 3166国コードや他の登録文字列とサブ名前空間のコードのいずれかからなります、"
    },
    {
      "indent": 3,
      "text": "delimiting characters (colon (:), or hyphen (-), and",
      "ja": "区切り文字（コロン（:)、またはハイフン（ - ）、および"
    },
    {
      "indent": 3,
      "text": "NBN string assigned by the national library.",
      "ja": "国立図書館によって割り当てられNBN文字列。"
    },
    {
      "indent": 3,
      "text": "Colon is used as a delimiting character only within the prefix, between ISO 3166 country code and sub-namespace code, which splits the national namespace into smaller parts. This technique can be used when there are several national libraries, which all need their own namespaces, or when the national library allows trusted partners to set up their own sub-namespaces within the national NBN namespace.",
      "ja": "コロンは、小さな部分に国家の名前空間を分割ISO 3166国コードとサブ名前空間のコード、間の唯一の接頭辞内の区切り文字として使用されています。すべてが自分の名前空間を必要とするいくつかの国立図書館がある場合は、この技術を用いることができ、または国立図書館は、信頼できるパートナーが全国NBN名前空間内、独自のサブ名前空間を設定することができますとき。"
    },
    {
      "indent": 3,
      "text": "Dividing non-ISO 3166-based namespaces further with sub-namespace codes is not allowed.",
      "ja": "サブ名前空間のコードで、さらに非ISO 3166ベースの名前空間を分割することはできません。"
    },
    {
      "indent": 3,
      "text": "Hyphen is used as a delimiting character between the prefix and the NBN string. Within the NBN string, hyphen can be used for separating different sections of the code from one another.",
      "ja": "ハイフンは、プレフィックスとNBN文字列間の区切り文字として使用されています。 NBN文字列内に、ハイフンは、互いに符号の異なる部分を分離するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "Non-ISO prefixes used instead of the ISO country code must be registered. A global registry, maintained by the Library of Congress, will be created and made available via the Web. Contact information: nbn.register@loc.gov.us.",
      "ja": "代わりにISOの国コードを使用した非ISOプレフィックスを登録する必要があります。米国議会図書館によって維持グローバルレジストリは、作成したWeb経由で利用可能になります。連絡先情報：nbn.register@loc.gov.us。"
    },
    {
      "indent": 3,
      "text": "All two-letter codes are reserved for existing and possible future ISO country codes and may not be used as non-ISO prefixes.",
      "ja": "すべての2文字のコードは、既存および将来のISO国コードのために予約されており、非ISOの接頭辞として使用することはできません。"
    },
    {
      "indent": 3,
      "text": "Sub-namespace codes must be registered on the national level by the national library which assigned the code. The register must be available via the Web, and it should be accessible via the global registry set up by the Library of Congress.",
      "ja": "サブ名前空間コードは、コードを割り当て国立図書館によって国家レベルに登録されなければなりません。レジスタは、Web経由で利用可能でなければならない、そしてそれは米国議会図書館が設定したグローバルなレジストリを介してアクセスする必要があります。"
    },
    {
      "indent": 3,
      "text": "Models:",
      "ja": "モデル："
    },
    {
      "indent": 3,
      "text": "URN:NBN:<ISO 3166 country code>-<assigned NBN string> URN:NBN:<ISO 3166 country code:sub-namespace code>-<assigned NBN string> URN:NBN:<non-ISO 3166 prefix>-<assigned NBN string>",
      "ja": "URN：NBN：<ISO 3166国コード>  -  <割り当てられたNBN文字列> URN：NBN：<ISO 3166国コード：サブ名前空間のコード>  -  <割り当てられたNBN文字列> URN：NBN：<非ISO 3166のプレフィックス>  -  <割り当てられたNBN文字列>"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 3,
      "text": "A country code-based URN: URN:NBN:fi-fe19981001 (A URN assigned by the National Library of Finland).",
      "ja": "国コードベースのURN：URN：NBN：FI-fe19981001（フィンランド国立図書館によって割り当てられたURN）。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "ja": "関連の補助ドキュメント："
    },
    {
      "indent": 3,
      "text": "National Bibliography Number (NBN) is a generic name referring to a group of identifier systems used by the national libraries for identification of deposited publications which lack an identifier, or to descriptive metadata (cataloguing) that describes the resources. Each national library uses its own NBN system independently of other national libraries; there is no global authority which controls syntax of these identifier systems.",
      "ja": "全国書誌番号（NBN）は、リソースを記述する識別子を持たない、または記述メタデータ（カタログ）堆積出版物の同定のための国立図書館が使用する識別子システムのグループを指す総称です。各国立図書館には、独立して、他の国立図書館の独自のNBNシステムを使用しています。これらの識別子システムの構文を制御グローバルな権限がありません。"
    },
    {
      "indent": 3,
      "text": "Each national library can decide freely which resources will receive NBNs. These identifiers have traditionally been assigned to documents that do not have a publisher-assigned identifier, but are nevertheless catalogued to the national bibliography. Typically identification of grey publications have largely been dependent on NBNs.",
      "ja": "各国立図書館は、NBNSを受け取ることになりますどのリソースを自由に決めることができます。これらの識別子は、伝統的に出版社-IDが割り当てられていない文書に割り当てられているが、それにもかかわらず、全国書誌にカタログ化されています。典型的には、グレーの刊行物の同定は、主NBNSに依存していました。"
    },
    {
      "indent": 3,
      "text": "Some national libraries (Finland, Norway, Sweden) have established Web-based URN generators, which enable authors and publishers to fetch NBN-based URNs for their network documents.",
      "ja": "いくつかの国立図書館（フィンランド、ノルウェー、スウェーデン）は、ネットワーク文書のNBNベースのURNを取得するために、著者や出版社を可能にするWebベースのURNの発電機を、確立しています。"
    },
    {
      "indent": 3,
      "text": "Both syntax and scope of NBNs is decided by each national library independently. Typically, a NBN consist of one or more letters and a number.",
      "ja": "NBNSの両方の構文と範囲は、それぞれ独立国家図書館によって決定されます。典型的には、NBNは、一つ以上の文字と数字から成ります。"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "ja": "識別子一意性の考慮事項："
    },
    {
      "indent": 3,
      "text": "NBN strings assigned by two national libraries may be identical. For this reason usage of a controlled prefix in the namespace specific string is obligatory in order to guarantee global uniqueness of NBN-based URNs.",
      "ja": "2つの国立図書館によって割り当てNBN文字列が同一であってもよいです。このような理由から、名前空間の特定の文字列で制御さ接頭辞の使用は、NBNベースのURNのグローバル一意性を保証するために必須です。"
    },
    {
      "indent": 3,
      "text": "In the national level, libraries utilise different policies for guaranteeing uniqueness. A national library may automate the delivery of NBN-based URNs. In this case, the NBNs are assigned sequentially by a program (URN generator).",
      "ja": "国家レベルでは、ライブラリは、一意性を保証するために異なるポリシーを利用しています。国立図書館は、NBNベースのURNの配信を自動化することができます。この場合、NBNSは、プログラム（URNジェネレータ）によって連続的に割り当てられます。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "ja": "識別子の永続性の考慮事項："
    },
    {
      "indent": 3,
      "text": "Persistence of the NBNs as identifiers is guaranteed by the persistence of national libraries and information systems, such as national bibliographies, maintained by them. NBNs have been used for several centuries for printed materials. NBN-based identification of electronic documents is a recent practice, but it is likely to continue for a very long time.",
      "ja": "識別子としてNBNSの持続性は、そのようなそれらによって維持全国書誌として、国立図書館と情報システムの持続性によって保証されています。 NBNSは印刷物のためのいくつかの何世紀にもわたって使用されています。電子文書のNBNベースの識別は、最近の練習ですが、非常に長い時間続く可能性が高いです。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "ja": "識別子割り当てのプロセス。"
    },
    {
      "indent": 3,
      "text": "Assignment of NBN-based URNs is always controlled on national level by the national library / national libraries. The Conference of Directors of National Librarians (CDNL) has established in 1999 a task force, which will co-ordinate the URN usage in all national libraries.",
      "ja": "NBNベースのURNの割り当ては、常に国家図書館/国立図書館で、国家レベルで制御されています。国立図書館の取締役会議（CDNL）は、1999年に全ての国立図書館でURNの使用状況をコーディネイトしますタスクフォースを設立しました。"
    },
    {
      "indent": 3,
      "text": "National libraries may choose different strategies in assigning NBN-based URNs. One option is assignment by the library personnel only. This is done when the document is catalogued into the national bibliography. Thus in this case the national bibliography database will serve as the URN resolution service.",
      "ja": "国立図書館は、NBNベースのURNを割り当てることで異なる戦略を選択することができます。 1つのオプションは、ライブラリのみ担当者の割り当てです。文書が全国書誌にカタログされたときにこれが行われます。したがって、この場合には全国書誌データベースはURN解決サービスとして機能します。"
    },
    {
      "indent": 3,
      "text": "A national library may also set up a URN generator (generators), and allow publishers and authors to retrieve NBN-based URNs from there. In this case there is no guarantee that the identified resource will ever be catalogued into the national bibliography, and URN resolution is dependent on Web index/archive.",
      "ja": "国立図書館もURNジェネレータ（発電機）を設定し、出版社や著者がそこからNBNベースのURNを取得することを可能にします。この場合、特定されたリソースは、これまでに全国書誌にカタログされます、とURNの解像度は、Webインデックス/アーカイブに依存しているという保証はありません。"
    },
    {
      "indent": 3,
      "text": "Process for identifier resolution:",
      "ja": "識別子の解決のためのプロセス。"
    },
    {
      "indent": 3,
      "text": "URNs based on NBNs will be primarily resolved via the national bibliography databases. In one model these databases contain detailed resource descriptions including URLs, which will point both to the copy of the document in the Internet and to the copy in the national library's (legal) deposit collection. Due to the limitations in the usage of legal deposit documents it is possible that the deposited materials can not be delivered outside the premises of the national library.",
      "ja": "NBNSに基づいたURNは、主に全国書誌データベースを経由して解決されます。一つのモデルでは、これらのデータベースは、インターネットでの文書のコピーに、国立図書館の（法的）預金コレクション内のコピーの両方を指しますされ、URLを含む詳細なリソース記述が含まれています。納本文書の使用量の制限により堆積された材料は、国立図書館の敷地外にお届けできない可能性があります。"
    },
    {
      "indent": 3,
      "text": "For those documents not catalogued into the national bibliography database URN resolution may take place via national or international Web indexes and/or archives. Nordic national libraries have established in autumn 2000 a joint initiative called Nordic Web Archive (NWA), which aims at creating a national Web archive into all Nordic countries. Indexes to these archive systems will be able to act as URN resolution services of any document which a) is or has been available via the Web, and b) had an URN embedded into it.",
      "ja": "全国書誌データベースのURNの解像度にカタログ化されていないものの文書のために国内または国際ウェブインデックスおよび/またはアーカイブを経由して行われてもよいです。北欧国家図書館は、2000年秋に全ての北欧諸国に国民Webアーカイブを作成することを目指し北欧のWebアーカイブ（NWA）と呼ばれる共同イニシアチブを、確立しています。これらのアーカイブシステムへのインデックスは、a）は、またはWeb経由で利用されていると、b）その中に埋め込まれたURNを持っていたすべての文書のURN解決サービスとして機能することができるようになります。"
    },
    {
      "indent": 3,
      "text": "Country code and additional sub-namespace information will provide a guide to where to find appropriate resolution services. For instance, if the country code is \"fi\", the primary resolution service is the national bibliography database. Secondary resolution service is the Web archive.",
      "ja": "国コードと追加のサブ名前空間情報は、適切な解決サービスを検索する場所へのガイドを提供します。国コードは「Fiあり」であれば例えば、主解決サービスは、全国書誌データベースです。セカンダリ解決サービスは、Webアーカイブです。"
    },
    {
      "indent": 3,
      "text": "Generally, there will be one or more resolution services specified for each country, depending on the assignment policy and services of the national library. If NBN assignment is limited to the national bibliography database, then all NBN-based URNs for that country will be resolved there. If the authors and publishers have been allowed to retrieve NBNs to their Web resources, URN resolution services require a national Web archive. If other organisations have been allowed to assign NBNs, they may also set up their own URN resolution services.",
      "ja": "一般的には、国立図書館の割り当てポリシーとサービスに応じて、それぞれの国のために指定された1つのまたはそれ以上の解像度のサービスが存在します。 NBNの割り当ては全国書誌データベースに限定されている場合は、その国のすべてのNBNベースのURNが解決されます。著者と出版社が自社のWebリソースにNBNSを取得するために許可されている場合は、URN解決サービスは、全国のWebアーカイブが必要です。他の組織は、NBNSを割り当てることが許されている場合、彼らはまた、独自のURN解決サービスを設定することもできます。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "ja": "字句等価のルール："
    },
    {
      "indent": 3,
      "text": "None in the global level. Any national library may provide its own rules, on the basis of its NBN syntax.",
      "ja": "グローバルレベルでなし。任意の国立図書館は、そのNBN構文に基づいて、独自のルールを提供することができます。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "ja": "URN構文に準拠："
    },
    {
      "indent": 3,
      "text": "All NBNs we know of are ASCII strings consisting of letters (a-z) and numbers (0-9). If NBN contains characters that are reserved in the URN syntax, this data must be presented in hex encoded form as defined in RFC 2141. A national library may limit the full scope of its NBN strings in URN usage in such a way that there are no reserved characters in the URN namespace specific strings.",
      "ja": "私たちが知っているすべてのNBNSは、ASCII文字からなる文字列（-Z）と数字（0-9）です。 NBNはURN構文で予約されている文字が含まれている場合は、国立図書館がありませんがあるようにURNの使用でそのNBN文字列の完全な範囲を制限することがRFC 2141で定義されているように、このデータは進符号化された形式で提示されなければなりませんURN名前空間の特定の文字列での予約文字。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "ja": "検証メカニズム："
    },
    {
      "indent": 3,
      "text": "None specified on the global level. A national library may use NBNs, which contain a checksum and can therefore be validated, but this is for the time being not a common practice.",
      "ja": "グローバルレベルで指定なし。国立図書館は、チェックサムが含まれているので、有効にすることができるNBNSを使用することができるが、これは一般的ではありません当分の間です。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "ja": "範囲："
    },
    {
      "indent": 3,
      "text": "Global.",
      "ja": "グローバル。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 3,
      "text": "[Daigle] Daigle, L., van Gulik, D., Iannella, R. and P. Faltstrom, \"URN Namespace Definition Mechanisms\", RFC 2611, June 1999.",
      "ja": "[Daigle氏] Daigle氏、L.、バンGulik、D.、Iannella、R.とP. Faltstrom、 \"URN名前空間定義メカニズム\"、RFC 2611、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[Lynch] Lynch, C., Preston, C. and R. Daniel, \"Using Existing Bibliographic Identifiers as Uniform Resource Names\", RFC 2288, February 1998.",
      "ja": "[リンチ]リンチ、C.、プレストン、C.とR.ダニエルは、RFC 2288、1998年2月 \"統一リソース名として既存の図書目録の識別子を使用します\"。"
    },
    {
      "indent": 3,
      "text": "[Moats] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "ja": "[堀]堀、R.、 \"URN構文\"、RFC 2141、1997年5月。"
    },
    {
      "indent": 0,
      "text": "7. Author's Address",
      "section_title": true,
      "ja": "7.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Juha Hakala Helsinki University Library - The National Library of Finland P.O. Box 26 FIN-00014 Helsinki University FINLAND",
      "ja": "ユハHakalaヘルシンキ大学図書館 - フィンランドの私書箱の国立図書館ボックス26 FIN-00014ヘルシンキ大学フィンランド"
    },
    {
      "indent": 3,
      "text": "EMail: juha.hakala@helsinki.fi",
      "ja": "メールアドレス：juha.hakala@helsinki.fi"
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}