{
  "title": {
    "text": "RFC 3916 - Requirements for Pseudo-Wire Emulation Edge-to-Edge (PWE3)",
    "ja": "RFC 3916 - 疑似ワイヤー・エミュレーションエッジツーエッジの要件（PWE3）"
  },
  "number": 3916,
  "created_at": "2019-10-25 03:08:11.578814+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       X. Xiao, Ed.\nRequest for Comments: 3916                           Riverstone Networks\nCategory: Informational                                D. McPherson, Ed.\n                                                          Arbor Networks\n                                                            P. Pate, Ed.\n                                                       Overture Networks\n                                                          September 2004",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Requirements for Pseudo-Wire Emulation Edge-to-Edge (PWE3)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（C）インターネット協会（2004）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes base requirements for the Pseudo-Wire Emulation Edge to Edge Working Group (PWE3 WG). It provides guidelines for other working group documents that will define mechanisms for providing pseudo-wire emulation of Ethernet, ATM, and Frame Relay. Requirements for pseudo-wire emulation of TDM (i.e., \"synchronous bit streams at rates defined by ITU G.702\") are defined in another document. It should be noted that the PWE3 WG standardizes mechanisms that can be used to provide PWE3 services, but not the services themselves.",
      "ja": "この文書では、Edge作業部会への疑似ワイヤー・エミュレーション・エッジ（PWE3 WG）のための基本要件について説明します。これは、イーサネット、ATMの疑似ワイヤのエミュレーションを提供するためのメカニズムを定義し、フレームリレーます他のワーキンググループのドキュメントのためのガイドラインを提供します。 TDM（すなわち、「同期ビットは、ITU G.702によって定義されたレートでストリーム」）の擬似ワイヤエミュレーションのための要件は、他の文書で定義されています。 PWE3 WGはPWE3サービスを提供するために使用することができる仕組みではなく、サービスそのものを標準化することに留意すべきです。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.   Introduction. . . . . . . . . . . . . . . . . . . . . . . . .  2\n     1.1.  What Are Pseudo Wires?. . . . . . . . . . . . . . . . .  2\n     1.2.  Current Network Architecture. . . . . . . . . . . . . .  3\n     1.3.  PWE3 as a Path to Convergence . . . . . . . . . . . . .  4\n     1.4.  Suitable Applications for PWE3. . . . . . . . . . . . .  4\n     1.5.  Summary . . . . . . . . . . . . . . . . . . . . . . . .  4\n2.   Terminology . . . . . . . . . . . . . . . . . . . . . . . . .  5\n3.   Reference Model of PWE3 . . . . . . . . . . . . . . . . . . .  6\n4.   Packet Processing . . . . . . . . . . . . . . . . . . . . . .  7\n     4.1.  Encapsulation . . . . . . . . . . . . . . . . . . . . .  7\n     4.2.  Frame Ordering. . . . . . . . . . . . . . . . . . . . .  8\n     4.3.  Frame Duplication . . . . . . . . . . . . . . . . . . .  8\n     4.4.  Fragmentation . . . . . . . . . . . . . . . . . . . . .  8",
      "raw": true
    },
    {
      "indent": 3,
      "text": "     4.5.  Consideration of Per-PSN Packet Overhead. . . . . . . .  9\n5.   Maintenance of Emulated Services. . . . . . . . . . . . . . .  9\n     5.1.  Setup and Teardown of Pseudo-Wires. . . . . . . . . . .  9\n     5.2.  Handling Maintenance Message of the Native Services . . 10\n     5.3.  PE-initiated Maintenance Messages . . . . . . . . . . . 10\n6.   Management of Emulated Services . . . . . . . . . . . . . . . 12\n     6.1.  MIBs. . . . . . . . . . . . . . . . . . . . . . . . . . 12\n     6.2.  General MIB Requirements. . . . . . . . . . . . . . . . 12\n     6.3.  Configuration and Provisioning. . . . . . . . . . . . . 13\n     6.4.  Performance Monitoring. . . . . . . . . . . . . . . . . 13\n     6.5.  Fault Management and Notifications. . . . . . . . . . . 13\n     6.6.  Pseudo-Wire Connection Verification and Traceroute. . . 13\n7.   Faithfulness of Emulated Services . . . . . . . . . . . . . . 13\n     7.1.  Characteristics of an Emulated Service. . . . . . . . . 14\n     7.2.  Service Quality of Emulated Services. . . . . . . . . . 14\n8.   Non-Requirements. . . . . . . . . . . . . . . . . . . . . . . 14\n9.   Quality of Service (QoS) Considerations . . . . . . . . . . . 15\n10.  Inter-domain Issues . . . . . . . . . . . . . . . . . . . . . 16\n11.  Security Considerations . . . . . . . . . . . . . . . . . . . 16\n12.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . . 17\n13.  References. . . . . . . . . . . . . . . . . . . . . . . . . . 17\n     13.1. Normative References. . . . . . . . . . . . . . . . . . 17\n     13.2. Informative References. . . . . . . . . . . . . . . . . 17\n14.  Authors' Addresses. . . . . . . . . . . . . . . . . . . . . . 18\n15.  Full Copyright Statement. . . . . . . . . . . . . . . . . . . 19",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 0,
      "text": "1.1. What Are Pseudo Wires?",
      "section_title": true,
      "ja": "1.1. 擬似ワイヤは何ですか？"
    },
    {
      "indent": 3,
      "text": "Pseudo Wire Emulation Edge-to-Edge (PWE3) is a mechanism that emulates the essential attributes of a service such as ATM, Frame Relay or Ethernet over a Packet Switched Network (PSN). The required functions of PWs include encapsulating service-specific PDUs arriving at an ingress port, and carrying them across a path or tunnel, managing their timing and order, and any other operations required to emulate the behavior and characteristics of the service as faithfully as possible.",
      "ja": "擬似ワイヤエミュレーションエッジ・ツー・エッジ（PWE3）は、ネットワーク（PSN）パケット交換を介してこのようなATM、フレームリレー、イーサネットなどのサービスの本質的な特性をエミュレートする機構です。 PWの必要な機能は、入力ポートに到着するサービス固有のPDUをカプセル化し、そして経路またはトンネルを横切ってそれらを保持する、それらのタイミングおよび順序を管理し、できるだけ忠実にサービスの挙動および特性をエミュレートするために必要な他の操作が挙げられます。"
    },
    {
      "indent": 3,
      "text": "From the customer perspective, the PW is perceived as an unshared link or circuit of the chosen service. However, there may be deficiencies that impede some applications from being carried on a PW. These limitations should be fully described in the appropriate service-specific documents and Applicability Statements.",
      "ja": "顧客の観点から、PWは、選択したサービスの非共有リンクまたは回路として知覚されます。しかし、PWで運ばれてから、いくつかのアプリケーションを妨げる欠陥があるかもしれません。これらの制限は、完全に適切なサービス固有のドキュメントと適用性声明に記述する必要があります。"
    },
    {
      "indent": 0,
      "text": "1.2. Current Network Architecture",
      "section_title": true,
      "ja": "1.2. 現在のネットワークアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "The following sections give some background on where networks are today and why they are changing. It also talks about the motivation to provide converged networks while continuing to support existing services. Finally, it discusses how PWs can be a solution for this dilemma.",
      "ja": "次のセクションでは、ネットワークが今日であり、なぜ彼らは変更される場所にいくつかの背景を与えます。また、既存のサービスをサポートするために継続しながら、統合ネットワークを提供するために、動機について語っています。最後に、PWSは、このジレンマのための解決策になることができます方法について説明します。"
    },
    {
      "indent": 0,
      "text": "1.2.1. Multiple Networks",
      "section_title": true,
      "ja": "1.2.1. 複数ネットワーク"
    },
    {
      "indent": 3,
      "text": "For any given service provider delivering multiple services, the current infrastructure usually consists of parallel or \"overlay\" networks. Each of these networks implements a specific service, such as Frame Relay, Internet access, etc. This is expensive, both in terms of capital expense and operational costs. Furthermore, the presence of multiple networks complicates planning. Service providers wind up asking themselves these questions:",
      "ja": "複数のサービスを提供する任意のサービスプロバイダの場合は、現在のインフラストラクチャは、通常、平行または「オーバーレイ」ネットワークで構成されています。これらのネットワークのそれぞれには、これは資本支出および運用コストの両面で、高価であるなど、フレームリレー、インターネットアクセス、などの特定のサービスを実装します。さらに、複数のネットワークの存在が計画を複雑にします。サービスプロバイダは、自分自身にこれらの質問をする羽目になる。"
    },
    {
      "indent": 3,
      "text": "- Which of my networks do I build out? - How many fibers do I need for each network? - How do I efficiently manage multiple networks?",
      "ja": " - 私は私のネットワークのどちらを構築できますか？ - 私は、ネットワークごとにどのように多くの繊維が必要ですか？ - どのように私は効率的に複数のネットワークを管理するのですか？"
    },
    {
      "indent": 3,
      "text": "A converged network helps service providers answer these questions in a consistent and economical fashion.",
      "ja": "コンバージドネットワークは、サービスプロバイダは、一貫して経済的な方法でこれらの質問に答えることができます。"
    },
    {
      "indent": 0,
      "text": "1.2.2. Transition to a Packet-Optimized Converged Network",
      "section_title": true,
      "ja": "1.2.2. パケット最適化された統合ネットワークへの移行"
    },
    {
      "indent": 3,
      "text": "In order to maximize return on their assets and minimize their operating costs, service providers often look to consolidate the delivery of multiple service types onto a single networking technology.",
      "ja": "彼らの資産のリターンを最大化し、その運用コストを最小限に抑えるためには、サービスプロバイダーは、多くの場合、単一のネットワーク技術に複数のサービスタイプの配信を統合するために見えます。"
    },
    {
      "indent": 3,
      "text": "As packet traffic takes up a larger and larger portion of the available network bandwidth, it becomes increasingly useful to optimize public networks for the Internet Protocol. However, many service providers are confronting several obstacles in engineering packet-optimized networks. Although Internet traffic is the fastest growing traffic segment, it does not generate the highest revenue per bit. For example, Frame Relay traffic currently generates higher revenue per bit than native IP services do. Private line TDM services still generate even more revenue per bit than does Frame Relay. In addition, there is a tremendous amount of legacy equipment deployed within public networks that does not communicate using the Internet Protocol. Service providers continue to utilize non-IP equipment to deploy a variety of services, and see a need to interconnect this legacy equipment over their IP-optimized core networks.",
      "ja": "パケットトラフィックは、使用可能なネットワーク帯域幅のますます大きな部分を占めるように、インターネットプロトコルのための公共ネットワークを最適化することがますます便利になります。しかし、多くのサービスプロバイダーは、エンジニアリングパケットに最適化されたネットワークにおけるいくつかの障害に直面しています。インターネットトラフィックが急成長しているトラフィックセグメントではあるが、それはビットあたりの最高の収益を生成しません。たとえば、フレームリレートラフィックは、現在、ネイティブIPサービスが何よりもビットあたりの高い収入を生成します。専用線TDMサービスは、まだフレームリレーよりもビットあたりさらに多くの収益を生成します。また、インターネットプロトコルを使用して通信しない公共ネットワーク内に配備レガシー機器の膨大な量があります。サービスプロバイダは、様々なサービスを展開するために、非IP機器を利用し、そのIPに最適化されたコアネットワークを介して、このレガシー機器を相互接続する必要性を見続けます。"
    },
    {
      "indent": 0,
      "text": "1.3. PWE3 as a Path to Convergence",
      "section_title": true,
      "ja": "1.3. コンバージェンスへのパスとしてPWE3"
    },
    {
      "indent": 3,
      "text": "How do service providers realize the capital and operational benefits of a new packet-based infrastructure, while leveraging the existing equipment and also protecting the large revenue stream associated with this equipment? How do they move from mature Frame Relay or ATM networks, while still being able to provide these lucrative services?",
      "ja": "既存の設備を活用し、また、この装置に関連する大きな収入源を保護しながら、どのようにサービスプロバイダは、資本と新しいパケットベースのインフラストラクチャの運用上の利点を実現していますか？まだこれらの有利なサービスを提供することが可能でありながら、どのように彼らは、成熟したフレームリレーやATMネットワークから移動しますか？"
    },
    {
      "indent": 3,
      "text": "One possibility is the emulation of circuits or services via PWs. Circuit emulation over ATM and interworking of Frame Relay and ATM have already been standardized. Emulation allows existing services to be carried across the new infrastructure, and thus enables the interworking of disparate networks.",
      "ja": "一つの可能​​性はPWを経由して回路やサービスのエミュレーションです。回路のATM上のエミュレーションとフレームリレーやATMのインターワーキングは、すでに標準化されています。エミュレーションは、既存のサービスは、新しいインフラストラクチャ全体に運ばれることを可能にするため、異なるネットワークのインターワーキングを可能にします。"
    },
    {
      "indent": 3,
      "text": "Implemented correctly, PWE3 can provide a means for supporting today's services over a new network.",
      "ja": "正しく実装、PWE3は、新しいネットワーク上で、今日のサービスをサポートするための手段を提供することができます。"
    },
    {
      "indent": 0,
      "text": "1.4. Suitable Applications for PWE3",
      "section_title": true,
      "ja": "1.4.  PWE3に適したアプリケーション"
    },
    {
      "indent": 3,
      "text": "What makes an application suitable (or not) for PWE3 emulation? When considering PWs as a means of providing an application, the following questions must be considered:",
      "ja": "何がPWE3エミュレーションに適した（またはしない）アプリケーションを作りますか？アプリケーションを提供する手段としてのPWを考慮すると、以下の質問を考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "- Is the application sufficiently deployed to warrant emulation? - Is there interest on the part of service providers in providing an emulation for the given application? - Is there interest on the part of equipment manufacturers in providing products for the emulation of a given application? - Are the complexities and limitations of providing an emulation worth the savings in capital and operational expenses?",
      "ja": " - アプリケーションが十分にエミュレーションを保証するために配備されていますか？ - 特定のアプリケーションのエミュレーションを提供するサービスプロバイダの一部に関心がありますか？ - 指定したアプリケーションのエミュレーションのための製品を提供する機器メーカーの一部に関心がありますか？ - 資本コストと運用コストの節約価値のエミュレーションを提供するの複雑さと制限はありますか？"
    },
    {
      "indent": 3,
      "text": "If the answer to all four questions is \"yes\", then the application is likely to be a good candidate for PWE3. Otherwise, there may not be sufficient overlap between the customers, service providers, equipment manufacturers and technology to warrant providing such an emulation.",
      "ja": "すべての4つの質問に対する答えが「イエス」である場合、アプリケーションはPWE3のための良い候補である可能性が高いです。そうでなければ、このようエミュレーションを提供する保証するために、顧客、サービスプロバイダ、機器メーカーと技術の間の十分な重複がないかもしれません。"
    },
    {
      "indent": 0,
      "text": "1.5. Summary",
      "section_title": true,
      "ja": "1.5. 概要"
    },
    {
      "indent": 3,
      "text": "To maximize the return on their assets and minimize their operational costs, many service providers are looking to consolidate the delivery of multiple service offerings and traffic types onto a single IP-optimized network.",
      "ja": "彼らの資産のリターンを最大化し、その運用コストを最小限に抑えるために、多くのサービスプロバイダは、単一のIP-最適化されたネットワーク上に複数のサービスの提供とトラフィックタイプの配信を統合しようとしています。"
    },
    {
      "indent": 3,
      "text": "In order to create this next-generation converged network, standard methods must be developed to emulate existing telecommunications formats such as Ethernet, Frame Relay, and ATM over IP-optimized core networks. This document describes requirements for accomplishing this goal.",
      "ja": "この次世代ネットワーク収束作成するために、標準的な方法は、IP最適化コアネットワークを介して、イーサネット（登録商標）、フレームリレー、ATMなどの既存の通信フォーマットをエミュレートするために開発されなければなりません。この文書では、この目標を達成するための要件について説明します。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALLNOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119.",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHALLNOT\"、 \"推奨\"、 \"すべきではない\" \"べきである\"、 \"MAY\"、および \"省略可能\" にしていますRFC 2119に記載されるように解釈されます。"
    },
    {
      "indent": 3,
      "text": "Some terms used throughout this document are listed below.",
      "ja": "本書で用いられるいくつかの用語を以下に記載されています。"
    },
    {
      "indent": 3,
      "text": "Attachment Circuit (AC) The physical or virtual circuit attaching a CE to a PE. An AC can be a Frame Relay DLCI, an ATM VPI/VCI, an Ethernet port, a VLAN, a HDLC link, a PPP connection on a physical interface, a PPP session from an L2TP tunnel, an MPLS LSP, etc.",
      "ja": "アタッチメント回路（AC）PEとCEを取り付ける物理または仮想回路。 ACは、フレームリレーDLCI、ATM VPI / VCI、イーサネットポート、VLAN、等HDLCリンク、物理インタフェース、L2TPトンネルからのPPPセッション、MPLS LSP上のPPP接続とすることができます"
    },
    {
      "indent": 3,
      "text": "Customer Edge (CE) A device where one end of a service originates and/or terminates. The CE is not aware that it is using an emulated service rather than a native service.",
      "ja": "顧客エッジ（CE）サービスの一端を発信及び/又は終了デバイス。 CEは、それがエミュレートされたサービスではなく、ネイティブのサービスを使用していることを認識していません。"
    },
    {
      "indent": 3,
      "text": "Packet Switched Network (PSN) Within the context of PWE3, this is a network using IP or MPLS as the mechanism for packet forwarding.",
      "ja": "パケットは、これは、パケット転送のためのメカニズムとして、IPまたはMPLSを使用したネットワークである、PWE3のコンテキスト内のネットワーク（PSN）をスイッチ。"
    },
    {
      "indent": 3,
      "text": "Provider Edge (PE) A device that provides PWE3 to a CE.",
      "ja": "プロバイダエッジ（PE）CEにPWE3を提供する装置。"
    },
    {
      "indent": 3,
      "text": "Pseudo Wire (PW) A mechanism that carries the essential elements of an emulated circuit from one PE to another PE over a PSN.",
      "ja": "疑似ワイヤ（PW）PSNを介して1つのPEから別のPEにエミュレートされた回路の必須要素を搬送機構。"
    },
    {
      "indent": 3,
      "text": "Pseudo Wire Emulation Edge to Edge (PWE3) A mechanism that emulates the essential attributes of a service (such as a T1 leased line or Frame Relay) over a PSN.",
      "ja": "擬似ワイヤエミュレーションエッジ（PWE3）PSN上（例えばT1専用回線やフレームリレーのような）サービスの本質的な特性をエミュレートする機構をEdgeに。"
    },
    {
      "indent": 3,
      "text": "Pseudo Wire PDU A Protocol Data Unit (PDU) sent on the PW that contains all of the data and control information necessary to emulate the desired service.",
      "ja": "すべてのデータが含まれており、所望のサービスをエミュレートするために必要な制御情報をPWに送ら擬似ワイヤPDU Aプロトコルデータユニット（PDU）。"
    },
    {
      "indent": 3,
      "text": "PSN Tunnel A tunnel across a PSN inside which one or more PWs can be carried.",
      "ja": "PSNトンネルの一の以上のPWを実施することができる内部PSNトンネルを横切っ。"
    },
    {
      "indent": 0,
      "text": "3. Reference Model of PWE3",
      "section_title": true,
      "ja": "PWE3の3リファレンスモデル"
    },
    {
      "indent": 3,
      "text": "A pseudo-wire (PW) is a connection between two provider edge (PE) devices which connects two attachment circuits (ACs). An AC can be a Frame Relay DLCI, an ATM VPI/VCI, an Ethernet port, a VLAN, a HDLC link, a PPP connection on a physical interface, a PPP session from an L2TP tunnel, an MPLS LSP, etc.",
      "ja": "疑似ワイヤ（PW）は、二つの接続回線を接続する2プロバイダエッジ（PE）デバイス（ACS）との間の接続です。 ACは、フレームリレーDLCI、ATM VPI / VCI、イーサネットポート、VLAN、等HDLCリンク、物理インタフェース、L2TPトンネルからのPPPセッション、MPLS LSP上のPPP接続とすることができます"
    },
    {
      "indent": 3,
      "text": "                 |<------- Pseudo Wire ------>|\n                 |                            |\n                 |    |<-- PSN Tunnel -->|    |\n                 V    V                  V    V\n                 +----+                  +----+\n+-----+          | PE1|==================| PE2|          +-----+\n|     |----------|............PW1.............|----------|     |\n| CE1 |          |    |                  |    |          | CE2 |\n|     |----------|............PW2.............|----------|     |\n+-----+  ^       |    |==================|    |          +-----+\n      ^  |       +----+                  +----+          ^\n      |  |   Provider Edge 1         Provider Edge 2     |\n      |  |                                               |\n      | Attachment Circuit                               |\n      |                                                  |\n      |<-------------- Emulated Service ---------------->|",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Customer Customer Edge 1 Edge 2",
      "ja": "カスタマー・カスタマーエッジ1つのエッジ2"
    },
    {
      "indent": 21,
      "text": "Figure 1: PWE3 Reference Model",
      "ja": "図1：PWE3参照モデル"
    },
    {
      "indent": 3,
      "text": "During the setup of a PW, the two PEs will be configured or will automatically exchange information about the service to be emulated so that later they know how to process packets coming from the other end. After a PW is set up between two PEs, frames received by one PE from an AC are encapsulated and sent over the PW to the remote PE, where native frames are re-constructed and forwarded to the other CE. For a detailed PWE3 architecture overview, readers should refer to the PWE3 architecture document [PWE3_ARCH].",
      "ja": "PWのセットアップ中に、2個のPEが設定されます以降、彼らは他の端から来るパケットを処理する方法を知っているように、自動的にエミュレートされるサービスについての情報を交換します。 PWは二つのPE間に設定された後、ACから1つのPEによって受信されたフレームがカプセル化され、ネイティブフレームを再構築し、他のCEに転送されたリモートPEにPWを介して送信されます。詳細PWE3アーキテクチャの概要については、読者は[PWE3_ARCH] PWE3アーキテクチャ文書を参照してください。"
    },
    {
      "indent": 3,
      "text": "This document does not assume that a particular type of PWs (e.g., [L2TPv3] sessions or [MPLS] LSPs) or PSNs (e.g., IP or MPLS) is used. Instead, it describes generic requirements that apply to all PWs and PSNs, for all services including Ethernet, ATM, and Frame Relay, etc.",
      "ja": "この文書は、のPW（例えば、[L2TPv3の]セッションまたは[MPLS]のLSP）またはのPSN（例えば、IPまたはMPLS）の特定のタイプが使用されることを想定していません。その代わりに、など、イーサネット、ATMなど、すべてのサービスのすべてのPWとのPSNに適用される一般的な要件を、説明し、フレームリレー"
    },
    {
      "indent": 0,
      "text": "4. Packet Processing",
      "section_title": true,
      "ja": "4.パケット処理"
    },
    {
      "indent": 3,
      "text": "This section describes data plane requirements for PWE3.",
      "ja": "このセクションでは、PWE3のためのデータプレーン要件について説明します。"
    },
    {
      "indent": 0,
      "text": "4.1. Encapsulation",
      "section_title": true,
      "ja": "4.1. カプセル化"
    },
    {
      "indent": 3,
      "text": "Every PE MUST provide an encapsulation mechanism for PDUs from an AC. It should be noted that the PDUs to be encapsulated may or may not contain L2 header information. This is service specific. Every PWE3 service MUST specify what the PDU is.",
      "ja": "すべてのPEは、ACからのPDUのカプセル化メカニズムを提供しなければなりません。 PDUがL2ヘッダ情報を含んでも含まなくてもよい、またはカプセル化されることに留意すべきです。これは、サービス固有のものです。すべてのPWE3サービスは、PDUが何であるかを指定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "A PW header consists of all the header fields in a PW PDU that are used by the PW egress to determine how to process the PDU. The PSN tunnel header is not considered as part of the PW header.",
      "ja": "PWヘッダはPDUを処理する方法を決定するためにPWの出口で使用されるPWのPDU内のすべてのヘッダフィールドから構成されています。 PSNトンネルヘッダは、PWヘッダの一部として考慮されていません。"
    },
    {
      "indent": 3,
      "text": "Specific requirements on PDU encapsulation are listed below.",
      "ja": "PDUのカプセル化の具体的な要件は以下のとおりです。"
    },
    {
      "indent": 0,
      "text": "4.1.1. Conveyance of Necessary L2 Header Information",
      "section_title": true,
      "ja": "4.1.1. 必要なL2ヘッダ情報の伝達"
    },
    {
      "indent": 3,
      "text": "The egress of a PW needs some information, e.g., which native service the PW PDUs belong to, and possibly some L2 header information, in order to know how to process the PDUs received. A PWE3 encapsulation approach MUST provide some mechanism for conveying such information from the PW ingress to the egress. It should be noted that not all such information must be carried in the PW header of the PW PDUs. Some information (e.g., service type of a PW) can be stored as state information at the egress during PW setup.",
      "ja": "PWの出口は、PWのPDUが受信されたPDUを処理する方法を知るために、いくつかのL2ヘッダ情報可能性に属し、そのネイティブサービス、例えば、いくつかの情報を必要とします。 PWE3カプセル化アプローチは、出口にPW侵入からそのような情報を伝達するためのいくつかのメカニズムを提供しなければなりません。すべてのそのような情報は、PW PDUのPWヘッダで運ばれなければならないことに留意すべきです。いくつかの情報（例えば、PWのサービスタイプ）PWセットアップ中出口における状態情報として記憶することができます。"
    },
    {
      "indent": 0,
      "text": "4.1.2. Support of Variable Length PDUs",
      "section_title": true,
      "ja": "4.1.2. 可変長のPDUのサポート"
    },
    {
      "indent": 3,
      "text": "A PWE3 approach MUST accommodate variable length PDUs, if variable length PDUs are allowed by the native service. For example, a PWE3 approach for Frame Relay MUST accommodate variable length frames.",
      "ja": "可変長のPDUがネイティブサービスにより許可されている場合PWE3アプローチは、可変長のPDUを収容しなければなりません。例えば、フレームリレー用PWE3アプローチは、可変長フレームを収容しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.3. Support of Multiplexing and Demultiplexing",
      "section_title": true,
      "ja": "4.1.3. 多重・分離のサポート"
    },
    {
      "indent": 3,
      "text": "If a service in its native form is capable of grouping multiple circuits into a \"trunk\", e.g., multiple ATM VCCs in a VPC or multiple Ethernet 802.1Q interfaces in a port, some mechanism SHOULD be provided so that a single PW can be used to connect two end-trunks. From encapsulation perspective, sufficient information MUST be carried so that the egress of the PW can demultiplex individual circuits from the PW.",
      "ja": "その天然の形態でサービスが、例えば、VPC内の複数のATMのVCCまたはポートで複数のイーサネット802.1Qインターフェイス、「トランク」に複数の回路をグループ化することが可能である場合、単一のPWを使用することができるように、いくつかの機構が提供されるべきです2つのエンドトランクを接続します。 PWの出口がPWからの個々の回路を分離することができるようにカプセル化の観点から、十分な情報が実行されなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.4. Validation of PW-PDU",
      "section_title": true,
      "ja": "4.1.4.  PW-PDUの検証"
    },
    {
      "indent": 3,
      "text": "Most L2 frames have a checksum field to assure frame integrity. Every PWE3 service MUST specify whether the frame's checksum should be preserved across the PW, or should be removed at the ingress PE and then be re-calculated and inserted at the egress PE. For protocols such as ATM and FR, the checksum covers link-local information such as the circuit identifiers (e.g., FR DLCI or ATM VPI/VCI). Therefore, such checksum MUST be removed at the ingress PE and recalculated at the egress PE.",
      "ja": "ほとんどのL2フレームは、フレームの完全性を保証するためにチェックサムフィールドを持っています。すべてのPWE3サービスは、フレームのチェックサムがPWを横切って保存されなければならない、又は入口PEで除去されるべきであり、次いで、出口PEで再計算され、挿入されるかを指定する必要があります。例えばATMやFRなどのプロトコルのために、チェックサムは、そのような回路識別子（例えば、FR DLCIまたはATM VPI / VCI）としてリンクローカル情報を覆います。したがって、そのようなチェックサムが入口PEで除去し、出口PEで再計算されなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.5. Conveyance of Payload Type Information",
      "section_title": true,
      "ja": "4.1.5. ペイロードタイプ情報の伝達"
    },
    {
      "indent": 3,
      "text": "Under some circumstances, it is desirable to be able to distinguish PW traffic from other types of traffic such as IPv4 or IPv6 or OAM. For example, if Equal Cost Multi-Path (ECMP) is employed in a PSN, this additional distinguishability can be used to reduce the chance that PW packets get misordered by the load balancing mechanism. Some mechanism SHOULD provide this distinguishability if needed. Such mechanism MAY be defined in the PWE3 WG or other WGs.",
      "ja": "いくつかの状況下で、このようなIPv4またはIPv6又はOAMなどの他のタイプのトラフィックからPWのトラフィックを区別できることが望ましいです。イコールコストマルチパス（ECMP）がPSNで採用されている場合、この追加の識別性はPWパケットが負荷分散メカニズムによってmisordered受ける可能性を低減するために使用することができます。必要に応じて、いくつかのメカニズムが、この識別性を提供する必要があります。そのような機構は、PWE3 WG又は他のWGsで定義されてもよいです。"
    },
    {
      "indent": 0,
      "text": "4.2. Frame Ordering",
      "section_title": true,
      "ja": "4.2. フレーム順序"
    },
    {
      "indent": 3,
      "text": "When packets carrying the PW PDUs traverse a PW, they may arrive at the egress out of order. For some services, the frames (either control frames only or both control and data frames) must be delivered in order. For such services, some mechanism MUST be provided for ensuring in-order delivery. Providing a sequence number in the PW header for each packet is one possible approach to detect out-of-order frames. Mechanisms for re-ordering frames may be provided by Native Service Processing (NSP) [PWE3_ARCH] but are out of scope of PWE3.",
      "ja": "PW PDUを運ぶパケットがPWを横断するとき、それらは順不同で出口に到達することができます。いくつかのサービスのために、フレーム（いずれかの制御フレームのみ、または両方の制御及びデータフレーム）が順番に送達されなければなりません。このようなサービスのために、いくつかのメカニズムは、インオーダー配信を確保するために設けられなければなりません。各パケットのPWヘッダにシーケンス番号を提供するアウトオブオーダーフレームを検出するための一つの可能​​なアプローチです。再順序付けフレームのためのメカニズムは、ネイティブサービス処理（NSP）PWE3_ARCH]によって提供されるが、PWE3の範囲外であることができます。"
    },
    {
      "indent": 0,
      "text": "4.3. Frame Duplication",
      "section_title": true,
      "ja": "4.3. フレーム複製"
    },
    {
      "indent": 3,
      "text": "In rare cases, packets traversing a PW may be duplicated. For some services, frame duplication is not allowed. For such services some mechanism MUST be provided to ensure that duplicated frames will not be delivered. The mechanism may or may not be the same as the mechanism used to ensure in-order frame delivery.",
      "ja": "まれに、PWを通過するパケットが複製されてもよいです。一部のサービスでは、フレームの複製が許可されていません。このようなサービスのためにいくつかのメカニズムが重複フレームが配信されないことを保証するために提供されなければなりません。機構は、インオーダーフレーム配信を確実にするために使用されるメカニズムは、同じであってもなくてもよいです。"
    },
    {
      "indent": 0,
      "text": "4.4. Fragmentation",
      "section_title": true,
      "ja": "4.4. フラグメンテーション"
    },
    {
      "indent": 3,
      "text": "If the combined size of the L2 payload and its associated PWE3 and PSN headers exceeds the PSN path MTU, the L2 payload may need to be fragmented (Alternatively the L2 frame may be dropped). For certain native service, fragmentation may also be needed to maintain a control frame's relative position to the data frames (e.g., an ATM PM cell's relative position). In general, fragmentation has a performance impact. It is therefore desirable to avoid fragmentation if possible. However, for different services, the need for fragmentation can be different. When there is potential need for fragmentation, each service-specific PWE3 document MUST specify whether to fragment the frame in question or to drop it. If an emulated service chooses to drop the frame, the consequence MUST be specified in its applicability statement.",
      "ja": "L2ペイロードおよびその関連PWE3とPSNヘッダの合計サイズが、PSNパスMTUを超えた場合、L2ペイロードがフラグメント化される（あるいはL2フレームがドロップされてもよい）必要があるかもしれません。特定のネイティブサービスのために、断片化は、データフレーム（例えば、ATM PMセルの相対位置）に制御フレームの相対位置を維持するために必要とされるかもしれません。一般的に、フラグメンテーションは、パフォーマンスへの影響を有しています。可能な場合は、断片化を避けることが望ましいです。しかし、異なるサービスのために、断片化の必要性は異なる場合があります。断片化のための潜在的な必要性がある場合、各サービス固有のPWE3ドキュメントは、問題のフレームを断片化するか、それをドロップするかを指定する必要があります。エミュレートされたサービスは、フレームをドロップすることを選択した場合、その結果は、その適用性の文で指定されなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.5. Consideration of Per-PSN Packet Overhead",
      "section_title": true,
      "ja": "4.5. ごとのPSNパケットオーバーヘッドの検討"
    },
    {
      "indent": 3,
      "text": "When the L2 PDU size is small, in order to reduce PSN tunnel header overhead, multiple PDUs MAY be concatenated before a PSN tunnel header is added. Each encapsulated PDU still carries its own PW header so that the egress PE knows how to process it. However, the benefit of concatenating multiple PDUs for header efficiency should be weighed against the resulting increase in delay, jitter and the larger penalty incurred by packet loss.",
      "ja": "L2 PDUのサイズが小さい場合PSNトンネルヘッダが追加される前に、PSNトンネルヘッダのオーバーヘッドを低減するために、複数のPDUが連結されるかもしれません。出口PEは、それを処理する方法を知っているように、各カプセル化されたPDUは依然として独自PWヘッダを運びます。しかし、ヘッダ効率のために複数のPDUを連結することの利点は、遅延、ジッタ、パケット損失によって被る大きなペナルティで得られた増加と比較検討されなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Maintenance of Emulated Services",
      "section_title": true,
      "ja": "エミュレートサービスの5.メンテナンス"
    },
    {
      "indent": 3,
      "text": "This section describes maintenance requirements for PWE3.",
      "ja": "このセクションでは、PWE3のメンテナンス要件について説明します。"
    },
    {
      "indent": 0,
      "text": "5.1. Setup and Teardown of Pseudo-Wires",
      "section_title": true,
      "ja": "5.1. 擬似回線の確立とティアダウン"
    },
    {
      "indent": 3,
      "text": "A PW must be set up before an emulated circuit can be established, and must be torn down when an emulated circuit is no longer needed. Setup and teardown of a PW can be triggered by a command from the management plane of a PE, or by Setup/Teardown of an AC (e.g., an ATM SVC), or by an auto-discovery mechanism.",
      "ja": "エミュレートされた回路を確立することができ、かつエミュレート回路が不要になったときに取り壊されてはならない前に、PWを設定する必要があります。 PWのセットアップおよびティアダウンは、PEの管理面から、またはセットアップによって/ ACのティアダウン（例えば、ATM SVC）、または自動検出機構によってコマンドによってトリガすることができます。"
    },
    {
      "indent": 3,
      "text": "Every PWE3 approach MUST define some setup mechanism for establishing the PWs. During the setup process, the PEs need to exchange some information (e.g., to learn each other's capability). The setup mechanism MUST enable the PEs to exchange all necessary information. For example, both endpoints must agree on methods for encapsulating PDUs and handling frame ordering. Which signaling protocol to use and what information to exchange are service specific. Every PWE3 approach MUST specify them. Manual configuration of PWs can be considered as a special kind of signaling and is allowed.",
      "ja": "すべてのPWE3アプローチはPWを確立するためにいくつかのセットアップメカニズムを定義しなければなりません。セットアッププロセス中に、PEは（例えば互いの機能を学ぶために）いくつかの情報を交換する必要があります。セットアップメカニズムは、すべての必要な情報を交換するためのPEを有効にする必要があります。たとえば、両方のエンドポイントは、PDUをカプセル化し、フレーム順序を処理する方法に同意しなければなりません。これは使用するシグナリングプロトコル交換にどのような情報サービス固有のものです。すべてのPWE3アプローチは、それらを指定しなければなりません。 PW手動構成は、シグナリングの特別な種類とみなすことができ、許可されています。"
    },
    {
      "indent": 3,
      "text": "If a native circuit is bi-directional, the corresponding emulated circuit can be signaled \"Up\" only when the associated PW and PSN tunnels in both directions are functional.",
      "ja": "ネイティブ回路が双方向である場合、対応するエミュレートされた回路は、両方向に関連PWとPSNトンネルが機能している場合にのみ、「アップ」をシグナリングすることができます。"
    },
    {
      "indent": 0,
      "text": "5.2. Handling Maintenance Message of the Native Services",
      "section_title": true,
      "ja": "5.2. ネイティブ・サービスの取扱いメンテナンスメッセージ"
    },
    {
      "indent": 3,
      "text": "Some native services have mechanisms for maintenance purpose, e.g., ATM OAM and FR LMI. Such maintenance messages can be in-band (i.e., mixed with data messages in the same AC) or out-of-band (i.e., sent in a dedicated control circuit). For such services, all in-band maintenance messages related to a circuit SHOULD be transported in-band just like data messages through the corresponding PW to the remote CE. In other words, no translation is needed at the PEs for in-band maintenance messages. In addition, it MAY be desirable to provide higher reliability for maintenance messages. The mechanisms for providing high reliability do not have to be defined in the PWE3 WG.",
      "ja": "いくつかのネイティブのサービスは、保守目的のためのメカニズム、例えば、ATM OAMおよびFR LMIを持っています。そのような保守メッセージ（すなわち、専用の制御回路に送信された）帯域で（すなわち、同一AC内のデータメッセージと混合）またはアウトオブバンドであることができます。このようなサービスのために、回路に関連するすべての帯域内のメンテナンス・メッセージは、リモートCEに対応するPWを介してだけデータメッセージのように、バンド輸送されるべきです。言い換えれば、翻訳は、帯域内の保守メッセージのためのPEで必要ありません。また、メンテナンス・メッセージのために高い信頼性を提供することが望ましい場合があります。高い信頼性を提供するためのメカニズムはPWE3 WGで定義する必要はありません。"
    },
    {
      "indent": 3,
      "text": "Out-of-band maintenance messages between a CE and a PE may relate to multiple ACs between the CE and the PE. They need to be processed at the local PE and possibly at the remote PE as well. If a native service has some out-of-band maintenance messages, the corresponding emulated service MUST specify how to process such messages at the PEs. In general, an out-of-band maintenance message is either translated into an in-band maintenance message of the native service or a PWE-specific maintenance message for every AC related to that out-of-band message. As an example, assume the ACs between a CE and a PE are some ATM VCCs inside a VPC. When a F4 AIS [UNI3.0] from the CE is received by the PE, the PE should translate that F4 AIS into a F5 AIS and send it to the remote CE for every VCC. Alternatively, the PE should generate a PWE-specific maintenance message (e.g., label withdrawal) to the remote PE for every VCC. When the remote PE receives such a PWE-specific maintenance message, it may need to generate a maintenance message of the native service and send it to the attached CE.",
      "ja": "CEおよびPE間の帯域外の保守メッセージは、CEとPEの間で複数のACSに関連してもよいです。彼らは、ローカルPEで、おそらく同様に、リモートPEで処理する必要があります。ネイティブサービスは、いくつかのアウトオブバンドのメンテナンスメッセージを持っている場合は、対応するエミュレートされたサービスは、PESのようなメッセージを処理する方法を指定する必要があります。一般的に、アウトオブバンド保守メッセージは、ネイティブサービスまたはそのアウトバンドメッセージに関連するすべてのAC用PWE固有のメンテナンスメッセージの帯域内保守メッセージに翻訳されますか。一例として、CEおよびPE間ACSを想定VPC内部いくつかのATMのVCCです。 F4 AISは[UNI3.0] CEからPEによって受信されると、PEは、F5 AISにそのF4 AISを翻訳し、すべてのVCCのためのリモートCEに送信すべきです。代替的に、PEはすべてのVCCのためのリモートPEにPWE固有メンテナンスメッセージ（例えば、ラベル離脱）を生成すべきです。リモートPEは、PWE固有保守メッセージを受信すると、ネイティブサービスのメンテナンス・メッセージを生成し、添付のCEに送信する必要があるかもしれません。"
    },
    {
      "indent": 0,
      "text": "5.3. PE-initiated Maintenance Messages",
      "section_title": true,
      "ja": "5.3.  PE-開始メンテナンスメッセージ"
    },
    {
      "indent": 3,
      "text": "A PE needs to initiate some maintenance messages under some circumstances without being triggered by any native maintenance messages from the CE. These circumstances are usually caused by fault, e.g., a PW failure in the PSN or a link failure between the CE and the PE.",
      "ja": "PEは、CEからの任意の天然の保守メッセージによってトリガーされることなく、いくつかの状況下で、いくつかの保守メッセージを開始する必要があります。このような状況は、通常、障害によって引き起こされる、例えば、PSNにPW障害またはCEとPE間のリンク障害。"
    },
    {
      "indent": 3,
      "text": "The reason the PEs need to initiate some maintenance messages under a fault condition is because the existence of a PW between two CEs would otherwise reduce the CEs' maintenance capability. This is illustrated in the following example. If two CEs are directly connected by a physical wire, a native service (e.g., ATM) can use notifications from the lower layer (e.g., the physical link layer) to assist its maintenance. For example, an ATM PVC can be signaled \"Down\" if the physical wire fails. However, consider the following scenario.",
      "ja": "2つのCE間PWの存在がそれ以外のCEメンテナンス機能を削減するため、PEが故障状態の下で、いくつかの保守メッセージを開始する必要がある理由があります。これは、次の例に示されています。 2つのCEが直接物理的ワイヤ、ネイティブのサービス（例えば、ATM）で接続されている場合、その維持を補助するために下位レイヤ（例えば、物理リンク層）からの通知を使用することができます。物理的な配線が失敗した場合たとえば、ATM PVCは「ダウン」シグナリングすることができます。ただし、次のシナリオを検討してください。"
    },
    {
      "indent": 3,
      "text": "+-----+ Phy-link +----+              +----+ Phy-link +-----+\n| CE1 |----------| PE1|......PW......|PE2 |----------| CE2 |\n+-----+          +----+              +----+          +-----+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "If the PW between PE1 and PE2 fails, CE1 and CE2 will not receive physical link failure notification. As a result, they cannot declare failure of the emulated circuit in a timely fashion, which will in turn affect higher layer applications. Therefore, when the PW fails, PE1 and PE2 need to initiate some maintenance messages to notify the client layer on CE1 and CE2 that use the PW as a server layer. (In this case, the client layer is the emulated service). Similarly, if the physical link between PE1-CE1 fails, PE1 needs to initiate some maintenance message(s) so that the client layer at CE2 will be notified. PE2 may need to be involved in this process.",
      "ja": "PE1とPE2間のPWに障害が発生した場合は、CE1とCE2は、物理的なリンク障害通知を受信しません。その結果、彼らは順番に上位層のアプリケーションに影響を与えるであろう、タイムリーにエミュレートされた回路の故障を宣言することはできません。 PWが失敗したときしたがって、PE1およびPE2は、サーバ層としてPWを使用CE1とCE2上のクライアント層に通知するために、いくつかの保守メッセージを開始する必要があります。 （この場合、クライアント層は、エミュレートするサービスです）。 PE1-CE1間の物理リンクに障害が発生した場合、同様に、PE1はCE2のクライアント層に通知されるように、いくつかの保守メッセージ（単数または複数）を開始する必要があります。 PE2は、このプロセスに関与する必要があるかもしれません。"
    },
    {
      "indent": 3,
      "text": "In the rare case when a physical wire between two CEs incurs many bit errors, the physical link can be declared \"Down\" and the client layer at the CEs be notified. Similarly, a PW can incur packet loss, corruption, and out-of-order delivery. These can be considered as \"generalized bit error\". Upon detection of excessive \"generalized bit error\", a PW can be declared \"Down\" and the detecting PE needs to initiate a maintenance message so that the client layer at the CE is notified.",
      "ja": "2つのCE間の物理的な配線が多くのビットエラーを招きまれなケースでは、物理リンクは「ダウン」と宣言することができ、CESでのクライアント層に通知します。同様に、PWは、パケット損失、破損、及びアウトオブオーダー配信を被ることができます。これらは、「一般的なビット・エラー」とみなすことができます。過剰な「一般化ビットエラー」を検出すると、PWは、「ダウン」と宣言することができ、検出PEは、CEのクライアント層に通知されるように、保守メッセージを開始する必要があります。"
    },
    {
      "indent": 3,
      "text": "In general, every emulated service MUST specify: * Under what circumstances PE-initiated maintenance messages are needed, * Format of the maintenance messages, and * How to process the maintenance messages at the remote PE.",
      "ja": "リモートPEでメンテナンスメッセージを処理する方法*メンテナンスメッセージのフォーマット*、PE-開始メンテナンスメッセージが必要とされているどのような状況下では*、および：一般的に、すべてのエミュレートされたサービスを指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Some monitoring mechanisms are needed for detecting such circumstances, e.g., a PW failure. Such mechanisms can be defined in the PWE3 WG or elsewhere.",
      "ja": "いくつかの監視機構は、例えば、PW障害を、このような状況を検出するために必要とされます。そのようなメカニズムはPWE3 WG又は他の場所で定義することができます。"
    },
    {
      "indent": 3,
      "text": "Status of a group of emulated circuits may be affected identically by a single network incidence. For example, when the physical link between a CE and a PE fails, all the emulated circuits that go through that link will fail. It is desirable that a single maintenance message be used to notify failure of the whole group of emulated circuits connected to the same remote PE. A PWE3 approach MAY provide some mechanism for notifying status changes of a group of emulated circuits. One possible approach is to associate each emulated circuit with a group ID while setting up the PW for that emulated circuit. In a maintenance message, that group ID can be used to refer to all the emulated circuits in that group.",
      "ja": "エミュレートされた回路のグループの状態は、単一のネットワーク入射により同じ影響を受ける可能性があります。例えば、CEとPE間の物理リンクに障害が発生した場合、そのリンクを経由するすべてのエミュレート回路は失敗します。単一のメンテナンスメッセージが同じリモートPEに接続され、エミュレート回路のグループ全体の故障を通知するために使用することが望ましいです。 PWE3アプローチは、エミュレートされた回路のグループの状態変化を通知するための何らかの機構を提供することができます。一つの可能​​なアプローチは、エミュレートされた回路のためのPWを設定しながら、グループIDと各エミュレートされた回路を関連付けることです。メンテナンスメッセージに、そのグループIDは、そのグループ内のすべてのエミュレートされた回路を参照するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "If a PE needs to generate and send a maintenance message to a CE, the PE MUST use a maintenance message of the native service. This is essential in keeping the emulated service transparent to the CEs.",
      "ja": "PEが生成し、CEにメンテナンスメッセージを送信する必要がある場合は、PEは、ネイティブサービスのメンテナンスメッセージを使用しなければなりません。これは、CEに透過的にエミュレートサービスを維持するのに不可欠です。"
    },
    {
      "indent": 3,
      "text": "The requirements stated in this section are aligned with the ITU-T maintenance philosophy for telecommunications networks [G805] (i.e., client layer/server layer concept).",
      "ja": "このセクションに記載されている要件は、電気通信ネットワークのITU-T維持哲学[G805]（すなわち、クライアント層/サーバレイヤの概念）と整列されます。"
    },
    {
      "indent": 0,
      "text": "6. Management of Emulated Services",
      "section_title": true,
      "ja": "エミュレートサービスの6.管理"
    },
    {
      "indent": 3,
      "text": "Each PWE3 approach SHOULD provide some mechanisms for network operators to manage the emulated service. These mechanisms can be in the forms described below.",
      "ja": "ネットワークオペレータがエミュレートされたサービスを管理する各PWE3アプローチは、いくつかのメカニズムを提供する必要があります。これらのメカニズムは、以下に説明する形態であってもよいです。"
    },
    {
      "indent": 0,
      "text": "6.1. MIBs",
      "section_title": true,
      "ja": "6.1.  MIBの"
    },
    {
      "indent": 3,
      "text": "SNMP MIBs [SMIV2] MUST be provided for managing each emulated circuit as well as pseudo-wire in general. These MIBs SHOULD be created with the following requirements.",
      "ja": "SNMP MIBは[SMIv2の各エミュレートされた回路と同様に、一般に擬似ワイヤを管理するために提供されなければなりません。これらのMIBは、次の要件を作成する必要があります。"
    },
    {
      "indent": 0,
      "text": "6.2. General MIB Requirements",
      "section_title": true,
      "ja": "6.2. 一般的なMIBの要件"
    },
    {
      "indent": 3,
      "text": "New MIBs MUST augment or extend where appropriate, existing tables as defined in other existing service-specific MIBs for existing services such as MPLS or L2TP. For example, the ifTable as defined in the Interface MIB [IFMIB] MUST be augmented to provide counts of out-of-order packets. A second example is the extension of the MPLS-TE-MIB [TEMIB] when emulating circuit services over MPLS. Rather than redefining the tunnelTable so that PWE can utilize MPLS tunnels, for example, entries in this table MUST instead be extended to add additional PWE-specific objects. A final example might be to extend the IP Tunnel MIB [IPTUNMIB] in such a way as to provide PWE3- specific semantics when tunnels other than MPLS are used as PSN transport. Doing so facilitates a natural extension of those objects defined in the existing MIBs in terms of management, as well as leveraging existing agent implementations.",
      "ja": "新しいMIBは、このようなMPLSやL2TPなどの既存のサービスのために他の既存のサービス固有のMIBで定義されたテーブルを既存の、強化または適切な場合に拡張する必要があります。例えば、ifTableのインタフェースMIB [IFMIB]で定義されるようにするアウトオブオーダーパケットのカウントを提供するように拡張されなければなりません。 MPLS上回線サービスをエミュレートするときに、第2の例では、[TEMIB] MPLS-TEMIBの拡張です。むしろPWEは、MPLSトンネルを利用することができるようにtunnelTableを再定義するのではなく、例えば、このテーブルのエントリは、代わりに、追加のPWE固有のオブジェクトを追加するように拡張されなければなりません。最後の例は、MPLS以外のトンネルがPSNトランスポートとして使用される場合PWE3-特定のセマンティクスを提供するような方法でIPトンネルMIB [IPTUNMIB]を拡張するかもしれません。そうすることで、管理の面で既存のMIBで定義されたオブジェクトの自然な拡張を容易にする、ならびに既存のエージェントの実装を活用します。"
    },
    {
      "indent": 3,
      "text": "An AC MUST appear as an interface in the ifTable.",
      "ja": "ACはifTable内のインターフェイスとして現れなければなりません。"
    },
    {
      "indent": 0,
      "text": "6.3. Configuration and Provisioning",
      "section_title": true,
      "ja": "6.3. 設定とプロビジョニング"
    },
    {
      "indent": 3,
      "text": "MIB Tables MUST be designed to facilitate configuration and provisioning of the AC.",
      "ja": "MIBテーブルは、ACの構成およびプロビジョニングを容易にするように設計されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The MIB(s) MUST facilitate intra-PSN configuration and monitoring of ACs.",
      "ja": "MIB（複数可）のACS内PSN設定および監視を容易にしなければなりません。"
    },
    {
      "indent": 0,
      "text": "6.4. Performance Monitoring",
      "section_title": true,
      "ja": "6.4. パフォーマンス監視"
    },
    {
      "indent": 3,
      "text": "MIBs MUST collect statistics for performance and fault management.",
      "ja": "MIBは、パフォーマンスと障害管理のための統計情報を収集する必要があります。"
    },
    {
      "indent": 3,
      "text": "MIBs MUST provide a description of how existing counters are used for PW emulation and SHOULD not replicate existing MIB counters.",
      "ja": "MIBはPWエミュレーションのために使用されているか、既存のカウンターの説明を提供しなければならなくて、既存のMIBカウンターを複製してはなりません。"
    },
    {
      "indent": 0,
      "text": "6.5. Fault Management and Notifications",
      "section_title": true,
      "ja": "6.5. 管理と通知を障害"
    },
    {
      "indent": 3,
      "text": "Notifications SHOULD be defined where appropriate to notify the network operators of any interesting situations, including faults detected in the AC.",
      "ja": "ACで検出された障害を含む任意の面白い状況のネットワークオペレータに通知するために、適切な場合に通知が定義されるべきです。"
    },
    {
      "indent": 3,
      "text": "Objects defined to augment existing protocol-specific notifications in order to add PWE functionality MUST explain how these notifications are to be emitted.",
      "ja": "PWE機能を追加するために、既存のプロトコル固有の通知を強化するために定義されたオブジェクトは、これらの通知が発せられることになっている方法を説明しなければなりません。"
    },
    {
      "indent": 0,
      "text": "6.6. Pseudo-Wire Connection Verification and Traceroute",
      "section_title": true,
      "ja": "6.6. 擬似ワイヤ接続検証とトレースルート"
    },
    {
      "indent": 3,
      "text": "For network management purpose, a connection verification mechanism SHOULD be supported by PWs. Connection verification as well as other alarming mechanisms can alert network operators that a PW has lost its remote connection. It is sometimes desirable to know the exact functional path of a PW for troubleshooting purpose, thus a traceroute function capable of reporting the path taken by data packets over the PW SHOULD be provided.",
      "ja": "ネットワーク管理目的のために、接続検証メカニズムはPWをによってサポートされる必要があります。接続検証だけでなく、他の驚くべきメカニズムはPWがリモート接続を失ったネットワークオペレータに警告することができます。従ってPWを介してデータ・パケットによって取られる経路を報告することが可能なトレースルート機能が提供されなければならない、トラブルシューティングの目的のためにPWの正確な機能的経路を知ることが望ましい場合があります。"
    },
    {
      "indent": 0,
      "text": "7. Faithfulness of Emulated Services",
      "section_title": true,
      "ja": "エミュレートサービスの7忠実"
    },
    {
      "indent": 3,
      "text": "An emulated service SHOULD be as similar to the native service as possible, but NOT REQUIRED to be identical. The applicability statement of a PWE3 service MUST report limitations of the emulated service.",
      "ja": "エミュレートされたサービスは、可能な限りネイティブサービスと同様であってもよいが、同一である必要はない（SHOULD NOT）。 PWE3サービスの適用性声明は、エミュレートされたサービスの限界を報告しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Some basic requirements on faithfulness of an emulated service are described below.",
      "ja": "エミュレートされたサービスの忠実上のいくつかの基本的な要件は以下のとおりです。"
    },
    {
      "indent": 0,
      "text": "7.1. Characteristics of an Emulated Service",
      "section_title": true,
      "ja": "7.1. エミュレートサービスの特徴"
    },
    {
      "indent": 3,
      "text": "From the perspective of a CE, an emulated circuit is characterized as an unshared link or circuit of the chosen service, although service quality of the emulated service may be different from that of a native one. Specifically, the following requirements MUST be met:",
      "ja": "エミュレートされたサービスのサービス品質は、ネイティブ1のものとは異なるかもしれないがCEの観点から、エミュレートされた回路は、選択されたサービスの非共有リンク又は回路として特徴付けられます。具体的には、以下の要件を満たす必要があります。"
    },
    {
      "indent": 3,
      "text": "1) It MUST be possible to define type (e.g., Ethernet, which is inherited from the native service), speed (e.g., 100Mbps), and MTU size for an emulated circuit, if it is possible to do so for a native circuit.",
      "ja": "1）天然の回路のためにそうすることが可能である場合、エミュレート回路のためのタイプ（例えば、ネイティブサービスから継承されているイーサネット）、速度（例えば、100Mbpsの）、およびMTUサイズを定義することが可能でなければなりません。"
    },
    {
      "indent": 3,
      "text": "2) If the two endpoints CE1 and CE2 of emulated circuit #1 are connected to PE1 and PE2, respectively, and CE3 and CE4 of emulated circuit #2 are also connected to PE1 and PE2, then the PWs of these two emulated circuits may share the same physical paths between PE1 and PE2. But from each CE's perspective, its emulated circuit MUST appear as unshared. For example, CE1/CE2 MUST NOT be aware of existence of emulated circuit #2 or CE3/CE4.",
      "ja": "エミュレートされた回路＃1の2つのエンドポイントCE1及びCE2は、それぞれ、PE1とPE2に接続され、エミュレートされた回路＃2のCE3及びCE4はまた、PE1とPE2に接続されている場合2）、これら2つのエミュレートされた回路のPWSが共有することができますPE1とPE2の間の同じ物理パス。しかし、各CEの視点から、そのエミュレートされた回路は、非共有として現れなければなりません。例えば、CE1 / CE2は、エミュレート回路＃2またはCE3 / CE4の存在を認識しているはずがありません。"
    },
    {
      "indent": 3,
      "text": "3) If an emulated circuit fails (either at one of the ACs or in the middle of the PW), both CEs MUST be notified in a timely manner, if they will be notified in the native service (see Section 5.3 for more information). The definition of \"timeliness\" is service-dependent.",
      "ja": "エミュレートされた回路は、（ACSの一つで、またはPWの途中のいずれかで）失敗した場合、彼らはネイティブサービスで通知される場合3）、両方のCEは（詳細については、セクション5.3を参照）、タイムリーに通知しなければなりません。 「適時性」の定義は、サービスに依存します。"
    },
    {
      "indent": 3,
      "text": "4) If a routing protocol (e.g., IGP) adjacency can be established over a native circuit, it MUST be possible to be established over an emulated circuit as well.",
      "ja": "ルーティングプロトコル（例えば、IGP）隣接ネイティブ回路を介して確立することができれば4）、同様に、エミュレート回路を介して確立することが可能でなければなりません。"
    },
    {
      "indent": 0,
      "text": "7.2. Service Quality of Emulated Services",
      "section_title": true,
      "ja": "7.2. エミュレートサービスのサービス品質"
    },
    {
      "indent": 3,
      "text": "It is NOT REQUIRED that an emulated service provide the same service quality as the native service. The PWE3 WG only defines mechanisms for providing PW emulation, not the services themselves. What quality to provide for a specific emulated service is a matter between a service provider (SP) and its customers, and is outside scope of the PWE3 WG.",
      "ja": "エミュレートされたサービスは、ネイティブサービスと同じサービス品質を提供することは必要とされません。 PWE3 WGはPWエミュレーションではなく、サービスそのものを提供するためのメカニズムを定義します。どのような品質、特定のエミュレートされたサービスを提供するためには、サービスプロバイダ（SP）とその顧客との問題であり、PWE3 WGの外スコープです。"
    },
    {
      "indent": 0,
      "text": "8. Non-Requirements",
      "section_title": true,
      "ja": "8.非要件"
    },
    {
      "indent": 3,
      "text": "Some non-requirements are mentioned in various sections of this document. Those work items are outside scope of the PWE3 WG. They are summarized below:",
      "ja": "いくつかの非要件は、このドキュメントのさまざまなセクションに記載されています。これらの作業項目PWE3 WGの範囲外です。これらは、以下に要約されています。"
    },
    {
      "indent": 3,
      "text": "- Service interworking;",
      "ja": " - サービスインターワーキング。"
    },
    {
      "indent": 6,
      "text": "In Service Interworking, the IWF (Interworking Function) between two dissimilar protocols (e.g., ATM & MPLS, Frame Relay & ATM, ATM & IP, ATM & L2TP, etc.) terminates the protocol used in one network and translates (i.e., maps) its Protocol Control Information (PCI) to the PCI of the protocol used in other network for User, Control and Management Plane functions to the extent possible.",
      "ja": "サービス・インターワーキングでは、IWF 2つの異なるプロトコル（例えば、ATM＆MPLS、フレームリレー＆ATM、ATM＆IP、ATM＆L2TPなど）の間（インターワーキング機能）一つのネットワークで使用されるプロトコルを終端し、（すなわち、マップを変換します）そのプロトコル制御情報（PCI）可能な限りユーザコントロール及び管理プレーン機能のために他のネットワークで使用されるプロトコルのPCIに。"
    },
    {
      "indent": 3,
      "text": "- Selection of a particular type of PWs;",
      "ja": " - のPWの特定の種類の選択。"
    },
    {
      "indent": 3,
      "text": "- To make the emulated services perfectly match their native services;",
      "ja": " - エミュレートのサービスは完全に彼らの本来のサービスを一致させるために、"
    },
    {
      "indent": 3,
      "text": "- Defining mechanisms for signaling the PSN tunnels;",
      "ja": " -  PSNトンネルをシグナリングするためのメカニズムを定義します。"
    },
    {
      "indent": 3,
      "text": "- Defining how to perform traffic management on packets that carry PW PDUs;",
      "ja": " -  PW PDUを運ぶパケットのトラフィック管理を実行する方法を定義します。"
    },
    {
      "indent": 3,
      "text": "- Providing any multicast service that is not native to the emulated medium.",
      "ja": " - エミュレートされたメディアへのネイティブではない任意のマルチキャストサービスを提供します。"
    },
    {
      "indent": 6,
      "text": "To illustrate this point, Ethernet transmission to a multicast IEEE-48 address is considered in scope, while multicast services like [MARS] that are implemented on top of the medium are out of scope;",
      "ja": "媒体上に実装されている[MARS]のようなマルチキャストサービスが範囲外であるが、この点を例示するために、マルチキャストIEEE-48アドレスへのイーサネット伝送は、範囲内にあると考えられます。"
    },
    {
      "indent": 0,
      "text": "9. Quality of Service (QoS) Considerations",
      "section_title": true,
      "ja": "9.サービスの品質（QoS）の注意事項"
    },
    {
      "indent": 3,
      "text": "Some native services such as ATM can offer higher service quality than best effort Internet service. QoS is therefore essential for ensuring that emulated services are compatible (but not necessarily identical) to their native forms. It is up to network operators to decide how to provide QoS - They can choose to rely on over-provisioning and/or deploy some QoS mechanisms.",
      "ja": "ATMなどのいくつかのネイティブのサービスはベストエフォート型のインターネットサービスより高いサービス品質を提供することができます。 QoSは、エミュレートされたサービスは、その天然型に互換性（必ずしも同一ではない）であることを確実にするための不可欠です。これは、QoSを提供する方法を決定するためにネットワークオペレータまでです - 彼らは、オーバープロビジョニングに依存している、および/またはいくつかのQoSメカニズムを展開することを選択できます。"
    },
    {
      "indent": 3,
      "text": "In order to take advantage of QoS mechanisms defined in other working groups, e.g., the traffic management schemes defined in DiffServ WG, it is desirable that some mechanisms exists for differentiating the packets resulted from PDU encapsulation. These mechanisms do not have to be defined in the PWE3 approaches themselves. For example, if the resulted packets are MPLS or IP packets, their EXP or DSCP field can be used for marking and differentiating. A PWE3 approach MAY provide guidelines for marking and differentiating.",
      "ja": "他のワーキンググループで定義されたQoSメカニズムを利用するために、例えば、DiffServのWGで定義されたトラフィック管理スキームは、いくつかのメカニズムがPDUカプセル化に起因するパケットを区別するために存在することが望ましいです。これらのメカニズムは、自分自身に近づくPWE3で定義する必要はありません。結果、パケットがMPLSまたはIPパケットである場合、例えば、そのEXPまたはDSCPフィールドは、マーキングと区別するために使用することができます。 PWE3アプローチはマーキングと区別するためのガイドラインを提供することができます。"
    },
    {
      "indent": 3,
      "text": "The applicability of PWE3 to a particular service depends on the sensitivity of that service (or the CE implementation) to delay/jitter etc and the ability of the application layer to mask them. PWE3 may not be applicable to services that have severe constraints in this respect.",
      "ja": "特定のサービスへPWE3の適用は、そのサービス（またはCE実装）遅延させる/ジッタなどとそれらをマスクするアプリケーション層の能力の感度に依存します。 PWE3は、この点で厳しい制約を持っているサービスには適用できない場合があります。"
    },
    {
      "indent": 0,
      "text": "10. Inter-domain Issues",
      "section_title": true,
      "ja": "10.ドメイン間の問題"
    },
    {
      "indent": 3,
      "text": "PWE is a matter between the PW end-points and is transparent to the network devices between the PW end-points. Therefore, inter-domain PWE is fundamentally similar to intra-domain PWE. As long as PW end-points use the same PWE approach, they can communicate effectively, regardless of whether they are in the same domain. Security may become more important in the inter-domain case and some security measure such as end-point authentication MAY be applied. QoS may become more difficult to deliver too, as one service provider has no control over another service provider's provisioning and traffic management policy. To solve the inter-domain QoS problem, service providers have to cooperate. Once they agree at a contractual level to provider high quality of service to certain traffic (e.g., PWE traffic), the mechanisms defined in other working groups, e.g., Diffserv WG, can be used.",
      "ja": "PWEはPWエンドポイント間の問題であり、PWエンドポイント間のネットワークデバイスに対して透過的です。そのため、ドメイン間PWEは、ドメイン内PWEと基本的に同様です。 PWエンドポイントが同じPWE法を使用している限り、彼らは関係なく、同じドメイン内にあるかどうか、効果的に通信することができます。セキュリティは、ドメイン間の場合には、より重要になるかもしれないと、このようなエンドポイントの認証など、いくつかのセキュリティ対策を適用することができます。 QoSは、1つのサービスプロバイダが別のサービスプロバイダのプロビジョニングおよびトラフィック管理ポリシーを管理していないとして、あまりにも提供することがより困難になることがあります。ドメイン間のQoSの問題を解決するために、サービスプロバイダーは協力しなければなりません。彼らは特定のトラフィックに対するサービスの提供高品質（例えば、PWEトラフィック）に契約レベルに同意したら、他のワーキンググループで定義されたメカニズムは、例えば、DiffservのWGは、使用することができます。"
    },
    {
      "indent": 3,
      "text": "Inter-domain PSN tunnels are generally more difficult to set up, tear down and maintain than intra-domain ones. But that is an issue for PSN tunneling protocols such as MPLS and L2TPv3 and is outside the scope of PWE3.",
      "ja": "ドメイン間のPSNトンネルは、一般的に、設定取り壊すとドメイン内のものよりも維持することがより困難です。しかし、それは、このようなMPLSとL2TPv3のようPSNトンネリングプロトコルの問題であり、PWE3の範囲外です。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The PW end-point, PW demultiplexing mechanism, and the payloads of the native service can all be vulnerable to attack. PWE3 should leverage security mechanisms provided by the PW Demultiplexer or PSN Layers. Such mechanisms SHOULD protect PW end-point and PW Demultiplexer mechanism from denial-of-service (DoS) attacks and spoofing of the native data units. Preventing unauthorized access to PW end-points and other network devices is generally effective against DoS attacks and spoofing, and can be part of protection mechanism. Protection mechanisms SHOULD also address the spoofing of tunneled PW data. The validation of traffic addressed to the PW Demultiplexer end-point is paramount in ensuring integrity of PW encapsulation. Security protocols such as IPsec [RFC2401] can be used.",
      "ja": "PWエンドポイント、PW逆多重化メカニズム、およびネイティブサービスのペイロードは、すべての攻撃に対して脆弱であることができます。 PWE3は、PWデマルチプレクサやPSNレイヤーによって提供されるセキュリティ・メカニズムを活用すべきです。そのようなメカニズムは、サービス拒否（DoS）攻撃とネイティブ・データ・ユニットのスプーフィングからPWエンドポイントとPWデマルチプレクサ機構を保護しなければなりません。 PWエンドポイントと他のネットワークデバイスへの不正アクセスを防止することはDoS攻撃やスプーフィングに対する一般有効であり、保護機構の一部にすることができます。保護メカニズムはまた、トンネリングPWデータのなりすましに対処すべきです。トラフィックの検証は、PWデマルチプレクサのエンドポイントに宛てPWカプセル化の整合性を確保する上で非常に重要です。このようにIPsec [RFC2401]などのセキュリティプロトコルを使用することができます。"
    },
    {
      "indent": 0,
      "text": "12. Acknowledgments",
      "section_title": true,
      "ja": "12.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to acknowledge input from M. Aissaoui, M. Bocci, S. Bryant, R. Cohen, N. Harrison, G. Heron, T. Johnson, A. Malis, L. Martini, E. Rosen, J. Rutemiller, T. So, Y. Stein, and S. Vainshtein.",
      "ja": "著者らはM. Aissaoui、M.ボッチ、S.ブライアント、R.コーエン、N.ハリソン、G.サギ、T.ジョンソン、A. Malis、L.マティーニ、E.ローゼン、J.からの入力を確認したいですRutemiller、T.ので、Y.スタイン、およびS. Vainshtein。"
    },
    {
      "indent": 0,
      "text": "13. References",
      "section_title": true,
      "ja": "13.参考文献"
    },
    {
      "indent": 0,
      "text": "13.1. Normative References",
      "section_title": true,
      "ja": "13.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[IFMIB] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, June 2000.",
      "ja": "[IFMIB] McCloghrie、K.およびF. Kastenholzと、 \"インターフェイスグループMIB\"、RFC 2863、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[SMIV2] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "【SMIv2の] McCloghrie、K.、パーキンス、D.、およびJ. Schoenwaelder、STD 58、RFC 2578、1999年4月 \"管理情報バージョン2（SMIv2）の構造\"。"
    },
    {
      "indent": 0,
      "text": "13.2. Informative References",
      "section_title": true,
      "ja": "13.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[G805] \"Generic Functional Architecture of Transport Networks\", ITU-T Recommendation G.805, 2000.",
      "ja": "[G805] \"トランスポート・ネットワークの一般的な機能アーキテクチャ\"、ITU-T勧告G.805、2000。"
    },
    {
      "indent": 3,
      "text": "[IPTUNMIB] Thaler, D., \"IP Tunnel MIB\", RFC 2667, August 1999.",
      "ja": "[IPTUNMIB]ターラー、D.、 \"IPトンネルMIB\"、RFC 2667、1999年8月。"
    },
    {
      "indent": 3,
      "text": "[L2TPv3] Lau, J., Townsley, M., and I. Goyret, et al., \"Layer Two Tunneling Protocol (Version 3)\", Work in Progress, June 2004.",
      "ja": "【のL2TPv3]ラウ、J.、Townsley、M.、およびI. Goyret、ら、 \"レイヤ2トンネリングプロトコル（バージョン3）\"、進歩、2004年6月に働いています。"
    },
    {
      "indent": 3,
      "text": "[MARS] Armitage, G., \"Support for Multicast over UNI 3.0/3.1 based ATM Networks\", RFC 2022, November 1996.",
      "ja": "[MARS]アーミテージ、G.は、 \"UNI上でのマルチキャストのサポート3.0 / 3.1ベースのATMネットワーク\"、RFC 2022、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[MPLS] Rosen, E., Viswanathan, A., and R. Callon, \"Multiprotocol Label Switching Architecture\", RFC 3031, January 2001.",
      "ja": "[MPLS]ローゼン、E.、Viswanathanの、A.、およびR. Callon、 \"マルチプロトコルラベルスイッチングアーキテクチャ\"、RFC 3031、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[PWE3_ARCH] S. Bryant and P. Pate, et. al., \"PWE3 Architecture\", Work in Progress, March 2004.",
      "ja": "【PWE3_ARCH] S.ブライアント及びP.パテ、ら。ら、 \"PWE3アーキテクチャ\"、進歩、2004年3月での作業。"
    },
    {
      "indent": 3,
      "text": "[RFC2401] Kent, S. and R. Atkinson, \"Security Architecture for the Internet Protocol\", RFC 2401, November 1998.",
      "ja": "[RFC2401]ケント、S.とR.アトキンソン、 \"インターネットプロトコルのためのセキュリティー体系\"、RFC 2401、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[TEMIB] Srinivasan, C., Viswanathan, A., and T. Nadeau, \"Multiprotocol Label Switching (MPLS) Traffic Engineering (TE) Management Information Base (MIB)\", RFC 3812, June 2004.",
      "ja": "[TEMIB]スリニバサン、C.、Viswanathanの、A.、およびT.ナドー、 \"マルチプロトコルラベルスイッチング（MPLS）トラフィックエンジニアリング（TE）管理情報ベース（MIB）\"、RFC 3812、2004年6月。"
    },
    {
      "indent": 3,
      "text": "[UNI3.0] ATM Forum, \"ATM User-Network Interface Specification Version 3.0\", Sept. 1993.",
      "ja": "[UNI3.0] ATMフォーラム、 \"ATMユーザ・ネットワーク・インターフェイス仕様バージョン3.0\"、1993年9月。"
    },
    {
      "indent": 0,
      "text": "14. Authors' Addresses",
      "section_title": true,
      "ja": "14.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "XiPeng Xiao (Editor) Riverstone Networks 5200 Great America Parkway Santa Clara, CA 95054",
      "ja": "XiPengシャオ（編集）リバーストーン・ネットワーク5200グレートアメリカパークウェイサンタクララ、CA 95054"
    },
    {
      "indent": 3,
      "text": "EMail: xxiao@riverstonenet.com",
      "ja": "メールアドレス：xxiao@riverstonenet.com"
    },
    {
      "indent": 3,
      "text": "Danny McPherson (Editor) Arbor Networks",
      "ja": "ダニー・マクファーソン（編集）アーバーネットワークス"
    },
    {
      "indent": 3,
      "text": "EMail: danny@arbor.net",
      "ja": "メールアドレス：danny@arbor.net"
    },
    {
      "indent": 3,
      "text": "Prayson Pate (Editor) Overture Networks 507 Airport Boulevard, Suite 111 Morrisville, NC, USA 27560",
      "ja": "Praysonパテ（EDITORE）序曲ネットワーク507空港大通り、ポップ111モリスビル、NC 27560 UCA"
    },
    {
      "indent": 3,
      "text": "EMail: prayson.pate@overturenetworks.com",
      "ja": "メールアドレス：prayson.pate@overturenetworks.com"
    },
    {
      "indent": 3,
      "text": "Vijay Gill AOL Time Warner",
      "ja": "ビジェイ・ギルAOLタイム・ワーナー"
    },
    {
      "indent": 3,
      "text": "EMail: vijaygill9@aol.com",
      "ja": "メールアドレス：vijaygill9@aol.com"
    },
    {
      "indent": 3,
      "text": "Kireeti Kompella Juniper Networks, Inc. 1194 N. Mathilda Ave. Sunnyvale, CA 94089",
      "ja": "Kireeti Kompellaジュニパーネットワークス株式会社1194 N.マチルダアベニュー。サニーベール、CA 94089"
    },
    {
      "indent": 3,
      "text": "EMail: kireeti@juniper.net",
      "ja": "メールアドレス：kireeti@juniper.net"
    },
    {
      "indent": 3,
      "text": "Thomas D. Nadeau Cisco Systems, Inc. 300 Beaver Brook Drive Boxborough, MA 01719 EMail: tnadeau@cisco.com",
      "ja": "トーマスD.ナドー、シスコシステムズ、株式会社300ビーバーブルックドライブボックスボロー、MA 01719 Eメール：tnadeau@cisco.com"
    },
    {
      "indent": 3,
      "text": "Craig White Level 3 Communications, LLC. 1025 Eldorado Blvd. Broomfield, CO, 80021",
      "ja": "クレイグ・ホワイトレベル3コミュニケーションズ、LLC。 1025エルドラドブールバード。ブルームフィールド、CO、80021"
    },
    {
      "indent": 3,
      "text": "EMail: Craig.White@Level3.com",
      "ja": "メールアドレス：Craig.White@Level3.com"
    },
    {
      "indent": 0,
      "text": "15. Full Copyright Statement",
      "section_title": true,
      "ja": "15.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（C）インターネット協会（2004）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/S HE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とHEが表すCONTRIBUTOR、ORGANIZATION HE / S OR（もしあれば）後援されており、インターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示、「そのまま」で提供されていますOR情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証を含むがこれらに限定されないで、黙示。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the IETF's procedures with respect to rights in IETF Documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 IETF文書の権利に関するIETFの手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}