{
  "title": {
    "text": "RFC 3850 - Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.1 Certificate Handling",
    "ja": "RFC 3850 - セキュア/多目的インターネットメール拡張（S / MIME）バージョン3.1証明書の取り扱いについて"
  },
  "number": 3850,
  "created_at": "2019-10-24 06:24:06.378633+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                B. Ramsdell, Editor\nRequest for Comments: 3850                                Sendmail, Inc.\nObsoletes: 2632                                                July 2004\nCategory: Standards Track",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.1 Certificate Handling",
      "ja": "セキュア/多目的インターネットメール拡張（S / MIME）バージョン3.1証明書の取り扱いについて"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（C）インターネット協会（2004）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies conventions for X.509 certificate usage by Secure/Multipurpose Internet Mail Extensions (S/MIME) agents. S/MIME provides a method to send and receive secure MIME messages, and certificates are an integral part of S/MIME agent processing. S/MIME agents validate certificates as described in RFC 3280, the Internet X.509 Public Key Infrastructure Certificate and CRL Profile. S/MIME agents must meet the certificate processing requirements in this document as well as those in RFC 3280.",
      "ja": "この文書は、多目的インターネットメール拡張（S / MIME）/セキュアエージェントによってX.509証明書の使用のための規則を指定します。 S / MIMEは安全なMIMEメッセージを送受信するための方法を提供し、証明書は、S / MIMEエージェント処理の不可欠な部分です。 RFC 3280で説明したようにS / MIMEエージェントは、インターネットX.509公開鍵基盤証明書とCRLプロファイル証明書を検証します。 S / MIMEエージェントは、この文書だけでなく、それらとしてRFC 3280で、証明書の処理要件を満たす必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Overview . . . . . . . . . . . . . . . . . . . . . . . . . . .  2\n    1.1.  Definitions. . . . . . . . . . . . . . . . . . . . . . .  2\n    1.2.  Compatibility with Prior Practice of S/MIME. . . . . . .  3\n    1.3.  Terminology. . . . . . . . . . . . . . . . . . . . . . .  3\n    1.4.  Changes Since S/MIME v3 (RFC 2632) . . . . . . . . . . .  3\n2.  CMS Options. . . . . . . . . . . . . . . . . . . . . . . . . .  4\n    2.1 . CertificateRevocationLists . . . . . . . . . . . . . . .  4\n    2.2.  CertificateChoices . . . . . . . . . . . . . . . . . . .  4\n    2.3.  CertificateSet . . . . . . . . . . . . . . . . . . . . .  5\n3. Using Distinguished Names for Internet Mail . . . . . . . . . .  6\n4.  Certificate Processing . . . . . . . . . . . . . . . . . . . .  7\n    4.1.  Certificate Revocation Lists . . . . . . . . . . . . . .  8\n    4.2.  Certification Path Validation. . . . . . . . . . . . . .  8\n    4.3.  Certificate and CRL Signing Algorithms . . . . . . . . .  9",
      "raw": true
    },
    {
      "indent": 3,
      "text": "    4.4.  PKIX Certificate Extensions. . . . . . . . . . . . . . .  9\n5.  Security Considerations. . . . . . . . . . . . . . . . . . . . 11\nA.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n    A.1.  Normative References . . . . . . . . . . . . . . . . . . 13\n    A.2.  Informative References . . . . . . . . . . . . . . . . . 14\nB.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 15\nC.  Editor's Address . . . . . . . . . . . . . . . . . . . . . . . 15\nFull Copyright Statement . . . . . . . . . . . . . . . . . . . . . 16",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1。概要"
    },
    {
      "indent": 3,
      "text": "S/MIME (Secure/Multipurpose Internet Mail Extensions), described in [SMIME-MSG], provides a method to send and receive secure MIME messages. Before using a public key to provide security services, the S/MIME agent MUST verify that the public key is valid. S/MIME agents MUST use PKIX certificates to validate public keys as described in the Internet X.509 Public Key Infrastructure (PKIX) Certificate and CRL Profile [KEYM]. S/MIME agents MUST meet the certificate processing requirements documented in this document in addition to those stated in [KEYM].",
      "ja": "[SMIME-MSG]に記載のS / MIMEは、（/多目的インターネットメール拡張セキュア）、セキュアMIMEメッセージを送受信する方法を提供します。セキュリティサービスを提供するために、公開鍵を使用する前に、S / MIMEエージェントは、公開鍵が有効であることを確かめなければなりません。 S / MIMEエージェントは[KEYM]インターネットX.509公開鍵基盤（PKIX）証明書とCRLプロファイルで説明したように、公開鍵を検証するためにPKIX証明書を使用しなければなりません。 S / MIMEエージェントは[KEYM]に記載されたものに加えて、この文書に記載された証明書の処理要件を満たさなければなりません。"
    },
    {
      "indent": 3,
      "text": "This specification is compatible with the Cryptographic Message Syntax [CMS] in that it uses the data types defined by CMS. It also inherits all the varieties of architectures for certificate-based key management supported by CMS.",
      "ja": "この仕様は、CMSによって定義されるデータ型を使用することで暗号メッセージ構文[CMS]と互換性があります。また、CMSでサポートされている証明書ベースの鍵管理のためのアーキテクチャのすべての品種を継承します。"
    },
    {
      "indent": 0,
      "text": "1.1. Definitions",
      "section_title": true,
      "ja": "1.1。定義"
    },
    {
      "indent": 3,
      "text": "For the purposes of this document, the following definitions apply.",
      "ja": "このドキュメントの目的のために、以下の定義が適用されます。"
    },
    {
      "indent": 3,
      "text": "ASN.1: Abstract Syntax Notation One, as defined in ITU-T X.208 [X.208-88].",
      "ja": "ASN.1：抽象構文記法1、ITU-T X.208 [X.208-88]で定義されます。"
    },
    {
      "indent": 3,
      "text": "Attribute Certificate (AC): An X.509 AC is a separate structure from a subject's public key X.509 Certificate. A subject may have multiple X.509 ACs associated with each of its public key X.509 Certificates. Each X.509 AC binds one or more Attributes with one of the subject's public key X.509 Certificates. The X.509 AC syntax is defined in [ACAUTH].",
      "ja": "属性証明書（AC）は：X.509 ACは、サブジェクトの公開鍵X.509証明書とは別の構造体です。被験体は、その公開鍵、X.509証明書のそれぞれに関連する複数のX.509 ACSを有していてもよいです。各X.509 ACは、サブジェクトの公開鍵X.509証明書のいずれかで1つ以上の属性をバインドします。 X.509 AC構文は[ACAUTH]で定義されています。"
    },
    {
      "indent": 3,
      "text": "Certificate: A type that binds an entity's name to a public key with a digital signature. This type is defined in the Internet X.509 Public Key Infrastructure (PKIX) Certificate and CRL Profile [KEYM]. This type also contains the distinguished name of the certificate issuer (the signer), an issuer-specific serial number, the issuer's signature algorithm identifier, a validity period, and extensions also defined in that document.",
      "ja": "証明書：デジタル署名付き公開鍵にエンティティの名前をバインドタイプ。このタイプは、[KEYM]インターネットX.509公開鍵基盤（PKIX）証明書とCRLプロファイルに定義されています。このタイプは、証明書発行者（署名者）、発行者固有のシリアル番号、また、その文書に定義された発行者の署名アルゴリズム識別子、有効期限、および拡張機能の識別名を含んでいます。"
    },
    {
      "indent": 3,
      "text": "Certificate Revocation List (CRL): A type that contains information about certificates whose validity an issuer has prematurely revoked. The information consists of an issuer name, the time of issue, the next scheduled time of issue, a list of certificate serial numbers and their associated revocation times, and extensions as defined in [KEYM]. The CRL is signed by the issuer. The type intended by this specification is the one defined in [KEYM].",
      "ja": "証明書失効リスト（CRL）：有効期限、発行者が途中で取り消された証明書に関する情報が含まれていますタイプ。情報は、発行者名、発行時、問題の次の予定時刻、[KEYM]で定義されている証明書のシリアル番号およびそれに関連する失効時間、および拡張機能のリストで構成されています。 CRLは、発行者によって署名されています。本明細書によって意図されるタイプは、[KEYM]で定義されたものです。"
    },
    {
      "indent": 3,
      "text": "Receiving agent: software that interprets and processes S/MIME CMS objects, MIME body parts that contain CMS objects, or both.",
      "ja": "受信エージェント：S / MIME CMSオブジェクト、CMSオブジェクト、またはその両方が含まれているMIMEボディパーツを解釈し、処理するソフトウェア。"
    },
    {
      "indent": 3,
      "text": "Sending agent: software that creates S/MIME CMS objects, MIME body parts that contain CMS objects, or both.",
      "ja": "CMSオブジェクト、またはその両方が含まれているS / MIME CMSオブジェクト、MIMEボディパーツを作成するソフトウェア：エージェントを送信します。"
    },
    {
      "indent": 3,
      "text": "S/MIME agent: user software that is a receiving agent, a sending agent, or both.",
      "ja": "S / MIMEエージェント：受信エージェント、送信エージェント、またはその両方をあるユーザソフトウェア。"
    },
    {
      "indent": 0,
      "text": "1.2. Compatibility with Prior Practice of S/MIME",
      "section_title": true,
      "ja": "1.2。 S / MIMEの前の練習との互換性"
    },
    {
      "indent": 3,
      "text": "S/MIME version 3.1 agents should attempt to have the greatest interoperability possible with agents for prior versions of S/MIME. S/MIME version 2 is described in RFC 2311 through RFC 2315, inclusive and S/MIME version 3 is described in RFC 2630 through RFC 2634 inclusive. RFC 2311 also has historical information about the development of S/MIME.",
      "ja": "S / MIMEのバージョンが3.1エージェントは、S / MIMEの以前のバージョンのための薬剤で可能な最大の相互運用性を持つように試みるべきです。 S / MIMEバージョン2は、RFC 2315を介してRFC 2311に記載されており、包括的でS / MIMEバージョン3は、包括RFC 2634を介してRFC 2630に記載されています。 RFC 2311はまた、S / MIMEの開発に関する履歴情報を持っています。"
    },
    {
      "indent": 0,
      "text": "1.3. Terminology",
      "section_title": true,
      "ja": "1.3。用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [MUSTSHOULD].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります【MUSTSHOULD]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.4. Changes Since S/MIME v3 ()",
      "section_title": true,
      "ja": "1.4。 S / MIME v3の以降の変更点（）"
    },
    {
      "indent": 3,
      "text": "Version 1 and Version 2 CRLs MUST be supported.",
      "ja": "バージョン1とバージョン2つのCRLをサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "Multiple CA certificates with the same subject and public key, but with overlapping validity periods, MUST be supported.",
      "ja": "同じテーマとする公開鍵を持つ複数のCA証明書が、重なり合う有効期間で、サポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "Version 2 attribute certificates SHOULD be supported, and version 1 attributes certificates MUST NOT be used.",
      "ja": "バージョン2属性証明書をサポートする必要があり、バージョン1つの属性証明書を使用してはいけません。"
    },
    {
      "indent": 3,
      "text": "The use of the MD2 digest algorithm for certificate signatures is discouraged and security language added.",
      "ja": "証明書の署名のためのMD2ダイジェストアルゴリズムの使用が推奨されおよびセキュリティ言語が追加されました。"
    },
    {
      "indent": 3,
      "text": "Clarified use of email address use in certificates. Certificates that do not contain an email address have no requirements for verifying the email address associated with the certificate.",
      "ja": "証明書にメールアドレスの使用を使用することを明らかにしました。電子メールアドレスが含まれていない証明書は、証明書に関連付けられているメールアドレスを検証するための要件はありません。"
    },
    {
      "indent": 3,
      "text": "Receiving agents SHOULD display certificate information when displaying the results of signature verification.",
      "ja": "署名検証の結果を表示する際に受信剤は、証明書情報を表示する必要があります。"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST NOT accept a signature made with a certificate that does not have the digitalSignature or nonRepudiation bit set.",
      "ja": "受信エージェントは、デジタル署名または否認防止ビットが設定されていない証明書を使用して作られた署名を受け入れてはいけません。"
    },
    {
      "indent": 3,
      "text": "Clarifications for the interpretation of the key usage and extended key usage extensions.",
      "ja": "鍵の使用法の解釈と拡張キー使用拡張のための明確化。"
    },
    {
      "indent": 0,
      "text": "2. CMS Options",
      "section_title": true,
      "ja": "2. CMSオプション"
    },
    {
      "indent": 3,
      "text": "The CMS message format allows for a wide variety of options in content and algorithm support. This section puts forth a number of support requirements and recommendations in order to achieve a base level of interoperability among all S/MIME implementations. Most of the CMS format for S/MIME messages is defined in [SMIME-MSG].",
      "ja": "CMSメッセージフォーマットは、コンテンツと、アルゴリズムのサポートのオプションの多種多様なことができます。このセクションでは、すべてのS / MIME実装間の相互運用性の基本レベルを達成するために、サポート要件と推奨事項の数を記載置きます。 S / MIMEメッセージのためのCMSフォーマットのほとんどは、[SMIME-MSG]で定義されています。"
    },
    {
      "indent": 0,
      "text": "2.1. CertificateRevocationLists",
      "section_title": true,
      "ja": "2.1。 CertificateRevocationLists"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST support the Certificate Revocation List (CRL) format defined in [KEYM]. If sending agents include CRLs in outgoing messages, the CRL format defined in [KEYM] MUST be used. In all cases, both v1 and v2 CRLs MUST be supported.",
      "ja": "受信エージェントは、[KEYM]で定義された証明書失効リスト（CRL）のフォーマットをサポートしなければなりません。送信エージェントが送信メッセージにCRLを含む場合、[KEYM]で定義されたCRLのフォーマットを使用しなければなりません。すべての場合において、v1とv2の両方のCRLをサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "All agents MUST be capable of performing revocation checks using CRLs as specified in [KEYM]. All agents MUST perform revocation status checking in accordance with [KEYM]. Receiving agents MUST recognize CRLs in received S/MIME messages.",
      "ja": "すべてのエージェントは、[KEYM]で指定されるようにCRLを使用して、失効チェックを行うことができなければなりません。すべてのエージェントが[KEYM]に従ってチェック失効ステータスを実行しなければなりません。受信エージェントは、受信S / MIMEメッセージでCRLを認識しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Agents SHOULD store CRLs received in messages for use in processing later messages.",
      "ja": "エージェントは、CRLが後でメッセージを処理する際に使用するためのメッセージで受信し保存する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.2. CertificateChoices",
      "section_title": true,
      "ja": "2.2。 CertificateChoices"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST support v1 X.509 and v3 X.509 identity certificates as profiled in [KEYM]. End entity certificates MAY include an Internet mail address, as described in section 3.",
      "ja": "[KEYM]にプロファイルとして受信剤には、V1のX.509およびv3のX.509 ID証明書をサポートしなければなりません。セクション3で説明したように、エンドエンティティ証明書は、インターネットメールアドレスを含んでいてもよいです。"
    },
    {
      "indent": 3,
      "text": "Receiving agents SHOULD support X.509 version 2 attribute certificates. See [ACAUTH] for details about the profile for attribute certificates.",
      "ja": "受信エージェントは、X.509バージョン2属性証明書をサポートする必要があります。属性証明書のプロファイルの詳細については、[ACAUTH]を参照してください。"
    },
    {
      "indent": 0,
      "text": "2.2.1. Historical Note About CMS Certificates",
      "section_title": true,
      "ja": "2.2.1。 CMS証明書についてヒストリカルノート"
    },
    {
      "indent": 3,
      "text": "The CMS message format supports a choice of certificate formats for public key content types: PKIX, PKCS #6 Extended Certificates [PKCS6] and PKIX Attribute Certificates.",
      "ja": "CMSメッセージフォーマットは、公開鍵コンテンツタイプの証明書フォーマットの選択をサポートしていますPKIX、PKCS＃6の拡張証明書[PKCS6]とPKIXは、証明書の属性。"
    },
    {
      "indent": 3,
      "text": "The PKCS #6 format is not in widespread use. In addition, PKIX certificate extensions address much of the same functionality and flexibility as was intended in the PKCS #6. Thus, sending and receiving agents MUST NOT use PKCS #6 extended certificates.",
      "ja": "PKCS＃6のフォーマットが普及していません。また、PKIX証明書機能拡張は、PKCS＃6で意図されたものと同じ機能と柔軟性の多くを扱います。このように、送信側と受信側のエージェントは、証明書を拡張PKCS＃6を使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "X.509 version 1 attribute certificates are also not widely implemented, and have been superseded with version 2 attribute certificates. Sending agents MUST NOT send version 1 attribute certificates.",
      "ja": "X.509バージョン1属性証明書はまた、広く実装されておらず、バージョン2属性証明書に取って代わられています。送付エージェントは、バージョン1の属性証明書を送ってはいけません。"
    },
    {
      "indent": 0,
      "text": "2.3. CertificateSet",
      "section_title": true,
      "ja": "2.3。証明書群"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST be able to handle an arbitrary number of certificates of arbitrary relationship to the message sender and to each other in arbitrary order. In many cases, the certificates included in a signed message may represent a chain of certification from the sender to a particular root. There may be, however, situations where the certificates in a signed message may be unrelated and included for convenience.",
      "ja": "受信エージェントは、メッセージの送信者に、任意の順序で相互に任意の関係の証明書の任意の数を扱うことができなければなりません。多くの場合、署名されたメッセージに含まれる証明書が送信者からの特定のルートに証明書の連鎖を表すことができます。しかし、署名されたメッセージ内の証明書は無関係と便宜のために含まれ得る状況が存在してもよいです。"
    },
    {
      "indent": 3,
      "text": "Sending agents SHOULD include any certificates for the user's public key(s) and associated issuer certificates. This increases the likelihood that the intended recipient can establish trust in the originator's public key(s). This is especially important when sending a message to recipients that may not have access to the sender's public key through any other means or when sending a signed message to a new recipient. The inclusion of certificates in outgoing messages can be omitted if S/MIME objects are sent within a group of correspondents that has established access to each other's certificates by some other means such as a shared directory or manual certificate distribution. Receiving S/MIME agents SHOULD be able to handle messages without certificates using a database or directory lookup scheme.",
      "ja": "送付エージェントは、ユーザーの公開鍵（S）と関連した発行者証明書のいずれかの証明書を含むべきです。これは、意図した受信者が発信者の公開鍵（複数可）で信頼を確立することができます可能性が高くなります。その他の手段を通じて、送信者の公開鍵へのアクセス権を持っているか、新しい受信者に署名されたメッセージを送信するときにないかもしれない受信者にメッセージを送信する場合、これは特に重要です。 S / MIMEオブジェクトは、共有ディレクトリまたは手動証明書配布のようないくつかの他の手段によって互いの証明書へのアクセスを確立している特派員のグループ内で送信された場合、発信メッセージ内の証明書を含めることを省略することができます。受信S / MIMEエージェントは、データベースまたはディレクトリルックアップスキームを使用して証明書なしでメッセージを処理できる必要があります。"
    },
    {
      "indent": 3,
      "text": "A sending agent SHOULD include at least one chain of certificates up to, but not including, a Certificate Authority (CA) that it believes that the recipient may trust as authoritative. A receiving agent MUST be able to handle an arbitrarily large number of certificates and chains.",
      "ja": "送付エージェントは、受信者が権威として信頼していることを信じている少なくとも一つまでの証明書のチェーンが、含めない、証明機関（CA）を含むべきです。受信エージェントは、証明書とチェーンの任意の多数を扱うことができなければなりません。"
    },
    {
      "indent": 3,
      "text": "Agents MAY send CA certificates, that is, certificates which can be considered the \"root\" of other chains, and which MAY be self-signed. Note that receiving agents SHOULD NOT simply trust any self-signed certificates as valid CAs, but SHOULD use some other mechanism to determine if this is a CA that should be trusted. Also note that when certificates contain DSA public keys the parameters may be located in the root certificate. This would require that the recipient possess both the end-entity certificate as well as the root certificate to perform a signature verification, and is a valid example of a case where transmitting the root certificate may be required.",
      "ja": "エージェントは、CA証明書、つまり、他のチェーンの「ルート」と考えることができ、証明書を送信することができ、そしてそれは、自己署名することができます。受信エージェントは単に有効なCAとして任意の自己署名証明書を信用しないでください、これは信頼すべきCAがあるかどうかを判断するために、いくつかの他のメカニズムを使用する必要があることに注意してください。また、証明書はDSA公開鍵が含まれている場合のパラメータは、ルート証明書に配置することができることに注意してください。これは、受信者が署名検証を実行するためにエンドエンティティ証明書だけでなく、ルート証明書の両方を有する、および送信ルート証明書が必要とされ得る場合を有効例であることを必要とするであろう。"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST support chaining based on the distinguished name fields. Other methods of building certificate chains MAY be supported.",
      "ja": "受信エージェントは、識別名のフィールドに基づいて、連鎖をサポートしなければなりません。証明書チェーンを構築する他の方法をサポートすることができます。"
    },
    {
      "indent": 3,
      "text": "Receiving agents SHOULD support the decoding of X.509 attribute certificates included in CMS objects. All other issues regarding the generation and use of X.509 attribute certificates are outside of the scope of this specification. One specification that addresses attribute certificate use is defined in [SECLABEL].",
      "ja": "受信エージェントは、CMSオブジェクトに含まX.509属性証明書のデコードをサポートする必要があります。 X.509属性証明書の生成および使用に関する他のすべての問題は、この仕様の範囲外です。属性証明書の利用に取り組む一つの仕様は[SECLABEL]で定義されています。"
    },
    {
      "indent": 0,
      "text": "3. Using Distinguished Names for Internet Mail",
      "section_title": true,
      "ja": "3.インターネットメールのための識別名を使用します"
    },
    {
      "indent": 3,
      "text": "End-entity certificates MAY contain an Internet mail address as described in [RFC-2822]. The address must be an \"addr-spec\" as defined in Section 3.4.1 of that specification. The email address SHOULD be in the subjectAltName extension, and SHOULD NOT be in the subject distinguished name.",
      "ja": "[RFC-2822]で説明したように、エンドエンティティ証明書は、インターネットメールアドレスを含むかもしれません。その仕様のセクション3.4.1で定義されたアドレスが「ADDRスペック」でなければなりません。メールアドレスはsubjectAltName拡張であるべきであり、サブジェクト識別名にすべきではありません。"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST recognize and accept certificates that contain no email address. Agents are allowed to provide an alternative mechanism for associating an email address with a certificate that does not contain an email address, such as through the use of the agent's address book, if available. Receiving agents MUST recognize email addresses in the subjectAltName field. Receiving agents MUST recognize email addresses in the Distinguished Name field in the PKCS #9 [PKCS9] emailAddress attribute:",
      "ja": "受信エージェントには、電子メールアドレスが含まれていない証明書を認識し、受け入れなければなりません。エージェントが利用可能な場合、そのような物質のアドレス帳を使用してのように電子メールアドレスが含まれていない証明書を使用してメールアドレスを関連付けるための代替メカニズムを提供することが許可されています。受信エージェントは、のsubjectAltNameフィールドに電子メールアドレスを認識しなければなりません。受信エージェントは、PKCS＃で識別名フィールドに電子メールアドレスを認識しなければならない9 [PKCS9] EMAILADDRESS属性："
    },
    {
      "indent": 3,
      "text": "pkcs-9-at-emailAddress OBJECT IDENTIFIER ::=\n  {iso(1) member-body(2) us(840) rsadsi(113549) pkcs(1) pkcs-9(9) 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note that this attribute MUST be encoded as IA5String.",
      "ja": "この属性はIA5Stringとして符号化されなければならないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "Sending agents SHOULD make the address in the From or Sender header in a mail message match an Internet mail address in the signer's certificate. Receiving agents MUST check that the address in the From or Sender header of a mail message matches an Internet mail address, if present, in the signer's certificate, if mail addresses are present in the certificate. A receiving agent SHOULD provide some explicit alternate processing of the message if this comparison fails, which may be to display a message that shows the recipient the addresses in the certificate or other certificate details.",
      "ja": "送付エージェントは、署名者の証明書でインターネットメールアドレスと一致するメールメッセージでから、または送信者のヘッダ内のアドレスを確認する必要があります。存在する場合メールアドレスが証明書に存在している場合は受信剤には、署名者の証明書には、メールメッセージの送信者から、またはヘッダ内のアドレスは、インターネットメールアドレスと一致していることをチェックしなければなりません。この比較が失敗した場合、受信エージェントは、受信者に証明書または他の証明書の詳細のアドレスを示すメッセージを表示するためであってもよい、メッセージのいくつかの明示的な代替処理を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "A receiving agent SHOULD display a subject name or other certificate details when displaying an indication of successful or unsuccessful signature verification.",
      "ja": "成功または失敗署名検証の指示を表示する際に、受信エージェントは、サブジェクト名または他の証明書の詳細を表示する必要があります。"
    },
    {
      "indent": 3,
      "text": "All subject and issuer names MUST be populated (i.e., not an empty SEQUENCE) in S/MIME-compliant X.509 identity certificates, except that the subject DN in a user's (i.e., end-entity) certificate MAY be an empty SEQUENCE in which case the subjectAltName extension will include the subject's identifier and MUST be marked as critical.",
      "ja": "すべてのサブジェクトと発行者名は、ユーザの（すなわち、エンドエンティティ）証明書のサブジェクトDNが内空配列であってもよいことを除いて、S / MIME準拠のX.509のID証明書で（つまり、いない空のSEQUENCE）居住しなければなりませんその場合、subjectAltName拡張は、被験者の識別子が含まれますし、重要としてマークされなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Certificate Processing",
      "section_title": true,
      "ja": "4.証明書の処理"
    },
    {
      "indent": 3,
      "text": "A receiving agent needs to provide some certificate retrieval mechanism in order to gain access to certificates for recipients of digital envelopes. There are many ways to implement certificate retrieval mechanisms. X.500 directory service is an excellent example of a certificate retrieval-only mechanism that is compatible with classic X.500 Distinguished Names. Another method under consideration by the IETF is to provide certificate retrieval services as part of the existing Domain Name System (DNS). Until such mechanisms are widely used, their utility may be limited by the small number of correspondent's certificates that can be retrieved. At a minimum, for initial S/MIME deployment, a user agent could automatically generate a message to an intended recipient requesting that recipient's certificate in a signed return message.",
      "ja": "受信エージェントは、デジタルエンベロープの受信者の証明書へのアクセスを得るために、いくつかの証明書取得メカニズムを提供する必要があります。証明書取得メカニズムを実装するための多くの方法があります。 X.500ディレクトリサービスは、古典的なX.500識別名と互換性のある証明書の取得のみメカニズムの優れた例です。 IETFによって考慮中の別の方法は、既存のドメインネームシステム（DNS）の一部として証明書検索サービスを提供することです。そのようなメカニズムが広く使用されるまで、その有用性を取得することができ特派の証明書の数が少ないによって制限される場合があります。最低でも、初期のS / MIMEの展開のために、ユーザエージェントは自動的に署名したリターン・メッセージにその受信者の証明書を要求することを意図した受信者へのメッセージを生成することができます。"
    },
    {
      "indent": 3,
      "text": "Receiving and sending agents SHOULD also provide a mechanism to allow a user to \"store and protect\" certificates for correspondents in such a way so as to guarantee their later retrieval. In many environments, it may be desirable to link the certificate retrieval/storage mechanisms together in some sort of certificate database. In its simplest form, a certificate database would be local to a particular user and would function in a similar way as an \"address book\" that stores a user's frequent correspondents. In this way, the certificate retrieval mechanism would be limited to the certificates that a user has stored (presumably from incoming messages). A comprehensive certificate retrieval/storage solution may combine two or more mechanisms to allow the greatest flexibility and utility to the user. For instance, a secure Internet mail agent may resort to checking a centralized certificate retrieval mechanism for a certificate if it can not be found in a user's local certificate storage/retrieval database.",
      "ja": "受信と送信の薬剤はまた、彼らの後に検索を保証するようにユーザーに「ストアおよび保護」できるような方法で特派ための証明書をするためのメカニズムを提供する必要があります。多くの環境では、証明書データベースのいくつかの並べ替えでは、証明書取得/記憶メカニズムを一緒にリンクすることが望ましい場合があります。最も単純な形式では、証明書データベースは、特定のユーザーにローカルになり、ユーザーの頻繁特派を保存する「アドレス帳」と同様の方法で機能します。このように、証明書取得メカニズムは、ユーザが（おそらく着信メッセージからの）記憶された証明書に限定されるであろう。包括的な証明書の取得/保存溶液は、ユーザに最大の柔軟性と有用性を可能にするために、二つ以上のメカニズムを組み合わせてもよいです。例えば、安全なインターネットメールエージェントは、それがユーザーのローカル証明書ストレージ/検索データベースで見つからない場合、証明書のための集中証明書取得メカニズムを確認するに頼ることがあります。"
    },
    {
      "indent": 3,
      "text": "Receiving and sending agents SHOULD provide a mechanism for the import and export of certificates, using a CMS certs-only message. This allows for import and export of full certificate chains as opposed to just a single certificate. This is described in [SMIME-MSG].",
      "ja": "受信とエージェントは、CMSの本命だけメッセージを使用して、証明書のインポートおよびエクスポートするためのメカニズムを提供すべきで送ります。ちょうど単一の証明書とは対照的に、これは完全な証明書チェーンのインポートおよびエクスポートが可能になります。これは[SMIME-MSG]に記載されています。"
    },
    {
      "indent": 3,
      "text": "Agents MUST handle multiple valid Certification Authority (CA) certificates containing the same subject name and the same public keys but with overlapping validity intervals.",
      "ja": "エージェントは同じサブジェクト名を含む複数の有効な認証局（CA）証明書と同じ公開鍵が、妥当性間隔を重ねるとを処理する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.1. Certificate Revocation Lists",
      "section_title": true,
      "ja": "4.1。証明書失効リスト"
    },
    {
      "indent": 3,
      "text": "In general, it is always better to get the latest CRL information from a CA than to get information stored away from incoming messages. A receiving agent SHOULD have access to some certificate revocation list (CRL) retrieval mechanism in order to gain access to certificate revocation information when validating certification paths. A receiving or sending agent SHOULD also provide a mechanism to allow a user to store incoming certificate revocation information for correspondents in such a way so as to guarantee its later retrieval.",
      "ja": "一般的には、情報が受信メッセージから離れて格納されますするよりも、CAから最新のCRL情報を取得するために、常により良いです。受信エージェントは、認証パスの検証時に、証明書失効情報へのアクセスを得るために、いくつかの証明書失効リスト（CRL）検索メカニズムにアクセスする必要があります。受信または送信エージェントはまた、後の検索を保証するように、ユーザは、このような方法で、特派員の着信証明書失効情報を格納できるようにするメカニズムを提供するべきです。"
    },
    {
      "indent": 3,
      "text": "Receiving and sending agents SHOULD retrieve and utilize CRL information every time a certificate is verified as part of a certification path validation even if the certificate was already verified in the past. However, in many instances (such as off-line verification) access to the latest CRL information may be difficult or impossible. The use of CRL information, therefore, may be dictated by the value of the information that is protected. The value of the CRL information in a particular context is beyond the scope of this specification but may be governed by the policies associated with particular certification paths.",
      "ja": "受信と送信エージェントは、取得およびCRL情報に証明書は、証明書がすでに過去に確認された場合でも、証明書パス検証の一環として検証されるたびに利用すべきです。しかし、（例えばオフライン検証など）多くの場合、最新のCRL情報へのアクセスが困難または不可能であろう。 CRL情報の使用は、したがって、保護されている情報の値によって決定されてもよいです。特定のコンテキスト内のCRL情報の値は、本明細書の範囲外であるが、特定の認証パスに関連付けられたポリシーによって管理されてもよいです。"
    },
    {
      "indent": 3,
      "text": "All agents MUST be capable of performing revocation checks using CRLs as specified in [KEYM]. All agents MUST perform revocation status checking in accordance with [KEYM]. Receiving agents MUST recognize CRLs in received S/MIME messages.",
      "ja": "すべてのエージェントは、[KEYM]で指定されるようにCRLを使用して、失効チェックを行うことができなければなりません。すべてのエージェントが[KEYM]に従ってチェック失効ステータスを実行しなければなりません。受信エージェントは、受信S / MIMEメッセージでCRLを認識しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2. Certification Path Validation",
      "section_title": true,
      "ja": "4.2。認証パス検証"
    },
    {
      "indent": 3,
      "text": "In creating a user agent for secure messaging, certificate, CRL, and certification path validation SHOULD be highly automated while still acting in the best interests of the user. Certificate, CRL, and path validation MUST be performed as per [KEYM] when validating a correspondent's public key. This is necessary before using a public key to provide security services such as: verifying a signature; encrypting a content-encryption key (ex: RSA); or forming a pairwise symmetric key (ex: Diffie-Hellman) to be used to encrypt or decrypt a content-encryption key.",
      "ja": "まだユーザーの最善の利益に動作しているときに、証明書をセキュアなメッセージングのためのユーザエージェントを作成するには、CRL、および証明書パスの検証は、高度に自動化されるべきである（SHOULD）。特派者の公開鍵を検証する際、証明書、CRL、およびパス検証は[KEYM]ごとに実行しなければなりません。これは、次のようなセキュリティサービスを提供するために、公開鍵を使用する前に必要です：署名を検証します。コンテンツ暗号化キーを暗号化する（例：RSA）;コンテンツ暗号化キーを暗号化または復号化に使用される：またはペアワイズ対称鍵（ディフィー・ヘルマンEX）を形成します。"
    },
    {
      "indent": 3,
      "text": "Certificates and CRLs are made available to the path validation procedure in two ways: a) incoming messages, and b) certificate and CRL retrieval mechanisms. Certificates and CRLs in incoming messages are not required to be in any particular order nor are they required to be in any way related to the sender or recipient of the message (although in most cases they will be related to the sender). Incoming certificates and CRLs SHOULD be cached for use in path validation and optionally stored for later use. This temporary certificate and CRL cache SHOULD be used to augment any other certificate and CRL retrieval mechanisms for path validation on incoming signed messages.",
      "ja": "A）受信メッセージ、およびb）証明書とCRL検索メカニズム：証明書とCRLは、2つの方法でパス検証手順に利用可能にされます。受信メッセージ内の証明書とCRLは特定の順序である必要はありませんも（ほとんどの場合、彼らは送信者に関連しますが）、彼らは、メッセージの送信者または受信者に関連するどのような方法であることが要求されています。着信証明書とCRLは、パス検証に使用するためにキャッシュされ、必要に応じて、後で使用するために保存しなければなりません。この一時証明書およびCRLキャッシュは着信署名されたメッセージにパス検証のための任意の他の証明書とCRL検索メカニズムを増強するために使用されるべきです。"
    },
    {
      "indent": 0,
      "text": "4.3. Certificate and CRL Signing Algorithms",
      "section_title": true,
      "ja": "4.3。証明書とCRLの署名アルゴリズム"
    },
    {
      "indent": 3,
      "text": "Certificates and Certificate Revocation Lists (CRLs) are signed by the certificate issuer. A receiving agent MUST be capable of verifying the signatures on certificates and CRLs made with id-dsa-with-sha1 [CMSALG].",
      "ja": "証明書と証明書失効リスト（CRL）は、証明書発行者によって署名されています。受信エージェントは、ID-DSA-WITH-SHA1 [CMSALG]で作られた証明書とCRLの署名を検証することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "A receiving agent MUST be capable of verifying the signatures on certificates and CRLs made with md5WithRSAEncryption and sha1WithRSAEncryption signature algorithms with key sizes from 512 bits to 2048 bits described in [CMSALG].",
      "ja": "受信エージェントは、[CMSALG]に記載の2048ビットを512ビットの鍵サイズでmd5WithRSAEncryptionとsha1WithRSAEncryption署名アルゴリズムを用いて作られた証明書とCRLの署名を検証することができなければなりません。"
    },
    {
      "indent": 3,
      "text": "Because of the security issues surrounding MD2 [RC95], and in light of current use, md2WithRSAEncryption MAY be supported.",
      "ja": "なぜならMD2 [RC95]を取り巻くセキュリティ問題の、及び現在の使用に照らして、md2WithRSAEncryptionをサポートすることができます。"
    },
    {
      "indent": 0,
      "text": "4.4. PKIX Certificate Extensions",
      "section_title": true,
      "ja": "4.4。 PKIX証明書エクステンション"
    },
    {
      "indent": 3,
      "text": "PKIX describes an extensible framework in which the basic certificate information can be extended and how such extensions can be used to control the process of issuing and validating certificates. The PKIX Working Group has ongoing efforts to identify and create extensions which have value in particular certification environments. Further, there are active efforts underway to issue PKIX certificates for business purposes. This document identifies the minimum required set of certificate extensions which have the greatest value in the S/MIME environment. The syntax and semantics of all the identified extensions are defined in [KEYM].",
      "ja": "PKIXは、基本的な証明書情報を拡張することができ、どのような拡張機能が証明書を発行し、検証のプロセスを制御するために使用することができる拡張可能なフレームワークを記述する。 PKIXワーキンググループは特定して、特定の認証環境での値を持つ拡張を作成するための継続的な努力を持っています。さらに、ビジネス上の目的のためにPKIX証明書を発行するために進行中の積極的な取り組みがあります。この文書では、S / MIME環境での最大の価値を持っている証明書拡張の必要最小限のセットを識別する。 [KEYM]で識別されたすべての拡張機能の構文とセマンティクスが定義されています。"
    },
    {
      "indent": 3,
      "text": "Sending and receiving agents MUST correctly handle the basic constraints, key usage, authority key identifier, subject key identifier, and subject alternative names certificate extensions when they appear in end-entity and CA certificates. Some mechanism SHOULD exist to gracefully handle other certificate extensions when they appear in end-entity or CA certificates.",
      "ja": "彼らはエンドエンティティおよびCA証明書に表示されたときに送信側と受信側のエージェントは、正しく基本的な制約、キーの使用、権威の主要な識別子、サブジェクトキー識別子、およびサブジェクト代替名の証明書拡張を処理する必要があります。彼らはエンドエンティティまたはCA証明書に表示されたときにいくつかのメカニズムは、優雅に、他の証明書の拡張を処理するために存在している必要があります。"
    },
    {
      "indent": 3,
      "text": "Certificates issued for the S/MIME environment SHOULD NOT contain any critical extensions (extensions that have the critical field set to TRUE) other than those listed here. These extensions SHOULD be marked as non-critical unless the proper handling of the extension is deemed critical to the correct interpretation of the associated certificate. Other extensions may be included, but those extensions SHOULD NOT be marked as critical.",
      "ja": "S / MIME環境のために発行された証明書ここに記載されている以外の任意の重要な機能拡張（TRUEに設定され、重要なフィールドを持っている拡張子）を含んではいけません。拡張子の適切な取り扱いは、関連付けられた証明書の正しい解釈に重要とみなされない限り、これらの拡張機能は、非クリティカルとしてマークする必要があります。その他の拡張機能が含まれていてもよいが、これらの拡張機能は、クリティカルとしてマークされるべきではありません。"
    },
    {
      "indent": 3,
      "text": "Interpretation and syntax for all extensions MUST follow [KEYM], unless otherwise specified here.",
      "ja": "そうでない場合は、ここで指定しない限り、すべての拡張機能のための解釈と構文は、[KEYM]従わなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.4.1. Basic Constraints Certificate Extension",
      "section_title": true,
      "ja": "4.4.1。基本制約証明書拡張"
    },
    {
      "indent": 3,
      "text": "The basic constraints extension serves to delimit the role and position that an issuing authority or end-entity certificate plays in a certification path.",
      "ja": "基本制約拡張は、証明書パスで発行機関またはエンドエンティティ証明書の果たす役割と位置を区切るのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "For example, certificates issued to CAs and subordinate CAs contain a basic constraint extension that identifies them as issuing authority certificates. End-entity certificates contain an extension that constrains the certificate from being an issuing authority certificate.",
      "ja": "たとえば、CAと下位CAに発行された証明書は、権限証明書を発行するようにそれらを識別し、基本的な制約の拡張機能が含まれています。エンドエンティティ証明書は、発行機関の証明書であることから証明書を制約拡張が含まれています。"
    },
    {
      "indent": 3,
      "text": "Certificates SHOULD contain a basicConstraints extension in CA certificates, and SHOULD NOT contain that extension in end entity certificates.",
      "ja": "証明書は、CA証明書におけるbasicConstraintsの拡張が含まれている必要があり、エンドエンティティ証明書でその拡張子を含めることはできません。"
    },
    {
      "indent": 0,
      "text": "4.4.2. Key Usage Certificate Extension",
      "section_title": true,
      "ja": "4.4.2。キー使用法証明書拡張"
    },
    {
      "indent": 3,
      "text": "The key usage extension serves to limit the technical purposes for which a public key listed in a valid certificate may be used. Issuing authority certificates may contain a key usage extension that restricts the key to signing certificates, certificate revocation lists and other data.",
      "ja": "鍵使用拡張が有効な証明書に記載されている公開鍵が使用される技術的な目的を制限するのに役立ちます。機関の証明書を発行すると、署名証明書、証明書失効リストおよびその他のデータへの鍵を制限するKeyUsage拡張を含みます。"
    },
    {
      "indent": 3,
      "text": "For example, a certification authority may create subordinate issuer certificates which contain a key usage extension which specifies that the corresponding public key can be used to sign end user certificates and sign CRLs.",
      "ja": "例えば、認証局は、対応する公開鍵は、エンドユーザーの証明書に署名し、CRLを署名するのに使用できることを指定鍵用途拡張が含まれている下位の発行者証明書を作成することができます。"
    },
    {
      "indent": 3,
      "text": "If a key usage extension is included in a PKIX certificate, then it MUST be marked as critical.",
      "ja": "鍵用途拡張がPKIX証明書に含まれている場合、それは重要としてマークする必要があります。"
    },
    {
      "indent": 3,
      "text": "S/MIME receiving agents MUST NOT accept the signature of a message if it was verified using a certificate which contains the key usage extension without either the digitalSignature or nonRepudiation bit set. Sometimes S/MIME is used as a secure message transport for applications beyond interpersonal messaging. In such cases, the S/MIME-enabled application can specify additional requirements concerning the digitalSignature or nonRepudiation bits within this extension.",
      "ja": "それがデジタル署名または否認防止のいずれかのビットが設定せずに鍵使用拡張を含む証明書を用いて検証した場合、S / MIME受信エージェントは、メッセージの署名を受け入れてはいけません。時には、S / MIMEは、対人メッセージングを超えたアプリケーションのためのセキュアなメッセージ・トランスポートとして使用されています。このような場合には、S / MIME対応のアプリケーションは、この拡張内にデジタル署名または否認防止ビットに関する追加要件を指定することができます。"
    },
    {
      "indent": 3,
      "text": "If the key usage extension is not specified, receiving clients MUST presume that the digitalSignature and nonRepudiation bits are set.",
      "ja": "鍵用途拡張が指定されていない場合は、受信しているクライアントは、デジタル署名と否認防止ビットが設定されていることを前提としなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.4.3. Subject Alternative Name Extension",
      "section_title": true,
      "ja": "4.4.3。サブジェクトの別名拡張"
    },
    {
      "indent": 3,
      "text": "The subject alternative name extension is used in S/MIME as the preferred means to convey the RFC-2822 email address(es) that correspond(s) to the entity for this certificate. Any RFC-2822 email addresses present MUST be encoded using the rfc822Name CHOICE of the GeneralName type. Since the SubjectAltName type is a SEQUENCE OF GeneralName, multiple RFC-2822 email addresses MAY be present.",
      "ja": "サブジェクト代替名の拡張子は、この証明書のためのエンティティに対応するRFC-2822のメールアドレス（ES）（単数または複数）を伝達するための好ましい手段として、S / MIMEで使用されています。存在する任意のRFC-2822の電子メールアドレスはrfc822NameでCHOICEのGeneralNameタイプのを使用して符号化されなければなりません。 SubjectAltNameタイプがのGeneralNameのシーケンスであるので、複数のRFC-2822の電子メールアドレスが存在してもよいです。"
    },
    {
      "indent": 0,
      "text": "4.4.4. Extended Key Usage Extension",
      "section_title": true,
      "ja": "4.4.4。拡張鍵用途拡張"
    },
    {
      "indent": 3,
      "text": "The extended key usage extension also serves to limit the technical purposes for which a public key listed in a valid certificate may be used. The set of technical purposes for the certificate therefore are the intersection of the uses indicated in the key usage and extended key usage extensions.",
      "ja": "拡張鍵使用拡張はまた、有効な証明書に記載されている公開鍵が使用される技術的な目的を制限するのに役立ちます。証明書のための技術的な目的のセットは、したがって、キーの使用と拡張キー使用拡張に示されている用途の交差点です。"
    },
    {
      "indent": 3,
      "text": "For example, if the certificate contains a key usage extension indicating digital signature and an extended key usage extension which includes the email protection OID, then the certificate may be used for signing but not encrypting S/MIME messages. If the certificate contains a key usage extension indicating digital signature, but no extended key usage extension then the certificate may also be used to sign but not encrypt S/MIME messages.",
      "ja": "証明書は、デジタル署名および電子メール保護OIDを含む拡張鍵使用拡張を示すキー用途拡張が含まれている場合、例えば、証明書は、S / MIMEメッセージの署名ではなく、暗号化のために使用することができます。証明書は、デジタル署名を示す鍵使用拡張が含まれていないが、何の拡張鍵使用拡張場合、証明書はまた、S / MIMEメッセージを暗号化署名ではなくするために使用することができます。"
    },
    {
      "indent": 3,
      "text": "If the extended key usage extension is present in the certificate then interpersonal message S/MIME receiving agents MUST check that it contains either the emailProtection or the anyExtendedKeyUsage OID as defined in [KEYM]. S/MIME uses other than interpersonal messaging MAY require the explicit presence of the extended key usage extension or other OIDs to be present in the extension or both.",
      "ja": "拡張鍵使用拡張が証明書内に存在する場合、エージェントを受信対人メッセージS / MIMEは、[KEYM]で定義されるように、それはemailProtection又はanyExtendedKeyUsage OIDのいずれかが含まれていることをチェックしなければなりません。 S / MIMEは、拡張または両方に存在する拡張鍵使用拡張または他のOIDの明示的な存在を必要とする場合がある対人メッセージング以外の用途。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "All of the security issues faced by any cryptographic application must be faced by a S/MIME agent. Among these issues are protecting the user's private key, preventing various attacks, and helping the user avoid mistakes such as inadvertently encrypting a message for the wrong recipient. The entire list of security considerations is beyond the scope of this document, but some significant concerns are listed here.",
      "ja": "任意の暗号化アプリケーションが直面するセキュリティ問題のすべては、S / MIMEエージェントが直面しなければなりません。これらの問題の中で、ユーザの秘密鍵を保護する様々な攻撃を防止し、ユーザーがそのような不注意で間違った受信者へのメッセージを暗号化するなどのミスを避ける支援しています。セキュリティの考慮事項のリスト全体は、このドキュメントの範囲を超えていますが、いくつかの重要な関心事は、ここに記載されています。"
    },
    {
      "indent": 3,
      "text": "When processing certificates, there are many situations where the processing might fail. Because the processing may be done by a user agent, a security gateway, or other program, there is no single way to handle such failures. Just because the methods to handle the failures has not been listed, however, the reader should not assume that they are not important. The opposite is true: if a certificate is not provably valid and associated with the message, the processing software should take immediate and noticeable steps to inform the end user about it.",
      "ja": "証明書を処理する場合、処理が失敗するかもしれない多くの状況があります。処理は、ユーザエージェント、セキュリティゲートウェイ、または他のプログラムによって行うことができるので、そのような障害を処理するための単一の方法は存在しません。障害を処理するための方法が記載されていなかったからといって、しかし、読者は、彼らが重要ではないことを仮定するべきではありません。逆は真である：証明書は証明可能有効で、メッセージに関連付けられていない場合、処理ソフトウェアはそれについてエンドユーザーに通知するために迅速かつ顕著なステップを取る必要があります。"
    },
    {
      "indent": 3,
      "text": "Some of the many places where signature and certificate checking might fail include:",
      "ja": "署名と証明書の確認が失敗するかもしれない多くの場所のいくつかは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- no Internet mail addresses in a certificate matches the sender of a message, if the certificate contains at least one mail address - no certificate chain leads to a trusted CA - no ability to check the CRL for a certificate - an invalid CRL was received - the CRL being checked is expired - the certificate is expired - the certificate has been revoked",
      "ja": "証明書のCRLをチェックする能力 -   - 信頼されたCAにありません証明書チェーンのリード -   - 証明書は、少なくとも1つのメールアドレスが含まれている場合、証明書にはインターネットメールアドレスは、メッセージの送信者と一致していない無効なCRLを受信しました - チェックされるCRLは、有効期限が切れている - 証明書の有効期限が切れている - 証明書が失効しています"
    },
    {
      "indent": 3,
      "text": "There are certainly other instances where a certificate may be invalid, and it is the responsibility of the processing software to check them all thoroughly, and to decide what to do if the check fails.",
      "ja": "そこ証明書が無効になる可能性のある他のインスタンスは確かであり、それは徹底的にそれらすべてをチェックするために、チェックが失敗した場合に何をすべきかを決定するために、処理ソフトウェアの責任です。"
    },
    {
      "indent": 3,
      "text": "At the Selected Areas in Cryptography '95 conference in May 1995, Rogier and Chauvaud presented an attack on MD2 that can nearly find collisions [RC95]. Collisions occur when one can find two different messages that generate the same message digest. A checksum operation in MD2 is the only remaining obstacle to the success of the attack. For this reason, the use of MD2 for new applications is discouraged. It is still reasonable to use MD2 to verify existing signatures, as the ability to find collisions in MD2 does not enable an attacker to find new messages having a previously computed hash value.",
      "ja": "1995年5月における暗号'95会議で選択された領域では、ロジェとChauvaudは、ほぼ衝突[RC95]を見つけることができますMD2への攻撃を発表しました。 1が同じメッセージダイジェストを生成する2つの異なるメッセージを見つけることができたときに衝突が発生します。 MD2のチェックサム操作は、攻撃の成功への唯一の残りの障害となっています。このため、新しいアプリケーションのMD2の使用が推奨されていません。 MD2で衝突を見つける能力は以前に計算されたハッシュ値を持つ新しいメッセージを見つけるために、攻撃者が有効にならないよう、既存の署名を検証するためにMD2を使用することが合理的です。"
    },
    {
      "indent": 3,
      "text": "It is possible for there to be multiple unexpired CRLs for a CA. If an agent is consulting CRLs for certificate validation, it SHOULD make sure that the most recently issued CRL for that CA is consulted, since an S/MIME message sender could deliberately include an older unexpired CRL in an S/MIME message. This older CRL might not include recent revoked certificates, which might lead an agent to accept a certificate that has been revoked in a subsequent CRL.",
      "ja": "CAの複数の期限が切れていないのCRLが存在することが可能ですエージェントは、証明書の検証のためのCRLを協議している場合は、S / MIMEメッセージの送信者が意図的にS / MIMEメッセージで古い期限が切れていないCRLが含まれる可能性があるので、それは、そのCAのための最も最近発行されたCRLが参照されていることを確認する必要があります。この古いCRLは、その後のCRLに失効している証明書を受け入れるようにエージェントを導くかもしれない最近失効した証明書を、含まれない場合があります。"
    },
    {
      "indent": 3,
      "text": "When determining the time for a certificate validity check, agents have to be careful to use a reliable time. Unless it is from a trusted agent, this time MUST NOT be the SigningTime attribute found in an S/MIME message. For most sending agents, the SigningTime attribute could be deliberately set to direct the receiving agent to check a CRL that could have out-of-date revocation status for a certificate, or cause an improper result when checking the Validity field of a certificate.",
      "ja": "証明書の有効性確認のための時間を決定する場合、エージェントは、信頼できる時刻を使用して注意する必要があります。それは信頼できるエージェントからのものでない限り、この時間は、S / MIMEメッセージで見つかったSigningTime属性にすることはできません。ほとんどの送信エージェントの場合、SigningTime属性が故意に証明書の期限切れの失効ステータスを持っている、または証明書の有効性フィールドをチェックする際に不適切な結果を引き起こす可能性のCRLをチェックするために受信エージェントに指示するように設定することができます。"
    },
    {
      "indent": 0,
      "text": "A. References",
      "ja": "A.参考文献"
    },
    {
      "indent": 0,
      "text": "A.1. Normative References",
      "ja": "A.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[ACAUTH] Farrell, S. and R. Housley, \"An Internet Attribute Certificate Profile for Authorization\", RFC 3281, April 2002.",
      "ja": "[ACAUTH]ファレル、S.とR. Housley氏、 \"認可のためのインターネット属性証明書プロフィール\"、RFC 3281、2002年4月。"
    },
    {
      "indent": 3,
      "text": "[CMS] Housely, R., \"Cryptographic Message Syntax (CMS)\", RFC 3852, July 2004.",
      "ja": "[CMS] Housely、R.、 \"暗号メッセージ構文（CMS）\"、RFC 3852、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[CMSALG] Housley, R., \"Cryptographic Message Syntax (CMS) Algorithms\", RFC 3370, August 2002.",
      "ja": "[CMSALG] Housley氏、R.、 \"暗号メッセージ構文（CMS）アルゴリズム\"、RFC 3370、2002年8月。"
    },
    {
      "indent": 3,
      "text": "[KEYM] Housley, R., Polk, W., Ford, W., and D. Solo, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 3280, April 2002.",
      "ja": "[KEYM] Housley氏、R.、ポーク、W.、フォード、W.、およびD.ソロ、 \"インターネットX.509公開鍵暗号基盤証明書と証明書失効リスト（CRL）プロフィール\"、RFC 3280、2002年4月。"
    },
    {
      "indent": 3,
      "text": "[KEYMALG] Bassham, L., Polk, W., and R. Housley, \"Algorithms and Identifiers for the Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 3279, April 2002.",
      "ja": "[KEYMALG]、RFC 3279 Bassham、L.、ポーク、W.、およびR. Housley氏、 \"インターネットX.509公開鍵暗号基盤証明書と証明書失効リスト（CRL）プロフィールのためのアルゴリズムと識別子\"、2002年4月。"
    },
    {
      "indent": 3,
      "text": "[MUSTSHOULD] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[MUSTSHOULD]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[PKCS9] Nystrom, M. and B. Kaliski, \"PKCS #9: Selected Object Classes and Attribute Types Version 2.0\", RFC 2985, November 2000.",
      "ja": "[PKCS9] Nystrom、M.とB. Kaliski、 \"PKCS＃9：選択したオブジェクトのクラスと属性タイプバージョン2.0\"、RFC 2985、2000年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2822], Resnick, P., \"Internet Message Format\", RFC 2822, April 2001.",
      "ja": "[RFC-2822]、レズニック、P.、 \"インターネットメッセージ形式\"、RFC 2822、2001年4月。"
    },
    {
      "indent": 3,
      "text": "[SMIME-MSG] Ramsdell, B., Ed., \"S/MIME Version 3.1 Message Specification\", RFC 3851, July 2004.",
      "ja": "[SMIME-MSG] Ramsdell、B.、エド。、 \"S / MIMEバージョン3.1メッセージ仕様\"、RFC 3851、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[x.208-88] ITU-T. Recommendation X.208: Specification of Abstract Syntax Notation One (ASN.1). 1988.",
      "ja": "【x.208-88] ITU-T。勧告X.208：抽象構文記法1（ASN.1）の仕様。 1988。"
    },
    {
      "indent": 0,
      "text": "A.2. Informative References",
      "ja": "A.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[CERTV2] Dusse, S., Hoffman, P., Ramsdell, B., and J. Weinstein, \"S/MIME Version 2 Certificate Handling\", RFC 2312, March 1998.",
      "ja": "【CERTV2] Dusse、S.、ホフマン、P.、Ramsdell、B.、およびJ.ワインスタイン、 \"S / MIMEバージョン2証明書処理\"、RFC 2312、1998年3月。"
    },
    {
      "indent": 3,
      "text": "[PKCS6] RSA Laboratories, \"PKCS #6: Extended-Certificate Syntax Standard\", November 1993.",
      "ja": "[PKCS6] RSA Laboratories社、 \"PKCS＃6：拡張-証明書の構文標準\"、1993年11月。"
    },
    {
      "indent": 3,
      "text": "[RC95] Rogier, N. and Chauvaud, P., \"The compression function of MD2 is not collision free,\" Presented at Selected Areas in Cryptography '95, May 1995.",
      "ja": "[RC95]ロジェ、N.とChauvaud、P.、「MD2の圧縮機能は、衝突の自由ではない、」暗号'95、1995年5月には選択された領域で発表。"
    },
    {
      "indent": 3,
      "text": "[SECLABEL] Nicolls, W., \"Implementing Company Classification Policy with the S/MIME Security Label\", RFC 3114, May 2002.",
      "ja": "[SECLABEL] Nicolls、W.、RFC 3114 \"S / MIMEセキュリティラベルと実装会社の分類方針\"、2002年5月。"
    },
    {
      "indent": 3,
      "text": "[X.500] ITU-T Recommendation X.500 (1997) | ISO/IEC 9594-1:1997, Information technology - Open Systems Interconnection - The Directory: Overview of concepts, models and services.",
      "ja": "[X.500] ITU-T勧告X.500（1997）| ISO / IEC 9594から1：1997、情報技術 - 開放型システム間相互接続 - ディレクトリ：概念、モデルとサービスの概要。"
    },
    {
      "indent": 3,
      "text": "[X.501] ITU-T Recommendation X.501 (1997) | ISO/IEC 9594-2:1997, Information technology - Open Systems Interconnection - The Directory: Models.",
      "ja": "[X.501] ITU-T勧告X.501（1997）| ISO / IEC 9594から2：1997、情報技術 - 開放型システム間相互接続 - ディレクトリ：モデル。"
    },
    {
      "indent": 3,
      "text": "[X.509] ITU-T Recommendation X.509 (1997) | ISO/IEC 9594-8:1997, Information technology - Open Systems Interconnection - The Directory: Authentication framework.",
      "ja": "[X.509] ITU-T勧告X.509（1997）| ISO / IEC 9594から8：1997、情報技術 - 開放型システム間相互接続 - ディレクトリ：認証フレームワーク。"
    },
    {
      "indent": 3,
      "text": "[X.520] ITU-T Recommendation X.520 (1997) | ISO/IEC 9594-6:1997, Information technology - Open Systems Interconnection - The Directory: Selected attribute types.",
      "ja": "[X.520] ITU-T勧告X.520（1997）| ISO / IEC 9594から6：1997、情報技術 - 開放型システム間相互接続 - ディレクトリ：選択した属性タイプ。"
    },
    {
      "indent": 0,
      "text": "B. Acknowledgements",
      "ja": "B.謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks go out to the other authors of the S/MIME v2 RFC: Steve Dusse, Paul Hoffman and Jeff Weinstein. Without v2, there wouldn't be a v3.",
      "ja": "スティーブDusse、ポール・ホフマンとジェフ・ワインスタイン：多くのおかげでは、S / MIME V2がRFCの他の作家に出かけます。 v2とせずに、V3がないでしょう。"
    },
    {
      "indent": 3,
      "text": "A number of the members of the S/MIME Working Group have also worked very hard and contributed to this document. Any list of people is doomed to omission and for that I apologize. In alphabetical order, the following people stand out in my mind due to the fact that they made direct contributions to this document.",
      "ja": "S / MIME作業部会のメンバーの数も非常に懸命に働いたと、この文書に貢献しています。人々の任意のリストは省略する運命にされ、そのために私は謝罪します。アルファベット順に、以下の人々は、それらが本文書に直接貢献をしたという事実のために私の心の中で目立ちます。"
    },
    {
      "indent": 3,
      "text": "Bill Flanigan Trevor Freeman Elliott Ginsburg Paul Hoffman Russ Housley David P. Kemp Michael Myers John Pawling Denis Pinkas Jim Schaad",
      "ja": "ビル・フラニガントレバー・フリーマンエリオット・ギンズバーグポール・ホフマンラスHousleyデビッドP.ケンプブギーマンジョンPawlingデニスピンカスジムSchaad"
    },
    {
      "indent": 0,
      "text": "C. Editor's Address",
      "ja": "C.編集者の住所"
    },
    {
      "indent": 3,
      "text": "Blake Ramsdell Sendmail, Inc. 704 228th Ave NE #775 Sammamish, WA 98074",
      "ja": "ブレイクRamsdellのSendmail社704 228番目アヴェNE＃775サマミッシュ、WA 98074"
    },
    {
      "indent": 3,
      "text": "EMail: blake@sendmail.com",
      "ja": "メールアドレス：blake@sendmail.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（C）インターネット協会（2004）。この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}