{
  "title": {
    "text": "RFC 3043 - The Network Solutions Personal Internet Name (PIN): A URN Namespace for People and Organizations",
    "ja": "RFC 3043 - ネットワークソリューションパーソナルインターネット名（PIN）：人と組織のためのURN名前空間"
  },
  "number": 3043,
  "created_at": "2019-10-22 03:56:55.550452+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        M. Mealling\nRequest for Comments: 3043                       Network Solutions, Inc.\nCategory: Informational                                     January 2001",
      "raw": true
    },
    {
      "indent": 2,
      "text": "The Network Solutions Personal Internet Name (PIN): A URN Namespace for People and Organizations",
      "ja": "ネットワークソリューションパーソナルインターネット名（PIN）：人と組織のためのURN名前空間"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a Uniform Resource Name (URN) namespace that is engineered by Network Solutions, Inc. for naming people and organizations.",
      "ja": "この文書では、人と組織の命名ネットワークソリューション株式会社によって設計された統一リソース名（URN）名前空間について説明します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "In many cases Network Solutions' maintained directory applications require some unique and persistent way to talk about an individual or organization. For example, white pages style services need to determine if one entry is distinct from another even if some of the data happens to be the same. Also, e-commerce authentication mechanisms needs to identify a user and/or company uniquely and possibly over large spans of time. In many cases a customer relationship can last several decades. Such long term customer relationships can outlast any specific email address, Internet service provider, surname, or possibly even the DNS itself.",
      "ja": "多くの場合、ネットワークソリューションは、ディレクトリのアプリケーションは、個人や組織について話をするいくつかのユニークかつ永続的な方法が必要で維持しました。例えば、ホワイトページスタイルのサービスは、エントリが1つのデータの一部が同じであることを起こる場合でも、他と区別されるかどうかを判断する必要があります。また、電子商取引の認証メカニズムは、時間の大スパン上で一意とおそらく、ユーザーおよび/または会社を特定する必要があります。多くの場合、顧客との関係は、数十年を最後にすることができます。このような長期的な顧客との関係は、任意の特定の電子メールアドレス、インターネットサービスプロバイダ、姓、あるいは可能性もDNS自体を長持ちすることができます。"
    },
    {
      "indent": 3,
      "text": "The intent for these applications is that they be used and integrated into other, non-NSI maintained applications in much the same way that domain-names that exist in Network Solution's database are primarily used in application that Network Solutions is _not_ involved in. In much the same way that ISBNs are maintained by specific entities but used in widely varying applications, NSI's PIN namespace is intended to be used in many applications where there is a need for a well maintained identifier that names a person or organization.",
      "ja": "これらのアプリケーションのための意図は、彼らが使用され、他の、非NSIは、ネットワークソリューションのデータベースに存在するドメイン名は、主にネットワークソリューションは_not_に関与しているアプリケーションで使用されていることとほぼ同じ方法でアプリケーションを維持に統合されることである。多くのではISBNコードは、特定のエンティティによって維持さが、広く様々な用途で使用される、NSIのPINの名前空間は、その名の個人または団体も維持識別子の必要がある多くのアプリケーションで使用されることが意図されているのと同じ方法。"
    },
    {
      "indent": 3,
      "text": "A URN namespace is uniquely suited to solve the persistent identification needs of these applications since they are also required to be unique and persistent. The availability of a standardized resolution mechanism makes it possible for other applications to reference and resolve PIN URNs in their own systems in an open, non-proprietary way.",
      "ja": "URN名前空間には、彼らはまた、ユニークかつ永続的であることが要求されているので、これらのアプリケーションの永続的な識別ニーズを解決するために独自に適しています。標準化された解決メカニズムの利用可能性は、それが可能な他のアプリケーションが開いて、非独占的な方法で自分のシステムにPINのURNを参照して解決できるようになります。"
    },
    {
      "indent": 3,
      "text": "This namespace specification is for a formal namespace.",
      "ja": "この名前空間仕様は正式な名前空間のためです。"
    },
    {
      "indent": 0,
      "text": "2. Specification Template",
      "section_title": true,
      "ja": "2.仕様のテンプレート"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "ja": "名前空間ID："
    },
    {
      "indent": 7,
      "text": "\"pin\" requested.",
      "ja": "「ピン」要求されました。"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "ja": "登録情報："
    },
    {
      "indent": 7,
      "text": "Registration Version Number: 1\nRegistration Date: 2000-09-30",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "ja": "名前空間の宣言された登録者："
    },
    {
      "indent": 7,
      "text": "Network Solutions\n505 Huntmar Park Drive\nHerndon, VA 22070",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Declaration of structure:",
      "ja": "構造体の宣言："
    },
    {
      "indent": 7,
      "text": "The structure of the NSS is a flat space of alphanumeric\n  characters which have no knowable structure outside of the\n  context of Network Solutions internal resolver.  Future changes\n  to the assignment methods may allow others to assign\n  sub-spaces of the flat namespace but again, this knowledge is\n  only valid internally and should never be inferred or relied\n  upon externally.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "ja": "関連の補助ドキュメント："
    },
    {
      "indent": 7,
      "text": "None",
      "ja": "無し"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "ja": "識別子一意性の考慮事項："
    },
    {
      "indent": 7,
      "text": "Identifiers are assigned by Network Solutions proprietary\n  registration system in a way that guarantees uniqueness.  At\n  this time the algorithm is to iterate from the last assigned\n  number by some positive integer.  In the future this algorithm\n  may change to incorporate a full range of alphanumeric elements.  In either case, the system will compare the newly\n  created identifier with all of the previous ones to ensure\n  that it has not already been assigned.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "ja": "識別子の永続性の考慮事項："
    },
    {
      "indent": 7,
      "text": "The assignment process guarantees that names are not reassigned\n  and that the binding between the name and the person or\n  organization is permanent, regardless of any personal name\n  changes, corporate restructuring, death or dissolution.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "ja": "識別子割り当てのプロセス。"
    },
    {
      "indent": 7,
      "text": "Names are granted via Network Solutions proprietary registration\n  procedures.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Process of identifier resolution:",
      "ja": "識別子解像度のプロセス。"
    },
    {
      "indent": 7,
      "text": "PIN URNs are resolved via URN resolvers run by Network\n  Solutions.  Since a PIN URN identifies a person or\n  organization, resolving a PIN URN will only be able to return\n  information from an electronic proxy that is merely a\n  representation of the actual person or organization being\n  named.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "ja": "字句等価のルール："
    },
    {
      "indent": 7,
      "text": "The entire URN is case-insensitive.",
      "ja": "全体のURNは、大文字と小文字を区別しません。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "ja": "URN構文に準拠："
    },
    {
      "indent": 7,
      "text": "There are no additional characters reserved.",
      "ja": "予約は追加の文字がありません。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "ja": "検証メカニズム："
    },
    {
      "indent": 7,
      "text": "None additional to resolution specified",
      "ja": "指定した解像度への追加なし"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "ja": "範囲："
    },
    {
      "indent": 7,
      "text": "Global",
      "ja": "グローバル"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "ja": "3.例"
    },
    {
      "indent": 3,
      "text": "The following examples are not guaranteed to be real. They are listed for pedagogical reasons only.",
      "ja": "次の例では、本当のことが保証されていません。彼らは唯一の教育的な理由のために記載されています。"
    },
    {
      "indent": 6,
      "text": "URN:pin:bs4321234 URN:pin:324kj5hkj45 URN:pin:mm2136",
      "ja": "URN：ピン：bs4321234 URN：ピン：324kj5hkj45 URN：ピン：mm2136"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Since the URNs in this namespace are opaque there are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "ja": "この名前空間内のURNが不透明であるので、通常は一般的なのURNの使用と解決に関連づけられたもの以外の追加のセキュリティの考慮事項はありません。"
    },
    {
      "indent": 3,
      "text": "It is noted however that attempting to resolve a PIN URN through a resolver other than the one provided by Network Solution is error prone. In any case it is not considered authoritative.",
      "ja": "ネットワークソリューションが提供するもの以外のリゾルバを通じてPIN URNを解決しようとすると、エラーが発生しやすくなりますしかしことに留意されたいです。いずれのケースでは、権威と見なされていません。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "リファレンス"
    },
    {
      "indent": 3,
      "text": "[1] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "ja": "[1]堀、R.、 \"URN構文\"、RFC 2141、1997年5月を。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Michael Mealling Network Solutions, Inc. 505 Huntmar Park Drive Herndon, VA 22070 US",
      "ja": "マイケル・メオーリングネットワークソリューション株式会社505 Huntmarパークドライブハーンドン、VA 22070米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 770 935 5492 EMail: michaelm@netsol.com URI: http://www.netsol.com",
      "ja": "電話：+1 770 935 5492 Eメール：michaelm@netsol.com URI：http://www.netsol.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}