{
  "title": {
    "text": "RFC 3147 - Generic Routing Encapsulation over CLNS Networks",
    "ja": "RFC 3147 - CLNSネットワーク上の総称ルーティングカプセル化"
  },
  "number": 3147,
  "created_at": "2019-10-24 07:52:29.528452+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       P. Christian\nRequest for Comments: 3147                               Nortel Networks\nCategory: Informational                                        July 2001",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Generic Routing Encapsulation over CLNS Networks",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document proposes a method for transporting an arbitrary protocol over a CLNS (Connectionless Network Service) network using GRE (Generic Routing Encapsulation). This may then be used as a method to tunnel IPv4 or IPv6 over CLNS.",
      "ja": "この文書では、GRE（総称ルーティングカプセル化）を使用してCLNS（コネクションレス型ネットワークサービス）ネットワーク上の任意のプロトコルを輸送するための方法を提案しています。次いで、これをCLNS上のトンネルIPv4またはIPv6の方法として使用されてもよいです。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "RFC 2784 Generic Routing Encapsulation (GRE) [1] provides a standard method for transporting one arbitrary network layer protocol over another arbitrary network layer protocol.",
      "ja": "RFC 2784総称ルーティングカプセル化（GRE）[1]他の任意のネットワーク層プロトコル上で任意の一つのネットワーク層プロトコルを輸送するための標準的な方法を提供します。"
    },
    {
      "indent": 3,
      "text": "RFC 1702 Generic Routing Encapsulation over IPv4 networks [2] provides a standard method for transporting an arbitrary network layer protocol over IPv4 using GRE.",
      "ja": "IPv4ネットワーク上RFC 1702総称ルーティングカプセル化[2] GREを使用して、IPv4の上の任意のネットワーク層プロトコルを輸送するための標準的な方法を提供します。"
    },
    {
      "indent": 3,
      "text": "However no standard method exists for transporting other network layer protocols over CLNS. This causes lack of interoperability between different vendors' products as they provide solutions to migrate from CLNS networks to IP networks. This is a problem specifically in, but not limited to, the context of management networks for SONET and SDH networks elements.",
      "ja": "しかし、標準的な方法は、CLNSを介して他のネットワーク層プロトコルを輸送するために存在しません。彼らはCLNSネットワークからIPネットワークへの移行ソリューションを提供し、これは、異なるベンダーの製品間の相互運用性の欠如の原因となります。これは、具体的に問題であるが、SONETおよびSDHネットワーク要素の管理ネットワークのコンテキストが、これらに限定されません。"
    },
    {
      "indent": 3,
      "text": "Large networks exist for the purpose of providing management communications for SONET and SDH network elements. Standards Bellcore GR-253-CORE [3] and ITU-T G.784 [4] mandate that these networks are based on CLNS.",
      "ja": "大規模ネットワークは、SONETおよびSDHネットワーク要素の管理通信を提供する目的のために存在します。これらのネットワークは、CLNSに基づいていること標準ベルコアGR-253-CORE [3]とITU-T G.784 [4]委任。"
    },
    {
      "indent": 3,
      "text": "Many vendors have already started to offer SONET and SDH products that are managed by IP instead of CLNS and a general migration from CLNS towards IP is anticipated within the industry.",
      "ja": "多くのベンダーがすでにIPは、業界内で予想されている方にIPの代わりに、CLNSとCLNSからの一般的な移行によって管理されているSONETとSDH製品を提供し始めています。"
    },
    {
      "indent": 3,
      "text": "Part of any migration strategy from CLNS to IP should provide for the co-existence of both CLNS managed and IP managed network elements in the same network.",
      "ja": "両方CLNSの共存を管理し、IPは、同じネットワーク内のネットワーク要素を管理するためCLNSからIPへの移行戦略の一部は、提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "Such a migration strategy should foresee the need to manage existing CLNS managed network elements that become isolated by a new IP network. Such a scenario may be tackled by tunnelling CLNP PDUs over IP using the existing GRE standard RFC 2784 [1] and informational RFC 1702 [2]. Networks have already been deployed that use this method.",
      "ja": "このような移行戦略は、既存のCLNSは、新しいIPネットワークによって孤立ネットワーク要素を管理し、管理する必要性を予見すべきです。このようなシナリオでは、既存のGRE標準RFC 2784を使用して、IP上CLNP PDUをトンネリングすることによって取り組むことができる[1]および情報RFC 1702 [2]。ネットワークは既にこの方法を使用すること配備されています。"
    },
    {
      "indent": 3,
      "text": "Such a migration strategy should also foresee the need to manage new IP managed network elements that are installed on the far side of existing CLNS managed network. Such a scenario requires a method for tunnelling IP over CLNS.",
      "ja": "このような移行戦略は、新しいIPは、既存のCLNSの向こう側に設置されているネットワーク要素のネットワークを管理する管理管理する必要性を予見すべきです。このようなシナリオは、CLNSの上にIPをトンネリングするための方法が必要です。"
    },
    {
      "indent": 0,
      "text": "2. GRE over CLNS advantages",
      "section_title": true,
      "ja": "CLNSの利点を超える2. GRE"
    },
    {
      "indent": 3,
      "text": "Using GRE to tunnel IP over CLNS offers some advantages.",
      "ja": "CLNSの上にトンネルIPにGREを使用すると、いくつかの利点を提供しています。"
    },
    {
      "indent": 6,
      "text": "In the absence of a standard for tunnelling IP over CLNS, GRE as specified in RFC 2784 [1] is the most applicable standard that exists.",
      "ja": "RFC 2784で指定されるようにCLNSオーバーIPトンネリングのための標準、GREの非存在下での[1]に存在するほとんどの適用規格です。"
    },
    {
      "indent": 6,
      "text": "The move from CLNS to IP comes at a time when IP is itself migrating from IPv4 to IPv6. GRE defines a method to tunnel any protocol that has an Ethernet Protocol Type. Therefore by defining a method for CLNS to transport GRE, a method will then exist for CLNS to transport any other protocol that has an Ethernet Protocol Type defined in RFC 1700 [5]. Thus GRE over CLNS can be used to tunnel both IPv4 and IPv6.",
      "ja": "IPへのCLNSからの移動は、IPはIPv4からIPv6への移行自体である時に付属しています。 GREトンネルイーサネットプロトコルタイプを有する任意のプロトコルをメソッドを定義します。 CLNSは、RFC 1700で定義されたイーサネットプロトコルタイプを有する任意の他のプロトコルを輸送するためしたがってCLNSはGREを輸送するための方法を定義することによって、この方法は、次に存在する[5]。したがってCLNS上GREトンネルは、IPv4とIPv6の両方に使用することができます。"
    },
    {
      "indent": 6,
      "text": "GRE is already commonly used to tunnel CLNP PDUs over IP and so using GRE to tunnel IP over CLNS gives a common approach to tunnelling and may simplify software within network elements that initiate and terminate tunnels.",
      "ja": "GREは、既に一般的にIPトンネル上CLNPのPDUに用いられるので、CLNS上にトンネルIPにGREを使用してトンネリングすると開始し、トンネルを終端するネットワーク要素内のソフトウェアを単純化することができる一般的なアプローチを与えます。"
    },
    {
      "indent": 3,
      "text": "The only disadvantage of using GRE is the extra minimum of four bytes that will be used between CLNP header and IP payload packet. Given the large size of CLNP headers this will not make a significant difference to the performance of any network that has IP over CLNP PDUs present on it.",
      "ja": "GREを使用することの唯一の欠点は、CLNPヘッダとIPペイロードパケットの間に使用される4バイトの余分な最小です。 CLNPヘッダの大サイズを考えると、これはその上にCLNP PDUを超えるIPが存在している任意のネットワークのパフォーマンスに大きな違いをすることはありません。"
    },
    {
      "indent": 0,
      "text": "3. Transporting GRE packets over CLNS.",
      "section_title": true,
      "ja": "3. CLNSの上にGREパケットを転送すること。"
    },
    {
      "indent": 3,
      "text": "It is suggested that GRE should be transported over CLNS at the lowest layer possible, which is as a transport layer protocol over the network layer. This can be achieved by placing the entire GRE packet inside a CLNP Data Type PDU (DT PDU) as data payload.",
      "ja": "GREは、ネットワーク層上のトランスポート層プロトコルとしてである可能最下位層、でCLNSを介して転送されるべきであることが示唆されます。これは、データペイロードとしてCLNPデータタイプPDU（DT PDU）の内部全体GREパケットを配置することによって達成することができます。"
    },
    {
      "indent": 3,
      "text": "The GRE packet is a GRE packet as defined in RFC 2784 [1], in other words GRE header plus payload packet.",
      "ja": "GREパケットは、RFC 2784 [1]、言い換えればGREヘッダーとペイロードパケットに定義されているGREパケットです。"
    },
    {
      "indent": 3,
      "text": "Data payload is the part of a Data PDU that is described as \"Data\" in the structure of a Data PDU in ISO/IEC 8473-1 [6].",
      "ja": "データペイロードは、ISO / IEC 8473から1にデータPDUの構造の「データ」と記載されているデータPDUの一部である[6]。"
    },
    {
      "indent": 3,
      "text": "For convenience the structure of a Data PDU is reproduced from ISO/IEC 8473-1 [6] below:",
      "ja": "便宜のためにデータPDUの構造は、ISO / IEC 8473から1から再生されている[6]下記"
    },
    {
      "indent": 12,
      "text": "                                          Octet\n----------------------------------------\n|  Network Layer Protocol Identifier   |    1\n----------------------------------------\n|           Length Indicator           |    2\n----------------------------------------\n|    Version/Protocol Id Extension     |    3\n----------------------------------------\n|              Lifetime                |    4\n----------------------------------------\n| SP | MS | E/R |   Type               |    5\n----------------------------------------\n|            Segment Length            |   6,7\n----------------------------------------\n|               Checksum               |   8,9\n----------------------------------------\n| Destination Address Length Indicator |   10\n----------------------------------------\n|                                      |   11\n|         Destination Address          |\n|                                      |   m-1\n----------------------------------------\n|   Source Address Length Indicator    |    m\n----------------------------------------\n|                                      |   m+1\n|            Source Address            |\n|                                      |   n-1\n----------------------------------------\n|         Data Unit Identifier         |  n,n+1\n----------------------------------------\n|            Segment Offset            | n+2,n+3\n----------------------------------------\n|             Total Length             | n+4,n+5\n----------------------------------------\n|                                      |   n+6\n|               Options                |\n|                                      |    p\n----------------------------------------\n|                                      |   p+1\n|          Data ( GRE packet )         |\n|                                      |    z\n----------------------------------------",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4. NSAP selector (N-SEL) value.",
      "section_title": true,
      "ja": "4. NSAPセレクター（N-SEL）値。"
    },
    {
      "indent": 3,
      "text": "Transport of GRE packets is a new type of Network Service (NS) user. Different Network Service users are identified by using different NSAP selector bytes also known as N-SEL bytes.",
      "ja": "GREパケットの輸送は、ネットワークサービス（NS）ユーザーの新しいタイプです。異なるネットワークサービスのユーザはまた、N-SELバイトとして知られる異なるNSAPセレクタバイトを使用して同定されます。"
    },
    {
      "indent": 3,
      "text": "This is a similar concept to the use of the IP Protocol Type used in IP packets.",
      "ja": "これは、IPパケットで使用されるIPプロトコルタイプの使用と同様の概念です。"
    },
    {
      "indent": 3,
      "text": "Whilst it is not strictly necessary for all vendors to use the same N-SEL values, they must use the same N-SEL value for it to be possible for one vendor's CLNS device or network element to initiate a GRE tunnel which is then terminated on a different vendor's CLNS device.",
      "ja": "すべてのベンダーが同じN-SEL値を使用することは厳密には必要ではない一方であるベンダーのCLNSデバイスまたはネットワーク要素がその後に終了するGREトンネルを開始することが可能であるために、それらは同一のN-SELの値を使用しなければなりません異なるベンダーのCLNSデバイス。"
    },
    {
      "indent": 3,
      "text": "Although N-SEL values (other than zero) are not defined in CLNS/CLNP standards, some are defined when CLNS is used in SONET networks by Bellcore GR-253-CORE [3] whilst others are in common use.",
      "ja": "（ゼロ以外）N-SEL値はCLNS / CLNP規格で定義されていないがCLNSがベルコアGR-253-COREによりSONETネットワークで使用される場合、いくつかは定義されている[3]人ながら一般的に使用されています。"
    },
    {
      "indent": 3,
      "text": "As the IP protocol number for GRE is 47, as defined in RFC 1702 [2], and as 47 is not commonly used as an N-SEL value, it is suggested that 47 (decimal) should be used as an N-SEL value to indicate to the CLNS stack that the Data portion of the Data Type PDU contains a GRE packet.",
      "ja": "RFC 1702で定義されているGREのためのIPプロトコル番号は、47である[2]、及び47は、一般的にN-SELの値として使用されないように、それが47（小数）はN-SELの値として使用されるべきであることが示唆されていますCLNSは、データ型PDUのデータ部分がGREパケットが含まれていることをスタックに指示します。"
    },
    {
      "indent": 3,
      "text": "The N-SEL byte should be set to 47 (decimal) in both the source address and the destination address of the CLNP PDU.",
      "ja": "N-SELバイトはソースアドレスとCLNP PDUの宛先アドレスの両方に47（10進数）に設定されるべきです。"
    },
    {
      "indent": 3,
      "text": "The N-SEL value of 47 should indicate only that the payload is GRE, and the device or network element that transmits the PDU should use the GRE header to indicate what protocol (for example IPv4 or IPv6) is encapsulated within the GRE packet in conformance with RFC 2784 [1]. Similarly the device or network element that receives the PDU should then inspect the GRE header to ascertain what protocol is contained within the GRE packet in conformance with RFC 2784 [1].",
      "ja": "適合にGREパケット内にカプセル化された47のN-SEL値は、ペイロードがGREであることのみを示すべきであり、GREヘッダーを使用する必要がPDUを送信するデバイスまたはネットワーク要素がどのプロトコル（例えばIPv4またはIPv6の場合）を示すためにRFC 2784を有する[1]。同様にPDUを受信したデバイスまたはネットワーク要素は、次に、RFC 2784に準拠してGREパケット内に含まれるものプロトコル確認するGREヘッダーを検査すべきである[1]。"
    },
    {
      "indent": 0,
      "text": "5. Segmentation Permitted (SP) value.",
      "section_title": true,
      "ja": "5.分割許可（SP）値。"
    },
    {
      "indent": 3,
      "text": "It is recommended that the SP flag in all CLNP PDUs containing GRE packets should be set.",
      "ja": "GREパケットを含むすべてのCLNP PDUの中にSPフラグが設定されなければならないことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "If the SP flag is not set, and a CLNP PDU is too large for a particular link, then a CLNS device or network element will drop the PDU. The originator of the packet that is inside the GRE packet will not have visibility of the packet loss or the reason for the packet loss, and a black hole may form.",
      "ja": "SPフラグがセットされ、CLNP PDUは、特定のリンクのためには大きすぎるされていない場合は、CLNSデバイスまたはネットワーク要素がPDUをドロップします。 GREパケット内にあるパケットの発信元はパケットロスやパケット損失の理由の視認性を持っていないであろう、そしてブラックホールが形成していてもよいです。"
    },
    {
      "indent": 0,
      "text": "6. Interaction with Path MTU Discovery (PMTU), [].",
      "section_title": true,
      "ja": "パスMTUディスカバリ（PMTU）6.相互作用、[]。"
    },
    {
      "indent": 3,
      "text": "A tunnel entry point for a GRE tunnel should treat IP packets that are bigger than the MTU size of the GRE tunnel as per RFC 1191 [7]. If the oversize IP packet that is about to enter the GRE tunnel does not have its Don't Fragment (DF) bit set then it should be fragmented before entering the tunnel.",
      "ja": "GREトンネルのトンネルエントリポイントは、[7] RFC 1191あたりとしてGREトンネルのMTUサイズよりも大きくされているIPパケットを扱うべきです。 GREトンネルに入ろうとして特大のIPパケットが持っていない場合、そのないフラグメント（DF）が設定され、それがトンネルに入る前に断片化されなければならないビット。"
    },
    {
      "indent": 3,
      "text": "If the oversize IP packet that is about to enter the GRE tunnel has its DF bit set then the packet should be discarded, and an ICMP unreachable error message (in particular the \"fragmentation needed and DF set\" code) should be sent back to the originator of the packet as described in RFC 1191 [7].",
      "ja": "GREトンネルを入力しようとしている特大のIPパケットは、そのDFビットた設定した場合、パケットは廃棄されるべきであり、ICMP到達不能エラーメッセージ（特に、「必要な断片化とDFセット」コード）が背面に送られるべきですRFC 1191に記載されているように、パケットの発信元は、[7]。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "CLNS and GRE do not provide any security when employed in the way recommended in this document.",
      "ja": "このドキュメントで推奨される方法で使用した場合CLNSとGREは、どのようなセキュリティを提供していません。"
    },
    {
      "indent": 3,
      "text": "If security is required, then it must be provided by other methods and applied to the payload protocol before it is transported by GRE over CLNS.",
      "ja": "セキュリティが必要な場合、それは他の方法によって提供されなければならず、それはCLNS上GREによって輸送される前に、ペイロードのプロトコルに適用されます。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 3,
      "text": "[1] Farinacci, D., Li, T., Hanks, S., Meyer, D. and P. Traina, \"Generic Routing Encapsulation (GRE)\", RFC 2784, March 2000.",
      "ja": "[1]ファリナッチ、D.、李、T.、ハンクス、S.、マイヤー、D.とP. Trainaの、 \"総称ルーティングカプセル化（GRE）\"、RFC 2784、2000年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Hanks, S., Li, T., Farinacci, D. and P. Traina, \"Generic Routing Encapsulation over IPv4\", RFC 1702, October 1994.",
      "ja": "[2]ハンクス、S.、李、T.、ファリナッチ、D.とP. Trainaの、 \"IPv4の上総称ルーティングカプセル化\"、RFC 1702、1994年10月。"
    },
    {
      "indent": 3,
      "text": "[3] Bellcore Publication GR-253-Core \"Synchronous Optical Network (SONET) Transport Systems: Common Generic Criteria\", January 1999",
      "ja": "[3]のBellcore公報GR-253-CORE \"同期光ネットワーク（SONET）交通システム：よくある包括的な基準\"、1999年1月"
    },
    {
      "indent": 3,
      "text": "[4] ITU-T Recommendation G.784 \"Synchronous Digital Hierarchy (SDH) management\", June 1999",
      "ja": "[4] ITU-T勧告G.784 \"同期デジタル階層（SDH）管理\"、1999年6月"
    },
    {
      "indent": 3,
      "text": "[5] Reynolds, J. and J. Postel, \"Assigned Numbers\", STD 2, RFC 1700, October 1994.",
      "ja": "[5]レイノルズ、J.およびJ.ポステル、 \"割り当て番号\"、STD 2、RFC 1700、1994年10月。"
    },
    {
      "indent": 3,
      "text": "[6] \"Information technology - Protocol for providing the connectionless-mode network service\", ISO/IEC 8473-1, 1994",
      "ja": "[6]「情報技術 - 接続モード・ネットワーク・サービス提供のための議定書」、ISO / IEC 8473から1を、1994"
    },
    {
      "indent": 3,
      "text": "[7] Mogul, J. and S. Deering, \"Path MTU Discovery\", RFC 1191, November 1990.",
      "ja": "[7]モーグル、J.およびS.デアリング、 \"パスMTUディスカバリ\"、RFC 1191、1990年11月。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "Chris Murton, Paul Fee, Mike Tate for their contribution in writing this document.",
      "ja": "クリスMurton、ポール・手数料、この文書を書くことに貢献のためのマイク・テイト。"
    },
    {
      "indent": 0,
      "text": "10. Author's Address",
      "section_title": true,
      "ja": "10.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Philip Christian Nortel Networks Harlow Laboratories London Road, Harlow, Essex, CM17 9NA UK",
      "ja": "フィリップ・クリスチャンNortel Networksのハーロウ研究所ロンドンの道、ハーロウ、エセックス、CM17 9NA英国"
    },
    {
      "indent": 3,
      "text": "EMail: christi@nortelnetworks.com",
      "ja": "メールアドレス：christi@nortelnetworks.com"
    },
    {
      "indent": 0,
      "text": "11. Full Copyright Statement",
      "section_title": true,
      "ja": "11.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}