{
  "title": {
    "text": "RFC 3101 - The OSPF Not-So-Stubby Area (NSSA) Option",
    "ja": "RFC 3101 - OSPF Not-Stubbyエリア（NSSA）オプション"
  },
  "number": 3101,
  "created_at": "2023-12-20 05:17:23.232833+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          P. Murphy\nRequest for Comments: 3101                          US Geological Survey\nObsoletes: 1587                                             January 2003\nCategory: Standards Track",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "The OSPF Not-So-Stubby Area (NSSA) Option",
      "ja": "OSPF Not-Stubbyエリア（NSSA）オプション"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo documents an optional type of Open Shortest Path First (OSPF) area that is somewhat humorously referred to as a \"not-so-stubby\" area (or NSSA). NSSAs are similar to the existing OSPF stub area configuration option but have the additional capability of importing AS external routes in a limited fashion.",
      "ja": "このメモは、オプションのタイプのオープン最短パスファースト（OSPF）領域を文書化します。これらの領域は、「それほどスタッバーではない」領域（またはNSSA）といくらかユーモラスに呼ばれます。NSSAは、既存のOSPFスタブエリア構成オプションに似ていますが、限られた方法で外部ルートとしてインポートする追加機能があります。"
    },
    {
      "indent": 3,
      "text": "The OSPF NSSA Option was originally defined in RFC 1587. The functional differences between this memo and RFC 1587 are explained in Appendix F. All differences, while expanding capability, are backward-compatible in nature. Implementations of this memo and of RFC 1587 will interoperate.",
      "ja": "OSPF NSSAオプションは、もともとRFC 1587で定義されていました。このメモとRFC 1587の機能的な違いは、付録Fで説明しています。このメモとRFC 1587の実装は相互運用します。"
    },
    {
      "indent": 0,
      "text": "Table Of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.0 Overview .................................................  2\n   1.1 Motivation - Transit Networks .........................  2\n   1.2 Motivation - Corporate Networks .......................  4\n   1.3 Proposed Solution .....................................  5\n2.0 NSSA Intra-Area Implementation Details ...................  7\n   2.1 The N-bit .............................................  7\n   2.2 Type-7 Address Ranges .................................  7\n   2.3 Type-7 LSAs ...........................................  8\n   2.4 Originating Type-7 LSAs ...............................  9\n   2.5 Calculating Type-7 AS External Routes ................. 10\n   2.6 Incremental Updates ................................... 14\n   2.7 Optionally Importing Summary Routes ................... 14\n3.0 Intra-AS Implementation Details .......................... 15\n   3.1 Type-7 Translator Election ............................ 15\n   3.2 Translating Type-7 LSAs into Type-5 LSAs .............. 16\n   3.3 Flushing Translated Type-7 LSAs ....................... 19\n4.0 Security Considerations .................................. 20\n5.0 Acknowledgements ......................................... 21\n6.0 Contributors ............................................. 22\n7.0 References ............................................... 22\nAppendix A: The Options Field ................................ 23\nAppendix B: Router-LSAs ...................................... 24\nAppendix C: Type-7 LSA Packet Format ......................... 26\nAppendix D: Configuration Parameters ......................... 27\nAppendix E: The P-bit Policy Paradox ......................... 28\nAppendix F: Differences from RFC 1587 ........................ 30\nAuthor's Addresses ........................................... 32\nFull Copyright Statement ..................................... 33",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1.0 Overview",
      "section_title": true,
      "ja": "1.0 概要"
    },
    {
      "indent": 0,
      "text": "1.1 Motivation - Transit Networks",
      "section_title": true,
      "ja": "1.1 モチベーション - トランジットネットワーク"
    },
    {
      "indent": 3,
      "text": "Wide-area transit networks often have connections to moderately complex \"leaf\" sites. A leaf site may have multiple IP network numbers assigned to it. Typically, one of the leaf site's networks is directly connected to a router provided and administered by the transit network while the others are distributed throughout and administered by the site. From the transit network's perspective, all of the network numbers associated with the site make up a single \"stub\" entity. For example, BBN Planet has one site composed of a class-B network, 130.57.0.0, and a class-C network, 192.31.114.0. From BBN Planet's perspective, this configuration looks something like the diagram on the next page, where the \"cloud\" consists of the subnets of 130.57 and network 192.31.114, all of which are learned by RIP on router BR18.",
      "ja": "幅広いエリアトランジットネットワークは、中程度に複雑な「葉」サイトに接続されていることがよくあります。リーフサイトには、複数のIPネットワーク番号が割り当てられている場合があります。通常、リーフサイトのネットワークの1つは、トランジットネットワークが提供および管理するルーターに直接接続され、他のネットワークはサイト全体に配布され、サイトで管理されます。Transit Networkの観点から見ると、サイトに関連付けられているネットワーク番号はすべて、単一の「スタブ」エンティティを構成しています。たとえば、BBN Planetには、クラスBネットワーク130.57.0.0とクラスCネットワーク、192.31.114.0で構成される1つのサイトがあります。BBN Planetの観点から見ると、この構成は次のページの図のように見えます。「クラウド」は130.57とネットワーク192.31.114のサブネットで構成されており、それらはすべてRuter BR18でRIPによって学習されます。"
    },
    {
      "indent": 16,
      "text": "  192.31.114\n      |\n    (cloud)\n-------------- 130.57.4\n      |\n      |\n   ------ 131.119.13 ------\n   |BR18|------------|BR10|\n   ------            ------\n                        |\n                        V\n                to BBN Planet \"core\" OSPF system",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Topologically, this cloud looks very much like an OSPF stub area. The advantages of running the cloud as an OSPF stub area are:",
      "ja": "トポロジーには、このクラウドはOSPFスタブエリアに非常に似ています。OSPFスタブエリアとしてクラウドを実行することの利点は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "1. External routes learned from OSPF's Type-5 AS-external-LSAs are not advertised beyond the router labeled \"BR10\". This is advantageous because the link between BR10 and BR18 may be a low-speed link or the router BR18 may have limited resources.",
      "ja": "1. OSPFのType-5 As-fernal-LSAから学んだ外部ルートは、「BR10」とラベル付けされたルーターを超えて宣伝されていません。これは、BR10とBR18の間のリンクが低速リンクであるか、ルーターBR18のリソースが限られている可能性があるため、これは有利です。"
    },
    {
      "indent": 6,
      "text": "2. The transit network is abstracted to the \"leaf\" router BR18 by advertising only a default route across the link between BR10 and BR18.",
      "ja": "2. Transit Networkは、BR10とBR18の間のリンクを横切るデフォルトルートのみを広告することにより、「リーフ」ルーターBR18に抽出されます。"
    },
    {
      "indent": 6,
      "text": "3. The cloud becomes a single, manageable \"leaf\" with respect to the transit network.",
      "ja": "3. クラウドは、トランジットネットワークに対して単一の管理可能な「葉」になります。"
    },
    {
      "indent": 6,
      "text": "4. The cloud can become, logically, a part of the transit network's OSPF routing system.",
      "ja": "4. クラウドは、論理的にトランジットネットワークのOSPFルーティングシステムの一部になります。"
    },
    {
      "indent": 3,
      "text": "However, the original definition of the OSPF protocol (See [OSPF]) imposes topological limitations that restrict simple cloud topologies from becoming OSPF stub areas. In particular, it is illegal for a stub area to import routes external to OSPF; thus it is not possible for routers BR18 and BR10 to both be members of the stub area and to import into OSPF as Type-5 AS-external-LSAs routes learned from RIP or other IP routing protocols. In order to run OSPF out to BR18, BR18 must be a member of a non-stub area or the OSPF backbone before it can import routes other than its directly connected network(s). Since it is not acceptable for BR18 to maintain all of BBN Planet's Type-5 AS external routes, BBN Planet is forced by OSPF's topological limitations to only run OSPF out to BR10 and to run RIP between BR18 and BR10.",
      "ja": "ただし、OSPFプロトコルの元の定義（[OSPF]を参照）は、単純なクラウドトポロジーをOSPFスタブエリアに制限するトポロジーの制限を課しています。特に、スタブエリアがOSPFの外部にルートを輸入することは違法です。したがって、ルーターBR18とBR10は、RIPまたはその他のIPルーティングプロトコルから学習したタイプ5 ASExternal-LSASルートとして、スタブエリアのメンバーになり、OSPFにインポートすることはできません。OSPFをBR18に実行するには、BR18は、直接接続されたネットワーク以外のルートをインポートする前に、非スタブエリアまたはOSPFバックボーンのメンバーでなければなりません。BBN惑星のすべてのタイプ5を外部ルートとして維持することはBR18が受け入れられないため、BBN惑星はOSPFのトポロジカルな制限によって強制され、OSPFがBR10に走行し、BR18とBR10の間でRIPを実行することが強制されます。"
    },
    {
      "indent": 0,
      "text": "1.2 Motivation - Corporate Networks",
      "section_title": true,
      "ja": "1.2 モチベーション - 企業ネットワーク"
    },
    {
      "indent": 3,
      "text": "In a corporate network that supports a large corporate infrastructure it is not uncommon for its OSPF domain to have a complex non-zero area infrastructure that injects large routing tables into its Area 0 backbone. Organizations within the corporate infrastructure may routinely multi-home their non-zero OSPF areas to strategically located Area 0 backbone routers, either to provide backbone redundancy or to increase backbone connectivity or both. Because of these large routing tables, OSPF aggregation via summarization is routinely used and recommended. Stub areas are also recommended to keep the size of the routing tables of non-backbone routers small. Organizations within the corporation are administratively autonomous and compete for corporate backbone resources. They also want isolation from each other in order to protect their own network resources within the organization.",
      "ja": "大規模な企業インフラストラクチャをサポートするコーポレートネットワークでは、OSPFドメインが領域0バックボーンに大きなルーティングテーブルを注入する複雑な非ゼロエリアインフラストラクチャを持つことは珍しくありません。企業インフラストラクチャ内の組織は、バックボーンの冗長性を提供するか、バックボーンの接続性またはその両方を増やすために、非ゼロOSPFエリアを戦略的に配置されたエリア0バックボーンルーターに日常的にマルチホームすることができます。これらの大きなルーティングテーブルのため、要約によるOSPF集計が日常的に使用され、推奨されます。また、ノンバックボーンルーターのルーティングテーブルのサイズを小さく保つために、スタブエリアもお勧めします。企業内の組織は管理上自律的であり、企業のバックボーンリソースを競います。彼らはまた、組織内の独自のネットワークリソースを保護するために、互いに隔離を望んでいます。"
    },
    {
      "indent": 3,
      "text": "Consider the typical example configuration shown below where routers A1, B1 and A2, B2 are connected to Area 1 and Area 2 respectively, and where routers A0 and B0 are Area 0 border routers that connect to both Area 1 and Area 2. Assume the 192.168.192/20 and 192.168.208/22 clouds are subnetted with a protocol different from the corporate OSPF instance. These other protocols could be RIP, IGRP, or second and third OSPF instances separate from the corporate OSPF backbone instance.",
      "ja": "ルーターA1、B1、A2、B2がそれぞれエリア1とエリア2に接続されている場合、ルーターA0とB0がエリア1とエリア2の両方に接続するエリア0ボーダールーターである場合、以下に示す典型的な例構成を考えてみましょう。192.168を想定します.192/20および192.168.208/22クラウドは、コーポレートOSPFインスタンスとは異なるプロトコルでサブネットされています。これらの他のプロトコルは、RIP、IGRP、または2番目と3番目のOSPFインスタンスとは、企業のOSPFバックボーンインスタンスとは別の場合があります。"
    },
    {
      "indent": 3,
      "text": "Area 1 and Area 2 would like to be stub areas to minimize the size of their link state databases. It is also desirable to originate two aggregated external advertisements for the subnets of 192.168.192/20 and 192.168.208/22 in such a way that the preferred path to 192.168.192/20 is through A0 and the preferred path to 192.168.208/22 is through B0.",
      "ja": "エリア1とエリア2は、リンク状態データベースのサイズを最小限に抑えるためのスタブエリアにしたいと考えています。192.168.192/20および192.168.208/22のサブネットの2つの集約された外部広告を発信することも望ましいです。/22はB0を介しています。"
    },
    {
      "indent": 13,
      "text": "     +---A0------Area 0 cloud------B0---+\n     |   |                          |   |\n     |   |                          |   |\n     |   |T1                   56kbs|   |\n56kbs|   |                          |   |T1\n     |   |                          |   |\n     |   |       Area 1 cloud       |   |\n     |   A1-----192.168.192/20-----B1   |\n     |                                  |\n     +---A2                        B2---+\n          |                         |\n          |      Area 2 cloud       |\n          +-----192.168.208/22------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The current standard OSPF stub area has no mechanism to support the redistribution of routes for the subnets of 192.168.192/20 and 192.168.208/22 within a stub area or the ability to aggregate a range of external routes in any OSPF area. Any solution to this dilemma must also honor Area 1's path of choice to 192.168.192/20 through A0 with redundancy through B0 while at the same time honoring Area 2's path of choice to 192.168.208/20 through B0 with redundancy through A0.",
      "ja": "現在の標準のOSPFスタブエリアには、192.168.192/20および192.168.208/22のサブネットのルートの再分配をサポートするメカニズムはありません。また、このジレンマの解決策は、エリア1の選択のパスを192.168.192/20からA0からB0を介して称賛する必要があります。"
    },
    {
      "indent": 0,
      "text": "1.3 Proposed Solution",
      "section_title": true,
      "ja": "1.3 提案されたソリューション"
    },
    {
      "indent": 3,
      "text": "This document describes a new optional type of OSPF area, somewhat humorously referred to as a \"not-so-stubby\" area (or NSSA), which has the capability of importing external routes in a limited fashion.",
      "ja": "このドキュメントでは、新しいオプションのタイプのOSPF領域について説明します。これは、「それほど魅力的ではない」エリア（またはNSSA）と呼ばれるややユーモラスに、限られた方法で外部ルートをインポートする機能を備えています。"
    },
    {
      "indent": 3,
      "text": "The OSPF specification defines two general classes of area configuration. The first allows Type-5 LSAs to be flooded throughout the area. In this configuration, Type-5 LSAs may be originated by routers internal to the area or flooded into the area by area border routers. These areas, referred to herein as Type-5 capable areas (or just plain areas in the OSPF specification), are distinguished by the fact that they can carry transit traffic. The backbone is always a Type-5 capable area. The second type of area configuration, called stub, does not allow Type-5 LSAs to be propagated into/throughout the area and instead depends on default routing to external destinations.",
      "ja": "OSPF仕様は、エリア構成の2つの一般的なクラスを定義します。最初は、タイプ5 LSAをエリア全体に浸水させることができます。この構成では、タイプ5 LSAは、エリアの内部のルーターによって発信されるか、面積ボーダールーターによってエリアにあふれています。ここでは、タイプ5の有能な領域（またはOSPF仕様の単なる領域）と呼ばれるこれらの領域は、輸送トラフィックを運ぶことができるという事実によって区別されます。バックボーンは常にタイプ5の能力領域です。Stubと呼ばれる2番目のタイプのエリア構成では、タイプ5 LSAをエリア全体に/全体に伝播することを許可しておらず、代わりに外部宛先へのデフォルトルーティングに依存します。"
    },
    {
      "indent": 3,
      "text": "NSSAs are defined in much the same manner as existing stub areas. To support NSSAs, a new option bit (the \"N\" bit) and a new type of LSA (Type-7) are defined. The \"N\" bit ensures that routers belonging to an NSSA agree on its configuration. Similar to the stub area's use of the \"E\" bit, both NSSA neighbors must agree on the setting of the \"N\" bit or the OSPF neighbor adjacency will not form.",
      "ja": "NSSAは、既存のスタブエリアとほぼ同じ方法で定義されています。NSSAをサポートするには、新しいオプションビット（「n」ビット）と新しいタイプのLSA（タイプ7）が定義されています。「n」ビットは、NSSAに属するルーターがその構成に同意することを保証します。スタブエリアの「E」ビットの使用と同様に、両方のNSSAの隣人は「n」ビットの設定またはOSPFの隣接隣接が形成されないことに同意する必要があります。"
    },
    {
      "indent": 3,
      "text": "Type-7 LSAs provide for carrying external route information within an NSSA. Type-7 LSAs have virtually the same syntax as Type-5 LSAs with the obvious exception of the link-state type. (See section 2.3 for more details.) Both LSAs are considered a type of OSPF AS-external-LSA. There are two major semantic differences between Type-5 LSAs and Type-7 LSAs.",
      "ja": "タイプ7 LSAは、NSSA内で外部ルート情報を運ぶことを規定しています。タイプ7 LSAは、リンク状態タイプを明らかに例外とすると、タイプ5 LSAとほぼ同じ構文を持っています。（詳細については、セクション2.3を参照してください。）両方のLSAは、External-LSAとしてのOSPFの一種と見なされます。タイプ5 LSAとタイプ7 LSAの間には、2つの主要なセマンティックな違いがあります。"
    },
    {
      "indent": 6,
      "text": "o Type-7 LSAs may be originated by and advertised throughout an NSSA; as with stub areas, Type-5 LSAs are not flooded into NSSAs and do not originate there.",
      "ja": "o タイプ7 LSAは、NSSAによって発信され、宣伝される場合があります。スタブエリアと同様に、タイプ5 LSAはNSSAにあふれておらず、そこに発生しません。"
    },
    {
      "indent": 6,
      "text": "o Type-7 LSAs are advertised only within a single NSSA; they are not flooded into the backbone area or any other area by border routers, though the information that they contain may be propagated into the backbone area. (See Section 3.2.)",
      "ja": "o タイプ7 LSAは、単一のNSSA内でのみ宣伝されています。それらに含まれる情報は、バックボーン領域に伝播される可能性がありますが、それらはバックボーンエリアまたは他のエリアに境界ルーターによってあふれているわけではありません。（セクション3.2を参照してください。）"
    },
    {
      "indent": 3,
      "text": "In order to allow limited exchange of external information across an NSSA border, NSSA border routers will translate selected Type-7 LSAs received from the NSSA into Type-5 LSAs. These Type-5 LSAs will be flooded to all Type-5 capable areas. NSSA border routers may be configured with address ranges so that multiple Type-7 LSAs may be aggregated into a single Type-5 LSA. The NSSA border routers that perform translation are configurable. In the absence of a configured translator one is elected.",
      "ja": "NSSAボーダー全体で外部情報の限られた交換を許可するために、NSSAボーダールーターは、NSSAから受け取った選択したタイプ7 LSAをタイプ5 LSAに翻訳します。これらのタイプ5 LSAは、すべてのタイプ5能力エリアに浸水します。NSSAボーダールーターは、アドレス範囲で構成されているため、複数のタイプ7 LSAが単一のタイプ5 LSAに集約される可能性があります。翻訳を実行するNSSAボーダールーターは構成可能です。構成された翻訳者がない場合、1つが選出されます。"
    },
    {
      "indent": 3,
      "text": "In addition, an NSSA border router should originate a default LSA (IP network is 0.0.0.0/0) into the NSSA. Default routes are necessary because NSSAs do not receive full routing information and must have a default route in order to route to AS-external destinations. Like stub areas, NSSAs may be connected to the Area 0 backbone at more than one NSSA border router, but may not be used as a transit area. Note that a Type-7 default LSA originated by an NSSA border router is never translated into a Type-5 LSA, however, a Type-7 default LSA originated by an NSSA internal AS boundary router (one that is not an NSSA border router) may be translated into a Type-5 LSA.",
      "ja": "さらに、NSSAボーダールーターは、デフォルトのLSA（IPネットワークは0.0.0.0/0）をNSSAに発信する必要があります。NSSAは完全なルーティング情報を受け取らないため、デフォルトのルートが必要であり、エクステルタナルの目的地にルーティングするためにデフォルトルートを持つ必要があるためです。スタブエリアと同様に、NSSAは複数のNSSAボーダールーターでエリア0バックボーンに接続できますが、輸送エリアとして使用できません。NSSAボーダールーターから発信されたタイプ7デフォルトLSAは、タイプ5 LSAに翻訳されることはありませんが、境界ルーターとしてNSSA内部のNSSAが発信するタイプ7デフォルトLSA（NSSAボーダールーターではないもの）に注意してください。タイプ5 LSAに翻訳される場合があります。"
    },
    {
      "indent": 3,
      "text": "Like stub areas, NSSA border routers optionally import summary routes into their NSSAs as Type-3 summary-LSAs. If the import is disabled, particular care should be taken to ensure that summary routing is not obscured by an NSSA's Type-7 AS-external-LSAs. This may happen when the AS's other IGPs, like RIP and ISIS, leak routing information into the NSSA. In these cases all summary routes should be imported into the NSSA. The recommended default behavior is to import summary routes into NSSAs. Since Type-5 AS-external-LSAs are not flooded into NSSAs, NSSA border routers should not originate Type-4 summary-LSAs into their NSSAs. Also an NSSA's border routers never originate Type-4 summary-LSAs for the NSSA's AS boundary routers, since Type-7 AS-external-LSAs are never flooded beyond the NSSA's border.",
      "ja": "スタブエリアと同様に、NSSAボーダールーターはオプションで、タイプ3サマリLSAとしてNSSAにサマリールートをインポートします。輸入が無効になっている場合、NSSAのタイプ7 As-External-LSAによって概要ルーティングが不明瞭にならないように、特定の注意を払う必要があります。これは、RIPやISISなどのASの他のIGPがNSSAにルーティング情報をリークする場合に発生する可能性があります。これらの場合、すべての概要ルートはNSSAにインポートする必要があります。推奨されるデフォルトの動作は、概要ルートをNSSAにインポートすることです。タイプ5のas-entsternal-LSAはNSSAにあふれていないため、NSSAボーダールーターはNSSAにタイプ4の要約LSAを発生させるべきではありません。また、NSSAのボーダールーターは、NSSAとしてのNSSAとしてのタイプ4サマリLSAを境界ルーターとして発生することはありません。"
    },
    {
      "indent": 3,
      "text": "When summary routes are not imported into an NSSA, the default LSA originated into it by its border routers must be a Type-3 summary-LSA. This default summary-LSA insures intra-AS connectivity to the rest of the OSPF domain, as its default summary route is preferred over the default route of a Type-7 default LSA. Without a default summary route the OSPF domain's inter-area traffic, which is normally forwarded by summary routes, might exit the AS via the default route of a Type-7 default LSA originated by an NSSA internal router. The Type-7 default LSAs originated by NSSA internal routers and the no-summary option are mutually exclusive features. When summary routes are imported into the NSSA, the default LSA originated by a NSSA border router into the NSSA should be a Type-7 LSA.",
      "ja": "要約ルートがNSSAにインポートされていない場合、デフォルトのLSAは、その境界ルーターによって発信されたものである必要があります。このデフォルトの概要LSAは、デフォルトの概要ルートがType-7デフォルトLSAのデフォルトルートよりも優先されるため、OSPFドメインの残りの部分への接続性を保証します。デフォルトの要約ルートがないと、通常、略式ルートによって転送されるOSPFドメインのエリア間トラフィックは、NSSA内部ルーターが発信するType-7デフォルトのLSAのデフォルトルートを介してASを終了する場合があります。NSSA内部ルーターから発信されるType-7デフォルトのLSAと非スマリーオプションは、相互に排他的な機能です。概要ルートがNSSAにインポートされる場合、NSSAボーダールーターからNSSAに由来するデフォルトのLSAは、タイプ7 LSAである必要があります。"
    },
    {
      "indent": 3,
      "text": "In our transit topology example the subnets of 130.57 and network 192.31.114 will still be learned by RIP on router BR18, but now both BR10 and BR18 can be in an NSSA and all of BBN Planet's external routes are hidden from BR18; BR10 becomes an NSSA border router and BR18 becomes an AS boundary router internal to the NSSA. BR18 will import the subnets of 130.57 and network 192.31.114 as Type-7 LSAs into the NSSA. BR10 then translates these routes into Type-5 LSAs and floods them into BBN Planet's backbone.",
      "ja": "トランジットトポロジの例では、130.57とネットワーク192.31.114のサブネットは、ルーターBR18のRIPによってまだ学習されますが、今ではBR10とBR18の両方がNSSAにあり、BBN惑星のすべての外部ルートはBR18から隠されています。BR10はNSSAボーダールーターになり、BR18はNSSAの内部の境界ルーターになります。BR18は、130.57のサブネットとネットワーク192.31.114をタイプ7 LSAとしてNSSAにインポートします。BR10は、これらのルートをタイプ5 LSAに変換し、それらをBBN惑星のバックボーンにあふれさせます。"
    },
    {
      "indent": 3,
      "text": "In our corporate topology example if Area 1 and Area 2 are NSSAs the external paths to the subnets of the address ranges 192.168.192/20 and 192.168.208/22 can be redistributed as Type-7 LSAs throughout Area 1 and Area 2 respectively, and then aggregated during the translation process into separate Type-5 LSAs that are flooded into Area 0. A0 may be configured as Area 1's translator even though B0 is the translator of Area 2.",
      "ja": "領域1とエリア2がNSSAの場合、企業トポロジの例では、アドレスの範囲192.168.192/20および192.168.208/22の範囲への外部パスは、それぞれエリア1およびエリア2全体でタイプ7 LSAとして再配布できます。翻訳プロセス中に、エリア0に浸水した別々のタイプ5 LSAに集約されます。A0は、B0がエリア2の翻訳者であるにもかかわらず、エリア1の翻訳者として構成できます。"
    },
    {
      "indent": 0,
      "text": "2.0 NSSA Intra-Area Implementation Details",
      "section_title": true,
      "ja": "2.0 NSSAエリア内実装の詳細"
    },
    {
      "indent": 0,
      "text": "2.1 The N-bit",
      "section_title": true,
      "ja": "2.1 n-bit"
    },
    {
      "indent": 3,
      "text": "The N-bit ensures that all members of an NSSA agree on the area's configuration. Together, the N-bit and E-bit reflect an interface's (and consequently the interface's associated area) external LSA flooding capability. As explained in [OSPF] Section 10.5, if Type-5 LSAs are not flooded into/throughout the area, the E-bit must be clear in the option field of the received Hello packets. Interfaces associated with an NSSA will not send or receive Type-5 LSAs on that interface but may send and receive Type-7 LSAs. Therefore, if the N-bit is set in the options field, the E-bit must be clear.",
      "ja": "N-BITは、NSSAのすべてのメンバーがこの地域の構成に同意することを保証します。一緒に、N-BITとEBITは、インターフェイスの（およびその結果、インターフェイスの関連領域）外部LSAフラッディング機能を反映しています。[OSPF]セクション10.5で説明されているように、タイプ5 LSAがエリア全体に浸水していない場合、受信したハローパケットのオプションフィールドでeビットは明確でなければなりません。NSSAに関連付けられたインターフェイスは、そのインターフェイスにタイプ5 LSAを送信または受信するのではなく、タイプ7 LSAを送信および受信する場合があります。したがって、n-bitがオプションフィールドに設定されている場合、eビットは明確でなければなりません。"
    },
    {
      "indent": 3,
      "text": "To support the NSSA option an additional check must be made in the function that handles the receiving of the Hello packet to verify that both the N-bit and the E-bit found in the Hello packet's option field match the area type and ExternalRoutingCapability of the area of the receiving interface. A mismatch in the options causes processing of the received Hello packet to stop and the packet to be dropped.",
      "ja": "NSSAオプションをサポートするには、ハローパケットの受信を処理する関数に追加のチェックを行う必要があります。N-BITとEBITの両方がHello Packetのオプションフィールドで見つかったe-Bitの両方が、エリアタイプと外部ルーティングキャピールと一致することを確認する必要があります。受信インターフェイスの領域。オプションの不一致により、受信したハローパケットの処理が停止し、パケットがドロップされます。"
    },
    {
      "indent": 0,
      "text": "2.2 Type-7 Address Ranges",
      "section_title": true,
      "ja": "2.2 タイプ7アドレス範囲"
    },
    {
      "indent": 3,
      "text": "NSSA border routers may be configured with Type-7 address ranges. Each Type-7 address range is defined as an [address,mask] pair. Many separate Type-7 networks may fall into a single Type-7 address range, just as a subnetted network is composed of many separate subnets. NSSA border routers may aggregate Type-7 routes by advertising a single Type-5 LSA for each Type-7 address range. The Type-5 LSA resulting from a Type-7 address range match will be distributed to all Type-5 capable areas. Section 3.2 details how Type-5 LSAs are generated from Type-7 address ranges.",
      "ja": "NSSAボーダールーターは、タイプ7アドレス範囲で構成できます。各タイプ7アドレス範囲は、[アドレス、マスク]ペアとして定義されます。サブネットネットワークが多くの個別のサブネットで構成されているように、多くの個別のタイプ7ネットワークが単一のタイプ7アドレス範囲に分類される場合があります。NSSAボーダールーターは、各タイプ7アドレス範囲に単一のタイプ5 LSAを宣伝することにより、タイプ7ルートを集約できます。タイプ7アドレス範囲の一致に起因するタイプ5 LSAは、すべてのタイプ5の有能な領域に配布されます。セクション3.2では、タイプ7アドレスの範囲からタイプ5 LSAがどのように生成されるかを詳しく説明しています。"
    },
    {
      "indent": 3,
      "text": "A Type-7 address range includes the following configurable items.",
      "ja": "タイプ7アドレス範囲には、次の構成可能なアイテムが含まれます。"
    },
    {
      "indent": 6,
      "text": "o An [address,mask] pair.",
      "ja": "o [アドレス、マスク]ペア。"
    },
    {
      "indent": 6,
      "text": "o A status indication of either Advertise or DoNotAdvertise.",
      "ja": "o 広告またはdonotAdvertiseのいずれかのステータス表示。"
    },
    {
      "indent": 6,
      "text": "o An external route tag.",
      "ja": "o 外部ルートタグ。"
    },
    {
      "indent": 0,
      "text": "2.3 Type-7 LSAs",
      "section_title": true,
      "ja": "2.3 タイプ7 LSA"
    },
    {
      "indent": 3,
      "text": "External routes are imported into NSSAs as Type-7 LSAs by NSSA AS boundary routers. An NSSA AS boundary router (ASBR) is a router that has an interface associated with the NSSA and is exchanging routing information with routers belonging to another AS. Like OSPF ASBRs, an NSSA router indicates it is an NSSA ASBR by setting the E-bit in its router-LSA. As with Type-5 LSAs a separate Type-7 LSA is originated for each destination network. To support NSSAs the link-state database must therefore be expanded to contain Type-7 LSAs.",
      "ja": "外部ルートは、NSSAによって境界ルーターとしてNSSAとしてNSSAにインポートされます。境界ルーター（ASBR）としてのNSSAは、NSSAに関連付けられたインターフェイスを備えたルーターであり、ルーターを別のASに属するルーターとルーティング情報を交換しています。OSPF ASBRSと同様に、NSSAルーターは、Router-LSAにEビットを設定することにより、NSSA ASBRであることを示しています。タイプ5 LSAと同様に、各宛先ネットワークに対して個別のタイプ7 LSAが発生します。したがって、NSSASをサポートするには、Link-Stateデータベースを拡張して、タイプ7 LSAを含む必要があります。"
    },
    {
      "indent": 3,
      "text": "Type-7 LSAs are identical to Type-5 LSAs except for the following (see [OSPF] Section 12.4.4, \"AS external links\").",
      "ja": "タイプ7 LSAは、以下を除いてタイプ5 LSAと同一です（[OSPF]セクション12.4.4、「外部リンクとして」を参照）。"
    },
    {
      "indent": 6,
      "text": "1. The Type field in the LSA header is 7.",
      "ja": "1. LSAヘッダーのタイプフィールドは7です。"
    },
    {
      "indent": 6,
      "text": "2. Type-7 LSAs are only flooded within the originating NSSA. The flooding of Type-7 LSAs follows the same rules as the flooding of Type-1 and Type-2 LSAs.",
      "ja": "2. タイプ7 LSAは、発生するNSSA内でのみ浸水します。タイプ7 LSAの洪水は、タイプ1およびタイプ2 LSAの洪水と同じルールに従います。"
    },
    {
      "indent": 6,
      "text": "3. Type-7 LSAs are only listed within the OSPF area data structures of their respective NSSAs, making them area specific. Type-5 LSAs, which are flooded to all Type-5 capable areas, have global scope and are listed in the OSPF protocol data structure.",
      "ja": "3. タイプ7 LSAは、それぞれのNSSAのOSPFエリアデータ構造内にのみリストされているため、面積固有のものになります。すべてのタイプ5能力エリアに浸水したタイプ5 LSAは、グローバルな範囲を持ち、OSPFプロトコルデータ構造にリストされています。"
    },
    {
      "indent": 6,
      "text": "4. NSSA border routers select which Type-7 LSAs are translated into Type-5 LSAs and flooded into the OSPF domain's transit topology.",
      "ja": "4. NSSAボーダールータータイプ5 LSAに翻訳され、OSPFドメインのトランジットトポロジに浸水するタイプ7 LSAを選択します。"
    },
    {
      "indent": 6,
      "text": "5. Type-7 LSAs have a propagate (P) bit that, when set, tells an NSSA border router to translate a Type-7 LSA into a Type-5 LSA.",
      "ja": "5. タイプ7 LSAには、設定されたときにNSSAボーダールーターにタイプ7 LSAをタイプ5 LSAに変換するよう指示する伝播（P）ビットがあります。"
    },
    {
      "indent": 6,
      "text": "6. Those Type-7 LSAs that are to be translated into Type-5 LSAs must have their forwarding address set.",
      "ja": "6. タイプ5 LSAに翻訳されるこれらのタイプ7 LSAは、転送アドレスを設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Type-5 LSAs that are translations of Type-7 LSAs copy the Type-7 LSAs' non-zero forwarding addresses. Only those Type-5 LSAs that are aggregations of Type-7 LSAs may have 0.0.0.0 as a forwarding address. (See Section 3.2 for details.) Non-zero forwarding addresses produce efficient inter-area routing to an NSSA's AS external destinations when it has multiple border routers. Also the non-zero forwarding addresses of Type-7 LSAs ease the process of their translation into Type-5 LSAs, as NSSA border routers are not required to compute them.",
      "ja": "タイプ7 LSAの翻訳であるタイプ5 LSAは、タイプ7 LSAの非ゼロ転送アドレスをコピーします。タイプ7 LSAの集合体であるタイプ5 LSAのみが、転送アドレスとして0.0.0.0を持つ場合があります。（詳細については、セクション3.2を参照してください。）ゼロ以外の転送アドレスは、複数の境界ルーターを備えた場合、NSSAとしての効率的なエリア間ルーティングを外部宛先として生成します。また、タイプ7 LSAの非ゼロ転送アドレスは、NSSAボーダールーターがそれらを計算する必要はないため、タイプ5 LSAへの翻訳のプロセスを容易にします。"
    },
    {
      "indent": 3,
      "text": "Normally the next hop address of an installed AS external route learned by an NSSA ASBR from an adjacent AS points at one of the adjacent AS's gateway routers. If this address belongs to a network connected to the NSSA ASBR via one of its NSSAs' active interfaces, then the NSSA ASBR copies this next hop address into the forwarding address field of the route's Type-7 LSA that is originated into this NSSA, as is currently done with Type-5 LSAs. (See [OSPF] Section 12.4.4.1.) For an NSSA with no such network the forwarding address field may only be filled with an address from one of the its active interfaces or 0.0.0.0. If the P-bit is set, the forwarding address must be non-zero; otherwise it may be 0.0.0.0. If an NSSA requires the P-bit be set and a non-zero forwarding address is unavailable, then the route's Type-7 LSA is not originated into this NSSA.",
      "ja": "通常、隣接するASのゲートウェイルーターの1つでポイントとして隣接するNSSA ASBRによって学習された外部ルートとしてインストールされた次のホップアドレス。このアドレスがNSSAのアクティブインターフェイスの1つを介してNSSA ASBRに接続されたネットワークに属している場合、NSSA ASBRは、この次のホップアドレスを、このNSSAに由来するルートのタイプ7 LSAの転送アドレスフィールドにコピーします。現在、タイプ5 LSAで行われています。（[OSPF]セクション12.4.4.1を参照）そのようなネットワークを持たないNSSAについては、転送アドレスフィールドには、そのアクティブインターフェイスのいずれかまたは0.0.0.0のアドレスでのみ満たされます。Pビットが設定されている場合、転送アドレスはゼロ以外でなければなりません。それ以外の場合は、0.0.0.0です。NSSAがPビットを設定し、ゼロ以外の転送アドレスを利用できない場合、ルートのタイプ7 LSAはこのNSSAに由来しません。"
    },
    {
      "indent": 3,
      "text": "When a router is forced to pick a forwarding address for a Type-7 LSA, preference should be given first to the router's internal addresses (provided internal addressing is supported). If internal addresses are not available, preference should be given to the router's active OSPF stub network addresses. These choices avoid the possible extra hop that may happen when a transit network's address is used. When the interface whose IP address is the LSA's forwarding address transitions to a Down state (see [OSPF] Section 9.3), the router must select a new forwarding address for the LSA and then re-originate it. If one is not available the LSA should be flushed.",
      "ja": "ルーターがタイプ7 LSAの転送アドレスを選択することを余儀なくされた場合、最初にルーターの内部アドレスを優先する必要があります（内部アドレス指定がサポートされている場合）。内部アドレスが利用できない場合は、ルーターのアクティブなOSPFスタブネットワークアドレスを優先する必要があります。これらの選択は、トランジットネットワークのアドレスが使用されたときに発生する可能性のある追加ホップを回避します。IPアドレスがLSAの転送アドレスであるインターフェイスがダウン状態に移行する場合（[OSPF]セクション9.3を参照）、ルーターはLSAの新しい転送アドレスを選択してから再起動する必要があります。利用できない場合は、LSAをフラッシュする必要があります。"
    },
    {
      "indent": 3,
      "text": "The metrics and path types of Type-5 LSAs are directly comparable with the metrics and path types of Type-7 LSAs.",
      "ja": "タイプ5 LSAのメトリックとパスタイプは、タイプ7 LSAのメトリックとパスタイプに直接匹敵します。"
    },
    {
      "indent": 0,
      "text": "2.4 Originating Type-7 LSAs",
      "section_title": true,
      "ja": "2.4 原始型-7 LSA"
    },
    {
      "indent": 3,
      "text": "NSSA AS boundary routers may only originate Type-7 LSAs into NSSAs. An NSSA internal AS boundary router must set the P-bit in the LSA header's option field of any Type-7 LSA whose network it wants advertised into the OSPF domain's full transit topology. The LSAs of these networks must have a valid non-zero forwarding address. If the P-bit is clear the LSA is not translated into a Type-5 LSA by NSSA border routers.",
      "ja": "境界ルーターとしてのNSSAは、タイプ7 LSAをNSSAにのみ発生する場合があります。境界ルーターとしてのNSSA内部は、ネットワークがOSPFドメインのフルトランジットトポロジに宣伝したいタイプ7 LSAのLSAヘッダーオプションフィールドにPビットを設定する必要があります。これらのネットワークのLSAには、有効な非ゼロ転送アドレスが必要です。Pビットがクリアされている場合、LSAはNSSAボーダールーターによってタイプ5 LSAに変換されません。"
    },
    {
      "indent": 3,
      "text": "When an NSSA border router originates both a Type-5 LSA and a Type-7 LSA for the same network, then the P-bit must be clear in the Type-7 LSA so that it isn't translated into a Type-5 LSA by another NSSA border router. If the border router only originates a Type-7 LSA, it may set the P-bit so that the network may be aggregated/propagated during Type-7 translation. If an NSSA's border router originates a Type-5 LSA with a forwarding address from the NSSA, it should also originate a Type-7 LSA into the NSSA. If two NSSA routers, both reachable from one another over the NSSA, originate functionally equivalent Type-7 LSAs (i.e., same destination, cost and non-zero forwarding address), then the router having the least preferred LSA should flush its LSA. (See [OSPF] Section 12.4.4.1.) Preference between two Type-7 LSAs is determined by the following tie breaker rules:",
      "ja": "NSSAボーダールーターが同じネットワークのタイプ5 LSAとタイプ7 LSAの両方を発信する場合、P-BITはタイプ7 LSAで明確にする必要があるため、タイプ5 LSAに変換されないようにします。別のNSSAボーダールーターによる。ボーダールーターがタイプ7 LSAのみを発信する場合、タイプ7の翻訳中にネットワークが集約/伝播されるようにPビットを設定することができます。NSSAのボーダールーターがNSSAから転送アドレスを持つタイプ5 LSAを発信する場合、NSSAへのタイプ7 LSAも発生する必要があります。両方ともNSSA上で互いに到達可能な2つのNSSAルーターが、機能的に同等のタイプ7 LSA（つまり、同じ宛先、コスト、非ゼロ転送アドレス）を発生する場合、LSAが最も優先されるルーターはLSAを洗い流す必要があります。（[OSPF]セクション12.4.4.1を参照してください。）2つのタイプ-7 LSAの優先順位は、次のタイブレーカールールによって決定されます。"
    },
    {
      "indent": 6,
      "text": "1. An LSA with the P-bit set is preferred over one with the P-bit clear.",
      "ja": "1. Pビットセットを備えたLSAは、Pビットがクリアされている1つよりも優先されます。"
    },
    {
      "indent": 6,
      "text": "2. If the P-bit settings are the same, the LSA with the higher router ID is preferred.",
      "ja": "2. Pビット設定が同じ場合、より高いルーターIDを持つLSAが推奨されます。"
    },
    {
      "indent": 3,
      "text": "A Type-7 default LSA for the network 0.0.0.0/0 may be originated into the NSSA by any NSSA router. The Type-7 default LSA originated by an NSSA border router must have the P-bit clear. An NSSA ASBR that is not an NSSA border router may originate a Type-7 default LSA with the P-bit set. A Type-7 default LSA may be installed by NSSA border routers if and only if its P-bit is set. (See Appendix E.)",
      "ja": "ネットワーク0.0.0.0/0のタイプ7デフォルトLSAは、NSSAルーターによってNSSAに由来する場合があります。NSSAボーダールーターから発信されるType-7デフォルトのLSAには、Pビットがクリアされている必要があります。NSSAボーダールーターではないNSSA ASBRは、Pビットセットを備えたタイプ7デフォルトLSAを発生する場合があります。タイプ7のデフォルトLSAは、Pビットが設定されている場合にのみ、NSSAボーダールーターによってインストールされる場合があります。（付録Eを参照）"
    },
    {
      "indent": 3,
      "text": "NSSA border routers must originate an LSA for the default destination into all their directly attached NSSAs in order to support intra-AS routing and inter-AS routing. This default destination is advertised in either a Type-3 LSA or a Type-7 LSA, as described in Section 2.7. The default LSA's metric should be configurable. For Type-7 default LSAs, the metric type (1 or 2) should also be configurable.",
      "ja": "NSSAボーダールーターは、デフォルトの宛先のLSAを、すべての直接接続されたNSSAに発信する必要があります。このデフォルトの宛先は、セクション2.7で説明されているように、タイプ3 LSAまたはタイプ7 LSAのいずれかで宣伝されています。デフォルトのLSAメトリックは構成可能である必要があります。Type-7デフォルトLSAの場合、メトリックタイプ（1または2）も設定可能です。"
    },
    {
      "indent": 0,
      "text": "2.5 Calculating Type-7 AS External Routes",
      "section_title": true,
      "ja": "2.5 タイプ7を外部ルートとして計算します"
    },
    {
      "indent": 3,
      "text": "This calculation must be run when Type-7 LSAs are processed during the AS external route calculation. This calculation may process Type-5 LSAs, but it is written that way only for comparison sake.",
      "ja": "この計算は、AS外部ルート計算中にタイプ7 LSAが処理される場合に実行する必要があります。この計算では、タイプ5 LSAを処理する場合がありますが、比較のためにのみそのように記述されています。"
    },
    {
      "indent": 3,
      "text": "Non-default Type-7 LSAs with the P-bit clear may be installed in the OSPF routing table of NSSA border routers. Since these LSAs are not propagated throughout the OSPF domain, traffic that originates external to an NSSA and that passes through one of the NSSA's border routers may be unexpectedly diverted into the NSSA. (See Appendix E.) An NSSA border router should examine both Type-5 LSAs and Type-7 LSAs if either Type-5 or Type-7 routes need to be updated or recalculated. This is done as part of the AS external route calculation. An NSSA internal router should examine Type-7 LSAs when Type-7 routes need to be recalculated.",
      "ja": "Pビットクリアを備えた非デフォルトタイプ-7 LSAは、NSSAボーダールーターのOSPFルーティングテーブルに取り付けられる場合があります。これらのLSAはOSPFドメイン全体に伝播されないため、NSSAの外部からNSSAの1つを通過するトラフィックは、予期せずにNSSAに転用される可能性があります。（付録Eを参照）NSSAボーダールーターは、タイプ5またはタイプ7のルートを更新または再計算する必要がある場合は、タイプ5 LSAとタイプ7 LSAの両方を調べる必要があります。これは、外部ルート計算の一部として行われます。NSSA内部ルーターは、タイプ7ルートを再計算する必要がある場合に、タイプ7 LSAを調べる必要があります。"
    },
    {
      "indent": 3,
      "text": "What follows is only a modest modification of [OSPF] Section 16.4. Original paragraphs are tagged with [OSPF]. Paragraphs with minor changes are tagged with ~[OSPF]. Paragraphs specific to NSSA are tagged with [NSSA].",
      "ja": "以下は、[OSPF]セクション16.4の控えめな変更にすぎません。元の段落には[OSPF]がタグ付けされています。わずかな変更を伴う段落には、〜[OSPF]がタグ付けされています。NSSAに固有のパラグラフには、[NSSA]がタグ付けされています。"
    },
    {
      "indent": 3,
      "text": "AS external routes are calculated by examining AS-external-LSAs, be they Type-5 or Type-7. Each of the AS-external-LSAs is considered in turn. Most AS-external-LSAs describe routes to specific IP destinations. An AS-external-LSA can also describe a default route for the Autonomous System (Destination ID = DefaultDestination, network/subnet mask = 0x00000000). For each AS-external-LSA: ~[OSPF]",
      "ja": "外部ルートは、型5つまたはタイプ7であろうと、外部LSAを調べることによって計算されるためです。それぞれの外部LSAは順番に考慮されます。ほとんどの外部LSAは、特定のIP宛先へのルートを説明しています。AS-External-LSAは、自律システムのデフォルトルート（宛先ID = defaultDestination、ネットワーク/サブネットマスク= 0x00000000）を記述することもできます。各as-erternal-lsaの場合：〜[ospf]"
    },
    {
      "indent": 6,
      "text": "(1) If the metric specified by the LSA is LSInfinity, or if the age of the LSA equals MaxAge, then examine the next LSA. [OSPF]",
      "ja": "(1) LSAで指定されたメトリックがLsinfinityである場合、またはLSAの年齢が最大値に等しい場合は、次のLSAを調べます。[OSPF]"
    },
    {
      "indent": 6,
      "text": "(2) If the LSA was originated by the calculating router itself, examine the next LSA. [OSPF]",
      "ja": "(2) LSAが計算ルーター自体によって発生した場合、次のLSAを調べます。[OSPF]"
    },
    {
      "indent": 6,
      "text": "(3) Call the destination described by the LSA N. N's address is obtained by masking the LSA's Link State ID with the network/subnet mask contained in the body of the LSA. Look up the routing table entries that match the LSA's type for the AS boundary router (ASBR) that originated the LSA. For a Type-5 LSA, routing table entries may only be selected from each attached Type-5 capable area. Since the flooding scope of a Type-7 LSA is restricted to the originating NSSA, the routing table entry of its ASBR must be found in the originating NSSA. If no entries exist for the ASBR (i.e. the ASBR is unreachable over the transit topology for a Type-5 LSA, or, for a Type-7 LSA, it is unreachable over the LSA's originating NSSA), do nothing with this LSA and consider the next in the list. [NSSA]",
      "ja": "(3) LSA N. Nのアドレスで説明されている宛先を呼び出してください。LSAの本文に含まれるネットワーク/サブネットマスクにLSAのリンク状態IDをマスキングすることで取得されます。LSAを発信したAS Boundary Router（ASBR）のLSAのタイプに一致するルーティングテーブルエントリを検索します。タイプ5 LSAの場合、ルーティングテーブルエントリは、添付された各タイプ5対応領域からのみ選択できます。タイプ7 LSAの洪水範囲は発信されるNSSAに制限されているため、ASBRのルーティングテーブルエントリは、発生するNSSAで見つける必要があります。ASBRにはエントリが存在しない場合（つまり、ASBRがタイプ5 LSAの輸送トポロジーに対して到達できない場合、またはタイプ7 LSAの場合、LSAの発信NSSAに対して到達できない場合は、このLSAで何もしていません。リストの次は。[NSSA]"
    },
    {
      "indent": 10,
      "text": "Else if the destination is a Type-7 default route (destination ID = DefaultDestination) and one of the following is true, then do nothing with this LSA and consider the next in the list:",
      "ja": "それ以外の場合は、宛先がタイプ7デフォルトルート（宛先ID =デフォルトデスティネーション）である場合、次のいずれかが真である場合、このLSAで何もして、リストの次のことを考慮してください。"
    },
    {
      "indent": 12,
      "text": "o The calculating router is a border router and the LSA has its P-bit clear. Appendix E describes a technique whereby an NSSA border router installs a Type-7 default LSA without propagating it.",
      "ja": "o 計算ルーターはボーダールーターであり、LSAにはPビットがクリアされています。付録Eでは、NSSAボーダールーターが伝播せずにタイプ7デフォルトLSAをインストールする手法について説明しています。"
    },
    {
      "indent": 12,
      "text": "o The calculating router is a border router and is suppressing the import of summary routes as Type-3 summary-LSAs. [NSSA]",
      "ja": "o 計算ルーターはボーダールーターであり、略式ルートのインポートをタイプ3サマリLSAとして抑制しています。[NSSA]"
    },
    {
      "indent": 10,
      "text": "Else, this LSA describes an AS external path to destination N. Examine the forwarding address specified in the AS-external-LSA. This indicates the IP address to which packets for the destination should be forwarded. [OSPF]",
      "ja": "そうでなければ、このLSAは、宛先Nへの外部パスとして説明します。これは、宛先のパケットを転送する必要があるIPアドレスを示します。[OSPF]"
    },
    {
      "indent": 10,
      "text": "If the forwarding address is set to 0.0.0.0 then packets should be sent to the ASBR itself. If the LSA is Type-5, from among the multiple non-NSSA routing table entries for the ASBR (both NSSA and non-NSSA ASBR entries might exists on an NSSA border router), select the preferred entry as follows: ~[OSPF]",
      "ja": "転送アドレスが0.0.0.0に設定されている場合、パケットはASBR自体に送信する必要があります。LSAがType-5の場合、ASBRの複数の非NSSAルーティングテーブルエントリ（NSSAと非NSSA ASBRエントリの両方がNSSAボーダールーターに存在する可能性があります）から、次のように優先エントリを選択します。"
    },
    {
      "indent": 12,
      "text": "If RFC1583Compatibility is set to \"disabled\", prune the set of routing table entries for the ASBR as described in OSPF Section 16.4.1. In any case, among the remaining routing table entries, select the routing table entry with the least cost; when there are multiple least cost routing table entries the entry whose associated area has the largest OSPF Area ID (when considered as an unsigned 32-bit integer) is chosen. [OSPF]",
      "ja": "RFC1583Compatatibilityが「無効」に設定されている場合、OSPFセクション16.4.1で説明されているように、ASBRのルーティングテーブルエントリのセットをプルンします。いずれにせよ、残りのルーティングテーブルエントリの中で、最小コストでルーティングテーブルエントリを選択します。複数の最小コストルーティングテーブルエントリがある場合、関連領域が最大のOSPFエリアID（署名されていない32ビット整数と見なされる場合）を持つエントリが選択されます。[OSPF]"
    },
    {
      "indent": 10,
      "text": "Since a Type-7 LSA only has area-wide flooding scope, when its forwarding address is set to 0.0.0.0, its ASBR's routing table entry must be chosen from the originating NSSA. Here no pruning is necessary since this entry always contains non-backbone intra-area paths. [NSSA]",
      "ja": "タイプ7 LSAにはエリア全体の洪水スコープのみがあるため、転送アドレスが0.0.0.0に設定されている場合、ASBRのルーティングテーブルエントリは、発信元のNSSAから選択する必要があります。ここでは、このエントリには常に非脳内のエリア内パスが含まれているため、剪定は必要ありません。[NSSA]"
    },
    {
      "indent": 10,
      "text": "If the forwarding address is non-zero look up the forwarding address in the routing table. For a Type-5 LSA the matching routing table entry must specify an intra-area or inter-area path through a Type-5 capable area. For a Type-7 LSA the matching routing table entry must specify an intra-area path through the LSA's originating NSSA. If no such path exists then do nothing with this LSA and consider the next in the list. [NSSA]",
      "ja": "転送アドレスがゼロでない場合、ルーティングテーブルの転送アドレスを検索します。タイプ5 LSAの場合、一致するルーティングテーブルエントリは、タイプ5の有能な領域を通るエリア内またはエリア間パスを指定する必要があります。タイプ7 LSAの場合、マッチングルーティングテーブルエントリは、LSAの発信NSSAを介したエリア内パスを指定する必要があります。そのようなパスが存在しない場合は、このLSAで何もして、リストの次のパスを考慮してください。[NSSA]"
    },
    {
      "indent": 6,
      "text": "(4) Let X be the cost specified by the preferred routing table entry for the ASBR/forwarding address, and Y the cost specified in the LSA. X is in terms of the link state metric, and Y is a type 1 or 2 external metric. [OSPF]",
      "ja": "(4) Xを、ASBR/転送アドレスの優先ルーティングテーブルエントリによって指定されたコストと、LSAで指定されたコストをYとします。xはリンク状態メトリックの観点から、yはタイプ1または2の外部メトリックです。[OSPF]"
    },
    {
      "indent": 6,
      "text": "(5) Now, look up the routing table entry for the destination N. If no entry exists for N, install the AS external path to N, with the next hop equal to the list of next hops to the ASBR/forwarding address, and advertising router equal to the ASBR. If the external metric type is 1, then the path-type is set to Type-1 external and the cost is equal to X + Y. If the external metric type is 2, the path-type is set to Type-2 external, the link-state component of the route's cost is X, and the type 2 cost is Y. [OSPF]",
      "ja": "(5) 次に、宛先Nのルーティングテーブルエントリを調べます。Nのエントリが存在しない場合は、次のホップをASBR/転送アドレスの次のホップのリストに等しく、nへの外部ホップをインストールし、等しい広告ルーターを等しくしますASBRへ。外部メトリックタイプが1の場合、パスタイプはタイプ1の外部に設定され、コストはx Yに等しくなります。外部メトリックタイプが2の場合、パスタイプはタイプ2外部に設定されます。ルートのコストのリンク状態コンポーネントはxで、タイプ2のコストはYです。[OSPF]"
    },
    {
      "indent": 6,
      "text": "(6) Otherwise compare the AS external path described by the LSA with the existing paths in N's routing table entry. If the new path is preferred, it replaces the present paths in N's routing table entry. If the new path is of equal preference, it is added to the present paths in N's routing table entry. [OSPF]",
      "ja": "(6) それ以外の場合は、LSAによって記述されたAS外部パスを、Nのルーティングテーブルエントリの既存のパスと比較します。新しいパスが優先される場合、Nのルーティングテーブルエントリの現在のパスを置き換えます。新しいパスが平等に優先される場合、Nのルーティングテーブルエントリの現在のパスに追加されます。[OSPF]"
    },
    {
      "indent": 10,
      "text": "Preference is defined as follows:",
      "ja": "選好は次のように定義されます。"
    },
    {
      "indent": 10,
      "text": "(a) Intra-area and inter-area paths are always preferred over AS external paths. [OSPF]",
      "ja": "(a) エリア内およびエリア間パスは、外部パスとして常に好まれます。[OSPF]"
    },
    {
      "indent": 10,
      "text": "(b) Type 1 external paths are always preferred over type 2 external paths. When all paths are type 2 external paths, the paths with the smallest advertised type 2 metric are always preferred. [OSPF]",
      "ja": "(b) タイプ1の外部パスは、タイプ2の外部パスよりも常に推奨されます。すべてのパスがタイプ2の外部パスである場合、最小の広告タイプ2メトリックのパスが常に推奨されます。[OSPF]"
    },
    {
      "indent": 10,
      "text": "(c) If the new AS external path is still indistinguishable from the current paths in N's routing table entry, and RFC1583Compatibility is set to \"disabled\", select the preferred paths based on the intra-AS paths to the ASBR/forwarding addresses, as specified in Section 16.4.1. Here intra-NSSA paths are equivalent to the intra-area paths of non-backbone regular OSPF areas. [NSSA]",
      "ja": "(c) New As external PathがNのルーティングテーブルエントリの現在のパスとまだ区別できない場合、RFC1583Compatibilityが「無効」に設定されている場合、セクションで指定されているASBR/転送アドレスへのパスAS ASパスに基づく優先パスを選択します。16.4.1。ここでは、NSSA内パスは、非脳骨の通常のOSPFエリアのエリア内パスに相当します。[NSSA]"
    },
    {
      "indent": 10,
      "text": "(d) If the new AS external path is still indistinguishable from the current paths in N's routing table entry, select the preferred path based on a least cost comparison. Type 1 external paths are compared by looking at the sum of the distance to the ASBR/forwarding addresses and the advertised type 1 metric (X+Y). Type 2 external paths advertising equal type 2 metrics are compared by looking at the distance to the ASBR/forwarding addresses. ~[OSPF]",
      "ja": "(d) Nのルーティングテーブルエントリの現在のパスとは、外部パスがまだ区別できない場合は、最小コストの比較に基づいて優先パスを選択します。タイプ1の外部パスは、ASBR/転送アドレスまでの距離の合計と広告されたタイプ1メトリック（x y）を調べることにより比較されます。タイプ2の外部パス広告等しいタイプ2メトリックは、ASBR/転送アドレスまでの距離を調べることにより比較されます。〜[OSPF]"
    },
    {
      "indent": 10,
      "text": "(e) If the current LSA is functionally the same as an installed LSA (i.e., same destination, cost and non-zero forwarding address) then apply the following priorities in deciding which LSA is preferred:",
      "ja": "(e) 現在のLSAがインストールされているLSA（つまり、同じ宛先、コスト、および非ゼロ転送アドレス）と機能的に同じ場合、LSAが優先されることを決定する際に、次の優先順位を適用します。"
    },
    {
      "indent": 17,
      "text": "1. A Type-7 LSA with the P-bit set.",
      "ja": "1. Pビットセットを備えたタイプ7 LSA。"
    },
    {
      "indent": 17,
      "text": "2. A Type-5 LSA.",
      "ja": "2. タイプ5 LSA。"
    },
    {
      "indent": 17,
      "text": "3. The LSA with the higher router ID.",
      "ja": "3. より高いルーターIDを持つLSA。"
    },
    {
      "indent": 14,
      "text": "[NSSA]",
      "ja": "[NSSA]"
    },
    {
      "indent": 0,
      "text": "2.6 Incremental Updates",
      "section_title": true,
      "ja": "2.6 増分更新"
    },
    {
      "indent": 3,
      "text": "Incremental updates for Type-7 LSAs should be treated the same as incremental updates for Type-5 LSAs (see [OSPF] Section 16.6). When a new instance of a Type-7 LSA is received it is not necessary to recalculate the entire routing table. Call the destination described by the Type-7 LSA N. N's address is obtained by masking the LSA's Link State ID with the network/subnet mask contained in the body of the LSA. If there is already an intra-area or inter-area route to the destination, no recalculation is necessary (internal routes take precedence).",
      "ja": "タイプ7 LSAの増分更新は、タイプ5 LSAの増分更新と同じように扱う必要があります（[OSPF]セクション16.6を参照）。タイプ7 LSAの新しいインスタンスを受信した場合、ルーティングテーブル全体を再計算する必要はありません。Type-7 LSA N. Nのアドレスで説明されている宛先を呼び出すことは、LSAの本文に含まれるネットワーク/サブネットマスクでLSAのリンク状態IDをマスキングすることにより取得されます。宛先へのエリア内またはエリア間のルートがすでにある場合、再計算は必要ありません（内部ルートが優先されます）。"
    },
    {
      "indent": 3,
      "text": "Otherwise, the procedure in the preceding section will have to be performed but only for the external routes (Type-5 and Type-7) whose destination is N. Before this procedure is performed, the present routing table entry for N should be invalidated.",
      "ja": "それ以外の場合、前のセクションの手順は実行する必要がありますが、その目的地がNである外部ルート（タイプ5およびタイプ7）のみで行われます。この手順を実行する前に、Nの現在のルーティングテーブルエントリを無効にする必要があります。"
    },
    {
      "indent": 0,
      "text": "2.7 Optionally Importing Summary Routes",
      "section_title": true,
      "ja": "2.7 オプションで略式ルートをインポートします"
    },
    {
      "indent": 3,
      "text": "In order for OSPF's summary routing to not be obscured by an NSSA's Type-7 AS-external-LSAs, all NSSA border router implementations must support the optional import of summary routes into NSSAs as Type-3 summary-LSAs. The default behavior is to import summary routes. A new area configuration parameter, ImportSummaries, is defined in Appendix D. When ImportSummaries is set to enabled, summary routes are imported. When it is set to disabled, summary routes are not imported. The default setting is enabled.",
      "ja": "OSPFの概要ルーティングがNSSAのType-7 As-External-LSAによって不明瞭にされないようにするために、すべてのNSSAボーダールーターの実装は、タイプ3の要約LSAとしてNSSAへの要約ルートのオプションのインポートをサポートする必要があります。デフォルトの動作は、略式ルートをインポートすることです。新しいエリア構成パラメーターであるImportSummariesは、付録Dで定義されています。インポートサマリが有効になるように設定されると、概要ルートがインポートされます。無効に設定されている場合、概要ルートはインポートされません。デフォルト設定が有効になっています。"
    },
    {
      "indent": 3,
      "text": "When OSPF's summary routes are not imported, the default LSA originated by an NSSA border router into the NSSA should be a Type-3 summary-LSA. This protects the NSSA from routing intra-AS traffic out the AS via the default route of a Type-7 default LSA originating from one of the NSSA's internal routers. When summary routes are imported into the NSSA, the default LSA originated by an NSSA border router must not be a Type-3 summary-LSA; otherwise its default route would be chosen over the potentially more preferred default routes of Type-7 default LSAs.",
      "ja": "OSPFの要約ルートがインポートされていない場合、NSSAボーダールーターによってNSSAに由来するデフォルトのLSAは、タイプ3サマリLSAである必要があります。これにより、NSSAは、NSSAの内部ルーターの1つに由来するタイプ7デフォルトのLSAのデフォルトルートを介してASのASのトラフィックをルーティングすることから保護します。概要ルートがNSSAにインポートされる場合、NSSAボーダールーターが発信するデフォルトのLSAは、タイプ3の要約LSAであってはなりません。それ以外の場合、そのデフォルトルートは、タイプ7デフォルトのLSAの潜在的に優先されるデフォルトルート上に選択されます。"
    },
    {
      "indent": 0,
      "text": "3.0 Intra-AS Implementation Details",
      "section_title": true,
      "ja": "3.0 イントラAS実装の詳細"
    },
    {
      "indent": 0,
      "text": "3.1 Type-7 Translator Election",
      "section_title": true,
      "ja": "3.1 タイプ7翻訳者選挙"
    },
    {
      "indent": 3,
      "text": "It is not recommended that multiple NSSA border routers perform Type-7 to Type-5 translation unless it is required to route packets efficiently through Area 0 to an NSSA partitioned by Type-7 address ranges. It is normally sufficient to have only one NSSA border router perform the translation. Excessive numbers of Type-7 translators unnecessarily increase the size of the OSPF link state data base.",
      "ja": "複数のNSSAボーダールーターが、領域0を介してパケットを効率的にルーティングし、タイプ7アドレス範囲によって分割されたNSSAまでのパケットを効率的にルーティングする必要がない限り、タイプ7からタイプ5の翻訳を実行することをお勧めしません。通常、NSSAボーダールーターが1つだけ翻訳を実行させるだけで十分です。タイプ7翻訳者の過剰な数は、OSPFリンク状態データベースのサイズを不必要に増加させます。"
    },
    {
      "indent": 3,
      "text": "A new area configuration parameter, NSSATranslatorRole, is defined in Appendix D. It specifies whether or not an NSSA router will unconditionally translate Type-7 LSAs to Type-5 LSAs when acting as an NSSA border router. Configuring the identity of the translator can be used to bias the routing to aggregated destinations. When NSSATranslatorRole is set to Always, Type-7 LSAs are always translated regardless of the translator state of other NSSA border routers. When NSSATranslatorRole is set to Candidate an NSSA border router will participate in the translator election process described below.",
      "ja": "新しいエリア構成パラメーターであるNSSATRASSLATORROLEは、付録Dで定義されています。NSSAルーターがNSSAボーダールーターとして作用するときにタイプ7 LSAを無条件にタイプ5 LSAに翻訳するかどうかを指定します。翻訳者のIDの構成を使用して、ルーティングを集約された目的地にバイアスすることができます。NSSATRASRASLATORROLEが常に設定されている場合、他のNSSAボーダールーターの翻訳状態に関係なく、タイプ7 LSAは常に翻訳されます。NSSATRASSLASLATORROLEが候補に設定されている場合、NSSAボーダールーターは、以下で説明する翻訳者の選挙プロセスに参加します。"
    },
    {
      "indent": 3,
      "text": "A new area parameter, NSSATranslatorState, is maintained in an NSSA's OSPF area data structure. By default all NSSA routers initialize NSSATranslatorState to disabled. When an NSSA border router's NSSATranslatorState changes from disabled to either enabled or elected, it begins translating the NSSA's Type-7 LSAs into Type-5 LSAs. When its NSSATranslatorState changes from either enabled or elected to disabled, it ceases translating the NSSA's Type-7 LSAs into Type-5 LSAs. (See paragraphs below.)",
      "ja": "NSSAのOSPFエリアデータ構造では、新しい領域パラメーターであるNSSATRASSLATORSTATEが維持されています。デフォルトでは、すべてのNSSAルーターがNSSATRASSLATORSTATEを無効に初期化します。NSSA Border RouterのNSSATRASSLATORTATEが無効から有効または選出されたいずれかに変化すると、NSSAのタイプ7 LSAをタイプ5 LSAに変換し始めます。NSSATRASSLATORSTATEが有効または無効に選出された場合から変化すると、NSSAのタイプ7 LSAをタイプ5 LSAに変換するのが停止します。（以下の段落を参照してください。）"
    },
    {
      "indent": 3,
      "text": "A new bit, Nt, is defined for the router-LSAs of NSSAs. (See Appendix B.) By default routers clear bit Nt when originating router-LSAs. However, when an NSSA border router has its NSSATranslatorState enabled, it sets bit Nt in the router-LSA it originates into the NSSA. An NSSA router whose NSSATranslatorRole is set to Always should re-originate a router-LSA into the NSSA whenever its NSSATranslatorState changes.",
      "ja": "NSSAのルーターLSAに対して、新しいビットNTが定義されています。（付録Bを参照）デフォルトでは、ルーターLSAを発信するときにビットntをクリアします。ただし、NSSAボーダールーターがNSSASTRASSLATORSTATEを有効にすると、NSSAに由来するルーターLSAにビットNTを設定します。NSSATRASSLATORROLEが設定されているNSSAルーターは、NSSATRASSLATORTATEが変化するたびに、常にルーターLSAをNSSAに再指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "When an NSSA router with the NSSA's NSSATranslatorRole set to Always attains border router status, it should change NSSATranslatorState from disabled to enabled. When it loses border router status, it should change NSSATranslatorState from enabled to disabled.",
      "ja": "NSSAのNSSATRASSLATORROLEを備えたNSSAルーターが常にボーダールーターステータスを達成するように設定されている場合、NSSATRASSLATORTATEを無効から有効に変更する必要があります。Border Routerのステータスが失われると、NSSATRASSLATORSTATEを有効から無効に変更する必要があります。"
    },
    {
      "indent": 3,
      "text": "All NSSA border routers must set the E-bit in the Type-1 router-LSAs of their directly attached non-stub areas, even when they are not translating. This allows other NSSA border routers to see their ASBR status across the AS's transit topology. Failure to do so may cause the election algorithm to elect unnecessary translators. Every NSSA border router is a potential translator.",
      "ja": "すべてのNSSAボーダールーターは、翻訳していなくても、直接接続された非スタブ領域のタイプ1ルーターLSAにeビットを設定する必要があります。これにより、他のNSSAボーダールーターは、ASのトランジットトポロジ全体でASBRステータスを確認できます。そうしないと、選挙アルゴリズムが不要な翻訳者を選出する可能性があります。すべてのNSSAボーダールーターは、潜在的な翻訳者です。"
    },
    {
      "indent": 3,
      "text": "An NSSA border router whose NSSA's NSSATranslatorRole is set to Candidate must maintain a list of the NSSA's border routers that are reachable both over the NSSA and as ASBRs over the AS's transit topology. Any change in this list, or to the Nt bit settings of members of this list, causes the NSSA border router to reevaluate its NSSATranslatorState. If there exists another border router in this list whose router-LSA has bit Nt set or who has a higher router ID, then its NSSATranslatorState is disabled. Otherwise its NSSATranslatorState is elected.",
      "ja": "NSSAのNSSASATRASSLATORROLEが候補に設定されているNSSAボーダールーターは、NSSA上およびASのトランジットトポロジの両方でASBRの両方で到達可能なNSSAのボーダールーターのリストを維持する必要があります。このリストの変更、またはこのリストのメンバーのNTビット設定に変更されると、NSSAボーダールーターがNSSATRASSLATORTATEを再評価します。このリストには、ルーター-LSAにビットNTセットがあるか、ルーターIDが高い人がいる別の境界ルーターが存在する場合、そのNSSATRASSLATORTATEは無効になります。それ以外の場合は、そのnssatranslatorStateが選出されます。"
    },
    {
      "indent": 3,
      "text": "An elected translator will continue to perform translation duties until supplanted by a reachable NSSA border router whose Nt bit is set or whose router ID is greater. Such an event may happen when an NSSA router with NSSATranslatorRole set to Always regains border router status, or when a partitioned NSSA becomes whole. If an elected translator determines its services are no longer required, it continues to perform its translation duties for the additional time interval defined by a new area configuration parameter, TranslatorStabilityInterval. This minimizes excessive flushing of translated Type-7 LSAs and provides for a more stable translator transition. The default value for the TranslatorStabilityInterval parameter has been defined as 40 seconds. (See Appendix D.)",
      "ja": "選出された翻訳者は、NTビットが設定されているか、ルーターIDが大きい到達可能なNSSAボーダールーターに取って代わるまで、翻訳業務を継続します。このようなイベントは、NSSATRASSLATORROLEを備えたNSSAルーターが常にボーダールーターのステータスを取り戻すように設定されている場合、またはパーティション化されたNSSAが全体になったときに発生する可能性があります。選出された翻訳者がサービスが不要になったと判断した場合、新しいエリア構成パラメーターであるTransratorStabilityIntervalによって定義された追加の時間間隔に対して翻訳業務を継続し続けます。これにより、翻訳されたタイプ7 LSAの過剰なフラッシングが最小限に抑えられ、より安定した翻訳者の遷移が提供されます。TransratorStabilityIntervalパラメーターのデフォルト値は、40秒として定義されています。（付録Dを参照）"
    },
    {
      "indent": 0,
      "text": "3.2 Translating Type-7 LSAs into Type-5 LSAs",
      "section_title": true,
      "ja": "3.2 タイプ7 LSAをタイプ5 LSAに変換します"
    },
    {
      "indent": 3,
      "text": "This step is performed as part of the NSSA's Dijkstra calculation after Type-5 and Type-7 routes have been calculated. If the calculating router is currently not an NSSA border router translator, then this translation algorithm should be skipped. Only installed Type-7 LSAs and those non-default Type-7 LSAs originated by the router itself should be examined. Locally sourced Type-7 LSAs should be processed first.",
      "ja": "このステップは、タイプ5およびタイプ7のルートが計算された後のNSSAのDijkstra計算の一部として実行されます。計算ルーターが現在NSSAボーダールーター翻訳者ではない場合、この翻訳アルゴリズムをスキップする必要があります。インストールされたタイプ7 LSAと、ルーター自体によって由来する非デフォルトタイプ7 LSAのみを調べる必要があります。地元産のタイプ7 LSAを最初に処理する必要があります。"
    },
    {
      "indent": 3,
      "text": "Note that it is possible for a Type-5 LSA generated by translation to supplant a Type-5 LSA originating from a local OSPF external source. Future reoriginations of the locally sourced Type-5 LSA should be suppressed until the Type-5 LSA generated by translation is flushed.",
      "ja": "翻訳によって生成されたタイプ5 LSAが、ローカルOSPFの外部ソースから発生するタイプ5 LSAに取って代わる可能性があることに注意してください。翻訳によって生成されたタイプ5 LSAが洗い流されるまで、ローカルに調達したタイプ5 LSAの将来の再構成を抑制する必要があります。"
    },
    {
      "indent": 3,
      "text": "A Type-7 LSA and a Type-7 address range best match one another if there does not exist a more specific Type-7 address range that contains the LSA's network. For each eligible Type-7 LSA perform the following:",
      "ja": "LSAのネットワークを含むより具体的なタイプ7アドレス範囲が存在しない場合、タイプ7 LSAとタイプ7アドレス範囲が互いに一致します。適格なタイプ7 LSAごとに次のことを実行します。"
    },
    {
      "indent": 6,
      "text": "(1) If the Type-7 LSA has the P-bit clear, or its forwarding address is set to 0.0.0.0, or the most specific Type-7 address range that subsumes the LSA's network has DoNotAdvertise status, then do nothing with this Type-7 LSA and consider the next one in the list. Otherwise term the LSA as translatable and proceed with step (2).",
      "ja": "(1) Type-7 LSAにPビットクリアがあるか、その転送アドレスが0.0.0.0に設定されている場合、またはLSAのネットワークを包含する最も固有のタイプ7アドレス範囲がドノタバリバート化ステータスを持っている場合、このタイプ7で何もしませんLSAとリストの次のものを検討してください。それ以外の場合は、LSAを翻訳可能と呼び、ステップ（2）を続行します。"
    },
    {
      "indent": 6,
      "text": "(2) If the Type-7 LSA is not contained in any explicitly configured Type-7 address range and the calculating router has the highest router ID amongst NSSA translators that have originated a functionally equivalent Type-5 LSA (i.e. same destination, cost and non-zero forwarding address) and that are reachable over area 0 and the NSSA, then a Type-5 LSA should be generated if there is currently no Type-5 LSA originating from this router corresponding to the Type-7 LSA's network, or there is an existing Type-5 LSA and either it corresponds to a local OSPF external source whose path type and metric is less preferred (see Section 2.5 step (6), parts (b) and (d)), or it doesn't and the Type-5 LSA's path type or cost(s) have changed (See Section 2.5 step (5)) or the forwarding address no longer maps to a translatable Type-7 LSA.",
      "ja": "(2) タイプ7 LSAが明示的に構成されたタイプ7アドレス範囲に含まれておらず、計算ルーターが機能的に同等のタイプ5 LSAを発信したNSSA翻訳者の中で最高のルーターIDを持っている場合（すなわち、同じ宛先、コスト、非ゼロ領域0およびNSSAで到達可能な転送アドレス）およびこれは、現在タイプ7 LSAのネットワークに対応するこのルーターから発信されるタイプ5 LSAがない場合、または既存のタイプ5 LSAが現在ない場合は、タイプ5 LSAを生成する必要があります。タイプ5 LSAおよびそれは、パスタイプとメトリックがあまり好ましくないローカルOSPF外部ソースに対応します（セクション2.5ステップ（6）、パーツ（b）および（d）を参照）、またはそれはそうではありません。5 LSAのパスタイプまたはコストが変更されました（セクション2.5ステップ（5）を参照）、または転送アドレスが翻訳可能なタイプ7 LSAにマッピングされなくなりました。"
    },
    {
      "indent": 10,
      "text": "The newly originated Type-5 LSA will describe the same network and have the same network mask, path type, metric, forwarding address and external route tag as the Type-7 LSA. The advertising router field will be the router ID of this NSSA border router. The link-state ID is equal to the LSA's network address (in the case of multiple originations of Type-5 LSAs with the same network address but different mask, the link-state ID can also have one or more of the network's \"host\" bits set).",
      "ja": "新しく起源のタイプ5 LSAは、同じネットワークを記述し、タイプ7 LSAと同じネットワークマスク、パスタイプ、メトリック、転送アドレス、外部ルートタグを持っています。広告ルーターフィールドは、このNSSAボーダールーターのルーターIDになります。リンク状態IDは、LSAのネットワークアドレスに等しくなります（同じネットワークアドレスを持つタイプ5 LSAの複数のオリジネーションの場合、マスクは異なる場合、リンク状態IDには1つ以上のネットワークの「ホスト」を持つこともできます。ビットセット）。"
    },
    {
      "indent": 6,
      "text": "(3) Else the Type-7 LSA must be aggregated by the most specific Type-7 address range that subsumes it. If this Type-7 address range has the same [address,mask] pair as the LSA's network and no other translatable Type-7 LSA with a different network best matches this range, then flag the LSA as not contained in any explicitly configured Type-7 address range and process the LSA as described in step (2). Otherwise compute the path type and metric for this Type-7 address range as described below.",
      "ja": "(3) それ以外の場合、タイプ7 LSAは、それを包含する最も特定のタイプ7アドレス範囲によって集約する必要があります。このType-7アドレス範囲がLSAのネットワークと同じ[アドレス、マスク]ペアがあり、この範囲が異なるネットワークのベストマッチを持つ他の翻訳可能なタイプ7 LSAがない場合、明示的に構成されたタイプに含まれていないLSAにフラグを立てます-7ステップ（2）で説明されているように、LSAを処理し、処理します。それ以下で説明するように、このタイプ7アドレス範囲のパスタイプとメトリックを計算します。"
    },
    {
      "indent": 10,
      "text": "The path type and metric of the Type-7 address range is determined from the path types and metrics of those translatable Type-7 LSAs that best match the range plus any locally sourced Type-5 LSAs whose network has the same [address,mask] pair. If any of these LSAs have a path type of 2, the range's path type is 2, otherwise it is 1. If the range's path type is 1 its metric is the highest cost amongst these LSAs; if the range's path type is 2 its metric is the highest Type-2 cost + 1 amongst these LSAs. (See Section 2.5 step (5).) 1 is added to the Type-2 cost to ensure that the translated Type-5 LSA does not appear closer on the NSSA border than a translatable Type-7 LSA whose network has the same [address,mask] pair and Type-2 cost.",
      "ja": "タイプ7アドレス範囲のパスタイプとメトリックは、ネットワークが同じ[アドレス、マスク]を持っている範囲に最適な翻訳可能なタイプ7 LSAのパスタイプとメトリックから決定されます。ペア。これらのLSAのいずれかがパスタイプ2の場合、範囲のパスタイプは2です。それ以外の場合は1です。範囲のパスタイプが1の場合、そのメトリックはこれらのLSAの中で最も高いコストです。範囲のパスタイプが2の場合、そのメトリックは、これらのLSAの中で最も高いタイプ2コスト1です。（セクション2.5ステップ（5）を参照してください。）1はタイプ2コストに追加され、翻訳されたタイプ5 LSAがネットワークを持っている翻訳可能なタイプ7 LSAよりもNSSAボーダーに近づかないようにします[アドレス[アドレス、マスク]ペアとタイプ2のコスト。"
    },
    {
      "indent": 10,
      "text": "A Type-5 LSA is generated from the Type-7 address range when there is currently no Type-5 LSA originated by this router whose network has the same [address,mask] pair as the range or there is but either its path type or metric has changed or its forwarding address is non-zero.",
      "ja": "タイプ5 LSAは、ネットワークが範囲と同じ[アドレス、マスク]ペアを持っているこのルーターが現在そのパスタイプまたはそのパスタイプまたはそのいずれかを持っているこのルーターから発信されたタイプ5 LSAが現在存在しない場合に、タイプ7アドレス範囲から生成されます。メトリックが変更されたか、転送アドレスがゼロではありません。"
    },
    {
      "indent": 10,
      "text": "The newly generated Type-5 LSA will have a link-state ID equal to the Type-7 address range's address (in the case of multiple originations of Type-5 LSAs with the same network address but different mask, the link-state ID can also have one or more of the range's \"host\" bits set). The advertising router field will be the router ID of this area border router. The network mask and the external route tag are set to the range's configured values. The forwarding address is set to 0.0.0.0. The path type and metric are set to the range's path type and metric as defined and computed above.",
      "ja": "新しく生成されたタイプ5 LSAは、タイプ7アドレス範囲のアドレスに等しいリンク状態のIDを持ちます（同じネットワークアドレスを持つタイプ5 LSAの複数の起源の場合、異なるマスク、リンク状態IDはまた、範囲の「ホスト」ビットセットの1つ以上があります）。広告ルーターフィールドは、このエリアボーダールーターのルーターIDになります。ネットワークマスクと外部ルートタグは、範囲の構成値に設定されます。転送アドレスは0.0.0.0に設定されています。パスタイプとメトリックは、上記で定義および計算された範囲のパスタイプとメトリックに設定されます。"
    },
    {
      "indent": 10,
      "text": "The pending processing of other translation eligible Type-7 LSAs that best match this Type-7 address range is suppressed. Thus at most a single Type-5 LSA is originated for each Type-7 address range.",
      "ja": "このタイプ7アドレス範囲に最もよく一致する他の翻訳の適格なタイプ7 LSAの保留中の処理は抑制されます。したがって、せいぜい、タイプ7のアドレス範囲ごとに1つのタイプ5 LSAが発生します。"
    },
    {
      "indent": 3,
      "text": "For example, given a Type-7 address range of [10.0.0.0, 255.0.0.0] that subsumes the following Type-7 routes:",
      "ja": "たとえば、[10.0.0.0、255.0.0.0]のタイプ7アドレス範囲が与えられた場合、次のタイプ7ルートを包みます。"
    },
    {
      "indent": 17,
      "text": "10.1.0.0/24 path type 1, cost 10 10.2.0.0/24 path type 1, cost 11 10.3.0.0/24 path type 2, type 2 cost 5",
      "ja": "10.1.0.0/24パスタイプ1、コスト10 10.2.0.0/24パスタイプ1、コスト11 10.3.0.0/24パスタイプ2、タイプ2コスト5"
    },
    {
      "indent": 3,
      "text": "a Type-5 LSA would be generated with a path type of 2 and a metric 6.",
      "ja": "タイプ5 LSAは、パスタイプ2とメトリック6で生成されます。"
    },
    {
      "indent": 3,
      "text": "Given a Type-7 address range of [10.0.0.0, 255.0.0.0] that subsumes the following Type-7 routes:",
      "ja": "次のタイプ7ルートを包含する[10.0.0.0、255.0.0.0]のタイプ7アドレス範囲が与えられます。"
    },
    {
      "indent": 17,
      "text": "10.1.0.0/24 path type 1, cost 10 10.2.0.0/24 path type 1, cost 11 10.3.0.0/24 path type 1, cost 5",
      "ja": "10.1.0.0/24パスタイプ1、コスト10 10.2.0.0/24パスタイプ1、コスト11 10.3.0.0/24パスタイプ1、コスト5"
    },
    {
      "indent": 3,
      "text": "a Type-5 LSA will be generated with a path type of 1 and a metric 11.",
      "ja": "タイプ5 LSAは、パスタイプ1とメトリック11で生成されます。"
    },
    {
      "indent": 3,
      "text": "These Type-7 address range metric and path type rules will avoid routing loops in the event that path types 1 and 2 are both used within the area.",
      "ja": "これらのタイプ7アドレス範囲メトリックおよびパスタイプルールは、パスタイプ1と2が両方ともエリア内で使用されている場合のルーティングループを回避します。"
    },
    {
      "indent": 3,
      "text": "As with all newly originated Type-5 LSAs, a Type-5 LSA that is the result of a Type-7 LSA translation or aggregation is flooded to all attached Type-5 capable areas.",
      "ja": "新しく起源がすべて新しく発生したタイプ5 LSAと同様に、タイプ7 LSAの翻訳または集約の結果であるタイプ5 LSAは、付着したすべてのタイプ5対応領域に浸水します。"
    },
    {
      "indent": 3,
      "text": "Like Type-3 address ranges, a Type-7 address range performs the dual function of setting propagation policy via its Advertise/DoNotAdvertise parameter and aggregation via its network address and mask pair. Unlike the origination of Type-3 summary-LSAs, the translation of a Type-7 LSA into a Type-5 LSA may result in more efficient routing when the forwarding address is set, as is done during step (2) of the translation procedure.",
      "ja": "タイプ3アドレスの範囲と同様に、タイプ7アドレス範囲は、その広告/donotAdvertiseパラメーターとネットワークアドレスとマスクペアを介して、プロパゲーションポリシーを設定する二重関数を実行します。Type-3 Summary-LSAの発信とは異なり、タイプ7 LSAのタイプ5 LSAへの変換により、転送アドレスが設定されている場合、翻訳手順のステップ（2）で行われるように、より効率的なルーティングが発生する可能性があります。。"
    },
    {
      "indent": 3,
      "text": "Another important feature of this translation process is that it allows a Type-7 address range to apply different properties (aggregation, forwarding address, and Advertise/DoNotAdvertise status) for the Type-7 routes it subsumes, versus those Type-7 routes subsumed by other more specific Type-7 address ranges contained in the Type-7 address range.",
      "ja": "この翻訳プロセスのもう1つの重要な機能は、タイプ7アドレスの範囲が、それが付着するタイプ7ルートに異なるプロパティ（集約、転送アドレス、および広告/donotAdvertiseステータス）を適用できることです。タイプ7アドレス範囲に含まれるその他のより具体的なタイプ7アドレス範囲。"
    },
    {
      "indent": 0,
      "text": "3.3 Flushing Translated Type-7 LSAs",
      "section_title": true,
      "ja": "3.3 フラッシング翻訳されたタイプ7 LSA"
    },
    {
      "indent": 3,
      "text": "If an NSSA border router has either translated or aggregated an installed Type-7 LSA into a Type-5 LSA that should no longer be translated or aggregated, then the Type-5 LSA should either be flushed or reoriginated as a translation or aggregation of other Type-7 LSAs.",
      "ja": "NSSAボーダールーターが、インストールされたタイプ7 LSAを翻訳または凝集させないタイプ5 LSAに翻訳または集約した場合、タイプ5 LSAは、他の翻訳または凝集としてフラッシュまたは再び再生される必要があります。タイプ7 LSA。"
    },
    {
      "indent": 3,
      "text": "If an NSSA border router is translating Type-7 LSA's into Type-5 LSA's with NSSATranslatorState set to elected and the NSSA border router has determined that its translator election status has been deposed by another NSSA border router (see Section 3.1), then, as soon as the TranslatorStabilityInterval has expired without the router reelecting itself as a translator, Type-5 LSAs that are generated by aggregating Type-7 LSAs into their best matched Type-7 address ranges (see Section 3.2, Step (3)) are flushed. Conversely Type-5 LSAs generated by translating Type-7 LSAs are not immediately flushed, but are allowed to remain in the OSPF routing domain as if the originator is still an elected translator. This minimizes the flushing and flooding impact on the transit topology of an NSSA that changes its translators frequently.",
      "ja": "NSSAボーダールーターがタイプ7 LSAをタイプ5 LSAに翻訳している場合、NSSATRASSLATORSTATEが選出され、NSSAボーダールーターは、翻訳者の選挙状況が別のNSSAボーダールーターによって退位したと判断しました（セクション3.1を参照）、次に、そうです。翻訳者Stability Intervalがルーターが翻訳者としての再エレクトを再エレクトすることなく期限切れになるとすぐに、タイプ7 LSAを最も一致するタイプ7アドレス範囲に集約することによって生成されるタイプ5 LSASがフラッシュされます（セクション3.2、ステップ（3）を参照）。逆に、タイプ7 LSAを翻訳することによって生成されたタイプ5 LSAはすぐにフラッシュされませんが、オリジネーターがまだ選出された翻訳者であるかのようにOSPFルーティングドメインにとどまることができます。これにより、翻訳者が頻繁に変化するNSSAの輸送トポロジに対するフラッシングと洪水の影響が最小限に抑えられます。"
    },
    {
      "indent": 0,
      "text": "4.0 Security Considerations",
      "section_title": true,
      "ja": "4.0 セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "There are two types of issues that need be addressed when looking at protecting routing protocols from misconfigurations and malicious attacks. The first is authentication and certification of routing protocol information. The second is denial of service attacks resulting from repetitive origination of the same router advertisement or origination of a large number of distinct advertisements resulting in database overflow. Note that both of these concerns exist independently of a router's support for the NSSA option.",
      "ja": "誤った攻撃や悪意のある攻撃からルーティングプロトコルを保護することを検討する際に対処する必要がある2種類の問題があります。1つ目は、ルーティングプロトコル情報の認証と認証です。2つ目は、同じルーター広告の繰り返しのオリジネーションまたは多数の異なる広告の起源に起因するサービス攻撃の拒否です。これらの懸念は両方とも、NSSAオプションに対するルーターのサポートとは独立して存在することに注意してください。"
    },
    {
      "indent": 3,
      "text": "The OSPF protocol addresses authentication concerns by authenticating OSPF protocol exchanges. OSPF supports multiple types of authentication; the type of authentication in use can be configured on a per network segment basis. One of OSPF's authentication types, namely the Cryptographic authentication option, is believed to be secure against passive attacks and provides significant protection against active attacks. When using the Cryptographic authentication option, each router appends a \"message digest\" to its transmitted OSPF packets. Receivers then use the shared secret key and the received digest to verify that each received OSPF packet is authentic.",
      "ja": "OSPFプロトコルは、OSPFプロトコル交換を認証することにより、認証の懸念に対処します。OSPFは、複数のタイプの認証をサポートしています。使用中の認証のタイプは、ネットワークセグメントごとに構成できます。OSPFの認証タイプの1つ、つまり暗号化認証オプションは、パッシブ攻撃に対して安全であると考えられており、積極的な攻撃に対して大きな保護を提供します。暗号化認証オプションを使用する場合、各ルーターは、送信されたOSPFパケットに「メッセージダイジェスト」を追加します。その後、レシーバーは共有シークレットキーと受信したダイジェストを使用して、受信した各OSPFパケットが本物であることを確認します。"
    },
    {
      "indent": 3,
      "text": "The quality of the security provided by the Cryptographic authentication option depends completely on the strength of the message digest algorithm (MD5 is currently the only message digest algorithm specified), the strength of the key being used, and the correct implementation of the security mechanism in all communicating OSPF implementations. It also requires that all parties maintain the secrecy of the shared secret key. None of the standard OSPF authentication types provide confidentiality, nor do they protect against traffic analysis. For more information on the standard OSPF security mechanisms, see Sections 8.1, 8.2, and Appendix D of [OSPF].",
      "ja": "暗号化認証オプションによって提供されるセキュリティの品質は、メッセージダイジェストアルゴリズムの強度（MD5は現在指定されている唯一のメッセージダイジェストアルゴリズムです）、使用されているキーの強度、およびセキュリティメカニズムの正しい実装に完全に依存します。すべての通信OSPF実装。また、すべての当事者が共有された秘密鍵の秘密を維持することを要求しています。標準的なOSPF認証タイプのいずれも、機密性を提供するものではなく、トラフィック分析から保護することもありません。標準のOSPFセキュリティメカニズムの詳細については、[OSPF]のセクション8.1、8.2、および付録Dを参照してください。"
    },
    {
      "indent": 3,
      "text": "[DIGI] describes the extensions to OSPF required to add digital signature authentication to Link State data and to provide a certification mechanism for router data. [DIGI] also describes the added LSA processing and key management as well as a method for migration from or co-existence with standard OSPF V2.",
      "ja": "[DIGI]は、状態データをリンクし、ルーターデータの認証メカニズムを提供するためにデジタル署名認証を追加するために必要なOSPFへの拡張を説明しています。[DIGI]は、追加されたLSA処理と主要な管理、および標準のOSPF V2からの移行または共存の方法についても説明しています。"
    },
    {
      "indent": 3,
      "text": "OSPF addresses repetitive origination of advertisements by mandating a limit on how frequent new instances of any particular LSA can be originated and accepted during the flooding procedure. The frequency at which new LSA instances may be originated is set to once every MinLSInterval seconds, whose value is 5 seconds. (See [OSPF] Section 12.4.) The frequency at which new LSA instances are accepted during flooding is once every MinLSArrival seconds, whose value is set to 1 second. (See [OSPF] Section 13, Appendix B, and G.1.)",
      "ja": "OSPFは、洪水手順中に特定のLSAの新しいインスタンスを発信および受け入れることができる頻度の制限を義務付けることにより、広告の繰り返しの起源に対処します。新しいLSAインスタンスが発信される頻度は、5秒であるMinlsinterval秒ごとに1回設定されます。（[OSPF]セクション12.4を参照）。洪水時に新しいLSAインスタンスが受け入れられる頻度は、1秒に設定されたMinlSarrival秒ごとに1回です。（[OSPF]セクション13、付録B、およびG.1を参照してください。）"
    },
    {
      "indent": 3,
      "text": "Proper operation of the OSPF protocol requires that all OSPF routers maintain an identical copy of the OSPF link state database. However, when the size of the link state database becomes very large, some routers may be unable to keep the entire database due to resource shortages; this is termed \"database overflow\". When database overflow is anticipated, the routers with limited resources can be accommodated by configuring OSPF stub areas and NSSAs. [OVERFLOW] details a way of gracefully handling unanticipated database overflows.",
      "ja": "OSPFプロトコルの適切な操作では、すべてのOSPFルーターがOSPFリンク状態データベースの同一のコピーを維持する必要があります。ただし、リンク状態データベースのサイズが非常に大きくなると、リソース不足のためにデータベース全体を維持できない場合があります。これは「データベースオーバーフロー」と呼ばれます。データベースオーバーフローが予想される場合、OSPFスタブエリアとNSSAを構成することにより、リソースが限られているルーターに対応できます。[Overflow]は、予期しないデータベースオーバーフローを優雅に処理する方法を詳述しています。"
    },
    {
      "indent": 0,
      "text": "5.0 Acknowledgements",
      "section_title": true,
      "ja": "5.0 謝辞"
    },
    {
      "indent": 3,
      "text": "This document was produced by the OSPF Working Group, chaired by John Moy.",
      "ja": "この文書は、John Moyが議長を務めるOSPFワーキンググループによって作成されました。"
    },
    {
      "indent": 3,
      "text": "In addition, the comments of the following individuals are also acknowledged:",
      "ja": "さらに、次の個人のコメントも認められています。"
    },
    {
      "indent": 6,
      "text": "Antoni Przygienda Redback Networks, Inc Alex Zinin cisco",
      "ja": "Antoni Przygienda Redback Networks、Inc Alex Zinin Cisco"
    },
    {
      "indent": 3,
      "text": "It is also noted that comments from",
      "ja": "また、そのコメントも注目されています"
    },
    {
      "indent": 6,
      "text": "Phani Jajjarvarpu cisco Dino Farinacci cisco Jeff Honig Cornell University Doug Williams IBM",
      "ja": "Phani Jajjarvarpu Cisco Dino Farinacci Cisco Jeff Honig Cornell University Doug Williams IBM"
    },
    {
      "indent": 3,
      "text": "were acknowledged in the predecessor of this document, RFC 1587.",
      "ja": "このドキュメントの前身であるRFC 1587で認められました。"
    },
    {
      "indent": 0,
      "text": "6.0 Contributors",
      "section_title": true,
      "ja": "6.0 貢献者"
    },
    {
      "indent": 3,
      "text": "This document, RFC 3101, adds new sections, features, edits, and revisions to its predecessor, RFC 1587, \"The OSPF NSSA Option\", authored by Rob Coltun, Movaz Networks, and Vince Fuller. Content from RFC 1587 is used throughout RFC 3101. In addition to adding new features, this document makes the NSSA specification consistent with the OSPFv2 specification, RFC 2328, authored by John Moy, Sycamore Networks, Inc. Section 2.5, Calculating Type-7 AS External Routes, and Section 2.6, Incremental Updates, rely heavily on text in RFC 2328's Section 16.4 and Section 16.6 respectively. Section 4.0, Security Considerations, is an edit of similar content in Rob Coltun's RFC 2370, \"The OSPF Opaque LSA option\", Section 6.0.",
      "ja": "このドキュメントであるRFC 3101は、新しいセクション、機能、編集、およびリビジョンを前身のRFC 1587、「OSPF NSSAオプション」に追加し、Rob Coltun、Movaz Networks、およびVince Fullerが作成しました。RFC 1587のコンテンツはRFC 3101を通じて使用されます。新しい機能の追加に加えて、このドキュメントにより、NSSA仕様はOSPFV2仕様であるRFC 2328と一致しています。外部ルート、およびセクション2.6、インクリメンタル更新は、それぞれRFC 2328のセクション16.4およびセクション16.6のテキストに大きく依存しています。セクション4.0、セキュリティに関する考慮事項は、Rob ColtunのRFC 2370、「OSPF Opaque LSAオプション」、セクション6.0の同様のコンテンツの編集です。"
    },
    {
      "indent": 3,
      "text": "Acee Lindem, Redback Networks, Inc, is also recognized for the first full known implementation of this specification. Acee's implementation resulted in substantive content change.",
      "ja": "Redback Networks、IncのAcee Lindemは、この仕様の最初の完全な実装でも認識されています。ACEEの実装は、実質的なコンテンツの変更をもたらしました。"
    },
    {
      "indent": 0,
      "text": "7.0 References",
      "section_title": true,
      "ja": "7.0 参考文献"
    },
    {
      "indent": 3,
      "text": "[DIGI] Murphy, S., Badger, M. and B. Wellington, \"OSPF with Digital Signatures\", RFC 2154, June 1997.",
      "ja": "[Digi] Murphy、S.、Badger、M。and B. Wellington、「Digital Signatures with Digital Signatures」、RFC 2154、1997年6月。"
    },
    {
      "indent": 3,
      "text": "[MUEX] Moy, J., \"Multicast Extensions to OSPF\", RFC 1584, March 1994.",
      "ja": "[Muex] Moy、J。、「OSPFへのマルチキャスト拡張」、RFC 1584、1994年3月。"
    },
    {
      "indent": 3,
      "text": "[OSPF] Moy, J., \"OSPF Version 2\", RFC 2328, April 1998.",
      "ja": "[OSPF] Moy、J。、「OSPFバージョン2」、RFC 2328、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[OPAQUE] Coltun, R., \"The OSPF Opaque LSA Option\", RFC 2370, July 1998.",
      "ja": "[Opaque] Coltun、R。、「OSPF Opaque LSAオプション」、RFC 2370、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[OVERFLOW] Moy, J., \"OSPF Database Overflow\", RFC 1765, March 1995.",
      "ja": "[オーバーフロー] Moy、J。、「OSPFデータベースオーバーフロー」、RFC 1765、1995年3月。"
    },
    {
      "indent": 0,
      "text": "Appendix A: The Options Field",
      "ja": "付録A：オプションフィールド"
    },
    {
      "indent": 3,
      "text": "The OSPF options field is present in OSPF Hello packets, Database Description packets and all link state advertisements. See [OSPF] Appendix A.2 and [OPAQUE] Appendix A.1 for a description of the options field. Six bits are assigned but only two (the E-bit and the N/P bit) are described completely in this section.",
      "ja": "OSPFオプションフィールドは、OSPFハローパケット、データベースの説明パケット、およびすべてのリンク状態広告に存在します。オプションフィールドの説明については、[OSPF]付録A.2および[不透明]付録A.1を参照してください。このセクションでは、6ビットが割り当てられていますが、2つのビット（EビットとN/Pビット）のみが完全に説明されています。"
    },
    {
      "indent": 18,
      "text": "--------------------------------------\n| * | O | DC | EA | N/P | MC | E | * |\n--------------------------------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 22,
      "text": "The Type-7 LSA options field",
      "ja": "タイプ7 LSAオプションフィールド"
    },
    {
      "indent": 6,
      "text": "E-bit: Type-5 AS-external-LSAs are not flooded into/through OSPF stub areas and NSSAs. The E-bit ensures that all members of a stub area or NSSA agree on that area configuration. The E-bit is meaningful only in OSPF Hello and Database Description packets. When the E-bit is clear in the Hello packet sent out a particular interface, it means that the router will neither send nor receive Type-5 AS-external-LSAs on that interface (in other words, the interface connects to a stub area or NSSA). Two routers will not become neighbors unless they agree on the state of the E-bit.",
      "ja": "e-bit：タイプ5 As-External-LSAは、OSPFスタブエリアおよびNSSAに浸水していません。eビットは、スタブエリアまたはNSSAのすべてのメンバーがそのエリア構成に同意することを保証します。e-bitは、OSPF Hello and Database説明パケットでのみ意味があります。Hello Packetで特定のインターフェイスを送信してEBITがクリアされている場合、ルーターはそのインターフェイスでタイプ5 AS-External-LSAを送信または受信しないことを意味します（言い換えれば、インターフェイスはスタブエリアに接続しますまたはNSSA）。2つのルーターがeビットの状態に同意しない限り、2つのルーターは隣人になりません。"
    },
    {
      "indent": 6,
      "text": "N-bit: The N-bit describes the router's NSSA capability. The N-bit is used only in Hello packets and ensures that all members of an NSSA agree on that area's configuration. When the N-bit is set in the Hello packet that is sent out a particular interface, it means that the router will send and receive Type-7 LSAs on that interface. Two routers will not form an adjacency unless they agree on the state of the N-bit. If the N-bit is set in the options field, the E-bit must be clear.",
      "ja": "Nビット：N-BITは、ルーターのNSSA機能について説明しています。N-BITはHello Packetsでのみ使用され、NSSAのすべてのメンバーがそのエリアの構成に同意することを保証します。N-BITが特定のインターフェイスを送信されるハローパケットに設定されている場合、ルーターがそのインターフェイスでタイプ7 LSAを送信および受信することを意味します。2つのルーターがNビットの状態に同意しない限り、隣接を形成しません。n-bitがオプションフィールドに設定されている場合、eビットは明確でなければなりません。"
    },
    {
      "indent": 6,
      "text": "P-bit: The P-bit is used only in the Type-7 LSA header. It flags the NSSA border router to translate the Type-7 LSA into a Type-5 LSA. The default setting for the P-bit is clear.",
      "ja": "Pビット：Pビットは、タイプ7 LSAヘッダーでのみ使用されます。NSSAボーダールーターにフラグを付けて、タイプ7 LSAをタイプ5 LSAに変換します。Pビットのデフォルト設定は明確です。"
    },
    {
      "indent": 0,
      "text": "Appendix B: Router-LSAs",
      "ja": "付録B：ルーター-LSA"
    },
    {
      "indent": 3,
      "text": "Router-LSAs are the Type-1 LSAs. Each router in an area originates a router-LSA. The LSA describes the state and cost of the router's links (i.e., interfaces) to the area. All of the router's links to the area must be described in a single router-LSA. For details concerning the construction of router-LSAs, see [OSPF] Section 12.4.1.",
      "ja": "ルーター-LSAはタイプ1 LSAです。エリア内の各ルーターは、ルーター-LSAを採用します。LSAは、ルーターのリンク（つまり、インターフェイス）の状態とコストをエリアに説明します。エリアへのルーターのすべてのリンクは、単一のルーターLSAで説明する必要があります。ルーターLSAの構築に関する詳細については、[OSPF]セクション12.4.1を参照してください。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            LS age             |     Options   |       1       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Link State ID                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Advertising Router                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     LS sequence number                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         LS checksum           |             length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  0  Nt|W|V|E|B|        0      |            # links            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Link ID                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Link Data                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     # TOS     |        TOS 0 metric           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      TOS      |        0      |            metric             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      TOS      |        0      |            metric             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Link ID                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Link Data                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In router-LSAs, the Link State ID field is set to the router's OSPF Router ID. Router-LSAs are flooded throughout a single area only.",
      "ja": "Router-LSAでは、リンク状態IDフィールドがルーターのOSPFルーターIDに設定されています。ルーター-LSAは、単一の領域のみで浸水しています。"
    },
    {
      "indent": 6,
      "text": "bit V When set, the router is an endpoint of one or more fully adjacent virtual links having the described area as their transit area (V is for virtual link endpoint).",
      "ja": "ビットvセットすると、ルーターは、記述された領域を通過領域として1つ以上の完全に隣接する仮想リンクのエンドポイントです（Vは仮想リンクエンドポイント用）。"
    },
    {
      "indent": 6,
      "text": "bit E When set, the router is an AS boundary router (E is for external). ALL NSSA border routers set bit E in those router-LSAs originated into directly attached Type-5 capable areas. An NSSA's AS boundary routers also set bit E in their router-LSAs originated into the NSSA. (See Section 3.1 for details.)",
      "ja": "ビットEセットすると、ルーターは境界ルーターです（Eは外部用です）。すべてのNSSAボーダールーターは、それらのルーターLSAでビットEを設定し、直接接続されたタイプ5の有能な領域に由来します。NSSAのAS境界ルーターは、NSSAに由来するルーターLSAにビットEを設定します。（詳細については、セクション3.1を参照してください。）"
    },
    {
      "indent": 6,
      "text": "bit B When set, the router is an area border router (B is for border).",
      "ja": "ビットBセットすると、ルーターはエリアボーダールーターです（Bは境界用です）。"
    },
    {
      "indent": 6,
      "text": "bit W When set, the router is a wild-card multicast receiver (W is for wild).",
      "ja": "ビットwセットすると、ルーターはワイルドカードマルチキャストレシーバーです（Wはワイルド用です）。"
    },
    {
      "indent": 6,
      "text": "bit Nt When set, the router is an NSSA border router that is unconditionally translating Type-7 LSAs into Type-5 LSAs (Nt stands for NSSA translation). Note that such routers have their NSSATranslatorRole area configuration parameter set to Always. (See Appendix D and Section 3.1.)",
      "ja": "ビットNTセットすると、ルーターはNSSAボーダールーターであり、タイプ7 LSAをタイプ5 LSAに無条件に翻訳しています（NTはNSSA翻訳の略）。このようなルーターには、NSSSATRASRASLATORROLE AREAの構成パラメーターが常に設定されていることに注意してください。（付録Dおよびセクション3.1を参照してください。）"
    },
    {
      "indent": 3,
      "text": "The remainder of the router-LSAs specification is defined in [OSPF] Section A.4.2.",
      "ja": "ルーター-LSAS仕様の残りの部分は、[OSPF]セクションA.4.2で定義されています。"
    },
    {
      "indent": 0,
      "text": "Appendix C: Type-7 LSA Packet Format",
      "ja": "付録C：タイプ7 LSAパケット形式"
    },
    {
      "indent": 8,
      "text": "0                                 32\n------------------------------------\n|                | Options |   7   |\n|                -------------------\n|        Link-State Header         |\n|                                  |\n------------------------------------\n| Network Mask                     |\n------------------------------------  ______\n|E| TOS  |        metric           |  .\n------------------------------------  .  repeated for each TOS\n| Forwarding Address               |  .\n------------------------------------  .\n| External Route Tag               |  ______\n------------------------------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The definitions of the link-state ID, network mask, metrics and external route tag are the same as the definitions for Type-5 LSAs (See [OSPF] Appendix A.4.5), except for the forwarding address and the N/P-bit. The Options field must have the N/P bit set as described in Appendix A when the originating router desires that the external route be propagated throughout the OSPF domain.",
      "ja": "リンク状態ID、ネットワークマスク、メトリック、および外部ルートタグの定義は、転送アドレスとN/P-を除き、タイプ5 LSAの定義（[OSPF]付録A.4.5を参照）と同じです。少し。オプションフィールドには、付録Aで説明されているようにN/Pビットが設定されている必要があります。出発ルーターがOSPFドメイン全体に外部ルートを伝播することを望んでいる場合。"
    },
    {
      "indent": 3,
      "text": "Forwarding address Data traffic for the advertised destination will be forwarded to this address. If the forwarding address is set to 0.0.0.0, data traffic will be forwarded to the LSA's originator (i.e., the responsible NSSA AS boundary router). Normally the next hop address of an installed AS external route learned by an NSSA ASBR from an adjacent AS points at one of the adjacent AS's gateway routers. If this address belongs to a network connected to the NSSA ASBR via one of its NSSAs' active interfaces, then it is the forwarding address for the route's Type-7 LSA originated into this NSSA. For an NSSA with no such network the forwarding address is either an address from one of its active interfaces or 0.0.0.0. If the P-bit is set, the forwarding address must be non-zero, otherwise it may be 0.0.0.0. (See Section 2.3 for details.)",
      "ja": "広告された宛先のフォワーディングアドレスデータトラフィックは、このアドレスに転送されます。転送アドレスが0.0.0.0に設定されている場合、データトラフィックはLSAのオリジネーター（つまり、境界ルーターとして責任あるNSSA）に転送されます。通常、隣接するASのゲートウェイルーターの1つでポイントとして隣接するNSSA ASBRによって学習された外部ルートとしてインストールされた次のホップアドレス。このアドレスがNSSAのアクティブインターフェイスの1つを介してNSSA ASBRに接続されたネットワークに属している場合、これはこのNSSAに由来するルートのタイプ7 LSAの転送アドレスです。そのようなネットワークを持たないNSSAの場合、転送アドレスは、そのアクティブなインターフェイスのいずれかのアドレスまたは0.0.0.0のいずれかです。Pビットが設定されている場合、転送アドレスはゼロ以外でなければなりません。それ以外の場合は0.0.0.0である場合があります。（詳細については、セクション2.3を参照してください。）"
    },
    {
      "indent": 0,
      "text": "Appendix D: Configuration Parameters",
      "ja": "付録D：構成パラメーター"
    },
    {
      "indent": 3,
      "text": "[OSPF] Appendix C.2 lists the area configuration parameters. The area ID and the list of address ranges for Type-3 summary routes remain unchanged. Section 2.2 of this document lists the configuration parameters for Type-7 address ranges. The following area configuration parameters have been added:",
      "ja": "[OSPF]付録C.2には、エリア構成パラメーターを示します。エリアIDとタイプ3の要約ルートのアドレス範囲のリストは、変更されていません。このドキュメントのセクション2.2には、タイプ7アドレス範囲の構成パラメーターをリストします。次の領域構成パラメーターが追加されました："
    },
    {
      "indent": 6,
      "text": "NSSATranslatorRole",
      "ja": "nssatranslatorrole"
    },
    {
      "indent": 9,
      "text": "Specifies whether or not an NSSA border router will unconditionally translate Type-7 LSAs into Type-5 LSAs. When it is set to Always, an NSSA border router always translates Type-7 LSAs into Type-5 LSAs regardless of the translator state of other NSSA border routers. When it is set to Candidate, an NSSA border router participates in the translator election process described in Section 3.1. The default setting is Candidate.",
      "ja": "NSSAボーダールーターがタイプ7 LSAを無条件にタイプ5 LSAに変換するかどうかを指定します。常に設定されている場合、NSSAボーダールーターは、他のNSSAボーダールーターの翻訳状態に関係なく、常にタイプ7 LSAをタイプ5 LSAに変換します。候補に設定されると、NSSAボーダールーターがセクション3.1で説明されている翻訳者選挙プロセスに参加します。デフォルト設定は候補です。"
    },
    {
      "indent": 6,
      "text": "TranslatorStabilityInterval",
      "ja": "TransratorStabilityInterval"
    },
    {
      "indent": 9,
      "text": "Defines the length of time an elected Type-7 translator will continue to perform its translator duties once it has determined that its translator status has been deposed by another NSSA border router translator as described in Section 3.1 and 3.3. The default setting is 40 seconds.",
      "ja": "セクション3.1および3.3で説明されているように、翻訳者のステータスが別のNSSAボーダールーター翻訳者によって退位されていると判断した場合、選出されたタイプ7翻訳者が翻訳者の職務を継続し続ける時間の長さを定義します。デフォルト設定は40秒です。"
    },
    {
      "indent": 6,
      "text": "ImportSummaries",
      "ja": "インポートサマリ"
    },
    {
      "indent": 9,
      "text": "When set to enabled, OSPF's summary routes are imported into the NSSA as Type-3 summary-LSAs. When set to disabled, summary routes are not imported into the NSSA. The default setting is enabled.",
      "ja": "有効になるように設定すると、OSPFの要約ルートは、タイプ3サマリLSAとしてNSSAにインポートされます。無効に設定すると、略式ルートはNSSAにインポートされません。デフォルト設定が有効になっています。"
    },
    {
      "indent": 3,
      "text": "Implementations must provide a vehicle for setting the P-bit when external routes are imported into the NSSA as Type-7 LSAs. Without configuration, the default setting of the P-bit is clear. (See Section 2.3 and Appendix B.)",
      "ja": "実装は、外部ルートがタイプ7 LSAとしてNSSAにインポートされたときにPビットを設定するための手段を提供する必要があります。構成がなければ、Pビットのデフォルト設定は明確です。（セクション2.3および付録Bを参照してください。）"
    },
    {
      "indent": 3,
      "text": "For NSSAs the ExternalRoutingCapability area configuration parameter must be set to accept Type-7 external routes. Additionally there must be a way of configuring the metric of the default LSA that a border router advertises into its directly attached NSSAs. If a Type-7 default LSA is advertised, its metric type (1 or 2) should also be configurable.",
      "ja": "NSSAの場合、外部ルーティングキャピールエリア構成パラメーターは、タイプ7の外部ルートを受け入れるように設定する必要があります。さらに、ボーダールーターが直接接続されたNSSAに宣伝するデフォルトのLSAのメトリックを構成する方法がなければなりません。Type-7デフォルトのLSAが宣伝されている場合、そのメトリックタイプ（1または2）も設定可能である必要があります。"
    },
    {
      "indent": 0,
      "text": "Appendix E: The P-bit Policy Paradox.",
      "ja": "付録E：Pビットポリシーパラドックス。"
    },
    {
      "indent": 3,
      "text": "Non-default Type-7 LSAs with the P-bit clear may be installed in the OSPF routing table of NSSA border routers. (See Section 2.5.) These LSAs are not propagated throughout the OSPF domain as translated Type-5 LSAs. (See Section 3.2.) Thus, traffic that is external to an NSSA and that passes through one of the NSSA's border routers may be hijacked into the NSSA by a route installed from a Type-7 LSA with the P-bit clear. This may be contrary to the expected path at the source of the traffic. It may also violate the routing policy intended by the Type-7 LSA's clear P-bit. A Type-7 address range that is configured with DoNotAdvertise exhibits the same paradox for any installed Type-7 LSAs it subsumes, regardless of the P-bit setting.",
      "ja": "Pビットクリアを備えた非デフォルトタイプ-7 LSAは、NSSAボーダールーターのOSPFルーティングテーブルに取り付けられる場合があります。（セクション2.5を参照してください。）これらのLSAは、翻訳されたタイプ5 LSAとしてOSPFドメイン全体に伝播されません。（セクション3.2を参照してください。）したがって、NSSAの外部であり、NSSAのボーダールーターの1つを通過するトラフィックは、Pビットクリアでタイプ7 LSAから設置されたルートによってNSSAにハイジャックされる場合があります。これは、トラフィックのソースでの予想されるパスに反している可能性があります。また、Type-7 LSAのクリアPビットによって意図されたルーティングポリシーに違反する場合があります。DonotAdvertiseで構成されたタイプ7アドレス範囲は、Pビット設定に関係なく、インストールされているタイプ7 LSAが包むのと同じパラドックスを示します。"
    },
    {
      "indent": 3,
      "text": "This paradox is best illustrated by the following example. Consider an OSPF domain (AS 1842) with connections for default Internet routing and to external AS 4156. NSSA 1 and OSPF Area 2 are partially defined in the following diagram:",
      "ja": "このパラドックスは、次の例で最もよく示されています。デフォルトのインターネットルーティングと4156の外部への接続を備えたOSPFドメイン（AS 1842）を検討してください。NSSA1およびOSPFエリア2は、次の図で部分的に定義されています。"
    },
    {
      "indent": 9,
      "text": "                     AS 4156\n                       |\n   Area 2              |\n                       |\n     A2                A0   Area 0      C0-----Internet\n     |                 |                |      Default\n     |                 |                |\n     |                 |                |\n     +-----------------B0---------------+\n                       /\\\n                      /  \\\n                     /    \\\nInternet------------A1    B1------AS 4156 (P-bit clear)\nDefault (P-bit set)\n                        NSSA 1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Here A0, B0, and C0 are Area 0 routers, A1 and B1 are NSSA 1 routers, and A2 is an Area 2 router. B0 is a border router for both NSSA 1 and Area 2.",
      "ja": "ここでは、A0、B0、およびC0はエリア0ルーター、A1とB1はNSSA 1ルーター、A2はエリア2ルーターです。B0は、NSSA 1とエリア2の両方のボーダールーターです。"
    },
    {
      "indent": 3,
      "text": "If the Type-7 external routes imported by B1 for AS 4156 are installed on B0 so that the NSSA 1 tree below A1 can take advantage of them, then A2's traffic to AS 4156 is hijacked through B0 by B1, rather than its computed path through A0.",
      "ja": "AS 4156のB1によってインポートされたタイプ7の外部ルートがB0にインストールされているため、A1未満のNSSA 1ツリーがそれらを利用できるようにする場合、A2のAS 4156へのトラフィックは、計算されたパスを通過するのではなく、B1によってB0でハイジャックされます。A0。"
    },
    {
      "indent": 3,
      "text": "An NSSA border router's installed Type-7 default LSAs will exhibit this paradox when it possesses a Type-7 address range [0,0] configured with DoNotAdvertise, as these LSAs are not propagated even though their P-bit is set. In the example above, if A1's default is installed on B0, which has a configured Type-7 address range [0,0] with DoNotAdvertise set, then A2's Internet traffic is hijacked through B0 by A1 rather than the computed path through C0.",
      "ja": "NSSAボーダールーターのインストールされているタイプ7デフォルトLSAは、P-BITが設定されていても伝播されないため、DonotAdvertiseで構成されたタイプ7アドレス範囲[0,0]を所有すると、このパラドックスを示します。上記の例では、A1のデフォルトがB0にインストールされている場合、donotAdvertiseセットを備えた設定されたタイプ7アドレス範囲[0,0]を備えた場合、A2のインターネットトラフィックは、C0を介した計算パスではなく、A1によってB0を介してハイジャックされます。"
    },
    {
      "indent": 0,
      "text": "Appendix F: Differences from RFC 1587",
      "ja": "付録F：RFC 1587との違い"
    },
    {
      "indent": 3,
      "text": "This section documents the differences between this memo and RFC 1587. All differences are backward-compatible. Implementations of this memo and of RFC 1587 will interoperate.",
      "ja": "このセクションでは、このメモとRFC 1587の違いを文書化します。すべての違いは後方互換性があります。このメモとRFC 1587の実装は相互運用します。"
    },
    {
      "indent": 0,
      "text": "F.1 Enhancements to the import of OSPF's summary routes.",
      "ja": "F.1 OSPFの要約ルートのインポートの拡張。"
    },
    {
      "indent": 3,
      "text": "The import of OSPF's summary routes into an NSSA as Type-3 summary-LSAs is now optional. In RFC 1587 the import of summary routes was mandated in order to guarantee that inter-area summary routing was not obscured by an NSSA's Type-7 AS-external-LSAs. The current recommended default behavior is to import summary routes. When summary routes are not imported into an NSSA, the default LSA originated by its border routers must be a Type-3 summary-LSA.",
      "ja": "Type-3の要約LSAとしてのOSPFの概要をNSSAにインポートすることは、オプションになりました。RFC 1587では、NSSAのType-7 As-External-LSAによってエリア間概要ルーティングが不明瞭になっていないことを保証するために、要約ルートの輸入が義務付けられました。現在の推奨されるデフォルトの動作は、要約ルートをインポートすることです。概要ルートがNSSAにインポートされていない場合、境界線ルーターから発信されるデフォルトのLSAは、タイプ3サマリLSAでなければなりません。"
    },
    {
      "indent": 3,
      "text": "See Sections 1.3 and 2.7 for details.",
      "ja": "詳細については、セクション1.3および2.7を参照してください。"
    },
    {
      "indent": 0,
      "text": "F.2 Changes to Type-7 LSAs.",
      "ja": "F.2タイプ7 LSAの変更。"
    },
    {
      "indent": 3,
      "text": "The setting of the forwarding address in Type-7 LSAs has been further refined.",
      "ja": "タイプ7 LSAの転送アドレスの設定はさらに洗練されています。"
    },
    {
      "indent": 3,
      "text": "See Section 2.3 for details.",
      "ja": "詳細については、セクション2.3を参照してください。"
    },
    {
      "indent": 0,
      "text": "F.3 Changes to the Type-7 AS external routing calculation.",
      "ja": "F.3は、外部ルーティングの計算としてタイプ7に変更されます。"
    },
    {
      "indent": 3,
      "text": "The Type-7 external route calculation has been revised. Most notably:",
      "ja": "タイプ7の外部ルートの計算が改訂されました。最も注目すべき："
    },
    {
      "indent": 6,
      "text": "o The path preference defined in [OSPF] Section 16.4.1 has been included.",
      "ja": "o [OSPF]セクション16.4.1で定義されているパス選好が含まれています。"
    },
    {
      "indent": 6,
      "text": "o A Type-7 default route with the P-bit clear will not be installed on an NSSA border router. This protects the default routing of other OSPF Areas. (See Appendix E.)",
      "ja": "o Pビットクリアを備えたタイプ7デフォルトルートは、NSSAボーダールーターにはインストールされません。これにより、他のOSPF領域のデフォルトルーティングが保護されます。（付録Eを参照）"
    },
    {
      "indent": 6,
      "text": "o The LSA type of two AS-external-LSAs plays no role in determining path preference except when the LSAs are functionally the same (i.e., same destination, cost and non-zero forwarding address).",
      "ja": "o 2つの外部LSAのLSAタイプは、LSAが機能的に同じである場合を除き、パスの好みを決定する上で役割を果たしません（つまり、同じ宛先、コスト、非ゼロ転送アドレス）。"
    },
    {
      "indent": 3,
      "text": "See Section 2.5 for details.",
      "ja": "詳細については、セクション2.5を参照してください。"
    },
    {
      "indent": 0,
      "text": "F.4 Changes to translating Type-7 LSAs into Type-5 LSAs",
      "section_title": true,
      "ja": "F.4タイプ7 LSAをタイプ5 LSAに変換することへの変更"
    },
    {
      "indent": 3,
      "text": "The translator election algorithm of RFC 1587 has been updated to close a bug that results when the translator with the highest router ID loses connectivity to the AS's transit topology. The default translator election process occurs only in the absence of an existing translator.",
      "ja": "RFC 1587の翻訳者選挙アルゴリズムは、最高のルーターIDを持つ翻訳者がASのトランジットトポロジーへの接続性を失ったときに生じるバグを閉じるために更新されました。デフォルトの翻訳者選挙プロセスは、既存の翻訳者がいない場合にのみ発生します。"
    },
    {
      "indent": 3,
      "text": "The identity of the translator is optionally configurable, with more than one allowed. This allows the network designer to choose the most cost effective intra-AS route for NSSA originated Type-5 LSA aggregations of Type-7 LSAs.",
      "ja": "翻訳者の身元はオプションで構成可能であり、複数の許可されています。これにより、ネットワーク設計者は、NSSA起源のタイプ5 LSA凝集の最も費用対効果の高いROSEを選択することができます。"
    },
    {
      "indent": 3,
      "text": "Self-originated non-default Type-7 LSAs are now included in the translation process.",
      "ja": "現在、自己編成された非デフォルトタイプ-7 LSAが翻訳プロセスに含まれています。"
    },
    {
      "indent": 3,
      "text": "The translation process has been strengthened to close some of the weak points of RFC 1587.",
      "ja": "翻訳プロセスは、RFC 1587の弱点のいくつかを閉じるために強化されました。"
    },
    {
      "indent": 3,
      "text": "See Sections 3.1 and 3.2 for details.",
      "ja": "詳細については、セクション3.1および3.2を参照してください。"
    },
    {
      "indent": 0,
      "text": "F.5 Changes to flushing translated Type-7 LSAs",
      "section_title": true,
      "ja": "F.5翻訳された型型7 LSAのフラッシュへの変更"
    },
    {
      "indent": 3,
      "text": "An NSSA border router, which was elected by the augmented RFC 1587 translator selection process defined in Section 3.1 and which has been deposed from its translation duties by another NSSA border router, flushes its self-originated Type-5 LSAs that resulted from the aggregation of Type-7 LSAs. This prevents these obsolete aggregations from short circuiting the preferred path through the new translator(s). A deposed translator continues to maintain its self-originated Type-5 LSAs resulting from translation until they age out normally.",
      "ja": "セクション3.1で定義された拡張RFC 1587翻訳者選択プロセスによって選出されたNSSAボーダールーターは、別のNSSA Borderルーターによって翻訳業務から退位したため、自己主導化されたタイプ5 LSAをフラッシュします。タイプ7 LSA。これにより、これらの時代遅れの集計が、新しい翻訳者を通る優先パスを短絡することを防ぎます。退位した翻訳者は、翻訳に起因する自己陽性のタイプ5LSAを維持し続けています。"
    },
    {
      "indent": 3,
      "text": "See Section 3.3 for details.",
      "ja": "詳細については、セクション3.3を参照してください。"
    },
    {
      "indent": 0,
      "text": "F.6 P-bit additions",
      "section_title": true,
      "ja": "F.6 P-BIT追加"
    },
    {
      "indent": 3,
      "text": "The P-bit default has been defined as clear. RFC 1587 had no default setting. (See Appendix C.)",
      "ja": "Pビットのデフォルトは明確であると定義されています。RFC 1587にはデフォルト設定がありませんでした。（付録Cを参照）"
    },
    {
      "indent": 3,
      "text": "A discussion on the packet forwarding impact of installing Type-7 LSAs with the P-bit clear on NSSA border routers has been added as Appendix E.",
      "ja": "NSSAボーダールーターのP-BITクリアでタイプ7 LSAをインストールすることのパケット転送の影響に関する議論は、付録Eとして追加されました。"
    },
    {
      "indent": 0,
      "text": "Author's Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Pat Murphy US Geological Survey 345 Middlefield Road Menlo Park, California 94560",
      "ja": "パットマーフィーUS地質調査345ミドルフィールドロードメンロパーク、カリフォルニア94560"
    },
    {
      "indent": 3,
      "text": "Phone: (650) 329-4044 EMail: pmurphy@noc.usgs.net",
      "ja": "電話：（650）329-4044メール：pmurphy@noc.usgs.net"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}