{
  "title": {
    "text": "RFC 3572 - Internet Protocol Version 6 over MAPOS (Multiple Access Protocol Over SONET/SDH)",
    "ja": "RFC 3572 - MAPOSオーバーインターネットプロトコルバージョン6（SONET / SDHを介して複数のアクセスプロトコル）"
  },
  "number": 3572,
  "created_at": "2019-10-19 18:37:45.565810+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           T. Ogura\nRequest for Comments: 3572                                   M. Maruyama\nCategory: Informational                      NTT Network Innovation Labs\n                                                              T. Yoshida\n                                                      Werk Mikro Systems\n                                                               July 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": " Internet Protocol Version 6 over MAPOS\n(Multiple Access Protocol Over SONET/SDH)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "IESG Note",
      "ja": "IESG注意"
    },
    {
      "indent": 3,
      "text": "This memo documents a way of carrying IPv6 packets over MAPOS networks. This document is NOT the product of an IETF working group nor is it a standards track document. It has not necessarily benefited from the widespread and in-depth community review that standards track documents receive.",
      "ja": "このメモはMAPOSネットワーク上でIPv6パケットを運ぶ方法を説明します。この文書は、IETFワーキンググループの製品ではありませんまた、それは、標準トラック文書です。それは必ずしも標準トラック文書が受け取ることに広範かつ徹底的なコミュニティレビューの恩恵を受けていません。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Multiple Access Protocol over SONET/SDH (MAPOS) is a high-speed link-layer protocol that provides multiple access capability over a Synchronous Optical NETwork/Synchronous Digital Hierarchy (SONET/SDH).",
      "ja": "SONET / SDH（MAPOS）の上に複数のアクセスプロトコルは、同期光ネットワーク/同期デジタル階層（SONET / SDH）を介して複数のアクセス機能を提供する高速リンク層プロトコルです。"
    },
    {
      "indent": 3,
      "text": "This document specifies the frame format for encapsulating an IPv6 datagram in a MAPOS frame. It also specifies the method of forming IPv6 interface identifiers, the method of detecting duplicate addresses, and the format of the Source/Target Link-layer Addresses option field used in IPv6 Neighbor Discovery messages.",
      "ja": "この文書はMAPOSフレームでIPv6データグラムをカプセル化するためのフレームフォーマットを指定します。また、IPv6インタフェース識別子を形成する方法、重複アドレスを検出する方法、およびIPv6近隣探索メッセージで使用されるソース/ターゲットリンク層アドレスオプションフィールドの形式を指定します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Frame Format for Encapsulating IPv6 Datagrams. . . . . . . . .  3\n    2.1.  Frame Format . . . . . . . . . . . . . . . . . . . . . .  3\n    2.2.  Maximum Transmission Unit (MTU). . . . . . . . . . . . .  3\n    2.3.  Destination Address Mapping. . . . . . . . . . . . . . .  4\n          2.3.1.  Unicast. . . . . . . . . . . . . . . . . . . . .  4\n         2.3.2.  Multicast . . . . . . . . . . . . . . . . . . . .  4\n3.  Interface Identifier . . . . . . . . . . . . . . . . . . . . .  6\n4.  Duplicate Address Detection. . . . . . . . . . . . . . . . . .  8\n5.  Source/Target Link-layer Address Option. . . . . . . . . . . .  9\n6.  Security Considerations. . . . . . . . . . . . . . . . . . . . 10\n    6.1.  Issues concerning Link-layer Addresses . . . . . . . . . 10\n          6.1.1.  Protection against fraudulent reception\n                  of traffic . . . . . . . . . . . . . . . . . . . 10\n          6.1.2.  Protection against improper traffic. . . . . . . 11\n    6.2.  Uniqueness of Interface Identifiers. . . . . . . . . . . 11\n7.  References. . . .  . . . . . . . . . . . . . . . . . . . . . . 12\n8.  Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . 13\n9.  Full Copyright Statement . . . . . . . . . . . . . . . . . . . 14",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Multiple Access Protocol over SONET/SDH (MAPOS) [1][2] is a high-speed link-layer protocol that provides multiple access capability over SONET/SDH. Its frame format is based on the HDLC-like (High Level Data Link Control) framing [3] for PPP. A component called a \"Frame Switch\" [1] allows multiple nodes (hosts and routers) to be connected together in a star topology to form a LAN. Using long-haul SONET/SDH links, the nodes on such a \"SONET-LAN\" can span a wide geographical area.",
      "ja": "SONET / SDH（MAPOS）の上に複数のアクセスプロトコル[1] [2] SONET / SDH上で複数のアクセス機能を提供する高速リンク層プロトコルです。そのフレームフォーマットは、PPP用HDLCのような（ハイレベルデータリンク制御）フレーミング[3]に基づいています。 「フレームスイッチ」と呼ばれる成分[1]複数のノード（ホストおよびルータ）はLANを形成するために、スタートポロジで互いに接続されることを可能にします。長距離SONET / SDHリンクを使用して、そのような「SONET-LAN」上のノードは、地理的に広いエリアにまたがることができます。"
    },
    {
      "indent": 3,
      "text": "This document specifies the frame format for encapsulating an Internet Protocol version 6 (IPv6) [4] datagram in a MAPOS frame, the method of forming IPv6 interface identifiers, the method of detecting duplicate addresses, and the format of the Source/Target Link-layer Addresses option field used in Neighbor Discovery messages such as Router Solicitation, Router Advertisement, Neighbor Solicitation, Neighbor Advertisement, and Redirect messages.",
      "ja": "この文書はMAPOSフレーム、IPv6インタフェース識別子を形成する方法であって、重複アドレス検出方法、及びソース/ターゲット・リンク - の形式でインターネットプロトコルバージョン6（IPv6）[4]データグラムをカプセル化するためのフレームフォーマットを指定しますそのようなルータ要請、ルーターアドバタイズ、近隣要請、近隣広告など近隣探索メッセージで使用されるレイヤアドレスオプションフィールド、およびメッセージをリダイレクトします。"
    },
    {
      "indent": 3,
      "text": "In the remainder of this document, the term \"MAPOS\" is used unless the distinction between MAPOS version 1 [1] and MAPOS 16 [2] is required.",
      "ja": "MAPOSバージョン1との違いは、[1]とMAPOS 16 [2]は要求されない限り、この文書の残りでは、用語「MAPOS」が使用されます。"
    },
    {
      "indent": 0,
      "text": "2. Frame Format for Encapsulating IPv6 Datagrams",
      "section_title": true,
      "ja": "カプセル化IPv6のデータグラムのための2フレーム形式"
    },
    {
      "indent": 0,
      "text": "2.1. Frame Format",
      "section_title": true,
      "ja": "2.1. フレーム形式"
    },
    {
      "indent": 3,
      "text": "MAPOS uses the same HDLC-like framing as PPP-over-SONET, described in [3]. The MAPOS frame begins and ends with a flag sequence 01111110 (0x7E), and the MAPOS frame header contains address, control, and protocol fields. The address field contains a destination HDLC address. In MAPOS 16, the address field is extended to 16 bits, and the control field of MAPOS version 1 is omitted. The frame check sequence (FCS) field is 16 bits long by default, but a 32-bit FCS may be used optionally. Details of the MAPOS frame format are described in [1][2].",
      "ja": "MAPOS [3]に記載のPPPオーバーSONET、同じHDLC様のフレーミングを使用します。 MAPOSフレームが開始されフラグシーケンス01111110（0x7Eを）で終了し、そしてMAPOSフレームヘッダは、アドレス、制御、およびプロトコルフィールドを含みます。アドレスフィールドは、宛先HDLCアドレスが含まれています。 MAPOS 16において、アドレスフィールドは16ビットに拡張され、MAPOSバージョン1の制御フィールドは省略されます。フレームチェックシーケンス（FCS）フィールドは、デフォルトでは16ビット長であるが、32ビットのFCSは、必要に応じて使用することができます。 MAPOSフレームフォーマットの詳細については、[1]に記載されている[2]。"
    },
    {
      "indent": 3,
      "text": "An IPv6 datagram is encapsulated in the MAPOS frame. In the case of encapsulating an IPv6 datagram, the protocol field must contain the value 0x0057 (hexadecimal). The IPv6 datagram is stored in the information field which follows immediately after the protocol field. That is, this field contains the IPv6 header followed immediately by the payload. Figure 1 shows the frame format. The fields are transmitted from left to right.",
      "ja": "IPv6データグラムはMAPOSフレームにカプセル化されています。 IPv6データグラムをカプセル化する場合には、プロトコルフィールドは、値0x0057（16進数）を含んでいなければなりません。 IPv6データグラムは、プロトコルフィールドの直後に続く情報フィールドに格納されています。つまり、このフィールドは、IPv6ヘッダはペイロードの直後含ま。図1は、フレームフォーマットを示します。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": "+----------+----------+----------+----------+\n|          |          | Control/ | Protocol |\n|   Flag   | Address  | Address  |  16 bits |\n| 01111110 |  8 bits  |  8 bits  | (0x0057) |\n+----------+----------+----------+----------+\n   +-------------+------------+----------+-----------\n   |             |            |          | Inter-frame\n   | IPv6 header |    FCS     |   Flag   | fill or next\n   | and payload | 16/32 bits | 01111110 | address\n   +-------------+------------+----------+------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 20,
      "text": "Figure 1. Frame format.",
      "ja": "図1.フレームフォーマット。"
    },
    {
      "indent": 0,
      "text": "2.2. Maximum Transmission Unit (MTU)",
      "section_title": true,
      "ja": "2.2. 最大転送単位（MTU）"
    },
    {
      "indent": 3,
      "text": "The length of the information field of the MAPOS frame may vary, but shall not exceed 65,280 (64K - 256) octets [1][2]. The default maximum transmission unit (MTU) is 65,280 octets.",
      "ja": "MAPOSフレームの情報フィールドの長さは変動し得るが、65280を超えてはならない（64K  -  256）オクテットを[1] [2]。デフォルトの最大伝送単位（MTU）が65280オクテットです。"
    },
    {
      "indent": 3,
      "text": "However, the MTU size may be reduced by a Router Advertisement [5] containing an MTU option that specifies a smaller MTU, or by manual configuration of each node. If a Router Advertisement received on a MAPOS interface has an MTU option specifying an MTU larger than 65,280, or larger than a manually configured value, that MTU option may be logged for the system management but must be otherwise ignored.",
      "ja": "しかし、MTUサイズは、[5]に小さいMTUを指定するMTUオプションを含む、または各ノードの手動設定によって、ルータ広告によって減少させることができます。ルータ広告はMAPOSインタフェース上で受信したMTUオプションは、システム管理のために記録されることができるが、そうでない場合、無視されなければならないことは、手動で設定された値よりも65,280より大きい、またはより大きなMTUを指定するMTUオプションを有しています。"
    },
    {
      "indent": 0,
      "text": "2.3. Destination Address Mapping",
      "section_title": true,
      "ja": "2.3. 宛先アドレスのマッピング"
    },
    {
      "indent": 3,
      "text": "This section specifies the method of mapping an IPv6 destination address to the address field in the MAPOS frame header.",
      "ja": "このセクションでは、MAPOSフレームヘッダのアドレスフィールドにIPv6宛先アドレスをマッピングする方法を指定します。"
    },
    {
      "indent": 0,
      "text": "2.3.1. Unicast",
      "section_title": true,
      "ja": "2.3.1. ユニキャスト"
    },
    {
      "indent": 3,
      "text": "In unicasting, the address field of a MAPOS frame contains the HDLC address that has been assigned via NSP (Node Switch Protocol) [6] to the MAPOS interface, which has the IPv6 unicast destination address.",
      "ja": "ユニキャストでは、MAPOSフレームのアドレス・フィールドがNSP（ノードスイッチプロトコル）を介して割り当てられたHDLCアドレスを含む[6] IPv6ユニキャスト宛先アドレスを持つMAPOSインタフェースに関する。"
    },
    {
      "indent": 3,
      "text": "In order to determine the destination HDLC address that corresponds to an IPv6 unicast destination address, the sender uses Link-layer Address Resolution described in [5].",
      "ja": "IPv6ユニキャスト宛先アドレスに対応する宛先HDLCアドレスを決定するために、送信者は、[5]に記載のリンク層アドレス解決を使用します。"
    },
    {
      "indent": 0,
      "text": "2.3.2. Multicast",
      "section_title": true,
      "ja": "2.3.2. マルチキャスト"
    },
    {
      "indent": 3,
      "text": "Address resolution is never performed on IPv6 multicast addresses. An IPv6 multicast destination address is mapped to the address field in the MAPOS frame header as described below for MAPOS version 1 and MAPOS 16.",
      "ja": "アドレス解決は、IPv6マルチキャストアドレス上で実行されることはありません。 MAPOSバージョン1とMAPOS 16について以下に説明するように、IPv6マルチキャスト宛先アドレスがMAPOSフレームヘッダのアドレスフィールドにマッピングされます。"
    },
    {
      "indent": 3,
      "text": "MAPOS version 1:",
      "ja": "MAPOSバージョン1："
    },
    {
      "indent": 3,
      "text": "The address field of the MAPOS version 1 frame header contains an 8- bit-wide destination HDLC address [1]. The least significant bit (LSB) of the field must always be 1 to indicate the end of the field. The most significant bit (MSB) is used to indicate whether the frame is a unicast or a multicast frame.",
      "ja": "MAPOSバージョン1フレームヘッダのアドレスフィールドは、8ビット幅の宛先HDLCアドレスが含まれている[1]。フィールドの最下位ビット（LSB）は常にフィールドの終わりを示すために1でなければなりません。最上位ビット（MSB）はフレームがユニキャストまたはマルチキャストフレームであるかどうかを示すために使用されます。"
    },
    {
      "indent": 3,
      "text": "In the case of an IPv6 multicast, the MSB of the address field is 1 to indicate that the frame is multicast. As described above, the LSB of the address field is 1. The other six bits of the address field must contain the lowest-order six bits of the IPv6 multicast address. Figure 2 shows the address field of the MAPOS version 1 frame header in the case of an IPv6 multicast, where D(1) through D(6) represent the lowest-order six bits of the IPv6 multicast address. Exceptions arise when these six bits are either all zeros or all ones. In these cases, they should be altered to the bit sequence 111110. That is, the address field should be 0xFD (hexadecimal).",
      "ja": "IPv6マルチキャストの場合には、アドレスフィールドのMSBは、フレームがマルチキャストであることを示すために1です。上述したように、アドレスフィールドのLSBアドレスフィールドの1他の6ビットは、IPv6マルチキャストアドレスの最下位6ビットが含まれている必要があります。図2は、D（1）からD（6）が最下位にIPv6マルチキャストアドレスの6ビットを表すのIPv6マルチキャストの場合にMAPOSバージョン1フレームヘッダのアドレスフィールドを示しています。これらの6つのビットがすべてゼロ、またはすべてのもののどちらかであるとき、例外が発生します。これらの場合において、それらはあるビット列111110.に変更しなければならない、アドレスフィールドが0xFDで（16進数）であるべきです。"
    },
    {
      "indent": 22,
      "text": "MSB           LSB\n+-+-+-+-+-+-+-+-+\n| |           | |\n|1|D(6) - D(1)|1|\n| |           | |\n+-+-+-+-+-+-+-+-+\n ^             ^\n |             |\n |             EA bit (always 1)\n 1 (multicast)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Figure 2. Address mapping in multicasting (MAPOS version 1).",
      "ja": "マルチキャストにおける図2のアドレスマッピング（MAPOSバージョン1）。"
    },
    {
      "indent": 3,
      "text": "MAPOS 16:",
      "ja": "MAPOS 16："
    },
    {
      "indent": 3,
      "text": "The address field of the MAPOS 16 frame header contains the 16-bit-wide destination HDLC address [2]. The LSB of the first octet must always be 0 to indicate the continuation of this field, and the LSB of the second octet must always be 1 to indicate the end of this field. The MSB of the first octet is used to indicate whether the frame is a unicast or a multicast frame.",
      "ja": "MAPOS 16フレームヘッダのアドレスフィールドは、16ビット幅の宛先HDLCアドレスが含まれている[2]。最初のオクテットのLSB常にこの分野の継続を示すために0でなければならず、LSB第2オクテットの常にこのフィールドの終わりを示すために1でなければなりません。最初のオクテットのMSBはフレームがユニキャストまたはマルチキャストフレームであるかどうかを示すために使用されます。"
    },
    {
      "indent": 3,
      "text": "In the case of an IPv6 multicast, the MSB of the first octet is 1 to indicate that the frame is multicast. As described above, the LSB of the first octet is 0 and the LSB of the second octet is 1. The other 13 bits of the address field must contain the lowest-order 13 bits of the IPv6 multicast address. Figure 3 shows the address field of the MAPOS 16 frame header in the case of an IPv6 multicast, where D(1) through D(13) represent the lowest-order 13 bits of the IPv6 multicast address. Exceptions arise when these 13 bits are either all zeros or all ones. In these cases, the address field should be 0xFEFD (hexadecimal).",
      "ja": "IPv6マルチキャストの場合には、最初のオクテットのMSBは、フレームがマルチキャストであることを示すために1です。上述したように、最初のオクテットのLSBが0であり、LSB第2オクテットのアドレスフィールドの1他の13ビットがIPv6マルチキャストアドレスの最下位13ビットを含む必要があります。図3は、Dは、（1）D（13）を介して最下位にIPv6マルチキャストアドレスの13ビットを表すのIPv6マルチキャストの場合にMAPOS 16フレームヘッダのアドレスフィールドを示しています。これらの13ビットがすべて0またはすべてのもののいずれかであるときに例外が発生します。これらのケースでは、アドレスフィールドは0xFEFD（16進数）であるべきです。"
    },
    {
      "indent": 10,
      "text": "MSB                           LSB\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| |           | |             | |\n|1|D(13)-D(8) |0|  D(7)-D(1)  |1|\n| |           | |             | |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n ^             ^               ^\n |             |               |\n |             |               +-- EA bit (always 1)\n |             +-- EA bit (always 0)\n 1 (multicast)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Figure 3. Address mapping in multicasting (MAPOS 16).",
      "ja": "マルチキャストにおける図3アドレスマッピング（MAPOS 16）。"
    },
    {
      "indent": 0,
      "text": "3. Interface Identifier",
      "section_title": true,
      "ja": "3.インタフェース識別子"
    },
    {
      "indent": 3,
      "text": "This section specifies the method of forming the interface identifier [7].",
      "ja": "このセクションでは、インタフェース識別子[7]を形成する方法を指定します。"
    },
    {
      "indent": 3,
      "text": "A node that has one or more MAPOS interfaces must create one or more EUI-64 [8] based interface identifiers. Here, it should be noted that deriving interface identifiers from HDLC addresses of MAPOS interfaces is undesirable for the following reasons.",
      "ja": "一つ以上のMAPOSインタフェースを有するノードは、1つまたは複数のEUI-64 [8]ベースのインタフェース識別子を作成する必要があります。ここで、MAPOSインタフェースのHDLCアドレスからインタフェース識別子を導出すると、次の理由で望ましくないことに留意すべきです。"
    },
    {
      "indent": 3,
      "text": "1. When a node is connected to a frame switch, an HDLC address is assigned to the interface of the node from the frame switch via NSP [6]. (In the remainder of this document, the term \"MAPOS address\" is used to refer to the address.) The value of the MAPOS address assigned to the interface depends on the combination of the switch number of the frame switch and the port number of the frame switch to which the interface is connected. The switch number is required to be unique only within a MAPOS multi-switch environment [6]; that is, there can be frame switches that have the same switch number in different MAPOS multi-switch environment separated by IP routers. Therefore, the uniqueness of a MAPOS address is guaranteed only within a MAPOS multi-switch environment.",
      "ja": "1.ノードがフレームスイッチに接続されている場合、HDLCアドレスはNSPを介してフレームスイッチからノードのインタフェースに割り当てられている[6]。 （この文書の残りでは、用語「MAPOSアドレスが」アドレスを参照するために使用されている。）インターフェイスに割り当てられMAPOSアドレスの値は、フレームスイッチのスイッチ番号とポート番号の組み合わせに依存しますインターフェイスが接続されているフレームスイッチ。スイッチの数は、MAPOSマルチスイッチ環境内で一意であることが必要である[6]。すなわち、IPルータによって分離された異なるMAPOSマルチスイッチ環境で同じスイッチ番号を有するフレームスイッチが存在することが可能です。したがって、MAPOSアドレスの一意性は、唯一のMAPOSマルチスイッチ環境内で保証されています。"
    },
    {
      "indent": 6,
      "text": "Furthermore, if an implementation ensures that the link between the interface of the node and the port of the frame switch is hot-swappable, the port number of the frame switch or the frame switch connected to the interface of the node can be changed, so the MAPOS address assigned to the interface can also be changed without performing a system re-start of the node.",
      "ja": "さらに、実装は、ノードのインタフェースと、フレームスイッチのポートの間のリンクは、ホットスワップ可能であり、フレームスイッチのポート番号またはノードのインタフェースに接続されたフレームのスイッチがので、変更することができることを確実にする場合インターフェイスに割り当てられたMAPOSアドレスは、ノードのシステムの再起動を行うことなく変更することができます。"
    },
    {
      "indent": 6,
      "text": "In short, the global uniqueness of a MAPOS address is not guaranteed, and a MAPOS address is not a built-in address but can be changed without performing a system re-start. Thus, if an interface identifier were derived from a MAPOS address, it could also be changed without a system re-start. This would not follow the recommendation in [7].",
      "ja": "要するに、MAPOSアドレスのグローバル一意性が保証されていない、とMAPOSアドレスは、内蔵のアドレスではなく、システムの再起動を実行することなく変更することができます。インターフェース識別子がMAPOSアドレスから導出された場合にこのように、それはまた、システムを再起動することなく変更することができます。これは、[7]で勧告に従わないでしょう。"
    },
    {
      "indent": 3,
      "text": "2. In the case of a point-to-point connection between two nodes, the same MAPOS address is assigned to each interface. Specifically, in the case of MAPOS version 1, the assigned address is 0x03 [6], and in the case of MAPOS 16, the assigned address is 0x0003 [2]. It is not easy to achieve link-locality of the interface identifier in a strict manner using the same Link-layer address.",
      "ja": "2. 2つのノード間のポイントツーポイント接続の場合には、同一のMAPOSアドレスが各インタフェースに割り当てられています。具体的には、MAPOSバージョン1の場合には、割り当てられたアドレスは0×03 [6]、及びMAPOS 16の場合には、割り当てられたアドレスが0x0003である[2]。同じリンク層アドレスを使用して、厳密な方法で、インタフェース識別子のリンク局所性を達成することは容易ではありません。"
    },
    {
      "indent": 6,
      "text": "For the above reasons, nodes with MAPOS interfaces must not derive their interface identifiers from their MAPOS addresses.",
      "ja": "上記の理由から、MAPOSインタフェースを持つノードは、それらのMAPOSアドレスからそのインターフェース識別子を導出してはなりません。"
    },
    {
      "indent": 6,
      "text": "The following are methods of forming an interface identifier in the order of preference. These are almost the same as the methods described in [9] except that a MAPOS address must not be used as a source of uniqueness when an IEEE global identifier is unavailable.",
      "ja": "次の優先順位にインタフェース識別子を形成する方法です。これらは、ほとんどIEEEグローバル識別子が使用できない場合MAPOSアドレスは一意のソースとして使用されてはならないことを除いて、[9]に記載の方法と同様です。"
    },
    {
      "indent": 3,
      "text": "1) If an IEEE global identifier (EUI-48 or EUI-64) is available anywhere on the node, it should be used to construct the interface identifier due to its uniqueness. When extracting an IEEE global identifier from another device on the node, care should be taken to ensure that the extracted identifier is presented in canonical ordering [10].",
      "ja": "IEEEグローバル識別子（EUI-48またはEUI-64）の任意の場所ノードで利用可能である場合1）、その一意にインタフェース識別子を構築するために使用されるべきです。ノード上の他のデバイスからIEEEグローバル識別子を抽出するとき、注意が抽出された識別子がカノニカルオーダリング[10]に提示されていることを保証するために注意しなければなりません。"
    },
    {
      "indent": 6,
      "text": "The only transformation from an EUI-64 identifier is to invert the \"u\" bit (universal/local bit in IEEE EUI-64 terminology). For example, for a globally unique EUI-64 identifier as shown in Figure 4:",
      "ja": "EUI-64識別子からのみの変換は、「U」ビット（IEEE EUI-64用語ユニバーサル/ローカルビット）を反転することです。例えば、図4に示すように、グローバルに一意なEUI-64識別子のために："
    },
    {
      "indent": 3,
      "text": "MSB                                                               LSB\n|0              1|1              3|3              4|4              6|\n|0              5|6              1|2              7|8              3|\n+----------------+----------------+----------------+----------------+\n|cccccc0gcccccccc|cccccccceeeeeeee|eeeeeeeeeeeeeeee|eeeeeeeeeeeeeeee|\n+----------------+----------------+----------------+----------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "Figure 4. Globally unique EUI-64 identifier.",
      "ja": "図4.グローバルユニークなEUI-64識別子。"
    },
    {
      "indent": 6,
      "text": "where \"c\" are the bits of the assigned company_id, \"0\" is the value of the universal/local bit to indicate global scope, \"g\" is the group/individual bit, and \"e\" are the bits of the extension identifier, the IPv6 interface identifier would be as shown in Figure 5. The only change is inverting the value of the universal/local bit.",
      "ja": "ここで、「C」が付与のcompany_idのビットは、「0」はグローバルスコープを示すために、ユニバーサル/ローカルビットの値であり、「G」拡張識別子のビットは、グループ/個々のビット、および「E」であるれます、IPv6インタフェース識別子としてのみ変化がユニバーサル/ローカルビットの値を反転されて図5に示されるであろう。"
    },
    {
      "indent": 3,
      "text": "MSB                                                               LSB\n|0              1|1              3|3              4|4              6|\n|0              5|6              1|2              7|8              3|\n+----------------+----------------+----------------+----------------+\n|cccccc1gcccccccc|cccccccceeeeeeee|eeeeeeeeeeeeeeee|eeeeeeeeeeeeeeee|\n+----------------+----------------+----------------+----------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Figure 5. IPv6 interface identifier derived from a globally unique EUI-64 identifier.",
      "ja": "グローバルにユニークなEUI-64識別子に由来する、図5のIPv6インタフェース識別子。"
    },
    {
      "indent": 6,
      "text": "In the case of an EUI-48 identifier, it is first converted to the EUI-64 format by inserting two octets, with hexadecimal values of 0xFF and 0xFE, in the middle of the 48-bit MAC (between the company_id and extension-identifier portions of the EUI-48 value).",
      "ja": "EUI-48識別子の場合、第1のcompany_idおよび拡張識別子との間（48ビットMACの途中で、は0xFFと0xFEの16進数の値と、2つのオクテットを挿入することにより、EUI-64フォーマットに変換されEUI-48値の部分）。"
    },
    {
      "indent": 6,
      "text": "For example, for a globally unique 48-bit EUI-48 identifier as shown in Figure 6:",
      "ja": "例えば、図6に示すように、グローバルに一意の48ビットEUI-48識別子のために："
    },
    {
      "indent": 3,
      "text": "MSB                                              LSB\n|0              1|1              3|3              4|\n|0              5|6              1|2              7|\n+----------------+----------------+----------------+\n|cccccc0gcccccccc|cccccccceeeeeeee|eeeeeeeeeeeeeeee|\n+----------------+----------------+----------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "Figure 6. Globally unique EUI-48 identifier.",
      "ja": "図6グローバル一意EUI-48識別子。"
    },
    {
      "indent": 6,
      "text": "where \"c\" are the bits of the assigned company_id, \"0\" is the value of the universal/local bit to indicate global scope, \"g\" is the group/individual bit, and \"e\" are the bits of the extension identifier, the IPv6 interface identifier would be as shown in Figure 7.",
      "ja": "ここで、「C」が付与のcompany_idのビットは、「0」はグローバルスコープを示すために、ユニバーサル/ローカルビットの値であり、「G」拡張識別子のビットは、グループ/個々のビット、および「E」であるれます、IPv6インタフェース識別子として図7に示されるであろう。"
    },
    {
      "indent": 3,
      "text": "MSB                                                               LSB\n|0              1|1              3|3              4|4              6|\n|0              5|6              1|2              7|8              3|\n+----------------+----------------+----------------+----------------+\n|cccccc1gcccccccc|cccccccc11111111|11111110eeeeeeee|eeeeeeeeeeeeeeee|\n+----------------+----------------+----------------+----------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Figure 7. IPv6 interface identifier derived from a globally unique EUI-48 identifier.",
      "ja": "グローバルにユニークなEUI-48識別子に由来図7のIPv6インタフェース識別子。"
    },
    {
      "indent": 3,
      "text": "2) If an IEEE global identifier is not available, a different source of uniqueness should be used. Suggested sources of uniqueness include machine serial numbers, etc. MAPOS addresses must not be used.",
      "ja": "IEEEグローバル識別子を使用できない場合は2）、一意性の異なるソースを使用すべきです。一意の推奨ソースはMAPOSアドレスは使用してはならないマシンのシリアル番号などが含まれます。"
    },
    {
      "indent": 6,
      "text": "In this case, the \"u\" bit of the interface identifier must be set to 0.",
      "ja": "この場合、インタフェース識別子の「U」ビットが0に設定されなければなりません。"
    },
    {
      "indent": 3,
      "text": "3) If a good source of uniqueness cannot be found, it is recommended that a random number be generated. In this case the \"u\" bit of the interface identifier must be set to 0.",
      "ja": "ユニークさの良い情報源を見つけることができない場合は3）、乱数を生成することをお勧めします。この場合、インタフェース識別子の「U」ビットが0に設定されなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Duplicate Address Detection",
      "section_title": true,
      "ja": "4.重複アドレス検出"
    },
    {
      "indent": 3,
      "text": "Immediately after the system start-up, the MAPOS address has not yet been assigned to a MAPOS interface. The assignment is not completed until the adjacent frame switch, or adjacent node in the case of a point-to-point connection between two nodes, has delivered the MAPOS address to the interface via NSP [6]. Until then, no data transmission can be performed on the interface. Thus, a node must conduct duplicate address detection [11] on all unicast addresses of MAPOS interfaces after the MAPOS address assignment has been completed by NSP.",
      "ja": "すぐに、システムの起動後、MAPOSアドレスはまだMAPOSインタフェースに割り当てられていません。割り当てが完了していない2つのノード間のポイントツーポイント接続の場合の隣接フレームのスイッチ、または隣接ノードまで、NSPを介してインターフェイスにMAPOSアドレスを配信している[6]。それまでは、データ伝送インターフェイス上で実行することができません。 MAPOSアドレスの割り当ては、NSPによって完了された後にこのように、ノードは、MAPOSインタフェースのすべてのユニキャストアドレスに対して重複アドレス検出[11]を実施しなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Source/Target Link-layer Address Option",
      "section_title": true,
      "ja": "5.ソース/ターゲットリンク層アドレスオプション"
    },
    {
      "indent": 3,
      "text": "As specified in [5], the Source/Target Link-layer Address option is one of the options included in Neighbor Discovery messages. In [5], the length of the Source/Target Link-layer Address option field is specified in units of 8 octets. However, in the case of MAPOS, the length of the address field is 2 octets (MAPOS 16) or 1 octet (MAPOS version 1)[1][2]. Thus, if the exact form of the address field is embedded in the Link-layer Address field of the Source/Target Link-layer Address option field, the total length of the option field is 4 octets (MAPOS 16) or 3 octets (MAPOS version 1), both of which are shorter than 8 octets.",
      "ja": "[5]に規定されているように、ソース/ターゲットリンク層アドレスオプションは、近隣探索メッセージに含ま選択肢の一つです。 [5]では、フィールドは8つのオクテット単位で指定されたソース/ターゲットリンク層アドレスオプションの長さ。しかしながら、MAPOSの場合には、アドレス・フィールドの長さは2つのオクテット（MAPOS 16）または1つのオクテット（MAPOSバージョン1）である[1] [2]。アドレスフィールドの正確な形式は、ソース/ターゲット・リンク層アドレスオプションフィールドのリンク層アドレスフィールドに埋め込まれている場合このように、オプションフィールドの全長はMAPOS（4つのオクテット（MAPOS 16）又は3つのオクテットでありますバージョン1）、8つのオクテットより短いどちらも。"
    },
    {
      "indent": 3,
      "text": "For the above reason, in the case of MAPOS, the Link-layer Address field of the Source/Target Link-layer Address option must be extended with zeros in order to extend the length of the option field to 8 octets, and the Length field must be set to 1 as shown below.",
      "ja": "MAPOSの場合には、上記の理由のために、ソース/ターゲット・リンク層アドレス・オプションのリンク層アドレスフィールドはオプションフィールド8つのオクテットの長さ、および長さフィールドを拡張するためにゼロで拡張されなければなりません以下に示すように1に設定されなければなりません。"
    },
    {
      "indent": 3,
      "text": "MAPOS version 1:",
      "ja": "MAPOSバージョン1："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     |             All 0             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     All 0     |    Address    |             All 0             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Fields:",
      "ja": "フィールド："
    },
    {
      "indent": 3,
      "text": "Type: 1 for Source link-layer address. 2 for Target link-layer address.",
      "ja": "タイプ：1ソースリンク層アドレスのために。ターゲットリンク層アドレスのため2。"
    },
    {
      "indent": 3,
      "text": "Length: 1 (in units of 8 octets).",
      "ja": "長さ：1（8つのオクテットの単位で）。"
    },
    {
      "indent": 3,
      "text": "Address: MAPOS version 1 8-bit address.",
      "ja": "住所：MAPOSバージョン1 8ビットのアドレス。"
    },
    {
      "indent": 3,
      "text": "Figure 8. Format of the Source/Target Link-layer Address option field (MAPOS version 1).",
      "ja": "ソース/ターゲットリンク層アドレスオプションフィールド（MAPOSバージョン1）の図8.フォーマット。"
    },
    {
      "indent": 3,
      "text": "MAPOS 16:",
      "ja": "MAPOS 16："
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     |             All 0             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Link-layer Address        |             All 0             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Fields:",
      "ja": "フィールド："
    },
    {
      "indent": 3,
      "text": "Type: 1 for Source link-layer address. 2 for Target link-layer address.",
      "ja": "タイプ：1ソースリンク層アドレスのために。ターゲットリンク層アドレスのため2。"
    },
    {
      "indent": 3,
      "text": "Length: 1 (in units of 8 octets).",
      "ja": "長さ：1（8つのオクテットの単位で）。"
    },
    {
      "indent": 3,
      "text": "Link-layer Address: MAPOS 16 16-bit address.",
      "ja": "リンク層アドレス：MAPOS 16 16ビットのアドレス。"
    },
    {
      "indent": 3,
      "text": "Figure 9. Format of the Source/Target Link-layer Address option field (MAPOS 16).",
      "ja": "ソース/ターゲットリンク層アドレスオプションフィールド（MAPOS 16）の図9.フォーマット。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "In MAPOS, a link-layer address (MAPOS address) is assigned to a network interface by a frame switch via NSP; unlike other link-layer protocols such as Ethernet that use a built-in address on a network interface. Security considerations derived from this are described in 6.1 and 6.2. Because there is no link-layer security in MAPOS, the same security considerations as those of other link-layer protocols would be applied to other points.",
      "ja": "MAPOS、リンク層アドレス（MAPOSアドレス）にNSPを介してフレームスイッチによるネットワーク・インターフェースに割り当てられています。ネットワークインタフェース上の内蔵のアドレスを使用するイーサネットなどの他のリンク層プロトコルとは異なり。この由来セキュリティの考慮事項は、6.1と6.2で説明されています。 MAPOSにはリンク層のセキュリティは存在しないので、他のリンク層プロトコルのものと同じセキュリティ上の考慮事項は、他のポイントに適用されます。"
    },
    {
      "indent": 0,
      "text": "6.1. Issues concerning Link-layer Addresses",
      "section_title": true,
      "ja": "6.1. リンク層アドレスに関する問題"
    },
    {
      "indent": 0,
      "text": "6.1.1. Protection against fraudulent reception of traffic",
      "section_title": true,
      "ja": "6.1.1. トラフィックの不正受信に対する保護"
    },
    {
      "indent": 3,
      "text": "In MAPOS, a MAPOS address is assigned by a frame switch, and it consists of the switch number and the port number of the switch to which the network interface is connected. (In the case of a point-to-point connection between two nodes, a fixed address is assigned to their network interfaces.) This brings the following advantages.",
      "ja": "MAPOSで、MAPOSアドレスは、フレームスイッチによって割り当てられ、それはスイッチ番号及びネットワークインタフェースが接続されているスイッチのポート番号で構成されています。 （2つのノード間のポイントツーポイント接続の場合には、固定アドレスは、そのネットワークインタフェースに割り当てられている。）これは、次のような利点をもたらします。"
    },
    {
      "indent": 3,
      "text": "1. The value of the MAPOS address of a MAPOS network interface indicates the location of the interface in the MAPOS network. In other words, the value itself of the destination address of a MAPOS frame defines the actual location of the network interface to which the frame should be finally delivered. Therefore, as long as MAPOS addresses of network interfaces of nodes that have been connected to the network through proper administrative process are held and frames are delivered only to those addresses, other nodes cannot receive frames unless their network interfaces are connected to the same ports of frame switches as those to which network interfaces of properly administered nodes are connected. This makes fraudulent reception of traffic difficult.",
      "ja": "1. MAPOSネットワークインタフェースのMAPOSアドレスの値はMAPOSネットワーク内のインタフェースの位置を示します。換言すれば、MAPOSフレームの宛先アドレスの値自体は、フレームが最終的に配信すべきネットワークインターフェースの実際の位置を定義します。それらのネットワークインターフェースを同一のポートに接続されている場合を除きしたがって、限り適切な管理プロセスを介してネットワークに接続されたノードのネットワークインタフェースのMAPOSアドレスが保持され、フレームがそれらのアドレスにのみ配信されるように、他のノードはフレームを受信することができません適切に投与されたノードのネットワークインタフェースが接続されているもののようなフレーム・スイッチ。これは、トラフィックの不正受信が困難になります。"
    },
    {
      "indent": 3,
      "text": "2. In the case where MAPOS addresses are not administered as mentioned above, it is possible that a malicious node could hijack traffic by spoofing its IPv6 address in a response to an IPv6 Neighbor Discovery. Even in this case, the node must advertise the true MAPOS address of its network interface in the response so that it can receive successive frames. This makes it easy to pinpoint the location of the host.",
      "ja": "上述したようにMAPOSアドレスが投与されない場合2.、悪意のあるノードがIPv6近隣探索に応答して、そのIPv6アドレスを偽装することによってトラフィックをハイジャックすることが可能です。それは連続したフレームを受信できるように、この場合であっても、ノードが応答して、そのネットワーク・インタフェースの真のMAPOSアドレスをアドバタイズする必要があります。これは、ホストの位置を特定することが容易になります。"
    },
    {
      "indent": 0,
      "text": "6.1.2. Protection against improper traffic",
      "section_title": true,
      "ja": "6.1.2. 不適切なトラフィックに対する保護"
    },
    {
      "indent": 3,
      "text": "A MAPOS frame does not have a field for including its sender's address. Therefore, in the case where a node sends one-way improper traffic maliciously or accidentally, there is no way to obtain the sender's MAPOS address from the traffic and this leads to difficulty in identifying the node (because source IP addresses might be forged).",
      "ja": "MAPOSフレームは、その送信者のアドレスを含むためのフィールドがありません。したがって、ノードは、悪意を持ったり、誤って一方向不適切なトラフィックを送信する場合には、トラフィックから送信者のMAPOSアドレスを取得する方法はありません、これは（送信元IPアドレスが偽造される可能性があるため）ノードを特定することが困難になります。"
    },
    {
      "indent": 3,
      "text": "An effective way to alleviate the difficulty is to moderate the size of MAPOS multi-switch environment [6]. A common approach is to separate it using IP routers. This makes it easy to identify the node sending improper traffic within the multi-switch environment. To secure the environment against improper traffic from outside it, boundary IP routers need to block it using packet filtering based on IP layer information.",
      "ja": "困難を緩和する効果的な方法はMAPOSマルチスイッチ環境[6]の大きさを緩和することです。一般的なアプローチは、IPルータを使用して、それを分離することです。これは、マルチスイッチ環境で不適切なトラフィックを送信するノードを識別することが容易になります。その外部からの不適切なトラフィックに対する環境を確保するために、境界IPルータは、IPレイヤの情報に基づいてパケットフィルタリングを使用して、それをブロックする必要があります。"
    },
    {
      "indent": 0,
      "text": "6.2. Uniqueness of Interface Identifiers",
      "section_title": true,
      "ja": "6.2. インタフェース識別子の一意性"
    },
    {
      "indent": 3,
      "text": "Global uniqueness of a MAPOS address is not guaranteed, and a MAPOS address is not a built-in address but can be changed without performing a system re-start if an implementation ensures that the link between the network interface of the node and the port of the frame switch is hot-swappable. Thus, an interface identifier must not be derived from a MAPOS address in order to ensure that the interface identifier is not changed without a system re-start.",
      "ja": "MAPOSアドレスのグローバル一意性が保証されていない、とMAPOSアドレスではないアドレスを内蔵しかし、実装が保証する場合、システムの再起動を行うことなく変更することができ、そのノードのネットワークインタフェースとポートの間のリンクフレームスイッチは、ホットスワップ可能です。したがって、インタフェース識別子はインタフェース識別子は、システム再起動することなく変更されないことを確実にするためにMAPOSアドレスから導出されてはなりません。"
    },
    {
      "indent": 3,
      "text": "As a consequence, in IP Version 6 over MAPOS, the existence of network interfaces other than MAPOS that have IEEE global identifier based addresses has great importance in creating interface identifiers. However, it may be common for there to be no such interfaces on a node, so a different source of uniqueness must be used. Therefore, sufficient care should be taken to prevent duplication of interface identifiers. At present, there is no protection against duplication through accident or forgery.",
      "ja": "その結果、MAPOSオーバーIPバージョン6では、IEEEグローバル識別子ベースアドレスを持つMAPOS以外のネットワークインターフェースの存在は、インターフェース識別子を作成する際に大きな重要性を有しています。しかし、そのように独自性の異なるソースを使用する必要があり、ノードにそのようなインターフェイスはないようにするための共通の存在であってもよいです。そのため、十分な注意がインタフェース識別子の重複を防ぐために取られるべきです。現時点では、事故や偽造による重複を防ぐ機能はありません。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 3,
      "text": "[1] Murakami, K. and M. Maruyama, \"MAPOS - Multiple Access protocol over SONET/SDH Version 1\", RFC 2171, June 1997.",
      "ja": "[1]村上、K.およびM.丸山、 \"MAPOS  -  SONET / SDHバージョン1を介して複数のアクセスプロトコル\"、RFC 2171、1997年6月。"
    },
    {
      "indent": 3,
      "text": "[2] Murakami, K. and M. Maruyama, \"MAPOS 16 - Multiple Access Protocol over SONET/SDH with 16 Bit Addressing\", RFC 2175, June 1997.",
      "ja": "[2]村上、K.およびM.丸山、 \"MAPOS 16から16ビット・アドレッシングとSONET / SDH上で複数のアクセスプロトコル\"、RFC 2175、1997年6月。"
    },
    {
      "indent": 3,
      "text": "[3] Simpson, W., Ed., \"PPP in HDLC-like Framing\", STD 51, RFC 1662, July 1994.",
      "ja": "[3]シンプソン、W.、編、 \"HDLC様のフレーミングにおけるPPP\"、STD 51、RFC 1662、1994年7月。"
    },
    {
      "indent": 3,
      "text": "[4] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[4]デアリング、S.とR. Hindenと \"インターネットプロトコル、バージョン6（IPv6）の仕様\"、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[5] Narten, T., Nordmark, E. and W. Simpson, \"Neighbor Discovery for IP Version 6 (IPv6)\", RFC 2461, December 1998.",
      "ja": "[5] Narten氏、T.、Nordmarkと、E.およびW.シンプソン、 \"IPバージョン6のための近隣探索（IPv6）の\"、RFC 2461、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[6] Murakami, K. and M. Maruyama, \"A MAPOS version 1 Extension - Node Switch Protocol\", RFC 2173, June 1997.",
      "ja": "[6]村上、K.およびM.丸山、 \"MAPOSバージョン1拡張 - ノード・スイッチ・プロトコル\"、RFC 2173、1997年6月。"
    },
    {
      "indent": 3,
      "text": "[7] Hinden, R. and S. Deering, \"Internet Protocol Version 6 (IPv6) Addressing Architecture\", RFC 3513, April 2003.",
      "ja": "[7] HindenとR.とS.デアリング、 \"インターネットプロトコルバージョン6（IPv6）のアドレス指定アーキテクチャ\"、RFC 3513、2003年4月。"
    },
    {
      "indent": 3,
      "text": "[8] IEEE, \"Guidelines of 64-bit Global Identifier (EUI-64) Registration Authority\", http://standards.ieee.org/db/oui/tutorials/EUI64.html, March 1997.",
      "ja": "[8] IEEE、http://standards.ieee.org/db/oui/tutorials/EUI64.html、1997年3月 \"64ビットのグローバル識別子（EUI-64）登録機関のガイドライン\"。"
    },
    {
      "indent": 3,
      "text": "[9] Haskin, D. and E. Allen, \"IP Version 6 over PPP\", RFC 2472, December 1998.",
      "ja": "[9] Haskin、D.およびE.アレン、 \"PPPオーバーIPバージョン6\"、RFC 2472、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[10] Narten, T. and C. Burton, \"A Caution On The Canonical Ordering Of Link-Layer Addresses\", RFC 2469, December 1998.",
      "ja": "[10] Narten氏、T.とC.バートン、「リンク層アドレスの正規の順序に注意」、RFC 2469、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[11] Thompson, S. and T. Narten, \"IPv6 Stateless Address Autoconfiguration\", RFC 2462, December 1998.",
      "ja": "[11]トンプソン、S.とT. Narten氏、 \"IPv6のステートレスアドレス自動設定\"、RFC 2462、1998年12月。"
    },
    {
      "indent": 0,
      "text": "8. Authors' Addresses",
      "section_title": true,
      "ja": "8.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Tsuyoshi Ogura NTT Network Innovation Laboratories 3-9-11, Midori-cho Musashino-shi Tokyo 180-8585, Japan",
      "ja": "つよし おぐら んっｔ ねとぉｒｋ いんおゔぁちおん ぁぼらとりえｓ ３ー９ー１１、 みどりーちょ むさしのーし ときょ １８０ー８５８５、 じゃぱん"
    },
    {
      "indent": 3,
      "text": "EMail: ogura@core.ecl.net",
      "ja": "メールアドレス：ogura@core.ecl.net"
    },
    {
      "indent": 3,
      "text": "Mitsuru Maruyama NTT Network Innovation Laboratories 3-9-11, Midori-cho Musashino-shi Tokyo 180-8585, Japan",
      "ja": "みつる まるやま んっｔ ねとぉｒｋ いんおゔぁちおん ぁぼらとりえｓ ３ー９ー１１、 みどりーちょ むさしのーし ときょ １８０ー８５８５、 じゃぱん"
    },
    {
      "indent": 3,
      "text": "EMail: mitsuru@core.ecl.net",
      "ja": "メールアドレス：mitsuru@core.ecl.net"
    },
    {
      "indent": 3,
      "text": "Toshiaki Yoshida Werk Mikro Systems 250-1, Mikajiri Kumagaya Saitama 360-0843, Japan",
      "ja": "としあき よしだ うぇｒｋ みｋろ Ｓｙｓてｍｓ ２５０ー１、 みかじり くまがや さいたま ３６０ー０８４３、 じゃぱん"
    },
    {
      "indent": 3,
      "text": "EMail: yoshida@peta.arch.ecl.net",
      "ja": "メールアドレス：yoshida@peta.arch.ecl.net"
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "ja": "9.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の制限は永続的なものであり、インターネットソサエティもしくはその継承者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}