{
  "title": {
    "text": "RFC 3109 - Request to Move STD 39 to Historic Status",
    "ja": "RFC 3109 - STD 39を歴史的なステータスに移動するようリクエストします"
  },
  "number": 3109,
  "created_at": "2023-12-18 17:17:44.763094+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          R. Braden\nRequest for Comments: 3109                                           ISI\nCategory: Informational                                          R. Bush\n                                                                   RGnet\n                                                              J. Klensin\n                                                                    AT&T\n                                                                May 2001",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "Request to Move STD 39 to Historic Status",
      "ja": "STD 39を歴史的なステータスに移動するようリクエストします"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo changes the status of STD 39, BBN Report 1822, \"Specification of the Interconnection of a Host and an IMP\", from Standard to Historic.",
      "ja": "このメモは、STD 39、BBNレポート1822のステータス、「ホストとIMPの相互接続の仕様」、標準から歴史的なものまで変更されます。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Internet design grew out of the pioneering packet-switched network called the ARPAnet. The ARPAnet was a mostly-US national network built of mini-computer packet switches, called Interface Message Processors (IMPs), that were linked by 56kbps leased telephone lines. The IMPs were designed and built by Bolt, Beranek, and Neumann (BBN) under contract with ARPA, beginning in 1968. One of BBN's first tasks was to define the standard hardware interface between a host and a colocated IMP. This interface was described in BBN Report 1822 [BBN1822], which was a bible for the administrators of the many different hosts that connected to the ARPAnet.",
      "ja": "インターネットの設計は、Arpanetと呼ばれる先駆的なパケットスイッチネットワークから生まれました。Arpanetは、56kbpsリースした電話回線でリンクされたインターフェイスメッセージプロセッサ（IMP）と呼ばれるミニコンピューターパケットスイッチで構築されたほとんどが米国のネットワークで構築されていました。IMPSは、1968年からARPAと契約して、Bolt、Beranek、およびNeumann（BBN）によって設計および構築されました。BBNの最初のタスクの1つは、ホストとコロケートされたIMPの間の標準的なハードウェアインターフェイスを定義することでした。このインターフェイスは、BBNレポート1822 [BBN1822]で説明されています。これは、Arpanetに接続された多くの異なるホストの管理者の聖書でした。"
    },
    {
      "indent": 3,
      "text": "The BBN Report 1822 host/IMP hardware interface was bit-serial and asynchronous. In 1968, the 8-bit byte had not yet been adopted as an industry standard, so the interface had to cope with word-based machines with arbitrary word length -- some common word lengths were 8, 12, 16, 24, 36, and 60, but there were others. From the software viewpoint, Report 1822 defined what would today be called the link-layer access protocol for the ARPAnet.",
      "ja": "BBNレポート1822ホスト/IMPハードウェアインターフェイスは、ビットシリアルで非同期でした。1968年、8ビットのバイトはまだ業界標準として採用されていなかったため、インターフェイスは任意の単語の長さの単語ベースのマシンに対処する必要がありました。いくつかの一般的な単語の長さは8、12、16、24、36、60歳ですが、他にもありました。ソフトウェアの視点から、レポート1822は、今日のArpanetのLink-Layer Accessプロトコルと呼ばれるものを定義しました。"
    },
    {
      "indent": 3,
      "text": "In 1983 the US DoD moved the ARPAnet technology to TCP/IP and split off parts of the ARPAnet to form a production facility called MILNET. The DoD mandated a byte-oriented, X.25-based interface for the MILNET IMPs. However, the machines on the research-oriented ARPAnet continued to use the 1822 interface under the new Internet protocol suite. Therefore, BBN Report 1822 was made an Internet Standard, STD 39, although the report was not republished as an RFC.",
      "ja": "1983年、米国DODはArpanetテクノロジーをTCP/IPに移動し、Arpanetの一部を分割してMilnetと呼ばれる生産施設を形成しました。DODは、ミルネットIMPSのバイト指向のX.25ベースのインターフェイスを義務付けました。ただし、研究指向のARPANETのマシンは、新しいインターネットプロトコルスイートの下で1822インターフェイスを引き続き使用しました。したがって、BBNレポート1822はインターネット標準のSTD 39になりましたが、レポートはRFCとして再発行されていません。"
    },
    {
      "indent": 0,
      "text": "2. Action",
      "section_title": true,
      "ja": "2. アクション"
    },
    {
      "indent": 3,
      "text": "Since the ARPAnet technology and the BBN 1822 interface are no longer in use, the IESG is moving BBN Report 1822 from Standard to Historic status. The STD number 39 is retired.",
      "ja": "ArpanetテクノロジーとBBN 1822インターフェイスはもはや使用されていないため、IESGはBBNレポート1822を標準的なステータスに移動しています。STD番号39は退職します。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Moving STD 39 to historic has no known effect on the security of the Internet.",
      "ja": "STD 39を歴史的に移動することは、インターネットのセキュリティに既知の影響を及ぼさない。"
    },
    {
      "indent": 0,
      "text": "4. References",
      "section_title": true,
      "ja": "4. 参考文献"
    },
    {
      "indent": 3,
      "text": "[BBN1822] STD 39 is BBN Report 1822 \"Specification for the Interconnection of a Host and an IMP\". This can be ordered from Bolt, Beranek, and Newman, 10 Moulton Street, Cambridge, MA 02138.",
      "ja": "[BBN1822] STD 39はBBNレポート1822「ホストとIMPの相互接続の仕様」です。これは、MA 02138、ケンブリッジ、Moulton StreetのBeranekのBolt、およびNewmanから注文できます。"
    },
    {
      "indent": 0,
      "text": "5. Authors' Addresses",
      "section_title": true,
      "ja": "5. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Robert Braden USC/Information Sciences Institute 4676 Admiralty Way Marina del Rey, CA 90292-6695",
      "ja": "Robert Braden USC/Information Sciences Institute 4676 Admiralty Way Marina Del Rey、CA 90292-6695"
    },
    {
      "indent": 3,
      "text": "Phone: +1 310-822-1511\nEMail: braden@isi.edu",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Randy Bush 5147 Crystal Springs Bainbridge Island, WA US-98110",
      "ja": "ランディブッシュ5147クリスタルスプリングスベインブリッジ島、ワシントン州US-98110"
    },
    {
      "indent": 3,
      "text": "Phone: +1 206-780-0431\nEMail: randy@psg.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "John C. Klensin 1770 Massachusetts Ave, Suite 322 Cambridge, MA 02140, USA",
      "ja": "ジョンC.クレンシン1770マサチューセッツアベニュー、スイート322ケンブリッジ、マサチューセッツ州02140、米国"
    },
    {
      "indent": 3,
      "text": "EMail: klensin@jck.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6. Full Copyright Statement",
      "section_title": true,
      "ja": "6. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があり、それについてコメントまたは説明する派生作品、またはその実装を支援することができます。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}