{
  "title": {
    "text": "RFC 3438 - Layer Two Tunneling Protocol (L2TP) Internet Assigned Numbers Authority (IANA) Considerations Update",
    "ja": "RFC 3438 - レイヤー2つのトンネルプロトコル（L2TP）インターネット割り当てされた数字の権限（IANA）考慮事項更新"
  },
  "number": 3438,
  "created_at": "2023-11-08 05:17:18.503376+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        W. Townsley\nRequest for Comments: 3438                                 Cisco Systems\nBCP: 68                                                    December 2002\nCategory: Best Current Practice",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": " Layer Two Tunneling Protocol (L2TP) Internet Assigned Numbers Authority (IANA) Considerations Update",
      "ja": "レイヤー2つのトンネルプロトコル（L2TP）インターネット割り当てされた数字の権限（IANA）考慮事項更新"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネットの最良のプラクティスを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes updates to the Internet Assigned Numbers Authority (IANA) considerations for the Layer Two Tunneling Protocol (L2TP).",
      "ja": "このドキュメントでは、レイヤー2トンネリングプロトコル（L2TP）のインターネット割り当てされた数字局（IANA）の考慮事項への更新について説明します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction.............................................    1\n  1.1 Terminology...........................................    2\n2. IANA Considerations......................................    2\n  2.1 Control Message AVPs..................................    3\n  2.2 Message Type AVP Values...............................    3\n  2.3 Result Code AVP Values................................    3\n  2.4 Remaining Values......................................    3\n3. Normative References.....................................    3\n4. Security Considerations..................................    4\n5. Acknowledgements.........................................    4\n6. Author's Address.........................................    4\n7. Full Copyright Statement.................................    5",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document provides guidance to the Internet Assigned Numbers Authority (IANA) regarding the registration of values related to the Layer Two Tunneling Protocol (L2TP), defined in [RFC2661], in accordance with BCP 26, [RFC2434].",
      "ja": "このドキュメントは、BCP 26、[RFC2434]に従って、[RFC2661]で定義されているレイヤー2トンネルプロトコル（L2TP）に関連する値の登録に関するインターネット割り当てされた番号局（IANA）にガイダンスを提供します。"
    },
    {
      "indent": 0,
      "text": "1.1 Terminology",
      "section_title": true,
      "ja": "1.1 用語"
    },
    {
      "indent": 3,
      "text": "The following terms are used here with the meanings defined in BCP 26: \"name space\", \"assigned value\", \"registration\".",
      "ja": "ここでは、BCP 26で定義されている意味で次の用語を使用しています：「名前スペース」、「割り当てられた値」、「登録」。"
    },
    {
      "indent": 3,
      "text": "The following policies are used here with the meanings defined in BCP 26: \"Private Use\", \"First Come First Served\", \"Expert Review\", \"Specification Required\", \"IETF Consensus\", \"Standards Action\".",
      "ja": "ここでは、BCP 26で定義されている意味で次のポリシーが使用されています。「プライベート使用」、「最初に来る」、「エキスパートレビュー」、「必要な仕様」、「IETFコンセンサス」、「標準アクション」。"
    },
    {
      "indent": 0,
      "text": "2. IANA Considerations",
      "section_title": true,
      "ja": "2. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "L2TP [RFC2661] defines a number of \"magic\" numbers to be maintained by the IANA. This section updates the criteria to be used by the IANA to assign additional numbers in each of these lists.",
      "ja": "L2TP [RFC2661]は、IANAによって維持される多くの「魔法」数値を定義します。このセクションでは、IANAが使用する基準を更新して、これらの各リストに追加の番号を割り当てます。"
    },
    {
      "indent": 3,
      "text": "Each of the values identified in this document that require a registration criteria update are currently maintained by IANA and have a range of values from 0 to 65 535, of which a very small number have been allocated (the maximum number allocated within any one range is 46) [L2TP-IANA]. Given the nature of these values, it is not expected that any will ever run into a resource allocation problem if registration allocation requirements are relaxed from their current state.",
      "ja": "登録基準の更新を必要とするこのドキュメントで特定された各値は現在IANAによって維持されており、0から65 535までの範囲の値を持っています。46）[l2tp-aiana]。これらの値の性質を考えると、登録割り当て要件が現在の状態から緩和された場合、リソース割り当ての問題に陥ることは予想されません。"
    },
    {
      "indent": 3,
      "text": "The recommended criteria changes for IANA registration are listed in the following sections. In one case, the registration criteria is currently defined as First Come First Served and should be made more strict, others are defined as IETF Consensus and need to be relaxed. The relaxation from IETF Consensus is motivated by specific cases in which values that were never intended to be vendor-specific have had to enter early field trials or be released in generally available products with vendor-specific values while awaiting documents to be formalized. In most cases, this results in products that have to support both the vendor-specific value and IETF value indefinitely.",
      "ja": "IANA登録の推奨基準の変更は、次のセクションにリストされています。あるケースでは、登録基準は現在、最初に提供されるように定義されており、より厳格になるべきであるため、IETFコンセンサスとして定義され、リラックスする必要があります。IETFのコンセンサスからの緩和は、ベンダー固有のものではない価値が、初期のフィールドトライアルに入るか、ベンダー固有の値を持つ一般的に利用可能な製品でリリースされなければならない特定のケースによって動機付けられています。ほとんどの場合、これにより、ベンダー固有の値とIETF値の両方を無期限にサポートする必要がある製品が生成されます。"
    },
    {
      "indent": 3,
      "text": "For registration requests where a Designated Expert should be consulted, the responsible IESG Area Director should appoint the Designated Expert.",
      "ja": "指定された専門家に相談する必要がある登録要求のために、責任あるIESGエリアディレクターは指定された専門家を任命する必要があります。"
    },
    {
      "indent": 3,
      "text": "For registration requests requiring Expert Review, the Designated Expert should consult relevant WGs as appropriate (e.g., the l2tpext WG at the time of this writing).",
      "ja": "専門家のレビューを必要とする登録リクエストの場合、指定された専門家は、必要に応じて関連するWGSを参照する必要があります（たとえば、この執筆時点でL2TPext WG）。"
    },
    {
      "indent": 3,
      "text": "The basic guideline for the Expert Review process will be to approve the assignment of a value only if there is a document being advanced that clearly defines the values to be assigned, and there is active implementation development (perhaps entering early field or interoperability trails, requiring assigned values to proceed without having to resort to a chosen vendor-specific method).",
      "ja": "専門家のレビュープロセスの基本的なガイドラインは、割り当てられる値を明確に定義するドキュメントが明確に定義されているドキュメントがある場合にのみ、値の割り当てを承認することです。選択されたベンダー固有の方法に頼らずに進行するために割り当てられた値。"
    },
    {
      "indent": 0,
      "text": "2.1 Control Message AVPs",
      "section_title": true,
      "ja": "2.1 コントロールメッセージAVP"
    },
    {
      "indent": 3,
      "text": "IANA manages the \"Control Message Attribute Value Pairs\" [L2TP-IANA] name space, of which 0 - 46 have been assigned. The criteria for assignment was originally IETF Consensus. Further values should be assigned upon Expert Review.",
      "ja": "IANAは、「コントロールメッセージ属性値ペア」[L2TP -AINA]名前スペースを管理し、そのうち0〜46が割り当てられています。割り当ての基準は、もともとIETFコンセンサスでした。専門家のレビューでは、さらなる値を割り当てる必要があります。"
    },
    {
      "indent": 0,
      "text": "2.2 Message Type AVP Values",
      "section_title": true,
      "ja": "2.2 メッセージタイプAVP値"
    },
    {
      "indent": 3,
      "text": "IANA manages the \"Message Type AVP (Attribute Type 0) Values\" [L2TP-IANA] name space, of which 0 - 16 have been assigned. The criteria for assignment was originally IETF Consensus. Further values should be assigned upon Expert Review.",
      "ja": "IANAは、「メッセージタイプAVP（属性タイプ0）値」[L2TP -AINA]名前スペースを管理し、そのうち0〜16が割り当てられています。割り当ての基準は、もともとIETFコンセンサスでした。専門家のレビューでは、さらなる値を割り当てる必要があります。"
    },
    {
      "indent": 0,
      "text": "2.3 Result Code AVP Values",
      "section_title": true,
      "ja": "2.3 結果コードAVP値"
    },
    {
      "indent": 3,
      "text": "IANA maintains a list of \"Result Code values for the StopCCN message,\" \"Result Code values for the CDN message,\" and \"General Error Codes\" [L2TP-IANA]. The criteria for Error Code assignment was originally First Come First Served, and the criteria for CDN and StopCCN Result Codes were originally IETF Consensus. Further values for all Result and Error codes should be assigned upon Expert Review.",
      "ja": "IANAは、「STOPCCNメッセージの結果コード値」、「CDNメッセージの結果コード値」、および「一般的なエラーコード」[L2TP-AINA]のリストを維持しています。エラーコードの割り当ての基準はもともと最初に最初に提供され、CDNおよびSTOPCCN結果コードの基準はもともとIETFコンセンサスでした。すべての結果とエラーコードのさらなる値は、専門家のレビュー時に割り当てられる必要があります。"
    },
    {
      "indent": 0,
      "text": "2.4 Remaining Values",
      "section_title": true,
      "ja": "2.4 残りの値"
    },
    {
      "indent": 3,
      "text": "All criteria for L2TP values maintained by IANA and not mentioned specifically in this document remain unchanged.",
      "ja": "IANAによって維持され、このドキュメントで具体的に言及されていないL2TP値のすべての基準は変更されていません。"
    },
    {
      "indent": 0,
      "text": "3. Normative References",
      "section_title": true,
      "ja": "3. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2434] Alvestrand, H. and T. Narten, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[RFC2434] Alvestrand、H。およびT. Narten、「RFCSでIANA考慮事項セクションを作成するためのガイドライン」、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2661] Townsley, W., Valencia, A., Rubens, A., Pall, G., Zorn, G. and B. Palter, \"Layer Two Tunneling Layer Two Tunneling Protocol (L2TP)\", RFC 2661, August 1999.",
      "ja": "[RFC2661] Townsley、W.、Valencia、A.、Rubens、A.、Pall、G.、Zorn、G。およびB. Palter、 \"層2トンネリング層2トンネリングプロトコル（L2TP）\"、RFC 2661、1999年8月。"
    },
    {
      "indent": 3,
      "text": "[L2TP-IANA] Internet Assigned Numbers Authority (IANA), \"Layer Two Tunneling Protocol 'L2TP' - RFC 2661\", http://www.iana.org/assignments/l2tp-parameters",
      "ja": "[L2TP-IANA]インターネットに割り当てられた数字の権限（IANA）、「レイヤー2トンネリングプロトコル 'L2TP' -RFC2661」、http：//www.iana.org/assignments/l2tp-parameters"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This focuses on IANA considerations, and does not have security considerations.",
      "ja": "これはIANAの考慮事項に焦点を当てており、セキュリティ上の考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "ja": "5. 謝辞"
    },
    {
      "indent": 3,
      "text": "Some of this text and much of the format of this document was taken from an internet document on EAP IANA Considerations authored by Bernard Aboba.",
      "ja": "このテキストの一部とこのドキュメントの形式の多くは、バーナードアボバが作成したEAP IANAの考慮事項に関するインターネットドキュメントから取得されました。"
    },
    {
      "indent": 0,
      "text": "6. Author's Address",
      "section_title": true,
      "ja": "6. 著者の連絡先"
    },
    {
      "indent": 3,
      "text": "W. Mark Townsley Cisco Systems 7025 Kit Creek Road PO Box 14987 Research Triangle Park, NC 27709",
      "ja": "W.マークタウンズリーシスコシステム7025キットクリークロードPOボックス14987リサーチトライアングルパーク、ノースカロライナ州27709"
    },
    {
      "indent": 3,
      "text": "EMail: mark@townsley.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "ja": "7. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}