{
  "title": {
    "text": "RFC 3165 - Definitions of Managed Objects for the Delegation of Management Scripts",
    "ja": "RFC 3165 - 管理スクリプトの委任のための管理されたオブジェクトの定義"
  },
  "number": 3165,
  "created_at": "2023-12-11 07:17:49.354605+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            D. Levi\nRequest for Comments: 3165                               Nortel Networks\nObsoletes: 2592                                         J. Schoenwaelder\nCategory: Standards Track                                TU Braunschweig\n                                                             August 2001",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "Definitions of Managed Objects for the Delegation of Management Scripts",
      "ja": "管理スクリプトの委任のための管理されたオブジェクトの定義"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes a set of managed objects that allow the delegation of management scripts to distributed managers.",
      "ja": "このメモは、インターネットコミュニティのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、管理スクリプトの委任が分散マネージャーに委任できる一連の管理オブジェクトについて説明します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1 Introduction .................................................    3\n2 The SNMP Management Framework ................................    3\n3 Overview .....................................................    4\n3.1 Terms ......................................................    5\n4 Requirements and Design Issues ...............................    6\n4.1 Script Languages ...........................................    6\n4.2 Script Transfer ............................................    7\n4.3 Script Execution ...........................................    8\n5 Structure of the MIB .........................................    9\n5.1 Language Group .............................................    9\n5.2 Script Group ...............................................   10\n5.3 Code Group .................................................   11\n5.4 Launch Group ...............................................   11\n5.5 Run Group ..................................................   11\n6 Definitions ..................................................   12\n7 Usage Examples ...............................................   49\n7.1 Pushing a Script via SNMP ..................................   49\n7.2 Pulling a Script from a URL ................................   50\n7.3 Modifying an Existing Script ...............................   50\n7.4 Removing an Existing Script ................................   51\n7.5 Creating a Launch Button ...................................   51\n7.6 Launching a Script .........................................   52\n7.7 Suspending a Running Script ................................   52\n7.8 Resuming a Suspended Script ................................   53\n7.9 Terminating a Running Script ...............................   53\n7.10 Removing a Terminated Script ..............................   54\n7.11 Removing a Launch Button ..................................   54\n8 VACM Configuration Examples ..................................   54\n8.1 Sandbox for Guests .........................................   55\n8.2 Sharing Scripts ............................................   55\n8.3 Emergency Scripts ..........................................   56\n9 IANA Considerations ..........................................   57\n10 Security Considerations .....................................   57\n11 Intellectual Property .......................................   59\n12 Changes from RFC 2592 .......................................   59\n13 Acknowledgments .............................................   61\n14 References ..................................................   61\n15 Editors' Addresses ..........................................   63\n16 Full Copyright Statement ....................................   64",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes a set of managed objects that allow the delegation of management scripts to distributed managers.",
      "ja": "このメモは、インターネットコミュニティのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、管理スクリプトの委任が分散マネージャーに委任できる一連の管理オブジェクトについて説明します。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. The SNMP Management Framework",
      "section_title": true,
      "ja": "2. SNMP管理フレームワーク"
    },
    {
      "indent": 3,
      "text": "The SNMP Management Framework presently consists of five major components:",
      "ja": "SNMP管理フレームワークは現在、5つの主要なコンポーネントで構成されています。"
    },
    {
      "indent": 3,
      "text": "o An overall architecture, described in RFC 2571 [RFC2571].",
      "ja": "o RFC 2571 [RFC2571]に記載されている全体的なアーキテクチャ。"
    },
    {
      "indent": 3,
      "text": "o Mechanisms for describing and naming objects and events for the purpose of management. The first version of this Structure of Management Information (SMI) is called SMIv1 and described in STD 16, RFC 1155 [RFC1155], STD 16, RFC 1212 [RFC1212] and RFC 1215 [RFC1215]. The second version, called SMIv2, is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "ja": "o 管理を目的としたオブジェクトとイベントを説明および名前を付けるためのメカニズム。この管理情報の最初のバージョン（SMI）はSMIV1と呼ばれ、STD 16、RFC 1155 [RFC1155]、STD 16、RFC 1212 [RFC1212]およびRFC 1215 [RFC1215]で説明されています。SMIV2と呼ばれる2番目のバージョンは、STD 58、RFC 2578 [RFC2578]、STD 58、RFC 2579 [RFC2579]およびSTD 58、RFC 2580 [RFC2580]に記載されています。"
    },
    {
      "indent": 3,
      "text": "o Message protocols for transferring management information. The first version of the SNMP message protocol is called SNMPv1 and described in STD 15, RFC 1157 [RFC1157]. A second version of the SNMP message protocol, which is not an Internet standards track protocol, is called SNMPv2c and described in RFC 1901 [RFC1901] and RFC 1906 [RFC1906]. The third version of the message protocol is called SNMPv3 and described in RFC 1906 [RFC1906], RFC 2572 [RFC2572] and RFC 2574 [RFC2574].",
      "ja": "o 管理情報を転送するためのメッセージプロトコル。SNMPメッセージプロトコルの最初のバージョンはSNMPV1と呼ばれ、STD 15、RFC 1157 [RFC1157]で説明されています。インターネット標準トラックプロトコルではないSNMPメッセージプロトコルの2番目のバージョンは、SNMPV2Cと呼ばれ、RFC 1901 [RFC1901]およびRFC 1906 [RFC1906]で説明されています。メッセージプロトコルの3番目のバージョンはSNMPV3と呼ばれ、RFC 1906 [RFC1906]、RFC 2572 [RFC2572]およびRFC 2574 [RFC2574]で説明されています。"
    },
    {
      "indent": 3,
      "text": "o Protocol operations for accessing management information. The first set of protocol operations and associated PDU formats is described in STD 15, RFC 1157 [RFC1157]. A second set of protocol operations and associated PDU formats is described in RFC 1905 [RFC1905].",
      "ja": "o 管理情報にアクセスするためのプロトコル操作。プロトコル操作の最初のセットと関連するPDU形式は、STD 15、RFC 1157 [RFC1157]で説明されています。プロトコル操作の2番目のセットと関連するPDU形式は、RFC 1905 [RFC1905]で説明されています。"
    },
    {
      "indent": 3,
      "text": "o A set of fundamental applications described in RFC 2573 [RFC2573] and the view-based access control mechanism described in RFC 2575 [RFC2575].",
      "ja": "o RFC 2573 [RFC2573]に記載されている一連の基本的なアプリケーションと、RFC 2575 [RFC2575]で説明されているビューベースのアクセス制御メカニズム。"
    },
    {
      "indent": 3,
      "text": "A more detailed introduction to the current SNMP Management Framework can be found in RFC 2570 [RFC2570].",
      "ja": "現在のSNMP管理フレームワークのより詳細な紹介は、RFC 2570 [RFC2570]にあります。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. Objects in the MIB are defined using the mechanisms defined in the SMI.",
      "ja": "管理されたオブジェクトは、管理情報ベースまたはMIBと呼ばれる仮想情報ストアからアクセスされます。MIBのオブジェクトは、SMIで定義されたメカニズムを使用して定義されます。"
    },
    {
      "indent": 3,
      "text": "This memo specifies a MIB module that is compliant to the SMIv2. A MIB conforming to the SMIv1 can be produced through the appropriate translations. The resulting translated MIB must be semantically equivalent, except where objects or events are omitted because no translation is possible (use of Counter64). Some machine readable information in SMIv2 will be converted into textual descriptions in SMIv1 during the translation process. However, this loss of machine readable information is not considered to change the semantics of the MIB.",
      "ja": "このメモは、SMIV2に準拠したMIBモジュールを指定します。SMIV1に準拠するMIBは、適切な翻訳を通じて生成できます。結果として生じる翻訳されたMIBは、翻訳が不可能であるためオブジェクトまたはイベントが省略されている場合を除き、意味的に同等でなければなりません（Counter64の使用）。SMIV2の一部の機械読み取り可能な情報は、翻訳プロセス中にSMIV1のテキスト説明に変換されます。ただし、この機械の読み取り可能な情報の損失は、MIBのセマンティクスを変更するとは見なされません。"
    },
    {
      "indent": 0,
      "text": "3. Overview",
      "section_title": true,
      "ja": "3. 概要"
    },
    {
      "indent": 3,
      "text": "The Script MIB module defined in this memo can be used to delegate management functions to distributed managers. Management functions are defined as management scripts written in a management scripting language. This MIB makes no assumptions about the language itself and even allows distribution of compiled native code, if an implementation is able to execute native code under the control of this MIB.",
      "ja": "このメモで定義されているスクリプトMIBモジュールは、分散マネージャーに管理機能を委任するために使用できます。管理機能は、管理スクリプト言語で記述された管理スクリプトとして定義されます。このMIBは、このMIBの制御下で実装がネイティブコードを実行できる場合、言語自体について仮定を行いません。"
    },
    {
      "indent": 3,
      "text": "The Script MIB defines a standard interface for the delegation of management functions based on the Internet management framework. In particular, it provides the following capabilities:",
      "ja": "スクリプトMIBは、インターネット管理フレームワークに基づいて、管理機能の委任の標準インターフェイスを定義します。特に、次の機能を提供します。"
    },
    {
      "indent": 3,
      "text": "1. Capabilities to transfer management scripts to a distributed manager.",
      "ja": "1. 管理スクリプトを分散マネージャーに転送する機能。"
    },
    {
      "indent": 3,
      "text": "2. Capabilities for initiating, suspending, resuming and terminating management scripts.",
      "ja": "2. 管理スクリプトを開始、一時停止、再開、終了する機能。"
    },
    {
      "indent": 3,
      "text": "3. Capabilities to transfer arguments for management scripts.",
      "ja": "3. 管理スクリプトの引数を転送する機能。"
    },
    {
      "indent": 3,
      "text": "4. Capabilities to monitor and control running management scripts.",
      "ja": "4. 実行中の管理スクリプトを監視および制御する機能。"
    },
    {
      "indent": 3,
      "text": "5. Capabilities to transfer the results produced by running management scripts.",
      "ja": "5. 管理スクリプトを実行することで生成された結果を転送する機能。"
    },
    {
      "indent": 3,
      "text": "This memo does not address any additional topics like the generation of notifications or how to address remote agents from a Script MIB implementation.",
      "ja": "このメモは、通知の生成や、スクリプトMIB実装からリモートエージェントに対処する方法などの追加のトピックに対処しません。"
    },
    {
      "indent": 0,
      "text": "3.1. Terms",
      "section_title": true,
      "ja": "3.1. 条項"
    },
    {
      "indent": 3,
      "text": "This section defines the terms used throughout this memo.",
      "ja": "このセクションでは、このメモ全体で使用される用語を定義します。"
    },
    {
      "indent": 3,
      "text": "o A `distributed manager' is a processing entity which is capable of performing network management functions. For the scope of this memo, a distributed manager is assumed to implement the Script MIB.",
      "ja": "o 「分散マネージャー」は、ネットワーク管理機能を実行できる処理エンティティです。このメモの範囲については、分散マネージャーがスクリプトMIBを実装すると想定されています。"
    },
    {
      "indent": 3,
      "text": "o A `higher-level manager', or just `manager', is a processing entity or human who initiates and controls the operations performed by one or more distributed managers.",
      "ja": "o 「高レベルのマネージャー」、または単なる「マネージャー」は、1人以上の分散マネージャーが実行するオペレーションを開始および制御する処理エンティティまたは人間です。"
    },
    {
      "indent": 3,
      "text": "o A `management script' is a set of instructions written in an executable language which implements a management function.",
      "ja": "o 「管理スクリプト」は、管理機能を実装する実行可能言語で書かれた一連の指示です。"
    },
    {
      "indent": 3,
      "text": "o A `management scripting language' is a language used to write management scripts. The term scripting language does not imply that the language must have the characteristics of scripting languages (e.g., string orientation, interpretation, weak typing). The MIB defined in this memo also allows to control management scripts written in arbitrary compiled system programming languages.",
      "ja": "o 「管理スクリプト言語」は、管理スクリプトを作成するために使用される言語です。スクリプト言語という用語は、言語にスクリプト言語の特性を持たなければならないことを意味するものではありません（例：文字列方向、解釈、弱いタイピング）。このメモで定義されているMIBは、任意のコンパイルされたシステムプログラミング言語で記述された管理管理スクリプトを制御することもできます。"
    },
    {
      "indent": 3,
      "text": "o A `distributed manager' can be decomposed into an `SNMP entity' which implements the Script MIB defined in this memo and the ` runtime system' that executes scripts. The Script MIB sees the runtime system as the managed resource which is controlled by the MIB.",
      "ja": "o 「分散マネージャー」は、このメモで定義されたスクリプトMIBとスクリプトを実行する「ランタイムシステム」を実装する「SNMPエンティティ」に分解できます。スクリプトMIBは、ランタイムシステムをMIBによって制御される管理リソースと見なしています。"
    },
    {
      "indent": 6,
      "text": "The runtime system can act as an SNMP application, according to the SNMP architecture defined in RFC 2571 [RFC2571]. For example, a runtime system which sends SNMP requests to other SNMP entities will act as a command generator application. The SNMP applications in the runtime system may use the same SNMP engine which also serves the command responder application used to implement the Script MIB, but they are not required to do so.",
      "ja": "RFC 2571 [RFC2571]で定義されているSNMPアーキテクチャに従って、ランタイムシステムはSNMPアプリケーションとして機能します。たとえば、SNMPリクエストを他のSNMPエンティティに送信するランタイムシステムは、コマンドジェネレーターアプリケーションとして機能します。ランタイムシステムのSNMPアプリケーションは、スクリプトMIBの実装に使用されるコマンドレスポンダーアプリケーションを提供する同じSNMPエンジンを使用する場合がありますが、そうする必要はありません。"
    },
    {
      "indent": 3,
      "text": "o A `launch button' is the conceptual button used to start the execution of a management script. It assigns control parameters to a management script. In particular, it defines the ownership of the scripts started from a launch button. The ownership can be used by the language runtime system to enforce security profiles on a running management script.",
      "ja": "o 「起動ボタン」は、管理スクリプトの実行を開始するために使用される概念ボタンです。管理スクリプトに制御パラメーターを割り当てます。特に、起動ボタンから開始されたスクリプトの所有権を定義します。所有権は、Language Runtime Systemによって使用され、実行中の管理スクリプトでセキュリティプロファイルを実施できます。"
    },
    {
      "indent": 0,
      "text": "4. Requirements and Design Issues",
      "section_title": true,
      "ja": "4. 要件と設計の問題"
    },
    {
      "indent": 3,
      "text": "This section discusses some general requirements that have influenced the design of the Script MIB.",
      "ja": "このセクションでは、スクリプトMIBの設計に影響を与えたいくつかの一般的な要件について説明します。"
    },
    {
      "indent": 3,
      "text": "o The Script MIB must not make any assumptions about specific languages or runtime systems.",
      "ja": "o スクリプトMIBは、特定の言語やランタイムシステムについて仮定してはなりません。"
    },
    {
      "indent": 3,
      "text": "o The Script MIB must provide mechanisms that help to avoid new management problems (e.g., script version problems).",
      "ja": "o スクリプトMIBは、新しい管理の問題を回避するのに役立つメカニズムを提供する必要があります（たとえば、スクリプトバージョンの問題）。"
    },
    {
      "indent": 3,
      "text": "o The Script MIB must provide SNMP interfaces to all functions required to delegate management scripts. However, other protocols might be used in addition if they provide a significant improvement in terms of convenience for implementation or performance.",
      "ja": "o スクリプトMIBは、管理スクリプトを委任するために必要なすべての機能にSNMPインターフェイスを提供する必要があります。ただし、実装やパフォーマンスの利便性に関して大幅な改善を提供する場合、他のプロトコルが使用される場合があります。"
    },
    {
      "indent": 3,
      "text": "o The Script MIB must be organized so that access can be controlled effectively by using view-based access control [RFC2575].",
      "ja": "o スクリプトMIBは、ビューベースのアクセス制御[RFC2575]を使用してアクセスを効果的に制御できるように編成する必要があります。"
    },
    {
      "indent": 3,
      "text": "The following sections discuss some design issues in more detail.",
      "ja": "次のセクションでは、いくつかの設計上の問題についてさらに詳しく説明します。"
    },
    {
      "indent": 0,
      "text": "4.1. Script Languages",
      "section_title": true,
      "ja": "4.1. スクリプト言語"
    },
    {
      "indent": 3,
      "text": "The Script MIB defined in this memo makes no assumption about the script language. This MIB can therefore be used in combination with different languages (such as Tcl or Java) and/or different versions of the same language. No assumptions are made about the format in which management scripts are transferred.",
      "ja": "このメモで定義されているスクリプトMIBは、スクリプト言語について仮定しません。したがって、このMIBは、同じ言語の異なる言語（TCLやJavaなど）および/または異なるバージョンと組み合わせて使用できます。管理スクリプトが転送される形式については、仮定は行われません。"
    },
    {
      "indent": 3,
      "text": "The Script MIB provides access to information about the language versions supported by a Script MIB implementation so that a manager can learn about the capabilities provided by an implementation. Languages and language versions are identified as follows:",
      "ja": "スクリプトMIBは、マネージャーが実装によって提供される機能について学習できるように、スクリプトMIB実装でサポートされている言語バージョンに関する情報へのアクセスを提供します。言語バージョンと言語バージョンは次のように識別されます。"
    },
    {
      "indent": 3,
      "text": "1. The language is identified by an object identifier. Object identifier for well-known languages will be registered by the Internet Assigned Numbers Authority (IANA). Enterprise specific languages can also be registered in the enterprise specific OID subtree.",
      "ja": "1. 言語はオブジェクト識別子によって識別されます。よく知られている言語のオブジェクト識別子は、インターネットに割り当てられた番号局（IANA）によって登録されます。エンタープライズ固有の言語は、エンタープライズ固有のOIDサブツリーに登録することもできます。"
    },
    {
      "indent": 3,
      "text": "2. A particular version of a language is identified by a language version number. The combination of a language object identifier and a language version is in most cases sufficient to decide whether a script can be executed or not.",
      "ja": "2. 言語の特定のバージョンは、言語バージョン番号によって識別されます。言語オブジェクト識別子と言語バージョンの組み合わせは、ほとんどの場合、スクリプトを実行できるかどうかを決定するのに十分です。"
    },
    {
      "indent": 3,
      "text": "3. Different implementations of the same language version might have differences due to ambiguities in the language definition or additional language features provided by an implementor. An additional object identifier value is provided which identifies the organization which provides the implementation of a language. This might be used by scripts that require a particular implementation of a language.",
      "ja": "3. 同じ言語バージョンの実装が異なると、言語定義のあいまいさまたは実装者が提供する追加の言語機能のために違いがある場合があります。言語の実装を提供する組織を識別する追加のオブジェクト識別子値が提供されます。これは、言語の特定の実装を必要とするスクリプトによって使用される場合があります。"
    },
    {
      "indent": 3,
      "text": "4. Finally, there might be different versions of a language implementation. A version number for the language implementation is provided so that the manager can also distinguish between different implementations from the same organization of a particular language version.",
      "ja": "4. 最後に、言語実装にはさまざまなバージョンがあるかもしれません。言語実装のバージョン番号が提供されるため、マネージャーは、特定の言語バージョンの同じ組織と異なる実装を区別できるようにします。"
    },
    {
      "indent": 3,
      "text": "The version numbers can either be used by a manager to select the language version required to execute a particular script or to select a script that fits the language versions supported by a particular Script MIB implementation.",
      "ja": "バージョン番号は、特定のスクリプトを実行するために必要な言語バージョンを選択するか、特定のスクリプトMIB実装でサポートされている言語バージョンに適合するスクリプトを選択するために、マネージャーが使用することができます。"
    },
    {
      "indent": 3,
      "text": "An additional table lists language extensions that provide features not provided by the core language. Language extensions are usually required to turn a general purpose language into a management language. In many cases, language extensions will come in the form of libraries that provide capabilities like sending SNMP requests to remote SNMP agents or accessing the local MIB instrumentation. Every extension is associated with a language and carries its own version numbers.",
      "ja": "追加のテーブルには、コア言語で提供されていない機能を提供する言語拡張機能がリストされています。言語拡張は通常、汎用言語を管理言語に変えるために必要です。多くの場合、言語拡張機能は、SNMPリクエストをリモートSNMPエージェントに送信したり、ローカルMIBインストゥルメントにアクセスするなどの機能を提供するライブラリの形で提供されます。すべての拡張機能は言語に関連付けられており、独自のバージョン番号を搭載しています。"
    },
    {
      "indent": 0,
      "text": "4.2. Script Transfer",
      "section_title": true,
      "ja": "4.2. スクリプト転送"
    },
    {
      "indent": 3,
      "text": "There are two different ways to transfer management scripts to a distributed manager. The first approach requires that the manager pushes the script to the distributed manager. This is therefore called the `push model'. The second approach is the `pull model' where the manager tells the distributed manager the location of the script and the distributed manager retrieves the script itself.",
      "ja": "管理スクリプトを分散マネージャーに転送する方法は2つあります。最初のアプローチでは、マネージャーがスクリプトを分散マネージャーにプッシュする必要があります。したがって、これは「プッシュモデル」と呼ばれます。2番目のアプローチは「プルモデル」です。ここでは、マネージャーが分散マネージャーにスクリプトの場所を伝え、分散マネージャーがスクリプト自体を取得します。"
    },
    {
      "indent": 3,
      "text": "The MIB defined in this memo supports both models. The `push model' is realized by a table which allows a manager to write scripts by sending a sequence of SNMP set requests. The script can be split into several fragments in order to deal with SNMP message size limitations.",
      "ja": "このメモで定義されているMIBは、両方のモデルをサポートしています。「プッシュモデル」は、マネージャーが一連のSNMPセットリクエストを送信してスクリプトを書き込むことができるテーブルによって実現されます。SNMPメッセージサイズの制限を処理するために、スクリプトをいくつかのフラグメントに分割できます。"
    },
    {
      "indent": 3,
      "text": "The `pull model' is realized by the use of Uniform Resource Locators (URLs) [RFC2396] that point to the script source. The manager writes the URL which points to the script source to the distributed manager by sending an SNMP set request. The distributed manager is then responsible for retrieving the document using the protocol specified in the URL. This allows the use of protocols like FTP [RFC959] or HTTP [RFC2616] to transfer large management scripts efficiently.",
      "ja": "「プルモデル」は、スクリプトソースをポイントするユニフォームリソースロケーター（URL）[RFC2396]の使用によって実現されます。マネージャーは、SNMPセットリクエストを送信することにより、分散マネージャーにスクリプトソースを指すURLを書き込みます。分散マネージャーは、URLで指定されたプロトコルを使用してドキュメントを取得する責任があります。これにより、FTP [RFC959]やHTTP [RFC2616]などのプロトコルを使用して、大規模な管理スクリプトを効率的に転送できます。"
    },
    {
      "indent": 3,
      "text": "The Script MIB also allows management scripts that are hard-wired into the Script MIB implementation. Built-in scripts can either be implemented in a language runtime system, or they can be built natively into the Script MIB implementation. The implementation of the `push model' or the `pull model' is not required.",
      "ja": "スクリプトMIBでは、スクリプトMIB実装に強化された管理スクリプトも許可します。組み込みのスクリプトは、言語ランタイムシステムに実装するか、スクリプトMIB実装にネイティブに構築できます。「プッシュモデル」または「プルモデル」の実装は必要ありません。"
    },
    {
      "indent": 3,
      "text": "Scripts can be stored in non-volatile storage. This allows a distributed manager to restart scripts if it is restarted (off-line restart). A manager is not required to push scripts back into the distributed manager after a restart if the script is backed up in non-volatile storage.",
      "ja": "スクリプトは、不揮発性ストレージに保存できます。これにより、分散マネージャーが再起動した場合にスクリプトを再起動できます（オフライン再起動）。マネージャーは、スクリプトが不揮発性ストレージにバックアップされている場合、再起動後にスクリプトを分散マネージャーに戻す必要はありません。"
    },
    {
      "indent": 3,
      "text": "Every script is identified by an administratively assigned name. This name may be used to derive the name which is used to access the script in non-volatile storage. This mapping is implementation specific. However, the mapping must ensure that the Script MIB implementation can handle scripts with the same administrative name owned by different managers. One way to achieve this is to use the script owner in addition to the script name in order to derive the internal name used to refer to a particular script in non-volatile storage.",
      "ja": "すべてのスクリプトは、管理上割り当てられた名前で識別されます。この名前は、不揮発性ストレージのスクリプトにアクセスするために使用される名前を導出するために使用できます。このマッピングは実装固有です。ただし、マッピングは、スクリプトMIBの実装が、異なるマネージャーが所有する同じ管理名でスクリプトを処理できるようにする必要があります。これを達成する1つの方法は、スクリプト名に加えてスクリプト所有者を使用して、不揮発性ストレージの特定のスクリプトを参照するために使用される内部名を導出することです。"
    },
    {
      "indent": 0,
      "text": "4.3. Script Execution",
      "section_title": true,
      "ja": "4.3. スクリプトの実行"
    },
    {
      "indent": 3,
      "text": "The Script MIB permits execution of several instances of the same or different management scripts. Script arguments are passed as OCTET STRING values. Scripts return a single result value which is also an OCTET STRING value. The semantic interpretation of result values is left to the invoking manager or other management scripts. A script invoker must understand the format and semantics of both the arguments and the results of the scripts that it invokes.",
      "ja": "スクリプトMIBは、同じまたは異なる管理スクリプトのいくつかのインスタンスの実行を許可します。スクリプト引数は、Octet文字列値として渡されます。スクリプトは、Octet文字列値でもある単一の結果値を返します。結果値のセマンティックな解釈は、呼び出されたマネージャーまたは他の管理スクリプトに任されています。スクリプトの請求者は、引数とそれが呼び出すスクリプトの結果の形式とセマンティクスを理解する必要があります。"
    },
    {
      "indent": 3,
      "text": "Scripts can also export complex results through a MIB interface. This allows a management application to access and use script results in the same manner as it processes any other MIB data. However, the Script MIB does not provide any special support for the implementation of MIBs through scripts.",
      "ja": "スクリプトは、MIBインターフェイスを介して複雑な結果をエクスポートすることもできます。これにより、管理アプリケーションは、他のMIBデータを処理するのと同じ方法でスクリプト結果にアクセスして使用できます。ただし、スクリプトMIBは、スクリプトを介したMIBSの実装に対する特別なサポートを提供していません。"
    },
    {
      "indent": 3,
      "text": "Runtime errors terminate active scripts. An exit code and a human readable error message is left in the MIB. A notification containing the exit code, the error message and a timestamp is generated when a script terminates with an error exit code.",
      "ja": "ランタイムエラーはアクティブなスクリプトを終了します。出口コードと人間の読み取り可能なエラーメッセージがMIBに残されています。Exitコード、エラーメッセージ、およびタイムスタンプを含む通知が、エラーExitコードでスクリプトが終了すると生成されます。"
    },
    {
      "indent": 3,
      "text": "Script arguments and results do not have any size limitations other than the limits imposed by the SMI and the SNMP protocol. However, implementations of this MIB might have further restrictions. A script designer might therefore choose to return the results via other mechanisms if the script results can be very large. One possibility is to return a URL as a script result which points to the file containing the script output.",
      "ja": "スクリプトの引数と結果には、SMIおよびSNMPプロトコルによって課される制限以外のサイズの制限はありません。ただし、このMIBの実装にはさらに制限がある可能性があります。したがって、スクリプトデザイナーは、スクリプトの結果が非常に大きくなる可能性がある場合、他のメカニズムを介して結果を返すことを選択する場合があります。1つの可能性は、スクリプト出力を含むファイルを指すスクリプト結果としてURLを返すことです。"
    },
    {
      "indent": 3,
      "text": "Executing scripts have a status object attached which allows script execution to be suspended, resumed, or aborted. The precise semantics of the suspend and resume operations are language and runtime system dependent. Some runtime systems may choose to not implement the suspend/resume operations.",
      "ja": "スクリプトの実行には、スクリプトの実行を一時停止、再開、または中止できるようにするステータスオブジェクトが添付されています。一時停止および履歴書の操作の正確なセマンティクスは、言語とランタイムシステムに依存するものです。一部のランタイムシステムは、サスペンド/履歴書操作を実装しないことを選択する場合があります。"
    },
    {
      "indent": 3,
      "text": "A history of finished scripts is kept in the MIB. A script invoker can collect results at a later point in time (offline operation). Control objects can be used to control how entries in the history are aged out if the table fills up.",
      "ja": "完成したスクリプトの履歴はMIBに保持されています。スクリプトの請求者は、後の時点で結果を収集できます（オフライン操作）。コントロールオブジェクトを使用して、テーブルがいっぱいになった場合に歴史のエントリがどのように老化するかを制御できます。"
    },
    {
      "indent": 0,
      "text": "5. Structure of the MIB",
      "section_title": true,
      "ja": "5. MIBの構造"
    },
    {
      "indent": 3,
      "text": "This section presents the structure of the MIB. The objects are arranged into the following groups:",
      "ja": "このセクションでは、MIBの構造を示します。オブジェクトは次のグループに配置されます。"
    },
    {
      "indent": 3,
      "text": "o language group (smLangTable, smExtsnTable)",
      "ja": "o 言語グループ（smlangtable、smextsntable）"
    },
    {
      "indent": 3,
      "text": "o script group (smScriptTable)",
      "ja": "o スクリプトグループ（smscripttable）"
    },
    {
      "indent": 3,
      "text": "o script code group (smCodeTable)",
      "ja": "o スクリプトコードグループ（smcodetable）"
    },
    {
      "indent": 3,
      "text": "o script launch group (smLaunchTable)",
      "ja": "o スクリプト発射グループ（smlaunchtable）"
    },
    {
      "indent": 3,
      "text": "o running script group (smRunTable)",
      "ja": "o ランニングスクリプトグループ（smrununtable）"
    },
    {
      "indent": 0,
      "text": "5.1. Language Group",
      "section_title": true,
      "ja": "5.1. 言語グループ"
    },
    {
      "indent": 3,
      "text": "The smLanguageGroup is used to provide information about the languages and the language extensions supported by a Script MIB implementation. This group includes two tables. The smLangTable lists all languages supported by a Script MIB implementation and the smExtsnTable lists the extensions that are available for a given language.",
      "ja": "SMLANGUAGEGROUPは、スクリプトMIB実装でサポートされている言語と言語拡張機能に関する情報を提供するために使用されます。このグループには2つのテーブルが含まれています。Smlangtableは、スクリプトMIB実装でサポートされているすべての言語をリストし、SmextSntableは特定の言語で使用可能な拡張機能をリストします。"
    },
    {
      "indent": 0,
      "text": "5.2. Script Group",
      "section_title": true,
      "ja": "5.2. スクリプトグループ"
    },
    {
      "indent": 3,
      "text": "The smScriptGroup consists of a single table, called the smScriptTable. The smScriptTable lists all scripts known to a Script MIB implementation. The smScriptTable contains objects that allow the following operations:",
      "ja": "smscriptgroupは、smscripttableと呼ばれる単一のテーブルで構成されています。smscripttableは、スクリプトMIB実装に既知のすべてのスクリプトをリストします。smscripttableには、次の操作を許可するオブジェクトが含まれています。"
    },
    {
      "indent": 3,
      "text": "o download scripts from a URL (pull model)",
      "ja": "o URL（プルモデル）からスクリプトをダウンロードする"
    },
    {
      "indent": 3,
      "text": "o read scripts from local non-volatile storage",
      "ja": "o ローカルの不揮発性ストレージからスクリプトを読んでください"
    },
    {
      "indent": 3,
      "text": "o store scripts in local non-volatile storage",
      "ja": "o ローカルの不揮発性ストレージにスクリプトを保存します"
    },
    {
      "indent": 3,
      "text": "o delete scripts from local non-volatile storage",
      "ja": "o ローカルの不揮発性ストレージからスクリプトを削除します"
    },
    {
      "indent": 3,
      "text": "o list permanent scripts (that can not be changed or removed)",
      "ja": "o 永続的なスクリプトをリストします（変更または削除できません）"
    },
    {
      "indent": 3,
      "text": "o read and modify the script status (enabled, disabled, editing)",
      "ja": "o スクリプトステータスを読み取り、変更します（有効、無効、編集）"
    },
    {
      "indent": 3,
      "text": "A status object called smScriptOperStatus allows a manager to obtain the current status of a script. It is also used to provide an error indication if an attempt to invoke one of the operations listed above fails. The status change of a script can be requested by modifying the associated smScriptAdminStatus object.",
      "ja": "smscriptoperstatusというステータスオブジェクトにより、マネージャーはスクリプトの現在のステータスを取得できます。また、上記の操作の1つを呼び出そうとする試みが失敗した場合、エラー表示を提供するためにも使用されます。スクリプトのステータスの変更は、関連するsmscriptadmintatusオブジェクトを変更することで要求できます。"
    },
    {
      "indent": 3,
      "text": "The source of a script is defined by the smScriptSource object. This object may contain a URL pointing to a remote location which provides access to the management script. The script source is read from the smCodeTable (described below) or from non-volatile storage if the smScriptSource object contains an empty URL. The smScriptStorageType object is used to distinguish between scripts read from non-volatile storage and scripts read from the smCodeTable.",
      "ja": "スクリプトのソースは、SMScriptSourceオブジェクトによって定義されます。このオブジェクトには、管理スクリプトへのアクセスを提供するリモートロケーションを指すURLが含まれている場合があります。スクリプトソースは、SMScriptSourceオブジェクトに空のURLが含まれている場合、SMCodeTable（以下で説明）または不揮発性ストレージから読み取られます。SMScriptStorageTypeオブジェクトは、不揮発性ストレージから読み取られたスクリプトとSMCodetableから読み取られるスクリプトを区別するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Scripts are automatically loaded once the smScriptAdminStatus object is set to `enabled'. Loading a script includes retrieving the script (probably from a remote location), compiling the script for languages that require a compilation step, and making the code available to the runtime system. The smScriptOperStatus object is used to indicate the status of the loading process. This object will start in the state `retrieving', switch to the state `compiling' and finally reach the state `enabled'. Errors during the retrieval or compilation phase will result in an error state such as `compilationFailed'.",
      "ja": "SMScriptadminStatusオブジェクトが「有効」に設定されると、スクリプトは自動的にロードされます。スクリプトのロードには、スクリプトの取得（おそらくリモートロケーションから）、コンパイルステップが必要な言語のスクリプトをコンパイルし、ランタイムシステムでコードを使用できるようにすることが含まれます。smscriptoperstatusオブジェクトは、負荷プロセスのステータスを示すために使用されます。このオブジェクトは、状態「取得」で開始され、状態「コンパイル」に切り替え、最終的に「有効」状態に到達します。検索またはコンピレーションフェーズ中のエラーは、「コンパイルファイル」などのエラー状態になります。"
    },
    {
      "indent": 0,
      "text": "5.3. Code Group",
      "section_title": true,
      "ja": "5.3. コードグループ"
    },
    {
      "indent": 3,
      "text": "The smCodeGroup consists of a single table, called the smCodeTable, which provides the ability to transfer and modify scripts via SNMP set requests. In particular, the smCodeTable allows the following operations:",
      "ja": "SMCODEGROUPは、SMCodeTableと呼ばれる単一のテーブルで構成されており、SNMPセットリクエストを介してスクリプトを転送および変更する機能を提供します。特に、SMCodeTableは次の操作を許可します。"
    },
    {
      "indent": 3,
      "text": "o download scripts via SNMP (push model)",
      "ja": "o SNMP（プッシュモデル）を介してスクリプトをダウンロードする"
    },
    {
      "indent": 3,
      "text": "o modify scripts via SNMP (editing)",
      "ja": "o SNMPを介してスクリプトを変更する（編集）"
    },
    {
      "indent": 3,
      "text": "The smCodeTable lists the code of a script. A script can be fragmented over multiple rows of the smCodeTable in order to handle SNMP message size limitations. Modifications of the smCodeTable are only possible if the associated smScriptOperStatus object has the value `editing'. The Script MIB implementation reloads the modified script code once the smScriptOperStatus changes to `enabled' again.",
      "ja": "smcodeTableは、スクリプトのコードをリストします。SNMPメッセージサイズの制限を処理するために、スクリプトをSMCodeTableの複数の行に断片化できます。SMCodeTableの変更は、関連するSMScriptoperstatusオブジェクトに値「編集」がある場合にのみ可能です。スクリプトMIB実装は、smscriptoperstatusが再び「有効」に変更されると、変更されたスクリプトコードをリロードします。"
    },
    {
      "indent": 3,
      "text": "The implementation of the smCodeGroup is optional.",
      "ja": "SMCODEGROUPの実装はオプションです。"
    },
    {
      "indent": 0,
      "text": "5.4. Launch Group",
      "section_title": true,
      "ja": "5.4. 起動グループ"
    },
    {
      "indent": 3,
      "text": "The smLaunchGroup contains a single table, the smLaunchTable. An entry in the smLaunchTable represents a launch button which can be used to start a script. The smLaunchTable allows the following operations:",
      "ja": "SmlaunchGroupには、単一のテーブル、SmlaunchTableが含まれています。smlaunchtableのエントリは、スクリプトの開始に使用できる起動ボタンを表します。smlaunchTableは、次の操作を許可します。"
    },
    {
      "indent": 3,
      "text": "o associate a script with an owner used during script execution",
      "ja": "o スクリプトをスクリプトの実行中に使用した所有者と関連付ける"
    },
    {
      "indent": 3,
      "text": "o provide arguments and parameters for script invocation",
      "ja": "o スクリプトの呼び出しの引数とパラメーターを提供します"
    },
    {
      "indent": 3,
      "text": "o invoke scripts with a single set operation",
      "ja": "o 単一のセット操作でスクリプトを呼び出します"
    },
    {
      "indent": 3,
      "text": "The smLaunchTable describes scripts and their parameters that are ready to be launched. An entry in the smLaunchTable attaches an argument to a script and control values which, for example, define the maximum number of times that a script invoked from a particular row in the smLaunchTable may be running concurrently.",
      "ja": "SmlaunchTableは、起動する準備ができているスクリプトとそのパラメーターについて説明します。SmlaunchTableのエントリは、たとえば、SMLAunchTableの特定の行から呼び出されたスクリプトが同時に実行されている可能性がある最大回数を定義するスクリプトと制御値に引数を添付します。"
    },
    {
      "indent": 3,
      "text": "An entry in the smLaunchTable also defines the owner which will be used to associate permissions with the script execution.",
      "ja": "SmlaunchTableのエントリは、権限をスクリプト実行に関連付けるために使用される所有者も定義します。"
    },
    {
      "indent": 0,
      "text": "5.5. Run Group",
      "section_title": true,
      "ja": "5.5. ラングループ"
    },
    {
      "indent": 3,
      "text": "The smRunGroup contains a single table, called the smRunTable, which lists all scripts that are currently running or have terminated recently. The smRunTable contains objects that allow the following operations: o retrieve status information from running scripts",
      "ja": "Smrungroupには、Smruntableと呼ばれる単一のテーブルが含まれており、現在実行中または最近終了したすべてのスクリプトをリストしています。smrununtableには、次の操作を許可するオブジェクトが含まれています：o実行されたスクリプトからステータス情報を取得する"
    },
    {
      "indent": 3,
      "text": "o control running scripts (suspend, resume, abort)",
      "ja": "o 実行中のスクリプトを制御する（一時停止、履歴書、中止）"
    },
    {
      "indent": 3,
      "text": "o retrieve results from recently terminated scripts",
      "ja": "o 最近終了したスクリプトから結果を取得します"
    },
    {
      "indent": 3,
      "text": "o control the remaining maximum lifetime of a running script",
      "ja": "o 実行中のスクリプトの残りの最大寿命を制御します"
    },
    {
      "indent": 3,
      "text": "o control how long script results are accessible",
      "ja": "o スクリプトの結果にアクセスできる期間を制御します"
    },
    {
      "indent": 3,
      "text": "Every row in the smRunTable contains the argument passed during script invocation, the result produced by the script and the script exit code. The smRunTable also provides information about the current run state as well as start and end time-stamps. There are three writable objects in the smRunTable. The smRunLifeTime object defines the maximum time a running script may run before it is terminated by the Script MIB implementation. The smRunExpireTime object defines the time that a completed script can stay in the smRunTable before it is aged out. The smRunControl object allows running scripts to be suspended, resumed, or aborted.",
      "ja": "Smruntableのすべての行には、スクリプトの呼び出し中に渡された引数が含まれています。これは、スクリプトとスクリプト終了コードによって作成された結果です。Smruntableは、現在の実行状態と開始および終了のタイムスタンプに関する情報も提供します。smruntableには3つの書き込み可能なオブジェクトがあります。SMRUNLIFETIMEオブジェクトは、スクリプトMIB実装によって終了する前に実行されているスクリプトが実行できる最大時間を定義します。SMRUNEXPIRETIMEオブジェクトは、完成したスクリプトが老化する前にSMRRUNTABLEにとどまることができる時間を定義します。SmrunControlオブジェクトにより、実行されるスクリプトを一時停止、再開、または中止することができます。"
    },
    {
      "indent": 0,
      "text": "6. Definitions",
      "section_title": true,
      "ja": "6. 定義"
    },
    {
      "indent": 3,
      "text": "DISMAN-SCRIPT-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, NOTIFICATION-TYPE, Integer32, Unsigned32, mib-2 FROM SNMPv2-SMI",
      "ja": "インポートモジュールアイデンティティ、オブジェクトタイプ、通知タイプ、integer32、unsigned32、mib-2 from snmpv2-smi"
    },
    {
      "indent": 7,
      "text": "RowStatus, TimeInterval, DateAndTime, StorageType, DisplayString FROM SNMPv2-TC",
      "ja": "RowStatus、TimeInterval、dateandtime、StorageType、snmpv2-tcからのディスプレイストリング"
    },
    {
      "indent": 7,
      "text": "MODULE-COMPLIANCE, OBJECT-GROUP, NOTIFICATION-GROUP FROM SNMPv2-CONF",
      "ja": "Module Compliance、Object-Group、Snmpv2-confの通知グループ"
    },
    {
      "indent": 7,
      "text": "SnmpAdminString FROM SNMP-FRAMEWORK-MIB;",
      "ja": "snmp-framework-mibからのsnmpadminstring;"
    },
    {
      "indent": 3,
      "text": "scriptMIB MODULE-IDENTITY LAST-UPDATED \"200108210000Z\" ORGANIZATION \"IETF Distributed Management Working Group\" CONTACT-INFO \"WG EMail: disman@dorothy.bmc.com Subscribe: disman-request@dorothy.bmc.com",
      "ja": "scriptMib Module-Identity Last-Updated \"200108210000z\" angization \"IETF分散マネジメントワーキンググループ\" contact-info \"wg email：disman@dorothy.bmc.comサブスクライブ：disman-request@dorothy.bmc.com"
    },
    {
      "indent": 12,
      "text": "Chair: Randy Presuhn BMC Software, Inc.",
      "ja": "議長：Randy Presuhn BMC Software、Inc。"
    },
    {
      "indent": 12,
      "text": "Postal: Office 1-3141 2141 North First Street San Jose, California 95131 USA EMail: rpresuhn@bmc.com Phone: +1 408 546-1006",
      "ja": "郵便：オフィス1-3141 2141ノースファーストストリートサンノゼ、カリフォルニア95131 USAメール：rpresuhn@bmc.com電話：1 408 546-1006"
    },
    {
      "indent": 12,
      "text": "Editor: David B. Levi Nortel Networks Postal: 4401 Great America Parkway Santa Clara, CA 95052-8185 USA EMail: dlevi@nortelnetworks.com Phone: +1 423 686 0432",
      "ja": "編集者：David B. Levi Nortel Networks Postal：4401 Great America Parkway Santa Clara、CA 95052-8185 USAメール：dlevi@nortelnetworks.com電話：1 423 686 0432"
    },
    {
      "indent": 7,
      "text": " Editor: Juergen Schoenwaelder TU Braunschweig Postal: Bueltenweg 74/75 38106 Braunschweig Germany EMail: schoenw@ibr.cs.tu-bs.de Phone: +49 531 391-3283\" DESCRIPTION \"This MIB module defines a set of objects that allow to delegate management scripts to distributed managers.\" REVISION \"200108210000Z\" DESCRIPTION \"Revised version, published as RFC 3165.",
      "ja": "編集者：Juergen Schoenwaelder Tu Braunschweig Postal：Bueltenweg 74/75 38106 Braunschweigドイツメールメール：schoenw@ibr.cs.tu-bs.de電話：49 531 391-3283分散マネージャーへの管理スクリプト。「改訂」200108210000Z \"説明\"改訂版、RFC 3165として公開されています。"
    },
    {
      "indent": 12,
      "text": "This revision introduces several new objects: smScriptError, smScriptLastChange, smLaunchError, smLaunchLastChange, smLaunchRowExpireTime, smRunResultTime, and smRunErrorTime.",
      "ja": "このリビジョンでは、Smscripterror、Smscriptlastchange、Smlauncherror、SmlaunchLastchange、SmlaunchRowExpiretime、SmrunResulttime、およびSmrunerrortime：いくつかの新しいオブジェクトが紹介されています。"
    },
    {
      "indent": 12,
      "text": "The following existing objects were updated: the maximum value of smRunLifeTime now disables the timer, an autostart value was added to the smLaunchAdminStatus object, and a new expired state was added to the smLaunchOperStatus object.",
      "ja": "以下の既存のオブジェクトが更新されました。Smrunlifetimeの最大値は、タイマーを無効にし、SmlaunchAdmintatusオブジェクトにオートステルト値が追加され、Smlaunchoperstatusオブジェクトに新しい期限切れの状態が追加されました。"
    },
    {
      "indent": 12,
      "text": "A new smScriptException notification has been added to support runtime error notifications.",
      "ja": "ランタイムエラー通知をサポートするために、新しいsmscriptexception通知が追加されました。"
    },
    {
      "indent": 12,
      "text": "Created new conformance and compliance statements that take care of the new objects and notifications.",
      "ja": "新しいオブジェクトと通知を処理する新しい適合とコンプライアンスステートメントを作成しました。"
    },
    {
      "indent": 12,
      "text": "Clarifications have been added in several places to remove ambiguities or contradictions that were discovered and reported by implementors.\"",
      "ja": "実装者によって発見および報告されたあいまいさまたは矛盾を削除するために、いくつかの場所に説明が追加されました。」"
    },
    {
      "indent": 7,
      "text": "REVISION    \"199902221800Z\"\nDESCRIPTION\n    \"Initial version, published as RFC 2592.\"\n::= { mib-2 64 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-- -- The groups defined within this MIB module: --",
      "ja": "---このMIBモジュール内で定義されたグループ： - "
    },
    {
      "indent": 3,
      "text": "smObjects       OBJECT IDENTIFIER ::= { scriptMIB 1 }\nsmNotifications OBJECT IDENTIFIER ::= { scriptMIB 2 }\nsmConformance   OBJECT IDENTIFIER ::= { scriptMIB 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "--\n-- Script language and language extensions.\n--\n-- This group defines tables which list the languages and the\n-- language extensions supported by a Script MIB implementation.\n-- Languages are uniquely identified by object identifier values.\n--",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLangTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmLangEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table lists supported script languages.\"\n    ::= { smObjects 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLangEntry OBJECT-TYPE\n    SYNTAX      SmLangEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"An entry describing a particular language.\"\n    INDEX { smLangIndex }\n    ::= { smLangTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "SmLangEntry ::= SEQUENCE {\n    smLangIndex         Integer32,\n    smLangLanguage      OBJECT IDENTIFIER,\n    smLangVersion       SnmpAdminString,\n    smLangVendor        OBJECT IDENTIFIER,\n    smLangRevision      SnmpAdminString,\n    smLangDescr         SnmpAdminString\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLangIndex OBJECT-TYPE",
      "ja": "smlangindexオブジェクトタイプ"
    },
    {
      "indent": 7,
      "text": "SYNTAX Integer32 (1..2147483647) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The locally arbitrary, but unique identifier associated with this language entry.",
      "ja": "構文integer32（1..2147483647）最大アクセスアクセス不可能なステータス現在の説明 \"この言語エントリに関連付けられたローカル任意の、しかし一意の識別子。"
    },
    {
      "indent": 12,
      "text": "The value is expected to remain constant at least from one re-initialization of the entity's network management system to the next re-initialization.",
      "ja": "この値は、少なくともエンティティのネットワーク管理システムの1つの再初期化から、次の再初期化まで一定であると予想されます。"
    },
    {
      "indent": 7,
      "text": "     Note that the data type and the range of this object must\n     be consistent with the definition of smScriptLanguage.\"\n::= { smLangEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLangLanguage OBJECT-TYPE\n    SYNTAX      OBJECT IDENTIFIER\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The globally unique identification of the language.\"\n    ::= { smLangEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLangVersion OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The version number of the language. The zero-length string shall be used if the language does not have a version number.",
      "ja": "Smlangversion Object-Type Sntax SNMPADMINSTRING（SIZE（0..32））MAX-ACCESS READ-ONLYステータス現在"
    },
    {
      "indent": 7,
      "text": "     It is suggested that the version number consist of one or\n     more decimal numbers separated by dots, where the first\n     number is called the major version number.\"\n::= { smLangEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLangVendor OBJECT-TYPE SYNTAX OBJECT IDENTIFIER MAX-ACCESS read-only STATUS current DESCRIPTION \"An object identifier which identifies the vendor who provides the implementation of the language. This object identifier SHALL point to the object identifier directly below the enterprise object identifier {1 3 6 1 4 1} allocated for the vendor. The value must be the object identifier {0 0} if the vendor is not known.\"",
      "ja": "smlangvendorオブジェクトタイプ構文識別子識別子最大アクセス読み取り専用ステータス現在の説明 \"言語の実装を提供するベンダーを識別するオブジェクト識別子。6 1 4 1}ベンダーに割り当てられます。値は、ベンダーが不明な場合はオブジェクト識別子{0 0}でなければなりません。」"
    },
    {
      "indent": 7,
      "text": "::= { smLangEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLangRevision OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The version number of the language implementation. The value of this object must be an empty string if version number of the implementation is unknown.",
      "ja": "smlangrevision object-type sntax snmpadminstring（size（0..32））max-access読み取り専用ステータス現在の説明 \"言語実装のバージョン番号。実装のバージョン番号の場合、このオブジェクトの値は空の文字列でなければなりません未知。"
    },
    {
      "indent": 7,
      "text": "     It is suggested that the value consist of one or more\n     decimal numbers separated by dots, where the first\n     number is called the major version number.\"\n::= { smLangEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLangDescr OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"A textual description of the language.\"\n    ::= { smLangEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smExtsnTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmExtsnEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table lists supported language extensions.\"\n    ::= { smObjects 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smExtsnEntry OBJECT-TYPE\n    SYNTAX      SmExtsnEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"An entry describing a particular language extension.\"\n    INDEX { smLangIndex, smExtsnIndex }\n    ::= { smExtsnTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "SmExtsnEntry ::= SEQUENCE {\n    smExtsnIndex        Integer32,\n    smExtsnExtension    OBJECT IDENTIFIER,\n    smExtsnVersion      SnmpAdminString,\n    smExtsnVendor       OBJECT IDENTIFIER,\n    smExtsnRevision     SnmpAdminString,\n       smExtsnDescr        SnmpAdminString\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smExtsnIndex OBJECT-TYPE SYNTAX Integer32 (1..2147483647) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The locally arbitrary, but unique identifier associated with this language extension entry.",
      "ja": "smextsnindexオブジェクトタイプ構文integer32（1..2147483647）最大アクセスアクセス不可能なステータス現在の説明 \"この言語拡張エントリに関連するローカル任意の、しかし一意の識別子。"
    },
    {
      "indent": 7,
      "text": "     The value is expected to remain constant at least from one\n     re-initialization of the entity's network management system\n     to the next re-initialization.\"\n::= { smExtsnEntry 1}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smExtsnExtension OBJECT-TYPE\n    SYNTAX      OBJECT IDENTIFIER\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The globally unique identification of the language\n         extension.\"\n    ::= { smExtsnEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smExtsnVersion OBJECT-TYPE\n    SYNTAX      SnmpAdminString (SIZE (0..32))\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The version number of the language extension.\n         It is suggested that the version number consist of one or\n         more decimal numbers separated by dots, where the first\n         number is called the major version number.\"\n    ::= { smExtsnEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smExtsnVendor OBJECT-TYPE\n    SYNTAX      OBJECT IDENTIFIER\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"An object identifier which identifies the vendor who\n         provides the implementation of the extension. The\n         object identifier value should point to the OID node\n         directly below the enterprise OID {1 3 6 1 4 1}\n         allocated for the vendor. The value must by the object\n         identifier {0 0} if the vendor is not known.\"\n    ::= { smExtsnEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smExtsnRevision OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-only STATUS current DESCRIPTION \"The version number of the extension implementation. The value of this object must be an empty string if version number of the implementation is unknown.",
      "ja": "smextsnrevisionオブジェクトタイプ構文SNMPADMINSTRING（size（0..32））max-access読み取り専用ステータス現在の説明 \"拡張実装のバージョン番号。このオブジェクトの値は、実装のバージョン番号の場合は空の文字未知。"
    },
    {
      "indent": 7,
      "text": "     It is suggested that the value consist of one or more\n     decimal numbers separated by dots, where the first\n     number is called the major version number.\"\n::= { smExtsnEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smExtsnDescr OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"A textual description of the language extension.\"\n    ::= { smExtsnEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "--\n-- Scripts known by the Script MIB implementation.\n--\n-- This group defines a table which lists all known scripts.\n-- Scripts can be added and removed through manipulation of the\n-- smScriptTable.\n--",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptObjects OBJECT IDENTIFIER ::= { smObjects 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmScriptEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table lists and describes locally known scripts.\"\n    ::= { smScriptObjects 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptEntry OBJECT-TYPE SYNTAX SmScriptEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"An entry describing a particular script. Every script that is stored in non-volatile memory is required to appear in this script table.\"",
      "ja": "smscriptentry object-type syntax smscriptentry max-accessアクセス不可能なステータス現在"
    },
    {
      "indent": 7,
      "text": "INDEX { smScriptOwner, smScriptName }\n::= { smScriptTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "SmScriptEntry ::= SEQUENCE {\n    smScriptOwner       SnmpAdminString,\n    smScriptName        SnmpAdminString,\n    smScriptDescr       SnmpAdminString,\n    smScriptLanguage    Integer32,\n    smScriptSource      DisplayString,\n    smScriptAdminStatus INTEGER,\n    smScriptOperStatus  INTEGER,\n    smScriptStorageType StorageType,\n    smScriptRowStatus   RowStatus,\n    smScriptError       SnmpAdminString,\n    smScriptLastChange  DateAndTime\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptOwner OBJECT-TYPE\n    SYNTAX      SnmpAdminString (SIZE (0..32))\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The manager who owns this row in the smScriptTable.\"\n    ::= { smScriptEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptName OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (1..32)) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The locally-unique, administratively assigned name for this script. This object allows an smScriptOwner to have multiple entries in the smScriptTable.",
      "ja": "smscriptname object-type sntax snmpadminstring（size（1..32））max-access not-accessable current current current \"このスクリプトの局所的には、管理的に割り当てられた名前。"
    },
    {
      "indent": 7,
      "text": "     This value of this object may be used to derive the name\n     (e.g. a file name) which is used by the Script MIB\n     implementation to access the script in non-volatile\n     storage. The details of this mapping are implementation\n     specific. However, the mapping needs to ensure that scripts\n     created by different owners with the same script name do not\n     map to the same name in non-volatile storage.\"\n::= { smScriptEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptDescr OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-create STATUS current DESCRIPTION",
      "ja": "smscriptdescr object-type sntax snmpadminstring max-access read-createステータス現在の説明"
    },
    {
      "indent": 7,
      "text": "    \"A description of the purpose of the script.\"\n::= { smScriptEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptLanguage OBJECT-TYPE SYNTAX Integer32 (0..2147483647) MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object type identifies an entry in the smLangTable which is used to execute this script. The special value 0 may be used by hard-wired scripts that can not be modified and that are executed by internal functions.",
      "ja": "smscriptlanguage object-type syntax integer32（0..2147483647）max-access read-createステータス現在の説明 \"このオブジェクトタイプの値は、このスクリプトを実行するために使用されるsmlangtableのエントリを識別します。変更できず、内部関数によって実行されるハードワイヤードスクリプト。"
    },
    {
      "indent": 12,
      "text": "Set requests to change this object are invalid if the value of smScriptOperStatus is `enabled' or `compiling' and will result in an inconsistentValue error.",
      "ja": "SMScriptoperstatusの値が「有効」または「コンパイル」であり、一貫性のない値エラーが発生する場合、このオブジェクトを変更するリクエストを設定します。"
    },
    {
      "indent": 7,
      "text": "     Note that the data type and the range of this object must\n     be consistent with the definition of smLangIndex.\"\n::= { smScriptEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptSource OBJECT-TYPE SYNTAX DisplayString MAX-ACCESS read-create STATUS current DESCRIPTION \"This object either contains a reference to the script source or an empty string. A reference must be given in the form of a Uniform Resource Locator (URL) as defined in RFC 2396. The allowed character sets and the encoding rules defined in RFC 2396 section 2 apply.",
      "ja": "smscriptsource object-type syntax displaystring max-access read-createステータス現在の説明 \"このオブジェクトには、スクリプトソースまたは空の文字列への参照が含まれています。RFC2396。許可された文字セットとRFC 2396で定義されているエンコードルールが適用されます。"
    },
    {
      "indent": 12,
      "text": "When the smScriptAdminStatus object is set to `enabled', the Script MIB implementation will `pull' the script source from the URL contained in this object if the URL is not empty.",
      "ja": "smscriptadmintatusオブジェクトが「有効」に設定されている場合、スクリプトMIB実装は、URLが空でない場合、このオブジェクトに含まれるURLからスクリプトソースを「プル」します。"
    },
    {
      "indent": 12,
      "text": "An empty URL indicates that the script source is loaded from local storage. The script is read from the smCodeTable if the value of smScriptStorageType is volatile. Otherwise, the script is read from non-volatile storage.",
      "ja": "空のURLは、スクリプトソースがローカルストレージからロードされていることを示します。スクリプトは、smscriptStorageTypeの値が揮発性である場合、SMCodeTableから読み取られます。それ以外の場合、スクリプトは不揮発性ストレージから読み取られます。"
    },
    {
      "indent": 12,
      "text": "Note: This document does not mandate implementation of any specific URL scheme. An attempt to load a script from a nonsupported URL scheme will cause the smScriptOperStatus to report an `unknownProtocol' error.",
      "ja": "注：このドキュメントは、特定のURLスキームの実装を義務付けていません。サポートされていないURLスキームからスクリプトをロードしようとすると、SMScriptoperstatusは「不明なプロトコル」エラーを報告します。"
    },
    {
      "indent": 7,
      "text": "     Set requests to change this object are invalid if the\n     value of smScriptOperStatus is `enabled', `editing',\n     `retrieving' or `compiling' and will result in an\n     inconsistentValue error.\"\nDEFVAL { ''H }\n::= { smScriptEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptAdminStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    enabled(1),\n                    disabled(2),\n                    editing(3)\n                }\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The value of this object indicates the desired status of\n         the script. See the definition of smScriptOperStatus for\n         a description of the values.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "     When the smScriptAdminStatus object is set to `enabled' and\n     the smScriptOperStatus is `disabled' or one of the error\n     states, the Script MIB implementation will `pull' the script\n     source from the URL contained in the smScriptSource object\n     if the URL is not empty.\"\nDEFVAL { disabled }\n::= { smScriptEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptOperStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    enabled(1),\n                    disabled(2),\n                    editing(3),\n                    retrieving(4),\n                    compiling(5),\n                    noSuchScript(6),\n                    accessDenied(7),\n                    wrongLanguage(8),\n                    wrongVersion(9),\n                    compilationFailed(10),\n                    noResourcesLeft(11),\n                    unknownProtocol(12),\n                    protocolFailure(13),\n                    genericError(14)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "\"The actual status of the script in the runtime system. The value of this object is only meaningful when the value of the smScriptRowStatus object is `active'.",
      "ja": "「ランタイムシステムのスクリプトの実際のステータス。このオブジェクトの値は、SMSCriptrowStatusオブジェクトの値が「アクティブ」である場合にのみ意味があります。"
    },
    {
      "indent": 12,
      "text": "The smScriptOperStatus object may have the following values:",
      "ja": "smscriptoperstatusオブジェクトには、次の値がある場合があります。"
    },
    {
      "indent": 12,
      "text": "- `enabled' indicates that the script is available and can be started by a launch table entry.",
      "ja": "- 「有効」は、スクリプトが利用可能であり、起動テーブルエントリによって開始できることを示します。"
    },
    {
      "indent": 12,
      "text": "- `disabled' indicates that the script can not be used.",
      "ja": "- 「無効」は、スクリプトを使用できないことを示します。"
    },
    {
      "indent": 12,
      "text": "- `editing' indicates that the script can be modified in the smCodeTable.",
      "ja": "- 「編集」は、スクリプトをsmcodetableで変更できることを示します。"
    },
    {
      "indent": 12,
      "text": "- `retrieving' indicates that the script is currently being loaded from non-volatile storage or a remote system.",
      "ja": "- 「取得」は、スクリプトが現在不揮発性ストレージまたはリモートシステムからロードされていることを示しています。"
    },
    {
      "indent": 12,
      "text": "- `compiling' indicates that the script is currently being compiled by the runtime system.",
      "ja": "- 「コンパイル」は、スクリプトが現在ランタイムシステムによってコンパイルされていることを示します。"
    },
    {
      "indent": 12,
      "text": "- `noSuchScript' indicates that the script does not exist at the smScriptSource.",
      "ja": "- 「nosuchscript」は、スクリプトがsmscriptsourceに存在しないことを示します。"
    },
    {
      "indent": 12,
      "text": "- `accessDenied' indicates that the script can not be loaded from the smScriptSource due to a lack of permissions.",
      "ja": "- 「アクセス」は、権限がないためにスクリプトをsmscriptSourceからロードできないことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `wrongLanguage' indicates that the script can not be loaded from the smScriptSource because of a language mismatch.",
      "ja": "- 「不正行為」は、言語の不一致のためにスクリプトをsmscriptsourceからロードできないことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `wrongVersion' indicates that the script can not be loaded from the smScriptSource because of a language version mismatch.",
      "ja": "- 「間違ったバージョン」は、言語バージョンの不一致のためにスクリプトをsmscriptsourceからロードできないことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `compilationFailed' indicates that the compilation failed.",
      "ja": "- 「CompilationFailed」は、コンパイルが失敗したことを示します。"
    },
    {
      "indent": 12,
      "text": "- `noResourcesLeft' indicates that the runtime system does not have enough resources to load the script.",
      "ja": "- 「noresourcesLeft」は、ランタイムシステムにスクリプトをロードするのに十分なリソースがないことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `unknownProtocol' indicates that the script could not be loaded from the smScriptSource because the requested protocol is not supported.",
      "ja": "- 「未知のプロトコル」は、要求されたプロトコルがサポートされていないため、スクリプトをSMScriptSourceからロードできなかったことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `protocolFailure' indicates that the script could not be loaded from the smScriptSource because of a protocol failure.",
      "ja": "- `Protocolfailure 'は、プロトコルの障害のためにスクリプトをsmscriptsourceからロードできなかったことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `genericError' indicates that the script could not be",
      "ja": "- 「genericerror」は、スクリプトができなかったことを示しています"
    },
    {
      "indent": 14,
      "text": "loaded due to an error condition not listed above.",
      "ja": "上記のエラー条件のためにロードされます。"
    },
    {
      "indent": 12,
      "text": "The `retrieving' and `compiling' states are transient states which will either lead to one of the error states or the `enabled' state. The `disabled' and `editing' states are administrative states which are only reached by explicit management operations.",
      "ja": "「取得」状態と「コンパイル」状態は、エラー状態の1つまたは「有効」状態のいずれかにつながる一時的な状態です。「無効」状態と「編集」状態は、明示的な管理操作によってのみ到達される管理状態です。"
    },
    {
      "indent": 7,
      "text": "     All launch table entries that refer to this script table\n     entry shall have an smLaunchOperStatus value of `disabled'\n     when the value of this object is not `enabled'.\"\nDEFVAL { disabled }\n::= { smScriptEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptStorageType OBJECT-TYPE SYNTAX StorageType MAX-ACCESS read-create STATUS current DESCRIPTION \"This object defines whether this row and the script controlled by this row are kept in volatile storage and lost upon reboot or if this row is backed up by non-volatile or permanent storage.",
      "ja": "smscriptStorageTypeオブジェクトタイプの構文storageType max-access read-createステータス現在の説明 \"このオブジェクトは、この行によって制御されるこの行が揮発性ストレージに保持され、再起動時に失われるか、またはこの行が非揮発性またはバックアップされているかどうかを定義します。永続的なストレージ。"
    },
    {
      "indent": 12,
      "text": "The storage type of this row always complies with the value of this entry if the value of the corresponding RowStatus object is `active'.",
      "ja": "対応するRowStatusオブジェクトの値が「アクティブ」である場合、この行のストレージタイプは、このエントリの値に常に準拠しています。"
    },
    {
      "indent": 12,
      "text": "However, the storage type of the script controlled by this row may be different, if the value of this entry is `non-volatile'. The script controlled by this row is written into local non-volatile storage if the following condition becomes true:",
      "ja": "ただし、このエントリの値が「不揮発性」である場合、この行によって制御されるスクリプトのストレージタイプは異なる場合があります。この行によって制御されるスクリプトは、次の条件が真実になった場合、ローカルの不揮発性ストレージに書き込まれます。"
    },
    {
      "indent": 12,
      "text": "(a) the URL contained in the smScriptSource object is empty and (b) the smScriptStorageType is `nonVolatile' and (c) the smScriptOperStatus is `enabled'",
      "ja": "(a) smscriptsourceオブジェクトに含まれるURLは空で、（b）smscriptStorageTypeは「不揮発性」であり、（c）smscriptoperstatusは「有効」です。"
    },
    {
      "indent": 12,
      "text": "Setting this object to `volatile' removes a script from non-volatile storage if the script controlled by this row has been in non-volatile storage before. Attempts to set this object to permanent will always fail with an inconsistentValue error.",
      "ja": "このオブジェクトを「揮発性」に設定すると、この行によって制御されているスクリプトが以前に不揮発性ストレージにある場合、スクリプトを不揮発性ストレージから削除します。このオブジェクトを永久に設定しようとすると、一貫性のない値エラーが常に失敗します。"
    },
    {
      "indent": 12,
      "text": "The value of smScriptStorageType is only meaningful if the value of the corresponding RowStatus object is `active'.",
      "ja": "SMScriptStorageTypeの値は、対応するRowStatusオブジェクトの値が「アクティブ」である場合にのみ意味があります。"
    },
    {
      "indent": 7,
      "text": "     If smScriptStorageType has the value permanent(4), then all\n     objects whose MAX-ACCESS value is read-create must be\n     writable, with the exception of the smScriptStorageType and\n     smScriptRowStatus objects, which shall be read-only.\"\nDEFVAL { volatile }\n::= { smScriptEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"A control that allows entries to be added and removed from this table.",
      "ja": "SMSCRIPTROWSTATUSオブジェクトタイプの構文rowStatus max-access read-createステータス現在の説明 \"エントリをこのテーブルから追加および削除できるコントロール。"
    },
    {
      "indent": 12,
      "text": "Changing the smScriptRowStatus from `active' to `notInService' will remove the associated script from the runtime system.",
      "ja": "smscriptrowStatusを「アクティブ」から「NotinService」に変更すると、ランタイムシステムから関連するスクリプトが削除されます。"
    },
    {
      "indent": 12,
      "text": "Deleting conceptual rows from this table may affect the deletion of other resources associated with this row. For example, a script stored in non-volatile storage may be removed from non-volatile storage.",
      "ja": "このテーブルから概念行を削除すると、この行に関連する他のリソースの削除に影響する場合があります。たとえば、不揮発性ストレージに保存されているスクリプトは、不揮発性ストレージから削除される場合があります。"
    },
    {
      "indent": 12,
      "text": "An entry may not exist in the `active' state unless all required objects in the entry have appropriate values. Rows that are not complete or not in service are not known by the script runtime system.",
      "ja": "エントリ内のすべての必要なオブジェクトに適切な値がない限り、エントリは「アクティブ」な状態に存在しない場合があります。完全でないか、使用中ではない行は、スクリプトランタイムシステムでは知られていません。"
    },
    {
      "indent": 12,
      "text": "Attempts to `destroy' a row or to set a row `notInService' while the smScriptOperStatus is `enabled' will result in an inconsistentValue error.",
      "ja": "smscriptoperstatusが「有効」されている間に行を「破壊」したり、「notinservice」を行けようとする試みは、一貫性のない値エラーになります。"
    },
    {
      "indent": 12,
      "text": "Attempts to `destroy' a row or to set a row `notInService' where the value of the smScriptStorageType object is `permanent' or `readOnly' will result in an inconsistentValue error.",
      "ja": "smscriptStorageTypeオブジェクトの値が「永続的」または「読み取り」である場合、行を「破壊」するか、「notinService」を設定しようとする試みは、一貫性のない値エラーになります。"
    },
    {
      "indent": 7,
      "text": "     The value of this object has no effect on whether other\n     objects in this conceptual row can be modified.\"\n::= { smScriptEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptError OBJECT-TYPE SYNTAX SnmpAdminString MAX-ACCESS read-only STATUS current DESCRIPTION \"This object contains a descriptive error message if the",
      "ja": "smscripterror object-type構文snmpadminstring max-access読み取り専用ステータス現在の説明 \"このオブジェクトには、説明的なエラーメッセージが含まれています。"
    },
    {
      "indent": 7,
      "text": "     transition into the operational status `enabled' failed.\n     Implementations must reset the error message to a\n     zero-length string when a new attempt to change the\n     script status to `enabled' is started.\"\nDEFVAL { ''H }\n::= { smScriptEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptLastChange OBJECT-TYPE SYNTAX DateAndTime MAX-ACCESS read-only STATUS current DESCRIPTION \"The date and time when this script table entry was last modified. The value '0000000000000000'H is returned if the script table entry has not yet been modified.",
      "ja": "smscriptlastchangeオブジェクトタイプ構文データアンドタイムアクセス読み取り専用ステータス現在の説明 \"このスクリプトテーブルエントリが最後に変更された日付と時刻。"
    },
    {
      "indent": 7,
      "text": "     Note that the resetting of smScriptError is not considered\n     a change of the script table entry.\"\nDEFVAL { '0000000000000000'H }\n::= { smScriptEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "--\n-- Access to script code via SNMP\n--\n-- The smCodeTable allows script code to be read and modified\n-- via SNMP.\n--",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smCodeTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmCodeEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table contains the script code for scripts that are\n         written via SNMP write operations.\"\n    ::= { smScriptObjects 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smCodeEntry OBJECT-TYPE\n    SYNTAX      SmCodeEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"An entry describing a particular fragment of a script.\"\n    INDEX { smScriptOwner, smScriptName, smCodeIndex }\n    ::= { smCodeTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "SmCodeEntry ::= SEQUENCE {\n    smCodeIndex         Unsigned32,\n       smCodeText          OCTET STRING,\n    smCodeRowStatus     RowStatus\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smCodeIndex OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The index value identifying this code fragment.\"\n    ::= { smCodeEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smCodeText OBJECT-TYPE\n    SYNTAX      OCTET STRING (SIZE (1..1024))\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The code that makes up a fragment of a script. The format\n         of this code fragment depends on the script language which\n         is identified by the associated smScriptLanguage object.\"\n    ::= { smCodeEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smCodeRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"A control that allows entries to be added and removed from this table.",
      "ja": "smcoderowstatus object-type構文rowstatus max-access read-createステータス現在の説明 \"エントリを追加してこのテーブルから削除できるコントロール。"
    },
    {
      "indent": 7,
      "text": "     The value of this object has no effect on whether other\n     objects in this conceptual row can be modified.\"\n::= { smCodeEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "--\n-- Script execution.\n--\n-- This group defines tables which allow script execution to be\n-- initiated, suspended, resumed, and terminated.  It also provides\n-- a mechanism for keeping a history of recent script executions\n-- and their results.\n--",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunObjects OBJECT IDENTIFIER ::= { smObjects 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmLaunchEntry\n    MAX-ACCESS  not-accessible\n       STATUS      current\n    DESCRIPTION\n        \"This table lists and describes scripts that are ready\n         to be executed together with their parameters.\"\n    ::= { smRunObjects 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchEntry OBJECT-TYPE\n    SYNTAX      SmLaunchEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"An entry describing a particular executable script.\"\n    INDEX { smLaunchOwner, smLaunchName }\n    ::= { smLaunchTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "SmLaunchEntry ::= SEQUENCE {\n    smLaunchOwner               SnmpAdminString,\n    smLaunchName                SnmpAdminString,\n    smLaunchScriptOwner         SnmpAdminString,\n    smLaunchScriptName          SnmpAdminString,\n    smLaunchArgument            OCTET STRING,\n    smLaunchMaxRunning          Unsigned32,\n    smLaunchMaxCompleted        Unsigned32,\n    smLaunchLifeTime            TimeInterval,\n    smLaunchExpireTime          TimeInterval,\n    smLaunchStart               Integer32,\n    smLaunchControl             INTEGER,\n    smLaunchAdminStatus         INTEGER,\n    smLaunchOperStatus          INTEGER,\n    smLaunchRunIndexNext        Integer32,\n    smLaunchStorageType         StorageType,\n    smLaunchRowStatus           RowStatus,\n    smLaunchError               SnmpAdminString,\n    smLaunchLastChange          DateAndTime,\n    smLaunchRowExpireTime       TimeInterval\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchOwner OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The manager who owns this row in the smLaunchTable. Every instance of a running script started from a particular entry in the smLaunchTable (i.e. entries in the smRunTable) will be owned by the same smLaunchOwner used to index the entry in the smLaunchTable. This owner is not necessarily the same as the owner of the script itself (smLaunchScriptOwner).\"",
      "ja": "smlaunchowner object-type sntax snmpadminstring（size（0..32））max-access not-accessable current current current current \"smlaunchtableでこの行を所有するマネージャー。つまり、Smruntableのエントリ）は、SmlaunchTableのエントリのインデックスをインデックスにするために使用される同じSmlaunchownerが所有します。この所有者は、必ずしもスクリプト自体の所有者（SMLAunchScriptOwner）と同じではありません。"
    },
    {
      "indent": 7,
      "text": "::= { smLaunchEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchName OBJECT-TYPE\n    SYNTAX      SnmpAdminString (SIZE (1..32))\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"The locally-unique, administratively assigned name for this\n         launch table entry. This object allows an smLaunchOwner to\n         have multiple entries in the smLaunchTable. The smLaunchName\n         is an arbitrary name that must be different from any other\n         smLaunchTable entries with the same smLaunchOwner but can be\n         the same as other entries in the smLaunchTable with\n         different smLaunchOwner values. Note that the value of\n         smLaunchName is not related in any way to the name of the\n         script being launched.\"\n    ::= { smLaunchEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchScriptOwner OBJECT-TYPE\n    SYNTAX      SnmpAdminString (SIZE (0..32))\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The value of this object in combination with the value of\n         smLaunchScriptName identifies the script that can be\n         launched from this smLaunchTable entry. Attempts to write\n         this object will fail with an inconsistentValue error if\n         the value of smLaunchOperStatus is `enabled'.\"\n    ::= { smLaunchEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchScriptName OBJECT-TYPE SYNTAX SnmpAdminString (SIZE (0..32)) MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object in combination with the value of the smLaunchScriptOwner identifies the script that can be launched from this smLaunchTable entry. The zero-length string may be used to point to a non-existing script.",
      "ja": "smlaunchscriptname object-type構文Snmpadminstring（size（0..32））max-access read-createステータス現在の説明 \"このオブジェクトの値は、smlaunchscriptownerの値と組み合わせて、このsmlaunchtableエントリから起動できるスクリプトを識別します。ゼロ長さの文字列を使用して、存在しないスクリプトを指すことができます。"
    },
    {
      "indent": 7,
      "text": "     Attempts to write this object will fail with an\n     inconsistentValue error if the value of smLaunchOperStatus\n     is `enabled'.\"\nDEFVAL { ''H }\n::= { smLaunchEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchArgument OBJECT-TYPE\n    SYNTAX      OCTET STRING\n       MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The argument supplied to the script. When a script is\n         invoked, the value of this object is used to initialize\n         the smRunArgument object.\"\n    DEFVAL { ''H }\n    ::= { smLaunchEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchMaxRunning OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The maximum number of concurrently running scripts that may\n         be invoked from this entry in the smLaunchTable. Lowering\n         the current value of this object does not affect any scripts\n         that are already executing.\"\n    DEFVAL { 1 }\n    ::= { smLaunchEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchMaxCompleted OBJECT-TYPE\n    SYNTAX      Unsigned32 (1..4294967295)\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The maximum number of finished scripts invoked from this\n         entry in the smLaunchTable allowed to be retained in the\n         smRunTable. Whenever the value of this object is changed\n         and whenever a script terminates, entries in the smRunTable\n         are deleted if necessary until the number of completed\n         scripts is smaller than the value of this object. Scripts\n         whose smRunEndTime value indicates the oldest completion\n         time are deleted first.\"\n    DEFVAL { 1 }\n    ::= { smLaunchEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchLifeTime OBJECT-TYPE\n    SYNTAX      TimeInterval\n    UNITS       \"centi-seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The default maximum amount of time a script launched\n         from this entry may run. The value of this object is used\n         to initialize the smRunLifeTime object when a script is\n         launched. Changing the value of an smLaunchLifeTime\n         instance does not affect scripts previously launched from\n            this entry.\"\n    DEFVAL { 360000 }\n    ::= { smLaunchEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchExpireTime OBJECT-TYPE\n    SYNTAX      TimeInterval\n    UNITS       \"centi-seconds\"\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The default maximum amount of time information about a\n         script launched from this entry is kept in the smRunTable\n         after the script has completed execution.  The value of\n         this object is used to initialize the smRunExpireTime\n         object when a script is launched. Changing the value of an\n         smLaunchExpireTime instance does not affect scripts\n         previously launched from this entry.\"\n    DEFVAL { 360000 }\n    ::= { smLaunchEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchStart OBJECT-TYPE SYNTAX Integer32 (0..2147483647) MAX-ACCESS read-create STATUS current DESCRIPTION \"This object is used to start the execution of scripts. When retrieved, the value will be the value of smRunIndex for the last script that started execution by manipulating this object. The value will be zero if no script started execution yet.",
      "ja": "smlaunchstart object-type syntax integer32（0..2147483647）max-access read-createステータス現在の説明 \"このオブジェクトはスクリプトの実行を開始するために使用されます。このオブジェクトを操作することによる実行。スクリプトがまだ実行されない場合、値はゼロになります。"
    },
    {
      "indent": 12,
      "text": "A script is started by setting this object to an unused smRunIndex value. A new row in the smRunTable will be created which is indexed by the value supplied by the set-request in addition to the value of smLaunchOwner and smLaunchName. An unused value can be obtained by reading the smLaunchRunIndexNext object.",
      "ja": "スクリプトは、このオブジェクトを未使用のsmrunindex値に設定することにより開始されます。SmlaunchownerとSmlaunchNameの値に加えて、Set-Requestによって提供される値によってインデックスが付けられるSmruntableの新しい行が作成されます。未使用の値は、SMLAunchRunIndExNextオブジェクトを読み取ることで取得できます。"
    },
    {
      "indent": 12,
      "text": "Setting this object to the special value 0 will start the script with a self-generated smRunIndex value. The consequence is that the script invoker has no reliable way to determine the smRunIndex value for this script invocation and that the invoker has therefore no way to obtain the results from this script invocation. The special value 0 is however useful for scheduled script invocations.",
      "ja": "このオブジェクトをSpecial値0に設定すると、自己生成されたSMRUNINDEX値でスクリプトが開始されます。その結果、スクリプトの招待者には、このスクリプトの呼び出しのSMRUNINDEX値を決定する信頼できる方法がなく、したがって招待者はこのスクリプトの呼び出しから結果を取得する方法がないことです。ただし、Special値0は、スケジュールされたスクリプトの呼び出しに役立ちます。"
    },
    {
      "indent": 12,
      "text": "If this object is set, the following checks must be performed:",
      "ja": "このオブジェクトが設定されている場合、次のチェックを実行する必要があります。"
    },
    {
      "indent": 12,
      "text": "1) The value of the smLaunchOperStatus object in this entry of the smLaunchTable must be `enabled'. 2) The values of smLaunchScriptOwner and smLaunchScriptName of this row must identify an existing entry in the smScriptTable. 3) The value of smScriptOperStatus of this entry must be `enabled'. 4) The principal performing the set operation must have read access to the script. This must be checked by calling the isAccessAllowed abstract service interface defined in RFC 2271 on the row in the smScriptTable identified by smLaunchScriptOwner and smLaunchScriptName. The isAccessAllowed abstract service interface must be called on all columnar objects in the smScriptTable with a MAX-ACCESS value different than `not-accessible'. The test fails as soon as a call indicates that access is not allowed. 5) If the value provided by the set operation is not 0, a check must be made that the value is currently not in use. Otherwise, if the value provided by the set operation is 0, a suitable unused value must be generated. 6) The number of currently executing scripts invoked from this smLaunchTable entry must be less than smLaunchMaxRunning.",
      "ja": "1) smlaunchTableのこのエントリにおけるsmlaunchoperstatusオブジェクトの値は「有効」でなければなりません。2）この行のsmlaunchScriptOwnerとsmlaunchscriptNameの値は、smscripttableの既存のエントリを識別する必要があります。3）このエントリのsmscriptoperstatusの値は「有効」でなければなりません。4）SET操作を実行する元本は、スクリプトへの読み取りアクセスを持っている必要があります。これは、SMLAunchScriptOwnerおよびsmlaunchScriptNameによって識別されたsmscriptTableの行のRFC 2271で定義されているISACCESSALLOWED ABSTRACT SERVICEインターフェイスを呼び出すことで確認する必要があります。ISACCESSALLOWED ABSTRACT SERVICEインターフェイスは、「アクセス不可」とは異なる最大アクセス値を持つSMScriptTableのすべての柱状オブジェクトで呼び出す必要があります。通話がアクセスが許可されていないことを示すとすぐに、テストは失敗します。5）セット操作によって提供される値が0でない場合、値が現在使用されていないことを確認する必要があります。それ以外の場合、セット操作によって提供される値が0の場合、適切な未使用の値を生成する必要があります。6）このsmlaunchtableエントリから呼び出されている現在実行中のスクリプトの数は、smlaunchmaxrunningよりも少ない必要があります。"
    },
    {
      "indent": 12,
      "text": "Attempts to start a script will fail with an inconsistentValue error if one of the checks described above fails.",
      "ja": "上記のチェックのいずれかが失敗した場合、スクリプトを起動しようとする試みは、一貫性のない値エラーで失敗します。"
    },
    {
      "indent": 12,
      "text": "Otherwise, if all checks have been passed, a new entry in the smRunTable will be created indexed by smLaunchOwner, smLaunchName and the new value for smRunIndex. The value of smLaunchArgument will be copied into smRunArgument, the value of smLaunchLifeTime will be copied to smRunLifeTime, and the value of smLaunchExpireTime will be copied to smRunExpireTime.",
      "ja": "それ以外の場合、すべてのチェックが渡された場合、SMRAunchOwner、SMLAunchName、およびSMRUNINDEXの新しい値によってインデックス作成されたSMRuntableの新しいエントリが作成されます。smlaunchargumentの値はsmrunargumentにコピーされ、smlaunchlifetimeの値はsmrunlifetimeにコピーされ、smlaunchexpiretimeの値はsmrunexpiretimeにコピーされます。"
    },
    {
      "indent": 12,
      "text": "The smRunStartTime will be set to the current time and the smRunState will be set to `initializing' before the script execution is initiated in the appropriate runtime system.",
      "ja": "SMRUNSTARTTIMEは現在の時刻に設定され、SMRUNSTATEは適切なランタイムシステムでスクリプトの実行が開始される前に「初期化」に設定されます。"
    },
    {
      "indent": 7,
      "text": "     Note that the data type and the range of this object must\n     be consistent with the smRunIndex object. Since this\n     object might be written from the scheduling MIB, the\n            data type Integer32 rather than Unsigned32 is used.\"\nDEFVAL { 0 }\n::= { smLaunchEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchControl OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    abort(1),\n                    suspend(2),\n                    resume(3),\n                    nop(4)\n                }\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"This object is used to request a state change for all\n         running scripts in the smRunTable that were started from\n         this row in the smLaunchTable.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Setting this object to abort(1), suspend(2) or resume(3) will set the smRunControl object of all applicable rows in the smRunTable to abort(1), suspend(2) or resume(3) respectively. The phrase `applicable rows' means the set of rows which were created from this entry in the smLaunchTable and whose value of smRunState allows the corresponding state change as described in the definition of the smRunControl object. Setting this object to nop(4) has no effect.",
      "ja": "このオブジェクトを中止（1）、中断（2）、または履歴書（3）に設定すると、smruncontrolオブジェクトは、それぞれ中止（1）、一時停止（2）、または履歴書（3）を中止することができます。「該当する行」というフレーズは、SmlaunchTableのこのエントリから作成された行のセットと、SmrunStateの値により、SmrunControlオブジェクトの定義に記載されているように、対応する状態変化を可能にします。このオブジェクトをNOP（4）に設定しても効果はありません。"
    },
    {
      "indent": 7,
      "text": "     Attempts to set this object lead to an inconsistentValue\n     error only if all implicated sets on all the applicable\n     rows lead to inconsistentValue errors. It is not allowed\n     to return an inconsistentValue error if at least one state\n     change on one of the applicable rows was successful.\"\nDEFVAL { nop }\n::= { smLaunchEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchAdminStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    enabled(1),\n                    disabled(2),\n                    autostart(3)\n                }\n    MAX-ACCESS  read-create\n    STATUS      current\n    DESCRIPTION\n        \"The value of this object indicates the desired status of\n         this launch table entry. The values enabled(1) and\n         autostart(3) both indicate that the launch table entry\n            should transition into the operational enabled(1) state as\n         soon as the associated script table entry is enabled(1).",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "     The value autostart(3) further indicates that the script\n     is started automatically by conceptually writing the\n     value 0 into the associated smLaunchStart object during\n     the transition from the `disabled' into the `enabled'\n     operational state. This is useful for scripts that are\n     to be launched on system start-up.\"\nDEFVAL { disabled }\n::= { smLaunchEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchOperStatus OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    enabled(1),\n                    disabled(2),\n                    expired(3)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The value of this object indicates the actual status of\n         this launch table entry.  The smLaunchOperStatus object\n         may have the following values:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "- `enabled' indicates that the launch table entry is available and can be used to start scripts.",
      "ja": "- 「有効化」は、起動テーブルエントリが利用可能であり、スクリプトを起動するために使用できることを示します。"
    },
    {
      "indent": 12,
      "text": "- `disabled' indicates that the launch table entry can not be used to start scripts.",
      "ja": "- 「無効」は、起動テーブルエントリを使用してスクリプトを開始できないことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `expired' indicates that the launch table entry can not be used to start scripts and will disappear as soon as all smRunTable entries associated with this launch table entry have disappeared.",
      "ja": "- 「期限切れ」は、ローンチテーブルのエントリを使用してスクリプトを起動することができず、この起動テーブルエントリに関連付けられたすべてのスムラント可能なエントリが消えるとすぐに消えることを示しています。"
    },
    {
      "indent": 7,
      "text": "     The value `enabled' requires that the smLaunchRowStatus\n     object is active. The value `disabled' requires that there\n     are no entries in the smRunTable associated with this\n     smLaunchTable entry.\"\nDEFVAL { disabled }\n::= { smLaunchEntry 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchRunIndexNext OBJECT-TYPE SYNTAX Integer32 (1..2147483647) MAX-ACCESS read-only STATUS current DESCRIPTION",
      "ja": "smlaunchrunindexnext object-type syntax integer32（1..2147483647）max-access読み取り専用ステータス現在の説明"
    },
    {
      "indent": 11,
      "text": "\"This variable is used for creating rows in the smRunTable. The value of this variable is a currently unused value for smRunIndex, which can be written into the smLaunchStart object associated with this row to launch a script.",
      "ja": "「この変数は、SMRUNTABLEで行を作成するために使用されます。この変数の値は、SMRUNINDEXの現在使用されていない値であり、この行に関連付けられたSMLAUNCHSTARTオブジェクトに書き込まれてスクリプトを起動できます。"
    },
    {
      "indent": 12,
      "text": "The value returned when reading this variable must be unique for the smLaunchOwner and smLaunchName associated with this row. Subsequent attempts to read this variable must return different values.",
      "ja": "この変数を読み取るときに返される値は、この行に関連付けられたSMLAunchOwnerとSMLAunchNameにとって一意でなければなりません。この変数を読み取ろうとするその後の試みは、異なる値を返す必要があります。"
    },
    {
      "indent": 12,
      "text": "This variable will return the special value 0 if no new rows can be created.",
      "ja": "この変数は、新しい行を作成できない場合、特別な値0を返します。"
    },
    {
      "indent": 7,
      "text": "     Note that the data type and the range of this object must be\n     consistent with the definition of smRunIndex.\"\n::= { smLaunchEntry 14 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchStorageType OBJECT-TYPE SYNTAX StorageType MAX-ACCESS read-create STATUS current DESCRIPTION \"This object defines if this row is kept in volatile storage and lost upon reboot or if this row is backed up by stable storage.",
      "ja": "smlaunchStorageTypeオブジェクトタイプの構文StorageType Max-Access Read-Createステータス現在の説明 \"このオブジェクトは、この行が揮発性ストレージに保持され、再起動時に失われたかどうかを定義します。"
    },
    {
      "indent": 12,
      "text": "The value of smLaunchStorageType is only meaningful if the value of the corresponding RowStatus object is active.",
      "ja": "SmlaunchStorageTypeの値は、対応するRowStatusオブジェクトの値がアクティブである場合にのみ意味があります。"
    },
    {
      "indent": 7,
      "text": "     If smLaunchStorageType has the value permanent(4), then all\n     objects whose MAX-ACCESS value is read-create must be\n     writable, with the exception of the smLaunchStorageType and\n     smLaunchRowStatus objects, which shall be read-only.\"\nDEFVAL { volatile }\n::= { smLaunchEntry 15 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"A control that allows entries to be added and removed from this table.",
      "ja": "smlaunchrowstatus object-type syntax rowstatus max-access read-createステータス現在の説明 \"エントリをこのテーブルから追加および削除できるコントロール。"
    },
    {
      "indent": 12,
      "text": "Attempts to `destroy' a row or to set a row `notInService' while the smLaunchOperStatus is `enabled' will result in an inconsistentValue error.",
      "ja": "smlaunchoperstatusが「有効」されている間に行を「破壊」したり、「notinservice」を行けようとする試みは、一貫性のない値エラーになります。"
    },
    {
      "indent": 12,
      "text": "Attempts to `destroy' a row or to set a row `notInService' where the value of the smLaunchStorageType object is `permanent' or `readOnly' will result in an inconsistentValue error.",
      "ja": "smlaunchStorageTypeオブジェクトの値が「永続的」または「読み取り」である場合、行を「破壊」するか、「notinService」を設定しようとする試みは、一貫性のない値エラーになります。"
    },
    {
      "indent": 7,
      "text": "     The value of this object has no effect on whether other\n     objects in this conceptual row can be modified.\"\n::= { smLaunchEntry 16 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchError OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"This object contains a descriptive error message if an\n         attempt to launch a script fails. Implementations must reset\n         the error message to a zero-length string when a new attempt\n         to launch a script is started.\"\n    DEFVAL { ''H }\n    ::= { smLaunchEntry 17 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchLastChange OBJECT-TYPE SYNTAX DateAndTime MAX-ACCESS read-only STATUS current DESCRIPTION \"The date and time when this launch table entry was last modified. The value '0000000000000000'H is returned if the launch table entry has not yet been modified.",
      "ja": "smlaunchlastchangeオブジェクトタイプの構文データアンドタイムアクセス読み取り専用ステータス現在の説明 \"この起動テーブルエントリが最後に変更された日付と時刻。"
    },
    {
      "indent": 7,
      "text": "     Note that a change of smLaunchStart, smLaunchControl,\n     smLaunchRunIndexNext, smLaunchRowExpireTime, or the\n     resetting of smLaunchError is not considered a change\n     of this launch table entry.\"\nDEFVAL { '0000000000000000'H }\n::= { smLaunchEntry 18 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchRowExpireTime OBJECT-TYPE SYNTAX TimeInterval UNITS \"centi-seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The value of this object specifies how long this row remains in the `enabled' or `disabled' operational state. The value reported by this object ticks backwards. When the value reaches 0, it stops ticking backward and the row is deleted if there are no smRunTable entries associated with this smLaunchTable entry. Otherwise, the smLaunchOperStatus changes to `expired' and the row deletion is deferred until there are no smRunTable entries associated with this smLaunchTable entry.",
      "ja": "smlaunchRowExpireTimeオブジェクトタイプ構文タイムインターバルユニット「センチ秒」「マックスアクセス読み取りステータス現在の説明」このオブジェクトの値は、この行の値を指定します。オブジェクトは後方にチェックを付けます。値が0に達すると、このsmlaunchtableエントリに関連するsmruntableエントリがない場合、値が後方に刻まれ、行が削除されます。それ以外このsmlaunchtableエントリに関連付けられたsmruntableエントリ。"
    },
    {
      "indent": 12,
      "text": "The smLaunchRowExpireTime will not tick backwards if it is set to its maximum value (2147483647). In other words, setting this object to its maximum value turns the timer off.",
      "ja": "SmlaunchRowExpireTimeは、最大値（2147483647）に設定されていても後方にチェックマークを付けません。言い換えれば、このオブジェクトを最大値に設定すると、タイマーがオフになります。"
    },
    {
      "indent": 12,
      "text": "The value of this object may be set in order to increase or reduce the remaining time that the launch table entry may be used. Setting the value to 0 will cause an immediate row deletion or transition into the `expired' operational state.",
      "ja": "このオブジェクトの値は、起動テーブルエントリを使用できる残りの時間を増加または短縮するために設定できます。値を0に設定すると、即時行の削除または「有効期限が切れた」動作状態に移行します。"
    },
    {
      "indent": 12,
      "text": "It is not possible to set this object while the operational status is `expired'. Attempts to modify this object while the operational status is `expired' leads to an inconsistentValue error.",
      "ja": "運用ステータスが「期限切れ」である間、このオブジェクトを設定することはできません。このオブジェクトを変更しようとすると、運用ステータスが「期限切れ」である間に、一貫性のない値エラーが発生します。"
    },
    {
      "indent": 7,
      "text": "     Note that the timer ticks backwards independent of the\n     operational state of the launch table entry.\"\nDEFVAL { 2147483647 }\n::= { smLaunchEntry 19 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF SmRunEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"This table lists and describes scripts that are currently\n         running or have been running in the past.\"\n    ::= { smRunObjects 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunEntry OBJECT-TYPE\n    SYNTAX      SmRunEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n        \"An entry describing a particular running or finished\n         script.\"\n    INDEX { smLaunchOwner, smLaunchName, smRunIndex }\n    ::= { smRunTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "SmRunEntry ::= SEQUENCE {\n    smRunIndex          Integer32,\n       smRunArgument       OCTET STRING,\n    smRunStartTime      DateAndTime,\n    smRunEndTime        DateAndTime,\n    smRunLifeTime       TimeInterval,\n    smRunExpireTime     TimeInterval,\n    smRunExitCode       INTEGER,\n    smRunResult         OCTET STRING,\n    smRunControl        INTEGER,\n    smRunState          INTEGER,\n    smRunError          SnmpAdminString,\n    smRunResultTime     DateAndTime,\n    smRunErrorTime      DateAndTime\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunIndex OBJECT-TYPE SYNTAX Integer32 (1..2147483647) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The locally arbitrary, but unique identifier associated with this running or finished script. This value must be unique for all rows in the smRunTable with the same smLaunchOwner and smLaunchName.",
      "ja": "SMRUNINDEXオブジェクトタイプ構文integer32（1..2147483647）最大アクセスはアクセス不可能なステータス現在の説明 \"この実行または完成したスクリプトに関連する局所任意の、しかし一意の識別子。同じsmlaunchownerとsmlaunchname。"
    },
    {
      "indent": 7,
      "text": "     Note that the data type and the range of this object must\n     be consistent with the definition of smLaunchRunIndexNext\n     and smLaunchStart.\"\n::= { smRunEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunArgument OBJECT-TYPE\n    SYNTAX      OCTET STRING\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The argument supplied to the script when it started.\"\n    DEFVAL { ''H }\n    ::= { smRunEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunStartTime OBJECT-TYPE\n    SYNTAX      DateAndTime\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The date and time when the execution started. The value\n         '0000000000000000'H is returned if the script has not\n         started yet.\"\n    DEFVAL { '0000000000000000'H }\n    ::= { smRunEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunEndTime OBJECT-TYPE\n    SYNTAX      DateAndTime\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The date and time when the execution terminated. The value\n         '0000000000000000'H is returned if the script has not\n         terminated yet.\"\n    DEFVAL { '0000000000000000'H }\n    ::= { smRunEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunLifeTime OBJECT-TYPE SYNTAX TimeInterval UNITS \"centi-seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"This object specifies how long the script can execute. This object returns the remaining time that the script may run. The object is initialized with the value of the associated smLaunchLifeTime object and ticks backwards. The script is aborted immediately when the value reaches 0.",
      "ja": "smrunlifetimeオブジェクトタイプの構文タイムインターバルユニット「セント秒」最大アクセス読み取りワイトステータス現在の説明 \"このオブジェクトは、スクリプトが実行できる時間を指定します。このオブジェクトは、スクリプトが実行できる残りの時間を返します。オブジェクトは、オブジェクトが初期化されます。関連するsmlaunchlifetimeオブジェクトの値と後方にチェックが付いています。値が0に達するとすぐにスクリプトが中止されます。"
    },
    {
      "indent": 12,
      "text": "The value of this object may be set in order to increase or reduce the remaining time that the script may run. Setting this value to 0 will abort script execution immediately, and, if the value of smRunExpireTime is also 0, will remove this entry from the smRunTable once it has terminated.",
      "ja": "このオブジェクトの値は、スクリプトが実行される残りの時間を増加または削減するために設定できます。この値を0に設定すると、スクリプトの実行がすぐに中止され、SMRUNEXPIRETIMEの値も0の場合、終了するとSMRuntableからこのエントリを削除します。"
    },
    {
      "indent": 12,
      "text": "If smRunLifeTime is set to its maximum value (2147483647), either by a set operation or by its initialization from the smLaunchLifeTime object, then it will not tick backwards. A running script with a maximum smRunLifeTime value will thus never be terminated with a `lifeTimeExceeded' exit code.",
      "ja": "SMRUNLIFETIMEが最大値（2147483647）に設定されている場合、設定された操作またはSMLAunchLifetimeオブジェクトからの初期化により、後方に戻りません。したがって、最大SMRUNLIFETIME値を持つ実行中のスクリプトは、「LifetimeExexed」出口コードで終了することはありません。"
    },
    {
      "indent": 12,
      "text": "The value of smRunLifeTime reflects the real-time execution time as seen by the outside world. The value of this object will always be 0 for a script that finished execution, that is smRunState has the value `terminated'.",
      "ja": "Smrunlifetimeの価値は、外の世界で見られるリアルタイムの実行時間を反映しています。このオブジェクトの値は、実行が完了したスクリプトの場合、常に0になります。つまり、SmrunStateには値「終了」があります。"
    },
    {
      "indent": 7,
      "text": "     The value of smRunLifeTime does not change while a script\n     is suspended, that is smRunState has the value `suspended'.\n     Note that this does not affect set operations. It is legal\n     to modify smRunLifeTime via set operations while a script\n     is suspended.\"\n::= { smRunEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunExpireTime OBJECT-TYPE SYNTAX TimeInterval UNITS \"centi-seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The value of this object specifies how long this row can exist in the smRunTable after the script has terminated. This object returns the remaining time that the row may exist before it is aged out. The object is initialized with the value of the associated smLaunchExpireTime object and ticks backwards. The entry in the smRunTable is destroyed when the value reaches 0 and the smRunState has the value `terminated'.",
      "ja": "smrunexpiretimeオブジェクトタイプの構文タイムインターバルユニット「セント秒」最大アクセス読み取りワイトステータス現在の説明 \"このオブジェクトの値は、スクリプトが終了した後にこの行にこの行が存在する期間を指定します。このオブジェクトは残りの時間を返します。行が老化する前に行が存在する場合があります。オブジェクトは、関連するSMLAunchExpireTimeオブジェクトの値で初期化され、後方にチェックが付いています。Smruntableのエントリは、値が0に達し、SmrunStateに値「終了」があると破壊されます。"
    },
    {
      "indent": 7,
      "text": "     The value of this object may be set in order to increase or\n     reduce the remaining time that the row may exist.  Setting\n     the value to 0 will destroy this entry as soon as the\n     smRunState has the value `terminated'.\"\n::= { smRunEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunExitCode OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    noError(1),\n                    halted(2),\n                    lifeTimeExceeded(3),\n                    noResourcesLeft(4),\n                    languageError(5),\n                    runtimeError(6),\n                    invalidArgument(7),\n                    securityViolation(8),\n                    genericError(9)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The value of this object indicates the reason why a\n         script finished execution. The smRunExitCode code may have\n         one of the following values:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "- `noError', which indicates that the script completed successfully without errors;",
      "ja": "- 「noerror」は、スクリプトがエラーなしで正常に完了したことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `halted', which indicates that the script was halted by a request from an authorized manager;",
      "ja": "- 「停止」。これは、承認されたマネージャーからのリクエストによってスクリプトが停止されたことを示す。"
    },
    {
      "indent": 12,
      "text": "- `lifeTimeExceeded', which indicates that the script exited because a time limit was exceeded;",
      "ja": "- 「lifetimeexeded」。これは、時間制限が超えたためにスクリプトが終了したことを示す。"
    },
    {
      "indent": 12,
      "text": "- `noResourcesLeft', which indicates that the script exited because it ran out of resources (e.g. memory);",
      "ja": "- 「noresourcesleft」。これは、スクリプトがリソース（メモリなど）を使い果たしたために終了したことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `languageError', which indicates that the script exited because of a language error (e.g. a syntax error in an interpreted language);",
      "ja": "- 「LanguageError」。これは、言語エラーのためにスクリプトが終了したことを示す（たとえば、解釈された言語の構文エラー）。"
    },
    {
      "indent": 12,
      "text": "- `runtimeError', which indicates that the script exited due to a runtime error (e.g. a division by zero);",
      "ja": "- 「RuntimeError」は、ランタイムエラー（ゼロによる分割など）のためにスクリプトが終了したことを示します。"
    },
    {
      "indent": 12,
      "text": "- `invalidArgument', which indicates that the script could not be run because of invalid script arguments;",
      "ja": "- 「Invalidargument」は、スクリプトの引数が無効であるためにスクリプトを実行できなかったことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `securityViolation', which indicates that the script exited due to a security violation;",
      "ja": "- 「SecurityViolation」は、セキュリティ違反のためにスクリプトが終了したことを示しています。"
    },
    {
      "indent": 12,
      "text": "- `genericError', which indicates that the script exited for an unspecified reason.",
      "ja": "- 「genericerror」は、スクリプトが不特定の理由で終了したことを示しています。"
    },
    {
      "indent": 7,
      "text": "     If the script has not yet begun running, or is currently\n     running, the value will be `noError'.\"\nDEFVAL { noError }\n::= { smRunEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunResult OBJECT-TYPE\n    SYNTAX      OCTET STRING\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The result value produced by the running script. Note that\n         the result may change while the script is executing.\"\n    DEFVAL { ''H }\n    ::= { smRunEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunControl OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    abort(1),\n                    suspend(2),\n                    resume(3),\n                    nop(4)\n                }\n    MAX-ACCESS  read-write\n    STATUS      current\n    DESCRIPTION\n        \"The value of this object indicates the desired status of the\n         script execution defined by this row.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Setting this object to `abort' will abort execution if the value of smRunState is `initializing', `executing', `suspending', `suspended' or `resuming'. Setting this object to `abort' when the value of smRunState is `aborting' or `terminated', or if the implementation can determine that the attempt to abort the execution would fail, will result in an inconsistentValue error.",
      "ja": "このオブジェクトを「中止」に設定すると、smrunstateの値が「初期化」、「実行」、「一時停止」、「一時停止」、または「再開」がある場合、実行は実行されます。SmrunStateの値が「中止」または「終了」している場合、または実装が実行を中止しようとする試みが失敗すると判断できる場合、このオブジェクトを「中止」に設定すると、一貫性のない値エラーが発生します。"
    },
    {
      "indent": 12,
      "text": "Setting this object to `suspend' will suspend execution if the value of smRunState is `executing'. Setting this object to `suspend' will cause an inconsistentValue error if the value of smRunState is not `executing' or if the implementation can determine that the attempt to suspend the execution would fail.",
      "ja": "SmrunStateの値が「実行」している場合、このオブジェクトを「一時停止」に設定すると、実行が停止されます。このオブジェクトを「一時停止」に設定すると、SmrunStateの値が「実行」していない場合、または実装が実行を一時停止しようとする試みが失敗すると判断できる場合、一貫性のない値エラーが発生します。"
    },
    {
      "indent": 12,
      "text": "Setting this object to `resume' will resume execution if the value of smRunState is `suspending' or `suspended'. Setting this object to `resume' will cause an inconsistentValue error if the value of smRunState is not `suspended' or if the implementation can determine that the attempt to resume the execution would fail.",
      "ja": "SmrunStateの値が「一時停止」または「中断」されている場合、このオブジェクトを「履歴書」に設定すると、実行を再開します。このオブジェクトを「Resume」に設定すると、SmrunStateの値が「一時停止」されていない場合、または実装が実行を再開しようとする試みが失敗すると判断できる場合、一貫性のない値エラーが発生します。"
    },
    {
      "indent": 7,
      "text": "     Setting this object to nop(4) has no effect.\"\nDEFVAL { nop }\n::= { smRunEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunState OBJECT-TYPE\n    SYNTAX      INTEGER {\n                    initializing(1),\n                    executing(2),\n                    suspending(3),\n                    suspended(4),\n                    resuming(5),\n                    aborting(6),\n                    terminated(7)\n                }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The value of this object indicates the script's execution\n         state. If the script has been invoked but has not yet\n         begun execution, the value will be `initializing'. If the\n         script is running, the value will be `executing'.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "A running script which received a request to suspend execution first transitions into a temporary `suspending' state. The temporary `suspending' state changes to `suspended' when the script has actually been suspended. The temporary `suspending' state changes back to `executing' if the attempt to suspend the running script fails.",
      "ja": "実行を一時停止するリクエストを受信した実行中のスクリプトは、最初に一時的な「一時停止」状態に移行します。一時的な「一時停止」状態は、スクリプトが実際に停止されたときに「中断」に変更されます。一時的な「一時停止」状態は、実行中のスクリプトを一時停止しようとする場合、「実行」に変化します。"
    },
    {
      "indent": 12,
      "text": "A suspended script which received a request to resume execution first transitions into a temporary `resuming' state. The temporary `resuming' state changes to `running' when the script has actually been resumed. The temporary `resuming' state changes back to `suspended' if the attempt to resume the suspended script fails.",
      "ja": "実行を再開するリクエストを受け取った停止されたスクリプトは、最初の「再開」状態に最初の移行を移行します。スクリプトが実際に再開されたときの「実行」に一時的な「再開」状態の変更。一時的な「再開」状態は、中断されたスクリプトを再開しようとすると、「中断」に戻ります。"
    },
    {
      "indent": 12,
      "text": "A script which received a request to abort execution but which is still running first transitions into a temporary `aborting' state.",
      "ja": "実行を中止するリクエストを受け取ったが、まだ最初の遷移を実行しているスクリプトは、一時的な「中止」状態に移行しています。"
    },
    {
      "indent": 7,
      "text": "     A script which has finished its execution is `terminated'.\"\n::= { smRunEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunError OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"This object contains a descriptive error message if the\n         script startup or execution raised an abnormal condition.\n         An implementation must store a descriptive error message\n         in this object if the script exits with the smRunExitCode\n         `genericError'.\"\n    DEFVAL { ''H }\n    ::= { smRunEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunResultTime OBJECT-TYPE\n    SYNTAX      DateAndTime\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The date and time when the smRunResult was last updated.\n         The value '0000000000000000'H is returned if smRunResult\n         has not yet been updated after the creation of this\n         smRunTable entry.\"\n    DEFVAL { '0000000000000000'H }\n    ::= { smRunEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunErrorTime OBJECT-TYPE\n    SYNTAX      DateAndTime\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n        \"The date and time when the smRunError was last updated.\n         The value '0000000000000000'H is returned if smRunError\n            has not yet been updated after the creation of this\n         smRunTable entry.\"\n    DEFVAL { '0000000000000000'H }\n    ::= { smRunEntry 13 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "--\n-- Notifications. The definition of smTraps makes notification\n-- registrations reversible (see STD 58, RFC 2578).\n--",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smTraps OBJECT IDENTIFIER ::= { smNotifications 0 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptAbort NOTIFICATION-TYPE\n    OBJECTS     { smRunExitCode, smRunEndTime, smRunError }\n    STATUS      current\n    DESCRIPTION\n        \"This notification is generated whenever a running script\n         terminates with an smRunExitCode unequal to `noError'.\"\n    ::= { smTraps 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptResult NOTIFICATION-TYPE OBJECTS { smRunResult } STATUS current DESCRIPTION \"This notification can be used by scripts to notify other management applications about results produced by the script.",
      "ja": "smscriptresult notification-type objects {smrunResult}ステータス現在の説明 \"この通知は、スクリプトでスクリプトによって作成された結果について他の管理アプリケーションに通知するために使用できます。"
    },
    {
      "indent": 7,
      "text": "     This notification is not automatically generated by the\n     Script MIB implementation. It is the responsibility of\n     the executing script to emit this notification where it\n     is appropriate to do so.\"\n::= { smTraps 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptException NOTIFICATION-TYPE OBJECTS { smRunError } STATUS current DESCRIPTION \"This notification can be used by scripts to notify other management applications about script errors.",
      "ja": "smscriptexception notification-type objects {smrunerror}ステータス現在の説明 \"この通知は、スクリプトがスクリプトエラーに関する他の管理アプリケーションに通知するために使用できます。"
    },
    {
      "indent": 7,
      "text": "     This notification is not automatically generated by the\n     Script MIB implementation. It is the responsibility of\n     the executing script or the runtime system to emit this\n     notification where it is appropriate to do so.\"\n::= { smTraps 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-- conformance information\n   smCompliances OBJECT IDENTIFIER ::= { smConformance 1 }\nsmGroups      OBJECT IDENTIFIER ::= { smConformance 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "-- compliance statements",
      "ja": " - コンプライアンスステートメント"
    },
    {
      "indent": 3,
      "text": "smCompliance2 MODULE-COMPLIANCE\n    STATUS      current\n    DESCRIPTION\n        \"The compliance statement for SNMP entities which implement\n         the Script MIB.\"\n    MODULE      -- this module\n    MANDATORY-GROUPS {\n            smLanguageGroup, smScriptGroup2, smLaunchGroup2,\n            smRunGroup2, smNotificationsGroup2\n    }\n    GROUP   smCodeGroup\n    DESCRIPTION\n        \"The smCodeGroup is mandatory only for those implementations\n         that support the downloading of scripts via SNMP.\"\n    OBJECT  smScriptSource\n    MIN-ACCESS  read-only\n    DESCRIPTION\n        \"The smScriptSource object is read-only for implementations\n         that are not able to download script code from a URL.\"\n    OBJECT smCodeText\n    DESCRIPTION\n        \"A compliant implementation need only support write access to\n         the smCodeText object only during row creation.\"\n    OBJECT smLaunchArgument\n    DESCRIPTION\n        \"A compliant implementation has to support a minimum size\n         for smLaunchArgument of 255 octets.\"\n    OBJECT smRunArgument\n    DESCRIPTION\n        \"A compliant implementation has to support a minimum size\n         for smRunArgument of 255 octets.\"\n    OBJECT smRunResult\n    DESCRIPTION\n        \"A compliant implementation has to support a minimum size\n         for smRunResult of 255 octets.\"\n    OBJECT smRunState\n    DESCRIPTION\n        \"A compliant implementation does not have to support script\n         suspension and the smRunState `suspended'. Such an\n         implementation will change into the `suspending' state\n         when the smRunControl is set to `suspend' and remain in this\n         state until smRunControl is set to `resume' or the script\n         terminates.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "::= { smCompliances 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLanguageGroup OBJECT-GROUP\n    OBJECTS {\n        smLangLanguage, smLangVersion,\n        smLangVendor, smLangRevision,\n        smLangDescr, smExtsnExtension,\n        smExtsnVersion, smExtsnVendor,\n        smExtsnRevision, smExtsnDescr\n    }\n    STATUS      current\n    DESCRIPTION\n        \"A collection of objects providing information about the\n         capabilities of the scripting engine.\"\n    ::= { smGroups 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptGroup2 OBJECT-GROUP\n    OBJECTS {\n        smScriptDescr, smScriptLanguage,\n        smScriptSource, smScriptAdminStatus,\n        smScriptOperStatus, smScriptStorageType,\n        smScriptRowStatus, smScriptError,\n        smScriptLastChange\n    }\n    STATUS      current\n    DESCRIPTION\n        \"A collection of objects providing information about\n         installed scripts.\"\n    ::= { smGroups 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smCodeGroup OBJECT-GROUP\n    OBJECTS {\n        smCodeText, smCodeRowStatus\n    }\n    STATUS      current\n    DESCRIPTION\n        \"A collection of objects used to download or modify scripts\n         by using SNMP set requests.\"\n    ::= { smGroups 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchGroup2 OBJECT-GROUP\n    OBJECTS {\n        smLaunchScriptOwner, smLaunchScriptName,\n        smLaunchArgument, smLaunchMaxRunning,\n        smLaunchMaxCompleted, smLaunchLifeTime,\n        smLaunchExpireTime, smLaunchStart,\n        smLaunchControl, smLaunchAdminStatus,\n        smLaunchOperStatus, smLaunchRunIndexNext,\n           smLaunchStorageType, smLaunchRowStatus,\n        smLaunchError, smLaunchLastChange,\n        smLaunchRowExpireTime\n    }\n    STATUS      current\n    DESCRIPTION\n        \"A collection of objects providing information about scripts\n         that can be launched.\"\n    ::= { smGroups 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunGroup2 OBJECT-GROUP\n    OBJECTS {\n        smRunArgument, smRunStartTime,\n        smRunEndTime, smRunLifeTime,\n        smRunExpireTime, smRunExitCode,\n        smRunResult, smRunState,\n        smRunControl, smRunError,\n        smRunResultTime, smRunErrorTime\n    }\n    STATUS      current\n    DESCRIPTION\n        \"A collection of objects providing information about running\n         scripts.\"\n    ::= { smGroups 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smNotificationsGroup2 NOTIFICATION-GROUP\n    NOTIFICATIONS {\n        smScriptAbort,\n        smScriptResult,\n        smScriptException\n    }\n    STATUS      current\n    DESCRIPTION\n        \"The notifications emitted by the Script MIB.\"\n    ::= { smGroups 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "--\n-- Deprecated compliance and conformance group definitions\n-- from RFC 2592.\n--",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smCompliance MODULE-COMPLIANCE STATUS deprecated DESCRIPTION \"The compliance statement for SNMP entities which implement the Script MIB.\" MODULE -- this module MANDATORY-GROUPS {",
      "ja": "SMCompliance Module Compliance Status Deprecated説明「スクリプトMIBを実装するSNMPエンティティのコンプライアンスステートメント。」モジュール - このモジュールの必須グループ{"
    },
    {
      "indent": 7,
      "text": "        smLanguageGroup, smScriptGroup, smLaunchGroup, smRunGroup\n}\nGROUP   smCodeGroup\nDESCRIPTION\n    \"The smCodeGroup is mandatory only for those implementations\n     that support the downloading of scripts via SNMP.\"\nOBJECT  smScriptSource\nMIN-ACCESS  read-only\nDESCRIPTION\n    \"The smScriptSource object is read-only for implementations\n     that are not able to download script code from a URL.\"\nOBJECT smCodeText\nDESCRIPTION\n    \"A compliant implementation need only support write access\n     to the smCodeText object during row creation.\"\nOBJECT smLaunchArgument\nDESCRIPTION\n    \"A compliant implementation has to support a minimum size\n     for smLaunchArgument of 255 octets.\"\nOBJECT smRunArgument\nDESCRIPTION\n    \"A compliant implementation has to support a minimum size\n     for smRunArgument of 255 octets.\"\nOBJECT smRunResult\nDESCRIPTION\n    \"A compliant implementation has to support a minimum size\n     for smRunResult of 255 octets.\"\nOBJECT smRunState\nDESCRIPTION\n    \"A compliant implementation does not have to support script\n     suspension and the smRunState `suspended'. Such an\n     implementation will change into the `suspending' state\n     when the smRunControl is set to `suspend' and remain in this\n     state until smRunControl is set to `resume' or the script\n     terminates.\"\n::= { smCompliances 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smScriptGroup OBJECT-GROUP\n    OBJECTS {\n        smScriptDescr, smScriptLanguage,\n        smScriptSource, smScriptAdminStatus,\n        smScriptOperStatus, smScriptStorageType,\n        smScriptRowStatus\n    }\n    STATUS      deprecated\n    DESCRIPTION\n        \"A collection of objects providing information about\n         installed scripts.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "::= { smGroups 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smLaunchGroup OBJECT-GROUP\n    OBJECTS {\n        smLaunchScriptOwner, smLaunchScriptName,\n        smLaunchArgument, smLaunchMaxRunning,\n        smLaunchMaxCompleted, smLaunchLifeTime,\n        smLaunchExpireTime, smLaunchStart,\n        smLaunchControl, smLaunchAdminStatus,\n        smLaunchOperStatus, smLaunchRunIndexNext,\n        smLaunchStorageType, smLaunchRowStatus\n    }\n    STATUS      deprecated\n    DESCRIPTION\n        \"A collection of objects providing information about scripts\n         that can be launched.\"\n    ::= { smGroups 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smRunGroup OBJECT-GROUP\n    OBJECTS {\n        smRunArgument, smRunStartTime,\n        smRunEndTime, smRunLifeTime,\n        smRunExpireTime, smRunExitCode,\n        smRunResult, smRunState,\n        smRunControl, smRunError\n    }\n    STATUS      deprecated\n    DESCRIPTION\n        \"A collection of objects providing information about running\n         scripts.\"\n    ::= { smGroups 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "smNotificationsGroup NOTIFICATION-GROUP\n    NOTIFICATIONS {\n        smScriptAbort,\n        smScriptResult\n    }\n    STATUS      deprecated\n    DESCRIPTION\n        \"The notifications emitted by the Script MIB.\"\n    ::= { smGroups 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "7. Usage Examples",
      "section_title": true,
      "ja": "7. 使用例"
    },
    {
      "indent": 3,
      "text": "This section presents some examples that explain how a manager can use the Script MIB defined in this memo. The purpose of these examples is to explain the steps that are normally used to delegate management scripts.",
      "ja": "このセクションでは、マネージャーがこのメモで定義されているスクリプトMIBを使用する方法を説明するいくつかの例を示します。これらの例の目的は、管理スクリプトを委任するために通常使用される手順を説明することです。"
    },
    {
      "indent": 0,
      "text": "7.1. Pushing a Script via SNMP",
      "section_title": true,
      "ja": "7.1. SNMPを介してスクリプトをプッシュします"
    },
    {
      "indent": 3,
      "text": "This example explains the steps performed by a manager to push a script into a distributed manager.",
      "ja": "この例では、マネージャーが実行した手順を説明し、スクリプトを分散マネージャーに押し込んでいます。"
    },
    {
      "indent": 3,
      "text": "1. The manager first checks the smLangTable and the smExtsnTable in order to select the appropriate script or language.",
      "ja": "1. マネージャーは、適切なスクリプトまたは言語を選択するために、最初にsmlangtableとsmextSntableをチェックします。"
    },
    {
      "indent": 3,
      "text": "2. The manager creates a row in the smScriptTable by issuing an SNMP set-request. The smScriptRowStatus object is set to `createAndWait' and the smScriptSource object is set to an empty string. The smScriptLanguage object is set to the language in which the script was written. The smScriptStorageType object is set to `volatile' to indicate that the script will be loaded via the smCodeTable. The smScriptOwner is set to a string which identifies the principal who owns the new row. The smScriptName defines the administratively assigned unique name for the script.",
      "ja": "2. マネージャーは、SNMPセットレクエストを発行することにより、smscripttableに行を作成します。smscriptrowstatusオブジェクトは「createandwait」に設定されており、smscriptsourceオブジェクトは空の文字列に設定されています。smscriptlanguageオブジェクトは、スクリプトが書かれた言語に設定されています。SMScriptStorageTypeオブジェクトは、「揮発性」に設定されており、スクリプトがSMCodeTableを介してロードされることを示します。smscriptownerは、新しい行を所有する校長を識別する文字列に設定されます。SMScriptNameは、スクリプトの管理上割り当てられた一意の名前を定義します。"
    },
    {
      "indent": 3,
      "text": "3. The manager sets the smScriptRowStatus object to `active' and the smScriptAdminStatus object to `editing'.",
      "ja": "3. マネージャーは、smscriptrowstatusオブジェクトを「アクティブ」に設定し、smscriptadmintatusオブジェクトは「編集」にオブジェクトを設定します。"
    },
    {
      "indent": 3,
      "text": "4. The manager pushes the script to the distributed manager by issuing a couple of SNMP set-requests to fill the smCodeTable.",
      "ja": "4. マネージャーは、SMCodetableを埋めるためにいくつかのSNMPセットレクエストを発行することにより、スクリプトを分散マネージャーにプッシュします。"
    },
    {
      "indent": 3,
      "text": "5. Once the whole script has been transferred, the manager sends a set-request to set the smScriptAdminStatus object to `enabled'. The Script MIB implementation now makes the script accessible to the runtime system. This might include the compilation of the script if the language requires a compilation step.",
      "ja": "5. スクリプト全体が転送されると、マネージャーはSET-REQUESTを送信して、SMScriptAdMinTatusオブジェクトを「有効」に設定します。スクリプトMIB実装により、スクリプトにランタイムシステムがアクセスできるようになりました。これには、言語にコンパイルステップが必要な場合、スクリプトのコンパイルが含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "6. The manager polls the smScriptOperStatus object until the value is either `enabled' or one of the error status codes. The script can only be used if the value of smScriptOperStatus is `enabled'.",
      "ja": "6. マネージャーは、値が「有効」またはエラーステータスコードのいずれかになるまで、SMScriptOperStatusオブジェクトにポーリングします。スクリプトは、smscriptoperstatusの値が「有効」である場合にのみ使用できます。"
    },
    {
      "indent": 3,
      "text": "7. If the manager wants to store the script in local non-volatile storage, it should send a set-request which changes the smScriptStorageType object to `nonVolatile'.",
      "ja": "7. マネージャーがスクリプトをローカルの不揮発性ストレージに保存したい場合、SMScriptStorageTypeオブジェクトを「非揮発性」に変更するセットレクストを送信する必要があります。"
    },
    {
      "indent": 0,
      "text": "7.2. Pulling a Script from a URL",
      "section_title": true,
      "ja": "7.2. URLからスクリプトを引く"
    },
    {
      "indent": 3,
      "text": "This example explains the steps performed by a manager to cause a distributed manager to pull a script from a URL.",
      "ja": "この例では、マネージャーが実行した手順で、分散マネージャーがURLからスクリプトをプルするようにします。"
    },
    {
      "indent": 3,
      "text": "1. The manager first checks the smLangTable and the smExtsnTable in order to select the appropriate script or language.",
      "ja": "1. マネージャーは、適切なスクリプトまたは言語を選択するために、最初にsmlangtableとsmextSntableをチェックします。"
    },
    {
      "indent": 3,
      "text": "2. The manager creates a row in the smScriptTable by issuing an SNMP set-request. The smScriptRowStatus object is set to `createAndWait' and the smScriptSource object is set to the URL which points to the script source. The smScriptLanguage object is set to the language in which the script was written. The smScriptOwner is set to a string which identifies the principal who owns the new row. The smScriptName defines the administratively assigned unique name for the script.",
      "ja": "2. マネージャーは、SNMPセットレクエストを発行することにより、smscripttableに行を作成します。smscriptrowStatusオブジェクトは「createandwait」に設定されており、smscriptsourceオブジェクトはスクリプトソースを指すURLに設定されています。smscriptlanguageオブジェクトは、スクリプトが書かれた言語に設定されています。smscriptownerは、新しい行を所有する校長を識別する文字列に設定されます。SMScriptNameは、スクリプトの管理上割り当てられた一意の名前を定義します。"
    },
    {
      "indent": 3,
      "text": "3. The manager sets the smScriptRowStatus object to `active'.",
      "ja": "3. マネージャーは、smscriptrowstatusオブジェクトを「アクティブ」に設定します。"
    },
    {
      "indent": 3,
      "text": "4. The manager sends a set-request to set the smScriptAdminStatus object to `enabled'. The Script MIB implementation now makes the script accessible to the runtime system. This causes a retrieval operation to pull the script from the URL stored in smScriptSource. This retrieval operation might be followed by a compile operation if the language requires a compilation step.",
      "ja": "4. マネージャーは、smscriptadmintatusオブジェクトを「有効」に設定するためにセットレクエストを送信します。スクリプトMIB実装により、スクリプトにランタイムシステムがアクセスできるようになりました。これにより、検索操作がSMScriptSourceに保存されているURLからスクリプトを引き出します。この検索操作の後に、言語がコンパイルステップを必要とする場合、コンパイル操作が続く場合があります。"
    },
    {
      "indent": 3,
      "text": "5. The manager polls the smScriptOperStatus object until the value is either `enabled' or one of the error status codes. The script can only be used if the value of smScriptOperStatus is `enabled'.",
      "ja": "5. マネージャーは、値が「有効」またはエラーステータスコードのいずれかになるまで、SMScriptOperStatusオブジェクトにポーリングします。スクリプトは、smscriptoperstatusの値が「有効」である場合にのみ使用できます。"
    },
    {
      "indent": 3,
      "text": "6. If the manager wants to store the script in local non-volatile storage, it should send a set-request which changes the smScriptStorageType object to `nonVolatile'.",
      "ja": "6. マネージャーがスクリプトをローカルの不揮発性ストレージに保存したい場合、SMScriptStorageTypeオブジェクトを「非揮発性」に変更するセットレクストを送信する必要があります。"
    },
    {
      "indent": 0,
      "text": "7.3. Modifying an Existing Script",
      "section_title": true,
      "ja": "7.3. 既存のスクリプトの変更"
    },
    {
      "indent": 3,
      "text": "This section explains how a manager can modify a script by sending SNMP set-requests.",
      "ja": "このセクションでは、マネージャーがSNMPセットレクエストを送信してスクリプトを変更する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. First, the script is de-activated by setting the smScriptAdminStatus to `disabled'.",
      "ja": "1. まず、SMScriptadmintatusを「無効」に設定することにより、スクリプトが解除されます。"
    },
    {
      "indent": 3,
      "text": "2. The manager polls the smScriptOperStatus object until the value is `disabled'.",
      "ja": "2. マネージャーは、値が「無効」になるまでsmscriptoperstatusオブジェクトを投票します。"
    },
    {
      "indent": 3,
      "text": "3. The manager sets smScriptSource to an empty string and smScriptAdminStatus to `editing'. This makes the script source available in the smCodeTable.",
      "ja": "3. マネージャーは、smscriptsourceを空の文字列に設定し、smscriptadmintatusに「編集」します。これにより、スクリプトソースがSMCodetableで利用可能になります。"
    },
    {
      "indent": 3,
      "text": "4. The manager polls the smScriptOperStatus object until the value is `editing'.",
      "ja": "4. マネージャーは、値が「編集」になるまでsmscriptoperstatusオブジェクトを投票します。"
    },
    {
      "indent": 3,
      "text": "5. The manager sends SNMP set-requests to modify the script in the smCodeTable.",
      "ja": "5. マネージャーは、SNMPセットリクエストを送信して、SMCodeTableのスクリプトを変更します。"
    },
    {
      "indent": 3,
      "text": "6. The manager sends a set-request to set the smScriptAdminStatus object to `enabled'. The Script MIB implementation now makes the script accessible to the runtime system. This might include the compilation of the script if the language requires a compilation step.",
      "ja": "6. マネージャーは、smscriptadmintatusオブジェクトを「有効」に設定するためにセットレクエストを送信します。スクリプトMIB実装により、スクリプトにランタイムシステムがアクセスできるようになりました。これには、言語にコンパイルステップが必要な場合、スクリプトのコンパイルが含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "7. The manager polls the smScriptOperStatus object until the value is either `enabled' or one of the error status codes. The script can only be used if the value of smScriptOperStatus is `enabled'.",
      "ja": "7. マネージャーは、値が「有効」またはエラーステータスコードのいずれかになるまで、SMScriptOperStatusオブジェクトにポーリングします。スクリプトは、smscriptoperstatusの値が「有効」である場合にのみ使用できます。"
    },
    {
      "indent": 0,
      "text": "7.4. Removing an Existing Script",
      "section_title": true,
      "ja": "7.4. 既存のスクリプトを削除します"
    },
    {
      "indent": 3,
      "text": "This section explains how a manager can remove a script from a distributed manager.",
      "ja": "このセクションでは、マネージャーが分散マネージャーからスクリプトを削除する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. First, the manager sets the smScriptAdminStatus to `disabled'. This will ensure that no new scripts can be started while running scripts finish their execution.",
      "ja": "1. 最初に、マネージャーはSMScriptadmintatusを「無効」に設定します。これにより、スクリプトの実行が実行されている間、新しいスクリプトを開始できないことが保証されます。"
    },
    {
      "indent": 3,
      "text": "2. The manager polls the smScriptOperStatus object until the value is `disabled'.",
      "ja": "2. マネージャーは、値が「無効」になるまでsmscriptoperstatusオブジェクトを投票します。"
    },
    {
      "indent": 3,
      "text": "3. The manager sends an SNMP set-request to change the smScriptRowStatus object to `destroy'. This will remove the row and all associated resources from the Script MIB implementation.",
      "ja": "3. マネージャーはSNMPセットレクエストを送信して、SMSCriptrowStatusオブジェクトを「破壊」して変更します。これにより、Script MIB実装から行と関連するすべてのリソースが削除されます。"
    },
    {
      "indent": 0,
      "text": "7.5. Creating a Launch Button",
      "section_title": true,
      "ja": "7.5. 起動ボタンを作成します"
    },
    {
      "indent": 3,
      "text": "This section explains how a manager can create a launch button for starting a script.",
      "ja": "このセクションでは、マネージャーがスクリプトを起動するための起動ボタンを作成する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. The manager, who is identified by an smLaunchOwner value, first chooses a name for the new row in the smLaunchTable. The manager sends an SNMP set-request to set the smLaunchRowStatus object for this smLaunchOwner and smLaunchName to `createAndWait'.",
      "ja": "1. Smlaunchownerの価値で識別されるマネージャーは、最初にSMLAunchTableの新しい行の名前を選択します。マネージャーは、SNMPセットレクエストを送信して、このsmlaunchOwnerのSMLAunchRowStatusオブジェクトを設定し、smlaunchNameを「CreateandWait」に設定します。"
    },
    {
      "indent": 3,
      "text": "2. The manager fills the new smLaunchTable row with all required parameters. The smLaunchScriptOwner and smLaunchScriptName values point to the script that should be started from this launch button.",
      "ja": "2. マネージャーは、必要なすべてのパラメーターで新しいSMLAunchTableの行を記入します。smlaunchScriptOwnerとsmlaunchScriptName値は、この起動ボタンから開始するスクリプトを指します。"
    },
    {
      "indent": 3,
      "text": "3. The manager sets the smLaunchRowStatus object to `active'.",
      "ja": "3. マネージャーは、smlaunchrowstatusオブジェクトを「アクティブ」に設定します。"
    },
    {
      "indent": 3,
      "text": "4. The manager sends a set-request to change smLaunchAdminStatus to `enabled' once the new smLaunchTable row is complete.",
      "ja": "4. マネージャーは、新しいsmlaunchtable行が完了したら、smlaunchadmintatusを「有効」に変更するためにセットレクエストを送信します。"
    },
    {
      "indent": 3,
      "text": "5. The manager polls the smLaunchOperStatus object until the value is `enabled'.",
      "ja": "5. マネージャーは、値が「有効」になるまでSmlaunchoperstatusオブジェクトを投票します。"
    },
    {
      "indent": 0,
      "text": "7.6. Launching a Script",
      "section_title": true,
      "ja": "7.6. スクリプトの起動"
    },
    {
      "indent": 3,
      "text": "This section explains the suggested way to launch a script from a given launch button.",
      "ja": "このセクションでは、特定の起動ボタンからスクリプトを起動する提案された方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. The manager first retrieves the value of smLaunchRunIndexNext from the launch button selected to start the script.",
      "ja": "1. マネージャーは、スクリプトを開始するために選択された[起動]ボタンから最初にSMLAUNCERUNINDEXNEXTの値を取得します。"
    },
    {
      "indent": 3,
      "text": "2. The manager sends an SNMP set-request to set the smLaunchStart object to the value obtained in step 1. This will launch the script if all necessary pre-conditions are satisfied (see the definition of smLaunchStart for more details). The manager can also provide the smLaunchArgument in the same set-request that is used to start the script. Upon successful start, a new row will be created in the smRunTable indexed by smLaunchOwner, smLaunchName and the value written to smLaunchStart.",
      "ja": "2. マネージャーは、SNMPセットリクエストを送信して、SMLAunchStartオブジェクトをステップ1で取得した値に設定します。これにより、必要なすべての事前条件が満たされた場合にスクリプトが起動します（詳細についてはSMLAunchStartの定義を参照）。マネージャーは、スクリプトの開始に使用されるのと同じセットレクストでsmlaunchargumentを提供することもできます。スタートが成功すると、Smlaunchowner、SmlaunchName、およびSmlaunchstartに書かれた値によってインデックスが作成されたSMRuntableで新しい行が作成されます。"
    },
    {
      "indent": 3,
      "text": "3. The manager polls the smRunState object until the value is either `executing' (the default case), `suspended' or `terminated'.",
      "ja": "3. マネージャーは、値が「実行」（デフォルトのケース）、「中断」、または「終了」のいずれかになるまで、SMRUNSTATEオブジェクトを投票します。"
    },
    {
      "indent": 3,
      "text": "The first step is not required. A manager can also try to guess an unused value for smRunIndex if the manager wants to start the script in a single transaction. A manager can also use the special value 0 if it does not care about the smRunIndex.",
      "ja": "最初のステップは必要ありません。マネージャーが単一のトランザクションでスクリプトを開始したい場合、マネージャーはSMRUNINDEXの未使用の値を推測しようとすることもできます。マネージャーは、SMRUNINDEXを気にしない場合は、特別な値0を使用することもできます。"
    },
    {
      "indent": 0,
      "text": "7.7. Suspending a Running Script",
      "section_title": true,
      "ja": "7.7. 実行中のスクリプトを一時停止します"
    },
    {
      "indent": 3,
      "text": "This section explains how a manager can suspend a running script.",
      "ja": "このセクションでは、マネージャーが実行中のスクリプトを一時停止する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. The manager sets the smRunControl object of the running script or the smLaunchControl object of the launch button used to start the running script to `suspend'. Setting smLaunchControl will suspend all running scripts started from the launch button while smRunControl will only suspend the running script associated with the smRunControl instance.",
      "ja": "1. マネージャーは、実行中のスクリプトのsmruncontrolオブジェクトまたはランニングスクリプトを起動するために「懸濁」するために使用される[起動]ボタンのSMLAunchControlオブジェクトを設定します。SMLAunchControlの設定は、起動ボタンから開始されたすべての実行スクリプトを一時停止し、SMRUNCONTROLはSMRUNCONTROLインスタンスに関連付けられた実行中のスクリプトのみを停止します。"
    },
    {
      "indent": 3,
      "text": "2. The manager polls the smRunState object until the value is either `suspended', `executing', or `terminated'. If the value is `suspended', then the suspend operation was successful. If the value is `executing', then the attempt to suspend the script failed. The value `terminated' can be received in cases where the suspend operation failed and the running script terminated between the polls.",
      "ja": "2. マネージャーは、値が「中断」、「実行」、または「終了」のいずれかになるまで、SMRunStateオブジェクトを投票します。値が「中断」されている場合、一時停止操作は成功しました。値が「実行」されている場合、スクリプトを一時停止しようとする試みは失敗しました。一時停止操作が失敗し、実行中のスクリプトが投票間で終了した場合、値「終了」を受信できます。"
    },
    {
      "indent": 3,
      "text": "Note that the set operation in the first step can lead to an inconsistentValue error which indicates that the suspend operation failed (e.g., because the runtime system does not support suspend/resume). There is no need to poll smRunState in this case.",
      "ja": "最初のステップでのセット操作は、サスペンド操作が故障したことを示す一貫性のない値エラーにつながる可能性があることに注意してください（たとえば、ランタイムシステムがサスペンド/履歴書をサポートしないため）。この場合、smrunstateを投票する必要はありません。"
    },
    {
      "indent": 0,
      "text": "7.8. Resuming a Suspended Script",
      "section_title": true,
      "ja": "7.8. 中断されたスクリプトの再開"
    },
    {
      "indent": 3,
      "text": "This section explains how a manager can resume a suspended script.",
      "ja": "このセクションでは、マネージャーが中断されたスクリプトを再開する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. The manager sets the smRunControl object of the running script or the smLaunchControl object of the launch button used to start the running script to `resume'. Setting smLaunchControl will resume all running scripts started from the launch button while smRunControl will only resume the running script associated with the smRunControl instance.",
      "ja": "1. マネージャーは、実行中のスクリプトのsmruncontrolオブジェクトまたは「履歴書」に実行されるスクリプトを開始するために使用される[起動]ボタンのSMLAunchControlオブジェクトを設定します。SMLAunchControlの設定は、起動ボタンから開始されたすべての実行スクリプトを再開しますが、SMRUNCONTROLはSMRUNCONTROLインスタンスに関連付けられた実行中のスクリプトのみを再開します。"
    },
    {
      "indent": 3,
      "text": "2. The manager polls the smRunState object until the value is either `suspended', `executing', or `terminated'. If the value is `executing', then the resume operation was successful. If the value is `suspended', then the attempt to resume the script failed. The value `terminated' can be received in cases where the resume operation was successful and the running script terminated between the polls.",
      "ja": "2. マネージャーは、値が「中断」、「実行」、または「終了」のいずれかになるまで、SMRunStateオブジェクトを投票します。値が「実行」されている場合、履歴書操作は成功しました。値が「中断」されている場合、スクリプトを再開しようとする試みは失敗しました。履歴書の操作が成功し、ランニングスクリプトが投票間で終了した場合、値「終了」を受信できます。"
    },
    {
      "indent": 3,
      "text": "Note that the set operation in the first step can lead to an inconsistentValue error which indicates that the resume operation failed (e.g., because the runtime system does not support suspend/resume). There is no need to poll smRunState in this case.",
      "ja": "最初のステップでのセット操作は、履歴書の操作が失敗したことを示す一貫性のない値誤差につながる可能性があることに注意してください（たとえば、ランタイムシステムが一時停止/履歴書をサポートしないため）。この場合、smrunstateを投票する必要はありません。"
    },
    {
      "indent": 0,
      "text": "7.9. Terminating a Running Script",
      "section_title": true,
      "ja": "7.9. 実行中のスクリプトを終了します"
    },
    {
      "indent": 3,
      "text": "This section explains two ways to terminate a running script. The first approach is as follows:",
      "ja": "このセクションでは、実行中のスクリプトを終了する2つの方法について説明します。最初のアプローチは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "1. The manager sets the smRunControl object of the running script or the smLaunchControl object of the launch button used to start the running script to `abort'. Setting smLaunchControl will abort all running scripts started from the launch button while smRunControl will only abort the running script associated with the smRunControl instance.",
      "ja": "1. マネージャーは、実行中のスクリプトのSMRUNCONTROLオブジェクトまたはランニングスクリプトを開始するために「ABORT」を開始するために使用される[起動]ボタンのSMLAunchControlオブジェクトを設定します。SMLAunchControlの設定は、起動ボタンから開始されたすべての実行スクリプトを中止し、SmrunControlはSmrunControlインスタンスに関連付けられた実行中のスクリプトのみを中止します。"
    },
    {
      "indent": 3,
      "text": "2. The manager polls the smRunState object until the value is `terminated'.",
      "ja": "2. マネージャーは、値が「終了」になるまでSMRUNSTATEオブジェクトを投票します。"
    },
    {
      "indent": 3,
      "text": "The second way to terminate a script is to set the smRunLifeTime to zero which causes the runtime system to terminate the script with a `lifeTimeExceeded' exit code:",
      "ja": "スクリプトを終了する2番目の方法は、smrunlifetimeをゼロに設定することです。これにより、ランタイムシステムが「lifetimeex cuceed」exitコードでスクリプトを終了させます。"
    },
    {
      "indent": 3,
      "text": "1. The manager changes the value of smRunLifeTime to 0. This causes the Script MIB implementation to abort the script because the remaining life time has expired.",
      "ja": "1. マネージャーは、Smrunlifetimeの値を0に変更します。これにより、残りの寿命が切れたため、スクリプトMIB実装がスクリプトを中止します。"
    },
    {
      "indent": 3,
      "text": "2. The manager polls the smRunState object until the value is `terminated'.",
      "ja": "2. マネージャーは、値が「終了」になるまでSMRUNSTATEオブジェクトを投票します。"
    },
    {
      "indent": 3,
      "text": "Note that changing the smRunLifeTime value can also be used to increase the permitted lifetime of a running script. For example, a manager can choose to set smRunLifeTime to a small fixed time interval and increase the value periodically. This strategy has the nice effect that scripts terminate automatically if the manager loses contact with the Script MIB engine.",
      "ja": "Smrunlifetime値を変更することも、実行中のスクリプトの許可された寿命を増やすためにも使用できることに注意してください。たとえば、マネージャーは、SMRunlifetimeをわずかな固定時間間隔に設定し、定期的に値を増やすことを選択できます。この戦略には、マネージャーがスクリプトMIBエンジンとの接触を失った場合、スクリプトが自動的に終了するという素晴らしい効果があります。"
    },
    {
      "indent": 0,
      "text": "7.10. Removing a Terminated Script",
      "section_title": true,
      "ja": "7.10. 終了したスクリプトを削除します"
    },
    {
      "indent": 3,
      "text": "This section explains how a manager can remove a terminated script.",
      "ja": "このセクションでは、マネージャーが終了したスクリプトを削除する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. The manager changes the smRunExpireTime to 0. This causes the Script MIB implementation to destroy the smRunTable entry of the terminated script.",
      "ja": "1. マネージャーは、SMRUNEXPIRETIMEを0に変更します。これにより、スクリプトMIB実装により、終了したスクリプトのSMRUNTABLEエントリが破壊されます。"
    },
    {
      "indent": 0,
      "text": "7.11. Removing a Launch Button",
      "section_title": true,
      "ja": "7.11. 起動ボタンを削除します"
    },
    {
      "indent": 3,
      "text": "This section explains how a manager can remove a launch button from a distributed manager.",
      "ja": "このセクションでは、マネージャーが分散マネージャーから起動ボタンを削除する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "1. First, the manager sets the smLaunchAdminStatus to `disabled'. This will ensure that no new scripts can be started from this launch button while running scripts finish their execution.",
      "ja": "1. 最初に、マネージャーはSmlaunchadmintatusを「無効」に設定します。これにより、スクリプトの実行が実行されている間に、この起動ボタンから新しいスクリプトを開始できないことが保証されます。"
    },
    {
      "indent": 3,
      "text": "2. The manager polls the smLaunchOperStatus object until the value is `disabled'.",
      "ja": "2. マネージャーは、値が「無効」になるまでSmlaunchoperstatusオブジェクトを投票します。"
    },
    {
      "indent": 3,
      "text": "3. The manager sends an SNMP set-request to change the smLaunchRowStatus object to `destroy'. This will remove the row and all associated resources from the Script MIB implementation.",
      "ja": "3. マネージャーはSNMPセットレクエストを送信して、smlaunchrowstatusオブジェクトを「破壊」して変更します。これにより、Script MIB実装から行と関連するすべてのリソースが削除されます。"
    },
    {
      "indent": 0,
      "text": "8. VACM Configuration Examples",
      "section_title": true,
      "ja": "8. vacm構成の例"
    },
    {
      "indent": 3,
      "text": "This section shows how the view-based access control model defined in RFC 2575 [RFC2575] can be configured to control access to the Script MIB.",
      "ja": "このセクションでは、RFC 2575 [RFC2575]で定義されているビューベースのアクセス制御モデルを、スクリプトMIBへのアクセスを制御するように構成する方法を示しています。"
    },
    {
      "indent": 0,
      "text": "8.1. Sandbox for Guests",
      "section_title": true,
      "ja": "8.1. ゲスト用のサンドボックス"
    },
    {
      "indent": 3,
      "text": "The first example demonstrates how to configure VACM to give the members of the VACM group \"guest\" limited access to the Script MIB. The MIB views defined below give the members of the \"guest\" group a sandbox where they can install and start their own scripts, but not access any other scripts maintained by the Script MIB implementation.",
      "ja": "最初の例は、vacmグループのメンバーにスクリプトMIBへの制限アクセスを提供するようにvacmを構成する方法を示しています。以下に定義されているMIBビューは、「ゲスト」グループのメンバーに、独自のスクリプトをインストールして起動できるサンドボックスを提供しますが、Script MIB実装によって維持されている他のスクリプトにアクセスしません。"
    },
    {
      "indent": 6,
      "text": "vacmAccessReadView.\"guest\".\"\".usm.authNoPriv = \"guestReadView\" vacmAccessWriteView.\"guest\".\"\".usm.authNoPriv = \"guestWriteView\"",
      "ja": "vacmaccessreadView。 \"guest\"。 \"\"。usm.authnopriv = \"guestreadview\" vacmacesswriteview。 \"guest\"。 \"\"。"
    },
    {
      "indent": 3,
      "text": "The guestReadView grants read access to the smLangTable, the smExtsnTable and to all the table entries owned by \"guest\":",
      "ja": "GuestReadViewは、SmlangTable、SmextSntable、および「Guest」が所有するすべてのテーブルエントリへのアクセスを読み取ります。"
    },
    {
      "indent": 6,
      "text": "guestReadView:\n    smLangTable                       (included)\n    smExtsnTable                      (included)\n    smScriptObjects.*.*.*.\"guest\"     (included)\n    smRunObjects.*.*.*.\"guest\"        (included)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The guestWriteView grants write access to all the table entries owned by \"guest\":",
      "ja": "GuestWriteViewは、「ゲスト」が所有するすべてのテーブルエントリへの書き込みアクセスを付与します。"
    },
    {
      "indent": 6,
      "text": "guestWriteView:\n    smScriptObjects.*.*.*.\"guest\"     (included)\n    smRunObjects.*.*.*.\"guest\"        (included)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8.2. Sharing Scripts",
      "section_title": true,
      "ja": "8.2. スクリプトの共有"
    },
    {
      "indent": 3,
      "text": "This example demonstrates how VACM can be used to share a repository of scripts between the members of the \"senior\" and the members of the \"junior\" VACM group:",
      "ja": "この例は、「上級」のメンバーと「ジュニア」VACMグループのメンバーとの間でスクリプトのリポジトリを共有するためにVACMを使用する方法を示しています。"
    },
    {
      "indent": 6,
      "text": "vacmAccessReadView.\"junior\".\"\".usm.authNoPriv = \"juniorReadView\" vacmAccessWriteView.\"junior\".\"\".usm.authNoPriv = \"juniorWriteView\"",
      "ja": "vacmaccessreadView。 \"Junior\""
    },
    {
      "indent": 6,
      "text": "juniorReadView:\n    smLangTable                       (included)\n    smExtsnTable                      (included)\n    smScriptObjects.*.*.*.\"junior\"    (included)\n    smRunObjects.*.*.*.\"junior\"       (included)\n    smScriptObjects.*.*.*.\"utils\"     (included)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "juniorWriteView:\n    smScriptObjects.*.*.*.\"junior\"    (included)\n    smRunObjects.*.*.*.\"junior\"       (included)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The definitions above allow the members of the \"junior\" VACM group to start the scripts owned by \"utils\" in addition to the script the members of the \"junior\" VACM group installed themselves. This is accomplished by giving the members of \"junior\" read access to scripts in \"utils\". This allows members of \"junior\" to create entries in the smLaunchTable which refer to scripts in \"utils\", and to launch those scripts using these entries in the smLaunchTable.",
      "ja": "上記の定義により、「ジュニア」VACMグループのメンバーは、スクリプトに加えて「UTILS」が所有するスクリプトを開始することができます。これは、「ジュニア」のメンバーに「utils」のスクリプトへのアクセスを読み取ることによって達成されます。これにより、「ジュニア」のメンバーは、「utils」のスクリプトを参照しているSmlaunchtableにエントリを作成し、これらのエントリをSmlaunchTableで使用してこれらのスクリプトを起動することができます。"
    },
    {
      "indent": 6,
      "text": "vacmAccessReadView.\"senior\".\"\".usm.authNoPriv = \"seniorReadView\" vacmAccessWriteView.\"senior\".\"\".usm.authNoPriv = \"seniorWriteView\"",
      "ja": "vacmaccessreadview。 \"senior\""
    },
    {
      "indent": 6,
      "text": "seniorReadView:\n    smLangTable                       (included)\n    smExtsnTable                      (included)\n    smScriptObjects.*.*.*.\"senior\"    (included)\n    smRunObjects.*.*.*.\"senior\"       (included)\n    smScriptObjects.*.*.*.\"utils\"     (included)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "seniorWriteView:\n    smScriptObjects.*.*.*.\"senior\"    (included)\n    smRunObjects.*.*.*.\"senior\"       (included)\n    smScriptObjects.*.*.*.\"utils\"     (included)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The definitions for the members of the \"senior\" VACM group allow to start the scripts owned by \"utils\" in addition to the script the members of the \"senior\" VACM group installed themself. The third write access rule in the seniorWriteView also grants the permission to install scripts owned by \"utils\". The members of the \"senior\" VACM group therefore have the permissions to install and modify scripts that can be called by the members of the \"junior\" VACM group.",
      "ja": "「シニア」VACMグループのメンバーの定義により、スクリプトに加えて「UTILS」が所有するスクリプトを開始することができます。「シニア」VACMグループのメンバーは自分でインストールしました。SeniorWriteViewの3番目の書き込みアクセスルールは、「UTILS」が所有するスクリプトをインストールする許可も許可しています。したがって、「シニア」VACMグループのメンバーは、「ジュニア」VACMグループのメンバーが呼び出すことができるスクリプトをインストールおよび変更する許可を持っています。"
    },
    {
      "indent": 0,
      "text": "8.3. Emergency Scripts",
      "section_title": true,
      "ja": "8.3. 緊急スクリプト"
    },
    {
      "indent": 3,
      "text": "This example demonstrates how VACM can be used to allow the members of the \"junior\" VACM group to launch scripts that are executed with the permissions associated with the \"emergency\" owner. This works by adding the following rules to the juniorReadView and the juniorWriteView:",
      "ja": "この例は、「ジュニア」VACMグループのメンバーが「緊急」所有者に関連付けられた権限で実行されるスクリプトを起動できるようにするためにVACMを使用する方法を示しています。これは、JuniorReadViewとJuniorWriteViewに次のルールを追加することで機能します。"
    },
    {
      "indent": 6,
      "text": "juniorReadView:\n    smScriptObjects.*.*.*.\"emergency\" (included)\n    smRunObjects.*.*.*.\"emergency\"    (included)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "juniorWriteView smLaunchStart.\"emergency\" (included) smLaunchArgument.\"emergency\" (included)",
      "ja": "JuniorWriteView smlaunchstart。"
    },
    {
      "indent": 3,
      "text": "The rules added to the juniorReadView grant read access to the scripts, the launch buttons and the results owned by \"emergency\". The rules added to the juniorWriteView grant write permissions to the smLaunchStart and smLaunchArgument variables owned by \"emergency\". Members of the \"junior\" VACM group can therefore start scripts that will execute under the owner \"emergency\".",
      "ja": "JuniorReadviewのグラントに追加されたルールは、スクリプト、起動ボタン、および「緊急」が所有する結果へのアクセスを読み取ります。JuniorWriteViewの助成金に追加されたルールは、「緊急」が所有するSMLAunchStartおよびSMLAunchArgument変数に許可を書き込みます。したがって、「ジュニア」VACMグループのメンバーは、所有者の「緊急」の下で実行されるスクリプトを開始できます。"
    },
    {
      "indent": 6,
      "text": "seniorReadView:\n    smScriptObjects.*.*.*.\"emergency\" (included)\n    smRunObjects.*.*.*.\"emergency\"    (included)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "seniorWriteView:\n    smScriptObjects.*.*.*.\"emergency\" (included)\n    smRunObjects.*.*.*.\"emergency\"    (included)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The rules added to the seniorReadView and the seniorWriteView will give the members of the \"senior\" VACM group the rights to install emergency scripts and to configure appropriate launch buttons.",
      "ja": "SeniorReadViewとSeniorWriteViewに追加されたルールは、「Senior」Vacm Groupのメンバーに緊急スクリプトをインストールし、適切な起動ボタンを構成する権利を提供します。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The Internet Assigned Numbers Authority (IANA) is responsible for maintaining a MIB module (IANA-LANGUAGE-MIB) which provides OID registrations for well-known languages. The IANA language registry is intended to reduce interoperability problems by providing a single list of well-known languages. However, it is of course still possible to register languages in private OID spaces. Registering languages in private OID spaces is especially attractive if a language is used for experimentation or if a language is only used in environments where the distribution of MIB modules with the language registration does not cause any maintenance problems.",
      "ja": "インターネットが割り当てられたNumbers Authority（IANA）は、よく知られている言語のOID登録を提供するMIBモジュール（IANA-Language-MIB）を維持する責任があります。IANA言語レジストリは、よく知られている言語の単一のリストを提供することにより、相互運用性の問題を減らすことを目的としています。ただし、もちろん、プライベートOIDスペースに言語を登録することはまだ可能です。言語が実験に使用される場合、または言語登録を伴うMIBモジュールの分布がメンテナンスの問題を引き起こさない環境でのみ言語が使用される場合、言語をプライベートOIDスペースで登録することは特に魅力的です。"
    },
    {
      "indent": 3,
      "text": "Any additions or changes to the list of languages registered via IANA require Designated Expert Review as defined in the IANA guidelines [RFC2434]. The Designated Expert will be selected by the IESG Area Director for the IETF Operations and Management Area.",
      "ja": "IANAを介して登録された言語のリストへの追加または変更は、IANAガイドライン[RFC2434]で定義されている指定された専門家レビューが必要です。指定された専門家は、IETF運用および管理エリアのIESGエリアディレクターによって選択されます。"
    },
    {
      "indent": 0,
      "text": "10. Security Considerations",
      "section_title": true,
      "ja": "10. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in this MIB that have a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations.",
      "ja": "このMIBには、読み取りワイトおよび/またはread-Createの最大アクセス句がある管理オブジェクトがいくつかあります。このようなオブジェクトは、一部のネットワーク環境で敏感または脆弱と見なされる場合があります。適切な保護なしの非セキュア環境でのセット操作のサポートは、ネットワーク操作に悪影響を与える可能性があります。"
    },
    {
      "indent": 3,
      "text": "SNMPv1 by itself is not a secure environment. Even if the network itself is secure (for example by using IPSec), even then, there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB.",
      "ja": "SNMPV1自体は安全な環境ではありません。ネットワーク自体が（たとえばIPSECを使用して）安全である場合でも、それでもセキュアネットワークで誰がアクセスして取得/セット（読み取り/変更/作成/削除/削除）を制御することはできません。ミブ。"
    },
    {
      "indent": 3,
      "text": "It is recommended that the implementers consider the security features as provided by the SNMPv3 framework. Specifically, the use of the User-based Security Model RFC 2574 [RFC2574] and the View-based Access Control Model RFC 2575 [RFC2575] is recommended.",
      "ja": "実装者は、SNMPV3フレームワークで提供されるセキュリティ機能を考慮することをお勧めします。具体的には、ユーザーベースのセキュリティモデルRFC 2574 [RFC2574]およびビューベースのアクセス制御モデルRFC 2575 [RFC2575]の使用をお勧めします。"
    },
    {
      "indent": 3,
      "text": "It is then a customer/user responsibility to ensure that the SNMP entity giving access to an instance of this MIB, is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "ja": "SNMPエンティティがこのMIBのインスタンスへのアクセスを提供するSNMPエンティティが、実際に取得または設定する正当な権利を持つプリンシパル（ユーザー）にのみオブジェクトにアクセスできるように適切に構成されていることを保証することは、顧客/ユーザーの責任です（変更を変更します（変更）/作成/削除）それら。"
    },
    {
      "indent": 3,
      "text": "This MIB provides the ability to distribute applications written in an arbitrary language to remote systems in a network. The security features of the languages available in a particular implementation should be taken into consideration when deploying an implementation of this MIB.",
      "ja": "このMIBは、任意の言語で記述されたアプリケーションをネットワーク内のリモートシステムに配布する機能を提供します。このMIBの実装を展開する際には、特定の実装で利用可能な言語のセキュリティ機能を考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "To facilitate the provisioning of access control by a security administrator using the View-Based Access Control Model (VACM) defined in RFC 2575 [RFC2575] for tables in which multiple users may need to independently create or modify entries, the initial index is used as an \"owner index\". Such an initial index has a syntax of SnmpAdminString, and can thus be trivially mapped to a securityName or groupName as defined in VACM, in accordance with a security policy.",
      "ja": "複数のユーザーがエントリを個別に作成または変更する必要があるテーブルのRFC 2575 [RFC2575]で定義されたビューベースのアクセス制御モデル（VACM）を使用して、セキュリティ管理者によるアクセス制御のプロビジョニングを容易にするために、初期インデックスは次のように使用されます。「所有者インデックス」。このような初期インデックスには、snmpadminstringの構文があり、したがって、セキュリティポリシーに従って、vacmで定義されているように、SecurityNameまたはGroupNameに簡単にマッピングできます。"
    },
    {
      "indent": 3,
      "text": "All entries in related tables belonging to a particular user will have the same value for this initial index. For a given user's entries in a particular table, the object identifiers for the information in these entries will have the same subidentifiers (except for the \"column\" subidentifier) up to the end of the encoded owner index. To configure VACM to permit access to this portion of the table, one would create vacmViewTreeFamilyTable entries with the value of vacmViewTreeFamilySubtree including the owner index portion, and vacmViewTreeFamilyMask \"wildcarding\" the column subidentifier. More elaborate configurations are possible.",
      "ja": "特定のユーザーに属する関連テーブルのすべてのエントリは、この初期インデックスに対して同じ値を持ちます。特定のテーブルにある特定のユーザーのエントリの場合、これらのエントリの情報のオブジェクト識別子は、エンコードされた所有者インデックスの最後まで同じサブ条約者（「列」のサブアイデンティファイアを除く）を持っています。テーブルのこの部分へのアクセスを許可するためにVacmを構成するために、所有者インデックス部分を含むvacmviewTreefamilySubtreeの値とvacmviewTreefamilymaskのcolumn subidentifierを含むvacmviewtreefamilysubtreeのvacmviewtreefamilytableエントリを作成します。より精巧な構成が可能です。"
    },
    {
      "indent": 3,
      "text": "The VACM access control mechanism described above provides control over SNMP access to Script MIB objects. There are a number of other access control issues that are outside of the scope of this MIB. For example, access control on URLs, especially those that use the file scheme, must be realized by the underlying operating system. A mapping of the owner index value to a local operating system security user identity should be used by an implementation of this MIB to control access to operating system resources when resolving URLs or executing scripts.",
      "ja": "上記のVACMアクセス制御メカニズムは、スクリプトMIBオブジェクトへのSNMPアクセスに対する制御を提供します。このMIBの範囲外にある他の多くのアクセス制御の問題があります。たとえば、URLのアクセス制御、特にファイルスキームを使用するアクセスは、基礎となるオペレーティングシステムによって実現する必要があります。ローカルオペレーティングシステムへの所有者インデックス値のマッピングは、URLを解決したりスクリプトを実行したりするときに、オペレーティングシステムリソースへのアクセスを制御するために、このMIBの実装によって使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "11. Intellectual Property",
      "section_title": true,
      "ja": "11. 知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、知的財産またはその他の権利の有効性または範囲に関して、この文書に記載されているテクノロジーの実装または使用に関連すると主張される可能性のある他の権利、またはそのような権利に基づくライセンスがどの程度であるかについての程度に関連する可能性があるという立場はありません。利用可能;また、そのような権利を特定するために努力したことも表明していません。標準トラックおよび標準関連のドキュメントの権利に関するIETFの手順に関する情報は、BCP-11に記載されています。出版のために利用可能にされた権利の請求のコピーと、利用可能になるライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を得ることができますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、関心のある当事者に、この基準を実践するために必要な技術をカバーする可能性のある著作権、特許、または特許出願、またはその他の独自の権利を注意深く招待するよう招待しています。情報をIETFエグゼクティブディレクターに宛ててください。"
    },
    {
      "indent": 0,
      "text": "12. Changes from RFC 2592",
      "section_title": true,
      "ja": "12. RFC 2592からの変更"
    },
    {
      "indent": 3,
      "text": "The following list documents major changes from the previous version of this document, published as RFC 2592:",
      "ja": "次のリストは、RFC 2592として公開されたこのドキュメントの以前のバージョンからの大きな変更をドキュメントします。"
    },
    {
      "indent": 3,
      "text": "- Updated the boilerplate and the references.",
      "ja": "- ボイラープレートと参照を更新しました。"
    },
    {
      "indent": 3,
      "text": "- Added revision clauses to the module identity macro.",
      "ja": "- モジュールIDマクロにリビジョン句を追加しました。"
    },
    {
      "indent": 3,
      "text": "- Various typos have been fixed.",
      "ja": "- さまざまなタイプミスが修正されています。"
    },
    {
      "indent": 3,
      "text": "- Added SIZE restriction to smScriptName which is consistent with smLaunchScriptName. Added DEFVAL and some clarifying text on the usage of a zero-length string to smLaunchScriptName.",
      "ja": "- SMLAunchScriptNameと一致するSMScriptNameにサイズ制限を追加しました。smlaunchscriptnameにゼロ長さの文字列の使用に関するdefvalといくつかの明確なテキストを追加しました。"
    },
    {
      "indent": 3,
      "text": "- Clarified under which conditions changes to smScriptLanguage are invalid.",
      "ja": "- どの条件がsmscriptlanguageに変化するかを明確にします。"
    },
    {
      "indent": 3,
      "text": "- Added new smScriptError and smLaunchError objects.",
      "ja": "- 新しいsmscripterrorとsmlauncherrorオブジェクトを追加しました。"
    },
    {
      "indent": 3,
      "text": "- Setting smRunLifeTime to its maximum value now disables the timer so that scripts can run forever.",
      "ja": "- Smrunlifetimeを最大値に設定すると、スクリプトが永久に実行できるようにタイマーが無効になります。"
    },
    {
      "indent": 3,
      "text": "- Added the `autostart' value to the smLaunchAdminStatus object which allows to launch scripts during the disable->enabled transition of smLaunchOperStatus.",
      "ja": "- smlaunchadmintatusオブジェクトに「autostart」値を追加しました。これにより、smlaunchoperstatusの無効化中にスクリプトを起動できるようになりました。"
    },
    {
      "indent": 3,
      "text": "- Added an additional step to the \"creating a launch button\" procedure which sets the smLaunchRowStatus to active.",
      "ja": "- smlaunchrowstatusをアクティブに設定する「起動ボタンの作成」手順に追加のステップを追加しました。"
    },
    {
      "indent": 3,
      "text": "- Added a final polling step in the procedure to launch a script.",
      "ja": "- 手順に最終的なポーリングステップを追加して、スクリプトを起動しました。"
    },
    {
      "indent": 3,
      "text": "- Added a final polling step in the procedure to terminate a running script.",
      "ja": "- 実行中のスクリプトを終了するための手順に最終的なポーリングステップを追加しました。"
    },
    {
      "indent": 3,
      "text": "- Removed the requirement that smRunError is a zero-length string while the smRunExitCode has the value `noError'.",
      "ja": "- Smrunexitcodeには値「noerror」がある間、smrunerrorがゼロ長さの文字列であるという要件を削除しました。"
    },
    {
      "indent": 3,
      "text": "- Added new smScriptLastChange, smLaunchLastChange, smRunResultTime, and smRunErrorTime objects.",
      "ja": "- 新しいsmscriptlastchange、smlaunchlastchange、smrunresulttime、およびsmrunerrortimeオブジェクトを追加しました。"
    },
    {
      "indent": 3,
      "text": "- Added some additional boilerplate text to the security considerations section.",
      "ja": "- セキュリティに関する考慮事項セクションにいくつかの追加のボイラープレートテキストを追加しました。"
    },
    {
      "indent": 3,
      "text": "- Added a new smLaunchRowExpireTime object and a new `expired' state to the smLaunchOperStatus object.",
      "ja": "- 新しいsmlaunchrowexpiretimeオブジェクトと、smlaunchoperstatusオブジェクトに新しい「期限切れ」状態を追加しました。"
    },
    {
      "indent": 3,
      "text": "- Clarified that the smRunState object reports the actual state if attempts to suspend or resume scripts fail.",
      "ja": "- SMRUNSTATEオブジェクトが、スクリプトを一時停止または再開しようとする場合、実際の状態を報告していることを明らかにしました。"
    },
    {
      "indent": 3,
      "text": "- Clarified the conditions under which set operations to smLaunchControl and smRunControl can lead to inconsistentValue errors.",
      "ja": "- SMLAunchControlとSmrunControlに操作を設定する条件を明確にしました。"
    },
    {
      "indent": 3,
      "text": "- Added procedures for suspending/resuming/removing running scripts to section 7.",
      "ja": "- 実行中のスクリプトを一時停止/再開/削除するための手順をセクション7に追加しました。"
    },
    {
      "indent": 3,
      "text": "- Added text to the smScriptStorageType description to better highlight the difference between the storage type of the script row entry and the script itself.",
      "ja": "- SMScriptStorageType説明にテキストを追加して、スクリプト行エントリのストレージタイプとスクリプト自体の違いをよりよく強調します。"
    },
    {
      "indent": 3,
      "text": "- Updated the smCompliances statement to not require write access to the smCodeText object after row creation.",
      "ja": "- smcompliancesステートメントを更新して、行の作成後にsmcodetextオブジェクトへの書き込みアクセスを必要としないようにしました。"
    },
    {
      "indent": 3,
      "text": "- Deprecated smCompliance, smScriptGroup, smLaunchGroup, smRunGroup, smNotificationsGroup and created smCompliance2, smScriptGroup2, smLaunchGroup2, smRunGroup2 and smNotificationsGroup2 that take care of the new objects and notifications.",
      "ja": "- SMCompliance、SMScriptGroup、SMLAunchGroup、SMRUNGROUP、SMNOTIFICATIONSGROUP、SMSCRIPTGROUP2、SMLAUNCHGROUP2、SMRUNGROUP2、SMRUNGROUP2、SMNOTIFICATIONSGROUP2を作成したSMNOTIFICATIONSGROUPを廃止しました。"
    },
    {
      "indent": 0,
      "text": "13. Acknowledgments",
      "section_title": true,
      "ja": "13. 謝辞"
    },
    {
      "indent": 3,
      "text": "This document was produced by the IETF Distributed Management (DISMAN) working group.",
      "ja": "このドキュメントは、IETF分散管理（ディスマン）ワーキンググループによって作成されました。"
    },
    {
      "indent": 0,
      "text": "14. References",
      "section_title": true,
      "ja": "14. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2571] Harrington, D., Presuhn, R. and B. Wijnen, \"An Architecture for Describing SNMP Management Frameworks\", RFC 2571, April 1999.",
      "ja": "[RFC2571] Harrington、D.、Presuhn、R。およびB. Wijnen、「SNMP管理フレームワークを説明するためのアーキテクチャ」、RFC 2571、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC1155] Rose, M. and K. McCloghrie, \"Structure and Identification of Management Information for TCP/IP-based Internets\", STD 16, RFC 1155, May 1990.",
      "ja": "[RFC1155] Rose、M。およびK. McCloghrie、「TCP/IPベースのインターネットの管理情報の構造と識別」、STD 16、RFC 1155、1990年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC1212] Rose, M. and K. McCloghrie, \"Concise MIB Definitions\", STD 16, RFC 1212, March 1991.",
      "ja": "[RFC1212] Rose、M。およびK. McCloghrie、「Concise MIB Definitions」、STD 16、RFC 1212、1991年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC1215] Rose, M., \"A Convention for Defining Traps for use with the SNMP\", RFC 1215, March 1991.",
      "ja": "[RFC1215] Rose、M。、「SNMPで使用するためのトラップを定義するための条約」、RFC 1215、1991年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[RFC2578] McCloghrie、K.、Perkins、D.、Schoenwaelder、J.、Case、J.、Rose、M。、およびS. Waldbusser、「管理情報の構造バージョン2（SMIV2）、STD 58、RFC 2578、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[RFC2579] McCloghrie、K.、Perkins、D.、Schoenwaelder、J.、Case、J.、Rose、M。、およびS. Waldbusser、「SMIV2のテキストコンベンション」、STD 58、RFC 2579、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "ja": "[RFC2580] McCloghrie、K.、Perkins、D.、Schoenwaelder、J.、Case、J.、Rose、M。、およびS. Waldbusser、「Smiv2の適合ステートメント」、STD 58、RFC 2580、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC1157] Case, J., Fedor, M., Schoffstall, M. and J. Davin, \"Simple Network Management Protocol\", STD 15, RFC 1157, May 1990.",
      "ja": "[RFC1157] Case、J.、Fedor、M.、Schoffstall、M。、およびJ. Davin、「Simple Network Management Protocol」、STD 15、RFC 1157、1990年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC1901] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Introduction to Community-based SNMPv2\", RFC 1901, January 1996.",
      "ja": "[RFC1901] Case、J.、McCloghrie、K.、Rose、M。、およびS. Waldbusser、「コミュニティベースのSNMPV2の紹介」、RFC 1901、1996年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC1906] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Transport Mappings for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1906, January 1996.",
      "ja": "[RFC1906] Case、J.、McCloghrie、K.、Rose、M。、およびS. Waldbusser、「Simple Network Management Protocol（SNMPV2）のバージョン2の輸送マッピング」、RFC 1906、1996年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2572] Case, J., Harrington D., Presuhn R. and B. Wijnen, \"Message Processing and Dispatching for the Simple Network Management Protocol (SNMP)\", RFC 2572, April 1999.",
      "ja": "[RFC2572] Case、J.、Harrington D.、Presuhn R.およびB. Wijnen、「Simple Network Management Protocol（SNMP）のメッセージ処理とディスパッチ」、RFC 2572、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2574] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", RFC 2574, April 1999.",
      "ja": "[RFC2574] Blumenthal、U.およびB. Wijnen、「単純なネットワーク管理プロトコル（SNMPV3）のバージョン3のユーザーベースのセキュリティモデル（USM）」、RFC 2574、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC1905] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Protocol Operations for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1905, January 1996.",
      "ja": "[RFC1905] Case、J.、McCloghrie、K.、Rose、M。、およびS. Waldbusser、「Simple Network Management Protocol（SNMPV2）のバージョン2のプロトコル操作」、RFC 1905、1996年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2573] Levi, D., Meyer, P. and B. Stewart, \"SNMPv3 Applications\", RFC 2573, April 1999.",
      "ja": "[RFC2573] Levi、D.、Meyer、P。and B. Stewart、「SNMPV3 Applications」、RFC 2573、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2575] Wijnen, B., Presuhn, R. and K. McCloghrie, \"View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)\", RFC 2575, April 1999.",
      "ja": "[RFC2575] Wijnen、B.、Presuhn、R。、およびK. McCloghrie、「シンプルネットワーク管理プロトコル（SNMP）のビューベースのアクセス制御モデル（VACM）」、1999年4月、RFC 2575。"
    },
    {
      "indent": 3,
      "text": "[RFC2570] Case, J., Mundy, R., Partain, D. and B. Stewart, \"Introduction to Version 3 of the Internet-standard Network Management Framework\", RFC 2570, April 1999.",
      "ja": "[RFC2570] Case、J.、Mundy、R.、Partain、D。、およびB. Stewart、「インターネット標準ネットワーク管理フレームワークのバージョン3の紹介」、RFC 2570、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2028] Hovey, R. and S. Bradner, \"The Organizations Involved in the IETF Standards Process\", BCP 11, RFC 2028, October 1996.",
      "ja": "[RFC2028] Hovey、R。およびS. Bradner、「IETF標準プロセスに関与する組織」、BCP 11、RFC 2028、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2396] Berners-Lee, T., Fielding, R. and L. Masinter, \" Uniform Resource Identifiers (URI): Generic Syntax\", RFC 2396, August 1998.",
      "ja": "[RFC2396] Berners-Lee、T.、Fielding、R。and L. Masinter、「Uniform Resource Identiers（URI）：Generic Syntax」、RFC 2396、1998年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC959] Postel, J. and J. Reynolds, \"File Transfer Protocol\", STD 9, RFC 959, October 1985.",
      "ja": "[RFC959] Postel、J。およびJ. Reynolds、「ファイル転送プロトコル」、STD 9、RFC 959、1985年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2616] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P. and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[RFC2616] Fielding、R.、Gettys、J.、Mogul、J.、Frystyk、H.、Masinter、L.、Leach、P。and T. Berners-Lee、 \"Hypertext Transfer Protocol-HTTP/1.1\"、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2434] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[RFC2434] Narten、T。およびH. Alvestrand、「RFCSでIANA考慮事項セクションを書くためのガイドライン」、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "15. Editors' Addresses",
      "section_title": true,
      "ja": "15. 編集者のアドレス"
    },
    {
      "indent": 3,
      "text": "David B. Levi Nortel Networks 4401 Great America Parkway Santa Clara, CA 95052-8185 USA",
      "ja": "David B. Levi Nortel Networks 4401 Great America Parkway Santa Clara、CA 95052-8185 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 423 686 0432\nEMail: dlevi@nortelnetworks.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Juergen Schoenwaelder TU Braunschweig Bueltenweg 74/75 38106 Braunschweig Germany",
      "ja": "Juergen Schoenwaelder Tu Braunschweig Bueltenweg 74/75 38106 Braunschweigドイツ"
    },
    {
      "indent": 3,
      "text": "Phone: +49 531 391-3283\nEMail: schoenw@ibr.cs.tu-bs.de",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "16. Full Copyright Statement",
      "section_title": true,
      "ja": "16. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があり、それについてコメントまたは説明する派生作品、またはその実装を支援することができます。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}