{
  "title": {
    "text": "RFC 3672 - Subentries in the Lightweight Directory Access Protocol (LDAP)",
    "ja": "RFC 3672 - LDAP（Lightweight Directory Access Protocol）の中にサブエントリ"
  },
  "number": 3672,
  "created_at": "2019-10-20 23:49:25.707335+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        K. Zeilenga\nRequest for Comments: 3672                           OpenLDAP Foundation\nCategory: Standards Track                                        S. Legg\n                                                     Adacel Technologies\n                                                           December 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "Subentries in the Lightweight Directory Access Protocol (LDAP)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "In X.500 directories, subentries are special entries used to hold information associated with a subtree or subtree refinement. This document adapts X.500 subentries mechanisms for use with the Lightweight Directory Access Protocol (LDAP).",
      "ja": "X.500ディレクトリでは、サブエントリは、サブツリーまたはサブツリー改善に関連した情報を保持するために使用される特殊なエントリです。この文書では、Lightweight Directory Access Protocol（LDAP）を使用するためX.500サブエントリのメカニズムを適応させます。"
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1。概要"
    },
    {
      "indent": 3,
      "text": "From [X.501]:",
      "ja": "[X.501]から："
    },
    {
      "indent": 7,
      "text": "A subentry is a special kind of entry immediately subordinate to\nan administrative point.  It contains attributes that pertain to\na subtree (or subtree refinement) associated with its\nadministrative point.  The subentries and their administrative\npoint are part of the same naming context.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "A single subentry may serve all or several aspects of administrative authority. Alternatively, a specific aspect of administrative authority may be handled through one or more of its own subentries.",
      "ja": "単一サブエントリは、管理者権限の全部またはいくつかの側面を果たすことができます。あるいは、管理権限の特定の態様は、それ自身のサブエントリの一つ以上を介して処理されてもよいです。"
    },
    {
      "indent": 3,
      "text": "Subentries in the Lightweight Directory Access Protocol (LDAP) [RFC3377] SHALL behave in accordance with X.501 unless noted otherwise in this specification.",
      "ja": "この仕様では、特に断りのない限りのLDAP（Lightweight Directory Access Protocol）[RFC3377]でサブエントリはX.501に従って振る舞うものとします。"
    },
    {
      "indent": 3,
      "text": "In absence of the subentries control (detailed in Section 3), subentries SHALL NOT be considered in one-level and subtree scope search operations. For all other operations, including base scope search operations, subentries SHALL be considered.",
      "ja": "（第3節に詳述）サブエントリ制御の非存在下で、サブエントリは、一つレベルおよびサブツリースコープ検索操作に考慮しません。ベーススコープ検索操作など、他のすべての操作については、サブエントリが考慮されなければなりません。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions",
      "section_title": true,
      "ja": "1.1。表記"
    },
    {
      "indent": 3,
      "text": "Schema definitions are provided using LDAP description formats [RFC2252]. Definitions provided here are formatted (line wrapped) for readability.",
      "ja": "スキーマ定義は、LDAP記述形式[RFC2252]を使用して提供されます。ここで提供される定義は、読みやすくするために（ラップラインを）フォーマットされています。"
    },
    {
      "indent": 3,
      "text": "Protocol elements are described using ASN.1 [X.680]. The term \"BER-encoded\" means the element is to be encoded using the Basic Encoding Rules [X.690] under the restrictions detailed in Section 5.1 of [RFC2251].",
      "ja": "プロトコル要素は、ASN.1 [X.680]を使用して記載されています。用語「BERエンコードは」要素は[RFC2251]のセクション5.1に詳述制約下基本符号化規則[X.690]を使用して符号化されるべきであることを意味します。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Subentry Schema",
      "section_title": true,
      "ja": "2.サブエントリのスキーマ"
    },
    {
      "indent": 0,
      "text": "2.1. Subtree Specification Syntax",
      "section_title": true,
      "ja": "2.1。サブツリーの仕様構文"
    },
    {
      "indent": 3,
      "text": "The Subtree Specification syntax provides a general purpose mechanism for the specification of a subset of entries in a subtree of the Directory Information Tree (DIT). A subtree begins at some base entry and includes the subordinates of that entry down to some identified lower boundary, possibly extending to the leaf entries. A subtree specification is always used within a context or scope which implicitly determines the bounds of the subtree. For example, the scope of a subtree specification for a subschema administrative area does not include the subtrees of any subordinate administrative point entries for subschema administration. Where a subtree specification does not identify a contiguous subset of the entries within a single subtree the collection is termed a subtree refinement.",
      "ja": "サブツリー仕様の構文は、ディレクトリ情報ツリー（DIT）のサブツリー内のエントリのサブセットの仕様のための汎用的なメカニズムを提供します。サブツリーは、いくつかのベースエントリで始まり、おそらく葉エントリに延びる、ダウンいくつかの識別された下側境界にそのエントリの部下を含みます。サブツリー仕様は常に暗黙サブツリーの境界を決定するコンテキストまたは範囲内で使用されています。例えば、サブスキーマ管理領域のサブツリーの仕様の範囲は、サブスキーマの投与のための任意の下位の管理ポイントエントリのサブツリーを含んでいません。サブツリーの仕様は、単一のサブツリー内のエントリの連続したサブセットを識別しない場合は、コレクションは、サブツリー洗練と呼ばれています。"
    },
    {
      "indent": 3,
      "text": "This syntax corresponds to the SubtreeSpecification ASN.1 type described in [X.501], Section 11.3. This ASN.1 data type definition is reproduced here for completeness.",
      "ja": "この構文は、セクション11.3、[X.501]に記載SubtreeSpecificationのASN.1型に対応します。このASN.1データ型定義は、完全性のため、ここで再現されます。"
    },
    {
      "indent": 5,
      "text": "SubtreeSpecification ::= SEQUENCE {\n    base                [0] LocalName DEFAULT { },\n                            COMPONENTS OF ChopSpecification,\n    specificationFilter [4] Refinement OPTIONAL }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "LocalName ::= RDNSequence",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "ChopSpecification ::= SEQUENCE {\n    specificExclusions  [1] SET OF CHOICE {\n                            chopBefore [0] LocalName,\n                            chopAfter [1] LocalName } OPTIONAL,\n    minimum             [2] BaseDistance DEFAULT 0,\n    maximum             [3] BaseDistance OPTIONAL }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "BaseDistance ::= INTEGER (0 .. MAX)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "Refinement ::= CHOICE {\n    item                [0] OBJECT-CLASS.&id,\n    and                 [1] SET OF Refinement,\n    or                  [2] SET OF Refinement,\n    not                 [3] Refinement }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The components of SubtreeSpecification are: base, which identifies the base entry of the subtree or subtree refinement, and specificExclusions, minimum, maximum and specificationFilter, which then reduce the set of subordinate entries of the base entry. The subtree or subtree refinement contains all the entries within scope that are not excluded by any of the components of the subtree specification. When all of the components of SubtreeSpecification are absent (i.e., when a value of the Subtree Specification syntax is the empty sequence, {}), the specified subtree implicitly includes all the entries within scope.",
      "ja": "SubtreeSpecificationのコンポーネントは次のとおりです。次に、ベースエントリの下位のエントリのセットを減らすサブツリーまたはサブツリー改良のベースエントリを識別するベース、およびspecificExclusions、最小値、最大値及びspecificationFilter、。サブツリーまたはサブツリー改良は、サブツリー仕様のコンポーネントのいずれかによって除外されていない範囲内のすべてのエントリが含まれています。 SubtreeSpecificationの構成要素のすべてが存在しない場合（すなわち、サブツリー仕様構文の値が空のシーケンスである場合、{}）、指定されたサブツリーは、暗黙的範囲内でのすべてのエントリを含みます。"
    },
    {
      "indent": 3,
      "text": "Any particular use of this mechanism MAY impose limitations or constraints on the components of SubtreeSpecification.",
      "ja": "このメカニズムの任意の特定の使用はSubtreeSpecificationのコンポーネントに制限や制約を課すことができます。"
    },
    {
      "indent": 3,
      "text": "The LDAP syntax specification is:",
      "ja": "LDAP構文の仕様は次のとおりです。"
    },
    {
      "indent": 7,
      "text": "( 1.3.6.1.4.1.1466.115.121.1.45 DESC 'SubtreeSpecification' )",
      "ja": "（1.3.6.1.4.1.1466.115.121.1.45 DESC 'SubtreeSpecification'）"
    },
    {
      "indent": 3,
      "text": "The LDAP-specific encoding of values of this syntax is defined by the Generic String Encoding Rules [RFC3641]. Appendix A provides an equivalent Augmented Backus-Naur Form (ABNF) [RFC2234] for this syntax.",
      "ja": "この構文の値のLDAP固有の符号化は、一般的な文字列の符号化規則[RFC3641]で定義されます。付録Aは、この構文の等価た拡張バッカス - ナウアフォーム（ABNF）[RFC2234]を提供します。"
    },
    {
      "indent": 0,
      "text": "2.1.1. Base",
      "section_title": true,
      "ja": "2.1.1。ベース"
    },
    {
      "indent": 3,
      "text": "The base component of SubtreeSpecification nominates the base entry of the subtree or subtree refinement. The base entry may be an entry which is subordinate to the root entry of the scope in which the subtree specification is used, in which case the base component contains a sequence of Relative Distinguished Names (RDNs) relative to the root entry of the scope, or may be the root entry of the scope itself (the default), in which case the base component is absent or contains an empty sequence of RDNs.",
      "ja": "SubtreeSpecificationの基本コンポーネントは、サブツリーまたはサブツリー洗練のベースエントリを指名します。ベースエントリは、塩基成分はスコープのルートエントリに対して相対識別名（RDNの）の配列を含む場合、サブツリーの仕様が使用されるスコープのルートエントリに従属するエントリであってもよいです又は塩基成分が存在しないかのRDNの空のシーケンスを含む場合にはスコープ自体（デフォルト）のルート・エントリであってもよいです。"
    },
    {
      "indent": 3,
      "text": "Entries that are not subordinates of the base entry are excluded from the subtree or subtree refinement.",
      "ja": "ベースエントリの部下ではないエントリは、サブツリーまたはサブツリー洗練から除外されています。"
    },
    {
      "indent": 0,
      "text": "2.1.2. Specific Exclusions",
      "section_title": true,
      "ja": "2.1.2。特定の除外"
    },
    {
      "indent": 3,
      "text": "The specificExclusions component of a ChopSpecification is a list of exclusions that specify entries and their subordinates to be excluded from the subtree or subtree refinement. The entry is specified by a sequence of RDNs relative to the base entry (i.e., a LocalName). Each exclusion is of either the chopBefore or chopAfter form. If the chopBefore form is used then the specified entry and its subordinates are excluded from the subtree or subtree refinement. If the chopAfter form is used then only the subordinates of the specified entry are excluded from the subtree or subtree refinement.",
      "ja": "ChopSpecificationのspecificExclusionsコンポーネントは、サブツリーまたはサブツリーの微細化から除外されるエントリとその部下を指定除外の一覧です。エントリは、ベースエントリ（すなわちたLocalName）へのRDNの相対的な順序で指定されています。各除外はchopBeforeまたはchopAfter形態のいずれかです。 chopBeforeフォームが使用されている場合は、指定されたエントリとその部下は、サブツリーまたはサブツリーの微細化から除外されています。 chopAfterフォームが使用されている場合は、指定されたエントリの唯一の部下は、サブツリーまたはサブツリーの微細化から除外されています。"
    },
    {
      "indent": 0,
      "text": "2.1.3. Minimum and Maximum",
      "section_title": true,
      "ja": "2.1.3。最小値と最大値"
    },
    {
      "indent": 3,
      "text": "The minimum and maximum components of a ChopSpecification allow the exclusion of entries based on their depth in the DIT.",
      "ja": "ChopSpecificationの最小及び最大成分は、DITにおけるそれらの深さに基づいてエントリの除外を可能にします。"
    },
    {
      "indent": 3,
      "text": "Entries that are less than the minimum number of RDN arcs below the base entry are excluded from the subtree or subtree refinement. A minimum value of zero (the default) corresponds to the base entry.",
      "ja": "ベースエントリ下RDNアークの最小数未満であるエントリは、サブツリーまたはサブツリーリファインメントから除外されます。ゼロ（デフォルト）の最小値は、ベースエントリに対応します。"
    },
    {
      "indent": 3,
      "text": "Entries that are more than the maximum number of RDN arcs below the base entry are excluded from the subtree or subtree refinement. An absent maximum component indicates that there is no upper limit on the number of RDN arcs below the base entry for entries in the subtree or subtree refinement.",
      "ja": "ベースエントリ下RDNアークの最大数以上であるエントリは、サブツリーまたはサブツリーの微細化から除外されます。不在の最大成分は、サブツリーまたはサブツリー改良のエントリのベース・エントリー以下RDNアークの数に上限はないことを示しています。"
    },
    {
      "indent": 0,
      "text": "2.1.4. Specification Filter",
      "section_title": true,
      "ja": "2.1.4。仕様フィルター"
    },
    {
      "indent": 3,
      "text": "The specificationFilter component is a boolean expression of assertions about the values of the objectClass attribute of the base entry and its subordinates. A Refinement assertion item evaluates to true for an entry if that entry's objectClass attribute contains the OID nominated in the assertion. Entries for which the overall filter evaluates to false are excluded from the subtree refinement. If the specificationFilter is absent then no entries are excluded from the subtree or subtree refinement because of their objectClass attribute values.",
      "ja": "specificationFilter成分は、ベースエントリのobjectClass属性の値とその部下に関するアサーションのブール式です。そのエントリのobjectClass属性は、アサーションにノミネートOIDが含まれている場合、洗練アサーション項目は、エントリに対してtrueに評価されます。全体的なフィルタが偽と評価されるエントリは、サブツリーの微細化から除外されています。 specificationFilterが存在しない場合は、何のエントリがあるため、そのオブジェクトクラスのサブツリーまたはサブツリーの微細化から除外されていない属性値。"
    },
    {
      "indent": 0,
      "text": "2.2. Administrative Role Attribute Type",
      "section_title": true,
      "ja": "2.2。管理役割の属性タイプ"
    },
    {
      "indent": 3,
      "text": "The Administrative Model defined in [X.501], clause 10 requires that administrative entries contain an administrativeRole attribute to indicate that the associated administrative area is concerned with one or more administrative roles.",
      "ja": "[X.501]で定義された管理モデルは、節10は、管理項目が関連する管理領域は、1つまたは複数の管理役割に関係していることを示すためにadministrativeRole属性を含むことを必要とします。"
    },
    {
      "indent": 3,
      "text": "The administrativeRole operational attribute is specified as follows:",
      "ja": "次のようにadministrativeRoleオペレーショナル属性が指定されています。"
    },
    {
      "indent": 7,
      "text": "( 2.5.18.5 NAME 'administrativeRole'\n    EQUALITY objectIdentifierMatch\n    USAGE directoryOperation\n    SYNTAX 1.3.6.1.4.1.1466.115.121.1.38 )",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The possible values of this attribute defined in X.501 are:",
      "ja": "X.501で定義され、この属性の可能な値は次のとおりです。"
    },
    {
      "indent": 7,
      "text": " OID            NAME\n --------  -------------------------------\n2.5.23.1   autonomousArea\n2.5.23.2   accessControlSpecificArea\n2.5.23.3   accessControlInnerArea\n2.5.23.4   subschemaAdminSpecificArea\n2.5.23.5   collectiveAttributeSpecificArea\n2.5.23.6   collectiveAttributeInnerArea",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Other values may be defined in other specifications. Names associated with each administrative role are Object Identifier Descriptors [RFC3383].",
      "ja": "他の値は、他の仕様で定義されてもよいです。各管理者の役割に関連付けられた名前は、オブジェクト識別子記述子[RFC3383]です。"
    },
    {
      "indent": 3,
      "text": "The administrativeRole operational attribute is also used to regulate the subentries permitted to be subordinate to an administrative entry. A subentry not of a class permitted by the administrativeRole attribute cannot be subordinate to the administrative entry.",
      "ja": "administrativeRoleオペレーショナル属性は、管理者のエントリに従属することを許さサブエントリを調節するために使用されます。ないadministrativeRole属性によって許可されたクラスのサブエントリは、管理エントリに従属することはできません。"
    },
    {
      "indent": 0,
      "text": "2.3. Subtree Specification Attribute Type",
      "section_title": true,
      "ja": "2.3。サブツリー仕様属性タイプ"
    },
    {
      "indent": 3,
      "text": "The subtreeSpecification operational attribute is defined as follows:",
      "ja": "次のようにsubtreeSpecificationオペレーショナル属性が定義されています。"
    },
    {
      "indent": 7,
      "text": "( 2.5.18.6 NAME 'subtreeSpecification'\n    SINGLE-VALUE\n    USAGE directoryOperation\n    SYNTAX 1.3.6.1.4.1.1466.115.121.1.45 )",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "This attribute is present in all subentries. See [X.501], clause 10. Values of the subtreeSpecification attribute nominate collections of entries within the DIT for one or more aspects of administrative authority.",
      "ja": "この属性は、すべてのサブエントリに存在しています。 [X.501]を参照してください、subtreeSpecification属性の句10.値は、管理者権限の1つの以上の態様のためにDIT内のエントリのコレクションを指名します。"
    },
    {
      "indent": 0,
      "text": "2.4. Subentry Object Class",
      "section_title": true,
      "ja": "2.4。サブエントリのオブジェクトクラス"
    },
    {
      "indent": 3,
      "text": "The subentry object class is a structural object class.",
      "ja": "サブエントリのオブジェクトクラスは、構造化オブジェクトクラスです。"
    },
    {
      "indent": 7,
      "text": "( 2.5.17.0 NAME 'subentry'\n    SUP top STRUCTURAL\n    MUST ( cn $ subtreeSpecification ) )",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3. Subentries Control",
      "section_title": true,
      "ja": "3.サブエントリコントロール"
    },
    {
      "indent": 3,
      "text": "The subentries control MAY be sent with a searchRequest to control the visibility of entries and subentries which are within scope. Non-visible entries or subentries are not returned in response to the request.",
      "ja": "サブエントリ制御範囲内にあるエントリとサブエントリの可視性を制御するsearchRequestを用いて送信することができます。非可視エントリまたはサブエントリは、要求に応じて返されません。"
    },
    {
      "indent": 3,
      "text": "The subentries control is an LDAP Control whose controlType is 1.3.6.1.4.1.4203.1.10.1, criticality is TRUE or FALSE (hence absent), and controlValue contains a BER-encoded BOOLEAN indicating visibility. A controlValue containing the value TRUE indicates that subentries are visible and normal entries are not. A controlValue containing the value FALSE indicates that normal entries are visible and subentries are not.",
      "ja": "サブエントリの制御は、そのcontrolType 1.3.6.1.4.1.4203.1.10.1は、臨界TRUEまたはFALSE（したがって存在しない）であるLDAP制御であり、そしてcontrolValue視認性を示すBERエンコードBOOLEANを含有します。 TRUE値を含むcontrolValueは、サブエントリはエントリがない可視及び正常であることを示しています。値FALSEを含むcontrolValueは通常のエントリが表示され、サブエントリがないことを示しています。"
    },
    {
      "indent": 3,
      "text": "Note that TRUE visibility has the three octet encoding { 01 01 FF } and FALSE visibility has the three octet encoding { 01 01 00 }.",
      "ja": "そのTRUE可視三のオクテットエンコーディング{01 01 FF}とFALSE可視三オクテットエンコーディング{01 01 00}を有しているに注意してください。"
    },
    {
      "indent": 3,
      "text": "The controlValue SHALL NOT be absent.",
      "ja": "controlValueは存在してはなりません。"
    },
    {
      "indent": 3,
      "text": "In absence of this control, subentries are not visible to singleLevel and wholeSubtree scope Search requests but are visible to baseObject scope Search requests.",
      "ja": "このコントロールがない場合には、サブエントリはsingleLevelとwholeSubtree範囲検索要求には見えませんが、baseObjectの範囲検索要求に表示されます。"
    },
    {
      "indent": 3,
      "text": "There is no corresponding response control.",
      "ja": "該当する応答制御はありません。"
    },
    {
      "indent": 3,
      "text": "This control is not appropriate for non-Search operations.",
      "ja": "このコントロールは非検索操作のために適切ではありません。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Subentries often hold administrative information or other sensitive information and should be protected from unauthorized access and disclosure as described in [RFC2829][RFC2830].",
      "ja": "サブエントリは、多くの場合、管理情報又はその他の機密情報を保持し、[RFC2829]、[RFC2830]に記載されているように、不正なアクセスや開示から保護されるべきです。"
    },
    {
      "indent": 3,
      "text": "General LDAP [RFC3377] security considerations also apply.",
      "ja": "一般的なLDAP [RFC3377]のセキュリティの考慮事項も適用されます。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "5.1. Descriptors",
      "section_title": true,
      "ja": "5.1。記述子"
    },
    {
      "indent": 3,
      "text": "The IANA has registered the LDAP descriptors detailed in this technical specification. The following registration template is suggested:",
      "ja": "IANAは、この技術仕様書で詳述LDAP記述子を登録しています。以下の登録テンプレートが示唆されています。"
    },
    {
      "indent": 7,
      "text": "Subject: Request for LDAP Descriptor Registration\nDescriptor (short name): see comment\nObject Identifier: see comment\nPerson & email address to contact for further information:\n    Kurt Zeilenga <kurt@OpenLDAP.org>\nUsage: see comment\nSpecification: RFC3672\nAuthor/Change Controller: IESG\nComments:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "NAME                            Type OID\n------------------------        ---- --------\naccessControlInnerArea          R    2.5.23.3\naccessControlSpecificArea       R    2.5.23.2\nadministrativeRole              A    2.5.18.5\nautonomousArea                  R    2.5.23.1\ncollectiveAttributeInnerArea    R    2.5.23.6\ncollectiveAttributeSpecificArea R    2.5.23.5\nsubentry                        O    2.5.17.0\nsubschemaAdminSpecificArea      R    2.5.23.4\nsubtreeSpecification            A    2.5.18.6",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "where Type A is Attribute, Type O is ObjectClass, and Type R is Administrative Role.",
      "ja": "タイプAの属性である場合、タイプOオブジェクトクラスであり、タイプRは、管理役割です。"
    },
    {
      "indent": 0,
      "text": "5.2. Object Identifiers",
      "section_title": true,
      "ja": "5.2。オブジェクト識別子"
    },
    {
      "indent": 3,
      "text": "This document uses the OID 1.3.6.1.4.1.4203.1.10.1 to identify an LDAP protocol element defined herein. This OID was assigned [ASSIGN] by OpenLDAP Foundation, under its IANA-assigned private enterprise allocation [PRIVATE], for use in this specification.",
      "ja": "この文書は、本明細書で定義されたLDAPプロトコル要素を識別するためにOID 1.3.6.1.4.1.4203.1.10.1を使用します。このOIDは、この仕様で使用するために、そのIANAによって割り当てられた民間企業の割り当て[PRIVATE]の下で、OpenLDAPの財団[ASSIGN]を割り当てました。"
    },
    {
      "indent": 3,
      "text": "Other OIDs which appear in this document were either assigned by the ISO/IEC Joint Technical Committee 1 - Subcommittee 6 to identify elements of X.500 schema or assigned in RFC 2252 for the use described here.",
      "ja": "X.500スキーマの要素を識別するために、小委員会6又は本明細書に記載の使用のためにRFC 2252で割り当てられた - この文書に現れる他のOIDはいずれかのISO / IEC合同技術委員会1によって割り当てられました。"
    },
    {
      "indent": 0,
      "text": "5.3. Protocol Mechanisms",
      "section_title": true,
      "ja": "5.3。プロトコルメカニズム"
    },
    {
      "indent": 3,
      "text": "The IANA has registered the LDAP protocol mechanisms [RFC3383] detailed in this specification.",
      "ja": "IANAは、本明細書に詳述LDAPプロトコルメカニズム[RFC3383]を登録しています。"
    },
    {
      "indent": 3,
      "text": "Subject: Request for LDAP Protocol Mechanism Registration",
      "ja": "件名：LDAPプロトコルメカニズム登録要求"
    },
    {
      "indent": 3,
      "text": "Description: Subentries",
      "ja": "説明：サブエントリ"
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information: Kurt Zeilenga <kurt@openldap.org>",
      "ja": "人とEメールアドレスは、詳細のために連絡する：クルトZeilenga <kurt@openldap.org>"
    },
    {
      "indent": 3,
      "text": "Usage: Control",
      "ja": "使用方法：コントロール"
    },
    {
      "indent": 3,
      "text": "Specification: RFC3672",
      "ja": "仕様：RFC3672"
    },
    {
      "indent": 3,
      "text": "Author/Change Controller: IESG",
      "ja": "著者/変更コントローラ：IESG"
    },
    {
      "indent": 3,
      "text": "Comments: none",
      "ja": "コメント：なし"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgment",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "This document is based on engineering done by IETF LDUP and LDAPext Working Groups including \"LDAP Subentry Schema\" by Ed Reed. This document also borrows from a number of ITU documents including X.501.",
      "ja": "この文書は、エド・リードによる「LDAPサブエントリスキーマ」を含むIETF LDUPとLDAPEXTワーキンググループによって行わ工学に基づいています。また、このドキュメントでは、X.501を含むITU文書の数から借ります。"
    },
    {
      "indent": 0,
      "text": "7. Intellectual Property Statement",
      "section_title": true,
      "ja": "7.知的財産権に関する声明"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、そのような権限下で、ライセンスがたりないかもしれない可能性があるためにどの本書または程度に記載されている技術の実装や使用に関係すると主張される可能性があります任意の知的財産やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能。また、そうした権利を特定するために取り組んできたことを表していないん。スタンダードトラックおよび標準関連文書における権利に関するIETFの手続きの情報は、BCP-11に記載されています。権利の主張のコピーは、出版のために利用可能とライセンスの保証が利用できるようにする、または本仕様の実装者または利用者が、そのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、その注意にこの標準を実践するために必要な場合があり技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 IETF専務に情​​報を扱ってください。"
    },
    {
      "indent": 0,
      "text": "A. Subtree Specification ABNF",
      "ja": "A.サブツリー仕様ABNF"
    },
    {
      "indent": 3,
      "text": "This appendix is non-normative.",
      "ja": "この付録は非規範的です。"
    },
    {
      "indent": 3,
      "text": "The LDAP-specific string encoding for the Subtree Specification syntax is specified by the Generic String Encoding Rules [RFC3641]. The ABNF [RFC2234] in this appendix for this syntax is provided only as a convenience and is equivalent to the encoding specified by the application of [RFC3641]. Since the SubtreeSpecification ASN.1 type may be extended in future editions of [X.501], the provided ABNF should be regarded as a snapshot in time. The LDAP-specific encoding for any extension to the SubtreeSpecification ASN.1 type can be determined from [RFC3641].",
      "ja": "サブツリー仕様構文のLDAP固有の文字列の符号化は、一般的な文字列の符号化規則[RFC3641]で指定されています。この構文は、この付録のABNF [RFC2234]は単に便宜として提供され、[RFC3641]のアプリケーションによって指定されたエンコーディングに相当しています。 SubtreeSpecificationのASN.1タイプは[X.501]の将来版に拡張することができるので、提供されるABNFは、時間的にスナップショットとみなされるべきです。 SubtreeSpecificationのASN.1型への拡張のためのLDAP固有の符号化は[RFC3641]から決定することができます。"
    },
    {
      "indent": 3,
      "text": "In the event that there is a discrepancy between this ABNF and the encoding determined by [RFC3641], [RFC3641] is to be taken as definitive.",
      "ja": "このABNFと[RFC3641]によって決定エンコーディング間に相違がある場合には、[RFC3641]は決定的として解釈されるべきです。"
    },
    {
      "indent": 3,
      "text": "SubtreeSpecification = \"{\" [ sp ss-base ] [ sep sp ss-specificExclusions ] [ sep sp ss-minimum ] [ sep sp ss-maximum ] [ sep sp ss-specificationFilter ] sp \"}\"",
      "ja": "SubtreeSpecification = \"{\" [SP SS-基地] [9月SPのSS-specificExclusions] [9月SPのSS-最小] [9月SPのSS-最大] [9月のSP、SS-specificationFilter] SP \"}\""
    },
    {
      "indent": 3,
      "text": "ss-base = id-base msp LocalName ss-specificExclusions = id-specificExclusions msp SpecificExclusions ss-minimum = id-minimum msp BaseDistance ss-maximum = id-maximum msp BaseDistance ss-specificationFilter = id-specificationFilter msp Refinement",
      "ja": "SS-塩基= IDベースMSPたLocalName SS-specificExclusions = ID-specificExclusions MSPのSpecificExclusionsのSS-最小= ID-最小MSP BaseDistanceのSS-最大= ID-最大MSP BaseDistance SS-specificationFilter = ID-specificationFilterのMSPリファイン"
    },
    {
      "indent": 3,
      "text": "id-base = %x62.61.73.65 ; \"base\" id-specificExclusions = %x73.70.65.63.69.66.69.63.45.78.63.6C.75.73 %x69.6F.6E.73 ; \"specificExclusions\" id-minimum = %x6D.69.6E.69.6D.75.6D ; \"minimum\" id-maximum = %x6D.61.78.69.6D.75.6D ; \"maximum\" id-specificationFilter = %x73.70.65.63.69.66.69.63.61.74.69.6F.6E.46 %x69.6C.74.65.72 ; \"specificationFilter\"",
      "ja": "IDベース=％x62.61.73.65。 \"塩基\" ID-specificExclusions =％x73.70.65.63.69.66.69.63.45.78.63.6C.75.73％x69.6F.6E.73。 \"specificExclusions\" ID-最小=％x6D.69.6E.69.6D.75.6D。 \"最小\" ID-最大=％x6D.61.78.69.6D.75.6D。 \"最大\" ID-specificationFilter =％x73.70.65.63.69.66.69.63.61.74.69.6F.6E.46％x69.6C.74.65.72。 \"specificationFilter\""
    },
    {
      "indent": 3,
      "text": "SpecificExclusions = \"{\" [ sp SpecificExclusion *( \",\" sp SpecificExclusion ) ] sp \"}\" SpecificExclusion = chopBefore / chopAfter chopBefore = id-chopBefore \":\" LocalName chopAfter = id-chopAfter \":\" LocalName id-chopBefore = %x63.68.6F.70.42.65.66.6F.72.65 ; \"chopBefore\" id-chopAfter = %x63.68.6F.70.41.66.74.65.72 ; \"chopAfter\"",
      "ja": "SpecificExclusions = \"{\" [SPのSpecificExclusion×（ \"\" SPのSpecificExclusion）] SP \"}\" SpecificExclusion = chopBefore / chopAfter chopBefore = ID-chopBefore \"：\" たLocalName chopAfter = ID-chopAfter \"：\" たLocalNameのID-chopBefore =％X63 .68.6F.70.42.65.66.6F.72.65; \"chopBefore\" ID-chopAfter =％x63.68.6F.70.41.66.74.65.72。 \"chopAfter\""
    },
    {
      "indent": 3,
      "text": "Refinement = item / and / or / not item = id-item \":\" OBJECT-IDENTIFIER and = id-and \":\" Refinements or = id-or \":\" Refinements not = id-not \":\" Refinement Refinements = \"{\" [ sp Refinement *( \",\" sp Refinement ) ] sp \"}\" id-item = %x69.74.65.6D ; \"item\" id-and = %x61.6E.64 ; \"and\" id-or = %x6F.72 ; \"or\" id-not = %x6E.6F.74 ; \"not\"",
      "ja": "改良=項目/及び/または/ていないアイテムID =項目 \"：\" OBJECT識別子及び= ID-と \"：\" 絞り込みまたは= ID-または \"：\" 絞り込みない= ID-ない \"：\" 洗練絞り込み= \" { \"[SP洗練*（\"、」SP改良）] SP \"}\" ID-アイテム=％x69.74.65.6D。 \"項目\" ID-および=％x61.6E.64。 \"および\" ID-又は=％x6F.72。 \"または\" ID-ない=％x6E.6F.74。 「ありません」"
    },
    {
      "indent": 3,
      "text": "BaseDistance = INTEGER-0-MAX",
      "ja": "BaseDistance = INTEGER-0-MAX"
    },
    {
      "indent": 3,
      "text": "The <sp>, <msp>, <sep>, <INTEGER>, <INTEGER-0-MAX>, <OBJECT-IDENTIFIER> and <LocalName> rules are defined in [RFC3642].",
      "ja": "<SP>、<MSP>、<9月>、<INTEGER>、<整数0-MAX>、<OBJECT識別子>と<たLocalName>ルールは、[RFC3642]で定義されています。"
    },
    {
      "indent": 0,
      "text": "Normative References",
      "ja": "引用規格"
    },
    {
      "indent": 3,
      "text": "[X.501] ITU-T, \"The Directory -- Models,\" X.501, 1993.",
      "ja": "[X.501] ITU-T、 \"ディレクトリ - モデル、\" X.501、1993。"
    },
    {
      "indent": 3,
      "text": "[X.680] ITU-T, \"Abstract Syntax Notation One (ASN.1) - Specification of Basic Notation\", X.680, 1994.",
      "ja": "[X.680] ITU-T、 \"抽象構文記法1（ASN.1） - 基本的な表記の仕様\"、X.680、1994。"
    },
    {
      "indent": 3,
      "text": "[X.690] ITU-T, \"Specification of ASN.1 encoding rules: Basic, Canonical, and Distinguished Encoding Rules\", X.690, 1994.",
      "ja": "[X.690] ITU-T、 \"ASN.1符号化規則の仕様：基礎、正規、および識別符号化規則\"、X.690、1994。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2251] Wahl, M., Howes, T. and S. Kille, \"Lightweight Directory Access Protocol (v3)\", RFC 2251, December 1997.",
      "ja": "[RFC2251]ワール、M.、ハウズ、T.およびS. Kille、 \"軽量のディレクトリアクセスプロトコル（V3）\"、RFC 2251、1997年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2252] Wahl, M., Coulbeck, A., Howes, T. and S. Kille, \"Lightweight Directory Access Protocol (v3): Attribute Syntax Definitions\", RFC 2252, December 1997.",
      "ja": "[RFC2252]ワール、M.、Coulbeck、A.、ハウズ、T.およびS. Kille、 \"軽量のディレクトリアクセスプロトコル（V3）：属性の構文定義\"、RFC 2252、1997年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2829] Wahl, M., Alvestrand, H., Hodges, J. and R. Morgan, \"Authentication Methods for LDAP\", RFC 2829, May 2000.",
      "ja": "[RFC2829]ワール、M.、Alvestrand、H.、ホッジス、J.とR.モルガン、 \"LDAPのための認証方法\"、RFC 2829、2000年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC2830] Hodges, J., Morgan, R. and M. Wahl, \"Lightweight Directory Access Protocol (v3): Extension for Transport Layer Security\", RFC 2830, May 2000.",
      "ja": "[RFC2830]ホッジス、J.、モルガン、R.とM.ワール、 \"ライトウェイトディレクトリアクセスプロトコル（v3の）：トランスポート層セキュリティのための拡張\"、RFC 2830、2000年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC3377] Hodges, J. and R. Morgan, \"Lightweight Directory Access Protocol (v3): Technical Specification\", RFC 3377, September 2002.",
      "ja": "[RFC3377]ホッジス、J.とR.モルガン、 \"ライトウェイトディレクトリアクセスプロトコル（v3の）：技術仕様\"、RFC 3377、2002年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3383] Zeilenga, K., \"Internet Assigned Numbers Authority (IANA) Considerations for the Lightweight Directory Access Protocol (LDAP)\", RFC 3383, September 2002.",
      "ja": "[RFC3383] Zeilenga、K.、 \"IANA（Internet Assigned Numbers Authority）のライトウェイトディレクトリアクセスプロトコル（LDAP）に関する考慮事項\"、RFC 3383、2002年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3641] Legg, S., \"Generic String Encoding Rules (GSER) for ASN.1 Types\", RFC 3641, October 2003.",
      "ja": "[RFC3641]レッグ、S.​​、 \"ASN.1タイプのための一般的な文字列の符号化規則（GSER）\"、RFC 3641、2003年10月。"
    },
    {
      "indent": 0,
      "text": "Informative References",
      "ja": "参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2234] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 2234, November 1997.",
      "ja": "[RFC2234]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、RFC 2234、1997年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3642] Legg, S., \"Common Elements of Generic String Encoding Rules (GSER) Encodings\", RFC 3642, October 2003.",
      "ja": "[RFC3642]レッグ、S.​​、 \"一般的な文字列符号化規則の共通要素（GSER）エンコーディング\"、RFC 3642、2003年10月。"
    },
    {
      "indent": 3,
      "text": "[ASSIGN] OpenLDAP Foundation, \"OpenLDAP OID Delegations\", http://www.openldap.org/foundation/oid-delegate.txt",
      "ja": "[ASSIGN]のOpenLDAP財団、 \"OpenLDAPのOIDの代表団\"、http://www.openldap.org/foundation/oid-delegate.txt"
    },
    {
      "indent": 3,
      "text": "[PRIVATE] IANA, \"Private Enterprise Numbers\", http://www.iana.org/assignments/enterprise-numbers",
      "ja": "[PRIVATE] IANA、 \"民間企業番号\"、http://www.iana.org/assignments/enterprise-numbers"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Kurt D. Zeilenga OpenLDAP Foundation",
      "ja": "クルトD. ZeilengaのOpenLDAP財団"
    },
    {
      "indent": 3,
      "text": "EMail: Kurt@OpenLDAP.org",
      "ja": "メールアドレス：Kurt@OpenLDAP.org"
    },
    {
      "indent": 3,
      "text": "Steven Legg Adacel Technologies Ltd. 250 Bay Street Brighton, Victoria 3186 AUSTRALIA",
      "ja": "スティーブン・レッグ・Adacelテクノロジーズ株式会社250ベイストリートブライトン、ビクトリア3186オーストラリア"
    },
    {
      "indent": 3,
      "text": "Phone: +61 3 8530 7710 Fax: +61 3 8530 7888 EMail: steven.legg@adacel.com.au",
      "ja": "電話：+61 3 8530 7710ファックス：+61 3 8530 7888 Eメール：steven.legg@adacel.com.au"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の制限は永続的なものであり、インターネットソサエティもしくはその継承者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}