{
  "title": {
    "text": "RFC 3101 - The OSPF Not-So-Stubby Area (NSSA) Option",
    "ja": "RFC 3101 - OSPFない準スタブエリア（NSSA）オプション"
  },
  "number": 3101,
  "created_at": "2019-10-23 16:47:10.075016+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          P. Murphy\nRequest for Comments: 3101                          US Geological Survey\nObsoletes: 1587                                             January 2003\nCategory: Standards Track",
      "raw": true
    },
    {
      "indent": 15,
      "text": "The OSPF Not-So-Stubby Area (NSSA) Option",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo documents an optional type of Open Shortest Path First (OSPF) area that is somewhat humorously referred to as a \"not-so-stubby\" area (or NSSA). NSSAs are similar to the existing OSPF stub area configuration option but have the additional capability of importing AS external routes in a limited fashion.",
      "ja": "このメモは多少ユーモラス「それほどスタブ」領域（またはNSSA）と呼ばれるオープンショーテストパスファースト（OSPF）領域の任意のタイプを文書化。あるNSSAは、既存のOSPFスタブエリアの設定オプションに似ていますが、限られた方法でAS外部ルートをインポートの追加機能を持っています。"
    },
    {
      "indent": 3,
      "text": "The OSPF NSSA Option was originally defined in RFC 1587. The functional differences between this memo and RFC 1587 are explained in Appendix F. All differences, while expanding capability, are backward-compatible in nature. Implementations of this memo and of RFC 1587 will interoperate.",
      "ja": "OSPF NSSAオプションは、本来の能力を拡大しながら、このメモとRFC 1587の機能的な違いは、付録Fにすべての違いを説明しているRFC 1587で定義された、自然の中で下位互換性があります。このメモのとRFC 1587の実装は、相互運用します。"
    },
    {
      "indent": 0,
      "text": "Table Of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.0 Overview .................................................  2\n   1.1 Motivation - Transit Networks .........................  2\n   1.2 Motivation - Corporate Networks .......................  4\n   1.3 Proposed Solution .....................................  5\n2.0 NSSA Intra-Area Implementation Details ...................  7\n   2.1 The N-bit .............................................  7\n   2.2 Type-7 Address Ranges .................................  7\n   2.3 Type-7 LSAs ...........................................  8\n   2.4 Originating Type-7 LSAs ...............................  9\n   2.5 Calculating Type-7 AS External Routes ................. 10\n   2.6 Incremental Updates ................................... 14\n   2.7 Optionally Importing Summary Routes ................... 14\n3.0 Intra-AS Implementation Details .......................... 15\n   3.1 Type-7 Translator Election ............................ 15\n   3.2 Translating Type-7 LSAs into Type-5 LSAs .............. 16\n   3.3 Flushing Translated Type-7 LSAs ....................... 19\n4.0 Security Considerations .................................. 20\n5.0 Acknowledgements ......................................... 21\n6.0 Contributors ............................................. 22\n7.0 References ............................................... 22\nAppendix A: The Options Field ................................ 23\nAppendix B: Router-LSAs ...................................... 24\nAppendix C: Type-7 LSA Packet Format ......................... 26\nAppendix D: Configuration Parameters ......................... 27\nAppendix E: The P-bit Policy Paradox ......................... 28\nAppendix F: Differences from RFC 1587 ........................ 30\nAuthor's Addresses ........................................... 32\nFull Copyright Statement ..................................... 33",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1.0 Overview",
      "section_title": true,
      "ja": "1.0の概要"
    },
    {
      "indent": 0,
      "text": "1.1 Motivation - Transit Networks",
      "section_title": true,
      "ja": "1.1動機 - トランジットネットワーク"
    },
    {
      "indent": 3,
      "text": "Wide-area transit networks often have connections to moderately complex \"leaf\" sites. A leaf site may have multiple IP network numbers assigned to it. Typically, one of the leaf site's networks is directly connected to a router provided and administered by the transit network while the others are distributed throughout and administered by the site. From the transit network's perspective, all of the network numbers associated with the site make up a single \"stub\" entity. For example, BBN Planet has one site composed of a class-B network, 130.57.0.0, and a class-C network, 192.31.114.0. From BBN Planet's perspective, this configuration looks something like the diagram on the next page, where the \"cloud\" consists of the subnets of 130.57 and network 192.31.114, all of which are learned by RIP on router BR18.",
      "ja": "広域の中継ネットワークは、多くの場合、適度に複雑な「リーフ」のサイトへの接続を持っています。葉のサイトでは、それに割り当てられた複数のIPネットワーク番号を持つことができます。典型的には、リーフサイトのネットワークの一つは、他の人が全体に分散し、部位によって投与されている間トランジットネットワークによって提供され、投与ルータに直接接続されています。トランジットネットワークの観点から、サイトに関連付けられたネットワーク番号の全ては、単一の「スタブ」の実体を構成しています。例えば、BBNプラネットは、一クラスBネットワーク130.57.0.0からなる部位、およびクラスCのネットワーク、192.31.114.0を有しています。 BBNプラネットの観点から、この構成は、「クラウド」は、ルータのBR18にRIPによって学習されているすべてのそれらの130.57とネットワーク192.31.114のサブネットで構成され、次ページの図のようになります。"
    },
    {
      "indent": 16,
      "text": "  192.31.114\n      |\n    (cloud)\n-------------- 130.57.4\n      |\n      |\n   ------ 131.119.13 ------\n   |BR18|------------|BR10|\n   ------            ------\n                        |\n                        V\n                to BBN Planet \"core\" OSPF system",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Topologically, this cloud looks very much like an OSPF stub area. The advantages of running the cloud as an OSPF stub area are:",
      "ja": "位相幾何学的に、この雲は非常に多くのOSPFスタブエリアのように見えます。 OSPFスタブエリアとしてクラウドを実行する利点は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "1. External routes learned from OSPF's Type-5 AS-external-LSAs are not advertised beyond the router labeled \"BR10\". This is advantageous because the link between BR10 and BR18 may be a low-speed link or the router BR18 may have limited resources.",
      "ja": "OSPFのType-5から学ん1.外部ルートはASの外部のLSAは、「BR10」と表示されたルータを超えてアドバタイズされません。 BR10とBR18との間のリンクが低速リンクであってもよいし、ルータBR18は、限られたリソースを有することができるので、これは有利です。"
    },
    {
      "indent": 6,
      "text": "2. The transit network is abstracted to the \"leaf\" router BR18 by advertising only a default route across the link between BR10 and BR18.",
      "ja": "2.トランジットネットワークは、広告で「リーフ」のルータBR18にBR10とBR18間のリンクを介してのみデフォルトルートを抽象化されています。"
    },
    {
      "indent": 6,
      "text": "3. The cloud becomes a single, manageable \"leaf\" with respect to the transit network.",
      "ja": "3.クラウドは、トランジットネットワークに関しては、単一の、管理しやすい「葉」になります。"
    },
    {
      "indent": 6,
      "text": "4. The cloud can become, logically, a part of the transit network's OSPF routing system.",
      "ja": "4.雲は、論理的に、トランジットネットワークのOSPFルーティングシステムの一部となることができます。"
    },
    {
      "indent": 3,
      "text": "However, the original definition of the OSPF protocol (See [OSPF]) imposes topological limitations that restrict simple cloud topologies from becoming OSPF stub areas. In particular, it is illegal for a stub area to import routes external to OSPF; thus it is not possible for routers BR18 and BR10 to both be members of the stub area and to import into OSPF as Type-5 AS-external-LSAs routes learned from RIP or other IP routing protocols. In order to run OSPF out to BR18, BR18 must be a member of a non-stub area or the OSPF backbone before it can import routes other than its directly connected network(s). Since it is not acceptable for BR18 to maintain all of BBN Planet's Type-5 AS external routes, BBN Planet is forced by OSPF's topological limitations to only run OSPF out to BR10 and to run RIP between BR18 and BR10.",
      "ja": "しかし、OSPFプロトコルの元の定義は、（[OSPF]参照）OSPFスタブ領域になるから、単純なクラウド・トポロジーを制限トポロジー制限を課します。特に、OSPF外部ルートをインポートするスタブ領域の違法です。したがって、スタブ領域の両方であるメンバーにルータBR18とBR10のために可能ではなく、ルートがRIPまたは他のIPルーティングプロトコルから学習したAS-外部のLSAタイプ5としてOSPFにインポートします。 BR18のうちOSPFを実行するために、BR18は、非スタブ領域か、その直接接続されたネットワーク（単数または複数）以外の経路をインポートする前に、OSPFバックボーンのメンバーでなければなりません。 BR18はBBNプラネットのType-5外部ルートASのすべてを維持することは受け入れられないので、BBNプラネットだけBR10への外にOSPFを実行して、BR18とBR10の間でRIPを実行するためにOSPFのトポロジカル制限によって強制されます。"
    },
    {
      "indent": 0,
      "text": "1.2 Motivation - Corporate Networks",
      "section_title": true,
      "ja": "1.2モチベーション - 企業ネットワーク"
    },
    {
      "indent": 3,
      "text": "In a corporate network that supports a large corporate infrastructure it is not uncommon for its OSPF domain to have a complex non-zero area infrastructure that injects large routing tables into its Area 0 backbone. Organizations within the corporate infrastructure may routinely multi-home their non-zero OSPF areas to strategically located Area 0 backbone routers, either to provide backbone redundancy or to increase backbone connectivity or both. Because of these large routing tables, OSPF aggregation via summarization is routinely used and recommended. Stub areas are also recommended to keep the size of the routing tables of non-backbone routers small. Organizations within the corporation are administratively autonomous and compete for corporate backbone resources. They also want isolation from each other in order to protect their own network resources within the organization.",
      "ja": "そのOSPFドメインはそのエリア0バックボーンに大きなルーティングテーブルを注入し、複雑な非ゼロの領域インフラストラクチャを持っている大企業のインフラストラクチャをサポートし、企業ネットワークでは、それは珍しいことではありません。企業インフラストラクチャ内の組織では、日常のマルチホームその非ゼロのOSPFエリアは戦略的に、エリア0バックボーンルータを設置することのいずれかのバックボーンの冗長性を提供するか、バックボーン接続、またはその両方を向上させます。なぜなら、これらの大規模なルーティングテーブルで、集計を介してOSPF凝集が日常的に使用され、推奨されています。スタブエリアは、小さな非バックボーンルーターのルーティングテーブルのサイズを維持することが推奨されています。企業内の組織は、管理自律的であり、企業の基幹リソースの競合します。彼らはまた、組織内で独自のネットワークリソースを保護するために、互いから分離したいです。"
    },
    {
      "indent": 3,
      "text": "Consider the typical example configuration shown below where routers A1, B1 and A2, B2 are connected to Area 1 and Area 2 respectively, and where routers A0 and B0 are Area 0 border routers that connect to both Area 1 and Area 2. Assume the 192.168.192/20 and 192.168.208/22 clouds are subnetted with a protocol different from the corporate OSPF instance. These other protocols could be RIP, IGRP, or second and third OSPF instances separate from the corporate OSPF backbone instance.",
      "ja": "ルータA1は、B1およびA2、B2は、それぞれエリア1とエリア2に接続され、そしてここで、ルータA0及びB0は、エリア1とエリア2の両方に接続エリア0ボーダルータでは192.168と仮定する場合、以下に示す一般的な構成例を考えます0.192 / 20および192.168.208 / 22雲は、企業OSPFインスタンスから別のプロトコルとサブネットれます。これらの他のプロトコルは、OSPFインスタンスが企業OSPFバックボーンインスタンスから分離RIP、IGRP、又は第二及び第三のかもしれません。"
    },
    {
      "indent": 3,
      "text": "Area 1 and Area 2 would like to be stub areas to minimize the size of their link state databases. It is also desirable to originate two aggregated external advertisements for the subnets of 192.168.192/20 and 192.168.208/22 in such a way that the preferred path to 192.168.192/20 is through A0 and the preferred path to 192.168.208/22 is through B0.",
      "ja": "エリア1とエリア2には、そのリンク状態データベースのサイズを最小限に抑えるためのエリアをスタブするしたいと思います。 192.168.192 / 20への優先パスをA0と192.168.208への優先パスを介して行われるように192.168.192 / 20および192.168.208 / 22のサブネットのための2つの集約された外部の広告を発信することが望ましいです/ 22 B0を介して行われます。"
    },
    {
      "indent": 13,
      "text": "     +---A0------Area 0 cloud------B0---+\n     |   |                          |   |\n     |   |                          |   |\n     |   |T1                   56kbs|   |\n56kbs|   |                          |   |T1\n     |   |                          |   |\n     |   |       Area 1 cloud       |   |\n     |   A1-----192.168.192/20-----B1   |\n     |                                  |\n     +---A2                        B2---+\n          |                         |\n          |      Area 2 cloud       |\n          +-----192.168.208/22------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The current standard OSPF stub area has no mechanism to support the redistribution of routes for the subnets of 192.168.192/20 and 192.168.208/22 within a stub area or the ability to aggregate a range of external routes in any OSPF area. Any solution to this dilemma must also honor Area 1's path of choice to 192.168.192/20 through A0 with redundancy through B0 while at the same time honoring Area 2's path of choice to 192.168.208/20 through B0 with redundancy through A0.",
      "ja": "現在の標準的なOSPFスタブ領域は、スタブ領域または任意のOSPFエリアに外部ルートの範囲を集約する能力内192.168.192 / 20および192.168.208 / 22のサブネットのルートの再配布をサポートするための機構がありません。同時にA0による冗長性を備えたB0を通じて192.168.208 / 20に選択したエリア2のパスを尊重しながら、このジレンマに対する任意の解決策は、B0て冗長性を備えたA0を通じて192.168.192 / 20に選択したエリア1のパスを尊重しなければなりません。"
    },
    {
      "indent": 0,
      "text": "1.3 Proposed Solution",
      "section_title": true,
      "ja": "1.3提案されたソリューション"
    },
    {
      "indent": 3,
      "text": "This document describes a new optional type of OSPF area, somewhat humorously referred to as a \"not-so-stubby\" area (or NSSA), which has the capability of importing external routes in a limited fashion.",
      "ja": "この文書では、限られた方法で外部ルートをインポートする能力を有する幾分ユーモラス「それほどスタブ」領域（またはNSSA）と呼ばれるOSPFエリアの新しいオプションタイプを、記載されています。"
    },
    {
      "indent": 3,
      "text": "The OSPF specification defines two general classes of area configuration. The first allows Type-5 LSAs to be flooded throughout the area. In this configuration, Type-5 LSAs may be originated by routers internal to the area or flooded into the area by area border routers. These areas, referred to herein as Type-5 capable areas (or just plain areas in the OSPF specification), are distinguished by the fact that they can carry transit traffic. The backbone is always a Type-5 capable area. The second type of area configuration, called stub, does not allow Type-5 LSAs to be propagated into/throughout the area and instead depends on default routing to external destinations.",
      "ja": "OSPF仕様は、領域構成の二つの一般的なクラスを定義します。最初は、タイプ5のLSAは、エリア全体にフラッディングされることを可能にします。この構成では、タイプ5 LSAは領域の内部または境界ルータによってエリアにフラッディングルータによって発信されても​​よいです。これらの領域は、タイプ5可能な領域（又はOSPF仕様の単なる領域）と呼ぶ、それらがトランジットトラフィックを運ぶことができるという事実によって区別されます。バックボーンは、常にタイプ-5対応エリアです。エリア構成、と呼ばれるスタブの第二のタイプは、タイプ5のLSAは、エリア全体/に伝播することが可能となり、代わりに外部の宛先へのデフォルトルーティングに依存しません。"
    },
    {
      "indent": 3,
      "text": "NSSAs are defined in much the same manner as existing stub areas. To support NSSAs, a new option bit (the \"N\" bit) and a new type of LSA (Type-7) are defined. The \"N\" bit ensures that routers belonging to an NSSA agree on its configuration. Similar to the stub area's use of the \"E\" bit, both NSSA neighbors must agree on the setting of the \"N\" bit or the OSPF neighbor adjacency will not form.",
      "ja": "あるNSSAは、既存のスタブエリアとほぼ同じ方法で定義されています。あるNSSAをサポートするために、新しいオプションのビット（「N」ビット）およびLSAの新しいタイプ（タイプ7）が定義されています。 「N」ビットは、NSSAに属するルータがその構成に同意することを保証します。 「E」ビットのスタブエリアの使用と同様に、両方のNSSAの隣人は「N」ビットまたはOSPFネイバー隣接関係の設定を形成しないだろうに同意しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Type-7 LSAs provide for carrying external route information within an NSSA. Type-7 LSAs have virtually the same syntax as Type-5 LSAs with the obvious exception of the link-state type. (See section 2.3 for more details.) Both LSAs are considered a type of OSPF AS-external-LSA. There are two major semantic differences between Type-5 LSAs and Type-7 LSAs.",
      "ja": "タイプ7 LSAはNSSA内の外部ルート情報を搬送することを提供します。タイプ7 LSAはリンクステート型の明白な例外を除いて、タイプ5のLSAとほぼ同じ構文を持っています。 （詳細はセクション2.3を参照。）両方のLSAがOSPF ASの外部のLSAのタイプであると考えられます。タイプ5のLSAおよびタイプ7 LSA間の二つの主要な意味の違いがあります。"
    },
    {
      "indent": 6,
      "text": "o Type-7 LSAs may be originated by and advertised throughout an NSSA; as with stub areas, Type-5 LSAs are not flooded into NSSAs and do not originate there.",
      "ja": "O型-7 LSAはによって発信され、NSSA全体にアドバタイズされてもよいです。スタブエリアと同様に、タイプ5 LSAはあるNSSAに殺到されていませんし、そこに発生しません。"
    },
    {
      "indent": 6,
      "text": "o Type-7 LSAs are advertised only within a single NSSA; they are not flooded into the backbone area or any other area by border routers, though the information that they contain may be propagated into the backbone area. (See Section 3.2.)",
      "ja": "O型-7 LSAは、単一NSSA内でアドバタイズされます。それらに含まれる情報は、バックボーンエリアに伝播することができるものの、それらは、境界ルータによってバックボーンエリアまたは任意の他のエリアにフラッディングされていません。 （3.2節を参照してください。）"
    },
    {
      "indent": 3,
      "text": "In order to allow limited exchange of external information across an NSSA border, NSSA border routers will translate selected Type-7 LSAs received from the NSSA into Type-5 LSAs. These Type-5 LSAs will be flooded to all Type-5 capable areas. NSSA border routers may be configured with address ranges so that multiple Type-7 LSAs may be aggregated into a single Type-5 LSA. The NSSA border routers that perform translation are configurable. In the absence of a configured translator one is elected.",
      "ja": "NSSA境界に接続された外部情報の限られた交換を可能にするために、NSSA境界ルータはタイプ5のLSAにNSSAから受信した選択されたタイプ7 LSAを変換します。これらのタイプ5 LSAは、すべてのタイプ-5対応のエリアにフラッディングされます。複数タイプ7のLSAは、単一タイプ5 LSAに集約することができるようにNSSA境界ルータは、アドレス範囲で設定することができます。翻訳を行うNSSA境界ルータは設定可能です。構成された翻訳者1が存在しない状態で選出されます。"
    },
    {
      "indent": 3,
      "text": "In addition, an NSSA border router should originate a default LSA (IP network is 0.0.0.0/0) into the NSSA. Default routes are necessary because NSSAs do not receive full routing information and must have a default route in order to route to AS-external destinations. Like stub areas, NSSAs may be connected to the Area 0 backbone at more than one NSSA border router, but may not be used as a transit area. Note that a Type-7 default LSA originated by an NSSA border router is never translated into a Type-5 LSA, however, a Type-7 default LSA originated by an NSSA internal AS boundary router (one that is not an NSSA border router) may be translated into a Type-5 LSA.",
      "ja": "また、NSSA境界ルータはNSSAに（IPネットワークが0.0.0.0/0である）デフォルトのLSAを発信する必要があります。デフォルトルートがあるNSSAは完全なルーティング情報を受信して​​いないので必要であり、AS外部の目的地への経路に順にデフォルトルートを持っている必要があります。スタブエリアと同様に、あるNSSAは、複数のNSSA境界ルータでエリア0バックボーンに接続することができるが、トランジットエリアとして使用することはできません。 NSSA境界ルータによって発信タイプ7デフォルトLSAをNSSA内部AS境界ルータによって発信タイプ5 LSAは、しかし、タイプ7のデフォルトLSA（NSSA境界ルータではありません1）に翻訳されないことに注意してくださいタイプ5 LSAに変換することができます。"
    },
    {
      "indent": 3,
      "text": "Like stub areas, NSSA border routers optionally import summary routes into their NSSAs as Type-3 summary-LSAs. If the import is disabled, particular care should be taken to ensure that summary routing is not obscured by an NSSA's Type-7 AS-external-LSAs. This may happen when the AS's other IGPs, like RIP and ISIS, leak routing information into the NSSA. In these cases all summary routes should be imported into the NSSA. The recommended default behavior is to import summary routes into NSSAs. Since Type-5 AS-external-LSAs are not flooded into NSSAs, NSSA border routers should not originate Type-4 summary-LSAs into their NSSAs. Also an NSSA's border routers never originate Type-4 summary-LSAs for the NSSA's AS boundary routers, since Type-7 AS-external-LSAs are never flooded beyond the NSSA's border.",
      "ja": "スタブ領域のような、NSSA境界ルータタイプ3要約LSAとしてのそれらあるNSSAに任意にインポートサマリールート。インポートが無効になっている場合は、特に注意がそのサマリルーティングがASの外部のLSAをNSSAのタイプ7によって覆い隠されていないように注意しなければなりません。 ASの他のIGPは、RIPおよびISISのように、NSSAにルーティング情報を漏洩したときにこれが発生する可能性があります。これらのケースでは、すべての集約ルートはNSSAにインポートする必要があります。推奨されるデフォルトの動作ではあるNSSAにサマリールートをインポートすることです。タイプ5 AS-外部のLSAがあるNSSAに浸水していないので、NSSA境界ルータは、そのあるNSSAにタイプ4要約LSAを発信べきではありません。タイプ7 AS-外部のLSAをNSSAの境界線を越えて浸水されることはありませんので、またNSSAのボーダールータは、NSSAのAS境界ルータのタイプ4要約LSAを発信することはありません。"
    },
    {
      "indent": 3,
      "text": "When summary routes are not imported into an NSSA, the default LSA originated into it by its border routers must be a Type-3 summary-LSA. This default summary-LSA insures intra-AS connectivity to the rest of the OSPF domain, as its default summary route is preferred over the default route of a Type-7 default LSA. Without a default summary route the OSPF domain's inter-area traffic, which is normally forwarded by summary routes, might exit the AS via the default route of a Type-7 default LSA originated by an NSSA internal router. The Type-7 default LSAs originated by NSSA internal routers and the no-summary option are mutually exclusive features. When summary routes are imported into the NSSA, the default LSA originated by a NSSA border router into the NSSA should be a Type-7 LSA.",
      "ja": "サマリールートはNSSAにインポートされていない場合は、LSAは、その境界ルータによってそれに由来するデフォルトでは、タイプ3要約LSAでなければなりません。そのデフォルトサマリールートがタイプ7デフォルトLSAのデフォルトルートよりも優先されるように、このデフォルトの要約LSAは、OSPFドメインの残りの部分に、イントラASの接続性を保証します。通常、サマリールートによって転送されるOSPFドメインのエリア間のトラフィックは、デフォルトのサマリールートがなければ、NSSA内部ルータによって発信タイプ7デフォルトLSAのデフォルトルートを経由してASを終了する場合があります。 NSSA内部ルータと無summaryオプションによって発信タイプ7デフォルトのLSAは、相互に排他的な機能です。サマリールートはNSSAにインポートされると、LSAはNSSAにNSSA境界ルータによって発信デフォルトはタイプ7 LSAでなければなりません。"
    },
    {
      "indent": 3,
      "text": "In our transit topology example the subnets of 130.57 and network 192.31.114 will still be learned by RIP on router BR18, but now both",
      "ja": "私たちのトランジットトポロジーの例では130.57とネットワーク192.31.114のサブネットは今も、両方のルータBR18にRIPによって学習されますが、"
    },
    {
      "indent": 3,
      "text": "BR10 and BR18 can be in an NSSA and all of BBN Planet's external routes are hidden from BR18; BR10 becomes an NSSA border router and BR18 becomes an AS boundary router internal to the NSSA. BR18 will import the subnets of 130.57 and network 192.31.114 as Type-7 LSAs into the NSSA. BR10 then translates these routes into Type-5 LSAs and floods them into BBN Planet's backbone.",
      "ja": "BR10とBR18はNSSAにすることができ、BBNプラネットの外部ルートの全てはBR18から隠されています。 BR10は、NSSA境界ルータになり、BR18は、NSSAの内部AS境界ルータになります。 BR18はNSSAにタイプ7のLSAとして130.57のサブネットとネットワーク192.31.114をインポートします。 BR10は、タイプ5のLSAにこれらのルートを変換し、BBNプラネットのバックボーンにそれらをフラッディングします。"
    },
    {
      "indent": 3,
      "text": "In our corporate topology example if Area 1 and Area 2 are NSSAs the external paths to the subnets of the address ranges 192.168.192/20 and 192.168.208/22 can be redistributed as Type-7 LSAs throughout Area 1 and Area 2 respectively, and then aggregated during the translation process into separate Type-5 LSAs that are flooded into Area 0. A0 may be configured as Area 1's translator even though B0 is the translator of Area 2.",
      "ja": "コーポレート・トポロジ例ではエリア1とエリア2は、アドレスのサブネットにあるNSSA外部パスが192.168.192 / 20および192.168.208 / 22は、それぞれエリア1とエリア2全体タイプ7のLSAとして再配布することができる範囲であれば、そしてその後、エリア0 A0にフラッディングされる別個のタイプ5のLSAに翻訳プロセスの間に凝集がB0は、エリア2の翻訳であってもエリア1のトランスレータとして構成されてもよいです。"
    },
    {
      "indent": 0,
      "text": "2.0 NSSA Intra-Area Implementation Details",
      "section_title": true,
      "ja": "2.0 NSSAエリア内の実装の詳細"
    },
    {
      "indent": 0,
      "text": "2.1 The N-bit",
      "section_title": true,
      "ja": "2.1 Nビット"
    },
    {
      "indent": 3,
      "text": "The N-bit ensures that all members of an NSSA agree on the area's configuration. Together, the N-bit and E-bit reflect an interface's (and consequently the interface's associated area) external LSA flooding capability. As explained in [OSPF] Section 10.5, if Type-5 LSAs are not flooded into/throughout the area, the E-bit must be clear in the option field of the received Hello packets. Interfaces associated with an NSSA will not send or receive Type-5 LSAs on that interface but may send and receive Type-7 LSAs. Therefore, if the N-bit is set in the options field, the E-bit must be clear.",
      "ja": "Nビットは、NSSAのすべてのメンバーが地域の設定に同意することを保証します。一緒になって、NビットおよびEビットは、インターフェイスの（ひいてはインタフェースの関連領域）外部LSAフラッディング能力を反映しています。 [OSPF]のセクション10.5で説明したように、タイプ5のLSAがエリア全体にわたって/にフラッディングされていない場合、Eビットは、ハロー受信パケットのオプションフィールドに明確でなければなりません。 NSSAに関連付けられたインターフェイスは、送信又はそのインターフェイス上でタイプ5 LSAを受信するが、タイプ7 LSAを送信および受信することができるではないであろう。 Nビットは、オプションフィールドに設定されている場合ので、E-ビットが明確でなければなりません。"
    },
    {
      "indent": 3,
      "text": "To support the NSSA option an additional check must be made in the function that handles the receiving of the Hello packet to verify that both the N-bit and the E-bit found in the Hello packet's option field match the area type and ExternalRoutingCapability of the area of the receiving interface. A mismatch in the options causes processing of the received Hello packet to stop and the packet to be dropped.",
      "ja": "追加のチェックはのエリアタイプとExternalRoutingCapabilityに一致するHelloパケットのオプションフィールドに見られるNビットの両方およびEビットを確認するために、Helloパケットの受信を処理する関数で行う必要がありますNSSAオプションをサポートするために、受信インターフェイスのエリア。オプションの不一致こんにちは、受信したパケットの処理を停止させると、パケットがドロップされます。"
    },
    {
      "indent": 0,
      "text": "2.2 Type-7 Address Ranges",
      "section_title": true,
      "ja": "2.2型-7アドレス範囲"
    },
    {
      "indent": 3,
      "text": "NSSA border routers may be configured with Type-7 address ranges. Each Type-7 address range is defined as an [address,mask] pair. Many separate Type-7 networks may fall into a single Type-7 address range, just as a subnetted network is composed of many separate subnets. NSSA border routers may aggregate Type-7 routes by advertising a single Type-5 LSA for each Type-7 address range. The Type-5 LSA resulting from a Type-7 address range match will be distributed to all Type-5 capable areas. Section 3.2 details how Type-5 LSAs are generated from Type-7 address ranges.",
      "ja": "NSSA境界ルータは、タイプ7のアドレス範囲を使用して構成されてもよいです。各タイプ7のアドレス範囲は、[アドレス、マスク]対として定義されます。多くの別個のタイプ7のネットワークはサブネットネットワークは、多くの別々のサブネットで構成されているだけのように、単一タイプ7のアドレス範囲に分類してもよいです。 NSSA境界ルータは、各タイプ7のアドレス範囲のための単一のタイプ5 LSAを広告することによって、タイプ7のルートを集約することができます。タイプ7のアドレス範囲の一致に起因するタイプ5 LSAは、すべてのタイプ5可能な領域に分配されます。タイプ5のLSAがタイプ7アドレス範囲からどのように生成されるか、セクション3.2の詳細。"
    },
    {
      "indent": 3,
      "text": "A Type-7 address range includes the following configurable items.",
      "ja": "タイプ7のアドレス範囲は、以下の設定項目を含みます。"
    },
    {
      "indent": 6,
      "text": "o An [address,mask] pair.",
      "ja": "[アドレス、マスク]対O。"
    },
    {
      "indent": 6,
      "text": "o A status indication of either Advertise or DoNotAdvertise.",
      "ja": "Oのいずれかの状態表示は、広告やDoNotAdvertise。"
    },
    {
      "indent": 6,
      "text": "o An external route tag.",
      "ja": "外部ルートタグO。"
    },
    {
      "indent": 0,
      "text": "2.3 Type-7 LSAs",
      "section_title": true,
      "ja": "2.3タイプ7のLSA"
    },
    {
      "indent": 3,
      "text": "External routes are imported into NSSAs as Type-7 LSAs by NSSA AS boundary routers. An NSSA AS boundary router (ASBR) is a router that has an interface associated with the NSSA and is exchanging routing information with routers belonging to another AS. Like OSPF ASBRs, an NSSA router indicates it is an NSSA ASBR by setting the E-bit in its router-LSA. As with Type-5 LSAs a separate Type-7 LSA is originated for each destination network. To support NSSAs the link-state database must therefore be expanded to contain Type-7 LSAs.",
      "ja": "外部ルートは、境界ルータとしてNSSAでタイプ7のLSAとしてあるNSSAにインポートされます。 NSSA AS境界ルータ（ASBR）はNSSAに関連付けられたインターフェイスを有し、別のASに属するルータとルーティング情報を交換しているルータです。 OSPFのASBRと同様、NSSAルータは、そのルータLSAにEビットを設定することにより、NSSA ASBRであることを示します。タイプ5のLSAと同様に別タイプ7 LSAは、各宛先ネットワークに発信されます。あるNSSAをサポートするためのリンクステートデータベースは、したがって、タイプ7 LSAを含むように拡張されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Type-7 LSAs are identical to Type-5 LSAs except for the following (see [OSPF] Section 12.4.4, \"AS external links\").",
      "ja": "タイプ7 LSAは（「外部リンクAS」を参照してください。[OSPF]のセクション12.4.4）以下を除いてのLSA-5を入力と同一です。"
    },
    {
      "indent": 6,
      "text": "1. The Type field in the LSA header is 7.",
      "section_title": true,
      "ja": "1. LSAヘッダーのタイプフィールドは7です。"
    },
    {
      "indent": 6,
      "text": "2. Type-7 LSAs are only flooded within the originating NSSA. The flooding of Type-7 LSAs follows the same rules as the flooding of Type-1 and Type-2 LSAs.",
      "ja": "2.タイプ7 LSAは、発信のみNSSA内殺到しています。タイプ7 LSAのフラッディングは、タイプ1とタイプ2のLSAのフラッディングと同じ規則に従います。"
    },
    {
      "indent": 6,
      "text": "3. Type-7 LSAs are only listed within the OSPF area data structures of their respective NSSAs, making them area specific. Type-5 LSAs, which are flooded to all Type-5 capable areas, have global scope and are listed in the OSPF protocol data structure.",
      "ja": "3.-7 LSAは、それらだけ面積比作り、それぞれのあるNSSAのOSPFエリアデータ構造内にリストされています。全5型可能な領域にフラッディングされるタイプ5 LSAは、グローバルスコープを持ち、OSPFプロトコルデータ構造に記載されています。"
    },
    {
      "indent": 6,
      "text": "4. NSSA border routers select which Type-7 LSAs are translated into Type-5 LSAs and flooded into the OSPF domain's transit topology.",
      "ja": "4. NSSA境界ルータは、タイプ7のLSAがタイプ5のLSAに変換され、OSPFドメインのトランジットトポロジに殺到しているかを選択します。"
    },
    {
      "indent": 6,
      "text": "5. Type-7 LSAs have a propagate (P) bit that, when set, tells an NSSA border router to translate a Type-7 LSA into a Type-5 LSA.",
      "ja": "5.-7 LSAは伝搬（P）ビットを持って、そのセットは、タイプ5 LSAにタイプ7 LSAを変換するNSSA境界ルータに指示します。"
    },
    {
      "indent": 6,
      "text": "6. Those Type-7 LSAs that are to be translated into Type-5 LSAs must have their forwarding address set.",
      "ja": "6.-5のLSAに変換することがあるこれらのタイプ7 LSAは、その転送先アドレスを設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Type-5 LSAs that are translations of Type-7 LSAs copy the Type-7 LSAs' non-zero forwarding addresses. Only those Type-5 LSAs that are aggregations of Type-7 LSAs may have 0.0.0.0 as a forwarding address. (See Section 3.2 for details.) Non-zero forwarding addresses produce efficient inter-area routing to an NSSA's AS external destinations when it has multiple border routers. Also the non-zero forwarding addresses of Type-7 LSAs ease the process of their translation into Type-5 LSAs, as NSSA border routers are not required to compute them.",
      "ja": "タイプ7 LSAの翻訳されているタイプ5 LSAはタイプ7のLSA非ゼロの転送アドレスをコピーします。タイプ7 LSAの集合体であるだけタイプ5 LSAは、転送アドレスとして0.0.0.0を有していてもよいです。 （詳細については、3.2節を参照してください。）非ゼロの転送アドレスは、複数の境界ルータを持っていたときにNSSAのAS外部の宛先へのルーティングを効率的エリア間を作り出します。 NSSA境界ルータは、それらを計算するために必要とされていないとしても、タイプ7 LSAの非ゼロの転送アドレスは、タイプ5のLSAに自分の翻訳のプロセスを容易にします。"
    },
    {
      "indent": 3,
      "text": "Normally the next hop address of an installed AS external route learned by an NSSA ASBR from an adjacent AS points at one of the adjacent AS's gateway routers. If this address belongs to a network connected to the NSSA ASBR via one of its NSSAs' active interfaces, then the NSSA ASBR copies this next hop address into the forwarding address field of the route's Type-7 LSA that is originated into this NSSA, as is currently done with Type-5 LSAs. (See [OSPF] Section 12.4.4.1.) For an NSSA with no such network the forwarding address field may only be filled with an address from one of the its active interfaces or 0.0.0.0. If the P-bit is set, the forwarding address must be non-zero; otherwise it may be 0.0.0.0. If an NSSA requires the P-bit be set and a non-zero forwarding address is unavailable, then the route's Type-7 LSA is not originated into this NSSA.",
      "ja": "通常、隣接するASのゲートウェイルータの1つに点として隣接からNSSA ASBRで学習した外部ルートとしてインストールの次ホップアドレス。このアドレスは、このNSSAに発信されたルートのタイプ7 LSAの転送先アドレスフィールドにこの次ホップアドレスは、その後、NSSA ASBRコピー、そのあるNSSAアクティブインターフェイスのうちの1つを介してNSSA ASBRに接続されたネットワークに属する場合現在、タイプ5のLSAで行われます。 （[OSPF]のセクション12.4.4.1を参照。）そのようなネットワークとNSSAの転送アドレスフィールドは、そのアクティブなインタフェースの一つまたは0.0.0.0からのアドレスを充填してもよいです。 Pビットがセットされている場合、転送先アドレスが非ゼロでなければなりません。それ以外の場合は0.0.0.0かもしれません。 NSSAは、Pビットがセットされると、非ゼロの転送先アドレスが使用できない必要な場合は、ルートのタイプ7 LSAは、このNSSAに発信されていません。"
    },
    {
      "indent": 3,
      "text": "When a router is forced to pick a forwarding address for a Type-7 LSA, preference should be given first to the router's internal addresses (provided internal addressing is supported). If internal addresses are not available, preference should be given to the router's active OSPF stub network addresses. These choices avoid the possible extra hop that may happen when a transit network's address is used. When the interface whose IP address is the LSA's forwarding address transitions to a Down state (see [OSPF] Section 9.3), the router must select a new forwarding address for the LSA and then re-originate it. If one is not available the LSA should be flushed.",
      "ja": "ルータはタイプ7 LSAの転送アドレスを選択するように強制されるとき、好ましくは、（サポートされているアドレッシング内部に設けられ）ルータの内部アドレスに最初に与えられるべきです。内部アドレスが利用できない場合は、優先順位は、ルータのアクティブなOSPFスタブネットワークアドレスに与えられるべきです。これらの選択肢は、トランジットネットワークのアドレスが使用されている場合に発生する可能性のある余分なホップを避けます。そのIPアドレス、インターフェイスがダウン状態にLSAの転送アドレス遷移（[OSPF]のセクション9.3を参照）である場合には、ルータがLSAのための新たな転送アドレスを選択する必要がありますし、それを再発信します。 1が利用できない場合LSAをフラッシュする必要があります。"
    },
    {
      "indent": 3,
      "text": "The metrics and path types of Type-5 LSAs are directly comparable with the metrics and path types of Type-7 LSAs.",
      "ja": "タイプ5 LSAのメ​​トリックおよびパスタイプはタイプ7 LSAのメ​​トリックおよびパスタイプと直接比較しています。"
    },
    {
      "indent": 0,
      "text": "2.4 Originating Type-7 LSAs",
      "section_title": true,
      "ja": "2.4発信元タイプ7のLSA"
    },
    {
      "indent": 3,
      "text": "NSSA AS boundary routers may only originate Type-7 LSAs into NSSAs. An NSSA internal AS boundary router must set the P-bit in the LSA header's option field of any Type-7 LSA whose network it wants advertised into the OSPF domain's full transit topology. The LSAs of these networks must have a valid non-zero forwarding address. If the P-bit is clear the LSA is not translated into a Type-5 LSA by NSSA border routers.",
      "ja": "NSSAは、AS境界ルータはあるNSSAにタイプ7 LSAを生じてもよいです。 NSSA境界ルータとしての内部は、ネットワーク、それがOSPFドメインのフルトランジットトポロジにアドバタイズたいすべてのタイプ7 LSAのLSAヘッダのオプションフィールドにPビットを設定する必要があります。これらのネットワークのLSAは、有効な非ゼロの転送先アドレスを持っている必要があります。 Pビットがクリアされている場合LSAをNSSA境界ルータによってタイプ5 LSAに変換されていません。"
    },
    {
      "indent": 3,
      "text": "When an NSSA border router originates both a Type-5 LSA and a Type-7 LSA for the same network, then the P-bit must be clear in the Type-7 LSA so that it isn't translated into a Type-5 LSA by another NSSA border router. If the border router only originates a Type-7 LSA, it may set the P-bit so that the network may be aggregated/propagated during Type-7 translation. If an NSSA's border router originates a Type-5 LSA with a forwarding address from the NSSA, it should also originate a Type-7 LSA into the NSSA. If two NSSA routers, both reachable from one another over the NSSA, originate functionally equivalent Type-7 LSAs (i.e., same destination, cost and non-zero forwarding address), then the router having the least preferred LSA should flush its LSA. (See [OSPF] Section 12.4.4.1.) Preference between two Type-7 LSAs is determined by the following tie breaker rules:",
      "ja": "NSSAボーダールータはタイプ5 LSAと同じネットワークのタイプ7 LSAの両方を発信する場合、それがタイプ5 LSAに翻訳されないように、次にPビットは、タイプ7 LSAに明確でなければなりません別のNSSA境界ルータによって。境界ルータのみタイプ7 LSAを発信した場合、ネットワークは、タイプ7翻訳中に伝播/集約することができるように、それはPビットを設定してもよいです。 NSSAのボーダールータがNSSAから転送先アドレスをタイプ5 LSAを発信した場合、それはまた、NSSAにタイプ7 LSAを発信する必要があります。 NSSAにわたって互いに到達可能両方2つのNSSAルータは、機能的に同等なタイプ7のLSA（すなわち、同一の宛先、コスト及び非ゼロの転送アドレス）を発信した場合、次に最も好ましいLSAを有するルータはLSAをフラッシュしなければなりません。 （[OSPF]のセクション12.4.4.1を参照。）は、2つのタイプ7のLSA間好ましいのは、以下のタイブレーカールールによって決定されます。"
    },
    {
      "indent": 6,
      "text": "1. An LSA with the P-bit set is preferred over one with the P-bit clear.",
      "ja": "Pビットがセットされた1】LSAは、Pビットのクリアを有するものよりも好ましいです。"
    },
    {
      "indent": 6,
      "text": "2. If the P-bit settings are the same, the LSA with the higher router ID is preferred.",
      "ja": "Pビットの設定が同じである場合は2、より高いルータIDを持つLSAが好ましいです。"
    },
    {
      "indent": 3,
      "text": "A Type-7 default LSA for the network 0.0.0.0/0 may be originated into the NSSA by any NSSA router. The Type-7 default LSA originated by an NSSA border router must have the P-bit clear. An NSSA ASBR that is not an NSSA border router may originate a Type-7 default LSA with the P-bit set. A Type-7 default LSA may be installed by NSSA border routers if and only if its P-bit is set. (See Appendix E.)",
      "ja": "ネットワーク0.0.0.0/0のためのタイプ7デフォルトLSAは、任意のNSSAルータでNSSAに起源することができます。 NSSA境界ルータによって発信タイプ7デフォルトのLSAは、P-ビットがクリアされている必要があります。 NSSA境界ルータではありませんNSSA ASBRは、Pビットがセットされたタイプ7のデフォルトLSAを発信することがあります。タイプ7デフォルトLSAがあればNSSA境界ルータによってインストールされてもよく、そのPビットがセットされている場合のみ。 （付録Eを参照してください）"
    },
    {
      "indent": 3,
      "text": "NSSA border routers must originate an LSA for the default destination into all their directly attached NSSAs in order to support intra-AS routing and inter-AS routing. This default destination is advertised in either a Type-3 LSA or a Type-7 LSA, as described in Section 2.7. The default LSA's metric should be configurable. For Type-7 default LSAs, the metric type (1 or 2) should also be configurable.",
      "ja": "NSSA境界ルータは、イントラASルーティングおよびAS間のルーティングをサポートするために、すべての直接接続されたあるNSSAにデフォルト先のLSAを発信する必要があります。セクション2.7で説明したように、このデフォルトの宛先は、タイプ3 LSAまたはタイプ7 LSAのいずれかでアドバタイズされます。デフォルトのLSAのメ​​トリックは、設定する必要があります。タイプ7デフォルトのLSAのために、メトリックタイプ（1又は2）も設定可能でなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.5 Calculating Type-7 AS External Routes",
      "section_title": true,
      "ja": "2.5タイプ7 AS外部ルートを計算します"
    },
    {
      "indent": 3,
      "text": "This calculation must be run when Type-7 LSAs are processed during the AS external route calculation. This calculation may process Type-5 LSAs, but it is written that way only for comparison sake.",
      "ja": "タイプ7のLSAをAS外部ルート計算中に処理されている場合は、この計算を実行する必要があります。この計算は、Type-5 LSAを処理することができるが、それは唯一の比較ためにそのように書かれています。"
    },
    {
      "indent": 3,
      "text": "Non-default Type-7 LSAs with the P-bit clear may be installed in the OSPF routing table of NSSA border routers. Since these LSAs are not propagated throughout the OSPF domain, traffic that originates external to an NSSA and that passes through one of the NSSA's border routers may be unexpectedly diverted into the NSSA. (See Appendix E.)",
      "ja": "クリアPビットを有する非デフォルトタイプ7 LSAはNSSA境界ルータのOSPFルーティングテーブルに設置してもよいです。これらのLSAは、OSPFドメイン全体に伝播されていないので、NSSA外部に発信され、それがNSSAのボーダールータの1つを通過するトラフィックが予期せずNSSAに流用することができます。 （付録Eを参照してください）"
    },
    {
      "indent": 3,
      "text": "An NSSA border router should examine both Type-5 LSAs and Type-7 LSAs if either Type-5 or Type-7 routes need to be updated or recalculated. This is done as part of the AS external route calculation. An NSSA internal router should examine Type-7 LSAs when Type-7 routes need to be recalculated.",
      "ja": "NSSA境界ルータは、両方のタイプ5 LSAを調べ、タイプ7 LSAをどちらかのタイプ5またはタイプ7ルートが更新または再計算する必要がある場合にすべきです。これは、AS外部ルート計算の一部として行われます。タイプ7ルートが再計算する必要がある場合にNSSA内部ルータは、タイプ7 LSAを調べる必要があります。"
    },
    {
      "indent": 3,
      "text": "What follows is only a modest modification of [OSPF] Section 16.4. Original paragraphs are tagged with [OSPF]. Paragraphs with minor changes are tagged with ~[OSPF]. Paragraphs specific to NSSA are tagged with [NSSA].",
      "ja": "以下は、[OSPF]のセクション16.4のわずかな変更です。オリジナルの段落は、[OSPF]でタグ付けされています。マイナーチェンジ段落は〜[OSPF]でタグ付けされています。 NSSAの特定の段落では、[NSSA]でタグ付けされています。"
    },
    {
      "indent": 3,
      "text": "AS external routes are calculated by examining AS-external-LSAs, be they Type-5 or Type-7. Each of the AS-external-LSAs is considered in turn. Most AS-external-LSAs describe routes to specific IP destinations. An AS-external-LSA can also describe a default route for the Autonomous System (Destination ID = DefaultDestination, network/subnet mask = 0x00000000). For each AS-external-LSA: ~[OSPF]",
      "ja": "外部ルートはASの外部のLSAを調べることによって計算されると、彼らはTYPE-5またはType-7になります。 ASの外部のLSAのそれぞれが順番に考えられています。ほとんどのASの外部のLSAは、特定のIP宛先へのルートを記述します。 ASの外部のLSAはまた、自律システム（デスティネーションID = DefaultDestination、ネットワーク/サブネットマスク= 0x00000000の）のデフォルトルートを記述することができます。各ASの外部のLSAの場合：〜[OSPF]"
    },
    {
      "indent": 6,
      "text": "(1) If the metric specified by the LSA is LSInfinity, or if the age of the LSA equals MaxAge, then examine the next LSA. [OSPF]",
      "ja": "（1）LSAで指定されたメトリックはLSInfinityある、またはLSAの年齢はMaxAgeのに等しい場合は、次のLSAを調べる場合。 [OSPF]"
    },
    {
      "indent": 6,
      "text": "(2) If the LSA was originated by the calculating router itself, examine the next LSA. [OSPF]",
      "ja": "LSAを計算するルータ自体によって発信された場合（2）、次のLSAを調べます。 [OSPF]"
    },
    {
      "indent": 6,
      "text": "(3) Call the destination described by the LSA N. N's address is obtained by masking the LSA's Link State ID with the network/subnet mask contained in the body of the LSA. Look up the routing table entries that match the LSA's type for the AS boundary router (ASBR) that originated the LSA. For a Type-5 LSA, routing table entries may only be selected from each attached Type-5 capable area. Since the flooding scope of a Type-7 LSA is restricted to the originating NSSA, the routing table entry of its ASBR must be found in the originating NSSA. If no entries exist for the ASBR (i.e. the ASBR is unreachable over the transit topology for a Type-5 LSA, or, for a Type-7 LSA, it is unreachable over the LSA's originating NSSA), do nothing with this LSA and consider the next in the list. [NSSA]",
      "ja": "（3）LSA N. NのアドレスがLSAの本体に含まれているネットワーク/サブネットマスクとLSAのリンクステートIDをマスクすることによって得られるにより記載宛先を呼び出します。 LSAを発信しAS境界ルータ（ASBR）のためのLSAのタイプと一致するルーティングテーブルエントリを検索します。タイプ5 LSAは、ルーティングテーブルエントリは、各取り付けタイプ5可能な領域から選択することができます。タイプ7 LSAの氾濫範囲を発信NSSAに制限されているので、そのASBRのルーティングテーブルエントリは、発信NSSAで発見されなければなりません。何のエントリがASBRのために存在しない場合（つまり、ASBRがタイプ5 LSAの中継トポロジーの上に到達できない、または、タイプ7 LSAのために、それはLSAの発信元NSSAオーバー到達不能である）、このLSAで何もしないと考えますリスト内の次。 [NSSA]"
    },
    {
      "indent": 10,
      "text": "Else if the destination is a Type-7 default route (destination\nID = DefaultDestination) and one of the following is true,\nthen do nothing with this LSA and consider the next in the\nlist:",
      "raw": true
    },
    {
      "indent": 12,
      "text": "o The calculating router is a border router and the LSA has its P-bit clear. Appendix E describes a technique whereby an NSSA border router installs a Type-7 default LSA without propagating it.",
      "ja": "O計算のルータは、境界ルータであり、LSAは、Pビットがクリアされています。付録Eは、NSSA境界ルータがそれを伝播することなく、タイプ7のデフォルトのLSAをインストールする技術について説明します。"
    },
    {
      "indent": 12,
      "text": "o The calculating router is a border router and is suppressing the import of summary routes as Type-3 summary-LSAs. [NSSA]",
      "ja": "O計算のルータは、境界ルータであり、タイプ3要約LSAのように要約ルートの輸入を抑制されています。 [NSSA]"
    },
    {
      "indent": 10,
      "text": "Else, this LSA describes an AS external path to destination N. Examine the forwarding address specified in the AS-external-LSA. This indicates the IP address to which packets for the destination should be forwarded. [OSPF]",
      "ja": "そうでなければ、このLSAは、宛先NにAS外部パスがASの外部のLSAで指定された転送先アドレスを調べ記述する。これは、先のためにパケットが転送されなければならないためのIPアドレスを示します。 [OSPF]"
    },
    {
      "indent": 10,
      "text": "If the forwarding address is set to 0.0.0.0 then packets should be sent to the ASBR itself. If the LSA is Type-5, from among the multiple non-NSSA routing table entries for the ASBR (both NSSA and non-NSSA ASBR entries might exists on an NSSA border router), select the preferred entry as follows: ~[OSPF]",
      "ja": "転送先アドレスが0.0.0.0に設定されている場合、パケットはASBR自体に送信する必要があります。 LSAは、5型を、ASBRための複数の非NSSAルーティングテーブルエントリの中から（NSSAおよび非NSSA ASBRエントリの両方かもしれNSSA境界ルータ上に存在する）である場合、以下のように、好適なエントリを選択します〜[OSPF]"
    },
    {
      "indent": 12,
      "text": "If RFC1583Compatibility is set to \"disabled\", prune the set of routing table entries for the ASBR as described in OSPF Section 16.4.1. In any case, among the remaining routing table entries, select the routing table entry with the least cost; when there are multiple least cost routing table entries the entry whose associated area has the largest OSPF Area ID (when considered as an unsigned 32-bit integer) is chosen. [OSPF]",
      "ja": "RFC1583Compatibilityが「無効」に設定されている場合は、OSPF、セクション16.4.1で説明したように、ASBRのルーティングテーブルエントリのセットを剪定。いずれの場合においても、残りのルーティングテーブルエントリのうち、最小コストとルーティングテーブルエントリを選択します。存在する場合、複数の最小コストのルーティングテーブルは、その関連するエリア最大OSPFエリアIDを有するエントリをエントリ（32ビットの符号なし整数として考えた場合に）選択されます。 [OSPF]"
    },
    {
      "indent": 10,
      "text": "Since a Type-7 LSA only has area-wide flooding scope, when its forwarding address is set to 0.0.0.0, its ASBR's routing table entry must be chosen from the originating NSSA. Here no pruning is necessary since this entry always contains non-backbone intra-area paths. [NSSA]",
      "ja": "タイプ7 LSAのみ領域全体の氾濫範囲を有するので、その転送先アドレスを0.0.0.0に設定されている場合、そのASBRのルーティングテーブルエントリは、発信NSSAから選択されなければなりません。このエントリは常に非バックボーンエリア内のパスが含まれているので、ここでは何の剪定は必要ありません。 [NSSA]"
    },
    {
      "indent": 10,
      "text": "If the forwarding address is non-zero look up the forwarding address in the routing table. For a Type-5 LSA the matching routing table entry must specify an intra-area or inter-area path through a Type-5 capable area. For a Type-7 LSA the matching routing table entry must specify an intra-area path through the LSA's originating NSSA. If no such path exists then do nothing with this LSA and consider the next in the list. [NSSA]",
      "ja": "転送先アドレスがゼロでない場合は、ルーティングテーブルでフォワーディングアドレスを検索。タイプ5 LSAのためのマッチング・ルーティング・テーブルのエントリは、タイプ5可能な領域を介してイントラ領域またはエリア間のパスを指定しなければなりません。タイプ7 LSAのためのマッチング・ルーティング・テーブルのエントリは、LSAの発信NSSAを介してエリア内経路を指定しなければなりません。そのようなパスが存在しない場合、このLSAで何もしないし、リスト内の次を考えます。 [NSSA]"
    },
    {
      "indent": 6,
      "text": "(4) Let X be the cost specified by the preferred routing table entry for the ASBR/forwarding address, and Y the cost specified in the LSA. X is in terms of the link state metric, and Y is a type 1 or 2 external metric. [OSPF]",
      "ja": "（4）Xは、好ましいルーティングテーブルASBR /転送先アドレスのエントリ、およびY LSAで指定されたコストで指定されたコストとします。 Xは、リンク状態メトリックの点であり、そしてYは、1型又は2外部メトリックです。 [OSPF]"
    },
    {
      "indent": 6,
      "text": "(5) Now, look up the routing table entry for the destination N. If no entry exists for N, install the AS external path to N, with the next hop equal to the list of next hops to the ASBR/forwarding address, and advertising router equal to the ASBR. If the external metric type is 1, then the path-type is set to Type-1 external and the cost is equal to X + Y. If the external metric type is 2, the path-type is set to Type-2 external, the link-state component of the route's cost is X, and the type 2 cost is Y. [OSPF]",
      "ja": "（5）ここで、エントリがNのために存在しない場合、ASBR /転送先アドレスに対して次ホップのリストに等しい次のホップと、Nする外部パスをインストール先N.ためのルーティングテーブルエントリをルックアップし、そしてASBRに等しい広告ルータ。外部メトリックタイプが1である場合、パス型タイプ1外部に設定され、外部メトリックタイプが2の場合、コストはX + Yに等しく、パスタイプはタイプ2外部に設定されています、ルートのコストのリンクステート成分がXであり、そして2型コストがYである[OSPF]"
    },
    {
      "indent": 6,
      "text": "(6) Otherwise compare the AS external path described by the LSA with the existing paths in N's routing table entry. If the new path is preferred, it replaces the present paths in N's routing table entry. If the new path is of equal preference, it is added to the present paths in N's routing table entry. [OSPF]",
      "ja": "（6）それ以外の場合はNのルーティングテーブルエントリ内の既存のパスでLSAによって記載されるように外部パスを比較します。新しい経路が好ましい場合、それはNのルーティングテーブルエントリ内に存在するパスを置き換えます。新しいパスが等しい優先である場合、それはNのルーティングテーブルのエントリに存在するパスに追加されます。 [OSPF]"
    },
    {
      "indent": 10,
      "text": "Preference is defined as follows:",
      "ja": "次のように好みは定義されています。"
    },
    {
      "indent": 10,
      "text": "(a) Intra-area and inter-area paths are always preferred over AS external paths. [OSPF]",
      "ja": "（a）は、イントラ領域と相互領域経路は常に外部経路AS上好ましいです。 [OSPF]"
    },
    {
      "indent": 10,
      "text": "(b) Type 1 external paths are always preferred over type 2 external paths. When all paths are type 2 external paths, the paths with the smallest advertised type 2 metric are always preferred. [OSPF]",
      "ja": "（B）タイプ1外部経路は常にタイプ2外部経路よりも好ましいです。すべてのパスがタイプ2外部経路である場合、メトリック最小アドバタイズタイプ2とのパスが常に好ましいです。 [OSPF]"
    },
    {
      "indent": 10,
      "text": "(c) If the new AS external path is still indistinguishable from the current paths in N's routing table entry, and RFC1583Compatibility is set to \"disabled\", select the preferred paths based on the intra-AS paths to the ASBR/forwarding addresses, as specified in Section 16.4.1. Here intra-NSSA paths are equivalent to the intra-area paths of non-backbone regular OSPF areas. [NSSA]",
      "ja": "外部パス、新しい、まだNのルーティングテーブルエントリ内の電流経路と区別できない、そしてRFC1583Compatibilityが「無効」、イントラAS ASBR /転送アドレスへのパスなどに基づいて優先パスを選択するように設定されている場合（C）セクション16.4.1で指定されました。ここでは、イントラNSSAパスは非バックボーン通常のOSPFエリアのエリア内パスに相当します。 [NSSA]"
    },
    {
      "indent": 10,
      "text": "(d) If the new AS external path is still indistinguishable from the current paths in N's routing table entry, select the preferred path based on a least cost comparison. Type 1 external paths are compared by looking at the sum of the distance to the ASBR/forwarding addresses and the advertised type 1 metric (X+Y). Type 2 external paths advertising equal type 2 metrics are compared by looking at the distance to the ASBR/forwarding addresses. ~[OSPF]",
      "ja": "（D）外部パスAS新しい場合には、最小コストの比較に基づいて優先パスを選択し、まだNのルーティングテーブルエントリ内の電流経路と区別がつきません。タイプ1の外部パスがASBR /転送先アドレスまでの距離およびアドバタイズタイプ1メトリック（X + Y）の合計を見て比較しました。同じタイプ2メトリックをアドバタイズ2の外部パスを入力するASBR /転送先アドレスまでの距離を見て比較しました。 〜[OSPF]"
    },
    {
      "indent": 10,
      "text": "(e) If the current LSA is functionally the same as an installed LSA (i.e., same destination, cost and non-zero forwarding address) then apply the following priorities in deciding which LSA is preferred:",
      "ja": "現在のLSAは、機能インストールLSA（すなわち、同一の宛先、コスト及び非ゼロの転送先アドレス）と同じである場合、（E）次いで、LSAが好ましいかを決める、次の優先順位を適用します。"
    },
    {
      "indent": 17,
      "text": "1. A Type-7 LSA with the P-bit set.",
      "section_title": true,
      "ja": "1. Pビットがセットされたタイプ7 LSA。"
    },
    {
      "indent": 17,
      "text": "2. A Type-5 LSA.",
      "section_title": true,
      "ja": "2.タイプ5 LSA。"
    },
    {
      "indent": 17,
      "text": "3. The LSA with the higher router ID.",
      "section_title": true,
      "ja": "3.高いルータIDを持つLSA。"
    },
    {
      "indent": 14,
      "text": "[NSSA]",
      "ja": "[NSSA]"
    },
    {
      "indent": 0,
      "text": "2.6 Incremental Updates",
      "section_title": true,
      "ja": "2.6増分更新"
    },
    {
      "indent": 3,
      "text": "Incremental updates for Type-7 LSAs should be treated the same as incremental updates for Type-5 LSAs (see [OSPF] Section 16.6). When a new instance of a Type-7 LSA is received it is not necessary to recalculate the entire routing table. Call the destination described by the Type-7 LSA N. N's address is obtained by masking the LSA's Link State ID with the network/subnet mask contained in the body of the LSA. If there is already an intra-area or inter-area route to the destination, no recalculation is necessary (internal routes take precedence).",
      "ja": "タイプ7のLSAの増分アップデートは、（[OSPF]のセクション16.6を参照のこと）タイプ5のLSAの増分更新と同じように扱われるべきです。タイプ7 LSAの新しいインスタンスを受信したときには、全体のルーティングテーブルを再計算する必要はありません。 LSAの本体に含まれているネットワーク/サブネットマスクとLSAのリンクステートIDをマスクすることによって得られるタイプ7 LSA N. Nのアドレスによって記述宛先を呼び出します。先にイントラ領域またはエリア間のルートがすでに存在する場合、再計算は、（内部ルートが優先）必要はありません。"
    },
    {
      "indent": 3,
      "text": "Otherwise, the procedure in the preceding section will have to be performed but only for the external routes (Type-5 and Type-7) whose destination is N. Before this procedure is performed, the present routing table entry for N should be invalidated.",
      "ja": "そうでなければ、前のセクションの手順を実行するだけで、その宛先であるN.、この手順の前に実行される外部ルート（タイプ5およびタイプ7）のために、Nのための本ルーティングテーブルエントリが無効化されるべきであります。"
    },
    {
      "indent": 0,
      "text": "2.7 Optionally Importing Summary Routes",
      "section_title": true,
      "ja": "2.7必要に応じてサマリールートをインポートします"
    },
    {
      "indent": 3,
      "text": "In order for OSPF's summary routing to not be obscured by an NSSA's Type-7 AS-external-LSAs, all NSSA border router implementations must support the optional import of summary routes into NSSAs as Type-3 summary-LSAs. The default behavior is to import summary routes. A new area configuration parameter, ImportSummaries, is defined in Appendix D. When ImportSummaries is set to enabled, summary routes",
      "ja": "OSPFの要約ルーティングのためにNSSAのタイプ7 AS-外部のLSAによって不明瞭にされないように、すべてのNSSAボーダールータ実装は、タイプ3要約LSAとしてあるNSSAにサマリールートの任意のインポートをサポートしなければなりません。デフォルトの動作では、サマリールートをインポートすることです。新エリアの設定パラメータ、ImportSummaries、ImportSummariesが有効に設定されている場合は、付録Dで定義されている、サマリールート"
    },
    {
      "indent": 3,
      "text": "are imported. When it is set to disabled, summary routes are not imported. The default setting is enabled.",
      "ja": "インポートされます。それが無効に設定されている場合、サマリールートがインポートされません。デフォルトの設定が有効になっています。"
    },
    {
      "indent": 3,
      "text": "When OSPF's summary routes are not imported, the default LSA originated by an NSSA border router into the NSSA should be a Type-3 summary-LSA. This protects the NSSA from routing intra-AS traffic out the AS via the default route of a Type-7 default LSA originating from one of the NSSA's internal routers. When summary routes are imported into the NSSA, the default LSA originated by an NSSA border router must not be a Type-3 summary-LSA; otherwise its default route would be chosen over the potentially more preferred default routes of Type-7 default LSAs.",
      "ja": "OSPFのサマリールートがインポートされていない場合は、LSAはNSSAにNSSA境界ルータによって発信デフォルトでは、タイプ3要約LSAでなければなりません。これは、イントラASルーティングトラフィックASからNSSAの内部ルータの1つから発信タイプ7のデフォルトのLSAのデフォルトルートを経由してからNSSAを保護します。サマリールートはNSSAにインポートされると、LSAは、NSSA境界ルータによって発信デフォルトでは、タイプ3要約LSAであってはなりません。そうでなければ、そのデフォルトルートはタイプ7デフォルトのLSAの潜在的により好ましいデフォルトルート上に選択されるであろう。"
    },
    {
      "indent": 0,
      "text": "3.0 Intra-AS Implementation Details",
      "section_title": true,
      "ja": "イントラAS実装の詳細3.0"
    },
    {
      "indent": 0,
      "text": "3.1 Type-7 Translator Election",
      "section_title": true,
      "ja": "3.1型-7翻訳選挙"
    },
    {
      "indent": 3,
      "text": "It is not recommended that multiple NSSA border routers perform Type-7 to Type-5 translation unless it is required to route packets efficiently through Area 0 to an NSSA partitioned by Type-7 address ranges. It is normally sufficient to have only one NSSA border router perform the translation. Excessive numbers of Type-7 translators unnecessarily increase the size of the OSPF link state data base.",
      "ja": "複数のNSSA境界ルータは、それがタイプ7アドレス範囲で仕切らNSSAに効率的にエリア0を通じてパケットをルーティングするために必要とされない限り、翻訳-5を入力するタイプ7を実行することをお勧めされていません。一つだけNSSA境界ルータは、変換を実行させる通常は十分です。タイプ7翻訳の過度の数が不必要OSPFリンク状態データベースのサイズを増加させます。"
    },
    {
      "indent": 3,
      "text": "A new area configuration parameter, NSSATranslatorRole, is defined in Appendix D. It specifies whether or not an NSSA router will unconditionally translate Type-7 LSAs to Type-5 LSAs when acting as an NSSA border router. Configuring the identity of the translator can be used to bias the routing to aggregated destinations. When NSSATranslatorRole is set to Always, Type-7 LSAs are always translated regardless of the translator state of other NSSA border routers. When NSSATranslatorRole is set to Candidate an NSSA border router will participate in the translator election process described below.",
      "ja": "新エリアの設定パラメータ、NSSATranslatorRoleは、それがNSSAルータは無条件タイプ-5するLSAをNSSA境界ルータとして動作する場合、タイプ7 LSAを変換するかどうかを指定付録D.で定義されています。翻訳者の身元を設定すると、集約された宛先へのルーティングのバイアスに使用することができます。 NSSATranslatorRoleがAlwaysに設定されている場合は、タイプ7 LSAは関係なく、常に他のNSSA境界ルータの翻訳状態の変換されます。 NSSATranslatorRoleが候補に設定されている場合NSSA境界ルータは、後述する翻訳者の選定プロセスに参加します。"
    },
    {
      "indent": 3,
      "text": "A new area parameter, NSSATranslatorState, is maintained in an NSSA's OSPF area data structure. By default all NSSA routers initialize NSSATranslatorState to disabled. When an NSSA border router's NSSATranslatorState changes from disabled to either enabled or elected, it begins translating the NSSA's Type-7 LSAs into Type-5 LSAs. When its NSSATranslatorState changes from either enabled or elected to disabled, it ceases translating the NSSA's Type-7 LSAs into Type-5 LSAs. (See paragraphs below.)",
      "ja": "新しい領域パラメータ、NSSATranslatorStateは、NSSAのOSPF領域データ構造内に維持されます。デフォルトでは、すべてのNSSAルータが無効にNSSATranslatorStateを初期化します。 NSSA境界ルータのNSSATranslatorStateが無効から有効にするか選出のいずれかに変更すると、それはタイプ5のLSAにNSSAのタイプ7 LSAを翻訳開始します。そのNSSATranslatorStateの変化から有効または無効に選出されたいずれかの場合は、タイプ5のLSAにNSSAのタイプ7 LSAを変換しなくなりました。 （下の段落を参照してください。）"
    },
    {
      "indent": 3,
      "text": "A new bit, Nt, is defined for the router-LSAs of NSSAs. (See Appendix B.) By default routers clear bit Nt when originating router-LSAs. However, when an NSSA border router has its",
      "ja": "新しいビット、Ntのは、あるNSSAのルータのLSAのために定義されています。ルータのLSAを発信するときに、デフォルトのルータクリアビットNTで（付録Bを参照してください）。しかし、NSSA境界ルータは、そのを持っている場合"
    },
    {
      "indent": 3,
      "text": "NSSATranslatorState enabled, it sets bit Nt in the router-LSA it originates into the NSSA. An NSSA router whose NSSATranslatorRole is set to Always should re-originate a router-LSA into the NSSA whenever its NSSATranslatorState changes.",
      "ja": "NSSATranslatorStateは、それがNSSAに発信ルータLSAでビットNTを設定し、有効。そのNSSATranslatorRoleが常にに設定されているときは常にNSSAそのNSSATranslatorStateの変化にルータLSAを再発信する必要がありNSSAルータ。"
    },
    {
      "indent": 3,
      "text": "When an NSSA router with the NSSA's NSSATranslatorRole set to Always attains border router status, it should change NSSATranslatorState from disabled to enabled. When it loses border router status, it should change NSSATranslatorState from enabled to disabled.",
      "ja": "NSSAのNSSATranslatorRoleとNSSAルータは必ずに設定すると、境界ルータの状態になり、それが無効から有効にNSSATranslatorStateを変更する必要があります。それは境界ルータのステータスを失うと、それが有効から無効にNSSATranslatorStateを変更する必要があります。"
    },
    {
      "indent": 3,
      "text": "All NSSA border routers must set the E-bit in the Type-1 router-LSAs of their directly attached non-stub areas, even when they are not translating. This allows other NSSA border routers to see their ASBR status across the AS's transit topology. Failure to do so may cause the election algorithm to elect unnecessary translators. Every NSSA border router is a potential translator.",
      "ja": "すべてのNSSA境界ルータは、彼らが翻訳されていない場合でも、彼らの直接接続非スタブエリアの種類-1ルータのLSAにEビットを設定する必要があります。これは、他のNSSA境界ルータはASのトランジットトポロジ全体彼らのASBRの状態を確認することができます。そうしないと、選挙アルゴリズムが不要な翻訳者を選出することがあります。すべてのNSSA境界ルータは、潜在的な翻訳者です。"
    },
    {
      "indent": 3,
      "text": "An NSSA border router whose NSSA's NSSATranslatorRole is set to Candidate must maintain a list of the NSSA's border routers that are reachable both over the NSSA and as ASBRs over the AS's transit topology. Any change in this list, or to the Nt bit settings of members of this list, causes the NSSA border router to reevaluate its NSSATranslatorState. If there exists another border router in this list whose router-LSA has bit Nt set or who has a higher router ID, then its NSSATranslatorState is disabled. Otherwise its NSSATranslatorState is elected.",
      "ja": "そのNSSAのNSSATranslatorRoleが候補に設定されているNSSA境界ルータはNSSA上とASのトランジットトポロジ以上のASBRの両方にアクセス可能ですNSSAの境界ルータのリストを維持しなければなりません。このリストで、またはこのリストのメンバーのNt個のビットの設定に対する変更は、NSSA境界ルータはそのNSSATranslatorStateを再評価する原因となります。ルータLSAビットNt個のセットを持っている以上のルータIDを持って、このリスト内の別の境界ルータが存在する場合、そのNSSATranslatorStateが無効になっています。それ以外の場合はそのNSSATranslatorStateが選出されます。"
    },
    {
      "indent": 3,
      "text": "An elected translator will continue to perform translation duties until supplanted by a reachable NSSA border router whose Nt bit is set or whose router ID is greater. Such an event may happen when an NSSA router with NSSATranslatorRole set to Always regains border router status, or when a partitioned NSSA becomes whole. If an elected translator determines its services are no longer required, it continues to perform its translation duties for the additional time interval defined by a new area configuration parameter, TranslatorStabilityInterval. This minimizes excessive flushing of translated Type-7 LSAs and provides for a more stable translator transition. The default value for the TranslatorStabilityInterval parameter has been defined as 40 seconds. (See Appendix D.)",
      "ja": "選出された翻訳者は、そのNtのビット設定されているか、そのルータID大きい到達可能NSSA境界ルータに取って代わられるまで、翻訳作業を実行していきます。 NSSATranslatorRoleとNSSAルータが常に境界ルータの状態を回復するように設定する場合、または区分NSSA全体になったときにこのようなイベントが発生する可能性があります。選出された翻訳者がそのサービスは、もは​​や必要とされている決定しない場合は、新しいエリアの設定パラメータ、TranslatorStabilityIntervalによって定義された追加の時間間隔でその翻訳業務を行うために続けています。これは、翻訳されたタイプ7 LSAの過剰なフラッシングを最小化し、より安定したトランスレータ遷移を提供します。 TranslatorStabilityIntervalパラメータのデフォルト値は40秒として定義されています。 （付録Dを参照してください）"
    },
    {
      "indent": 0,
      "text": "3.2 Translating Type-7 LSAs into Type-5 LSAs",
      "section_title": true,
      "ja": "3.2タイプ5のLSAにタイプ7 LSAを翻訳"
    },
    {
      "indent": 3,
      "text": "This step is performed as part of the NSSA's Dijkstra calculation after Type-5 and Type-7 routes have been calculated. If the calculating router is currently not an NSSA border router translator, then this translation algorithm should be skipped. Only installed",
      "ja": "このステップは、タイプ5およびタイプ7ルートが計算された後にNSSAのダイクストラ計算の一部として実行されます。計算のルータは現在、NSSA境界ルーターの翻訳者でない場合は、この変換アルゴリズムはスキップされなければなりません。のみインストール"
    },
    {
      "indent": 3,
      "text": "Type-7 LSAs and those non-default Type-7 LSAs originated by the router itself should be examined. Locally sourced Type-7 LSAs should be processed first.",
      "ja": "タイプ7のLSAおよびルータ自体によって発信それらのデフォルト以外のタイプ7 LSAは検討する必要があります。地元のタイプ7 LSAは、最初に処理されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Note that it is possible for a Type-5 LSA generated by translation to supplant a Type-5 LSA originating from a local OSPF external source. Future reoriginations of the locally sourced Type-5 LSA should be suppressed until the Type-5 LSA generated by translation is flushed.",
      "ja": "翻訳により生成されたタイプ5 LSAは、ローカルOSPF外部ソースから発するタイプ5 LSAに取って代わるすることが可能であることに注意してください。翻訳により生成されたタイプ5 LSAがフラッシュされるまで、地元のタイプ5 LSAの将来reoriginationsが抑制されなければなりません。"
    },
    {
      "indent": 3,
      "text": "A Type-7 LSA and a Type-7 address range best match one another if there does not exist a more specific Type-7 address range that contains the LSA's network. For each eligible Type-7 LSA perform the following:",
      "ja": "タイプ7 LSAとType-7のアドレス範囲ベストマッチ互いにLSAのネットワークが含まれ、より具体的なタイプ7のアドレス範囲が存在しない場合。各資格のタイプ7 LSAの場合は次の手順を実行します。"
    },
    {
      "indent": 6,
      "text": "(1) If the Type-7 LSA has the P-bit clear, or its forwarding address is set to 0.0.0.0, or the most specific Type-7 address range that subsumes the LSA's network has DoNotAdvertise status, then do nothing with this Type-7 LSA and consider the next one in the list. Otherwise term the LSA as translatable and proceed with step (2).",
      "ja": "（1）タイプ7 LSAは、Pビットをクリア持つ、またはその転送アドレスは0.0.0.0に設定、またはLSAのネットワークを包含し、ほとんどの特定のタイプ7のアドレス範囲がDoNotAdvertiseのステータスを持っているし、これで何もしていない場合LSA-7を入力して、リストの次のものを検討してください。そうでなければ翻訳可能としてLSAを期間および工程（2）に進みます。"
    },
    {
      "indent": 6,
      "text": "(2) If the Type-7 LSA is not contained in any explicitly configured Type-7 address range and the calculating router has the highest router ID amongst NSSA translators that have originated a functionally equivalent Type-5 LSA (i.e. same destination, cost and non-zero forwarding address) and that are reachable over area 0 and the NSSA, then a Type-5 LSA should be generated if there is currently no Type-5 LSA originating from this router corresponding to the Type-7 LSA's network, or there is an existing Type-5 LSA and either it corresponds to a local OSPF external source whose path type and metric is less preferred (see Section 2.5 step (6), parts (b) and (d)), or it doesn't and the Type-5 LSA's path type or cost(s) have changed (See Section 2.5 step (5)) or the forwarding address no longer maps to a translatable Type-7 LSA.",
      "ja": "（2）タイプ7 LSAは、明示的に構成されたタイプ7のアドレス範囲に含まれ、計算のルータは、機能的に同等なタイプ5 LSA（すなわち、同じ宛先、コストを発信したNSSAトランスレータの中で最高のルータIDを有していない場合と非ゼロの転送先アドレス）とエリア0とNSSA上到達可能であることは、タイプ5 LSAが生成されなければならないタイプ7 LSAのネットワークに対応するこのルータから発信ないタイプ5 LSAは、現在、存在しない場合、または存在既存のタイプ5 LSAではなく、それは（セクション2.5ステップ（6）、部品（b）および（d）を参照）、そのパスタイプとメトリックあまり好ましくないローカルOSPF外部ソースに対応する、又はそれがないのいずれかとタイプ5 LSAのパスの種類やコスト（複数可）（2.5節の手順を参照してください（5））に変更されたか、転送先アドレスは、もは​​や翻訳可能なタイプ7 LSAにマップされます。"
    },
    {
      "indent": 10,
      "text": "The newly originated Type-5 LSA will describe the same network\nand have the same network mask, path type, metric, forwarding\naddress and external route tag as the Type-7 LSA.  The\nadvertising router field will be the router ID of this NSSA\nborder router.  The link-state ID is equal to the LSA's\nnetwork address (in the case of multiple originations of\nType-5 LSAs with the same network address but different mask,\nthe link-state ID can also have one or more of the network's\n\"host\" bits set).",
      "raw": true
    },
    {
      "indent": 6,
      "text": "(3) Else the Type-7 LSA must be aggregated by the most specific Type-7 address range that subsumes it. If this Type-7 address range has the same [address,mask] pair as the LSA's network and no other translatable Type-7 LSA with a different network best matches this range, then flag the LSA as not contained in any explicitly configured Type-7 address range and process the LSA as described in step (2). Otherwise compute the path type and metric for this Type-7 address range as described below.",
      "ja": "（3）それ以外のタイプ7 LSAはそれを包含する最も特定タイプ7のアドレス範囲によって集約されなければなりません。このタイプ7のアドレス範囲がこの範囲LSAのネットワークと同じ[アドレス、マスク]対となし並進タイプ7 LSA異なるネットワークベストマッチとを有している場合、明示的に構成されたタイプ - に含まれないようにLSAをフラグ7アドレス範囲と工程（2）に記載のようにLSAを処理します。後述のようにそれ以外の場合、このタイプ7のアドレス範囲のパスタイプとメトリックを計算します。"
    },
    {
      "indent": 10,
      "text": "The path type and metric of the Type-7 address range is\ndetermined from the path types and metrics of those\ntranslatable Type-7 LSAs that best match the range plus any\nlocally sourced Type-5 LSAs whose network has the same\n[address,mask] pair.  If any of these LSAs have a path type of\n2, the range's path type is 2, otherwise it is 1.  If the\nrange's path type is 1 its metric is the highest cost amongst\nthese LSAs; if the range's path type is 2 its metric is the\nhighest Type-2 cost + 1 amongst these LSAs.  (See Section 2.5\nstep (5).)  1 is added to the Type-2 cost to ensure that the\ntranslated Type-5 LSA does not appear closer on the NSSA\nborder than a translatable Type-7 LSA whose network has the\nsame [address,mask] pair and Type-2 cost.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "A Type-5 LSA is generated from the Type-7 address range when there is currently no Type-5 LSA originated by this router whose network has the same [address,mask] pair as the range or there is but either its path type or metric has changed or its forwarding address is non-zero.",
      "ja": "いかなるタイプ5 LSAそのネットワーク範囲と同じ[アドレス、マスク]対を有するか、または存在するが、いずれかのパスのタイプ又はこのルータによって発信が現在存在しない場合にタイプ5 LSAはタイプ7のアドレス範囲から生成されますメトリックは変更されているか、その転送先アドレスが非ゼロです。"
    },
    {
      "indent": 10,
      "text": "The newly generated Type-5 LSA will have a link-state ID equal to the Type-7 address range's address (in the case of multiple originations of Type-5 LSAs with the same network address but different mask, the link-state ID can also have one or more of the range's \"host\" bits set). The advertising router field will be the router ID of this area border router. The network mask and the external route tag are set to the range's configured values. The forwarding address is set to 0.0.0.0. The path type and metric are set to the range's path type and metric as defined and computed above.",
      "ja": "新たに生成されたタイプ5 LSAは、同じネットワークアドレスが異なるマスクをタイプ5 LSAの複数オリジネーションの場合にはタイプ7のアドレス範囲のアドレス（リンクステートIDに等しいリンクステートIDができなければなりませんまた、設定した範囲の「ホスト」ビット）の1つ以上を有します。広告ルータフィールドには、このエリア境界ルータのルータIDになります。ネットワークマスク及び外部ルートタグは、範囲の設定された値に設定されています。転送アドレスは0.0.0.0に設定されています。パスタイプとメトリックが定義されるような範囲のパスタイプとメトリックに設定し、上記計算されます。"
    },
    {
      "indent": 10,
      "text": "The pending processing of other translation eligible Type-7 LSAs that best match this Type-7 address range is suppressed. Thus at most a single Type-5 LSA is originated for each Type-7 address range.",
      "ja": "このタイプ7のアドレス範囲が抑制されているベストマッチ他の翻訳対象とタイプ7 LSAの保留処理。従ってせいぜい単一タイプ5 LSAは、各タイプ7のアドレス範囲のために発信されます。"
    },
    {
      "indent": 3,
      "text": "For example, given a Type-7 address range of [10.0.0.0, 255.0.0.0] that subsumes the following Type-7 routes:",
      "ja": "例えば、次のように入力-7ルートを包摂のタイプ7のアドレス範囲[10.0.0.0、255.0.0.0]を与え："
    },
    {
      "indent": 17,
      "text": "10.1.0.0/24 path type 1, cost 10\n10.2.0.0/24 path type 1, cost 11\n10.3.0.0/24 path type 2, type 2 cost 5",
      "raw": true
    },
    {
      "indent": 3,
      "text": "a Type-5 LSA would be generated with a path type of 2 and a metric 6.",
      "ja": "タイプ5 LSAは、2つのパスタイプとメトリック6で生成されます。"
    },
    {
      "indent": 3,
      "text": "Given a Type-7 address range of [10.0.0.0, 255.0.0.0] that subsumes the following Type-7 routes:",
      "ja": "次のタイプ-7ルートを包摂のタイプ7のアドレス範囲[10.0.0.0、255.0.0.0]所与："
    },
    {
      "indent": 17,
      "text": "10.1.0.0/24 path type 1, cost 10\n10.2.0.0/24 path type 1, cost 11\n10.3.0.0/24 path type 1, cost 5",
      "raw": true
    },
    {
      "indent": 3,
      "text": "a Type-5 LSA will be generated with a path type of 1 and a metric 11.",
      "ja": "タイプ5 LSAは、1のパスタイプとメトリック11で生成されます。"
    },
    {
      "indent": 3,
      "text": "These Type-7 address range metric and path type rules will avoid routing loops in the event that path types 1 and 2 are both used within the area.",
      "ja": "これらのタイプ7のアドレス範囲メトリックおよびパスタイプルールはイベント1および2の両方の領域内で使用されるパスの種類をルーティングループを避けることができます。"
    },
    {
      "indent": 3,
      "text": "As with all newly originated Type-5 LSAs, a Type-5 LSA that is the result of a Type-7 LSA translation or aggregation is flooded to all attached Type-5 capable areas.",
      "ja": "全て新しく発信タイプ5のLSA、タイプ7 LSA変換の結果であるか、または凝集が接続されているすべてのタイプ5可能な領域にフラッディングされるタイプ5 LSAと同様。"
    },
    {
      "indent": 3,
      "text": "Like Type-3 address ranges, a Type-7 address range performs the dual function of setting propagation policy via its Advertise/DoNotAdvertise parameter and aggregation via its network address and mask pair. Unlike the origination of Type-3 summary-LSAs, the translation of a Type-7 LSA into a Type-5 LSA may result in more efficient routing when the forwarding address is set, as is done during step (2) of the translation procedure.",
      "ja": "タイプ3のアドレス範囲のように、タイプ7のアドレス範囲は、そのネットワークアドレスとマスクのペアを介して、その広告/ DoNotAdvertiseパラメータと凝集を介して伝播ポリシーを設定するという二重の機能を果たします。タイプ3要約LSAを、転送先アドレスが設定され、より効率的なルーティングをもたらすことができるタイプ5 LSAへのタイプ7 LSAの翻訳の元とは異なり、ステップ（2）の変換手順の間に行われているように。"
    },
    {
      "indent": 3,
      "text": "Another important feature of this translation process is that it allows a Type-7 address range to apply different properties (aggregation, forwarding address, and Advertise/DoNotAdvertise status) for the Type-7 routes it subsumes, versus those Type-7 routes subsumed by other more specific Type-7 address ranges contained in the Type-7 address range.",
      "ja": "この変換プロセスの別の重要な特徴は、それにより包含されるものタイプ7の経路に対して、タイプ7のアドレス範囲は、それが包含するタイプ7ルートの異なる特性適用（集約、転送先アドレスを、および/ DoNotAdvertise状態広告）することを可能にすることです他のより具体的なタイプ7のアドレス範囲はタイプ7のアドレス範囲に含まれます。"
    },
    {
      "indent": 0,
      "text": "3.3 Flushing Translated Type-7 LSAs",
      "section_title": true,
      "ja": "3.3フラッシングが翻訳タイプ7のLSA"
    },
    {
      "indent": 3,
      "text": "If an NSSA border router has either translated or aggregated an installed Type-7 LSA into a Type-5 LSA that should no longer be translated or aggregated, then the Type-5 LSA should either be flushed or reoriginated as a translation or aggregation of other Type-7 LSAs.",
      "ja": "NSSA境界ルータが変換またはもはや翻訳ないまたは凝集されるべきであるタイプ5 LSAにインストールタイプ7 LSAを集約しているいずれかの場合には、タイプ5 LSAは、フラッシュまたは他の翻訳または凝集としてreoriginatedされるべきであるいずれかタイプ7のLSA。"
    },
    {
      "indent": 3,
      "text": "If an NSSA border router is translating Type-7 LSA's into Type-5 LSA's with NSSATranslatorState set to elected and the NSSA border router has determined that its translator election status has been deposed by another NSSA border router (see Section 3.1), then, as soon as the TranslatorStabilityInterval has expired without the router reelecting itself as a translator, Type-5 LSAs that are generated by aggregating Type-7 LSAs into their best matched Type-7 address ranges (see Section 3.2, Step (3)) are flushed. Conversely Type-5 LSAs generated by translating Type-7 LSAs are not immediately flushed, but are allowed to remain in the OSPF routing domain as if the originator is still an elected translator. This minimizes the flushing and flooding impact on the transit topology of an NSSA that changes its translators frequently.",
      "ja": "NSSA境界ルータはタイプ5にタイプ7 LSAの翻訳された場合NSSATranslatorStateとLSAのは、選出さに設定し、NSSA境界ルータは、その翻訳者の選挙の状態のように、そして、（セクション3.1を参照）、別のNSSA境界ルータによって解任されたと判断しましたTranslatorStabilityIntervalは、ルータが翻訳者としての地位をreelectingずに期限が切れているとすぐに、彼らの最高のマッチタイプ7アドレス範囲（3.2節を参照して、ステップ（3））にタイプ7 LSAを集約することにより生成されるタイプ5 LSAがフラッシュされます。逆タイプ7のLSAは直ちにフラッシュされていない変換することによって生成されたのLSA-5を入力したが、発信者がまだ選出翻訳であるかのようにOSPFルーティングドメイン内に残存させています。これは、頻繁にその翻訳者を変更するNSSAのトランジットトポロジ上のフラッシュや洪水の影響を最小限に抑えることができます。"
    },
    {
      "indent": 0,
      "text": "4.0 Security Considerations",
      "section_title": true,
      "ja": "4.0セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are two types of issues that need be addressed when looking at protecting routing protocols from misconfigurations and malicious attacks. The first is authentication and certification of routing protocol information. The second is denial of service attacks resulting from repetitive origination of the same router advertisement or origination of a large number of distinct advertisements resulting in database overflow. Note that both of these concerns exist independently of a router's support for the NSSA option.",
      "ja": "設定ミスや悪意のある攻撃からのルーティングプロトコルの保護を見たときに対処する必要がある問題の2つのタイプがあります。最初は、認証およびルーティングプロトコル情報の認証です。第二は、データベースのオーバーフローを生じる別個の広告の多数の同一のルータ広告または元の繰り返し発信起因するサービス不能攻撃です。これらの懸念の両方がNSSAオプションのルータのサポートとは独立して存在することに注意してください。"
    },
    {
      "indent": 3,
      "text": "The OSPF protocol addresses authentication concerns by authenticating OSPF protocol exchanges. OSPF supports multiple types of authentication; the type of authentication in use can be configured on a per network segment basis. One of OSPF's authentication types, namely the Cryptographic authentication option, is believed to be secure against passive attacks and provides significant protection against active attacks. When using the Cryptographic authentication option, each router appends a \"message digest\" to its transmitted OSPF packets. Receivers then use the shared secret key and the received digest to verify that each received OSPF packet is authentic.",
      "ja": "OSPFプロトコルはOSPFプロトコル交換を認証することで、認証の問題に対処しています。 OSPFは、複数の種類の認証をサポートしています。使用されている認証の種類は、ネットワークセグメントごとに設定することができます。 OSPFの認証タイプ、すなわち暗号認証オプションの一つは、受動的攻撃に対して安全であると考えられ、活発な攻撃に対する有意な保護を提供しています。暗号認証オプションを使用する場合は、各ルータは、その送信されたOSPFパケットに「メッセージダイジェスト」を追加します。レシーバは、各OSPFパケットが本物である受け取ったことを確認するために、共有秘密鍵と受け取ったダイジェストを使用します。"
    },
    {
      "indent": 3,
      "text": "The quality of the security provided by the Cryptographic authentication option depends completely on the strength of the message digest algorithm (MD5 is currently the only message digest algorithm specified), the strength of the key being used, and the correct implementation of the security mechanism in all communicating OSPF implementations. It also requires that all parties maintain the secrecy of the shared secret key. None of the standard OSPF authentication types provide confidentiality, nor do they protect against traffic analysis. For more information on the standard OSPF security mechanisms, see Sections 8.1, 8.2, and Appendix D of [OSPF].",
      "ja": "暗号認証オプションによって提供されるセキュリティの品質は、メッセージダイジェストアルゴリズム（MD5が指定されたダイジェストアルゴリズムを現在唯一のメッセージである）、使用されているキーの強度、およびセキュリティメカニズムの正しい実装の強さに完全に依存しますすべてのOSPFの実装を伝えます。また、すべての関係者が共有秘密鍵の機密性を維持することが必要です。標準のOSPF認証タイプのいずれも機密性を提供しない、また彼らは、トラフィック解析から保護します。標準的なOSPFのセキュリティメカニズムの詳細については、セクション8.1を参照して、8.2、および[OSPF]の付録D。"
    },
    {
      "indent": 3,
      "text": "[DIGI] describes the extensions to OSPF required to add digital signature authentication to Link State data and to provide a certification mechanism for router data. [DIGI] also describes the added LSA processing and key management as well as a method for migration from or co-existence with standard OSPF V2.",
      "ja": "[DIGI]はリンクステートデータにデジタル署名認証を追加すると、ルータのデータのための認証メカニズムを提供するために必要なOSPFの拡張機能について説明します。 【DIGI】も追加LSA処理及び鍵管理ならびに標準的なOSPF V2とからの移行または共存のための方法を記載しています。"
    },
    {
      "indent": 3,
      "text": "OSPF addresses repetitive origination of advertisements by mandating a limit on how frequent new instances of any particular LSA can be originated and accepted during the flooding procedure. The frequency at which new LSA instances may be originated is set to once every MinLSInterval seconds, whose value is 5 seconds. (See [OSPF] Section 12.4.) The frequency at which new LSA instances are accepted during flooding is once every MinLSArrival seconds, whose value is set to 1 second. (See [OSPF] Section 13, Appendix B, and G.1.)",
      "ja": "OSPFは、いずれかの特定のLSAの新しいインスタンスが発祥と氾濫手順の間に受け入れ可能な方法を頻繁に制限を義務付けることにより、広告の繰り返し発信に取り組んでいます。新しいLSAインスタンスが発信される頻度は、その値が5秒ごとに1回MinLSInterval秒に設定されています。 （[OSPF]のセクション12.4を参照。）新しいLSAインスタンスが洪水時に受け付けされる頻度は、一旦その値は1秒に設定されているすべてのMinLSArrival秒、です。 （[OSPF]のセクション13、付録B、及びG.1を参照）。"
    },
    {
      "indent": 3,
      "text": "Proper operation of the OSPF protocol requires that all OSPF routers maintain an identical copy of the OSPF link state database. However, when the size of the link state database becomes very large, some routers may be unable to keep the entire database due to resource shortages; this is termed \"database overflow\". When database overflow is anticipated, the routers with limited resources can be accommodated by configuring OSPF stub areas and NSSAs. [OVERFLOW] details a way of gracefully handling unanticipated database overflows.",
      "ja": "OSPFプロトコルを正しく動作させるには、すべてのOSPFルータがOSPFリンクステートデータベースの同一のコピーを維持することが必要です。しかし、リンク状態データベースのサイズが非常に大きくなったときに、いくつかのルータは、リソース不足にデータベース全体を維持できないことがあります。これは、「データベース・オーバーフロー」と呼ばれています。データベースオーバーフローが予想される場合には、限られたリソースを持つルータがOSPFスタブ領域とあるNSSAを設定することにより対応することができます。 [OVERFLOW]は優雅に予期しないデータベースのオーバーフローを処理する方法を詳しく説明しています。"
    },
    {
      "indent": 0,
      "text": "5.0 Acknowledgements",
      "section_title": true,
      "ja": "5.0謝辞"
    },
    {
      "indent": 3,
      "text": "This document was produced by the OSPF Working Group, chaired by John Moy.",
      "ja": "この文書は、ジョン・モイが議長を務めるOSPFワーキンググループによって製造されました。"
    },
    {
      "indent": 3,
      "text": "In addition, the comments of the following individuals are also acknowledged:",
      "ja": "また、以下の個人のコメントも認めています。"
    },
    {
      "indent": 6,
      "text": "Antoni Przygienda Redback Networks, Inc Alex Zinin cisco",
      "ja": "アントニPrzygiendaレッドバックネットワークス、株式会社アレックスジニンシスコ"
    },
    {
      "indent": 3,
      "text": "It is also noted that comments from",
      "ja": "また、注目されることからのコメント"
    },
    {
      "indent": 6,
      "text": "Phani Jajjarvarpu cisco Dino Farinacci cisco Jeff Honig Cornell University Doug Williams IBM",
      "ja": "Phani JajjarvarpuシスコディーノファリナッチシスコジェフHonigのコーネル大学ダグ・ウィリアムスIBM"
    },
    {
      "indent": 3,
      "text": "were acknowledged in the predecessor of this document, RFC 1587.",
      "ja": "本書の前身、RFC 1587に認められました。"
    },
    {
      "indent": 0,
      "text": "6.0 Contributors",
      "section_title": true,
      "ja": "6.0寄与"
    },
    {
      "indent": 3,
      "text": "This document, RFC 3101, adds new sections, features, edits, and revisions to its predecessor, RFC 1587, \"The OSPF NSSA Option\", authored by Rob Coltun, Movaz Networks, and Vince Fuller. Content from RFC 1587 is used throughout RFC 3101. In addition to adding new features, this document makes the NSSA specification consistent with the OSPFv2 specification, RFC 2328, authored by John Moy, Sycamore Networks, Inc. Section 2.5, Calculating Type-7 AS External Routes, and Section 2.6, Incremental Updates, rely heavily on text in RFC 2328's Section 16.4 and Section 16.6 respectively. Section 4.0, Security Considerations, is an edit of similar content in Rob Coltun's RFC 2370, \"The OSPF Opaque LSA option\", Section 6.0.",
      "ja": "この文書、RFC 3101は、その前身に新しいセクション、機能、編集、およびリビジョンを追加し、RFC 1587、ロブColtun、Movazネットワーク、およびビンスフラー著「OSPF NSSAオプション」、。 RFC 1587からのコンテンツが新しい機能を追加することに加えて、RFC 3101で使用されて、このドキュメントはジョン・モイ、シカモアネットワークス株式会社のセクション2.5が執筆し、OSPFv2の仕様と一致NSSA仕様、RFC 2328を行い、計算タイプ7 AS外部ルート、およびセクション2.6、増分更新は、RFC 2328のセクション16.4とセクションそれぞれ16.6にテキストに大きく依存しています。セクション4.0、セキュリティ上の考慮事項は、ロブColtunのRFC 2370、「OSPF不透明LSAオプション」、セクション6.0で同様のコンテンツの編集です。"
    },
    {
      "indent": 3,
      "text": "Acee Lindem, Redback Networks, Inc, is also recognized for the first full known implementation of this specification. Acee's implementation resulted in substantive content change.",
      "ja": "ACEE Lindem、レッドバックネットワークス社は、また、この仕様の最初の完全な既知の実装のために認識されています。 ACEEの実装は実質的な内容の変更が生じました。"
    },
    {
      "indent": 0,
      "text": "7.0 References",
      "section_title": true,
      "ja": "7.0参考資料"
    },
    {
      "indent": 3,
      "text": "[DIGI] Murphy, S., Badger, M. and B. Wellington, \"OSPF with Digital Signatures\", RFC 2154, June 1997.",
      "ja": "【DIGI】マーフィー、S.、アナグマ、M.およびB.ウェリントン、 \"デジタル署名とOSPF\"、RFC 2154、1997年6月。"
    },
    {
      "indent": 3,
      "text": "[MUEX] Moy, J., \"Multicast Extensions to OSPF\", RFC 1584, March 1994.",
      "ja": "[MUEX]モイ、J.、 \"OSPFへのマルチキャスト拡張機能\"、RFC 1584、1994年3月。"
    },
    {
      "indent": 3,
      "text": "[OSPF] Moy, J., \"OSPF Version 2\", RFC 2328, April 1998.",
      "ja": "[OSPF]モイ、J.、 \"OSPFバージョン2\"、RFC 2328、1998年4月。"
    },
    {
      "indent": 3,
      "text": "[OPAQUE] Coltun, R., \"The OSPF Opaque LSA Option\", RFC 2370, July 1998.",
      "ja": "[OPAQUE] Coltun、R.、 \"OSPF Opaque LSAオプション\"、RFC 2370、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[OVERFLOW] Moy, J., \"OSPF Database Overflow\", RFC 1765, March 1995.",
      "ja": "[OVERFLOW]モイ、J.、 \"OSPFデータベースオーバーフロー\"、RFC 1765、1995年3月。"
    },
    {
      "indent": 0,
      "text": "Appendix A: The Options Field",
      "ja": "付録A：オプションフィールド"
    },
    {
      "indent": 3,
      "text": "The OSPF options field is present in OSPF Hello packets, Database Description packets and all link state advertisements. See [OSPF] Appendix A.2 and [OPAQUE] Appendix A.1 for a description of the options field. Six bits are assigned but only two (the E-bit and the N/P bit) are described completely in this section.",
      "ja": "OSPFオプションフィールドは、OSPF Helloパケット、Database記述パケット、およびすべてのリンク状態アドバタイズメントに存在しています。オプションフィールドの説明については、[OSPF]付録A.2と[OPAQUE]付録A.1を参照してください。 6ビットが割り当てられている2つだけ（E-ビットおよびN / Pビット）本節で完全に記載されています。"
    },
    {
      "indent": 18,
      "text": "--------------------------------------\n| * | O | DC | EA | N/P | MC | E | * |\n--------------------------------------",
      "raw": true
    },
    {
      "indent": 22,
      "text": "The Type-7 LSA options field",
      "ja": "タイプ7 LSAオプションフィールド"
    },
    {
      "indent": 6,
      "text": "E-bit: Type-5 AS-external-LSAs are not flooded into/through OSPF stub areas and NSSAs. The E-bit ensures that all members of a stub area or NSSA agree on that area configuration. The E-bit is meaningful only in OSPF Hello and Database Description packets. When the E-bit is clear in the Hello packet sent out a particular interface, it means that the router will neither send nor receive Type-5 AS-external-LSAs on that interface (in other words, the interface connects to a stub area or NSSA). Two routers will not become neighbors unless they agree on the state of the E-bit.",
      "ja": "E-ビット：タイプ5 ASの外部のLSAはOSPFスタブエリアとあるNSSA経由/へあふれません。 Eビットは、スタブエリアまたはNSSAのすべてのメンバーがその領域の設定に同意することを保証します。 E-ビットはOSPFのHelloおよびデータベース記述パケットに意味があります。 E-ビットは、特定のインターフェイスから送信されるHelloパケットでクリアされている場合、それは、ルータが他の言葉で（そのインターフェイス上でタイプ5 ASの外部のLSAを送信しないでも受け取ることになりますどちらことを意味し、インターフェースは、スタブエリアに接続しますまたはNSSA）。彼らはE-ビットの状態に同意しない限り、2台のルータがネイバーになることはありません。"
    },
    {
      "indent": 6,
      "text": "N-bit: The N-bit describes the router's NSSA capability. The N-bit is used only in Hello packets and ensures that all members of an NSSA agree on that area's configuration. When the N-bit is set in the Hello packet that is sent out a particular interface, it means that the router will send and receive Type-7 LSAs on that interface. Two routers will not form an adjacency unless they agree on the state of the N-bit. If the N-bit is set in the options field, the E-bit must be clear.",
      "ja": "Nビット：Nビットは、ルータのNSSA機能について説明します。 NビットはHelloパケットで使用され、NSSAのすべてのメンバーがその領域の設定に同意することが保証されます。 Nビットは、特定のインターフェイスから送信されるHelloパケットに設定されている場合は、ルータはそのインターフェイス上でタイプ7 LSAを送信および受信することを意味します。彼らはNビットの状態に同意しない限り、2台のルータが隣接関係を形成しないであろう。 Nビットは、オプションフィールドに設定されている場合は、E-ビットが明確でなければなりません。"
    },
    {
      "indent": 6,
      "text": "P-bit: The P-bit is used only in the Type-7 LSA header. It flags the NSSA border router to translate the Type-7 LSA into a Type-5 LSA. The default setting for the P-bit is clear.",
      "ja": "Pビット：Pビットだけタイプ7 LSAヘッダに使用されています。このフラグはタイプ5 LSAにタイプ7 LSAを変換するNSSA境界ルータ。 Pビットのデフォルト設定は明らかです。"
    },
    {
      "indent": 0,
      "text": "Appendix B: Router-LSAs",
      "ja": "付録B：ルータ -  LSAを"
    },
    {
      "indent": 3,
      "text": "Router-LSAs are the Type-1 LSAs. Each router in an area originates a router-LSA. The LSA describes the state and cost of the router's links (i.e., interfaces) to the area. All of the router's links to the area must be described in a single router-LSA. For details concerning the construction of router-LSAs, see [OSPF] Section 12.4.1.",
      "ja": "ルータLSAはタイプ1のLSAです。エリア内の各ルータは、ルータLSAを発信します。 LSAは、エリアにルータのリンク（すなわち、インターフェース）の状態とコストを記述する。地域へのルータのすべてのリンクは、単一のルータ -  LSAに記述する必要があります。ルータLSAの構築に関する詳細については、[OSPF]のセクション12.4.1を参照してください。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            LS age             |     Options   |       1       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                        Link State ID                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     Advertising Router                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                     LS sequence number                        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         LS checksum           |             length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  0  Nt|W|V|E|B|        0      |            # links            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Link ID                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Link Data                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |     # TOS     |        TOS 0 metric           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      TOS      |        0      |            metric             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      TOS      |        0      |            metric             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                          Link ID                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                         Link Data                             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                              ...                              |",
      "raw": true
    },
    {
      "indent": 3,
      "text": "In router-LSAs, the Link State ID field is set to the router's OSPF Router ID. Router-LSAs are flooded throughout a single area only.",
      "ja": "ルータのLSAには、リンクステートIDフィールドは、ルータのOSPFルータIDに設定されています。ルータLSAはただ一つの領域だけ中で水につかっています。"
    },
    {
      "indent": 6,
      "text": "bit V When set, the router is an endpoint of one or more fully adjacent virtual links having the described area as their transit area (V is for virtual link endpoint).",
      "ja": "ビットV、ルータは、その通過領域（Vは、仮想リンクのエンドポイントのためのものである）として記載面積を有する1つまたは複数の完全隣接する仮想リンクの終点設定されている場合。"
    },
    {
      "indent": 6,
      "text": "bit E When set, the router is an AS boundary router (E is for external). ALL NSSA border routers set bit E in those router-LSAs originated into directly attached Type-5 capable areas. An NSSA's AS boundary routers also set bit E in their router-LSAs originated into the NSSA. (See Section 3.1 for details.)",
      "ja": "設定した場合、ビットE、ルータがAS境界ルータ（Eは外部のためである）です。 ALL NSSA境界ルータは、ルータのLSAが直接接続タイプ5可能な領域に由来のものでビットEを設定します。また、そのルータのLSAにビットEを設定NSSAのAS境界ルータはNSSAに始まりました。 （詳細については、3.1節を参照してください。）"
    },
    {
      "indent": 6,
      "text": "bit B When set, the router is an area border router (B is for border).",
      "ja": "ビットB設定した場合、ルータは、境界ルータ（Bボーダーのためのものである）です。"
    },
    {
      "indent": 6,
      "text": "bit W When set, the router is a wild-card multicast receiver (W is for wild).",
      "ja": "セットは、ルータがワイルドカードマルチキャスト受信機である場合にはWビット（Wは野生のためのものです）。"
    },
    {
      "indent": 6,
      "text": "bit Nt When set, the router is an NSSA border router that is unconditionally translating Type-7 LSAs into Type-5 LSAs (Nt stands for NSSA translation). Note that such routers have their NSSATranslatorRole area configuration parameter set to Always. (See Appendix D and Section 3.1.)",
      "ja": "設定した場合のビットNtが、ルータは、無条件タイプ5のLSA（NtはNSSA変換を表す）にタイプ7 LSAを変換さNSSA境界ルータです。ルーターは、そのNSSATranslatorRoleエリアの設定パラメータがAlwaysに設定されていることに注意してください。 （付録Dと第3.1節を参照してください。）"
    },
    {
      "indent": 3,
      "text": "The remainder of the router-LSAs specification is defined in [OSPF] Section A.4.2.",
      "ja": "ルータのLSAの明細書の残りの部分は、[OSPF]セクションA.4.2で規定されています。"
    },
    {
      "indent": 0,
      "text": "Appendix C: Type-7 LSA Packet Format",
      "ja": "付録C：タイプ7 LSAパケットフォーマット"
    },
    {
      "indent": 8,
      "text": "0                                 32\n------------------------------------\n|                | Options |   7   |\n|                -------------------\n|        Link-State Header         |\n|                                  |\n------------------------------------\n| Network Mask                     |\n------------------------------------  ______\n|E| TOS  |        metric           |  .\n------------------------------------  .  repeated for each TOS\n| Forwarding Address               |  .\n------------------------------------  .\n| External Route Tag               |  ______\n------------------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The definitions of the link-state ID, network mask, metrics and external route tag are the same as the definitions for Type-5 LSAs (See [OSPF] Appendix A.4.5), except for the forwarding address and the N/P-bit. The Options field must have the N/P bit set as described in Appendix A when the originating router desires that the external route be propagated throughout the OSPF domain.",
      "ja": "リンクステートID、ネットワークマスク、メトリックと外部ルートタグの定義はタイプ5のLSAの定義と同じである（参照[OSPF]付録A.4.5）転送アドレス及びN / P-を除き、ビット。発信側ルータが外部ルートがOSPFドメイン全体に伝播することを望む場合のオプションフィールドには、付録Aで説明するように設定するN / Pビットを持っている必要があります。"
    },
    {
      "indent": 3,
      "text": "Forwarding address Data traffic for the advertised destination will be forwarded to this address. If the forwarding address is set to 0.0.0.0, data traffic will be forwarded to the LSA's originator (i.e., the responsible NSSA AS boundary router). Normally the next hop address of an installed AS external route learned by an NSSA ASBR from an adjacent AS points at one of the adjacent AS's gateway routers. If this address belongs to a network connected to the NSSA ASBR via one of its NSSAs' active interfaces, then it is the forwarding address for the route's Type-7 LSA originated into this NSSA. For an NSSA with no such network the forwarding address is either an address from one of its active interfaces or 0.0.0.0. If the P-bit is set, the forwarding address must be non-zero, otherwise it may be 0.0.0.0. (See Section 2.3 for details.)",
      "ja": "アドバタイズされた宛先に転送アドレスのデータトラフィックは、このアドレスに転送されます。転送先アドレスが0.0.0.0に設定されている場合は、データトラフィックは、LSAの発信元に転送されます（つまり、責任NSSA AS境界ルータ）。通常、隣接するASのゲートウェイルータの1つに点として隣接からNSSA ASBRで学習した外部ルートとしてインストールの次ホップアドレス。このアドレスがあるNSSAアクティブインタフェースのうちの1つを介してNSSA ASBRに接続されたネットワークに属している場合、それはルートのタイプ7 LSAの転送アドレスがこのNSSAに発信されます。そのようなネットワークとNSSAの転送アドレスは、アクティブなインタフェースの一つまたは0.0.0.0からのアドレスのいずれかです。 Pビットがセットされている場合、転送先アドレスは、それ以外の場合は0.0.0.0であってもよい、非ゼロでなければなりません。 （詳細については、2.3節を参照してください。）"
    },
    {
      "indent": 0,
      "text": "Appendix D: Configuration Parameters",
      "ja": "付録D：設定パラメータ"
    },
    {
      "indent": 3,
      "text": "[OSPF] Appendix C.2 lists the area configuration parameters. The area ID and the list of address ranges for Type-3 summary routes remain unchanged. Section 2.2 of this document lists the configuration parameters for Type-7 address ranges. The following area configuration parameters have been added:",
      "ja": "[OSPF]付録C.2は、地域の設定パラメータを示しています。エリアIDとType-3サマリールートのアドレス範囲のリストは変更されません。このドキュメントのセクション2.2は、Type-7アドレス範囲の設定パラメータを示しています。以下の地域の設定パラメータが追加されました。"
    },
    {
      "indent": 6,
      "text": "NSSATranslatorRole",
      "ja": "NSSATranslatorRole"
    },
    {
      "indent": 9,
      "text": "Specifies whether or not an NSSA border router will unconditionally translate Type-7 LSAs into Type-5 LSAs. When it is set to Always, an NSSA border router always translates Type-7 LSAs into Type-5 LSAs regardless of the translator state of other NSSA border routers. When it is set to Candidate, an NSSA border router participates in the translator election process described in Section 3.1. The default setting is Candidate.",
      "ja": "NSSA境界ルータは、無条件タイプ5のLSAにタイプ7 LSAを変換するかどうかを指定します。それがAlwaysに設定されている場合は、NSSA境界ルータは関係なく、常に他のNSSA境界ルータの翻訳者の状態のタイプ5のLSAに入力し-7をLSAを変換します。それは候補に設定されている場合は、NSSA境界ルータは、3.1節で説明した翻訳者の選定プロセスに参加しています。デフォルトの設定は候補者です。"
    },
    {
      "indent": 6,
      "text": "TranslatorStabilityInterval",
      "ja": "TranslatorStabilityInterval"
    },
    {
      "indent": 9,
      "text": "Defines the length of time an elected Type-7 translator will continue to perform its translator duties once it has determined that its translator status has been deposed by another NSSA border router translator as described in Section 3.1 and 3.3. The default setting is 40 seconds.",
      "ja": "それは、セクション3.1と3.3で説明したように、その翻訳者の状態が別のNSSA境界ルータトランスレータで退陣されたと判断した時点で選出されたタイプ7翻訳者がその翻訳者の職務を行うために続ける時間の長さを定義します。デフォルト設定は40秒です。"
    },
    {
      "indent": 6,
      "text": "ImportSummaries",
      "ja": "ImportSummaries"
    },
    {
      "indent": 9,
      "text": "When set to enabled, OSPF's summary routes are imported into the NSSA as Type-3 summary-LSAs. When set to disabled, summary routes are not imported into the NSSA. The default setting is enabled.",
      "ja": "有効に設定すると、OSPFのサマリールートは、タイプ3要約LSAとしてNSSAにインポートされます。無効に設定すると、サマリールートはNSSAにインポートされません。デフォルトの設定が有効になっています。"
    },
    {
      "indent": 3,
      "text": "Implementations must provide a vehicle for setting the P-bit when external routes are imported into the NSSA as Type-7 LSAs. Without configuration, the default setting of the P-bit is clear. (See Section 2.3 and Appendix B.)",
      "ja": "実装は、外部ルートはタイプ7のLSAとしてNSSAにインポートされたときにPビットを設定するためのビヒクルを提供しなければなりません。設定なしで、Pビットのデフォルト設定は明らかです。 （セクション2.3および付録Bを参照してください）"
    },
    {
      "indent": 3,
      "text": "For NSSAs the ExternalRoutingCapability area configuration parameter must be set to accept Type-7 external routes. Additionally there must be a way of configuring the metric of the default LSA that a border router advertises into its directly attached NSSAs. If a Type-7 default LSA is advertised, its metric type (1 or 2) should also be configurable.",
      "ja": "あるNSSAためExternalRoutingCapability領域設定パラメータは、タイプ7外部ルートを受け入れるように設定されなければなりません。さらに、境界ルータが直接接続されているあるNSSAに広告するデフォルトのLSAのメ​​トリックを設定する方法がなければなりません。タイプ7デフォルトのLSAがアドバタイズされる場合、そのメトリックタイプ（1又は2）にも設定可能でなければなりません。"
    },
    {
      "indent": 0,
      "text": "Appendix E: The P-bit Policy Paradox.",
      "ja": "付録E：P-ビットポリシーパラドックス。"
    },
    {
      "indent": 3,
      "text": "Non-default Type-7 LSAs with the P-bit clear may be installed in the OSPF routing table of NSSA border routers. (See Section 2.5.) These LSAs are not propagated throughout the OSPF domain as translated Type-5 LSAs. (See Section 3.2.) Thus, traffic that is external to an NSSA and that passes through one of the NSSA's border routers may be hijacked into the NSSA by a route installed from a Type-7 LSA with the P-bit clear. This may be contrary to the expected path at the source of the traffic. It may also violate the routing policy intended by the Type-7 LSA's clear P-bit. A Type-7 address range that is configured with DoNotAdvertise exhibits the same paradox for any installed Type-7 LSAs it subsumes, regardless of the P-bit setting.",
      "ja": "クリアPビットを有する非デフォルトタイプ7 LSAはNSSA境界ルータのOSPFルーティングテーブルに設置してもよいです。 （2.5節を参照してください。）これらのLSAは翻訳されたタイプ5のLSAとしてOSPFドメイン全体に伝播されていません。 （3.2節を参照。）したがって、NSSAの外部にあり、それはNSSAのボーダールータの1つを通過するトラフィックはPビットのクリアとタイプ7 LSAからインストール経路でNSSAにハイジャックされてもよいです。これは、トラフィックの送信元で予想されるパスに反するかもしれません。また、タイプ7 LSAの明確なPビッ​​トが意図したルーティングポリシーに違反する可能性があります。 DoNotAdvertiseで構成されているタイプ7のアドレス範囲にかかわらず、Pビットの設定、それが包含する任意インストールタイプ7のLSAに対して同じパラドックスを示します。"
    },
    {
      "indent": 3,
      "text": "This paradox is best illustrated by the following example. Consider an OSPF domain (AS 1842) with connections for default Internet routing and to external AS 4156. NSSA 1 and OSPF Area 2 are partially defined in the following diagram:",
      "ja": "このパラドックスは、最高次の例で示されています。デフォルトのインターネット・ルーティングのための接続を有する（1842）および2が部分的に以下の図で定義されている外部4156. AS NSSA 1およびOSPFエリアにOSPFドメインを考慮する。"
    },
    {
      "indent": 9,
      "text": "                     AS 4156\n                       |\n   Area 2              |\n                       |\n     A2                A0   Area 0      C0-----Internet\n     |                 |                |      Default\n     |                 |                |\n     |                 |                |\n     +-----------------B0---------------+\n                       /\\\n                      /  \\\n                     /    \\\nInternet------------A1    B1------AS 4156 (P-bit clear)\nDefault (P-bit set)\n                        NSSA 1",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Here A0, B0, and C0 are Area 0 routers, A1 and B1 are NSSA 1 routers, and A2 is an Area 2 router. B0 is a border router for both NSSA 1 and Area 2.",
      "ja": "ここではA0、B0、C0とは、エリア0ルータであり、A1とB1はNSSA 1台のルータであり、そしてA2は、エリア2のルータです。 B0はNSSA 1とエリア2の両方の境界ルータです。"
    },
    {
      "indent": 3,
      "text": "If the Type-7 external routes imported by B1 for AS 4156 are installed on B0 so that the NSSA 1 tree below A1 can take advantage of them, then A2's traffic to AS 4156 is hijacked through B0 by B1, rather than its computed path through A0.",
      "ja": "A1以下NSSA 1のツリーはそれらを活用することができるようにAS 4156用B1によってインポートタイプ7外部ルートがB0にインストールされている場合は、AS 4156にA2のトラフィックはかなりを通じてその計算された経路よりも、B1によりB0によってハイジャックされましたA0。"
    },
    {
      "indent": 3,
      "text": "An NSSA border router's installed Type-7 default LSAs will exhibit this paradox when it possesses a Type-7 address range [0,0] configured with DoNotAdvertise, as these LSAs are not propagated even though their P-bit is set. In the example above, if A1's default is installed on B0, which has a configured Type-7 address range [0,0] with DoNotAdvertise set, then A2's Internet traffic is hijacked through B0 by A1 rather than the computed path through C0.",
      "ja": "それはDoNotAdvertiseで構成されたタイプ7のアドレス範囲[0,0]を有しているときに、これらのLSAが自分のPビットがセットされているにもかかわらず、伝播されないようNSSA境界ルータの設置タイプ7デフォルトのLSAは、このパラドックスを示すであろう。 A1のデフォルトが設定タイプ7のアドレス範囲[0,0] DoNotAdvertiseのセットとを有するB0、上にインストールされている場合、上記の例では、次にA2のインターネットトラフィックは、C0を介してA1によってB0なく計算された経路を介してハイジャックされています。"
    },
    {
      "indent": 0,
      "text": "Appendix F: Differences from RFC 1587",
      "ja": "付録F：RFC 1587との違い"
    },
    {
      "indent": 3,
      "text": "This section documents the differences between this memo and RFC 1587. All differences are backward-compatible. Implementations of this memo and of RFC 1587 will interoperate.",
      "ja": "このセクションでは、すべての違いは、下位互換性があり、このメモとRFC 1587との違いを説明します。このメモのとRFC 1587の実装は、相互運用します。"
    },
    {
      "indent": 0,
      "text": "F.1 Enhancements to the import of OSPF's summary routes.",
      "ja": "OSPFのサマリールートの輸入にF.1強化。"
    },
    {
      "indent": 3,
      "text": "The import of OSPF's summary routes into an NSSA as Type-3 summary-LSAs is now optional. In RFC 1587 the import of summary routes was mandated in order to guarantee that inter-area summary routing was not obscured by an NSSA's Type-7 AS-external-LSAs. The current recommended default behavior is to import summary routes. When summary routes are not imported into an NSSA, the default LSA originated by its border routers must be a Type-3 summary-LSA.",
      "ja": "タイプ3要約LSAとしてNSSAにOSPFのサマリールートの輸入はオプションになりました。 RFC 1587でサマリールートのインポートは、エリア間のサマリールーティングがASの外部のLSAをNSSAのタイプ7で隠されていないことを保証するために義務付けられました。現在推奨されるデフォルトの動作では、サマリールートをインポートすることです。サマリールートはNSSAにインポートされていない場合は、その境界ルータによって発信デフォルトLSAはタイプ3要約LSAでなければなりません。"
    },
    {
      "indent": 3,
      "text": "See Sections 1.3 and 2.7 for details.",
      "ja": "セクションに詳細については、1.3と2.7を参照してください。"
    },
    {
      "indent": 0,
      "text": "F.2 Changes to Type-7 LSAs.",
      "ja": "タイプ7 LSAをするF.2変更。"
    },
    {
      "indent": 3,
      "text": "The setting of the forwarding address in Type-7 LSAs has been further refined.",
      "ja": "タイプ7のLSAでの転送アドレスの設定は、さらに洗練されています。"
    },
    {
      "indent": 3,
      "text": "See Section 2.3 for details.",
      "ja": "詳細については、2.3節を参照してください。"
    },
    {
      "indent": 0,
      "text": "F.3 Changes to the Type-7 AS external routing calculation.",
      "ja": "外部ルーティング計算ASタイプ-7にF.3変更。"
    },
    {
      "indent": 3,
      "text": "The Type-7 external route calculation has been revised. Most notably:",
      "ja": "タイプ7外部ルート計算が改訂されました。最も顕著なのは："
    },
    {
      "indent": 6,
      "text": "o The path preference defined in [OSPF] Section 16.4.1 has been included.",
      "ja": "で定義されたパス優先O [OSPF]のセクション16.4.1が含まれています。"
    },
    {
      "indent": 6,
      "text": "o A Type-7 default route with the P-bit clear will not be installed on an NSSA border router. This protects the default routing of other OSPF Areas. (See Appendix E.)",
      "ja": "O明確なPビッ​​トとタイプ7のデフォルトルートをNSSA境界ルータにインストールされません。これは、他のOSPFエリアのデフォルトルーティングを保護します。 （付録Eを参照してください）"
    },
    {
      "indent": 6,
      "text": "o The LSA type of two AS-external-LSAs plays no role in determining path preference except when the LSAs are functionally the same (i.e., same destination, cost and non-zero forwarding address).",
      "ja": "O 2 AS-外部LSAのLSAタイプは、LSAのは、機能的に同じ（すなわち、同一の宛先、コスト及び非ゼロの転送先アドレス）である場合を除き、パス優先度を決定する際に何の役割も果たしません。"
    },
    {
      "indent": 3,
      "text": "See Section 2.5 for details.",
      "ja": "詳細については、2.5節を参照してください。"
    },
    {
      "indent": 0,
      "text": "F.4 Changes to translating Type-7 LSAs into Type-5 LSAs",
      "ja": "タイプ5のLSAにタイプ7 LSAを変換するにF.4変更"
    },
    {
      "indent": 3,
      "text": "The translator election algorithm of RFC 1587 has been updated to close a bug that results when the translator with the highest router ID loses connectivity to the AS's transit topology. The default translator election process occurs only in the absence of an existing translator.",
      "ja": "RFC 1587の翻訳者の選出アルゴリズムは、最高のルータIDを持つ翻訳者がASのトランジットトポロジへの接続を失ったときに生じるバグをクローズするように更新されました。デフォルトの翻訳者の選出プロセスは、既存の翻訳者が存在しない場合に発生します。"
    },
    {
      "indent": 3,
      "text": "The identity of the translator is optionally configurable, with more than one allowed. This allows the network designer to choose the most cost effective intra-AS route for NSSA originated Type-5 LSA aggregations of Type-7 LSAs.",
      "ja": "翻訳者の身元は許さつ以上で、必要に応じて設定可能です。これは、ネットワーク設計者は、NSSAのための最もコスト効率のイントラASルートはタイプ7 LSAのタイプ5 LSAの集計を発し選択することができます。"
    },
    {
      "indent": 3,
      "text": "Self-originated non-default Type-7 LSAs are now included in the translation process.",
      "ja": "自己起源デフォルト以外のタイプ7 LSAは今、翻訳プロセスに含まれています。"
    },
    {
      "indent": 3,
      "text": "The translation process has been strengthened to close some of the weak points of RFC 1587.",
      "ja": "翻訳プロセスは、RFC 1587の弱点の一部を閉じるように強化されています。"
    },
    {
      "indent": 3,
      "text": "See Sections 3.1 and 3.2 for details.",
      "ja": "セクションに詳細については、3.1と3.2を参照してください。"
    },
    {
      "indent": 0,
      "text": "F.5 Changes to flushing translated Type-7 LSAs",
      "ja": "F.5変更は、タイプ7 LSAを翻訳フラッシング"
    },
    {
      "indent": 3,
      "text": "An NSSA border router, which was elected by the augmented RFC 1587 translator selection process defined in Section 3.1 and which has been deposed from its translation duties by another NSSA border router, flushes its self-originated Type-5 LSAs that resulted from the aggregation of Type-7 LSAs. This prevents these obsolete aggregations from short circuiting the preferred path through the new translator(s). A deposed translator continues to maintain its self-originated Type-5 LSAs resulting from translation until they age out normally.",
      "ja": "3.1節で定義された拡張RFC 1587の翻訳者選定プロセスにより選出されたNSSA境界ルータは、別NSSA境界ルータによって、その翻訳業務から解任された、の凝集に起因する自己発信型-5のLSAをフラッシュタイプ7のLSA。これは、短い新しい翻訳者（複数可）を介して好ましい経路を短絡からこれら時代遅れの凝集を防止します。退陣翻訳者は、彼らが正常にエージングアウトするまで換算から生じる自己発信型-5 LSAを維持し続けています。"
    },
    {
      "indent": 3,
      "text": "See Section 3.3 for details.",
      "ja": "詳細については、3.3節を参照してください。"
    },
    {
      "indent": 0,
      "text": "F.6 P-bit additions",
      "ja": "F.6 Pビット加算"
    },
    {
      "indent": 3,
      "text": "The P-bit default has been defined as clear. RFC 1587 had no default setting. (See Appendix C.)",
      "ja": "Pビットのデフォルトは明らかのように定義されています。 RFC 1587にはデフォルト設定がありませんでした。 （付録Cを参照してください）"
    },
    {
      "indent": 3,
      "text": "A discussion on the packet forwarding impact of installing Type-7 LSAs with the P-bit clear on NSSA border routers has been added as Appendix E.",
      "ja": "NSSA境界ルータにクリアPビットとタイプ7 LSAをインストールするパケット転送影響に関する議論は、付録Eとして追加されています"
    },
    {
      "indent": 0,
      "text": "Author's Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Pat Murphy US Geological Survey 345 Middlefield Road Menlo Park, California 94560",
      "ja": "パット・マーフィー米国地質調査所345ミドルロードメンロパーク、カリフォルニア州94560"
    },
    {
      "indent": 3,
      "text": "Phone: (650) 329-4044 EMail: pmurphy@noc.usgs.net",
      "ja": "電話：（650）329-4044 Eメール：pmurphy@noc.usgs.net"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}