{
  "title": {
    "text": "RFC 3850 - Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.1 Certificate Handling",
    "ja": "RFC 3850 - Secure/Multipurposeインターネットメール拡張機能（S/MIME）バージョン3.1証明書処理"
  },
  "number": 3850,
  "created_at": "2023-09-14 05:17:40.227820+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                B. Ramsdell, Editor\nRequest for Comments: 3850                                Sendmail, Inc.\nObsoletes: 2632                                                July 2004\nCategory: Standards Track",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.1 Certificate Handling",
      "ja": "Secure/Multipurposeインターネットメール拡張機能（S/MIME）バージョン3.1証明書処理"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（c）The Internet Society（2004）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document specifies conventions for X.509 certificate usage by Secure/Multipurpose Internet Mail Extensions (S/MIME) agents. S/MIME provides a method to send and receive secure MIME messages, and certificates are an integral part of S/MIME agent processing. S/MIME agents validate certificates as described in RFC 3280, the Internet X.509 Public Key Infrastructure Certificate and CRL Profile. S/MIME agents must meet the certificate processing requirements in this document as well as those in RFC 3280.",
      "ja": "このドキュメントは、Secure/Multipurpose Internet Mail Extensions（S/MIME）エージェントによるX.509証明書の使用に関する規則を指定します。S/MIMEは、安全なMIMEメッセージを送信および受信する方法を提供し、証明書はS/MIMEエージェント処理の不可欠な部分です。S/MIMEエージェントは、RFC 3280、インターネットX.509公開キーインフラストラクチャ証明書およびCRLプロファイルで説明されているように証明書を検証します。S/MIMEエージェントは、このドキュメントの証明書処理要件とRFC 3280の要件を満たす必要があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Overview . . . . . . . . . . . . . . . . . . . . . . . . . . .  2\n    1.1.  Definitions. . . . . . . . . . . . . . . . . . . . . . .  2\n    1.2.  Compatibility with Prior Practice of S/MIME. . . . . . .  3\n    1.3.  Terminology. . . . . . . . . . . . . . . . . . . . . . .  3\n    1.4.  Changes Since S/MIME v3 (RFC 2632) . . . . . . . . . . .  3\n2.  CMS Options. . . . . . . . . . . . . . . . . . . . . . . . . .  4\n    2.1 . CertificateRevocationLists . . . . . . . . . . . . . . .  4\n    2.2.  CertificateChoices . . . . . . . . . . . . . . . . . . .  4\n    2.3.  CertificateSet . . . . . . . . . . . . . . . . . . . . .  5\n3. Using Distinguished Names for Internet Mail . . . . . . . . . .  6\n4.  Certificate Processing . . . . . . . . . . . . . . . . . . . .  7\n    4.1.  Certificate Revocation Lists . . . . . . . . . . . . . .  8\n    4.2.  Certification Path Validation. . . . . . . . . . . . . .  8\n    4.3.  Certificate and CRL Signing Algorithms . . . . . . . . .  9\n       4.4.  PKIX Certificate Extensions. . . . . . . . . . . . . . .  9\n5.  Security Considerations. . . . . . . . . . . . . . . . . . . . 11\nA.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n    A.1.  Normative References . . . . . . . . . . . . . . . . . . 13\n    A.2.  Informative References . . . . . . . . . . . . . . . . . 14\nB.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 15\nC.  Editor's Address . . . . . . . . . . . . . . . . . . . . . . . 15\nFull Copyright Statement . . . . . . . . . . . . . . . . . . . . . 16",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1. 概要"
    },
    {
      "indent": 3,
      "text": "S/MIME (Secure/Multipurpose Internet Mail Extensions), described in [SMIME-MSG], provides a method to send and receive secure MIME messages. Before using a public key to provide security services, the S/MIME agent MUST verify that the public key is valid. S/MIME agents MUST use PKIX certificates to validate public keys as described in the Internet X.509 Public Key Infrastructure (PKIX) Certificate and CRL Profile [KEYM]. S/MIME agents MUST meet the certificate processing requirements documented in this document in addition to those stated in [KEYM].",
      "ja": "[SMIME-MSG]に記載されているS/MIME（Secure/Multipurpose Internet Mail拡張機能）は、安全なMIMEメッセージを送信および受信する方法を提供します。公開キーを使用してセキュリティサービスを提供する前に、S/MIMEエージェントは公開キーが有効であることを確認する必要があります。S/MIMEエージェントは、PKIX証明書を使用して、インターネットX.509公開キーインフラストラクチャ（PKIX）証明書とCRLプロファイル[KEYM]に記載されているように、パブリックキーを検証する必要があります。S/MIMEエージェントは、[keym]に記載されているものに加えて、このドキュメントに文書化された証明書処理要件を満たす必要があります。"
    },
    {
      "indent": 3,
      "text": "This specification is compatible with the Cryptographic Message Syntax [CMS] in that it uses the data types defined by CMS. It also inherits all the varieties of architectures for certificate-based key management supported by CMS.",
      "ja": "この仕様は、CMSで定義されたデータ型を使用するという点で、暗号化メッセージ構文[CMS]と互換性があります。また、CMSがサポートする証明書ベースのキー管理のために、すべての品種のアーキテクチャを継承しています。"
    },
    {
      "indent": 0,
      "text": "1.1. Definitions",
      "section_title": true,
      "ja": "1.1. 定義"
    },
    {
      "indent": 3,
      "text": "For the purposes of this document, the following definitions apply.",
      "ja": "このドキュメントの目的のために、次の定義が適用されます。"
    },
    {
      "indent": 3,
      "text": "ASN.1: Abstract Syntax Notation One, as defined in ITU-T X.208 [X.208-88].",
      "ja": "ASN.1：ITU-T X.208 [X.208-88]で定義されている要約構文表記1。"
    },
    {
      "indent": 3,
      "text": "Attribute Certificate (AC): An X.509 AC is a separate structure from a subject's public key X.509 Certificate. A subject may have multiple X.509 ACs associated with each of its public key X.509 Certificates. Each X.509 AC binds one or more Attributes with one of the subject's public key X.509 Certificates. The X.509 AC syntax is defined in [ACAUTH].",
      "ja": "属性証明書（AC）：X.509 ACは、被験者の公開キーX.509証明書とは別の構造です。被験者は、それぞれの公開キーX.509証明書に関連付けられている複数のX.509 ACSを持っている場合があります。各X.509 ACは、被験者の公開キーX.509証明書の1つに1つ以上の属性を結合します。X.509 AC構文は[Acauth]で定義されています。"
    },
    {
      "indent": 3,
      "text": "Certificate: A type that binds an entity's name to a public key with a digital signature. This type is defined in the Internet X.509 Public Key Infrastructure (PKIX) Certificate and CRL Profile [KEYM]. This type also contains the distinguished name of the certificate issuer (the signer), an issuer-specific serial number, the issuer's signature algorithm identifier, a validity period, and extensions also defined in that document.",
      "ja": "証明書：エンティティの名前をデジタル署名を使用して公開キーにバインドするタイプ。このタイプは、インターネットx.509公開キーインフラストラクチャ（PKIX）証明書とCRLプロファイル[Keym]で定義されています。このタイプには、証明書発行者（署名者）の著名な名前、発行者固有のシリアル番号、発行者の署名アルゴリズム識別子、有効期間、およびその文書で定義されている拡張も含まれています。"
    },
    {
      "indent": 3,
      "text": "Certificate Revocation List (CRL): A type that contains information about certificates whose validity an issuer has prematurely revoked. The information consists of an issuer name, the time of issue, the next scheduled time of issue, a list of certificate serial numbers and their associated revocation times, and extensions as defined in [KEYM]. The CRL is signed by the issuer. The type intended by this specification is the one defined in [KEYM].",
      "ja": "証明書取消リスト（CRL）：発行者が早期に取り消した有効性の証明書に関する情報を含むタイプ。情報は、発行者名、発行時間、次のスケジュールされた問題の時間、証明書のシリアル番号のリストと関連する取り消し時間、および[keym]で定義されている拡張で構成されています。CRLは発行者によって署名されています。この仕様で意図されたタイプは、[keym]で定義されているものです。"
    },
    {
      "indent": 3,
      "text": "Receiving agent: software that interprets and processes S/MIME CMS objects, MIME body parts that contain CMS objects, or both.",
      "ja": "受信エージェント：S/MIME CMSオブジェクト、CMSオブジェクトを含むMIMEボディパーツ、またはその両方を解釈および処理するソフトウェア。"
    },
    {
      "indent": 3,
      "text": "Sending agent: software that creates S/MIME CMS objects, MIME body parts that contain CMS objects, or both.",
      "ja": "送信エージェント：S/MIME CMSオブジェクト、CMSオブジェクトを含むMIMEボディパーツ、またはその両方を作成するソフトウェア。"
    },
    {
      "indent": 3,
      "text": "S/MIME agent: user software that is a receiving agent, a sending agent, or both.",
      "ja": "S/MIMEエージェント：受信エージェント、送信エージェント、またはその両方であるユーザーソフトウェア。"
    },
    {
      "indent": 0,
      "text": "1.2. Compatibility with Prior Practice of S/MIME",
      "section_title": true,
      "ja": "1.2. S/MIMEの事前の練習との互換性"
    },
    {
      "indent": 3,
      "text": "S/MIME version 3.1 agents should attempt to have the greatest interoperability possible with agents for prior versions of S/MIME. S/MIME version 2 is described in RFC 2311 through RFC 2315, inclusive and S/MIME version 3 is described in RFC 2630 through RFC 2634 inclusive. RFC 2311 also has historical information about the development of S/MIME.",
      "ja": "S/MIMEバージョン3.1エージェントは、S/MIMEの以前のバージョンのエージェントと可能な限り最大の相互運用性を持つことを試みる必要があります。S/MIMEバージョン2はRFC 2311からRFC 2315で説明されています。インクルーシブおよびS/MIMEバージョン3は、RFC 2630からRFC 2634 Inclusiveで説明されています。RFC 2311には、S/MIMEの開発に関する歴史的情報もあります。"
    },
    {
      "indent": 0,
      "text": "1.3. Terminology",
      "section_title": true,
      "ja": "1.3. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [MUSTSHOULD].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「「しない」、「そうでない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、[必須]に記載されているように解釈される。"
    },
    {
      "indent": 0,
      "text": "1.4. Changes Since S/MIME v3 (RFC 2632)",
      "section_title": true,
      "ja": "1.4. S/MIMEV3以降の変更（RFC 2632）"
    },
    {
      "indent": 3,
      "text": "Version 1 and Version 2 CRLs MUST be supported.",
      "ja": "バージョン1およびバージョン2 CRLをサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "Multiple CA certificates with the same subject and public key, but with overlapping validity periods, MUST be supported.",
      "ja": "同じ主題と公開鍵を持つが、妥当性のある期間があるが、複数のCA証明書をサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "Version 2 attribute certificates SHOULD be supported, and version 1 attributes certificates MUST NOT be used.",
      "ja": "バージョン2属性証明書をサポートする必要があり、バージョン1属性証明書を使用しないでください。"
    },
    {
      "indent": 3,
      "text": "The use of the MD2 digest algorithm for certificate signatures is discouraged and security language added.",
      "ja": "証明書署名のためにMD2 Digestアルゴリズムの使用は落胆し、セキュリティ言語が追加されています。"
    },
    {
      "indent": 3,
      "text": "Clarified use of email address use in certificates. Certificates that do not contain an email address have no requirements for verifying the email address associated with the certificate.",
      "ja": "証明書での電子メールアドレスの使用を明確に使用します。電子メールアドレスが含まれていない証明書には、証明書に関連付けられた電子メールアドレスを確認するための要件はありません。"
    },
    {
      "indent": 3,
      "text": "Receiving agents SHOULD display certificate information when displaying the results of signature verification.",
      "ja": "受信エージェントは、署名検証の結果を表示するときに証明書情報を表示する必要があります。"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST NOT accept a signature made with a certificate that does not have the digitalSignature or nonRepudiation bit set.",
      "ja": "受信エージェントは、DigitalSignatureまたは非控除ビットセットを持たない証明書で作成された署名を受け入れてはなりません。"
    },
    {
      "indent": 3,
      "text": "Clarifications for the interpretation of the key usage and extended key usage extensions.",
      "ja": "主要な使用法と拡張された主要な使用法拡張の解釈の説明。"
    },
    {
      "indent": 0,
      "text": "2. CMS Options",
      "section_title": true,
      "ja": "2. CMSオプション"
    },
    {
      "indent": 3,
      "text": "The CMS message format allows for a wide variety of options in content and algorithm support. This section puts forth a number of support requirements and recommendations in order to achieve a base level of interoperability among all S/MIME implementations. Most of the CMS format for S/MIME messages is defined in [SMIME-MSG].",
      "ja": "CMSメッセージ形式では、コンテンツとアルゴリズムのサポートにさまざまなオプションが可能になります。このセクションでは、すべてのS/MIME実装の間で相互運用性の基本レベルを達成するために、多くのサポート要件と推奨事項を示します。S/MIMEメッセージのCMS形式のほとんどは、[Smime-MSG]で定義されています。"
    },
    {
      "indent": 0,
      "text": "2.1. CertificateRevocationLists",
      "section_title": true,
      "ja": "2.1. cirtimateRevocationLists"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST support the Certificate Revocation List (CRL) format defined in [KEYM]. If sending agents include CRLs in outgoing messages, the CRL format defined in [KEYM] MUST be used. In all cases, both v1 and v2 CRLs MUST be supported.",
      "ja": "受信エージェントは、[keym]で定義されている証明書取消リスト（CRL）形式をサポートする必要があります。送信エージェントが発信メッセージにCRLを含める場合、[keym]で定義されたCRL形式を使用する必要があります。すべての場合において、V1とV2 CRLの両方をサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "All agents MUST be capable of performing revocation checks using CRLs as specified in [KEYM]. All agents MUST perform revocation status checking in accordance with [KEYM]. Receiving agents MUST recognize CRLs in received S/MIME messages.",
      "ja": "すべてのエージェントは、[keym]で指定されているように、CRLを使用して取り消しチェックを実行できる必要があります。すべてのエージェントは、[keym]に従って取り消しステータスチェックを実行する必要があります。受信エージェントは、受信したS/MIMEメッセージでCRLを認識する必要があります。"
    },
    {
      "indent": 3,
      "text": "Agents SHOULD store CRLs received in messages for use in processing later messages.",
      "ja": "エージェントは、後のメッセージの処理で使用するためにメッセージに受信されたCRLSを保存する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.2. CertificateChoices",
      "section_title": true,
      "ja": "2.2. CertificateChoices"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST support v1 X.509 and v3 X.509 identity certificates as profiled in [KEYM]. End entity certificates MAY include an Internet mail address, as described in section 3.",
      "ja": "受信エージェントは、[keym]でプロファイルされているように、v1 x.509およびv3 x.509のアイデンティティ証明書をサポートする必要があります。セクション3で説明されているように、エンティティ証明書の終了には、インターネットメールアドレスが含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "Receiving agents SHOULD support X.509 version 2 attribute certificates. See [ACAUTH] for details about the profile for attribute certificates.",
      "ja": "受信エージェントは、X.509バージョン2属性証明書をサポートする必要があります。属性証明書のプロファイルの詳細については、[acauth]を参照してください。"
    },
    {
      "indent": 0,
      "text": "2.2.1. Historical Note About CMS Certificates",
      "section_title": true,
      "ja": "2.2.1. CMS証明書に関する履歴メモ"
    },
    {
      "indent": 3,
      "text": "The CMS message format supports a choice of certificate formats for public key content types: PKIX, PKCS #6 Extended Certificates [PKCS6] and PKIX Attribute Certificates.",
      "ja": "CMSメッセージ形式は、公開キーコンテンツタイプの証明書形式の選択をサポートしています：PKIX、PKCS＃6拡張証明書[PKCS6]およびPKIX属性証明書。"
    },
    {
      "indent": 3,
      "text": "The PKCS #6 format is not in widespread use. In addition, PKIX certificate extensions address much of the same functionality and flexibility as was intended in the PKCS #6. Thus, sending and receiving agents MUST NOT use PKCS #6 extended certificates.",
      "ja": "PKCS＃6形式は広く使用されていません。さらに、PKIX証明書拡張機能は、PKCS＃6で意図されていたのと同じ機能と柔軟性の多くに対応しています。したがって、送信および受信エージェントは、PKCS＃6拡張証明書を使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "X.509 version 1 attribute certificates are also not widely implemented, and have been superseded with version 2 attribute certificates. Sending agents MUST NOT send version 1 attribute certificates.",
      "ja": "X.509バージョン1属性証明書も広く実装されておらず、バージョン2属性証明書に取って代わられています。送信エージェントは、バージョン1属性証明書を送信してはなりません。"
    },
    {
      "indent": 0,
      "text": "2.3. CertificateSet",
      "section_title": true,
      "ja": "2.3. 証明書セット"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST be able to handle an arbitrary number of certificates of arbitrary relationship to the message sender and to each other in arbitrary order. In many cases, the certificates included in a signed message may represent a chain of certification from the sender to a particular root. There may be, however, situations where the certificates in a signed message may be unrelated and included for convenience.",
      "ja": "受信エージェントは、メッセージ送信者と互いに任意の順序で任意の関係の証明書を任意に処理できる必要があります。多くの場合、署名されたメッセージに含まれる証明書は、送信者から特定のルートへの認証チェーンを表す場合があります。ただし、署名されたメッセージ内の証明書が無関係であり、利便性のために含まれる可能性のある状況がある場合があります。"
    },
    {
      "indent": 3,
      "text": "Sending agents SHOULD include any certificates for the user's public key(s) and associated issuer certificates. This increases the likelihood that the intended recipient can establish trust in the originator's public key(s). This is especially important when sending a message to recipients that may not have access to the sender's public key through any other means or when sending a signed message to a new recipient. The inclusion of certificates in outgoing messages can be omitted if S/MIME objects are sent within a group of correspondents that has established access to each other's certificates by some other means such as a shared directory or manual certificate distribution. Receiving S/MIME agents SHOULD be able to handle messages without certificates using a database or directory lookup scheme.",
      "ja": "送信エージェントには、ユーザーの公開キーおよび関連する発行者証明書の証明書を含める必要があります。これにより、意図した受信者が発信者の公開鍵に対する信頼を確立できる可能性が高まります。これは、他の手段を通じて送信者の公開鍵にアクセスできない可能性のある受信者にメッセージを送信したり、新しい受信者に署名されたメッセージを送信する場合に特に重要です。発信メッセージに証明書を含めることは、共有ディレクトリや手動証明書の配布など、他の手段によって互いの証明書へのアクセスを確立した特派員のグループ内で送信される場合、省略できます。S/MIMEエージェントの受信は、データベースまたはディレクトリルックアップスキームを使用して証明書なしでメッセージを処理できる必要があります。"
    },
    {
      "indent": 3,
      "text": "A sending agent SHOULD include at least one chain of certificates up to, but not including, a Certificate Authority (CA) that it believes that the recipient may trust as authoritative. A receiving agent MUST be able to handle an arbitrarily large number of certificates and chains.",
      "ja": "送信エージェントには、受信者が権威あると信頼できると考えている証明書当局（CA）までの証明書の少なくとも1つのチェーンを含める必要があります。受信エージェントは、任意に多数の証明書とチェーンを処理できる必要があります。"
    },
    {
      "indent": 3,
      "text": "Agents MAY send CA certificates, that is, certificates which can be considered the \"root\" of other chains, and which MAY be self-signed. Note that receiving agents SHOULD NOT simply trust any self-signed certificates as valid CAs, but SHOULD use some other mechanism to determine if this is a CA that should be trusted. Also note that when certificates contain DSA public keys the parameters may be located in the root certificate. This would require that the recipient possess both the end-entity certificate as well as the root certificate to perform a signature verification, and is a valid example of a case where transmitting the root certificate may be required.",
      "ja": "エージェントは、CA証明書、つまり他のチェーンの「ルート」と見なされ、自己署名される可能性のある証明書を送信する場合があります。受信エージェントは、有効なCAとして自己署名された証明書を単に信頼するだけでなく、他のメカニズムを使用して、これが信頼されるべきCAであるかどうかを判断する必要があることに注意してください。また、証明書にDSAパブリックキーが含まれている場合、パラメーターはルート証明書に配置される場合があることに注意してください。これには、受信者が署名検証を実行するためにエンドエンティティ証明書とルート証明書の両方を所有する必要があり、ルート証明書を送信する必要がある場合の有効な例です。"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST support chaining based on the distinguished name fields. Other methods of building certificate chains MAY be supported.",
      "ja": "受信エージェントは、著名な名前フィールドに基づいてチェーンをサポートする必要があります。証明書チェーンを構築する他の方法がサポートされる場合があります。"
    },
    {
      "indent": 3,
      "text": "Receiving agents SHOULD support the decoding of X.509 attribute certificates included in CMS objects. All other issues regarding the generation and use of X.509 attribute certificates are outside of the scope of this specification. One specification that addresses attribute certificate use is defined in [SECLABEL].",
      "ja": "受信エージェントは、CMSオブジェクトに含まれるX.509属性証明書のデコードをサポートする必要があります。X.509属性証明書の生成と使用に関する他のすべての問題は、この仕様の範囲外です。属性証明書の使用に対処する1つの仕様は、[Seclabel]で定義されています。"
    },
    {
      "indent": 0,
      "text": "3. Using Distinguished Names for Internet Mail",
      "section_title": true,
      "ja": "3. インターネットメールに著名な名前を使用します"
    },
    {
      "indent": 3,
      "text": "End-entity certificates MAY contain an Internet mail address as described in [RFC-2822]. The address must be an \"addr-spec\" as defined in Section 3.4.1 of that specification. The email address SHOULD be in the subjectAltName extension, and SHOULD NOT be in the subject distinguished name.",
      "ja": "エンディティ証明書には、[RFC-2822]に記載されているように、インターネットメールアドレスが含まれる場合があります。アドレスは、その仕様のセクション3.4.1で定義されている「addr-spec」でなければなりません。メールアドレスはsubjectaltname拡張機能にあるべきであり、件名の著名な名前にないようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "Receiving agents MUST recognize and accept certificates that contain no email address. Agents are allowed to provide an alternative mechanism for associating an email address with a certificate that does not contain an email address, such as through the use of the agent's address book, if available. Receiving agents MUST recognize email addresses in the subjectAltName field. Receiving agents MUST recognize email addresses in the Distinguished Name field in the PKCS #9 [PKCS9] emailAddress attribute:",
      "ja": "受信エージェントは、電子メールアドレスを含む証明書を認識して受け入れる必要があります。エージェントは、利用可能な場合、エージェントのアドレス帳の使用など、電子メールアドレスを含む証明書に電子メールアドレスを関連付けるための代替メカニズムを提供することができます。受信エージェントは、subjectaltnameフィールドのメールアドレスを認識する必要があります。受信エージェントは、PKCS＃9 [PKCS9] emailAddress属性の著名な名前フィールドで電子メールアドレスを認識する必要があります。"
    },
    {
      "indent": 3,
      "text": "pkcs-9-at-emailAddress OBJECT IDENTIFIER ::=\n  {iso(1) member-body(2) us(840) rsadsi(113549) pkcs(1) pkcs-9(9) 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Note that this attribute MUST be encoded as IA5String.",
      "ja": "この属性はia5stringとしてエンコードする必要があることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Sending agents SHOULD make the address in the From or Sender header in a mail message match an Internet mail address in the signer's certificate. Receiving agents MUST check that the address in the From or Sender header of a mail message matches an Internet mail address, if present, in the signer's certificate, if mail addresses are present in the certificate. A receiving agent SHOULD provide some explicit alternate processing of the message if this comparison fails, which may be to display a message that shows the recipient the addresses in the certificate or other certificate details.",
      "ja": "送信エージェントは、fromまたは送信者ヘッダーのアドレスをメールメッセージに作成する必要があります。受信エージェントは、メールメッセージのFROMまたは送信者ヘッダーのアドレスが、署名者の証明書に存在する場合は、証明書にメールアドレスが存在する場合、インターネットメールアドレスと一致することを確認する必要があります。受信エージェントは、この比較が失敗した場合、メッセージの明示的な代替処理を提供する必要があります。これは、受信者に証明書またはその他の証明書の詳細を示すメッセージを表示する場合があります。"
    },
    {
      "indent": 3,
      "text": "A receiving agent SHOULD display a subject name or other certificate details when displaying an indication of successful or unsuccessful signature verification.",
      "ja": "受信エージェントは、署名の確認が成功したか失敗したことを示す際に、件名またはその他の証明書の詳細を表示する必要があります。"
    },
    {
      "indent": 3,
      "text": "All subject and issuer names MUST be populated (i.e., not an empty SEQUENCE) in S/MIME-compliant X.509 identity certificates, except that the subject DN in a user's (i.e., end-entity) certificate MAY be an empty SEQUENCE in which case the subjectAltName extension will include the subject's identifier and MUST be marked as critical.",
      "ja": "すべてのサブジェクトおよび発行者名は、S/MIMEに準拠したX.509アイデンティティ証明書に存在する（つまり、空のシーケンスではありません）。subjectaltname拡張機能には、被験者の識別子が含まれ、クリティカルとしてマークされる必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Certificate Processing",
      "section_title": true,
      "ja": "4. 証明書処理"
    },
    {
      "indent": 3,
      "text": "A receiving agent needs to provide some certificate retrieval mechanism in order to gain access to certificates for recipients of digital envelopes. There are many ways to implement certificate retrieval mechanisms. X.500 directory service is an excellent example of a certificate retrieval-only mechanism that is compatible with classic X.500 Distinguished Names. Another method under consideration by the IETF is to provide certificate retrieval services as part of the existing Domain Name System (DNS). Until such mechanisms are widely used, their utility may be limited by the small number of correspondent's certificates that can be retrieved. At a minimum, for initial S/MIME deployment, a user agent could automatically generate a message to an intended recipient requesting that recipient's certificate in a signed return message.",
      "ja": "受信エージェントは、デジタルエンベロープの受信者の証明書にアクセスするために、いくつかの証明書取得メカニズムを提供する必要があります。証明書取得メカニズムを実装するには多くの方法があります。X.500ディレクトリサービスは、Classic X.500の著名な名前と互換性のある証明書取得のみのメカニズムの優れた例です。IETFが検討中の別の方法は、既存のドメイン名システム（DNS）の一部として証明書検索サービスを提供することです。そのようなメカニズムが広く使用されるまで、それらの有用性は、取得できる少数の特派員の証明書によって制限される場合があります。少なくとも、最初のS/MIMEの展開の場合、ユーザーエージェントは、署名された返品メッセージで受信者の証明書を要求する意図した受信者に自動的にメッセージを生成できます。"
    },
    {
      "indent": 3,
      "text": "Receiving and sending agents SHOULD also provide a mechanism to allow a user to \"store and protect\" certificates for correspondents in such a way so as to guarantee their later retrieval. In many environments, it may be desirable to link the certificate retrieval/storage mechanisms together in some sort of certificate database. In its simplest form, a certificate database would be local to a particular user and would function in a similar way as an \"address book\" that stores a user's frequent correspondents. In this way, the certificate retrieval mechanism would be limited to the certificates that a user has stored (presumably from incoming messages). A comprehensive certificate retrieval/storage solution may combine two or more mechanisms to allow the greatest flexibility and utility to the user. For instance, a secure Internet mail agent may resort to checking a centralized certificate retrieval mechanism for a certificate if it can not be found in a user's local certificate storage/retrieval database.",
      "ja": "また、エージェントを受信および送信する必要は、ユーザーがそのような方法で特派員の証明書を「保存および保護する」ことを可能にして、後の検索を保証するメカニズムを提供する必要があります。多くの環境では、ある種の証明書データベースで証明書の取得/ストレージメカニズムを一緒にリンクすることが望ましい場合があります。最も単純な形式では、証明書データベースは特定のユーザーにローカルであり、ユーザーの頻繁な特派員を保存する「アドレス帳」と同様の方法で機能します。このようにして、証明書の検索メカニズムは、ユーザーが保存した証明書に限定されます（おそらく受信メッセージから）。包括的な証明書取得/ストレージソリューションは、2つ以上のメカニズムを組み合わせて、ユーザーに最大の柔軟性とユーティリティを可能にする場合があります。たとえば、安全なインターネットメールエージェントは、ユーザーのローカル証明書ストレージ/検索データベースには見つからない場合、証明書の集中型証明書取得メカニズムを確認することに頼ることができます。"
    },
    {
      "indent": 3,
      "text": "Receiving and sending agents SHOULD provide a mechanism for the import and export of certificates, using a CMS certs-only message. This allows for import and export of full certificate chains as opposed to just a single certificate. This is described in [SMIME-MSG].",
      "ja": "エージェントを受信および送信するには、CMS CERTSのみのメッセージを使用して、証明書のインポートとエクスポートのメカニズムを提供する必要があります。これにより、単一の証明書とは対照的に、完全な証明書チェーンのインポートとエクスポートが可能になります。これは[Smime-MSG]で説明されています。"
    },
    {
      "indent": 3,
      "text": "Agents MUST handle multiple valid Certification Authority (CA) certificates containing the same subject name and the same public keys but with overlapping validity intervals.",
      "ja": "エージェントは、同じサブジェクト名と同じパブリックキーを含むが、重複する有効性間隔を含む複数の有効な認証機関（CA）証明書を処理する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.1. Certificate Revocation Lists",
      "section_title": true,
      "ja": "4.1. 証明書の取り消しリスト"
    },
    {
      "indent": 3,
      "text": "In general, it is always better to get the latest CRL information from a CA than to get information stored away from incoming messages. A receiving agent SHOULD have access to some certificate revocation list (CRL) retrieval mechanism in order to gain access to certificate revocation information when validating certification paths. A receiving or sending agent SHOULD also provide a mechanism to allow a user to store incoming certificate revocation information for correspondents in such a way so as to guarantee its later retrieval.",
      "ja": "一般に、入ってくるメッセージから保存されている情報を取得するよりも、CAから最新のCRL情報を取得する方が常に優れています。受信エージェントは、認証パスを検証する際に証明書の取り消し情報にアクセスするために、証明書取消リスト（CRL）検索メカニズムにアクセスする必要があります。受信または送信エージェントは、その後の検索を保証するように、ユーザーがそのような方法で入学する証明書の取り消し情報を保存できるようにするメカニズムも提供する必要があります。"
    },
    {
      "indent": 3,
      "text": "Receiving and sending agents SHOULD retrieve and utilize CRL information every time a certificate is verified as part of a certification path validation even if the certificate was already verified in the past. However, in many instances (such as off-line verification) access to the latest CRL information may be difficult or impossible. The use of CRL information, therefore, may be dictated by the value of the information that is protected. The value of the CRL information in a particular context is beyond the scope of this specification but may be governed by the policies associated with particular certification paths.",
      "ja": "エージェントの受信および送信は、証明書が過去に既に検証されていても、証明書の検証の一部として証明書が検証されるたびにCRL情報を取得および利用する必要があります。ただし、多くの場合（オフライン検証など）最新のCRL情報へのアクセスは困難または不可能です。したがって、CRL情報の使用は、保護されている情報の価値によって決定される場合があります。特定のコンテキストでのCRL情報の値は、この仕様の範囲を超えていますが、特定の認証パスに関連付けられたポリシーによって支配される場合があります。"
    },
    {
      "indent": 3,
      "text": "All agents MUST be capable of performing revocation checks using CRLs as specified in [KEYM]. All agents MUST perform revocation status checking in accordance with [KEYM]. Receiving agents MUST recognize CRLs in received S/MIME messages.",
      "ja": "すべてのエージェントは、[keym]で指定されているように、CRLを使用して取り消しチェックを実行できる必要があります。すべてのエージェントは、[keym]に従って取り消しステータスチェックを実行する必要があります。受信エージェントは、受信したS/MIMEメッセージでCRLを認識する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.2. Certification Path Validation",
      "section_title": true,
      "ja": "4.2. 認定パス検証"
    },
    {
      "indent": 3,
      "text": "In creating a user agent for secure messaging, certificate, CRL, and certification path validation SHOULD be highly automated while still acting in the best interests of the user. Certificate, CRL, and path validation MUST be performed as per [KEYM] when validating a correspondent's public key. This is necessary before using a public key to provide security services such as: verifying a signature; encrypting a content-encryption key (ex: RSA); or forming a pairwise symmetric key (ex: Diffie-Hellman) to be used to encrypt or decrypt a content-encryption key.",
      "ja": "セキュアなメッセージング、証明書、CRL、および認定パス検証のためのユーザーエージェントの作成は、ユーザーの最善の利益のために行動しながら、高度に自動化する必要があります。特派員の公開鍵を検証する場合、証明書、CRL、およびPATH検証は[KeyM]に従って実行する必要があります。これは、次のようなセキュリティサービスを提供するために公開キーを使用する前に必要です。コンテンツ暗号化キーを暗号化する（例：RSA）;または、コンテンツ暗号化キーを暗号化または復号化するために使用されるペアワイズ対称キー（例：diffie-hellman）を形成します。"
    },
    {
      "indent": 3,
      "text": "Certificates and CRLs are made available to the path validation procedure in two ways: a) incoming messages, and b) certificate and CRL retrieval mechanisms. Certificates and CRLs in incoming messages are not required to be in any particular order nor are they required to be in any way related to the sender or recipient of the message (although in most cases they will be related to the sender). Incoming certificates and CRLs SHOULD be cached for use in path validation and optionally stored for later use. This temporary certificate and CRL cache SHOULD be used to augment any other certificate and CRL retrieval mechanisms for path validation on incoming signed messages.",
      "ja": "証明書とCRLは、a）着信メッセージ、および証明書とCRL検索メカニズムの2つの方法で、パス検証手順で利用可能になります。着信メッセージの証明書とCRLは、特定の順序である必要はありませんし、メッセージの送信者または受信者に何らかの方法で関連する必要はありません（ほとんどの場合、送信者に関連します）。着信証明書とCRLは、パス検証で使用するためにキャッシュされ、後で使用するためにオプションで保存する必要があります。この一時的な証明書とCRLキャッシュは、着信署名済みメッセージでパス検証のための他の証明書とCRL検索メカニズムを強化するために使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3. Certificate and CRL Signing Algorithms",
      "section_title": true,
      "ja": "4.3. 証明書とCRL署名アルゴリズム"
    },
    {
      "indent": 3,
      "text": "Certificates and Certificate Revocation Lists (CRLs) are signed by the certificate issuer. A receiving agent MUST be capable of verifying the signatures on certificates and CRLs made with id-dsa-with-sha1 [CMSALG].",
      "ja": "証明書と証明書の取り消しリスト（CRL）は、証明書発行者によって署名されます。受信エージェントは、証明書およびID-DSA-with-sha1 [cmsalg]を使用して作成されたCRLの署名を確認できる必要があります。"
    },
    {
      "indent": 3,
      "text": "A receiving agent MUST be capable of verifying the signatures on certificates and CRLs made with md5WithRSAEncryption and sha1WithRSAEncryption signature algorithms with key sizes from 512 bits to 2048 bits described in [CMSALG].",
      "ja": "受信エージェントは、[CMSALG]で記載されている512ビットから2048ビットのキーサイズのMD5WithRSAECNACTRYPTIONおよびSHA1WITHRSAENCRYPTINGの署名アルゴリズムを使用して作成された証明書およびCRLSの署名を確認できる必要があります。"
    },
    {
      "indent": 3,
      "text": "Because of the security issues surrounding MD2 [RC95], and in light of current use, md2WithRSAEncryption MAY be supported.",
      "ja": "MD2 [RC95]を取り巻くセキュリティの問題のため、および現在の使用に照らして、MD2WithRSAENCRYPTIONがサポートされる場合があります。"
    },
    {
      "indent": 0,
      "text": "4.4. PKIX Certificate Extensions",
      "section_title": true,
      "ja": "4.4. PKIX証明書拡張機能"
    },
    {
      "indent": 3,
      "text": "PKIX describes an extensible framework in which the basic certificate information can be extended and how such extensions can be used to control the process of issuing and validating certificates. The PKIX Working Group has ongoing efforts to identify and create extensions which have value in particular certification environments. Further, there are active efforts underway to issue PKIX certificates for business purposes. This document identifies the minimum required set of certificate extensions which have the greatest value in the S/MIME environment. The syntax and semantics of all the identified extensions are defined in [KEYM].",
      "ja": "PKIXは、基本的な証明書情報を拡張できる拡張可能なフレームワークと、そのような拡張機能を使用して証明書の発行と検証のプロセスを制御する方法について説明します。PKIXワーキンググループは、特定の認証環境で価値を持つ拡張機能を特定して作成するための継続的な取り組みを持っています。さらに、ビジネス目的でPKIX証明書を発行する積極的な取り組みが進行中です。このドキュメントは、S/MIME環境で最大の値を持つ証明書拡張の最小セットを識別します。特定されたすべての拡張機能の構文とセマンティクスは、[keym]で定義されています。"
    },
    {
      "indent": 3,
      "text": "Sending and receiving agents MUST correctly handle the basic constraints, key usage, authority key identifier, subject key identifier, and subject alternative names certificate extensions when they appear in end-entity and CA certificates. Some mechanism SHOULD exist to gracefully handle other certificate extensions when they appear in end-entity or CA certificates.",
      "ja": "送信および受信エージェントは、基本的な制約、主要な使用法、機関のキー識別子、サブジェクトキー識別子、および主題の代替名証明書拡張機能がエンドエンティティおよびCA証明書に表示されるときに正しく処理する必要があります。エンドエンティティまたはCA証明書に表示されるときに、他の証明書拡張機能を優雅に処理するためのメカニズムが存在する必要があります。"
    },
    {
      "indent": 3,
      "text": "Certificates issued for the S/MIME environment SHOULD NOT contain any critical extensions (extensions that have the critical field set to TRUE) other than those listed here. These extensions SHOULD be marked as non-critical unless the proper handling of the extension is deemed critical to the correct interpretation of the associated certificate. Other extensions may be included, but those extensions SHOULD NOT be marked as critical.",
      "ja": "S/MIME環境に対して発行された証明書には、ここにリストされているもの以外の重要な拡張機能（批判的なフィールドが真に設定されている拡張機能）を含めるべきではありません。これらの拡張機能は、関連する証明書の正しい解釈にとって拡張機能の適切な処理が重要であるとみなされない限り、非クリティカルとしてマークする必要があります。他の拡張機能が含まれる場合がありますが、これらの拡張機能は重要であるとマークされるべきではありません。"
    },
    {
      "indent": 3,
      "text": "Interpretation and syntax for all extensions MUST follow [KEYM], unless otherwise specified here.",
      "ja": "すべての拡張機能の解釈と構文は、ここで特に指定されていない限り、[keym]に従う必要があります。"
    },
    {
      "indent": 0,
      "text": "4.4.1. Basic Constraints Certificate Extension",
      "section_title": true,
      "ja": "4.4.1. 基本的な制約証明書拡張"
    },
    {
      "indent": 3,
      "text": "The basic constraints extension serves to delimit the role and position that an issuing authority or end-entity certificate plays in a certification path.",
      "ja": "基本的な制約拡張は、発行機関またはエンドエンティティ証明書が認証パスで再生される役割と位置を区切るのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "For example, certificates issued to CAs and subordinate CAs contain a basic constraint extension that identifies them as issuing authority certificates. End-entity certificates contain an extension that constrains the certificate from being an issuing authority certificate.",
      "ja": "たとえば、CASおよび下位CASに発行された証明書には、それらを発行当局証明書として識別する基本的な制約拡張が含まれています。エンドエンティティ証明書には、証明書が発行機関証明書であることを制約する拡張機能が含まれています。"
    },
    {
      "indent": 3,
      "text": "Certificates SHOULD contain a basicConstraints extension in CA certificates, and SHOULD NOT contain that extension in end entity certificates.",
      "ja": "証明書には、CA証明書にBasicConstraints拡張が含まれている必要があります。また、End Entity証明書にその延長を含めるべきではありません。"
    },
    {
      "indent": 0,
      "text": "4.4.2. Key Usage Certificate Extension",
      "section_title": true,
      "ja": "4.4.2. 主要な使用証明書延長"
    },
    {
      "indent": 3,
      "text": "The key usage extension serves to limit the technical purposes for which a public key listed in a valid certificate may be used. Issuing authority certificates may contain a key usage extension that restricts the key to signing certificates, certificate revocation lists and other data.",
      "ja": "主要な使用法拡張機能は、有効な証明書にリストされている公開鍵を使用できる技術的な目的を制限するのに役立ちます。権限証明書の発行には、証明書、証明書の取り消しリスト、その他のデータに署名するためのキーを制限するキー使用拡張機能が含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "For example, a certification authority may create subordinate issuer certificates which contain a key usage extension which specifies that the corresponding public key can be used to sign end user certificates and sign CRLs.",
      "ja": "たとえば、認定機関は、対応する公開キーを使用してエンドユーザー証明書に署名し、CRLSに署名できることを指定するキー使用拡張機能を含む下位発行者証明書を作成する場合があります。"
    },
    {
      "indent": 3,
      "text": "If a key usage extension is included in a PKIX certificate, then it MUST be marked as critical.",
      "ja": "主要な使用法がPKIX証明書に含まれている場合、重要なものとしてマークする必要があります。"
    },
    {
      "indent": 3,
      "text": "S/MIME receiving agents MUST NOT accept the signature of a message if it was verified using a certificate which contains the key usage extension without either the digitalSignature or nonRepudiation bit set. Sometimes S/MIME is used as a secure message transport for applications beyond interpersonal messaging. In such cases, the S/MIME-enabled application can specify additional requirements concerning the digitalSignature or nonRepudiation bits within this extension.",
      "ja": "S/MIME受信エージェントは、デジタル署名または非控除ビットセットなしでキー使用拡張機能を含む証明書を使用して検証された場合、メッセージの署名を受け入れてはなりません。S/MIMEは、対人メッセージングを超えたアプリケーションの安全なメッセージトランスポートとして使用される場合があります。そのような場合、S/MIME対応アプリケーションは、この拡張機能内のデジタルシグナチャまたは非控除ビットに関する追加要件を指定できます。"
    },
    {
      "indent": 3,
      "text": "If the key usage extension is not specified, receiving clients MUST presume that the digitalSignature and nonRepudiation bits are set.",
      "ja": "主要な使用法拡張機能が指定されていない場合、受信クライアントはデジタル署名および非控除ビットが設定されていると推測する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.4.3. Subject Alternative Name Extension",
      "section_title": true,
      "ja": "4.4.3. 件名の代替名拡張機能"
    },
    {
      "indent": 3,
      "text": "The subject alternative name extension is used in S/MIME as the preferred means to convey the RFC-2822 email address(es) that correspond(s) to the entity for this certificate. Any RFC-2822 email addresses present MUST be encoded using the rfc822Name CHOICE of the GeneralName type. Since the SubjectAltName type is a SEQUENCE OF GeneralName, multiple RFC-2822 email addresses MAY be present.",
      "ja": "主題の代替名拡張は、この証明書のエンティティに対応するRFC-2822メールアドレスを伝えるための優先手段としてS/MIMEで使用されます。存在するRFC-2822の電子メールアドレスは、一般名のRFC822Name選択を使用してエンコードする必要があります。submictaltnameタイプは一般名のシーケンスであるため、複数のRFC-2822メールアドレスが存在する場合があります。"
    },
    {
      "indent": 0,
      "text": "4.4.4. Extended Key Usage Extension",
      "section_title": true,
      "ja": "4.4.4. 拡張されたキー使用拡張機能"
    },
    {
      "indent": 3,
      "text": "The extended key usage extension also serves to limit the technical purposes for which a public key listed in a valid certificate may be used. The set of technical purposes for the certificate therefore are the intersection of the uses indicated in the key usage and extended key usage extensions.",
      "ja": "拡張されたキーの使用拡張機能は、有効な証明書にリストされている公開鍵を使用することができる技術的な目的を制限するのにも役立ちます。したがって、証明書の技術的な目的のセットは、主要な使用法と拡張された主要な使用拡張に示されている使用の交差点です。"
    },
    {
      "indent": 3,
      "text": "For example, if the certificate contains a key usage extension indicating digital signature and an extended key usage extension which includes the email protection OID, then the certificate may be used for signing but not encrypting S/MIME messages. If the certificate contains a key usage extension indicating digital signature, but no extended key usage extension then the certificate may also be used to sign but not encrypt S/MIME messages.",
      "ja": "たとえば、証明書に、デジタル署名を示すキー使用拡張機能と電子メール保護OIDを含む拡張キー使用拡張機能が含まれている場合、証明書は署名に使用されますが、S/MIMEメッセージを暗号化することはできません。証明書にデジタル署名を示すキー使用拡張機能が含まれているが、拡張されたキー使用拡張機能がない場合、証明書はS/MIMEメッセージを暗号化するために署名するためにも使用できます。"
    },
    {
      "indent": 3,
      "text": "If the extended key usage extension is present in the certificate then interpersonal message S/MIME receiving agents MUST check that it contains either the emailProtection or the anyExtendedKeyUsage OID as defined in [KEYM]. S/MIME uses other than interpersonal messaging MAY require the explicit presence of the extended key usage extension or other OIDs to be present in the extension or both.",
      "ja": "拡張されたキーの使用法が証明書に存在する場合、対人メッセージS/MIME受信エージェントは、[keym]で定義されているように、電子メールのプロテクションまたはAnyextededKeyUsage OIDが含まれていることを確認する必要があります。S/MIMEの使用は、対人メッセージング以外に、拡張されたキー使用拡張機能または他のOIDの明示的な存在を必要とする場合があります。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "All of the security issues faced by any cryptographic application must be faced by a S/MIME agent. Among these issues are protecting the user's private key, preventing various attacks, and helping the user avoid mistakes such as inadvertently encrypting a message for the wrong recipient. The entire list of security considerations is beyond the scope of this document, but some significant concerns are listed here.",
      "ja": "暗号化アプリケーションが直面するすべてのセキュリティ問題は、S/MIMEエージェントが直面する必要があります。これらの問題の中には、ユーザーの秘密鍵を保護し、さまざまな攻撃を防ぎ、ユーザーが間違った受信者のメッセージを不注意に暗号化するなどの間違いを避けるのを支援しています。セキュリティ上の考慮事項のリスト全体は、このドキュメントの範囲を超えていますが、いくつかの重要な懸念がここにリストされています。"
    },
    {
      "indent": 3,
      "text": "When processing certificates, there are many situations where the processing might fail. Because the processing may be done by a user agent, a security gateway, or other program, there is no single way to handle such failures. Just because the methods to handle the failures has not been listed, however, the reader should not assume that they are not important. The opposite is true: if a certificate is not provably valid and associated with the message, the processing software should take immediate and noticeable steps to inform the end user about it.",
      "ja": "証明書を処理する場合、処理が失敗する可能性のある多くの状況があります。処理はユーザーエージェント、セキュリティゲートウェイ、またはその他のプログラムによって行われる可能性があるため、そのような障害を処理する方法はありません。ただし、障害を処理する方法がリストされていないからといって、読者はそれらが重要ではないと想定すべきではありません。逆の場合は、証明書が有効でなくメッセージに関連付けられていない場合、処理ソフトウェアは、エンドユーザーにそれを通知するために即座に顕著な手順を実行する必要があります。"
    },
    {
      "indent": 3,
      "text": "Some of the many places where signature and certificate checking might fail include:",
      "ja": "署名と証明書のチェックが失敗する可能性のある多くの場所のいくつかは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "- no Internet mail addresses in a certificate matches the sender of a message, if the certificate contains at least one mail address - no certificate chain leads to a trusted CA - no ability to check the CRL for a certificate - an invalid CRL was received - the CRL being checked is expired - the certificate is expired - the certificate has been revoked",
      "ja": "- 証明書のインターネットメールアドレスはメッセージの送信者と一致しません。証明書に少なくとも1つのメールアドレスが含まれている場合 - 証明書チェーンが信頼できるCAにつながる場合 - 証明書をCRLにチェックする能力はありません - 無効なCRLが受信されました - チェックされているCRLの有効期限が切れます - 証明書の有効期限が切れます - 証明書は取り消されました"
    },
    {
      "indent": 3,
      "text": "There are certainly other instances where a certificate may be invalid, and it is the responsibility of the processing software to check them all thoroughly, and to decide what to do if the check fails.",
      "ja": "確かに証明書が無効になる可能性のある他のインスタンスがあり、処理ソフトウェアの責任であり、それらをすべて徹底的にチェックし、チェックが失敗した場合に何をすべきかを決定することです。"
    },
    {
      "indent": 3,
      "text": "At the Selected Areas in Cryptography '95 conference in May 1995, Rogier and Chauvaud presented an attack on MD2 that can nearly find collisions [RC95]. Collisions occur when one can find two different messages that generate the same message digest. A checksum operation in MD2 is the only remaining obstacle to the success of the attack. For this reason, the use of MD2 for new applications is discouraged. It is still reasonable to use MD2 to verify existing signatures, as the ability to find collisions in MD2 does not enable an attacker to find new messages having a previously computed hash value.",
      "ja": "1995年5月のCryptography '95会議の選ばれた地域で、RogierとChauvaudはMD2への攻撃を発表しました。衝突は、同じメッセージダイジェストを生成する2つの異なるメッセージを見つけることができるときに発生します。MD2のチェックサム操作は、攻撃の成功に対する唯一の障害です。このため、新しいアプリケーションにMD2を使用することは落胆しています。MD2で衝突を見つける機能が攻撃者が以前に計算されたハッシュ値を持つ新しいメッセージを見つけることができないため、MD2を使用して既存の署名を検証することは依然として妥当です。"
    },
    {
      "indent": 3,
      "text": "It is possible for there to be multiple unexpired CRLs for a CA. If an agent is consulting CRLs for certificate validation, it SHOULD make sure that the most recently issued CRL for that CA is consulted, since an S/MIME message sender could deliberately include an older unexpired CRL in an S/MIME message. This older CRL might not include recent revoked certificates, which might lead an agent to accept a certificate that has been revoked in a subsequent CRL.",
      "ja": "CAのために複数の期限切れのCRLSがある可能性があります。Agentが証明書の検証のためにCRLSに相談している場合、S/MIMEメッセージ送信者はS/MIMEメッセージに古い期限切れのCRLを意図的に含めることができるため、そのCAの最近発行されたCRLが相談されることを確認する必要があります。この古いCRLには、最近の取り消された証明書が含まれていない可能性があり、エージェントがその後のCRLで取り消された証明書を受け入れるように導く可能性があります。"
    },
    {
      "indent": 3,
      "text": "When determining the time for a certificate validity check, agents have to be careful to use a reliable time. Unless it is from a trusted agent, this time MUST NOT be the SigningTime attribute found in an S/MIME message. For most sending agents, the SigningTime attribute could be deliberately set to direct the receiving agent to check a CRL that could have out-of-date revocation status for a certificate, or cause an improper result when checking the Validity field of a certificate.",
      "ja": "証明書の有効性チェックの時間を決定するとき、エージェントは信頼できる時間を使用するように注意する必要があります。信頼できるエージェントからのものでない限り、今回はS/MIMEメッセージで見つかった署名時間属性であってはなりません。ほとんどの送信エージェントの場合、SIGNINGTIME属性を意図的に設定することができます。受信エージェントに、証明書の有効性フィールドをチェックする際に、年代外の取り消しステータスがあるCRLを確認するか、不適切な結果を引き起こす可能性があります。"
    },
    {
      "indent": 0,
      "text": "A. References",
      "ja": "A.参照"
    },
    {
      "indent": 0,
      "text": "A.1. Normative References",
      "section_title": true,
      "ja": "A.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[ACAUTH] Farrell, S. and R. Housley, \"An Internet Attribute Certificate Profile for Authorization\", RFC 3281, April 2002.",
      "ja": "[Acauth] Farrell、S。およびR. Housley、「認証のためのインターネット属性証明書プロファイル」、RFC 3281、2002年4月。"
    },
    {
      "indent": 3,
      "text": "[CMS] Housely, R., \"Cryptographic Message Syntax (CMS)\", RFC 3852, July 2004.",
      "ja": "[CMS] Housely、R。、「暗号化メッセージ構文（CMS）」、RFC 3852、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[CMSALG] Housley, R., \"Cryptographic Message Syntax (CMS) Algorithms\", RFC 3370, August 2002.",
      "ja": "[CMSALG] Housley、R。、「暗号化メッセージ構文（CMS）アルゴリズム」、RFC 3370、2002年8月。"
    },
    {
      "indent": 3,
      "text": "[KEYM] Housley, R., Polk, W., Ford, W., and D. Solo, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 3280, April 2002.",
      "ja": "[Keym] Housley、R.、Polk、W.、Ford、W.、およびD. Solo、「インターネットX.509公開鍵インフラストラクチャ証明書および証明書取消リスト（CRL）プロファイル」、RFC 3280、2002年4月。"
    },
    {
      "indent": 3,
      "text": "[KEYMALG] Bassham, L., Polk, W., and R. Housley, \"Algorithms and Identifiers for the Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 3279, April 2002.",
      "ja": "[Keymalg] Bassham、L.、Polk、W。、およびR. Housley、「インターネットX.509公開キーインフラストラクチャ証明書および証明書取消リスト（CRL）プロファイルのアルゴリズムと識別子」、RFC 3279、2002年4月。"
    },
    {
      "indent": 3,
      "text": "[MUSTSHOULD] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[必須] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[PKCS9] Nystrom, M. and B. Kaliski, \"PKCS #9: Selected Object Classes and Attribute Types Version 2.0\", RFC 2985, November 2000.",
      "ja": "[PKCS9] Nystrom、M。およびB. Kaliski、「PKCS＃9：選択されたオブジェクトクラスと属性タイプバージョン2.0」、RFC 2985、2000年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2822], Resnick, P., \"Internet Message Format\", RFC 2822, April 2001.",
      "ja": "[RFC-2822]、Resnick、P。、「インターネットメッセージ形式」、RFC 2822、2001年4月。"
    },
    {
      "indent": 3,
      "text": "[SMIME-MSG] Ramsdell, B., Ed., \"S/MIME Version 3.1 Message Specification\", RFC 3851, July 2004.",
      "ja": "[Smime-MSG] Ramsdell、B.、ed。、「S/Mimeバージョン3.1メッセージ仕様」、RFC 3851、2004年7月。"
    },
    {
      "indent": 3,
      "text": "[x.208-88] ITU-T. Recommendation X.208: Specification of Abstract Syntax Notation One (ASN.1). 1988.",
      "ja": "[x.208-88] itu-t。推奨X.208：抽象的構文表記1（asn.1）の仕様。1988年。"
    },
    {
      "indent": 0,
      "text": "A.2. Informative References",
      "section_title": true,
      "ja": "A.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[CERTV2] Dusse, S., Hoffman, P., Ramsdell, B., and J. Weinstein, \"S/MIME Version 2 Certificate Handling\", RFC 2312, March 1998.",
      "ja": "[Certv2] Dusse、S.、Hoffman、P.、Ramsdell、B。、およびJ. Weinstein、「S/Mimeバージョン2証明書ハンドリング」、RFC 2312、1998年3月。"
    },
    {
      "indent": 3,
      "text": "[PKCS6] RSA Laboratories, \"PKCS #6: Extended-Certificate Syntax Standard\", November 1993.",
      "ja": "[PKCS6] RSA Laboratories、「PKCS＃6：ExtendedCertificate Syntax Standard」、1993年11月。"
    },
    {
      "indent": 3,
      "text": "[RC95] Rogier, N. and Chauvaud, P., \"The compression function of MD2 is not collision free,\" Presented at Selected Areas in Cryptography '95, May 1995.",
      "ja": "[RC95] Rogier、N。およびChauvaud、P。、「MD2の圧縮関数は衝突できない」、1995年5月、暗号'95の選択された地域で提示されました。"
    },
    {
      "indent": 3,
      "text": "[SECLABEL] Nicolls, W., \"Implementing Company Classification Policy with the S/MIME Security Label\", RFC 3114, May 2002.",
      "ja": "[Seclabel] Nicolls、W。、「S/MIMEセキュリティラベルを使用した会社分類ポリシーの実装」、RFC 3114、2002年5月。"
    },
    {
      "indent": 3,
      "text": "[X.500] ITU-T Recommendation X.500 (1997) | ISO/IEC 9594-1:1997, Information technology - Open Systems Interconnection - The Directory: Overview of concepts, models and services.",
      "ja": "[X.500] ITU-T推奨X.500（1997）|ISO/IEC 9594-1：1997、情報技術 - オープンシステムの相互接続 - ディレクトリ：概念、モデル、サービスの概要。"
    },
    {
      "indent": 3,
      "text": "[X.501] ITU-T Recommendation X.501 (1997) | ISO/IEC 9594-2:1997, Information technology - Open Systems Interconnection - The Directory: Models.",
      "ja": "[X.501] ITU-T推奨X.501（1997）|ISO/IEC 9594-2：1997、情報技術 - オープンシステムの相互接続 - ディレクトリ：モデル。"
    },
    {
      "indent": 3,
      "text": "[X.509] ITU-T Recommendation X.509 (1997) | ISO/IEC 9594-8:1997, Information technology - Open Systems Interconnection - The Directory: Authentication framework.",
      "ja": "[X.509] ITU-T推奨X.509（1997）|ISO/IEC 9594-8：1997、情報技術 - オープンシステムの相互接続 - ディレクトリ：認証フレームワーク。"
    },
    {
      "indent": 3,
      "text": "[X.520] ITU-T Recommendation X.520 (1997) | ISO/IEC 9594-6:1997, Information technology - Open Systems Interconnection - The Directory: Selected attribute types.",
      "ja": "[X.520] ITU-T推奨X.520（1997）|ISO/IEC 9594-6：1997、情報技術 - オープンシステムの相互接続 - ディレクトリ：選択された属性タイプ。"
    },
    {
      "indent": 0,
      "text": "B. Acknowledgements",
      "ja": "B.謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks go out to the other authors of the S/MIME v2 RFC: Steve Dusse, Paul Hoffman and Jeff Weinstein. Without v2, there wouldn't be a v3.",
      "ja": "S/Mime V2 RFCの他の著者に感謝します：Steve Dusse、Paul Hoffman、Jeff Weinstein。V2がなければ、V3はありません。"
    },
    {
      "indent": 3,
      "text": "A number of the members of the S/MIME Working Group have also worked very hard and contributed to this document. Any list of people is doomed to omission and for that I apologize. In alphabetical order, the following people stand out in my mind due to the fact that they made direct contributions to this document.",
      "ja": "S/MIMEワーキンググループの多くのメンバーも非常に一生懸命働いており、この文書に貢献しています。人々のリストは省略する運命にあります、そしてそのために私は謝罪します。アルファベット順に、この文書に直接貢献したという事実により、次の人々は私の頭の中で際立っています。"
    },
    {
      "indent": 3,
      "text": "Bill Flanigan Trevor Freeman Elliott Ginsburg Paul Hoffman Russ Housley David P. Kemp Michael Myers John Pawling Denis Pinkas Jim Schaad",
      "ja": "ビル・フラニガン・トレヴァー・フリーマン・エリオット・ギンズバーグ・ポール・ホフマン・ロシュ・ハウズリー・デイヴィッド・P・ケンプ・マイケル・マイヤーズ・ジョン・パウリング・デニス・ピナス・ジム・シャード"
    },
    {
      "indent": 0,
      "text": "C. Editor's Address",
      "ja": "C.編集者のアドレス"
    },
    {
      "indent": 3,
      "text": "Blake Ramsdell Sendmail, Inc. 704 228th Ave NE #775 Sammamish, WA 98074",
      "ja": "Blake Ramsdell Sendmail、Inc。704 228th Ave NE＃775 Sammamish、WA 98074"
    },
    {
      "indent": 3,
      "text": "EMail: blake@sendmail.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（c）The Internet Society（2004）。この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、この文書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスがどの程度であるかについての使用に関連すると主張する可能性があるという立場はありません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要な技術をカバーする可能性のあるその他の独自の権利を注意深く招待するよう招待しています。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}