{
  "title": {
    "text": "RFC 3624 - The Media Gateway Control Protocol (MGCP) Bulk Audit Package",
    "ja": "RFC 3624 - メディアゲートウェイコントロールプロトコル（MGCP）バルク監査パッケージ"
  },
  "number": 3624,
  "created_at": "2019-10-20 06:55:17.899630+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          B. Foster\nRequest for Comments: 3624                                   D. Auerbach\nCategory: Informational                                     F. Andreasen\n                                                           Cisco Systems\n                                                           November 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "The Media Gateway Control Protocol (MGCP) Bulk Audit Package",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "IESG Note",
      "ja": "IESG注意"
    },
    {
      "indent": 3,
      "text": "This document is being published for the information of the community. It describes a non-IETF protocol that is currently being deployed in a number of products. Implementers should be aware of RFC 3015, which was developed in the IETF Megaco Working Group and the ITU-T SG16, and which is considered by the IETF and the ITU-T to be the standards-based (including reviewed security considerations) way to meet the needs that MGCP was designed to address.",
      "ja": "この文書は、コミュニティの情報については公表されています。これは、現在の製品の数に展開されている非IETFプロトコルを記述しています。実装者は、IETFのMegaco作業部会とITU-T SG16で開発されたRFC 3015、知っておくべき、との標準ベース（見直しのセキュリティの考慮事項を含む）な方法であることがIETFとITU-Tによって考慮されていますMGCPが対処するように設計されたニーズを満たします。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The base Media Gateway Control Protocol (MGCP) includes audit commands that only allow a Call Agent to audit endpoint and/or connection state one endpoint at a time. This document describes a new MGCP package for bulk auditing of a group of gateway endpoints. It allows a Call Agent to determine the endpoint naming convention, the list of instantiated endpoints as well connection and endpoint state for the group of endpoints.",
      "ja": "ベースメディアゲートウェイコントロールプロトコル（MGCP）は、監査は一度にエンドポイントおよび/または接続状態一方のエンドポイントを監査するには、Call Agentを許可するコマンドが含まれます。この文書では、ゲートウェイエンドポイントのグループのバルク監査のための新しいMGCPパッケージを記載しています。これは、コールエージェントがエンドポイント命名規則、エンドポイントのグループのためだけでなく、接続して、エンドポイントの状態としてインスタンス化エンドポイントのリストを決定することができます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction. . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Bulk Audit Package. . . . . . . . . . . . . . . . . . . . . .   2\n    2.1.  Package Definition. . . . . . . . . . . . . . . . . . .   2\n          2.1.1. Package Parameters . . . . . . . . . . . . . . .   3\n          2.1.2. Bulk Auditing of Non-persistent Virtual\n                 Endpoints. . . . . . . . . . . . . . . . . . . .  11\n          2.1.3. Package Specific Return Codes. . . . . . . . . .  12\n    2.2.  Examples of Package Use . . . . . . . . . . . . . . . .  13\n          2.2.1. Endpoint List. . . . . . . . . . . . . . . . . .  13\n          2.2.2. Connection Count List. . . . . . . . . . . . . .  13\n          2.2.3. Connection Mode List . . . . . . . . . . . . . .  15\n          2.2.4. Endpoint State . . . . . . . . . . . . . . . . .  15\n3.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  17\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .  17\n5.  References. . . . . . . . . . . . . . . . . . . . . . . . . .  18\n6.  Authors' Addresses. . . . . . . . . . . . . . . . . . . . . .  18\n7.  Full Copyright Statement. . . . . . . . . . . . . . . . . . .  19",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The reader is assumed to be familiar with the base MGCP protocol [3].",
      "ja": "読者は、ベースMGCPプロトコル[3]に精通しているものとします。"
    },
    {
      "indent": 3,
      "text": "The base Media Gateway Control Protocol (MGCP) [3] includes audit commands that only allow a Call Agent to audit an endpoint and/or a connection state, one endpoint at a time. This document describes a new MGCP package for bulk auditing of a group of gateway endpoints. It allows a Call Agent to determine the endpoint naming convention, to determine the list of instantiated endpoints, and to determine the connection and endpoint state for the group of endpoints. This is particularly important in fail-over situations in which there are gateways that have large numbers of endpoints.",
      "ja": "ベースメディアゲートウェイ制御プロトコル（MGCP）[3]監査のみ、一度に一つのエンドポイントが、エンドポイントおよび/または接続状態を監査するCallエージェントを許可するコマンドが含まれます。この文書では、ゲートウェイエンドポイントのグループのバルク監査のための新しいMGCPパッケージを記載しています。これは、コールエージェントがインスタンス化エンドポイントのリストを決定するため、およびエンドポイントのグループのための接続とエンドポイントの状態を判断するために、エンドポイントの命名規則を決定することができます。これは、エンドポイントの数が多いゲートウェイがあるフェイル・オーバーの状況において特に重要です。"
    },
    {
      "indent": 3,
      "text": "Conventions Used in this Document",
      "ja": "このドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [2].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119に記載されるように解釈される[2]。"
    },
    {
      "indent": 0,
      "text": "2. Bulk Audit Package",
      "section_title": true,
      "ja": "2.一括監査パッケージ"
    },
    {
      "indent": 0,
      "text": "2.1. Package Definition",
      "section_title": true,
      "ja": "2.1。パッケージ定義"
    },
    {
      "indent": 3,
      "text": "Package Name: BA",
      "ja": "パッケージ名：BA"
    },
    {
      "indent": 3,
      "text": "Package Version: 0",
      "ja": "パッケージバージョン：0"
    },
    {
      "indent": 3,
      "text": "Package Description: This package provides the Call Agent the ability to audit and obtain high-level view of endpoint and connection state for a group of endpoints in a gateway.",
      "ja": "パッケージの説明：このパッケージは、コールエージェントにゲートウェイ内のエンドポイントのグループのエンドポイントとの接続状態の高レベルのビューを監査し得る能力を提供します。"
    },
    {
      "indent": 0,
      "text": "2.1.1. Package Parameters",
      "section_title": true,
      "ja": "2.1.1。パッケージパラメータ"
    },
    {
      "indent": 3,
      "text": "A new BulkRequestedInfo parameter is defined for use in the AuditEndpoint command. The parameter can be used to request a compact list of EndpointIds or to request a high level view of endpoint or connection state for a group of endpoints as defined below:",
      "ja": "新しいBulkRequestedInfoパラメータがAuditEndpointコマンドで使用するために定義されています。以下に定義するパラメータはEndpointIdsのコンパクトなリストを要求するために、またはエンドポイントのグループのためのエンドポイントまたは接続状態の高レベルのビューを要求するために使用することができます。"
    },
    {
      "indent": 6,
      "text": "ReturnCode, [EndPointNameList,] [InstantiatedEndpointList,] [ConnectionCountList,] [ConnectionModeList,] [EndpointStateList,] [NextEndpointName,] [ReportedEndpointList] <-- AuditEndPoint(EndpointId, [StartEndpointName,] [MaxNumEndpoints,] [BulkRequestedInfo])",
      "ja": "戻りコード、[EndPointNameList、] [InstantiatedEndpointList、]、[接続モードのリスト、] [EndpointStateList、] [NextEndpointName、] [ReportedEndpointList] <[接続一覧、カウント]  - アウディはポイント（EndpointId、[スター傾向があるポイント名] [MaxNumEndpoints、] [BulkRequestedInfo]を）傾向があります"
    },
    {
      "indent": 3,
      "text": "Unlike the normal RequestedInfo parameter in the base MGCP specification, the BulkRequestedInfo parameter associated with the Bulk Audits package can be used with \"all-of\" wildcards for auditing a collection of endpoints. However, it is not an error to specify an EndpointId without wildcards.",
      "ja": "ベースMGCP仕様の正常RequestedInfoパラメータとは異なり、バルク監査パッケージに関連付けられBulkRequestedInfoパラメータは、エンドポイントのコレクションを監査するための「全の」ワイルドカードと共に使用することができます。しかし、ワイルドカードなしでEndpointIdを指定してもエラーではありません。"
    },
    {
      "indent": 3,
      "text": "The following sub-sections describe the parameters associated with the Bulk Audit Command in detail. Sections 2.1.1.1 and 2.1.1.2 describe the parameters that can be included with a request and sections 2.1.1.3 to 2.1.1.8 describe return parameters.",
      "ja": "以下のサブセクションでは、詳細にバルク監査コマンドに関連するパラメータを記載しています。セクション2.1.1.1と2.1.1.2 2.1.1.8に要求し、セクション2.1.1.3に含めることができるパラメータを記述は、リターン・パラメータを記述する。"
    },
    {
      "indent": 0,
      "text": "2.1.1.1. StartEndpointName and MaxNumEndpoints Parameters",
      "section_title": true,
      "ja": "2.1.1.1。 StartEndpointNameとMaxNumEndpointsパラメータ"
    },
    {
      "indent": 3,
      "text": "Because wild-carding may not be sufficient to qualify the endpoints of interest, further qualification can be provided by including a StartEndpointName (the first endpoint of interest) and MaxNumEndPoints (the maximum number of endpoints of interest). These parameters are described according to the following Augmented BNF (ABNF) Syntax (refer to RFC 2234 for ABNF syntax definitions [1]):",
      "ja": "野生カーディングは、関心のあるエンドポイントを修飾するのに十分ではないかもしれないので、さらに資格はStartEndpointName（関心の最初のエンドポイント）とMaxNumEndPoints（関心のエンドポイントの最大数）などによって提供することができます。これらのパラメータは、以下の増補BNF（ABNF）構文（ABNF構文定義についてはRFC 2234を参照し、[1]）に従って記載されています。"
    },
    {
      "indent": 6,
      "text": "\"BA/SE\" \":\" 0*WSP LocalEndpointName",
      "ja": "\"BA / SE\" \"：\" 0 * WSP LocalEndpointName"
    },
    {
      "indent": 6,
      "text": "\"BA/NU\" \":\" 0*WSP MaxNumEndpoints",
      "ja": "\"BA / NU\" \"：\" 0 * WSP MaxNumEndpoints"
    },
    {
      "indent": 3,
      "text": "where MaxNumEndpoints is the decimal number of endpoints with a value in the range 1 to 65535. The MaxNumEndpoints parameter SHOULD only be included when requesting an audit for an EndpointStateList and/or ConnectionCountList. If included in a request for the EndPointNameList or InstantiatedEndpointList, it MAY be ignored.",
      "ja": "MaxNumEndpointsの範囲内の値とエンドポイントの進数はEndpointStateList及び/又はConnectionCountListの監査を要求するときMaxNumEndpointsパラメータのみ含まれるべきである1〜65535です。 EndPointNameListまたはInstantiatedEndpointListの要求に含まれている場合、それは無視してもよいです。"
    },
    {
      "indent": 3,
      "text": "Note that only the LocalEndpointName (see ABNF grammar in [3]) is provided in request and response parameter lines for this package rather than the full EndpointName. This is done for the sake of compactness, i.e., the domain name portion is left out since it is already available in the command line portion of a given request.",
      "ja": "唯一LocalEndpointNameこのパッケージではなく完全なポイントendpointNameの要求および応答パラメータラインに設けられている（[3]におけるABNF文法を参照のこと）に注意してください。これはつまり、ドメイン名部分は、それが与えられた要求のコマンドライン部分で既に利用可能であるので省略されている、小型化のために行われます。"
    },
    {
      "indent": 3,
      "text": "If the list of endpoints defined by the StartEndpointName and MaxNumEndPoints is outside the range designated by the wild-carding, a report will only be returned for endpoints up to those specified within the wild-card range.",
      "ja": "StartEndpointNameとMaxNumEndPointsによって定義されたエンドポイントのリストが野生梳綿によって指定された範囲外にある場合、レポートが唯一のワイルドカードの範囲内で指定されたものまで、エンドポイントのために返されます。"
    },
    {
      "indent": 0,
      "text": "2.1.1.2. BulkRequestedInfo Parameter",
      "section_title": true,
      "ja": "2.1.1.2。 BulkRequestedInfoパラメータ"
    },
    {
      "indent": 3,
      "text": "The BulkRequestedInfo parameter line is described according to the following ABNF syntax definitions:",
      "ja": "BulkRequestedInfoパラメータ行は、以下のABNF構文定義に従って記述されています。"
    },
    {
      "indent": 6,
      "text": "BulkRequestedInfo = \"BA/F:\" 0*WSP *( EndpointOrInstantList *(\",\" EndpointOrInstantList)) / *( EndpointOrConnState *(\",\" EndpointOrConnState))",
      "ja": "BulkRequestedInfo = \"BA / F：\" 0 * WSP *（EndpointOrInstantList *（ \"\" EndpointOrInstantList））/ *（EndpointOrConnState *（ \"\" EndpointOrConnState））"
    },
    {
      "indent": 6,
      "text": "EndpointOrConnState = \"BA/C\" / \"BA/M\" / EndpointStateParam",
      "ja": "EndpointOrConnState = \"BA / C\" / \"BA / M\" / EndpointStateParam"
    },
    {
      "indent": 6,
      "text": "EndpointOrInstantList = \"BA/Z\" / \"BA/X\"",
      "ja": "EndpointOrInstantList = \"BA / Z\" / \"BA / X\""
    },
    {
      "indent": 6,
      "text": "EndpointStateParam = \"BA/S\" \"(\" StateType 0*(\",\" 0*(WSP) StateType)\")\"",
      "ja": "EndpointStateParam = \"BA / S\" \"（\" StateType 0 *（ \"\" 0 *（WSP）StateType） '）'"
    },
    {
      "indent": 6,
      "text": "StateType = \"I\" / \"D\" / \"N\" / \"S\" / \"H\"",
      "ja": "StateType = \"I\" / \"D\" / \"N\" / \"S\" / \"H\""
    },
    {
      "indent": 3,
      "text": "where the BulkRequestedInfo parameters have the following meaning:",
      "ja": "どこBulkRequestedInfoパラメータの意味は以下のとおりです。"
    },
    {
      "indent": 6,
      "text": "* \"BA/Z\" is a request to return EndPointNameList * \"BA/X\" is a request to return InstantiatedEndpointList * \"BA/C\" is a request to return the ConnectionCountList * \"BA/M\" is a request to return the ConnectionModeList * \"BA/S\" is a request to return the EndpointStateList",
      "ja": "*「BA / Z」* EndPointNameList戻すための要求である「BA / X」* InstantiatedEndpointList戻すための要求である「BA / C」はConnectionCountListを戻すための要求である*「BA / M」はConnectionModeListを返すように要求され*「BA / Sは、」EndpointStateListを返すように要求され"
    },
    {
      "indent": 3,
      "text": "Each of the parameters can be provided at most once in the BulkRequestedInfo.",
      "ja": "パラメータのそれぞれは、最大で1回BulkRequestedInfo内に設けることができます。"
    },
    {
      "indent": 3,
      "text": "EndpointStateParam Parameter:",
      "ja": "EndpointStateParamパラメータ："
    },
    {
      "indent": 3,
      "text": "As indicated in the above ABNF, the EndpointStateParam parameter is itself parameterized with one or more StateType parameters that define the conditions to be evaluated for the endpoint:",
      "ja": "上記ABNFに示されるように、EndpointStateParamパラメータは、エンドポイントのために評価される条件を定義する1つまたは複数のStateTypeパラメータでパラメータそのものです。"
    },
    {
      "indent": 3,
      "text": "* \"I\" - the endpoint is in-service, * \"D\" - the endpoint is disconnected (see sections 4.3 and 4.4.7 of [3] for a discussion on disconnected endpoints), * \"N\" - the endpoint is in the notification state, * \"L\" - the endpoint is in lockstep state (i.e., waiting for an RQNT after a response to a NTFY has occurred while in lockstep mode) * \"S\" - there is an active on-off (OO) or timeout (TO) signal on the endpoint, * \"H\" - the endpoint is in some state other than \"idle\". The meaning of this last parameter depends on the type of endpoint: * The parameter has no meaning for endpoints that only provide bearer services (with no state that the endpoint is aware of). In this case, the condition is always evaluated to false (corresponding to \"idle\"). * For endpoints that have a state machine associated with them (such as a CAS endpoint), the endpoint MUST be in some state other than the \"idle\" state in order for the condition to be evaluated as true. * In the case where the endpoint has hook-state associated with it, the hook-state MUST be off-hook. In the case of digital channel associated signaling (CAS) connections, hook-state may be provided in either direction. If the hook-state in either direction is off-hook, the endpoint is considered non-idle, i.e., the condition is satisfied.",
      "ja": "*「I」 - エンドポイントは*「D」、インサービスである - エンドポイントが切断され（切断されたエンドポイント上の議論については[3]のセクション4.3及び4.4.7を参照）、*「N」 - エンドポイントはです通知状態、*「L」 - アクティブではオン・オフ（OO）がある - エンドポイント*「S」（ロックステップモード中NTFYへの応答が行われた後、すなわち、RQNTを待っている）堅苦しい状態にありますエンドポイント上またはタイムアウト（TO）信号、*「H」 - エンドポイントは、「アイドル」以外の状態になっています。この最後のパラメータの意味は、エンドポイントの種類によって異なります。*パラメーターは、（エンドポイントが認識していることがない状態で）ベアラサービスを提供するエンドポイントの意味がありません。この場合、条件は常に（「アイドル」に相当）はfalseに評価されます。 *（例えばCASエンドポイントとして）それらに関連する状態マシンを持っているエンドポイントの場合、エンドポイントは、真と評価される条件のために、「アイドル」状態以外の状態でなければなりません。 *エンドポイントは、それに関連付けられたフック状態を有する場合には、フック状態がオフフックでなければなりません。デジタルチャネル連携信号（CAS）接続の場合には、フック状態がいずれかの方向に設けられていてもよいです。いずれかの方向にフック状態がオフフックである場合、エンドポイント、すなわち、条件が満たされた、非アイドルであると考えられます。"
    },
    {
      "indent": 3,
      "text": "The list of StateTypes may be extended in the future. If an unknown StateType is encountered, the command MUST be rejected with error code 803 (i.e., \"unsupported StateType\").",
      "ja": "StateTypesのリストは、将来的に延長することができます。不明StateTypeが発生した場合、コマンドはエラーコード803（すなわち、「サポートされていないStateType」）を拒絶しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The report, provided as a result of this request, yields an indication of either \"True\", \"False\", or \"Out of Service\" for each endpoint. If the endpoint is in-service and any one of the criteria holds true, then the report for the endpoint will evaluate to \"True\". A \"False\" indication will only be reported if the endpoint is in-service and all criteria evaluate to false. The report thus provides the logical \"OR\" function over the conditions audited for endpoints in-service. Irrespective of the state being audited, an \"Out of Service\" indication will always be reported if the endpoint is considered out-of-service.",
      "ja": "この要求の結果として提供するレポートは、各エンドポイントについて、「真」、「偽」、または「アウトオブサービス」のいずれかの表示が得られます。エンドポイントがサービス中であるとの条件のいずれかが成立した場合、エンドポイントのレポートでは、「真」と評価されます。エンドポイントがサービス中の場合は「偽」の表示にのみ報告され、すべての基準がfalseに評価されます。報告書は、このようにインサービスのエンドポイントについて監査条件を超える論理「OR」機能を提供します。エンドポイントがアウトオブサービスとみなされている場合にかかわらず監査されている状態の、「アウト・サービスの」表示は常に報告されます。"
    },
    {
      "indent": 3,
      "text": "Note that the criteria \"D\", \"N\", \"L\", \"S\" and \"H\" can only be true if the endpoint is in-service, so that requesting \"I\" at the same time (although allowed) would be unnecessary (i.e., redundant).",
      "ja": "エンドポイントがサービス中である場合に基準「D」、「N」、「L」、「S」及び「H」が唯一真であることに注意してください、希望要求「I」を同時に（許可が）ように（すなわち、冗長）不要です。"
    },
    {
      "indent": 3,
      "text": "Example: If the request for EndpointStateList for one or more endpoints includes the parameter line:",
      "ja": "例：1つ以上のエンドポイントのためにEndpointStateList要求がパラメータ行が含まれている場合："
    },
    {
      "indent": 6,
      "text": "BA/F: BA/S(D,N)",
      "ja": "BA / F：B / S（D、N）"
    },
    {
      "indent": 3,
      "text": "indicating a request for a report on whether endpoints are disconnected or in the notification state. If a given endpoint is in either a \"disconnected\" or \"notification\" state, then the report will indicate \"True\" for that endpoint. If the endpoint is neither in a disconnected state nor in a notification state, but is in-service, then the report for that endpoint will indicate \"False\". If the endpoint is out-of-service, then the report for that endpoint will indicate \"Out of Service\".",
      "ja": "エンドポイントが切断または通知状態にあるかどうかについてのレポートのための要求を示します。特定のエンドポイントは、「切断」または「通知」状態のいずれかである場合には、報告書は、そのエンドポイントのための「真」と表示されます。エンドポイントが切断された状態でも通知状態でもないですが、インサービスである場合、そのエンドポイントのレポートでは、「偽」と表示されます。エンドポイントがアウトオブサービスである場合、そのエンドポイントのレポートでは、「サービスのうち」と表示されます。"
    },
    {
      "indent": 3,
      "text": "In order to only determine whether an endpoint is in-service or out-of service, the Call Agent should make a request with only the \"I\" StateType parameter.",
      "ja": "唯一のエンドポイントは、サービスまたはアウトオブサービスであるかどうかを決定するために、コールエージェントは唯一の「I」StateTypeパラメータを指定して要求を行う必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1.1.3. EndPointNameList and InstantiatedEndpointList Parameters",
      "section_title": true,
      "ja": "2.1.1.3。 EndPointNameListとInstantiatedEndpointListパラメータ"
    },
    {
      "indent": 3,
      "text": "EndPointNameList Parameter:",
      "ja": "EndPointNameListパラメータ："
    },
    {
      "indent": 3,
      "text": "The EndPointNameList is a list of the endpoint names (i.e., the endpoint naming convention for the endpoints configured for service) supported by the gateway as qualified by the wildcarded EndPointId, and possibly StartEndPointName and MaxNumEndpoints parameters. This list can include one or more lines in the following ABNF format:",
      "ja": "EndPointNameListは、エンドポイント名のリストである（すなわち、サービスのために構成されたエンドポイントのエンドポイント命名規則）ワイルドカードEndPointIdによって修飾、およびおそらくStartEndPointNameとMaxNumEndpointsパラメータとしてゲートウェイによってサポートされます。このリストは、次のABNF形式で1つ以上の行を含めることができます。"
    },
    {
      "indent": 6,
      "text": "\"BA/Z:\" 0*WSP RangedLocalName 0*(\",\" 0*WSP RangedLocalName)",
      "ja": "\"BA / Z\" 0 * 0 * WSP RangedLocalName（ \"\" 0 * WSP RangedLocalName）"
    },
    {
      "indent": 3,
      "text": "where RangedLocalName is a LocalEndpointName that may include the ranged wildcard notation described in Appendix E (section E.5) of [3], i.e.,:",
      "ja": "RangedLocalName付録E（セクションE.5）に記載の範囲ワイルドカード表記を含んでもよいLocalEndpointNameがある[3]、すなわち、。："
    },
    {
      "indent": 6,
      "text": "RangeWildcard = \"[\" NumericalRange *( \",\" NumericalRange ) \"]\" NumericalRange = 1*(DIGIT) [ \"-\" 1*(DIGIT) ].",
      "ja": "RangeWildcard = \"[\" NumericalRange *（ \"\" NumericalRange） \"]\" NumericalRange = 1 *（DIGIT）[ \" - \" 1 *（DIGIT）]。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 6,
      "text": "ba/z: ds/ds1-1/[1-24], ds/ds1-2/[1-24], ds/ds1-3/[1-24]",
      "ja": "BA / Z：DS / ds1-1 / [1-24]、DS / ds1-2 / [1-24]、DS / ds1-3 / [1-24]"
    },
    {
      "indent": 3,
      "text": "or simply:",
      "ja": "あるいは単に："
    },
    {
      "indent": 6,
      "text": "ba/z: ds/ds1-[1-3]/[1-24]",
      "ja": "BA / Z：DS / ds1- [1-3] / [1-24]"
    },
    {
      "indent": 3,
      "text": "Note that, since range wildcards use the character \"[\" to indicate the start of a range, the \"[\" character MUST NOT be used in endpoint names that use range wildcards.",
      "ja": "レンジのワイルドカードは文字を使用するので範囲の開始を示すために、「[」、なお、「[」の文字は、範囲、ワイルドカードを使用したエンドポイント名に使用してはいけません。"
    },
    {
      "indent": 3,
      "text": "Note that the ranged wildcard notation (RangeWildcard above) also allows commas between ranges like:",
      "ja": "：（上記RangeWildcard）の範囲であったワイルドカード表記も様範囲の間のカンマを可能にすることに注意してください"
    },
    {
      "indent": 6,
      "text": "ba/z: ds/ds1-1/[1,3-5,8-24]",
      "ja": "BA / Z：DS / ds1-1 / [1,3-5,8-24]"
    },
    {
      "indent": 3,
      "text": "For virtual endpoints, that are automatically created and deleted on the fly by the gateway, there is a difference between reporting the endpoint names (i.e., the \"naming convention\") used in describing the endpoints and reporting the actual endpoints that are instantiated at the time the request is made. For this case:",
      "ja": "自動的に作成され、ゲートウェイによって、その場で削除された仮想エンドポイントについては、エンドポイント名を報告違いがあります（つまり、「命名規則」）でインスタンス化される実際のエンドポイントを、エンドポイントを説明および報告で使用時間要求が行われました。このような場合のために："
    },
    {
      "indent": 3,
      "text": "* EndPointNameList is a request to return the naming convention and",
      "ja": "* EndPointNameListは、命名規則を返すように要求され、"
    },
    {
      "indent": 3,
      "text": "* InstantiatedEndpointList is a request to return the \"real\" (or instantiated) endpoints.",
      "ja": "* InstantiatedEndpointListは、「本当の」（またはインスタンス化）エンドポイントを戻すための要求です。"
    },
    {
      "indent": 3,
      "text": "InstantiatedEndpointList Parameter:",
      "ja": "InstantiatedEndpointListパラメータ："
    },
    {
      "indent": 6,
      "text": "The syntax of the InstantiatedEndpointList value is the same as the EndPointNameList value returned with EndPointNameList, i.e., a number of lines may be returned with the following syntax:",
      "ja": "InstantiatedEndpointList値の構文はEndPointNameListで返さEndPointNameList値と同じである、即ち、行の数は、以下の構文を使用して戻すことができます。"
    },
    {
      "indent": 9,
      "text": "\"BA/X:\" 0*WSP RangedLocalName 0*(\",\" 0*WSP RangedLocalName)",
      "ja": "\"BA / X\" 0 * 0 * WSP RangedLocalName（ \"\" 0 * WSP RangedLocalName）"
    },
    {
      "indent": 3,
      "text": "In the case of hard-wired/physical endpoints (such as DSO's) or other persistent endpoints, the InstantiatedEndpointList would normally not be requested. However, if it is requested, the InstantiatedEndpointList and the EndPointNameList will be the same.",
      "ja": "（例えばDSOのような）ハードワイヤード/物理的エンドポイントまたは他の永続的なエンドポイントの場合、InstantiatedEndpointListは通常要求されないであろう。それが要求された場合は、InstantiatedEndpointListとEndPointNameListは同じになります。"
    },
    {
      "indent": 3,
      "text": "For virtual endpoints that are not persistent, an \"all of\" wild card (\"*\") is returned for the leftmost term of the name, which is dynamically assigned in the EndPointNameList to indicate that arbitrary names apply, and that the endpoints are virtual and non-persistent. The \"all of\" wild card notation MUST NOT be used when returning the EndPointNameList for persistent endpoints however. The following example illustrates this:",
      "ja": "永続的でない仮想エンドポイントの場合、ワイルドカード（「*」）「の全ては、」動的に任意の名前を適用することを示すためにEndPointNameListに割り当てられた名前の左端の期間、のために返され、エンドポイントは、仮想であることをそして、非永続。しかし、永続的なエンドポイントのEndPointNameListを返すときに「すべての」ワイルドカード表記を使用してはいけません。次の例では、このことを示しています。"
    },
    {
      "indent": 3,
      "text": "ba/z: announcement/*\nba/z: foo/bar/*\nba/z: foo/foo/*",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The \"all of\" wildcard tells us, that \"announcement\" is simply the leftmost term for a dynamic set of non-persistent virtual endpoints. To instantiate one of these endpoints, we would include the \"any of\" wildcard (e.g., \"announcement/$\") as the LocalEndpointName in the EndpointId of a request (e.g., NotificationRequest or CreateConnection). The response would then include the SpecificEndpointId indicating the instantiated endpoint. Also, note in the above example that \"foo\" defines two different levels of non-persistent virtual endpoints.",
      "ja": "ワイルドカード「のすべてが」「発表は」単に非永続的仮想エンドポイントの動的なセットのための左端の用語であること、を教えてくれる。これらのエンドポイントの1つをインスタンス化するために、我々は要求（例えば、NotificationRequestかのCreateConnection）のEndpointIdにLocalEndpointNameとしてワイルドカード（例えば、「告知/ $」）「のいずれかを」含まれるであろう。応答は、その後、インスタンス化されたエンドポイントを示すSpecificEndpointIdを含むであろう。 「fooが」非永続的仮想エンドポイントの2つの異なるレベルを定義することも、上記の例で注意。"
    },
    {
      "indent": 0,
      "text": "2.1.1.4. ConnectionCountList",
      "section_title": true,
      "ja": "2.1.1.4。 ConnectionCountList"
    },
    {
      "indent": 3,
      "text": "The ConnectionCountList indicates the number of connections on a series of endpoints. It consists of a number of lines with the following ABNF syntax:",
      "ja": "ConnectionCountListは、エンドポイントのシリーズの接続数を示します。これは、次のABNF構文の行数で構成されています。"
    },
    {
      "indent": 6,
      "text": "\"BA/C:\" 0*WSP NumConnections 0*(NumConnections)",
      "ja": "\"BA / C：\" 0 * WSPのNumConnections 0 *（NumConnections）"
    },
    {
      "indent": 3,
      "text": "where NumConnections is either:",
      "ja": "NumConnectionsのいずれかです："
    },
    {
      "indent": 3,
      "text": "* a hexadecimal digit indicating the number of connections on the endpoint corresponding to the position on the list, or",
      "ja": "リスト上の位置に対応するエンドポイントの接続の数を示す*進数字、または"
    },
    {
      "indent": 3,
      "text": "* the letter \"Z\" indicating that there are more than 15 connections on this endpoint.",
      "ja": "*このエンドポイント上の15の以上の接続があることを示す文字「Z」。"
    },
    {
      "indent": 0,
      "text": "2.1.1.5. ConnectionModeList",
      "section_title": true,
      "ja": "2.1.1.5。 ConnectionModeList"
    },
    {
      "indent": 3,
      "text": "The ConnectionModeList indicates the connection modes for all the connections on a series of endpoints. It consists of a number of lines with the following ABNF syntax:",
      "ja": "ConnectionModeListは、エンドポイントのシリーズのすべての接続のための接続モードを示します。これは、次のABNF構文の行数で構成されています。"
    },
    {
      "indent": 6,
      "text": "\"BA/M:\" 0*WSP ModeOrCount 0*(ModOrCount)",
      "ja": "\"BA / M\" 0 * 0 * WSP ModeOrCount（ModOrCount）"
    },
    {
      "indent": 6,
      "text": "ModeOrCount = ConnCount / ConnMode",
      "ja": "ModeOrCount = ConnCount / ConnMode"
    },
    {
      "indent": 6,
      "text": "ConnMode = \"I\" / \"S\" / \"R\" / \"B\" / \"C\" / \"L\" / \"T\" / \"N\" / \"U\"",
      "ja": "ConnMode = \"I\" / \"S\" / \"R\" / \"B\" / \"C\" / \"L\" / \"T\" / \"N\" / \"U\""
    },
    {
      "indent": 3,
      "text": "where ConnCount is either hexadecimal value corresponding to 0-15 connections on an endpoint or the value \"Z\", indicating that more than 15 connections are present.",
      "ja": "ここConnCountは15の以上の接続が存在することを示す、エンドポイントまたは値「Z」に0-15接続に対応する16進値のいずれかです。"
    },
    {
      "indent": 3,
      "text": "ConnMode indicates the connection mode where:",
      "ja": "ConnModeはどこ接続モードを示します。"
    },
    {
      "indent": 6,
      "text": "* \"I\" indicates \"inactive\" connection mode * \"S\" indicates \"sendonly\" connection mode * \"R\" indicates \"recvonly\" connection mode * \"B\" indicates \"sendrecv\" connection mode * \"C\" indicates \"confrnce\" connection mode * \"L\" indicates \"loopback\" connection mode * \"T\" indicates \"conttest\" connection mode * \"N\" indicates \"netwloop\" connection mode * \"U\" indicates some other connection mode",
      "ja": "*「私は」*「B」は「のsendrecv」接続モードを示し、「S」は「sendonlyで」接続モード*「R」は「recvonlyで」接続モードを示す示し*「非アクティブ」接続モードを示す*「C」は「confrnce」接続モードを示します*「L」は「ループバック」接続モードを示す*「T」は「conttest」接続モードを示す*「N」は「netwloop」接続モードを示す*「U」は、いくつかの他の接続モードを示します"
    },
    {
      "indent": 3,
      "text": "For a definition of MGCP connection modes, refer to section 3.2.2.6 of [3].",
      "ja": "MGCP接続モードの定義については、[3]のセクション3.2.2.6を参照してください。"
    },
    {
      "indent": 3,
      "text": "If an endpoint has no connections on it, ModeOrCount is given the value \"0\". If there is one connection associated with the endpoint, the symbol for the connection mode (ConnMode) is provided. If, on the other hand, there are from 2 to 15 connections, a symbol representing the number of connections (ConnCount) is provided followed by a list of symbols indicating the connection mode (ConnMode) for each connection. If there are more than 15 connections, \"Z\" is indicated for ConnCount and no connection modes are provided for the connections on that endpoint.",
      "ja": "エンドポイントが、それには何の接続を持っていない場合は、ModeOrCountは値「0」が与えられています。エンドポイントに関連付けられた一つの接続がある場合、接続モードのシンボル（ConnMode）が設けられています。一方、2〜15の接続から存在する場合、接続（ConnCount）の数を表す記号は、各接続のための接続モード（ConnMode）を示すシンボルのリストが続く設けられています。 15の以上の接続がある場合、「Z」はConnCountために示されているとは接続モードは、そのエンドポイントに接続するために設けられていません。"
    },
    {
      "indent": 0,
      "text": "2.1.1.6. EndpointStateList Parameter",
      "section_title": true,
      "ja": "2.1.1.6。 EndpointStateListパラメータ"
    },
    {
      "indent": 3,
      "text": "The EndpointStateList gives an overview of the endpoint state for a series of endpoints. It consists of a number of lines with the following ABNF syntax:",
      "ja": "EndpointStateListは、エンドポイントのシリーズのエンドポイントの状態の概要を説明します。これは、次のABNF構文の行数で構成されています。"
    },
    {
      "indent": 6,
      "text": "\"BA/S:\" 0*WSP EndPointState 0*(EndPointState)",
      "ja": "\"BA / S：\" 0 * WSP EndPointState 0 *（EndPointState）"
    },
    {
      "indent": 6,
      "text": "EndPointState = \"T\" / \"F\" / \"O\"",
      "ja": "EndPointState = \"T\" / \"F\" / \"O\""
    },
    {
      "indent": 3,
      "text": "where:",
      "ja": "どこ："
    },
    {
      "indent": 6,
      "text": "* \"T\" indicates \"True\" * \"F\" indicates \"False\" * \"O\" indicates \"Out of Service\"",
      "ja": "*「T」は、「真の」*「Fは」*「O」「サービスの不足」を示す「偽」を示す示し"
    },
    {
      "indent": 3,
      "text": "The \"True\" or \"False\" determination is based on the criteria supplied in StateType parameters when the request is made.",
      "ja": "「true」または「false」決意を要求が行われたときStateTypeパラメータで供給された基準に基づいています。"
    },
    {
      "indent": 3,
      "text": "Note that the EndPointState indicator does not say anything about the connection state of the endpoint.",
      "ja": "EndPointStateインジケータは、エンドポイントの接続状態については何も言っていないことに注意してください。"
    },
    {
      "indent": 0,
      "text": "2.1.1.7. NextEndpointName Parameter",
      "section_title": true,
      "ja": "2.1.1.7。 NextEndpointNameパラメータ"
    },
    {
      "indent": 3,
      "text": "The NextEndpointName parameter will be included in the return, if there are additional endpoints in this gateway covered by the wild-carded endpoint name that were not reported, but for which information was available to be reported.",
      "ja": "NextEndpointNameパラメータが報告されていない野生カーディングエンドポイント名によってカバーされ、このゲートウェイでは、追加のエンドポイントがある場合、戻り値に含まれますが、そのための情報が報告されるために利用可能だったことでしょう。"
    },
    {
      "indent": 3,
      "text": "Note that the NextEndpointName is the LocalEndpointName (as opposed to EndpointName) of the next endpoint after the last endpoint reported. The syntax is as follows:",
      "ja": "最後のエンドポイントが報告された後NextEndpointNameは、次のエンドポイントのLocalEndpointName（ポイントendpointNameではなく）であることに注意してください。構文は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "\"BA/NE\" \":\" 0*WSP LocalEndpointName",
      "ja": "\"BA / NE\" \"：\" 0 * WSP LocalEndpointName"
    },
    {
      "indent": 3,
      "text": "A gateway may supply a report that is shorter than the request if the resulting report would have resulted in a message that would be too large (i.e., such that the report is larger than the maximum datagram size). In the case where the gateway supplied a response for less endpoints than requested, the gateway MUST supply NextEndpointName in the response.",
      "ja": "ゲートウェイは、結果のレポートは、（報告書は、最大データグラムサイズより大きいこと、すなわち、このような）大きすぎるメッセージをもたらしたであろう場合、要求より短いレポートを供給することができます。ゲートウェイは、要求されたよりも少ないエンドポイントの応答を供給した場合に、ゲートウェイが応答してNextEndpointNameを供給しなければなりません。"
    },
    {
      "indent": 3,
      "text": "In order to continue the audit on a following set of endpoints, the Call Agent can make a further request by using the NextEndpointName as the starting point (e.g., as the StartEndpointName in a following request).",
      "ja": "エンドポイントの次のセットの監査を継続するために、コールエージェント（例えば、以下の要求にStartEndpointNameとして）出発点としてNextEndpointNameを用いて、さらに要求を行うことができます。"
    },
    {
      "indent": 0,
      "text": "2.1.1.8. ReportedEndpointList Parameter",
      "section_title": true,
      "ja": "2.1.1.8。 ReportedEndpointListパラメータ"
    },
    {
      "indent": 3,
      "text": "A ReportedEndpointList MUST be provided in a response line before list(s) of EndpointStateList and/or ConnectionCountList in order to clearly specify the list of endpoints that are being reported. The ABNF syntax is as follows:",
      "ja": "ReportedEndpointListは明確に報告されているエンドポイントのリストを指定するためにEndpointStateList及び/又はConnectionCountListのリスト（複数可）の前に、応答ラインに設けなければなりません。次のようにABNFの構文は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "\"BA/EL:\" 0*WSP LimitedRangedName 0*(\",\" 0*WSP LimitRangedName)",
      "ja": "\"BA / EL：\" 0 * 0 * WSP LimitedRangedName（ \"\" 0 * WSP LimitRangedName）"
    },
    {
      "indent": 3,
      "text": "where LimitedRangedName is a LocalEndpointName that may include a ranged wildcard notation (RangeWildcard syntax indicated earlier). However, unlike the RangedLocalName that allows the range wildcard notation to be used on multiple terms of the local name at the same time, LimitedRangedName only allows the range notation to be used for the last term, i.e., the following is valid:",
      "ja": "LimitedRangedNameは範囲ワイルドカード表記（先に示したRangeWildcard構文）を含んでいてもよいLocalEndpointNameあります。しかし、範囲ワイルドカード表記が同時にローカル名の複数の条件で使用することができRangedLocalName異なり、LimitedRangedNameのみ、すなわち、以下が有効で、範囲表記は、最後の用語のために使用されることを可能にします。"
    },
    {
      "indent": 6,
      "text": "ba/el: ds/ds1-1/[1,3-5,8-24]",
      "ja": "BA /エル：DS / ds1-1 / [1,3-5,8-24]"
    },
    {
      "indent": 3,
      "text": "or",
      "ja": "または"
    },
    {
      "indent": 6,
      "text": "ba/el: ds/ds1-1/[1-24], ds/ds1-2/[1-24], ds/ds1-3/[1-24]",
      "ja": "BA / EL：DS / ds1-1 / [1-24]、土/ ds1-2 / [1-24]、土/ ds1-3 / [1-24]"
    },
    {
      "indent": 3,
      "text": "However, the following is not valid:",
      "ja": "ただし、以下は有効ではありません。"
    },
    {
      "indent": 6,
      "text": "ba/el: ds/ds1-[1-3]/[1-24]",
      "ja": "BA / EL：DS / ds1- [1-3] / [1-24]"
    },
    {
      "indent": 3,
      "text": "Note that a single bulk audit request may include a request to return both ConnectionCountList and EndpointStateList. However, the resulting report that includes both MUST cover the same endpoints.",
      "ja": "単一のバルク監査要求がConnectionCountListとEndpointStateList両方を戻すための要求を含んでもよいことに留意されたいです。しかし、両方を含んで生成されるレポートには、同じエンドポイントをカバーしなければなりません。"
    },
    {
      "indent": 3,
      "text": "A single bulk audit request may also include a request to return both EndPointNameList and InstantiatedEndpointList. However, requests for either an EndPointNameList and/or an InstantiatedEndpointList MUST NOT include a request for either ConnectionCountList or EndpointStateList.",
      "ja": "単一のバルク監査要求もEndPointNameListとInstantiatedEndpointList両方を戻すための要求を含むことができます。しかし、EndPointNameListおよび/またはInstantiatedEndpointListのいずれかの要求はConnectionCountListまたはEndpointStateListのいずれかの要求を含んではいけません。"
    },
    {
      "indent": 0,
      "text": "2.1.2. Bulk Auditing of Non-persistent Virtual Endpoints",
      "section_title": true,
      "ja": "2.1.2。非永続仮想エンドポイントの一括監査"
    },
    {
      "indent": 3,
      "text": "Note that gateways that have non-persistent virtual endpoints may have instantiated endpoints that are disjoint with respect to the name space. The ReportedEndpointList in front of a ConnectionCountList and/or EndpointStateList describes exactly which endpoints are being reported.",
      "ja": "非永続仮想エンドポイントを持つゲートウェイは名前空間に関して互いに素であるエンドポイントをインスタンス化している可能性があることに注意してください。 ConnectionCountListおよび/またはEndpointStateListの前でReportedEndpointListは、エンドポイントが報告されているかを正確に説明しています。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 6,
      "text": "A Call Agent requests to know about the EndPointNameList for the endpoints on a conference bridge:",
      "ja": "コール・エージェントは、会議ブリッジ上のエンドポイントについてEndPointNameListについて知っていることを要求します："
    },
    {
      "indent": 6,
      "text": "AUEP 1200 *@gw1.x.net MGCP 1.0 BA/F: BA/Z",
      "ja": "AUEP 1200 *@gw1.x.net MGCP 1.0 BA / F：BA / Z"
    },
    {
      "indent": 3,
      "text": "Response:",
      "ja": "応答："
    },
    {
      "indent": 6,
      "text": "200 1200 OK\nba/z: cnf/*",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "This indicates the naming convention but in fact not all of these endpoints are instantiated. A request for the list of instantiated endpoints, i.e.,:",
      "ja": "これは、命名規則を示しますが、実際にはこれらのエンドポイントのすべてがインスタンス化されません。インスタンス化されたエンドポイント、すなわちのリストの要求、。："
    },
    {
      "indent": 6,
      "text": "AUEP 1201 cnf/*@gw1.x.net MGCP 1.0\nBA/F: BA/X",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "might yield:",
      "ja": "得かもしれません："
    },
    {
      "indent": 6,
      "text": "200 1201 OK ba/x: cnf/[1-3] ba/x: cnf/[6-12]",
      "ja": "200 1201 OK BA / X：CNF / [1-3] BA / X：CNF / [6-12]"
    },
    {
      "indent": 3,
      "text": "indicating that only these particular endpoints are instantiated.",
      "ja": "唯一のこれらの特定のエンドポイントがインスタンス化されていることを示しています。"
    },
    {
      "indent": 3,
      "text": "Suppose the Call Agent now asks for the ConnectionCountList i.e.,:",
      "ja": "コールエージェントが今ConnectionCountListのすなわちを要求すると仮定し、。："
    },
    {
      "indent": 6,
      "text": "AUEP 1202 cnf/*@gw1.x.net MGCP 1.0\nBA/F: BA/C",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The resulting instantiated virtual endpoints may be disjoint, which would be indicated by the ReportedEndpointList in front of the ConnectionCountList, e.g.,:",
      "ja": "得られたインスタンス化された仮想エンドポイントは、例えばConnectionCountListの前にReportedEndpointListによって示されるであろう、ばらばらであってもよいです、。："
    },
    {
      "indent": 6,
      "text": "200 1202 OK ba/el: cnf/[1-3] ba/c: 035 ba/el: cnf/[6-12] ba/c: 3450333",
      "ja": "200 1202 OK BA / EL：CNF / [1-3] B / C：035 BA / EL：CNF / [6-12] B / C：3450333"
    },
    {
      "indent": 3,
      "text": "or alternatively:",
      "ja": "または代わりに："
    },
    {
      "indent": 6,
      "text": "200 1202 OK ba/el: cnf/[1-3], ba/el: cnf/[6-12] ba/c: 035 ba/c: 3450333",
      "ja": "200 1202 OK BA / EL：CNF / [1-3]のBa / EL：CNF / [6-12] B / C：035 B / C：3450333"
    },
    {
      "indent": 3,
      "text": "or",
      "ja": "または"
    },
    {
      "indent": 6,
      "text": "200 1202 OK ba/el: cnf/[1-3], ba/el: cnf/[6-12] ba/c: 0353450333",
      "ja": "200 1202 10月のBa / L：CNF / [1-3]のBa / L：CNF / [6-12]のBa / Q：0353450333"
    },
    {
      "indent": 0,
      "text": "2.1.3. Package Specific Return Codes",
      "section_title": true,
      "ja": "2.1.3。特定のリターンコードをパッケージ化"
    },
    {
      "indent": 3,
      "text": "The following return codes are specific to this package:",
      "ja": "次の戻りコードは、このパッケージに固有のものです："
    },
    {
      "indent": 6,
      "text": "800 Invalid NextEndpointName 801 Invalid StartEndpointName 802 Invalid or unsupported BulkRequestInfo Parameter 803 Invalid or unsupported StateType 804 Bulk Audit Type not supported 805 Incorrectly specified endpoint range 806 Requested StartEndpoint unknown or unavailable",
      "ja": "800無効NextEndpointName 801無効StartEndpointName 802無効またはサポートされていないBulkRequestInfoパラメータ803が無効またはサポートされていないStateType 804バルク監査タイプサポートされていない805誤って指定されたエンドポイントの範囲806は、要求StartEndpoint不明または使用不能"
    },
    {
      "indent": 3,
      "text": "Note that package specific error codes includes the package name following the error code. For example, if error code 801 occurs in response to a request with a transaction ID of 1001 it would be sent as:",
      "ja": "そのパッケージ固有のエラーコードをエラーコード以下のパッケージ名が含まれています。例えば、エラー・コード801は、それがとして送られる1001のトランザクションIDを持つリクエストに応答して発生した場合"
    },
    {
      "indent": 6,
      "text": "801 1001 /BA",
      "ja": "８０１ １００１ ／ば"
    },
    {
      "indent": 0,
      "text": "2.2. Examples of Package Use",
      "section_title": true,
      "ja": "2.2。パッケージの使用の例"
    },
    {
      "indent": 0,
      "text": "2.2.1. Endpoint List",
      "section_title": true,
      "ja": "2.2.1。エンドポイント一覧"
    },
    {
      "indent": 3,
      "text": "This section contains examples of how to obtain a list of endpoints.",
      "ja": "このセクションでは、エンドポイントのリストを取得する方法の例が含まれています。"
    },
    {
      "indent": 3,
      "text": "Example 1: This is an example of a gateway that contains a single OC3 that contains a single level of hierarchy at the T1 level.",
      "ja": "実施例1：これは、T1レベルの階層の単一レベルを含む単一OC3を含有するゲートウェイの一例です。"
    },
    {
      "indent": 3,
      "text": "The request is made:",
      "ja": "要求が行われます。"
    },
    {
      "indent": 6,
      "text": "AUEP 1200 *@gw1.x.net MGCP 1.0 BA/F: BA/Z",
      "ja": "AUEP 1200 *@gw1.x.net MGCP 1.0 BA / F：BA / Z"
    },
    {
      "indent": 3,
      "text": "This may result in a single \"BA/Z\" term with ranges specifying all of the endpoints.",
      "ja": "これは、すべてのエンドポイントを特定の範囲を有する単一の「BA / Z」という用語をもたらすことができます。"
    },
    {
      "indent": 6,
      "text": "200 1200 OK ba/z: ds/ds1-[1-84]/[1-24]",
      "ja": "200 1200 OK BA / Z：DS / ds1- [1-84] / [1-24]"
    },
    {
      "indent": 3,
      "text": "Example 2: In this example the gateway has 10 analog lines and a single T1. The same request is made as in example 1, but now the response is:",
      "ja": "例2：この例ではゲートウェイ10はアナログ回線及び単一T1を有しています。同じ要求を実施例1と同様に作られ、今応答がされます。"
    },
    {
      "indent": 6,
      "text": "200 1200 OK ba/z: aaln/[1-10] ba/z: ds/ds1-1/[1-24]",
      "ja": "200 1200 OK BA / Z：AHRS / [1-10] BA / Z：DS / ds1-1 / [1-24]"
    },
    {
      "indent": 0,
      "text": "2.2.2. Connection Count List",
      "section_title": true,
      "ja": "2.2.2。接続数一覧"
    },
    {
      "indent": 3,
      "text": "Example1: Audit the number of connections on endpoints of a single E1:",
      "ja": "例1：単一E1のエンドポイント上の接続数を監査："
    },
    {
      "indent": 6,
      "text": "AUEP 2111 ds/e1-3/*@gw1.net\nBA/F: BA/C",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Response:",
      "ja": "応答："
    },
    {
      "indent": 6,
      "text": "200 2111 OK BA/EL: ds/e1-3/[1-30] BA/C: 012111210001000001000001000010",
      "ja": "OK 200 2111 BA / EL：DS / E1-3 / [1-30]のBa / C：012111210001000001000001000010"
    },
    {
      "indent": 3,
      "text": "Example 2: Audit the number of connections on endpoints of a DS3:",
      "ja": "例2：DS3のエンドポイント上の接続数を監査："
    },
    {
      "indent": 6,
      "text": "AUEP 1144 ds/ds3-1/*@gateway.net\nBA/F: BA/C",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Response:",
      "ja": "応答："
    },
    {
      "indent": 6,
      "text": "200 1144 OK BA/EL: ds/ds3-1/[1-192] BA/C: 010000010001000001000001 BA/C: 001000000101000000001001 : BA/C: 011000100010000010000010 BA/C: 011111010001000001000001 BA/C: 011000001100000001000001 BA/NE: ds/ds3-1/193",
      "ja": "200 1144 OK BA / EL：DS / ds3-1 / [1-192]のBa / C：010000010001000001000001のBa / C：001000000101000000001001：B A / C：011000100010000010000010のBa / C：011111010001000001000001のBa / C：011000001100000001000001 BA / NE：DS / ds3-1 / 193"
    },
    {
      "indent": 3,
      "text": "In this case, the response provided by the gateway contained information about the first 192 endpoints. If the ds-3 contained a T1 hierarchy, the \"BA/EL\" and \"BA/NE\" values would indicate that hierarchy e.g.,:",
      "ja": "この場合、ゲートウェイによって提供される応答は、最初の192個のエンドポイントに関する情報を含んでいました。 DS-3は、T1階層、 \"BA / EL\" を含んでおり、 \"BA / NE\" の値は、例えば、その階層を示すことになる、場合。："
    },
    {
      "indent": 6,
      "text": "200 1144 OK BA/EL: ds/ds3-1/ds1-1/[1-24] BA/C: 010000010001000001000001 BA/EL: ds/ds3-1/ds1-2/[1-24] BA/C: 001000000101000000001001 : BA/EL: ds/ds3-1/ds1-6/[1-24] BA/C: 011000100010000010000010 BA/EL: ds/ds3-1/ds1-7/[1-24] BA/C: 011111010001000001000001 BA/EL: ds/ds3-1/ds1-8/[1-24] BA/C: 011000001100000001000001 BA/NE: ds/ds3-1/ds1-9/1",
      "ja": "200 1144 OK BA / EL：DS / ds3-1 / ds1-1 / [1-24] BA / C：010000010001000001000001 BA / EL：DS / ds3-1 / ds1-2 / [1-24] BA / C： 001000000101000000001001：BA / EL：DS / ds3-1 / ds1-6 / [1-24] BA / C：011000100010000010000010 BA / EL：DS / ds3-1 / ds1-7 / [1-24] BA / C：011111010001000001000001 BA / EL：DS / ds3-1 / ds1-8 / [1-24] BA / C：011000001100000001000001 BA / NE：DS / ds3-1 / ds1-9 / 1"
    },
    {
      "indent": 3,
      "text": "The Call Agent could continue to request endpoints by indicating the starting endpoint where it left off, i.e., simply using the returned \"BE/NE\" value as the \"BA/SE\" value for the next request:",
      "ja": "コール・エージェントは、それが中断した場所、すなわち、単純に次の要求のための「BA / SE」値として返さ「BE / NE」の値を使用して、開始エンドポイントを示すことによって、エンドポイントを要求し続けることができます："
    },
    {
      "indent": 6,
      "text": "AUEP 1145 ds/ds3-3/*@gw1.net\nBA/F: BA/C\nBA/SE: ds/ds3-1/ds1-9/1",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Example 3: In this case, the Call Agent wants to know about the connection state of 12 DS0's starting with the endpoint with the LocalEndpointName \"ds/ds3-1/ds1-6/4\":",
      "ja": "例3：この場合は、コールエージェントは12 DS0のはLocalEndpointName「DS / ds3-1 / ds1-6 / 4」とエンドポイントから始まるの接続状態について知りたいです："
    },
    {
      "indent": 6,
      "text": "AUEP 1146 ds/ds3-1/*@gw1.net\nBA/F: BA/C\nBA/SE: ds/ds3-1/ds1-6/4\nBA/NU: 12",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Response:",
      "ja": "応答："
    },
    {
      "indent": 6,
      "text": "200 1144 OK BA/EL: ds/ds3-1/ds1-6/[4-15] BA/C: 011000010001 BA/NE: ds/ds3-1/ds1-6/16",
      "ja": "200 1144 OK BA / EL：DS / ds3-1 / ds1-6 / [4-15] BA / C：011000010001 BA / NE：DS / ds3-1 / ds1-6 / 16"
    },
    {
      "indent": 0,
      "text": "2.2.3. Connection Mode List",
      "section_title": true,
      "ja": "2.2.3。接続モード一覧"
    },
    {
      "indent": 3,
      "text": "Example: Audit the connection modes for connections on the endpoints of a single E1:",
      "ja": "例：単一E1のエンドポイント上の接続のための接続モードを監査："
    },
    {
      "indent": 6,
      "text": "AUEP 2111 ds/e1-3/*@gw1.net\nBA/F: BA/M",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Response:",
      "ja": "応答："
    },
    {
      "indent": 6,
      "text": "200 2111 OK BA/EL: ds/e1-3/[1-30] BA/M: 0R2BRBBB2RRB000B00000B00000B0000B0",
      "ja": "200 2111 OK BA / EL：DS / E1-3 / [1-30] BA / M：0R2BRBBB2RRB000B00000B00000B0000B0"
    },
    {
      "indent": 3,
      "text": "This shows that:",
      "ja": "これは、ことを示しています。"
    },
    {
      "indent": 3,
      "text": "* Endpoint ds/e1-3/1 has no connections * Endpoint ds/e1-3/2 has one connection and it is in \"recvonly\" mode. * Endpoint ds/e1-3/3 has two connections which are in \"sendrecv\" and \"recvonly\" mode * Endpoints ds/e1-3/4 to ds/e1-3/6 each have one connection - in \"sendrecv\" mode in all cases * Endpoints ds/e1-3/7 has two connections, both in \"recvonly\" mode * etc.",
      "ja": "*エンドポイントDS / E1-3 / 1全く接続がありません*エンドポイントDS / E1-3 / 2つの接続を持っており、それが \"recvonlyで\" モードになっています。 \"のsendrecv\" モードで -  *エンドポイントDS / E1-3 / 3 DSを \"のsendrecv\" および \"recvonlyで\" モードにある2つの接続*エンドポイントDS / E1-3 / 4 / E1-3 / 6は、それぞれ一つの接続を持っていますすべての場合において*エンドポイントのDS / E1-3 / 7の両方「がrecvonly」モード*などで2つの接続を、持っています"
    },
    {
      "indent": 0,
      "text": "2.2.4. Endpoint State",
      "section_title": true,
      "ja": "2.2.4。エンドポイントの状態"
    },
    {
      "indent": 3,
      "text": "Endpoint state requests and responses are similar. An example of requesting endpoint state similar to example 3 in the previous section:",
      "ja": "エンドポイントの状態要求と応答は似ています。前のセクションで、実施例3と同様のエンドポイントの状態を要求する例："
    },
    {
      "indent": 6,
      "text": "AUEP 1150 ds/ds3-1/*@gw1.net\nBA/F: BA/S(I)\nBA/SE: ds/ds3-1/ds1-6/4\nBA/NU: 12",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Response:",
      "ja": "応答："
    },
    {
      "indent": 6,
      "text": "200 1150 OK BA/EL: ds/ds3-1/ds1-6/[4-15] BA/S: TOOTTOOTTOOT BA/NE: ds/ds3-1/ds1-6/16",
      "ja": "200 1150 OK BA / EL：DS / ds3-1 / ds1-6 / [4-15] BA / S：TOOTTOOTTOOTのBA / NE：DS / ds3-1 / ds1-6 / 16"
    },
    {
      "indent": 3,
      "text": "The request for in-service endpoints returns \"True\" for all endpoints in-service, and \"O\" for all endpoints \"Out of Service\".",
      "ja": "インサービスのエンドポイントに対する要求は、サービス中のすべてのエンドポイントのための「True」を返し、「サービスのうち、」すべてのエンドポイントの「O」。"
    },
    {
      "indent": 3,
      "text": "A similar request but with additional parameters might be:",
      "ja": "しかし、追加のパラメータを持つ同様の要求は次のようになります。"
    },
    {
      "indent": 6,
      "text": "AUEP 1151 ds/ds3-1/*@gw1.net\nBA/F: BA/S(H,N)\nBA/SE: ds/ds3-1/ds1-6/4\nBA/NU: 12",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Response:",
      "ja": "応答："
    },
    {
      "indent": 6,
      "text": "200 1151 OK BA/EL: ds/ds3-1/ds1-6/[4-15] BA/S: FFFTFFFFFFFO BA/NE: ds/ds3-1/ds1-6/16",
      "ja": "200 1151 OK BA / EL：DS / ds3-1 / ds1-6 / [4-15] BA / S：FFFTFFFFFFFO BA / NE：DS / ds3-1 / ds1-6 / 16"
    },
    {
      "indent": 3,
      "text": "This indicates that at least one of the StateType parameters \"H\" (off-hook) and \"N\" (notification state) evaluated to true for the endpoints that have a \"T\" associated with then (i.e., ds/ds3-1/ds1- 6/7 and ds/ds3-1/ds1-6/16 since the request started from ds/ds3- 1/ds1-6/4). All other endpoints are neither off-hook nor in the \"notification state\". Note that endpoint ds/ds3-1/ds1-6/15 is marked as being out-of-service.",
      "ja": "これは、StateTypeパラメータの少なくとも一つが「H」（オフフック）および「N」（通知状態）、その後（すなわち、DS / ds3-1 /に関連付けられた「T」を有するエンドポイントのために真と評価されていることを示しds1- 6/7とDS / ds3-1 / ds1-6 / 16要求がDSから開始してから/ ds3- 1 / ds1-6 / 4）。他のすべてのエンドポイントは、どちらもオフフックでも「通知状態」にあります。 DS / ds3-1 / ds1-6 / 15エンドポイントノートはアウトオブサービスとしてマークされています。"
    },
    {
      "indent": 3,
      "text": "It is possible to request both connection state and endpoint state in the same request such as:",
      "ja": "同じ要求で接続状態とエンドポイントの状態の両方を要求することが可能です。"
    },
    {
      "indent": 6,
      "text": "AUEP 1151 ds/ds3-1/*@gw1.net\nBA/F: BA/S(H,N), BA/C\nBA/SE: ds/ds3-1/ds1-6/4\nBA/NU: 12",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In this case, the response might be:",
      "ja": "この場合、応答は次のようになります。"
    },
    {
      "indent": 6,
      "text": "200 1151 OK BA/EL: ds/ds3-1/ds1-6/[4-15] BA/S: FFFTFFFFFFFO BA/C: 011000010001 BA/NE: ds/ds3-1/ds1-6/16",
      "ja": "200 1151 OK BA / EL：DS / ds3-1 / ds1-6 / [4-15] BA / S：FFFTFFFFFFFO BA / C：011000010001 BA / NE：DS / ds3-1 / ds1-6 / 16"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The MGCP package title, \"Bulk Audit\", with the name, \"BA\", has been registered with IANA as indicated in Appendix C.1 in [3].",
      "ja": "[3]の付録C.1に示されるように、「BA」の名前でMGCPパッケージタイトル、「バルク監査」は、IANAに登録されています。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Section 5 of the base MGCP specification [3] discusses security requirements for the base protocol, which apply equally to the package defined in this document. Use of a security Protocol such as IPsec [4, 5] that provides per message authentication and integrity services is required in order to ensure that requests and responses are obtained from authenticated sources and that messages have not been modified. Without such services, gateways and Call Agents are open to attacks.",
      "ja": "ベースMGCP仕様[3]のセクション5は、本文書で定義されたパッケージにも同様に適用ベースプロトコルのためのセキュリティ要件を論じています。メッセージ認証と完全性サービスごとに提供するようにIPsec [4、5]などのセキュリティプロトコルを使用することは、要求と応答が認証ソースから取得されていることと、メッセージが変更されていないことを保証するために必要とされます。このようなサービスがなければ、ゲートウェイやコールエージェントは、攻撃に開放されています。"
    },
    {
      "indent": 3,
      "text": "For example, although audit requests from unauthorized sources will not modify media gateway state, the information provided could be used to locate idle endpoints, which could then lead to making unauthorized calls. Similarly, an attack that modifies a response to an audit returned to a Call Agent could lead to a denial of service attack in which a Call Agent that is provided misinformation as to endpoint state could take some incorrect action such as taking valid calls out of service.",
      "ja": "不正なソースからの監査要求は、メディアゲートウェイの状態を変更しないであろうが、例えば、提供された情報は、次に、不正な呼び出しを行うにつながる可能性がアイドルエンドポイントを見つけるために使用することができます。同様に、コールエージェントに戻り、監査への応答を変更する攻撃は状態をエンドポイントするよう誤報を提供され、コールエージェントは、このようなサービスのうち、有効な電話を取ると、いくつかの間違った行動をとる可能性がある、サービス拒否攻撃につながる可能性。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 2234, November 1997.",
      "ja": "[1]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、RFC 2234、1997年11月。"
    },
    {
      "indent": 3,
      "text": "[2] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[2]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[3] Andreasen, F. and B. Foster, \"Media Gateway Control Protocol (MGCP) Version 1.0\", RFC 3435, January 2003.",
      "ja": "[3]アンドレア、F.およびB.フォスター、 \"メディアゲートウェイコントロールプロトコル（MGCP）バージョン1.0\"、RFC 3435、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[4] Kent, S. and R. Atkinson, \"Security Architecture for the Internet Protocol\", RFC 2401, November 1998.",
      "ja": "[4]ケント、S.とR.アトキンソン、 \"インターネットプロトコルのためのセキュリティー体系\"、RFC 2401、1998年11月。"
    },
    {
      "indent": 3,
      "text": "[5] Kent, S. and R. Atkinson, \"IP Encapsulating Security Payload (ESP)\", RFC 2406, November 1998.",
      "ja": "[5]ケント、S.とR.アトキンソン、 \"IPカプセル化セキュリティペイロード（ESP）\"、RFC 2406、1998年11月。"
    },
    {
      "indent": 0,
      "text": "6. Authors' Addresses",
      "section_title": true,
      "ja": "6.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Flemming Andreasen Cisco Systems 499 Thornall Street, 8th Floor Edison, NJ 08837",
      "ja": "フレミングAndreasenのシスコシステムズ499 Thornallストリート、8階エジソン、NJ 08837"
    },
    {
      "indent": 3,
      "text": "EMail: fandreas@cisco.com",
      "ja": "メールアドレス：fandreas@cisco.com"
    },
    {
      "indent": 3,
      "text": "David Auerbach Cisco Systems Inc. 170 W. Tasman Drive San Jose, CA, 95134",
      "ja": "デビッド・アウエルバッハシスコシステムズ株式会社170 W.タスマン・ドライブサンノゼ、CA、95134"
    },
    {
      "indent": 3,
      "text": "EMail: dea@cisco.com",
      "ja": "メールアドレス：dea@cisco.com"
    },
    {
      "indent": 3,
      "text": "Bill Foster Cisco Systems",
      "ja": "ビル・フォスターシスコシステムズ"
    },
    {
      "indent": 3,
      "text": "EMail: bfoster@cisco.com",
      "ja": "メールアドレス：bfoster@cisco.com"
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "ja": "7.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の制限は永続的なものであり、インターネットソサエティもしくはその継承者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}