{
  "title": {
    "text": "RFC 3014 - Notification Log MIB",
    "ja": "RFC 3014 - 通知ログMIB"
  },
  "number": 3014,
  "created_at": "2020-08-16 18:55:43.164257+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                            Editor of this version:\nRequest for Comments: 3014                                  R. Kavasseri\nCategory: Standards Track                            Cisco Systems, Inc.\n                                             Author of previous version:\n                                                              B. Stewart\n                                                           November 2000",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Notification Log MIB",
      "ja": "通知ログMIB"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（2000）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes managed objects used for logging Simple Network Management Protocol (SNMP) Notifications.",
      "ja": "このメモは、インターネットコミュニティのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、SNMP（Simple Network Management Protocol）通知のロギングに使用される管理対象オブジェクトについて説明します。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119.",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 RFC 2119で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1 The SNMP Management Framework .................................  2\n2 Overview ......................................................  3\n2.1 Environment .................................................  3\n2.1.1 SNMP Engines and Contexts .................................  4\n2.1.2 Security ..................................................  4\n2.2 Structure ...................................................  5\n2.2.1 Configuration .............................................  5\n2.2.2 Statistics ................................................  6\n2.2.3 Log .......................................................  6\n2.3 Example .....................................................  6\n3 Definitions ...................................................  7\n4 Intellectual Property ......................................... 23\n5 References .................................................... 23\n6 Security Considerations ....................................... 25\n7 Author's Address .............................................. 25\n8 Full Copyright Statement ...................................... 26",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. The SNMP Management Framework",
      "section_title": true,
      "ja": "1. SNMP管理フレームワーク"
    },
    {
      "indent": 3,
      "text": "The SNMP Management Framework presently consists of five major components:",
      "ja": "現在、SNMP管理フレームワークは5つの主要コンポーネントで構成されています。"
    },
    {
      "indent": 6,
      "text": "o An overall architecture, described in RFC 2571 [RFC2571].",
      "ja": "o RFC 2571 [RFC2571]で説明されている全体的なアーキテクチャ。"
    },
    {
      "indent": 6,
      "text": "o Mechanisms for describing and naming objects and events for the purpose of management. The first version of this Structure of Management Information (SMI) is called SMIv1 and described in STD 16, RFC 1155 [RFC1155], STD 16, RFC 1212 [RFC1212] and RFC 1215 [RFC1215]. The second version, called SMIv2, is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "ja": "o 管理の目的でオブジェクトとイベントを記述および命名するためのメカニズム。この管理情報構造（SMI）の最初のバージョンはSMIv1と呼ばれ、STD 16、RFC 1155 [RFC1155]、STD 16、RFC 1212 [RFC1212]およびRFC 1215 [RFC1215]で説明されています。 SMIv2と呼ばれる2番目のバージョンは、STD 58、RFC 2578 [RFC2578]、STD 58、RFC 2579 [RFC2579]およびSTD 58、RFC 2580 [RFC2580]で説明されています。"
    },
    {
      "indent": 6,
      "text": "o Message protocols for transferring management information. The first version of the SNMP message protocol is called SNMPv1 and described in STD 15, RFC 1157 [RFC1157]. A second version of the SNMP message protocol, which is not an Internet standards track protocol, is called SNMPv2c and described in RFC 1901 [RFC1901] and RFC 1906 [RFC1906]. The third version of the message protocol is called SNMPv3 and described in RFC 1906 [RFC1906], RFC 2572 [RFC2572] and RFC 2574 [RFC2574].",
      "ja": "o 管理情報を転送するためのメッセージプロトコル。 SNMPメッセージプロトコルの最初のバージョンはSNMPv1と呼ばれ、STD 15、RFC 1157 [RFC1157]で説明されています。インターネット標準トラックプロトコルではない、SNMPメッセージプロトコルの2番目のバージョンはSNMPv2cと呼ばれ、RFC 1901 [RFC1901]およびRFC 1906 [RFC1906]で説明されています。メッセージプロトコルの3番目のバージョンはSNMPv3と呼ばれ、RFC 1906 [RFC1906]、RFC 2572 [RFC2572]、およびRFC 2574 [RFC2574]で説明されています。"
    },
    {
      "indent": 6,
      "text": "o Protocol operations for accessing management information. The first set of protocol operations and associated PDU formats is described in STD 15, RFC 1157 [RFC1157]. A second set of protocol operations and associated PDU formats is described in RFC 1905 [RFC1905].",
      "ja": "o 管理情報にアクセスするためのプロトコル操作。プロトコル操作と関連するPDU形式の最初のセットは、STD 15、RFC 1157 [RFC1157]で説明されています。プロトコル操作と関連するPDU形式の2番目のセットは、RFC 1905 [RFC1905]で説明されています。"
    },
    {
      "indent": 6,
      "text": "o A set of fundamental applications described in RFC 2573 [RFC2573] and the view-based access control mechanism described in RFC 2575 [RFC2575].",
      "ja": "o RFC 2573 [RFC2573]で説明されている基本的なアプリケーションのセットと、RFC 2575 [RFC2575]で説明されているビューベースのアクセス制御メカニズム。"
    },
    {
      "indent": 3,
      "text": "A more detailed introduction to the current SNMP Management Framework can be found in RFC 2570 [RFC2570].",
      "ja": "現在のSNMP管理フレームワークの詳細については、RFC 2570 [RFC2570]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. Objects in the MIB are defined using the mechanisms defined in the SMI.",
      "ja": "管理対象オブジェクトは、管理情報ベースまたはMIBと呼ばれる仮想情報ストアを介してアクセスされます。 MIB内のオブジェクトは、SMIで定義されたメカニズムを使用して定義されます。"
    },
    {
      "indent": 3,
      "text": "This memo specifies a MIB module that is compliant to the SMIv2. A MIB conforming to the SMIv1 can be produced through the appropriate translations. The resulting translated MIB must be semantically equivalent, except where objects or events are omitted because no translation is possible (use of Counter64). Some machine readable information in SMIv2 will be converted into textual descriptions in SMIv1 during the translation process. However, this loss of machine readable information is not considered to change the semantics of the MIB.",
      "ja": "このメモは、SMIv2に準拠するMIBモジュールを指定します。 SMIv1に準拠したMIBは、適切な変換によって生成できます。結果の変換されたMIBは、変換ができないためにオブジェクトまたはイベントが省略されている場合（Counter64の使用）を除いて、意味的に同等でなければなりません。 SMIv2の一部の機械可読情報は、変換プロセス中にSMIv1のテキスト記述に変換されます。ただし、この機械可読情報の損失は、MIBのセマンティクスを変更するとは見なされません。"
    },
    {
      "indent": 0,
      "text": "2. Overview",
      "section_title": true,
      "ja": "2. 概観"
    },
    {
      "indent": 3,
      "text": "Systems that support SNMP often need a mechanism for recording Notification information as a hedge against lost Notifications, whether those are Traps or Informs [RFC1905] that exceed retransmission limits. This MIB therefore provides common infrastructure for other MIBs in the form of a local logging function. It is intended primarily for senders of Notifications but could be used also by receivers.",
      "ja": "SNMPをサポートするシステムでは、再送信制限を超えるトラップまたはインフォーム[RFC1905]であるかどうかにかかわらず、失われた通知に対するヘッジとして通知情報を記録するメカニズムが必要になることがよくあります。したがって、このMIBは、ローカルロギング機能の形式で他のMIBに共通のインフラストラクチャを提供します。これは主に通知の送信者を対象としていますが、受信者も使用できます。"
    },
    {
      "indent": 3,
      "text": "Given the Notification Log MIB, individual MIBs bear less responsibility to record the transient information associated with an event against the possibility that the Notification message is lost, and applications can poll the log to verify that they have not missed important Notifications.",
      "ja": "通知ログMIBがある場合、個々のMIBは、通知メッセージが失われる可能性に対して、イベントに関連する一時的な情報を記録する責任が少なく、アプリケーションはログをポーリングして、重要な通知を見逃していないことを確認できます。"
    },
    {
      "indent": 0,
      "text": "2.1. Environment",
      "section_title": true,
      "ja": "2.1. 環境"
    },
    {
      "indent": 3,
      "text": "The overall environmental concerns for the MIB are:",
      "ja": "MIBの全体的な環境問題は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "o SNMP Engines and Contexts",
      "ja": "o SNMPエンジンとコンテキスト"
    },
    {
      "indent": 6,
      "text": "o Security",
      "ja": "o 安全保障"
    },
    {
      "indent": 0,
      "text": "2.1.1. SNMP Engines and Contexts",
      "section_title": true,
      "ja": "2.1.1. SNMPエンジンとコンテキスト"
    },
    {
      "indent": 3,
      "text": "There are two distinct information flows from multiple notification originators that one may log. The first is the notifications that are received (from one or more SNMP engines) for logging as SNMP informs and traps. The other comprises notifications delivered to an SNMP engine at the interface to the notification originator (using a notification mechanism other than SNMP informs or traps). The latter information flow (using a notification mechanism other than SNMP informs or traps) is modeled here as the SNMP engine (which maintains the log) sending a notification to itself. The remainder of this section discusses the handling of the former information flow - notifications (received in the form of SNMP informs or traps) from multiple SNMP engines.",
      "ja": "ログに記録される可能性のある複数の通知元からの2つの異なる情報フローがあります。 1つ目は、SNMPインフォームおよびトラップとしてロギングするために（1つ以上のSNMPエンジンから）受信される通知です。もう1つは、通知元のインターフェイス（SNMP通知またはトラップ以外の通知メカニズムを使用）でSNMPエンジンに配信される通知です。後者の情報フロー（SNMP通知またはトラップ以外の通知メカニズムを使用）は、ここで、SNMPエンジン（ログを保持する）がそれ自体に通知を送信することとしてモデル化されています。このセクションの残りの部分では、以前の情報フロー（複数のSNMPエンジンからの通知（SNMPインフォームまたはトラップの形式で受信））の処理について説明します。"
    },
    {
      "indent": 3,
      "text": "As described in the SNMP architecture [RFC2571], a given system may support multiple SNMP engines operating independently of one another, each with its own SNMP engine identification. Furthermore, within the purview of a given engine there may be multiple named management contexts supporting overlapping or disjoint sets of MIB objects and Notifications. Thus, understanding a particular Notification requires knowing the SNMP engine and management context from whence it came.",
      "ja": "SNMPアーキテクチャ[RFC2571]で説明されているように、特定のシステムは、それぞれが独自のSNMPエンジンIDを使用して、互いに独立して動作する複数のSNMPエンジンをサポートする場合があります。さらに、特定のエンジンの範囲内で、MIBオブジェクトと通知の重複または分離したセットをサポートする複数の名前付き管理コンテキストが存在する場合があります。したがって、特定の通知を理解するには、SNMPエンジンと管理コンテキストがどこから来たかを知る必要があります。"
    },
    {
      "indent": 3,
      "text": "To provide the necessary source information for a logged Notification, the MIB includes objects to record that Notification's source SNMP engine ID and management context name.",
      "ja": "ログに記録された通知に必要なソース情報を提供するために、MIBにはその通知のソースSNMPエンジンIDと管理コンテキスト名を記録するオブジェクトが含まれています。"
    },
    {
      "indent": 0,
      "text": "2.1.2. Security",
      "section_title": true,
      "ja": "2.1.2. 安全保障"
    },
    {
      "indent": 3,
      "text": "Security for Notifications is awkward since access control for the objects in the Notification can be checked only where the Notification is created. Thus such checking is possible only for locally-generated Notifications, and even then only when security credentials are available.",
      "ja": "通知内のオブジェクトのアクセス制御は、通知が作成された場所でのみ確認できるため、通知のセキュリティは厄介です。したがって、このようなチェックは、ローカルで生成された通知に対してのみ可能であり、セキュリティ認証情報が利用可能な場合にのみ可能です。"
    },
    {
      "indent": 3,
      "text": "For the purpose of this discussion, \"security credentials\" means the input values for the abstract service interface function isAccessAllowed [RFC2571] and using those credentials means conceptually using that function to see that those credentials allow access to the MIB objects in question, operating as for a Notification Originator in [RFC2573].",
      "ja": "この説明では、「セキュリティ資格情報」とは、抽象サービスインターフェース関数isAccessAllowed [RFC2571]の入力値を意味します。これらの資格情報を使用すると、概念的にその関数を使用して、これらの資格情報が問題のMIBオブジェクトへのアクセスを許可していることを確認し、次のように動作します。 [RFC2573]の通知オリジネーター用。"
    },
    {
      "indent": 3,
      "text": "The Notification Log MIB has the notion of a \"named log.\" By using log names and view-based access control [RFC2575] a network administrator can provide different access for different users. When an application creates a named log the security credentials of the creator stay associated with that log.",
      "ja": "通知ログMIBには、「名前付きログ」という概念があります。ログ名とビューベースのアクセス制御[RFC2575]を使用することにより、ネットワーク管理者はユーザーごとに異なるアクセスを提供できます。アプリケーションが名前付きログを作成すると、作成者のセキュリティ資格情報はそのログに関連付けられたままになります。"
    },
    {
      "indent": 3,
      "text": "A managed system with fewer resources MAY disallow the creation of named logs, providing only the default, null-named log. Such a log has no implicit security credentials for Notification object access control and Notifications are put into it with no further checking.",
      "ja": "リソースが少ない管理対象システムは、名前付きログの作成を許可しない場合があり、デフォルトのnull名前付きログのみが提供されます。このようなログには、通知オブジェクトのアクセス制御のための暗黙のセキュリティ認証情報がなく、通知は追加のチェックなしでログに入れられます。"
    },
    {
      "indent": 3,
      "text": "When putting locally-generated Notifications into a named log, the managed system MUST use the security credentials associated with that log and MUST apply the same access control rules as described for a Notification Originator in [RFC2573].",
      "ja": "ローカルで生成された通知を名前付きログに入れる場合、管理対象システムはそのログに関連付けられたセキュリティ資格情報を使用する必要があり、[RFC2573]の通知元で説明されているのと同じアクセス制御規則を適用する必要があります。"
    },
    {
      "indent": 3,
      "text": "The managed system SHOULD NOT apply access control when adding remotely-generated Notifications into either a named log or the default, null-named log. In those cases the security of the information in the log SHOULD be left to the normal, overall access control for the log itself.",
      "ja": "管理対象システムは、リモートで生成された通知を名前付きログまたはデフォルトのnull名前付きログに追加するときに、アクセス制御を適用してはなりません（SHOULD NOT）。そのような場合、ログ内の情報のセキュリティは、ログ自体の通常の全体的なアクセス制御に任されるべきです（SHOULD）。"
    },
    {
      "indent": 3,
      "text": "The Notification Log MIB allows applications to set the maximum number of Notifications that can be logged, using nlmConfigGlobalEntryLimit. Similarly, an application can set the maximum age using nlmConfigGlobalAgeOut, after which older Notifications MAY be timed out. Please be aware that contention between multiple applications trying to set these objects to different values MAY affect the reliability and completeness of data seen by each application, i.e., it is possible that one application may change the value of either of these objects, resulting in some Notifications being deleted before the other applications have had a chance to see them. This could be used to orchestrate a denial-of-service attack. Methods for countering such an attack are for further study.",
      "ja": "通知ログMIBにより、アプリケーションはnlmConfigGl​​obalEntryLimitを使用して、ログに記録できる通知の最大数を設定できます。同様に、アプリケーションはnlmConfigGl​​obalAgeOutを使用して最大経過時間を設定できます。その後、古い通知がタイムアウトする場合があります。これらのオブジェクトを異なる値に設定しようとする複数のアプリケーション間の競合は、各アプリケーションによって表示されるデータの信頼性と完全性に影響を与える可能性があることに注意してください。つまり、1つのアプリケーションがこれらのオブジェクトのいずれかの値を変更し、結果として他のアプリケーションが通知を表示する前に通知が削除された。これは、サービス拒否攻撃を調整するために使用される可能性があります。このような攻撃に対抗する方法は、今後の検討課題です。"
    },
    {
      "indent": 0,
      "text": "2.2. Structure",
      "section_title": true,
      "ja": "2.2. 構造"
    },
    {
      "indent": 3,
      "text": "The MIB has the following sections:",
      "ja": "MIBには次のセクションがあります。"
    },
    {
      "indent": 6,
      "text": "o Configuration -- control over how much the log can hold and what Notifications are to be logged.",
      "ja": "o 構成-ログが保持できる量とログに記録する通知を制御します。"
    },
    {
      "indent": 6,
      "text": "o Statistics -- indications of logging activity.",
      "ja": "o 統計-ロギングアクティビティの指標。"
    },
    {
      "indent": 6,
      "text": "o Log -- the Notifications themselves.",
      "ja": "o ログ-通知自体。"
    },
    {
      "indent": 0,
      "text": "2.2.1. Configuration",
      "section_title": true,
      "ja": "2.2.1. 構成"
    },
    {
      "indent": 3,
      "text": "The configuration section contains objects to manage resource use by the MIB.",
      "ja": "構成セクションには、MIBによるリソース使用を管理するためのオブジェクトが含まれています。"
    },
    {
      "indent": 0,
      "text": " This section also contains a table to specify what logs exist and how they operate. Deciding which Notifications are to be logged depends on filters defined in the the snmpNotifyFilterTable in the standard SNMP Notification MIB [RFC2573] identified by the initial index (snmpNotifyFilterName) from that table.",
      "ja": "このセクションには、存在するログとその動作方法を指定するための表も含まれています。ログに記録する通知の決定は、そのテーブルの初期インデックス（snmpNotifyFilterName）で識別される標準のSNMP通知MIB [RFC2573]のsnmpNotifyFilterTableで定義されているフィルターによって異なります。"
    },
    {
      "indent": 0,
      "text": "2.2.2. Statistics",
      "section_title": true,
      "ja": "2.2.2. 統計学"
    },
    {
      "indent": 3,
      "text": "The statistics section contains counters for Notifications logged and discarded, supplying a means to understand the results of log capacity configuration and resource problems.",
      "ja": "統計セクションには、ログに記録されて破棄された通知のカウンターが含まれ、ログ容量の構成とリソースの問題の結果を理解する手段を提供します。"
    },
    {
      "indent": 0,
      "text": "2.2.3. Log",
      "section_title": true,
      "ja": "2.2.3. ログ"
    },
    {
      "indent": 3,
      "text": "The log contains the Notifications and the objects that came in their variable binding list, indexed by an integer that reflects when the entry was made. An application that wants to collect all logged Notifications or to know if it may have missed any can keep track of the highest index it has retrieved and start from there on its next poll, checking sysUpTime for a discontinuity that would have reset the index and perhaps have lost entries.",
      "ja": "ログには、通知と、変数バインディングリストに入ってきたオブジェクトが含まれ、エントリが作成されたときに反映される整数によってインデックスが付けられます。ログに記録されたすべての通知を収集するか、いずれかを逃したかどうかを知りたいアプリケーションは、取得した最高のインデックスを追跡し、次のポーリングでそこから開始できます。エントリーを失いました。"
    },
    {
      "indent": 3,
      "text": "Variables are in a table indexed by Notification index and variable index within that Notification. The values are kept as a \"discriminated union,\" with one value object per variable. Exactly which value object is instantiated depends on the SNMP data type of the variable, with a separate object of appropriate type for each distinct SNMP data type.",
      "ja": "変数は、通知インデックスとその通知内の変数インデックスによってインデックスが作成されたテーブルにあります。値は、変数ごとに1つの値オブジェクトを持つ「識別された共用体」として保持されます。正確にどの値オブジェクトがインスタンス化されるかは、変数のSNMPデータタイプによって異なり、SNMPデータタイプごとに適切なタイプの個別のオブジェクトがあります。"
    },
    {
      "indent": 3,
      "text": "An application can thus reconstruct the information from the Notification PDU from what is recorded in the log.",
      "ja": "したがって、アプリケーションは、ログに記録されている内容から通知PDUから情報を再構築できます。"
    },
    {
      "indent": 0,
      "text": "2.3. Example",
      "section_title": true,
      "ja": "2.3. 例"
    },
    {
      "indent": 3,
      "text": "Following is an example configuration of a named log for logging only linkUp and linkDown Notifications.",
      "ja": "以下は、linkUp通知とlinkDown通知のみをログに記録するための名前付きログの構成例です。"
    },
    {
      "indent": 3,
      "text": "In nlmConfigLogTable:",
      "ja": "nlmConfigLogTable："
    },
    {
      "indent": 6,
      "text": "nlmConfigLogFilterName.5.\"links\" = \"link-status\" nlmConfigLogEntryLimit.5.\"links\" = 0 nlmConfigLogAdminStatus.5.\"links\" = enabled nlmConfigLogOperStatus.5.\"links\" = operational nlmConfigLogStorageType.5.\"links\" = nonVolatile nlmConfigLogEntryStatus.5.\"links\" = active",
      "ja": "nlmConfigLogFilterName.5。 \"links\" = \"link-status\" nlmConfigLogEntryLimit.5。 \"links\" = 0 nlmConfigLogAdminStatus.5。 \"links\" = enabled nlmConfigLogOperStatus.5。 \"links\" =操作可能nlmConfigLogStorageType.5。 \"links\" =非揮発性nlmConfigLogEntryStatus .5。「リンク」=アクティブ"
    },
    {
      "indent": 3,
      "text": "Note that snmpTraps is:",
      "ja": "snmpTrapsは次のとおりです。"
    },
    {
      "indent": 6,
      "text": "iso.org.dod.internet.snmpV2.snmpModules.snmpMIB.snmpMIBObjects.5",
      "ja": "iso.org.dod.internet.snmpV2.snmpModules.snmpMIB.snmpMIBObjects.5"
    },
    {
      "indent": 3,
      "text": "Or numerically:",
      "ja": "または数値的に："
    },
    {
      "indent": 6,
      "text": "1.3.6.1.6.3.1.1.5",
      "ja": "１。３。６。１。６。３。１。１。５"
    },
    {
      "indent": 3,
      "text": "And linkDown is snmpTraps.3 and linkUp is snmpTraps.4.",
      "ja": "また、linkDownはsnmpTraps.3、linkUpはsnmpTraps.4です。"
    },
    {
      "indent": 3,
      "text": "So to allow the two Notifications in snmpNotifyFilterTable:",
      "ja": "したがって、snmpNotifyFilterTableで2つの通知を許可するには："
    },
    {
      "indent": 5,
      "text": "snmpNotifyFilterMask.11.\"link-status\".1.3.6.1.6.3.1.1.5.3 = ''H snmpNotifyFilterType.11.\"link-status\".1.3.6.1.6.3.1.1.5.3 = include snmpNotifyFilterStorageType.11.\"link-status\".1.3.6.1.6.3.1.1.5.3 = nonVolatile snmpNotifyFilterRowStatus.11.\"link-status\".1.3.6.1.6.3.1.1.5.3 = active",
      "ja": "snmpNotifyFilterMask.11。 \"link-status\" .1.3.6.1.6.3.1.1.5.3 = '' H snmpNotifyFilterType.11。 \"link-status\" .1.3.6.1.6.3.1.1.5.3 = include snmpNotifyFilterStorageType.11。 \"link -status \".1.3.6.1.6.3.1.1.5.3 = nonVolatile snmpNotifyFilterRowStatus.11。\" link-status \".1.3.6.1.6.3.1.1.5.3 = active"
    },
    {
      "indent": 5,
      "text": "snmpNotifyFilterMask.11.\"link-status\".1.3.6.1.6.3.1.1.5.4 = ''H snmpNotifyFilterType.11.\"link-status\".1.3.6.1.6.3.1.1.5.4 = include snmpNotifyFilterStorageType.11.\"link-status\".1.3.6.1.6.3.1.1.5.4 = nonVolatile snmpNotifyFilterRowStatus.11.\"link-status\".1.3.6.1.6.3.1.1.5.4 = active",
      "ja": "snmpNotifyFilterMask.11。 \"link-status\" .1.3.6.1.6.3.1.1.5.4 = '' H snmpNotifyFilterType.11。 \"link-status\" .1.3.6.1.6.3.1.1.5.4 = include snmpNotifyFilterStorageType.11。 \"link -status \".1.3.6.1.6.3.1.1.5.4 = nonVolatile snmpNotifyFilterRowStatus.11。\" link-status \".1.3.6.1.6.3.1.1.5.4 = active"
    },
    {
      "indent": 0,
      "text": "3. Definitions",
      "section_title": true,
      "ja": "3. 定義"
    },
    {
      "indent": 0,
      "text": "NOTIFICATION-LOG-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "IMPORTS MODULE-IDENTITY, OBJECT-TYPE, Integer32, Unsigned32, TimeTicks, Counter32, Counter64, IpAddress, Opaque, mib-2 FROM SNMPv2-SMI TimeStamp, DateAndTime, StorageType, RowStatus, TAddress, TDomain FROM SNMPv2-TC SnmpAdminString, SnmpEngineID FROM SNMP-FRAMEWORK-MIB MODULE-COMPLIANCE, OBJECT-GROUP FROM SNMPv2-CONF;",
      "ja": "IMPORTS MODULE-IDENTITY、OBJECT-TYPE、Integer32、Unsigned32、TimeTicks、Counter32、Counter64、IpAddress、Opaque、mib-2 FROM SNMPv2-SMI TimeStamp、DateAndTime、StorageType、RowStatus、TAddress、TDomain FROM SNMPv2-TC SnmpAdminString、SnmpEngineID FROM SNMP -FRAMEWORK-MIB MODULE-COMPLIANCE、SNMPv2-CONFからのOBJECT-GROUP;"
    },
    {
      "indent": 0,
      "text": "notificationLogMIB MODULE-IDENTITY LAST-UPDATED \"200011270000Z\" -- 27 November 2000 ORGANIZATION \"IETF Distributed Management Working Group\" CONTACT-INFO \"Ramanathan Kavasseri Cisco Systems, Inc. 170 West Tasman Drive, San Jose CA 95134-1706. Phone: +1 408 527 2446 Email: ramk@cisco.com\" DESCRIPTION \"The MIB module for logging SNMP Notifications, that is, Traps and Informs.\" -- Revision History",
      "ja": "notificationLogMIB MODULE-IDENTITY LAST-UPDATED \"200011270000Z\"-2000年11月27日組織 \"IETF Distributed Management Working Group\"連絡先情報 \"Ramanathan Kavasseri Cisco Systems、Inc. 170 West Tasman Drive、San Jose CA 95134-1706。電話：+1 408 527 2446電子メール：ramk@cisco.com \"説明「SNMP通知をログに記録するためのMIBモジュール、つまりトラップとインフォーム。」 -改訂履歴"
    },
    {
      "indent": 4,
      "text": "   REVISION     \"200011270000Z\"            -- 27 November 2000\n   DESCRIPTION  \"This is the initial version of this MIB.\n           Published as RFC 3014\"\n::= { mib-2 92 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "notificationLogMIBObjects OBJECT IDENTIFIER ::= { notificationLogMIB 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmConfig OBJECT IDENTIFIER ::= { notificationLogMIBObjects 1 }\nnlmStats  OBJECT IDENTIFIER ::= { notificationLogMIBObjects 2 }\nnlmLog         OBJECT IDENTIFIER ::= { notificationLogMIBObjects 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Configuration Section --",
      "ja": "--構成セクション-"
    },
    {
      "indent": 0,
      "text": "nlmConfigGlobalEntryLimit OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-write STATUS current DESCRIPTION \"The maximum number of notification entries that may be held in nlmLogTable for all nlmLogNames added together. A particular setting does not guarantee that much data can be held.",
      "ja": "nlmConfigGl​​obalEntryLimit OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-write STATUS current DESCRIPTION \"追加されたすべてのnlmLogNamesのnlmLogTableに保持できる通知エントリの最大数。特定の設定では、多くのデータを保持できるとは限りません。"
    },
    {
      "indent": 5,
      "text": "If an application changes the limit while there are Notifications in the log, the oldest Notifications MUST be discarded to bring the log down to the new limit - thus the value of nlmConfigGlobalEntryLimit MUST take precedence over the values of nlmConfigGlobalAgeOut and nlmConfigLogEntryLimit, even if the Notification being discarded has been present for fewer minutes than the value of nlmConfigGlobalAgeOut, or if the named log has fewer entries than that specified in nlmConfigLogEntryLimit.",
      "ja": "ログに通知がある間にアプリケーションが制限を変更する場合、ログを新しい制限に下げるために最も古い通知を破棄する必要があります。したがって、通知がnlmConfigGl​​obalAgeOutおよびnlmConfigLogEntryLimitの値よりもnlmConfigGl​​obalAgeOutとnlmConfigLogEntryLimitの値よりも優先される必要があります。 nlmConfigGl​​obalAgeOutの値よりも短い時間、または名前付きログのエントリがnlmConfigLogEntryLimitで指定されたものより少ない場合、破棄されます。"
    },
    {
      "indent": 5,
      "text": "A value of 0 means no limit.",
      "ja": "値0は、制限がないことを意味します。"
    },
    {
      "indent": 4,
      "text": " Please be aware that contention between multiple managers\n trying to set this object to different values MAY affect the\n reliability and completeness of data seen by each manager.\"\nDEFVAL { 0 }\n::= { nlmConfig 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmConfigGlobalAgeOut OBJECT-TYPE SYNTAX Unsigned32 UNITS \"minutes\" MAX-ACCESS read-write STATUS current DESCRIPTION \"The number of minutes a Notification SHOULD be kept in a log before it is automatically removed.",
      "ja": "nlmConfigGl​​obalAgeOut OBJECT-TYPE SYNTAX Unsigned32 UNITS \"分\" MAX-ACCESS読み書きステータス現在の説明 \"通知が自動的に削除される前にログに保持される分数。"
    },
    {
      "indent": 5,
      "text": "If an application changes the value of nlmConfigGlobalAgeOut, Notifications older than the new time MAY be discarded to meet the new time.",
      "ja": "アプリケーションがnlmConfigGl​​obalAgeOutの値を変更する場合、新しい時間より古い通知は新しい時間を満たすために破棄される場合があります。"
    },
    {
      "indent": 5,
      "text": "A value of 0 means no age out.",
      "ja": "値0は、期限切れがないことを意味します。"
    },
    {
      "indent": 4,
      "text": " Please be aware that contention between multiple managers\n trying to set this object to different values MAY affect the\n reliability and completeness of data seen by each manager.\"\nDEFVAL { 1440 }  -- 24 hours\n::= { nlmConfig 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Basic Log Configuration Table --",
      "ja": "--基本的なログ設定テーブル-"
    },
    {
      "indent": 0,
      "text": "nlmConfigLogTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF NlmConfigLogEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n     \"A table of logging control entries.\"\n    ::= { nlmConfig 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmConfigLogEntry OBJECT-TYPE\n    SYNTAX      NlmConfigLogEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n     \"A logging control entry.  Depending on the entry's storage type\n     entries may be supplied by the system or created and deleted by\n     applications using nlmConfigLogEntryStatus.\"\n    INDEX      { nlmLogName }\n    ::= { nlmConfigLogTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NlmConfigLogEntry ::= SEQUENCE {\n    nlmLogName           SnmpAdminString,\n    nlmConfigLogFilterName    SnmpAdminString,\n    nlmConfigLogEntryLimit    Unsigned32,\n    nlmConfigLogAdminStatus   INTEGER,\n    nlmConfigLogOperStatus    INTEGER,\n    nlmConfigLogStorageType   StorageType,\n    nlmConfigLogEntryStatus   RowStatus\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogName OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"The name of the log.",
      "ja": "nlmLogName OBJECT-TYPE構文SnmpAdminString（SIZE（0..32））MAX-ACCESS not-accessibleステータス現在の説明「ログの名前。"
    },
    {
      "indent": 4,
      "text": " An implementation may allow multiple named logs, up to some\n implementation-specific limit (which may be none).  A\n zero-length log name is reserved for creation and deletion by\n the managed system, and MUST be used as the default log name by\n systems that do not support named logs.\"\n::= { nlmConfigLogEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmConfigLogFilterName OBJECT-TYPE SYNTAX SnmpAdminString (SIZE(0..32)) MAX-ACCESS read-create STATUS current DESCRIPTION \"A value of snmpNotifyFilterProfileName as used as an index into the snmpNotifyFilterTable in the SNMP Notification MIB, specifying the locally or remotely originated Notifications to be filtered out and not logged in this log.",
      "ja": "nlmConfigLogFilterName OBJECT-TYPE SYNTAX SnmpAdminString（SIZE（0..32））MAX-ACCESS read-create STATUS current DESCRIPTION \"snmpNotifyFilterProfileNameの値は、SNMP通知MIBのsnmpNotifyFilterTableへのインデックスとして使用され、ローカルまたはリモートで発生した通知を指定します除外され、このログに記録されません。"
    },
    {
      "indent": 4,
      "text": " A zero-length value or a name that does not identify an\n existing entry in snmpNotifyFilterTable indicate no\n Notifications are to be logged in this log.\"\nDEFVAL { ''H }\n::= { nlmConfigLogEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmConfigLogEntryLimit OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-create STATUS current DESCRIPTION \"The maximum number of notification entries that can be held in nlmLogTable for this named log. A particular setting does not guarantee that that much data can be held.",
      "ja": "nlmConfigLogEntryLimit OBJECT-TYPE SYNTAX Unsigned32 MAX-ACCESS read-create STATUS current DESCRIPTION \"この名前付きログのnlmLogTableに保持できる通知エントリの最大数。特定の設定では、多くのデータを保持できるとは限りません。"
    },
    {
      "indent": 5,
      "text": "If an application changes the limit while there are Notifications in the log, the oldest Notifications are discarded to bring the log down to the new limit.",
      "ja": "ログに通知がある間にアプリケーションが制限を変更すると、最も古い通知が破棄され、ログが新しい制限に下がります。"
    },
    {
      "indent": 5,
      "text": "A value of 0 indicates no limit.",
      "ja": "値0は、制限がないことを示します。"
    },
    {
      "indent": 4,
      "text": " Please be aware that contention between multiple managers\n trying to set this object to different values MAY affect the\n reliability and completeness of data seen by each manager.\"\nDEFVAL { 0 }\n::= { nlmConfigLogEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmConfigLogAdminStatus OBJECT-TYPE SYNTAX INTEGER { enabled(1), disabled(2) } MAX-ACCESS read-create STATUS current DESCRIPTION \"Control to enable or disable the log without otherwise disturbing the log's entry.",
      "ja": "nlmConfigLogAdminStatus OBJECT-TYPE SYNTAX INTEGER {enabled（1）、disabled（2）} MAX-ACCESS read-create STATUS現在の説明「ログのエントリに影響を与えずにログを有効または無効にする制御。"
    },
    {
      "indent": 4,
      "text": " Please be aware that contention between multiple managers\n trying to set this object to different values MAY affect the\n reliability and completeness of data seen by each manager.\"\nDEFVAL { enabled }\n::= { nlmConfigLogEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmConfigLogOperStatus OBJECT-TYPE SYNTAX INTEGER { disabled(1), operational(2), noFilter(3) } MAX-ACCESS read-only STATUS current DESCRIPTION \"The operational status of this log:",
      "ja": "nlmConfigLogOperStatus OBJECT-TYPE構文INTEGER {disabled（1）、operational（2）、noFilter（3）} MAX-ACCESS読み取り専用STATUS現在の説明「このログの動作ステータス："
    },
    {
      "indent": 10,
      "text": "disabled administratively disabled",
      "ja": "管理上無効"
    },
    {
      "indent": 10,
      "text": "operational administratively enabled and working",
      "ja": "運用上管理上有効で機能している"
    },
    {
      "indent": 4,
      "text": "      noFilter  administratively enabled but either\n                nlmConfigLogFilterName is zero length\n                or does not name an existing entry in\n                snmpNotifyFilterTable\"\n::= { nlmConfigLogEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmConfigLogStorageType OBJECT-TYPE\n    SYNTAX     StorageType\n    MAX-ACCESS read-create\n    STATUS     current\n    DESCRIPTION\n     \"The storage type of this conceptual row.\"\n    ::= { nlmConfigLogEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmConfigLogEntryStatus OBJECT-TYPE",
      "ja": "nlmConfigLogEntryStatus OBJECT-TYPE"
    },
    {
      "indent": 4,
      "text": "SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"Control for creating and deleting entries. Entries may be modified while active.",
      "ja": "構文RowStatus MAX-ACCESS read-create STATUS現在の説明「エントリの作成と削除の制御。エントリはアクティブなときに変更できます。"
    },
    {
      "indent": 4,
      "text": " For non-null-named logs, the managed system records the security\n credentials from the request that sets nlmConfigLogStatus\n to 'active' and uses that identity to apply access control to\n the objects in the Notification to decide if that Notification\n may be logged.\"\n::= { nlmConfigLogEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Statistics Section --",
      "ja": "--統計セクション-"
    },
    {
      "indent": 0,
      "text": "nlmStatsGlobalNotificationsLogged OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"notifications\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The number of Notifications put into the nlmLogTable.  This\n     counts a Notification once for each log entry, so a Notification\n      put into multiple logs is counted multiple times.\"\n    ::= { nlmStats 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmStatsGlobalNotificationsBumped OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"notifications\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The number of log entries discarded to make room for a new entry\n     due to lack of resources or the value of nlmConfigGlobalEntryLimit\n     or nlmConfigLogEntryLimit.  This does not include entries discarded\n     due to the value of nlmConfigGlobalAgeOut.\"\n    ::= { nlmStats 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Log Statistics Table --",
      "ja": "--ログ統計表-"
    },
    {
      "indent": 0,
      "text": "nlmStatsLogTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF NlmStatsLogEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n     \"A table of Notification log statistics entries.\"\n    ::= { nlmStats 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmStatsLogEntry OBJECT-TYPE\n    SYNTAX      NlmStatsLogEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n     \"A Notification log statistics entry.\"\n    AUGMENTS { nlmConfigLogEntry }\n    ::= { nlmStatsLogTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NlmStatsLogEntry ::= SEQUENCE {\n    nlmStatsLogNotificationsLogged Counter32,\n    nlmStatsLogNotificationsBumped Counter32\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmStatsLogNotificationsLogged OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"notifications\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The number of Notifications put in this named log.\"\n    ::= { nlmStatsLogEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmStatsLogNotificationsBumped OBJECT-TYPE\n    SYNTAX      Counter32\n    UNITS       \"notifications\"\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The number of log entries discarded from this named log to make\n     room for a new entry due to lack of resources or the value of\n     nlmConfigGlobalEntryLimit or nlmConfigLogEntryLimit.  This does not\n     include entries discarded due to the value of\n     nlmConfigGlobalAgeOut.\"\n    ::= { nlmStatsLogEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Log Section --",
      "ja": "--ログセクション-"
    },
    {
      "indent": 0,
      "text": "-- -- Log Table",
      "ja": "--ログテーブル"
    },
    {
      "indent": 0,
      "text": "--",
      "ja": "--"
    },
    {
      "indent": 0,
      "text": "nlmLogTable OBJECT-TYPE SYNTAX SEQUENCE OF NlmLogEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A table of Notification log entries.",
      "ja": "nlmLogTable OBJECT-TYPE SYNTAX SEQUENCE OF NlmLogEntry MAX-ACCESS not-accessibleステータス現在の説明「通知ログエントリの表。"
    },
    {
      "indent": 5,
      "text": "It is an implementation-specific matter whether entries in this table are preserved across initializations of the management system. In general one would expect that they are not.",
      "ja": "このテーブルのエントリが管理システムの初期化を通じて保持されるかどうかは、実装固有の問題です。一般に、そうではないと予想されます。"
    },
    {
      "indent": 4,
      "text": " Note that keeping entries across initializations of the\n management system leads to some confusion with counters and\n TimeStamps, since both of those are based on sysUpTime, which\n resets on management initialization.  In this situation,\n counters apply only after the reset and nlmLogTime for entries\n made before the reset MUST be set to 0.\"\n::= { nlmLog 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogEntry OBJECT-TYPE SYNTAX NlmLogEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A Notification log entry.",
      "ja": "nlmLogEntry OBJECT-TYPE構文NlmLogEntry MAX-ACCESS not-accessibleステータス現在の説明「通知ログエントリ。"
    },
    {
      "indent": 5,
      "text": "Entries appear in this table when Notifications occur and pass filtering by nlmConfigLogFilterName and access control. They are removed to make way for new entries due to lack of resources or the values of nlmConfigGlobalEntryLimit, nlmConfigGlobalAgeOut, or nlmConfigLogEntryLimit.",
      "ja": "通知が発生すると、このテーブルにエントリが表示され、nlmConfigLogFilterNameおよびアクセス制御によるフィルタリングを通過します。リソースが不足しているか、nlmConfigGl​​obalEntryLimit、nlmConfigGl​​obalAgeOut、またはnlmConfigLogEntryLimitの値が原因で、これらは新しいエントリを回避するために削除されます。"
    },
    {
      "indent": 5,
      "text": "If adding an entry would exceed nlmConfigGlobalEntryLimit or system resources in general, the oldest entry in any log SHOULD be removed to make room for the new one.",
      "ja": "エントリを追加すると、一般にnlmConfigGl​​obalEntryLimitまたはシステムリソースを超える場合は、ログの最も古いエントリを削除して、新しいエントリのためのスペースを空ける必要があります。"
    },
    {
      "indent": 5,
      "text": "If adding an entry would exceed nlmConfigLogEntryLimit the oldest entry in that log SHOULD be removed to make room for the new one.",
      "ja": "エントリを追加するとnlmConfigLogEntryLimitを超える場合は、そのログの最も古いエントリを削除して、新しいエントリのためのスペースを空ける必要があります。"
    },
    {
      "indent": 4,
      "text": " Before the managed system puts a locally-generated Notification\n into a non-null-named log it assures that the creator of the log\n has access to the information in the Notification.  If not it\n does not log that Notification in that log.\"\nINDEX       { nlmLogName, nlmLogIndex }\n::= { nlmLogTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NlmLogEntry ::= SEQUENCE {\n    nlmLogIndex                Unsigned32,\n    nlmLogTime                 TimeStamp,\n    nlmLogDateAndTime          DateAndTime,\n    nlmLogEngineID             SnmpEngineID,\n    nlmLogEngineTAddress       TAddress,\n    nlmLogEngineTDomain        TDomain,\n    nlmLogContextEngineID      SnmpEngineID,\n    nlmLogContextName          SnmpAdminString,\n    nlmLogNotificationID       OBJECT IDENTIFIER\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogIndex OBJECT-TYPE\n    SYNTAX     Unsigned32 (1..4294967295)\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n     \"A monotonically increasing integer for the sole purpose of\n     indexing entries within the named log.  When it reaches the\n     maximum value, an extremely unlikely event, the agent wraps the\n     value back to 1.\"\n    ::= { nlmLogEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogTime OBJECT-TYPE\n    SYNTAX      TimeStamp\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The value of sysUpTime when the entry was placed in the log. If\n     the entry occurred before the most recent management system\n     initialization this object value MUST be set to zero.\"\n    ::= { nlmLogEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogDateAndTime OBJECT-TYPE\n    SYNTAX      DateAndTime\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The local date and time when the entry was logged, instantiated\n     only by systems that have date and time capability.\"\n    ::= { nlmLogEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogEngineID OBJECT-TYPE SYNTAX SnmpEngineID MAX-ACCESS read-only STATUS current DESCRIPTION \"The identification of the SNMP engine at which the Notification originated.",
      "ja": "nlmLogEngineID OBJECT-TYPE構文SnmpEngineID MAX-ACCESS読み取り専用ステータス現在の説明「通知が発生したSNMPエンジンの識別。"
    },
    {
      "indent": 4,
      "text": " If the log can contain Notifications from only one engine\n or the Trap is in SNMPv1 format, this object is a zero-length\n string.\"\n::= { nlmLogEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogEngineTAddress OBJECT-TYPE SYNTAX TAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The transport service address of the SNMP engine from which the Notification was received, formatted according to the corresponding value of nlmLogEngineTDomain. This is used to identify the source of an SNMPv1 trap, since an nlmLogEngineId cannot be extracted from the SNMPv1 trap pdu.",
      "ja": "nlmLogEngineTAddress OBJECT-TYPE SYNTAX TAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"通知が受信されたSNMPエンジンのトランスポートサービスアドレス。nlmLogEngineTDomainの対応する値に従ってフォーマットされます。これは、SNMPv1のソースを識別するために使用されます。 nlmLogEngineIdはSNMPv1トラップpduから抽出できないため、トラップ。"
    },
    {
      "indent": 5,
      "text": "This object MUST always be instantiated, even if the log can contain Notifications from only one engine.",
      "ja": "ログに1つのエンジンからの通知のみを含めることができる場合でも、このオブジェクトは常にインスタンス化する必要があります。"
    },
    {
      "indent": 4,
      "text": " Please be aware that the nlmLogEngineTAddress may not uniquely\n identify the SNMP engine from which the Notification was received.\n For example, if an SNMP engine uses DHCP or NAT to obtain\n ip addresses, the address it uses may be shared with other\n network devices, and hence will not uniquely identify the\n SNMP engine.\"\n::= { nlmLogEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogEngineTDomain OBJECT-TYPE SYNTAX TDomain MAX-ACCESS read-only STATUS current DESCRIPTION \"Indicates the kind of transport service by which a Notification was received from an SNMP engine. nlmLogEngineTAddress contains the transport service address of the SNMP engine from which this Notification was received.",
      "ja": "nlmLogEngineTDomain OBJECT-TYPE SYNTAX TDomain MAX-ACCESS read-only STATUS current説明「SNMPエンジンから通知を受信したトランスポートサービスの種類を示します。nlmLogEngineTAddressには、この通知を受信したSNMPエンジンのトランスポートサービスアドレスが含まれています。"
    },
    {
      "indent": 4,
      "text": " Possible values for this object are presently found in the\n Transport Mappings for SNMPv2 document (RFC 1906 [8]).\"\n::= { nlmLogEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogContextEngineID OBJECT-TYPE SYNTAX SnmpEngineID MAX-ACCESS read-only STATUS current DESCRIPTION",
      "ja": "nlmLogContextEngineID OBJECT-TYPE構文SnmpEngineID MAX-ACCESS読み取り専用ステータス現在の説明"
    },
    {
      "indent": 5,
      "text": "\"If the Notification was received in a protocol which has a\n contextEngineID element like SNMPv3, this object has that value.\n Otherwise its value is a zero-length string.\"\n::= { nlmLogEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogContextName OBJECT-TYPE\n    SYNTAX      SnmpAdminString\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The name of the SNMP MIB context from which the Notification came.\n     For SNMPv1 Traps this is the community string from the Trap.\"\n    ::= { nlmLogEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogNotificationID OBJECT-TYPE\n    SYNTAX      OBJECT IDENTIFIER\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The NOTIFICATION-TYPE object identifier of the Notification that\n     occurred.\"\n    ::= { nlmLogEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Log Variable Table --",
      "ja": "--ログ変数テーブル-"
    },
    {
      "indent": 0,
      "text": "nlmLogVariableTable OBJECT-TYPE\n    SYNTAX      SEQUENCE OF NlmLogVariableEntry\n    MAX-ACCESS  not-accessible\n    STATUS      current\n    DESCRIPTION\n     \"A table of variables to go with Notification log entries.\"\n    ::= { nlmLog 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableEntry OBJECT-TYPE SYNTAX NlmLogVariableEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A Notification log entry variable.",
      "ja": "nlmLogVariableEntry OBJECT-TYPE構文NlmLogVariableEntry MAX-ACCESS not-accessibleステータス現在の説明「通知ログエントリ変数。"
    },
    {
      "indent": 4,
      "text": " Entries appear in this table when there are variables in\n the varbind list of a Notification in nlmLogTable.\"\nINDEX       { nlmLogName, nlmLogIndex, nlmLogVariableIndex }\n::= { nlmLogVariableTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "NlmLogVariableEntry ::= SEQUENCE {",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": " nlmLogVariableIndex Unsigned32, nlmLogVariableID OBJECT IDENTIFIER, nlmLogVariableValueType INTEGER, nlmLogVariableCounter32Val Counter32, nlmLogVariableUnsigned32Val Unsigned32, nlmLogVariableTimeTicksVal TimeTicks, nlmLogVariableInteger32Val Integer32, nlmLogVariableOctetStringVal OCTET STRING, nlmLogVariableIpAddressVal IpAddress, nlmLogVariableOidVal OBJECT IDENTIFIER, nlmLogVariableCounter64Val Counter64, nlmLogVariableOpaqueVal Opaque }",
      "ja": "nlmLogVariableIndex Unsigned32の、nlmLogVariableIDオブジェクト識別子、nlmLogVariableValueType INTEGER、nlmLogVariableCounter32Val Counter32の、nlmLogVariableUnsigned32Val Unsigned32の、nlmLogVariableTimeTicksVal時間刻み、nlmLogVariableInteger32Val Integer32の、nlmLogVariableOctetStringVal OCTET STRING、nlmLogVariableIpAddressVal IPアドレス、nlmLogVariableOidValオブジェクト識別子、nlmLogVariableCounter64Val Counter64の、nlmLogVariableOpaqueVal不透明}"
    },
    {
      "indent": 0,
      "text": "nlmLogVariableIndex OBJECT-TYPE\n    SYNTAX     Unsigned32 (1..4294967295)\n    MAX-ACCESS not-accessible\n    STATUS     current\n    DESCRIPTION\n     \"A monotonically increasing integer, starting at 1 for a given\n     nlmLogIndex, for indexing variables within the logged\n     Notification.\"\n    ::= { nlmLogVariableEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableID OBJECT-TYPE\n    SYNTAX     OBJECT IDENTIFIER\n    MAX-ACCESS read-only\n    STATUS     current\n    DESCRIPTION\n     \"The variable's object identifier.\"\n    ::= { nlmLogVariableEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableValueType OBJECT-TYPE\n    SYNTAX      INTEGER { counter32(1), unsigned32(2), timeTicks(3),\n                 integer32(4), ipAddress(5), octetString(6),\n                 objectId(7), counter64(8), opaque(9) }\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The type of the value.  One and only one of the value\n     objects that follow must be instantiated, based on this type.\"\n    ::= { nlmLogVariableEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableCounter32Val OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION",
      "ja": "nlmLogVariableCounter32Val OBJECT-TYPE構文Counter32 MAX-ACCESS読み取り専用ステータス現在の説明"
    },
    {
      "indent": 4,
      "text": " \"The value when nlmLogVariableType is 'counter32'.\"\n::= { nlmLogVariableEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableUnsigned32Val OBJECT-TYPE\n    SYNTAX      Unsigned32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The value when nlmLogVariableType is 'unsigned32'.\"\n    ::= { nlmLogVariableEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableTimeTicksVal OBJECT-TYPE\n    SYNTAX      TimeTicks\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The value when nlmLogVariableType is 'timeTicks'.\"\n    ::= { nlmLogVariableEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableInteger32Val OBJECT-TYPE\n    SYNTAX      Integer32\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The value when nlmLogVariableType is 'integer32'.\"\n    ::= { nlmLogVariableEntry 7 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableOctetStringVal OBJECT-TYPE\n    SYNTAX      OCTET STRING\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The value when nlmLogVariableType is 'octetString'.\"\n    ::= { nlmLogVariableEntry 8 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableIpAddressVal OBJECT-TYPE SYNTAX IpAddress MAX-ACCESS read-only STATUS current DESCRIPTION \"The value when nlmLogVariableType is 'ipAddress'. Although this seems to be unfriendly for IPv6, we have to recognize that there are a number of older MIBs that do contain an IPv4 format address, known as IpAddress.",
      "ja": "nlmLogVariableIpAddressVal OBJECT-TYPE構文IpAddress MAX-ACCESS読み取り専用ステータス現在の説明「nlmLogVariableTypeが 'ipAddress'の場合​​の値。これはIPv6には適さないように見えますが、 IpAddressと呼ばれるIPv4形式のアドレス。"
    },
    {
      "indent": 0,
      "text": "     IPv6 addresses are represented using TAddress or\n     InetAddress, and so the underlying datatype is\n     OCTET STRING, and their value would be stored in\n     the nlmLogVariableOctetStringVal column.\"\n    ::= { nlmLogVariableEntry 9 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableOidVal OBJECT-TYPE\n    SYNTAX      OBJECT IDENTIFIER\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The value when nlmLogVariableType is 'objectId'.\"\n    ::= { nlmLogVariableEntry 10 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableCounter64Val OBJECT-TYPE\n    SYNTAX      Counter64\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The value when nlmLogVariableType is 'counter64'.\"\n    ::= { nlmLogVariableEntry 11 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "nlmLogVariableOpaqueVal OBJECT-TYPE\n    SYNTAX      Opaque\n    MAX-ACCESS  read-only\n    STATUS      current\n    DESCRIPTION\n     \"The value when nlmLogVariableType is 'opaque'.\"\n    ::= { nlmLogVariableEntry 12 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- -- Conformance --",
      "ja": "--適合-"
    },
    {
      "indent": 0,
      "text": "notificationLogMIBConformance OBJECT IDENTIFIER ::=\n    { notificationLogMIB 3 }\nnotificationLogMIBCompliances OBJECT IDENTIFIER ::=\n    { notificationLogMIBConformance 1 }\nnotificationLogMIBGroups      OBJECT IDENTIFIER ::=\n    { notificationLogMIBConformance 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Compliance",
      "ja": "-コンプライアンス"
    },
    {
      "indent": 0,
      "text": "notificationLogMIBCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for entities which implement the Notification Log MIB.\" MODULE -- this module",
      "ja": "notificationLogMIBCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION「通知ログMIBを実装するエンティティのコンプライアンスステートメント」 MODULE-このモジュール"
    },
    {
      "indent": 10,
      "text": "MANDATORY-GROUPS {\n     notificationLogConfigGroup,\n     notificationLogStatsGroup,\n     notificationLogLogGroup\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "OBJECT nlmConfigGlobalEntryLimit SYNTAX Unsigned32 (0..4294967295) MIN-ACCESS read-only DESCRIPTION \"Implementations may choose a limit and not allow it to be changed or may enforce an upper or lower bound on the limit.\"",
      "ja": "オブジェクトnlmConfigGl​​obalEntryLimit構文Unsigned32（0..4294967295）MIN-ACCESS読み取り専用説明「実装は制限を選択し、変更を許可しないか、制限の上限または下限を強制する場合があります。」"
    },
    {
      "indent": 5,
      "text": "OBJECT nlmConfigLogEntryLimit SYNTAX Unsigned32 (0..4294967295) MIN-ACCESS read-only DESCRIPTION \"Implementations may choose a limit and not allow it to be changed or may enforce an upper or lower bound on the limit.\"",
      "ja": "OBJECT nlmConfigLogEntryLimit構文Unsigned32（0..4294967295）MIN-ACCESS読み取り専用説明「実装は制限を選択し、変更を許可しないか、制限の上限または下限を強制する場合があります。」"
    },
    {
      "indent": 5,
      "text": "OBJECT nlmConfigLogEntryStatus MIN-ACCESS read-only DESCRIPTION \"Implementations may disallow the creation of named logs.\"",
      "ja": "OBJECT nlmConfigLogEntryStatus MIN-ACCESS読み取り専用説明「実装は名前付きログの作成を許可しない場合があります。」"
    },
    {
      "indent": 5,
      "text": "GROUP notificationLogDateGroup DESCRIPTION \"This group is mandatory on systems that keep wall clock date and time and should not be implemented on systems that do not have a wall clock date.\"",
      "ja": "グループnotificationLogDateGroup説明「このグループは、壁時計の日付と時刻を保持するシステムでは必須であり、壁時計の日付がないシステムでは実装しないでください。」"
    },
    {
      "indent": 5,
      "text": "::= { notificationLogMIBCompliances 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "-- Units of Conformance",
      "ja": "-適合単位"
    },
    {
      "indent": 0,
      "text": "notificationLogConfigGroup OBJECT-GROUP\n     OBJECTS {\n          nlmConfigGlobalEntryLimit,\n          nlmConfigGlobalAgeOut,\n          nlmConfigLogFilterName,\n          nlmConfigLogEntryLimit,\n          nlmConfigLogAdminStatus,\n          nlmConfigLogOperStatus,\n          nlmConfigLogStorageType,\n          nlmConfigLogEntryStatus\n     }\n     STATUS current\n     DESCRIPTION\n          \"Notification log configuration management.\"\n     ::= { notificationLogMIBGroups 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "notificationLogStatsGroup OBJECT-GROUP\n     OBJECTS {\n          nlmStatsGlobalNotificationsLogged,\n          nlmStatsGlobalNotificationsBumped,\n          nlmStatsLogNotificationsLogged,\n          nlmStatsLogNotificationsBumped\n     }\n     STATUS current\n     DESCRIPTION\n          \"Notification log statistics.\"\n     ::= { notificationLogMIBGroups 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "notificationLogLogGroup OBJECT-GROUP\n     OBJECTS {\n          nlmLogTime,\n          nlmLogEngineID,\n          nlmLogEngineTAddress,\n          nlmLogEngineTDomain,\n          nlmLogContextEngineID,\n          nlmLogContextName,\n          nlmLogNotificationID,\n          nlmLogVariableID,\n          nlmLogVariableValueType,\n          nlmLogVariableCounter32Val,\n          nlmLogVariableUnsigned32Val,\n          nlmLogVariableTimeTicksVal,\n          nlmLogVariableInteger32Val,\n          nlmLogVariableOctetStringVal,\n          nlmLogVariableIpAddressVal,\n          nlmLogVariableOidVal,\n          nlmLogVariableCounter64Val,\n          nlmLogVariableOpaqueVal\n     }\n     STATUS current\n     DESCRIPTION\n          \"Notification log data.\"\n     ::= { notificationLogMIBGroups 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "notificationLogDateGroup OBJECT-GROUP\n     OBJECTS {\n          nlmLogDateAndTime\n     }\n     STATUS current\n     DESCRIPTION\n          \"Conditionally mandatory notification log data.\n          This group is mandatory on systems that keep wall\n          clock date and time and should not be implemented\n          on systems that do not have a wall clock date.\"\n     ::= { notificationLogMIBGroups 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 0,
      "text": "4. Intellectual Property",
      "section_title": true,
      "ja": "4. 知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、このドキュメントに記載されているテクノロジーの実装または使用に関連すると主張される可能性がある知的財産またはその他の権利の有効性または範囲、またはそのような権利に基づくライセンスが適用されるまたは適用されない範囲に関して、いかなる立場も取らない。利用可能。また、そのような権利を特定するために何らかの努力をしたことも表していません。標準化過程および標準化関連文書の権利に関するIETFの手順に関する情報は、BCP-11にあります。公開のために利用可能にされた権利の主張および利用可能にされるライセンスの保証のコピー、またはこの仕様の実装者またはユーザーによる一般的なライセンスまたはそのような所有権の使用の許可を得ようとした試みの結果を入手できます。 IETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、この規格を実践するために必要となる可能性のある技術をカバーする可能性のある著作権、特許、特許出願、またはその他の所有権に注意を向けるよう、関係者に呼びかけます。 IETF Executive Directorに情報を送信してください。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2571] Harrington, D., Presuhn, R. and B. Wijnen, \"An Architecture for Describing SNMP Management Frameworks\", RFC 2571, April 1999.",
      "ja": "[RFC2571] Harrington、D.、Presuhn、R。およびB. Wijnen、「SNMP管理フレームワークを記述するためのアーキテクチャ」、RFC 2571、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC1155] Rose, M. and K. McCloghrie, \"Structure and Identification of Management Information for TCP/IP-based Internets\", STD 16, RFC 1155, May 1990.",
      "ja": "[RFC1155] Rose、M。、およびK. McCloghrie、「構造およびTCP / IPベースのインターネットの管理情報の識別」、STD 16、RFC 1155、1990年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC1212] Rose, M. and K. McCloghrie, \"Concise MIB Definitions\", STD 16, RFC 1212, March 1991.",
      "ja": "[RFC1212] Rose、M。、およびK. McCloghrie、「簡潔なMIB定義」、STD 16、RFC 1212、1991年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC1215] Rose, M., \"A Convention for Defining Traps for use with the SNMP\", RFC 1215, March 1991.",
      "ja": "[RFC1215] Rose、M。、「SNMPで使用するトラップを定義するための規約」、RFC 1215、1991年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[RFC2578] McCloghrie、K.、Perkins、D.、Schoenwaelder、J.、Case、J.、Rose、M. and S. Waldbusser、 \"Structure of Management Information Version 2（SMIv2）\"、STD 58、RFC 2578、 1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[RFC2579] McCloghrie、K.、Perkins、D.、Schoenwaelder、J.、Case、J.、Rose、M. and S. Waldbusser、 \"Textual Conventions for SMIv2\"、STD 58、RFC 2579、April 1999。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., Schoenwaelder, J., Case, J., Rose, M. and S. Waldbusser, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "ja": "[RFC2580] McCloghrie、K.、Perkins、D.、Schoenwaelder、J.、Case、J.、Rose、M. and S. Waldbusser、 \"Conformance Statements for SMIv2\"、STD 58、RFC 2580、April 1999。"
    },
    {
      "indent": 3,
      "text": "[RFC1157] Case, J., Fedor, M., Schoffstall, M. and J. Davin, \"Simple Network Management Protocol\", STD 15, RFC 1157, May 1990.",
      "ja": "[RFC1157] Case、J.、Fedor、M.、Schoffstall、M。およびJ. Davin、「Simple Network Management Protocol」、STD 15、RFC 1157、1990年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC1901] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Introduction to Community-based SNMPv2\", RFC 1901, January 1996.",
      "ja": "[RFC1901] Case、J.、McCloghrie、K.、Rose、M。、およびS. Waldbusser、「Introduction to Community-based SNMPv2」、RFC 1901、1996年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC1906] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Transport Mappings for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1906, January 1996.",
      "ja": "[RFC1906] Case、J.、McCloghrie、K.、Rose、M。、およびS. Waldbusser、「Transport Mappings for Version 2 for the Simple Network Management Protocol（SNMPv2）」、RFC 1906、1996年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2572] Case, J., Harrington D., Presuhn R. and B. Wijnen, \"Message Processing and Dispatching for the Simple Network Management Protocol (SNMP)\", RFC 2572, April 1999.",
      "ja": "[RFC2572] Case、J.、Harrington D.、Presuhn R.、およびB. Wijnen、「メッセージ処理および簡易ネットワーク管理プロトコル（SNMP）のディスパッチ」、RFC 2572、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2574] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", RFC 2574, April 1999.",
      "ja": "[RFC2574] Blumenthal、U。およびB. Wijnen、「バージョン3の簡易ネットワーク管理プロトコル（SNMPv3）用のユーザーベースのセキュリティモデル（USM）」、RFC 2574、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC1905] Case, J., McCloghrie, K., Rose, M. and S. Waldbusser, \"Protocol Operations for Version 2 of the Simple Network Management Protocol (SNMPv2)\", RFC 1905, January 1996.",
      "ja": "[RFC1905] Case、J.、McCloghrie、K.、Rose、M。、およびS. Waldbusser、「バージョン2の簡易ネットワーク管理プロトコル（SNMPv2）のプロトコル操作」、RFC 1905、1996年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2573] Levi, D., Meyer, P. and B. Stewart, \"SNMPv3 Applications\", RFC 2573, April 1999.",
      "ja": "[RFC2573] Levi、D.、Meyer、P。およびB. Stewart、「SNMPv3アプリケーション」、RFC 2573、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2575] Wijnen, B., Presuhn, R. and K. McCloghrie, \"View-based Access Control Model (VACM) for the Simple Network Management Protocol (SNMP)\", RFC 2575, April 1999.",
      "ja": "[RFC2575] Wijnen、B.、Presuhn、R。、およびK. McCloghrie、「簡易ネットワーク管理プロトコル（SNMP）のビューベースのアクセス制御モデル（VACM）」、RFC 2575、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2570] Case, J., Mundy, R., Partain, D. and B. Stewart, \"Introduction to Version 3 of the Internet-standard Network Management Framework\", RFC 2570, April 1999.",
      "ja": "[RFC2570] Case、J.、Mundy、R.、Partain、D。およびB. Stewart、「Introduction to Version 3 of the Internet-standard Network Management Framework」、RFC 2570、1999年4月。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Security issues are discussed in Section 3.1.2.",
      "ja": "セキュリティの問題については、セクション3.1.2で説明します。"
    },
    {
      "indent": 0,
      "text": "7. Authors' Addresses",
      "section_title": true,
      "ja": "7. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Bob Stewart Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134-1706 U.S.A.",
      "ja": "Bob Stewart Cisco Systems、Inc. 170 West Tasman Drive San Jose、CA 95134-1706 U.S.A."
    },
    {
      "indent": 3,
      "text": "Ramanathan Kavasseri Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134-1706 U.S.A.",
      "ja": "Ramanathan Kavasseri Cisco Systems、Inc. 170 West Tasman Drive San Jose、CA 95134-1706 U.S.A."
    },
    {
      "indent": 3,
      "text": "Phone: +1 408 527 2446\nEMail: ramk@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8. 完全な著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "Copyright（C）The Internet Society（2000）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントとその翻訳はコピーして他のユーザーに提供することができ、コメントまたはその他の方法で説明したり、その実装を支援する二次的著作物は、いかなる種類の制限なしに、全体または一部を準備、コピー、公開、および配布することができますただし、上記の著作権表示とこの段落は、そのようなすべてのコピーと派生物に含まれています。ただし、このドキュメント自体は、著作権に関する通知を削除したり、インターネットソサエティや他のインターネット組織への参照を削除したりするなど、いかなる方法でも変更できません。ただし、インターネット標準を開発する目的で必要な場合は除きます。インターネット標準のプロセスに従うか、または必要に応じて、それを英語以外の言語に翻訳する必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記で付与された制限付きのアクセス許可は永続的であり、インターネットソサエティまたはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は「現状有姿」で提供され、インターネット社会およびインターネット技術タスクフォースは、明示または黙示を問わず、ここに記載されている情報の使用が保証するものに限定されないいかなる保証も含め、一切の保証を否認します。商品性または特定の目的への適合性に関する権利または黙示の保証を侵害すること。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能への資金提供は、現在Internet Societyから提供されています。"
    }
  ]
}