{
  "title": {
    "text": "RFC 3464 - An Extensible Message Format for Delivery Status Notifications",
    "ja": "RFC 3464 - 配信状態通知のための広げることができるメッセージフォーマット"
  },
  "number": 3464,
  "created_at": "2019-10-28 20:22:22.271756+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           K. Moore\nRequest for Comments: 3464                       University of Tennessee\nObsoletes: 1894                                             G. Vaudreuil\nCategory: Standards Track                            Lucent Technologies\n                                                            January 2003",
      "raw": true
    },
    {
      "indent": 4,
      "text": "An Extensible Message Format for Delivery Status Notifications",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines a Multipurpose Internet Mail Extensions (MIME) content-type that may be used by a message transfer agent (MTA) or electronic mail gateway to report the result of an attempt to deliver a message to one or more recipients. This content-type is intended as a machine-processable replacement for the various types of delivery status notifications currently used in Internet electronic mail.",
      "ja": "このメモは、1人以上の受信者にメッセージを配信しようとする試みの結果を報告するためにメッセージ転送エージェント（MTA）または電子メールゲートウェイによって使用することができる多目的インターネットメール拡張（MIME）コンテンツタイプを定義します。このコンテンツタイプは、現在、インターネット、電子メールで使用される配信状態通知の様々なタイプの機械処理の代替として意図されます。"
    },
    {
      "indent": 3,
      "text": "Because many messages are sent between the Internet and other messaging systems (such as X.400 or the so-called \"Local Area Network (LAN)-based\" systems), the Delivery Status Notification (DSN) protocol is designed to be useful in a multi-protocol messaging environment. To this end, the protocol described in this memo provides for the carriage of \"foreign\" addresses and error codes, in addition to those normally used in Internet mail. Additional attributes may also be defined to support \"tunneling\" of foreign notifications through Internet mail.",
      "ja": "多くのメッセージが（X.400など、いわゆるシステムの「ローカルエリアネットワーク（LAN）ベース」）は、インターネットや他のメッセージングシステムとの間で送信され、配信状態通知（DSN）のプロトコルをするのに有用であることが設計されていますので、マルチプロトコルのメッセージング環境。この目的のために、このメモで説明されたプロトコルは、通常、インターネットメールで使用されるものに加えて、「外来」アドレスとエラーコードのキャリッジを提供します。追加の属性は、インターネットメールを通じて外国の通知の「トンネリング」をサポートするために定義することができます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n  1.1 Purposes .....................................................3\n  1.2 Requirements .................................................4\n  1.3 Terminology ..................................................5\n2. Format of a Delivery Status Notification ........................7\n  2.1 The message/delivery-status content-type .....................9\n   2.1.1 General conventions for DSN fields ........................9\n   2.1.2 \"*-type\" sub-fields .......................................9\n   2.1.3 Lexical tokens imported from RFC 822 .....................10\n  2.2 Per-Message DSN Fields ......................................11\n   2.2.1 The Original-Envelope-Id field ...........................11\n   2.2.2 The Reporting-MTA DSN field ..............................12\n   2.2.3 The DSN-Gateway field ....................................13\n   2.2.4 The Received-From-MTA DSN field ..........................14\n   2.2.5 The Arrival-Date DSN field ...............................14\n  2.3 Per-Recipient DSN fields ....................................14\n   2.3.1 Original-Recipient field .................................15\n   2.3.2 Final-Recipient field ....................................15\n   2.3.3 Action field .............................................16\n   2.3.4 Status field .............................................18\n   2.3.5 Remote-MTA field .........................................19\n   2.3.6 Diagnostic-Code field ....................................19\n   2.3.7 Last-Attempt-Date field ..................................20\n   2.3.8 final-log-id field .......................................20\n   2.3.9 Will-Retry-Until field ...................................20\n  2.4 Extension fields ............................................21\n3. Conformance and Usage Requirements .............................22\n4. Security Considerations ........................................23\n  4.1 Forgery .....................................................23\n  4.2 Confidentiality .............................................23\n  4.3 Non-Repudiation .............................................25\n5. References .....................................................25\n6. Acknowledgments ................................................26\nAppendix A - Collected Grammar ....................................27\nAppendix B - Guidelines for Gatewaying DSNS .......................29\n  Gatewaying from other mail systems to DSNs ......................29\n  Gatewaying from DSNs to other mail systems ......................30\nAppendix C - Guidelines for Use of DSNS By Mailing List Exploders .30\nAppendix D - IANA Registration Forms for DSN Types ................31\n  IANA registration form for address-type .........................32\n  IANA registration form for diagnostic-type ......................32\n  IANA registration form for MTA-name-type ........................32\nAppendix E - Examples .............................................33\n  Simple DSN ......................................................34\n  Multi-Recipient DSN .............................................35\n  DSN from gateway to foreign system ..............................36",
      "raw": true
    },
    {
      "indent": 3,
      "text": "  Delayed DSN .....................................................37\nAppendix F - Changes from RFC 1894 ................................38\nAuthors' Addresses ................................................39\nFull Copyright Statement ..........................................40",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This memo defines a Multipurpose Internet Mail Extensions (MIME) [MIME1] content-type for Delivery Status Notifications (DSNs). A DSN can be used to notify the sender of a message of any of several conditions: failed delivery, delayed delivery, successful delivery, or the gatewaying of a message into an environment that may not support DSNs. The \"message/delivery-status\" content-type defined herein is intended for use within the framework of the \"multipart/report\" content type defined in [REPORT].",
      "ja": "このメモは、配信状態通知（DSN）のための多目的インターネットメール拡張（MIME）[MIME1]コンテンツタイプを定義します。 DSNは、いくつかの条件のいずれかのメッセージの送信者に通知するために使用することができる：失敗した送達、遅延送達、成功した配達、またはDSNをサポートしていない場合があり環境へのメッセージのゲートウェイ。本明細書で定義される「メッセージ/配送状況」コンテンツ・タイプ[REPORT]で定義された「マルチパート/レポート」コンテンツタイプのフレームワーク内で使用するために意図されています。"
    },
    {
      "indent": 3,
      "text": "This memo defines only the format of the notifications. An extension to the Simple Message Transfer Protocol (SMTP) [SMTP] to fully support such notifications is the subject of a separate memo [DRPT].",
      "ja": "このメモは、通知の唯一の形式を定義します。完全にそのような通知をサポートするための単純なメッセージ転送プロトコル（SMTP）への拡張[SMTP]は[DRPT]別のメモの主題です。"
    },
    {
      "indent": 3,
      "text": "Document Conventions",
      "ja": "ドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14、RFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.1 Purposes",
      "section_title": true,
      "ja": "1.1目的"
    },
    {
      "indent": 3,
      "text": "The DSNs defined in this memo are expected to serve several purposes:",
      "ja": "このメモで定義されたDSNは、いくつかの目的を果たすことが期待されています。"
    },
    {
      "indent": 3,
      "text": "(a) Inform human beings of the status of message delivery processing, as well as the reasons for any delivery problems or outright failures, in a manner that is largely independent of human language and media;",
      "ja": "（a）は、人間の言語とメディアの大部分は無関係であるように、人間のメッセージ配信処理の状態の人間、ならびに任意の送達の問題や明白な失敗の理由を知らせます。"
    },
    {
      "indent": 3,
      "text": "(b) Allow mail user agents to keep track of the delivery status of messages sent, by associating returned DSNs with earlier message transmissions;",
      "ja": "（b）は、メールユーザーエージェントは、以前のメッセージの送信と返されるDSNを関連付けることによって、送信されたメッセージの配信状態を追跡できるようにします。"
    },
    {
      "indent": 3,
      "text": "(c) Allow mailing list exploders to automatically maintain their subscriber lists when delivery attempts repeatedly fail;",
      "ja": "（c）は配送試行が繰り返し失敗したときにメーリングリスト発破が自動的に加入者のリストを維持することを許可します。"
    },
    {
      "indent": 3,
      "text": "(d) Convey delivery and non-delivery notifications resulting from attempts to deliver messages to \"foreign\" mail systems via a gateway;",
      "ja": "（d）の送達およびゲートウェイを介して「外来」メールシステムにメッセージを配信する試みに起因する不達通知を伝えます。"
    },
    {
      "indent": 3,
      "text": "(e) Allow \"foreign\" notifications to be tunneled through a MIME-capable message system and back into the original messaging system that issued the original notification, or even to a third messaging system;",
      "ja": "（E）「外来」通知がMIME対応メッセージシステムを通って元の通知を発行した元のメッセージングシステムに、あるいは第三のメッセージングシステムにトンネリングすることを許可します。"
    },
    {
      "indent": 3,
      "text": "(f) Allow language-independent and medium-independent, yet reasonably precise, indications of the reason for the failure of a message to be delivered; and",
      "ja": "（f）は、言語に依存せず、媒体に依存しない、まだ配信されるメッセージの失敗の理由の合理正確な表示を許可します。そして"
    },
    {
      "indent": 3,
      "text": "(g) Provide sufficient information to remote MTA maintainers (via \"trouble tickets\") so that they can understand the nature of reported errors. This feature is used in the case that failure to deliver a message is due to the malfunction of a remote MTA and the sender wants to report the problem to the remote MTA administrator.",
      "ja": "彼らは報告されたエラーの性質を理解することができるように（G）（「トラブルチケット」経由）リモートMTAメンテナに十分な情報を提供します。この機能は、メッセージを配信するために失敗は、リモートMTAの誤作動によるものであり、送信者がリモートMTAの管理者に問題を報告したい場合に使用されています。"
    },
    {
      "indent": 0,
      "text": "1.2 Requirements",
      "section_title": true,
      "ja": "1.2要件"
    },
    {
      "indent": 3,
      "text": "These purposes place the following constraints on the notification protocol:",
      "ja": "これらの目的は、通知プロトコル上で次の制約を課します："
    },
    {
      "indent": 3,
      "text": "(a) It must be readable by humans as well as being machine-parsable.",
      "ja": "（a）はそれだけでなく、マシン解析可能なものとして人間が読み取り可能でなければなりません。"
    },
    {
      "indent": 3,
      "text": "(b) It must provide enough information to allow message senders (or the user agents) to unambiguously associate a DSN with the message that was sent and the original recipient address for which the DSN is issued (if such information is available), even if the message was forwarded to another recipient address.",
      "ja": "（B）はあっても、（そのような情報が利用可能である場合）、メッセージ送信者（又はユーザエージェント）が明確に送信されたメッセージとDSNが発行された元の受信者アドレスを持つDSNを関連付けることができるように十分な情報を提供しなければなりませんメッセージを別の受信者のアドレスに転送されました。"
    },
    {
      "indent": 3,
      "text": "(c) It must be able to preserve the reason for the success or failure of a delivery attempt in a remote messaging system, using the \"language\" (mailbox addresses and status codes) of that remote system.",
      "ja": "（C）そのリモートシステムの「言語」（メールボックスアドレスとステータスコード）を使用して、リモート・メッセージング・システムにおける配送の試みの成功または失敗の理由を維持できなければなりません。"
    },
    {
      "indent": 3,
      "text": "(d) It must also be able to describe the reason for the success or failure of a delivery attempt, independent of any particular human language or of the \"language\" of any particular mail system.",
      "ja": "（D）また、任意の特定の人間の言語の、または任意の特定のメールシステムの「言語」の独立した配信試行の成功または失敗の理由を説明できなければなりません。"
    },
    {
      "indent": 3,
      "text": "(e) It must preserve enough information to allow the maintainer of a remote MTA to understand (and if possible, reproduce) the conditions that caused a delivery failure at that MTA.",
      "ja": "（e）には、リモートMTAのメンテナが、そのMTAに配信失敗の原因となった状態把握（および可能であれば、再現）することを可能にするための十分な情報を保持する必要があります。"
    },
    {
      "indent": 3,
      "text": "(f) For any notifications issued by foreign mail systems, which are translated by a mail gateway to the DSN format, the DSN must preserve the \"type\" of the foreign addresses and error codes, so that these may be correctly interpreted by gateways.",
      "ja": "これらが正しくゲートウェイによって解釈することができるように、（F）DSN形式にメールゲートウェイによって変換された外部メールシステムによって発行された通知の場合、DSNは、外国のアドレスおよびエラー・コードの「タイプ」を保持しなければなりません。"
    },
    {
      "indent": 3,
      "text": "A DSN contains a set of per-message fields that identify the message and the transaction during which the message was submitted, along with other fields that apply to all delivery attempts described by the DSN. The DSN also includes a set of per-recipient fields to convey the result of the attempt to deliver the message to each of one or more recipients.",
      "ja": "DSNは、メッセージと、メッセージがDSNによって記載された全ての配達の試みに適用され、他のフィールドと共に、提出された時にトランザクションを識別し、メッセージごとのフィールドのセットを含みます。 DSNは、1人のまたは複数の受信者のそれぞれにメッセージを配信しようとする試みの結果を伝える受信者ごとのフィールドのセットを含みます。"
    },
    {
      "indent": 0,
      "text": "1.3 Terminology",
      "section_title": true,
      "ja": "1.3用語"
    },
    {
      "indent": 3,
      "text": "A message may be transmitted through several message transfer agents (MTAs) on its way to a recipient. For a variety of reasons, recipient addresses may be rewritten during this process, so each MTA may potentially see a different recipient address. Depending on the purpose for which a DSN is used, different formats of a particular recipient address will be needed.",
      "ja": "メッセージは、受信者への途中でいくつかのメッセージ転送エージェント（MTA）を介して送信されても​​よいです。様々な理由のために、受信者のアドレスは、このプロセスの間に書き換えることができるので、各MTAは、潜在的に異なる受信者のアドレスを参照することができます。 DSNが使用される目的に応じて、特定の受信者のアドレスの異なるフォーマットが必要になります。"
    },
    {
      "indent": 3,
      "text": "Several DSN fields are defined in terms of the view from a particular MTA in the transmission. The MTAs are assigned the following names:",
      "ja": "いくつかのDSNフィールドは、送信中の特定のMTAからのビューで定義されています。 MTAは、次の名前を割り当てられています。"
    },
    {
      "indent": 3,
      "text": "(a) Original MTA",
      "ja": "（a）のオリジナルMTA"
    },
    {
      "indent": 7,
      "text": "The Original MTA is the one to which the message is submitted for\ndelivery by the sender of the message.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "(b) Reporting MTA",
      "ja": "（B）報告MTA"
    },
    {
      "indent": 7,
      "text": "For any DSN, the Reporting MTA is the one which is reporting the\nresults of delivery attempts described in the DSN.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "If the delivery attempts described occurred in a \"foreign\" (non-Internet) mail system, and the DSN was produced by translating the foreign notice into DSN format, the Reporting MTA will still identify the \"foreign\" MTA where the delivery attempts occurred.",
      "ja": "記載の送達試行が「外来」（非インターネット）メールシステムで発生し、そしてDSNがDSN形式に外来通知を翻訳することによって製造した場合、レポートMTAはまだ配信試行が発生した「外来」MTAを識別することになります。"
    },
    {
      "indent": 3,
      "text": "(c) Received-From MTA",
      "ja": "（c）の受信からMTA"
    },
    {
      "indent": 7,
      "text": "The Received-From MTA is the MTA from which the Reporting MTA\nreceived the message, and accepted responsibility for delivery of\nthe message.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "(d) Remote MTA",
      "ja": "（d）のリモートMTA"
    },
    {
      "indent": 7,
      "text": "If an MTA determines that it must relay a message to one or more\nrecipients, but the message cannot be transferred to its \"next\nhop\" MTA, or if the \"next hop\" MTA refuses to accept\nresponsibility for delivery of the message to one or more of its\nintended recipients, the relaying MTA may need to issue a DSN on\nbehalf of the recipients for whom the message cannot be delivered.  In this case the relaying MTA is the Reporting MTA,\nand the \"next hop\" MTA is known as the Remote MTA.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Figure 1 illustrates the relationship between the various MTAs.",
      "ja": "図1は、種々のMTAとの関係を示す図です。"
    },
    {
      "indent": 0,
      "text": "+-----+    +--------+           +---------+    +---------+      +------+\n|     |    |        |           |Received-|    |         |      |      |\n|     | => |Original| => ... => |  From   | => |Reporting| ===> |Remote|\n| user|    |   MTA  |           |   MTA   |    |   MTA   | <No! |  MTA |\n|agent|    +--------+           +---------+    +----v----+      +------+\n|     |                                             |\n|     | <-------------------------------------------+\n+-----+      (DSN returned to sender by Reporting MTA)",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Figure 1. Original, Received-From, Reporting and Remote MTAs",
      "ja": "図1.オリジナル、受信から、レポーティングおよびリモートのMTA"
    },
    {
      "indent": 3,
      "text": "Each of these MTAs may provide information that is useful in a DSN:",
      "ja": "これらのMTAのそれぞれは、DSNに役立つ情報を提供することができます。"
    },
    {
      "indent": 3,
      "text": "+ Ideally, the DSN will contain the address of each recipient as originally specified to the Original MTA by the sender of the message.",
      "ja": "もともと、メッセージの送信者によって元のMTAに指定されているよう+理想的には、DSNは、各受信者のアドレスが含まれています。"
    },
    {
      "indent": 5,
      "text": "This version of the address is needed (rather than a forwarding address or some modified version of the original address) so that the sender may compare the recipient address in the DSN with the address in the sender's records (e.g., an address book for an individual, the list of subscribers for a mailing list) and take appropriate action.",
      "ja": "送信者が送信者のレコードの中のアドレス（例えば、個々のアドレス帳とのDSNで受信者のアドレスを比較することができるように、アドレスのこのバージョンは、（むしろ転送アドレスまたは元のアドレスの一部変更されたバージョンよりも）必要とされています、メーリングリストのための加入者のリスト）とは、適切な行動をとります。"
    },
    {
      "indent": 5,
      "text": "Similarly, the DSN might contain an \"envelope identifier\" that was known to both the sender's user agent and the Original MTA at the time of message submission, and which, if included in the DSN, can be used by the sender to keep track of which messages were or were not delivered.",
      "ja": "同様に、DSNは、メッセージ送信時に送信者のユーザーエージェントと元のMTAの両方に知られていた「エンベロープ識別子を」含まれている可能性があり、そしてその、DSNに含まれている場合、を追跡するために送信者によって使用することができますそのメッセージがなかったか配信されませんでした。"
    },
    {
      "indent": 3,
      "text": "+ If a message was (a) forwarded to a different address than that specified by the sender, (b) gatewayed to a different mail system than that used by the sender, or (c) subjected to address rewriting during transmission, the \"final\" form of the recipient address (i.e., the one seen by the Reporting MTA) will be different than the original (sender-specified) recipient address. Just as the sender's user agent (or the sender) prefers the original recipient address, so the \"final\" address is needed when reporting a problem to the postmaster of the site where message delivery failed, because only the final recipient address will allow her to reproduce the conditions that caused the failure.",
      "ja": "メッセージは、（a）は、送信者によって指定されたものとは異なるアドレスに転送された+場合、（b）は、送信、「最終の間アドレス書き換えを施し、送信者、又は（c）で使用されるものとは異なるメールシステムにゲートウェイ処理しました「受信者アドレスの形式（すなわち、レポートMTAによって見られるもの）は、元（送信者が指定した）受信者アドレスとは異なるであろう。メッセージ配信が失敗したサイトのポストマスターに問題を報告するときにのみ、最終的な受信者のアドレスは、彼女ができるようになりますので、「最終」アドレスは、必要とされているように、送信者のユーザーエージェント（または送信者）は、元の受信者のアドレスを好むのと同じように失敗の原因となった状況を再現します。"
    },
    {
      "indent": 3,
      "text": "+ A \"failed\" DSN should contain the most accurate explanation for the delivery failure that is available. For ease of interpretation, this information should be a format that is independent of the mail transport system that issued the DSN. However, if a foreign error code is translated into some transport-independent format, some information may be lost. It is therefore desirable to provide both a transport-independent status code and a mechanism for reporting transport-specific codes. Depending on the circumstances that produced delivery failure, the transport-specific code might be obtained from either the Reporting MTA or the Remote MTA.",
      "ja": "+ Aは、DSNが利用可能な配信障害の最も正確な説明が含まれている必要があり、「失敗しました」。解釈を容易にするため、この情報はDSNを発行したメール輸送システムとは独立してフォーマットする必要があります。外国のエラーコードは、いくつかのトランスポートに依存しない形式に変換される場合は、一部の情報が失われてもよいです。トランスポート独立ステータスコードとトランスポート固有のコードを報告するための機構の両方を提供することが望ましいです。配信障害を生じた状況に応じて、トランスポート固有のコードは、Reporting MTAまたはリモートMTAのいずれかから得られるであろう。"
    },
    {
      "indent": 3,
      "text": "Since different values for \"recipient address\" and \"delivery status code\" are needed according to the circumstance in which a DSN will be used, and since the MTA that issues the DSN cannot anticipate those circumstances, the DSN format described here may contain both the original and final forms of a recipient address, and both a transport-independent and a transport-specific indication of delivery status.",
      "ja": "「受信者アドレス」と「配信ステータスコード」のための異なる値のでDSNが使用される状況に応じて必要とされ、およびDSNを発行するMTAがそれらの状況を予測することができないので、ここで説明したDSNフォーマットが両方含まれていてもよいです元の最終的な受信者アドレスの形式、およびトランスポートに依存し、配信状態のトランスポート固有の指標の両方。"
    },
    {
      "indent": 3,
      "text": "Extension fields may also be added by the Reporting MTA as needed to provide additional information for use in a trouble ticket or to preserve information for tunneling of foreign delivery reports through Internet DSNs.",
      "ja": "トラブルチケットに使用するための追加情報を提供するために、またはインターネットのDSNを通じて外国配信レポートのトンネリングのための情報を保存するために、必要に応じて拡張フィールドも報告MTAによって追加することができます。"
    },
    {
      "indent": 3,
      "text": "The Original, Reporting, and Remote MTAs may exist in very different environments and use dissimilar transport protocols, MTA names, address formats, and delivery status codes. DSNs therefore do not assume any particular format for mailbox addresses, MTA names, or transport-specific status codes. Instead, the various DSN fields that carry such quantities consist of a \"type\" sub-field followed by a sub-field whose contents are ordinary text characters, and the format of which is indicated by the \"type\" sub-field. This allows a DSN to convey these quantities regardless of format.",
      "ja": "オリジナル、レポート、およびリモートのMTAは非常に異なる環境に存在し、異なるトランスポートプロトコル、MTA名前、アドレス形式、および配信ステータスコードを使用することができます。 DSNはそのためのメールボックスアドレス、MTA名、またはトランスポート固有のステータスコードについての任意の特定の形式を負いません。代わりに、そのような量を運ぶ様々なDSNフィールドは、その内容が通常のテキスト文字であり、「タイプ」サブフィールドによって示されている形式のサブフィールドに続く「タイプ」サブフィールドから成ります。これは、DSNは、形式にかかわらず、これらの量を伝えることができます。"
    },
    {
      "indent": 0,
      "text": "2. Format of a Delivery Status Notification",
      "section_title": true,
      "ja": "配信ステータス通知の2フォーマット"
    },
    {
      "indent": 3,
      "text": "A DSN is a MIME message with a top-level content-type of multipart/report (defined in [REPORT]). When a multipart/report content is used to transmit a DSN:",
      "ja": "DSNは、（[REPORT]で定義された）マルチパート/レポートのトップレベルのコンテンツタイプとMIMEメッセージです。マルチパート/レポートの内容は、DSNを送信するために使用されている場合："
    },
    {
      "indent": 3,
      "text": "(a) The report-type parameter of the multipart/report content is \"delivery-status\".",
      "ja": "（a）は、マルチパート/レポートの内容のレポートタイプパラメータが「配達状態」です。"
    },
    {
      "indent": 3,
      "text": "(b) The first component of the multipart/report contains a human-readable explanation of the DSN, as described in [REPORT].",
      "ja": "（b）は、マルチパート/レポートの第一の成分は[REPORT]に記載されているように、DSNの人間可読な説明を含んでいます。"
    },
    {
      "indent": 3,
      "text": "(c) The second component of the multipart/report is of content-type message/delivery-status, described in section 2.1 of this document.",
      "ja": "（C）マルチパート/レポートの第二の成分は、この文書のセクション2.1に記載のコンテンツタイプメッセージ/配送状況、です。"
    },
    {
      "indent": 3,
      "text": "(d) If the original message or a portion of the message is to be returned to the sender, it appears as the third component of the multipart/report.",
      "ja": "元のメッセージまたはメッセージの一部は送信者に返される場合（D）は、マルチパート/レポートの第三成分として現れます。"
    },
    {
      "indent": 3,
      "text": "NOTE: For delivery status notifications gatewayed from foreign systems, the headers of the original message may not be available. In this case the third component of the DSN may be omitted, or it may contain \"simulated\" RFC 822 headers that contain equivalent information. In particular, it is very desirable to preserve the subject, date, and message-id (or equivalent) fields from the original message.",
      "ja": "注：配信状態通知は外部システムからゲートウェイ処理のために、元のメッセージのヘッダが利用可能ではないかもしれません。この場合、DSNの第三の構成要素を省略してもよいか、同等の情報を含む「模擬」RFC 822ヘッダを含んでいてもよいです。特に、元のメッセージの件名、日付、およびメッセージID（または同等の）フィールドを保持することが非常に望ましいです。"
    },
    {
      "indent": 3,
      "text": "The DSN MUST be addressed (in both the message header and the transport envelope) to the return address from the transport envelope which accompanied the original message for which the DSN was generated. (For a message that arrived via SMTP, the envelope return address appears in the MAIL FROM command.)",
      "ja": "DSNは、DSNが生成された元のメッセージを伴ったトランスポート・エンベロープからの戻りアドレスに（メッセージヘッダーとトランスポート・エンベロープの両方で）に対処しなければなりません。 （SMTP経由で到着したメッセージの場合は、封筒のリターンアドレスは、MAIL FROMコマンドで表示されます。）"
    },
    {
      "indent": 3,
      "text": "The From field of the message header of the DSN SHOULD contain the address of a human who is responsible for maintaining the mail system at the Reporting MTA site (e.g., Postmaster), so that a reply to the DSN will reach that person. Exception: if a DSN is translated from a foreign delivery report, and the gateway performing the translation cannot determine the appropriate address, the From field of the DSN MAY be the address of a human who is responsible for maintaining the gateway.",
      "ja": "DSNのメッセージヘッダのFromフィールドDSNへの回答がその人に到達するよう、報告MTAサイト（例えば、ポストマスター）でメールシステムを維持する責任がある人の住所を含むべきです。例外：DSNは外国配信レポートから翻訳され、翻訳を実行するゲートウェイが適切なアドレスを判別できない場合は、DSNのフィールドから、ゲートウェイを維持する責任がある人間のアドレスであってもよいです。"
    },
    {
      "indent": 3,
      "text": "The envelope sender address of the DSN SHOULD be chosen to ensure that no delivery status reports will be issued in response to the DSN itself, and MUST be chosen so that DSNs will not generate mail loops. Whenever an SMTP transaction is used to send a DSN, the MAIL FROM command MUST use a NULL return address, i.e., \"MAIL FROM:<>\".",
      "ja": "DSNのエンベロープ送信者アドレスには配送状態レポートは、DSN自体に応答して発行されないことを確実にするために選択しなければならない、とのDSNは、メールループを生成しないように選ばなければなりません。 SMTPトランザクションは、DSNを送信するために使用されるたびに、MAIL FROMコマンドは、すなわち、NULLの戻りアドレスを使用しなければならない「MAIL FROM：<>」。"
    },
    {
      "indent": 3,
      "text": "A particular DSN describes the delivery status for exactly one message. However, an MTA MAY report on the delivery status for several recipients of the same message in a single DSN. Due to the nature of the mail transport system (where responsibility for delivery of a message to its recipients may be split among several MTAs, and delivery to any particular recipient may be delayed), multiple DSNs may still be issued in response to a single message submission.",
      "ja": "特定のDSNは、1つのメッセージの配信状況を説明しています。しかし、MTAは、単一のDSNで同じメッセージを複数の受信者の配信状況を報告するかもしれません。 （その受信者へのメッセージの配信の責任は、いくつかのMTA間で分割することができる、任意の特定の受信者への配信が遅延してもよい）メール転送システムの性質のために、複数のDSNは依然として単一のメッセージに応答して発行されてもよいです提出。"
    },
    {
      "indent": 0,
      "text": "2.1 The message/delivery-status content-type",
      "section_title": true,
      "ja": "2.1メッセージ/配送状況コンテンツタイプ"
    },
    {
      "indent": 3,
      "text": "The message/delivery-status content-type is defined as follows:",
      "ja": "次のようにメッセージ/配送状況コンテンツタイプが定義されます。"
    },
    {
      "indent": 3,
      "text": "MIME type name: message MIME subtype name: delivery-status Optional parameters: none Encoding considerations: \"7bit\" encoding is sufficient and MUST be used to maintain readability when viewed by non-MIME mail readers. Security considerations: discussed in section 4 of this memo.",
      "ja": "MIMEタイプ名：メッセージMIMEサブタイプ名：配信ステータスオプションパラメータ：なしエンコードの考慮事項：「7ビット」の符号化は十分であり、非MIMEメール読者によって見たときに、読みやすさを維持するために使用されなければなりません。セキュリティの考慮事項：このメモのセクション4で議論しました。"
    },
    {
      "indent": 3,
      "text": "The message/delivery-status report type for use in the multipart/report is \"delivery-status\".",
      "ja": "マルチパート/レポートで使用するためのメッセージ/配信ステータスレポートタイプは「配送状況」です。"
    },
    {
      "indent": 3,
      "text": "The body of a message/delivery-status consists of one or more \"fields\" formatted according to the ABNF of RFC 822 header \"fields\" (see [RFC822]). The per-message fields appear first, followed by a blank line. Following the per-message fields are one or more groups of per-recipient fields. Each group of per-recipient fields is preceded by a blank line. Using the ABNF of RFC 822, the syntax of the message/delivery-status content is as follows:",
      "ja": "メッセージ/配送状況の本体は、RFC 822ヘッダ「フィールド」のABNFに従ってフォーマットされた1つ以上の「フィールド」から成る（[RFC822]参照）。メッセージごとのフィールドは、空白行に続いて、最初に表示されます。メッセージごとのフィールドに続いて、受信者ごとのフィールドの1つ以上のグループです。受信者ごとのフィールドの各グループは、空白行が先行しています。次のようにRFC 822のABNFを使用して、メッセージ/配送状況コンテンツの構文は次のとおりです。"
    },
    {
      "indent": 11,
      "text": "delivery-status-content =  per-message-fields 1*\n                          ( CRLF per-recipient-fields )",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The per-message fields are described in section 2.2. The per-recipient fields are described in section 2.3.",
      "ja": "メッセージごとのフィールドは、セクション2.2に記載されています。受信者ごとのフィールドはセクション2.3で説明されています。"
    },
    {
      "indent": 0,
      "text": "2.1.1 General conventions for DSN fields",
      "section_title": true,
      "ja": "DSNフィールドの2.1.1一般的な規則"
    },
    {
      "indent": 3,
      "text": "Since these fields are defined according to the rules of RFC 822, the same conventions for continuation lines and comments apply. Notification fields may be continued onto multiple lines by beginning each additional line with a SPACE or HTAB. Text that appears in parentheses is considered a comment and not part of the contents of that notification field. Field names are case-insensitive, so the names of notification fields may be spelled in any combination of upper and lower case letters. Comments in DSN fields may use the \"encoded-word\" construct defined in [MIME3].",
      "ja": "これらのフィールドは、RFC 822の規則に従って定義されているので、継続行とコメントに対して同じ規則が当てはまります。通知フィールドは、SPACEまたはHTAB各追加の行を開始することにより、複数の行に継続することができます。カッコ内に表示されるテキストはコメントしていないという通知フィールドの内容の一部とみなされます。フィールド名は大文字と小文字を区別しないので、通知フィールドの名前は、大文字と小文字の任意の組み合わせで綴られてもよいです。 DSNフィールドのコメントは、「符号化されたワード」[MIME3]で定義された構築物を使用することができます。"
    },
    {
      "indent": 0,
      "text": "2.1.2 \"*-type\" sub-fields",
      "section_title": true,
      "ja": "2.1.2「*型」のサブフィールド"
    },
    {
      "indent": 3,
      "text": "Several DSN fields consist of a \"-type\" sub-field, followed by a semicolon, followed by \"*text\". For these fields, the keyword used in the address-type, diagnostic-type, or MTA-name-type sub-field indicates the expected format of the address, status-code, or MTA-name which follows.",
      "ja": "いくつかのDSNフィールドは「*テキスト」に続くセミコロンが続く「型」のサブフィールド、で構成されています。これらのフィールドは、アドレス・タイプで使用されるキーワードは、診断型、またはMTA名型サブフィールドは、次の予想されるアドレスの形式、ステータスコード、またはMTA名を示しています。"
    },
    {
      "indent": 3,
      "text": "The \"-type\" sub-fields are defined as follows:",
      "ja": "以下のように「型」のサブフィールドが定義されています。"
    },
    {
      "indent": 3,
      "text": "(a) An \"address-type\" specifies the format of a mailbox address. For example, Internet mail addresses use the \"rfc822\" address-type.",
      "ja": "（A）「アドレス型」のメールボックスアドレスの形式を指定します。例えば、インターネットのメールアドレスは「RFC822」アドレス型を使用します。"
    },
    {
      "indent": 15,
      "text": "address-type = atom",
      "ja": "アドレス型=原子"
    },
    {
      "indent": 3,
      "text": "(b) A \"diagnostic-type\" specifies the format of a status code. For example, when a DSN field contains a reply code reported via the Simple Mail Transfer Protocol [SMTP], the \"smtp\" diagnostic-type is used.",
      "ja": "（B）「診断型」状態コードの形式を指定します。例えば、DSNフィールドは、簡易メール転送プロトコル[SMTP]を介して報告された応答コードが含まれている場合、「SMTP」診断型が使用されます。"
    },
    {
      "indent": 15,
      "text": "diagnostic-type = atom",
      "ja": "診断型=原子"
    },
    {
      "indent": 3,
      "text": "(c) An \"MTA-name-type\" specifies the format of an MTA name. For example, for an SMTP server on an Internet host, the MTA name is the domain name of that host, and the \"dns\" MTA-name-type is used.",
      "ja": "（C）「MTA名型」MTA名の形式を指定します。例えば、インターネットホスト上のSMTPサーバーでは、MTA名は、そのホストのドメイン名であり、「DNS」MTA名型が使用されています。"
    },
    {
      "indent": 15,
      "text": "mta-name-type = atom",
      "ja": "MTA名型=原子"
    },
    {
      "indent": 3,
      "text": "Values for address-type, diagnostic-type, and MTA-name-type are case-insensitive. Thus address-type values of \"RFC822\" and \"rfc822\" are equivalent.",
      "ja": "アドレスタイプ、診断タイプ、およびMTA名型の値は大文字と小文字を区別しません。したがって、「RFC822」と「RFC822」のアドレスタイプの値は等価です。"
    },
    {
      "indent": 3,
      "text": "The Internet Assigned Numbers Authority (IANA) will maintain a registry of address-types, diagnostic-types, and MTA-name-types, along with descriptions of the meanings and acceptable values of each, or a reference to one or more specifications that provide such descriptions. (The \"rfc822\" address-type, \"smtp\" diagnostic-type, and \"dns\" MTA-name-type are defined in [DRPT].) Registration forms for address-type, diagnostic-type, and MTA-name-type appear in Appendix D.",
      "ja": "インターネット割り当て番号機関（IANA）が提供する1つ以上の仕様の意味の説明とそれぞれの可能な値、または参照と一緒に、アドレスタイプ、診断・タイプ、およびMTA-名タイプのレジストリを維持しますような説明。 （[DRPT]に「RFC822」アドレス・タイプ、「SMTP」診断型、および「DNS」MTA名型が定義されている。）アドレスタイプのための登録フォーム、診断タイプ、およびMTA名型付録D.に表示されます"
    },
    {
      "indent": 3,
      "text": "IANA will not accept registrations for any address-type, diagnostic-type, or MTA-name-type name that begins with \"X-\". These type names are reserved for experimental use.",
      "ja": "IANAは「X-」で始まる任意のアドレスタイプ、診断タイプ、またはMTA名型名の登録を受け付けません。これらのタイプの名前は、実験的な使用のために予約されています。"
    },
    {
      "indent": 1,
      "text": "2.1.3 Lexical tokens imported from",
      "section_title": true,
      "ja": "2.1.3字句から輸入"
    },
    {
      "indent": 3,
      "text": "The following lexical tokens, defined in [RFC822], are used in the ABNF grammar for DSNs: atom, CHAR, comment, CR, CRLF, DIGIT, LF, linear-white-space, SPACE, text. The date-time lexical token is defined in [HOSTREQ].",
      "ja": "原子、CHAR、コメント、CR、CRLF、DIGIT、LF、線形空白、空白、テキスト：[RFC822]で定義された以下の字句は、DSNのためのABNF文法で使用されています。日時字句トークンは[HOSTREQ]で定義されています。"
    },
    {
      "indent": 0,
      "text": "2.2 Per-Message DSN Fields",
      "section_title": true,
      "ja": "2.2メッセージごとのDSNフィールド"
    },
    {
      "indent": 3,
      "text": "Some fields of a DSN apply to all of the delivery attempts described by that DSN. At most, these fields may appear once in any DSN. These fields are used to correlate the DSN with the original message transaction and to provide additional information which may be useful to gateways.",
      "ja": "DSNの一部のフィールドは、そのDSNで記述配達の試みのすべてに適用されます。せいぜい、これらのフィールドは、任意のDSNに一度表示されることがあります。これらのフィールドは、元のメッセージトランザクションでDSNを相関させるとゲートウェイに有用であり得る付加的な情報を提供するために使用されます。"
    },
    {
      "indent": 10,
      "text": "per-message-fields =\n      [ original-envelope-id-field CRLF ]\n      reporting-mta-field CRLF\n      [ dsn-gateway-field CRLF ]\n      [ received-from-mta-field CRLF ]\n      [ arrival-date-field CRLF ]\n      *( extension-field CRLF )",
      "raw": true
    },
    {
      "indent": 0,
      "text": "2.2.1 The Original-Envelope-Id field",
      "section_title": true,
      "ja": "オリジナル・封筒-Idフィールドは、2.2.1"
    },
    {
      "indent": 3,
      "text": "The optional Original-Envelope-Id field contains an \"envelope identifier\" that uniquely identifies the transaction during which the message was submitted, and was either (a) specified by the sender and supplied to the sender's MTA, or (b) generated by the sender's MTA and made available to the sender when the message was submitted. Its purpose is to allow the sender (or her user agent) to associate the returned DSN with the specific transaction in which the message was sent.",
      "ja": "オプションのオリジナルエンベロープ-IDフィールドは、一意のメッセージが送信された時にトランザクションを識別する「エンベロープ識別子」が含まれ、（a）は送信者によって指定され、送信者のMTAに供給される、又は（b）で生成されたいずれか送信者のMTAとメッセージが送信されたとき、送信者に利用可能となります。その目的は、送信者（または彼女のユーザーエージェント）は、メッセージが送信された特定の取引で返さDSNを関連付けることができるようにすることです。"
    },
    {
      "indent": 3,
      "text": "If such an envelope identifier was present in the envelope that accompanied the message when it arrived at the Reporting MTA, it SHOULD be supplied in the Original-Envelope-Id field of any DSNs issued as a result of an attempt to deliver the message. Except when a DSN is issued by the sender's MTA, an MTA MUST NOT supply this field unless there is an envelope-identifier field in the envelope that accompanied this message on its arrival at the Reporting MTA.",
      "ja": "そのような封筒識別子は、それが報告MTAに到着したときに、メッセージを伴った封筒に存在していた場合は、メッセージを配信する試みの結果として発行されたのDSNのオリジナル・エンベロープ-Idフィールドに供給してください。報告MTAでその到着時にこのメッセージを伴った封筒で封筒識別子フィールドが存在しない限り、DSNは、送信者のMTAによって発行された場合を除き、MTAは、このフィールドを提供してはなりません。"
    },
    {
      "indent": 3,
      "text": "The Original-Envelope-Id field is defined as follows:",
      "ja": "次のようにオリジナル・封筒-Idフィールドが定義されています。"
    },
    {
      "indent": 11,
      "text": "original-envelope-id-field =\n       \"Original-Envelope-Id\" \":\" envelope-id",
      "raw": true
    },
    {
      "indent": 12,
      "text": "envelope-id = *text",
      "ja": "封筒-ID = *テキスト"
    },
    {
      "indent": 3,
      "text": "There may be at most one Original-Envelope-Id field per DSN.",
      "ja": "DSNごとに最大1つのオリジナル・封筒-Idフィールドがあるかもしれません。"
    },
    {
      "indent": 3,
      "text": "The envelope-id is CASE-SENSITIVE. The DSN MUST preserve the original case and spelling of the envelope-id.",
      "ja": "封筒-IDは、大文字と小文字が区別されます。 DSN封筒-IDのオリジナルのケースと綴りを保持しなければなりません。"
    },
    {
      "indent": 9,
      "text": "NOTE: The Original-Envelope-Id is NOT the same as the\nMessage-Id from the message header.  The Message-Id identifies\nthe content of the message, while the Original-Envelope-Id\nidentifies the transaction in which the message is sent.",
      "raw": true
    },
    {
      "indent": 0,
      "text": "2.2.2 The Reporting-MTA DSN field",
      "section_title": true,
      "ja": "報告-MTA DSNフィールドは、2.2.2"
    },
    {
      "indent": 9,
      "text": "reporting-mta-field =\n      \"Reporting-MTA\" \":\" mta-name-type \";\" mta-name",
      "raw": true
    },
    {
      "indent": 10,
      "text": "mta-name = *text",
      "ja": "MTA名= *テキスト"
    },
    {
      "indent": 3,
      "text": "The Reporting-MTA field is defined as follows:",
      "ja": "次のように報告-MTAフィールドが定義されています。"
    },
    {
      "indent": 3,
      "text": "A DSN describes the results of attempts to deliver, relay, or gateway a message to one or more recipients. In all cases, the Reporting-MTA is the MTA that attempted to perform the delivery, relay, or gateway operation described in the DSN. This field is required.",
      "ja": "DSNは、送達リレー、または1つ以上の受信者にメッセージをゲートウェイする試みの結果を記述する。全ての場合において、レポート-MTAがDSNに記載の送達、リレー、またはゲートウェイの操作を実行しようとMTAです。この項目は必須です。"
    },
    {
      "indent": 3,
      "text": "Note that if an SMTP client attempts to relay a message to an SMTP server and receives an error reply to a RCPT command, the client is responsible for generating the DSN, and the client's domain name will appear in the Reporting-MTA field. (The server's domain name will appear in the Remote-MTA field.)",
      "ja": "SMTPクライアントがSMTPサーバーにメッセージを中継しようとするとRCPTコマンドにエラー応答を受信した場合、クライアントはDSNを生成するための責任があることに注意してください、そしてクライアントのドメイン名は、Reporting-MTAフィールドに表示されます。 （サーバーのドメイン名は、リモートMTAフィールドに表示されます。）"
    },
    {
      "indent": 3,
      "text": "Note that the Reporting-MTA is not necessarily the MTA which actually issued the DSN. For example, if an attempt to deliver a message outside of the Internet resulted in a non-delivery notification which was gatewayed back into Internet mail, the Reporting-MTA field of the resulting DSN would be that of the MTA that originally reported the delivery failure, not that of the gateway which converted the foreign notification into a DSN. See Figure 2.",
      "ja": "報告-MTAは、必ずしも実際にDSNを発行したMTAはないことに注意してください。インターネットの外にメッセージを配信する試行が不達通知をもたらした場合、例えば、インターネットメールに戻しゲートウェイ処理された、得られたDSNの報告-MTAフィールドは、最初の配信失敗を報告し、そのMTAのものであろうDSNに外来通知を変換ゲートウェイの、ないこと。図2を参照してください。"
    },
    {
      "indent": 1,
      "text": "sender's environment                            recipient's environment\n............................ ..........................................\n                           : :\n                       (1) : :                             (2)\n  +-----+  +--------+  +--------+  +---------+  +---------+   +------+\n  |     |  |        |  |        |  |Received-|  |         |   |      |\n  |     |=>|Original|=>|        |->|  From   |->|Reporting|-->|Remote|\n  | user|  |   MTA  |  |        |  |   MTA   |  |   MTA   |<No|  MTA |\n  |agent|  +--------+  |Gateway |  +---------+  +----v----+   +------+\n  |     |              |        |                    |\n  |     | <============|        |<-------------------+\n  +-----+              |        |(4)                (3)\n                       +--------+\n                           : :\n...........................: :.........................................",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Figure 2. DSNs in the presence of gateways",
      "ja": "ゲートウェイの存在下で2 DSNを図"
    },
    {
      "indent": 3,
      "text": "(1) message is gatewayed into recipient's environment (2) attempt to relay message fails (3) reporting-mta (in recipient's environment) returns non-delivery notification (4) gateway translates foreign notification into a DSN",
      "ja": "（1）メッセージ（2）メッセージを中継しようとする（3）（受信者の環境で）報告-MTAが不達通知を返す（4）ゲートウェイがDSNに外来通知を変換失敗した受信者の環境へのゲートウェイ処理されます"
    },
    {
      "indent": 3,
      "text": "The mta-name portion of the Reporting-MTA field is formatted according to the conventions indicated by the mta-name-type sub-field. If an MTA functions as a gateway between dissimilar mail environments and thus is known by multiple names depending on the environment, the mta-name sub-field SHOULD contain the name used by the environment from which the message was accepted by the Reporting-MTA.",
      "ja": "レポート-MTAフィールドのMTA名部分は、MTA名型サブフィールドで示される規則に従ってフォーマットされます。このように異なるメール環境との間のゲートウェイとしてMTA機能が環境に応じて複数の名前で知られている場合、MTA名のサブフィールドは、メッセージがレポート-MTAによって受け付けされた環境で使用される名前を含むべきです。"
    },
    {
      "indent": 3,
      "text": "Because the exact spelling of an MTA name may be significant in a particular environment, MTA names are CASE-SENSITIVE.",
      "ja": "MTA名の正確なスペルが特定の環境に大きな可能性があるため、MTA名は大文字と小文字が区別されます。"
    },
    {
      "indent": 0,
      "text": "2.2.3 The DSN-Gateway field",
      "section_title": true,
      "ja": "DSN-Gatewayフィールドを2.2.3"
    },
    {
      "indent": 3,
      "text": "The DSN-Gateway field indicates the name of the gateway or MTA that translated a foreign (non-Internet) delivery status notification into this DSN. This field MUST appear in any DSN that was translated by a gateway from a foreign system into DSN format, and MUST NOT appear otherwise.",
      "ja": "DSNゲートウェイフィールドは、このDSNに外来（非インターネット）配信状態通知を翻訳ゲートウェイ又はMTAの名前を示しています。このフィールドは、DSN形式に外部システムからゲートウェイによって翻訳された任意のDSNに表示される必要があり、そうでなければ表示されてはいけません。"
    },
    {
      "indent": 6,
      "text": "dsn-gateway-field = \"DSN-Gateway\" \":\" mta-name-type \";\" mta-name",
      "ja": "DSN-ゲートウェイフィールド= \"DSNゲートウェイ\" \"：\" MTA名型 \";\" MTA名"
    },
    {
      "indent": 3,
      "text": "For gateways into Internet mail, the MTA-name-type will normally be \"dns\", and the mta-name will be the Internet domain name of the gateway.",
      "ja": "インターネットメールへのゲートウェイの場合、MTA名型は、通常、「DNS」になり、MTA名は、ゲートウェイのインターネットドメイン名になります。"
    },
    {
      "indent": 0,
      "text": "2.2.4 The Received-From-MTA DSN field",
      "section_title": true,
      "ja": "受信から-MTA DSNフィールドは、2.2.4"
    },
    {
      "indent": 3,
      "text": "The optional Received-From-MTA field indicates the name of the MTA from which the message was received.",
      "ja": "オプションの受信から-MTAフィールドは、メッセージが受信されたMTAの名前を示しています。"
    },
    {
      "indent": 8,
      "text": "received-from-mta-field =\n     \"Received-From-MTA\" \":\" mta-name-type \";\" mta-name",
      "raw": true
    },
    {
      "indent": 3,
      "text": "If the message was received from an Internet host via SMTP, the contents of the mta-name sub-field SHOULD be the Internet domain name supplied in the HELO or EHLO command, and the network address used by the SMTP client SHOULD be included as a comment enclosed in parentheses. (In this case, the MTA-name-type will be \"dns\".)",
      "ja": "メッセージは、SMTPを介して、インターネットホストから受信された場合、MTA名のサブフィールドの内容として含まれるべきでHELOまたはEHLOコマンドに供給されるインターネットドメイン名、およびSMTPクライアントによって使用されるネットワークアドレスでなければなりません括弧で囲まれたコメント。 （この場合には、MTA名型は、「DNS」であろう。）"
    },
    {
      "indent": 3,
      "text": "The mta-name portion of the Received-From-MTA field is formatted according to the conventions indicated by the MTA-name-type sub-field.",
      "ja": "受信から-MTAフィールドのMTA名部分は、MTA名型のサブフィールドで示される規則に従ってフォーマットされます。"
    },
    {
      "indent": 3,
      "text": "Since case is significant in some mail systems, the exact spelling, including case, of the MTA name SHOULD be preserved.",
      "ja": "場合は、いくつかのメールシステムで重要であるので、MTA名の場合も含めて正確なスペルは、保存されるべきです。"
    },
    {
      "indent": 0,
      "text": "2.2.5 The Arrival-Date DSN field",
      "section_title": true,
      "ja": "到着日のDSNフィールドを2.2.5"
    },
    {
      "indent": 3,
      "text": "The optional Arrival-Date field indicates the date and time at which the message arrived at the Reporting MTA. If the Last-Attempt-Date field is also provided in a per-recipient field, this can be used to determine the interval between when the message arrived at the Reporting MTA and when the report was issued for that recipient.",
      "ja": "オプションの到着-Dateフィールドには、日付とメッセージが報告MTAに到着した時刻を示します。最終試行-Dateフィールドはまた、受信者ごとのフィールドで提供されている場合は、このメッセージが報告MTAに到着したときに、レポートをその受信者に対して発行されたときの間隔を決定するために使用することができます。"
    },
    {
      "indent": 8,
      "text": "arrival-date-field = \"Arrival-Date\" \":\" date-time",
      "ja": "到着日・フィールド=「到着-日」「：」日時"
    },
    {
      "indent": 3,
      "text": "The date and time are expressed in RFC 822 'date-time' format, as modified by [HOSTREQ]. Numeric timezones ([+/-]HHMM format) MUST be used.",
      "ja": "【HOSTREQ]によって修正された日付と時刻は、RFC 822「日時」の形式で表現されます。数値タイムゾーン（[+/-] HHMM形式）を使用しなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.3 Per-Recipient DSN fields",
      "section_title": true,
      "ja": "2.3ごとの受信者のDSNフィールド"
    },
    {
      "indent": 3,
      "text": "A DSN contains information about attempts to deliver a message to one or more recipients. The delivery information for any particular recipient is contained in a group of contiguous per-recipient fields. Each group of per-recipient fields is preceded by a blank line.",
      "ja": "DSNは、1つまたは複数の受信者にメッセージを配信しようとする試みに関する情報が含まれています。任意の特定の受信者の配信情報は、隣接ごとの受信者フィールドのグループに含まれています。受信者ごとのフィールドの各グループは、空白行が先行しています。"
    },
    {
      "indent": 3,
      "text": "The syntax for the group of per-recipient fields is as follows:",
      "ja": "次のように受信者ごとのフィールドのグループのための構文は次のとおりです。"
    },
    {
      "indent": 8,
      "text": "per-recipient-fields =\n      [ original-recipient-field CRLF ]\n      final-recipient-field CRLF\n      action-field CRLF\n      status-field CRLF\n      [ remote-mta-field CRLF ]\n      [ diagnostic-code-field CRLF ]\n      [ last-attempt-date-field CRLF ]\n      [ final-log-id-field CRLF ]\n      [ will-retry-until-field CRLF ]\n      *( extension-field CRLF )",
      "raw": true
    },
    {
      "indent": 0,
      "text": "2.3.1 Original-Recipient field",
      "section_title": true,
      "ja": "2.3.1オリジナル・受信者フィールド"
    },
    {
      "indent": 3,
      "text": "The Original-Recipient field indicates the original recipient address as specified by the sender of the message for which the DSN is being issued.",
      "ja": "DSNが発行されているため、メッセージの送信者によって指定されたオリジナル・受信者フィールドには、元の受信者のアドレスを示しています。"
    },
    {
      "indent": 7,
      "text": "original-recipient-field =\n      \"Original-Recipient\" \":\" address-type \";\" generic-address",
      "raw": true
    },
    {
      "indent": 8,
      "text": "generic-address = *text",
      "ja": "一般的なアドレス= *テキスト"
    },
    {
      "indent": 3,
      "text": "The address-type field indicates the type of the original recipient address. If the message originated within the Internet, the address-type field will normally be \"rfc822\", and the address will be according to the syntax specified in [RFC822]. The value \"unknown\" should be used if the Reporting MTA cannot determine the type of the original recipient address from the message envelope.",
      "ja": "アドレス型フィールドは、元の受信者のアドレスの種類を示します。メッセージは、インターネット内で発信された場合は、アドレス・タイプ・フィールドは、通常、「RFC822」になり、アドレスは[RFC822]で指定された構文に従うであろう。報告MTAは、メッセージエンベロープから元の受信者のアドレスの種類を判別できない場合は「不明」値を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "This field is optional. It should be included only if the sender-specified recipient address was present in the message envelope, such as by the SMTP extensions defined in [DRPT]. This address is the same as that provided by the sender and can be used to automatically correlate DSN reports and message transactions.",
      "ja": "このフィールドはオプションです。送信者が指定した受信者のアドレスは、[DRPT]で定義されたSMTP拡張などによって、メッセージエンベロープに存在した場合にのみ含まれるべきです。このアドレスは送信者によって提供されるものと同じであると自動的にDSNレポートとメッセージトランザクションを相関させるために使用することができます。"
    },
    {
      "indent": 0,
      "text": "2.3.2 Final-Recipient field",
      "section_title": true,
      "ja": "2.3.2最終受信者フィールド"
    },
    {
      "indent": 3,
      "text": "The Final-Recipient field indicates the recipient for which this set of per-recipient fields applies. This field MUST be present in each set of per-recipient data.",
      "ja": "最終受信者フィールドは、受信者ごとのフィールドのセットが適用される受信者を示します。このフィールドは、受信者ごとのデータの各セットに存在しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The syntax of the field is as follows:",
      "ja": "次のようにフィールドの構文は次のとおりです。"
    },
    {
      "indent": 9,
      "text": "final-recipient-field =\n    \"Final-Recipient\" \":\" address-type \";\" generic-address",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The generic-address sub-field of the Final-Recipient field MUST contain the mailbox address of the recipient (from the transport envelope), as it was when the Reporting MTA accepted the message for delivery.",
      "ja": "報告MTAは、配信のためのメッセージを受け入れたときにそれがあったとして、最終受信者フィールドの一般的なアドレスサブフィールドは、（トランスポート・エンベロープからの）受信者のメールボックスアドレスを含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Final-Recipient address may differ from the address originally provided by the sender, because it may have been transformed during forwarding and gatewaying into a totally unrecognizable mess. However, in the absence of the optional Original-Recipient field, the Final-Recipient field and any returned content may be the only information available with which to correlate the DSN with a particular message submission.",
      "ja": "それは完全に認識できない混乱に転送し、ゲートウェイ処理中に変換されている可能性があるため、最終的な受信者のアドレスは、もともと送信者によって提供されたアドレスと異なる場合があります。しかし、オプションの原受信者フィールドが存在しない場合に、最終受信者フィールドと任意の返されたコンテンツは、特定のメッセージの送信でDSNを相関させるとともに利用できる唯一の情報であってもよいです。"
    },
    {
      "indent": 3,
      "text": "The address-type sub-field indicates the type of address expected by the reporting MTA in that context. Recipient addresses obtained via SMTP will normally be of address-type \"rfc822\".",
      "ja": "アドレスタイプサブフィールドは、その文脈で報告MTAが期待アドレスのタイプを示しています。 SMTP経由で取得した受信者のアドレスは通常のアドレス型「RFC822」のものであろう。"
    },
    {
      "indent": 3,
      "text": "NOTE: The Reporting MTA is not expected to ensure that the address actually conforms to the syntax conventions of the address-type. Instead, it MUST report exactly the address received in the envelope, unless that address contains characters such as CR or LF which are not allowed in a DSN field.",
      "ja": "注：レポートMTAは、アドレスが実際のアドレス型の構文規則に準拠していることを確認することが期待されていません。そのアドレスがDSNフィールドで許可されていないようにCRやLFなどの文字が含まれていない限り、その代わりに、それは、正確に封筒に受信したアドレスを報告しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Since mailbox addresses (including those used in the Internet) may be case sensitive, the case of alphabetic characters in the address MUST be preserved.",
      "ja": "（インターネットで使用されるものを含む）、メールボックスのアドレスは大文字と小文字を区別することができるので、アドレスに英字の場合は、保存されなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.3.3 Action field",
      "section_title": true,
      "ja": "2.3.3 Actionフィールド"
    },
    {
      "indent": 3,
      "text": "The Action field indicates the action performed by the Reporting-MTA as a result of its attempt to deliver the message to this recipient address. This field MUST be present for each recipient named in the DSN.",
      "ja": "アクションフィールドは、この受信者アドレスにメッセージを配信する試みの結果として報告-MTAによって実行されるアクションを示します。このフィールドには、DSNで指定された受信者ごとに存在しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The syntax for the action-field is:",
      "ja": "アクション・フィールドの構文は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "action-field = \"Action\" \":\" action-value",
      "ja": "アクション・フィールド=「アクション」「：」アクション値"
    },
    {
      "indent": 6,
      "text": "action-value = \"failed\" / \"delayed\" / \"delivered\" / \"relayed\" / \"expanded\"",
      "ja": "アクション値は=「失敗」/「遅れ」/「配信」/「は中継されたが、」/「拡大」"
    },
    {
      "indent": 3,
      "text": "The action-value may be spelled in any combination of upper and lower case characters.",
      "ja": "アクション値は、大文字と小文字の任意の組み合わせで綴られてもよいです。"
    },
    {
      "indent": 3,
      "text": "\"failed\" indicates that the message could not be delivered to the recipient. The Reporting MTA has abandoned any attempts to deliver the message to this recipient. No further notifications should be expected.",
      "ja": "「失敗した」メッセージが受信者に配信することができなかったことを示しています。報告MTAは、この受信者にメッセージを配信しようとする試みを断念しました。これ以上の通知は期待すべきではありません。"
    },
    {
      "indent": 3,
      "text": "\"delayed\" indicates that the Reporting MTA has so far been unable to deliver or relay the message, but it will continue to attempt to do so. Additional notification messages may be issued as the message is further delayed or successfully delivered, or if delivery attempts are later abandoned.",
      "ja": "「遅れ」は報告MTAがこれまで提供したりメッセージを中継することができなかったことを示しているが、それはそうしようとしていきます。追加の通知メッセージは、メッセージがさらに遅れているとして発行または正常に配信、または配信の試みは、後に放棄された場合にすることができます。"
    },
    {
      "indent": 3,
      "text": "\"delivered\" indicates that the message was successfully delivered to the recipient address specified by the sender, which includes \"delivery\" to a mailing list exploder. It does not indicate that the message has been read. This is a terminal state and no further DSN for this recipient should be expected.",
      "ja": "メッセージが正常にメーリングリストエクスプローダに「配信」が含まれ、送信者、受信者によって指定されたアドレスに配信されたことを示し、「配信」。これは、メッセージが読まれたことを示すものではありません。これは、端末の状態であり、この受信者にはさらにDSNを期待すべきではありません。"
    },
    {
      "indent": 3,
      "text": "\"relayed\" indicates that the message has been relayed or gatewayed into an environment that does not accept responsibility for generating DSNs upon successful delivery. This action-value SHOULD NOT be used unless the sender has requested notification of successful delivery for this recipient.",
      "ja": "メッセージが正常に配信時にDSNを生成するための責任を負いません環境への中継やゲートウェイされていることを示し、「中継」。送信者はこの受信者のために成功した配達の通知を要求していない限り、このアクション値は使用されるべきではありません。"
    },
    {
      "indent": 3,
      "text": "\"expanded\" indicates that the message has been successfully delivered to the recipient address as specified by the sender, and forwarded by the Reporting-MTA beyond that destination to multiple additional recipient addresses. An action-value of \"expanded\" differs from \"delivered\" in that \"expanded\" is not a terminal state. Further \"failed\" and/or \"delayed\" notifications may be provided.",
      "ja": "「拡大」は、送信者によって指定され、かつ複数の追加の受信者のアドレスにその先を越えて報告-MTAによって転送されたメッセージが正常に受信者のアドレスに配信されたことを示しています。 「展開」のアクション値は、「展開」の「送達」とは異なる端末状態ではありません。また、「失敗した」および/または「遅延」の通知を提供することができます。"
    },
    {
      "indent": 3,
      "text": "Using the terms \"mailing list\" and \"alias\" as defined in [DRPT], section 7.2.7: An action-value of \"expanded\" is only to be used when the message is delivered to a multiple-recipient \"alias\". An action-value of \"expanded\" SHOULD NOT be used with a DSN issued on delivery of a message to a \"mailing list\".",
      "ja": "用語「メーリングリスト」と[DRPT]で定義されるように、「エイリアス」を使用して、セクション7.2.7：メッセージが複数の受信者「エイリアス」に送達されたときに「拡張」のアクション値にのみ使用されるべきです。 「拡大」の行動価値は、「メーリングリスト」へのメッセージの配信に発行されたDSNには使用しないでください。"
    },
    {
      "indent": 7,
      "text": "NOTE ON ACTION VS. STATUS CODES: Although the 'action' field\nmight seem to be redundant with the 'status' field, this is not\nthe case.  In particular, a \"temporary failure\" (\"4\") status code\ncould be used with an action-value of either \"delayed\" or\n\"failed\".  For example, assume that an SMTP client repeatedly\ntries to relay a message to the mail exchanger for a recipient,\nbut fails because a query to a domain name server timed out.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "After a few hours, it might issue a \"delayed\" DSN to inform the sender that the message had not yet been delivered. After a few days, the MTA might abandon its attempt to deliver the message and return a \"failed\" DSN. The status code (which would begin with a \"4\" to indicate \"temporary failure\") would be the same for both DSNs.",
      "ja": "数時間後には、メッセージがまだ配信されていなかったことを送信者に通知するために「遅延」DSNを発行することがあります。数日後、MTAはメッセージを配信し、「失敗した」DSNを返すためにその試みを放棄する可能性があります。 （「一時的な失敗」を示すために、「4」で始まるであろう）ステータスコードは、両方のDSNのために同じです。"
    },
    {
      "indent": 7,
      "text": "Another example for which the action and status codes may appear contradictory: If an MTA or mail gateway cannot deliver a message because doing so would entail conversions resulting in an unacceptable loss of information, it would issue a DSN with the 'action' field of \"failure\" and a status code of 'XXX'. If the message had instead been relayed, but with some loss of information, it might generate a DSN with the same XXX status-code, but with an action field of \"relayed\".",
      "ja": "別の例は、そのためのアクションとステータスコードが矛盾して表示されることがあります。そうすることが、情報の容認できない損失をもたらす変換を伴うだろうので、MTAやメールゲートウェイがメッセージを配信できない場合、それは \"の「アクション」フィールドでDSNを発行します失敗」や 『XXX』のステータスコード。メッセージが代わりに中継されますが、情報のいくつかの損失とされていた場合、それは同じXXXのステータス・コードを持つDSNを生成しますが、「中継」のアクションフィールドを持つかもしれません。"
    },
    {
      "indent": 0,
      "text": "2.3.4 Status field",
      "section_title": true,
      "ja": "2.3.4 Statusフィールド"
    },
    {
      "indent": 3,
      "text": "The per-recipient Status field contains a transport-independent status code that indicates the delivery status of the message to that recipient. This field MUST be present for each delivery attempt which is described by a DSN.",
      "ja": "受信者ごとのステータスフィールドは、受信者にメッセージの配信状態を示すトランスポート独立ステータスコードを含みます。このフィールドは、DSNによって記述される各配達の試みのために存在しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The syntax of the status field is:",
      "ja": "ステータスフィールドの構文は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "status-field = \"Status\" \":\" status-code",
      "ja": "ステータス・フィールド=「ステータス」「：」ステータスコード"
    },
    {
      "indent": 3,
      "text": "status-code = DIGIT \".\" 1*3DIGIT \".\" 1*3DIGIT",
      "ja": "ステータスコード= DIGIT「」 1 * 3DIGIT \"\" 1 * 3DIGIT"
    },
    {
      "indent": 6,
      "text": "; White-space characters and comments are NOT allowed within ; a status-code, though a comment enclosed in parentheses ; MAY follow the last numeric sub-field of the status-code. ; Each numeric sub-field within the status-code MUST be ; expressed without leading zero digits.",
      "ja": ";ホワイトスペース文字とコメントは内で許可されていません。ステータスコード、括弧で囲まれたコメントけれども。ステータスコードの最後の数字のサブフィールドに従うことができます。 ;ステータス・コード内の各数値のサブフィールドでなければなりません。ゼロディジットを招くことなく表現。"
    },
    {
      "indent": 3,
      "text": "Status codes thus consist of three numerical fields separated by \".\". The first sub-field indicates whether the delivery attempt was successful (2= success, 4 = persistent temporary failure, 5 = permanent failure). The second sub-field indicates the probable source of any delivery anomalies, and the third sub-field denotes a precise error condition, if known.",
      "ja": "ステータスコードは、このようにすることによって分離された3つの数値フィールドで構成します「」。最初のサブフィールドは、配達の試みが成功したかどうかを示す（2 =成功、4 =永続的な一時的な障害、5 =永久的な失敗）。第2のサブフィールドは、任意の送達異常の可能性ソースを示し、そして既知の場合に第3のサブフィールドは、正確なエラー状態を示しています。"
    },
    {
      "indent": 3,
      "text": "The initial set of status-codes is defined in [STATUS].",
      "ja": "ステータスコードの初期セットは、[STATUS]で定義されています。"
    },
    {
      "indent": 0,
      "text": "2.3.5 Remote-MTA field",
      "section_title": true,
      "ja": "2.3.5リモートMTAフィールド"
    },
    {
      "indent": 3,
      "text": "The value associated with the Remote-MTA DSN field is a printable ASCII representation of the name of the \"remote\" MTA that reported delivery status to the \"reporting\" MTA.",
      "ja": "リモートMTA DSNフィールドに関連付けられている値は、「レポート作成」MTAへの配信状況を報告し、「リモート」MTAの名前の印字可能なASCII表現です。"
    },
    {
      "indent": 6,
      "text": "remote-mta-field = \"Remote-MTA\" \":\" mta-name-type \";\" mta-name",
      "ja": "リモートMTAフィールド=「リモートMTA」「：」MTA名型「;」 MTA名"
    },
    {
      "indent": 3,
      "text": "NOTE: The Remote-MTA field preserves the \"while talking to\" information that was provided in some pre-existing nondelivery reports.",
      "ja": "注：リモートMTAフィールドは、いくつかの既存の配信不能レポートで提供されていた「と話しながら、」情報を保持します。"
    },
    {
      "indent": 3,
      "text": "This field is optional. It MUST NOT be included if no remote MTA was involved in the attempted delivery of the message to that recipient.",
      "ja": "このフィールドはオプションです。何のリモートMTAはその受取人へのメッセージの配信試行に関与しなかった場合は含んではいけません。"
    },
    {
      "indent": 0,
      "text": "2.3.6 Diagnostic-Code field",
      "section_title": true,
      "ja": "2.3.6診断コード・フィールド"
    },
    {
      "indent": 3,
      "text": "For a \"failed\" or \"delayed\" recipient, the Diagnostic-Code DSN field contains the actual diagnostic code issued by the mail transport. Since such codes vary from one mail transport to another, the diagnostic-type sub-field is needed to specify which type of diagnostic code is represented.",
      "ja": "「失敗した」または「遅延」の受信者のために、診断・コードDSNフィールドは、メール転送によって発行された実際の診断コードが含まれています。そのようなコードは、1つのメールトランスポートから別のものに変化するので、診断タイプサブフィールドは、診断コードの種類が表されるかを指定するために必要とされます。"
    },
    {
      "indent": 4,
      "text": "diagnostic-code-field = \"Diagnostic-Code\" \":\" diagnostic-type \";\" *text",
      "ja": "診断コードフィールド=「診断・コード」「：」診断型「;」 *テキスト"
    },
    {
      "indent": 3,
      "text": "NOTE: The information in the Diagnostic-Code field may be somewhat redundant with that from the Status field. The Status field is needed so that any DSN, regardless of origin, may be understood by any user agent or gateway that parses DSNs. Since the Status code will sometimes be less precise than the actual transport diagnostic code, the Diagnostic-Code field is provided to retain the latter information. Such information may be useful in a trouble ticket sent to the administrator of the Reporting MTA, or when tunneling foreign non-delivery reports through DSNs.",
      "ja": "注：診断-Codeフィールド内の情報は、Statusフィールドからのものと多少冗長かもしれません。ステータスフィールドは、任意のDSNように必要とされているにかかわらず、起源の、DSNを解析し、任意のユーザエージェントまたはゲートウェイによって理解することができます。ステータスコードは、時々、実際の輸送診断コード未満の正確されるので、診断コードフィールドは、後者の情報を保持するために設けられています。このような情報は報告MTAの管理者に送信トラブルチケットに有用であること、またはのDSNを通じて外国配信不能レポートをトンネリングする場合があります。"
    },
    {
      "indent": 3,
      "text": "If the Diagnostic Code was obtained from a Remote MTA during an attempt to relay the message to that MTA, the Remote-MTA field should be present. When interpreting a DSN, the presence of a Remote-MTA field indicates that the Diagnostic Code was issued by the Remote MTA. The absence of a Remote-MTA indicates that the Diagnostic Code was issued by the Reporting MTA.",
      "ja": "診断コードは、そのMTAにメッセージを中継しようとする時にリモートMTAから入手した場合は、リモートMTAフィールドが存在しなければなりません。 DSNを解釈すると、リモートMTAフィールドの存在は、診断コードがリモートMTAによって発行されたことを示しています。リモートMTAの不在は、診断コードが報告MTAによって発行されたことを示しています。"
    },
    {
      "indent": 3,
      "text": "In addition to the Diagnostic-Code itself, additional textual description of the diagnostic, MAY appear in a comment enclosed in parentheses.",
      "ja": "診断・コード自体に加えて、診断の追加テキスト記述は、括弧で囲まれたコメントに表示されることがあります。"
    },
    {
      "indent": 3,
      "text": "This field is optional, because some mail systems supply no additional information beyond that which is returned in the 'action' and 'status' fields. However, this field SHOULD be included if transport-specific diagnostic information is available.",
      "ja": "いくつかのメールシステムは、「アクション」と「状態」フィールドに返されたこと以外の追加情報を提供しないため、このフィールドは、オプションです。トランスポート固有の診断情報が利用可能な場合は、このフィールドは含まれるべきです。"
    },
    {
      "indent": 0,
      "text": "2.3.7 Last-Attempt-Date field",
      "section_title": true,
      "ja": "2.3.7最終試行-Dateフィールド"
    },
    {
      "indent": 3,
      "text": "The Last-Attempt-Date field gives the date and time of the last attempt to relay, gateway, or deliver the message (whether successful or unsuccessful) by the Reporting MTA. This is not necessarily the same as the value of the Date field from the header of the message used to transmit this delivery status notification: In cases where the DSN was generated by a gateway, the Date field in the message header contains the time the DSN was sent by the gateway and the DSN Last-Attempt-Date field contains the time the last delivery attempt occurred.",
      "ja": "最終試行-Dateフィールドは、リレーゲートウェイ、または報告MTAによって（成功または失敗したかどうか）メッセージを配信するための最後の試みの日付と時間を与えます。これは、必ずしもこの配信状態通知を送信するために使用されるメッセージのヘッダからの日付フィールドの値と同じではない：DSNは、ゲートウェイによって生成された場合には、メッセージヘッダーの日付フィールドが時間DSNが含まゲートウェイによって送信され、DSN最終試行-Dateフィールドは、最後の配信試行が発生した時間が含まれていました。"
    },
    {
      "indent": 6,
      "text": "last-attempt-date-field = \"Last-Attempt-Date\" \":\" date-time",
      "ja": "最後の試み - 日付フィールド=「最終試行 - 日」「：」日時"
    },
    {
      "indent": 3,
      "text": "This field is optional. It MUST NOT be included if the actual date and time of the last delivery attempt are not available (which might be the case if the DSN were being issued by a gateway).",
      "ja": "このフィールドはオプションです。最後の配信試行の実際の日付と時刻が利用できない場合は（DSNは、ゲートウェイによって発行されていた場合はケースであるかもしれない）を含んではいけません。"
    },
    {
      "indent": 3,
      "text": "The date and time are expressed in RFC 822 'date-time' format, as modified by [HOSTREQ]. Numeric timezones ([+/-]HHMM format) MUST be used.",
      "ja": "【HOSTREQ]によって修正された日付と時刻は、RFC 822「日時」の形式で表現されます。数値タイムゾーン（[+/-] HHMM形式）を使用しなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.3.8 final-log-id field",
      "section_title": true,
      "ja": "2.3.8最終ログ-idフィールド"
    },
    {
      "indent": 3,
      "text": "The \"final-log-id\" field gives the final-log-id of the message that was used by the final-mta. This can be useful as an index to the final-mta's log entry for that delivery attempt.",
      "ja": "「最終ログインID」フィールドには、最終のMTAによって使用されたメッセージの最終ログインIDを与えます。これは、その配信試行のための最終的な-MTAのログエントリへのインデックスとして有用であり得ます。"
    },
    {
      "indent": 6,
      "text": "final-log-id-field = \"Final-Log-ID\" \":\" *text",
      "ja": "最終ログインID・フィールド= \"ファイナル-LOG-ID\" \"：\" *テキスト"
    },
    {
      "indent": 3,
      "text": "This field is optional.",
      "ja": "このフィールドはオプションです。"
    },
    {
      "indent": 0,
      "text": "2.3.9 Will-Retry-Until field",
      "section_title": true,
      "ja": "2.3.9は、再試行します-までフィールド"
    },
    {
      "indent": 3,
      "text": "For DSNs of type \"delayed\", the Will-Retry-Until field gives the date after which the Reporting MTA expects to abandon all attempts to deliver the message to that recipient. The Will-Retry-Until field is optional for \"delay\" DSNs, and MUST NOT appear in other DSNs.",
      "ja": "種類のDSNのために「遅延」、ウィル・リトライまでフィールドは報告MTAがその受信者にメッセージを配信するすべての試みを放棄することを期待した後の日付を提供します。ウィル・リトライまでのフィールドは、「遅延」のDSNのためのオプションであり、そして他のDSNに現れてはいけません。"
    },
    {
      "indent": 6,
      "text": "will-retry-until-field = \"Will-Retry-Until\" \":\" date-time",
      "ja": " - 再試行されます-までフィールド=「ウィル・リトライまで」「：」日時"
    },
    {
      "indent": 3,
      "text": "The date and time are expressed in RFC 822 'date-time' format, as modified by [HOSTREQ]. Numeric timezones ([+/-]HHMM format) MUST be used.",
      "ja": "【HOSTREQ]によって修正された日付と時刻は、RFC 822「日時」の形式で表現されます。数値タイムゾーン（[+/-] HHMM形式）を使用しなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.4 Extension fields",
      "section_title": true,
      "ja": "2.4拡張フィールド"
    },
    {
      "indent": 3,
      "text": "Additional per-message or per-recipient DSN fields may be defined in the future by later revisions or extensions to this specification. Extension-field names beginning with \"X-\" will never be defined as standard fields; such names are reserved for experimental use. DSN field names NOT beginning with \"X-\" MUST be registered with the Internet Assigned Numbers Authority (IANA) and published in an RFC.",
      "ja": "追加のメッセージごとまたは受信者ごとのDSNフィールドは、この仕様書に後で改訂または拡張によって将来定義することができます。 「X-」で始まる内線フィールド名は、標準のフィールドとして定義されることはありません。そのような名前は、実験的な使用のために予約されています。 「X-」で始まらないDSNフィールド名は、Internet Assigned Numbers Authority（IANA）に登録され、RFCで公開する必要があります。"
    },
    {
      "indent": 3,
      "text": "Extension DSN fields may be defined for the following reasons:",
      "ja": "拡張DSNフィールドは、次のような理由のために定義することができます。"
    },
    {
      "indent": 3,
      "text": "(a) To allow additional information from foreign delivery status reports to be tunneled through Internet DSNs. The names of such DSN fields should begin with an indication of the foreign environment name (e.g., X400-Physical-Forwarding-Address).",
      "ja": "（a）は、外国配送状態レポートからの追加情報は、インターネットのDSNを介してトンネリングできるようにするには。このようDSN分野の名前は外国環境名（例えば、X400-物理フォワーディングアドレス）の表示と共に開始する必要があります。"
    },
    {
      "indent": 3,
      "text": "(b) To allow the transmission of diagnostic information which is specific to a particular mail transport protocol. The names of such DSN fields should begin with an indication of the mail transport being used (e.g., SMTP-Remote-Recipient-Address). Such fields should be used for diagnostic purposes only and not by user agents or mail gateways.",
      "ja": "（B）特定のメール転送プロトコルに固有の診断情報の送信を可能にします。このようDSNフィールドの名前（例えば、SMTP-リモート受信者-Address）を使用しているメール転送の表示で始める必要があります。このようなフィールドだけではなく、ユーザーエージェントやメールゲートウェイによって診断目的のために使用すべきです。"
    },
    {
      "indent": 3,
      "text": "(c) To allow transmission of diagnostic information which is specific to a particular message transfer agent (MTA). The names of such DSN fields should begin with an indication of the MTA implementation that produced the DSN. (e.g., Foomail-Queue-ID).",
      "ja": "（C）特定のメッセージ転送エージェント（MTA）に特異的である診断情報の送信を可能にします。そのようなDSNフィールドの名前は、DSNを生成MTA実装の指示で開始すべきです。 （例えば、Foomail-キュー-ID）。"
    },
    {
      "indent": 3,
      "text": "MTA implementers are encouraged to provide adequate information, via extension fields if necessary, to allow an MTA maintainer to understand the nature of correctable delivery failures and how to fix them. For example, if message delivery attempts are logged, the DSN might include information that allows the MTA maintainer to easily find the log entry for a failed delivery attempt.",
      "ja": "MTA実装者は、必要に応じて、MTAメンテナが修正配信の失敗とどのようにそれらを修正するの性質を理解できるようにするために、拡張フィールドを経由して、適切な情報を提供することが奨励されています。メッセージ配信の試行がログに記録されている場合たとえば、DSNは、MTAのメンテナが簡単に失敗した配信試行のログエントリを検索することを可能にする情報が含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "If an MTA developer does not wish to register the meanings of such extension fields, \"X-\" fields may be used for this purpose. To avoid name collisions, the name of the MTA implementation should follow the \"X-\", (e.g., \"X-Foomail-Log-ID\").",
      "ja": "MTA開発者は、このような拡張フィールドの意味を登録したくない場合は、「X-」フィールドは、この目的のために使用することができます。名前の衝突を避けるために、MTAの実装の名前（例えば、「X-Foomail-ログインID」）を、「X-」に従ってください。"
    },
    {
      "indent": 0,
      "text": "3. Conformance and Usage Requirements",
      "section_title": true,
      "ja": "3.適合性および使用の要件"
    },
    {
      "indent": 3,
      "text": "An MTA or gateway conforms to this specification if it generates DSNs according to the protocol defined in this memo. For MTAs and gateways that do not support requests for positive delivery notification (such as in [DRPT]), it is sufficient that delivery failure reports use this protocol.",
      "ja": "それはこのメモで定義されたプロトコルに従ってDSNを生成した場合、MTA又はゲートウェイは、この仕様に準拠します。 （例えば[DRPT]のように）正の送達通知の要求をサポートしないのMTAおよびゲートウェイのためには、配信失敗レポートは、このプロトコルを使用することで十分です。"
    },
    {
      "indent": 3,
      "text": "A minimal implementation of this specification need generate only the Reporting-MTA per-message field, and the Final-Recipient, Action, and Status fields for each attempt to deliver a message to a recipient described by the DSN. Generation of the other fields, when appropriate, is strongly recommended.",
      "ja": "この仕様の最小限の実装では、DSNで説明受信者にメッセージを配信するために、各試みのためにのみ報告-MTAメッセージごとのフィールド、および最終受信者、アクション、およびステータス・フィールドを生成する必要があります。他のフィールドの生成は、適切な場合に、強くお勧めします。"
    },
    {
      "indent": 3,
      "text": "MTAs and gateways MUST NOT generate the Original-Recipient field of a DSN unless the mail transfer protocol provides the address originally specified by the sender at the time of submission. (Ordinary SMTP does not make that guarantee, but the SMTP extension defined in [DRPT] permits such information to be carried in the envelope if it is available.)",
      "ja": "メール転送プロトコルは、もともと提出時に送信者によって指定されたアドレスを提供しない限りのMTAとゲートウェイは、DSNのオリジナル・受信者フィールドを生成してはなりません。 （通常のSMTPはその保証を行いませんが、許可証などの情報[DRPT]で定義されたSMTP拡張は、それが利用可能な場合封筒で運ばれます。）"
    },
    {
      "indent": 3,
      "text": "Each sender-specified recipient address SHOULD result in at most one \"delivered\" or \"failed\" DSN for that recipient. If a positive DSN is requested (e.g., one using NOTIFY=SUCCESS in SMTP) for a recipient that is forwarded to multiple recipients of an \"alias\" (as defined in [DRPT], section 7.2.7), the forwarding MTA SHOULD normally issue a \"expanded\" DSN for the originally-specified recipient and not propagate the request for a DSN to the forwarding addresses. Alternatively, the forwarding MTA MAY relay the request for a DSN to exactly one of the forwarding addresses and not propagate the request to the others.",
      "ja": "各送信者が指定した受信者のアドレスは、その受信者のために最大1つの「配信」または「失敗」DSNを生じるはずです。正のDSNが要求された場合（例えば、NOTIFY = SMTP成功用いたもの）、「エイリアス」の複数の受信者に転送される受信者（[DRPT]で定義されるように、セクション7.2.7）は、転送MTAは通常SHOULDもともとは、指定された受信者のための「拡大」DSNを発行し、転送先アドレスにDSNの要求を伝播しません。また、転送MTAは、転送アドレスの正確に一つにDSNの要求を中継し、他の人に要求を伝播しないことがあります。"
    },
    {
      "indent": 3,
      "text": "By contrast, successful submission of a message to a mailing list exploder is considered final delivery of the message. Upon delivery of a message to a recipient address corresponding to a mailing list exploder, the Reporting MTA SHOULD issue an appropriate DSN exactly as if the recipient address were that of an ordinary mailbox.",
      "ja": "これとは対照的に、メーリングリストエクスプローダへのメッセージの成功の提出は、メッセージの最終的な配信と考えられています。受信者のアドレスは、通常のメールボックスのものであるかのようにメーリングリストエクスプローダに対応した受信者のアドレスへのメッセージの配信時には、報告MTAは正確に適切なDSNを発行する必要があります。"
    },
    {
      "indent": 7,
      "text": "NOTE: This is actually intended to make DSNs usable by mailing\nlists themselves.  Any message sent to a mailing list subscriber\nshould have its envelope return address pointing to the list\nmaintainer [see RFC 1123, section 5.3.7(E)].  Since DSNs are sent\nto the envelope return address, all DSNs resulting from delivery\nto the recipients of a mailing list will be sent to the list\nmaintainer.  The list maintainer may elect to mechanically\nprocess DSNs upon receipt, and thus automatically delete invalid\naddresses from the list. (See section 7 of this memo.)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This specification places no restrictions on the processing of DSNs received by user agents or distribution lists.",
      "ja": "この仕様は、ユーザエージェントまたは配布リストが受信したDSNの処理に制限を課すません。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The following security considerations apply when using DSNs:",
      "ja": "DSNを使用する場合は、次のセキュリティ上の考慮事項が適用されます。"
    },
    {
      "indent": 0,
      "text": "4.1 Forgery",
      "section_title": true,
      "ja": "4.1偽造"
    },
    {
      "indent": 3,
      "text": "DSNs may be forged as easily as ordinary Internet electronic mail. User agents and automatic mail handling facilities (such as mail distribution list exploders) that wish to make automatic use of DSNs should take appropriate precautions to minimize the potential damage from denial-of-service attacks.",
      "ja": "DSNは、通常、インターネット、電子メールのように簡単に偽造することができます。サービス拒否攻撃からの潜在的な損傷を最小限にするために、適切な予防措置を講じなければならないのDSNを自動的に利用することを希望するユーザエージェントと（メール配布リストの発破など）自動メール処理施設。"
    },
    {
      "indent": 3,
      "text": "Security threats related to forged DSNs include the sending of:",
      "ja": "鍛造のDSNに関連するセキュリティの脅威は、の送信が含まれます。"
    },
    {
      "indent": 3,
      "text": "(a) A falsified delivery notification when the message is not delivered to the indicated recipient,",
      "ja": "（a）は、メッセージが示された受信者に配信されていない改竄配信通知を、"
    },
    {
      "indent": 3,
      "text": "(b) A falsified non-delivery notification when the message was in fact delivered to the indicated recipient,",
      "ja": "メッセージが実際に示された受信者に配信されたときに（b）のAは、不達通知を改ざん"
    },
    {
      "indent": 3,
      "text": "(c) A falsified Final-Recipient address,",
      "ja": "（C）Aは、最終的な受信者のアドレスを偽造しました"
    },
    {
      "indent": 3,
      "text": "(d) A falsified Remote-MTA identification,",
      "ja": "（D）Aは、リモートMTAの識別を​​偽造しました"
    },
    {
      "indent": 3,
      "text": "(e) A falsified relay notification when the message is \"dead ended\".",
      "ja": "メッセージは、「デッドエンド」される（e）のA偽造中継通知。"
    },
    {
      "indent": 3,
      "text": "(f) Unsolicited DSNs",
      "ja": "（F）未承諾のDSN"
    },
    {
      "indent": 0,
      "text": "4.2 Confidentiality",
      "section_title": true,
      "ja": "4.2機密性"
    },
    {
      "indent": 3,
      "text": "Another dimension of security is confidentiality. There may be cases in which a message recipient is autoforwarding messages but does not wish to divulge the address to which the messages are autoforwarded. The desire for such confidentiality will probably be heightened as \"wireless mailboxes\", such as pagers, become more widely used as autoforward addresses.",
      "ja": "セキュリティのもう一つの次元は機密性です。メッセージの受信者がメッセージを自動転送されますが、メッセージが自動転送されたアドレスを明かしたくないするケースがあるかもしれません。そのような機密性への欲求は、おそらくより広く自動転送アドレスとして使用されるようになって、ページャとして「ワイヤレスメールボックス」、と高めることになります。"
    },
    {
      "indent": 3,
      "text": "MTA authors are encouraged to provide a mechanism which enables the end user to preserve the confidentiality of a forwarding address. Depending on the degree of confidentiality required, and the nature of the environment to which a message were being forwarded, this might be accomplished by one or more of: (a) issuing a \"relayed\" DSN (if a positive DSN was requested) when a message is forwarded to a confidential forwarding address, and disabling requests for positive DSNs for the forwarded message,",
      "ja": "MTA著者は、転送先アドレスの機密性を保持するために、エンドユーザーを可能にするメカニズムを提供することが奨励されています。必要な機密性の程度、およびメッセージが転送された先の環境の性質に応じて、これは、一つ以上によって達成される可能性があります：（a）の（正のDSNを要求された場合）「中継」DSNを発行するときメッセージは、機密転送先アドレスに転送され、転送されたメッセージのための正のDSNの要求を無効にされ、"
    },
    {
      "indent": 3,
      "text": "(b) declaring the message to be delivered, issuing a \"delivered\" DSN, re-sending the message to the confidential forwarding address, and arranging for no DSNs to be issued for the re-sent message,",
      "ja": "（B）DSNは、機密転送アドレスにメッセージを再送信し、再送信されたメッセージを発行すべきDSNのために配置する「配信」を発行し、メッセージが配信されるように宣言し、"
    },
    {
      "indent": 3,
      "text": "(c) omitting \"Remote-*\" or extension fields of a DSN whenever they would otherwise contain confidential information (such as a confidential forwarding address),",
      "ja": "（C）は、そうでない場合（例えば、機密転送アドレスのような）機密情報を含むであろうたびDSNの「リモート -  *」又は拡張フィールドを省略し、"
    },
    {
      "indent": 3,
      "text": "(d) for messages forwarded to a confidential address, setting the envelope return address (e.g., SMTP MAIL FROM address) to the NULL reverse-path (\"<>\") (so that no DSNs would be sent from a downstream MTA to the original sender),",
      "ja": "機密アドレスに転送メッセージのための（d）に、NULLにエンベロープリターンアドレス（アドレスFROM例えば、SMTPのMAIL）の設定が逆パス（「<>」）を（何のDSNは、下流のMTAからに送信されないであろうように、元の送信者）、"
    },
    {
      "indent": 3,
      "text": "(e) for messages forwarded to a confidential address, disabling delivery notifications for the forwarded message (e.g., if the \"next-hop\" MTA uses ESMTP and supports the DSN extension, by using the NOTIFY=NEVER parameter to the RCPT command), or",
      "ja": "機密アドレスに転送メッセージ、転送されたメッセージの配信通知を無効にする（例えば、「次のホップ」は、MTAは= RCPTコマンドにパラメータ決してNOTIFY使用することによって、ESMTPを使用し、DSN拡張をサポートしている場合）のための（e）に、または"
    },
    {
      "indent": 3,
      "text": "(f) when forwarding mail to a confidential address, having the forwarding MTA rewrite the envelope return address for the forwarded message and attempt delivery of that message as if the forwarding MTA were the originator. On its receipt of final delivery status, the forwarding MTA would issue a DSN to the original sender.",
      "ja": "（f）は、機密アドレスにメールを転送する際、転送MTAが転送メッセージのエンベロープリターンアドレスを書き換え、転送MTAが発信したかのようにそのメッセージの配信を試みる有します。最終的な配信状況をその受信すると、転送するMTAは、元の送信者にDSNを発行します。"
    },
    {
      "indent": 3,
      "text": "In general, any optional DSN field may be omitted if the Reporting MTA site determines that inclusion of the field would impose too great a compromise of site confidentiality. The need for such confidentiality must be balanced against the utility of the omitted information in trouble reports and DSNs gatewayed to foreign environments.",
      "ja": "報告MTAサイトは、フィールドを含めることは、サイトの機密性の大き過ぎる妥協を課すことを決定した場合、一般的には、任意のオプションのDSNフィールドを省略することができます。そのような機密性の必要性は、外国の環境にgatewayedさトラブル報告とのDSNで省略された情報の有用性に対してバランスをとらなければなりません。"
    },
    {
      "indent": 3,
      "text": "Implementers are cautioned that many existing MTAs will send non-delivery notifications to a return address in the message header (rather than to the one in the envelope), in violation of SMTP and other protocols. If a message is forwarded through such an MTA, no reasonable action on the part of the forwarding MTA will prevent the downstream MTA from compromising the forwarding address. Likewise, if the recipient's MTA automatically responds to messages based on a request in the message header (such as the nonstandard, but widely used, Return-Receipt-To extension header), it will also compromise the forwarding address.",
      "ja": "実装は、多くの既存のMTAは、SMTPなどのプロトコルに違反して、（むしろエンベロープのものと比べて）、メッセージヘッダ内のリターン・アドレスに配信不能通知を送信することを警告しています。メッセージがそのようなMTAを介して転送される場合、転送MTAの一部には、合理的なアクションは、転送先アドレスを損なうから下流のMTAを防止しないであろう。受信者のMTAは、（拡張ヘッダへの領収書を-返し、などの非標準として、しかし、広く使われている）に自動的にメッセージヘッダーの要求に基づいてメッセージに応答した場合同様に、それはまた、転送先アドレスを妥協します。"
    },
    {
      "indent": 0,
      "text": "4.3 Non-Repudiation",
      "section_title": true,
      "ja": "4.3否認防止"
    },
    {
      "indent": 3,
      "text": "Within the framework of today's internet mail, the DSNs defined in this memo provide valuable information to the mail user; however, even a \"failed\" DSN can not be relied upon as a guarantee that a message was not received by the recipient. Even if DSNs are not actively forged, conditions exist under which a message can be delivered despite the fact that a failure DSN was issued.",
      "ja": "今日のインターネットメールの枠組みの中で、このメモで定義されたDSNは、メールユーザーに有益な情報を提供します。しかし、「失敗した」DSNは、メッセージが受信者によって受信されなかった保証として当てにすることはできません。 DSNには積極的に偽造されていない場合でも、条件はメッセージが障害DSNが発行されたという事実にもかかわらず配信することができ、その下に存在します。"
    },
    {
      "indent": 3,
      "text": "For example, a race condition in the SMTP protocol allows for the duplication of messages if the connection is dropped following a completed DATA command, but before a response is seen by the SMTP client.",
      "ja": "たとえば、SMTPプロトコルの競合状態は、接続が完了DATAコマンド以下のドロップされた場合は、メッセージの重複を可能にしますが、応答する前に、SMTPクライアントによって見られています。"
    },
    {
      "indent": 3,
      "text": "This will cause the SMTP client to retransmit the message, even though the SMTP server has already accepted it [SMTPDUP]. If one of those delivery attempts succeeds and the other one fails, a \"failed\" DSN could be issued even though the message actually reached the recipient.",
      "ja": "これは、SMTPサーバがすでに[SMTPDUP]受け入れているにもかかわらず、SMTPクライアントがメッセージを再送するようになります。これらの配達の試みの一つが成功し、他の1が失敗した場合は、メッセージが実際に受信者に到達したにもかかわらず、DSNを発行することができ、「失敗しました」。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "ja": "5.引用規格"
    },
    {
      "indent": 3,
      "text": "[DRPT] Moore, K., \"SMTP Service Extension for Delivery Status Notifications\", RFC 3461, January 2003.",
      "ja": "[DRPT]ムーア、K.、 \"配送状態通知のためのSMTPサービス拡張\"、RFC 3461、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[DSN] Moore, K. and G. Vaudreuil, \"An Extensible Message Format for Delivery Status Notifications\", RFC 1894, January 1996.",
      "ja": "[DSN]ムーア、K.とG.ボードルイ、 \"配送状態通知のための広げることができるメッセージフォーマット\"、RFC 1894、1996年1月。"
    },
    {
      "indent": 3,
      "text": "[HOSTREQ] Braden, R. (ed.), \"Requirements for Internet Hosts - Application and Support\", STD 3, RFC 1123, October 1989.",
      "ja": "[HOSTREQ]ブレーデン、R.（編）、 \"インターネットホストのための要件 - 、アプリケーションとサポート\"、STD 3、RFC 1123、1989年10月。"
    },
    {
      "indent": 3,
      "text": "[MIME1] Freed, N. and N. Borenstein, \"Multipurpose Internet Mail Extensions (MIME) Part One: Format of Internet Message Bodies\", RFC 2045, November 1996.",
      "ja": "[MIME1]解放され、N.とN. Borenstein、 \"マルチパーパスインターネットメールエクステンション（MIME）第一部：インターネットメッセージ本体のフォーマット\"、RFC 2045、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[MIME3] Moore, K., \"MIME (Multipurpose Internet Mail Extensions) Part Three: Message Header Extensions for Non-ASCII Text\", RFC 2047, November 1996.",
      "ja": "[MIME3]ムーア、K.、 \"MIME（多目的インターネットメール拡張）パート3：非ASCIIテキストのためのメッセージヘッダの拡張\"、RFC 2047、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[REPORT] Vaudreuil, G., \"The Multipart/Report Content Type for the Reporting of Mail System Administrative Messages\", RFC 3462, January 2003.",
      "ja": "[REPORT]ヴォードルイユ、G.、「メールシステム管理メッセージの報告のための複合/レポートのコンテンツタイプ」、RFC 3462、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC822] Crocker, D., \"Standard for the format of ARPA Internet Text Messages\", STD 11, RFC 822, August 1982.",
      "ja": "[RFC822]クロッカー、D.、 \"ARPAインターネットテキストメッセージの形式の規格\"、STD 11、RFC 822、1982年8月。"
    },
    {
      "indent": 3,
      "text": "[SMTP] Postel, J., \"Simple Mail Transfer Protocol\", STD 10, RFC 821, August 1982.",
      "ja": "[SMTP]ポステル、J.、 \"簡易メール転送プロトコル\"、STD 10、RFC 821、1982年8月。"
    },
    {
      "indent": 3,
      "text": "[SMTPDUP] Partridge, C., \"Duplicate Messages and SMTP\", RFC 1047, February 1988.",
      "ja": "[SMTPDUP]ウズラ、C.、 \"重複メッセージとSMTP\"、RFC 1047、1988年2月。"
    },
    {
      "indent": 3,
      "text": "[STATUS] Vaudreuil, G., \"Enhanced Mail System Status Codes\", RFC 3463, January 2003.",
      "ja": "[STATUS]ヴォードルイユ、G.、 \"強化されたメールシステムステータスコード\"、RFC 3463、2003年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgments",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank the following people for their reviews of early drafts of RFC 1894, of which this document is a revision, and their suggestions for improvement: Eric Allman, Harald Alvestrand, Allan Cargille, Jim Conklin, Peter Cowen, Dave Crocker, Roger Fajman, Ned Freed, Marko Kaittola, Steve Kille, John Klensin, John Gardiner Myers, Mark Nahabedian, Julian Onions, Jacob Palme, Jean Charles Roy, and Gregory Sheehan.",
      "ja": "著者は、この文書が改訂され、改善のための彼らの提案そのうち、RFC 1894の初期の草稿の彼らのレビューのために、以下の人々に感謝したい：エリック・オールマン、ハラルドAlvestrand、アラン・カーギル、ジム・コンクリン、ピーター・コーウェン、デイブ・クロッカー、ロジャーFajman、ネッドフリード、マルコKaittola、スティーブKille、ジョン・クレンシン、ジョン・ガーディナーマイヤーズ、マーク・Nahabedian、ジュリアン玉ねぎ、ヤコブパルメ、ジャン・シャルル・ロイ、およびグレゴリーシーハン。"
    },
    {
      "indent": 0,
      "text": "Appendix A - collected grammar",
      "ja": "付録A  - 収集文法"
    },
    {
      "indent": 3,
      "text": "NOTE: The following lexical tokens are defined in RFC 822: atom, CHAR, comment, CR, CRLF, DIGIT, LF, linear-white-space, SPACE, text. The date-time lexical token is defined in [HOSTREQ].",
      "ja": "注：原子、CHAR、コメント、CR、CRLF、DIGIT、LF、リニアホワイトスペース、SPACE、テキスト：以下の字句は、RFC 822で定義されています。日時字句トークンは[HOSTREQ]で定義されています。"
    },
    {
      "indent": 6,
      "text": "action-field = \"Action\" \":\" action-value",
      "ja": "アクション・フィールド=「アクション」「：」アクション値"
    },
    {
      "indent": 6,
      "text": "action-value = \"failed\" / \"delayed\" / \"delivered\" / \"relayed\" / \"expanded\"",
      "ja": "アクション値は=「失敗」/「遅れ」/「配信」/「は中継されたが、」/「拡大」"
    },
    {
      "indent": 6,
      "text": "address-type = atom",
      "ja": "アドレス型=原子"
    },
    {
      "indent": 6,
      "text": "arrival-date-field = \"Arrival-Date\" \":\" date-time",
      "ja": "到着日・フィールド=「到着-日」「：」日時"
    },
    {
      "indent": 6,
      "text": "delivery-status-content = per-message-fields 1*( CRLF per-recipient-fields )",
      "ja": "配送状況内容=メッセージごとのフィールド1 *（CRLFごとの受信者フィールド）"
    },
    {
      "indent": 6,
      "text": "diagnostic-code-field = \"Diagnostic-Code\" \":\" diagnostic-type \";\" *text",
      "ja": "診断コードフィールド=「診断・コード」「：」診断型「;」 *テキスト"
    },
    {
      "indent": 6,
      "text": "diagnostic-type = atom",
      "ja": "診断型=原子"
    },
    {
      "indent": 6,
      "text": "dsn-gateway-field = \"DSN-Gateway\" \":\" mta-name-type \";\" mta-name",
      "ja": "DSN-ゲートウェイフィールド= \"DSNゲートウェイ\" \"：\" MTA名型 \";\" MTA名"
    },
    {
      "indent": 6,
      "text": "envelope-id = *text",
      "ja": "封筒-ID = *テキスト"
    },
    {
      "indent": 6,
      "text": "extension-field = extension-field-name \":\" *text",
      "ja": "拡張フィールド=拡張フィールド名「：」*テキスト"
    },
    {
      "indent": 6,
      "text": "extension-field-name = atom",
      "ja": "拡張フィールド名=原子"
    },
    {
      "indent": 6,
      "text": "final-recipient-field = \"Final-Recipient\" \":\" address-type \";\" generic-address",
      "ja": "最終受信者フィールド=「最終受信者」「：」アドレス型「;」一般的なアドレス"
    },
    {
      "indent": 6,
      "text": "final-log-id-field = \"Final-Log-ID\" \":\" *text",
      "ja": "最終ログインID・フィールド= \"ファイナル-LOG-ID\" \"：\" *テキスト"
    },
    {
      "indent": 6,
      "text": "generic-address = *text",
      "ja": "一般的なアドレス= *テキスト"
    },
    {
      "indent": 6,
      "text": "last-attempt-date-field = \"Last-Attempt-Date\" \":\" date-time",
      "ja": "最後の試み - 日付フィールド=「最終試行 - 日」「：」日時"
    },
    {
      "indent": 6,
      "text": "mta-name = *text",
      "ja": "MTA名= *テキスト"
    },
    {
      "indent": 6,
      "text": "mta-name-type = atom",
      "ja": "MTA名型=原子"
    },
    {
      "indent": 6,
      "text": "original-envelope-id-field = \"Original-Envelope-Id\" \":\" envelope-id",
      "ja": "オリジナルのエンベロープ-IDフィールド= \"オリジナル・封筒-ID\" \"：\" エンベロープ-ID"
    },
    {
      "indent": 6,
      "text": "original-recipient-field = \"Original-Recipient\" \":\" address-type \";\" generic-address",
      "ja": "オリジナルの受信者フィールド=「オリジナル・受信者」「：」アドレス型「;」一般的なアドレス"
    },
    {
      "indent": 6,
      "text": "per-message-fields = [ original-envelope-id-field CRLF ] reporting-mta-field CRLF [ dsn-gateway-field CRLF ] [ received-from-mta-field CRLF ] [ arrival-date-field CRLF ] *( extension-field CRLF )",
      "ja": "メッセージごとのフィールド= [元のエンベロープ-IDフィールドCRLF]報告-MTA-フィールドCRLF [DSN-ゲートウェイフィールドCRLF] [受信から-MTA-フィールドCRLF] [到着日付フィールドCRLF]（*拡張フィールドCRLF）"
    },
    {
      "indent": 6,
      "text": "per-recipient-fields = [ original-recipient-field CRLF ] final-recipient-field CRLF action-field CRLF status-field CRLF [ remote-mta-field CRLF ] [ diagnostic-code-field CRLF ] [ last-attempt-date-field CRLF ] [ final-log-id-field CRLF ] [ will-retry-until-field CRLF ] *( extension-field CRLF )",
      "ja": "受信者ごとのフィールド= [元の受信者フィールドCRLF]最終受信者フィールドCRLFアクションフィールドCRLFステータスフィールドCRLF [リモートMTAフィールドCRLF] [診断コードフィールドCRLF] [最後の試み日付-field CRLF] [最終ログIDフィールドCRLF] [意志-リトライまでフィールドCRLF] *（拡張フィールドCRLF）"
    },
    {
      "indent": 6,
      "text": "received-from-mta-field = \"Received-From-MTA\" \":\" mta-name-type \";\" mta-name",
      "ja": "受信-から-MTA-フィールド= \"受信-から-MTA\" \"：\" MTA名型 \";\" MTA名"
    },
    {
      "indent": 6,
      "text": "remote-mta-field = \"Remote-MTA\" \":\" mta-name-type \";\" mta-name",
      "ja": "リモートMTAフィールド=「リモートMTA」「：」MTA名型「;」 MTA名"
    },
    {
      "indent": 6,
      "text": "reporting-mta-field = \"Reporting-MTA\" \":\" mta-name-type \";\" mta-name",
      "ja": "報告-MTA-フィールド= \" \"-MTAの報告\"：\" MTA名型 \";\" MTA名"
    },
    {
      "indent": 6,
      "text": "status-code = DIGIT \".\" 1*3DIGIT \".\" 1*3DIGIT",
      "ja": "ステータスコード= DIGIT「」 1 * 3DIGIT \"\" 1 * 3DIGIT"
    },
    {
      "indent": 8,
      "text": "; White-space characters and comments are NOT allowed within a ; a status-code, though a comment enclosed in parentheses ; MAY follow the last numeric sub-field of the status-code. ; Each numeric sub-field within the status-code MUST be ; expressed without leading zero digits.",
      "ja": ";ホワイトスペース文字とコメントは内で許可されていません。ステータスコード、括弧で囲まれたコメントけれども。ステータスコードの最後の数字のサブフィールドに従うことができます。 ;ステータス・コード内の各数値のサブフィールドでなければなりません。ゼロディジットを招くことなく表現。"
    },
    {
      "indent": 6,
      "text": "status-field = \"Status\" \":\" status-code",
      "ja": "ステータス・フィールド=「ステータス」「：」ステータスコード"
    },
    {
      "indent": 6,
      "text": "will-retry-until-field = \"Will-Retry-Until\" \":\" date-time",
      "ja": " - 再試行されます-までフィールド=「ウィル・リトライまで」「：」日時"
    },
    {
      "indent": 0,
      "text": "Appendix B - Guidelines for gatewaying DSNs",
      "ja": "付録B  -  DSNをゲートウェイ処理するためのガイドライン"
    },
    {
      "indent": 3,
      "text": "NOTE: This section provides non-binding recommendations for the construction of mail gateways that wish to provide semi-transparent delivery reports between the Internet and another electronic mail system. Specific DSN gateway requirements for a particular pair of mail systems may be defined by other documents.",
      "ja": "注：このセクションでは、インターネットや他の電子メールシステムとの間に半透明の配信レポートを提供したいメールゲートウェイを構築するための非結合勧告を提供します。メールシステムの特定の対について特定DSNゲートウェイ要件は、他の文書によって定義されてもよいです。"
    },
    {
      "indent": 0,
      "text": "Gatewaying from other mail systems to DSNs",
      "ja": "DSNに他のメールシステムからゲートウェイ"
    },
    {
      "indent": 3,
      "text": "A mail gateway may issue a DSN to convey the contents of a \"foreign\" delivery or non-delivery notification over Internet mail. When there are appropriate mappings from the foreign notification elements to DSN fields, the information may be transmitted in those DSN fields. Additional information (such as might be useful in a trouble ticket or needed to tunnel the foreign notification through the Internet) may be defined in extension DSN fields. (Such fields should be given names that identify the foreign mail protocol, e.g., X400-* for X.400 NDN or DN protocol elements)",
      "ja": "メールゲートウェイは、インターネットメール経由「外国」の配信や配信不能通知の内容を伝えるためにDSNを発行することができます。 DSNフィールドへの外部通知素子から適切なマッピングが存在する場合、情報は、それらのDSNフィールドで送信されても​​よいです。追加情報拡張DSNフィールドに定義することができ（などは、トラブルチケットに有用またはトンネルにインターネットを通じて外国通知が必要になる場合があります）。 （このようなフィールドが外部メールプロトコルを識別する名前を与えられるべきである、例えば、X.400 NDNまたはDNプロトコル要素のX400- *）"
    },
    {
      "indent": 3,
      "text": "The gateway must attempt to supply reasonable values for the Reporting-MTA, Final-Recipient, Action, and Status fields. These will normally be obtained by translating the values from the remote delivery or non-delivery notification into their Internet-style equivalents. However, some loss of information is to be expected. For example, the set of status-codes defined for DSNs may not be adequate to fully convey the delivery diagnostic code from the foreign system. The gateway should assign the most precise code which describes the failure condition, falling back on \"generic\" codes such as 2.0.0 (success), 4.0.0 (temporary failure), and 5.0.0 (permanent failure) when necessary. The actual foreign diagnostic code should be retained in the Diagnostic-Code field (with an appropriate diagnostic-type value) for use in trouble tickets or tunneling.",
      "ja": "ゲートウェイは、Reporting-MTA、最終受信者、アクション、およびステータス・フィールドのための合理的な値を提供しようとしなければなりません。これらは通常、彼らのインターネットスタイル同等物にリモート配信や配信不能通知から値を変換することによって得られるであろう。しかし、情報のいくつかの損失が予想されます。たとえば、DSNのために定義されたステータス・コードのセットは、完全に外部システムから配信診断コードを搬送するために十分ではないかもしれません。必要な場合、ゲートウェイは、障害条件を記述する最も正確なコード、例えば2.0.0のような「汎用」符号にフォールバック（成功）、4.0.0（一時的な障害）、および5.0.0（永久故障）を割り当てなければなりません。実際の外来診断コードは、トラブルチケットまたはトンネリングに使用するための（適切な診断型値）診断コードフィールドに保持されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The sender-specified recipient address, and the original envelope-id, if present in the foreign transport envelope, should be preserved in the Original-Recipient and Original-Envelope-ID fields.",
      "ja": "送信者が指定した受信者のアドレス、およびオリジナルの封筒-idは、外国人のトランスポート・エンベロープの中に存在する場合、元の受信者とオリジナル・封筒-IDフィールドに保存されなければなりません。"
    },
    {
      "indent": 3,
      "text": "The gateway should also attempt to preserve the \"final\" recipient addresses and MTA names from the foreign system. Whenever possible, foreign protocol elements should be encoded as meaningful printable ASCII strings.",
      "ja": "また、ゲートウェイは、外部システムからの「最後の」受信者のアドレスとMTA名を保存しようとしなければなりません。可能な限り、外国のプロトコル要素は、意味のある印刷可能なASCII文字列としてエンコードする必要があります。"
    },
    {
      "indent": 3,
      "text": "For DSNs produced from foreign delivery or nondelivery notifications, the name of the gateway MUST appear in the DSN-Gateway field of the DSN.",
      "ja": "外来性送達または不達通知から製造DSNのために、ゲートウェイの名前は、DSNのDSNゲートウェイフィールドに表示されなければなりません。"
    },
    {
      "indent": 0,
      "text": "Gatewaying from DSNs to other mail systems",
      "ja": "他のメールシステムへのDSNからゲートウェイ"
    },
    {
      "indent": 3,
      "text": "It may be possible to gateway DSNs from the Internet into a foreign mail system. The primary purpose of such gatewaying is to convey delivery status information in a form that is usable by the destination system. A secondary purpose is to allow \"tunneling\" of DSNs through foreign mail systems, in case the DSN may be gatewayed back into the Internet.",
      "ja": "外部メールシステムへのインターネットからのDSNをゲートウェイすることも可能です。そのようなゲートウェイの主な目的は、宛先システムによって使用可能な形式で配信ステータス情報を伝達することです。第2の目的は、DSNが戻ってインターネットへのゲートウェイされる場合には外国メールシステムを通してのDSNの「トンネリング」を、できるようにすることです。"
    },
    {
      "indent": 3,
      "text": "In general, the recipient of the DSN (i.e., the sender of the original message) will want to know, for each recipient: the closest available approximation to the original recipient address, the delivery status (success, failure, or temporary failure), and for failed deliveries, a diagnostic code that describes the reason for the failure.",
      "ja": "一般的には、DSN（すなわち、元のメッセージの送信者）の受信者は、受信者ごとに、知りたいでしょう：元の受信者のアドレス、配信ステータス（成功、失敗、または一時的な障害）に最も近い可能な近似を、そして失敗した配達のために、診断コードは、失敗の理由を説明しています。"
    },
    {
      "indent": 3,
      "text": "If possible, the gateway should attempt to preserve the Original-Recipient address and Original-Envelope-ID (if present), in the resulting foreign delivery status report.",
      "ja": "可能な場合、ゲートウェイは、得られた外国の配信状態報告では、元の受信者のアドレスと元のエンベロープ-ID（存在する場合）を維持しようとすべきです。"
    },
    {
      "indent": 3,
      "text": "When reporting delivery failures, if the diagnostic-type sub-field of the Diagnostic-Code field indicates that the original diagnostic code is understood by the destination environment, the information from the Diagnostic-Code field should be used. Failing that, the information in the Status field should be mapped into the closest available diagnostic code used in the destination environment.",
      "ja": "配信の失敗を報告するときに診断コード・フィールドの診断タイプサブフィールドは、元の診断コードが宛先環境によって理解されていることを示す場合、診断コード・フィールドからの情報が使用されるべきです。その失敗、Statusフィールド内の情報は、宛先環境で使用される最も近い利用可能な診断コードにマッピングされなければなりません。"
    },
    {
      "indent": 3,
      "text": "If it is possible to tunnel a DSN through the destination environment, the gateway specification may define a means of preserving the DSN information in the delivery status reports used by that environment.",
      "ja": "それは先環境を介してトンネルにDSNが可能である場合、ゲートウェイ仕様は、その環境で使用される配送状態レポートにDSN情報を保存する手段を定義することができます。"
    },
    {
      "indent": 0,
      "text": "Appendix C - Guidelines for use of DSNs by mailing list exploders",
      "ja": "付録C  - リスト発破を郵送のDSNの使用のためのガイドライン"
    },
    {
      "indent": 3,
      "text": "This section pertains only to the use of DSNs by \"mailing lists\" as defined in [4], section 7.2.7.",
      "ja": "このセクションでは、[4]、セクション7.2.7で定義されるように「メーリングリスト」によってのDSNの使用に関する。"
    },
    {
      "indent": 3,
      "text": "DSNs are designed to be used by mailing list exploders to allow them to detect and automatically delete recipients for whom mail delivery fails repeatedly.",
      "ja": "DSNは、それらを検出し、自動的にメール配信が繰り返し失敗する人のための受信者を削除できるようにするためにメーリングリスト発破によって使用されるように設計されています。"
    },
    {
      "indent": 3,
      "text": "When forwarding a message to list subscribers, the mailing list exploder should always set the envelope return address (e.g., SMTP MAIL FROM address) to point to a special address which is set up to receive non-delivery reports. A \"smart\" mailing list exploder can therefore intercept such non-delivery reports, and if they are in the DSN format, automatically examine them to determine for which recipients a message delivery failed or was delayed.",
      "ja": "加入者をリストにメッセージを転送するとき、メーリングリストエクスプローダは常に配信不能レポートを受信するように設定された特別なアドレスを指すように封筒のリターンアドレス（アドレスFROM例えば、SMTPのMAIL）を設定する必要があります。彼らはDSN形式である場合、「スマート」メーリングリストエクスプローダ従って、このような配信不能レポート傍受、そして、自動的にメッセージ配信が失敗または遅延された受信者を決定するためにそれらを調べることができます。"
    },
    {
      "indent": 3,
      "text": "The Original-Recipient field should be used if available, since it should exactly match the subscriber address known to the list. If the Original-Recipient field is not available, the recipient field may resemble the list subscriber address. Often, however, the list subscriber will have forwarded his mail to a different address, or the address may be subject to some re-writing, so heuristics may be required to successfully match an address from the recipient field. Care is needed in this case to minimize the possibility of false matches.",
      "ja": "利用可能な場合、それは正確リストに知られている加入者の住所と一致している必要がありので、オリジナル・受信者フィールドは、使用すべきです。オリジナル・受信者フィールドが使用できない場合は、受信者フィールドには、リストの加入者アドレスに似ていてもよいです。しかし、多くの場合、リストの加入者が別のアドレスに自分のメールを転送しているか、またはヒューリスティックが正常に受信者フィールドからアドレスを一致させるために必要な場合がありますので、アドレスは、いくつかの再書き込みを受ける可能性があります。ケアは、誤った一致の可能性を最小限に抑えるために、この場合に必要とされます。"
    },
    {
      "indent": 3,
      "text": "The reason for delivery failure can be obtained from the Status and Action fields, and from the Diagnostic-Code field (if the status-type is recognized). Reports for recipients with action values other than \"failed\" can generally be ignored; in particular, subscribers should not be removed from a list due to \"delayed\" reports.",
      "ja": "（ステータスタイプが認識された場合）配信失敗の理由は、ステータスとアクションフィールドから、および診断-Codeフィールドから取得することができます。 「失敗した」以外のアクション値を持つ受信者のためのレポートは、一般的に無視することができます。具体的には、加入者による「遅延」レポートにリストから削除すべきではありません。"
    },
    {
      "indent": 3,
      "text": "In general, almost any failure status code (even a \"permanent\" one) can result from a temporary condition. It is therefore recommended that a list exploder not delete a subscriber based on any single failure DSN (regardless of the status code), but only on the persistence of delivery failure over a period of time.",
      "ja": "一般的には、ほぼすべてのエラー状態コード（でも「永久」1）は、一時的な状態に起因することができます。したがってだけ時間にわたって配信障害の持続性に、リスト発破は、任意の単一故障（かかわらず、ステータスコードの）DSNに基づいて加入者を削除しないことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "However, some kinds of failures are less likely than others to have been caused by temporary conditions, and some kinds of failures are more likely to be noticed and corrected quickly than others. Once more precise status codes are defined, it may be useful to differentiate between the status codes when deciding whether to delete a subscriber. For example, on a list with a high message volume, it might be desirable to temporarily suspend delivery to a recipient address which causes repeated \"temporary\" failures, rather than simply deleting the recipient. The duration of the suspension might depend on the type of error. On the other hand, a \"user unknown\" error that persisted for several days could be considered a reliable indication that address were no longer valid.",
      "ja": "しかし、障害のいくつかの種類が一時的な条件によって引き起こされたことが他の人よりも少ない可能性があり、そして障害のいくつかの種類がすぐに他よりも気づいて修正される可能性が高いです。より正確なステータスコードが定義されたら、加入者を削除するかどうかを決定する際のステータスコードを区別するのに有用であり得ます。例えば、高いメッセージのボリュームを持つリストに、一時的に繰り返し、「一時的」の失敗ではなく、単に受信者の削除の原因となる受信者のアドレスへの配信を一時停止することが望ましいかもしれません。停止期間は、エラーの種類に依存する場合があります。一方、数日間持続し、「ユーザー不明」エラーは、アドレスがもはや有効であったことを確実に示すと考えられます。"
    },
    {
      "indent": 0,
      "text": "Appendix D - IANA registration forms for DSN types",
      "ja": "付録D  -  DSNタイプのIANA登録フォーム"
    },
    {
      "indent": 3,
      "text": "The forms below are for use when registering a new address-type, diagnostic-type, or MTA-name-type with the Internet Assigned Numbers Authority (IANA). Each piece of information requested by a registration form may be satisfied either by providing the information on the form itself, or by including a reference to a published, publicly available specification which includes the necessary information. IANA MAY reject DSN type registrations because of incomplete registration forms, imprecise specifications, or inappropriate type names.",
      "ja": "IANA（Internet Assigned Numbers Authority）によって新しいアドレスタイプ、診断タイプ、またはMTA名型を登録する場合は、以下のフォームを使用するためのものです。登録フォームによって要求された各情報は、フォーム自体に情報を提供することにより、または必要な情報を含む公開され、公的に利用可能な仕様への参照を含むいずれかによって満たされてもよいです。 IANAは、不完全な登録フォーム、不正確な仕様、または不適切なタイプ名のDSNタイプの登録を拒否することがあります。"
    },
    {
      "indent": 3,
      "text": "To register a DSN type, complete the applicable form below and send it via Internet electronic mail to <IANA@IANA.ORG>.",
      "ja": "DSNの種類を登録するには、以下の該当するフォームに記入し、<IANA@IANA.ORG>に、インターネット、電子メール経由で送信します。"
    },
    {
      "indent": 0,
      "text": "IANA registration form for address-type",
      "ja": "アドレスタイプのIANA登録フォーム"
    },
    {
      "indent": 3,
      "text": "A registration for a DSN address-type MUST include the following information:",
      "ja": "DSNアドレス型の登録は、以下の情報を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "(a) The proposed address-type name.",
      "ja": "（a）は、提案されたアドレス・タイプ名。"
    },
    {
      "indent": 3,
      "text": "(b) The syntax for mailbox addresses of this type, specified using BNF, regular expressions, ASN.1, or other non-ambiguous language.",
      "ja": "（b）は、この種のメールボックスアドレスの構文は、BNF、正規表現、ASN.1、または他の非あいまいな言語を使用して、指定されました。"
    },
    {
      "indent": 3,
      "text": "(c) If addresses of this type are not composed entirely of graphic characters from the US-ASCII repertoire, a specification for how they are to be encoded as graphic US-ASCII characters in a DSN Original-Recipient or Final-Recipient DSN field.",
      "ja": "（c）は、このタイプのアドレスは完全にUS-ASCIIレパートリーから図形文字の構成されていない場合、彼らはどのようにするための仕様は、DSNオリジナル・受信者または最終受信者のDSNフィールドのグラフィックUS-ASCII文字としてコード化されます。"
    },
    {
      "indent": 3,
      "text": "(d) [optional] A specification for how addresses of this type are to be translated to and from Internet electronic mail addresses.",
      "ja": "（D）[オプション]このタイプのアドレスは、インターネット電子メールアドレスへとから翻訳される方法の仕様。"
    },
    {
      "indent": 0,
      "text": "IANA registration form for diagnostic-type",
      "ja": "診断型のためのIANA登録フォーム"
    },
    {
      "indent": 3,
      "text": "A registration for a DSN address-type MUST include the following information:",
      "ja": "DSNアドレス型の登録は、以下の情報を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "(a) The proposed diagnostic-type name.",
      "ja": "（a）は、提案された診断型名。"
    },
    {
      "indent": 3,
      "text": "(b) A description of the syntax to be used for expressing diagnostic codes of this type as graphic characters from the US-ASCII repertoire.",
      "ja": "（b）は、構文の説明は、US-ASCIIレパートリーから図形文字としてのこのタイプの診断コードを発現させるために使用されます。"
    },
    {
      "indent": 3,
      "text": "(c) A list of valid diagnostic codes of this type and the meaning of each code.",
      "ja": "（c）は、このタイプと各コードの意味の有効な診断コードのリスト。"
    },
    {
      "indent": 3,
      "text": "(d) [optional] A specification for mapping from diagnostic codes of this type to DSN status codes (as defined in [5]).",
      "ja": "（D）[オプション] DSNステータスコードに、このタイプの診断コードからマッピングするための仕様（[5]で定義されるように）。"
    },
    {
      "indent": 0,
      "text": "IANA registration form for MTA-name-type",
      "ja": "MTA名型のIANA登録フォーム"
    },
    {
      "indent": 3,
      "text": "A registration for a DSN MTA-name-type must include the following information:",
      "ja": "DSN MTA名型の登録は、以下の情報を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "(a) The proposed MTA-name-type name.",
      "ja": "（a）は、提案されたMTA名型名。"
    },
    {
      "indent": 3,
      "text": "(b) A description of the syntax of MTA names of this type, using BNF, regular expressions, ASN.1, or other non-ambiguous language.",
      "ja": "（b）は、このタイプのMTA名の構文の説明を、BNF、正規表現、ASN.1、または他の非あいまいな言語を使用して。"
    },
    {
      "indent": 3,
      "text": "(c) If MTA names of this type do not consist entirely of graphic characters from the US-ASCII repertoire, a specification for how an MTA name of this type should be expressed as a sequence of graphic US-ASCII characters.",
      "ja": "（c）は、このタイプのMTA名がUS-ASCIIレパートリーからグラフィック文字で完全に構成されていない場合は、このタイプのMTA名は、グラフィックUS-ASCII文字のシーケンスとして表現する方法の仕様を。"
    },
    {
      "indent": 0,
      "text": "Appendix E - Examples",
      "ja": "付録E  - 例"
    },
    {
      "indent": 3,
      "text": "These examples are provided as illustration only, and are not considered part of the DSN protocol specification. If an example conflicts with the protocol definition above, the example is wrong.",
      "ja": "これらの実施例は、単に例示として提供され、そしてDSNプロトコル仕様の一部とみなされません。上記の例は、プロトコルの定義と矛盾する場合は、例が間違っています。"
    },
    {
      "indent": 3,
      "text": "Likewise, the use of *-type sub-field names or extension fields in these examples is not to be construed as a definition for those type names or extension fields.",
      "ja": "同様に、これらの例で*型のサブフィールド名または拡張フィールドの使用は、これらのタイプ名または拡張フィールドの定義として解釈されるべきではありません。"
    },
    {
      "indent": 3,
      "text": "These examples were manually translated from bounced messages using whatever information was available.",
      "ja": "これらの例は、手動で利用可能だったものは何でも情報使用してバウンスメッセージから翻訳されました。"
    },
    {
      "indent": 0,
      "text": "Simple DSN",
      "ja": "シンプルDSN"
    },
    {
      "indent": 3,
      "text": "This is a simple DSN issued after repeated attempts to deliver a message failed. In this case, the DSN is issued by the same MTA from which the message was originated.",
      "ja": "これは、失敗したメッセージを配信するために繰り返し試行後に発行されたシンプルなDSNです。この場合、DSNは、メッセージが発信された同じMTAによって発行されます。"
    },
    {
      "indent": 3,
      "text": "Date: Thu, 7 Jul 1994 17:16:05 -0400 From: Mail Delivery Subsystem <MAILER-DAEMON@CS.UTK.EDU> Message-Id: <199407072116.RAA14128@CS.UTK.EDU> Subject: Returned mail: Cannot send message for 5 days To: <owner-info-mime@cs.utk.edu> MIME-Version: 1.0 Content-Type: multipart/report; report-type=delivery-status; boundary=\"RAA14128.773615765/CS.UTK.EDU\"",
      "ja": "日付：木、1994年7月7日から夜05時16分05秒-0400：メール配信サブシステム<MAILER-DAEMON@CS.UTK.EDU>メッセージ-ID：<199407072116.RAA14128@CS.UTK.EDU>件名：返されたメール： <owner-info-mime@cs.utk.edu> MIME-バージョン：5日間のメッセージを送信できません1.0のContent-Type：マルチパート/レポートを。レポートタイプ=配送状況。境界= \"RAA14128.773615765 / CS.UTK.EDU\""
    },
    {
      "indent": 3,
      "text": "--RAA14128.773615765/CS.UTK.EDU",
      "ja": "--RAA14128.773615765 / CS.UTK.EDU"
    },
    {
      "indent": 3,
      "text": "The original message was received at Sat, 2 Jul 1994 17:10:28 -0400 from root@localhost",
      "ja": "元のメッセージは、ルート@ localhostのから土、1994年7月2日17時10分28秒-0400で受信されました"
    },
    {
      "indent": 3,
      "text": "    ----- The following addresses had delivery problems -----\n<louisl@larry.slip.umd.edu>  (unrecoverable error)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "----- Transcript of session follows -----\n<louisl@larry.slip.umd.edu>... Deferred: Connection timed out\n            with larry.slip.umd.edu.\nMessage could not be delivered for 5 days\nMessage will be deleted from queue",
      "raw": true
    },
    {
      "indent": 3,
      "text": "--RAA14128.773615765/CS.UTK.EDU content-type: message/delivery-status",
      "ja": "--RAA14128.773615765 / CS.UTK.EDUコンテンツタイプ：メッセージ/配送状況"
    },
    {
      "indent": 3,
      "text": "Reporting-MTA: dns; cs.utk.edu",
      "ja": "報告-MTA：DNSを。 cs.utk.edu"
    },
    {
      "indent": 3,
      "text": "Original-Recipient: rfc822;louisl@larry.slip.umd.edu Final-Recipient: rfc822;louisl@larry.slip.umd.edu Action: failed Status: 4.0.0 Diagnostic-Code: smtp; 426 connection timed out Last-Attempt-Date: Thu, 7 Jul 1994 17:15:49 -0400",
      "ja": "オリジナル・受信者：RFC822; louisl@larry.slip.umd.edu最終受信者：RFC822; louisl@larry.slip.umd.eduの処置：4.0.0診断-コード：ステータス失敗したSMTPを。 -0400 1994年7月17時15分49秒木、7：426接続が最終試行-日をタイムアウトになりました"
    },
    {
      "indent": 3,
      "text": "--RAA14128.773615765/CS.UTK.EDU content-type: message/rfc822",
      "ja": "--RAA14128.773615765 / CS.UTK.EDUコンテンツタイプ：メッセージ/ RFC822"
    },
    {
      "indent": 3,
      "text": "[original message goes here]",
      "ja": "[元のメッセージがここに入り]"
    },
    {
      "indent": 3,
      "text": "--RAA14128.773615765/CS.UTK.EDU--",
      "ja": "--RAA14128.773615765 / CS.UTK.EDU--"
    },
    {
      "indent": 0,
      "text": "Multi-Recipient DSN",
      "ja": "マルチ受信者のDSN"
    },
    {
      "indent": 3,
      "text": "This is another DSN issued by the sender's MTA, which contains details of multiple delivery attempts. Some of these were detected locally, and others by a remote MTA.",
      "ja": "これは、複数の配信試行の詳細が含まれ、送信者のMTAによって発行された別のDSN、です。これらのいくつかは、局所的に検出され、リモートMTAによって他人ました。"
    },
    {
      "indent": 3,
      "text": "Date: Fri, 8 Jul 1994 09:21:47 -0400 From: Mail Delivery Subsystem <MAILER-DAEMON@CS.UTK.EDU> Subject: Returned mail: User unknown To: <owner-ups-mib@CS.UTK.EDU> MIME-Version: 1.0 Content-Type: multipart/report; report-type=delivery-status; boundary=\"JAA13167.773673707/CS.UTK.EDU\"",
      "ja": "日付：金、1994年7月8日9時21分47秒-0400から：メール配信サブシステム<MAILER-DAEMON@CS.UTK.EDU>件名：返されたメール：にとって未知のユーザー：<owner-ups-mib@CS.UTK。 EDU> MIME-バージョン：1.0のContent-Type：マルチパート/レポート。レポートタイプ=配送状況。境界= \"JAA13167.773673707 / CS.UTK.EDU\""
    },
    {
      "indent": 3,
      "text": "--JAA13167.773673707/CS.UTK.EDU content-type: text/plain; charset=us-ascii",
      "ja": "--JAA13167.773673707 / CS.UTK.EDUコンテンツタイプ：テキスト/平野。文字セット= US-ASCII"
    },
    {
      "indent": 3,
      "text": "       ----- The following addresses had delivery problems -----\n<arathib@vnet.ibm.com> (unrecoverable error)\n<wsnell@sdcc13.ucsd.edu> (unrecoverable error)",
      "raw": true
    },
    {
      "indent": 3,
      "text": " --JAA13167.773673707/CS.UTK.EDU content-type: message/delivery-status",
      "ja": "--JAA13167.773673707 / CS.UTK.EDUコンテンツタイプ：メッセージ/配送状況"
    },
    {
      "indent": 3,
      "text": "Reporting-MTA: dns; cs.utk.edu",
      "ja": "報告-MTA：DNSを。 cs.utk.edu"
    },
    {
      "indent": 3,
      "text": "Original-Recipient: rfc822;arathib@vnet.ibm.com Final-Recipient: rfc822;arathib@vnet.ibm.com Action: failed Status: 5.0.0 (permanent failure) Diagnostic-Code: smtp; 550 'arathib@vnet.IBM.COM' is not a registered gateway user Remote-MTA: dns; vnet.ibm.com",
      "ja": "オリジナル・受信者：RFC822; arathib@vnet.ibm.com最終受信者：RFC822; arathib@vnet.ibm.comの処置：5.0.0（永久故障）診断-コード：ステータス失敗したSMTPを。 550「arathib@vnet.IBM.COM」でない登録ゲートウェイユーザーリモートMTA：DNS。 vnet.ibm.com"
    },
    {
      "indent": 3,
      "text": "Original-Recipient: rfc822;johnh@hpnjld.njd.hp.com Final-Recipient: rfc822;johnh@hpnjld.njd.hp.com Action: delayed Status: 4.0.0 (hpnjld.njd.jp.com: host name lookup failure)",
      "ja": "オリジナル・受信者：RFC822; johnh@hpnjld.njd.hp.com最終受信者：RFC822; johnh@hpnjld.njd.hp.comアクション：遅れステータス：4.0.0（hpnjld.njd.jp.com：ホスト名の検索失敗）"
    },
    {
      "indent": 3,
      "text": "Original-Recipient: rfc822;wsnell@sdcc13.ucsd.edu Final-Recipient: rfc822;wsnell@sdcc13.ucsd.edu Action: failed Status: 5.0.0 Diagnostic-Code: smtp; 550 user unknown Remote-MTA: dns; sdcc13.ucsd.edu",
      "ja": "オリジナル・受信者：RFC822; wsnell@sdcc13.ucsd.edu最終受信者：RFC822; wsnell@sdcc13.ucsd.eduの処置：5.0.0診断-コード：ステータス失敗したSMTPを。 550ユーザー、未知のリモートMTA：DNS; sdcc13.ucsd.edu"
    },
    {
      "indent": 3,
      "text": "--JAA13167.773673707/CS.UTK.EDU content-type: message/rfc822",
      "ja": "--JAA13167.773673707 / CS.UTK.EDUコンテンツタイプ：メッセージ/ RFC822"
    },
    {
      "indent": 4,
      "text": "[original message goes here]",
      "ja": "[元のメッセージがここに入り]"
    },
    {
      "indent": 3,
      "text": "--JAA13167.773673707/CS.UTK.EDU--",
      "ja": "--JAA13167.773673707 / CS.UTK.EDU--"
    },
    {
      "indent": 0,
      "text": "DSN from gateway to foreign system",
      "ja": "外部システムへのゲートウェイからDSN"
    },
    {
      "indent": 3,
      "text": "A delivery report generated by Message Router (MAILBUS) and gatewayed by PMDF_MR to a DSN. In this case the gateway did not have sufficient information to supply an original-recipient address.",
      "ja": "配信レポートメッセージルータ（MAILBUS）によって生成され、DSNにPMDF_MRによってゲートウェイ処理。この場合、ゲートウェイは、元の受信者のアドレスを提供するのに十分な情報を持っていませんでした。"
    },
    {
      "indent": 3,
      "text": "Disclose-recipients: prohibited\nDate: Fri, 08 Jul 1994 09:21:25 -0400 (EDT)\nFrom: Message Router Submission Agent <AMMGR@corp.timeplex.com>\nSubject: Status of: Re: Battery current sense\nTo: owner-ups-mib@CS.UTK.EDU\nMessage-id: <01HEGJ0WNBY28Y95LN@mr.timeplex.com>\nMIME-version: 1.0\ncontent-type: multipart/report;\n    report-type=delivery-status;\n    boundary=\"84229080704991.122306.SYS30\"",
      "raw": true
    },
    {
      "indent": 3,
      "text": "--84229080704991.122306.SYS30 content-type: text/plain",
      "ja": "--84229080704991.122306.SYS30コンテンツタイプ：テキスト/平野"
    },
    {
      "indent": 3,
      "text": "Invalid address - nair_s %DIR-E-NODIRMTCH, No matching Directory Entry Entry found",
      "ja": "無効なアドレス -  nair_s％DIR-E-NODIRMTCH、一致ディレクトリエントリのエントリが見つかりました"
    },
    {
      "indent": 3,
      "text": "--84229080704991.122306.SYS30 content-type: message/delivery-status",
      "ja": "--84229080704991.122306.SYS30コンテンツタイプ：メッセージ/配送状況"
    },
    {
      "indent": 3,
      "text": "Reporting-MTA: mailbus; SYS30",
      "ja": "報告-MTA：mailbusを。 SYS30"
    },
    {
      "indent": 3,
      "text": "Final-Recipient: unknown; nair_s Status: 5.0.0 (unknown permanent failure) Action: failed",
      "ja": "最終受信者：不明。 nair_sステータス：5.0.0（不明永久失敗）アクション：失敗しました"
    },
    {
      "indent": 3,
      "text": "--84229080704991.122306.SYS30--",
      "ja": "--84229080704991.122306.SYS30--"
    },
    {
      "indent": 0,
      "text": "Delayed DSN",
      "ja": "遅延DSN"
    },
    {
      "indent": 3,
      "text": "A delay report from a multiprotocol MTA. Note that there is no returned content, so no third body part appears in the DSN.",
      "ja": "マルチMTAからの遅延レポート。そこには、コンテンツが返されないので、第3の本体部分は、DSNに表示されていないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "MIME-Version: 1.0\nFrom: <postmaster@nsfnet-relay.ac.uk>\nMessage-Id: <199407092338.TAA23293@CS.UTK.EDU>\nReceived: from nsfnet-relay.ac.uk by sun2.nsfnet-relay.ac.uk\n        id <g.12954-0@sun2.nsfnet-relay.ac.uk>;\n        Sun, 10 Jul 1994 00:36:51 +0100\nTo: owner-info-mime@cs.utk.edu\nDate: Sun, 10 Jul 1994 00:36:51 +0100\nSubject: WARNING: message delayed at \"nsfnet-relay.ac.uk\"\ncontent-type: multipart/report; report-type=delivery-status;\n       boundary=foobar",
      "raw": true
    },
    {
      "indent": 3,
      "text": "--foobar content-type: text/plain",
      "ja": "--foobarコンテンツタイプ：テキスト/平野"
    },
    {
      "indent": 3,
      "text": "The following message:",
      "ja": "次のメッセージ："
    },
    {
      "indent": 3,
      "text": "UA-ID: Reliable PC (... Q-ID: sun2.nsf:77/msg.11820-0",
      "ja": "UA-ID：信頼性の高いPC（... Q-ID：sun2.nsf：77 / msg.11820-0"
    },
    {
      "indent": 3,
      "text": "has not been delivered to the intended recipient:",
      "ja": "目的の受信者に配信されていません。"
    },
    {
      "indent": 7,
      "text": "thomas@de-montfort.ac.uk",
      "ja": "てょまｓ＠でーもんｔふぉｒｔ。あｃ。うｋ"
    },
    {
      "indent": 3,
      "text": "despite repeated delivery attempts over the past 24 hours.",
      "ja": "過去24時間繰り返し配信の試みにもかかわらず。"
    },
    {
      "indent": 3,
      "text": "The usual cause of this problem is that the remote system is temporarily unavailable.",
      "ja": "この問題の一般的な原因は、リモートシステムが一時的に利用できないということです。"
    },
    {
      "indent": 3,
      "text": "Delivery will continue to be attempted up to a total elapsed time of 168 hours, i.e., 7 days.",
      "ja": "納期は7日、すなわち、168時間の総経過時間までに試みられていきます。"
    },
    {
      "indent": 3,
      "text": "You will be informed if delivery proves to be impossible within this time.",
      "ja": "配信は、この時間内では不可能であることが判明している場合は、通知されます。"
    },
    {
      "indent": 3,
      "text": "Please quote the Q-ID in any queries regarding this mail.",
      "ja": "このメールに関するすべてのクエリにQ-IDをお伝えください。"
    },
    {
      "indent": 3,
      "text": "--foobar content-type: message/delivery-status",
      "ja": "--foobarコンテンツタイプ：メッセージ/配送状況"
    },
    {
      "indent": 3,
      "text": "Reporting-MTA: dns; sun2.nsfnet-relay.ac.uk",
      "ja": "報告-MTA：DNSを。 sun2.nsfnet-relay.ac.uk"
    },
    {
      "indent": 3,
      "text": "Final-Recipient: rfc822;thomas@de-montfort.ac.uk",
      "ja": "最終受信者：RFC822; thomas@de-montfort.ac.uk"
    },
    {
      "indent": 3,
      "text": "Status: 4.0.0 (unknown temporary failure) Action: delayed",
      "ja": "ステータス：4.0.0（不明な一時的な障害）対策：遅れ"
    },
    {
      "indent": 3,
      "text": "--foobar--",
      "ja": "--foobar--"
    },
    {
      "indent": 0,
      "text": "Appendix F - Changes from RFC 1894",
      "ja": "付録F  -  RFC 1894からの変更点"
    },
    {
      "indent": 3,
      "text": "Changed Authors contact information",
      "ja": "変更された著者は、連絡先情報"
    },
    {
      "indent": 3,
      "text": "Updated required standards boilerplate",
      "ja": "更新に必要な基準定型"
    },
    {
      "indent": 3,
      "text": "Edited the text to make it spell-checker and grammar checker compliant",
      "ja": "それはスペルチェッカーおよび文法チェッカーを準拠させるために、テキストを編集しました"
    },
    {
      "indent": 3,
      "text": "Updated references to point to later, more mature documents, changed reference enumeration scheme.",
      "ja": "後に、より成熟した文書を指すように参照を更新、参照列挙スキームを変更しました。"
    },
    {
      "indent": 3,
      "text": "Fixed paragraph numbering on page 20",
      "ja": "ページ20に固定された段落番号"
    },
    {
      "indent": 3,
      "text": "Fixed Delayed DSN example",
      "ja": "固定遅延DSNの例"
    },
    {
      "indent": 3,
      "text": "Added Table of Contents",
      "ja": "目次を追加"
    },
    {
      "indent": 3,
      "text": "Moved Appendices to the end of the document",
      "ja": "文書の最後に移動付録"
    },
    {
      "indent": 3,
      "text": "Changed the MTA-name-Type for gateways into Internet mail, the MTA-name-type from \"SMTP\" to \"dns\".",
      "ja": "インターネットメールへのゲートウェイのためのMTA名・タイプを変更し、「SMTP」と「DNS」からMTA名型。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Keith Moore University of Tennessee 1122 Volunteer Blvd, Suite 203 Knoxville TN 37996-3450 USA",
      "ja": "テネシー1122年のキース・ムーア大学ボランティアブルバード、スイート203ノックスビルTN 37996から3450 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1-865-974-3126 Fax: +1-865-974-8296 EMail: moore@cs.utk.edu",
      "ja": "電話：+ 1-865-974-3126ファックス：+ 1-865-974-8296 Eメール：moore@cs.utk.edu"
    },
    {
      "indent": 3,
      "text": "Gregory M. Vaudreuil Lucent Technologies 7291 Williamson Rd Dallas, Tx. 75214 USA",
      "ja": "グレゴリーM.ヴォードルイユルーセント・テクノロジーズ7291のウィリアムソンRdのダラス、テキサス州。 75214 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 214 823 9325 EMail: GregV@ieee.org",
      "ja": "電話：+1 214 823 9325 Eメール：GregV@ieee.org"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}