{
  "title": {
    "text": "RFC 3638 - Applicability Statement for Reclassification of RFC 1643 to Historic Status",
    "ja": "RFC 3638 - RFC 1643の歴史的地位への再分類のための適用性声明"
  },
  "number": 3638,
  "created_at": "2023-10-12 13:17:40.567070+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           J. Flick\nRequest for Comments: 3638                       Hewlett-Packard Company\nObsoletes: 1643                                                 C. Heard\nCategory: Informational                                       Consultant\n                                                          September 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Applicability Statement for Reclassification of RFC 1643 to Historic Status",
      "ja": "RFC 1643の歴史的地位への再分類のための適用性声明"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo recommends that RFC 1643 be reclassified as an Historic document and provides the supporting motivation for that recommendation.",
      "ja": "このメモは、RFC 1643を歴史的な文書として再分類することを推奨し、その推奨のサポート動機を提供することを推奨しています。"
    },
    {
      "indent": 0,
      "text": "1. Details",
      "section_title": true,
      "ja": "1. 詳細"
    },
    {
      "indent": 3,
      "text": "STD 50, RFC 1643 [RFC1643], \"Definitions of Managed Objects for the Ethernet-like Interface Types\", and its SMIv2 equivalent, RFC 1650 [RFC1650], are applicable to half-duplex 10 Mb/s Ethernet interfaces only. Subsequent to the 1994 publication of these documents, 100 Mb/s, 1000 Mb/s, and 10 Gb/s Ethernet interface types have been developed, and full-duplex operation at 10 Mb/s has been standardized. Updates to RFC 1650 have been produced to accommodate these new technologies [RFC2358] [RFC2665] [RFC2666] [RFC3635]. These updates define new MIB objects to supplement those defined in RFC 1643 and RFC 1650 and in addition deprecate some of the objects in RFC 1643 and RFC 1650 that are no longer considered useful. They also levy a requirement for implementations of the EtherLike-MIB to support the MAU-MIB [RFC2239] [RFC2668] [RFC3636] as well.",
      "ja": "STD 50、RFC 1643 [RFC1643]、「イーサネットのようなインターフェイスタイプの管理オブジェクトの定義」、およびそのSMIV2等価RFC 1650 [RFC1650]は、半分重ね10 mb/sイーサネットインターフェイスのみに適用されます。これらの文書の1994年の公開に続いて、100 MB/s、1000 MB/s、および10 Gb/sのイーサネットインターフェイスタイプが開発され、10 MB/sでの全二重操作が標準化されています。RFC 1650の更新は、これらの新しい技術に対応するために作成されました[RFC2358] [RFC2665] [RFC2666] [RFC3635]。これらの更新は、RFC 1643およびRFC 1650で定義されたものを補足する新しいMIBオブジェクトを定義し、さらに有用でないと考えられていないRFC 1643およびRFC 1650のオブジェクトの一部を非難します。また、MAU-MIB [RFC2239] [RFC2668] [RFC3636]をサポートするために、エーテルのようなMIBの実装の要件を徴収します。"
    },
    {
      "indent": 3,
      "text": "RFC 1643 is an obsolete specification, overtaken by events. Its SMIv2 equivalent, RFC 1650, was officially retired in 1998. New implementations -- even those that support only half-duplex 10 Mb/s interfaces -- should comply with in the latest version of the specification, currently RFC 3635 [RFC3635] and RFC 2666 [RFC2666], instead of RFC 1643. It is therefore recommended that RFC 1643 be reclassified as an Historic document.",
      "ja": "RFC 1643は時代遅れの仕様であり、イベントが追い抜かれています。そのSMIV2等価RFC 1650は、1998年に正式に退職しました。新しい実装 - ハーフデュプレックス10 MB/Sインターフェイスのみをサポートするものでさえ、現在RFC 3635 [RFC3635]および現在の仕様の最新バージョンで準拠する必要があります。RFC 2666 [RFC2666]、RFC 1643ではなく、RFC 1643を歴史的文書として再分類することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "2. Effect on Other Standards Track Documents",
      "section_title": true,
      "ja": "2. 他の標準への効果はドキュメントを追跡します"
    },
    {
      "indent": 3,
      "text": "Reclassification of RFC 1643 will have no impact on the status of any standards track RFC because no standards track RFC cites it as a normative reference. An RFC content search made with the tools available at http://www.rfc-editor.org reveals the following standards track documents that cite RFC 1643:",
      "ja": "RFC 1643の再分類は、RFCを規範的な参照として引用する標準トラックがないため、RFCを追跡する標準トラックのステータスに影響を与えません。http://www.rfc-editor.orgで利用可能なツールで作成されたRFCコンテンツ検索は、RFC 1643を引用する次の標準トラックドキュメントを明らかにします。"
    },
    {
      "indent": 6,
      "text": "Document               Title\n--------               -----",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "RFC 2020 IEEE 802.12 Interface MIB",
      "ja": "RFC 2020 IEEE 802.12インターフェイスMIB"
    },
    {
      "indent": 6,
      "text": "RFC 2358 Definitions of Managed Objects for the Ethernet-like Interface Types",
      "ja": "RFC 2358イーサネットのようなインターフェイスタイプの管理されたオブジェクトの定義"
    },
    {
      "indent": 6,
      "text": "RFC 2665 Definitions of Managed Objects for the Ethernet-like Interface Types",
      "ja": "RFC 2665イーサネットのようなインターフェイスタイプの管理されたオブジェクトの定義"
    },
    {
      "indent": 6,
      "text": "RFC 2720 Traffic Flow Measurement: Meter MIB",
      "ja": "RFC 2720トラフィックフロー測定：メーターMIB"
    },
    {
      "indent": 6,
      "text": "RFC 3635 Definitions of Managed Objects for the Ethernet-like Interface Types",
      "ja": "RFC 3635イーサネットのようなインターフェイスタイプの管理されたオブジェクトの定義"
    },
    {
      "indent": 3,
      "text": "RFC 2020 [RFC2020] contains DOT12-IF-MIB, which is the MIB module for managing IEEE 802.12 100VG-AnyLAN interfaces. It refers to RFC 1643 in the context of an admonition not to implement the EtherLike-MIB for any interface where the DOT12-IF-MIB is implemented.",
      "ja": "RFC 2020 [RFC2020]には、IEEE 802.12 100VG-Anylanインターフェイスを管理するためのMIBモジュールであるDOT12-IF-MIBが含まれています。これは、dot12-if-mibが実装されているインターフェイスにエーテルのようなmibを実装しないように忠告の文脈でRFC 1643を指します。"
    },
    {
      "indent": 3,
      "text": "RFC 2358 [RFC2358], RFC 2665 [RFC2665], and RFC 3635 [RFC3635] all contain updated versions of the EtherLike-MIB. They refer to RFC 1643 in the context of explaining the history of the EtherLike-MIB, and the citation in RFC 3635 is explicitly listed as a non-normative reference.",
      "ja": "RFC 2358 [RFC2358]、RFC 2665 [RFC2665]、およびRFC 3635 [RFC3635]はすべて、エーテルのようなMIBの更新バージョンが含まれています。彼らは、Etherlike-Mibの歴史を説明するという文脈でRFC 1643を参照し、RFC 3635の引用は非規範的な参照として明示的にリストされています。"
    },
    {
      "indent": 3,
      "text": "RFC 2720 [RFC2720] contains the FLOW-METER-MIB. It refers to RFC 1643 only in an ASN.1 comment in the MIB module. Omission of that comment would not preclude correct implementation of the MIB module.",
      "ja": "RFC 2720 [RFC2720]には、フローメーター-MIBが含まれています。MIBモジュールのASN.1コメントでのみRFC 1643を指します。そのコメントの省略は、MIBモジュールの正しい実装を排除しません。"
    },
    {
      "indent": 3,
      "text": "Clearly, none of these citations are normative.",
      "ja": "明らかに、これらの引用はどれも規範的ではありません。"
    },
    {
      "indent": 0,
      "text": "3. Security Considerations",
      "section_title": true,
      "ja": "3. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Reclassification of RFC 1643 will not, in and of itself, have any effect on the security of the Internet.",
      "ja": "RFC 1643の再分類は、それ自体では、インターネットのセキュリティに影響を与えません。"
    },
    {
      "indent": 0,
      "text": "4. Normative References",
      "section_title": true,
      "ja": "4. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC1643] Kastenholz, F., \"Definitions of Managed Objects for the Ethernet-like Interface Types\", STD 50, RFC 1643, July 1994.",
      "ja": "[RFC1643] Kastenholz、F。、「イーサネットのようなインターフェイスタイプの管理されたオブジェクトの定義」、STD 50、RFC 1643、1994年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC1650] Kastenholz, F., \"Definitions of Managed Objects for the Ethernet-like Interface Types using SMIv2\", RFC 1650, August 1994.",
      "ja": "[RFC1650] Kastenholz、F。、「SMIV2を使用したイーサネット様インターフェイスタイプの管理されたオブジェクトの定義」、RFC 1650、1994年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2020] Flick, J., \"IEEE 802.12 Interface MIB\", RFC 2020, October 1996.",
      "ja": "[RFC2020] Flick、J。、「IEEE 802.12インターフェイスMIB」、RFC 2020、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2239] de Graaf, K., Romascanu, D., McMaster, D., McCloghrie, K. and S. Roberts, \"Definitions of Managed Objects for IEEE 802.3 Medium Attachment Units (MAUs) using SMIv2\", RFC 2239, November 1997.",
      "ja": "[RFC2239] de Graaf、K.、Romascanu、D.、McMaster、D.、McCloghrie、K。and S. Roberts、「SMIV2を使用したIEEE 802.3中程度のアタッチメントユニット（MAU）の管理オブジェクトの定義」、RFC 2239、11月1997年。"
    },
    {
      "indent": 3,
      "text": "[RFC2358] Flick, J. and J. Johnson, \"Definitions of Managed Objects for the Ethernet-like Interface Types\", RFC 2358, June 1998.",
      "ja": "[RFC2358] Flick、J。およびJ. Johnson、「イーサネットのようなインターフェイスタイプの管理されたオブジェクトの定義」、RFC 2358、1998年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC2665] Flick, J. and J. Johnson, \"Definitions of Managed Objects for the Ethernet-like Interface Types\", RFC 2665, August 1999.",
      "ja": "[RFC2665] Flick、J。およびJ. Johnson、「イーサネットのようなインターフェイスタイプの管理されたオブジェクトの定義」、RFC 2665、1999年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2666] Flick, J., \"Definitions of Object Identifiers for Identifying Ethernet Chip Sets\", RFC 2666, August 1999.",
      "ja": "[RFC2666] Flick、J。、「イーサネットチップセットを識別するためのオブジェクト識別子の定義」、RFC 2666、1999年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2668] Smith, A., Flick, J., deGraaf, K., Romascanu, D., McMaster, D., McCloghrie, K. and S. Roberts, \"Definitions of Managed Objects for IEEE 802.3 Medium Attachment Units (MAUs)\", RFC 2668, August 1999.",
      "ja": "[RFC2668] Smith、A.、Flick、J.、Degraaf、K.、Romascanu、D.、McMaster、D.、McCloghrie、K。、およびS. Roberts、「IEEE 802.3の中程度の愛着単位の管理オブジェクトの定義（Maus））」、RFC 2668、1999年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2720] Brownlee, N., \"Traffic Flow Measurement: Meter MIB\", RFC 2720, October 1999.",
      "ja": "[RFC2720]ブラウンリー、N。、「トラフィックフロー測定：Meter MIB」、RFC 2720、1999年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC3635] Flick, J., \"Definitions of Managed Objects for the Ethernet-like Interface Types\", RFC 3635, September 2003.",
      "ja": "[RFC3635] Flick、J。、「イーサネットのようなインターフェイスタイプの管理オブジェクトの定義」、RFC 3635、2003年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3636] Flick, J., \"Definitions of Managed Objects for IEEE 802.3 Medium Attachment Units (MAUs)\", RFC 3636, September 2003.",
      "ja": "[RFC3636] Flick、J。、「IEEE 802.3中程度のアタッチメントユニット（MAUS）の管理オブジェクトの定義」、RFC 3636、2003年9月。"
    },
    {
      "indent": 0,
      "text": "5. Authors' Addresses",
      "section_title": true,
      "ja": "5. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "John Flick Hewlett-Packard Company 8000 Foothills Blvd. M/S 5557 Roseville, CA 95747-5557 USA",
      "ja": "John Flick Hewlett-Packard Company 8000 Foothills Blvd.M/S 5557 Roseville、CA 95747-5557 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 916 785 4018\nFax:   +1 916 785 1199\nEMail: johnf@rose.hp.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "C. M. Heard 600 Rainbow Dr. #141 Mountain View, CA 94041-2542 USA",
      "ja": "C. M.ハード600レインボー博士＃141マウンテンビュー、CA 94041-2542 USA"
    },
    {
      "indent": 3,
      "text": "Phone: +1 650 964 8391\nEMail: heard@pobox.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6. Full Copyright Statement",
      "section_title": true,
      "ja": "6. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会やその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}