{
  "title": {
    "text": "RFC 3784 - Intermediate System to Intermediate System (IS-IS) Extensions for Traffic Engineering (TE)",
    "ja": "RFC 3784 - 交通工学のための中間システム（IS-IS）拡張（TE）"
  },
  "number": 3784,
  "created_at": "2023-09-23 07:17:47.594906+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            H. Smit\nRequest for Comments: 3784                              Procket Networks\nCategory: Informational                                            T. Li\n                                                               June 2004",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Intermediate System to Intermediate System (IS-IS) Extensions for Traffic Engineering (TE)",
      "ja": "交通工学のための中間システム（IS-IS）拡張（TE）"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（c）The Internet Society（2004）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes extensions to the Intermediate System to Intermediate System (IS-IS) protocol to support Traffic Engineering (TE). This document extends the IS-IS protocol by specifying new information that an Intermediate System (router) can place in Link State Protocol (LSP) Data Units. This information describes additional details regarding the state of the network that are useful for traffic engineering computations.",
      "ja": "このドキュメントでは、交通工学（TE）をサポートするための中間システムへの中間システム（IS-IS）プロトコルへの拡張について説明します。このドキュメントは、中間システム（Router）がLink State Protocol（LSP）データ単位に配置できる新しい情報を指定することにより、IS-ISプロトコルを拡張します。この情報は、トラフィックエンジニアリングの計算に役立つネットワークの状態に関する追加の詳細について説明しています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The IS-IS protocol is specified in ISO 10589 [1], with extensions for supporting IPv4 specified in RFC 1195 [3]. Each Intermediate System (IS) (router) advertises one or more IS-IS Link State Protocol Data Units (LSPs) with routing information. Each LSP is composed of a fixed header and a number of tuples, each consisting of a Type, a Length, and a Value. Such tuples are commonly known as TLVs, and are a good way of encoding information in a flexible and extensible format.",
      "ja": "IS-ISプロトコルはISO 10589 [1]で指定されており、RFC 1195 [3]で指定されたIPv4をサポートするための拡張機能を備えています。各中間システム（IS）（ルーター）は、ルーティング情報を持つ1つ以上のIS-ISリンク状態プロトコルデータユニット（LSP）を宣伝しています。各LSPは、固定ヘッダーと多数のタプルで構成されており、それぞれがタイプ、長さ、値で構成されています。このようなタプルは一般にTLVとして知られており、柔軟で拡張可能な形式で情報をエンコードする良い方法です。"
    },
    {
      "indent": 3,
      "text": "This document contains the design of new TLVs to replace the existing IS Neighbor TLV, IP Reachability TLV, and to include additional information about the characteristics of a particular link to an IS-IS LSP. The characteristics described in this document are needed for Traffic Engineering [4] (TE). Secondary goals include increasing the dynamic range of the IS-IS metric and improving the encoding of IP prefixes.",
      "ja": "このドキュメントには、既存のIS Neighbor TLV、IP Reachability TLVを置き換え、IS-IS LSPへの特定のリンクの特性に関する追加情報を含めるための新しいTLVの設計が含まれています。このドキュメントで説明されている特性は、トラフィックエンジニアリングに必要です[4]（TE）。二次目標には、IS-ISメトリックのダイナミックレンジの増加とIPプレフィックスのエンコードの改善が含まれます。"
    },
    {
      "indent": 3,
      "text": "The router id is useful for traffic engineering purposes because it describes a single address that can always be used to reference a particular router.",
      "ja": "ルーターIDは、特定のルーターを参照するために常に使用できる単一のアドレスを記述するため、トラフィックエンジニアリングの目的に役立ちます。"
    },
    {
      "indent": 3,
      "text": "Mechanisms and procedures to migrate to the new TLVs are not discussed in this document.",
      "ja": "このドキュメントでは、新しいTLVに移行するメカニズムと手順については説明していません。"
    },
    {
      "indent": 0,
      "text": "2. Introducing Sub-TLVs",
      "section_title": true,
      "ja": "2. サブTLVの導入"
    },
    {
      "indent": 3,
      "text": "This document introduces a new way to encode routing information in IS-IS. The new object is called a sub-TLV. Sub-TLVs are similar to regular TLVs. They use the same concepts as regular TLVs. The difference is that TLVs exist inside IS-IS packets, while sub-TLVs exist inside TLVs. TLVs are used to add extra information to IS-IS packets. Sub-TLVs are used to add extra information to particular TLVs. Each sub-TLV consists of three fields, a one-octet Type field, a one-octet Length field, and zero or more octets of Value. The Type field indicates the type of items in the Value field. The Length field indicates the length of the Value field in octets. Each sub-TLV can potentially hold multiple items. The number of items in a sub-TLV can be computed from the length of the whole sub-TLV, when the length of each item is known. Unknown sub-TLVs are to be ignored and skipped upon receipt.",
      "ja": "このドキュメントでは、IS-ISでルーティング情報をエンコードする新しい方法を紹介します。新しいオブジェクトはsub-tlvと呼ばれます。サブTLVは、通常のTLVに似ています。彼らは通常のTLVと同じ概念を使用します。違いは、TLVがIS-ISパケット内に存在し、サブTLVがTLV内に存在することです。TLVは、IS-ISパケットに追加の情報を追加するために使用されます。サブTLVは、特定のTLVに追加の情報を追加するために使用されます。各サブTLVは、3つのフィールド、1オクテット型フィールド、1オクテットの長さフィールド、および値のゼロ以上のオクテットで構成されています。タイプフィールドは、値フィールドのアイテムのタイプを示します。長さフィールドは、オクテットの値フィールドの長さを示します。各サブTLVは、複数のアイテムを潜在的に保持できます。サブTLVのアイテムの数は、各アイテムの長さがわかっている場合、Sub-TLV全体の長さから計算できます。未知のサブTLVは、無視され、受領時にスキップされます。"
    },
    {
      "indent": 3,
      "text": "The Sub-TLV type space is managed by the IETF IS-IS WG (http://www.ietf.org/html.charters/isis-charter.html). New type values are allocated following review on the IETF IS-IS mailing list. This will normally require publication of additional documentation describing how the new type is used. In the event that the IS-IS working group has disbanded the review shall be performed by a Designated Expert assigned by the responsible Area Director.",
      "ja": "Sub-TLVタイプスペースは、IETF IS-IS WG（http://www.ietf.org/html.charters/isis-charter.html）によって管理されます。新しいタイプの値は、IETF IS-ISメーリングリストのレビュー後に割り当てられます。これには通常、新しいタイプの使用方法を説明する追加のドキュメントの公開が必要です。IS-ISワーキンググループが解散した場合、レビューは、責任あるエリアディレクターによって割り当てられた指定された専門家によって実行されるものとします。"
    },
    {
      "indent": 0,
      "text": "3. The Extended IS Reachability TLV",
      "section_title": true,
      "ja": "3. 拡張は到達可能性TLVです"
    },
    {
      "indent": 3,
      "text": "The extended IS reachability TLV is TLV type 22.",
      "ja": "拡張は到達可能性TLVです。TLVタイプ22です。"
    },
    {
      "indent": 3,
      "text": "The existing IS reachability (TLV type 2, defined in ISO 10589 [1]) contains information about a series of IS neighbors. For each neighbor, there is a structure that contains the default metric, the delay, the monetary cost, the reliability, and the 7-octet ID of the adjacent neighbor. Of this information, the default metric is commonly used. The default metric is currently one octet, with one bit used to indicate whether the metric is internal or external, and one bit that was originally unused, but which was later defined by RFC 2966 to be the up/down bit. The remaining 6 bits are used to store the actual metric, resulting in a possible metric range of 0- 63. This limitation is one of the restrictions that we would like to lift.",
      "ja": "既存のIS Reachability（ISO 10589 [1]で定義されているTLV Type 2）には、IS近隣のシリーズに関する情報が含まれています。各隣接には、デフォルトのメトリック、遅延、金銭的コスト、信頼性、および隣接する隣人の7オクテットIDを含む構造があります。この情報のうち、デフォルトのメトリックが一般的に使用されています。デフォルトのメトリックは現在1オクテットで、メトリックが内部または外部であるかどうかを示すためにビットを使用し、元々使用されていないビットですが、後にRFC 2966によってアップ/ダウンビットであると定義されました。残りの6ビットは、実際のメトリックを保存するために使用され、0〜63のメトリック範囲の可能性があります。この制限は、私たちが持ち上げたい制限の1つです。"
    },
    {
      "indent": 3,
      "text": "The remaining three metrics (delay, monetary cost, and reliability) are not commonly implemented and reflect unused overhead in the TLV. The neighbor is identified by its system ID, typically 6-octets, plus one octet indicating the pseudonode number. Thus, the existing TLV consumes 11 octets per neighbor, with 4 octets for metric and 7 octets for neighbor identification. To indicate multiple adjacencies, this structure is repeated within the IS reachability TLV. Because the TLV is limited to 255 octets of content, a single TLV can describe up to 23 neighbors. The IS reachability TLV can be repeated within the LSP fragments to describe further neighbors.",
      "ja": "残りの3つのメトリック（遅延、金銭的コスト、信頼性）は一般的に実装されておらず、TLVの未使用のオーバーヘッドを反映しています。隣人は、システムID、通常6オクテットに加えて、擬似ノード数を示す1つのオクテットで識別されます。したがって、既存のTLVは、隣人ごとに11オクテットを消費し、メトリック用に4オクテット、隣接識別のために7オクテットを消費します。複数の隣接を示すために、この構造はISの到達可能性TLV内で繰り返されます。TLVは255オクテットのコンテンツに制限されているため、単一のTLVは最大23人の隣人を記述できます。IS IS RECHANIGE TLVは、LSPフラグメント内で繰り返して、さらなる隣接を記述できます。"
    },
    {
      "indent": 3,
      "text": "The proposed extended IS reachability TLV contains a new data structure, consisting of:",
      "ja": "提案されている拡張は、次のような新しいデータ構造が含まれています。"
    },
    {
      "indent": 6,
      "text": "7 octets of system Id and pseudonode number 3 octets of default metric 1 octet of length of sub-TLVs 0-244 octets of sub-TLVs, where each sub-TLV consists of a sequence of 1 octet of sub-type 1 octet of length of the value field of the sub-TLV 0-242 octets of value",
      "ja": "7オクテットのシステムIDおよび擬似ノード番号3デフォルトメトリックのオクテット1サブTLVの長さのオクテット0-244サブTLVのオクテット。Sub-TLV 0-242値の値フィールドの値のオクテット"
    },
    {
      "indent": 3,
      "text": "Thus, if no sub-TLVs are used, the new encoding requires 11 octets and can contain up to 23 neighbors. Please note that while the encoding allows for 255 octets of sub-TLVs, the maximum value cannot fit in the overall IS reachability TLV. The practical maximum is 255 octets minus the 11 octets described above, or 244 octets. Further, there is no defined mechanism for extending the sub-TLV space for a particular neighbor. Thus, wasting sub-TLV space is discouraged.",
      "ja": "したがって、サブTLVが使用されない場合、新しいエンコードには11個のオクテットが必要であり、最大23人の隣人を含めることができます。エンコードでは255オクテットのサブTLVが許可されていますが、最大値は全体的なものでは到達可能性TLVではありません。実用的な最大値は、上記の11オクテット、または244オクテットを引いた255オクテットです。さらに、特定の隣接するサブTLVスペースを拡張するための定義されたメカニズムはありません。したがって、サブTLVスペースを無駄にすることは落胆します。"
    },
    {
      "indent": 3,
      "text": "The metric octets are encoded as a 24-bit unsigned integer. Note that the metric field in the new extended IP reachability TLV is encoded as a 32-bit unsigned integer. These different sizes were chosen so that it is very unlikely that the cost of an intra-area route has to be chopped off to fit in the metric field of an inter-area route.",
      "ja": "メトリックオクテットは、24ビットの符号なし整数としてエンコードされます。新しい拡張IPリーチビリティTLVのメトリックフィールドは、32ビットの符号なし整数としてエンコードされていることに注意してください。これらのさまざまなサイズが選択されたため、エリア内ルートのメトリックフィールドに収まるために、エリア内ルートのコストを切り落とす必要がありません。"
    },
    {
      "indent": 3,
      "text": "To preclude overflow within a traffic engineering SPF implementation, all metrics greater than or equal to MAX_PATH_METRIC SHALL be considered to have a metric of MAX_PATH_METRIC. It is easiest to select MAX_PATH_METRIC such that MAX_PATH_METRIC plus a single link metric does not overflow the number of bits for internal metric calculation. We assume that this is 32 bits. Therefore, we have chosen MAX_PATH_METRIC to be 4,261,412,864 (0xFE000000, 2^32 - 2^25).",
      "ja": "トラフィックエンジニアリングSPFの実装内でオーバーフローを排除するために、max_path_metric以上のすべてのメトリックは、max_path_metricのメトリックを持っていると見なされます。max_path_metricと単一のリンクメトリックが内部メトリック計算のビット数をオーバーフローしないように、max_path_metricを選択するのが最も簡単です。これは32ビットであると仮定します。したがって、MAX_PATH_METRICを4,261,412,864（0xfe000000、2^32-2^25）に選択しました。"
    },
    {
      "indent": 3,
      "text": "If a link is advertised with the maximum link metric (2^24 - 1), this link MUST NOT be considered during the normal SPF computation. This will allow advertisement of a link for purposes other than building the normal Shortest Path Tree. An example is a link that is available for traffic engineering, but not for hop-by-hop routing.",
      "ja": "リンクが最大リンクメトリック（2^24-1）で宣伝されている場合、このリンクは通常のSPF計算中に考慮してはなりません。これにより、通常の最短パスツリーを構築する以外の目的のためにリンクの広告が可能になります。例は、交通工学に利用できるリンクですが、ホップバイホップルーティングには利用できません。"
    },
    {
      "indent": 3,
      "text": "Certain sub-TLVs are proposed here:",
      "ja": "特定のサブTLVがここで提案されています："
    },
    {
      "indent": 3,
      "text": "Sub-TLV type  Length (octets)  Name\n   3               4           Administrative group (color)\n   6               4           IPv4 interface address\n   8               4           IPv4 neighbor address\n   9               4           Maximum link bandwidth\n   10              4           Reservable link bandwidth\n   11              32          Unreserved bandwidth\n   18              3           TE Default metric\n   250-254                     Reserved for cisco specific extensions\n   255                         Reserved for future expansion",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Each of these sub-TLVs is described below. Unless stated otherwise, multiple occurrences of the information are supported by multiple inclusions of the sub-TLV.",
      "ja": "これらの各サブTLVを以下に説明します。特に明記しない限り、情報の複数の発生は、Sub-TLVの複数の包含によってサポートされます。"
    },
    {
      "indent": 0,
      "text": "3.1. Sub-TLV 3: Administrative group (color, resource class)",
      "section_title": true,
      "ja": "3.1. Sub-TLV 3：管理グループ（色、リソースクラス）"
    },
    {
      "indent": 3,
      "text": "The administrative group sub-TLV contains a 4-octet bit mask assigned by the network administrator. Each set bit corresponds to one administrative group assigned to the interface.",
      "ja": "管理グループSub-TLVには、ネットワーク管理者によって割り当てられた4-OCTETビットマスクが含まれています。各セットビットは、インターフェイスに割り当てられた1つの管理グループに対応します。"
    },
    {
      "indent": 3,
      "text": "By convention, the least significant bit is referred to as 'group 0', and the most significant bit is referred to as 'group 31'.",
      "ja": "慣習により、最も重要なビットは「グループ0」と呼ばれ、最も重要なビットは「グループ31」と呼ばれます。"
    },
    {
      "indent": 3,
      "text": "This sub-TLV is OPTIONAL. This sub-TLV SHOULD appear once at most in each extended IS reachability TLV.",
      "ja": "このサブTLVはオプションです。このサブTLVは、拡張性が拡張される各範囲で最大で1回表示されるはずです。"
    },
    {
      "indent": 0,
      "text": "3.2. Sub-TLV 6: IPv4 interface address",
      "section_title": true,
      "ja": "3.2. Sub-TLV 6：IPv4インターフェイスアドレス"
    },
    {
      "indent": 3,
      "text": "This sub-TLV contains a 4-octet IPv4 address for the interface described by the (main) TLV. This sub-TLV can occur multiple times.",
      "ja": "このSub-TLVには、（メイン）TLVで説明されているインターフェイスの4-OCTET IPv4アドレスが含まれています。このサブTLVは複数回発生する可能性があります。"
    },
    {
      "indent": 3,
      "text": "Implementations MUST NOT inject a /32 prefix for the interface address into their routing or forwarding table because this can lead to forwarding loops when interacting with systems that do not support this sub-TLV.",
      "ja": "インターフェイスアドレスのA /32プレフィックスをルーティングテーブルまたは転送テーブルに挿入しないでください。"
    },
    {
      "indent": 3,
      "text": "If a router implements the basic TLV extensions in this document, it MAY add or omit this sub-TLV from the description of an adjacency. If a router implements traffic engineering, it MUST include this sub-TLV.",
      "ja": "ルーターがこのドキュメントの基本的なTLV拡張機能を実装している場合、隣接の説明からこのサブTLVを追加または省略する場合があります。ルーターがトラフィックエンジニアリングを実装する場合、このサブTLVを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "3.3. Sub-TLV 8: IPv4 neighbor address",
      "section_title": true,
      "ja": "3.3. Sub-TLV 8：IPv4ネイバーアドレス"
    },
    {
      "indent": 3,
      "text": "This sub-TLV contains a single IPv4 address for a neighboring router on this link. This sub-TLV can occur multiple times.",
      "ja": "このサブTLVには、このリンク上の隣接するルーターの単一のIPv4アドレスが含まれています。このサブTLVは複数回発生する可能性があります。"
    },
    {
      "indent": 3,
      "text": "Implementations MUST NOT inject a /32 prefix for the neighbor address into their routing or forwarding table because this can lead to forwarding loops when interacting with systems that do not support this sub-TLV.",
      "ja": "このサブTLVをサポートしていないシステムと対話する場合、これは転送ループにつながる可能性があるため、実装は近隣アドレスのA /32プレフィックスをルーティングまたは転送テーブルに挿入しないでください。"
    },
    {
      "indent": 3,
      "text": "If a router implements the basic TLV extensions in this document, it MAY add or omit this sub-TLV from the description of an adjacency. If a router implements traffic engineering, it MUST include this sub-TLV on point-to-point adjacencies.",
      "ja": "ルーターがこのドキュメントの基本的なTLV拡張機能を実装している場合、隣接の説明からこのサブTLVを追加または省略する場合があります。ルーターがトラフィックエンジニアリングを実装する場合、このサブTLVをポイントツーポイント隣接に含める必要があります。"
    },
    {
      "indent": 0,
      "text": "3.4. Sub-TLV 9: Maximum link bandwidth",
      "section_title": true,
      "ja": "3.4. Sub-TLV 9：最大リンク帯域幅"
    },
    {
      "indent": 3,
      "text": "This sub-TLV contains the maximum bandwidth that can be used on this link in this direction (from the system originating the LSP to its neighbors). This is useful for traffic engineering.",
      "ja": "このサブTLVには、このリンクで使用できる最大帯域幅が含まれています（LSPをネイバーに由来するシステムから）。これは、交通工学に役立ちます。"
    },
    {
      "indent": 3,
      "text": "The maximum link bandwidth is encoded in 32 bits in IEEE floating point format. The units are bytes (not bits!) per second.",
      "ja": "最大リンク帯域幅は、IEEEフローティングポイント形式で32ビットでエンコードされます。ユニットは1秒あたりのバイト（ビットではありません！）です。"
    },
    {
      "indent": 3,
      "text": "This sub-TLV is optional. This sub-TLV SHOULD appear once at most in each extended IS reachability TLV.",
      "ja": "このサブTLVはオプションです。このサブTLVは、拡張性が拡張される各範囲で最大で1回表示されるはずです。"
    },
    {
      "indent": 0,
      "text": "3.5. Sub-TLV 10: Maximum reservable link bandwidth",
      "section_title": true,
      "ja": "3.5. Sub-TLV 10：最大予約可能リンク帯域幅"
    },
    {
      "indent": 3,
      "text": "This sub-TLV contains the maximum amount of bandwidth that can be reserved in this direction on this link. Note that for oversubscription purposes, this can be greater than the bandwidth of the link.",
      "ja": "このサブTLVには、このリンクのこの方向に予約できる帯域幅の最大量が含まれています。オーバーサブスクリプションのために、これはリンクの帯域幅よりも大きい場合があることに注意してください。"
    },
    {
      "indent": 3,
      "text": "The maximum reservable link bandwidth is encoded in 32 bits in IEEE floating point format. The units are bytes (not bits!) per second.",
      "ja": "最大予約可能なリンク帯域幅は、IEEEフローティングポイント形式で32ビットでエンコードされています。ユニットは1秒あたりのバイト（ビットではありません！）です。"
    },
    {
      "indent": 3,
      "text": "This sub-TLV is optional. This sub-TLV SHOULD appear once at most in each extended IS reachability TLV.",
      "ja": "このサブTLVはオプションです。このサブTLVは、拡張性が拡張される各範囲で最大で1回表示されるはずです。"
    },
    {
      "indent": 0,
      "text": "3.6. Sub-TLV 11: Unreserved bandwidth",
      "section_title": true,
      "ja": "3.6. Sub-TLV 11：予約されていない帯域幅"
    },
    {
      "indent": 3,
      "text": "This sub-TLV contains the amount of bandwidth reservable in this direction on this link. Note that for oversubscription purposes, this can be greater than the bandwidth of the link.",
      "ja": "このサブTLVには、このリンクのこの方向に予約可能な帯域幅の量が含まれています。オーバーサブスクリプションのために、これはリンクの帯域幅よりも大きい場合があることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Because of the need for priority and preemption, each head end needs to know the amount of reserved bandwidth at each priority level. Thus, this sub-TLV contains eight 32 bit IEEE floating point numbers. The units are bytes (not bits!) per second. The values correspond to the bandwidth that can be reserved with a setup priority of 0 through 7, arranged in increasing order with priority 0 occurring at the start of the sub-TLV, and priority 7 at the end of the sub-TLV.",
      "ja": "優先順位と先制が必要なため、各ヘッドエンドは、各優先レベルで予約された帯域幅の量を知る必要があります。したがって、このサブTLVには、8つの32ビットIEEEフローティングポイント番号が含まれています。ユニットは1秒あたりのバイト（ビットではありません！）です。値は、0〜7のセットアップ優先度で予約できる帯域幅に対応し、サブTLVの開始時に発生する優先度0とサブTLVの終了時に優先度7で順序を増やします。"
    },
    {
      "indent": 3,
      "text": "For stability reasons, rapid changes in the values in this sub-TLV SHOULD NOT cause rapid generation of LSPs.",
      "ja": "安定性の理由から、このサブTLVの値の急速な変化は、LSPの急速な生成を引き起こすべきではありません。"
    },
    {
      "indent": 3,
      "text": "This sub-TLV is optional. This sub-TLV SHOULD appear once at most in each extended IS reachability TLV.",
      "ja": "このサブTLVはオプションです。このサブTLVは、拡張性が拡張される各範囲で最大で1回表示されるはずです。"
    },
    {
      "indent": 0,
      "text": "3.7. Sub-TLV 18: Traffic Engineering Default Metric",
      "section_title": true,
      "ja": "3.7. Sub-TLV 18：トラフィックエンジニアリングのデフォルトメトリック"
    },
    {
      "indent": 3,
      "text": "This sub-TLV contains a 24-bit unsigned integer. This metric is administratively assigned and can be used to present a differently weighted topology to traffic engineering SPF calculations.",
      "ja": "このサブTLVには、24ビットの符号なし整数が含まれています。このメトリックは管理上割り当てられており、トラフィックエンジニアリングSPF計算に異なる加重トポロジを提示するために使用できます。"
    },
    {
      "indent": 3,
      "text": "To preclude overflow within a traffic engineering SPF implementation, all metrics greater than or equal to MAX_PATH_METRIC SHALL be considered to have a metric of MAX_PATH_METRIC. It is easiest to select MAX_PATH_METRIC such that MAX_PATH_METRIC plus a single link metric does not overflow the number of bits for internal metric calculation. We assume that this is 32 bits. Therefore, we have chosen MAX_PATH_METRIC to be 4,261,412,864 (0xFE000000, 2^32 - 2^25).",
      "ja": "トラフィックエンジニアリングSPFの実装内でオーバーフローを排除するために、max_path_metric以上のすべてのメトリックは、max_path_metricのメトリックを持っていると見なされます。max_path_metricと単一のリンクメトリックが内部メトリック計算のビット数をオーバーフローしないように、max_path_metricを選択するのが最も簡単です。これは32ビットであると仮定します。したがって、MAX_PATH_METRICを4,261,412,864（0xfe000000、2^32-2^25）に選択しました。"
    },
    {
      "indent": 3,
      "text": "This sub-TLV is optional. This sub-TLV SHOULD appear once at most in each extended IS reachability TLV. If a link is advertised without this sub-TLV, traffic engineering SPF calculations MUST use the normal default metric of this link, which is advertised in the fixed part of the extended IS reachability TLV.",
      "ja": "このサブTLVはオプションです。このサブTLVは、拡張性が拡張される各範囲で最大で1回表示されるはずです。このサブTLVなしでリンクが宣伝されている場合、トラフィックエンジニアリングSPF計算は、拡張された部分の固定部分で宣伝されているこのリンクの通常のデフォルトメトリックを使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. The Extended IP Reachability TLV",
      "section_title": true,
      "ja": "4. 拡張されたIPリーチビリティTLV"
    },
    {
      "indent": 3,
      "text": "The extended IP reachability TLV is TLV type 135.",
      "ja": "拡張されたIPリーチビリティTLVはTLVタイプ135です。"
    },
    {
      "indent": 3,
      "text": "The existing IP reachability TLVs (TLV type 128 and TLV type 130, defined in RFC 1195 [3]) carry IP prefixes in a format that is analogous to the IS neighbor TLV from ISO 10589 [1]. They carry four metrics, of which only the default metric is commonly used. The default metric has a possible range of 0-63. We would like to remove this restriction.",
      "ja": "RFC 1195 [3]で定義されている既存のIPリーチビリティTLV（TLV Type 128およびTLV Type 130）は、ISO 10589 [1]のIS隣接TLVに類似した形式でIPプレフィックスを運びます。それらは4つのメトリックを持ち、そのうちデフォルトメトリックのみが一般的に使用されます。デフォルトメトリックの可能性は0〜63です。この制限を削除したいと思います。"
    },
    {
      "indent": 3,
      "text": "In addition, route redistribution (a.k.a. route leaking) has a key problem that was not fully addressed by the existing IP reachability TLVs. RFC 1195 [3] allows a router to advertise prefixes upwards in the level hierarchy. Unfortunately there were no mechanisms defined to advertise prefixes downwards in the level hierarchy.",
      "ja": "さらに、ルートの再配布（別名ルート漏れ）には、既存のIPリーチビリティTLVによって完全には対処されていない重要な問題があります。RFC 1195 [3]を使用すると、ルーターがレベル階層で上向きのプレフィックスを宣伝できます。残念ながら、レベルの階層で下方を宣伝するためのメカニズムはありませんでした。"
    },
    {
      "indent": 3,
      "text": "To address these two issues, the proposed extended IP reachability TLV provides for a 32 bit metric and adds one bit to indicate that a prefix has been redistributed 'down' in the hierarchy.",
      "ja": "これらの2つの問題に対処するために、提案された拡張IPリーチビリティTLVは32ビットメトリックを提供し、階層でプレフィックスが「ダウン」されていることを示すために1ビットを追加します。"
    },
    {
      "indent": 3,
      "text": "The proposed extended IP reachability TLV contains a new data structure, consisting of:",
      "ja": "提案されている拡張IPリーチビリティTLVには、以下で構成される新しいデータ構造が含まれています。"
    },
    {
      "indent": 6,
      "text": "4 octets of metric information 1 octet of control information, consisting of 1 bit of up/down information 1 bit indicating the presence of sub-TLVs 6 bits of prefix length 0-4 octet of IPv4 prefix 0-250 optional octets of sub-TLVs, if present consisting of 1 octet of length of sub-TLVs 0-249 octets of sub-TLVs, where each sub-TLV consists of a sequence of 1 octet of sub-type 1 octet of length of the value field of the sub-TLV 0-247 octets of value",
      "ja": "4メートルコの4オクテット1コントロール情報のオクテット、1ビットのアップ/ダウン情報からなる1ビットで構成される1ビットは、サブTLVのプレフィックス長さ0-4のIPv4プレフィックス0-4オクテットの存在を示しています。、存在する場合、サブTLVの長さ1オクテット0-249サブTLVのオクテットで構成されています。各サブTLVは、サブタイプの1オクテットのシーケンスで構成されています。TLV 0-247値のオクテット"
    },
    {
      "indent": 3,
      "text": "This data structure can be replicated within the TLV, without exceeding the maximum length of the TLV.",
      "ja": "このデータ構造は、TLVの最大長を超えることなく、TLV内で複製できます。"
    },
    {
      "indent": 3,
      "text": "The 6 bits of prefix length can have the values 0-32 and indicate the number of significant bits in the prefix. The prefix is encoded in the minimal number of octets for the given number of significant bits. This implies:",
      "ja": "プレフィックスの長さの6ビットは、値0-32を持ち、プレフィックス内の重要なビットの数を示します。プレフィックスは、与えられた数の有意ビットの数の最小数のオクテットでエンコードされます。これは次のとおりです。"
    },
    {
      "indent": 9,
      "text": "Significant bits                Octets\n0                               0\n1-8                             1\n9-16                            2\n17-24                           3\n25-32                           4",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The remaining bits of prefix are transmitted as zero and ignored upon receipt.",
      "ja": "プレフィックスの残りの部分はゼロとして送信され、受領時に無視されます。"
    },
    {
      "indent": 3,
      "text": "If a prefix is advertised with a metric larger then MAX_PATH_METRIC (0xFE000000, see paragraph 3.0), this prefix MUST NOT be considered during the normal SPF computation. This allows advertisement of a prefix for purposes other than building the normal IP routing table.",
      "ja": "プレフィックスがmax_path_metric（0xfe00000000よりも大きいメトリックで宣伝されている場合、このプレフィックスは通常のSPF計算中に考慮してはなりません。これにより、通常のIPルーティングテーブルを構築する以外の目的でプレフィックスの広告が可能になります。"
    },
    {
      "indent": 0,
      "text": "4.1. The up/down Bit",
      "section_title": true,
      "ja": "4.1. アップ/ダウンビット"
    },
    {
      "indent": 3,
      "text": "If routers were allowed to redistribute IP prefixes freely in both directions between level 1 and level 2 without any additional mechanisms, those routers would not be able to determine looping of routing information. A problem occurs when a router learns a prefix via level 2 routing and advertises that prefix down into a level 1 area, where another router might pick up the route and advertise the prefix back up into the level 2 backbone. If the original source withdraws the prefix, those two routers might end up having a routing loop between them, where part of the looped path is via level 1 routing and the other part of the looped path is via level 2 routing. The solution that RFC 1195 [3] poses is to allow only advertising prefixes upward in the level hierarchy, and to disallow the advertising of prefixes downward in the hierarchy.",
      "ja": "ルーターが追加のメカニズムなしにレベル1とレベル2の間の両方の方向にIPプレフィックスを自由に再配布することを許可された場合、それらのルーターはルーティング情報のループを決定することができません。ルーターがレベル2ルーティングを介してプレフィックスを学習し、そのプレフィックスをレベル1の領域に宣伝する場合に問題が発生し、別のルーターがルートをピックアップし、プレフィックスをレベル2バックボーンに宣伝する可能性があります。元のソースがプレフィックスを撤回した場合、それらの2つのルーターがそれらの間にルーティングループを持つことになります。ループパスの一部はレベル1ルーティングを介して、ループされたパスの他の部分はレベル2ルーティングを介して行われます。RFC 1195 [3]がポーズをとるソリューションは、レベルの階層で上向きの広告のプレフィックスのみを許可し、階層でプレフィックスの広告を下向きに禁止することです。"
    },
    {
      "indent": 3,
      "text": "To prevent this looping of prefixes between levels, a new bit of information is defined in the new extended IP reachability TLV. This bit is called the up/down bit. The up/down bit SHALL be set to 0 when a prefix is first injected into IS-IS. If a prefix is advertised from a higher level to a lower level (e.g. level 2 to level 1), the bit MUST be set to 1, indicating that the prefix has traveled down the hierarchy. Prefixes that have the up/down bit set to 1 may only be advertised down the hierarchy, i.e. to lower levels.",
      "ja": "このレベル間のプレフィックスのループを防ぐために、新しい拡張IPリーチビリティTLVで新しい情報が定義されます。このビットは、アップ/ダウンビットと呼ばれます。プレフィックスが最初にIS-ISに注入された場合、アップ/ダウンビットは0に設定されます。プレフィックスがより高いレベルから低レベル（レベル2からレベル1まで）に宣伝されている場合、ビットは1に設定する必要があります。プレフィックスが階層を下って移動したことを示します。アップ/ダウンビットが1に設定されているプレフィックスは、階層のみで宣伝される場合があります。つまり、より低いレベルになります。"
    },
    {
      "indent": 3,
      "text": "These semantics apply even if IS-IS is extended in the future to have additional levels. By insuring that prefixes follow only the IS-IS hierarchy, we have insured that the information does not loop, thereby insuring that there are no persistent forwarding loops.",
      "ja": "これらのセマンティクスは、IS-ISが将来拡張されて追加のレベルを持つ場合でも適用されます。接頭辞がIS-IS階層のみに従うことを保証することにより、情報がループしないことを保証し、それにより永続的な転送ループがないことを保証しました。"
    },
    {
      "indent": 3,
      "text": "If a prefix is advertised from one area to another at the same level, then the up/down bit SHALL be set to 1. This situation can arise when a router implements multiple virtual routers at the same level, but in different areas.",
      "ja": "プレフィックスが同じレベルである領域から別の領域に宣伝されている場合、上/下のビットは1に設定されます。この状況は、ルーターが同じレベルで複数の仮想ルーターを実装すると、異なる領域で発生する場合に発生する可能性があります。"
    },
    {
      "indent": 3,
      "text": "The semantics of the up/down bit in the new extended IP reachability TLV are identical to the semantics of the up/down bit defined in RFC 2966 [2].",
      "ja": "新しい拡張IPリーチビリティTLVのアップ/ダウンビットのセマンティクスは、RFC 2966 [2]で定義されているアップ/ダウンビットのセマンティクスと同一です。"
    },
    {
      "indent": 0,
      "text": "4.2. Expandability of the Extended IP Reachability TLV with Sub-TLVs",
      "section_title": true,
      "ja": "4.2. 拡張されたIPリーチビリティTLVをサブTLVで拡張する"
    },
    {
      "indent": 3,
      "text": "The extended IP reachability TLV can hold sub-TLVs that apply to a particular prefix. This allows for easy future extensions. If there are no sub-TLVs associated with a prefix, the bit indicating the presence of sub-TLVs SHALL be set to 0. If this bit is set to 1, the first octet after the prefix will be interpreted as the length of all sub-TLVs associated with this IPv4 prefix. Please note that while the encoding allows for 255 octets of sub-TLVs, the maximum value cannot fit in the overall extended IP reachability TLV. The practical maximum is 255 octets minus the 5-9 octets described above, or 250 octets.",
      "ja": "拡張されたIPリーチビリティTLVは、特定のプレフィックスに適用されるサブTLVを保持できます。これにより、将来の拡張が簡単になります。接頭辞に関連付けられたサブTLVがない場合、サブTLVの存在を示すビットは0に設定されます。このIPv4プレフィックスに関連付けられているTLV。エンコードでは255オクテットのサブTLVが許可されていますが、最大値は全体的な拡張IPリーチビリティTLVに適合できないことに注意してください。実用的な最大値は、上記の5-9オクテット、または250オクテットを引いた255オクテットです。"
    },
    {
      "indent": 3,
      "text": "This document does not define any sub-TLVs for the extended IP reachability TLV.",
      "ja": "このドキュメントでは、拡張されたIPリーチビリティTLVのサブTLVを定義しません。"
    },
    {
      "indent": 0,
      "text": "5. The Traffic Engineering Router ID TLV",
      "section_title": true,
      "ja": "5. トラフィックエンジニアリングルーターID TLV"
    },
    {
      "indent": 3,
      "text": "The Traffic Engineering router ID TLV is TLV type 134.",
      "ja": "トラフィックエンジニアリングルーターID TLVはTLVタイプ134です。"
    },
    {
      "indent": 3,
      "text": "The router ID TLV contains the 4-octet router ID of the router originating the LSP. This is useful in several regards:",
      "ja": "ルーターID TLVには、LSPを発信するルーターの4-OCTETルーターIDが含まれています。これはいくつかの点で役立ちます："
    },
    {
      "indent": 3,
      "text": "For traffic engineering, it guarantees that we have a single stable address that can always be referenced in a path that will be reachable from multiple hops away, regardless of the state of the node's interfaces.",
      "ja": "トラフィックエンジニアリングの場合、ノードのインターフェイスの状態に関係なく、複数のホップから到達可能なパスで常に参照できる単一の安定したアドレスがあることを保証します。"
    },
    {
      "indent": 3,
      "text": "If OSPF is also active in the domain, traffic engineering can compute the mapping between the OSPF and IS-IS topologies.",
      "ja": "OSPFがドメインでもアクティブな場合、トラフィックエンジニアリングはOSPFとIS-ISトポロジーの間のマッピングを計算できます。"
    },
    {
      "indent": 3,
      "text": "If a router does not implement traffic engineering, it MAY add or omit the Traffic Engineering router ID TLV. If a router implements traffic engineering, it MUST include this TLV in its LSP. This TLV SHOULD not be included more than once in an LSP.",
      "ja": "ルーターがトラフィックエンジニアリングを実装していない場合、トラフィックエンジニアリングルーターID TLVを追加または省略する場合があります。ルーターがトラフィックエンジニアリングを実装する場合、このTLVをLSPに含める必要があります。このTLVは、LSPに複数回含めるべきではありません。"
    },
    {
      "indent": 3,
      "text": "If a router advertises the Traffic Engineering router ID TLV in its LSP, and if it advertises prefixes via the Border Gateway Protocol (BGP) with the BGP next hop attribute set to the BGP router ID, the Traffic Engineering router ID SHOULD be the same as the BGP router ID.",
      "ja": "ルーターがLSPでトラフィックエンジニアリングルーターID TLVを宣伝し、BGPの次のホップ属性をBGPルーターIDに設定したBorder Gateway Protocol（BGP）を介してプレフィックスを宣伝する場合、トラフィックエンジニアリングルーターIDは同じでなければなりません。BGPルーターID。"
    },
    {
      "indent": 3,
      "text": "Implementations MUST NOT inject a /32 prefix for the router ID into their forwarding table because this can lead to forwarding loops when interacting with systems that do not support this TLV.",
      "ja": "実装は、このTLVをサポートしていないシステムと対話するときに転送ループにつながる可能性があるため、ルーターIDのA /32プレフィックスを転送テーブルに挿入しないでください。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "6.1. TLV Codepoint Allocations",
      "section_title": true,
      "ja": "6.1. TLV CodePoint割り当て"
    },
    {
      "indent": 3,
      "text": "This document defines the following new IS-IS TLV types, which have been reflected in the ISIS TLV code-point registry:",
      "ja": "このドキュメントは、ISIS TLVコードポイントレジストリに反映されている次の新しいIS-IS TLVタイプを定義します。"
    },
    {
      "indent": 6,
      "text": "Type        Description                            IIH   LSP   SNP\n----        -----------------------------------    ---   ---   ---\n 22         The extended IS reachability TLV        n     y     n\n 134        The Traffic Engineering router ID TLV   n     y     n\n 135        The extended IP reachability TLV        n     y     n",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.2. New Registries",
      "section_title": true,
      "ja": "6.2. 新しいレジストリ"
    },
    {
      "indent": 3,
      "text": "IANA has created the following new registries.",
      "ja": "IANAは次の新しいレジストリを作成しました。"
    },
    {
      "indent": 0,
      "text": "6.2.1. Sub-TLVs for the Extended IS Reachability TLV",
      "section_title": true,
      "ja": "6.2.1. 拡張されたサブTLVは到達可能性TLVです"
    },
    {
      "indent": 3,
      "text": "This registry contains codepoints for Sub-TLVs of TLV 22. The range of values is 0-255. Allocations within the registry require documentation of the proposed use of the allocated value and approval by the Designated Expert assigned by the IESG (see [5]).",
      "ja": "このレジストリには、TLV 22のサブTLVのコードポイントが含まれています。値の範囲は0-255です。レジストリ内の割り当てには、IESGによって割り当てられた指定された専門家による割り当てられた価値と承認の提案された使用の文書が必要です（[5]を参照）。"
    },
    {
      "indent": 3,
      "text": "Taking into consideration allocations specified in this document, the registry has been initialized as follows:",
      "ja": "このドキュメントで指定された割り当てを考慮して、レジストリは次のように初期化されています。"
    },
    {
      "indent": 9,
      "text": "Type        Description\n----        -----------------------------------\n0-2         unassigned\n 3          Administrative group (color)\n4-5         unassigned\n 6          IPv4 interface address\n 7          unassigned\n 8          IPv4 neighbor address\n 9          Maximum link bandwidth\n 10         Reservable link bandwidth\n 11         Unreserved bandwidth\n12-17       unassigned\n 18         TE Default metric\n19-254      unassigned\n 255        Reserved for future expansion",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.2.2. Sub-TLVs for the Extended IP Reachability TLV",
      "section_title": true,
      "ja": "6.2.2. 拡張されたIPリーチビリティTLVのサブTLV"
    },
    {
      "indent": 3,
      "text": "This registry contains codepoints for Sub-TLVs of TLV 135. The range of values is 0-255. Allocations within the registry require documentation of the use of the allocated value and approval by the Designated Expert assigned by the IESG (see [5]).",
      "ja": "このレジストリには、TLV 135のサブTLVのコードポイントが含まれています。値の範囲は0-255です。レジストリ内の割り当てでは、IESGによって割り当てられた指定された専門家による割り当てられた値と承認の使用に関する文書が必要です（[5]を参照）。"
    },
    {
      "indent": 3,
      "text": "No codepoints are defined in this document.",
      "ja": "このドキュメントでは、コードポイントは定義されていません。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[1] ISO, \"Intermediate System to Intermediate System Intra-Domain Routeing Exchange Protocol for use in Conjunction with the Protocol for Providing the Connectionless-mode Network Service (ISO 8473)\", International Standard 10589:2002, Second Edition",
      "ja": "[1] ISO、「Connectionless-Mode Network Service（ISO 8473）を提供するためのプロトコルと組み合わせて使用するためのドメイン内領域内のシステム内領域内領域内領域内領域ルーティング交換プロトコル」、International Standard 10589：2002、第2版"
    },
    {
      "indent": 3,
      "text": "[2] Li, T., Przygienda, T. and H. Smit, \"Domain-wide Prefix Distribution with Two-Level IS-IS\", RFC 2966, October 2000.",
      "ja": "[2] Li、T.、Przygienda、T。、およびH. Smit、「2レベルIS-ISを備えたドメイン全体のプレフィックス分布」、RFC 2966、2000年10月。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[3] Callon, R.W., \"Use of OSI IS-IS for routing in TCP/IP and dual environments\", RFC 1195, December 1990",
      "ja": "[3] Callon、R.W。、「TCP/IPおよびデュアル環境でのルーティングのためのOSI IS-I-ISの使用」、RFC 1195、1990年12月"
    },
    {
      "indent": 3,
      "text": "[4] Awduche, D., Malcolm, J., Agogbua, J., O'Dell, M. and J. McManus, \"Requirements for Traffic Engineering Over MPLS\", RFC 2702, September 1999.",
      "ja": "[4] Awduche、D.、Malcolm、J.、Agogbua、J.、O'Dell、M。、およびJ. McManus、「MPLS上の交通工学要件」、RFC 2702、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[5] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[5] Narten、T。およびH. Alvestrand、「RFCSでIANA考慮事項セクションを書くためのガイドライン」、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document raises no new security issues for IS-IS.",
      "ja": "このドキュメントは、IS-ISの新しいセキュリティの問題を提起しません。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgments",
      "section_title": true,
      "ja": "9. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Yakov Rekhter and Dave Katz for their comments on this work.",
      "ja": "著者は、Yakov RekhterとDave Katzがこの作品についてコメントしてくれたことに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "10. Authors' Addresses",
      "section_title": true,
      "ja": "10. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Henk Smit",
      "ja": "ヘンクスミット"
    },
    {
      "indent": 3,
      "text": "EMail: hhwsmit@xs4all.nl",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Tony Li",
      "ja": "トニー・リー"
    },
    {
      "indent": 3,
      "text": "EMail: tony.li@tony.li",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "11. Full Copyright Statement",
      "section_title": true,
      "ja": "11. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（c）The Internet Society（2004）。この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、この文書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスがどの程度であるかについての使用に関連すると主張する可能性があるという立場はありません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要な技術をカバーする可能性のあるその他の独自の権利を注意深く招待するよう招待しています。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}