{
  "title": {
    "text": "RFC 3011 - The IPv4 Subnet Selection Option for DHCP",
    "ja": "RFC 3011 - DHCPのIPv4サブネット選択オプション"
  },
  "number": 3011,
  "created_at": "2019-10-18 21:50:45.344166+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          G. Waters\nRequest for Comments: 3011                               Nortel Networks\nCategory: Standards Track                                  November 2000",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 15,
      "text": "The IPv4 Subnet Selection Option for DHCP",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines a new Dynamic Host Configuration Protocol (DHCP) option for selecting the subnet on which to allocate an address. This option would override a DHCP server's normal methods of selecting the subnet on which to allocate an address for a client.",
      "ja": "このメモは、アドレスを割り当てるためのサブネットを選択するための新しい動的ホスト構成プロトコル（DHCP）オプションを定義します。このオプションは、クライアントのアドレスを割り当てるためのサブネットを選択するDHCPサーバの通常のメソッドをオーバーライドします。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction..................................................1\n1.1. Motivational Example........................................2\n2. Subnet Selection Option Definition............................3\n3. Intellectual Property.........................................4\n4. IANA Considerations...........................................4\n5. Acknowledgements..............................................5\n6. Security Considerations.......................................5\n7. References....................................................5\n8. Editor's Addresses............................................6\n9. Full Copyright Statement......................................7",
      "raw": true,
      "ja": "1.はじめに\n1.1。モチベーション例\n2.サブネット選択オプション定義\n3.知的財産\n4. IANAの考慮事項\n5.謝辞\n6.セキュリティの考慮事項\n7.参考\n8.編集者のアドレス\n9.完全な著作権声明"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Dynamic Host Configuration Protocol (DHCP) [RFC2131] provides a framework for passing configuration information to hosts on a TCP/IP network. RFC 2132 [RFC2132] specifies DHCP option configuration information that may be carried in DHCP packets to/from the DHCP server and the DHCP client. This document specifies a new DHCP option.",
      "ja": "動的ホスト構成プロトコル（DHCP）[RFC2131]はTCP / IPネットワーク上のホストに設定情報を渡すためのフレームワークを提供します。 RFC 2132 [RFC2132]はに/ DHCPサーバとDHCPクライアントからのDHCPパケットで行うことができるDHCPオプション構成情報を指定します。この文書は、新しいDHCPオプションを指定します。"
    },
    {
      "indent": 3,
      "text": "To select the subnet on which to allocate an address, the DHCP server determines the subnet from which the request originated, and then selects an address on the originating subnet or on a subnet that is on the same network segment as the originating subnet. The subnet from which the request originates can be determined by:",
      "ja": "アドレスを割り当てるためにサブネットを選択するために、DHCPサーバは、要求が発信されたサブネットを決定し、その後、元のサブネット上または元のサブネットと同じネットワークセグメント上にあるサブネット上のアドレスを選択します。要求の発信元により決定することができるサブネット。"
    },
    {
      "indent": 3,
      "text": "o Using the subnet address of the giaddr field in the DHCP packet header, or if the giaddr field is zero;",
      "ja": "DHCPパケットヘッダのgiaddrフィールドのサブネットアドレスを使用して、O、またはgiaddrフィールドがゼロである場合、"
    },
    {
      "indent": 3,
      "text": "o Using the subnet address of the local interface on which the DHCP server received the packet.",
      "ja": "DHCPサーバがパケットを受信したローカルインターフェイスのサブネットアドレスを使用して、O。"
    },
    {
      "indent": 3,
      "text": "This memo defines a new DHCP option, the subnet selection option, which allows the DHCP client to specify the subnet on which to allocate an address. This option takes precedence over the methods that the DHCP server uses to determine the subnet on which to select an address.",
      "ja": "このメモは、DHCPクライアントがアドレスを割り当てるためのサブネットを指定することができ、新たなDHCPオプション、サブネット選択オプションを定義します。このオプションでは、DHCPサーバーがアドレスを選択する上でのサブネットを決定するために使用する方法よりも優先されます。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.1. Motivational Example",
      "section_title": true,
      "ja": "1.1。モチベーション例"
    },
    {
      "indent": 3,
      "text": "An example of where this option could be useful is in a device (e.g.: a RAS device) that is allocating addresses on behalf of its clients. In this case the device would be allocating addresses through DHCP and then managing those addresses among its clients.",
      "ja": "このオプションは有用であり得る場合の例は、そのクライアントのためにアドレスを割り当てているデバイス（例えば：RAS装置）です。この場合、デバイスは、DHCPを通じてアドレスを割り当てることになると、そのクライアントの間でこれらのアドレスを管理します。"
    },
    {
      "indent": 3,
      "text": "In this scenario, the device is connected to a private \"internal\" network on which the DHCP server would be located. The device is also connected to one or more service providing \"external\" networks (i.e.: the networks that the device's clients are connected to). Furthermore, the internal network is not IP connected to the external networks, although inside the device there is connectivity between the internal and external networks (e.g.: though the backplane).",
      "ja": "このシナリオでは、デバイスはDHCPサーバが配置されるであろうにプライベート「内部」ネットワークに接続されています。デバイスはまた、「外部」ネットワーク（すなわち：デバイスのクライアントが接続されているネットワーク）を提供する1つの以上のサービスに接続されています。デバイス内の内部と外部ネットワーク（例えば：バックプレーンが）間の接続はあるがさらに、内部ネットワークは、外部ネットワークに接続されたIPありません。"
    },
    {
      "indent": 3,
      "text": "Recall that the device is allocating addresses for its clients on the external networks and that there is no IP connectivity between the internal network and the external networks. The DHCP requests cannot originate from the external networks since packets cannot be routed between the external network and the internal network. Thus, the DHCP requests must originate from the internal network. The problem with originating the DHCP requests from the internal network is that the DHCP server will allocate addresses on the internal network's subnet, when what is required are addresses on the external subnets. The subnet selection option provides a solution to this problem.",
      "ja": "デバイスは、外部ネットワーク上のクライアントにアドレスを割り当てるされていることを、内部ネットワークと外部ネットワークの間にIP接続が存在しないことを思い出してください。パケットが外部ネットワークと内部ネットワークの間でルーティングすることはできませんので、DHCP要求は、外部ネットワークから発信することはできません。このように、DHCP要求は、内部ネットワークから発信する必要があります。何が必要な場合に、内部ネットワークからのDHCP要求を発信するとの問題は、DHCPサーバは、内部ネットワークのサブネット上のアドレスを割り当てることです外部のサブネット上のアドレスです。サブネット選択オプションは、この問題に対する解決策を提供します。"
    },
    {
      "indent": 3,
      "text": "The device would send its DHCP request on the internal subnet, but would include the subnet selection option containing the address of the external subnet on which it requires the address. The subnet selection option instructs the DHCP server to allocate the address on the requested subnet as opposed to the normal operation of allocating the address on the subnet from which the DHCP request originated.",
      "ja": "デバイスは、内部サブネット上のDHCP要求を送信しますが、それはアドレスを必要とする上で、外部サブネットのアドレスを含むサブネット選択オプションが含まれます。サブネット選択オプションは、DHCP要求の発信元のサブネット上にアドレスを割り当てる通常の動作とは対照的に、要求されたサブネット上にアドレスを割り当てるDHCPサーバに指示します。"
    },
    {
      "indent": 0,
      "text": "2. Subnet Selection Option Definition",
      "section_title": true,
      "ja": "2.サブネット選択オプション定義"
    },
    {
      "indent": 3,
      "text": "The subnet selection option is a DHCP option. The option contains a single IPv4 address that is the address of a subnet. The value for the subnet address is determined by taking any IPv4 address on the subnet and ANDing that address with the subnet mask (i.e.: the network and subnet bits are left alone and the remaining (address) bits are set to zero). When the DHCP server is configured to respond to this option, is allocating an address, and this option is present then the DHCP server MUST allocate the address on either:",
      "ja": "サブネット選択オプションは、DHCPオプションです。オプションは、サブネットのアドレスである単一のIPv4アドレスが含まれています。サブネットアドレスの値がサブネットマスクとアドレスのサブネットとの論理積上のIPv4アドレスを取ることによって決定された（すなわち：ネットワークとサブネットビットが放置され、残りの（アドレス）のビットはゼロに設定されます）。 DHCPサーバは、このオプションに応答するように構成されている場合は、DHCPサーバがどちらかにアドレスを割り当てる必要がありますアドレスを割り当て、このオプションが存在しています。"
    },
    {
      "indent": 3,
      "text": "o the subnet specified in the subnet selection option, or;",
      "ja": "サブネット選択オプションで指定されたサブネットO、または;"
    },
    {
      "indent": 3,
      "text": "o a subnet on the same network segment as the subnet specified in the subnet selection option.",
      "ja": "サブネット選択オプションで指定されたサブネットと同じネットワークセグメント上のサブネットO。"
    },
    {
      "indent": 3,
      "text": "The format of the option is:",
      "ja": "オプションの形式は次のとおりです。"
    },
    {
      "indent": 7,
      "text": " Code   Len        IPv4 Address\n+-----+-----+-----+-----+-----+-----+\n| 118 |  4  | A1  | A2  | A3  | A4  |\n+-----+-----+-----+-----+-----+-----+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Servers configured to support this option MUST return an identical copy of the option to any client that sends it, regardless of whether or not the client requests the option in a parameter request list. Clients using this option MUST discard DHCPOFFER or DHCPACK packets that do not contain this option.",
      "ja": "このオプションをサポートするように設定されたサーバに関係なく、クライアントがパラメータ要求リスト内のオプションを要求したかどうかの、それを送信し、任意のクライアントにオプションの同一のコピーを返さなければなりません。このオプションを使用しているクライアントは、このオプションが含まれていないDHCPOFFERまたはDHCPACKパケットを捨てなければなりません。"
    },
    {
      "indent": 3,
      "text": "This option does not require changes to operations or features of the DHCP server other than to select the subnet on which to allocate an address. For example, the handling of DHCPDISCOVER for an unknown subnet should continue to operate unchanged.",
      "ja": "このオプションは、操作やアドレスを割り当てるためのサブネットを選択するよりも、他のDHCPサーバーの機能を変更する必要はありません。例えば、未知のサブネットのDHCPDISCOVERの取り扱いは変わらずに動作し続ける必要があります。"
    },
    {
      "indent": 3,
      "text": "When this option is present and the server is configured to support this option, the server MUST NOT offer an address that is not on the requested subnet or network segment. Servers that do not understand this option will allocate an address using their normal algorithms and will not return this option in the DHCPOFFER or DHCPACK. In this case the client will discard the DHCPOFFER or DHCPACK. Servers that understand this option but are administratively configured to ignore the option MUST ignore the option, use their normal algorithms to allocate an address, and MUST NOT return this option in the DHCPOFFER or DHCPACK. In this case the client will discard the DHCPOFFER or DHCPACK.",
      "ja": "このオプションが存在し、サーバがこのオプションをサポートするように設定されている場合、サーバは要求されたサブネットまたはネットワークセグメント上に存在しないアドレスを提供してはいけません。このオプションを理解していないサーバは、それらの通常のアルゴリズムを使用してアドレスを割り当てますし、DHCPOFFERまたはDHCPACKには、このオプションを返しません。この場合、クライアントはDHCPOFFERまたはDHCPACKを破棄します。このオプションを理解しますが、管理上のオプションを無視するように設定されているサーバは、オプションを無視したアドレスを割り当てるために、それらの通常のアルゴリズムを使用し、DHCPOFFERまたはDHCPACKには、このオプションを返してはならないしなければなりません。この場合、クライアントはDHCPOFFERまたはDHCPACKを破棄します。"
    },
    {
      "indent": 3,
      "text": "During an address renew, the DHCP server may send a DHCPACK directly to the allocated address, however packets from the DHCP server may not be routable to the address. Thus, in all packets that the DHCP client sends that contain the subnet selection option, the giaddr field in the BOOTP header MUST be set to an IPv4 address on which the DHCP client will accept DHCP packets (e.g.: the address on the subnet connected to the internal network).",
      "ja": "アドレス更新時には、DHCPサーバは、DHCPサーバからのパケットをアドレスにルーティング可能ではないかもしれないが、割り当てられたアドレスに直接DHCPACKを送信することができます。このように、サブネット選択オプションが含まれているDHCPクライアントが送信するすべてのパケットに、BOOTPヘッダー内のgiaddrフィールドは、DHCPクライアントが（DHCPパケットを受け入れる上でのIPv4アドレスに設定しなければならない例：に接続されたサブネット上のアドレス内部ネットワーク）。"
    },
    {
      "indent": 3,
      "text": "The IPv4 address to which a DHCP server sends a reply to MUST be the same as it would chose when this option is not present.",
      "ja": "DHCPサーバへのIPv4アドレスは、このオプションが存在しない場合、それは選択したのと同じでなければならないために応答を送信します。"
    },
    {
      "indent": 0,
      "text": "3. Intellectual Property",
      "section_title": true,
      "ja": "3.知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11.",
      "ja": "IETFは、そのような権限下で、ライセンスがたりないかもしれない可能性があるためにどの本書または程度に記載されている技術の実装や使用に関係すると主張される可能性があります任意の知的財産やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能。また、そうした権利を特定するために取り組んできたことを表していないん。スタンダードトラックおよび標準関連文書における権利に関するIETFの手続きの情報は、BCP-11に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "権利の主張のコピーは、出版のために利用可能とライセンスの保証が利用できるようにする、あるいは本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、その注意にこの標準を実践するために必要な場合があり技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 IETF専務に情​​報を扱ってください。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned a value of 118 for the DHCP option code described in this document.",
      "ja": "IANAは、この文書に記載されたDHCPオプションコードのために118の値を割り当てました。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "ja": "5.謝辞"
    },
    {
      "indent": 3,
      "text": "This document is the result of work undertaken the by DHCP working group. Thanks to Ted Lemon, Tim Aston and Ralph Droms for their helpful comments in this work.",
      "ja": "この文書では、DHCPワーキンググループによって行われ、作業の結果です。この作品で彼らの有益なコメントのためのテッド・レモン、ティム・アストンとラルフDromsに感謝します。"
    },
    {
      "indent": 3,
      "text": "W. Mark Townsley and Pratik Gupta originally published a subnet selection option Internet Draft in July 1997. The work in this document was not based on the original work but it does achieve the same goals.",
      "ja": "W.マークTownsleyとPratik Gupta氏は当初、このドキュメントで1997年7月に仕事をサブネット選択オプションのインターネットドラフトを発表オリジナル作品に基づいていますが、同じ目標を達成していませんでした。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "DHCP currently provides no authentication or security mechanisms. Potential exposures to attack are discussed is section 7 of the protocol specification [RFC2131].",
      "ja": "DHCPは現在、認証やセキュリティメカニズムを提供していません。攻撃に対する潜在的エクスポージャーは、プロトコル仕様[RFC2131]のセクション7で論じられています。"
    },
    {
      "indent": 3,
      "text": "The subnet selection option allows for the DHCP client to specify the subnet on which to allocate an address. This would allow a client to perform a more complete address-pool exhaustion attack since the client would no longer be restricted to attacking address-pools on just its local subnet.",
      "ja": "サブネット選択オプションは、アドレスを割り当てるためのサブネットを指定するには、DHCPクライアントが可能になります。これにより、クライアントはもはや単なるそのローカルサブネット上のアドレス・プールを攻撃に制限されないであろうため、クライアントは、より完全なアドレス・プール枯渇攻撃を実行できるようになります。"
    },
    {
      "indent": 3,
      "text": "Servers that implement the subnet selection option MUST by default disable use of the feature; it must specifically be enabled through configuration. Moreover, a server SHOULD provide the ability to selectively enable use of the feature under restricted conditions, e.g., by enabling use of the option only from explicitly configured client-ids, enabling its use only by clients on a particular subnet, or restricting the subnets (as indicated in the subnet selection option) from which addresses may be requested.",
      "ja": "サブネット選択オプション機能のデフォルトはdisableの使用によってMUSTを実装するサーバー。それは、具体的な構成を使用して有効にする必要があります。また、サーバは、明示的にのみ構成されているクライアントのIDからオプションの使用を可能にする特定のサブネット上のクライアントだけでその使用を可能にする、またはサブネットを制限することにより、例えば、選択的に制限された条件下での機能の使用を可能にする機能を提供すべきです（サブネット選択オプションに示されるように）要求することができるアドレスれます。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2131] Droms, R. \"Dynamic Host Configuration Protocol\", RFC 2131, March 1997.",
      "ja": "[RFC2131] Droms、R.、 \"動的ホスト構成プロトコル\"、RFC 2131、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2132] Alexander, S. and R. Droms, \"DHCP Options and BOOTP Vendor Extensions\", RFC 2132, March 1997.",
      "ja": "[RFC2132]アレクサンダー、S.とR. Droms、 \"DHCPオプションとBOOTPベンダー拡張機能\"、RFC 2132、1997年3月。"
    },
    {
      "indent": 0,
      "text": "8. Editor's Address",
      "section_title": true,
      "ja": "8.編集者の住所"
    },
    {
      "indent": 3,
      "text": "Glenn Waters Nortel Networks 310-875 Carling Avenue, Ottawa, Ontario K1S 5P1 Canada",
      "ja": "グレン・ウォーターズノーテル310から875カーリングアベニュー、オタワ、オンタリオ州K1S 5P1カナダ"
    },
    {
      "indent": 3,
      "text": "Phone: +1 613-765-0249 EMail: gww@nortelnetworks.com",
      "ja": "電話：+1 613-765-0249電子メール：gww@nortelnetworks.com"
    },
    {
      "indent": 0,
      "text": "9. Full Copyright Statement",
      "section_title": true,
      "ja": "9.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2000). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2000）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}