{
  "title": {
    "text": "RFC 3688 - The IETF XML Registry",
    "ja": "RFC 3688 - IETF XMLレジストリ"
  },
  "number": 3688,
  "created_at": "2019-10-21 03:00:43.343650+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        M. Mealling\nRequest for Comments: 3688                                VeriSign, Inc.\nBCP: 81                                                     January 2004\nCategory: Best Current Practice",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 25,
      "text": "The IETF XML Registry",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントはインターネットコミュニティのためのインターネットBest Current Practicesを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2004）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes an IANA maintained registry for IETF standards which use Extensible Markup Language (XML) related items such as Namespaces, Document Type Declarations (DTDs), Schemas, and Resource Description Framework (RDF) Schemas.",
      "ja": "このドキュメントは、IANAが拡張マークアップ言語（XML）などの名前空間、文書型宣言（DTDの）、スキーマ、およびリソース記述フレームワーク（RDF）スキーマなどの関連アイテムを使用するIETF標準のレジストリを維持して説明します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Over the past few years, the Extensible Markup Language (XML) [W3C.REC-xml] has become a widely used method for data markup. There have already been several IETF Working Groups that have produced standards that define XML Document Type Definitions (DTDs), XML Namespaces [W3C.REC-xml-names], and XML Schemas [W3C.REC-xmlschema-1]. Each one of these technologies uses Uniform Resource Identifiers (URIs) [RFC2396] and other standardized identifiers to identify various components.",
      "ja": "過去数年間、拡張マークアップ言語（XML）[W3C.REC-XML]は、データマークアップのために広く用いられている方法となっています。すでにいくつかのXML文書型定義（DTDの）定義の標準を生産しているIETFワーキンググループ、XML名前空間[W3C.REC-XML-名]、およびXMLスキーマ[W3C.REC-XMLSCHEMA-1]がありました。これらの技術の各々は、様々な構成要素を識別するために、ユニフォームリソース識別子（URIの）[RFC2396]及び他の標準化された識別子を使用します。"
    },
    {
      "indent": 3,
      "text": "For example, while it has been the practice within some standards that use Document Type Definitions (DTDs) to forego the use of the PUBLIC identifiers in favor of 'well known' SYSTEM identifiers, it has proven to be more trouble than its worth to attempt to standardize SYSTEM identifiers. The result is that several IETF standards that have simply created non-resolvable URIs in order to simply identify but not resolve the DTD for some given XML document.",
      "ja": "それはよく知られている 'SYSTEM識別子の賛成でPUBLIC識別子の使用を控えるために文書型定義（DTDを）使用し、いくつかの規格内で行われてきた一方で、例えば、それはその価値を試みるよりも、多くの問題であることが証明されましたシステム識別子を標準化します。結果は、単に順番に解像不可能なURIを作成しているいくつかのIETF標準は、単に識別が、いくつかの指定されたXML文書のDTDを解決しないようにということです。"
    },
    {
      "indent": 3,
      "text": "This document seeks to standardize and improve these practices by creating an IANA maintained registry of XML element identifiers so that document authors and implementors have a well maintained and authoritative location for their XML elements. As part of this standard, the IANA will maintain:",
      "ja": "この文書は、文書の作成者と実装者は、そのXML要素のためのよく維持され、権威ある場所を持っているように、XML要素識別子のIANA維持し、レジストリを作成することにより、これらのプラクティスを標準化し、改善することを目的とします。この規格の一部として、IANAが維持されます："
    },
    {
      "indent": 3,
      "text": "o the public representation of the document,",
      "ja": "O文書の公開表現、"
    },
    {
      "indent": 3,
      "text": "o the URI for the elements if one is provided at the time of registration,",
      "ja": "要素のためのURI Oいずれかが登録時に提供される場合、"
    },
    {
      "indent": 3,
      "text": "o a registry of Public Identifiers as URIs.",
      "ja": "URIとして公開識別子のレジストリO。"
    },
    {
      "indent": 3,
      "text": "In the case where the registrant does not request a particular URI, the IANA will assign it a Uniform Resource Name (URN) that follows [RFC3553].",
      "ja": "登録者は、特定のURIを要求しない場合には、IANAは、ユニフォームリソース名[RFC3553]を以下の（URN）が割り当てられます。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14、RFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Registerable Documents",
      "section_title": true,
      "ja": "3.登録可能ドキュメント"
    },
    {
      "indent": 0,
      "text": "3.1. The Assigned/Registered URI",
      "section_title": true,
      "ja": "3.1. 割り当て/登録URI"
    },
    {
      "indent": 3,
      "text": "All elements (except PUBLIC identifiers) in this registry will require a URI in order to be registered. If the registrant wishes to have a URI assigned, then a URN of the form",
      "ja": "このレジストリ内（PUBLIC識別子を除く）すべての要素を登録するために、URIが必要になります。登録者は、フォームのURIに割り当てられ、その後、URNを持っているしたい場合"
    },
    {
      "indent": 6,
      "text": "urn:ietf:params:xml:<class>:<id>",
      "ja": "URN：IETF：のparams：XML：<クラス>：<ID>"
    },
    {
      "indent": 3,
      "text": "will be assigned where <class> is the type of the document being registered (see below). <id> is a unique id generated by the IANA based on any means the IANA deems necessary to maintain uniqueness and persistence. NOTE: in order for a URN of this type to be assigned, the item being registered MUST have been through the IETF consensus process. Basically, this means that it must be documented in a RFC. The RFC 3553 [RFC3553] URN registration template is found in Section 6.",
      "ja": "（下記参照）<クラス>は、登録されている文書のタイプである場合に割り当てられます。 <ID>は、任意に基づいて、IANAによって生成された固有のIDであることはIANAが一意性と持続性を維持するために必要と認めることを意味します。注：割り当てられるために、この種のURNためには、登録されているアイテムは、IETFの合意プロセスを経てされている必要があります。基本的に、これはRFCで文書化されなければならないことを意味しています。 RFC 3553 [RFC3553] URN登録テンプレートは、第6節で発見されました。"
    },
    {
      "indent": 3,
      "text": "The IANA will also maintain a file server available via at least HTTP and FTP that contains all of the registered elements in some publicly accessible file space in the same way that all of the IANA's registered elements are available via http://www.iana.org/assignments/. While the directory structure of this server is up to the IANA, it is suggested that the files be organized by the <class> and the individual files have the <id> as their filename.",
      "ja": "//www.iana：IANAはまた、すべてのIANAの登録の要素は、http経由で利用可能であることを、少なくともHTTPと同じようにいくつかの公的にアクセス可能なファイル・スペースにおける登録のすべての要素が含まれているFTP経由で利用可能なファイルサーバを維持しますORG /割り当て/。このサーバーのディレクトリ構造はIANAまでですが、ファイルは、<クラス>が主催することが示唆されており、個々のファイルは、ファイル名として<id>を持っています。"
    },
    {
      "indent": 3,
      "text": "Implementors are warned that they should not programatically rely on those resources being available or the directory structure remaining static for any reason. It is explicitly recognized that some software tools attempt to download DTDs, schema, etc., 'on the fly' and that developers should understand when this is done and when to not reference IANA network resources as a 'schema download repository'. This is the reason that the IANA will not register or provide SYSTEM identifiers.",
      "ja": "実装者は、彼らがプログラム的にそれらのリソースが利用可能である、またはディレクトリ構造が何らかの理由で静的残りに頼るべきではないと警告しています。明示的にいくつかのソフトウェアツールは、「その場で」などのDTD、スキーマを、ダウンロードしようとしていることと、これが行われるとするとき「スキーマ・ダウンロード・リポジトリ」としてIANAネットワークのリソースを参照しないようにする場合、開発者が理解しておくべきことが認識されています。これは、IANAが登録またはシステム識別子を提供することはありません理由です。"
    },
    {
      "indent": 0,
      "text": "3.2. Registerable Classes",
      "section_title": true,
      "ja": "3.2. 登録可能クラス"
    },
    {
      "indent": 3,
      "text": "The list of types of XML elements that can be registered with the IANA are:",
      "ja": "IANAに登録することができ、XML要素のタイプのリストは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "publicid -- An XML document that contains a DOCTYPE declaration or any other external reference can identify that reference via both a PUBLIC identifier and a SYSTEM identifier. The SYSTEM identifier is system-specific information that enables the entity manager of an XML system to locate the file, memory location, or pointer within a file where the entity can be found. It should also be noted that a system identifier could be an invocation of a program that controls access to an entity that is being identified. Thus, they are not registered items. In many cases, SYSTEM identifiers are also URIs. However, in these cases, the URI is still only used for system-specific information. In the case where a PUBLIC Identifier is also a URI, it is possible for the SYSTEM Identifier to contain the same URI but this behavior is not recommended unless its side effects are well known and understood to not cause any unacceptable harm.",
      "ja": "publicId  -  DOCTYPE宣言または公開識別子及びシステム識別子の両方を介して、そのリファレンスを識別することができる他の任意の外部参照を含むXML文書。システム識別子は、エンティティを見つけることができるファイル内のファイル、メモリ位置、またはポインタを見つけるためにXMLシステムのエンティティ・マネージャを可能にするシステム固有の情報です。また、システム識別子が識別されたエンティティへのアクセスを制御するプログラムの呼び出しであることに留意すべきです。このように、彼らはアイテムを登録されていません。多くの場合、システム識別子ものURIです。しかし、これらの例では、URIはまだシステム固有の情報にのみ使用されます。公開識別子はまた、URIである場合には、それは同じURIを格納するためのシステム識別子は可能であるが、その副作用はよく知られており、任意の許容できない害を起こさないために理解されない限り、この動作は推奨されません。"
    },
    {
      "indent": 6,
      "text": "A PUBLIC identifier is a name that is intended to be meaningful across systems and different user environments. Typically, it will be a name that has a registered owner associated with it, so that public identifiers will be guaranteed unique and no two entities will have the same public identifier. In practice, PUBLIC identifiers are typically Formal Public Identifiers [ISO.8879.1986] but they are not restricted to just that set. As said in [RFC3151]:",
      "ja": "公開識別子は、システムと異なるユーザ環境全体有意義であることが意図される名前です。公開識別子が一意で保証され、何の2つのエンティティが同じ公開識別子を持っていませんように一般的に、それは、それに関連付けられた登録所有者を持っている名前になります。実際には、PUBLIC識別子は通常、公式公開識別子[ISO.8879.1986]ですが、彼らはちょうどそのセットに制限されていません。 [RFC3151]で述べたように："
    },
    {
      "indent": 9,
      "text": "\"Any string which consists only of the public identifier characters (defined by Production 13 of Extensible Markup Language (XML) 1.0 Second Edition) is a legal public identifier.\"",
      "ja": "「（拡張マークアップ言語（XML）1.0 Second Editionのの生産13によって定義される）のみ公開識別子文字から構成される任意の文字列には、法律上の公開識別子です。」"
    },
    {
      "indent": 6,
      "text": "Therefore, it is legal for a PUBLIC identifier to be a URN if it adheres to the character set restrictions.",
      "ja": "それは文字セットの制限に付着した場合PUBLIC識別子はURNであるためにそのため、それが合法です。"
    },
    {
      "indent": 6,
      "text": "Thus, the identifier registered along with a DTD is its PUBLIC identifier. The only restriction being that it must adhere to the character set restrictions. In the case where the registrant does not provide one, the IANA will assign one of the form 'urn:ietf:params:xml:pi:<id>'. Registrants are encouraged to investigate RFC 3151 [RFC3151] as a recommended method for minting a URN that can also be represented as an FPI.",
      "ja": "したがって、DTDと一緒に登録された識別子は、その公開識別子です。唯一の制限は、それが文字セットの制限を遵守しなければならないということで。登録者が1つを提供しない場合には、IANAは、フォームの一割り当てる「URNを：IETF：paramsは：XML：PI：<ID>」。登録はまた、FPIのように表すことができるURNを鋳造するための推奨方法としてRFC 3151 [RFC3151]を調査することが奨励されます。"
    },
    {
      "indent": 3,
      "text": "ns -- XML Namespaces [W3C.REC-xml-names] are named by a URI. They have no real, machine-parseable representation. Thus, the registered document will be either the specification or a reference to it. In the case where a URI is not provided by the registrant, the IANA will assign a URN of the form 'urn:ietf:params:xml:ns:<id> which will be the XML Namespace's name.",
      "ja": "NS  -  XML名前空間[W3C.REC-XML-名]はURIによって命名されています。彼らは本当、機械解析可能な表現を持っていません。このように、登録された文書は、明細書又はそれへの参照のいずれかであろう。 IETF：paramsは：XML：NS：<ID> XML名前空間の名前であろうURIが登録者によって提供されていない場合には、IANAは、フォーム「URNのURNを割り当てます。"
    },
    {
      "indent": 3,
      "text": "schema -- XML Schemas [W3C.REC-xmlschema-1] are also identified by a URI but their contents are machine parseable. The IANA registered document will be the XML Schema file. The URN the IANA assigns can be used as the URI for the schema and is of the form 'urn:ietf:params:xml:schema:<id>'.",
      "ja": "スキーマ -  XMLスキーマ[W3C.REC-XMLSCHEMA-1]もURIによって識別されるが、その内容は、機械解析可能です。 IANA登録された文書はXMLスキーマファイルになります。 URN IANAの割り当ては、スキーマのURIとして使用し、フォーム「URN：IETF：paramsは：XML：スキーマ：<ID>」であることができます。"
    },
    {
      "indent": 3,
      "text": "rdfschema -- The Resource Description Format (RDF) [W3C.CR-rdf-schema] is an XML serialization of a connected graph based data model used for metadata expression. RDF makes use of schemas for RDF that express grammars about relationships between URIs. These grammars are identified by URIs. The URN assigned by the IANA can be used as the identifying URI and is of the form 'urn:ietf:params:xml:rdfschema:<id>'.",
      "ja": "rdfschema  - リソース記述フォーマット（RDF）[W3C.CR-rdfschema]は、メタデータの発現のために使用される連結グラフベースのデータモデルのXMLシリアル化です。 RDFは、URIの間の関係についての文法を表現するRDFのスキーマを使用しています。これらの文法はURIので識別されます。 '<ID> URN：IETF：paramsは：XML：rdfschema' IANAによって割り当てられたURNは識別URIとして使用形態であることができます。"
    },
    {
      "indent": 0,
      "text": "4. Registration Procedures",
      "section_title": true,
      "ja": "4.登録手順"
    },
    {
      "indent": 3,
      "text": "Until the IANA requests or implements an automated process for the registration of these elements, any specifications must make that request part of the IANA considerations section of their respective documents. That request must be in the form of the following template:",
      "ja": "IANA要求またはこれらの要素を登録するための自動化されたプロセスを実装するまでは、任意の仕様はその要求、それぞれの文書のIANAの考慮セクションの一部にする必要があります。その要求は、以下のテンプレートの形式でなければなりません。"
    },
    {
      "indent": 3,
      "text": "URI The URI or PUBLIC identifier that identifies the XML component. If the registrant is requesting that the IANA assign a URI then this field should be specified as \"please assign\".",
      "ja": "URI URIまたはXML要素を識別する公開識別子。登録者がIANAは、URIを割り当てることを要求している場合、このフィールドには、「割り当ててください」と指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "Registrant Contact The individual/organization that is the registration contact for the component being registered. Ideally, this will be the name and pertinent physical and network contact information. In the case of IETF developed standards, the Registrant will be the IESG.",
      "ja": "登録者連絡先に登録されているコンポーネントの登録連絡先である個人/団体。理想的には、これは名前と適切な物理的およびネットワークの連絡先情報となります。 IETF開発された標準の場合には、登録者はIESGになります。"
    },
    {
      "indent": 3,
      "text": "XML The exact XML to be stored in the registry. Unless the beginning and end of the file is obvious, the document should use the text \"BEGIN\" to mark the beginning of the file and \"END\" to mark the end of the file. The IANA will insert any text between those two strings (minus any page breaks and RFC formatting inserted by the RFC Editor) into the file kept in the repository.",
      "ja": "XML正確なXMLは、レジストリに格納されます。ファイルの始まりと終わりが明白である場合を除き、文書がファイルの終わりをマークするために、ファイルの先頭と「END」をマークするために、「BEGIN」のテキストを使用する必要があります。 IANAは、リポジトリに保存ファイルに（RFC編集者によって挿入マイナス任意の改ページとRFC形式）これら2つの文字列の間の任意のテキストを挿入します。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The information maintained by the IANA will be authoritative and will be a target for attack. In some cases, such as XML Schema and DTDs, the content maintained by the IANA may be directly input into software. Thus, extra care should be taken by the IANA to maintain the security precautions required for an important reference location for the Internet.",
      "ja": "IANAによって維持された情報は、権威になり、攻撃の対象となります。このようなXMLスキーマとDTDのようないくつかのケースでは、IANAによって維持されるコンテンツは、ソフトウェアに直接入力してもよいです。このように、特別な注意は、インターネットのための重要な基準位置のために必要なセキュリティ対策を維持するために、IANAによって取られるべきです。"
    },
    {
      "indent": 3,
      "text": "Beyond this concern, there are no other security considerations not already found with any other IANA registry.",
      "ja": "この問題を超えて、すでに他のIANAレジストリでは見られない他のセキュリティの考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document seeks to create a rather large registry for which the IANA (at the direction of the IESG) will be primarily responsible. The amount of effort required to maintain this registry is not insignificant and the policies and procedures surrounding any approval process are non-trivial. The registry is on a First Come First Served basis, but a Specification is Required. Once the IETF has some experience with this registry, these policies may change.",
      "ja": "この文書は、（IESGの方向で）IANAが主に担当されるためにかなり大規模なレジストリを作成しようとしています。このレジストリを維持するために必要な努力の量は微々たるものではなく、任意の承認プロセスを囲む方針と手続きは非自明です。レジストリが最初に来る最初に添え基づいているが、仕様が必要です。 IETFは、このレジストリといくつかの経験を持っていたら、これらのポリシーは変更されることがあります。"
    },
    {
      "indent": 3,
      "text": "RFC 3553 [RFC3553] specifies that any new registry requiring a name, to be assigned below the 'urn:ietf:params' namespace and must specify the structure of that space in template form. The IANA has created and will maintain this new sub-namespace:",
      "ja": "名前空間とテンプレートの形でその空間の構造を指定する必要がありますRFC 3553 [RFC3553]は名前を必要とするすべての新しいレジストリは、「：IETFのparams壷」の下に割り当てられることを指定します。 IANAは、作成していると、この新しいサブ名前空間を維持します。"
    },
    {
      "indent": 3,
      "text": "Registry-name: xml",
      "ja": "レジストリ名：XML"
    },
    {
      "indent": 3,
      "text": "Specification: This document contains the registry specification. The namespace is organized with one sub-namespace which is the <id>.",
      "ja": "仕様：このドキュメントは、レジストリの仕様が含まれています。名前空間は、<ID>は、一つのサブ名前空間に編成されます。"
    },
    {
      "indent": 3,
      "text": "Repository: To be assigned according to the guidelines found above.",
      "ja": "リポジトリ：上記見つかったガイドラインに従って割り当てられます。"
    },
    {
      "indent": 3,
      "text": "Index value: The class name",
      "ja": "インデックスの値：クラス名"
    },
    {
      "indent": 0,
      "text": "7. Normative References",
      "section_title": true,
      "ja": "7.引用規格"
    },
    {
      "indent": 3,
      "text": "[ISO.8879.1986] International Organization for Standardization, \"Information processing - Text and office systems - Standard generalized markup language (SGML)\", ISO Standard 8879, 1986.",
      "ja": "[ISO.8879.1986]国際標準化機構、「情報処理 - テキストとオフィスシステム - 標準一般化マークアップ言語（SGML）」、ISO規格8879、1986。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2396] Berners-Lee, T., Fielding, R. and L. Masinter, \"Uniform Resource Identifiers (URI): Generic Syntax\", RFC 2396, August 1998.",
      "ja": "[RFC2396]バーナーズ=リー、T.、フィールディング、R.、およびL. Masinter、 \"統一資源識別子（URI）：一般的な構文\"、RFC 2396、1998年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3151] Walsh, N., Cowan, J. and P. Grosso, \"A URN Namespace for Public Identifiers\", RFC 3151, August 2001.",
      "ja": "[RFC3151]ウォルシュ、N.、コーワン、J.とP.グロッソ、 \"公開識別子のためのURN名前空間\"、RFC 3151、2001年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3553] Mealling, M., Masinter, L., Hardie, T. and G. Klyne, \"An IETF URN Sub-namespace for Registered Protocol Parameters\", BCP 73, RFC 3553, June 2003.",
      "ja": "[RFC3553] Mealling、M.、Masinter、L.、ハーディー、T.とG. Klyne、 \"登録プロトコル・パラメータのためのIETF URNサブ名前空間\"、BCP 73、RFC 3553、2003年6月。"
    },
    {
      "indent": 3,
      "text": "[W3C.CR-rdf-schema] Brickley, D. and R. Guha, \"Resource Description Framework (RDF) Schema Specification 1.0\", W3C CR-rdf-schema, March 2000, <http://www.w3.org/TR/2000/CR-rdf-schema-20000327>.",
      "ja": "[W3C.CR-RDFスキーマ] Brickleyが、D.およびR.グハ、 \"リソース記述フレームワーク（RDF）スキーマ仕様1.0\"、W3C CR-RDFスキーマ、2000年3月<http://www.w3.org / TR / 2000 / CR-RDFスキーマ-20000327>。"
    },
    {
      "indent": 3,
      "text": "[W3C.REC-xml] Bray, T., Paoli, J., Sperberg-McQueen, C. and E. Maler, \"Extensible Markup Language (XML) 1.0 (2nd ed)\", W3C REC-xml, October 2000, <http://www.w3.org/TR/REC-xml>.",
      "ja": "[W3C.REC-XML]ブレイ、T.、パオリ、J.、Sperberg-マックィーン、C.およびE. MALER、 \"拡張マークアップ言語（XML）1.0（第2版）\"、W3C REC-xmlの、2000年10月<http://www.w3.org/TR/REC-xml>。"
    },
    {
      "indent": 3,
      "text": "[W3C.REC-xml-names] Bray, T., Hollander, D. and A. Layman, \"Namespaces in XML\", W3C REC-xml-names, January 1999, <http://www.w3.org/TR/REC-xml-names>.",
      "ja": "[W3C.REC-XML-名]ブレイ、T.、オランダ、D.とA.素人、 \"XMLで名前空間\"、W3C REC-XML-名、1999年1月、<http://www.w3.org/ TR / REC-XML-名>。"
    },
    {
      "indent": 3,
      "text": "[W3C.REC-xmlschema-1] Thompson, H., Beech, D., Maloney, M. and N. Mendelsohn, \"XML Schema Part 1: Structures\", W3C REC-xmlschema-1, May 2001, <http://www.w3.org/TR/xmlschema-1/>.",
      "ja": "[W3C.REC-XMLSCHEMA-1]トンプソン、H.、ブナ、D.、マロニー、M.およびN.メンデルゾーン、 \"XMLスキーマパート1：構造\"、W3C REC-XMLSCHEMA-1、2001年5月、<のhttp： //www.w3.org/TR/xmlschema-1/>。"
    },
    {
      "indent": 0,
      "text": "8. Intellectual Property Statement",
      "section_title": true,
      "ja": "8.知的財産権に関する声明"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、そのような権限下で、ライセンスがたりないかもしれない可能性があるためにどの本書または程度に記載されている技術の実装や使用に関係すると主張される可能性があります任意の知的財産やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能。また、そうした権利を特定するために取り組んできたことを表していないん。スタンダードトラックおよび標準関連文書における権利に関するIETFの手続きの情報は、BCP-11に記載されています。権利の主張のコピーは、出版のために利用可能とライセンスの保証が利用できるようにする、または本仕様の実装者または利用者が、そのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、その注意にこの標準を実践するために必要な場合があり技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 IETF専務に情​​報を扱ってください。"
    },
    {
      "indent": 0,
      "text": "9. Author's Address",
      "section_title": true,
      "ja": "9.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Michael Mealling VeriSign, Inc. Mountain View, CA USA",
      "ja": "マイケル・メオーリングベリサイン株式会社マウンテンビュー、CA USA"
    },
    {
      "indent": 3,
      "text": "EMail: michael@verisignlabs.com URI: http://www.research.verisignlabs.com",
      "ja": "電子メール：michael@verisignlabs.com URI：http://www.research.verisignlabs.com"
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "ja": "10.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2004）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の制限は永続的なものであり、インターネットソサエティもしくはその継承者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}