{
  "title": {
    "text": "RFC 3541 - A Uniform Resource Name (URN) Namespace for the Web3D Consortium (Web3D)",
    "ja": "RFC 3541 - Web3Dコンソーシアム（のWeb3D）のための統一リソース名（URN）名前空間"
  },
  "number": 3541,
  "created_at": "2019-10-19 10:36:32.879136+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           A. Walsh\nRequest for Comments: 3541                              Web3D Consortium\nCategory: Informational                                         May 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 16,
      "text": "A Uniform Resource Name (URN) Namespace\n    for the Web3D Consortium (Web3D)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a Uniform Resource Name (URN) namespace for the Web3D Consortium (Web3D) for naming persistent resources such as technical documents and specifications, Virtual Reality Modeling Language (VRML) and Extensible 3D (X3D) files and resources, Extensible Markup Language (XML) Document Type Definitions (DTDs), XML Schemas, namespaces, style sheets, media assets, and other resources produced or managed by Web3D.",
      "ja": "この文書では、このような技術文書や仕様などの永続的なリソースを命名するためのWeb3Dコンソーシアム（のWeb3D）のための統一リソース名（URN）名前空間、バーチャルリアリティモデリング言語（VRML）および拡張3D（X3D）ファイルとリソース、拡張マークアップ言語を（説明しますXML）文書型定義（DTDの）、XMLスキーマ、名前空間、スタイルシート、メディア資産、およびその他のリソースは、生産やのWeb3Dによって管理されます。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Web3D is a non-profit organization with a mandate to develop and promote open standards to enable 3D for the Internet, Web and broadcast applications. Web3D is responsible for developing, advancing, and maintaining the VRML97 ISO/IEC International Standard (ISO/IEC 14772-1:1997), X3D (the forthcoming official successor to VRML) and related technologies.",
      "ja": "Web3Dは、インターネット、Webおよびブロードキャストアプリケーションのための3Dを有効にするには、オープンな標準を策定し、推進する権限を持つ非営利団体です。 、X3D（VRMLに迫った、公式の後継）および関連技術：のWeb3Dは、開発進める、とVRML97 ISO / IEC国際標準（1997 ISO / IEC 14772から1）を維持する責任があります。"
    },
    {
      "indent": 3,
      "text": "Web3D maintains and extends its standardization activities through the coordinated efforts of dedicated Working Groups, Task Groups, and professional Liaisons to related standards bodies such as ISO, W3C, and MPEG. See http://web3d.org/ for details.",
      "ja": "Web3Dは維持し、そのようなISO、W3C、およびMPEGなどの関連標準化団体に専用のワーキンググループ、タスクグループ、およびプロリエゾンの協調努力によってその標準化活動を拡張します。詳細については、http://web3d.org/を参照してください。"
    },
    {
      "indent": 3,
      "text": "Web3D would like to assign unique, permanent, location-independent names based on URNs for some resources it produces or manages.",
      "ja": "Web3Dは、それが生成または管理していくつかのリソースのためにURNをもとに独自の、永続的な、場所に依存しない名前を割り当てたいです。"
    },
    {
      "indent": 3,
      "text": "This namespace specification is for a formal namespace.",
      "ja": "この名前空間仕様は正式な名前空間のためです。"
    },
    {
      "indent": 0,
      "text": "2. Specification Template",
      "section_title": true,
      "ja": "2.仕様のテンプレート"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "ja": "名前空間ID："
    },
    {
      "indent": 6,
      "text": "\"web3d\"",
      "ja": "\"WEB3D\""
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "ja": "登録情報："
    },
    {
      "indent": 6,
      "text": "Registration Version Number: 1 Registration Date: 2003-05-06",
      "ja": "登録バージョン番号：1登録日：2003-05-06"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "ja": "名前空間の宣言された登録者："
    },
    {
      "indent": 6,
      "text": "Web3D Consortium, Inc. Email: <contact@web3d.org> Web: <http://web3d.org>",
      "ja": "Web3Dコンソーシアム株式会社Eメール：<contact@web3d.org>ウェブ：<http://web3d.org>"
    },
    {
      "indent": 4,
      "text": "c/o Name : Aaron E. Walsh Affiliation: Web3D Working Group Chair; Web3D Liaison to MPEG, W3C Address : 18 Haviland Street, Boston, MA USA 02115 Phone : +1 (617) 536-3279 Email : <aaron@mantiscorp.com> Web : <http://mantiscorp.com/people/aew/>",
      "ja": "C / O名：アーロンE.ウォルシュ所属：のWeb3Dワーキンググループ議長。 MPEGへのWeb3Dリエゾン、W3C住所：18ハビランド・ストリート、ボストン、MA USA 02115電話：+1（617）536から3279 Eメール：<aaron@mantiscorp.com>ウェブ：<http://mantiscorp.com/people/aew />"
    },
    {
      "indent": 3,
      "text": "Declaration of syntactic structure:",
      "ja": "構文構造の宣言："
    },
    {
      "indent": 6,
      "text": "URNs assigned by Web3D will have the following hierarchical structure based on the group's organizational structure:",
      "ja": "Web3Dによって割り当てられたURNsは、グループの組織構造に基づいて、次の階層構造を持つことになります。"
    },
    {
      "indent": 9,
      "text": "urn:web3d:{subgroup}:{subgroup-specific string}",
      "ja": "URN：WEB3D：{亜群}：{サブグループ固有の文字列}"
    },
    {
      "indent": 6,
      "text": "where \"subgroup\" corresponds to an official Web3D subgroup or activity such as the VRML standard ('vrml97'), Extensible 3D ('x3d'), Universal Media Working Group ('media'), Geographical VRML Working Group ('geovrml'), Humanoid Animation Working Group ('hanim') and so forth, and \"subgroup-specific string\" is a US-ASCII string that conforms to URN Syntax requirements ([RFC2141]).",
      "ja": "「サブグループ」とは、VRML標準（「VRML97」）、拡張可能な3D（「X3D」）、ユニバーサルメディアワーキンググループ（「メディア」）、地理VRMLワーキンググループとしてのWeb3Dサブグループや活動公式に対応している（「geovrml」） 、ヒューマノイドアニメーションワーキンググループ（「hanim」）など、および「サブグループ固有の文字列は、」構文の要件をURNに準拠US-ASCII文字列である（[RFC2141]）。"
    },
    {
      "indent": 6,
      "text": "In cases where ownership or management of a resource is shared by multiple Web3D subgroups or activities, a general category may be used in place of a specific subgroup.",
      "ja": "リソースの所有権又は管理が複数のWeb3Dサブグループまたは活動によって共有される場合には、一般的なカテゴリは、特定のサブグループの代わりに使用することができます。"
    },
    {
      "indent": 6,
      "text": "Chairs of Web3D subgroups and activities assign all unique identifiers that fall within the scope of the subgroup or activity that they chair. Chairs of Web3D subgroups and activities are also responsible for publishing the specific structure of URNs assigned by their group or activity.",
      "ja": "Web3Dサブグループと活動の議長は、サブグループまたはアクティビティ彼らは椅子の範囲に含まれるすべての一意の識別子を割り当てます。 Web3Dサブグループと活動の議長はまた、彼らのグループや活動によって割り当てられたURNsの具体的な構造を公開する責任があります。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "ja": "関連の補助ドキュメント："
    },
    {
      "indent": 6,
      "text": "None",
      "ja": "無し"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "ja": "識別子一意性の考慮事項："
    },
    {
      "indent": 6,
      "text": "Identifier uniqueness will be enforced by the Web3D Board of Directors (BoD) in cooperation with Chair(s) of corresponding Web3D subgroups.",
      "ja": "識別子の一意性のWeb3Dサブグループの対応する椅子と協働して取締役会のWeb3D量（BOD）によって強制されるであろう。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "ja": "識別子の永続性の考慮事項："
    },
    {
      "indent": 6,
      "text": "Web3D is committed to maintaining the accessibility and persistence of all resources that are officially assigned URNs by the organization.",
      "ja": "Web3Dは正式に組織によってのURNを割り当てられているすべてのリソースのアクセシビリティと持続性を維持することにコミットしています。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "ja": "識別子割り当てのプロセス。"
    },
    {
      "indent": 6,
      "text": "Assignment is limited to the owner and those authorities that are specifically designated by the owner. Web3D may designate portions of its namespace for assignment by other parties.",
      "ja": "譲渡は、所有者、具体的に所有者によって指定されているものを当局に制限されています。 Web3Dは、他の当事者によって割り当てのためにその名前空間の一部を指定することができます。"
    },
    {
      "indent": 3,
      "text": "Process of identifier resolution:",
      "ja": "識別子解像度のプロセス。"
    },
    {
      "indent": 6,
      "text": "The owner will develop and maintain \"URN catalogs\" that map all assigned URNs to Uniform Resource Locators (URLs), specifically to enable Web-based resolution of named resources. In the future, an interactive online resolution system may be developed to automate this process.",
      "ja": "所有者は、開発とUniform Resource Locator（URL）に割り当てられたすべてのURNをマップ「URNカタログ」を維持、特に名前付きリソースのWebベースの解像度を有効にします。将来的には、インタラクティブなオンライン解決システムは、このプロセスを自動化するために開発されてもよいです。"
    },
    {
      "indent": 6,
      "text": "The owner will authorize additional resolution services as appropriate.",
      "ja": "所有者は、必要に応じて追加の解決サービスを認可します。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "ja": "字句等価のルール："
    },
    {
      "indent": 6,
      "text": "URNs are lexically equivalent if they are lexically identical.",
      "ja": "彼らは辞書的に同一である場合のURNは、辞書的に同等です。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "ja": "URN構文に準拠："
    },
    {
      "indent": 6,
      "text": "No special considerations.",
      "ja": "特別な考慮事項はありません。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "ja": "検証メカニズム："
    },
    {
      "indent": 6,
      "text": "None specified. The owner will develop and maintain URN catalogs. The presence of a URN in a catalog indicates that it is valid.",
      "ja": "いずれも指定されていません。所有者は、URNカタログを開発し、維持します。カタログのURNの存在は、それが有効であることを示しています。"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "ja": "範囲："
    },
    {
      "indent": 6,
      "text": "Global",
      "ja": "グローバル"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "ja": "3.例"
    },
    {
      "indent": 3,
      "text": "The following examples are not guaranteed to be real. They are presented for pedagogical reasons only.",
      "ja": "次の例では、本当のことが保証されていません。彼らは教育学上の理由だけのために提示されています。"
    },
    {
      "indent": 6,
      "text": "urn:web3d:vrml97:node:GeoCoordinate urn:web3d:vrml97:node:NurbsCurve urn:web3d:x3d:schemas:2002:compact urn:web3d:x3d:schemas:2002:compromise urn:web3d:media:textures:nature:grass",
      "ja": "URN：WEB3D：VRML97：ノード：地理座標のurn：WEB3D：VRML97：ノード：NurbsCurve骨壷：WEB3D：X3D：スキーマ：2002：コンパクトURN：WEB3D：X3D：スキーマ：2002：妥協骨壷：WEB3D：メディア：テクスチャ：自然：草"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "ja": "通常、一般的なのURNの使用と解決に関連づけられたもの以外の追加のセキュリティの考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "5. Namespace Considerations and Community Considerations",
      "section_title": true,
      "ja": "5.名前空間の考慮事項とコミュニティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The Web3D Consortium (formerly \"VRML Consortium\") long acknowledged the value and utility of URNs starting with the VRML International Standard issued in 1997 (ISO/IEC 14772-1:1997, commonly known as \"VRML97\"). Annex F.2, \"URNs\", of that standard outlines non-normative use of URNs as a persistent naming mechanism for referenced resources such as files, EXTERNPROTOs, textures, and so forth.",
      "ja": "（：一般に「VRML97」として知られている1997、ISO / IEC 14772から1）のWeb3Dコンソーシアム（旧称「VRMLコンソーシアム」）は、長い間、1997年に発行された値とVRML国際規格で始まるのURNの有用性を認めました。附属書F.2、等々、EXTERNPROTOs、テクスチャファイルなどの参照されるリソースのための永続的な命名メカニズムとしてのURNの非規範的使用を概説し、その標準の「のURN」、。"
    },
    {
      "indent": 3,
      "text": "As such numerous VRML players and authoring tools, as well as content authoring communities, have adopted Web3D-oriented URNs for this purpose despite the fact that no formal \"web3d\" URN NID has been established by the Web3D Consortium. Consequently, interoperability of resources named using these disparate naming conventions is difficult, if not impossible, owing to the lack of a single, well defined \"web3d\" URN namespace that is formally registered and maintained by the Web3D Consortium.",
      "ja": "こうした数々のVRMLプレーヤーやオーサリングツールだけでなく、コンテンツのオーサリングコミュニティとして、正式な「WEB3D」URN NIDはのWeb3Dコンソーシアムによって確立されていないという事実にもかかわらず、この目的のためのWeb3D指向のURNを採用しています。したがって、これらの異なる命名規則を使用して、指定されたリソースの相互運用性は、正式のWeb3Dコンソーシアムによって登録され、維持されている単一の、明確に定義された「WEB3D」URN名前空間の不足のために、困難、不可能ではないです。"
    },
    {
      "indent": 3,
      "text": "In order to promote complete compatibility and interoperability across past, current and future Web3D standards, as well as across myriad Web3D-related products, tools, and content, the Web3D Consortium believes formal registration and management of the \"web3d\" URN namespace is necessary and in the best interest of the larger Internet- and Web-based communities it serves.",
      "ja": "完全な互換性と相互運用性の過去、現在および将来のWeb3D規格間だけでなく、全体の無数のWeb3D関連製品、ツール、およびコンテンツを促進するために、のWeb3Dコンソーシアムは、正式な登録と「WEB3D」URN名前空間の管理を信じている必要があり、大きなInternet-およびWebベースのコミュニティの最善の利益にそれがあります。"
    },
    {
      "indent": 3,
      "text": "The \"web3d\" URN namespace will be used to name VRML and X3D files and resources, XML DTDs and Schemas, namespaces, style sheets, media assets, and other resources produced or managed by Web3D. As an open standards organization, any Web3D Consortium resources that are officially named using the \"web3d\" namespace will be made freely available to the public.",
      "ja": "「WEB3D」URN名前空間は、VRMLとX3Dファイルとリソース、XMLのDTDとスキーマ、名前空間、スタイルシート、メディア資産、および生産またはのWeb3Dによって管理される他のリソースに名前を付けるために使用されます。オープンな標準機関として、正式に「WEB3D」名前空間を使用して命名されているすべてのWeb3Dコンソーシアムのリソースを公開し、自由に利用できるようになります。"
    },
    {
      "indent": 3,
      "text": "Resources will be named and maintained in accordance with the process(es) described in this document. Any organization or individual can utilize the Web3D Consortium's freely available URN catalogs to resolve a resource named therein. Although the Web3D Consortium will control the naming and allocation of resources in order to maintain compliance with the process(es) described in this document, resolution and/or use of these resources is unrestricted and without fee in order to promote widespread adoption of open Web3D technologies. To this end, related documentation and open source resolvers will be freely provided through the Web3D Consortium's Web site.",
      "ja": "リソースは、この文書に記載されたプロセス（複数可）に基づいて命名され、維持されます。任意の組織または個人は、その中に名前付きリソースを解決するためのWeb3Dコンソーシアムの自由に利用できるURNカタログを利用することができます。 Web3Dコンソーシアムは、この文書、解像度及び/又はオープンのWeb3Dの普及を促進するためにこれらのリソースの使用で無制限と料金無しに記載の方法（群）への準拠を維持するためにリソースの命名および割り当てを制御しますが技術。このためには、関連文書とオープンソースのリゾルバは自由のWeb3DコンソーシアムのWebサイトを通じて提供されます。"
    },
    {
      "indent": 3,
      "text": "Additionally, member organizations or individuals that wish to name their own resources using the \"web3d\" namespace may submit such request(s) directly to the corresponding Web3D Working Group (subgroup) for subsequent review.",
      "ja": "また、「WEB3D」名前空間を使用して独自のリソースを命名したい会員組織や個人は、その後の審査のために直接対応するのWeb3Dワーキンググループ（サブグループ）にそのような要求（複数可）を提出することができます。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document describes a \"web3d\" URN NID registration for the Web3D Consortium which has been entered into the IANA registry of URN NIDs (http://www.iana.org/assignments/urn-namespaces).",
      "ja": "この文書はURNのNID（http://www.iana.org/assignments/urn-namespaces）のIANAレジストリに入力されたのWeb3Dコンソーシアムのための「WEB3D」URN NIDの登録について説明します。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "リファレンス"
    },
    {
      "indent": 3,
      "text": "[RFC2141] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "ja": "[RFC2141]堀、R.、 \"URN構文\"、RFC 2141、1997年5月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Aaron E. Walsh Mantis Development Corp. 18 Haviland Street Boston, MA USA 02115",
      "ja": "アーロンE.ウォルシュカマキリ開発公社18ハビランド・ストリート、ボストン、MA USA 02115"
    },
    {
      "indent": 3,
      "text": "Phone: +1 (617) 536-3279 EMail: aaron@mantiscorp.com Web : <http://mantiscorp.com/people/aew/>",
      "ja": "電話：+1（617）536-3279 Eメール：aaron@mantiscorp.comウェブ：<http://mantiscorp.com/people/aew/>"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の制限は永続的なものであり、インターネットソサエティもしくはその継承者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}