{
  "title": {
    "text": "RFC 3753 - Mobility Related Terminology",
    "ja": "RFC 3753 - モビリティ関連用語"
  },
  "number": 3753,
  "created_at": "2023-09-27 17:18:02.134584+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     J. Manner, Ed.\nRequest for Comments: 3753                                  M. Kojo, Ed.\nCategory: Informational                                        June 2004",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 22,
      "text": "Mobility Related Terminology",
      "ja": "モビリティ関連用語"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（c）The Internet Society（2004）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "There is a need for common definitions of terminology in the work to be done around IP mobility. This document defines terms for mobility related terminology. The document originated out of work done in the Seamoby Working Group but has broader applicability for terminology used in IETF-wide discourse on technology for mobility and IP networks. Other working groups dealing with mobility may want to take advantage of this terminology.",
      "ja": "IPモビリティを中心に行われる作業における用語の一般的な定義が必要です。このドキュメントでは、モビリティ関連用語の用語を定義します。このドキュメントは、Seamoby Working Groupで行われた作業から発生しましたが、モビリティとIPネットワークのテクノロジーに関するIETF全体の談話で使用される用語に幅広い適用性を備えています。モビリティを扱う他のワーキンググループは、この用語を活用したい場合があります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction. . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  General Terms . . . . . . . . . . . . . . . . . . . . . . . .   2\n3.  Mobile Access Networks and Mobile Networks. . . . . . . . . .  10\n4.  Handover Terminology. . . . . . . . . . . . . . . . . . . . .  15\n    4.1.  Scope of Handover . . . . . . . . . . . . . . . . . . .  16\n    4.2.  Handover Control. . . . . . . . . . . . . . . . . . . .  17\n    4.3.  Simultaneous connectivity to Access Routers . . . . . .  19\n    4.4.  Performance and Functional Aspects. . . . . . . . . . .  19\n    4.5.  Micro Diversity, Macro Diversity, and IP Diversity. . .  21\n    4.6.  Paging, and Mobile Node States and Modes. . . . . . . .  22\n    4.7.  Context Transfer. . . . . . . . . . . . . . . . . . . .  24\n    4.8.  Candidate Access Router Discovery . . . . . . . . . . .  24\n    4.9.  Types of Mobility . . . . . . . . . . . . . . . . . . .  25\n5.  Specific Terminology for Mobile Ad-Hoc Networking . . . . . .  26\n6.  Security-related Terminology. . . . . . . . . . . . . . . . .  27\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .  28\n8.  Contributors. . . . . . . . . . . . . . . . . . . . . . . . .  28\n9.  Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .  29\n10. Informative References. . . . . . . . . . . . . . . . . . . .  29\n   11. Appendix A - Index of Terms . . . . . . . . . . . . . . . . .  31\n12. Authors' Addresses. . . . . . . . . . . . . . . . . . . . . .  35\n13. Full Copyright Statement. . . . . . . . . . . . . . . . . . .  36",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document presents terminology to be used for documents and discussions within the Seamoby Working Group. Other mobility related working groups could take advantage of this terminology, in order to create a common terminology for the area of mobility in IP networks.",
      "ja": "この文書は、Seamobyワーキンググループ内での文書や議論に使用される用語を提示します。IPネットワークのモビリティ領域の共通の用語を作成するために、他のモビリティ関連のワーキンググループがこの用語を利用することができます。"
    },
    {
      "indent": 3,
      "text": "Some terms and their definitions that are not directly related to the IP world are included for the purpose of harmonizing the terminology. For example, 'Access Point' and 'base station' refer to the same component, from the point of view of IP, but 'Access Router' has a very different meaning. The presented terminology may also, it is hoped, be adequate to cover mobile ad-hoc networks.",
      "ja": "IPの世界に直接関係していないいくつかの用語とその定義は、用語を調和させる目的で含まれています。 たとえば、「アクセスポイント」と「ベースステーション」は、IPの観点から同じコンポーネントを指しますが、「アクセスルーター」には非常に異なる意味があります。 提示された用語は、モバイルアドホックネットワークをカバーするのに適していることが期待される場合もあります。"
    },
    {
      "indent": 3,
      "text": "The proposed terminology is not meant to assert any new terminology. Rather the authors would welcome discussion on more exact definitions as well as missing or unnecessary terms. This work is a collaborative enterprise between people from many different engineering backgrounds and so already presents a first step in harmonizing the terminology.",
      "ja": "提案された用語は、新しい用語を主張するためのものではありません。むしろ、著者は、より正確な定義と不必要な用語についての議論を歓迎します。この作業は、多くの異なるエンジニアリングのバックグラウンドを持つ人々の間の共同企業であり、すでに用語を調和させる最初のステップを提示しています。"
    },
    {
      "indent": 3,
      "text": "The terminology in this document is divided into several sections. First, there is a list of terms for general use and mobile access networks followed by terms related to handovers, and finally some terms used within the MANET and NEMO working groups.",
      "ja": "このドキュメントの用語は、いくつかのセクションに分かれています。まず、一般的な使用およびモバイルアクセスネットワークの用語のリストがあり、その後に携帯電話に関連する用語があり、最後にMANETおよびNEMOワーキンググループ内で使用されるいくつかの用語があります。"
    },
    {
      "indent": 0,
      "text": "2. General Terms",
      "section_title": true,
      "ja": "2. 一般用語"
    },
    {
      "indent": 3,
      "text": "Bandwidth",
      "ja": "帯域幅"
    },
    {
      "indent": 6,
      "text": "The total width of the frequency band available to or used by a communications channel. Usually measured in Hertz (Hz). The bandwidth of a channel limits the available channel capacity.",
      "ja": "通信チャネルで利用可能または使用できる周波数帯域の総幅。通常、Hertz（Hz）で測定されます。チャネルの帯域幅は、利用可能なチャネル容量を制限します。"
    },
    {
      "indent": 3,
      "text": "Bandwidth utilization",
      "ja": "帯域幅の利用"
    },
    {
      "indent": 6,
      "text": "The actual rate of information transfer achieved over a link, expressed as a percentage of the theoretical maximum channel capacity on that link, according to Shannon's Law.",
      "ja": "シャノンの法律によると、そのリンク上の理論的最大チャネル容量の割合として表されるリンクを介して達成された実際の情報転送率。"
    },
    {
      "indent": 3,
      "text": "Beacon",
      "ja": "ビーコン"
    },
    {
      "indent": 6,
      "text": "A control message broadcast by a node (especially, a base station) informing all the other nodes in its neighborhood of the continuing presence of the broadcasting node, possibly along with additional status or configuration information.",
      "ja": "ノード（特に、基地局）でブロードキャストされているコントロールメッセージは、ブロードキャストノードの継続的な存在の近くにある他のすべてのノードを通知し、おそらく追加のステータスまたは構成情報とともに通知します。"
    },
    {
      "indent": 3,
      "text": "Binding Update (BU)",
      "ja": "バインディングアップデート（BU）"
    },
    {
      "indent": 6,
      "text": "A message indicating a mobile node's current mobility binding, and in particular its care-of address.",
      "ja": "モバイルノードの現在のモビリティバインディング、特にそのケアアドレスを示すメッセージ。"
    },
    {
      "indent": 3,
      "text": "Care-of-Address (CoA)",
      "ja": "通りのケア（COA）"
    },
    {
      "indent": 6,
      "text": "An IP address associated with a mobile node while visiting a foreign link; the subnet prefix of this IP address is a foreign subnet prefix. A packet addressed to the mobile node which arrives at the mobile node's home network when the mobile node is away from home and has registered a Care-of Address will be forwarded to that address by the Home Agent in the home network.",
      "ja": "外国リンクのアクセス中にモバイルノードに関連付けられたIPアドレス。このIPアドレスのサブネットプレフィックスは、外部サブネットプレフィックスです。モバイルノードのホームネットワークに到達するモバイルノードにアドレス指定されたパケットは、モバイルノードが自宅から離れており、住所のケアを登録したときに、ホームネットワークのホームエージェントによってそのアドレスに転送されます。"
    },
    {
      "indent": 3,
      "text": "Channel",
      "ja": "チャネル"
    },
    {
      "indent": 6,
      "text": "A subdivision of the physical medium allowing possibly shared independent uses of the medium. Channels may be made available by subdividing the medium into distinct time slots, or distinct spectral bands, or decorrelated coding sequences.",
      "ja": "物理媒体の区画により、おそらく媒体の独立した使用が共有される可能性があります。チャネルは、培地を明確なタイムスロット、または個別のスペクトルバンド、または切り離されたコーディングシーケンスに細分化することにより、利用可能にすることができます。"
    },
    {
      "indent": 3,
      "text": "Channel access protocol",
      "ja": "チャネルアクセスプロトコル"
    },
    {
      "indent": 6,
      "text": "A protocol for mediating access to, and possibly allocation of, the various channels available within the physical communications medium. Nodes participating in the channel access protocol agree to communicate only when they have uncontested access to one of the channels, so that there will be no interference.",
      "ja": "物理通信媒体内で利用可能なさまざまなチャネルへのアクセス、および場合によっては割り当てのためのプロトコル。チャネルアクセスプロトコルに参加するノードは、チャネルのいずれかへのアクセスが争われていない場合にのみ通信することに同意します。そのため、干渉はありません。"
    },
    {
      "indent": 3,
      "text": "Channel capacity",
      "ja": "チャネル容量"
    },
    {
      "indent": 6,
      "text": "The total capacity of a link to carry information (typically bits) per unit time. With a given bandwidth, the theoretical maximum channel capacity is given by Shannon's Law. The actual channel capacity of a channel is determined by the channel bandwidth, the coding system used, and the signal to noise ratio.",
      "ja": "単位時間あたりの情報（通常はビット）を携帯するためのリンクの総容量。特定の帯域幅により、理論的な最大チャネル容量はシャノンの法律によって与えられます。チャネルの実際のチャネル容量は、チャネル帯域幅、使用されたコーディングシステム、および信号対ノイズ比によって決定されます。"
    },
    {
      "indent": 3,
      "text": "Control message",
      "ja": "コントロールメッセージ"
    },
    {
      "indent": 6,
      "text": "Information passed between two or more network nodes for maintaining protocol state, which may be unrelated to any specific application.",
      "ja": "情報は、特定のアプリケーションとは無関係である可能性があるプロトコル状態を維持するために、2つ以上のネットワークノード間で渡されました。"
    },
    {
      "indent": 3,
      "text": "Distance vector",
      "ja": "距離ベクトル"
    },
    {
      "indent": 6,
      "text": "A characteristic of some routing protocols in which, for each desired destination, a node maintains information about the distance to that destination, and a vector (next hop) towards that destination.",
      "ja": "目的の宛先ごとに、ノードがその目的地までの距離に関する情報とその目的地に向かってベクトル（次のホップ）に関する情報を維持するいくつかのルーティングプロトコルの特性。"
    },
    {
      "indent": 3,
      "text": "Fairness",
      "ja": "公平性"
    },
    {
      "indent": 6,
      "text": "A property of channel access protocols whereby a medium is made fairly available to all eligible nodes on the link. Fairness does not strictly imply equality, especially in cases where nodes are given link access according to unequal priority or classification.",
      "ja": "リンク上のすべての適格なノードが媒体をかなり利用できるチャネルアクセスプロトコルのプロパティ。公平性は、特にノードが不平等な優先順位または分類に応じてリンクアクセスが与えられた場合に、厳密に平等を暗示するものではありません。"
    },
    {
      "indent": 3,
      "text": "Flooding",
      "ja": "洪水"
    },
    {
      "indent": 6,
      "text": "The process of delivering data or control messages to every node within the network under consideration.",
      "ja": "検討中のネットワーク内のすべてのノードにデータまたは制御メッセージを配信するプロセス。"
    },
    {
      "indent": 3,
      "text": "Foreign subnet prefix",
      "ja": "外国のサブネットプレフィックス"
    },
    {
      "indent": 6,
      "text": "A bit string that consists of some number of initial bits of an IP address which identifies a node's foreign link within the Internet topology.",
      "ja": "インターネットトポロジ内のノードの外部リンクを識別するIPアドレスのいくつかの初期ビットで構成されるビット文字列。"
    },
    {
      "indent": 3,
      "text": "Forwarding node",
      "ja": "転送ノード"
    },
    {
      "indent": 6,
      "text": "A node which performs the function of forwarding datagrams from one of its neighbors to another.",
      "ja": "隣人のいずれかから別のものにデータグラムを転送する機能を実行するノード。"
    },
    {
      "indent": 3,
      "text": "Home Address (HoA)",
      "ja": "ホームアドレス（HOA）"
    },
    {
      "indent": 6,
      "text": "An IP address assigned to a mobile node, used as the permanent address of the mobile node. This address is within the mobile node's home link. Standard IP routing mechanisms will deliver packets destined for a mobile node's home address to its home link [9].",
      "ja": "モバイルノードの永続的なアドレスとして使用されるモバイルノードに割り当てられたIPアドレス。このアドレスは、モバイルノードのホームリンク内にあります。標準的なIPルーティングメカニズムは、モバイルノードのホームアドレスに向けてホームリンクに向けられたパケットを提供します[9]。"
    },
    {
      "indent": 3,
      "text": "Home Agent (HA)",
      "ja": "ホームエージェント（ha）"
    },
    {
      "indent": 6,
      "text": "A router on a mobile node's home link with which the mobile node has registered its current care-of address. While the mobile node is away from home, the home agent intercepts packets on the home link destined to the mobile node's home address, encapsulates them, and tunnels them to the mobile node's registered care-of address.",
      "ja": "モバイルノードが現在の住所を登録しているモバイルノードのホームリンク上のルーター。モバイルノードが自宅から離れている間、ホームエージェントはモバイルノードのホームアドレスに運命づけられたホームリンクのパケットを傍受し、それらをカプセル化し、モバイルノードの登録されたケアオブアドレスにトンネルします。"
    },
    {
      "indent": 3,
      "text": "Home subnet prefix",
      "ja": "ホームサブネットプレフィックス"
    },
    {
      "indent": 6,
      "text": "A bit string that consists of some number of initial bits of an IP address which identifies a node's home link within the Internet topology (i.e., the IP subnet prefix corresponding to the mobile node's home address, as defined in [9]).",
      "ja": "インターネットトポロジ内のノードのホームリンク（つまり、[9]で定義されているように、モバイルノードのホームアドレスに対応するIPサブネットプレフィックス）を識別するIPアドレスのいくつかの初期ビットで構成されるビット文字列。"
    },
    {
      "indent": 3,
      "text": "Interface",
      "ja": "インターフェース"
    },
    {
      "indent": 6,
      "text": "A node's point of attachment to a link.",
      "ja": "リンクへの添付のノードのポイント。"
    },
    {
      "indent": 3,
      "text": "IP access address",
      "ja": "IPアクセスアドレス"
    },
    {
      "indent": 6,
      "text": "An IP address (often dynamically allocated) which a node uses to designate its current point of attachment to the local network. The IP access address is typically to be distinguished from the mobile node's home address; in fact, while visiting a foreign network the IP access address may be considered unsuitable for use as an end-point address by any but the most short-lived applications. Instead, the IP access address is typically used as the care-of address of the node.",
      "ja": "ノードが使用してローカルネットワークへの現在の添付点を指定するために使用するIPアドレス（多くの場合、動的に割り当てられます）。通常、IPアクセスアドレスは、モバイルノードのホームアドレスと区別されます。実際、外国のネットワークにアクセスしている間、IPアクセスアドレスは、最も短命のアプリケーション以外のエンドポイントアドレスとして使用するのに適していないと見なされる場合があります。代わりに、IPアクセスアドレスは通常、ノードのケアアドレスとして使用されます。"
    },
    {
      "indent": 3,
      "text": "Link",
      "ja": "リンク"
    },
    {
      "indent": 6,
      "text": "A communication facility or physical medium that can sustain data communications between multiple network nodes, such as an Ethernet (simple or bridged). A link is the layer immediately below IP. In a layered network stack model, the Link Layer (Layer 2) is normally below the Network (IP) Layer (Layer 3), and above the Physical Layer (Layer 1).",
      "ja": "イーサネットなどの複数のネットワークノード間のデータ通信を維持できる通信施設または物理的媒体（シンプルまたはブリッジ）。リンクは、IPのすぐ下のレイヤーです。層状ネットワークスタックモデルでは、リンクレイヤー（レイヤー2）は通常、ネットワーク（IP）レイヤー（レイヤー3）の下にあり、物理レイヤー（レイヤー1）の上にあります。"
    },
    {
      "indent": 3,
      "text": "Asymmetric link",
      "ja": "非対称リンク"
    },
    {
      "indent": 6,
      "text": "A link with transmission characteristics which are different depending upon the relative position or design characteristics of the transmitter and the receiver of data on the link. For instance, the range of one transmitter may be much higher than the range of another transmitter on the same medium.",
      "ja": "送信機の相対的な位置または設計特性とリンク上のデータの受信機に応じて異なる伝送特性を持つリンク。たとえば、1つの送信機の範囲は、同じ媒体上の別の送信機の範囲よりもはるかに高い場合があります。"
    },
    {
      "indent": 3,
      "text": "Link establishment",
      "ja": "リンク確立"
    },
    {
      "indent": 6,
      "text": "The process of establishing a link between the mobile node and the local network. This may involve allocating a channel, or other local wireless resources, possibly including a minimum level of service or bandwidth.",
      "ja": "モバイルノードとローカルネットワークの間にリンクを確立するプロセス。これには、おそらく最小レベルのサービスまたは帯域幅を含むチャネルまたはその他のローカルワイヤレスリソースの割り当てが含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "Link-layer trigger (L2 Trigger)",
      "ja": "リンク層トリガー（L2トリガー）"
    },
    {
      "indent": 6,
      "text": "Information from the link layer that informs the network layer of the detailed events involved in handover sequencing at the link layer. L2 triggers are not specific to any particular link layer, but rather represent generalizations of link layer information available from a wide variety of link layer protocols [4].",
      "ja": "リンクレイヤーでのハンドオーバーシーケンスに関与する詳細なイベントのネットワークレイヤーに通知するリンクレイヤーからの情報。L2トリガーは、特定のリンクレイヤーに固有のものではなく、さまざまなリンクレイヤープロトコルから利用可能なリンクレイヤー情報の一般化を表しています[4]。"
    },
    {
      "indent": 3,
      "text": "Link state",
      "ja": "リンク状態"
    },
    {
      "indent": 6,
      "text": "A characterization of some routing protocols in which every node within the network is expected to maintain information about every link within the network topology.",
      "ja": "ネットワーク内のすべてのノードがネットワークトポロジ内のすべてのリンクに関する情報を維持することが期待されるいくつかのルーティングプロトコルの特性評価。"
    },
    {
      "indent": 3,
      "text": "Link-level acknowledgment",
      "ja": "リンクレベルの確認"
    },
    {
      "indent": 6,
      "text": "A protocol strategy, typically employed over wireless media, requiring neighbors to acknowledge receipt of packets (typically unicast only) from the transmitter. Such strategies aim to avoid packet loss or delay resulting from lack of, or unwanted characteristics of, higher level protocols. Link-layer acknowledgments are often used as part of Automatic Repeat-Request (ARQ) algorithms for increasing link reliability.",
      "ja": "通常、ワイヤレスメディアを介して採用されるプロトコル戦略は、隣人が送信機からのパケットの受領（通常はユニキャストのみ）を確認する必要があります。このような戦略は、より高いレベルのプロトコルの不足または不要な特性に起因するパケットの損失または遅延を回避することを目的としています。リンクの信頼性を向上させるための自動リピートレクエスト（ARQ）アルゴリズムの一部として、リンクレイヤーの謝辞がよく使用されます。"
    },
    {
      "indent": 3,
      "text": "Local broadcast",
      "ja": "ローカル放送"
    },
    {
      "indent": 6,
      "text": "The delivery of data to every node within range of the transmitter.",
      "ja": "送信機の範囲内のすべてのノードへのデータの配信。"
    },
    {
      "indent": 3,
      "text": "Loop-free",
      "ja": "ループフリー"
    },
    {
      "indent": 6,
      "text": "A property of routing protocols whereby the path taken by a data packet from source to destination never traverses through the same intermediate node twice before arrival at the destination.",
      "ja": "ソースから宛先へのデータパケットによって採取されたパスが、目的地に到着する前に同じ中間ノードを2回通過することはありません。"
    },
    {
      "indent": 3,
      "text": "Medium Access Protocol (MAC)",
      "ja": "ミディアムアクセスプロトコル（MAC）"
    },
    {
      "indent": 6,
      "text": "A protocol for mediating access to, and possibly allocation of, the physical communications medium. Nodes participating in the medium access protocol can communicate only when they have uncontested access to the medium, so that there will be no interference. When the physical medium is a radio channel, the MAC is the same as the Channel Access Protocol.",
      "ja": "物理的な通信媒体へのアクセス、および場合によっては割り当てのためのプロトコル。中程度のアクセスプロトコルに参加するノードは、媒体へのアクセスが争われていない場合にのみ通信でき、干渉はありません。物理媒体が無線チャネルの場合、Macはチャネルアクセスプロトコルと同じです。"
    },
    {
      "indent": 3,
      "text": "Mobile network prefix",
      "ja": "モバイルネットワークプレフィックス"
    },
    {
      "indent": 6,
      "text": "A bit string that consists of some number of initial bits of an IP address which identifies the entire mobile network within the Internet topology. All nodes in a mobile network necessarily have an address containing this prefix.",
      "ja": "インターネットトポロジ内のモバイルネットワーク全体を識別するIPアドレスのいくつかの初期ビットで構成されるビット文字列。モバイルネットワーク内のすべてのノードには、必然的にこのプレフィックスを含むアドレスがあります。"
    },
    {
      "indent": 3,
      "text": "Mobility factor",
      "ja": "モビリティファクター"
    },
    {
      "indent": 6,
      "text": "The relative frequency of node movement, compared to the frequency of application initiation.",
      "ja": "アプリケーションの開始頻度と比較して、ノード移動の相対頻度。"
    },
    {
      "indent": 3,
      "text": "Multipoint relay (MPR)",
      "ja": "マルチポイントリレー（MPR）"
    },
    {
      "indent": 6,
      "text": "A node which is selected by its one-hop neighbor to re-transmit all broadcast messages that it receives. The message must be new and the time-to-live field of the message must be greater than one. Multipoint relaying is a technique to reduce the number of redundant re-transmissions while diffusing a broadcast message in the network.",
      "ja": "ワンホップの隣人によって選択されたノードは、受信したすべてのブロードキャストメッセージを再送信します。メッセージは新しいものでなければならず、メッセージの時間のフィールドは1より大きくなければなりません。マルチポイントリレーは、ネットワーク内のブロードキャストメッセージを拡散しながら、冗長な再輸送の数を減らす手法です。"
    },
    {
      "indent": 3,
      "text": "Neighbor",
      "ja": "近所の人"
    },
    {
      "indent": 6,
      "text": "A \"neighbor\" is any other node to which data may be propagated directly over the communications medium without relying on the assistance of any other forwarding node.",
      "ja": "「Neighbor」は、他の転送ノードの支援に依存することなく、通信媒体を介してデータを直接伝播できる他のノードです。"
    },
    {
      "indent": 3,
      "text": "Neighborhood",
      "ja": "近所"
    },
    {
      "indent": 6,
      "text": "All the nodes which can receive data on the same link from one node whenever it transmits data.",
      "ja": "データを送信するたびに、1つのノードから同じリンク上のデータを受信できるすべてのノード。"
    },
    {
      "indent": 3,
      "text": "Next hop",
      "ja": "次のホップ"
    },
    {
      "indent": 6,
      "text": "A neighbor which has been selected to forward packets along the way to a particular destination.",
      "ja": "特定の目的地への道に沿ってパケットを転送するために選択された隣人。"
    },
    {
      "indent": 3,
      "text": "Payload",
      "ja": "ペイロード"
    },
    {
      "indent": 6,
      "text": "The actual data within a packet, not including network protocol headers which were not inserted by an application. Note that payloads are different between layers: application data is the payload of TCP, which are the payload of IP, which three are the payload of link layer protocols etc. Thus, it is important to identify the scope when talking about payloads.",
      "ja": "パケット内の実際のデータは、アプリケーションによって挿入されていないネットワークプロトコルヘッダーを含めません。ペイロードはレイヤー間で異なることに注意してください。アプリケーションデータはTCPのペイロードであり、これはIPのペイロードであり、3つはリンクレイヤープロトコルなどのペイロードです。したがって、ペイロードについて話すときに範囲を識別することが重要です。"
    },
    {
      "indent": 3,
      "text": "Prefix",
      "ja": "プレフィックス"
    },
    {
      "indent": 6,
      "text": "A bit string that consists of some number of initial bits of an address.",
      "ja": "アドレスのいくつかの初期ビットで構成されるビット文字列。"
    },
    {
      "indent": 3,
      "text": "Routing table",
      "ja": "ルーティングテーブル"
    },
    {
      "indent": 6,
      "text": "The table where forwarding nodes keep information (including next hop) for various destinations.",
      "ja": "転送ノードがさまざまな宛先の情報（次のホップを含む）を保持するテーブル。"
    },
    {
      "indent": 3,
      "text": "Route entry",
      "ja": "ルートエントリ"
    },
    {
      "indent": 6,
      "text": "An entry for a specific destination (unicast or multicast) in the routing table.",
      "ja": "ルーティングテーブルの特定の宛先（ユニキャストまたはマルチキャスト）のエントリ。"
    },
    {
      "indent": 3,
      "text": "Route establishment",
      "ja": "ルート確立"
    },
    {
      "indent": 6,
      "text": "The process of determining a route between a source and a destination.",
      "ja": "ソースと宛先の間のルートを決定するプロセス。"
    },
    {
      "indent": 3,
      "text": "Route activation",
      "ja": "ルートアクティベーション"
    },
    {
      "indent": 6,
      "text": "The process of putting a route into use after it has been determined.",
      "ja": "ルートを決定した後に使用するプロセス。"
    },
    {
      "indent": 3,
      "text": "Routing proxy",
      "ja": "ルーティングプロキシ"
    },
    {
      "indent": 6,
      "text": "A node that routes packets by overlays, e.g., by tunneling, between communicating partners. The Home Agent and Foreign Agent are examples of routing proxies, in that they receive packets destined for the mobile node and tunnel them to the current address of the mobile node.",
      "ja": "パートナーを通信する間、トンネリングによるオーバーレイでパケットをルーティングするノード。ホームエージェントと外国人エージェントは、ルーティングプロキシの例であり、モバイルノード用のパケットを受け取り、モバイルノードの現在のアドレスにトンネルします。"
    },
    {
      "indent": 3,
      "text": "Shannon's Law",
      "ja": "シャノンの法律"
    },
    {
      "indent": 6,
      "text": "A statement defining the theoretical maximum rate at which error-free digits can be transmitted over a bandwidth-limited channel in the presence of noise. No practical error correction coding system exists that can closely approach the theoretical performance limit given by Shannon's law.",
      "ja": "ノイズの存在下で帯域幅制限チャネル上にエラーのない数字を送信できる理論的最大レートを定義するステートメント。シャノンの法律で与えられた理論的パフォーマンスの制限に密接にアプローチできる実用的なエラー補正コーディングシステムは存在しません。"
    },
    {
      "indent": 3,
      "text": "Signal strength",
      "ja": "シグナル強度"
    },
    {
      "indent": 6,
      "text": "The detectable power of the signal carrying the data bits, as seen by the receiver of the signal.",
      "ja": "信号の受信機に見られるように、データビットを運ぶ信号の検出可能な電力。"
    },
    {
      "indent": 3,
      "text": "Source route",
      "ja": "ソースルート"
    },
    {
      "indent": 6,
      "text": "A source route from node A to node B is an ordered list of IP addresses, starting with the IP address of node A and ending with the IP address of the node B. Between A and B, the source route includes an ordered list of intermediate hops between A and B, as well as the interface index of the interface through which the packet should be transmitted to reach the next hop. The list of intermediate hops might not include all visited nodes, some hops might be omitted for a reason or another.",
      "ja": "ノードAからノードBへのソースルートは、ノードAのIPアドレスから始まり、ノードBのIPアドレスで終了するIPアドレスの順序付きリストです。AとBの間に、ソースルートには中間体の順序付きリストが含まれています。AとBの間のホップ、およびパケットを送信するインターフェイスのインターフェイスインデックスを次のホップに到達するようにします。中間ホップのリストには、訪問されたすべてのノードが含まれているわけではありません。いくつかのホップは理由で省略される場合があります。"
    },
    {
      "indent": 3,
      "text": "Spatial re-use",
      "ja": "空間の再利用"
    },
    {
      "indent": 6,
      "text": "Simultaneous use of channels with identical or close physical characteristics, but located spatially far enough apart to avoid interference (i.e., co-channel interference)",
      "ja": "同一または密接な物理的特性を持つチャネルの同時使用ですが、干渉を避けるために空間的に離れている（つまり、共同チャネル干渉）"
    },
    {
      "indent": 3,
      "text": "System-wide broadcast",
      "ja": "システム全体のブロードキャスト"
    },
    {
      "indent": 6,
      "text": "Same as flooding, but used in contrast to local broadcast.",
      "ja": "洪水と同じですが、地元の放送とは対照的に使用されます。"
    },
    {
      "indent": 3,
      "text": "Subnet",
      "ja": "サブネット"
    },
    {
      "indent": 6,
      "text": "A subnet is a logical group of connected network nodes. In IP networks, nodes in a subnet share a common network mask (in IPV4) or a network prefix (in IPv6).",
      "ja": "サブネットは、接続されたネットワークノードの論理グループです。IPネットワークでは、サブネット内のノードは共通ネットワークマスク（IPv4）またはネットワークプレフィックス（IPv6）を共有します。"
    },
    {
      "indent": 3,
      "text": "Topology (Network Topology)",
      "ja": "トポロジ（ネットワークトポロジ）"
    },
    {
      "indent": 6,
      "text": "The interconnection structure of a network: which nodes are directly connected to each other, and through which links they are connected. Some simple topologies have been given names, such as for instance 'bus topology', 'mesh topology', 'ring topology', 'star topology' and 'tree topology'.",
      "ja": "ネットワークの相互接続構造：どのノードが互いに直接接続され、どのリンクが接続されているか。「バストポロジー」、「メッシュトポロジ」、「リングトポロジ」、「スタートポロジ」、「ツリートポロジー」など、いくつかの単純なトポロジには名前が付けられています。"
    },
    {
      "indent": 3,
      "text": "Triggered update",
      "ja": "トリガーされた更新"
    },
    {
      "indent": 6,
      "text": "A solicited route update transmitted by a router along a path to a destination.",
      "ja": "ルーターによって宛先へのパスに沿って送信された勧誘されたルート更新。"
    },
    {
      "indent": 0,
      "text": "3. Mobile Access Networks and Mobile Networks",
      "section_title": true,
      "ja": "3. モバイルアクセスネットワークとモバイルネットワーク"
    },
    {
      "indent": 3,
      "text": "In order to support host mobility a set of nodes towards the network edge may need to have specific functions. Such a set of nodes forms a mobile access network that may or may not be part of the global Internet. Figure 1 presents two examples of such access network topologies. The figure depicts a reference architecture which illustrates an IP network with components defined in this section.",
      "ja": "ホストのモビリティをサポートするには、ネットワークエッジに向かって一連のノードが特定の機能を持つ必要がある場合があります。このような一連のノードは、グローバルなインターネットの一部である場合とそうでない場合があるモバイルアクセスネットワークを形成します。図1は、このようなアクセスネットワークトポロジの2つの例を示しています。この図は、このセクションで定義されているコンポーネントを含むIPネットワークを示す参照アーキテクチャを示しています。"
    },
    {
      "indent": 3,
      "text": "We intend to define the concept of the Access Network (AN) which may also support enhanced mobility. It is possible that to support routing and QoS for mobile nodes, existing routing protocols (e.g., Open Shortest Path First (OSPF) [14]) may not be appropriate to maintain forwarding information for these mobile nodes as they change their points of attachment to the Access Network. These new functions are implemented in routers with additional capabilities. We can distinguish three types of Access Network components: Access Routers (AR) which handle the last hop to the mobile, typically over a wireless link; Access Network Gateways (ANG) which form the boundary on the fixed network side and shield the fixed network from the specialized routing protocols; and (optionally) other internal Access Network Routers which may also be needed in some cases to support the functions. The Access Network consists of the equipment needed to support this specialized routing, i.e., AR or ANG. AR and ANG may be the same physical nodes.",
      "ja": "モビリティの強化もサポートする可能性のあるアクセスネットワーク（AN）の概念を定義する予定です。モバイルノードのルーティングとQoSをサポートするために、既存のルーティングプロトコル（例：Open Shortest Path First（OSPF）[14]）は、添付のポイントを変更するため、これらのモバイルノードの転送情報を維持するのに適していない場合があります。アクセスネットワーク。これらの新しい機能は、追加の機能を備えたルーターに実装されています。3つのタイプのアクセスネットワークコンポーネントを区別できます。次のように、最後のホップをモバイルに処理するアクセスルーター（AR）、通常はワイヤレスリンクを介して。固定ネットワーク側の境界を形成し、固定ネットワークを特殊なルーティングプロトコルから保護するアクセスネットワークゲートウェイ（ANG）。（オプションで）機能をサポートするために必要になる可能性のある他の内部アクセスネットワークルーター。アクセスネットワークは、この専門的なルーティング、つまりARまたはANGをサポートするために必要な機器で構成されています。ARとANGは同じ物理ノードである場合があります。"
    },
    {
      "indent": 3,
      "text": "In addition, we present a few basic terms on mobile networks, that is, mobile network, mobile router (MR), and mobile network node (MNN). More terminology for discussing mobile networks can be found in [13]. A more thorough discussion of mobile networks can be found in the working group documents of the NEMO Working Group.",
      "ja": "さらに、モバイルネットワーク、つまりモバイルネットワーク、モバイルルーター（MR）、モバイルネットワークノード（MNN）にいくつかの基本的な用語を提示します。モバイルネットワークを議論するためのより多くの用語は、[13]にあります。モバイルネットワークのより徹底的な議論は、NEMOワーキンググループのワーキンググループドキュメントで見つけることができます。"
    },
    {
      "indent": 3,
      "text": "Note: this reference architecture is not well suited for people dealing with Mobile Ad-hoc Networks (MANET).",
      "ja": "注：このリファレンスアーキテクチャは、モバイルアドホックネットワーク（MANET）を扱う人々にはあまり適していません。"
    },
    {
      "indent": 3,
      "text": "                                                                |\n                                                                |\n                  ---        ------                    -------  |\n     ---  | <-->  | | -------| AR | -------------------|     |  |\n     | |--[]      ---        /------          \\       /| ANG |--|\n     ---            AP      /                  \\     / |     |  |\n      MH                   /                    \\   /  -------  |\n(with wireless     ___    /                    -------          |\n     device)       | |----                     | ANR |          |\n                   ---                         -------          |\n                    AP                          /   \\           |\n                                               /     \\ -------  |\n                  ---       ------            /       \\|     |  |\n                  | |-------| AR |---------------------| ANG |--|\n                  ---       ------                     |     |  |\n                   AP                                  -------  |\n                                                                |\n                       Access Network (AN) 1                    |\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -  -|\n                       Access Network (AN) 2                    |\n                                                                |\n                                                                |\n                  ---        ------                    -------  |\n    ---  | <-->   | | -------| AR | -------------------|     |  |\n    | |--[]       ---       /------                   /| ANG |--|\n    ---            AP      /                         / |     |  |\n     MH                   /                         /  -------  |\n(with wireless    ___    /                         /            |\n    device)       | |----                         /             |\n                  ---                            /              |\n                   AP                           /               |\n                                               /                |\n    |            ---       ------         -------               |\n--- |       | <->| |-------| AR |---------| ANR |               |\n| |-|      []    ---  \\    ------         -------               |\n--- |  -----|     AP   \\                  /                     |\nMNN |--i MR e           \\                /                      |\n    |  ------    ---     \\ ------       /                       |\n--- | (with      | |-------| AR |-------                        |\n| |-| wireless   ---       ------                               |\n--- |  device)    AP                                            |\nMNN                                 'i': MR ingress interface   |\n                                    'e': MR egress interface    |\n                                                                |",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 16,
      "text": "Figure 1: Reference Network Architecture",
      "ja": "図1：参照ネットワークアーキテクチャ"
    },
    {
      "indent": 3,
      "text": "Mobile Node (MN)",
      "ja": "モバイルノード（MN）"
    },
    {
      "indent": 6,
      "text": "An IP node capable of changing its point of attachment to the network. A Mobile Node may either be a Mobile Host (no forwarding functionality) or a Mobile Router (forwarding functionality).",
      "ja": "ネットワークへの添付ポイントを変更できるIPノード。モバイルノードは、モバイルホスト（転送機能なし）またはモバイルルーター（転送機能）のいずれかです。"
    },
    {
      "indent": 3,
      "text": "Mobile Host (MH)",
      "ja": "モバイルホスト（MH）"
    },
    {
      "indent": 6,
      "text": "A mobile node that is an end host and not a router. A Mobile Host is capable of sending and receiving packets, that is, being a source or destination of traffic, but not a forwarder of it.",
      "ja": "ルーターではなく、エンドホストであるモバイルノード。モバイルホストは、パケットを送信および受信することができます。つまり、トラフィックのソースまたは宛先であるが、その先送り機ではない。"
    },
    {
      "indent": 3,
      "text": "Fixed Node (FN)",
      "ja": "固定ノード（FN）"
    },
    {
      "indent": 6,
      "text": "A node, either a host or a router, unable to change its point of attachment to the network and its IP address without breaking open sessions.",
      "ja": "ホストまたはルーターのいずれかのノードは、オープンセッションを壊すことなく、ネットワークとIPアドレスへの添付ポイントを変更できません。"
    },
    {
      "indent": 3,
      "text": "Mobile network",
      "ja": "モバイルネットワーク"
    },
    {
      "indent": 6,
      "text": "An entire network, moving as a unit, which dynamically changes its point of attachment to the Internet and thus its reachability in the topology. The mobile network is composed of one or more IP-subnets and is connected to the global Internet via one or more Mobile Routers (MR). The internal configuration of the mobile network is assumed to be relatively stable with respect to the MR.",
      "ja": "ネットワーク全体がユニットとして移動します。これにより、インターネットへの添付のポイントを動的に変更し、トポロジの到達可能性を動的に変更します。モバイルネットワークは1つ以上のIP-Subnetsで構成されており、1つ以上のモバイルルーター（MR）を介してグローバルインターネットに接続されています。モバイルネットワークの内部構成は、MRに関して比較的安定していると想定されています。"
    },
    {
      "indent": 3,
      "text": "Mobile Router (MR)",
      "ja": "モバイルルーター（MR）"
    },
    {
      "indent": 6,
      "text": "A router capable of changing its point of attachment to the network, moving from one link to another link. The MR is capable of forwarding packets between two or more interfaces, and possibly running a dynamic routing protocol modifying the state by which it does packet forwarding.",
      "ja": "ネットワークへのアタッチメントポイントを変更して、あるリンクから別のリンクに移動できるルーター。MRは、2つ以上のインターフェイス間でパケットを転送し、おそらくパケット転送を行う状態を変更する動的なルーティングプロトコルを実行することができます。"
    },
    {
      "indent": 6,
      "text": "A MR acting as a gateway between an entire mobile network and the rest of the Internet has one or more egress interface(s) and one or more ingress interface(s). Packets forwarded upstream to the rest of the Internet are transmitted through one of the MR's egress interface; packets forwarded downstream to the mobile network are transmitted through one of the MR's ingress interface.",
      "ja": "モバイルネットワーク全体と他のインターネットの間のゲートウェイとして機能するMRには、1つ以上の出口インターフェイスと1つ以上のインターフェースインターフェイスがあります。インターネットの残りの部分に上流に転送されたパケットは、MRの出口インターフェイスの1つを介して送信されます。下流のモバイルネットワークに転送されたパケットは、MRのIngressインターフェイスの1つを介して送信されます。"
    },
    {
      "indent": 3,
      "text": "Ingress interface",
      "ja": "イングレスインターフェイス"
    },
    {
      "indent": 6,
      "text": "The interface of a MR attached to a link inside the mobile network.",
      "ja": "モバイルネットワーク内のリンクに接続されたMRのインターフェイス。"
    },
    {
      "indent": 3,
      "text": "Egress interface",
      "ja": "出力インターフェイス"
    },
    {
      "indent": 6,
      "text": "The interface of a MR attached to the home link if the MR is at home, or attached to a foreign link if the MR is in a foreign network.",
      "ja": "MRが自宅にいる場合、またはMRが外国のネットワークにいる場合は外国リンクに接続されている場合、MRのホームリンクに取り付けられたMRのインターフェイス。"
    },
    {
      "indent": 3,
      "text": "Mobile Network Node (MNN)",
      "ja": "モバイルネットワークノード（MNN）"
    },
    {
      "indent": 6,
      "text": "Any node (host or router) located within a mobile network, either permanently or temporarily. A Mobile Network Node may either be a mobile node or a fixed node.",
      "ja": "モバイルネットワーク内にあるノード（ホストまたはルーター）は、永続的または一時的に。モバイルネットワークノードは、モバイルノードまたは固定ノードのいずれかです。"
    },
    {
      "indent": 3,
      "text": "Access Link (AL)",
      "ja": "アクセスリンク（AL）"
    },
    {
      "indent": 6,
      "text": "A last-hop link between a Mobile Node and an Access Point. That is, a facility or medium over which an Access Point and the Mobile Node can communicate at the link layer, i.e., the layer immediately below IP.",
      "ja": "モバイルノードとアクセスポイントの間の最終ホップリンク。つまり、アクセスポイントとモバイルノードがリンクレイヤー、つまりIPのすぐ下のレイヤーで通信できる機能または媒体です。"
    },
    {
      "indent": 3,
      "text": "Access Point (AP)",
      "ja": "アクセスポイント（AP）"
    },
    {
      "indent": 6,
      "text": "An Access Point is a layer 2 device which is connected to one or more Access Routers and offers the wireless link connection to the Mobile Node. Access Points are sometimes called base stations or access point transceivers. An Access Point may be a separate entity or co-located with an Access Router.",
      "ja": "アクセスポイントは、1つ以上のアクセスルーターに接続され、モバイルノードへのワイヤレスリンク接続を提供するレイヤー2デバイスです。アクセスポイントは、ベースステーションまたはアクセスポイントトランシーバーと呼ばれることもあります。アクセスポイントは、個別のエンティティであるか、アクセスルーターと共同住宅である場合があります。"
    },
    {
      "indent": 3,
      "text": "Radio Cell",
      "ja": "無線セル"
    },
    {
      "indent": 6,
      "text": "The geographical area within which an Access Point provides radio coverage, i.e., where radio communication between a Mobile Node and the specific Access Point is possible.",
      "ja": "アクセスポイントが無線カバレッジを提供する地理的領域、つまり、モバイルノードと特定のアクセスポイント間の無線通信が可能です。"
    },
    {
      "indent": 3,
      "text": "Access Network Router (ANR)",
      "ja": "アクセスネットワークルーター（ANR）"
    },
    {
      "indent": 6,
      "text": "An IP router in the Access Network. An Access Network Router may include Access Network specific functionalities, for example, related to mobility and/or QoS. This is to distinguish between ordinary routers and routers that have Access Network-related special functionality.",
      "ja": "アクセスネットワークのIPルーター。アクセスネットワークルーターには、モビリティやQOに関連するたとえば、アクセスネットワーク固有の機能が含まれる場合があります。これは、ネットワーク関連の特殊機能にアクセスできる通常のルーターとルーターを区別するためです。"
    },
    {
      "indent": 3,
      "text": "Access Router (AR)",
      "ja": "アクセスルーター（AR）"
    },
    {
      "indent": 6,
      "text": "An Access Network Router residing on the edge of an Access Network and connected to one or more Access Points. The Access Points may be of different technology. An Access Router offers IP connectivity to Mobile Nodes, acting as a default router to the Mobile Nodes it is currently serving. The Access Router may include intelligence beyond a simple forwarding service offered by ordinary IP routers.",
      "ja": "アクセスネットワークの端にあるアクセスネットワークルーターは、1つ以上のアクセスポイントに接続されています。アクセスポイントは異なる技術のものである可能性があります。アクセスルーターは、モバイルノードへのIP接続を提供し、現在提供されているモバイルノードのデフォルトルーターとして機能します。アクセスルーターには、通常のIPルーターが提供する単純な転送サービスを超えたインテリジェンスが含まれる場合があります。"
    },
    {
      "indent": 3,
      "text": "Access Network Gateway (ANG)",
      "ja": "アクセスネットワークゲートウェイ（ANG）"
    },
    {
      "indent": 6,
      "text": "An Access Network Router that separates an Access Network from other IP networks, much in the same way as an ordinary gateway router. The Access Network Gateway looks to the other IP networks like a standard IP router. In a small network, an ANG may also offer the services of an AR, namely offer the IP connectivity to the mobile nodes.",
      "ja": "通常のゲートウェイルーターとほぼ同じ方法で、アクセスネットワークを他のIPネットワークから分離するアクセスネットワークルーター。Access Network Gatewayは、標準のIPルーターのような他のIPネットワークを参照しています。小さなネットワークでは、ANGはARのサービスを提供する場合があります。つまり、モバイルノードへのIP接続を提供します。"
    },
    {
      "indent": 3,
      "text": "Access Network (AN)",
      "ja": "アクセスネットワーク（an）"
    },
    {
      "indent": 6,
      "text": "An IP network which includes one or more Access Network Routers.",
      "ja": "1つ以上のアクセスネットワークルーターを含むIPネットワーク。"
    },
    {
      "indent": 3,
      "text": "Administrative Domain (AD)",
      "ja": "管理ドメイン（AD）"
    },
    {
      "indent": 6,
      "text": "A collection of networks under the same administrative control and grouped together for administrative purposes [5].",
      "ja": "同じ管理制御の下でネットワークのコレクションと、管理目的でグループ化された[5]。"
    },
    {
      "indent": 3,
      "text": "Serving Access Router (SAR)",
      "ja": "アクセスルーター（SAR）のサービング"
    },
    {
      "indent": 6,
      "text": "The Access Router currently offering the connectivity to the MN. This is usually the point of departure for the MN as it makes its way towards a new Access Router (at which time the Serving Access Router takes the role of the Previous Access Router). There may be several Serving Access Routers serving the Mobile Node at the same time.",
      "ja": "現在、MNへの接続を提供しているアクセスルーター。これは通常、MNの出発点です。新しいアクセスルーター（その時点で、サービングアクセスルーターが以前のアクセスルーターの役割を担う）に向かっています。モバイルノードを同時に提供するアクセスルーターをいくつか提供する場合があります。"
    },
    {
      "indent": 3,
      "text": "New Access Router (NAR)",
      "ja": "新しいアクセスルーター（NAR）"
    },
    {
      "indent": 6,
      "text": "The Access Router that offers connectivity to the Mobile Node after a handover.",
      "ja": "ハンドオーバー後にモバイルノードへの接続を提供するアクセスルーター。"
    },
    {
      "indent": 3,
      "text": "Previous Access Router (PAR)",
      "ja": "以前のアクセスルーター（PAR）"
    },
    {
      "indent": 6,
      "text": "An Access Router that offered connectivity to the Mobile Node prior to a handover. This is the Serving Access Router that will cease or has ceased to offer connectivity to the Mobile Node. Often also called Old Access Router (OAR).",
      "ja": "ハンドオーバー前にモバイルノードへの接続を提供するアクセスルーター。これは、モバイルノードへの接続を停止または停止するサービングアクセスルーターです。多くの場合、古いアクセスルーター（OAR）とも呼ばれます。"
    },
    {
      "indent": 3,
      "text": "Candidate Access Router (CAR)",
      "ja": "候補者アクセスルーター（車）"
    },
    {
      "indent": 6,
      "text": "An Access Router to which the Mobile Node may do a handoff. See Section 4.8.",
      "ja": "モバイルノードがハンドオフを行う可能性のあるアクセスルーター。セクション4.8を参照してください。"
    },
    {
      "indent": 0,
      "text": "4. Handover Terminology",
      "section_title": true,
      "ja": "4. ハンドオーバー用語"
    },
    {
      "indent": 3,
      "text": "These terms refer to different perspectives and approaches to supporting different aspects of mobility. Distinctions can be made according to the scope, range overlap, performance characteristics, diversity characteristics, state transitions, mobility types, and control modes of handover techniques.",
      "ja": "これらの用語は、モビリティのさまざまな側面をサポートするためのさまざまな視点とアプローチを指します。区別は、範囲、範囲の重複、パフォーマンス特性、多様性の特性、状態遷移、モビリティタイプ、およびハンドオーバーテクニックの制御モードに応じて行うことができます。"
    },
    {
      "indent": 3,
      "text": "Roaming",
      "ja": "ローミング"
    },
    {
      "indent": 6,
      "text": "An operator-based term involving formal agreements between operators that allows a mobile to get connectivity from a foreign network. Roaming (a particular aspect of user mobility) includes, for example, the functionality by which users can communicate their identity to the local AN so that inter-AN agreements can be activated and service and applications in the MN's home network can be made available to the user locally.",
      "ja": "モバイルが外国ネットワークから接続を取得できるようにするオペレーター間の正式な契約を含むオペレーターベースの用語。ローミング（ユーザーモビリティの特定の側面）には、たとえば、ユーザーが自分の身元をローカルに伝えることができる機能が含まれます。ユーザーはローカルです。"
    },
    {
      "indent": 3,
      "text": "Handover",
      "ja": "引き渡す"
    },
    {
      "indent": 6,
      "text": "The process by which an active MN (in the Active State, see section 4.6) changes its point of attachment to the network, or when such a change is attempted. The access network may provide features to minimize the interruption to sessions in progress. Also called handoff.",
      "ja": "アクティブなMN（アクティブ状態、セクション4.6を参照）がネットワークへのアタッチメントポイントを変更するプロセス、またはそのような変更が試みられた場合。アクセスネットワークは、進行中のセッションの中断を最小限に抑える機能を提供する場合があります。ハンドオフとも呼ばれます。"
    },
    {
      "indent": 6,
      "text": "There are different types of handover classified according to different aspects involved in the handover. Some of this terminology follows the description in [4].",
      "ja": "ハンドオーバーに関与するさまざまな側面に従って分類されたさまざまな種類のハンドオーバーがあります。この用語の一部は、[4]の説明に従います。"
    },
    {
      "indent": 0,
      "text": "4.1. Scope of Handover",
      "section_title": true,
      "ja": "4.1. ハンドオーバーの範囲"
    },
    {
      "indent": 3,
      "text": "Layer 2 handover",
      "ja": "レイヤー2ハンドオーバー"
    },
    {
      "indent": 6,
      "text": "A handover where the MN changes APs (or some other aspect of the radio channel) connected to the same AR's interface. This type of handover is transparent to the routing at the IP layer (or it appears simply as a link layer reconfiguration without any mobility implications).",
      "ja": "MNが同じARのインターフェイスに接続されたAP（または無線チャネルの他の側面）を変更するハンドオーバー。このタイプのハンドオーバーは、IPレイヤーでのルーティングに対して透過的です（または、モビリティの影響なしにリンクレイヤーの再構成として単に表示されます）。"
    },
    {
      "indent": 3,
      "text": "Intra-AR handover",
      "ja": "Intra-ar Handover"
    },
    {
      "indent": 6,
      "text": "A handover which changes the AR's network interface to the mobile. That is, the Serving AR remains the same but routing changes internal to the AR take place.",
      "ja": "ARのネットワークインターフェイスをモバイルに変更するハンドオーバー。つまり、サービングARは同じままですが、ARの内部のルーティングの変更が行われます。"
    },
    {
      "indent": 3,
      "text": "Intra-AN handover",
      "ja": "イントラハンドオーバー"
    },
    {
      "indent": 6,
      "text": "A handover where the MN changes ARs inside the same AN. Such a handover is not necessarily visible outside the AN. In case the ANG serving the MN changes, this handover is seen outside the AN due to a change in the routing paths. Note that the ANG may change for only some of the MN's data flows.",
      "ja": "MNが変更されるハンドオーバーは、同じan内でARを使用します。そのようなハンドオーバーは、必ずしもANの外に見えるわけではありません。MNにサービスを提供するANGが変更された場合、このハンドオーバーは、ルーティングパスの変更により、ANの外で見られます。ANGは、MNのデータフローの一部で変更される可能性があることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Inter-AN handover",
      "ja": "インターアンドハンドオーバー"
    },
    {
      "indent": 6,
      "text": "A handover where the MN moves to a new AN. This requires support for macro mobility. Note that this would have to involve the assignment of a new IP access address (e.g., a new care-of address) to the MN.",
      "ja": "MNが新しいanに移動するハンドオーバー。これには、マクロモビリティのサポートが必要です。これには、MNへの新しいIPアクセスアドレス（たとえば、新しいケアのケア）の割り当てが必要であることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Intra-technology handover",
      "ja": "テクノロジー内ハンドオーバー"
    },
    {
      "indent": 6,
      "text": "A handover between equipment of the same technology.",
      "ja": "同じ技術の機器間の引き渡し。"
    },
    {
      "indent": 3,
      "text": "Inter-technology handover",
      "ja": "テクノロジー間ハンドオーバー"
    },
    {
      "indent": 6,
      "text": "A handover between equipment of different technologies.",
      "ja": "さまざまな技術の機器間の引き渡し。"
    },
    {
      "indent": 3,
      "text": "Horizontal handover",
      "ja": "水平ハンドオーバー"
    },
    {
      "indent": 6,
      "text": "This involves MNs moving between access points of the same type (in terms of coverage, data rate and mobility), such as, UMTS to UMTS, or WLAN to WLAN.",
      "ja": "これには、同じタイプのアクセスポイント間を移動するMNS（カバレッジ、データレート、モビリティの観点から）、UMTからUMTS、またはWLANからWLANなどが含まれます。"
    },
    {
      "indent": 3,
      "text": "Vertical handover",
      "ja": "垂直ハンドオーバー"
    },
    {
      "indent": 6,
      "text": "This involves MNs moving between access points of different type, such as, UMTS to WLAN.",
      "ja": "これには、wlanからumtsなどの異なるタイプのアクセスポイント間を移動するMNが含まれます。"
    },
    {
      "indent": 3,
      "text": "Note that the difference between a horizontal and vertical handover is vague. For example, a handover from an AP with 802.11b WLAN link to an AP with 802.11g WLAN link may be considered as either a vertical or a horizontal handover, depending on an individual's point of view.",
      "ja": "水平方向と垂直のハンドオーバーの違いはあいまいであることに注意してください。たとえば、802.11b WLANリンクを備えたAPから802.11g WLANリンクを持つAPへの引き渡しは、個人の観点に応じて、垂直または水平のハンドオーバーのいずれかと見なされる場合があります。"
    },
    {
      "indent": 3,
      "text": "Note also that the IP layer sees network interfaces and IP addresses, rather than specific technologies used by those interfaces. Thus, horizontal and vertical handovers may or may not be noticed at the IP layer. Usually a handover can be noticed if the IP address assigned to the interface changes, the network interface itself changes (which can also change the IP address), or there is a link outage, for example, when the mobile node moves out of coverage for a while. For example, in a GPRS network a horizontal handover happens usually unnoticed by the IP layer. Similarly, a WLAN horizontal handover may be noticed if the IP address of the interface changes. On the other hand, vertical handovers often change the network interface and are, therefore, noticed on the IP layer. Still, some specific network cards may be able to switch between access technologies (e.g., GPRS to UMTS) without changing the network interface. Moreover, either of the two handovers may or may not result in changing the AR. For example, an AR could control WLAN and Bluetooth access points, and the mobile node could do horizontal and vertical handovers under the same AR without changing its IP address or even the network interface.",
      "ja": "また、IPレイヤーには、これらのインターフェイスで使用される特定のテクノロジーではなく、ネットワークインターフェイスとIPアドレスが表示されることに注意してください。したがって、水平および垂直のハンドオーバーは、IPレイヤーで気付かない場合があります。通常、インターフェイスに割り当てられたIPアドレスが変更された場合、ネットワークインターフェイス自体が変更され（IPアドレスも変更される可能性がある）、またはモバイルノードがカバレッジから移動する場合、リンクの停止がある場合、ハンドオーバーに気付くことができます。しばらく。たとえば、GPRSネットワークでは、通常、IPレイヤーに気付かれない水平方向のハンドオーバーが発生します。同様に、インターフェイスのIPアドレスが変更された場合、WLAN水平ハンドオーバーに気付く場合があります。一方、垂直の拳銃はしばしばネットワークインターフェイスを変更するため、IPレイヤーで気付かれます。それでも、一部の特定のネットワークカードは、ネットワークインターフェイスを変更せずにアクセステクノロジー（たとえば、GPRSからUMTS）を切り替えることができる場合があります。さらに、2つのハンドオーバーのいずれかがARの変更につながる場合とそうでない場合があります。たとえば、ARはWLANおよびBluetoothアクセスポイントを制御でき、モバイルノードはIPアドレスやネットワークインターフェイスを変更せずに、同じARの下で水平および垂直のハンドオーバーを実行できます。"
    },
    {
      "indent": 0,
      "text": "4.2. Handover Control",
      "section_title": true,
      "ja": "4.2. ハンドオーバーコントロール"
    },
    {
      "indent": 3,
      "text": "A handover must be one of the following two types (a):",
      "ja": "ハンドオーバーは、次の2つのタイプのいずれかでなければなりません（a）。"
    },
    {
      "indent": 6,
      "text": "Mobile-initiated handover",
      "ja": "モバイル開始ハンドオーバー"
    },
    {
      "indent": 9,
      "text": "The MN is the one that makes the initial decision to initiate the handover.",
      "ja": "MNは、ハンドオーバーを開始する最初の決定を下すものです。"
    },
    {
      "indent": 6,
      "text": "Network-initiated handover",
      "ja": "ネットワーク開始ハンドオーバー"
    },
    {
      "indent": 9,
      "text": "The network makes the initial decision to initiate the handover.",
      "ja": "ネットワークは、ハンドオーバーを開始するという最初の決定を下します。"
    },
    {
      "indent": 3,
      "text": "A handover is also one of the following two types (b):",
      "ja": "ハンドオーバーは、次の2つのタイプの1つでもあります（b）。"
    },
    {
      "indent": 6,
      "text": "Mobile-controlled handover",
      "ja": "モバイル制御のハンドオーバー"
    },
    {
      "indent": 9,
      "text": "The MN has the primary control over the handover process.",
      "ja": "MNは、ハンドオーバープロセスを主要な制御しています。"
    },
    {
      "indent": 6,
      "text": "Network-controlled handover",
      "ja": "ネットワーク制御のハンドオーバー"
    },
    {
      "indent": 9,
      "text": "The network has the primary control over the handover process.",
      "ja": "ネットワークは、ハンドオーバープロセスを主要な制御しています。"
    },
    {
      "indent": 3,
      "text": "A handover decision usually involves some sort of measurements about when and where to handover to. Therefore, a handover is also either of these three types (c):",
      "ja": "ハンドオーバーの決定には、通常、いつ、どこに配達するかについての何らかの測定が含まれます。したがって、ハンドオーバーは、これらの3つのタイプ（c）のいずれかです。"
    },
    {
      "indent": 6,
      "text": "Mobile-assisted handover",
      "ja": "モバイル支援ハンドオーバー"
    },
    {
      "indent": 9,
      "text": "Information and measurement from the MN are used by the AR to decide on the execution of a handover.",
      "ja": "MNからの情報と測定は、ARによって使用されて、ハンドオーバーの実行を決定します。"
    },
    {
      "indent": 6,
      "text": "Network-assisted handover",
      "ja": "ネットワーク支援ハンドオーバー"
    },
    {
      "indent": 9,
      "text": "A handover where the AN collects information that can be used by the MN in a handover decision.",
      "ja": "ハンドオーバー決定でMNが使用できる情報を収集するハンドオーバー。"
    },
    {
      "indent": 6,
      "text": "Unassisted handover",
      "ja": "支援のないハンドオーバー"
    },
    {
      "indent": 9,
      "text": "A handover where no assistance is provided by the MN or the AR to each other.",
      "ja": "MNまたはARが互いに支援を提供しないハンドオーバー。"
    },
    {
      "indent": 3,
      "text": "Note that it is possible that the MN and the AR both do measurements and decide on the handover.",
      "ja": "MNとARの両方が測定を行い、引き渡しを決定する可能性があることに注意してください。"
    },
    {
      "indent": 3,
      "text": "A handover is also one of the following two types (d):",
      "ja": "ハンドオーバーは、次の2つのタイプ（d）の1つでもあります。"
    },
    {
      "indent": 6,
      "text": "Push handover",
      "ja": "ハンドオーバーを押します"
    },
    {
      "indent": 9,
      "text": "A handover either initiated by the PAR, or where the MN initiates a handover via the PAR.",
      "ja": "PARによって開始されるハンドオーバー、またはMNがPARを介してハンドオーバーを開始する場所。"
    },
    {
      "indent": 6,
      "text": "Pull handover",
      "ja": "ハンドオーバーを引っ張ります"
    },
    {
      "indent": 9,
      "text": "A handover either initiated by the NAR, or where the MN initiates a handover via the NAR.",
      "ja": "NARによって開始されたハンドオーバー、またはMNがNARを介してハンドオーバーを開始する場所。"
    },
    {
      "indent": 3,
      "text": "The handover is also either proactive or reactive (e):",
      "ja": "ハンドオーバーも積極的またはリアクティブです（e）："
    },
    {
      "indent": 6,
      "text": "Planned handover",
      "ja": "計画されたハンドオーバー"
    },
    {
      "indent": 9,
      "text": "A proactive (expected) handover where some signaling can be done in advance of the MN getting connected to the new AR, e.g., building a temporary tunnel from the previous AR to the new AR.",
      "ja": "MNが新しいARに接続される前にいくつかのシグナル伝達を行うことができるプロアクティブな（予想）ハンドオーバー、たとえば、前のARから新しいARに一時的なトンネルを構築します。"
    },
    {
      "indent": 6,
      "text": "Unplanned handover",
      "ja": "計画外のハンドオーバー"
    },
    {
      "indent": 9,
      "text": "A reactive (unexpected) handover where no signaling is done in advance of the MN's move from the previous AR to the new AR.",
      "ja": "以前のARから新しいARへのMNの移動に先立ってシグナリングが行われないリアクティブな（予期しない）ハンドオーバー。"
    },
    {
      "indent": 3,
      "text": "The five handover types (a-e) are mostly independent, and every handover should be classifiable according to each of these types.",
      "ja": "5つのハンドオーバータイプ（A-E）はほとんど独立しており、これらの各タイプに従ってすべてのハンドオーバーは分類可能です。"
    },
    {
      "indent": 0,
      "text": "4.3. Simultaneous connectivity to Access Routers",
      "section_title": true,
      "ja": "4.3. アクセスルーターへの同時接続"
    },
    {
      "indent": 3,
      "text": "Make-before-break (MBB)",
      "ja": "壊れる前（MBB）"
    },
    {
      "indent": 6,
      "text": "During a MBB handover the MN makes the new connection before the old one is broken. Thus, the MN can communicate simultaneously with the old and new AR during the handover. This should not be confused with \"soft handover\" which relies on macro diversity, described in Section 4.5.",
      "ja": "MBBのハンドオーバー中に、MNは古いものが壊れる前に新しい接続を作成します。したがって、MNは、ハンドオーバー中に古いARと新しいARと同時に通信することができます。これは、セクション4.5で説明されているマクロの多様性に依存する「ソフトハンドオーバー」と混同しないでください。"
    },
    {
      "indent": 3,
      "text": "Break-before-make (BBM)",
      "ja": "ブレークメイク（BBM）"
    },
    {
      "indent": 6,
      "text": "During a BBM handover the MN breaks the old connection before the new connection is made. Thus, the MN cannot communicate simultaneously with the old and the new AR.",
      "ja": "BBMのハンドオーバー中に、MNは新しい接続が行われる前に古い接続を破ります。したがって、MNは古いARと新しいARと同時に通信することはできません。"
    },
    {
      "indent": 0,
      "text": "4.4. Performance and Functional Aspects",
      "section_title": true,
      "ja": "4.4. パフォーマンスと機能的な側面"
    },
    {
      "indent": 3,
      "text": "Handover latency",
      "ja": "ハンドオーバーレイテンシ"
    },
    {
      "indent": 6,
      "text": "Handover latency is the difference between the time a MN is last able to send and/or receive an IP packet by way of the PAR, and the time the MN is able to send and/or receive an IP packet through the NAR. Adapted from [4].",
      "ja": "ハンドオーバーレイテンシとは、MNが最後にPARによってIPパケットを送信および/または受信できる時間と、MNがNARを介してIPパケットを送信および/または受信できる時間との違いです。[4]から適応。"
    },
    {
      "indent": 3,
      "text": "Smooth handover",
      "ja": "スムーズなハンドオーバー"
    },
    {
      "indent": 6,
      "text": "A handover that aims primarily to minimize packet loss, with no explicit concern for additional delays in packet forwarding.",
      "ja": "主にパケットの損失を最小限に抑えることを目的とするハンドオーバーであり、パケット転送の追加の遅延について明示的な懸念はありません。"
    },
    {
      "indent": 3,
      "text": "Fast handover",
      "ja": "速いハンドオーバー"
    },
    {
      "indent": 6,
      "text": "A handover that aims primarily to minimize handover latency, with no explicit interest in packet loss.",
      "ja": "パケット損失に明確な関心を持たず、主にハンドオーバーレイテンシを最小限に抑えることを目的としたハンドオーバー。"
    },
    {
      "indent": 3,
      "text": "Seamless handover",
      "ja": "シームレスなハンドオーバー"
    },
    {
      "indent": 6,
      "text": "A handover in which there is no change in service capability, security, or quality. In practice, some degradation in service is to be expected. The definition of a seamless handover in the practical case should be that other protocols, applications, or end users do not detect any change in service capability, security or quality, which would have a bearing on their (normal) operation. As a consequence, what would be a seamless handover for one less demanding application might not be seamless for another more demanding application. See [7] for more discussion on the topic.",
      "ja": "サービス機能、セキュリティ、または品質に変更がないハンドオーバー。実際には、サービスにおけるいくらかの劣化が予想されます。実際のケースでのシームレスなハンドオーバーの定義は、他のプロトコル、アプリケーション、またはエンドユーザーが、（通常の）操作に関係するサービス機能、セキュリティ、または品質の変更を検出しないことです。結果として、1つの要求の少ないアプリケーションのシームレスなハンドオーバーとなるものは、別のより要求の厳しいアプリケーションにとってシームレスではないかもしれません。トピックに関する詳細については、[7]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Throughput",
      "ja": "スループット"
    },
    {
      "indent": 6,
      "text": "The amount of data from a source to a destination processed by the protocol for which throughput is to be measured, for instance, IP, TCP, or the MAC protocol. The throughput differs between protocol layers.",
      "ja": "ソースから、たとえばIP、TCP、またはMACプロトコルなど、スループットが測定されるプロトコルによって処理される宛先までのデータの量。スループットはプロトコル層間で異なります。"
    },
    {
      "indent": 3,
      "text": "Goodput",
      "ja": "Goodput"
    },
    {
      "indent": 6,
      "text": "The total bandwidth used, less the volume of control messages, protocol overhead from the data packets, and packets dropped due to CRC errors.",
      "ja": "使用される帯域幅の合計は、制御メッセージの量を減らし、データパケットからのプロトコルオーバーヘッド、およびCRCエラーのためにパケットがドロップしました。"
    },
    {
      "indent": 3,
      "text": "Pathloss",
      "ja": "パスロス"
    },
    {
      "indent": 6,
      "text": "A reduction in signal strength caused by traversing the physical medium constituting the link.",
      "ja": "リンクを構成する物理培地を通過することによって引き起こされる信号強度の低下。"
    },
    {
      "indent": 3,
      "text": "Hidden-terminal problem",
      "ja": "隠された末端の問題"
    },
    {
      "indent": 6,
      "text": "The problem whereby a transmitting node can fail in its attempt to transmit data because of destructive interference which is only detectable at the receiving node, not the transmitting node.",
      "ja": "送信ノードは、送信ノードではなく受信ノードでのみ検出可能な破壊的な干渉のためにデータを送信しようとする試みで失敗する可能性がある問題。"
    },
    {
      "indent": 3,
      "text": "Exposed terminal problem",
      "ja": "露出した端子問題"
    },
    {
      "indent": 6,
      "text": "The problem whereby a transmitting node A prevents another node B from transmitting, although node B could have safely transmitted to anyone else but the transmitting node A.",
      "ja": "送信ノードAが別のノードBを送信するのを防ぐ問題ですが、ノードBは送信ノードA以外の誰にも安全に送信できた可能性があります。"
    },
    {
      "indent": 0,
      "text": "4.5. Micro Diversity, Macro Diversity, and IP Diversity",
      "section_title": true,
      "ja": "4.5. ミクロの多様性、マクロ多様性、およびIP多様性"
    },
    {
      "indent": 3,
      "text": "Certain air interfaces (e.g., the Universal Mobile Telephone System (UMTS) Terrestrial Radio Access Network (UTRAN) running in Frequency Division Duplex (FDD) mode) require or at least support macro diversity combining. Essentially, this refers to the fact that a single MN is able to send and receive over two independent radio channels ('diversity branches') at the same time; the information received over different branches is compared and that from the better branch passed to the upper layers. This can be used both to improve overall performance, and to provide a seamless type of handover at layer 2, since a new branch can be added before the old is deleted. See also [6].",
      "ja": "特定のAIRインターフェイス（例：Universal Mobile Telephone System（UMTS）Frequency Division Duplex（FDD）モードで実行される地上ラジオアクセスネットワーク（UTRAN））が必要または少なくともマクロ多様性の組み合わせをサポートします。基本的に、これは、単一のMNが2つの独立したラジオチャネル（「多様性ブランチ」）を同時に送信および受信できるという事実を指します。さまざまなブランチで受け取った情報が比較され、より良い枝から上層層に通過した情報が比較されます。これは、全体的なパフォーマンスを改善するために、またレイヤー2でシームレスなタイプのハンドオーバーを提供するために使用できます。これは、古いブランチが削除される前に新しいブランチを追加できるためです。[6]も参照してください。"
    },
    {
      "indent": 3,
      "text": "It is necessary to differentiate between combining/diversity that occurs at the physical and radio link layers, where the relevant unit of data is the radio frame, and that which occurs at layer 3, the network layer, where what is considered is the IP packet itself.",
      "ja": "物理的なリンクレイヤーと無線リンクレイヤーで発生する組み合わせ/多様性、関連するデータの単位が無線フレームであること、およびレイヤー3、ネットワークレイヤーで発生するものを区別する必要があります。自体。"
    },
    {
      "indent": 3,
      "text": "In the following definitions micro- and macro diversity refer to protocol layers below the network layer, and IP diversity refers to the network layer.",
      "ja": "以下の定義では、マイクロおよびマクロの多様性は、ネットワークレイヤーの下のプロトコルレイヤーを参照し、IPの多様性はネットワークレイヤーを指します。"
    },
    {
      "indent": 3,
      "text": "Micro diversity",
      "ja": "マイクロ多様性"
    },
    {
      "indent": 6,
      "text": "For example, two antennas on the same transmitter send the same signal to a receiver over a slightly different path to overcome fading.",
      "ja": "たとえば、同じトランスミッター上の2つのアンテナは、フェージングを克服するために、わずかに異なるパス上で同じ信号を受信機に送信します。"
    },
    {
      "indent": 3,
      "text": "Macro diversity",
      "ja": "マクロ多様性"
    },
    {
      "indent": 6,
      "text": "Duplicating or combining actions taking place over multiple APs, possibly attached to different ARs. This may require support from the network layer to move the radio frames between the base stations and a central combining point.",
      "ja": "複数のAPで行われるアクションの複製または結合の複合または結合は、おそらく異なるARに添付されています。これには、ベースステーションと中央の組み合わせポイント間の無線フレームを移動するために、ネットワークレイヤーからのサポートが必要になる場合があります。"
    },
    {
      "indent": 3,
      "text": "IP diversity",
      "ja": "IP多様性"
    },
    {
      "indent": 6,
      "text": "Refers to the process of duplicating IP packets and sending them to the receiver through more than one point of attachment. This is semantically allowed by IP because it does not guarantee packet uniqueness, and higher level protocols are assumed to eliminate duplicates whenever that is important for the application.",
      "ja": "IPパケットを複製し、複数の添付ファイルを介してレシーバーに送信するプロセスを指します。これは、パケットの一意性を保証しないため、IPによって意味的に許可されており、アプリケーションにとって重要な場合はいつでも、より高いレベルのプロトコルが重複を排除すると想定されています。"
    },
    {
      "indent": 0,
      "text": "4.6. Paging, and Mobile Node States and Modes",
      "section_title": true,
      "ja": "4.6. ページング、およびモバイルノードの状態とモード"
    },
    {
      "indent": 3,
      "text": "Mobile systems may employ the use of MN states in order to operate more efficiently without degrading the performance of the system. The term 'mode' is also common and means the same as 'state'.",
      "ja": "モバイルシステムは、システムのパフォーマンスを低下させることなく、より効率的に動作するためにMN状態の使用を採用する場合があります。「モード」という用語も一般的であり、「状態」と同じを意味します。"
    },
    {
      "indent": 3,
      "text": "A MN is always in one of the following three states:",
      "ja": "MNは常に次の3つの状態のいずれかにあります。"
    },
    {
      "indent": 3,
      "text": "Active state",
      "ja": "アクティブ状態"
    },
    {
      "indent": 6,
      "text": "When the AN knows the MN's SAR and the MN can send and receive IP packets. The access link may not be active, but the radio layer is able to establish one without assistance from the network layer. The MN has an IP address assigned.",
      "ja": "ANがMNのSARを知っている場合、MNはIPパケットを送信および受信できます。アクセスリンクはアクティブではない場合がありますが、無線レイヤーはネットワークレイヤーからの支援なしでそれを確立できます。MNにはIPアドレスが割り当てられています。"
    },
    {
      "indent": 3,
      "text": "Dormant state",
      "ja": "休眠状態"
    },
    {
      "indent": 6,
      "text": "A state in which the mobile restricts its ability to receive normal IP traffic by reducing its monitoring of radio channels. The AN knows the MN's Paging Area, but the MN has no SAR and so packets cannot be delivered to the MN without the AN initiating paging. Often also called Idle state.",
      "ja": "モバイルが無線チャネルの監視を削減することにより、通常のIPトラフィックを受け取る能力を制限する状態。ANはMNのページングエリアを知っていますが、MNにはSARがないため、開始ページングなしでパケットをMNに配信することはできません。多くの場合、アイドル状態とも呼ばれます。"
    },
    {
      "indent": 6,
      "text": "Time-slotted dormant mode",
      "ja": "時間帯の休眠モード"
    },
    {
      "indent": 9,
      "text": "A dormant mode implementation in which the mobile alternates between periods of not listening for any radio traffic and listening for traffic. Time-slotted dormant mode implementations are typically synchronized with the network so the network can deliver paging messages to the mobile during listening periods.",
      "ja": "モバイルが無線トラフィックを聞かない期間とトラフィックをリッスンする期間を交互にする休眠モードの実装。時間帯の休眠モードの実装は、通常、ネットワークと同期されるため、ネットワークはリスニング期間中にモバイルにページングメッセージを配信できます。"
    },
    {
      "indent": 3,
      "text": "Inactive state",
      "ja": "非アクティブな状態"
    },
    {
      "indent": 6,
      "text": "the MN is in neither the Active nor Dormant State. The MN is no longer listening for any packets, not even periodically, and not sending packets. The MN may be in a powered off state, it may have shut down all interfaces to drastically conserve power, or it may be out of range of a radio access point. The MN does not necessarily have an IP access address from the AN.",
      "ja": "MNは活動状態でも休眠状態でもありません。MNは、定期的にさえもパケットを送信しないパケットを聞いていません。MNは、電源を切った状態にある可能性があります。すべてのインターフェイスをシャットダウンして電力を大幅に節約するか、無線アクセスポイントの範囲外である可能性があります。MNには、ANからのIPアクセスアドレスが必ずしもありません。"
    },
    {
      "indent": 3,
      "text": "Note: in fact, as well as the MN being in one of these three states, the AN also stores which state it believes the MN is in. Normally these are consistent; the definitions above assume so.",
      "ja": "注：実際、MNはこれら3つの州のいずれかにあるだけでなく、MNがあると信じていると述べているANもあります。通常、これらは一貫しています。上記の定義はそう想定しています。"
    },
    {
      "indent": 3,
      "text": "Here are some additional definitions for paging, taking into account the above state definitions.",
      "ja": "上記の状態の定義を考慮して、ページングの追加の定義を次に示します。"
    },
    {
      "indent": 3,
      "text": "Paging",
      "ja": "ページング"
    },
    {
      "indent": 6,
      "text": "A procedure initiated by the Access Network to move a Dormant MN into the Active State. As a result of paging, the MN establishes a SAR and the IP routes are set up.",
      "ja": "Accessネットワークによって開始された手順は、休眠MNをアクティブ状態に移動させます。ページングの結果、MNはSARを確立し、IPルートがセットアップされます。"
    },
    {
      "indent": 3,
      "text": "Location updating",
      "ja": "場所の更新"
    },
    {
      "indent": 6,
      "text": "A procedure initiated by the MN, by which it informs the AN that it has moved into a new paging area.",
      "ja": "MNによって開始された手順。それによって、ANが新しいページングエリアに移動したことを通知します。"
    },
    {
      "indent": 3,
      "text": "Paging area",
      "ja": "ページングエリア"
    },
    {
      "indent": 6,
      "text": "A part of the Access Network, typically containing a number of ARs/APs, which corresponds to some geographical area. The AN keeps and updates a list of all the Dormant MNs present in the area. If the MN is within the radio coverage of the area it will be able to receive paging messages sent within that Paging Area.",
      "ja": "通常、いくつかの地理的領域に対応する多くのARS/APを含むアクセスネットワークの一部。ANは、この地域に存在するすべての休眠MNのリストを保持および更新します。MNがエリアの無線カバレッジ内にある場合、そのページングエリア内で送信されるページングメッセージを受信することができます。"
    },
    {
      "indent": 3,
      "text": "Paging area registrations",
      "ja": "ページングエリア登録"
    },
    {
      "indent": 6,
      "text": "Signaling from a dormant mode mobile node to the network, by which it establishes its presence in a new paging area. Paging Area Registrations thus enable the network to maintain a rough idea of where the mobile is located.",
      "ja": "休眠モードのモバイルノードからネットワークへのシグナリング。それにより、新しいページングエリアでの存在を確立します。したがって、ページングエリア登録により、ネットワークはモバイルがどこにあるかについての大まかなアイデアを維持できます。"
    },
    {
      "indent": 3,
      "text": "Paging channel",
      "ja": "ページングチャネル"
    },
    {
      "indent": 6,
      "text": "A radio channel dedicated to signaling dormant mode mobiles for paging purposes. By current practice, the paging channel carries only control traffic necessary for the radio link, although some paging protocols have provision for carrying arbitrary traffic (and thus could potentially be used to carry IP).",
      "ja": "ページングのために休眠モードの携帯電話を信号する専用のラジオチャネル。現在の慣行により、ページングチャネルは無線リンクに必要な制御トラフィックのみを搭載していますが、一部のページングプロトコルには任意のトラフィックを運ぶための規定があります（したがって、IPを運ぶために使用できる可能性があります）。"
    },
    {
      "indent": 3,
      "text": "Traffic channel",
      "ja": "トラフィックチャネル"
    },
    {
      "indent": 6,
      "text": "The radio channel on which IP traffic to an active mobile is typically sent. This channel is used by a mobile that is actively sending and receiving IP traffic, and is not continuously active in a dormant mode mobile. For some radio link protocols, this may be the only channel available.",
      "ja": "通常、アクティブモバイルへのIPトラフィックが送信される無線チャネルが送信されます。このチャネルは、IPトラフィックを積極的に送信および受信しているモバイルで使用されており、休眠モードモバイルでは継続的にアクティブではありません。一部のラジオリンクプロトコルの場合、これが利用可能な唯一のチャネルかもしれません。"
    },
    {
      "indent": 0,
      "text": "4.7. Context Transfer",
      "section_title": true,
      "ja": "4.7. コンテキスト転送"
    },
    {
      "indent": 3,
      "text": "Context",
      "ja": "コンテクスト"
    },
    {
      "indent": 6,
      "text": "The information on the current state of a routing-related service required to re-establish the routing-related service on a new subnet without having to perform the entire protocol exchange with the MN from scratch.",
      "ja": "ルーティング関連サービスの現在の状態に関する情報は、MNとのプロトコル交換全体をゼロから実行することなく、新しいサブネットでルーティング関連サービスを再確立するために必要なものです。"
    },
    {
      "indent": 3,
      "text": "Feature context",
      "ja": "機能コンテキスト"
    },
    {
      "indent": 6,
      "text": "The collection of information representing the context for a given feature. The full context associated with a MN is the collection of one or more feature contexts.",
      "ja": "特定の機能のコンテキストを表す情報の収集。MNに関連付けられた完全なコンテキストは、1つ以上の機能コンテキストのコレクションです。"
    },
    {
      "indent": 3,
      "text": "Context transfer",
      "ja": "コンテキスト転送"
    },
    {
      "indent": 6,
      "text": "The movement of context from one router or other network entity to another as a means of re-establishing routing-related services on a new subnet or collection of subnets.",
      "ja": "新しいサブネットまたはサブネットのコレクションでルーティング関連サービスを再確立する手段として、あるルーターまたは他のネットワークエンティティから別のネットワークエンティティへのコンテキストの移動。"
    },
    {
      "indent": 3,
      "text": "Routing-related service",
      "ja": "ルーティング関連サービス"
    },
    {
      "indent": 6,
      "text": "A modification to the default routing treatment of packets to and from the MN. Initially establishing routing-related services usually requires a protocol exchange with the MN. An example of a routing-related service is header compression. The service may also be indirectly related to routing, for example, security. Security may not affect the forwarding decision of all intermediate routers, but a packet may be dropped if it fails a security check (can't be encrypted, authentication failed, etc.). Dropping the packet is basically a routing decision.",
      "ja": "MNとの間でパケットのデフォルトルーティングトリートメントの変更。最初にルーティング関連サービスを確立するには、通常、MNとのプロトコル交換が必要です。ルーティング関連サービスの例は、ヘッダー圧縮です。このサービスは、たとえばセキュリティなど、ルーティングに間接的に関連する場合があります。セキュリティは、すべての中間ルーターの転送決定に影響しない場合がありますが、セキュリティチェックに失敗した場合（暗号化できない、認証に失敗するなど）、パケットが削除される場合があります。パケットを削除することは、基本的にルーティングの決定です。"
    },
    {
      "indent": 0,
      "text": "4.8. Candidate Access Router Discovery",
      "section_title": true,
      "ja": "4.8. 候補者アクセスルーターの発見"
    },
    {
      "indent": 3,
      "text": "Capability of an AR",
      "ja": "ARの機能"
    },
    {
      "indent": 6,
      "text": "A characteristic of the service offered by an AR that may be of interest to an MN when the AR is being considered as a handoff candidate.",
      "ja": "ARがハンドオフ候補と見なされているときにMNにとって興味深い可能性のあるARが提供するサービスの特性。"
    },
    {
      "indent": 3,
      "text": "Candidate AR (CAR)",
      "ja": "候補者AR（車）"
    },
    {
      "indent": 6,
      "text": "An AR to which MN has a choice of performing IP-level handoff. This means that MN has the right radio interface to connect to an AP that is served by this AR, as well as the coverage of this AR overlaps with that of the AR to which MN is currently attached.",
      "ja": "MNがIPレベルのハンドオフを実行する選択肢があるAR。これは、MNがこのARが提供するAPに接続するための適切な無線インターフェイスを持っていることを意味します。また、このARのカバレッジは、MNが現在付着しているARの重複と重複しています。"
    },
    {
      "indent": 3,
      "text": "Target AR (TAR)",
      "ja": "ターゲットAR（TAR）"
    },
    {
      "indent": 6,
      "text": "An AR with which the procedures for the MN's IP-level handoff are initiated. TAR is selected after running a TAR Selection Algorithm that takes into account the capabilities of CARs, preferences of MN and any local policies.",
      "ja": "MNのIPレベルのハンドオフの手順が開始されるAR。TARは、車の機能、MNの好み、およびローカルポリシーを考慮したTAR選択アルゴリズムを実行した後に選択されます。"
    },
    {
      "indent": 0,
      "text": "4.9. Types of Mobility",
      "section_title": true,
      "ja": "4.9. モビリティの種類"
    },
    {
      "indent": 3,
      "text": "We can differentiate between host and network mobility, and various types of network mobility. Terminology related more to applications such as the Session Initiation Protocol, such as personal mobility, is out of scope for this document.",
      "ja": "ホストとネットワークのモビリティ、およびさまざまなタイプのネットワークモビリティを区別できます。個人のモビリティなどのセッション開始プロトコルなどのアプリケーションに関連する用語は、このドキュメントの範囲外です。"
    },
    {
      "indent": 6,
      "text": "Host mobility support",
      "ja": "ホストモビリティサポート"
    },
    {
      "indent": 9,
      "text": "Refers to the function of allowing a mobile node to change its point of attachment to the network, without interrupting IP packet delivery to/from that node. There may be different sub-functions depending on what the current level of service is being provided; in particular, support for host mobility usually implies active and dormant modes of operation, depending on whether the node has any current sessions or not. Access Network procedures are required to keep track of the current point of attachment of all the MNs or establish it at will. Accurate location and routing procedures are required in order to maintain the integrity of the communication. Host mobility is often called 'terminal mobility'.",
      "ja": "そのノードからのIPパケット配信を中断することなく、モバイルノードがネットワークへの添付ポイントを変更できるようにする機能を指します。現在のサービスレベルが提供されているものに応じて、異なるサブ機能がある場合があります。特に、ホストのモビリティのサポートは通常、ノードに現在のセッションがあるかどうかに応じて、アクティブおよび休眠状態の動作モードを意味します。すべてのMNの添付の現在のポイントを追跡するか、自由に確立するには、アクセスネットワーク手順が必要です。通信の完全性を維持するためには、正確な場所とルーティング手順が必要です。ホストのモビリティは、多くの場合「ターミナルモビリティ」と呼ばれます。"
    },
    {
      "indent": 6,
      "text": "Network mobility support",
      "ja": "ネットワークモビリティサポート"
    },
    {
      "indent": 9,
      "text": "Refers to the function of allowing an entire network to change its point of attachment to the Internet, and, thus, its reachability in the topology, without interrupting IP packet delivery to/from that mobile network.",
      "ja": "ネットワーク全体がインターネットへの添付ポイントを変更できるようにする機能を指します。したがって、そのモバイルネットワークからのIPパケット配信を中断することなく、トポロジの到達可能性です。"
    },
    {
      "indent": 3,
      "text": "Two subcategories of mobility can be identified within both host mobility and network mobility:",
      "ja": "ホストモビリティとネットワークモビリティの両方で、モビリティの2つのサブカテゴリを識別できます。"
    },
    {
      "indent": 6,
      "text": "Global mobility",
      "ja": "グローバルモビリティ"
    },
    {
      "indent": 9,
      "text": "Same as Macro mobility.",
      "ja": "マクロモビリティと同じです。"
    },
    {
      "indent": 6,
      "text": "Local mobility",
      "ja": "ローカルモビリティ"
    },
    {
      "indent": 9,
      "text": "Same as Micro mobility.",
      "ja": "マイクロモビリティと同じ。"
    },
    {
      "indent": 6,
      "text": "Macro mobility",
      "ja": "マクロモビリティ"
    },
    {
      "indent": 9,
      "text": "Mobility over a large area. This includes mobility support and associated address registration procedures that are needed when a MN moves between IP domains. Inter-AN handovers typically involve macro-mobility protocols. Mobile-IP can be seen as a means to provide macro mobility.",
      "ja": "広いエリアでのモビリティ。これには、MNがIPドメイン間を移動するときに必要なモビリティサポートと関連するアドレス登録手順が含まれます。Inter-an Handoversには、通常、マクロモビリティプロトコルが含まれます。モバイルIPは、マクロモビリティを提供する手段と見なすことができます。"
    },
    {
      "indent": 6,
      "text": "Micro mobility",
      "ja": "マイクロモビリティ"
    },
    {
      "indent": 9,
      "text": "Mobility over a small area. Usually this means mobility within an IP domain with an emphasis on support for active mode using handover, although it may include idle mode procedures also. Micro-mobility protocols exploit the locality of movement by confining movement related changes and signaling to the access network.",
      "ja": "小さなエリアのモビリティ。通常、これは、ハンドオーバーを使用したアクティブモードのサポートに重点を置いたIPドメイン内のモビリティを意味しますが、アイドルモードの手順も含まれている場合があります。マイクロモビリティプロトコルは、動きに関連する変化とシグナリングをアクセスネットワークに限定することにより、動きの局所性を活用します。"
    },
    {
      "indent": 6,
      "text": "Local mobility management",
      "ja": "ローカルモビリティ管理"
    },
    {
      "indent": 9,
      "text": "Local mobility management (LMM) is a generic term for protocols dealing with IP mobility management confined within the access network. LMM messages are not routed outside the access network, although a handover may trigger Mobile IP messages to be sent to correspondent nodes and home agents.",
      "ja": "ローカルモビリティ管理（LMM）は、アクセスネットワーク内に限定されているIPモビリティ管理を扱うプロトコルの一般的な用語です。LMMメッセージはアクセスネットワークの外側にルーティングされていませんが、ハンドオーバーはモバイルIPメッセージをトリガーして、特派員ノードとホームエージェントに送信される可能性があります。"
    },
    {
      "indent": 0,
      "text": "5. Specific Terminology for Mobile Ad-Hoc Networking",
      "section_title": true,
      "ja": "5. モバイルアドホックネットワーキングのための特定の用語"
    },
    {
      "indent": 3,
      "text": "Cluster",
      "ja": "集まる"
    },
    {
      "indent": 6,
      "text": "A group of nodes located within close physical proximity, typically all within range of one another, which can be grouped together for the purpose of limiting the production and propagation of routing information.",
      "ja": "密接な物理的に近い、通常は互いの範囲内にあるノードのグループ。ルーティング情報の生産と伝播を制限する目的でグループ化できます。"
    },
    {
      "indent": 3,
      "text": "Cluster head",
      "ja": "クラスターヘッド"
    },
    {
      "indent": 6,
      "text": "A cluster head is a node (often elected in the cluster formation process) that has complete knowledge about group membership and link state information in the cluster. Each cluster should have one and only one cluster head.",
      "ja": "クラスターヘッドは、グループメンバーシップに関する完全な知識を持ち、クラスター内の状態情報をリンクするノード（多くの場合、クラスター形成プロセスで選出される）です。各クラスターには、1つのクラスターヘッドのみが必要です。"
    },
    {
      "indent": 3,
      "text": "Cluster member",
      "ja": "クラスターメンバー"
    },
    {
      "indent": 6,
      "text": "All nodes within a cluster except the cluster head are called members of that cluster.",
      "ja": "クラスターヘッドを除くクラスター内のすべてのノードは、そのクラスターのメンバーと呼ばれます。"
    },
    {
      "indent": 3,
      "text": "Convergence",
      "ja": "収束"
    },
    {
      "indent": 6,
      "text": "The process of approaching a state of equilibrium in which all nodes in the network agree on a consistent collection of state about the topology of the network, and in which no further control messages are needed to establish the consistency of the network topology.",
      "ja": "ネットワーク内のすべてのノードがネットワークのトポロジに関する一貫した状態収集に一致する平衡状態に近づくプロセス、およびネットワークトポロジの一貫性を確立するためにさらなる制御メッセージが必要ない場合。"
    },
    {
      "indent": 3,
      "text": "Convergence time",
      "ja": "収束時間"
    },
    {
      "indent": 6,
      "text": "The time which is required for a network to reach convergence after an event (typically, the movement of a mobile node) which changes the network topology.",
      "ja": "ネットワークトポロジを変更するイベント（通常、モバイルノードの動き）の後にネットワークが収束に到達するために必要な時間。"
    },
    {
      "indent": 3,
      "text": "Laydown",
      "ja": "横になる"
    },
    {
      "indent": 6,
      "text": "The relative physical location of the nodes within the ad hoc network.",
      "ja": "アドホックネットワーク内のノードの相対的な物理的位置。"
    },
    {
      "indent": 3,
      "text": "Pathloss matrix",
      "ja": "パスロスマトリックス"
    },
    {
      "indent": 6,
      "text": "A matrix of coefficients describing the pathloss between any two nodes in an ad hoc network. When the links are asymmetric, the matrix is also asymmetric.",
      "ja": "アドホックネットワーク内の任意の2つのノード間のパスロスを記述する係数のマトリックス。リンクが非対称の場合、マトリックスも非対称です。"
    },
    {
      "indent": 3,
      "text": "Scenario",
      "ja": "シナリオ"
    },
    {
      "indent": 6,
      "text": "The tuple <laydown, pathloss matrix, mobility factor, traffic> characterizing a class of ad hoc networks.",
      "ja": "タプル<レイダウン、パスロスマトリックス、モビリティファクター、トラフィック>アドホックネットワークのクラスの特徴。"
    },
    {
      "indent": 0,
      "text": "6. Security-related Terminology",
      "section_title": true,
      "ja": "6. セキュリティ関連の用語"
    },
    {
      "indent": 3,
      "text": "This section includes terminology commonly used around mobile and wireless networking. Only a mobility-related subset of the entire security terminology is presented.",
      "ja": "このセクションには、モバイルおよびワイヤレスネットワーキングを中心に一般的に使用される用語が含まれています。セキュリティ用語全体のモビリティ関連サブセットのみが提示されています。"
    },
    {
      "indent": 6,
      "text": "Authorization-enabling extension",
      "ja": "承認を有する拡張機能"
    },
    {
      "indent": 9,
      "text": "An authentication which makes a (registration) message acceptable to the ultimate recipient of the registration message. An authorization-enabling extension must contain an SPI (see below) [10].",
      "ja": "（登録）メッセージを登録メッセージの究極の受信者に受け入れられる認証。承認を有する拡張機能には、SPIを含める必要があります（以下を参照）[10]。"
    },
    {
      "indent": 6,
      "text": "Mobility security association",
      "ja": "モビリティセキュリティ協会"
    },
    {
      "indent": 9,
      "text": "A collection of security contexts, between a pair of nodes, which may be applied to mobility-related protocol messages exchanged between them. In Mobile IP, each context indicates an authentication algorithm and mode, a secret (a shared key, or appropriate public/private key pair), and a style of replay protection in use. Mobility security associations may be stored separately from the node's IPsec Security Policy Database (SPD) [10].",
      "ja": "ノードのペア間のセキュリティコンテキストのコレクションは、それらの間で交換されるモビリティ関連のプロトコルメッセージに適用される場合があります。モバイルIPでは、各コンテキストは、認証アルゴリズムとモード、秘密（共有キー、または適切なパブリック/秘密キーペア）、および使用中のリプレイ保護スタイルを示します。モビリティセキュリティ協会は、ノードのIPSECセキュリティポリシーデータベース（SPD）とは別に保存される場合があります[10]。"
    },
    {
      "indent": 6,
      "text": "Registration key",
      "ja": "登録キー"
    },
    {
      "indent": 9,
      "text": "A key used in the Mobility Security Association between a mobile node and a foreign agent. A registration key is typically only used once or a very few times, and only for the purposes of verifying a small volume of Authentication data [12].",
      "ja": "モバイルノードと外国人エージェントとの間のモビリティセキュリティ協会で使用されるキー。登録キーは通常、1回または数回のみ使用され、少量の認証データを検証する目的でのみ使用されます[12]。"
    },
    {
      "indent": 6,
      "text": "Security context",
      "ja": "セキュリティコンテキスト"
    },
    {
      "indent": 9,
      "text": "A security context between two nodes defines the manner in which two nodes choose to mutually authenticate each other, and indicates an authentication algorithm and mode.",
      "ja": "2つのノード間のセキュリティコンテキストは、2つのノードが相互に相互に認証することを選択する方法を定義し、認証アルゴリズムとモードを示します。"
    },
    {
      "indent": 6,
      "text": "Security Parameter Index (SPI)",
      "ja": "セキュリティパラメーターインデックス（SPI）"
    },
    {
      "indent": 9,
      "text": "An index identifying a security context between a pair of routers among the contexts available in the mobility security association.",
      "ja": "Mobility Security Associationで利用可能なコンテキストの中で、一対のルーター間のセキュリティコンテキストを識別するインデックス。"
    },
    {
      "indent": 3,
      "text": "The Mobile IPv6 specification includes more security terminology related to MIPv6 bindings [9]. Terminology about the MIP challenge/response mechanism can be found in [11].",
      "ja": "モバイルIPv6仕様には、MIPV6バインディングに関連するより多くのセキュリティ用語が含まれています[9]。MIPチャレンジ/応答メカニズムに関する用語は、[11]に記載されています。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document presents only terminology. There are no security issues in this document.",
      "ja": "このドキュメントは、用語のみを提示します。このドキュメントにはセキュリティの問題はありません。"
    },
    {
      "indent": 0,
      "text": "8. Contributors",
      "section_title": true,
      "ja": "8. 貢献者"
    },
    {
      "indent": 3,
      "text": "This document was initially based on the work of Tapio Suihko, Phil Eardley, Dave Wisely, Robert Hancock, Nikos Georganopoulos, Markku Kojo, and Jukka Manner.",
      "ja": "この文書は、当初、タピオ・スイコ、フィル・アードリー、デイブ・ワイズリー、ロバート・ハンコック、ニコス・ゲオルガノス、マルク・コホ、ジュッカ・マナーの研究に基づいていました。"
    },
    {
      "indent": 3,
      "text": "Charles Perkins has provided input terminology related to ad-hoc networks.",
      "ja": "チャールズパーキンスは、アドホックネットワークに関連する入力用語を提供しています。"
    },
    {
      "indent": 3,
      "text": "Thierry Ernst has provided the terminology for discussing mobile networks.",
      "ja": "Thierry Ernstは、モバイルネットワークについて議論するための用語を提供しています。"
    },
    {
      "indent": 3,
      "text": "Henrik Levkowetz did a final check of the definitions in revision -05 and suggested a number of changes.",
      "ja": "Henrik Levkowetzは、Revision -05で定義を最終的にチェックし、多くの変更を提案しました。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgments",
      "section_title": true,
      "ja": "9. 謝辞"
    },
    {
      "indent": 3,
      "text": "This work has been partially performed in the framework of the IST project IST-2000-28584 MIND, which is partly funded by the European Union. Some of the authors would like to acknowledge the help of their colleagues in preparing this document.",
      "ja": "この作業は、欧州連合によって部分的に資金提供されているISTプロジェクトIST-2000-28584 Mindの枠組みで部分的に実行されています。著者の何人かは、この文書を準備する際に同僚の助けを認めたいと考えています。"
    },
    {
      "indent": 3,
      "text": "Randy Presuhn did a very thorough and helpful review of the -02 version of the terminology.",
      "ja": "Randy Presuhnは、-02バージョンの用語を非常に徹底的かつ役立つレビューを行いました。"
    },
    {
      "indent": 3,
      "text": "Some definitions of terminology have been adapted from [1], [2], [3], [4], [7], [8], [9] and [10].",
      "ja": "用語のいくつかの定義は、[1]、[2]、[3]、[4]、[7]、[8]、[9]、および[10]から適応されています。"
    },
    {
      "indent": 0,
      "text": "10. Informative References",
      "section_title": true,
      "ja": "10. 参考引用"
    },
    {
      "indent": 3,
      "text": "[1] Blair, D., Tweedly, A., Thomas, M., Trostle, J. and M. Ramalho, \"Realtime Mobile IPv6 Framework\", Work in Progress.",
      "ja": "[1] Blair、D.、Tweedly、A.、Thomas、M.、Trostle、J。and M. Ramalho、「リアルタイムモバイルIPv6フレームワーク」、作業進行中。"
    },
    {
      "indent": 3,
      "text": "[2] Calhoun, P., Montenegro, G. and C. Perkins, \"Mobile IP Regionalized Tunnel Management\", Work in Progress.",
      "ja": "[2] Calhoun、P.、Montenegro、G。、およびC. Perkins、「モバイルIPリージョン化トンネル管理」、作業進行中。"
    },
    {
      "indent": 3,
      "text": "[3] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[3] Deering、S。and R. Hinden、「インターネットプロトコル、バージョン6（IPv6）仕様」、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[4] Koodli, R., Ed., \"Fast Handovers for Mobile IPv6\", Work in Progress.",
      "ja": "[4] Koodli、R.、ed。、「モバイルIPv6の高速ハンドオーバー」、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[5] Yavatkar, R., Pendarakis, D. and R. Guerin, \"A Framework for Policy-based Admission Control\", RFC 2753, January 2000.",
      "ja": "[5] Yavatkar、R.、Pendarakis、D。and R. Guerin、「政策ベースの入場管理の枠組み」、RFC 2753、2000年1月。"
    },
    {
      "indent": 3,
      "text": "[6] Kempf, J., McCann, P. and P. Roberts, \"IP Mobility and the CDMA Radio Access Network: Applicability Statement for Soft Handoff\", Work in Progress.",
      "ja": "[6] Kempf、J.、McCann、P。、およびP. Roberts、「IPモビリティとCDMA無線アクセスネットワーク：ソフトハンドオフのアプリケーションステートメント」、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[7] Kempf, J., Ed., \"Problem Description: Reasons For Performing Context Transfers Between Nodes in an IP Access Network\", RFC 3374, September 2002.",
      "ja": "[7] Kempf、J.、ed。、「問題の説明：IPアクセスネットワーク内のノード間のコンテキスト転送を実行する理由」、RFC 3374、2002年9月。"
    },
    {
      "indent": 3,
      "text": "[8] Trossen, D., Krishnamurthi, G., Chaskar, H. and J. Kempf, \"Issues in candidate access router discovery for seamless IP-level handoffs\", Work in Progress.",
      "ja": "[8] Trossen、D.、Krishnamurthi、G.、Chaskar、H。、およびJ. Kempf、「シームレスなIPレベルのハンドオフの候補アクセスルーター発見の問題」、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[9] Johnson, D., Perkins, C. and J. Arkko, \"Mobility Support in IPv6\", RFC 3775, June 2004.",
      "ja": "[9] Johnson、D.、Perkins、C。、およびJ. Arkko、「IPv6のモビリティサポート」、RFC 3775、2004年6月。"
    },
    {
      "indent": 3,
      "text": "[10] Perkins, C., Ed., \"IP Mobility Support for IPv4\", RFC 3344, August 2002.",
      "ja": "[10] Perkins、C.、ed。、「IPv4のIPモビリティサポート」、RFC 3344、2002年8月。"
    },
    {
      "indent": 3,
      "text": "[11] Perkins, C., Calhoun, P. and J. Bharatia, \"Mobile IPv4 Challenge/Response Extensions (revised)\", Work in Progress.",
      "ja": "[11] Perkins、C.、Calhoun、P。and J. Bharatia、「モバイルIPv4チャレンジ/応答拡張機能（改訂）」、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[12] Perkins, C. and P. Calhoun, \"AAA Registration Keys for Mobile IP\", Work in Progress.",
      "ja": "[12] Perkins、C。およびP. Calhoun、「モバイルIPのAAA登録キー」、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[13] Ernst, T. and H. Lach, \"Network Mobility Support Terminology\", Work in Progress.",
      "ja": "[13] Ernst、T。およびH. Lach、「ネットワークモビリティサポートの用語」、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[14] Moy, J., \"OSPF Version 2\", STD 54, RFC 2328, April 1998.",
      "ja": "[14] Moy、J。、「OSPFバージョン2」、STD 54、RFC 2328、1998年4月。"
    },
    {
      "indent": 0,
      "text": "11. Appendix A - Index of Terms",
      "section_title": true,
      "ja": "11. 付録A-用語のインデックス"
    },
    {
      "indent": 3,
      "text": "AD ............................................................. 14\nAL ............................................................. 13\nAN ............................................................. 14\nANG ............................................................ 14\nANR ............................................................ 13\nAP ............................................................. 13\nAR ............................................................. 14\nAccess Link .................................................... 13\nAccess Network ................................................. 14\nAccess Network Gateway ......................................... 14\nAccess Network Router .......................................... 13\nAccess Point ................................................... 13\nAccess Router .................................................. 14\nActive state ................................................... 22\nAdministrative Domain .......................................... 14\nAsymmetric link ................................................. 5\nAuthorization-enabling extension ............................... 27\nBBM ............................................................ 19\nBU .............................................................. 3\nBandwidth ....................................................... 2\nBandwidth utilization ........................................... 2\nBeacon .......................................................... 3\nBinding Update .................................................. 3\nBreak-before-make .............................................. 19\nCAR ............................................................ 15\nCAR ............................................................ 24\nCandidate AR ................................................... 24\nCandidate Access Router ........................................ 15\nCapability of an AR ............................................ 24\nCare-of-Address ................................................. 3\nChannel ......................................................... 3\nChannel access protocol ......................................... 3\nChannel capacity ................................................ 3\nCluster ........................................................ 26\nCluster head ................................................... 26\nCluster member ................................................. 26\nCoA ............................................................. 3\nContext ........................................................ 24\nContext transfer ............................................... 24\nControl message ................................................. 4\nConvergence .................................................... 27\nConvergence time ............................................... 27\nDistance vector ................................................. 4\nDormant state .................................................. 22\nEgress interface ............................................... 13\nExposed terminal problem ....................................... 20\n   FN ............................................................. 12\nFairness ........................................................ 4\nFast handover .................................................. 20\nFeature context ................................................ 24\nFixed Node ..................................................... 12\nFlooding ........................................................ 4\nForeign subnet prefix ........................................... 4\nForwarding node ................................................. 4\nGlobal mobility ................................................ 25\nGoodput ........................................................ 20\nHA .............................................................. 5\nHandoff ........................................................ 15\nHandover ....................................................... 15\nHandover latency ............................................... 19\nHidden-terminal problem ........................................ 20\nHoA ............................................................. 4\nHome Address .................................................... 4\nHome Agent ...................................................... 5\nHome subnet prefix .............................................. 5\nHorizontal Handover ............................................ 16\nHost mobility support .......................................... 25\nIP access address ............................................... 5\nIP diversity ................................................... 21\nInactive state ................................................. 22\nIngress interface .............................................. 12\nInter-AN handover .............................................. 16\nInter-technology handover ...................................... 16\nInterface ....................................................... 5\nIntra-AN handover .............................................. 16\nIntra-AR handover .............................................. 16\nIntra-technology handover ...................................... 16\nL2 Trigger ...................................................... 6\nLaydown ........................................................ 27\nLayer 2 handover ............................................... 16\nLink ............................................................ 5\nLink establishment .............................................. 6\nLink state ...................................................... 6\nLink-layer trigger .............................................. 6\nLink-level acknowledgment ....................................... 6\nLocal broadcast ................................................. 6\nLocal mobility ................................................. 25\nLocal mobility management ...................................... 26\nLocation updating .............................................. 23\nLoop-free ....................................................... 6\nMAC ............................................................. 7\nMBB ............................................................ 19\nMH ............................................................. 12\nMN ............................................................. 12\n   MNN ............................................................ 13\nMPR ............................................................. 7\nMR ............................................................. 12\nMacro diversity ................................................ 21\nMacro mobility ................................................. 26\nMake-before-break .............................................. 19\nMedium Access Protocol .......................................... 7\nMicro diversity ................................................ 21\nMicro mobility ................................................. 26\nMobile Host .................................................... 12\nMobile Network Node ............................................ 13\nMobile Node .................................................... 12\nMobile Router .................................................. 12\nMobile network ................................................. 12\nMobile network prefix ........................................... 7\nMobile-assisted handover ....................................... 18\nMobile-controlled handover ..................................... 18\nMobile-initiated handover ...................................... 17\nMobility factor ................................................. 7\nMobility security association .................................. 27\nMultipoint relay ................................................ 7\nNAR ............................................................ 14\nNeighbor ........................................................ 7\nNeighborhood .................................................... 7\nNetwork mobility support ....................................... 25\nNetwork-assisted handover ...................................... 18\nNetwork-controlled handover .................................... 18\nNetwork-initiated handover ..................................... 17\nNew Access Router .............................................. 14\nNext hop ........................................................ 7\nPAR ............................................................ 15\nPaging ......................................................... 23\nPaging area .................................................... 23\nPaging area registrations ...................................... 23\nPaging channel ................................................. 23\nPathloss ....................................................... 20\nPathloss matrix ................................................ 27\nPayload ......................................................... 8\nPlanned handover ............................................... 19\nPrefix .......................................................... 8\nPrevious Access Router ......................................... 15\nPull handover .................................................. 18\nPush handover .................................................. 18\nRadio Cell ..................................................... 13\nRegistration key ............................................... 28\nRoaming ........................................................ 15\nRoute activation ................................................ 8\nRoute entry ..................................................... 8\n   Route establishment ............................................. 8\nRouting table ................................................... 8\nRouting proxy ................................................... 8\nRouting-related service ........................................ 24\nSAR ............................................................ 14\nSPI ............................................................ 28\nScenario ....................................................... 27\nSeamless handover .............................................. 19\nSecurity Parameter Index ....................................... 28\nSecurity context ............................................... 28\nServing Access Router .......................................... 14\nShannon's Law ................................................... 9\nSignal strength ................................................. 9\nSmooth handover ................................................ 19\nSource route .................................................... 9\nSpatial re-use .................................................. 9\nSubnet .......................................................... 9\nSystem-wide broadcast ........................................... 9\nTAR ............................................................ 25\nTarget AR ...................................................... 25\nThroughput ..................................................... 20\nTime-slotted dormant mode ...................................... 22\nTopology ........................................................ 9\nTraffic channel ................................................ 23\nTriggered update ................................................10\nUnassisted handover ............................................ 18\nUnplanned handover ............................................. 19\nVertical handover .............................................. 17",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "12. Authors' Addresses",
      "section_title": true,
      "ja": "12. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jukka Manner Department of Computer Science University of Helsinki P.O. Box 26 (Teollisuuskatu 23) FIN-00014 HELSINKI Finland",
      "ja": "ジュッカマナーコンピュータサイエンス大学ヘルシンキP.O.Box 26（Teollisuuskatu 23）Fin-00014 Helsinki Finland"
    },
    {
      "indent": 3,
      "text": "Phone: +358-9-191-44210\nFax:   +358-9-191-44441\nEMail: jmanner@cs.helsinki.fi",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Markku Kojo Department of Computer Science University of Helsinki P.O. Box 26 (Teollisuuskatu 23) FIN-00014 HELSINKI Finland",
      "ja": "ヘルシンキP.O.コンピュータサイエンス大学マルクコホ科Box 26（Teollisuuskatu 23）Fin-00014 Helsinki Finland"
    },
    {
      "indent": 3,
      "text": "Phone: +358-9-191-44179\nFax:   +358-9-191-44441\nEMail: kojo@cs.helsinki.fi",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "13. Full Copyright Statement",
      "section_title": true,
      "ja": "13. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（c）The Internet Society（2004）。この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、この文書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスがどの程度であるかについての使用に関連すると主張する可能性があるという立場はありません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要なテクノロジーをカバーする可能性のあるその他の独自の権利を注意深く招待します。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}