{
  "title": {
    "text": "RFC 3228 - IANA Considerations for IPv4 Internet Group Management Protocol (IGMP)",
    "ja": "RFC 3228 - IPv4インターネットグループ管理プロトコル（IGMP）に関するIANAの考慮事項"
  },
  "number": 3228,
  "created_at": "2023-12-02 17:17:50.793637+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          B. Fenner\nRequest for Comments: 3228                                 AT&T Research\nBCP: 57                                                    February 2002\nCategory: Best Current Practice",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 13,
      "text": " IANA Considerations for IPv4 Internet Group Management Protocol (IGMP)",
      "ja": "IPv4インターネットグループ管理プロトコル（IGMP）に関するIANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネットの最良のプラクティスを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo requests that the IANA create a registry for fields in the IGMP (Internet Group Management Protocol) protocol header, and provides guidance for the IANA to use in assigning parameters for those fields.",
      "ja": "このメモは、IANAがIGMP（インターネットグループ管理プロトコル）プロトコルヘッダーのフィールドのレジストリを作成し、IANAがこれらのフィールドのパラメーターの割り当てに使用するガイダンスを提供することを要求します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction. . . . . . . . . . . . . . . . . . . . . . . . .   1\n2. IANA Considerations for fields in the IPv4 IGMP header. . . .   2\n3. Assignments for testing and experimentation . . . . . . . . .   2\n4. Security Considerations . . . . . . . . . . . . . . . . . . .   2\n5. Normative References. . . . . . . . . . . . . . . . . . . . .   2\n6. Informative References. . . . . . . . . . . . . . . . . . . .   3\n7. Author's Address. . . . . . . . . . . . . . . . . . . . . . .   3\n8. Full Copyright Statement. . . . . . . . . . . . . . . . . . .   4",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This memo requests that the IANA create a registry for fields in the IGMP protocol header.",
      "ja": "このメモは、IANAがIGMPプロトコルヘッダーのフィールドのレジストリを作成することを要求します。"
    },
    {
      "indent": 3,
      "text": "The terms \"Specification Required\", \"Expert Review\", \"IESG Approval\", \"IETF Consensus\", and \"Standards Action\", are used in this memo to refer to the processes described in [2].",
      "ja": "「必要な仕様」、「専門家のレビュー」、「IESG承認」、「IETFコンセンサス」、および「標準アクション」という用語は、[2]で説明されているプロセスを参照するためにこのメモで使用されます。"
    },
    {
      "indent": 0,
      "text": "2. IANA Considerations for fields in the IPv4 IGMP header",
      "section_title": true,
      "ja": "2. IPv4 IGMPヘッダーのフィールドに関するIANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IPv4 IGMP header [1] contains the following fields that carry values assigned from IANA-managed name spaces: Type and Code. Code field values are defined relative to a specific Type value.",
      "ja": "IPv4 IGMPヘッダー[1]には、IANAが管理した名前スペースから割り当てられた値：タイプとコードを伝える次のフィールドが含まれています。コードフィールド値は、特定の型値に対して定義されます。"
    },
    {
      "indent": 3,
      "text": "Values for the IPv4 IGMP Type fields are allocated using an IESG Approval or Standards Action processes. Code Values for existing IPv4 IGMP Type fields are allocated using IESG Approval or Standards Action processes. The policy for assigning Code values for new IPv4 IGMP Types should be defined in the document defining the new Type value.",
      "ja": "IPv4 IGMP型フィールドの値は、IESGの承認または標準のアクションプロセスを使用して割り当てられます。既存のIPv4 IGMPタイプフィールドのコード値は、IESG承認または標準のアクションプロセスを使用して割り当てられます。新しいIPv4 IGMPタイプのコード値を割り当てるためのポリシーは、新しいタイプ値を定義するドキュメントで定義する必要があります。"
    },
    {
      "indent": 0,
      "text": "3. Assignments for testing and experimentation",
      "section_title": true,
      "ja": "3. テストと実験のための割り当て"
    },
    {
      "indent": 3,
      "text": "Instead of suggesting temporary assignments as in [3], this document follows the lead of [4] and assigns a range of values for experimental use. The IGMP Code values 240-255 inclusive (0xf0 - 0xff) are reserved for protocol testing and experimentation.",
      "ja": "[3]のように一時的な割り当てを提案する代わりに、このドキュメントは[4]のリードに従い、実験用の範囲の価値を割り当てます。IGMPコード値240-255インクルーシブ（0xf0-0xff）は、プロトコルテストと実験のために予約されています。"
    },
    {
      "indent": 3,
      "text": "Systems should silently ignore IGMP messages with unknown Code values.",
      "ja": "システムは、未知のコード値を持つIGMPメッセージを静かに無視する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Security analyzers such as firewalls and network intrusion detection monitors often rely on unambiguous interpretations of the fields described in this memo. As new values for the fields are assigned, existing security analyzers that do not understand the new values may fail, resulting in either loss of connectivity if the analyzer declines to forward the unrecognized traffic, or loss of security if it does forward the traffic and the new values are used as part of an attack. This vulnerability argues for high visibility (which the Standards Action and IETF Consensus processes ensure) for the assignments whenever possible.",
      "ja": "ファイアウォールやネットワーク侵入検出モニターなどのセキュリティアナライザーは、このメモに記載されているフィールドの明確な解釈に依存していることがよくあります。フィールドの新しい値が割り当てられると、新しい値が失敗する可能性がある既存のセキュリティアナライザーが失敗する可能性があり、アナライザーが認識されていないトラフィックの転送を拒否した場合、またはトラフィックとトラフィックを転送した場合のセキュリティの損失のいずれかをもたらします。新しい値は攻撃の一部として使用されます。この脆弱性は、可能な限り割り当ての高い可視性（標準アクションとIETFコンセンサスプロセスが保証する）について主張しています。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "ja": "5. 引用文献"
    },
    {
      "indent": 3,
      "text": "[1] Fenner, W., \"Internet Group Management Protocol, Version 2\", RFC 2236, November 1997.",
      "ja": "[1] Fenner、W。、「インターネットグループ管理プロトコル、バージョン2」、RFC 2236、1997年11月。"
    },
    {
      "indent": 3,
      "text": "[2] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[2] Narten、T。およびH. Alvestrand、「RFCSでIANA考慮事項セクションを書くためのガイドライン」、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 0,
      "text": "6. Informative References",
      "section_title": true,
      "ja": "6. 参考引用"
    },
    {
      "indent": 3,
      "text": "[3] Bradner, S. and V. Paxson, \"IANA Allocation Guidelines For Values In the Internet Protocol and Related Headers\", BCP 37, RFC 2780, March 2000.",
      "ja": "[3] Bradner、S。and V. Paxson、「インターネットプロトコルおよび関連するヘッダーの価値に関するIANA割り当てガイドライン」、BCP 37、RFC 2780、2000年3月。"
    },
    {
      "indent": 3,
      "text": "[4] Narten, T., \"Assigning Experimental and Testing Numbers Considered Useful\", Work in Progress.",
      "ja": "[4] Narten、T。、「有用であると考えられる実験数とテスト数の割り当て」、進行中の作業。"
    },
    {
      "indent": 0,
      "text": "7. Author's Address",
      "section_title": true,
      "ja": "7. 著者の連絡先"
    },
    {
      "indent": 9,
      "text": "Bill Fenner AT&T Labs -- Research 75 Willow Rd Menlo Park, CA 94025 USA",
      "ja": "ビル・フェナーAT＆Tラボ - 調査75 Willow Rd Menlo Park、CA 94025 USA"
    },
    {
      "indent": 9,
      "text": "EMail: fenner@research.att.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}