{
  "title": {
    "text": "RFC 3786 - Extending the Number of Intermediate System to Intermediate System (IS-IS) Link State PDU (LSP) Fragments Beyond the 256 Limit",
    "ja": "RFC 3786 - 256限界を超え中間システム（IS-IS）リンクステートPDU（LSP）の断片を中間システムの数を拡張"
  },
  "number": 3786,
  "created_at": "2019-10-22 14:10:05.375290+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        A. Hermelin\nRequest for Comments: 3786                                 Montilio Inc.\nCategory: Informational                                       S. Previdi\n                                                                M. Shand\n                                                           Cisco Systems\n                                                                May 2004",
      "raw": true
    },
    {
      "indent": 10,
      "text": "              Extending the Number of\nIntermediate System to Intermediate System (IS-IS)\nLink State PDU (LSP) Fragments Beyond the 256 Limit",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2004）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes a mechanism that allows a system to originate more than 256 Link State PDU (LSP) fragments, a limit set by the original Intermediate System to Intermediate System (IS-IS) Routing protocol, as described in ISO/IEC 10589. This mechanism can be used in IP-only, OSI-only, and dual routers.",
      "ja": "この文書では、256以上のリンク状態PDU（LSP）断片を発信するようにシステムを可能にする機構、中間システムに元の中間システムによって設定された限界を記述する（IS-IS）ルーティングプロトコル、ISO / IEC 10589.本に記載されているようにメカニズムはIP-のみ、OSI-のみ、およびデュアルルータで使用することができます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction .................................................  2\n    1.1.  Keywords ...............................................  2\n    1.2.  Definitions of Commonly Used Terms .....................  2\n    1.3.  Operation Modes ........................................  3\n    1.4.  Overview ...............................................  4\n2.  IS Alias ID TLV (IS-A) .......................................  5\n3.  Generating LSPs ..............................................  6\n    3.1.  Both Operation Modes ...................................  6\n    3.2.  Operation Mode 1 Additives .............................  8\n4.  Purging Extended LSP Fragments ............................... 10\n5.  Modifications to LSP handling in SPF ......................... 10\n6.  Forming Adjacencies .......................................... 11\n7.  Interoperating between extension-capable and non-capable ISs . 11\n8.  Security Considerations ...................................... 12\n9.  Acknowledgements ............................................. 12",
      "raw": true
    },
    {
      "indent": 3,
      "text": "10. References ................................................... 12\n11. Authors' Addresses ........................................... 13\n12. Full Copyright Statement ..................................... 14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "In the Intermediate System to Intermediate System (IS-IS) protocol, a system floods its link-state information in Link State PDU (LSP) Data Units, or LSPs for short. These logical LSPs can become quite large, therefore the protocol specifies a means of fragmenting this information into multiple LSP fragments. The number of fragments a system can generate is limited by ISO/IEC 10589 [ISIS-ISO] to 256 fragments, where each fragment's size is also limited. Hence, there is a limit on the amount of link-state information a system can generate.",
      "ja": "中間システムへの中間システム（IS-IS）プロトコルでは、システムはリンク状態PDU（LSP）データユニット、または略しLSPをそのリンクステート情報をフラッディング。これらの論理LSPはそのためのプロトコルが複数のLSPフラグメントにこの情報を断片化する手段を指定し、非常に大きくなることができます。システムが生成できる断片の数は、各フラグメントのサイズも制限されている256個の断片にISO / IEC 10589 [ISIS-ISO]によって制限されます。したがって、システムが生成することができるリンクステート情報の量には限界があります。"
    },
    {
      "indent": 3,
      "text": "A number of factors can contribute to exceeding this limit:",
      "ja": "多くの要因がこの制限を超えるに貢献することができます。"
    },
    {
      "indent": 3,
      "text": "- Introduction of new TLVs and sub-TLVs to be included in LSPs. - The use of LSPs to propagate various types of information (such as traffic-engineering information). - The increasing number of destinations and AS topologies. - Finer granularity routing, and the ability to inject external routes into areas [DOMAIN-WIDE]. - Other emerging technologies, such as optical, IPv6, etc.",
      "ja": " - のLSPに含まれる新しいTLVのサブTLVを紹介。 -  LSPの使用は、（例えば、トラフィックエンジニアリング情報など）様々なタイプの情報を伝達します。 - 目的地とASトポロジの増加。 - より細かい粒度のルーティング、及び領域[ドメイン全体]に外部ルートを注入する能力。 - など、IPv6の、光学などの他の新技術、"
    },
    {
      "indent": 3,
      "text": "This document describes mechanisms to relax the limit on the number of LSP fragments.",
      "ja": "この文書では、LSPフラグメントの数の制限を緩和するメカニズムについて説明します。"
    },
    {
      "indent": 0,
      "text": "1.1. Keywords",
      "section_title": true,
      "ja": "1.1。キーワード"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [BCP14].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14、RFC 2119 [BCP14]で説明されるように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.2. Definitions of Commonly Used Terms",
      "section_title": true,
      "ja": "1.2。一般的に使用される用語の定義"
    },
    {
      "indent": 3,
      "text": "This section provides definitions for terms that are used throughout the text.",
      "ja": "このセクションでは、テキスト全体で使用される用語の定義を提供します。"
    },
    {
      "indent": 6,
      "text": "Originating System A router physically running the IS-IS protocol. As this document describes methods allowing a single IS-IS process to advertise its LSPs as multiple \"virtual\" routers, the Originating System represents the single \"physical\" IS-IS process.",
      "ja": "発信システムは、ルータが物理的にIS-ISプロトコルを実行しています。この文書は、複数の「仮想」ルータとしてのLSPを宣伝するために、単一のIS-ISプロセスを可能にする方法を説明すると、発信システムは、単一の「物理的には」IS-ISプロセスを表します。"
    },
    {
      "indent": 6,
      "text": "Normal system-id The system-id of an Originating System.",
      "ja": "通常、元のシステムのシステムIDシステムが-です。"
    },
    {
      "indent": 6,
      "text": "Additional system-id An Additional system-id that is assigned by the network administrator. Each Additional system-id allows generation of 256 additional, or extended, LSP fragments. The Additional system-id, like the Normal system-id, must be unique throughout the routing domain.",
      "ja": "追加のシステムIDの追加システムID、ネットワーク管理者によって割り当てられます。各追加システムIDが256、追加、または拡張LSPフラグメントの生成を可能にします。追加のシステムIDは、通常のシステムIDのように、ルーティングドメイン全体で一意である必要があります。"
    },
    {
      "indent": 6,
      "text": "Virtual System The system, identified by an Additional system-id, advertised as originating the extended LSP fragments. These fragments specify the Additional system-id in their LSP IDs.",
      "ja": "追加のシステムID、拡張LSPフラグメントを起点として宣伝によって識別される仮想システムシステム。これらの断片は、そのLSP IDの中に追加のシステムIDを指定します。"
    },
    {
      "indent": 6,
      "text": "Original LSP An LSP using the Normal system-id in its LSP ID.",
      "ja": "そのLSPのIDで通常のシステムIDを使用して、元のLSPアンLSP。"
    },
    {
      "indent": 6,
      "text": "Extended LSP An LSP using an Additional system-id in its LSP ID.",
      "ja": "そのLSPのIDに追加のシステムIDを使用してLSPアンLSPを拡張しました。"
    },
    {
      "indent": 6,
      "text": "LSP set Logical LSP. This term is used only to resolve the ambiguity between a logical LSP and an LSP fragment, both of which are sometimes termed \"LSP\".",
      "ja": "LSPは、論理LSPを設定します。この用語は、論理的なLSPと時々「LSP」と呼ばれている両方ともLSPフラグメント間の曖昧さを解決するためにのみ使用されます。"
    },
    {
      "indent": 6,
      "text": "Extended LSP set A group of LSP fragments using an Additional system-id, and originated by the Originating System.",
      "ja": "拡張されたLSPは、追加のシステムIDを使用して、LSPフラグメントのグループを設定し、発信システムによって発信します。"
    },
    {
      "indent": 6,
      "text": "Extension-capable IS An IS implementing the mechanisms described in this document.",
      "ja": "拡張可能なISアンは、この文書で説明するメカニズムを実装しています。"
    },
    {
      "indent": 0,
      "text": "1.3. Operation Modes",
      "section_title": true,
      "ja": "1.3。動作モード"
    },
    {
      "indent": 3,
      "text": "Two administrative operation modes are provided:",
      "ja": "2つの管理の動作モードが提供されています。"
    },
    {
      "indent": 3,
      "text": "- Operation Mode 1 provides behavior that allows implementations that don't support this extension, to correctly process the extended fragment information, without any modifications. This mode has some restrictions on what may be advertised in the extended LSP fragments. Namely, only leaf information may be advertised in the extended LSPs.",
      "ja": " - 動作モード1は、任意の変更を加えることなく、正しく拡張断片情報を処理するために、この拡張をサポートしない実装を可能にする動作を提供します。このモードでは、拡張LSPフラグメントに宣伝することができるかについて、いくつかの制限があります。つまり、唯一の葉の情報は、拡張のLSPで広告することができます。"
    },
    {
      "indent": 3,
      "text": "- Operation Mode 2 extends the previous mode and relaxes its advertisement restrictions. Any link-state information may be advertised in the extended LSPs. However, it mandates a change to the way LSPs are considered during the SPF algorithm, in a way that is not compatible with previous implementations.",
      "ja": " - 動作モード2は、前のモードを拡張し、その広告の制限を緩和します。任意のリンクステート情報は、拡張のLSPにアドバタイズされてもよいです。しかし、それは以前の実装と互換性のない方法で、LSPのは、SPFアルゴリズム中に考慮されている方法に変更を義務付け。"
    },
    {
      "indent": 3,
      "text": "These modes are configured on a per-level and area basis. That is, all LSPs considered in the same SPF instance MUST use the same Mode. There is no restriction that an L1/L2 IS operates in the same mode, for both its L1 and L2 instances. It can use Mode 1 for its L1 LSPs, and Mode 2 for its L2 LSPs, or vice versa.",
      "ja": "これらのモードは、あたりのレベルやエリアごとに設定されています。つまり、同じSPFインスタンスに考慮されるすべてのLSPは、同じモードを使用する必要があります。 L1 / L2 ISがL1とL2のインスタンスの両方に、同じモードで動作制限はありません。それは、その逆のL2のLSPのためのそのL1のLSPのためのモード1、モード2を使用するか、またはすることができます。"
    },
    {
      "indent": 3,
      "text": "Mode 1 has the only advantage of being backwards compatible with older implementations. It does have restrictions which are considered drawbacks. Therefore, routers should operate in Mode 1 only if backwards compatibility is desired. Otherwise, it is recommended to run in Mode 2.",
      "ja": "モード1は、古い実装との後方互換性があるの唯一の利点があります。それは欠点と考えられている制限を持っています。したがって、ルータは、下位互換性が所望される場合にのみ、モード1で動作しなければなりません。それ以外の場合は、モード2で実行することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Routers MAY implement Operational Mode 2 without supporting running in Operational Mode 1. They will still interoperate correctly with routers that support both modes.",
      "ja": "ルータは、彼らはまだ両方のモードをサポートするルータと正しく相互運用します。1.動作モードで動作して支援することなく、動作モード2を実装してもよいです。"
    },
    {
      "indent": 0,
      "text": "1.4. Overview",
      "section_title": true,
      "ja": "1.4。概要"
    },
    {
      "indent": 3,
      "text": "Using Additional system-ids assigned by the administrator, the Originating System can advertise the excess link-state information in extended LSPs under these Additional system-ids. It would do so as if other routers, or \"Virtual Systems\", were advertising this information. These extended LSPs will also have the specified limit on their LSP fragments; however, the Originating System may generate extended LSPs under numerous Virtual Systems.",
      "ja": "管理者によって割り当てられた追加のシステムIDを使用して、発信システムは、これらの追加のシステム、IDSの下で拡張されたLSPの中で過剰リンクステート情報を広告することができます。他のルータ、または「仮想システム」は、この情報を宣伝しているかのように、それはそうでしょう。これらの拡張LSPはまた、彼らのLSPフラグメントに指定された制限があります。しかし、発信システムは、多数の仮想システムの下で拡張されたLSPを生成してもよいです。"
    },
    {
      "indent": 3,
      "text": "For Operation Mode 1, 0-cost adjacencies are advertised from the Originating System to its Virtual System(s). No adjacencies (other than back to the Originating System) are advertised in the extended LSPs. As a consequence, the Virtual Systems are 'stub', meaning they can only be reached through their Originating System. Therefore, older implementations do not need modifications in order to correctly process these extended LSPs.",
      "ja": "動作モード1の場合、0コストの隣接関係は、その仮想システム（複数可）に発信システムからの広告を出しています。 （発信システムにバック以外）は、隣接関係は、拡張のLSPでアドバタイズされていません。その結果、仮想システムは、彼らが唯一の彼らの発信システムを介して到達することができることを意味し、「スタブ」です。そのため、古い実装は、正しくこれらの拡張LSPを処理するために修正を必要としません。"
    },
    {
      "indent": 3,
      "text": "For both modes, each LSP (set) created by a node will contain in its fragment-0 a new TLV (IS Alias ID TLV) that contains the Normal system-id and PN Number of the Original LSP created by the router. Extension-capable ISs can then use this information and store the original and extended LSPs as one logical LSP.",
      "ja": "両方のモードのために、ノードによって作成された各LSP（セット）は、フラグメント0における通常のシステムIDとルータによって作成されたオリジナルLSPのPN数を含む新しいTLV（エイリアスID TLV IS）を含むであろう。拡張可能なのISは、この情報を使用して、一つの論理LSPとしてオリジナルおよび拡張LSPを格納することができます。"
    },
    {
      "indent": 3,
      "text": "The only sections that deal only with Mode 1 additions are 3.2, 3.2.1, and 3.2.2. All other sections relate to both modes.",
      "ja": "モード1の加算のみで対処する唯一のセクションでは、3.2、3.2.1、および3.2.2です。他のすべてのセクションでは、両方のモードに関連しています。"
    },
    {
      "indent": 0,
      "text": "2. IS Alias ID TLV (IS-A)",
      "section_title": true,
      "ja": "2.エイリアスID TLV IS（IS-A）"
    },
    {
      "indent": 3,
      "text": "The proposed IS-A TLV allows extension-capable ISs to recognize all LSPs of an Originating System, and combine the original and extended LSPs for the purpose of SPF computation. It identifies the Normal system-id of the Originating System.",
      "ja": "提案は、IS-TLVは、拡張可能なISSが発信システムのすべてのLSPを認識し、SPF計算の目的のために元の拡張LSPを組み合わせることを可能にします。これは、発信システムの通常のシステムIDを識別します。"
    },
    {
      "indent": 3,
      "text": "The proposed IS Alias ID TLV is type 24, and its format is as follows:",
      "ja": "提案されているエイリアスID TLVは24型であり、次のようにそのフォーマットは次のとおり"
    },
    {
      "indent": 3,
      "text": "x CODE - 24.",
      "ja": "x CODE  -  24。"
    },
    {
      "indent": 3,
      "text": "x LENGTH - total length of the value field.",
      "ja": "×長さ - 値フィールドの長さの合計。"
    },
    {
      "indent": 3,
      "text": "x VALUE -",
      "ja": "X値 - "
    },
    {
      "indent": 6,
      "text": "                      No. of Octets\n+-------------------+\n| Normal system-id  |      6\n+-------------------+\n| Pseudonode number |      1\n+-------------------+\n| Sub-TLVs length   |      1\n+-------------------+\n|                   |     0-247\n: Sub-TLVs          :\n:                   :\n|                   |\n+-------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Normal system-id The Normal system-id of the LSP set, as described in section 1.2 of this document.",
      "ja": "この文書のセクション1.2に記載されるようにLSPのセットの通常のシステム-ID通常のシステム-ID。"
    },
    {
      "indent": 3,
      "text": "Pseudonode number The Pseudonode number of the LSP set. LSPs with the same Normal system-id and Pseudonode number are considered in SPF as one logical LSP, as described in section 5 of this document.",
      "ja": "擬似ノード番号LSPセットの擬似番号。この文書のセクション5に記載したのと同じ通常のシステムIDと擬似ノード番号のLSPは、一つの論理LSPとしてSPFにおいて考慮されます。"
    },
    {
      "indent": 3,
      "text": "Sub-TLVs length Total length of all sub-TLVs.",
      "ja": "すべてのサブのTLVのサブTLVの長合計の長さ。"
    },
    {
      "indent": 3,
      "text": "Sub-TLVs A series of tuples with the following format:",
      "ja": "サブTLVは以下の形式を持つタプルの一連。"
    },
    {
      "indent": 3,
      "text": "                      No. of Octets\n+-------------------+\n| Sub-type          |      1\n+-------------------+\n| Length            |      1\n+-------------------+\n|                   |     0-245\n: Value             :\n:                   :\n|                   |\n+-------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Sub-type Type of the sub-TLV",
      "ja": "サブTLVのサブタイプの種類"
    },
    {
      "indent": 3,
      "text": "Length Total length of the value field",
      "ja": "値フィールドの長さは全長"
    },
    {
      "indent": 3,
      "text": "Value Type-specific TLV payload.",
      "ja": "値タイプ固有のTLVペイロード。"
    },
    {
      "indent": 3,
      "text": "For an explanation on sub-TLV handling, see [ISIS-TE].",
      "ja": "サブTLVの取り扱いに関する説明については、[ISIS-TE]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Without sub-TLVs, this structure consumes 8 octets per LSP set. This TLV MUST be included in fragment 0 of every LSP set belonging to an Originating System running in either Mode 1 or Mode 2. Currently, there are no sub-TLVs defined.",
      "ja": "サブTLVをせずに、この構造は、LSPセットあたり8つのオクテットを消費します。このTLVは、現在、定義されたサブのTLVが存在しないモード1又はモード2のいずれかで実行されている発信システムに属するすべてのLSPのセットのフラグメント0に含まれなければなりません。"
    },
    {
      "indent": 3,
      "text": "For a complete list of used IS-IS TLV numbers, see [ISIS-CODES].",
      "ja": "使用ISIS TLV番号の完全なリストについては、[ISIS-CODES]を参照してください。"
    },
    {
      "indent": 0,
      "text": "3. Generating LSPs",
      "section_title": true,
      "ja": "3.生成するLSP"
    },
    {
      "indent": 0,
      "text": "3.1. Both Operation Modes",
      "section_title": true,
      "ja": "3.1。どちらの動作モード"
    },
    {
      "indent": 3,
      "text": "Under both modes, the Originating System MUST include information binding the Original LSP and the Extended ones. It can do this since it is trivially an extension-capable IS. This is to ensure other extension-capable routers correctly process the extra information in their SPF calculation. This binding is advertised via a new IS Alias ID TLV, which is advertised in all fragment 0 of Original and Extended LSPs.",
      "ja": "両方のモードの下では、発信システムは、オリジナルLSPと拡張ものをバインド情報を含まなければなりません。それは自明の拡張-可能となっているので、これを行うことができます。これは正しく彼らのSPF計算に余分な情報を処理する他の拡張可能なルータを確保することです。このオリジナルと拡張LSPのすべてのフラグメント0でアドバタイズされるエイリアスID TLVは、新しい経由で広告されているバインディング。"
    },
    {
      "indent": 3,
      "text": "+---------------------------------------------+\n|  Originating System                         |\n|  system-id   = S                            |\n|  is-alias-id = S                            |\n+---------------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "+-------------------+     +-------------------+\n|  Virtual System   |     |  Virtual System   |\n|  system-id   = S' |     |  system-id   = S''|\n|  is-alias-id = S  |     |  is-alias-id = S  |\n+-------------------+     +-------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Figure 1. Advertising binding between all of a system's LSPs (both modes). S' and S'' are configured as Additional system-ids.",
      "ja": "システムののLSP（両モード）の全ての間の結合図1.広告。 S」とS 『』の追加のシステム-IDとして設定されています。"
    },
    {
      "indent": 3,
      "text": "When new extended LSP fragments are generated, these fragments should be generated as specified in ISO/IEC 10589 [ISIS-ISO]. Furthermore, a system SHOULD treat its extended LSPs the same as it treats its original LSPs, with the exceptions noted in the following sections. Specifically, creating, flooding, renewing, purging and all other operations are similar for both Original and Extended LSPs, unless stated otherwise. The Extended LSPs will use one of the Additional system-ids configured for the router, in their LSP ID.",
      "ja": "新しい拡張LSPフラグメントが生成されるときにISO / IEC 10589 [ISIS-ISO]で指定されるように、これらのフラグメントが生成されるべきです。それは次のセクションで述べた例外を除いて、元のLSPを扱うようさらに、システムは、同じその拡張LSPを扱うべきです。具体的には、フラッディングを作成更新、パージ及び特に明記しない限り、他のすべての操作は、オリジナルと拡張の両方のLSPのために類似しています。拡張LSPは、そのLSPのIDで、ルータに設定の追加システム-idのいずれかを使用します。"
    },
    {
      "indent": 3,
      "text": "Extended LSPs fragment zero should be regarded in the same special manner as specified in ISO/IEC 10589 for LSPs with number zero, and should include the same type of extra information as specified in ISO/IEC 10589 and RFC 1195 [ISIS-IP]. So, for example, when a system reissues its LSP fragment zero due to an area address change, it should reissue all extended LSPs fragment zero as well.",
      "ja": "拡張のLSPフラグメントゼロは、ISO / IEC 10589で指定されている数字のゼロとのLSPに対して同じ特別な方法で見なされるべきであり、ISO / IEC 10589及びRFC 1195 [ISIS-IP]に指定されている追加情報の同じタイプを含むべきです。したがって、たとえば、システムが原因領域アドレスの変更にそのLSPフラグメントゼロを再発行するとき、それは同様にすべての拡張のLSPフラグメントゼロを再発行しなければなりません。"
    },
    {
      "indent": 3,
      "text": "An extended LSP fragment zero MUST be generated for every extended LSP set, to allow a router's SPF calculation to consider those fragments in that set. See section 5 for details.",
      "ja": "拡張LSPフラグメントゼロはそのセットでそれらの断片を検討するルータのSPF計算を可能にするために、すべての拡張されたLSPのセットのために生成されなければなりません。詳細については、セクション5を参照してください。"
    },
    {
      "indent": 0,
      "text": "3.1.1. The Attached Bits",
      "section_title": true,
      "ja": "3.1.1。添付ビット"
    },
    {
      "indent": 3,
      "text": "The Attached (ATT) bits SHOULD be set to zero for all four metric types, on all Extended LSPs. This is due to the following: if a Virtual System is reachable, so is its Originating System. It is preferable, then, that an L1 IS chooses the Originating System and not the Virtual System as its nearest L2 exit point, as connectivity to the Virtual System has a higher probability of being lost (as a result of the extended LSP no longer being advertised). This could cause unnecessary computations on some implementations.",
      "ja": "添付（ATT）ビットは、すべての拡張のLSPに、すべての4つのメトリックタイプのゼロに設定されるべきです。これは、次によるものです：仮想システムが到達可能である場合、そのその発信システムです。これは、L1と仮想システムへの接続のように、元のシステムはなく、最も近いL2出口点として仮想システムを選択すること、次いで、好ましいもはやである拡張LSPの結果として失われるのより高い確率を（持っていません宣伝）。これは、いくつかの実装上の不要な計算を引き起こす可能性があります。"
    },
    {
      "indent": 0,
      "text": "3.1.2. The Partition Repair Bit",
      "section_title": true,
      "ja": "3.1.2。パーティションの修復ビット"
    },
    {
      "indent": 3,
      "text": "The Partition Repair (P) bit SHOULD be set to zero on all extended LSPs. This is for the same reasons as for the Attached bits.",
      "ja": "パーティション修復（P）ビットは、すべての拡張のLSPにゼロに設定されるべきです。これは、添付ビットと同じ理由です。"
    },
    {
      "indent": 0,
      "text": "3.1.3. ES Neighbors TLV",
      "section_title": true,
      "ja": "3.1.3。 ESネイバーTLV"
    },
    {
      "indent": 3,
      "text": "ISO/IEC 10589 [ISIS-ISO] section 7.3.7 specifies inserting an ES Neighbor TLV in L1 LSPs, with the system ID of the router. RFC 1195 [ISIS-IP] relieves IP-only routers of this requirement. However, for routers that do insert this ESN TLV in L1 LSPs (whether IP-only or OSI-capable), then in an extended LSP, the ESN TLV should include the relevant Additional system-id. Furthermore, OSI-capable routers should accept packets destined for this Additional system-id.",
      "ja": "ISO / IEC 10589 [ISIS-ISO]セクション7.3.7ルータのシステムIDと、L1のLSPにESネイバーTLVを挿入することを指定します。 RFC 1195 [ISIS-IP]は、この要件のIP専用ルーターを軽減します。ただし、L1のLSP（IP専用またはOSI-できるかどうか）にこのESN TLVを挿入しないルータ、次いで拡張LSPに、ESN TLVに関連する追加のシステムIDを含むべきです。また、OSI対応ルータは、この追加システムID宛てのパケットを受け入れるべきです。"
    },
    {
      "indent": 0,
      "text": "3.1.4. Overload Bit",
      "section_title": true,
      "ja": "3.1.4。過負荷ビット"
    },
    {
      "indent": 3,
      "text": "The overload bit should be set consistently across all LSPs, original and extended, belonging to an Originating System, and should reflect the Originating System's overload state.",
      "ja": "過負荷ビットは、発信システムに属し、オリジナルの拡張、すべてのLSP一貫設定する必要があり、かつ発信システムの過負荷状態を反映する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.1.5. Other Fields and TLVs",
      "section_title": true,
      "ja": "3.1.5。他の分野とのTLV"
    },
    {
      "indent": 3,
      "text": "Other fields and TLVs not mentioned above remain the same, both for original and extended LSPs.",
      "ja": "前述しない他のフィールドとのTLVの両方オリジナルおよび拡張のLSPのために、同じままです。"
    },
    {
      "indent": 0,
      "text": "3.2. Operation Mode 1 Additions",
      "section_title": true,
      "ja": "3.2。動作モード1件の追加"
    },
    {
      "indent": 3,
      "text": "The following additions apply only to routers generating LSPs in Mode 1. Routers, which are configured to operate in Operation Mode 2, SHOULD NOT apply these additions to their advertisements.",
      "ja": "次の追加は、その広告にこれらの追加を適用しないでください、モード2動作で動作するように構成されているモード1ルータにLSPを生成ルータにのみ適用されます。"
    },
    {
      "indent": 3,
      "text": "Under Operation Mode 1, adjacencies from the Originating System to its Virtual Systems are advertised using the standard neighbor TLVs. The metric for these connections MUST be zero, since the cost of reaching a Virtual System is the same as the cost of reaching its Originating System.",
      "ja": "動作モード1の下では、その仮想システムへの発信システムからの隣接関係は、標準的な隣人TLVを使用してアドバタイズされます。仮想システムに到達するコストは、その発信システムに達するのコストと同じであるので、これらの接続のためのメトリックは、ゼロでなければなりません。"
    },
    {
      "indent": 3,
      "text": "To older implementations, Virtual Systems would appear reachable only through their Originating System, hence loss of connectivity to the Originating System means loss of connectivity to all of its information, including that advertised in its extended LSPs. Furthermore, the cost of reaching information advertised in non-extended LSPs is the same as the cost of reaching information advertised in the new extended LSPs, with an additional hop.",
      "ja": "古い実装に、仮想システムは、発信システムへの接続が故に損失、唯一の彼らの発信システムを通じて到達可能と思われるが、その延長のLSPに広告を出していることを含め、その情報の全てへの接続の損失を意味しています。また、非拡張のLSPで広告情報に到達するコストは、追加のホップで、新しい拡張のLSPで広告情報に到達するコストと同じです。"
    },
    {
      "indent": 3,
      "text": "+---------------------------------------------+\n|         Originating System                  |\n|         system-id = S                       |\n|         is-alias-id = S                     |\n+---------------------------------------------+\n       |    /\\                    |    /\\\ncost=0 |    |cost=max-1    cost=0 |    |cost=max-1\n       |    |                     |    |\n       \\/   |                     \\/   |\n+-------------------+     +-------------------+\n|  Virtual System   |     |  Virtual System   |\n|  system-id   = S' |     |  system-id   = S''|\n|  is-alias-id = S  |     |  is-alias-id = S  |\n+-------------------+     +-------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Figure 2. Advertising connections to Virtual Systems under Operation Mode 1. S' and S'' are configured as Additional system-ids.",
      "ja": "動作モード1. S」とS 『』の下に仮想システムへ図2.広告接続は、追加のシステム-IDとして設定されています。"
    },
    {
      "indent": 3,
      "text": "Under Operation Mode 1, only \"leaf\" information, i.e., information that serves only as leaves in a shortest path tree, can be advertised in extended LSPs.",
      "ja": "動作モード1の下で、唯一の「葉」情報、すなわち、唯一の最短経路ツリーの葉としての情報は、拡張されたLSPでアドバタイズすることができます。"
    },
    {
      "indent": 3,
      "text": "When an Extended LSP belonging to Additional system-id S' is first created, the Original LSP MUST specify S' as a neighbor, with metric set to zero. This is in order to consider the cost of reaching the Virtual System S' the same as the cost of reaching its Originating System. Furthermore, the Extended LSP MUST specify the Normal system-id as a neighbor. The metric SHOULD be set to MaxLinkMetric - 1 (this is only for uniformity purpose, any metric greater than zero is acceptable). This in order to satisfy the two-way connectivity check on other routers. Where relevant, this adjacency SHOULD be considered as point-to-point.",
      "ja": "追加のシステムIDのSに属する拡張LSPをするとゼロにメトリックを設定して、隣人として「最初に作成され、オリジナルLSPはSを指定しなければなりません」。これは、仮想システムS」その発信システムに達するのコストと同じに達するのコストを考慮するためです。また、拡張LSPは、隣接などの通常のシステムIDを指定する必要があります。 1（これが唯一の均一性のためであり、ゼロ以外の任意のメトリック大きいが許容可能である） - メトリックはMaxLinkMetricに設定されるべきです。この他のルータ上の双方向の接続性チェックを満足させるためです。関連する場合、この隣接は、ポイントツーポイントと考えるべきです。"
    },
    {
      "indent": 3,
      "text": "Note, that the restriction specified in ISO/IEC 10589 section 7.2.5 holds: if an LSP Number zero of the Originating System is not present, none of that system's neighbor entries would be processed during SPF, hence none of its extended LSPs would be processed as well.",
      "ja": "発信システムのLSP数ゼロが存在しない場合、そのシステムのネイバーエントリのいずれも、したがって、その拡張LSPのいずれもないであろう、SPF中に処理されないであろう：ISO / IEC 10589のセクション7.2.5で指定された制限が成立することに注意してください同様に処理されます。"
    },
    {
      "indent": 0,
      "text": "3.2.1. IS Neighbors TLV (Mode 1 Only)",
      "section_title": true,
      "ja": "3.2.1。 ISネイバーTLV（モード1のみ）"
    },
    {
      "indent": 3,
      "text": "An Extended LSP must specify only the Originating System as a neighbor, with the metric set to (MaxLinkMetric - 1). Where relevant, this adjacency should be considered as point-to-point. Other neighbors MUST NOT be specified in an Extended LSP, because those other neighbors would only specify the Originating System and not the Virtual System, and hence would not satisfy the bi-directionality check in the SPF computation.",
      "ja": "拡張LSPは、（ -  1 MaxLinkMetric）のメトリックのセットと、ネイバーとしてのみ発信システムを指定しなければなりません。関連する場合、この隣接は、ポイントツーポイントと考えるべきです。その他の近隣には、それらの他の隣人が唯一の仮想システム発信システムを指定しないので、拡張LSPに指定することはできません、したがって、SPF計算での双方向性チェックを満たしていないでしょう。"
    },
    {
      "indent": 0,
      "text": "3.2.2. Originating System in the Overload State in (Mode 1 Only)",
      "section_title": true,
      "ja": "3.2.2。 （モード1のみ）での過負荷状態に起因するシステム"
    },
    {
      "indent": 3,
      "text": "If the Originating System is in the overload state, information in the extended LSPs will not be processed by other routers in their SPF computation. This is because in Mode 1, extended LSPs are reachable only through adjacencies from the Original LSP. If this LSP has set its OL bit, adjacencies will not be processed in the SPF computation.",
      "ja": "発信システムが過負荷状態にある場合は、拡張のLSPの情報は、彼らのSPF計算の他のルータによって処理されることはありません。モード1では、拡張のLSPのみオリジナルLSPから隣接を通じて到達可能であるためです。このLSPは、そのOLのビットを設定した場合、隣接関係は、SPF計算で処理されることはありません。"
    },
    {
      "indent": 3,
      "text": "This side effect should be taken into consideration when operating in Mode 1.",
      "ja": "モード1で動作しているとき、この副作用は考慮されるべきです。"
    },
    {
      "indent": 0,
      "text": "4. Purging Extended LSP Fragments",
      "section_title": true,
      "ja": "4.拡張LSPフラグメントをパージ"
    },
    {
      "indent": 3,
      "text": "ISO/IEC 10589 [ISIS-ISO] section 7.3.4.4 note 25 suggests that an implementation keeps the number of LSP fragments within a certain limit based on the optimal (minimal) number of fragments needed. Section 7.3.4.6 also recommends that an IS purge its empty LSPs to conserve resources. These recommendations hold for the extended LSP fragments as well. However, an extended LSP fragment zero should not be purged until all of the fragments in its set (i.e., belonging to a particular Additional system-id), are empty as well. This is to ensure implementations consider the fragments in their SPF computations, as specified in section 7.2.5.",
      "ja": "ISO / IEC 10589 [ISIS-ISO]セクション7.3.4.4ノート25は、実装が必要な断片の最適な（最小の）数に基づいて、特定の限度内LSPフラグメントの数を維持することを示唆しています。セクション7.3.4.6でもありますが、リソースを節約するために、その空のLSPを消去することをお勧めします。これらの勧告は、同様に、拡張LSPフラグメントのために保持します。しかし、拡張LSPフラグメントゼロは、そのセット内のフラグメントの全てまでパージされるべきではない（すなわち、特定の追加のシステム-IDに属する）、同様に空です。これは、セクション7.2.5に指定されている実装は、彼らのSPF計算で断片を考えるようにすることです。"
    },
    {
      "indent": 3,
      "text": "In Operational Mode 1, when all the extended LSP fragments of a particular Additional system-id S' have been purged, the Originating System SHOULD remove the neighbor information to S' from its original LSPs.",
      "ja": "特定のその他のシステムのID Sのすべての拡張LSPフラグメントが動作モード1では、元のLSPから「パージされた、発信システムは、Sに隣接情報を削除してください」。"
    },
    {
      "indent": 0,
      "text": "5. Modifications to LSP handling in SPF",
      "section_title": true,
      "ja": "SPFの取り扱いLSP 5.変更"
    },
    {
      "indent": 3,
      "text": "This section describes modifications to the way extension-capable ISs handle LSPs for the SPF computation.",
      "ja": "このセクションでは、拡張可能なISSはSPFの計算のためのLSPを処理する方法に変更を記述する。"
    },
    {
      "indent": 3,
      "text": "When considering LSPs of an extension-capable IS (identified by the inclusion of the IS Alias ID TLV), the original and extended LSPs are combined to form one large logical LSP. If the LSP belongs to an IS running Operational Mode 1, there might be adjacencies between the original and extended LSPs. These are trivially ignored (since when processing them the large logical LSP is already on PATHS), and does not complicate the SPF. Furthermore, this check should already be implemented (this scenario could occur on error, without this extension).",
      "ja": "拡張可能な（ISエイリアスID TLVを含めることによって識別される）であり、元の拡張のLSPを組み合わせたのLSPを考慮するとき一つの大きな論理LSPを形成します。 LSPはに属している場合は動作モード1を実行している、元と拡張のLSP間の隣接があるかもしれません。これらは、（それらを処理するときに、大きな論理LSPはパスですでにあるので）自明無視され、SPFを複雑にしません。また、このチェックが既に（このシナリオでは、この拡張せず、エラーの発生する可能性）を実施すべきです。"
    },
    {
      "indent": 3,
      "text": "If LSP fragment 0 of the Original LSP set is missing or its RemainingLifetime is zero, all of the LSPs generated by that Originating System (Extended as well) MUST NOT be considered in the SPF. That is, the large logical LSP is not considered in the SPF. The original LSP fragments are identified when the is-alias-id value is the same as the system-id of those LSPs. If an LSP fragment 0 of an extended LSP set is missing or its RemainingLifetime is zero, only that LSP set MUST NOT be considered in the SPF. These rules are present to ensure consistent SPF results on Mode 1 and Mode 2 LSPs.",
      "ja": "オリジナルLSPセットのLSPフラグメント0が欠落しているか、そのRemainingLifetimeがゼロの場合、（同様に拡張）その発信システムによって生成されたLSPの全ては、SPFに考慮されてはなりません。これは、大規模な論理LSPはSPFでは考慮されていない、です。 IS-エイリアス-ID値は、これらのLSPのシステムIDと同じである場合、元のLSPフラグメントが識別されます。拡張されたLSPセットのLSPフラグメント0が欠落しているか、そのRemainingLifetimeがゼロの場合のみ、そのLSPセットがSPFに考慮されてはなりません。これらのルールは、モード1とモード2つのLSPに一致SPF結果を確保するために存在します。"
    },
    {
      "indent": 3,
      "text": "Note, that the above behavior is consistent with how previous implementations will interpret Mode 1 LSPs.",
      "ja": "上記の動作は、以前の実装は、モード1つのLSPをどのように解釈するかと一致していることに、注意してください。"
    },
    {
      "indent": 0,
      "text": "6. Forming Adjacencies",
      "section_title": true,
      "ja": "6.成形隣接関係"
    },
    {
      "indent": 3,
      "text": "It should be noted, that an IS MUST use the system-id of the LSP that will include a neighbor, when forming an adjacency with that neighbor. That is, if a neighbor is to be included in extended LSP S', then S' should be used as the system-id in IS Hellos [3] and IS-IS Hellos when forming an adjacency with that neighbor. This is regardless of the Operational Mode. Of course, in Mode 1 this means that only the Normal system-id will be used when sending hellos.",
      "ja": "そのネイバーとの隣接関係を形成する際に、隣人を含むことが意図されるLSPのシステムIDを使用する必要があることに留意すべきです。隣接拡張LSP Sに含まれるべきである場合には「は、S」は、あるハローズで、システムIDとして使用されるべきである[3]とそのネイバーとの隣接関係を形成する際にハローズ-あります。これは関係なく、動作モードのです。もちろん、モード1で、これはhelloを送信するときにのみ、通常のシステムIDが使用されることを意味します。"
    },
    {
      "indent": 0,
      "text": "7. Interoperating between extension-capable and non-extension-capable ISs.",
      "ja": "7.拡張可能なおよび非拡張可能なIS間の相互運用。"
    },
    {
      "indent": 3,
      "text": "In order to correctly advertise link-state information under Operation Mode 2, all ISs in an area must be extension-capable. However, it is possible to not upgrade every router in the network, if the extended information is not routing information, but rather data that is of use to only a subset of routers (e.g., optical switches using IS-IS could carry optical-specific information in extended LSPs)",
      "ja": "正しく動作モード2の下にリンクステート情報を広告するためには、エリア内のすべてのISは拡張-可能でなければなりません。拡張情報は、ルーティング情報をされていない場合しかし、ネットワーク内のすべてのルータをアップグレードしないことが可能であるが、むしろルーターのサブセットのみに使用であるデータ（例えば、IS-ISを使用した光スイッチは、光の特定を運ぶことができます拡張のLSPの情報）"
    },
    {
      "indent": 3,
      "text": "If a live network contains routers exceeding the 256 fragment limit, and for some reason the upgrade has to be done incrementally, it is possible to transition the network, using the following steps:",
      "ja": "ライブネットワークは、256のフラグメント限界を超えるルータが含まれており、何らかの理由でアップグレードがインクリメンタルに行われなければならない場合は、次の手順を使用して、ネットワークを移行することが可能です。"
    },
    {
      "indent": 3,
      "text": "- Upgrade the routers, one-by-one, to run this extension in Operation Mode 1. The other non-extension-capable routers will interoperate correctly.",
      "ja": " - 他の非拡張可能なルータが正しく相互運用できます動作モード1でこの拡張機能を実行するために、1つずつ、ルータをアップグレードします。"
    },
    {
      "indent": 3,
      "text": "- When all routers are extension-capable, configure them one-by-one to run in Operation Mode 2. All extension-capable routers interoperate correctly, regardless of what mode they are run in.",
      "ja": " - すべてのルータが拡張可能な場合にかかわらず、それらが実行されているものモードの、すべての拡張可能なルータが正しく相互運用動作モード2で実行するためにそれらを1つずつ設定します。"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD support a configuration parameter controlling the LSP origination behavior. The default value of this parameter SHOULD correspond to the behavior described in [ISIS-ISO], i.e., neither of the two modes described in this document should be enabled without explicit configuration when the router software is upgraded with this extension.",
      "ja": "実装はLSPの発信動作を制御する設定パラメータをサポートする必要があります。このパラメータのデフォルト値は、ルータソフトウェアはこの拡張子でアップグレードされるとき、明示的な構成なしで有効にする必要があり、すなわち、いずれも本文書に記載の2つのモードの、[ISIS-ISO]に記載された動作に対応すべきです。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document raises no new security issues for IS-IS.",
      "ja": "この文書では、IS-ISのための新しいセキュリティ上の問題を提起していません。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgments",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Tony Li and Radia Perlman for helpful comments and suggestions on the subject.",
      "ja": "著者は、件名に有用なコメントや提案のためのトニー・リーとラディア・パールマンに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[ISIS-ISO] \"Intermediate System to Intermediate System Intra-Domain Routeing Exchange Protocol for use in Conjunction with the Protocol for Providing the Connectionless-mode Network Service (ISO 8473)\", ISO/IEC 10589:2002, Second Edition.",
      "ja": "[ISIS-ISO]「中間システムは中間システム、ドメイン内のRouteing交換プロトコルへのコネクションレスモードネットワークサービス（ISO 8473）の提供のための議定書と併せて使用する」、ISO / IEC 10589：2002、第2版。"
    },
    {
      "indent": 3,
      "text": "[ISIS-IP] Callon, R., \"Use of OSI IS-IS for routing in TCP/IP and dual environments\", RFC 1195, December 1990.",
      "ja": "[ISIS-IP] Callon、R.、 \"TCP / IPやデュアル環境でのルーティングのためのOSI ISISの使用\"、RFC 1195、1990年12月。"
    },
    {
      "indent": 3,
      "text": "[ISIS-TE] Smit, H. and T. Li, \"Intermediate System to Intermediate System (IS-IS) Extensions for Traffic Engineering (TE)\", RFC 3784, May 2004.",
      "ja": "[ISIS-TE]スミット、H.、およびT.李、 \"トラフィックエンジニアリングのための中間システム（ISIS）拡張機能（TE）への中間システム\"、RFC 3784、2004年5月。"
    },
    {
      "indent": 3,
      "text": "[BCP14] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[BCP14]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[DOMAIN-WIDE] Li, T., Przygienda, T. and H. Smit, \"Domain-wide Prefix Distribution with Two-Level IS-IS\", RFC 2966, October 2000.",
      "ja": "[DOMAIN-WIDE]李、T.、Przygienda、T.とH.スミット、 \"IS-IS二レベルでドメイン全体のプレフィックス配布\"、RFC 2966、2000年10月。"
    },
    {
      "indent": 3,
      "text": "[ISIS-CODES] Przygienda, T., \"Reserved Type, Length and Value (TLV) Codepoints in Intermediate System to Intermediate System\", RFC 3359, August 2002.",
      "ja": "[ISIS-CODES] Przygienda、T.、 \"予約の種類、長さと中間システムへの中間システムでの値（TLV）コードポイント\"、RFC 3359、2002年8月。"
    },
    {
      "indent": 0,
      "text": "11. Authors' Addresses",
      "section_title": true,
      "ja": "11.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Amir Hermelin Montilio Inc. 1 Maskit St. POB 12253 Herzelia, 46733 ISRAEL",
      "ja": "アミールHermelin Montilio株式会社1 MaskitセントPOB 12253 Herzelia、46733イスラエル"
    },
    {
      "indent": 3,
      "text": "Phone: +972 9 9511944 Fax: +972 9 9542430 EMail: amir@montilio.com",
      "ja": "電話：+972 9 9511944ファックス：+972 9 9542430 Eメール：amir@montilio.com"
    },
    {
      "indent": 3,
      "text": "Stefano Previdi Cisco Systems, Inc. Via Del Serafico 200 00142 Roma Italy",
      "ja": "スティーブンは、Cisco Systems、Inc.のヴィアデルセラフィック200 00142ローマイタリア予感しました"
    },
    {
      "indent": 3,
      "text": "Phone: +39 06 5164 4491 EMail: sprevidi@cisco.com",
      "ja": "電話：+39 06 5164 4491 Eメール：sprevidi@cisco.com"
    },
    {
      "indent": 3,
      "text": "Mike Shand Cisco Systems 250, Longwater Avenue, Green Park, Reading, RG2 6GB, UK",
      "ja": "マイク・シャンドシスコシステムズ250、Longwaterアベニュー、グリーンパーク、読書、RG2 6ギガバイト、英国"
    },
    {
      "indent": 3,
      "text": "Phone: +44 20 8824 8690 EMail: mshand@cisco.com",
      "ja": "電話：+44 20 8824 8690 Eメール：mshand@cisco.com"
    },
    {
      "indent": 0,
      "text": "12. Full Copyright Statement",
      "section_title": true,
      "ja": "12.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（C）インターネット協会（2004）。この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}