{
  "title": {
    "text": "RFC 3429 - Assignment of the 'OAM Alert Label' for Multiprotocol Label Switching Architecture (MPLS) Operation and Maintenance (OAM) Functions",
    "ja": "RFC 3429 - マルチプロトコルラベルスイッチングアーキテクチャ（MPLS）動作及び保守（OAM）機能のための「OAMの警告ラベル」の割り当て"
  },
  "number": 3429,
  "created_at": "2019-10-28 05:34:36.424005+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            H. Ohta\nRequest for Comments: 3429                                           NTT\nCategory: Informational                                    November 2002",
      "raw": true
    },
    {
      "indent": 11,
      "text": "     Assignment of the 'OAM Alert Label' for\nMultiprotocol Label Switching Architecture (MPLS)\n   Operation and Maintenance (OAM) Functions",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2002）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the assignment of one of the reserved label values defined in RFC 3032 (MPLS label stack encoding) to the 'Operation and Maintenance (OAM) Alert Label' that is used by user-plane Multiprotocol Label Switching Architecture (MPLS) OAM functions for identification of MPLS OAM packets.",
      "ja": "この文書は、アーキテクチャ（MPLS）OAM機能を切り替え、ユーザプレーンマルチプロトコルラベルで使用される「運用及び保守（OAM）警告ラベル」にRFC 3032で定義された予約ラベル値（MPLSラベルスタック符号化）のいずれかの割り当てを記述しMPLS OAMパケットを識別するため。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document describes the assignment of one of the reserved label values defined in RFC 3032 (MPLS label stack encoding [2]) to the 'OAM Alert Label' that is used by user-plane MPLS OAM functions for identification of MPLS OAM packets as described in the ITU-T Recommendation Y.1711 [1] (on MPLS OAM functions).",
      "ja": "この文書では、説明したように、MPLS OAMパケットを識別するためのユーザプレーンMPLS OAM機能によって使用されます。「OAMの警告ラベル」に（[2] MPLSラベルスタック符号化）RFC 3032で定義された予約ラベル値のうちの一つの割り当てを記述しITU-T勧告Y.1711 [1]（MPLSのOAM機能に）。"
    },
    {
      "indent": 0,
      "text": "2. OAM functions",
      "section_title": true,
      "ja": "2. OAM機能"
    },
    {
      "indent": 3,
      "text": "MPLS OAM (Operation and Maintenance) functions provide necessary tools for network operators to operate and maintain the networks. MPLS OAM functionality is required at the MPLS layer, and more specifically at each MPLS level, independent of OAM functionality provided by the lower layers (SONET/SDH, etc.). The objectives of the OAM functions include the following:",
      "ja": "MPLS OAM（操作及びメンテナンス）機能は、ネットワークオペレータがネットワークを運営及び維持するために必要なツールを提供します。 MPLS OAM機能は、MPLS層において必要であり、より具体的には、各MPLSレベルで、下位層（SONET / SDH、等）によって提供されるOAM機能とは無関係です。 OAM機能の目的は、次のものがあります。"
    },
    {
      "indent": 3,
      "text": "- Defect and failure detection: Defect/failures affecting the transport of user information are detected by continuous or periodic checking. As a result, maintenance event information or appropriate alarms will be produced.",
      "ja": " - 欠陥及び故障検出：欠陥/ユーザ情報の輸送に影響を与える障害が、連続的または周期的なチェックによって検出されます。その結果、保守イベント情報や適切なアラームが生成されます。"
    },
    {
      "indent": 3,
      "text": "- Reporting the defect/failure information: Defect information is given to other management entities (e.g., Operation Support System) in order to provide the appropriate indications to the maintenance staff for maintaining the Quality of Service (QoS) level offered to customers.",
      "ja": " - 欠陥/障害情報をレポート：欠陥情報を顧客に提供するサービスの品質（QoS）レベルを維持するための保守担当者に適切な指示を提供するために、他の管理エンティティ（例えば、オペレーションサポートシステム）に与えられています。"
    },
    {
      "indent": 3,
      "text": "- Defect/failure localization: Determination by internal or external test systems of a failed entity is performed if defect information is insufficient.",
      "ja": " - 欠陥/故障定位：欠陥情報が不十分である場合に失敗エンティティの内部または外部のテストシステムによって判定が行われます。"
    },
    {
      "indent": 3,
      "text": "- Performance monitoring: Performance (packet losses, transfer delay, bit errors, etc.) of the user information transport is measured in order to estimate the transport integrity.",
      "ja": " - パフォーマンスの監視：ユーザ情報転送の性能（パケット損失、転送遅延、ビット誤りなど）輸送の完全性を推定するために測定されます。"
    },
    {
      "indent": 0,
      "text": "3. OAM Packet Identification",
      "section_title": true,
      "ja": "前記OAMパケット識別"
    },
    {
      "indent": 3,
      "text": "The user-plane MPLS OAM mechanisms as described in the ITU-T Recommendation Y.1711 [1] uses a special label called 'OAM Alert Label' to differentiate OAM packets from the normal user packets. One of the reserved label values defined in RFC 3032 (MPLS label stack encoding [2]) is assigned to 'OAM Alert Label'. A value of 14 is used for this purpose.",
      "ja": "ユーザプレーンMPLS OAMメカニズムITU-T勧告Y.1711に記載されているように[1]通常のユーザパケットからOAMパケットを区別するために「OAMの警告ラベル」と呼ばれる特殊なラベルを使用します。 RFC 3032で定義された予約ラベル値の一つ（MPLSラベルスタックエンコーディング[2]）「OAMの警告ラベル」に割り当てられます。 14の値は、この目的のために使用されます。"
    },
    {
      "indent": 0,
      "text": "4. MPLS OAM work in ITU-T SG13",
      "section_title": true,
      "ja": "ITU-T SG13 4. MPLS OAMの仕事"
    },
    {
      "indent": 3,
      "text": "ITU-T Study Group 13, Question 3/13 is progressing work on user-plane MPLS OAM and has produced the following documents:",
      "ja": "ITU-T研究グループ13は、質問3/13は、ユーザプレーンのMPLS OAMに作業を進めていると、次の書類を作成しました："
    },
    {
      "indent": 3,
      "text": "(1) Recommendation Y.1710 (Requirements for OAM functionality for MPLS networks) [3]",
      "ja": "（1）勧告Y.1710（MPLSネットワークのOAM機能のための要件）[3]"
    },
    {
      "indent": 3,
      "text": "(2) Corrigendum 1 to Recommendation Y.1710 [4]",
      "ja": "勧告Y.1710（2）追補1 [4]"
    },
    {
      "indent": 3,
      "text": "(3) Recommendation Y.1711 (OAM mechanisms for MPLS networks) [1]",
      "ja": "（3）勧告Y.1711（MPLSネットワークのOAMメカニズム）[1]"
    },
    {
      "indent": 3,
      "text": "(4) Draft Recommendation Y.1720 (Protection switching for MPLS networks) [6] relies on OAM mechanisms in Y.1711, under last call as of Nov. 2002.",
      "ja": "（4）勧告草案Y.1720（ProtectionがMPLSネットワークに切り替える）[6] 2002年11月のように最後の呼び出しの下で、Y.1711でOAMメカニズムに依存しています。"
    },
    {
      "indent": 0,
      "text": "5. Considerations on penultimate hop popping (PHP)",
      "section_title": true,
      "ja": "最後から二番目のホップのポッピング5.検討事項（PHP）"
    },
    {
      "indent": 3,
      "text": "In response to concerns raised during IETF meetings and in related discussions, this section provides an explanation on how MPLS OAM functions defined in ITU-T Recommendation Y.1711 [1] are applied to MPLS networks where PHP is in effect.",
      "ja": "IETF会議中と関連する議論で提起された問題に応じて、このセクションでは、[1] PHPが有効であるMPLSネットワークに適用されているITU-T勧告Y.1711で定義された方法MPLS OAM機能についての説明を提供します。"
    },
    {
      "indent": 0,
      "text": "5.1 Scope of ITU-T Recommendation Y.1711",
      "section_title": true,
      "ja": "ITU-T勧告Y.1711の5.1範囲"
    },
    {
      "indent": 3,
      "text": "The scope of ITU-T Recommendation Y.1711 includes application to both non-PHP and PHP cases as quoted below [1].",
      "ja": "[1]以下に引用としてITU-T勧告Y.1711の範囲は、非PHPとPHPの場合の両方に適用を含みます。"
    },
    {
      "indent": 3,
      "text": "\"1 Scope This Recommendation provides mechanisms for user-plane OAM (Operation and Maintenance) functionality in MPLS networks according to the requirements and principles given in Recommendation Y.1710. OAM functions specified in this Recommendation can be applied to both non-PHP and PHP cases unless otherwise stated. The current version of this recommendation is designed primarily to support point-to-point and multipoint-to-point explicit routed LSPs (ER-LSPs).\"",
      "ja": "「1つのスコープこの勧告は勧告Y.1710の要求事項及び原理に従ってユーザプレーンOAM（操作及びメンテナンス）MPLSネットワークで機能するためのメカニズムを提供する。この勧告に規定OAM機能が非PHPとPHPの両方に適用することができます特に明記しない限りケースが。この勧告の現在のバージョンは、ポイントツーポイントおよびマルチポイント・ツー・ポイントの明示的なルーティングされたLSP（ER-LSPを）サポートするために主に設計されています。」"
    },
    {
      "indent": 0,
      "text": "5.2 Applicability of MPLS OAM to PHP",
      "section_title": true,
      "ja": "PHPへのMPLS OAMの5.2適用性"
    },
    {
      "indent": 3,
      "text": "There are two cases where PHP is used:",
      "ja": "PHPが使用されている2つのケースがあります。"
    },
    {
      "indent": 3,
      "text": "Case 1: The ultimate node is an MPLS LSR, and implements both MPLS control-plane and data-plane, but is not able to perform 2 lookups at line rate. So it asks the penultimate node to pop the top label (rather than swapping it), using the MPLS reserved label 3 (implicit null label) as per defined in RFC 3032 [2].",
      "ja": "ケース1：究極のノードはMPLS LSRであり、MPLSコントロールプレーンとデータプレーンの両方を実装したが、ライン速度で2つのルックアップを実行することができません。それは、RFC 3032で定義された通りにラベル3（暗黙的ヌルラベル）を予約MPLSを使用して、（むしろそれを交換するよりも）トップラベルをポップするために最後から二番目のノードに要求する[2]。"
    },
    {
      "indent": 3,
      "text": "Case 2: The ultimate node has no MPLS label look up and processing capability and does not recognize labeled packets. This node asks for PHP, using the MPLS reserved label 3 (implicit null label) as defined in RFC 3032 [2].",
      "ja": "ケース2：究極のノードがMPLSラベルは調べていないと処理能力とラベル付きパケットを認識しません。このノードは、RFC 3032で定義されたラベル3（暗黙的ヌルラベル）を予約MPLSを使用して、PHPを要求する[2]。"
    },
    {
      "indent": 3,
      "text": "Currently, MPLS OAM functions defined in ITU-T Recommendation Y.1711 [1] can only be applied to Case 1. The next subsection describes the node behavior in Case 1. Application for Case 2 needs further study. Also, application to carrier supporting carrier scenarios is for future study.",
      "ja": "現在、ITU-T勧告Y.1711で定義されたMPLS OAM機能は、[1]のみケース2は、さらなる研究が必要であるため、次のサブセクションでは、ケース1アプリケーション内のノードの動作を説明ケース1に適用することができます。また、キャリア支援キャリア・シナリオへの適用は今後の検討課題です。"
    },
    {
      "indent": 0,
      "text": "5.3 Node behavior when OAM functions are activated",
      "section_title": true,
      "ja": "OAM機能が有効化されている5.3ノードの振る舞い"
    },
    {
      "indent": 3,
      "text": "Where the ultimate LSR is an MPLS LSR and PHP is in effect, the penultimate LSR pops the top label and forwards the OAM packet (with the OAM label and the OAM payload intact) to the ultimate LSR [5].",
      "ja": "究極LSRはMPLS LSRとPHPが有効である場合、最後から二番目のLSRは、トップラベルをポップし、究極のLSRに（無傷OAMラベル及びOAMペイロードを有する）OAMパケットを転送する[5]。"
    },
    {
      "indent": 3,
      "text": "- If the ultimate LSR supports MPLS OAM, it understands that a received packet with an OAM label on top is an OAM packet, since the original top label has been removed by the penultimate LSR. It also knows the ingress LSR that originated the MPLS OAM packet from the TTSI (Trail Termination Source Identifier) value of the received MPLS OAM packet. TTSI is a unique identifier for ingress LSR that is contained in MPLS OAM packets (see ITU-T Recommendation Y.1711 [1]).",
      "ja": " - 究極のLSRは、MPLS OAMをサポートしている場合、それは元トップのラベルは最後から二番目のLSRによって削除されましたので、一番上のOAMラベルと受信したパケットは、OAMパケットであることを理解しています。また、受信MPLS OAMパケットのTTSI（トレイル終端ソース識別子）の値からMPLS OAMパケットを発信しイングレスLSRを知っています。 TTSIは（[1] ITU-T勧告Y.1711を参照）MPLS OAMパケットに含まれている入口LSRの一意の識別子です。"
    },
    {
      "indent": 3,
      "text": "- If the ultimate LSR does not support MPLS OAM, the OAM packet is discarded as per section 3.18 of RFC 3031 [5].",
      "ja": " - 究極のLSRは、MPLS OAMをサポートしていない場合、OAMパケットは、RFC 3031のセクション3.18 [5]に従って廃棄されます。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IANA has reserved the use of the MPLS label value of 14 as the 'OAM Alert Label'. See section 3 for additional information.",
      "ja": "IANAは、「OAMの警告ラベル」など14のMPLSラベル値の使用を予約しています。追加情報については、セクション3を参照してください。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not raise any security issues that are not already present in either the MPLS architecture or in the architecture of the network layer protocol contained within the encapsulation.",
      "ja": "この文書では、MPLSアーキテクチャのいずれかまたはカプセル内に含まれるネットワーク層プロトコルのアーキテクチャでは、既に存在していない任意のセキュリティ上の問題を提起しません。"
    },
    {
      "indent": 3,
      "text": "OAM functions could enhance the security of MPLS networks. For example, Connectivity Verification (CV) function defined in ITU-T Recommendation Y.1711 [1] can detect mis-connections, and therefore can prevent customers' traffic being exposed to other customers.",
      "ja": "OAM機能は、MPLSネットワークのセキュリティを高めることができます。 ITU-T勧告Y.1711で定義され、例えば、接続検証（CV）関数[1]誤接続を検出することができ、したがって、顧客のトラフィックが他の顧客に露出されるのを防ぐことができます。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "The author wishes to thank Shahram Davari with PMC-Sierra, Neil Harrison with British Telecom, Monique Morrow, Thomas D. Nadeau, Hari Rakotoranto and Chip Sharp with Cisco Systems, Khalid Ahmad and David Allan with Nortel Networks, and Mina Azad with Azad-Mohtaj Consulting for their valuable contributions and discussions.",
      "ja": "著者はAzad-とPMC-Sierraの、ブリティッシュテレコムとニールハリソン、モニークモロー、トーマスD.ナドー、ハリRakotorantoとシスコシステムズ、ハリドアフマドとノーテルネットワークスとのデビッド・アランとチップシャープ、そしてミナアザドでShahram Davariに感謝したいです彼らの貴重な貢献と議論のためのMohtajコンサルティング。"
    },
    {
      "indent": 0,
      "text": "9. Normative References",
      "section_title": true,
      "ja": "9.引用規格"
    },
    {
      "indent": 3,
      "text": "[1] ITU-T Recommendation Y.1711, \"OAM mechanism for MPLS networks\", November 2002.",
      "ja": "[1] ITU-T勧告Y.1711、 \"MPLSネットワークのOAMメカニズム\"、2002年11月。"
    },
    {
      "indent": 3,
      "text": "[2] Rosen, E., Tappan, D., Fedorkow, G., Rekhter, Y., Farinaccia, D., Li, T. and A. Conta, \"MPLS label stack encoding\", RFC 3032, January 2001.",
      "ja": "[2]ローゼン、E.、タッパン、D.、Fedorkow、G.、Rekhter、Y.、Farinaccia、D.、李、T.、およびA.コンタ、 \"MPLSラベルスタック符号化\"、RFC 3032、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[3] ITU-T recommendation Y.1710, \"Requirements for OAM functionality for MPLS networks\" July 2001.",
      "ja": "[3] ITU-T勧告Y.1710 2001年7月 \"MPLSネットワークのOAM機能の要件\"。"
    },
    {
      "indent": 3,
      "text": "[4] ITU-T Corrigendum 1 to Recommendation Y.1710, November 2002.",
      "ja": "[4] ITU-T正誤表1を勧告Y.1710に2002年11月。"
    },
    {
      "indent": 3,
      "text": "[5] Rosen, E., Viswanathan, A. and R. Callon, \"Multiprotocol Label Switching Architecture\", RFC 3031, January 2001.",
      "ja": "[5]ローゼン、E.、Viswanathanの、A.とR. Callon、 \"マルチプロトコルラベルスイッチングアーキテクチャ\"、RFC 3031、2001年1月。"
    },
    {
      "indent": 0,
      "text": "10. Informative Reference",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 3,
      "text": "[6] ITU-T Draft Recommendation Y.1720, \"Protection switching for MPLS networks\", under last call as of November 2002.",
      "ja": "[6] ITU-Tの勧告草案Y.1720、2002年11月の時点で最後の呼び出しの下で、「保護は、MPLSネットワークのための切り替え」。"
    },
    {
      "indent": 0,
      "text": "11. Author's Address",
      "section_title": true,
      "ja": "11.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Hiroshi OHTA NTT 3-9-11 Midori-Cho, Musashino-Shi Tokyo 180-8585 Japan",
      "ja": "ひろし おＨた んっｔ ３ー９ー１１ みどりーちょ、 むさしのーし ときょ １８０ー８５８５ じゃぱん"
    },
    {
      "indent": 3,
      "text": "Phone: +81 422 59 3617 Fax: +81 422 59 3787 EMail: ohta.hiroshi@lab.ntt.co.jp",
      "ja": "電話：+81 422 59 3617ファックス：+81 422 59 3787 Eメール：ohta.hiroshi@lab.ntt.co.jp"
    },
    {
      "indent": 0,
      "text": "12. Full Copyright Statement",
      "section_title": true,
      "ja": "12.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2002）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}