{
  "title": {
    "text": "RFC 3099 - Request for Comments Summary RFC Numbers 3000-3099",
    "ja": "RFC 3099 - コメントの概要RFC番号3000から3099の要求"
  },
  "number": 3099,
  "created_at": "2019-10-23 16:27:03.258017+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          S. Ginoza\nRequest for Comments: 3099                                           ISI\nCategory: Informational                                    November 2001",
      "raw": true
    },
    {
      "indent": 22,
      "text": "Request for Comments Summary",
      "raw": true
    },
    {
      "indent": 25,
      "text": "RFC Numbers 3000-3099",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This RFC is a slightly annotated list of the 100 RFCs from RFC 3000 through RFCs 3099. This is a status report on these RFCs. This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このRFCは、これは、これらのRFCのステータスレポートでのRFC 3099.を通じてRFC 3000から100のRFCのわずか注釈付きリストです。このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Note",
      "ja": "注意"
    },
    {
      "indent": 3,
      "text": "Many RFCs, but not all, are Proposed Standards, Draft Standards, or Standards. Since the status of these RFCs may change during the standards processing, we note here only that they are on the standards track. Please see the latest edition of \"Internet Official Protocol Standards\" for the current state and status of these RFCs. In the following, RFCs on the standards track are marked [STANDARDS-TRACK].",
      "ja": "多くのRFCは、すべてではなく、標準、ドラフト規格、または規格を提案しています。これらのRFCの状態が標準処理中に変更されることがありますので、我々は、彼らが標準軌道に乗っていることをここにしか注意してください。これらのRFCの現在の状態と状態のための「インターネット公式プロトコル標準」の最新版を参照してください。以下では、規格上のRFCがマークされているトラック[STANDARDS  -  TRACK]。"
    },
    {
      "indent": 0,
      "text": "RFC     Author          Date            Title\n---     ------          ----            -----",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3099 Ginoza Nov 2001 Request for Comments Summary",
      "ja": "コメント概要について3099宜野座2001年11月のリクエスト"
    },
    {
      "indent": 0,
      "text": "This memo.",
      "ja": "このメモ。"
    },
    {
      "indent": 0,
      "text": "3098 Gavin Apr 2001 How to Advertise Responsibly Using E-Mail and Newsgroups or - how NOT to $$$$$ MAKE ENEMIES FAST! $$$$$",
      "ja": "3098ギャビン4月Eメールやニュースグループを使用するか、責任を宣伝する方法2001  -  FASTの敵をMAKE $$$$$する方法ではありません！ $$$$$"
    },
    {
      "indent": 0,
      "text": "This memo offers useful suggestions for responsible advertising techniques that can be used via the internet in an environment where the advertiser, recipients, and the Internet Community can coexist in a productive and mutually respectful fashion. This memo provides information for the Internet community.",
      "ja": "このメモは、広告主、受信者、およびインターネットコミュニティの生産性と相互尊重の方法で共存できる環境でインターネットを経由して使用することができ責任広告技術のための有益な示唆を提供しています。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3097 Braden Apr 2001 RSVP Cryptographic Authentication -- Updated Message Type Value",
      "ja": "3097ブレーデン2001年4月RSVP暗号化認証 - 更新メッセージタイプの値"
    },
    {
      "indent": 0,
      "text": "This memo resolves a duplication in the assignment of RSVP Message Types, by changing the Message Types assigned by RFC 2747 to Challenge and Integrity Response messages. [STANDARDS TRACK]",
      "ja": "このメモはチャレンジと整合性の応答メッセージにRFC 2747によって割り当てられたメッセージの種類を変更することで、RSVPメッセージタイプの割り当てに重複を解決します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3096 Degermark Jul 2001 Requirements for robust IP/UDP/RTP header compression",
      "ja": "堅牢なIP / UDP / RTPヘッダー圧縮のための3096のDegermark 2001の7月要件"
    },
    {
      "indent": 0,
      "text": "This document contains requirements for robust IP/UDP/RTP (Internet Protocol/User Datagram Protocol/Real-Time Transport Protocol) header compression to be developed by the ROHC (Robust Header Compression) WG. It is based on the ROHC charter, discussions in the WG, the 3GPP document \"3GPP TR 23.922\", version 1.0.0 of October 1999, as well as contributions from 3G.IP. This memo provides information for the Internet community.",
      "ja": "この文書では、ROHC（ロバストヘッダ圧縮）WGによって開発される堅牢なIP / UDP / RTP（インターネット・プロトコル/ユーザ・データグラム・プロトコル/リアルタイムトランスポートプロトコル）ヘッダー圧縮のための要件が​​含まれています。これは、ROHC憲章、WGでの議論、3GPP文書「3GPP TR 23.922」、1999年10月のバージョン1.0.0と同様に、3G.IP.からの貢献に基づいていますこのメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3095 Bormann Jul 2001 RObust Header Compression (ROHC): Framework and four profiles: RTP, UDP, ESP, and uncompressed",
      "ja": "3095ボルマン2001年7月ロバストヘッダ圧縮（ROHC）：フレームワークおよび4つのプロファイル：RTP、UDP、ESP、および圧縮されていません"
    },
    {
      "indent": 0,
      "text": "This document specifies a highly robust and efficient header compression scheme for RTP/UDP/IP (Real-Time Transport Protocol, User Datagram Protocol, Internet Protocol), UDP/IP, and ESP/IP (Encapsulating Security Payload) headers. [STANDARDS TRACK]",
      "ja": "この文書では、RTP / UDP / IPのための非常に堅牢かつ効率的なヘッダ圧縮方式（リアルタイムトランスポートプロトコル、ユーザデータグラムプロトコル、インターネット・プロトコル）、UDP / IP、およびESP / IP（カプセル化セキュリティペイロード）のヘッダーを指定します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3094 Sprague Apr 2001 Tekelec's Transport Adapter Layer Interface",
      "ja": "3094スプラーグ2001年4月Tekelecの交通アダプター層インタフェース"
    },
    {
      "indent": 0,
      "text": "This document proposes the interfaces of a Signaling Gateway, which provides interworking between the Switched Circuit Network (SCN) and an IP network. This memo provides information for the Internet community.",
      "ja": "この文書では、回線交換ネットワーク（SCN）とIPネットワークとの間のインターワーキングを提供するシグナリングゲートウェイのインターフェースを提案しています。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3093 Gaynor 1 Apr 2001 Firewall Enhancement Protocol (FEP)",
      "ja": "3093ゲイナー2001年4月1日ファイアウォール拡張プロトコル（FEP）"
    },
    {
      "indent": 0,
      "text": "Internet Transparency via the end-to-end architecture of the Internet has allowed vast innovation of new technologies and services [1]. However, recent developments in Firewall technology have altered this model and have been shown to inhibit innovation. We propose the Firewall Enhancement Protocol (FEP) to allow innovation, without violating the security model of a Firewall. This memo provides information for the Internet community.",
      "ja": "インターネットのエンド・ツー・エンドのアーキテクチャを介してインターネットの透明性は、[1]新技術やサービスの広大な革新を可能にしました。しかし、ファイアウォール技術における最近の発展は、このモデルを変更したと革新を阻害することが示されています。私たちは、ファイアウォールのセキュリティモデルに違反することなく、技術革新を許可するようにファイアウォールの強化プロトコル（FEP）を提案します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3092 Eastlake 1 Apr 2001 Etymology of \"Foo\"",
      "ja": "「フー」の3092イーストレイク2001年4月1日語源"
    },
    {
      "indent": 0,
      "text": "Approximately 212 RFCs so far, starting with RFC 269, contain the terms `foo', `bar', or `foobar' as metasyntactic variables without any proper explanation or definition. This document rectifies that deficiency. This memo provides information for the Internet community.",
      "ja": "約212 RFCはこれまでのところ、RFC 269で始まる、任意の適切な説明や定義なしでメタ構文変数などの用語 `FOO「`バー」、または `foobarに」が含まれています。この文書では、その不足を整流します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3091 Kennedy 1 Apr 2001 Pi Digit Generation Protocol",
      "ja": "3091ケネディ2001年4月1日のPi桁世代プロトコル"
    },
    {
      "indent": 0,
      "text": "This memo defines a protocol to provide the Pi digit generation service (PIgen) used between clients and servers on host computers. This memo provides information for the Internet community.",
      "ja": "このメモは、ホストコンピュータ上でクライアントとサーバの間で使用されるパイ桁の世代サービス（のPIgen）を提供するプロトコルを定義します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3090 Lewis Mar 2001 DNS Security Extension Clarification on Zone Status",
      "ja": "ゾーンのステータスの3090ルイス2001年3月DNSセキュリティ拡張の明確化"
    },
    {
      "indent": 0,
      "text": "The definition of a secured zone is presented, clarifying and updating sections of RFC 2535. RFC 2535 defines a zone to be secured based on a per algorithm basis, e.g., a zone can be secured with RSA keys, and not secured with DSA keys. This document changes this to define a zone to be secured or not secured regardless of the key algorithm used (or not used). To further simplify the determination of a zone's status, \"experimentally secure\" status is deprecated. [STANDARDS TRACK]",
      "ja": "セキュアゾーンの定義は、RFC 2535は、例えば、ゾーンはRSAキーで固定され、DSAキーで固定されていないことができ、アルゴリズムごとに基づいて固定されるようにゾーンを定義明確化及びRFC 2535のセクションを更新し、提示されています。この文書では、固定またはかかわらず、キー使用されるアルゴリズム（または使用されていない）の固定されないようにゾーンを定義するために、これを変更します。さらに、ゾーンのステータスの決意を簡素化するために、「実験的に安全な」ステータスが廃止されました。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3089 Kitamura Apr 2001 A SOCKS-based IPv6/IPv4 Gateway Mechanism",
      "ja": "3089北村2001年4月A SOCKSベースのIPv6 / IPv4のゲートウェイメカニズム"
    },
    {
      "indent": 0,
      "text": "This document describes a SOCKS-based IPv6/IPv4 gateway mechanism that enables smooth heterogeneous communications between the IPv6 nodes and IPv4 nodes. This memo provides information for the Internet community.",
      "ja": "この文書は、IPv6ノードとIPv4ノード間の円滑な異質の通信を可能にするSOCKSベースのIPv6 / IPv4のゲートウェイ機構が記載されています。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3088 Zeilenga Apr 2001 OpenLDAP Root Service An experimental LDAP referral service",
      "ja": "3088 Zeilenga 2001年4月OpenLDAPのルートサービスの実験的LDAPの紹介サービス"
    },
    {
      "indent": 0,
      "text": "The OpenLDAP Project is operating an experimental LDAP (Lightweight Directory Access Protocol) referral service known as the \"OpenLDAP Root Service\". The automated system generates referrals based upon service location information published in DNS SRV RRs (Domain Name System location of services resource records). This document describes this service. This memo defines an Experimental Protocol for the Internet community.",
      "ja": "OpenLDAPプロジェクトは、「OpenLDAPのルートサービス」として知られている実験的なLDAP（Lightweight Directory Access Protocol）にある紹介サービスを操作しています。自動化されたシステムは、DNS SRV RRの（サービスリソースレコードのドメインネームシステムの場所）に掲載されたサービスの位置情報に基づいて紹介を生成します。この文書では、このサービスを記述します。このメモはインターネットコミュニティのためにExperimentalプロトコルを定義します。"
    },
    {
      "indent": 0,
      "text": "3087 Campbell Apr 2001 Control of Service Context using SIP Request-URI",
      "ja": "SIPリクエスト-URIを使用したサービス・コンテキストの3087キャンベル2001年4月のコントロール"
    },
    {
      "indent": 0,
      "text": "This memo describes a useful way to conceptualize the use of the standard SIP (Session Initiation Protocol) Request-URI (Uniform Resource Identifier) that the authors and many members of the SIP community think is suitable as a convention. It does not define any new protocol with respect to RFC 2543. This memo provides information for the Internet community.",
      "ja": "このメモは、著者およびSIPコミュニティの多くのメンバーが慣例として適していると思うことを、標準SIP（セッション開始プロトコル）のRequest-URI（統一資源識別子）の使用を概念化する便利な方法を説明します。これは、このメモは、インターネットコミュニティのための情報を提供してRFC 2543に関連して任意の新しいプロトコルを定義していません。"
    },
    {
      "indent": 0,
      "text": "3086 Nichols Apr 2001 Definition of Differentiated Services Per Domain Behaviors and Rules for their Specification",
      "ja": "3086ニコルズ4月差別化サービスドメイン単位の行動とルールの定義2001彼らの仕様について"
    },
    {
      "indent": 0,
      "text": "This document defines and discusses Per-Domain Behaviors in detail and lays out the format and required content for contributions to the Diffserv WG on PDBs and the procedure that will be applied for individual PDB specifications to advance as WG products. This format is specified to expedite working group review of PDB submissions. This memo provides information for the Internet community.",
      "ja": "この文書では、定義と説明しドメイン単位の行動を詳細にし、フォーマットとのPDBとWG製品として進めるために、個々のPDB仕様に適用される手続き上のDiffserv WGへの貢献のために必要なコンテンツをレイアウトします。この形式は、PDB提出のワーキンググループの審査を迅速化するために指定されています。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3085 Coates Mar 2001 URN Namespace for NewsML Resources",
      "ja": "3085コーツ2001年3月NewsMLのリソースのURN名前空間"
    },
    {
      "indent": 0,
      "text": "This document describes a URN (Uniform Resource Name) namespace for identifying NewsML NewsItems. This memo provides information for the Internet community.",
      "ja": "この文書では、NewsMLののNewsItemを識別するためのURN（ユニフォームリソース名）の名前空間について説明します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3084 Chan Mar 2001 COPS Usage for Policy Provisioning (COPS-PR)",
      "ja": "ポリシープロビジョニング（COPS-PR）のための3084チャン2001年3月COPS使い方"
    },
    {
      "indent": 0,
      "text": "This document describes the use of the Common Open Policy Service (COPS) protocol for support of policy provisioning (COPS-PR). [STANDARDS TRACK]",
      "ja": "この文書では、ポリシープロビジョニング（COPS-PR）をサポートするための一般的なオープンポリシーサービス（COPS）プロトコルの使用を記載しています。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3083 Woundy Mar 2001 Baseline Privacy Interface Management Information Base for DOCSIS Compliant Cable Modems and Cable Modem Termination Systems",
      "ja": "DOCSIS準拠のケーブルモデムやケーブルモデム終端システムのための3083 Woundy 2001年3月ベースラインプライバシーインターフェイスの管理情報ベース"
    },
    {
      "indent": 0,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it defines a basic set of managed objects for SNMP-based (Simple Network Management Protocol) management of the Baseline Privacy Interface (BPI), which provides data privacy for DOCSIS 1.0 (Data-Over-Cable Service Interface Specifications) compliant Cable Modems and Cable Modem Termination Systems. This MIB is defined as an extension to the DOCSIS Radio Frequency Interface MIB, RFC 2670. This memo provides information for the Internet community.",
      "ja": "このメモは、インターネットコミュニティでのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、それは、DOCSIS 1.0のためのデータのプライバシーを提供してベースラインプライバシーインターフェイス（BPI）、のSNMPベース（簡易ネットワーク管理プロトコル）管理（データオーバーケーブルサービスインターフェイス仕様）準拠のケーブルのための管理対象オブジェクトの基本セットを定義しますモデムやケーブルモデム終端システム。このMIBは、このメモはインターネットコミュニティのための情報を提供するDOCSIS無線周波数インターフェースMIB、RFC 2670の拡張として定義されます。"
    },
    {
      "indent": 0,
      "text": "3082 Kempf Mar 2001 Notification and Subscription for SLP",
      "ja": "SLPのための3082ケンプ2001年3月の通知およびサブスクリプション"
    },
    {
      "indent": 0,
      "text": "The Service Location Protocol (SLP) provides mechanisms whereby service agent clients can advertise and user agent clients can query for services. The design is very much demand-driven, so that user agents only obtain service information when they specifically ask for it. There exists another class of user agent applications, however, that requires notification when a new service appears or disappears. In the RFC 2608 design, these applications are forced to poll the network to catch changes. In this document, we describe a protocol for allowing such clients to be notified when a change occurs, removing the need for polling. This memo defines an Experimental Protocol for the Internet community.",
      "ja": "サービスロケーションプロトコル（SLP）サービス・エージェント・クライアントが広告を掲載することができ、ユーザー・エージェント・クライアントがサービスを照会できる仕組みを提供します。彼らは特にそれを求める際に、ユーザーエージェントは唯一のサービス情報を取得するように設計は、非常に多くの需要主導型です。新しいサービスが現れたり消えたときに通知を必要とする、しかし、ユーザエージェントアプリケーションの別のクラスが存在します。 RFC 2608の設計では、これらのアプリケーションは、変更をキャッチするためにネットワークをポーリングすることを余儀なくされています。この文書では、我々は、変更が発生したときに、そのようなクライアントに通知することができるように、ポーリングの必要性を除去するためのプロトコルを記述します。このメモはインターネットコミュニティのためにExperimentalプロトコルを定義します。"
    },
    {
      "indent": 0,
      "text": "3081 Rose Mar 2001 Mapping the BEEP Core onto TCP",
      "ja": "TCP上にBEEPコアのマッピング3081ローズ2001年3月"
    },
    {
      "indent": 0,
      "text": "This memo describes how a BEEP (Blocks Extensible Exchange Protocol) session is mapped onto a single TCP (Transmission Control Protocol) connection. [STANDARDS TRACK]",
      "ja": "このメモは、BEEP（ブロック拡張可能交換プロトコル）セッションは、単一のTCP（Transmission Control Protocol）接続上にマッピングされる方法を説明します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3080 Rose Mar 2001 The Blocks Extensible Exchange Protocol Core",
      "ja": "3080ローズ2001年3月ブロック拡張可能交換プロトコルコア"
    },
    {
      "indent": 0,
      "text": "This memo describes a generic application protocol kernel for connection-oriented, asynchronous interactions called the BEEP (Blocks Extensible Exchange Protocol) core. [STANDARDS TRACK]",
      "ja": "このメモは、接続指向のための一般的なアプリケーションプロトコルカーネルを説明し、非同期の相互作用は、BEEP（ブロック拡張可能交換プロトコル）コアと呼ばれます。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3079 Zorn Mar 2001 Deriving Keys for use with Microsoft Point-to-Point Encryption (MPPE)",
      "ja": "Microsoft Point-to-Point暗号化（MPPE）で使用するために3079のソーン2001年3月導出キー"
    },
    {
      "indent": 0,
      "text": "This document describes the method used to derive initial MPPE session keys from a variety of credential types. It is expected that this memo will be updated whenever Microsoft defines a new key derivation method for MPPE, since its primary purpose is to provide an open, easily accessible reference for third-parties wishing to interoperate with Microsoft products. This memo provides information for the Internet community.",
      "ja": "この文書では、クレデンシャルタイプの様々な初期MPPEセッションキーを導出するために使用する方法について説明します。 MicrosoftがMPPEのための新しいキー導出方法を定義したときに、その主な目的は、マイクロソフト製品との相互運用を希望するサードパーティのオープン、容易にアクセス参照を提供するものであるため、このメモは、更新されることが期待されます。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3078 Pall Mar 2001 Microsoft Point-To-Point Encryption (MPPE) Protocol",
      "ja": "3078ポール2001年3月マイクロソフトポイントツーポイント暗号化（MPPE）プロトコル"
    },
    {
      "indent": 0,
      "text": "This document describes the use of the Microsoft Point to Point Encryption (MPPE) to enhance the confidentiality of PPP-encapsulated packets. This memo provides information for the Internet community.",
      "ja": "このドキュメントは、PPPカプセル化パケットの機密性を高めるために、暗号化（MPPE）をポイントするマイクロソフトポイントの使用を記載しています。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3077 Duros Mar 2001 A Link-Layer Tunneling Mechanism for Unidirectional Links",
      "ja": "単方向リンクのための3077 DUROS 2001年3月Aリンク層トンネル機構"
    },
    {
      "indent": 0,
      "text": "This document describes a mechanism to emulate full bidirectional connectivity between all nodes that are directly connected by a unidirectional link. [STANDARDS TRACK]",
      "ja": "この文書では、直接、単方向リンクで接続されているすべてのノード間で完全な双方向接続をエミュレートするためのメカニズムを説明しています。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3076 Boyer Mar 2001 Canonical XML Version 1.0",
      "ja": "3076ボイヤー2001年3月CanonicalのXMLバージョン1.0"
    },
    {
      "indent": 0,
      "text": "This specification describes a method for generating a physical representation, the canonical form, of an XML document that accounts for the permissible changes. This memo provides information for the Internet community.",
      "ja": "この仕様は、物理的表現、許容変更を占めるXML文書の正則形式を生成するための方法を記載しています。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3075 Eastlake Mar 2001 XML-Signature Syntax and Processing",
      "ja": "3075イーストレイク2001年3月XML-署名構文と処理"
    },
    {
      "indent": 0,
      "text": "This document specifies XML (Extensible Markup Language) digital signature processing rules and syntax. [STANDARDS TRACK]",
      "ja": "この文書は、XML（Extensible Markup Language）のデジタル署名処理ルールと構文を指定します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3074 Volz Feb 2001 DHC Load Balancing Algorithm",
      "ja": "3074フォルツ2001年2月DHCロードバランシングアルゴリズム"
    },
    {
      "indent": 0,
      "text": "This document proposes a method of algorithmic load balancing. [STANDARDS TRACK]",
      "ja": "この文書では、アルゴリズムの負荷分散の方法を提案しています。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3073 Collins Mar 2001 Portable Font Resource (PFR) - application/font-tdpfr MIME Sub-type Registration",
      "ja": "3073コリンズ2001年3月ポータブルフォントリソース（PFR） - アプリケーション/フォントtdpfr MIMEサブタイプ登録"
    },
    {
      "indent": 0,
      "text": "This document describes the registration of the Multipurpose Internet Mail Extensions (MIME) sub-type application/font-tdpfr. The encoding is defined by the PFR Specification. This memo provides information for the Internet community.",
      "ja": "この文書は、MIME（Multipurpose Internet Mail Extensions）のサブタイプapplication /フォントtdpfrの登録について説明します。エンコーディングはPFR仕様によって定義されます。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3072 Wildgrube Mar 2001 Structured Data Exchange Format (SDXF)",
      "ja": "3072 Wildgrube 2001年3月構造化データ交換フォーマット（SDXF）"
    },
    {
      "indent": 0,
      "text": "This specification describes an all-purpose interchange format for use as a file format or for net-working. This memo provides information for the Internet community.",
      "ja": "この仕様は、ファイル形式としてまたはネット・ワーキングのための使用のための万能交換フォーマットを説明しています。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3071 Klensin Feb 2001 Reflections on the DNS, RFC 1591, and Categories of Domains",
      "ja": "3071 Klensin 2001の2月DNS上の反射、RFC 1591、およびドメインのカテゴリー"
    },
    {
      "indent": 0,
      "text": "This document is being published primarily for historical context and comparative purposes, essentially to document some thoughts about how 1591 might have been interpreted and adjusted by the Internet Assigned Numbers Authority (IANA) and ICANN to better reflect today's world while retaining characteristics and policies that have proven to be effective in supporting Internet growth and stability. This memo provides information for the Internet community.",
      "ja": "このドキュメントは、持っている特性や政策を維持しながら、より良い今日の世界を反映して1591年にはIANA（Internet Assigned Numbers Authority）におよびICANNによって解釈され、調整されている可能性があります方法についていくつかの考えを文書化するために、本質的に、主に歴史的な文脈と比較目的のために公開されていますインターネットの成長と安定を支援するのに有効であることが証明。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3070 Rawat Feb 2001 Layer Two Tunneling Protocol (L2TP) over Frame Relay",
      "ja": "3070 Rawat 2001年2月レイヤ2トンネリングプロトコル（L2TP）フレームリレー上"
    },
    {
      "indent": 0,
      "text": "This document describes how L2TP is implemented over Frame Relay Permanent Virtual Circuits (PVCs) and Switched Virtual Circuits (SVCs). [STANDARDS TRACK]",
      "ja": "この文書では、L2TPは、フレームリレーPVCと相手先選択接続（SVC）の上に実装されている方法を説明します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3069 McPherson Feb 2001 VLAN Aggregation for Efficient IP Address Allocation",
      "ja": "効率的なIPアドレスの割り当てのための3069マクファーソン2001年2月VLAN集約"
    },
    {
      "indent": 0,
      "text": "This document introduces the concept of Virtual Local Area Network (VLAN) aggregation as it relates to IPv4 address allocation. This memo provides information for the Internet community.",
      "ja": "それはIPv4アドレスの割り当てに関連するこの文書では、仮想ローカルエリアネットワーク（VLAN）凝集の概念を導入しています。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3068 Huitema Jun 2001 An Anycast Prefix for 6to4 Relay Routers",
      "ja": "6to4のリレールーターの3068のHuitema 2001年6月アンのAnycast接頭語"
    },
    {
      "indent": 0,
      "text": "This memo introduces a \"6to4 anycast address\" in order to simplify the configuration of 6to4 routers. It also defines how this address will be used by 6to4 relay routers, how the corresponding \"6to4 anycast prefix\" will be advertised in the IGP and in the EGP. The memo documents the reservation by IANA (Internet Assigned Numbers Authority) of the \"6to4 relay anycast prefix.\" [STANDARDS TRACK]",
      "ja": "このメモは、6to4ルーターの設定を簡単にするために、「6to4のエニーキャストアドレス」を紹介します。また、このアドレスは、6to4リレールータによって使用される方法を定義する方法に対応する「6to4のエニキャストプレフィックス」IGPにし、EGPにアドバタイズされます。メモはのIANA（Internet Assigned Numbers Authority）によって予約を文書「の6to4リレーエニキャストプレフィックス。」 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3067 Arvidsson Feb 2001 TERENA's Incident Object Description and Exchange Format Requirements",
      "ja": "3067のArvidsson 2001年2月TERENAのインシデントオブジェクト説明し、Exchange形式の要件"
    },
    {
      "indent": 0,
      "text": "The purpose of the Incident Object Description and Exchange Format is to define a common data format for the description, archiving and exchange of information about incidents between CSIRTs (Computer Security Incident Response Teams) (including alert, incident in investigation, archiving, statistics, reporting, etc.). This document describes the high-level requirements for such a description and exchange format, including the reasons for those requirements. This memo provides information for the Internet community.",
      "ja": "インシデントオブジェクト説明と交換フォーマットの目的は、説明、アーカイブおよび調査、アーカイブ、統計でアラート、事件を含むのCSIRT（コンピュータセキュリティインシデント対応チーム）（間の事件についての情報を交換するための共通のデータ形式を定義することである、レポーティング、など）。この文書は、それらの要件の理由を含む、このような説明および交換フォーマットのための高レベルの要件を記載しています。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3066 Alvestrand Jan 2001 Tags for the Identification of Languages",
      "ja": "言語識別のための3066個のAlvestrand 2001年1月タグ"
    },
    {
      "indent": 0,
      "text": "This document describes a language tag for use in cases where it is desired to indicate the language used in an information object, how to register values for use in this language tag, and a construct for matching such language tags. This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements.",
      "ja": "この文書は、この言語タグ、及びそのような言語タグに一致するための構築物に使用するための値を登録する方法、情報オブジェクトで使用される言語を示すことが望まれる場合に使用する言語タグを記載しています。このドキュメントはインターネットコミュニティのためのインターネットBest Current Practicesを指定し、改善のための議論と提案を要求します。"
    },
    {
      "indent": 0,
      "text": "3065 Traina Feb 2001 Autonomous System Confederations for BGP",
      "ja": "BGPのための3065のTrainaの2001年2月自律システムコンフェデレーションズ"
    },
    {
      "indent": 0,
      "text": "This document describes an extension to BGP which may be used to create a confederation of autonomous systems that is represented as a single autonomous system to BGP peers external to the confederation, thereby removing the \"full mesh\" requirement. The intention of this extension is to aid in policy administration and reduce the management complexity of maintaining a large autonomous system. [STANDARDS TRACK]",
      "ja": "この文書は、BGPに単一の自律システムは、それによって「フルメッシュ」要件を除去し、連合の外部ピアとして表されている自律システムの連合を作成するために使用されてもよいBGPの拡張を記述しています。この拡張機能の意図は、ポリシー管理を支援し、大規模な自律システムを維持するための管理の複雑さを軽減することです。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3064 Foster Feb 2001 MGCP CAS Packages",
      "ja": "3064のフォスター2001年2月MGCP CASパッケージ"
    },
    {
      "indent": 0,
      "text": "This document contains a collection of media gateway Channel Associated Signaling (CAS) packages for R1 CAS, North American CAS, CAS PBX interconnect as well as basic FXO support. This memo provides information for the Internet community.",
      "ja": "この文書では、R1 CAS、北米CAS、CAS PBX相互接続のためのメディアゲートウェイチャネル連携信号（CAS）のパッケージだけでなく、基本的なFXOのサポートのコレクションが含まれています。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3063 Ohba Feb 2001 MPLS Loop Prevention Mechanism",
      "ja": "3063大場2001年2月MPLSループ防止メカニズム"
    },
    {
      "indent": 0,
      "text": "This paper presents a simple mechanism, based on \"threads\", which can be used to prevent Multiprotocol Label Switching (MPLS) from setting up label switched path (LSPs) which have loops. This memo defines an Experimental Protocol for the Internet community.",
      "ja": "本論文では、ラベルはループを有するパス（LSPを）切り替え設定から（MPLS）をマルチプロトコルラベルスイッチングを防止するために使用することができる「スレッド」に基づく単純なメカニズムを、提供します。このメモはインターネットコミュニティのためにExperimentalプロトコルを定義します。"
    },
    {
      "indent": 0,
      "text": "3062 Zeilenga Feb 2001 LDAP Password Modify Extended Operation",
      "ja": "3062 Zeilenga 2001年2月LDAPパスワード変更拡張操作を"
    },
    {
      "indent": 0,
      "text": "This document describes an LDAP extended operation to allow modification of user passwords which is not dependent upon the form of the authentication identity nor the password storage mechanism used. [STANDARDS TRACK]",
      "ja": "この文書は、認証アイデンティティでも使用されるパスワード記憶機構の形式に依存しないユーザパスワードの変更を許可するようにLDAP拡張操作を説明します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3061 Mealling Feb 2001 A URN Namespace of Object Identifiers",
      "ja": "3061 Mealling 2001年2月オブジェクト識別子のURN名前空間"
    },
    {
      "indent": 0,
      "text": "This document describes a Uniform Resource Name (URN) namespace that contains Object Identifiers (OIDs). This memo provides information for the Internet community.",
      "ja": "この文書では、オブジェクト識別子（OID）が含まれて統一リソース名（URN）名前空間について説明します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3060 Moore Feb 2001 Policy Core Information Model -- Version 1 Specification",
      "ja": "3060ムーア2001年2月方針コア情報モデル - バージョン1つの仕"
    },
    {
      "indent": 0,
      "text": "This document presents the object-oriented information model for representing policy information developed jointly in the IETF Policy Framework WG and as extensions to the Common Information Model (CIM) activity in the Distributed Management Task Force (DMTF). [STANDARDS TRACK]",
      "ja": "この文書は、IETFポリシーフレームワークWGにし、分散管理タスクフォース（DMTF）で共通情報モデル（CIM）の活動への拡張として共同開発したポリシー情報を表現するためのオブジェクト指向の情報モデルを提示します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3059 Guttman Feb 2001 Attribute List Extension for the Service Location Protocol",
      "ja": "サービス・ロケーション・プロトコルのための3059グットマン2001年2月属性リストの拡張"
    },
    {
      "indent": 0,
      "text": "This document specifies a SLPv2 extension which allows a User Agent (UA) to request a service's attributes be included as an extension to Service Reply messages. This will eliminate the need for multiple round trip messages for a UA to acquire all service information. [STANDARDS TRACK]",
      "ja": "この文書では、ユーザーエージェント（UA）はサービスへの拡張は、メッセージを返信として含まれるサービスの属性を要求することを可能にするSLPv2の拡張子を指定します。 UAは、すべてのサービス情報を取得するためにこれは、複数の往復メッセージの必要性を排除します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3058 Teiwes Feb 2001 Use of the IDEA Encryption Algorithm in CMS",
      "ja": "CMSでのIDEA暗号化アルゴリズムの3058 Teiwes 2001年2月の使用"
    },
    {
      "indent": 0,
      "text": "This memo specifies how to incorporate International Data Encryption Algorithm (IDEA) into CMS or S/MIME as an additional strong algorithm for symmetric encryption. This memo provides information for the Internet community.",
      "ja": "このメモは、対称暗号化のための追加の強力なアルゴリズムとしてCMSまたはS / MIMEに国際データ暗号化アルゴリズム（IDEA）を組み込む方法を指定します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3057 Morneault Feb 2001 ISDN Q.921-User Adaptation Layer",
      "ja": "3057 Morneault 2001年2月ISDN Q.921-ユーザーアダプテーションレイヤ"
    },
    {
      "indent": 0,
      "text": "This document defines a protocol for backhauling of ISDN Q.921 User messages over IP using the Stream Control Transmission Protocol (SCTP). This protocol would be used between a Signaling Gateway (SG) and Media Gateway Controller (MGC). [STANDARDS TRACK]",
      "ja": "この文書では、ストリーム制御伝送プロトコル（SCTP）を使用して、IP上ISDN Q.921ユーザメッセージのバックホーリングのためのプロトコルを定義します。このプロトコルはシグナリングゲートウェイ（SG）とメディアゲートウェイコントローラ（MGC）との間で使用されるであろう。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3056 Carpenter Feb 2001 Connection of IPv6 Domains via IPv4 Clouds",
      "ja": "IPv4の雲を介したIPv6のドメインの3056カーペンター2001年2月接続"
    },
    {
      "indent": 0,
      "text": "This memo specifies an optional interim mechanism for IPv6 sites to communicate with each other over the IPv4 network without explicit tunnel setup, and for them to communicate with native IPv6 domains via relay routers. [STANDARDS TRACK]",
      "ja": "このメモは、IPv6サイトは、明示的なトンネルをセットアップすることなく、IPv4ネットワークを介して互いに通信するための任意の中間メカニズムを特定し、それらのために中継ルータを介してネイティブIPv6ドメインと通信します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3055 Krishnaswamy Feb 2001 Management Information Base for the PINT Services Architecture",
      "ja": "PINTサービスアーキテクチャのための3055 Krishnaswamy 2001年2月の管理情報ベース"
    },
    {
      "indent": 0,
      "text": "This memo describes a proposed Management Information Base (MIB) for the PSTN/Internet Interworking (PINT) Services Architecture. [STANDARDS TRACK]",
      "ja": "このメモは、PSTN /インターネットインターワーキング（PINT）サービスアーキテクチャのために提案されている管理情報ベース（MIB）について説明します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3054 Blatherwick Jan 2001 Megaco IP Phone Media Gateway Application Profile",
      "ja": "3054 Blatherwick 2001年1月のMegaco IP電話メディアゲートウェイアプリケーションプロファイル"
    },
    {
      "indent": 0,
      "text": "This document specifies a particular application of the Megaco/H.248 Protocol for control of Internet telephones and similar appliances: the Megaco IP Phone Media Gateway. This memo provides information for the Internet community.",
      "ja": "Megaco IP電話メディアゲートウェイ：この文書は、インターネット電話と同様の機器の制御のためのMegaco / H.248プロトコルの特定のアプリケーションを指定します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3053 Durand Jan 2001 IPv6 Tunnel Broker",
      "ja": "3053デュラン2001年1月のIPv6トンネルブローカー"
    },
    {
      "indent": 0,
      "text": "The motivation for the development of the tunnel broker model is to help early IPv6 adopters to hook up to an existing IPv6 network (e.g., the 6bone) and to get stable, permanent IPv6 addresses and DNS names. The concept of the tunnel broker was first presented at Orlando's IETF in December 1998. Two implementations were demonstrated during the Grenoble IPng & NGtrans interim meeting in February 1999. This memo provides information for the Internet community.",
      "ja": "トンネルブローカーモデルの開発のための動機は、初期のIPv6は、既存のIPv6ネットワーク（例えば、6boneの）にフックアップし、安定した、永久的なIPv6アドレスとDNS名を取得するために採用支援することです。トンネルブローカーの概念は、最初の2つの実装は、このメモはインターネットコミュニティのための情報を提供して1999年2月グルノーブルのIPng＆NGTRANS暫定会議中に示された1998年12月にオーランドのIETFで発表されました。"
    },
    {
      "indent": 0,
      "text": "3052 Eder Jan 2001 Service Management Architectures Issues and Review",
      "ja": "3052のエダー2001年1月サービス管理アーキテクチャの問題とレビュー"
    },
    {
      "indent": 0,
      "text": "The purpose of this document is to explore the problems of defining a Service management framework and to examine some of the issues that still need to be resolved. This memo provides information for the Internet community.",
      "ja": "このドキュメントの目的は、サービス管理フレームワークを定義する問題を調査するために、まだ解決すべき問題のいくつかを検討することです。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3051 Heath Jan 2001 IP Payload Compression Using ITU-T V.44 Packet Method",
      "ja": "ITU-T V.44パケット方式を使用した3051ヒース2001年1月IPペイロード圧縮"
    },
    {
      "indent": 0,
      "text": "This document describes a compression method based on the data compression algorithm described in International Telecommunication Union (ITU-T) Recommendation V.44. This document defines the application of V.44 Packet Method to the Internet Protocol (IP) Payload Compression Protocol (RFC 2393). This memo provides information for the Internet community.",
      "ja": "この文書では、国際電気通信連合（ITU-T）勧告V.44に記載されたデータ圧縮アルゴリズムに基づいて圧縮方法を説明します。この文書は、インターネットプロトコル（IP）ペイロード圧縮プロトコル（RFC 2393）にV.44パケット方式のアプリケーションを定義します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3050 Lennox Jan 2001 Common Gateway Interface for SIP",
      "ja": "SIPのための3050レノックス2001年1月のCommon Gateway Interface"
    },
    {
      "indent": 0,
      "text": "This document defines a SIP CGI interface for providing SIP services on a SIP server. This memo provides information for the Internet community.",
      "ja": "この文書では、SIPサーバにSIPサービスを提供するためのSIPのCGIインターフェイスを定義します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3049 Naugle Jan 2001 TN3270E Service Location and Session Balancing",
      "ja": "3049 Naugle 2001年1月TN3270Eサービスロケーションとセッションバランシング"
    },
    {
      "indent": 0,
      "text": "This document discusses the implementation of Service Location Protocol (SLP) and session balancing with a TN3270E emulator in a client server implementation with a TN3270E server. [STANDARDS TRACK]",
      "ja": "この文書では、TN3270Eサーバーとクライアントサーバー実装でのTN3270Eエミュレータとのバランスサービスロケーションプロトコル（SLP）とセッションの実装について説明します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3048 Whetten Jan 2001 Reliable Multicast Transport Building Blocks for One-to-Many Bulk-Data Transfer",
      "ja": "3048一対多バルク・データ転送用Whetten 2001年1月の信頼できるマルチキャストトランスポート・ビルディング・ブロック"
    },
    {
      "indent": 0,
      "text": "This document describes a framework for the standardization of bulk-data reliable multicast transport. This memo provides information for the Internet community.",
      "ja": "この文書では、バルク・データ信頼性の高いマルチキャストトランスポートの標準化のためのフレームワークについて説明します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3047 Luthi Jan 2001 RTP Payload Format for ITU-T Recommendation G.722.1",
      "ja": "ITU-T勧告G.722.1のための3047ルティ2001年1月RTPペイロードフォーマット"
    },
    {
      "indent": 0,
      "text": "This document describes the payload format for including G.722.1 generated bit streams within an RTP packet. Also included here are the necessary details for the use of G.722.1 with MIME and SDP. [STANDARDS TRACK]",
      "ja": "この文書では、RTPパケット内G.722.1生成されたビットストリームを含めるためのペイロード・フォーマットを記述する。また、MIMEとSDPとのG.722.1の使用のために必要な詳細は、ここに包含されます。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3046 Patrick Jan 2001 DHCP Relay Agent Information Option",
      "ja": "3046パトリック・2001年1月DHCPリレーエージェント情報オプション"
    },
    {
      "indent": 0,
      "text": "Newer high-speed public Internet access technologies call for a high-speed modem to have a local area network (LAN) attachment to one or more customer premise hosts. It is advantageous to use the Dynamic Host Configuration Protocol (DHCP) as defined in RFC 2131 to assign customer premise host IP addresses in this environment. However, a number of security and scaling problems arise with such \"public\" DHCP use. This document describes a new DHCP option to address these issues. This option extends the set of DHCP options as defined in RFC 2132. [STANDARDS TRACK]",
      "ja": "新しい高速公共のインターネットアクセス技術は、一つ以上の顧客宅内ホストにローカル・エリア・ネットワーク（LAN）添付ファイルを持つように高速モデムを求めます。この環境で顧客宅内ホストのIPアドレスを割り当てるために、RFC 2131で定義されたように、動的ホスト構成プロトコル（DHCP）を使用することが有利です。しかし、セキュリティおよびスケーリングの問題の数は、このような「公共」のDHCPを使用して発生します。この文書では、これらの問題に対処するための新たなDHCPオプションを説明します。 RFC 2132で定義されているこのオプションは、DHCPオプションのセットを拡張[STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3045 Meredith Jan 2001 Storing Vendor Information in the LDAP root DSE",
      "ja": "LDAPルートDSEで3045メレディス2001年1月の保存ベンダ情報"
    },
    {
      "indent": 0,
      "text": "This document specifies two Lightweight Directory Access Protocol (LDAP) attributes, vendorName and vendorVersion that MAY be included in the root DSA-specific Entry (DSE) to advertise vendor-specific information. This memo provides information for the Internet community.",
      "ja": "この文書では、ベンダー固有の情報をアドバタイズするルートDSA固有のエントリ（DSE）に含まれるかもしれ2のLDAP（Lightweight Directory Access Protocol）属性、vendorNameとvendorVersionを指定します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3044 Rozenfeld Jan 2001 Using The ISSN (International Serial Standard Number) as URN (Uniform Resource Names) within an ISSN-URN Namespace",
      "ja": "ISSN-URN名前空間内のURNとしてISSN（国際標準シリアルナンバー）（ユニフォームリソース名）を使用してRozenfeld 2001年1月3044"
    },
    {
      "indent": 0,
      "text": "This document presents how the ISSN - International Standard Serial Number - which is a persistent number for unique identification of serials widely recognised and used in the bibliographic world, can be supported within the Uniform Resource Name (URN) framework as a specific URN namespace identifier. This memo provides information for the Internet community.",
      "ja": "国際標準逐次刊行物番号 -   - 広く認識され、書誌世界で使用される雑誌を一意に識別するための永続的な番号をである、特定のURN名前空間識別子としてURN（Uniform Resource Name）の枠組みの中でサポートすることができます。この文書では、ISSNがどのように提示しています。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3043 Mealling Jan 2001 The Network Solutions Personal Internet Name (PIN): A URN Namespace for People and Organizations",
      "ja": "3043 Mealling 2001年1月ネットワークソリューションパーソナルインターネット名（PIN）：人と組織のためのURN名前空間"
    },
    {
      "indent": 0,
      "text": "This document describes a Uniform Resource Name (URN) namespace that is engineered by Network Solutions, Inc. for naming people and organizations. This memo provides information for the Internet community.",
      "ja": "この文書では、人と組織の命名ネットワークソリューション株式会社によって設計された統一リソース名（URN）名前空間について説明します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3042 Allman Jan 2001 Enhancing TCP's Loss Recovery Using Limited Transmit",
      "ja": "株式会社トランスミットを使用して3042オールマン2001年1月の強化TCPの損失回復"
    },
    {
      "indent": 0,
      "text": "This document proposes a new Transmission Control Protocol (TCP) mechanism that can be used to more effectively recover lost segments when a connection's congestion window is small, or when a large number of segments are lost in a single transmission window. [STANDARDS TRACK]",
      "ja": "この文書では、接続の輻輳ウィンドウが小さい場合、または多数のセグメントが単一の送信ウィンドウで失われたときに、より効果的に失われたセグメントを回復するために使用することができ、新たな伝送制御プロトコル（TCP）のメカニズムを提案しています。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3041 Narten Jan 2001 Privacy Extensions for Stateless Address Autoconfiguration in IPv6",
      "ja": "IPv6におけるステートレスアドレス自動設定のための3041のNarten氏2001年1月個人情報保護の拡張"
    },
    {
      "indent": 0,
      "text": "This document describes an extension to IPv6 stateless address autoconfiguration for interfaces whose interface identifier is derived from an IEEE identifier. [STANDARDS TRACK]",
      "ja": "この文書では、インタフェース識別子IEEE識別子から導出されるインターフェイスのIPv6ステートレスアドレス自動設定の拡張を記述しています。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3040 Cooper Jan 2001 Internet Web Replication and Caching Taxonomy",
      "ja": "3040クーパー2001年1月、インターネットウェブ模写とキャッシュ分類"
    },
    {
      "indent": 0,
      "text": "This memo specifies standard terminology and the taxonomy of web replication and caching infrastructure as deployed today. It introduces standard concepts, and protocols used today within this application domain. This memo provides information for the Internet community.",
      "ja": "今日の展開として、このメモは標準的な用語やウェブ複製およびキャッシングインフラの分類を指定します。これは、このアプリケーションドメイン内で、今日使用される標準的な概念、およびプロトコルを紹介します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3039 Santesson Jan 2001 Internet X.509 Public Key Infrastructure Qualified Certificates Profile",
      "ja": "3039 Santesson 2001年1月のインターネットX.509公開鍵インフラストラクチャ資格証明書のプロフィール"
    },
    {
      "indent": 0,
      "text": "This document forms a certificate profile for Qualified Certificates, based on RFC 2459, for use in the Internet. The goal of this document is to define a general syntax independent of local legal requirements. [STANDARDS TRACK]",
      "ja": "この文書は、インターネットで使用するために、RFC 2459に基づいて、資格証明書の証明書プロファイルを形成しています。このドキュメントの目標は、地元の法的要件の一般的な構文の独立を定義することです。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3038 Nagami Jan 2001 VCID Notification over ATM link for LDP",
      "ja": "LDPのためのATMリンク上で3038永見2001年1月VCID通知"
    },
    {
      "indent": 0,
      "text": "This document specifies the procedures for the communication of VCID values between neighboring ATM-LSRs that must occur in order to ensure this property. [STANDARDS TRACK]",
      "ja": "この文書では、この特性を確保するために行われなければならない隣接ATM-LSRの間VCID値の通信のための手順を規定します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3037 Thomas Jan 2001 LDP Applicability",
      "ja": "3037トーマス・2001年1月、自民党の適用"
    },
    {
      "indent": 0,
      "text": "A fundamental concept in MPLS is that two Label Switching Routers (LSRs) must agree on the meaning of the labels used to forward traffic between and through them. This common understanding is achieved by using a set of procedures, called a label distribution protocol, by which one LSR informs another of label bindings it has made. This document describes the applicability of a set of such procedures called LDP (for Label Distribution Protocol) by which LSRs distribute labels to support MPLS forwarding along normally routed paths. This memo provides information for the Internet community.",
      "ja": "MPLSの基本的な考え方は、二つのラベルスイッチングルータ（LSRには）の間およびそれらを介してトラフィックを転送するために使用されるラベルの意味に同意しなければならないということです。この共通の理解は、1 LSRは自身が行ったラベルバインディングの別通知することにより、ラベル配布プロトコルと呼ばれる一連の手順を、使用することによって達成されます。この文書は、のLSRが正常にルーティングパスに沿ってMPLS転送をサポートするためのラベルを配布れる（ラベル配布プロトコルのための）LDPと呼ばれるこのような手順のセットの適用を記載します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3036 Andersson Jan 2001 LDP Specification",
      "ja": "3036・アンダーソン2001年1月LDP仕様"
    },
    {
      "indent": 0,
      "text": "A fundamental concept in MPLS is that two Label Switching Routers (LSRs) must agree on the meaning of the labels used to forward traffic between and through them. This common understanding is achieved by using a set of procedures, called a label distribution protocol, by which one LSR informs another of label bindings it has made. This document defines a set of such procedures called LDP (for Label Distribution Protocol) by which LSRs distribute labels to support MPLS forwarding along normally routed paths. [STANDARDS TRACK]",
      "ja": "MPLSの基本的な考え方は、二つのラベルスイッチングルータ（LSRには）の間およびそれらを介してトラフィックを転送するために使用されるラベルの意味に同意しなければならないということです。この共通の理解は、1 LSRは自身が行ったラベルバインディングの別通知することにより、ラベル配布プロトコルと呼ばれる一連の手順を、使用することによって達成されます。この文書は、のLSRが正常にルーティングパスに沿ってMPLS転送をサポートするためのラベルを配布れる（ラベル配布プロトコルのための）LDPと呼ばれるこのような手順のセットを定義します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3035 Davie Jan 2001 MPLS using LDP and ATM VC Switching",
      "ja": "LDPおよびATM VCの切り替えを使用して3035のデイビー2001年1月MPLS"
    },
    {
      "indent": 0,
      "text": "This document extends and clarifies the relevant portions of RFC 3031 and RFC 3036 by specifying in more detail the procedures which to be used when distributing labels to or from ATM-LSRs, when those labels represent Forwarding Equivalence Classes (FECs, see RFC 3031) for which the routes are determined on a hop-by-hop basis by network layer routing algorithms. [STANDARDS TRACK]",
      "ja": "この文書は延び、これらのラベルは、転送等価クラス（のFECは、RFC 3031を参照）を表す場合、より詳細にまたはATM-のLSRからラベルを配布するときに使用する手順で指定することにより、RFC 3031及びRFC 3036の関連部分を明確にどのルートがネットワーク層ルーティングアルゴリズムによって、ホップバイホップに基づいて決定されます。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3034 Conta Jan 2001 Use of Label Switching on Frame Relay Networks Specification",
      "ja": "フレームリレーネットワークの仕様上のラベルスイッチングの3034コンタ2001年1月の使用"
    },
    {
      "indent": 0,
      "text": "This document defines the model and generic mechanisms for Multiprotocol Label Switching on Frame Relay networks. [STANDARDS TRACK]",
      "ja": "この文書では、フレームリレーネットワーク上のマルチプロトコルラベルスイッチングのためのモデルと一般的なメカニズムを定義します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3033 Suzuki Jan 2001 The Assignment of the Information Field and Protocol Identifier in the Q.2941 Generic Identifier and Q.2957 User-to-user Signaling for the Internet Protocol",
      "ja": "3033スズキ2001年1月、インターネットプロトコルのためのQ.2941ジェネリック識別子とQ.2957ユーザ間のシグナリングにおける情報フィールドとプロトコル識別子の割り当て"
    },
    {
      "indent": 0,
      "text": "The purpose of this document is to specify the assignment of the information field and protocol identifier in the Q.2941 Generic Identifier and Q.2957 User-to-user Signaling for the Internet protocol. [STANDARDS TRACK]",
      "ja": "この文書の目的は、Q.2941共通識別子とQ.2957インターネットプロトコルのためのユーザツーユーザシグナリングにおける情報フィールドの割り当て及びプロトコル識別子を指定することです。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3032 Rosen Jan 2001 MPLS Label Stack Encoding",
      "ja": "3032ローゼン2001年1月MPLSラベルスタックコード化"
    },
    {
      "indent": 0,
      "text": "This document specifies the encoding to be used by an LSR in order to transmit labeled packets on Point-to-Point Protocol (PPP) data links, on LAN data links, and possibly on other data links as well. This document also specifies rules and procedures for processing the various fields of the label stack encoding. [STANDARDS TRACK]",
      "ja": "この文書は、同様にポイントツーポイントプロトコル（PPP）データリンク上で、LANのデータリンク上で、そしておそらく他のデータリンク上で標識されたパケットを送信するために、LSRが使用するエンコーディングを指定します。また、このドキュメントでは、ラベルスタックエンコーディングのさまざまなフィールドを処理するための規則と手順を指定します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3031 Rosen Jan 2001 Multiprotocol Label Switching Architecture",
      "ja": "3031ローゼン2001年1月マルチプロトコルラベルスイッチングアーキテクチャ"
    },
    {
      "indent": 0,
      "text": "This document specifies the architecture for Multiprotocol Label Switching (MPLS). [STANDARDS TRACK]",
      "ja": "この文書では、マルチプロトコルラベルスイッチング（MPLS）のためのアーキテクチャを指定します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3030 Vaudreuil Dec 2000 SMTP Service Extensions for Transmission of Large and Binary MIME Messages",
      "ja": "大およびバイナリMIMEメッセージの伝送のための3030のヴォードルイユ2000年12月のSMTPサービス拡張"
    },
    {
      "indent": 0,
      "text": "This memo defines two extensions to the SMTP (Simple Mail Transfer Protocol) service. [STANDARDS TRACK]",
      "ja": "このメモは、SMTP（簡易メール転送プロトコル）サービスに2つの拡張を定義します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3029 Adams Feb 2001 Internet X.509 Public Key Infrastructure Data Validation and Certification Server Protocols",
      "ja": "3029アダムス2001年2月のインターネットX.509公開鍵インフラストラクチャデータの検証と認証サーバプロトコル"
    },
    {
      "indent": 0,
      "text": "This document describes a general Data Validation and Certification Server (DVCS) and the protocols to be used when communicating with it. This memo defines an Experimental Protocol for the Internet community.",
      "ja": "この文書では、一般的なデータの検証と認証サーバー（DVCS）及びそれと通信するときに使用するプロトコルについて説明します。このメモはインターネットコミュニティのためにExperimentalプロトコルを定義します。"
    },
    {
      "indent": 0,
      "text": "3028 Showalter Jan 2001 Sieve: A Mail Filtering Language",
      "ja": "3028ショーウォルター監督2001年1月ふるい：メールフィルタ言語"
    },
    {
      "indent": 0,
      "text": "This document describes a language for filtering e-mail messages at time of final delivery. [STANDARDS TRACK]",
      "ja": "このドキュメントは、最終的な配達時に電子メールメッセージをフィルタリングするための言語を記述しています。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3027 Holdrege Jan 2001 Protocol Complications with the IP Network Address Translator",
      "ja": "IPネットワークアドレス変換で3027のホールドレッジ2001年1月プロトコル合併症"
    },
    {
      "indent": 0,
      "text": "The purpose of this document is to identify the protocols and applications that break with NAT enroute. The document also attempts to identify any known workarounds. This document attempts to capture as much information as possible, but is by no means a comprehensive coverage. This memo provides information for the Internet community.",
      "ja": "このドキュメントの目的は、NAT途中で壊れプロトコルおよびアプリケーションを識別することです。文書はまた、任意の既知の回避策を識別しようとします。このドキュメントは、できるだけ多くの情報を取得しようとしますが、決して包括的にカバーです。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3026 Blane Jan 2001 Liaison to IETF/ISOC on ENUM",
      "ja": "ENUMのIETF / ISOCへ3026 Blane 2001年1月リエゾン"
    },
    {
      "indent": 0,
      "text": "Working Party 1/2, of the International Telecommunication Union Telecommunication Standardization Sector (ITU-T) held a meeting of its collaborators in Berlin Germany 19-26 October 2000. This liaison from WP1/2 to the IETF/ISOC conveys the understandings of the WP1/2 collaborators resulting from the discussions. This memo provides information for the Internet community.",
      "ja": "国際電気通信連合電気通信標準化部門（ITU-T）の作業部会1/2は、WP1 / 2からIETF / ISOCへ2000年10月、このリエゾンをベルリンドイツ19-26でその協力者の会議を開催の理解を伝えます議論の結果WP1 / 2協力者。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3025 Dommety Feb 2001 Mobile IP Vendor/Organization-Specific Extensions",
      "ja": "3025 Dommety 2001年2月のモバイルIPベンダー/組織固有の拡張機能"
    },
    {
      "indent": 0,
      "text": "This document defines two new extensions to Mobile IP. These extensions will facilitate equipment vendors and organizations to make specific use of these extensions as they see fit for research or deployment purposes. [STANDARDS TRACK]",
      "ja": "この文書では、モバイルIPには、2つの新しい拡張機能を定義します。これらの拡張機能は、彼らが研究や導入の目的のために合うようにこれらの拡張機能の特定の使用を作るために機器ベンダーや組織を促進します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3024 Montenegro Jan 2001 Reverse Tunneling for Mobile IP, revised",
      "ja": "改訂されたモバイルIPのための3024モンテネグロ2001年1月リバーストンネリング、"
    },
    {
      "indent": 0,
      "text": "This document proposes backwards-compatible extensions to Mobile IP to support topologically correct reverse tunnels. This document does not attempt to solve the problems posed by firewalls located between the home agent and the mobile node's care-of address. [STANDARDS TRACK]",
      "ja": "この文書では、位相幾何学的に正しい逆方向トンネルをサポートするために、モバイルIPへの下位互換性の拡張を提案しています。この文書では、ホームエージェントとモバイルノードの気付アドレスの間に位置し、ファイアウォールによってもたらされる問題を解決しようとしません。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3023 Murata Jan 2001 XML Media Types",
      "ja": "3023の村田2001年1月XMLのメディアタイプ"
    },
    {
      "indent": 0,
      "text": "This document standardizes five new media types -- text/xml, application/xml, text/xml-external-parsed-entity, application/xml-external-parsed-entity, and application/xml-dtd -- for use in exchanging network entities that are related to the Extensible Markup Language (XML). This document also standardizes a convention (using the suffix '+xml') for naming media types outside of these five types when those media types represent XML MIME (Multipurpose Internet Mail Extensions) entities. [STANDARDS TRACK]",
      "ja": "text / xmlで、アプリケーション/ XML、text / xmlで、外部解析されたエンティティ、アプリケーション/ XML-外部解析されたエンティティ、およびアプリケーション/ XML-DTD  -   - ネットワークの交換で使用するためこのドキュメントでは、5つの新しいメディアタイプを標準化拡張マークアップ言語（XML）に関連するエンティティ。この文書はまた、これらのメディアタイプがXML MIME（多目的インターネットメール拡張）エンティティを表すこれらの5つのタイプの外でメディアタイプを命名（接尾辞を使用して「+ XML」）規則を標準化しています。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3022 Srisuresh Jan 2001 Traditional IP Network Address Translator (Traditional NAT)",
      "ja": "3022 Srisuresh 2001年1月の伝統的なIPネットワークアドレス変換（NAT繁体字）"
    },
    {
      "indent": 0,
      "text": "The NAT operation described in this document extends address translation introduced in RFC 1631 and includes a new type of network address and TCP/UDP port translation. In addition, this document corrects the Checksum adjustment algorithm published in RFC 1631 and attempts to discuss NAT operation and limitations in detail. This memo provides information for the Internet community.",
      "ja": "この文書で説明NATの動作は、RFC 1631で導入されたアドレス変換を拡張し、ネットワークアドレスとTCP / UDPポート変換の新しいタイプを含んでいます。また、この文書はRFC 1631に掲載されたチェックサム調整アルゴリズムを修正し、詳細にNAT動作と限界を議論しようとします。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3021 Retana Dec 2000 Using 31-Bit Prefixes on IPv4 Point-to-Point Links",
      "ja": "IPv4のポイントツーポイントリンク上で31ビットのプレフィックスを使用して3021 Retana 2000年12月"
    },
    {
      "indent": 0,
      "text": "With ever-increasing pressure to conserve IP address space on the Internet, it makes sense to consider where relatively minor changes can be made to fielded practice to improve numbering efficiency. One such change, proposed by this document, is to halve the amount of address space assigned to point-to-point links (common throughout the Internet infrastructure) by allowing the use of 31-bit subnet masks in a very limited way. [STANDARDS TRACK]",
      "ja": "インターネット上のIPアドレス空間を節約するために絶えず増加圧力で、それは比較的軽微な変更はナンバリング効率を改善するために擁立実際に行うことができる場所を検討することは理にかなって。この文書で提案した一つのそのような変化は、非常に限られた方法で、31ビットのサブネットマスクの使用を可能にすることにより、（インターネットインフラ全体で共通）ポイントツーポイントリンクに割り当てられたアドレス空間の量を半減することです。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3020 Pate Dec 2000 Definitions of Managed Objects for Monitoring and Controlling the UNI/NNI Multilink Frame Relay Function",
      "ja": "監視とUNI / NNIマルチリンクフレームリレー機能を制御するための管理オブジェクトの3020のパテ2000の12月の定義"
    },
    {
      "indent": 0,
      "text": "This memo defines a Management Information Base (MIB) for monitoring and controlling a UNI/NNI Multilink Frame Relay Function as defined in Frame Relay Forum FRF.16. [STANDARDS TRACK]",
      "ja": "このメモは、フレームリレーフォーラムFRF.16で定義されたUNI / NNIマルチリンクフレームリレー機能を監視し、制御するための管理情報ベース（MIB）を定義します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3019 Haberman Jan 2001 IP Version 6 Management Information Base for The Multicast Listener Discovery Protocol",
      "ja": "マルチキャストリスナ発見プロトコルのための3019ハーバーマン2001年1月IPバージョン6管理情報ベース"
    },
    {
      "indent": 0,
      "text": "This document defines a portion of the Management Information Base (MIB) for use with network management protocols in Internet Protocol Version 6 internets. Specifically, this document is the MIB module that defines managed objects for implementations of the Multicast Listener Discovery Protocol [RFC2710]. [STANDARDS TRACK]",
      "ja": "この文書は、インターネットプロトコルバージョン6インターネット上でネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。具体的には、この文書は、マルチキャストリスナ発見プロトコル[RFC2710]の実装のための管理オブジェクトを定義するMIBモジュールです。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3018 Bogdanov Dec 2000 Unified Memory Space Protocol Specification",
      "ja": "3018ボグダノフ2000年12月ユニファイド・メモリ・スペースプロトコル仕様"
    },
    {
      "indent": 0,
      "text": "This document specifies Unified Memory Space Protocol (UMSP), which gives a capability of immediate access to memory of the remote nodes. This memo defines an Experimental Protocol for the Internet community.",
      "ja": "この文書では、リモートノードのメモリに直接アクセスする機能を提供するユニファイド・メモリ・スペースプロトコル（UMSP）を指定します。このメモはインターネットコミュニティのためにExperimentalプロトコルを定義します。"
    },
    {
      "indent": 0,
      "text": "3017 Riegel Dec 2000 XML DTD for Roaming Access Phone Book",
      "ja": "ローミングアクセス電話帳の3017リーゲル2000年12月XML DTD"
    },
    {
      "indent": 0,
      "text": "This document defines the syntax as well as the semantics of the information to be included in the phone book for roaming applications. [STANDARDS TRACK]",
      "ja": "この文書では、構文と同様にアプリケーションをローミングのための電話帳に含まれる情報の意味を定義します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3016 Kikuchi Nov 2000 RTP Payload Format for MPEG-4 Audio/Visual Streams",
      "ja": "MPEG-4オーディオ/ビジュアルストリームの3016菊池2000年11月RTPペイロードフォーマット"
    },
    {
      "indent": 0,
      "text": "This document describes Real-Time Transport Protocol (RTP) payload formats for carrying each of MPEG-4 Audio and MPEG-4 Visual bitstreams without using MPEG-4 Systems. [STANDARDS TRACK]",
      "ja": "この文書では、MPEG-4システムを使用せずに、MPEG-4オーディオおよびMPEG-4映像ビットストリームのそれぞれを運ぶためのリアルタイムトランスポートプロトコル（RTP）ペイロードフォーマットを説明しています。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3015 Cuervo Nov 2000 Megaco Protocol Version 1.0",
      "ja": "3015クエルボ2000年11月のMegacoプロトコルバージョン1.0"
    },
    {
      "indent": 0,
      "text": "This document defines the protocol used between elements of a physically decomposed multimedia gateway, i.e. a Media Gateway and a Media Gateway Controller. [STANDARDS TRACK]",
      "ja": "この文書は、物理的に分解し、マルチメディア・ゲートウェイ、即ちメディアゲートウェイとメディアゲートウェイコントローラの構成要素間で使用されるプロトコルを定義します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3014 Kavasseri Nov 2000 Notification Log MIB",
      "ja": "3014 Kavasseri 2000年11月の通知ログMIB"
    },
    {
      "indent": 0,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in the Internet community. In particular, it describes managed objects used for logging Simple Network Management Protocol (SNMP) Notifications. [STANDARDS TRACK]",
      "ja": "このメモは、インターネットコミュニティでのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、それは簡易ネットワーク管理プロトコル（SNMP）通知を記録するために使用される管理オブジェクトについて説明します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3013 Killalea Nov 2000 Recommended Internet Service Provider Security Services and Procedures",
      "ja": "3013 Killalea 2000年11月推奨するインターネットサービスプロバイダのセキュリティサービスと手続き"
    },
    {
      "indent": 0,
      "text": "The purpose of this document is to express what the engineering community as represented by the IETF expects of Internet Service Providers (ISPs) with respect to security. This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements.",
      "ja": "このドキュメントの目的は、IETFによって表されるようなエンジニアリングコミュニティがセキュリティに関してインターネットサービスプロバイダ（ISP）の期待するもの表明することにあります。このドキュメントはインターネットコミュニティのためのインターネットBest Current Practicesを指定し、改善のための議論と提案を要求します。"
    },
    {
      "indent": 0,
      "text": "3012 Perkins Nov 2000 Mobile IPv4 Challenge/Response Extensions",
      "ja": "3012パーキンス2000年11月モバイルIPv4チャレンジ/レスポンス拡張機能"
    },
    {
      "indent": 0,
      "text": "In this specification, we define extensions for the Mobile IP Agent Advertisements and the Registration Request that allow a foreign agent to use a challenge/response mechanism to authenticate the mobile node. [STANDARDS TRACK]",
      "ja": "この仕様では、我々は、モバイルIPエージェント広告及び外部エージェントは、移動ノードを認証するためにチャレンジ/レスポンスメカニズムを使用できるように登録要求用の拡張機能を定義します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3011 Waters Nov 2000 The IPv4 Subnet Selection Option for DHCP",
      "ja": "3011ウォーターズ2000年11月DHCPのIPv4サブネット選択オプション"
    },
    {
      "indent": 0,
      "text": "This memo defines a new Dynamic Host Configuration Protocol (DHCP) option for selecting the subnet on which to allocate an address. [STANDARDS TRACK]",
      "ja": "このメモは、アドレスを割り当てるためのサブネットを選択するための新しい動的ホスト構成プロトコル（DHCP）オプションを定義します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3010 Shepler Dec 2000 NFS version 4 Protocol",
      "ja": "3010 Shepler 2000年12月NFSバージョン4プロトコル"
    },
    {
      "indent": 0,
      "text": "NFS (Network File System) version 4 is a distributed file system protocol which owes heritage to NFS protocol versions 2 [RFC1094] and 3 [RFC1813]. Unlike earlier versions, the NFS version 4 protocol supports traditional file access while integrating support for file locking and the mount protocol. In addition, support for strong security (and its negotiation), compound operations, client caching, and internationalization have been added. Of course, attention has been applied to making NFS version 4 operate well in an Internet environment. [STANDARDS TRACK]",
      "ja": "NFS（ネットワークファイルシステム）バージョン4は、NFSプロトコルバージョン2 [RFC1094]及び3 [RFC1813]に遺産を負っている分散ファイルシステムプロトコルです。ファイルのロックとマウントプロトコルのサポートを統合しながら、以前のバージョンとは異なり、NFSバージョン4プロトコルは、従来のファイルアクセスをサポートしています。また、強力なセキュリティ（およびその交渉）、化合物の操作、クライアントのキャッシュ、および国際化のためのサポートが追加されました。もちろん、注意はNFSバージョン4は、インターネット環境でも動作させるに適用されています。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3009 Rosenberg Nov 2000 Registration of parityfec MIME types",
      "ja": "parityfec MIMEタイプの3009ローゼンバーグ2000年11月登録"
    },
    {
      "indent": 0,
      "text": "The RTP (Real-time Transport Protocol) payload format for generic forward error correction allows RTP participants to improve loss resiliency through the use of traditional parity-based channel codes. This payload format requires four new MIME types, audio/parityfec, video/parityfec, text/parityfec and application/parityfec. This document serves as the MIME type registration for those formats. [STANDARDS TRACK]",
      "ja": "一般的な前方誤り訂正のためのRTP（リアルタイムトランスポートプロトコル）ペイロードフォーマットは、RTPの参加者は、従来のパリティベースのチャネルコードを使用して損失の回復力を向上させることができます。このペイロード形式は4つの新しいMIMEタイプ、オーディオ/ parityfec、ビデオ/ parityfec、テキスト/ parityfecおよびアプリケーション/ parityfecが必要です。この文書は、これらの形式のMIMEタイプの登録として機能します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3008 Wellington Nov 2000 Domain Name System Security (DNSSEC) Signing Authority",
      "ja": "3008ウェリントン2000年11月ドメインネームシステムセキュリティ（DNSSEC）の署名機関"
    },
    {
      "indent": 0,
      "text": "This document proposes a revised model of Domain Name System Security (DNSSEC) Signing Authority. The revised model is designed to clarify earlier documents and add additional restrictions to simplify the secure resolution process. Specifically, this affects the authorization of keys to sign sets of records. [STANDARDS TRACK]",
      "ja": "この文書では、ドメインネームシステムセキュリティ（DNSSEC）の署名機関の改訂モデルを提案しています。改訂されたモデルは、以前の文書を明確にし、安全な解決プロセスを簡素化するために追加の制限を加えるように設計されています。具体的には、これは、レコードのセットに署名する鍵の承認に影響を与えます。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3007 Wellington Nov 2000 Secure Domain Name System (DNS) Dynamic Update",
      "ja": "3007ウェリントン2000年11月セキュアなドメインネームシステム（DNS）動的更新"
    },
    {
      "indent": 0,
      "text": "This document proposes a method for performing secure Domain Name System (DNS) dynamic updates. [STANDARDS TRACK]",
      "ja": "この文書では、セキュアなドメインネームシステム（DNS）動的更新を実行するための方法を提案しています。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3006 Davie Nov 2000 Integrated Services in the Presence of Compressible Flows",
      "ja": "圧縮性流れの存在下での3006デイビー2000年11月の統合サービス"
    },
    {
      "indent": 0,
      "text": "This specification describes an extension to the TSpec which enables a sender of potentially compressible data to provide hints to int-serv routers about the compressibility they may obtain. [STANDARDS TRACK]",
      "ja": "この仕様は、彼らが得ることができる圧縮についてルータ-SERV INTにヒントを提供するために、潜在的に圧縮可能なデータの送信元を可能にするTSpecの拡張機能について説明します。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3005 Harris Nov 2000 IETF Discussion List Charter",
      "ja": "3005ハリス2000年11月IETFディスカッションリスト憲章"
    },
    {
      "indent": 0,
      "text": "The Internet Engineering Task Force (IETF) discussion mailing list furthers the development and specification of Internet technology through discussion of technical issues, and hosts discussions of IETF direction, policy, meetings, and procedures. As this is the most general IETF mailing list, considerable latitude is allowed. Advertising, whether to solicit business or promote employment opportunities, falls well outside the range of acceptable topics, as do discussions of a personal nature. This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements.",
      "ja": "IETF（Internet Engineering Task Force）の議論のメーリングリストは、技術的な問題の議論を介してインターネット技術の開発と仕様をfurthers、およびIETF方向の議論、政策、会議、および手続きをホストします。これは最も一般的なIETFメーリングリストであるため、かなりの自由度が許可されます。個人的な性質の議論を行うよう広告は、雇用機会のビジネスを勧誘または促進するかどうか、よく許容トピックの範囲外。このドキュメントはインターネットコミュニティのためのインターネットBest Current Practicesを指定し、改善のための議論と提案を要求します。"
    },
    {
      "indent": 0,
      "text": "3004 Stump Nov 2000 The User Class Option for DHCP",
      "ja": "3004切り株2000年11月DHCPのためのユーザー・クラスオプション"
    },
    {
      "indent": 0,
      "text": "This option is used by a Dynamic Host Configuration Protocol (DHCP) client to optionally identify the type or category of user or applications it represents. The information contained in this option is an opaque field that represents the user class of which the client is a member. Based on this class, a DHCP server selects the appropriate address pool to assign an address to the client and the appropriate configuration parameters. This option should be configurable by a user. [STANDARDS TRACK]",
      "ja": "このオプションは、それが表すユーザまたはアプリケーションのタイプまたはカテゴリを識別する任意にDHCP（Dynamic Host Configuration Protocol）クライアントによって使用されます。このオプションに含まれる情報は、クライアントがメンバーとなっているユーザークラスを表す不透明なフィールドです。このクラスに基づいて、DHCPサーバは、クライアントと適切な設定パラメータにアドレスを割り当てるために、適切なアドレスプールを選択します。このオプションは、ユーザーが設定可能でなければなりません。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3003 Nilsson Nov 2000 The audio/mpeg Media Type",
      "ja": "3003ニルソン2000年11月オーディオ/ mpegのメディアタイプ"
    },
    {
      "indent": 0,
      "text": "The audio layers of the MPEG-1 and MPEG-2 standards are in frequent use on the internet, but there is no uniform Multipurpose Internet Mail Extension (MIME) type for these files. The intention of this document is to define the media type audio/mpeg to refer to this kind of contents. [STANDARDS TRACK]",
      "ja": "オーディオMPEG-1の層と、MPEG-2規格は、インターネット上で頻繁に使用されているが、これらのファイルには均一なMIME（Multipurpose Internet Mail Extension）タイプがありません。このドキュメントの意図は、内容のこの種を参照するためにメディアタイプオーディオ/ mpegのを定義することです。 [STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "3002 Mitzel Dec 2000 Overview of 2000 IAB Wireless Internetworking Workshop",
      "ja": "3002 Mitzel 2000年12月概要2000 IABワイヤレスのインターネットワーキングワークショップ"
    },
    {
      "indent": 0,
      "text": "This document provides an overview of a workshop held by the Internet Architecture Board (IAB) on wireless internetworking. This memo provides information for the Internet community.",
      "ja": "この文書では、無線インターネットワーキング上のインターネットアーキテクチャ委員会（IAB）で開催されたワークショップの概要を説明します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3001 Mealling Nov 2000 A URN Namespace of Object Identifiers",
      "ja": "オブジェクト識別子の3001 Mealling 2000年11月A URN名前空間"
    },
    {
      "indent": 0,
      "text": "This document describes a Uniform Resource Names (URN) namespace that contains Object Identifiers (OIDs). This memo provides information for the Internet community.",
      "ja": "この文書では、オブジェクト識別子（OID）が含まれて統一リソース名（URN）名前空間について説明します。このメモはインターネットコミュニティのための情報を提供します。"
    },
    {
      "indent": 0,
      "text": "3000 Reynolds Nov 2001 Internet Official Protocol Standards",
      "ja": "3000のレイノルズ2001年11月インターネット公式プロトコル標準"
    },
    {
      "indent": 0,
      "text": "This memo contains a snapshot of the state of standardization of protocols used in the Internet as of October 25, 2001. It lists official protocol standards and Best Current Practice RFCs; it is not a complete index to the RFC series. The latest version of this memo is designated STD 1. [STANDARDS TRACK]",
      "ja": "それは公式のプロトコル標準を一覧表示し、現在のベストプラクティスのRFC 10月25日、2001年のように、このメモは、インターネットで使用されるプロトコルの標準化の状態のスナップショットが含まれています。それはRFCシリーズへの完全なインデックスではありません。このメモの最新バージョンはSTD 1が指定されている[STANDARDS TRACK]"
    },
    {
      "indent": 0,
      "text": "Security Considerations",
      "ja": "セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Security issues are not discussed in this memo.",
      "ja": "セキュリティ問題はこのメモでは議論しません。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Sandy Ginoza University of Southern California Information Sciences Institute 4676 Admiralty Way Marina del Rey, CA 90292",
      "ja": "南カリフォルニア情報科学研究所のサンディ・宜野座大学4676アドミラルティWayマリナデルレイ、CA 90292"
    },
    {
      "indent": 3,
      "text": "Phone: (310) 822-1511",
      "ja": "電話：（310）822-1511"
    },
    {
      "indent": 3,
      "text": "EMail: ginoza@isi.edu",
      "ja": "メールアドレス：ginoza@isi.edu"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}