{
  "title": {
    "text": "RFC 3518 - Point-to-Point Protocol (PPP) Bridging Control Protocol (BCP)",
    "ja": "RFC 3518 - ポイントツーポイントプロトコル（PPP）ブリッジング制御プロトコル（BCP）"
  },
  "number": 3518,
  "created_at": "2023-10-28 15:17:45.398150+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                     M. Higashiyama\nRequest for Comments: 3518                                       Anritsu\nObsoletes: 2878                                                 F. Baker\nCategory: Standards Track                                        T. Liao\n                                                           Cisco Systems\n                                                              April 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "Point-to-Point Protocol (PPP) Bridging Control Protocol (BCP)",
      "ja": "ポイントツーポイントプロトコル（PPP）ブリッジング制御プロトコル（BCP）"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The Point-to-Point Protocol (PPP) provides a standard method for transporting multi-protocol datagrams over point-to-point links. PPP defines an extensible Link Control Protocol (LCP) and proposes a family of Network Control Protocols (NCP) for establishing and configuring different network-layer protocols.",
      "ja": "ポイントツーポイントプロトコル（PPP）は、ポイントツーポイントリンクでマルチプロトコルデータグラムを輸送するための標準的な方法を提供します。PPPは、拡張可能なリンク制御プロトコル（LCP）を定義し、さまざまなネットワーク層プロトコルを確立および構成するためのネットワーク制御プロトコルファミリー（NCP）を提案します。"
    },
    {
      "indent": 3,
      "text": "This document defines the NCP for establishing and configuring Remote Bridging for PPP links.",
      "ja": "このドキュメントでは、PPPリンクのリモートブリッジングを確立および構成するためのNCPを定義しています。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 2878, which was based on the IEEE 802.1D-1993 MAC Bridge. This document extends that specification by improving support for bridge control packets.",
      "ja": "この文書は、IEEE 802.1-1-1993 Mac Bridgeに基づいたRFC 2878を廃止しました。このドキュメントは、ブリッジ制御パケットのサポートを改善することにより、その仕様を拡張します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Historical Perspective ................................    2\n    1.1  Requirements Keywords ............................    3\n2.  Methods of Bridging ...................................    3\n    2.1  Transparent Bridging .............................    3\n    2.2  Remote Transparent Bridging ......................    4\n    2.3  Source Routing ...................................    5\n    2.4  Remote Source Route Bridging .....................    6\n    2.5  SR-TB Translational Bridging .....................    7\n3.  Traffic Services ......................................    7",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "    3.1  LAN Frame Checksum Preservation ..................    7\n    3.2  Traffic having no LAN Frame Checksum .............    7\n    3.3  Tinygram Compression .............................    8\n    3.4  Virtual LANs .....................................    8\n    3.5  Bridge Control Packet Indicator ..................    9\n4.  A PPP Network Control Protocol for Bridging ...........   10\n    4.1   Sending Bridge Frames ...........................   11\n         4.1.1  Maximum Receive Unit Considerations .......   11\n         4.1.2  Loopback and Link Quality Monitoring ......   11\n         4.1.3  Message Sequence ..........................   11\n         4.1.4  Separation of Spanning Tree Domains .......   12\n    4.2  Bridged LAN Traffic in IEEE 802 Untagged Frame ...   13\n    4.3  Bridged LAN Traffic in IEEE 802 Tagged Frame .....   17\n    4.4  Bridge management protocol data unit .............   21\n5.  BCP Configuration Options .............................   22\n    5.1  Bridge-Identification ............................   22\n    5.2  Line-Identification ..............................   24\n    5.3  MAC-Support ......................................   25\n    5.4  Tinygram-Compression .............................   26\n    5.5  MAC-Address ......................................   27\n    5.6  Spanning Tree Protocol (old formatted) ...........   28\n    5.7  IEEE-802-Tagged-Frame ............................   30\n    5.8  Management-Inline ................................   31\n    5.9  Bridge-Control-Packet-Indicator ..................   32\n6.  Changes From RFC 2878 .................................   33\n7.  Security Considerations ...............................   33\n8.  Intellectual Property Notice ..........................   33\n9.  IANA Considerations ...................................   34\n10. Acknowledgments .......................................   34\nAppendices ................................................   35\n   A.     Spanning Tree Bridge PDU (old formatted) ........   35\n   B.     Tinygram-Compression Pseudo-Code ................   36\nReferences ............................. ..................   38\nAuthors' Addresses ........................................   39\nFull Copyright Statement...................................   40",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Historical Perspective",
      "section_title": true,
      "ja": "1. 歴史的視点"
    },
    {
      "indent": 3,
      "text": "Two basic algorithms are ambient in the industry for Bridging of Local Area Networks. The more common algorithm is called \"Transparent Bridging\", and has been standardized for Extended LAN configurations by IEEE 802.1. The other is called \"Source Route Bridging\", and is prevalent on IEEE 802.5 Token Ring LANs.",
      "ja": "2つの基本的なアルゴリズムは、地元のネットワークを橋渡しするための業界での周囲です。より一般的なアルゴリズムは「透明ブリッジング」と呼ばれ、IEEE 802.1によって拡張されたLAN構成に対して標準化されています。もう1つは「ソースルートブリッジング」と呼ばれ、IEEE 802.5トークンリングLANで普及しています。"
    },
    {
      "indent": 3,
      "text": "The IEEE has combined these two methods into a device called a Source Routing Transparent (SRT) bridge, which concurrently provides both Source Route and Transparent bridging. Transparent and SRT bridges are specified in IEEE standard 802.1D-1998 [8].",
      "ja": "IEEEは、これらの2つの方法を、ソースルーティング透過（SRT）ブリッジと呼ばれるデバイスに組み合わせており、ソースルートと透明ブリッジングの両方を同時に提供しています。透明性およびSRTブリッジは、IEEE標準802.1D-1998で指定されています[8]。"
    },
    {
      "indent": 3,
      "text": "Although IEEE committee 802.1G is addressing remote bridging [2], neither standard directly defines the mechanisms for implementing remote bridging. Technically, that would be beyond the IEEE 802 committee's charter. However, both 802.1D and 802.1G allow for it. The implementor may model the line either as a component within a single MAC Relay Entity, or as the LAN media between two remote bridges.",
      "ja": "IEEE委員会802.1Gはリモートブリッジング[2]に対処していますが、どちらの標準もリモートブリッジングを実装するメカニズムを直接定義していません。技術的には、それはIEEE 802委員会の憲章を超えています。ただし、802.1dと802.1gの両方がそれを許可します。実装者は、単一のMacリレーエンティティ内のコンポーネントとして、または2つのリモートブリッジ間のLANメディアとしてラインをモデル化できます。"
    },
    {
      "indent": 3,
      "text": "The original IEEE 802.1D is augmented by IEEE 802.1Q [9] to provide support for Virtual LAN. Virtual LAN is an integral feature of switched LAN networks.",
      "ja": "元のIEEE 802.1Dは、仮想LANのサポートを提供するためにIEEE 802.1Q [9]によって増強されます。仮想LANは、スイッチ付きLANネットワークの不可欠な機能です。"
    },
    {
      "indent": 0,
      "text": "1.1 Requirements Keywords",
      "section_title": true,
      "ja": "1.1 要件キーワード"
    },
    {
      "indent": 3,
      "text": "The keywords MUST, MUST NOT, REQUIRED, SHALL, SHALL NOT, SHOULD, SHOULD NOT, RECOMMENDED, MAY, and OPTIONAL, when they appear in this document, are to be interpreted as described in [12].",
      "ja": "キーワードは、[12]で説明されているように解釈される場合、このドキュメントに登場する場合、キーワードは、[12]に記載されているように解釈される場合に、このドキュメントに登場する場合に、推奨される、推奨されないであろう、すべきではない、、勧められてはならない、しては、勧めてはならない、しないでください。"
    },
    {
      "indent": 0,
      "text": "2. Methods of Bridging",
      "section_title": true,
      "ja": "2. ブリッジングの方法"
    },
    {
      "indent": 0,
      "text": "2.1. Transparent Bridging",
      "section_title": true,
      "ja": "2.1. 透明なブリッジング"
    },
    {
      "indent": 3,
      "text": "As a favor to the uninitiated, let us first describe Transparent Bridging. Essentially, the bridges in a network operate as isolated entities, largely unaware of each others' presence. A Transparent Bridge maintains a Forwarding Database consisting of",
      "ja": "初心者への好意として、まず透明な橋渡しを説明しましょう。基本的に、ネットワーク内の橋は孤立したエンティティとして動作し、お互いの存在をほとんど知らない。透明なブリッジは、その後に構成される転送データベースを維持します"
    },
    {
      "indent": 20,
      "text": "{address, interface}",
      "ja": "{アドレス、インターフェイス}"
    },
    {
      "indent": 27,
      "text": "or",
      "ja": "または又はそれとも若しくは乃至或るいは"
    },
    {
      "indent": 18,
      "text": "{address, interface, VLAN ID}",
      "ja": "{アドレス、インターフェイス、VLAN ID}"
    },
    {
      "indent": 3,
      "text": "records, by saving the Source Address of each LAN transmission that it receives, along with the interface identifier for the interface it was received on. Bridges which support Virtual LANs additionally keep the Virtual LAN ID in their forwarding database. It goes on to check whether the Destination Address is in the database, and if so, either discards the message when the destination and source are located at the same interface, or forwards the message to the indicated interface. A message whose Destination Address is not found in the table is forwarded to all interfaces except the one it was received on. This behavior applies to Broadcast/Multicast frames as well.",
      "ja": "記録は、受信した各LAN伝送のソースアドレスを保存することにより、および受信したインターフェイスのインターフェイス識別子とともに保存します。仮想LANをサポートするブリッジは、さらに仮想LAN IDを転送データベースに保持します。宛先アドレスがデータベースにあるかどうかを確認します。もしそうなら、宛先とソースが同じインターフェイスにあるときにメッセージを破棄するか、指定されたインターフェイスにメッセージを転送します。テーブルに宛先アドレスが見つからないメッセージは、受信したインターフェイスを除くすべてのインターフェイスに転送されます。この動作は、ブロードキャスト/マルチキャストフレームにも適用されます。"
    },
    {
      "indent": 3,
      "text": "The obvious fly in the ointment is that redundant paths in the network cause indeterminate (nay, all too determinate) forwarding behavior to occur. To prevent this, a protocol called the Spanning Tree Protocol is executed between the bridges to detect and logically remove redundant paths from the network.",
      "ja": "軟膏の明らかなハエは、ネットワーク内の冗長パスが不定（いや、すべてが決定的すぎる）転送動作を発生させることです。これを防ぐために、スパニングツリープロトコルと呼ばれるプロトコルがブリッジ間で実行され、ネットワークから冗長パスを検出して削除します。"
    },
    {
      "indent": 3,
      "text": "One system is elected as the \"Root\", which periodically emits a message called a Bridge Protocol Data Unit (BPDU), heard by all of its neighboring bridges. Each of these modifies and passes the BPDU on to its neighbors, until it arrives at the leaf LAN segments in the network (where it dies, having no further neighbors to pass it along), or until the message is stopped by a bridge which has a superior path to the \"Root\". In this latter case, the interface the BPDU was received on is ignored (it is placed in a Hot Standby status, no traffic is emitted onto it except the BPDU, and all traffic received from it is discarded), until a topology change forces a recalculation of the network.",
      "ja": "1つのシステムが「ルート」として選出されます。これは、隣接するすべての橋が聞こえるブリッジプロトコルデータユニット（BPDU）と呼ばれるメッセージを定期的に放出します。これらのそれぞれは、ネットワーク内の葉のlanセグメント（死ぬ、それを渡すためにそれ以上の隣人がありません）に到着するまで、またはメッセージがある橋によって停止するまで、bpduを隣接者に変更し、渡します。「ルート」への優れたパス。この後者の場合、BPDUが受信されたインターフェイスは無視されます（ホットスタンバイステータスに配置され、BPDUを除くトラフィックは放出され、受け取ったすべてのトラフィックは破棄されます）。ネットワークの再計算。"
    },
    {
      "indent": 3,
      "text": "To establish Virtual LANs in an environment of multiple bridges, GVRP (GARP VLAN Registration Protocol) is executed between bridges to exchange Virtual LAN information. GVRP provides a mechanism to dynamically establish and update their knowledge of the set of Virtual LANs that currently have active members.",
      "ja": "複数のブリッジの環境で仮想LANを確立するために、GVRP（GARP VLAN登録プロトコル）がブリッジ間で実行され、仮想LAN情報を交換します。GVRPは、現在アクティブなメンバーがいる仮想LANのセットに関する知識を動的に確立および更新するメカニズムを提供します。"
    },
    {
      "indent": 3,
      "text": "To reduce unnecessary multicast flooding in the network, bridges exchange group MAC addresses using the GARP Multicast Registration Protocol. GMRP provides a mechanism so that bridges can know which multicast frames should be forwarded on each port.",
      "ja": "ネットワーク内の不必要なマルチキャスト洪水を減らすために、GARPマルチキャスト登録プロトコルを使用して、Bridges Exchange Group Macアドレスを交換します。GMRPは、ブリッジが各ポートにどのマルチキャストフレームを転送するかを知ることができるようにメカニズムを提供します。"
    },
    {
      "indent": 0,
      "text": "2.2. Remote Transparent Bridging",
      "section_title": true,
      "ja": "2.2. リモート透明なブリッジング"
    },
    {
      "indent": 3,
      "text": "There exist two basic sorts of bridges -- those that interconnect LANs directly, called Local Bridges, and those that interconnect LANs via an intermediate medium such as a leased line, called Remote Bridges. PPP may be used to connect Remote Bridges.",
      "ja": "2つの基本的な種類の橋が存在します - ローカルブリッジと呼ばれるLANを直接相互接続するものと、リモートブリッジと呼ばれるリースラインなどの中間媒体を介してLANを相互接続するものです。PPPは、リモートブリッジを接続するために使用できます。"
    },
    {
      "indent": 3,
      "text": "The IEEE 802.1G Remote MAC Bridging committee has proposed a model of a Remote Bridge in which a set of two or more Remote Bridges that are interconnected via remote lines are termed a Remote Bridge Group. Within a Group, a Remote Bridge Cluster is dynamically formed through execution of the spanning tree as the set of bridges that may pass frames among each other.",
      "ja": "IEEE 802.1gのリモートMacブリッジング委員会は、リモートラインを介して相互接続された2つ以上のリモートブリッジのセットがリモートブリッジグループと呼ばれるリモートブリッジのモデルを提案しました。グループ内で、リモートブリッジクラスターは、スパニングツリーの実行により、互いにフレームを渡す可能性のあるブリッジのセットとして動的に形成されます。"
    },
    {
      "indent": 3,
      "text": "This model bestows on the remote lines the basic properties of a LAN, but does not require a one-to-one mapping of lines to virtual LAN segments. For instance, the model of three interconnected Remote Bridges, A, B and C, may be that of a virtual LAN segment between A and B and another between B and C. However, if a line exists between Remote Bridges B and C, a frame could actually be sent directly from B to C, as long as there was the external appearance that it had travelled through A.",
      "ja": "このモデルは、リモートラインでLANの基本的な特性を与えますが、仮想LANセグメントへのラインの1対1のマッピングは必要ありません。たとえば、3つの相互接続されたリモートブリッジA、B、およびCのモデルは、AとBの間の仮想LANセグメントとBとCの間の別のモデルのモデルである可能性があります。ただし、リモートブリッジBとCの間にラインが存在する場合、Aフレームは、Aを通り抜けた外観がある限り、実際にBからCに直接送信できます。"
    },
    {
      "indent": 3,
      "text": "IEEE 802.1G thus allows for a great deal of implementation freedom for features such as route optimization and load balancing, as long as the model is maintained.",
      "ja": "したがって、IEEE 802.1gは、モデルが維持されている限り、ルートの最適化や負荷分散などの機能に多大な実装の自由を可能にします。"
    },
    {
      "indent": 3,
      "text": "For simplicity, we discuss Remote Bridging in this document in terms of two Remote Bridges connected by a single line.",
      "ja": "簡単にするために、このドキュメントのリモートブリッジングについて、単一の行で接続された2つのリモートブリッジに関して説明します。"
    },
    {
      "indent": 0,
      "text": "2.3. Source Routing",
      "section_title": true,
      "ja": "2.3. ソースルーティング"
    },
    {
      "indent": 3,
      "text": "The IEEE 802.1D Committee has standardized Source Routing for any MAC Type that allows its use. Currently, MAC Types that support Source Routing are FDDI and IEEE 802.5 Token Ring.",
      "ja": "IEEE 802.1D委員会には、その使用を可能にするMACタイプのソースルーティングを標準化しました。現在、ソースルーティングをサポートするMACタイプは、FDDIおよびIEEE 802.5トークンリングです。"
    },
    {
      "indent": 3,
      "text": "The IEEE standard defines Source Routing only as a component of an SRT bridge. However, many bridges have been implemented which are capable of performing Source Routing alone. These are most commonly implemented in accordance either with the IBM Token-Ring Network Architecture Reference [1] or with the Source Routing Appendix of IEEE 802.1D-1998 [8].",
      "ja": "IEEE標準は、ソースルーティングをSRTブリッジのコンポーネントとしてのみ定義します。ただし、ソースルーティングを単独で実行できる多くのブリッジが実装されています。これらは、IBMトークンリングネットワークアーキテクチャリファレンス[1]またはIEEE 802.1D-1998 [8]のソースルーティング付録に従って最も一般的に実装されています。"
    },
    {
      "indent": 3,
      "text": "In the Source Routing approach, the originating system has the responsibility of indicating the path that the message should follow. It does this, if the message is directed off of the local segment, by including a variable length MAC header extension called the Routing Information Field (RIF). The RIF consists of one 16-bit word of flags and parameters, followed by zero or more segment-and-bridge identifiers. Each bridge en route determines from this source route list whether it should accept the message and how to forward it.",
      "ja": "ソースルーティングアプローチでは、出身システムには、メッセージが従うべきパスを示す責任があります。これは、メッセージがローカルセグメントから誘導される場合、ルーティング情報フィールド（RIF）と呼ばれる可変長さMACヘッダー拡張機能を含めることにより、これを行います。RIFは、1つの16ビットのフラグとパラメーターで構成され、その後にゼロ以上のセグメントとブリッジの識別子が続きます。途中の各ブリッジは、このソースルートリストから、メッセージを受け入れるべきかどうか、どのように転送するかを決定します。"
    },
    {
      "indent": 3,
      "text": "In order to discover the path to a destination, the originating system transmits an Explorer frame. An All-Routes Explorer (ARE) frame follows all possible paths to a destination. A Spanning Tree",
      "ja": "目的地へのパスを発見するために、発信元システムはエクスプローラーフレームを送信します。すべてのルートのエクスプローラー（are）フレームは、目的地へのすべての可能なパスに従います。スパニングツリー"
    },
    {
      "indent": 3,
      "text": "Explorer (STE) frame follows only those paths defined by Bridge ports that the Spanning Tree Algorithm has put in Forwarding state. Port states do not apply to ARE or Specifically-Routed Frames. The destination system replies to each copy of an ARE frame with a Specifically-Routed Frame, and to an STE frame with an ARE frame. In either case, the originating station may receive multiple replies, from which it chooses the route it will use for future Specifically-Routed Frames.",
      "ja": "Explorer（STE）フレームは、スパニングツリーアルゴリズムが転送状態にしたブリッジポートで定義されたパスのみに従います。ポート状態は、areまたは具体的にルーティングされたフレームに適用されません。宛先システムは、特別にルーティングされたフレームを備えたasフレームの各コピー、およびaseフレームを備えたSteフレームに応答します。どちらの場合でも、元のステーションは複数の応答を受け取る場合があり、そこから将来の特異的にルーティングされたフレームに使用するルートを選択します。"
    },
    {
      "indent": 3,
      "text": "The algorithm for Source Routing requires the bridge to be able to identify any interface by its segment-and-bridge identifier. When a packet is received that has the RIF present, a boolean in the RIF is inspected to determine whether the segment-and-bridge identifiers are to be inspected in \"forward\" or \"reverse\" sense. In its search, the bridge looks for the segment-and-bridge identifier of the interface the packet was received on, and forwards the packet toward the segment identified in the segment-and-bridge identifier that follows it.",
      "ja": "ソースルーティングのアルゴリズムでは、ブリッジがセグメントとブリッジの識別子によってインターフェイスを識別できる必要があります。RIFが存在するパケットを受信すると、RIFのブール値が検査され、セグメントとブリッジの識別子が「フォワード」または「逆」感覚で検査されるかどうかを判断します。検索では、ブリッジはパケットが受信されたインターフェイスのセグメントとブリッジの識別子を探し、それに続くセグメントとブリッジの識別子で識別されたセグメントにパケットを転送します。"
    },
    {
      "indent": 3,
      "text": "GVRP and GMRP are available and effective on Source Routing networks.",
      "ja": "GVRPとGMRPは、ソースルーティングネットワークで利用可能で効果的です。"
    },
    {
      "indent": 0,
      "text": "2.4. Remote Source Route Bridging",
      "section_title": true,
      "ja": "2.4. リモートソースルートブリッジング"
    },
    {
      "indent": 3,
      "text": "There is no Remote Source Route Bridge proposal in IEEE 802.1 at this time, although many vendors ship remote Source Routing Bridges.",
      "ja": "多くのベンダーはリモートソースルーティングブリッジを出荷していますが、現時点ではIEEE 802.1にリモートソースルートブリッジの提案はありません。"
    },
    {
      "indent": 3,
      "text": "We allow for modelling the line either as a connection residing between two halves of a \"split\" Bridge (the split-bridge model), or as a LAN segment between two Bridges (the independent-bridge model). In the latter case, the line requires a LAN Segment ID.",
      "ja": "「スプリット」ブリッジの2つの半分（スプリットブリッジモデル）の間にある接続として、または2つのブリッジの間のLANセグメント（独立橋モデル）のいずれかとして、ラインをモデル化できます。後者の場合、線にはLANセグメントIDが必要です。"
    },
    {
      "indent": 3,
      "text": "By default, PPP Source Route Bridges use the independent-bridge model. This requirement ensures interoperability in the absence of option negotiation. In order to use the split-bridge model, a system MUST successfully negotiate the Bridge-Identification Configuration Option.",
      "ja": "デフォルトでは、PPPソースルートブリッジは独立橋モデルを使用します。この要件により、オプション交渉がない場合の相互運用性が保証されます。スプリットブリッジモデルを使用するには、システムはブリッジ識別構成オプションを正常にネゴシエートする必要があります。"
    },
    {
      "indent": 3,
      "text": "Although no option negotiation is required for a system to use the independent-bridge model, it is strongly recommended that systems using this model negotiate the Line-Identification Configuration Option. Doing so will verify correct configuration of the LAN Segment Id assigned to the line.",
      "ja": "システムが独立したブリッジモデルを使用するには、オプション交渉は必要ありませんが、このモデルを使用するシステムがライン識別構成オプションをネゴシエートすることを強くお勧めします。そうすることで、ラインに割り当てられたLANセグメントIDの正しい構成が確認されます。"
    },
    {
      "indent": 3,
      "text": "When two PPP systems use the split-bridge model, the system that transmits an Explorer frame onto the PPP link MUST update the RIF on behalf of the two systems. The purpose of this constraint is to ensure interoperability and to preserve the simplicity of the bridging algorithm. For example, if the receiving system did not know whether the transmitting system had updated the RIF, it would have to scan the RIF and decide whether to update it. The choice of the transmitting system for the role of updating the RIF allows the system receiving the frame from the PPP link to forward the frame without processing the RIF.",
      "ja": "2つのPPPシステムがスプリットブリッジモデルを使用する場合、ExplorerフレームをPPPリンクに送信するシステムは、2つのシステムに代わってRIFを更新する必要があります。この制約の目的は、相互運用性を確保し、ブリッジングアルゴリズムの単純さを維持することです。たとえば、受信システムが送信システムがRIFを更新したかどうかを知らなかった場合、RIFをスキャンして更新するかどうかを決定する必要があります。RIFを更新する役割のための送信システムの選択により、PPPリンクからフレームを受信するシステムがRIFを処理せずにフレームを転送することができます。"
    },
    {
      "indent": 3,
      "text": "Given that source routing is configured on a line or set of lines, the specifics of the link state with respect to STE frames are defined by the Spanning Tree Protocol in use. Choice of the split- bridge or independent-bridge model does not affect spanning tree operation. In both cases, the spanning tree protocol is executed on the two systems independently.",
      "ja": "ソースルーティングが行または線のセットで構成されていることを考えると、STEフレームに関するリンク状態の詳細は、使用中のスパニングツリープロトコルによって定義されます。スプリットブリッジまたは独立橋モデルの選択は、スパニングツリー操作に影響しません。どちらの場合も、スパニングツリープロトコルは2つのシステムで個別に実行されます。"
    },
    {
      "indent": 0,
      "text": "2.5. SR-TB Translational Bridging",
      "section_title": true,
      "ja": "2.5. SR-TB翻訳ブリッジング"
    },
    {
      "indent": 3,
      "text": "IEEE 802 is not currently addressing bridges that translate between Transparent Bridging and Source Routing. For the purposes of this standard, such a device is either a Transparent or a Source Routing bridge, and will act on the line in one of these two ways, just as it does on the LAN.",
      "ja": "IEEE 802は現在、透明なブリッジングとソースルーティングの間に翻訳されるブリッジに対処していません。この標準の目的のために、このようなデバイスは透明またはソースルーティングブリッジのいずれかであり、LANと同様に、これら2つの方法のいずれかでラインに作用します。"
    },
    {
      "indent": 0,
      "text": "3. Traffic Services",
      "section_title": true,
      "ja": "3. 交通サービス"
    },
    {
      "indent": 3,
      "text": "Several services are provided for the benefit of different system types and user configurations. These include LAN Frame Checksum Preservation, LAN Frame Checksum Generation, Tinygram Compression, and the identification of closed sets of LANs.",
      "ja": "さまざまなシステムタイプとユーザー構成の利益のために、いくつかのサービスが提供されています。これらには、LANフレームチェックサムの保存、LANフレームチェックサム生成、Tinygram圧縮、およびLANの閉じたセットの識別が含まれます。"
    },
    {
      "indent": 0,
      "text": "3.1. LAN Frame Checksum Preservation",
      "section_title": true,
      "ja": "3.1. LANフレームチェックサム保存"
    },
    {
      "indent": 3,
      "text": "IEEE 802.1 stipulates that the Extended LAN must enjoy the same probability of undetected error that an individual LAN enjoys. Although there has been considerable debate concerning the algorithm, no other algorithm has been proposed than having the LAN Frame Checksum received by the ultimate receiver be the same value calculated by the original transmitter. Achieving this requires, of course, that the line protocols preserve the LAN Frame Checksum from end to end. The protocol is optimized towards this approach.",
      "ja": "IEEE 802.1は、拡張されたLANが個々のLANが享受する検出されないエラーの可能性を享受しなければならないことを規定しています。アルゴリズムに関してかなりの議論がありましたが、究極の受信機が受け取ったLANフレームチェックサムを元の送信機によって計算された同じ値と同じ値とするよりも、他のアルゴリズムは提案されていません。これを達成するには、もちろん、ラインプロトコルがLANフレームチェックサムを端から端まで保存する必要があります。プロトコルはこのアプローチに向けて最適化されています。"
    },
    {
      "indent": 0,
      "text": "3.2. Traffic having no LAN Frame Checksum",
      "section_title": true,
      "ja": "3.2. LANフレームチェックサムがないトラフィック"
    },
    {
      "indent": 3,
      "text": "The fact that the protocol is optimized towards LAN Frame Checksum preservation raises twin questions: \"What is the approach to be used by systems which, for whatever reason, cannot easily support Frame Checksum preservation?\" and \"What is the approach to be used when the system originates a message, which therefore has no Frame Checksum precalculated?\".",
      "ja": "プロトコルがLANフレームチェックサム保存に最適化されているという事実は、ツインの質問を提起します。「何らかの理由でフレームチェックサムの保存を簡単にサポートできないシステムが使用するアプローチは何ですか？」「システムがメッセージを発信する場合に使用されるアプローチは何ですか。したがって、フレームチェックサムが事前に計算されていませんか？」。"
    },
    {
      "indent": 3,
      "text": "Surely, one approach would be to require stations to calculate the Frame Checksum in software if hardware support were unavailable; this would meet with profound dismay, and would raise serious questions of interpretation in a Bridge/Router.",
      "ja": "確かに、1つのアプローチは、ハードウェアサポートが利用できない場合は、ソフトウェアのフレームチェックサムを計算するためにステーションを要求することです。これは非常に大きな落胆に満ち、ブリッジ/ルーターでの解釈の深刻な疑問を提起するでしょう。"
    },
    {
      "indent": 3,
      "text": "However, stations which implement LAN Frame Checksum preservation must already solve this problem, as they do originate traffic. Therefore, the solution adopted is that messages which have no Frame Checksum are tagged and carried across the line.",
      "ja": "ただし、LANフレームチェックサムの保存を実装するステーションは、トラフィックが発生するため、この問題をすでに解決する必要があります。したがって、採用されているソリューションは、フレームチェックサムのないメッセージがタグ付けされ、ライン全体に運ばれることです。"
    },
    {
      "indent": 3,
      "text": "When a system which does not implement LAN Frame Checksum preservation receives a frame having an embedded FCS, it converts it for its own use by removing the trailing four octets. When any system forwards a frame which contains no embedded FCS to a LAN, it forwards it in a way which causes the FCS to be calculated.",
      "ja": "LANフレームチェックサム保存を実装していないシステムが、埋め込まれたFCSを持つフレームを受信すると、トレーリングする4オクテットを削除することにより、独自の使用のために変換します。システムが埋め込まれたFCSをLANに含むフレームを転送すると、FCを計算する方法で転送します。"
    },
    {
      "indent": 0,
      "text": "3.3. Tinygram Compression",
      "section_title": true,
      "ja": "3.3. Tinygram圧縮"
    },
    {
      "indent": 3,
      "text": "An issue in remote Ethernet bridging is that the protocols that are most attractive to bridge are prone to problems on low speed (64 KBPS and below) lines. This can be partially alleviated by observing that the vendors defining these protocols often fill the PDU with octets of ZERO. Thus, an Ethernet or IEEE 802.3 PDU received from a line that is (1) smaller than the minimum PDU size, and (2) has a LAN Frame Checksum present, must be padded by inserting zeroes between the last four octets and the rest of the PDU before transmitting it on a LAN. These protocols are frequently used for interactive sessions, and therefore are frequently this small.",
      "ja": "リモートイーサネットブリッジングの問題は、ブリッジにとって最も魅力的なプロトコルは、低速（64 kbps以下）の問題に起因する傾向があることです。これは、これらのプロトコルを定義するベンダーがPDUをゼロのオクテットで満たすことが多いことを観察することにより、部分的に軽減できます。したがって、（1）最小PDUサイズよりも小さいラインから受け取ったイーサネットまたはIEEE 802.3 PDUは、（2）LANフレームチェックサムが存在する場合は、最後の4つのオクテットと残りの部分の間にゼロを挿入することでパッドで埋めなければなりません。LANに送信する前のPDU。これらのプロトコルは、インタラクティブセッションに頻繁に使用されるため、しばしばこの小規模です。"
    },
    {
      "indent": 3,
      "text": "To prevent ambiguity, PDUs requiring padding are explicitly tagged. Compression is at the option of the transmitting station, and is probably performed only on low speed lines, perhaps under configuration control.",
      "ja": "あいまいさを防ぐために、パディングを必要とするPDUは明示的にタグ付けされます。圧縮は送信ステーションのオプションにあり、おそらく構成制御下では、おそらく低速線でのみ実行されます。"
    },
    {
      "indent": 3,
      "text": "The pseudo-code in Appendix B describes the algorithms.",
      "ja": "付録Bの擬似コードでは、アルゴリズムについて説明しています。"
    },
    {
      "indent": 0,
      "text": "3.4. Virtual LANs",
      "section_title": true,
      "ja": "3.4. 仮想ラン"
    },
    {
      "indent": 3,
      "text": "IEEE 802.1Q defines Virtual LANs and their exchangeable VLAN Tagged frame format. Virtual LANs allow user multiple community groups to co-exist within one bridge. A bridging community is identified by its VLAN ID. If a system that supports Virtual LANs receives a frame from the LAN, that frame will be only emitted onto a LAN which belongs to the same community. In order to handle multiple communities on a single line, IEEE 802.1Q defines a VLAN Tagged Frame.",
      "ja": "IEEE 802.1Qは、仮想LANと交換可能なVLANタグ付きフレーム形式を定義します。仮想LANにより、ユーザー複数のコミュニティグループが1つのブリッジ内で共存することができます。ブリッジングコミュニティは、VLAN IDによって識別されます。仮想LANをサポートするシステムがLANからフレームを受信する場合、そのフレームは同じコミュニティに属するLANにのみ放出されます。単一の行で複数のコミュニティを処理するために、IEEE 802.1QはVLANタグ付きフレームを定義します。"
    },
    {
      "indent": 3,
      "text": "For example, suppose you have the following configuration:",
      "ja": "たとえば、次の構成があるとします。"
    },
    {
      "indent": 3,
      "text": "     E1     +--+            +--+     E3\n------------|  |            |  |------------\n            |  |     W1     |  |\n            |B1|------------|B2|\n     E2     |  |            |  |     E4\n------------|  |            |  |------------\n            +--+            +--+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "E1, E2, E3, and E4 are Ethernet LANs (or Token Ring, FDDI, etc.). W1 is a WAN (PPP over T1). B1 and B2 are MAC level bridges.",
      "ja": "E1、E2、E3、およびE4はイーサネットLAN（またはトークンリング、FDDIなど）です。W1はWANです（T1を超えるPPP）。B1とB2はMACレベルの橋です。"
    },
    {
      "indent": 3,
      "text": "You want End Stations on E1 and E3 to communicate, and you want End Stations on E2 and E4 to communicate, but you do not want End Stations on E1 and E3 to communicate with End Stations on E2 and E4.",
      "ja": "E1とE3のエンドステーションに通信したい場合があり、E2とE4のエンドステーションに通信したいのですが、E1とE3のエンドステーションにE2とE4のエンドステーションと通信する必要はありません。"
    },
    {
      "indent": 3,
      "text": "This is true for Unicast, Multicast, and Broadcast traffic. If a broadcast datagram originates on E1, you want it only to be propagated to E3, and not on E2 or E4.",
      "ja": "これは、ユニキャスト、マルチキャスト、ブロードキャストトラフィックに当てはまります。ブロードキャストデータグラムがE1で発生する場合、E2またはE4ではなくE3にのみ伝播する必要があります。"
    },
    {
      "indent": 3,
      "text": "Another way of looking at it is that E1 and E3 form a Virtual LAN, and E2 and E4 form a Virtual LAN, as if the following configuration were actually being used:",
      "ja": "それを見る別の方法は、E1とE3が仮想LANを形成し、E2とE4が仮想LANを形成することです。まるで次の構成が実際に使用されているかのように："
    },
    {
      "indent": 3,
      "text": "     E1     +--+     W2     +--+     E3\n------------|B3|------------|B4|------------\n            +--+            +--+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "     E2     +--+     W3     +--+     E4\n------------|B5|------------|B6|------------\n            +--+            +--+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "3.5. Bridge Control Packet Indicator",
      "section_title": true,
      "ja": "3.5. ブリッジコントロールパケットインジケーター"
    },
    {
      "indent": 3,
      "text": "The Bridge Control Packet Indicator option is used to classify bridge control packets such as Spanning Tree BPDUs, GARP PDUs, etc. Protocols such as STP and GARP is to the bridging world as OSPF or BGP is to the routing world. Just as IP route update packets are marked with an IP precedence value of 6 or 7 and given preferential forwarding treatment [13], bridge control packets are marked in a similar fashion with the Bridge Control Packet Indicator bit.",
      "ja": "ブリッジコントロールパケットインジケーターオプションは、スパニングツリーBPDU、GARP PDUなどのブリッジ制御パケットを分類するために使用されます。STPやGARPなどのプロトコルは、OSPFやBGPがルーティングの世界にあるため、ブリッジングの世界にあります。IPルートの更新パケットにIPの優先順位値が6または7でマークされ、優先的な転送処理が与えられたように[13]、ブリッジコントロールパケットはブリッジコントロールパケットインジケータービットと同様の方法でマークされます。"
    },
    {
      "indent": 3,
      "text": "If the Bridge Control Packet Indicator option is enabled, a system MUST set a packet's Bridge Control Packet Indicator bit in the flags field to 1 if and only if it is an outgoing bridge control frame. Furthermore, a system MUST avoid dropping or significantly delaying bridge control packets.",
      "ja": "ブリッジ制御パケットインジケータオプションが有効になっている場合、システムは、発信ブリッジ制御フレームである場合にのみ、フラグフィールドにパケットのブリッジ制御パケットインジケータービットを1に設定する必要があります。さらに、システムは、ブリッジ制御パケットのドロップまたは大幅な遅延を避ける必要があります。"
    },
    {
      "indent": 3,
      "text": "If the Bridge Control Packet Indicator option is disabled, a system MUST set the Bridge Control Packet Indicator bit to 0 for all frames. This preserves backward compatibility with RFC 2878 [14]. However, even if this option is disabled, a system SHOULD still avoid dropping or significantly delaying bridge control packets. This can be achieved through parsing the Destination MAC address field.",
      "ja": "ブリッジ制御パケットインジケータオプションが無効になっている場合、システムはすべてのフレームのブリッジ制御パケットインジケータービットを0に設定する必要があります。これにより、RFC 2878との後方互換性が保持されます[14]。ただし、このオプションが無効になっていても、システムはブリッジ制御パケットの削除または大幅な遅延を避ける必要があります。これは、宛先MACアドレスフィールドを解析することで実現できます。"
    },
    {
      "indent": 0,
      "text": "4. A PPP Network Control Protocol for Bridging",
      "section_title": true,
      "ja": "4. ブリッジング用のPPPネットワーク制御プロトコル"
    },
    {
      "indent": 3,
      "text": "The Bridging Control Protocol (BCP) is responsible for configuring, enabling and disabling the bridge protocol modules on both ends of the point-to-point link. BCP uses the same packet exchange mechanism as the Link Control Protocol. BCP packets may not be exchanged until PPP has reached the Network-Layer Protocol phase. BCP packets received before this phase is reached SHOULD be silently discarded.",
      "ja": "ブリッジング制御プロトコル（BCP）は、ポイントツーポイントリンクの両端でブリッジプロトコルモジュールの構成、有効化、および無効化を担当します。BCPは、リンク制御プロトコルと同じパケット交換メカニズムを使用します。BCPパケットは、PPPがネットワーク層プロトコルフェーズに達するまで交換されない場合があります。このフェーズに到達する前に受け取ったBCPパケットは、静かに廃棄する必要があります。"
    },
    {
      "indent": 3,
      "text": "The Bridging Control Protocol is exactly the same as the Link Control Protocol [6] with the following exceptions:",
      "ja": "ブリッジング制御プロトコルは、次の例外を除いて、リンク制御プロトコル[6]とまったく同じです。"
    },
    {
      "indent": 3,
      "text": "Frame Modifications",
      "ja": "フレームの変更"
    },
    {
      "indent": 6,
      "text": "The packet may utilize any modifications to the basic frame format which have been negotiated during the Link Establishment phase.",
      "ja": "パケットは、リンク確立段階でネゴシエートされた基本フレーム形式の変更を使用する場合があります。"
    },
    {
      "indent": 6,
      "text": "Implementations SHOULD NOT negotiate Address-and-Control-Field-Compression or Protocol-Field-Compression on other than low speed links.",
      "ja": "実装は、低速リンク以外の住所とコントロールフィールドの圧縮またはプロトコルフィールド圧縮を交渉すべきではありません。"
    },
    {
      "indent": 3,
      "text": "Data Link Layer Protocol Field",
      "ja": "データリンクレイヤープロトコルフィールド"
    },
    {
      "indent": 6,
      "text": "Exactly one BCP packet is encapsulated in the PPP Information field, where the PPP Protocol field indicates type hex 8031 (BCP).",
      "ja": "正確に1つのBCPパケットがPPP情報フィールドにカプセル化されており、PPPプロトコルフィールドはタイプHex 8031（BCP）を示しています。"
    },
    {
      "indent": 3,
      "text": "Code field",
      "ja": "コードフィールド"
    },
    {
      "indent": 6,
      "text": "Only Codes 1 through 7 (Configure-Request, Configure-Ack, Configure-Nak, Configure-Reject, Terminate-Request, Terminate-Ack and Code-Reject) are used. Other Codes SHOULD be treated as unrecognized and SHOULD result in Code-Rejects.",
      "ja": "コード1〜7のみ（Configure-Request、configure-ack、configure-nak、configure-reject、terminate-request、exerinate-cack、code-reject）が使用されます。他のコードは認識されていないものとして扱われるべきであり、コード抵抗をもたらす必要があります。"
    },
    {
      "indent": 3,
      "text": "Timeouts",
      "ja": "タイムアウト"
    },
    {
      "indent": 6,
      "text": "BCP packets may not be exchanged until PPP has reached the Network-Layer Protocol phase. An implementation SHOULD be prepared to wait for Authentication and Link Quality Determination to finish before timing out waiting for a Configure-Ack or other response. It is suggested that an implementation give up only after user intervention or a configurable amount of time.",
      "ja": "BCPパケットは、PPPがネットワーク層プロトコルフェーズに達するまで交換されない場合があります。認証を待つように実装を準備し、Configure-ackまたはその他の応答を待つタイミングを出す前に、品質決定をリンクする必要があります。実装は、ユーザーの介入または構成可能な時間の後にのみあきらめることが示唆されています。"
    },
    {
      "indent": 3,
      "text": "Configuration Option Types",
      "ja": "構成オプションタイプ"
    },
    {
      "indent": 6,
      "text": "BCP has a distinct set of Configuration Options, which are defined in this document.",
      "ja": "BCPには、このドキュメントで定義されている一連の構成オプションがあります。"
    },
    {
      "indent": 0,
      "text": "4.1. Sending Bridge Frames",
      "section_title": true,
      "ja": "4.1. ブリッジフレームの送信"
    },
    {
      "indent": 3,
      "text": "Before any Bridged LAN Traffic or BPDUs may be communicated, PPP MUST reach the Network-Layer Protocol phase, and the Bridging Control Protocol MUST reach the Opened state.",
      "ja": "ブリッジ付きLANトラフィックまたはBPDUSが通信される前に、PPPはネットワーク層プロトコルフェーズに到達する必要があり、ブリッジング制御プロトコルはオープン状態に到達する必要があります。"
    },
    {
      "indent": 3,
      "text": "Exactly one Bridged LAN Traffic or BPDU is encapsulated in the PPP Information field, where the PPP Protocol field indicates type hex 0031 (Bridged PDU).",
      "ja": "正確に1つのブリッジ付きLANトラフィックまたはBPDUがPPP情報フィールドにカプセル化されており、PPPプロトコルフィールドはタイプHEX 0031（ブリッジPDU）を示しています。"
    },
    {
      "indent": 0,
      "text": "4.1.1. Maximum Receive Unit Considerations",
      "section_title": true,
      "ja": "4.1.1. 最大受信単位の考慮事項"
    },
    {
      "indent": 3,
      "text": "The maximum length of a Bridged datagram transmitted over a PPP link is the same as the maximum length of the Information field of a PPP encapsulated packet. Since there is no standard method for fragmenting and reassembling Bridged PDUs, PPP links supporting Bridging MUST negotiate an MRU large enough to support the MAC Types that are later negotiated for Bridging support. Because they include the MAC headers, even bridged Ethernet frames are larger than the default PPP MRU of 1500 octets.",
      "ja": "PPPリンク上に送信されたブリッジ付きデータグラムの最大長は、PPPカプセル化されたパケットの情報フィールドの最大長と同じです。ブリッジされたPDUを断片化して再組み立てするための標準的な方法がないため、ブリッジングをサポートするPPPリンクは、後にブリッジングサポートのためにネゴシエートされたMACタイプをサポートするのに十分な大きさのMRUと交渉する必要があります。MACヘッダーが含まれるため、ブリッジされたイーサネットフレームでさえ、1500オクテットのデフォルトのPPP MRUよりも大きいです。"
    },
    {
      "indent": 0,
      "text": "4.1.2. Loopback and Link Quality Monitoring",
      "section_title": true,
      "ja": "4.1.2. ループバックとリンクの品質監視"
    },
    {
      "indent": 3,
      "text": "It is strongly recommended that PPP Bridge Protocol implementations utilize Magic Number Loopback Detection and Link-Quality-Monitoring. The 802.1 Spanning Tree protocol, which is integral to both Transparent Bridging and Source Routing (as standardized), is unidirectional during normal operation. Configuration BPDUs emanate from the Root system in the general direction of the leaves, without any reverse traffic except in response to network events.",
      "ja": "PPPブリッジプロトコルの実装では、マジックナンバーループバックの検出とリンク品質モニタリングを利用することを強くお勧めします。透明なブリッジングとソースルーティング（標準化された）の両方に不可欠な802.1スパニングツリープロトコルは、通常の動作中に一方向です。構成bpdusは、ネットワークイベントに応じて除く逆トラフィックなしで、葉の一般的な方向にルートシステムから発生します。"
    },
    {
      "indent": 0,
      "text": "4.1.3. Message Sequence",
      "section_title": true,
      "ja": "4.1.3. メッセージシーケンス"
    },
    {
      "indent": 3,
      "text": "The multiple link case requires consideration of message sequentiality. The transmitting system may determine either that the protocol being bridged requires transmissions to arrive in the order of their original transmission, and enqueue all transmissions on a given conversation onto the same link to force order preservation, or that the protocol does NOT require transmissions to arrive in the order of their original transmission, and use that knowledge to optimize the utilization of several links, enqueuing traffic to multiple links to minimize delay.",
      "ja": "複数のリンクケースでは、メッセージの順次を考慮する必要があります。送信システムは、橋渡しされているプロトコルには元の伝送の順序で送信が必要であること、および特定の会話ですべての送信が同じリンクに到着する必要があることを決定する場合があります。元の送信の順序で、その知識を使用していくつかのリンクの使用率を最適化し、遅延を最小限に抑えるために複数のリンクにトラフィックをエンキューします。"
    },
    {
      "indent": 3,
      "text": "In the absence of such a determination, the transmitting system MUST act as though all protocols require order preservation. Many protocols designed primarily for use on a single LAN require order preservation.",
      "ja": "このような決定がない場合、送信システムは、すべてのプロトコルには順序の保存が必要であるかのように動作する必要があります。主に単一のLANで使用するために設計された多くのプロトコルには、注文保存が必要です。"
    },
    {
      "indent": 3,
      "text": "PPP Multilink [7] and its multi-class extension [11] may be used to allow the use of multiple PPP links between a pair of systems without loss of message sequentiality. It treats the group of links as a single link with speed equal to the sum of the speeds of the links in the group.",
      "ja": "PPP MultiLink [7]およびそのマルチクラス拡張[11]を使用して、メッセージの順次を失うことなく、システム間で複数のPPPリンクを使用できるようにすることができます。リンクのグループを、グループ内のリンクの速度の合計に等しい速度を持つ単一のリンクとして扱います。"
    },
    {
      "indent": 0,
      "text": "4.1.4. Separation of Spanning Tree Domains",
      "section_title": true,
      "ja": "4.1.4. スパニングツリードメインの分離"
    },
    {
      "indent": 3,
      "text": "It is conceivable that a network manager might wish to inhibit the exchange of BPDUs on a link in order to logically divide two regions into separate Spanning Trees with different Roots (and potentially different Spanning Tree implementations or algorithms). In order to do that, he should configure both ends to not exchange BPDUs on a link. An implementation that does not support any spanning tree protocol MUST silently discard any received IEEE 802.1D BPDU packets.",
      "ja": "ネットワークマネージャーは、2つの領域を異なる根（および潜在的に異なるスパニングツリーの実装またはアルゴリズム）を持つ別々のスパニングツリーに論理的に分割するために、リンクでのBPDUの交換を阻害することを望むかもしれません。そのためには、リンクでBPDUを交換しないように両端を構成する必要があります。スパニングツリープロトコルをサポートしていない実装は、受け取ったIEEE 802.1D BPDUパケットを静かに廃棄する必要があります。"
    },
    {
      "indent": 3,
      "text": "If a bridge is connected to an old BCP bridge [10], the other bridge cannot operate according to this specification. Options are therefore to decide that:",
      "ja": "ブリッジが古いBCPブリッジ[10]に接続されている場合、この仕様に従って他のブリッジは動作できません。したがって、オプションはそれを決定することです："
    },
    {
      "indent": 3,
      "text": "(a) If the bridge wants to terminate the connection, it sends a Terminate-Request and terminate the connection. (b) If the bridge wants to run the connection but not receive old BPDUs, its only option is to run without spanning tree on the link at all, which is dangerous. It should Configure-Reject the option and advise the network administration that it has done so. (c) If the bridge chooses to be entirely backward compatible, it sends Configure-Ack and operates in the manner described in Appendix A.",
      "ja": "(a) ブリッジが接続を終了したい場合、それは終了リクエストを送信し、接続を終了します。（b）ブリッジが接続を実行したいが、古いbpdusを受け取らない場合、その唯一のオプションは、リンク上のツリーをまったくスパニングすることなく実行することです。これは危険です。それはオプションをrepredすることを構成し、それがそうしたことをネットワーク管理に助言する必要があります。（c）ブリッジが完全に後方互換性を選択することを選択した場合、付録Aに記載されている方法でconfigure-ackを送信し、動作します。"
    },
    {
      "indent": 3,
      "text": "In the event that both the new Management-Inline Option and the Spanning-Tree-Protocol-Configuration Option are configure-rejected, indicating that the peer implements no spanning tree protocol at all and doesn't understand the options, it is an incomplete implementation. For safety reasons the system should cease attempting to configure bridging, and log the fact. If the peer was configure-rejecting the options in order to disable spanning tree entirely, it understood the option but could not within its configuration comply. It should have sent the Spanning-Tree-Protocol-Configuration Option with the value NULL.",
      "ja": "新しい管理インラインオプションとスパニングトリープロトコル制度構成オプションの両方が設定されている場合、ピアはスパニングツリープロトコルをまったく実装せず、オプションを理解していないことを示していますが、それは不完全な実装です。安全上の理由から、システムはブリッジングの構成を試み、事実を記録する必要があります。ピアがスパニングツリーを完全に無効にするためにオプションを削除している場合、オプションは理解できましたが、その構成内に準拠することはできませんでした。値nullを使用してSpanning-tree-protocol-configurationオプションを送信する必要があります。"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD implement a backward compatibility mode.",
      "ja": "実装は、後方互換モードを実装する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.2. Bridged LAN Traffic (IEEE 802 Untagged Frame)",
      "section_title": true,
      "ja": "4.2. ブリッジ付きLANトラフィック（IEEE 802 Untaggedフレーム）"
    },
    {
      "indent": 3,
      "text": "For Bridging LAN traffic, the format of the frame on the line is shown below. This format is used if the traffic does not include VLAN ID and priority.",
      "ja": "LANトラフィックを橋渡しするために、ライン上のフレームの形式を以下に示します。この形式は、トラフィックにVLAN IDと優先度が含まれていない場合に使用されます。"
    },
    {
      "indent": 3,
      "text": "The fields are transmitted from left to right.",
      "ja": "フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": "802.3 Frame format (IEEE 802 Un-tagged Frame)",
      "ja": "802.3フレーム形式（IEEE 802タグ付きフレーム）"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+\n|   HDLC FLAG   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      Address and Control      |      0x00     |      0x31     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|F|0|Z|B| Pads  |    MAC Type   |      Destination MAC Address  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Destination MAC Address                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Source MAC Address                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source MAC Address        |      Length/Type              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               LLC data       ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   LAN FCS (optional)                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                potential line protocol pad                    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Frame FCS            |   HDLC FLAG   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   802.4/802.5/FDDI Frame format (IEEE 802 Un-tagged Frame)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+\n|   HDLC FLAG   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      Address and Control      |      0x00     |      0x31     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|F|0|Z|B| Pads  |    MAC Type   |   Pad Byte    | Frame Control |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Destination MAC Address                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Destination MAC Address   |  Source MAC Address           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Source MAC Address                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               LLC data       ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   LAN FCS (optional)                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              optional Data Link Layer padding                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Frame FCS            |   HDLC FLAG   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Address and Control",
      "ja": "アドレスと制御"
    },
    {
      "indent": 6,
      "text": "As defined by the framing in use.",
      "ja": "使用中のフレーミングによって定義されています。"
    },
    {
      "indent": 3,
      "text": "PPP Protocol",
      "ja": "PPPプロトコル"
    },
    {
      "indent": 6,
      "text": "0x0031 for PPP Bridging",
      "ja": "PPPブリッジング用の0x0031"
    },
    {
      "indent": 3,
      "text": "Flags",
      "ja": "フラグ"
    },
    {
      "indent": 6,
      "text": "bit F: Set if the LAN FCS Field is present bit 0: reserved, must be zero bit Z: Set if IEEE 802.3 Pad must be zero filled to minimum size bit B: Set if the frame is a bridge control packet. See section 3.5 for details.",
      "ja": "ビットf：LAN FCSフィールドが存在する場合ビット0：予約されている必要があります。ビットZがゼロです：設定IEEE 802.3パッドが最小サイズにゼロに入力する必要がありますビットB：フレームがブリッジコントロールパケットの場合は設定します。詳細については、セクション3.5を参照してください。"
    },
    {
      "indent": 3,
      "text": "Pads",
      "ja": "パッド"
    },
    {
      "indent": 6,
      "text": "Any PPP frame may have padding inserted in the \"Optional Data Link Layer Padding\" field. This number tells the receiving system how many pad octets to strip off.",
      "ja": "PPPフレームには、「オプションのデータリンクレイヤーパディング」フィールドにパディングが挿入されている場合があります。この番号は、受信システムに、剥がれるパッドオクテットの数を指示します。"
    },
    {
      "indent": 3,
      "text": "MAC Type",
      "ja": "Macタイプ"
    },
    {
      "indent": 6,
      "text": "Up-to-date values of the MAC Type field are specified in the most recent \"Assigned Numbers\" RFC [4]. Current values are assigned as follows:",
      "ja": "MACタイプフィールドの最新の値は、最新の「割り当てられた数字」RFCで指定されています[4]。現在の値は次のように割り当てられます。"
    },
    {
      "indent": 6,
      "text": "   0: reserved\n   1: IEEE 802.3/Ethernet  with canonical addresses\n   2: IEEE 802.4           with canonical addresses\n   3: IEEE 802.5           with non-canonical addresses\n   4: FDDI                 with non-canonical addresses\n5-10: reserved\n  11: IEEE 802.5           with canonical addresses\n  12: FDDI                 with canonical addresses",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "\"Canonical\" is the address format defined as standard address representation by the IEEE. In this format, the bit within each byte that is to be transmitted first on a LAN is represented as the least significant bit. In contrast, in non-canonical form, the bit within each byte that is to be transmitted first is represented as the most-significant bit. Many LAN interface implementations use non-canonical form. In both formats, bytes are represented in the order of transmission.",
      "ja": "「Canonical」は、IEEEによって標準のアドレス表現として定義されるアドレス形式です。この形式では、LANに最初に送信される各バイト内のビットは、最も重要なビットとして表されます。対照的に、非標準形式では、最初に送信される各バイト内のビットは、最も重要なビットとして表されます。多くのLANインターフェイスの実装は、非カノニカルフォームを使用しています。両方の形式で、バイトは伝送の順に表されます。"
    },
    {
      "indent": 6,
      "text": "If an implementation supports a MAC Type that is the higher-numbered format of that MAC Type, then it MUST also support the lower-numbered format of that MAC Type. For example, if an implementation supports FDDI with canonical address format, then it MUST also support FDDI with non-canonical address format. The purpose of this requirement is to provide backward compatibility with earlier versions of this specification.",
      "ja": "実装がそのMACタイプの高度な形式であるMACタイプをサポートする場合、そのMacタイプのより少ない数の形式もサポートする必要があります。たとえば、実装が標準的なアドレス形式でFDDIをサポートする場合、非標準アドレス形式でFDDIもサポートする必要があります。この要件の目的は、この仕様の以前のバージョンとの逆方向の互換性を提供することです。"
    },
    {
      "indent": 6,
      "text": "A system MUST NOT transmit a MAC Type numbered higher than 4 unless it has received from its peer a MAC-Support Configuration Option indicating that the peer is willing to receive frames of that MAC Type.",
      "ja": "システムは、ピアがそのMacタイプのフレームを受け取ることをいとわないことを示す、ピアからMac-Support構成オプションを受け取っていない限り、4を超える番号が高いMacタイプを送信してはなりません。"
    },
    {
      "indent": 3,
      "text": "Frame Control",
      "ja": "フレーム制御"
    },
    {
      "indent": 6,
      "text": "On 802.4, 802.5, and FDDI LANs, there are a few octets preceding the Destination MAC Address, one of which is protected by the FCS.",
      "ja": "802.4、802.5、およびFDDI LANSには、宛先MACアドレスの前にいくつかのオクテットがあり、そのうちの1つはFCSによって保護されています。"
    },
    {
      "indent": 6,
      "text": "The MAC Type of the frame determines the contents of the Frame Control field. A pad octet is present to provide 32-bit packet alignment.",
      "ja": "フレームのMacタイプは、フレーム制御フィールドの内容を決定します。32ビットパケットアライメントを提供するために、パッドオクテットが存在します。"
    },
    {
      "indent": 3,
      "text": "Destination MAC Address",
      "ja": "宛先Macアドレス"
    },
    {
      "indent": 6,
      "text": "As defined by the IEEE. The MAC Type field defines the bit ordering.",
      "ja": "IEEEによって定義されています。Macタイプのフィールドは、ビットの順序を定義します。"
    },
    {
      "indent": 3,
      "text": "Source MAC Address",
      "ja": "ソースMACアドレス"
    },
    {
      "indent": 6,
      "text": "As defined by the IEEE. The MAC Type field defines the bit ordering.",
      "ja": "IEEEによって定義されています。Macタイプのフィールドは、ビットの順序を定義します。"
    },
    {
      "indent": 3,
      "text": "LLC data",
      "ja": "LLCデータ"
    },
    {
      "indent": 6,
      "text": "This is the remainder of the MAC frame which is (or would be were it present) protected by the LAN FCS.",
      "ja": "これは、LAN FCSによって保護されている（または存在する）MACフレームの残りです。"
    },
    {
      "indent": 6,
      "text": "For example, the 802.5 Access Control field, and Status Trailer are not meaningful to transmit to another ring, and are omitted.",
      "ja": "たとえば、802.5アクセス制御フィールドとステータストレーラーは、別のリングに送信することに意味がなく、省略されています。"
    },
    {
      "indent": 3,
      "text": "LAN FCS",
      "ja": "LAN FCS"
    },
    {
      "indent": 6,
      "text": "If present, this is the LAN FCS which was calculated by (or which appears to have been calculated by) the originating station. If the LAN FCS flag is not set, then this field is not present, and the PDU is four octets shorter.",
      "ja": "存在する場合、これは元のステーションによって計算された（または計算されたと思われる）LAN FCSです。LAN FCSフラグが設定されていない場合、このフィールドは存在せず、PDUは4オクテットが短くなります。"
    },
    {
      "indent": 3,
      "text": "Optional Data Link Layer Padding",
      "ja": "オプションのデータリンクレイヤーパディング"
    },
    {
      "indent": 6,
      "text": "Any PPP frame may have padding inserted between the Information field and the Frame FCS. The Pads field contains the length of this padding, which may not exceed 15 octets.",
      "ja": "PPPフレームには、情報フィールドとフレームFCSの間にパディングが挿入されている場合があります。パッドフィールドには、このパディングの長さが含まれており、15オクテットを超えない場合があります。"
    },
    {
      "indent": 6,
      "text": "The PPP LCP Extensions [5] specify a self-describing pad. Implementations are encouraged to set the Pads field to zero, and use the self-describing pad instead.",
      "ja": "PPP LCP拡張[5]は、自己記述パッドを指定します。実装は、パッドフィールドをゼロに設定し、代わりに自己記述パッドを使用することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Frame FCS",
      "ja": "フレームFCS"
    },
    {
      "indent": 6,
      "text": "Mentioned primarily for clarity. The FCS used on the PPP link is separate from and unrelated to the LAN FCS.",
      "ja": "主に明確さのために言及されています。PPPリンクで使用されるFCSは、LAN FCSとは別になく、無関係です。"
    },
    {
      "indent": 0,
      "text": "4.3. Bridged LAN Traffic in IEEE 802 Tagged Frame",
      "section_title": true,
      "ja": "4.3. IEEE 802タグ付きフレームのブリッジされたLANトラフィック"
    },
    {
      "indent": 3,
      "text": "To connect two or more Virtual LAN segments, the frame MUST include its VLAN ID and priority. An IEEE 802 Tagged Frame may be used if the IEEE-802-Tagged-Frame Option is accepted by the peer. The format of the frame on the line is shown below.",
      "ja": "2つ以上の仮想LANセグメントを接続するには、フレームにVLAN IDと優先度を含める必要があります。IEEE-802タグ付きフレームオプションがピアによって受け入れられている場合、IEEE 802タグ付きフレームを使用できます。ライン上のフレームの形式を以下に示します。"
    },
    {
      "indent": 3,
      "text": "The fields are transmitted from left to right.",
      "ja": "フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": "802.3 Frame format (IEEE 802 Tagged Frame)",
      "ja": "802.3フレーム形式（IEEE 802タグ付きフレーム）"
    },
    {
      "indent": 3,
      "text": "0                   1                   2                   3\n0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+\n|   HDLC FLAG   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      Address and Control      |      0x00     |      0x31     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|F|0|Z|B| Pads  |    MAC Type   |      Destination MAC Address  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Destination MAC Address                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Source MAC Address                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Source MAC Address        |     0x81       |     0x00     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Pri  |C| VLAN ID               |      Length/Type              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               LLC data       ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   LAN FCS (optional)                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                potential line protocol pad                    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Frame FCS            |   HDLC FLAG   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   802.4/802.5/FDDI Frame format (IEEE 802 Tagged Frame)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+\n|   HDLC FLAG   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      Address and Control      |      0x00     |      0x31     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|F|0|Z|B| Pads  |    MAC Type   |   Pad Byte    | Frame Control |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Destination MAC Address                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Destination MAC Address   |  Source MAC Address           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                       Source MAC Address                      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   SNAP-encoded TPID                           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   SNAP-encoded TPID                           |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|Pri  |C| VLAN ID               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|               LLC data       ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                   LAN FCS (optional)                          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              optional Data Link Layer padding                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Frame FCS            |   HDLC FLAG   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Address and Control",
      "ja": "アドレスと制御"
    },
    {
      "indent": 6,
      "text": "As defined by the framing in use.",
      "ja": "使用中のフレーミングによって定義されています。"
    },
    {
      "indent": 3,
      "text": "PPP Protocol",
      "ja": "PPPプロトコル"
    },
    {
      "indent": 6,
      "text": "0x0031 for PPP Bridging",
      "ja": "PPPブリッジング用の0x0031"
    },
    {
      "indent": 3,
      "text": "Flags",
      "ja": "フラグ"
    },
    {
      "indent": 6,
      "text": "bit F: Set if the LAN FCS Field is present bit 0: reserved, must be zero bit Z: Set if IEEE 802.3 Pad must be zero filled to minimum size bit B: Set if the frame is a bridge control packet. See section 3.5 for details.",
      "ja": "ビットf：LAN FCSフィールドが存在する場合ビット0：予約されている必要があります。ビットZがゼロです：設定IEEE 802.3パッドが最小サイズにゼロに入力する必要がありますビットB：フレームがブリッジコントロールパケットの場合は設定します。詳細については、セクション3.5を参照してください。"
    },
    {
      "indent": 3,
      "text": "Pads",
      "ja": "パッド"
    },
    {
      "indent": 6,
      "text": "Any PPP frame may have padding inserted in the \"Optional Data Link Layer Padding\" field. This number tells the receiving system how many pad octets to strip off.",
      "ja": "PPPフレームには、「オプションのデータリンクレイヤーパディング」フィールドにパディングが挿入されている場合があります。この番号は、受信システムに、剥がれるパッドオクテットの数を指示します。"
    },
    {
      "indent": 3,
      "text": "MAC Type",
      "ja": "Macタイプ"
    },
    {
      "indent": 6,
      "text": "Up-to-date values of the MAC Type field are specified in the most recent \"Assigned Numbers\" RFC [4]. Current values are assigned as follows:",
      "ja": "MACタイプフィールドの最新の値は、最新の「割り当てられた数字」RFCで指定されています[4]。現在の値は次のように割り当てられます。"
    },
    {
      "indent": 6,
      "text": "   0: reserved\n   1: IEEE 802.3/Ethernet  with canonical addresses\n   2: IEEE 802.4           with canonical addresses\n   3: IEEE 802.5           with non-canonical addresses\n   4: FDDI                 with non-canonical addresses\n5-10: reserved\n  11: IEEE 802.5           with canonical addresses\n  12: FDDI                 with canonical addresses",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "\"Canonical\" is the address format defined as standard address representation by the IEEE. In this format, the bit within each byte that is to be transmitted first on a LAN is represented as the least significant bit. In contrast, in non-canonical form, the bit within each byte that is to be transmitted first is represented as the most-significant bit. Many LAN interface implementations use non-canonical form. In both formats, bytes are represented in the order of transmission.",
      "ja": "「Canonical」は、IEEEによって標準のアドレス表現として定義されるアドレス形式です。この形式では、LANに最初に送信される各バイト内のビットは、最も重要なビットとして表されます。対照的に、非標準形式では、最初に送信される各バイト内のビットは、最も重要なビットとして表されます。多くのLANインターフェイスの実装は、非カノニカルフォームを使用しています。両方の形式で、バイトは伝送の順に表されます。"
    },
    {
      "indent": 6,
      "text": "If an implementation supports a MAC Type that is the higher-numbered format of that MAC Type, then it MUST also support the lower-numbered format of that MAC Type. For example, if an implementation supports FDDI with canonical address format, then it MUST also support FDDI with non-canonical address format. The purpose of this requirement is to provide backward compatibility with earlier versions of this specification.",
      "ja": "実装がそのMACタイプの高度な形式であるMACタイプをサポートする場合、そのMacタイプのより少ない数の形式もサポートする必要があります。たとえば、実装が標準的なアドレス形式でFDDIをサポートする場合、非標準アドレス形式でFDDIもサポートする必要があります。この要件の目的は、この仕様の以前のバージョンとの逆方向の互換性を提供することです。"
    },
    {
      "indent": 6,
      "text": "A system MUST NOT transmit a MAC Type numbered higher than 4 unless it has received from its peer a MAC-Support Configuration Option indicating that the peer is willing to receive frames of that MAC Type.",
      "ja": "システムは、ピアがそのMacタイプのフレームを受け取ることをいとわないことを示す、ピアからMac-Support構成オプションを受け取っていない限り、4を超える番号が高いMacタイプを送信してはなりません。"
    },
    {
      "indent": 3,
      "text": "Frame Control",
      "ja": "フレーム制御"
    },
    {
      "indent": 6,
      "text": "On 802.4, 802.5, and FDDI LANs, there are a few octets preceding the Destination MAC Address, one of which is protected by the FCS.",
      "ja": "802.4、802.5、およびFDDI LANSには、宛先MACアドレスの前にいくつかのオクテットがあり、そのうちの1つはFCSによって保護されています。"
    },
    {
      "indent": 6,
      "text": "The MAC Type of the frame determines the contents of the Frame Control field. A pad octet is present to provide 32-bit packet alignment.",
      "ja": "フレームのMacタイプは、フレーム制御フィールドの内容を決定します。32ビットパケットアライメントを提供するために、パッドオクテットが存在します。"
    },
    {
      "indent": 3,
      "text": "Destination MAC Address",
      "ja": "宛先Macアドレス"
    },
    {
      "indent": 6,
      "text": "As defined by the IEEE. The MAC Type field defines the bit ordering.",
      "ja": "IEEEによって定義されています。Macタイプのフィールドは、ビットの順序を定義します。"
    },
    {
      "indent": 3,
      "text": "Source MAC Address",
      "ja": "ソースMACアドレス"
    },
    {
      "indent": 6,
      "text": "As defined by the IEEE. The MAC Type field defines the bit ordering.",
      "ja": "IEEEによって定義されています。Macタイプのフィールドは、ビットの順序を定義します。"
    },
    {
      "indent": 3,
      "text": "Pri",
      "ja": "pri"
    },
    {
      "indent": 6,
      "text": "3 bit priority value as defined by IEEE 802.1D.",
      "ja": "IEEE 802.1dで定義されている3ビット優先値。"
    },
    {
      "indent": 3,
      "text": "C",
      "ja": "c"
    },
    {
      "indent": 6,
      "text": "Canonical flag as defined by IEEE 802.1Q. It must be set if RIF data is present in the LLC data.",
      "ja": "IEEE 802.1Qで定義されている標準フラグ。RIFデータがLLCデータに存在する場合は、設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "VLAN ID",
      "ja": "VLAN ID"
    },
    {
      "indent": 6,
      "text": "12 bit VLAN identifier number as defined by IEEE 802.1Q.",
      "ja": "IEEE 802.1Qで定義されている12ビットVLAN識別子番号。"
    },
    {
      "indent": 3,
      "text": "LLC data",
      "ja": "LLCデータ"
    },
    {
      "indent": 6,
      "text": "This is the remainder of the MAC frame which is (or would be were it present) protected by the LAN FCS.",
      "ja": "これは、LAN FCSによって保護されている（または存在する）MACフレームの残りです。"
    },
    {
      "indent": 6,
      "text": "For example, the 802.5 Access Control field, and Status Trailer are not meaningful to transmit to another ring, and are omitted.",
      "ja": "たとえば、802.5アクセス制御フィールドとステータストレーラーは、別のリングに送信することに意味がなく、省略されています。"
    },
    {
      "indent": 3,
      "text": "LAN FCS",
      "ja": "LAN FCS"
    },
    {
      "indent": 6,
      "text": "If present, this is the LAN FCS which was calculated by (or which appears to have been calculated by) the originating station. If the LAN FCS flag is not set, then this field is not present, and the PDU is four octets shorter.",
      "ja": "存在する場合、これは元のステーションによって計算された（または計算されたと思われる）LAN FCSです。LAN FCSフラグが設定されていない場合、このフィールドは存在せず、PDUは4オクテットが短くなります。"
    },
    {
      "indent": 3,
      "text": "Optional Data Link Layer Padding",
      "ja": "オプションのデータリンクレイヤーパディング"
    },
    {
      "indent": 6,
      "text": "Any PPP frame may have padding inserted between the Information field and the Frame FCS. The Pads field contains the length of this padding, which may not exceed 15 octets.",
      "ja": "PPPフレームには、情報フィールドとフレームFCSの間にパディングが挿入されている場合があります。パッドフィールドには、このパディングの長さが含まれており、15オクテットを超えない場合があります。"
    },
    {
      "indent": 6,
      "text": "The PPP LCP Extensions [5] specify a self-describing pad. Implementations are encouraged to set the Pads field to zero, and use the self-describing pad instead.",
      "ja": "PPP LCP拡張[5]は、自己記述パッドを指定します。実装は、パッドフィールドをゼロに設定し、代わりに自己記述パッドを使用することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Frame FCS",
      "ja": "フレームFCS"
    },
    {
      "indent": 6,
      "text": "Mentioned primarily for clarity. The FCS used on the PPP link is separate from and unrelated to the LAN FCS.",
      "ja": "主に明確さのために言及されています。PPPリンクで使用されるFCSは、LAN FCSとは別になく、無関係です。"
    },
    {
      "indent": 0,
      "text": "4.4. Bridge protocols and GARP protocols",
      "section_title": true,
      "ja": "4.4. ブリッジプロトコルとGARPプロトコル"
    },
    {
      "indent": 3,
      "text": "To avoid network loops and improve redundancy, Bridges exchange a Spanning Tree Protocol data unit known as BPDU. Bridges also exchange a Generic Attributes Registration Protocol data unit to carry the GARP VLAN Registration Protocol (GVRP) data and GARP Multicast Registration Protocol (GMRP). GVRP allow the Bridges to create VLAN groups dynamically. GMRP allows bridges to filter Multicast data if the receiver is absent from the network. These Bridge protocols include Spanning Tree Protocol and GARP protocols data units are carried with a special destination address assigned by the IEEE.",
      "ja": "ネットワークループを回避し、冗長性を向上させるために、BridgesはBPDUとして知られるスパニングツリープロトコルデータユニットを交換します。ブリッジはまた、GERNIC属性登録プロトコルデータユニットを交換して、GARP VLAN登録プロトコル（GVRP）データとGARPマルチキャスト登録プロトコル（GMRP）を運びます。GVRPにより、ブリッジはVLANグループを動的に作成できます。GMRPを使用すると、レシーバーがネットワークに存在しない場合、ブリッジがマルチキャストデータをフィルタリングできます。これらのブリッジプロトコルには、スパニングツリープロトコルとGARPプロトコルデータユニットには、IEEEが割り当てた特別な宛先アドレスが含まれています。"
    },
    {
      "indent": 3,
      "text": "These bridge protocols data units and GARP protocol data units must be carried in the frame format shown in section 4.2 or 4.3. The Bridge that receives these data units identifies these protocols based on the destination address in the frame format, just like the operation of receiving frames from a LAN segment.",
      "ja": "これらのブリッジプロトコルデータユニットとGARPプロトコルデータユニットは、セクション4.2または4.3に示すフレーム形式で実施する必要があります。これらのデータユニットを受信するブリッジは、LANセグメントからフレームを受信する操作と同様に、フレーム形式の宛先アドレスに基づいてこれらのプロトコルを識別します。"
    },
    {
      "indent": 3,
      "text": "Bridge protocols and GARP protocols data units MUST be recognized by checking the destination addresses, which are assigned by IEEE.",
      "ja": "ブリッジプロトコルとGARPプロトコルデータユニットは、IEEEによって割り当てられる宛先アドレスをチェックすることで認識する必要があります。"
    },
    {
      "indent": 6,
      "text": "01-80-c2-00-00-00 Bridge Group Address (used by STP) 01-80-c2-00-00-01 IEEE Std. 802.3x Full Duplex PAUSE operation 01-80-c2-00-00-10 Bridge Management Group Address 01-80-c2-00-00-20 GARP Multicast Registration Protocol (GMRP) 01-80-c2-00-00-21 GARP VLAN Registration Protocol (GVRP)",
      "ja": "01-80-C2-00-00-00ブリッジグループアドレス（STPが使用）01-80-C2-00-00-01 IEEE STD。802.3xフルデュプレックスポーズ操作GARP VLAN登録プロトコル（GVRP）"
    },
    {
      "indent": 3,
      "text": "But there is one exception to this rule: if the bridge is connected to an old BCP bridge [10] and can support backward compatibility, it MUST send the BPDU in the old format described in Appendix A.",
      "ja": "しかし、このルールには1つの例外があります。ブリッジが古いBCPブリッジに接続されており[10]、後方互換性をサポートできる場合、付録Aで説明した古い形式でBPDUを送信する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. BCP Configuration Options",
      "section_title": true,
      "ja": "5. BCP構成オプション"
    },
    {
      "indent": 3,
      "text": "BCP Configuration Options allow modifications to the standard characteristics of the network-layer protocol to be negotiated. If a Configuration Option is not included in a Configure-Request packet, the default value for that Configuration Option is assumed.",
      "ja": "BCP構成オプションにより、ネットワーク層プロトコルの標準特性を変更することができます。構成オプションがConfigure-Requestパケットに含まれていない場合、その構成オプションのデフォルト値が想定されます。"
    },
    {
      "indent": 3,
      "text": "BCP uses the same Configuration Option format defined for LCP [6], with a separate set of Options.",
      "ja": "BCPは、LCP [6]に対して定義された同じ構成オプション形式を使用し、個別のオプションセットを使用します。"
    },
    {
      "indent": 3,
      "text": "Up-to-date values of the BCP Option Type field are specified in the most recent \"Assigned Numbers\" RFC [4]. Current values are assigned as follows:",
      "ja": "BCPオプションタイプフィールドの最新の値は、最新の「割り当てられた数字」RFCで指定されています[4]。現在の値は次のように割り当てられます。"
    },
    {
      "indent": 6,
      "text": " 1 Bridge-Identification 2 Line-Identification 3 MAC-Support 4 Tinygram-Compression 5 LAN-Identification (obsoleted) 6 MAC-Address 7 Spanning-Tree-Protocol (old formatted) 8 IEEE 802 Tagged Frame 9 Management Inline 10 Bridge Control Packet Indicator",
      "ja": "1ブリッジ識別2ラインアイデンティティ3 Mac-Support 4 TinyGram-Compression 5 LAN INDEDIFICITION（OBERETED）6 MAC-ADDRESS 7 SPANNING-TREE-PROTOCOL（OLD FORMATTED）8 IEEE 802タグ付きフレーム9管理10ブリッジコントロールパケットインジケーター"
    },
    {
      "indent": 0,
      "text": "5.1. Bridge-Identification",
      "section_title": true,
      "ja": "5.1. ブリッジ識別"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 6,
      "text": "The Bridge-Identification Configuration Option is designed for use when the line is an interface between half bridges connecting virtual or physical LAN segments. Since these remote bridges are modeled as a single bridge with a strange internal interface, each remote bridge needs to know the LAN segment and bridge numbers of the adjacent remote bridge. This option MUST NOT be included in the same Configure-Request as the Line-Identification option.",
      "ja": "ブリッジ識別構成オプションは、仮想または物理的なLANセグメントを接続するハーフブリッジ間のインターフェースである場合に使用するために設計されています。これらのリモートブリッジは奇妙な内部界面を持つ単一の橋としてモデル化されているため、各リモートブリッジは、隣接するリモートブリッジのLANセグメントとブリッジ番号を知る必要があります。このオプションは、行の識別オプションと同じConfigure-Requestに含めてはなりません。"
    },
    {
      "indent": 6,
      "text": "The Source Routing Route Descriptor and its use are specified by the IEEE 802.1D Appendix on Source Routing. It identifies the segment to which the interface is attached by its configured segment number, and itself by bridge number on the segment.",
      "ja": "ソースルーティングルート記述子とその使用は、ソースルーティングに関するIEEE 802.1d付録によって指定されています。設定されたセグメント番号によってインターフェイスが添付されるセグメントと、セグメント上のブリッジ番号によって識別されます。"
    },
    {
      "indent": 6,
      "text": "The two half bridges MUST agree on the bridge number. If a bridge number is not agreed upon, the Bridging Control Protocol MUST NOT enter the Opened state.",
      "ja": "2つのハーフブリッジは、ブリッジ番号に同意する必要があります。ブリッジ番号が合意されていない場合、ブリッジング制御プロトコルは開いた状態に入ってはなりません。"
    },
    {
      "indent": 6,
      "text": "Since mismatched bridge numbers are indicative of a configuration error, a correct configuration requires that either the bridge declare the misconfiguration or choose one of the options. To allow two systems to proceed to the Opened state despite a mismatch, a system MAY change its bridge number to the higher of the two numbers. A higher-numbered system MUST NOT change its bridge number to a lower number. It should, however, inform the network administration of the misconfiguration in any case.",
      "ja": "不一致のブリッジ番号は構成エラーを示しているため、正しい構成では、ブリッジが誤解を宣言するか、オプションのいずれかを選択する必要があります。2つのシステムがミスマッチにもかかわらず、オープン状態に進むことを許可するために、システムはブリッジ番号を2つの数値のうち高い方に変更する場合があります。より多くの数のシステムは、ブリッジ番号をより低い数に変更してはなりません。ただし、いずれにせよ、ネットワーク管理に誤った状態を通知する必要があります。"
    },
    {
      "indent": 6,
      "text": "By default, a system that does not negotiate this option is assumed to be configured not to use the model of the two systems as two halves of a single source-route bridge. It is instead assumed to be configured to use the model of the two systems as two independent bridges.",
      "ja": "デフォルトでは、このオプションをネゴシエートしないシステムは、2つのシステムのモデルを単一のソースルートブリッジの2つの半分として使用しないように構成されていると想定されています。代わりに、2つのシステムのモデルを2つの独立したブリッジとして使用するように構成されていると想定されています。"
    },
    {
      "indent": 3,
      "text": "Example",
      "ja": "例"
    },
    {
      "indent": 6,
      "text": "If System A announces LAN Segment AAA, Bridge #1, and System B announces LAN Segment BBB, Bridge #1, then the resulting Source Routing configuration (read in the appropriate direction) is then AAA,1,BBB.",
      "ja": "システムAがLANセグメントAAA、ブリッジ＃1、およびシステムBがLANセグメントBBB、ブリッジ＃1を発表した場合、結果のソースルーティング構成（適切な方向に読み取る）はAAA、1、BBBです。"
    },
    {
      "indent": 3,
      "text": "A summary of the Bridge-Identification Option format is shown below. The fields are transmitted from left to right.",
      "ja": "ブリッジ識別オプション形式の概要を以下に示します。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     | LAN Segment Number    |Bridge#|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "1",
      "ja": "1"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "4",
      "ja": "4"
    },
    {
      "indent": 3,
      "text": "LAN Segment Number",
      "ja": "LANセグメント番号"
    },
    {
      "indent": 6,
      "text": "A 12-bit number identifying the LAN segment, as defined in the IEEE 802.1D Source Routing Specification.",
      "ja": "IEEE 802.1Dソースルーティング仕様で定義されているLANセグメントを識別する12ビット番号。"
    },
    {
      "indent": 3,
      "text": "Bridge Number",
      "ja": "ブリッジ番号"
    },
    {
      "indent": 6,
      "text": "A 4-bit number identifying the bridge on the LAN segment, as defined in the IEEE 802.1D Source Routing Specification.",
      "ja": "IEEE 802.1Dソースルーティング仕様で定義されているように、LANセグメントのブリッジを識別する4ビット番号。"
    },
    {
      "indent": 0,
      "text": "5.2. Line-Identification",
      "section_title": true,
      "ja": "5.2. ライン識別"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 6,
      "text": "The Line-Identification Configuration Option is designed for use when the line is assigned a LAN segment number as though it were a two system LAN segment in accordance with the Source Routing algorithm.",
      "ja": "ライン識別構成オプションは、Sourceルーティングアルゴリズムに従って2つのシステムLANセグメントであるかのように、ラインにLANセグメント番号が割り当てられている場合に使用するように設計されています。"
    },
    {
      "indent": 6,
      "text": "The Source Routing Route Descriptor and its use are specified by the IEEE 802.1D Appendix on Source Routing. It identifies the segment to which the interface is attached by its configured segment number, and itself by bridge number on the segment.",
      "ja": "ソースルーティングルート記述子とその使用は、ソースルーティングに関するIEEE 802.1d付録によって指定されています。設定されたセグメント番号によってインターフェイスが添付されるセグメントと、セグメント上のブリッジ番号によって識別されます。"
    },
    {
      "indent": 6,
      "text": "The two bridges MUST agree on the LAN segment number. If a LAN segment number is not agreed upon, the Bridging Control Protocol MUST NOT enter the Opened state.",
      "ja": "2つの橋はLANセグメント番号に同意する必要があります。LANセグメント番号が合意されていない場合、ブリッジング制御プロトコルは開かれた状態に入ってはなりません。"
    },
    {
      "indent": 6,
      "text": "Since mismatched LAN segment numbers are indicative of a configuration error, a correct configuration requires that either the bridge declare the misconfiguration or choose one of the options. To allow two systems to proceed to the Opened state despite a mismatch, a system MAY change its LAN segment number to the higher of the two numbers. A higher-numbered system MUST NOT change its LAN segment number to a lower number. It should, however, inform the network administration of the misconfiguration in any case.",
      "ja": "不一致のLANセグメント番号は構成エラーを示しているため、正しい構成では、ブリッジが誤解を宣言するか、オプションのいずれかを選択する必要があります。ミスマッチにもかかわらず、2つのシステムがオープン状態に進むことを許可するために、システムはLANセグメント番号を2つの数値のうち高いものに変更する場合があります。より数の多いシステムは、LANセグメント数をより低い数値に変更してはなりません。ただし、いずれにせよ、ネットワーク管理に誤った状態を通知する必要があります。"
    },
    {
      "indent": 6,
      "text": "By default, a system that does not negotiate this option is assumed to have its LAN segment number correctly configured by the user.",
      "ja": "デフォルトでは、このオプションをネゴシエートしないシステムは、LANセグメント番号がユーザーによって正しく構成されていると想定されています。"
    },
    {
      "indent": 3,
      "text": "A summary of the Line-Identification Option format is shown below. The fields are transmitted from left to right.",
      "ja": "以下の行を識別するオプション形式の概要を示します。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     | LAN Segment Number    |Bridge#|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "2",
      "ja": "2"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "4",
      "ja": "4"
    },
    {
      "indent": 3,
      "text": "LAN Segment Number",
      "ja": "LANセグメント番号"
    },
    {
      "indent": 6,
      "text": "A 12-bit number identifying the LAN segment, as defined in the IEEE 802.1D Source Routing Specification.",
      "ja": "IEEE 802.1Dソースルーティング仕様で定義されているLANセグメントを識別する12ビット番号。"
    },
    {
      "indent": 3,
      "text": "Bridge Number",
      "ja": "ブリッジ番号"
    },
    {
      "indent": 6,
      "text": "A 4-bit number identifying the bridge on the LAN segment, as defined in the IEEE 802.1D Source Routing Specification.",
      "ja": "IEEE 802.1Dソースルーティング仕様で定義されているように、LANセグメントのブリッジを識別する4ビット番号。"
    },
    {
      "indent": 0,
      "text": "5.3. MAC-Support",
      "section_title": true,
      "ja": "5.3. Mac-Support"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 6,
      "text": "The MAC-Support Configuration Option is provided to permit implementations to indicate the sort of traffic they are prepared to receive. Negotiation of this option is strongly recommended.",
      "ja": "Mac-Support構成オプションは、実装が受信する準備ができている種類のトラフィックを示すことを許可するために提供されます。このオプションの交渉を強くお勧めします。"
    },
    {
      "indent": 6,
      "text": "By default, when an implementation does not announce the MAC Types that it supports, all MAC Types are sent by the peer which are capable of being transported given other configuration parameters. The receiver will discard those MAC Types that it does not support.",
      "ja": "デフォルトでは、実装でサポートするMacタイプを発表しない場合、すべてのMacタイプは、他の構成パラメーターを考慮して輸送できるピアによって送信されます。レシーバーは、サポートしていないMacタイプを破棄します。"
    },
    {
      "indent": 6,
      "text": "A device supporting a 1600 octet MRU might not be willing to support 802.5, 802.4 or FDDI, which each support frames larger than 1600 octets.",
      "ja": "1600オクテットのMRUをサポートするデバイスは、802.5、802.4、またはFDDIをサポートすることをいとわない可能性があります。"
    },
    {
      "indent": 6,
      "text": "By announcing the MAC Types it will support, an implementation is advising its peer that all unspecified MAC Types will be discarded. The peer MAY then reduce bandwidth usage by not sending the unsupported MAC Types.",
      "ja": "サポートするMacタイプを発表することにより、実装は、すべての不特定のMacタイプが破棄されることをピアにアドバイスしています。ピアは、サポートされていないMacタイプを送信しないことにより、帯域幅の使用を減らすことができます。"
    },
    {
      "indent": 6,
      "text": "Announcement of support for multiple MAC Types is accomplished by placing multiple options in the Configure-Request.",
      "ja": "複数のMACタイプのサポートの発表は、Configure-Requestに複数のオプションを配置することで実現されます。"
    },
    {
      "indent": 6,
      "text": "The nature of this option is advisory only. This option MUST NOT be included in a Configure-Nak.",
      "ja": "このオプションの性質はアドバイザリーのみです。このオプションは、configure-nakに含めてはなりません。"
    },
    {
      "indent": 3,
      "text": "A summary of the MAC-Support Option format is shown below. The fields are transmitted from left to right.",
      "ja": "Mac-Supportオプション形式の概要を以下に示します。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     |    MAC Type   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   Type",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "3",
      "ja": "3"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "3",
      "ja": "3"
    },
    {
      "indent": 3,
      "text": "MAC Type",
      "ja": "Macタイプ"
    },
    {
      "indent": 6,
      "text": "One of the values of the PDU MAC Type field (previously described in the \"Bridged LAN Traffic\" section) that this system is prepared to receive and service.",
      "ja": "このシステムが受信およびサービスを提供する準備ができているPDU Macタイプフィールド（以前は「ブリッジ型LANトラフィック」セクションで説明されている）の値の1つ。"
    },
    {
      "indent": 0,
      "text": "5.4. Tinygram-Compression",
      "section_title": true,
      "ja": "5.4. Tinygram-Compression"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 6,
      "text": "This Configuration Option permits the implementation to indicate support for Tinygram compression.",
      "ja": "この構成オプションにより、実装がTinyGram圧縮のサポートを示すことができます。"
    },
    {
      "indent": 6,
      "text": "Not all systems are prepared to make modifications to messages in transit. On high speed lines, it is probably not worth the effort.",
      "ja": "すべてのシステムが、輸送中にメッセージを変更する準備ができているわけではありません。高速ラインでは、おそらく努力する価値はありません。"
    },
    {
      "indent": 6,
      "text": "This option MUST NOT be included in a Configure-Nak if it has been received in a Configure-Request. This option MAY be included in a Configure-Nak in order to prompt the peer to send the option in its next Configure-Request.",
      "ja": "このオプションは、configure-requestで受信されている場合は、configure-nakに含めてはなりません。このオプションは、ピアに次のconfigure-requestでオプションを送信するように促すために、configure-nakに含めることができます。"
    },
    {
      "indent": 6,
      "text": "By default, no compression is allowed. A system which does not negotiate, or negotiates this option to be disabled, should never receive a compressed packet.",
      "ja": "デフォルトでは、圧縮は許可されていません。このオプションを無効にするために交渉しない、または交渉しないシステムは、圧縮されたパケットを受け取ってはなりません。"
    },
    {
      "indent": 3,
      "text": "A summary of the Tinygram-Compression Option format is shown below. The fields are transmitted from left to right.",
      "ja": "TinyGram-Compressionオプション形式の概要を以下に示します。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     | Enable/Disable|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "4",
      "ja": "4"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "3",
      "ja": "3"
    },
    {
      "indent": 3,
      "text": "Enable/Disable",
      "ja": "有効/無効にします"
    },
    {
      "indent": 6,
      "text": "If the value is 1, Tinygram-Compression is enabled. If the value is 2, Tinygram-Compression is disabled, and no decompression will occur.",
      "ja": "値が1の場合、TinyGram-Compressionが有効になります。値が2の場合、Tinygram-Compressionは無効になり、減圧は発生しません。"
    },
    {
      "indent": 6,
      "text": "The implementations need not agree on the setting of this parameter. One may be willing to decompress and the other not.",
      "ja": "実装は、このパラメーターの設定に同意する必要はありません。1つは喜んで減圧し、もう1つは喜んでいないかもしれません。"
    },
    {
      "indent": 0,
      "text": "5.5. MAC-Address",
      "section_title": true,
      "ja": "5.5. Macアドレス"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 6,
      "text": "The MAC-Address Configuration Option enables the implementation to announce its MAC address or have one assigned. The MAC address is represented in IEEE 802.1 Canonical format, which is to say that the multicast bit is the least significant bit of the first octet of the address.",
      "ja": "Mac-Address Configurationオプションを使用すると、実装がMacアドレスを発表するか、1つを割り当てることができます。MACアドレスはIEEE 802.1 Canonical形式で表されます。これは、マルチキャストビットはアドレスの最初のオクテットの中で最も重要ではないことです。"
    },
    {
      "indent": 6,
      "text": "If the system wishes to announce its MAC address, it sends the option with its MAC address specified. When specifying a non-zero MAC address in a Configure-Request, any inclusion of this option in a Configure-Nak MUST be ignored.",
      "ja": "システムがMACアドレスを発表したい場合、MACアドレスを指定したオプションを送信します。Configure-Requestでゼロ以外のMACアドレスを指定する場合、このオプションをConfigure-Nakに含めることは無視する必要があります。"
    },
    {
      "indent": 6,
      "text": "If the implementation wishes to have a MAC address assigned, it sends the option with a MAC address of 00-00-00-00-00-00. Systems that have no mechanism for address assignment will Configure-Reject the option.",
      "ja": "実装にMACアドレスが割り当てられたい場合、MACアドレスが00-00-00-00-00-00でオプションを送信します。アドレス割り当てのメカニズムがないシステムは、オプションを削除します。"
    },
    {
      "indent": 6,
      "text": "A Configure-Nak MUST specify a valid IEEE 802.1 format physical address; the multicast bit MUST be zero. It is strongly recommended (although not mandatory) that the \"locally assigned address\" bit (the second least significant bit in the first octet) be set, indicating a locally assigned address.",
      "ja": "configure-nakは、有効なIEEE 802.1形式の物理アドレスを指定する必要があります。マルチキャストビットはゼロでなければなりません。「ローカルに割り当てられたアドレス」ビット（最初のオクテットで2番目に少ない重要なビット）を設定し、ローカルに割り当てられたアドレスを示すことを強くお勧めします（必須ではありませんが）強く推奨されます。"
    },
    {
      "indent": 3,
      "text": "A summary of the MAC-Address Option format is shown below. The fields are transmitted from left to right.",
      "ja": "Mac-Addressオプション形式の概要を以下に示します。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     |MAC byte 1 |L|M|  MAC byte 2   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  MAC byte 3   |  MAC byte 4   |  MAC byte 5   |  MAC byte 6   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "6",
      "ja": "6"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "8",
      "ja": "8"
    },
    {
      "indent": 3,
      "text": "MAC Byte",
      "ja": "Macバイト"
    },
    {
      "indent": 6,
      "text": "Six octets of MAC address in 802.1 Canonical order. For clarity, the position of the Local Assignment (L) and Multicast (M) bits are shown in the diagram.",
      "ja": "802.1標準的な順序でのMACアドレスの6オクテット。明確にするために、ローカル割り当て（L）とマルチキャスト（M）ビットの位置を図に示します。"
    },
    {
      "indent": 0,
      "text": "5.6. Spanning-Tree-Protocol (old format)",
      "section_title": true,
      "ja": "5.6. Spanning-Tree-Protocol（古い形式）"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 6,
      "text": "The Spanning-Tree-Protocol Configuration enables a Bridge to remain compatible with older implementations of BCP [10]. This configuration option is, however, incompatible with the Management-Inline option, which enables a bridge to implement the many protocols that IEEE now expects a bridge to be able to use.",
      "ja": "Spanning-Tree-Protocol構成により、ブリッジはBCPの古い実装と互換性があり続けることができます[10]。ただし、この構成オプションは、管理インラインオプションと互換性がありません。これにより、ブリッジがブリッジが使用できると予想される多くのプロトコルをブリッジが実装できます。"
    },
    {
      "indent": 6,
      "text": "If the peer rejects the Management-Inline configuration option, by sending configure-reject, it must be an implementation of [10], which is described in Appendix A. The system may optionally terminate the negotiation or offer to negotiate in that manner.",
      "ja": "PeerがManagement-Inline Configurationオプションを拒否した場合、Configure-Rejectを送信することにより、[10]の実装でなければなりません。これについては、付録Aに記載されています。システムは、オプションで交渉を終了するか、その方法でネゴシエートすることを申し出ます。"
    },
    {
      "indent": 6,
      "text": "In this case, if both bridges support a spanning tree protocol, they MUST agree on the protocol to be supported. The old BPDU described in Appendix A MUST be used rather than the format shown in section 4.2 or 4.3. When the two disagree, the lower-numbered of the two spanning tree protocols should be used. To resolve the conflict, the system with the lower-numbered protocol SHOULD Configure-Nak the option, suggesting its own protocol for use. If a spanning tree protocol is not agreed upon, except for the case in which one system does not support any spanning tree protocol, the Bridging Control Protocol MUST NOT enter the Opened state.",
      "ja": "この場合、両方のブリッジがスパニングツリープロトコルをサポートする場合、サポートされるプロトコルに同意する必要があります。付録Aに記載されている古いBPDUは、セクション4.2または4.3に示す形式ではなく、使用する必要があります。2つが同意しない場合、2つのスパニングツリープロトコルの低い数を使用する必要があります。競合を解決するために、より低い数のプロトコルを使用したシステムはオプションを構成し、使用する独自のプロトコルを提案する必要があります。スパニングツリープロトコルが合意されていない場合、1つのシステムがスパニングツリープロトコルをサポートしていない場合を除き、ブリッジング制御プロトコルはオープン状態に入ることはできません。"
    },
    {
      "indent": 6,
      "text": "Most systems will only participate in a single spanning tree protocol. If a system wishes to participate simultaneously in more than one spanning tree protocol, it MAY include all of the appropriate protocol types in a single Spanning-Tree-Protocol Configuration Option. The protocol types MUST be specified in increasing numerical order. For the purpose of comparison during negotiation, the protocol numbers MUST be considered to be a single number. For instance, if System A includes protocols 01 and 03 and System B indicates protocol 03, System B should Configure-Nak and indicate a protocol type of 03 since 0103 is greater than 03.",
      "ja": "ほとんどのシステムは、単一のスパニングツリープロトコルにのみ参加します。システムが複数のスパニングツリープロトコルに同時に参加したい場合、1つのSpanning-Tree-Protocol構成オプションにすべての適切なプロトコルタイプを含めることができます。プロトコルタイプは、数値順序を増やして指定する必要があります。交渉中の比較のために、プロトコル番号は単一の数と見なされる必要があります。たとえば、システムAがプロトコル01および03を含み、システムBがプロトコル03を示している場合、システムBは0103が03より大きいため03のプロトコルタイプを示す必要があります。"
    },
    {
      "indent": 6,
      "text": "By default, an implementation MUST either support the IEEE 802.1D spanning tree or support no spanning tree protocol. An implementation that does not support any spanning tree protocol MUST silently discard any received IEEE 802.1D BPDU packets, and MUST either silently discard or respond to other received BPDU packets with an LCP Protocol-Reject packet in this case.",
      "ja": "デフォルトでは、実装はIEEE 802.1Dスパニングツリーをサポートするか、スパニングツリープロトコルをサポートする必要があります。スパニングツリープロトコルをサポートしていない実装は、受け取ったIEEE 802.1D BPDUパケットを静かに廃棄する必要があり、この場合はLCPプロトコル除去パケットで他の受信したBPDUパケットを静かに廃棄または応答する必要があります。"
    },
    {
      "indent": 3,
      "text": "A summary of the Spanning-Tree-Protocol Option format is shown below. The fields are transmitted from left to right.",
      "ja": "Spanning-Tree-Protocolオプション形式の概要を以下に示します。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-\n|     Type      |    Length     |  Protocol 1   |  Protocol 2   | ..\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "7",
      "ja": "7"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "2 octets plus 1 additional octet for each protocol that will be actively supported. Most systems will only support a single spanning tree protocol, resulting in a length of 3.",
      "ja": "2オクテットと、積極的にサポートされる各プロトコルの追加のオクテット。ほとんどのシステムは、単一のスパニングツリープロトコルのみをサポートし、3の長さになります。"
    },
    {
      "indent": 3,
      "text": "Protocol n",
      "ja": "プロトコルn"
    },
    {
      "indent": 6,
      "text": "Each Protocol field is one octet and indicates a desired spanning tree protocol. Up-to-date values of the Spanning-Tree-Protocol field are specified as PPP DLL numbers in the most recent \"Assigned Numbers\" RFC [4]. Current values are assigned as follows:",
      "ja": "各プロトコルフィールドは1つのオクテットであり、目的のスパニングツリープロトコルを示します。Spanning-Tree-Protocolフィールドの最新の値は、最新の「割り当てられた数字」RFCでPPP DLL番号として指定されています[4]。現在の値は次のように割り当てられます。"
    },
    {
      "indent": 6,
      "text": "Value Protocol",
      "ja": "値プロトコル"
    },
    {
      "indent": 8,
      "text": "0 Null (no Spanning Tree protocol supported) 1 IEEE 802.1D spanning tree 2 IEEE 802.1G extended spanning tree protocol 3 IBM Source Route Spanning tree protocol 4 DEC LANbridge 100 Spanning tree protocol",
      "ja": "0 null（スパニングツリープロトコルはサポートされていません）1 IEEE 802.1dスパンニングツリー2 IEEE 802.1G拡張スパンニングツリープロトコル3 IBMソースルートスパンツリープロトコル"
    },
    {
      "indent": 0,
      "text": "5.7. IEEE-802-Tagged-Frame",
      "section_title": true,
      "ja": "5.7. IEEE-802タグ付きフレーム"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 6,
      "text": "This configuration option permits the implementation to indicate support for IEEE 802 Tagged Frame. Negotiation of this option is strongly recommended.",
      "ja": "この構成オプションにより、実装がIEEE 802タグ付きフレームのサポートを示すことができます。このオプションの交渉を強くお勧めします。"
    },
    {
      "indent": 6,
      "text": "A device supporting IEEE 802 Tagged Frame must be willing to support IEEE 802 Tagged Frame shown in section 4.3.",
      "ja": "IEEE 802タグ付きフレームをサポートするデバイスは、セクション4.3に示すIEEE 802タグ付きフレームをサポートする必要があります。"
    },
    {
      "indent": 6,
      "text": "By default, IEEE 802 Tagged Frame is not supported. A system which does not negotiate, or negotiates this option to be disabled, should never receive a IEEE 802 Tagged Frame.",
      "ja": "デフォルトでは、IEEE 802タグ付きフレームはサポートされていません。このオプションを無効にするために交渉しない、または交渉しないシステムは、IEEE 802タグ付きフレームを受け取ってはいけません。"
    },
    {
      "indent": 3,
      "text": "A summary of the IEEE 802 Tagged Frame Option format is shown below. The fields are transmitted from left to right.",
      "ja": "IEEE 802タグ付きフレームオプション形式の概要を以下に示します。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     | Enable/Disable|\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "8",
      "ja": "8"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "3",
      "ja": "3"
    },
    {
      "indent": 3,
      "text": "Enable/Disable",
      "ja": "有効/無効にします"
    },
    {
      "indent": 6,
      "text": "If the value is 1, IEEE-802-Tagged-Frame is enabled. If the value is 2, IEEE-802-Tagged-Frame is disabled, and MUST not send any IEEE-802-Tagged-Frame packet.",
      "ja": "値が1の場合、IEEE-802タグ付きフレームが有効になります。値が2の場合、IEEE-802タグ付きフレームは無効になり、IEEE-802タグ付きフレームパケットを送信してはなりません。"
    },
    {
      "indent": 0,
      "text": "5.8. Management-Inline",
      "section_title": true,
      "ja": "5.8. 管理インライン"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 6,
      "text": "The Management-Inline Configuration Option indicates that the system is willing to receive any IEEE-defined inter-bridge protocols, such as bridge protocol data units and GARP protocol data units, in the frame format shown in section 4.2 or 4.3.",
      "ja": "マネジメントインライン構成オプションは、セクション4.2または4.3に示すフレーム形式で、ブリッジプロトコルデータユニットやGARPプロトコルデータユニットなどのIEEE定義のインターブリッジ間プロトコルをシステムが受信することをいとわないことを示しています。"
    },
    {
      "indent": 6,
      "text": "Old BCP [10] implementations will use the negotiation procedure described in section 5.6. Implementations of this procedure will use this option to indicate compliance with the new BCP and may optionally negotiate the section 5.6 procedure, either on the same configure-request or in response to a configure-reject, as well. It is recommended that the configure-request only show this option when it is relevant, and that it reply with the Spanning-Tree-Protocol (old formatted) option if a configure-reject is received, as in the normal case one can expect it to be the quickest negotiation.",
      "ja": "古いBCP [10]実装では、セクション5.6で説明されている交渉手順を使用します。この手順の実装では、このオプションを使用して新しいBCPのコンプライアンスを示し、オプションで同じ構成要約またはConfigure-rejectに応じてセクション5.6手順をネゴシエートする場合があります。configure-requestは、関連する場合にのみこのオプションを表示し、通常の場合のようにConfigure-Rejectが受信された場合、Spanning-Tree-Protocol（古いフォーマット）オプションで返信することをお勧めします。最速の交渉になること。"
    },
    {
      "indent": 6,
      "text": "If a system receives a configure-request offering both alternatives, it should accept this procedure and reject the Spanning-Tree-Protocol (old format) option.",
      "ja": "システムが両方の代替品を提供するConfigure-Requestを受信した場合、この手順を受け入れ、Spanning-Tree-Protocol（古い形式）オプションを拒否する必要があります。"
    },
    {
      "indent": 6,
      "text": "One can expect old BCP [10] implementations to not understand the option and issue a configure-reject.",
      "ja": "古いBCP [10]実装がオプションを理解せず、Configure-Rejectを発行することを期待できます。"
    },
    {
      "indent": 6,
      "text": "By default, Management-Inline is not allowed. A system which does not negotiate, or negotiates this option to be disabled, should never receive a Bridge Protocol data unit or GARP protocol data unit inline.",
      "ja": "デフォルトでは、管理インラインは許可されていません。このオプションを無効にして交渉したり交渉したりしないシステムは、ブリッジプロトコルデータユニットまたはGARPプロトコルデータユニットをインラインで受け取らないでください。"
    },
    {
      "indent": 3,
      "text": "A summary of the Management-Inline Option format is shown below. The fields are transmitted from left to right.",
      "ja": "管理インラインオプション形式の概要を以下に示します。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   Type",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "9",
      "ja": "9"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "2",
      "ja": "2"
    },
    {
      "indent": 0,
      "text": "5.9 Bridge-Control-Packet-Indicator",
      "section_title": true,
      "ja": "5.9 ブリッジコントロールパケットインディケーター"
    },
    {
      "indent": 3,
      "text": "Description",
      "ja": "説明"
    },
    {
      "indent": 6,
      "text": "This configuration option permits the implementation to indicate support for Bridge Control Packet Indicator. Negotiation of this option is strongly recommended.",
      "ja": "この構成オプションにより、実装がブリッジ制御パケットインジケーターのサポートを示すことができます。このオプションの交渉を強くお勧めします。"
    },
    {
      "indent": 6,
      "text": "By default, Bridge Control Packet Indicator is not supported. Negotiating this option enables the Bridge Control Packet Indicator. Not negotiating this option disables the Bridge Control Packet Indicator.",
      "ja": "デフォルトでは、ブリッジ制御パケットインジケーターはサポートされていません。このオプションを交渉することにより、ブリッジ制御パケットインジケーターが可能になります。このオプションを交渉しないと、ブリッジ制御パケットインジケーターが無効になります。"
    },
    {
      "indent": 6,
      "text": "A system which does not negotiate MUST never send or receive a frame with the Bridge Control Packet Indicator bit set to 1.",
      "ja": "交渉しないシステムは、ブリッジ制御パケットインジケータービットを1に設定してフレームを送信または受信してはなりません。"
    },
    {
      "indent": 3,
      "text": "A summary of the Bridge Control Packet Indicator option format is shown below. The fields are transmitted from left to right.",
      "ja": "ブリッジ制御パケットインジケータオプション形式の概要を以下に示します。フィールドは左から右に送信されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |    Length     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "10",
      "ja": "10"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "2",
      "ja": "2"
    },
    {
      "indent": 0,
      "text": "6. Changes From RFC 2878",
      "section_title": true,
      "ja": "6. RFC 2878からの変更"
    },
    {
      "indent": 3,
      "text": "This section enumerates changes made to the old RFC [14] to produce this document.",
      "ja": "このセクションでは、古いRFC [14]に加えられた変更を列挙して、このドキュメントを作成します。"
    },
    {
      "indent": 3,
      "text": "(1) Add Bridge Control Packet Indicator to configuration option.",
      "ja": "(1) 設定オプションにブリッジコントロールパケットインジケーターを追加します。"
    },
    {
      "indent": 3,
      "text": "(2) Modify meaning of one of the reserved bits in the flags field.",
      "ja": "(2) フラグフィールド内の予約ビットの1つの意味を変更します。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This network control protocol compares the configurations of two devices and seeks to negotiate an acceptable subset of their intersection, to enable correct interoperation even in the presence of minor configuration or implementation differences. In the event that a major misconfiguration is detected, the negotiation will not complete successfully, resulting in the link coming down or not coming up. It is possible that if a bridged link comes up with a rogue peer, network information may be learned from forwarded multicast traffic, or denial of service attacks may be created by closing loops that should be detected and isolated or by offering rogue load.",
      "ja": "このネットワーク制御プロトコルは、2つのデバイスの構成を比較し、交差点の許容可能なサブセットを交渉し、マイナーな構成または実装の違いが存在する場合でも正しい相互操作を可能にします。大きな誤解が検出された場合、交渉は正常に完了せず、リンクが下がっているか登場しません。Bridgedリンクが不正なピアに登場する場合、転送されたマルチキャストトラフィックからネットワーク情報が学習されるか、検出および分離する必要があるクロージングループまたは不正な負荷を提供することにより、サービス拒否攻撃が作成される可能性があります。"
    },
    {
      "indent": 3,
      "text": "Such attacks are not isolated to this NCP; any PPP NCP is subject to attack when connecting to a foreign or compromised device. However, no situations arise which are not common to all NCPs; any NCP that comes up with a rogue peer is subject to snooping and other attacks. Therefore, it is recommended that links on which this may happen should be configured to use PPP authentication during the LCP start-up phase.",
      "ja": "このような攻撃は、このNCPに分離されていません。PPP NCPは、外国または侵害されたデバイスに接続するときに攻撃の対象となります。ただし、すべてのNCPに共通しない状況は発生しません。不正なピアを思いつくNCPは、スヌーピングやその他の攻撃の対象となります。したがって、これが起こる可能性のあるリンクを、LCP起動フェーズでPPP認証を使用するように構成することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "8. Intellectual Property Notice",
      "section_title": true,
      "ja": "8. 知的財産通知"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、知的財産またはその他の権利の有効性または範囲に関して、この文書に記載されているテクノロジーの実装または使用に関連すると主張される可能性のある他の権利、またはそのような権利に基づくライセンスがどの程度であるかについての程度に関連する可能性があるという立場はありません。利用可能;また、そのような権利を特定するために努力したことも表明していません。標準トラックおよび標準関連のドキュメントの権利に関するIETFの手順に関する情報は、BCP-11に記載されています。出版のために利用可能にされた権利の請求のコピーと、利用可能になるライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得するための試みの結果を取得できますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、関心のある当事者に、この基準を実践するために必要な技術をカバーする可能性のある著作権、特許、または特許出願、またはその他の独自の権利を注意深く招待するよう招待しています。情報をIETFエグゼクティブディレクターに宛ててください。"
    },
    {
      "indent": 3,
      "text": "The IETF has been notified of intellectual property rights claimed in regard to some or all of the specification contained in this document. For more information consult the online list of claimed rights.",
      "ja": "IETFは、このドキュメントに含まれる仕様の一部またはすべてに関して請求された知的財産権について通知されています。詳細については、請求権のオンラインリストを参照してください。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document proposes one new BCP option number to be maintained by the IANA. This option, described in Section 5.9, is Bridge-Control-Packet-Indicator. The IANA has assigned the value 10 for this option.",
      "ja": "このドキュメントでは、IANAによって維持される1つの新しいBCPオプション番号を提案しています。セクション5.9で説明されているこのオプションは、ブリッジコントロールパケットインディケーターです。IANAは、このオプションに値10を割り当てました。"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgments",
      "section_title": true,
      "ja": "10. 謝辞"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Point-to-Point Protocol Extensions Working Group.",
      "ja": "このドキュメントは、ポイントツーポイントプロトコル拡張ワーキンググループの製品です。"
    },
    {
      "indent": 3,
      "text": "This document is based on the PPP Bridging Control Protocol, RFC 2878 [14], edited by Higashiyama and Baker and produced by the Point-to-Point Protocol Extensions Working Group. It extends that document by providing support for Bridge Control Packet Indicator as outlined in section 3.5 and 5.9.",
      "ja": "このドキュメントは、HigashiyamaとBakerが編集し、Point-to-Point Protocol Extensions Working Groupによって作成されたPPPブリッジング制御プロトコルRFC 2878 [14]に基づいています。セクション3.5および5.9で概説されているように、ブリッジ制御パケットインジケーターのサポートを提供することにより、そのドキュメントを拡張します。"
    },
    {
      "indent": 0,
      "text": "Appendices",
      "ja": "付録"
    },
    {
      "indent": 0,
      "text": "A. Spanning Tree Bridge PDU (old format)",
      "ja": "A.スパニングツリーブリッジPDU（古い形式）"
    },
    {
      "indent": 3,
      "text": "By default, Spanning Tree BPDUs MUST be encoded with a MAC or 802.2 LLC header as described in section 4.2 or 4.3 of this document. However, should the remote entity Configure-Reject the Management-Inline option, thereby indicating that it is a purely RFC 1638 compliant device, the local entity may subsequently encode BPDUs as described in section 4.3 of RFC 1638 provided that use of a suitable non-NULL STP protocol across the link is successfully negotiated using the (old) Spanning-Tree-Protocol option.",
      "ja": "デフォルトでは、このドキュメントのセクション4.2または4.3で説明されているように、スパニングツリーBPDUをMACまたは802.2 LLCヘッダーでエンコードする必要があります。ただし、リモートエンティティがマネジメントインラインオプションを構成し、それが純粋にRFC 1638準拠デバイスであることを示している場合、ローカルエンティティは、適切な非非非存在の使用を条件として、RFC 1638のセクション4.3で説明されているようにBPDUをエンコードすることができます。リンク全体のnull STPプロトコルは、（古い）スパニングトリープロトコルオプションを使用して正常にネゴシエートされます。"
    },
    {
      "indent": 3,
      "text": "This is the Spanning Tree BPDU used in RFC 1638, without any MAC or 802.2 LLC header (these being functionally equivalent to the Address, Control, and PPP Protocol Fields). The LAN Pad and Frame Checksum fields are likewise superfluous and absent.",
      "ja": "これは、RFC 1638で使用されるスパニングツリーBPDUであり、MACまたは802.2 LLCヘッダー（これらはアドレス、コントロール、およびPPPプロトコルフィールドと機能的に同等です）。LANパッドとフレームチェックサムフィールドは、同様に余分であり、存在しません。"
    },
    {
      "indent": 3,
      "text": "The Address and Control Fields are subject to LCP Address-and-Control-Field-Compression negotiation.",
      "ja": "アドレスおよび制御フィールドは、LCPのアドレスと制御フィールド圧縮交渉の対象となります。"
    },
    {
      "indent": 3,
      "text": "A PPP system which is configured to participate in a particular spanning tree protocol and receives a BPDU of a different spanning tree protocol SHOULD reject it with the LCP Protocol-Reject. A system which is configured not to participate in any spanning tree protocol MUST silently discard all BPDUs.",
      "ja": "特定のスパニングツリープロトコルに参加するように構成され、異なるスパニングツリープロトコルのBPDUを受信するように構成されているPPPシステムは、LCPプロトコルリジェクトでそれを拒否する必要があります。スパニングツリープロトコルに参加しないように構成されているシステムは、すべてのBPDUを静かに破棄する必要があります。"
    },
    {
      "indent": 3,
      "text": "Spanning Tree Bridge PDU",
      "ja": "スパニングツリーブリッジPDU"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+\n|   HDLC FLAG   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      Address and Control      |     Spanning Tree Protocol    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              BPDU data       ...                              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Frame FCS            |   HDLC FLAG   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Address and Control",
      "ja": "アドレスと制御"
    },
    {
      "indent": 6,
      "text": "As defined by the framing in use.",
      "ja": "使用中のフレーミングによって定義されています。"
    },
    {
      "indent": 3,
      "text": "Spanning Tree Protocol",
      "ja": "スパニングツリープロトコル"
    },
    {
      "indent": 6,
      "text": "Up-to-date values of the Spanning-Tree-Protocol field are specified in the most recent \"Assigned Numbers\" RFC [4]. Current values are assigned as follows:",
      "ja": "Spanning-Tree-Protocolフィールドの最新の値は、最新の「割り当てられた数字」RFCで指定されています[4]。現在の値は次のように割り当てられます。"
    },
    {
      "indent": 6,
      "text": "Value (in hex) Protocol",
      "ja": "値（hex）プロトコル"
    },
    {
      "indent": 6,
      "text": "0201            IEEE 802.1 (either 802.1D or 802.1G)\n0203            IBM Source Route Bridge\n0205            DEC LANbridge 100",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "The two versions of the IEEE 802.1 spanning tree protocol frames can be distinguished by fields within the BPDU data.",
      "ja": "IEEE 802.1スパニングツリープロトコルフレームの2つのバージョンは、BPDUデータ内のフィールドによって区別できます。"
    },
    {
      "indent": 3,
      "text": "BPDU data",
      "ja": "BPDUデータ"
    },
    {
      "indent": 6,
      "text": "As defined by the specified Spanning Tree Protocol.",
      "ja": "指定されたスパニングツリープロトコルで定義されています。"
    },
    {
      "indent": 0,
      "text": "B. Tinygram-Compression Pseudo-Code",
      "ja": "B. tinygram-compression擬似コード"
    },
    {
      "indent": 3,
      "text": "PPP Transmitter:",
      "ja": "PPP送信機："
    },
    {
      "indent": 3,
      "text": "if (ZeroPadCompressionEnabled &&\n    BridgedProtocolHeaderFormat == IEEE8023 &&\n    PacketLength == Minimum8023PacketLength) {\n /*\n  * Remove any continuous run of zero octets preceding,\n  * but not including, the LAN FCS, but not extending\n  * into the MAC header.\n  */\n    Set (ZeroCompressionFlag);           /* Signal receiver */\n    if (is_Set (LAN_FCS_Present)) {\n        FCS = TrailingOctets (PDU, 4);   /* Store FCS */\n        RemoveTrailingOctets (PDU, 4);   /* Remove FCS */\n        while (PacketLength > 14 &&      /* Stop at MAC header or */\n               TrailingOctet (PDU) == 0) /*  last non-zero octet */\n           RemoveTrailingOctets (PDU, 1);/* Remove zero octet */\n        Appendbuf (PDU, 4, FCS);         /* Restore FCS */\n    }\n    else {\n        while (PacketLength > 14 &&      /* Stop at MAC header */\n               TrailingOctet (PDU) == 0) /*  or last zero octet */\n           RemoveTrailingOctets (PDU, 1);/* Remove zero octet */\n    }\n}\n   PPP Receiver:",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "if (ZeroCompressionFlag) {                /* Flag set in header? */\n /* Restoring packet to minimum 802.3 length */\n    Clear (ZeroCompressionFlag);\n    if (is_Set (LAN_FCS_Present)) {\n        FCS = TrailingOctets (PDU, 4);   /* Store FCS */\n        RemoveTrailingOctets (PDU, 4);   /* Remove FCS */\n        Appendbuf (PDU, 60 - PacketLength, zeroes);/* Add zeroes */\n        Appendbuf (PDU, 4, FCS);         /* Restore FCS */\n    }\n    else {\n        Appendbuf (PDU, 60 - PacketLength, zeroes);/* Add zeroes */\n    }\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "参考文献"
    },
    {
      "indent": 3,
      "text": "[1] IBM, \"Token-Ring Network Architecture Reference\", 3rd edition, September 1989.",
      "ja": "[1] IBM、「トークンリングネットワークアーキテクチャリファレンス」、第3版、1989年9月。"
    },
    {
      "indent": 3,
      "text": "[2] IEEE 802.1, \"Draft Standard 802.1G: Remote MAC Bridging\", P802.1G/D7, December 30, 1992.",
      "ja": "[2] IEEE 802.1、「ドラフト標準802.1g：リモートマックブリッジング」、P802.1g/d7、1992年12月30日。"
    },
    {
      "indent": 3,
      "text": "[3] IEEE 802.1D-1993, \"Media Access Control (MAC) Bridges\", ISO/IEC 15802-3:1993 ANSI/IEEE Std 802.1D, 1993 edition., July 1993.",
      "ja": "[3] IEEE 802.1D-1993、「メディアアクセスコントロール（MAC）ブリッジ」、ISO/IEC 15802-3：1993 ANSI/IEEE STD 802.1d、1993年版、1993年7月。"
    },
    {
      "indent": 3,
      "text": "[4] Reynolds, J., \"Assigned Numbers: RFC 1700 is Replaced by an On-line Database\", RFC 3232, January 2002.",
      "ja": "[4] Reynolds、J。、「割り当てられた番号：RFC 1700はオンラインデータベースに置き換えられます」、RFC 3232、2002年1月。"
    },
    {
      "indent": 3,
      "text": "[5] Simpson, W., \"PPP LCP Extensions\", RFC 1570, January 1994.",
      "ja": "[5] シンプソン、W。、「PPP LCP拡張機能」、RFC 1570、1994年1月。"
    },
    {
      "indent": 3,
      "text": "[6] Simpson, W., \"The Point-to-Point Protocol (PPP)\", STD 51, RFC 1661, July 1994.",
      "ja": "[6] シンプソン、W。、「ポイントツーポイントプロトコル（PPP）」、STD 51、RFC 1661、1994年7月。"
    },
    {
      "indent": 3,
      "text": "[7] Sklower, K., Lloyd, B., McGregor, G., Carr, D. and T. Coradetti, \"The PPP Multilink Protocol (MP)\", RFC 1990, August 1996.",
      "ja": "[7] Sklower、K.、Lloyd、B.、McGregor、G.、Carr、D。、およびT. Coradetti、「The PPP Multilink Protocol（MP）」、RFC 1990、1996年8月。"
    },
    {
      "indent": 3,
      "text": "[8] IEEE 802.1D-1998, \"Information technology - Telecommunications and Information exchange between systems - Local and metropolitan area networks - Common Specifications - Part 3: Media Access Control (MAC) Bridges: Revision. This is a revision of ISO/IEC 10038: 1993, 802.1j-1992 and 802.6k-1992. It incorporates P802.11c, P802.1p and P802.12e.\" ISO/IEC 15802-3: 1998.",
      "ja": "[8] IEEE 802.1D -1998、「情報技術 - システム間の通信と情報交換 - ローカルとメトロポリタンエリアネットワーク - 共通仕様 - パート3：メディアアクセス制御（MAC）ブリッジ：改訂。これはISO/IEC 10038：1993の改訂です。、802.1J-1992および802.6K-1992。P802.11C、P802.1PおよびP802.12Eが組み込まれています。ISO/IEC 15802-3：1998。"
    },
    {
      "indent": 3,
      "text": "[9] IEEE 802.1Q, ANSI/IEEE Standard 802.1Q, \"IEEE Standards for Local and Metropolitan Area Networks: Virtual Bridged Local Area Networks\", 1998.",
      "ja": "[9] IEEE 802.1Q、ANSI/IEEE標準802.1Q、「ローカルおよびメトロポリタンエリアネットワークのIEEE標準：仮想ブリッジ型ローカルエリアネットワーク」、1998。"
    },
    {
      "indent": 3,
      "text": "[10] Baker, F. and R. Bowen, \"PPP Bridging Control Protocol (BCP)\", RFC 1638, June 1994.",
      "ja": "[10] Baker、F。およびR. Bowen、「PPPブリッジングコントロールプロトコル（BCP）」、RFC 1638、1994年6月。"
    },
    {
      "indent": 3,
      "text": "[11] Bormann, C., \"The Multi-Class Extension to Multi-Link PPP\", RFC 2686, September 1999.",
      "ja": "[11] Bormann、C。、「マルチリンクPPPへのマルチクラス拡張」、RFC 2686、1999年9月。"
    },
    {
      "indent": 3,
      "text": "[12] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[12] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[13] K. Nichols, S. Blake, F. Baker, D. Black, \"Definition of the \"Differentiated Services Field (DS Field) in the IPv4 and IPv6 Headers\", RFC 2474, December 1998.",
      "ja": "[13] K. Nichols、S。Blake、F。Baker、D。Black、「IPv4およびIPv6ヘッダーの「差別化されたサービスフィールド（DSフィールド）」の定義、RFC 2474、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[14] Higashiyama, M. and F. Baker, \"PPP Bridging Control Protocol (BCP)\", RFC 2878, July 2000.",
      "ja": "[14] ヒガシヤマ、M。およびF.ベイカー、「PPPブリッジングコントロールプロトコル（BCP）」、RFC 2878、2000年7月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Mitsuru Higashiyama Anritsu Corporation 1800 Onna Atsugi-shi Kanagawa-prf. 243-8555 Japan",
      "ja": "井明のanritsu corporation 1800 onna atsugi-shi kanagawa-prf。243-8555日本"
    },
    {
      "indent": 3,
      "text": "Phone: +81 (46) 296-6625\nEMail: Mitsuru.Higashiyama@yy.anritsu.co.jp",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Fred Baker 1121 Via Del Rey Santa Barbara, California 93117 USA",
      "ja": "フレッド・ベイカー1121経由のデル・レイ・サンタ・バーバラ、カリフォルニア93117 USA"
    },
    {
      "indent": 3,
      "text": "Phone: (408) 526-4257 EMail: fred@cisco.com",
      "ja": "電話：（408）526-4257メール：fred@cisco.com"
    },
    {
      "indent": 3,
      "text": "Tawei Liao cisco Systems, Inc. 170 W. Tasman Drive San Jose, CA 95134",
      "ja": "Tawei Liao Cisco Systems、Inc。170 W. Tasman Drive San Jose、CA 95134"
    },
    {
      "indent": 3,
      "text": "Phone: (408) 853-8905 EMail: tawei@cisco.com",
      "ja": "電話：（408）853-8905メール：tawei@cisco.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}