{
  "title": {
    "text": "RFC 3587 - IPv6 Global Unicast Address Format",
    "ja": "RFC 3587 - IPv6のグローバルユニキャストアドレスフォーマット"
  },
  "number": 3587,
  "created_at": "2019-10-19 22:51:22.988654+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          R. Hinden\nRequest for Comments: 3587                                         Nokia\nObsoletes: 2374                                               S. Deering\nCategory: Informational                                            Cisco\n                                                             E. Nordmark\n                                                                     Sun\n                                                             August 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 19,
      "text": "IPv6 Global Unicast Address Format",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 2374, \"An IPv6 Aggregatable Global Unicast Address Format\". It defined an IPv6 address allocation structure that includes Top Level Aggregator (TLA) and Next Level Aggregator (NLA). This document makes RFC 2374 and the TLA/NLA structure historic.",
      "ja": "この文書はRFC 2374、「IPv6の集約可能グローバルユニキャストアドレス形式」を廃止します。これは、トップレベルアグリゲータ（TLA）、次のレベルアグリゲータ（NLA）を備えたIPv6アドレス割当構造を定義しました。この文書は、RFC 2374およびTLA / NLA構造歴史的になります。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "RFC 2374, \"An IPv6 Aggregatable Global Unicast Address Format\", defined an IPv6 address allocation structure that includes TLA and NLA. This document replaces RFC 2374, and makes RFC 2374 and the TLA/NLA structure historic.",
      "ja": "RFC 2374、「IPv6の集約可能グローバルユニキャストアドレスフォーマット」、TLAとNLAが含まれたIPv6アドレス割り当ての構造を定義しました。この文書は、RFC 2374を置き換え、およびRFC 2374および歴史的なTLA / NLA構造になります。"
    },
    {
      "indent": 0,
      "text": "2. TLA/NLA Made Historic",
      "section_title": true,
      "ja": "2. TLA / NLAメイド歴史"
    },
    {
      "indent": 3,
      "text": "The TLA/NLA scheme has been replaced by a coordinated allocation policy defined by the Regional Internet Registries (RIRs) [IPV6RIR].",
      "ja": "TLA / NLA方式は地域インターネットレジストリ（のRIR）IPV6RIR]によって定義された協調割り当てポリシーによって置換されています。"
    },
    {
      "indent": 3,
      "text": "Part of the motivation for obsoleting the TLA/NLA structure is technical; for instance, there is concern that TLA/NLA is not the technically best approach at this stage of the deployment of IPv6. Moreover, the allocation of IPv6 addresses is related to policy and to the stewardship of the IP address space and routing table size, which the RIRs have been managing for IPv4. It is likely that the RIRs' policy will evolve as IPv6 deployment proceeds.",
      "ja": "TLA / NLA構造を時代遅れの動機の一部は技術的です。たとえば、TLA / NLAは、IPv6の展開のこの段階で技術的に最善のアプローチではないことが懸念されます。また、IPv6アドレスの割り当ては、ポリシーおよびのRIRは、IPv4のために管理されたIPアドレス空間およびルーティングテーブルサイズの責務に関連しています。各RIRの方針は、IPv6の導入が進むにつれて進化していく可能性が高いです。"
    },
    {
      "indent": 3,
      "text": "The IETF has provided technical input to the RIRs (for example, [RFC3177]), which the RIRs have taken into account when defining their address allocation policy.",
      "ja": "IETFは、それらのアドレス割り当てポリシーを定義する際のRIRを考慮しているのRIR（例えば、[RFC3177]）に技術的入力を提供しました。"
    },
    {
      "indent": 3,
      "text": "RFC 2374 was the definition of addresses for Format Prefix 001 (2000::/3) which is formally made historic by this document. Even though currently only 2000::/3 is being delegated by the IANA, implementations should not make any assumptions about 2000::/3 being special. In the future, the IANA might be directed to delegate currently unassigned portions of the IPv6 address space for the purpose of Global Unicast as well.",
      "ja": "RFC 2374は、フォーマットプレフィックス001（2000 :: / 3）正式にこの文書で歴史行われるためのアドレスの定義でした。現在、唯一の2000 :: / 3は、IANAによって委任されているにもかかわらず、実装は約2000任意の仮定を行うべきではありません:: / 3特別なもの。将来的には、IANAは、同様にグローバルユニキャストの目的のためのIPv6アドレス空間の現在割り当てられていない部分を委任するように指示される可能性があります。"
    },
    {
      "indent": 3,
      "text": "The Subnet Local Aggregator (SLA) field in RFC 2374 remains in function but with a different name in [ARCH]. Its new name is \"subnet ID\".",
      "ja": "RFC 2374にサブネットローカルアグリゲータ（SLA）フィールドは、関数ではなく、[ARCH]で別の名前で残ります。その新しい名前は、「サブネットID」です。"
    },
    {
      "indent": 0,
      "text": "3. Address Format",
      "section_title": true,
      "ja": "3.アドレスフォーマット"
    },
    {
      "indent": 3,
      "text": "The general format for IPv6 global unicast addresses as defined in \"IP Version 6 Addressing Architecture\" [ARCH] is as follows:",
      "ja": "次のように「IPバージョン6アドレス指定アーキテクチャ」[ARCH]で定義されるようにIPv6グローバルユニキャストアドレスの一般的な形式は次のとおりです。"
    },
    {
      "indent": 4,
      "text": "|         n bits          |   m bits  |       128-n-m bits         |\n+-------------------------+-----------+----------------------------+\n| global routing prefix   | subnet ID |       interface ID         |\n+-------------------------+-----------+----------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "where the global routing prefix is a (typically hierarchically-structured) value assigned to a site (a cluster of subnets/links), the subnet ID is an identifier of a subnet within the site, and the interface ID is as defined in section 2.5.1 of [ARCH]. The global routing prefix is designed to be structured hierarchically by the RIRs and ISPs. The subnet field is designed to be structured hierarchically by site administrators.",
      "ja": "グローバルルーティングプレフィックスはサイト（サブネット/リンクのクラスタ）に割り当てられた（典型的には階層構造）の値である場合、サブネットIDは、サイト内のサブネットの識別子であり、インタフェースIDは、セクション2.5で定義されています[ARCH]の.1。グローバルルーティングプレフィクスは、各RIRやISPによって階層的に構造化されるように設計されています。サブネットフィールドは、サイト管理者が階層的に構造化されるように設計されています。"
    },
    {
      "indent": 3,
      "text": "[ARCH] also requires that all unicast addresses, except those that start with binary value 000, have Interface IDs that are 64 bits long and to be constructed in Modified EUI-64 format. The format of global unicast address in this case is:",
      "ja": "[ARCH]も必要とバイナリ値000で始まるものを除くすべてのユニキャストアドレスは、64ビット長と変形EUI-64フォーマットで構築されるインターフェースIDを持っていること。この場合、グローバルユニキャストアドレスの形式は次のとおりです。"
    },
    {
      "indent": 4,
      "text": "|         n bits          | 64-n bits |       64 bits              |\n+-------------------------+-----------+----------------------------+\n| global routing prefix   | subnet ID |       interface ID         |\n+-------------------------+-----------+----------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "where the routing prefix is a value assigned to identify a site (a cluster of subnets/links), the subnet ID is an identifier of a subnet within the site, and the interface ID is a modified EUI-64 format as defined in [ARCH].",
      "ja": "ルーティングプレフィックスがサイト（サブネット/リンクのクラスタ）を識別するために割り当てられた値であり、サブネットIDは、サイト内のサブネットの識別子であり、インタフェースIDが[ARCHで定義されるように修飾されたEUI-64フォーマットであります]。"
    },
    {
      "indent": 3,
      "text": "An example of the resulting format of global unicast address under the 2000::/3 prefix that is currently being delegated by the IANA and consistent with the recommendations in RFC 3177 is:",
      "ja": "現在、RFC 3177の推奨事項とIANAと一致によって委任されている2000 :: / 3プレフィックス下グローバルユニキャストアドレスの得られたフォーマットの例を示します。"
    },
    {
      "indent": 4,
      "text": "| 3 |     45 bits         |  16 bits  |       64 bits              |\n+---+---------------------+-----------+----------------------------+\n|001|global routing prefix| subnet ID |       interface ID         |\n+---+---------------------+-----------+----------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4. Acknowledgments",
      "section_title": true,
      "ja": "4.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to express our thanks to Alain Durand, Brian Carpenter, Fred Templin, Julian Sellers, Jun-ichiro Itojun Hagino, Margaret Wasserman, Michel Py, Pekka Savola, Tatuya Jinmei, and Thomas Narten for their review and constructive comments.",
      "ja": "作者は彼らのレビューと建設的なコメントのためにアラン・デュラン、ブライアン・カーペンター、フレッド・テンプリン、ジュリアン・セラーズ、6月-一郎いとぢゅん萩野、マーガレットワッサーマン、ミシェルのPy、ペッカSavola、達也神明、およびトーマスNarten氏への感謝を表したいと思います。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5.参考文献"
    },
    {
      "indent": 0,
      "text": "5.1. Normative References",
      "section_title": true,
      "ja": "5.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[ARCH] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 3513, April 2003.",
      "ja": "[ARCH] HindenとR.とS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 3513、2003年4月。"
    },
    {
      "indent": 3,
      "text": "[IPV6] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[IPV6]デアリング、S.とR. Hindenと、 \"インターネットプロトコルバージョン6（IPv6）の仕様\"、RFC 2460、1998年12月。"
    },
    {
      "indent": 0,
      "text": "5.2. Informative References",
      "section_title": true,
      "ja": "5.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[IPV6RIR] APNIC, ARIN, RIPE NCC, \"IPv6 Address Allocation and Assignment Policy\", Document ID: ripe-267, http://www.ripe.net/ripe/docs/ipv6policy.html, January 22, 2003.",
      "ja": "[IPV6RIR] APNIC、ARIN、RIPE NCC、 \"IPv6アドレス割り振りおよび割り当てポリシー\"、文書ID：熟し-267、http://www.ripe.net/ripe/docs/ipv6policy.html、2003年1月22日。"
    },
    {
      "indent": 3,
      "text": "[RFC3177] IAB/IESG, \"Recommendations on IPv6 Address Allocations to Sites\", RFC 3177, September 2001.",
      "ja": "[RFC3177] IAB / IESG、RFC 3177、2001年9月 \"サイトへのIPv6アドレスの割り当てに関する提言\"。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "IPv6 addressing documents do not have any direct impact on Internet infrastructure security.",
      "ja": "IPv6のアドレス指定の文書がインターネットインフラストラクチャのセキュリティ上の任意の直接的な影響はありません。"
    },
    {
      "indent": 0,
      "text": "7. Authors' Addresses",
      "section_title": true,
      "ja": "7.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Robert M. Hinden Nokia 313 Fairchild Drive Mountain View, CA USA",
      "ja": "ロバートM. Hindenとノキア313フェアチャイルドドライブマウンテンビュー、CA USA"
    },
    {
      "indent": 3,
      "text": "EMail: bob.hinden@nokia.com",
      "ja": "メールアドレス：bob.hinden@nokia.com"
    },
    {
      "indent": 3,
      "text": "Stephen E. Deering Cisco Systems, Inc. 170 West Tasman Drive San Jose, CA 95134-1706 USA",
      "ja": "スティーブンE.デアリングシスコシステムズ、株式会社170西タスマン・ドライブサンノゼ、CA 95134-1706 USA"
    },
    {
      "indent": 3,
      "text": "Erik Nordmark Sun Microsystems Laboratories 180, avenue de l'Europe 38334 SAINT ISMIER Cedex France",
      "ja": "エリックNordmarkとSun Microsystemsの研究所、180、大通りドゥヨーロッパ38334 SAINT ISMIERセデックスフランス"
    },
    {
      "indent": 3,
      "text": "EMail: erik.nordmark@sun.com",
      "ja": "メールアドレス：erik.nordmark@sun.com"
    },
    {
      "indent": 0,
      "text": "8. Full Copyright Statement",
      "section_title": true,
      "ja": "8.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の制限は永続的なものであり、インターネットソサエティもしくはその継承者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}