{
  "title": {
    "text": "RFC 3988 - Maximum Transmission Unit Signalling Extensions for the Label Distribution Protocol",
    "ja": "RFC 3988 - ラベル配布プロトコルのための最大伝送単位シグナリング拡張"
  },
  "number": 3988,
  "created_at": "2019-10-26 10:01:26.871345+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           B. Black\nRequest for Comments: 3988                               Layer8 Networks\nCategory: Experimental                                       K. Kompella\n                                                        Juniper Networks\n                                                            January 2005",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Maximum Transmission Unit Signalling Extensions\n      for the Label Distribution Protocol",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo defines an Experimental Protocol for the Internet community. It does not specify an Internet standard of any kind. Discussion and suggestions for improvement are requested. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのためにExperimentalプロトコルを定義します。それはどんな種類のインターネット標準を指定しません。改善のための議論や提案が要求されています。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Proper functioning of RFC 1191 path Maximum Transmission Unit (MTU) discovery requires that IP routers have knowledge of the MTU for each link to which they are connected. As currently specified, the Label Distribution Protocol (LDP) does not have the ability to signal the MTU for a Label Switched Path (LSP) to the ingress Label Switching Router (LSR). In the absence of this functionality, the MTU for each LSP must be statically configured by network operators or by equivalent off-line mechanisms.",
      "ja": "RFC 1191のパス最大転送単位（MTU）発見の適切な機能は、IPルータは、接続されている各リンクのMTUの知識を持っていることが必要です。現在指定されているように、ラベル配布プロトコル（LDP）は、入口ラベルスイッチングルータ（LSR）のラベルスイッチパス（LSP）のためのMTUを通知する機能を持っていません。この機能の非存在下で、各LSPのMTUは静的ネットワークオペレータによって、または同等のオフライン機構によって構成されなければなりません。"
    },
    {
      "indent": 3,
      "text": "This document specifies experimental extensions to LDP in support of LSP MTU discovery.",
      "ja": "この文書では、LSP MTU発見の支援で自民党への実験的な拡張を指定します。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "As currently specified in [2], the LDP protocol for MPLS does not support signalling of the MTU for LSPs to ingress LSRs. This functionality is essential to the proper functioning of RFC 1191 path MTU detection [3]. Without knowledge of the MTU for an LSP, edge LSRs may transmit packets along that LSP which are, according to [4], too big. These packets may be silently discarded by LSRs along the LSP, effectively preventing communication between certain end hosts.",
      "ja": "現在で指定されるように、[2]、MPLS LDPのためのプロトコルは、入口のLSRへのLSPのMTUのシグナリングをサポートしていません。この機能は、RFC 1191のパスMTU検出[3]の適切な機能に必須です。 LSPのMTUの知識がなくても、エッジLSR [4]は、大きすぎによれば、あるそのLSPに沿ってパケットを送信することができます。これらのパケットは、黙っ効果特定のエンドホスト間通信を防止する、LSPに沿ってのLSRによって破棄されてもよいです。"
    },
    {
      "indent": 3,
      "text": "The solution proposed in this document enables automatic determination of the MTU for an LSP by adding a Type-Length-Value triplet (TLV) to carry MTU information for a Forwarding Equivalence Class (FEC) between adjacent LSRs in LDP Label Mapping messages. This information is sufficient for a set of LSRs along the path followed by an LSP to discover either the exact MTU for that LSP, or an approximation that is no worse than could be generated with local information on the ingress LSR.",
      "ja": "この文書で提案された解決策は、LDPラベルマッピングメッセージ内の隣接するLSRの間の転送等価クラス（FEC）のためのMTU情報を搬送するタイプレングス値トリプレット（TLV）を追加することによって、LSPのMTUの自動決意を可能にします。この情報は、そのLSPの正確なMTU、又は入口LSRのローカル情報を生成することができるよりも悪化しない近似値のいずれかを発見するLSPがたどる経路に沿ってのLSRのセットのために十分です。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.1. このドキュメントの表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [1].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14、RFC 2119に記載されるように解釈される[1]。"
    },
    {
      "indent": 0,
      "text": "2. MTU Signalling",
      "section_title": true,
      "ja": "2. MTUシグナリング"
    },
    {
      "indent": 3,
      "text": "The signalling procedure described in this document employs the addition of a single TLV to LDP Label Mapping messages and a simple algorithm for LSP MTU calculation.",
      "ja": "この文書に記載されたシグナリング手順は、LDPラベルマッピングメッセージとLSP MTU計算のための簡単なアルゴリズムに単一TLVの添加を採用しています。"
    },
    {
      "indent": 0,
      "text": "2.1. Definitions",
      "section_title": true,
      "ja": "2.1. 定義"
    },
    {
      "indent": 3,
      "text": "Link MTU: The MTU of a given link. This size includes the IP header and data (or other payload) and the label stack but does not include any lower-layer headers. A link may be an interface (such as Ethernet or Packet-over-SONET), a tunnel (such as GRE or IPsec), or an LSP.",
      "ja": "リンクMTU：与えられたリンクのMTU。このサイズは、IPヘッダとデータ（又は他のペイロード）とラベルスタックを含むが、任意の下層ヘッダーを含みません。リンク（例えばイーサネット（登録商標）またはパケット・オーバーSONETなど）インターフェース、（例えば、GREやIPsecなど）トンネル、又はLSPであってもよいです。"
    },
    {
      "indent": 3,
      "text": "Peer LSRs: For LSR A and FEC F, this is the set of LSRs that sent a Label Mapping for FEC F to A.",
      "ja": "ピアのLSR：LSR AとFEC Fの場合、これはAにFEC Fのためのラベルマッピングを送ったのLSRのセットです"
    },
    {
      "indent": 3,
      "text": "Downstream LSRs: For LSR A and FEC F, this is the subset of A's peer LSRs for FEC F to which A will forward packets for the FEC. Typically, this subset is determined via the routing table.",
      "ja": "下流のLSR：LSR AとFEC Fの場合は、これはAがFECのためにパケットを転送しますするFEC FのためのAのピアのLSRのサブセットです。典型的には、このサブセットは、ルーティングテーブルを介して決定されます。"
    },
    {
      "indent": 3,
      "text": "Hop MTU: The MTU of an LSP hop between an upstream LSR, A, and a downstream LSR, B. This size includes the IP header and data (or other payload) and the part of the label stack that is considered payload as far as this LSP goes. It does not include any lower-level headers. (Note: If there are multiple links between A and B, the Hop MTU is the minimum of the Hop MTU of those links used for forwarding.)",
      "ja": "ホップMTU：上流のLSR間のLSPのホップのMTU、A、および下流LSR、B.このサイズは、IPヘッダとデータ（又は他のペイロード）を含み、限りペイロードと見なされるラベルスタックの一部このLSPは行きます。これは、任意の下位レベルのヘッダが含まれていません。 （注：AとBとの間の複数のリンクがある場合、ホップMTUは、転送のために使用されるこれらのリンクのホップMTUの最小値です。）"
    },
    {
      "indent": 3,
      "text": "LSP MTU: The MTU of an LSP from a given LSR to the egress(es), over each valid (forwarding) path. This size includes the IP header and data (or other payload) and any part of the label stack that was received by the ingress LSR before it placed the packet into the LSP (this part of the label stack is considered part of the payload for this LSP). The size does not include any lower-level headers.",
      "ja": "LSP MTU：所与LSRから出口へのLSPのMTU（ES）、各有効（転送）パスを介し。それはLSPにパケットを配置する前に、このサイズは、（ラベルスタックのこの部分を考慮し、このペイロードの一部IPヘッダおよびデータ（または他のペイロード）と入口LSRにより受信されたラベルスタックの任意の部分を含みますLSP）。サイズは、任意の下位レベル・ヘッダを含んでいません。"
    },
    {
      "indent": 0,
      "text": "2.2. Example",
      "section_title": true,
      "ja": "2.2. 例"
    },
    {
      "indent": 3,
      "text": "Consider LSRs A - F, interconnected as follows:",
      "ja": "：次のように相互接続されたF、 - のLSR Aを考えてみましょう"
    },
    {
      "indent": 9,
      "text": "            M       P\n          _____ C =====\n         /      |      \\\nA ~~~~~ B ===== D ----- E ----- F\n    L       N       Q       R",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Say that the link MTU for link L is 9216; for links M, Q, and R, 4470; and for N and P, is 1500.",
      "ja": "リンクLのリンクMTUが9216であると言います。リンクのためのM、Q、およびR、4470;そしてN及びPのため、1500。"
    },
    {
      "indent": 3,
      "text": "Consider an FEC X for which F is the egress, and say that all LSRs advertise X to their neighbors.",
      "ja": "Fが出力されているFEC Xを考えると、すべてのLSRが隣人にXを宣伝することを言います。"
    },
    {
      "indent": 3,
      "text": "Note that although LDP may be running on the C - D link, it is not used for forwarding (e.g., because it has a high metric). In particular, D is an LDP neighbor of C, but D is not one of C's downstream LSRs for FEC X.",
      "ja": "Dリンク（それは高いメトリックを有するので、例えば）、それを転送するために使用されていない -  LDPはC上で実行されてもよいことに留意されたいです。具体的には、DはCのLDPネイバーであるが、Dは、FEC XのCの下流のLSRの一つではありません"
    },
    {
      "indent": 3,
      "text": "E's peers for FEC X are C, D, and F. Say that E chooses F as its downstream LSR for X. E's Hop MTU for link R is 4466. If F advertised an implicit null label to E, then E MAY set the Hop MTU for R to 4470.",
      "ja": "FEC XのためのEのピアはC、Dであり、およびFは、FはEへの暗黙的なヌルラベルをアドバタイズした場合、Eは4466.あるリンクRのためのX. EのホップMTUのためにその下流LSRとしてFを選択すると言う場合、Eは、ホップを設定してもよいです4470にRのMTU。"
    },
    {
      "indent": 3,
      "text": "C's peers for FEC X are B, D, and E. Say that C chooses E as its downstream LSR for X. Similarly, A chooses B, B chooses C and D (equal cost multi-path), D chooses E, and E chooses F (respectively) as downstream LSRs.",
      "ja": "FEC XのためのCのピアCは同様に、AがBを選択し、BがCとD（等価コストマルチパス）を選択、DがEを選択し、そしてE Xの下流LSRとしてEを選択することをB、D、およびEセイでありますFは、下流のLSRとして（それぞれ）を選択します。"
    },
    {
      "indent": 3,
      "text": "C's Hop MTU to E for FEC X is 1496. B's Hop MTU to C is 4466 and to D is 1496. A's LSP MTU for FEC X is 1496. If A has another LSP for FEC Y to F (learned via targeted LDP) that rides over the LSP for FEC X, the MTU for that LSP would be 1492.",
      "ja": "FEC XのためのEにCのホップMTUはCに1496 BのホップMTUは4466であり、AはFに対してFEC Yのための別のLSP（ターゲットLDPを介して学習された）ことがある場合はDにFEC Xのための1496 AのLSP MTUは1496でありますFEC X用LSPを乗り越えは、そのLSPのためのMTUは1492になります。"
    },
    {
      "indent": 3,
      "text": "If B had a targeted LDP session to E (e.g., over an RSVP-TE tunnel T) and B received a Mapping for FEC X over the targeted LDP session, then E would also be B's peer, and E may be chosen as a downstream LSR for B. In that case, B's LSP MTU for FEC X would then be the smaller of {(T's MTU - 4), E's LSP MTU for X}.",
      "ja": "B（例えば、RSVP-TEトンネルT上）Eに対して標的LDPセッションを有し、BはターゲットLDPセッションにわたってFEC Xのマッピングを受信し、次いで、Eはまた、Bのピアとなり、そしてEが下流側として選択することができる場合その場合、BのLSR、FEC XのためのBのLSP MTUは、その後の小さいであろう{（TのMTU  -  4）Xのために、EのLSP MTU}。"
    },
    {
      "indent": 3,
      "text": "This memo describes how A determines its LSP MTU for FECs X and Y.",
      "ja": "このメモは、Aは、FECをXとYのためにそのLSP MTUを決定する方法を説明します"
    },
    {
      "indent": 0,
      "text": "2.3. Signalling Procedure",
      "section_title": true,
      "ja": "2.3. シグナリング手順"
    },
    {
      "indent": 3,
      "text": "The procedure for signalling the MTU is performed hop-by-hop by each LSR L along an LSP for a given FEC, F. The steps are as follows:",
      "ja": "次のようにMTUをシグナリングするための手順は、ステップである、所与のFEC、F.用LSPに沿って各LSR Lでホップバイホップで行われます。"
    },
    {
      "indent": 3,
      "text": "1. First, L computes its LSP MTU for FEC F:",
      "section_title": true,
      "ja": "1.まず、LはFEC FのためにそのLSP MTUを計算します。"
    },
    {
      "indent": 6,
      "text": "A. If L is the egress for F, L sets the LSP MTU for F to 65535.",
      "ja": "A. Lは、Fのための出口である場合、Lは65535 FのためのLSP MTUを設定します。"
    },
    {
      "indent": 6,
      "text": "B. [OPTIONAL] If L's only downstream LSR is the egress for F (i.e., L is a penultimate hop for F) and L receives an implicit null label as its Mapping for F, then L can set the Hop MTU for its downstream link to the link MTU instead of (link MTU - 4 octets). L's LSP MTU for F is the Hop MTU.",
      "ja": "B. [オプション] L'Sだけ下流LSRがFのための出口（すなわち、Lは、Fのための最後から二番目のホップである）、LはFに対するそのマッピングとして暗黙的ヌルラベルを受け取り、その後、Lは、その下流のリンクのためのホップMTUを設定することができる場合リンクMTUの代わりに、（ -  4つのオクテットリンクMTU）へ。 F用L'sのLSP MTUはホップMTUです。"
    },
    {
      "indent": 6,
      "text": "C. Otherwise (L is not the egress LSR), L computes the LSP MTU for F as follows:",
      "ja": "次のようにC.は、そうでない場合（Lが出口LSRではない）、Lは、FのためのLSP MTUを計算します。"
    },
    {
      "indent": 9,
      "text": "a) L determines its downstream LSRs for FEC F.",
      "ja": "A）Lは、FEC F.ためにその下流のLSRを決定します"
    },
    {
      "indent": 9,
      "text": "b) For each downstream LSR Z, L computes the minimum of the Hop MTU to Z and the LSP MTU in the MTU TLV that Z advertised to L. If Z did not include the MTU TLV in its Label Mapping, then Z's LSP MTU is set to 65535.",
      "ja": "B）各ダウンストリームLSR Zの場合、Lは、Zは、そのラベルマッピングでMTU TLVが含まれていなかった場合、ZはLにアドバタイズすることをZとMTU TLVにおけるLSP MTUにホップMTUの最小値を計算し、次にZのLSP MTUであります65535に設定します。"
    },
    {
      "indent": 9,
      "text": "c) L sets its LSP MTU to the minimum of the MTUs it computed for its downstream LSRs.",
      "ja": "C）Lは、その下流のLSRに対して計算MTUの最小値にそのLSP MTUを設定します。"
    },
    {
      "indent": 3,
      "text": "2. For each LDP neighbor (direct or targeted) of L to which L decides to send a Mapping for FEC F, L attaches an MTU TLV with the LSP MTU that it computed for this FEC. L MAY (because of policy or for other reasons) advertise a smaller MTU than it has computed, but L MUST NOT advertise a larger MTU.",
      "ja": "Lの各LDPネイバー2.（直接または標的）はFEC Fのマッピングを送信することを決定したL、Lは、このFECについて計算LSP MTUとMTU TLVを付加します。 L MAY（なぜなら政策のか、他の理由のために）それが計算されていますが、Lは、より大きなMTUを広告してはならないよりも小さいMTUを宣伝。"
    },
    {
      "indent": 3,
      "text": "3. When a new MTU is received for FEC F from a downstream LSR or the set of downstream LSRs for F changes, L returns to step 1. If the newly computed LSP MTU is unchanged, L SHOULD NOT advertise new information to its neighbors. Otherwise, L readvertises its Mappings for F to all its peers with an updated MTU TLV.",
      "ja": "3.新しいMTUは、下流LSRまたはFの変化のための下流のLSRのセットからFEC Fのために受信されると、Lは、新たに計算されたLSP MTUが変更されていない場合は、Lは、隣国への新たな情報を広告しない（SHOULD NOT）ステップ1に戻ります。それ以外の場合、Lは更新MTU TLVとそのすべてのピアにFために、そのマッピングをreadvertises。"
    },
    {
      "indent": 6,
      "text": "This behavior is standard for attributes such as path vector and hop count, and the same rules apply, as specified in [2].",
      "ja": "この現象は、パスベクトルとホップ数などの属性のための規格であり、[2]で指定されるように同じルールが適用されます。"
    },
    {
      "indent": 6,
      "text": "If the LSP MTU decreases, L SHOULD readvertise the new MTU immediately; if the LSP MTU increases, L MAY hold down the readvertisement.",
      "ja": "LSP MTUが減少すると、Lは、すぐに新しいMTUをreadvertiseすべきです。 LSP MTUが増加した場合、Lは、再広告を押したままにするかもしれません。"
    },
    {
      "indent": 0,
      "text": "2.4. MTU TLV",
      "section_title": true,
      "ja": "2.4.  MTU TLV"
    },
    {
      "indent": 3,
      "text": "The MTU TLV encodes information on the maximum transmission unit for an LSP, from the advertising LSR to the egress(es) over all valid paths.",
      "ja": "MTU TLVは、広告LSRからすべての有効なパス上出口（ES）に、LSPのための最大伝送単位の情報を符号化します。"
    },
    {
      "indent": 3,
      "text": "The encoding for the MTU TLV is as follows:",
      "ja": "次のようにMTU TLVのエンコーディングは以下のとおりです。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|1|1|      MTU TLV (0x0601)     |            Length             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|              MTU              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "MTU",
      "ja": "MTU"
    },
    {
      "indent": 3,
      "text": "This is a 16-bit unsigned integer that represents the MTU in octets for an LSP or a segment of an LSP.",
      "ja": "これは、LSPまたはLSPのセグメントのオクテット内のMTUを表す16ビットの符号なし整数です。"
    },
    {
      "indent": 3,
      "text": "Note that the U and F bits are set. An LSR that doesn't recognize the MTU TLV MUST ignore it when it processes the Label Mapping message and forward the TLV to its peers. This may result in the incorrect computation of the LSP MTU; however, silently forwarding the MTU TLV preserves the maximal amount of information about the LSP MTU.",
      "ja": "UとFビットが設定されていることに留意されたいです。 MTU TLVを認識しないLSRは、ラベルマッピングメッセージを処理するときにそれを無視し、そのピアにTLVを転送する必要があります。これは、LSP MTUの間違った計算になることがあり、しかし、黙っMTU TLVを転送することはLSP MTUに関する情報の最大量を保持します。"
    },
    {
      "indent": 0,
      "text": "3. Example of Operation",
      "section_title": true,
      "ja": "運用の3例"
    },
    {
      "indent": 3,
      "text": "Consider the network example in Section 2.2. For each LSR, Table 1 describes the links to its downstream LSRs, the Hop MTU for the peer, the LSP MTU received from the peer, and the LSR's computed LSP MTU.",
      "ja": "2.2節でのネットワークの例を考えてみましょう。各LSR、表1は、その下流のLSRへのリンクを記述し、ピアのホップMTUのために、LSP MTUは、ピアから受信し、LSRの計算されたLSP MTU。"
    },
    {
      "indent": 3,
      "text": "Now consider the same network with the following changes: There is an LSP T from B to E, and a targeted LDP session from B to E. B's peer LSRs are A, C, D, and E; B's downstream LSRs are D and E; to reach E, B chooses to go over T. The LSP MTU for LSP T is 1496. This information is depicted in Table 2.",
      "ja": "、C、D、及びEであるE. BのピアのLSRにBからBからEへLSP Tであり、そして標的LDPセッション;：以下の変更と同じネットワークを考えますBの下流のLSRは、DとEです。 Eに到達するために、Bは、LSP TためT.ザLSP MTU上に行くことを選択したこの情報は、表2に示されている1496です。"
    },
    {
      "indent": 9,
      "text": "LSR  |  Link  |  Hop MTU  |  Recvd MTU  |  LSP MTU\n--------------------------------------------------\n F   |    -   |    65535  |      -      |    65535\n--------------------------------------------------\n E   |    R   |     4466  |  F:  65535  |     4466\n--------------------------------------------------\n D   |    Q   |     4466  |  E:   4466  |     4466\n--------------------------------------------------\n C   |    P   |     1496  |  E:   4466  |     1496\n--------------------------------------------------\n B   |    M   |     4466  |  C:   1496  |\n     |    N   |     1496  |  D:   4466  |     1496\n--------------------------------------------------\n A   |    L   |     9212  |  B:   1496  |     1496\n--------------------------------------------------\n                     Table 1",
      "raw": true
    },
    {
      "indent": 9,
      "text": "LSR  |  Link  |  Hop MTU  |  Recvd MTU  |  LSP MTU\n--------------------------------------------------\n F   |    -   |    65535  |      -      |    65535\n--------------------------------------------------\n E   |    R   |     4466  |  F:  65535  |     4466\n--------------------------------------------------\n D   |    Q   |     4466  |  E:   4466  |     4466\n--------------------------------------------------\n C   |    P   |     1496  |  E:   4466  |     1496\n--------------------------------------------------\n B   |    T   |     1492  |  E:   4466  |\n     |    N   |     1496  |  D:   4466  |     1492\n--------------------------------------------------\n A   |    L   |     9212  |  B:   1492  |     1492\n--------------------------------------------------\n                     Table 2",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4. Using the LSP MTU",
      "section_title": true,
      "ja": "4. LSP MTUを使用して"
    },
    {
      "indent": 3,
      "text": "An ingress LSR that forwards an IP packet into an LSP whose MTU it knows MUST either fragment the IP packet to the LSP's MTU (if the Don't Fragment bit is clear) or drop the packet and respond with an ICMP Destination Unreachable message to the source of the packet, with the Code indicating \"fragmentation needed and DF set\", and the Next-Hop MTU set to the LSP MTU. In other words, the LSR behaves as RFC 1191 says, except that it treats the LSP as the next hop \"network\".",
      "ja": "そのMTUそれは知っている（いないFragmentビットがクリアされてない場合）LSPのMTUにIPパケットをフラグメントまたはパケットをドロップしにICMP宛先到達不能メッセージで応答しなければならないのいずれかのLSPにIPパケットを転送する入口LSR 「フラグメンテーション必要とDFセット」を示すコード、およびネクストホップMTUでパケットのソースは、LSP MTUに設定されます。 RFC 1191が言うように、それは次のホップ「ネットワーク」としてLSPを扱うことを除いて、他の言葉では、LSRは、動作します。"
    },
    {
      "indent": 3,
      "text": "If the payload for the LSP is not an IP packet, the LSR MUST forward the packet if it fits (size <= LSP MTU) and SHOULD drop it if it doesn't.",
      "ja": "LSPのためのペイロードがIPパケットではない場合、それがフィット（サイズ<= LSP MTU）とそうでない場合は、それをドロップする必要がある場合、LSRは、パケットを転送しなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Protocol Interaction",
      "section_title": true,
      "ja": "5.プロトコルの相互作用"
    },
    {
      "indent": 0,
      "text": "5.1. Interaction with LSRs that Do Not Support MTU Signalling",
      "section_title": true,
      "ja": "5.1.  MTUシグナリングをサポートしないのLSRとの相互作用"
    },
    {
      "indent": 3,
      "text": "Changes in MTU for sections of an LSP may cause intermediate LSRs to generate unsolicited label Mapping messages to advertise the new MTU. LSRs that do not support MTU signalling will, due to message and TLV processing mechanisms specified in RFC3036 [2], accept the messages carrying the MTU TLV but will ignore the TLV and forward the TLV to the upstream nodes (see Section 2.4).",
      "ja": "LSPのセクションのためのMTUの変更は、新しいMTUを宣伝する迷惑ラベルマッピングメッセージを生成するために、中間のLSRが発生することがあります。 MTUシグナリングをサポートしないのLSRは、原因RFC3036で指定されたメッセージ及びTLV処理機構に[2]、MTU TLVを運ぶメッセージを受け入れるが、TLVを無視して（セクション2.4を参照）上流のノードにTLVを転送します。"
    },
    {
      "indent": 0,
      "text": "5.2. Interaction with CR-LDP and RSVP-TE",
      "section_title": true,
      "ja": "5.2.  CR-LDPおよびRSVP-TEとの相互作用"
    },
    {
      "indent": 3,
      "text": "The MTU TLV can be used to discover the Path MTU of both LDP LSPs and CR-LDP LSPs. This proposal is not impacted in the presence of LSPs created with CR-LDP, as specified in [5].",
      "ja": "MTU TLVは、両方のLDP LSPの経路MTUおよびCR-LDP LSPを発見するために使用することができます。 [5]で指定されるように、この提案は、CR-LDPを使用して作成LSPの存在下で影響されません。"
    },
    {
      "indent": 3,
      "text": "Note that LDP/CR-LDP LSPs may tunnel through other LSPs signalled using LDP, CR-LDP, or RSVP-TE [6]; the mechanism suggested here applies in all of these cases, essentially by treating the tunnel LSPs as links.",
      "ja": "LDP / CR-LDPのLSPが他のLSPを介してトンネル[6] LDP、CR-LDP、またはRSVP-TEを用いてシグナリングすることができることに留意されたいです。ここで提案メカニズムは基本的にリンクとしてトンネルLSPを処理することにより、これらの例全てに適用されます。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[1]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[2] Andersson, L., Doolan, P., Feldman, N., Fredette, A., and B. Thomas, \"LDP Specification\", RFC 3036, January 2001.",
      "ja": "[2]アンダーソン、L.、Doolan、P.、フェルドマン、N.、Fredette、A.およびB.トーマス、 \"LDP仕様\"、RFC 3036、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[3] Mogul, J. and S. Deering, \"Path MTU discovery\", RFC 1191, November 1990.",
      "ja": "[3]モーグル、J.およびS.デアリング、 \"経路MTUディスカバリ\"、RFC 1191、1990年11月。"
    },
    {
      "indent": 3,
      "text": "[4] Rosen, E., Tappan, D., Fedorkow, G., Rekhter, Y., Farinacci, D., Li, T., and A. Conta, \"MPLS Label Stack Encoding\", RFC 3032, January 2001.",
      "ja": "[4]ローゼン、E.、タッパン、D.、Fedorkow、G.、Rekhter、Y.、ファリナッチ、D.、李、T.、およびA.コンタ、 \"MPLSラベルスタック符号化は\"、RFC 3032、2001年1月。"
    },
    {
      "indent": 3,
      "text": "[6] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, V., and G. Swallow, \"RSVP-TE: Extensions to RSVP for LSP Tunnels\", RFC 3209, December 2001.",
      "ja": "[6] Awduche、D.、バーガー、L.、ガン、D.、李、T.、スリニヴァサン、V.、およびG.ツバメ、 \"RSVP-TE：LSPトンネルのためのRSVPの拡張\"、RFC 3209年12月2001。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[5] Jamoussi, B., Andersson, L., Callon, R., Dantu, R., Wu, L., Doolan, P., Worster, T., Feldman, N., Fredette, A., Girish, M., Gray, E., Heinanen, J., Kilty, T., and A. Malis, \"Constraint-Based LSP Setup using LDP\", RFC 3212, January 2002.",
      "ja": "[5] Jamoussi、B.、アンダーソン、L.、Callon、R.、Dantu、R.、ウー、L.、Doolan、P.、Worster、T.、フェルドマン、N.、Fredette、A.、Girish、 M.、グレー、E.、Heinanen、J.、Kilty、T.、およびA. Malis、 \"LDPを使用して、制約ベースLSPセットアップ\"、RFC 3212、2002年1月。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This mechanism does not introduce any new weaknesses in LDP. It is possible to spoof TCP packets belonging to an LDP session to manipulate the LSP MTU, but LDP has mechanisms to thwart these types of attacks. See Section 5 of [2] for more information on security aspects of LDP.",
      "ja": "このメカニズムは、自民党内の任意の新しい弱点を導入していません。 LSP MTUを操作するためのLDPセッションに属するTCPパケットを偽装することが可能であるが、自民党はこの種の攻撃を阻止するためのメカニズムを持っています。自民党のセキュリティ面の詳細については、[2]のセクション5を参照してください。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has allocated 0x0601 as a new LDP TLV Type, defined in Section 2.4. See: http://www.iana.org/assignments/ldp-namespaces",
      "ja": "IANAはセクション2.4で定義された新しいLDP TLVタイプとして0x0601を割り当てています。参照：http://www.iana.org/assignments/ldp-namespaces"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "We would like to thank Andre Fredette for a number of detailed comments on earlier versions of the signalling mechanism. Eric Gray, Giles Heron, and Mark Duffy have contributed numerous useful suggestions.",
      "ja": "私たちは、シグナリングメカニズムの以前のバージョンに関する詳細なコメントの数のアンドレFredetteに感謝したいと思います。エリックグレー、ジャイルズヘロン、とマーク・ダフィーは、多くの有益な提案を貢献しています。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Benjamin Black Layer8 Networks",
      "ja": "ベンジャミン・ブラックLayer8ネットワーク"
    },
    {
      "indent": 3,
      "text": "EMail: ben@layer8.net",
      "ja": "メールアドレス：ben@layer8.net"
    },
    {
      "indent": 3,
      "text": "Kireeti Kompella Juniper Networks 1194 N. Mathilda Ave Sunnyvale, CA 94089 US",
      "ja": "Kireeti Kompellaジュニパーネットワークスの1194 N.マチルダアベニューサニーベール、CA 94089米国"
    },
    {
      "indent": 3,
      "text": "EMail: kireeti@juniper.net",
      "ja": "メールアドレス：kireeti@juniper.net"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2005).",
      "ja": "著作権（C）インターネット協会（2005）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the IETF's procedures with respect to rights in IETF Documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 IETF文書の権利に関するIETFの手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}