{
  "title": {
    "text": "RFC 3722 - String Profile for Internet Small Computer Systems Interface (iSCSI) Names",
    "ja": "RFC 3722 - インターネットの小さなコンピューターシステムインターフェイス（ISCSI）名の文字列プロファイル"
  },
  "number": 3722,
  "created_at": "2023-10-01 17:17:49.628436+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           M. Bakke\nRequest for Comments: 3722                                         Cisco\nCategory: Standards Track                                     April 2004",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "String Profile for Internet Small Computer Systems Interface (iSCSI) Names",
      "ja": "インターネットの小さなコンピューターシステムインターフェイス（ISCSI）名の文字列プロファイル"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "ja": "著作権（c）The Internet Society（2004）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes how to prepare internationalized iSCSI names to increase the likelihood that name input and comparison work in ways that make sense for typical users throughout the world.",
      "ja": "このドキュメントでは、国際化されたISCSI名を準備する方法について説明して、入力と比較が世界中の典型的なユーザーにとって意味のある方法で機能する可能性を高める方法について説明します。"
    },
    {
      "indent": 3,
      "text": "The Internet Small Computer Systems Interface (iSCSI) protocol provides a way for hosts to access SCSI devices over an IP network. The iSCSI end-points, called initiators and targets, each have a globally-unique name that must be transcribable, as well as easily compared.",
      "ja": "インターネットSmall Computer Systems Interface（ISCSI）プロトコルは、ホストがIPネットワークを介してSCSIデバイスにアクセスする方法を提供します。イニシエーターとターゲットと呼ばれるISCSIのエンドポイントには、それぞれが転写可能である必要があり、簡単に比較される必要があるグローバルな名前があります。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The iSCSI protocol [RFC3720] provides a way for hosts to access SCSI [SAM2] devices over an IP network. The iSCSI end-points, called initiators and targets, each have a globally-unique name, defined in [RFC3721].",
      "ja": "ISCSIプロトコル[RFC3720]は、ホストがIPネットワークを介してSCSI [SAM2]デバイスにアクセスする方法を提供します。イニシエーターとターゲットと呼ばれるISCSIのエンドポイントは、それぞれ[RFC3721]で定義されているグローバルに非公式の名前を持っています。"
    },
    {
      "indent": 3,
      "text": "An iSCSI name is a string of UTF-8 [RFC3629] characters that includes a type designator, a naming authority based on domain names, and a unique part within the naming authority. The unique part may be generated based on anything the naming authority deems useful, and may include user input.",
      "ja": "ISCSI名は、型指定子、ドメイン名に基づく命名権限、および命名機関内のユニークな部分を含むUTF-8 [RFC3629]文字の文字列です。一意の部分は、命名当局が有用であるとみなすものに基づいて生成される場合があり、ユーザー入力を含めることができます。"
    },
    {
      "indent": 3,
      "text": "These names may need to be transcribed (sent between two administrators via email, voice, paper, etc), so a case-insensitive comparison would be desirable. However, these names must often be compared by initiator and target implementations, most of which are done in simple, embedded software. This makes case-sensitive comparison highly desirable for these implementors.",
      "ja": "これらの名前は、メール、音声、紙などを介して2つの管理者の間で送信される必要がある場合があるため、ケースに依存しない比較が望ましい場合があります。ただし、これらの名前は、イニシエーターとターゲットの実装によってしばしば比較する必要がありますが、そのほとんどはシンプルな組み込みソフトウェアで行われます。これにより、これらの実装者にとって非常に望ましいケースに敏感な比較が可能になります。"
    },
    {
      "indent": 3,
      "text": "However, a completely case-sensitive implementation would result in identifiers such as \"example-name\" and \"Example-Name\" being different, which could lead to confusion as these names are transcribed.",
      "ja": "ただし、完全にケースに敏感な実装により、「Example-name」や「Example-name」などの識別子が異なり、これらの名前が転写されると混乱が生じる可能性があります。"
    },
    {
      "indent": 3,
      "text": "The goal, then, is to generate iSCSI names that can be transcribed and entered by users, and also compared byte-for-byte, with minimal confusion. To attain these goals, iSCSI names are generalized using a normalized character set (converted to lower case or equivalent), with no white space allowed, and very limited punctuation.",
      "ja": "したがって、目標は、ユーザーが転写および入力できるISCSI名を生成し、最小限の混乱でbyte-for-byteを比較することです。これらの目標を達成するために、ISCSI名は正規化された文字セット（小文字または同等物に変換）を使用して一般化され、空白が許可されず、句読点は非常に限られています。"
    },
    {
      "indent": 3,
      "text": "For those using only ASCII characters (U+0000 to U+007F), the following characters are allowed:",
      "ja": "ASCII文字のみを使用している場合（U 0000〜U 007F）、次の文字が許可されます。"
    },
    {
      "indent": 3,
      "text": "- ASCII dash character ('-' = U+002d) - ASCII dot character ('.' = U+002e) - ASCII colon character (':' = U+003a) - ASCII lower-case characters ('a'..'z' = U+0061..U+007a) - ASCII digit characters ('0'..'9' = U+0030..U+0039)",
      "ja": "- ASCII DASH文字（ ' - ' = U 002D） -  ASCIIドット文字（ '。' = U 002E） -  ASCIIコロン文字（ '：' = U 003a） -  ASCII低ケース文字（ 'A' .. 'z'= u 0061..u 007a） -  ascii digit文字（ '0' .. '9' = u 0030..u 0039）"
    },
    {
      "indent": 3,
      "text": "In addition, any upper-case characters input via a user interface MUST be mapped to their lower-case equivalents.",
      "ja": "さらに、ユーザーインターフェイスを介して入力される上部ケースの文字は、より低いケースの同等物にマッピングする必要があります。"
    },
    {
      "indent": 3,
      "text": "This document specifies the valid character set for iSCSI names, along with the rules for normalizing and generating iSCSI names based on user input or other information that contains international characters.",
      "ja": "このドキュメントは、ISCSI名の有効な文字セットを指定し、ユーザー入力または国際文字を含むその他の情報に基づいてISCSI名を正規化および生成するためのルールを指定します。"
    },
    {
      "indent": 3,
      "text": "In particular, it defines the following, as required by [RFC3454]:",
      "ja": "特に、[RFC3454]で要求されるように、次のものを定義します。"
    },
    {
      "indent": 3,
      "text": "- The intended applicability of the profile: internationalized iSCSI names.",
      "ja": "- プロファイルの意図された適用性：国際化されたISCSI名。"
    },
    {
      "indent": 3,
      "text": "- The character repertoire that is the input and output to stringprep: Unicode 3.2, specified in section 3.",
      "ja": "- StringPrepの入力と出力であるキャラクターレパートリー：Unicode 3.2、セクション3で指定されています。"
    },
    {
      "indent": 3,
      "text": "- The mappings used: specified in section 4.",
      "ja": "- 使用されるマッピング：セクション4で指定されています。"
    },
    {
      "indent": 3,
      "text": "- The Unicode normalization used: specified in section 5.",
      "ja": "- 使用されるユニコード正規化：セクション5で指定されています。"
    },
    {
      "indent": 3,
      "text": "- The characters that are prohibited as output: specified in section 6.",
      "ja": "- 出力として禁止されている文字：セクション6で指定されています。"
    },
    {
      "indent": 3,
      "text": "This profile MUST be used with the iSCSI protocol.",
      "ja": "このプロファイルは、ISCSIプロトコルで使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "「必須」、「そうしない」、「必須」、「shall」、「shall \"、\" ingle \"、\" should \"、\" not \"、\" becommended \"、\" bay \"、および「optional」は、[RFC2119]に記載されているように解釈される。"
    },
    {
      "indent": 3,
      "text": "Examples in this document use the notation for code points and names from the Unicode Standard [Unicode3.2] and ISO/IEC 10646 [ISO10646]. For example, the letter \"a\" may be represented as either \"U+0061\" or \"LATIN SMALL LETTER A\". In the lists of prohibited characters, the \"U+\" is left off to make the lists easier to read. The comments for character ranges are shown in square brackets (such as \"[SYMBOLS]\") and do not come from the standards.",
      "ja": "このドキュメントの例は、Unicode標準[Unicode3.2]およびISO/IEC 10646 [ISO10646]のコードポイントと名前の表記を使用します。たとえば、「a」という文字は、「u 0061」または「ラテン語の小さな文字a」のいずれかとして表される場合があります。禁止されているキャラクターのリストでは、「u」はリストの読み取りを容易にするために残されています。キャラクターの範囲に対するコメントは、四角い括弧（「[シンボル]」など）で表示され、標準から来ていません。"
    },
    {
      "indent": 0,
      "text": "3. Character Repertoire",
      "section_title": true,
      "ja": "3. キャラクターレパートリー"
    },
    {
      "indent": 3,
      "text": "This profile uses Unicode 3.2, as defined in [RFC3454] Appendix A.",
      "ja": "このプロファイルは、[RFC3454]で定義されているように、Unicode 3.2を使用します。付録A"
    },
    {
      "indent": 0,
      "text": "4. Mapping",
      "section_title": true,
      "ja": "4. マッピング"
    },
    {
      "indent": 3,
      "text": "This profile specifies mapping using the following tables from [RFC3454]. The following mapping tables MUST be used when generating iSCSI names from Unicode characters.",
      "ja": "このプロファイルは、[RFC3454]の次の表を使用してマッピングを指定します。Unicode文字からISCSI名を生成するときは、次のマッピングテーブルを使用する必要があります。"
    },
    {
      "indent": 6,
      "text": "Table B.1 Table B.2",
      "ja": "表B.1表B.2"
    },
    {
      "indent": 0,
      "text": "5. Normalization",
      "section_title": true,
      "ja": "5. 正規化"
    },
    {
      "indent": 3,
      "text": "Unicode normalization form KC MUST be used with this profile, as described in [RFC3454].",
      "ja": "[RFC3454]に記載されているように、このプロファイルでは、Unicode正規化形式を使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. Prohibited Output",
      "section_title": true,
      "ja": "6. 禁止出力"
    },
    {
      "indent": 3,
      "text": "This profile specifies prohibiting using the following tables from [RFC3454]. Characters appearing within these tables MUST NOT be used within an iSCSI name.",
      "ja": "このプロファイルは、[RFC3454]の次の表を使用して禁止することを指定します。これらのテーブル内に表示される文字は、ISCSI名内で使用してはなりません。"
    },
    {
      "indent": 6,
      "text": "Table C.1.1 Table C.1.2 Table C.2.1 Table C.2.2 Table C.3 Table C.4 Table C.5 Table C.6 Table C.7 Table C.8 Table C.9",
      "ja": "表C.1.1表C.1.2表C.2.1表C.2.2表C.3表C.3表C.4表C.6表C.7表C.7表C.8表C.9"
    },
    {
      "indent": 3,
      "text": "Important note: this profile MUST be used with the iSCSI protocol. The iSCSI protocol has additional naming rules that are checked outside of this profile.",
      "ja": "重要な注意：このプロファイルは、ISCSIプロトコルで使用する必要があります。ISCSIプロトコルには、このプロファイルの外でチェックされる追加の命名ルールがあります。"
    },
    {
      "indent": 3,
      "text": "In addition, this profile adds the following prohibitions. The full set of prohibited characters are those from the tables above plus those listed individually below.",
      "ja": "さらに、このプロファイルは次の禁止を追加します。禁止されている文字の完全なセットは、上記のテーブルに加えて、以下に個別にリストされている文字です。"
    },
    {
      "indent": 0,
      "text": "6.1. Inappropriate Characters from Common Input Mechanisms",
      "section_title": true,
      "ja": "6.1. 一般的な入力メカニズムからの不適切な文字"
    },
    {
      "indent": 3,
      "text": "u+3002 is used as if it were u+002e in many domain name input mechanisms used by applications, particularly in Asia. The character u+3002 MUST NOT be used in an iSCSI name.",
      "ja": "U 3002は、アプリケーション、特にアジアで使用される多くのドメイン名入力メカニズムでU 002Eであるかのように使用されています。文字u 3002は、iSCSI名で使用してはなりません。"
    },
    {
      "indent": 6,
      "text": "3002; ideographic full stop",
      "ja": "3002;表意的なフルストップ"
    },
    {
      "indent": 0,
      "text": "6.2. Currently-prohibited ASCII characters",
      "section_title": true,
      "ja": "6.2. 現在非難されているASCII文字"
    },
    {
      "indent": 3,
      "text": "Some of the ASCII characters that are currently prohibited in iSCSI names by [RFC3721] are also used in protocol elements such as URIs. Some examples are described in [RFC2396] and [RFC2732]. Note that there are many other RFCs that define additional URI schemes.",
      "ja": "[RFC3721]によってISCSI名で現在禁止されているASCII文字の一部は、URISなどのプロトコル要素でも使用されています。[RFC2396]および[RFC2732]で説明されています。追加のURIスキームを定義する他の多くのRFCがあることに注意してください。"
    },
    {
      "indent": 3,
      "text": "The other characters in the range U+0000 to U+007F that are not currently allowed are prohibited in iSCSI names to reserve them for future use in protocol elements. Note that the dash (U+002D), dot (U+002E), and colon (U+003A) are not prohibited.",
      "ja": "現在許可されていないU 0000からU 007Fの範囲の他の文字は、ISCSI名で禁止されており、プロトコル要素での将来の使用のためにそれらを予約します。ダッシュ（u 002d）、ドット（u 002e）、およびコロン（u 003a）は禁止されていないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "The following characters MUST NOT be used in iSCSI names:",
      "ja": "次の文字をISCSI名で使用してはいけません。"
    },
    {
      "indent": 6,
      "text": "0000-002C; [ASCII CONTROL CHARACTERS and SPACE through ,]\n002F; [ASCII /]\n003B-0040; [ASCII ; through @]\n005B-0060; [ASCII [ through `]\n007B-007F; [ASCII { through DEL]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7. Bidirectional Characters",
      "section_title": true,
      "ja": "7. 双方向の文字"
    },
    {
      "indent": 3,
      "text": "This profile specifies checking bidirectional strings as described in [RFC3454] section 6.",
      "ja": "このプロファイルは、[RFC3454]セクション6で説明されているように、双方向文字列のチェックを指定します。"
    },
    {
      "indent": 0,
      "text": "8. Unassigned Code Points in Internationalized Domain Names",
      "section_title": true,
      "ja": "8. 国際化されたドメイン名の未割り当てのコードポイント"
    },
    {
      "indent": 3,
      "text": "If the processing in [RFC3720] specifies that a list of unassigned code points be used, the system uses table A.1 from [RFC3454] as its list of unassigned code points.",
      "ja": "[RFC3720]の処理が、割り当てされていないコードポイントのリストを使用することを指定した場合、システムは[RFC3454]の表A.1を、割り当てられていないコードポイントのリストとして使用します。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "ISO/IEC 10646 has many characters that look similar. In many cases, users of security protocols might do visual matching, such as when comparing the names of trusted third parties. This profile does nothing to map similar-looking characters together.",
      "ja": "ISO/IEC 10646には、似たように見える多くの文字があります。多くの場合、セキュリティプロトコルのユーザーは、信頼できるサードパーティの名前を比較する場合など、視覚的なマッチングを行う場合があります。このプロファイルは、似たような文字を一緒にマッピングするために何もしません。"
    },
    {
      "indent": 3,
      "text": "iSCSI names may be used by an initiator to verify that a target it has discovered is the correct one, and by a target to verify that an initiator is to be allowed access. If these names are interpreted and compared differently by different iSCSI implementations, an initiator could gain access to the wrong target, or could be denied access to a legitimate target.",
      "ja": "ISCSI名は、イニシエーターが発見したターゲットが正しいものであることを確認し、イニシエーターがアクセスを許可されることを確認するためのターゲットによって使用される場合があります。これらの名前が異なるISCSI実装によって解釈および比較された場合、イニシエーターは間違ったターゲットにアクセスできるか、正当なターゲットへのアクセスを拒否される可能性があります。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "ja": "10. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This is a profile of stringprep. It has been registered in the IANA \"Stringprep Profiles\" registry. This process is described in the IANA Considerations section of [RFC3454].",
      "ja": "これはStringPrepのプロファイルです。IANAの「StringPrep Profiles」レジストリに登録されています。このプロセスは、[RFC3454]のIANAに関する考慮事項セクションで説明されています。"
    },
    {
      "indent": 0,
      "text": "11. Summary",
      "section_title": true,
      "ja": "11. まとめ"
    },
    {
      "indent": 3,
      "text": "This document describes a stringprep profile to be used with programs generating names for iSCSI initiators and targets.",
      "ja": "このドキュメントでは、ISCSIイニシエーターとターゲットの名前を生成するプログラムで使用されるString -Prepプロファイルについて説明します。"
    },
    {
      "indent": 0,
      "text": "12. Acknowledgements",
      "section_title": true,
      "ja": "12. 謝辞"
    },
    {
      "indent": 3,
      "text": "This document was produced as a result of discussions on iSCSI name formats with Joe Czap, Jim Hafner, Howard Hall, Jack Harwood, John Hufferd, Marjorie Krueger, Lawrence Lamers, Todd Sperry, Joshua Tseng, and Kaladhar Voruganti, as well as discussions on the normalization of names into identifiers with Paul Hoffman and Marc Blanchet.",
      "ja": "この文書は、Joe Czap、Jim Hafner、Howard Hall、Jack Harwood、John Hufferd、Marjorie Krueger、Lawrence Lamers、Todd Sperry、Joshua Tseng、Kaladhar VorugantiとのISCSI名形式に関する議論の結果として作成されました。ポール・ホフマンとマーク・ブランシェットとの識別子への名前の正規化。"
    },
    {
      "indent": 3,
      "text": "Thanks also to Bob Snively for suggesting the use of the nameprep process for iSCSI name normalization.",
      "ja": "ISCSI名の正規化のためにNAMEPREPプロセスの使用を提案してくれたBob Snivelyにも感謝します。"
    },
    {
      "indent": 3,
      "text": "Most of this document was copied from the stringprep profile for Internationalized Domain Names [RFC3491], written by Paul Hoffman and Marc Blanchet.",
      "ja": "このドキュメントのほとんどは、Paul HoffmanとMarc Blanchetによって書かれた国際化ドメイン名[RFC3491]のStringPrepプロファイルからコピーされました。"
    },
    {
      "indent": 0,
      "text": "13. References",
      "section_title": true,
      "ja": "13. 参考文献"
    },
    {
      "indent": 0,
      "text": "13.1. Normative References",
      "section_title": true,
      "ja": "13.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3454] Hoffman, P. and M. Blanchet, \"Preparation of Internationalized Strings (\"stringprep\")\", RFC 3454, December 2002.",
      "ja": "[RFC3454] Hoffman、P。およびM. Blanchet、「国際化された文字列の準備（「StringPrep」）」、RFC 3454、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3720] Satran, J., Meth, K., Sapuntzakis, C. Chadalapaka, M. and E. Zeidner, \"Internet Small Computer Systems Interface (iSCSI)\", RFC 3720, April 2004.",
      "ja": "[RFC3720] Satran、J.、Meth、K.、Sapuntzakis、C。Chadalapaka、M。およびE. Zeidner、「Internet Small Computer Systems Interface（ISCSI）」、RFC 3720、2004年4月。"
    },
    {
      "indent": 0,
      "text": "13.2. Informative References",
      "section_title": true,
      "ja": "13.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC2396] Berners-Lee, T., Fielding, R. and L. Masinter, \"Uniform Resource Identifiers\", RFC 2396, August 1998.",
      "ja": "[RFC2396] Berners-Lee、T.、Fielding、R。and L. Masinter、「Uniform Resource Identiers」、RFC 2396、1998年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC2732] Hinden, R., Carpenter, B. and L. Masinter, \"Format for Literal IPv6 Addresses in URL's\", RFC 2732, December 1999.",
      "ja": "[RFC2732] Hinden、R.、Carpenter、B。and L. Masinter、「URLのリテラルIPv6アドレスの形式」、RFC 2732、1999年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC3491] Hoffman, P. and M. Blanchet, \"Nameprep: A Stringprep Profile for Internationalized Domain Names\", RFC 3491, March 2003. [RFC3629] Yergeau, F., \"UTF-8, a transformation format of ISO 10646\", STD 63, RFC 3629, November 2003.",
      "ja": "[RFC3491] Hoffman、P。and M. Blanchet、「Nameprep：A String-Prepプロファイルの国際化されたドメイン名」、RFC 3491、2003年3月。、STD 63、RFC 3629、2003年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC3721] Bakke, M., Hafner, J., Hufferd, J., Voruganti, K. and M. Krueger, \"Internet Small Computer Systems Interface (iSCSI) Naming and Discovery\", RFC 3721, April 2004.",
      "ja": "[RFC3721] Bakke、M.、Hafner、J.、Hufferd、J.、Voruganti、K。、およびM. Krueger、「インターネットスモールコンピューターシステムインターフェイス（ISCSI）ネーミングと発見」、RFC 3721、2004年4月。"
    },
    {
      "indent": 3,
      "text": "[SAM2] ANSI T10. \"SCSI Architectural Model 2\", March 2000.",
      "ja": "[SAM2] ANSI T10。「SCSI Architectural Model 2」、2000年3月。"
    },
    {
      "indent": 3,
      "text": "[Unicode3.2] The Unicode Standard, Version 3.2.0: The Unicode Consortium. The Unicode Standard, Version 3.2.0 is defined by The Unicode Standard, Version 3.0 (Reading, MA, Addison-Wesley, 2000. ISBN 0-201-61633-5), as amended by the Unicode Standard Annex #27: Unicode 3.1 (http://www.unicode.org/unicode/reports/tr27/) and by the Unicode Standard Annex #28: Unicode 3.2 (http://www.unicode.org/unicode/reports/tr28/).",
      "ja": "[Unicode3.2] Unicode標準、バージョン3.2.0：Unicodeコンソーシアム。Unicode標準バージョン3.2.0は、Unicode Standard Annex＃27：Unicode 3.1で修正された、Unicode標準バージョン3.0（読書、MA、Addison-Wesley、2000。ISBN0-201-61633-5）で定義されています。（http://www.unicode.org/unicode/reports/tr27/）およびUnicode Standard Annex＃28：Unicode 3.2（http://www.unicode.org/unicode/Reports/tr28/）。"
    },
    {
      "indent": 3,
      "text": "[ISO10646] ISO/IEC 10646-1:2000. International Standard -- Information technology -- Universal Multiple-Octet Coded Character Set (UCS) -- Part 1: Architecture and Basic Multilingual Plane.",
      "ja": "[ISO10646] ISO/IEC 10646-1：2000。国際標準 - 情報技術 - ユニバーサルマルチオクテットコード化された文字セット（UCS） - パート1：アーキテクチャと基本的な多言語プレーン。"
    },
    {
      "indent": 0,
      "text": "14. Author's Address",
      "section_title": true,
      "ja": "14. 著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Mark Bakke Cisco Systems, Inc. 6450 Wedgwood Road Maple Grove, MN USA 55311",
      "ja": "Mark Bakke Cisco Systems、Inc。6450 Wedgwood Road Maple Grove、MN USA 55311"
    },
    {
      "indent": 3,
      "text": "Voice: +1 763-398-1000\nEMail: mbakke@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "15. Full Copyright Statement",
      "section_title": true,
      "ja": "15. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（c）The Internet Society（2004）。この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、この文書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスがどの程度であるかについての使用に関連すると主張する可能性があるという立場はありません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要なテクノロジーをカバーする可能性のあるその他の独自の権利を注意深く招待します。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}