{
  "title": {
    "text": "RFC 3843 - RObust Header Compression (ROHC): A Compression Profile for IP",
    "ja": "RFC 3843 - ロバストヘッダ圧縮（ROHC）：IPの圧縮プロフィール"
  },
  "number": 3843,
  "created_at": "2019-10-24 05:15:23.926553+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       L-E. Jonsson\nRequest for Comments: 3843                                  G. Pelletier\nCategory: Standards Track                                       Ericsson\n                                                               June 2004",
      "raw": true
    },
    {
      "indent": 4,
      "text": "RObust Header Compression (ROHC): A Compression Profile for IP",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（C）インターネット協会（2004）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The original RObust Header Compression (ROHC) RFC (RFC 3095) defines a framework for header compression, along with compression protocols (profiles) for IP/UDP/RTP, IP/ESP (Encapsulating Security Payload), IP/UDP, and also a profile for uncompressed packet streams. However, no profile was defined for compression of IP only, which has been identified as a missing piece in RFC 3095. This document defines a ROHC compression profile for IP, similar to the IP/UDP profile defined by RFC 3095, but simplified to exclude UDP, and enhanced to compress IP header chains of arbitrary length.",
      "ja": "元のロバストヘッダ圧縮（ROHC）RFC（RFC 3095）は、IP / UDP / RTP、IP / ESP（カプセル化セキュリティペイロード）、IP / UDPの圧縮プロトコル（プロファイル）と一緒に、ヘッダ圧縮のためのフレームワークを定義し、また非圧縮パケットストリームのプロファイル。しかし、プロファイルがRFC 3095.この文書は、RFC 3095で定義されたIP / UDPプロファイルに似IPのためのROHC圧縮プロファイルを定義で行方不明の作品として同定されている唯一のIP、の圧縮のために定義されなかったが、除外するように簡略化UDP、および任意の長さのIPヘッダチェーンを圧縮するように拡張。"
    },
    {
      "indent": 3,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Terminology. . . . . . . . . . . . . . . . . . . . . . . . . .  2\n3.  ROHC IP Compression (Profile 0x0004) . . . . . . . . . . . . .  3\n    3.1.  Static Chain Termination . . . . . . . . . . . . . . . .  3\n    3.2.  Handling Multiple Levels of IP Headers . . . . . . . . .  3\n    3.3.  Constant IP-ID . . . . . . . . . . . . . . . . . . . . .  4\n    3.4.  Additional Mode Transition Logic . . . . . . . . . . . .  6\n    3.5.  Initialization . . . . . . . . . . . . . . . . . . . . .  8\n    3.6.  Packet Types . . . . . . . . . . . . . . . . . . . . . .  8\n    3.7.  The CONTEXT_MEMORY Feedback Option . . . . . . . . . . . 10\n4.  Security Considerations. . . . . . . . . . . . . . . . . . . . 10\n5.  IANA Considerations. . . . . . . . . . . . . . . . . . . . . . 10\n6.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 10\n7.  Normative References . . . . . . . . . . . . . . . . . . . . . 11",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Appendix A.  Detailed Procedures for Canceling Mode Transitions. . 12\n    A.1.  Transition from Optimistic to Reliable Mode. . . . . . . 12\n    A.2.  Transition from Unidirectional to Reliable Mode. . . . . 13\n    A.3.  Transition from Reliable to Optimistic Mode. . . . . . . 13\n    A.4.  Transition Back to Unidirectional Mode . . . . . . . . . 14\nAuthors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 15\nFull Copyright Statement . . . . . . . . . . . . . . . . . . . . . 16",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The original RObust Header Compression (ROHC) RFC [RFC-3095] defines a framework for header compression, along with compression protocols (profiles) for IP/UDP/RTP, IP/ESP (Encapsulating Security Payload), IP/UDP, and also a profile for uncompressed packet streams. The profile for uncompressed data was defined to provide a means to encapsulate all traffic over a link within ROHC packets. Through this profile, the lower layers do not have to provide multiplexing for different packet types, but instead ROHC can handle any packet stream, even if compression profiles for all kinds of packet streams have not yet been defined or implemented over the link.",
      "ja": "また、元のロバストヘッダ圧縮（ROHC）RFC [RFC-3095] IP / UDP / RTPの圧縮プロトコル（プロファイル）、IP / ESP（カプセル化セキュリティペイロード）と一緒に、ヘッダ圧縮のためのフレームワークを定義し、IP / UDP、および非圧縮パケットストリームのためのプロファイル。非圧縮データのプロファイルは、ROHCパケット内のリンク上のすべてのトラフィックをカプセル化する手段を提供するために定義されました。このプロファイルによって、パケットストリームのすべての種類の圧縮プロフィールがまだ定義されたか、リンクの上に実装されていない場合でも、下位層は、異なるパケットタイプのための多重化を提供する必要はありませんが、その代わりROHCは、任意のパケットストリームを処理することができます。"
    },
    {
      "indent": 3,
      "text": "Although the profile without compression is simple and can tunnel arbitrary packets, it has of course a major weakness in that it does not compress the headers at all. When considering that normally all packets are expected to be IP [RFC-791, RFC-2460] packets, and that the IP header often represents a major part of the total header, a useful alternative to no compression would for most packets be compression of the IP header only. Unfortunately, such a profile was not defined in [RFC-3095], and this has thus been identified as an important missing piece in the ROHC toolbox.",
      "ja": "圧縮せずにプロファイルが簡単であり、できトンネルの任意のパケットが、もちろんそれがすべてのヘッダーを圧縮しないことで主要な弱点を有しています。通常、すべてのパケットがIP [RFC-791、RFC-2460]パケットであると予想され、IPヘッダはしばしば総ヘッダの主要な部分を表している、圧縮なしに有用な代替は、ほとんどのパケットのための圧縮であろうことを考慮した場合唯一のIPヘッダー。残念ながら、そのようなプロファイルは、[RFC-3095]で定義されていないし、これは、このようにROHCツールボックスの重要な欠落部分として同定されています。"
    },
    {
      "indent": 3,
      "text": "This document addresses this missing compression support and defines a ROHC compression profile for IP [RFC-791, RFC-2460] only, similar to the IP/UDP profile defined by [RFC-3095], but simplified to exclude UDP. Due to the similarities with the IP/UDP profile, the IP compression profile is described based on the IP/UDP profile, mainly covering differences. The most important differences are a different way of terminating the static header chain, and the capability of compressing IP header chains of arbitrary length.",
      "ja": "この文書では、アドレスこの欠落している圧縮のサポートをし、IP [RFC-791、RFC-2460]のためのROHC圧縮プロファイルを定義するだけで、[RFC-3095]で定義されたIP / UDPプロファイルに似ていますが、UDPを除外するために簡素化。 IP / UDPプロファイルとの類似性に起因する、IP圧縮プロファイルは、主に相違点をカバーし、IP / UDPプロファイルに基づいて説明します。最も重要な違いは、静的なヘッダーチェーンを終了する別の方法、および任意の長さのIPヘッダチェーンを圧縮する機能です。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC-2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC-2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "ROHC UDP",
      "ja": "ROHC UDP"
    },
    {
      "indent": 6,
      "text": "\"ROHC UDP\" in this document refers to the IP/UDP profile (Profile 0x0002) as defined in [RFC-3095].",
      "ja": "[RFC-3095]で定義されるように、この文書に記載されている \"ROHC UDPは、\" IP / UDPプロファイル（プロファイル0×0002）を指します。"
    },
    {
      "indent": 0,
      "text": "3. ROHC IP Compression (Profile 0x0004)",
      "section_title": true,
      "ja": "3. ROHC IP圧縮（プロフィール0x0004は）"
    },
    {
      "indent": 3,
      "text": "In general, there are no major differences between the ROHC UDP profile and the IP profile (ROHC IP) defined in this document, since the removal of UDP has no impact on the compression mechanisms in principle. As for ROHC UDP, the compressor generates a 16-bit sequence number which increases by one for each packet compressed in the packet stream, simply called SN below. The most important difference between this profile and ROHC UDP is about static chain termination and the handling of multiple IP headers. Unless stated explicitly below, mechanisms and formats are the same as for ROHC UDP.",
      "ja": "一般的には、ROHC UDPプロフィールやIPプロファイル（ROHC IP）UDPの除去は、原則的に圧縮機構に影響を与えないことから、この文書で定義された間には大きな違いはありません。 ROHC UDPのように、圧縮器はパケットストリームに圧縮される各パケットに対して1つずつ増加する16ビットのシーケンス番号は、単に以下SNと呼ばれる生成します。このプロファイルとROHC UDPの間の最も重要な違いは、静的な連鎖停止と複数のIPヘッダの扱いについてです。明示的に以下の記載がない限り、メカニズムやフォーマットはROHC UDPの場合と同じです。"
    },
    {
      "indent": 0,
      "text": "3.1. Static Chain Termination",
      "section_title": true,
      "ja": "3.1。静的鎖終結"
    },
    {
      "indent": 3,
      "text": "One difference for IP-only compression, compared to IP/UDP compression, is related to the termination of the static chain in IR headers. For the UDP profile, the chain always ends with a UDP header part, which per definition provides the boundaries for the chain. The UDP header is also the last header in the uncompressed packet (except for a potential application header). For the IP-only profile, there is no single last header that per profile definition terminates the chain. Instead, the static chain is terminated if the \"Next Header / Protocol\" field of a static IP header part indicates anything but IP (IPinIP or IPv6). Alternatively, the compressor can choose to end the static chain at any IP header, and indicate this by setting the MSB of the IP version field to 1 (0xC for IPv4 or 0xE for IPv6). The decompressor must store this indication in the context for correct decompression of subsequent headers. Note that the IP version field in decompressed headers must be restored to its original value.",
      "ja": "IP / UDP圧縮に比べIPのみの圧縮のための1つの違いは、IRヘッダの静的鎖の終了に関連しています。 UDPプロファイルのために、鎖は常に定義ごとにチェーンの境界を提供するUDPヘッダ部で終わります。 UDPヘッダは、（潜在的なアプリケーションヘッダを除く）も、非圧縮パケット内の最後のヘッダです。 IPのみのプロファイルの場合、プロファイルごとに定義がチェーンを終了することを単一の最後のヘッダがありません。静的IPヘッダ部の「次ヘッダ/プロトコル」フィールドは、IP（のIPinIPまたはIPv6）以外のものを示している場合代わりに、静的チェーンが終了します。代替的に、圧縮機は、任意のIPヘッダに静的チェーンを終了することを選択し、そして1（IPv6のIPv4またはから0xE用から0xC）にIPバージョンフィールドのMSBを設定することによって、これを示すことができます。減圧装置は、後続のヘッダの正しい解凍用コンテキストでこの指示を記憶しなければなりません。解凍されたヘッダーのIPバージョンフィールドが元の値に復元されなければならないことに注意してください。"
    },
    {
      "indent": 0,
      "text": "3.2. Handling Multiple Levels of IP Headers",
      "section_title": true,
      "ja": "3.2。 IPヘッダの複数レベルの処理"
    },
    {
      "indent": 3,
      "text": "The ROHC IR and IR-DYN packets defined in [RFC-3095] are used to communicate static and/or dynamic parts of a context. For each of the compression profiles defined in [RFC-3095], there is a single last header in the header chain that clearly marks the termination of the static chain. The length of the dynamic chain is then inferred from the static chain in the IR header itself, or from the static chain in the context for the IR-DYN header. The length of both static and dynamic chains may thus be of arbitrary length and may, in theory, initialize a context with an arbitrary number of IP levels.",
      "ja": "[RFC-3095]で定義されたROHC IR及びIR-DYNパケットは、コンテキストの静的および/または動的部品を通信するために使用されます。 [RFC-3095]で定義された圧縮プロファイルのそれぞれについて、明らかに静的チェーンの終了をマークヘッダチェーン内の単一の最後のヘッダが存在します。動的鎖の長さは、次に、IRヘッダ自体の静的鎖から、またはIR-DYNヘッダーのコンテキストで静的チェーンから推論されます。静的および動的両方の鎖の長さは、このように任意の長さのものであってもよいと、理論的には、IPレベルの任意の数のコンテキストを初期化することができます。"
    },
    {
      "indent": 3,
      "text": "However, the general compressed header formats defined in [RFC-3095, section 5.7.] specifies that at most two levels of IP headers (the 'Inner' and the 'Outer' level of IP headers) may be included in a compressed header. Specifically, the format defined for Extension 3 [RFC-3095, section 5.7.5.] can only carry one single 'Outer' IP header. In addition, while list compression may be used to compress other types of headers, it cannot be used to compress additional IP headers, as IP headers may not be part of an extension header chain in compressed headers [RFC-3095, section 5.8.].",
      "ja": "しかし、[RFC-3095、セクション5.7。]で定義された一般的な圧縮ヘッダフォーマットはIPヘッダのほとんどの二つのレベルで（「内部」及びIPヘッダの「外側」レベル）が圧縮されたヘッダに含まれてもよいことを指定します。具体的には、エクステンション3について定義されたフォーマット[RFC-3095、セクション5.7.5。]ただ1つの「外部」IPヘッダを運ぶことができます。リスト圧縮ヘッダーの他のタイプを圧縮するために使用することができるがIPヘッダが圧縮ヘッダ内の拡張ヘッダチェーンの一部でなくてもよいように加えて、付加的なIPヘッダを圧縮するために使用できません[RFC-3095、セクション5.8。] 。"
    },
    {
      "indent": 3,
      "text": "For the compression profiles defined in [RFC-3095], the consequence is that at most two levels of IP headers can be compressed. In other words, the presence of additional IP headers at best partially disables header compression, as the compressor will only be allowed to send IR and IR-DYN packets in such cases.",
      "ja": "[RFC-3095]で定義された圧縮プロファイルの場合、結果は、IPヘッダーの最大2つのレベルを圧縮することができることです。圧縮機のみこのような場合にはIR及びIR-DYNパケットを送信することを許可されるように、換言すれば、最高の状態で追加のIPヘッダの存在は、部分的に、ヘッダ圧縮を無効にします。"
    },
    {
      "indent": 3,
      "text": "For the compression of IP headers only, the additional IP headers would however not have to cause header compression to be disabled because there is no single packet type that ends the compressed chain. The excess IP headers could simply be left uncompressed by implicitly terminating the static and dynamic chains after at most two levels of IP headers.",
      "ja": "IPヘッダのみの圧縮のために、追加のIPヘッダーは、しかし、圧縮されたチェーンを終了単一パケットタイプが存在しないため、ヘッダ圧縮が無効にさせる必要がありません。余分なIPヘッダは単に暗黙的にIPヘッダの高々二つのレベルの後に静的および動的なチェーンを終了させることによって、非圧縮のままにすることができます。"
    },
    {
      "indent": 3,
      "text": "The IP-only profile defined in this document goes one step further and supports compression of an arbitrary number of IP levels. This is achieved by adding a dynamic chain to the general format of compressed headers, to include the header part of each IP level in excess of the first two.",
      "ja": "この文書で定義されたIP-のみのプロファイルは、さらに一歩進んで、IPレベルの任意の数の圧縮をサポートしています。これは、最初の2つ以上の各IPレベルのヘッダの一部を含むように、圧縮されたヘッダの一般的なフォーマットに動的鎖を添加することによって達成されます。"
    },
    {
      "indent": 3,
      "text": "As explained above, the static chain within IR packets can be of arbitrary length, and the chain is terminated by the presence of a non-IP header (not IPinIP nor IPv6). Alternatively, the chain may be explicitly terminated with a special code value in the IP version field, as described in section 3.1. The dynamic chain is structured analogously.",
      "ja": "以上説明したように、IRパケット内の静的鎖は任意の長さにすることができ、そして鎖は、非IPヘッダ（ないのIPinIPものIPv6）の存在によって終了されます。セクション3.1で説明したように代替的には、鎖は、明示的に、IPバージョンフィールドの特殊コード値で終了してもよいです。動的鎖を同様に構成されています。"
    },
    {
      "indent": 3,
      "text": "For compressed headers, the information related to the initial two IP headers is carried as for the IP/UDP profile, and a chain of dynamic header information is added to the end of the compressed header for each and every additional IP header. Thus, this additional data structure is exactly the same as the one used in IR and IR-DYN packets. The length of the chain is inferred from the chain of static parameters in the context. While a dynamic chain carries dynamically changing parameters using an uncompressed representation, this ensures that flows with arbitrary levels of IP headers will not impair compression efficiency.",
      "ja": "圧縮ヘッダのため、最初の2つのIPヘッダに関連する情報は、IP / UDPプロファイル用として搭載しており、動的ヘッダ情報の鎖は、それぞれ、すべての付加的なIPヘッダの圧縮ヘッダの末尾に付加されます。したがって、この追加のデータ構造は、IR及びIR-DYNパケットで使用されるものと全く同じです。鎖の長さは、コンテキスト内の静的パラメータの鎖から推論されます。動的チェーンが動的非圧縮表現を使用してパラメータを変更担持し、これはIPヘッダの任意のレベルのフローが圧縮効率を損なわないことを保証します。"
    },
    {
      "indent": 0,
      "text": "3.3. Constant IP-ID",
      "section_title": true,
      "ja": "3.3。一定のIP-ID"
    },
    {
      "indent": 3,
      "text": "Most IPv4 stacks assign an IP-ID according to the value of a counter, increasing by one for each outgoing packet. ROHC UDP compresses the IP-ID field using offset IP-ID encoding based on the UDP SN [RFC-3095]. For stacks generating IP-ID values using a pseudo-random number generator, the field is not compressed and is sent as-is in its entirety as additional octets after the compressed header.",
      "ja": "ほとんどのIPv4スタックは、各発信パケットについて1つずつ増加、カウンタの値に従ってIP-IDを割り当てます。 ROHC UDPは、UDP SN [RFC-3095]に基づくオフセットIP-IDのエンコードを使用してIP-IDフィールドを圧縮します。擬似乱数生成器を用いて、IP-ID値を生成するスタックのため、フィールドは圧縮されておらず、圧縮されたヘッダーの後に追加のオクテットとしてその全体がそのまま送信されます。"
    },
    {
      "indent": 3,
      "text": "Cases have also been found where an IPv4 stack uses a constant value for the IP Identifier. When the IP-ID field is constant, it cannot be compressed using offset IP-ID encoding and the field must be sent in its entirety. This overhead can be avoided with the addition of a flag within the dynamic part of the chain used to initialize the IPv4 header, as follow:",
      "ja": "IPv4スタックは、IP識別子の定数値を使用する場合場合も見出されています。 IP-IDフィールドが一定である場合、それはオフセットIP-IDの符号化を用いて圧縮することができず、フィールドは、その全体が送信されなければなりません。このオーバーヘッドは以下のように、IPv4ヘッダを初期化するために使用されるチェーンの動的部分内にフラグを添加して回避することができます。"
    },
    {
      "indent": 3,
      "text": "Dynamic part:",
      "ja": "ダイナミックパート："
    },
    {
      "indent": 6,
      "text": "+---+---+---+---+---+---+---+---+\n|        Type of Service        |\n+---+---+---+---+---+---+---+---+\n|         Time to Live          |\n+---+---+---+---+---+---+---+---+\n/        Identification         /   2 octets\n+---+---+---+---+---+---+---+---+\n| DF|RND|NBO|SID|       0       |\n+---+---+---+---+---+---+---+---+\n/ Generic extension header list /  variable length\n+---+---+---+---+---+---+---+---+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "SID: Static IP Identifier.",
      "ja": "SID：静的IP識別子。"
    },
    {
      "indent": 6,
      "text": "For IR and IR-DYN packets, the logic is the same as for ROHC UDP with the addition that field(SID) must be kept in the context.",
      "ja": "IR及びIR-DYNパケットの場合、ロジックは、フィールド（SID）をコンテキストに保持されなければならないことを添加したROHC UDPの場合と同じです。"
    },
    {
      "indent": 6,
      "text": "For compressed headers other than IR and IR-DYN:",
      "ja": "IR及びIR-DYN以外の圧縮されたヘッダーの場合："
    },
    {
      "indent": 9,
      "text": "If value(RND) = 0 and context(SID) = 0, hdr(IP-ID) is compressed using Offset IP-ID encoding (see [RFC-3095 section 4.5.5]) using p = 0 and default-slope(IP-ID offset) = 0.",
      "ja": "値（RND）は= 0の場合、コンテキスト（SID）は= 0、HDR（IP-ID）が（p = 0かつデフォルトスロープを用いて（[RFC-3095のセクション4.5.5]を参照）オフセットIP-IDの符号化を用いて圧縮されますIP-IDは、オフセット）= 0。"
    },
    {
      "indent": 9,
      "text": "If value(RND) = 0 and context(SID) = 1, hdr(IP-ID) is constant and compressed away; hdr(IP-ID) is the value of context(IP-ID).",
      "ja": "値（RND）= 0とコンテキスト（SID）= 1、HDR（IP-ID）が一定と離れて圧縮されます。 HDR（IP-ID）は、コンテキスト（IP-ID）の値です。"
    },
    {
      "indent": 9,
      "text": "If value(RND) = 1, IP-ID is the uncompressed hdr(IP-ID). IP-ID is then passed as additional octets at the end of the compressed header, after any extensions.",
      "ja": "値（RND）を1 =場合、IP-IDは、非圧縮HDR（IP-ID）です。 IP-IDは、次に任意の拡張後に、圧縮されたヘッダの終わりに追加のオクテットとして渡されます。"
    },
    {
      "indent": 3,
      "text": "Note: Only IR and IR-DYN packets can update context(SID).",
      "ja": "注：のみIR及びIR-DYNパケットは、コンテキスト（SID）を更新することができます。"
    },
    {
      "indent": 3,
      "text": "Note: All other fields are the same as for ROHC UDP [RFC-3095].",
      "ja": "注意：他のすべてのフィールドは、ROHC UDP [RFC-3095]と同じです。"
    },
    {
      "indent": 0,
      "text": "3.4. Additional Mode Transition Logic",
      "section_title": true,
      "ja": "3.4。追加のモード遷移ロジック"
    },
    {
      "indent": 3,
      "text": "The profiles defined in [RFC-3095] operate using different modes of compression. A mode transition can be requested once a packet has reached the decompressor by sending feedback indicating the desired mode. As per the specifications found in [RFC-3095], the compressor is compelled to honor such requests.",
      "ja": "[RFC-3095]で定義されたプロファイルは、圧縮の異なるモードを使用して動作します。パケットが所望のモードを示すフィードバックを送信することによって、解凍装置に到達した後にモード遷移を要求することができます。 [RFC-3095]に見出される仕様に従って、圧縮機は、そのような要求を尊重するように強要されています。"
    },
    {
      "indent": 3,
      "text": "For the IP profile defined in this document, the Mode parameter for the value mode = 0 (packet types UOR-2, IR and IR-DYN) is redefined to allow the compressor to decline a mode transition requested by the decompressor:",
      "ja": "この文書で定義されたIPプロファイル、= 0値モードのモードパラメータに（パケットタイプUOR-2、IR及びIR-DYN）はコンプレッサーが減圧装置によって要求されたモード遷移を拒否できるように再定義されます。"
    },
    {
      "indent": 6,
      "text": "Mode: Compression mode. 0 = (C)ancel Mode Transition",
      "ja": "モード：圧縮モード。 0 =（C）アンセルモード遷移"
    },
    {
      "indent": 3,
      "text": "Upon receiving the Mode parameter set to '0', the decompressor MUST stay in its current mode of operation and SHOULD refrain from sending further mode transition requests for the declined mode for a certain amount of time.",
      "ja": "「0」に設定されたモードパラメータを受信すると、デコンプレッサは動作の現在のモードに滞在しなければならないし、一定時間減少モードのためのさらなるモード遷移要求を送信することを控えるべきです。"
    },
    {
      "indent": 3,
      "text": "More specifically, with reference to the parameters C_TRANS, C_MODE, D_TRANS, and D_MODE defined in [RFC-3095, section 5.6.1.], the following modifications apply when the compressor cancels a mode transition:",
      "ja": "具体的には、パラメータC_TRANS、C_MODE、D_TRANS、およびで定義さD_MODE [RFC-3095、セクション5.6.1。]、圧縮機がモード遷移を解除するときに以下の変更が適用さを基準としました。"
    },
    {
      "indent": 6,
      "text": "Parameters for the compressor side:",
      "ja": "コンプレッサ側のパラメータ："
    },
    {
      "indent": 6,
      "text": "- C_MODE:",
      "ja": " -  C_MODE："
    },
    {
      "indent": 9,
      "text": "This value must not be changed when sending mode information within packets if the mode parameter is set to '0' (as a response to a mode transition request from the decompressor).",
      "ja": "モードパラメータが（減圧装置からのモード遷移要求に対する応答として）「0」に設定されている場合、パケット内のモード情報を送信するとき、この値は変更してはなりません。"
    },
    {
      "indent": 6,
      "text": "- C_TRANS:",
      "ja": " -  C_TRANS："
    },
    {
      "indent": 9,
      "text": "C_TRANS is (P)ending when receiving a mode transition request from the decompressor. C_TRANS is set to (D)one when the compressor receives an ACK for a UOR-2, IR-DYN, or IR packet sent with the mode parameter set to the mode in use at the time the mode transition request was initiated.",
      "ja": "C_TRANSは、解凍器からのモード遷移要求を受信したときに終了する（P）です。 C_TRANSは、圧縮機は、モード遷移要求が開始された時点で使用中のモードに設定されたモードパラメータを用いて送信されたUOR-2、IR-DYN、またはIRパケットに対するACKを受信する（D）いずれかに設定されています。"
    },
    {
      "indent": 6,
      "text": "Parameters for the decompressor side:",
      "ja": "解凍器側のパラメータ："
    },
    {
      "indent": 6,
      "text": "- D_MODE:",
      "ja": " -  D_MODE："
    },
    {
      "indent": 9,
      "text": "D_MODE MUST remain unchanged when receiving a UOR-2, an IR-DYN, or an IR packet sent with the mode parameter set to '0'.",
      "ja": "UOR-2、IR-DYN、または「0」に設定されたモードパラメータを使用して送信されたIRパケットを受信した場合D_MODEは不変のままでなければなりません。"
    },
    {
      "indent": 6,
      "text": "- D_TRANS:",
      "ja": " -  D_TRANS："
    },
    {
      "indent": 9,
      "text": "D_TRANS is (P)ending when a UOR-2, IR-DYN, or IR packet sent with the mode parameter set to '0' is received. It is set to (D)one when a packet of type 1 or 0 corresponding to the unchanged mode is received.",
      "ja": "D_TRANSは「0」に設定されたモードパラメータを用いて送信されたUOR-2、IR-DYN、またはIRパケットを受信したときに終了する（P）です。不変のモードに対応するタイプ1または0のパケットを受信したときには（D）いずれかに設定されています。"
    },
    {
      "indent": 3,
      "text": "The resulting mode transition procedure is described below:",
      "ja": "得られたモード移行手順について説明します。"
    },
    {
      "indent": 3,
      "text": "           Compressor                     Decompressor\n          ----------------------------------------------\nC_MODE = X      |                               |  D_MODE = X\n                |       Mode Request(Y) +-<-<-<-|  D_TRANS = I\n                |       +-<-<-<-<-<-<-<-+       |\nC_TRANS = P     |-<-<-<-+                       |\nC_MODE = X      |                               |\n                |->->->-+ IR/IR-DYN/UOR-2(SN,C) |\n                |       +->->->->->->->-+       |\n                |->-..                  +->->->-|  D_TRANS = P\n                |->-..                          |  D_MODE = X\n                |           ACK(SN,X)   +-<-<-<-|\n                |       +-<-<-<-<-<-<-<-+       |\nC_TRANS = D     |-<-<-<-+                       |\n                |                               |\n                |->->->-+   X-0, X-1*           |\n                |       +->->->->->->->-+       |\n                |                       +->->->-|  D_TRANS = D\n                |                               |",
      "raw": true
    },
    {
      "indent": 11,
      "text": "where X: mode in use before the mode transition was initiated\n      Y: mode requested by the decompressor\n      C: (C)ancel mode transition",
      "raw": true
    },
    {
      "indent": 0,
      "text": "3.5. Initialization",
      "section_title": true,
      "ja": "3.5。初期化"
    },
    {
      "indent": 3,
      "text": "The static context for ROHC IP compression can be initialized in either of two ways:",
      "ja": "ROHC IP圧縮のための静的コンテキストは、2つの方法のいずれかで初期化することができます。"
    },
    {
      "indent": 3,
      "text": "1) By using an IR packet as in ROHC UDP, where the profile is 0x0004, and the static chain ends with the static part of an IP header, where the Next Header/Protocol field has any value but IPinIP (4) or IPv6 (41) [PROTOCOL], or where the IP version field indicates termination (see section 3.1). At the compressor, SN is initialized to a random value when the first IR packet is sent.",
      "ja": "1）ROHCプロファイルは0x0004はあるUDP、および静的チェーンのようにIRパケットを使用することによって、次のヘッダ/プロトコルフィールドは、任意の値が、をのIPinIP（4）やIPv6（持つIPヘッダの静的部分で終わります41）〔PROTOCOL〕、又はIPバージョンフィールドは終了を示す場合（セクション3.1を参照）。最初のIRパケットが送信されたときの圧縮機では、SNは、ランダムな値に初期化されます。"
    },
    {
      "indent": 3,
      "text": "2) By reusing an existing context. This is done with an IR-DYN packet, identifying profile 0x0004, where the dynamic chain corresponds to the prefix of the existing static chain, ending with an IP header where the Next Header/Protocol field has any value but IPinIP (4) or IPv6 (41) [PROTOCOL], or where the IP version field indicates termination (see section 3.1). At the compressor, SN is initialized to a random value when the first IR-DYN packet is sent.",
      "ja": "2）既存のコンテキストを再利用することによって。これは、動的鎖は次のヘッダー/プロトコルフィールドに任意の値を有するが、のIPinIP（4）またはIPv6のIPヘッダで終わる、既存の静的鎖のプレフィックスに対応するプロファイル0x0004はを、同定、IR-DYNパケットを用いて行われます（41）〔PROTOCOL〕、又はIPバージョンフィールドは終了を示す場合（セクション3.1を参照）。最初のIR-DYNパケットが送信されると、圧縮機で、SNは、ランダムな値に初期化されます。"
    },
    {
      "indent": 3,
      "text": "For ROHC IP, the dynamic part of an IR or IR-DYN packet is similar to the one for ROHC UDP, with a two-octet field containing the SN present at the end of the dynamic chain in IR and IR-DYN packets. It should be noted that the static and dynamic chains have an arbitrary length, and the SN is added only once, at the end of the dynamic chain in IR and IR-DYN packets.",
      "ja": "ROHC IP、IRまたはIR-DYNパケットの動的部分のためのIR及びIR-DYNパケットの動的鎖の末端に存在するSNを含む2オクテットフィールドで、ROHC UDPのためのものと同様です。静的および動的鎖は任意の長さを有していることに留意すべきである、とSNはIR及びIR-DYNパケットの動的鎖の末端に、一度だけ追加されます。"
    },
    {
      "indent": 0,
      "text": "3.6. Packet Types",
      "section_title": true,
      "ja": "3.6。パケットタイプ"
    },
    {
      "indent": 3,
      "text": "Except for one new feedback option (see section 3.7), the only packet format that differs from ROHC UDP is the general format for compressed packets, which has no UDP checksum in the end. Instead, it ends with a list of dynamic header portions, one for each IP header above the initial two (if any, as indicated by the presence of corresponding header portions in the static chain).",
      "ja": "1つの新しいフィードバック・オプション（3.7節を参照）を除き、ROHC UDPは異なりのみパケットフォーマットは、最後にはUDPチェックサムを持っていない圧縮されたパケットのための一般的な形式です。代わりに、動的ヘッダ部のリスト、最初の2以上の各IPヘッダのための1つの（もしあれば、静的チェーンのヘッダ部分を対応の存在によって示されるように）で終わります。"
    },
    {
      "indent": 3,
      "text": "The general format for a compressed header is thus as follows:",
      "ja": "次のように圧縮されたヘッダの一般的な形式は、このようにあります。"
    },
    {
      "indent": 3,
      "text": "  0   1   2   3   4   5   6   7\n --- --- --- --- --- --- --- ---\n:         Add-CID octet         :                    |\n+---+---+---+---+---+---+---+---+                    |\n|   first octet of base header  |                    |\n+---+---+---+---+---+---+---+---+                    |\n:                               :                    |\n/   0, 1, or 2 octets of CID    /                    |\n:                               :                    |\n+---+---+---+---+---+---+---+---+                    |\n/   remainder of base header    /                    |\n+---+---+---+---+---+---+---+---+                    |\n:                               :                    |\n/           Extension           /                    |\n:                               :                    |\n --- --- --- --- --- --- --- ---                     |\n:                               :                    |\n+   IP-ID of outer IPv4 header  +\n:                               :     (see section 5.7 of [RFC-3095])\n --- --- --- --- --- --- --- ---\n/    AH data for outer list     /                    |\n --- --- --- --- --- --- --- ---                     |\n:                               :                    |\n+         GRE checksum          +                    |\n:                               :                    |\n --- --- --- --- --- --- --- ---                     |\n:                               :                    |\n+   IP-ID of inner IPv4 header  +                    |\n:                               :                    |\n --- --- --- --- --- --- --- ---                     |\n/    AH data for inner list     /                    |\n --- --- --- --- --- --- --- ---                     |\n:                               :                    |\n+         GRE checksum          +                    |\n:                               :                    |\n --- --- --- --- --- --- --- ---\n:            List of            :\n/        Dynamic chains         /    variable, given by static chain\n:   for additional IP headers   :           (includes no SN)\n --- --- --- --- --- --- --- ---",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note that the list of dynamic chains for the additional IP headers in compressed packets do not have a sequence number at the end of the chain, as SN is present within compressed base headers.",
      "ja": "SNは、圧縮ベース・ヘッダ内に存在するように圧縮されたパケットに追加のIPヘッダの動的チェーンのリストは、鎖の末端にシーケンス番号を持っていないことに留意されたいです。"
    },
    {
      "indent": 0,
      "text": "3.7. The CONTEXT_MEMORY Feedback Option",
      "section_title": true,
      "ja": "3.7。 CONTEXT_MEMORYフィードバックオプション"
    },
    {
      "indent": 3,
      "text": "The CONTEXT_MEMORY option informs the compressor that the decompressor does not have sufficient memory resources to handle the context of the packet stream, as the stream is currently compressed.",
      "ja": "CONTEXT_MEMORYオプションは、デコンプレッサは、ストリームが現在圧縮されているように、パケットストリームのコンテキストを処理するために十分なメモリリソースを持っていないコンプレッサーを通知します。"
    },
    {
      "indent": 3,
      "text": "  0   1   2   3   4   5   6   7\n+---+---+---+---+---+---+---+---+\n|  Opt Type = 9 |  Opt Len = 0  |\n+---+---+---+---+---+---+---+---+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "When receiving a CONTEXT_MEMORY option, the compressor SHOULD take actions to compress the packet stream in a way that requires less decompressor memory resources, or stop compressing the packet stream.",
      "ja": "CONTEXT_MEMORYオプションを受信すると、コンプレッサーは少ないデコンプレッサメモリリソースを必要とするように、パケットストリームを圧縮、またはパケットストリームの圧縮を停止する措置をとるべきです。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The security considerations of [RFC-3095] apply equally to this document, without exceptions or additions.",
      "ja": "[RFC-3095]のセキュリティ上の考慮事項は、例外や追加せずに、この文書にも同様に適用されます。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "ROHC profile identifier 0x0004 has been reserved by the IANA for the profile defined in this document.",
      "ja": "ROHCプロファイル識別子0x0004は、この文書で定義されたプロファイルのIANAによって予約されています。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Carsten Bormann, Fredrik Lindstrom, Tommy Lundemo, and especially the committed document reviewers Kristofer Sandlund and Mark West, for valuable input and review.",
      "ja": "著者は貴重な入力とレビューのために、カルステンボルマン、フレドリック・リンドストローム、トミーLundemo、特にコミット文書の校閲クリストファーSandlundとマーク西に感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "7. Normative References",
      "section_title": true,
      "ja": "7.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC-791] Postel, J., \"Internet Protocol\", RFC 791, September 1981.",
      "ja": "[RFC-791]ポステル、J.、 \"インターネットプロトコル\"、RFC 791、1981年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC-2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC-2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[RFC-2460]デアリング、S.とR. Hindenと、 \"インターネットプロトコルバージョン6（IPv6）の仕様\"、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC-3095] Bormann, C., Burmeister, C., Degermark, M., Fukushima, H., Hannu, H., Jonsson, L-E., Hakenberg, R., Koren, T., Le, K., Liu, Z., Martensson, A., Miyazaki, A., Svanbro, K., Wiebke, T., Yoshimura, T. and H. Zheng, \"Robust Header Compression (ROHC)\", RFC 3095, July 2001.",
      "ja": "[RFC-3095]ボルマン、C.、Burmeister、C.、Degermark、M.、福島、H.、ハンヌ、H.、ジョンソン、LE。、Hakenberg、R.、コレン、T.、ル、K.、劉、Z.、Martenssonから、A.、宮崎、A.、Svanbro、K.、Wiebke、T.、吉村、T.及びH.鄭、 \"ロバストヘッダ圧縮（ROHC）\"、RFC 3095、2001年7月。"
    },
    {
      "indent": 3,
      "text": "[PROTOCOL] \"Assigned Internet Protocol Numbers\", IANA registry at: http://www.iana.org/assignments/protocol-numbers",
      "ja": "[PROTOCOL] \"割り当てられたインターネットプロトコル番号\"、IANAレジストリで：http://www.iana.org/assignments/protocol-numbers"
    },
    {
      "indent": 0,
      "text": "Appendix A. Detailed Procedures for Canceling Mode Transitions",
      "ja": "キャンセルモード遷移のための付録A.詳細な手順"
    },
    {
      "indent": 3,
      "text": "The profiles defined in [RFC-3095] operate using different modes of compression: Unidirectional (U-Mode), Bi-directional Optimistic (O-Mode), and Bi-directional Reliable (R-Mode). Compression always starts in the U-Mode, and mode transitions can only be initiated by the decompressor [RFC-3095, section 5.6.]. A mode transition can be requested once a packet has reached the decompressor by sending feedback indicating the desired mode.",
      "ja": "単方向（Uモード）、双方向楽観（Oモード）、および双方向の信頼性（Rモード）：[RFC-3095]で定義されたプロファイルは、圧縮の異なるモードを使用して動作します。圧縮は、常にUモードで開始し、モード遷移は、減圧装置によって開始することができる[RFC-3095、セクション5.6。]。パケットが所望のモードを示すフィードバックを送信することによって、解凍装置に到達した後にモード遷移を要求することができます。"
    },
    {
      "indent": 3,
      "text": "With reference to the parameters C_TRANS, C_MODE, D_TRANS, and D_MODE defined in [RFC-3095, section 5.6.1.], the following sub-sections describe the resulting procedures when a compressor declines a mode transition request from the decompressor as described in section 3.4.",
      "ja": "で定義されたパラメータのC_TRANSを参照し、C_MODE、D_TRANS、及びD_MODEと[RFC-3095、セクション5.6.1。]に記載されているように、圧縮機は、減圧装置からのモード遷移要求を拒否するとき、以下のサブセクションでは、得られた手順について説明しセクション3.4。"
    },
    {
      "indent": 0,
      "text": "A.1. Transition from Optimistic to Reliable Mode",
      "ja": "A.1。楽観から信頼性の高いモードへの遷移"
    },
    {
      "indent": 3,
      "text": "When the decompressor initiates a mode transition from Optimistic to Reliable mode, the cancellation of the transition procedure is as follows:",
      "ja": "減圧装置が信頼できるモードに楽観からモード遷移を開始すると次のように、移行処理のキャンセルがあります："
    },
    {
      "indent": 3,
      "text": "          Compressor                     Decompressor\n          ----------------------------------------------\n                |                               |\n                |        ACK(R)/NACK(R) +-<-<-<-|  D_TRANS = I\n                |       +-<-<-<-<-<-<-<-+       |\nC_TRANS = P     |-<-<-<-+                       |\nC_MODE = O      |                               |\n                |->->->-+ IR/IR-DYN/UOR-2(SN,C) |\n                |       +->->->->->->->-+       |\n                |->-..                  +->->->-|  D_TRANS = P\n                |->-..                          |  D_MODE = O\n                |           ACK(SN,O)   +-<-<-<-|\n                |       +-<-<-<-<-<-<-<-+       |\nC_TRANS = D     |-<-<-<-+                       |\n                |                               |\n                |->->->-+  UO-0, UO-1*          |\n                |       +->->->->->->->-+       |\n                |                       +->->->-|  D_TRANS = D",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The compressor must not send packet types 1 or 0 when C_TRANS is P, i.e., not until it has received an ACK for a UOR-2, IR-DYN, or IR packet sent with the mode transition parameter set to C. When the decompressor receives a UOR-2, IR-DYN, or IR packet sent with the mode transition parameter set to C, it must keep the value D_MODE as O and set D_TRANS to P. When the decompressor receives packet types 0 or 1, after having ACKed a UOR-2, IR-DYN, or IR packet, it sets D_TRANS to D.",
      "ja": "C_TRANS、すなわち、Pである場合、それは減圧装置Cに設定されたモード移行パラメータで送信されたUOR-2、IR-DYN、またはIRパケットに対するACKを受信しないまで圧縮機は、パケットタイプ1または0を送信してはなりませんUOR-2、Cに設定されたモード移行パラメータで送信されたIR-DYN、またはIRパケットを受信し、それがOとして値D_MODEを保つ必要があり、解凍器がACKさを有する後、パケットタイプ0か1を受信した場合にPにD_TRANSを設定しますUOR-2、IR-DYN、またはIRパケットは、DにD_TRANSを設定します"
    },
    {
      "indent": 0,
      "text": "A.2. Transition from Unidirectional to Reliable Mode",
      "ja": "A.2。単方向からの信頼性の高いモードへの遷移"
    },
    {
      "indent": 3,
      "text": "The cancellation of a transition from Unidirectional to Reliable mode follows the same procedure as defined in section 4.2 above.",
      "ja": "上記セクション4.2で定義されるように信頼性の高いモードへ一方向からの遷移のキャンセルは同じ手順に従います。"
    },
    {
      "indent": 0,
      "text": "A.3. Transition from Reliable to Optimistic Mode",
      "ja": "A.3。信頼性から楽観モードへの遷移"
    },
    {
      "indent": 3,
      "text": "When the decompressor initiates a mode transition from Reliable to Optimistic mode, the cancellation of the transition procedure is described as follows:",
      "ja": "減圧装置が楽観モードへの確実からモード遷移を開始すると次のように、遷移手順の解除について説明します。"
    },
    {
      "indent": 3,
      "text": "            Compressor                     Decompressor\n          ----------------------------------------------\n                |                               |\n                |        ACK(O)/NACK(O) +-<-<-<-|  D_TRANS = I\n                |       +-<-<-<-<-<-<-<-+       |\nC_TRANS = P     |-<-<-<-+                       |\nC_MODE = R      |                               |\n                |->->->-+ IR/IR-DYN/UOR-2(SN,C) |\n                |       +->->->->->->->-+       |\n                |->-..                  +->->->-|  D_MODE = R\n                |->-..                          |\n                |           ACK(SN,R)   +-<-<-<-|\n                |       +-<-<-<-<-<-<-<-+       |\nC_TRANS = D     |-<-<-<-+                       |\n                |                               |\n                |->->->-+   R-0, R-1*           |\n                |       +->->->->->->->-+       |\n                |                       +->->->-|  D_TRANS = D\n                |                               |",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The compressor must not send packet types 1 or 0 when C_TRANS is P, i.e., not until it has received an ACK for a UOR-2, IR-DYN, or IR packet sent with the mode transition parameter set to C. When the decompressor receives a UOR-2, IR-DYN, or IR packet sent with the mode transition parameter set to C, it must keep the value D_MODE as R. When the decompressor receives packet types 0 or 1, after having ACKed a UOR-2, IR-DYN, or IR packet, it sets D_TRANS to D.",
      "ja": "C_TRANS、すなわち、Pである場合、それは減圧装置Cに設定されたモード移行パラメータで送信されたUOR-2、IR-DYN、またはIRパケットに対するACKを受信しないまで圧縮機は、パケットタイプ1または0を送信してはなりませんUOR-2、IR-DYN、またはCに設定されたモード遷移パラメータで送信されたIRパケットを受信し、デコンプレッサはUOR-2のACKさた後、パケットタイプ0か1を受信すると、それは、Rとして値D_MODEを維持する必要がありますIR-DYN、またはIRパケットは、それがDにD_TRANSを設定し、"
    },
    {
      "indent": 0,
      "text": "A.4. Transition Back to Unidirectional Mode",
      "ja": "A.4。単方向モードへの移行戻ります"
    },
    {
      "indent": 3,
      "text": "When the decompressor initiates a mode transition from Reliable or Optimistic mode back to Unidirectional mode, the cancellation of the transition procedure is as follows:",
      "ja": "減圧装置がバック単方向モードに信頼性または楽観モードからのモード遷移を開始すると次のように、移行処理のキャンセルがあります："
    },
    {
      "indent": 3,
      "text": "           Compressor                     Decompressor\n          ----------------------------------------------\n            |                               |\n            |        ACK(U)/NACK(U) +-<-<-<-| D_TRANS = I\n            |       +-<-<-<-<-<-<-<-+       |\nC_TRANS = P |-<-<-<-+                       |\nC_MODE = O/R|                               |\n            |->->->-+ IR/IR-DYN/UOR-2(SN,C) |\n            |       +->->->->->->->-+       |\n            |->-..                  +->->->-|\n            |->-..                          |\n            |          ACK(SN,O/R)  +-<-<-<-|\n            |       +-<-<-<-<-<-<-<-+       |\nC_TRANS = D |-<-<-<-+                       |\n            |          R-0, R-1* or         |\n            |->->->-+  UO-0, UO-1*          |\n            |       +->->->->->->->-+       |\n            |                       +->->->-| D_TRANS = D\n                                              D_MODE = O/R",
      "raw": true
    },
    {
      "indent": 3,
      "text": "When the decompressor receives a UOR-2, IR-DYN, or IR packet sent with the mode transition parameter set to C, it must keep the value D_MODE to the bi-directional mode already in use (either O- or R-mode). After ACKing the first UOR-2(C), IR-DYN(C), or IR(C), the decompressor MUST continue to send feedback with the Mode parameter set to the bi-directional mode in use (either O- or R-mode) until it receives packet types 0 or 1. When the decompressor receives packet types 0 or 1, after having ACKed a UOR-2, IR-DYN, or IR packet, it sets D_TRANS to D.",
      "ja": "減圧装置がUOR-2、IR-DYN、またはCに設定されたモード遷移パラメータで送信されたIRパケットを受信すると、それは（O-又はRモードのいずれか）既に使用中の双方向モードに値D_MODEを維持する必要があります。第UOR-2（C）の肯定応答（ACK）後、IR-DYN（C）、又はIR（C）、減圧装置はO-またはRのいずれか（使用中の双方向モードに設定されたモードパラメータを用いてフィードバックを送信し続けなければなりません減圧装置がパケットタイプ0か1を受信した場合、それがパケットタイプ0または1を受信するまで-mode）、UOR-2、IR-DYN、またはIRパケットをACKさた後、それはDにD_TRANSを設定します"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Lars-Erik Jonsson Ericsson AB Box 920 SE-971 28 Lulea, Sweden",
      "ja": "ラース・エリックジョンソン、エリクソンABボックス920 SE-971 28ルーレオ、スウェーデン"
    },
    {
      "indent": 3,
      "text": "Phone: +46 8 404 29 61 Fax: +46 920 996 21 EMail: lars-erik.jonsson@ericsson.com",
      "ja": "電話：+46 8 404 29 61ファックス：+46 920 996 21 Eメール：lars-erik.jonsson@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Ghyslain Pelletier Ericsson AB Box 920 SE-971 28 Lulea, Sweden",
      "ja": "GhyslainペルティエエリクソンABボックス920 SE-971 28ルーレオ、スウェーデン"
    },
    {
      "indent": 3,
      "text": "Phone: +46 8 404 29 43 Fax: +46 920 996 21 EMail: ghyslain.pelletier@ericsson.com",
      "ja": "電話：+46 8 404 29 43ファックス：+46 920 996 21 Eメール：ghyslain.pelletier@ericsson.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（C）インターネット協会（2004）。この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}