{
  "title": {
    "text": "RFC 3306 - Unicast-Prefix-based IPv6 Multicast Addresses",
    "ja": "RFC 3306 - ユニキャストプレフィックスベースのIPv6マルチキャストアドレス"
  },
  "number": 3306,
  "created_at": "2019-10-26 15:48:51.490516+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        B. Haberman\nRequest for Comments: 3306                                    Consultant\nCategory: Standards Track                                      D. Thaler\n                                                               Microsoft\n                                                             August 2002",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Unicast-Prefix-based IPv6 Multicast Addresses",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2002）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This specification defines an extension to the multicast addressing architecture of the IP Version 6 protocol. The extension presented in this document allows for unicast-prefix-based allocation of multicast addresses. By delegating multicast addresses at the same time as unicast prefixes, network operators will be able to identify their multicast addresses without needing to run an inter-domain allocation protocol.",
      "ja": "この仕様は、IPバージョン6プロトコルのマルチキャスト・アドレス指定アーキテクチャの拡張を定義します。この文書の拡張は、マルチキャストアドレスのユニキャストプレフィックスベース割り当てを可能にします。ユニキャストプレフィクスと同時にマルチキャストアドレスを委任することによって、ネットワークオペレータは、ドメイン間割り当てプロトコルを実行することなく、そのマルチキャストアドレスを識別することができるであろう。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction....................................................2\n2. Motivation......................................................2\n3. Terminology.....................................................2\n4. Multicast Address Format........................................2\n5. Address Lifetime................................................4\n6. Source-Specific Multicast Addresses.............................4\n7. Examples........................................................4\n8. Security Considerations.........................................5\n9. References......................................................5\nAuthor's Address...................................................6\nFull Copyright Statement...........................................7",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document specifies an extension to the multicast portion of the IPv6 addressing architecture [ADDRARCH]. The current architecture does not contain any built-in support for dynamic address allocation. This proposal introduces encoded information in the multicast address to allow for dynamic allocation of IPv6 multicast addresses and IPv6 source-specific multicast addresses.",
      "ja": "この文書は、IPv6アドレス体系[ADDRARCH]のマルチキャスト部分への拡張を指定します。現在のアーキテクチャでは、動的アドレス割り当てのための任意の組み込みのサポートが含まれていません。この提案は、IPv6マルチキャストアドレスとIPv6ソース固有マルチキャストアドレスの動的割り当てを可能にするために、マルチキャストアドレスに符号化された情報を紹介します。"
    },
    {
      "indent": 0,
      "text": "2. Motivation",
      "section_title": true,
      "ja": "2.動機"
    },
    {
      "indent": 3,
      "text": "The current IPv4 multicast address allocation architecture [RFC 2908] is based on a multi-layered, multi-protocol system. The goal of this proposal is to reduce the number of protocols that need to be deployed in order to get dynamic multicast address allocation.",
      "ja": "現在のIPv4マルチキャストアドレス割り当てのアーキテクチャ[RFC 2908]は、多層、マルチプロトコルシステムに基づいています。この提案の目標は、動的なマルチキャストアドレスの割り当てを取得するために展開する必要があるプロトコルの数を減らすことです。"
    },
    {
      "indent": 3,
      "text": "The use of unicast prefix-based multicast address allocation will, at a minimum, remove the need to run the Multicast Address Allocation Protocol (AAP) [AAP WORK] and the Multicast Address-Set Claim (MASC) Protocol [RFC 2909].",
      "ja": "ユニキャストプレフィックスベースのマルチキャストアドレス割り当ての使用は、最小で、マルチキャストアドレス割り当てプロトコル（AAP）[AAPのWORK]とマルチキャストアドレス設定項（MASC）プロトコル[RFC 2909]を実行する必要性を除去します。"
    },
    {
      "indent": 0,
      "text": "3. Terminology",
      "section_title": true,
      "ja": "3.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC 2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC 2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "4. Multicast Address Format",
      "section_title": true,
      "ja": "4.マルチキャストアドレスのフォーマット"
    },
    {
      "indent": 3,
      "text": "Section 2.7 of [ADDRARCH] defines the following operational format of IPv6 multicast addresses:",
      "ja": "【ADDRARCH]のセクション2.7は、IPv6マルチキャストアドレスの次の動作形式を定義します。"
    },
    {
      "indent": 6,
      "text": "|    8   |  4 |  4 |                     112                     |\n+--------+----+----+---------------------------------------------+\n|11111111|flgs|scop|                  group ID                   |\n+--------+----+----+---------------------------------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "This document introduces a new format that incorporates unicast prefix information in the multicast address. The following illustrates the new format:",
      "ja": "この文書では、マルチキャストアドレスにユニキャストプレフィックス情報を組み込んだ新しいフォーマットを導入しています。以下は、新しいフォーマットを示しています。"
    },
    {
      "indent": 6,
      "text": "|   8    |  4 |  4 |   8    |    8   |       64       |    32    |\n+--------+----+----+--------+--------+----------------+----------+\n|11111111|flgs|scop|reserved|  plen  | network prefix | group ID |\n+--------+----+----+--------+--------+----------------+----------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "                                +-+-+-+-+\nflgs is a set of 4 flags:       |0|0|P|T|\n                                +-+-+-+-+",
      "raw": true
    },
    {
      "indent": 9,
      "text": "o  P = 0 indicates a multicast address that is not assigned\n   based on the network prefix.  This indicates a multicast\n   address as defined in [ADDRARCH].",
      "raw": true
    },
    {
      "indent": 9,
      "text": "o P = 1 indicates a multicast address that is assigned based on the network prefix.",
      "ja": "O = 1 Pは、ネットワークプレフィックスに基づいて割り当てられたマルチキャストアドレスを示しています。"
    },
    {
      "indent": 9,
      "text": "o If P = 1, T MUST be set to 1, otherwise the setting of the T bit is defined in Section 2.7 of [ADDRARCH].",
      "ja": "P = 1の場合はO、Tは、他のTビットの設定は、[ADDRARCH]のセクション2.7で定義され、1に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The reserved field MUST be zero.",
      "ja": "予約フィールドはゼロでなければなりません。"
    },
    {
      "indent": 3,
      "text": "plen indicates the actual number of bits in the network prefix field that identify the subnet when P = 1.",
      "ja": "PLENサブネットP = 1特定ネットワークプレフィックスフィールド内のビットの実際の数を示します。"
    },
    {
      "indent": 3,
      "text": "network prefix identifies the network prefix of the unicast subnet owning the multicast address. If P = 1, this field contains the unicast network prefix assigned to the domain owning, or allocating, the multicast address. All non-significant bits of the network prefix field SHOULD be zero.",
      "ja": "ネットワークプレフィックスは、マルチキャストアドレスを所有しているユニキャストサブネットのネットワークプレフィックスを識別します。 P = 1の場合、このフィールドは、ドメインの所有に割り当てられたユニキャストネットワークプレフィックスが含まれている、または、マルチキャストアドレスを割り当てます。ネットワークプレフィックスフィールドのすべての非上位ビットがゼロでなければなりません。"
    },
    {
      "indent": 3,
      "text": "It should be noted that the Interface Identifier requirements in Section 2.5.1 of [ADDRARCH] effectively restrict the length of the unicast prefix to 64 bits, hence the network prefix portion of the multicast address will be at most 64 bits.",
      "ja": "[ADDRARCH]のセクション2.5.1のインタフェース識別子の要件を効果的したがって、マルチキャストアドレスのネットワークプレフィックス部分は最大で64ビットとなり、64ビットにユニキャスト接頭語の長さを制限することに留意すべきです。"
    },
    {
      "indent": 3,
      "text": "Group ID is set based on the guidelines outlined in [IPV6 GID].",
      "ja": "グループIDは[IPV6 GID]で概説したガイドラインに基づいて設定されています。"
    },
    {
      "indent": 3,
      "text": "The scope of the unicast-prefix based multicast address MUST NOT exceed the scope of the unicast prefix embedded in the multicast address.",
      "ja": "ユニキャストプレフィックスベースのマルチキャストアドレスの範囲は、マルチキャストアドレスに埋め込まれたユニキャストプレフィックスの範囲を超えてはなりません。"
    },
    {
      "indent": 0,
      "text": "5. Address Lifetime",
      "section_title": true,
      "ja": "5.住所の生涯"
    },
    {
      "indent": 3,
      "text": "The lifetime of a unicast prefix-based multicast address SHOULD NOT exceed the Valid Lifetime field in the Prefix Information option, corresponding to the unicast prefix being used, contained in the Neighbor Discovery Router Advertisement message [RFC 2461]. The lifetime of the multicast address is needed to support the Abstract API for Multicast Address Allocation [RFC 2771].",
      "ja": "ユニキャストプレフィックスベースのマルチキャストアドレスの寿命は、近隣探索ルータ広告メッセージ[RFC 2461]に含まれて使用されるユニキャストプレフィックスに対応する、プレフィックス情報オプション内の有効寿命フィールドを超えてはなりません。マルチキャストアドレスの寿命は、マルチキャストアドレス割り当て[RFC 2771]のための抽象APIをサポートするために必要とされます。"
    },
    {
      "indent": 3,
      "text": "It should be noted that the unicast prefix's Valid Lifetime in the Router Advertisement message does not indicate that the prefix will become invalid at the end of the lifetime. Rather, that value is typically a constant until a renumbering event is scheduled after which, the prefix does become invalid.",
      "ja": "Router Advertisementメッセージでユニキャストプレフィックスの有効期間がプレフィックスが生涯の終わりに無効になることを示していないことに留意すべきです。リナンバリングイベントはその後、接頭辞が無効になるん予定してまでむしろ、その値は一般的に一定です。"
    },
    {
      "indent": 3,
      "text": "The use of unicast prefix-based multicast addresses after the unicast prefix has become invalid may lead to operational problems. For example, routers that perform policy checks comparing the multicast prefix against the unicast prefix assigned to an AS may discard the packet.",
      "ja": "ユニキャストプレフィックスが無効になった後に、ユニキャストプレフィックスベースのマルチキャストアドレスの使用は、操作上の問題につながる可能性があります。例えば、ASに割り当てられているユニキャストプレフィックスに対してマルチキャストプレフィックスを比較ポリシーチェックを実行するルータはパケットを破棄してもよいです。"
    },
    {
      "indent": 0,
      "text": "6. Source-Specific Multicast Addresses",
      "section_title": true,
      "ja": "6.ソース固有マルチキャストアドレス"
    },
    {
      "indent": 3,
      "text": "The unicast prefix-based IPv6 multicast address format supports Source-specific multicast addresses, as defined by [SSM ARCH]. To accomplish this, a node MUST:",
      "ja": "[SSM ARCH]によって定義されるようにユニキャスト接頭語ベースのIPv6マルチキャストアドレスフォーマットは、ソース固有マルチキャストアドレスをサポートします。これを達成するために、ノードする必要があります。"
    },
    {
      "indent": 9,
      "text": "o  Set P = 1.\no  Set plen = 0.\no  Set network prefix = 0.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "These settings create an SSM range of FF3x::/32 (where 'x' is any valid scope value). The source address field in the IPv6 header identifies the owner of the multicast address.",
      "ja": "これらの設定は、FF3x :: / 32（「X」である任意の有効範囲値）のSSM範囲を作成します。 IPv6ヘッダーのソースアドレスフィールドは、マルチキャストアドレスの所有者を識別する。"
    },
    {
      "indent": 0,
      "text": "7. Examples",
      "section_title": true,
      "ja": "7.例"
    },
    {
      "indent": 3,
      "text": "The following are a few examples of the structure of unicast prefix-based multicast addresses.",
      "ja": "ユニキャストプレフィックスベースのマルチキャストアドレスの構造のいくつかの例は以下の通り。"
    },
    {
      "indent": 9,
      "text": "-  Global prefixes - A network with a unicast prefix of\n   3FFE:FFFF:1::/48 would also have a unicast prefix-based\n   multicast prefix of FF3x:0030:3FFE:FFFF:0001::/96 (where 'x'\n   is any valid scope).",
      "raw": true
    },
    {
      "indent": 9,
      "text": "- SSM - All IPv6 SSM multicast addresses will have the format FF3x::/96.",
      "ja": " -  SSM  - すべてのIPv6 SSMマルチキャストアドレスは、形式FF3x :: / 96を持つことになります。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "It is possible that the embedded unicast prefix can aid in identifying the allocation domain of a given multicast address, though an allocation domain choosing to avoid being traced has no obstacles currently to creating addresses using a prefix not assigned to it, or using a smaller scope embedded prefix.",
      "ja": "追跡されることを回避することを選択割り当てドメインが、現在それに割り当てられていないプレフィックスを使用してアドレスを作成し、以下のスコープを使用することに何らの障害を持っていないけれども、埋め込まれたユニキャストプレフィックスが与えられたマルチキャストアドレスの割り当て領域を識別するのを助けることが可能です埋め込まれた接頭辞。"
    },
    {
      "indent": 3,
      "text": "Using source-specific multicast addresses can sometimes aid in the prevention of denial-of-service attacks by arbitrary sources, although no guarantee is provided. A more in-depth discussion of the security considerations for SSM can be found in [SSM ARCH].",
      "ja": "保証が提供されていないが、ソース固有のマルチキャストアドレスを使用すると、時々、任意の源によるサービス拒否攻撃の防止に役立ちます。 SSMのセキュリティ上の考慮事項のより詳細な議論は[SSM ARCH]に見出すことができます。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC 2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "ja": "[RFC 2026]ブラドナーの、S.、 \"インターネット標準化プロセス - リビジョン3\"、BCP 9、RFC 2026、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC 2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, December 1998.",
      "ja": "[RFC 2460]デアリング、S.とR. Hindenと、 \"インターネットプロトコルバージョン6（IPv6）の仕様\"、RFC 2460、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[ADDRARCH] Hinden, R. and S. Deering, \"IP Version 6 Addressing Architecture\", RFC 2373, July 1998.",
      "ja": "[ADDRARCH] HindenとR.とS.デアリング、 \"IPバージョン6アドレッシング体系\"、RFC 2373、1998年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC 2908] Thaler, D., Handley, M. and D. Estrin, \"The Internet Multicast Address Allocation Architecture\", RFC 2908, September 2000.",
      "ja": "[RFC 2908]ターラー、D.、ハンドリー、M.とD. Estrin、 \"インターネットマルチキャストアドレス配分アーキテクチャ\"、RFC 2908、2000年9月。"
    },
    {
      "indent": 3,
      "text": "[AAP WORK] Handley, M. and S. Hanna, \"Multicast Address Allocation Protocol (AAP)\", Work In Progress.",
      "ja": "[AAPのWORK]ハンドレー、M.およびS.ハンナ、 \"マルチキャストアドレス割り当てプロトコル（AAP）\"、進行中の作業。"
    },
    {
      "indent": 3,
      "text": "[RFC 2909] Radoslavov, P., Estrin, D., Govindan, R., Handley, M., Kumar, S. and D. Thaler, \"The Multicast Address-Set Claim (MASC) Protocol\", RFC 2909, September 2000.",
      "ja": "[RFC 2909] Radoslavov、P.、Estrin、D.、ゴヴィンダン、R.、ハンドレー、M.、クマー、S.およびD.ターレル、 \"マルチキャストアドレスセットクレーム（MASC）プロトコル\"、RFC 2909、9月2000。"
    },
    {
      "indent": 3,
      "text": "[RFC 2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1999.",
      "ja": "[RFC 2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[IPV6 GID] Haberman, B., \"Dynamic Allocation Guidelines for IPv6 Multicast Addresses\", RFC 3307, June 2002.",
      "ja": "[IPV6 GID]ハーバーマン、B.、 \"IPv6マルチキャストアドレスの動的割り当てガイドライン\"、RFC 3307、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC 2461] Narten, T., Nordmark, E. and W. Simpson, \"Neighbor Discovery for IP Version 6 (IPv6)\", RFC 2461, December 1998.",
      "ja": "[RFC 2461] Narten氏、T.、Nordmarkと、E.およびW.シンプソン、 \"IPバージョン6のための近隣探索（IPv6）の\"、RFC 2461、1998年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC 2771] Finlayson, R., \"An Abstract API for Multicast Address Allocation\", RFC 2771, February 2000.",
      "ja": "[RFC 2771]フィンレイソン、R.、 \"マルチキャストアドレスの割り当てのための抽象API\"、RFC 2771、2000年2月。"
    },
    {
      "indent": 3,
      "text": "[SSM ARCH] Holbrook, H. and B. Cain, \"Source-Specific Multicast for IP\", Work In Progress.",
      "ja": "[SSM ARCH]ホルブルック、H.、およびB.カイン、「IPのためのソース固有のマルチキャスト」、進行中の作業。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Brian Haberman Consultant Phone: 1-919-949-4828 EMail: bkhabs@nc.rr.com",
      "ja": "ブライアンハーバーマンコンサルタント電話：1-919-949-4828 Eメール：bkhabs@nc.rr.com"
    },
    {
      "indent": 3,
      "text": "Dave Thaler Microsoft Corporation One Microsoft Way Redmond, WA 48105-6399 Phone: 1-425-703-8835 EMail: dthaler@microsoft.com",
      "ja": "デーブターラーマイクロソフト社1つのマイクロソフト道、レドモンド、WA 48105-6399電話：1-425-703-8835 Eメール：dthaler@microsoft.com"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2002）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}