{
  "title": {
    "text": "RFC 3891 - The Session Initiation Protocol (SIP) \"Replaces\" Header",
    "ja": "RFC 3891 - セッション開始プロトコル（SIP）は、ヘッダーを「置き換え」"
  },
  "number": 3891,
  "created_at": "2019-10-24 21:34:16.687910+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            R. Mahy\nRequest for Comments: 3891                           Cisco Systems, Inc.\nCategory: Standards Track                                       B. Biggs\n                                                                 R. Dean\n                                                          September 2004",
      "raw": true
    },
    {
      "indent": 8,
      "text": "The Session Initiation Protocol (SIP) \"Replaces\" Header",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（C）インターネット協会（2004）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines a new header for use with Session Initiation Protocol (SIP) multi-party applications and call control. The Replaces header is used to logically replace an existing SIP dialog with a new SIP dialog. This primitive can be used to enable a variety of features, for example: \"Attended Transfer\" and \"Call Pickup\". Note that the definition of these example features is non-normative.",
      "ja": "この文書では、セッション開始プロトコル（SIP）マルチパーティのアプリケーションおよびコール制御に使用する新しいヘッダーを定義します。 Replacesヘッダーは、論理的に新しいSIPダイアログで、既存のSIPダイアログを置き換えるために使用されます。このプリミティブは、たとえば、さまざまな機能を有効にするために使用することができます：「在席転送」と「コールピックアップ」。これらの例の機能の定義は非規範的であることに注意してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Overview. . . . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Conventions . . . . . . . . . . . . . . . . . . . . . . . . .   4\n3.  User Agent Server Behavior: Receiving a Replaces Header . . .   4\n4.  User Agent Client Behavior: Sending a Replaces Header . . . .   6\n5.  Proxy Behavior. . . . . . . . . . . . . . . . . . . . . . . .   7\n6.  Syntax. . . . . . . . . . . . . . . . . . . . . . . . . . . .   7\n    6.1.  The Replaces Header . . . . . . . . . . . . . . . . . .   7\n    6.2.  New Option Tag for Require and Supported Headers. . . .   8\n7.  Usage Examples. . . . . . . . . . . . . . . . . . . . . . . .   9\n    7.1.  Replacing an Early Dialog at the Originator . . . . . .   9\n8.  Security Considerations . . . . . . . . . . . . . . . . . . .  11\n9.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  13\n    9.1.  Registration of \"Replaces\" SIP Header . . . . . . . . .  13\n    9.2.  Registration of \"replaces\" SIP Option-tag . . . . . . .  13\n10. Acknowledgments . . . . . . . . . . . . . . . . . . . . . . .  13\n11. References. . . . . . . . . . . . . . . . . . . . . . . . . .  13\n    11.1. Normative References. . . . . . . . . . . . . . . . . .  13\n    11.2. Informative References. . . . . . . . . . . . . . . . .  14\n12. Authors' Addresses. . . . . . . . . . . . . . . . . . . . . .  15\n13. Full Copyright Statement. . . . . . . . . . . . . . . . . . .  16",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1。概要"
    },
    {
      "indent": 3,
      "text": "This document describes a SIP [1] extension header field as part of the SIP multiparty applications architecture framework [10]. The Replaces header is used to logically replace an existing SIP dialog with a new SIP dialog. This is especially useful in peer-to-peer call control environments.",
      "ja": "この文書は、SIPマルチパーティアプリケーション・アーキテクチャ・フレームワーク[10]の一部としてSIP [1]拡張ヘッダフィールドを記述する。 Replacesヘッダーは、論理的に新しいSIPダイアログで、既存のSIPダイアログを置き換えるために使用されます。これは、ピア・ツー・ピアのコール制御環境では特に有用です。"
    },
    {
      "indent": 3,
      "text": "One use of the \"Replaces\" header is to replace one participant with another in a multimedia conversation. While this functionality is already available using 3rd party call control [11] style call control, the 3pcc model requires a central point of control which may not be desirable in many environments. As such, a method of performing these same call control primitives in a distributed, peer-to-peer fashion is very desirable.",
      "ja": "ヘッダーを「置き換え」の用途の1つは、マルチメディアの会話でお互いに一人の参加者を交換することです。この機能は、サードパーティの呼制御[11]スタイルの呼制御を使用して、すでに利用可能ですが、3PCCモデルは、多くの環境では望ましくないことが制御の中心点が必要です。このように、分散、ピア・ツー・ピア方式で、これらの同じ呼制御プリミティブを行う方法は、非常に望ましいです。"
    },
    {
      "indent": 3,
      "text": "Use of a new INVITE with a new header for dialog matching was chosen over making implicit associations in an incoming INVITE based on call-id or other fields for the following reasons:",
      "ja": "新規の使用が対話マッチングのために新しいヘッダが暗黙に関連付けを行う上で選択されたINVITE着信呼IDまたは以下の理由のために他のフィールドに基づいてINVITE。"
    },
    {
      "indent": 3,
      "text": "o An INVITE already has the correct semantics for a new call",
      "ja": "すでにINVITE oをすると、新しいコールのための正しい意味を持っています"
    },
    {
      "indent": 3,
      "text": "o Using an explicit Replaces header in a new request makes the intent of the request obvious.",
      "ja": "新しい要求で明示Replacesヘッダーを使用してO明白な要求の意図を行います。"
    },
    {
      "indent": 3,
      "text": "o A unique call-id may be given to the replacement call. This avoids dialog matching problems in any of the related User Agents.",
      "ja": "O一意の呼IDが交換コールに与えられてもよいです。これは、関連するユーザーエージェントのいずれかで、ダイアログのマッチングの問題を回避することができます。"
    },
    {
      "indent": 3,
      "text": "o There are no adverse effects if the header is unsupported.",
      "ja": "ヘッダがサポートされていない場合はO悪影響はありません。"
    },
    {
      "indent": 3,
      "text": "The Replaces header enables services such as attended call transfer, retrieve from park, and transition from locally mixed conferences to two party calls in a distributed peer-to-peer way. This list of services is not exhaustive. Although the Replaces header is frequently used in combination with the REFER [8] method as used in a Transfer [12], they may be used independently.",
      "ja": "Replacesヘッダーは、公園から取り出し、分散ピア・ツー・ピアの方法における2つのパーティのコールに局所的混合会議からの遷移は、このような出席コール転送などのサービスを可能にします。サービスのこのリストは網羅的なものではありません。転送[12]で使用されるReplacesヘッダーが頻繁REFER [8]の方法と組み合わせて使用​​されているが、これらは単独で用いてもよいです。"
    },
    {
      "indent": 3,
      "text": "For example, Alice is talking to Bob from phone1. She transfers Bob to a Parking Place while she goes to the lab. When she gets there she retrieves the \"parked\" call from phone2 by sending an INVITE with a Replaces header field to Bob with the dialog information Bob shared with the Parking Place. Alice got this information using some out of band mechanism. Perhaps she subscribed to this information from the Parking Place (using the session dialog package [13]), or went to a website and clicked on a URI. A short call flow for this example follows. (Via and Max-Forwards headers are omitted for clarity.)",
      "ja": "例えば、アリスはのphone1からボブに話しています。彼女は研究室に行く間、彼女は駐車場にボブを転送します。彼女はボブが駐車場と共有ダイアログ情報をボブにReplacesヘッダーフィールドを持つINVITEを送信することにより、phone2のから「パーク」コールを取得そこに着くとき。アリスは、バンドメカニズムのいくつかのアウトを使用してこの情報を得ました。おそらく彼女は（セッション]ダイアログパッケージ[13]を使用して）駐車場からこの情報に加入、またはウェブサイトに行って、URIをクリックしました。この例の短いコールフローは次の通りです。 （経由とMax-転送しヘッダを明確にするために省略されています。）"
    },
    {
      "indent": 8,
      "text": "Alice          Alice                             Parking\nphone1         phone2            Bob               Place\n|               |                 |                   |\n|<===============================>|                   |\n|               |                 |                   |\n|        Alice transfers Bob to Parking Place         |\n|               |                 |                   |\n|------------REFER/200----------->|    *1    *2       |\n|<--NOTIFY/200 (trying)-----------|--INVITE/200/ACK-->|\n|<--NOTIFY/200 (success)----------|<=================>|\n|------------BYE/200------------->|                   |\n|               |                 |                   |\n|               |                 |                   |\n|  Alice later retrieves call from another phone      |\n|               |                 |                   |\n|            *3 |-INV w/Replaces->|                   |\n|               |<--200-----------|                   |\n|               |---ACK---------->|----BYE/200------->|\n|               |<===============>|                   |\n|               |                 |                   |",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Message *1: Bob-> Parking Place",
      "ja": "メッセージ* 1：Bob->駐車場"
    },
    {
      "indent": 3,
      "text": "INVITE sip:parkingplace@example.org SIP/2.0 To: <sip:parkingplace@example.org> From: <sip:bob@example.org>;tag=7743 Call-ID: 425928@bobster.example.org CSeq: 1 INVITE Contact: <sip:bob@bobster.example.org> Referred-By: <sip:alice@phone1.example.org>",
      "ja": "INVITE SIP：parkingplace@example.org SIP / 2.0 <SIP：parkingplace@example.org>から<SIP：bob@example.org>;タグ= 7743のCall-ID：425928@bobster.example.orgのCSeq： 1問い合わせINVITE：<SIP：bob@bobster.example.org>と呼ばバイ：<SIP：alice@phone1.example.org>"
    },
    {
      "indent": 3,
      "text": "Message *2: Parking Place -> Bob",
      "ja": "メッセージ* 2：駐車場 - >ボブ"
    },
    {
      "indent": 3,
      "text": "SIP/2.0 200 OK To: <sip:parkingplace@example.org>;tag=6472 From: <sip:bob@example.org>;tag=7743 Call-ID: 425928@bobster.example.org CSeq: 1 INVITE Contact: <sip:parkplace@monopoly.example.org>",
      "ja": "SIP / 2.0 200 OK <SIP：parkingplace@example.org>;タグ= 6472から<SIP：bob@example.org>;タグ= 7743のCall-ID：425928@bobster.example.orgのCSeq：INVITE 1連絡先：<SIP：parkplace@monopoly.example.org>"
    },
    {
      "indent": 3,
      "text": "Message *3: Alice@phone2 -> Bob",
      "ja": "メッセージ* 3：phone2の@アリス - >ボブ"
    },
    {
      "indent": 3,
      "text": "INVITE sip:bob@bobster.example.org To: <sip:bob@example.org> From: <sip:alice@phone2.example.org>;tag=8983 Call-ID: 09870@phone2.example.org CSeq: 1 INVITE Contact: <sip:alice@phone2.example.org> Require: replaces Replaces: 425928@bobster.example.org;to-tag=7743;from-tag=6472",
      "ja": "bob@bobster.example.orgへ：SIPのINVITE <一口：bob@example.org>から<SIP：alice@phone2.example.org>;タグ= 8983のCall-ID：09870@phone2.example.orgのCSeq ：1連絡先をINVITE：<SIP：alice@phone2.example.org>が必要：置き換えられた置き換え：425928@bobster.example.org;へのタグ= 7743;からタグ= 6472"
    },
    {
      "indent": 0,
      "text": "2. Conventions",
      "section_title": true,
      "ja": "2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [2].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14、RFC 2119に記載されるように解釈される[2]。"
    },
    {
      "indent": 3,
      "text": "This document refers frequently to the terms \"confirmed dialog\" and \"early dialog\". These are defined in Section 12 of SIP [1].",
      "ja": "この文書では、用語「確認ダイアログ」と「早期ダイアログ」を頻繁に参照します。これらはSIP [1]のセクション12で定義されています。"
    },
    {
      "indent": 0,
      "text": "3. User Agent Server Behavior: Receiving a Replaces Header",
      "section_title": true,
      "ja": "3.ユーザーエージェントサーバーの動作：Replacesヘッダーを受け取ります"
    },
    {
      "indent": 3,
      "text": "The Replaces header contains information used to match an existing SIP dialog (call-id, to-tag, and from-tag). Upon receiving an INVITE with a Replaces header, the User Agent (UA) attempts to match this information with a confirmed or early dialog. The User Agent Server (UAS) matches the to-tag and from-tag parameters as if they were tags present in an incoming request. In other words, the to-tag parameter is compared to the local tag, and the from-tag parameter is compared to the remote tag.",
      "ja": "Replacesヘッダーは、既存のSIPダイアログを一致させるために使用される情報が含まれている（Call-IDを、対タグ、およびタグから）。 Replacesヘッダーと共にINVITEを受信すると、ユーザエージェント（UA）は、確認または初期ダイアログでこの情報と一致することを試みます。彼らは着信要求に存在するタグであるかのようにユーザエージェントサーバ（UAS）は、タグへとから、タグのパラメータと一致します。換言すれば、対タグパラメータは、ローカルタグと比較され、よりタグのパラメータは、リモートタグと比較されます。"
    },
    {
      "indent": 3,
      "text": "If more than one Replaces header field is present in an INVITE, or if a Replaces header field is present in a request other than INVITE, the UAS MUST reject the request with a 400 Bad Request response.",
      "ja": "複数のReplacesヘッダーフィールドが存在する場合、INVITEに、またはReplacesヘッダーフィールドはINVITE以外の要求に存在する場合、UASは400不正な要求の応答で要求を拒絶しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The Replaces header has specific call control semantics. If both a Replaces header field and another header field with contradictory semantics are present in a request, the request MUST be rejected with a 400 \"Bad Request\" response.",
      "ja": "Replacesヘッダーは、特定の呼制御セマンティクスを有します。 Replacesヘッダーフィールドと矛盾セマンティクスを持つ別のヘッダフィールドの両方が要求に存在する場合、要求は400「不正な要求」応答で拒否されなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the Replaces header field matches more than one dialog, the UA MUST act as if no match is found.",
      "ja": "Replacesヘッダーフィールドが複数のダイアログが一致した場合、UAは、一致が見つからなかったかのように行動しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If no match is found, the UAS rejects the INVITE and returns a 481 Call/Transaction Does Not Exist response. Likewise, if the Replaces header field matches a dialog which was not created with an INVITE, the UAS MUST reject the request with a 481 response.",
      "ja": "一致が見つからない場合、UASは、INVITE拒否し、応答存在しない481コール/トランザクションを返します。 ReplacesヘッダーフィールドはINVITEで作成されなかったダイアログに一致した場合同様に、UASは481応答で要求を拒絶しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the Replaces header field matches a dialog which has already terminated, the UA SHOULD decline the request with a 603 Declined response. (If the matched invitation was just terminated, the replacement request should fail as well. Declining the request with a 600-class response prevents an irritating race-condition where the UA rings or alerts for a replacement call which is not wanted.)",
      "ja": "Replacesヘッダーフィールドがすでに終了しているダイアログと一致した場合、UAは603拒否応答でリクエストを拒否すべきです。 （マッチした招待状がちょうど終了した場合は、交換要求も同様に失敗する必要があります。600クラスの応答と要求を拒否すると望んでいたされていない交換用のコールのためのUAリングやアラート刺激性の競合状態を防ぐことができます。）"
    },
    {
      "indent": 3,
      "text": "If the Replaces header field matches an active dialog, the UA MUST verify that the initiator of the new INVITE is authorized to replace the matched dialog. If the initiator of the new INVITE has been successfully authenticated as equivalent to the user who is being replaced, then the replacement is authorized. For example, if the user being replaced and the initiator of the replacement dialog share the same credentials for Digest authentication [6], or they sign the replacement request with S/MIME [7] with the same private key and present the (same) corresponding certificate used in the original dialog, then the replacement is authorized.",
      "ja": "Replacesヘッダーフィールドがアクティブなダイアログと一致した場合、UAは新しいのイニシエータが一致してダイアログを置き換えるために許可されたINVITEことを確かめなければなりません。新しいINVITEのイニシエータが正常に交換されているユーザーに相当するものとして認証された場合は、交換が許可されています。例えば、ユーザが交換される場合、交換ダイアログ共有の開始ダイジェスト認証のために同じ資格情報[6]、またはそれらが同じ秘密鍵を使用して[7] S / MIMEとの交換要求に署名し、（同じ）を提示元のダイアログで使用される証明書に対応し、交換が許可されています。"
    },
    {
      "indent": 3,
      "text": "Alternatively, the Referred-By mechanism [4] defines a mechanism that the UAS can use to verify that a replacement request was sent on behalf of the other participant in the matched dialog (in this case, triggered by a REFER request). If the replacement request contains a Referred-By header that corresponds to the user being replaced, the UA SHOULD treat the replacement as if the replacement was authorized by the replaced party. The Referred-By header SHOULD reference a corresponding, valid Refererred-By Authenticated Identity Body [5].",
      "ja": "あるいは、[4]と呼ば-機構は（REFER要求によってトリガこの場合、）UASは、交換要求が一致ダイアログ内の他の参加者に代わって送信されたことを確認するために使用できるメカニズムを定義します。交換要求が交換されているユーザに対応呼ばバイヘッダーが含まれている場合は、交換を交換当事者によって承認されたかのように、UAは、交換を扱うべきです。いう-Byヘッダーは、対応する、有効Refererred-によって認証アイデンティティボディを参照する必要があり、[5]。"
    },
    {
      "indent": 3,
      "text": "The UA MAY apply other local policy to authorize the remainder of the request. In other words, the UAS may apply a different policy to the replacement dialog than was applied to the replaced dialog.",
      "ja": "UAはリクエストの残りを許可するために、他のローカルポリシーを適用することができます。つまり、UASは、置き換えダイアログに適用されたよりも交換用のダイアログに異なるポリシーを適用することができます。"
    },
    {
      "indent": 3,
      "text": "In addition, the UA MAY use other authorization mechanisms defined for this purpose in standards track extensions. Extensions could define other mechanisms for transitively asserting authorization of a replacement.",
      "ja": "また、UAは、標準の追跡機能拡張では、この目的のために定義された他の認証メカニズムを使用するかもしれません。拡張は推移交換の承認を主張するために他のメカニズムを定義することができます。"
    },
    {
      "indent": 3,
      "text": "If authorization is successful, the UA attempts to accept the new INVITE, reassign the user interface and other resources of the matched dialog to the new INVITE, and shut down the replaced dialog. If the UA cannot accept the new INVITE (for example: it cannot establish required QoS or keying, or it has incompatible media), the UA MUST return an appropriate error response and MUST leave the matched dialog unchanged.",
      "ja": "認証が成功した場合、UAはINVITE新しいを受け入れるようにしようと、新に合わせたダイアログのユーザーインターフェースや他のリソースを再割り当てINVITE、および置き換えダイアログをシャットダウンします。 UAが新しいを受け入れることができない場合は、INVITE（例えば：それは必要なQoSやキーイングを確立できない、またはそれは互換性のないメディアを持っている）、UAは、適切なエラー応答を返さなければなりませんし、そのままマッチしたダイアログを残しておく必要があります。"
    },
    {
      "indent": 3,
      "text": "If the Replaces header field matches a confirmed dialog, it checks for the presence of the \"early-only\" flag in the Replaces header field. (This flag allows the UAC to prevent a potentially undesirable race condition described in Section 7.1.) If the flag is present, the UA rejects the request with a 486 Busy response. Otherwise, it accepts the new INVITE by sending a 200-class response, and shuts down the replaced dialog by sending a BYE. If the Replaces header field matches an early dialog that was initiated by the UA, it accepts the new INVITE by sending a 200-class response, and shuts down the replaced dialog by sending a CANCEL.",
      "ja": "Replacesヘッダーフィールドは確認ダイアログと一致した場合、それはReplacesヘッダーフィールドに「早期専用」フラグの有無をチェックします。 （このフラグは、UACは、セクション7.1に記載潜在的に望ましくない競合状態を防ぐことができます。）フラグが存在する場合、UAは486ビジー応答して要求を拒否する。それ以外の場合は、新たに200クラスの応答を送信することにより、INVITE受け入れ、BYEを送信することにより置き換えダイアログをシャットダウンします。 ReplacesヘッダーフィールドはUAによって開始された初期のダイアログが一致した場合、それは新しいが、200クラスの応答を送信することにより、INVITE受け入れ、CANCELを送信することにより、置き換えダイアログをシャットダウンします。"
    },
    {
      "indent": 3,
      "text": "If the Replaces header field matches an early dialog that was not initiated by this UA, it returns a 481 (Call/Transaction Does Not Exist) response to the new INVITE, and leaves the matched dialog unchanged. Note that since Replaces matches only a single dialog, the replacement dialog will not be retargeted according to the same forking logic as the original request which created the early dialog.",
      "ja": "Replacesヘッダーフィールドは、このUAによって開始されていなかった初期のダイアログが一致した場合、それは新しいの481（通話/トランザクションが存在しない）応答は、INVITE返し、そのままマッチしたダイアログを残します。 Replacesは、単一のダイアログを一致するため、交換用ダイアログが早期にダイアログを作成し、元の要求と同じフォークロジックに従ってリターゲットされないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "(Currently, no use cases have been identified for replacing just a single dialog in this circumstance.)",
      "ja": "（現在のところ、ユースケースは、この状況でただ一つのダイアログを置き換えるために同定されていません。）"
    },
    {
      "indent": 0,
      "text": "4. User Agent Client Behavior: Sending a Replaces Header",
      "section_title": true,
      "ja": "4.ユーザエージェントクライアントの動作：Replacesヘッダーを送信"
    },
    {
      "indent": 3,
      "text": "A User Agent that wishes to replace a single existing early or confirmed dialog with a new dialog of its own, MAY send the target User Agent an INVITE request containing a Replaces header field. The User Agent Client (UAC) places the Call-ID, to-tag, and from-tag information for the target dialog in a single Replaces header field and sends the new INVITE to the target. If the user agent only wishes to replace an early dialog (as in the Call Pickup example in Section 7.1), the UAC MAY also include the \"early-only\" parameter in",
      "ja": "早期の既存または独自の新しいダイアログとの対話を確認したシングルを交換することを希望するユーザエージェントは、ターゲットユーザーエージェントにReplacesヘッダーフィールドを含むINVITE要求を送信することができます。ユーザエージェントクライアント（UAC）は、単一のReplacesヘッダーフィールドにターゲットダイアログのためのCall-IDにタグ、およびからタグ情報を配置し、ターゲットに新しいINVITEを送信します。ユーザエージェントのみ（第7.1節でコールピックアップの例のように）早期ダイアログを交換したい場合は、UACはまたに「早期専用」パラメータを含んでもよい（MAY）"
    },
    {
      "indent": 3,
      "text": "the Replaces header field. A UAC MUST NOT send an INVITE with a Replaces header field that attempts to replace an early dialog which was not originated by the target of the INVITE with a Replaces header field.",
      "ja": "Replacesヘッダフィールド。 UACはReplacesヘッダーフィールドを持つINVITEのターゲットによって発信されていなかった初期のダイアログを交換しようとReplacesヘッダーフィールドを持つINVITEを送ってはいけません。"
    },
    {
      "indent": 3,
      "text": "Note that use of this mechanism does not provide a way to match multiple dialogs, nor does it provide a way to match an entire call, an entire transaction, or to follow a chain of proxy forking logic. For example, if Alice replaces Cathy in an early dialog with Bob, but Bob does not answer, Alice's replacement request will not match other dialogs to which Bob's UA redirects, nor other branches to which his proxy forwards. Although this specification takes reasonable precautions to prevent unexpected behavior in the face of forking, implementations SHOULD only address replacement requests (i.e., set the Request-URI of the replacement request) to the SIP Contact URI of the target.",
      "ja": "このメカニズムの使用は、複数のダイアログを一致させる方法を提供していない、またそれが全体の呼び出し、トランザクション全体を一致させる方法を提供しない、またはロジックをフォークプロキシの連鎖に従うことに注意してください。アリスはボブと早期ダイアログでキャシーを置き換えますが、ボブが応答しない場合、例えば、アリスの交換要求は、彼のプロキシ転送にボブのUAがリダイレクト他のダイアログに、また他の枝とは一致しません。この仕様は、フォークの面に予期しない動作を防止するために合理的な予防措置をとるが、実装は、交換要求がターゲットのSIP連絡先URIに（すなわち、交換要求のリクエストURIを設定）対処すべきです。"
    },
    {
      "indent": 0,
      "text": "5. Proxy behavior",
      "section_title": true,
      "ja": "5.プロキシの動作"
    },
    {
      "indent": 3,
      "text": "Proxy Servers do not require any new behavior to support this extension. They simply pass the Replaces header field transparently as described in the SIP specification.",
      "ja": "プロキシサーバは、この拡張機能をサポートするために、新しい動作を必要としません。 SIP仕様に記載されているように、それらは単に透過Replacesヘッダーフィールドを渡します。"
    },
    {
      "indent": 3,
      "text": "Note that it is possible for a proxy (especially when forking based on some application layer logic, such as caller screening or time-of-day routing) to forward an INVITE request containing a Replaces header field to a completely orthogonal set of Contacts other than the original request it was intended to replace. In this case, the INVITE request with the Replaces header field will fail.",
      "ja": "以外のコンタクトの完全直交セットにReplacesヘッダーフィールドを含むINVITE要求を転送する（例えば、発呼者のスクリーニングまたはtime-of-dayルーティングとして、いくつかのアプリケーション・レイヤ・ロジックに基づいて分岐する場合は特に）、プロキシが可能であることに注意してください元の要求は、それを置き換えることを意図していました。この場合に代わるヘッダフィールドを持つINVITE要求は失敗します。"
    },
    {
      "indent": 0,
      "text": "6. Syntax",
      "section_title": true,
      "ja": "6.構文"
    },
    {
      "indent": 0,
      "text": "6.1. The Replaces Header",
      "section_title": true,
      "ja": "6.1。 Replacesヘッダー"
    },
    {
      "indent": 3,
      "text": "The Replaces header field indicates that a single dialog identified by the header field is to be shut down and logically replaced by the incoming INVITE in which it is contained. It is a request header only, and defined only for INVITE requests. The Replaces header field MAY be encrypted as part of end-to-end encryption. Only a single Replaces header field value may be present in a SIP request.",
      "ja": "Replacesヘッダフィールドは、ヘッダフィールドによって識別される単一のダイアログがシャットダウンし、論理的にそれが含まれるINVITEを受信することによって置換されることを示しています。それが唯一のリクエストヘッダであり、そして唯一のINVITE要求のために定義されました。 Replacesヘッダーフィールドは、エンドツーエンド暗号化の一部として暗号化されてもよいです。単一Replacesヘッダーフィールド値は、SIP要求の中に存在してもよいです。"
    },
    {
      "indent": 3,
      "text": "This document adds the following entry to Table 2 of [1]. Additions to this table are also provided for extension methods defined at the time of publication of this document. This is provided as a courtesy to the reader and is not normative in any way. MESSAGE, SUBSCRIBE and NOTIFY, REFER, INFO, UPDATE, PRACK, and PUBLISH are defined respectively in [15], [16], [8], [17], [18], [19], and [20].",
      "ja": "この文書では、[1]の表2に次のエントリを追加します。このテーブルへの追加は、この文書の発行時点で定義された拡張メソッドのために提供されます。これは、読者への礼儀として提供され、どのような方法で規範的ではありません。 MESSAGE、SUBSCRIBE及びNOTIFY、REFER、INFO、UPDATE、PRACK、及びPUBLISH [15]にそれぞれ定義されている、[16]、[8]、[17]、[18]、[19]及び[20]。"
    },
    {
      "indent": 6,
      "text": "Header field    where   proxy   ACK  BYE  CAN  INV  OPT  REG  MSG\n------------    -----   -----   ---  ---  ---  ---  ---  ---  ---\nReplaces          R              -    -    -    o    -    -    -",
      "raw": true
    },
    {
      "indent": 6,
      "text": "                                SUB  NOT  REF  INF  UPD  PRA  PUB\n                                ---  ---  ---  ---  ---  ---  ---\nReplaces          R              -    -    -    -    -    -    -",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The following syntax specification uses the augmented Backus-Naur Form (BNF) as described in RFC 2234 [3]. The syntax below relies on a number of productions from SIP [1].",
      "ja": "以下の構文仕様はRFC 2234に記載されているように拡張バッカスナウア記法（BNF）を使用する[3]。構文は、以下のSIP [1]から制作の数に依存しています。"
    },
    {
      "indent": 6,
      "text": "Replaces = \"Replaces\" HCOLON callid *(SEMI replaces-param) replaces-param = to-tag / from-tag / early-flag / generic-param to-tag = \"to-tag\" EQUAL token from-tag = \"from-tag\" EQUAL token early-flag = \"early-only\"",
      "ja": "置き換え=から* callid HCOLON（SEMIが代わる-param）はからタグ代わる-PARAM =へのタグ/からタグ/早フラグ/ジェネリック-PARAMにタグ= \"へのタグ\" EQUALトークンを=」 \"置き換え\" 「トークンEQUAL早期フラグ= 『早期専用』 -tag"
    },
    {
      "indent": 3,
      "text": "A Replaces header field MUST contain exactly one to-tag and exactly one from-tag, as they are required for unique dialog matching. For compatibility with dialogs initiated by RFC 2543 [9] compliant UAs, a tag of zero matches both tags of zero and null. A Replaces header field MAY contain the early-flag.",
      "ja": "Replacesヘッダーフィールドは、正確に一つのタグと正確に一つのタグ、それらは一意ダイアログマッチングのために必要とされるように含まれなければなりません。 RFC 2543によって開始されたダイアログボックスとの互換性のために、[9]に準拠UAは、ゼロのタグがゼロとヌルの両方のタグと一致します。 Replacesヘッダーフィールドは初期フラグを含むかもしれません。"
    },
    {
      "indent": 3,
      "text": "Examples:",
      "ja": "例："
    },
    {
      "indent": 6,
      "text": "Replaces: 98732@sip.example.com ;from-tag=r33th4x0r ;to-tag=ff87ff",
      "ja": "置き換え：98732@sip.example.com;からタグ= r33th4x0r;のタグ= ff87ff"
    },
    {
      "indent": 6,
      "text": "Replaces: 12adf2f34456gs5;to-tag=12345;from-tag=54321;early-only",
      "ja": "置き換え：12adf2f34456gs5;にタグ= 12345;からタグ= 54321;早期のみ"
    },
    {
      "indent": 6,
      "text": "Replaces: 87134@171.161.34.23;to-tag=24796;from-tag=0",
      "ja": "置き換え：87134@171.161.34.23;にタグ= 24796;からタグ= 0"
    },
    {
      "indent": 0,
      "text": "6.2. New Option Tag for Require and Supported Headers",
      "section_title": true,
      "ja": "6.2。必要とし、サポートされているヘッダーのための新しいオプションタグ"
    },
    {
      "indent": 3,
      "text": "This specification defines a new Require/Supported header option tag \"replaces\". UAs which support the Replaces header MUST include the \"replaces\" option tag in a Supported header field. UAs that want explicit failure notification if Replaces is not supported MAY include the \"replaces\" option in a Require header field.",
      "ja": "この仕様は、新たなサポート/ Requireヘッダーオプションタグ「置き換え」を定義します。 ReplacesヘッダーをサポートするUAは、Supportedヘッダーフィールドに「置き換え」オプションタグを含まなければなりません。 Replacesがサポートされていない場合は、明示的な障害通知を望むUAはRequireヘッダーフィールドにオプションを「置き換え」を含むことができます。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 6,
      "text": "Require: replaces, 100rel",
      "ja": "必要：置き換え、100rel"
    },
    {
      "indent": 0,
      "text": "7. Usage Examples",
      "section_title": true,
      "ja": "7.使用例"
    },
    {
      "indent": 3,
      "text": "The following non-normative examples are not intended to enumerate all the possibilities for the usage of this extension, but rather to provide examples or ideas only. For more examples, please see SIP Service Examples [14]. Via and Max-Forwards headers are omitted for clarity and brevity.",
      "ja": "以下の非規範的な例は、この拡張機能の使用方法についてあらゆる可能性を列挙するのではなく、単なる例やアイデアを提供することを意図していません。その他の例については、SIPサービスの例としては、[14]を参照してください。ビアとマックス・フォワードヘッダは明瞭かつ簡潔にするため省略されています。"
    },
    {
      "indent": 0,
      "text": "7.1. Replacing an Early Dialog at the Originator",
      "section_title": true,
      "ja": "7.1。オリジネーターで早期ダイアログの交換"
    },
    {
      "indent": 3,
      "text": "In this example, Bob just arrived in the lab and hasn't registered there yet. He hears his desk phone ring. He quickly logs into a software UA on a nearby computer. Among other things, the software UA has access to the dialog state of his desk phone. When it notices that his phone is ringing, it offers him the choice of taking the call there. The software UA sends an INVITE with Replaces to Alice. When Alice's UA receives this new INVITE, it CANCELs her original INVITE and connects Alice to Bob.",
      "ja": "この例では、ボブはちょうど研究室に到着し、まだ登録されていません。彼は彼の机の電話リングを聞きます。彼はすぐに近くのコンピュータにソフトウェアUAにログインします。とりわけ、ソフトウェアUAは自分のデスクの電話の対話状態へのアクセスを持っています。それは彼の電話が鳴っていることに気付くと、それは彼が電話を取るの選択肢を提供しています。ソフトウェアUAは、アリスにはReplacesとINVITEを送信します。アリスのUAが、これは新しいINVITEを受信すると、それは、INVITE彼女の元をキャンセルし、ボブにアリスを接続しています。"
    },
    {
      "indent": 3,
      "text": "                           Bob                      Bob\n    Alice                  desk                     lab\n     |                       |                        |\n *1  |-----INVITE----------->|                        |\n *2  |<----180---------------|  Bob hears desk phone  |\n     |                       |  ringing from lab but  |\n     |                       |  isn't REGISTERed yet  |\n     |                       |                        |\n     |                       |<--fetch dialog state --|\n     |                       |---response ----------->|\n*3/4 |<-----INVITE with Replaces/200/ACK--------------|\n*5/6 |------CANCEL/200------>|                        |\n*7   |<-----487--------------|                        |\n     |------ACK------------->|                        |\n     |                       |                        |\n     |                       |                        |",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Message *1: Alice -> Bob's desk phone",
      "ja": "メッセージ* 1：アリス - >ボブのデスクフォン"
    },
    {
      "indent": 3,
      "text": "INVITE sip:bob@example.org SIP/2.0 To: <sip:bob@example.org> From: <sip:alice@example.org>;tag=7743 Call-ID: 425928@phone.example.org CSeq: 1 INVITE Contact: <sip:alice@phone.example.org>",
      "ja": "INVITE SIP：bob@example.org SIP / 2.0 <SIP：bob@example.org>から<SIP：alice@example.org>;タグ= 7743のCall-ID：425928@phone.example.orgのCSeq： <一口：alice@phone.example.org> 1連絡先を招待"
    },
    {
      "indent": 3,
      "text": "Message *2: Bob's desk phone -> Alice",
      "ja": "メッセージ* 2：ボブのデスクの電話 - >アリス"
    },
    {
      "indent": 3,
      "text": "SIP/2.0 180 Ringing To: <sip:bob@example.org>;tag=6472 From: <sip:alice@example.org>;tag=7743 Call-ID: 425928@phone.example.org CSeq: 1 INVITE Contact: <sip:bob@bobster.example.org>",
      "ja": "SIP / 2.0 180リンギングを<SIP：bob@example.org>;タグ= 6472から<SIP：alice@example.org>;タグ= 7743のCall-ID：425928@phone.example.orgのCSeq：INVITE 1連絡先：<SIP：bob@bobster.example.org>"
    },
    {
      "indent": 3,
      "text": "Message *3: Bob in lab -> Alice",
      "ja": "メッセージ* 3：ラボでボブ - >アリス"
    },
    {
      "indent": 3,
      "text": "INVITE sip:alice@phone.example.org To: <sip:alice@example.org> From: <sip:bob@example.org>;tag=8983 Call-ID: 09870@labpc.example.org CSeq: 1 INVITE Contact: <sip:bob@labpc.example.org> Replaces: 425928@phone.example.org ;to-tag=7743;from-tag=6472;early-only",
      "ja": "alice@phone.example.orgへ：SIPのINVITE <一口：alice@example.org>から<SIP：bob@example.org>;タグ= 8983のCall-ID：09870@labpc.example.orgのCSeq：1連絡先をINVITE：<SIP：bob@labpc.example.org>は置き換え：425928@phone.example.org;にタグ= 7743;からタグ= 6472;早期のみ"
    },
    {
      "indent": 3,
      "text": "Message *4: Alice -> Bob in lab",
      "ja": "メッセージ* 4：アリス - ラボで>ボブ"
    },
    {
      "indent": 3,
      "text": "SIP/2.0 200 OK To: <sip:alice@example.org>;tag=9232 From: <sip:bob@example.org>;tag=8983 Call-ID: 09870@labpc.example.org CSeq: 1 INVITE Contact: <sip:alice@phone.example.org>",
      "ja": "SIP / 2.0 200 OK <SIP：alice@example.org>;タグ= 9232から<SIP：bob@example.org>;タグ= 8983のCall-ID：09870@labpc.example.orgのCSeq：INVITE 1連絡先：<SIP：alice@phone.example.org>"
    },
    {
      "indent": 3,
      "text": "Message *5: Alice -> Bob's desk",
      "ja": "メッセージ* 5：アリス - >ボブのデスク"
    },
    {
      "indent": 3,
      "text": "CANCEL sip:bob@example.org SIP/2.0 To: <sip:bob@example.org> From: <sip:alice@example.org>;tag=7743 Call-ID: 425928@phone.example.org CSeq: 1 CANCEL Contact: <sip:alice@phone.example.org>",
      "ja": "CANCEL SIP：bob@example.org SIP / 2.0 <SIP：bob@example.org>から<SIP：alice@example.org>;タグ= 7743のCall-ID：425928@phone.example.orgのCSeq： <一口：alice@phone.example.org> 1連絡先をキャンセル"
    },
    {
      "indent": 3,
      "text": "Message *6: Bob's desk -> Alice",
      "ja": "メッセージ* 6：ボブのデスク - >アリス"
    },
    {
      "indent": 3,
      "text": "SIP/2.0 200 OK To: <sip:bob@example.org> From: <sip:alice@example.org>;tag=7743 Call-ID: 425928@phone.example.org CSeq: 1 CANCEL Contact: <sip:bob@bobster.example.org>",
      "ja": "SIP / 2.0 200 OKに<SIP：bob@example.org>から<SIP：alice@example.org>;タグ= 7743のCall-ID：425928@phone.example.orgのCSeq：1接触CANCEL <SIP ：bob@bobster.example.org>"
    },
    {
      "indent": 3,
      "text": "Message *7: Bob's desk -> Alice",
      "ja": "メッセージ* 7：ボブのデスク - >アリス"
    },
    {
      "indent": 3,
      "text": "SIP/2.0 487 Request Terminated To: <sip:bob@example.org>;tag=6472 From: <sip:alice@example.org>;tag=7743 Call-ID: 425928@phone.example.org CSeq: 1 INVITE",
      "ja": "終端SIP / 2.0 487要求：<SIP：bob@example.org>;タグ= 6472から<SIP：alice@example.org>;タグ= 7743のCall-ID：425928@phone.example.orgのCSeq：1 INVITE"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The extension specified in this document significantly changes the relative security of SIP devices. Currently in SIP, even if an eavesdropper learns the Call-ID, To, and From headers of a dialog, they cannot easily modify or destroy that dialog if Digest authentication or end-to-end message integrity are used.",
      "ja": "この文書で指定された拡張子を大幅にSIPデバイスの相対的なセキュリティを変更します。現在、SIPで、盗聴者は、Call-IDは、に、学習した場合でも、ダイアログのヘッダから、彼らは簡単に変更したり、ダイジェスト認証やエンドツーエンドのメッセージの完全性が使用されている場合は、そのダイアログを破壊することはできません。"
    },
    {
      "indent": 3,
      "text": "This extension can be used to disconnect participants or replace participants in a multimedia conversation. As such, invitations with the Replaces header MUST only be accepted if the peer requesting replacement has been properly authenticated using a standard SIP mechanism (Digest or S/MIME), and authorized to request a replacement of the target dialog. All SIP implementations are already required to support Digest Authentication. In addition, implementations which support the Replaces header SHOULD also implement the Referred-By mechanism.",
      "ja": "この拡張は、参加者を切断したり、マルチメディア会話の参加者を置き換えるために使用することができます。このように、Replacesヘッダーと招待状は、ピア要求交換が適切に標準のSIPメカニズム（ダイジェストまたはS / MIME）を使用して認証された場合に受け入れられ、そして標的ダイアログの交換を要求することを許可されなければなりません。すべてのSIPの実装は、すでにダイジェスト認証をサポートする必要があります。また、Replacesヘッダーをサポートする実装も呼ば-機構を実装する必要があります。"
    },
    {
      "indent": 3,
      "text": "How a User Agent determines which requests are legitimately authorized to make dialog replacements is non-trivial and depends on a considerable amount of local policy configuration. In general, there are four cases when an authorization for a replacement is reasonable or warranted.",
      "ja": "ユーザエージェントは、要求が正当にダイアログ代替品を作るために許可されているどのように決定するか非自明であるとローカルポリシー設定のかなりの量に依存します。交換のための認可が妥当か妥当であるとき、一般的には、4例があります。"
    },
    {
      "indent": 3,
      "text": "1. Replacement made by a party considered equivalent to the replaced party",
      "ja": "置き換えパーティと等価であると考えパーティ製の1.交換"
    },
    {
      "indent": 3,
      "text": "2. Replacement made on behalf of the replaced party (perhaps transitively)",
      "ja": "（おそらく推移）に置き換えパーティに代わって行わ2.交換"
    },
    {
      "indent": 3,
      "text": "3. Replacement made by a former participant",
      "section_title": true,
      "ja": "かつての参加者によって行われた。3.交換"
    },
    {
      "indent": 3,
      "text": "4. Replacement made by a specifically authorized party",
      "section_title": true,
      "ja": "特に認可パーティ製の4交換"
    },
    {
      "indent": 3,
      "text": "Starting with #1 for example, if an executive and an assistant both receive requests for a shared address-of-record, if so configured, either should be able to replace dialogs of the other for the shared identity. Both could even share the same keying material (Digest or S/MIME), or one could hold an authorization document signed by the other expressing this relationship. Likewise, in a call center environment, each call center agent could possess credentials to which supervisors also have access.",
      "ja": "ように設定されている場合、執行とアシスタントの両方が共有アドレス・オブ・レコードのリクエストを受信した場合、例えば＃1から始めて、どちらかが共有される同一のために他のダイアログを置き換えることができるはずです。両方があっても、同じ鍵材料（ダイジェストまたはS / MIME）を共有することができ、または1つは、この関係を表現する他によって署名された許可文書を保持することができました。同様に、コール・センター環境で、各コールセンターのエージェントは、アクセス権を持っている監督者の資格情報を持っている可能性があります。"
    },
    {
      "indent": 3,
      "text": "The most common use case of a replacement is on the request of the replaced participant (who no longer wants to be involved). This is the case in many features, such as completing an Attended Transfer and converting a 3-way call to a point-to-point call. Such replacements are typically triggered by a REFER [8] request from the replaced participant. The Referred-By [4] mechanism defines one way to identify the apparent original requester and can point to a SIP Authenticated Identity Body [5] (an S/MIME-based signed assertion) to secure this information.",
      "ja": "交換用の最も一般的なユースケースは、（もはや関与することを希望する）置き換え参加者のリクエストに応じています。これは、在席転送が完了し、ポイントツーポイントコールに3方向通話を変換するなど、多くの機能、の場合です。そのような置換は、典型的には、交換参加者からのREFER [8]要求によってトリガーされます。いうバイ[4]のメカニズムは明らかで要求元を識別し、この情報を保護するためにSIP認証された識別体[5]（S / MIMEベースの署名されたアサーション）を指すことができる一つの方法を定義します。"
    },
    {
      "indent": 3,
      "text": "In the example in section 1, Alice sends an INVITE with Replaces to Bob. Alice was a former participant in the conversation and had a previous dialog relationship with Bob. Alice can use the same Digest or S/MIME credentials she used to authenticate with Bob during the original call to prove that she was a former participant. Note that this justification for replacing calls is more dangerous than the others, and in most cases is another way to authorize that the replacing participant is available. Implementations SHOULD NOT rely on this method as an authorization mechanism.",
      "ja": "セクション1の例では、アリスは、ボブにはReplacesとINVITEを送信します。アリスは、会話の中で、元の参加者だったとボブと前のダイアログ関係を持っていました。アリスは、彼女は彼女がかつて参加したことを証明するために、元の通話中にボブでの認証に使用されるのと同じダイジェストやS / MIMEの資格情報を使用することができます。呼び出しを置き換えるため、この正当化は、他の人よりも危険であり、ほとんどの場合、交換する参加者が利用可能であることを承認する別の方法であることに注意してください。実装は、認可メカニズムとして、この方法に頼るべきではありません。"
    },
    {
      "indent": 3,
      "text": "The last scenario is the easiest to secure but the least likely to be useful in practice. It is unlikely that an arbitrary host in the Internet is aware of any special authorization relationship between the replaced and the replacing parties. However, this use case may be useful in some environments. Since this usage does not effectively degrade the security of the solution, it is still allowed.",
      "ja": "最後のシナリオは確保するのが最も簡単ですが、実際に有用であることが最も可能性が高いです。インターネット上の任意のホストを交換し、交換当事者間の特別な権限関係を認識しているとは考えにくいです。しかし、このユースケースは、一部の環境で有用であり得ます。この使用が効果的ソリューションのセキュリティが低下することはありませんので、それはまだ許可されています。"
    },
    {
      "indent": 3,
      "text": "Some mechanisms for obtaining the dialog information needed by the Replaces header (Call-ID, to-tag, and from-tag) include URIs on a web page, subscriptions to an appropriate event package, and notifications after a REFER request. Since manipulating this dialog information could cause User Agents to replace the wrong dialog, use of message integrity protection for this information is STRONGLY RECOMMENDED. Use of end-to-end security mechanisms to encrypt this information is also RECOMMENDED.",
      "ja": "Replacesヘッダーで必要なダイアログ情報取得のためのいくつかのメカニズム（コールIDは、TO-タグ、およびからタグ）がREFERリクエストした後、Webページ上のURI、適切なイベントパッケージへのサブスクリプション、および通知が含まれます。間違ったダイアログを置き換えるためにユーザエージェントを引き起こす可能性があり、このダイアログの情報を操作しているので、この情報のメッセージ完全性保護の使用を強くお勧めします。この情報を暗号化するために、エンドツーエンドのセキュリティメカニズムの使用も推奨されます。"
    },
    {
      "indent": 3,
      "text": "This extension was designed to take advantage of future signature or authorization schemes defined in standards track extensions. In general, call control features benefit considerably from such work.",
      "ja": "この拡張は、標準化トラックの拡張で定義された将来の署名や認証スキームを利用するように設計されました。一般的には、呼制御機能は、このような作業からかなり恩恵を受ける。"
    },
    {
      "indent": 0,
      "text": "9. IANA Considerations",
      "section_title": true,
      "ja": "9. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "9.1. Registration of \"Replaces\" SIP header",
      "section_title": true,
      "ja": "9.1。登録は、SIPヘッダを「置き換え」"
    },
    {
      "indent": 3,
      "text": "Name of Header: Replaces",
      "ja": "ヘッダーの名前：置き換え"
    },
    {
      "indent": 3,
      "text": "Short form: none",
      "ja": "短い形式：なし"
    },
    {
      "indent": 3,
      "text": "Normative description: section 6.1 of this document",
      "ja": "規範的な説明：この文書のセクション6.1"
    },
    {
      "indent": 0,
      "text": "9.2. Registration of \"replaces\" SIP Option-tag",
      "section_title": true,
      "ja": "9.2。 「置き換え」SIPオプションタグの登録"
    },
    {
      "indent": 3,
      "text": "Name of option: replaces",
      "ja": "オプションの名称：置き換え"
    },
    {
      "indent": 3,
      "text": "Description: Support for the SIP Replaces header",
      "ja": "説明：SIP Replacesヘッダーのサポート"
    },
    {
      "indent": 3,
      "text": "SIP headers defined: Replaces",
      "ja": "SIPヘッダが定義されて：置き換え"
    },
    {
      "indent": 3,
      "text": "Normative description: This document",
      "ja": "規範的な説明：この文書"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgments",
      "section_title": true,
      "ja": "10.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Robert Sparks, Alan Johnston, Dan Petrie, Ben Campbell, and many other members of the SIP WG for their continued support of the cause of distributed call control in SIP.",
      "ja": "ロバート・スパークス、アラン・ジョンストン、ダン・ペトリー、ベン・キャンベル、およびSIPにおける分散呼制御の原因の彼らの継続的な支援のためのSIP WGの多くの他のメンバーに感謝します。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "ja": "[1]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\" 、RFC 3261、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[2] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[2]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[3] Crocker, D. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 2234, November 1997.",
      "ja": "[3]クロッカー、D.、およびP. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、RFC 2234、1997年11月。"
    },
    {
      "indent": 3,
      "text": "[4] Sparks, R., \"The Session Initiation Protocol (SIP) Referred-By Mechanism\", RFC 3892, September 2004.",
      "ja": "[4]、R.、 \"セッション開始プロトコル（SIP）と呼ば-メカニズム\"、RFC 3892、2004年9月スパークス。"
    },
    {
      "indent": 3,
      "text": "[5] Peterson, J., \"The Session Initiation Protocol (SIP) Authenticated Identity Body (AIB) Format\", RFC 3893, September 2004.",
      "ja": "[5]ピーターソン、J.、 \"セッション開始プロトコル（SIP）認証済みアイデンティティボディ（AIB）フォーマット\"、RFC 3893、2004年9月。"
    },
    {
      "indent": 3,
      "text": "[6] Franks, J., Hallam-Baker, P., Hostetler, J., Lawrence, S., Leach, P., Luotonen, A., and L. Stewart, \"HTTP Authentication: Basic and Digest Access Authentication\", RFC 2617, June 1999.",
      "ja": "[6]フランクス、J.、ハラム・ベイカー、P.、Hostetler、J.、ローレンス、S.、リーチ、P.、Luotonen、A.、およびL.スチュワート、 \"HTTP認証：基本とダイジェストアクセス認証\" 、RFC 2617、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[7] Ramsdell, B., \"Secure/Multipurpose Internet Mail Extensions (S/MIME) Version 3.1 Message Specification\", RFC 3851, July 2004.",
      "ja": "[7] Ramsdell、B.、RFC 3851、2004年7月 \"/多目的インターネットメール拡張（S / MIME）バージョン3.1メッセージ仕様を固定します\"。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[8] Sparks, R., \"The Session Initiation Protocol (SIP) Refer Method\", RFC 3515, April 2003.",
      "ja": "[8] R.、 \"セッション開始プロトコル（SIP）メソッドを参照してください\"、RFC 3515、2003年4月、火花。"
    },
    {
      "indent": 3,
      "text": "[9] Handley, M., Schulzrinne, H., Schooler, E., and J. Rosenberg, \"SIP: Session Initiation Protocol\", RFC 2543, March 1999.",
      "ja": "[9]ハンドレー、M.、Schulzrinneと、H.、学生はE.、およびJ.ローゼンバーグ、 \"SIP：セッション開始プロトコル\"、RFC 2543、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[10] Mahy, R., \"A Call Control and Multi-party usage framework for the Session Initiation Protocol (SIP)\", Work in Progress, March 2003.",
      "ja": "[10]マーイ、R.、「コール制御およびセッション開始プロトコル（SIP）のためのマルチパーティの使用フレームワーク」、進歩、2003年3月での作業。"
    },
    {
      "indent": 3,
      "text": "[11] Rosenberg, J., Peterson, J., Schulzrinne, H., and G. Camarillo, \"Best Current Practices for Third Party Call Control (3pcc) in the Session Initiation Protocol (SIP)\", BCP 85, RFC 3725, April 2004.",
      "ja": "[11]ローゼンバーグ、J.、ピーターソン、J.、Schulzrinneと、H.、およびG.カマリロを、BCP 85、RFC 3725 \"セッション開始プロトコル（SIP）における第三者呼制御（3PCC）のベスト・プラクティスの現在\" 、2004年4月。"
    },
    {
      "indent": 3,
      "text": "[12] Sparks, R. and A. Johnston, \"Session Initiation Protocol Call Control - Transfer\", Work in Progress, February 2003.",
      "ja": "[12]スパークス、R.とA.ジョンストン、「セッション開始プロトコル呼制御 - 転送」、進歩、2003年2月での作業。"
    },
    {
      "indent": 3,
      "text": "[13] Rosenberg, J. and H. Schulzrinne, \"An INVITE Initiated Dialog Event Package for the Session Initiation Protocol (SIP)\", Work in Progress, March 2003.",
      "ja": "[13]ローゼンバーグ、J.とH. Schulzrinneと、「セッション開始プロトコル（SIP）のために開始INVITEダイアログイベントパッケージ」、進歩、2003年3月での作業。"
    },
    {
      "indent": 3,
      "text": "[14] Johnston, A. and S. Donovan, \"Session Initiation Protocol Service Examples\", Work in Progress, March 2003.",
      "ja": "[14]ジョンストン、A.、およびS.ドノバン、「セッション開始プロトコルサービスの例」、進歩、2003年3月での作業。"
    },
    {
      "indent": 3,
      "text": "[15] Campbell, B., Rosenberg, J., Schulzrinne, H., Huitema, C., and D. Gurle, \"Session Initiation Protocol (SIP) Extension for Instant Messaging\", RFC 3428, December 2002.",
      "ja": "[15]キャンベル、B.、ローゼンバーグ、J.、Schulzrinneと、H.、のHuitema、C.、およびD. Gurle、 \"インスタントメッセージングのためのセッション開始プロトコル（SIP）拡張子\"、RFC 3428、2002年12月。"
    },
    {
      "indent": 3,
      "text": "[16] Roach, A., \"Session Initiation Protocol (SIP)-Specific Event Notification\", RFC 3265, June 2002.",
      "ja": "[16]ローチ、A.、 \"セッション開始プロトコル（SIP）特異的イベント通知\"、RFC 3265、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[17] Donovan, S., \"The SIP INFO Method\", RFC 2976, October 2000.",
      "ja": "[17]ドノバン、S.、 \"SIP INFOメソッド\"、RFC 2976、2000年10月。"
    },
    {
      "indent": 3,
      "text": "[18] Rosenberg, J., \"The Session Initiation Protocol (SIP) UPDATE Method\", RFC 3311, October 2002.",
      "ja": "[18]ローゼンバーグ、J.、 \"セッション開始プロトコル（SIP）更新方法\"、RFC 3311、2002年10月。"
    },
    {
      "indent": 3,
      "text": "[19] Rosenberg, J. and H. Schulzrinne, \"Reliability of Provisional Responses in Session Initiation Protocol (SIP)\", RFC 3262, June 2002.",
      "ja": "、RFC 3262、2002年6月[19]ローゼンバーグ、J.、およびH. Schulzrinneと、 \"セッション開始プロトコル（SIP）における暫定的な応答の信頼性\"。"
    },
    {
      "indent": 3,
      "text": "[20] Campbell, B., \"SIMPLE Presence Publication Mechanism\", Work in Progress, February 2003.",
      "ja": "[20]キャンベル、B.、 \"SIMPLEプレゼンス公開メカニズム\"、進歩、2003年2月に作業。"
    },
    {
      "indent": 0,
      "text": "12. Authors' Addresses",
      "section_title": true,
      "ja": "12.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Rohan Mahy Cisco Systems, Inc. 5617 Scotts Valley Dr Scotts Valley, CA 95066 USA",
      "ja": "ロハンマーイシスコシステムズ株式会社5617スコッツバレー博士スコッツバレー、CA 95066 USA"
    },
    {
      "indent": 3,
      "text": "EMail: rohan@cisco.com",
      "ja": "メールアドレス：rohan@cisco.com"
    },
    {
      "indent": 3,
      "text": "Billy Biggs",
      "ja": "ビリー・ビッグス"
    },
    {
      "indent": 3,
      "text": "EMail: bbiggs@dumbterm.net",
      "ja": "メールアドレス：bbiggs@dumbterm.net"
    },
    {
      "indent": 3,
      "text": "Rick Dean",
      "ja": "リック・ディーン"
    },
    {
      "indent": 3,
      "text": "EMail: rfc@fdd.com",
      "ja": "メールアドレス：rfc@fdd.com"
    },
    {
      "indent": 0,
      "text": "13. Full Copyright Statement",
      "section_title": true,
      "ja": "13.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（C）インターネット協会（2004）。"
    },
    {
      "indent": 3,
      "text": "This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/S HE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とHEが表すCONTRIBUTOR、ORGANIZATION HE / S OR（もしあれば）後援されており、インターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示、「そのまま」で提供されていますOR情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証を含むがこれらに限定されないで、黙示。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the IETF's procedures with respect to rights in IETF Documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 IETF文書の権利に関するIETFの手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}