{
  "title": {
    "text": "RFC 3438 - Layer Two Tunneling Protocol (L2TP) Internet Assigned Numbers Authority (IANA) Considerations Update",
    "ja": "RFC 3438 - レイヤ2トンネリングプロトコル（L2TP）IANA（Internet Assigned Numbers Authority）の考慮事項更新"
  },
  "number": 3438,
  "created_at": "2019-10-28 09:56:49.598011+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        W. Townsley\nRequest for Comments: 3438                                 Cisco Systems\nBCP: 68                                                    December 2002\nCategory: Best Current Practice",
      "raw": true
    },
    {
      "indent": 4,
      "text": "              Layer Two Tunneling Protocol (L2TP)\nInternet Assigned Numbers Authority (IANA) Considerations Update",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントはインターネットコミュニティのためのインターネットBest Current Practicesを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2002）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes updates to the Internet Assigned Numbers Authority (IANA) considerations for the Layer Two Tunneling Protocol (L2TP).",
      "ja": "この文書では、レイヤ2トンネリングプロトコル（L2TP）のためのIANA（Internet Assigned Numbers Authority）に配慮への更新について説明します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction.............................................    1\n  1.1 Terminology...........................................    2\n2. IANA Considerations......................................    2\n  2.1 Control Message AVPs..................................    3\n  2.2 Message Type AVP Values...............................    3\n  2.3 Result Code AVP Values................................    3\n  2.4 Remaining Values......................................    3\n3. Normative References.....................................    3\n4. Security Considerations..................................    4\n5. Acknowledgements.........................................    4\n6. Author's Address.........................................    4\n7. Full Copyright Statement.................................    5",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document provides guidance to the Internet Assigned Numbers Authority (IANA) regarding the registration of values related to the Layer Two Tunneling Protocol (L2TP), defined in [RFC2661], in accordance with BCP 26, [RFC2434].",
      "ja": "この文書では、BCP 26、[RFC2434]に従って、[RFC2661]で定義されたレイヤ2トンネリングプロトコル（L2TP）に関連する値の登録に関してインターネット割り当て番号機関（IANA）にガイダンスを提供します。"
    },
    {
      "indent": 0,
      "text": "1.1 Terminology",
      "section_title": true,
      "ja": "1.1用語"
    },
    {
      "indent": 3,
      "text": "The following terms are used here with the meanings defined in BCP 26: \"name space\", \"assigned value\", \"registration\".",
      "ja": "「名前空間」、「割り当てられた値」、「登録」：次の用語は、BCP 26で定義される意味と共にここで使用されています。"
    },
    {
      "indent": 3,
      "text": "The following policies are used here with the meanings defined in BCP 26: \"Private Use\", \"First Come First Served\", \"Expert Review\", \"Specification Required\", \"IETF Consensus\", \"Standards Action\".",
      "ja": "次のポリシーは、BCP 26で定義される意味と共にここで使用されている：「私用」、「まず第一に役立ってくる」、「エキスパートレビュー」、「仕様が必要である」、「IETFコンセンサス」、「標準化アクション」。"
    },
    {
      "indent": 0,
      "text": "2. IANA Considerations",
      "section_title": true,
      "ja": "2. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "L2TP [RFC2661] defines a number of \"magic\" numbers to be maintained by the IANA. This section updates the criteria to be used by the IANA to assign additional numbers in each of these lists.",
      "ja": "L2TP [RFC2661]はIANAによって維持される「マジック」番号の数を定義します。このセクションでは、これらの各リストに追加番号を割り当てるためにIANAが使用する基準を更新します。"
    },
    {
      "indent": 3,
      "text": "Each of the values identified in this document that require a registration criteria update are currently maintained by IANA and have a range of values from 0 to 65 535, of which a very small number have been allocated (the maximum number allocated within any one range is 46) [L2TP-IANA]. Given the nature of these values, it is not expected that any will ever run into a resource allocation problem if registration allocation requirements are relaxed from their current state.",
      "ja": "登録基準の更新を必要とするこの文書で識別した値が現在IANAによって維持し、0から65 535の値の範囲を有する、非常に小さな数が割り当てられているのものの各々（いずれかの範囲内で割り当てられた最大数であります46）[L2TP-IANA]。これらの値の性質を考えると、登録割り当て要件は、現在の状態からリラックスしている場合は任意のは、これまで資源配分問題に実行されることが期待されていません。"
    },
    {
      "indent": 3,
      "text": "The recommended criteria changes for IANA registration are listed in the following sections. In one case, the registration criteria is currently defined as First Come First Served and should be made more strict, others are defined as IETF Consensus and need to be relaxed. The relaxation from IETF Consensus is motivated by specific cases in which values that were never intended to be vendor-specific have had to enter early field trials or be released in generally available products with vendor-specific values while awaiting documents to be formalized. In most cases, this results in products that have to support both the vendor-specific value and IETF value indefinitely.",
      "ja": "IANA登録のための推奨基準の変更は、次のセクションに記載されています。まず、他の人がIETFコンセンサスのように定義してリラックスする必要がありますされ、最初に添え是非、より厳密になされるべきであるように、1つの場合には、登録基準は、現在定義されています。 IETFコンセンサスからの緩和は、ベンダー固有であることを意図されていませんでしたされた値に特定のケースによって動機づけされ、早期のフィールドトライアルを入力しなければならなかったか、待っている文書が形式化する一方で、ベンダー固有の値を持つ、一般的に入手可能な製品でリリースされます。ほとんどの場合、これは無期限、ベンダー固有の値とIETF値の両方をサポートする必要が製品になります。"
    },
    {
      "indent": 3,
      "text": "For registration requests where a Designated Expert should be consulted, the responsible IESG Area Director should appoint the Designated Expert.",
      "ja": "Expertが相談されるべきである登録要求のために、責任がIESGエリアディレクターはDesignated Expertを任命するべきです。"
    },
    {
      "indent": 3,
      "text": "For registration requests requiring Expert Review, the Designated Expert should consult relevant WGs as appropriate (e.g., the l2tpext WG at the time of this writing).",
      "ja": "エキスパートレビューを必要とする登録要求の場合は、指定Expertは、適切な（この記事の執筆時点では、例えば、l2tpext WG）などの関連のWGに相談してください。"
    },
    {
      "indent": 3,
      "text": "The basic guideline for the Expert Review process will be to approve the assignment of a value only if there is a document being advanced that clearly defines the values to be assigned, and there is active implementation development (perhaps entering early field or interoperability trails, requiring assigned values to proceed without having to resort to a chosen vendor-specific method).",
      "ja": "エキスパートレビュープロセスが明確に要求する、おそらく初期のフィールドや相互運用性のトレイルを入力する（割り当てる値を定義し、アクティブなインプリメンテーションの開発があることを文書が進められている場合にのみ値の割り当てを承認することになるための基本的な指針選択されたベンダー固有の方法に頼ることなく進行に割り当てられた値）。"
    },
    {
      "indent": 0,
      "text": "2.1 Control Message AVPs",
      "section_title": true,
      "ja": "2.1制御メッセージのAVP"
    },
    {
      "indent": 3,
      "text": "IANA manages the \"Control Message Attribute Value Pairs\" [L2TP-IANA] name space, of which 0 - 46 have been assigned. The criteria for assignment was originally IETF Consensus. Further values should be assigned upon Expert Review.",
      "ja": "46割り当てられている -  IANAは0がその「制御メッセージは、値のペアを属性」[L2TP-IANA]名前空間を管理します。割り当てのための基準は、もともとはIETF合意しました。また、値は専門家レビュー時に割り当てる必要があります。"
    },
    {
      "indent": 0,
      "text": "2.2 Message Type AVP Values",
      "section_title": true,
      "ja": "2.2メッセージタイプAVP値"
    },
    {
      "indent": 3,
      "text": "IANA manages the \"Message Type AVP (Attribute Type 0) Values\" [L2TP-IANA] name space, of which 0 - 16 have been assigned. The criteria for assignment was originally IETF Consensus. Further values should be assigned upon Expert Review.",
      "ja": "16割り当てられている -  IANAは0がその「メッセージタイプAVP（属性タイプ0）値」[L2TP-IANA]名前空間を管理します。割り当てのための基準は、もともとはIETF合意しました。また、値は専門家レビュー時に割り当てる必要があります。"
    },
    {
      "indent": 0,
      "text": "2.3 Result Code AVP Values",
      "section_title": true,
      "ja": "2.3コードAVP値の結果"
    },
    {
      "indent": 3,
      "text": "IANA maintains a list of \"Result Code values for the StopCCN message,\" \"Result Code values for the CDN message,\" and \"General Error Codes\" [L2TP-IANA]. The criteria for Error Code assignment was originally First Come First Served, and the criteria for CDN and StopCCN Result Codes were originally IETF Consensus. Further values for all Result and Error codes should be assigned upon Expert Review.",
      "ja": "IANAは、「StopCCNメッセージの結果コード値、」CDNメッセージのための「結果コード値、」および「一般的なエラーコード」[L2TP-IANA]のリストを保持します。エラーコードの割り当てのための基準は、元々はまず最初に務め、CDNとStopCCN結果コードのための基準は、もともとIETF合意した来ました。すべての結果とエラーコードのためのさらなる値は、専門家レビュー時に割り当てる必要があります。"
    },
    {
      "indent": 0,
      "text": "2.4 Remaining Values",
      "section_title": true,
      "ja": "2.4残りの値"
    },
    {
      "indent": 3,
      "text": "All criteria for L2TP values maintained by IANA and not mentioned specifically in this document remain unchanged.",
      "ja": "この文書で具体的に挙げL2TP値IANAによって維持されていないため、すべての基準が変更されません。"
    },
    {
      "indent": 0,
      "text": "3. Normative References",
      "section_title": true,
      "ja": "3.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2434] Alvestrand, H. and T. Narten, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[RFC2434] Alvestrand、H.、およびT. Narten氏、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2661] Townsley, W., Valencia, A., Rubens, A., Pall, G., Zorn, G. and B. Palter, \"Layer Two Tunneling Layer Two Tunneling Protocol (L2TP)\", RFC 2661, August 1999.",
      "ja": "[RFC2661] Townsley、W.、バレンシア、A.、ルーベンス、A.、ポール、G.、ソーン、G、BのPalter、 \"レイヤ2トンネリングレイヤ2トンネリングプロトコル（L2TP）\"、RFC 2661、1999年8月。"
    },
    {
      "indent": 3,
      "text": "[L2TP-IANA] Internet Assigned Numbers Authority (IANA), \"Layer Two Tunneling Protocol 'L2TP' - RFC 2661\", http://www.iana.org/assignments/l2tp-parameters",
      "ja": "[L2TP-IANA] IANA（Internet Assigned Numbers Authority）に、 \"レイヤ2トンネリングプロトコル 'L2TP'  -  RFC 2661\"、http://www.iana.org/assignments/l2tp-parameters"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This focuses on IANA considerations, and does not have security considerations.",
      "ja": "これは、IANA問題に焦点を当て、およびセキュリティ上の考慮事項はありません。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgements",
      "section_title": true,
      "ja": "5.謝辞"
    },
    {
      "indent": 3,
      "text": "Some of this text and much of the format of this document was taken from an internet document on EAP IANA Considerations authored by Bernard Aboba.",
      "ja": "このテキストと、この文書のフォーマットの多くのいくつかはバーナードAbobaによって作成EAP IANAの考慮事項にインターネット文書から取られました。"
    },
    {
      "indent": 0,
      "text": "6. Author's Address",
      "section_title": true,
      "ja": "6.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "W. Mark Townsley Cisco Systems 7025 Kit Creek Road PO Box 14987 Research Triangle Park, NC 27709",
      "ja": "W.マークTownsleyシスコシステムズ7025キットクリーク道路私書箱14987リサーチトライアングルパーク、NC 27709"
    },
    {
      "indent": 3,
      "text": "EMail: mark@townsley.net",
      "ja": "メールアドレス：mark@townsley.net"
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "ja": "7.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2002）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}