{
  "title": {
    "text": "RFC 3718 - A Summary of Unicode Consortium Procedures, Policies, Stability, and Public Access",
    "ja": "RFC 3718 - ユニコードコンソーシアム手順、ポリシー、安定性、およびパブリックアクセスの概要"
  },
  "number": 3718,
  "created_at": "2023-10-02 09:17:17.707782+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         R. McGowan\nRequest for Comments: 3718                                       Unicode\nCategory: Informational                                    February 2004",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "A Summary of Unicode Consortium Procedures, Policies, Stability, and Public Access",
      "ja": "ユニコードコンソーシアム手順、ポリシー、安定性、およびパブリックアクセスの概要"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). All Rights Reserved.",
      "ja": "著作権（c）The Internet Society（2004）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo describes various internal workings of the Unicode Consortium for the benefit of participants in the IETF. It is intended solely for informational purposes. Included are discussions of how the decision-making bodies of the Consortium work and their procedures, as well as information on public access to the character encoding & standardization processes.",
      "ja": "このメモは、IETFの参加者の利益のために、Unicodeコンソーシアムのさまざまな内部作業を説明しています。情報目的のみを目的としています。コンソーシアムの意思決定団体がどのように機能し、その手順がどのように機能するかについての議論、およびキャラクターエンコーディングおよび標準化プロセスへのパブリックアクセスに関する情報が含まれています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This memo describes various internal workings of the Unicode Consortium for the benefit of participants in the IETF. It is intended solely for informational purposes. Included are discussions of how the decision-making bodies of the Consortium work and their procedures, as well as information on public access to the character encoding & standardization processes.",
      "ja": "このメモは、IETFの参加者の利益のために、Unicodeコンソーシアムのさまざまな内部作業を説明しています。情報目的のみを目的としています。コンソーシアムの意思決定団体がどのように機能し、その手順がどのように機能するかについての議論、およびキャラクターエンコーディングおよび標準化プロセスへのパブリックアクセスに関する情報が含まれています。"
    },
    {
      "indent": 0,
      "text": "2. About The Unicode Consortium",
      "section_title": true,
      "ja": "2. ユニコードコンソーシアムについて"
    },
    {
      "indent": 3,
      "text": "The Unicode Consortium is a corporation. Legally speaking, it is a \"California Nonprofit Mutual Benefit Corporation\", organized under section 501 C(6) of the Internal Revenue Service Code of the United States. As such, it is a \"business league\" not focussed on profiting by sales or production of goods and services, but neither is it formally a \"charitable\" organization. It is an alliance of member companies whose purpose is to \"extend, maintain, and promote the Unicode Standard\". To this end, the Consortium keeps a small office, a few editorial and technical staff, World Wide Web presence, and mail list presence.",
      "ja": "ユニコードコンソーシアムは企業です。法的に言えば、それは米国の内国歳入庁コードのセクション501 C（6）に基づいて組織された「カリフォルニアの非営利相互福利厚生法人」です。そのため、商品やサービスの販売や生産による利益に焦点を当てていない「ビジネスリーグ」ですが、正式には「慈善」組織でもありません。これは、「Unicode Standardを拡張、維持、促進すること」を目的とするメンバー企業の同盟です。この目的のために、コンソーシアムは小さなオフィス、いくつかの編集および技術スタッフ、ワールドワイドウェブプレゼンス、およびメールリストの存在を維持しています。"
    },
    {
      "indent": 3,
      "text": "The corporation is presided over by a Board of Directors who meet annually. The Board is comprised of individuals who are elected annually by the full members for three-year terms. The Board appoints Officers of the corporation to run the daily operations.",
      "ja": "企業は、毎年会う取締役会によって司会されています。理事会は、3年間の任期で全員によって毎年選出される個人で構成されています。理事会は、日常業務を実行するために会社の役員を任命します。"
    },
    {
      "indent": 3,
      "text": "Membership in the Consortium is open to \"all corporations, other business entities, governmental agencies, not-for-profit organizations and academic institutions\" who support the Consortium's purpose. Formally, one class of voting membership is recognized, and dues-paying members are typically for-profit corporations, research and educational institutions, or national governments. Each such full member sends representatives to meetings of the Unicode Technical Committee (see below), as well as to a brief annual Membership meeting.",
      "ja": "コンソーシアムのメンバーシップは、コンソーシアムの目的をサポートする「すべての企業、その他のビジネスエンティティ、政府機関、非営利組織、学術機関」に開放されています。正式には、1つのクラスの投票メンバーシップが認められ、会費の支払いメンバーは通常、営利企業、研究および教育機関、または国政府です。そのような各メンバーは、代表者をユニコード技術委員会の会議（以下を参照）と簡単な年次会員会議に派遣します。"
    },
    {
      "indent": 0,
      "text": "3. The Unicode Technical Committee",
      "section_title": true,
      "ja": "3. ユニコード技術委員会"
    },
    {
      "indent": 3,
      "text": "The Unicode Technical Committee (UTC) is the technical decision making body of the Consortium. The UTC inherited the work and prior decisions of the Unicode Working Group (UWG) that was active prior to formation of the Consortium in January 1991.",
      "ja": "Unicode Technical Committee（UTC）は、コンソーシアムの技術的意思決定機関です。UTCは、1991年1月にコンソーシアムの形成前にアクティブだったUnicodeワーキンググループ（UWG）の作業と以前の決定を継承しました。"
    },
    {
      "indent": 3,
      "text": "Formally, the UTC is a technical body instituted by resolution of the board of directors. Each member appoints one principal and one or two alternate representatives to the UTC. UTC representatives frequently do, but need not, act as the ordinary member representatives for the purposes of the annual meeting.",
      "ja": "正式には、UTCは取締役会の解決によって制定された技術団体です。各メンバーは、UTCに1人の校長と1人または2人の代替代表者を任命します。UTCの代表者は、年次総会の目的のために普通のメンバーの代表として頻繁に行いますが、必要ではありません。"
    },
    {
      "indent": 3,
      "text": "The UTC is presided over by a Chair and Vice-Chair, appointed by the Board of Directors for an unspecified term of service.",
      "ja": "UTCは、委員長と副議長が司会を務め、取締役会によって不特定のサービス期間のために任命されました。"
    },
    {
      "indent": 3,
      "text": "The UTC meets 4 to 5 times a year to discuss proposals, additions, and various other technical topics. Each meeting lasts 3 to 4 full days. Meetings are held in locations decided upon by the membership, frequently in the San Francisco Bay Area. There is no fee for participation in UTC meetings. Agendas for meetings are not generally posted to any public forum, but meeting dates, locations, and logistics are posted well in advance on the \"Unicode Calendar of Events\" web page.",
      "ja": "UTCは、年に4〜5回、提案、追加、その他のさまざまな技術的トピックについて議論します。各会議は3〜4日間続きます。会議は、サンフランシスコベイエリアで頻繁にメンバーシップによって決定された場所で開催されます。UTC会議への参加料はありません。会議のアジェンダは通常、パブリックフォーラムには投稿されませんが、会議の日付、場所、ロジスティクスは、「イベントのユニコードカレンダー」Webページに事前に事前に投稿されています。"
    },
    {
      "indent": 3,
      "text": "At the discretion of the UTC chair, meetings are open to participation of member and liaison organizations, and to observation by others. The minutes of meetings are also posted publicly on the \"UTC Minutes\" page of the Unicode Web site.",
      "ja": "UTC議長の裁量により、会議は会員組織とリエゾン組織の参加、および他者による観察に開かれています。会議の議事録は、Unicode Webサイトの「UTC分」ページにも公開されています。"
    },
    {
      "indent": 3,
      "text": "All UTC meetings are held jointly with the INCITS Technical Committee L2, the body responsible for Character Code standards in the United States. They constitute \"ad hoc\" meetings of the L2 body and are usually followed by a full meeting of the L2 committee. Further information on L2 is available on the official INCITS web page.",
      "ja": "すべてのUTC会議は、米国のキャラクターコード標準を担当する団体であるIncits Technical Committee L2と共同で開催されます。それらはL2ボディの「アドホック」会議を構成し、通常はL2委員会の完全な会議が続きます。L2の詳細については、公式Incits Webページをご覧ください。"
    },
    {
      "indent": 0,
      "text": "4. Unicode Technical Committee Procedures",
      "section_title": true,
      "ja": "4. ユニコード技術委員会の手順"
    },
    {
      "indent": 3,
      "text": "The formal procedures of the UTC are publicly available in a document entitled \"UTC Procedures\", available from the Consortium, and on the Unicode web site.",
      "ja": "UTCの正式な手順は、コンソーシアムから入手可能な「UTC手順」と題されたドキュメントおよびUnicode Webサイトで公開されています。"
    },
    {
      "indent": 3,
      "text": "Despite the invocation of Robert's Rules of Order, UTC meetings are conducted with relative informality in view of the highly technical nature of most discussions. Meetings focus on items from a technical agenda organized and published by the UTC Chair prior to the meeting. Technical items are usually proposals in one of the following categories:",
      "ja": "ロバートの秩序のルールの呼び出しにもかかわらず、UTC会議は、ほとんどの議論の高度に技術的な性質を考慮して、相対的な非公式性で行われます。会議は、会議の前にUTC椅子が組織および公開した技術アジェンダのアイテムに焦点を当てています。通常、技術項目は、次のカテゴリのいずれかの提案です。"
    },
    {
      "indent": 6,
      "text": "1. Addition of new characters (whole scripts, additions to existing scripts, or other characters)",
      "ja": "1. 新しい文字の追加（スクリプト全体、既存のスクリプトへの追加、または他の文字）"
    },
    {
      "indent": 6,
      "text": "2. Preparation and Editing of Technical Reports and Standards",
      "ja": "2. 技術レポートと標準の準備と編集"
    },
    {
      "indent": 6,
      "text": "3. Changes in the semantics of specific characters",
      "ja": "3. 特定の文字のセマンティクスの変化"
    },
    {
      "indent": 6,
      "text": "4. Extensions to the encoding architecture and forms of use",
      "ja": "4. エンコーディングアーキテクチャと使用フォームへの拡張"
    },
    {
      "indent": 3,
      "text": "Note: There may also be changes to the architecture, character properties, or semantics. Such changes are rare, and are always constrained by the \"Unicode Stability Policies\" posted on the Unicode web site. Significant changes are undertaken in consultation with liaison organizations, such as W3C and IETF, which have standards that may be affected by such changes. See sections 5 and 6 below.",
      "ja": "注：アーキテクチャ、キャラクターのプロパティ、またはセマンティクスにも変更がある場合があります。このような変更はまれであり、Unicode Webサイトに投稿された「Unicode安定性ポリシー」によって常に制約されています。W3CやIETFなどのリエゾン組織と協議して、そのような変更の影響を受ける可能性のある基準があるという重要な変更が行われます。以下のセクション5および6を参照してください。"
    },
    {
      "indent": 3,
      "text": "Typical outputs of the UTC are:",
      "ja": "UTCの典型的な出力は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "1. The Unicode Standard, major and minor versions (including the Unicode Character Database)",
      "ja": "1. Unicode標準、メジャーバージョン、およびマイナーバージョン（Unicode文字データベースを含む）"
    },
    {
      "indent": 6,
      "text": "2. Unicode Technical Reports",
      "ja": "2. Unicode技術レポート"
    },
    {
      "indent": 6,
      "text": "3. Stand-alone Unicode Technical Standards",
      "ja": "3. スタンドアロンのユニコード技術標準"
    },
    {
      "indent": 6,
      "text": "4. Formal resolutions",
      "ja": "4. 正式な決議"
    },
    {
      "indent": 6,
      "text": "5. Liaison statements and instructions to the Unicode liaisons to other organizations.",
      "ja": "5. 他の組織へのUnicode連絡局への連絡声明と指示。"
    },
    {
      "indent": 3,
      "text": "For each technical item on the meeting agenda, the general process is as follows:",
      "ja": "会議アジェンダの各技術項目について、一般的なプロセスは次のとおりです。"
    },
    {
      "indent": 6,
      "text": "1. Introduction by the topic sponsor",
      "ja": "1. トピックスポンサーによる紹介"
    },
    {
      "indent": 6,
      "text": "2. Proposals and discussion",
      "ja": "2. 提案と議論"
    },
    {
      "indent": 6,
      "text": "3. Consensus statements or formal motions",
      "ja": "3. コンセンサスステートメントまたは正式な動き"
    },
    {
      "indent": 6,
      "text": "4. Assignment of formal actions to implement decisions",
      "ja": "4. 決定を実施するための正式な行動の割り当て"
    },
    {
      "indent": 0,
      "text": "5. Unicode Technical Committee Motions",
      "section_title": true,
      "ja": "5. ユニコード技術委員会の動き"
    },
    {
      "indent": 3,
      "text": "Technical topics of any complexity never proceed from initial proposal to final ratification or adoption into the standard in the course of one UTC meeting. The UTC members and presiding officers are aware that technical changes to the standard have broad consequences to other standards, implementers, and end-users of the standard. Input from other organizations and experts is often vital to the understanding of various proposals and for successful adoption into the standard.",
      "ja": "複雑さの技術的トピックは、最初の提案から最終的な批准または1つのUTC会議の過程で標準への採用に決して進むことはありません。UTCメンバーと議長は、標準の技術的な変更が、他の標準、実装者、および標準のエンドユーザーに幅広い結果をもたらすことを認識しています。他の組織や専門家からの意見は、多くの場合、さまざまな提案の理解や基準への採用を成功させるために不可欠です。"
    },
    {
      "indent": 3,
      "text": "Technical topics are decided in UTC through the use of formal motions, either taken in meetings, or by means of thirty-day letter ballots. Formal UTC motions are of two types:",
      "ja": "技術的なトピックは、会議で行われた、または30日間の手紙の投票によって、正式な動きを使用してUTCで決定されます。正式なUTCモーションには2つのタイプがあります。"
    },
    {
      "indent": 6,
      "text": "1. Simple motions",
      "ja": "1. 単純な動き"
    },
    {
      "indent": 6,
      "text": "2. Precedents",
      "ja": "2. 先例"
    },
    {
      "indent": 3,
      "text": "Simple motions may pass with a simple majority constituting more than 50 percent of the qualified voting members; or by a special majority constituting two-thirds or more of the qualified voting members.",
      "ja": "単純な動きは、資格のある投票メンバーの50％以上を構成する単純な過半数で通過する可能性があります。または、資格のある投票メンバーの3分の2以上を構成する特別多数派によって。"
    },
    {
      "indent": 3,
      "text": "Precedents are defined, according to the UTC Procedures as either",
      "ja": "UTC手順に従って、どちらかです。"
    },
    {
      "indent": 6,
      "text": "(A) an existing Unicode Policy, or",
      "ja": "（a）既存のユニコードポリシー、または"
    },
    {
      "indent": 6,
      "text": "(B) an explicit precedent.",
      "ja": "（b）明示的な先例。"
    },
    {
      "indent": 3,
      "text": "Precedents must be passed or overturned by a special majority.",
      "ja": "先例は、特別な過半数によって合格または覆されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Examples of implicit precedents include:",
      "ja": "暗黙の先例の例は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "1. Publication of a character in the standard",
      "ja": "1. 標準のキャラクターの公開"
    },
    {
      "indent": 6,
      "text": "2. Published normative character properties 3. Algorithms required for formal conformance",
      "ja": "2. 公開された規範的文字プロパティ3.正式な適合に必要なアルゴリズム"
    },
    {
      "indent": 3,
      "text": "An Explicit Precedent is a policy, procedure, encoding, algorithm, or other item that is established by a separate motion saying (in effect) that a particular prior motion establishes a precedent.",
      "ja": "明示的な先例は、特定の事前の動きが先例を確立することを（効果的に）言う別の動きによって確立されたポリシー、手順、エンコード、アルゴリズム、またはその他の項目です。"
    },
    {
      "indent": 3,
      "text": "A proposal may be passed either by a formal motion and vote, or by consensus. If there is broad agreement as to the proposal, and no member wishes to force a vote, then the proposal passes by consensus and is recorded as such in the minutes.",
      "ja": "提案は、正式な申し立てと投票、またはコンセンサスのいずれかによって可決される場合があります。提案に関して広範な合意があり、メンバーが投票を強制したい場合、提案はコンセンサスによって可決され、議事録にそのように記録されます。"
    },
    {
      "indent": 0,
      "text": "6. Unicode Consortium Policies",
      "section_title": true,
      "ja": "6. ユニコードコンソーシアムポリシー"
    },
    {
      "indent": 3,
      "text": "Because the Unicode Standard is continually evolving in an attempt to reach the ideal of encoding \"all the world's scripts\", new characters will constantly be added. In this sense, the standard is unstable: in the standard's useful lifetime, there may never be a final point at which no more characters are added. Realizing this, the Consortium has adopted certain policies to promote and maintain stability of the characters that are already encoded, as well as laying out a Roadmap to future encodings.",
      "ja": "Unicode標準は、「すべての世界のスクリプト」をエンコードする理想に到達するために継続的に進化しているため、新しいキャラクターは常に追加されます。この意味で、標準は不安定です。標準の有用な寿命において、これ以上のキャラクターが追加されない最終的なポイントは決してないかもしれません。これを実現すると、コンソーシアムは特定のポリシーを採用して、すでにエンコードされているキャラクターの安定性を促進および維持し、将来のエンコーディングへのロードマップをレイアウトしています。"
    },
    {
      "indent": 3,
      "text": "The overall policies of the Consortium with regard to encoding stability, as well as other issues such as privacy, are published on a \"Unicode Consortium Policies\" web page. Deliberations and encoding proposals in the UTC are bound by these policies.",
      "ja": "エンコードの安定性に関するコンソーシアムの全体的なポリシー、およびプライバシーなどの他の問題は、「Unicode Consortiumポリシー」Webページに公開されています。UTCでの審議とエンコード提案は、これらのポリシーに拘束されます。"
    },
    {
      "indent": 3,
      "text": "The general effect of the stability policies may be stated in this way: once a character is encoded, it will not be moved or removed and its name will not be changed. Any of those actions has the potential for causing obsolescence of data, and they are not permitted. The canonical combining class and decompositions of characters will not be changed in any way that affects normalization. In this sense, normalization, such as that used for International Domain Naming and \"early normalization\" for use on the World Wide Web, is fixed and stable for every character at the time that character is encoded. (Any changes that are undertaken because of outright errors in properties or decompositions are dealt with by means of an adjunct data file so that normalization stability can still be maintained by those who need it.)",
      "ja": "安定性ポリシーの一般的な効果は、このように述べることができます。文字がエンコードされると、移動または削除されず、その名前は変更されません。これらのアクションは、データの陳腐化を引き起こす可能性があり、許可されていません。文字のクラスと分解を組み合わせた標準的な組み合わせは、正規化に影響を与える方法では変更されません。この意味で、World Wide Webで使用するために国際ドメインの命名と「早期正規化」に使用されるような正規化は、キャラクターがエンコードされた時点ですべてのキャラクターに対して固定され、安定しています。（プロパティまたは分解の完全なエラーのために行われた変更は、補助データファイルによって対処され、それを必要とする人が正規化の安定性を維持できるようにします。）"
    },
    {
      "indent": 3,
      "text": "Once published, each version of the Unicode Standard is absolutely stable and will never be changed retroactively. Implementations or specifications that refer to a specific version of the Unicode Standard can rely upon this stability. If future versions of such implementations or specifications upgrade to a future version of the Unicode Standard, then some changes may be necessary.",
      "ja": "公開されると、Unicode標準の各バージョンは絶対に安定しており、遡及的に変更されることはありません。Unicode標準の特定のバージョンを参照する実装または仕様は、この安定性に依存する可能性があります。このような実装または仕様の将来のバージョンがUnicode標準の将来のバージョンにアップグレードする場合、いくつかの変更が必要になる場合があります。"
    },
    {
      "indent": 3,
      "text": "Property values of characters, such as directionality for the Unicode Bidi algorithm, may be changed between versions of the standard in some circumstances. As less-well documented characters and scripts are encoded, the exact character properties and behavior may not be well known at the time the characters are first encoded. As more experience is gathered in implementing the newly encoded characters, adjustments in the properties may become necessary. This re-working is kept to a minimum. New and old versions of the relevant property tables are made available on the Consortium's web site.",
      "ja": "Unicode Bidiアルゴリズムの方向性などの文字のプロパティ値は、状況によっては標準のバージョン間で変更される場合があります。あまり文書化されていない文字とスクリプトがエンコードされるため、文字が最初にエンコードされた時点では、正確な文字の特性と動作はよく知られていない場合があります。新しくエンコードされた文字の実装におけるより多くの経験が収集されると、プロパティの調整が必要になる場合があります。このリワーキングは最小限に抑えられています。関連するプロパティテーブルの新しいバージョンと古いバージョンは、コンソーシアムのWebサイトで利用可能になります。"
    },
    {
      "indent": 3,
      "text": "Normative and some informative data about characters is kept in the Unicode Character Database (UCD). The structure of many of these property values will not be changed. Instead, when new properties are defined, the Consortium adds new files for these properties, so as not to affect the stability of existing implementations that use the values and properties defined in the existing formats and files. The latest version of the UCD is available on the Consortium web site via the \"Unicode Data\" heading.",
      "ja": "文字に関する規範的およびいくつかの有益なデータは、Unicode文字データベース（UCD）に保持されます。これらのプロパティ値の多くの構造は変更されません。代わりに、新しいプロパティが定義されている場合、コンソーシアムはこれらのプロパティの新しいファイルを追加します。これは、既存の形式とファイルで定義されている値とプロパティを使用する既存の実装の安定性に影響しないようにします。UCDの最新バージョンは、「Unicode Data」見出しを介してコンソーシアムのWebサイトで入手できます。"
    },
    {
      "indent": 3,
      "text": "Note on data redistribution: Unlike the situation with IETF documents, some parts of the Unicode Character Database may have restrictions on their verbatim redistribution with source-code products. Users should read the notices in files they intend to use in such products. The information contained in the UCD may be freely used to create derivative works (such as programs, compressed data files, subroutines, data structures, etc.) that may be redistributed freely, but some files may not be redistributable verbatim. Such restrictions on Unicode data files are never meant to prohibit or control the use of the data in products, but only to help ensure that users retrieve the latest official releases of data files when using the data in products.",
      "ja": "データの再配布に関する注意：IETFドキュメントの状況とは異なり、Unicode文字データベースの一部は、ソースコード製品を使用した逐語的な再分配に制限がある場合があります。ユーザーは、そのような製品で使用するファイルの通知を読み取る必要があります。UCDに含まれる情報は、自由に再配布される可能性のあるデリバティブ作業（プログラム、圧縮データファイル、サブルーチン、データ構造など）を作成するために自由に使用できますが、一部のファイルは再配布できない場合があります。Unicodeデータファイルのこのような制限は、製品のデータの使用を禁止または制御することを意図したものではなく、製品を使用するときにユーザーがデータファイルの最新の公式リリースを取得できるようにするためだけです。"
    },
    {
      "indent": 0,
      "text": "7. UTC and ISO (WG2)",
      "section_title": true,
      "ja": "7. UTCとISO（WG2）"
    },
    {
      "indent": 3,
      "text": "The character repertoire, names, and general architecture of the Unicode Standard are identical to the parallel international standard ISO/IEC 10646. ISO/IEC 10646 only contains a small fraction of the semantics, properties and implementation guidelines supplied by the Unicode Standard and associated technical standards and reports. Implementations conformant to Unicode are conformant to ISO/IEC 10646.",
      "ja": "Unicode標準のキャラクターレパートリー、名前、および一般アーキテクチャは、並行国際標準ISO/IEC 10646と同一です。ISO/IEC 10646には、ユニコード標準および関連技術が提供するセマンティクス、プロパティ、および実装ガイドラインのわずかな割合のみが含まれています。基準とレポート。Unicodeに準拠する実装は、ISO/IEC 10646に適合しています。"
    },
    {
      "indent": 3,
      "text": "ISO/IEC 10646 is maintained by the committee ISO/IEC JTC1/SC2/WG2. The WG2 committee is composed of national body representatives to ISO. Details on the ISO organization may be found on the official web site of the International Organization for Standardization (ISO).",
      "ja": "ISO/IEC 10646は、委員会ISO/IEC JTC1/SC2/WG2によって維持されています。WG2委員会は、ISOの国家団体代表で構成されています。ISO組織の詳細は、国際標準化機関（ISO）の公式Webサイトに記載されています。"
    },
    {
      "indent": 3,
      "text": "Details and history of the relationship between ISO/IEC JTC1/SC2/WG2 and Unicode, Inc. may be found in Appendix C of The Unicode Standard. (A PDF rendition of the most recent printed edition of the Unicode Standard can be found on the Unicode web site.)",
      "ja": "ISO/IEC JTC1/SC2/WG2とUnicode、Inc。の関係の詳細と歴史は、Unicode標準の付録Cに記載されている場合があります。（Unicode Standardの最新の印刷版のPDF演出は、Unicode Webサイトにあります。）"
    },
    {
      "indent": 3,
      "text": "WG2 shares with UTC the policies regarding stability: WG2 neither removes characters nor changes their names once published. Changes in both standards are closely tracked by the respective committees, and a very close working relationship is fostered to maintain synchronization between the standards.",
      "ja": "WG2はUTCと共有します。安定性に関するポリシー：WG2は、公開された文字を削除したり、名前を変更したりしません。両方の基準の変更は、それぞれの委員会によって密接に追跡されており、基準間の同期を維持するために非常に緊密な協力関係が促進されます。"
    },
    {
      "indent": 3,
      "text": "The Unicode Collation Algorithm (UCA) is one of a small set of other independent standards defined and maintained by UTC. It is not, properly speaking, part of the Unicode Standard itself, but is separately defined in Unicode Technical Standard #10 (UTS #10). There is no conformance relationship between the two standards, except that conformance to a specific base version of the Unicode Standard (e.g., 4.0) is specified in a particular version of a UTS. The collation algorithm specified in UTS #10 is conformant to ISO/IEC 14651, maintained by ISO/IEC JTC1/SC2, and the two organizations maintain a close relationship. Beyond what is specified in ISO/IEC 14651, the UCA contains additional constraints on collation, specifies additional options, and provides many more implementation guidelines.",
      "ja": "Unicode照合アルゴリズム（UCA）は、UTCによって定義および維持されている他の独立した標準の小さなセットの1つです。適切に言えば、Unicode標準自体の一部ではありませんが、Unicode Technical Standard＃10（UTS＃10）で個別に定義されています。2つの標準間に適合関係はありませんが、Unicode標準の特定のベースバージョン（4.0）に適合していることが、UTSの特定のバージョンで指定されていることを除きます。UTS＃10で指定された照合アルゴリズムは、ISO/IEC JTC1/SC2によって維持されているISO/IEC 14651に適合しており、2つの組織は密接な関係を維持しています。ISO/IEC 14651で指定されているものを超えて、UCAには照合に追加の制約が含まれ、追加のオプションを指定し、さらに多くの実装ガイドラインを提供します。"
    },
    {
      "indent": 0,
      "text": "8. Process of Technical Changes to the Unicode Standard",
      "section_title": true,
      "ja": "8. ユニコード標準の技術的な変更のプロセス"
    },
    {
      "indent": 3,
      "text": "Changes to The Unicode Standard are of two types: architectural changes, and character additions.",
      "ja": "Unicode標準の変更には、アーキテクチャの変更と文字の追加の2つのタイプがあります。"
    },
    {
      "indent": 3,
      "text": "Most architectural changes do not affect ISO/IEC 10646, for example, the addition of various character properties to Unicode. Those architectural changes that do affect both standards, such as additional UTF formats or allocation of planes, are very carefully coordinated by the committees. As always, on the UTC side, architectural changes that establish precedents are carefully monitored and the above-described rules and procedures are followed.",
      "ja": "ほとんどのアーキテクチャの変更は、ISO/IEC 10646には影響しません。たとえば、Unicodeにさまざまな文字特性を追加します。追加のUTF形式や飛行機の割り当てなど、両方の基準に影響を与えるこれらの建築の変更は、委員会によって非常に慎重に調整されています。いつものように、UTC側では、先例を確立するアーキテクチャの変更が慎重に監視され、上記のルールと手順に従います。"
    },
    {
      "indent": 3,
      "text": "Additional characters for inclusion in the The Unicode Standard must be approved both by the UTC and by WG2. Proposals for additional characters enter the standards process in one of several ways: through...",
      "ja": "Unicode標準に含めるための追加の文字は、UTCとWG2の両方で承認する必要があります。追加の文字の提案は、いくつかの方法のいずれかで標準プロセスに入ります：スルー..."
    },
    {
      "indent": 6,
      "text": "1. a national body member of WG2",
      "ja": "1. WG2の国家機関のメンバー"
    },
    {
      "indent": 6,
      "text": "2. a member company or associate of UTC",
      "ja": "2. UTCの会員会社または準会議"
    },
    {
      "indent": 6,
      "text": "3. directly from an individual \"expert\" contributor",
      "ja": "3. 個々の「専門家」の貢献者から直接"
    },
    {
      "indent": 3,
      "text": "The two committees have jointly produced a \"Proposal Summary Form\" that is required to accompany all additional character proposals. This form may be found online at the WG2 web site, and on the Unicode web site along with information about \"Submitting New Characters or Scripts\". Instructions for submitting proposals to UTC may likewise be found online.",
      "ja": "2つの委員会は、すべての追加のキャラクター提案に付随するために必要な「提案要約フォーム」を共同で作成しました。このフォームは、WG2 WebサイトおよびUnicode Webサイトでオンラインで「新しい文字またはスクリプトの送信」に関する情報とともに見つけることができます。同様に、UTCに提案を提出するための指示は、オンラインで見つけることができます。"
    },
    {
      "indent": 3,
      "text": "Often, submission of proposals to both committees (UTC and WG2) is simultaneous. Members of UTC also frequently forward to WG2 proposals that have been initially reviewed by UTC.",
      "ja": "多くの場合、両方の委員会（UTCとWG2）への提案の提出は同時にあります。UTCのメンバーは、最初にUTCによってレビューされたWG2提案に頻繁に転送されます。"
    },
    {
      "indent": 3,
      "text": "In general, a proposal that is submitted to UTC before being submitted to WG2 passes through several stages:",
      "ja": "一般に、WG2に提出される前にUTCに提出される提案は、いくつかの段階を通過します。"
    },
    {
      "indent": 6,
      "text": "1. Initial presentation to UTC",
      "ja": "1. UTCへの最初のプレゼンテーション"
    },
    {
      "indent": 6,
      "text": "2. Review and re-drafting",
      "ja": "2. レビューと再ドラフト"
    },
    {
      "indent": 6,
      "text": "3. Forwarding to WG2 for consideration",
      "ja": "3. 検討のためにWG2への転送"
    },
    {
      "indent": 6,
      "text": "4. Re-drafting for technical changes",
      "ja": "4. 技術的な変更のための再ドラフト"
    },
    {
      "indent": 6,
      "text": "5. Balloting for approval in UTC",
      "ja": "5. UTCでの承認のための投票"
    },
    {
      "indent": 6,
      "text": "6. Re-forwarding and recommendation to WG2",
      "ja": "6. WG2への再フォアリングと推奨"
    },
    {
      "indent": 6,
      "text": "7. At least two rounds of international balloting in ISO",
      "ja": "7. ISOでの少なくとも2ラウンドの国際投票"
    },
    {
      "indent": 3,
      "text": "About two years are required to complete this process. Initial proposals most often do not include sufficient information or justification to be approved. These are returned to the submitters with comments on how the proposal needs to be amended or extended. Repertoire addition proposals that are submitted to WG2 before being submitted to UTC are generally forwarded immediately to UTC through committee liaisons. The crucial parts of the process (steps 5 through 7 above) are never short-circuited. A two-thirds majority in UTC is required for approval at step 5.",
      "ja": "このプロセスを完了するには、約2年が必要です。ほとんどの場合、最初の提案には、承認されるのに十分な情報や正当化は含まれません。これらは、提案をどのように修正または延長する必要があるかについてのコメントで提出者に返送されます。UTCに提出される前にWG2に提出されるレパートリーの追加提案は、通常、委員会の連絡を介してUTCにすぐに転送されます。プロセスの重要な部分（上記のステップ5〜7）は、短絡することはありません。UTCの3分の2の過半数は、ステップ5での承認に必要です。"
    },
    {
      "indent": 3,
      "text": "Proposals for additional scripts are required to be coordinated with relevant user communities. Often there are ad-hoc subcommittees of UTC or expert mail list participants who are responsible for actually drafting proposals, garnering community support, or representing user communities.",
      "ja": "追加のスクリプトの提案は、関連するユーザーコミュニティと調整する必要があります。多くの場合、実際に提案の起草、コミュニティのサポートを獲得し、ユーザーコミュニティを代表する責任を負うUTCまたは専門家メールリストの参加者のアドホック小委員会があります。"
    },
    {
      "indent": 3,
      "text": "The rounds of international balloting in step 7 have participation both by UTC and WG2, though UTC does not directly vote in the ISO process.",
      "ja": "ステップ7の国際投票のラウンドは、UTCとWG2の両方で参加していますが、UTCはISOプロセスで直接投票しません。"
    },
    {
      "indent": 3,
      "text": "Occasionally a proposal approved by one body is considered too immature for approval by the other body, and may be blocked de-facto by either of the two. Only after both bodies have approved the additional characters do they proceed to the rounds of international balloting. (The first round is a draft international standard during which some changes may occur, the second round is final approval during which only editorial changes are made.)",
      "ja": "時には、ある団体によって承認された提案は、他の身体による承認には未熟すぎると見なされ、2つのうちのいずれかによって事実上ブロックされる可能性があります。両方の体が追加のキャラクターを承認した後にのみ、彼らは国際投票のラウンドに進みます。（最初のラウンドは、いくつかの変更が発生する可能性のある国際標準のドラフトであり、第2ラウンドは編集の変更のみが行われる最終承認です。）"
    },
    {
      "indent": 3,
      "text": "This process assures that proposals for additional characters are mature and stable by the time they appear in a final international ballot.",
      "ja": "このプロセスは、追加のキャラクターの提案が最終的な国際投票に登場するまでに成熟し、安定していることを保証します。"
    },
    {
      "indent": 0,
      "text": "9. Public Access to the Character Encoding Process",
      "section_title": true,
      "ja": "9. キャラクターエンコーディングプロセスへのパブリックアクセス"
    },
    {
      "indent": 3,
      "text": "While Unicode, Inc. is a membership organization, and the final say in technical matters rests with UTC, the process is quite open to public input and scrutiny of processes and proposals. There are many influential individual experts and industry groups who are not formally members, but whose input to the process is taken seriously by UTC.",
      "ja": "Unicode、Inc。はメンバーシップ組織であり、技術的な問題の最終決定はUTCにかかっていますが、プロセスはプロセスと提案の公開と精査に対して非常に開かれています。正式にメンバーではないが、そのプロセスへの入力がUTCによって真剣に受け止められている多くの影響力のある個別の専門家や業界グループがいます。"
    },
    {
      "indent": 3,
      "text": "Internally, UTC maintains a mail list called the \"Unicore\" list, which carries traffic related to meetings, technical content of the standard, and so forth. Members of the list are UTC representatives; employees and staff of member organizations (such as the Research Libraries Group); individual liaisons to and from other standards bodies (such as WG2 and IETF); and invited experts from institutions such as the Library of Congress and some universities. Subscription to the list for external individuals is subject to \"sponsorship\" by the corporate officers.",
      "ja": "内部的には、UTCは「Unicore」リストと呼ばれるメールリストを維持しています。これは、会議、標準の技術コンテンツなどに関連するトラフィックを運びます。リストのメンバーはUTCの代表者です。メンバー組織の従業員とスタッフ（研究図書館グループなど）;他の標準団体（WG2やIETFなど）との間での個々の連絡。議会図書館やいくつかの大学などの機関の専門家を招待しました。外部の個人のリストのサブスクリプションは、企業役員による「スポンサーシップ」の対象となります。"
    },
    {
      "indent": 3,
      "text": "Unicode, Inc. also maintains a public discussion list called the \"Unicode\" list. Subscription is open to anyone, and proceedings of the \"Unicode\" mail list are publicly archived. Details are on the Consortium web site under the \"Mail Lists\" heading.",
      "ja": "Unicode、Inc。は、「Unicode」リストと呼ばれる公開討論リストも維持しています。サブスクリプションは誰にでも公開されており、「Unicode」メールリストの議事録は公開されています。詳細は、「メールリスト」の見出しの下にあるコンソーシアムのWebサイトにあります。"
    },
    {
      "indent": 3,
      "text": "Technical proposals for changes to the standard are posted to both of these mail lists on a regular basis. Discussion on the public list may result in a written proposal being generated for a later UTC meeting. Technical issues and other standardization \"events\" of any significance, such as beta releases and availability of draft documents, are announced and then discussed in this public forum, well before standardization is finalized. From time to time, the UTC also publishes on the Consortium web site \"Public Review Issues\" to gather feedback and generate discussion of specific proposals whose impact may be unclear, or for which sufficiently broad review may not yet have been brought to the UTC deliberations.",
      "ja": "標準の変更に関する技術的提案は、これらの両方のメールリストに定期的に投稿されています。公開リストに関する議論は、後のUTC会議のために書かれた提案が生成される可能性があります。標準化が完了する前に、ベータリリースやドラフトドキュメントの可用性など、ベータリリースやドラフトドキュメントの可用性など、あらゆる重要性の「イベント」が発表され、議論されます。UTCは時々、コンソーシアムのWebサイト「パブリックレビューの問題」で公開し、フィードバックを収集し、影響が不明な可能性のある特定の提案の議論を生み出します。。"
    },
    {
      "indent": 3,
      "text": "Anyone may make a character encoding or architectural proposal to UTC. Membership in the organization is not required to submit a proposal. To be taken seriously, the proposal must be framed in a substantial way, and be accompanied by sufficient documentation to warrant discussion. Examples of proposals are easily available by following links from the \"Proposed Characters\" and \"Roadmaps\" headings on the Unicode web site. Guidelines for proposals are also available under the heading \"Submitting Proposals\".",
      "ja": "誰でも、UTCにエンコードまたはアーキテクチャの提案をするキャラクターを作成できます。組織のメンバーシップは、提案を提出する必要はありません。真剣に考えるためには、提案は実質的な方法で組み立てられ、議論を正当化するための十分な文書を添付する必要があります。提案の例は、Unicode Webサイトの「提案された文字」および「ロードマップ」の見出しからのリンクをフォローすることで簡単に入手できます。提案のガイドラインは、「提案の提出」という見出しの下でも利用できます。"
    },
    {
      "indent": 3,
      "text": "In general, proposals are publicly aired on the \"Unicode\" mail list, sometimes for a long period, prior to formal submission. Generally this is of benefit to the proposer as it tends to reduce the number of times the proposal is sent back for clarification or with requests for additional information. Once a proposal reaches the stage of being ready for discussion by UTC, the proposer will have received contact through the public mail list with one or more UTC members willing to explain or defend it in a UTC meeting.",
      "ja": "一般に、提案は「Unicode」メールリストで公開されています。一般的に、これは提案者にとって有益です。これは、説明のために提案が返送されるか、追加情報のリクエストを使用して送り返される回数を減らす傾向があるためです。提案がUTCによる議論の準備ができている段階に達すると、提案者は、UTC会議でそれを説明または擁護する1人以上のUTCメンバーとの公開メールリストを通じて連絡を受けました。"
    },
    {
      "indent": 0,
      "text": "10. Acknowledgements",
      "section_title": true,
      "ja": "10. 謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Mark Davis, Simon Josefsson, and Ken Whistler for their extensive review and feedback on previous versions of this document.",
      "ja": "マーク・デイビス、サイモン・ジョセフソン、ケン・ウィスラーに、このドキュメントの以前のバージョンに関する広範なレビューとフィードバックに感謝します。"
    },
    {
      "indent": 0,
      "text": "11. Security Considerations",
      "section_title": true,
      "ja": "11. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This memo describes the operational procedures of an organization; the procedures themselves have no consequences for Internet Security.",
      "ja": "このメモは、組織の運用手順について説明しています。手順自体は、インターネットセキュリティに影響を与えません。"
    },
    {
      "indent": 0,
      "text": "12. Author's Address",
      "section_title": true,
      "ja": "12. 著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Rick McGowan c/o The Unicode Consortium P.O. Box 391476 Mountain View, CA 94039-1476 U.S.A.",
      "ja": "Rick McGowan C/O Unicode Consortium P.O.Box 391476 Mountain View、CA 94039-1476 U.S.A."
    },
    {
      "indent": 3,
      "text": "Phone:   +1-650-693-3921\nWeb: http://www.unicode.org/",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "13. Full Copyright Statement",
      "section_title": true,
      "ja": "13. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78 and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（c）The Internet Society（2004）。この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となりますが、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、この文書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスがどの程度であるかについての使用に関連すると主張する可能性があるという立場はありません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要なテクノロジーをカバーする可能性のあるその他の独自の権利を注意深く招待します。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}