{
  "title": {
    "text": "RFC 3049 - TN3270E Service Location and Session Balancing",
    "ja": "RFC 3049 - TN3270Eサービスロケーションとセッションバランシング"
  },
  "number": 3049,
  "created_at": "2019-10-22 04:55:59.022951+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          J. Naugle\nRequest for Comments: 3049                             K. Kasthurirangan\nCategory: Standards Track                                            IBM\n                                                              G. Ledford\n                                                      Zephyr Development\n                                                            January 2001",
      "raw": true
    },
    {
      "indent": 13,
      "text": "TN3270E Service Location and Session Balancing",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document discusses the implementation of Service Location Protocol (SLP) and session balancing with a TN3270E emulator in a client server implementation with a TN3270E server.",
      "ja": "この文書では、TN3270Eサーバーとクライアントサーバー実装でのTN3270Eエミュレータとのバランスサービスロケーションプロトコル（SLP）とセッションの実装について説明します。"
    },
    {
      "indent": 3,
      "text": "Application program developer's can locate TN3270E services and load balance among those services (3270 host sessions), by using this SLP support.",
      "ja": "アプリケーションプログラムの開発者は、このSLPサポートを使用することにより、これらのサービス（3270回のホスト・セッション）の間でTN3270Eサービスと負荷バランスを見つけることができます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction and Terminology .................................  2\n   1.1 Terminology ..............................................  2\n2. An Overview of RFC 2165 ......................................  3\n   2.1 SLP Agents ...............................................  3\n   2.2 Service Agents ...........................................  3\n   2.3 User Agents ..............................................  4\n3. TN3270E Server Environment and Load ..........................  4\n   3.1 TnN3270E Server Load .....................................  4\n4. TN3270E Client Configuration .................................  6\n   4.1 SLP Scope ................................................  6\n   4.2 DA-Discovery Time-Out ....................................  6\n   4.3 SA-Discovery Time-Out ....................................  7\n5. TN3270E Client Implementation Information ....................  7\n   5.1 Overview .................................................  7",
      "raw": true
    },
    {
      "indent": 3,
      "text": "   5.2 How to Obtain List of TN3270E Servers Supporting SLP .....  8\n   5.3 TN3270E Sample Client Flow ...............................  9\n      5.3.1 Open the SLP connection .............................  9\n      5.3.2 Query the list of TN3270E servers ...................  9\n      5.3.3 Forward Looking Example using SLPv2 ................. 10\n      5.3.4 Determine loading of each TN3270E server ............ 10\n   5.4 Recommendations .......................................... 11\n6. Sample Trace Flow of SLP and Session Balancing ............... 11\n7. Service Templates and Service Registration ................... 12\n   7.1 The TN3270E Service Type Template ........................ 12\n   7.2 The Server Service Template .............................. 16\n   7.3 Template Contact Information ............................. 17\n   7.4 Security Considerations .................................. 17\n   7.5 Sample TN3270 Service Registration Message ............... 18\n   7.6 Sample Server Service Registration Message ............... 19\n8. References ................................................... 19\n9. Authors' Addresses ........................................... 20\n10. Full Copyright Statement .................................... 21",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction and Terminology",
      "section_title": true,
      "ja": "1.はじめと用語"
    },
    {
      "indent": 3,
      "text": "This document will provide information on Service Location Protocol implementation to discover TN3270E servers in a network and session balance among those servers. This implementation follows the standards track RFC 2165, Service Location Protocol [1] but also provides some examples when using Service Location Protocol version 2 to be forward looking. Service Location Protocol version 2 is documented in RFC 2608 [4] and RFC 2609 [2].",
      "ja": "この文書では、これらのサーバー間のネットワークとのセッションのバランスにTN3270Eサーバーを検出するサービスロケーションプロトコルの実装に関する情報を提供します。この実装は、標準がRFC 2165を追跡し、次のサービスロケーションプロトコル[1]が、また楽しみにしていなければサービスロケーションプロトコルバージョン2を使用する際にいくつかの例を提供します。サービス・ロケーション・プロトコルバージョン2は、RFC 2608に記載されている[4]、RFC 2609 [2]。"
    },
    {
      "indent": 0,
      "text": "1.1 Terminology",
      "section_title": true,
      "ja": "1.1用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [1].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますRFC 2119に記載されるように解釈される[1]。"
    },
    {
      "indent": 3,
      "text": "Session Balance - This refers to the ability of TN3270E client to use server load information to establish a TN3270E connection to the TN3270E server with the least load at that time. The purpose is to distribute the connection of TN3270E sessions among more than one TN3270E server, and one server will not be excessively loaded. The term \"load balance\" is a more general term, with respect to server load, and in this document we are focusing on the TN3270E session connections to least loaded servers.",
      "ja": "セッションのバランス - これは、その時、少なくとも負荷のTN3270EサーバーへのTN3270E接続を確立するために、サーバの負荷情報を使用するTN3270Eクライアントの能力を指します。目的は、複数のTN3270Eサーバー間のTN3270Eセッションの接続を配布することで、1台のサーバが過度にロードされません。用語「ロード・バランスは、」サーバーの負荷に関して、より一般的な用語であり、この文書では、我々は最も負荷のサーバにTN3270Eセッション接続に焦点を当てています。"
    },
    {
      "indent": 3,
      "text": "SNA Gateway - A Systems Network Architecture (SNA) gateway allows multiple LAN-attached workstations to access SNA hosts through one or more physical connections to one or more hosts. A SNA gateway acts as a protocol converter between workstations attached to a LAN and a",
      "ja": "SNAゲートウェイ - システムネットワークアーキテクチャ（SNA）ゲートウェイは、SNAは、1つまたは複数のホストに1つ以上の物理的接続を介してホストにアクセスするために複数のLAN接続ワークステーションを可能にします。 SNAゲートウェイは、LANに取り付けられたワークステーション間のプロトコル変換器として作用します"
    },
    {
      "indent": 3,
      "text": "WAN host line. It typically would support the SNA protocols LU 0, 1, 2, 3, and dependent LU 6.2 (APPC). SNA gateways typically include a TN3270E server capability.",
      "ja": "WANホストライン。それは、典型的には、SNAプロトコルLU 0、1、2、3、および従属LU 6.2（APPC）をサポートします。 SNAゲートウェイは通常、TN3270Eサーバーの機能が含まれています。"
    },
    {
      "indent": 3,
      "text": "LU Pool - The Logical Units (LUs) defined in the gateway can be dedicated to a particular workstation or pooled among multiple workstations. Pooling allows workstations to share common Logical Units (LUs), which increases the efficiency of the LUs and reduces the configuration and startup requirements at the host. When a client connects to the gateway, the gateway retrieves an LU from the pool to establish a session. The LU is returned to the pool for access by other workstations when the session is ended.",
      "ja": "LUプール - ゲートウェイで定義された論理ユニット（LU）は、特定のワークステーションに専用の又は複数のワークステーション間でプールすることができます。プーリングは、LUの効率が向上し、ホストに構成および起動要件を低減する、ワークステーションは、共通論理ユニット（LU）を共有することを可能にします。クライアントがゲートウェイに接続すると、ゲートウェイは、セッションを確立するためにプールからLUを検索します。セッションが終了したときLUは、他のワークステーションによるアクセスのためにプールに戻されます。"
    },
    {
      "indent": 3,
      "text": "Commserver Service Type Template - Commserver service type is defined as an SNA Gateway server as previously defined above in this terminology section. A template describing the attributes for this service type is in section 7.2.",
      "ja": "COMポートサービスタイプのテンプレート - 以前にこの用語セクションに上で定義したCOMポートのサービスタイプは、SNAゲートウェイサーバーとして定義されます。このサービスタイプの属性を記述したテンプレートは、セクション7.2です。"
    },
    {
      "indent": 1,
      "text": "2. An overview of",
      "section_title": true,
      "ja": "2.の概要"
    },
    {
      "indent": 3,
      "text": "RFC 2165, Service Location Protocol (SLP) [1], provides an automatic way for clients to discover services within an administrative domain.",
      "ja": "RFC 2165は、サービスロケーションプロトコル（SLP）は、[1]、クライアントは、管理ドメイン内のサービスを発見するための自動的な方法を提供します。"
    },
    {
      "indent": 3,
      "text": "These services have various attributes associated with them from which a client can base a service selection. The basic design involves the use of three agent types. These are: User Agents (UA's), Service Agents (SA's) and Directory Agents (DA's).",
      "ja": "これらのサービスは、クライアントがサービスの選択をベースとすることができ、そこからそれらに関連する様々な属性を持っています。基本設計は3つのエージェントタイプの使用を含みます。これらは：ユーザエージェント（UAさん）、サービスエージェント（SAさん）とディレクトリエージェント（DAさん）。"
    },
    {
      "indent": 0,
      "text": "2.1 SLP Agents",
      "section_title": true,
      "ja": "2.1 SLPエージェント"
    },
    {
      "indent": 3,
      "text": "User Agents are used to query Service Agents or Directory Agents. They acquire/request service information based upon the desired attributes and service needed for the user application.",
      "ja": "ユーザエージェントは、サービスエージェントやディレクトリエージェントを照会するために使用されています。これらはユーザ・アプリケーションに必要な所望の属性およびサービスに基づいて/要求サービス情報を取得します。"
    },
    {
      "indent": 3,
      "text": "Service Agents represent a specific service and advertise service information.",
      "ja": "サービスエージェントは、特定のサービスを表し、サービス情報を広告します。"
    },
    {
      "indent": 3,
      "text": "Directory Agents act as a central collection point for service registration information by Service Agents which is later requested by \"user agents\" in \"intranets\".",
      "ja": "ディレクトリエージェントは、後に「イントラネット」の「ユーザーエージェント」によって要求されたサービスエージェントによるサービス登録情報の中央収集ポイントとして機能します。"
    },
    {
      "indent": 0,
      "text": "2.2 Service Agents",
      "section_title": true,
      "ja": "2.2サービスエージェント"
    },
    {
      "indent": 3,
      "text": "The service registers itself with the service agent so that the SA can start advertising this information over the network. The process of registration consists of the service giving the SA all relevant configuration information and attribute tag/value list pairs specific to this service. The Service template is an abstract schema that applies to the service type. The service template for TN3270E is shown later, contains the URL which is the address of the server with the port, which should be used to connect to it. The URL also contains the service type which in this case is TN3270. The template also contains all the other attributes associated with this service.",
      "ja": "SAは、ネットワーク上でこの情報を広告し始めることができるようにサービスは、サービス・エージェントに自身を登録します。登録のプロセスは、SAにこのサービスに固有のすべての関連する構成情報および属性タグ/値リストのペアを重視したサービスで構成されています。サービステンプレートは、サービスの種類に適用される抽象スキーマです。 TN3270Eのためのサービステンプレートを後で示され、それに接続するために使用するポートを備えたサーバのアドレスであるURLが含まれています。 URLは、この場合にもTN3270あるサービスタイプが含まれています。テンプレートは、このサービスに関連付けられている他のすべての属性が含まれています。"
    },
    {
      "indent": 0,
      "text": "2.3 User Agents",
      "section_title": true,
      "ja": "2.3ユーザーエージェント"
    },
    {
      "indent": 3,
      "text": "The User Agent working on the TN3270E client's behalf retrieves service information from the Service Agent(s) or a Directory Agent. Based on the gathered information and required attributes the TN3270E client or user can decide whether or not to connect with a particular server. Based on the service advertisements from various TN3270E servers, the client looks at the load attribute and can decide to connect to the least loaded server. If by the time it connects to that particular TN3270E server, the server becomes unavailable it can try connecting to the next server in its list (ie: the second least loaded server whose advertisement was retrieved by the client/user agent).",
      "ja": "TN3270Eクライアントのために働くユーザエージェントは、サービスエージェント（複数可）またはディレクトリエージェントからのサービス情報を取得します。収集した情報に基づいて、必要なTN3270Eクライアントまたはユーザーが特定のサーバに接続するかどうかを決定することができます属性。様々なTN3270Eサーバーからサービス通知に基づいて、クライアントは負荷の属性を見て、最も負荷のサーバに接続することを決定することができます。それはその特定のTN3270Eサーバーに接続する時間によって、サーバが利用できなくなった場合、それはそのリスト内の次のサーバに接続してみてくださいすることができます（例：その広告クライアント/ユーザエージェントによって取得されたロードされた少なくとも1つの第2サーバー）。"
    },
    {
      "indent": 0,
      "text": "3. TN3270E Server Environment and Load",
      "section_title": true,
      "ja": "3. TN3270Eサーバー環境とロード"
    },
    {
      "indent": 3,
      "text": "TN3270E Servers are pervasive in today's networked environment. SLP provides emulator clients with a way to discover TN3270E servers in the network and session balance among the servers. The TN3270E servers could be distributed across different SNA gateways with different connection methods to hosts. The use of LU pools provides an easy way for administrators to provide users access to hosts. Administrators can add users to LU pools that have pre-configured LU's with specific attributes, like LU types and model types.",
      "ja": "TN3270Eサーバーは、今日のネットワーク環境の中で普及しています。 SLPは、サーバー間のネットワークとのセッションのバランスにTN3270Eサーバーを検出する方法でエミュレーター・クライアントを提供します。 TN3270Eサーバーは、ホストへの異なる接続方法と異なるSNAゲートウェイに分散することができます。 LUプールの使用は、管理者がホストへのユーザーアクセスを提供するための簡単な方法を提供します。管理者は、LUタイプとモデルタイプと同様に、特定の属性を持つLUのを事前に設定したLUプールにユーザーを追加することができます。"
    },
    {
      "indent": 3,
      "text": "These LU pools would typically have LUs from several different gateways assigned, and as members of the LU pool make TN3270E session connections, they would be making connections to different TN3270E servers, with different load factors, so that session balancing could be accomplished. The use of LU pools is not a requirement for SLP and session balancing. A TN3270E client could obtain a session by using SLP and session balancing to locate the least loaded server in the network. On a service request a wild card \"*\" could be used when asking for LUPOOL if the emulator doesn't care which device types are supported in given pools or if it can assume given pools support only certain device types.",
      "ja": "そのセッションのバランスを達成することができるので、これらのLUプールは、一般的に割り当てられたいくつかの異なるゲートウェイからのLUを持っているでしょうし、LUプールのメンバーがTN3270Eセッション接続を行うように、彼らは異なる負荷因子と、異なるTN3270Eサーバーへの接続を行うことになります。 LUプールの使用は、SLPとのセッションバランシングの要件ではありません。 TN3270Eクライアントは、ネットワーク内の最も負荷のサーバを見つけるためにSLPとのセッションバランシングを使用して、セッションを得ることができました。サービス要求ワイルドカード「*」でLUPOOLを求めたときにエミュレータが与えられたプールでサポートされているデバイスの種類を気にしない場合、使用されるか、またはそれが想定できる場合は、指定のプールは、特定のデバイスタイプをサポートすることができます。"
    },
    {
      "indent": 0,
      "text": "3.1 TN3270E Server Load",
      "section_title": true,
      "ja": "3.1 TN3270Eサーバーの負荷"
    },
    {
      "indent": 3,
      "text": "TN3270E servers providing load information, SHOULD include number of sessions available, not in current use, as part of the calculation in determining the total load for the server. There can be other factors that might have an effect on server load. An example would be if a server is not dedicated to only SNA traffic, and is handling other processes, like file services and print services, etc. It is beyond the scope of this document to standardize the method of individual server load calculations. Different vendors server's may calculate load information based upon factors they consider important, and methods for calculating load may change over time.",
      "ja": "負荷情報を提供するTN3270Eサーバーは、サーバーの総負荷を決定する際の計算の一部としてではなく、現在使用中、利用可能なセッションの数を含むべきです。サーバーの負荷に影響を与える可能性のある他の要因が存在する場合があります。サーバーは、ファイルサービスと印刷サービス、などこれは、個々のサーバ負荷計算の方法を標準化するために、このドキュメントの範囲を超えているように、唯一のSNAトラフィック専用ではなく、他のプロセスを処理している場合の例は次のようになります。異なるベンダーのサーバーの彼らは重要な考慮要因に基づいて負荷情報を算出してもよいし、負荷を計算するための方法は、時間の経過とともに変化することがあります。"
    },
    {
      "indent": 3,
      "text": "If the TN3270E server coexists in a network with other TN server implementations using SLP for session balancing, TN3270E server load could be adjusted to compensate for differences in load calculations.",
      "ja": "TN3270Eサーバーは、セッションバランスのためにSLPを使用して他のTNサーバーの実装とネットワークで共存している場合、TN3270Eサーバーの負荷が負荷計算の差を補償するように調節することができます。"
    },
    {
      "indent": 3,
      "text": "One way to allow TN3270E server administrators to compensate for differences in implementations of calculating server load measurement is to provide the ability to modify the load calculation on the TN3270E server. An element of control can be provided by allowing the administrator to modify the load measurement, by using an integral number between 0 and 100 (100 being the highest) to change the load. This load measurement acts as an additional factor on the server's actual load calculation, so that the administrator could bias up or down, the likelihood of that server being selected by a TN3270E client.",
      "ja": "TN3270Eサーバー管理者がサーバーの負荷測定の計算の実装の差を補償することを可能にする一つの方法は、TN3270Eサーバーに負荷計算を変更する機能を提供することです。コントロールの要素は、負荷を変更するために0と100の間の整数（100が最高である）を使用することにより、管理者は、負荷測定を修正することを可能にすることによって提供することができます。管理者は、バイアスを上下に、そのサーバーの可能性がTN3270Eクライアントによって選択されることができるように、この負荷測定は、サーバの実際の負荷計算上の追加の因子として作用します。"
    },
    {
      "indent": 3,
      "text": "Load MUST be defined as one of the attributes for the TN3270E server. The Load attribute provided at the server will allow clients to determine which server to make a connection. If a UA provides only a Service Type, in an Attribute Request, then the reply includes all attributes and all values for that Service Type, and Load would be included. Attribute Requests MAY include a select clause, so you could be returned just load information. For more information on Attribute Requests refer to Service Location Protocol [1].",
      "ja": "負荷は、TN3270Eサーバーの属性の一つとして定義されなければなりません。サーバーに設けた負荷属性は、クライアントが接続するためにサーバーを決定できるようになります。 UAは、属性要求で、唯一のサービスタイプを提供した場合、応答はすべての属性とそのサービスタイプのすべての値を含み、かつ負荷が含まれることになります。あなただけの情報をロード返すことができたので、属性リクエストは、select句を含むかもしれません。属性リクエストの詳細についてはサービスロケーションプロトコル[1]を参照してください。"
    },
    {
      "indent": 3,
      "text": "An application could issue a Service Request to locate a TN3270E server. Then an application designed to perform least-load location of a TN3270E service, could issue a series of Attribute Requests to obtain the load measurement of each server specified with a URL. It would specify a select clause similar to the one below to receive only load information.",
      "ja": "アプリケーションは、TN3270Eサーバーを検索するサービスリクエストを発行することができます。そして、TN3270Eサービスの最小負荷の場所を実行するように設計されたアプリケーションは、URLで指定された各サーバーの負荷測定を得るために、属性リクエストのシリーズを発行することができます。それだけで負荷情報を受信するために以下のようなselect句を指定します。"
    },
    {
      "indent": 3,
      "text": "URL = service:tn3270://9.37.51.254:23 Attribute filter = LOAD",
      "ja": "URL =サービス：TN3270：//9.37.51.254：23属性フィルタ= LOAD"
    },
    {
      "indent": 3,
      "text": "The attribute LOAD would be returned along with its value. The application could then issue other Attribute Request calls for each URL.",
      "ja": "属性LOADは、その値と一緒に返されます。アプリケーションは、各URLのために他の属性要求コールを発行することができます。"
    },
    {
      "indent": 3,
      "text": "The application would then select the least loaded server as a connection target. If it tries to connect to a server and that connection fails, it could then try to connect to the next least-loaded server.",
      "ja": "次に、アプリケーションは、接続先として最も負荷の少ないサーバーを選択することになります。それは、サーバーに接続しようとすると、その接続が失敗した場合、それは、次の最も負荷のサーバーへの接続を試みることができます。"
    },
    {
      "indent": 0,
      "text": "4. TN3270E Client Configuration",
      "section_title": true,
      "ja": "4. TN3270Eクライアントの構成"
    },
    {
      "indent": 0,
      "text": "4.1 SLP Scope",
      "section_title": true,
      "ja": "4.1 SLPスコープ"
    },
    {
      "indent": 3,
      "text": "Scope is a parameter used to control and manage access by clients to servers in a network. It is the same as the Service Location Protocol scope defined in RFC 2165 [1]. The control scope provides is necessary for two reasons:",
      "ja": "スコープは、ネットワーク内のサーバーへのクライアントによるアクセスを制御し、管理するために使用されるパラメータです。これは、RFC 2165で定義されたサービスロケーションプロトコルスコープと同じである[1]。制御範囲は、2つの理由のために必要であり、提供します。"
    },
    {
      "indent": 3,
      "text": "As your network, the number of clients, and the number of servers grow, it becomes necessary to partition access to those servers by the growing number of clients in order to reduce overall traffic on the network. It allows administrators to organize users and servers into administrative groups.",
      "ja": "お使いのネット​​ワークとして、クライアントの数、およびサーバーの数は増え、それがネットワーク上のトラフィック全体を軽減するために、クライアント数の増加により、これらのサーバーへのアクセスを分割することが必要になります。これは、管理者が管理グループにユーザーとサーバーを整理することができます。"
    },
    {
      "indent": 3,
      "text": "The meaning of the values of scope is defined by the administrator of the network. These values can represent any entity. Commonly, they fall along either departmental, geographical, or organizational lines.",
      "ja": "スコープの値の意味は、ネットワークの管理者によって定義されます。これらの値は、任意のエンティティを表すことができます。一般的に、彼らは、部門、地理的、または組織のいずれかのラインに沿って落ちます。"
    },
    {
      "indent": 3,
      "text": "Each TN3270E server can be assigned to a single scope or multiple scopes. TN3270E clients using these servers can be configured for a single specific scope. If TN3270E clients are not configured with a scope they MUST use the scope \"default\".",
      "ja": "各TN3270Eサーバーは、単一のスコープまたは複数のスコープに割り当てることができます。これらのサーバーを使用してTN3270Eクライアントは、単一の特定の範囲に設定することができます。 TN3270Eクライアントがスコープで構成されていない場合、彼らは、「デフォルト」スコープを使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "SLP Service Agents and Directory Agents (DA) need to reside in the network that support the TN3270E server with configured scopes.",
      "ja": "SLPサービスエージェントやディレクトリエージェント（DA）が設定されたスコープでTN3270Eサーバーをサポートするネットワーク内に存在する必要があります。"
    },
    {
      "indent": 3,
      "text": "Attribute information for Service Types pertaining to a specific scope can be obtained from Directory Agents (DA). The DA will not return a result unless the requested scope matches.",
      "ja": "特定の範囲に属するサービスタイプのための情報を属性には、ディレクトリエージェント（DA）から入手することができます。要求された範囲が一致しない限りDAは結果を返しません。"
    },
    {
      "indent": 3,
      "text": "For more information on SLP scope refer to Service Location Protocol [1].",
      "ja": "SLPスコープの詳細についてはサービスロケーションプロトコル[1]を参照してください。"
    },
    {
      "indent": 0,
      "text": "4.2 DA Discovery time-out",
      "section_title": true,
      "ja": "4.2 DAディスカバリーのタイムアウト"
    },
    {
      "indent": 3,
      "text": "The DA Discovery time-out value, is used to control how long the SLP API must wait to discover Directory Agents (DAs) in the network. The discovery request is a multicast, and the amount of time required to gather all DA responses might vary depending on many factors. If there are no DAs in the network, this time-out value can be set to zero to indicate that no DA discovery is to be done. The time-out is expressed in milliseconds. Time-out intervals and default values should be handled as described in RFC 2165 [1].",
      "ja": "DAディスカバリーのタイムアウト値は、SLP APIは、ネットワーク内のディレクトリエージェント（DAS）を発見するのを待つ必要がありますどのくらいの時間を制御するために使用されます。発見要求は、マルチキャストであり、すべてのDAの応答を収集するために必要な時間の量は多くの要因によって異なります。ネットワークには、DASが存在しない場合は、このタイムアウト値は全くDA検出が行われるべきでないことを示すためにゼロに設定することができます。タイムアウトをミリ秒単位で表されます。 RFC 2165に記載されているように、タイムアウト間隔およびデフォルト値は、処理されるべきである[1]。"
    },
    {
      "indent": 0,
      "text": "4.3 SA Multicast time-out",
      "section_title": true,
      "ja": "4.3 SAマルチキャストのタイムアウト"
    },
    {
      "indent": 3,
      "text": "The SA Multicast time-out value, is used to control how long the SLP API must wait to discover services, attributes, or service types in a network without at least one DA that supports the scope of the request. In this situation, these requests are multicast and the User Agent waits the time-out value to gather the multiple responses that are returned. The time-out is expressed in milliseconds. Time-out intervals and default values should be handled as described in RFC 2165 [1].",
      "ja": "SAマルチキャストのタイムアウト値は、SLPのAPIが要求の範囲をサポートしている少なくとも一つのDAせずに、ネットワーク内のサービス、属性、またはサービスタイプを発見するのを待つ必要がありますどのくらいの時間を制御するために使用されます。このような状況では、これらの要求は、マルチキャストであり、ユーザーエージェントは、返される複数の応答を収集するために、タイムアウト値を待ちます。タイムアウトをミリ秒単位で表されます。 RFC 2165に記載されているように、タイムアウト間隔およびデフォルト値は、処理されるべきである[1]。"
    },
    {
      "indent": 0,
      "text": "5. TN3270E Client Implementation Information",
      "section_title": true,
      "ja": "5. TN3270Eクライアントの実装情報"
    },
    {
      "indent": 0,
      "text": "5.1 Overview",
      "section_title": true,
      "ja": "5.1概要"
    },
    {
      "indent": 3,
      "text": "A TN3270E client that implements TN3270E SLP session balancing does not need to configure an IP Host Address or TCP Port for the TN3270E server it desires to connect to. Instead, the IP Host Address and TCP Port of the least loaded TN3270E server is discovered by using the SLP session balancing described in this document.",
      "ja": "TN3270E SLPセッションバランシングを実装TN3270Eクライアントは、それがに接続することを望むTN3270EサーバーのIPホストアドレスやTCPポートを設定する必要はありません。代わりに、最も負荷のTN3270EサーバーのIPホストアドレスとTCPポートは、この文書で説明SLPセッションバランシングを使用することによって発見されました。"
    },
    {
      "indent": 3,
      "text": "The discovery of the least loaded TN3270E server is done entirely outside of and before the TN3270E telnet negotiation. Once the IP Host address and TCP Port of the least loaded TN3270E server is discovered, the TN3270E client can then start normal TN3270E telnet negotiation.",
      "ja": "最も負荷のTN3270Eサーバの発見は、外とのTN3270Eのtelnet交渉の前に完全に行われます。最も負荷のTN3270EサーバーのIPホストアドレスとTCPポートが発見されると、TN3270Eクライアントは、通常のTN3270Eのtelnet交渉を開始することができます。"
    },
    {
      "indent": 3,
      "text": "The TN3270E client MUST allow for configuration of the following parameters. These SLP specific configuration items are covered by configuration parameters in the SLP API [5].",
      "ja": "TN3270Eクライアントは、次のパラメータの設定を考慮しなければなりません。これらSLP特定の設定項目[5] SLP APIの構成パラメータによって覆われています。"
    },
    {
      "indent": 3,
      "text": "Enable SLP Session Balancing",
      "ja": "SLPセッションの分散を有効にします"
    },
    {
      "indent": 3,
      "text": "This configuration parameter indicates whether or not SLP session balancing is enabled. If it is enabled the following three configuration parameters MUST also be configurable. If this parameter is disabled, SLP session balancing is not supported and normal TN3270E telnet negotiation is performed.",
      "ja": "この設定パラメータは、SLPセッションバランシングが有効になっているか否かを示しています。それが有効になっている場合は、次の3つの設定パラメータも構成可能でなければなりません。このパラメータが無効になっている場合は、SLPセッションバランシングはサポートされておらず、通常のTN3270E telnetのネゴシエーションが行われます。"
    },
    {
      "indent": 3,
      "text": "Scope Name The scope name is a text string that specifies a group of TN3270E servers. The scope name can be used to identify groups of TN3270E servers in a departmental or geographic setting. For example, if the scope name is Building-D, then the SLP session balancing would search all TN3270E servers in the Building-D scope to find the least loaded TN3270E server.",
      "ja": "スコープ名スコープ名はTN3270Eサーバのグループを指定するテキスト文字列です。スコープ名は、部門や地理的な設定でTN3270Eサーバーのグループを識別するために使用することができます。スコープ名はビル-Dである場合たとえば、その後、SLPセッションバランシングは、最も負荷のTN3270Eサーバーを見つけるために、ビル-Dの範囲内のすべてのTN3270Eサーバを検索します。"
    },
    {
      "indent": 3,
      "text": "If the scope name is blank, then the scope name is not used. This is referred to as unscoped. It should be noted as in section 4.1 above that any reference to unscoped services applies to Service Location Protocol version 1 only [1]. Service Location Protocol version 2 doesn't allow unscoped services but does allow the use of default scope [4]. In this case all TN3270E servers, with or without scope names, can be used to satisfy the request for least loaded TN3270E servers. In order to cut down on network overhead, it is recommended that either all servers be scoped or no servers be scoped. Refer back to section 4.1 for more discussion of scope.",
      "ja": "スコープ名が空白の場合、スコープ名が使用されていません。これは、スコープ外と呼ばれています。スコープ外のサービスへの参照のみサービスロケーションプロトコルバージョン1 [1]に適用される上記セクション4.1のようにそれが注目されるべきです。サービスロケーションプロトコルバージョン2は、スコープ外のサービスを許可していませんが、デフォルトのスコープの使用を許可しない[4]。この場合、すべてのTN3270Eサーバー、スコープ名の有無にかかわらず、最も負荷のTN3270Eサーバー用の要求を満たすために使用することができます。ネットワークのオーバーヘッドを削減するためには、どちらかのすべてのサーバーがスコープするか、どのサーバーがスコープのないことをお勧めします。スコープのより多くの議論のために戻っセクション4.1を参照してください。"
    },
    {
      "indent": 3,
      "text": "DA Discovery Time Out Value",
      "ja": "DA検出タイムアウト値"
    },
    {
      "indent": 3,
      "text": "This value is specified in milliseconds and is fully described in section 4.2 of this document.",
      "ja": "この値はミリ秒単位で指定され、完全にこの文書のセクション4.2に記載されています。"
    },
    {
      "indent": 3,
      "text": "SA Multicast Time Out Value",
      "ja": "SAマルチキャストのタイムアウト値"
    },
    {
      "indent": 3,
      "text": "This value is specified in milliseconds and is fully described in section 4.3 of this document.",
      "ja": "この値はミリ秒単位で指定され、完全にこの文書のセクション4.3に記載されています。"
    },
    {
      "indent": 0,
      "text": "5.2 How to obtain the list of TN3270E servers supporting SLP",
      "section_title": true,
      "ja": "5.2 SLPをサポートしているTN3270Eサーバーのリストを入手する方法"
    },
    {
      "indent": 3,
      "text": "A TN3270E client that implements SLP session balancing uses API calls to obtain the list of TN3270E servers supporting SLP session balancing.",
      "ja": "SLPセッション分散はAPIを使用して実装しTN3270Eクライアントは、SLPセッションバランシングをサポートするTN3270Eサーバのリストを取得するために呼び出します。"
    },
    {
      "indent": 3,
      "text": "The following Service Location Version 2 API [5] calls, could be used with TN3270E SLP session balancing:",
      "ja": "以下のサービス・ロケーション・バージョン2 API [5]コール、TN3270E SLPセッションバランスで使用することができます。"
    },
    {
      "indent": 3,
      "text": "SLPOpen - returns an SLPHandle handle to be used",
      "ja": "SLPOpen  - 使用するSLPHandleハンドルを返します。"
    },
    {
      "indent": 3,
      "text": "SLPFindSrvs - issues the query for services",
      "ja": "SLPFindSrvsは - サービスに対するクエリを発行します"
    },
    {
      "indent": 3,
      "text": "SLPFindAttrs - returns service attributes matching the attribute ids for the indicated service URL or service type.",
      "ja": "SLPFindAttrs  - リターンサービスは、指示されたサービスのURLまたはサービスタイプの属性IDを一致する属性。"
    },
    {
      "indent": 3,
      "text": "SLPClose - frees all resources associated with the handle.",
      "ja": "SLPClose  - ハンドルに関連付けられたすべてのリソースを解放します。"
    },
    {
      "indent": 0,
      "text": "5.3 TN3270E Sample Client Flow",
      "section_title": true,
      "ja": "5.3 TN3270Eサンプルクライアントの流れ"
    },
    {
      "indent": 0,
      "text": "5.3.1 Open the SLP connection",
      "section_title": true,
      "ja": "5.3.1オープンSLP接続"
    },
    {
      "indent": 3,
      "text": "The TN3270E client must first open a handle with the SLP User Agent. For Service Location Protocol version 2, SLPOpen API call [5] The SA multicast time out and DA discovery time out values would be passed as parameters to the SLPOpen API call.",
      "ja": "TN3270Eクライアントは、最初のSLPユーザエージェントでハンドルを開く必要があります。サービスロケーションプロトコルバージョン2の場合は、SLPOpen APIコール[5] SAマルチキャストタイムアウトとDA発見時間外の値がSLPOpen API呼び出しにパラメータとして渡されます。"
    },
    {
      "indent": 0,
      "text": "5.3.2 Query the list of TN3270E servers",
      "section_title": true,
      "ja": "5.3.2クエリTN3270Eサーバのリスト"
    },
    {
      "indent": 3,
      "text": "The TN3270E client then queries for the list of TN3270E servers supporting SLP. This is done by using the Service Request API call.",
      "ja": "TN3270Eクライアントは、SLPをサポートしているTN3270Eサーバーのリストを照会します。これは、サービス・リクエストのAPI呼び出しを使用して行われます。"
    },
    {
      "indent": 3,
      "text": "The request string contains information that determines which type of TN3270E servers that this client desires to connect to. The request string can contain the scope name, pool name, session type and 3270 screen size.",
      "ja": "要求文字列は、このクライアントが接続を希望するTN3270Eサーバの種類を決定する情報が含まれています。要求文字列は、スコープ名、プール名、セッションの種類と3270の画面サイズを含めることができます。"
    },
    {
      "indent": 3,
      "text": "The SLPv1 query string has the following format:",
      "ja": "SLPv1のクエリ文字列の形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "TN3270/<scope name>/LUPOOL/ == <pool name><TAB><device type>",
      "ja": "TN3270 / <スコープ名> / LUPOOL / == <プール名> <TAB> <デバイスタイプ>"
    },
    {
      "indent": 3,
      "text": "The <scope name> is the name of the scope that is configured for the TN3270E client. If the scope is blank or null (unscoped request), then the scope is not inserted into the request string.",
      "ja": "<スコープ名>はTN3270Eクライアント用に設定されている範囲の名前です。スコープがブランクまたはヌル（スコープ外リクエスト）の場合、スコープは、要求の文字列に挿入されていません。"
    },
    {
      "indent": 3,
      "text": "The <pool name> is a 1 to 8 character upper case string that indicates the name of the pool to which the TN3270E client desires to connect. For SLP session balancing, the same pool name must be configured on different TN3270E servers.",
      "ja": "<プール名>はTN3270Eクライアントが接続することを希望するプールの名前を示し、1〜8文字の大文字の文字列です。 SLPセッション・バランシングのため、同じプール名が異なるTN3270Eサーバー上で設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "The <TAB> is the '/t' tab character which is hexadecimal 0x09. the <TAB> is a literal and is used as a separator.",
      "ja": "<TAB>は進0x09のである '/ T' タブ文字です。 <TAB>はリテラルであり、セパレータとして使用されます。"
    },
    {
      "indent": 3,
      "text": "The <device type> can be any of the following:",
      "ja": "<デバイスタイプ>は次のいずれかになります。"
    },
    {
      "indent": 4,
      "text": "3270DSC for TN3270E device type IBM-3287-1 3270002 for TN3270E device types IBM-3278-2 and IBM-3278-2-E 3270003 for TN3270E device types IBM-3278-3 and IBM-3278-3-E 3270004 for TN3270E device types IBM-3278-4 and IBM-3278-4-E 3270005 for TN3270E device types IBM-3278-5 and IBM-3278-5-E * for TN3270E device type IBM-DYNAMIC",
      "ja": "TN3270E装置用TN3270E装置タイプのためのTN3270E装置タイプIBM-3287から1 3270002 TN3270E装置タイプのためのIBM-3278から2およびIBM-3278から2-E 3270003 IBM-3278から3およびIBM-3278から3-E 3270004用3270DSC TN3270EのデバイスタイプIBM-DYNAMICのためのTN3270E装置タイプIBM-3278から5およびIBM-3278から5-E *のためのタイプIBM-3278から4およびIBM-3278から4-E 3270005"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 3,
      "text": "For a TN3270E client searching for TN3270E servers in the ENGINEERING scope for a model 2 screen size and LUPOOL name pool2, the following request SLPv1 string would be constructed:",
      "ja": "モデル2画面サイズとLUPOOL名POOL2ためENGINEERINGスコープにTN3270Eサーバの検索TN3270Eクライアントの場合は、以下の要求SLPv1の文字列を構築することになります。"
    },
    {
      "indent": 3,
      "text": "\"TN3270/ENGINEERING/LUPOOL/ == POOL2<TAB>3270002\"",
      "ja": "\"TN3270 /エンジニアリング/ LUPOOL / == POOL2 <TAB> 3270002\""
    },
    {
      "indent": 3,
      "text": "Note: The \" characters before and after the string are not part of the request string.",
      "ja": "注：文字列の前と後」の文字が要求文字列の一部ではありません。"
    },
    {
      "indent": 0,
      "text": "5.3.3 Forward Looking Example for SLPv2",
      "section_title": true,
      "ja": "SLPv2のための5.3.3楽しみにしての例"
    },
    {
      "indent": 3,
      "text": "For SLPv2 the scope and service type are no longer part of the query string. These are now separate fields in the message. The service type name is required to have the \"service:\" prepended. The service type field would look like \"service:TN3270\", and the scope field would be a comma separated list of scopes. A scope name is always required in SLPv2, if no other name is known, the scope name \"DEFAULT\" is used. The example below uses the same parameters as used in above section 5.3.2.",
      "ja": "SLPv2のためにスコープとサービスタイプは、クエリ文字列には含まれていません。これらは現在、メッセージ内の別々のフィールドです。プリペンド：サービスタイプ名は、「サービス」を有することが要求されます。サービスタイプフィールドは次のようになり、「サービス：TN3270」、およびスコープフィールドは、スコープのカンマ区切りのリストになります。スコープ名は、常に他の名前が知られていない場合、スコープ名「DEFAULT」が使用され、SLPv2のに必要とされます。以下の例では、上記のセクション5.3.2で用いたのと同じパラメータを使用します。"
    },
    {
      "indent": 3,
      "text": "Example: Service Type: service:TN3270 Scope string: ENGINEERING The query string would have the following format:",
      "ja": "例：サービスタイプ：サービス：TN3270スコープ文字列：クエリ文字列は次の形式を持つことになりエンジニアリング："
    },
    {
      "indent": 11,
      "text": "(LUPOOL=<POOL2> <32700002>)",
      "ja": "（LUPOOL = <POOL2> <32700002>）"
    },
    {
      "indent": 3,
      "text": "In SLPv2 queries, all whitespace is compressed to a single space character during matching, so the identity of the separator character does not matter. The tab character could be added for readability, but it will not affect the outcome of the query.",
      "ja": "SLPv2のクエリでは、すべての空白は一致する時に、単一の空白文字に圧縮されているので、区切り文字のアイデンティティは重要ではありません。タブ文字を読みやすくするために追加することができ、それは、クエリの結果には影響しません。"
    },
    {
      "indent": 0,
      "text": "5.3.4 Determine loading of each TN3270E server",
      "section_title": true,
      "ja": "5.3.4各TN3270Eサーバーの負荷を決定します"
    },
    {
      "indent": 3,
      "text": "An attribute request for \"service:tn3270e\" specifying the attribute LOAD can be made and you will get back all the available loads. Say these are 35,88,78. You can then issue a service request for all tn3270E servers with \"LOAD<40\" for instance. Even if the load changes between the time you get the attribute reply and when you issue the request, you will still get the best the network has to offer.",
      "ja": "「サービス：TN3270E」のための属性要求属性LOAD指定を行うことができ、使用可能なすべての負荷を取り戻すだろう。これらは35,88,78ていると言います。あなたは、インスタンスのための「LOAD <40」を持つすべてのTN3270Eサーバー用のサービス要求を発行することができます。でもあなたは属性応答を取得し、あなたがリクエストを発行するまでの間、負荷が変化した場合、あなたはまだネットワークが提供する最善を取得します。"
    },
    {
      "indent": 3,
      "text": "The TN3270E client then uses the TN3270E server's IP Host address to start normal Telnet TN3270E negotiation.",
      "ja": "TN3270Eクライアントは、通常のTelnet TN3270Eネゴシエーションを開始するためにTN3270EサーバーのIPホストアドレスを使用しています。"
    },
    {
      "indent": 0,
      "text": "5.4 Recommendations",
      "section_title": true,
      "ja": "5.4勧告"
    },
    {
      "indent": 3,
      "text": "The TN3270E client SHOULD display the IP hostname and TCP Port that is being used for the TN3270E connection. This gives the user knowledge of which TN3270E server the session is connected to. For example, the IP host address could be displayed in the window system status bar.",
      "ja": "TN3270EクライアントがTN3270E接続に使用されているIPホスト名とTCPポートが表示されます。これは、セッションが接続されているTN3270Eサーバーのユーザーの知識を提供します。例えば、IPホストアドレスは、ウィンドウシステムのステータスバーに表示することができます。"
    },
    {
      "indent": 3,
      "text": "The TN3270E client SHOULD display the resource name that is returned by the TN3270E server after connection and TN3270E negotiation is completed. This gives the user knowledge of which LU resource name in the LUPOOL the session is connected to. For example, the resource name could be displayed in the Windows status bar, or even in the 3270 OIA line.",
      "ja": "TN3270Eクライアントが接続し、TN3270Eネゴシエーションが完了した後、TN3270Eサーバーによって返されたリソース名が表示されます。これは、セッションが接続されてLUPOOL内のどのLUリソース名のユーザーの知識を提供します。たとえば、リソース名は、Windowsのステータスバーに、あるいは3270 OIA行に表示することができます。"
    },
    {
      "indent": 3,
      "text": "In the event that after the TN3270E client has determined the least loaded server and the connection to that server fails for some reason, the connection should be closed and an attempt made to connect to other TN3270E servers in the list of least loaded servers.",
      "ja": "TN3270Eクライアントが決定した後に最も負荷のサーバーと、そのサーバーへの接続が何らかの理由で失敗した場合には、接続が閉じられなければならないとの試みは、最も負荷のサーバのリストに他のTN3270Eサーバーに接続するために作られました。"
    },
    {
      "indent": 3,
      "text": "For example, a TN3270E server may reject a connection to a specific pool if the pool is full, or if the device type does not match what is available in the pool. If this occurs, then an attempt to other least loaded TN3270E servers SHOULD be performed.",
      "ja": "例えば、プールが満杯である場合TN3270Eサーバは、特定のプールへの接続を拒否することができる、またはデバイスタイプは、プールで利用可能であるものと一致しない場合。この問題が発生した場合は、その後、他の少なくともロードTN3270Eサーバーへの試みが行われるべきです。"
    },
    {
      "indent": 0,
      "text": "6. Sample Trace Flow of SLP and Session Balancing",
      "section_title": true,
      "ja": "SLPとのセッションバランシングの6.サンプルトレースの流れ"
    },
    {
      "indent": 3,
      "text": "This sample trace flow is provided for informational purposes only.",
      "ja": "このサンプル・トレース・フローは、情報提供のみを目的として提供されます。"
    },
    {
      "indent": 3,
      "text": "SLP API: Service Request: TN3270//LUPOOL == POOL2 3270002/",
      "ja": "SLPのAPI：サービスリクエスト：TN3270 // LUPOOLの== POOL2 3270002 /"
    },
    {
      "indent": 3,
      "text": "SLP API: Service Reply: service:tn3270://206.109.45.139:23",
      "ja": "SLPのAPI：サービス応答：サービス：TN3270：//206.109.45.139：23"
    },
    {
      "indent": 3,
      "text": "SLP API: Service Reply: service:tn3270://206.109.45.140:23",
      "ja": "SLPのAPI：サービス応答：サービス：TN3270：//206.109.45.140：23"
    },
    {
      "indent": 3,
      "text": "Connecting to 206.109.45.139:23...",
      "ja": "206.109.45.139:23に接続しています..."
    },
    {
      "indent": 3,
      "text": "TerminalType=NVT",
      "ja": "端末タイプN ="
    },
    {
      "indent": 3,
      "text": "Connection established",
      "ja": "接続が確立されました"
    },
    {
      "indent": 3,
      "text": "Recv <- DO TN3270E",
      "ja": "recv < -  DO TN3270E"
    },
    {
      "indent": 3,
      "text": "Send -> WILL TN3270E",
      "ja": "送信 - > WILL TN3270E"
    },
    {
      "indent": 3,
      "text": "TerminalType=TN3270E",
      "ja": "terminalType = TN3270E"
    },
    {
      "indent": 3,
      "text": "Recv <- SEND DEVICE_TYPE",
      "ja": "recv < -  DEVICE_TYPEを送ります"
    },
    {
      "indent": 3,
      "text": "Send -> DEVICE_TYPE REQUEST IBM-3278-2-E CONNECT POOL2",
      "ja": "送信 - > DEVICE_TYPE要求IBM-3278から2-E CONNECT POOL2"
    },
    {
      "indent": 3,
      "text": "Recv <- DEVICE_TYPE IS IBM-3278-2-E CONNECT TN8003",
      "ja": "recv < -  DEVICE_TYPEはIBM-3278から2-E CONNECT TN8003 IS"
    },
    {
      "indent": 3,
      "text": "Send -> FUNCTIONS REQUEST BIND_IMAGE SYSREQ",
      "ja": "送信 - > FUNCTIONS REQUESTのBIND_IMAGEのSYSREQ"
    },
    {
      "indent": 3,
      "text": "Recv <- FUNCTIONS IS BIND_IMAGE SYSREQ",
      "ja": "recv < - 機能がBIND_IMAGE SYSREQ IS"
    },
    {
      "indent": 0,
      "text": "7. Service Templates and Service Registration",
      "section_title": true,
      "ja": "7.サービステンプレートおよびサービスの登録"
    },
    {
      "indent": 3,
      "text": "The Service Location Protocol uses the \"service:\" URL scheme name to define URLs called \"service: URLs\". These schemes provide a way for clients to obtain configuration information that is needed to establish a 3270 session through the TN3270E server. The Service Location Protocol provides for service: URLs to be registered and discovered.",
      "ja": "「：のURLサービス」と呼ばれるURLを定義するためにURLのスキーム名：サービスロケーションプロトコルは、「サービス」を使用しています。これらのスキームは、クライアントがTN3270Eサーバーを介して3270セッションを確立するために必要な設定情報を取得するための方法を提供します。サービスロケーションプロトコルは、サービスを提供：URLは登録して発見されます。"
    },
    {
      "indent": 3,
      "text": "Service Registration These service registrations contain a service: URL, and possible attributes associated with that service. The service registration information are shown below for the server.",
      "ja": "URL、およびそのサービスに関連付けられている可能な属性：サービスの登録は、これらのサービスの登録は、サービスが含まれています。サービス登録情報は、サーバのために以下に示します。"
    },
    {
      "indent": 3,
      "text": "Service Templates Service templates are documents defining in a formal way the attributes associated with that service that a client may want to use. For more information on service templates please refer to, Service Templates and service: Schemes. [2]. The server service template and TN3270 service templates are shown below.",
      "ja": "サービステンプレートサービステンプレートは、正式な方法でクライアントが使用することをお勧めします、そのサービスに関連付けられた属性を定義する文書です。スキーム：サービステンプレートの詳細については、サービステンプレートおよびサービスは、以下を参照してください。 [2]。サーバーのサービステンプレートとTN3270サービステンプレートを以下に示します。"
    },
    {
      "indent": 0,
      "text": "7.1 The TN3270E Service Type Template",
      "section_title": true,
      "ja": "7.1 TN3270Eサービスタイプテンプレート"
    },
    {
      "indent": 3,
      "text": "The 'service:tn3270:' template defined below conforms to the grammar described in \"Service Templates and service: Schemes\". Please refer to [2] for detailed explanation of the syntax.",
      "ja": "「サービス：TN3270：」テンプレートは以下に定義するには、「：スキームサービステンプレートおよびサービス」で説明した文法に準拠しています。構文の詳細な説明のために[2]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Name of submitters: Jim Naugle <jnaugle@us.ibm.com> Gregg Ledford <gledford@zephyrcorp.com> K. Kasthurirangan <kasthuri@us.ibm.com> Language of service template: en Security Considerations: Service Location Protocol can help clients discover security services supported by the TN3270E server. If security services are important or required, using SLP authentication, and protected scopes in Service Location Protocol version 1 is recommended [1]. Well known ciphersuite names are used in the template [3].",
      "ja": "提出者の名前：ジム・ナウグルサービステンプレートの<jnaugle@us.ibm.com>グレッグ・レドフォード<gledford@zephyrcorp.com> K. Kasthurirangan <kasthuri@us.ibm.com>言語：セキュリティの考慮EN：サービスロケーションプロトコルは助けることができますクライアントはTN3270Eサーバーでサポートされているセキュリティ・サービスを発見します。セキュリティサービスは、サービスロケーションプロトコルバージョン1におけるスコープ重要またはSLP認証を使用して、必要に応じて、保護されている場合に推奨される[1]。よく知られている暗号スイート名は、テンプレートで使用されている[3]。"
    },
    {
      "indent": 3,
      "text": "Template text:\n----------------------template begins here -------------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "template-type=tn3270e",
      "ja": "テンプレート型= TN3270E"
    },
    {
      "indent": 3,
      "text": "template-version=1.0",
      "ja": "テンプレート・バージョン= 1.0"
    },
    {
      "indent": 3,
      "text": "template-description= The tn3270 service provides 3270 gateway access to an SNA network via the TN3270 protocol. The attributes reflect the types of 3270 devices, LU Pools, and load information available on the server.",
      "ja": "テンプレート記述= TN3270サービスは、TN3270プロトコルを介してSNAネットワークへのゲートウェイ3270へのアクセスを提供します。属性は、3270台のデバイスの種類、LUプールを反映して、サーバ上で入手可能な情報を読み込みます。"
    },
    {
      "indent": 3,
      "text": "template-url-syntax= # service:tn3270://<hostname>:<port> # <hostname> # <port>",
      "ja": "テンプレートのurl-構文=＃サービス：TN3270：// <ホスト名>：<ポート>＃<ホスト名>＃<ポート>"
    },
    {
      "indent": 3,
      "text": "load=integer # This is the load balancing quantity to use in determining the # least loaded TN3270E server to attach to for the service. The #range of valid values is an integral 0 to 100 with 0 indicating the #lowest possible load and 100 the highest",
      "ja": "負荷=整数＃これはサービスのために接続するために＃最も負荷TN3270Eサーバーを決定する際に使用する負荷分散量です。有効な値の#range命令は#lowest可能な負荷を示す0と100と一体0と100最高"
    },
    {
      "indent": 3,
      "text": "LUPool=string X M L # This attribute takes on one or more values as defined below. # The <TAB> char. 0x09 is literal and will be used as a separator. # # # <pool name> = <name> / <name> \"<TAB>\" <dev type> # <name> = 1*ALPHANUM # \"3270DSC\" # # # # # Identifies the LU pool names of LU pools available for use on this # service with the associated device types supported in each pool. # Each value is a record where the first token is the pool name of # the pool and the second token is a device type supported in that # pool. A pool name without a device type indicates that LUs of # unknown type are included in the pool. Records associated with a # given pool name are repeated for each supported device type. A # given pool is included in a registration request if any PU profile # that contributes at least one LU to the pool is active on the # server. The range of valid dev_types are: # # dev_type Meaning #",
      "ja": "以下に定義するLUPool =文字列XのMのL番号は、この属性は、1つ以上の値を取ります。 ＃<TAB>文字。 0x09のはリテラルであり、セパレータとして使用されます。 ### <プール名> = <名前> / <名前> \"<TAB>\" <DEVタイプ>＃<名前> = 1 * ALPHANUM＃ \"3270DSC\" ＃#### LUプールのLUプール名が利用できる識別各プールでサポートされている関連するデバイスの種類と、この＃サービスで使用するため。 ＃各値は、最初のトークンが＃プールのプール名であり、第二のトークンがその＃プールでサポートされるデバイスタイプのレコードです。デバイスタイプのないプール名は＃未知のタイプのLUは、プールに含まれていることを示しています。 ＃指定したプール名に関連付けられたレコードはサポートされている各デバイスの種類ごとに繰り返されます。プールに対して少なくとも1つのLUに寄与する任意のPUプロファイル＃は＃サーバ上のアクティブな場合＃所与のプールは、登録要求に含まれています。有効なdev_typesの範囲は以下のとおりです。＃意味の##のdev_type"
    },
    {
      "indent": 3,
      "text": "# 3270002 Lu Type 2 Model 2 # # 3270003 Lu Type 2 Model 3 # # 3270004 Lu Type 2 Model 4 # # 3270005 Lu Type 2 Model 5 # # 3270DSC Printer LU #",
      "ja": "＃3270002 LUタイプ2モデル2 ## 3270003 LUタイプ2モデル3 ## 3270004 LUタイプ2モデル4 ## 3270005 LUタイプ2モデル5 ## 3270DSCプリンタのLU＃"
    },
    {
      "indent": 3,
      "text": "BIND=keyword # The server supports the SNA bind image TN3270E function.",
      "ja": "BIND =キーワード＃サーバーは、SNAバインドイメージTN3270E機能をサポートしています。"
    },
    {
      "indent": 3,
      "text": "DATA=keyword # The non-SNA 3270 data stream is supported by server.",
      "ja": "DATA =キーワード＃非SNA 3270データ・ストリームは、サーバーによってサポートされています。"
    },
    {
      "indent": 3,
      "text": "RESPONSES=keyword # The server supports SNA response mode.",
      "ja": "応答は=キーワード＃サーバーは、SNA応答モードをサポートしています。"
    },
    {
      "indent": 3,
      "text": "SCS=keyword # The server supports SNA 3270 SCS data stream.",
      "ja": "SCS =キーワード＃サーバーは、SNA 3270 SCSデータ・ストリームをサポートしています。"
    },
    {
      "indent": 3,
      "text": "SYSREQ=keyword # The SYSREQ keyboard key is supported on server.",
      "ja": "SYSREQ =キーワード＃SYSREQキーボードのキーは、サーバーでサポートされています。"
    },
    {
      "indent": 3,
      "text": "RFC1576=keyword # RFC1576 options supported.",
      "ja": "RFC1576 =キーワード＃のRFC1576のオプションがサポートされています。"
    },
    {
      "indent": 3,
      "text": "RFC1646=keyword # RFC1646 options supported.",
      "ja": "RFC1646 =キーワード＃のRFC1646のオプションがサポートされています。"
    },
    {
      "indent": 3,
      "text": "RFC2355=keyword # RFC2355 options supported.",
      "ja": "RFC2355 =キーワード＃のRFC2355のオプションがサポートされています。"
    },
    {
      "indent": 3,
      "text": "security=string M # This is the security technique supported on the server. # The defined values are: NONE SSLV3",
      "ja": "セキュリティ=この文字列M＃がサーバー上でサポートされるセキュリティ技術です。 ＃定義された値は次のとおりです。NONE SSLV3"
    },
    {
      "indent": 3,
      "text": "Ciphersuites=string M # Cipher specifications supported by this server. # Additional values will be defined in future templates. NULL_NULL, NULL_MD5, NULL_SHA, RC4_MD5_EXPORT,",
      "ja": "このサーバーでサポートされている暗号スイート=文字列M＃暗号仕様。 ＃追加の値は、将来のテンプレートで定義されます。 NULL_NULL、NULL_MD5、NULL_SHA、RC4_MD5_EXPORT、"
    },
    {
      "indent": 3,
      "text": "RC4_MD5_US, RC4_SHA_US, RC2_MD5_EXPORT, DES_SHA_EXPORT, TRIPLE_DES_SHA_US",
      "ja": "RC4_MD5_US、RC4_SHA_US、RC2_MD5_EXPORT、DES_SHA_EXPORT、TRIPLE_DES_SHA_US"
    },
    {
      "indent": 3,
      "text": "platform=string X # This is the network operating system platform underlying the # advertising service. The defined values are: # # IW Server uses IntranetWare or NetWare operating system # # NT Server uses the Microsoft NT operating system # # OS2 Server uses the OS2 operating system # # AIX Server uses the AIX operating system # IW,NT,OS2,AIX",
      "ja": "プラットフォームは=文字列Xの＃これは＃広告サービスの基礎となるネットワーク・オペレーティング・システム・プラットフォームです。定義された値は次のとおりです。##のIWサーバーは、IntranetWareのか、NetWareオペレーティングシステム##のNT Serverが使用するMicrosoft NTオペレーティングシステムの##のOS2 ServerはOS2オペレーティングシステム##のAIXサーバーがAIXオペレーティング・システム＃のIW、NT、OS2を、使用して使用しています使用していますAIX"
    },
    {
      "indent": 3,
      "text": "protocol=string X # This is the protocol(s) supported by the server providing this # service. The defined values are: # # IP Server supports client connections over IP (TCP/IP or # UDP/IP) # # IPX Server supports client connections over IPX (SPX/IPX) # IP,IPX",
      "ja": "プロトコル=文字列Xの＃これは＃サービスを提供するサーバでサポートされているプロトコル（単数または複数）です。定義された値は次のとおりです。##のIPサーバーがIP経由のクライアント接続をサポートしています（TCP / IPまたは＃UDP / IP）## IPXサーバーは、IPX（SPX / IPX）＃のIP経由のクライアント接続をサポートし、IPX"
    },
    {
      "indent": 3,
      "text": "server name=string # This is the name of the server that was configured during # installation.",
      "ja": "サーバー名=文字列＃これは＃のインストール時に設定されたサーバの名前です。"
    },
    {
      "indent": 3,
      "text": "release=string X # This is the version and release level of the server advertising # services. Its format is vv.rr.mm where \"vv\" is the major version # number, \"rr\" is the minor version number, and \"mm\" is the # modification level. All numbers are padded on the left with zeroes # to two characters. # Example: version 3, release 0, mod level 0 is \"03.00.00\"",
      "ja": "リリースは=文字列X＃これは、サーバーの広告＃サービスのバージョンおよびリリースレベルです。その形式は「VV」はメジャーバージョン番号の数であるvv.rr.mmで、「rrは」マイナーバージョン番号で、「mm」が＃の修正レベルです。すべての数字は、2つの文字にゼロ番号と左側に埋め込まれます。 ＃例：バージョン3、リリース0、MODレベル0が \"03.00.00\" であります"
    },
    {
      "indent": 3,
      "text": "------------------template ends here -------------------------------",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7.2 Server Service Type Template",
      "section_title": true,
      "ja": "7.2サーバーのサービスタイプテンプレート"
    },
    {
      "indent": 3,
      "text": "The 'service:commserver:' template defined below conforms to the grammar described in \"Service Templates and service: Schemes\". Please refer to [2] for detailed explanation of the syntax.",
      "ja": "「サービス：COMポート：」テンプレートは以下に定義するには、「：スキームサービステンプレートおよびサービス」で説明した文法に準拠しています。構文の詳細な説明のために[2]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Name of submitters: Jim Naugle <jnaugle@us.ibm.com> Gregg Ledford <gledford@zephyrcorp.com> K. Kasthurirangan <kasthuri@us.ibm.com> Language of service template: en Security Considerations: Service Location Protocol can help clients discover security services supported by the TN3270E server. If security services are important or required, using SLP authentication, and protected scopes [1] is recommended.",
      "ja": "提出者の名前：ジム・ナウグルサービステンプレートの<jnaugle@us.ibm.com>グレッグ・レドフォード<gledford@zephyrcorp.com> K. Kasthurirangan <kasthuri@us.ibm.com>言語：セキュリティの考慮EN：サービスロケーションプロトコルは助けることができますクライアントはTN3270Eサーバーでサポートされているセキュリティ・サービスを発見します。セキュリティサービスは、SLP認証、および保護されたスコープを使用して、重要な、または必要であれば[1]お勧めします。"
    },
    {
      "indent": 3,
      "text": "Template text:",
      "ja": "テンプレートのテキスト："
    },
    {
      "indent": 3,
      "text": "-------------------template begins below this line------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "template-type=commserver",
      "ja": "テンプレート型= COMポート"
    },
    {
      "indent": 3,
      "text": "template-version=1.0",
      "ja": "テンプレート・バージョン= 1.0"
    },
    {
      "indent": 3,
      "text": "template-description= The server service type is registered whenever the communications software is loaded on the server. It describes generic attributes of the server. These attributes are also repeated on the other service types provided.",
      "ja": "テンプレートの説明通信ソフトウェアがサーバにロードされるたびに=サーバーのサービスタイプが登録されています。これは、サーバーの一般的な属性について説明します。これらの属性はまた、提供される他のサービスタイプに反復されます。"
    },
    {
      "indent": 3,
      "text": "template-url-syntax= # service:commserver://<hostname>:<port> # <hostname> # <port>",
      "ja": "テンプレートのurl-構文=＃サービス：COMポート：// <ホスト名>：<ポート>＃<ホスト名>＃<ポート>"
    },
    {
      "indent": 3,
      "text": "platform=string X # This is the network operating system platform underlying the # advertising service. The defined values are: # # IW Server uses Novell IntranetWare or NetWare operating # system # NT Server uses the Microsoft NT operating system # # OS2 Server uses the OS2 operating system # # AIX Server uses the AIX operating system # IW,NT,OS2,AIX",
      "ja": "プラットフォームは=文字列Xの＃これは＃広告サービスの基礎となるネットワーク・オペレーティング・システム・プラットフォームです。定義された値は次のとおりです。##のIWサーバーは、NovellのIntranetWareやNetWareオペレーティング＃システム＃NT ServerがMicrosoft NTオペレーティングシステムの##のOS2 ServerはOS2オペレーティングシステム##のAIXサーバーがAIXオペレーティングシステム＃のIWを使用して使用して使用して使用し、NT、OS2 、AIX"
    },
    {
      "indent": 3,
      "text": "protocol=string X # This is the protocol(s) supported by the server providing this # service. The defined values are: # # IP Server supports client connections over IP (TCP/IP or # UDP/IP) # # IPX Server supports client connections over IPX (SPX/IPX) # IP,IPX",
      "ja": "プロトコル=文字列Xの＃これは＃サービスを提供するサーバでサポートされているプロトコル（単数または複数）です。定義された値は次のとおりです。##のIPサーバーがIP経由のクライアント接続をサポートしています（TCP / IPまたは＃UDP / IP）## IPXサーバーは、IPX（SPX / IPX）＃のIP経由のクライアント接続をサポートし、IPX"
    },
    {
      "indent": 3,
      "text": "server name=string # This is the name of the server that was configured during # installation.",
      "ja": "サーバー名=文字列＃これは＃のインストール時に設定されたサーバの名前です。"
    },
    {
      "indent": 3,
      "text": "release=string X # This is the version and release level of the commserver # advertising services. Its format is vv.rr.mm where \"vv\" is the # major version number, \"rr\" is the minor version number, and \"mm\" # is the modification level. All numbers are padded on the left with # zeroes to two characters. # # Example: version 3, release 0, mod level 0 is \"03.00.00\"",
      "ja": "リリースは=文字列X＃これは、COMポート＃の広告サービスのバージョンおよびリリースレベルです。その形式は「VV」は＃メジャーバージョン番号であるvv.rr.mmで、「rrは」マイナーバージョン番号であり、「ミリメートル」＃は修正レベルです。すべての数字は、2つの文字に＃をゼロで左側にパディングされます。 ##例：バージョン3,0を離し、MODレベル0は「03.00.00」であります"
    },
    {
      "indent": 3,
      "text": "---------------------template ends above this line---------------------",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7.3 Template Contact Information",
      "section_title": true,
      "ja": "7.3テンプレートの連絡先情報"
    },
    {
      "indent": 3,
      "text": "Jim Naugle <jnaugle@us.ibm.com> Kasthuri Kasthurirangan <kasthuri@us.ibm.com> Gregg Ledford <gledford@zephyrcorp.com>",
      "ja": "ジム・ナウグル<జ్నుగ్లే@అస్.ఇబ్న్.కం>ムスクkasturirangam <కస్తూరి@అస్.ఇబ్న్.కం>グレッグlediphord <గ్లెడ్ఫోర్డ్@జెడ్పీహైరికార్ప్.కం>"
    },
    {
      "indent": 0,
      "text": "7.4 Security Considerations",
      "section_title": true,
      "ja": "7.4セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Service type templates provide information that is used to interpret information obtained by the Service Location Protocol. If these templates are modified or if false templates are distributed, services may not correctly register themselves, or clients might not be able to interpret service information.",
      "ja": "サービスタイプのテンプレートは、サービスロケーションプロトコルによって得られた情報を解釈するために使用される情報を提供しています。これらのテンプレートが変更された場合、または誤ったテンプレートが配布された場合、サービスが正常に自身を登録しないことがあり、またはクライアントは、サービス情報を解釈できない場合があります。"
    },
    {
      "indent": 3,
      "text": "The service: URLs themselves specify the service access point and protocol for a particular service type. These service: URLs could be distributed and indicate the location of a service other than that normally wanted to used. SLP [1] provides an authentication mechanism that allows service: URLs of registered services to be signed and for the signatures to be verified by clients.",
      "ja": "サービス：URLは、それ自体が特定のサービスタイプのサービスアクセスポイントとプロトコルを指定します。これらのサービス：URLは配布され、通常は使用したかったもの以外のサービスの位置を示すことができました。登録されたサービスのURLに署名し、署名がクライアントによって検証するためする：SLP [1]サービスを可能にする認証メカニズムを提供します。"
    },
    {
      "indent": 3,
      "text": "Service Location Protocol can help clients discover security services supported by the TN3270E server. If security services are important or required, using SLP authentication, and protected scopes [1] is recommended.",
      "ja": "サービスロケーションプロトコルは、クライアントがTN3270Eサーバーでサポートされているセキュリティ・サービスを発見することができます。セキュリティサービスは、SLP認証、および保護されたスコープを使用して、重要な、または必要であれば[1]お勧めします。"
    },
    {
      "indent": 0,
      "text": "7.5 Sample TN3270 Service Registration Message",
      "section_title": true,
      "ja": "7.5サンプルTN3270サービス登録メッセージ"
    },
    {
      "indent": 3,
      "text": "URL: service:tn3270://<addr-spec>:<port-number> Attributes:",
      "ja": "URL：サービス：TN3270：// <addrのスペック>：<ポート番号>属性："
    },
    {
      "indent": 3,
      "text": "[(SCOPE=<string>),]",
      "ja": "[（SCOPE = <ストリング>）]"
    },
    {
      "indent": 3,
      "text": "(RELEASE=03.00.00),",
      "ja": "（RELEASE = 03.00.00）"
    },
    {
      "indent": 3,
      "text": "(PLATFORM=IW),",
      "ja": "（Blotfrm又は=）、"
    },
    {
      "indent": 3,
      "text": "(PROTOCOL=IP),",
      "ja": "（PROTOCOL = IP）"
    },
    {
      "indent": 3,
      "text": "(SERVERNAME=<string>),",
      "ja": "（SERVERNAME = <ストリング>）、"
    },
    {
      "indent": 3,
      "text": "(LOAD=<integer 0 to 100>),",
      "ja": "（LOAD = <100の整数0>）、"
    },
    {
      "indent": 3,
      "text": "[(LUPOOL=pool-name0/tANY,",
      "ja": "[（LUPOOL =プールNAME0 /タニー、"
    },
    {
      "indent": 3,
      "text": "pool-name1/tdevice_type1,",
      "ja": "プール-NAME1 / tdevice_type1、"
    },
    {
      "indent": 3,
      "text": "pool-name2/tdevice-type2, ...",
      "ja": "プール名2 /デバイスタイプ2、..."
    },
    {
      "indent": 3,
      "text": "pool-namen/tdevice-typen)]",
      "ja": "プール名/ tdeviceタイプ）]"
    },
    {
      "indent": 3,
      "text": "BIND,",
      "ja": "練る、"
    },
    {
      "indent": 3,
      "text": "DATA,",
      "ja": "データ、"
    },
    {
      "indent": 3,
      "text": "RESPONSES,",
      "ja": "反応、"
    },
    {
      "indent": 3,
      "text": "SCS,",
      "ja": "SCS、"
    },
    {
      "indent": 3,
      "text": "SYSREQ,",
      "ja": "SYSREQ、"
    },
    {
      "indent": 3,
      "text": "(SECURITY=NONE),",
      "ja": "（SECURITY = NONE）、"
    },
    {
      "indent": 3,
      "text": "RFC1576,",
      "ja": "RFC1576、"
    },
    {
      "indent": 3,
      "text": "RFC1646,",
      "ja": "RFC1646、"
    },
    {
      "indent": 3,
      "text": "RFC2355",
      "ja": "Rvsiakh"
    },
    {
      "indent": 0,
      "text": "7.6 Sample Server Service Registration Message",
      "section_title": true,
      "ja": "7.6サンプルサーバサービスの登録メッセージ"
    },
    {
      "indent": 3,
      "text": "URL:service:commserver://<addr-spec>:<port-number>",
      "ja": "URL：サービス：COMポート：// <addrのスペック>：<ポート番号>"
    },
    {
      "indent": 3,
      "text": "Attributes: [(SCOPE=<string>),]",
      "ja": "属性：[（SCOPE = <ストリング>）]"
    },
    {
      "indent": 3,
      "text": "(RELEASE=03.00.00),",
      "ja": "（RELEASE = 03.00.00）"
    },
    {
      "indent": 3,
      "text": "(PLATFORM=IW),",
      "ja": "（Blotfrm又は=）、"
    },
    {
      "indent": 3,
      "text": "(PROTOCOL=IP),",
      "ja": "（PROTOCOL = IP）"
    },
    {
      "indent": 3,
      "text": "(SERVERNAME=<string>)",
      "ja": "（SERVERNAME = <ストリング>）"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 3,
      "text": "[1] Veizades, J., Guttman, E., Perkins, C., and S. Kaplan, \"Service Location Protocol\", RFC 2165, July 1997.",
      "ja": "[1] Veizades、J.、ガットマン、E.、パーキンス、C.、およびS.カプラン、 \"サービス・ロケーション・プロトコル\"、RFC 2165、1997年7月。"
    },
    {
      "indent": 3,
      "text": "[2] Guttman, E., Perkins, C. and J. Kempf, \"Service Templates and service: Schemes\", RFC 2609, June 1999.",
      "ja": "[2]ガットマン、E.、パーキンス、C.及びJ.ケンプ、 \"サービステンプレートおよびサービス：スキーム\"、RFC 2609、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[3] Dierks, T. and C. Allen, \"The TLS Protocol Version 1.0\", RFC 2246, January 1999.",
      "ja": "[3]ダークス、T.とC.アレン、 \"TLSプロトコルバージョン1.0\"、RFC 2246、1999年1月。"
    },
    {
      "indent": 3,
      "text": "[4] Guttman, E., Perkins, C., Veizades, J. and M. Day, \"Service Location Protocol Version 2\", RFC 2608, June 1999.",
      "ja": "[4]ガットマン、E.、パーキンス、C.、Veizades、J.とM.日、 \"サービスロケーションプロトコルバージョン2\"、RFC 2608、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[5] Kempf, J. and E. Guttman, \"An API for Service Location\", RFC 2614, June 1999.",
      "ja": "[5]ケンプ、J.およびE.グットマン、 \"サービスロケーションのためのAPI\"、RFC 2614、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[6] Bradner, S., \"Key Words for Use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[6]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 0,
      "text": "9. Authors' Addresses",
      "section_title": true,
      "ja": "9.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jim Naugle IBM P.O. Box 12195 Research Triangle Park, N.C. 27709-2195 USA",
      "ja": "ジム・ナウグルIBMの私書箱ボックス12195リサーチトライアングルパーク、ノースカロライナ27709から2195 USA"
    },
    {
      "indent": 3,
      "text": "Phone: (919) 254-8789 EMail: jnaugle@us.ibm.com",
      "ja": "電話：（919）254-8789 Eメール：jnaugle@us.ibm.com"
    },
    {
      "indent": 3,
      "text": "Kasthuri Kasthurirangan IBM P.O. Box 12195 Research Triangle Park, N.C. 27709-2195 USA",
      "ja": "カズスリKasthurirangan IBMの私書箱ボックス12195リサーチトライアングルパーク、ノースカロライナ27709-2195 USA"
    },
    {
      "indent": 3,
      "text": "Phone: (919) 254-5721 EMail: kasthuri@us.ibm.com",
      "ja": "電話：（919）254-5721 Eメール：kasthuri@us.ibm.com"
    },
    {
      "indent": 3,
      "text": "Gregg Ledford Zephyr Development Corporation 8 Greenway Plaza Suite 1400 Houston, Texas 77046 USA",
      "ja": "グレッグ・レドフォードゼファー開発公社8グリーンウェイプラザスイート1400ヒューストン、テキサス州77046 USA"
    },
    {
      "indent": 3,
      "text": "Phone: (713) 623-0089 EMail: gledford@zephyrcorp.com",
      "ja": "電話：（713）623-0089 Eメール：gledford@zephyrcorp.com"
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "ja": "10.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2001）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}