{
  "title": {
    "text": "RFC 3878 - Alarm Reporting Control Management Information Base (MIB)",
    "ja": "RFC 3878 - アラーム報告制御管理情報ベース（MIB）"
  },
  "number": 3878,
  "created_at": "2023-09-08 07:17:38.422419+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                             H. Lam\nRequest for Comments: 3878                           Lucent Technologies\nCategory: Standards Track                                       A. Huynh\n                                                          Cetus Networks\n                                                              D. Perkins\n                                                                SNMPinfo\n                                                          September 2004",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 19,
      "text": " Alarm Reporting Control Management Information Base (MIB)",
      "ja": "アラーム報告制御管理情報ベース（MIB）"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（c）The Internet Society（2004）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols in TCP/IP-based internets. In particular, it defines objects for controlling the reporting of alarm conditions.",
      "ja": "このメモは、TCP/IPベースのインターネットのネットワーク管理プロトコルで使用するための管理情報ベース（MIB）の一部を定義します。特に、アラーム条件の報告を制御するためのオブジェクトを定義します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  The Internet-Standard Management Framework . . . . . . . . . .  2\n3.  Conventions  . . . . . . . . . . . . . . . . . . . . . . . . .  2\n4.  ARC MIB Overview . . . . . . . . . . . . . . . . . . . . . . .  2\n    4.1.  Relationship between ARC mode and Alarm Reporting. . . .  4\n5.  ARC MIB Object Definitions . . . . . . . . . . . . . . . . . .  4\n6.  Security Considerations. . . . . . . . . . . . . . . . . . . . 13\n7.  Acknowledgments. . . . . . . . . . . . . . . . . . . . . . . . 14\n8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 14\n    8.1.  Normative References . . . . . . . . . . . . . . . . . . 14\n    8.2.  Informative References . . . . . . . . . . . . . . . . . 15\n9.  Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . 15\n10. Full Copyright Statement . . . . . . . . . . . . . . . . . . . 16",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The scope of this MIB is targeted for network operators responsible for managing the operations of network resources. This document defines an alarm reporting control (ARC) MIB module, which provides a mechanism for a manager to suppress or defer the reporting of alarm conditions based on the resource ID and alarm condition type.",
      "ja": "このMIBの範囲は、ネットワークリソースの運用の管理を担当するネットワークオペレーターを対象としています。このドキュメントでは、アラームレポートコントロール（ARC）MIBモジュールを定義します。これは、マネージャーがリソースIDとアラーム条件の種類に基づいてアラーム条件の報告を抑制または延期するメカニズムを提供します。"
    },
    {
      "indent": 0,
      "text": "2. The Internet-Standard Management Framework",
      "section_title": true,
      "ja": "2. インターネット標準の管理フレームワーク"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "ja": "現在のインターネット標準管理フレームワークを説明するドキュメントの詳細な概要については、RFC 3410 [RFC3410]のセクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "ja": "管理されたオブジェクトは、管理情報ベースまたはMIBと呼ばれる仮想情報ストアからアクセスされます。MIBオブジェクトは通常、単純なネットワーク管理プロトコル（SNMP）からアクセスされます。MIBのオブジェクトは、管理情報の構造（SMI）で定義されたメカニズムを使用して定義されます。このメモは、STD 58、RFC 2578 [RFC2578]、STD 58、RFC 2579 [RFC2579]およびSTD 58、RFC 2580 [RFC2580]に記載されているSMIV2に準拠したMIBモジュールを指定します。"
    },
    {
      "indent": 0,
      "text": "3. Conventions",
      "section_title": true,
      "ja": "3. 規約"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [RFC2119].",
      "ja": "「必須」、「そうしない」、「必須」、「必要」、「「しない」、「そうでない」、「そうではない」、「そうでない」、「推奨」、「5月」、および「オプション」は、BCP 14、RFC 2119 [RFC2119]に記載されているように解釈される。"
    },
    {
      "indent": 0,
      "text": "4. ARC MIB Overview",
      "section_title": true,
      "ja": "4. アークMIBの概要"
    },
    {
      "indent": 3,
      "text": "There is a need to provide a mechanism for controlling the reporting of alarm conditions of resources in a network device. For example, (a) inhibiting the reporting of alarm conditions of a resource until the resource is problem-free, (b) inhibiting the reporting of alarm conditions of a resource for a specified time period, or (c) inhibiting the reporting of alarm conditions of a resource indefinitely until explicitly allowed by the managing system at a later time.",
      "ja": "ネットワークデバイス内のリソースのアラーム条件のレポートを制御するためのメカニズムを提供する必要があります。たとえば、（a）リソースが問題がないまでリソースのアラーム条件の報告を阻害する、（b）指定された期間のリソースのアラーム条件の報告を阻害する、または（c）アラームの報告を阻害する後で管理システムによって明示的に許可されるまで、リソースの条件は無期限に許可されます。"
    },
    {
      "indent": 3,
      "text": "The alarm reporting control (ARC) feature provides an automatic in-service provisioning capability. It allows sufficient time for service setup, customer testing, and other maintenance activities in an \"alarm-free\" state. Once a resource is \"problem-free\", alarm reporting can be automatically or manually turned on (i.e., allowed).",
      "ja": "アラームレポートコントロール（ARC）機能は、自動インサービスプロビジョニング機能を提供します。これにより、「アラームフリー」状態でのサービスセットアップ、顧客テスト、およびその他のメンテナンスアクティビティに十分な時間を確保できます。リソースが「問題なし」になると、アラームレポートを自動または手動でオンにすることができます（つまり、許可されます）。"
    },
    {
      "indent": 3,
      "text": "By putting a network resource in ARC mode, (i.e., in nalm, nalmTI, nalmQI, or nalmQICD states, as described in the MIB), the technicians and managing systems will not be flooded with unnecessary work items during operations activities such as service provisioning and network setup/teardown. This will reduce maintenance costs and improve the operation and maintenance of these systems. Putting a network resource in ARC mode shall not affect the availability of active alarm condition information for potential retrieval.",
      "ja": "ネットワークリソースをARCモード（つまり、NALM、NALMTI、NALMQI、またはNALMQICD州でMIBに記載しているように）に配置することにより、技術者と管理システムは、サービス提供などの運用活動中に不必要な作業項目があふれません。およびネットワークのセットアップ/分解。これにより、メンテナンスコストが削減され、これらのシステムの運用とメンテナンスが改善されます。ネットワークリソースをARCモードに配置すると、潜在的な検索のためのアクティブアラーム条件情報の可用性に影響しません。"
    },
    {
      "indent": 3,
      "text": "ITU-T Recommendation M.3100 Amendment 3 [M.3100 Amd3] provides the business requirements, analysis, and design of the Alarm Reporting Control feature.",
      "ja": "ITU-Tの推奨M.3100修正3 [M.3100 AMD3]は、アラームレポート制御機能のビジネス要件、分析、および設計を提供します。"
    },
    {
      "indent": 3,
      "text": "This document defines the MIB objects to support a subset of the ARC functions described in M.3100 Amd3. In particular, it defines a table that can be used to specify the ARC settings for the resources in a system.",
      "ja": "このドキュメントでは、M.3100 AMD3で説明されているARC関数のサブセットをサポートするMIBオブジェクトを定義します。特に、システム内のリソースのARC設定を指定するために使用できるテーブルを定義します。"
    },
    {
      "indent": 3,
      "text": "Defined in M.3100 Amendment 3 [M.3100 Amd3], there are five ARC states: alm, nalm, nalmQI, nalmQICD and nalmTI. In the ARC MIB module, the arcState object is defined to model the M.3100 ARC states. Note that the state alm (alarm reporting is allowed) is not listed in the enumeration of the value of this object. However, this state is implicitly supported by the mib. Once a resource enters the normal reporting mode (i.e., into the alm state) for the specified alarm type, the corresponding row will be automatically deleted from the arc table. Also the manual setting of arcState to alm can be achieved through setting the RowStatus object to 'destroy'.",
      "ja": "M.3100修正3 [M.3100 AMD3]で定義されており、ALM、NALM、NALMQI、NALMQICD、NALMTIの5つのARC状態があります。ARC MIBモジュールでは、ARCSTATEオブジェクトがM.3100 ARC状態をモデル化するように定義されています。状態ALM（アラームレポートが許可されている）は、このオブジェクトの値の列挙に記載されていないことに注意してください。ただし、この状態はMIBによって暗黙的にサポートされています。リソースが指定されたアラームタイプの通常のレポートモード（つまり、ALM状態に）に入ると、対応する行はARCテーブルから自動的に削除されます。また、ARCSTATEからALMへの手動設定は、RowStatusオブジェクトを「破壊」するように設定することで実現できます。"
    },
    {
      "indent": 3,
      "text": "The ARC MIB module defined in this document provides a way to control the reporting of alarm conditions. A set of applicable alarm conditions is defined in ITU-T Recommendation M.3100 [M.3100] and is named \"probable causes\". These probable causes (alarm conditions) have been included in the IANAItuProbableCause TC, which is defined in the IANA-ITU-ALARM-TC MIB module [RFC3877]. The IANA-ITU-ALARM-TC MIB module is maintained in the IANA web-site [ITUALARMTC]. [RFC3877].",
      "ja": "このドキュメントで定義されているARC MIBモジュールは、アラーム条件のレポートを制御する方法を提供します。適用可能なアラーム条件のセットは、ITU-T推奨M.3100 [M.3100]で定義されており、「可能性のある原因」と呼ばれています。これらの可能性のある原因（アラーム条件）は、IANA-ITU-ALARM-TC MIBモジュール[RFC3877]で定義されているTCのためにIanaituprobablecabeのために含まれています。IANA-ITU-ALARM-TC MIBモジュールは、IANA Webサイト[itualArmtc]で維持されています。[RFC3877]。"
    },
    {
      "indent": 3,
      "text": "The ARC MIB module defines an IANAItuProbableCauseOrZero TC which can take any value of IANAItuProbableCause or 0. The ARC MIB module further uses IANAItuProbableCauseOrZero to define the ARC settings for the managed resource in the network elements. Specification of objects for defining and storing alarms, including active and history alarms, standing and transient alarms, and alarm notifications are out of the scope of this document.",
      "ja": "ARC MIBモジュールは、Ianaituprobablecauseまたは0の任意の値をとることができるIanaituprobablecauseorzero Tcを定義します。ArcMibモジュールは、ネットワーク要素のマネージリソースのARC設定を定義するためにianaituprobablecauseorzeroをさらに使用します。アクティブおよび履歴アラーム、スタンディングおよび一時的なアラーム、アラーム通知など、アラームを定義および保存するためのオブジェクトの仕様は、このドキュメントの範囲外です。"
    },
    {
      "indent": 0,
      "text": "4.1. Relationship between ARC mode and alarm reporting",
      "section_title": true,
      "ja": "4.1. アークモードとアラームレポートの関係"
    },
    {
      "indent": 3,
      "text": "When the ARC MIB module is used in a managed system, the following rules apply:",
      "ja": "ARC MIBモジュールが管理されたシステムで使用される場合、次のルールが適用されます。"
    },
    {
      "indent": 3,
      "text": "For alarm condition raised prior to entering ARC mode, reporting of alarm raised and alarm cleared will be sent as usual.",
      "ja": "アークモードに入る前にアラーム条件を上げた場合、アラームの報告とアラームがクリアされた場合、通常どおり送信されます。"
    },
    {
      "indent": 3,
      "text": "For alarm condition raised after entering ARC mode and also cleared before exiting ARC mode, no reporting of alarm raised will be sent and no reporting of alarm cleared will be sent.",
      "ja": "ARCモードに入った後にアラーム条件が上がり、ARCモードを終了する前にクリアされた場合、アラームの報告は送信されず、アラームクリアされた報告は送信されません。"
    },
    {
      "indent": 3,
      "text": "For alarm condition raised after entering ARC mode and not cleared when exiting ARC mode, the reporting of alarm raised will be deferred until the moment of exiting ARC mode. The reporting of alarm cleared will be sent as usual (i.e., at the time of alarm cleared).",
      "ja": "ARCモードに入った後に上昇したアラーム条件の場合、ARCモードを終了するときにクリアされていない場合、ARCモードを終了する瞬間まで、アラームのレポートが延期されます。クリアされたアラームの報告は、通常どおり（つまり、アラームがクリアされた時点で）送信されます。"
    },
    {
      "indent": 3,
      "text": "Further details of the ARC function can be found in M.3100 Amd3 [M.3100 Amd3].",
      "ja": "ARC関数の詳細については、M.3100 AMD3 [M.3100 AMD3]にあります。"
    },
    {
      "indent": 0,
      "text": "5. ARC MIB Object Definition",
      "section_title": true,
      "ja": "5. ARC MIBオブジェクト定義"
    },
    {
      "indent": 0,
      "text": "ARC-MIB DEFINITIONS ::= BEGIN",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "IMPORTS\n  MODULE-IDENTITY, OBJECT-TYPE, Unsigned32, mib-2\n          FROM SNMPv2-SMI                           -- [RFC2578]\n  TEXTUAL-CONVENTION, RowStatus, StorageType\n          FROM SNMPv2-TC                            -- [RFC2579]\n  MODULE-COMPLIANCE, OBJECT-GROUP\n          FROM SNMPv2-CONF                          -- [RFC2580]\n  ResourceId\n          FROM ALARM-MIB;                           -- [RFC3877]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcMibModule MODULE-IDENTITY LAST-UPDATED \"200409090000Z\" -- September 09, 2004 ORGANIZATION \"IETF Distributed Management Working Group\" CONTACT-INFO \"WG EMail: disman@ietf.org Subscribe: disman-request@ietf.org http://www.ietf.org/html.charters/disman-charter.html",
      "ja": "arcmibmoduleモジュールのアイデンティティ最後の「200409090000Z」 -  2004年9月9日「IETF分散管理ワーキンググループ」WG email：disman@ietf.org subscribe：disman-request@ietf.org http：// wwwwwwwwwwww.ietf.org/html.charters/disman-charter.html"
    },
    {
      "indent": 8,
      "text": "Chair: Randy Presuhn E-mail: randy_presuhn@mindspring.com",
      "ja": "議長：Randy Presuhnの電子メール：Randy_presuhn@mindspring.com"
    },
    {
      "indent": 8,
      "text": "Editor: Hing-Kam Lam Lucent Technologies, 4C-616 101 Crawfords Corner Road Holmdel, NJ 07733 USA Tel: +1 732 949 8338 E-mail: hklam@lucent.com\"",
      "ja": "編集者：Hing-Kam Lam Lucent Technologies、4C-616 101 Crawfords Corner Road Holmdel、NJ 07733 USA Tel：1 732 949 8338電子メール：hklam@lucent.com \""
    },
    {
      "indent": 2,
      "text": "DESCRIPTION \"The MIB module describes the objects for controlling a resource in reporting alarm conditions that it detects.",
      "ja": "説明 \"MIBモジュールは、検出するアラーム条件を報告するリソースを制御するオブジェクトを説明します。"
    },
    {
      "indent": 5,
      "text": "Copyright (C) The Internet Society (2004). This version of this MIB module is part of RFC 3878; see the RFC itself for full legal notices.\"",
      "ja": "著作権（c）The Internet Society（2004）。このMIBモジュールのこのバージョンは、RFC 3878の一部です。完全な法的通知については、RFC自体を参照してください。」"
    },
    {
      "indent": 2,
      "text": "REVISION  \"200409090000Z\"  -- September 09, 2004\nDESCRIPTION\n     \"Initial version, published as RFC 3878.\"\n::={ mib-2 117 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "------------------\n-- TEXTUAL-CONVENTION\n------------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "IANAItuProbableCauseOrZero ::= TEXTUAL-CONVENTION\n  STATUS  current\n  DESCRIPTION\n    \"This TC can take any value of IANAItuProbableCause or 0.\n     IANAItuProbableCause is defined in the IANA-ITU-ALARM-TC\n     module, which is maintained at the IANA web site and\n     published in the Alarm MIB document (see RFC 3877).\"\n  REFERENCE\n    \"IANA-ITU-ALARM-TC MIB module as maintained at the IANA web site.\n     The initial module was also published in RFC 3877.\"\n--\n  SYNTAX  INTEGER (0..2147483647)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "------------------\n-- MIB Objects\n------------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcTimeIntervals   OBJECT IDENTIFIER ::= { arcMibModule 1 }\narcObjects         OBJECT IDENTIFIER ::= { arcMibModule 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcTITimeInterval OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION",
      "ja": "ArctitimeIntervalオブジェクトタイプの構文unsigned32ユニット「秒」最大アクセス読み取りワイトステータス現在の説明"
    },
    {
      "indent": 4,
      "text": "\"This variable indicates the time interval used for the nalmTI state, in units of second. It is a pre-defined length of time in which the resource will stay in the nalmTI state before transition into the alm state.",
      "ja": "「この変数は、Nalmti状態に使用される時間間隔を秒単位で示します。これは、ALM状態に移行する前に、リソースがNalmti状態にとどまる前定義の長さです。"
    },
    {
      "indent": 2,
      "text": "   Instances of this object SHOULD persist across agent restarts.\"\n::= { arcTimeIntervals 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcCDTimeInterval OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-write STATUS current DESCRIPTION \"This variable indicates the time interval used for the nalmQICD state, in units of second. It is a pre-defined length of time in which the resource will stay in the nalmQICD state before transition into the alm state after it is problem-free.",
      "ja": "arccdtimeIntervalオブジェクトタイプの構文untisished32ユニット「秒」最大アクセス読み取りワイトステータス現在の説明 \"この変数は、2番目の単位でnalmqicd状態に使用される時間間隔を示します。問題がない後、ALM状態に移行する前に、Nalmqicd状態にとどまります。"
    },
    {
      "indent": 2,
      "text": "   Instances of this object SHOULD persist across agent restarts.\"\n::= { arcTimeIntervals 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcTable OBJECT-TYPE SYNTAX SEQUENCE OF ArcEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A table of Alarm Reporting Control (ARC) settings on the system.",
      "ja": "ARCENTRY MAX-ACCESSのARCTABLEオブジェクトタイプの構文シーケンスは、アクセス不可能なステータス現在説明 \"システム上のアラーム報告制御のテーブル（ARC）設定。"
    },
    {
      "indent": 5,
      "text": "Alarm Reporting Control is a feature that provides an automatic in-service provisioning capability. Alarm reporting is turned off on a per-resource basis for a selective set of potential alarm conditions to allow sufficient time for customer testing and other maintenance activities in an 'alarm free' state. Once a resource is ready for service, alarm reporting is automatically or manually turned on.",
      "ja": "アラームレポート制御は、自動インサービスプロビジョニング機能を提供する機能です。アラームレポートは、「アラームフリー」状態での顧客テストやその他のメンテナンスアクティビティに十分な時間を確保するために、潜在的なアラーム条件の選択的なセットのリソースごとにオフになります。リソースの使用準備ができたら、アラームレポートが自動的にまたは手動でオンになります。"
    },
    {
      "indent": 5,
      "text": "Functional description and requirements of Alarm Reporting Control are defined in ITU-T Recommendation M.3100 Amendment 3 [M.3100 Amd3].\"",
      "ja": "アラーム報告制御の機能的説明と要件は、ITU-T推奨M.3100修正3 [M.3100 AMD3]で定義されています。"
    },
    {
      "indent": 2,
      "text": "REFERENCE\n      \"ITU Recommendation M.3100 Amendment 3, 'Generic Network\n       Information Model', January 2001.\"\n::= { arcObjects 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcEntry OBJECT-TYPE SYNTAX ArcEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A conceptual row that contains information about an ARC setting of a resource in the system.",
      "ja": "Arcentry Object-Type構文Arcentry Max-Accessアクセス不可能なステータス現在の説明 \"システム内のリソースのアーク設定に関する情報を含む概念的行。"
    },
    {
      "indent": 5,
      "text": "Implementation need to be aware that if the total size of arcIndex and arcNotificationId exceeds 114 sub-IDs, then OIDs of column instances in this table will have more than 128 sub-IDs and cannot be access using SNMPv1, SNMPv2c, or snmpv3.\"",
      "ja": "実装は、ArcindexとArcnotificationIDの合計サイズが114のサブIDを超える場合、この表の列インスタンスのOIDが128を超えるサブIDを持ち、SNMPV1、SNMPV2C、またはSNMPV3を使用してアクセスできないことに注意する必要があります。"
    },
    {
      "indent": 2,
      "text": "INDEX  { arcIndex, arcAlarmType, arcNotificationId }\n::= { arcTable 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "ArcEntry ::=\n  SEQUENCE {\n    arcIndex                      ResourceId,\n    arcAlarmType                  IANAItuProbableCauseOrZero,\n    arcNotificationId             OBJECT IDENTIFIER,\n    arcState                      INTEGER,\n    arcNalmTimeRemaining          Unsigned32,\n    arcRowStatus                  RowStatus,\n    arcStorageType                StorageType\n    }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcIndex OBJECT-TYPE SYNTAX ResourceId MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This object uniquely identifies a resource, which is under the arcState's control for the associated arcAlarmType.",
      "ja": "arcindex object-type syntax resourceid max-accessアクセス不可能なステータス現在の説明 \"このオブジェクトは、関連するarcalarmtypeのアークステートの制御下にあるリソースを一意に識別します。"
    },
    {
      "indent": 2,
      "text": "   For example, if the resource is an interface, this object will\n   point to an instance of interface, e.g., ifIndex.1.\"\n::= { arcEntry 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcAlarmType OBJECT-TYPE SYNTAX IANAItuProbableCauseOrZero MAX-ACCESS not-accessible STATUS current DESCRIPTION \"This object identifies the alarm condition type controlled by the arcState. It specifies the value 0 or a value of IANAItuProbableCause that is applicable to the resource. IANAItuProbableCause is defined in the IANA-ITU-ALARM-TC module in the Alarm MIB document.",
      "ja": "arcalarmtypeオブジェクトタイプ構文Ianaitupuprobablecauseorzero max-access accessable not-accessable current current説明 \"このオブジェクトは、アークステートによって制御されるアラーム条件タイプを識別します。Alarm MIBドキュメントのIANA-ITU-ALARM-TCモジュール。"
    },
    {
      "indent": 2,
      "text": "   The value of zero (0) implies any probable causes that are\n   applicable to the resource.  Usually, the applicable probable\n   causes of a resource are specified in the resource-specific mib.\"\n::= { arcEntry 2 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcNotificationId OBJECT-TYPE\n  SYNTAX  OBJECT IDENTIFIER\n  MAX-ACCESS  not-accessible\n  STATUS  current\n  DESCRIPTION\n    \"This object identifies the type of notification to be suppressed.\n     The notification type identified should be the one normally used\n     by the resource for reporting its alarms.  When the value of 0.0 is\n     specified for this object, it implies all applicable notification\n     types.\"\n  ::= { arcEntry 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcState OBJECT-TYPE\n  SYNTAX  INTEGER {\n            nalm (1),\n            nalmQI (2),\n            nalmTI (3),\n            nalmQICD (4)\n            }\n  MAX-ACCESS  read-create\n  STATUS  current\n  DESCRIPTION\n    \"Defined in M.3100 Amendment 3 [M.3100 Amd3], there are five\n     ARC states: alm, nalm, nalmQI, nalmQICD, and nalmTI.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "alm: Alarm reporting is turned on (i.e., is allowed). nalm: Alarm reporting is turned off (i.e., not allowed). nalmQI: nalm - Qualified Inhibit. Alarm reporting is turned off until the managed entity is qualified problem-free for an optional persistence interval. Problem-free means that the condition corresponding to the specified alarm type is cleared. nalmQICD: nalmQI - Count down. This is a substate of nalmQI and performs the persistence timing countdown function after the managed entity is qualified problem-free. nalmTI: nalm - Timed Inhibit. Alarm reporting is turned off for a specified time interval.",
      "ja": "ALM：アラームレポートがオンになります（つまり、許可されています）。NALM：アラームレポートはオフになります（つまり、許可されていません）。Nalmqi：Nalm-資格のある阻害。オプションの永続性間隔では、マネージドエンティティが問題のない資格のある問題になるまで、アラームレポートがオフになります。問題のないことは、指定されたアラームタイプに対応する条件がクリアされることを意味します。nalmqicd：nalmqi-カウントダウン。これはnalmqiのサブサブ性であり、管理されたエンティティに問題がない資格がある後、持続タイミングカウントダウン機能を実行します。nalmti：nalm-時限阻害。指定された時間間隔では、アラームレポートがオフになります。"
    },
    {
      "indent": 5,
      "text": "alm may transition to nalm, nalmQI or nalmTI by management request.",
      "ja": "ALMは、管理リクエストにより、Nalm、Nalmqi、またはNalmtiに移行する場合があります。"
    },
    {
      "indent": 5,
      "text": "nalm may transition to alm, nalmQI or nalmTI by management request.",
      "ja": "Nalmは、管理リクエストによりALM、Nalmqi、またはNalmtiに移行する場合があります。"
    },
    {
      "indent": 5,
      "text": "nalmQI may transition to nalm or alm by management request.",
      "ja": "Nalmqiは、管理リクエストによりNALMまたはALMに移行する場合があります。"
    },
    {
      "indent": 5,
      "text": "nalmQI may transition to alm automatically if qualified problem-free (if nalmQICD is not supported) or if the CD timer expired (if nalmQICD is supported)",
      "ja": "NALMQIは、資格のない問題がない場合（NALMQICDがサポートされていない場合）、またはCDタイマーが期限切れになった場合（NalmQICDがサポートされている場合）、ALMに自動的に移行する場合があります。"
    },
    {
      "indent": 5,
      "text": "nalmTI may transition to alm or nalm by management request.",
      "ja": "Nalmtiは、管理リクエストによりALMまたはNALMに移行する場合があります。"
    },
    {
      "indent": 5,
      "text": "nalmTI may transition to alm automatically if the TI timer expired.",
      "ja": "Tiタイマーが期限切れになった場合、NalmtiはALMに自動的に移行する場合があります。"
    },
    {
      "indent": 5,
      "text": "Further details of ARC state transitions are defined in Figure 3 of M.3100 Amd3 [M.3100 Amd3].",
      "ja": "ARC状態の遷移の詳細は、M.3100AMD3 [M.3100 AMD3]の図3に定義されています。"
    },
    {
      "indent": 5,
      "text": "According to the requirements in M.3100 Amd3, a resource supporting the ARC feature shall support the alm state and at least one of the nalm, nalmTI, and nalmQI states. The nalmQICD state is an optional substate of nalmQI.",
      "ja": "M.3100 AMD3の要件によれば、ARC機能をサポートするリソースは、ALM状態とNALM、NALMTI、およびNALMQI州の少なくとも1つをサポートするものとします。Nalmqicd状態は、Nalmqiのオプションの物質です。"
    },
    {
      "indent": 5,
      "text": "The arcState object controls the alarm reporting state of a resource. Note that the state alm (alarm reporting is allowed) is not listed in the enumeration of the value of this object. However, this state is implicitly supported by the mib. Once a resource enters the normal reporting mode (i.e., in the alm state) for the specified alarm type, the corresponding row will be automatically deleted from the arc table. Also the manual setting of arcState to alm can be achieved through setting the RowStatus object to 'destroy'.",
      "ja": "アークステートオブジェクトは、リソースのアラームレポート状態を制御します。状態ALM（アラームレポートが許可されている）は、このオブジェクトの値の列挙に記載されていないことに注意してください。ただし、この状態はMIBによって暗黙的にサポートされています。指定されたアラームタイプのリソースが通常のレポートモード（つまり、ALM状態）に入ると、対応する行はARCテーブルから自動的に削除されます。また、ARCSTATEからALMへの手動設定は、RowStatusオブジェクトを「破壊」するように設定することで実現できます。"
    },
    {
      "indent": 5,
      "text": "The nalamQICD state is a transitional state from nalmQI to alm. It is optional depending on the resource type and the implementation of the resource. If it is supported, before the state transitions from nalmQI to alm, a count down period is activated for a duration set by the object arcNalmCDTimeInterval. When the time is up, the arcState transitions to alm.\"",
      "ja": "Nalamqicd状態は、NalmqiからALMへの移行状態です。これは、リソースの種類とリソースの実装に応じてオプションです。状態がNalmqiからALMに移行する前にサポートされている場合、オブジェクトArcnalmcdtimeIntervalによって設定された期間、カウントダウン期間がアクティブになります。時間が経過すると、アークステートはALMに移行します。」"
    },
    {
      "indent": 2,
      "text": "::= { arcEntry 4 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcNalmTimeRemaining OBJECT-TYPE SYNTAX Unsigned32 UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"This variable indicates the time remaining in the nalmTI state or the nalmQICD state, in units of second.",
      "ja": "arcnalmtimeremingオブジェクトタイプのuntax untigned32ユニット \"秒\"最大アクセス読み取りステータス現在の説明 \"この変数は、nalmti状態またはnalmqicd状態に残りの時間を2番目の単位で示します。"
    },
    {
      "indent": 5,
      "text": "At the moment the resource enters the nalmTI state, this variable will have the initial value equal to the value of arcNalmTITimeInterval and then starts decrementing as time goes by.",
      "ja": "リソースがNalmti状態に入る現時点では、この変数はArcnalmtitimeintervalの値に等しい初期値を持ち、時間が経つにつれて減少し始めます。"
    },
    {
      "indent": 5,
      "text": "Similarly at the moment the resource enters the nalmQICD state, this variable will have the initial value equal to the value of arcNalmCDTimeInterval and then starts decrementing as time goes by.",
      "ja": "同様に、リソースがnalmqicd状態に入る現時点では、この変数はArcnalmcdtimeintervalの値に等しい初期値を持ち、時間が経つにつれて減少し始めます。"
    },
    {
      "indent": 5,
      "text": "This variable is read-create and thus will allow the manager to write (extend or shorten), as needed, the remaining time when the resource is in the nalmTI or nalmQICD state.",
      "ja": "この変数は読み取りされているため、マネージャーが必要に応じて、リソースがNALMTIまたはNALMQICD状態にある残りの時間を書き込む（拡張または短縮）することができます。"
    },
    {
      "indent": 2,
      "text": "   If this variable is supported and the resource is currently not in\n   the nalmTI nor nalmQICD state, the value of this variable shall\n   equal to zero.\"\n::= { arcEntry 5 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcRowStatus OBJECT-TYPE SYNTAX RowStatus MAX-ACCESS read-create STATUS current DESCRIPTION \"This columnar object is used for creating and deleting a conceptual row of the arcTable. It is used to create and delete an arc setting.",
      "ja": "ARCROWSTATUSオブジェクトタイプの構文ROWSTATUS MAX-ACCESS READ-CREATEステータス現在の説明 \"この柱状オブジェクトは、ARCTABLの概念的行の作成と削除に使用されます。これは、アーク設定の作成と削除に使用されます。"
    },
    {
      "indent": 5,
      "text": "Setting RowStatus to createAndGo or createAndWait implies creating a new ARC setting for the specified resource and alarm type. Setting RowStatus to destroy implies removing the ARC setting and thus has the effect of resuming normal reporting behaviour of the resource for the alarm type.",
      "ja": "CreateandgoまたはCreateandWaitにRowStatusを設定することは、指定されたリソースとアラームタイプの新しいアーク設定を作成することを意味します。RowStatusを破壊するように設定することは、アーク設定の削除を意味するため、アラームタイプのリソースの通常の報告動作を再開する効果があります。"
    },
    {
      "indent": 2,
      "text": "   Only the objects arcState, arcNalmTimeRemaining, and arcRowStatus\n   can be updated when a row is active. All the objects, except\n   arcNalmTimeRemaining, must be set before the row can be activated.\"\n::= { arcEntry 6 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcStorageType OBJECT-TYPE SYNTAX StorageType MAX-ACCESS read-create STATUS current DESCRIPTION \"The storage type for this conceptual row. Conceptual rows having the value 'permanent' must allow write-access at a minimum to arcState. Note that arcState must allow change by management request. Therefore, no row can be created with 'readOnly'. If a set operation tries to set the value to 'readOnly', then an 'inconsistentValue' error must be returned.\" DEFVAL { nonVolatile }",
      "ja": "arcstorageTypeオブジェクトタイプの構文StorageType Max-Access Read-Createステータス現在の説明「この概念の行のストレージタイプ。値「永続」を持つ概念行は、最低限のアクセスを許可する必要があります。したがって、管理リクエスト。したがって、「readonly」で行を作成することはできません。セット操作が値を「readonly」に設定しようとする場合、「矛盾する値」エラーを返す必要があります。」defval {非揮発性}"
    },
    {
      "indent": 2,
      "text": "::= { arcEntry 7}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "--------------------------\n-- conformance information\n--------------------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcConformance OBJECT IDENTIFIER ::= { arcMibModule 3 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcCompliances OBJECT IDENTIFIER ::= { arcConformance 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"The compliance statement for systems supporting the ARC MIB module.\"",
      "ja": "ARCComplianceモジュールコンプライアンスステータス現在の説明「ARC MIBモジュールをサポートするシステムのコンプライアンスステートメント。」"
    },
    {
      "indent": 2,
      "text": "MODULE -- this module\n         MANDATORY-GROUPS {\n          arcSettingGroup\n         }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "OBJECT arcStorageType\n  WRITE-SYNTAX StorageType {\n                       volatile(2),\n                       nonVolatile(3),\n                       permanent(4)\n                       }\n  DESCRIPTION\n    \"Support for value 'other' is not required.\n     The arcState object must allow change by management\n     request.  Therefore, no row can be created with\n     'readOnly'.\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "GROUP arcTIGroup DESCRIPTION \"This group is REQUIRED for ARC settings that provide the Time Inhibit (TI) function.\"",
      "ja": "グループARCTIROUPの説明「このグループは、時間阻害（TI）関数を提供するARC設定に必要です。」"
    },
    {
      "indent": 2,
      "text": "GROUP arcQICDGroup DESCRIPTION \"This group is REQUIRED for ARC settings that provide the Quality Inhibit (QI) Count Down (CD) function.\"",
      "ja": "グループarcqicdgroupの説明「このグループは、品質阻害（QI）カウントダウン（CD）関数を提供するARC設定に必要です。」"
    },
    {
      "indent": 2,
      "text": "::= { arcCompliances 1 }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcGroups OBJECT IDENTIFIER ::= { arcConformance 2 }\narcSettingGroup OBJECT-GROUP\n  OBJECTS {\n          arcState,\n          arcRowStatus,\n          arcStorageType\n          }\n   STATUS   current\n   DESCRIPTION\n     \"A collection of objects applicable to\n      basic ARC setting.\"\n   ::= { arcGroups 1}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcTIGroup OBJECT-GROUP\n  OBJECTS {\n          arcTITimeInterval,\n          arcNalmTimeRemaining\n          }\n   STATUS   current\n   DESCRIPTION\n     \"A collection of objects applicable to\n      ARC setting that support the Time Inhibit (TI)\n      function.\"\n   ::= { arcGroups 2}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "arcQICDGroup OBJECT-GROUP\n  OBJECTS {\n          arcCDTimeInterval,\n          arcNalmTimeRemaining\n          }\n  STATUS   current\n  DESCRIPTION\n    \"A collection of objects applicable to\n     ARC setting that support the Quality Inhibit (QI)\n     Count Down (CD) function.\"\n  ::= { arcGroups 3}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "END\u0007\u0007\u00076. Security Considerations",
      "ja": "終了6。セキュリティ上の考慮事項"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in this MIB module with a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection can have a negative effect on network operations. These are the tables and objects and their sensitivity/vulnerability:",
      "ja": "このMIBモジュールには、読み取りワイトおよび/またはread-Createの最大アクセス句を備えた管理オブジェクトが多数あります。このようなオブジェクトは、一部のネットワーク環境で敏感または脆弱と見なされる場合があります。適切な保護なしの非セキュア環境でのセット操作のサポートは、ネットワーク操作に悪影響を与える可能性があります。これらはテーブルとオブジェクトであり、その感度/脆弱性です。"
    },
    {
      "indent": 6,
      "text": "arcTITimeInterval, arcCDTimeInterval, arcState, arcNalmTimeRemaining, arcRowStatus, arcStorageType.",
      "ja": "arctitimeinterval、arccdtimeinterval、arcstate、arcnalmtimeremaing、arcrowstatus、arcstorageType。"
    },
    {
      "indent": 3,
      "text": "Setting these objects may have disruptive effects on network operation that range from omission of alarm notifications to flooding of unwanted alarm notifications from the network. The consequence of suppressing or deferring the reporting of an alarm can prevent the timely delivery of important diagnostic information, including information that can help identify an attack.",
      "ja": "これらのオブジェクトの設定は、アラーム通知の省略からネットワークからの不要なアラーム通知の洪水まで、ネットワーク操作に破壊的な影響を与える可能性があります。アラームの報告を抑制または延期した結果、攻撃を特定するのに役立つ情報を含む、重要な診断情報のタイムリーな配信を防ぐことができます。"
    },
    {
      "indent": 3,
      "text": "Some of the readable objects in this MIB module (i.e., objects with a MAX-ACCESS other than not-accessible) may be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. These are the tables and objects and their sensitivity/vulnerability:",
      "ja": "このMIBモジュールの読み取り可能なオブジェクトのいくつか（つまり、アクセスできないこと以外に最大アクセスを備えたオブジェクト）は、一部のネットワーク環境で敏感または脆弱と見なされる場合があります。したがって、これらのオブジェクトへのアクセスを取得および/または通知することさえ制御し、SNMPを介してネットワーク上に送信するときにこれらのオブジェクトの値を暗号化することも重要です。これらはテーブルとオブジェクトであり、その感度/脆弱性です。"
    },
    {
      "indent": 6,
      "text": "arcTITimeInterval, arcCDTimeInterval, arcState, arcNalmTimeRemaining, arcRowStatus, arcStorageType.",
      "ja": "arctitimeinterval、arccdtimeinterval、arcstate、arcnalmtimeremaing、arcrowstatus、arcstorageType。"
    },
    {
      "indent": 3,
      "text": "Reading these objects will provide information about the setting which affects alarm notification generation.",
      "ja": "これらのオブジェクトを読むと、アラーム通知の生成に影響する設定に関する情報が提供されます。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPSec), there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.",
      "ja": "SNMPV3以前のSNMPバージョンには、適切なセキュリティは含まれていませんでした。ネットワーク自体が（たとえばIPSECを使用して）安全である場合でも、セキュアネットワーク上の誰がこのMIBモジュールのオブジェクトにアクセス/セット/セット（読み取り/変更/作成/削除）を許可するかについての制御はありません。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that implementers consider the security features as provided by the SNMPv3 framework (see [RFC3410], section 8), including full support for the SNMPv3 cryptographic mechanisms (for authentication and privacy).",
      "ja": "実装者は、SNMPV3暗号化メカニズム（認証とプライバシー用）の完全なサポートを含む、SNMPV3フレームワーク（[RFC3410]、セクション8を参照）で提供されるセキュリティ機能を考慮することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "ja": "さらに、SNMPV3より前のSNMPバージョンの展開は推奨されません。代わりに、SNMPV3を展開し、暗号化セキュリティを有効にすることをお勧めします。その場合、このMIBモジュールのインスタンスへのアクセスを提供するSNMPエンティティが、実際に取得または設定する正当な権利を持つプリンシパル（ユーザー）にのみオブジェクトにアクセスできるように適切に構成されていることを保証するのは、顧客/オペレーターの責任です（変更を変更します（変更）/作成/削除）それら。"
    },
    {
      "indent": 0,
      "text": "7. Acknowledgements",
      "section_title": true,
      "ja": "7. 謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Brian Teer and Sharon Chisholm for reviewing and commenting on this document.",
      "ja": "著者は、この文書をレビューしてコメントしてくれたブライアン・ティアーとシャロン・チショルムに感謝します。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirements Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, April 1999.",
      "ja": "[RFC2578] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「管理情報の構造バージョン2（SMIV2）」、STD 58、RFC 2578、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Textual Conventions for SMIv2\", STD 58, RFC 2579, April 1999.",
      "ja": "[RFC2579] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「SMIV2のテキストコンベンション」、STD 58、RFC 2579、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Perkins, D., and J. Schoenwaelder, \"Conformance Statements for SMIv2\", STD 58, RFC 2580, April 1999.",
      "ja": "[RFC2580] McCloghrie、K.、Perkins、D。、およびJ. Schoenwaelder、「SMIV2の適合ステートメント」、STD 58、RFC 2580、1999年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC3877] Chisholm, S. and D. Romascanu, \"Alarm Management Information Base (MIB)\", RFC 3877, September 2004.",
      "ja": "[RFC3877] Chisholm、S。およびD. Romascanu、「Alarm Management Information Base（MIB）」、RFC 3877、2004年9月。"
    },
    {
      "indent": 3,
      "text": "[ITUALARMTC] http://www.iana.org/assignments/ianaitualarmtc-mib",
      "ja": "[itualarmtc] http://www.iana.org/assignments/ianaitualarmtc-mib"
    },
    {
      "indent": 3,
      "text": "[M.3100] ITU Recommendation M.3100, \"Generic Network Information Model\", July 1995.",
      "ja": "[M.3100] ITU推奨M.3100、「ジェネリックネットワーク情報モデル」、1995年7月。"
    },
    {
      "indent": 3,
      "text": "[M.3100 Amd3] ITU Recommendation M.3100 Amendment 3, \"Generic Network Information Model\", January 2001.",
      "ja": "[M.3100 AMD3] ITU推奨M.3100修正3、「ジェネリックネットワーク情報モデル」、2001年1月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, December 2002.",
      "ja": "[RFC3410] Case、J.、Mundy、R.、Partain、D。、およびB. Stewart、「インターネット標準管理フレームワークの紹介と適用声明」、RFC 3410、2002年12月。"
    },
    {
      "indent": 0,
      "text": "9. Authors' Addresses",
      "section_title": true,
      "ja": "9. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Hing-Kam Lam Lucent Technologies 101 Crawfords Corner Road, Room 4C-616 Holmdel, NJ 07733 USA",
      "ja": "Hing-Kam Lam Lucent Technologies 101 Crawfords Corner Road、Room 4C-616 Holmdel、NJ 07733 USA"
    },
    {
      "indent": 3,
      "text": "Phone:   +1 732-949-8338\nEMail:   hklam@lucent.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "An-ni Huynh Cetus Networks USA",
      "ja": "An-Ni Huynh Cetus Networks USA"
    },
    {
      "indent": 3,
      "text": "EMail: a_n_huynh@yahoo.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "David T. Perkins 548 Quailbrook Ct San Jose, CA 95110 USA",
      "ja": "デビッドT.パーキンス548 Quailbrook CT San Jose、CA 95110 USA"
    },
    {
      "indent": 3,
      "text": "Phone:   +1 408-394-8702\nEMail:   dperkins@snmpinfo.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "ja": "10. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（c）The Internet Society（2004）。この文書は、BCP 78に含まれる権利、ライセンス、および制限の対象となり、そこに記載されている場合を除き、著者はすべての権利を保持しています。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントとここに含まれる情報は、「現状のまま」に基づいて提供されています。また、貢献者、彼/彼女が代表する組織（もしあれば）が後援する組織、インターネット協会とインターネット工学タスクフォースは、すべての保証、明示的または明示的、またはすべての保証を否認します。本書の情報の使用が、商品性または特定の目的に対する適合性の権利または黙示的な保証を侵害しないという保証を含むがこれらに限定されないことを含む。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、知的財産権またはその他の権利の有効性または範囲に関して、本書に記載されている技術の実装または使用、またはそのような権利に基づくライセンスに基づくライセンスの範囲に関連すると主張される可能性のある他の権利に関しては、立場を取得しません。利用可能になります。また、そのような権利を特定するために独立した努力をしたことも表明していません。RFCドキュメントの権利に関する手順に関する情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IETF事務局に行われたIPR開示のコピーと、利用可能にするライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得するための試みの結果を取得できます。http://www.ietf.org/iprのIETFオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、関心のある当事者に、著作権、特許、または特許出願、またはこの基準を実装するために必要なテクノロジーをカバーする可能性のあるその他の独自の権利を注意深く招待します。ietf-ipr@ietf.orgのIETFへの情報をお問い合わせください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}