{
  "title": {
    "text": "RFC 3596 - DNS Extensions to Support IP Version 6",
    "ja": "RFC 3596 - IPバージョン6をサポートするDNS拡張機能"
  },
  "number": 3596,
  "created_at": "2023-10-18 09:17:40.992284+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                         S. Thomson\nRequest for Comments: 3596                                         Cisco\nObsoletes: 3152, 1886                                         C. Huitema\nCategory: Standards Track                                      Microsoft\n                                                              V. Ksinant\n                                                                   6WIND\n                                                              M. Souissi\n                                                                   AFNIC\n                                                            October 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "DNS Extensions to Support IP Version 6",
      "ja": "IPバージョン6をサポートするDNS拡張機能"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態とステータスについては、「インターネット公式プロトコル標準」（STD 1）の現在のエディションを参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document defines the changes that need to be made to the Domain Name System (DNS) to support hosts running IP version 6 (IPv6). The changes include a resource record type to store an IPv6 address, a domain to support lookups based on an IPv6 address, and updated definitions of existing query types that return Internet addresses as part of additional section processing. The extensions are designed to be compatible with existing applications and, in particular, DNS implementations themselves.",
      "ja": "このドキュメントでは、IPバージョン6（IPv6）を実行しているホストをサポートするために、ドメイン名システム（DNS）に行う必要がある変更を定義します。変更には、IPv6アドレスを保存するためのリソースレコードタイプ、IPv6アドレスに基づいてルックアップをサポートするドメイン、および追加のセクション処理の一部としてインターネットアドレスを返す既存のクエリタイプの定義を更新しました。拡張機能は、既存のアプリケーション、特にDNS実装自体と互換性があるように設計されています。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  New resource record definition and domain. . . . . . . . . . .  2\n    2.1.  AAAA record type . . . . . . . . . . . . . . . . . . . .  3\n    2.2.  AAAA data format . . . . . . . . . . . . . . . . . . . .  3\n    2.3.  AAAA query . . . . . . . . . . . . . . . . . . . . . . .  3\n    2.4.  Textual format of AAAA records . . . . . . . . . . . . .  3\n    2.5.  IP6.ARPA domain. . . . . . . . . . . . . . . . . . . . .  3\n3.  Modifications to existing query types. . . . . . . . . . . . .  4\n4.  Security Considerations. . . . . . . . . . . . . . . . . . . .  4\n5.  IANA Considerations. . . . . . . . . . . . . . . . . . . . . .  4\n   6.  Intellectual Property Statement. . . . . . . . . . . . . . . .  4\nAcknowledgments. . . . . . . . . . . . . . . . . . . . . . . . . .  5\nAppendix A: Changes from RFC 1886. . . . . . . . . . . . . . . . .  6\nNormative References . . . . . . . . . . . . . . . . . . . . . . .  6\nInformative References . . . . . . . . . . . . . . . . . . . . . .  6\nAuthors' Addresses . . . . . . . . . . . . . . . . . . . . . . . .  7\nFull Copyright Statement . . . . . . . . . . . . . . . . . . . . .  8",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Current support for the storage of Internet addresses in the Domain Name System (DNS) [1,2] cannot easily be extended to support IPv6 addresses [3] since applications assume that address queries return 32-bit IPv4 addresses only.",
      "ja": "ドメイン名システム（DNS）[1,2]内のインターネットアドレスの保存の現在のサポートは、IPv6アドレス[3]をサポートするために簡単に拡張できません[3]。"
    },
    {
      "indent": 3,
      "text": "To support the storage of IPv6 addresses in the DNS, this document defines the following extensions:",
      "ja": "DNSのIPv6アドレスのストレージをサポートするために、このドキュメントでは次の拡張機能を定義します。"
    },
    {
      "indent": 6,
      "text": "o A resource record type is defined to map a domain name to an IPv6 address.",
      "ja": "o リソースレコードタイプは、ドメイン名をIPv6アドレスにマッピングするために定義されています。"
    },
    {
      "indent": 6,
      "text": "o A domain is defined to support lookups based on address.",
      "ja": "o ドメインは、アドレスに基づいてルックアップをサポートするために定義されています。"
    },
    {
      "indent": 6,
      "text": "o Existing queries that perform additional section processing to locate IPv4 addresses are redefined to perform additional section processing on both IPv4 and IPv6 addresses.",
      "ja": "o IPv4アドレスを見つけるために追加のセクション処理を実行する既存のクエリが再定義され、IPv4アドレスとIPv6アドレスの両方で追加のセクション処理が実行されます。"
    },
    {
      "indent": 3,
      "text": "The changes are designed to be compatible with existing software. The existing support for IPv4 addresses is retained. Transition issues related to the co-existence of both IPv4 and IPv6 addresses in the DNS are discussed in [4].",
      "ja": "変更は、既存のソフトウェアと互換性があるように設計されています。IPv4アドレスの既存のサポートが保持されます。DNSのIPv4アドレスとIPv6アドレスの両方の共存に関連する遷移の問題については、[4]で説明します。"
    },
    {
      "indent": 3,
      "text": "The IP protocol version used for querying resource records is independent of the protocol version of the resource records; e.g., IPv4 transport can be used to query IPv6 records and vice versa.",
      "ja": "リソースレコードのクエリに使用されるIPプロトコルバージョンは、リソースレコードのプロトコルバージョンとは無関係です。たとえば、IPv4トランスポートを使用してIPv6レコードを照会でき、その逆も同様です。"
    },
    {
      "indent": 3,
      "text": "This document combines RFC 1886 [5] and changes to RFC 1886 made by RFC 3152 [6], obsoleting both. Changes mainly consist in replacing the IP6.INT domain by IP6.ARPA as defined in RFC 3152.",
      "ja": "このドキュメントは、RFC 1886 [5]とRFC 3152 [6]によって作成されたRFC 1886の変更を組み合わせて、両方を廃止します。変更は、主にRFC 3152で定義されているように、IP6.intドメインをIP6.ARPAに置き換えることに構成されています。"
    },
    {
      "indent": 0,
      "text": "2. New resource record definition and domain",
      "section_title": true,
      "ja": "2. 新しいリソースレコードの定義とドメイン"
    },
    {
      "indent": 3,
      "text": "A record type is defined to store a host's IPv6 address. A host that has more than one IPv6 address must have more than one such record.",
      "ja": "レコードタイプは、ホストのIPv6アドレスを保存するために定義されています。複数のIPv6アドレスを持つホストには、そのようなレコードが複数ある必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1 AAAA record type",
      "section_title": true,
      "ja": "2.1 AAAAレコードタイプ"
    },
    {
      "indent": 3,
      "text": "The AAAA resource record type is a record specific to the Internet class that stores a single IPv6 address.",
      "ja": "AAAAリソースレコードタイプは、単一のIPv6アドレスを保存するインターネットクラスに固有のレコードです。"
    },
    {
      "indent": 3,
      "text": "The IANA assigned value of the type is 28 (decimal).",
      "ja": "タイプの値が割り当てられた値は28（小数）です。"
    },
    {
      "indent": 0,
      "text": "2.2 AAAA data format",
      "section_title": true,
      "ja": "2.2 AAAAデータ形式"
    },
    {
      "indent": 3,
      "text": "A 128 bit IPv6 address is encoded in the data portion of an AAAA resource record in network byte order (high-order byte first).",
      "ja": "128ビットIPv6アドレスは、AAAAリソースレコードのデータ部分でネットワークバイトの順序でエンコードされます（最初に高次バイト）。"
    },
    {
      "indent": 0,
      "text": "2.3 AAAA query",
      "section_title": true,
      "ja": "2.3 AAAAクエリ"
    },
    {
      "indent": 3,
      "text": "An AAAA query for a specified domain name in the Internet class returns all associated AAAA resource records in the answer section of a response.",
      "ja": "インターネットクラスの指定されたドメイン名のAAAAクエリは、応答の回答セクションに関連するすべてのAAAAリソースレコードを返します。"
    },
    {
      "indent": 3,
      "text": "A type AAAA query does not trigger additional section processing.",
      "ja": "タイプAAAAクエリは、追加のセクション処理をトリガーしません。"
    },
    {
      "indent": 0,
      "text": "2.4 Textual format of AAAA records",
      "section_title": true,
      "ja": "2.4 AAAAレコードのテキスト形式"
    },
    {
      "indent": 3,
      "text": "The textual representation of the data portion of the AAAA resource record used in a master database file is the textual representation of an IPv6 address as defined in [3].",
      "ja": "マスターデータベースファイルで使用されるAAAAリソースレコードのデータ部分のテキスト表現は、[3]で定義されているIPv6アドレスのテキスト表現です。"
    },
    {
      "indent": 0,
      "text": "2.5 IP6.ARPA Domain",
      "section_title": true,
      "ja": "2.5 IP6.ARPAドメイン"
    },
    {
      "indent": 3,
      "text": "A special domain is defined to look up a record given an IPv6 address. The intent of this domain is to provide a way of mapping an IPv6 address to a host name, although it may be used for other purposes as well. The domain is rooted at IP6.ARPA.",
      "ja": "特別なドメインは、IPv6アドレスを与えられたレコードを検索するために定義されています。このドメインの目的は、IPv6アドレスをホスト名にマッピングする方法を提供することですが、他の目的にも使用される場合があります。ドメインはIP6.ARPAにルート化されています。"
    },
    {
      "indent": 3,
      "text": "An IPv6 address is represented as a name in the IP6.ARPA domain by a sequence of nibbles separated by dots with the suffix \".IP6.ARPA\". The sequence of nibbles is encoded in reverse order, i.e., the low-order nibble is encoded first, followed by the next low-order nibble and so on. Each nibble is represented by a hexadecimal digit. For example, the reverse lookup domain name corresponding to the address",
      "ja": "IPv6アドレスは、接尾辞「.ip6.arpa」でドットで分離された一連のニブルによってIP6.ARPAドメインの名前として表されます。ニブルのシーケンスは逆の順序でエンコードされます。つまり、低次のニブルが最初にエンコードされ、次に次の低次のニブルなどがエンコードされます。各ナブルは、16進数桁で表されます。たとえば、アドレスに対応する逆ルックアップドメイン名"
    },
    {
      "indent": 7,
      "text": "4321:0:1:2:3:4:567:89ab",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "would be",
      "ja": "だろう"
    },
    {
      "indent": 3,
      "text": "b.a.9.8.7.6.5.0.4.0.0.0.3.0.0.0.2.0.0.0.1.0.0.0.0.0.0.0.1.2.3.4.IP6. ARPA.",
      "ja": "B.A.9.8.7.6.5.0.4.0.0.0.3.0.0.0.2.0.0.0.1.0.0.0.0.0.0.1.2.3.4.IP6。ARPA。"
    },
    {
      "indent": 0,
      "text": "3. Modifications to existing query types",
      "section_title": true,
      "ja": "3. 既存のクエリタイプの変更"
    },
    {
      "indent": 3,
      "text": "All existing query types that perform type A additional section processing, i.e., name server (NS), location of services (SRV) and mail exchange (MX) query types, must be redefined to perform both type A and type AAAA additional section processing. These definitions mean that a name server must add any relevant IPv4 addresses and any relevant IPv6 addresses available locally to the additional section of a response when processing any one of the above queries.",
      "ja": "タイプAの追加セクション処理、つまり名前サーバー（NS）、サービスの場所（SRV）、およびメール交換（MX）クエリタイプを実行するすべての既存のクエリタイプは、タイプAとタイプAAAA追加セクション処理の両方を実行するために再定義する必要があります。これらの定義は、名前サーバーが、上記のクエリのいずれかを処理するときに、関連するIPv4アドレスと、応答の追加セクションでローカルに利用可能な関連するIPv6アドレスを追加する必要があることを意味します。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Any information obtained from the DNS must be regarded as unsafe unless techniques specified in [7] or [8] are used. The definitions of the AAAA record type and of the IP6.ARPA domain do not change the model for use of these techniques.",
      "ja": "[7]または[8]で指定された手法が使用されない限り、DNSから取得した情報は安全でないと見なされる必要があります。AAAAレコードタイプとIP6.ARPAドメインの定義は、これらの手法を使用するためのモデルを変更しません。"
    },
    {
      "indent": 3,
      "text": "So, this specification is not believed to cause any new security problems, nor to solve any existing ones.",
      "ja": "したがって、この仕様は、新しいセキュリティ問題を引き起こしたり、既存の問題を解決したりするとは考えられていません。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are no IANA assignments to be performed.",
      "ja": "実行するIANAの割り当てはありません。"
    },
    {
      "indent": 0,
      "text": "6. Intellectual Property Statement",
      "section_title": true,
      "ja": "6. 知的財産声明"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any intellectual property or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; neither does it represent that it has made any effort to identify any such rights. Information on the IETF's procedures with respect to rights in standards-track and standards-related documentation can be found in BCP-11. Copies of claims of rights made available for publication and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementors or users of this specification can be obtained from the IETF Secretariat.",
      "ja": "IETFは、知的財産またはその他の権利の有効性または範囲に関して、この文書に記載されているテクノロジーの実装または使用に関連すると主張される可能性のある他の権利、またはそのような権利に基づくライセンスがどの程度であるかについての程度に関連する可能性があるという立場はありません。利用可能;また、そのような権利を特定するために努力したことも表明していません。標準トラックおよび標準関連のドキュメントの権利に関するIETFの手順に関する情報は、BCP-11に記載されています。出版のために利用可能にされた権利の請求のコピーと、利用可能になるライセンスの保証、またはこの仕様の実装者またはユーザーによるそのような独自の権利の使用のための一般的なライセンスまたは許可を取得しようとする試みの結果を得ることができますIETF事務局から。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights which may cover technology that may be required to practice this standard. Please address the information to the IETF Executive Director.",
      "ja": "IETFは、関心のある当事者に、この基準を実践するために必要な技術をカバーする可能性のある著作権、特許、または特許出願、またはその他の独自の権利を注意深く招待するよう招待しています。情報をIETFエグゼクティブディレクターに宛ててください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Vladimir Ksinant and Mohsen Souissi would like to thank Sebastien Barbin (IRISA), Luc Beloeil (France Telecom R&D), Jean-Mickael Guerin (6WIND), Vincent Levigneron (AFNIC), Alain Ritoux (6WIND), Frederic Roudaut (IRISA) and G6 group for their help during the RFC 1886 Interop tests sessions.",
      "ja": "ウラジミール・クシナントとモーセン・ソウシーは、セバスチャン・バービン（イリサ）、ルク・ベロエイル（フランス・テレコムR＆D）、ジャン・ミカエル・ゲーリン（6ウィンド）、ヴィンセント・レヴィニャーロン（AFNIC）、アレイン・リトゥー（6ウィンド）、フレデリック・ロード（イリサ）に感謝したいと思います。RFC 1886 Interopテストセッション中の彼らの助けを求めるグループ。"
    },
    {
      "indent": 3,
      "text": "Many thanks to Alain Durand and Olafur Gudmundsson for their support.",
      "ja": "Alain DurandとOlafur Gudmundssonのサポートに感謝します。"
    },
    {
      "indent": 0,
      "text": "Appendix A: Changes from RFC 1886",
      "ja": "付録A：RFC 1886からの変更"
    },
    {
      "indent": 3,
      "text": "The following changes were made from RFC 1886 \"DNS Extensions to support IP version 6\":",
      "ja": "以下の変更は、RFC 1886から「IPバージョン6」をサポートするためのDNS拡張機能から行われました。"
    },
    {
      "indent": 3,
      "text": "- Replaced the \"IP6.INT\" domain by \"IP6.ARPA\". - Mentioned SRV query types in section 3 \"MODIFICATIONS TO EXISTING QUERY TYPES\" - Added security considerations. - Updated references : * From RFC 1884 to RFC 3513 (IP Version 6 Addressing Architecture). * From \"work in progress\" to RFC 2893 (Transition Mechanisms for IPv6 Hosts and Routers). * Added reference to RFC 1886, RFC 3152, RFC 2535 and RFC 2845. - Updated document abstract - Added table of contents - Added full copyright statement - Added IANA considerations section - Added Intellectual Property Statement",
      "ja": "- 「ip6.int」ドメインを「ip6.arpa」に置き換えました。 - セクション3「既存のクエリタイプへの変更」に記載されているSRVクエリタイプ - セキュリティに関する考慮事項が追加されました。 - 更新された参照： * RFC 1884からRFC 3513（IPバージョン6アドレス指定アーキテクチャ）。*「進行中の作業」からRFC 2893（IPv6ホストとルーターの遷移メカニズム）。* RFC 1886、RFC 3152、RFC 2535、RFC 2845への参照を追加しました - 更新されたドキュメント要約 - 追加のテーブルの追加 - 追加の著作権声明の追加 - 追加されたIANA考慮事項セクション"
    },
    {
      "indent": 0,
      "text": "Normative References",
      "ja": "引用文献"
    },
    {
      "indent": 3,
      "text": "[1] Mockapetris, P., \"Domain Names - Concepts and Facilities\", STD 13, RFC 1034, November 1987.",
      "ja": "[1] Mockapetris、P。、「ドメイン名 - 概念と施設」、STD 13、RFC 1034、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[2] Mockapetris, P., \"Domain Names - Implementation and Specification\", STD 13, RFC 1035, November 1987.",
      "ja": "[2] Mockapetris、P。、「ドメイン名 - 実装と仕様」、STD 13、RFC 1035、1987年11月。"
    },
    {
      "indent": 3,
      "text": "[3] Hinden, R. and S. Deering, \"Internet Protocol Version 6 (IPv6) Addressing Architecture\", RFC 3513, April 2003.",
      "ja": "[3] Hinden、R。and S. Deering、「インターネットプロトコルバージョン6（IPv6）アドレス指定アーキテクチャ」、RFC 3513、2003年4月。"
    },
    {
      "indent": 0,
      "text": "Informative References",
      "ja": "参考引用"
    },
    {
      "indent": 3,
      "text": "[4] Gilligan, R. and E. Nordmark, \"Transition Mechanisms for IPv6 Hosts and Routers\", RFC 2893, August 2000.",
      "ja": "[4] Gilligan、R。およびE. Nordmark、「IPv6ホストとルーターの遷移メカニズム」、RFC 2893、2000年8月。"
    },
    {
      "indent": 3,
      "text": "[5] Thomson, S. and C. Huitema, \"DNS Extensions to support IP version 6\", RFC 1886, December 1995.",
      "ja": "[5] Thomson、S。およびC. Huitema、「IPバージョン6をサポートするDNS拡張」、RFC 1886、1995年12月。"
    },
    {
      "indent": 3,
      "text": "[6] Bush, R., \"Delegation of IP6.ARPA\", BCP 49, RFC 3152, August 2001.",
      "ja": "[6] Bush、R。、「IP6.Arpaの代表団」、BCP 49、RFC 3152、2001年8月。"
    },
    {
      "indent": 3,
      "text": "[7] Eastlake, D., \"Domain Name System Security Extensions\", RFC 2535, March 1999",
      "ja": "[7] イーストレイク、D。、「ドメイン名システムセキュリティエクステンション」、RFC 2535、1999年3月"
    },
    {
      "indent": 3,
      "text": "[8] Vixie, P., Gudmundsson, O., Eastlake, D. and B. Wellington, \"Secret Key Transaction Authentication for DNS (TSIG)\", RFC 2845, May 2000.",
      "ja": "[8] Vixie、P.、Gudmundsson、O.、Eastlake、D。、およびB. Wellington、「DNSのSecret Key Transaction Authentication（TSIG）」、RFC 2845、2000年5月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Susan Thomson Cisco Systems 499 Thornall Street, 8th floor Edison, NJ 08837",
      "ja": "スーザン・トムソン・シスコ・システム499 Thornall Street、8階・エジソン、ニュージャージー08837"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732-635-3086\nEMail:  sethomso@cisco.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Christian Huitema Microsoft Corporation One Microsoft Way Redmond, WA 98052-6399",
      "ja": "Christian Huitema Microsoft Corporation One Microsoft Way Redmond、WA 98052-6399"
    },
    {
      "indent": 3,
      "text": "EMail: huitema@microsoft.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Vladimir Ksinant 6WIND S.A. Immeuble Central Gare - Bat.C 1, place Charles de Gaulle 78180, Montigny-Le-Bretonneux - France",
      "ja": "Vladimir Ksinant 6wind S.A. Imbeuble Central Gare -Bat.c 1、Place Charles de Gaulle 78180、Montigny -le -Bretonneux -France"
    },
    {
      "indent": 3,
      "text": "Phone: +33 1 39 30 92 36\nEMail: vladimir.ksinant@6wind.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Mohsen Souissi AFNIC Immeuble International 2, rue Stephenson, 78181, Saint-Quentin en Yvelines Cedex - France",
      "ja": "Mohsen Souissi Afnic Emeuble International 2、Rue Stephenson、78181、Saint -Quentin en Yvelines Cedex -France"
    },
    {
      "indent": 3,
      "text": "Phone: +33 1 39 30 83 40\nEMail: Mohsen.Souissi@nic.fr",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2003）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会やその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}