{
  "title": {
    "text": "RFC 3835 - An Architecture for Open Pluggable Edge Services (OPES)",
    "ja": "RFC 3835 - オープンプラグイン可能なエッジサービスのためのアーキテクチャ（OPES）"
  },
  "number": 3835,
  "created_at": "2019-10-24 03:03:26.465954+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                          A. Barbir\nRequest for Comments: 3835                                      R. Penno\nCategory: Informational                                  Nortel Networks\n                                                                 R. Chen\n                                                               AT&T Labs\n                                                              M. Hofmann\n                                           Bell Labs/Lucent Technologies\n                                                                H. Orman\n                                               Purple Streak Development\n                                                             August 2004",
      "raw": true
    },
    {
      "indent": 8,
      "text": "An Architecture for Open Pluggable Edge Services (OPES)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004).",
      "ja": "著作権（C）インターネット協会（2004）。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines an architecture that enables the creation of an application service in which a data provider, a data consumer, and zero or more application entities cooperatively implement a data stream service.",
      "ja": "このメモは、協働して、データストリームサービスを実現するアプリケーション・サービスにおけるデータプロバイダ、データコンシューマ、およびゼロまたはそれ以上のアプリケーション・エンティティの作成を可能にするアーキテクチャを定義します。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2 . The Architecture . . . . . . . . . . . . . . . . . . . . . . .  3\n    2.1.  OPES Entities. . . . . . . . . . . . . . . . . . . . . .  3\n          2.1.1.  Data Dispatcher. . . . . . . . . . . . . . . . .  5\n    2.2.  OPES Flows . . . . . . . . . . . . . . . . . . . . . . .  6\n    2.3.  OPES Rules . . . . . . . . . . . . . . . . . . . . . . .  6\n    2.4.  Callout Servers. . . . . . . . . . . . . . . . . . . . .  7\n    2.5.  Tracing Facility . . . . . . . . . . . . . . . . . . . .  8\n3.  Security and Privacy Considerations  . . . . . . . . . . . . .  9\n    3.1.  Trust Domains. . . . . . . . . . . . . . . . . . . . . .  9\n    3.2.  Establishing Trust and Service Authorization . . . . . . 11\n    3.3.  Callout Protocol . . . . . . . . . . . . . . . . . . . . 11\n    3.4.  Privacy. . . . . . . . . . . . . . . . . . . . . . . . . 12\n    3.5.  End-to-end Integrity . . . . . . . . . . . . . . . . . . 12\n4.  IAB Architectural and Policy Considerations for OPES . . . . . 12\n    4.1.  IAB consideration (2.1) One-party Consent. . . . . . . . 12\n    4.2.  IAB consideration (2.2) IP-Layer Communications. . . . . 13\n    4.3.  IAB consideration (3.1 and 3.2) Notification . . . . . . 13\n    4.4.  IAB consideration (3.3) Non-Blocking . . . . . . . . . . 13\n    4.5.  IAB consideration (4.1) URI Resolution . . . . . . . . . 13\n    4.6.  IAB consideration (4.2) Reference Validity . . . . . . . 13\n    4.7.  IAB consideration (4.3) Application Addressing\n          Extensions . . . . . . . . . . . . . . . . . . . . . . . 14\n    4.8.  IAB consideration (5.1) Privacy. . . . . . . . . . . . . 14\n5.  Security Considerations  . . . . . . . . . . . . . . . . . . . 14\n6.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 14\n7.  Summary  . . . . . . . . . . . . . . . . . . . . . . . . . . . 14\n8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 15\n    8.1.  Normative References . . . . . . . . . . . . . . . . . . 15\n    8.2.  Informative References . . . . . . . . . . . . . . . . . 15\n9.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 15\n10. Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . 16\n11. Full Copyright Statement . . . . . . . . . . . . . . . . . . . 17",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "When supplying a data stream service between a provider and a consumer, the need to provision the use of other application entities, in addition to the provider and consumer, may arise. For example, some party may wish to customize a data stream as a service to a consumer. The customization step might be based on the customer's resource availability (e.g., display capabilities).",
      "ja": "提供者と消費者との間のデータストリームサービスを供給する場合、プロビジョニングに必要プロバイダおよび消費者に加えて、他のアプリケーション・エンティティの使用は、生じる可能性があります。例えば、いくつかのパーティーは、消費者へのサービスとして、データ・ストリームをカスタマイズすることもできます。カスタマイズステップは、顧客のリソースの可用性（例えば、表示能力）に基づいてされる可能性があります。"
    },
    {
      "indent": 3,
      "text": "In some cases it may be beneficial to provide a customization service at a network location between the provider and consumer host rather than at one of these endpoints. For certain services performed on behalf of the end-user, this may be the only option of service deployment. In this case, zero or more additional application entities may participate in the data stream service. There are many possible provisioning scenarios which make a data stream service attractive. The OPES Use Cases and Deployment Scenarios [1] document provides examples of OPES services. The document discusses services that modify requests, services that modify responses, and services that create responses. It is recommended that the document on OPES Use Cases and Deployment Scenarios [1] be read before reading this document.",
      "ja": "ある場合には、プロバイダおよび消費者ホストの間ではなく、これらのエンドポイントの1つのネットワーク位置でカスタマイズサービスを提供するために有益であり得ます。エンドユーザーに代わって実行される特定のサービスについては、これは、サービス展開の唯一の選択肢かもしれません。この場合は、ゼロまたはそれ以上の追加のアプリケーション・エンティティがデータ・ストリームのサービスに参加することができます。データ・ストリーム・サービスが魅力的にする多くの可能なプロビジョニング・シナリオがあります。 OPES使用事例や導入シナリオ[1]文書は、OPESサービスの例を示します。文書は、要求、応答を変更するサービス、および応答を作成するサービスを変更するサービスについて説明します。 OPES使用事例と[1]の展開シナリオ上の文書がこの文書を読む前に読むことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "This document presents the architectural components of Open Pluggable Edge Services (OPES) that are needed in order to perform a data stream service. The architecture addresses the IAB considerations described in [2]. These considerations are covered in various parts of the document. Section 2.5 addresses tracing; section 3 addresses security considerations. Section 4 provides a summary of IAB considerations and how the architecture addresses them.",
      "ja": "このドキュメントでは、データ・ストリーム・サービスを実行するために必要とされているオープンプラグイン可能なエッジサービス（OPES）のアーキテクチャコンポーネントを示しています。アーキテクチャは、[2]に記載のIABの考慮事項に対処します。これらの考慮は、文書のさまざまな部分で覆われています。トレースセクション2.5アドレス。セクション3は、セキュリティ上の考慮事項に対処しています。第4節では、IABの考慮の要約を提供し、アーキテクチャは、それらをどのように対処しますか。"
    },
    {
      "indent": 3,
      "text": "The document is organized as follows: Section 2 introduces the OPES architecture. Section 3 discusses OPES security and privacy considerations. Section 4 addresses IAB considerations for OPES. Section 5 discusses security considerations. Section 6 addresses IANA considerations. Section 7 provides a summary of the architecture and the requirements for interoperability.",
      "ja": "次のように文書が構成されています。第2節では、OPESアーキテクチャを導入しています。第3節では、OPESのセキュリティとプライバシーの考慮事項について説明します。第4章アドレスOPESのためのIABの考慮。第5節では、セキュリティ上の考慮事項について説明します。第6節は、IANAの考慮事項に対処しています。第7節は、アーキテクチャと相互運用性のための要件の概要を示します。"
    },
    {
      "indent": 0,
      "text": "2. The Architecture",
      "section_title": true,
      "ja": "2.ザ・アーキテクチャ"
    },
    {
      "indent": 3,
      "text": "The architecture of Open Pluggable Edge Services (OPES) can be described in terms of three interrelated concepts, mainly:",
      "ja": "オープンプラグイン可能なエッジサービス（OPES）のアーキテクチャは、主に、3つの相互概念の観点で説明することができます。"
    },
    {
      "indent": 3,
      "text": "o OPES entities: processes operating in the network;",
      "ja": "OPESエンティティO：ネットワーク内で動作するプロセス。"
    },
    {
      "indent": 3,
      "text": "o OPES flows: data flows that are cooperatively realized by the OPES entities; and,",
      "ja": "O OPESフロー：協力しOPESエンティティによって実現されているデータ・フローを、そして、"
    },
    {
      "indent": 3,
      "text": "o OPES rules: these specify when and how to execute OPES services.",
      "ja": "OPESルールO：これらは、いつ、どのようOPESサービスを実行するために指定します。"
    },
    {
      "indent": 0,
      "text": "2.1. OPES Entities",
      "section_title": true,
      "ja": "2.1。 OPESエンティティ"
    },
    {
      "indent": 3,
      "text": "An OPES entity is an application that operates on a data flow between a data provider application and a data consumer application. OPES entities can be:",
      "ja": "OPESエンティティは、データ・プロバイダ・アプリケーションとデータ・コンシューマ・アプリケーション間のデータフロー上で動作するアプリケーションです。 OPESエンティティは指定できます"
    },
    {
      "indent": 3,
      "text": "o an OPES service application, which analyzes and possibly transforms messages exchanged between the data provider application and the data consumer application;",
      "ja": "分析およびおそらくメッセージは、データ・プロバイダ・アプリケーションとデータ・コンシューマ・アプリケーションとの間で交換変換OPESサービスアプリケーション、O。"
    },
    {
      "indent": 3,
      "text": "o a data dispatcher, which invokes an OPES service application based on an OPES ruleset and application-specific knowledge.",
      "ja": "OPESルールセットと、アプリケーション固有の知識に基づいて、OPESサービスアプリケーションを呼び出すデータディスパッチャ、O。"
    },
    {
      "indent": 3,
      "text": "The cooperative behavior of OPES entities introduces additional functionality for each data flow provided that it matches the OPES rules. In the network, OPES entities reside inside OPES processors. In the current work, an OPES processor MUST include a data dispatcher. Furthermore, the data provider and data consumer applications are not considered as OPES entities.",
      "ja": "OPESエンティティの協調行動は、それがOPESルールに一致することを提供し、各データフローのための追加機能を紹介します。ネットワークでは、OPESエンティティはOPESプロセッサの内部に存在します。現在の研究では、OPESプロセッサはデータ・ディスパッチャを含まなければなりません。さらに、データプロバイダとデータコンシューマアプリケーションは、OPESエンティティとして考慮されていません。"
    },
    {
      "indent": 3,
      "text": "To provide verifiable system integrity (see section 3.1 on trust domains below) and to facilitate deployment of end-to-end encryption and data integrity control, OPES processors MUST be:",
      "ja": "検証システムの整合性を提供する（以下信頼ドメインのセクション3.1を参照）、エンド・ツー・エンドの暗号化及びデータ整合性制御の展開を容易にするために、OPESプロセッサでなければなりません。"
    },
    {
      "indent": 3,
      "text": "o explicitly addressable at the IP layer by the end user (data consumer application). This requirement does not preclude a chain of OPES processors with the first one in the chain explicitly addressed at the IP layer by the end user (data consumer application).",
      "ja": "O明示的にエンドユーザ（データ・コンシューマ・アプリケーション）によってIPレイヤでアドレス指定。この要件は、明示的に、エンドユーザ（データ・コンシューマ・アプリケーション）によってIPレイヤでアドレスさチェーン内の最初のものとOPESプロセッサのチェーンを排除するものではありません。"
    },
    {
      "indent": 3,
      "text": "o consented to by either the data consumer or data provider application. The details of this process are beyond the scope of the current work.",
      "ja": "Oデータ、消費者またはデータプロバイダのアプリケーションのいずれかをすることによってすることに同意。このプロセスの詳細については、現在の仕事の範囲を超えています。"
    },
    {
      "indent": 3,
      "text": "The OPES architecture is largely independent of the protocol that is used by the data provider application and the data consumer application to exchange data. However, this document selects HTTP [3] as the example for the underlying protocol in OPES flows.",
      "ja": "OPESアーキテクチャは、データ・プロバイダ・アプリケーションとデータを交換するデータ・コンシューマ・アプリケーションによって使用されるプロトコルの大部分は無関係です。しかし、この文書は、OPESフローの基礎となるプロトコルの例として、[3] HTTPを選択します。"
    },
    {
      "indent": 0,
      "text": "2.1.1. Data Dispatcher",
      "section_title": true,
      "ja": "2.1.1。データディスパッチャ"
    },
    {
      "indent": 3,
      "text": "Data dispatchers include a ruleset that can be compiled from several sources and MUST resolve into an unambiguous result. The combined ruleset enables an OPES processor to determine which service applications to invoke for which data flow. Accordingly, the data dispatcher constitutes an enhanced policy enforcement point, where policy rules are evaluated and service-specific data handlers and state information are maintained, as depicted in Figure 1.",
      "ja": "データディスパッチャは、複数のソースからコンパイルすることができ、明確な結果に解決しなければならないルールセットが含まれています。合わせたルールセットは、データ・フローのために起動するサービスアプリケーションを決定するOPESプロセッサを可能にします。したがって、データ・ディスパッチャは、ポリシールールが評価され、図1に示すように、サービス固有のデータ・ハンドラーと状態情報が、維持されている拡張ポリシー施行ポイントを構成します。"
    },
    {
      "indent": 9,
      "text": "                               +----------+\n                               |  callout |\n                               |  server  |\n                               +----------+\n                                    ||\n                                    ||\n                                    ||\n                                    ||\n                +--------------------------+\n                | +-----------+     ||     |\n                | |   OPES    |     ||     |\n                | |  service  |     ||     |\n                | |application|     ||     |\n                | +-----------+     ||     |\n                | +----------------------+ |\nOPES flow <---->| | data dispatcher and  | |<----> OPES flow\n                | | policy enforcement   | |\n                | +----------------------+ |\n                |           OPES           |\n                |         processor        |\n                +--------------------------+",
      "raw": true
    },
    {
      "indent": 26,
      "text": "Figure 1: Data Dispatchers",
      "ja": "図1：データディスパッチャ"
    },
    {
      "indent": 3,
      "text": "The architecture allows for more than one policy enforcement point to be present on an OPES flow.",
      "ja": "アーキテクチャは、OPESフロー上に存在する複数のポリシー施行ポイントを可能にします。"
    },
    {
      "indent": 0,
      "text": "2.2. OPES Flows",
      "section_title": true,
      "ja": "2.2。 OPESフロー"
    },
    {
      "indent": 3,
      "text": "An OPES flow is a cooperative undertaking between a data provider application, a data consumer application, zero or more OPES service applications, and one or more data dispatchers.",
      "ja": "OPESフローは、データ・プロバイダ・アプリケーション、データ・コンシューマ・アプリケーション、ゼロ以上OPESサービスアプリケーション、および1つまたは複数のデータ・ディスパッチャ間の協同作業です。"
    },
    {
      "indent": 3,
      "text": "Since policies are enforced by data dispatchers, the presence of at least one data dispatcher is required in the OPES flow.",
      "ja": "ポリシーがデータ・ディスパッチャによって実施されているので、少なくとも一つのデータ・ディスパッチャの存在はOPESフローで必要とされます。"
    },
    {
      "indent": 4,
      "text": "data OPES OPES data consumer processor A processor N provider",
      "ja": "データOPES OPESデータコンシューマプロセッサプロセッサNプロバイダ"
    },
    {
      "indent": 4,
      "text": "+-----------+    +-----------+  .  +-----------+    +-----------+\n|   data    |    |  OPES     |  .  |  OPES     |    |   data    |\n| consumer  |    | service   |  .  | service   |    | provider  |\n|application|    |application|  .  |application|    |application|\n+-----------+    +-----------+  .  +-----------+    +-----------+\n|           |    |           |  .  |           |    |           |\n|   HTTP    |    |    HTTP   |  .  |    HTTP   |    |   HTTP    |\n|           |    |           |  .  |           |    |           |\n+-----------+    +-----------+  .  +-----------+    +-----------+\n|  TCP/IP   |    |   TCP/IP  |  .  |   TCP/IP  |    |  TCP/IP   |\n+-----------+    +-----------+  .  +-----------+    +-----------+\n     ||             ||    ||    .       ||    ||         ||\n     ================      =====.========      ===========",
      "raw": true
    },
    {
      "indent": 9,
      "text": "| <----------------- OPES flow -------------------> |",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Figure 2: An OPES flow",
      "ja": "図2：OPESフロー"
    },
    {
      "indent": 3,
      "text": "Figure 2 depicts two data dispatchers that are present in the OPES flow. The architecture allows for one or more data dispatchers to be present in any flow.",
      "ja": "図2は、OPES流中に存在する二つのデータディスパッチャを示します。一つ以上のデータ・ディスパッチャは、任意の流れの中に存在するためのアーキテクチャを可能にします。"
    },
    {
      "indent": 0,
      "text": "2.3. OPES Rules",
      "section_title": true,
      "ja": "2.3。 OPESルール"
    },
    {
      "indent": 3,
      "text": "OPES' policy regarding services and the data provided to them is determined by a ruleset consisting of OPES rules. The rules consist of a set of conditions and related actions. The ruleset is the superset of all OPES rules on the processor. The OPES ruleset determines which service applications will operate on a data stream. In this model, all data dispatchers are invoked for all flows.",
      "ja": "サービスやそれらに提供されたデータに関するOPESの方針は、OPESルールから成るルールセットによって決定されます。ルールは条件と関連アクションのセットで構成されています。ルールセットは、プロセッサ上のすべてのOPESルールのスーパーセットです。 OPESルールセットは、アプリケーションがデータストリーム上で動作するサービスを決定します。このモデルでは、すべてのデータのディスパッチャは、すべてのフローのために呼び出されます。"
    },
    {
      "indent": 3,
      "text": "In order to ensure predictable behavior, the OPES architecture requires the use of a standardized schema for the purpose of defining and interpreting the ruleset. The OPES architecture does not require a mechanism for configuring a ruleset into a data dispatcher. This is treated as a local matter for each implementation (e.g., through the use of a text editor or a secure upload protocol), as long as such a mechanism complies with the requirements set forth in section 3.",
      "ja": "予測可能な動作を確保するために、OPESアーキテクチャは、ルールセットを定義し、解釈のために標準化されたスキーマを使用する必要があります。 OPESアーキテクチャは、データのディスパッチャにルールセットを設定するためのメカニズムを必要としません。これは限り、このような機構は、セクション3に記載の要件に準拠したように、（例えば、テキストエディタまたはセキュアアップロードプロトコルの使用を介して）各実施のためにローカルの問題として扱われます。"
    },
    {
      "indent": 0,
      "text": "2.4. Callout Servers",
      "section_title": true,
      "ja": "2.4。コールアウトサーバー"
    },
    {
      "indent": 3,
      "text": "The evaluation of the OPES ruleset determines which service applications will operate on a data stream. How the ruleset is evaluated is not the subject of the architecture, except to note that it MUST result in the same unambiguous result in all implementations.",
      "ja": "OPESルールセットの評価は、サービスアプリケーションがデータストリーム上で動作するかを決定します。ルールセットが評価されてどのように、それはすべての実装で同じ明確な結果をもたらさなければなりませんことに注意することを除いて、アーキテクチャの対象ではありません。"
    },
    {
      "indent": 3,
      "text": "In some cases it may be useful for the OPES processor to distribute the responsibility of service execution by communicating with one or more callout servers. A data dispatcher invokes the services of a callout server by using the OPES callout protocol (OCP). The requirements for the OCP are given in [5]. The OCP is application-agnostic, being unaware of the semantics of the encapsulated application protocol (e.g., HTTP). However, the data dispatcher MUST incorporate a service aware vectoring capability that parses the data flow according to the ruleset and delivers the data to either the local or remote OPES service application.",
      "ja": "OPESプロセッサは、1つまたは複数のコールアウトサーバと通信することにより、サービス実行の責任を分配するためのいくつかのケースでは、有用である可能性があります。データディスパッチャはOPESコールアウトプロトコル（OCP）を使用してコールアウトサーバのサービスを呼び出します。 OCPのための要件は、[5]に記載されています。 OCPは、カプセル化されたアプリケーションプロトコル（例えば、HTTP）のセマンティクスを知らないこと、アプリケーションに依存しないです。しかし、データ・ディスパッチャは、ルールセットに従ってデータフローを解析し、ローカルまたはリモートのOPESサービス・アプリケーションにデータを配信するサービス認識ベクタ機能を組み込まなければなりません。"
    },
    {
      "indent": 3,
      "text": "The general interaction situation is depicted in Figure 3, which illustrates the positions and interaction of different components of OPES architecture.",
      "ja": "一般的な相互作用状況は位置とOPESアーキテクチャの異なるコンポーネントの相互作用を示す図3に示されています。"
    },
    {
      "indent": 1,
      "text": "  +--------------------------+\n  | +-----------+            |\n  | |   OPES    |            |\n  | |  service  |            |      +---------------+     +-----------+\n  | |application|            |      | Callout       |     | Callout   |\n  | +-----------+            |      | Server A      |     | Server X  |\n  |     ||                   |      | +--------+    |     |           |\n  | +----------------------+ |      | | OPES   |    |     |           |\n  | |     data dispatcher  | |      | | Service|    |     | +--------+|\n  | +----------------------+ |      | | Appl A |    |     | | OPES   ||\n  |      ||           ||     |      | +--------+    |     | |Service ||\n  |  +---------+  +-------+  |      |     ||        |     | | Appl X ||\n  |  |  HTTP   |  |       |  |      | +--------+    | ... | +--------||\n  |  |         |  |  OCP  |=========| | OCP    |    |     |    ||     |\n  |  +---------+  +-------+  |      | +--------+    |     | +------+  |\n  |  |         |     ||      |      +---------------+     | | OCP  |  |\n  |  | TCP/IP  |     =======================================|      |  |\n  |  |         |             |                            | +------+  |\n  |  +---------+             |                            +-----------+\n  +--------||-||-------------+\n           || ||\n+--------+ || ||                                       +--------+\n|data    |==  =========================================|data    |\n|producer|                                             |consumer|\n+--------+                                             +--------+",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Figure 3: Interaction of OPES Entities",
      "ja": "図3：OPESエンティティの相互作用"
    },
    {
      "indent": 0,
      "text": "2.5. Tracing Facility",
      "section_title": true,
      "ja": "2.5。トレース機能"
    },
    {
      "indent": 3,
      "text": "The OPES architecture requires that each data dispatcher provides tracing facilities that allow the appropriate verification of its operation. The OPES architecture requires that tracing be feasible on the OPES flow, per OPES processor, using in-band annotation. One of those annotations could be a URI with more detailed information on the OPES services being executed in the OPES flow.",
      "ja": "OPESアーキテクチャは、各データ・ディスパッチャは、その動作の適切な検証を可能にするトレース機能を提供することを必要とします。 OPESアーキテクチャは、トレースは、帯域内の注釈を使用して、OPESプロセッサごとに、OPESフローで実現可能であることを必要とします。これらのアノテーションの一つは、OPESフローで実行されているOPESサービスに関するより詳細な情報をURIである可能性があります。"
    },
    {
      "indent": 3,
      "text": "Providing the ability for in-band annotation MAY require header extensions on the application protocol that is used (e.g., HTTP). However, the presence of an OPES processor in the data request/ response flow SHALL NOT interfere with the operations of non-OPES aware clients and servers. Non-OPES clients and servers need not support these extensions to the base protocol.",
      "ja": "帯域内の注釈のための能力を提供する（例えば、HTTP）が使用されるアプリケーションプロトコルにヘッダ拡張を必要とする場合があります。しかし、データの要求/応答フロー内OPESプロセッサの存在は、非OPES対応クライアントとサーバーの操作を妨害してはなりません。非OPESクライアントとサーバは基本プロトコルにこれらの拡張機能をサポートする必要はありません。"
    },
    {
      "indent": 3,
      "text": "OPES processors MUST obey tracing, reporting, and notification requirements set by the center of authority in the trust domain to which an OPES processor belongs. As part of these requirements, the OPES processor may be instructed to reject or ignore such requirements that originate from other trust domains.",
      "ja": "OPESプロセッサは、OPESプロセッサが属する信頼ドメインにおける権威の中心部で設定された通知の要件追跡、レポート、およびに従わなければなりません。これらの要件の一部として、OPESプロセッサは拒否または他の信頼ドメインに由来し、このような要求を無視するように指示することができます。"
    },
    {
      "indent": 0,
      "text": "3. Security and Privacy Considerations",
      "section_title": true,
      "ja": "3.セキュリティとプライバシーの考慮事項"
    },
    {
      "indent": 3,
      "text": "Each data flow MUST be secured in accordance with several policies. The primary stakeholders are the data consumer and the data provider. The secondary stakeholders are the entities to which they may have delegated their trust. The other stakeholders are the owners of the callout servers. Any of these parties may be participants in the OPES flow.",
      "ja": "各データフローは、いくつかの方針に従って確保されなければなりません。主要な利害関係者は、データコンシューマとデータプロバイダです。二次利害関係者は、彼らが彼らの信頼を委任した可能性があることを企業です。他の利害関係者は、コールアウトサーバの所有者です。これらの当事者のいずれかがOPESフローの参加者かもしれません。"
    },
    {
      "indent": 3,
      "text": "These parties MUST have a model, explicit or implicit, describing their trust policy, which of the other parties are trusted to operate on data, and what security enhancements are required for communication. The trust might be delegated for all data, or it might be restricted to granularity as small as an application data unit.",
      "ja": "これらの当事者が他の当事者のデータを操作するために信頼され、そしてどのようなセキュリティ機能強化が通信するために必要とされる彼らの信頼ポリシーを記述する、モデル、明示的または暗黙的を持たなければなりません。信頼は、すべてのデータのために委任されるかもしれない、またはそれは、アプリケーション・データ・ユニットとして小さなとして粒度に制限されることがあります。"
    },
    {
      "indent": 3,
      "text": "All parties that are involved in enforcing policies MUST communicate the policies to the parties that are involved. These parties are trusted to adhere to the communicated policies.",
      "ja": "執行政策に関与しているすべての当事者が関与している関係者にポリシーを通信する必要があります。これらの当事者は、通信ポリシーに準拠するために信頼されています。"
    },
    {
      "indent": 3,
      "text": "In order to delegate fine-grained trust, the parties MUST convey policy information by implicit contract, by a setup protocol, by a dynamic negotiation protocol, or in-line with application data headers.",
      "ja": "きめ細かな信頼を委任するためには、当事者は、ダイナミックネゴシエーションプロトコルにより、セットアッププロトコルによって、暗黙の契約により、ポリシー情報を伝えなければならない、またはインラインアプリケーションデータヘッダを持ちます。"
    },
    {
      "indent": 0,
      "text": "3.1. Trust Domains",
      "section_title": true,
      "ja": "3.1。トラストドメイン"
    },
    {
      "indent": 3,
      "text": "The delegation of authority starts at either a data consumer or data provider and moves to more distant entities in a \"stepwise\" fashion. Stepwise means A delegates to B, and B delegates to C, and so forth. The entities thus \"colored\" by the delegation are said to form a trust domain with respect to the original delegating party. Here, \"Colored\" means that if the first step in the chain is the data provider, then the stepwise delegation \"colors\" the chain with that data \"provider\" color. The only colors defined are the data \"provider\" and the data \"consumer\". Delegation of authority (coloring) propagates from the content producer start of authority or from the content consumer start of authority, which may be different from the end points in the data flow.",
      "ja": "権限委譲は、データコンシューマまたはデータプロバイダのいずれかから始まり、「段階的」なファッションでより遠くのエンティティに移動します。段階的に等CにBに委任、及びBのデリゲートを意味します。これ委任により「着色」の実体は、元の委任党に対する信頼ドメインを形成するように言われています。ここで、「着色」とは、チェーン内の最初のステップは、データプロバイダがある場合、その後、段階的に委任「色」はデータ「プロバイダ」色のチェーン。定義されている唯一の色は、データ「プロバイダ」とデータ「消費者」です。権限（着色）の代表団は、権限のコンテンツ制作開始から、またはデータフローのエンドポイントでも異なっていてもよい権限のコンテンツ消費者開始から伝播します。"
    },
    {
      "indent": 3,
      "text": "Figure 4 illustrates administrative domains, out-of-band rules, and policy distribution.",
      "ja": "図4は、管理ドメイン、アウトオブバンドルール、ポリシー分布を示します。"
    },
    {
      "indent": 1,
      "text": "provider administrative domain         consumer administrative domain\n+------------------------------+      +-------------------------------+\n| +--------------+             |      |            +--------------+   |\n| |Provider      |      <- out-of-band rules, ->   |Consumer      |   |\n| |Administrative|~~>~~~:  policies and         ~<~|Administrative|   |\n| |Authority     |      : service authorization :  |Authority     |   |\n| +--------------+      :        |     |        :  +--------------+   |\n|         :             :        |     |        :           :         |\n|         :             :        |     |        :           :         |\n|   +----------+        :        |     |        :        +----------+ |\n|   |  callout |    +---------+  |     |  +---------+    |  callout | |\n|   |  server  |====|         |  |     |  |         |====|  server  | |\n|   +----------+    |         |  |     |  |         |    +----------+ |\n|                   | OPES    |  |     |  | OPES    |                 |\n|   +----------+    |processor|  |     |  |processor|   +----------+  |\n|   |          |    |         |  |     |  |         |   |          |  |\n|   | data     |    |         |  |     |  |         |   | data     |  |\n|   | provider |    |         |  |     |  |         |   | consumer |  |\n|   |          |    +---------+  |     |  +---------+   +----------+  |\n|   +----------+     ||     ||   |     |   ||    ||     +----------+  |\n|        ||          ||     ||   |     |   ||    ||         ||        |\n|        =============     =================      ===========         |\n|                               |     |                               |\n+-------------------------------+     +-------------------------------+\n         | <----------------- OPES flow -----------------> |",
      "raw": true
    },
    {
      "indent": 4,
      "text": "Figure 4: OPES administrative domains and policy distribution",
      "ja": "図4：OPES管理ドメインとポリシー配布"
    },
    {
      "indent": 3,
      "text": "In order to understand the trust relationships between OPES entities, each is labeled as residing in an administrative domain. Entities associated with a given OPES flow may reside in one or more administrative domains.",
      "ja": "OPESエンティティ間の信頼関係を理解するために、それぞれが管理ドメインに存在するものとしてラベル付けされます。所与OPESフローに関連付けられたエンティティは、1つ以上の管理ドメイン内に常駐することができます。"
    },
    {
      "indent": 3,
      "text": "An OPES processor may be in several trust domains at any time. There is no restriction on whether the OPES processors are authorized by data consumers and/or data providers. The original party has the option of forbidding or limiting redelegation.",
      "ja": "OPESプロセッサは、いつでも、いくつかの信頼ドメインであってもよいです。 OPESプロセッサがデータコンシューマおよび/またはデータプロバイダによって許可されているかどうかに制限はありません。元当事者は再委任を禁止または制限するオプションがあります。"
    },
    {
      "indent": 3,
      "text": "An OPES processor MUST have a representation of its trust domain memberships that it can report in whole or in part for tracing purposes. It MUST include the name of the party that delegated each privilege to it.",
      "ja": "OPESプロセッサは、それが全体的に又は目的を追跡するための部分で報告することができ、その信頼ドメインメンバーシップの表現を持たなければなりません。それは、各権限を委譲党の名を含める必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2. Establishing Trust and Service Authorization",
      "section_title": true,
      "ja": "3.2。信頼とサービス許可を確立します"
    },
    {
      "indent": 3,
      "text": "The OPES processor will have a configuration policy specifying what privileges the callout servers have and how they are to be identified. OPES uses standard protocols for authentication and other security communication with callout servers.",
      "ja": "OPESプロセッサは、コールアウトサーバが持っているもの権限と、彼らが識別される方法を指定する構成ポリシーを持っています。 OPESは、コールアウトサーバーとの認証およびその他のセキュリティ通信のための標準プロトコルを使用しています。"
    },
    {
      "indent": 3,
      "text": "An OPES processor will have a trusted method for receiving configuration information, such as rules for the data dispatcher, trusted callout servers, primary parties that opt-in or opt-out of individual services, etc.",
      "ja": "OPESプロセッサは、このようなオプトインまたは個別のサービスなどのオプトアウトデータディスパッチャのための規則、信頼されたコールアウトサーバ、主要政党として、コンフィギュレーション情報を受信するための信頼できる方法があります"
    },
    {
      "indent": 3,
      "text": "Protocol(s) for policy/rule distribution are out of scope for this document, but the OPES architecture assumes the existence of such a mechanism.",
      "ja": "ポリシー/ルールの配布のためのプロトコル（単数または複数）はこの文書の範囲外であるが、OPESアーキテクチャは、このようなメカニズムの存在を想定しています。"
    },
    {
      "indent": 3,
      "text": "Requirements for the authorization mechanism are set in a separate document [4].",
      "ja": "認証メカニズムのための要件は、別の文書に設定されている[4]。"
    },
    {
      "indent": 3,
      "text": "Service requests may be done in-band. For example, a request to bypass OPES services could be signalled by a user agent using an HTTP header string \"Bypass-OPES\". Such requests MUST be authenticated. The way OPES entities will honor such requests is subordinate to the authorization policies effective at that moment.",
      "ja": "サービス要求は、インバンドで行うことができます。例えば、OPESサービスをバイパスするための要求は、HTTPヘッダー文字列「バイパスOPES」を使用してユーザエージェントによってシグナリングすることができます。このような要求が認証される必要があります。 OPESエンティティは、そのような要求を尊重する方法は、その時点で効果的な承認ポリシーに従属します。"
    },
    {
      "indent": 0,
      "text": "3.3. Callout Protocol",
      "section_title": true,
      "ja": "3.3。コールアウトプロトコル"
    },
    {
      "indent": 3,
      "text": "The determination of whether or not OPES processors will use the measures that are described in the previous section during their communication with callout servers depends on the details of how the primary parties delegated trust to the OPES processors and the trust relationship between the OPES processors and the callout server. Strong authentication, message authentication codes, and encryption SHOULD be used. If the OPES processors are in a single administrative domain with strong confidentiality and integrity guarantees, then cryptographic protection is recommended but optional.",
      "ja": "OPESプロセッサはコールアウトサーバとの通信中に、前のセクションで説明されている対策を使用するかどうかの決意は、主要政党がOPESプロセッサとOPESプロセッサとの間の信頼関係に信頼を委任する方法の詳細に依存しますコールアウトサーバ。強力な認証、メッセージ認証コード、および暗号化を使用する必要があります。 OPESプロセッサは強い機密性と完全性を保証して、単一の管理ドメインにある場合、暗号保護を推奨しますが、オプションです。"
    },
    {
      "indent": 3,
      "text": "If the delegation mechanism names the trusted parties and their privileges in some way that permits authentication, then the OPES processors will be responsible for enforcing the policy and for using authentication as part of that enforcement.",
      "ja": "委任メカニズムの名前信頼できる関係者とその権限の認証を許可するいくつかの方法であれば、OPESプロセッサは、ポリシーを強制すると、その施行の一環として認証を使用するための責任を負うことになります。"
    },
    {
      "indent": 3,
      "text": "The callout servers MUST be aware of the policy governing the communication path. They MUST not, for example, communicate confidential information to auxiliary servers outside the trust domain.",
      "ja": "コールアウトサーバは、通信経路を管理するポリシーを認識する必要があります。これらは、例えば、信頼ドメイン外の補助サーバに機密情報を通信していないしなければなりません。"
    },
    {
      "indent": 3,
      "text": "A separate security association MUST be used for each channel established between an OPES processor and a callout server. The channels MUST be separate for different primary parties.",
      "ja": "個別のセキュリティアソシエーションは、OPESプロセッサとコールアウトサーバとの間で確立各チャネルのために使用されなければなりません。チャネルは、異なる主要政党のために分離する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.4. Privacy",
      "section_title": true,
      "ja": "3.4。プライバシー"
    },
    {
      "indent": 3,
      "text": "Some data from OPES flow endpoints is considered \"private\" or \"sensitive\", and OPES processors MUST advise the primary parties of their privacy policy and respect the policies of the primary parties. The privacy information MUST be conveyed on a per-flow basis. This can be accomplished by using current available privacy techniques such as P3P [7] and HTTP privacy capabilities.",
      "ja": "OPESフローのエンドポイントからのデータの一部は「プライベート」または「感受性」とみなされ、OPESプロセッサは彼らのプライバシーポリシーの主要政党を助言し、主要政党の政策を尊重しなければなりません。プライバシー情報は、フロー単位で伝えなければなりません。これは、[7]とHTTPプライバシー機能P3Pとして現在入手可能なプライバシー技術を使用することによって達成することができます。"
    },
    {
      "indent": 3,
      "text": "The callout servers MUST also participate in the handling of private data, they MUST be prepared to announce their own capabilities, and enforce the policy required by the primary parties.",
      "ja": "コールアウトサーバは、プライベートデータの取り扱いに参加しなければならない、彼らは自分の能力を発表する準備ができて、および主要関係者によって必要な政策を施行しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.5. End-to-End Integrity",
      "section_title": true,
      "ja": "3.5。エンドツーエンドの整合性"
    },
    {
      "indent": 3,
      "text": "Digital signature techniques can be used to mark data changes in such a way that a third-party can verify that the changes are or are not consistent with the originating party's policy. This requires an inline method to specify policy and its binding to data, a trace of changes and the identity of the party making the changes, and strong identification and authentication methods.",
      "ja": "デジタル署名技術は、サードパーティの変化があるか、発信側の方針と一致していないことを確認できるような方法でデータの変更をマークするために使用することができます。これは、政策とそのデータ、変化の跡や変更を行う当事者の身元、および強力な識別および認証方法への結合を指定するには、インライン方式を必要とします。"
    },
    {
      "indent": 3,
      "text": "Strong end-to-end integrity can fulfill some of the functions required by \"tracing\".",
      "ja": "強力なエンドツーエンドの整合性は、「トレース」で必要とされる機能のいくつかを満たすことができます。"
    },
    {
      "indent": 0,
      "text": "4. IAB Architectural and Policy Considerations for OPES",
      "section_title": true,
      "ja": "OPES 4. IAB建築・ポリシーの考慮事項"
    },
    {
      "indent": 3,
      "text": "This section addresses the IAB considerations for OPES [2] and summarizes how the architecture addresses them.",
      "ja": "このセクションでは、[2] OPESのためのIABの考慮に対処し、アーキテクチャがそれらをどのように対処するかまとめたものです。"
    },
    {
      "indent": 0,
      "text": "4.1. IAB Consideration (2.1) One-Party Consent",
      "section_title": true,
      "ja": "4.1。 IABの考察（2.1）一党の同意"
    },
    {
      "indent": 3,
      "text": "The IAB recommends that all OPES services be explicitly authorized by one of the application-layer end-hosts (that is, either the data consumer application or the data provider application).",
      "ja": "IABは、すべてのOPESサービスが明示的にアプリケーション層のエンドホストの一つ（すなわち、データ・コンシューマ・アプリケーションまたはデータ・プロバイダ・アプリケーションのいずれか）によって認可されることをお勧めします。"
    },
    {
      "indent": 3,
      "text": "The current work requires that either the data consumer application or the data provider application consent to OPES services. These requirements have been addressed in sections 2 (section 2.1) and 3.",
      "ja": "現在の仕事は、データコンシューマ・アプリケーションやOPESサービスへのデータプロバイダアプリケーションの同意のいずれかする必要があります。これらの要件は、セクション2（セクション2.1）と3で対処されてきました。"
    },
    {
      "indent": 0,
      "text": "4.2. IAB Consideration (2.2) IP-Layer Communications",
      "section_title": true,
      "ja": "4.2。 IABの考察（2.2）IP-層通信"
    },
    {
      "indent": 3,
      "text": "The IAB recommends that OPES processors must be explicitly addressed at the IP layer by the end user (data consumer application).",
      "ja": "IABは、OPESプロセッサが明示的にエンドユーザー（データ・コンシューマ・アプリケーション）によってIPレイヤで対処しなければならないことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "This requirement has been addressed in section 2.1, by the requirement that OPES processors be addressable at the IP layer by the data consumer application.",
      "ja": "この要件は、OPESプロセッサは、データ・コンシューマ・アプリケーションによってIPレイヤでアドレス可能要件によって、セクション2.1で対処されてきました。"
    },
    {
      "indent": 0,
      "text": "4.3. IAB Consideration (3.1 and 3.2) Notification",
      "section_title": true,
      "ja": "4.3。 IABの考察（3.1および3.2）の通知"
    },
    {
      "indent": 3,
      "text": "The IAB recommends that the OPES architecture incorporate tracing facilities. Tracing enables data consumer and data provider applications to detect and respond to actions performed by OPES processors that are deemed inappropriate to the data consumer or data provider applications.",
      "ja": "IABは、OPESアーキテクチャは、トレース機能を組み込むことをお勧めします。トレースは、検出したデータコンシューマまたはデータプロバイダアプリケーションに不適切と見なされるOPESプロセッサによって実行されるアクションに応答するデータコンシューマとデータプロバイダアプリケーションを可能にします。"
    },
    {
      "indent": 3,
      "text": "Section 3.2 of this document discusses the tracing and notification facilities that must be supported by OPES services.",
      "ja": "このドキュメントのセクション3.2は、OPESサービスによってサポートされている必要があり追跡および通知機能について説明します。"
    },
    {
      "indent": 0,
      "text": "4.4. IAB Consideration (3.3) Non-Blocking",
      "section_title": true,
      "ja": "4.4。 IAB考察（3.3）非ブロッキング"
    },
    {
      "indent": 3,
      "text": "The OPES architecture requires the specification of extensions to HTTP. These extensions will allow the data consumer application to request a non-OPES version of the content from the data provider application. These requirements are covered in Section 3.2.",
      "ja": "OPESアーキテクチャは、HTTPの拡張機能を指定する必要があります。これらの拡張機能は、データコンシューマ・アプリケーションは、データプロバイダのアプリケーションからのコンテンツの非OPESバージョンを要求することができます。これらの要件は、セクション3.2で説明されています。"
    },
    {
      "indent": 0,
      "text": "4.5. IAB Consideration (4.1) URI Resolution",
      "section_title": true,
      "ja": "4.5。ブリリアント配慮（4.1）URIの解決"
    },
    {
      "indent": 3,
      "text": "This consideration recommends that OPES documentation must be clear in describing OPES services as being applied to the result of URI resolution, not as URI resolution itself.",
      "ja": "この考慮事項は、OPESドキュメンテーションではなく、URI解決自体としてURI解決の結果に適用されているようOPESサービスを説明する際に明確でなければならないことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "This requirement has been addressed in sections 2.5 and 3.2, by requiring OPES entities to document all the transformations that have been performed.",
      "ja": "この要件は、実行されたすべての変換を文書化するOPESエンティティを要求することによって、セクション2.5および3.2で対処されてきました。"
    },
    {
      "indent": 0,
      "text": "4.6. IAB Consideration (4.2) Reference Validity",
      "section_title": true,
      "ja": "4.6。 IABの考察（4.2）参照妥当性"
    },
    {
      "indent": 3,
      "text": "This consideration recommends that all proposed services must define their impact on inter- and intra-document reference validity.",
      "ja": "この考慮事項は、すべての提案のサービスが間および文書内の参照有効性への影響を定義しなければならないことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "This requirement has been addressed in section 2.5 and throughout the document whereby OPES entities are required to document the performed transformations.",
      "ja": "この要件は、セクション2.5およびOPESエンティティを行う変換を文書化するために必要とされる文書全体に対処されてきました。"
    },
    {
      "indent": 0,
      "text": "4.7. IAB Consideration (4.3) Application Addressing Extensions",
      "section_title": true,
      "ja": "4.7。 IABの考察（4.3）アプリケーションのアドレス拡張"
    },
    {
      "indent": 3,
      "text": "This consideration recommends that any OPES services that cannot be achieved while respecting the above two considerations may be reviewed as potential requirements for Internet application addressing architecture extensions, but must not be undertaken as ad hoc fixes.",
      "ja": "この考慮事項は、上記の2点を尊重しながら達成することはできません任意のOPESサービスは、インターネットアプリケーションは、アーキテクチャの拡張に対処するための潜在的な要件として検討することができるが、アドホックの修正として行われてはならないことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "The current work does not require extensions of the Internet application addressing architecture.",
      "ja": "現在の仕事は、アーキテクチャへの対応インターネットアプリケーションの拡張を必要としません。"
    },
    {
      "indent": 0,
      "text": "4.8. IAB Consideration (5.1) Privacy",
      "section_title": true,
      "ja": "4.8。 IABの考察（5.1）プライバシー"
    },
    {
      "indent": 3,
      "text": "This consideration recommends that the overall OPES framework must provide for mechanisms for end users to determine the privacy policies of OPES intermediaries.",
      "ja": "この考慮事項は、全体的なOPESフレームワークは、OPES仲介のプライバシーポリシーを決定するために、エンドユーザーのためのメカニズムを提供しなければならないことをお勧めします。"
    },
    {
      "indent": 3,
      "text": "This consideration has been addressed in section 3.",
      "ja": "この考慮事項は、セクション3で解決されています。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "The proposed work has to deal with security from various perspectives. There are security and privacy issues that relate to data consumer application, callout protocol, and the OPES flow. In [6], there is an analysis of the threats against OPES entities.",
      "ja": "提案された作品は、様々な視点からセキュリティに対処しなければなりません。データコンシューマ・アプリケーション、コールアウト・プロトコル、およびOPESフローに関連するセキュリティやプライバシーの問題があります。 [6]では、OPESエンティティに対する脅威の分析があります。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The proposed work will evaluate current protocols for OCP. If the work determines that a new protocol needs to be developed, then there may be a need to request new numbers from IANA.",
      "ja": "提案された作品は、OCPのための現在のプロトコルを評価します。仕事は新しいプロトコルを開発する必要があると判断した場合は、IANAから新しい番号を要求する必要があるかもしれません。"
    },
    {
      "indent": 0,
      "text": "7. Summary",
      "section_title": true,
      "ja": "7.まとめ"
    },
    {
      "indent": 3,
      "text": "Although the architecture supports a wide range of cooperative transformation services, it has few requirements for interoperability.",
      "ja": "アーキテクチャは、協調的変換サービスの広い範囲をサポートしていますが、それは相互運用性のためにいくつかの要件があります。"
    },
    {
      "indent": 3,
      "text": "The necessary and sufficient elements are specified in the following documents:",
      "ja": "必要かつ十分な要素は、以下の文書で指定されています。"
    },
    {
      "indent": 3,
      "text": "o the OPES ruleset schema, which defines the syntax and semantics of the rules interpreted by a data dispatcher; and,",
      "ja": "データディスパッチャによって解釈ルールの構文と意味論を定義するOPESルールセットスキーマ、O。そして、"
    },
    {
      "indent": 3,
      "text": "o the OPES callout protocol (OCP) [5], which defines the requirements for the protocol between a data dispatcher and a callout server.",
      "ja": "OPESコールアウトプロトコル（OCP）O [5]、データ・ディスパッチャとコールアウトサーバ間のプロトコルのための要件を定義します。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Barbir, A., Burger, E., Chen, R., McHenry, S., Orman, H., and R. Penno, \"Open Pluggable Edge Services (OPES) Use Cases and Deployment Scenarios\", RFC 3752, April 2004.",
      "ja": "[1] Barbir、A.、バーガー、E.、チェン、R.、マクヘンリー、S.、オーマン、H.、およびR. Pennoを、 \"オープンプラグイン可能なエッジサービス（OPES）ケースと展開シナリオを使用する\"、RFC 3752 、2004年4月。"
    },
    {
      "indent": 3,
      "text": "[2] Floyd, S. and L. Daigle, \"IAB Architectural and Policy Considerations for Open Pluggable Edge Services\", RFC 3238, January 2002.",
      "ja": "[2]フロイド、S.とL. Daigle氏、 \"オープン・プラグイン可能なエッジサービスのためのIAB建築・ポリシーに関する注意事項\"、RFC 3238、2002年1月。"
    },
    {
      "indent": 3,
      "text": "[3] Fielding, R., Gettys, J., Mogul, J., Frystyk, H., Masinter, L., Leach, P., and T. Berners-Lee, \"Hypertext Transfer Protocol -- HTTP/1.1\", RFC 2616, June 1999.",
      "ja": "[3]フィールディング、R.、ゲティス、J.、モーグル、J.、Frystyk、H.、Masinter、L.、リーチ、P.、およびT.バーナーズ - リー、 \"ハイパーテキスト転送プロトコル -  HTTP / 1.1\" 、RFC 2616、1999年6月。"
    },
    {
      "indent": 3,
      "text": "[4] Barbir, A., Batuner, O., Beck, A., Chan, T., and H. Orman, \"Policy, Authorization, and Enforcement Requirements of the Open Pluggable Edge Services (OPES)\", RFC 3838, August 2004.",
      "ja": "[4] Barbir、A.、Batuner、O.、ベック、A.、チャン、T.、およびH.オーマン、 \"ポリシー、認可、及びオープンプラグイン可能なエッジサービス（OPES）の施行要件\"、RFC 3838、 2004年8月。"
    },
    {
      "indent": 3,
      "text": "[5] Beck, A., Hofmann, M., Orman, H., Penno, R., and A. Terzis, \"Requirements for Open Pluggable Edge Services (OPES) Callout Protocols\", RFC 3836, August 2004.",
      "ja": "[5]ベック、A.、ホフマン、M.、オーマン、H.、Penno、R.、およびA. Terzis、 \"オープンプラグイン可能なエッジサービスの要件（OPES）コールアウトプロトコル\"、RFC 3836、2004年8月。"
    },
    {
      "indent": 3,
      "text": "[6] Barbir, A., Batuner, O., Srinivas, B., Hofmann, M., and H. Orman, \"Security Threats and Risks for Open Pluggable Edge Services (OPES)\", RFC 3837, August 2004.",
      "ja": "[6] Barbir、A.、Batuner、O.、スリニバス、B.、ホフマン、M.、およびH.オーマン、 \"オープン・プラグイン可能なエッジサービスのセキュリティ脅威とリスク（OPES）\"、RFC 3837、2004年8月。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[7] Cranor, L. et. al, \"The Platform for Privacy Preferences 1.0 (P3P1.0) Specification\", W3C Recommendation 16 http://www.w3.org/TR/2002/REC-P3P-20020416/, April 2002.",
      "ja": "[7] Cranor、L.ら。アル、W3C勧告16 http://www.w3.org/TR/2002/REC-P3P-20020416/、2002年4月 \"プライバシー設定1.0（P3P1.0）仕様のためのプラットフォーム\"。"
    },
    {
      "indent": 0,
      "text": "9. Acknowledgements",
      "section_title": true,
      "ja": "9.謝辞"
    },
    {
      "indent": 3,
      "text": "This document is the product of OPES WG. Oskar Batuner (Independent consultant) and Andre Beck (Lucent) are additional authors that have contributed to this document.",
      "ja": "この文書は、OPES WGの製品です。オスカーBatuner（独立コンサルタント）とアンドレ・ベック（ルーセント）は、この文書に貢献した追加の作者です。"
    },
    {
      "indent": 3,
      "text": "Earlier versions of this work were done by Gary Tomlinson (The Tomlinson Group) and Michael Condry (Intel).",
      "ja": "この作品の以前のバージョンは、ゲイリー・トムリンソン（トムリンソングループ）とマイケル・Condry（インテル）によって行われました。"
    },
    {
      "indent": 3,
      "text": "The authors gratefully acknowledge the contributions of: John Morris, Mark Baker, Ian Cooper and Marshall T. Rose.",
      "ja": "ジョン・モリス、マーク・ベイカー、イアン・クーパーとマーシャルT.ローズ：著者は感謝の貢献を認めます。"
    },
    {
      "indent": 0,
      "text": "10. Authors' Addresses",
      "section_title": true,
      "ja": "10.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Abbie Barbir Nortel Networks 3500 Carling Avenue Nepean, Ontario K2H 8E9 Canada",
      "ja": "アビーBarbir Nortel Networksの3500カーリングアベニューオタワ、オンタリオK2H 8E9カナダ"
    },
    {
      "indent": 3,
      "text": "Phone: +1 613 763 5229 EMail: abbieb@nortelnetworks.com",
      "ja": "電話：+1 613 763 5229 Eメール：abbieb@nortelnetworks.com"
    },
    {
      "indent": 3,
      "text": "Yih-Farn Robin Chen AT&T Labs - Research 180 Park Avenue Florham Park, NJ 07932 US",
      "ja": "儀-Farnロビン・チェンAT＆T研究所 - 研究180パークアベニューフローラムパーク、NJ 07932米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 973 360 8653 EMail: chen@research.att.com",
      "ja": "電話：+1 973 360 8653 Eメール：chen@research.att.com"
    },
    {
      "indent": 3,
      "text": "Markus Hofmann Bell Labs/Lucent Technologies Room 4F-513 101 Crawfords Corner Road Holmdel, NJ 07733 US",
      "ja": "マーカス・ホフマンベル研究所/ルーセント・テクノロジーズルーム4F-513 101 Crawfordsコーナー道路ホルムデル、NJ 07733米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1 732 332 5983 EMail: hofmann@bell-labs.com",
      "ja": "電話：+1 732 332 5983 Eメール：hofmann@bell-labs.com"
    },
    {
      "indent": 3,
      "text": "Hilarie Orman Purple Streak Development",
      "ja": "ヒラリーオーマンパープルストリーク開発"
    },
    {
      "indent": 3,
      "text": "EMail: ho@alum.mit.edu",
      "ja": "メールアドレス：ho@alum.mit.edu"
    },
    {
      "indent": 3,
      "text": "Reinaldo Penno Nortel Networks 600 Technology Park Drive Billerica, MA 01821 USA",
      "ja": "レイナルドPenno Nortel Networksの600テクノロジーパークドライブビレリカ、MA 01821 USA"
    },
    {
      "indent": 3,
      "text": "EMail: rpenno@nortelnetworks.com",
      "ja": "メールアドレス：rpenno@nortelnetworks.com"
    },
    {
      "indent": 0,
      "text": "11. Full Copyright Statement",
      "section_title": true,
      "ja": "11.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2004). This document is subject to the rights, licenses and restrictions contained in BCP 78, and except as set forth therein, the authors retain all their rights.",
      "ja": "著作権（C）インターネット協会（2004）。この文書では、BCP 78に含まれる権利と許可と制限の適用を受けており、その中の記載を除いて、作者は彼らのすべての権利を保有します。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein are provided on an \"AS IS\" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とCONTRIBUTOR「そのまま」、ORGANIZATION HE / SHEが表すまたはインターネットソサエティおよびインターネット・エンジニアリング・タスク・フォース放棄すべての保証、明示または、（もしあれば）後援ISに設けられています。黙示、情報の利用は、特定の目的に対する権利または商品性または適合性の黙示の保証を侵害しない任意の保証含むがこれらに限定されません。"
    },
    {
      "indent": 0,
      "text": "Intellectual Property",
      "ja": "知的財産"
    },
    {
      "indent": 3,
      "text": "The IETF takes no position regarding the validity or scope of any Intellectual Property Rights or other rights that might be claimed to pertain to the implementation or use of the technology described in this document or the extent to which any license under such rights might or might not be available; nor does it represent that it has made any independent effort to identify any such rights. Information on the procedures with respect to rights in RFC documents can be found in BCP 78 and BCP 79.",
      "ja": "IETFは、本書またはそのような権限下で、ライセンスがたりないかもしれない程度に記載された技術の実装や使用に関係すると主張される可能性があります任意の知的財産権やその他の権利の有効性または範囲に関していかなる位置を取りません利用可能です。またそれは、それがどのような権利を確認する独自の取り組みを行ったことを示すものでもありません。 RFC文書の権利に関する手続きの情報は、BCP 78およびBCP 79に記載されています。"
    },
    {
      "indent": 3,
      "text": "Copies of IPR disclosures made to the IETF Secretariat and any assurances of licenses to be made available, or the result of an attempt made to obtain a general license or permission for the use of such proprietary rights by implementers or users of this specification can be obtained from the IETF on-line IPR repository at http://www.ietf.org/ipr.",
      "ja": "IPRの開示のコピーが利用できるようにIETF事務局とライセンスの保証に行われた、または本仕様の実装者または利用者がそのような所有権の使用のための一般的なライセンスまたは許可を取得するために作られた試みの結果を得ることができますhttp://www.ietf.org/iprのIETFのオンラインIPRリポジトリから。"
    },
    {
      "indent": 3,
      "text": "The IETF invites any interested party to bring to its attention any copyrights, patents or patent applications, or other proprietary rights that may cover technology that may be required to implement this standard. Please address the information to the IETF at ietf-ipr@ietf.org.",
      "ja": "IETFは、その注意にこの標準を実装するために必要とされる技術をカバーすることができる任意の著作権、特許または特許出願、またはその他の所有権を持ってすべての利害関係者を招待します。 ietf-ipr@ietf.orgのIETFに情報を記述してください。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "了承"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}