{
  "title": {
    "text": "RFC 3043 - The Network Solutions Personal Internet Name (PIN): A URN Namespace for People and Organizations",
    "ja": "RFC 3043 - ネットワークソリューションパーソナルインターネット名（PIN）：人と組織向けのurn名空間"
  },
  "number": 3043,
  "created_at": "2023-12-27 11:18:06.933956+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        M. Mealling\nRequest for Comments: 3043                       Network Solutions, Inc.\nCategory: Informational                                     January 2001",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 2,
      "text": "The Network Solutions Personal Internet Name (PIN): A URN Namespace for People and Organizations",
      "ja": "ネットワークソリューションパーソナルインターネット名（PIN）：人と組織向けのurn名空間"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes a Uniform Resource Name (URN) namespace that is engineered by Network Solutions, Inc. for naming people and organizations.",
      "ja": "このドキュメントでは、人や組織を命名するためのNetwork Solutions、Inc。によって設計されたユニフォームのリソース名（URN）の名前空間について説明しています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "In many cases Network Solutions' maintained directory applications require some unique and persistent way to talk about an individual or organization. For example, white pages style services need to determine if one entry is distinct from another even if some of the data happens to be the same. Also, e-commerce authentication mechanisms needs to identify a user and/or company uniquely and possibly over large spans of time. In many cases a customer relationship can last several decades. Such long term customer relationships can outlast any specific email address, Internet service provider, surname, or possibly even the DNS itself.",
      "ja": "多くの場合、ネットワークソリューションの維持されたディレクトリアプリケーションには、個人または組織について話すためのユニークで永続的な方法が必要です。たとえば、ホワイトページスタイルサービスは、たとえば、データの一部が同じであっても、あるエントリが別のエントリとは異なるかどうかを判断する必要があります。また、eコマース認証メカニズムは、ユーザーおよび/または企業をユニークで、場合によっては大規模な期間にわたって識別する必要があります。多くの場合、顧客関係は数十年続くことがあります。このような長期的な顧客関係は、特定のメールアドレス、インターネットサービスプロバイダー、姓、またはDNS自体を長持ちさせることができます。"
    },
    {
      "indent": 3,
      "text": "The intent for these applications is that they be used and integrated into other, non-NSI maintained applications in much the same way that domain-names that exist in Network Solution's database are primarily used in application that Network Solutions is _not_ involved in. In much the same way that ISBNs are maintained by specific entities but used in widely varying applications, NSI's PIN namespace is intended to be used in many applications where there is a need for a well maintained identifier that names a person or organization.",
      "ja": "これらのアプリケーションの目的は、ネットワークソリューションのデータベースに存在するドメイン名が主にネットワークソリューションが_NOT_に関与するアプリケーションで使用されるのとほぼ同じ方法で、他の非NSI維持アプリケーションに使用および統合されることです。ISBNが特定のエンティティによって維持されているが、広く変化するアプリケーションで使用されるのと同じ方法で、NSIのPIN名空間は、人または組織に名前を付ける適切にメンテナンスされた識別子が必要な多くのアプリケーションで使用されることを目的としています。"
    },
    {
      "indent": 3,
      "text": "A URN namespace is uniquely suited to solve the persistent identification needs of these applications since they are also required to be unique and persistent. The availability of a standardized resolution mechanism makes it possible for other applications to reference and resolve PIN URNs in their own systems in an open, non-proprietary way.",
      "ja": "URNネームスペースは、これらのアプリケーションの永続的な識別ニーズを解決するのにユニークに適しています。また、ユニークで永続的であることも必要です。標準化された解像度メカニズムが可用性により、他のアプリケーションがオープンで非専用の方法で独自のシステムでPIN URNを参照および解決することが可能になります。"
    },
    {
      "indent": 3,
      "text": "This namespace specification is for a formal namespace.",
      "ja": "この名前空間仕様は、正式な名前空間用です。"
    },
    {
      "indent": 0,
      "text": "2. Specification Template",
      "section_title": true,
      "ja": "2. 仕様テンプレート"
    },
    {
      "indent": 3,
      "text": "Namespace ID:",
      "ja": "名前空間ID："
    },
    {
      "indent": 7,
      "text": "\"pin\" requested.",
      "ja": "「ピン」が要求されました。"
    },
    {
      "indent": 3,
      "text": "Registration Information:",
      "ja": "登録情報："
    },
    {
      "indent": 7,
      "text": "Registration Version Number: 1 Registration Date: 2000-09-30",
      "ja": "登録バージョン番号：1登録日：2000-09-30"
    },
    {
      "indent": 3,
      "text": "Declared registrant of the namespace:",
      "ja": "名前空間の登録者を宣言する："
    },
    {
      "indent": 7,
      "text": "Network Solutions 505 Huntmar Park Drive Herndon, VA 22070",
      "ja": "ネットワークソリューション505ハントマーパークドライブハーンドン、VA 22070"
    },
    {
      "indent": 3,
      "text": "Declaration of structure:",
      "ja": "構造の宣言："
    },
    {
      "indent": 7,
      "text": "The structure of the NSS is a flat space of alphanumeric characters which have no knowable structure outside of the context of Network Solutions internal resolver. Future changes to the assignment methods may allow others to assign sub-spaces of the flat namespace but again, this knowledge is only valid internally and should never be inferred or relied upon externally.",
      "ja": "NSSの構造は、ネットワークソリューションの内部解像度のコンテキスト以外で知らない構造を持たない英数字の平坦な空間です。割り当て方法の将来の変更により、他の人はフラットネームスペースのサブスペースを割り当てることができますが、繰り返しますが、この知識は内部的にのみ有効であり、決して推測または依存してはなりません。"
    },
    {
      "indent": 3,
      "text": "Relevant ancillary documentation:",
      "ja": "関連する補助文書："
    },
    {
      "indent": 7,
      "text": "None",
      "ja": "なし"
    },
    {
      "indent": 3,
      "text": "Identifier uniqueness considerations:",
      "ja": "識別子の一意性の考慮事項："
    },
    {
      "indent": 7,
      "text": "Identifiers are assigned by Network Solutions proprietary registration system in a way that guarantees uniqueness. At this time the algorithm is to iterate from the last assigned number by some positive integer. In the future this algorithm may change to incorporate a full range of alphanumeric elements. In either case, the system will compare the newly created identifier with all of the previous ones to ensure that it has not already been assigned.",
      "ja": "識別子は、ネットワークソリューション専用登録システムによって、一意性を保証する方法で割り当てられます。この時点で、アルゴリズムは、いくつかの正の整数によって最後に割り当てられた番号から反復することです。将来的には、このアルゴリズムが変化して、あらゆる範囲の英数字要素を組み込むことができます。どちらの場合でも、システムは新しく作成された識別子を以前のすべてと比較して、まだ割り当てられていないことを確認します。"
    },
    {
      "indent": 3,
      "text": "Identifier persistence considerations:",
      "ja": "識別子の持続性の考慮事項："
    },
    {
      "indent": 7,
      "text": "The assignment process guarantees that names are not reassigned and that the binding between the name and the person or organization is permanent, regardless of any personal name changes, corporate restructuring, death or dissolution.",
      "ja": "割り当てプロセスは、名前が再割り当てされておらず、個人名の変更、企業の再編、死亡、解散に関係なく、名前と個人または組織の間の拘束力が永続的であることを保証します。"
    },
    {
      "indent": 3,
      "text": "Process of identifier assignment:",
      "ja": "識別子割り当てのプロセス："
    },
    {
      "indent": 7,
      "text": "Names are granted via Network Solutions proprietary registration procedures.",
      "ja": "名前は、ネットワークソリューション独自の登録手順を介して付与されます。"
    },
    {
      "indent": 3,
      "text": "Process of identifier resolution:",
      "ja": "識別子解像度のプロセス："
    },
    {
      "indent": 7,
      "text": "PIN URNs are resolved via URN resolvers run by Network Solutions. Since a PIN URN identifies a person or organization, resolving a PIN URN will only be able to return information from an electronic proxy that is merely a representation of the actual person or organization being named.",
      "ja": "ピンURNは、ネットワークソリューションによって実行されるURNリゾルバーを介して解決されます。PIN URNは個人または組織を識別するため、PIN URNの解決は、名前が付けられている実際の個人または組織の単なる表現である電子プロキシから情報を返すことができます。"
    },
    {
      "indent": 3,
      "text": "Rules for Lexical Equivalence:",
      "ja": "語彙の等価性のルール："
    },
    {
      "indent": 7,
      "text": "The entire URN is case-insensitive.",
      "ja": "ur全体は症例に依存しません。"
    },
    {
      "indent": 3,
      "text": "Conformance with URN Syntax:",
      "ja": "urn構文への適合："
    },
    {
      "indent": 7,
      "text": "There are no additional characters reserved.",
      "ja": "予約された追加の文字はありません。"
    },
    {
      "indent": 3,
      "text": "Validation mechanism:",
      "ja": "検証メカニズム："
    },
    {
      "indent": 7,
      "text": "None additional to resolution specified",
      "ja": "指定された解像度に追加されていません"
    },
    {
      "indent": 3,
      "text": "Scope:",
      "ja": "範囲："
    },
    {
      "indent": 7,
      "text": "Global",
      "ja": "グローバル"
    },
    {
      "indent": 0,
      "text": "3. Examples",
      "section_title": true,
      "ja": "3. 例"
    },
    {
      "indent": 3,
      "text": "The following examples are not guaranteed to be real. They are listed for pedagogical reasons only.",
      "ja": "次の例は、現実的であることを保証されていません。それらは教育的な理由でのみリストされています。"
    },
    {
      "indent": 6,
      "text": "URN:pin:bs4321234\nURN:pin:324kj5hkj45\nURN:pin:mm2136",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Since the URNs in this namespace are opaque there are no additional security considerations other than those normally associated with the use and resolution of URNs in general.",
      "ja": "この名前空間のurは不透明であるため、一般的なURNの使用と解像度に通常関連するもの以外に、追加のセキュリティ上の考慮事項はありません。"
    },
    {
      "indent": 3,
      "text": "It is noted however that attempting to resolve a PIN URN through a resolver other than the one provided by Network Solution is error prone. In any case it is not considered authoritative.",
      "ja": "ただし、ネットワークソリューションによって提供されるもの以外のリゾルバーを介してピンURNを解決しようとすると、エラーが発生しやすいことに注意してください。いずれにせよ、それは権威あるとは見なされません。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Moats, R., \"URN Syntax\", RFC 2141, May 1997.",
      "ja": "[1] Moats、R。、「urn構文」、RFC 2141、1997年5月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Michael Mealling Network Solutions, Inc. 505 Huntmar Park Drive Herndon, VA 22070 US",
      "ja": "Michael Mealling Network Solutions、Inc。505 Huntmar Park Drive Herndon、VA 22070 US"
    },
    {
      "indent": 3,
      "text": "Phone: +1 770 935 5492\nEMail: michaelm@netsol.com\nURI:   http://www.netsol.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があり、それについてコメントまたは説明する派生作品、またはその実装を支援することができます。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}