{
  "title": {
    "text": "RFC 3045 - Storing Vendor Information in the LDAP root DSE",
    "ja": "RFC 3045 - LDAPルートDSEにベンダー情報を保存します"
  },
  "number": 3045,
  "created_at": "2023-12-27 07:18:06.904075+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        M. Meredith\nRequest for Comments: 3045                                   Novell Inc.\nCategory: Informational                                     January 2001",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 12,
      "text": "Storing Vendor Information in the LDAP root DSE",
      "ja": "LDAPルートDSEにベンダー情報を保存します"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document specifies two Lightweight Directory Access Protocol (LDAP) attributes, vendorName and vendorVersion that MAY be included in the root DSA-specific Entry (DSE) to advertise vendor-specific information. These two attributes supplement the attributes defined in section 3.4 of RFC 2251.",
      "ja": "このドキュメントは、ベンダー固有の情報を宣伝するためにルートDSA固有のエントリ（DSE）に含まれる可能性のある2つのLightweight Directory Access Protocol（LDAP）属性、VendornameおよびVendorversionを指定します。 これらの2つの属性は、RFC 2251のセクション3.4で定義されている属性を補完します。"
    },
    {
      "indent": 3,
      "text": "The information held in these attributes MAY be used for display and informational purposes and MUST NOT be used for feature advertisement or discovery.",
      "ja": "これらの属性に保持されている情報は、表示および情報提供の目的で使用される場合があり、機能広告や発見に使用してはなりません。"
    },
    {
      "indent": 0,
      "text": "Conventions used in this document",
      "ja": "このドキュメントで使用されている規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2219]",
      "ja": "「必須」、「そうしない」、「必須」、「shall」、「shall \"、\" ingle \"、\" should \"、\" not \"、\" becommended \"、\" bay \"、および「optional」は、[rfc2219]で説明されているように解釈される"
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1. 概要"
    },
    {
      "indent": 3,
      "text": "LDAP clients discover server-specific data--such as available controls, extensions, etc.--by reading the root DSE. See section 3.4 of [RFC2251] for details.",
      "ja": "LDAPクライアントは、ルートDSEを読み取ることにより、利用可能なコントロール、拡張機能など、サーバー固有のデータを発見します。詳細については、[RFC2251]のセクション3.4を参照してください。"
    },
    {
      "indent": 3,
      "text": "For display, information, and limited function discovery, it is desirable to be able to query an LDAP server to determine the vendor name of that server and also to see what version of that vendor's code is currently installed.",
      "ja": "ディスプレイ、情報、および限られた関数の発見については、LDAPサーバーを照会してそのサーバーのベンダー名を決定し、そのベンダーのコードのバージョンが現在インストールされていることを確認できるようにすることが望ましいです。"
    },
    {
      "indent": 0,
      "text": "1.1 Function discovery",
      "section_title": true,
      "ja": "1.1 関数発見"
    },
    {
      "indent": 3,
      "text": "There are many ways in which a particular version of a vendor's LDAP server implementation may be functionally incomplete, or may contain software anomalies. It is impossible to identify every known shortcoming of an LDAP server with the given set of server data advertisement attributes. Furthermore, often times, the anomalies of an implementation are not found until after the implementation has been distributed, deployed, and is in use.",
      "ja": "ベンダーのLDAPサーバーの実装の特定のバージョンが機能的に不完全であるか、ソフトウェアの異常を含む可能性がある多くの方法があります。特定のサーバーデータ広告属性のセットを備えたLDAPサーバーのすべての既知の欠点を特定することは不可能です。さらに、多くの場合、実装の異常は、実装が配布され、展開され、使用されるまでは見つかりません。"
    },
    {
      "indent": 3,
      "text": "The attributes defined in this document MAY be used by client implementations in order to identify a particular server implementation so that it can 'work around' such anomalies.",
      "ja": "このドキュメントで定義されている属性は、特定のサーバーの実装を識別して、そのような異常を「回避」できるようにするために、クライアントの実装で使用できます。"
    },
    {
      "indent": 3,
      "text": "The attributes defined in this document MUST NOT be used to gather information related to supported features of an LDAP implementation. All LDAP features, mechanisms, and capabilities--if advertised--MUST be advertised through other mechanisms, preferably advertisement mechanisms defined in concert with said features, mechanisms, and capabilities.",
      "ja": "このドキュメントで定義されている属性は、LDAP実装のサポートされている機能に関連する情報を収集するために使用してはなりません。すべてのLDAP機能、メカニズム、および機能（宣伝されている場合）は、他のメカニズム、できれば上記の機能、メカニズム、および機能と協調して定義された広告メカニズムを通じて宣伝されます。"
    },
    {
      "indent": 0,
      "text": "2. Attribute Types",
      "section_title": true,
      "ja": "2. 属性タイプ"
    },
    {
      "indent": 3,
      "text": "These attributes are an addition to the Server-specific Data Requirements defined in section 3.4 of [RFC2251]. The associated syntaxes are defined in section 4 of [RFC2252].",
      "ja": "これらの属性は、[RFC2251]のセクション3.4で定義されているサーバー固有のデータ要件に追加されています。関連する構文は、[RFC2252]のセクション4で定義されています。"
    },
    {
      "indent": 3,
      "text": "Servers MAY restrict access to vendorName or vendorVersion and clients MUST NOT expect these attributes to be available.",
      "ja": "サーバーはVendornameまたはVendorversionへのアクセスを制限する場合があり、クライアントはこれらの属性が利用可能になることを期待してはなりません。"
    },
    {
      "indent": 0,
      "text": "2.1 vendorName",
      "section_title": true,
      "ja": "2.1 業者名"
    },
    {
      "indent": 3,
      "text": "This attribute contains a single string, which represents the name of the LDAP server implementer.",
      "ja": "この属性には、LDAPサーバー実装者の名前を表す単一の文字列が含まれています。"
    },
    {
      "indent": 3,
      "text": "All LDAP server implementations SHOULD maintain a vendorName, which is generally the name of the company that wrote the LDAP Server code like \"Novell, Inc.\"",
      "ja": "すべてのLDAPサーバーの実装は、「Novell、Inc。」のようなLDAPサーバーコードを書いた会社の名前であるVendornameを維持する必要があります。"
    },
    {
      "indent": 6,
      "text": "( 1.3.6.1.1.4 NAME 'vendorName' EQUALITY 1.3.6.1.4.1.1466.109.114.1 SYNTAX 1.3.6.1.4.1.1466.115.121.1.15 SINGLE-VALUE NO-USER-MODIFICATION USAGE dSAOperation )",
      "ja": "（1.3.6.1.1.4名「Vendorname 'Equality 1.3.6.1.4.1.1466.109.114.1 Syntax 1.3.6.1.4.1.1466.115.121.1.15」"
    },
    {
      "indent": 0,
      "text": "2.2 vendorVersion",
      "section_title": true,
      "ja": "2.2 ベンダーバージョン"
    },
    {
      "indent": 3,
      "text": "This attribute contains a string which represents the version of the LDAP server implementation.",
      "ja": "この属性には、LDAPサーバーの実装のバージョンを表す文字列が含まれています。"
    },
    {
      "indent": 3,
      "text": "All LDAP server implementations SHOULD maintain a vendorVersion. Note that this value is typically a release value--comprised of a string and/or a string of numbers--used by the developer of the LDAP server product (as opposed to the supportedLDAPVersion, which specifies the version of the LDAP protocol supported by this server). This is single-valued so that it will only have one version value. This string MUST be unique between two versions, but there are no other syntactic restrictions on the value or the way it is formatted.",
      "ja": "すべてのLDAPサーバーの実装は、ベンダーバージョンを維持する必要があります。この値は通常、LDAPサーバー製品の開発者が使用しているリリース値（文字列および/または一連の数字）が使用されていることに注意してください（SupportedLdapversionとは対照的に、このサーバー）。これは単一値であるため、バージョン値が1つしかありません。この文字列は、2つのバージョン間で一意でなければなりませんが、値またはフォーマットの方法に他の構文制限はありません。"
    },
    {
      "indent": 6,
      "text": "( 1.3.6.1.1.5 NAME 'vendorVersion' EQUALITY 1.3.6.1.4.1.1466.109.114.1 SYNTAX 1.3.6.1.4.1.1466.115.121.1.15 SINGLE-VALUE NO-USER-MODIFICATION USAGE dSAOperation )",
      "ja": "（1.3.6.1.1.5名 'ベンダーバージョン'平等1.3.6.1.4.1.1466.109.114.1構文1.3.6.1.4.1.1466.115.121.1.1.15"
    },
    {
      "indent": 3,
      "text": "The intent behind the equality match on vendorVersion is to not allow a less than or greater than type of query. Say release \"LDAPv3 8.0\" has a problem that is fixed in the next release \"LDAPv3 8.5\", but in the mean time there is also an update release say version \"LDAPv3 8.01\" that fixes the problem. This will hopefully stop the client from saying it will not work with a version less than \"LDAPv3 8.5\" when it would also work with \"LDAPv3 8.01\". With the equality match the client would have to exactly match what it is looking for.",
      "ja": "Vendorversionの平等試合の背後にある意図は、クエリのタイプ以下を許可しないことです。「LDAPV3 8.0」のリリースには、次のリリース「LDAPV3 8.5」で修正された問題がありますが、その間に問題を修正するバージョン「LDAPV3 8.01」などの更新リリースもあります。これにより、クライアントが「LDAPV38.01」でも動作する場合、「LDAPV3 8.5」よりも少ないバージョンで動作しないと言うのを止めることができます。平等マッチを使用すると、クライアントが探しているものを正確に一致させる必要があります。"
    },
    {
      "indent": 0,
      "text": "3. Notes to Server Implementers",
      "section_title": true,
      "ja": "3. サーバー実装者へのメモ"
    },
    {
      "indent": 3,
      "text": "Server implementers may consider tying the vendorVersion attribute value to the build mechanism so that it is automatically updated when the version value changes.",
      "ja": "サーバーの実装者は、バージョン値が変更されたときに自動的に更新されるように、ベンダーバージョン属性値をビルドメカニズムに結び付けることを検討する場合があります。"
    },
    {
      "indent": 0,
      "text": "4. Notes to Client Developers",
      "section_title": true,
      "ja": "4. クライアント開発者へのメモ"
    },
    {
      "indent": 3,
      "text": "As mentioned in section 2.1, the use of vendorName and vendorVersion MUST NOT be used to discover features.",
      "ja": "セクション2.1で述べたように、VendornameおよびVendorversionの使用を使用して機能を発見するために使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "It should be noted that an anomalies often on affect subset of implementations reporting the same version information. Most implementations support multiple platforms, have numerous configuration options, and often support plug-ins.",
      "ja": "多くの場合、同じバージョン情報を報告する実装のサブセットに影響を与えることが多いことに注意する必要があります。ほとんどの実装は、複数のプラットフォームをサポートし、多数の構成オプションがあり、多くの場合、プラグインをサポートしています。"
    },
    {
      "indent": 3,
      "text": "Client implementations SHOULD be written in such a way as to accept any value in the vendorName and vendorVersion attributes. If a client implementation does not recognize the specific vendorName or vendorVersion as one it recognizes, then for the purposes of 'working around' anomalies, the client MUST assume that the server is complete and correct. The client MUST work with implementations that do not publish these attributes.",
      "ja": "クライアントの実装は、VendornameおよびVendorversion属性の価値を受け入れるような方法で記述する必要があります。クライアントの実装が特定のVendornameまたはVendorversionを認識しているものとして認識していない場合、「回避」の異常を目的として、クライアントはサーバーが完全かつ正しいと想定する必要があります。クライアントは、これらの属性を公開していない実装で動作する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The vendorName and vendorVersion attributes are provided only as display or informational mechanisms, or as anomaly identifying mechanisms. Client and application implementers must consider that the existence of a given value in the vendorName or vendorVersion attribute is no guarantee that the server was actually built by the asserted vendor or that its version is the asserted version and should act accordingly.",
      "ja": "VendornameおよびVendorversion属性は、ディスプレイまたは情報メカニズム、または異常識別メカニズムとしてのみ提供されます。クライアントとアプリケーションの実装者は、VendornameまたはVendorversion属性に特定の値の存在が、サーバーが実際に主張されたベンダーによって構築されたこと、またはそのバージョンが主張されたバージョンであり、それに応じて行動する必要があることを保証しないことを考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "Server implementers should be aware that this information could be used to exploit a security hole a server provides either by feature or flaw.",
      "ja": "サーバーの実装者は、この情報を使用して、サーバーが機能または欠陥によって提供するセキュリティホールを活用するために使用できることに注意する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document seeks to create two attributes, vendorName and vendorVersion, which the IANA will primarily be responsible. This is a one time effort; there is no need for any recurring assignment after this stage.",
      "ja": "このドキュメントは、VendornameとVendorversionの2つの属性を作成しようとしています。これは、IANAが主に責任を負います。これは一度の努力です。この段階の後、繰り返しの割り当ては必要ありません。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2219] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2219] Bradner、S。、「要件レベルを示すためにRFCで使用するためのキーワード」、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2026] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "ja": "[RFC2026] Bradner、S。、「インターネット標準プロセス - リビジョン3」、BCP 9、RFC 2026、1996年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2251] Wahl, M., Howes, T. and S. Kille, \"Lightweight Directory Access Protocol (v3)\", RFC 2251, December 1997.",
      "ja": "[RFC2251] Wahl、M.、Howes、T。およびS. Killee、「Lightweight Directory Access Protocol（V3）」、RFC 2251、1997年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2252] Wahl, M., Coulbeck, A., Howes, T. and S. Kille, \"Lightweight Directory Access Protocol (v3): Attribute Syntax Definitions\", RFC 2252, December 1997.",
      "ja": "[RFC2252] Wahl、M.、Coulbeck、A.、Howes、T。およびS. Killee、「Lightweight Directory Access Protocol（V3）：属性構文定義」、RFC 2252、1997年12月。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8. 謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank the generous input and review by individuals at Novell including but not limited to Jim Sermersheim, Mark Hinckley, Renea Campbell, and Roger Harrison. Also IETF contributors Kurt Zeilenga, Mark Smith, Mark Wahl, Peter Strong, Thomas Salter, Gordon Good, Paul Leach, Helmut Volpers.",
      "ja": "著者は、Jim Sermersheim、Mark Hinckley、Renea Campbell、およびRoger Harrisonを含むがこれらに限定されない、Novellの個人による寛大な意見とレビューに感謝したいと思います。また、IETFの貢献者Kurt Zeilenga、Mark Smith、Mark Wahl、Peter Strong、Thomas Salter、Gordon Good、Paul Leach、Helmut Volpers。"
    },
    {
      "indent": 0,
      "text": "9. Author's Address",
      "section_title": true,
      "ja": "9. 著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Mark Meredith Novell Inc. 1800 S. Novell Place Provo, UT 84606",
      "ja": "Mark Meredith Novell Inc. 1800 S. Novell Place Provo、UT 84606"
    },
    {
      "indent": 3,
      "text": "Phone: 801-861-2645 EMail: mark_meredith@novell.com",
      "ja": "電話：801-861-2645メール：mark_meredith@novell.com"
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "ja": "10. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書と本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}