{
  "title": {
    "text": "RFC 3601 - Text String Notation for Dial Sequences and Global Switched Telephone Network (GSTN) / E.164 Addresses",
    "ja": "RFC 3601 - ダイヤルシーケンスのためのテキスト文字列の表記とグローバル電話網（GSTN）/ E.164アドレスを交換"
  },
  "number": 3601,
  "created_at": "2019-10-20 02:45:12.528841+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                       C. Allocchio\nRequest for Comments: 3601                                    GARR-Italy\nCategory: Standards Track                                 September 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "       Text String Notation for Dial Sequences and\nGlobal Switched Telephone Network (GSTN) / E.164 Addresses",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements. Please refer to the current edition of the \"Internet Official Protocol Standards\" (STD 1) for the standardization state and status of this protocol. Distribution of this memo is unlimited.",
      "ja": "この文書は、インターネットコミュニティのためのインターネット標準トラックプロトコルを指定し、改善のための議論と提案を要求します。このプロトコルの標準化状態と状態への「インターネット公式プロトコル標準」（STD 1）の最新版を参照してください。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo describes the full set of notations needed to represent a text string in a Dial Sequence. A Dial Sequence is normally composed of Dual Tone Multi Frequency (DTMF) elements, plus separators and additional \"actions\" (such as \"wait for dialtone\", \"pause for N secs\", etc.) which could be needed to successfully establish the connection with the target service: this includes the cases where subaddresses or DTMF menu navigation apply.",
      "ja": "このメモはダイヤルシーケンス内のテキスト文字列を表現するために必要な表記のフルセットを記述する。ダイヤルシーケンスが正常にうまく確立するために必要なことができるデュアルトーン多重周波数（DTMF）素子、プラスセパレータ及び追加の「アクション」（例えば、「ダイヤルトーン待つ」としては、「N秒間一時停止」など）で構成されていますターゲット・サービスとの接続：これはサブアドレスもしくはDTMFメニューナビゲーションは適用例が含まれています。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Since the very first devices interacting with GSTN services appeared, a need for a unique text string representation of commonly called telephone numbers, and more generally DTMF sequences and actions, was foreseen.",
      "ja": "GSTNサービスとの相互作用の非常に最初のデバイスは、一般的に呼ばれる電話番号、およびより一般的にDTMFシーケンスとアクションの固有のテキスト文字列表現の必要性を登場以来、予見されました。"
    },
    {
      "indent": 3,
      "text": "This memo describes the full text string representation method. This specification was explicitly created to provide an easy, unique and complete reference which MUST be used by all other specifications needing a text string representation for a Dial Sequence.",
      "ja": "このメモは、フルテキストの文字列表現方法を説明します。この仕様は、明示的にダイヤルシーケンスのためのテキスト文字列表現を必要とする他のすべての仕様で使用されなければならない、簡単にユニークかつ完全なリファレンスを提供するために作成されました。"
    },
    {
      "indent": 3,
      "text": "The specification was collected directly from Dial Sequence definitions which are already described in existing Standard Track specifications (such as [6] [7] [8] [9]), and is fully synchronized with them. Full compatibility is thus assured, and as a consequence, this specification results in a compendium of existing definitions.",
      "ja": "仕様は既に、完全にそれと同期している（例えば、[6] [7] [8] [9]のような）既存の標準トラック仕様に記載されているダイヤルシーケンスの定義から直接採取しました。完全な互換性は、このように確保され、そして結果として、既存の定義の概論において、本明細書の結果。"
    },
    {
      "indent": 3,
      "text": "This notation is a fully compatible compendium of existing notations, and should be used in all specifications needing a text string representation of a Dial Sequence.",
      "ja": "この表記法は、既存の表記法の完全な互換性大要で、ダイヤルシーケンスのテキスト文字列表現を必要とするすべての仕様で使用されるべきです。"
    },
    {
      "indent": 3,
      "text": "Although the commonly called \"telephone numbers\" are normally used to generate a Dial Sequence when establishing a connection, the full abstract E.164 addresses [2], i.e., the universal addressing on the Global Switched Telephone Network (GSTN), have further elements which cannot be dialled. Thus abstract E.164 addresses cannot be fully converted into a Dial Sequence or fully represented using this notation.",
      "ja": "通称「電話番号」は、通常の接続を確立するときに、ダイヤルシーケンスを生成するために使用され、完全な抽象E.164アドレス[2]、すなわちものの、グローバルに取り組むユニバーサルは、電話網（GSTN）を交換さらなる要素を持っていますこれは、ダイヤルすることができません。したがって抽象E.164アドレスは完全にダイヤルシーケンスに変換することができない、または完全にこの表記を使用して表します。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology and Syntax conventions",
      "section_title": true,
      "ja": "1.1。用語と構文規則"
    },
    {
      "indent": 3,
      "text": "In this document the formal definitions are described using ABNF syntax, as defined in [3]. This memo also uses some of the \"CORE DEFINITIONS\" defined in \"APPENDIX A - CORE\" of that document.",
      "ja": "[3]で定義されるように本書では正式な定義は、ABNF構文を使用して記載されています。その文書の - 「CORE付録A」また、このメモはで定義された「CORE定義」の一部を使用しています。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [4].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14、RFC 2119に記載されるように解釈される[4]。"
    },
    {
      "indent": 3,
      "text": "The following terms are also defined in this document:",
      "ja": "次の用語はまた、この文書で定義されています。"
    },
    {
      "indent": 6,
      "text": "Dial Sequence: a series of DTMF elements and human or device \"actions\";",
      "ja": "シーケンスをダイヤル：DTMF要素およびヒトまたはデバイス「アクション」のシリーズ。"
    },
    {
      "indent": 6,
      "text": "phone-string: a text representation of a Dial Sequence;",
      "ja": "携帯電話文字列：ダイヤルシーケンスのテキスト表現。"
    },
    {
      "indent": 6,
      "text": "GSTN address: a commonly called \"telephone number\" on the GSTN, i.e., a diallable subset of an E.164 abstract address or any private numbering schema diallable address;",
      "ja": "GSTNアドレス：GSTN上の通称「電話番号」、すなわち、E.164抽象アドレスまたはプライベートナンバリングスキーマdiallableアドレスのdiallableサブセット。"
    },
    {
      "indent": 6,
      "text": "gstn-phone: a text representation of a GSTN address;",
      "ja": "GSTN電話：GSTNアドレスのテキスト表現。"
    },
    {
      "indent": 6,
      "text": "subaddr-string: a text representation of a GSTN subaddress (which includes ISDN subaddresses [2] and T.33 subaddresses [5]);",
      "ja": "subaddr列：GSTNサブアドレスのテキスト表現（ISDNのサブアドレスを含む[2]及びT.33のサブアドレス[5]）。"
    },
    {
      "indent": 6,
      "text": "post-dial: a text representation of a post dialling sequence.",
      "ja": "ポストダイヤル：ポストダイヤルシーケンスのテキスト表現。"
    },
    {
      "indent": 0,
      "text": "2. The \"Dial Sequence\" definition",
      "section_title": true,
      "ja": "2.「シーケンスをダイヤル」の定義"
    },
    {
      "indent": 3,
      "text": "The possible elements composing a Dial Sequence can vary from a minimum number, up to a really large and complex collection: in fact, the sequences already needed to dial a gstn-phone, which is a subset of the generic Dial Sequence, well represents this variety and complexity of cases.",
      "ja": "これも表し、実際には、シーケンスが既にGSTN電話をダイヤルするのに必要な、一般的なダイヤルシーケンスのサブセットです：ダイヤルシーケンスを構成可能要素は、最小の数から、アップ本当に大規模で複雑なコレクションに変えることができ例多様性と複雑さ。"
    },
    {
      "indent": 3,
      "text": "In particular, a Dial Sequence is composed by:",
      "ja": "具体的には、ダイヤルシーケンスは、によって構成されています。"
    },
    {
      "indent": 3,
      "text": "- \"DTMF elements\": normally available as \"keys\" on numeric keypads of dialling devices;",
      "ja": " - 「DTMF要素」：ダイヤルデバイスの数字キーパッド上の「鍵」として、通常利用可能。"
    },
    {
      "indent": 3,
      "text": "- \"actions\": normally performed by the agent (human or device) composing the Dial Sequence;",
      "ja": " - 「アクション」：通常エージェント（ヒトまたはデバイス）によって実行されるダイヤルシーケンスを構成します。"
    },
    {
      "indent": 3,
      "text": "- \"separators\": used only to improve human readability of a Dial Sequence.",
      "ja": " - 「セパレータ」：ダイヤルシーケンスの可読性を向上させるためにのみ使用。"
    },
    {
      "indent": 0,
      "text": "2.1. The \"phone-string\" definition",
      "section_title": true,
      "ja": "2.1。 「電話の文字列」の定義"
    },
    {
      "indent": 3,
      "text": "The text representation of the Dial Sequence elements is defined in the phone-string specification:",
      "ja": "ダイヤルシーケンス要素のテキスト表現は、電話の文字列仕様で定義されています。"
    },
    {
      "indent": 6,
      "text": "phone-string = 1*( DTMF / pause / tonewait / written-sep )",
      "ja": "電話列= 1 *（DTMF /一時停止/ tonewait /書き込ま-9）"
    },
    {
      "indent": 6,
      "text": "DTMF = ( DIGIT / \"#\" / \"*\" / \"A\" / \"B\" / \"C\" / \"D\" ) ; special DTMF codes like \"*\", \"#\", \"A\", \"B\", ; \"C\", \"D\" are defined in [1]. ; Important Note: these elements only apply for ; alphabetic strings used in DTMF operations. ; They are NOT applicable for the alphabetic ; characters that are mapped to digits on phone ; keypads in some countries.",
      "ja": "DTMF =（DIGIT / \"＃\" / \"*\" / \"A\" / \"B\" / \"C\" / \"D\"）。 \"*\"、 \"＃\"、 \"A\"、 \"B\"、などの特殊なDTMFコード。 \"C\"、 \"D\" は、[1]で定義されています。 ;重要な注意：これらの要素のみに適用されます。 DTMF操作で使用するアルファベットの文字列。 ;彼らはアルファベットには適用されません。電話で桁にマッピングされている文字。一部の国ではキーパッド。"
    },
    {
      "indent": 6,
      "text": "pause = \"p\"",
      "ja": "一時停止= \"P\""
    },
    {
      "indent": 6,
      "text": "tonewait = \"w\"",
      "ja": "tonewait = \"で\""
    },
    {
      "indent": 6,
      "text": "written-sep = ( \"-\" / \".\" )",
      "ja": "書かれた -  9月=（ \" - \" / \"\"）"
    },
    {
      "indent": 3,
      "text": "Note: DTMF are the \"DTMF elements\", pause and tonewait are the \"actions\" and written-sep are the \"separators\".",
      "ja": "注：DTMFは一時停止とtonewaitは、「アクション」と書かれた、9月には「セパレータ」ですが、「DTMF要素」です。"
    },
    {
      "indent": 3,
      "text": "The \"pause\" and \"tonewait\" elements interpretation of the phone-string depends on the specific devices and implementation using the specification. Thus their exact meaning is not mandated in this document. The next section provides some examples drawn from common practice. Both \"pause\" and \"tonewait\" are case insensitive.",
      "ja": "電話の文字列の「一時停止」と「tonewait」要素の解釈は、仕様を使用して、特定のデバイスや実装に依存します。したがって、その正確な意味は、この文書で義務化されていません。次のセクションでは、一般的な慣行から引き出されたいくつかの例を提供します。 「一時停止」と「tonewait」はどちらも大文字と小文字を区別しません。"
    },
    {
      "indent": 3,
      "text": "Implementation of \"pause\" and \"tonewait\":",
      "ja": "「一時停止」と「tonewait」の実装："
    },
    {
      "indent": 6,
      "text": "- one instance of a \"pause\" SHOULD be interpreted as a pause of one second between the preceding and succeeding dial string elements;",
      "ja": " - 「一時停止」の1つのインスタンスは、前後のダイヤル文字列要素との間に1秒の休止として解釈されるべきです。"
    },
    {
      "indent": 6,
      "text": "- a \"tonewait\" SHOULD be interpreted as a pause that will last until the calling party hears a dial tone or another indication that more dial string characters may be processed. An off-hook indication MAY also be interpreted as this kind of indication (meaning that the audio channel has been opened to the receiving party);",
      "ja": " - 「tonewaitは、」発信者がダイヤルトーンまたは複数のダイヤル文字列の文字を処理することができるという別の指標を聞くまで続くのポーズとして解釈されるべきです。オフフック表示も（音声チャンネルが受信者に開放されたことを意味する）表示のこの種として解釈することができます。"
    },
    {
      "indent": 6,
      "text": "- because these characters are not a part of the GSTN subscriber address (telephone number) per se, any dial string characters that succeed either a \"pause\" or \"tonewait\" SHOULD be sent using DTMF signalling.",
      "ja": " - これらの文字は、それ自体GSTN加入者アドレス（電話番号）の一部ではないので、「一時停止」または「tonewait」のいずれかを成功任意のダイヤル文字列の文字は、DTMFシグナリングを使用して送信されるべきです。"
    },
    {
      "indent": 3,
      "text": "The use of written-sep elements is allowed in order to improve human readability of the phone-string. The written-sep are elements which can be placed between dial elements, such as digits etc. Any occurrences of written-sep elements in a phone-string MUST NOT result in any action. Conformant implementations MAY drop or insert written-sep into the phone-string they handle.",
      "ja": "書かれた -  9月の要素の使用は、電話、文字列の可読性を改善するために許可されています。書き込ま-9月電話の文字列で記述された、9月要素のいずれかの発生は、任意のアクションを生じてはいけません、このような数字等の文字板要素の間に配置することができる要素です。準拠実装は、彼らが扱う携帯電話文字列に書き込まれ、9月を落としたり、挿入することができます。"
    },
    {
      "indent": 3,
      "text": "The phone-string definition is used in the following sections to explicitly describe the encoding of some specific subcases where it applies.",
      "ja": "電話文字列定義は、明示的にそれが適用されるいくつかの特定のサブケースのエンコーディングを記述するために、次のセクションで使用されています。"
    },
    {
      "indent": 0,
      "text": "3. The \"gstn-phone\" definition",
      "section_title": true,
      "ja": "3.「GSTN電話」の定義"
    },
    {
      "indent": 3,
      "text": "In order to access a GSTN address, a human or a device must perform a Dial Sequence. Thus, a GSTN address can be represented using the phone-string elements. In particular, diallable E.164 numeric addresses [2] represent a limited subset of all possible GSTN addresses, while the complete complex case needs a full encoding schema, as it also includes a local or private addressing schema.",
      "ja": "GSTNアドレスにアクセスするためには、ヒトまたはデバイスは、ダイヤルシーケンスを実行する必要があります。したがって、GSTNアドレスが電話文字列要素を用いて表現することができます。完全な複合ケースは、完全な符号化スキーマを必要としながらも、ローカルまたはプライベートアドレッシングスキーマを含むように、特に、diallable E.164数値アドレス[2]は、すべての可能なGSTNアドレスの限られたサブセットを表します。"
    },
    {
      "indent": 3,
      "text": "In order to describe this distinction and provide anyhow a complete encoding schema, the following definition of \"gstn-phone\" is provided:",
      "ja": "この違いを説明し、とにかく完全な符号化スキーマを提供するために、「GSTN電話」の以下の定義が提供されます。"
    },
    {
      "indent": 6,
      "text": "gstn-phone = ( global-phone / local-phone )",
      "ja": "GSTN電話=（グローバル・電話/ローカル電話）"
    },
    {
      "indent": 0,
      "text": "3.1. The \"global-phone\" definition",
      "section_title": true,
      "ja": "3.1。 「グローバル・フォン」の定義"
    },
    {
      "indent": 3,
      "text": "The purpose of the global-phone element is to represent diallable E.164 numeric addresses. As such, it uses a subset of a phone-string definition only.",
      "ja": "グローバル-phone要素の目的は、diallable E.164数値アドレスを表現することです。このように、それは唯一の電話文字列定義のサブセットを使用しています。"
    },
    {
      "indent": 3,
      "text": "The syntax for a global-phone element is as follows:",
      "ja": "次のようにグローバル-phone要素の構文は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "global-phone = \"+\" 1*( DIGIT / written-sep )",
      "ja": "グローバル・フォン= \"+\" 1 *（DIGIT /書かれた -  9月）"
    },
    {
      "indent": 3,
      "text": "Any other dialling schemes MUST NOT use the leading \"+\" defined here. The \"+\" sign is strictly reserved for the standard \"global-phone\" syntax, and, even if not specifically part of the phone-string definition, it is needed to uniquely label a global-phone.",
      "ja": "その他のダイヤル方式は、先頭の「+」ここで定義を使用してはなりません。 「+」記号は電話文字列定義のない、具体的部分は、一意のグローバル電話にラベルを付けるために必要な場合でも、標準の「グローバルな電話」構文については、厳密に予約されている、と。"
    },
    {
      "indent": 0,
      "text": "3.2. The \"local-phone\" definition",
      "section_title": true,
      "ja": "3.2。 「ローカル電話」の定義"
    },
    {
      "indent": 3,
      "text": "The local-phone element is intended to represent the set of possible cases where the global-phone numbering schema does not apply. Given the different and complex conventions currently being used in the GSTN system, the local-phone definition supports a large number of elements.",
      "ja": "ローカル電話の要素は、グローバル・電話番号スキーマが適用されない可能性例のセットを表すことが意図されています。現在GSTNシステムで使用されているさまざまで複雑な規則を考えると、ローカル電話の定義は、多数の素子をサポートしています。"
    },
    {
      "indent": 3,
      "text": "The detailed syntax for local-phone elements is as follows:",
      "ja": "次のようにローカル電話要素の詳細な構文は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "local-phone = [ exit-code ] dial-number",
      "ja": "ローカル電話= [終了コード]ダイヤル番号"
    },
    {
      "indent": 6,
      "text": "local-phone =/ exit-code [ dial-number ]",
      "ja": "ローカル電話= /終了コード[ダイヤル番号]"
    },
    {
      "indent": 6,
      "text": "exit-code = phone-string ; this will include elements such as the digit to ; access outside line, the long distance carrier ; access code, the access password to the service, ; etc...",
      "ja": "終了コード=電話列。これは、に数字などの要素を含むであろう。アクセス外線、長距離キャリア。アクセスコード、サービスへのアクセスパスワード;等..."
    },
    {
      "indent": 6,
      "text": "dial-number = phone-string ; this is in many cases composed of different elements ; such as the local phone number, the area code ; (if needed), the international country code ; (if needed), etc...",
      "ja": "=電話の文字列番号をダイヤルします。これは、異なる要素から構成される場合が多いです。そのようなローカル電話番号、エリアコードなど;国際国コードを（必要な場合）。 （必要な場合）、等..."
    },
    {
      "indent": 3,
      "text": "Notes: The \"+\" character is reserved for use in a global-phone and MUST NOT be used in a local-phone string;",
      "ja": "注：「+」の文字がグローバル・電話での使用のために予約されており、ローカル電話の文字列に使用してはいけません。"
    },
    {
      "indent": 6,
      "text": "Please note that a local-phone string MUST NOT be a null string, i.e., at least an exit-code, or a dial-number or both MUST be present.",
      "ja": "すなわち、少なくとも出口コード、ローカル電話文字列はヌル文字列てはならないことに注意し、またはダイヤル番号または両方が存在している必要があります。"
    },
    {
      "indent": 0,
      "text": "4. The \"subaddr-string\" definition",
      "section_title": true,
      "ja": "4.「subaddr文字列」の定義"
    },
    {
      "indent": 3,
      "text": "In GSTN service, there are cases where a subaddress is required to specify the final destination. To specify these subaddresses, a Dial Sequence is also used, and thus the \"subaddr-string\" can be encoded as:",
      "ja": "GSTNサービスでは、サブアドレスは、最終的な宛先を指定するために必要とされる場合があります。これらのサブアドレスを指定するには、ダイヤルシーケンスにも使用されているので、「subaddr-string」はとしてエンコードすることができます。"
    },
    {
      "indent": 6,
      "text": "subaddr-string = phone-string",
      "ja": "subaddr文字列=電話の文字列"
    },
    {
      "indent": 3,
      "text": "Note: Within actual uses of subaddresses, some specific services can limit the possible set of phone-string elements allowed. In particular, there are ISDN subaddresses [2] [8], which restrict the phone-string elements to 1*( DIGIT / written-sep ) and service specific subaddresses, like the fax service T.33 subaddress [5] [7], which restrict phone-string elements to 1*( DIGIT ).",
      "ja": "注意：サブアドレスの実際の用途の中で、いくつかの特定のサービスが許さ電話文字列要素の可能なセットを制限することができます。具体的には、[7] [5] 1 *（DIGIT /書き込ま-9）に電話文字列要素及びファックスサービスT.33サブアドレスのようなサービス固有のサブアドレスを制限ISDNのサブアドレス[2] [8]は、あります、1 *（DIGIT）に電話文字列要素を制限しています。"
    },
    {
      "indent": 0,
      "text": "5. The \"post-dial\" definition",
      "section_title": true,
      "ja": "5.「ポストダイヤル」の定義"
    },
    {
      "indent": 3,
      "text": "In some cases, after the connection with the destination GSTN device has been established, a further dialling sequence is required to access further services. A typical example is an automated menu-driven service using DTMF sequences. These cases may be represented using the \"post-dial\" definition below:",
      "ja": "目的地GSTNデバイスとの接続が確立された後にいくつかのケースでは、さらにダイヤルシーケンスは、さらに、サービスにアクセスするために必要とされます。典型的な例は、DTMFシーケンスを使用して自動化されたメニュー方式のサービスです。これらの例は、以下の「ポストダイヤル」の定義を使用して表すことができます。"
    },
    {
      "indent": 6,
      "text": "post-dial = phone-string",
      "ja": "ポストダイヤル=電話の文字列"
    },
    {
      "indent": 0,
      "text": "6. Examples",
      "section_title": true,
      "ja": "6.例"
    },
    {
      "indent": 3,
      "text": "In order to clarify the specification we present, here are a limited set of examples. Please note that all the examples are for illustration purposes only.",
      "ja": "仕様を明確にするために、我々はここで、本例の限定セットです。すべての例は、説明のみを目的としていることに注意してください。"
    },
    {
      "indent": 3,
      "text": "A GSTN address in Italy, dialled from U.S.A., using local-phone, without written-sep:",
      "ja": "書かれた -  9月せずに、ローカル電話を使用して、U.S.A.からダイヤルイタリアGSTNアドレス："
    },
    {
      "indent": 6,
      "text": "01139040226338",
      "ja": "０１１３９０４０２２６３３８"
    },
    {
      "indent": 3,
      "text": "A GSTN address in Germany, using global-phone and written-sep \".\":",
      "ja": "グローバル電話と書かれた、9月を使用してドイツのGSTNアドレス、「」："
    },
    {
      "indent": 6,
      "text": "+49.81.7856345",
      "ja": "＋４９。８１。７８５６３４５"
    },
    {
      "indent": 3,
      "text": "A GSTN address in U.S.A. using global-phone and written-sep \"-\":",
      "ja": "グローバル電話と書かれた、9月を使用してU.S.A.でGSTNアドレス「 - 」："
    },
    {
      "indent": 6,
      "text": "+1-202-455-7622",
      "ja": "＋１ー２０２ー４５５ー７６２２"
    },
    {
      "indent": 3,
      "text": "A post-dial sequence, pausing, dialling 1, waiting for dial tone, dialling 7005393, waiting again for dial tone and dialling 373; note the use of four \"p\" elements (pppp) to specify a longer initial pause:",
      "ja": "ポストダイヤルシーケンス、一時停止ダイヤルトーンを待って、1をダイヤルし、7005393をダイヤルし、ダイヤルトーンをもう一度待っていると、373をダイヤルします。長い初期の一時停止を指定するには、4つの「P」の要素（PPPP）の使用に注意してください。"
    },
    {
      "indent": 6,
      "text": "pppp1w7005393w373",
      "ja": "pppp1w7005393w373"
    },
    {
      "indent": 3,
      "text": "A Dial Sequence in Italy (long distance call), using local-phone, with exit-code \"9\", long distance access \"0\", area code \"40\", pause \"p\" and written-sep \".\":",
      "ja": "ローカル電話を使用してイタリアのダイヤルシーケンス（長距離通話）は、終了コード「9」、長距離アクセス「0」、エリアコード「40」で、「P」と書かれた、9月を一時停止「」："
    },
    {
      "indent": 6,
      "text": "9p040p22.63.38",
      "ja": "9p040p22.63.38"
    },
    {
      "indent": 3,
      "text": "A Dial Sequence using exit-code \"0\", a wait for dial tone, local-phone for an International \"800\" toll-free number dialled from Belgium (international prefix \"00\"), and a post-dial sequence to access a voice mailbox with userID \"334422\" and Personal Identification Number (PIN) code \"1234\":",
      "ja": "ダイヤルシーケンス使用して終了コード「0」、ベルギーからダイヤル国際「800」のフリーダイヤル番号のダイヤルトーン、ローカル電話待ち（国際プレフィックス「00」）、およびアクセスするためのポストダイヤルシーケンスユーザーID「334422」と個人識別番号（PIN）コード「1234」との音声メールボックス："
    },
    {
      "indent": 6,
      "text": "0w00800-39380023pp334422p1234",
      "ja": "0w00800-39380023pp334422p1234"
    },
    {
      "indent": 0,
      "text": "7. Conclusions",
      "section_title": true,
      "ja": "7、結論"
    },
    {
      "indent": 3,
      "text": "This proposal creates a full standard text encoding for Dial Sequences, including GSTN and diallable E.164 addresses, and thus provides a unique common representation method both for standard protocols and applications.",
      "ja": "この提案はGSTNとdiallable E.164アドレスなどのダイヤルシーケンスのための完全な標準的なテキストエンコーディングを作成し、これにより、標準プロトコルおよびアプリケーションのためのユニークな共通の表現方法を提供します。"
    },
    {
      "indent": 3,
      "text": "Some definitions, like these corresponding to an alias of the generic phone-string element, are somewhat a theoretical distinction; however they are useful to provide a more subtle distinction, allowing other specifications to be more exact in a consistent way.",
      "ja": "いくつかの定義は、これらの一般的な電話文字列要素の別名に対応するように、やや理論的な区別されています。しかし、彼らは他の仕様は一貫した方法で、より正確にできるように、より微妙な区別を提供するのに有用です。"
    },
    {
      "indent": 3,
      "text": "The proposal is consistent with existing standard specifications.",
      "ja": "提案は、既存の標準仕様と一致しています。"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document specifies a means to represent Dial Sequences, which could include GSTN addresses and private codes sequences, like Personal Identification Numbers, to access special services. As these text strings could be transmitted without encoding inside protocols or applications services, this could allow unauthorized people to gain access to these codes. Users SHOULD be provided methods to prevent this disclosure, like code encryption, or masquerading techniques: out-of-band communication of authorization information or use of encrypted data in special fields are the available non-standard techniques.",
      "ja": "この文書では、特別なサービスにアクセスするために、個人識別番号のような、GSTNアドレスとプライベートのコード配列を含む可能性がある、シーケンスをダイヤル表現する手段を指定します。これらのテキスト文字列が内部のプロトコルやアプリケーションサービスをコードせずに送信することができるように、これは不正な人々は、これらのコードにアクセスする可能性があります。ユーザーは、コードの暗号化と同様に、この開示を防止するための方法を提供し、または技術をマスカレードする必要があります。特殊な分野での認証情報または暗号化されたデータの使用のアウトオブバンド通信が可能な非標準的な技術です。"
    },
    {
      "indent": 0,
      "text": "9. Collected ABNF Syntax",
      "section_title": true,
      "ja": "9.収集ABNF構文"
    },
    {
      "indent": 3,
      "text": "In this section we provide a summary of ABNF specifications.",
      "ja": "このセクションでは、ABNF仕様の概要を提供します。"
    },
    {
      "indent": 6,
      "text": "phone-string = 1*( DTMF / pause / tonewait / written-sep )",
      "ja": "電話列= 1 *（DTMF /一時停止/ tonewait /書き込ま-9）"
    },
    {
      "indent": 6,
      "text": "DTMF = ( DIGIT / \"#\" / \"*\" / \"A\" / \"B\" / \"C\" / \"D\" )",
      "ja": "DTMF =（DIGIT / \"＃\" / \"*\" / \"A\" / \"B\" / \"C\" / \"D\"）"
    },
    {
      "indent": 6,
      "text": "written-sep = ( \"-\" / \".\" )",
      "ja": "書かれた -  9月=（ \" - \" / \"\"）"
    },
    {
      "indent": 6,
      "text": "pause = \"p\"",
      "ja": "一時停止= \"P\""
    },
    {
      "indent": 6,
      "text": "tonewait = \"w\"",
      "ja": "tonewait = \"で\""
    },
    {
      "indent": 6,
      "text": "gstn-phone = ( global-phone / local-phone )",
      "ja": "GSTN電話=（グローバル・電話/ローカル電話）"
    },
    {
      "indent": 6,
      "text": "global-phone = \"+\" 1*( DIGIT / written-sep )",
      "ja": "グローバル・フォン= \"+\" 1 *（DIGIT /書かれた -  9月）"
    },
    {
      "indent": 6,
      "text": "local-phone = [ exit-code ] dial-number",
      "ja": "ローカル電話= [終了コード]ダイヤル番号"
    },
    {
      "indent": 6,
      "text": "local-phone =/ exit-code [ dial-number ]",
      "ja": "ローカル電話= /終了コード[ダイヤル番号]"
    },
    {
      "indent": 6,
      "text": "exit-code = phone-string",
      "ja": "出口コード=電話の文字列"
    },
    {
      "indent": 6,
      "text": "dial-number = phone-string",
      "ja": "ダイヤル番号=電話の文字列"
    },
    {
      "indent": 6,
      "text": "subaddr-string = phone-string",
      "ja": "subaddr文字列=電話の文字列"
    },
    {
      "indent": 6,
      "text": "post-dial = phone-string",
      "ja": "ポストダイヤル=電話の文字列"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[1] ETSI I-ETS 300,380 - Universal Personal Telecommunication (UPT): Access Devices Dual Tone Multi Frequency (DTMF) sender for acoustical coupling to the microphone of a handset telephone (March 1995).",
      "ja": "[1] ETSI I-ETS 300380  - ユニバーサルパーソナル通信（UPT）：携帯電話の電話のマイクへの音響結合のためのアクセスデバイスデュアルトーン多重周波数（DTMF）送信者（1995年3月）。"
    },
    {
      "indent": 3,
      "text": "[2] ITU E.164 - The International Public Telecommunication Numbering Plan E.164/I.331 (May 1997).",
      "ja": "[2] ITU E.164  - 国際公共電気通信番号計画E.164 / I.331（1997年5月）。"
    },
    {
      "indent": 3,
      "text": "[3] Crocker, D. Ed. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", RFC 2234, November 1997.",
      "ja": "[3]クロッカー、D.編。そして、P. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、RFC 2234、1997年11月。"
    },
    {
      "indent": 3,
      "text": "[4] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[4]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 3,
      "text": "[5] ITU T.33 - Facsimile routing utilizing the subaddress; recommendation T.33 (July, 1996).",
      "ja": "[5] ITU T.33  - サブアドレスを利用ファックスルーティング。勧告T.33（7月、1996）。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[6] Allocchio, C., \"Minimal GSTN address format in Internet Mail\", RFC 3191, October 2001.",
      "ja": "[6] Allocchio、C.、 \"インターネットメールにおける最小GSTNアドレス形式\"、RFC 3191、2001年10月。"
    },
    {
      "indent": 3,
      "text": "[7] Allocchio, C., \"Minimal FAX address format in Internet Mail\", RFC 3192, October 2001.",
      "ja": "[7] Allocchio、C.、 \"インターネットメールにおける最小のFAXアドレス形式\"、RFC 3192、2001年10月。"
    },
    {
      "indent": 3,
      "text": "[8] Allocchio, C., \"GSTN Address Element Extensions in E-mail Services\", RFC 2846, June 2000.",
      "ja": "[8] Allocchio、C.、 \"GSTNアドレスEメールサービスの要素拡張機能\"、RFC 2846、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[9] Vaha-Sipila, A., \"URLs for Telephone Calls\", RFC 2806, April 2000.",
      "ja": "[9] Vaha-Sipilaは、A.、RFC 2806、2000年4月、 \"電話のURLコール\"。"
    },
    {
      "indent": 0,
      "text": "11. Author's Address",
      "section_title": true,
      "ja": "11.著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Claudio Allocchio GARR c/o Sincrotrone Trieste SS 14 Km 163.5 Basovizza I 34012 Trieste Italy",
      "ja": "Basovizza 34012トリエステイタリア/ OシンクロトリエステSS 14キロ163.5 CクラウディオAllocchio GARR"
    },
    {
      "indent": 3,
      "text": "Phone: +39 040 3758523 Fax: +39 040 3758565 X.400: C=it;A=garr;P=garr;S=Allocchio;G=Claudio; EMail: Claudio.Allocchio@garr.it",
      "ja": "電話：+39 040 3758523ファックス：+39 040 3758565 X.400：C =それ; A =ガー; P =ガー; S = Allocchio; G =クラウディオ。メールアドレス：Claudio.Allocchio@garr.it"
    },
    {
      "indent": 0,
      "text": "12. Full Copyright Statement",
      "section_title": true,
      "ja": "12.完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assignees.",
      "ja": "上記の制限は永続的なものであり、インターネットソサエティもしくはその継承者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}