{
  "title": {
    "text": "RFC 3294 - General Switch Management Protocol (GSMP) Applicability",
    "ja": "RFC 3294 - 一般的なスイッチ管理プロトコル（GSMP）の適用性"
  },
  "number": 3294,
  "created_at": "2023-11-24 17:17:33.661434+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                           A. Doria\nRequest for Comments: 3294                Lulea University of Technology\nCategory: Informational                                       K. Sundell\n                                                         Nortel Networks\n                                                               June 2002",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "General Switch Management Protocol (GSMP) Applicability",
      "ja": "一般的なスイッチ管理プロトコル（GSMP）の適用性"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This memo provides an overview of the GSMP (General Switch Management Protocol) and includes information relating to its deployment in a IP network in an MPLS environment. It does not discuss deployment in an ATM (Asynchronous Transfer Mode) network or in a raw ethernet configuration.",
      "ja": "このメモは、GSMP（一般的なスイッチ管理プロトコル）の概要を提供し、MPLS環境のIPネットワークでの展開に関する情報が含まれています。ATM（非同期転送モード）ネットワークまたは生のイーサネット構成での展開については説明しません。"
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1. 概要"
    },
    {
      "indent": 3,
      "text": "The General Switch Management Protocol (GSMP) has been available to the IETF community for several years now as informational RFCs. Both GSMPv1.1 (released in March 1996 as RFC 1987 [2]) and GSMPv2.0 (released in August 1998 as RFC 2297 [3]) are available. Several vendors have implemented GSMPv1.1.",
      "ja": "一般的なスイッチ管理プロトコル（GSMP）は、情報提供RFCとして数年前からIETFコミュニティが利用できるようになりました。GSMPV1.1（1996年3月にRFC 1987 [2]としてリリース）とGSMPv2.0（1998年8月にRFC 2297 [3]としてリリース）が利用可能です。いくつかのベンダーがGSMPV1.1を実装しています。"
    },
    {
      "indent": 3,
      "text": "In V1.1 and V2 GSMP was intended only for use with ATM switches. During the course of the last two years, the GSMP working group has decided to expand the purview of GSMP to the point where it can be used to control a number of different kinds of switch and can thus live up to what its name indicates; a general switch management protocol. To do this, commands and arguments needed to be generalised and sections needed to be added, discussing the manner in which the generalised protocol could be applied to specific kinds of switches and port types. In short, the protocol has gone through major changes in the last 24 months.",
      "ja": "V1.1およびV2では、GSMPはATMスイッチでのみ使用することを目的としていました。過去2年間、GSMPワーキンググループは、GSMPの範囲を使用して多くの異なる種類のスイッチを制御できるようにするため、その名前が示すものに耐えることができるポイントに拡大することを決定しました。一般的なスイッチ管理プロトコル。これを行うには、コマンドと議論を一般化する必要があり、セクションを追加する必要があり、一般化されたプロトコルを特定の種類のスイッチとポートタイプに適用できる方法について議論しました。要するに、このプロトコルは過去24か月で大きな変化を遂げました。"
    },
    {
      "indent": 3,
      "text": "GSMP provides an interface that can be used to separate the data forwarder from the routing and other control plane protocols such as LDP. As such it allows service providers to move away from monolithic systems that bundle the control plane and the data plane into a single tightly coupled system - usually in a single chassis. Separating the control components from the forwarding components and using GSMP for switch management, enables service providers to create multi-service systems composed of various vendors equipment. It also allows for a more dynamic means of adding services to their networks.",
      "ja": "GSMPは、データフォワーダーをルーティングからLDPなどの他のコントロールプレーンプロトコルから分離するために使用できるインターフェイスを提供します。そのため、サービスプロバイダーは、コントロールプレーンとデータプレーンを単一の厳密に結合したシステムにバンドルするモノリシックシステムから離れることができます - 通常は単一のシャーシで。制御コンポーネントを転送コンポーネントから分離し、スイッチ管理にGSMPを使用すると、サービスプロバイダーはさまざまなベンダー機器で構成されるマルチサービスシステムを作成できます。また、ネットワークにサービスを追加するより動的な手段も可能になります。"
    },
    {
      "indent": 3,
      "text": "The IETF GSMP working group was established in the routing area because GSMP was being seen as an optional part of the MPLS solution. In a MPLS system, it is possible to run the routing protocols and label distribution protocols on one system while passing data across a generic switch, e.g., an ATM switch. GSMP provides the switch resource management mechanism needed in such a scenario.",
      "ja": "IETF GSMPワーキンググループは、GSMPがMPLSソリューションのオプション部分と見なされているため、ルーティングエリアに確立されました。MPLSシステムでは、ルーティングプロトコルを実行し、1つのシステムで分布プロトコルをラベル分布プロトコルを実行しながら、一般的なスイッチ（たとえばATMスイッチ）にデータを渡すことができます。GSMPは、このようなシナリオで必要なスイッチリソース管理メカニズムを提供します。"
    },
    {
      "indent": 3,
      "text": "GSMP has also been selected by the Multiservice Switching Forum (MSF) as its protocol of choice for the Switch Control Interface identified in their architecture. The MSF is an industry forum which, among its activities establishes their member's requirements and then works with the appropriate standards bodies to foster their goals. In the case of GSMP, the MSF presented the IETF GSMP Working Group with a set of requirements for GSMP. The working group has made a determined effort to comply with those requirements in its specifications.",
      "ja": "GSMPは、アーキテクチャで識別されたスイッチ制御インターフェイスに最適なプロトコルとして、マルチサービススイッチングフォーラム（MSF）によっても選択されています。MSFは、その活動の中で、メンバーの要件を確立し、適切な基準団体と協力して目標を促進する業界フォーラムです。GSMPの場合、MSFはIETF GSMPワーキンググループにGSMPの一連の要件を提示しました。ワーキンググループは、その仕様においてこれらの要件を遵守するために決定された努力をしました。"
    },
    {
      "indent": 0,
      "text": "2. GSMP V3 Document Set",
      "section_title": true,
      "ja": "2. GSMP V3ドキュメントセット"
    },
    {
      "indent": 3,
      "text": "The current version of GSMP is documented in 3 documents:",
      "ja": "GSMPの現在のバージョンは、3つのドキュメントに文書化されています。"
    },
    {
      "indent": 3,
      "text": "- GSMP: General Switch Management protocol V3 [5]",
      "ja": "- GSMP：一般的なスイッチ管理プロトコルV3 [5]"
    },
    {
      "indent": 3,
      "text": "- GSMP-ENCAPS: General Switch Management Protocol (GSMP) Packet Encapsulations for Asynchronous Transfer Mode (ATM), Ethernet and Transmission Control Protocol (TCP) [4]",
      "ja": "- GSMP-ENCAPS：一般的なスイッチ管理プロトコル（GSMP）非同期転送モード（ATM）、イーサネットおよび伝送制御プロトコル（TCP）のパケットカプセル"
    },
    {
      "indent": 3,
      "text": "- GSMP-MIB: Definitions of Managed Objects for the General Switch Management Protocol [1]",
      "ja": "- GSMP-MIB：一般的なスイッチ管理プロトコルの管理されたオブジェクトの定義[1]"
    },
    {
      "indent": 0,
      "text": "3. General Description",
      "section_title": true,
      "ja": "3. 概要"
    },
    {
      "indent": 3,
      "text": "The General Switch Management Protocol V3 (GSMPv3) [5], is a general purpose protocol to control a label switch. GSMP allows a controller to establish and release connections across the switch; add and delete leaves on a multicast connection; reserve resources; manage switch ports; request configuration information; and request statistics. It also allows the switch to inform the controller of asynchronous events such as a link going down. The GSMPv3 protocol is asymmetric, the controller being the master and the switch being the slave.",
      "ja": "一般的なスイッチ管理プロトコルV3（GSMPV3）[5]は、ラベルスイッチを制御する汎用プロトコルです。GSMPを使用すると、コントローラーがスイッチ全体に接続を確立およびリリースできます。マルチキャスト接続に葉を追加および削除します。予備資源。スイッチポートを管理します。構成情報を要求します。統計を要求します。また、スイッチは、ダウンするリンクなどの非同期イベントをコントローラーに通知することもできます。GSMPV3プロトコルは非対称で、コントローラーはマスターであり、スイッチはスレーブです。"
    },
    {
      "indent": 3,
      "text": "A physical switch can be partitioned into many virtual switches. GSMPv3 does not provide support for defining switch partitions. GSMPv3 treats a virtual switch as if it were a physical switch.",
      "ja": "物理スイッチは、多くの仮想スイッチに分割できます。GSMPV3は、スイッチパーティションの定義をサポートしていません。GSMPV3は、仮想スイッチを物理スイッチであるかのように処理します。"
    },
    {
      "indent": 3,
      "text": "GSMPv3 may be transported in three ways:",
      "ja": "GSMPV3は3つの方法で輸送できます。"
    },
    {
      "indent": 6,
      "text": "- GSMPv3 operation across an IP network is specified.",
      "ja": "- IPネットワーク全体でGSMPV3操作が指定されています。"
    },
    {
      "indent": 6,
      "text": "- GSMPv3 operation across an ATM virtual channel is specified.",
      "ja": "- ATM仮想チャネル全体のGSMPV3操作が指定されています。"
    },
    {
      "indent": 6,
      "text": "- GSMPv3 operation across an Ethernet link is specified.",
      "ja": "- イーサネットリンク全体のGSMPV3操作が指定されています。"
    },
    {
      "indent": 3,
      "text": "Other encapsulations are possible, but have not been defined. Encapsulations are defined in [4].",
      "ja": "他のカプセルは可能ですが、定義されていません。カプセルは[4]で定義されています。"
    },
    {
      "indent": 3,
      "text": "A label switch is a frame or cell switch that supports connection oriented switching using the exact match forwarding algorithm based on labels attached to incoming cells or frames.",
      "ja": "ラベルスイッチは、着信セルまたはフレームに接続されたラベルに基づいた正確な一致前転送アルゴリズムを使用した接続方向のスイッチングをサポートするフレームまたはセルスイッチです。"
    },
    {
      "indent": 3,
      "text": "A label switch may support multiple label types. However, each switch port can support only one label type. The label type supported by a given port is indicated in a port configuration message. Connections may be established between ports supporting different label types using the adaptation methods. GSMPv3 supports TLV labels similar to those defined in MPLS. Examples of labels which are defined include ATM, Frame Relay, DS1, DS3, E1, E3, MPLS Generic Labels and MPLS FECs.",
      "ja": "ラベルスイッチは、複数のラベルタイプをサポートする場合があります。ただし、各スイッチポートは1つのラベルタイプのみをサポートできます。特定のポートでサポートされているラベルタイプは、ポート構成メッセージに示されています。適応方法を使用して、さまざまなラベルタイプをサポートするポート間で接続を確立できます。GSMPV3は、MPLSで定義されているものと同様のTLVラベルをサポートしています。定義されたラベルの例には、ATM、フレームリレー、DS1、DS3、E1、E3、MPLSジェネリックラベル、MPLS FECが含まれます。"
    },
    {
      "indent": 3,
      "text": "A connection across a switch is formed by connecting an incoming labelled channel to one or more outgoing labelled channels. Connections are generally referenced by the input port on which they arrive and the label values of their incoming labelled channel. In some messages, connections are referenced by the output port.",
      "ja": "スイッチを横切る接続は、着信ラベル付きチャネルを1つ以上の発信ラベルチャネルに接続することにより形成されます。接続は一般に、到着する入力ポートと、着信ラベルチャネルのラベル値によって参照されます。一部のメッセージでは、接続は出力ポートによって参照されます。"
    },
    {
      "indent": 3,
      "text": "GSMPv3 supports point-to-point and point-to-multipoint connections. A multipoint-to-point connection is specified by establishing multiple point-to-point connections, each of which specifies the same output label. A multipoint-to-multipoint connection is specified by establishing multiple point-to-multipoint connections each of which specifies a different input label with the same output labels.",
      "ja": "GSMPV3は、ポイントツーポイントおよびポイントツーマルチポイント接続をサポートしています。複数のポイントツーポイント接続を確立することにより、マルチポイントからポイントへの接続が指定されており、それぞれが同じ出力ラベルを指定します。マルチポイントからマルチポイント接続は、それぞれが同じ出力ラベルを持つ異なる入力ラベルを指定する複数のポイントツーマルチポイント接続を確立することにより指定されます。"
    },
    {
      "indent": 3,
      "text": "In general a connection is established with a certain quality of service (QoS). GSMPv3 includes a default QoS Configuration and additionally allows the negotiation of alternative, optional QoS configurations. The default QoS Configuration includes three QoS Models: a default service model, a simple priority model and a QoS profile model. GSMPv3 also supports the reservation of resources when the labels are not yet known. This ability can be used in support of MPLS.",
      "ja": "一般に、特定のサービス品質（QoS）との接続が確立されます。GSMPV3には、デフォルトのQOS構成が含まれており、さらに、オプションのQoS構成の代替の交渉が可能になります。デフォルトのQoS構成には、デフォルトのサービスモデル、単純な優先度モデル、QoSプロファイルモデルの3つのQoSモデルが含まれます。GSMPV3は、ラベルがまだ知られていない場合、リソースの予約もサポートしています。この機能は、MPLSをサポートするために使用できます。"
    },
    {
      "indent": 3,
      "text": "GSMP contains an adjacency protocol. The adjacency protocol is used to synchronise states across the link, to negotiate which version of the GSMP protocol to use, to discover the identity of the entity at the other end of a link, and to detect when it changes.",
      "ja": "GSMPには隣接プロトコルが含まれています。隣接プロトコルは、リンク全体の状態を同期させ、使用するGSMPプロトコルのバージョンを交渉し、リンクの反対側のエンティティのIDを発見し、いつ変更されるかを検出するために使用されます。"
    },
    {
      "indent": 0,
      "text": "3.1 Switch Partitioning",
      "section_title": true,
      "ja": "3.1 パーティションを切り替えます"
    },
    {
      "indent": 3,
      "text": "In GSMPv3 switch partitioning is static and occurs prior to running the protocol. The partitions of a physical switch are isolated from each other by the implementation and the controller assumes that the resources allocated to a partition are at all times available to that partition and only that partition. A partition appears to its controller as a physical label switch. The resources allocated to a partition appear to the controller as if they were the actual physical resources of a physical switch. For example if the bandwidth of a port is divided among several partitions, each partition would appear to the controller to have its own independent port with its fixed set of resources.",
      "ja": "GSMPV3では、スイッチパーティションは静的であり、プロトコルを実行する前に発生します。物理スイッチのパーティションは実装によって互いに分離され、コントローラーは、パーティションに割り当てられたリソースが常にそのパーティションで利用可能であり、パーティションのみが利用可能であると想定しています。パーティションは、物理ラベルスイッチとしてコントローラーに表示されます。パーティションに割り当てられたリソースは、まるで物理スイッチの実際の物理リソースであるかのようにコントローラーに表示されます。たとえば、ポートの帯域幅がいくつかのパーティションに分割されている場合、各パーティションは、固定されたリソースセットを備えた独自の独立したポートを持つようにコントローラーに表示されます。"
    },
    {
      "indent": 3,
      "text": "GSMPv3 controls a partitioned switch through the use of a partition identifier that is carried in every GSMPv3 message. Each partition has a one-to-one control relationship with its own logical controller entity (which in the remainder of the document is referred to simply as a controller) and GSMPv3 independently maintains adjacency between each controller-partition pair.",
      "ja": "GSMPV3は、すべてのGSMPV3メッセージに携帯されるパーティション識別子を使用して、パーティションスイッチを制御します。各パーティションには、独自の論理コントローラーエンティティ（ドキュメントの残りの部分では単にコントローラーと呼ばれます）と1対1の制御関係があり、GSMPV3は各コントローラーパーティションペア間の隣接を個別に維持します。"
    },
    {
      "indent": 0,
      "text": "3.2 Switch and controller interactions",
      "section_title": true,
      "ja": "3.2 スイッチとコントローラーの相互作用"
    },
    {
      "indent": 3,
      "text": "Multiple switches may be controlled by a single controller using multiple instantiations of the protocol over separate control connections.",
      "ja": "複数のスイッチは、個別の制御接続を介したプロトコルの複数のインスタンス化を使用して、単一のコントローラーによって制御できます。"
    },
    {
      "indent": 3,
      "text": "Alternatively, multiple controllers can control a single switch. Each controller would establish a control connection to the switch using the adjacency protocol. The adjacency mechanism maintains a state table indicating the control connections that are being maintained by the same partition. The switch provides information to the controller group about the number and identity of the attached controllers. It does nothing, however, to co-ordinate the activities of the controllers, and will execute all commands as they are received. It is the controller group's responsibility to co-ordinate its use of the switch. This mechanism is most commonly used for controller redundancy and load sharing. Definition of the mechanism by which controllers use to co-ordinate their control is not within GSMPv3's scope.",
      "ja": "または、複数のコントローラーが単一のスイッチを制御できます。各コントローラーは、隣接プロトコルを使用してスイッチへの制御接続を確立します。隣接メカニズムは、同じパーティションによって維持されている制御接続を示す状態テーブルを維持します。スイッチは、接続されたコントローラーの数と身元に関する情報をコントローラーグループに提供します。ただし、コントローラーのアクティビティを調整することは何もしません。また、受信時にすべてのコマンドを実行します。スイッチの使用を調整するのは、コントローラーグループの責任です。このメカニズムは、コントローラーの冗長性と負荷共有に最も一般的に使用されます。コントローラーが制御を調整するために使用するメカニズムの定義は、GSMPV3の範囲内ではありません。"
    },
    {
      "indent": 0,
      "text": "3.3 Service support",
      "section_title": true,
      "ja": "3.3 サービスサポート"
    },
    {
      "indent": 3,
      "text": "All GSMPv3 switches support the default QoS Configuration. A GSMPv3 switch may additionally support one or more alternative QoS Configurations. GSMP includes a negotiation mechanism that allows a controller to select from the QoS configurations that a switch supports.",
      "ja": "すべてのGSMPV3スイッチは、デフォルトのQoS構成をサポートしています。GSMPV3スイッチは、さらに1つ以上の代替QoS構成をサポートする場合があります。GSMPには、スイッチがサポートするQoS構成からコントローラーが選択できるようにする交渉メカニズムが含まれています。"
    },
    {
      "indent": 3,
      "text": "The default QoS Configuration includes three models:",
      "ja": "デフォルトのQoS構成には、3つのモデルが含まれます。"
    },
    {
      "indent": 6,
      "text": "The Service Model is based on service definitions found external to GSMP such as in CR-LDP, Integrated Services or ATM Service Categories. Each connection is assigned a specific service that defines the handling of the connection by the switch. Additionally, traffic parameters and traffic controls may be assigned to the connection depending on the assigned service.",
      "ja": "サービスモデルは、CR-LDP、統合サービス、ATMサービスカテゴリなど、GSMPの外部にあるサービス定義に基づいています。各接続には、スイッチによる接続の処理を定義する特定のサービスが割り当てられます。さらに、割り当てられたサービスに応じて、トラフィックパラメーターとトラフィックコントロールが接続に割り当てられる場合があります。"
    },
    {
      "indent": 6,
      "text": "In the Simple Abstract Model a connection is assigned a priority when it is established. It may be assumed that for connections that share the same output port, a cell or frame on a connection with a higher priority is much more likely to exit the switch before a cell or frame on a connection with a lower priority if they are both in the switch at the same time.",
      "ja": "単純な抽象モデルでは、接続が確立されると優先度が割り当てられます。同じ出力ポートを共有する接続の場合、優先度の高い接続のセルまたはフレームは、両方が入っている場合、より低い優先度のある接続のセルまたはフレームの前にスイッチを終了する可能性がはるかに高いと想定される場合があります。同時にスイッチ。"
    },
    {
      "indent": 6,
      "text": "The QoS Profile Model provides a simple mechanism that allows QoS semantics defined externally to GSMP to be assigned to connections. Each profile is an opaque indicator that has been predefined in the controller and in the switch.",
      "ja": "QoSプロファイルモデルは、GSMPに外部から定義されたQoSセマンティクスを接続に割り当てることを可能にする簡単なメカニズムを提供します。各プロファイルは、コントローラーとスイッチで事前に定義されている不透明なインジケーターです。"
    },
    {
      "indent": 0,
      "text": "4. Summary of Message Set",
      "section_title": true,
      "ja": "4. メッセージセットの概要"
    },
    {
      "indent": 3,
      "text": "The following table gives a summary of the messages defined in this version of the specification. It also makes a recommendation of the minimal set of messages that should be supported in an MPLS environment. These messages will be labelled as \"Required\", though the service provided by the other messages are essential for the operation of carrier quality controller/switch operations. GSMPv1.1 or GSMPv2 commands that are no longer support are marked as \"Obsolete\" and should no longer be used.",
      "ja": "次の表は、このバージョンの仕様で定義されているメッセージの要約を示しています。また、MPLS環境でサポートされるべきメッセージの最小セットの推奨も行います。これらのメッセージは「必須」とラベル付けされますが、他のメッセージが提供するサービスは、キャリア品質コントローラー/スイッチ操作の操作に不可欠です。サポートされなくなったGSMPV1.1またはGSMPV2コマンドは、「時代遅れ」としてマークされ、使用されなくなってはいけません。"
    },
    {
      "indent": 0,
      "text": "4.1 Messages Table",
      "section_title": true,
      "ja": "4.1 メッセージテーブル"
    },
    {
      "indent": 3,
      "text": "Message Name Message Number Status",
      "ja": "メッセージ名メッセージ番号ステータス"
    },
    {
      "indent": 3,
      "text": "Connection Management Messages\n     Add Branch........................16          Required\n         ATM Specific - VPC............26\n     Delete Tree.......................18\n     Verify Tree.......................19          Obsoleted\n     Delete All Input..................20\n     Delete All Output.................21\n     Delete Branches...................17          Required\n     Move Output Branch................22\n         ATM Specific - VPC............27\n     Move Input Branch.................23\n         ATM Specific - VPC............28",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Port Management Messages\n     Port Management...................32          Required\n     Label Range.......................33",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "State and Statistics Messages\n     Connection Activity...............48\n     Port Statistics...................49          Required\n     Connection Statistics.............50\n     QoS Class Statistics..............51          Reserved\n     Report Connection State...........52",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Configuration Messages\n     Switch Configuration..............64          Required\n     Port Configuration................65          Required\n     All Ports Configuration...........66          Required\n     Service Configuration.............67",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Reservation Messages\n     Reservation Request...............70          Required\n     Delete Reservation................71          Required\n     Delete All Reservations...........72",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Event Messages\n     Port Up...........................80\n     Port Down.........................81\n     Invalid Label.....................82\n     New Port..........................83\n     Dead Port.........................84",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Abstract and Resource Model Extension Messages\n    Reserved.Message Range.........200-249",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": "Adjacency Protocol.................10           Required",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The security of GSMP's TCP/IP control channel has been addressed in [4]. For all uses of GSMP over an IP network, it is REQUIRED that GSMP be run over TCP/IP using the security considerations discussed in [4].",
      "ja": "GSMPのTCP/IPコントロールチャネルのセキュリティは[4]で対処されています。IPネットワークを介したGSMPのすべての使用については、[4]で説明されているセキュリティに関する考慮事項を使用して、GSMPをTCP/IPで実行する必要があります。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "参考文献"
    },
    {
      "indent": 3,
      "text": "[1] Sjostrand, H., Buerkle, J. and B. Srinivasan, \"Definitions of Managed Objects for the General Switch Management Protocol (GSMP)\", RFC 3295, June 2002.",
      "ja": "[1] Sjostrand、H.、Buerkle、J。およびB. Srinivasan、「一般的なスイッチ管理プロトコル（GSMP）の管理されたオブジェクトの定義」、RFC 3295、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[2] Newman, P., Edwards, W., Hinden, R., Hoffman, E., Ching Liaw, F., Lyon, T. and Minshall, G., \"Ipsilon's General Switch Management Protocol Specification Version 1.1\", RFC 1987, August 1996.",
      "ja": "[2] Newman、P.、Edwards、W.、Hinden、R.、Hoffman、E.、Ching Liaw、F.、Lyon、T。and Minshall、G。、「Ipsilonの一般的なスイッチ管理プロトコル仕様バージョン1.1」、RFC 1987、1996年8月。"
    },
    {
      "indent": 3,
      "text": "[3] Newman, P., Edwards, W., Hinden, R., Hoffman, E., Ching Liaw, F., Lyon, T. and G. Minshall, \"Ipsilon's General Switch Management Protocol Specification Version 2.0\", RFC 2297, March 1998.",
      "ja": "[3] Newman、P.、Edwards、W.、Hinden、R.、Hoffman、E.、Ching Liaw、F.、Lyon、T。and G. Minshall、「Ipsilonの一般的なスイッチ管理プロトコル仕様バージョン2.0 \"、RFC 2297、3月1998年。"
    },
    {
      "indent": 3,
      "text": "[4] Worster, T., Doria, A. and J. Buerkle, \"General Switch Management Protocol (GSMP) Packet Encapsulations for Asynchronous Transfer Mode (ATM), Ethernet and Transmission Control Protocol (TCP)\", RFC 3293, June 2002.",
      "ja": "[4] Worster、T.、Doria、A。、およびJ. Buerkle、「一般的なスイッチ管理プロトコル（GSMP）非同期転送モード（ATM）、イーサネットおよび透過制御プロトコル（TCP）のパケットカプセル」、RFC 3293、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[5] Doria, A., Sundell, K., Hellstrand, F. and T. Worster, \"General Switch Management Protocol (GSMP) V3\", RFC 3292, June 2002.",
      "ja": "[5] Doria、A.、Sundell、K.、Hellstrand、F。、およびT. Worster、「General Switch Management Protocol（GSMP）V3」、RFC 3292、2002年6月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Avri Doria Div. of Computer Communications Lulea University of Technology S-971 87 Lulea Sweden",
      "ja": "Avri Doria Div。コンピューター通信ルレア工科大学S-971 87ルレアスウェーデン"
    },
    {
      "indent": 3,
      "text": "Phone: +1 401 663 5024\nEMail: avri@acm.org",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Kenneth Sundell Nortel Networks AB S:t Eriksgatan 115 A P.O. Box 6701 SE-113 85 Stockholm Sweden",
      "ja": "Kenneth Sundell Nortel Networks AB S：T eriksgatan 115 A P.O.ボックス6701 SE-113 85ストックホルムスウェーデン"
    },
    {
      "indent": 3,
      "text": "EMail: sundell@nortelnetworks.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があり、それについてコメントまたは説明する派生作品、またはその実装を支援することができます。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}