{
  "title": {
    "text": "RFC 3330 - Special-Use IPv4 Addresses",
    "ja": "RFC 3330 - 特別なIPv4アドレス"
  },
  "number": 3330,
  "created_at": "2023-11-20 11:17:54.273027+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                               IANA\nRequest for Comments: 3330                                September 2002\nCategory: Informational",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 23,
      "text": "Special-Use IPv4 Addresses",
      "ja": "特別なIPv4アドレス"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes the global and other specialized IPv4 address blocks that have been assigned by the Internet Assigned Numbers Authority (IANA). It does not address IPv4 address space assigned to operators and users through the Regional Internet Registries. It also does not address allocations or assignments of IPv6 addresses or autonomous system numbers.",
      "ja": "このドキュメントでは、インターネットが割り当てられた番号局（IANA）によって割り当てられたグローバルおよびその他の専門的なIPv4アドレスブロックについて説明します。地域のインターネットレジストリを介して、オペレーターとユーザーに割り当てられたIPv4アドレススペースには対応していません。また、IPv6アドレスまたは自律システム番号の割り当てや割り当てにも対処しません。"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "Throughout its entire history, the Internet has employed a central Internet Assigned Numbers Authority (IANA) responsible for the allocation and assignment of various identifiers needed for the operation of the Internet [RFC1174]. In the case of the IPv4 address space, the IANA allocates parts of the address space to Regional Internet Registries according to their established needs. These Regional Internet Registries are responsible for the assignment of IPv4 addresses to operators and users of the Internet within their regions.",
      "ja": "その歴史全体を通して、インターネットは、インターネットの操作に必要なさまざまな識別子の割り当てと割り当てを担当する中央インターネット割り当てされた数字当局（IANA）を採用してきました[RFC1174]。IPv4アドレス空間の場合、IANAはアドレス空間の一部を、確立されたニーズに応じて地域のインターネットレジストリに割り当てます。これらの地域のインターネットレジストリは、地域内のインターネットのオペレーターとユーザーへのIPv4アドレスの割り当てを担当しています。"
    },
    {
      "indent": 3,
      "text": "Minor portions of the IPv4 address space have been allocated or assigned directly by the IANA for global or other specialized purposes. These allocations and assignments have been documented in a variety of RFCs and other documents. This document is intended to collect these scattered references.",
      "ja": "IPv4アドレススペースのマイナー部分は、グローバルまたはその他の専門的な目的でIANAによって直接割り当てまたは割り当てられています。これらの割り当てと割り当ては、さまざまなRFCやその他の文書に文書化されています。このドキュメントは、これらの散在する参照を収集することを目的としています。"
    },
    {
      "indent": 3,
      "text": "On an ongoing basis, the IANA has been designated by the IETF to make assignments in support of the Internet Standards Process [RFC2860]. Section 4 of this document describes that assignment process.",
      "ja": "継続的に、IANAはIETFによって指定され、インターネット標準プロセス[RFC2860]をサポートするために割り当てを行いました。このドキュメントのセクション4では、その割り当てプロセスについて説明します。"
    },
    {
      "indent": 0,
      "text": "2. Global and Other Specialized Address Blocks",
      "section_title": true,
      "ja": "2. グローバルおよびその他の専門的なアドレスブロック"
    },
    {
      "indent": 3,
      "text": "0.0.0.0/8 - Addresses in this block refer to source hosts on \"this\" network. Address 0.0.0.0/32 may be used as a source address for this host on this network; other addresses within 0.0.0.0/8 may be used to refer to specified hosts on this network [RFC1700, page 4].",
      "ja": "0.0.0.0/8-このブロックのアドレスは、「この」ネットワーク上のソースホストを参照しています。アドレス0.0.0.0/32は、このネットワーク上のこのホストのソースアドレスとして使用できます。0.0.0.0/8以内の他のアドレスを使用して、このネットワークの指定されたホストを参照することができます[RFC1700、4ページ]。"
    },
    {
      "indent": 3,
      "text": "10.0.0.0/8 - This block is set aside for use in private networks. Its intended use is documented in [RFC1918]. Addresses within this block should not appear on the public Internet.",
      "ja": "10.0.0.0/8-このブロックは、プライベートネットワークで使用するために確保されています。その目的の使用は[RFC1918]に記録されています。このブロック内のアドレスは、パブリックインターネットに表示されないでください。"
    },
    {
      "indent": 3,
      "text": "14.0.0.0/8 - This block is set aside for assignments to the international system of Public Data Networks [RFC1700, page 181]. The registry of assignments within this block can be accessed from the \"Public Data Network Numbers\" link on the web page at http://www.iana.org/numbers.html. Addresses within this block are assigned to users and should be treated as such.",
      "ja": "14.0.0.0/8-このブロックは、国際的な公開データネットワーク[RFC1700、181ページ]への割り当てのために確保されています。このブロック内の割り当てのレジストリには、http：//www.iana.org/numbers.htmlのWebページの「パブリックデータネットワーク番号」リンクからアクセスできます。このブロック内のアドレスはユーザーに割り当てられ、そのように扱う必要があります。"
    },
    {
      "indent": 3,
      "text": "24.0.0.0/8 - This block was allocated in early 1996 for use in provisioning IP service over cable television systems. Although the IANA initially was involved in making assignments to cable operators, this responsibility was transferred to American Registry for Internet Numbers (ARIN) in May 2001. Addresses within this block are assigned in the normal manner and should be treated as such.",
      "ja": "24.0.0.0/8-このブロックは、ケーブルテレビシステムを介したIPサービスのプロビジョニングに使用するために1996年初頭に割り当てられました。IANAは当初、ケーブルオペレーターへの割り当てに関与していましたが、この責任は2001年5月にインターネット番号（ARIN）のアメリカの登録簿に移されました。このブロック内の住所は通常の方法で割り当てられ、そのように扱う必要があります。"
    },
    {
      "indent": 3,
      "text": "39.0.0.0/8 - This block was used in the \"Class A Subnet Experiment\" that commenced in May 1995, as documented in [RFC1797]. The experiment has been completed and this block has been returned to the pool of addresses reserved for future allocation or assignment. This block therefore no longer has a special use and is subject to allocation to a Regional Internet Registry for assignment in the normal manner.",
      "ja": "39.0.0.0/8-このブロックは、[RFC1797]に記載されているように、1995年5月に開始された「クラスAサブネット実験」で使用されました。実験が完了し、このブロックは将来の割り当てまたは割り当てのために予約された住所のプールに返されました。したがって、このブロックには特別な使用がなくなり、通常の方法で割り当てのために地域のインターネットレジストリに割り当てられます。"
    },
    {
      "indent": 3,
      "text": "127.0.0.0/8 - This block is assigned for use as the Internet host loopback address. A datagram sent by a higher level protocol to an address anywhere within this block should loop back inside the host. This is ordinarily implemented using only 127.0.0.1/32 for loopback, but no addresses within this block should ever appear on any network anywhere [RFC1700, page 5].",
      "ja": "127.0.0.0/8-このブロックは、インターネットホストループバックアドレスとして使用するために割り当てられています。このブロック内のアドレスに高レベルのプロトコルによって送信されたデータグラムは、ホストの内側に戻る必要があります。これは通常、ループバックの場合は127.0.0.1/32のみを使用して実装されていますが、このブロック内のアドレスはどこにでも表示されないはずです[RFC1700、5ページ]。"
    },
    {
      "indent": 3,
      "text": "128.0.0.0/16 - This block, corresponding to the numerically lowest of the former Class B addresses, was initially and is still reserved by the IANA. Given the present classless nature of the IP address space, the basis for the reservation no longer applies and addresses in this block are subject to future allocation to a Regional Internet Registry for assignment in the normal manner.",
      "ja": "128.0.0.0/16-前者のクラスBアドレスの数値が最も低いものに対応するこのブロックは、最初はIANAによって予約されていました。IPアドレススペースの現在のクラスのない性質を考えると、予約の基礎はもはや適用されず、このブロックのアドレスは、通常の方法で割り当てのための地域のインターネットレジストリへの将来の割り当ての対象となります。"
    },
    {
      "indent": 3,
      "text": "169.254.0.0/16 - This is the \"link local\" block. It is allocated for communication between hosts on a single link. Hosts obtain these addresses by auto-configuration, such as when a DHCP server may not be found.",
      "ja": "169.254.0.0/16-これは「Link Local」ブロックです。単一のリンク上のホスト間の通信に割り当てられます。ホストは、DHCPサーバーが見つからない場合など、自動構成によってこれらのアドレスを取得します。"
    },
    {
      "indent": 3,
      "text": "172.16.0.0/12 - This block is set aside for use in private networks. Its intended use is documented in [RFC1918]. Addresses within this block should not appear on the public Internet.",
      "ja": "172.16.0.0/12-このブロックは、プライベートネットワークで使用するために確保されています。その目的の使用は[RFC1918]に記録されています。このブロック内のアドレスは、パブリックインターネットに表示されないでください。"
    },
    {
      "indent": 3,
      "text": "191.255.0.0/16 - This block, corresponding to the numerically highest to the former Class B addresses, was initially and is still reserved by the IANA. Given the present classless nature of the IP address space, the basis for the reservation no longer applies and addresses in this block are subject to future allocation to a Regional Internet Registry for assignment in the normal manner.",
      "ja": "191.255.0.0/16-このブロックは、以前のクラスBアドレスに数値的に最も高いものに対応しており、最初はIANAによって予約されていました。IPアドレススペースの現在のクラスのない性質を考えると、予約の基礎はもはや適用されず、このブロックのアドレスは、通常の方法で割り当てのための地域のインターネットレジストリへの将来の割り当ての対象となります。"
    },
    {
      "indent": 3,
      "text": "192.0.0.0/24 - This block, corresponding to the numerically lowest of the former Class C addresses, was initially and is still reserved by the IANA. Given the present classless nature of the IP address space, the basis for the reservation no longer applies and addresses in this block are subject to future allocation to a Regional Internet Registry for assignment in the normal manner.",
      "ja": "192.0.0.0/24-このブロックは、前者のクラスCアドレスの数値的に最も低いものに対応しており、最初はIANAによって予約されていました。IPアドレススペースの現在のクラスのない性質を考えると、予約の基礎はもはや適用されず、このブロックのアドレスは、通常の方法で割り当てのための地域のインターネットレジストリへの将来の割り当ての対象となります。"
    },
    {
      "indent": 3,
      "text": "192.0.2.0/24 - This block is assigned as \"TEST-NET\" for use in documentation and example code. It is often used in conjunction with domain names example.com or example.net in vendor and protocol documentation. Addresses within this block should not appear on the public Internet.",
      "ja": "192.0.2.0/24-このブロックは、ドキュメントおよびサンプルコードで使用するための「テストネット」として割り当てられています。多くの場合、ドメイン名のexample.comまたはベンダーおよびプロトコルのドキュメントでexample.netと組み合わせて使用されます。このブロック内のアドレスは、パブリックインターネットに表示されないでください。"
    },
    {
      "indent": 3,
      "text": "192.88.99.0/24 - This block is allocated for use as 6to4 relay anycast addresses, according to [RFC3068].",
      "ja": "192.88.99.0/24-このブロックは、[RFC3068]によると、6to4リレーAnycastアドレスとして使用するために割り当てられています。"
    },
    {
      "indent": 3,
      "text": "192.168.0.0/16 - This block is set aside for use in private networks. Its intended use is documented in [RFC1918]. Addresses within this block should not appear on the public Internet.",
      "ja": "192.168.0.0/16-このブロックは、プライベートネットワークで使用するために確保されています。その目的の使用は[RFC1918]に記録されています。このブロック内のアドレスは、パブリックインターネットに表示されないでください。"
    },
    {
      "indent": 3,
      "text": "198.18.0.0/15 - This block has been allocated for use in benchmark tests of network interconnect devices. Its use is documented in [RFC2544].",
      "ja": "198.18.0.0/15-このブロックは、ネットワーク相互接続デバイスのベンチマークテストで使用するために割り当てられています。その使用は[RFC2544]に記録されています。"
    },
    {
      "indent": 3,
      "text": "223.255.255.0/24 - This block, corresponding to the numerically highest of the former Class C addresses, was initially and is still reserved by the IANA. Given the present classless nature of the IP address space, the basis for the reservation no longer applies and addresses in this block are subject to future allocation to a Regional Internet Registry for assignment in the normal manner.",
      "ja": "223.255.255.0/24-このブロックは、前者のクラスCアドレスの数値に最も高いものに対応していたが、最初はIANAによって予約されている。IPアドレススペースの現在のクラスのない性質を考えると、予約の基礎はもはや適用されず、このブロックのアドレスは、通常の方法で割り当てのための地域のインターネットレジストリへの将来の割り当ての対象となります。"
    },
    {
      "indent": 3,
      "text": "224.0.0.0/4 - This block, formerly known as the Class D address space, is allocated for use in IPv4 multicast address assignments. The IANA guidelines for assignments from this space are described in [RFC3171].",
      "ja": "224.0.0.0/4-以前はクラスDアドレススペースとして知られていたこのブロックは、IPv4マルチキャストアドレスの割り当てで使用するために割り当てられています。このスペースからの割り当てのIANAガイドラインは、[RFC3171]で説明されています。"
    },
    {
      "indent": 3,
      "text": "240.0.0.0/4 - This block, formerly known as the Class E address space, is reserved. The \"limited broadcast\" destination address 255.255.255.255 should never be forwarded outside the (sub-)net of the source. The remainder of this space is reserved for future use. [RFC1700, page 4]",
      "ja": "240.0.0.0/4-以前はクラスEアドレススペースとして知られていたこのブロックは予約されています。「限られた放送」宛先アドレス255.255.255.255は、ソースの（サブ）ネットの外側に転送しないでください。このスペースの残りの部分は、将来の使用のために予約されています。[RFC1700、4ページ]"
    },
    {
      "indent": 0,
      "text": "3. Summary Table",
      "section_title": true,
      "ja": "3. 概要表"
    },
    {
      "indent": 3,
      "text": "Address Block             Present Use                       Reference\n---------------------------------------------------------------------\n0.0.0.0/8            \"This\" Network                 [RFC1700, page 4]\n10.0.0.0/8           Private-Use Networks                   [RFC1918]\n14.0.0.0/8           Public-Data Networks         [RFC1700, page 181]\n24.0.0.0/8           Cable Television Networks                    --\n39.0.0.0/8           Reserved but subject\n                        to allocation                       [RFC1797]\n127.0.0.0/8          Loopback                       [RFC1700, page 5]\n128.0.0.0/16         Reserved but subject\n                        to allocation                             --\n169.254.0.0/16       Link Local                                   --\n172.16.0.0/12        Private-Use Networks                   [RFC1918]\n191.255.0.0/16       Reserved but subject\n                        to allocation                             --\n192.0.0.0/24         Reserved but subject\n                        to allocation                             --\n192.0.2.0/24         Test-Net\n192.88.99.0/24       6to4 Relay Anycast                     [RFC3068]\n192.168.0.0/16       Private-Use Networks                   [RFC1918]\n198.18.0.0/15        Network Interconnect\n                        Device Benchmark Testing            [RFC2544]\n223.255.255.0/24     Reserved but subject\n                        to allocation                             --\n224.0.0.0/4          Multicast                              [RFC3171]\n240.0.0.0/4          Reserved for Future Use        [RFC1700, page 4]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4. Assignments of IPv4 Blocks for New Specialized Uses",
      "section_title": true,
      "ja": "4. 新しい専門用途のIPv4ブロックの割り当て"
    },
    {
      "indent": 3,
      "text": "The IANA has responsibility for making assignments of protocol parameters used in the Internet according to the requirements of the \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\" [RFC2860]. Among other things, [RFC2860] requires that protocol parameters be assigned according to the criteria and procedures specified in RFCs, including Proposed, Draft, and full Internet Standards and Best Current Practice documents, and any other RFC that calls for IANA assignment.",
      "ja": "IANAは、「インターネットに割り当てられた数字当局の技術的作業に関する覚書」[RFC2860]の要件に従って、インターネットで使用されるプロトコルパラメーターの割り当てを行う責任を負っています。とりわけ、[RFC2860]は、提案、ドラフト、および完全な現在の練習文書、およびIANAの割り当てを必要とするその他のRFCを含むRFCSで指定された基準と手順に従ってプロトコルパラメーターを割り当てる必要があります。"
    },
    {
      "indent": 3,
      "text": "The domain name and IP address spaces involve policy issues (in addition to technical issues) so that the requirements of [RFC2860] do not apply generally to those spaces. Nonetheless, the IANA is responsible for ensuring assignments of IPv4 addresses as needed in support of the Internet Standards Process. When a portion of the IPv4 address space is specifically required by an RFC, the technical requirements (e.g., size, prefix length) for the portion should be described [RFC2434]. Immediately before the RFC is published, the IANA will, in consultation with the Regional Internet Registries, make the necessary assignment and notify the RFC Editor of the particulars for inclusion in the RFC as published.",
      "ja": "ドメイン名とIPアドレススペースには、[RFC2860]の要件が一般的にそれらのスペースに適用されないように、ポリシーの問題（技術的な問題に加えて）が含まれます。それにもかかわらず、IANAは、インターネット標準プロセスをサポートするために必要に応じてIPv4アドレスの割り当てを確保する責任があります。IPv4アドレス空間の一部がRFCで特別に必要な場合、部分の技術要件（サイズ、プレフィックスの長さなど）を説明する必要があります[RFC2434]。RFCが公開される直前に、IANAは、地域のインターネットレジストリと協議して、必要な割り当てを行い、公開されているRFCに含めるためにRFCエディターに通知します。"
    },
    {
      "indent": 3,
      "text": "As required by [RFC2860], the IANA will also make necessary experimental assignments of IPv4 addresses, also in consultation with the Regional Internet Registries.",
      "ja": "[RFC2860]で要求されているように、IANAはまた、地域のインターネットレジストリと相談して、IPv4アドレスの必要な実験的割り当ても行います。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The particular assigned values of special-use IPv4 addresses cataloged in this document do not directly raise security issues. However, the Internet does not inherently protect against abuse of these addresses; if you expect (for instance) that all packets from the 10.0.0.0/8 block originate within your subnet, all border routers should filter such packets that originate from elsewhere. Attacks have been mounted that depend on the unexpected use of some of these addresses.",
      "ja": "このドキュメントでカタログされている特別使用IPv4アドレスの特定の割り当てられた値は、セキュリティの問題を直接提起するものではありません。ただし、インターネットは本質的にこれらの住所の乱用から保護していません。10.0.0.0/8ブロックからのすべてのパケットがサブネット内で発生することを（たとえば）期待する場合、すべてのボーダールーターは他の場所から発生するパケットをフィルタリングする必要があります。これらのアドレスの一部の予期しない使用に依存する攻撃が取り付けられています。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document describes the IANA's past and current practices and does not create any new requirements for assignments or allocations by the IANA.",
      "ja": "このドキュメントは、IANAの過去および現在の慣行について説明しており、IANAによる割り当てまたは割り当ての新しい要件を作成しません。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1174] Cerf, V., \"IAB Recommended Policy on Distributing Internet Identifier Assignment and IAB Recommended Policy Change to Internet 'Connected' Status\", RFC 1174, August 1990.",
      "ja": "[RFC1174] Cerf、V。、「IABは、インターネット識別子の割り当ての配布とIABの推奨ポリシーとIABがインターネット「接続」ステータスへのポリシー変更を推奨する」、RFC 1174、1990年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC1700] Reynolds, J. and J. Postel, \"Assigned Numbers\", STD 2, RFC 1700, October 1994.",
      "ja": "[RFC1700] Reynolds、J。およびJ. Postel、「割り当てられた番号」、STD 2、RFC 1700、1994年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC1797] IANA, \"Class A Subnet Experiment\", RFC 1797, April 1995.",
      "ja": "[RFC1797] IANA、「クラスAサブネット実験」、RFC 1797、1995年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, B., Karrenberg, D., de Groot, G. J., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, February 1996.",
      "ja": "[RFC1918] Rekhter、Y.、Moskowitz、B.、Karrenberg、D.、De Groot、G。J.、およびE. Lear、「Private Internetsのアドレス割り当て」、BCP 5、RFC 1918、1996年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC2050] Hubbard, K., Kosters, M., Conrad, D., Karrenberg, D., and J. Postel, \"Internet Registry IP Allocation Guidelines\", BCP 12, RFC 2050, November 1996.",
      "ja": "[RFC2050] Hubbard、K.、Kosters、M.、Conrad、D.、Karrenberg、D.、およびJ. Postel、「インターネットレジストリIP割り当てガイドライン」、BCP 12、RFC 2050、1996年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC2434] Narten, T., and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 2434, October 1998.",
      "ja": "[RFC2434] Narten、T。、およびH. Alvestrand、「RFCSでIANA考慮事項セクションを書くためのガイドライン」、BCP 26、RFC 2434、1998年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC2544] Bradner, S., and J. McQuaid, \"Benchmarking Methodology for Network Interconnect Devices\", RFC 2544, March 1999.",
      "ja": "[RFC2544] Bradner、S。、およびJ. McQuaid、「ネットワーク相互接続デバイスのベンチマーク方法論」、RFC 2544、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2860] Carpenter, B., Baker, F., and M. Roberts, \"Memorandum of Understanding Concerning the Technical Work of the Internet Assigned Numbers Authority\", RFC 2860, June 2000.",
      "ja": "[RFC2860] Carpenter、B.、Baker、F。、およびM. Roberts、「インターネットが割り当てられた数字の権限の技術的作業に関する覚書」、RFC 2860、2000年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3068] Huitema, C., \"An Anycast Prefix for 6to4 Relay Routers\", RFC 3068, June 2001.",
      "ja": "[RFC3068] Huitema、C。、「6to4リレールーターのAnycast Prefix」、RFC 3068、2001年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3171] Albanna, Z., Almeroth, K., Meyer, D., and M. Schipper, \"IANA Guidelines for IPv4 Multicast Address Assignments\", BCP 51, RFC 3171, August 2001.",
      "ja": "[RFC3171] Albanna、Z.、Almeroth、K.、Meyer、D。、およびM. Schipper、「IPv4マルチキャストアドレス割り当てのIANAガイドライン」、BCP 51、RFC 3171、2001年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC3232] Reynolds, J. Ed., \"Assigned Numbers: RFC 1700 is Replaced by an On-line Database\", RFC 3232, January 2002.",
      "ja": "[RFC3232] Reynolds、J。Ed。、「割り当てられた番号：RFC 1700はオンラインデータベースに置き換えられます」、RFC 3232、2002年1月。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8. 謝辞"
    },
    {
      "indent": 3,
      "text": "Many people have made comments on draft versions of this document. The IANA would especially like to thank Scott Bradner, Randy Bush, and Harald Alvestrand for their constructive feedback and comments.",
      "ja": "多くの人々がこのドキュメントのドラフトバージョンについてコメントしています。IANAは、特に、Scott Bradner、Randy Bush、およびHarald Alvestrandの建設的なフィードバックとコメントに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "9. Author's Address",
      "section_title": true,
      "ja": "9. 著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Internet Assigned Numbers Authority (IANA) 4676 Admiralty Way, Suite 330 Marina del Rey, CA 90292-6601",
      "ja": "インターネットが割り当てられた番号局（IANA）4676 Admiralty Way、Suite 330 Marina Del Rey、CA 90292-6601"
    },
    {
      "indent": 3,
      "text": "Phone: +1 310-823-9358\nFax:   +1 310-823-8649\nEMail: iana@iana.org",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "10. Full Copyright Statement",
      "section_title": true,
      "ja": "10. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があり、それについてコメントまたは説明する派生作品、またはその実装を支援することができます。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}