{
  "title": {
    "text": "RFC 3152 - Delegation of IP6.ARPA",
    "ja": "RFC 3152 - IP6.ARPAの委任"
  },
  "number": 3152,
  "created_at": "2023-12-12 13:18:14.984241+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                            R. Bush\nRequest for Comments: 3152                                         RGnet\nBCP: 49                                                      August 2001\nUpdates: 2874, 2772, 2766, 2553, 1886\nCategory: Best Current Practice",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 25,
      "text": "Delegation of IP6.ARPA",
      "ja": "IP6.ARPAの委任"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This document specifies an Internet Best Current Practices for the Internet Community, and requests discussion and suggestions for improvements. Distribution of this memo is unlimited.",
      "ja": "このドキュメントは、インターネットコミュニティのインターネットの最良のプラクティスを指定し、改善のための議論と提案を要求します。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document discusses the need for delegation of the IP6.ARPA DNS zone, and specifies a plan for the technical operation thereof.",
      "ja": "このドキュメントでは、IP6.ARPA DNSゾーンの委任の必要性について説明し、その技術操作の計画を指定します。"
    },
    {
      "indent": 0,
      "text": "1. Why IP6.ARPA?",
      "section_title": true,
      "ja": "1. なぜIP6.arpa？"
    },
    {
      "indent": 3,
      "text": "In the IPv6 address space, there is a need for 'reverse mapping' of addresses to DNS names analogous to that provided by the IN-ADDR.ARPA zone for IPv4.",
      "ja": "IPv6アドレス空間では、IPv4のin-addr.arpaゾーンが提供するDNS名に類似したアドレスの「逆マッピング」が必要です。"
    },
    {
      "indent": 3,
      "text": "The IAB recommended that the ARPA top level domain (the name is now considered an acronym for \"Address and Routing Parameters Area\") be used for technical infrastructure sub-domains when possible. It is already in use for IPv4 reverse mapping and has been established as the location for E.164 numbering on the Internet [RFC2916 RFC3026].",
      "ja": "IABは、ARPAトップレベルドメイン（名前は「アドレスおよびルーティングパラメーター領域」の頭字語と見なされる）を、可能な場合は技術インフラストラクチャサブドメインに使用することを推奨しました。IPv4リバースマッピングにはすでに使用されており、インターネット上のE.164番号の場所として確立されています[RFC2916 RFC3026]。"
    },
    {
      "indent": 3,
      "text": "IETF consensus was reached that the IP6.ARPA domain be used for address to DNS name mapping for the IPv6 address space [RFC2874].",
      "ja": "IETFのコンセンサスに到達したのは、IP6.ARPAドメインを使用して、IPv6アドレス空間[RFC2874]のDNS名マッピングへのアドレスに使用されることに到達しました。"
    },
    {
      "indent": 0,
      "text": "2. Obsoleted Usage",
      "section_title": true,
      "ja": "2. 廃止された使用"
    },
    {
      "indent": 3,
      "text": "This document deprecates references to IP6.INT in [RFC1886] section 2.5, [RFC2553] section 6.2.3, [RFC2766] section 4.1, [RFC2772] section 7.1.c, and [RFC2874] section 2.5.",
      "ja": "このドキュメントは、[RFC1886]セクション2.5、[RFC2553]セクション6.2.3、[RFC2766]セクション4.1、[RFC2772]セクション7.1.c、[RFC2874]セクション2.5のIP6.intへの参照を非難します。"
    },
    {
      "indent": 3,
      "text": "In this context, 'deprecate' means that the old usage is not appropriate for new implementations, and IP6.INT will likely be phased out in an orderly fashion.",
      "ja": "この文脈では、「Deprecate」とは、古い使用法が新しい実装に適していないことを意味し、IP6.intは整然とした方法で段階的に廃止される可能性があります。"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This memo requests that the IANA delegate the IP6.ARPA domain following instructions to be provided by the IAB. Names within this zone are to be further delegated to the regional IP registries in accordance with the delegation of IPv6 address space to those registries. The names allocated should be hierarchic in accordance with the address space assignment.",
      "ja": "このメモは、IABがIABが提供する命令に従ってIP6.ARPAドメインをIAAB.ARPAドメインに委任することを要求します。このゾーン内の名前は、IPv6アドレススペースの委任に従って、これらのレジストリへの委任に従って、地域のIPレジストリにさらに委任されます。割り当てられた名前は、アドレススペースの割り当てに従って階層的でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "While DNS spoofing of address to name mapping has been exploited in IPv4, delegation of the IP6.ARPA zone creates no new threats to the security of the internet.",
      "ja": "IPv4では、名前マッピングへのアドレスのDNSスプーフィングが悪用されていますが、IP6.ARPAゾーンの委任はインターネットのセキュリティに対する新しい脅威を生み出しません。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1886] Thomson, S. and C. Huitema, \"DNS Extensions to support IP version 6\", RFC 1886, December 1995.",
      "ja": "[RFC1886] Thomson、S。およびC. Huitema、「IPバージョン6をサポートするDNS拡張」、RFC 1886、1995年12月。"
    },
    {
      "indent": 3,
      "text": "[RFC2553] Gilligan, R., Thomson, S., Bound, J. and W. Stevens, \"Basic Socket Interface Extensions for IPv6\", RFC 2553, March 1999.",
      "ja": "[RFC2553] Gilligan、R.、Thomson、S.、Bound、J。and W. Stevens、「IPv6用の基本ソケットインターフェイス拡張」、RFC 2553、1999年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2766] Tsirtsis, G. and P. Srisuresh, \"Network Address Translation - Protocol Translation (NAT-PT)\", RFC 2766, February 2000.",
      "ja": "[RFC2766] Tsirtsis、G。およびP. Srisuresh、「ネットワークアドレス翻訳 - プロトコル翻訳（NAT -PT）」、RFC 2766、2000年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC2772] Rockell, R. and R. Fink, \"6Bone Backbone Routing Guidelines\", RFC 2772, February 2000.",
      "ja": "[RFC2772] Rockell、R。およびR. Fink、「6boneバックボーンルーティングガイドライン」、RFC 2772、2000年2月。"
    },
    {
      "indent": 3,
      "text": "[RFC2874] Crawford, M. and C. Huitema, \"DNS Extensions to Support IPv6 Address Aggregation and Renumbering\", RFC 2874, July 2001.",
      "ja": "[RFC2874] Crawford、M。およびC. Huitema、「IPv6アドレスの集約と改修をサポートするDNS拡張」、RFC 2874、2001年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC2916] Faltstrom, P., \"E.164 number and DNS\", RFC 2916, September 2000.",
      "ja": "[RFC2916] Faltstrom、P。、 \"E.164番号とDNS\"、RFC 2916、2000年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC3026] Blane, R., \"Liaison to IETF/ISOC on ENUM\", RFC 3026, January 2001.",
      "ja": "[RFC3026] Blane、R。、「列挙上のIETF/ISOCへのリエゾン」、RFC 3026、2001年1月。"
    },
    {
      "indent": 0,
      "text": "6. Author's Address",
      "section_title": true,
      "ja": "6. 著者の連絡先"
    },
    {
      "indent": 3,
      "text": "Randy Bush 5147 Crystal Springs Bainbridge Island, WA US-98110",
      "ja": "ランディブッシュ5147クリスタルスプリングスベインブリッジ島、ワシントン州US-98110"
    },
    {
      "indent": 3,
      "text": "Phone: +1 206 780 0431\nEMail: randy@psg.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2001). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2001）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があり、それについてコメントまたは説明する派生作品、またはその実装を支援することができます。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}