{
  "title": {
    "text": "RFC 3531 - A Flexible Method for Managing the Assignment of Bits of an IPv6 Address Block",
    "ja": "RFC 3531 - IPv6アドレスブロックのビットの割り当てを管理するための柔軟な方法"
  },
  "number": 3531,
  "created_at": "2019-10-19 08:58:53.341902+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                        M. Blanchet\nRequest for Comments: 3531                                      Viagenie\nCategory:Informational                                        April 2003",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 9,
      "text": "A Flexible Method for Managing the Assignment of Bits\n               of an IPv6 Address Block",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "このメモの位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモはインターネットコミュニティのための情報を提供します。それはどんな種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document proposes a method to manage the assignment of bits of an IPv6 address block or range. When an organisation needs to make an address plan for its subnets or when an ISP needs to make an address plan for its customers, this method enables the organisation to postpone the final decision on the number of bits to partition in the address space they have. It does it by keeping the bits around the borders of the partition to be free as long as possible. This scheme is applicable to any bits addressing scheme using bits with partitions in the space, but its first intended use is for IPv6. It is a generalization of RFC 1219 and can be used for IPv6 assignments.",
      "ja": "この文書は、IPv6アドレスブロックまたは範囲のビットの割り当てを管理するための方法を提案します。組織は、そのサブネットまたはISPが顧客のためのアドレス計画を作成する必要がある場合、このメソッドは、彼らが持っているアドレス空間に分割するビット数の最終決定を延期する組織を可能にするためのアドレス計画を作成する必要がある場合。これは、可能な限り自由であるために、パーティションの境界の周りにビットを保つことによってそれをしません。この方式は、空間内のパーティションを持つビットを使用してアドレス指定方式を任意のビットに適用されるが、その最初の意図された使用は、IPv6のためです。これは、RFC 1219の一般化したものであるとIPv6の割り当てのために使用することができます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Rationale  . . . . . . . . . . . . . . . . . . . . . . . . . .  2\n2.  Scheme . . . . . . . . . . . . . . . . . . . . . . . . . . . .  2\n3.  Description of the Algorithm . . . . . . . . . . . . . . . . .  3\n  3.1 Leftmost . . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  3.2 Rightmost  . . . . . . . . . . . . . . . . . . . . . . . . .  3\n  3.3 Centermost . . . . . . . . . . . . . . . . . . . . . . . . .  4\n4.  Example  . . . . . . . . . . . . . . . . . . . . . . . . . . .  4\n5.  Security Considerations  . . . . . . . . . . . . . . . . . . .  5\n6.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . .  5\n    References . . . . . . . . . . . . . . . . . . . . . . . . . .  6\n    Author's Address . . . . . . . . . . . . . . . . . . . . . . .  6\n    Full Copyright Statement . . . . . . . . . . . . . . . . . . .  7",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Rationale",
      "section_title": true,
      "ja": "1.理由"
    },
    {
      "indent": 3,
      "text": "IPv6 addresses have a flexible structure for address assignments. This enables registries, internet service providers, network designers and others to assign address ranges to organizations and networks based on different criteria, like size of networks, estimated growth rate, etc. Often, the initial assignment doesn't scale well because a small network becomes larger than expected, needing more addresses. But then, the assignment authority cannot allocate contiguous addresses because they were already assigned to another network.",
      "ja": "IPv6アドレスは、アドレスの割り当てのための柔軟な構造を持っています。これは多くの場合、初期割り当てがうまくスケールしないなどのネットワークの大きさ、推定成長率、などのさまざまな基準に基づいて、組織やネットワークにアドレス範囲を割り当てるためにレジストリ、インターネットサービスプロバイダ、ネットワーク設計などを可能に小規模なネットワーク理由複数のアドレスを必要とする、予想よりも大きくなります。彼らはすでに別のネットワークに割り当てられていたので、しかし、その後、割り当て権限は、連続したアドレスを割り当てることができません。"
    },
    {
      "indent": 3,
      "text": "RFC 1219 [1] describes an allocation scheme for IPv4 where address space is kept unallocated between the leftmost bits of the subnet part and the rightmost bits of the host part of the address. This enables the network designer to change the subnet mask without renumbering, for the central bits not allocated.",
      "ja": "RFC 1219 [1]はアドレス空間がサブネット部の左端のビットとアドレスのホスト部分の右端のビット間の未割り当て保たれるIPv4の割り当て方式を説明しています。これは、割り当てられていない中央のビットについて、番号を付け替えることなく、サブネットマスクを変更するネットワーク設計を可能にします。"
    },
    {
      "indent": 3,
      "text": "This work generalizes the previous scheme by extending the algorithm so it can be applied on any part of an IP address, which are assigned by any assignment authority level (registries, ISPs of any level, organizations, ...). It can be used for both IPv4 and IPv6.",
      "ja": "この作品は、それが任意の割り当て権限レベル（レジストリ、任意のレベルのISPは、組織、...）によって割り当てられたIPアドレスのどの部分に適用することができるようにアルゴリズムを拡張することにより、以前の方式を一般化します。これは、IPv4とIPv6の両方に使用することができます。"
    },
    {
      "indent": 3,
      "text": "This document does not provide any recommendation to registries on how to assign address ranges to their customers.",
      "ja": "この文書では、顧客へのアドレス範囲を割り当てる方法のレジストリへの勧告を提供していません。"
    },
    {
      "indent": 0,
      "text": "2. Scheme",
      "section_title": true,
      "ja": "2.スキーム"
    },
    {
      "indent": 3,
      "text": "We define parts of the IP address as p1, p2 , p3, ... pN in order, so that an IP address is composed of these parts contiguously. Boundaries between each part are based on the prefix assigned by the next level authority. Part p1 is the leftmost part probably assigned to a registry, Part p2 can be allocated to a large internet service provider or to a national registry. Part p3 can be allocated to a large customer or a smaller provider, etc. Each part can be of different length. We define l(pX) the length of part X.",
      "ja": "IPアドレスが連続してこれらの部品で構成されているように、私たちは、順番にP1、P2、P3、... pNのようにIPアドレスの部分を定義します。各部品間の境界は、次のレベルの権威によって割り当てられたプレフィックスに基づいています。部分P1は、おそらくレジストリに割り当てられた左端の部分であり、部分P2は、大規模なインターネットサービスプロバイダや国別登録簿に割り当てることができます。部分P3は、各部分が異なる長さのものとすることができる大規模な顧客以下のプロバイダなどに割り当てることができます。我々は、L（ピクセル）部分Xの長さを定義します"
    },
    {
      "indent": 3,
      "text": "+------+------+------+------+------+------+\n| p1   | p2   | p3   | p4   | ...  | pN   |\n+------+------+------+------+------+------+\n<------- ipv6 or ipv4 address ------------>",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The algorithm for allocating addresses is as follows: a) for the leftmost part (p1), assign addresses using the leftmost bits first b) for the rightmost part (pN), assign addresses using the rightmost bits first c) for all other parts (center parts), predefine an arbitrary boundary (prefix) and then assign addresses using the center bits first of the part being assigned.",
      "ja": "次のようにアドレスを割り当てるためのアルゴリズムは次のとおりである：a）左端部（P1）のために、他のすべての部分のために）最初b）の右端部（PN）のために、右端のビットの最初のCを使用してアドレスを割り当てる左端のビットを使用してアドレスを割り当てます（中央部）が、任意の境界（接頭辞）を事前に定義し、次に割り当てられる最初の部分の中央のビットを用いてアドレスを割り当てます。"
    },
    {
      "indent": 3,
      "text": "This algorithm grows assigned bits in such way that it keeps unassigned bits near the boundary of the parts. This means that the prefix between any two parts can be changed forward or backward, later on, up to the assigned bits.",
      "ja": "このアルゴリズムは、部品の境界付近に割り当てられていないビットを保つようにビットが割り当てられて成長します。これは、任意の2つの部分の間のプレフィックスが割り当てられたビットまで、後に、前方または後方に変更することができることを意味します。"
    },
    {
      "indent": 0,
      "text": "3. Description of the Algorithm",
      "section_title": true,
      "ja": "アルゴリズムの説明3。"
    },
    {
      "indent": 3,
      "text": "This section describes the assignment of leftmost bits, rightmost bits and centermost bits.",
      "ja": "このセクションでは、左端のビットで、右端のビットと真ん中のビットの割り当てを記述する。"
    },
    {
      "indent": 0,
      "text": "3.1 Leftmost",
      "section_title": true,
      "ja": "左端3.1"
    },
    {
      "indent": 3,
      "text": "p1 will be assigned in order as follows:",
      "ja": "次のようにp1は順番に割り当てられます。"
    },
    {
      "indent": 4,
      "text": "Order Assignment 1 00000000 2 10000000 3 01000000 4 11000000 5 00100000 6 10100000 7 01100000 8 11100000 9 00010000 ...",
      "ja": "注文割り当て1 00000000 2 10000000 3 01000000 4 11000000 5 00100000 6 10100000 7 01100000 8 11100000 9 00010000 ..."
    },
    {
      "indent": 3,
      "text": "This is actually a mirror of binary counting.",
      "ja": "これは実際にバイナリカウントの鏡です。"
    },
    {
      "indent": 0,
      "text": "3.2 Rightmost",
      "section_title": true,
      "ja": "右端3.2"
    },
    {
      "indent": 3,
      "text": "pN (the last part) will be assigned in order as follows:",
      "ja": "（最後の部分）上で次のように順番に割り当てられます。"
    },
    {
      "indent": 4,
      "text": "Order Assignment 1 00000000 2 00000001 3 00000010 4 00000011 5 00000100 6 00000101 7 00000110 8 00000111 9 00001000 ...",
      "ja": "注文割り当て1 00000000 2 00000001 3 00000010 4 00000011 5 00000100 6 00000101 7 00000110 8 00000111 9 00001000 ..."
    },
    {
      "indent": 0,
      "text": "3.3 Centermost",
      "section_title": true,
      "ja": "真ん中の3.3"
    },
    {
      "indent": 3,
      "text": "pX (where 1 < X < N) will be assigned in order as follows: (for example, with a 8 bit predefined length l(pX)=8))",
      "ja": "pXの（1 <X <N）は、以下のように順番に割り当てられます（例えば、8ビットの事前定義された長さL（ピクセル）=で8））"
    },
    {
      "indent": 4,
      "text": "Order Assignment 1 00000000 2 00001000 3 00010000 4 00011000 5 00000100 6 00001100 7 00010100 8 00011100 9 00100000 ...",
      "ja": "注文割り当て1 00000000 2 00001000 3 00010000 4 00011000 5 00000100 6 00001100 7 00010100 8 00011100 9 00100000 ..."
    },
    {
      "indent": 3,
      "text": "The bits are assigned using the following algorithm:",
      "ja": "ビットは、以下のアルゴリズムを使用して割り当てられています。"
    },
    {
      "indent": 3,
      "text": "1. The first round is to select only the middle bit (and if there is an even number of bits pick the bit following the center)",
      "ja": "1.最初のラウンドは、中間のビットを選択することである（そしてビットの偶数である場合に中央以下ビットを選択します）"
    },
    {
      "indent": 3,
      "text": "2. Create all combinations using the selected bits that haven't yet been created.",
      "ja": "2.まだ作成されていない選択されたビットを使用してすべての組み合わせを作成します。"
    },
    {
      "indent": 3,
      "text": "3. Start a new round by adding one more bit to the set. In even rounds add the preceding bit to the set. In odd rounds add the subsequent bit to the set.",
      "ja": "3.セットに1つのより多くのビットを追加することによって、新しいラウンドを開始します。偶数ラウンドでセットに先行するビットを追加します。奇数ラウンドでセットに後続ビットを追加します。"
    },
    {
      "indent": 3,
      "text": "4. Repeat 2 and 3 until there are no more bits to consider.",
      "ja": "4.繰り返し2と3を検討するために、それ以上のビットがなくなるまで。"
    },
    {
      "indent": 0,
      "text": "4. Example",
      "section_title": true,
      "ja": "4.例"
    },
    {
      "indent": 3,
      "text": "As an example, a provider P1 has been assigned the 3ffe:0b00/24 prefix and wants to assign prefixes to its connected networks. It anticipates in the foreseeable future a maximum of 256 customers consuming 8 bits. One of these customers, named C2, anticipates a maximum of 1024 customer's assignments under it, consuming 10 other bits.",
      "ja": "一例として、プロバイダP1は3FFE割り当てられている：0b00と/ 24プレフィックスを、その接続されたネットワークへのプレフィックスを割り当てることを望みます。これは、近い将来に8ビットを消費する256人の顧客の最大を見込んでいます。 C2という名前のこれらの顧客の一つは、他の10ビットを消費し、その下の1024の、顧客の割り当ての最大を見込んでいます。"
    },
    {
      "indent": 3,
      "text": "The assignment will be as follows, not showing the first 24 leftmost bits (3ffe:0b00/24: 00111111 11111110 00001011):",
      "ja": "第24左端のビットを示していない、次のように割り当てがされる（3FFEを：0b00と/ 24：00111111 11111110 00001011）。"
    },
    {
      "indent": 3,
      "text": "P1 assigns address space to its customers using leftmost bits:",
      "ja": "P1は、左端のビットを使用して、顧客にアドレス空間を割り当てます。"
    },
    {
      "indent": 4,
      "text": "10000000 : assigned to C1 01000000 : assigned to C2 11000000 : assigned to C3 00100000 : assigned to C4 ...",
      "ja": "10000000：01000000 C1に割り当てられた：11000000 C2に割り当てられた：00100000 C3に割り当てられた：C4に割り当て..."
    },
    {
      "indent": 3,
      "text": "C2 assigns address space to its customers (C2C1, C2C2, ...) using centermost bits:",
      "ja": "C2は、真ん中のビットを使用して、顧客（C2C1、C2C2、...）にアドレス空間を割り当てます。"
    },
    {
      "indent": 4,
      "text": "0000010000 : assigned to C2C1 0000100000 : assigned to C2C2 0000110000 : assigned to C2C3 ...",
      "ja": "0000010000：C2C1 0000100000に割り当てられている：C2C2 0000110000に割り当てられている：C2C3に割り当てられています..."
    },
    {
      "indent": 3,
      "text": "Customers of C2 can use centermost bits for maximum flexibility and then the last aggregators (should be a network in a site) will be assigned using rightmost bits.",
      "ja": "C2の顧客が最大の柔軟性のために真ん中のビットを使用することができ、その後、最後のアグリゲータは、右端のビットを使用して割り当てられます（サイト内ネットワークであるべきです）。"
    },
    {
      "indent": 3,
      "text": "Putting all bits together for C2C3:\nP1                        |C2      |C2C3\n00111111 11111110 00001011 01000000 00001100 00\n                              <------->    <------>\n                                  growing bits",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "By using this method, P1 will be able to expand the number of customers and the customers will be able to modify their first assumptions about the size of their own customers, until the \"reserved\" bits are assigned.",
      "ja": "この方法を用いることにより、P1は、顧客の数を拡張することができるであろうし、「Reserved」のビットが割り当てられるまでの顧客は、自分の顧客のサイズについての彼らの最初の仮定を変更することができるであろう。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "Address assignment doesn't seem to have any specific security consideration.",
      "ja": "アドレスの割り当ては、任意の特定のセキュリティ配慮を持っていないようです。"
    },
    {
      "indent": 0,
      "text": "6. Acknowledgements",
      "section_title": true,
      "ja": "6.謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Steve Deering, Bob Hinden, Thomas Narten, Erik Nordmark, Florent Parent and Jocelyn Picard for their very useful comments on this work.",
      "ja": "この作品で彼らの非常に有益なコメントについてスティーブデアリング、ボブHindenとトーマスNarten氏、エリックNordmarkと、フロラン親とジョセリンピカードに感謝します。"
    },
    {
      "indent": 0,
      "text": "References",
      "ja": "リファレンス"
    },
    {
      "indent": 3,
      "text": "[1] Tsuchiya, P., \"On the assignment of subnet numbers\", RFC 1219, April 1991.",
      "ja": "[1]、RFC 1219、1991年4月 \"サブネット番号の割り当てについて\" 土屋、P.、。"
    },
    {
      "indent": 3,
      "text": "[2] Bradner, S., \"The Internet Standards Process -- Revision 3\", BCP 9, RFC 2026, October 1996.",
      "ja": "[2]ブラドナーの、S.、 \"インターネット標準化プロセス - リビジョン3\"、BCP 9、RFC 2026、1996年10月。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Marc Blanchet Viagenie 2875 boul. Laurier, bureau 300 Sainte-Foy, QC G1V 2M2 Canada",
      "ja": "マルク・ブランシェViagénie2875 BOUL。ローリエ、スイート300サント・フォワ、QC G1V 2M2カナダ"
    },
    {
      "indent": 3,
      "text": "Phone: +1 418 656 9254 EMail: Marc.Blanchet@viagenie.qc.ca URI: http://www.viagenie.qc.ca/",
      "ja": "電話：+1 418 656 9254 Eメール：Marc.Blanchet@viagenie.qc.ca URI：http://www.viagenie.qc.ca/"
    },
    {
      "indent": 0,
      "text": "Full Copyright Statement",
      "ja": "完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2003). All Rights Reserved.",
      "ja": "著作権（C）インターネット協会（2003）。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "この文書とその翻訳は、コピーして他の人に提供し、それ以外についてはコメントまたは派生物は、いかなる種類の制限もなく、全体的にまたは部分的に、準備コピーし、公表して配布することができることを説明したり、その実装を支援することができます、上記の著作権表示とこの段落は、すべてのそのようなコピーや派生物に含まれていることを条件とします。しかし、この文書自体は著作権のための手順はで定義されている場合には、インターネット標準を開発するために必要なものを除き、インターネットソサエティもしくは他のインターネット関連団体に著作権情報や参照を取り除くなど、どのような方法で変更されないかもしれませんインターネット標準化プロセスが続く、または英語以外の言語に翻訳するために、必要に応じなければなりません。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の制限は永久で、インターネット学会やその後継者や譲渡者によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "この文書とここに含まれている情報は、基礎とインターネットソサエティおよびインターネットエンジニアリングタスクフォースはすべての保証を否認し、明示または黙示、その情報の利用がない任意の保証を含むがこれらに限定されない「として、」上に設けられています特定の目的への権利または商品性または適合性の黙示の保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFC Editor機能のための基金は現在、インターネット協会によって提供されます。"
    }
  ]
}