{
  "title": {
    "text": "RFC 3359 - Reserved Type, Length and Value (TLV) Codepoints in Intermediate System to Intermediate System",
    "ja": "RFC 3359 - 中間システムの中間システムの予約型、長さ、値（TLV）コードポイント"
  },
  "number": 3359,
  "created_at": "2023-11-16 15:17:17.102495+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Network Working Group                                      T. Przygienda\nRequest for Comments: 3359                                         Xebeo\nCategory: Informational                                      August 2002",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Reserved Type, Length and Value (TLV) Codepoints in Intermediate System to Intermediate System",
      "ja": "中間システムの中間システムの予約型、長さ、値（TLV）コードポイント"
    },
    {
      "indent": 0,
      "text": "Status of this Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This memo provides information for the Internet community. It does not specify an Internet standard of any kind. Distribution of this memo is unlimited.",
      "ja": "このメモは、インターネットコミュニティに情報を提供します。いかなる種類のインターネット標準を指定しません。このメモの配布は無制限です。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes implementation codepoints within Intermediate System to Intermediate System (IS-IS) used today by several ISPs for routing within their clouds. IS-IS is an interior gateway routing protocol developed originally by OSI and used with IP extensions as Interior Gateway Protocol (IGP). This document summarizes all Table, Length and Value (TLV) codepoints that are being used by the protocol and its pending extensions.",
      "ja": "このドキュメントでは、クラウド内でのルーティングのためにいくつかのISPが今日使用している中間システム内の中間システム（IS-IS）内の実装コードポイントについて説明しています。IS-ISは、元々OSIによって開発されたインテリアゲートウェイルーティングプロトコルであり、IP拡張機能でインテリアゲートウェイプロトコル（IGP）として使用されます。このドキュメントは、プロトコルとその保留中の拡張で使用されているすべてのテーブル、長さ、値（TLV）コードポイントを要約します。"
    },
    {
      "indent": 0,
      "text": "1. TLV Codepoints Reserved",
      "section_title": true,
      "ja": "1. TLVコードポイントは予約されています"
    },
    {
      "indent": 3,
      "text": "_____________________________________________________________________\n Name                    Value  IIH   LSP   SNP  Status",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "_____________________________________________________________________",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "Area Addresses            1  y     y     n    ISO 10589\nIIS Neighbors             2  n     y     n    ISO 10589\nES Neighbors              3  n     y     n    ISO 10589\nPart. DIS                 4  n     y     n    ISO 10589\nPrefix Neighbors          5  n     y     n    ISO 10589\nIIS Neighbors             6  y     n     n    ISO 10589\nPadding                   8  y     n     n    ISO 10589\nLSP Entries               9  n     n     y    ISO 10589\nAuthentication           10  y     y     y    ISO 10589\nOpt. Checksum            12  y     n     y    IETF-draft\nLSPBufferSize            14  n     y     n    ISO 10589 Rev 2 Draft\nTE IIS Neigh.            22  n     y     n    IETF-draft\nDECnet Phase IV          42  y     n     n    DEC (ancient)\nLucent Proprietary       66  n     y     n\nIP Int. Reach           128  n     y     n    RFC 1195\nProt. Supported         129  y     y     n    RFC 1195\nIP Ext. Address         130  n     y     n    RFC 1195\nIDRPI                   131  n     y     y    RFC 1195\nIP Intf. Address        132  y     y     n    RFC 1195\nIllegal                 133  n     n     n    RFC 1195 (not used)\nRouter ID               134  n     y     n    IETF-draft\nTE IP. Reach            135  n     y     n    IETF-draft\nDynamic Name            137  n     y     n    RFC 2763\nNortel Proprietary      176  n     y     n\nNortel Proprietary      177  n     y     n\nRestart TLV             211  y     n     n    IETF-draft\nMT-ISN                  222  n     y     n    IETF-draft\nM-Topologies            229  y     y     n    IETF-draft\nIPv6 Intf. Addr.        232  y     y     n    IETF-draft\nMT IP. Reach            235  n     y     n    IETF-draft\nIPv6 IP. Reach          236  n     y     n    IETF-draft\nMT IPv6 IP. Reach       237  n     y     n    IETF-draft\nP2P Adjacency State     240  y     n     n    IETF-draft",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "2. Assignment Procedures",
      "section_title": true,
      "ja": "2. 割り当て手順"
    },
    {
      "indent": 3,
      "text": "This document is provided to avoid possible future conflicts in the assignment of TLV numbers. It does not constitute or represent any standard or authority assigning TLV numbers. TLV assignment happens on a shared, informational basis between the ISO, SIF and the IETF working groups. The core ISIS protocol is being specified in the ISO standards body, IP extensions to it however are products of the ISIS working group in IETF. Since ISO does not provide a numbering authority and IANA is only responsible for IP related coding points, no plausible central authority to assign TLV numbers exists as of today.",
      "ja": "このドキュメントは、TLV数の割り当てにおける将来の競合の可能性を回避するために提供されます。TLV番号を割り当てる標準または権限を構成または表すものではありません。TLVの割り当ては、ISO、SIF、およびIETFワーキンググループの間で共有された情報ベースで行われます。Core ISISプロトコルはISO標準本体で指定されていますが、IP拡張機能はIETFのISISワーキンググループの製品です。ISOは番号付け当局を提供しておらず、IANAはIP関連のコーディングポイントのみを担当しているため、今日の時点でTLV番号を割り当てる妥当な中央当局は存在しません。"
    },
    {
      "indent": 3,
      "text": "This document will be periodically updated by newer versions in the fashion of [RP94] and successors. It may be replaced at any given point in time by some type of official registry.",
      "ja": "このドキュメントは、[RP94]と後継者のファッションで新しいバージョンによって定期的に更新されます。特定の時点で、何らかのタイプの公式レジストリに置き換えることができます。"
    },
    {
      "indent": 3,
      "text": "This document will not indicate specific documents using the codepoints, nor will it resolve the sub-TLV codepoints.",
      "ja": "このドキュメントは、コードポイントを使用した特定のドキュメントを示すものではなく、サブTLVコードポイントを解決することもありません。"
    },
    {
      "indent": 0,
      "text": "3. Acknowledgments",
      "section_title": true,
      "ja": "3. 謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Les Ginsberg and others for pointing out details and improving this work.",
      "ja": "詳細を指摘し、この作業を改善してくれたLes Ginsbergなどに感謝します。"
    },
    {
      "indent": 0,
      "text": "4. Security Consideration",
      "section_title": true,
      "ja": "4. セキュリティ対価"
    },
    {
      "indent": 3,
      "text": "ISIS security applies to the work presented. No specific security issues are being introduced.",
      "ja": "ISISセキュリティは、提示された作業に適用されます。特定のセキュリティの問題は導入されていません。"
    },
    {
      "indent": 0,
      "text": "5. References",
      "section_title": true,
      "ja": "5. 参考文献"
    },
    {
      "indent": 3,
      "text": "[Cal90a] R. Callon. OSI ISIS Intradomain Routing Protocol. INTERNET-RFC, Internet Engineering Task Force, February 1990.",
      "ja": "[Cal90a] R. Callon。OSI ISIS INTRADOMAINルーティングプロトコル。Internet-RFC、インターネットエンジニアリングタスクフォース、1990年2月。"
    },
    {
      "indent": 3,
      "text": "[Cal90b] R. Callon. Use of OSI ISIS for Routing in TCP/IP and Dual Environments. INTERNET-RFC, Internet Engineering Task Force, December 1990.",
      "ja": "[Cal90b] R. Callon。TCP/IPおよびデュアル環境でのルーティングのためのOSI ISISの使用。インターネットRFC、インターネットエンジニアリングタスクフォース、1990年12月。"
    },
    {
      "indent": 3,
      "text": "[ISO90] ISO. Information Technology - Telecommunications and Information Exchange between Systems - Intermediate System to Intermediate System Routing Exchange Protocol for Use in Conjunction with the Protocol for Providing the Connectionless-Mode Network Service. ISO, 1990.",
      "ja": "[ISO90] ISO。情報技術 - 電気通信とシステム間の情報交換 -  Connectionless -Modeネットワークサービスを提供するためのプロトコルと併用するための中間システムから中間システムルーティング交換プロトコル。ISO、1990。"
    },
    {
      "indent": 3,
      "text": "[RP94] Reynolds, J., \"Assigned Numbers; RFC 1700 is Replaced by an On-line Database\", RFC 3232, January, 2002.",
      "ja": "[RP94] Reynolds、J。、「割り当てられた番号、RFC 1700はオンラインデータベースに置き換えられます」、RFC 3232、2002年1月。"
    },
    {
      "indent": 0,
      "text": "6. Authors' Addresses",
      "section_title": true,
      "ja": "6. 著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Tony Przygienda Xebeo One Cragwood Road South Plainfield, NJ 07080",
      "ja": "Tony Przygienda Xebeo One Cragwood Road South Plainfield、NJ 07080"
    },
    {
      "indent": 3,
      "text": "Phone: (908) 222 4225 Email: prz@xebeo.com",
      "ja": "電話：（908）222 4225メール：prz@xebeo.com"
    },
    {
      "indent": 0,
      "text": "7. Full Copyright Statement",
      "section_title": true,
      "ja": "7. 完全な著作権声明"
    },
    {
      "indent": 3,
      "text": "Copyright (C) The Internet Society (2002). All Rights Reserved.",
      "ja": "Copyright（c）The Internet Society（2002）。無断転載を禁じます。"
    },
    {
      "indent": 3,
      "text": "This document and translations of it may be copied and furnished to others, and derivative works that comment on or otherwise explain it or assist in its implementation may be prepared, copied, published and distributed, in whole or in part, without restriction of any kind, provided that the above copyright notice and this paragraph are included on all such copies and derivative works. However, this document itself may not be modified in any way, such as by removing the copyright notice or references to the Internet Society or other Internet organizations, except as needed for the purpose of developing Internet standards in which case the procedures for copyrights defined in the Internet Standards process must be followed, or as required to translate it into languages other than English.",
      "ja": "このドキュメントと翻訳は他の人にコピーされて提供される場合があります。また、それについてコメントまたは説明する派生作品、またはその実装を支援することは、いかなる種類の制限なしに、準備、コピー、公開、および部分的に配布される場合があります。、上記の著作権通知とこの段落がそのようなすべてのコピーとデリバティブ作品に含まれている場合。ただし、このドキュメント自体は、インターネット協会や他のインターネット組織への著作権通知や参照を削除するなど、いかなる方法でも変更できない場合があります。インターネット標準プロセスに従うか、英語以外の言語に翻訳するために必要な場合に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "The limited permissions granted above are perpetual and will not be revoked by the Internet Society or its successors or assigns.",
      "ja": "上記の限られた許可は永続的であり、インターネット社会またはその後継者または譲受人によって取り消されることはありません。"
    },
    {
      "indent": 3,
      "text": "This document and the information contained herein is provided on an \"AS IS\" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.",
      "ja": "このドキュメントと本書に含まれる情報は、「現状」に基づいて提供されており、インターネット社会とインターネットエンジニアリングタスクフォースは、ここにある情報の使用が行われないという保証を含むがこれらに限定されないすべての保証を否認します。特定の目的に対する商品性または適合性の権利または黙示的な保証を侵害します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgement",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Funding for the RFC Editor function is currently provided by the Internet Society.",
      "ja": "RFCエディター機能の資金は現在、インターネット協会によって提供されています。"
    }
  ]
}