{
  "title": {
    "text": "RFC 7999 - BLACKHOLE Community",
    "ja": "RFC 7999 - BLACKHOLEコミュニティ"
  },
  "number": 7999,
  "created_at": "2019-11-03 07:37:09.903933+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           T. King\nRequest for Comments: 7999                                    C. Dietzel\nCategory: Informational                                           DE-CIX\nISSN: 2070-1721                                              J. Snijders\n                                                                     NTT\n                                                              G. Doering\n                                                             SpaceNet AG\n                                                              G. Hankins\n                                                                   Nokia\n                                                            October 2016",
      "raw": true
    },
    {
      "indent": 26,
      "text": "BLACKHOLE Community",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the use of a well-known Border Gateway Protocol (BGP) community for destination-based blackholing in IP networks. This well-known advisory transitive BGP community named \"BLACKHOLE\" allows an origin Autonomous System (AS) to specify that a neighboring network should discard any traffic destined towards the tagged IP prefix.",
      "ja": "この文書では、IPネットワーク内の宛先ベースのブラックホールのためのよく知られたボーダーゲートウェイプロトコル（BGP）コミュニティの使用を記載しています。 「BLACKHOLE」という名前のこの有名な助言推移BGPコミュニティは、原点自律システム（AS）は、隣接ネットワークがタグ付けされたIPプレフィックスに向けて宛てのトラフィックを破棄するように指定することができます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7999.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7999で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2016 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n   1.1. Requirements Language ......................................3\n2. BLACKHOLE Community .............................................4\n3. Operational Recommendations .....................................4\n   3.1. IP Prefix Announcements with BLACKHOLE Community Attached ..4\n   3.2. Local Scope of Blackholes ..................................4\n   3.3. Accepting Blackholed IP Prefixes ...........................5\n4. Vendor Implementation Recommendations ...........................6\n5. IANA Considerations .............................................6\n6. Security Considerations .........................................6\n7. References ......................................................7\n   7.1. Normative References .......................................7\n   7.2. Informative References .....................................7\nAcknowledgements ...................................................8\nAuthors' Addresses .................................................9",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Network infrastructures have been increasingly hampered by DDoS attacks. In order to dampen the effects of these DDoS attacks, IP networks have offered blackholing with BGP [RFC4271] using various mechanisms such as those described in [RFC3882] and [RFC5635].",
      "ja": "ネットワークインフラはますますDDoS攻撃によって妨げられてきました。これらのDDoS攻撃の影響を弱めるために、IPネットワークは、[RFC3882]及び[RFC5635]に記載されたもののようにBGP [RFC4271]様々なメカニズムを使用してブラックホール提供しています。"
    },
    {
      "indent": 3,
      "text": "DDoS attacks targeting a certain IP address may cause congestion of links used to connect to adjacent networks. In order to limit the impact of such a scenario on legitimate traffic, networks adopted a mechanism called \"BGP blackholing\". A network that wants to trigger blackholing needs to understand the triggering mechanism adopted by its neighboring networks. Different networks provide different mechanisms to trigger blackholing, including but not limited to pre-defined blackhole next-hop IP addresses, specific BGP communities, or out-of-band BGP sessions with a special BGP speaker.",
      "ja": "特定のIPアドレスをターゲットとDDoS攻撃は、隣接するネットワークに接続するために使用されるリンクの輻輳を引き起こす可能性があります。正当なトラフィックにこのようなシナリオの影響を制限するために、ネットワークは、「BGPのブラックホール」と呼ばれる機構を採用しました。ブラックホールをトリガしたいネットワークがその隣接ネットワークによって採用されたトリガー機構を理解する必要があります。異なるネットワークは、事前に定義されたブラックホールネクストホップIPアドレス、特定のBGPコミュニティ、または特別なBGPスピーカとアウトオブバンドBGPセッションを含むがこれらに限定されないブラックホールトリガするための異なるメカニズムを提供します。"
    },
    {
      "indent": 3,
      "text": "Having several different mechanisms to trigger blackholing in different networks makes it an unnecessarily complex, error-prone, and cumbersome task for network operators. Therefore, a well-known BGP community [RFC1997] is defined for operational ease.",
      "ja": "異なるネットワークでブラックホールトリガするために、いくつかの異なるメカニズムを有するネットワークオペレータのために不必要に複雑でエラーが発生しやすい、そして面倒な作業となります。したがって、周知のBGPコミュニティ[RFC1997]は、動作を容易にするために定義されています。"
    },
    {
      "indent": 3,
      "text": "Having such a well-known BGP community for blackholing also further simplifies network operations because:",
      "ja": "ブラックホールのために、このようなよく知られたBGPコミュニティを持つことも、更なるので、ネットワーク運用を簡素化します："
    },
    {
      "indent": 3,
      "text": "o Implementing and monitoring blackholing becomes easier when implementation and operational guides do not cover many variations to trigger blackholing.",
      "ja": "ブラックホールの実装および監視Oの実装と運用ガイドがブラックホールトリガするために多くのバリエーションをカバーしていない時に容易になります。"
    },
    {
      "indent": 3,
      "text": "o The number of support requests from customers about how to trigger blackholing in a particular neighboring network will be reduced as the codepoint for common blackholing mechanisms is unified and well-known.",
      "ja": "O特定の隣接ネットワークでブラックホールトリガする方法についての顧客からのサポート要求の数は、一般的なブラックホール機構のコードポイントが統一され、よく知られているように減少します。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "ja": "1.1。要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" are to be interpreted as described in [RFC2119] only when they appear in all upper case. They may also appear in lower case or mixed case as English words, without normative meaning.",
      "ja": "キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、 \"OPTIONAL\" は解釈されるべきです[RFC2119]に記載されているように、それらはすべて大文字で表示された場合にのみ。彼らはまた、規範的な意味せず、下ケースや英単語などの混合の場合に表示される場合があります。"
    },
    {
      "indent": 0,
      "text": "2. BLACKHOLE Community",
      "section_title": true,
      "ja": "2. BLACKHOLEコミュニティ"
    },
    {
      "indent": 3,
      "text": "This document defines the use of a new well-known BGP transitive community, BLACKHOLE.",
      "ja": "この文書は、新しい、よく知られたBGPの推移コミュニティ、BLACKHOLEの使用を定義します。"
    },
    {
      "indent": 3,
      "text": "The semantics of this community allow a network to interpret the presence of this community as an advisory qualification to drop any traffic being sent towards this prefix.",
      "ja": "このコミュニティのセマンティクスは、ネットワークがこのプレフィックスに向けて送信されるすべてのトラフィックをドロップする諮問資格として、このコミュニティの存在を解釈することができます。"
    },
    {
      "indent": 0,
      "text": "3. Operational Recommendations",
      "section_title": true,
      "ja": "3.運用勧告"
    },
    {
      "indent": 0,
      "text": "3.1. IP Prefix Announcements with BLACKHOLE Community Attached",
      "section_title": true,
      "ja": "3.1。 BLACKHOLEコミュニティとIPプレフィックスお知らせ添付します"
    },
    {
      "indent": 3,
      "text": "Accepting and honoring the BLACKHOLE community, or ignoring it, is a choice that is made by each operator. This community MAY be used in all bilateral and multilateral BGP deployment scenarios. In a bilateral peering relationship, use of the BLACKHOLE community MUST be agreed upon by the two networks before advertising it. In a multilateral peering relationship, the decision to honor or ignore the BLACKHOLE community is to be made according to the operator's routing policy. The community SHOULD be ignored, if it is received by a network that it not using it.",
      "ja": "受け入れやブラックホールコミュニティを尊重、またはそれを無視して、各オペレータによってなされる選択です。このコミュニティでは、すべての二国間および多国間のBGPの展開シナリオで使用されるかもしれません。二国間のピアリング関係では、BLACKHOLEコミュニティの使用は、それを広告する前に、2つのネットワークが合意しなければなりません。多国間のピアリング関係では、名誉やBLACKHOLEコミュニティを無視するという決定は、オペレータのルーティングポリシーに基づいて行われるべきです。それは、それはそれを使用しないネットワークによって受信された場合、コミュニティは、無視されるべきです。"
    },
    {
      "indent": 3,
      "text": "When a network is under DDoS duress, it MAY announce an IP prefix covering the victim's IP address(es) for the purpose of signaling to neighboring networks that any traffic destined for these IP address(es) should be discarded. In such a scenario, the network operator SHOULD attach the BLACKHOLE community.",
      "ja": "ネットワークは、DDoS攻撃の脅迫の下にあるときは、これらのIPアドレス（複数可）宛てのトラフィックは廃棄すべき隣接するネットワークへのシグナリングの目的のために、被害者のIPアドレスをカバーするIPプレフィックスを発表するかもしれません。このようなシナリオでは、ネットワークオペレータは、ブラックホールコミュニティを添付してください。"
    },
    {
      "indent": 3,
      "text": "The BLACKHOLE community MAY also be used as one of the trigger communities in a destination-based Remote Triggered Blackhole (RTBH) [RFC5635] configuration.",
      "ja": "ブラックホールコミュニティは、宛先ベースのリモートトリガブラックホール（RTBH）[RFC5635]の構成にトリガコミュニティの一つとして使用されてもよいです。"
    },
    {
      "indent": 0,
      "text": "3.2. Local Scope of Blackholes",
      "section_title": true,
      "ja": "3.2。ブラックホールのローカルスコープ"
    },
    {
      "indent": 3,
      "text": "A BGP speaker receiving an announcement tagged with the BLACKHOLE community SHOULD add the NO_ADVERTISE or NO_EXPORT community as defined in [RFC1997], or a similar community, to prevent propagation of the prefix outside the local AS. The community to prevent propagation SHOULD be chosen according to the operator's routing policy.",
      "ja": "[RFC1997]、または類似のコミュニティで定義されているブラックホールコミュニティでタグ付けされたアナウンスメントを受信BGPスピーカは、ローカルAS外部プレフィックスの伝播を防止するために、NO_ADVERTISE又はNO_EXPORTコミュニティを追加する必要があります。伝播を防ぐためのコミュニティは、オペレータのルーティングポリシーに応じて選択する必要があります。"
    },
    {
      "indent": 3,
      "text": "Unintentional leaking of more specific IP prefixes to neighboring networks can have adverse effects. Extreme caution should be used when purposefully propagating IP prefixes tagged with the BLACKHOLE community outside the local routing domain, unless policy explicitly aims at doing just that.",
      "ja": "近隣のネットワークへのより具体的なIPプレフィックスの意図しない漏れは悪影響を及ぼすことができます。意図的にローカルルーティングドメイン外BLACKHOLEコミュニティでタグ付けされたIPプレフィックスを伝播するときに、ポリシーが明示的にちょうどそれを行うことを目指していない限りは細心の注意を使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.3. Accepting Blackholed IP Prefixes",
      "section_title": true,
      "ja": "3.3。ブラックホールIPプレフィックスを受け入れます"
    },
    {
      "indent": 3,
      "text": "It has been observed in provider networks running BGP that announcements of IP prefixes longer than /24 for IPv4 and /48 for IPv6 are usually not accepted on the Internet (see Section 6.1.3 of [RFC7454]). However, blackhole prefix length should be as long as possible in order to limit the impact of discarding traffic for adjacent IP space that is not under DDoS duress. The blackhole prefix length is typically as specific as possible, /32 for IPv4 or /128 for IPv6.",
      "ja": "（[RFC7454]のセクション6.1.3を参照）IPv6のIPv4のより/ 24長いIPプレフィックスの発表や/ 48は通常、インターネット上で受け入れられていないことBGPを実行しているプロバイダのネットワークで観察されています。しかし、ブラックホールプレフィックス長は、DDoS攻撃の脅迫を受けていない隣接するIPスペースのトラフィックを破棄の影響を制限するために、できるだけ長くなければなりません。ブラックホールのプレフィックスの長さは、典型的には、可能な限り特異的であるのIPv4 / 32又はIPv6の/ 128。"
    },
    {
      "indent": 3,
      "text": "BGP speakers in a bilateral peering relationship using the BLACKHOLE community MUST only accept and honor BGP announcements carrying the BLACKHOLE community under the two following conditions:",
      "ja": "BLACKHOLEコミュニティを使用して、二国間のピアリング関係のBGPスピーカーが2つのだけ、次の条件でBLACKHOLEコミュニティを運ぶBGPアナウンスを受け入れ、尊重しなければなりません："
    },
    {
      "indent": 3,
      "text": "o The announced prefix is covered by an equal or shorter prefix that the neighboring network is authorized to advertise.",
      "ja": "Oを発表しましたプレフィックスは、隣接ネットワークが広告を掲載することが許可されて等しいか短い接頭辞で覆われています。"
    },
    {
      "indent": 3,
      "text": "o The receiving party agreed to honor the BLACKHOLE community on the particular BGP session.",
      "ja": "O受信側は、特定のBGPセッションにBLACKHOLEコミュニティを尊重することに合意しました。"
    },
    {
      "indent": 3,
      "text": "In topologies with a route server or other multilateral peering relationships, BGP speakers SHOULD accept and honor BGP announcements under the same conditions.",
      "ja": "ルートサーバや他の多国間のピアリング関係を持つトポロジでは、BGPスピーカーは、同じ条件の下でBGPアナウンスを受け入れ、尊重すべきです。"
    },
    {
      "indent": 3,
      "text": "An operator MUST ensure that origin validation techniques (such as the one described in [RFC6811]) do not inadvertently block legitimate announcements carrying the BLACKHOLE community.",
      "ja": "オペレータは（例えば、[RFC6811]に記載のものなど）、その起源の検証技術が誤っブラックホールコミュニティを運ぶ正規アナウンスをブロックしないことを保証しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The BLACKHOLE community is not intended to be used with Network Layer Reachability Information (NLRI) [RFC5575] to distribute traffic flow specifications.",
      "ja": "BLACKHOLEコミュニティは、トラフィックフローの仕様を配布するためにネットワーク層到達可能性情報（NLRI）[RFC5575]で使用されるものではありません。"
    },
    {
      "indent": 3,
      "text": "The error handling for this community follows the process in [RFC7606] that causes a malformed community to be treated as withdrawn.",
      "ja": "このコミュニティのためのエラー処理を回収として扱われるため、不正な形式のコミュニティを引き起こす[RFC7606]での処理に続きます。"
    },
    {
      "indent": 3,
      "text": "Operators are encouraged to store all BGP updates in their network carrying the BLACKHOLE community for long-term analysis or internal audit purposes.",
      "ja": "演算子は、長期的な分析や内部監査の目的のためにブラックホールコミュニティを運んで自分のネットワーク内のすべてのBGPアップデートを保管することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "4. Vendor Implementation Recommendations",
      "section_title": true,
      "ja": "4.ベンダーの実装に関する推奨事項"
    },
    {
      "indent": 3,
      "text": "Without an explicit configuration directive set by the operator, network elements SHOULD NOT discard traffic destined towards IP prefixes that are tagged with the BLACKHOLE community. The operator is expected to explicitly configure the network element to honor the BLACKHOLE community in a way that is compliant with the operator's routing policy.",
      "ja": "オペレータによって設定された明示的な設定ディレクティブがなければ、ネットワーク要素は、ブラックホールコミュニティでタグ付けされているIPプレフィックスに向けて宛てのトラフィックを破棄すべきではありません。オペレータは、明示的にオペレータのルーティングポリシーに準拠した方法でBLACKHOLEコミュニティを称えるために、ネットワーク要素を設定することが期待されます。"
    },
    {
      "indent": 3,
      "text": "Vendors MAY provide a shorthand keyword in their configuration language to reference the well-known BLACKHOLE community attribute value. The suggested string to be used is \"blackhole\".",
      "ja": "ベンダーは、よく知られているブラックホールコミュニティ属性値を参照するために自分の設定言語での速記キーワードを提供することができます。使用されることが示唆文字列は「ブラックホール」です。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IANA has registered BLACKHOLE in the \"BGP Well-known Communities\" registry.",
      "ja": "IANAは、「BGPよく知られているコミュニティ」レジストリにBLACKHOLEを登録しています。"
    },
    {
      "indent": 6,
      "text": "BLACKHOLE (= 0xFFFF029A)",
      "ja": "BLACKHOLE（= 0xFFFF029A）"
    },
    {
      "indent": 3,
      "text": "The low-order two octets in decimal are 666, a value commonly associated with BGP blackholing among network operators.",
      "ja": "小数で下位2つのオクテットは666、一般にネットワークオペレータ間のBGPブラックホールに関連付けられた値です。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "BGP contains no specific mechanism to prevent the unauthorized modification of information by the forwarding agent. This allows routing information to be modified or removed; it also allows false information to be added by forwarding agents. Recipients of routing information are not able to detect this modification. BGPsec [BGPSEC] does not resolve this situation. Even when BGPsec is in place, a forwarding agent can alter, add, or remove BGP communities.",
      "ja": "BGPは、転送エージェントによる情報の不正な変更を防止するための具体的なメカニズムが含まれていません。これは、ルーティング情報が変更または削除されることを可能にします。それはまた、虚偽の情報は、エージェントを転送することによって追加することができます。ルーティング情報の受信者がこの変更を検出することができません。 BGPsecは[BGPSEC]この状況を解決しません。 BGPsecが所定の位置にある場合でも、転送エージェントは、変更、追加、またはBGPコミュニティを削除することができます。"
    },
    {
      "indent": 3,
      "text": "The unauthorized addition of the BLACKHOLE community to an IP prefix by an adversary may cause a denial-of-service attack based on denial of reachability.",
      "ja": "敵によってIPプレフィックスにBLACKHOLEコミュニティの不正さらには、到達可能性の否定に基づいてサービス拒否攻撃を引き起こす可能性があります。"
    },
    {
      "indent": 3,
      "text": "In order to further limit the impact of unauthorized BGP announcements carrying the BLACKHOLE community, the receiving BGP speaker SHOULD verify by applying strict filtering (see Section 6.2.1.1.2 of [RFC7454]) that the peer announcing the prefix is authorized to do so. If not, the BGP announcement should be filtered.",
      "ja": "さらにブラックホールコミュニティを担持不正BGPアナウンスメントの影響を制限するために、受信したBGPスピーカは、接頭辞を発表ピアがそうすることを許可されていること（[RFC7454]のセクション6.2.1.1.2を参照）厳密なフィルタリングを適用することによって検証するべきです。そうでない場合、BGPアナウンスメントを濾過する必要があります。"
    },
    {
      "indent": 3,
      "text": "BGP announcements carrying the BLACKHOLE community should only be accepted and honored if the neighboring network is authorized to advertise the prefix. The method of validating announcements is to be chosen according to the operator's routing policy.",
      "ja": "BLACKHOLEコミュニティを運ぶBGPのアナウンスのみを受け入れ、隣接ネットワークは、プレフィックスを通知するために許可されている場合は表彰されなければなりません。アナウンスを検証する方法は、オペレータのルーティングポリシーに従って選択されるべきです。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that operators use best common practices to protect their BGP sessions, such as the ones in [RFC7454].",
      "ja": "事業者は、そのような[RFC7454]でのものとして、彼らのBGPセッションを保護するための最良の共通プラクティスを使用することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参考"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC1997] Chandra, R., Traina, P., and T. Li, \"BGP Communities Attribute\", RFC 1997, DOI 10.17487/RFC1997, August 1996, <http://www.rfc-editor.org/info/rfc1997>.",
      "ja": "[RFC1997]チャンドラ、R.、Trainaの、P.、およびT.李、 \"BGPコミュニティ属性\"、RFC 1997、DOI 10.17487は/ RFC1997、1996年8月、<http://www.rfc-editor.org/info/ RFC1997>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC4271] Rekhter, Y., Ed., Li, T., Ed., and S. Hares, Ed., \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, DOI 10.17487/RFC4271, January 2006, <http://www.rfc-editor.org/info/rfc4271>.",
      "ja": "[RFC4271] Rekhter、Y.、エド。、李、T.、エド。、およびS.野兎、編、 \"ボーダーゲートウェイプロトコル4（BGP-4）\"、RFC 4271、DOI 10.17487 / RFC4271、2006年1月、<http://www.rfc-editor.org/info/rfc4271>。"
    },
    {
      "indent": 3,
      "text": "[RFC7606] Chen, E., Ed., Scudder, J., Ed., Mohapatra, P., and K. Patel, \"Revised Error Handling for BGP UPDATE Messages\", RFC 7606, DOI 10.17487/RFC7606, August 2015, <http://www.rfc-editor.org/info/rfc7606>.",
      "ja": "[RFC7606]チェン、E.、エド。、スカダー、J.、エド。、Mohapatra、P.、およびK.パテル、 \"BGPのUPDATEメッセージのための処理改訂エラー\"、RFC 7606、DOI 10.17487 / RFC7606、2015年8月、 <http://www.rfc-editor.org/info/rfc7606>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[BGPSEC] Lepinski, M., Ed. and K. Sriram, Ed., \"BGPsec Protocol Specification\", Work in Progress, draft-ietf-sidr-bgpsec-protocol-18, August 2016.",
      "ja": "【BGPSEC] Lepinski、M.、エド。そして、K.スリラム、エド。、 \"BGPsecプロトコル仕様\" は、ドラフト-IETF-SIDR-bgpsecプロトコル-18、2016年8月、進行中の作業します。"
    },
    {
      "indent": 3,
      "text": "[RFC3882] Turk, D., \"Configuring BGP to Block Denial-of-Service Attacks\", RFC 3882, DOI 10.17487/RFC3882, September 2004, <http://www.rfc-editor.org/info/rfc3882>.",
      "ja": "[RFC3882]トルコ人、D.、 \"BGPの設定ブロックへのサービス拒否攻撃\"、RFC 3882、DOI 10.17487 / RFC3882、2004年9月、<http://www.rfc-editor.org/info/rfc3882>。"
    },
    {
      "indent": 3,
      "text": "[RFC5575] Marques, P., Sheth, N., Raszuk, R., Greene, B., Mauch, J., and D. McPherson, \"Dissemination of Flow Specification Rules\", RFC 5575, DOI 10.17487/RFC5575, August 2009, <http://www.rfc-editor.org/info/rfc5575>.",
      "ja": "[RFC5575]マルケス、P.、Sheth、N.、Raszuk、R.、グリーン、B.、Mauch、J.、およびD.マクファーソン、 \"フロー仕様ルールの普及\"、RFC 5575、DOI 10.17487 / RFC5575 8月2009年、<http://www.rfc-editor.org/info/rfc5575>。"
    },
    {
      "indent": 3,
      "text": "[RFC5635] Kumari, W. and D. McPherson, \"Remote Triggered Black Hole Filtering with Unicast Reverse Path Forwarding (uRPF)\", RFC 5635, DOI 10.17487/RFC5635, August 2009, <http://www.rfc-editor.org/info/rfc5635>.",
      "ja": "[RFC5635]クマリ、W.とD.マクファーソン、RFC 5635 \"リモートユニキャストRPF（uRPFの）とブラックホールフィルタリングをトリガー\"、DOI 10.17487 / RFC5635、2009年8月、<のhttp：//www.rfc-editor。組織/情報/ rfc5635>。"
    },
    {
      "indent": 3,
      "text": "[RFC6811] Mohapatra, P., Scudder, J., Ward, D., Bush, R., and R. Austein, \"BGP Prefix Origin Validation\", RFC 6811, DOI 10.17487/RFC6811, January 2013, <http://www.rfc-editor.org/info/rfc6811>.",
      "ja": "[RFC6811] Mohapatra、P.、スカダー、J.、ウォード、D.、ブッシュ、R.、およびR. Austeinと、 \"BGPプレフィクス起源の検証\"、RFC 6811、DOI 10.17487 / RFC6811、2013年1月、<のhttp：/ /www.rfc-editor.org/info/rfc6811>。"
    },
    {
      "indent": 3,
      "text": "[RFC7454] Durand, J., Pepelnjak, I., and G. Doering, \"BGP Operations and Security\", BCP 194, RFC 7454, DOI 10.17487/RFC7454, February 2015, <http://www.rfc-editor.org/info/rfc7454>.",
      "ja": "[RFC7454]デュラン、J.、Pepelnjak、I.、およびG. Doering、 \"BGP運用とセキュリティ\"、BCP 194、RFC 7454、DOI 10.17487 / RFC7454、2015年2月、<のhttp：//www.rfc-editor。組織/情報/ rfc7454>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to gratefully acknowledge many people who have contributed discussions and ideas to the development of this document. They include Petr Jiran, Yordan Kritski, Christian Seitz, Nick Hilliard, Joel Jaeggli, Christopher Morrow, Thomas Mangin, Will Hargrave, Niels Bakker, David Farmer, Jared Mauch, John Heasley, and Terry Manderson.",
      "ja": "作者は感謝して、この文書の発展への議論やアイデアを貢献した多くの人々に感謝します。彼らはペトルJiran、Yordan Kritski、クリスチャン・サイツ、ニック・ヒリアード、ジョエルJaeggli、クリストファー・モロー、トーマス・マンジャン、ウィルHargrave、ニールス・バッカー、デビッド・ファーマー、ジャレッドMauch、ジョンHeasley、およびテリーMandersonが含まれます。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Thomas King DE-CIX Management GmbH Lichtstrasse 43i Cologne 50825 Germany",
      "ja": "トーマス・キングDE-CIXマネージメント社Lichtenstrasse 43Iケルン50825ドイツ"
    },
    {
      "indent": 3,
      "text": "Email: thomas.king@de-cix.net",
      "ja": "メール：thomas.king@de-cix.net"
    },
    {
      "indent": 3,
      "text": "Christoph Dietzel DE-CIX Management GmbH Lichtstrasse 43i Cologne 50825 Germany",
      "ja": "クリストフDietzel DE-CIXマネージメント社Lichtenstrasse 43Iケルン50825ドイツ"
    },
    {
      "indent": 3,
      "text": "Email: christoph.dietzel@de-cix.net",
      "ja": "メール：christoph.dietzel@de-cix.net"
    },
    {
      "indent": 3,
      "text": "Job Snijders NTT Communications Theodorus Majofskistraat 100 Amsterdam 1065 SZ The Netherlands",
      "ja": "仕事SnijdersのNTTコミュニケーションズセオドアオランダMajofskistraat 100アムステルダム1065 SZ"
    },
    {
      "indent": 3,
      "text": "Email: job@ntt.net",
      "ja": "メール：job@ntt.net"
    },
    {
      "indent": 3,
      "text": "Gert Doering SpaceNet AG Joseph-Dollinger-Bogen 14 Munich 80807 Germany",
      "ja": "ゲルトDoeringスペースネット（Spacenet）AGジョセフ・ドリンジャー-ボーゲン14ミュンヘン80807ドイツ"
    },
    {
      "indent": 3,
      "text": "Email: gert@space.net",
      "ja": "メール：gert@space.net"
    },
    {
      "indent": 3,
      "text": "Greg Hankins Nokia 777 E. Middlefield Road Mountain View, CA 94043 United States of America",
      "ja": "グレッグHankinsさんノキア777 E.ミドルロード、マウンテンビュー、CAアメリカの94043米国"
    },
    {
      "indent": 3,
      "text": "Email: greg.hankins@nokia.com",
      "ja": "メール：greg.hankins@nokia.com"
    }
  ]
}