{
  "title": {
    "text": "RFC 5564 - Linguistic Guidelines for the Use of the Arabic Language in Internet Domains",
    "ja": "RFC 5564 - インターネットドメインでのアラビア語の使用のための言語のガイドライン"
  },
  "number": 5564,
  "created_at": "2019-10-22 19:38:15.191806+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                    A. El-Sherbiny\nRequest for Comments: 5564                                      M. Farah\nCategory: Informational                                         UN-ESCWA\nISSN: 2070-1721                                              I. Oueichek\n                                            Syrian Telecom Establishment\n                                                             A. Al-Zoman\n                                                          SaudiNIC, CITC\n                                                           February 2010",
      "raw": true
    },
    {
      "indent": 16,
      "text": "  Linguistic Guidelines for the Use of\nthe Arabic Language in Internet Domains",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document constitutes technical specifications for the use of Arabic in Internet domain names and provides linguistic guidelines for Arabic domain names. It addresses Arabic-specific linguistic issues pertaining to the use of Arabic language in domain names.",
      "ja": "この文書では、インターネットドメイン名でアラビア語を使用するための技術仕様を構成し、アラビア語ドメイン名の言語的なガイドラインを提供します。これは、ドメイン名でのアラビア語の使用に関連するアラビア語特有の言語的な問題に対処します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "これは、独立して、他のRFCストリームの、RFCシリーズへの貢献です。 RFC Editorはその裁量でこの文書を公開することを選択し、実装や展開のためにその値についての声明を出すていません。 RFC編集者によって公表のために承認されたドキュメントは、インターネット標準の任意のレベルの候補ではありません。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc5564.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc5564で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2010 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2010 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 3,
      "text": "This document may not be modified, and derivative works of it may not be created, except to format it for publication as an RFC or to translate it into languages other than English.",
      "ja": "RFCとして公表のためにそれをフォーマットしたり、英語以外の言語に翻訳することを除いて、このドキュメントは変更されないことがあり、それの派生作品が作成されないことがあります。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Arabic Language-Specific Issues .................................3\n   2.1. Linguistic Issues ..........................................4\n        2.1.1. Diacritics (Tashkeel) and Shadda ....................4\n        2.1.2. Kasheeda or Tatweel (Horizontal Character\n               Size Extension) .....................................5\n        2.1.3. Character Folding ...................................5\n   2.2. Supported Character Set ....................................6\n   2.3. Arabic Linguistic Issues Affected by Technical\n        Constraints ................................................8\n        2.3.1. Numerals ............................................8\n        2.3.2. The Space Character .................................8\n3. Summary and Conclusion ..........................................8\n4. Security Considerations .........................................9\n5. Acknowledgments .................................................9\n6. References ......................................................9\n   6.1. Normative References .......................................9\n   6.2. Informative References .....................................9",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "The Internet Engineering Task Force (IETF) issued in March 2003 a set of RFCs for Internationalized Domain Names (IDN) ([1], [2], and [3]), which were planned to become the de facto standard for all languages. In 2007 and 2008, the following working drafts were released that propose revisions to the IDNA protocol:",
      "ja": "すべての言語のためのデファクトスタンダードになるために計画されたインターネット・エンジニアリング・タスク・国際化ドメイン名（IDN）のためのフォース（IETF）2003年3月にRFCのセットを発行した（[1]、[2]、[3]）、 。 2007年と2008年には、次の草案は、IDNAプロトコルの改訂を提案しているリリースされました："
    },
    {
      "indent": 3,
      "text": "o Internationalized Domain Names for Applications (IDNA): Background, Explanation, and Rationale [5]",
      "ja": "背景、説明、及び根拠[5]：アプリケーション（IDNA）のための国際化ドメイン名O"
    },
    {
      "indent": 3,
      "text": "o Internationalized Domain Names in Applications (IDNA): Protocol [6]",
      "ja": "アプリケーションにおける国際化ドメイン名（IDNA）O：プロトコル[6]"
    },
    {
      "indent": 3,
      "text": "o An updated IDNA criterion for right-to-left scripts [7]",
      "ja": "右から左へのスクリプトの更新IDNA基準O [7]"
    },
    {
      "indent": 3,
      "text": "o The Unicode code points and IDNA [8]",
      "ja": "UnicodeコードポイントとIDNA O [8]"
    },
    {
      "indent": 3,
      "text": "These documents are known collectively as \"IDNA2008\".",
      "ja": "これらの文書は、「IDNA2008」と総称されています。"
    },
    {
      "indent": 3,
      "text": "This document constitutes a technical specification for the implementation of the IDN standards in the case of the Arabic language. It will allow the use of standard language tables to write domain names in Arabic characters. Therefore, it should be considered as a logical extension to the IDN standards. It thus presents guidelines for the proper use of Arabic characters with the IDN standards in an Arabic language context.",
      "ja": "この文書では、アラビア語の場合、IDN基準の実施のための技術仕様を構成しています。これは、標準言語テーブルの使用はアラビア文字でドメイン名を書くことができます。したがって、IDN標準への論理的な拡張と考えるべきです。したがって、アラビア語のコンテキストでIDN標準とアラビア文字の適切な使用のためのガイドラインを示します。"
    },
    {
      "indent": 3,
      "text": "This document reflects the recommendations of the Arab Working Group on Arabic Domain Names (AWG-ADN), established by the League of Arab States (LAS), based on standardisation efforts of the United Nations Economic and Social Commission for Western Asia (UN-ESCWA) and on that group's document, \"Guidelines for an Arabic Internet Domain Name\" [9]. This document is also in full harmony with recent rigorous discussions that took place within the major language communities that use the Arabic script in their languages.",
      "ja": "この文書では、アラブ連盟（LAS）によって確立されたアラビア語ドメイン名のアラブ作業部会（AWG-ADN）の勧告を反映し、西アジア（UN-ESCWAのための国連経済社会委員会の標準化活動に基づいて、 ）及びそのグループの文書に、「アラビアのインターネットドメイン名のためのガイドライン」[9]。この文書は、彼らの言語でアラビア語のスクリプトを使用する主要な言語コミュニティの中行われた最近の厳格な議論との完全な調和でもあります。"
    },
    {
      "indent": 3,
      "text": "This document provides guidelines for the ways Arabic characters may be used for registering Internet domain names and how linguistic-specific issues should be handled. A few rules are recommended for application at the protocol level.",
      "ja": "この文書では、アラビア文字は、インターネットドメイン名を登録し、どのような言語固有の問題を処理する必要がありますするために使用することができる方法についてのガイドラインを提供します。いくつかのルールは、プロトコルレベルでのアプリケーションのために推奨されています。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"REQUIRED\", \"SHOULD\", \"RECOMMENDED\", and \"MAY\" in this document are to be interpreted as described in RFC 2119 [4].",
      "ja": "キーワード「MUST」、「REQUIRED」は、「推奨」、「SHOULD」、および本書ではRFC 2119に記載されるように解釈される「場合がある」[4]。"
    },
    {
      "indent": 3,
      "text": "Comments on this document are solicited and should be addressed to the working group's mailing list at ESCWA-ICTD@un.org and/or the author(s).",
      "ja": "このドキュメントに関するコメントが募集され、ESCWA-ICTD@un.orgおよび/または作者でワーキンググループのメーリングリストに対処する必要があります。"
    },
    {
      "indent": 0,
      "text": "2. Arabic Language-Specific Issues",
      "section_title": true,
      "ja": "2.アラビア語固有の問題"
    },
    {
      "indent": 3,
      "text": "The main objective of the creation of Arabic domain names is to have a vehicle to increase Internet use amongst all strata of the Arabic-speaking communities.",
      "ja": "アラビア語ドメイン名の作成の主な目的は、アラビア語圏の地域社会のすべての階層の間でのインターネット利用を高めるために車両を持っていることです。"
    },
    {
      "indent": 3,
      "text": "Furthermore, a non-user-friendly domain name would further add to the ambiguity and the eccentricity of the Internet to the Arabic-speaking communities, thus contributing negatively to the spread of the",
      "ja": "さらに、非ユーザーフレンドリーなドメイン名が、さらにこれの普及にマイナスの貢献、曖昧とアラビア語圏の地域社会へのインターネットの偏心に追加します"
    },
    {
      "indent": 3,
      "text": "Internet and leading to further isolation of these communities at the global level.",
      "ja": "インターネットやグローバルレベルでこれらのコミュニティの更なる分離につながります。"
    },
    {
      "indent": 3,
      "text": "Hence, there have been intensive efforts (especially those spearheaded by Dr. Al-Zoman and contributed to by UN-ESCWA and its Arabic Domain Names Task Force (ADN-TF)) to reach consensus on a multitude of linguistic issues with the following goals:",
      "ja": "したがって、そこに集中的な取り組みとなって（特に博士アルZomanが先頭に立っとUN-ESCWAとそのアラビア語ドメイン名タスクフォース（ADN-TF）によってに貢献）、次の目標を持つ言語的な問題の多くについて合意に達するためにしています："
    },
    {
      "indent": 3,
      "text": "o To define the accepted Arabic character set to be used for writing domain names in Arabic, which is the subject of this document.",
      "ja": "oは、本書の主題であるアラビア語、でドメイン名を書き込むために使用されるように設定され受け入れられたアラビア語の文字を定義します。"
    },
    {
      "indent": 3,
      "text": "o To define the top-level domains of the Arabic domain name tree structure (i.e., Arabic gTLDs and ccTLDs). This goal will be handled in a separate document.",
      "ja": "アラビア語ドメイン名のツリー構造（すなわち、アラビア語のgTLDとのccTLD）のトップレベルドメインを定義するには、O。この目標は、別の文書に処理されます。"
    },
    {
      "indent": 3,
      "text": "The first meeting of the AWG-ADN, held in Damascus from January-February 2005, gave special attention to the following:",
      "ja": "1月〜2005年2月からダマスカスで開催されたAWG-ANDの最初の会議は、次のように特別な注意を与えました："
    },
    {
      "indent": 3,
      "text": "o Simplification of the domain names, whenever possible, to facilitate the interaction of the Arabic user with the Internet.",
      "ja": "Oインターネットでのアラビア語のユーザの相互作用を容易にするために、ドメイン名、可能な限りの簡素化。"
    },
    {
      "indent": 3,
      "text": "o Adoption of solutions that do not lead to confusion either in reading or in writing, provided that this does not compromise the linguistic correctness of used words.",
      "ja": "Oの読み取りまたは書き込みのいずれかで混乱につながらない解決策の採用は、これが使われる単語の言語的な正しさを損なわないことを条件とします。"
    },
    {
      "indent": 3,
      "text": "o Mixing Arabic and non-Arabic letters in the domain name label is not acceptable.",
      "ja": "ドメイン名ラベルにアラビア語と非アラビア語の文字を混在oを許容できません。"
    },
    {
      "indent": 0,
      "text": "2.1. Linguistic Issues",
      "section_title": true,
      "ja": "2.1。言語の問題"
    },
    {
      "indent": 3,
      "text": "There are a number of linguistic issues that have been proposed with respect to the use of the Arabic language in domain names. This section will highlight some of them. This section is based on the papers of Dr. Al-Zoman ([10] and [11]) and on the report of the first meeting of AWG-ADN [12]. For details, the reader is encouraged to review these references.",
      "ja": "ドメイン名でのアラビア語の使用に関して提案されている言語的な問題がいくつかあります。このセクションでは、それらのいくつかを紹介します。このセクションでは、博士アルZoman（[10]及び[11]）の論文に及びAWG-ADN [12]の最初の会議の報告に基づいています。詳細については、読者はこれらの参照を確認することが奨励されます。"
    },
    {
      "indent": 0,
      "text": "2.1.1. Diacritics (Tashkeel) and Shadda",
      "section_title": true,
      "ja": "2.1.1。発音区別符号（Tashkeel）と浄化槽"
    },
    {
      "indent": 3,
      "text": "Tashkeel and Shadda are accent marks placed above or below Arabic letters to produce proper pronunciation. They are thus used to differentiate different meanings for different words with the same base characters.",
      "ja": "Tashkeelとシャッダは正しい発音を生成するために、アラビア文字の上または下に配置されたアクセント記号です。したがって、これらは同じベース文字と異なる単語の異なる意味を区別するために使用されています。"
    },
    {
      "indent": 3,
      "text": "Neither Tashkeel nor Shadda are permitted in zone files when registering domain names in the Arabic language, although they are permitted in the current edition of IDNA2008. They can be supported or ignored, if necessary, in the user interface with local mappings and can be stripped before IDNA processing.",
      "ja": "アラビア語でドメイン名を登録するとき、彼らはIDNA2008の最新版では許可されているがTashkeelもシャッダどちらも、ゾーンファイルで許可されています。彼らは、サポートされているか、必要であれば、ローカルマッピングを持つユーザーインターフェイスで、無視され、IDNA処理の前に除去することができることができます。"
    },
    {
      "indent": 3,
      "text": "The following are their Unicode presentations:",
      "ja": "以下は、そのUnicodeのプレゼンテーションです。"
    },
    {
      "indent": 6,
      "text": "U+064B ARABIC FATHATAN U+064C ARABIC DAMMATAN U+064D ARABIC KASRATAN U+064E ARABIC FATHA U+064F ARABIC DAMMA U+0650 ARABIC KASRA U+0651 ARABIC SHADDA U+0652 ARABIC SUKUN",
      "ja": "U + 064B ARABIC FATHATAN U + 064C ARABIC DAMMATAN U + 064D ARABIC KASRATAN U + 064E ARABIC FATHA U + 064F ARABIC DAMMA U + 0650 ARABIC KASRA U + 0651 ARABICシャッダU + 0652 ARABICスクン"
    },
    {
      "indent": 0,
      "text": "2.1.2. Kasheeda or Tatweel (Horizontal Character Size Extension)",
      "section_title": true,
      "ja": "2.1.2。 KasheedaまたはTatweel（水平文字サイズ拡張）"
    },
    {
      "indent": 3,
      "text": "Kasheeda (U+0640 ARABIC TATWEEL) must not be used in Arabic domain names and should be disallowed for Arabic language domain names. The Kasheeda is not a letter and does not have an effect on pronunciation. It is used to extend the horizontal length or change the shape of the preceding letter for graphical representation purposes in Arabic writing. Accordingly, it has no value for the writing of domain names. The same applies to all languages using the Arabic script. The authors recommend that it should be disallowed at the protocol level.",
      "ja": "Kasheeda（+ 0640アラビア語TATWEEL U）は、アラビア語ドメイン名に使用してはならないとアラビア語ドメイン名のために禁止されなければなりません。 Kasheedaは文字ではなく、発音には影響しません。水平方向の長さを延長またはアラビア書面でグラフィカル表示目的のための先行文字の形状を変更するために使用されます。これにより、ドメイン名の執筆のための値を持ちません。同じことは、アラビア語のスクリプトを使用して、すべての言語に適用されます。著者はそれがプロトコルレベルで禁止されなければならないことをお勧めします。"
    },
    {
      "indent": 0,
      "text": "2.1.3. Character Folding",
      "section_title": true,
      "ja": "2.1.3。文字折りたたみ"
    },
    {
      "indent": 3,
      "text": "Character folding is the process where multiple letters (that may have some similarity with respect to their shapes) are folded into one shape. Examples of such Arabic characters include:",
      "ja": "文字フォールディングは、一つの形状に折り畳まれている複数の文字（つまりその形状に関していくつかの類似性を有していてもよい）プロセスです。アラビア文字の例としては、"
    },
    {
      "indent": 3,
      "text": "o Folding Teh Marbuta (U+0629) and Heh (U+0647) at the end of a word",
      "ja": "単語の末尾折りたたみテMarbuta（U + 0629）とふむ（U + 0647）O"
    },
    {
      "indent": 3,
      "text": "o Folding different forms of Hamzah (U+0622, U+0623, U+0625, U+0627)",
      "ja": "ハムザ（U + 0622、U + 0623、U + 0625、U + 0627）の異なる形態を折りたたみO"
    },
    {
      "indent": 3,
      "text": "o Folding Alef Maksura (U+0649) and Yeh (U+064A) at the end of a word",
      "ja": "単語の末尾折りたたみアレフMaksura（U + 0649）と葉（U + 064A）O"
    },
    {
      "indent": 3,
      "text": "o Folding Waw with Hamzah Above (U+0624) and Waw (U+0648)",
      "ja": "ハムザ前記（U + 0624）とワーウ（U + 0648）とO折りたたみワーウ"
    },
    {
      "indent": 3,
      "text": "With respect to the Arabic language, character folding is not acceptable because it changes the meaning of words and is against the principle of spelling rules. Replacing a character valid for use in domain names with another character also valid for use in domain names, which may have a similar shape, will give a different meaning. This will lead to only one word representing several words consisting of all the combinations of folded characters. Hence, the other words will be masked by a single word [10].",
      "ja": "それは言葉の意味を変更し、スペルルールの原則に反しているので、アラビア語に関しては、文字の折りたたみは受け入れられません。同様の形状を有することができるドメイン名で使用するためにも有効な別の文字でドメイン名で使用するために有効な文字を置き換える、別の意味を与えます。これは、折りたたまれた文字のすべての組み合わせからなる複数の単語を表す1ワードのみにつながります。したがって、言い換えれば、単一のワード[10]によってマスクされます。"
    },
    {
      "indent": 3,
      "text": "Mis-spelling or handwriting errors do occur, leading to mixing different characters despite the fact that this is not the case in published and printed materials. One of the motivations of this effort is to preserve the language, particularly with the spread of the globalization movement. Within this context, character folding is working against this motivation since it is going to have a negative effect on the principle and ethics of the language. Technology should work to preserve the language and not to destroy it. Thus, character folding should not be allowed. The case of digits is treated in a separate section below.",
      "ja": "誤スペルや手書きのエラーは、これが公開され、印刷物ではそうではないという事実にもかかわらず、別の文字を混合につながる、発生しました。この取り組みの動機の一つは、特にグローバル化運動の普及に伴い、言語を保存することです。言語の原理と倫理にマイナスの影響を持っているとしているので、このような状況の中で、文字の折には、このモチベーション不利に働いています。テクノロジーは、言語を維持するために動作するはずですし、それを破壊することはありません。このように、文字の折りたたみは許されるべきではありません。数字の場合は、以下の別のセクションで処理されます。"
    },
    {
      "indent": 0,
      "text": "2.2. Supported Character Set",
      "section_title": true,
      "ja": "2.2。サポートされている文字セット"
    },
    {
      "indent": 3,
      "text": "A domain name to be written in Arabic must be composed of a sequence of the following UNICODE characters and the FULL STOP (u+002E) to separate the labels. These are based on UNICODE version 5.0. The tables below are constructed using an inclusion-based approach. Thus, characters that are not part of these tables are prohibited.",
      "ja": "アラビア語で書かれているドメイン名は、ラベルを分離するために、次のUnicode文字とFULL STOP（U + 002E）の配列で構成されなければなりません。これらは、UNICODEバージョン5.0に基づいています。以下の表は、包含ベースのアプローチを使用して構築されています。したがって、これらのテーブルの一部ではない文字が禁止されています。"
    },
    {
      "indent": 13,
      "text": "+---------+-------------------------------------+\n| Unicode | Character Name                      |\n+---------+-------------------------------------+\n| 0621    | ARABIC LETTER HAMZA                 |\n| 0622    | ARABIC LETTER ALEF WITH MADDA ABOVE |\n| 0623    | ARABIC LETTER ALEF WITH HAMZA ABOVE |\n| 0624    | ARABIC LETTER WAW WITH HAMZA ABOVE  |\n| 0625    | ARABIC LETTER ALEF WITH HAMZA BELOW |\n| 0626    | ARABIC LETTER YEH WITH HAMZA ABOVE  |\n| 0627    | ARABIC LETTER ALEF                  |\n| 0628    | ARABIC LETTER BEH                   |\n| 0629    | ARABIC LETTER TEH MARBUTA           |\n| 062A    | ARABIC LETTER TEH                   |\n| 062B    | ARABIC LETTER THEH                  |\n| 062C    | ARABIC LETTER JEEM                  |\n| 062D    | ARABIC LETTER HAH                   |\n| 062E    | ARABIC LETTER KHAH                  |\n| 062F    | ARABIC LETTER DAL                   |\n| 0630    | ARABIC LETTER THAL                  |\n| 0631    | ARABIC LETTER REH                   |\n| 0632    | ARABIC LETTER ZAIN                  |\n| 0633    | ARABIC LETTER SEEN                  |\n| 0634    | ARABIC LETTER SHEEN                 |\n| 0635    | ARABIC LETTER SAD                   |\n| 0636    | ARABIC LETTER DAD                   |\n| 0637    | ARABIC LETTER TAH                   |",
      "raw": true
    },
    {
      "indent": 13,
      "text": "| 0638    | ARABIC LETTER ZAH                   |\n| 0639    | ARABIC LETTER AIN                   |\n| 063A    | ARABIC LETTER GHAIN                 |\n| 0641    | ARABIC LETTER FEH                   |\n| 0642    | ARABIC LETTER QAF                   |\n| 0643    | ARABIC LETTER KAF                   |\n| 0644    | ARABIC LETTER LAM                   |\n| 0645    | ARABIC LETTER MEEM                  |\n| 0646    | ARABIC LETTER NOON                  |\n| 0647    | ARABIC LETTER HEH                   |\n| 0648    | ARABIC LETTER WAW                   |\n| 0649    | ARABIC LETTER ALEF MAKSURA          |\n| 064A    | ARABIC LETTER YEH                   |\n| 0660    | ARABIC-INDIC DIGIT ZERO             |\n| 0661    | ARABIC-INDIC DIGIT ONE              |\n| 0662    | ARABIC-INDIC DIGIT TWO              |\n| 0663    | ARABIC-INDIC DIGIT THREE            |\n| 0664    | ARABIC-INDIC DIGIT FOUR             |\n| 0665    | ARABIC-INDIC DIGIT FIVE             |\n| 0666    | ARABIC-INDIC DIGIT SIX              |\n| 0667    | ARABIC-INDIC DIGIT SEVEN            |\n| 0668    | ARABIC-INDIC DIGIT EIGHT            |\n| 0669    | ARABIC-INDIC DIGIT NINE             |\n+---------+-------------------------------------+",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Source: Supporting the Arabic Language in Domain Names [10] Table 1: CHARACTERS FROM UNICODE ARABIC TABLE (0600-06FF)",
      "ja": "出典：ドメイン名でアラビア語をサポート[10]表1：Unicodeアラビア語テーブルからキャラクタ（0600-06FF）"
    },
    {
      "indent": 23,
      "text": "+---------+-----------------+\n| Unicode | Digit Name      |\n+---------+-----------------+\n| 0030    | DIGIT ZERO      |\n| 0031    | DIGIT ONE       |\n| 0032    | DIGIT TWO       |\n| 0033    | DIGIT THREE     |\n| 0034    | DIGIT FOUR      |\n| 0035    | DIGIT FIVE      |\n| 0036    | DIGIT SIX       |\n| 0037    | DIGIT SEVEN     |\n| 0038    | DIGIT EIGHT     |\n| 0039    | DIGIT NINE      |\n| 002D    | HYPHEN-MINUS    |\n+---------+-----------------+",
      "raw": true
    },
    {
      "indent": 6,
      "text": " Source: Supporting the Arabic Language in Domain Names [10] Table 2: CHARACTERS FROM UNICODE BASIC LATIN TABLE (0000-007F)",
      "ja": "出典：ドメイン名でアラビア語をサポート[10]表2：UNICODE基本ラテン表の文字（0000-007F）"
    },
    {
      "indent": 0,
      "text": "2.3. Arabic Linguistic Issues Affected by Technical Constraints",
      "section_title": true,
      "ja": "2.3。技術的な制約によって影響を受けるアラビア語言語の問題"
    },
    {
      "indent": 3,
      "text": "In this section, technical aspects of some linguistic issues are discussed.",
      "ja": "このセクションでは、いくつかの言語的な問題の技術的な側面が議論されています。"
    },
    {
      "indent": 0,
      "text": "2.3.1. Numerals",
      "section_title": true,
      "ja": "2.3.1。数字"
    },
    {
      "indent": 3,
      "text": "In the Arab countries, there are two sets of numerical digits used:",
      "ja": "アラブ諸国では、使用される数値の桁の2セットがあります。"
    },
    {
      "indent": 3,
      "text": "o Set I: (0, 1, 2, 3, 4, 5, 6, 7, 8, 9) mostly used in the western part of the Arab world.",
      "ja": "OセットI：（0、1、2、3、4、5、6、7、8、9）主にアラブ世界の西部に使用。"
    },
    {
      "indent": 3,
      "text": "o Set II: (u+0660, u+0661, u+0662, u+0663, u+0664, u+0665, u+0666, u+0667, u+0668, u+0669) mostly used in the eastern part of the Arab world.",
      "ja": "OセットII：（U + 0660、U + 0661、U + 0662、U + 0663、U + 0664、U + 0665、U + 0666、U + 0667、U + 0668、U + 0669）が主に東部で使用アラブ世界の一部。"
    },
    {
      "indent": 3,
      "text": "Both sets may be supported in the user interface; however, the rule of numeral homogeneity must be observed. The rule specifies that digits from the Arabic-Indic set of numerals (u+0660 to u+0669) should not be allowed to mix with ASCII digits (u+0030 to u+0039) within the same Arabic domain name label. Thus, the appearance of a digit from one set prevents the use of any other digit from the other set.",
      "ja": "両方のセットは、ユーザインターフェースでサポートされてもよいです。しかし、数字均質性のルールを守らなければなりません。ルールは、数字のアラビア語、インド語のセットからの桁（uは+ 0660 U + 0669に）ASCII数字と混合することは許されないことを指定し、同じアラビア語ドメイン名のラベル内の（U + 0030 U + 0039に）。このように、一組の数字の出現は、他のセットからの任意の他の数字の使用を妨げます。"
    },
    {
      "indent": 0,
      "text": "2.3.2. The Space Character",
      "section_title": true,
      "ja": "2.3.2。空白文字"
    },
    {
      "indent": 3,
      "text": "The space character is strictly disallowed in domain names, as it is a control character. Instead, the hyphen (Al-sharta, i.e., u+02D) is proposed as a separator between Arabic words to avoid confusion that can take place if the words are typed without a separator.",
      "ja": "それが制御文字であるとして、空白文字は厳密に、ドメイン名で許可されていません。代わりに、ハイフン（AL-sharta、即ち、U + 02D）は、単語が分離することなく、入力された場合に起こり得る混乱を避けるために、アラビア語の間のセパレータとして提案されています。"
    },
    {
      "indent": 3,
      "text": "It is acceptable to use the hyphen to separate between words within the same domain name label.",
      "ja": "同じドメイン名のラベル内の単語の間で分離するためにハイフンを使用することが可能です。"
    },
    {
      "indent": 0,
      "text": "3. Summary and Conclusion",
      "section_title": true,
      "ja": "3.まとめと結論"
    },
    {
      "indent": 3,
      "text": "The proposed guidelines are in full accordance with the IETF IDN standards and take into account Arabic-language-specific issues within a compromise between grammatical rules of the Arabic language and ease of use of that language on the Internet.",
      "ja": "ガイドライン案は、IETF IDN規格に完全に従っていると、アラビア語やインターネット上の言語の使用の容易さの文法規則との間の妥協内のアカウントアラビア語特有の問題を考慮に入れます。"
    },
    {
      "indent": 3,
      "text": "In summary, the guidelines specify that, in Arabic domain names:",
      "ja": "要約すると、ガイドラインは、アラビア語のドメイン名で、そのように指定します。"
    },
    {
      "indent": 3,
      "text": "o Accent marks (Tashkeel and Shadda) are not permitted.",
      "ja": "Oアクセント記号（Tashkeelとシャッダ）が許可されません。"
    },
    {
      "indent": 3,
      "text": "o Character folding is not permitted.",
      "ja": "O文字折りたたみが許可されていません。"
    },
    {
      "indent": 3,
      "text": "o If a numeral from the Arabic-Indic or ASCII digit sets appears in a label, numeral homogeneity is required.",
      "ja": "アラビア語、インド語またはASCII数字セットから数字がラベルに表示された場合は、O、数字均質性が要求されます。"
    },
    {
      "indent": 3,
      "text": "o The hyphen must be used as a word separator instead of space.",
      "ja": "Oハイフンは、ワードセパレータの代わりに空間として使用されなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "No particular security considerations could be identified regarding the use of Arabic characters in writing domain names. In particular, any potential visual confusion between different character strings is avoided using the guidelines proposed in this document.",
      "ja": "いかなる特定のセキュリティの考慮事項は、ドメイン名を書き込んでアラビア文字の使用に関して識別することはできませんでした。特に、異なる文字列間の潜在的な視覚的な混乱は、この文書で提案されたガイドラインを使用して回避することができます。"
    },
    {
      "indent": 0,
      "text": "5. Acknowledgments",
      "section_title": true,
      "ja": "5.謝辞"
    },
    {
      "indent": 3,
      "text": "ESCWA ICT Division provided support and funding for the development of this document with the objective of reaching a standard for comprehensive Arabic domain names. Thanks are due to SaudiNIC for its continuous efforts in supporting the development of Arabic domain names.",
      "ja": "ESCWA ICT部門は、包括的なアラビア語ドメイン名の標準に到達する目的で、本文書の開発のための支援と資金を提供しました。おかげで、アラビア語ドメイン名の開発を支援する上で、その継続的な努力のためのSaudiNICによるものです。"
    },
    {
      "indent": 3,
      "text": "John Klensin and Harald Alvestrand reviewed the document and provided useful editorial and substantive support to enrich it.",
      "ja": "ジョン・クレンシンとハラルドAlvestrandは、文書を検討し、それを豊かにする便利な編集と実質的な支援を提供します。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[1] Faltstrom, P., Hoffman, P., and A. Costello, \"Internationalizing Domain Names in Applications (IDNA)\", RFC 3490, March 2003.",
      "ja": "[1] Faltstrom、P.、ホフマン、P.、およびA.コステロ、 \"アプリケーションにおける国際化ドメイン名（IDNA）\"、RFC 3490、2003年3月。"
    },
    {
      "indent": 3,
      "text": "[2] Hoffman, P. and M. Blanchet, \"Nameprep: A Stringprep Profile for Internationalized Domain Names (IDN)\", RFC 3491, March 2003.",
      "ja": "[2]ホフマン、P.とM.ブランシェ、 \"NAMEPREP：国際化ドメイン名のためのstringprepプロフィール（IDN）\"、RFC 3491、2003年3月。"
    },
    {
      "indent": 3,
      "text": "[3] Costello, A., \"Punycode: A Bootstring encoding of Unicode for Internationalized Domain Names in Applications (IDNA)\", RFC 3492, March 2003.",
      "ja": "[3]コステロ、A.、 \"ピュニコード：アプリケーションにおける国際化ドメイン名のUnicodeのブートストリングのエンコード（IDNA）\"、RFC 3492、2003年3月。"
    },
    {
      "indent": 3,
      "text": "[4] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[4]ブラドナーのは、S.は、BCP 14、RFC 2119、1997年3月の \"RFCsにおける使用のためのレベルを示すために\"。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[5] Klensin, J., \"Internationalized Domain Names for Applications (IDNA): Definitions, Background and Rationale\", Work in Progress, September 2008.",
      "ja": "[5] Klensin、J.、 \"アプリケーション（IDNA）のための国際化ドメイン名：定義、背景と理論的根拠\"、進歩、2008年9月の作業を。"
    },
    {
      "indent": 3,
      "text": "[6] Klensin, J., \"Internationalized Domain Names in Applications (IDNA): Protocol\", Work in Progress, September 2008.",
      "ja": "[6] Klensin、J.、 \"国際化ドメイン名のアプリケーション（IDNA）で：プロトコル\"、進歩、2008年9月の作業。"
    },
    {
      "indent": 3,
      "text": "[7] Alvestrand, H. and C. Karp, \"An updated IDNA criterion for right-to-left scripts\", Work in Progress, July 2008.",
      "ja": "[7] Alvestrand、H.およびC.カープ、「右から左へのスクリプトの更新IDNA基準」、進歩、2008年7月に仕事を。"
    },
    {
      "indent": 3,
      "text": "[8] Faltstrom, P., \"The Unicode Codepoints and IDNA\", Work in Progress, July 2008.",
      "ja": "[8] Faltstrom、P.、 \"UnicodeのコードポイントとIDNA\"、進歩、2008年7月に作業。"
    },
    {
      "indent": 3,
      "text": "[9] United Nations Economic and Social Commission for Western Asia (UN-ESCWA), \"Guidelines for an Arabic Domain Name System (ADNS)\", Work in Progress, November 2007.",
      "ja": "[9]西アジア（UN-ESCWA）のための国連経済社会委員会、「アラビア語ドメインネームシステム（ADNS）のためのガイドライン」、進歩、2007年11月に作業を。"
    },
    {
      "indent": 3,
      "text": "[10] Al-Zoman, A., \"Supporting the Arabic Language in Domain Names\", October 2003, <http://www.arabic-domains.org/docs/ NIC-docs/SupportingArabicDomainNmaes.pdf>.",
      "ja": "[10]アル・Zoman、A.、 \"ドメイン名でアラビア語のサポート\"、2003年10月、<http://www.arabic-domains.org/docs/ NIC-ドキュメント/ SupportingArabicDomainNmaes.pdf>。"
    },
    {
      "indent": 3,
      "text": "[11] Al-Zoman, A., \"Arabic Top-Level Domains\", Paper presented in Expert Group Meeting on Promotion of Digital Arabic Content, the United Nations, Economic and Social Commission for Western Asia, Beirut, June 2003.",
      "ja": "[11]アル・Zoman、A.、「アラビア語トップレベルドメイン」、紙は、デジタルアラビア語コンテンツの推進、西アジア、ベイルートのための国連経済社会委員会、2003年6月に専門家グループ会合で提示しました。"
    },
    {
      "indent": 3,
      "text": "[12] League of Arab States, \"Report of the first meeting of AWG-ADN, Damascus\", February 2005, <http://www.arabic-domains.org/ar/intrnational-entites.php>.",
      "ja": "アラブ諸国の[12]リーグ、 \"AWG-ADN、ダマスカスの最初の会議の報告書\"、2005年2月、<http://www.arabic-domains.org/ar/intrnational-entites.php>。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ayman El-Sherbiny Information and Communication Technology Division ESCWA UN-House P.O. Box 11-8575 Beirut Lebanon",
      "ja": "アイマン・エル・Sherbiny情報通信技術部門ESCWA UN-ハウス私書箱ボックス11から8575ベイルートレバノン"
    },
    {
      "indent": 3,
      "text": "EMail: El-sherbiny@un.org",
      "ja": "メールアドレス：El-sherbiny@un.org"
    },
    {
      "indent": 3,
      "text": "Mansour Farah Information and Communication Technology Division ESCWA UN-House P.O. Box 11-8575 Beirut Lebanon",
      "ja": "マンスールファラー情報通信技術部門ESCWA UN-ハウス私書箱ボックス11から8575ベイルートレバノン"
    },
    {
      "indent": 3,
      "text": "EMail: farah14@un.org",
      "ja": "メールアドレス：farah14@un.org"
    },
    {
      "indent": 3,
      "text": "Ibaa Oueichek Syrian Telecom Establishment Damascus Syria",
      "ja": "Ibaa Oueichekシリアテレコム設立ダマスカスシリア"
    },
    {
      "indent": 3,
      "text": "EMail: oueichek@scs-net.org",
      "ja": "メールアドレス：oueichek@scs-net.org"
    },
    {
      "indent": 3,
      "text": "Abdulaziz H. Al-Zoman, PhD SaudiNIC, General Directorate of Internet Services IT Sector, CITC King Abdulaziz City for Science and Technology PO Box 6086 Riyadh 11442 Saudi Arabia",
      "ja": "アブドゥルアジーズH.アルZoman、博士SaudiNIC、インターネットサービスIT部門の総局、科学技術私書箱6086リヤド11442サウジアラビアCITCキング・アブドゥルアジーズ市"
    },
    {
      "indent": 3,
      "text": "EMail: azoman@citc.gov.sa",
      "ja": "メールアドレス：azoman@citc.gov.sa"
    }
  ]
}