{
  "title": {
    "text": "RFC 7392 - Explicit Path Routing for Dynamic Multi-Segment Pseudowires",
    "ja": "RFC 7392 - 動的マルチセグメント疑似回線のルーティングを明示的なパス"
  },
  "number": 7392,
  "created_at": "2019-11-01 12:34:35.220372+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          P. Dutta\nRequest for Comments: 7392                                      M. Bocci\nCategory: Standards Track                                 Alcatel-Lucent\nISSN: 2070-1721                                               L. Martini\n                                                           Cisco Systems\n                                                           December 2014",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Explicit Path Routing for Dynamic Multi-Segment Pseudowires",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "When set up through an explicit path, dynamic Multi-Segment Pseudowires (MS-PWs) may be required to provide a simple solution for 1:1 protection with diverse primary and backup MS-PWs for a service, or to enable controlled signaling (strict or loose) for special MS-PWs. This document specifies the extensions and procedures required to enable dynamic MS-PWs to be established along explicit paths.",
      "ja": "サービスの多様プライマリとバックアップMS-のPWを有する1つの保護、または厳密な（制御シグナリングを可能にするために明示的なパスを介して設定するとき、ダイナミックマルチセグメント疑似回線（MS-PWSが、1）のためのシンプルなソリューションを提供するために必要とされ得ますまたは特別なMS-PWのための）緩いです。この文書は、明示的な経路に沿って確立される動的MS-のPWを可能にするのに必要な拡張機能と手順を指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7392.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7392で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Requirements Language and Terminology ...........................3\n3. Explicit Path in MS-PW Signaling ................................3\n   3.1. S-PE Addressing ............................................3\n   3.2. Explicit Route TLV (ER-TLV) ................................3\n   3.3. Explicit Route Hop TLV (ER-Hop TLV) ........................4\n   3.4. ER-Hop Semantics ...........................................4\n        3.4.1. ER-Hop Type: IPv4 Prefix ............................4\n        3.4.2. ER-Hop Type: IPv6 Prefix ............................4\n        3.4.3. ER-Hop Type: L2 PW Address ..........................5\n4. Explicit Route TLV Processing ...................................6\n   4.1. Next-Hop Selection .........................................6\n   4.2. Adding ER Hops to the Explicit Route TLV ...................8\n5. IANA Considerations .............................................8\n6. Security Considerations .........................................8\n7. Normative References ............................................9\nAcknowledgements ...................................................9\nAuthors' Addresses ................................................10",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Procedures for dynamically establishing Multi-Segment Pseudowires (MS-PWs), where their paths are automatically determined using a dynamic routing protocol, are defined in [RFC7267]. For 1:1 protection of MS-PWs with primary and backup paths, MS-PWs need to be established through a diverse set of Switching Provider Edges (S-PEs) to avoid any single points of failure at the PW level. [RFC7267] allows this through BGP-based mechanisms. This document defines an additional mechanism that allows Source Terminating Provider Edges (ST-PEs) to explicitly choose the path that a PW would take through the intervening S-PEs. Explicit path routing of dynamic MS-PWs may also be required for controlled setup of dynamic MS-PWs and network resource management.",
      "ja": "動的に経路が自動的に動的ルーティングプロトコルを使用して決定されるマルチセグメント疑似回線（MS-のPW）を確立するための手順は、[RFC7267]で定義されています。 1の場合：プライマリおよびバックアップパスを持つMS-のPWの1保護、MS-PWSがPWレベルでの障害の任意の単一の点を回避するために、プロバイダエッジ（S-PES）のスイッチングの多様なセットを介して確立される必要があります。 [RFC7267]はBGPベースのメカニズムを介してこれを可能にします。この文書では、ソース終端プロバイダーエッジ（ST-PEは）明示的にPWが介在S-PESを通じて取るパスを選択することを可能にする追加のメカニズムを定義します。動的MS-のPWの明示的なパスルーティングも制御ダイナミックMS-のPWのセットアップおよびネットワークリソース管理のために必要とされてもよいです。"
    },
    {
      "indent": 3,
      "text": "Note that in many deployments the ST-PE will not have a view of the topology of S-PEs and so the explicit route will need to be supplied from a management application. How that management application determines the explicit route is outside the scope of this document.",
      "ja": "多くの展開でST-PEは、S-PEのトポロジーのビューを持っていないので、明示的なルートは、管理アプリケーションから供給される必要があることに注意してください。どのように管理アプリケーションが明示的な経路を決定することは、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Language and Terminology",
      "section_title": true,
      "ja": "2.必要な言語と用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "This document uses the terminology defined in [RFC7267], [RFC4447], and [RFC5036].",
      "ja": "このドキュメントは[RFC7267]、[RFC4447]及び[RFC5036]で定義された用語を使用します。"
    },
    {
      "indent": 3,
      "text": "The following additional terminology is used:",
      "ja": "以下の追加の用語が使用されます。"
    },
    {
      "indent": 3,
      "text": "Abstract Node: A group of nodes (S-PEs) representing an explicit hop along the path of an MS-PW. An abstract node is identified by an IPv4, IPv6, or S-PE address.",
      "ja": "抽象ノード：MS-PWの経路に沿って明確なホップを表すノードのグループ（S-PES）。抽象ノードのIPv4、IPv6の、またはS-PEアドレスによって識別されます。"
    },
    {
      "indent": 0,
      "text": "3. Explicit Path in MS-PW Signaling",
      "section_title": true,
      "ja": "MS-PWシグナリング3.明示的なパス"
    },
    {
      "indent": 3,
      "text": "This section describes the Label Distribution Protocol (LDP) extensions required for signaling explicit paths in dynamic MS-PW setup messages. An explicitly routed MS-PW is set up using a Label Mapping message that carries an ordered list of the S-PEs that the MS-PW is expected to traverse. The ordered list is encoded as a series of Explicit Route Hop TLVs (ER-Hop TLVs) encoded in an ER-TLV that is carried in a Label Mapping message.",
      "ja": "このセクションでは、ラベル配布プロトコル（LDP）動的MS-PWセットアップメッセージに明示的経路をシグナリングするために必要な拡張を記述しています。明示的にルーティングされたMS-PWは、MS-PWを横断すると予想されていることをS-PEの順序付きリストを運ぶラベルマッピングメッセージを使用して設定されています。順序付きリストは、Label Mappingメッセージで搬送されるER-TLVでエンコードされた明示的ルートホップのTLV（ERホップのTLV）の一連として符号化されます。"
    },
    {
      "indent": 0,
      "text": "3.1. S-PE Addressing",
      "section_title": true,
      "ja": "3.1。アドレッシングS-PE"
    },
    {
      "indent": 3,
      "text": "An S-PE address is used to identify a given S-PE among the set of S-PEs belonging to the Packet Switched Networks (PSNs) that may be used by an MS-PW. Each S-PE MUST be assigned an address as specified in Section 3.2 of [RFC7267]. An S-PE that is capable of dynamic MS-PW signaling, but has not been assigned an S-PE address, and that receives a Label Mapping message for a dynamic MS-PW MUST follow the procedures in Section 3.2 of [RFC7267].",
      "ja": "S-PEアドレスはMS-PWで使用されてもよいパケット交換ネットワーク（のPSN）に属するS-PEの集合のうち所定のS-PEを識別するために使用されます。 [RFC7267]のセクション3.2で指定されるように各S-PEは、アドレスを割り当てなければなりません。動的MS-PWシグナリングが可能であるが、S-PEアドレスが割り当てられておらず、それは、[RFC7267]のセクション3.2の手順に従わなければならない動的MS-PWのラベルマッピングメッセージを受信したS-PE。"
    },
    {
      "indent": 0,
      "text": "3.2. Explicit Route TLV (ER-TLV)",
      "section_title": true,
      "ja": "3.2。明示的ルートTLV（ER-TLV）"
    },
    {
      "indent": 3,
      "text": "The ER-TLV specifies the path to be taken by the MS-PW being established. Each hop along the path is represented by an abstract node, which is a group of one or more S-PEs, identified by an IPv4, IPv6, or S-PE address. The ER-TLV format is as per Section 4.1 of [RFC3212].",
      "ja": "ER-TLVは、MS-PWを確立することによって取るべきパスを指定します。経路に沿った各ホップはのIPv4、IPv6の、またはS-PEアドレスによって識別された1つまたは複数のS-PEの基であり、抽象ノード、によって表されます。 ER-TLVフォーマットは、[RFC3212]のセクション4.1のとおりです。"
    },
    {
      "indent": 3,
      "text": "The ER-TLV contains one or more ER-Hop TLVs as defined in Section 3.3.",
      "ja": "3.3節で定義されたER-TLVは、一つ以上のER-ホップのTLVが含まれています。"
    },
    {
      "indent": 0,
      "text": "3.3. Explicit Route Hop TLV (ER-Hop TLV)",
      "section_title": true,
      "ja": "3.3。明示的なルートホップTLV（ERホップTLV）"
    },
    {
      "indent": 3,
      "text": "The contents of an ER-TLV are a series of variable-length ER-Hop TLVs. Each hop contains the identification of an \"abstract node\" that represents the hop to be traversed. The ER-Hop TLV format is as specified in Section 4.2 of [RFC3212].",
      "ja": "ER-TLVの内容が可変長ERホップのTLVのシリーズです。各ホップを横断するホップを表す「抽象ノード」の識別を含んでいます。 [RFC3212]のセクション4.2で指定されるようにERホップTLV形式です。"
    },
    {
      "indent": 3,
      "text": "[RFC3212] defines four ER-Hop TLV Types: IPv4 Prefix, IPv6 Prefix, Autonomous System Number, and LSP-ID. This document specifies the following new ER-Hop TLV Type:",
      "ja": "IPv4のプレフィックスのIPv6プレフィックス、自律システム番号、およびLSP-ID：[RFC3212]は4 ERホップTLVタイプを定義します。このドキュメントは、以下の新しいERホップTLVのタイプを指定します。"
    },
    {
      "indent": 17,
      "text": "Value  Type\n------ --------------------------------\n0x0805 L2 PW Address of Switching Point",
      "raw": true
    },
    {
      "indent": 32,
      "text": "ER-Hop TLV",
      "ja": "ERホップTLV"
    },
    {
      "indent": 3,
      "text": "Details of the ER-Hop semantics are defined in Section 3.4.",
      "ja": "ERホップセマンティクスの詳細は、3.4節で定義されています。"
    },
    {
      "indent": 0,
      "text": "3.4. ER-Hop Semantics",
      "section_title": true,
      "ja": "3.4。 ERホップセマンティクス"
    },
    {
      "indent": 3,
      "text": "This section describes the various semantics associated with the ER-Hop TLV.",
      "ja": "このセクションでは、ERホップTLVに関連する様々な意味を説明しています。"
    },
    {
      "indent": 0,
      "text": "3.4.1. ER-Hop Type: IPv4 Prefix",
      "section_title": true,
      "ja": "3.4.1。 ERホップタイプ：IPv4のプレフィックス"
    },
    {
      "indent": 3,
      "text": "The semantics of the IPv4 ER-Hop TLV Type are specified in [RFC3212], Section 4.7.1.",
      "ja": "IPv4のERホップTLVタイプのセマンティクスは[RFC3212]で指定されている、セクション4.7.1。"
    },
    {
      "indent": 0,
      "text": "3.4.2. ER-Hop Type: IPv6 Prefix",
      "section_title": true,
      "ja": "3.4.2。 ERホップタイプ：IPv6のプレフィックス"
    },
    {
      "indent": 3,
      "text": "The semantics of the IPv6 ER-Hop TLV Type are specified in [RFC3212], Section 4.7.2.",
      "ja": "IPv6のERホップTLVタイプのセマンティクスは[RFC3212]で指定されている、セクション4.7.2。"
    },
    {
      "indent": 0,
      "text": "3.4.3. ER-Hop Type: L2 PW Address",
      "section_title": true,
      "ja": "3.4.3。 ERホップタイプ：L2 PW住所"
    },
    {
      "indent": 3,
      "text": "The semantics of the L2 PW Address ER-Hop TLV Type, which contains the L2 PW Address derived from the Generalized PWid Forwarding Equivalence Class (FEC) AII Type 2 structure as defined in [RFC5003], are as follows.",
      "ja": "次のように[RFC5003]で定義されるように一般PWID転送等価クラス（FEC）AIIタイプ2の構造に由来するL2 PWアドレスを含むL2 PWアドレスERホップTLVタイプのセマンティクスは、です。"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|U|F|      ER-Hop Type          |      Length = 18              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|L|             Reserved                        |    PreLen     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|  AII Type=02  |    Length     |        Global ID              |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|       Global ID (contd.)      |        Prefix                 |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|       Prefix (contd.)         |        AC ID                  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      AC ID                    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "U/F These bits MUST be set to zero and the procedures of [RFC5036] followed when the TLV is not known to the receiving node.",
      "ja": "U / Fこれらのビットはゼロに設定しなければならなくて、TLVが受信ノードに知られていない場合、[RFC5036]の手順が続きます。"
    },
    {
      "indent": 6,
      "text": "Type A fourteen-bit field carrying the value of the ER-Hop 3, L2 PW Address, Value = 0x0805.",
      "ja": "ERホップ3、L2 PWアドレス、値= 0x0805の値を搬送する14ビットのフィールドを入力します。"
    },
    {
      "indent": 6,
      "text": "Length Specifies the length of the value field in bytes = 18.",
      "ja": "長さはバイト= 18の値フィールドの長さを指定します。"
    },
    {
      "indent": 6,
      "text": "L Bit Set to indicate a loose hop. Cleared to indicate a strict hop.",
      "ja": "Lビットが緩んホップを示すために設定してください。厳格なホップを示すためにクリアされます。"
    },
    {
      "indent": 6,
      "text": "Reserved Zero on transmission. Ignored on receipt.",
      "ja": "送信時にゼロを禁じます。領収書の上で無視。"
    },
    {
      "indent": 6,
      "text": "PreLen Prefix Length 1-96 (including the length of the Global ID, Prefix, and AC ID fields).",
      "ja": "（グローバルID、プレフィックス、及びAC IDフィールドの長さを含む）PreLenプレフィックス長1-96。"
    },
    {
      "indent": 6,
      "text": "All other fields (AII Type, Length, Global ID, Prefix, and AC ID) define the L2 PW Address and are to be set and interpreted as defined in Section 3.2 of [RFC5003].",
      "ja": "他のすべてのフィールド（AIIタイプ、長さ、グローバルID、プレフィックス、及びAC ID）がL2 PWアドレスを定義し、[RFC5003]のセクション3.2で定義されるように設定して解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "4. Explicit Route TLV Processing",
      "section_title": true,
      "ja": "4.明示的ルートTLV処理"
    },
    {
      "indent": 0,
      "text": "4.1. Next-Hop Selection",
      "section_title": true,
      "ja": "4.1。次ホップの選択"
    },
    {
      "indent": 3,
      "text": "A PW Label Mapping message containing an Explicit Route TLV specifies the next hop for a given MS-PW path. Selection of this next hop by the ST-PE or S-PE inserting the ER-Hop TLV may involve a selection from a set of possible alternatives. The mechanism for making a selection from this set is implementation specific and is outside the scope of this document. The mechanism used to select a particular path is also outside the scope of this document, but each node MUST determine a loop-free path if it is to signal the MS-PW. [RFC6073], Section 7.6 provides a mechanism by which a node can check that the path taken by an MS-PW does not include loops.",
      "ja": "明示的ルートTLVを含むPW Label Mappingメッセージは、指定されたMS-PWパスの次のホップを指定します。 ERホップTLVを挿入ST-PEまたはS-PEにより、この次のホップの選択が可能な選択肢のセットからの選択を含んでもよいです。このセットから選択を行うための機構は、実装固有のものであり、この文書の範囲外です。特定のパスを選択するために使用されるメカニズムは、この文書の範囲外でもあり、それはMS-PWに合図する場合、各ノードは、ループのないパスを決定しなければなりません。 [RFC6073]、セクション7.6は、ノードはMS-PWによって取られる経路はループが含まれていないことを確認することができるメカニズムを提供します。"
    },
    {
      "indent": 3,
      "text": "As noted in Section 1, in many deployments the ST-PE will not have a view of the topology of S-PEs and so the path will need to be supplied from a management application.",
      "ja": "第1節で述べたように、多くの展開でST-PEは、S-PEのトポロジーのビューを持っていないので、パス管理アプリケーションから供給する必要があります。"
    },
    {
      "indent": 3,
      "text": "If a loop-free path cannot be found by an ST-PE or S-PE, then a node MUST NOT attempt to signal the MS-PW. For an S-PE, if it cannot determine a loop-free path, then the received Label Mapping message MUST be released with a status code of \"PW Loop Detected\" as per Section 4.2.3 of [RFC7267].",
      "ja": "ループのないパスは、ST-PEまたはS-PEにより求めることができない場合、ノードはMS-PWを通知する試みてはいけません。 S-PEは、それがループのないパスを決定できない場合は、受信したLabel Mappingメッセージは、[RFC7267]のセクション4.2.3に従って「検出PWループ」のステータスコードで放出されなければなりません。"
    },
    {
      "indent": 3,
      "text": "To determine the next hop for the MS-PW path, a node performs the following steps. Note that these procedures assume that a valid S-PE address has been assigned to the node, as per Section 3.1, above.",
      "ja": "MS-PWパスの次のホップを決定するために、ノードは以下のステップを実行します。これらの手順は、上記のセクション3.1に従って、有効なS-PEアドレスがノードに割り当てられていると仮定することに注意してください。"
    },
    {
      "indent": 3,
      "text": "1. The node receiving the Label Mapping message that contains an ER-TLV MUST evaluate the first ER-Hop. If the L bit is not set in the first ER-Hop and if the node is not part of the abstract node described by the first ER-Hop (i.e., it does not lie within the prefix as determined by the prefix length specified in the ER-Hop TLV), it has received the message in error. Therefore, the node MUST reply with a Label Release message with a \"Bad Initial ER-Hop Error\" (0x04000004) status code. If the L bit is set and the local node is not part of the abstract node described by the first ER-Hop, the node selects a next hop that is along the path to the abstract node described by the first ER-Hop. If there is no ER-Hop TLV contained in the ER-TLV, the message is also in error, and the node SHOULD return a \"Bad Explicit Routing TLV Error\" (0x04000001) status code in a Label Release message sent to the upstream node. Note that this statement does not preclude a Label Mapping message with no ER-TLV. If a Label Mapping message with no ER-TLV is received, then it MUST be processed as per [RFC7267].",
      "ja": "1. ER-TLVは、最初のERホップを評価しなければなりません含まれているラベルマッピングメッセージを受信したノード。 Lビットが最初にERホップに設定されていない場合、ノードは最初ERホップによって記述抽象ノードの一部でない場合に指定されたプレフィックス長により決定される（すなわち、それは、プレフィックス内にありませんERホップTLV）、それはエラーでメッセージを受信しました。したがって、ノードは、「悪い初期のERホップエラー」（0x04000004）ステータスコードとラベル解放メッセージに返答しなければなりません。 Lビットが設定され、ローカル・ノードが最初のERホップによって記述抽象ノードの一部でない場合、ノードは最初ERホップによって記述抽象ノードへの経路に沿った次のホップを選択します。 ER-TLVに含まれるいかなるERホップTLVが存在しない場合、メッセージはエラーでもあり、そしてノードが上流ノードに送信されたラベル解放メッセージに「悪い明示的なルーティングTLVエラー」（0x04000001）ステータスコードを返すべきです。この文はありませんER-TLVとラベルマッピングメッセージを排除するものではないことに注意してください。無ER-TLVとLabel Mappingメッセージを受信した場合、それは、[RFC7267]に従って処理されなければなりません。"
    },
    {
      "indent": 3,
      "text": "2. If there are no further ER-Hop TLVs following the first ER-Hop TLV, this indicates the end of the explicit route. The Explicit Route TLV MUST be removed from the Label Mapping message. This node may or may not be the end of the PW. Processing continues as per Section 4.2, where a new Explicit Route TLV MAY be added to the Label Mapping message.",
      "ja": "2.それ以上のERホップのTLVは、最初のERホップTLV次がない場合、これは明白なルートの終わりを示します。明示的ルートTLVは、ラベルマッピングメッセージから削除されなければなりません。このノードは、またはPWの端部であってもなくてもよいです。処理は、新しい明示的ルートTLVは、ラベルマッピングメッセージに追加されてもよい4.2節、あたりとして続けています。"
    },
    {
      "indent": 3,
      "text": "3. If a second ER-Hop TLV does exist, and the node is also a part of the abstract node described by the second ER-Hop, then the node deletes the first ER-Hop and continues processing with step 2, above. Note that this makes the second ER-Hop into the first ER-Hop for the iteration for the next PW segment.",
      "ja": "第二のERホップTLVが存在し、ノードは、第2のERホップによって記述抽象ノードの一部である場合3.ノードは、上記第一のERホップを削除し、ステップ2で処理を継続します。これは、次のPWセグメントの反復のための最初のERホップに第ERホップを行うことに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "4. The node determines if it is topologically adjacent to the abstract node described by the second ER-Hop. That is, it is directly connected to the next node by a PW control-plane adjacency. If so, the node selects a particular next hop that is a member of the abstract node. The node then deletes the first ER-Hop and continues processing as per Section 4.2, below.",
      "ja": "それは第二のERホップによって記述抽象ノードに位相的に隣接している場合4.ノードが決定します。つまり、直接PWコントロールプレーンの隣接関係によって次のノードに接続されています。そうである場合、ノードは、抽象ノードのメンバーである特定の次のホップを選択します。ノードは、次に以下、第一のERホップを削除し、4.2節に従って処理を継続します。"
    },
    {
      "indent": 3,
      "text": "5. Next, the node selects a next hop within the abstract node of the first ER-Hop that is along the path to the abstract node of the second ER-Hop. If no such path exists, then there are two cases:",
      "ja": "5.次に、ノードは、第ERホップの抽象ノードへの経路に沿って第一ERホップの抽象ノード内の次のホップを選択します。そのようなパスが存在しない場合は、2つのケースがあります。"
    },
    {
      "indent": 7,
      "text": "A.  If the second ER-Hop is a strict ER Hop, then there is an\n    error, and the node MUST return a Label Release message to\n    the upstream node with a \"Bad Strict Node Error\" (0x04000002)\n    status code.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "B. Otherwise, if the second ER-Hop is a loose ER Hop, then the node selects any next hop that is along the path to the next abstract node. If no path exists within the MPLS domain, then there is an error, and the node MUST return a Label Release message to the upstream node with a \"Bad Loose Node Error\" (0x04000003) status code.",
      "ja": "第二のERホップルーズERホップである場合、Bは、そうでない場合、ノードは、次の抽象ノードへの経路に沿ったいずれかの次のホップを選択します。パスがMPLSドメイン内に存在しない場合は、そこに誤差があり、ノードは「悪いルースノード・エラー」（0x04000003）ステータスコードで上流のノードにラベル解放メッセージを返さなければなりません。"
    },
    {
      "indent": 3,
      "text": "6. Finally, the node replaces the first ER-Hop with any ER Hop that denotes an abstract node containing the next hop. This is necessary so that when the explicit route is received by the next hop, it will be accepted.",
      "ja": "6.最後に、ノードは、次ホップを含む抽象ノードを表す任意のERホップを有する第1のERホップを置き換えます。明示的なルートが次のホップによって受信されると、それが受け入れられるようにするために必要です。"
    },
    {
      "indent": 3,
      "text": "7. Progress the Label Mapping message to the next hop.",
      "section_title": true,
      "ja": "7.次のホップにラベルマッピングメッセージを進行します。"
    },
    {
      "indent": 0,
      "text": "4.2. Adding ER Hops to the Explicit Route TLV",
      "section_title": true,
      "ja": "4.2。明示的ルートTLVにERホップを追加します"
    },
    {
      "indent": 3,
      "text": "After selecting a next hop, the node MAY alter the explicit route in the following ways.",
      "ja": "次のホップを選択した後、ノードは、次の方法で明示的経路を変更することができます。"
    },
    {
      "indent": 3,
      "text": "If, as part of executing the algorithm in Section 4.1, the Explicit Route TLV is removed, then the node MAY add a new Explicit Route TLV.",
      "ja": "4.1節でアルゴリズムを実行するの一環として、明示的ルートTLVが削除され、場合、そのノードは新しい明示的ルートTLVを追加するかもしれません。"
    },
    {
      "indent": 3,
      "text": "Otherwise, if the node is a member of the abstract node for the first ER-Hop, then a series of ER Hops MAY be inserted before the First ER Hop or the first ER-Hop MAY be replaced. Each ER Hop in this series MUST denote an abstract node that is a subset of the current abstract node.",
      "ja": "ノードが最初にERホップの抽象ノードのメンバーである場合はそうでなければ、次にERホップの一連まずERホップまたは第ERホップの前に挿入されていてもよい置換されていてもよいです。このシリーズの各ERホップは、現在の抽象ノードのサブセットである抽象ノードを意味しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Alternately, if the first ER-Hop is a loose ER Hop, an arbitrary series of ER Hops MAY be inserted prior to the first ER-Hop.",
      "ja": "最初のERホップルーズERホップ、ERホップの任意の系列である場合交互に、最初のERホップ前に挿入されてもよいです。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "RFC 5036 [RFC5036] defines the LDP TLV name space, which is maintained by IANA, in the LDP \"TLV Type Name Space\" registry. TLV types for the Explicit Route TLV, the IPv4 Prefix ER-Hop TLV, and the IPv6 Prefix ER-Hop TLV are already defined in this registry.",
      "ja": "RFC 5036 [RFC5036]はLDP「TLVタイプ名スペース」レジストリに、IANAによって維持されたLDP TLV名前空間を定義します。明示的ルートTLV、IPv4のプレフィックスERホップTLV、およびIPv6プレフィックスERホップTLVのためのTLVタイプは、すでにこのレジストリで定義されています。"
    },
    {
      "indent": 3,
      "text": "IANA has assigned a further code point from the IETF consensus portion of this registry as follows:",
      "ja": "次のようにIANAは、このレジストリのIETFコンセンサス部からさらにコードポイントを割り当てました。"
    },
    {
      "indent": 6,
      "text": "TLV Type                               Value   Reference\n------------------------------------   ------  -------------\nL2 PW Address of Switching Point       0x0805  This Document",
      "raw": true
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document introduces no new security considerations beyond those discussed in [RFC5036], [RFC4447], and [RFC7267]. The security considerations detailed in those documents apply to the protocol extensions described in this RFC.",
      "ja": "この文書では、[RFC5036]、[RFC4447]、および[RFC7267]で説明したものを超えてどんな新しいセキュリティ問題も紹介しません。これらの文献に詳述されたセキュリティ上の考慮事項は、このRFCに記述されたプロトコルの拡張に適用されます。"
    },
    {
      "indent": 3,
      "text": "As with [RFC7267], it should be noted that the path selection mechanisms specified in this document enable the network to automatically select the S-PEs that are used to forward packets on the MS-PW. Appropriate tools, such as the Virtual Circuit Connectivity Verification (VCCV) trace mechanisms specified in [RFC6073], can be used by an operator of the network to verify the path taken by the MS-PW and therefore be satisfied that the path does not represent an additional security risk.",
      "ja": "[RFC7267]と同様に、この文書で指定されたパス選択機構が自動的にMS-PWにパケットを転送するために使用されるS-PESを選択するために、ネットワークを有効にすることに留意すべきです。このような[RFC6073]で指定された仮想回線接続性検証（VCCV）トレース機構、MS-PWで撮影したパスを確認するために、ネットワークのオペレータによって使用され、したがって、パスは表していないことを満足することができるように、適切なツール追加のセキュリティリスク。"
    },
    {
      "indent": 0,
      "text": "7. Normative References",
      "section_title": true,
      "ja": "7.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月、<http://www.rfc-editor.org/info/rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3212] Jamoussi, B., Andersson, L., Callon, R., Dantu, R., Wu, L., Doolan, P., Worster, T., Feldman, N., Fredette, A., Girish, M., Gray, E., Heinanen, J., Kilty, T., and A. Malis, \"Constraint-Based LSP Setup using LDP\", RFC 3212, January 2002, <http://www.rfc-editor.org/info/rfc3212>.",
      "ja": "[RFC3212] Jamoussi、B.、アンダーソン、L.、Callon、R.、Dantu、R.、ウー、L.、Doolan、P.、Worster、T.、フェルドマン、N.、Fredette、A.、Girish、 M.、グレー、E.、Heinanen、J.、Kilty、T.、およびA. Malis、 \"LDPを使用して、制約ベースLSPセットアップ\"、RFC 3212、2002年1月、<HTTP：//www.rfc-editor。組織/情報/ rfc3212>。"
    },
    {
      "indent": 3,
      "text": "[RFC4447] Martini, L., Rosen, E., El-Aawar, N., Smith, T., and G. Heron, \"Pseudowire Setup and Maintenance Using the Label Distribution Protocol (LDP)\", RFC 4447, April 2006, <http://www.rfc-editor.org/info/rfc4447>.",
      "ja": "[RFC4447]、L.、ローゼン、E.、エル・Aawar、N.、スミス、T.、およびG.サギ、 \"ラベル配布プロトコル（LDP）を使用して、擬似回線の設定とメンテナンス\"、RFC 4447、2006年4月マティーニ、<http://www.rfc-editor.org/info/rfc4447>。"
    },
    {
      "indent": 3,
      "text": "[RFC5003] Metz, C., Martini, L., Balus, F., and J. Sugimoto, \"Attachment Individual Identifier (AII) Types for Aggregation\", RFC 5003, September 2007, <http://www.rfc-editor.org/info/rfc5003>.",
      "ja": "[RFC5003]メス、C.、マルティーニ、L.、Balus、F.、及びJ.杉本、 \"集約のためのアタッチメント個体識別子（AII）タイプ\"、RFC 5003、2007年9月、<HTTP：//www.rfc- editor.org/info/rfc5003>。"
    },
    {
      "indent": 3,
      "text": "[RFC5036] Andersson, L., Minei, I., and B. Thomas, \"LDP Specification\", RFC 5036, October 2007, <http://www.rfc-editor.org/info/rfc5036>.",
      "ja": "[RFC5036]アンデション、L.、Minei、I.、およびB.トーマス、 \"LDP仕様\"、RFC 5036、2007年10月、<http://www.rfc-editor.org/info/rfc5036>。"
    },
    {
      "indent": 3,
      "text": "[RFC6073] Martini, L., Metz, C., Nadeau, T., Bocci, M., and M. Aissaoui, \"Segmented Pseudowire\", RFC 6073, January 2011, <http://www.rfc-editor.org/info/rfc6073>.",
      "ja": "[RFC6073]マルティーニ、L.、メス、C.、ナドー、T.、ボッチ、M.、およびM. Aissaoui、 \"セグメント疑似回線\"、RFC 6073、2011年1月、<HTTP：//www.rfc-editor。組織/情報/ rfc6073>。"
    },
    {
      "indent": 3,
      "text": "[RFC7267] Martini, L., Bocci, M., and F. Balus, \"Dynamic Placement of Multi-Segment Pseudowires\", RFC 7267, June 2014, <http://www.rfc-editor.org/info/rfc7267>.",
      "ja": "[RFC7267]マルティーニ、L.、ボッチ、M.、およびF. Balus、 \"マルチセグメントスードワイヤの動的配置\"、RFC 7267、2014年6月、<http://www.rfc-editor.org/info/rfc7267 >。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors gratefully acknowledge the contribution of the RFC 3212 [RFC3212] authors for the specification of the ER TLV and the ER-Hop TLV, which are reused by this document. The authors also gratefully acknowledge the input of Lizhong Jin.",
      "ja": "作者は感謝してER TLVと、このドキュメントで再利用されているERホップTLVの仕様については、RFC 3212 [RFC3212]の著者の貢献を認めます。著者らはまた、感謝Lizhongジンの入力を認めます。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Pranjal Kumar Dutta Alcatel-Lucent 701 E. Middlefield Road Mountain View, California 94043 United States",
      "ja": "PranjalクマーDutta氏アルカテル・ルーセント701 E.ミドルロード、マウンテンビュー、カリフォルニア94043米国"
    },
    {
      "indent": 3,
      "text": "EMail: pranjal.dutta@alcatel-lucent.com",
      "ja": "メールアドレス：pranjal.dutta@alcatel-lucent.com"
    },
    {
      "indent": 3,
      "text": "Matthew Bocci Alcatel-Lucent Voyager Place, Shoppenhangers Road Maidenhead, Berks SL6 2PJ United Kingdom",
      "ja": "マシューボッチアルカテル・ルーセントボイジャープレイス、Shoppenhangers道路メイデンヘッド、バークスSL6 2PJイギリス"
    },
    {
      "indent": 3,
      "text": "EMail: matthew.bocci@alcatel-lucent.com",
      "ja": "メールアドレス：matthew.bocci@alcatel-lucent.com"
    },
    {
      "indent": 3,
      "text": "Luca Martini Cisco Systems 9155 East Nichols Avenue, Suite 400 Englewood, Colorado 80112 United States",
      "ja": "ルカ・マティーニシスコシステムズ9155東ニコルズアベニュー、スイート400イングルウッド、コロラド80112米国"
    },
    {
      "indent": 3,
      "text": "EMail: lmartini@cisco.com",
      "ja": "メールアドレス：lmartini@cisco.com"
    }
  ]
}