{
  "title": {
    "text": "RFC 7345 - UDP Transport Layer (UDPTL) over Datagram Transport Layer Security (DTLS)",
    "ja": "RFC 7345 - データグラムトランスポート層セキュリティ（DTLS）のUDPトランスポート層（UDPTL）"
  },
  "number": 7345,
  "created_at": "2019-11-01 00:15:24.318928+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       C. Holmberg\nRequest for Comments: 7345                                   I. Sedlacek\nCategory: Standards Track                                       Ericsson\nISSN: 2070-1721                                             G. Salgueiro\n                                                                   Cisco\n                                                             August 2014",
      "raw": true
    },
    {
      "indent": 13,
      "text": "         UDP Transport Layer (UDPTL)\nover Datagram Transport Layer Security (DTLS)",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document specifies how the UDP Transport Layer (UDPTL) protocol, the predominant transport protocol for T.38 fax, can be transported over the Datagram Transport Layer Security (DTLS) protocol, how the usage of UDPTL over DTLS is indicated in the Session Description Protocol (SDP), and how UDPTL over DTLS is negotiated in a session established using the Session Initiation Protocol (SIP).",
      "ja": "この文書では、UDPトランスポート層（UDPTL）プロトコル、T.38ファックスのための主要なトランスポートプロトコルは、DTLSを超えるUDPTLの使用は、セッション記述に示されているか、データグラムトランスポート層セキュリティ（DTLS）プロトコルを介して輸送することができる方法を指定しますプロトコル（SDP）、そしてどのようにDTLS上UDPTLは、セッション開始プロトコル（SIP）を使用して確立されたセッション中にネゴシエートされます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7345.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7345で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. Conventions .....................................................5\n3. Secure Channel ..................................................5\n4. SDP Offerer/Answerer Procedures .................................6\n   4.1. General ....................................................6\n   4.2. Generating the Initial Offer ...............................7\n   4.3. Generating the Answer ......................................7\n   4.4. Offerer Processing of the Answer ...........................7\n   4.5. Modifying the Session ......................................7\n5. Miscellaneous Considerations ....................................8\n   5.1. Anonymous Calls ............................................8\n   5.2. NAT Traversal ..............................................8\n        5.2.1. ICE Usage ...........................................8\n        5.2.2. STUN Interaction ....................................8\n   5.3. Rekeying ...................................................9\n   5.4. Compatibility with UDPTL over UDP ..........................9\n6. Security Considerations .........................................9\n7. IANA Considerations ............................................10\n8. Acknowledgments ................................................10\n9. References .....................................................11\n   9.1. Normative References ......................................11\n   9.2. Informative References ....................................12\nAppendix A.  Examples .............................................13\n  A.1.  General ...................................................13\n  A.2.  Basic Message Flow ........................................13\n  A.3.  Message Flow of T.38 Fax Replacing Audio Media Stream in\n        an Existing Audio-Only Session ............................20",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "While it is possible to transmit highly sensitive documents using traditional telephony encryption devices, secure fax on the Public Switched Telephone Network (PSTN) was never widely considered or prioritized. This was mainly because of the challenges involved with malevolent physical access to telephony equipment. As real-time communications transition to IP networks, where information might potentially be intercepted or spoofed, an appropriate level of security for fax that offers integrity and confidentiality protection is vital.",
      "ja": "それは従来のテレフォニー暗号化デバイスを使用して、高度に機密文書を送信することは可能ですが、公共の安全ファックス電話網（PSTN）は、広く考えられていないか、優先順位を付けなかったスイッチ。これは主に、テレフォニー機器への悪意の物理的なアクセスに関わる課題でした。情報は、潜在的に傍受やなりすましの可能性がありますIPネットワークへのリアルタイム通信推移として、完全性と機密性の保護を提供していますファックスのための適切なレベルのセキュリティが不可欠です。"
    },
    {
      "indent": 3,
      "text": "The overwhelmingly predominant fax transport protocol is UDPTL-based, as described in Section 9.1 of [ITU.T38.2010]. The protocol stack for fax transport using UDPTL is shown in Figure 1.",
      "ja": "【ITU.T38.2010]のセクション9.1に記載されているように圧倒的に優勢なファックス転送プロトコルは、UDPTLベースです。 UDPTLを使用してFAX転送のためのプロトコルスタックは、図1に示されています。"
    },
    {
      "indent": 25,
      "text": "+-----------------------------+\n| Internet facsimile protocol |\n+-----------------------------+\n|            UDPTL            |\n+-----------------------------+\n|            UDP              |\n+-----------------------------+\n|            IP               |\n+-----------------------------+",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 1: Protocol Stack for UDPTL over UDP",
      "ja": "図1：UDP上UDPTLのためのプロトコルスタック"
    },
    {
      "indent": 3,
      "text": "The following mechanisms are available for securing fax:",
      "ja": "以下のメカニズムは、FAXを確保するために用意されています。"
    },
    {
      "indent": 3,
      "text": "o Annex H of [ITU.T30.2005] specifies an application-layer integrity and confidentiality protection of fax that is independent of the transport protocol and is based on the RSA algorithm for use with the T.30 telephony protocol by Group 3 facsimile equipment (G3FE).",
      "ja": "O附属書H [ITU.T30.2005]のは、トランスポートプロトコルから独立しており、グループ3ファクシミリ装置によるT.30テレフォニープロトコルで使用するためにRSAアルゴリズムに基づいており、ファックスのアプリケーション層の完全性と機密性の保護を指定します（G3FE）。"
    },
    {
      "indent": 3,
      "text": "o [ITU.T38.2010] specifies fax transport over RTP/SAVP, which enables integrity and confidentiality protection of fax in IP networks.",
      "ja": "O [ITU.T38.2010] IPネットワークにおけるファックスの完全性と機密性の保護を可能にRTP / SAVP、オーバーファックストランスポートを指定します。"
    },
    {
      "indent": 3,
      "text": "Both of these mechanisms have been available for many years and never gained any significant adoption in the market. This has prompted an effort to develop an approach, based on open standards, for securing fax communications over an IP-based transport.",
      "ja": "これらのメカニズムの両方が長年にわたって利用され、市場に重大な採用を獲得したことがありません。これは、IPベースのトランスポート上でのFAX通信を確保するために、オープンな標準に基づいて、アプローチを開発するための努力を促しました。"
    },
    {
      "indent": 3,
      "text": "Telephony-based protocols like T.30 offer application-level security options like the RSA-based approach detailed in Annex H of the T.30 specification [ITU.T30.2005]. The problem is that it is very sparingly implemented and not enforced at the transport level.",
      "ja": "T.30仕様[ITU.T30.2005]の付属書Hに詳述RSAベースのアプローチのようなT.30オファーアプリケーションレベルのセキュリティオプションのような電話ベースのプロトコル。問題は、それは非常に控えめに実装され、トランスポート・レベルで適用されていないということです。"
    },
    {
      "indent": 3,
      "text": "It is worth noting that while T.38 over RTP offers a very viable option for such standards-based IP security solution using Secure Realtime Transport Protocol (SRTP), this fax-over-IP transport never gained any traction in the marketplace and accounts for a negligible percentage of fax-over-IP implementations.",
      "ja": "RTPを超えるT.38は、SRTP（Secure Realtime Transport Protocol）を使用して、このような標準ベースのIPセキュリティソリューションのための非常に現実的な選択肢を提供していますが、このファックスオーバーIPトランスポートは、市場内の任意の注目を集めたことがないことは注目に値するとを占めファックスオーバーIP実装の無視できない割合。"
    },
    {
      "indent": 3,
      "text": "Thus, security mechanisms offering integrity and confidentiality protection should be limited to UDPTL-based fax transport, which is the only broad-based fax-over-IP solution. The 3rd Generation Partnership Project (3GPP) launched a study on how best to provide secure fax in the IP Multimedia Subsystem (IMS) for UDPTL. Results of the study confirmed that this security was best achieved by using UDPTL over DTLS.",
      "ja": "このため、完全性と機密性の保護を提供するセキュリティメカニズムは、幅広いベースのファックス・オーバーIPソリューションですUDPTLベースのFAX輸送に限定されるべきです。 3GPP（3rd Generation Partnership Project）は、最良UDPTLのためのIPマルチメディアサブシステム（IMS）における安全なファックスを提供する方法についての研究を開始しました。この研究の結果は、このセキュリティが最高DTLS上UDPTLを使用することによって達成されたことを確認しました。"
    },
    {
      "indent": 3,
      "text": "This document specifies fax transport using UDPTL over DTLS [RFC6347], which enables integrity and confidentiality protection of fax in IP networks. The protocol stack that enhances fax transport to offer integrity and confidentiality using UDPTL over DTLS is shown in Figure 2.",
      "ja": "この文書では、IPネットワークにおけるファックスの完全性と機密性の保護を可能にDTLS [RFC6347]、オーバーUDPTLを使用してFAXトランスポートを指定します。 DTLS上UDPTLを使用して完全性と機密性を提供するためにファックス輸送を強化するプロトコルスタックを図2に示されています。"
    },
    {
      "indent": 25,
      "text": "+-----------------------------+\n| Internet facsimile protocol |\n+-----------------------------+\n|            UDPTL            |\n+-----------------------------+\n|            DTLS             |\n+-----------------------------+\n|            UDP              |\n+-----------------------------+\n|            IP               |\n+-----------------------------+",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Figure 2: Protocol Stack for UDPTL over DTLS over UDP",
      "ja": "図2：UDP上DTLSのUDPTLのためのプロトコルスタック"
    },
    {
      "indent": 3,
      "text": "The primary motivations for the mechanism in this document are:",
      "ja": "この文書に記載されているメカニズムの主な動機は、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o The design of DTLS [RFC6347] is clearly defined and well understood, and implementations are widely available.",
      "ja": "DTLS [RFC6347]のデザインoを明確に定義され、よく理解され、実装が広く利用可能です。"
    },
    {
      "indent": 3,
      "text": "o No DTLS extensions are required in order to enable UDPTL transport over DTLS.",
      "ja": "OいいえDTLSの拡張子はDTLS上UDPTL輸送を可能にするためには必要ありません。"
    },
    {
      "indent": 3,
      "text": "o Fax transport using UDPTL over DTLS only requires insertion of the DTLS layer between the UDPTL layer and the UDP layer, as shown in Figure 2. The UDPTL layer and the layers above the UDPTL layer require no modifications.",
      "ja": "図2にUDPTL層を示すようにDTLS上UDPTLを用いOファックス輸送のみ、UDPTL層およびUDP層との間にDTLS層の挿入を必要とし、UDPTL層の上の層は全く変更を必要としません。"
    },
    {
      "indent": 3,
      "text": "o UDPTL [ITU.T38.2010] is by far the most widely deployed fax transport protocol in IP networks.",
      "ja": "O UDPTLは、[ITU.T38.2010]を抜いて、IPネットワークの中で最も広く導入されているファックス・トランスポート・プロトコルです。"
    },
    {
      "indent": 3,
      "text": "o 3GPP and the IP fax community need a mechanism to transport UDPTL over DTLS in order to provide secure fax in SIP-based networks (including IMS).",
      "ja": "O 3GPPおよびIPファックスコミュニティは、（IMSを含む）SIPベースのネットワークで安全なファックスを提供するために、DTLS上UDPTLを輸送するための機構を必要としています。"
    },
    {
      "indent": 3,
      "text": "This document specifies the transport of UDPTL over DTLS using the DTLS record layer \"application_data\" packets [RFC5246] [RFC6347].",
      "ja": "この文書では、DTLSレコード層「application_data」パケット[RFC5246] [RFC6347]を使用してDTLS上UDPTLのトランスポートを指定します。"
    },
    {
      "indent": 3,
      "text": "Since the DTLS record layer \"application_data\" packet does not indicate whether it carries UDPTL or some other protocol, the usage of a dedicated DTLS association for transport of UDPTL needs to be negotiated, e.g., using the Session Description Protocol (SDP) [RFC4566] and the SDP offer/answer mechanism [RFC3264].",
      "ja": "DTLS記録層「application_data」パケットがセッション記述プロトコル（SDP）を使用して、例えば、それはUDPTLまたはいくつかの他のプロトコルを運ぶ、UDPTLの輸送のための専用DTLSアソシエーションの使用をネゴシエートする必要があるかどうかを示すものではないので、[RFC4566]そして、SDPのオファー/アンサーメカニズム[RFC3264]。"
    },
    {
      "indent": 3,
      "text": "Therefore, this document specifies a new <proto> value [RFC4566] for the SDP media description (\"m=\" line) [RFC3264], in order to indicate UDPTL over DTLS in SDP messages [RFC4566].",
      "ja": "したがって、この文書は、SDPメッセージ[RFC4566]にDTLS上UDPTLを示すために、新しい<プロト>値SD​​Pメディア記述のための[RFC4566]（ \"M =\" 行）[RFC3264]を特定します。"
    },
    {
      "indent": 0,
      "text": "2. Conventions",
      "section_title": true,
      "ja": "2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14、RFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "DTLS uses the term \"session\" to refer to a long-lived set of keying material that spans DTLS associations. In this document, in order to be consistent with SIP/SDP usage of \"session\" terminology, we use \"session\" to refer to a multimedia session and use the term \"DTLS session\" to refer to the DTLS construct. We use the term \"DTLS association\" to refer to a particular DTLS cipher suite and keying material set that is associated with a single host/port quartet. The same DTLS session can be used to establish the keying material for multiple DTLS associations. For consistency with other SIP/SDP usage, we use the term \"connection\" when what's being referred to is a multimedia stream that is not specifically DTLS.",
      "ja": "DTLSは、DTLSの関連付けをまたがる材料をキーイングの長寿命セットを参照するために用語「セッション」を使用しています。この文書では、「セッション」の用語のSIP / SDP用法と一致しているために、我々は、マルチメディアセッションを参照してDTLS構造体を参照するために用語「DTLSセッション」を使用する「セッション」を使用します。我々は、単一のホスト/ポートカルテットに関連付けられている特定のDTLS暗号スイートおよび鍵材料のセットを指すために、用語「DTLSアソシエーション」を使用します。同じDTLSセッションは、複数のDTLSアソシエーションの鍵素材を確立するために使用することができます。他のSIP / SDP用法との一貫性を保つために、私たちは何と呼ばれていますが、具体的ではありませんDTLSマルチメディア・ストリームである「接続」を使用します。"
    },
    {
      "indent": 0,
      "text": "3. Secure Channel",
      "section_title": true,
      "ja": "3.セキュリティで保護されたチャネル"
    },
    {
      "indent": 3,
      "text": "The UDPTL-over-DTLS media stream is negotiated using the SDP offer/ answer mechanism [RFC3264]. See Section 4 for more details.",
      "ja": "UDPTLオーバーDTLSのメディアストリームは、SDPオファー/アンサーメカニズム[RFC3264]を使用してネゴシエートされます。詳細は、4章を参照してください。"
    },
    {
      "indent": 3,
      "text": "DTLS is used as specified in [RFC6347]. Once the DTLS handshake is successfully completed (in order to prevent facsimile data from being transmitted insecurely), the UDPTL packets MUST be transported in DTLS record layer \"application_data\" packets.",
      "ja": "[RFC6347]で指定されるようにDTLSが使用されます。 DTLSハンドシェイクが成功（安全でない送信されてからファクシミリデータを防止するために）完了すると、UDPTLパケットはDTLS記録層「application_data」パケットで輸送されなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. SDP Offerer/Answerer Procedures",
      "section_title": true,
      "ja": "4. SDPオファー/アンサー手続き"
    },
    {
      "indent": 0,
      "text": "4.1. General",
      "section_title": true,
      "ja": "4.1。一般的な"
    },
    {
      "indent": 3,
      "text": "An endpoint (i.e., both the offerer and the answerer) MUST create an SDP media description (\"m=\" line) for each UDPTL-over-DTLS media stream and MUST assign a UDP/TLS/UDPTL value (see Table 1) to the \"proto\" field of the \"m=\" line.",
      "ja": "エンドポイント（すなわち、提供者と回答の両方）各UDPTLオーバーDTLSメディアストリームのためのSDPのメディア記述（「M =」行）を作成しなければならなくて、UDP / TLS / UDPTL値を割り当てる必要があり（表1を参照） 「M =」行の「プロト」フィールド。"
    },
    {
      "indent": 3,
      "text": "The procedures in this section apply to an \"m=\" line associated with a UDPTL-over-DTLS media stream.",
      "ja": "このセクションの手順は、UDPTLオーバーDTLSメディア・ストリームに関連付けられた「M =」行に適用されます。"
    },
    {
      "indent": 3,
      "text": "In order to negotiate a UDPTL-over-DTLS media stream, the following SDP attributes are used:",
      "ja": "UDPTLオーバーDTLSメディアストリームを交渉するために、以下SDP属性が使用されています。"
    },
    {
      "indent": 3,
      "text": "o The SDP attributes defined for UDPTL over UDP, as described in [ITU.T38.2010]; and",
      "ja": "【ITU.T38.2010]に記載されているように、UDP上UDPTLに対して定義されたSDP属性O;そして"
    },
    {
      "indent": 3,
      "text": "o The SDP attributes, defined in [RFC4145] and [RFC4572], as described in this section.",
      "ja": "このセクションで説明したように、O SDPは、[RFC4145]及び[RFC4572]で定義され、属性。"
    },
    {
      "indent": 3,
      "text": "The endpoint MUST NOT use the SDP \"connection\" attribute [RFC4145].",
      "ja": "エンドポイントは、SDP「接続」属性[RFC4145]を使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "In order to negotiate the TLS roles for the UDPTL-over-DTLS transport connection, the endpoint MUST use the SDP \"setup\" attribute [RFC4145].",
      "ja": "UDPTLオーバーDTLSトランスポート接続用のTLSの役割を交渉するためには、エンドポイントは、SDP「セットアップ」属性[RFC4145]を使用しなければなりません。"
    },
    {
      "indent": 3,
      "text": "If the endpoint supports, and is willing to use, a cipher suite with an associated certificate, the endpoint MUST include an SDP \"fingerprint\" attribute [RFC4572]. The endpoint MUST support SHA-256 for generating and verifying the SDP \"fingerprint\" attribute value. The use of SHA-256 is preferred. UDPTL over DTLS, at a minimum, MUST support TLS_DHE_RSA_WITH_AES_128_GCM_SHA256 and MUST support TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256. UDPTL over DTLS MUST prefer TLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256 and any other Perfect Forward Secrecy (PFS) cipher suites over non-PFS cipher suites. Implementations SHOULD disable TLS-level compression.",
      "ja": "エンドポイントがサポートしており、関連する証明書を使用して、暗号スイートを使用する意思がある場合、エンドポイントは、SDP「指紋」属性[RFC4572]を含まなければなりません。エンドポイントは、SDP「指紋」属性の値を生成し、検証するためにSHA-256をサポートしなければなりません。 SHA-256を使用することが好ましいです。 DTLSを超えるUDPTLは、最低でも、TLS_DHE_RSA_WITH_AES_128_GCM_SHA256をサポートしなければならないとTLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256をサポートしなければなりません。 DTLSを超えるUDPTLは、非PFS暗号スイートの上にTLS_ECDHE_RSA_WITH_AES_128_GCM_SHA256およびその他の完全転送秘密（PFS）の暗号スイートを好むしなければなりません。実装は、TLSレベルの圧縮を無効にする必要があります。"
    },
    {
      "indent": 3,
      "text": "If a cipher suite with an associated certificate is selected during the DTLS handshake, the certificate received during the DTLS handshake MUST match the fingerprint received in the SDP \"fingerprint\" attribute. If the fingerprint does not match the hashed certificate, then the endpoint MUST tear down the media session immediately. Note that it is permissible to wait until the other side's fingerprint has been received before establishing the connection; however, this may have undesirable latency effects.",
      "ja": "関連する証明書と暗号スイートがDTLSハンドシェーク中に選択された場合、証明書は、SDP「指紋」属性で、受信した指紋と一致しなければならないDTLSハンドシェーク中に受信しました。指紋がハッシュ化された証明書と一致しない場合、エンドポイントは、すぐにメディアセッションを切断しなければなりません。相手側の指紋が接続を確立する前に受信されるまで待つことは許されないことに注意してください。しかし、これは望ましくない待ち時間の効果を有することができます。"
    },
    {
      "indent": 0,
      "text": "4.2. Generating the Initial Offer",
      "section_title": true,
      "ja": "4.2。最初のオファーを生成します"
    },
    {
      "indent": 3,
      "text": "The offerer SHOULD assign the SDP \"setup\" attribute with a value of \"actpass\", unless the offerer insists on being either the sender or receiver of the DTLS ClientHello message, in which case the offerer can use either a value of \"active\" (the offerer will be the sender of ClientHello) or \"passive\" (the offerer will be the receiver of ClientHello). The offerer MUST NOT assign an SDP \"setup\" attribute with a \"holdconn\" value.",
      "ja": "オファーは、その場合に申出が「アクティブ」の値のいずれかを使用することができ、送信者またはDTLS ClientHelloメッセージの受信機のいずれかであることを主張しない限り、提供者は（「actpass」の値とSDP「セットアップ」属性を割り当てる必要があります提供者はのClientHelloの送信者）または「受動的」（申出のClientHelloの受信機になる）であろう。オファー側は「holdconn」値とSDP「セットアップ」属性を割り当ててはなりません。"
    },
    {
      "indent": 3,
      "text": "If the offerer assigns the SDP \"setup\" attribute with a value of \"actpass\" or \"passive\", the offerer MUST be prepared to receive a DTLS ClientHello message before it receives the SDP answer.",
      "ja": "オファー側は「actpass」または「受動的」の値を持つSDP「セットアップ」属性を割り当てた場合、それはSDPアンサーを受信する前に、オファー側は、DTLS ClientHelloメッセージを受信するために準備しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3. Generating the Answer",
      "section_title": true,
      "ja": "4.3。回答の生成"
    },
    {
      "indent": 3,
      "text": "If the answerer accepts the offered UDPTL-over-DTLS transport connection, in the associated SDP answer, the answerer MUST assign an SDP \"setup\" attribute with a value of either \"active\" or \"passive\", according to the procedures in [RFC4145]. The answerer MUST NOT assign an SDP \"setup\" attribute with a value of \"holdconn\".",
      "ja": "回答が提供UDPTLオーバーDTLSトランスポート接続を受け入れる場合、関連するSDP回答に、回答は[RFC4145の手順に従って、「能動的」又は「受動的」のいずれかの値とSDP「セットアップ」属性を割り当てる必要があります]。回答は「holdconn」の値とSDP「セットアップ」属性を割り当ててはなりません。"
    },
    {
      "indent": 3,
      "text": "If the answerer assigns an SDP \"setup\" attribute with a value of \"active\" value, the answerer MUST initiate a DTLS handshake by sending a DTLS ClientHello message on the negotiated media stream, towards the IP address and port of the offerer.",
      "ja": "回答は「アクティブ」値の値を持つSDP「セットアップ」属性を割り当てた場合、回答は、オファー側のIPアドレスとポートに向けて、ネゴシエートされたメディアストリームにDTLS ClientHelloメッセージを送信することにより、DTLSハンドシェークを開始しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.4. Offerer Processing of the Answer",
      "section_title": true,
      "ja": "4.4。回答のオファー側処理"
    },
    {
      "indent": 3,
      "text": "When the offerer receives an SDP answer, if the offerer ends up being active it MUST initiate a DTLS handshake by sending a DTLS ClientHello message on the negotiated media stream, towards the IP address and port of the answerer.",
      "ja": "オファーはSDPアンサーを受信すると申出がアクティブなってしまう場合には、回答者のIPアドレスとポートに向かって、ネゴシエートされたメディアストリームにDTLS ClientHelloメッセージを送信することによってDTLSハンドシェイクを開始しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.5. Modifying the Session",
      "section_title": true,
      "ja": "4.5。セッションの変更"
    },
    {
      "indent": 3,
      "text": "Once an offer/answer exchange has been completed, either endpoint MAY send a new offer in order to modify the session. The endpoints can reuse the existing DTLS association if the key fingerprint values and transport parameters indicated by each endpoint are unchanged. Otherwise, following the rules for the initial offer/answer exchange, the endpoints can negotiate and create a new DTLS association and, once created, delete the previous DTLS association, following the same rules for the initial offer/answer exchange. Each endpoint needs to be prepared to receive data on both the new and old DTLS associations as long as both are alive.",
      "ja": "オファー/アンサー交換が完了すると、いずれかのエンドポイントは、セッションを変更するために新しいプランを送信することができます。各エンドポイントによって示されるキー指紋値とトランスポートパラメータが変更されていない場合、エンドポイントは、既存のDTLSアソシエーションを再利用することができます。それ以外の場合は、最初のオファー/アンサー交換のルールを以下の、エンドポイントは、最初のオファー/アンサー交換のための同じ規則に従って、交渉し、新しいDTLSの関連付けを作成して、一度作成した、以前のDTLSの関連付けを削除することができます。各エンドポイントは、限り、両方が生きているよう新旧両方のDTLS団体でデータを受信するために準備する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Miscellaneous Considerations",
      "section_title": true,
      "ja": "5.その他の注意事項"
    },
    {
      "indent": 0,
      "text": "5.1. Anonymous Calls",
      "section_title": true,
      "ja": "5.1。匿名コール"
    },
    {
      "indent": 3,
      "text": "When making anonymous calls, a new self-signed certificate SHOULD be used for each call, and attributes inside the certificate MUST NOT contain information that allows either correlation or identification of the user making anonymous calls. This is particularly important for the \"subjectAltName\" and \"commonName\" attributes.",
      "ja": "匿名の呼び出しを行うと、新しい自己署名証明書は、各コールのために使用されるべきであり、証明書内の属性は、相関や利用者の識別のいずれかが匿名の呼び出しを行うことができます情報を含めることはできません。これは、「のsubjectAltName」と「commonNameの」属性のために特に重要です。"
    },
    {
      "indent": 0,
      "text": "5.2. NAT Traversal",
      "section_title": true,
      "ja": "5.2。 NATトラバーサル"
    },
    {
      "indent": 0,
      "text": "5.2.1. ICE Usage",
      "section_title": true,
      "ja": "5.2.1。 ICEの使用"
    },
    {
      "indent": 3,
      "text": "When Interactive Connectivity Establishment (ICE) [RFC5245] is being used, the ICE connectivity checks are performed before the DTLS handshake begins. Note that if aggressive nomination mode is used, multiple candidate pairs may be marked valid before ICE finally converges on a single candidate pair. User Agents (UAs) MUST treat all ICE candidate pairs associated with a single component as part of the same DTLS association. Thus, there will be only one DTLS handshake even if there are multiple valid candidate pairs. Note that this may mean adjusting the endpoint IP addresses if the selected candidate pair shifts, just as if the DTLS packets were an ordinary media stream. In the case of an ICE restart, the DTLS handshake procedure is repeated, and a new DTLS association is created. Once the DTLS handshake is completed and the new DTLS association has been created, the previous DTLS association is deleted.",
      "ja": "インタラクティブ接続確立（ICE）[RFC5245]を使用している場合DTLSハンドシェークが開始される前に、ICE接続性チェックが行われます。アグレッシブ指名モードが使用されている場合ICEが最終的に単一の候補ペアに収束する前に、複数の候補ペアが有効とマークすることができることに注意してください。ユーザエージェント（UAは）同じDTLSアソシエーションの一部として、単一の構成要素に関連付けられたすべてのICE候補ペアを扱わなければなりません。このように、複数の有効な候補対がある場合でも、一つだけDTLS握手が存在します。 DTLSパケットは通常のメディアストリームであるかのように、これは選択された候補ペアシフト場合、エンドポイントのIPアドレスを調整する意味するかもしれないことに注意してください。 ICEの再起動の場合は、DTLSハンドシェイク手順が繰り返され、そして新しいDTLSの関連付けが作成されます。 DTLSハンドシェイクが完了し、新しいDTLSアソシエーションが作成されたら、以前のDTLSの関連付けが削除されます。"
    },
    {
      "indent": 0,
      "text": "5.2.2. STUN Interaction",
      "section_title": true,
      "ja": "5.2.2。 STUNインタラクション"
    },
    {
      "indent": 3,
      "text": "The UA MUST send the Session Traversal Utilities for NAT (STUN) packets [RFC5389] directly over UDP, not over DTLS.",
      "ja": "UAはないDTLSの上に、直接、UDP上NAT（STUN）パケット[RFC5389]のためのセッショントラバーサルユーティリティを送らなければなりません。"
    },
    {
      "indent": 3,
      "text": "The UA MUST support the following mechanism for demultiplexing packets arriving on the IP address and port associated with the DTLS association:",
      "ja": "UAは、DTLSアソシエーションに関連付けられたIPアドレスとポートに着信分離するパケットのために、以下のメカニズムをサポートしなければなりません："
    },
    {
      "indent": 3,
      "text": "o If the value of the first byte of the packet is 0 or 1, then the packet is STUN.",
      "ja": "パケットの最初のバイトの値が0または1の場合、O、次いで、パケットがSTUNあります。"
    },
    {
      "indent": 3,
      "text": "o If the value of the first byte of the packet is between 20 and 63 (inclusive), the packet is DTLS.",
      "ja": "パケットの最初のバイトの値（両端を含む）20と63の間にある場合、O、パケットはDTLSあります。"
    },
    {
      "indent": 0,
      "text": "5.3. Rekeying",
      "section_title": true,
      "ja": "5.3。鍵の変更"
    },
    {
      "indent": 3,
      "text": "During rekeying, packets protected by the previous set of keys can arrive after the DTLS handshake caused by rekeying has completed, because packets can be reordered on the wire. To compensate for this fact, receivers MUST maintain both sets of keys for some time in order to be able to decrypt and verify older packets. The duration of maintaining the previous set of keys after the finish of the DTLS handshake is out of the scope of this document.",
      "ja": "リキーによって引き起こさハンドシェークDTLSが完了した後にパケットがワイヤー上に並べ替えることができるので、鍵の再設定時、キーの前のセットによって保護されたパケットは、到達することができます。この事実を補うために、受信機は、古いパケットを復号化し、検証することができるようにするためにいくつかの時間のためのキーの両方のセットを維持しなければなりません。 DTLSハンドシェークの終了後に、キーの前のセットを維持する期間は、この文書の範囲外です。"
    },
    {
      "indent": 0,
      "text": "5.4. Compatibility with UDPTL over UDP",
      "section_title": true,
      "ja": "5.4。 UDP上UDPTLとの互換性"
    },
    {
      "indent": 3,
      "text": "If a user requires fax to be transported securely using UDPTL over DTLS, and if the remote user does not support UDPTL over DTLS, then a fax media stream cannot be established.",
      "ja": "ユーザーがファックスを必要とする場合はDTLS上UDPTLを使用して安全に輸送されると、リモートユーザーがDTLS上UDPTLをサポートしていない場合は、ファックスメディアストリームを確立することはできません。"
    },
    {
      "indent": 3,
      "text": "If a user prefers fax to be transported securely using UDPTL over DTLS but is willing to transport the fax insecurely in case the remote user does not support UDPTL over DTLS, then the SDP Capability Negotiation mechanism [RFC5939] can be used to offer both UDPTL over DTLS and UDPTL over UDP. Alternatively, if the remote user rejects an SDP offer for UDPTL over DTLS, a new SDP offer for a UDPTL-over-UDP media stream can be sent.",
      "ja": "ユーザがファックスがDTLS上UDPTLを用いて確実に搬送することを好むが、リモートユーザがDTLS上UDPTLをサポートしていない場合には安全でないファックスを輸送する意思がある場合、SDP機能ネゴシエーションメカニズム[RFC5939]は上の両方UDPTLを提供するために使用することができますUDPの上にDTLSとUDPTL。また、リモートユーザーは、DTLS、UDPTLオーバーUDPのメディアストリームを送信することができるため、新たなSDPのオファーを超えるUDPTLのためのSDPのオファーを拒否した場合。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Fax may be used to transmit a wide range of sensitive data, including personal, corporate, and governmental information. It is therefore critical to be able to protect against threats to the confidentiality and integrity of the transmitted data.",
      "ja": "ファックスは、個人、企業、および政府の情報を含む機密データの広い範囲を、送信するために使用されてもよいです。送信されたデータの機密性と完全性への脅威から保護できることが重要です。"
    },
    {
      "indent": 3,
      "text": "The mechanism in this document provides integrity and confidentiality protection for fax by specifying fax transport using UDPTL over DTLS [RFC6347].",
      "ja": "この文書に記載されているメカニズムは、DTLS [RFC6347]の上にUDPTLを使用してFAXトランスポートを指定することにより、ファックスのための完全性と機密性の保護を提供します。"
    },
    {
      "indent": 3,
      "text": "DTLS media stream negotiated using SIP/SDP requires a mechanism to ensure that the certificate received via DTLS was issued by the remote party of the SIP session.",
      "ja": "DTLSのメディアストリームは、SIP / SDPを使用して交渉した証明書は、DTLSがSIPセッションの相手によって発行されたを介して受信されたことを保証するメカニズムが必要です。"
    },
    {
      "indent": 3,
      "text": "The standard DTLS strategy for authenticating the communicating parties is to give the server (and optionally the client) a PKIX [RFC5280] certificate. The client then verifies the certificate and checks that the name in the certificate matches the server's domain name. This works because there are a relatively small number of servers and the cost for issuing and deploying PKIX certificates can be justified. Issuing and deploying PKIX certificates to all clients is not realistic in most deployment scenarios.",
      "ja": "通信当事者を認証するための標準的なDTLS戦略はPKIX [RFC5280]証明書をサーバに与える（およびクライアントを任意に）することです。クライアントは、証明書を検証し、証明書の名前は、サーバーのドメイン名と一致していることを確認します。そこのサーバーの比較的少数であるとPKIX証明書を発行し、展開するためのコストを正当化することができるので、これは動作します。すべてのクライアントにPKIX証明書を発行し、展開することは、ほとんどの展開シナリオでは現実的ではありません。"
    },
    {
      "indent": 3,
      "text": "The design described in this document is intended to leverage the integrity protection of the SIP signaling, while not requiring confidentiality. As long as each side of the connection can verify the integrity of the SDP received from the other side, then the DTLS handshake cannot be hijacked via a man-in-the-middle attack. This integrity protection is easily provided by the caller to the callee via the SIP Identity [RFC4474] mechanism. Other mechanisms, such as the S/MIME mechanism [RFC3261] or perhaps future mechanisms yet to be specified, could also serve this purpose.",
      "ja": "この文書で説明した設計は、機密性を必要としない一方で、SIPシグナリングの完全性保護を活用することを意図しています。 SDPの整合性を検証することができる接続のそれぞれの側が他方の側から受信する限り、その後DTLSハンドシェイクは、man-in-the-middle攻撃を介して、ハイジャックすることができません。この完全性保護を簡単にSIPアイデンティティ[RFC4474]メカニズムを介して呼び出し先への呼び出し側によって提供されます。このようなS / MIME機構[RFC3261]などの他の機構、またはまだ指定する、おそらく将来のメカニズムは、この目的を果たすことができました。"
    },
    {
      "indent": 3,
      "text": "While this mechanism can still be used without such integrity mechanisms, the security provided is limited to defense against passive attack by intermediaries. An active attack on the signaling plus an active attack on the media plane can allow an attacker to attack the connection (R-SIG-MEDIA in the notation of [RFC5479]).",
      "ja": "このメカニズムは、まだ、このような整合性メカニズムなしで使用することができますが、提供されるセキュリティを仲介することにより、受動的攻撃に対する防御に限定されています。シグナリングプラスメディアプレーン上のアクティブな攻撃に活性な攻撃は、攻撃者が接続（[RFC5479]の表記でR-SIG-MEDIA）を攻撃することを可能にすることができます。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document updates the \"Session Description Protocol (SDP) Parameters\" registry as specified in Section 8.2.2 of [RFC4566]. Specifically, the values in Table 1 have been added to the SDP \"proto\" field registry.",
      "ja": "[RFC4566]のセクション8.2.2で指定されたこの文書は、「セッション記述プロトコル（SDP）パラメータ」レジストリを更新します。具体的には、表1の値はSDP「プロト」フィールドレジストリに追加されています。"
    },
    {
      "indent": 19,
      "text": "+-------+---------------+-----------+\n|  Type |    SDP Name   | Reference |\n+-------+---------------+-----------+\n| proto | UDP/TLS/UDPTL | [RFC7345] |\n+-------+---------------+-----------+",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Table 1: SDP \"proto\" Field Values",
      "ja": "表1：SDP「プロト」フィールド値"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgments",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "Special thanks to Peter Dawes, who provided comments on the initial draft version of the document, and to Paul E. Jones, James Rafferty, Albrecht Schwarz, Oscar Ohlsson, David Hanes, Adam Gensler, Ari Keranen, Flemming Andreasen, John Mattsson, and Marc Petit-Huguenin, who provided valuable feedback and input. Barry Leiba, Spencer Dawkins, Pete Resnick, Kathleen Moriarty, and Stephen Farrell provided valuable feedback during the IESG review. Thanks to Scott Brim for performing the Gen-ART review. Thanks to Alissa Cooper for her help as sponsoring Area Director.",
      "ja": "文書の最初のドラフト版にコメントを提供ピーター・ドーズ、へ、そしてポール・E.ジョーンズ、ジェームズ・ラファティ、アルブレヒト・シュワルツ、オスカーOhlsson、デビッド・ヘインズ、アダム・ゲンスラー、アリKeranen、フレミングAndreasenの、ジョン・マットソンに感謝し、貴重なフィードバックや入力を提供マルク・プティ・Huguenin、。バリー・レイバ、スペンサードーキンス、ピート・レズニック、キャスリーン・モリアーティ、そしてスティーブン・ファレルは、IESGレビューの間、貴重なフィードバックを提供しました。ジェン・ARTの見直しを実施するためのスコット・つばに感謝します。エリアディレクターのスポンサーとして彼女の助けのためのアリッサ・クーパーに感謝します。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[ITU.T30.2005] International Telecommunications Union, \"Procedures for document facsimile transmission in the general switched telephone network\", ITU-T Recommendation T.30, September 2005.",
      "ja": "[ITU.T30.2005]国際電気通信連合は、2005年9月、ITU-T勧告T.30「一般的に、文書ファクシミリ送信のための手順は、交換電話網」。"
    },
    {
      "indent": 3,
      "text": "[ITU.T38.2010] International Telecommunications Union, \"Procedures for real-time Group 3 facsimile communication over IP networks\", ITU-T Recommendation T.38, September 2010.",
      "ja": "[ITU.T38.2010]国際電気通信連合、ITU-T勧告T.38、2010年9月 \"IPネットワーク上のリアルタイムグループ3ファクシミリ通信のための手順\"。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, June 2002.",
      "ja": "[RFC3261]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\" 、RFC 3261、2002年6月。"
    },
    {
      "indent": 3,
      "text": "[RFC3264] Rosenberg, J. and H. Schulzrinne, \"An Offer/Answer Model with Session Description Protocol (SDP)\", RFC 3264, June 2002.",
      "ja": "[RFC3264]ローゼンバーグ、J.とH. Schulzrinneと、RFC 3264、2002年6月 \"セッション記述プロトコル（SDP）とのオファー/アンサーモデル\"。"
    },
    {
      "indent": 3,
      "text": "[RFC4145] Yon, D. and G. Camarillo, \"TCP-Based Media Transport in the Session Description Protocol (SDP)\", RFC 4145, September 2005.",
      "ja": "[RFC4145]ヨン、D.とG.カマリロ、 \"TCPベースのセッション記述プロトコル（SDP）にメディアトランスポート\"、RFC 4145、2005年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4474] Peterson, J. and C. Jennings, \"Enhancements for Authenticated Identity Management in the Session Initiation Protocol (SIP)\", RFC 4474, August 2006.",
      "ja": "[RFC4474]ピーターソン、J.とC.ジェニングス、RFC 4474 \"セッション開始プロトコル（SIP）で認証されたアイデンティティ管理のための機能強化\"、2006年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC4566] Handley, M., Jacobson, V., and C. Perkins, \"SDP: Session Description Protocol\", RFC 4566, July 2006.",
      "ja": "[RFC4566]ハンドリー、M.、ヤコブソン、V.、およびC.パーキンス、 \"SDP：セッション記述プロトコル\"、RFC 4566、2006年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC4572] Lennox, J., \"Connection-Oriented Media Transport over the Transport Layer Security (TLS) Protocol in the Session Description Protocol (SDP)\", RFC 4572, July 2006.",
      "ja": "[RFC4572]レノックス、J.、 \"接続指向のセッション記述プロトコル（SDP）でTransport Layer Security（TLS）プロトコルを介してメディアトランスポート\"、RFC 4572、2006年7月。"
    },
    {
      "indent": 3,
      "text": "[RFC5245] Rosenberg, J., \"Interactive Connectivity Establishment (ICE): A Protocol for Network Address Translator (NAT) Traversal for Offer/Answer Protocols\", RFC 5245, April 2010.",
      "ja": "[RFC5245]ローゼンバーグ、J.、 \"インタラクティブ接続確立（ICE）：オファー/回答プロトコルのためのネットワークアドレス変換（NAT）トラバーサルのための議定書\"、RFC 5245、2010年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, May 2008.",
      "ja": "[RFC5280]クーパー、D.、Santesson、S.、ファレル、S.、Boeyen、S.、Housley氏、R.、およびW.ポーク、「インターネットX.509公開鍵暗号基盤証明書と証明書失効リスト（CRL）のプロフィール」、RFC 5280、2008年5月。"
    },
    {
      "indent": 3,
      "text": "[RFC5389] Rosenberg, J., Mahy, R., Matthews, P., and D. Wing, \"Session Traversal Utilities for NAT (STUN)\", RFC 5389, October 2008.",
      "ja": "[RFC5389]ローゼンバーグ、J.、マーイ、R.、マシューズ、P.、およびD.翼、 \"NAT（STUN）のセッショントラバーサルユーティリティ\"、RFC 5389、2008年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC6347] Rescorla, E. and N. Modadugu, \"Datagram Transport Layer Security Version 1.2\", RFC 6347, January 2012.",
      "ja": "[RFC6347]レスコラ、E.およびN. Modadugu、 \"データグラムトランスポート層セキュリティバージョン1.2\"、RFC 6347、2012年1月。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC5246] Dierks, T. and E. Rescorla, \"The Transport Layer Security (TLS) Protocol Version 1.2\", RFC 5246, August 2008.",
      "ja": "[RFC5246]ダークス、T.およびE.レスコラ、 \"トランスポート層セキュリティ（TLS）プロトコルバージョン1.2\"、RFC 5246、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5479] Wing, D., Fries, S., Tschofenig, H., and F. Audet, \"Requirements and Analysis of Media Security Management Protocols\", RFC 5479, April 2009.",
      "ja": "[RFC5479]ウイング、D.、フライドポテト、S.、Tschofenig、H.、およびF. Audet、 \"要件とメディアセキュリティ管理プロトコルの分析\"、RFC 5479、2009年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC5939] Andreasen, F., \"Session Description Protocol (SDP) Capability Negotiation\", RFC 5939, September 2010.",
      "ja": "[RFC5939]とAndreasen、F.、 \"セッション記述プロトコル（SDP）能力ネゴシエーション\"、RFC 5939、2010年9月。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Examples",
      "ja": "付録A.例"
    },
    {
      "indent": 0,
      "text": "A.1. General",
      "ja": "A.1。一般的な"
    },
    {
      "indent": 3,
      "text": "Prior to establishing the session, both Alice and Bob generate self-signed certificates that are used for a single session or, more likely, reused for multiple sessions.",
      "ja": "セッションを確立する前は、アリスとボブの両方が複数のセッションのために再利用する単一のセッションや、より多くの可能性が高いために使用されている自己署名証明書を生成します。"
    },
    {
      "indent": 3,
      "text": "The SIP signaling from Alice to her proxy is transported over TLS to ensure an integrity-protected channel between Alice and her identity service. Alice's identity service asserts identity of Alice and protects the SIP message, e.g., using SIP Identity. Transport between proxies should also be protected, e.g., by use of TLS.",
      "ja": "彼女のプロキシにアリスからのSIPシグナリングは、アリスと彼女のアイデンティティサービスとの間の整合性が保護チャネルを確保するために、TLS上で転送されます。アリスのアイデンティティサービスは、SIPアイデンティティを使用して、例えば、アリスのアイデンティティを主張すると、SIPメッセージを保護します。プロキシとの間の輸送はまた、TLSを使用することにより、例えば、保護されるべきです。"
    },
    {
      "indent": 3,
      "text": "In order to simplify the flow, only one element is shown for Alice's and Bob's proxies.",
      "ja": "流れを簡単にするために、唯一の要素は、アリスとボブのプロキシのために示されています。"
    },
    {
      "indent": 3,
      "text": "For the sake of brevity and simplicity, only the mandatory SDP T.38 attributes are shown.",
      "ja": "簡潔かつ簡単のため、唯一の必須SDP T.38属性が示されています。"
    },
    {
      "indent": 0,
      "text": "A.2. Basic Message Flow",
      "ja": "A.2。基本的なメッセージフロー"
    },
    {
      "indent": 3,
      "text": "Figure 3 shows an example message flow of session establishment for T.38 fax securely transported using UDPTL over DTLS.",
      "ja": "図3は、確実DTLS上UDPTLを用いて搬送T.38ファックスのためのセッション確立の例示的メッセージフローを示します。"
    },
    {
      "indent": 3,
      "text": "In this example flow, Alice acts as the passive endpoint of the DTLS association, and Bob acts as the active endpoint of the DTLS association.",
      "ja": "この例のフローでは、アリスはDTLSアソシエーションの受動的エンドポイントとして機能し、ボブはDTLSアソシエーションのアクティブエンドポイントとして機能します。"
    },
    {
      "indent": 9,
      "text": "Alice                    Proxies                   Bob\n  | (1) SIP INVITE         |                        |\n  |----------------------->|                        |\n  |                        | (2) SIP INVITE         |\n  |                        |----------------------->|\n  |                        |   (3) DTLS ClientHello |\n  |<------------------------------------------------|\n  |    (4) remaining messages of DTLS handshake     |\n  |<----------------------------------------------->|\n  |                        |                        |\n  |                        |                        |\n  |                        |         (5) SIP 200 OK |\n  |                        |<-----------------------|\n  |         (6) SIP 200 OK |                        |\n  |<-----------------------|                        |\n  | (7) SIP ACK            |                        |\n  |------------------------------------------------>|\n  |      (8) T.38 message using UDPTL over DTLS     |\n  |<----------------------------------------------->|\n  |                        |                        |",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Figure 3: Basic Message Flow",
      "ja": "図3：基本的なメッセージフロー"
    },
    {
      "indent": 3,
      "text": "Message (1):",
      "ja": "メッセージ（1）："
    },
    {
      "indent": 6,
      "text": "Figure 4 shows the initial INVITE request sent by Alice to Alice's proxy. The initial INVITE request contains an SDP offer.",
      "ja": "図4は、アリスのプロキシにアリスによって送られた最初のINVITEリクエストを示しています。最初の要求はSDPのオファーが含まれてINVITE。"
    },
    {
      "indent": 6,
      "text": "The \"m=\" line in the SDP offer indicates T.38 fax using UDPTL over DTLS.",
      "ja": "SDPオファー内の「M =」行がDTLS上UDPTLを用いてT.38ファックスを示しています。"
    },
    {
      "indent": 6,
      "text": "The SDP \"setup\" attribute with a value of \"actpass\" in the SDP offer indicates that Alice has requested to be either the active or passive endpoint.",
      "ja": "SDPオファーで「actpass」の値を持つSDP「セットアップ」属性は、アリスがアクティブまたはパッシブエンドポイントであることを要求したことを示しています。"
    },
    {
      "indent": 6,
      "text": "The SDP \"fingerprint\" attribute in the SDP offer contains the certificate fingerprint computed from Alice's self-signed certificate.",
      "ja": "SDPオファーにおけるSDP「指紋」属性は、アリスの自己署名証明書から計算された証明書のフィンガープリントが含まれています。"
    },
    {
      "indent": 3,
      "text": "INVITE sip:bob@example.com SIP/2.0 To: <sip:bob@example.com> From: \"Alice\"<sip:alice@example.com>;tag=843c7b0b Via: SIP/2.0/TLS ua1.example.com;branch=z9hG4bK-0e53sadfkasldkfj Contact: <sip:alice@ua1.example.com> Call-ID: 6076913b1c39c212@REVMTEpG CSeq: 1 INVITE Allow: INVITE, ACK, CANCEL, OPTIONS, BYE, UPDATE Max-Forwards: 70 Content-Type: application/sdp Content-Length: xxxx Supported: from-change",
      "ja": "<bob@example.com SIP：>： \"アリス\" をbob@example.com SIP / 2.0：SIPのINVITE <SIP：alice@example.com>;タグ= 843c7b0bのVia：SIP / 2.0 / TLS ua1.example .COM;ブランチ= z9hG4bK-0e53sadfkasldkfj連絡先：<SIP：alice@ua1.example.com>は、コールIDを：REVMTEpGのCSeq @ 6076913b1c39c212：UPDATEマックス転送し、BYE、INVITE、ACK、CANCEL、OPTIONS：70許可INVITE 1コンテンツタイプ：アプリケーション/ SDPのContent-Length：サポートされているXXXX：から変更"
    },
    {
      "indent": 3,
      "text": "v=0 o=- 1181923068 1181923196 IN IP4 ua1.example.com s=- c=IN IP4 ua1.example.com t=0 0 m=image 6056 UDP/TLS/UDPTL t38 a=setup:actpass a=fingerprint: SHA-1 \\ 4A:AD:B9:B1:3F:82:18:3B:54:02:12:DF:3E:5D:49:6B:19:E5:7C:AB a=T38FaxRateManagement:transferredTCF",
      "ja": "V = 0 0 =  -  1181923068 1181923196 IN IP4 ua1.example.com S =  -  C = IN IP4 ua1.example.com T = 0、M =画像6056 UDP / TLS / UDPTLのT38のA =設定：=指紋actpass。 SHA-1 \\ 4A：AD：B9：B1：3F：82：18：3B：54：02：12：DF：3E：5D：49：6B：19：E5：7C：ABのA = T38FaxRateManagement：transferredTCF"
    },
    {
      "indent": 27,
      "text": "Figure 4: Message (1)",
      "ja": "図4：メッセージ（1）"
    },
    {
      "indent": 3,
      "text": "Message (2):",
      "ja": "メッセージ（2）："
    },
    {
      "indent": 6,
      "text": "Figure 5 shows the SIP INVITE request sent by Bob's proxy to Bob.",
      "ja": "図5は、ボブに、ボブのプロキシによって送信されたSIP INVITEリクエストを示しています。"
    },
    {
      "indent": 6,
      "text": "When received, Bob verifies the identity provided in the SIP INVITE request.",
      "ja": "受信すると、ボブは、SIP INVITEリクエストで提供身元を確認します。"
    },
    {
      "indent": 3,
      "text": "INVITE sip:bob@ua2.example.com SIP/2.0 To: <sip:bob@example.com> From: \"Alice\"<sip:alice@example.com>;tag=843c7b0b Via: SIP/2.0/TLS proxy.example.com;branch=z9hG4bK-0e53sadfkasldk Via: SIP/2.0/TLS ua1.example.com;branch=z9hG4bK-0e53sadfkasldkfj Record-Route: <sip:proxy.example.com;lr> Contact: <sip:alice@ua1.example.com> Call-ID: 6076913b1c39c212@REVMTEpG CSeq: 1 INVITE Allow: INVITE, ACK, CANCEL, OPTIONS, BYE, UPDATE Max-Forwards: 69 Content-Type: application/sdp Content-Length: xxxx Supported: from-change",
      "ja": "SIP INVITE：bob@ua2.example.comをSIP / 2.0 <SIP：bob@example.com>から： \"アリス\" <SIP：alice@example.com>;タグ= 843c7b0bのVia：SIP / 2.0 / TLSプロキシ.example.comと、ブランチ= z9hG4bK-0e53sadfkasldk経由：SIP / 2.0 / TLS ua1.example.com;ブランチ= z9hG4bK-0e53sadfkasldkfj録音-ルート：<SIP：proxy.example.com; LR>連絡先：<SIP：アリス@ ua1.example.com>コール-IDを：REVMTEpGのCSeq @ 6076913b1c39c212：UPDATEマックス転送し、BYE、、、ACKをINVITE、CANCEL、OPTIONS：69のContent-Type：アプリケーション/ SDPのContent-Length：許可INVITE 1サポートXXXX：から-変化する"
    },
    {
      "indent": 3,
      "text": "v=0 o=- 1181923068 1181923196 IN IP4 ua1.example.com s=- c=IN IP4 ua1.example.com t=0 0 m=image 6056 UDP/TLS/UDPTL t38 a=setup:actpass a=fingerprint: SHA-1 \\ 4A:AD:B9:B1:3F:82:18:3B:54:02:12:DF:3E:5D:49:6B:19:E5:7C:AB a=T38FaxRateManagement:transferredTCF",
      "ja": "V = 0 0 =  -  1181923068 1181923196 IN IP4 ua1.example.com S =  -  C = IN IP4 ua1.example.com T = 0、M =画像6056 UDP / TLS / UDPTLのT38のA =設定：=指紋actpass。 SHA-1 \\ 4A：AD：B9：B1：3F：82：18：3B：54：02：12：DF：3E：5D：49：6B：19：E5：7C：ABのA = T38FaxRateManagement：transferredTCF"
    },
    {
      "indent": 27,
      "text": "Figure 5: Message (2)",
      "ja": "図5：メッセージ（2）"
    },
    {
      "indent": 3,
      "text": "Message (3):",
      "ja": "メッセージ（3）："
    },
    {
      "indent": 6,
      "text": "Assuming that Alice's identity is valid, Bob sends a DTLS ClientHello directly to Alice.",
      "ja": "アリスのアイデンティティが有効であると仮定すると、ボブはアリスに直接DTLSのClientHelloを送信します。"
    },
    {
      "indent": 3,
      "text": "Message (4):",
      "ja": "メッセージ（4）："
    },
    {
      "indent": 6,
      "text": "Alice and Bob exchange further messages of DTLS handshake (HelloVerifyRequest, ClientHello, ServerHello, Certificate, ServerKeyExchange, CertificateRequest, ServerHelloDone, Certificate, ClientKeyExchange, CertificateVerify, ChangeCipherSpec, and Finished).",
      "ja": "DTLSハンドシェークのアリスとボブ交換さらなるメッセージ（HelloVerifyRequest、のClientHello、のServerHello、証明書、ServerKeyExchange、CertificateRequest、ServerHelloDone、証明書、ClientKeyExchange、CertificateVerify、ChangeCipherSpecを、完成しました）。"
    },
    {
      "indent": 6,
      "text": "When Bob receives the certificate of Alice via DTLS, Bob checks whether the certificate fingerprint calculated from Alice's certificate received via DTLS matches the certificate fingerprint received in the a=fingerprint SDP attribute of Figure 5. In this message flow, the check is successful; thus, session setup continues.",
      "ja": "ボブはDTLSを介してアリスの証明書を受信すると、ボブは、アリスの証明書から計算した証明書のフィンガープリントがDTLSを介して受信し、チェックが成功したこのメッセージフローは図5のA =指紋SDP属性に受信した証明書のフィンガープリントで一致するか否かをチェックします。このように、セッションのセットアップが続行されます。"
    },
    {
      "indent": 6,
      "text": "Note that, unlike in this example, it is not necessary to wait for the DTLS handshake to finish before the SDP answer is sent. If Bob has sent the SIP 200 (OK) response and later detects that the certificate fingerprints do not match, he will terminate the session.",
      "ja": "この例とは異なり、SDP応答が送信される前に終了するDTLS握手を待つ必要がない、ということに注意してください。ボブは、SIP 200（OK）応答を送信し、後に証明書のフィンガープリントが一致しないことを検出した場合、彼はセッションを終了します。"
    },
    {
      "indent": 3,
      "text": "Message (5):",
      "ja": "メッセージ（5）："
    },
    {
      "indent": 6,
      "text": "Figure 6 shows a SIP 200 (OK) response to the initial SIP INVITE request, sent by Bob to Bob's proxy. The SIP 200 (OK) response contains an SDP answer.",
      "ja": "図6は、ボブのプロキシにボブによって送信された最初のSIP INVITE要求へのSIP 200（OK）応答を示します。 SIP 200（OK）応答はSDPの回答が含まれています。"
    },
    {
      "indent": 6,
      "text": "The \"m=\" line in the SDP answer indicates T.38 fax using UDPTL over DTLS.",
      "ja": "SDPアンサー内の「M =」行がDTLS上UDPTLを用いてT.38ファックスを示しています。"
    },
    {
      "indent": 6,
      "text": "The SDP \"setup\" attribute with a value of \"active\" in the SDP answer indicates that Bob has requested to be the active endpoint.",
      "ja": "SDPアンサーで「アクティブ」の値を持つSDP「セットアップ」属性は、ボブは、アクティブエンドポイントであることを要求したことを示しています。"
    },
    {
      "indent": 6,
      "text": "The SDP \"fingerprint\" attribute in the SDP answer contains the certificate fingerprint computed from Bob's self-signed certificate.",
      "ja": "SDPアンサーにおけるSDP「指紋」属性は、ボブの自己署名証明書から計算された証明書のフィンガープリントが含まれています。"
    },
    {
      "indent": 3,
      "text": "SIP/2.0 200 OK To: <sip:bob@example.com>;tag=6418913922105372816 From: \"Alice\" <sip:alice@example.com>;tag=843c7b0b Via: SIP/2.0/TLS proxy.example.com:5061;branch=z9hG4bK-0e53sadfkasldk Via: SIP/2.0/TLS ua1.example.com;branch=z9hG4bK-0e53sadfkasldkfj Record-Route: <sip:proxy.example.com;lr> Call-ID: 6076913b1c39c212@REVMTEpG CSeq: 1 INVITE Contact: <sip:bob@ua2.example.com> Content-Type: application/sdp Content-Length: xxxx Supported: from-change",
      "ja": "SIP / 2.0 200 OKに<SIP：bob@example.com>;からタグ= 6418913922105372816： \"アリス\" <SIP：alice@example.com>;タグ= 843c7b0bのVia：SIP / 2.0 / TLS proxy.example.com ：; 5061経由ブランチ= z9hG4bK-0e53sadfkasldk：SIP / 2.0 / TLS ua1.example.com;ブランチ= z9hG4bK-0e53sadfkasldkfj録音-ルート：<SIP：proxy.example.com; LR>コールID：6076913b1c39c212 REVMTEpGのCSeq @： <一口：bob@ua2.example.com>のContent-Type：アプリケーション/ SDPのContent-Length：1連絡先をINVITEサポートXXXX：から変更"
    },
    {
      "indent": 3,
      "text": "v=0 o=- 8965454521 2105372818 IN IP4 ua2.example.com s=- c=IN IP4 ua2.example.com t=0 0 m=image 12000 UDP/TLS/UDPTL t38 a=setup:active a=fingerprint: SHA-1 \\ FF:FF:FF:B1:3F:82:18:3B:54:02:12:DF:3E:5D:49:6B:19:E5:7C:AB a=T38FaxRateManagement:transferredTCF",
      "ja": "V = 0 0 =  -  8965454521 2105372818 IN IP4 ua2.example.com S =  -  C = IN IP4 ua2.example.com T = 0、M =画像12000 UDP / TLS / UDPTLのT38のA =セットアップ：アクティブA =指紋： SHA-1 \\ FF：FF：FF：B1：3F：82：18：3B：54：02：12：DF：3E：5D：49：6B：19：E5：7C：ABのA = T38FaxRateManagement：transferredTCF"
    },
    {
      "indent": 27,
      "text": "Figure 6: Message (5)",
      "ja": "図6：メッセージ（5）"
    },
    {
      "indent": 3,
      "text": "Message (6):",
      "ja": "メッセージ（6）："
    },
    {
      "indent": 6,
      "text": "Figure 7 shows a SIP 200 (OK) response to the initial SIP INVITE request, sent by Alice's proxy to Alice. Alice checks if the certificate fingerprint calculated from the Bob's certificate received via DTLS is the same as the certificate fingerprint received in the a=fingerprint SDP attribute of Figure 7. In this message flow, the check is successful; thus, the session setup continues.",
      "ja": "図7は、アリスにアリスのプロキシによって送信された最初のSIP INVITE要求へのSIP 200（OK）応答を示します。 DTLSを介して受信されたボブの証明書から計算した証明書のフィンガープリントは、チェックが成功すると、このメッセージ・フローは、図7のA =指紋SDP属性に受信した証明書のフィンガープリントと同じである場合、アリスは、小切手。このように、セッションのセットアップが続行されます。"
    },
    {
      "indent": 3,
      "text": "SIP/2.0 200 OK To: <sip:bob@example.com>;tag=6418913922105372816 From: \"Alice\" <sip:alice@example.com>;tag=843c7b0b Via: SIP/2.0/TLS ua1.example.com;branch=z9hG4bK-0e53sadfkasldkfj Record-Route: <sip:proxy.example.com;lr> Call-ID: 6076913b1c39c212@REVMTEpG CSeq: 1 INVITE Contact: <sip:bob@ua2.example.com> Content-Type: application/sdp Content-Length: xxxx Supported: from-change",
      "ja": "SIP / 2.0 200 OKに<SIP：bob@example.com>;からタグ= 6418913922105372816： \"アリス\" <SIP：alice@example.com>;タグ= 843c7b0bのVia：SIP / 2.0 / TLS ua1.example.com ;ブランチ= z9hG4bK-0e53sadfkasldkfj録音-ルート：<SIP：proxy.example.com; LR>コールID：REVMTEpGのCSeq @ 6076913b1c39c212：<SIP：bob@ua2.example.com>のContent-Type：アプリケーション1は、連絡先を招待します/ SDPのContent-Lengthは：サポートされているXXXX：から変更"
    },
    {
      "indent": 3,
      "text": "v=0 o=- 8965454521 2105372818 IN IP4 ua2.example.com s=- c=IN IP4 ua2.example.com t=0 0 m=image 12000 UDP/TLS/UDPTL t38 a=setup:active a=fingerprint: SHA-1 \\ FF:FF:FF:B1:3F:82:18:3B:54:02:12:DF:3E:5D:49:6B:19:E5:7C:AB a=T38FaxRateManagement:transferredTCF",
      "ja": "V = 0 0 =  -  8965454521 2105372818 IN IP4 ua2.example.com S =  -  C = IN IP4 ua2.example.com T = 0、M =画像12000 UDP / TLS / UDPTLのT38のA =セットアップ：アクティブA =指紋： SHA-1 \\ FF：FF：FF：B1：3F：82：18：3B：54：02：12：DF：3E：5D：49：6B：19：E5：7C：ABのA = T38FaxRateManagement：transferredTCF"
    },
    {
      "indent": 27,
      "text": "Figure 7: Message (6)",
      "ja": "図7：メッセージ（6）"
    },
    {
      "indent": 3,
      "text": "Message (7):",
      "ja": "メッセージ（7）："
    },
    {
      "indent": 6,
      "text": "Alice sends the SIP ACK request to Bob.",
      "ja": "アリスはボブにSIP ACKリクエストを送信します。"
    },
    {
      "indent": 3,
      "text": "Message (8):",
      "ja": "メッセージ（8）："
    },
    {
      "indent": 6,
      "text": "At this point, Bob and Alice can exchange T.38 fax securely transported using UDPTL over DTLS.",
      "ja": "この時点で、ボブとアリスはしっかりDTLS上UDPTLを使用して転送T.38ファックスを交換することができます。"
    },
    {
      "indent": 0,
      "text": "A.3. Message Flow of T.38 Fax Replacing Audio Media Stream in an Existing Audio-Only Session",
      "ja": "A.3。 T.38ファックスのメッセージフローは、既存のオーディオのみのセッションにオーディオメディアストリームを交換します"
    },
    {
      "indent": 3,
      "text": "Traditionally, most sessions with non-secure transport of T.38 fax, transported using UDPTL, are established by modifying an ongoing audio session into a fax session. Figure 8 shows an example message flow of modifying an existing audio session into a session with T.38 fax securely transported using UDPTL over DTLS.",
      "ja": "伝統的に、UDPTLを使用して転送T.38ファックスの非セキュア輸送、とほとんどのセッションは、ファックス・セッションに継続的なオーディオセッションを修正することにより確立されています。図8は、確実DTLS上UDPTLを用いて搬送T.38ファックスとのセッションに既存のオーディオセッションを修正する例示的メッセージフローを示します。"
    },
    {
      "indent": 3,
      "text": "In this example flow, Alice acts as the passive endpoint of the DTLS association, and Bob acts as the active endpoint of the DTLS association.",
      "ja": "この例のフローでは、アリスはDTLSアソシエーションの受動的エンドポイントとして機能し、ボブはDTLSアソシエーションのアクティブエンドポイントとして機能します。"
    },
    {
      "indent": 9,
      "text": "Alice                    Proxies                   Bob\n  |                        |                        |\n  |        (1) Audio-only session initiation        |\n  |<-----------------------+----------------------->|\n  |                        |                        |\n  | (2) SIP re-INVITE      |                        |\n  |------------------------------------------------>|\n  |                        |   (3) DTLS ClientHello |\n  |<------------------------------------------------|\n  |    (4) remaining messages of DTLS handshake     |\n  |<----------------------------------------------->|\n  |                        |                        |\n  |                        |                        |\n  |                        |         (5) SIP 200 OK |\n  |<------------------------------------------------|\n  | (6) SIP ACK            |                        |\n  |------------------------------------------------>|\n  |      (7) T.38 message using UDPTL over DTLS     |\n  |<----------------------------------------------->|\n  |                        |                        |",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Figure 8: Message Flow of T.38 Fax Replacing Audio Media Stream in an Existing Audio-Only Session",
      "ja": "図8：既存のオーディオのみのセッションにオーディオメディアストリームを交換T.38ファックスのメッセージフロー"
    },
    {
      "indent": 3,
      "text": "Message (1):",
      "ja": "メッセージ（1）："
    },
    {
      "indent": 6,
      "text": "Session establishment of audio-only session. The proxies decide not to record-route.",
      "ja": "音声のみのセッションのセッション確立。プロキシはルートを記録しないことを決定します。"
    },
    {
      "indent": 3,
      "text": "Message (2):",
      "ja": "メッセージ（2）："
    },
    {
      "indent": 6,
      "text": "Alice sends SIP re-INVITE request. The SDP offer included in the SIP re-INVITE request is shown in Figure 9.",
      "ja": "アリスは、SIPの再INVITEリクエストを送信します。 SDPオファーは、再INVITE要求は、図9に示されているSIPに含まれます。"
    },
    {
      "indent": 6,
      "text": "The first \"m=\" line in the SDP offer indicates audio media stream being removed. The second \"m=\" line in the SDP offer indicates T.38 fax using UDPTL over DTLS being added.",
      "ja": "SDPオファー内の最初の「M =」行は、オーディオメディアストリームが除去される示します。 SDPオファー内の第二の「M =」行がDTLSが追加される上UDPTLを用いてT.38ファックスを示しています。"
    },
    {
      "indent": 6,
      "text": "The SDP \"setup\" attribute with a value of \"actpass\" in the SDP offer indicates that Alice has requested to be either the active or passive endpoint.",
      "ja": "SDPオファーで「actpass」の値を持つSDP「セットアップ」属性は、アリスがアクティブまたはパッシブエンドポイントであることを要求したことを示しています。"
    },
    {
      "indent": 6,
      "text": "The SDP \"fingerprint\" attribute in the SDP offer contains the certificate fingerprint computed from Alice's self-signed certificate.",
      "ja": "SDPオファーにおけるSDP「指紋」属性は、アリスの自己署名証明書から計算された証明書のフィンガープリントが含まれています。"
    },
    {
      "indent": 3,
      "text": "v=0 o=- 2465353433 3524244442 IN IP4 ua1.example.com s=- c=IN IP4 ua1.example.com t=0 0 m=audio 0 UDP/TLS/RTP/SAVP 0 m=image 46056 UDP/TLS/UDPTL t38 a=setup:actpass a=fingerprint: SHA-1 \\ 4A:AD:B9:B1:3F:82:18:3B:54:02:12:DF:3E:5D:49:6B:19:E5:7C:AB a=T38FaxRateManagement:transferredTCF",
      "ja": "V = 0 0 =  -  2465353433 3524244442 IN IP4 ua1.example.com S =  -  C = IN IP4 ua1.example.com T = 0、M = 0オーディオUDP / TLS / RTP / SAVP 0、M =画像46056 UDP / TLS / UDPTLのT38のA =セットアップ：SHA-1 \\ 4A：AD：B9：B1：3F：82：18：3B：=指紋actpass 54：02：12：DF：3E：5D：49：6B：19： E5：7C：AB A = T38FaxRateManagement：transferredTCF"
    },
    {
      "indent": 20,
      "text": "Figure 9: SDP Offer of Message (2)",
      "ja": "図9：メッセージのSDPオファー（2）"
    },
    {
      "indent": 3,
      "text": "Message (3):",
      "ja": "メッセージ（3）："
    },
    {
      "indent": 6,
      "text": "Bob sends a DTLS ClientHello directly to Alice.",
      "ja": "ボブはアリスに直接DTLSのClientHelloを送信します。"
    },
    {
      "indent": 3,
      "text": "Message (4):",
      "ja": "メッセージ（4）："
    },
    {
      "indent": 6,
      "text": "Alice and Bob exchange further messages of DTLS handshake (HelloVerifyRequest, ClientHello, ServerHello, Certificate, ServerKeyExchange, CertificateRequest, ServerHelloDone, Certificate, ClientKeyExchange, CertificateVerify, ChangeCipherSpec, and Finished).",
      "ja": "DTLSハンドシェークのアリスとボブ交換さらなるメッセージ（HelloVerifyRequest、のClientHello、のServerHello、証明書、ServerKeyExchange、CertificateRequest、ServerHelloDone、証明書、ClientKeyExchange、CertificateVerify、ChangeCipherSpecを、完成しました）。"
    },
    {
      "indent": 6,
      "text": "When Bob receives the certificate of Alice via DTLS, Bob checks whether the certificate fingerprint calculated from Alice's certificate received via DTLS matches the certificate fingerprint received in the SDP \"fingerprint\" attribute of Figure 9. In this message flow, the check is successful; thus, session setup continues.",
      "ja": "ボブはDTLSを介してアリスの証明書を受信すると、ボブは、アリスの証明書から計算した証明書のフィンガープリントがDTLSを介して受信されたSDP「指紋」このメッセージフローの図9の属性は、チェックが成功するに受信した証明書のフィンガープリントと一致するかどうかをチェックします。このように、セッションのセットアップが続行されます。"
    },
    {
      "indent": 3,
      "text": "Message (5):",
      "ja": "メッセージ（5）："
    },
    {
      "indent": 6,
      "text": "Bob sends a SIP 200 (OK) response to the SIP re-INVITE request. The SIP 200 (OK) response contains an SDP answer shown in Figure 10.",
      "ja": "ボブは、SIP再INVITEリクエストに対するSIP 200（OK）応答を送信します。 SIP 200（OK）応答を図10に示すSDP回答を含んでいます。"
    },
    {
      "indent": 6,
      "text": "The first \"m=\" line in the SDP offer indicates audio media stream being removed. The second \"m=\" line in the SDP answer indicates T.38 fax using UDPTL over DTLS being added.",
      "ja": "SDPオファー内の最初の「M =」行は、オーディオメディアストリームが除去される示します。 SDPアンサー内の第二の「M =」行がDTLSが追加される上UDPTLを用いてT.38ファックスを示しています。"
    },
    {
      "indent": 6,
      "text": "The SDP \"setup\" attribute with a value of \"active\" in the SDP answer indicates that Bob has requested to be the active endpoint.",
      "ja": "SDPアンサーで「アクティブ」の値を持つSDP「セットアップ」属性は、ボブは、アクティブエンドポイントであることを要求したことを示しています。"
    },
    {
      "indent": 6,
      "text": "The SDP \"fingerprint\" attribute in the SDP answer contains the certificate fingerprint computed from Bob's self-signed certificate.",
      "ja": "SDPアンサーにおけるSDP「指紋」属性は、ボブの自己署名証明書から計算された証明書のフィンガープリントが含まれています。"
    },
    {
      "indent": 3,
      "text": "v=0 o=- 4423478999 5424222292 IN IP4 ua2.example.com s=- c=IN IP4 ua2.example.com t=0 0 m=audio 0 UDP/TLS/RTP/SAVP 0 m=image 32000 UDP/TLS/UDPTL t38 a=setup:active a=fingerprint: SHA-1 \\ FF:FF:FF:B1:3F:82:18:3B:54:02:12:DF:3E:5D:49:6B:19:E5:7C:AB a=T38FaxRateManagement:transferredTCF",
      "ja": "V = 0 0 =  -  4423478999 5424222292 IN IP4 ua2.example.com S =  -  C = IN IP4 ua2.example.com T = 0、M = 0オーディオUDP / TLS / RTP / SAVP 0、M =画像32000 UDP / TLS / UDPTLのT38のA =セットアップ：アクティブA =指紋：SHA-1 \\ FF：FF：FF：B1：3F：82：18：3B：54：02：12：DF：3E：5D：49：6B：19： E5：7C：AB A = T38FaxRateManagement：transferredTCF"
    },
    {
      "indent": 19,
      "text": "Figure 10: SDP Answer of Message (5)",
      "ja": "図10：メッセージのSDP回答（5）"
    },
    {
      "indent": 3,
      "text": "Message (6):",
      "ja": "メッセージ（6）："
    },
    {
      "indent": 6,
      "text": "Alice sends the SIP ACK request to Bob.",
      "ja": "アリスはボブにSIP ACKリクエストを送信します。"
    },
    {
      "indent": 3,
      "text": "Message (7):",
      "ja": "メッセージ（7）："
    },
    {
      "indent": 6,
      "text": "At this point, Bob and Alice can exchange T.38 fax securely transported using UDPTL over DTLS.",
      "ja": "この時点で、ボブとアリスはしっかりDTLS上UDPTLを使用して転送T.38ファックスを交換することができます。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Christer Holmberg Ericsson Hirsalantie 11 Jorvas 02420 Finland",
      "ja": "クリステルHolmbergのエリクソンHirsalantie 11 02420 Jorvasフィンランド"
    },
    {
      "indent": 3,
      "text": "EMail: christer.holmberg@ericsson.com",
      "ja": "メールアドレス：christer.holmberg@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Ivo Sedlacek Ericsson Sokolovska 79 Praha 18600 Czech Republic",
      "ja": "アイボ・セドレセックエリクソンSokolovska 79 18600プラハチェコ共和国"
    },
    {
      "indent": 3,
      "text": "EMail: ivo.sedlacek@ericsson.com",
      "ja": "メールアドレス：ivo.sedlacek@ericsson.com"
    },
    {
      "indent": 3,
      "text": "Gonzalo Salgueiro Cisco Systems, Inc. 7200-12 Kit Creek Road Research Triangle Park, NC 27709 US",
      "ja": "ゴンサロSalgueiroシスコシステムズ株式会社7200から12キットクリーク道路リサーチトライアングルパーク、ノースカロライナ州27709米国"
    },
    {
      "indent": 3,
      "text": "EMail: gsalguei@cisco.com",
      "ja": "メールアドレス：gsalguei@cisco.com"
    }
  ]
}