{
  "title": {
    "text": "RFC 7313 - Enhanced Route Refresh Capability for BGP-4",
    "ja": "RFC 7313 - BGP-4用の拡張ルートリフレッシュ機能"
  },
  "number": 7313,
  "created_at": "2019-10-31 15:08:07.916797+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          K. Patel\nRequest for Comments: 7313                                       E. Chen\nUpdates: 2918                                              Cisco Systems\nCategory: Standards Track                           B. Venkatachalapathy\nISSN: 2070-1721                                                July 2014",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Enhanced Route Refresh Capability for BGP-4",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "In this document, we enhance the existing BGP route refresh mechanisms to provide for the demarcation of the beginning and the ending of a route refresh. The enhancement can be used to facilitate correction of BGP Routing Information Base (RIB) inconsistencies in a non-disruptive manner. This document updates RFC 2918.",
      "ja": "この文書では、我々は最初の境界とルートリフレッシュの終了を提供するために、既存のBGPルートリフレッシュメカニズムを強化します。増強は、非破壊的方法でBGPルーティング情報ベース（RIB）不整合の補正を容易にするために使用することができます。この文書は、RFC 2918に更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 5741のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7313.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7313で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2014 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2014 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Requirements Language . . . . . . . . . . . . . . . . . . . .   2\n3.  Protocol Extensions . . . . . . . . . . . . . . . . . . . . .   2\n  3.1.  Enhanced Route Refresh Capability . . . . . . . . . . . .   3\n  3.2.  Subtypes for ROUTE-REFRESH Message  . . . . . . . . . . .   3\n4.  Operation . . . . . . . . . . . . . . . . . . . . . . . . . .   3\n5.  Error Handling  . . . . . . . . . . . . . . . . . . . . . . .   5\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   6\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .   7\n8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .   7\n9.  Normative References  . . . . . . . . . . . . . . . . . . . .   7",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "It is sometimes necessary to perform routing consistency validations such as checking for possible missing route withdrawals between BGP speakers [RFC4271]. Currently, such validations typically involve offline, manual operations that can be tedious and time-consuming.",
      "ja": "[RFC4271]このようなBGPスピーカ間の可能な欠落ルート引き出しの確認としてルーティング一貫性の検証を行うために時々必要です。現在、このような検証は、一般的に面倒で時間がかかる可能性がオフライン、手動操作を必要とします。"
    },
    {
      "indent": 3,
      "text": "In this document, we enhance the existing BGP route refresh mechanisms [RFC2918] to provide for the demarcation of the beginning and the ending of a route refresh (which refers to the complete re-advertisement of the Adj-RIB-Out to a peer, subject to routing policies). The enhancement can be used to facilitate online, non-disruptive consistency validation of BGP routing updates.",
      "ja": "この文書では、我々は最初の境界とピアへのAdj-RIBアウトの完全な再広告を指し、ルートリフレッシュ（の結末を提供するために、既存のBGPルートリフレッシュメカニズム[RFC2918]を強化しますルーティングポリシーに従います）。増強は、オンラインBGPルーティングアップデートの非破壊的整合性の検証を容易にするために使用することができます。"
    },
    {
      "indent": 3,
      "text": "This document updates [RFC2918] by redefining a field in the ROUTE-REFRESH message that was previously designated as Reserved.",
      "ja": "以前に予約と命名したROUTEリフレッシュメッセージのフィールドを再定義することによって、このドキュメントの更新[RFC2918]。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Language",
      "section_title": true,
      "ja": "2.必要な言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119] only when they appear in all upper case. They may also appear in lower or mixed case as English words, without any normative meaning.",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますそれらは全て大文字で表示された場合にのみ、[RFC2119]に記載されているように解釈されます。彼らはまた、任意の規範的な意味せず、英単語などの低級または混合の場合に表示されることがあります。"
    },
    {
      "indent": 0,
      "text": "3. Protocol Extensions",
      "section_title": true,
      "ja": "3.プロトコル拡張"
    },
    {
      "indent": 3,
      "text": "The BGP protocol extensions introduced in this document include the definition of a new BGP capability, named \"Enhanced Route Refresh Capability\", and the specification of the message subtypes for the ROUTE-REFRESH message.",
      "ja": "本書で紹介しBGPプロトコル拡張は、「拡張ルートリフレッシュ機能」という名前の新しいBGP機能の定義、およびROUTE-REFRESHメッセージのメッセージサブタイプの仕様を含みます。"
    },
    {
      "indent": 0,
      "text": "3.1. Enhanced Route Refresh Capability",
      "section_title": true,
      "ja": "3.1。強化されたルートリフレッシュ機能"
    },
    {
      "indent": 3,
      "text": "The \"Enhanced Route Refresh Capability\" is a new BGP capability [RFC5492]. IANA has assigned a Capability Code of 70 for this capability. The Capability Length field of this capability is zero.",
      "ja": "「強化されたルートリフレッシュ機能は、」新しいBGP機能[RFC5492]です。 IANAは、この機能のための70の能力コードが割り当てられています。この能力の能力長フィールドはゼロです。"
    },
    {
      "indent": 3,
      "text": "By advertising this capability to a peer, a BGP speaker conveys to the peer that the speaker supports the message subtypes for the ROUTE-REFRESH message and the related procedures described in this document.",
      "ja": "ピアにこの能力を広告することで、BGPスピーカーは、スピーカーがROUTE-REFRESHメッセージのメッセージサブタイプと、この文書で説明する関連する手順をサポートしていることを相手に伝えます。"
    },
    {
      "indent": 0,
      "text": "3.2. Subtypes for ROUTE-REFRESH Message",
      "section_title": true,
      "ja": "3.2。 ROUTE-REFRESHメッセージのためのサブタイプ"
    },
    {
      "indent": 3,
      "text": "The \"Reserved\" field of the ROUTE-REFRESH message specified in [RFC2918] is redefined as the \"Message Subtype\" with the following values:",
      "ja": "[RFC2918]で指定されたルートリフレッシュメッセージの「予約」フィールドは以下の値と「メッセージサブタイプ」として再定義されます。"
    },
    {
      "indent": 11,
      "text": "  0 - Normal route refresh request [RFC2918]\n      with/without Outbound Route Filtering (ORF) [RFC5291]\n  1 - Demarcation of the beginning of a route refresh\n      (BoRR) operation\n  2 - Demarcation of the ending of a route refresh\n      (EoRR) operation\n255 - Reserved",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The remaining values of the message subtypes are reserved for future use; see Section 6 (\"IANA Considerations\"). The use of the new message subtypes is described in Section 4 (\"Operation\").",
      "ja": "メッセージサブタイプの残りの値は、将来の使用のために予約されています。第6節（ \"IANAの考慮事項\" を参照してください）。新しいメッセージのサブタイプの使用は、第4章（「操作」）に記載されています。"
    },
    {
      "indent": 0,
      "text": "4. Operation",
      "section_title": true,
      "ja": "4.操作"
    },
    {
      "indent": 3,
      "text": "A BGP speaker that supports the message subtypes for the ROUTE-REFRESH message and the related procedures SHOULD advertise the \"Enhanced Route Refresh Capability\".",
      "ja": "ROUTE-REFRESHメッセージのメッセージサブタイプと関連する手順をサポートしているBGPスピーカは、「拡張ルートリフレッシュ機能」を宣伝すべきです。"
    },
    {
      "indent": 3,
      "text": "The following procedures are applicable only if a BGP speaker has received the \"Enhanced Route Refresh Capability\" from a peer.",
      "ja": "次の手順では、BGPスピーカがピアから「拡張ルートリフレッシュ機能」を受信した場合にのみ適用されます。"
    },
    {
      "indent": 3,
      "text": "Before the speaker starts a route refresh that is either initiated locally, or in response to a \"normal route refresh request\" from the peer, the speaker MUST send a BoRR message. After the speaker completes the re-advertisement of the entire Adj-RIB-Out to the peer, it MUST send an EoRR message.",
      "ja": "スピーカーは、いずれかのローカルで開始されたルートリフレッシュを開始する前に、またはピアから「通常ルートリフレッシュ要求」に応じて、スピーカーはBoRRメッセージを送らなければなりません。スピーカーがピアに全体の調整]-RIBアウトの再広告を完了した後、それはEoRRメッセージを送らなければなりません。"
    },
    {
      "indent": 3,
      "text": "Conceptually, the \"entire Adj-RIB-Out\" for a peer in this section refers to all the route entries in the \"Adj-RIB-Out\" for the peer at the start of the route refresh operation. These route entries comprise both the reachability as well as unreachability information.",
      "ja": "概念的には、このセクションのピアの「全体のAdj-RIB-outが」ルートリフレッシュ動作の開始時にピアの「のAdj-RIBアウト」内のすべてのルートエントリを指します。これらのルートエントリは、到達可能性、ならびに不到達情報の両方を含みます。"
    },
    {
      "indent": 3,
      "text": "When a route entry in the \"Adj-RIB-Out\" changes, only the modified route entry needs to be advertised.",
      "ja": "「調整]-RIBアウト」の変更でルートエントリは、のみ変更されたルートエントリがアドバタイズする必要がある場合。"
    },
    {
      "indent": 3,
      "text": "In processing a ROUTE-REFRESH message from a peer, the BGP speaker MUST examine the \"message subtype\" field of the message and take the appropriate actions. The message processing rules for ROUTE-REFRESH message with subtype of 0 are described in [RFC2918] and [RFC5291]. A BGP speaker can receive a BoRR message from a peer at any time, either as a result of a peer responding to a ROUTE-REFRESH message, or as a result of a peer unilaterally initiating a route refresh. When a BGP speaker receives a BoRR message from a peer, it MUST mark all the routes with the given Address Family Identifier and Subsequent Address Family Identifier, <AFI, SAFI> [RFC2918], from that peer as stale. As it receives routes from its peer's subsequent Adj-RIB-Out re-advertisement, these replace any corresponding stale routes. When a BGP speaker receives an EoRR message from a peer, it MUST immediately remove any routes from the peer that are still marked as stale for that <AFI, SAFI>. Such purged routes MAY be logged for future analysis. A BGP speaker MAY ignore any EoRR message received without a prior receipt of an associated BoRR message. Such messages MAY be logged for future analysis.",
      "ja": "ピアからROUTE-REFRESHメッセージを処理するには、BGPスピーカは、メッセージの「メッセージのサブタイプ」フィールドを調べ、適切な処置を取る必要があります。 0のサブタイプとROUTEリフレッシュメッセージのメッセージ処理ルールは、[RFC2918]及び[RFC5291]に記載されています。 BGPスピーカは、ルートリフレッシュメッセージに応答するピアの結果として、または一方的にルート・リフレッシュを開始するピアの結果として、任意の時点で、ピアからBoRRメッセージを受信することができます。 BGPスピーカがピアからBoRRメッセージを受信すると、それが失効としてそのピアから与えられたアドレスファミリ識別子と次のアドレスファミリー識別子、<AFI、SAFI> [RFC2918]とのすべてのルートをマークしなければなりません。それはそのピアのその後の調整]-RIBアウト再広告からのルートを受信すると、これらは、任意の対応する古いルートを交換してください。 BGPスピーカがピアからEoRRメッセージを受信すると、即座にまだその<AFI、SAFI>のための失効としてマークされているピアからのすべてのルートを削除する必要があります。このようなパージルートは、将来の分析のために記録してもよいです。 BGPスピーカは、関連BoRRメッセージの前に受信せずに受信された任意のEoRRメッセージを無視してもよいです。このようなメッセージは、将来の分析のために記録してもよいです。"
    },
    {
      "indent": 3,
      "text": "An implementation MAY impose a locally configurable upper bound on how long it would retain any stale routes. Once the upper bound is reached, the implementation MAY remove any routes from the peer that are still marked as stale for that <AFI, SAFI> without waiting for an EoRR message.",
      "ja": "実装は、それがどんな古いルートを維持するだろうか長い上でローカルに設定可能な上限を課すことができます。上限に達すると、実装はまだEoRRメッセージを待たずにその<AFI、SAFI>のための古いとしてマークされ、ピアからのすべてのルートを削除することができます。"
    },
    {
      "indent": 3,
      "text": "The following procedures are specified in order to simplify the interaction with the BGP Graceful Restart [RFC4724]. In particular, these procedures ensure that End-of-RIB (EoR) defined in Graceful Restart and EoRR as defined in this specification are kept separate, thereby avoiding any premature cleanup of stale routes. For a BGP speaker that supports the BGP Graceful Restart, it MUST NOT send a BoRR for an <AFI, SAFI> to a neighbor before it sends the EoR for the <AFI, SAFI> to the neighbor. A BGP speaker that has received the Graceful Restart Capability from its neighbor MUST ignore any BoRRs for an <AFI, SAFI> from the neighbor before the speaker receives the EoR for the given <AFI, SAFI> from the neighbor. The BGP speaker SHOULD log an error of the condition for further analysis.",
      "ja": "以下の手順は、BGPグレースフルリスタート[RFC4724]との相互作用を簡単にするために指定されています。具体的には、これらの手順は、エンド・オブ・RIB（EOR）グレースフルリスタート、本明細書で定義されるようEoRRで定義され、それにより失効したルートのいずれか早期のクリーンアップを避け、別々に維持されていることを確認します。それが隣人に<AFI、SAFI>のためのEORを送信する前に、BGPグレースフルリスタートをサポートしているBGPスピーカの場合、それは隣人に<AFI、SAFI>のためBoRRを送ってはいけません。話者が隣人から与えられた<AFI、SAFI>のためのEORを受信する前に、そのネイバーからグレースフルリスタート機能を受信したBGPスピーカは、ネイバーから<AFI、SAFI>のための任意のBoRRsを無視しなければなりません。 BGPスピーカは、さらなる分析のための条件のエラーをログに記録すべきです。"
    },
    {
      "indent": 0,
      "text": "5. Error Handling",
      "section_title": true,
      "ja": "5.エラー処理"
    },
    {
      "indent": 3,
      "text": "This document defines a new NOTIFICATION error code:",
      "ja": "この文書は、新しい通知エラーコードを定義します。"
    },
    {
      "indent": 10,
      "text": "Error Code Name",
      "ja": "エラーコード名"
    },
    {
      "indent": 14,
      "text": "7 ROUTE-REFRESH Message Error",
      "ja": "7 ROUTE-REFRESHメッセージエラー"
    },
    {
      "indent": 3,
      "text": "The following error subcode is defined as well:",
      "ja": "次のエラーサブコードも同様に定義されています。"
    },
    {
      "indent": 10,
      "text": "Subcode Name",
      "ja": "サブコード名"
    },
    {
      "indent": 13,
      "text": "1 Invalid Message Length",
      "ja": "1無効なメッセージ長"
    },
    {
      "indent": 3,
      "text": "The error handling specified in this section is applicable only when a BGP speaker has received the \"Enhanced Route Refresh Capability\" from a peer.",
      "ja": "このセクションで指定されたエラー処理は、BGPスピーカがピアから「拡張ルートリフレッシュ機能」を受信したときにのみ適用されます。"
    },
    {
      "indent": 3,
      "text": "If the length, excluding the fixed-size message header, of the received ROUTE-REFRESH message with Message Subtype 1 and 2 is not 4, then the BGP speaker MUST send a NOTIFICATION message with the Error Code of \"ROUTE-REFRESH Message Error\" and the subcode of \"Invalid Message Length\". The Data field of the NOTIFICATION message MUST contain the complete ROUTE-REFRESH message.",
      "ja": "メッセージサブタイプ1及び2と受信したルート・リフレッシュ・メッセージの固定サイズのメッセージヘッダを除く長さは、4でない場合、BGPスピーカは、「ルートリフレッシュメッセージエラー」のエラーコードでNOTIFICATIONメッセージを送らなければなりませんそして「無効なメッセージ長」のサブコード。通知メッセージのデータフィールドは、完全なROUTE-REFRESHメッセージを含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "When the BGP speaker receives a ROUTE-REFRESH message with a \"Message Subtype\" field other than 0, 1, or 2, it MUST ignore the received ROUTE-REFRESH message. It SHOULD log an error for further analysis.",
      "ja": "BGPスピーカは、0,1、または2以外の「メッセージサブタイプ」フィールドとROUTEリフレッシュメッセージを受信すると、受信したルート・リフレッシュ・メッセージを無視しなければなりません。これは、さらなる分析のためにエラーをログに記録すべきです。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines the Enhanced Route Refresh Capability for BGP. In the \"Capability Codes\" registry, IANA has assigned it value 70, referencing this document.",
      "ja": "この文書は、BGP用の拡張ルートリフレッシュ機能を定義します。 「機能コード」のレジストリでは、IANAはこのドキュメントを参照し、その値70が割り当てられています。"
    },
    {
      "indent": 3,
      "text": "This document also defines two new subcodes for the Route Refresh message. They have been registered with the IANA in a new registry as follows:",
      "ja": "また、このドキュメントでは、ルート更新メッセージのための2つの新しいサブコードを定義します。次のように彼らは、新しいレジストリにIANAに登録されています："
    },
    {
      "indent": 11,
      "text": "Under \"Border Gateway Protocol (BGP) Parameters\":\nRegistry: \"BGP Route Refresh Subcodes\"\nReference: [RFC7313]\nRegistration Procedure(s): Values 0-127 Standards Action,\n  values 128-254 First Come First Served",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Value Code Reference 0 Route-Refresh [RFC2918], [RFC5291] 1 BoRR [RFC7313] 2 EoRR [RFC7313] 3-254 Unassigned 255 Reserved [RFC7313]",
      "ja": "値コードリファレンス0ルートリフレッシュ[RFC2918]、[RFC5291] 1 BoRR [RFC7313] 2 EoRR [RFC7313] 3から254未割り当て255予約[RFC7313]"
    },
    {
      "indent": 3,
      "text": "In addition, this document defines a NOTIFICATION error code and an error subcode related to the ROUTE-REFRESH message. IANA has changed the name of the \"BGP Error Codes\" to \"BGP Error (Notification) Codes\" and added this document as a reference. IANA has allocated a new error code from that registry with the name \"ROUTE-REFRESH Message Error\", referencing this document.",
      "ja": "また、この文書は、通知エラーコードおよびルート・リフレッシュ・メッセージに関連するエラーサブコードが定義されています。 IANAは、「BGPエラー（通知）コード」に「BGPエラーコード」の名称を変更し、参照としてこの文書を追加しました。 IANAはこのドキュメントを参照し、名称「ROUTE-REFRESHメッセージエラー」でそのレジストリから新しいエラーコードが割り当てられています。"
    },
    {
      "indent": 3,
      "text": "IANA has created a new registry for the error subcodes as follows:",
      "ja": "次のようにIANAは、エラーサブコードのための新しいレジストリを作成しました："
    },
    {
      "indent": 11,
      "text": "Under \"Border Gateway Protocol (BGP) Parameters\",\nunder \"BGP Error Subcodes\":\nRegistry: \"BGP ROUTE-REFRESH Message Error subcodes\"\nReference: [RFC7313]\nRegistration Procedure(s): Values 0-127 Standards Action,\n  values 128-255 First Come First Served",
      "raw": true
    },
    {
      "indent": 11,
      "text": "Value Name Reference 0 Reserved [RFC7313] 1 Invalid Message Length [RFC7313] 2-255 Unassigned",
      "ja": "値の名前リファレンス0予約[RFC7313] 1つの無効なメッセージ長[RFC7313] 2-255未割り当て"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Security considerations are given in [RFC4272] , but they do not cover Route-Refresh and many other BGP extensions. This document does not significantly change the underlying security issues regarding Route-Refresh, although improved error handling may aid operational security.",
      "ja": "セキュリティの考慮事項は、[RFC4272]に記載されているが、それらは、ルートリフレッシュおよび他の多くのBGP拡張をカバーしていません。改善されたエラー処理が運用上のセキュリティを助けることができるが、この文書では、大幅に、ルートリフレッシュに関する根本的なセキュリティ問題を変更しません。"
    },
    {
      "indent": 0,
      "text": "8. Acknowledgements",
      "section_title": true,
      "ja": "8.謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Pedro Marques, Pradosh Mohapatra, Robert Raszuk, Pranav Mehta, Shyam Sethuram, Bruno Decraene, Martin Djernaes, Jeff Haas, Ilya Varlashkin, Rob Shakir, Paul Jakma, Jie Dong, Qing Zeng, Albert Tian, Jakob Heitz, and Chris Hall for their review and comments. The authors would like to thank John Scudder for the review and contribution to this document.",
      "ja": "著者はペドロ・マルケス、Pradosh Mohapatra、ロバートRaszuk、Pranavメータ、シャムSethuram、ブルーノDecraene、マーティンDjernaes、ジェフ・ハース、イリヤVarlashkin、ロブShakir、ポールJakma、傑ドン、清曽、アルバート・ティエン、ヤコブハイツに感謝したいと思います、そしてクリス・ホール彼らのレビューとコメント。作者はこのドキュメントへのレビューと貢献のためにジョン・スカダーに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "9. Normative References",
      "section_title": true,
      "ja": "9.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, March 1997.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、1997年3月。"
    },
    {
      "indent": 3,
      "text": "[RFC2918] Chen, E., \"Route Refresh Capability for BGP-4\", RFC 2918, September 2000.",
      "ja": "[RFC2918]チェン、E.、 \"BGP-4のためのルートリフレッシュ機能\"、RFC 2918、2000年9月。"
    },
    {
      "indent": 3,
      "text": "[RFC4271] Rekhter, Y., Li, T., and S. Hares, \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, January 2006.",
      "ja": "[RFC4271] Rekhter、Y.、李、T.、およびS.野兎、 \"ボーダーゲートウェイプロトコル4（BGP-4）\"、RFC 4271、2006年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4272] Murphy, S., \"BGP Security Vulnerabilities Analysis\", RFC 4272, January 2006.",
      "ja": "[RFC4272]マーフィー、S.、 \"BGPセキュリティの脆弱性分析\"、RFC 4272、2006年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC4724] Sangli, S., Chen, E., Fernando, R., Scudder, J., and Y. Rekhter, \"Graceful Restart Mechanism for BGP\", RFC 4724, January 2007.",
      "ja": "[RFC4724]サングリ、S.、チェン、E.、フェルナンド、R.、スカダー、J.、およびY. Rekhter、 \"BGPのためのグレースフルリスタート機構\"、RFC 4724、2007年1月。"
    },
    {
      "indent": 3,
      "text": "[RFC5291] Chen, E. and Y. Rekhter, \"Outbound Route Filtering Capability for BGP-4\", RFC 5291, August 2008.",
      "ja": "[RFC5291]チェン、E.およびY. Rekhter、 \"BGP-4のためのアウトバウンドルートフィルタリング機能\"、RFC 5291、2008年8月。"
    },
    {
      "indent": 3,
      "text": "[RFC5492] Scudder, J. and R. Chandra, \"Capabilities Advertisement with BGP-4\", RFC 5492, February 2009.",
      "ja": "[RFC5492]スカダー、J.及びR.チャンドラ、 \"BGP-4との機能広告\"、RFC 5492、2009年2月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Keyur Patel Cisco Systems 170 W. Tasman Drive San Jose, CA 95134 USA",
      "ja": "Keyurパテルシスコシステムズ170 W.タスマン・ドライブサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: keyupate@cisco.com",
      "ja": "メールアドレス：keyupate@cisco.com"
    },
    {
      "indent": 3,
      "text": "Enke Chen Cisco Systems 170 W. Tasman Drive San Jose, CA 95134 USA",
      "ja": "エンケ陳シスコシステムズ170 W.タスマン・ドライブサンノゼ、CA 95134 USA"
    },
    {
      "indent": 3,
      "text": "EMail: enkechen@cisco.com",
      "ja": "メールアドレス：enkechen@cisco.com"
    },
    {
      "indent": 3,
      "text": "Balaji Venkatachalapathy",
      "ja": "バラジVenktclpti"
    },
    {
      "indent": 3,
      "text": "EMail: balaji_pv@hotmail.com",
      "ja": "メールアドレス：balaji_pv@hotmail.com"
    }
  ]
}