{
  "title": {
    "text": "RFC 8892 - Guidelines and Registration Procedures for Interface Types and Tunnel Types",
    "ja": "RFC 8892 - インタフェースタイプとトンネルタイプのガイドラインと登録手順"
  },
  "number": 8892,
  "created_at": "2021-03-25 13:00:04.601241+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         D. Thaler\nRequest for Comments: 8892                                     Microsoft\nUpdates: 2863                                               D. Romascanu\nCategory: Standards Track                                    Independent\nISSN: 2070-1721                                              August 2020",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 1,
      "text": "Guidelines and Registration Procedures for Interface Types and Tunnel Types",
      "ja": "インタフェースタイプとトンネルタイプのガイドラインと登録手順"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document provides guidelines and procedures for those who are defining, registering, or evaluating definitions of new interface types (\"ifType\" values) and tunnel types. The original definition of the IANA interface type registry predated the use of IANA Considerations sections and YANG modules, so some confusion arose over time. Tunnel types were added later, with the same requirements and allocation policy as interface types. This document updates RFC 2863 and provides updated guidance for these registries.",
      "ja": "この資料は、新しいインターフェイスタイプの定義、登録、または評価を定義、登録、または評価しているユーザーのためのガイドラインと手順（ \"ifType\"値）とトンネルタイプを提供します。IANAインタフェース型レジストリの元の定義IANAの考慮事項の使用区間とヤンモジュールの使用予定であるため、時間の経過とともに発生します。インタフェースタイプとして同じ要件と割り当てポリシーを使用して、後でトンネルタイプが追加されました。この文書はRFC 2863を更新し、これらのレジストリに対して更新されたガイダンスを提供します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット規格のトラック文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "この文書は、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表します。それは公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による出版の承認を受けました。インターネット規格に関する詳細情報は、RFC 7841のセクション2で利用できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8892.",
      "ja": "この文書の現在のステータス、任意のエラータ、およびフィードバックを提供する方法は、https://www.rfc-editor.org/info/rfc8892で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2020 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（C）2020 IETFの信頼と文書著者として識別された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、この文書の公開日に有効なIETF文書（https://truste.ietf.org/License-info）に関するBCP 78とIETF信頼の法的規定を受けています。この文書に関してあなたの権利と制限を説明するので、これらの文書を慎重に見直してください。この文書から抽出されたコードコンポーネントには、信頼法の法的規定のセクション4。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n2.  Terminology\n3.  Problems\n4.  Interface Sub-layers and Sub-types\n  4.1.  Alternate Values\n5.  Available Formats\n6.  Registration\n  6.1.  Procedures\n  6.2.  Media-Specific OID-Subtree Assignments\n  6.3.  Registration Template\n    6.3.1.  ifType\n    6.3.2.  tunnelType\n7.  IANA Considerations\n  7.1.  MIB and YANG Modules\n  7.2.  Transmission Number Assignments\n8.  Security Considerations\n9.  References\n  9.1.  Normative References\n  9.2.  Informative References\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The IANA IfType-MIB, which contains the list of interface type (ifType) values, was originally defined in [RFC1573] as a separate MIB module together with the Interfaces Group MIB (IF-MIB) module. The IF-MIB module was subsequently updated and is currently specified in [RFC2863], but the latest IF-MIB RFC no longer contains the IANA IfType-MIB. Instead, the IANA IfType-MIB is maintained by IANA as a separate module. Similarly, [RFC7224] created an initial IANA Interface Type YANG Module, and the current version is maintained by IANA.",
      "ja": "IANA IFTYPE-MIBは、インターフェイスタイプ（iftype）値のリストを含むIANAには、InterfacesグループMIB（IF-MIB）モジュールと一緒に[RFC1573]では、別のMIBモジュールとして定義されていました。IF-MIBモジュールはその後更新され、現在[RFC2863]で指定されていますが、最新のIF-MIB RFCはIANA iftype-mibを含みません。代わりに、IANA iftype-mibは別のモジュールとしてIANAによって維持されます。同様に、[RFC7224]は初期IANAインターフェースタイプYANGモジュールを作成し、現在のバージョンはIANAによって維持されます。"
    },
    {
      "indent": 3,
      "text": "The current IANA IfType registry is at [ifType-registry], with the same values also appearing in both [yang-if-type] and the IANAifType textual convention at [IANAifType-MIB].",
      "ja": "現在のIANA iftypeレジストリは[iftype-registry]にあり、同じ値は[yang-if-type]の両方でもianififtype-mibでのIANAIFIFTypeテキスト条約に表示されます。"
    },
    {
      "indent": 3,
      "text": "Although the ifType registry was originally defined in a MIB module, the assignment and use of interface type values are not tied to MIB modules or any other management mechanism. An interface type value can be used as the value of a data model object (MIB object, YANG object, etc.), as part of a unique identifier of a data model for a given interface type (e.g., in an OID), or simply as a value exposed by local APIs or UIs on a device.",
      "ja": "IFTypeレジストリはMIBモジュールで最初に定義されていましたが、インターフェイスタイプの値の割り当てと使用はMIBモジュールやその他の管理メカニズムに接続されていません。インターフェイスタイプの値は、特定のインターフェイスタイプのデータモデルの一意の一意の識別子（例えば、OID内）の一部として、データモデルオブジェクト（MIBオブジェクト、YANGオブジェクトなど）の値として使用できます。単にデバイス上のローカルAPIまたはUIによって公開されている値として。"
    },
    {
      "indent": 3,
      "text": "The TUNNEL-MIB was defined in [RFC2667] (now obsoleted by [RFC4087]), which created a tunnelType registry ([tunnelType-registry] and the IANAtunnelType textual convention at [IANAifType-MIB]), and it defined the assignment policy for tunnelType values to always be identical to the policy for assigning ifType values.",
      "ja": "Tunnel-MIBは[RFC2667]で[RFC2667]で定義されました。これは、TunnelTypeレジストリ（[TunnelType-Registry]と[IANNELTYPE-REGISTRY]とIANATUNNELTYPEのテキスト条約]）を作成し、その代入ポリシーを定義しました。TunnelTypeの値は、ifType値を割り当てるためのポリシーと常に同じになるように値します。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "「必須」、「必須」、「必須」、「SHALL」、「必ず」、「推奨する」、「推奨する」、「推奨する」、「推奨する」、「推奨する」、「5月」「この文書では、BCP 14 [RFC2119] [RFC8174]に記載されている場合に解釈されるべきであり、ここに示すように、すべての首都に表示されます。"
    },
    {
      "indent": 0,
      "text": "3. Problems",
      "section_title": true,
      "ja": "3. 課題"
    },
    {
      "indent": 3,
      "text": "This document addresses the following issues:",
      "ja": "この文書は次の問題に対処します。"
    },
    {
      "indent": 3,
      "text": "1. As noted in Section 1, the original guidance was written with wording specific to MIB modules; accordingly, some confusion has resulted when using YANG modules. This document clarifies that ifTypes and tunnelTypes are independent from the type of, or even existence of, a data model.",
      "ja": "1. セクション1で述べたように、元のガイダンスはMIBモジュールに固有の表現で書かれていました。したがって、Yangモジュールを使用するときには、いくつかの混乱が生じました。この文書では、IFTYPESとTUNNLETYPEがデータモデルの種類、さらには存在から独立していることを明確にしています。"
    },
    {
      "indent": 3,
      "text": "2. The use of and requirements around sub-layers and sub-types were not well understood, but good examples of both now exist. This is discussed in Section 4.",
      "ja": "2. 副層およびサブタイプの周囲の使用および要件は十分に理解されていなかったが、今両方の良好な例が存在する。これについては4章で説明します。"
    },
    {
      "indent": 3,
      "text": "3. Since the \"Interface Types (ifType)\" and \"Tunnel Types (tunnelType)\" registries were originally defined, and are still retrievable, in the format of MIB modules (in addition to other formats), confusion arose when adding YANG modules as another format as to whether each is a separate registry. This is discussed in Section 5.",
      "ja": "3. 「インタフェースタイプ（IFTYPE）」と「トンネルタイプ（TUNNELTYPE）」レジストリが最初に定義されており、まだ取得可能なMIBモジュールの形式（他のフォーマットに加えて）では、ヤンモジュールを別の形式として追加すると起点がありました。それぞれが別々のレジストリかどうかについて。これについてはセクション5で説明します。"
    },
    {
      "indent": 3,
      "text": "4. The registries are retrievable in the format of MIB and YANG modules, but there was previously no process guidance written to check that those formats were syntactically correct as updates were made, which led to the registry having syntax errors that broke tools. Section 6.1 adds a validation step to the documented assignment procedure.",
      "ja": "4. レジストリはMIBモジュールとYANGモジュールの形式で検索可能ですが、更新が行われたとしてこれらのフォーマットが構文的に正しいことを確認するために作成されたプロセスガイダンスは以前はいませんでした。セクション6.1は、文書化された割り当て手順に検証ステップを追加します。"
    },
    {
      "indent": 3,
      "text": "5. Various documents and registries previously said to submit requests via email, but a web form exists for submitting requests, which caused some confusion around which was to be used. This is addressed in Section 6.1.",
      "ja": "5. 以前はさまざまな文書やレジストリがEメールで要求を送信すると言われていましたが、リクエストを送信するためのWebフォームが存在します。これはセクション6.1でアドレス指定されています。"
    },
    {
      "indent": 3,
      "text": "6. Transmission values [transmission-registry] have generally been allocated as part of ifType allocation, but no guidance existed as to whether a requester must ask for it or not, and the request form had no such required field. As a result, IANA has asked the designated expert to decide for each allocation, but no relevant guidance for the designated expert has been documented. This is remedied in Section 6.2.",
      "ja": "6. 送信値[送信レジストリ]は、一般的にIFTYPE割り当ての一部として割り当てられていますが、リクエスタがそれを要求しているかどうかについてはガイダンスは存在しませんでした。その結果、IANAは指定された専門家に各割り当てについて決定しましたが、指定された専門家のための関連するガイダンスは文書化されていません。これは6.2節で修正されています。"
    },
    {
      "indent": 0,
      "text": "4. Interface Sub-layers and Sub-types",
      "section_title": true,
      "ja": "4. インターフェースのサブレイヤとサブタイプ"
    },
    {
      "indent": 3,
      "text": "When multiple sub-layers exist below the network layer, each sub-layer can be represented by its own row in the ifTable with its own ifType, with the ifStackTable being used to identify the upward and downward multiplexing relationships between rows. Section 3.1.1 of [RFC2863] provides more discussion, and 3.1.2 provides guidance for defining interface sub-layers. More recent experience shows that those guidelines were phrased in a way that is now too restrictive, since at the time [RFC2863] was written, MIB modules were the dominant data model.",
      "ja": "複数のサブレイヤがネットワーク層の下に存在する場合、各サブレイヤは、IFStackTableが行の上方および下方の多重化関係を識別するために使用されるIFSTACKTABLEを使用して、それ自身のIFTypeでそれ自体の行によって表すことができます。[RFC2863]のセクション3.1.1はより多くの議論を提供し、3.1.2はインタフェースサブレイヤを定義するためのガイダンスを提供します。最近の経験は、このようなガイドラインが制限的であまりにも制限的であることを示していることを示しています。"
    },
    {
      "indent": 3,
      "text": "This document clarifies that the same guidance also applies to YANG modules.",
      "ja": "この文書では、同じガイダンスもYangモジュールにも適用されることを明確にしています。"
    },
    {
      "indent": 3,
      "text": "Some ifTypes may define sub-types. For example, the tunnel(131) ifType defines sub-types known as \"tunnelTypes\", where each tunnelType can have its own MIB and/or YANG module with protocol-specific information, but there is enough in common that some information is exposed in a generic IP Tunnel MIB corresponding to the tunnel(131) ifType.",
      "ja": "いくつかのifTypesはサブタイプを定義するかもしれません。たとえば、Tunnel（131）iftypeは \"TunnelTypes\"として知られているサブタイプを定義します。ここで、各TunnelTypeはプロトコル固有の情報を持つ独自のMIBおよび/またはYANGモジュールを持つことができますが、一部の情報が公開されているのは十分です。トンネル（131）ifTypeに対応する汎用IPトンネルMIB。"
    },
    {
      "indent": 3,
      "text": "For requests that involve multiple sub-layers below the network layer, requests MUST include (or reference) a discussion of the multiplexing relationships between sub-layers, ideally with a diagram. Various well-written examples exist of such definitions, including Section 3.4.1 of [RFC3637], Section 3.1.1 of [RFC4087], and Section 3.1.1 of [RFC5066].",
      "ja": "ネットワーク層の下に複数のサブレイヤを含む要求については、要求は、基準の上に、理想的にはサブレイヤ間の多重化関係についての議論を含める（または参照）。[RFC3637]のセクション3.4.1、[RFC4087]のセクション3.1.1、および[RFC5066]のセクション3.1.1を含む、そのような定義が存在するさまざまな適切な例が存在します。"
    },
    {
      "indent": 3,
      "text": "Definers of sub-layers and sub-types should consider which model is more appropriate for their needs. A sub-layer is generally used whenever either a dynamic relationship exists (i.e., when the set of instances above or below a given instance can change over time) or a multiplexing relationship exists with another sub-layer. A sub-type can be used when neither of these is true but where one interface type is conceptually a subclass of another interface type, as far as a management data model is concerned.",
      "ja": "サブレイヤーとサブタイプの定義者は、どのモデルがニーズに適しているかを検討する必要があります。サブレイヤは、一般に、動的関係が存在する（すなわち、所与のインスタンスの上または下のインスタンスの上または下のインスタンスが経時的に変化する可能性があるとき）、または多重化関係が他のサブレイヤと共に存在するときはいつでも使用される。サブタイプは、どちらも真実でない場合に使用できますが、管理データモデルに関する限り、1つのインターフェイスタイプは別のインターフェイスタイプのサブクラスである場合に使用できます。"
    },
    {
      "indent": 3,
      "text": "In general, the intent of an interface type or sub-type is that its definition should be sufficient to identify an interoperable protocol. In some cases, however, a protocol might be defined in a way that is not sufficient to provide interoperability with other compliant implementations of that protocol. In such a case, an ifType definition should discuss whether specific instantiations (or profiles) of behavior should use a sub-layer model (e.g., each vendor might layer the protocol over its own sub-layer that provides the missing details) or a sub-type model (i.e., each vendor might subclass the protocol without any layering relationship). If a sub-type model is more appropriate, then the data model for the protocol might include a sub-type identifier so that management software can discover objects specific to the sub-type. In either case, such discussion is important to guide definers of a data model for the more specific information (i.e., a lower sub-layer or a sub-type), as well as the designated expert, who must review requests for any such ifTypes or sub-types.",
      "ja": "一般に、インタフェース型またはサブタイプの意図は、その定義が相互運用可能なプロトコルを識別するのに十分であるべきであることです。しかしながら、場合によっては、プロトコルは、そのプロトコルの他の準拠の実装と相互運用性を提供するのに十分ではない方法で定義され得る。そのような場合、IFTYPE定義は、特定のインスタンス化（またはプロファイル）の動作がサブレイヤモデルを使用するかどうかを議論する必要があります（たとえば、各ベンダーは、欠けている詳細を提供する独自のサブレイヤの上にプロトコルをレイトすることができます）、またはサブ-typeモデル（すなわち、各ベンダは階層化関係なしにプロトコルをサブクラス化するかもしれません）。サブタイプモデルがより適切である場合、プロトコルのデータモデルはサブタイプの識別子を含み、管理ソフトウェアはサブタイプに固有のオブジェクトを発見することができます。いずれの場合も、そのような議論は、より具体的な情報（すなわち、より低いサブレイヤまたはサブタイプ）のためのデータモデルの定義者、ならびに指定された専門家、ならびにそのようなIFタイプの要求を検討する必要がある。またはサブタイプ。"
    },
    {
      "indent": 0,
      "text": "4.1. Alternate Values",
      "section_title": true,
      "ja": "4.1. 代替値"
    },
    {
      "indent": 3,
      "text": "Another design decision is whether to reuse an existing ifType or tunnelType value, possibly using a sub-type or sub-layer model for refinements, or to use a different value for a new mechanism.",
      "ja": "別の設計決定は、既存のIFTYPEまたはTunnelType値を再利用するか、おそらく改良のためにサブタイプまたはサブレイヤモデルを使用するか、新しいメカニズムに異なる値を使用することです。"
    },
    {
      "indent": 3,
      "text": "If there is already an entry that could easily satisfy the modeling and functional requirements for the requested entry, it should be reused so that applications and tools that use the existing value can be used without changes. If, however, the modeling and functional requirements are significantly different enough such that having existing applications and tools use the existing value would be seen as a problem, a new value should be used.",
      "ja": "要求されたエントリのモデリングと機能要件を簡単に満たすことができるエントリがすでにある場合は、既存の値を使用するアプリケーションとツールを変更することなく使用できるように再利用する必要があります。ただし、モデリングと機能要件は、既存のアプリケーションやツールを使用することが既存の値を使用するのに十分に大きく異なる場合、新しい値を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "For example, originally different ifType values were used for different flavors of Ethernet (ethernetCsmacd(6), iso88023Csmacd(7), fastEther(62), etc.), typically because they were registered by different vendors. Using different values was, however, seen as problematic because all were functionally similar, so [RFC3635] then deprecated all but ethernetCsmacd(6).",
      "ja": "たとえば、異なるIFTYPE値は、異なるイーサネット（EtherNetCSMACD（6）、ISO88023CSMACD（7）、停止者（62）など）に使用されていましたが、通常は異なるベンダーによって登録されていました。ただし、すべての値を使用すると、すべてが機能的に類似しているため、[RFC3635]はすべて推奨されていますが、EtherNetCSMACD（6）を廃止しました。"
    },
    {
      "indent": 3,
      "text": "As another example, a udp(8) tunnelType value was defined in [RFC2667] with the description \"The value UDP indicates that the payload packet is encapsulated within a normal UDP packet (e.g., RFC 1234).\" The Teredo tunnel protocol [RFC4380] was later defined and encapsulates packets over UDP, but the protocol model is quite different between [RFC1234] and Teredo. For example, [RFC1234] supports encapsulation of multicast/broadcast traffic, whereas Teredo does not. As such, it would be more confusing to applications and tools to represent them using the same tunnel type, and so [RFC4087] defined a new value for Teredo.",
      "ja": "別の例として、UDP（8）のTUNNLETYPE値が[RFC2667]で説明されています。「値UDPは、ペイロードパケットが通常のUDPパケット内にカプセル化されていることを示します（例えば、RFC 1234）。Teredo Tunnel Protocol [RFC4380]は後で定義され、UDPを介してパケットをカプセル化しましたが、[RFC1234]とTeredoの間でプロトコルモデルはかなり異なります。たとえば、[RFC1234]はマルチキャスト/ブロードキャストトラフィックのカプセル化をサポートしますが、Teredoはそうではありません。そのように、それは同じトンネルタイプを使用してそれらを表すためにアプリケーションとツールを混乱させること、そしてSO [RFC4087]はTEREDOの新しい値を定義します。"
    },
    {
      "indent": 3,
      "text": "In summary, definers of new interface or tunnel mechanisms should use a new ifType or tunnelType value rather than reuse an existing value when key aspects such as the header format or the link model (point-to-point, non-broadcast multi-access, broadcast-capable multi-access, unidirectional broadcast, etc.) are significantly different from existing values, but they should reuse the same value when the differences can be expressed in terms of differing values of existing objects other than ifType/tunnelType in the standard YANG or MIB module.",
      "ja": "要約すると、ヘッダフォーマットやリンクモデルなどの主な側面（ポイントツーポイント、非ブロードキャストマルチアクセス、またはポイントツーポイント、非ブロードキャストマルチアクセス、またはポイントツーポイント、非ブロードキャストマルチアクセス、）ブロードキャスト対応のマルチアクセス、単方向ブロードキャストなど）は既存の値と著しく異なりますが、標準ヤンのIFTYPE / TUNNELTYPE以外の既存のオブジェクトの値の異なる点で表現できる場合は、同じ値を再利用する必要があります。またはMIBモジュール。"
    },
    {
      "indent": 0,
      "text": "5. Available Formats",
      "section_title": true,
      "ja": "5. 利用可能なフォーマット"
    },
    {
      "indent": 3,
      "text": "Many registries are available in multiple formats. For example, XML, HTML, CSV, and plain text are common formats in which many registries are available. This document clarifies that the [IANAifType-MIB], [yang-if-type], and [yang-tunnel-type] MIB and YANG modules are merely additional formats in which the \"Interface Types (ifType)\" and \"Tunnel Types (tunnelType)\" registries are available. The MIB and YANG modules are not separate registries, and the same values are always present in all formats of the same registry.",
      "ja": "多くのレジストリが複数のフォーマットで利用可能です。たとえば、XML、HTML、CSV、およびプレーンテキストは、多くのレジストリが利用可能である一般的なフォーマットです。この文書では、[ianififtype-mib]、[yang-if-type]、[yang-tunnel-type] mibおよびyangモジュールは、「インタフェースタイプ（iftype）」および「トンネルタイプ」という追加のフォーマットであることを明確にしています。TunnelType） \"レジストリが利用可能です。MIBモジュールとYANGモジュールは別々のレジストリではなく、同じレジストリのすべてのフォーマットに同じ値が常に存在します。"
    },
    {
      "indent": 3,
      "text": "The confusion stemmed in part from the fact that the IANA \"Protocol Registries\" [protocol-registries] listed the YANG and MIB module formats separately, as if they were separate registries. However, the entries for the yang-if-type and iana-tunnel-type YANG modules said \"See ifType definitions registry\" and \"See tunnelType registry (mib-2.interface.ifTable.ifEntry.ifType.tunnelType)\" respectively, although the entry for the IANAifType-MIB had no such note. Section 7.1 addresses this.",
      "ja": "混乱は、IANAの「プロトコルレジストリ」[プロトコルレジストリ]が別々のレジストリであるかのように、YANGモジュールフォーマットとMIBモジュールフォーマットを列挙したという事実から部分的に染まった。ただし、Yang-If-Type型およびIANNE-TUNNEL型YANGモジュールのエントリは、「ifType定義レジストリ」と「TunnelType Registry（MIB-2.Interface.iftable.ifentry.Iftype.TunnelType）」を参照してください。IANAIFIFTYPE-MIBのエントリはそのようなメモはありませんでした。セクション7.1にこれに対処します。"
    },
    {
      "indent": 0,
      "text": "6. Registration",
      "section_title": true,
      "ja": "6. 登録"
    },
    {
      "indent": 3,
      "text": "The IANA policy (using terms defined in [RFC8126]) for registration is Expert Review for both interface types and tunnel types. The role of the designated expert in the procedure is to raise possible concerns about wider implications of proposals for use and deployment of interface types. While it is recommended that the responsible Area Director and the IESG take into consideration the designated expert opinions, nothing in the procedure empowers the designated expert to override properly arrived-at IETF or working group consensus.",
      "ja": "登録のためのIANAポリシー（[RFC8126]で定義されている用語を使用）は、インターフェイスタイプとトンネルタイプの両方についてのエキスパートレビューです。手続きの指定された専門家の役割は、インタフェースタイプの使用と展開のための提案のより広い影響について可能な懸念を高めることです。責任ある地域ディレクターとIESGが指定された専門家の意見を考慮することをお勧めしますが、この手続きには、IETFまたはワーキンググループのコンセンサスで適切に到着したことを指定された専門家が指定されていません。"
    },
    {
      "indent": 0,
      "text": "6.1. Procedures",
      "section_title": true,
      "ja": "6.1. 手続き"
    },
    {
      "indent": 3,
      "text": "Someone wishing to register a new ifType or tunnelType value MUST:",
      "ja": "新しいIFTypeまたはTunnelTypeの値を登録したいと思う人は、次のようにしてください。"
    },
    {
      "indent": 3,
      "text": "1. Check the IANA registry to see whether there is already an entry that could easily satisfy the modeling and functional requirements for the requested entry. If there is already such an entry, use it or update the existing specification. Text in an Internet-Draft or part of some permanently available, stable specification may be written to clarify the usage of an existing entry or entries for the desired purpose.",
      "ja": "1. IANAレジストリをチェックして、要求されたエントリのモデリングと機能要件を簡単に満たすことができるエントリがすでにあるかどうかを確認してください。そのようなエントリが既にある場合は、それを使用するか、既存の仕様を更新してください。インターネットドラフトのテキストまたは恒久的に利用可能ないくつかの安定した仕様の一部では、既存のエントリの使用法または目的の目的のためのエントリの使用を明確にするために書かれてもよい。"
    },
    {
      "indent": 3,
      "text": "2. Check the IANA registry to see whether there is already some other entry with the desired name. If there is already an unrelated entry under the desired name, choose a different name.",
      "ja": "2. IANAレジストリを確認して、希望の名前を持つ他のエントリがあるかどうかを確認してください。目的の名前の下にある無関係のエントリがすでにある場合は、別の名前を選択します。"
    },
    {
      "indent": 3,
      "text": "3. Prepare a registration request using the template specified in Section 6.3. The registration request can be contained in an Internet-Draft, submitted alone, or submitted as part of some permanently available, stable specification. The registration request can also be submitted in some other form (as part of another document or as a stand-alone document), but the registration request will be treated as an \"IETF Contribution\" under the guidelines of [RFC5378].",
      "ja": "3. セクション6.3で指定されたテンプレートを使用して登録要求を準備します。登録要求は、インターネットドラフトに含まれ、一人で提出された、または恒久的に利用可能ないくつかの安定した仕様の一部として提出されます。登録要求は、他の形式（別の文書の一部として（別の文書の一部としてもスタンドアロン文書として）提出することもできますが、[RFC5378]のガイドラインの下の「IETFの貢献」として扱われます。"
    },
    {
      "indent": 3,
      "text": "4. Submit the registration request (or pointer to a document containing it) to IANA at iana@iana.org or (if requesting an ifType) via the web form at <https://www.iana.org/form/iftype>.",
      "ja": "4. <https：//www.iana.org/form/form/form/iftype>でWebフォームを介してWebフォームを介してWebフォームを介してWebフォームを介して登録要求（またはそれを含むドキュメントへのポインタ）を送信してください。"
    },
    {
      "indent": 3,
      "text": "Upon receipt of a registration request, the following steps MUST be followed:",
      "ja": "登録要求を受信すると、次の手順に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "1. IANA checks the submission for completeness; if required information is missing or any citations are not correct, IANA will reject the registration request. A registrant can resubmit a corrected request if desired.",
      "ja": "1. IANAは完全性の提出をチェックします。必要な情報が欠落している場合、または引用が正しくない場合、IANAは登録要求を拒否します。必要に応じて登録者が修正要求を再送信することができます。"
    },
    {
      "indent": 3,
      "text": "2. IANA requests Expert Review of the registration request against the corresponding guidelines from this document.",
      "ja": "2. IANAは、この文書の対応するガイドラインに対する登録要求のエキスパートレビューを要求します。"
    },
    {
      "indent": 3,
      "text": "3. The designated expert will evaluate the request against the criteria.",
      "ja": "3. 指定された専門家は、要求を基準に対する評価を評価します。"
    },
    {
      "indent": 3,
      "text": "4. Once the designated expert approves a registration, IANA updates [ifType-registry], [IANAifType-MIB], and [yang-if-type] to show the registration for an interface type, or [tunnelType-registry], [IANAifType-MIB], and [yang-tunnel-type] to show the registration for a tunnel type. When adding values, IANA should verify that the updated MIB module and YANG module formats are syntactically correct before publishing the update. There are various existing tools or websites that can be used to do this verification.",
      "ja": "4. 指定された専門家が登録を承認すると、IANAはインターフェイスタイプの登録を示すために[iftype-registry]、[ianififtype-mib]、[yang-if-type]、または[TunnelType-Registry]、[IANNELTYPY-MIB）を更新します。]トンネルタイプの登録を示すための[yang-tunnel-type]。値を追加するとき、更新を公開する前に、更新されたMIBモジュールとYANGモジュールのフォーマットが構文的に正しいことを確認する必要があります。この検証を行うために使用できるさまざまな既存のツールやWebサイトがあります。"
    },
    {
      "indent": 3,
      "text": "5. If instead the designated expert does not approve registration (e.g., for any of the reasons in [RFC8126], Section 5), a registrant can resubmit a corrected request if desired, or the IESG can override the designated expert and approve it per the process in Section 3.3 of [RFC8126].",
      "ja": "5. 代わりに指定された専門家が登録を承認しない場合（例えば、[RFC8126]、セクション5の理由のいずれにも）、必要に応じて登録者が修正要求を再送信することも、IESGは指定されたエキスパートを上書きし、そのプロセスごとに承認することができます。[RFC8126]の3.3項で。"
    },
    {
      "indent": 0,
      "text": "6.2. Media-Specific OID-Subtree Assignments",
      "section_title": true,
      "ja": "6.2. メディア固有のOIDサブツリー割り当て"
    },
    {
      "indent": 3,
      "text": "[IANAifType-MIB] notes:",
      "ja": "[IANAIFIFTYPE-MIB]注："
    },
    {
      "indent": 3,
      "text": "|  The relationship between the assignment of ifType values and of\n|  OIDs to particular media-specific MIBs is solely the purview of\n|  IANA and is subject to change without notice.  Quite often, a\n|  media-specific MIB's OID-subtree assignment within MIB-II's\n|  'transmission' subtree will be the same as its ifType value.\n|  However, in some circumstances this will not be the case, and\n|  implementors must not pre-assume any specific relationship between\n|  ifType values and transmission subtree OIDs.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The advice above remains unchanged, but this document changes the allocation procedure to streamline the process, so that an ifType value and a transmission number value with the same value will be assigned at the same time.",
      "ja": "上記のアドバイスは変更されていませんが、この文書はプロセスを合理化するための割り当て手順を変更し、同じ値のifType値と送信番号の値が同時に割り当てられます。"
    },
    {
      "indent": 3,
      "text": "Rationale:",
      "ja": "根拠："
    },
    {
      "indent": 3,
      "text": "(1) This saves future effort if a transmission number is later deemed necessary, since no IANA request is needed that would then require another Expert Review.",
      "ja": "（1）IANAの要求が必要ではないため、将来の努力が必要な場合は、IANAの要求が必要なので、将来の努力を節約します。"
    },
    {
      "indent": 3,
      "text": "(2) The transmission numbering space is not scarce, so there seems to be little need to reserve the number for a different purpose than what the ifType is for.",
      "ja": "（2）伝送番号空間は不足していないので、ifTypeが何よりも異なる目的のために数を予約する必要がないようです。"
    },
    {
      "indent": 3,
      "text": "(3) The designated expert need not review whether a transmission number value should be registered when processing each ifType request, thus reducing the possibility of delaying assignment of ifType values.",
      "ja": "（3）指定されたエキスパートは、各ifType要求を処理するときに送信番号値を登録する必要があるかどうかを確認する必要があり、IFTYPE値の割り当てを遅らせる可能性を低下させる必要がある。"
    },
    {
      "indent": 3,
      "text": "(4) There is no case on record where allocating the same value could have caused any problems.",
      "ja": "（4）同じ値を割り当てることができるレコードには問題が発生した場合には、問題がない場合がありません。"
    },
    {
      "indent": 0,
      "text": "6.3. Registration Template",
      "section_title": true,
      "ja": "6.3. 登録テンプレート"
    },
    {
      "indent": 0,
      "text": "6.3.1. ifType",
      "section_title": true,
      "ja": "6.3.1. iftype."
    },
    {
      "indent": 3,
      "text": "The following template describes the fields that MUST be supplied in a registration request suitable for adding to the \"Interface Types (ifType)\" registry:",
      "ja": "次のテンプレートは、「インタフェースタイプ（ifType）」レジストリに追加するのに適した登録要求で指定する必要があるフィールドを説明しています。"
    },
    {
      "indent": 3,
      "text": "Label for IANA ifType requested: As explained in Section 7.1.1 of [RFC2578], a label for a named-number enumeration must consist of one or more letters or digits, up to a maximum of 64 characters, and the initial character must be a lowercase letter. (However, labels longer than 32 characters are not recommended.) Note that hyphens are not allowed.",
      "ja": "IANA ifTypeのラベルが要求されました。小文字。（ただし、32文字を超えるラベルはお勧めできません。）ハイフンは許可されていません。"
    },
    {
      "indent": 3,
      "text": "Name of IANA ifType requested: A short description (e.g., a protocol name) suitable to appear in a comment in the registry.",
      "ja": "IANA IFTYPEの名前要求：レジストリ内のコメントに表示されるのに適した簡単な説明（例えば、プロトコル名）。"
    },
    {
      "indent": 3,
      "text": "Description of the proposed use of the IANA ifType: Requesters MUST include answers, either directly or via a link to a document with the answers, to the following questions in the explanation of the proposed use of the IANA IfType:",
      "ja": "IANA IFTYPEの使用方法の説明：リクエスターには、直接または答えを持つ文書へのリンクを介して、IANA ifTypeの使用済みの使用に関する次の質問に、以下の質問を含める必要があります。"
    },
    {
      "indent": 6,
      "text": "* How would IP run over your ifType?",
      "ja": "* IFTYPEをどのように実行するのでしょうか。"
    },
    {
      "indent": 6,
      "text": "* Would there be another interface sub-layer between your ifType and IP?",
      "ja": "* ifTypeとIPの間に別のインターフェースサブレイヤーがありますか？"
    },
    {
      "indent": 6,
      "text": "* Would your ifType be vendor specific / proprietary? (If so, the label MUST start with a string that shows that. For example, if your company's name or acronym is xxx, then the ifType label would be something like xxxSomeIfTypeLabel.)",
      "ja": "* あなたのiftypeはベンダー固有/プロプライエタリーになりますか？（もしそうなら、ラベルはそれを示す文字列から始める必要があります。たとえば、会社の名前や頭字語がXXXの場合、ifTypeラベルはXXXSomeiftypeLabelのようなものになります。）"
    },
    {
      "indent": 6,
      "text": "* Would your ifType require or allow vendor-specific extensions? If so, would the vendor use their own ifType in a sub-layer below the requested ifType, a sub-type of the ifType, or some other mechanism?",
      "ja": "* iftypeはベンダー固有の拡張機能を要求または許可しますか？もしそうなら、ベンダーは要求されたIFType、IFTypeのサブタイプ、またはその他のメカニズムの下のサブレイヤで独自のifTypeを使用しますか？"
    },
    {
      "indent": 3,
      "text": "Reference, Internet-Draft, or Specification: A link to a document is required.",
      "ja": "参照、インターネットドラフト、または仕様：文書へのリンクが必要です。"
    },
    {
      "indent": 3,
      "text": "Additional information or comments: Optional; any additional comments for IANA or the designated expert.",
      "ja": "追加情報またはコメント：オプション。IANAや指定された専門家のための追加のコメント。"
    },
    {
      "indent": 0,
      "text": "6.3.2. tunnelType",
      "section_title": true,
      "ja": "6.3.2. TunnelType."
    },
    {
      "indent": 3,
      "text": "Prior to this document, no form existed for tunnelType (and new tunnelType requests did not need to use the ifType form that did exist). This document therefore specifies a tunnelType form.",
      "ja": "このドキュメントの前に、TunnelType（および新しいTunnelType要求が存在していたIFTypeフォームを使用する必要はありませんでした）の形式は存在しませんでした。したがって、この文書はTunnelTypeフォームを指定します。"
    },
    {
      "indent": 3,
      "text": "The following template describes the fields that MUST be supplied in a registration request suitable for adding to the \"Tunnel Types (tunnelType)\" registry:",
      "ja": "次のテンプレートは、「トンネルタイプ（TunnelType）」レジストリに追加するのに適した登録要求で指定する必要があるフィールドについて説明しています。"
    },
    {
      "indent": 3,
      "text": "Label for IANA tunnelType requested: As explained in Section 7.1.1 of [RFC2578], a label for a named-number enumeration must consist of one or more letters or digits, up to a maximum of 64 characters, and the initial character must be a lowercase letter. (However, labels longer than 32 characters are not recommended.) Note that hyphens are not allowed.",
      "ja": "IANA TunnelTypeのラベル：[RFC2578]のセクション7.1.1で説明されているように、名前付き番号列挙のラベルは、1つ以上の文字または数字、最大64文字、初期文字である必要があります。小文字。（ただし、32文字を超えるラベルはお勧めできません。）ハイフンは許可されていません。"
    },
    {
      "indent": 3,
      "text": "Name of IANA tunnelType requested: A short description (e.g., a protocol name) suitable to appear in a comment in the registry.",
      "ja": "要求されたIANA TunnelTypeの名前：レジストリ内のコメントに表示されるのに適した簡単な説明（例えば、プロトコル名）。"
    },
    {
      "indent": 3,
      "text": "Description of the proposed use of the IANA tunnelType: Requesters MUST include answers, either directly or via a link to a document with the answers, to the following questions in the explanation of the proposed use of the IANA tunnelType:",
      "ja": "IANA TunnelTypeの提案されている使用方法：リクエスターには、直接または答えを使用して文書へのリンクを介して、IANA TunnelTypeの提案された使用方法の説明において、以下の質問に答えを含める必要があります。"
    },
    {
      "indent": 6,
      "text": "* How would IP run over your tunnelType?",
      "ja": "* IPはどのようにあなたのTunnelTypeを実行しますか？"
    },
    {
      "indent": 6,
      "text": "* Would there be another interface sub-layer between your tunnelType and IP?",
      "ja": "* TunnelTypeとIPの間に別のインターフェイスサブレイヤーがありますか？"
    },
    {
      "indent": 6,
      "text": "* Would your tunnelType be vendor-specific or proprietary? (If so, the label MUST start with a string that shows that. For example, if your company's name or acronym is xxx, then the tunnelType label would be something like xxxSomeTunnelTypeLabel.)",
      "ja": "* あなたのTunneltypeはベンダー固有または所有権になりますか？（もしそうであれば、ラベルはそれを示す文字列から始める必要があります。たとえば、会社の名前や頭字語がXXXの場合、TunnelTypeラベルはXXXSometunnelTypelabelのようなものになるでしょう。）"
    },
    {
      "indent": 6,
      "text": "* Would your tunnelType require or allow vendor-specific extensions? If so, would the vendor use their own tunnelType in a sub-layer below the requested tunnelType, or some sort of sub-type of the tunnelType, or some other mechanism?",
      "ja": "* TunnelTypeはベンダー固有の拡張機能を要求または許可しますか？もしそうなら、ベンダーは要求されたTunnelTypeの下のサブレイヤ、またはある種のサブタイプのサブレイヤ、あるいはその他のメカニズムのサブタイプの独自のTunnelTypeを使用しますか？"
    },
    {
      "indent": 3,
      "text": "Reference, Internet-Draft, or Specification: A link to a document is required.",
      "ja": "参照、インターネットドラフト、または仕様：文書へのリンクが必要です。"
    },
    {
      "indent": 3,
      "text": "Additional information or comments: Optionally any additional comments for IANA or the designated expert.",
      "ja": "追加情報またはコメント：任意選択でIANAや指定された専門家のための追加のコメント。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This entire document is about IANA considerations, but this section discusses actions taken by and to be taken by IANA. There are three registries affected:",
      "ja": "このドキュメント全体はIANAの考慮事項についてですが、このセクションではIANAが取得している行動について説明します。影響を受ける3つのレジストリがあります。"
    },
    {
      "indent": 3,
      "text": "1. Interface Types (ifType) [ifType-registry]: The registration process is updated in Section 6.1, and the template is updated in Section 6.3.1.",
      "ja": "1. インターフェイスタイプ（iftype）[ifType-Registry]：登録プロセスはセクション6.1で更新され、テンプレートは6.3.1項で更新されます。"
    },
    {
      "indent": 3,
      "text": "2. Tunnel Types (tunnelType) [tunnelType-registry]: The registration process is updated in Section 6.1, and the template is updated in Section 6.3.2.",
      "ja": "2. トンネルタイプ（TunnelType）[TunnelType-Registry]：登録プロセスはセクション6.1で更新され、テンプレートは6.3.2項で更新されます。"
    },
    {
      "indent": 3,
      "text": "3. Transmission Number Values [transmission-registry]: The assignment process is updated in Section 6.2.",
      "ja": "3. 送信番号値[送信レジストリ]：割当処理は6.2節で更新されます。"
    },
    {
      "indent": 3,
      "text": "At the time of publication of this document, IANA is unable to perform some of the actions requested below due to limitations of their current platform and toolset. In such cases, IANA is requested to perform these actions as and when the migration to a new platform that would enable these actions is complete.",
      "ja": "この文書の公開時に、現在のプラットフォームやツールセットの制限により、以下に要求されたアクションの一部を実行できません。そのような場合、IANAはこれらの操作を有効にする新しいプラットフォームへの移行としてこれらのアクションを実行するように要求されます。"
    },
    {
      "indent": 0,
      "text": "7.1. MIB and YANG Modules",
      "section_title": true,
      "ja": "7.1. MIBとYangのモジュール"
    },
    {
      "indent": 3,
      "text": "IANA is to complete the following to clarify the relationship between MIB modules, YANG modules, and the relevant registries.",
      "ja": "IANAは、MIBモジュール、YANGモジュール、および関連レジストリの関係を明確にするために以下を完了することです。"
    },
    {
      "indent": 3,
      "text": "1. The following note has been added to the IANAifType-MIB at [protocol-registries]: \"This is one of the available formats of the Interface Types (ifType) and Tunnel Types (tunnelType) registries.\"",
      "ja": "1. [Protocol-Registries]のIANAIFIFTYPE-MIBには、次のメモが追加されました。"
    },
    {
      "indent": 3,
      "text": "2. The note for the iana-if-type YANG module at [protocol-registries] has been updated to read: \"This is one of the available formats of the Interface Types (ifType) registry.\"",
      "ja": "2. [Protocol-Registries]のIANA-IF型YANGモジュールのノートは、「これはインターフェイスタイプ（ifType）レジストリの使用可能な形式の1つです」です。"
    },
    {
      "indent": 3,
      "text": "3. The note for the iana-tunnel-type YANG module at [protocol-registries] has been updated to read: \"This is one of the available formats of the Tunnel Types (tunnelType) registry.\"",
      "ja": "3. [Protocol-Registries]のIANA-TUNNEL-TYPE YANGモジュールのノートは、「これはTunnelType）レジストリの利用可能な形式の1つです。」"
    },
    {
      "indent": 3,
      "text": "4. The new \"Interface Parameters\" category at [protocol-registries] includes entries for \"Interface Types (ifType)\" [ifType-registry], \"Tunnel Types (tunnelType)\" [tunnelType-registry], and \"Transmission Number Values\" [transmission-registry].",
      "ja": "4. [Protocol-Registries]の新しい「インタフェースパラメータ」カテゴリには、「インタフェースタイプ（IFTYPE）」「ifType-registry」、「トンネルタイプ（TunnelType）」[TunnelType-Registry]、および「送信番号値」のエントリが含まれています。 -  registry]。"
    },
    {
      "indent": 3,
      "text": "5. Update the \"Interface Types (ifType)\" registry [ifType-registry] to list MIB [IANAifType-MIB] and YANG [yang-if-type] as Available Formats.",
      "ja": "5. 「Interface Types（ifType）」レジストリ[ifType-registry]を更新して、MIB [IANAIFITYPE-MIB]とヤン[yang-if-type]を使用可能な形式としてリストします。"
    },
    {
      "indent": 3,
      "text": "6. Update the \"Tunnel Types (tunnelType)\" registry [tunnelType-registry] to list MIB [IANAifType-MIB] and YANG [yang-tunnel-type] as Available Formats.",
      "ja": "6. 「トンネルタイプ（TUNNELTYPE）」レジストリ[TUNNELTYPE-RESGIRY]を更新して、MIB [IANNELTYPE-MIB]とヤン[ヤントンネルタイプ]を使用可能な形式としてリストします。"
    },
    {
      "indent": 3,
      "text": "7. Replace the [yang-if-type] page with the YANG module content rather than having a page that claims to have multiple Available Formats.",
      "ja": "7. 1ページを持つと主張するのではなく、「yang-if-type」ページをYangモジュールの内容に置き換えます。"
    },
    {
      "indent": 3,
      "text": "8. Replace the [yang-tunnel-type] page with the YANG module content rather than having a page that claims to have multiple Available Formats.",
      "ja": "8. 1ページの使用方法を持つと主張しているページを持つのではなく、[yang-tunnel-type]ページをYang-Module-Typeのコンテンツに置き換えます。"
    },
    {
      "indent": 3,
      "text": "9. In addition, [IANAifType-MIB] is to be updated as follows:",
      "ja": "9. さらに、[IANAIFIX-MIB]は次のように更新されます。"
    },
    {
      "indent": 8,
      "text": "OLD:",
      "ja": "古い："
    },
    {
      "indent": 8,
      "text": "| Requests for new values should be made to IANA via email | (iana@iana.org).",
      "ja": ""
    },
    {
      "indent": 8,
      "text": "NEW:",
      "ja": "新着："
    },
    {
      "indent": 8,
      "text": "|  Interface types must not be directly added to the IANAifType-\n|  MIB MIB module.  They must instead be added to the \"Interface\n|  Types (ifType)\" registry at [ifType-registry].",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 8,
      "text": "(Note that [yang-if-type] was previously updated with this language.)",
      "ja": "（[yang-if-type]が以前この言語で更新されました。）"
    },
    {
      "indent": 3,
      "text": "10. IANA has added this document as a reference in the \"Interface Types (ifType)\", \"Tunnel Types (tunnelType)\", and \"Transmission Number Values\" registries, as well as the iana-if-type YANG Module, iana-tunnel-type YANG Module, and IANAifType-MIB.",
      "ja": "10. IANAは、この文書を「インターフェイスタイプ（IFTYPE）」、「トンネルタイプ（TUNNELTYPE）」、および「送信番号値」レジストリ、およびIANA-IFタイプのYANGモジュール、IANA-TUNNELEの参照として追加しました。Yang ModuleとIanaiftype-MIBと入力します。"
    },
    {
      "indent": 0,
      "text": "7.2. Transmission Number Assignments",
      "section_title": true,
      "ja": "7.2. 送信番号の割り当て"
    },
    {
      "indent": 3,
      "text": "Per the discussion in Section 6.2, [ifType-registry] has been updated as follows:",
      "ja": "6.2項での議論ごとに、[iftype-registry]は次のように更新されました。"
    },
    {
      "indent": 3,
      "text": "OLD:",
      "ja": "古い："
    },
    {
      "indent": 3,
      "text": "| For every ifType registration, the corresponding transmission | number value should be registered or marked \"Reserved\".",
      "ja": ""
    },
    {
      "indent": 3,
      "text": "NEW:",
      "ja": "新着："
    },
    {
      "indent": 3,
      "text": "| For future ifType assignments, an OID-subtree assignment MIB-II's | 'transmission' subtree will be made with the same value.",
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Similarly, the following change has been made to [transmission-registry]:",
      "ja": "同様に、[Transmission-Registry]に次の変更が加えられました。"
    },
    {
      "indent": 3,
      "text": "OLD:",
      "ja": "古い："
    },
    {
      "indent": 3,
      "text": "| For every transmission number registration, the corresponding | ifType value should be registered or marked \"Reserved\".",
      "ja": ""
    },
    {
      "indent": 3,
      "text": "NEW:",
      "ja": "新着："
    },
    {
      "indent": 3,
      "text": "| For future transmission number assignments, an 'ifType' will be | made with the same value.",
      "ja": ""
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Since this document does not introduce any technology or protocol, there are no security issues to be considered for this document itself.",
      "ja": "この文書ではテクノロジやプロトコルが導入されていないため、この文書そのもので考慮すべきセキュリティ上の問題はありません。"
    },
    {
      "indent": 3,
      "text": "For security considerations related to MIB and YANG modules that expose these values, see Section 9 of [RFC2863], Section 6 of [RFC4087], and Section 3 of [RFC8675].",
      "ja": "これらの値を公開するMIBおよびYANGモジュールに関連するセキュリティ上の考慮事項については、[RFC2863]のセクション9、[RFC4087]のセクション6、および[RFC8675]のセクション3を参照してください。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] BRADNER、S、「RFCSで使用するためのキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https：//www.rfc-editor.org/info/RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, DOI 10.17487/RFC2578, April 1999, <https://www.rfc-editor.org/info/rfc2578>.",
      "ja": "[RFC2578] McCloghrie、K。、ED。、Perkins、D.、Ed。、およびJ.Schoenwaelder、ED。、「管理情報バージョン2（SMIV2）の構造（STD 58）、RFC 2578、DOI 10.17487 / RFC2578、1999年4月、<https：//www.rfc-editor.org/info/rfc2578>。"
    },
    {
      "indent": 3,
      "text": "[RFC2863] McCloghrie, K. and F. Kastenholz, \"The Interfaces Group MIB\", RFC 2863, DOI 10.17487/RFC2863, June 2000, <https://www.rfc-editor.org/info/rfc2863>.",
      "ja": "[RFC2863] McCloghrie、K.およびF.Kastenholz、「Interfaces Group MIB」、RFC 2863、DOI 10.17487 / RFC2863、2000年6月、<https：//www.rfc-editor.org/info/rfc2863>。"
    },
    {
      "indent": 3,
      "text": "[RFC5378] Bradner, S., Ed. and J. Contreras, Ed., \"Rights Contributors Provide to the IETF Trust\", BCP 78, RFC 5378, DOI 10.17487/RFC5378, November 2008, <https://www.rfc-editor.org/info/rfc5378>.",
      "ja": "[RFC5378] Bradner、S。、ED。そして、J.Contras、ED。「権利貢献者は、BCP 78、RFC 5378、DOI 10.17487 / RFC5378、2008年11月、<https：//www.rfc-editor.org/info/rfc5378>。"
    },
    {
      "indent": 3,
      "text": "[RFC8126] Cotton, M., Leiba, B., and T. Narten, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 8126, DOI 10.17487/RFC8126, June 2017, <https://www.rfc-editor.org/info/rfc8126>.",
      "ja": "[RFC8126]綿、M.、Leiba、B.およびT.Narten、「RFCSのIANAに関する考察のためのガイドライン」、BCP 26、RFC 8126、DOI 10.17487 / RFC8126、2017年6月、<HTTPS：// WWW.rfc-editor.org / info / rfc8126>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B、「RFC 2119キーワードの大文字の曖昧さ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https：//www.rfc-editor.org/info/RFC8174>。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[IANAifType-MIB] IANA, \"IANAifType-MIB Definitions\", <http://www.iana.org/assignments/ianaiftype-mib>.",
      "ja": "[IANAIFIFTYPE-MIB] IANA、「IANAIFTYPE-MIB定義」、<http://www.iana.org/ashignments/ianaiftype-mib>。"
    },
    {
      "indent": 3,
      "text": "[ifType-registry] IANA, \"Interface Types (ifType)\", <https://www.iana.org/assignments/smi-numbers>.",
      "ja": "[iftype-registry] IANA、インターフェイスタイプ（ifType） \"、<https：//www.iana.org/assignments/smi-numbers>。"
    },
    {
      "indent": 3,
      "text": "[protocol-registries] IANA, \"Protocol Registries\", <https://www.iana.org/protocols>.",
      "ja": "[プロトコルレジストリ] IANA、「プロトコルレジストリ」、<https：//www.iana.org/protocols>。"
    },
    {
      "indent": 3,
      "text": "[RFC1234] Provan, D., \"Tunneling IPX traffic through IP networks\", RFC 1234, DOI 10.17487/RFC1234, June 1991, <https://www.rfc-editor.org/info/rfc1234>.",
      "ja": "[RFC1234] Devan、D.、「IPネットワークを通るTunneling IPXトラフィック」、RFC 1234、DOI 10.17487 / RFC1234、1991年6月、<https：//www.rfc-editor.org/info/rfc1234>。"
    },
    {
      "indent": 3,
      "text": "[RFC1573] McCloghrie, K. and F. Kastenholz, \"Evolution of the Interfaces Group of MIB-II\", RFC 1573, DOI 10.17487/RFC1573, January 1994, <https://www.rfc-editor.org/info/rfc1573>.",
      "ja": "[RFC1573] McCloghrie、K.およびF.Kastenholz、「MIB-IIのインターフェースグループの進化」、RFC 1573、DOI 10.17487 / RFC1573、1994年1月、<https：//www.rfc-editor.org/info/RFC1573>。"
    },
    {
      "indent": 3,
      "text": "[RFC2667] Thaler, D., \"IP Tunnel MIB\", RFC 2667, DOI 10.17487/RFC2667, August 1999, <https://www.rfc-editor.org/info/rfc2667>.",
      "ja": "[RFC2667] Thaler、D.、「IP Tunnel MIB」、RFC 2667、DOI 10.17487 / RFC2667、1999年8月、<https：//www.rfc-editor.org/info/rfc2667>。"
    },
    {
      "indent": 3,
      "text": "[RFC3635] Flick, J., \"Definitions of Managed Objects for the Ethernet-like Interface Types\", RFC 3635, DOI 10.17487/RFC3635, September 2003, <https://www.rfc-editor.org/info/rfc3635>.",
      "ja": "[RFC3635] Flick、J.、「イーサネット様インタフェースタイプ用の管理対象オブジェクトの定義」、RFC 3635、DOI 10.17487 / RFC3635、2003年9月、<https：//www.rfc-editor.org/info/rfc3635>。"
    },
    {
      "indent": 3,
      "text": "[RFC3637] Heard, C.M., Ed., \"Definitions of Managed Objects for the Ethernet WAN Interface Sublayer\", RFC 3637, DOI 10.17487/RFC3637, September 2003, <https://www.rfc-editor.org/info/rfc3637>.",
      "ja": "[RFC3637]、CM、ED、「イーサネットWANインターフェイスサブレイヤーの管理対象オブジェクトの定義」、RFC 3637、DOI 10.17487 / RFC3637、2003年9月、<https：//www.rfc-editor.org/info/rfc3637>。"
    },
    {
      "indent": 3,
      "text": "[RFC4087] Thaler, D., \"IP Tunnel MIB\", RFC 4087, DOI 10.17487/RFC4087, June 2005, <https://www.rfc-editor.org/info/rfc4087>.",
      "ja": "[RFC4087] Thaler、D.、「IP Tunnel MIB」、RFC 4087、DOI 10.17487 / RFC4087、2005年6月、<https://www.rfc-editor.org/info/rfc4087>。"
    },
    {
      "indent": 3,
      "text": "[RFC4380] Huitema, C., \"Teredo: Tunneling IPv6 over UDP through Network Address Translations (NATs)\", RFC 4380, DOI 10.17487/RFC4380, February 2006, <https://www.rfc-editor.org/info/rfc4380>.",
      "ja": "[RFC4380] Huitema、C.、 \"Teredo：ネットワークアドレス翻訳（NAT）\"、RFC 4380、DOI 10.17487 / RFC4380、2006年2月、<https://www.rfc-editor.org/info/RFC4380>。"
    },
    {
      "indent": 3,
      "text": "[RFC5066] Beili, E., \"Ethernet in the First Mile Copper (EFMCu) Interfaces MIB\", RFC 5066, DOI 10.17487/RFC5066, November 2007, <https://www.rfc-editor.org/info/rfc5066>.",
      "ja": "[RFC5066] Beili、E.、「イーサネット（EFMCU）インターフェースMIB」、RFC 5066、DOI 10.17487 / RFC5066、2007年11月、<https：//www.rfc-editor.org/info/rfc5066>。"
    },
    {
      "indent": 3,
      "text": "[RFC7224] Bjorklund, M., \"IANA Interface Type YANG Module\", RFC 7224, DOI 10.17487/RFC7224, May 2014, <https://www.rfc-editor.org/info/rfc7224>.",
      "ja": "[RFC7224] Bjorklund、M.、「IANAインタフェースタイプヤンモジュール」、RFC 7224、DOI 10.17487 / RFC7224、2014年5月、<https：//www.rfc-editor.org/info/rfc7224>。"
    },
    {
      "indent": 3,
      "text": "[RFC8675] Boucadair, M., Farrer, I., and R. Asati, \"A YANG Data Model for Tunnel Interface Types\", RFC 8675, DOI 10.17487/RFC8675, November 2019, <https://www.rfc-editor.org/info/rfc8675>.",
      "ja": "[RFC8675] Boucadair、M.、Farrer、I。、およびR. ASATI、「トンネルインタフェースタイプのヤンタデータモデル」、RFC 8675、DOI 10.17487 / RFC8675、2019年11月、<https：//www.rfc-編集者.org / info / rfc8675>。"
    },
    {
      "indent": 3,
      "text": "[transmission-registry] IANA, \"Transmission Number Values\", <https://www.iana.org/assignments/smi-numbers>.",
      "ja": "[送信レジストリ] IANA、「送信番号値」、<https://www.iana.org/assignments/smi-numbers>。"
    },
    {
      "indent": 3,
      "text": "[tunnelType-registry] IANA, \"Tunnel Types (tunnelType)\", <https://www.iana.org/assignments/smi-numbers>.",
      "ja": "[TunnelType-Registry] IANA、「トンネルタイプ（TunnelType）」、<https：//www.iana.org/assignments/smi-numbers>。"
    },
    {
      "indent": 3,
      "text": "[yang-if-type] IANA, \"iana-if-type YANG Module\", <http://www.iana.org/assignments/iana-if-type>.",
      "ja": "[Yang-If-Type] IANA、「IANA-IF型ヤンモジュール」、<http://www.iana.org/ashignments/iana-if-type>。"
    },
    {
      "indent": 3,
      "text": "[yang-tunnel-type] IANA, \"iana-tunnel-type YANG Module\", <https://www.iana.org/assignments/iana-tunnel-type>.",
      "ja": "[Yang-Tunnel-Type] IANA、「IANA-TUNNEL-TYPE YANG MODULE」、<https：//www.iana.org/ashignments/iana-tunnel-type>。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者の住所"
    },
    {
      "indent": 3,
      "text": "Dave Thaler Microsoft",
      "ja": "Dave Thaler Microsoft"
    },
    {
      "indent": 3,
      "text": "Email: dthaler@microsoft.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Dan Romascanu Independent",
      "ja": "Dan Romascanu独立しました"
    },
    {
      "indent": 3,
      "text": "Email: dromasca@gmail.com",
      "raw": true,
      "ja": ""
    }
  ]
}