{
  "title": {
    "text": "RFC 8614 - Updated Processing of Control Flags for BGP Virtual Private LAN Service (VPLS)",
    "ja": "RFC 8614 - BGP仮想プライベートLANサービス（VPLS）の制御フラグの更新された処理"
  },
  "number": 8614,
  "created_at": "2019-11-05 16:48:38.356504+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          R. Singh\nRequest for Comments: 8614                                   K. Kompella\nUpdates: 4761                                           Juniper Networks\nCategory: Standards Track                                S. Palislamovic\nISSN: 2070-1721                                                    Nokia\n                                                               June 2019",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Updated Processing of Control Flags for BGP Virtual Private LAN Service (VPLS)",
      "ja": "BGP仮想プライベートLANサービス（VPLS）の制御フラグの更新された処理"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document updates the meaning of the Control Flags field in the \"Layer2 Info Extended Community\" used for BGP Virtual Private LAN Service (VPLS) Network Layer Reachability Information (NLRI) as defined in RFC 4761. This document updates RFC 4761.",
      "ja": "このドキュメントは、RFC 4761で定義されているBGP仮想プライベートLANサービス（VPLS）ネットワーク層到達可能性情報（NLRI）に使用される「Layer2 Info Extended Community」のControl Flagsフィールドの意味を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット標準化過程の文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、Internet Engineering Task Force（IETF）の製品です。 IETFコミュニティのコンセンサスを表しています。 これは公開レビューを受けており、Internet Engineering Steering Group（IESG）による公開が承認されています。 インターネット標準の詳細については、RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8614.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックに関する情報は、https：//www.rfc-editor.org/info/rfc8614で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2019 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2019 IETF Trustおよび文書の著者として特定された人物。 全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78と、この文書の公開日に有効なIETF文書に関するIETFトラストの法的条項（https://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているので、注意深く確認してください。 このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseテキストを含める必要があり、Simplified BSD Licenseに記載されている保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Terminology ................................................3\n2. Problem Description .............................................3\n3. Updated Meaning of Control Flags in the Layer2 Info Extended\n   Community .......................................................3\n   3.1. Control Word (C-Bit) .......................................4\n   3.2. Sequence Flag (S-Bit) ......................................4\n4. Using Point-to-Multipoint (P2MP) LSPs as Transport for\n   BGP VPLS ........................................................5\n5. Illustrative Diagram ............................................6\n6. Treatment of C-Bits and S-Bits in Multihoming Scenarios .........7\n   6.1. Control Word (C-Bit) .......................................7\n   6.2. Sequence Flag (S-Bit) ......................................7\n7. Security Considerations .........................................8\n8. IANA Considerations .............................................8\n9. References ......................................................8\n   9.1. Normative References .......................................8\n   9.2. Informative References .....................................9\nAuthors' Addresses .................................................9",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "\"Virtual Private LAN Service (VPLS) Using BGP for Auto-Discovery and Signaling\" [RFC4761] describes the concepts and signaling for using the Border Gateway Protocol (BGP) to set up a VPLS. It specifies the BGP VPLS Network Layer Reachability Information (NLRI) by which a Provider Edge (PE) router may require other PEs in the same VPLS to include (or not) the Control Word (CW) and sequencing information in VPLS frames sent to this PE.",
      "ja": "「自動検出とシグナリングにBGPを使用する仮想プライベートLANサービス（VPLS）」[RFC4761]は、ボーダーゲートウェイプロトコル（BGP）を使用してVPLSをセットアップするための概念とシグナリングについて説明しています。 プロバイダーエッジ（PE）ルーターが、これに送信されるVPLSフレームにコントロールワード（CW）およびシーケンス情報を含める（または含めない）ために同じVPLS内の他のPEを必要とする場合があるBGP VPLSネットワーク層到達可能性情報（NLRI）を指定します PE。"
    },
    {
      "indent": 3,
      "text": "The use of the CW helps prevent the misordering of IPv4 or IPv6 Pseudowire (PW) traffic over Equal-Cost Multipath (ECMP) paths or Link Aggregation Group (LAG) bundles. [RFC4385] describes the format for the CW that may be used over point-to-point PWs and over a VPLS. Along with [RFC3985], [RFC4385] also describes sequence number usage for VPLS frames.",
      "ja": "CWを使用すると、Equal-Cost Multipath（ECMP）パスまたはLink Aggregation Group（LAG）バンドルを介したIPv4またはIPv6疑似回線（PW）トラフィックの順序の誤りを防ぐことができます。 [RFC4385]は、ポイントツーポイントPWおよびVPLSで使用できるCWの形式について説明しています。 [RFC3985]とともに、[RFC4385]はVPLSフレームのシーケンス番号の使用法についても説明しています。"
    },
    {
      "indent": 3,
      "text": "However, [RFC4761] does not specify the behavior of PEs in a mixed environment where some PEs support CW/sequencing and others do not.",
      "ja": "ただし、[RFC4761]は、一部のPEがCW /シーケンスをサポートし、他のPEがサポートしない混合環境でのPEの動作を指定していません。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology",
      "section_title": true,
      "ja": "1.1. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Problem Description",
      "section_title": true,
      "ja": "2. 問題の説明"
    },
    {
      "indent": 3,
      "text": "[RFC4761] specifies the VPLS BGP NLRI by which a given PE advertises the behavior expected by the multiple PEs participating in the same VPLS. The NLRI indicates the VPLS label that the various PE routers, which are referred to in the NLRI, should use when forwarding VPLS traffic to this PE. Additionally, by using the Control Flags, this PE specifies whether the other PEs (in the same VPLS) should use the CW or sequenced delivery for frames forwarded to this PE. These are indicated by the C-bits and the S-bits, respectively, in the Control Flags, as specified in Section 3.2.4 in [RFC4761].",
      "ja": "[RFC4761]は、特定のPEが同じVPLSに参加している複数のPEによって期待される動作をアドバタイズするVPLS BGP NLRIを指定します。 NLRIは、NLRIで参照されるさまざまなPEルータが、このPEにVPLSトラフィックを転送するときに使用するVPLSラベルを示します。 さらに、制御フラグを使用することにより、このPEは（同じVPLS内の）他のPEがこのPEに転送されるフレームにCWまたはシーケンス配信を使用するかどうかを指定します。 これらは、[RFC4761]のセクション3.2.4で指定されているように、制御フラグのCビットとSビットによってそれぞれ示されます。"
    },
    {
      "indent": 3,
      "text": "[RFC4761] requires that if the advertising PE sets the C-bits and S-bits, the receiving PE MUST, respectively, insert a CW and include sequence numbers when forwarding VPLS traffic to the advertising PE.",
      "ja": "[RFC4761]では、広告PEがCビットとSビットを設定する場合、受信PEはそれぞれCWを挿入し、VPLSトラフィックを広告PEに転送するときにシーケンス番号を含める必要があります。"
    },
    {
      "indent": 3,
      "text": "However, in a BGP VPLS deployment, there would often be cases where a PE receiving the VPLS BGP NLRI may not have the ability to insert a CW or include sequencing information inside PW frames. Thus, the behavior of CW processing and sequencing needs to be further specified.",
      "ja": "ただし、BGP VPLS展開では、VPLS BGP NLRIを受信するPEがCWを挿入したり、PWフレーム内にシーケンス情報を含めることができない場合がよくあります。 したがって、CW処理およびシーケンスの動作をさらに指定する必要があります。"
    },
    {
      "indent": 3,
      "text": "This document updates the meaning of the Control Flags in the Layer2 Info Extended Community in the BGP VPLS NLRI. It also specifies the forwarding behavior for a mixed-mode environment where not every PE in a VPLS has the ability or the configuration to honor the Control Flags received from the PE advertising the BGP NLRI.",
      "ja": "このドキュメントは、BGP VPLS NLRIのレイヤ2情報拡張コミュニティの制御フラグの意味を更新します。 また、VPLSのすべてのPEが、BGP NLRIをアドバタイズするPEから受信した制御フラグを尊重する機能または構成を備えていない混合モード環境の転送動作も指定します。"
    },
    {
      "indent": 0,
      "text": "3. Updated Meaning of Control Flags in the Layer2 Info Extended Community",
      "ja": "3. Layer2 Info拡張コミュニティのコントロールフラグの意味を更新"
    },
    {
      "indent": 3,
      "text": "[RFC4761] does not allow for the CW setting to be negotiated. In a typical implementation, if a PE sets the C-bit, it expects to receive VPLS frames with a CW and will send frames the same way. If the PEs at the two ends of a PW do not agree on the setting of the C-bit, the PW does not come up. The behavior is similar for the S-bit.",
      "ja": "[RFC4761]では、CW設定をネゴシエートできません。 典型的な実装では、PEがCビットを設定する場合、CWでVPLSフレームを受信することを期待し、同じ方法でフレームを送信します。 PWの両端のPEがCビットの設定に同意しない場合、PWは起動しません。 動作はSビットでも同様です。"
    },
    {
      "indent": 3,
      "text": "This memo updates the meaning of the C-bit and the S-bit in the Control Flags.",
      "ja": "このメモは、制御フラグのCビットとSビットの意味を更新します。"
    },
    {
      "indent": 0,
      "text": "3.1. Control Word (C-Bit)",
      "section_title": true,
      "ja": "3.1. 制御ワード（Cビット）"
    },
    {
      "indent": 3,
      "text": "If a PE sets the C-bit in its NLRI, it means that the PE has the ability to send and receive frames with a CW.",
      "ja": "PEがNLRIにCビットを設定する場合、PEにはCWでフレームを送受信する機能があることを意味します。"
    },
    {
      "indent": 3,
      "text": "- If the PEs at both ends of a PW set the C-bit, CWs MUST be used in both directions of the PW.",
      "ja": "- PWの両端のPEがCビットを設定する場合、PWの両方向でCWを使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "- If both PEs send a C-bit of 0, CWs MUST NOT be used on the PW.",
      "ja": "- 両方のPEが0のCビットを送信する場合、PWでCWを使用してはなりません。"
    },
    {
      "indent": 3,
      "text": "These two cases behave as before.",
      "ja": "これら2つのケースは以前と同様に動作します。"
    },
    {
      "indent": 3,
      "text": "However, if the PEs at both ends of the PW do not agree on the setting of the C-bit, CWs MUST NOT be used in either direction on that PW, but the PW MUST NOT be prevented from coming up due to this mismatch. So, the PW will still come up but will not use the CW in either direction. This behavior is changed from the behavior described in [RFC4761] where the PW does not come up.",
      "ja": "ただし、PWの両端のPEがCビットの設定に同意しない場合、CWはそのPWのどちらの方向にも使用してはなりません（MUST NOT）が、この不一致のためにPWが立ち上がるのを防ぐことはできません。 そのため、PWは引き続き起動しますが、どちらの方向でもCWを使用しません。 この動作は、PWが起動しない[RFC4761]で説明されている動作から変更されています。"
    },
    {
      "indent": 0,
      "text": "3.2. Sequence Flag (S-Bit)",
      "section_title": true,
      "ja": "3.2. シーケンスフラグ（Sビット）"
    },
    {
      "indent": 3,
      "text": "If a PE sets the S-bit in its NLRI, it means that the PE has the ability to set sequence numbers as described in Section 4.1 in [RFC4385] and process sequence numbers as described in Section 4.2 in [RFC4385].",
      "ja": "PEがNLRIでSビットを設定する場合、[RFC4385]のセクション4.1で説明されているようにシーケンス番号を設定し、[RFC4385]のセクション4.2で説明されているようにシーケンス番号を処理できます。"
    },
    {
      "indent": 3,
      "text": "- If the PEs at both ends of a PW set the S-bit, non-zero sequence numbers MUST be used in both directions of the PW.",
      "ja": "- PWの両端のPEがSビットを設定する場合、PWの両方向でゼロ以外のシーケンス番号を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "- If both PEs send an S-bit of 0, sequence numbers MUST NOT be used on the PW.",
      "ja": "- 両方のPEがSビット0を送信する場合、PWでシーケンス番号を使用してはなりません（MUST NOT）。"
    },
    {
      "indent": 3,
      "text": "These two cases behave as before.",
      "ja": "これら2つのケースは以前と同様に動作します。"
    },
    {
      "indent": 3,
      "text": "[RFC4761] does not allow for the S-bit setting to be negotiated either. In a typical implementation, if the PE sets the S-bit in the advertised NLRI, it expects to receive VPLS frames with non-zero sequence numbers and will send outgoing frames over the PW with non-zero sequence numbers.",
      "ja": "[RFC4761]では、Sビット設定のネゴシエーションも許可されていません。 典型的な実装では、PEがアドバタイズされたNLRIでSビットを設定する場合、非ゼロシーケンス番号を持つVPLSフレームを受信し、非ゼロシーケンス番号を持つPW経由で発信フレームを送信します。"
    },
    {
      "indent": 3,
      "text": "This memo further specifies the expected behavior when the PEs at the ends of the PW advertise differing S-bit values. If the PEs at both ends of the PW do not agree on the setting of the S-bit, then the PW SHOULD NOT come up. This is to avoid running into out-of-sequence ordering scenarios when the multiple PEs that are enabling multihoming for a site have differing S-bit advertisements as described in Section 4.2 in [RFC4385]. However, if a deployment is known to not utilize multihoming, a user-configurable way to override this recommendation MAY be provided by an implementation whereby the PW is allowed to come up. In that case, the PE advertising the S-bit as 0 should set sequence numbers in the frames as 0, and the PW receiving the frames should not expect to receive non-zero sequence numbers.",
      "ja": "このメモは、PWの端にあるPEが異なるSビット値をアドバタイズするときの予想される動作をさらに指定します。 PWの両端のPEがSビットの設定に同意しない場合、PWは起動しません。 これは、[RFC4385]のセクション4.2で説明されているように、サイトのマルチホーミングを有効にしている複数のPEが異なるSビットアドバタイズメントを持っている場合に、順序が正しくないシナリオに陥ることを避けるためです。 ただし、展開がマルチホーミングを使用しないことがわかっている場合は、PWの起動を許可する実装によって、この推奨事項をオーバーライドするユーザー構成可能な方法が提供される場合があります。 その場合、Sビットを0としてアドバタイズするPEは、フレームのシーケンス番号を0に設定し、フレームを受信するPWは、非ゼロのシーケンス番号を受信することを予期してはなりません。"
    },
    {
      "indent": 0,
      "text": "4. Using Point-to-Multipoint (P2MP) LSPs as Transport for BGP VPLS",
      "section_title": true,
      "ja": "4. BGP VPLSのトランスポートとしてポイントツーマルチポイント（P2MP）LSPを使用する"
    },
    {
      "indent": 3,
      "text": "BGP VPLS can be used over point-to-point Label Switched Paths (LSPs) acting as transport between the VPLS PEs. Alternately, BGP VPLS may also be used over Point-to-Multipoint (P2MP) LSPs with the source of the P2MP LSP rooted at the PE advertising the VPLS BGP NLRI.",
      "ja": "BGP VPLSは、VPLS PE間のトランスポートとして機能するポイントツーポイントラベルスイッチドパス（LSP）で使用できます。 また、BGP VPLSは、VPLS BGP NLRIをアドバタイズするPEをルートとするP2MP LSPのソースを使用して、ポイントツーマルチポイント（P2MP）LSPで使用することもできます。"
    },
    {
      "indent": 3,
      "text": "In a network that uses P2MP LSPs as transport for a VPLS, there may be some PEs that support the CW while others may not. The behavior is similar for the sequencing of VPLS frames.",
      "ja": "P2MP LSPをVPLSのトランスポートとして使用するネットワークでは、CWをサポートするPEとサポートしないPEが存在する場合があります。 動作は、VPLSフレームのシーケンスについても同様です。"
    },
    {
      "indent": 3,
      "text": "In such a setup, a source PE that supports CW should set up two different P2MP LSPs such that:",
      "ja": "このようなセットアップでは、CWをサポートするソースPEは、次のように2つの異なるP2MP LSPをセットアップする必要があります。"
    },
    {
      "indent": 3,
      "text": "- One P2MP LSP will transport CW-marked frames to those PEs that advertised the C-bit as 1.",
      "ja": "- 1つのP2MP LSPは、Cビットを1としてアドバタイズしたPEにCWマーク付きフレームを転送します。"
    },
    {
      "indent": 3,
      "text": "- The other P2MP LSP will transport frames without the CW to those PEs that advertised the C-bit as 0.",
      "ja": "- 他のP2MP LSPは、CビットなしでCビットを0としてアドバタイズしたPEにフレームを転送します。"
    },
    {
      "indent": 3,
      "text": "Using two different P2MP LSPs to deliver frames with and without the CW to different PEs ensures that a P2MP root PE honors the C-bit advertised by the other P2MP PEs.",
      "ja": "2つの異なるP2MP LSPを使用して、CWのあるフレームとCWのないフレームを異なるPEに配信すると、P2MPルートPEが他のP2MP PEによってアドバタイズされたCビットを確実に受け渡します。"
    },
    {
      "indent": 3,
      "text": "However, the set of leaves on the two P2MP LSPs (rooted at the given PE) MUST NOT contain any PEs that advertised a value for the S-bit different from what the root PE itself is advertising. PEs that advertised their S-bit values differently (from what the P2MP root PE advertised) will not be on either of the P2MP LSPs. This ensures that the P2MP root PE is sending VPLS frames only to those PEs that agree on the setting of the S-bit.",
      "ja": "ただし、2つのP2MP LSPのリーフのセット（特定のPEをルートとする）には、ルートPE自体がアドバタイズするものとは異なるSビットの値をアドバタイズするPEを含めることはできません。 （P2MPルートPEがアドバタイズしたものとは）異なるSビット値をアドバタイズしたPEは、P2MP LSPのいずれにもありません。 これにより、P2MPルートPEは、Sビットの設定に同意するPEにのみVPLSフレームを送信します。"
    },
    {
      "indent": 3,
      "text": "The ingress router for the P2MP LSP should send separate NLRIs for the cases of using the CW and for not using the CW.",
      "ja": "P2MP LSPの入力ルーターは、CWを使用する場合と使用しない場合に別々のNLRIを送信する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Illustrative Diagram",
      "section_title": true,
      "ja": "5. 説明図"
    },
    {
      "indent": 7,
      "text": "                                                   -----\n                                                  /  A1 \\\n    ----                                     ____CE1     |\n   /    \\          --------       --------  /    |       |\n  |  A2 CE2-      /        \\     /        PE1     \\     /\n   \\    /   \\    /          \\___/          | \\     -----\n    ----     ---PE2                        |  \\\n                |                          |   \\   -----\n                | Service Provider Network |    \\ /     \\\n                |                          |     CE5  A5\n                |            ___           |   /  \\     /\n                 \\          /   \\         PE4_/    -----\n                 PE3       /     \\       /\n         |------/  \\-------       -------\n  ----  /   |    ----\n /    \\/    \\   /    \\               CE = Customer Edge Device\n|  A3 CE3    --CE4 A4 |              PE = Provider Edge Router\n \\    /         \\    /\n  ----           ----                A<n> = Customer site n",
      "raw": true
    },
    {
      "indent": 24,
      "text": "Figure 1: Example of a VPLS",
      "ja": "図1：VPLSの例"
    },
    {
      "indent": 3,
      "text": "In the above topology, let there be a VPLS configured with the PEs as displayed. Let PE1 be the PE under consideration that is CW enabled and sequencing enabled. Let PE2 and PE3 also be CW enabled and sequencing enabled. Let PE4 not be CW enabled or have the ability to include sequence numbers. PE1 will advertise a VPLS BGP NLRI, containing the C/S-bits marked as 1. PE2 and PE3, on learning of the NLRI from PE1, will include the CW and non-zero sequence numbers in the VPLS frames being forwarded to PE1 as described in Section 4 in [RFC4385]. However, PE4, which does not have the ability to include a CW or include non-zero sequence numbers, will not.",
      "ja": "上記のトポロジでは、表示されているようにPEで構成されたVPLSがあります。 PE1を、CWが有効でシーケンスが有効である考慮中のPEとします。 PE2とPE3もCW対応で、シーケンス対応です。 PE4をCW対応にしたり、シーケンス番号を含めることができないようにします。 PE1は、1とマークされたC / Sビットを含むVPLS BGP NLRIをアドバタイズします。PE1からNLRIを学習すると、PE2とPE3は、PE1に転送されるVPLSフレームにCWと非ゼロシーケンス番号を含めます。 [RFC4385]のセクション4で説明されています。 ただし、CWを含めることも0以外のシーケンス番号を含めることもできないPE4にはありません。"
    },
    {
      "indent": 3,
      "text": "As per [RFC4761], PE1 would expect all other PEs to forward CW-containing frames that have non-zero sequence numbers. That expectation cannot be met by PE4 in this example. Thus, as per [RFC4761], the PW between PE1 and PE4 does not come up.",
      "ja": "[RFC4761]に従って、PE1は他のすべてのPEが、ゼロ以外のシーケンス番号を持つCWを含むフレームを転送することを期待します。 この例では、PE4がその期待に応えることはできません。 したがって、[RFC4761]に従って、PE1とPE4の間のPWはアップしません。"
    },
    {
      "indent": 3,
      "text": "However, this document addresses how an implementation should support BGP VPLS in a network where a subset of the BGP VPLS PEs support the CW and/or frame sequencing. PE1 will not bring up the PW with PE4 due to the S-bit mismatch, unless overridden by local configuration on PE1 and PE4 as specified in Section 3.2. If PE4 instead was to advertise a C-bit of 0 and an S-bit of 1, then the PW between PE1 and PE4 would come up despite the CW mismatch. Additionally, PE1 would set up its data plane such that it will strip the CW only for those VPLS frames that are received from PEs that have indicated their desire to receive CW-marked frames. So, PE1 will set up its data plane to strip the CW only for VPLS frames received from PE2 and PE3, and it will expect to process PW frames containing non-zero sequence numbers as described in Section 4.2 in [RFC4385]. PE1 will set up its data plane to not strip the CW from frames received from PE4, and it would expect PE4 to send frames with non-zero sequence numbers. All frames sent by PE4 to PE1 over the PW would have a non-zero sequence number.",
      "ja": "ただし、このドキュメントでは、実装がBGP VPLS PEのサブセットがCWやフレームシーケンスをサポートするネットワークでBGP VPLSをサポートする方法について説明します。セクション3.2で指定されているPE1およびPE4のローカル設定によって上書きされない限り、PE1はSビットの不一致のためにPE4でPWを起動しません。 PE4が代わりに0のCビットと1のSビットをアドバタイズする場合、PE1とPE4間のPWは、CWの不一致にもかかわらず発生します。さらに、PE1は、CWマーク付きフレームを受信することを希望しているPEから受信したVPLSフレームに対してのみCWを除去するようにデータプレーンをセットアップします。したがって、PE1はデータプレーンをセットアップして、PE2およびPE3から受信したVPLSフレームに対してのみCWを除去し、[RFC4385]のセクション4.2で説明されているように、非ゼロシーケンス番号を含むPWフレームを処理します。 PE1は、PE4から受信したフレームからCWを除去しないようにデータプレーンをセットアップし、PE4がゼロ以外のシーケンス番号を持つフレームを送信することを期待します。 PWを介してPE4からPE1に送信されるすべてのフレームには、ゼロ以外のシーケンス番号が付けられます。"
    },
    {
      "indent": 0,
      "text": "6. Treatment of C-Bits and S-Bits in Multihoming Scenarios",
      "section_title": true,
      "ja": "6. マルチホーミングシナリオでのCビットとSビットの処理"
    },
    {
      "indent": 0,
      "text": "6.1. Control Word (C-Bit)",
      "section_title": true,
      "ja": "6.1. 制御ワード（Cビット）"
    },
    {
      "indent": 3,
      "text": "In a multihomed environment, different PEs may effectively represent the same service destination endpoint. It could be assumed that the end-to-end PW establishment process should follow the same rules when it comes to CW requirements, meaning that setting the C-bit would be enforced equally toward both primary and backup designated forwarders.",
      "ja": "マルチホーム環境では、異なるPEが同じサービス宛先エンドポイントを効果的に表す場合があります。 エンドツーエンドのPW確立プロセスは、CW要件に関しては同じルールに従う必要があります。つまり、Cビットの設定は、プライマリとバックアップの両方の指定フォワーダーに等しく適用されます。"
    },
    {
      "indent": 3,
      "text": "However, in the multihoming case, each PW SHOULD be evaluated independently. Assuming the network topology specified in Section 5, there could be the case where the PW between PE2 and PE1 could have the CW signaled via the extended community and would be used in the VPLS frame, while the PE2-to-PE4 PW would not insert the CW in the VPLS frame due to a C-bit mismatch. The multihoming behavior of the rest of the PEs should simply follow the rules specified in [VPLS-MULTIHOMING].",
      "ja": "ただし、マルチホーミングの場合、各PWは独立して評価される必要があります。 セクション5で指定されたネットワークトポロジを想定すると、PE2とPE1の間のPWが拡張コミュニティを介してCWにシグナリングされ、VPLSフレームで使用され、PE2-to-PE4 PWが挿入されない場合があります Cビットの不一致によるVPLSフレームのCW。 残りのPEのマルチホーミング動作は、[VPLS-MULTIHOMING]で指定されたルールに従うだけである必要があります。"
    },
    {
      "indent": 0,
      "text": "6.2. Sequence Flag (S-Bit)",
      "section_title": true,
      "ja": "6.2. シーケンスフラグ（Sビット）"
    },
    {
      "indent": 3,
      "text": "In a multihomed environment, different PEs may effectively represent the same service destination endpoint. In this case, the rules for end-to-end PW establishment SHOULD follow the same behavior as that described in Section 3.2 when it comes to S-bit requirements. Consider the case described in Section 5 with CE5 having a connection to multiple PEs (multihomed) to PE4 and PE1. The PW's behavior is similar to that for the CW scenario such that the S-bit evaluation SHOULD be independent per PW. So, in the case where PE4 does not set the S-bit in its advertised NLRI, there is an S-bit mismatch between PE1 and PE4. This mismatch prevents the PW establishment between PE1 and PE4. So, only one PW -- between PE1 and PE2 -- would be established for the multihomed site shown. Thus, even though CE5 is physically multihomed, due to PE4's lack of support for sending frames with non-zero sequence numbers, there would be no PW between PE2 and PE4. CE5 would effectively not be multihomed.",
      "ja": "マルチホーム環境では、異なるPEが同じサービス宛先エンドポイントを効果的に表す場合があります。 この場合、エンドツーエンドPW確立の規則は、Sビット要件に関してはセクション3.2で説明されているのと同じ動作に従う必要があります。 セクション5で説明した、CE4がPE4とPE1に複数のPE（マルチホーム）に接続している場合を考えてみましょう。 PWの動作はCWシナリオの動作に似ており、Sビット評価はPWごとに独立している必要があります。 そのため、PE4がアドバタイズされたNLRIでSビットを設定しない場合、PE1とPE4の間にSビットの不一致があります。 この不一致により、PE1とPE4間のPWの確立が妨げられます。 したがって、示されているマルチホームサイトに対して、PE1とPE2の間の1つのPWのみが確立されます。 したがって、CE5は物理的にマルチホームですが、非ゼロのシーケンス番号を持つフレームを送信するためのPE4のサポートがないため、PE2とPE4の間にPWはありません。 CE5は、事実上マルチホーム化されません。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document updates the behavior specified in [RFC4761]. The security considerations discussed in [RFC4761] apply. This document essentially addresses BGP VPLS behavior for PEs when the C-bit value, the S-bit value, or both values advertised by a given PE are different from what another PE in the VPLS is advertising. Any bit-flipping media errors leading to causing this mismatch of C/S-bits between PEs do not adversely affect the availability of the PWs. Rather, they cause CWs to not be used or cause the NLRI-advertising PE to not expect non-zero sequenced frames, for the C-bit and the S-bit, respectively, being mismatched across PEs. This is no worse than the previous behavior where any bit-flipping media errors leading to a mismatch of the C/S-bits between PEs would cause the PW to not come up.",
      "ja": "このドキュメントは、[RFC4761]で指定された動作を更新します。 [RFC4761]で説明されているセキュリティの考慮事項が適用されます。 このドキュメントは、特定のPEによってアドバタイズされるCビット値、Sビット値、または両方の値がVPLS内の別のPEがアドバタイズするものと異なる場合のPEのBGP VPLS動作に本質的に対処します。 PE間のC / Sビットのこの不一致の原因となるビットフリップメディアエラーは、PWの可用性に悪影響を及ぼしません。 むしろ、CWが使用されないか、NLRIアドバタイズPEが非ビットシーケンスフレームを予期せず、PE全体でCビットとSビットがそれぞれ不一致になります。 これは、PE間のC / Sビットの不一致につながるビットフリッピングメディアエラーが原因でPWが起動しない以前の動作よりも悪くはありません。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document has no IANA actions.",
      "ja": "このドキュメントにはIANAアクションがありません。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S.、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC4761] Kompella, K., Ed. and Y. Rekhter, Ed., \"Virtual Private LAN Service (VPLS) Using BGP for Auto-Discovery and Signaling\", RFC 4761, DOI 10.17487/RFC4761, January 2007, <https://www.rfc-editor.org/info/rfc4761>.",
      "ja": "[RFC4761] Kompella、K.、Ed。 およびY. Rekhter、Ed。、「自動検出およびシグナリングにBGPを使用する仮想プライベートLANサービス（VPLS）」、RFC 4761、DOI 10.17487 / RFC4761、2007年1月、<https://www.rfc-editor.org/ info / rfc4761>。"
    },
    {
      "indent": 3,
      "text": "[RFC4385] Bryant, S., Swallow, G., Martini, L., and D. McPherson, \"Pseudowire Emulation Edge-to-Edge (PWE3) Control Word for Use over an MPLS PSN\", RFC 4385, DOI 10.17487/RFC4385, February 2006, <https://www.rfc-editor.org/info/rfc4385>.",
      "ja": "[RFC4385]ブライアント、S。、スワロー、G。、マティーニ、L。、およびD.マクファーソン、「MPLS PSNを介した使用のための疑似回線エミュレーションエッジツーエッジ（PWE3）制御ワード」、RFC 4385、DOI 10.17487 / RFC4385、2006年2月、<https://www.rfc-editor.org/info/rfc4385>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC3985] Bryant, S., Ed. and P. Pate, Ed., \"Pseudo Wire Emulation Edge-to-Edge (PWE3) Architecture\", RFC 3985, DOI 10.17487/RFC3985, March 2005, <https://www.rfc-editor.org/info/rfc3985>.",
      "ja": "[RFC3985]ブライアント、S。、エド。 およびP. Pate、Ed。、「疑似ワイヤエミュレーションエッジツーエッジ（PWE3）アーキテクチャ」、RFC 3985、DOI 10.17487 / RFC3985、2005年3月、<https://www.rfc-editor.org/info/rfc3985 >。"
    },
    {
      "indent": 3,
      "text": "[VPLS-MULTIHOMING] Kothari, B., Kompella, K., Henderickx, W., Balus, F., and J. Uttaro, \"BGP based Multi-homing in Virtual Private LAN Service\", Work in Progress, draft-ietf-bess-vpls-multihoming-03, March 2019.",
      "ja": "[VPLS-MULTIHOMING] Kothari、B.、Kompella、K.、Henderickx、W.、Balus、F。、およびJ. Uttaro、「仮想プライベートLANサービスにおけるBGPベースのマルチホーミング」、Work in Progress、draft-ietf -bess-vpls-multihoming-03、2019年3月。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Ravi Singh Juniper Networks 1133 Innovation Way Sunnyvale, CA 94089 United States of America",
      "ja": "Ravi Singh Juniper Networks 1133 Innovation Wayサニーベール、カリフォルニア州94089アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: ravis@juniper.net",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Kireeti Kompella Juniper Networks 1133 Innovation Way Sunnyvale, CA 94089 United States of America",
      "ja": "Kireeti Kompella Juniper Networks 1133 Innovation Way Sunnyvale、CA 94089アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: kireeti@juniper.net",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Senad Palislamovic Nokia 600 Mountain Avenue Murray Hill, NJ 07974-0636 United States of America",
      "ja": "Senad Palislamovic Nokia 600 Mountain Avenue Murray Hill、NJ 07974-0636アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: Senad.palislamovic@nokia.com",
      "raw": true
    }
  ]
}
