{
  "title": {
    "text": "RFC 8381 - Transparent Interconnection of Lots of Links (TRILL): Vendor-Specific RBridge Channel Protocol",
    "ja": "RFC 8381 - リンクの多くの透明な相互接続（TRILL）：ベンダー固有のRBridgeチャネルプロトコル"
  },
  "number": 8381,
  "created_at": "2019-11-02 08:22:02.564453+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                   D. Eastlake 3rd\nRequest for Comments: 8381                                         Y. Li\nCategory: Standards Track                                         W. Hao\nISSN: 2070-1721                                                   Huawei\n                                                             A. Banerjee\n                                                                   Cisco\n                                                                May 2018",
      "raw": true
    },
    {
      "indent": 9,
      "text": "Transparent Interconnection of Lots of Links (TRILL):\n       Vendor-Specific RBridge Channel Protocol",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "The IETF TRILL (Transparent Interconnection of Lots of Links) protocol is implemented by devices called TRILL switches or RBridges (Routing Bridges). TRILL includes a general mechanism, called an RBridge Channel, for the transmission of typed messages between RBridges in the same campus and between RBridges and end stations on the same link. This document specifies a method to send vendor-specific messages over the RBridge Channel facility.",
      "ja": "IETF TRILLプロトコル（リンクの多くの透明相互接続）はTRILLスイッチまたはRBridges（ルーティングブリッジ）と呼ばれる装置によって実現されます。 TRILLは、同じキャンパス内と同じリンク上RBridgesおよびエンドステーション間RBridges間の型指定されたメッセージの伝送のためのRBridgeチャンネルと呼ばれる一般的な機構を備えています。この文書では、RBridgeチャンネル施設の上に、ベンダー固有のメッセージを送信する方法を指定します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8381.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttps://www.rfc-editor.org/info/rfc8381で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2018 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2018 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（https://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n   1.1. Terminology and Acronyms ...................................3\n2. Vendor Channel Packet Format ....................................3\n3. Vendor Channel Errors ...........................................6\n   3.1. Sending an Error Response ..................................7\n4. IANA Considerations .............................................9\n5. Security Considerations .........................................9\n6. References .....................................................10\n   6.1. Normative References ......................................10\n   6.2. Informative References ....................................10\nAuthors' Addresses ................................................11",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The IETF TRILL (Transparent Interconnection of Lots of Links) protocol [RFC6325] [RFC7780] is implemented by devices called TRILL switches or RBridges (Routing Bridges). It provides efficient least-cost transparent routing in multi-hop networks with arbitrary topologies and link technologies, using link-state routing and a hop count.",
      "ja": "IETF TRILL（リンクの多くの透明相互接続）プロトコル[RFC6325]、[RFC7780] TRILLスイッチまたはRBridges（ルーティングブリッジ）と呼ばれる装置によって実現されます。これは、リンクステートルーティングホップカウントを使用して、任意のトポロジ及びリンク技術とマルチホップネットワークにおける効率的な最小コスト透明なルーティングを提供します。"
    },
    {
      "indent": 3,
      "text": "The TRILL protocol includes an RBridge Channel facility [RFC7178] to support typed message transmission between RBridges in the same campus and between RBridges and end stations on the same link. This document specifies a method of sending messages specified by a particular organization, indicated by OUI (Organizationally Unique Identifier) [RFC7042] or CID (Company Identifier) [802], over the RBridge Channel facility. Such organization-specific messages could, for example, be used for vendor-specific diagnostic or control messages.",
      "ja": "TRILLプロトコルは同じキャンパスに、同一リンク上RBridgesとエンドステーションとの間RBridges間型付きメッセージの送信をサポートするためにRBridgeチャネル施設[RFC7178]を含みます。この文書では、RBridgeチャネル設備上、OUI（組織固有識別子）[RFC7042]またはCID（会社識別子）で示される特定の組織、[802]によって指定されたメッセージを送信する方法を指定します。そのような組織特異的なメッセージは、例えば、ベンダー固有の診断又は制御メッセージのために使用することができます。"
    },
    {
      "indent": 3,
      "text": "However, note that a range of RBridge Channel protocol numbers are available based on RFC publication. Those intending to use the RBridge Channel facility are encouraged to document their use in an RFC and to use RBridge Channel protocol numbers based on such RFC publication.",
      "ja": "しかし、RBridgeチャネルプロトコル番号の範囲は、RFCの公表に基づいて利用可能であることに注意してください。 RBridgeチャンネル機能を使用しようとするものは、RFCでの使用を文書化し、このようなRFCの公表に基づき、RBridgeチャネルプロトコル番号を使用することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "1.1. Terminology and Acronyms",
      "section_title": true,
      "ja": "1.1. 用語と略語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 3,
      "text": "This document uses the acronyms defined in [RFC6325] supplemented by the following additional acronyms:",
      "ja": "このドキュメントは、以下の追加の頭字語で補足[RFC6325]で定義された頭字語を使用しています。"
    },
    {
      "indent": 3,
      "text": "CID - Company Identifier [802]",
      "ja": "CID  - 会社識別子[802]"
    },
    {
      "indent": 3,
      "text": "FGL - Fine-Grained Labeling",
      "ja": "FGL  - ファイングレインラベリング"
    },
    {
      "indent": 3,
      "text": "OUI - Organizationally Unique Identifier [RFC7042]",
      "ja": "YES  - 組織固有識別子[RFC7042]"
    },
    {
      "indent": 3,
      "text": "TRILL switch - An alternative term for an RBridge",
      "ja": "TRILLスイッチ -  RBridgeのための代替用語"
    },
    {
      "indent": 0,
      "text": "2. Vendor Channel Packet Format",
      "section_title": true,
      "ja": "2.ベンダーチャネルパケットのフォーマット"
    },
    {
      "indent": 3,
      "text": "The general structure of an RBridge Channel packet on a link between TRILL switches (RBridges) is shown in Figure 1 below. When an RBridge Channel message is sent between an RBridge and an end station on the same link, in either direction, it is called a Native RBridge Channel message and the TRILL Header (including the Inner Ethernet Addresses and Data Label area) is omitted as shown in Figure 2. The type of RBridge Channel packet is given by a Protocol field in the RBridge Channel Header that indicates how to interpret the Channel-Protocol-Specific Payload. See [RFC7178].",
      "ja": "TRILLスイッチ（RBridges）との間のリンク上のRBridgeチャネルパケットの一般的構造は、以下の図1に示されています。 RBridgeチャネルメッセージはRBridgeと同じリンク上のエンドステーション間で送信されるときに示されるように、いずれかの方向に、省略されている（内部イーサネット・アドレスとデータ・ラベル領域を含む）ネイティブRBridgeチャネルメッセージとTRILLヘッダーと呼ばれ図2にRBridgeチャンネルパケットのタイプは、チャンネル・プロトコル固有のペイロードを解釈する方法を示しRBridgeチャンネルヘッダのプロトコルフィールドで与えられます。 [RFC7178]を参照してください。"
    },
    {
      "indent": 29,
      "text": "Packet Structure",
      "ja": "パケットの構造"
    },
    {
      "indent": 19,
      "text": "+-----------------------------------+\n|           Link Header             |\n+-----------------------------------+\n|           TRILL Header            |\n+-----------------------------------+\n|     Inner Ethernet Addresses      |\n+-----------------------------------+\n|     Data Label (VLAN or FGL)      |\n+-----------------------------------+\n|      RBridge Channel Header       |\n+-----------------------------------+\n| Channel-Protocol-Specific Payload |\n+-----------------------------------+\n|    Link Trailer (FCS if Ethernet) |\n+-----------------------------------+",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 1: RBridge Channel Packet Structure",
      "ja": "図1：RBridgeチャネルパケットの構造"
    },
    {
      "indent": 29,
      "text": "Message Structure",
      "ja": "メッセージ構造"
    },
    {
      "indent": 19,
      "text": "+-----------------------------------+\n|           Link Header             |\n+-----------------------------------+\n|      RBridge Channel Header       |\n+-----------------------------------+\n| Channel Protocol Specific Payload |\n+-----------------------------------+\n|    Link Trailer (FCS if Ethernet) |\n+-----------------------------------+",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Figure 2: Native RBridge Channel Message Structure",
      "ja": "図2：ネイティブRBridgeチャンネルメッセージ構造"
    },
    {
      "indent": 3,
      "text": "Figure 3 below expands the RBridge Channel Header and Channel Protocol Specific Payload above for the case of the Vendor-Specific RBridge Channel Tunnel Protocol. 0x8946 is the Ethertype [RFC7042] assigned by the IEEE for the RBridge Channel protocol.",
      "ja": "図3は、以下のベンダー固有RBridgeチャネルトンネルプロトコルの場合の上記RBridgeチャネルヘッダおよびチャネルプロトコル固有のペイロードを展開します。 0x8946はRBridgeチャネルプロトコルは、IEEEによって割り当てられたイーサタイプ[RFC7042]です。"
    },
    {
      "indent": 4,
      "text": "                       1                   2                   3\n   0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\nRBridge Channel Header:\n  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n  |    RBridge-Channel (0x8946)   |  0x0  | Channel Protocol=0x008|\n  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n  |          Flags        |  ERR  |\n  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\nRBridge Channel Protocol Specific:\n                                  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                                  |     Vendor ID = OUI/CID       |\n  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n  |OUI/CID (cont.)|     VERR      | Sub-Protocol  | Sub-Version   |\n  +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n  |            Vendor-Protocol-Specific Data\n  |\n  |  ...",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 3: Channel Tunnel Message Structure",
      "ja": "図3：英仏海峡トンネルメッセージ構造"
    },
    {
      "indent": 3,
      "text": "The fields in Figure 3 related to the Vendor RBridge Channel Protocol are as follows:",
      "ja": "次のようにベンダーRBridgeチャネル・プロトコルに関連し、図3のフィールドは、次のとおりです。"
    },
    {
      "indent": 6,
      "text": "Channel Protocol: The RBridge Channel Protocol value allocated for the Vendor Channel (see Section 4).",
      "ja": "チャネルプロトコル：ベンダーチャンネルに割り当てられたRBridgeチャネルプロトコル値（セクション4を参照）。"
    },
    {
      "indent": 6,
      "text": "Vendor ID: This field indicates the vendor specifying the particular use or uses of the Vendor Channel. The vendor to whom the OUI or CID in this field has been allocated is in charge of specifying Vendor Channel messages using their identifier. Depending on the first byte of this field as follows:",
      "ja": "ベンダーID：このフィールドは、ベンダーチャンネルの特定の使用または使用を指定するベンダーを示します。この分野でのOUIまたはCIDが割り当てられている人に、ベンダーは、彼らの識別子を使用して、ベンダーチャンネルメッセージを指定することを担当しています。次のようにこのフィールドの最初のバイトに応じて："
    },
    {
      "indent": 9,
      "text": "OUI: When the bottom two bits of the first byte of the Vendor ID are zero (that is, the first byte is 0bXXXXXX00), the Vendor ID is an OUI.",
      "ja": "OUI：ベンダーIDの最初のバイトの底部の2ビット（つまり、最初のバイトが0bXXXXXX00ある）がゼロである場合には、ベンダIDがOUIです。"
    },
    {
      "indent": 9,
      "text": "CID: When the bottom two bits of the first byte are a one followed by a zero (that is, the first byte is 0bXXXXXX10), the Vendor ID is a CID.",
      "ja": "CID：最初のバイトの底部の2ビット（つまり最初のバイトが0bXXXXXX10である）ゼロが続く一つである場合には、ベンダIDがCIDです。"
    },
    {
      "indent": 9,
      "text": "Other: Other values of the bottom two bits of the first byte of the Vendor ID are invalid, and a VERR of 2 MUST be returned, subject to possible rate limiting (see Section 3).",
      "ja": "その他：ベンダIDの最初のバイトの底部の2ビットの他の値は無効であり、及び2のVERR（セクション3を参照）、制限可能なレートを受け戻されなければなりません。"
    },
    {
      "indent": 6,
      "text": "VERR: Vendor Channel Error. See Section 3.",
      "ja": "VERR：ベンダーチャネルエラー。第3節を参照してください。"
    },
    {
      "indent": 6,
      "text": "Sub-Protocol: Actually, the vendor specifying their use of the Vendor Channel can do whatever they want with the bits after the VERR field. But it is strongly RECOMMENDED that they use the sub-protocol / sub-version fields indicated so that multiple and evolving uses can be specified based on a single OUI.",
      "ja": "サブプロトコル：実際には、ベンダーチャンネルの使用を指定するベンダーは、彼らがVERRフィールドの後のビットでやりたいことができます。しかし、強く、彼らが複数と進化の用途は、単一のOUIに基づいて指定することができるように示されたサブプロトコル/サブバージョンフィールドを使用することをお勧めします。"
    },
    {
      "indent": 6,
      "text": "Sub-Version: See explanation above of the Sub-Protocol field. This field is provided to indicate the version of the particular vendor's Sub-Protocol.",
      "ja": "サブバージョン：サブプロトコルフィールドの上記の説明を参照してください。このフィールドは、特定のベンダーのサブプロトコルのバージョンを示すために提供されます。"
    },
    {
      "indent": 0,
      "text": "3. Vendor Channel Errors",
      "section_title": true,
      "ja": "3.ベンダーチャネルエラー"
    },
    {
      "indent": 3,
      "text": "The VERR field values from 0x0 through 0x0F (inclusive) and the value 0xFF are reserved for specification by the IETF. See Section 4. All other values of VERR are available for whatever use the vendor specifies, except that a Vendor Channel implementation MUST NOT send a Vendor Channel Error in response to a Vendor Channel message with a nonzero VERR.",
      "ja": "（含む）0x0Fの値0xFFの貫通は0x0からVERRフィールドの値は、IETFによって仕様のために予約されています。 VERRの他のすべての値は、ベンダーチャンネルの実装がゼロでないVERRとベンダーのチャネルメッセージに応じてベンダーチャンネルエラーを送ってはいけないことを除いて、ベンダーが指定するものは何でも利用可能であるセクション4を参照してください。"
    },
    {
      "indent": 3,
      "text": "The VERR values thus far specified by the IETF are as follows:",
      "ja": "次のようにこれまでのIETFによって指定されたVERRの値は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "0. The VERR field is zero in Vendor Channel messages unless the Vendor Channel packet is reporting an error.",
      "ja": "ベンダーチャンネルパケットがエラーを報告している場合を除き0 VERRフィールドは、ベンダーチャンネルメッセージでゼロです。"
    },
    {
      "indent": 3,
      "text": "1. The value one indicates that the length of the RBridge-Channel-Specific Data is less than 4 bytes. This means that at least the VERR byte and possibly part or all of the OUI is truncated. If an RBridge that implements the Vendor Channel facility receives such a Vendor Channel message, it MUST expand it to extend through the VERR field, set that field to one, and return the packet as described in Section 3.1.",
      "ja": "1.値1はRBridgeチャネル固有データの長さが4バイト未満であることを示しています。これは、OUIの少なくともVERRバイト、おそらく一部または全部が切り捨てられていることを意味します。ベンダーチャネル機能を実装RBridgeは、ベンダー・チャネル・メッセージを受信した場合、それは、VERRフィールドを貫通して展開一方にそのフィールドを設定し、セクション3.1に記載されるようにパケットを返さなければなりません。"
    },
    {
      "indent": 3,
      "text": "2. The OUI/CID field value is unknown. If an RBridge implements the Vendor Channel facility and receives a Vendor Channel packet with a zero VERR field and an OUI/CID field it does not recognize and the SL flag is zero in the RBridge Channel Header, it MUST set the VERR field to the value two and return the packet as described in Section 3.1.",
      "ja": "2. OUI / CIDフィールドの値が不明です。 RBridgeベンダーチャネル機能を実装し、ゼロVERRフィールドと、それが認識しないOUI / CIDフィールドとSLフラグでベンダー・チャネル・パケットを受信RBridgeチャネルヘッダにゼロである場合、それは値をVERRフィールドを設定しなければなりません2と3.1節で説明したようにパケットを返します。"
    },
    {
      "indent": 3,
      "text": "3. The value 3 indicates that the Sub-Protocol field value is unknown. An RBridge SHOULD set the VERR field to 3 and return the packet as described in Section 3.1 if it implements the Vendor Channel facility and it receives a Vendor Channel packet meeting the following conditions: (a) a zero VERR field in the RBridge Channel Header, (b) a zero SL flag in the RBridge Channel Header, (c) an OUI/CID that it implements, and (d) a Sub-Protocol field value it does not recognize even though it implements and uses the Sub-Protocol field.",
      "ja": "3値3は、サブプロトコルフィールドの値が不明であることを示しています。 、RBridgeチャネルヘッダ内の（a）は、ゼロVERRフィールド：RBridge 3にVERRフィールドを設定し、セクション3.1に記載したように、以下の条件をそれがベンダーチャネル機能を実装し、それがベンダー・チャネル・パケット会議を受信した場合、パケットを返すべき（B）RBridgeチャネルヘッダのゼロSLフラグを、（C）は、実装するOUI / CID、及び（d）サブプロトコルフィールド値がサブプロトコルフィールドを実装し、使用するにもかかわらず、それが認識されません。"
    },
    {
      "indent": 3,
      "text": "4. The value 4 indicates that the Sub-Version field value is unknown. An RBridge SHOULD set the VERR field to 4 and return the packet as described in Section 3.1 if it implements the Vendor RBridge Channel facility and it receives a Vendor Channel packet meeting the following conditions: (a) a zero VERR field in the RBridge Channel Header, (b) a zero SL flag in the RBridge Channel Header, (c) an OUI/CID and Sub-Protocol that it implements, and (d) a Sub-Version field value it does not recognize even though it implements and uses the Sub-Version field.",
      "ja": "4.値4は、サブバージョンフィールドの値が不明であることを示しています。 RBridge 4にVERRフィールドを設定し、セクション3.1に記載したように、以下の条件をそれがベンダーRBridgeチャネル機能を実装し、それがベンダー・チャネル・パケット会議を受信した場合、パケットを返す必要があります。RBridgeチャネルヘッダ（a）においてゼロVERRフィールド（C）が実装されていることをOUI / CIDおよびサブプロトコル、および（d）が実装し、使用するにもかかわらず、それが認識されないサブVersionフィールド値RBridgeチャネルヘッダ、に、（b）は、ゼロSLフラグサブバージョンフィールド。"
    },
    {
      "indent": 3,
      "text": "Uniform error handling is generally advisable for the sake of maintenance and understandability; however, \"SHOULD\" is chosen for errors 3 and 4 above because, as long as each message is distinguished by a vendor's OUI/CID, it is up to that vendor to decide between standard and nonstandard error handling.",
      "ja": "制服エラー処理は、メンテナンスや分かりやすさのために、一般的に賢明です。限り、各メッセージは、ベンダーのOUI / CIDによって区別されるように、それは標準と非標準のエラー処理の間に決定するために、そのベンダーまでである、しかし、上記のエラー3及び4のために選択される「べきです」。"
    },
    {
      "indent": 0,
      "text": "3.1. Sending an Error Response",
      "section_title": true,
      "ja": "3.1. エラー応答を送信します"
    },
    {
      "indent": 3,
      "text": "The IETF-specified Vendor Channel errors are sent in response to a received RBridge Channel packet by setting the VERR field as specified above and modifying the packet as specified below. (The ERR field will be zero because, if it were nonzero, the packet would have been handled at the general RBridge Channel level rather than being passed down to the Vendor Channel level.)",
      "ja": "IETF指定ベンダーチャネルエラーは、上記指定されVERRフィールドを設定し、以下の指定されたパケットを変更することにより、受信したRBridgeチャネルパケットに応答して送信されます。 （それが非ゼロであれば、パケットはなくベンダーチャネルレベルまで渡されるより一般的なRBridgeチャネルレベルで処理されたであろうからである。ERRフィールドがゼロになります）"
    },
    {
      "indent": 3,
      "text": "The RBridge Channel Header is modified by setting the SL flag. (The flags in the Channel Header and the semantics of the SL flag are specified in [RFC7178].)",
      "ja": "RBridgeチャネルヘッダーのはSLフラグを設定することによって修正されます。 （チャネルヘッダ内のフラグとSLフラグの意味は[RFC7178]で指定されています。）"
    },
    {
      "indent": 3,
      "text": "o If an error 1 is being generated because of truncation, the RBridge-Channel-Specific Data area is extended to include the VERR byte.",
      "ja": "エラー1が原因トランケーションにより生成されている場合は、O、RBridgeチャネル固有のデータ領域はVERRバイトを含むように拡張されます。"
    },
    {
      "indent": 3,
      "text": "o If a Vendor Channel message was sent between RBridges, the TRILL Header is modified by (1) clearing the M bit, (2) setting the egress nickname to the ingress nickname as received, (3) setting the ingress nickname to a nickname held by the TRILL switch sending the error packet, and (4) setting the hop count to the usual value on TRILL Data packets used by the TRILL switch sending the error packet.",
      "ja": "ベンダー・チャネル・メッセージをRBridges間で送信された場合、O、TRILLヘッダが受信される（2）入口ニックネームに出力ニックネームを設定する、（1）Mビットをクリアすることにより修飾されている、（3）保持されたニックネームに進入ニックネームを設定しますTRILLスイッチでエラーパケットを送信すること、及び（4）エラー・パケットを送信TRILLスイッチによって使用TRILLデータパケットに通常の値にホップカウントを設定します。"
    },
    {
      "indent": 3,
      "text": "o If a Vendor Channel message was sent between an RBridge and an end station in either direction, the outer MAC addresses are modified by (1) setting the Outer.MacDA to the Outer.MacSA as received and (2) setting the Outer.MacSA to the MAC address of the port of the TRILL switch or end station sending the error packet.",
      "ja": "ベンダー・チャネル・メッセージはRBridgeといずれかの方向の端局との間で送信された場合、O、外側のMACアドレスは、（1）によって修飾されている受信したOuter.MacSAにOuter.MacDAを設定し、（2）Outer.MacSA設定エラーパケットを送信TRILLスイッチまたはエンドステーションのポートのMACアドレスへ。"
    },
    {
      "indent": 3,
      "text": "o The priority of the error response message MAY be reduced from the priority of the Vendor Chanel message causing the error, unless it was already minimum priority, and the Drop Eligibility Indicator bit MAY be set in an error response. (See Section 4.1.1 of [RFC6325].)",
      "ja": "Oそれが既に最小優先順位であり、ドロップ適格性インジケータビットは、エラー応答して設定されるかもしれない限り、エラー応答メッセージの優先順位は、エラーの原因となるベンダーシャネルメッセージの優先順位より低減することができます。 （[RFC6325]のセクション4.1.1を参照）。"
    },
    {
      "indent": 3,
      "text": "o Vendor Channel error responses MAY be rate-limited.",
      "ja": "Oベンダーチャンネルエラー応答は、レート制限されることがあります。"
    },
    {
      "indent": 3,
      "text": "It is generally anticipated that the entire packet in which an error was detected would be sent back, modified as above, as the protocol specific payload, so that, for example, error responses could more easily be matched with messages sent; however, except for errors 1 and 2, this is up to the vendor specifying how their Vendor RBridge Channel messages are to be used.",
      "ja": "一般に、例えば、エラー応答がより容易に送信されたメッセージと一致することができ、そのようにエラーが検出されたパケット全体は、プロトコル固有のペイロードとして、上記のように変更し、返送されるであろうことが予想されます。しかし、エラー1と2を除いて、これは彼らのベンダーRBridgeチャンネルメッセージが使用される方法を指定するベンダー次第です。"
    },
    {
      "indent": 3,
      "text": "Note that if you receive a Vendor Channel error message with error 1, indicating a truncation error, you cannot trust the apparent \"OUI/CID\" in that Vendor Channel error message.",
      "ja": "あなたは切り捨てエラーを示す、エラー1とベンダーチャンネルエラーメッセージが表示された場合、あなたはそのベンダーのチャンネルエラーメッセージの明らかな「OUI / CIDを」信頼できないことに注意してください。"
    },
    {
      "indent": 0,
      "text": "4. IANA Considerations",
      "section_title": true,
      "ja": "4. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has allocated 0x008 for the Vendor-Specific RBridge Channel Protocol from the range of RBridge Channel protocols allocated by Standards Action.",
      "ja": "IANAは標準アクションによって割り当てられたRBridgeチャネルプロトコルの範囲から、ベンダー固有のRBridgeチャネルプロトコルのための0x008とを割り当てました。"
    },
    {
      "indent": 3,
      "text": "IANA has established a subregistry as follows in the TRILL Parameters registry (indented under \"RBridge Channel Error Codes\" after \"RBridge Channel SubError Codes\"):",
      "ja": "（「RBridgeチャンネルサブエラーコード」の後に「RBridgeチャンネルエラーコード」の下にインデント）TRILLパラメータレジストリに次のようにIANAは副登録を確立しています："
    },
    {
      "indent": 3,
      "text": "Registry: Vendor RBridge Channel Error Codes Registration Procedures: Standards Action Reference: RFC 8381",
      "ja": "レジストリ：ベンダーRBridgeチャンネルエラーコードの登録手順：標準アクション参考：RFC 8381"
    },
    {
      "indent": 9,
      "text": " Code      Description                     Reference\n ----      -----------                     ---------\n 0x00      No error                        RFC 8381\n 0x01      Message too short               RFC 8381\n 0x02      Unknown OUI/CID                 RFC 8381\n 0x03      Unknown Sub-Protocol            RFC 8381\n 0x04      Unknown Sub-Version             RFC 8381\n0x05-0x0F  Unassigned                      -\n0x10-0xFE  Reserved for vendor use         RFC 8381\n 0xFF      Reserved                        RFC 8381",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "See [RFC6325] for general TRILL Security Considerations.",
      "ja": "一般TRILLのセキュリティの考慮事項について[RFC6325]を参照してください。"
    },
    {
      "indent": 3,
      "text": "See [RFC7178] for general RBridge Channel Security Considerations.",
      "ja": "一般RBridgeチャンネルセキュリティの考慮のために[RFC7178]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Neither the Vendor-Specific RBridge Channel Protocol nor the basic RBridge Channel Protocol [RFC7178] provide any security assurances or features. (The basic RBridge Channel Protocol's first use was as an envelope for Bidirectional Forwarding Detection (BFD) messages [RFC7175], which provide their own security.) Any needed security can be provided by fields or processing within the Vendor-Protocol-Specific Data, which is outside the scope of this document. Alternatively or in addition, use of a Vendor Channel MAY be nested inside the RBridge Channel Header Extension Protocol [RFC7978]; this can provide some security services.",
      "ja": "ベンダー固有のRBridgeチャネル・プロトコルでも基本的なRBridgeチャネルプロトコル[RFC7178]はいずれも、すべてのセキュリティ保証や機能を提供します。 （基本RBridgeチャネル・プロトコルの最初の使用は、独自のセキュリティを提供する双方向フォワーディング検出（BFD）メッセージ[RFC7175]のための封筒、通りであった。）、必要なセキュリティベンダープロトコル固有のデータ内のフィールドまたは処理により提供することができ、これは、このドキュメントの範囲外です。その代わりにまたはそれに加えて、ベンダー・チャネルの使用は、RBridgeチャネルヘッダ拡張プロトコル[RFC7978]内にネストされるかもしれません。これは、いくつかのセキュリティサービスを提供することができます。"
    },
    {
      "indent": 0,
      "text": "6. References",
      "section_title": true,
      "ja": "6.参照"
    },
    {
      "indent": 0,
      "text": "6.1. Normative References",
      "section_title": true,
      "ja": "6.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[802] IEEE 802, \"IEEE Standard for Local and Metropolitan Area Networks: Overview and Architecture\", DOI 10.1109/IEEESTD.2014.6847097, IEEE Std 802-2014.",
      "ja": "[802] IEEE 802、 \"ローカルおよびメトロポリタンエリアネットワークのIEEE標準：概要とアーキテクチャ\"、DOI 10.1109 / IEEESTD.2014.6847097、IEEE STD 802から2014。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC6325] Perlman, R., Eastlake 3rd, D., Dutt, D., Gai, S., and A. Ghanwani, \"Routing Bridges (RBridges): Base Protocol Specification\", RFC 6325, DOI 10.17487/RFC6325, July 2011, <https://www.rfc-editor.org/info/rfc6325>.",
      "ja": "[RFC6325]パールマン、R.、イーストレイク3、D.、ダット、D.、ガイ、S.、およびA. Ghanwani、 \"ルーティングブリッジ（RBridges）：基本プロトコル仕様\"、RFC 6325、DOI 10.17487 / RFC6325、2011 2011年、<https://www.rfc-editor.org/info/rfc6325>。"
    },
    {
      "indent": 3,
      "text": "[RFC7042] Eastlake 3rd, D. and J. Abley, \"IANA Considerations and IETF Protocol and Documentation Usage for IEEE 802 Parameters\", BCP 141, RFC 7042, DOI 10.17487/RFC7042, October 2013, <https://www.rfc-editor.org/info/rfc7042>.",
      "ja": "[RFC7042]イーストレーク3日、D.およびJ. Abley、 \"IANAの考慮事項とIETFプロトコルとIEEE 802個のパラメータのドキュメントの使用法\" を、BCP 141、RFC 7042、DOI 10.17487 / RFC7042、2013年10月、<HTTPS：//www.rfc -editor.org/info/rfc7042>。"
    },
    {
      "indent": 3,
      "text": "[RFC7178] Eastlake 3rd, D., Manral, V., Li, Y., Aldrin, S., and D. Ward, \"Transparent Interconnection of Lots of Links (TRILL): RBridge Channel Support\", RFC 7178, DOI 10.17487/RFC7178, May 2014, <https://www.rfc-editor.org/info/rfc7178>.",
      "ja": "[RFC7178]イーストレイク3日、D.、Manral、V.、李、Y.、アルドリン、S.、およびD.区、 \"リンクの多くの透明な相互接続（TRILL）：RBridgeチャネルサポート\"、RFC 7178、DOI 10.17487 / RFC7178、2014年5月、<https://www.rfc-editor.org/info/rfc7178>。"
    },
    {
      "indent": 3,
      "text": "[RFC7780] Eastlake 3rd, D., Zhang, M., Perlman, R., Banerjee, A., Ghanwani, A., and S. Gupta, \"Transparent Interconnection of Lots of Links (TRILL): Clarifications, Corrections, and Updates\", RFC 7780, DOI 10.17487/RFC7780, February 2016, <https://www.rfc-editor.org/info/rfc7780>.",
      "ja": "[RFC7780]イーストレーク3日、D.、張、M.、パールマン、R.、バネルジー、A.、Ghanwani、A.、およびS.グプタ、「リンクの多くの透明相互接続（TRILL）：明確化、修正、およびアップデート」、RFC 7780、DOI 10.17487 / RFC7780、2016年2月、<https://www.rfc-editor.org/info/rfc7780>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B.、 \"RFC 2119個のキーワードに小文字VS大文字の曖昧さ\"、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 0,
      "text": "6.2. Informative References",
      "section_title": true,
      "ja": "6.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC7175] Manral, V., Eastlake 3rd, D., Ward, D., and A. Banerjee, \"Transparent Interconnection of Lots of Links (TRILL): Bidirectional Forwarding Detection (BFD) Support\", RFC 7175, DOI 10.17487/RFC7175, May 2014, <https://www.rfc-editor.org/info/rfc7175>.",
      "ja": "[RFC7175] Manral、V.、イーストレイク3日、D.、ウォード、D.、およびA.バネルジー、 \"リンクの多くの透明な相互接続（TRILL）：双方向フォワーディング検出（BFD）のサポート\"、RFC 7175、DOI 10.17487 / RFC7175、2014年5月、<https://www.rfc-editor.org/info/rfc7175>。"
    },
    {
      "indent": 3,
      "text": "[RFC7978] Eastlake 3rd, D., Umair, M., and Y. Li, \"Transparent Interconnection of Lots of Links (TRILL): RBridge Channel Header Extension\", RFC 7978, DOI 10.17487/RFC7978, September 2016, <https://www.rfc-editor.org/info/rfc7978>.",
      "ja": "[RFC7978]イーストレイク3日、D.、Umair、M.、およびY.李、 \"リンクの多くの透明な相互接続（TRILL）：RBridgeチャネルヘッダーの拡張\"、RFC 7978、DOI 10.17487 / RFC7978、2016年9月、<HTTPS： //www.rfc-editor.org/info/rfc7978>。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Donald Eastlake 3rd Huawei Technologies 155 Beaver Street Milford, MA 01757 United States of America",
      "ja": "ドナルドイーストレイク第三華為技術155ビーバー通りミルフォード、MAアメリカの01757米国"
    },
    {
      "indent": 3,
      "text": "Phone: +1-508-333-2270 EMail: d3e3e3@gmail.com",
      "ja": "電話：+ 1-508-333-2270 Eメール：d3e3e3@gmail.com"
    },
    {
      "indent": 3,
      "text": "Yizhou Li Huawei Technologies 101 Software Avenue, Nanjing 210012 China",
      "ja": "技術のY IリットルIH UA周辺101ソフトウェア大通り、南京210012中国"
    },
    {
      "indent": 3,
      "text": "Phone: +86-25-56622310 Email: liyizhou@huawei.com",
      "ja": "電話：+ 86-25-56622310 Eメール：liyizhou@huawei.com"
    },
    {
      "indent": 3,
      "text": "Weiguo Hao Huawei Technologies 101 Software Avenue, Nanjing 210012 China",
      "ja": "魏は、技術101ソフトウェア大通り、南京210012中国とHああああUAを持っていました"
    },
    {
      "indent": 3,
      "text": "Phone: +86-25-56623144 Email: haoweiguo@huawei.com",
      "ja": "電話：+ 86-25-56623144 Eメール：haoweiguo@huawei.com"
    },
    {
      "indent": 3,
      "text": "Ayan Banerjee Cisco",
      "ja": "アヤン・バネルジーシスコ"
    },
    {
      "indent": 3,
      "text": "Email: ayabaner@cisco.com",
      "ja": "メール：ayabaner@cisco.com"
    }
  ]
}