{
  "title": {
    "text": "RFC 8056 - Extensible Provisioning Protocol (EPP) and Registration Data Access Protocol (RDAP) Status Mapping",
    "ja": "RFC 8056 - 拡張可能プロビジョニングプロトコル（EPP）および登録データアクセスプロトコル（RDAP）ステータスマッピング"
  },
  "number": 8056,
  "created_at": "2020-08-28 20:16:11.576878+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          J. Gould\nRequest for Comments: 8056                                VeriSign, Inc.\nCategory: Standards Track                                   January 2017\nISSN: 2070-1721",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 6,
      "text": " Extensible Provisioning Protocol (EPP) and Registration Data Access Protocol (RDAP) Status Mapping",
      "ja": "拡張可能プロビジョニングプロトコル（EPP）および登録データアクセスプロトコル（RDAP）ステータスマッピング"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes the mapping of the Extensible Provisioning Protocol (EPP) statuses with the statuses registered for use in the Registration Data Access Protocol (RDAP). This document identifies gaps in the mapping, and registers RDAP statuses to fill those gaps to ensure that all of the EPP statuses specified in RFCs are supported in RDAP.",
      "ja": "このドキュメントでは、Extensible Provisioning Protocol（EPP）ステータスとRegistration Data Access Protocol（RDAP）で使用するために登録されたステータスのマッピングについて説明します。このドキュメントでは、マッピングのギャップを特定し、それらのギャップを埋めるためにRDAPステータスを登録して、RFCで指定されているすべてのEPPステータスがRDAPでサポートされるようにします。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはInternet Standards Trackドキュメントです。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、IETF（Internet Engineering Task Force）の製品です。これは、IETFコミュニティのコンセンサスを表しています。公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による公開が承認されました。インターネット標準の詳細については、RFC 7841のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8056.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc8056で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2017 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78およびこの文書の発行日に有効なIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象となります。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseのテキストが含まれている必要があり、Simplified BSD Licenseに記載されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n  1.1.  Conventions Used in This Document . . . . . . . . . . . .   2\n2.  EPP-to-RDAP Status Mapping  . . . . . . . . . . . . . . . . .   2\n3.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   6\n  3.1.  JSON Values Registry  . . . . . . . . . . . . . . . . . .   6\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .  10\n5.  Normative References  . . . . . . . . . . . . . . . . . . . .  10\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  11\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .  11",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document maps the statuses defined in the Extensible Provisioning Protocol (EPP) RFCs to the list of statuses registered for use in the Registration Data Access Protocol (RDAP), in the \"RDAP JSON Values\" registry [rdap-json-values].",
      "ja": "このドキュメントでは、Extensible Provisioning Protocol（EPP）RFCで定義されたステータスを、「RDAP JSON値」レジストリ[rdap-json-values]のRegistration Data Access Protocol（RDAP）で使用するために登録されたステータスのリストにマッピングします。"
    },
    {
      "indent": 3,
      "text": "The \"RDAP JSON Values\" registry is described in Section 10.2 of [RFC7483] and is available in the \"RDAP JSON Values\" registry [rdap-json-values].",
      "ja": "「RDAP JSON値」レジストリは[RFC7483]のセクション10.2で説明されており、「RDAP JSON値」レジストリ[rdap-json-values]で利用できます。"
    },
    {
      "indent": 3,
      "text": "The EPP statuses used as the source of the mapping include Section 2.3 of the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731], Section 2.3 of \"Extensible Provisioning Protocol (EPP) Host Mapping\" [RFC5732], Section 2.2 of \"Extensible Provisioning Protocol (EPP) Contact Mapping\" [RFC5733], and Section 3.1 of \"Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP)\" [RFC3915].",
      "ja": "マッピングのソースとして使用されるEPPステータスには、Extensible Provisioning Protocol（EPP）ドメイン名マッピング[RFC5731]のセクション2.3、「Extensible Provisioning Protocol（EPP）ホストマッピング」のセクション2.3 [RFC5732]、「Extensible」のセクション2.2が含まれますプロビジョニングプロトコル（EPP）連絡先マッピング」[RFC5733]、および「拡張可能プロビジョニングプロトコル（EPP）のドメインレジストリ猶予期間マッピング」[RFC3915]のセクション3.1。"
    },
    {
      "indent": 3,
      "text": "Each EPP status MUST map to a single RDAP status to ensure that data in the Domain Name Registries (DNRs) that use EPP can be accurately presented in RDAP.",
      "ja": "各EPPステータスは、EPPを使用するドメイン名レジストリ（DNR）内のデータがRDAPで正確に提示できるように、単一のRDAPステータスにマップする必要があります。"
    },
    {
      "indent": 0,
      "text": "1.1. Conventions Used in This Document",
      "section_title": true,
      "ja": "1.1. このドキュメントで使用される規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は、 RFC 2119 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. EPP-to-RDAP Status Mapping",
      "section_title": true,
      "ja": "2. EPPからRDAPへのステータスマッピング"
    },
    {
      "indent": 3,
      "text": "Below is a list of EPP statuses from the EPP RFCs ([RFC5731], [RFC5732], [RFC5733], and [RFC3915]) mapped to the RDAP statuses registered in the \"RDAP JSON Values\" registry [rdap-json-values], with the format <EPP Status> '=' <RDAP Status>, where a blank <RDAP Status> indicates a gap in the mapping.",
      "ja": "以下は、「RDAP JSON値」レジストリ[rdap-json-values]に登録されているRDAPステータスにマップされたEPP RFC（[RFC5731]、[RFC5732]、[RFC5733]、および[RFC3915]）のEPPステータスのリストです。 <EPPステータス> '=' <RDAPステータス>という形式で、空白の<RDAPステータス>はマッピングのギャップを示します。"
    },
    {
      "indent": 6,
      "text": "addPeriod = autoRenewPeriod = clientDeleteProhibited = clientHold = clientRenewProhibited = clientTransferProhibited = clientUpdateProhibited = inactive = inactive linked = associated ok = active pendingCreate = pending create pendingDelete = pending delete pendingRenew = pending renew pendingRestore = pendingTransfer = pending transfer pendingUpdate = pending update redemptionPeriod = renewPeriod = serverDeleteProhibited = serverRenewProhibited = serverTransferProhibited = serverUpdateProhibited = serverHold = transferPeriod =",
      "ja": "addPeriod = autoRenewPeriod = clientDeleteProhibited = clientHold = clientRenewProhibited = clientTransferProhibited = clientUpdateProhibited = inactive =非アクティブリンク済み=関連付けられたok =アクティブpendingCreate =保留中の作成pendingDelete =保留中の削除= serverRenewProhibited = serverTransferProhibited = serverUpdateProhibited = serverHold = transferPeriod ="
    },
    {
      "indent": 3,
      "text": "The \"RDAP JSON Values\" registry [rdap-json-values] does have a set of prohibited statuses including \"renew prohibited\", \"update prohibited\", \"transfer prohibited\", and \"delete prohibited\", but these statuses do not directly map to the EPP prohibited statuses. EPP provides status codes that allow distinguishing the case that an action is prohibited because of server policy from the case that an action is prohibited because of a client request. The ability to make this distinction needs to be preserved in RDAP.",
      "ja": "「RDAP JSON値」レジストリー[rdap-json-values]には、「更新禁止」、「更新禁止」、「転送禁止」、「削除禁止」などの禁止ステータスのセットがありますが、これらのステータスは直接マッピングされませんEPP禁止ステータスに。 EPPは、サーバーポリシーが原因でアクションが禁止されているケースと、クライアントの要求が原因でアクションが禁止されているケースを区別できるようにするステータスコードを提供します。この区別を行う機能は、RDAPで維持する必要があります。"
    },
    {
      "indent": 3,
      "text": "Each of the EPP status values that don't map directly to an RDAP status value is described below. Each EPP status value includes a proposed new RDAP status value and a description of the value. The RDAP status value is derived from the EPP status value by converting the EPP \"camelCase\" representation to lowercase with a space character inserted between word boundaries.",
      "ja": "RDAPステータス値に直接マップしない各EPPステータス値については、以下で説明します。各EPPステータス値には、提案された新しいRDAPステータス値とその値の説明が含まれています。 RDAPステータス値は、EPPの \"camelCase\"表現を単語の境界の間にスペース文字を挿入して小文字に変換することにより、EPPステータス値から導出されます。"
    },
    {
      "indent": 3,
      "text": "addPeriod = add period; This grace period is provided after the initial registration of the object. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the registration.",
      "ja": "addPeriod =期間を追加します。この猶予期間は、オブジェクトの初期登録後に提供されます。この期間中にオブジェクトがクライアントによって削除された場合、サーバーは登録の費用のクレジットをクライアントに提供します。"
    },
    {
      "indent": 3,
      "text": "autoRenewPeriod = auto renew period; This grace period is provided after an object registration period expires and is extended (renewed) automatically by the server. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the auto renewal.",
      "ja": "autoRenewPeriod =自動更新期間。この猶予期間は、オブジェクト登録期間が終了した後に提供され、サーバーによって自動的に延長（更新）されます。この期間中にオブジェクトがクライアントによって削除された場合、サーバーは、自動更新のコストのクレジットをクライアントに提供します。"
    },
    {
      "indent": 3,
      "text": "clientDeleteProhibited = client delete prohibited; The client requested that requests to delete the object MUST be rejected.",
      "ja": "clientDeleteProhibited =クライアントの削除が禁止されています。クライアントは、オブジェクトの削除要求を拒否するように要求しました。"
    },
    {
      "indent": 3,
      "text": "clientHold = client hold; The client requested that the DNS delegation information MUST NOT be published for the object.",
      "ja": "clientHold =クライアント保留。クライアントは、DNS委任情報がオブジェクトに対して公開されてはならないことを要求しました。"
    },
    {
      "indent": 3,
      "text": "clientRenewProhibited = client renew prohibited; The client requested that requests to renew the object MUST be rejected.",
      "ja": "clientRenewProhibited =クライアントの更新が禁止されています。クライアントは、オブジェクトの更新要求を拒否することを要求しました。"
    },
    {
      "indent": 3,
      "text": "clientTransferProhibited = client transfer prohibited; The client requested that requests to transfer the object MUST be rejected.",
      "ja": "clientTransferProhibited =クライアント転送は禁止されています。クライアントは、オブジェクトの転送要求を拒否するよう要求しました。"
    },
    {
      "indent": 3,
      "text": "clientUpdateProhibited = client update prohibited; The client requested that requests to update the object (other than to remove this status) MUST be rejected.",
      "ja": "clientUpdateProhibited =クライアントの更新は禁止されています。 （このステータスを削除する以外の）オブジェクトの更新要求を拒否するようクライアントが要求しました。"
    },
    {
      "indent": 3,
      "text": "pendingRestore = pending restore; An object is in the process of being restored after being in the redemption period state.",
      "ja": "pendingRestore =保留中の復元;オブジェクトは、償還期間状態になった後、復元処理中です。"
    },
    {
      "indent": 3,
      "text": "redemptionPeriod = redemption period; A delete has been received, but the object has not yet been purged because an opportunity exists to restore the object and abort the deletion process.",
      "ja": "redemptionPeriod =償還期間。削除を受け取りましたが、オブジェクトを復元して削除プロセスを中止する機会があるため、オブジェクトはまだパージされていません。"
    },
    {
      "indent": 3,
      "text": "renewPeriod = renew period; This grace period is provided after an object registration period is explicitly extended (renewed) by the client. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the renewal.",
      "ja": "renewPeriod =更新期間;この猶予期間は、オブジェクト登録期間がクライアントによって明示的に延長（更新）された後に提供されます。この期間中にオブジェクトがクライアントによって削除された場合、サーバーは更新のコストのクレジットをクライアントに提供します。"
    },
    {
      "indent": 3,
      "text": "serverDeleteProhibited = server delete prohibited; The server set the status so that requests to delete the object MUST be rejected.",
      "ja": "serverDeleteProhibited =サーバーの削除は禁止されています。サーバーは、オブジェクトを削除する要求が拒否されるようにステータスを設定しました。"
    },
    {
      "indent": 3,
      "text": "serverRenewProhibited = server renew prohibited; The server set the status so that requests to renew the object MUST be rejected.",
      "ja": "serverRenewProhibited =サーバーの更新が禁止されています。サーバーは、オブジェクトを更新する要求を拒否する必要があるようにステータスを設定しました。"
    },
    {
      "indent": 3,
      "text": "serverTransferProhibited = server transfer prohibited; The server set the status so that requests to transfer the object MUST be rejected.",
      "ja": "serverTransferProhibited =サーバー転送は禁止されています。サーバーは、オブジェクトを転送する要求が拒否されるようにステータスを設定します。"
    },
    {
      "indent": 3,
      "text": "serverUpdateProhibited = server update prohibited; The server set the status so that requests to update the object (other than to remove this status) MUST be rejected. serverHold = server hold; The server set the status so that DNS delegation information MUST NOT be published for the object.",
      "ja": "serverUpdateProhibited =サーバーの更新は禁止されています。サーバーは、（このステータスを削除する以外の）オブジェクトを更新する要求が拒否されるようにステータスを設定します。 serverHold = server hold;サーバーは、DNS委任情報がオブジェクトに対して公開されてはならないようにステータスを設定しました。"
    },
    {
      "indent": 3,
      "text": "transferPeriod = transfer period; This grace period is provided after the successful transfer of object registration sponsorship from one client to another client. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the transfer.",
      "ja": "transferPeriod =転送期間;この猶予期間は、オブジェクト登録スポンサーシップを1つのクライアントから別のクライアントに正常に転送した後に提供されます。この期間中にオブジェクトがクライアントによって削除された場合、サーバーは転送のコストのクレジットをクライアントに提供します。"
    },
    {
      "indent": 3,
      "text": "The resulting mapping after registering the new RDAP statuses is:",
      "ja": "新しいRDAPステータスを登録した後のマッピングは次のとおりです。"
    },
    {
      "indent": 6,
      "text": "addPeriod = add period autoRenewPeriod = auto renew period clientDeleteProhibited = client delete prohibited clientHold = client hold clientRenewProhibited = client renew prohibited clientTransferProhibited = client transfer prohibited clientUpdateProhibited = client update prohibited inactive = inactive linked = associated ok = active pendingCreate = pending create pendingDelete = pending delete pendingRenew = pending renew pendingRestore = pending restore pendingTransfer = pending transfer pendingUpdate = pending update redemptionPeriod = redemption period renewPeriod = renew period serverDeleteProhibited = server delete prohibited serverRenewProhibited = server renew prohibited serverTransferProhibited = server transfer prohibited serverUpdateProhibited = server update prohibited serverHold = server hold transferPeriod = transfer period",
      "ja": "addPeriod =追加期間autoRenewPeriod =自動更新期間clientDeleteProhibited =クライアント削除禁止clientHold =クライアント保留clientRenewProhibited =クライアント更新禁止clientTransferProhibited =クライアント転送禁止clientUpdateProhibited =クライアント更新禁止非アクティブ=非アクティブリンク=関連ok =アクティブpendingCreate =保留中create pendingDelete =保留中の削除pendingRenew =保留中の更新pendingRestore =保留中の復元pendingTransfer =保留中の転送pendingUpdate =保留中の更新redemptionPeriod =償還期間renewPeriod =更新期間serverDeleteProhibited =サーバー削除禁止serverRenewProhibited =サーバー更新禁止serverTransferProhibited =サーバー転送禁止serverUpdateProhibited =サーバー更新禁止serverHold =サーバー保留transferPeriod =転送期間"
    },
    {
      "indent": 0,
      "text": "3. IANA Considerations",
      "section_title": true,
      "ja": "3. IANAに関する考慮事項"
    },
    {
      "indent": 0,
      "text": "3.1. JSON Values Registry",
      "section_title": true,
      "ja": "3.1. JSON値レジストリ"
    },
    {
      "indent": 3,
      "text": "The following values have been registered by the IANA in the \"RDAP JSON Values\" registry described in [RFC7483]:",
      "ja": "次の値は、IANAによって[RFC7483]で説明されている「RDAP JSON値」レジストリに登録されています。"
    },
    {
      "indent": 6,
      "text": "Value: add period Type: status Description: This grace period is provided after the initial registration of the object. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the registration. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'addPeriod' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：追加期間タイプ：ステータス説明：この猶予期間は、オブジェクトの初期登録後に提供されます。この期間中にオブジェクトがクライアントによって削除された場合、サーバーは登録の費用のクレジットをクライアントに提供します。これは、Extensible Provisioning Protocol（EPP）[RFC3915]の「addPeriod」ステータスのドメインレジストリ猶予期間マッピングにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: auto renew period Type: status Description: This grace period is provided after an object registration period expires and is extended (renewed) automatically by the server. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the auto renewal. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'autoRenewPeriod' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：自動更新期間タイプ：ステータス説明：この猶予期間は、オブジェクト登録期間が終了した後に提供され、サーバーによって自動的に延長（更新）されます。この期間中にオブジェクトがクライアントによって削除された場合、サーバーは、自動更新のコストのクレジットをクライアントに提供します。これは、Extensible Provisioning Protocol（EPP）[RFC3915] 'autoRenewPeriod'ステータスのドメインレジストリ猶予期間マッピングにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 0,
      "text": " Value: client delete prohibited Type: status Description: The client requested that requests to delete the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731], Extensible Provisioning Protocol (EPP) Host Mapping [RFC5732], and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'clientDeleteProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org Value: client hold Type: status Description: The client requested that the DNS delegation information MUST NOT be published for the object. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] 'clientHold' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：クライアント削除禁止タイプ：ステータス説明：クライアントは、オブジェクトの削除要求を拒否することを要求しました。これは、Extensible Provisioning Protocol（EPP）ドメイン名マッピング[RFC5731]、Extensible Provisioning Protocol（EPP）ホストマッピング[RFC5732]、およびExtensible Provisioning Protocol（EPP）の連絡先マッピング[RFC5733] 'clientDeleteProhibited'ステータスにマッピングされます。登録者名：IESG登録者の連絡先情報：iesg@ietf.org値：client holdタイプ：status説明：クライアントは、オブジェクトのDNS委任情報を公開してはならないことを要求しました。これは、Extensible Provisioning Protocol（EPP）ドメイン名マッピング[RFC5731]の 'clientHold'ステータスにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: client renew prohibited Type: status Description: The client requested that requests to renew the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] 'clientRenewProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：クライアント更新禁止タイプ：ステータス説明：オブジェクトの更新要求を拒否することを要求したクライアントは拒否する必要があります。これは、Extensible Provisioning Protocol（EPP）ドメイン名マッピング[RFC5731] 'clientRenewProhibited'ステータスにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: client transfer prohibited Type: status Description: The client requested that requests to transfer the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'clientTransferProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：クライアント転送禁止タイプ：ステータス説明：クライアントは、オブジェクトの転送要求を拒否することを要求しました。これは、Extensible Provisioning Protocol（EPP）ドメイン名マッピング[RFC5731]およびExtensible Provisioning Protocol（EPP）連絡先マッピング[RFC5733] 'clientTransferProhibited'ステータスにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: client update prohibited Type: status Description: The client requested that requests to update the object (other than to remove this status) MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731], Extensible Provisioning Protocol (EPP) Host Mapping [RFC5732], and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'clientUpdateProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：クライアント更新禁止タイプ：ステータス説明：（このステータスを削除する以外の）オブジェクトの更新要求を拒否するように要求したクライアントは拒否する必要があります。これは、Extensible Provisioning Protocol（EPP）ドメイン名マッピング[RFC5731]、Extensible Provisioning Protocol（EPP）ホストマッピング[RFC5732]、およびExtensible Provisioning Protocol（EPP）の連絡先マッピング[RFC5733] 'clientUpdateProhibited'ステータスにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 0,
      "text": " Value: pending restore Type: status Description: An object is in the process of being restored after being in the redemption period state. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'pendingRestore' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org Value: redemption period Type: status Description: A delete has been received, but the object has not yet been purged because an opportunity exists to restore the object and abort the deletion process. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'redemptionPeriod' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：保留中の復元タイプ：ステータス説明：オブジェクトは、償還期間状態になった後、復元処理中です。これは、Extensible Provisioning Protocol（EPP）[RFC3915] 'pendingRestore'ステータスのドメインレジストリ猶予期間マッピングにマッピングされます。登録者名：IESG登録者の連絡先情報：iesg@ietf.org値：償還期間タイプ：ステータス説明：削除を受け取りましたが、オブジェクトを復元して削除プロセスを中止する機会があるため、オブジェクトはまだパージされていません。これは、Extensible Provisioning Protocol（EPP）[RFC3915] 'redemptionPeriod'ステータスのドメインレジストリ猶予期間マッピングにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: renew period Type: status Description: This grace period is provided after an object registration period is explicitly extended (renewed) by the client. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the renewal. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'renewPeriod' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：更新期間タイプ：ステータス説明：この猶予期間は、オブジェクト登録期間がクライアントによって明示的に延長（更新）された後に提供されます。この期間中にオブジェクトがクライアントによって削除された場合、サーバーは更新のコストのクレジットをクライアントに提供します。これは、Extensible Provisioning Protocol（EPP）[RFC3915] 'renewPeriod'ステータスのドメインレジストリ猶予期間マッピングにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: server delete prohibited Type: status Description: The server set the status so that requests to delete the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731], Extensible Provisioning Protocol (EPP) Host Mapping [RFC5732], and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'serverDeleteProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：サーバー削除禁止タイプ：ステータス説明：サーバーは、オブジェクトを削除する要求を拒否する必要があるようにステータスを設定します。これは、Extensible Provisioning Protocol（EPP）ドメイン名マッピング[RFC5731]、Extensible Provisioning Protocol（EPP）ホストマッピング[RFC5732]、およびExtensible Provisioning Protocol（EPP）連絡先マッピング[RFC5733]の 'serverDeleteProhibited'ステータスにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 0,
      "text": " Value: server renew prohibited Type: status Description: The server set the status so that requests to renew the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] 'serverRenewProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org Value: server transfer prohibited Type: status Description: The server set the status so that requests to transfer the object MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'serverTransferProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：サーバー更新禁止タイプ：ステータス説明：サーバーは、オブジェクトを更新する要求を拒否する必要があるようにステータスを設定しました。これは、Extensible Provisioning Protocol（EPP）ドメイン名マッピング[RFC5731] 'serverRenewProhibited'ステータスにマッピングされます。登録者名：IESG登録者の連絡先情報：iesg@ietf.org値：サーバー転送禁止タイプ：ステータス説明：サーバーは、オブジェクトを転送する要求を拒否する必要があるようにステータスを設定しました。これは、Extensible Provisioning Protocol（EPP）ドメイン名マッピング[RFC5731]およびExtensible Provisioning Protocol（EPP）連絡先マッピング[RFC5733] 'serverTransferProhibited'ステータスにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: server update prohibited Type: status Description: The server set the status so that requests to update the object (other than to remove this status) MUST be rejected. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731], Extensible Provisioning Protocol (EPP) Host Mapping [RFC5732], and Extensible Provisioning Protocol (EPP) Contact Mapping [RFC5733] 'serverUpdateProhibited' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：サーバー更新禁止タイプ：ステータス説明：サーバーは、オブジェクトを更新する要求（このステータスを削除する以外）が拒否されるようにステータスを設定します。これは、Extensible Provisioning Protocol（EPP）ドメイン名マッピング[RFC5731]、Extensible Provisioning Protocol（EPP）ホストマッピング[RFC5732]、およびExtensible Provisioning Protocol（EPP）連絡先マッピング[RFC5733]の 'serverUpdateProhibited'ステータスにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: server hold Type: status Description: The server set the status so that DNS delegation information MUST NOT be published for the object. This maps to the Extensible Provisioning Protocol (EPP) Domain Name Mapping [RFC5731] 'serverHold' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：サーバー保留タイプ：ステータス説明：サーバーは、DNS委任情報がオブジェクトに対して公開されてはならないようにステータスを設定します。これは、Extensible Provisioning Protocol（EPP）ドメイン名マッピング[RFC5731] 'serverHold'ステータスにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 6,
      "text": "Value: transfer period Type: status Description: This grace period is provided after the successful transfer of object registration sponsorship from one client to another client. If the object is deleted by the client during this period, the server provides a credit to the client for the cost of the transfer. This maps to the Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP) [RFC3915] 'transferPeriod' status. Registrant Name: IESG Registrant Contact Information: iesg@ietf.org",
      "ja": "値：転送期間タイプ：ステータス説明：この猶予期間は、あるクライアントから別のクライアントへのオブジェクト登録スポンサーシップの転送が成功した後に提供されます。この期間中にオブジェクトがクライアントによって削除された場合、サーバーは転送のコストのクレジットをクライアントに提供します。これは、Extensible Provisioning Protocol（EPP）[RFC3915] 'transferPeriod'ステータスのドメインレジストリ猶予期間マッピングにマッピングされます。登録者名：IESG登録者連絡先情報：iesg@ietf.org"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The status values described in this document can be subject to server-side information disclosure policies that restrict display of the values to authorized clients. Implementers may wish to review [RFC7481] for a description of the RDAP security services that can be used to implement information disclosure policies.",
      "ja": "このドキュメントで説明されているステータス値は、値の表示を許可されたクライアントに制限するサーバー側の情報開示ポリシーの対象となる場合があります。実装者は、情報開示ポリシーの実装に使用できるRDAPセキュリティサービスの説明について[RFC7481]を確認することを希望する場合があります。"
    },
    {
      "indent": 0,
      "text": "5. Normative References",
      "section_title": true,
      "ja": "5. 引用文献"
    },
    {
      "indent": 3,
      "text": "[rdap-json-values] IANA, \"RDAP JSON Values\", <https://www.iana.org/assignments/rdap-json-values/>.",
      "ja": "[rdap-json-values] IANA、「RDAP JSON値」、<https://www.iana.org/assignments/rdap-json-values/>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3915] Hollenbeck, S., \"Domain Registry Grace Period Mapping for the Extensible Provisioning Protocol (EPP)\", RFC 3915, DOI 10.17487/RFC3915, September 2004, <http://www.rfc-editor.org/info/rfc3915>.",
      "ja": "[RFC3915] Hollenbeck、S。、「Extensible Provisioning Protocol（EPP）のドメインレジストリ猶予期間マッピング」、RFC 3915、DOI 10.17487 / RFC3915、2004年9月、<http://www.rfc-editor.org/info/ rfc3915>。"
    },
    {
      "indent": 3,
      "text": "[RFC5731] Hollenbeck, S., \"Extensible Provisioning Protocol (EPP) Domain Name Mapping\", STD 69, RFC 5731, DOI 10.17487/RFC5731, August 2009, <http://www.rfc-editor.org/info/rfc5731>.",
      "ja": "[RFC5731] Hollenbeck、S。、「Extensible Provisioning Protocol（EPP）Domain Name Mapping」、STD 69、RFC 5731、DOI 10.17487 / RFC5731、2009年8月、<http://www.rfc-editor.org/info/rfc5731 >。"
    },
    {
      "indent": 3,
      "text": "[RFC5732] Hollenbeck, S., \"Extensible Provisioning Protocol (EPP) Host Mapping\", STD 69, RFC 5732, DOI 10.17487/RFC5732, August 2009, <http://www.rfc-editor.org/info/rfc5732>.",
      "ja": "[RFC5732] Hollenbeck、S。、「Extensible Provisioning Protocol（EPP）Host Mapping」、STD 69、RFC 5732、DOI 10.17487 / RFC5732、2009年8月、<http://www.rfc-editor.org/info/rfc5732> 。"
    },
    {
      "indent": 3,
      "text": "[RFC5733] Hollenbeck, S., \"Extensible Provisioning Protocol (EPP) Contact Mapping\", STD 69, RFC 5733, DOI 10.17487/RFC5733, August 2009, <http://www.rfc-editor.org/info/rfc5733>.",
      "ja": "[RFC5733] Hollenbeck、S。、「Extensible Provisioning Protocol（EPP）Contact Mapping」、STD 69、RFC 5733、DOI 10.17487 / RFC5733、2009年8月、<http://www.rfc-editor.org/info/rfc5733> 。"
    },
    {
      "indent": 3,
      "text": "[RFC7481] Hollenbeck, S. and N. Kong, \"Security Services for the Registration Data Access Protocol (RDAP)\", RFC 7481, DOI 10.17487/RFC7481, March 2015, <http://www.rfc-editor.org/info/rfc7481>.",
      "ja": "[RFC7481] Hollenbeck、S. and N. Kong、 \"Security Services for the Registration Data Access Protocol（RDAP）\"、RFC 7481、DOI 10.17487 / RFC7481、March 2015、<http://www.rfc-editor.org/ info / rfc7481>。"
    },
    {
      "indent": 3,
      "text": "[RFC7483] Newton, A. and S. Hollenbeck, \"JSON Responses for the Registration Data Access Protocol (RDAP)\", RFC 7483, DOI 10.17487/RFC7483, March 2015, <http://www.rfc-editor.org/info/rfc7483>.",
      "ja": "[RFC7483]ニュートンA.およびS.ホレンベック、「JSON Responses for the Registration Data Access Protocol（RDAP）」、RFC 7483、DOI 10.17487 / RFC7483、2015年3月、<http://www.rfc-editor.org/ info / rfc7483>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Suggestions that have been incorporated into this document were provided by Andrew Newton, Scott Hollenbeck, Jim Galvin, Gustavo Lozano, and Robert Sparks.",
      "ja": "このドキュメントに組み込まれた提案は、Andrew Newton、Scott Hollenbeck、Jim Galvin、Gustavo Lozano、およびRobert Sparksによって提供されました。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "James Gould VeriSign, Inc. 12061 Bluemont Way Reston, VA 20190 United States of America",
      "ja": "James Gould VeriSign、Inc. 12061 Bluemont Way Reston、VA 20190アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: jgould@verisign.com\nURI:   http://www.verisign.com",
      "raw": true,
      "ja": ""
    }
  ]
}