{
  "title": {
    "text": "RFC 8112 - Locator/ID Separation Protocol Delegated Database Tree (LISP-DDT) Referral Internet Groper (RIG)",
    "ja": "RFC 8112 - ロケータ/ ID分離プロトコル委任データベースツリー（LISP-DDT）紹介インターネットグローパー（RIG）"
  },
  "number": 8112,
  "created_at": "2020-08-28 17:06:45.374018+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Independent Submission                                      D. Farinacci\nRequest for Comments: 8112                                   lispers.net\nCategory: Informational                                          A. Jain\nISSN: 2070-1721                                         Juniper Networks\n                                                             I. Kouvelas\n                                                                  Arista\n                                                                D. Lewis\n                                                           Cisco Systems\n                                                                May 2017",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Locator/ID Separation Protocol Delegated Database Tree (LISP-DDT) Referral Internet Groper (RIG)",
      "ja": "ロケータ/ ID分離プロトコル委任データベースツリー（LISP-DDT）紹介インターネットグローパー（RIG）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "A simple tool called the Locator/ID Separation Protocol Delegated Database Tree (LISP-DDT) Referral Internet Groper (RIG), also referred to in this document as \"rig\", can be used to query the LISP-DDT hierarchy. This document describes how the \"rig\" tool works.",
      "ja": "このドキュメントでは「リグ」とも呼ばれる、ロケータ/ ID分離プロトコル委任データベースツリー（LISP-DDT）参照インターネットグローパー（RIG）と呼ばれる簡単なツールを使用して、LISP-DDT階層を照会できます。このドキュメントでは、「リグ」ツールの仕組みについて説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This is a contribution to the RFC Series, independently of any other RFC stream. The RFC Editor has chosen to publish this document at its discretion and makes no statement about its value for implementation or deployment. Documents approved for publication by the RFC Editor are not a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "これは、他のRFCストリームとは無関係に、RFCシリーズへの貢献です。 RFC Editorは、このドキュメントを独自の裁量で公開することを選択し、実装または展開に対するその価値については何も述べていません。 RFC Editorによって公開が承認されたドキュメントは、どのレベルのインターネット標準の候補にもなりません。 RFC 7841のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8112.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックの提供方法に関する情報は、http：//www.rfc-editor.org/info/rfc8112で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2017 IETF Trustおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書は、BCP 78およびIETF文書に関するIETFトラストの法的規定（http://trustee.ietf.org/license-info）の対象であり、この文書の発行日に有効です。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................2\n2. Requirements Language ...........................................3\n3. Definitions of Terms ............................................3\n4. Basic Overview ..................................................5\n5. Implementation Details ..........................................7\n6. Security Considerations .........................................9\n7. IANA Considerations .............................................9\n8. References ......................................................9\n   8.1. Normative References .......................................9\n   8.2. Informative References ....................................10\nAcknowledgments ...................................................11\nAuthors' Addresses ................................................11",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "\"The Locator/ID Separation Protocol (LISP)\" [RFC6830] specifies an architecture and mechanism for replacing the semantics of an address currently used by IP with two separate namespaces: Endpoint Identifiers (EIDs), used within sites; and Routing Locators (RLOCs), used on the transit networks that make up the Internet infrastructure. To achieve this separation, LISP defines protocol mechanisms for mapping from EIDs to RLOCs. In addition, LISP assumes the existence of a database to store and propagate those mappings globally. This document focuses on the LISP Delegated Database Tree (LISP-DDT) [RFC8111] mapping database system.",
      "ja": "「ロケータ/ ID分離プロトコル（LISP）」[RFC6830]は、現在IPで使用されているアドレスのセマンティクスを2つの別個の名前空間に置き換えるアーキテクチャとメカニズムを指定しています。サイト内で使用されるエンドポイント識別子（EID）。インターネットインフラストラクチャを構成するトランジットネットワークで使用されるルーティングロケータ（RLOC）。この分離を実現するために、LISPはEIDからRLOCにマッピングするためのプロトコルメカニズムを定義しています。さらに、LISPはデータベースの存在を前提として、それらのマッピングをグローバルに格納および伝播します。このドキュメントでは、LISP委任データベースツリー（LISP-DDT）[RFC8111]マッピングデータベースシステムに焦点を当てています。"
    },
    {
      "indent": 3,
      "text": "The \"rig\" tool is a manual management tool to query the LISP-DDT mapping database hierarchy. It can be run by all devices that implement LISP, including Ingress Tunnel Routers (ITRs), Egress Tunnel Routers (ETRs), Proxy ITRs (PITRs), Proxy ETRs (PETRs), Map-Resolvers, Map-Servers, and LISP-DDT nodes, as well as by a host system at either a LISP-capable or non-LISP-capable site.",
      "ja": "「リグ」ツールは、LISP-DDTマッピングデータベース階層を照会する手動管理ツールです。 Ingress Tunnel Router（ITRs）、Egress Tunnel Routers（ETRs）、Proxy ITRs（PITRs）、Proxy ETRs（PETRs）、Map-Resolvers、Map-Servers、およびLISP-DDTなど、LISPを実装するすべてのデバイスで実行できますノード、およびLISP対応サイトまたはLISP非対応サイトのホストシステムによる。"
    },
    {
      "indent": 3,
      "text": "The LISP-DDT \"rig\" tool is similar to the \"LISP Internet Groper\" (\"lig\") tool [RFC6835] in that they are both diagnostic tools to query a database. However, the \"rig\" tool is used to find Map-Servers serving an EID-prefix, specifically within a LISP-DDT mapping database framework. And \"lig\" can be used on top of any mapping database system to retrieve locators used for packet encapsulation.",
      "ja": "LISP-DDTの「リグ」ツールは、「LISP Internet Groper」（「lig」）ツール[RFC6835]に似ていますが、どちらもデータベースをクエリするための診断ツールです。ただし、「リグ」ツールは、特にLISP-DDTマッピングデータベースフレームワーク内で、EIDプレフィックスを提供するMap-Serverを見つけるために使用されます。また、「lig」は、マッピングデータベースシステムの上で使用して、パケットのカプセル化に使用されるロケーターを取得できます。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Language",
      "section_title": true,
      "ja": "2. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "キーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「NOT RECOMMENDED」、「MAY」、「OPTIONALこのドキュメントの「」は、BCP 14 [RFC2119] [RFC8174]で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Definitions of Terms",
      "section_title": true,
      "ja": "3. 用語の定義"
    },
    {
      "indent": 3,
      "text": "Endpoint Identifier (EID): a 32-bit (for IPv4) or 128-bit (for IPv6) value (or an address encoded per [RFC8060]) used in the source and destination address fields of the first (innermost) LISP header of a packet. The host obtains a destination EID the same way it obtains a destination address today -- for example, through a Domain Name System (DNS) [RFC1034] lookup or a Session Initiation Protocol (SIP) [RFC3261] exchange. The source EID is obtained via existing mechanisms used to set a host's \"local\" IP address. An EID used on the public Internet must have the same properties as any other IP address used in that manner; this means, among other things, that it must be globally unique. An EID is allocated to a host from an EID-prefix block associated with the site where the host is located. An EID can be used by a host to refer to other hosts. EIDs MUST NOT be used as LISP RLOCs. Note that EID blocks MAY be assigned in a hierarchical manner, independent of the network topology, to facilitate scaling of the mapping database. In addition, an EID block assigned to a site may have site-local structure (subnetting) for routing within the site; this structure is not visible to the global routing system. In theory, the bit string that represents an EID for one device can represent an RLOC for a different device. As the architecture is realized, if a given bit string is both an RLOC and an EID, it must refer to the same entity in both cases. When used in \"discussions\" with other Locator/ID separation proposals, a LISP EID will be called an \"LEID\". Throughout this document, any references to \"EID\" refer to an LEID.",
      "ja": "エンドポイント識別子（EID）：32ビット（IPv4の場合）または128ビット（IPv6の場合）の値（または[RFC8060]でエンコードされたアドレス）で、最初の（最も内側の）LISPヘッダーの送信元および宛先アドレスフィールドパケット。ホストは、今日、宛先アドレスを取得するのと同じ方法で宛先EIDを取得します。たとえば、ドメインネームシステム（DNS）[RFC1034]ルックアップまたはセッション開始プロトコル（SIP）[RFC3261]交換を介します。ソースEIDは、ホストの「ローカル」IPアドレスを設定するために使用される既存のメカニズムを介して取得されます。パブリックインターネットで使用されるEIDは、その方法で使用される他のIPアドレスと同じプロパティを持つ必要があります。これは、とりわけ、グローバルに一意でなければならないことを意味します。 EIDは、ホストが配置されているサイトに関連付けられたEIDプレフィックスブロックからホストに割り当てられます。ホストは、EIDを使用して他のホストを参照できます。 EIDはLISP RLOCとして使用してはなりません。 EIDブロックは、マッピングデータベースのスケーリングを容易にするために、ネットワークトポロジーとは関係なく、階層的に割り当てることができることに注意してください。さらに、サイトに割り当てられたEIDブロックには、サイト内でルーティングするためのサイトローカル構造（サブネット化）がある場合があります。この構造は、グローバルルーティングシステムからは見えません。理論的には、あるデバイスのEIDを表すビット文字列は、別のデバイスのRLOCを表すことができます。アーキテクチャが実現されると、特定のビット文字列がRLOCとEIDの両方である場合、どちらの場合も同じエンティティを参照する必要があります。他のロケーター/ ID分離提案との「ディスカッション」で使用される場合、LISP EIDは「LEID」と呼ばれます。このドキュメント全体を通して、「EID」への言及はすべてLEIDを指します。"
    },
    {
      "indent": 3,
      "text": "Extended EID (XEID): a LISP EID, optionally extended with a non-zero Instance ID (IID) if the EID is intended for use in a context where it may not be a unique value, such as in a Virtual Private Network where private address space [RFC1918] is used. See Section 5.5 of [RFC6830] for more discussion of IIDs.",
      "ja": "拡張EID（XEID）：LISP EID。オプションで、ゼロ以外のインスタンスID（IID）で拡張されます。EIDが、プライベートな仮想プライベートネットワークなど、一意の値ではないコンテキストでの使用を目的としている場合アドレス空間[RFC1918]が使用されます。 IIDの詳細については、[RFC6830]のセクション5.5をご覧ください。"
    },
    {
      "indent": 0,
      "text": " Routing Locator (RLOC): an IPv4 [RFC791] or IPv6 [RFC2460] address of an Egress Tunnel Router (ETR). An RLOC is the output of an EID-to-RLOC mapping lookup. An EID maps to one or more RLOCs. Typically, RLOCs are numbered from topologically aggregatable blocks that are assigned to a site at each point to which it attaches to the global Internet; where the topology is defined by the connectivity of provider networks, RLOCs can be thought of as Provider-Assigned (PA) addresses. Multiple RLOCs can be assigned to the same ETR device or to multiple ETR devices at a site.",
      "ja": "ルーティングロケータ（RLOC）：出力トンネルルーター（ETR）のIPv4 [RFC791]またはIPv6 [RFC2460]アドレス。 RLOCは、EIDからRLOCへのマッピングルックアップの出力です。 EIDは1つ以上のRLOCにマップします。通常、RLOCは、グローバルインターネットに接続する各ポイントでサイトに割り当てられるトポロジ的に集約可能なブロックから番号が付けられます。トポロジがプロバイダーネットワークの接続によって定義される場合、RLOCはプロバイダー割り当て（PA）アドレスと考えることができます。複数のRLOCを同じETRデバイスまたはサイトの複数のETRデバイスに割り当てることができます。"
    },
    {
      "indent": 3,
      "text": "DDT node: a network infrastructure component responsible for specific XEID-prefix(es) and for the delegation of more-specific sub-prefixes to other DDT nodes.",
      "ja": "DDTノード：特定のXEIDプレフィックス、および他のDDTノードへのより具体的なサブプレフィックスの委任を担当するネットワークインフラストラクチャコンポーネント。"
    },
    {
      "indent": 3,
      "text": "DDT client: a network infrastructure component that sends DDT Map-Request messages and implements the iterative following of Map-Referral results. Typically, a DDT client will be a Map-Resolver (as defined by [RFC6833]), but it is also possible for an ITR to implement DDT client functionality. A DDT client can be a device that is originating \"rig\" requests.",
      "ja": "DDTクライアント：DDT Map-Requestメッセージを送信し、Map-Referralの結果に続く反復を実装するネットワークインフラストラクチャコンポーネント。通常、DDTクライアントはMap-Resolver（[RFC6833]で定義）ですが、ITRがDDTクライアント機能を実装することも可能です。 DDTクライアントは、「リグ」リクエストを発信するデバイスにすることができます。"
    },
    {
      "indent": 3,
      "text": "DDT Map-Server: a DDT node that also implements Map-Server functionality (forwarding Map-Requests and/or returning Map-Replies if offering a proxy Map-Reply service) for a subset of its delegated prefixes. Map-Server functions, including proxying Map-Replies, are described in [RFC6833].",
      "ja": "DDT Map-Server：委任されたプレフィックスのサブセットに対してMap-Server機能（Map-Requestの転送、および/またはプロキシMap-Replyサービスを提供している場合はMap-Repliesを返す）も実装するDDTノード。 Map-Repliesのプロキシを含むMap-Server関数は、[RFC6833]で説明されています。"
    },
    {
      "indent": 3,
      "text": "DDT Map-Resolver: a network infrastructure element that accepts a Map-Request, adds the XEID to its lookup queue, then queries one or more DDT nodes for the requested EID, following returned referrals until it receives one with the MS-ACK action code [RFC8111]. This indicates that the Map-Request has been sent to a Map-Server that will forward it to an ETR that, in turn, will provide a Map-Reply to the original sender. A DDT Map-Resolver maintains both (1) a cache of Map-Referral message results (termed the \"referral cache\") containing RLOCs for DDT nodes responsible for XEID-prefixes of interest and (2) a lookup queue of XEIDs that are being resolved through iterative querying of DDT nodes.",
      "ja": "DDT Map-Resolver：Map-Requestを受け入れ、XEIDをルックアップキューに追加し、要求されたEIDについて1つ以上のDDTノードにクエリを送信し、MS-ACKアクションコードで参照を受け取るまで、返された参照をたどります。 [RFC8111]。これは、Map-RequestがMap-Serverに送信され、ETRに転送されることで、元の送信者にMap-Replyが提供されることを示しています。 DDT Map-Resolverは、（1）対象のXEIDプレフィックスを担当するDDTノードのRLOCを含むMap-Referralメッセージ結果のキャッシュ（「参照キャッシュ」と呼ばれます）と、（2）処理中のXEIDのルックアップキューの両方を維持します。 DDTノードの反復クエリによって解決されます。"
    },
    {
      "indent": 3,
      "text": "Encapsulated Map-Request: a LISP Map-Request that is carried within an Encapsulated Control Message (ECM) and that has an additional LISP header prepended. Sent to UDP destination port 4342. The \"outer\" addresses are globally routable IP addresses, also known as RLOCs. Used by an ITR when sending a Map-Request to a Map-Resolver and by a Map-Server when forwarding a Map-Request to an ETR as documented in [RFC6833].",
      "ja": "カプセル化されたマップ要求：カプセル化された制御メッセージ（ECM）内で運ばれ、追加のLISPヘッダーが前に付いているLISPマップ要求。 UDP宛先ポート4342に送信されます。「外部」アドレスは、グローバルにルーティング可能なIPアドレスであり、RLOCとも呼ばれます。 [RFC6833]で文書化されているように、Map-RequestをMap-Resolverに送信するときにITRによって使用され、Map-RequestをETRに転送するときにMap-Serverによって使用されます。"
    },
    {
      "indent": 0,
      "text": " Map-Referral: a LISP message sent by a DDT node when it receives a DDT Map-Request for an XEID that matches a configured XEID-prefix delegation. A non-Negative Map-Referral message includes a \"referral\" -- a set of RLOCs for DDT nodes that have more information about the sub-prefix; a DDT client \"follows the referral\" by sending another DDT Map-Request to one of those RLOCs to obtain either an answer or another referral to DDT nodes responsible for a more-specific XEID-prefix.",
      "ja": "Map-Referral：構成されたXEIDプレフィックス委任と一致するXEIDのDDT Map-Requestを受信したときにDDTノードによって送信されるLISPメッセージ。非負のMap-Referralメッセージには、「参照」、つまりサブプレフィックスに関する詳細情報を持つDDTノードの一連のRLOCが含まれます。 DDTクライアントは、別のDDT Map-RequestをそれらのRLOCの1つに送信して、より具体的なXEIDプレフィックスを担当するDDTノードへの回答または別の紹介を取得することにより、「紹介をフォロー」します。"
    },
    {
      "indent": 3,
      "text": "Authoritative XEID-prefix: an XEID-prefix delegated to a DDT node and for which the DDT node may provide further delegations of more-specific sub-prefixes.",
      "ja": "権限のあるXEIDプレフィックス：DDTノードに委任され、DDTノードがより具体的なサブプレフィックスの委任を提供できるXEIDプレフィックス。"
    },
    {
      "indent": 0,
      "text": "4. Basic Overview",
      "section_title": true,
      "ja": "4. 基本的な概要"
    },
    {
      "indent": 3,
      "text": "LISP-DDT [RFC8111] is a hierarchical distributed database that embodies the delegation of authority to provide mappings from LISP EIDs to RLOCs. It is a statically defined distribution of the EID namespace among a set of LISP-speaking servers called \"DDT nodes\". Each DDT node is configured as \"authoritative\" for one or more EID-prefixes, along with the set of RLOCs for Map-Servers or \"child\" DDT nodes to which more-specific EID-prefixes are delegated.",
      "ja": "LISP-DDT [RFC8111]は、LISP EIDからRLOCへのマッピングを提供する権限の委任を具体化する階層型分散データベースです。これは、「DDTノード」と呼ばれる一連のLISP対応サーバー間のEID名前空間の静的に定義された分散です。各DDTノードは、1つ以上のEIDプレフィックスに対して「権限のある」ものとして構成され、さらにMap-ServerのRLOCのセット、またはより具体的なEIDプレフィックスが委任される「子」のDDTノードとして構成されます。"
    },
    {
      "indent": 3,
      "text": "Map-Resolvers send Map-Requests to the DDT hierarchy and maintain referral caches by receiving Map-Referral messages from DDT nodes. Map-Resolvers follow the DDT hierarchy for a given EID lookup based on the EID-prefix and delegation referrals contained in the Map-Referral messages. The \"rig\" tool is intended to perform the same operation as that of a Map-Resolver but to also be used as a management tool for the network administrator.",
      "ja": "Map-ResolversはMap-RequestをDDT階層に送信し、DDTノードからMap-Referralメッセージを受信することで参照キャッシュを維持します。 Map-Resolverは、Map-Referralメッセージに含まれるEIDプレフィックスと委任参照に基づいて、特定のEIDルックアップのDDT階層に従います。 「rig」ツールは、Map-Resolverと同じ操作を実行することを目的としていますが、ネットワーク管理者の管理ツールとしても使用されます。"
    },
    {
      "indent": 3,
      "text": "When the \"rig\" command is run, an Encapsulated Control Message Map-Request is sent for a destination EID. When a LISP-DDT Map-Referral is returned, the contents are displayed to the user. The information displayed includes:",
      "ja": "「rig」コマンドが実行されると、カプセル化された制御メッセージマップ要求が宛先EIDに送信されます。 LISP-DDT Map-Referralが返されると、コンテンツがユーザーに表示されます。表示される情報は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o A delegated EID-prefix configured in a DDT node or a configured site EID-prefix in a DDT Map-Server that matches the requested EID.",
      "ja": "o DDTノードで構成された委任されたEIDプレフィックス、または要求されたEIDと一致するDDT Map-Serverで構成されたサイトEIDプレフィックス。"
    },
    {
      "indent": 3,
      "text": "o The type of DDT node that sent the Map-Referral.",
      "ja": "o Map-Referralを送信したDDTノードのタイプ。"
    },
    {
      "indent": 3,
      "text": "o The action code and TTL set by the sender of the Map-Referral.",
      "ja": "o Map-Referralの送信者によって設定されたアクションコードとTTL。"
    },
    {
      "indent": 3,
      "text": "o The referral RLOC addresses from the Map-Referral message.",
      "ja": "o Map-Referralメッセージからの参照RLOCアドレス。"
    },
    {
      "indent": 3,
      "text": "o A round-trip-time estimate for the ECM-Map-Request / Map-Referral message exchange.",
      "ja": "o ECM-Map-Request / Map-Referralメッセージ交換の往復時間の見積もり。"
    },
    {
      "indent": 3,
      "text": "A possible syntax for a \"rig\" command MAY be:",
      "ja": "「rig」コマンドの可能な構文は次のようになります。"
    },
    {
      "indent": 3,
      "text": "rig [instance-id <iid>] <eid> to <ddt-node> [follow-all-referrals]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Parameter descriptions:",
      "ja": "パラメータの説明："
    },
    {
      "indent": 3,
      "text": "[instance-id <iid>]: <iid> is the IID portion of the XEID used as a VPN identifier or for other future purposes. When the DDT hierarchy is not configured with IIDs, this argument is omitted from the command line.",
      "ja": "[instance-id <iid>]：<iid>は、VPN識別子として、または他の将来の目的で使用されるXEIDのIID部分です。 DDT階層がIIDで構成されていない場合、この引数はコマンドラインから省略されます。"
    },
    {
      "indent": 3,
      "text": "<eid>: <eid> is either a Fully Qualified Domain Name or a destination EID that is being queried in the LISP-DDT mapping database.",
      "ja": "<eid>：<eid>は、完全修飾ドメイン名またはLISP-DDTマッピングデータベースで照会される宛先EIDのいずれかです。"
    },
    {
      "indent": 3,
      "text": "<ddt-node>: <ddt-node> is the RLOC address of any DDT node in the DDT hierarchy. This can be the DDT root node, a DDT transit node, or a DDT Map-Server.",
      "ja": "<ddt-node>：<ddt-node>は、DDT階層内のDDTノードのRLOCアドレスです。これは、DDTルートノード、DDTトランジットノード、またはDDT Map-Serverにすることができます。"
    },
    {
      "indent": 3,
      "text": "[follow-all-referrals]: When this keyword is used, each referral RLOC is queried so \"rig\" can descend the entire DDT hierarchy starting from the node <ddt-node>. When this keyword is not used, one of the referral RLOCs will be selected to descend a branch of the DDT hierarchy.",
      "ja": "[follow-all-referrals]：このキーワードを使用すると、各リファラルRLOCが照会されるため、 \"rig\"はノード<ddt-node>から開始してDDT階層全体を下ることができます。このキーワードが使用されない場合、参照RLOCの1つが選択されて、DDT階層の分岐を降ります。"
    },
    {
      "indent": 3,
      "text": "The \"rig\" utility not only shows branches of the delegation hierarchy but can also report:",
      "ja": "「rig」ユーティリティは、委任階層のブランチを表示するだけでなく、次のことも報告できます。"
    },
    {
      "indent": 3,
      "text": "o When a DDT Map-Server would forward a Map-Request to the ETRs at a registered LISP site. This is known as an \"MS-ACK\" action.",
      "ja": "o DDT Map-Serverが登録済みLISPサイトのETRにMap-Requestを転送する場合。これは「MS-ACK」アクションと呼ばれます。"
    },
    {
      "indent": 3,
      "text": "o When a DDT Map-Server sends a Negative Map-Referral indicating that a requested EID is configured but not registered to the mapping database system. This is known as an \"MS-NOT-REGISTERED\" action.",
      "ja": "o DDT Map-Serverが、要求されたEIDが構成されているがマッピングデータベースシステムに登録されていないことを示す負のMap-Referralを送信したとき。これは「MS-NOT-REGISTERED」アクションとして知られています。"
    },
    {
      "indent": 3,
      "text": "o When a DDT node is sending referrals for a transit or leaf node in the hierarchy. These are known as \"NODE-REFERRAL\" and \"MS-REFERRAL\" actions, respectively.",
      "ja": "o DDTノードが階層内のトランジットノードまたはリーフノードの紹介を送信しているとき。これらはそれぞれ「NODE-REFERRAL」および「MS-REFERRAL」アクションとして知られています。"
    },
    {
      "indent": 3,
      "text": "o When a DDT node finds a hole in the address space that has not been allocated or configured in the delegation hierarchy. This is typically associated with a hole in a DDT node's configured authoritative prefix. This is known as a \"DELEGATION-HOLE\" action.",
      "ja": "o DDTノードが、委任階層で割り当てられていない、または構成されていないアドレス空間の穴を見つけたとき。これは通常、DDTノードの構成された信頼できるプレフィックスの穴に関連付けられています。これは、「DELEGATION-HOLE」アクションとして知られています。"
    },
    {
      "indent": 3,
      "text": "o When a DDT node finds a hole in the address space that has not been allocated or configured in the delegation hierarchy at all. This is typically associated with a hole that is outside of a DDT node's authoritative prefix. This is known as a \"NOT-AUTHORITATIVE\" action.",
      "ja": "o DDTノードが、委任階層に割り当てられていないか、構成されていないアドレス空間の穴を見つけたとき。これは通常、DDTノードの信頼できる接頭辞の外側にある穴に関連付けられています。これは「NOT-AUTHORITATIVE」アクションとして知られています。"
    },
    {
      "indent": 3,
      "text": "Refer to [RFC8111] for more details about Map-Referral actions.",
      "ja": "Map-Referralアクションの詳細については、[RFC8111]を参照してください。"
    },
    {
      "indent": 0,
      "text": "5. Implementation Details",
      "section_title": true,
      "ja": "5. 実装の詳細"
    },
    {
      "indent": 3,
      "text": "The Cisco LISP prototype implementations on IOS and NX-OS have \"rig\" support for IPv4 and IPv6 EIDs in either the default instance or a non-zero IID.",
      "ja": "IOSおよびNX-OSでのCisco LISPプロトタイプ実装は、デフォルトインスタンスまたはゼロ以外のIIDのいずれかで、IPv4およびIPv6 EIDの「リグ」サポートを備えています。"
    },
    {
      "indent": 3,
      "text": "The IOS syntax is:",
      "ja": "IOS構文は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "rig [instance-id <iid>] <eid> to <ddt-node> [follow-all-referrals]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "The NX-OS syntax is:",
      "ja": "NX-OSの構文は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "rig [instance-id <iid>] { <hostname> | {<eid> | <eid6>} }\n                        to { <ddt-hostname> | {<ddt> | <ddt6>} }",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Here is some sample IOS output:",
      "ja": "次に、IOSの出力例をいくつか示します。"
    },
    {
      "indent": 3,
      "text": "Router# rig 12.0.1.1 to 1.1.1.1",
      "ja": "Router＃rig 12.0.1.1から1.1.1.1"
    },
    {
      "indent": 3,
      "text": "Send Map-Request to DDT-node 1.1.1.1 ... node referral, rtt: 0 ms\nEID-prefix: [0] 12.0.0.0/16, ttl: 1440\nreferrals: 2.2.2.2",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Send Map-Request to DDT-node 2.2.2.2 ... node referral, rtt: 0 ms\nEID-prefix: [0] 12.0.1.0/24, ttl: 1440\nreferrals: 4.4.4.4, 5.5.5.5",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Send Map-Request to DDT-node 4.4.4.4 ... map-server acknowledgement, rtt: 0 ms EID-prefix: [0] 12.0.1.0/28, ttl: 1440 referrals: 4.4.4.4, 5.5.5.5",
      "ja": "Map-RequestをDDTノード4.4.4.4に送信... map-server確認応答、rtt：0 ms EIDプレフィックス：[0] 12.0.1.0/28、ttl：1440リフェラル：4.4.4.4、5.5.5.5"
    },
    {
      "indent": 3,
      "text": "Router# rig 12.0.1.1 to 1.1.1.1 follow-all-referrals",
      "ja": "Router＃rig 12.0.1.1〜1.1.1.1 follow-all-referrals"
    },
    {
      "indent": 0,
      "text": "   Send Map-Request to DDT-node 1.1.1.1 ... node referral, rtt: 4 ms\n   EID-prefix: [0] 12.0.0.0/16, ttl: 1440\n   referrals: 2.2.2.2\n   Send Map-Request to DDT-node 2.2.2.2 ... node referral, rtt: 0 ms\n   EID-prefix: [0] 12.0.1.0/24, ttl: 1440\n   referrals: 4.4.4.4, 5.5.5.5",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Send Map-Request to DDT-node 4.4.4.4 ... map-server acknowledgement, rtt: 0 ms EID-prefix: [0] 12.0.1.0/28, ttl: 1440 referrals: 4.4.4.4, 5.5.5.5",
      "ja": "Map-RequestをDDTノード4.4.4.4に送信... map-server確認応答、rtt：0 ms EIDプレフィックス：[0] 12.0.1.0/28、ttl：1440リフェラル：4.4.4.4、5.5.5.5"
    },
    {
      "indent": 3,
      "text": "Send Map-Request to DDT-node 5.5.5.5 ... map-server acknowledgement, rtt: 0 ms EID-prefix: [0] 12.0.1.0/28, ttl: 1440 referrals: 4.4.4.4, 5.5.5.5",
      "ja": "Map-RequestをDDTノード5.5.5.5に送信... map-server確認、rtt：0 ms EIDプレフィックス：[0] 12.0.1.0/28、ttl：1440参照：4.4.4.4、5.5.5.5"
    },
    {
      "indent": 3,
      "text": "No more referrals to pursue.",
      "ja": "追跡する紹介はもうありません。"
    },
    {
      "indent": 3,
      "text": "Here is some sample NX-OS output:",
      "ja": "次に、NX-OSの出力例をいくつか示します。"
    },
    {
      "indent": 3,
      "text": "Router# rig 12.0.1.1 to 1.1.1.1",
      "ja": "Router＃rig 12.0.1.1から1.1.1.1"
    },
    {
      "indent": 3,
      "text": "rig LISP-DDT hierarchy for EID [0] 12.0.1.1\nSend Map-Request to DDT-node 1.1.1.1 ... replied, rtt: 0.003509 secs\nEID-prefix [0] *, ttl: 1440, action: node-referral, referrals:\n  2.2.2.2, priority/weight: 0/0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Send Map-Request to DDT-node 2.2.2.2 ... replied, rtt: 0.003173 secs\nEID-prefix [0] 12.0.0.0/20, ttl: 1440, action: node-referral,\n  referrals:\n  3.3.3.3, priority/weight: 0/0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Send Map-Request to DDT-node 3.3.3.3 ... replied, rtt: 0.004145 secs\nEID-prefix [0] 12.0.1.0/24, ttl: 1440, action: node-referral,\n  referrals:\n  5.5.5.5, priority/weight: 0/0\n  6.6.6.6, priority/weight: 0/0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Send Map-Request to DDT-node 6.6.6.6 ... replied, rtt: 0.005800 secs\nEID-prefix [0] 12.0.1.0/28, ttl: 1440, action: ms-ack, referrals:\n  5.5.5.5, priority/weight: 0/0\n  6.6.6.6, priority/weight: 0/0",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The use of \"rig\" does not affect the security of the LISP infrastructure, as it is simply a tool that facilitates diagnostic querying. See [RFC6830], [RFC6833], [RFC7835], and [RFC8111] for descriptions of the security properties of the LISP infrastructure.",
      "ja": "「リグ」を使用しても、LISPインフラストラクチャのセキュリティには影響しません。これは、単に診断クエリを容易にするツールであるためです。 LISPインフラストラクチャのセキュリティプロパティの説明については、[RFC6830]、[RFC6833]、[RFC7835]、および[RFC8111]を参照してください。"
    },
    {
      "indent": 3,
      "text": "LISP \"rig\" provides easy access to the information in the public mapping database. Therefore, it is important to protect the mapping information for private use. This can be provided by disallowing access to specific mapping entries or placing such entries in a private mapping database system.",
      "ja": "LISPの「リグ」を使用すると、パブリックマッピングデータベースの情報に簡単にアクセスできます。したがって、個人使用のためにマッピング情報を保護することが重要です。これは、特定のマッピングエントリへのアクセスを禁止するか、そのようなエントリをプライベートマッピングデータベースシステムに配置することで提供できます。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not require any IANA actions.",
      "ja": "このドキュメントでは、IANAアクションは必要ありません。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC791] Postel, J., \"Internet Protocol\", STD 5, RFC 791, DOI 10.17487/RFC0791, September 1981, <http://www.rfc-editor.org/info/rfc791>.",
      "ja": "[RFC791] Postel、J。、「インターネットプロトコル」、STD 5、RFC 791、DOI 10.17487 / RFC0791、1981年9月、<http://www.rfc-editor.org/info/rfc791>。"
    },
    {
      "indent": 3,
      "text": "[RFC1034] Mockapetris, P., \"Domain names - concepts and facilities\", STD 13, RFC 1034, DOI 10.17487/RFC1034, November 1987, <http://www.rfc-editor.org/info/rfc1034>.",
      "ja": "[RFC1034] Mockapetris、P。、「ドメイン名-概念と機能」、STD 13、RFC 1034、DOI 10.17487 / RFC1034、1987年11月、<http://www.rfc-editor.org/info/rfc1034>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC6830] Farinacci, D., Fuller, V., Meyer, D., and D. Lewis, \"The Locator/ID Separation Protocol (LISP)\", RFC 6830, DOI 10.17487/RFC6830, January 2013, <http://www.rfc-editor.org/info/rfc6830>.",
      "ja": "[RFC6830]ファリナッチ、D。、フラー、V。、マイヤー、D。、およびD.ルイス、「ロケータ/ ID分離プロトコル（LISP）」、RFC 6830、DOI 10.17487 / RFC6830、2013年1月、<http：/ /www.rfc-editor.org/info/rfc6830>。"
    },
    {
      "indent": 3,
      "text": "[RFC6833] Fuller, V. and D. Farinacci, \"Locator/ID Separation Protocol (LISP) Map-Server Interface\", RFC 6833, DOI 10.17487/RFC6833, January 2013, <http://www.rfc-editor.org/info/rfc6833>.",
      "ja": "[RFC6833] Fuller、V。およびD. Farinacci、「Locator / ID Separation Protocol（LISP）Map-Server Interface」、RFC 6833、DOI 10.17487 / RFC6833、2013年1月、<http://www.rfc-editor.org / info / rfc6833>。"
    },
    {
      "indent": 3,
      "text": "[RFC6835] Farinacci, D. and D. Meyer, \"The Locator/ID Separation Protocol Internet Groper (LIG)\", RFC 6835, DOI 10.17487/RFC6835, January 2013, <http://www.rfc-editor.org/info/rfc6835>.",
      "ja": "[RFC6835] Farinacci、D。およびD. Meyer、「The Locator / ID Separation Protocol Internet Groper（LIG）」、RFC 6835、DOI 10.17487 / RFC6835、2013年1月、<http://www.rfc-editor.org/ info / rfc6835>。"
    },
    {
      "indent": 3,
      "text": "[RFC8111] Fuller, V., Lewis, D., Ermagan, V., Jain, A., and A. Smirnov, \"Locator/ID Separation Protocol Delegated Database Tree (LISP-DDT)\", RFC 8111, DOI 10.17487/RFC8111, May 2017, <http://www.rfc-editor.org/info/rfc8111>.",
      "ja": "[RFC8111] Fuller、V.、Lewis、D.、Ermagan、V.、Jain、A。、およびA. Smirnov、「Locator / ID Separation Protocol Delegated Database Tree（LISP-DDT）」、RFC 8111、DOI 10.17487 / RFC8111、2017年5月、<http://www.rfc-editor.org/info/rfc8111>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <http://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<http://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, B., Karrenberg, D., de Groot, G., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, DOI 10.17487/RFC1918, February 1996, <http://www.rfc-editor.org/info/rfc1918>.",
      "ja": "[RFC1918] Rekhter、Y.、Moskowitz、B.、Karrenberg、D.、de Groot、G。、およびE. Lear、「プライベートインターネットのアドレス割り当て」、BCP 5、RFC 1918、DOI 10.17487 / RFC1918、1996年2月、<http://www.rfc-editor.org/info/rfc1918>。"
    },
    {
      "indent": 3,
      "text": "[RFC2460] Deering, S. and R. Hinden, \"Internet Protocol, Version 6 (IPv6) Specification\", RFC 2460, DOI 10.17487/RFC2460, December 1998, <http://www.rfc-editor.org/info/rfc2460>.",
      "ja": "[RFC2460] Deering、S。およびR. Hinden、「インターネットプロトコル、バージョン6（IPv6）仕様」、RFC 2460、DOI 10.17487 / RFC2460、1998年12月、<http://www.rfc-editor.org/info/ rfc2460>。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, DOI 10.17487/RFC3261, June 2002, <http://www.rfc-editor.org/info/rfc3261>.",
      "ja": "[RFC3261] Rosenberg、J.、Schulzrinne、H.、Camarillo、G.、Johnston、A.、Peterson、J.、Sparks、R.、Handley、M。、およびE. Schooler、「SIP：Session Initiation Protocol」 、RFC 3261、DOI 10.17487 / RFC3261、2002年6月、<http://www.rfc-editor.org/info/rfc3261>。"
    },
    {
      "indent": 3,
      "text": "[RFC7835] Saucez, D., Iannone, L., and O. Bonaventure, \"Locator/ID Separation Protocol (LISP) Threat Analysis\", RFC 7835, DOI 10.17487/RFC7835, April 2016, <http://www.rfc-editor.org/info/rfc7835>.",
      "ja": "[RFC7835] Saucez、D.、Iannone、L。、およびO. Bonaventure、「Locator / ID Separation Protocol（LISP）Threat Analysis」、RFC 7835、DOI 10.17487 / RFC7835、2016年4月、<http：//www.rfc -editor.org/info/rfc7835>。"
    },
    {
      "indent": 3,
      "text": "[RFC8060] Farinacci, D., Meyer, D., and J. Snijders, \"LISP Canonical Address Format (LCAF)\", RFC 8060, DOI 10.17487/RFC8060, February 2017, <http://www.rfc-editor.org/info/rfc8060>.",
      "ja": "[RFC8060] Farinacci、D.、Meyer、D。、およびJ. Snijders、「LISP Canonical Address Format（LCAF）」、RFC 8060、DOI 10.17487 / RFC8060、2017年2月、<http：//www.rfc-editor。 org / info / rfc8060>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Damien Saucez and Fabio Maino for their ideas and comments. Appreciation also goes to Joel Halpern, Luigi Iannone, and Nevil Brownlee for their help with this document.",
      "ja": "著者は、彼らのアイデアとコメントについてDamien SaucezとFabio Mainoに感謝したいと思います。 Joel Halpern、Luigi Iannone、Nevil Brownleeもこのドキュメントの作成に協力してくれました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dino Farinacci lispers.net San Jose, California United States of America",
      "ja": "Dino Farinacci lispers.netサンノゼ、カリフォルニア州アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Phone: 408-718-2001 Email: farinacci@gmail.com",
      "ja": "電話：408-718-2001メール：farinacci@gmail.com"
    },
    {
      "indent": 3,
      "text": "Amit Jain Juniper Networks San Jose, California United States of America",
      "ja": "アミットジャイナジュニパーネットワークスサンノゼ、カリフォルニア州アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: atjain@juniper.net",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Isidor Kouvelas Arista Santa Clara, California United States of America",
      "ja": "イシドールクベラスエクセレントサンタクララ、カリフォルニア州アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: kouvelas@arista.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Darrel Lewis Cisco Systems Tasman Ave. San Jose, California United States of America",
      "ja": "ダレルルイスシスコシステムズタスマンアベニューカリフォルニア州サンノゼアメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: darlewis@cisco.com",
      "raw": true,
      "ja": ""
    }
  ]
}