{
  "title": {
    "text": "RFC 8546 - The Wire Image of a Network Protocol",
    "ja": "RFC 8546 - ネットワークプロトコルのワイヤーイメージ"
  },
  "number": 8546,
  "created_at": "2019-10-29 23:13:25.662721+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Architecture Board (IAB)                            B. Trammell\nRequest for Comments: 8546                                 M. Kuehlewind\nCategory: Informational                                       April 2019\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 18,
      "text": "The Wire Image of a Network Protocol",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines the wire image, an abstraction of the information available to an on-path non-participant in a networking protocol. This abstraction is intended to shed light on the implications that increased encryption has for network functions that use the wire image.",
      "ja": "この文書は、ワイヤ画像、ネットワークプロトコルにおけるオン経路非参加者に利用可能な情報の抽象化を定義します。この抽象化は、暗号化は、ワイヤ画像を使用するネットワーク機能に対して有する影響の増加に光を当てることを意図しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. It represents the consensus of the Internet Architecture Board (IAB). Documents approved for publication by the IAB are not candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットアーキテクチャ委員会（IAB）の製品であり、IABは、永久的な記録を提供するために貴重なものとみなされたことの情報を表します。これは、インターネットアーキテクチャ委員会（IAB）のコンセンサスを表しています。 IABによって公表のために承認された文書はインターネットStandardのどんなレベルの候補ではありません。 RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8546.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttps://www.rfc-editor.org/info/rfc8546で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2019 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2019 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（https://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Definition  . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Discussion  . . . . . . . . . . . . . . . . . . . . . . . . .   3\n  3.1.  The Extent of the Wire Image  . . . . . . . . . . . . . .   4\n  3.2.  Obscuring Timing and Sizing Information . . . . . . . . .   5\n  3.3.  Integrity Protection of the Wire Image  . . . . . . . . .   5\n4.  Engineering the Wire Image  . . . . . . . . . . . . . . . . .   6\n  4.1.  Declaring Protocol Invariants . . . . . . . . . . . . . .   7\n  4.2.  Trustworthiness of Engineered Signals . . . . . . . . . .   7\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   8\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   8\n7.  Informative References  . . . . . . . . . . . . . . . . . . .   8\nIAB Members at the Time of Approval . . . . . . . . . . . . . . .   9\nAcknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .   9\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  10",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "A protocol specification defines a set of behaviors for each participant in the protocol: which lower-layer protocols are used for which services, how messages are formatted and protected, which participant sends which message when, how each participant should respond to each message, and so on.",
      "ja": "下位層プロトコルは、各参加者がそれぞれのメッセージに応答する方法と、参加者がそのメッセージを送信するメッセージをフォーマットし、保護されている方法れるサービスのために使用され、そして：プロトコル仕様は、プロトコル内の各参加者のために行動のセットを定義します上のようにします。"
    },
    {
      "indent": 3,
      "text": "Implicit in a protocol specification is the information the protocol radiates toward nonparticipant observers of the messages sent among participants, often including participants in lower-layer protocols. Any information that has a clear definition in the protocol's message format(s), or is implied by that definition, and is not cryptographically confidentiality protected can be unambiguously interpreted by those observers. This information comprises the protocol's wire image, which we define and discuss in this document.",
      "ja": "プロトコル仕様の暗黙のプロトコルは、多くの場合、下位層プロトコルの参加者を含め、参加者の間で送信されるメッセージの不参加観察者に向かって放射する情報です。プロトコルのメッセージ形式（S）で明確な定義を有する、又はその定義によって暗示され、暗号機密保護されていない任意の情報が明確にそれらの観察者によって解釈することができます。この情報は、私たちは、この文書で定義して議論するプロトコルのワイヤ画像を含みます。"
    },
    {
      "indent": 3,
      "text": "The wire image, not the protocol's specification, determines how third parties on the network paths among protocol participants will interact with that protocol.",
      "ja": "線画像ではなく、プロトコルの仕様、プロトコル参加者間のネットワーク経路上の第三者がそのプロトコルと対話する方法を決定します。"
    },
    {
      "indent": 3,
      "text": "The increasing deployment of transport-layer security [RFC8446] to protect application-layer headers and payload, as well as the definition and deployment of transport protocols with encrypted control information such as QUIC [QUIC], brings new relevance to the question of how third parties on the network paths will interact with a protocol. QUIC is, in effect, the first IETF-defined transport protocol to take care of the minimization of its own wire image to prevent ossification and improve end-to-end privacy by reducing information radiation.",
      "ja": "このようQUIC [QUIC]として暗号化された制御情報とアプリケーション層のヘッダおよびペイロードだけでなく、トランスポートプロトコルの定義と展開を保護するために、トランスポート・レイヤ・セキュリティ[RFC8446]の増加展開は、どのように第三の質問には、新たな関連性をもたらしますネットワーク経路上の当事者は、プロトコルと相互に作用します。 QUICは、実際には、骨形成を防止し、情報の輻射を低減することにより、エンドツーエンドのプライバシーを改善するために、独自の線画像の最小化の世話をするために最初のIETF定義のトランスポートプロトコルです。"
    },
    {
      "indent": 3,
      "text": "The flip side of this trend is the impact of a less visible wire image on various functions driven by third-party observation of the wire image. In contrast to ongoing discussions about this tussle, this document treats the wire image as a pure abstraction, with the hope that it can shed some light on these discussions.",
      "ja": "この傾向のフリップ側は、ワイヤ画像のサードパーティの観察によって駆動される様々な機能に目立た線画像の影響です。この闘争について継続的な議論とは対照的に、この文書では、それはこれらの議論にいくつかの光を当てることができることを期待して、純粋な抽象化とワイヤ画像を扱います。"
    },
    {
      "indent": 0,
      "text": "2. Definition",
      "section_title": true,
      "ja": "2.定義"
    },
    {
      "indent": 3,
      "text": "The wire image of the set of protocols in use for a given communication is the view of that set of protocols as observed by an entity not participating in the communication. It is the sequence of packets sent by each participant in the communication, including the content of those packets and metadata about the observation itself: the time at which each packet is observed and the vantage point of the observer.",
      "ja": "通信に参加していないエンティティによって観察されるように、所与の通信のために使用されているプロトコルのセットの線画像は、プロトコルの集合を示す図です。各パケットが観測された時刻と観察者の視点：これは、観測自体に関するそれらのパケットのコンテンツおよびメタデータを含む通信中の各参加者によって送信されたパケットのシーケンスです。"
    },
    {
      "indent": 0,
      "text": "3. Discussion",
      "section_title": true,
      "ja": "3.ディスカッション"
    },
    {
      "indent": 3,
      "text": "This definition illustrates some important properties of the wire image.",
      "ja": "この定義は、ワイヤ画像のいくつかの重要な特性を示しています。"
    },
    {
      "indent": 3,
      "text": "It is key that the wire image is not limited to merely \"the unencrypted bits in the header\". In particular, the metadata, such as sequences of interpacket timing and packet sizes, can be used to infer other parameters of the behavior of the protocols in use or to fingerprint protocols and/or specific implementations of those protocols; see Section 3.2.",
      "ja": "ワイヤ画像を単に「ヘッダ内の暗号化されていないビット」に限定されないことが鍵です。特に、そのようなパケット間タイミングとパケットサイズの配列のようなメタデータは、使用中又は指紋プロトコルおよび/またはそれらのプロトコルの特定の実装にプロトコルの動作の他のパラメータを推定するために使用することができます。 3.2節を参照してください。"
    },
    {
      "indent": 3,
      "text": "An important implication of this property is that a protocol that uses confidentiality protection for the headers it needs to operate can be deliberately designed to have a specified wire image that is separate from that machinery; see Section 4. Note that this is a capability unique to encrypted protocols. Parts of a wire image may also be made visible to devices on path, but immutable through end-to-end integrity protection; see Section 3.3.",
      "ja": "このプロパティの重要な意味は、それが動作する必要があるヘッダーの機密保護を使用するプロトコルは、意図的にその機械から分離されている指定されたワイヤ画像を有するように設計することができることです。これは暗号化されたプロトコルに固有の機能であることを第4の注を参照してください。線画像の部分はまた、経路上のデバイスに見えるようにするが、エンドツーエンドの完全性保護を介して不変されてもよいです。 3.3節を参照してください。"
    },
    {
      "indent": 3,
      "text": "Portions of the wire image of a protocol stack that are neither confidentiality protected nor integrity protected are writable by devices on the path(s) between the endpoints using the protocols. A protocol with a wire image that is largely writable operating over a path with devices that understand the semantics of the protocol's wire image can modify it in order to induce behaviors at the protocol's participants. TCP is one such protocol in the current Internet.",
      "ja": "どちらの機密性が保護や完全性が保護されているプロトコルスタックの線画像の部分は、プロトコルを使用して、エンドポイント間の経路（S）上のデバイスによって書き込み可能です。プロトコルの参加者に行動を誘導するためにそれを修正することができ、プロトコルのワイヤ画像の意味を理解するデバイスとのパス上で動作する、主に書き込み可能なワイヤ画像とプロトコル。 TCPは、現在のインターネットではそのようなプロトコルの1つです。"
    },
    {
      "indent": 3,
      "text": "The term \"wire image\" can be applied in different scopes: the wire image of a single packet refers to the information derivable from observing that one packet in isolation, and the wire image of a single protocol refers to the information derivable from observing only the headers belonging to that protocol on a sequence of packets in isolation from other protocols in use for a communication. See Section 3.1 for more.",
      "ja": "用語「線画像」は、異なるスコープに適用することができる：単一パケットの線画像は、1つの分離におけるパケット、及び単一プロトコルのワイヤ画像のみ観察から導き出せる情報を参照していることを観察から導き出せる情報を参照します通信のために使用されている他のプロトコルから分離してパケットのシーケンスにそのプロトコルに属するヘッダー。以上については、セクション3.1を参照してください。"
    },
    {
      "indent": 3,
      "text": "For a given packet observed at a given point in the network, the wire image contains information from the entire stack of protocols in use at that observation point. This implies that the wire image depends on the observer as well: each observer may see a slightly different image of the same communication.",
      "ja": "ネットワークの所定の時点で観察され、所与のパケットのために、ワイヤ画像は、観測点における使用中のプロトコルスタック全体の情報が含まれています。各観察者が同じ通信のわずかに異なる画像を表示することがあります。これは、ワイヤ画像が同様に観察者に依存することを意味します。"
    },
    {
      "indent": 3,
      "text": "In this document, we assume that only information at the transport layer and above is delivered end-to-end, and we focus on the \"Internet\" wire image: that portion of the wire image at the network layer and above. While confidentiality and integrity protection may be added at multiple layers in the stack, protection below the network layer does not prevent modification either by the devices terminating those security associations or by devices on different segments of the path.",
      "ja": "この文書では、我々は上記のみのトランスポート層での情報とは、エンドツーエンド送達されると仮定し、我々は、「インターネット」線画像に焦点を当てる：線画像の部分をネットワーク層以上で。機密性と完全性保護は、スタック内の複数の層に添加してもよいが、ネットワーク層の下の保護は、これらのセキュリティアソシエーションを終端装置によって、またはパスの異なるセグメント上のデバイスのいずれかによって変形を妨げません。"
    },
    {
      "indent": 0,
      "text": "3.1. The Extent of the Wire Image",
      "section_title": true,
      "ja": "3.1. ワイヤーイメージの程度"
    },
    {
      "indent": 3,
      "text": "While we begin this definition as the properties of a sequence of packets in isolation, this is not how wire images are typically used by passive observers. A passive observer will generally consider the union of all the information in the wire image in all the packets generated by a given conversation.",
      "ja": "我々は単独でのパケットのシーケンスのプロパティとしてこの定義を始めるが、これは一般的に受動的な観察者がどのように使用されるか、ワイヤの画像ではありません。受動的な観察者は、一般的に、所与の会話によって生成されたすべてのパケットにワイヤ画像内のすべての情報の和集合を検討します。"
    },
    {
      "indent": 3,
      "text": "Similarly, the wire image of a single protocol is rarely seen in isolation. The dynamics of the application and network stacks on each endpoint use multiple protocols for any higher-level task. Most protocols involving user content, for example, are often seen on the wire together with DNS traffic; the information from the wire image from each protocol in use for a given communication can be correlated to infer information about the dynamics of the overlying application.",
      "ja": "同様に、単一のプロトコルの線画像はほとんど単独で見られません。各エンドポイント上のアプリケーションとネットワークスタックのダイナミクスは、任意のより高いレベルのタスクのための複数のプロトコルを使用します。ユーザーコンテンツを含むほとんどのプロトコルは、例えば、多くの場合、DNSトラフィックと一緒にワイヤ上で見られています。所与の通信のために使用されている各プロトコルからワイヤ画像からの情報は、上層アプリケーションのダイナミクスについての情報を推測するために相関させることができます。"
    },
    {
      "indent": 3,
      "text": "Information from protocol wire images is also not generally used on its own but is rather additionally correlated with other context information available to the observer, e.g., information about other communications engaged in by each endpoint, information about the implementations of the protocols at each endpoint, information about the network and internetwork topology near those endpoints, and so on. This context can be used together with information from the wire image to reach more detailed inferences about endpoint and end-user behavior.",
      "ja": "プロトコル線画像からの情報はまた、一般的に単独で使用されず、むしろさらに観察者に利用可能な他のコンテキスト情報、例えばと相関している、他の通信に関する情報は、各エンドポイントによって各エンドポイントのプロトコルの実装に関する情報に従事しましたその上、これらのエンドポイントの近くに、ネットワークとインターネットワークトポロジに関する情報、および。このコンテキストは、エンドポイントおよびエンド・ユーザーの行動に関する詳細な推論に到達するために、ワイヤ画像からの情報と一緒に使用することができます。"
    },
    {
      "indent": 3,
      "text": "Note also that the wire image is multidimensional. This implies that the name \"image\" is not merely metaphorical and that general image recognition techniques may be applicable to extracting patterns and information from it.",
      "ja": "線画像は多次元であることにも留意されたいです。これは、名前「画像」は単に比喩的ではなく、一般的な画像認識技術は、そこからパターン情報を抽出にも適用可能であることをことを意味します。"
    },
    {
      "indent": 0,
      "text": "3.2. Obscuring Timing and Sizing Information",
      "section_title": true,
      "ja": "3.2. 不明瞭タイミングとサイズ情報"
    },
    {
      "indent": 3,
      "text": "Cryptography can protect the confidentiality of a protocol's headers to the extent that forwarding devices do not need the confidentiality-protected information for basic forwarding operations. Ciphersuites and other transmission techniques designed to prevent timing analysis can also be applied at the sender to reduce the information content of the metadata portion of the wire image. However, there are limits to these techniques. Packets cannot be made smaller than their information content, be sent faster than processing time requirements at the sender allow, or be transmitted through the network faster than the speed of light. Since these techniques operate at the expense of bandwidth efficiency and latency, they are also limited to the application's tolerance for latency and bandwidth inefficiency.",
      "ja": "暗号化は、転送デバイスは、基本的な転送操作のための機密保護された情報を必要としない程度のプロトコルのヘッダの機密性を保護することができます。暗号スイートとタイミング解析を防止するように設計された他の送信技術はまた、ワイヤ画像のメタデータ部分の情報量を低減するために、送信者に適用することができます。しかし、これらの技術には限界があります。パケットは、それらの情報量よりも小さくすることができない、送信者に許可するより高速な処理時間要件より送信される、またはより高速な光の速度よりもネットワークを介して送信されます。これらの技術は、帯域幅の効率とレイテンシを犠牲にして動作するので、それらはまた、遅延と帯域幅の非効率性のために、アプリケーションの許容範囲に制限されています。"
    },
    {
      "indent": 0,
      "text": "3.3. Integrity Protection of the Wire Image",
      "section_title": true,
      "ja": "3.3. ワイヤーイメージの完全性保護"
    },
    {
      "indent": 3,
      "text": "Adding end-to-end integrity protection to portions of the wire image makes it impossible for on-path devices to modify them without detection by the endpoints, which can then take action in response to those modifications, making these portions of the wire image effectively immutable. However, they can still be observed by devices on path. This allows the creation of signals intended by the endpoints solely for the consumption of these on-path devices.",
      "ja": "線画像の部分にエンドツーエンドの完全性保護を追加する効果線画像のこれらの部分を作り、それが不可能でパスのデバイスがそれらの変更に応答してアクションを取ることができ、エンドポイントによって検出することなくそれらを変更できるようになり不変。しかし、彼らはまだパス上のデバイスによって観察することができます。これは、単にこれらのパスのデバイスの消費のためのエンドポイントが意図した信号を作成することができます。"
    },
    {
      "indent": 3,
      "text": "Integrity protection can only practically be applied to the sequence of bits in each packet, which implies that a protocol's visible wire image cannot be made completely immutable in a packet-switched network. Interarrival timings, for instance, cannot be easily protected, as the observable delay sequence is modified as packets move through the network and experience different delays on different links. Message sequences are also not practically protectable, because packets may be dropped or reordered at any point in the network as a consequence of the network's operation. Intermediate systems with knowledge of the protocol semantics in the readable portion of the wire image can also purposely delay or drop packets in order to affect the protocol's operation.",
      "ja": "完全性保護は、実際に、プロトコルの可視線画像は、パケット交換ネットワークに完全に不変にすることができないことを意味し、各パケット内のビットのシーケンスに適用することができます。パケットがネットワークを介して移動し、異なるリンク上で異なる遅延を経験するように観察可能な遅延シーケンスが変更されるように到着間のタイミングは、例えば、容易に、保護することができません。パケットが廃棄されるか、またはネットワークの操作の結果として、ネットワーク内の任意の時点で並べ替えすることができるので、メッセージシーケンスは、また、実質的に保護できるものではありません。線画像の読み取り可能な部分におけるプロトコルのセマンティクスの知識を持つ中間システムはまた、意図的遅延またはプロトコルの動作に影響を与えるために、パケットをドロップすることができます。"
    },
    {
      "indent": 0,
      "text": "4. Engineering the Wire Image",
      "section_title": true,
      "ja": "4.エンジニアリングワイヤーイメージ"
    },
    {
      "indent": 3,
      "text": "Understanding the nature of a protocol's wire image allows it to be engineered. The general principle at work here, observed through experience with deployability and non-deployability of protocols at the network and transport layers in the Internet, is that all observable parts of a protocol's wire image will eventually be used by devices on path. Consequently, changes or future extensions that affect the observable part of the wire image become difficult or impossible to deploy.",
      "ja": "プロトコルのワイヤ画像の性質を理解することは、それが設計することを可能にします。職場での一般的な原理は、ここで、展開性やインターネットでのネットワーク層とトランスポート層のプロトコルの非展開性と経験を通して観察し、プロトコルの線画像の全ての観測可能な部分が最終的にパス上のデバイスで使用されるということです。その結果、ワイヤ画像の観察可能な部分に影響を与える変更や将来の拡張が困難または展開することは不可能になります。"
    },
    {
      "indent": 3,
      "text": "A network function that serves a purpose useful to its deployer will use the information it needs from the wire image and will tend to get that information from the wire image in the simplest way possible.",
      "ja": "そのデプロイヤに有用な目的を果たすネットワーク機能は、ワイヤ画像から必要な情報を使用し、可能な最も簡単な方法で線画像からその情報を取得する傾向があります。"
    },
    {
      "indent": 3,
      "text": "For example, consider the case of the ubiquitous TCP [RFC793] transport protocol. As described in [RFC8558], several key in-network functions have evolved to take advantage of implicit signals in TCP's wire image, which, as TCP provides neither integrity or confidentiality protection for its headers, is inseparable from its internal operation. Some of these include:",
      "ja": "例えば、ユビキタスTCP [RFC793]のトランスポートプロトコルの場合を考えます。 [RFC8558]に記載されているように、いくつかの重要で、ネットワーク機能は、TCPがそのヘッダのどちらも完全性や機密性保護を提供するように、その内部動作と不可分であり、TCPのワイヤ画像に暗黙的な信号を利用するように進化してきました。これらのいくつかは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Determining return routability and consent: For example, TCP's wire image contains both an implicit indication that the sender of a packet is at least on the path toward its source address (in the acknowledgement number during the handshake), as well as an implicit indication that a receiving device consents to continue communication. These are used by stateful network firewalls.",
      "ja": "リターン・ルータビリティと同意を決定O：たとえば、TCPの線画像は、パケットの送信元が、少なくとも（ハンドシェイク時の確認応答番号に）その送信元アドレスに向かって経路、ならびに潜在的な指示であることを暗黙の指示の両方を含みます受信装置同意は、通信を継続すること。これらは、ステートフルネットワークファイアウォールによって使用されています。"
    },
    {
      "indent": 3,
      "text": "o Measuring loss and latency: For example, examining the sequence of TCP's sequence and acknowledgement numbers, as well as the ECN [RFC3168] control bits, allows the inference of congestion, loss, and retransmission along the path. The sequence and acknowledgement numbers together with the timestamp option [RFC7323] allow the measurement of application-experienced latency.",
      "ja": "損失や遅延を測定○：たとえば、TCPのシーケンスおよび確認応答番号の配列、ならびにECN [RFC3168]の制御ビットを調べ、輻輳、損失、及び経路に沿った再送の推論を可能にします。タイムスタンプオプション[RFC7323]と一緒にシーケンスと確認応答番号は、アプリケーションの経験豊富な待ち時間の測定を可能にします。"
    },
    {
      "indent": 3,
      "text": "During the design of a protocol, the utility of features like these should be considered. The protocol's wire image can be designed to explicitly expose information to those network functions deemed important by the designers. The wire image should expose as little other information as possible.",
      "ja": "プロトコルの設計時には、これらのような機能の有用性を検討すべきです。プロトコルのワイヤ画像は、明示的にデザイナーが重要と認められるもののネットワーク機能に情報を公開するように設計することができます。線画像は、できるだけ他の情報を公開しなければなりません。"
    },
    {
      "indent": 3,
      "text": "However, even when information is explicitly provided to the network, any information that is exposed by the wire image, even information not intended to be consumed by an observer, must be designed carefully, as deployed network functions using that information may render it immutable for future versions of the protocol. For example, information needed to support decryption by the receiving endpoint (cryptographic handshakes, sequence numbers, and so on) may be used by devices along the path for their own purposes.",
      "ja": "しかし、情報が明示的にネットワーク、ワイヤ画像によって露光される任意の情報ではなく、観察者によって消費されることを意図するものであっても情報を提供する場合であっても、その情報を使用して展開ネットワーク機能はにとっては不変レンダリングできるように、注意深く設計されなければなりませんプロトコルの将来のバージョン。例えば、受信エンドポイントにより復号化をサポートするために必要な情報（ように暗号化ハンドシェーク、シーケンス番号など）は、独自の目的のために経路に沿ってデバイスによって使用されてもよいです。"
    },
    {
      "indent": 0,
      "text": "4.1. Declaring Protocol Invariants",
      "section_title": true,
      "ja": "4.1. プロトコル不変の宣言"
    },
    {
      "indent": 3,
      "text": "One potential approach to reduce the extent of the wire image that will be used by devices on the path is to define a set of invariants for a protocol during its development. Declaring a protocol's invariants represents a promise made by the protocol's developers that certain bits in the wire image, and behaviors observable in the wire image, will be preserved through the specification of all future versions of the protocol. QUIC's invariants [QUIC-INVARIANTS] are an initial attempt to apply this approach to QUIC.",
      "ja": "パス上のデバイスによって使用される線画像の程度を低減する一つの潜在的なアプローチは、開発中のプロトコルのための不変のセットを定義することです。プロトコルの不変の宣言線画像内の特定のビット、ワイヤ画像における観察可能な行動は、プロトコルのすべての将来のバージョンの仕様を介して保存されるプロトコルの開発者によって行われた約束を表します。 QUICの不変量[QUIC-INVARIANTS]はQUICにこのアプローチを適用する最初の試みです。"
    },
    {
      "indent": 3,
      "text": "While static aspects of the wire image (bits with simple semantics at fixed positions in protocol headers) can easily be made invariant, different aspects of the wire image may be more or less appropriate to define as invariants. For a protocol with a version and/or extension negotiation mechanism, the bits in the header and the behaviors tied to those bits, which implement version negotiation, should be made invariant. More fluid aspects of the wire image and behaviors that are not necessary for interoperability are not appropriate as invariants.",
      "ja": "線画像の静的な側面（プロトコルヘッダ内の固定位置に単純なセマンティクスを持つビット）が容易に不変にすることができるが、ワイヤ画像の異なる態様は不変として定義すること多かれ少なかれ適切であり得ます。バージョン及び/又は拡張ネゴシエーションメカニズムとプロトコルのために、ヘッダ内のビットとバージョンネゴシエーションを実現するこれらのビットに縛ら動作は、不変でなされるべきです。相互運用性のために必要ではない複数の流体線画像の態様および動作は不変として適切ではありません。"
    },
    {
      "indent": 3,
      "text": "Parts of a protocol's wire image not declared invariant but intended to be visible to devices on path should be protected against \"accidental invariance\": the deployment of on-path devices over time that make simplifying assumptions about the behavior of those parts of the wire image, making new behaviors not meeting those assumptions difficult to deploy. Integrity protection of the wire image may itself help protect against accidental invariance, because read-only wire images invite less meddling than path-writable wire images. The techniques discussed in [USE-IT] may also be useful in further preventing accidental invariance and ossification.",
      "ja": "プロトコルのワイヤ画像の部分は不変宣言されていますが、「偶然の不変性」に対して保護されなければならないパス上のデバイスに表示されるように意図していない：ワイヤー画像の部分の動作について、単純化の仮定を作る時間をかけてパス上のデバイスの展開、展開することは困難で、それらの前提条件を満たしていない新しい行動を行います。ワイヤ画像の完全性保護は、それ自体が読み取り専用線画像はパス書き込み可能な線画像よりも少ない弄りを招待するので、偶然の不変性から保護することがあります。 [USE-IT]で説明した技術はまた、偶発的不変性および骨化を予防するのに有用であり得ます。"
    },
    {
      "indent": 3,
      "text": "Likewise, parts of a protocol's wire image not declared invariant and not intended to be visible to the path should be encrypted to protect their confidentiality. When confidentiality protection is either not possible or not practical, then, as above, the approaches discussed in [USE-IT] may be useful in ossification prevention.",
      "ja": "同様に、プロトコルのワイヤ画像の部分がない不変宣言され、その機密性を保護するために暗号化されなければならないパスに見えることを意図するものではありません。機密保護が実用可能かのいずれかでない場合、次いで、上記のように、[USE-IT]で説明したアプローチは、骨化の予防に有用であり得ます。"
    },
    {
      "indent": 0,
      "text": "4.2. Trustworthiness of Engineered Signals",
      "section_title": true,
      "ja": "4.2. エンジニア信号の信頼性"
    },
    {
      "indent": 3,
      "text": "Since signals in the wire image that are engineered to be exposed are separate from the signals that drive an encrypted protocol's mechanisms, the accuracy of these signals intended for consumption by the path may not be verifiable by on-path devices; see [RFC8558].",
      "ja": "露出されるように操作されたワイヤ画像における信号は、暗号化プロトコルの機構を駆動する信号から分離されているので、パスによる消費を意図し、これらの信号の精度は、オンパスデバイスによって検証可能ではないかもしれません。 [RFC8558]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Indeed, any two endpoints with a secret channel between them (in this case, the encrypted protocol itself) may collude to change the semantics and information content of these signals. This is an unavoidable consequence of the separation of the wire image from the protocol's operation afforded by confidentiality protection of the protocol's headers.",
      "ja": "実際、それらの間に秘密チャンネルを有する任意の2つのエンドポイント（この場合には、暗号化プロトコル自体）は、これらの信号の意味と情報コンテンツを変更するために共謀してもよいです。これは、プロトコルのヘッダの機密保護によって与えられるプロトコルの動作からワイヤ画像の分離の不可避の結果です。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document has no IANA actions.",
      "ja": "このドキュメントには、IANAのアクションを持っていません。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document explores the information exposed by the wire image that may be relevant to end-to-end communication privacy and security. When designing the wire image of a network protocol, care must be taken to expose only that information to the network deemed necessary in the protocol's design, and careful design is necessary to reduce the risk that information not explicitly included in the wire image is derivable from its observation.",
      "ja": "この文書は、エンドツーエンド通信のプライバシーおよびセキュリティに関連し得る線画像によって露出情報を探ります。ネットワークプロトコルのワイヤ画像を設計する際に、注意がネットワークにのみ、その情報を公開するために取られなければならないプロトコルの設計に必要と認められる、と慎重な設計は、明示的にワイヤ画像に含まれていない情報はから誘導される危険性を低減することが必要ですその観察。"
    },
    {
      "indent": 0,
      "text": "7. Informative References",
      "section_title": true,
      "ja": "7.参考文献"
    },
    {
      "indent": 3,
      "text": "[QUIC] Iyengar, J. and M. Thomson, \"QUIC: A UDP-Based Multiplexed and Secure Transport\", Work in Progress, draft-ietf-quic-transport-19, March 2019.",
      "ja": "[QUIC]アイアンガー、J.とM.トムソン、 \"QUIC：UDPベースの多重化とセキュアな交通\"、進捗状況、ドラフト-IETF-QUIC輸送-19、2019年3月での作業。"
    },
    {
      "indent": 3,
      "text": "[QUIC-INVARIANTS] Thomson, M., \"Version-Independent Properties of QUIC\", Work in Progress, draft-ietf-quic-invariants-04, April 2019.",
      "ja": "[QUIC-INVARIANTS]トムソン、M.、 \"QUICのバージョンに依存しないプロパティ\" が進行中で働いて、ドラフト-IETF-QUIC-不変量-04、2019年4月。"
    },
    {
      "indent": 3,
      "text": "[RFC793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, DOI 10.17487/RFC0793, September 1981, <https://www.rfc-editor.org/info/rfc793>.",
      "ja": "[RFC793]ポステル、J.、 \"伝送制御プロトコル\"、STD 7、RFC 793、DOI 10.17487 / RFC0793、1981年9月、<https://www.rfc-editor.org/info/rfc793>。"
    },
    {
      "indent": 3,
      "text": "[RFC3168] Ramakrishnan, K., Floyd, S., and D. Black, \"The Addition of Explicit Congestion Notification (ECN) to IP\", RFC 3168, DOI 10.17487/RFC3168, September 2001, <https://www.rfc-editor.org/info/rfc3168>.",
      "ja": "\"IPへの明示的輻輳通知の追加（ECN）\" [RFC3168]ラマクリシュナン、K.、フロイド、S.、およびD.ブラック、RFC 3168、DOI 10.17487 / RFC3168、2001年9月、<https：//でWWW。 rfc-editor.org/info/rfc3168>。"
    },
    {
      "indent": 3,
      "text": "[RFC7323] Borman, D., Braden, B., Jacobson, V., and R. Scheffenegger, Ed., \"TCP Extensions for High Performance\", RFC 7323, DOI 10.17487/RFC7323, September 2014, <https://www.rfc-editor.org/info/rfc7323>.",
      "ja": "[RFC7323]ボーマン、D.、ブレーデン、B.、ヤコブソン、V.、およびR. Scheffenegger、エド、 \"ハイパフォーマンスのためのTCP拡張\"、RFC 7323、DOI 10.17487 / RFC7323、2014年9月、<HTTPS：// www.rfc-editor.org/info/rfc7323>。"
    },
    {
      "indent": 3,
      "text": "[RFC8446] Rescorla, E., \"The Transport Layer Security (TLS) Protocol Version 1.3\", RFC 8446, DOI 10.17487/RFC8446, August 2018, <https://www.rfc-editor.org/info/rfc8446>.",
      "ja": "[RFC8446]レスコラ、E.、 \"トランスポート層セキュリティ（TLS）プロトコルバージョン1.3\"、RFC 8446、DOI 10.17487 / RFC8446、2018年8月、<https://www.rfc-editor.org/info/rfc8446>。"
    },
    {
      "indent": 3,
      "text": "[RFC8558] Hardie, T., Ed., \"Transport Protocol Path Signals\", RFC 8558, DOI 10.17487/RFC8558, April 2019, <https://www.rfc-editor.org/info/rfc8558>.",
      "ja": "[RFC8558]ハーディ、T.、エド。、 \"トランスポートプロトコルのパス信号\"、RFC 8558、DOI 10.17487 / RFC8558、2019年4月、<https://www.rfc-editor.org/info/rfc8558>。"
    },
    {
      "indent": 3,
      "text": "[USE-IT] Thomson, M., \"Long-term Viability of Protocol Extension Mechanisms\", Work in Progress, draft-thomson-use-it-or-lose-it-03, January 2019.",
      "ja": "[USE-IT]トムソン、M.、 \"プロトコル拡張メカニズムの長期生存率\" が進行中で働いて、ドラフト・トムソン使用-それ-または-失う - それ-03、2019年1月を。"
    },
    {
      "indent": 0,
      "text": "IAB Members at the Time of Approval",
      "ja": "承認時のIABメンバー"
    },
    {
      "indent": 6,
      "text": "Jari Arkko\nAlissa Cooper\nTed Hardie\nChristian Huitema\nGabriel Montenegro\nErik Nordmark\nMark Nottingham\nMelinda Shore\nRobert Sparks\nJeff Tantsura\nMartin Thomson\nBrian Trammell\nSuzanne Woolf",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Martin Thomson, Stephen Farrell, Thomas Fossati, Ted Hardie, Mark Nottingham, Tommy Pauly, and the membership of the IAB Stack Evolution Program for text, feedback, and discussions that have improved this document.",
      "ja": "マーティン・トムソン、スティーブン・ファレル、トーマス・フォッサーティ、テッドハーディー、マーク・ノッティンガム、トミーポーリー、およびこの文書を改善しているテキスト、フィードバック、議論のためのIABスタック進化プログラムの会員に感謝します。"
    },
    {
      "indent": 3,
      "text": "This work is partially supported by the European Commission under Horizon 2020 grant agreement No. 688421, Measurement and Architecture for a Middleboxed Internet (MAMI), and by the Swiss State Secretariat for Education, Research, and Innovation under contract No. 15.0268. This support does not imply endorsement.",
      "ja": "この作業は、部分的に契約番号15.0268下ホライゾン2020助成金契約番号688421の下で、Middleboxedインターネットの測定とアーキテクチャ（MAMI）、およびスイスの州教育事務局、研究、イノベーションにより、欧州委員会によってサポートされています。このサポートは、保証を意味するものではありません。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Brian Trammell ETH Zurich Gloriastrasse 35 8092 Zurich Switzerland",
      "ja": "ブライアン・トラメルETHチューリッヒGloriastrasse 35 8092チューリッヒスイス"
    },
    {
      "indent": 3,
      "text": "Email: ietf@trammell.ch",
      "ja": "メール：ietf@trammell.ch"
    },
    {
      "indent": 3,
      "text": "Mirja Kuehlewind ETH Zurich Gloriastrasse 35 8092 Zurich Switzerland",
      "ja": "Mirja Kuehlewind ETHチューリッヒGloriastrasse 35 8092チューリッヒスイス"
    },
    {
      "indent": 3,
      "text": "Email: ietf@kuehlewind.net",
      "ja": "メール：ietf@kuehlewind.net"
    }
  ]
}