{
  "title": {
    "text": "RFC 8624 - Algorithm Implementation Requirements and Usage Guidance for DNSSEC",
    "ja": "RFC 8624 - DNSSECのアルゴリズム実装要件と使用ガイダンス"
  },
  "number": 8624,
  "created_at": "2019-11-06 11:40:51.909893+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        P. Wouters\nRequest for Comments: 8624                                       Red Hat\nObsoletes: 6944                                                  O. Sury\nCategory: Standards Track                    Internet Systems Consortium\nISSN: 2070-1721                                                June 2019",
      "raw": true
    },
    {
      "indent": 2,
      "text": "Algorithm Implementation Requirements and Usage Guidance for DNSSEC",
      "ja": "DNSSECのアルゴリズム実装要件と使用ガイダンス"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The DNSSEC protocol makes use of various cryptographic algorithms in order to provide authentication of DNS data and proof of nonexistence. To ensure interoperability between DNS resolvers and DNS authoritative servers, it is necessary to specify a set of algorithm implementation requirements and usage guidelines to ensure that there is at least one algorithm that all implementations support. This document defines the current algorithm implementation requirements and usage guidance for DNSSEC. This document obsoletes RFC 6944.",
      "ja": "DNSSECプロトコルは、DNSデータの認証と存在の証拠を提供するために、さまざまな暗号化アルゴリズムを使用します。 DNSリゾルバーとDNS権限のあるサーバー間の相互運用性を確保するには、すべての実装がサポートするアルゴリズムが少なくとも1つあることを確認するために、アルゴリズム実装要件と使用ガイドラインのセットを指定する必要があります。 このドキュメントでは、現在のアルゴリズム実装要件とDNSSECの使用ガイダンスを定義しています。 このドキュメントはRFC 6944を廃止します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット標準化過程の文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、Internet Engineering Task Force（IETF）の製品です。 IETFコミュニティのコンセンサスを表しています。 これは公開レビューを受けており、Internet Engineering Steering Group（IESG）による公開が承認されています。 インターネット標準の詳細については、RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8624.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックに関する情報は、https：//www.rfc-editor.org/info/rfc8624で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2019 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2019 IETF Trustおよび文書作成者として特定された人物。 全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78と、この文書の公開日に有効なIETF文書に関するIETFトラストの法的条項（https://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているので、注意深く確認してください。 このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseテキストを含める必要があり、Simplified BSD Licenseに記載されている保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  Updating Algorithm Implementation Requirements and Usage\n        Guidance  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.2.  Updating Algorithm Requirement Levels . . . . . . . . . .   3\n  1.3.  Document Audience . . . . . . . . . . . . . . . . . . . .   4\n2.  Conventions Used in This Document . . . . . . . . . . . . . .   4\n3.  Algorithm Selection . . . . . . . . . . . . . . . . . . . . .   5\n  3.1.  DNSKEY Algorithms . . . . . . . . . . . . . . . . . . . .   5\n  3.2.  DNSKEY Algorithm Recommendation . . . . . . . . . . . . .   6\n  3.3.  DS and CDS Algorithms . . . . . . . . . . . . . . . . . .   7\n  3.4.  DS and CDS Algorithm Recommendation . . . . . . . . . . .   7\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .   8\n5.  Operational Considerations  . . . . . . . . . . . . . . . . .   8\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   8\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   9\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .   9\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .  10\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  11\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  11",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The DNSSEC signing algorithms are defined by various RFCs, including [RFC4034], [RFC5155], [RFC5702], [RFC5933], [RFC6605], and [RFC8080]. DNSSEC is used to provide authentication of data. To ensure interoperability, a set of \"mandatory-to-implement\" DNSKEY algorithms are defined. This document obsoletes [RFC6944].",
      "ja": "DNSSEC署名アルゴリズムは、[RFC4034]、[RFC5155]、[RFC5702]、[RFC5933]、[RFC6605]、および[RFC8080]などのさまざまなRFCで定義されています。 DNSSECは、データの認証を提供するために使用されます。 相互運用性を確保するために、「実装に必須」のDNSKEYアルゴリズムのセットが定義されています。 このドキュメントは廃止されます[RFC6944]。"
    },
    {
      "indent": 0,
      "text": "1.1. Updating Algorithm Implementation Requirements and Usage Guidance",
      "section_title": true,
      "ja": "1.1. アルゴリズム実装要件と使用ガイダンスの更新"
    },
    {
      "indent": 3,
      "text": "The field of cryptography evolves continuously. New, stronger algorithms appear, and existing algorithms are found to be less secure than originally thought. Attacks previously thought to be computationally infeasible become more accessible as the available computational resources increase. Therefore, algorithm implementation requirements and usage guidance need to be updated from time to time to reflect the new reality. The choices for algorithms must be conservative to minimize the risk of algorithm compromise.",
      "ja": "暗号化の分野は絶えず進化しています。 新しい強力なアルゴリズムが登場し、既存のアルゴリズムは当初考えられていたよりも安全性が低いことがわかりました。 これまで計算上実行不可能であると考えられていた攻撃は、利用可能な計算リソースが増加するにつれて、よりアクセスしやすくなります。 そのため、新しい現実を反映するために、アルゴリズムの実装要件と使用ガイダンスを随時更新する必要があります。 アルゴリズムの妥協のリスクを最小限に抑えるため、アルゴリズムの選択は控えめでなければなりません。"
    },
    {
      "indent": 0,
      "text": "1.2. Updating Algorithm Requirement Levels",
      "section_title": true,
      "ja": "1.2. アルゴリズム要件レベルの更新"
    },
    {
      "indent": 3,
      "text": "The mandatory-to-implement algorithm of tomorrow should already be available in most implementations of DNSSEC by the time it is made mandatory. This document attempts to identify and introduce those algorithms for future mandatory-to-implement status. There is no guarantee that algorithms in use today will become mandatory in the future. Published algorithms are continuously subjected to cryptographic attack and may become too weak or even be completely broken before this document is updated.",
      "ja": "DNSSECのほとんどの実装では、明日の必須実装アルゴリズムが必須になるまでにすでに利用可能になっているはずです。 このドキュメントは、将来の実装必須ステータスのためにそれらのアルゴリズムを識別して導入しようとします。 現在使用されているアルゴリズムが将来必須になるという保証はありません。 公開されたアルゴリズムは継続的に暗号化攻撃を受け、このドキュメントが更新される前に弱すぎたり、完全に壊れたりする可能性があります。"
    },
    {
      "indent": 3,
      "text": "This document only provides recommendations with respect to mandatory-to-implement algorithms or algorithms so weak that they cannot be recommended. Any algorithm listed in the [DNSKEY-IANA] and [DS-IANA] registries that are not mentioned in this document MAY be implemented. For clarification and consistency, an algorithm will be specified as MAY in this document only when it has been downgraded from a MUST or a RECOMMENDED to a MAY.",
      "ja": "このドキュメントは、実装に必須のアルゴリズムまたは推奨できないほど弱いアルゴリズムに関する推奨事項のみを提供します。 [DNSKEY-IANA]および[DS-IANA]レジストリにリストされているアルゴリズムのうち、このドキュメントに記載されていないものはすべて実装できます。 明確化と一貫性のために、このドキュメントでは、MUSTまたはRECOMMENDEDからMAYにダウングレードされた場合にのみ、アルゴリズムがMAYとして指定されます。"
    },
    {
      "indent": 3,
      "text": "Although this document's primary purpose is to update algorithm recommendations to keep DNSSEC authentication secure over time, it also aims to do so in such a way that DNSSEC implementations remain interoperable. DNSSEC interoperability is addressed by an incremental introduction or deprecation of algorithms.",
      "ja": "このドキュメントの主な目的は、アルゴリズムの推奨事項を更新してDNSSEC認証を長期にわたって安全に保つことですが、DNSSEC実装が相互運用可能なままであるようにすることも目的としています。 DNSSECの相互運用性は、アルゴリズムの段階的な導入または廃止によって対処されます。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] considers the term SHOULD equivalent to RECOMMENDED, and SHOULD NOT equivalent to NOT RECOMMENDED. The authors of this document have chosen to use the terms RECOMMENDED and NOT RECOMMENDED, as this more clearly expresses the intent to implementers.",
      "ja": "[RFC2119]は、用語をRECOMMENDEDに相当すべきであると見なすべきであり、NOT RECOMMENDEDに相当すべきではありません。 このドキュメントの著者は、推奨事項と推奨事項という用語を使用することを選択しました。これは、実装者の意図をより明確に表現しているためです。"
    },
    {
      "indent": 3,
      "text": "It is expected that deprecation of an algorithm will be performed gradually in a series of updates to this document. This provides time for various implementations to update their implemented algorithms while remaining interoperable. Unless there are strong security reasons, an algorithm is expected to be downgraded from MUST to NOT RECOMMENDED or MAY, instead of to MUST NOT. Similarly, an algorithm that has not been mentioned as mandatory-to-implement is expected to be introduced with a RECOMMENDED instead of a MUST.",
      "ja": "このドキュメントの一連の更新で、アルゴリズムの非推奨が徐々に実行されることが予想されます。 これにより、さまざまな実装が相互運用性を維持しながら、実装されたアルゴリズムを更新する時間が提供されます。 強力なセキュリティ上の理由がない限り、アルゴリズムは、MUST NOTではなく、MUSTからNOT RECOMMENDEDまたはMAYにダウングレードされることが予想されます。 同様に、実装必須として言及されていないアルゴリズムは、MUSTではなくRECOMMENDEDで導入されることが期待されています。"
    },
    {
      "indent": 3,
      "text": "Since the effect of using an unknown DNSKEY algorithm is that the zone is treated as insecure, it is recommended that algorithms downgraded to NOT RECOMMENDED or lower not be used by authoritative nameservers and DNSSEC signers to create new DNSKEYs. This will allow for deprecated algorithms to become less and less common over time. Once an algorithm has reached a sufficiently low level of deployment, it can be marked as MUST NOT so that recursive resolvers can remove support for validating it.",
      "ja": "未知のDNSKEYアルゴリズムを使用すると、ゾーンが安全でないものとして扱われるため、権限のあるネームサーバーとDNSSEC署名者が新しいDNSKEYを作成するために、NOT RECOMMENDED以下にダウングレードしたアルゴリズムを使用しないことをお勧めします。 これにより、非推奨のアルゴリズムが時間とともにますます一般的にならないようになります。 アルゴリズムが十分に低い展開レベルに達すると、再帰リゾルバーが検証のサポートを削除できるように、MUST NOTとしてマークできます。"
    },
    {
      "indent": 3,
      "text": "Recursive nameservers are encouraged to retain support for all algorithms not marked as MUST NOT.",
      "ja": "再帰ネームサーバは、してはならないとしてマークされていないすべてのアルゴリズムのサポートを保持することをお勧めします。"
    },
    {
      "indent": 0,
      "text": "1.3. Document Audience",
      "section_title": true,
      "ja": "1.3. 対象読者"
    },
    {
      "indent": 3,
      "text": "The recommendations of this document mostly target DNSSEC implementers, as implementations need to meet both high security expectations as well as high interoperability between various vendors and with different versions. Interoperability requires a smooth transition to more secure algorithms. This perspective may differ from that of a user who wishes to deploy and configure DNSSEC with only the safest algorithm. On the other hand, the comments and recommendations in this document are also expected to be useful for such users.",
      "ja": "このドキュメントの推奨事項は、主にDNSSECの実装者を対象としています。実装は、高いセキュリティ期待と、さまざまなベンダー間および異なるバージョンとの高い相互運用性の両方を満たす必要があるためです。 相互運用性には、より安全なアルゴリズムへのスムーズな移行が必要です。 この観点は、最も安全なアルゴリズムのみでDNSSECを展開および構成したいユーザーの観点とは異なる場合があります。 一方、このドキュメントのコメントと推奨事項は、このようなユーザーにとっても役立つと期待されています。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "2. このドキュメントで使用される規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Algorithm Selection",
      "section_title": true,
      "ja": "3. アルゴリズムの選択"
    },
    {
      "indent": 0,
      "text": "3.1. DNSKEY Algorithms",
      "section_title": true,
      "ja": "3.1. DNSKEYアルゴリズム"
    },
    {
      "indent": 3,
      "text": "The following table lists the implementation recommendations for DNSKEY algorithms [DNSKEY-IANA].",
      "ja": "次の表に、DNSKEYアルゴリズム[DNSKEY-IANA]の実装に関する推奨事項を示します。"
    },
    {
      "indent": 3,
      "text": "+--------+--------------------+-----------------+-------------------+\n| Number | Mnemonics          | DNSSEC Signing  | DNSSEC Validation |\n+--------+--------------------+-----------------+-------------------+\n| 1      | RSAMD5             | MUST NOT        | MUST NOT          |\n| 3      | DSA                | MUST NOT        | MUST NOT          |\n| 5      | RSASHA1            | NOT RECOMMENDED | MUST              |\n| 6      | DSA-NSEC3-SHA1     | MUST NOT        | MUST NOT          |\n| 7      | RSASHA1-NSEC3-SHA1 | NOT RECOMMENDED | MUST              |\n| 8      | RSASHA256          | MUST            | MUST              |\n| 10     | RSASHA512          | NOT RECOMMENDED | MUST              |\n| 12     | ECC-GOST           | MUST NOT        | MAY               |\n| 13     | ECDSAP256SHA256    | MUST            | MUST              |\n| 14     | ECDSAP384SHA384    | MAY             | RECOMMENDED       |\n| 15     | ED25519            | RECOMMENDED     | RECOMMENDED       |\n| 16     | ED448              | MAY             | RECOMMENDED       |\n+--------+--------------------+-----------------+-------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "RSAMD5 is not widely deployed, and there is an industry-wide trend to deprecate MD5 usage.",
      "ja": "RSAMD5は広く展開されておらず、MD5の使用を廃止する業界全体の傾向があります。"
    },
    {
      "indent": 3,
      "text": "RSASHA1 and RSASHA1-NSEC3-SHA1 are widely deployed, although the zones deploying it are recommended to switch to ECDSAP256SHA256 as there is an industry-wide trend to move to elliptic curve cryptography. RSASHA1 does not support NSEC3. RSASHA1-NSEC3-SHA1 can be used with or without NSEC3.",
      "ja": "RSASHA1およびRSASHA1-NSEC3-SHA1は広く展開されていますが、楕円曲線暗号に移行する業界全体の傾向があるため、それを展開するゾーンはECDSAP256SHA256に切り替えることをお勧めします。 RSASHA1はNSEC3をサポートしません。 RSASHA1-NSEC3-SHA1は、NSEC3の有無にかかわらず使用できます。"
    },
    {
      "indent": 3,
      "text": "DSA and DSA-NSEC3-SHA1 are not widely deployed and are vulnerable to private key compromise when generating signatures using a weak or compromised random number generator.",
      "ja": "DSAおよびDSA-NSEC3-SHA1は広く展開されておらず、脆弱または脆弱な乱数ジェネレーターを使用して署名を生成する場合、秘密鍵の侵害に対して脆弱です。"
    },
    {
      "indent": 3,
      "text": "RSASHA256 is widely used and considered strong. It has been the default algorithm for a number of years and is now slowly being replaced with ECDSAP256SHA256 due to its shorter key and signature size, resulting in smaller DNS packets.",
      "ja": "RSASHA256は広く使用されており、強力であると考えられています。 これは何年もの間デフォルトのアルゴリズムでしたが、現在ではキーと署名のサイズが短いため、徐々にECDSAP256SHA256に置き換えられ、DNSパケットが小さくなっています。"
    },
    {
      "indent": 3,
      "text": "RSASHA512 is NOT RECOMMENDED for DNSSEC signing because it has not seen wide deployment, but there are some deployments; hence, DNSSEC validation MUST implement RSASHA512 to ensure interoperability. There is no significant difference in cryptographic strength between RSASHA512 and RSASHA256; therefore, use of RSASHA512 is discouraged as it will only make deprecation of older algorithms harder. People who wish to use a cryptographically stronger algorithm should switch to elliptic curve cryptography algorithms.",
      "ja": "RSASHA512はDNSSEC署名には推奨されません。これは、広範な展開が見られないためですが、いくつかの展開があります。 したがって、DNSSEC検証では、相互運用性を確保するためにRSASHA512を実装する必要があります。 RSASHA512とRSASHA256の間で暗号強度に大きな違いはありません。 したがって、RSASHA512の使用は推奨されません。古いアルゴリズムの廃止が難しくなるからです。 暗号的に強力なアルゴリズムを使用したい人は、楕円曲線暗号アルゴリズムに切り替える必要があります。"
    },
    {
      "indent": 3,
      "text": "ECC-GOST (GOST R 34.10-2001) has been superseded by GOST R 34.10-2012 in [RFC7091]. GOST R 34.10-2012 hasn't been standardized for use in DNSSEC.",
      "ja": "ECC-GOST（GOST R 34.10-2001）は、[RFC7091]のGOST R 34.10-2012に置き換えられました。 GOST R 34.10-2012は、DNSSECで使用するために標準化されていません。"
    },
    {
      "indent": 3,
      "text": "ECDSAP256SHA256 provides more cryptographic strength with a shorter signature length than either RSASHA256 or RSASHA512. ECDSAP256SHA256 has been widely deployed; therefore, it is now at MUST level for both validation and signing. It is RECOMMENDED to use the deterministic digital signature generation procedure of the Elliptic Curve Digital Signature Algorithm (ECDSA), specified in [RFC6979], when implementing ECDSAP256SHA256 (and ECDSAP384SHA384).",
      "ja": "ECDSAP256SHA256は、RSASHA256またはRSASHA512のいずれよりも短い署名長で、より高い暗号強度を提供します。 ECDSAP256SHA256は広く展開されています。 したがって、検証と署名の両方について、MUSTレベルになりました。 ECDSAP256SHA256（およびECDSAP384SHA384）を実装する場合、[RFC6979]で指定された楕円曲線デジタル署名アルゴリズム（ECDSA）の決定論的なデジタル署名生成手順を使用することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "ECDSAP384SHA384 shares the same properties as ECDSAP256SHA256 but offers a modest security advantage over ECDSAP256SHA256 (192 bits of strength versus 128 bits). For most DNSSEC applications, ECDSAP256SHA256 should be satisfactory and robust for the foreseeable future and is therefore recommended for signing. While it is unlikely for a DNSSEC use case requiring 192-bit security strength to arise, ECDSA384SHA384 is provided for such applications, and it MAY be used for signing in these cases.",
      "ja": "ECDSAP384SHA384は、ECDSAP256SHA256と同じプロパティを共有しますが、ECDSAP256SHA256（128ビットの強度に対して192ビットの強度）よりも控えめなセキュリティ上の利点を提供します。 ほとんどのDNSSECアプリケーションでは、ECDSAP256SHA256は予見可能な将来に十分満足できる堅牢なものであるため、署名に推奨されます。 192ビットのセキュリティ強度を必要とするDNSSECユースケースが発生することはほとんどありませんが、ECDSA384SHA384はそのようなアプリケーション用に提供されており、これらのケースでの署名に使用できます。"
    },
    {
      "indent": 3,
      "text": "ED25519 and ED448 use the Edwards-curve Digital Security Algorithm (EdDSA). There are three main advantages of EdDSA: it does not require the use of a unique random number for each signature, there are no padding or truncation issues as with ECDSA, and it is more resilient to side-channel attacks. Furthermore, EdDSA cryptography is less prone to implementation errors ([RFC8032], [RFC8080]). It is expected that ED25519 will become the future RECOMMENDED default algorithm once there's enough support for this algorithm in the deployed DNSSEC validators.",
      "ja": "ED25519およびED448は、エドワーズ曲線デジタルセキュリティアルゴリズム（EdDSA）を使用します。 EdDSAには3つの主な利点があります。各署名に一意の乱数を使用する必要がなく、ECDSAのようにパディングや切り捨ての問題がなく、サイドチャネル攻撃に対してより回復力があります。 さらに、EdDSA暗号化は実装エラーを起こしにくい（[RFC8032]、[RFC8080]）。 展開されたDNSSECバリデータでこのアルゴリズムの十分なサポートがあれば、ED25519が将来の推奨されるデフォルトアルゴリズムになると予想されます。"
    },
    {
      "indent": 0,
      "text": "3.2. DNSKEY Algorithm Recommendation",
      "section_title": true,
      "ja": "3.2. DNSKEYアルゴリズムの推奨事項"
    },
    {
      "indent": 3,
      "text": "Due to the industry-wide trend towards elliptic curve cryptography, ECDSAP256SHA256 is the RECOMMENDED DNSKEY algorithm for use by new DNSSEC deployments, and users of RSA-based algorithms SHOULD upgrade to ECDSAP256SHA256.",
      "ja": "楕円曲線暗号化への業界全体の傾向により、ECDSAP256SHA256は新しいDNSSEC展開で使用するための推奨DNSKEYアルゴリズムであり、RSAベースのアルゴリズムのユーザーはECDSAP256SHA256にアップグレードする必要があります。"
    },
    {
      "indent": 0,
      "text": "3.3. DS and CDS Algorithms",
      "section_title": true,
      "ja": "3.3. DSおよびCDSアルゴリズム"
    },
    {
      "indent": 3,
      "text": "The following table lists the recommendations for Delegation Signer Digest Algorithms [DS-IANA]. These recommendations also apply to the Child Delegation Signer (CDS) RRTYPE as specified in [RFC7344].",
      "ja": "次の表に、委任署名者ダイジェストアルゴリズム[DS-IANA]の推奨事項を示します。 これらの推奨事項は、[RFC7344]で指定されているChild Delegation Signer（CDS）RRTYPEにも適用されます。"
    },
    {
      "indent": 3,
      "text": "+--------+-----------------+-------------------+-------------------+\n| Number | Mnemonics       | DNSSEC Delegation | DNSSEC Validation |\n+--------+-----------------+-------------------+-------------------+\n| 0      | NULL (CDS only) | MUST NOT [*]      | MUST NOT [*]      |\n| 1      | SHA-1           | MUST NOT          | MUST              |\n| 2      | SHA-256         | MUST              | MUST              |\n| 3      | GOST R 34.11-94 | MUST NOT          | MAY               |\n| 4      | SHA-384         | MAY               | RECOMMENDED       |\n+--------+-----------------+-------------------+-------------------+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "[*] - This is a special type of CDS record signaling removal of DS at the parent in [RFC8078].",
      "ja": "[*]-これは、[RFC8078]の親でのDSの削除を通知するCDSレコードの特別なタイプです。"
    },
    {
      "indent": 3,
      "text": "NULL is a special case; see [RFC8078].",
      "ja": "NULLは特殊なケースです。 [RFC8078]を参照してください。"
    },
    {
      "indent": 3,
      "text": "SHA-1 is still widely used for Delegation Signer (DS) records, so validators MUST implement validation, but it MUST NOT be used to generate new DS and CDS records (see \"Operational Considerations\" for caveats when upgrading from the SHA-1 to SHA-256 DS algorithm.)",
      "ja": "SHA-1は依然として委任署名者（DS）レコードに広く使用されているため、バリデータは検証を実装する必要がありますが、新しいDSおよびCDSレコードの生成には使用しないでください（SHA-1からアップグレードする際の注意事項については、「運用上の考慮事項」 SHA-256 DSアルゴリズム。）"
    },
    {
      "indent": 3,
      "text": "SHA-256 is widely used and considered strong.",
      "ja": "SHA-256は広く使用されており、強力であると考えられています。"
    },
    {
      "indent": 3,
      "text": "GOST R 34.11-94 has been superseded by GOST R 34.11-2012 in [RFC6986]. GOST R 34.11-2012 has not been standardized for use in DNSSEC.",
      "ja": "GOST R 34.11-94は、[RFC6986]でGOST R 34.11-2012に置き換えられました。 GOST R 34.11-2012は、DNSSECで使用するために標準化されていません。"
    },
    {
      "indent": 3,
      "text": "SHA-384 shares the same properties as SHA-256 but offers a modest security advantage over SHA-256 (384 bits of strength versus 256 bits). For most applications of DNSSEC, SHA-256 should be satisfactory and robust for the foreseeable future and is therefore recommended for DS and CDS records. While it is unlikely for a DNSSEC use case requiring 384-bit security strength to arise, SHA-384 is provided for such applications, and it MAY be used for generating DS and CDS records in these cases.",
      "ja": "SHA-384は、SHA-256と同じプロパティを共有しますが、SHA-256よりも控えめなセキュリティ上の利点を提供します（256ビットに対して384ビットの強度）。 DNSSECのほとんどのアプリケーションでは、SHA-256は予見可能な将来に十分で堅牢である必要があるため、DSおよびCDSレコードに推奨されます。 384ビットのセキュリティ強度を必要とするDNSSECユースケースが発生する可能性は低いですが、SHA-384はそのようなアプリケーション用に提供され、これらのケースでDSおよびCDSレコードを生成するために使用できます。"
    },
    {
      "indent": 0,
      "text": "3.4. DS and CDS Algorithm Recommendation",
      "section_title": true,
      "ja": "3.4. DSおよびCDSアルゴリズムの推奨事項"
    },
    {
      "indent": 3,
      "text": "An operational recommendation for new and existing deployments: SHA-256 is the RECOMMENDED DS and CDS algorithm.",
      "ja": "新規および既存の展開に対する運用上の推奨事項：SHA-256は、推奨されるDSおよびCDSアルゴリズムです。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The security of cryptographic systems depends on both the strength of the cryptographic algorithms chosen and the strength of the keys used with those algorithms. The security also depends on the engineering of the protocol used by the system to ensure that there are no non-cryptographic ways to bypass the security of the overall system.",
      "ja": "暗号化システムのセキュリティは、選択した暗号化アルゴリズムの強度とそれらのアルゴリズムで使用されるキーの強度の両方に依存します。 セキュリティは、システム全体のセキュリティをバイパスする非暗号化の方法がないことを保証するために、システムが使用するプロトコルのエンジニアリングにも依存します。"
    },
    {
      "indent": 3,
      "text": "This document concerns itself with the selection of cryptographic algorithms for use in DNSSEC, specifically with the selection of \"mandatory-to-implement\" algorithms. The algorithms identified in this document as MUST or RECOMMENDED to implement are not known to be broken (in the cryptographic sense) at the current time, and cryptographic research so far leads us to believe that they are likely to remain secure into the foreseeable future. However, this isn't necessarily forever, and it is expected that new revisions of this document will be issued from time to time to reflect the current best practices in this area.",
      "ja": "このドキュメントは、DNSSECで使用する暗号化アルゴリズムの選択、特に「実装必須」アルゴリズムの選択に関するものです。 この文書で実装が必須または推奨として識別されたアルゴリズムは、現時点では（暗号化の意味で）破損していることは知られていないため、これまでの暗号化の研究により、近い将来に安全であり続けると思われます。 ただし、これは必ずしも永遠ではなく、このドキュメントの新しい改訂版が時々発行され、この分野の現在のベストプラクティスを反映することが期待されます。"
    },
    {
      "indent": 3,
      "text": "Retiring an algorithm too soon would result in a zone (signed with a retired algorithm) being downgraded to the equivalent of an unsigned zone. Therefore, algorithm deprecation must be done very slowly and only after careful consideration and measurement of its use.",
      "ja": "アルゴリズムの廃止が早すぎると、ゾーン（廃止されたアルゴリズムで署名された）は、署名されていないゾーンと同等にダウングレードされます。 したがって、アルゴリズムの廃止は非常にゆっくりと、その使用を慎重に検討して測定した後にのみ行う必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Operational Considerations",
      "section_title": true,
      "ja": "5. 運用上の考慮事項"
    },
    {
      "indent": 3,
      "text": "DNSKEY algorithm rollover in a live zone is a complex process. See [RFC6781] and [RFC7583] for guidelines on how to perform algorithm rollovers.",
      "ja": "ライブゾーンでのDNSKEYアルゴリズムのロールオーバーは複雑なプロセスです。 アルゴリズムのロールオーバーの実行方法に関するガイドラインについては、[RFC6781]および[RFC7583]を参照してください。"
    },
    {
      "indent": 3,
      "text": "DS algorithm rollover in a live zone is also a complex process. Upgrading an algorithm at the same time as rolling a new Key Signing Key (KSK) will lead to DNSSEC validation failures. Administrators MUST complete the process of the DS algorithm upgrade before starting a rollover process for a new KSK.",
      "ja": "ライブゾーンでのDSアルゴリズムのロールオーバーも複雑なプロセスです。 新しいキー署名キー（KSK）のローリングと同時にアルゴリズムをアップグレードすると、DNSSEC検証エラーが発生します。 管理者は、新しいKSKのロールオーバープロセスを開始する前に、DSアルゴリズムのアップグレードプロセスを完了する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document has no IANA actions.",
      "ja": "このドキュメントにはIANAアクションがありません。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S.、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC4034] Arends, R., Austein, R., Larson, M., Massey, D., and S. Rose, \"Resource Records for the DNS Security Extensions\", RFC 4034, DOI 10.17487/RFC4034, March 2005, <https://www.rfc-editor.org/info/rfc4034>.",
      "ja": "[RFC4034] Arends、R.、Austein、R.、Larson、M.、Massey、D。、およびS. Rose、「DNSセキュリティ拡張機能のリソースレコード」、RFC 4034、DOI 10.17487 / RFC4034、2005年3月、< https://www.rfc-editor.org/info/rfc4034>。"
    },
    {
      "indent": 3,
      "text": "[RFC5155] Laurie, B., Sisson, G., Arends, R., and D. Blacka, \"DNS Security (DNSSEC) Hashed Authenticated Denial of Existence\", RFC 5155, DOI 10.17487/RFC5155, March 2008, <https://www.rfc-editor.org/info/rfc5155>.",
      "ja": "[RFC5155] Laurie、B.、Sisson、G.、Arends、R。、およびD. Blacka、「DNS Security（DNSSEC）Hashed Authenticated Denial of Dennisence」、RFC 5155、DOI 10.17487 / RFC5155、2008年3月、<https： //www.rfc-editor.org/info/rfc5155>。"
    },
    {
      "indent": 3,
      "text": "[RFC5702] Jansen, J., \"Use of SHA-2 Algorithms with RSA in DNSKEY and RRSIG Resource Records for DNSSEC\", RFC 5702, DOI 10.17487/RFC5702, October 2009, <https://www.rfc-editor.org/info/rfc5702>.",
      "ja": "[RFC5702] Jansen、J。、「DNSSECのDNSKEYおよびRRSIGリソースレコードでのRSAでのSHA-2アルゴリズムの使用」、RFC 5702、DOI 10.17487 / RFC5702、2009年10月、<https://www.rfc-editor.org / info / rfc5702>。"
    },
    {
      "indent": 3,
      "text": "[RFC6605] Hoffman, P. and W. Wijngaards, \"Elliptic Curve Digital Signature Algorithm (DSA) for DNSSEC\", RFC 6605, DOI 10.17487/RFC6605, April 2012, <https://www.rfc-editor.org/info/rfc6605>.",
      "ja": "[RFC6605] Hoffman、P.、W。Wijngaards、「DNSSECの楕円曲線デジタル署名アルゴリズム（DSA）」、RFC 6605、DOI 10.17487 / RFC6605、2012年4月、<https://www.rfc-editor.org/info / rfc6605>。"
    },
    {
      "indent": 3,
      "text": "[RFC6979] Pornin, T., \"Deterministic Usage of the Digital Signature Algorithm (DSA) and Elliptic Curve Digital Signature Algorithm (ECDSA)\", RFC 6979, DOI 10.17487/RFC6979, August 2013, <https://www.rfc-editor.org/info/rfc6979>.",
      "ja": "[RFC6979] Pornin、T.、「デジタル署名アルゴリズム（DSA）および楕円曲線デジタル署名アルゴリズム（ECDSA）の決定論的使用法」、RFC 6979、DOI 10.17487 / RFC6979、2013年8月、<https：//www.rfc- editor.org/info/rfc6979>。"
    },
    {
      "indent": 3,
      "text": "[RFC6986] Dolmatov, V., Ed. and A. Degtyarev, \"GOST R 34.11-2012: Hash Function\", RFC 6986, DOI 10.17487/RFC6986, August 2013, <https://www.rfc-editor.org/info/rfc6986>.",
      "ja": "[RFC6986] Dolmatov、V.、Ed。 およびA. Degtyarev、「GOST R 34.11-2012：ハッシュ関数」、RFC 6986、DOI 10.17487 / RFC6986、2013年8月、<https://www.rfc-editor.org/info/rfc6986>。"
    },
    {
      "indent": 3,
      "text": "[RFC7344] Kumari, W., Gudmundsson, O., and G. Barwood, \"Automating DNSSEC Delegation Trust Maintenance\", RFC 7344, DOI 10.17487/RFC7344, September 2014, <https://www.rfc-editor.org/info/rfc7344>.",
      "ja": "[RFC7344] Kumari、W.、Gudmundsson、O。、およびG. Barwood、「Automaticating DNSSEC Delegation Trust Maintenance」、RFC 7344、DOI 10.17487 / RFC7344、2014年9月、<https://www.rfc-editor.org/ info / rfc7344>。"
    },
    {
      "indent": 3,
      "text": "[RFC8032] Josefsson, S. and I. Liusvaara, \"Edwards-Curve Digital Signature Algorithm (EdDSA)\", RFC 8032, DOI 10.17487/RFC8032, January 2017, <https://www.rfc-editor.org/info/rfc8032>.",
      "ja": "[RFC8032] Josefsson、S.およびI. Liusvaara、「Edwards-Curve Digital Signature Algorithm（EdDSA）」、RFC 8032、DOI 10.17487 / RFC8032、2017年1月、<https://www.rfc-editor.org/info/ rfc8032>。"
    },
    {
      "indent": 3,
      "text": "[RFC8078] Gudmundsson, O. and P. Wouters, \"Managing DS Records from the Parent via CDS/CDNSKEY\", RFC 8078, DOI 10.17487/RFC8078, March 2017, <https://www.rfc-editor.org/info/rfc8078>.",
      "ja": "[RFC8078] Gudmundsson、O。およびP. Wouters、「CDS / CDNSKEYを介した親からのDSレコードの管理」、RFC 8078、DOI 10.17487 / RFC8078、2017年3月、<https://www.rfc-editor.org/info / rfc8078>。"
    },
    {
      "indent": 3,
      "text": "[RFC8080] Sury, O. and R. Edmonds, \"Edwards-Curve Digital Security Algorithm (EdDSA) for DNSSEC\", RFC 8080, DOI 10.17487/RFC8080, February 2017, <https://www.rfc-editor.org/info/rfc8080>.",
      "ja": "[RFC8080] Sury、O.およびR. Edmonds、「DNSSECのエドワード曲線デジタルセキュリティアルゴリズム（EdDSA）」、RFC 8080、DOI 10.17487 / RFC8080、2017年2月、<https://www.rfc-editor.org/ info / rfc8080>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC5933] Dolmatov, V., Ed., Chuprina, A., and I. Ustinov, \"Use of GOST Signature Algorithms in DNSKEY and RRSIG Resource Records for DNSSEC\", RFC 5933, DOI 10.17487/RFC5933, July 2010, <https://www.rfc-editor.org/info/rfc5933>.",
      "ja": "[RFC5933] Dolmatov、V.、Ed。、Chuprina、A。、およびI. Ustinov、「DNSSECのDNSKEYおよびRRSIGリソースレコードでのGOST署名アルゴリズムの使用」、RFC 5933、DOI 10.17487 / RFC5933、2010年7月、<https ：//www.rfc-editor.org/info/rfc5933>。"
    },
    {
      "indent": 3,
      "text": "[RFC6781] Kolkman, O., Mekking, W., and R. Gieben, \"DNSSEC Operational Practices, Version 2\", RFC 6781, DOI 10.17487/RFC6781, December 2012, <https://www.rfc-editor.org/info/rfc6781>.",
      "ja": "[RFC6781] Kolkman、O.、Mekking、W。、およびR. Gieben、「DNSSEC Operational Practices、Version 2」、RFC 6781、DOI 10.17487 / RFC6781、2012年12月、<https://www.rfc-editor.org / info / rfc6781>。"
    },
    {
      "indent": 3,
      "text": "[RFC6944] Rose, S., \"Applicability Statement: DNS Security (DNSSEC) DNSKEY Algorithm Implementation Status\", RFC 6944, DOI 10.17487/RFC6944, April 2013, <https://www.rfc-editor.org/info/rfc6944>.",
      "ja": "[RFC6944]ローズ、S。、「適用可能性宣言：DNSセキュリティ（DNSSEC）DNSKEYアルゴリズムの実装ステータス」、RFC 6944、DOI 10.17487 / RFC6944、2013年4月、<https://www.rfc-editor.org/info/rfc6944 >。"
    },
    {
      "indent": 3,
      "text": "[RFC7091] Dolmatov, V., Ed. and A. Degtyarev, \"GOST R 34.10-2012: Digital Signature Algorithm\", RFC 7091, DOI 10.17487/RFC7091, December 2013, <https://www.rfc-editor.org/info/rfc7091>.",
      "ja": "[RFC7091] Dolmatov、V.、Ed。 およびA. Degtyarev、「GOST R 34.10-2012：デジタル署名アルゴリズム」、RFC 7091、DOI 10.17487 / RFC7091、2013年12月、<https://www.rfc-editor.org/info/rfc7091>。"
    },
    {
      "indent": 3,
      "text": "[RFC7583] Morris, S., Ihren, J., Dickinson, J., and W. Mekking, \"DNSSEC Key Rollover Timing Considerations\", RFC 7583, DOI 10.17487/RFC7583, October 2015, <https://www.rfc-editor.org/info/rfc7583>.",
      "ja": "[RFC7583] Morris、S.、Ihren、J.、Dickinson、J。、およびW. Mekking、「DNSSECキーロールオーバータイミングの考慮事項」、RFC 7583、DOI 10.17487 / RFC7583、2015年10月、<https：//www.rfc -editor.org/info/rfc7583>。"
    },
    {
      "indent": 3,
      "text": "[DNSKEY-IANA] IANA, \"Domain Name System Security (DNSSEC) Algorithm Numbers\", <http://www.iana.org/assignments/dns-sec-alg-numbers>.",
      "ja": "[DNSKEY-IANA] IANA、「ドメインネームシステムセキュリティ（DNSSEC）アルゴリズム番号」、<http://www.iana.org/assignments/dns-sec-alg-numbers>。"
    },
    {
      "indent": 3,
      "text": "[DS-IANA] IANA, \"Delegation Signer (DS) Resource Record (RR) Type Digest Algorithms\", <http://www.iana.org/assignments/ds-rr-types>.",
      "ja": "[DS-IANA] IANA、「委任署名者（DS）リソースレコード（RR）タイプダイジェストアルゴリズム」、<http://www.iana.org/assignments/ds-rr-types>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "This document borrows text from RFC 4307 by Jeffrey I. Schiller of the Massachusetts Institute of Technology (MIT) and RFC 8247 by Yoav Nir, Tero Kivinen, Paul Wouters, and Daniel Migault. Much of the original text has been copied verbatim.",
      "ja": "このドキュメントは、マサチューセッツ工科大学（MIT）のJeffrey I. SchillerによるRFC 4307およびYoav Nir、Tero Kivinen、Paul Wouters、およびDaniel MigaultによるRFC 8247からテキストを借用しています。 元のテキストの多くは逐語的にコピーされています。"
    },
    {
      "indent": 3,
      "text": "We wish to thank Michael Sinatra, Roland van Rijswijk-Deij, Olafur Gudmundsson, Paul Hoffman, Evan Hunt, and Peter Yee for their feedback.",
      "ja": "Michael Sinatra、Roland van Rijswijk-Deij、Olafur Gudmundsson、Paul Hoffman、Evan Hunt、Peter Yeeのフィードバックに感謝します。"
    },
    {
      "indent": 3,
      "text": "Kudos to Roy Arends for bringing the DS rollover issue to light.",
      "ja": "DSロールオーバーの問題を明らかにしたRoy Arendsに称賛を送ります。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Paul Wouters Red Hat Canada",
      "ja": "Paul Wouters Red Hatカナダ"
    },
    {
      "indent": 3,
      "text": "Email: pwouters@redhat.com",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Ondrej Sury Internet Systems Consortium Czech Republic",
      "ja": "Ondrej Sury Internet Systems Consortiumチェコ共和国"
    },
    {
      "indent": 3,
      "text": "Email: ondrej@isc.org",
      "raw": true
    }
  ]
}