{
  "title": {
    "text": "RFC 8706 - Restart Signaling for IS-IS",
    "ja": "RFC 8706 - IS-ISのシグナリングの再開"
  },
  "number": 8706,
  "created_at": "2020-03-11 15:02:42.633038+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       L. Ginsberg\nRequest for Comments: 8706                                      P. Wells\nObsoletes: 5306                                      Cisco Systems, Inc.\nCategory: Standards Track                                  February 2020\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 22,
      "text": "Restart Signaling for IS-IS",
      "ja": "IS-ISのシグナリングの再開"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document describes a mechanism for a restarting router to signal to its neighbors that it is restarting, allowing them to reestablish their adjacencies without cycling through the DOWN state while still correctly initiating database synchronization.",
      "ja": "このドキュメントでは、再起動中のルータが再起動中であることを近隣に通知するメカニズムについて説明します。これにより、データベースの同期を正しく開始しながら、DOWN状態を繰り返さずに隣接関係を再確立できます。"
    },
    {
      "indent": 3,
      "text": "This document additionally describes a mechanism for a router to signal its neighbors that it is preparing to initiate a restart while maintaining forwarding-plane state. This allows the neighbors to maintain their adjacencies until the router has restarted but also allows the neighbors to bring the adjacencies down in the event of other topology changes.",
      "ja": "このドキュメントでは、ルーターが転送プレーンの状態を維持しながら再起動を開始する準備をしていることをルーターに通知するメカニズムについても説明しています。 これにより、ルータが再起動するまで隣接ルータは隣接関係を維持できますが、他のトポロジが変更された場合に隣接ルータが隣接関係をダウンさせることもできます。"
    },
    {
      "indent": 3,
      "text": "This document additionally describes a mechanism for a restarting router to determine when it has achieved Link State Protocol Data Unit (LSP) database synchronization with its neighbors and a mechanism to optimize LSP database synchronization while minimizing transient routing disruption when a router starts.",
      "ja": "さらに、このドキュメントでは、再起動ルーターが隣接機器とのLink State Protocol Data Unit（LSP）データベース同期をいつ達成したかを判断するメカニズム、およびルーター起動時の一時的なルーティングの中断を最小限に抑えながらLSPデータベース同期を最適化するメカニズムについて説明します。"
    },
    {
      "indent": 3,
      "text": "This document obsoletes RFC 5306.",
      "ja": "このドキュメントはRFC 5306を廃止します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット標準化過程の文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、Internet Engineering Task Force（IETF）の製品です。 IETFコミュニティのコンセンサスを表しています。 これは公開レビューを受けており、Internet Engineering Steering Group（IESG）による公開が承認されています。 インターネット標準の詳細については、RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8706.",
      "ja": "このドキュメントの現在のステータス、エラッタ、およびフィードバックに関する情報は、https：//www.rfc-editor.org/info/rfc8706で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2020 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2020 IETF Trustおよび文書作成者として特定された人物。 全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、このドキュメントの公開日に有効なBCP 78およびIETFトラストのIETFドキュメントに関連する法的条項（https://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているので、注意深く確認してください。 このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseテキストを含める必要があり、Simplified BSD Licenseに記載されている保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Overview 2. Conventions Used in This Document 2.1. Requirements Language 3. Approach 3.1. Timers 3.2. Restart TLV 3.2.1. Use of RR and RA Bits 3.2.2. Use of the SA Bit 3.2.3. Use of PR and PA Bits 3.3. Adjacency (Re)Acquisition 3.3.1. Adjacency Reacquisition during Restart 3.3.2. Adjacency Acquisition during Start 3.3.3. Multiple Levels 3.4. Database Synchronization 3.4.1. LSP Generation and Flooding and SPF Computation 4. State Tables 4.1. Running Router 4.2. Restarting Router 4.3. Starting Router 5. IANA Considerations 6. Security Considerations 7. Manageability Considerations 8. Normative References Appendix A. Summary of Changes from RFC 5306 Acknowledgements Authors' Addresses",
      "ja": "1. 概要2.この文書で使用される表記2.1。 要件言語3.アプローチ3.1。 タイマー3.2。 TLV 3.2.1を再起動します。 RRおよびRAビットの使用3.2.2。 SAビットの使用3.2.3。 PRおよびPAビットの使用3.3。 隣接（再）取得3.3.1。 再起動中の隣接の再取得3.3.2。 開始時の隣接取得3.3.3。 複数レベル3.4。 データベースの同期3.4.1。 LSP生成とフラッディングおよびSPF計算4.状態テーブル4.1。 ルーター4.2の実行。 ルーターの再起動4.3。 ルーターの開始5. IANAの考慮事項6.セキュリティの考慮事項7.管理の考慮事項8.規範的な参考資料付録A. RFC 5306謝辞著者のアドレスからの変更の要約"
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1. 概要"
    },
    {
      "indent": 3,
      "text": "The Intermediate System to Intermediate System (IS-IS) routing protocol [RFC1195] [ISO10589] is a link state intra-domain routing protocol. Normally, when an IS-IS router is restarted, temporary disruption of routing occurs due to events in both the restarting router and the neighbors of the restarting router.",
      "ja": "中間システムから中間システム（IS-IS）ルーティングプロトコル[RFC1195] [ISO10589]は、リンク状態のドメイン内ルーティングプロトコルです。 通常、IS-ISルーターを再起動すると、再起動ルーターと再起動ルーターの近隣の両方のイベントにより、ルーティングの一時的な中断が発生します。"
    },
    {
      "indent": 3,
      "text": "The router that has been restarted computes its own routes before achieving database synchronization with its neighbors. The results of this computation are likely to be non-convergent with the routes computed by other routers in the area/domain.",
      "ja": "再起動されたルーターは、近隣とのデータベース同期を実現する前に、独自のルートを計算します。 この計算の結果は、エリア/ドメイン内の他のルーターによって計算されたルートと収束しない可能性があります。"
    },
    {
      "indent": 3,
      "text": "Neighbors of the restarting router detect the restart event and cycle their adjacencies with the restarting router through the DOWN state. The cycling of the adjacency state causes the neighbors to regenerate their LSPs describing the adjacency concerned. This in turn causes a temporary disruption of routes passing through the restarting router.",
      "ja": "再起動ルーターの近隣は再起動イベントを検出し、再起動ルーターとの隣接関係をDOWN状態で循環させます。 隣接状態の循環により、ネイバーは関係する隣接を記述するLSPを再生成します。 これにより、再起動ルータを通過するルートが一時的に中断されます。"
    },
    {
      "indent": 3,
      "text": "In certain scenarios, the temporary disruption of the routes is highly undesirable. This document describes mechanisms to avoid or minimize the disruption due to both of these causes.",
      "ja": "特定のシナリオでは、ルートの一時的な中断は非常に望ましくありません。 このドキュメントでは、これらの両方の原因による中断を回避または最小化するメカニズムについて説明します。"
    },
    {
      "indent": 3,
      "text": "When an adjacency is reinitialized as a result of a neighbor restarting, a router does three things:",
      "ja": "ネイバーの再起動の結果として隣接関係が再初期化されると、ルーターは次の3つのことを行います。"
    },
    {
      "indent": 3,
      "text": "1. It causes its own LSP(s) to be regenerated, thus triggering Shortest Path First (SPF) runs throughout the area (or in the case of Level 2, throughout the domain).",
      "ja": "1. 独自のLSPが再生成されるため、エリア全体（またはドメイン全体のレベル2の場合）で最短パス優先（SPF）実行がトリガーされます。"
    },
    {
      "indent": 3,
      "text": "2. It sets SRMflags on its own LSP database on the adjacency concerned.",
      "ja": "2. 関係する隣接の独自のLSPデータベースにSRMflagsを設定します。"
    },
    {
      "indent": 3,
      "text": "3. In the case of a Point-to-Point link, it transmits a complete set of Complete Sequence Number PDUs (CSNPs), over the adjacency.",
      "ja": "3. Point-to-Pointリンクの場合、隣接を介してComplete Sequence Number PDU（CSNP）の完全なセットを送信します。"
    },
    {
      "indent": 3,
      "text": "In the case of a restarting router process, the first of these is highly undesirable, but the second is essential in order to ensure synchronization of the LSP database.",
      "ja": "再起動ルータプロセスの場合、これらの最初のものは非常に望ましくありませんが、2番目はLSPデータベースの同期を保証するために不可欠です。"
    },
    {
      "indent": 3,
      "text": "The third action above minimizes the number of LSPs that must be exchanged and, if made reliable, provides a means of determining when the LSP databases of the neighboring routers have been synchronized. This is desirable whether or not the router is being restarted (so that the overload bit can be cleared in the router's own LSP, for example).",
      "ja": "上記の3番目のアクションは、交換する必要のあるLSPの数を最小限に抑え、信頼できる場合は、近隣ルーターのLSPデータベースが同期されたときを判断する手段を提供します。 これは、ルーターが再起動されているかどうかに関係なく（たとえば、ルーター自体のLSPで過負荷ビットをクリアできるようにするために）望ましい方法です。"
    },
    {
      "indent": 3,
      "text": "This document describes a mechanism for a restarting router to signal to its neighbors that it is restarting. The mechanism further allows the neighbors to reestablish their adjacencies with the restarting router without cycling through the DOWN state while still correctly initiating database synchronization.",
      "ja": "このドキュメントでは、再起動中のルーターが再起動中であることを近隣に通知するメカニズムについて説明します。 さらに、このメカニズムにより、隣接ノードは、データベースの同期を正しく開始しながら、DOWN状態を繰り返すことなく、再起動ルーターとの隣接関係を再確立できます。"
    },
    {
      "indent": 3,
      "text": "This document additionally describes a mechanism for a restarting router to determine when it has achieved LSP database synchronization with its neighbors and a mechanism to optimize LSP database synchronization and minimize transient routing disruption when a router starts.",
      "ja": "このドキュメントでは、再起動ルーターが近隣とのLSPデータベース同期をいつ達成したかを判断するメカニズムと、LSPデータベース同期を最適化し、ルーター起動時の一時的なルーティングの中断を最小限に抑えるメカニズムについても説明します。"
    },
    {
      "indent": 3,
      "text": "It is assumed that the three-way handshake [RFC5303] is being used on Point-to-Point circuits.",
      "ja": "3ウェイハンドシェイク[RFC5303]がポイントツーポイント回線で使用されていると想定されます。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "2. このドキュメントで使用される規則"
    },
    {
      "indent": 3,
      "text": "If the control and forwarding functions in a router can be maintained independently, it is possible for the forwarding function state to be maintained across a resumption of control function operations. This functionality is assumed when the terms \"restart/restarting\" are used in this document.",
      "ja": "ルーターの制御機能と転送機能を独立して維持できる場合、制御機能の動作を再開しても転送機能の状態を維持できます。 この機能は、このドキュメントで「再起動/再起動」という用語が使用されている場合に想定されています。"
    },
    {
      "indent": 3,
      "text": "The terms \"start/starting\" are used to refer to a router in which the control function has either commenced operations for the first time or has resumed operations, but the forwarding functions have not been maintained in a prior state.",
      "ja": "「開始/開始」という用語は、制御機能が初めて動作を開始したか、動作を再開したが、転送機能が以前の状態に維持されていないルーターを指すために使用されます。"
    },
    {
      "indent": 3,
      "text": "The terms \"(re)start/(re)starting\" are used when the text is applicable to both a \"starting\" and a \"restarting\" router.",
      "ja": "「（re）start /（re）starting」という用語は、テキストが「starting」ルーターと「restarting」ルーターの両方に適用される場合に使用されます。"
    },
    {
      "indent": 3,
      "text": "The terms \"normal IIH\" or \"IIH normal\" refer to IS-IS Hellos (IIHs) in which the Restart TLV (defined later in this document) has no flags set.",
      "ja": "「通常のIIH」または「IIHの正常」という用語は、IS-IS Hello（IIH）を指し、再起動TLV（このドキュメントの後半で定義）にはフラグが設定されていません。"
    },
    {
      "indent": 0,
      "text": "2.1. Requirements Language",
      "section_title": true,
      "ja": "2.1. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Approach",
      "section_title": true,
      "ja": "3. アプローチ"
    },
    {
      "indent": 0,
      "text": "3.1. Timers",
      "section_title": true,
      "ja": "3.1. タイマー"
    },
    {
      "indent": 3,
      "text": "Three additional timers (T1, T2, and T3) are required to support the mechanisms defined in this document. Timers T1 and T2 are used both by a restarting router and a starting router. Timer T3 is used only by a restarting router.",
      "ja": "このドキュメントで定義されているメカニズムをサポートするには、3つの追加のタイマー（T1、T2、およびT3）が必要です。 タイマーT1およびT2は、再起動ルーターと起動ルーターの両方で使用されます。 タイマーT3は再起動ルーターによってのみ使用されます。"
    },
    {
      "indent": 3,
      "text": "NOTE: These timers are NOT applicable to a router that is preparing to do a planned restart.",
      "ja": "注：これらのタイマーは、計画的な再起動の準備をしているルーターには適用できません。"
    },
    {
      "indent": 3,
      "text": "An instance of the timer T1 is maintained per interface and indicates the time after which an unacknowledged (re)start attempt will be repeated. A typical value is 3 seconds.",
      "ja": "タイマーT1のインスタンスはインターフェイスごとに維持され、確認されていない（再）開始の試行が繰り返されるまでの時間を示します。 通常の値は3秒です。"
    },
    {
      "indent": 3,
      "text": "An instance of the timer T2 is maintained for each LSP database (LSPDB) present in the system. For example, for a Level 1/2 system, there will be an instance of the timer T2 for Level 1 and an instance for Level 2. This is the maximum time that the system will wait for LSPDB synchronization. A typical value is 60 seconds.",
      "ja": "タイマーT2のインスタンスは、システムに存在する各LSPデータベース（LSPDB）に対して維持されます。 たとえば、レベル1/2システムの場合、レベル1のタイマーT2とレベル2のインスタンスがあります。これは、システムがLSPDB同期を待機する最大時間です。 典型的な値は60秒です。"
    },
    {
      "indent": 3,
      "text": "A single instance of the timer T3 is maintained for the entire system. It indicates the time after which the router will declare that it has failed to achieve database synchronization (by setting the overload bit in its own LSP). This is initialized to 65535 seconds but is set to the minimum of the remaining times of received IIHs containing a Restart TLV with the Restart Acknowledgement (RA) set and an indication that the neighbor has an adjacency in the UP state to the restarting router. (See item a in Section 3.2.1.)",
      "ja": "タイマーT3の単一インスタンスは、システム全体で維持されます。 ルータがデータベース同期の達成に失敗したことを宣言するまでの時間を示します（自身のLSPで過負荷ビットを設定することにより）。 これは65535秒に初期化されますが、Restart Acknowledgment（RA）が設定されたRestart TLVと、近隣がUP状態の再起動ルーターに隣接していることを示すTLVを含む受信IIHの残り時間の最小値に設定されます。 （セクション3.2.1の項目aを参照してください。）"
    },
    {
      "indent": 0,
      "text": "3.2. Restart TLV",
      "section_title": true,
      "ja": "3.2. TLVを再起動します"
    },
    {
      "indent": 3,
      "text": "A new TLV is defined to be included in IIH PDUs. The TLV includes flags that are used to convey information during a (re)start. The absence of this TLV indicates that the sender supports none of the functionality defined in this document. Therefore, if a router supports any of the functionality defined in this document it MUST include this TLV in all transmitted IIHs.",
      "ja": "新しいTLVは、IIH PDUに含まれるように定義されています。 TLVには、（再）起動中に情報を伝えるために使用されるフラグが含まれています。 このTLVの不在は、送信者がこのドキュメントで定義されている機能のいずれもサポートしていないことを示します。 したがって、ルータがこのドキュメントで定義された機能のいずれかをサポートする場合、すべての送信されたIIHにこのTLVを含めなければなりません。"
    },
    {
      "indent": 3,
      "text": "Type: 211",
      "ja": "タイプ：211"
    },
    {
      "indent": 3,
      "text": "Length:\n   Number of octets in the Value field (1 to (3 + ID Length))",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Value:\n                                         No. of octets\n           +-----------------------+\n           |   Flags               |     1\n           +-----------------------+\n           | Remaining Time        |     2\n           +-----------------------+\n           | Restarting Neighbor ID|     ID Length\n           +-----------------------+",
      "raw": true
    },
    {
      "indent": 6,
      "text": "Flags (1 octet)\n         0  1  2  3  4  5  6  7\n        +--+--+--+--+--+--+--+--+\n        |Reserved|PA|PR|SA|RA|RR|\n        +--+--+--+--+--+--+--+--+",
      "raw": true
    },
    {
      "indent": 9,
      "text": "RR - Restart Request RA - Restart Acknowledgement SA - Suppress adjacency advertisement PR - Restart is planned PA - Planned restart acknowledgement",
      "ja": "RR-再起動要求RA-再起動確認SA-隣接広告の抑制PR-再起動が計画されているPA-再起動確認が計画されている"
    },
    {
      "indent": 6,
      "text": "Remaining Time (2 octets) Remaining Holding Time (in seconds).",
      "ja": "残り時間（2オクテット）残りの保持時間（秒単位）。"
    },
    {
      "indent": 9,
      "text": "Required when the RA, PR, or PA bit is set. Otherwise, this field SHOULD be omitted when sent and MUST be ignored when received.",
      "ja": "RA、PR、またはPAビットが設定されている場合に必要です。 それ以外の場合、このフィールドは送信時に省略されるべきであり（SHOULD）、受信時に無視されなければなりません（MUST）。"
    },
    {
      "indent": 6,
      "text": "Restarting Neighbor System ID (ID Length octets) The System ID of the neighbor to which an RA/PA refers.",
      "ja": "Restarting Neighbor System ID（ID Lengthオクテット）RA / PAが参照するネイバーのシステムID。"
    },
    {
      "indent": 9,
      "text": "Required when the RA or PA bit is set. Otherwise, this field SHOULD be omitted when sent and MUST be ignored when received.",
      "ja": "RAまたはPAビットが設定されている場合に必要です。 それ以外の場合、このフィールドは送信時に省略されるべきであり（SHOULD）、受信時に無視されなければなりません（MUST）。"
    },
    {
      "indent": 9,
      "text": "Note: Very early draft versions of the restart functionality did not include the Restarting Neighbor System ID in the TLV. RFC 5306 allowed for the possibility of interoperating with legacy implementations by stating that a router that is expecting an RA on a LAN circuit should assume that the acknowledgement is directed at the local system if the TLV is received with RA set and Restarting Neighbor System ID is not present. It is an implementation choice whether to continue to accept (on a LAN) a TLV with RA set and Restarting Neighbor System ID absent. Note that the omission of the Restarting Neighbor System ID only introduces ambiguity in the case where there are multiple systems on a LAN simultaneously performing restart.",
      "ja": "注：再起動機能の非常に初期のドラフトバージョンでは、TLVに再起動近隣システムIDが含まれていませんでした。 RFC 5306では、LAN回線上のRAを期待しているルーターは、RAが設定され、近隣システムIDを再起動してTLVを受信した場合、確認応答がローカルシステムに向けられていると想定することで、レガシー実装との相互運用の可能性を許可しました 現在ではない。 RAが設定され、近隣システムIDが再起動されていないTLVを（LAN上で）引き続き受け入れるかどうかは、実装の選択です。 Restarting Neighbor System IDの省略は、LANに複数のシステムが同時に再起動を実行している場合にのみあいまいさをもたらすことに注意してください。"
    },
    {
      "indent": 3,
      "text": "The RR and SA flags may both be set in the TLV under the conditions described in Section 3.3.2. All other combinations where multiple flags are set are invalid and MUST NOT be transmitted. Received TLVs that have invalid flag combinations set MUST be ignored.",
      "ja": "RRおよびSAフラグは、セクション3.3.2で説明されている条件下で、TLVで両方とも設定できます。 複数のフラグが設定されている他のすべての組み合わせは無効であり、送信しないでください。 無効なフラグの組み合わせが設定された受信TLVは無視する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.2.1. Use of RR and RA Bits",
      "section_title": true,
      "ja": "3.2.1. RRおよびRAビットの使用"
    },
    {
      "indent": 3,
      "text": "The RR bit is used by a (re)starting router to signal to its neighbors that a (re)start is in progress, that an existing adjacency SHOULD be maintained even under circumstances when the normal operation of the adjacency state machine would require the adjacency to be reinitialized, to request a set of CSNPs, and to request setting of the SRMflags.",
      "ja": "RRビットは、（再）開始ルーターが（再）開始が進行中であることを隣接に通知するために使用され、隣接状態マシンの通常の動作が隣接を必要とする状況下でも既存の隣接が維持されるべきである（SHOULD） 再初期化され、CSNPのセットを要求し、SRMflagsの設定を要求します。"
    },
    {
      "indent": 3,
      "text": "The RA bit is sent by the neighbor of a (re)starting router to acknowledge the receipt of a Restart TLV with the RR bit set.",
      "ja": "RAビットは、RRビットが設定された再起動TLVの受信を確認するために、（再）起動ルータのネイバーによって送信されます。"
    },
    {
      "indent": 3,
      "text": "When the neighbor of a (re)starting router receives an IIH with the Restart TLV having the RR bit set, if there exists on this interface an adjacency in the UP state with the same System ID and, in the case of a LAN circuit, with the same source LAN address, then irrespective of the other contents of the \"Intermediate System Neighbors\" option (LAN circuits) or the \"Point-to-Point Three-Way Adjacency\" option (Point-to-Point circuits):",
      "ja": "（再）開始ルーターのネイバーが、RRビットが設定された再起動TLVを含むIIHを受信したとき、このインターフェイスに同じシステムIDのUP状態の隣接が存在し、LAN回線の場合、 同じ送信元LANアドレスで、「中間システムネイバー」オプション（LAN回線）または「ポイントツーポイント3ウェイ隣接」オプション（ポイントツーポイント回線）の他のコンテンツに関係なく："
    },
    {
      "indent": 3,
      "text": "a. the state of the adjacency is not changed. If this is the first IIH with the RR bit set that this system has received associated with this adjacency, then the adjacency is marked as being in \"Restart mode\" and the adjacency Holding Time is refreshed -- otherwise, the Holding Time is not refreshed. The Remaining Time transmitted according to (b) below MUST reflect the actual time after which the adjacency will now expire. Receipt of an IIH with the RR bit reset will clear the \"Restart mode\" state. This procedure allows the restarting router to cause the neighbor to maintain the adjacency long enough for restart to successfully complete while also preventing repetitive restarts from maintaining an adjacency indefinitely. Whether or not an adjacency is marked as being in \"Restart mode\" has no effect on adjacency state transitions.",
      "ja": "a。 隣接の状態は変更されません。 これが、このシステムがこの隣接に関連して受信したRRビットが設定された最初のIIHである場合、隣接は「再起動モード」としてマークされ、隣接の保持時間は更新されます-さもなければ、保持時間は更新されません 。 以下の（b）に従って送信される残り時間は、隣接が失効する実際の時間を反映しなければなりません。 RRビットがリセットされたIIHを受信すると、「再起動モード」状態がクリアされます。 この手順により、再起動ルーターは、再起動が正常に完了するのに十分な長さで隣接ルータに隣接を維持させ、繰り返しの再起動が隣接を無期限に維持するのを防ぎます。 隣接が「再起動モード」にあるとマークされているかどうかは、隣接状態の遷移には影響しません。"
    },
    {
      "indent": 3,
      "text": "b. immediately (i.e., without waiting for any currently running timer interval to expire but with a small random delay of a few tens of milliseconds on LANs to avoid \"storms\") transmit over the corresponding interface an IIH including the Restart TLV with the RR bit clear and the RA bit set, in the case of Point-to-Point adjacencies having updated the \"Point-to-Point Three-Way Adjacency\" option to reflect any new values received from the (re)starting router. (This allows a restarting router to quickly acquire the correct information to place in its hellos.) The Remaining Time MUST be set to the current time (in seconds) before the holding timer on this adjacency is due to expire. If the corresponding interface is a LAN interface, then the Restarting Neighbor System ID SHOULD be set to the System ID of the router from which the IIH with the RR bit set was received. This is required to correctly associate the acknowledgement and Holding Time in the case where multiple systems on a LAN restart at approximately the same time. This IIH SHOULD be transmitted before any LSPs or SNPs are transmitted as a result of the receipt of the original IIH.",
      "ja": "b。すぐに（つまり、現在実行中のタイマー間隔が切れるのを待たずに、「ストーム」を避けるためにLANで数十ミリ秒の小さなランダム遅延を使用して）RRビットをクリアした再起動TLVを含むIIHを対応するインターフェイスで送信しますまた、ポイントツーポイント隣接が（再）開始ルーターから受信した新しい値を反映するために「ポイントツーポイント3方向隣接」オプションを更新した場合、RAビットが設定されます。 （これにより、再起動ルーターは正しい情報をすばやく取得して、hellosに配置できます。）この隣接の保持タイマーが期限切れになるまでの残り時間は、現在の時間（秒単位）に設定する必要があります。対応するインターフェースがLANインターフェースである場合、Restarting Neighbor System IDは、RRビットが設定されたIIHが受信されたルーターのシステムIDに設定される必要があります。これは、LAN上の複数のシステムがほぼ同時に再起動する場合に、確認応答と保持時間を正しく関連付けるために必要です。このIIHは、元のIIHの受信の結果としてLSPまたはSNPが送信される前に送信される必要があります。"
    },
    {
      "indent": 3,
      "text": "c. if the corresponding interface is a Point-to-Point interface, or if the receiving router has the highest LnRouterPriority (with the highest source Media Access Control (MAC) address breaking ties) among those routers to which the receiving router has an adjacency in the UP state on this interface whose IIHs contain the Restart TLV, excluding adjacencies to all routers that are considered in \"Restart mode\" (note the actual Designated Intermediate System (DIS) is NOT changed by this process), initiate the transmission over the corresponding interface of a complete set of CSNPs, and set SRMflags on the corresponding interface for all LSPs in the local LSP database.",
      "ja": "c。 対応するインターフェースがPoint-to-Pointインターフェースである場合、または受信ルーターが隣接するルーターの中で最高のLnRouterPriority（最高のソースMedia Access Control（MAC）アドレス破壊タイ）を持つ場合 IIHに再起動TLVが含まれるこのインターフェイスのUP状態。「再起動モード」と見なされるすべてのルーターへの隣接を除きます（実際の指定中間システム（DIS）はこのプロセスでは変更されません）。 完全なCSNPのセットを作成し、ローカルLSPデータベース内のすべてのLSPの対応するインターフェイスにSRMflagsを設定します。"
    },
    {
      "indent": 3,
      "text": "Otherwise (i.e., if there was no adjacency in the UP state to the System ID in question), process the IIH as normal by reinitializing the adjacency and setting the RA bit in the returned IIH.",
      "ja": "それ以外の場合（つまり、問題のシステムIDに対するUP状態の隣接がなかった場合）、隣接を再初期化し、返されたIIHでRAビットを設定することにより、IIHを通常どおり処理します。"
    },
    {
      "indent": 0,
      "text": "3.2.2. Use of the SA Bit",
      "section_title": true,
      "ja": "3.2.2. SAビットの使用"
    },
    {
      "indent": 3,
      "text": "The SA bit is used by a starting router to request that its neighbor suppress advertisement of the adjacency to the starting router in the neighbor's LSPs.",
      "ja": "SAビットは、近隣ルーターが近隣のLSP内の開始ルーターへの隣接のアドバタイズメントを抑制することを要求するために、開始ルーターによって使用されます。"
    },
    {
      "indent": 3,
      "text": "A router that is starting has no maintained forwarding function state. This may or may not be the first time the router has started. If this is not the first time the router has started, copies of LSPs generated by this router in its previous incarnation may exist in the LSP databases of other routers in the network. These copies are likely to appear \"newer\" than LSPs initially generated by the starting router due to the reinitialization of LSP fragment sequence numbers by the starting router. This may cause temporary blackholes to occur until the normal operation of the update process causes the starting router to regenerate and flood copies of its own LSPs with higher sequence numbers. The temporary blackholes can be avoided if the starting router's neighbors suppress advertising an adjacency to the starting router until the starting router has been able to propagate newer versions of LSPs generated by previous incarnations.",
      "ja": "起動中のルーターには、転送機能の状態が維持されていません。 これは、ルータが初めて起動した場合とそうでない場合があります。 ルーターが初めて起動したのではない場合、以前のインカネーションでこのルーターによって生成されたLSPのコピーがネットワーク内の他のルーターのLSPデータベースに存在する可能性があります。 これらのコピーは、開始ルーターによるLSPフラグメントシーケンス番号の再初期化により、開始ルーターによって最初に生成されたLSPよりも「新しい」ように見える可能性があります。 これにより、更新プロセスの通常の操作によって開始ルーターがより高いシーケンス番号を持つ独自のLSPのコピーを再生成およびフラッディングするまで、一時的なブラックホールが発生する可能性があります。 開始ルーターが以前のインカネーションによって生成された新しいバージョンのLSPを伝播できるようになるまで、開始ルーターの隣接ルータが開始ルーターへの隣接のアドバタイズを抑制する場合、一時的なブラックホールを回避できます。"
    },
    {
      "indent": 3,
      "text": "When a router receives an IIH with the Restart TLV having the SA bit set, if there exists on this interface an adjacency in the UP state with the same System ID and, in the case of a LAN circuit, with the same source LAN address, then the router MUST suppress advertisement of the adjacency to the neighbor in its own LSPs. Until an IIH with the SA bit clear has been received, the neighbor advertisement MUST continue to be suppressed. If the adjacency transitions to the UP state, the new adjacency MUST NOT be advertised until an IIH with the SA bit clear has been received.",
      "ja": "ルータがSAビットが設定された再起動TLVでIIHを受信すると、このインターフェイスに同じシステムIDのUP状態の隣接が存在し、LAN回線の場合は同じ送信元LANアドレスがあり、 次に、ルータは、自身のLSPで隣接への隣接のアドバタイズメントを抑制しなければなりません。 SAビットがクリアされたIIHが受信されるまで、ネイバーアドバタイズメントは抑制され続ける必要があります。 隣接がUP状態に移行する場合、SAビットがクリアされたIIHが受信されるまで、新しい隣接をアドバタイズしてはなりません。"
    },
    {
      "indent": 3,
      "text": "Note that a router that suppresses advertisement of an adjacency MUST NOT use this adjacency when performing its SPF calculation. In particular, if an implementation follows the example guidelines presented in [ISO10589], Annex C.2.5, Step 0:b) \"pre-load TENT with the local adjacency database\", the suppressed adjacency MUST NOT be loaded into TENT.",
      "ja": "隣接のアドバタイズを抑制するルーターは、SPF計算を実行するときにこの隣接を使用してはならないことに注意してください。 特に、実装が[ISO10589]、Annex C.2.5、ステップ0：b）「ローカル隣接データベースでTENTをプリロードする」で示されたガイドライン例に従う場合、抑制された隣接をTENTにロードしてはなりません。"
    },
    {
      "indent": 0,
      "text": "3.2.3. Use of PR and PA Bits",
      "section_title": true,
      "ja": "3.2.3. PRおよびPAビットの使用"
    },
    {
      "indent": 3,
      "text": "The PR bit is used by a router that is planning to initiate a restart to signal to its neighbors that it will be restarting. The router sending an IIH with PR bit set SHOULD set the Remaining Time to a value greater than the expected control-plane restart time. The PR bit SHOULD remain set in IIHs until the restart is initiated.",
      "ja": "PRビットは、再起動を開始することを計画しているルーターによって使用され、再起動することを近隣に通知します。 PRビットが設定されたIIHを送信するルーターは、Remaining Timeを予想されるコントロールプレーンの再起動時間よりも大きい値に設定する必要があります。 PRビットは、再起動が開始されるまでIIHに設定されたままにする必要があります。"
    },
    {
      "indent": 3,
      "text": "The PA bit is sent by the neighbor of a router planning to restart to acknowledge receipt of a Restart TLV with the PR bit set.",
      "ja": "PAビットは、PRビットが設定されたRestart TLVの受信を確認するために再起動を計画しているルータのネイバーによって送信されます。"
    },
    {
      "indent": 3,
      "text": "When the neighbor of a router planning a restart receives an IIH with the Restart TLV having the PR bit set, if there exists on this interface an adjacency in the UP state with the same System ID and, in the case of a LAN circuit, with the same source LAN address, then:",
      "ja": "再起動を計画しているルーターのネイバーがPRビットが設定された再起動TLVを含むIIHを受信した場合、このインターフェイスに同じシステムIDのUP状態の隣接が存在し、 次に、同じ送信元LANアドレス："
    },
    {
      "indent": 3,
      "text": "a. if this is the first IIH with the PR bit set that this system has received associated with this adjacency, then the adjacency is marked as being in Planned Restart State and the adjacency Holding Time is refreshed -- otherwise, the Holding Time is not refreshed. The Holding Time SHOULD be set to the Remaining Time specified in the received IIH with PR set. The Remaining Time transmitted according to (b) below MUST reflect the actual time after which the adjacency will now expire. Receipt of an IIH with the PR bit reset will clear the Planned Restart State and cause the receiving router to set the adjacency Holding Time to the locally configured value. This procedure allows the router planning a restart to cause the neighbor to maintain the adjacency long enough for restart to successfully complete. Whether or not an adjacency is marked as being in Planned Restart State has no effect on adjacency state transitions.",
      "ja": "a。 このシステムがこの隣接に関連して受信したPRビットが設定された最初のIIHである場合、隣接は計画再起動状態にあるとマークされ、隣接の保持時間は更新されます-さもなければ、保持時間は更新されません。 保持時間は、PRが設定された受信IIHで指定された残り時間に設定する必要があります。 以下の（b）に従って送信される残り時間は、隣接が失効する実際の時間を反映しなければなりません。 PRビットがリセットされたIIHを受信すると、Planned Restart Stateがクリアされ、受信ルータは隣接保持時間をローカルに設定された値に設定します。 この手順により、ルーターは再起動を計画して、再起動が正常に完了するのに十分な長さで隣接ルータが隣接関係を維持できるようにします。 隣接がPlanned Restart Stateとしてマークされているかどうかは、隣接状態の遷移に影響しません。"
    },
    {
      "indent": 3,
      "text": "b. immediately (i.e., without waiting for any currently running timer interval to expire, but with a small random delay of a few tens of milliseconds on LANs to avoid \"storms\") transmit over the corresponding interface an IIH including the Restart TLV with the PR bit clear and the PA bit set. The Remaining Time MUST be set to the current time (in seconds) before the holding timer on this adjacency is due to expire. If the corresponding interface is a LAN interface, then the Restarting Neighbor System ID SHOULD be set to the System ID of the router from which the IIH with the PR bit set was received. This is required to correctly associate the acknowledgement and Holding Time in the case where multiple systems on a LAN are planning a restart at approximately the same time.",
      "ja": "b。 すぐに（つまり、現在実行中のタイマー間隔が切れるのを待たずに、「ストーム」を回避するためにLANで数十ミリ秒の小さなランダム遅延を使用して）PRビットを持つRestart TLVを含むIIHを対応するインターフェイスで送信します クリアされ、PAビットが設定されます。 Remaining Timeは、この隣接の保持タイマーが期限切れになる前に、現在の時間（秒単位）に設定する必要があります。 対応するインターフェースがLANインターフェースである場合、再起動近隣システムIDは、PRビットが設定されたIIHが受信されたルーターのシステムIDに設定される必要があります。 これは、LAN上の複数のシステムがほぼ同時に再起動を計画している場合に、確認応答と保持時間を正しく関連付けるために必要です。"
    },
    {
      "indent": 3,
      "text": "NOTE: Receipt of an IIH with PA bit set indicates to the router planning a restart that the neighbor is aware of the planned restart and -- in the absence of topology changes as described below -- will maintain the adjacency for the Remaining Time included in the IIH with PA set.",
      "ja": "注：PAビットが設定されたIIHの受信は、再起動を計画しているルーターに対して、近隣が計画された再起動を認識していることを示し、以下に説明するトポロジの変更がない場合、残り時間の隣接性を維持します PAが設定されたIIH。"
    },
    {
      "indent": 3,
      "text": "By definition, a restarting router maintains forwarding state across the control-plane restart (see Section 2). But while a control-plane restart is in progress, it is expected that the restarting router will be unable to respond to topology changes. It is therefore useful to signal a planned restart so that the neighbors of the restarting router can determine whether it is safe to maintain the adjacency if other topology changes occur prior to the completion of the restart. Signaling a planned restart in the absence of maintained forwarding-plane state is likely to lead to significant traffic loss and MUST NOT be done.",
      "ja": "定義上、再起動ルーターは、コントロールプレーンの再起動全体で転送状態を維持します（セクション2を参照）。 ただし、コントロールプレーンの再起動が進行中の間、再起動するルーターはトポロジの変更に応答できないことが予想されます。 したがって、再起動の完了前に他のトポロジの変更が発生した場合、再起動ルーターの近隣が隣接関係を維持しても安全かどうかを判断できるように、再起動の計画を通知することが役立ちます。 フォワーディングプレーンの状態が維持されていない状態で計画的な再起動を通知すると、重大なトラフィック損失が発生する可能性があるため、実行しないでください。"
    },
    {
      "indent": 3,
      "text": "Neighbors of the router that have signaled planned restart SHOULD maintain the adjacency in a Planned Restart State until it receives an IIH with the RR bit set, it receives an IIH with both PR and RR bits clear, or the adjacency Holding Time expires -- whichever occurs first. Neighbors that choose not to follow the recommended behavior need to consider the impact on traffic delivery of not using the restarting router for forwarding traffic during the restart period.",
      "ja": "計画的再起動を通知したルータのネイバーは、RRビットが設定されたIIHを受信するか、PRビットとRRビットの両方がクリアされたIIHを受信するか、隣接保持時間の期限が切れるまで、隣接を計画再起動状態で維持する必要があります（SHOULD） 最初に発生します。 推奨される動作に従わないことを選択したネイバーは、再起動期間中にトラフィックを転送するために再起動ルーターを使用しない場合のトラフィック配信への影響を考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "While the adjacency is in Planned Restart State, some or all of the following actions MAY be taken:",
      "ja": "隣接が計画再起動状態にある間、次のアクションの一部またはすべてが実行される場合があります。"
    },
    {
      "indent": 3,
      "text": "a. If additional topology changes occur, the adjacency that is in Planned Restart State MAY be brought down even though the Holding Time has not yet expired. Given that the neighbor that has signaled a planned restart is not expected to update its forwarding plane in response to signaling of the topology changes (since it is restarting) traffic that transits that node is at risk of being improperly forwarded. On a LAN circuit, if the router in Planned Restart State is the DIS at any supported level, the adjacency or adjacencies SHOULD be brought down whenever any LSP update is either generated or received so as to trigger a new DIS election. Failure to do so will compromise the reliability of the update process on that circuit. What other criteria are used to determine what topology changes will trigger bringing the adjacency down is a local implementation decision.",
      "ja": "a。 追加のトポロジ変更が発生した場合、保留時間がまだ切れていなくても、計画再起動状態にある隣接関係がダウンする場合があります。 計画的な再起動を通知したネイバーは、そのノードを通過するトポロジ変更（再起動しているため）の通知に応答して転送プレーンを更新することは想定されていないため、そのノードは不適切に転送されるリスクがあります。 LAN回線では、計画再起動状態のルーターがサポートされているレベルのDISである場合、LSP更新が生成または受信されて新しいDIS選出がトリガーされるたびに、隣接関係がダウンする必要があります（SHOULD）。 そうしないと、その回線での更新プロセスの信頼性が低下します。 どのトポロジ変更が隣接をダウンさせるかを決定するために使用される他の基準は、ローカル実装の決定です。"
    },
    {
      "indent": 3,
      "text": "b. If a Bidirectional Forwarding Detection (BFD) [RFC5880] Session to the neighbor that signals a planned restart is in the UP state and subsequently goes down, the event MAY be ignored since it is possible this is an expected side effect of the restart. Use of the Control-Plane Independent state as signaled in BFD control packets SHOULD be considered in the decision to ignore a BFD Session DOWN event.",
      "ja": "b。 双方向の転送検出（BFD）[RFC5880]計画された再起動を通知するネイバーへのセッションがUP状態にあり、その後ダウンする場合、これは再起動の予想される副作用である可能性があるため、イベントを無視してもよい（MAY）。 BFD制御パケットで通知されたControl-Plane Independent状態の使用は、BFD Session DOWNイベントを無視する決定で考慮される必要があります。"
    },
    {
      "indent": 3,
      "text": "c. On a Point-to-Point circuit, transmission of LSPs, CSNPs, and Partial Sequence Number PDU (PSNPs) MAY be suppressed. It is expected that the PDUs will not be received.",
      "ja": "c。 Point-to-Point回線では、LSP、CSNP、および部分シーケンス番号PDU（PSNP）の送信が抑制される場合があります。 PDUは受信されないことが予想されます。"
    },
    {
      "indent": 3,
      "text": "Use of the PR bit provides a means to safely support restart periods that are significantly longer than standard Holding Times.",
      "ja": "PRビットを使用すると、標準の保持時間よりも大幅に長い再起動期間を安全にサポートできます。"
    },
    {
      "indent": 0,
      "text": "3.3. Adjacency (Re)Acquisition",
      "section_title": true,
      "ja": "3.3. 隣接（再）取得"
    },
    {
      "indent": 3,
      "text": "Adjacency (re)acquisition is the first step in (re)initialization. Restarting and starting routers will make use of the RR bit in the Restart TLV, though each will use it at different stages of the (re)start procedure.",
      "ja": "隣接（再）取得は、（再）初期化の最初のステップです。 ルーターを再起動して起動すると、Restart TLVのRRビットが使用されますが、それぞれが（再）起動手順の異なる段階で使用されます。"
    },
    {
      "indent": 0,
      "text": "3.3.1. Adjacency Reacquisition during Restart",
      "section_title": true,
      "ja": "3.3.1. 再起動中の隣接関係の再取得"
    },
    {
      "indent": 3,
      "text": "The restarting router explicitly notifies its neighbor that the adjacency is being reacquired and, hence, that it SHOULD NOT reinitialize the adjacency. This is achieved by setting the RR bit in the Restart TLV. When the neighbor of a restarting router receives an IIH with the Restart TLV having the RR bit set, if there exists on this interface an adjacency in the UP state with the same System ID and, in the case of a LAN circuit, with the same source LAN address, then the procedures described in Section 3.2.1 are followed.",
      "ja": "再起動ルーターは、隣接が再取得されていることを隣接に明示的に通知するため、隣接を再初期化するべきではありません。 これは、Restart TLVでRRビットを設定することにより実現されます。 再起動ルーターのネイバーが、RRビットが設定された再起動TLVを含むIIHを受信したとき、このインターフェイスに同じシステムIDのUP状態の隣接が存在し、LAN回線の場合は同じ 送信元LANアドレス、セクション3.2.1で説明されている手順に従います。"
    },
    {
      "indent": 3,
      "text": "A router that does not support the restart capability will ignore the Restart TLV and reinitialize the adjacency as normal, returning an IIH without the Restart TLV.",
      "ja": "再起動機能をサポートしていないルーターは、再起動TLVを無視し、通常どおり隣接関係を再初期化し、再起動TLVなしでIIHを返します。"
    },
    {
      "indent": 3,
      "text": "On restarting, a router initializes the timer T3, starts the timer T2 for each LSPDB, and for each interface (and in the case of a LAN circuit, for each level) starts the timer T1 and transmits an IIH containing the Restart TLV with the RR bit set.",
      "ja": "再起動すると、ルーターはタイマーT3を初期化し、LSPDBごとにタイマーT2を開始し、各インターフェイス（およびLAN回線の場合は各レベル）でタイマーT1を開始し、再起動TLVを含むIIHを送信します。 RRビットが設定されました。"
    },
    {
      "indent": 3,
      "text": "On a Point-to-Point circuit, the restarting router SHOULD set the \"Adjacency Three-Way State\" to \"Init\", because the receipt of the acknowledging IIH (with RA set) MUST cause the adjacency to enter the UP state immediately.",
      "ja": "Point-to-Point回線では、再起動ルーターは「隣接3状態」を「初期化」に設定する必要があります。これは、承認されたIIH（RAが設定された）を受信すると、隣接がすぐにUP状態に移行する必要があるためです。"
    },
    {
      "indent": 3,
      "text": "On a LAN circuit, the LAN-ID assigned to the circuit SHOULD be the same as that used prior to the restart. In particular, for any circuits for which the restarting router was previously DIS, the use of a different LAN-ID would necessitate the generation of a new set of pseudonode LSPs and corresponding changes in all the LSPs referencing them from other routers on the LAN. By preserving the LAN-ID across the restart, this churn can be prevented. To enable a restarting router to learn the LAN-ID used prior to restart, the LAN-ID specified in an IIH with RR set MUST be ignored.",
      "ja": "LAN回線では、回線に割り当てられたLAN-IDは、再起動前に使用されたものと同じである必要があります。 特に、再起動ルーターが以前にDISであった回線の場合、異なるLAN-IDを使用すると、擬似ノードLSPの新しいセットの生成と、LAN上の他のルーターからそれらを参照するすべてのLSPの対応する変更が必要になります。 再起動後もLAN-IDを保持することにより、この混乱を防ぐことができます。 再起動するルーターが再起動前に使用されるLAN-IDを学習できるようにするには、RRが設定されたIIHで指定されたLAN-IDを無視する必要があります。"
    },
    {
      "indent": 3,
      "text": "Transmission of \"normal IIHs\" is inhibited until the conditions described below are met (in order to avoid causing an unnecessary adjacency initialization). Upon expiry of the timer T1, it is restarted and the IIH is retransmitted as above.",
      "ja": "「通常のIIH」の送信は、以下で説明する条件が満たされるまで禁止されます（不要な隣接関係の初期化を回避するため）。 タイマーT1が終了すると、再起動され、上記のようにIIHが再送信されます。"
    },
    {
      "indent": 3,
      "text": "When a restarting router receives an IIH a local adjacency is established as usual, and if the IIH contains a Restart TLV with the RA bit set (and on LAN circuits with a Restart Neighbor System ID that matches that of the local system), the receipt of the acknowledgement over that interface is noted. When the RA bit is set and the state of the remote adjacency is UP, then the timer T3 is set to the minimum of its current value and the value of the Remaining Time field in the received IIH.",
      "ja": "再起動ルーターがIIHを受信すると、通常どおりローカル隣接が確立され、IIHにRAビットが設定された（およびローカルシステムの再起動ネイバーシステムIDを持つLAN回線上の）再起動TLVが含まれる場合、受信 そのインターフェースを介した確認応答が記録されます。 RAビットが設定され、リモート隣接の状態がUPの場合、タイマーT3は、現在の値と受信したIIHのRemaining Timeフィールドの値の最小値に設定されます。"
    },
    {
      "indent": 3,
      "text": "On a Point-to-Point link, receipt of an IIH not containing the Restart TLV is also treated as an acknowledgement, since it indicates that the neighbor is not restart capable. However, since no CSNP is guaranteed to be received over this interface, the timer T1 is canceled immediately without waiting for a complete set of CSNPs. Synchronization may therefore be deemed complete even though there are some LSPs that are held (only) by this neighbor (see Section 3.4). In this case, we also want to be certain that the neighbor will reinitialize the adjacency in order to guarantee that the SRMflags have been set on its database, thus ensuring eventual LSPDB synchronization. This is guaranteed to happen except in the case where the Adjacency Three-Way State in the received IIH is UP and the Neighbor Extended Local Circuit ID matches the Extended Local Circuit ID assigned by the restarting router. In this case, the restarting router MUST force the adjacency to reinitialize by setting the local Adjacency Three-Way State to DOWN and sending a normal IIH.",
      "ja": "Point-to-Pointリンクでは、再起動TLVを含まないIIHの受信も確認応答として扱われます。これは、ネイバーが再起動可能でないことを示すためです。ただし、このインターフェイスを介したCSNPの受信は保証されていないため、CSNPの完全なセットを待たずに、タイマーT1はすぐにキャンセルされます。したがって、このネイバーによって（のみ）保持されているLSPがある場合でも、同期は完了したと見なされる場合があります（セクション3.4を参照）。この場合、SRMflagsがデータベースに設定されていることを保証するためにネイバーが隣接関係を再初期化し、最終的なLSPDB同期を保証することも確実にしたいです。これは、受信したIIHの隣接3ウェイ状態がUPで、近隣拡張ローカル回線IDが再起動ルーターによって割り当てられた拡張ローカル回線IDと一致する場合を除き、発生することが保証されています。この場合、再起動ルーターは、ローカルAdjacency Three-Way StateをDOWNに設定し、通常のIIHを送信することにより、隣接を強制的に再初期化する必要があります。"
    },
    {
      "indent": 3,
      "text": "In the case of a LAN interface, receipt of an IIH not containing the Restart TLV is unremarkable since synchronization can still occur so long as at least one of the non-restarting neighboring routers on the LAN supports restart. Therefore, T1 continues to run in this case. If none of the neighbors on the LAN are restart capable, T1 will eventually expire after the locally defined number of retries.",
      "ja": "LANインターフェイスの場合、再起動TLVを含まないIIHの受信は、LAN上の非再起動隣接ルーターの少なくとも1つが再起動をサポートしている限り同期が発生する可能性があるため、目立たない。 したがって、この場合、T1は引き続き実行されます。 LAN上のどのネイバーも再起動可能でない場合、ローカルで定義された再試行回数の後にT1は最終的に期限切れになります。"
    },
    {
      "indent": 3,
      "text": "In the case of a Point-to-Point circuit, the LocalCircuitID and Extended Local Circuit ID information contained in the IIH can be used immediately to generate an IIH containing the correct three-way handshake information. The presence of Neighbor Extended Local Circuit ID information that does not match the value currently in use by the local system is ignored (since the IIH may have been transmitted before the neighbor had received the new value from the restarting router), but the adjacency remains in the initializing state until the correct information is received.",
      "ja": "Point-to-Point回線の場合、IIHに含まれるLocalCircuitIDおよびExtended Local Circuit ID情報をすぐに使用して、正しいスリーウェイハンドシェイク情報を含むIIHを生成できます。 ローカルシステムで現在使用されている値と一致しないNeighbor Extended Local Circuit ID情報の存在は無視されます（IIHは再起動ルーターから新しい値を受信する前にIIHが送信された可能性があるため）が、隣接関係は維持されます 正しい情報が受信されるまで初期化状態にあります。"
    },
    {
      "indent": 3,
      "text": "In the case of a LAN circuit, the source neighbor information (e.g., SNPAAddress) is recorded and used for adjacency establishment and maintenance as normal.",
      "ja": "LAN回線の場合、ソースネイバー情報（SNPAAddressなど）が記録され、通常どおり隣接関係の確立と保守に使用されます。"
    },
    {
      "indent": 3,
      "text": "When BOTH a complete set of CSNPs (for each active level, in the case of a Point-to-Point circuit) and an acknowledgement have been received over the interface, the timer T1 is canceled.",
      "ja": "（ポイントツーポイント回線の場合、各アクティブレベルの）CSNPの完全なセットと確認応答の両方がインターフェイスを介して受信されると、タイマーT1はキャンセルされます。"
    },
    {
      "indent": 3,
      "text": "Once the timer T1 has been canceled, subsequent IIHs are transmitted according to the normal algorithms but including the Restart TLV with both RR and RA clear.",
      "ja": "タイマーT1がキャンセルされると、後続のIIHは通常のアルゴリズムに従って送信されますが、RRとRAの両方がクリアされた再起動TLVが含まれます。"
    },
    {
      "indent": 3,
      "text": "If a LAN contains a mixture of systems, only some of which support the new algorithm, database synchronization is still guaranteed, but the \"old\" systems will have reinitialized their adjacencies.",
      "ja": "LANに新しいアルゴリズムをサポートするシステムのみが混在する場合、データベースの同期は保証されますが、「古い」システムは隣接関係を再初期化します。"
    },
    {
      "indent": 3,
      "text": "If an interface is active but does not have any neighboring router reachable over that interface, the timer T1 would never be canceled, and according to Section 3.4.1.1, the SPF would never be run. Therefore, timer T1 is canceled after some predetermined number of expirations (which MAY be 1).",
      "ja": "インターフェイスがアクティブであるが、そのインターフェイスを介して到達可能な近隣ルーターがない場合、タイマーT1はキャンセルされず、セクション3.4.1.1に従って、SPFは実行されません。 したがって、タイマーT1は、所定の数の有効期限（1の場合があります）の後にキャンセルされます。"
    },
    {
      "indent": 0,
      "text": "3.3.2. Adjacency Acquisition during Start",
      "section_title": true,
      "ja": "3.3.2. 開始時の隣接関係の取得"
    },
    {
      "indent": 3,
      "text": "The starting router wants to ensure that in the event that a neighboring router has an adjacency to the starting router in the UP state (from a previous incarnation of the starting router), this adjacency is reinitialized. The starting router also wants neighboring routers to suppress advertisement of an adjacency to the starting router until LSP database synchronization is achieved. This is achieved by sending IIHs with the RR bit clear and the SA bit set in the Restart TLV. The RR bit remains clear and the SA bit remains set in subsequent transmissions of IIHs until the adjacency has reached the UP state and the initial T1 timer interval (see below) has expired.",
      "ja": "開始ルーターは、近隣ルーターがUP状態の開始ルーターと隣接関係にある場合（開始ルーターの以前のインカネーションから）、この隣接関係が再初期化されるようにします。 また、開始ルーターは、LSPデータベースの同期が達成されるまで、隣接ルーターが開始ルーターへの隣接関係の広告を抑制することを望みます。 これは、RRビットをクリアし、SAビットをRestart TLVに設定してIIHを送信することで実現されます。 RRビットはクリアされたままで、隣接がUP状態に達し、初期T1タイマー間隔（下記を参照）が期限切れになるまで、IIHの後続の送信でSAビットが設定されたままになります。"
    },
    {
      "indent": 3,
      "text": "Receipt of an IIH with the RR bit clear will result in the neighboring router utilizing normal operation of the adjacency state machine. This will ensure that any old adjacency on the neighboring router will be reinitialized.",
      "ja": "RRビットがクリアされたIIHを受信すると、隣接ルータは隣接状態マシンの通常の動作を利用します。 これにより、隣接ルータ上の古い隣接関係が確実に再初期化されます。"
    },
    {
      "indent": 3,
      "text": "Upon receipt of an IIH with the SA bit set, the behavior described in Section 3.2.2 is followed.",
      "ja": "SAビットが設定されたIIHを受信すると、セクション3.2.2で説明されている動作に従います。"
    },
    {
      "indent": 3,
      "text": "Upon starting, a router starts timer T2 for each LSPDB.",
      "ja": "開始すると、ルーターは各LSPDBのタイマーT2を開始します。"
    },
    {
      "indent": 3,
      "text": "For each interface (and in the case of a LAN circuit, for each level), when an adjacency reaches the UP state, the starting router starts a timer T1 and transmits an IIH containing the restart TLV with the RR bit clear and SA bit set. Upon expiry of the timer T1, it is restarted and the IIH is retransmitted with both RR and SA bits set (only the RR bit has changed state from earlier IIHs).",
      "ja": "各インターフェイス（およびLAN回線の場合、各レベル）で、隣接関係がUP状態に達すると、開始ルーターはタイマーT1を開始し、RRビットがクリアされSAビットが設定されたリスタートTLVを含むIIHを送信します 。 タイマーT1が終了すると、再起動され、RRとSAビットの両方が設定されたIIHが再送信されます（RRビットのみが以前のIIHから状態を変更しました）。"
    },
    {
      "indent": 3,
      "text": "Upon receipt of an IIH with the RR bit set (regardless of whether or not the SA bit is set), the behavior described in Section 3.2.1 is followed.",
      "ja": "RRビットが設定されたIIHを受信すると（SAビットが設定されているかどうかに関係なく）、セクション3.2.1で説明されている動作に従います。"
    },
    {
      "indent": 3,
      "text": "When an IIH is received by the starting router and the IIH contains a Restart TLV with the RA bit set (and on LAN circuits with a Restart Neighbor System ID that matches that of the local system), the receipt of the acknowledgement over that interface is noted.",
      "ja": "開始ルーターがIIHを受信し、IIHにRAビットが設定された（およびローカルシステムのIDと一致する再起動ネイバーシステムIDを持つLAN回線上の）再起動TLVが含まれている場合、そのインターフェイスでの受信確認は 了解しました。"
    },
    {
      "indent": 3,
      "text": "On a Point-to-Point link, receipt of an IIH not containing the Restart TLV is also treated as an acknowledgement, since it indicates that the neighbor is not restart capable. Since the neighbor will have reinitialized the adjacency, this guarantees that SRMflags have been set on its database, thus ensuring eventual LSPDB synchronization. However, since no CSNP is guaranteed to be received over this interface, the timer T1 is canceled immediately without waiting for a complete set of CSNPs. Synchronization may therefore be deemed complete even though there are some LSPs that are held (only) by this neighbor (see Section 3.4).",
      "ja": "Point-to-Pointリンクでは、リスタートTLVを含まないIIHの受信も確認応答として扱われます。これは、ネイバーがリスタートに対応していないことを示すためです。 ネイバーは隣接関係を再初期化するため、これによりデータベースにSRMflagsが設定され、最終的なLSPDB同期が保証されます。 ただし、このインターフェイスを介したCSNPの受信は保証されていないため、CSNPの完全なセットを待たずに、タイマーT1はすぐにキャンセルされます。 したがって、このネイバーによって（のみ）保持されているLSPがある場合でも、同期は完了したと見なされる場合があります（セクション3.4を参照）。"
    },
    {
      "indent": 3,
      "text": "In the case of a LAN interface, receipt of an IIH not containing the Restart TLV is unremarkable since synchronization can still occur so long as at least one of the non-restarting neighboring routers on the LAN supports restart. Therefore, T1 continues to run in this case. If none of the neighbors on the LAN are restart capable, T1 will eventually expire after the locally defined number of retries. The usual operation of the update process will ensure that synchronization is eventually achieved.",
      "ja": "LANインターフェイスの場合、再起動TLVを含まないIIHの受信は、LAN上の非再起動隣接ルーターの少なくとも1つが再起動をサポートしている限り同期が発生する可能性があるため、目立たない。 したがって、この場合、T1は引き続き実行されます。 LAN上のどのネイバーも再起動可能でない場合、ローカルで定義された再試行回数の後にT1は最終的に期限切れになります。 更新プロセスの通常の操作により、最終的に同期が確実に行われます。"
    },
    {
      "indent": 3,
      "text": "When BOTH a complete set of CSNPs (for each active level, in the case of a Point-to-Point circuit) and an acknowledgement have been received over the interface, the timer T1 is canceled. Subsequent IIHs sent by the starting router have the RR and RA bits clear and the SA bit set in the Restart TLV.",
      "ja": "（ポイントツーポイント回線の場合、各アクティブレベルの）CSNPの完全なセットと確認応答の両方がインターフェイスを介して受信されると、タイマーT1はキャンセルされます。 開始ルーターによって送信される後続のIIHには、RRおよびRAビットがクリアされ、SAビットがRestart TLVで設定されます。"
    },
    {
      "indent": 3,
      "text": "Timer T1 is canceled after some predetermined number of expirations (which MAY be 1).",
      "ja": "タイマーT1は、所定の数の有効期限（1の場合があります）の後にキャンセルされます。"
    },
    {
      "indent": 3,
      "text": "When the T2 timer(s) are canceled or expire, transmission of \"normal IIHs\" will begin.",
      "ja": "T2タイマーがキャンセルまたは期限切れになると、「通常のIIH」の送信が開始されます。"
    },
    {
      "indent": 0,
      "text": "3.3.3. Multiple Levels",
      "section_title": true,
      "ja": "3.3.3. 複数のレベル"
    },
    {
      "indent": 3,
      "text": "A router that is operating as both a Level 1 and a Level 2 router on a particular interface MUST perform the above operations for each level.",
      "ja": "特定のインターフェイスでレベル1とレベル2の両方のルーターとして動作しているルーターは、各レベルで上記の操作を実行する必要があります。"
    },
    {
      "indent": 3,
      "text": "On a LAN interface, it MUST send and receive both Level 1 and Level 2 IIHs and perform the CSNP synchronizations independently for each level.",
      "ja": "LANインターフェイスでは、レベル1とレベル2の両方のIIHを送受信し、各レベルでCSNP同期を個別に実行する必要があります。"
    },
    {
      "indent": 3,
      "text": "On a Point-to-Point interface, only a single IIH (indicating support for both levels) is required, but it MUST perform the CSNP synchronizations independently for each level.",
      "ja": "ポイントツーポイントインターフェイスでは、単一のIIH（両方のレベルのサポートを示す）のみが必要ですが、各レベルでCSNP同期を個別に実行する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.4. Database Synchronization",
      "section_title": true,
      "ja": "3.4. データベースの同期"
    },
    {
      "indent": 3,
      "text": "When a router is started or restarted, it can expect to receive a complete set of CSNPs over each interface. The arrival of the CSNP(s) is now guaranteed, since an IIH with the RR bit set will be retransmitted until the CSNP(s) are correctly received.",
      "ja": "ルータを起動または再起動すると、各インターフェイスを介してCSNPの完全なセットを受信することが期待されます。 CSNPが正しく受信されるまで、RRビットが設定されたIIHが再送信されるため、CSNPの到着が保証されます。"
    },
    {
      "indent": 3,
      "text": "The CSNPs describe the set of LSPs that are currently held by each neighbor. Synchronization will be complete when all these LSPs have been received.",
      "ja": "CSNPは、各ネイバーによって現在保持されているLSPのセットを記述します。 これらのLSPがすべて受信されると、同期が完了します。"
    },
    {
      "indent": 3,
      "text": "When (re)starting, a router starts an instance of timer T2 for each LSPDB, as described in Section 3.3.1 or Section 3.3.2. In addition to normal processing of the CSNPs, the set of LSPIDs contained in the first complete set of CSNPs received over each interface is recorded, together with their remaining lifetime. In the case of a LAN interface, a complete set of CSNPs MUST consist of CSNPs received from neighbors that are not restarting. If there are multiple interfaces on the (re)starting router, the recorded set of LSPIDs is the union of those received over each interface. LSPs with a remaining lifetime of zero are NOT so recorded.",
      "ja": "（再）起動すると、ルーターは、セクション3.3.1またはセクション3.3.2で説明されているように、LSPDBごとにタイマーT2のインスタンスを起動します。 CSNPの通常の処理に加えて、各インターフェイスを介して受信したCSNPの最初の完全なセットに含まれるLSPIDのセットが、残りのライフタイムとともに記録されます。 LANインターフェイスの場合、CSNPの完全なセットは、再起動していないネイバーから受信したCSNPで構成されている必要があります。 （再）起動ルータに複数のインターフェイスがある場合、LSPIDの記録されたセットは、各インターフェイスで受信したものの結合です。 残りのライフタイムがゼロのLSPは、それほど記録されません。"
    },
    {
      "indent": 3,
      "text": "As LSPs are received (by the normal operation of the update process) over any interface, the corresponding LSPID entry is removed (it is also removed if an LSP arrives before the CSNP containing the reference). When an LSPID has been held in the list for its indicated remaining lifetime, it is removed from the list. When the list of LSPIDs is empty and the timer T1 has been canceled for all the interfaces that have an adjacency at this level, the timer T2 is canceled.",
      "ja": "（更新プロセスの通常の操作によって）任意のインターフェイスでLSPが受信されると、対応するLSPIDエントリが削除されます（参照を含むCSNPの前にLSPが到着した場合も削除されます）。 LSPIDは、指定された残りのライフタイムの間リストに保持されると、リストから削除されます。 LSPIDのリストが空で、このレベルで隣接関係を持つすべてのインターフェイスのタイマーT1がキャンセルされた場合、タイマーT2はキャンセルされます。"
    },
    {
      "indent": 3,
      "text": "At this point, the local database is guaranteed to contain all the LSP(s) (either the same sequence number or a more recent sequence number) that were present in the neighbors' databases at the time of (re)starting. LSPs that arrived in a neighbor's database after the time of (re)starting may or may not be present, but the normal operation of the update process will guarantee that they will eventually be received. At this point, the local database is deemed to be \"synchronized\".",
      "ja": "この時点で、ローカルデータベースには、（再）起動時に近隣のデータベースに存在していたすべてのLSP（同じシーケンス番号またはより新しいシーケンス番号）が含まれることが保証されます。 （再）開始時刻の後にネイバーのデータベースに到着したLSPは存在する場合と存在しない場合がありますが、更新プロセスの通常の操作により、最終的に受信されることが保証されます。 この時点で、ローカルデータベースは「同期」されていると見なされます。"
    },
    {
      "indent": 3,
      "text": "Since LSPs mentioned in the CSNP(s) with a zero remaining lifetime are not recorded and those with a short remaining lifetime are deleted from the list when the lifetime expires, cancellation of the timer T2 will not be prevented by waiting for an LSP that will never arrive.",
      "ja": "残りのライフタイムがゼロのCSNPで言及されたLSPは記録されず、ライフタイムが期限切れになると残りのライフタイムが短いものはリストから削除されるため、タイマーT2のキャンセルはLSPを待つことで防止されません 到着しない。"
    },
    {
      "indent": 0,
      "text": "3.4.1. LSP Generation and Flooding and SPF Computation",
      "section_title": true,
      "ja": "3.4.1. LSP生成とフラッディングおよびSPF計算"
    },
    {
      "indent": 3,
      "text": "The operation of a router starting, as opposed to restarting, is somewhat different. These two cases are dealt with separately below.",
      "ja": "再起動とは対照的に、ルーターの起動操作は多少異なります。 これら2つのケースは、以下で個別に処理されます。"
    },
    {
      "indent": 0,
      "text": "3.4.1.1. Restarting",
      "section_title": true,
      "ja": "3.4.1.1. 再起動中"
    },
    {
      "indent": 3,
      "text": "In order to avoid causing unnecessary routing churn in other routers, it is highly desirable that the router's own LSPs generated by the restarting system are the same as those previously present in the network (assuming no other changes have taken place). It is important therefore not to regenerate and flood the LSPs until all the adjacencies have been reestablished and any information required for propagation into the local LSPs is fully available. Ideally, the information is loaded into the LSPs in a deterministic way, such that the same information occurs in the same place in the same LSP (and hence the LSPs are identical to their previous versions). If this can be achieved, the new versions may not even cause SPF to be run in other systems. However, provided the same information is included in the set of LSPs (albeit in a different order, and possibly different LSPs), the result of running the SPF will be the same and will not cause churn to the forwarding tables.",
      "ja": "他のルーターで不必要なルーティングチャーンが発生するのを避けるため、再起動システムによって生成されたルーター自身のLSPは、ネットワークに以前に存在していたものと同じであることが非常に望ましいです（他の変更が行われていないと仮定）。 したがって、すべての隣接関係が再確立され、ローカルLSPへの伝播に必要な情報が完全に利用可能になるまで、LSPを再生成およびフラッディングしないことが重要です。 理想的には、同じLSPの同じ場所で同じ情報が発生するように、LSPに確定的な方法で情報がロードされます（したがって、LSPは以前のバージョンと同一です）。 これを達成できる場合、新しいバージョンではSPFが他のシステムで実行されることさえありません。 ただし、LSPのセットに同じ情報が含まれている場合（順序が異なる場合やLSPが異なる場合もあります）、SPFを実行した結果は同じになり、転送テーブルにチャーンは発生しません。"
    },
    {
      "indent": 3,
      "text": "In the case of a restarting router, none of the router's own LSPs are transmitted, nor are the router's own forwarding tables updated while the timer T3 is running.",
      "ja": "再起動ルーターの場合、ルーター自身のLSPは送信されず、タイマーT3の実行中にルーター自身の転送テーブルも更新されません。"
    },
    {
      "indent": 3,
      "text": "Redistribution of inter-level information MUST be regenerated before this router's LSP is flooded to other nodes. Therefore, the Level-n non-pseudonode LSP(s) MUST NOT be flooded until the other level's T2 timer has expired and its SPF has been run. This ensures that any inter-level information that is to be propagated can be included in the Level-n LSP(s).",
      "ja": "このルーターのLSPが他のノードにフラッディングされる前に、レベル間情報の再配布を再生成する必要があります。 したがって、他のレベルのT2タイマーが期限切れになり、SPFが実行されるまで、レベルnの非擬似ノードLSPをフラッディングしてはなりません。 これにより、伝播されるレベル間情報をレベルn LSPに含めることができます。"
    },
    {
      "indent": 3,
      "text": "During this period, if one of the router's own (including pseudonodes) LSPs is received, which the local router does not currently have in its own database, it is NOT purged. Under normal operation, such an LSP would be purged, since the LSP clearly should not be present in the global LSP database. However, in the present circumstances, this would be highly undesirable, because it could cause premature removal of a router's own LSP -- and hence churn in remote routers. Even if the local system has one or more of the router's own LSPs (which it has generated but not yet transmitted), it is still not valid to compare the received LSP against this set, since it may be that as a result of propagation between Level 1 and Level 2 (or vice versa), a further router's own LSP will need to be generated when the LSP databases have synchronized.",
      "ja": "この期間中に、ルーター自身の（擬似ノードを含む）LSPの1つが受信された場合、ローカルルーターが自身のデータベースに現在持っていない場合、それはパージされません。 通常の操作では、LSPはグローバルLSPデータベースに存在してはならないので、そのようなLSPは削除されます。 ただし、現在の状況では、これは非常に望ましくありません。これは、ルーター自身のLSPが早期に削除される可能性があるため、リモートルーターでチャーンが発生する可能性があるためです。 ローカルシステムに1つ以上のルーター自身のLSP（生成されたがまだ送信されていない）がある場合でも、受信したLSPをこのセットと比較することはまだ有効ではありません。 レベル1およびレベル2（またはその逆）では、LSPデータベースが同期されたときに、さらにルーター独自のLSPを生成する必要があります。"
    },
    {
      "indent": 3,
      "text": "During this period, a restarting router SHOULD send CSNPs as it normally would. Information about the router's own LSPs MAY be included, but if it is included, it MUST be based on LSPs that have been received, not on versions that have been generated (but not yet transmitted). This restriction is necessary to prevent premature removal of an LSP from the global LSP database.",
      "ja": "この期間中、再起動するルーターは通常どおりCSNPを送信する必要があります。 ルーター自身のLSPに関する情報を含めることができますが、含まれる場合は、生成された（まだ送信されていない）バージョンではなく、受信されたLSPに基づいている必要があります。 この制限は、グローバルLSPデータベースからのLSPの早期削除を防ぐために必要です。"
    },
    {
      "indent": 3,
      "text": "When the timer T2 expires or is canceled, indicating that synchronization for that level is complete, the SPF for that level is run in order to derive any information that is required to be propagated to another level, but the forwarding tables are not yet updated.",
      "ja": "タイマーT2が期限切れになるかキャンセルされ、そのレベルの同期が完了したことを示すと、そのレベルのSPFが実行されて、別のレベルに伝播する必要がある情報が取得されますが、転送テーブルはまだ更新されていません。"
    },
    {
      "indent": 3,
      "text": "Once the other level's SPF has run and any inter-level propagation has been resolved, the router's own LSPs can be generated and flooded. Any own LSPs that were previously ignored, but that are not part of the current set of own LSPs (including pseudonodes), MUST then be purged. Note that it is possible that a Designated Router change may have taken place and, consequently, the router SHOULD purge those pseudonode LSPs that it previously owned but that are now no longer part of its set of pseudonode LSPs.",
      "ja": "他のレベルのSPFが実行され、レベル間の伝播が解決されると、ルーター自身のLSPが生成され、フラッディングされます。 以前は無視されていたが、自身のLSP（擬似ノードを含む）の現在のセットの一部ではない独自のLSPは、その後パージする必要があります。 指定ルーターの変更が行われた可能性があることに注意してください。その結果、ルーターは、以前は所有していたが現在は疑似ノードLSPのセットの一部ではない疑似ノードLSPをパージする必要があります。"
    },
    {
      "indent": 3,
      "text": "When all the T2 timers have expired or been canceled, the timer T3 is canceled, and the local forwarding tables are updated.",
      "ja": "すべてのT2タイマーが期限切れになるか取り消されると、タイマーT3が取り消され、ローカル転送テーブルが更新されます。"
    },
    {
      "indent": 3,
      "text": "If the timer T3 expires before all the T2 timers have expired or been canceled, this indicates that the synchronization process is taking longer than the minimum Holding Time of the neighbors. The router's own LSP(s) for levels that have not yet completed their first SPF computation are then flooded with the overload bit set to indicate that the router's LSPDB is not yet synchronized (and therefore other routers MUST NOT compute routes through this router). Normal operation of the update process resumes, and the local forwarding tables are updated. In order to prevent the neighbor's adjacencies from expiring, IIHs with the normal interface value for the Holding Time are transmitted over all interfaces with neither RR nor RA set in the Restart TLV. This will cause the neighbors to refresh their adjacencies. The router's own LSP(s) will continue to have the overload bit set until timer T2 has expired or been canceled.",
      "ja": "すべてのT2タイマーが期限切れになるか取り消される前にタイマーT3が期限切れになる場合、これは同期プロセスが近隣の最小保持時間よりも長くかかっていることを示します。 最初のSPF計算をまだ完了していないレベルのルーター自身のLSPは、その後、ルーターのLSPDBがまだ同期されていないことを示すために設定された過負荷ビットでフラッディングされます（したがって、他のルーターはこのルーターを介してルートを計算してはなりません）。 更新プロセスの通常の動作が再開され、ローカル転送テーブルが更新されます。 ネイバーの隣接が期限切れにならないようにするため、Restart TLVでRRもRAも設定されていないすべてのインターフェイスを介して、Holding Timeの通常のインターフェイス値を持つIIHが送信されます。 これにより、ネイバーは隣接関係を更新します。 ルーターT2は、タイマーT2が期限切れになるかキャンセルされるまで、過負荷ビットを設定し続けます。"
    },
    {
      "indent": 0,
      "text": "3.4.1.2. Starting",
      "section_title": true,
      "ja": "3.4.1.2. 起動"
    },
    {
      "indent": 3,
      "text": "In the case of a starting router, as soon as each adjacency is established, and before any CSNP exchanges, the router's own zeroth LSP is transmitted with the overload bit set. This prevents other routers from computing routes through the router until it has reliably acquired the complete set of LSPs. The overload bit remains set in subsequent transmissions of the zeroth LSP (such as will occur if a previous copy of the router's own zeroth LSP is still present in the network) while any timer T2 is running.",
      "ja": "開始ルータの場合、各隣接関係が確立されるとすぐに、CSNPが交換される前に、ルータ自身のゼロ番目のLSPが過負荷ビットが設定されて送信されます。 これにより、LSPの完全なセットを確実に取得するまで、他のルーターがルーターを経由するルートを計算できなくなります。 タイマーT2が実行されている間、0番目のLSPの後続の送信で過負荷ビットが設定されたままになります（ルーター自身の0番目のLSPの以前のコピーがまだネットワークに存在する場合など）。"
    },
    {
      "indent": 3,
      "text": "When all the T2 timers have been canceled, the router's own LSP(s) MAY be regenerated with the overload bit clear (assuming the router is not in fact overloaded, and there is no other reason, such as incomplete BGP convergence, to keep the overload bit set) and flooded as normal.",
      "ja": "すべてのT2タイマーがキャンセルされると、過負荷ビットがクリアされた状態でルーター自身のLSPが再生成される場合があります（ルーターが実際に過負荷ではなく、BGPコンバージェンスが不完全であるなど、他の理由がない場合） 過負荷ビットが設定された）、通常どおりフラッディングされます。"
    },
    {
      "indent": 3,
      "text": "Other LSPs owned by this router (including pseudonodes) are generated and flooded as normal, irrespective of the timer T2. The SPF is also run as normal and the Routing Information Base (RIB) and Forwarding Information Base (FIB) updated as routes become available.",
      "ja": "このルーターが所有する他のLSP（擬似ノードを含む）は、タイマーT2に関係なく、通常どおり生成およびフラッディングされます。 SPFも通常どおり実行され、ルーティング情報ベース（RIB）および転送情報ベース（FIB）は、ルートが使用可能になると更新されます。"
    },
    {
      "indent": 3,
      "text": "To avoid the possible formation of temporary blackholes, the starting router sets the SA bit in the Restart TLV (as described in Section 3.3.2) in all IIHs that it sends.",
      "ja": "一時的なブラックホールの形成を回避するために、開始ルーターは、送信するすべてのIIHの再起動TLV（セクション3.3.2で説明）にSAビットを設定します。"
    },
    {
      "indent": 3,
      "text": "When all T2 timers have been canceled, the starting router MUST transmit IIHs with the SA bit clear.",
      "ja": "すべてのT2タイマーがキャンセルされると、開始ルーターはSAビットがクリアされたIIHを送信しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. State Tables",
      "section_title": true,
      "ja": "4. 状態テーブル"
    },
    {
      "indent": 3,
      "text": "This section presents state tables that summarize the behaviors described in this document. Other behaviors, in particular adjacency state transitions and LSP database update operations, are NOT included in the state tables except where this document modifies the behaviors described in [ISO10589] and [RFC5303].",
      "ja": "このセクションでは、このドキュメントで説明する動作を要約した状態表を示します。 このドキュメントが[ISO10589]および[RFC5303]で説明されている動作を変更する場合を除き、他の動作、特に隣接状態の遷移とLSPデータベースの更新操作は状態テーブルに含まれません。"
    },
    {
      "indent": 3,
      "text": "The states named in the columns of the tables below are a mixture of states that are specific to a single adjacency (ADJ suppressed, ADJ Seen RA, ADJ Seen CSNP) and states that are indicative of the state of the protocol instance (Running, Restarting, Starting, SPF Wait).",
      "ja": "以下の表の列で名前が付けられている状態は、単一の隣接に固有の状態（ADJ抑制、ADJ表示RA、ADJ表示CSNP）と、プロトコルインスタンスの状態を示す状態（実行中、再起動中）の混合です。 、開始、SPF待機）。"
    },
    {
      "indent": 3,
      "text": "Three state tables are presented from the point of view of a running router, a restarting router, and a starting router.",
      "ja": "実行中のルーター、再起動中のルーター、および起動中のルーターの観点から、3つの状態テーブルが提示されます。"
    },
    {
      "indent": 0,
      "text": "4.1. Running Router",
      "section_title": true,
      "ja": "4.1. 実行中のルーター"
    },
    {
      "indent": 3,
      "text": "+--------+-------------------------------------------+--------------+\n| Event  | Running                                   | ADJ          |\n|        |                                           | suppressed   |\n+========+===========================================+==============+\n| RX PR  | Set Planned Restart State                 |              |\n|        | Update Holding Time                       |              |\n|        | Send PA                                   |              |\n+--------+-------------------------------------------+--------------+\n| RX PR  | Clear Planned Restart State               |              |\n| clr    | Restore Holding Time to local value       |              |\n| and RR |                                           |              |\n| clr    |                                           |              |\n+--------+-------------------------------------------+--------------+\n| RX RR  | Maintain ADJ State                        |              |\n|        | Send RA                                   |              |\n|        | Set SRM, send CSNP (Note 1)               |              |\n|        | Update Holding Time,                      |              |\n|        | set Restart Mode (Note 2)                 |              |\n+--------+-------------------------------------------+--------------+\n| RX RR  | Clr Restart mode                          |              |\n| clr    |                                           |              |\n+--------+-------------------------------------------+--------------+\n| RX SA  | Suppress IS neighbor TLV in LSP(s)        |              |\n|        | Goto ADJ Suppressed                       |              |\n+--------+-------------------------------------------+--------------+\n| RX SA  |                                           | Unsuppress   |\n| clr    |                                           | IS neighbor  |\n|        |                                           | TLV in       |\n|        |                                           | LSP(s)       |\n|        |                                           | Goto Running |\n+--------+-------------------------------------------+--------------+",
      "raw": true
    },
    {
      "indent": 26,
      "text": "Table 1: Running Router",
      "ja": "表1：実行中のルーター"
    },
    {
      "indent": 3,
      "text": "Note 1: CSNPs are sent by routers in accordance with item c in Section 3.2.1",
      "ja": "注1：CSNPは、セクション3.2.1の項目cに従ってルーターによって送信されます"
    },
    {
      "indent": 3,
      "text": "Note 2: If Restart Mode clear",
      "ja": "注2：再起動モードがクリアの場合"
    },
    {
      "indent": 0,
      "text": "4.2. Restarting Router",
      "section_title": true,
      "ja": "4.2. ルーターの再起動"
    },
    {
      "indent": 3,
      "text": "+----------+-----------------+---------+---------+------------------+\n| Event    | Restarting      | ADJ     | ADJ     | SPF Wait         |\n|          |                 | Seen RA | Seen    |                  |\n|          |                 |         | CSNP    |                  |\n+==========+=================+=========+=========+==================+\n| Restart  | Send PR         |         |         |                  |\n| planned  |                 |         |         |                  |\n+----------+-----------------+---------+---------+------------------+\n| Planned  | Send PR clr     |         |         |                  |\n| restart  |                 |         |         |                  |\n| canceled |                 |         |         |                  |\n+----------+-----------------+---------+---------+------------------+\n| RX PA    | Proceed with    |         |         |                  |\n|          | planned restart |         |         |                  |\n+----------+-----------------+---------+---------+------------------+\n| Router   | Send IIH/RR     |         |         |                  |\n| restarts | ADJ Init        |         |         |                  |\n|          | Start T1, T2,   |         |         |                  |\n|          | T3              |         |         |                  |\n+----------+-----------------+---------+---------+------------------+\n| RX RR    | Send RA         |         |         |                  |\n+----------+-----------------+---------+---------+------------------+\n| RX RA    | Adjust T3       |         | Cancel  |                  |\n|          | Goto ADJ Seen   |         | T1      |                  |\n|          | RA              |         | Adjust  |                  |\n|          |                 |         | T3      |                  |\n+----------+-----------------+---------+---------+------------------+\n| RX CSNP  | Goto ADJ Seen   | Cancel  |         |                  |\n| set      | CSNP            | T1      |         |                  |\n+----------+-----------------+---------+---------+------------------+\n| RX IIH   | Cancel T1       |         |         |                  |\n| w/o      | (Point-to-point |         |         |                  |\n| Restart  | only)           |         |         |                  |\n| TLV      |                 |         |         |                  |\n+----------+-----------------+---------+---------+------------------+\n| T1       | Send IIH/RR     | Send    | Send    |                  |\n| expires  | Restart T1      | IIH/RR  | IIH/RR  |                  |\n|          |                 | Restart | Restart |                  |\n|          |                 | T1      | T1      |                  |\n+----------+-----------------+---------+---------+------------------+\n| T1       | Send IIH/normal | Send    | Send    |                  |\n| expires  |                 | IIH/    | IIH/    |                  |\n| nth time |                 | normal  | normal  |                  |\n+----------+-----------------+---------+---------+------------------+\n| T2       | Trigger SPF     |         |         |                  |\n| expires  | Goto SPF Wait   |         |         |                  |\n+----------+-----------------+---------+---------+------------------+\n| T3       | Set overload    |         |         |                  |\n| expires  | bit             |         |         |                  |\n|          | Flood local     |         |         |                  |\n|          | LSPs            |         |         |                  |\n|          | Update fwd      |         |         |                  |\n|          | plane           |         |         |                  |\n+----------+-----------------+---------+---------+------------------+\n| LSP DB   | Cancel T2 and   |         |         |                  |\n| Sync     | T3              |         |         |                  |\n|          | Trigger SPF     |         |         |                  |\n|          | Goto SPF wait   |         |         |                  |\n+----------+-----------------+---------+---------+------------------+\n| All SPF  |                 |         |         | Clear overload   |\n| done     |                 |         |         | bit              |\n|          |                 |         |         | Update fwd       |\n|          |                 |         |         | plane            |\n|          |                 |         |         | Flood local      |\n|          |                 |         |         | LSPs             |\n|          |                 |         |         | Goto Running     |\n+----------+-----------------+---------+---------+------------------+",
      "raw": true
    },
    {
      "indent": 25,
      "text": "Table 2: Restarting Router",
      "ja": "表2：ルーターの再起動"
    },
    {
      "indent": 0,
      "text": "4.3. Starting Router",
      "section_title": true,
      "ja": "4.3. ルーターの起動"
    },
    {
      "indent": 3,
      "text": "+-------------+---------------------------+------------+------------+\n| Event       | Starting                  | ADJ Seen   | ADJ Seen   |\n|             |                           | RA         | CSNP       |\n+=============+===========================+============+============+\n| Router      | Send IIH/SA               |            |            |\n| starts      | Start T1 and T2           |            |            |\n+-------------+---------------------------+------------+------------+\n| RX RR       | Send RA                   |            |            |\n+-------------+---------------------------+------------+------------+\n| RX RA       | Goto ADJ Seen RA          |            | Cancel T1  |\n+-------------+---------------------------+------------+------------+\n| RX CSNP Set | Goto ADJ Seen CSNP        | Cancel T1  |            |\n+-------------+---------------------------+------------+------------+\n| RX IIH w no | Cancel T1 (Point-to-      |            |            |\n| Restart TLV | Point only)               |            |            |\n+-------------+---------------------------+------------+------------+\n| ADJ UP      | Start T1                  |            |            |\n|             | Send local LSPs with      |            |            |\n|             | overload bit set          |            |            |\n+-------------+---------------------------+------------+------------+\n| T1 expires  | Send IIH/RR and SA        | Send IIH/  | Send IIH/  |\n|             | Restart T1                | RR and SA  | RR and SA  |\n|             |                           | Restart T1 | Restart T1 |\n+-------------+---------------------------+------------+------------+\n| T1 expires  | Send IIH/SA               | Send IIH/  | Send IIH/  |\n| nth time    |                           | SA         | SA         |\n+-------------+---------------------------+------------+------------+\n| T2 expires  | Clear overload bit        |            |            |\n|             | Send IIH normal           |            |            |\n|             | Goto Running              |            |            |\n+-------------+---------------------------+------------+------------+\n| LSP DB Sync | Cancel T2                 |            |            |\n|             | Clear overload bit        |            |            |\n|             | Send IIH normal           |            |            |\n+-------------+---------------------------+------------+------------+",
      "raw": true
    },
    {
      "indent": 26,
      "text": "Table 3: Starting Router",
      "ja": "表3：ルーターの起動"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines the following IS-IS TLV that is listed in the \"IS-IS TLV Codepoints\" registry.",
      "ja": "このドキュメントでは、「IS-IS TLV Codepoints」レジストリにリストされている次のIS-IS TLVを定義しています。"
    },
    {
      "indent": 3,
      "text": "+------+-------------+-----+-----+-----+-------+\n| Type | Description | IIH | LSP | SNP | Purge |\n+======+=============+=====+=====+=====+=======+\n| 211  | Restart TLV | y   | n   | n   | n     |\n+------+-------------+-----+-----+-----+-------+",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Table 4",
      "ja": "表4"
    },
    {
      "indent": 3,
      "text": "IANA has updated the entry in registry to point to this document.",
      "ja": "IANAは、このドキュメントを指すようにレジストリのエントリを更新しました。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Any new security issues raised by the procedures in this document depend upon the ability of an attacker to inject a false but apparently valid IIH, the ease/difficulty of which has not been altered.",
      "ja": "このドキュメントの手順で発生する新しいセキュリティ問題は、攻撃者が偽物ではあるが明らかに有効なIIHを挿入する能力に依存します。"
    },
    {
      "indent": 3,
      "text": "If the RR bit is set in a false IIH, neighbors who receive such an IIH will continue to maintain an existing adjacency in the UP state and may (re)send a complete set of CSNPs. While the latter action is wasteful, neither action causes any disruption in correct protocol operation.",
      "ja": "RRビットが偽のIIHに設定されている場合、そのようなIIHを受信するネイバーは、UP状態で既存の隣接関係を維持し続け、CSNPの完全なセットを（再）送信できます。 後者のアクションは無駄ですが、どちらのアクションも正しいプロトコル操作の中断を引き起こしません。"
    },
    {
      "indent": 3,
      "text": "If the RA bit is set in a false IIH, a (re)starting router that receives such an IIH may falsely believe that there is a neighbor on the corresponding interface that supports the procedures described in this document. In the absence of receipt of a complete set of CSNPs on that interface, this could delay the completion of (re)start procedures by requiring the timer T1 to time out the locally defined maximum number of retries. This behavior is the same as would occur on a LAN where none of the (re)starting router's neighbors support the procedures in this document and is covered in Sections 3.3.1 and 3.3.2.",
      "ja": "RAビットが偽のIIHに設定されている場合、そのようなIIHを受信する（再）開始ルーターは、このドキュメントで説明されている手順をサポートする対応するインターフェイスに近隣があると誤って信じることがあります。 そのインターフェイスでCSNPの完全なセットが受信されない場合、タイマーT1がローカルに定義された最大再試行回数をタイムアウトすることを要求することにより、（再）開始手順の完了を遅らせる可能性があります。 この動作は、このドキュメントの手順をサポートする（再）開始ルーターの近隣がないLANで発生するものと同じであり、セクション3.3.1および3.3.2で説明されています。"
    },
    {
      "indent": 3,
      "text": "If the SA bit is set in a false IIH, this could cause suppression of the advertisement of an IS neighbor, which could either continue for an indefinite period or occur intermittently with the result being a possible loss of reachability to some destinations in the network and/or increased frequency of LSP flooding and SPF calculation.",
      "ja": "SAビットが偽のIIHに設定されている場合、これによりISネイバーのアドバタイズメントが抑制され、無期限に継続するか、断続的に発生して、ネットワーク内の一部の宛先への到達可能性が失われる可能性があり、 /またはLSPフラッディングとSPF計算の頻度を増やしました。"
    },
    {
      "indent": 3,
      "text": "If the PR bit is set in a false IIH, neighbors who receive such an IIH could modify the Holding Time of an existing adjacency inappropriately. In the event of topology changes, the neighbor might also choose to not flood the topology updates and/or bring the adjacency down in the false belief that the forwarding plane of the router identified as the source of the false IIH is not currently processing announced topology changes. This would result in unnecessary forwarding disruption.",
      "ja": "PRビットが偽のIIHに設定されている場合、そのようなIIHを受信するネイバーは、既存の隣接の保持時間を不適切に変更する可能性があります。 トポロジが変更された場合、ネイバーはトポロジの更新をフラッディングしないこと、および/または偽のIIHのソースとして識別されたルータの転送プレーンが現在アナウンスされたトポロジを処理していないという誤った信念で隣接をダウンさせることも選択できます 変更。 これにより、不必要な転送の中断が発生します。"
    },
    {
      "indent": 3,
      "text": "If the PA bit is set in a false IIH, a router that receives such an IIH may falsely believe that the neighbor on the corresponding interface supports the planned restart procedures defined in this document. If such a router is planning to restart, it might then proceed to initiate a restart in the false expectation that the neighbor has updated its Holding Time as requested. This may result in the neighbor bringing down the adjacency while the receiving router is restarting, causing unnecessary disruption to forwarding.",
      "ja": "PAビットが偽のIIHに設定されている場合、そのようなIIHを受信するルータは、対応するインターフェイスのネイバーがこのドキュメントで定義されている計画的な再起動手順をサポートしていると誤って信じることがあります。 そのようなルーターが再起動を計画している場合、要求に応じて近隣が保持時間を更新したという誤った期待で再起動を開始する可能性があります。 これにより、受信ルータの再起動中にネイバーが隣接関係を停止し、転送が不必要に中断される可能性があります。"
    },
    {
      "indent": 3,
      "text": "The possibility of IS-IS PDU spoofing can be reduced by the use of authentication, as described in [RFC1195] and [ISO10589], and especially by the use of cryptographic authentication, as described in [RFC5304] and [RFC5310].",
      "ja": "IS-IS PDUスプーフィングの可能性は、[RFC1195]および[ISO10589]で説明されている認証の使用によって、特に[RFC5304]および[RFC5310]で説明されている暗号認証の使用によって低減できます。"
    },
    {
      "indent": 0,
      "text": "7. Manageability Considerations",
      "section_title": true,
      "ja": "7. 管理性に関する考慮事項"
    },
    {
      "indent": 3,
      "text": "These extensions that have been designed, developed, and deployed for many years do not have any new impact on management and operation of the IS-IS protocol via this standardization process.",
      "ja": "長年にわたって設計、開発、展開されてきたこれらの拡張機能は、この標準化プロセスによるIS-ISプロトコルの管理と運用に新たな影響を与えません。"
    },
    {
      "indent": 0,
      "text": "8. Normative References",
      "section_title": true,
      "ja": "8. 引用文献"
    },
    {
      "indent": 3,
      "text": "[ISO10589] International Organization for Standardization, \"Information technology -- Telecommunications and information exchange between systems -- Intermediate System to Intermediate System intra-domain routeing information exchange protocol for use in conjunction with the protocol for providing the connectionless-mode network service (ISO 8473)\", ISO/IEC 10589:2002, Second Edition, November 2002.",
      "ja": "[ISO10589]国際標準化機構、「情報技術-システム間のテレコミュニケーションおよび情報交換-コネクションレスモードネットワークサービス（ISOを提供するためのプロトコルと併用するための中間システムから中間システムへのドメイン内ルーティング情報交換プロトコル 8473）」、ISO / IEC 10589：2002、第2版、2002年11月。"
    },
    {
      "indent": 3,
      "text": "[RFC1195] Callon, R., \"Use of OSI IS-IS for routing in TCP/IP and dual environments\", RFC 1195, DOI 10.17487/RFC1195, December 1990, <https://www.rfc-editor.org/info/rfc1195>.",
      "ja": "[RFC1195] Callon、R。、「TCP / IPおよびデュアル環境でのルーティングのためのOSI IS-ISの使用」、RFC 1195、DOI 10.17487 / RFC1195、1990年12月、<https://www.rfc-editor.org/ info / rfc1195>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S.、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC5303] Katz, D., Saluja, R., and D. Eastlake 3rd, \"Three-Way Handshake for IS-IS Point-to-Point Adjacencies\", RFC 5303, DOI 10.17487/RFC5303, October 2008, <https://www.rfc-editor.org/info/rfc5303>.",
      "ja": "[RFC5303] Katz、D.、Saluja、R。、およびD. Eastlake 3rd、「IS-ISポイントツーポイント隣接の3方向ハンドシェイク」、RFC 5303、DOI 10.17487 / RFC5303、2008年10月、<https： //www.rfc-editor.org/info/rfc5303>。"
    },
    {
      "indent": 3,
      "text": "[RFC5304] Li, T. and R. Atkinson, \"IS-IS Cryptographic Authentication\", RFC 5304, DOI 10.17487/RFC5304, October 2008, <https://www.rfc-editor.org/info/rfc5304>.",
      "ja": "[RFC5304] Li、T。、およびR. Atkinson、「IS-IS暗号認証」、RFC 5304、DOI 10.17487 / RFC5304、2008年10月、<https://www.rfc-editor.org/info/rfc5304>。"
    },
    {
      "indent": 3,
      "text": "[RFC5310] Bhatia, M., Manral, V., Li, T., Atkinson, R., White, R., and M. Fanto, \"IS-IS Generic Cryptographic Authentication\", RFC 5310, DOI 10.17487/RFC5310, February 2009, <https://www.rfc-editor.org/info/rfc5310>.",
      "ja": "[RFC5310] Bhatia、M.、Manral、V.、Li、T.、Atkinson、R.、White、R。、およびM. Fanto、「IS-IS Generic Cryptographic Authentication」、RFC 5310、DOI 10.17487 / RFC5310、 2009年2月、<https://www.rfc-editor.org/info/rfc5310>。"
    },
    {
      "indent": 3,
      "text": "[RFC5880] Katz, D. and D. Ward, \"Bidirectional Forwarding Detection (BFD)\", RFC 5880, DOI 10.17487/RFC5880, June 2010, <https://www.rfc-editor.org/info/rfc5880>.",
      "ja": "[RFC5880] Katz、D.およびD. Ward、「双方向転送検出（BFD）」、RFC 5880、DOI 10.17487 / RFC5880、2010年6月、<https://www.rfc-editor.org/info/rfc5880>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Summary of Changes from RFC 5306",
      "section_title": true,
      "ja": "付録A.RFC 5306からの変更の要約"
    },
    {
      "indent": 3,
      "text": "This document extends RFC 5306 by introducing support for signaling the neighbors of a restarting router that a planned restart is about to occur. This allows the neighbors to be aware of the state of the restarting router so that appropriate action may be taken if other topology changes occur while the planned restart is in progress. Since the forwarding plane of the restarting router is maintained based upon the pre-restart state of the network, additional topology changes introduce the possibility that traffic may be lost if paths via the restarting router continue to be used while the restart is in progress.",
      "ja": "このドキュメントは、計画された再起動が発生することを再起動するルーターの近隣に信号を送るサポートを導入することにより、RFC 5306を拡張します。 これにより、隣接ルータは再起動ルータの状態を認識できるため、計画的な再起動の進行中に他のトポロジの変更が発生した場合に適切なアクションを実行できます。 再起動ルーターの転送プレーンはネットワークの再起動前の状態に基づいて維持されるため、追加のトポロジ変更により、再起動の進行中に再起動ルーターを介したパスが引き続き使用される場合、トラフィックが失われる可能性があります。"
    },
    {
      "indent": 3,
      "text": "In support of this new functionality, two new flags have been introduced:",
      "ja": "この新しい機能をサポートするために、2つの新しいフラグが導入されました。"
    },
    {
      "indent": 3,
      "text": "PR - Restart is planned",
      "ja": "PR-再起動が計画されています"
    },
    {
      "indent": 3,
      "text": "PA - Planned restart acknowledgement",
      "ja": "PA-計画的な再起動確認"
    },
    {
      "indent": 3,
      "text": "No changes to the post-restart exchange between the restarting router and its neighbors have been introduced.",
      "ja": "再起動中のルーターとその近隣との間の再起動後の交換に対する変更は導入されていません。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "For RFC 5306, the authors acknowledged contributions made by Jeff Parker, Radia Perlman, Mark Schaefer, Naiming Shen, Nischal Sheth, Russ White, and Rena Yang.",
      "ja": "RFC 5306について、著者は、Jeff Parker、Radia Perlman、Mark Schaefer、Naiming Shen、Nischal Sheth、Russ White、およびRena Yangの貢献を認めました。"
    },
    {
      "indent": 3,
      "text": "The authors of this updated document acknowledge the contribution of Mike Shand, coauthor of RFC 5306.",
      "ja": "この更新されたドキュメントの著者は、RFC 5306の共著者であるMike Shandの貢献を認めています。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Les Ginsberg Cisco Systems, Inc.",
      "ja": "Les Ginsberg Cisco Systems、Inc."
    },
    {
      "indent": 3,
      "text": "Email: ginsberg@cisco.com",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Paul Wells Cisco Systems, Inc.",
      "ja": "ポールウェルズシスコシステムズ"
    },
    {
      "indent": 3,
      "text": "Email: pauwells@cisco.com",
      "raw": true
    }
  ]
}