{
  "title": {
    "text": "RFC 8355 - Resiliency Use Cases in Source Packet Routing in Networking (SPRING) Networks",
    "ja": "RFC 8355 - ネットワーキング（SPRING）ネットワークにおけるソースパケットルーティングにおける復元力のユースケース"
  },
  "number": 8355,
  "created_at": "2019-10-30 16:40:23.700255+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                  C. Filsfils, Ed.\nRequest for Comments: 8355                               S. Previdi, Ed.\nCategory: Informational                              Cisco Systems, Inc.\nISSN: 2070-1721                                              B. Decraene\n                                                                  Orange\n                                                               R. Shakir\n                                                                  Google\n                                                              March 2018",
      "raw": true
    },
    {
      "indent": 8,
      "text": "                  Resiliency Use Cases\nin Source Packet Routing in Networking (SPRING) Networks",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document identifies and describes the requirements for a set of use cases related to Segment Routing network resiliency on Source Packet Routing in Networking (SPRING) networks.",
      "ja": "このドキュメントを識別し、ネットワークにおけるソースパケットルーティング上のセグメントのルーティングネットワークの耐障害性（SPRING）ネットワークに関連するユースケースのセットのための要件について説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書はインターネットStandardのどんなレベルの候補です。 RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8355.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttps://www.rfc-editor.org/info/rfc8355で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2018 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2018 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（https://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  Requirements Language . . . . . . . . . . . . . . . . . .   4\n2.  Path Protection . . . . . . . . . . . . . . . . . . . . . . .   4\n3.  Management-Free Local Protection  . . . . . . . . . . . . . .   6\n  3.1.  Management-Free Bypass Protection . . . . . . . . . . . .   7\n  3.2.  Management-Free Shortest-Path-Based Protection  . . . . .   8\n4.  Managed Local Protection  . . . . . . . . . . . . . . . . . .   8\n  4.1.  Managed Bypass Protection . . . . . . . . . . . . . . . .   9\n  4.2.  Managed Shortest Path Protection  . . . . . . . . . . . .   9\n5.  Loop Avoidance  . . . . . . . . . . . . . . . . . . . . . . .  10\n6.  Coexistence of Multiple Resilience Techniques in the Same\n    Infrastructure  . . . . . . . . . . . . . . . . . . . . . . .  10\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .  11\n8.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  11\n9.  Manageability Considerations  . . . . . . . . . . . . . . . .  11\n10. References  . . . . . . . . . . . . . . . . . . . . . . . . .  12\n  10.1.  Normative References . . . . . . . . . . . . . . . . . .  12\n  10.2.  Informative References . . . . . . . . . . . . . . . . .  12\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  12\nContributors  . . . . . . . . . . . . . . . . . . . . . . . . . .  12\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  13",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document reviews various use cases for the protection of services in a SPRING network. The terminology used hereafter is in line with [RFC5286] and [RFC5714].",
      "ja": "この文書では、SPRINGネットワ​​ークにおけるサービスの保護のために、様々なユースケースをレビュー。以下で使用される用語は、[RFC5286]及び[RFC5714]に沿ったものです。"
    },
    {
      "indent": 3,
      "text": "The resiliency use cases described in this document can be applied not only to traffic that is forwarded according to the SPRING architecture, but also to traffic that originally is forwarded using other paradigms such as LDP signaling or pure IP traffic (IP-routed traffic).",
      "ja": "この文書に記載さ弾力のユースケースは、SPRINGアーキテクチャに従って転送されたトラフィックに対してだけでなく、本来、このようなLDPシグナリングまたは純粋なIPトラフィック（IPルーティングトラフィック）のような他のパラダイムを使用して転送されるトラフィックにも適用することができます。"
    },
    {
      "indent": 3,
      "text": "Three key alternatives are described: path protection, local protection without operator management, and local protection with operator management.",
      "ja": "3つの主要な選択肢が記載されている：パス保護、オペレータ管理なしのローカル保護、およびオペレータの管理と地元の保護を。"
    },
    {
      "indent": 3,
      "text": "Path protection lets the ingress node be in charge of the failure recovery, as discussed in Section 2.",
      "ja": "パスの保護は、第2節で述べたように、入口ノードが、障害復旧を担当することができます。"
    },
    {
      "indent": 3,
      "text": "The rest of the document focuses on approaches where protection is performed by the node adjacent to the failed component, commonly referred to as local protection techniques or fast-reroute techniques [RFC5286] [RFC5714].",
      "ja": "文書の残りの部分は、保護が失敗したコンポーネントに隣接するノードによって実行されるアプローチに焦点を当て、一般的にローカル保護技術または高速リルート技術[RFC5286]、[RFC5714]と呼びます。"
    },
    {
      "indent": 3,
      "text": "In Section 3, we discuss two different approaches providing unmanaged local protection, namely link/node bypass protection and shortest-path-based protection.",
      "ja": "第3節では、管理されていない地元の保護を提供する2つの異なるアプローチ、すなわち、リンク/ノードバイパス保護と最短パスベースの保護を議論します。"
    },
    {
      "indent": 3,
      "text": "Section 4 illustrates a case allowing the operator to manage the local protection behavior in order to accommodate specific policies.",
      "ja": "第4章では、オペレータが特定のポリシーに対応するために、地元の保護動作を管理できるようにする場合を示しています。"
    },
    {
      "indent": 3,
      "text": "In Section 5, we discuss the opportunity for the SPRING architecture to provide loop-avoidance mechanisms such that transient forwarding state inconsistencies during routing convergence do not lead into traffic loss.",
      "ja": "第5節では、SPRINGアーキテクチャは、ルーティング、収束時の過渡転送状態の不整合がトラフィック損失につながらないようなループ回避メカニズムを提供する機会を議論します。"
    },
    {
      "indent": 3,
      "text": "The purpose of this document is to illustrate the different use cases and explain how an operator could combine them in the same network (see Section 6). Solutions are not defined in this document.",
      "ja": "このドキュメントの目的は、異なるユースケースを例示し、オペレータが同じネットワーク内にそれらを組み合わせることができるか説明することである（第6節を参照してください）。ソリューションは、このドキュメントで定義されていません。"
    },
    {
      "indent": 23,
      "text": "   B------C------D------E\n  /|      | \\  / | \\  / |\\\n / |      |  \\/  |  \\/  | \\\nA  |      |  /\\  |  /\\  |  Z\n \\ |      | /  \\ | /  \\ | /\n  \\|      |/    \\|/    \\|/\n   F------G------H------I",
      "raw": true
    },
    {
      "indent": 23,
      "text": "Figure 1: Reference Topology",
      "ja": "図1：リファレンストポロジ"
    },
    {
      "indent": 3,
      "text": "We use Figure 1 as a reference topology throughout the document. The following link metrics are applied:",
      "ja": "私たちは、文書全体の参照トポロジとして図1を使用します。以下のリンクメトリックが適用されます。"
    },
    {
      "indent": 3,
      "text": "o Links from/to A and Z are configured with a metric of 100.",
      "ja": "A及びZへ/からOリンク100のメトリックを使用して構成されています。"
    },
    {
      "indent": 3,
      "text": "o CH, GD, DI, and HE links are configured with a metric of 6.",
      "ja": "CH O、GD、DI、およびHEリンク6のメトリックを使用して構成されています。"
    },
    {
      "indent": 3,
      "text": "o All other links are configured with a metric of 5.",
      "ja": "O他のすべてのリンクは5のメトリックを使用して構成されています。"
    },
    {
      "indent": 3,
      "text": "Note: Link metrics are bidirectional; in other words, the same metric value is configured at both sides of each link.",
      "ja": "注意：リンクメトリックは双方向です。換言すれば、同じメトリック値は、各リンクの両側に構成されています。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "ja": "1.1。要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、 \"推奨NOT\"、および「OPTIONAL BCP 14に記載されているように「この文書に解釈されるべきである[RFC2119]、[RFC8174]と、ここで示されるように、それらは、すべて大文字で表示された場合にのみ。"
    },
    {
      "indent": 0,
      "text": "2. Path Protection",
      "section_title": true,
      "ja": "2.パス保護"
    },
    {
      "indent": 3,
      "text": "As a reminder, one of the major network operator requirements is path disjointness capability. Network operators have deployed infrastructures with topologies that allow paths to be computed in a complete disjoint fashion where two paths wouldn't share any component (link or router), hence allowing an optimal protection strategy.",
      "ja": "念のため、主要なネットワーク事業者の要件の一つは、パス互いに素機能です。ネットワークオペレータは、パスは2つのパスが故に、最適な保護戦略を可能にする、任意のコンポーネント（リンクまたはルータ）を共有しないであろう完全互いに素な方法で計算することを可能にするトポロジとインフラストラクチャを展開しています。"
    },
    {
      "indent": 3,
      "text": "A first protection strategy consists of excluding any local repair and instead uses end-to-end path protection where each SPRING path is protected by a second disjoint SPRING path. In this case, local protection is not used along the path.",
      "ja": "第1の保護戦略は、任意のローカル修復を除いで構成され、代わりに各ばね経路が第二ばらばらSPRINGパスによって保護され、エンドツーエンドのパス保護を使用します。この場合、ローカルの保護は、パスに沿って使用されていません。"
    },
    {
      "indent": 3,
      "text": "For example, a pseudowire (PW) from A to Z can be \"path protected\" in the direction A to Z in the following manner: the operator configures two SPRING paths, T1 (primary) and T2 (backup), from A to Z.",
      "ja": "Zまで、オペレータは、2つのスプリング経路を構成、T1（プライマリ）とT2（バックアップ）：たとえば、AからZまでの疑似回線（PW）は、「パス保護」は、以下のようにしてZに方向Aにあることができます。"
    },
    {
      "indent": 3,
      "text": "The two paths may be used:",
      "ja": "2つの経路が使用されてもよいです。"
    },
    {
      "indent": 3,
      "text": "o concurrently, where the ingress router sends the same traffic over the primary and secondary path (this is usually known as 1+1 protection);",
      "ja": "O同時に、入口ルータは、プライマリおよびセカンダリパス上同一のトラフィックを（これは通常、1つの+ 1保護として知られている）を送信する場合。"
    },
    {
      "indent": 3,
      "text": "o concurrently, where the ingress router splits the traffic over the primary and secondary path (this is usually known as Equal-Cost Multipath (ECMP) or Unequal-Cost Multipath (UCMP)); or",
      "ja": "O入口ルータは、プライマリおよびセカンダリパス上のトラフィックを分割し、同時に、ここで（これは通常、等価コストマルチパス（ECMP）または不等コストマルチパス（UCMP）として知られています）。または"
    },
    {
      "indent": 3,
      "text": "o as a primary and backup path, where the secondary path is used only when the primary failed (this is usually known as 1:1 protection).",
      "ja": "一次（1：1保護これは通常1として知られている）が失敗した場合にのみ、セカンダリパスが使用されるプライマリとバックアップパスとして、O。"
    },
    {
      "indent": 3,
      "text": "T1 is established over path {AB, BC, CD, DE, EZ} as the primary path, and T2 is established over path {AF, FG, GH, HI, IZ} as the backup path. The two paths MUST be disjoint in their links, nodes, and Shared Risk Link Groups (SRLGs) to satisfy the requirement of disjointness.",
      "ja": "T1が経路上に確立される{AB、BC、CD、DE、EZ}プライマリパスとして、そしてT2は、バックアップ経路として経路を{AF、FG、GH、HI、IZ}上に確立されます。 2つの経路がばらばらの要件を満たすために、それらのリンク、ノード、および共有リスクリンクグループ（SRLGs）に互いに素なければなりません。"
    },
    {
      "indent": 3,
      "text": "In the case of primary/backup paths, when the primary path T1 is up, the packets of the PW are sent on T1. When T1 fails, the packets of the PW are sent on the backup path T2. When T1 comes back up, the operator either allows for an automated reversion of the traffic onto T1 or selects an operator-driven reversion. Typically, the switchover from path T1 to path T2 is done in a fast-reroute fashion (e.g., sub-50 milliseconds) but, depending on the service that needs to be delivered, other restoration times may be used.",
      "ja": "主経路T1が起動している場合、バックアップ/プライマリパスの場合には、PWのパケットがT1で送信されます。 T1が失敗した場合、PWのパケットは、バックアップ経路T2上で送信されます。 T1が復旧すると、オペレータは、T1上にトラフィックを自動的に復帰することができますまたはオペレーター主導の復帰を選択いずれか。典型的には、経路T2に経路T1から切り替えが高速リルート方式で行われる（例えば、サブ50ミリ秒）であるが、は、配信される必要があるサービスに応じて、他の復旧時間が使用されてもよいです。"
    },
    {
      "indent": 3,
      "text": "It is essential that any path, primary or backup, benefit from an end-to-end liveness monitoring/verification. The method and mechanisms that provide such a liveness check are outside the scope of this document. An example is given by [RFC5880].",
      "ja": "これは、エンド・ツー・エンドのライブネス・モニタリング/検証から任意の経路、プライマリまたはバックアップ、利点ことが不可欠です。そのような生存性チェックを提供する方法およびメカニズムは、この文書の範囲外です。例は[RFC5880]で与えられます。"
    },
    {
      "indent": 3,
      "text": "There are multiple options for a liveness check, e.g., path liveness, where the path is monitored at the network level (either by the head-end node or by a network controller/monitoring system). Another possible approach consists of a service-based path monitored by the service instance (verifying reachability of the endpoint). All these options are given here as examples. While this document does express the requirement for a liveness mechanism, it does not mandate, nor define, any specific one.",
      "ja": "ライブネス・チェック、パスがネットワークレベルで監視され、例えば、パスライブネス、（ヘッドエンドノードによって、またはネットワークコントローラ/監視システムのいずれかによって）のための複数のオプションがあります。別の可能なアプローチは、サービスインスタンス（エンドポイントの到達可能性を検証すること）によって監視サービスベースのパスから成ります。これらのオプションはすべての例として、ここで与えられています。このドキュメントは、ライブネスメカニズムの必要性を表現していますが、それは、任意の特定のものを義務付け、また定義されていません。"
    },
    {
      "indent": 3,
      "text": "From a SPRING viewpoint, we would like to highlight the following requirements:",
      "ja": "SPRINGの観点から、我々は次の要件を強調したいと思います："
    },
    {
      "indent": 3,
      "text": "o SPRING architecture MUST provide a way to compute paths that are not protected by local repair techniques (as illustrated in the example of paths T1 and T2).",
      "ja": "O SPRINGアーキテクチャは、ローカル修復技術（経路T1及びT2の例に示されるように）によって保護されていない経路を計算する方法を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o SPRING architecture MUST provide a way to instantiate pairs of disjoint paths on a topology based on a protection strategy (link, node, or SRLG protection) and allow the validation or recomputation of these paths upon network events.",
      "ja": "O SPRINGアーキテクチャは、保護戦略（リンク、ノード、またはSRLG保護）に基づいて、トポロジー上の互いに素な経路の組をインスタンス化し、ネットワークイベントの際に、これらのパスの検証又は再計算を可能にする方法を提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The SPRING architecture MUST provide an end-to-end liveness check of SPRING-based paths.",
      "ja": "O SPRINGアーキテクチャはSpringベースのパスのエンド・ツー・エンドのライブネス・チェックを提供しなければなりません。"
    },
    {
      "indent": 0,
      "text": "3. Management-Free Local Protection",
      "section_title": true,
      "ja": "3.管理-無料ローカル保護"
    },
    {
      "indent": 3,
      "text": "This section describes two alternatives that provide local protection without requiring operator management, namely bypass protection and shortest-path-based protection.",
      "ja": "このセクションでは、オペレータの管理を必要とせずに、ローカルな保護を提供する2つの代替、即ちバイパス保護および最短パスベースの保護を記載しています。"
    },
    {
      "indent": 3,
      "text": "For example, traffic from A to Z, transported over the shortest paths provided by the SPRING architecture, benefits from management-free local protection by having each node along the path automatically precompute and preinstall a backup path for the destination Z. Upon local detection of the failure, the traffic is repaired over the backup path in sub-50 milliseconds. When the primary path comes back up, the operator either allows for an automated reversion of the traffic onto it or selects an operator-driven reversion.",
      "ja": "例えば、トラフィックからZまで、SPRINGアーキテクチャによって提供される最短経路上で転送、管理フリーローカル保護から利益を自動的に事前計算経路に沿った各ノードを有し、ローカル検出すると、宛先Z.のバックアップパスをプレインストールすることにより失敗は、トラフィックは、サブ50ミリ秒単位のバックアップパスで修復されます。プライマリパスが復旧すると、オペレータは、それへのトラフィックを自動的に復帰することができますまたはオペレーター主導の復帰を選択いずれか。"
    },
    {
      "indent": 3,
      "text": "The backup path computation SHOULD support the following requirements:",
      "ja": "バックアップ経路計算は、次の要件をサポートする必要があります。"
    },
    {
      "indent": 3,
      "text": "o 100% link, node, and SRLG protection in any topology;",
      "ja": "任意のトポロジで100％のリンク、ノード、及びSRLG保護O。"
    },
    {
      "indent": 3,
      "text": "o automated computation by the IGP; and",
      "ja": "O IGPによる計算を自動化。そして"
    },
    {
      "indent": 3,
      "text": "o selection of the backup path such as to minimize the chance for transient congestion and/or delay during the protection period, as reflected by the IGP metric configuration in the network.",
      "ja": "ネットワーク内のIGPメトリック構成によって反映されるように、保護期間中の過渡輻輳及び/又は遅延の可能性を最小限にするような予備パスのO選択。"
    },
    {
      "indent": 0,
      "text": "3.1. Management-Free Bypass Protection",
      "section_title": true,
      "ja": "3.1。管理フリーバイパス保護"
    },
    {
      "indent": 3,
      "text": "One way to provide local repair is to enforce a failover along the shortest path around the failed component.",
      "ja": "ローカル修復を提供するための一つの方法は、故障したコンポーネントの周りの最短経路に沿ってフェイルオーバーを強制することです。"
    },
    {
      "indent": 3,
      "text": "In case of link protection, the point of local repair will create a repair path avoiding the protected link and merging back to the primary path at the next hop.",
      "ja": "リンク保護の場合には、地元の修理のポイントは、修理・パス保護リンクを回避し、次のホップでプライマリパスに戻ってマージを作成します。"
    },
    {
      "indent": 3,
      "text": "In case of node protection, the repair path will avoid the protected node and merge back to the primary path at the next-next hop.",
      "ja": "ノード保護の場合には、修復経路は、保護ノードを回避し、次の次のホップでプライマリパスに戻ってマージ。"
    },
    {
      "indent": 3,
      "text": "In case of SRLG protection, the repair path will avoid members of the same group and merge back to the primary path just after.",
      "ja": "SRLG保護の場合は、修理・パスは、同じグループのメンバーを避けることができますし、直後にプライマリパスに戻ってマージします。"
    },
    {
      "indent": 3,
      "text": "In our example, C protects destination Z against a failure of the CD link by enforcing the traffic over the bypass {CH, HD}. The resulting end-to-end path between A and Z, upon recovery from the failure of CD, is depicted in Figure 2.",
      "ja": "この例では、Cは、バイパス{CH、HD}上のトラフィックを強制することによってCDリンクの障害に対する宛先Zを保護します。 AとZの間に得られたエンドツーエンドのパスは、CDの障害からの回復時に、図2に示されています。"
    },
    {
      "indent": 23,
      "text": "   B * * *C------D * * *E\n  *|      | *  / * \\  / |*\n * |      |  */  *  \\/  | *\nA  |      |  /*  *  /\\  |  Z\n \\ |      | /  * * /  \\ | /\n  \\|      |/    **/    \\|/\n   F------G------H------I",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 2: Bypass Protection around Link CD",
      "ja": "図2：リンクCDの周りのバイパス保護"
    },
    {
      "indent": 3,
      "text": "When the primary path comes back up, the operator either allows for an automated reversion of the traffic onto the primary path or selects an operator-driven reversion.",
      "ja": "プライマリパスが復旧すると、オペレータは、プライマリパスへのトラフィックを自動的に復帰することができますまたはオペレーター主導の復帰を選択いずれか。"
    },
    {
      "indent": 0,
      "text": "3.2. Management-Free Shortest-Path-Based Protection",
      "section_title": true,
      "ja": "3.2。管理フリー最短パスベースの保護"
    },
    {
      "indent": 3,
      "text": "An alternative protection strategy consists in management-free local protection that is aimed at providing a repair for the destination based on the shortest path to the destination.",
      "ja": "代替保護戦略は、目的地までの最短経路に基づいて目的地のための修理を提供することを目的としている管理、無料ローカル保護で構成されています。"
    },
    {
      "indent": 3,
      "text": "In our example, C protects Z (which the traffic initially reaches via CD) by enforcing the traffic over its shortest path to Z and considering the failure of the protected component. The resulting end-to-end path between A and Z, upon recovery from the failure of CD, is depicted in Figure 3.",
      "ja": "この例では、Cは、Zへの最短パスを介してトラフィックを強化し、保護された構成要素の故障を考慮して（トラフィックは最初にCDを介して到達する）Zを保護します。 AとZの間に得られたエンドツーエンドのパスは、CDの障害からの回復時に、図3に示されています。"
    },
    {
      "indent": 23,
      "text": "   B * * *C------D------E\n  *|      | *  / | \\  / |\\\n * |      |  */  |  \\/  | \\\nA  |      |  /*  |  /\\  |  Z\n \\ |      | /  * | /  \\ | *\n  \\|      |/    *|/    \\|*\n   F------G------H * * *I",
      "raw": true
    },
    {
      "indent": 13,
      "text": "Figure 3: Shortest Path Protection around Link CD",
      "ja": "図3：リンクCDの周りの最短パスプロテクション"
    },
    {
      "indent": 3,
      "text": "When the primary path comes back up, the operator either allows for an automated reversion of the traffic onto the primary path or selects an operator-driven reversion.",
      "ja": "プライマリパスが復旧すると、オペレータは、プライマリパスへのトラフィックを自動的に復帰することができますまたはオペレーター主導の復帰を選択いずれか。"
    },
    {
      "indent": 0,
      "text": "4. Managed Local Protection",
      "section_title": true,
      "ja": "4.管理ローカル保護"
    },
    {
      "indent": 3,
      "text": "There may be cases where a management-free repair does not fit the policy of the operator. For example, in our illustration, the operator may not want to have CD and CH used to protect each other due to the bandwidth (BW) availability in each link that could not suffice to absorb the other link traffic.",
      "ja": "管理-無償修理は、オペレータのポリシーに適合しない場合があります。たとえば、私たちのイラストでは、オペレータは、CDやCHがために他のリンクトラフィックを吸収するのに十分ではない可能性があり、各リンクでの帯域幅（BW）の可用性にお互いを保護するために使用したくないかもしれません。"
    },
    {
      "indent": 3,
      "text": "In this context, the protection mechanism MUST support the explicit configuration of the backup path either under the form of high-level constraints (end at the next hop, end at the next-next hop, minimize this metric, avoid this SRLG, etc.) or under the form of an explicit path. Upon local detection of the failure, the traffic is repaired over the backup path in sub-50 milliseconds. When the primary path comes back up, the operator either allows for an automated reversion of the traffic onto it or selects an operator-driven reversion.",
      "ja": "この文脈において、保護機構は、いずれかの高レベルの制約（次のホップの端、次の次のホップの端の形で予備パスの明示的な設定をサポートし、このメトリックを最小化する、このSRLGを回避するなどしなければなりません）、または明示的なパスの形で。故障の局所検出すると、トラフィックは、サブ50ミリ秒で予備パス上に修復されます。プライマリパスが復旧すると、オペレータは、それへのトラフィックを自動的に復帰することができますまたはオペレーター主導の復帰を選択いずれか。"
    },
    {
      "indent": 3,
      "text": "We discuss such aspects for both bypass and shortest-path-based protection schemes.",
      "ja": "私たちは、バイパスと最短パスベースの保護方式の両方のためのそのような側面を議論します。"
    },
    {
      "indent": 0,
      "text": "4.1. Managed Bypass Protection",
      "section_title": true,
      "ja": "4.1。マネージドバイパス保護"
    },
    {
      "indent": 3,
      "text": "Let us illustrate the case using our reference example. For the demand from A to Z, the operator does not want to use the shortest failover path to the next hop, {CH, HD}, but rather the path {CG, GH, HD}, as illustrated in Figure 4.",
      "ja": "私たちは私たちの参考例を用いた場合を説明しましょう。 Zへの需要のために、オペレータは、図4に示すように、最短次のホップへのフェイルオーバーパス、{CH、HD}、むしろパス{CG、GH、HD}を使用する必要はありません。"
    },
    {
      "indent": 23,
      "text": "   B * * *C------D * * *E\n  *|      * \\  / * \\  / |*\n * |      *  \\/  *  \\/  | *\nA  |      *  /\\  *  /\\  |  Z\n \\ |      * /  \\ * /  \\ | /\n  \\|      */    \\*/    \\|/\n   F------G * * *H------I",
      "raw": true
    },
    {
      "indent": 20,
      "text": "Figure 4: Managed Bypass Protection",
      "ja": "図4：管理バイパス保護"
    },
    {
      "indent": 3,
      "text": "The computation of the repair path SHOULD be possible in an automated fashion as well as statically expressed in the point of local repair.",
      "ja": "修復経路の計算は同様に静的ローカル修復の点で表されるように自動化された方法で可能なはずです。"
    },
    {
      "indent": 0,
      "text": "4.2. Managed Shortest Path Protection",
      "section_title": true,
      "ja": "4.2。マネージド最短パスプロテクション"
    },
    {
      "indent": 3,
      "text": "In the case of shortest path protection, the operator does not want to use the shortest failover via link CH, but rather the traffic should reach H via {CG, GH} due to constraints such as delay, BW, or SRLG.",
      "ja": "最短パスプロテクションの場合、オペレータは、リンクCH介し最短フェールオーバーを使用したくない、むしろトラフィックは、そのような遅延、BW、またはSRLGのような制約のため、{CG、GH}介しHに到達しなければなりません。"
    },
    {
      "indent": 3,
      "text": "The resulting end-to-end path upon activation of the protection is illustrated in Figure 5.",
      "ja": "防御の活性化の際に得られたエンドツーエンドのパスは図5に示されています。"
    },
    {
      "indent": 23,
      "text": "   B * * *C------D------E\n  *|      * \\  / | \\  / |\\\n * |      *  \\/  |  \\/  | \\\nA  |      *  /\\  |  /\\  |  Z\n \\ |      * /  \\ | /  \\ | *\n  \\|      */    \\|/    \\|*\n   F------G * * *H * * *I",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 5: Managed Shortest Path Protection",
      "ja": "図5：管理最短パスプロテクション"
    },
    {
      "indent": 3,
      "text": "The computation of the repair path SHOULD be possible in an automated fashion as well as statically expressed in the point of local repair.",
      "ja": "修復経路の計算は同様に静的ローカル修復の点で表されるように自動化された方法で可能なはずです。"
    },
    {
      "indent": 3,
      "text": "The computation of the repair path based on a specific constraint SHOULD be possible on a per-destination prefix base.",
      "ja": "特定の制約に基づいて修復経路の計算は、毎宛先プレフィックスベース上ことが可能であるべきです。"
    },
    {
      "indent": 0,
      "text": "5. Loop Avoidance",
      "section_title": true,
      "ja": "5.ループ回避"
    },
    {
      "indent": 3,
      "text": "It is part of routing protocols' behavior to have what are called \"transient routing inconsistencies\". This is due to the routing convergence that happens in each node at different times and during a different lapse of time.",
      "ja": "これは、 『一時的なルーティングの不一致』と呼ばれているものを持っているプロトコルの行動をルーティングの一部です。これは、異なる時間に及び異なる時間の経過中に各ノードで発生したルーティング収束に起因するものです。"
    },
    {
      "indent": 3,
      "text": "These inconsistencies may cause routing loops that last the time that it takes for the node impacted by a network event to converge. These loops are called \"micro-loops\".",
      "ja": "これらの矛盾は、それが収束するネットワークイベントによって影響を受けたノードのために要する時間が続くルーティングループを引き起こす可能性があります。これらのループは、「マイクロループ」と呼ばれています。"
    },
    {
      "indent": 3,
      "text": "Usually, in normal routing protocol operations, micro-loops do not last long and are only noticed during the time it takes the network to converge. However, with the emergence of fast-convergence and fast-reroute technologies, micro-loops can be an issue in networks where sub-50 millisecond convergence/reroute is required. Therefore, the micro-loop problem needs to be addressed.",
      "ja": "通常は、通常のルーティングプロトコル動作で、マイクロループは長くは続かず、唯一それが収束するには、ネットワークにかかる時間の間に気づいています。しかし、高速収束と高速再ルーティング技術の出現で、マイクロループは、サブ50ミリ秒の収束/再ルーティングが必要とされるネットワークでは問題であり得ます。したがって、マイクロループの問題に対処する必要があります。"
    },
    {
      "indent": 3,
      "text": "Networks may be affected by micro-loops during convergence depending of their topologies. Detecting micro-loops can be done during topology computation (e.g., Shortest Path First (SPF) computation), and therefore techniques to avoid micro-loops may be applied. An example of such technique is to compute a path free of micro-loops that would be used during network convergence.",
      "ja": "ネットワークは、そのトポロジに依存コンバージェンス中マイクロループによって影響され得ます。マイクロループトポロジ計算（例えば、最短パス優先（SPF）計算）の間に行うことができ、したがって、マイクロループを回避する技術を適用することができる検出。このような技術の一例は、ネットワーク輻輳時に使用されるマイクロループのフリーパスを計算することです。"
    },
    {
      "indent": 3,
      "text": "The SPRING architecture SHOULD provide solutions to prevent the occurrence of micro-loops during convergence following a change in the network state. Traditionally, the lack of packet steering capability made it difficult to apply efficient solutions to micro-loops. A SPRING-enabled router could take advantage of the increased packet steering capabilities offered by SPRING in order to steer packets in a way that packets do not enter such loops.",
      "ja": "SPRINGアーキテクチャは、ネットワーク状態の変化に追従収束中マイクロループの発生を防止するためのソリューションを提供すべきです。伝統的に、パケットのステアリング機能の欠如は、それが困難なマイクロループに効率的なソリューションを適用するために作られました。 SPRING対応ルータは、パケットがこのようなループを入力しないように、パケットを操縦するために、SPRINGが提供する増加パケットステアリング機能を利用できます。"
    },
    {
      "indent": 0,
      "text": "6. Coexistence of Multiple Resilience Techniques in the Same Infrastructure",
      "ja": "同じインフラストラクチャ内の複数の弾力技術の6共存"
    },
    {
      "indent": 3,
      "text": "The operator may want to support several very different services on the same packet-switching infrastructure. As a result, the SPRING architecture SHOULD allow for the coexistence of the different use cases listed in this document, in the same network.",
      "ja": "オペレータは、同じパケット交換インフラ上のいくつかの非常に異なるサービスをサポートすることをお勧めします。結果として、SPRINGアーキテクチャは同一のネットワークでは、この文書に記載されている異なるユースケースの共存を可能にすべきです。"
    },
    {
      "indent": 3,
      "text": "Let us illustrate this with the following example:",
      "ja": "私たちは、次の例でこれを説明してみましょう："
    },
    {
      "indent": 3,
      "text": "o Flow F1 is supported over path {C, CD, E}",
      "ja": "OフローF1がパス上に支持されている{C、CD、E}"
    },
    {
      "indent": 3,
      "text": "o Flow F2 is supported over path {C, CD, I}",
      "ja": "OフローF2は{C、CD、I}の経路上に支持されています"
    },
    {
      "indent": 3,
      "text": "o Flow F3 is supported over path {C, CD, Z}",
      "ja": "OフローF3は、パス上に支持されている{C、CD、Z}"
    },
    {
      "indent": 3,
      "text": "o Flow F4 is supported over path {C, CD, Z}",
      "ja": "OフローF4がパス上に支持されている{C、CD、Z}"
    },
    {
      "indent": 3,
      "text": "It should be possible for the operator to configure the network to achieve path protection for F1, management-free shortest path local protection for F2, managed protection over path {CG, GH, Z} for F3, and management-free bypass protection for F4.",
      "ja": "オペレータはF1、F2の管理フリー最短経路ローカル保護のためのパスプロテクションを実現するためにネットワークを構成することが可能であるべきで、経路上の保護F3用{CG、GH、Z}、およびF4の管理フリーバイパス保護を管理。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document describes requirements for the SPRING architecture to provide resiliency in SPRING networks. As such, it does not introduce any new security considerations beyond those discussed in [RFC7855].",
      "ja": "この文書では、SPRINGネットワ​​ークに復元力を提供するために、SPRINGアーキテクチャの要件について説明します。このように、それは、[RFC7855]で議論したものを越えた新たなセキュリティ上の考慮事項を導入しません。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document has no IANA actions.",
      "ja": "このドキュメントには、IANAのアクションを持っていません。"
    },
    {
      "indent": 0,
      "text": "9. Manageability Considerations",
      "section_title": true,
      "ja": "9.管理性の考慮事項"
    },
    {
      "indent": 3,
      "text": "This document provides use cases. Solutions aimed at supporting these use cases should provide the necessary mechanisms in order to allow for manageability as described in [RFC7855].",
      "ja": "この文書では、ユースケースを提供します。これらのユースケースをサポートすることを目的と解決策は、[RFC7855]に記載されるように管理を可能にするために必要なメカニズムを提供しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Manageability concerns the computation, installation, and troubleshooting of the repair path. Also, necessary mechanisms SHOULD be provided in order for the operator to control when a repair path is computed, how it has been computed, and if it's installed and used.",
      "ja": "管理性は、修復経路の計算、インストール、およびトラブルシューティングに関する。また、必要な機構は、修復経路は、それが計算されたか、計算されたときに制御するオペレータために提供されるべきで、それをインストールして使用するかどう。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10.参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC7855] Previdi, S., Ed., Filsfils, C., Ed., Decraene, B., Litkowski, S., Horneffer, M., and R. Shakir, \"Source Packet Routing in Networking (SPRING) Problem Statement and Requirements\", RFC 7855, DOI 10.17487/RFC7855, May 2016, <https://www.rfc-editor.org/info/rfc7855>.",
      "ja": "[RFC7855] Previdi、S.編、Filsfils、C.、エド。、Decraene、B.、Litkowski、S.、Horneffer、M.、およびR. Shakir、「ネットワークにおけるソースパケットルーティング（SPRING）問題文そして、要件」、RFC 7855、DOI 10.17487 / RFC7855、2016年5月、<https://www.rfc-editor.org/info/rfc7855>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B.、 \"RFC 2119個のキーワードに小文字VS大文字の曖昧さ\"、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC5286] Atlas, A., Ed. and A. Zinin, Ed., \"Basic Specification for IP Fast Reroute: Loop-Free Alternates\", RFC 5286, DOI 10.17487/RFC5286, September 2008, <https://www.rfc-editor.org/info/rfc5286>.",
      "ja": "[RFC5286]アトラス、A.編。 。そしてA.ジニン、エド、 \"IP高速リルートのための基本仕様：ループフリーのAlternates\"、RFC 5286、DOI 10.17487 / RFC5286、2008年9月、<https://www.rfc-editor.org/info/rfc5286> 。"
    },
    {
      "indent": 3,
      "text": "[RFC5714] Shand, M. and S. Bryant, \"IP Fast Reroute Framework\", RFC 5714, DOI 10.17487/RFC5714, January 2010, <https://www.rfc-editor.org/info/rfc5714>.",
      "ja": "[RFC5714]シャンド、M.とS.ブライアント、 \"IP高速リルートフレームワーク\"、RFC 5714、DOI 10.17487 / RFC5714、2010年1月、<https://www.rfc-editor.org/info/rfc5714>。"
    },
    {
      "indent": 3,
      "text": "[RFC5880] Katz, D. and D. Ward, \"Bidirectional Forwarding Detection (BFD)\", RFC 5880, DOI 10.17487/RFC5880, June 2010, <https://www.rfc-editor.org/info/rfc5880>.",
      "ja": "[RFC5880]カッツ、D.およびD.区、 \"双方向フォワーディング検出（BFD）\"、RFC 5880、DOI 10.17487 / RFC5880、2010年6月、<https://www.rfc-editor.org/info/rfc5880>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Stephane Litkowski and Alexander Vainshtein for the comments and review of this document.",
      "ja": "作者はこのドキュメントのコメントやレビューのためにステファンLitkowskiとアレクサンダーVainshteinに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "Pierre Francois contributed to the writing of the first draft version of this document.",
      "ja": "ピエール・フランソワは、このドキュメントの最初のドラフト版の執筆に貢献しました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Clarence Filsfils (editor) Cisco Systems, Inc. Brussels Belgium",
      "ja": "クラレンスFilsfils（エディタ）は、シスコシステムズ、株式会社ブリュッセルベルギー"
    },
    {
      "indent": 3,
      "text": "Email: cfilsfil@cisco.com",
      "ja": "メール：cfilsfil@cisco.com"
    },
    {
      "indent": 3,
      "text": "Stefano Previdi (editor) Cisco Systems, Inc. Via Del Serafico, 200 Rome 00142 Italy",
      "ja": "スティーブンは（エディタ）は、シスコシステムズ、株式会社ヴィアデルセラフィック、200 00142ローマイタリアを予見しました"
    },
    {
      "indent": 3,
      "text": "Email: stefano@previdi.net",
      "ja": "メール：stefano@previdi.net"
    },
    {
      "indent": 3,
      "text": "Bruno Decraene Orange France",
      "ja": "ブルーノDecraeneオレンジフランス"
    },
    {
      "indent": 3,
      "text": "Email: bruno.decraene@orange.com",
      "ja": "メール：bruno.decraene@orange.com"
    },
    {
      "indent": 3,
      "text": "Rob Shakir Google, Inc. 1600 Amphitheatre Parkway Mountain View, CA 94043 United States of America",
      "ja": "ロブShakirグーグル株式会社1600アンフィシアターパークウェイマウンテンビュー、カリフォルニア州アメリカの94043米国"
    },
    {
      "indent": 3,
      "text": "Email: robjs@google.com",
      "ja": "メール：robjs@google.com"
    }
  ]
}