{
  "title": {
    "text": "RFC 8045 - RADIUS Extensions for IP Port Configuration and Reporting",
    "ja": "RFC 8045 - IPポートの設定およびレポーティングのためのRADIUS拡張機能"
  },
  "number": 8045,
  "created_at": "2019-10-22 16:01:18.466694+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                          D. Cheng\nRequest for Comments: 8045                                        Huawei\nCategory: Standards Track                                    J. Korhonen\nISSN: 2070-1721                                     Broadcom Corporation\n                                                            M. Boucadair\n                                                                  Orange\n                                                            S. Sivakumar\n                                                           Cisco Systems\n                                                            January 2017",
      "raw": true
    },
    {
      "indent": 7,
      "text": "RADIUS Extensions for IP Port Configuration and Reporting",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines three new RADIUS attributes. For devices that implement IP port ranges, these attributes are used to communicate with a RADIUS server in order to configure and report IP transport ports as well as mapping behavior for specific hosts. This mechanism can be used in various deployment scenarios such as Carrier-Grade NAT, IPv4/IPv6 translators, Provider WLAN gateway, etc. This document defines a mapping between some RADIUS attributes and IP Flow Information Export (IPFIX) Information Element identifiers.",
      "ja": "この文書は3つの新しいRADIUS属性を定義します。 IPポートの範囲を実装するデバイスの場合、これらの属性は、IPトランスポートのポートだけでなく、特定のホストのマッピング動作を設定し、報告するために、RADIUSサーバとの通信に使用されています。この機構は、等キャリアグレードNATはIPv4 / IPv6のトランスレータ、プロバイダWLANゲートウェイ、このドキュメントでは、いくつかのRADIUS属性とIPフロー情報エクスポート（IPFIX）の情報要素識別子との間のマッピングを規定するような様々な展開シナリオに使用することができます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8045.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc8045で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2017 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................4\n2. Terminology .....................................................5\n   2.1. Requirements Language ......................................6\n3. Extensions of RADIUS Attributes and TLVs ........................7\n   3.1. Extended Attributes for IP Ports ...........................7\n        3.1.1. IP-Port-Limit-Info Attribute ........................7\n        3.1.2. IP-Port-Range Attribute .............................9\n        3.1.3. IP-Port-Forwarding-Map Attribute ...................12\n   3.2. RADIUS TLVs for IP Ports ..................................15\n        3.2.1. IP-Port-Type TLV ...................................16\n        3.2.2. IP-Port-Limit TLV ..................................17\n        3.2.3. IP-Port-Ext-IPv4-Addr TLV ..........................18\n        3.2.4. IP-Port-Int-IPv4-Addr TLV ..........................19\n        3.2.5. IP-Port-Int-IPv6-Addr TLV ..........................20\n        3.2.6. IP-Port-Int-Port TLV ...............................21\n        3.2.7. IP-Port-Ext-Port TLV ...............................22\n        3.2.8. IP-Port-Alloc TLV ..................................23\n        3.2.9. IP-Port-Range-Start TLV ............................24\n        3.2.10. IP-Port-Range-End TLV .............................25\n        3.2.11. IP-Port-Local-Id TLV ..............................25\n4. Applications, Use Cases, and Examples ..........................27\n   4.1. Managing CGN Port Behavior Using RADIUS ...................27\n        4.1.1. Configure IP Port Limit for a User .................27\n        4.1.2. Report IP Port Allocation/Deallocation .............29\n        4.1.3. Configure Port Forwarding Mapping ..................31\n        4.1.4. An Example .........................................33\n   4.2. Report Assigned Port Set for a Visiting UE ................35\n5. Table of Attributes ............................................36\n6. Security Considerations ........................................36\n7. IANA Considerations ............................................37\n   7.1. New IPFIX Information Elements ............................37\n   7.2. New RADIUS Attributes .....................................38\n   7.3. New RADIUS TLVs ...........................................38\n8. References .....................................................39\n   8.1. Normative References ......................................39\n   8.2. Informative References ....................................40\nAcknowledgments ...................................................43\nAuthors' Addresses ................................................43",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "In a broadband network, customer information is usually stored on a RADIUS server [RFC2865]. At the time when a user initiates an IP connection request, if this request is authorized, the RADIUS server will populate the user's configuration information to the Network Access Server (NAS), which is often referred to as a Broadband Network Gateway (BNG) in broadband access networks. The Carrier-Grade NAT (CGN) function may also be implemented on the BNG. Within this document, the CGN may perform Network Address Translation from IPv4 Clients to IPv4 Servers (NAT44) [RFC3022], NAT from IPv6 Clients to IPv4 Servers (NAT64) [RFC6146], or Dual-Stack Lite Address Family Transition Router (AFTR) [RFC6333] function. In such case, the CGN IP transport port (e.g., TCP/UDP port) mapping behaviors can be part of the configuration information sent from the RADIUS server to the NAS/BNG. As part of the accounting information sent from the NAS/BNG to a RADIUS server, the NAS/BNG may also report the IP port mapping behavior applied by the CGN to a user session.",
      "ja": "ブロードバンドネットワークでは、顧客情報は、通常、RADIUSサーバ[RFC2865]に格納されています。ユーザーはこの要求が許可されている場合は、IP接続要求を開始時には、RADIUSサーバは、多くの場合にはブロードバンドネットワークゲートウェイ（BNG）と呼ばれているネットワークアクセスサーバー（NAS）へのユーザーの設定情報を取り込みますブロードバンド・アクセス・ネットワーク。キャリアグレードNAT（CGN）関数はまた、BNG上に実装されてもよいです。この文書の中で、CGNは、IPv4サーバーへのIPv4クライアント（NAT44）[RFC3022]からネットワークアドレス変換を行うことができる、IPv6のクライアントからのIPv4サーバへのNAT（NAT64）[RFC6146]、またはデュアルスタックLiteのアドレスファミリ移行ルータ（AFTR） [RFC6333]機能。このような場合に、CGN IPトランスポートポート（例えば、TCP / UDPポート）のマッピング動作はNAS / BNGにRADIUSサーバから送信される設定情報の一部とすることができます。 RADIUSサーバへのNAS / BNGから送信された会計情報の一部として、NAS / BNGは、ユーザセッションにCGNによって適用されるIPポートマッピング行動を報告することがあります。"
    },
    {
      "indent": 3,
      "text": "When IP packets traverse the CGN, it performs mapping on the IP transport (e.g., TCP/UDP) source port as required. An IP transport source port, along with a source IP address, destination IP address, destination port, and protocol identifier, if applicable, uniquely identify a mapping. Since the number space of IP transport ports in the CGN's external realm is shared among multiple users assigned with the same IPv4 address, the total number of a user's simultaneous IP mappings is likely to be subject to a port quota (see Section 5 of [RFC6269]).",
      "ja": "IPパケットがCGNを横切るときに、必要に応じて、それはIPトランスポート（例えば、TCP / UDP）、送信元ポートにマッピングを行います。該当する場合はIPトランスポートのソースポートが、送信元IPアドレス、宛先IPアドレス、宛先ポート、およびプロトコル識別子と共に、一意のマッピングを識別する。 CGNの外部の領域におけるIPトランスポートのポート番号空間を同一のIPv4アドレスが割り当てられ、複数のユーザ間で共有されるので、ユーザの同時IPマッピングの総数は、ポート割当てを受ける可能性がある（[RFC6269のセクション5を参照してください]）。"
    },
    {
      "indent": 3,
      "text": "The attributes defined in this document may also be used to report the assigned port range in some deployments, such as Provider WLAN [WIFI-SERVICES]. For example, a visiting host can be managed by Customer Premises Equipment (CPE), which will need to report the assigned port range to the service platform. This is required for identification purposes (see TR-146 [TR-146] for more details).",
      "ja": "この文書で定義された属性はまた、プロバイダWLAN [WIFI-SERVICES]のようないくつかの展開に割り当てられたポートの範囲を報告するために使用されてもよいです。例えば、訪問のホストは、サービスプラットフォームに割り当てられたポート範囲を報告する必要があります顧客宅内機器（CPE）で管理することができます。これは（詳細については、TR-146 [TR-146]を参照）、識別目的のために必要とされます。"
    },
    {
      "indent": 3,
      "text": "This document proposes three new attributes as RADIUS protocol extensions; they are used for separate purposes, as follows:",
      "ja": "このドキュメントでは、RADIUSプロトコルの拡張として3つの新しい属性を提案しています。次のように彼らは、別の目的のために使用されています。"
    },
    {
      "indent": 3,
      "text": "1. IP-Port-Limit-Info: This attribute may be carried in a RADIUS Access-Accept, Access-Request, Accounting-Request, or CoA-Request packet. The purpose of this attribute is to limit the total number of IP source transport ports allocated to a user and associated with one or more IPv4 or IPv6 addresses.",
      "ja": "1. IPポート・リミット・インフォ：この属性は、RADIUSアクセス - 受け入れ、アクセス要求、アカウンティング要求、またはアシルCoA-Requestパケットで行うことができます。この属性の目的は、ユーザに割り当てられ、一つ以上のIPv4またはIPv6アドレスに関連付けられたIPソーストランスポートポートの総数を制限することです。"
    },
    {
      "indent": 3,
      "text": "2. IP-Port-Range: This attribute may be carried in a RADIUS Accounting-Request packet. The purpose of this attribute is for an address-sharing device (e.g., a CGN) to report to the RADIUS server the range of IP source transport ports that have been allocated or deallocated for a user. The port range is bound to an external IPv4 address.",
      "ja": "2. IPポートレンジ：この属性は、RADIUSアカウンティング要求パケット内で行うことができます。アドレス共有デバイス（例えば、CGN）RADIUSサーバへのユーザのために割り当てられたまたは割当て解除されたIP送信元トランスポートポートの範囲を報告するためにこの属性の目的です。ポート範囲は、外部のIPv4アドレスにバインドされています。"
    },
    {
      "indent": 3,
      "text": "3. IP-Port-Forwarding-Map: This attribute may be carried in RADIUS Access-Accept, Access-Request, Accounting-Request, or CoA-Request packet. The purpose of this attribute is to specify how an IP internal source transport port, together with its internal IPv4 or IPv6 address, are mapped to an external source transport port along with the external IPv4 address.",
      "ja": "3. IPポートフォワーディング - マップ：この属性は、RADIUSアクセス - 受け入れ、アクセス要求、アカウンティング要求、またはアシルCoA-Requestパケットで行うことができます。この属性の目的は、一緒になって、その内部のIPv4またはIPv6アドレスを持つIP内部電源トランスポートポートは、外部のIPv4アドレスとともに外部電源トランスポートポートにマッピングされる方法を指定することです。"
    },
    {
      "indent": 3,
      "text": "IPFIX Information Elements [RFC7012] can be used for IP flow identification and representation over RADIUS. This document provides a mapping between some RADIUS TLVs and IPFIX Information Element identifiers. A new IPFIX Information Element is defined by this document (see Section 3.2.2).",
      "ja": "IPFIX情報エレメント[RFC7012] RADIUSオーバーIPフローの識別および表現のために使用することができます。この文書では、一部のRADIUSのTLVおよびIPFIX情報要素識別子との間のマッピングを提供します。新しいIPFIX情報エレメントは、この文書で定義される（セクション3.2.2を参照してください）。"
    },
    {
      "indent": 3,
      "text": "IP protocol numbers (refer to [ProtocolNumbers]) can be used for identification of IP transport protocols (e.g., TCP [RFC793], UDP [RFC768], Datagram Congestion Control Protocol (DCCP) [RFC4340], and Stream Control Transmission Protocol (SCTP) [RFC4960]) that are associated with some RADIUS attributes.",
      "ja": "IPプロトコル番号は（[ProtocolNumbers]を参照）、例えば、TCP [RFC793]、UDPは、[RFC768]、データグラム輻輳制御プロトコル（DCCP）[RFC4340]、およびストリーム制御伝送プロトコル（SCTP（IPトランスポートプロトコルの識別のために使用することができますいくつかのRADIUS属性に関連付けられている）[RFC4960]）。"
    },
    {
      "indent": 3,
      "text": "This document focuses on IPv4 address sharing. Mechanisms for IPv6 prefix sharing (e.g., IPv6-to-IPv6 Network Prefix Translation (NPTv6)) are out of scope.",
      "ja": "この文書では、IPv4アドレスの共有に焦点を当てています。 IPv6プレフィックスを共有するためのメカニズム（例えば、IPv6の対IPv6ネットワークプレフィックス変換（NPTv6））が範囲外です。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "This document makes use of the following terms:",
      "ja": "このドキュメントでは、次の用語を使用します："
    },
    {
      "indent": 3,
      "text": "o IP Port: This refers to an IP transport port (e.g., a TCP port number or UDP port number).",
      "ja": "O IPポート：これは、IPトランスポートポートを指す（例えば、TCPポート番号又はUDPポート番号）。"
    },
    {
      "indent": 3,
      "text": "o IP Port Type: This refers to the IP transport protocol as indicated by the IP transport protocol number. Refer to [ProtocolNumbers].",
      "ja": "IPポートタイプ（O）IPトランスポートプロトコル番号で示されるように、これはIPトランスポートプロトコルを指します。 [ProtocolNumbers]を参照してください。"
    },
    {
      "indent": 3,
      "text": "o IP Port Limit: This denotes the maximum number of IP ports for a specific (or all) IP transport protocol(s) that a device supporting port ranges can use when performing port number mappings for a specific user/host. Note that this limit is usually associated with one or more IPv4/IPv6 addresses.",
      "ja": "O IPポート制限：これは、特定のユーザ/ホストのポート番号のマッピングを行う際にポート範囲をサポートするデバイスが使用できる特定の（またはすべての）IPトランスポートプロトコル（単数または複数）のためのIPポートの最大数を示します。この制限は、通常、1つまたは複数のIPv4 / IPv6アドレスに関連付けられていることに注意してください。"
    },
    {
      "indent": 3,
      "text": "o IP Port Range: This specifies a set of contiguous IP ports indicated by the lowest numerical number and the highest numerical number, inclusively.",
      "ja": "IPポートの範囲○：これは包括的に、最低の数値の数と最高の数値番号で示される連続したIPポートのセットを指定します。"
    },
    {
      "indent": 3,
      "text": "o Internal IP Address: This refers to the IP address that is used by a host as a source IP address in an outbound IP packet sent towards a device supporting port ranges in the internal realm. The internal IP address may be IPv4 or IPv6.",
      "ja": "O内部IPアドレス：これは、ポートは、内部領域の範囲である支持装置に向けて送信されるアウトバウンドIPパケットの送信元IPアドレスとしてホストによって使用されるIPアドレスを指します。内部IPアドレスはIPv4またはIPv6のかもしれません。"
    },
    {
      "indent": 3,
      "text": "o External IP Address: This refers to the IP address that is used as a source IP address in an outbound IP packet after traversing a device supporting port ranges in the external realm. This document assumes that the external IP address is an IPv4 address.",
      "ja": "O外部IPアドレス：これは、ポートは、外部領域の範囲である支持装置を通過した後、アウトバウンドIPパケットの送信元IPアドレスとして使用されるIPアドレスを指します。この文書では、外部IPアドレスがIPv4アドレスであることを前提としています。"
    },
    {
      "indent": 3,
      "text": "o Internal Port: This is an IP transport port that is allocated by a host or application behind an address-sharing device for an outbound IP packet in the internal realm.",
      "ja": "O内部ポート：これは、内部領域におけるアウトバウンドIPパケットのアドレス共有デバイスの背後にあるホストまたはアプリケーションによって割り当てられたIPトランスポート・ポートです。"
    },
    {
      "indent": 3,
      "text": "o External Port: This is an IP transport port that is allocated by an address-sharing device upon receiving an outbound IP packet in the internal realm and is used to replace the internal port that is allocated by a user or application.",
      "ja": "O外部ポート：これは内部領域にアウトバウンドIPパケットを受信すると、アドレス共有デバイスによって割り当てられるIPトランスポートポートであり、ユーザまたはアプリケーションによって割り当てられた内部ポートを置き換えるために使用されます。"
    },
    {
      "indent": 3,
      "text": "o External Realm: This refers to the networking segment where external IP addresses are used as source addresses of outbound packets forwarded by an address-sharing device.",
      "ja": "外部レルム（O）これは、外部IPアドレスがアドレス共有デバイスによって転送アウトバウンドパケットの送信元アドレスとして使用されているネットワークセグメントを指します。"
    },
    {
      "indent": 3,
      "text": "o Internal Realm: This refers to the networking segment that is behind an address-sharing device and where internal IP addresses are used.",
      "ja": "O内部レルム：これは、アドレス共有デバイスと内部IPアドレスが使用されているの背後にあるネットワークセグメントを指します。"
    },
    {
      "indent": 3,
      "text": "o Mapping: This denotes a relationship between an internal IP address, internal port, and protocol, as well as an external IP address, external port, and protocol.",
      "ja": "Oマッピング：これは、内部IPアドレス、内部ポート、およびプロトコル、ならびに外部IPアドレス、外部ポート、およびプロトコルの間の関係を示しています。"
    },
    {
      "indent": 3,
      "text": "o Address-Sharing Device: This is a device that is capable of sharing an IPv4 address among multiple users. A typical example of this device is a CGN, CPE, Provider WLAN gateway, etc.",
      "ja": "Oアドレス共有デバイス：これは、複数のユーザ間でIPv4アドレスを共有することが可能な装置です。このデバイスの典型的な例は、CGN、CPE、プロバイダWLANゲートウェイ等であります"
    },
    {
      "indent": 0,
      "text": "2.1. Requirements Language",
      "section_title": true,
      "ja": "2.1。要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はRFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Extensions of RADIUS Attributes and TLVs",
      "section_title": true,
      "ja": "RADIUS属性とのTLVの3拡張"
    },
    {
      "indent": 3,
      "text": "These three new attributes are defined in the following subsections:",
      "ja": "これらの三つの新しい属性は、以下のサブセクションで定義されています。"
    },
    {
      "indent": 3,
      "text": "1. IP-Port-Limit-Info Attribute",
      "section_title": true,
      "ja": "1. IPポート・リミット・インフォ属性"
    },
    {
      "indent": 3,
      "text": "2. IP-Port-Range Attribute",
      "section_title": true,
      "ja": "2. IP-ポート範囲属性"
    },
    {
      "indent": 3,
      "text": "3. IP-Port-Forwarding-Map Attribute",
      "section_title": true,
      "ja": "3. IPポートフォワーディング - 地図属性"
    },
    {
      "indent": 3,
      "text": "All these attributes are allocated from the RADIUS \"Extended Type\" code space per [RFC6929].",
      "ja": "すべてのこれらの属性は、[RFC6929]あたりのRADIUS「拡張型」のコード空間から割り当てられます。"
    },
    {
      "indent": 3,
      "text": "These attributes and their embedded TLVs (refer to Section 3.2) are defined with globally unique names and follow the guidelines in Section 2.7.1 of [RFC6929].",
      "ja": "これらの属性とその埋め込まれたTLVが（3.2節参照）、グローバルに一意の名前で定義され、[RFC6929]のセクション2.7.1のガイドラインに従っています。"
    },
    {
      "indent": 3,
      "text": "In all the figures describing the RADIUS attributes and TLV formats in the following subsections, the fields are transmitted from left to right.",
      "ja": "以下のサブセクションでRADIUS属性およびTLVフォーマットを説明する全図において、フィールドは、左から右へ送信されます。"
    },
    {
      "indent": 0,
      "text": "3.1. Extended Attributes for IP Ports",
      "section_title": true,
      "ja": "3.1。 IPポートの拡張属性"
    },
    {
      "indent": 0,
      "text": "3.1.1. IP-Port-Limit-Info Attribute",
      "section_title": true,
      "ja": "3.1.1。 IPポート・リミット・インフォ属性"
    },
    {
      "indent": 3,
      "text": "This attribute is of type \"tlv\" as defined in the RADIUS Protocol Extensions [RFC6929]. It contains some sub-attributes, and the requirements are as follows:",
      "ja": "RADIUSプロトコル拡張[RFC6929]で定義されているこの属性は、タイプ「TLV」です。これは、いくつかのサブ属性が含まれており、次のような要件は以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "o The IP-Port-Limit-Info Attribute MAY contain the IP-Port-Type TLV (see Section 3.2.1).",
      "ja": "O IPポート・リミット・インフォ属性は、IPポート型TLV（セクション3.2.1を参照）を含むことができます。"
    },
    {
      "indent": 3,
      "text": "o The IP-Port-Limit-Info Attribute MUST contain the IP-Port-Limit TLV (see Section 3.2.2).",
      "ja": "IPポート・リミット・インフォ属性は、IP-ポートリミットTLVを含まなければならないO（セクション3.2.2を参照してください）。"
    },
    {
      "indent": 3,
      "text": "o The IP-Port-Limit-Info Attribute MAY contain the IP-Port-Ext-IPv4-Addr TLV (see Section 3.2.3).",
      "ja": "O IPポート・リミット・インフォ属性は、IPポート-EXT-のIPv4-ADDR TLV（セクション3.2.3を参照）を含むことができます。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Limit-Info Attribute specifies the maximum number of IP ports, as indicated in IP-Port-Limit TLV, of a specific IP transport protocol, as indicated in IP-Port-Type TLV, and associated with a given IPv4 address, as indicated in IP-Port-Ext-IPv4-Addr TLV, for an end user.",
      "ja": "IPポート型TLVに示されるように、特定のIPトランスポート・プロトコル、IPポートリミットTLVに示され、そして所与のIPv4に関連付けられたとしてIPポートリミット-info属性は、IPポートの最大数を指定しますエンドユーザのために、IPポート-EXT-のIPv4-ADDR TLVに示されているように、アドレス、。"
    },
    {
      "indent": 3,
      "text": "Note that when IP-Port-Type TLV is not included as part of the IP-Port-Limit-Info Attribute, the port limit applies to all IP transport protocols.",
      "ja": "IPポート型TLVは、IPポート・リミット・インフォ属性の一部として含まれていない場合、ポートの制限は、すべてのIPトランスポートプロトコルに適用されることに注意してください。"
    },
    {
      "indent": 3,
      "text": "Note also that when IP-Port-Ext-IPv4-Addr TLV is not included as part of the IP-Port-Limit-Info Attribute, the port limit applies to all the IPv4 addresses managed by the address-sharing device, e.g., a CGN or NAT64 device.",
      "ja": "IPポート-EXT-のIPv4-ADDR TLVがIPポート・リミット・インフォ属性の一部として含まれていない場合、ポートの制限がアドレス共有デバイスによって管理されているすべてのIPv4アドレスに適用されることにも注意してください、例えば、A CGNまたはNAT64デバイス。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Limit-Info Attribute MAY appear in an Access-Accept packet. It MAY also appear in an Access-Request packet as a preferred maximum number of IP ports indicated by the device supporting port ranges co-located with the NAS, e.g., a CGN or NAT64.",
      "ja": "IPポート・リミット・インフォ属性は、接続許可パケットに表示されることがあります。デバイス支持ポートで示されるIPポートの好ましい最大数はNAS、例えば、CGN又はNAT64と共存範囲としてもアクセス要求パケットに現れることがあります。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Limit-Info Attribute MAY appear in a CoA-Request packet.",
      "ja": "IPポート・リミット・インフォ属性のCoA-Requestパケットに表示されることがあります。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Limit-Info Attribute MAY appear in an Accounting-Request packet.",
      "ja": "IPポート・リミット・インフォ属性は、アカウンティング要求パケットに表示されることがあります。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Limit-Info Attribute MUST NOT appear in any other RADIUS packet.",
      "ja": "IPポート・リミット・インフォ属性は、他のRADIUSパケットに現れてはいけません。"
    },
    {
      "indent": 3,
      "text": "The format of the IP-Port-Limit-Info Attribute is shown in Figure 1.",
      "ja": "IPポート・リミット・インフォ属性のフォーマットは、図1に示されています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      Type     |     Length    | Extended-Type |    Value ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 1",
      "ja": "図1"
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "241",
      "ja": "２４１"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "This field indicates the total length in octets of all fields of this attribute, including the Type, Length, Extended-Type, and the entire length of the embedded TLVs.",
      "ja": "このフィールドは、タイプ、長さ、拡張型、および組み込みのTLVの全体の長さを含めて、この属性のすべてのフィールドのオクテットで全体の長さを示します。"
    },
    {
      "indent": 3,
      "text": "Extended-Type",
      "ja": "拡張型"
    },
    {
      "indent": 6,
      "text": "5",
      "ja": "５"
    },
    {
      "indent": 3,
      "text": "Value",
      "ja": "値"
    },
    {
      "indent": 6,
      "text": "This field contains a set of TLVs as follows:",
      "ja": "次のようにこのフィールドは、TLVのセットが含まれています。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Type TLV",
      "ja": "IPポート型TLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains a value that indicates the IP port type. Refer to Section 3.2.1.",
      "ja": "このTLVは、IPポートの種類を示す値が含まれています。 3.2.1項を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Limit TLV",
      "ja": "IPポートリミットTLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains the maximum number of IP ports of a specific IP port type and associated with a given IPv4 address for an end user. This TLV MUST be included in the IP-Port-Limit-Info Attribute. Refer to Section 3.2.2. This limit applies to all mappings that can be instantiated by an underlying address-sharing device without soliciting any external entity. In particular, this limit does not include the ports that are instructed by an Authentication, Authorization, and Accounting (AAA) server.",
      "ja": "このTLVは、特定のIPポート・タイプのIPポートの最大数が含まれており、エンドユーザのために与えられたIPv4アドレスに関連付けられています。このTLVは、IPポート・リミット・インフォ属性に含まれなければなりません。 3.2.2項を参照してください。この制限は、任意の外部エンティティを勧誘することなく、根本的なアドレス共有デバイスによってインスタンス化することができるすべてのマッピングに適用されます。具体的には、この制限は、認証、許可、アカウンティング（AAA）サーバによって指示されたポートを含んでいません。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Ext-IPv4-Addr TLV",
      "ja": "IPポート-EXT-のIPv4-ADDR TLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains the IPv4 address that is associated with the IP port limit contained in the IP-Port-Limit TLV. This TLV is optionally included as part of the IP-Port-Limit-Info Attribute. Refer to Section 3.2.3.",
      "ja": "このTLVは、IPポート・リミットTLVに含まれるIPポート制限に関連付けられているIPv4アドレスが含まれています。このTLVは、必要に応じてIPポート・リミット・インフォ属性の一部として含まれています。 3.2.3項を参照してください。"
    },
    {
      "indent": 3,
      "text": "IP-Port-Limit-Info Attribute is associated with the following identifier: 241.5.",
      "ja": "241.5：IPポート・リミット・インフォ属性は次の識別子に関連付けられています。"
    },
    {
      "indent": 0,
      "text": "3.1.2. IP-Port-Range Attribute",
      "section_title": true,
      "ja": "3.1.2。 IP-ポート範囲属性"
    },
    {
      "indent": 3,
      "text": "This attribute is of type \"tlv\" as defined in the RADIUS Protocol Extensions [RFC6929]. It contains some sub-attributes and the requirement is as follows:",
      "ja": "RADIUSプロトコル拡張[RFC6929]で定義されているこの属性は、タイプ「TLV」です。これは、いくつかのサブ属性が含まれており、次のような要件は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o The IP-Port-Range Attribute MAY contain the IP-Port-Type TLV (see Section 3.2.1).",
      "ja": "IP-ポート範囲属性は、IPポート型TLVを含むかもしれO（3.2.1項を参照してください）。"
    },
    {
      "indent": 3,
      "text": "o The IP-Port-Range Attribute MUST contain the IP-Port-Alloc TLV (see Section 3.2.8).",
      "ja": "IP-ポート範囲属性は、IP-ポートのAlloc TLVを含まなければならないO（3.2.8項を参照してください）。"
    },
    {
      "indent": 3,
      "text": "o For port allocation, the IP-Port-Range Attribute MUST contain both the IP-Port-Range-Start TLV (see Section 3.2.9) and the IP-Port-Range-End TLV (see Section 3.2.10). For port deallocation, the IP-Port-Range Attribute MAY contain both of these two TLVs; if the two TLVs are not included, it implies that all ports that were previously allocated are now all deallocated.",
      "ja": "Oポート割り当てのために、IP-ポート範囲属性は、IPポートレンジスタートTLV（セクション3.2.9を参照）、およびIPポートレンジエンドTLV（セクション3.2.10を参照）の両方を含まなければなりません。ポート割り当て解除のために、IP-ポート範囲属性は、これら二つのTLVの両方を含んでいてもよいです。 2つのTLVが含まれていない場合、それは以前に割り当てられたすべてのポートは今、すべての割り当てが解除されていることを意味します。"
    },
    {
      "indent": 3,
      "text": "o The IP-Port-Range Attribute MAY contain the IP-Port-Ext-IPv4-Addr TLV (see Section 3.2.3).",
      "ja": "O-IPポート範囲属性は、IPポート-EXT-のIPv4-ADDR TLV（セクション3.2.3を参照）を含むことができます。"
    },
    {
      "indent": 3,
      "text": "o The IP-Port-Range Attribute MAY contain the IP-Port-Local-Id TLV (see Section 3.2.11).",
      "ja": "O-IPポート範囲属性は、IPポートローカル-ID TLV（セクション3.2.11を参照）を含むことができます。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Range Attribute contains a range of contiguous IP ports. These ports are either to be allocated or deallocated depending on the Value carried by the IP-Port-Alloc TLV.",
      "ja": "IP-ポート範囲属性は、連続したIPポートの範囲が含まれています。これらのポートは、割り当てられたまたはIPポートのAlloc TLVによって運ばれる値に応じて割り当てを解除することのいずれかです。"
    },
    {
      "indent": 3,
      "text": "If the IP-Port-Type TLV is included as part of the IP-Port-Range Attribute, then the port range is associated with the specific IP transport protocol as specified in the IP-Port-Type TLV, but otherwise it is for all IP transport protocols.",
      "ja": "IPポート型TLVは、IP-ポート範囲属性の一部として含まれている場合、ポート範囲は、IPポート型TLVで指定された特定のIPトランスポートプロトコルに関連付けられていますが、それ以外の場合はすべてのためにありますIPトランスポートプロトコル。"
    },
    {
      "indent": 3,
      "text": "If the IP-Port-Ext-IPv4-Addr TLV is included as part of the IP-Port-Range Attribute, then the port range as specified is associated with the IPv4 address as indicated, but otherwise it is for all IPv4 addresses by the address-sharing device (e.g., a CGN device) for the end user.",
      "ja": "IPポート-EXT-のIPv4-ADDR TLVが示されているように指定されたが、IPv4アドレスに関連付けられているとして、ポート範囲、IP-ポート範囲属性の一部として含まれていますが、それ以外の場合は、すべてのIPv4アドレスのためですされている場合エンドユーザーのためのアドレス共有デバイス（例えば、CGNデバイス）。"
    },
    {
      "indent": 3,
      "text": "This attribute can be used to convey a single IP transport port number: in such case, the Value of the IP-Port-Range-Start TLV and the IP-Port-Range-End TLV, respectively, contain the same port number.",
      "ja": "この属性は、単一のIPトランスポートのポート番号を伝えるために使用することができます。このような場合には、IPポートレンジスタートTLVとIPポートレンジエンドTLVの値は、それぞれ、同じポート番号が含まれています。"
    },
    {
      "indent": 3,
      "text": "The information contained in the IP-Port-Range Attribute is sent to RADIUS server.",
      "ja": "IP-ポート範囲属性に含まれる情報は、RADIUSサーバに送信されます。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Range Attribute MAY appear in an Accounting-Request packet.",
      "ja": "IP-ポート範囲属性は、アカウンティング要求パケットに表示されることがあります。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Range Attribute MUST NOT appear in any other RADIUS packet.",
      "ja": "IP-ポート範囲属性は、他のRADIUSパケットに現れてはいけません。"
    },
    {
      "indent": 3,
      "text": "The format of the IP-Port-Range Attribute is shown in Figure 2.",
      "ja": "IP-ポート範囲属性のフォーマットは、図2に示されています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      Type     |     Length    | Extended-Type |    Value ...\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 2",
      "ja": "図2"
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "241",
      "ja": "２４１"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "This field indicates the total length in octets of all fields of this attribute, including the Type, Length, Extended-Type, and the entire length of the embedded TLVs.",
      "ja": "このフィールドは、タイプ、長さ、拡張型、および組み込みのTLVの全体の長さを含めて、この属性のすべてのフィールドのオクテットで全体の長さを示します。"
    },
    {
      "indent": 3,
      "text": "Extended-Type",
      "ja": "拡張型"
    },
    {
      "indent": 6,
      "text": "6",
      "ja": "６"
    },
    {
      "indent": 3,
      "text": "Value",
      "ja": "値"
    },
    {
      "indent": 6,
      "text": "This field contains a set of TLVs as follows:",
      "ja": "次のようにこのフィールドは、TLVのセットが含まれています。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Type TLV",
      "ja": "IPポート型TLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains a value that indicates the IP port type. Refer to Section 3.2.1.",
      "ja": "このTLVは、IPポートの種類を示す値が含まれています。 3.2.1項を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Alloc TLV",
      "ja": "IP-ポートのAlloc TLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains a flag to indicate the range of the specified IP ports for either allocation or deallocation. This TLV MUST be included as part of the IP-Port-Range Attribute. Refer to Section 3.2.8.",
      "ja": "このTLVは、割り当てまたは割り当て解除のいずれかのために指定されたIPポートの範囲を示すフラグを含んでいます。このTLVは、IP-ポート範囲属性の一部として含まれなければなりません。 3.2.8項を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Range-Start TLV",
      "ja": "IPポートレンジスタートTLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains the smallest port number of a range of contiguous IP ports. To report the port allocation, this TLV MUST be included together with IP-Port-Range-End TLV as part of the IP-Port-Range Attribute. Refer to Section 3.2.9.",
      "ja": "このTLVは、連続したIPポートの範囲の最小ポート番号が含まれています。ポート割り当てを報告するには、このTLVは、IP-ポート範囲属性の一部としてIPポートレンジエンドTLVと一緒に含まれなければなりません。 3.2.9項を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Range-End TLV",
      "ja": "IPポートレンジエンドTLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains the largest port number of a range of contiguous IP ports. To report the port allocation, this TLV MUST be included together with IP-Port-Range-Start TLV as part of the IP-Port-Range Attribute. Refer to Section 3.2.10.",
      "ja": "このTLVは、連続したIPポートの範囲の最大ポート番号が含まれています。ポート割り当てを報告するには、このTLVは、IP-ポート範囲属性の一部としてIPポート・レンジ・スタートTLVと一緒に含まれなければなりません。セクション3.2.10を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Ext-IPv4-Addr TLV",
      "ja": "IPポート-EXT-のIPv4-ADDR TLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains the IPv4 address that is associated with the IP port range, as is collectively indicated in the IP-Port-Range-Start TLV and the IP-Port-Range-End TLV. This TLV is optionally included as part of the IP-Port-Range Attribute. Refer to Section 3.2.3.",
      "ja": "このTLVは、まとめIPポートレンジスタートTLVとIPポートレンジエンドTLVに示されるように、IPポートの範囲に関連付けられているIPv4アドレスが含まれています。このTLVは、必要に応じてIP-ポート範囲属性の一部として含まれています。 3.2.3項を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Local-Id TLV",
      "ja": "IPポートローカル-ID TLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains a local significant identifier at the customer premise, such as the Media Access Control (MAC) address, interface ID, VLAN ID, PPP sessions ID, VPN Routing and Forwarding (VRF) ID, IP address/prefix, etc. This TLV is optionally included as part of the IP-Port-Range Attribute. Refer to Section 3.2.11.",
      "ja": "このTLVは、これなどは、そのようなメディアアクセス制御（MAC）アドレス、インターフェイスID、VLAN ID、PPPセッションのID、VPNルーティングおよび転送（VRF）ID、IPアドレス/プレフィックスとして、顧客宅内で地元の重要な識別子を含みますTLVは、必要に応じてIP-ポート範囲属性の一部として含まれています。 3.2.11項を参照してください。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Range Attribute is associated with the following identifier: 241.6.",
      "ja": "241.6：IP-ポート範囲属性は、次の識別子に関連付けられています。"
    },
    {
      "indent": 0,
      "text": "3.1.3. IP-Port-Forwarding-Map Attribute",
      "section_title": true,
      "ja": "3.1.3。 IPポートフォワーディング - 地図属性"
    },
    {
      "indent": 3,
      "text": "This attribute is of type \"tlv\" as defined in the RADIUS Protocol Extensions [RFC6929]. It contains some sub-attributes and the requirement is as follows:",
      "ja": "RADIUSプロトコル拡張[RFC6929]で定義されているこの属性は、タイプ「TLV」です。これは、いくつかのサブ属性が含まれており、次のような要件は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o The IP-Port-Forwarding-Map Attribute MAY contain the IP-Port-Type TLV (see Section 3.2.1).",
      "ja": "O-IPポート転送 - 地図属性は、IPポート型TLV（セクション3.2.1を参照）を含むことができます。"
    },
    {
      "indent": 3,
      "text": "o The IP-Port-Forwarding-Map Attribute MUST contain both IP-Port-Int-Port TLV (see Section 3.2.6) and the IP-Port-Ext-Port TLV (see Section 3.2.7).",
      "ja": "O-IPポート転送 - 地図属性は、IPポート-INTポートTLV（3.2.6項を参照）、IPポート-EXTポートTLV（セクション3.2.7を参照）の両方を含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "o If the internal realm is with an IPv4 address family, the IP-Port-Forwarding-Map Attribute MUST contain the IP-Port-Int-IPv4-Addr TLV (see Section 3.2.4); if the internal realm is with an IPv6 address family, the IP-Port-Forwarding-Map Attribute MUST contain the IP-Port-Int-IPv6-Addr TLV (see Section 3.2.5).",
      "ja": "内部レルムはIPv4アドレスファミリである場合には、O、IPポート・フォワーディング・マップ属性は、IP-ポートのInt-のIPv4-ADDR TLV（セクション3.2.4を参照）を含まなければなりません。内部レルムは、IPv6アドレスファミリである場合、IPポート・フォワーディング・マップ属性は、IP-ポートのInt-のIPv6-ADDR TLV（セクション3.2.5を参照）を含まなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The IP-Port-Forwarding-Map Attribute MAY contain the IP-Port-Ext-IPv4-Addr TLV (see Section 3.2.3).",
      "ja": "O-IPポート転送 - 地図属性は、IPポート-EXT-のIPv4-ADDR TLV（セクション3.2.3を参照）を含むことができます。"
    },
    {
      "indent": 3,
      "text": "o The IP-Port-Forwarding-Map Attribute MAY contain the IP-Port-Local-Id TLV (see Section 3.2.11).",
      "ja": "O-IPポート転送 - 地図属性は、IPポートローカル-ID TLV（セクション3.2.11を参照）を含むことができます。"
    },
    {
      "indent": 3,
      "text": "The attribute contains a two-octet IP internal port number and a two-octet IP external port number. The internal port number is associated with an internal IPv4 or IPv6 address that MUST always be included. The external port number is associated with a specific external IPv4 address if included, but otherwise it is associated with all external IPv4 addresses for the end user.",
      "ja": "属性が2オクテットIP内部ポート番号と2オクテットのIP外部ポート番号が含まれています。内部ポート番号は常に含まれなければならない内部IPv4またはIPv6アドレスに関連付けられています。外部ポート番号が含まれている場合、特定の外部IPv4アドレスに関連付けられているが、それ以外の場合は、エンドユーザのためのすべての外部IPv4アドレスに関連付けられています。"
    },
    {
      "indent": 3,
      "text": "If the IP-Port-Type TLV is included as part of the IP-Port-Forwarding-Map Attribute, then the port mapping is associated with the specific IP transport protocol as specified in the IP-Port-Type TLV, but otherwise it is for all IP transport protocols.",
      "ja": "IPポート型TLVは、IPポート・フォワーディング・マップ属性の一部として含まれている場合、ポートマッピングは、IPポート型TLVで指定された特定のIPトランスポートプロトコルに関連付けられていますが、それ以外の場合は、すべてのIPトランスポートプロトコルのため。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Forwarding-Map Attribute MAY appear in an Access-Accept packet. It MAY also appear in an Access-Request packet to indicate a preferred port mapping by the device co-located with NAS. However, the server is not required to honor such a preference.",
      "ja": "IPポート・フォワーディング・マップ属性は、接続許可パケットに表示されることがあります。また、NASと同じ場所にデバイスによって優先ポートマッピングを示すためのAccess-Requestパケットに表示されることがあります。ただし、サーバーは、そのような好みを尊重する必要はありません。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Forwarding-Map Attribute MAY appear in a CoA-Request packet.",
      "ja": "IPポート・フォワーディング・マップ属性のCoA-Requestパケットに表示されることがあります。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Forwarding-Map Attribute MAY also appear in an Accounting-Request packet.",
      "ja": "IPポート・フォワーディング・マップ属性もアカウンティング要求パケットに表示されることがあります。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Forwarding-Map Attribute MUST NOT appear in any other RADIUS packet.",
      "ja": "IPポート・フォワーディング・マップ属性は、他のRADIUSパケットに現れてはいけません。"
    },
    {
      "indent": 3,
      "text": "The format of the IP-Port-Forwarding-Map Attribute is shown in Figure 3.",
      "ja": "IPポート・フォワーディング・マップ属性の形式は、図3に示されています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|      Type     |     Length    | Extended-Type |    Value ....\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 3",
      "ja": "図3"
    },
    {
      "indent": 3,
      "text": "Type",
      "ja": "タイプ"
    },
    {
      "indent": 6,
      "text": "241",
      "ja": "２４１"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "This field indicates the total length in octets of all fields of this attribute, including the Type, Length, Extended-Type, and the entire length of the embedded TLVs.",
      "ja": "このフィールドは、タイプ、長さ、拡張型、および組み込みのTLVの全体の長さを含めて、この属性のすべてのフィールドのオクテットで全体の長さを示します。"
    },
    {
      "indent": 3,
      "text": "Extended-Type",
      "ja": "拡張型"
    },
    {
      "indent": 6,
      "text": "7",
      "ja": "７"
    },
    {
      "indent": 3,
      "text": "Value",
      "ja": "値"
    },
    {
      "indent": 6,
      "text": "This field contains a set of TLVs as follows:",
      "ja": "次のようにこのフィールドは、TLVのセットが含まれています。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Type TLV",
      "ja": "IPポート型TLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains a value that indicates the IP port type. Refer to Section 3.2.1.",
      "ja": "このTLVは、IPポートの種類を示す値が含まれています。 3.2.1項を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Int-Port TLV",
      "ja": "IPポート-INTポートTLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains an internal IP port number associated with an internal IPv4 or IPv6 address. This TLV MUST be included together with IP-Port-Ext-Port TLV as part of the IP-Port-Forwarding-Map Attribute. Refer to Section 3.2.6.",
      "ja": "このTLVは、内部のIPv4またはIPv6アドレスに関連付けられた内部IPポート番号が含まれています。このTLVは、IPポート・フォワーディング・マップ属性の一部としてIPポート-EXTポートTLVと一緒に含まれなければなりません。 3.2.6項を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Ext-Port TLV",
      "ja": "IPポート-EXTポートTLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains an external IP port number associated with an external IPv4 address. This TLV MUST be included together with IP-Port-Int-Port TLV as part of the IP-Port-Forwarding-Map Attribute. Refer to Section 3.2.7.",
      "ja": "このTLVは、外部のIPv4アドレスに関連付けられた外部IPのポート番号が含まれています。このTLVは、IPポート・フォワーディング・マップ属性の一部としてIPポート-INT-ポートTLVと一緒に含まれなければなりません。セクション3.2.7を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Int-IPv4-Addr TLV",
      "ja": "IPポート-INT-のIPv4-ADDR TLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains an IPv4 address that is associated with the internal IP port number contained in the IP-Port-Int-Port TLV. For the internal realm with an IPv4 address family, this TLV MUST be included as part of the IP-Port-Forwarding-Map Attribute. Refer to Section 3.2.4.",
      "ja": "このTLVは、IPポート-INTポートTLVに含まれる内部IPのポート番号に関連付けられているIPv4アドレスが含まれています。 IPv4アドレスファミリを持つ内部領域では、このTLVは、IPポート・フォワーディング・マップ属性の一部として含まれなければなりません。 3.2.4項を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Int-IPv6-Addr TLV",
      "ja": "IPポート-INT-のIPv6-ADDR TLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains an IPv6 address that is associated with the internal IP port number contained in the IP-Port-Int-Port TLV. For the internal realm with an IPv6 address family, this TLV MUST be included as part of the IP-Port-Forwarding-Map Attribute. Refer to Section 3.2.5.",
      "ja": "このTLVは、IPポート-INTポートTLVに含まれる内部IPのポート番号に関連付けられているIPv6アドレスが含まれています。 IPv6アドレスファミリを持つ内部領域では、このTLVは、IPポート・フォワーディング・マップ属性の一部として含まれなければなりません。 3.2.5項を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Ext-IPv4-Addr TLV",
      "ja": "IPポート-EXT-のIPv4-ADDR TLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains an IPv4 address that is associated with the external IP port number contained in the IP-Port-Ext-Port TLV. This TLV MAY be included as part of the IP-Port-Forwarding-Map Attribute. Refer to Section 3.2.3.",
      "ja": "このTLVは、IPポート-EXTポートTLVに含まれる外部IPポート番号に関連付けられているIPv4アドレスが含まれています。このTLVは、IPポート・フォワーディング・マップ属性の一部として含まれてもよいです。 3.2.3項を参照してください。"
    },
    {
      "indent": 6,
      "text": "IP-Port-Local-Id TLV",
      "ja": "IPポートローカル-ID TLV"
    },
    {
      "indent": 9,
      "text": "This TLV contains a local significant identifier at the customer premise, such as MAC address, interface ID, VLAN ID, PPP sessions ID, VRF ID, IP address/prefix, etc. This TLV is optionally included as part of the IP-Port-Forwarding-Map Attribute. Refer to Section 3.2.11.",
      "ja": "このTLVは、このTLVは、必要に応じてIP-ポート - の一部として含まれているローカル重要識別子顧客構内で、MACアドレスのような、インタフェースID、VLAN ID、PPPセッションのID、VRF ID、IPアドレス/プレフィックス、等が含まれてい転送-Mapの属性。 3.2.11項を参照してください。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Forwarding-Map Attribute is associated with the following identifier: 241.7.",
      "ja": "241.7：IP-ポート転送 - 地図属性は次の識別子に関連付けられています。"
    },
    {
      "indent": 0,
      "text": "3.2. RADIUS TLVs for IP Ports",
      "section_title": true,
      "ja": "3.2。 IPポートのRADIUSのTLV"
    },
    {
      "indent": 3,
      "text": "The TLVs that are included in the three attributes (see Section 3.1) are defined in the following subsections. These TLVs use the format defined in [RFC6929]. As the three attributes carry similar data, we have defined a common set of TLVs that are used for all three attributes. That is, the TLVs have the same name and number when encapsulated in any one of the three parent attributes. See Sections 3.1.1, 3.1.2, and 3.1.3 for a list of which TLV is permitted within which parent attribute.",
      "ja": "3つの属性（3.1節を参照）に含まれているのTLVは以下のサブセクションで定義されています。これらのTLVは、[RFC6929]で定義されたフォーマットを使用します。 3つの属性は、同様のデータを運ぶように、我々はすべての3つの属性のために使用されているのTLVの共通セットを定義しました。それはのTLVは、3つの親の属性のいずれかにカプセル化された同じ名前と番号を持っている、です。 TLVは、その親の属性の中に許可されているリストについては、セクション3.1.1、3.1.2、および3.1.3を参照してください。"
    },
    {
      "indent": 3,
      "text": "The encoding of the Value field of these TLVs follows the recommendation of [RFC6158]. In particular, IP-Port-Type, IP-Port-Limit, IP-Port-Int-Port, IP-Port-Ext-Port, IP-Port-Alloc, IP-Port-Range-Start, and IP-Port-Range-End TLVs are encoded in 32 bits as per the recommendation in Appendix A.2.1 of [RFC6158].",
      "ja": "これらのTLVの値フィールドの符号化は、[RFC6158]の推薦に従います。具体的には、IPポート型、IP-ポート制限、IPポート-INTポート、IPポート-EXTポート、IP-ポートのAlloc、IPポート・レンジ・スタート、およびIP-ポート - 範囲エンドのTLVは、[RFC6158]の付録A.2.1で推奨に従って32ビットで符号化されます。"
    },
    {
      "indent": 0,
      "text": "3.2.1. IP-Port-Type TLV",
      "section_title": true,
      "ja": "3.2.1。 IPポート型TLV"
    },
    {
      "indent": 3,
      "text": "The format of IP-Port-Type TLV is shown in Figure 4. This attribute carries the IP transport protocol number defined by IANA (refer to [ProtocolNumbers]).",
      "ja": "IPポート型TLVのフォーマットは、図4に示されているこの属性はIANAによって定義されたIPトランスポートプロトコル番号（[ProtocolNumbers]を参照）を運びます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   TLV-Type    |     Length    |        Protocol-Number\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n        Protocol-Number         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 4",
      "ja": "図4"
    },
    {
      "indent": 3,
      "text": "TLV-Type",
      "ja": "TLV-タイプ"
    },
    {
      "indent": 6,
      "text": "1",
      "ja": "１"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "Six octets",
      "ja": "6つのバイト"
    },
    {
      "indent": 3,
      "text": "Protocol-Number",
      "ja": "プロトコル番号"
    },
    {
      "indent": 6,
      "text": "Integer. This field contains the data (unsigned8) of the protocol number defined in [ProtocolNumbers], right justified, and the unused bits in this field MUST be set to zero. Protocols that do not use a port number (e.g., the Resource Reservation Protocol (RSVP) or IP Encapsulating Security Payload (ESP)) MUST NOT be included in the IP-Port-Type TLV.",
      "ja": "整数。このフィールドは右揃え、[ProtocolNumbers]で定義されたプロトコル番号のデータ（UNSIGNED8）が含まれ、このフィールド内の未使用のビットはゼロに設定しなければなりません。ポート番号（例えば、リソース予約プロトコル（RSVP）またはIPカプセル化セキュリティペイロード（ESP））は、IPポート型TLVに含まれてはいけません使用していないプロトコル。"
    },
    {
      "indent": 3,
      "text": "IP-Port-Type TLV MAY be included in the following attributes:",
      "ja": "IPポート型TLVは次の属性に含まれることがあります。"
    },
    {
      "indent": 3,
      "text": "o IP-Port-Limit-Info Attribute, identified as 241.5.1 (see Section 3.1.1)",
      "ja": "O IPポート・リミット・インフォ属性は、241.5.1として識別（3.1.1項を参照してください）"
    },
    {
      "indent": 3,
      "text": "o IP-Port-Range Attribute, identified as 241.6.1 (see Section 3.1.2)",
      "ja": "241.6.1として特定O-IPポート範囲属性、（セクション3.1.2を参照してください）"
    },
    {
      "indent": 3,
      "text": "o IP-Port-Forwarding-Map Attribute, identified as 241.7.1 (see Section 3.1.3)",
      "ja": "O-IPポート転送 - 地図属性は、241.7.1として識別（3.1.3項を参照してください）"
    },
    {
      "indent": 3,
      "text": "When the IP-Port-Type TLV is included within a RADIUS attribute, the associated attribute is applied to the IP transport protocol as indicated by the Protocol-Number only, such as TCP, UDP, SCTP, DCCP, etc.",
      "ja": "IPポート型TLVがRADIUS属性内に含まれている場合など、TCP、UDP、SCTP、DCCP、としてのみプロトコル番号で示されるように、関連付けられた属性は、IPトランスポート・プロトコルに適用されます"
    },
    {
      "indent": 0,
      "text": "3.2.2. IP-Port-Limit TLV",
      "section_title": true,
      "ja": "3.2.2。 IPポートリミットTLV"
    },
    {
      "indent": 3,
      "text": "The format of IP-Port-Limit TLV is shown in Figure 5. This attribute carries IPFIX Information Element 458, \"sourceTransportPortsLimit\", which indicates the maximum number of IP transport ports as a limit for an end user to use that is associated with one or more IPv4 or IPv6 addresses.",
      "ja": "IPポートリミットTLVのフォーマットは、この属性はIPFIX情報要素458を担持図5に示され、それを使用するエンドユーザーのための限界としてIPトランスポートポートの最大数を示す「sourceTransportPortsLimit」は、1つに関連付けられます以上のIPv4またはIPv6アドレス。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   TLV-Type    |     Length    |    sourceTransportPortsLimit\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n     sourceTransportPortsLimit  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 5",
      "ja": "図5"
    },
    {
      "indent": 3,
      "text": "TLV-Type",
      "ja": "TLV-タイプ"
    },
    {
      "indent": 6,
      "text": "2",
      "ja": "２"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "Six octets",
      "ja": "6つのバイト"
    },
    {
      "indent": 3,
      "text": "sourceTransportPortsLimit",
      "ja": "sourceTransportPortsLimit"
    },
    {
      "indent": 6,
      "text": "Integer. This field contains the data (unsigned16) of sourceTransportPortsLimit (458) defined in IPFIX, right justified, and the unused bits in this field MUST be set to zero.",
      "ja": "整数。このフィールドは、データ（UNSIGNED16）sourceTransportPortsLimitの（458）右詰めIPFIX、で定義され、このフィールド内の未使用のビットはゼロに設定しなければなりませんが含まれています。"
    },
    {
      "indent": 3,
      "text": "IP-Port-Limit TLV MUST be included as part of the IP-Port-Limit-Info Attribute (refer to Section 3.1.1), identified as 241.5.2.",
      "ja": "IPポートリミットTLVは、（3.1.1項参照）IPポート・リミット・インフォ属性の一部として含ま241.5.2として識別されなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.2.3. IP-Port-Ext-IPv4-Addr TLV",
      "section_title": true,
      "ja": "3.2.3。 IPポート-EXT-のIPv4-ADDR TLV"
    },
    {
      "indent": 3,
      "text": "The format of IP-Port-Ext-IPv4-Addr TLV is shown in Figure 6. This attribute carries IPFIX Information Element 225, \"postNATSourceIPv4Address\", which is the IPv4 source address after NAT operation (refer to [IPFIX]).",
      "ja": "IPポート-EXT-のIPv4-ADDR TLVのフォーマットは、この属性はIPFIX情報要素225を担持図6に示され、NAT動作後のIPv4ソースアドレスである「postNATSourceIPv4Address」は、（[IPFIX]を参照します）。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   TLV-Type    |    Length     |    postNATSourceIPv4Address\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n     postNATSourceIPv4Address   |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 6",
      "ja": "図6"
    },
    {
      "indent": 3,
      "text": "TLV-Type",
      "ja": "TLV-タイプ"
    },
    {
      "indent": 6,
      "text": "3",
      "ja": "３"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "Six octets",
      "ja": "6つのバイト"
    },
    {
      "indent": 3,
      "text": "postNATSourceIPv4Address",
      "ja": "postNATSourceIPv4Address"
    },
    {
      "indent": 6,
      "text": "Integer. This field contains the data (ipv4Address) of postNATSourceIPv4Address (225) defined in IPFIX.",
      "ja": "整数。このフィールドは、IPFIXで定義されたデータpostNATSourceIPv4Address（225）の（IPv4Addressを）を含みます。"
    },
    {
      "indent": 3,
      "text": "IP-Port-Ext-IPv4-Addr TLV MAY be included in the following attributes:",
      "ja": "IPポート-EXT-のIPv4-ADDR TLVは次の属性に含まれることがあります。"
    },
    {
      "indent": 3,
      "text": "o IP-Port-Limit-Info Attribute, identified as 241.5.3 (see Section 3.1.1)",
      "ja": "O IPポート・リミット・インフォ属性は、241.5.3として識別（3.1.1項を参照してください）"
    },
    {
      "indent": 3,
      "text": "o IP-Port-Range Attribute, identified as 241.6.3 (see Section 3.1.2)",
      "ja": "241.6.3として特定O-IPポート範囲属性、（セクション3.1.2を参照してください）"
    },
    {
      "indent": 3,
      "text": "o IP-Port-Forwarding-Mapping Attribute, identified as 241.7.3 (see Section 3.1.3)",
      "ja": "O-IPポート転送 - マッピング属性は、241.7.3として識別（3.1.3項を参照してください）"
    },
    {
      "indent": 0,
      "text": "3.2.4. IP-Port-Int-IPv4-Addr TLV",
      "section_title": true,
      "ja": "3.2.4。 IPポート-INT-のIPv4-ADDR TLV"
    },
    {
      "indent": 3,
      "text": "The format of IP-Port-Int-IPv4 TLV is shown in Figure 7. This attribute carries IPFIX Information Element 8, \"sourceIPv4Address\", which is the IPv4 source address before NAT operation (refer to [IPFIX]).",
      "ja": "IPポート-INT-IPv4のTLVのフォーマットは、この属性はIPFIX情報エレメント8を担持図7に示され、NAT動作前IPv4ソースアドレスである「sourceIPv4Address」は、（[IPFIX]を参照します）。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   TLV-Type    |     Length    |       sourceIPv4Address\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n      sourceIPv4Address         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 7",
      "ja": "図7"
    },
    {
      "indent": 3,
      "text": "TLV-Type",
      "ja": "TLV-タイプ"
    },
    {
      "indent": 6,
      "text": "4",
      "ja": "４"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "Six octets",
      "ja": "6つのバイト"
    },
    {
      "indent": 3,
      "text": "sourceIPv4Address",
      "ja": "sourceIPv4Address"
    },
    {
      "indent": 6,
      "text": "Integer. This field contains the data (ipv4Address) of sourceIPv4Address (8) defined in IPFIX.",
      "ja": "整数。このフィールドは、IPFIXに定義されたデータsourceIPv4Addressの（IPv4Addressを）（8）を含みます。"
    },
    {
      "indent": 3,
      "text": "If the internal realm is with an IPv4 address family, the IP-Port-Int-IPv4-Addr TLV MUST be included as part of the IP-Port-Forwarding-Map Attribute (refer to Section 3.1.3), identified as 241.7.4.",
      "ja": "内部レルムはIPv4アドレスファミリである場合は、IP-ポートのInt-のIPv4-ADDR TLVは、（3.1.3項参照）IPポート・フォワーディング・マップ属性の一部として含ま241.7として識別されなければなりません。 4。"
    },
    {
      "indent": 0,
      "text": "3.2.5. IP-Port-Int-IPv6-Addr TLV",
      "section_title": true,
      "ja": "3.2.5。 IPポート-INT-のIPv6-ADDR TLV"
    },
    {
      "indent": 3,
      "text": "The format of IP-Port-Int-IPv6-Addr TLV is shown in Figure 8. This attribute carries IPFIX Information Element 27, \"sourceIPv6Address\", which is the IPv6 source address before NAT operation (refer to [IPFIX]).",
      "ja": "IPポート-INT-のIPv6-ADDR TLVのフォーマットは、この属性は、IPFIX情報要素27、NAT動作前のIPv6ソースアドレスである「sourceIPv6Address」は、（[IPFIX]を参照）を担持図8に示されています。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|   TLV-Type    |     Length    |        sourceIPv6Address\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                          sourceIPv6Address\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                          sourceIPv6Address\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n                          sourceIPv6Address\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n        sourceIPv6Address       |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 8",
      "ja": "図8"
    },
    {
      "indent": 3,
      "text": "TLV-Type",
      "ja": "TLV-タイプ"
    },
    {
      "indent": 6,
      "text": "5",
      "ja": "５"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "Eighteen octets",
      "ja": "エイティーンオクテット"
    },
    {
      "indent": 3,
      "text": "sourceIPv6Address",
      "ja": "sourceIPv6Address"
    },
    {
      "indent": 6,
      "text": "IPv6 address (128 bits). This field contains the data (ipv6Address) of sourceIPv6Address (27) defined in IPFIX.",
      "ja": "IPv6アドレス（128ビット）。このフィールドは、IPFIXで定義されたデータsourceIPv6Address（27）の（ipv6Address）を含みます。"
    },
    {
      "indent": 3,
      "text": "If the internal realm is with an IPv6 address family, the IP-Port-Int-IPv6-Addr TLV MUST be included as part of the IP-Port-Forwarding-Map Attribute (refer to Section 3.1.3), identified as 241.7.5.",
      "ja": "内部レルムは、IPv6アドレスファミリである場合は、IP-ポートのInt-のIPv6-ADDR TLVは、（3.1.3項参照）IPポート・フォワーディング・マップ属性の一部として含ま241.7として識別されなければなりません。 5。"
    },
    {
      "indent": 0,
      "text": "3.2.6. IP-Port-Int-Port TLV",
      "section_title": true,
      "ja": "3.2.6。 IPポート-INTポートTLV"
    },
    {
      "indent": 3,
      "text": "The format of IP-Port-Int-Port TLV is shown in Figure 9. This attribute carries IPFIX Information Element 7, \"sourceTransportPort\", which is the source transport number associated with an internal IPv4 or IPv6 address (refer to [IPFIX]).",
      "ja": "IPポート-INTポートTLVのフォーマットは、この属性はIPFIX情報エレメント7を搬送する図9に示されている、内部IPv4またはIPv6アドレスに関連付けられたソーストランスポート番号である「sourceTransportPort」、（を参照[IPFIX]） 。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    TLV-Type   |     Length    |      sourceTransportPort\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n        sourceTransportPort     |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 9",
      "ja": "図9"
    },
    {
      "indent": 3,
      "text": "TLV-Type",
      "ja": "TLV-タイプ"
    },
    {
      "indent": 6,
      "text": "6",
      "ja": "６"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "Six octets",
      "ja": "6つのバイト"
    },
    {
      "indent": 3,
      "text": "sourceTransportPort",
      "ja": "sourceTransportPort"
    },
    {
      "indent": 6,
      "text": "Integer. This field contains the data (unsigned16) of sourceTransportPort (7) defined in IPFIX, right justified, and unused bits MUST be set to zero.",
      "ja": "整数。このフィールドはsourceTransportPortの（UNSIGNED16）データ（7）右詰め、IPFIXに定義され、そして未使用のビットはゼロに設定しなければなりませんが含まれています。"
    },
    {
      "indent": 3,
      "text": "IP-Port-Int-Port TLV MUST be included as part of the IP-Port-Forwarding-Map Attribute (refer to Section 3.1.3), identified as 241.7.6.",
      "ja": "IPポート-INTポートTLVは241.7.6として特定IPポート・フォワーディング・マップ属性（3.1.3項を参照）の一部として含まれなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.2.7. IP-Port-Ext-Port TLV",
      "section_title": true,
      "ja": "3.2.7。 IPポート-EXTポートTLV"
    },
    {
      "indent": 3,
      "text": "The format of IP-Port-Ext-Port TLV is shown in Figure 10. This attribute carries IPFIX Information Element 227, \"postNAPTSourceTransportPort\", which is the transport number associated with an external IPv4 address (refer to [IPFIX]).",
      "ja": "IPポート-EXTポートTLVのフォーマットは、この属性はIPFIX情報要素227を担持図10に示されている、外部のIPv4アドレスに関連付けられたトランスポート番号である「postNAPTSourceTransportPort」は、（[IPFIX]を参照します）。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    TLV-Type   |     Length    |  postNAPTSourceTransportPort\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n   postNAPTSourceTransportPort  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 10",
      "ja": "図10"
    },
    {
      "indent": 3,
      "text": "TLV-Type",
      "ja": "TLV-タイプ"
    },
    {
      "indent": 6,
      "text": "7",
      "ja": "７"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "Six octets",
      "ja": "6つのバイト"
    },
    {
      "indent": 3,
      "text": "postNAPTSourceTransportPort",
      "ja": "postNAPTSourceTransportPort"
    },
    {
      "indent": 6,
      "text": "Integer. This field contains the data (unsigned16) of postNAPTSourceTransportPort (227) defined in IPFIX, right justified, and unused bits MUST be set to zero.",
      "ja": "整数。このフィールドは、データ（UNSIGNED16）postNAPTSourceTransportPortの（227）、IPFIXに定義されて右詰め、未使用のビットはゼロに設定しなければなりませんが含まれています。"
    },
    {
      "indent": 3,
      "text": "IP-Port-Ext-Port TLV MUST be included as part of the IP-Port-Forwarding-Map Attribute (refer to Section 3.1.3), identified as 241.7.7.",
      "ja": "IPポート-EXTポートTLVは241.7.7として特定IPポート・フォワーディング・マップ属性（3.1.3項を参照）の一部として含まれなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.2.8. IP-Port-Alloc TLV",
      "section_title": true,
      "ja": "3.2.8。 IP-ポートのAlloc TLV"
    },
    {
      "indent": 3,
      "text": "The format of IP-Port-Alloc TLV is shown in Figure 11. This attribute carries IPFIX Information Element 230, \"natEvent\", which is a flag to indicate an action of NAT operation (refer to [IPFIX]).",
      "ja": "IP-ポートのAlloc TLVのフォーマットは、この属性はIPFIX情報要素230を担持図11に示され、NAT動作の作用を示すフラグである「natEvent」は、（[IPFIX]を参照します）。"
    },
    {
      "indent": 3,
      "text": "When the value of natEvent is \"1\" (Create event), it means to allocate a range of transport ports; when the value is \"2\", it means to deallocate a range of transports ports. For the purpose of this TLV, no other value is used.",
      "ja": "natEventの値が（イベントの作成）が「1」である場合、それはトランスポートポートの範囲を割り当てることを意味します。値が「2」である場合、それはトランスポートポートの範囲を解放することを意味します。このTLVの目的のために、他の値が使用されていません。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    TLV-Type   |     Length    |            natEvent\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n            natEvent            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 11",
      "ja": "図11"
    },
    {
      "indent": 3,
      "text": "TLV-Type",
      "ja": "TLV-タイプ"
    },
    {
      "indent": 6,
      "text": "8",
      "ja": "８"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "Six octets",
      "ja": "6つのバイト"
    },
    {
      "indent": 3,
      "text": "natEvent",
      "ja": "natEvent"
    },
    {
      "indent": 6,
      "text": "Integer. This field contains the data (unsigned8) of natEvent (230) defined in IPFIX, right justified, and unused bits MUST be set to zero. It indicates the allocation or deallocation of a range of IP ports as follows:",
      "ja": "整数。このフィールドはnatEvent（230）の（UNSIGNED8）データ右正当化、IPFIXに定義され、そして未使用のビットはゼロに設定しなければなりませんが含まれています。以下のようにIPポートの範囲の割り当てまたは割り当て解除を示します。"
    },
    {
      "indent": 9,
      "text": "0: Reserved 1: Allocation 2: Deallocation",
      "ja": "0：予約済み1：アロケーション2：割り当て解除"
    },
    {
      "indent": 3,
      "text": "IP-Port-Alloc TLV MUST be included as part of the IP-Port-Range Attribute (refer to Section 3.1.2), identified as 241.6.8.",
      "ja": "IP-ポートのAlloc TLVは、（セクション3.1.2参照）IP-ポート範囲属性の一部として含ま241.6.8として識別されなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.2.9. IP-Port-Range-Start TLV",
      "section_title": true,
      "ja": "3.2.9。 IPポートレンジスタートTLV"
    },
    {
      "indent": 3,
      "text": "The format of IP-Port-Range-Start TLV is shown in Figure 12. This attribute carries IPFIX Information Element 361, \"portRangeStart\", which is the smallest port number of a range of contiguous transport ports (refer to [IPFIX]).",
      "ja": "IPポートレンジスタートTLVのフォーマットは、この属性はIPFIX情報要素361を担持図12に示されている、連続搬送ポートの範囲の最小ポート番号「portRangeStart」は、（[IPFIX]を参照します）。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    TLV-Type   |     Length    |         portRangeStart\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n          portRangeStart        |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 12",
      "ja": "図12"
    },
    {
      "indent": 3,
      "text": "TLV-Type",
      "ja": "TLV-タイプ"
    },
    {
      "indent": 6,
      "text": "9",
      "ja": "９"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "Six octets",
      "ja": "6つのバイト"
    },
    {
      "indent": 3,
      "text": "portRangeStart",
      "ja": "portRangeStart"
    },
    {
      "indent": 6,
      "text": "Integer. This field contains the data (unsigned16) of portRangeStart (361) defined in IPFIX, right justified, and unused bits MUST be set to zero.",
      "ja": "整数。このフィールドは、データ（UNSIGNED16）portRangeStartの（361）、IPFIXに定義されて右詰め、未使用のビットはゼロに設定しなければなりませんが含まれています。"
    },
    {
      "indent": 3,
      "text": "IP-Port-Range-Start TLV is included as part of the IP-Port-Range Attribute (refer to Section 3.1.2), identified as 241.6.9.",
      "ja": "IPポート・レンジ・スタートTLVは、（セクション3.1.2参照）IP-ポート範囲属性の一部として含ま241.6.9として識別されます。"
    },
    {
      "indent": 0,
      "text": "3.2.10. IP-Port-Range-End TLV",
      "section_title": true,
      "ja": "3.2.10。 IPポートレンジエンドTLV"
    },
    {
      "indent": 3,
      "text": "The format of IP-Port-Range-End TLV is shown in Figure 13. This attribute carries IPFIX Information Element 362, \"portRangeEnd\", which is the largest port number of a range of contiguous transport ports (refer to [IPFIX]).",
      "ja": "IPポートレンジエンドTLVのフォーマットは、この属性はIPFIX情報要素362を担持図13に示されている、連続搬送ポートの範囲の最大ポート番号「portRangeEnd」は、（[IPFIX]を参照します）。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    TLV-Type   |     Length    |          portRangeEnd\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n           portRangeEnd         |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 13",
      "ja": "図13"
    },
    {
      "indent": 3,
      "text": "TLV-Type",
      "ja": "TLV-タイプ"
    },
    {
      "indent": 6,
      "text": "10",
      "ja": "１０"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "Six octets",
      "ja": "6つのバイト"
    },
    {
      "indent": 3,
      "text": "portRangeEnd",
      "ja": "portRangeEnd"
    },
    {
      "indent": 6,
      "text": "Integer. This field contains the data (unsigned16) of portRangeEnd (362) defined in IPFIX, right justified, and unused bits MUST be set to zero.",
      "ja": "整数。このフィールドは、データ（UNSIGNED16）portRangeEndの（362）、IPFIXに定義されて右詰め、未使用のビットはゼロに設定しなければなりませんが含まれています。"
    },
    {
      "indent": 3,
      "text": "IP-Port-Range-End TLV is included as part of the IP-Port-Range Attribute (refer to Section 3.1.2), identified as 241.6.10.",
      "ja": "IPポートレンジエンドTLVは、（セクション3.1.2参照）IP-ポート範囲属性の一部として含ま241.6.10として識別されます。"
    },
    {
      "indent": 0,
      "text": "3.2.11. IP-Port-Local-Id TLV",
      "section_title": true,
      "ja": "3.2.11。 IPポートローカル-ID TLV"
    },
    {
      "indent": 3,
      "text": "The format of IP-Port-Local-Id TLV is shown in Figure 14. This attribute carries a string called \"localID\", which is a local significant identifier as explained below.",
      "ja": "IPポートローカル-ID TLVのフォーマットは、この属性は、以下に説明するように、ローカル重要な識別子である「LOCALID」と呼ばれる文字列を、担持図14に示されています。"
    },
    {
      "indent": 3,
      "text": "The primary issue addressed by this TLV is that there are CGN deployments that do not distinguish internal hosts by their internal IP address alone but use further identifiers for unique subscriber identification. For example, this is the case if a CGN supports overlapping private or shared IP address spaces (as described in [RFC1918] and [RFC6598]) for internal hosts of different subscribers. In such cases, different internal hosts are identified and mapped at the CGN by their IP address and/or another identifier, for example, the identifier of a tunnel between the CGN and the subscriber. In these scenarios (and similar ones), the internal IP address is not sufficient to demultiplex connections from internal hosts. An additional identifier needs to be present in the IP-Port-Range Attribute and IP-Port-Forwarding-Mapping Attribute in order to uniquely identify an internal host. The IP-Port-Local-Id TLV is used to carry this identifier.",
      "ja": "このTLVによって対処主な問題だけでは自分の内部IPアドレスによって内部ホストを区別なく、独自の加入者識別のための更なる識別子を使用していないCGNの展開があるということです。 CGNが重複プライベートまたは共有のIPアドレス空間をサポートする場合、例えば、これは、異なる加入者の内部ホストに対して（[RFC1918]及び[RFC6598]に記載されているように）場合です。例えば、このような場合には、異なる内部ホストが識別され、それらのIPアドレス及び/又は他の識別子によってCGNにマッピングされ、CGNと加入者との間のトンネルの識別子。これらのシナリオ（および同様のもの）においては、内部IPアドレスは、内部ホストからの接続を分離するのに十分ではありません。付加的な識別子は、内部ホストを識別するためにIPポートレンジ項目とIPポートフォワーディング・マッピング属性に存在する必要があります。 IPポートローカル-ID TLVは、この識別子を運ぶために使用されます。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|    TLV-Type   |     Length    |        localID ....\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 33,
      "text": "Figure 14",
      "ja": "図14"
    },
    {
      "indent": 3,
      "text": "TLV-Type",
      "ja": "TLV-タイプ"
    },
    {
      "indent": 6,
      "text": "11",
      "ja": "１１"
    },
    {
      "indent": 3,
      "text": "Length",
      "ja": "長さ"
    },
    {
      "indent": 6,
      "text": "Variable number of octets",
      "ja": "オクテットの可変数"
    },
    {
      "indent": 3,
      "text": "localID",
      "ja": "LOCALID"
    },
    {
      "indent": 6,
      "text": "String. The data type of this field is string (refer to [RFC8044]). This field contains the data that is a local significant identifier at the customer premise, such as MAC address, interface ID, VLAN ID, PPP sessions ID, VRF ID, IP address/prefix, or another local significant identifier.",
      "ja": "文字列。このフィールドのデータ型が文字列である（[RFC8044]参照）。このフィールドには、MACアドレス、インターフェイスID、VLAN ID、PPPセッションのID、VRF ID、IPアドレス/プレフィックス、または別のローカルの重要な識別子として顧客宅内でのローカル重要な識別子で、あるデータが含まれています。"
    },
    {
      "indent": 3,
      "text": "IP-Port-Local-Id TLV MAY be included in the following Attributes if it is necessary to identify the subscriber:",
      "ja": "加入者を特定する必要がある場合は、IP-ポートローカル-ID TLVは次の属性に含まれることがあります。"
    },
    {
      "indent": 3,
      "text": "o IP-Port-Range Attribute, identified as 241.6.11 (see Section 3.1.2)",
      "ja": "241.6.11として特定O-IPポート範囲属性、（セクション3.1.2を参照してください）"
    },
    {
      "indent": 3,
      "text": "o IP-Port-Forwarding-Mapping Attribute, identified as 241.7.11 (see Section 3.1.3)",
      "ja": "241.7.11として特定O-IPポート転送 - マッピング属性は、（3.1.3項を参照してください）"
    },
    {
      "indent": 0,
      "text": "4. Applications, Use Cases, and Examples",
      "section_title": true,
      "ja": "4.アプリケーション、ユースケース、および例"
    },
    {
      "indent": 3,
      "text": "This section describes some applications and use cases to illustrate the use of the attributes proposed in this document.",
      "ja": "このセクションでは、この文書で提案されている属性の使用を説明するために、いくつかのアプリケーションやユースケースを説明します。"
    },
    {
      "indent": 0,
      "text": "4.1. Managing CGN Port Behavior Using RADIUS",
      "section_title": true,
      "ja": "4.1。 RADIUSを使用したCGNポートの動作を管理します"
    },
    {
      "indent": 3,
      "text": "In a broadband network, customer information is usually stored on a RADIUS server, and the BNG acts as a NAS. The communication between the NAS and the RADIUS server is triggered by a user when it signs in to the Internet service where either PPP or DHCP/DHCPv6 is used. When a user signs in, the NAS sends a RADIUS Access-Request message to the RADIUS server. The RADIUS server validates the request, and if the validation succeeds, it in turn sends back a RADIUS Access-Accept message. The Access-Accept message carries configuration information specific to that user back to the NAS, where some of the information would be passed on to the requesting user via PPP or DHCP/DHCPv6.",
      "ja": "ブロードバンドネットワークでは、顧客情報は、通常、RADIUSサーバ上に格納され、BNGは、NASとして機能します。 NASとRADIUSサーバ間の通信は、それがPPPやDHCP / DHCPv6のいずれかが使用されているインターネットサービスにサインインユーザーによってトリガーされます。ユーザーがサインでは、NASは、RADIUSサーバにRADIUS Access-Requestメッセージを送信するとき。 RADIUSサーバは、要求を検証し、検証が成功した場合、それが今度はRADIUS Access-Acceptメッセージを送り返します。 Access-Acceptメッセージには、バック情報の一部は、PPPまたはDHCP / DHCPv6のを経由して要求しているユーザに渡されることになるNASにそのユーザに固有の設定情報を運びます。"
    },
    {
      "indent": 3,
      "text": "A CGN function in a broadband network is most likely to be co-located on a BNG. In that case, parameters for CGN port mapping behavior for users can be configured on the RADIUS server. When a user signs in to the Internet service, the associated parameters can be conveyed to the NAS, and proper configuration is accomplished on the CGN device for that user.",
      "ja": "ブロードバンド・ネットワークにおけるCGN機能は、BNGに同じ場所に配置される可能性が最も高いです。その場合には、ユーザーのためのCGNポートマッピングの動作のためのパラメータは、RADIUSサーバ上で設定することができます。インターネットサービスにユーザのサインは、関連するパラメータは、NASに伝えることができ、そして適切な構成は、そのユーザのCGNデバイス上で達成されます。"
    },
    {
      "indent": 3,
      "text": "Also, a CGN operation status such as CGN port allocation and deallocation for a specific user on the BNG can also be transmitted back to the RADIUS server for accounting purposes using the RADIUS protocol.",
      "ja": "また、そのようなBNG上の特定のユーザーのCGNポートの割り当てと割り当て解除などのCGNの動作状態はまた、RADIUSプロトコルを使用して、会計目的のためにRADIUSサーバに返送することができます。"
    },
    {
      "indent": 3,
      "text": "The RADIUS protocol has already been widely deployed in broadband networks to manage BNG, thus the functionality described in this specification introduces little overhead to the existing network operation.",
      "ja": "RADIUSプロトコルは既に広く、したがって本明細書で説明した機能は、既存のネットワーク動作に少しオーバーヘッドを導入し、BNGを管理するためにブロードバンドネットワークに配備されています。"
    },
    {
      "indent": 3,
      "text": "In the following subsections, we describe how to manage CGN behavior using the RADIUS protocol, with required RADIUS extensions proposed in Section 3.",
      "ja": "以下のサブセクションでは、我々は第3節で提案されている必要RADIUS拡張で、RADIUSプロトコルを使用してCGNの動作を管理する方法について説明します。"
    },
    {
      "indent": 0,
      "text": "4.1.1. Configure IP Port Limit for a User",
      "section_title": true,
      "ja": "4.1.1。ユーザーのIPポート制限を設定します"
    },
    {
      "indent": 3,
      "text": "In the face of an IPv4 address shortage, there are currently proposals to multiplex multiple users' connections over a number of shared IPv4 addresses, such as Carrier Grade NAT [RFC6888], Dual-Stack Lite [RFC6333], NAT64 [RFC6146], etc. As a result, a single IPv4 public address may be shared by hundreds or even thousands of users. As indicated in [RFC6269], it is therefore",
      "ja": "等IPv4アドレスの不足に直面して、このようなキャリアグレードNAT [RFC6888]などの共有IPv4アドレスの数を介して複数のユーザの接続を多重化する提案が、現在存在するデュアルスタックライト[RFC6333]、NAT64 [RFC6146]、その結果、単一のIPv4パブリックアドレスは、ユーザの数百または数千で共有することができます。 [RFC6269]に示されるように、それ故、あります"
    },
    {
      "indent": 3,
      "text": "necessary to impose limits on the total number of ports available to an individual user to ensure that the shared resource, i.e., the IPv4 address, remains available in some capacity to all the users using it. The support of an IP port limit is also documented in [RFC6888] as a requirement for CGN.",
      "ja": "個々のユーザが利用可能なポートの総数に必要課す制限は、共有資源、すなわち、IPv4アドレスは、それを使用してすべてのユーザーにいくつかの容量で利用可能なままであることを確実にします。 IPポート制限のサポートもCGNの要件として、[RFC6888]に記載されています。"
    },
    {
      "indent": 3,
      "text": "The IP port limit imposed on an end user may be on the total number of IP source transport ports or a specific IP transport protocol as defined in Section 3.1.1.",
      "ja": "3.1.1項で定義されるように、エンドユーザに課されるIPポート制限は、IPソース輸送ポートまたは特定のIPトランスポートプロトコルの総数にしてもよいです。"
    },
    {
      "indent": 3,
      "text": "The per-user IP port limit is configured on a RADIUS server, along with other user information such as credentials.",
      "ja": "ユーザごとのIPポート制限は、そのような証明書として他のユーザ情報と共に、RADIUSサーバ上で設定されています。"
    },
    {
      "indent": 3,
      "text": "When a user signs in to the Internet service successfully, the IP port limit for the subscriber is passed by the RADIUS server to the BNG, which is acting as a NAS and is co-located with the CGN using the IP-Port-Limit-Info RADIUS attribute (defined in Section 3.1.1) along with other configuration parameters. While some parameters are passed to the user, the IP port limit is recorded on the CGN device for imposing the usage of IP transport ports for that user.",
      "ja": "インターネットサービスにユーザーがサインインに成功し、加入者のためのIPポート制限は、NASとして機能しているとIPポート・リミット - 側を使用してCGNと同じ場所に配置されたBNGにRADIUSサーバによって渡された場合他の設定パラメータと一緒に情報RADIUS属性（3.1.1項で定義されています）。いくつかのパラメータがユーザに渡されている間、IPポート制限は、そのユーザのためのIPトランスポートポートの使用を課すためCGN装置に記録されています。"
    },
    {
      "indent": 3,
      "text": "Figure 15 illustrates how the RADIUS protocol is used to configure the maximum number of TCP/UDP ports for a given user on a CGN device.",
      "ja": "図15は、RADIUSプロトコルがCGNデバイス上の特定のユーザーのためのTCP / UDPポートの最大数を設定するために使用される方法を示します。"
    },
    {
      "indent": 3,
      "text": "User                     CGN/NAS                        AAA\n |                         BNG                         Server\n |                          |                             |\n |                          |                             |\n |----Service Request------>|                             |\n |                          |                             |\n |                          |-----Access-Request -------->|\n |                          |                             |\n |                          |<----Access-Accept-----------|\n |                          |     (IP-Port-Limit-Info)    |\n |                          |     (for TCP/UDP ports)     |\n |<---Service Granted ------|                             |\n |    (other parameters)    |                             |\n |                          |                             |\n |                  (CGN external port                    |\n |                   allocation and                       |\n |                   IPv4 address assignment)             |\n |                          |                             |",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Figure 15: RADIUS Message Flow for Configuring CGN Port Limit",
      "ja": "図15：RADIUSメッセージフローCGNポート制限を設定するための"
    },
    {
      "indent": 3,
      "text": "The IP port limit created on a CGN device for a specific user using a RADIUS extension may be changed using a RADIUS CoA message [RFC5176] that carries the same RADIUS attribute. The CoA message may be sent from the RADIUS server directly to the NAS, and once a RADIUS CoA ACK message is accepted and sent back, the new IP port limit replaces the previous one.",
      "ja": "RADIUS拡張機能を使用して、特定のユーザに対してCGNデバイス上に作成されたIPポート制限は、同一のRADIUS属性を運ぶRADIUS CoAのメッセージ[RFC5176]を使用して変更することができます。 CoAのメッセージをNASに直接RADIUSサーバから送信され、RADIUS CoAのACKメッセージが受け入れられ、返送された後、新しいIPポート制限は、以前のものを置き換えることができます。"
    },
    {
      "indent": 3,
      "text": "Figure 16 illustrates how the RADIUS protocol is used to increase the TCP/UDP port limit from 1024 to 2048 on a CGN device for a specific user.",
      "ja": "図16は、RADIUSプロトコルは、特定のユーザのためのCGNデバイスに1024から2048へのTCP / UDPポート制限を増加させるために使用される方法を示す図です。"
    },
    {
      "indent": 3,
      "text": "User                     CGN/NAS                           AAA\n |                         BNG                            Server\n |                          |                               |\n |              TCP/UDP Port Limit (1024)                   |\n |                          |                               |\n |                          |<---------CoA Request----------|\n |                          |       (IP-Port-Limit-Info)    |\n |                          |       (for TCP/UDP ports)     |\n |                          |                               |\n |              TCP/UDP Port Limit (2048)                   |\n |                          |                               |\n |                          |---------CoA Response--------->|\n |                          |                               |",
      "raw": true
    },
    {
      "indent": 4,
      "text": "Figure 16: RADIUS Message Flow for Changing a User's CGN Port Limit",
      "ja": "図16：RADIUSメッセージフローユーザーズCGNポート制限を変更するための"
    },
    {
      "indent": 0,
      "text": "4.1.2. Report IP Port Allocation/Deallocation",
      "section_title": true,
      "ja": "4.1.2。レポートIPポートの割り当て/割り当て解除"
    },
    {
      "indent": 3,
      "text": "Upon obtaining the IP port limit for a user, the CGN device needs to allocate an IP transport port for the user when receiving a new IP flow sent from that user.",
      "ja": "ユーザのためのIPポート制限を取得すると、CGN装置は、そのユーザから送信された新しいIPフローを受信したとき、ユーザのIPトランスポートポートを割り当てる必要があります。"
    },
    {
      "indent": 3,
      "text": "As one practice, a CGN may allocate a block of IP ports for a specific user, instead of one port at a time, and within each port block the ports may be randomly distributed or in consecutive fashion. When a CGN device allocates a block of transport ports, the information can be easily conveyed to the RADIUS server by a new RADIUS attribute called the IP-Port-Range (defined in Section 3.1.2). The CGN device may allocate one or more IP port ranges, where each range contains a set of numbers representing IP transport ports and the total number of ports MUST be less or equal to the associated IP port limit imposed for that user. A CGN device may choose to allocate a small port range and allocate more at a later time as needed; such practice is good because of its randomization in nature.",
      "ja": "一の実施ように、CGNを一度に代えて一方のポートから、特定のユーザのためのIPポートのブロックを割り当てることができ、各ポートブロック内のポートはランダムに分布、または連続方式でもよいです。 CGN装置は、トランスポートポートのブロックを割り当てた場合に、情報が簡単に新しいRADIUS属性でRADIUSサーバに伝えることができる（セクション3.1.2で定義された）IPポートレンジと呼ばれます。 CGN装置は、各範囲がIPトランスポートポートを表す数値のセットを含み、ポートの総数が少ないか、そのユーザのために課された関連するIPポートの限界に等しくなければならない1つまたは複数のIPポート範囲を割り当てることができます。 CGNデバイスは、小さなポート範囲を割り当て、必要に応じて後でより多くを割り当てることを選択することができます。こうした慣行は理由自然の中でのランダム化の良いです。"
    },
    {
      "indent": 3,
      "text": "At the same time, the CGN device also needs to decide on the shared IPv4 address for that user. The shared IPv4 address and the pre-allocated IP port range are both passed to the RADIUS server.",
      "ja": "同時に、CGNデバイスは、そのユーザーの共有IPv4アドレスを決定する必要があります。共有IPv4アドレスと事前に割り当てられたIPポート範囲は、両方のRADIUSサーバに渡されます。"
    },
    {
      "indent": 3,
      "text": "When a user initiates an IP flow, the CGN device randomly selects a transport port number from the associated and pre-allocated IP port range for that user to replace the original source port number along with the replacement of the source IP address by the shared IPv4 address.",
      "ja": "ユーザがIPフローを開始したときに、そのユーザーが共有のIPv4によって送信元IPアドレスの交換に伴って元のソースポート番号を交換するために、CGN装置は、ランダム関連すると事前に割り当てられたIPポート範囲からトランスポートのポート番号を選択します住所。"
    },
    {
      "indent": 3,
      "text": "A CGN device may decide to \"free\" a previously assigned set of IP ports that have been allocated for a specific user but are not currently in use, and with that, the CGN device must send the information of the deallocated IP port range along with the shared IPv4 address to the RADIUS server.",
      "ja": "CGNデバイスは、「自由」への特定のユーザーに割り当てられたが、現在使用されていないされているIPポートの以前に割り当てられたセットを決定してもよいし、それを、CGNデバイスは、一緒に割り当て解除IPポート範囲の情報を送信する必要がありますRADIUSサーバへの共有IPv4アドレス。"
    },
    {
      "indent": 3,
      "text": "Figure 17 illustrates how the RADIUS protocol is used to report a set of ports allocated and deallocated, respectively, by a NAT64 device for a specific user to the RADIUS server. 2001:db8:100:200::/56 is the IPv6 prefix allocated to this user. In order to limit the usage of the NAT64 resources on a per-user basis for fairness of resource usage (see REQ-4 of [RFC6888]), port range allocations are bound to the /56 prefix, not to the source IPv6 address of the request. The NAT64 device is configured with the per-user port limit policy by some means (e.g., subscriber-mask [RFC7785]).",
      "ja": "図17は、RADIUSプロトコルはRADIUSサーバに特定のユーザのためのNAT64デバイスによって、それぞれ、割り当て及び割り当て解除ポートのセットを報告するために使用される方法を示す図です。 2001：DB8：100：200 :: / 56は、このユーザに割り当てられたIPv6プレフィックスです。 （REQ-4 [RFC6888]を参照）リソース使用量の公平性のためのユーザーごとにNAT64リソースの使用を制限するために、ポート範囲の割り当てを/ 56プレフィックスに、しないの元IPv6アドレスにバインドされリクエスト。 NAT64デバイスが何らかの手段によりユーザごとのポート制限ポリシーが設定されている（例えば、加入者マスク[RFC7785]）。"
    },
    {
      "indent": 3,
      "text": "Host                      NAT64/NAS                     AAA\n |                         BNG                         Server\n |                          |                             |\n |                          |                             |\n |----Service Request------>|                             |\n |                          |                             |\n |                          |-----Access-Request -------->|\n |                          |                             |\n |                          |<----Access-Accept-----------|\n |<---Service Granted ------|                             |\n |    (other parameters)    |                             |\n...                        ...                           ...\n |                          |                             |\n |                          |                             |\n |                (NAT64 decides to allocate              |\n |                 a TCP/UDP port range for the user)     |\n |                          |                             |\n |                          |-----Accounting-Request----->|\n |                          |    (IP-Port-Range           |\n |                          |     for allocation)         |\n...                        ...                           ...\n |                          |                             |\n |                (NAT64 decides to deallocate            |\n |                 a TCP/UDP port range for the user)     |\n |                          |                             |\n |                          |-----Accounting-Request----->|\n |                          |    (IP-Port-Range           |\n |                          |     for deallocation)       |\n |                          |                             |",
      "raw": true
    },
    {
      "indent": 12,
      "text": "Figure 17: RADIUS Message Flow for Reporting NAT64\n       Allocation/Deallocation of a Port Set",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.1.3. Configure Port Forwarding Mapping",
      "section_title": true,
      "ja": "4.1.3。ポート転送のマッピングを設定します"
    },
    {
      "indent": 3,
      "text": "In most scenarios, the port mapping on a NAT device is dynamically created when the IP packets of an IP connection initiated by a user arrives. For some applications, the port mapping needs to be pre-defined and allow IP packets of applications from outside a CGN device to pass through and be \"port forwarded\" to the correct user located behind the CGN device.",
      "ja": "ユーザによって開始IP接続のIPパケットが到着したとき、ほとんどのシナリオでは、NATデバイス上のポートマッピングが動的に作成されます。いくつかの用途のために、ポートマッピングが事前に定義する必要があり、CGN装置の外部からアプリケーションのIPパケットが通過し、CGNデバイスの背後に位置する正しいユーザに「ポート転送」ことを可能にします。"
    },
    {
      "indent": 3,
      "text": "The Port Control Protocol (PCP) [RFC6887], provides a mechanism to create a mapping from an external IP address and port to an internal IP address and port on a CGN device just to achieve the \"port forwarding\" purpose. PCP is a server-client protocol capable of creating or deleting a mapping along with a rich set of features on a CGN device in dynamic fashion. In some deployments, all users need is a few (typically just one) pre-configured port mappings for applications at home, such as a web cam; the lifetime of such a port mapping remains valid throughout the duration of the customer's Internet service connection time. In such an environment, it is possible to statically configure a port mapping on the RADIUS server for a user and let the RADIUS protocol propagate the information to the associated CGN device.",
      "ja": "ポート制御プロトコル（PCP）[RFC6887]は、単に「ポートフォワーディング」目的を達成するために、CGNデバイスの内部IPアドレスおよびポートに外部IPアドレスおよびポートからのマッピングを作成するためのメカニズムを提供します。 PCPは、動的にCGNデバイス上の機能の豊富なセットとともにマッピングを作成または削除することが可能なサーバ - クライアントプロトコルです。いくつかの展開では、すべてのユーザーが必要なWebカムとして自宅でのアプリケーションのためのいくつかの（通常はただ1）事前に設定されたポートのマッピング、です。そのようなポートマッピングの寿命は、お客様のインターネットサービス接続時間の期間を通じて有効です。そのような環境では、静的ユーザのRADIUSサーバ上のポートマッピングを設定し、RADIUSプロトコルは、関連CGNデバイスに情報を伝播させることが可能です。"
    },
    {
      "indent": 3,
      "text": "Note that this document targets deployments where a AAA server is responsible for instructing NAT mappings for a given subscriber and does not make any assumption about the host's capabilities with regards to port forwarding control. This deployment is complementary to PCP given that PCP targets a different deployment model where an application (on the host) controls its mappings in an upstream CPE, CGN, firewall, etc.",
      "ja": "このドキュメントは、AAAサーバは、所定の加入者のためのNATマッピングを指示するための責任があり、ポートフォワーディング制御に関して持つホストの機能についての仮定をしない展開を対象としていることに注意してください。この配置は、PCPは、（ホスト上の）アプリケーションは、上流のCPEにおいて、CGN、ファイアウォール等のマッピングを制御するさまざまな展開モデルをターゲットにすることを指定されたPCPに相補的です"
    },
    {
      "indent": 3,
      "text": "Figure 18 illustrates how the RADIUS protocol is used to configure a port forwarding mapping on a NAT44 device.",
      "ja": "図18は、RADIUSプロトコルがNAT44デバイス上のポート転送マッピングを構成するために使用される方法を示す図です。"
    },
    {
      "indent": 3,
      "text": "Host                     CGN/NAS                           AAA\n |                         BNG                            Server\n |                          |                               |\n |----Service Request------>|                               |\n |                          |                               |\n |                          |---------Access-Request------->|\n |                          |                               |\n |                          |<--------Access-Accept---------|\n |                          |   (IP-Port-Forwarding-Map)    |\n |<---Service Granted ------|                               |\n |    (other parameters)    |                               |\n |                          |                               |\n |                 (Create a port mapping                   |\n |                  for the user, and                       |\n |                  associate it with the                   |\n |                  internal IP address                     |\n |                  and external IP address)                |\n |                          |                               |\n |                          |                               |\n |                          |------Accounting-Request------>|\n |                          |    (IP-Port-Forwarding-Map)   |",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Figure 18: RADIUS Message Flow for Configuring\n           a Port Forwarding Mapping",
      "raw": true
    },
    {
      "indent": 3,
      "text": "A port forwarding mapping that is created on a CGN device using the RADIUS extension as described above may also be changed using a RADIUS CoA message [RFC5176] that carries the same RADIUS association. The CoA message may be sent from the RADIUS server directly to the NAS, and once the RADIUS CoA ACK message is accepted and sent back, the new port forwarding mapping then replaces the previous one.",
      "ja": "上記のようにRADIUS拡張機能を使用して、CGNデバイス上で作成されたポートフォワーディングマッピングは、同じRADIUSアソシエーションを運ぶRADIUS CoAのメッセージ[RFC5176]を使用して変更することができます。 CoAのメッセージは、NASに直接RADIUSサーバから送信され、RADIUS CoAのACKメッセージが受け入れられ、返送された後、新しいポート転送マッピングは、以前のものを置き換えてもよいです。"
    },
    {
      "indent": 3,
      "text": "Figure 19 illustrates how the RADIUS protocol is used to change an existing port mapping from (a:X) to (a:Y), where \"a\" is an internal port, and \"X\" and \"Y\" are external ports, respectively, for a specific user with a specific IP address",
      "ja": "「」内部ポートである：（Y）、及び「X」および「Y」の外部ポートはそれぞれ、に：（X）図19は、RADIUSプロトコルの既存のポートマッピングを変更するために使用される方法を示して、特定のIPアドレスを持つ特定のユーザーのために"
    },
    {
      "indent": 3,
      "text": "Host                     CGN/NAS                           AAA\n |                         BNG                            Server\n |                          |                               |\n |                    Internal IP Address                   |\n |                    Port Map (a:X)                        |\n |                          |                               |\n |                          |<---------CoA Request----------|\n |                          |    (IP-Port-Forwarding-Map)   |\n |                          |                               |\n |                    Internal IP Address                   |\n |                    Port Map (a:Y)                        |\n |                          |                               |\n |                          |---------CoA Response--------->|\n |                          |    (IP-Port-Forwarding-Map)   |",
      "raw": true
    },
    {
      "indent": 16,
      "text": "Figure 19: RADIUS Message Flow for Changing\n     a User's Port Forwarding Mapping",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.1.4. An Example",
      "section_title": true,
      "ja": "4.1.4。例"
    },
    {
      "indent": 3,
      "text": "An Internet Service Provider (ISP) assigns TCP/UDP 500 ports for the user Joe. This number is the limit that can be used for TCP/UDP ports on a CGN device for Joe and it is configured on a RADIUS server. Also, Joe asks for a pre-defined port forwarding mapping on the CGN device for his web cam applications (external port 5000 maps to internal port 1234).",
      "ja": "インターネットサービスプロバイダ（ISP）は、ユーザジョーのためのTCP / UDP 500ポートを割り当てます。この数は、ジョーのためのCGNデバイスにTCP / UDPポートのために使用することができる限界であり、これは、RADIUSサーバ上で設定されています。また、ジョーは（内部ポート1234への外部ポート5000のマップ）自分のWebカムアプリケーションのためのCGNデバイス上で事前に定義されたポートフォワーディングマッピングを要求します。"
    },
    {
      "indent": 3,
      "text": "When Joe successfully connects to the Internet service, the RADIUS server conveys the TCP/UDP port limit (500) and the port forwarding mapping (external port 5000 to internal port 1234) to the CGN device using the IP-Port-Limit-Info Attribute and IP-Port-Forwarding-Map Attribute, respectively, carried by an Access-Accept message to the BNG where NAS and CGN are co-located.",
      "ja": "ジョーが正常にインターネットサービスに接続すると、RADIUSサーバは、IPポート・リミット・インフォ属性を使用してCGNデバイスへのTCP / UDPポートの制限（500）とポートフォワーディングマッピング（内部ポート1234への外部ポート5000を）伝えますNASとCGNが同じ場所に配置されている場所とIPポートフォワーディング - 地図属性、それぞれ、BNGにAccess-Acceptメッセージによって運ばれます。"
    },
    {
      "indent": 3,
      "text": "Upon receiving the first outbound IP packet sent from Joe's laptop, the CGN device decides to allocate a small port pool that contains 40 consecutive ports, from 3500 to 3540, inclusively, and also assigns a shared IPv4 address 192.0.2.15 for Joe. The CGN device also randomly selects one port from the allocated range (say, 3519) and uses that port to replace the original source port in outbound IP packets.",
      "ja": "ジョーのノートパソコンから送信された最初のアウトバウンドIPパケットを受信すると、CGNデバイスは包括的、3500から3540まで、40個の連続するポートが含まれ、また、ジョーの共有IPv4アドレス192.0.2.15を割り当て小さなポートプールを割り当てることを決定します。 CGNデバイスはまた、ランダムに割り当てられた範囲（例えば、3519）からの1つのポートを選択し、アウトバウンドIPパケットの元の送信元ポートを置き換えるためにそのポートを使用します。"
    },
    {
      "indent": 3,
      "text": "For accounting purposes, the CGN device passes this port range (3500-3540) and the shared IPv4 address 192.0.2.15 together to the RADIUS server using IP-Port-Range Attribute carried by an Accounting-Request message.",
      "ja": "会計目的のために、CGNデバイスは、アカウンティング要求メッセージによって運ばれるIPポートレンジ属性を使用してRADIUSサーバに一緒にこのポート範囲（3500から3540）と共有IPv4アドレス192.0.2.15を渡します。"
    },
    {
      "indent": 3,
      "text": "When Joe works on more applications with more outbound IP mappings and the port pool (3500-3540) is close to exhaust, the CGN device allocates a second port pool (8500-8800) in a similar fashion and also passes the new port range (8500-8800) and IPv4 address 192.0.2.15 together to the RADIUS server using IP-Port-Range Attribute carried by an Accounting-Request message. Note when the CGN allocates more ports, it needs to assure that the total number of ports allocated for Joe is within the limit.",
      "ja": "ジョーがよりアウトバウンドIPマッピングとポートプール（3500から3540）を有する複数のアプリケーション上で動作する排気に近い場合、CGN装置は、同様に第二のポートプール（8500から8800）を割り当てても（新しいポート範囲を通過します8500-8800）とIPv4は、アカウンティング要求メッセージによって運ばIP-ポート範囲属性を使用して、RADIUSサーバに一緒に192.0.2.15に取り組みます。 CGNは、より多くのポートを割り当てるときに、それはジョーのために割り当てられたポートの総数が制限内であることを保証する必要がある注意。"
    },
    {
      "indent": 3,
      "text": "Joe decides to upgrade his service agreement with more TCP/UDP ports allowed (up to 1000 ports). The ISP updates the information in Joe's profile on the RADIUS server, which then sends a CoA-Request message that carries the IP-Port-Limit-Info Attribute with 1000 ports to the CGN device; the CGN device in turn sends back a CoA-ACK message. With that, Joe enjoys more available TCP/UDP ports for his applications.",
      "ja": "ジョーは許可され、よりTCP / UDPポート（千ポートまで）と彼のサービス契約をアップグレードすることを決定します。 ISPは、IPポート・リミット・インフォはCGNデバイス1000個のポートと属性運ぶのCoA-Requestメッセージを送信するRADIUSサーバー、上のジョーのプロファイル内の情報を更新します。順番にCGNデバイスは、アシルCoA-ACKメッセージを送り返します。それによって、ジョーは自分のアプリケーションのためのより多くの利用可能なTCP / UDPポートを楽しんでいます。"
    },
    {
      "indent": 3,
      "text": "When Joe is not using his service, most of the IP mappings are closed with their associated TCP/UDP ports released on the CGN device, which then sends the relevant information back to the RADIUS server using the IP-Port-Range Attribute carried by the Accounting-Request message.",
      "ja": "ジョーは彼のサービスを使用していない場合は、IPマッピングのほとんどはによって運ば属性その後、IP-ポート範囲を使用して、RADIUSサーバに戻って、関連する情報を送信CGNデバイス、にリリースそれらに関連するTCP / UDPポートが閉じられていますアカウンティング要求メッセージ。"
    },
    {
      "indent": 3,
      "text": "Throughout Joe's connection with his ISP, applications can communicate with his web cam at home from the external realm, thus directly traversing the pre-configured mapping on the CGN device.",
      "ja": "彼のISPとのジョーの接続を通じて、アプリケーションは、このように直接CGNデバイス上で事前に構成されたマッピングを横断し、外部領域から自宅で彼のWebカムと通信することができます。"
    },
    {
      "indent": 3,
      "text": "When Joe disconnects from his Internet service, the CGN device will deallocate all TCP/UDP ports as well as the port forwarding mapping and send the relevant information to the RADIUS server.",
      "ja": "ジョーは彼のインターネットサービスから切断すると、CGNデバイスは、すべてのTCP / UDPポートだけでなく、ポート転送マッピングの割り当てを解除し、RADIUSサーバに関連する情報を送信します。"
    },
    {
      "indent": 0,
      "text": "4.2. Report Assigned Port Set for a Visiting UE",
      "section_title": true,
      "ja": "4.2。客員UE用のポートを設定割り当てられた報告書"
    },
    {
      "indent": 3,
      "text": "Figure 20 illustrates an example of the flow exchange that occurs when the visiting User Equipment (UE) connects to a CPE offering WLAN service.",
      "ja": "図20は、訪問ユーザ機器（UE）がWLANサービスを提供CPEに接続するときに発生する流れ交換の一例を示す図です。"
    },
    {
      "indent": 3,
      "text": "For identification purposes (see [RFC6967]), once the CPE assigns a port set, it issues a RADIUS message to report the assigned port set.",
      "ja": "CPEは、ポートセットを割り当てたら、識別目的（[RFC6967]を参照）、それは割り当てられたポートのセットを報告するRADIUSメッセージを発行します。"
    },
    {
      "indent": 3,
      "text": "UE         CPE             CGN                          AAA\n |                         BNG                         Server\n |                          |                             |\n |                          |                             |\n |----Service Request------>|                             |\n |                          |                             |\n |                          |-----Access-Request -------->|\n |                          |                             |\n |                          |<----Access-Accept-----------|\n |<---Service Granted ------|                             |\n |    (other parameters)    |                             |\n...          |             ...                           ...\n |<---IP@----|              |                             |\n |           |              |                             |\n |   (CPE assigns a TCP/UDP port                          |\n |   range for this visiting UE)                          |\n |           |                                            |\n |           |--Accounting-Request-...------------------->|\n |           |    (IP-Port-Range                          |\n |           |     for allocation)                        |\n...          |             ...                           ...\n |           |              |                             |\n |           |              |                             |\n |   (CPE withdraws a TCP/UDP port                        |\n |   range for a visiting UE)                             |\n |           |                                            |\n |           |--Accounting-Request-...------------------->|\n |           |    (IP-Port-Range                          |\n |           |     for deallocation)                      |\n |           |                                            |",
      "raw": true
    },
    {
      "indent": 10,
      "text": "   Figure 20: RADIUS Message Flow for Reporting CPE\nAllocation/Deallocation of a Port Set to a Visiting UE",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5. Table of Attributes",
      "section_title": true,
      "ja": "属性の5.表"
    },
    {
      "indent": 3,
      "text": "This document proposes three new RADIUS attributes, and their formats are as follows:",
      "ja": "この文書は3つの新しいRADIUS属性を提案し、次のようにその形式は以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "o IP-Port-Limit-Info: 241.5",
      "ja": "O IPポート制限情報：241.5"
    },
    {
      "indent": 3,
      "text": "o IP-Port-Range: 241.6",
      "ja": "O IPポートレンジ：241.6"
    },
    {
      "indent": 3,
      "text": "o IP-Port-Forwarding-Map: 241.7",
      "ja": "O-IPポート転送 - マップ：241.7"
    },
    {
      "indent": 3,
      "text": "The following table provides a guide as to what type of RADIUS packets may contain these attributes and in what quantity.",
      "ja": "次の表は、これらの属性を含んでいてもよいRADIUSパケットの種類に関して、どのような量でガイドを提供します。"
    },
    {
      "indent": 3,
      "text": "Request Accept Reject Challenge Acct. # Attribute Request 0+ 0+ 0 0 0+ 241.5 IP-Port-Limit-Info 0 0 0 0 0+ 241.6 IP-Port-Range 0+ 0+ 0 0 0+ 241.7 IP-Port-Forwarding-Map",
      "ja": "リクエストはチャレンジアカウンティングを拒否受け入れます。 ＃の属性要求0+ 0+ 0 0 0+ 241.5 IPポート・リミット・インフォ0 0 0 0 0 + 241.6 IPポートレンジ0+ 0+ 0 0 0+ 241.7 IPポートフォワーディング - 地図"
    },
    {
      "indent": 3,
      "text": "The following table defines the meaning of the above table entries.",
      "ja": "次の表は、上記テーブルエントリの意味を定義します。"
    },
    {
      "indent": 3,
      "text": "0 This attribute MUST NOT be present in packet. 0+ Zero or more instances of this attribute MAY be present in packet.",
      "ja": "0この属性は、パケット内に存在してはなりません。 0+この属性のゼロ以上のインスタンスがパケットに存在してもよいです。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not introduce any security issue other than the ones already identified in RADIUS documents [RFC2865] and [RFC5176] for CoA messages. Known RADIUS vulnerabilities apply to this specification. For example, if RADIUS packets are sent in the clear, an attacker in the communication path between the RADIUS client and server may glean information that it will use to prevent a legitimate user from accessing the service by appropriately setting the maximum number of IP ports conveyed in an IP-Port-Limit-Info Attribute; exhaust the port quota of a user by installing many mapping entries (IP-Port-Forwarding-Map Attribute); prevent incoming traffic from being delivered to its legitimate destination by manipulating the mapping entries installed by means of an IP-Port-Forwarding-Map Attribute; discover the IP address and port range that are assigned to a given user and reported in an IP-Port-Range Attribute; and so on. The root cause of these attack vectors is the communication between the RADIUS client and server.",
      "ja": "この文書では、すでにRADIUS文書のCoAメッセージの[RFC2865]と[RFC5176]で特定されたもの以外の任意のセキュリティ上の問題を紹介しません。既知のRADIUSの脆弱性は、この仕様に適用されます。 RADIUSパケットが平文で送信された場合、例えば、RADIUSクライアントとサーバの間の通信経路における攻撃者は、搬送が適切にIPポートの最大数を設定することによって、サービスにアクセスする正当なユーザーを防ぐために使用する情報を収集することができますIPポート・リミット・インフォ属性で、多くのマッピングエントリをインストールすることにより、ユーザーのポートの割り当てを使い果たし（IPポートフォワーディング - 地図属性）; IPポートフォワーディング - 地図属性によってインストールマッピングエントリを操作することによって、その正当な送信先に配信されてからの着信トラフィックを防ぎます。指定されたユーザーに割り当てられ、IP-ポート範囲属性で報告されているIPアドレスとポート範囲を発見。等々。これらの攻撃ベクトルの根本的な原因は、RADIUSクライアントとサーバ間の通信です。"
    },
    {
      "indent": 3,
      "text": "The IP-Port-Local-Id TLV includes an identifier of which the type and length is deployment and implementation dependent. This identifier might carry privacy-sensitive information. It is therefore RECOMMENDED to utilize identifiers that do not have such privacy concerns.",
      "ja": "IPポートローカル-ID TLVは、タイプと長さが展開およびインプリメンテーション依存であるの識別子を含みます。この識別子は、プライバシーに敏感な情報を運ぶかもしれません。したがって、このようなプライバシーの懸念を持っていない識別子を利用することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "If there is any error in a RADIUS Accounting-Request packet sent from a RADIUS client to the server, the RADIUS server MUST NOT send a response to the client (refer to [RFC2866]). Examples of the errors include the erroneous port range in the IP-Port-Range Attribute, inconsistent port mapping in the IP-Port-Forwarding-Map Attribute, etc.",
      "ja": "サーバーへのRADIUSクライアントから送信されたRADIUSアカウンティング要求パケットに誤りがある場合は、RADIUSサーバは、クライアントへの応答を（[RFC2866]を参照してください）送ってはいけません。エラーの例としては、等がIP-ポート範囲属性で誤ったポート範囲、IPポート・フォワーディング・マップ属性における一貫性のないポートマッピングを含み、"
    },
    {
      "indent": 3,
      "text": "This document targets deployments where a trusted relationship is in place between the RADIUS client and server with communication optionally secured by IPsec or Transport Layer Security (TLS) [RFC6614].",
      "ja": "この文書では、信頼関係が任意でのIPsecまたはトランスポート層セキュリティ（TLS）[RFC6614]で固定通信とRADIUSクライアントとサーバの間の所定の位置にある展開を対象としています。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "Per this document, IANA has made new code point assignments for both IPFIX Information Elements and RADIUS attributes as explained in the following subsections.",
      "ja": "このドキュメントごとに、IANAは以下のサブセクションで説明するようにIPFIX情報要素とRADIUSの両方のための新しいコードポイントの割り当て属性を作っています。"
    },
    {
      "indent": 0,
      "text": "7.1. New IPFIX Information Elements",
      "section_title": true,
      "ja": "7.1。新IPFIX情報要素"
    },
    {
      "indent": 3,
      "text": "The following IPFIX Information Element has been registered (refer to Section 3.2.2):",
      "ja": "次IPFIX情報エレメント（セクション3.2.2参照）に登録されています："
    },
    {
      "indent": 3,
      "text": "o sourceTransportPortsLimit:",
      "ja": "Oソーストランスポートポートの制限："
    },
    {
      "indent": 6,
      "text": "* Name: sourceTransportPortsLimit",
      "ja": "*名前：sourceTransportPortsLimit"
    },
    {
      "indent": 6,
      "text": "* Element ID: 458",
      "ja": "※エレメントID：458"
    },
    {
      "indent": 6,
      "text": "* Description: This Information Element contains the maximum number of IP source transport ports that can be used by an end user when sending IP packets; each user is associated with one or more (source) IPv4 or IPv6 addresses. This Information Element is particularly useful in address-sharing deployments that adhere to REQ-4 of [RFC6888]. Limiting the number of ports assigned to each user ensures fairness among users and mitigates the denial-of-service attack that a user could launch against other users through the address-sharing device in order to grab more ports.",
      "ja": "*説明：この情報要素は、IPパケットを送信するときにエンドユーザが使用することができるIP送信元トランスポートポートの最大数を含んでいます。各ユーザは、1つまたは複数の（ソース）IPv4またはIPv6アドレスに関連付けられています。この情報要素は、REQ-4 [RFC6888]のに準拠アドレス共有展開において特に有用です。各ユーザに割り当てられたポートの数を制限すると、ユーザ間の公平性を保証し、ユーザが複数のポートをつかむために、アドレス共有装置を介して他のユーザーに対して起動可能性がサービス拒否攻撃を軽減します。"
    },
    {
      "indent": 6,
      "text": "* Data type: unsigned16",
      "ja": "*データ型：UNSIGNED16"
    },
    {
      "indent": 6,
      "text": "* Data type semantics: totalCounter",
      "ja": "*データ型意味論：totalCounter"
    },
    {
      "indent": 6,
      "text": "* Data type unit: ports",
      "ja": "*データ型単位：ポート"
    },
    {
      "indent": 6,
      "text": "* Data value range: from 1 to 65535",
      "ja": "*データの値の範囲：1から65535まで"
    },
    {
      "indent": 0,
      "text": "7.2. New RADIUS Attributes",
      "section_title": true,
      "ja": "7.2。新しいRADIUS属性"
    },
    {
      "indent": 3,
      "text": "The Attribute Types defined in this document have been registered by IANA from the RADIUS namespace as described in the \"IANA Considerations\" section of [RFC3575], in accordance with BCP 26 [RFC5226]. For RADIUS packets, attributes, and registries created by this document, IANA has placed them at <http://www.iana.org/assignments/radius-types>.",
      "ja": "[RFC3575]の「IANAの考慮事項」の項で説明したように、この文書で定義された属性タイプは、BCP 26 [RFC5226]に従って、RADIUS名前空間からIANAによって登録されています。 RADIUSパケット、属性、およびこのドキュメントで作成されたレジストリのために、IANAは、<http://www.iana.org/assignments/radius-types>でそれらを置いています。"
    },
    {
      "indent": 3,
      "text": "In particular, this document defines three new RADIUS attributes, as follows, from the Short Extended Space of [RFC6929]:",
      "ja": "次のように具体的には、この文書は[RFC6929]のショート拡張スペースから、3つの新しいRADIUS属性を定義します。"
    },
    {
      "indent": 3,
      "text": "Type      Description             Data Type   Reference\n----      -----------             ---------   ---------\n241.5     IP-Port-Limit-Info      tlv         Section 3.1.1\n241.6     IP-Port-Range           tlv         Section 3.1.2\n241.7     IP-Port-Forwarding-Map  tlv         Section 3.1.3",
      "raw": true
    },
    {
      "indent": 0,
      "text": "7.3. New RADIUS TLVs",
      "section_title": true,
      "ja": "7.3。新しいRADIUSのTLV"
    },
    {
      "indent": 3,
      "text": "IANA has created a new registry called \"RADIUS IP Port Configuration and Reporting TLVs\". All TLVs in this registry have one or more parent RADIUS attributes in nesting (refer to [RFC6929]). This registry contains the following TLVs:",
      "ja": "IANAは、「RADIUS IPポートの設定とレポートのTLV」と呼ばれる新しいレジストリを作成しました。このレジストリ内のすべてのTLVは、RADIUSは（[RFC6929]を参照してください）ネストの属性一つ以上の親を持ちます。このレジストリは、次のTLVが含まれています。"
    },
    {
      "indent": 6,
      "text": "Value  Description           Data Type    Reference\n-----  -----------           ---------    ---------\n0      Reserved\n1      IP-Port-Type          integer      Section 3.2.1\n2      IP-Port-Limit         integer      Section 3.2.2\n3      IP-Port-Ext-IPv4-Addr ipv4addr     Section 3.2.3\n4      IP-Port-Int-IPv4-Addr ipv4addr     Section 3.2.4\n5      IP-Port-Int-IPv6-Addr ipv4addr     Section 3.2.5\n6      IP-Port-Int-Port      integer      Section 3.2.6\n7      IP-Port-Ext-Port      integer      Section 3.2.7\n8      IP-Port-Alloc         integer      Section 3.2.8\n9      IP-Port-Range-Start   integer      Section 3.2.9\n10     IP-Port-Range-End     integer      Section 3.2.10\n11     IP-Port-Local-Id      string       Section 3.2.11\n12-255 Unassigned",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The registration procedure for this registry is Standards Action as defined in [RFC5226].",
      "ja": "このレジストリのための登録手続きは、[RFC5226]で定義されている標準アクションです。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[IPFIX] IANA, \"IP Flow Information Export (IPFIX) Entities\", <http://www.iana.org/assignments/ipfix/>.",
      "ja": "[IPFIX] IANA、 \"IPフロー情報のエクスポート（IPFIX）エンティティ\"、<http://www.iana.org/assignments/ipfix/>。"
    },
    {
      "indent": 3,
      "text": "[ProtocolNumbers] IANA, \"Protocol Numbers\", <http://www.iana.org/assignments/protocol-numbers/>.",
      "ja": "[ProtocolNumbers] IANA、 \"プロトコル番号\"、<http://www.iana.org/assignments/protocol-numbers/>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2865] Rigney, C., Willens, S., Rubens, A., and W. Simpson, \"Remote Authentication Dial In User Service (RADIUS)\", RFC 2865, DOI 10.17487/RFC2865, June 2000, <http://www.rfc-editor.org/info/rfc2865>.",
      "ja": "[RFC2865] Rigney、C.、ウィレンス、S.、ルーベン、A.、およびW.シンプソン、RFC 2865 \"ユーザーサービス（RADIUS）でリモート認証ダイヤル\"、DOI 10.17487 / RFC2865、2000年6月、<のhttp：/ /www.rfc-editor.org/info/rfc2865>。"
    },
    {
      "indent": 3,
      "text": "[RFC3575] Aboba, B., \"IANA Considerations for RADIUS (Remote Authentication Dial In User Service)\", RFC 3575, DOI 10.17487/RFC3575, July 2003, <http://www.rfc-editor.org/info/rfc3575>.",
      "ja": "[RFC3575] Aboba、B.、 \"RADIUSのためのIANAの考慮事項（ユーザサービスにおけるリモート認証ダイヤル）\"、RFC 3575、DOI 10.17487 / RFC3575、2003年7月、<http://www.rfc-editor.org/info/rfc3575 >。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, DOI 10.17487/RFC5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、DOI 10.17487 / RFC5226、2008年5月、<http://www.rfc-editor.org /情報/ RFC5226>。"
    },
    {
      "indent": 3,
      "text": "[RFC6929] DeKok, A. and A. Lior, \"Remote Authentication Dial In User Service (RADIUS) Protocol Extensions\", RFC 6929, DOI 10.17487/RFC6929, April 2013, <http://www.rfc-editor.org/info/rfc6929>.",
      "ja": "[RFC6929] DeKok、A.とA. LIOR、RFC 6929、DOI 10.17487 / RFC6929、2013年4月、<http://www.rfc-editor.org/ \"ユーザーサービス（RADIUS）プロトコルの拡張機能でリモート認証ダイヤル\"情報/ rfc6929>。"
    },
    {
      "indent": 3,
      "text": "[RFC7012] Claise, B., Ed., and B. Trammell, Ed., \"Information Model for IP Flow Information Export (IPFIX)\", RFC 7012, DOI 10.17487/RFC7012, September 2013, <http://www.rfc-editor.org/info/rfc7012>.",
      "ja": "[RFC7012] Claise、B.、エド、およびB.トラメル、エド、RFC 7012 \"IPフロー情報のエクスポート（IPFIX）のための情報モデル\"、DOI 10.17487 / RFC7012、2013年9月、<HTTP：// WWW。 rfc-editor.org/info/rfc7012>。"
    },
    {
      "indent": 3,
      "text": "[RFC8044] DeKok, A., \"Data Types in RADIUS\", RFC 8044, DOI 10.17487/RFC8044, January 2017, <http://www.rfc-editor.org/info/rfc8044>.",
      "ja": "[RFC8044] DeKok、A.、 \"RADIUSでのデータ型\"、RFC 8044、DOI 10.17487 / RFC8044、2017年1月、<http://www.rfc-editor.org/info/rfc8044>。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC768] Postel, J., \"User Datagram Protocol\", STD 6, RFC 768, DOI 10.17487/RFC0768, August 1980, <http://www.rfc-editor.org/info/rfc768>.",
      "ja": "[RFC768]ポステル、J.、 \"ユーザ・データグラム・プロトコル\"、STD 6、RFC 768、DOI 10.17487 / RFC0768、1980年8月、<http://www.rfc-editor.org/info/rfc768>。"
    },
    {
      "indent": 3,
      "text": "[RFC793] Postel, J., \"Transmission Control Protocol\", STD 7, RFC 793, DOI 10.17487/RFC0793, September 1981, <http://www.rfc-editor.org/info/rfc793>.",
      "ja": "[RFC793]ポステル、J.、 \"伝送制御プロトコル\"、STD 7、RFC 793、DOI 10.17487 / RFC0793、1981年9月、<http://www.rfc-editor.org/info/rfc793>。"
    },
    {
      "indent": 3,
      "text": "[RFC1918] Rekhter, Y., Moskowitz, B., Karrenberg, D., de Groot, G., and E. Lear, \"Address Allocation for Private Internets\", BCP 5, RFC 1918, DOI 10.17487/RFC1918, February 1996, <http://www.rfc-editor.org/info/rfc1918>.",
      "ja": "[RFC1918] Rekhter、Y.、モスコウィッツ、B.、Karrenberg、D.、デ・グルート、G.、およびE.リア、 \"個人的なインターネットのための配分\"、BCP 5、RFC 1918、DOI 10.17487 / RFC1918、1996年2月に、<http://www.rfc-editor.org/info/rfc1918>。"
    },
    {
      "indent": 3,
      "text": "[RFC2866] Rigney, C., \"RADIUS Accounting\", RFC 2866, DOI 10.17487/RFC2866, June 2000, <http://www.rfc-editor.org/info/rfc2866>.",
      "ja": "[RFC2866] Rigney、C.、 \"RADIUSアカウンティング\"、RFC 2866、DOI 10.17487 / RFC2866、2000年6月、<http://www.rfc-editor.org/info/rfc2866>。"
    },
    {
      "indent": 3,
      "text": "[RFC3022] Srisuresh, P. and K. Egevang, \"Traditional IP Network Address Translator (Traditional NAT)\", RFC 3022, DOI 10.17487/RFC3022, January 2001, <http://www.rfc-editor.org/info/rfc3022>.",
      "ja": "[RFC3022] Srisuresh、P.とK. Egevang、 \"伝統的なIPネットワークアドレス変換（NAT繁体字）\"、RFC 3022、DOI 10.17487 / RFC3022、2001年1月、<http://www.rfc-editor.org/info/ RFC3022>。"
    },
    {
      "indent": 3,
      "text": "[RFC4340] Kohler, E., Handley, M., and S. Floyd, \"Datagram Congestion Control Protocol (DCCP)\", RFC 4340, DOI 10.17487/RFC4340, March 2006, <http://www.rfc-editor.org/info/rfc4340>.",
      "ja": "[RFC4340]コーラー、E.、ハンドリー、M.、およびS.フロイド、 \"データグラム輻輳制御プロトコル（DCCP）\"、RFC 4340、DOI 10.17487 / RFC4340、2006年3月、<のhttp：//www.rfc-editor。組織/情報/ RFC4340>。"
    },
    {
      "indent": 3,
      "text": "[RFC4960] Stewart, R., Ed., \"Stream Control Transmission Protocol\", RFC 4960, DOI 10.17487/RFC4960, September 2007, <http://www.rfc-editor.org/info/rfc4960>.",
      "ja": "[RFC4960]スチュワート、R.、エド。、 \"ストリーム制御伝送プロトコル\"、RFC 4960、DOI 10.17487 / RFC4960、2007年9月、<http://www.rfc-editor.org/info/rfc4960>。"
    },
    {
      "indent": 3,
      "text": "[RFC5176] Chiba, M., Dommety, G., Eklund, M., Mitton, D., and B. Aboba, \"Dynamic Authorization Extensions to Remote Authentication Dial In User Service (RADIUS)\", RFC 5176, DOI 10.17487/RFC5176, January 2008, <http://www.rfc-editor.org/info/rfc5176>.",
      "ja": "[RFC5176]千葉、M.、Dommety、G.、エクランド、M.、ミットン、D.、およびB. Aboba、RFC 5176、DOI 10.17487 / \"動的認証拡張ユーザーサービス（RADIUS）においてリモート認証ダイヤルを\" RFC5176、2008年1月、<http://www.rfc-editor.org/info/rfc5176>。"
    },
    {
      "indent": 3,
      "text": "[RFC6146] Bagnulo, M., Matthews, P., and I. van Beijnum, \"Stateful NAT64: Network Address and Protocol Translation from IPv6 Clients to IPv4 Servers\", RFC 6146, DOI 10.17487/RFC6146, April 2011, <http://www.rfc-editor.org/info/rfc6146>.",
      "ja": "[RFC6146] Bagnulo、M.、マシューズ、P.、およびI.バンBeijnum、 \"ステートフルNAT64：IPv4のサーバーへのIPv6クライアントからのネットワークアドレスとプロトコル変換\"、RFC 6146、DOI 10.17487 / RFC6146、2011年4月、<のhttp： //www.rfc-editor.org/info/rfc6146>。"
    },
    {
      "indent": 3,
      "text": "[RFC6158] DeKok, A., Ed., and G. Weber, \"RADIUS Design Guidelines\", BCP 158, RFC 6158, DOI 10.17487/RFC6158, March 2011, <http://www.rfc-editor.org/info/rfc6158>.",
      "ja": "[RFC6158] DeKok、A.編、およびG.ウェーバー、 \"RADIUS設計ガイドライン\"、BCP 158、RFC 6158、DOI 10.17487 / RFC6158、2011年3月、<http://www.rfc-editor.org/info / rfc6158>。"
    },
    {
      "indent": 3,
      "text": "[RFC6269] Ford, M., Ed., Boucadair, M., Durand, A., Levis, P., and P. Roberts, \"Issues with IP Address Sharing\", RFC 6269, DOI 10.17487/RFC6269, June 2011, <http://www.rfc-editor.org/info/rfc6269>.",
      "ja": "[RFC6269]フォード、M.、エド。、Boucadair、M.、デュラン、A.、リーバイス、P.、およびP.ロバーツ、RFC 6269 \"IPアドレスの共有に関する問題\"、DOI 10.17487 / RFC6269、2011年6月、 <http://www.rfc-editor.org/info/rfc6269>。"
    },
    {
      "indent": 3,
      "text": "[RFC6333] Durand, A., Droms, R., Woodyatt, J., and Y. Lee, \"Dual-Stack Lite Broadband Deployments Following IPv4 Exhaustion\", RFC 6333, DOI 10.17487/RFC6333, August 2011, <http://www.rfc-editor.org/info/rfc6333>.",
      "ja": "[RFC6333]デュラン、A.、Droms、R.、Woodyatt、J.、およびY.リー、 \"IPv4の枯渇に続いてデュアルスタックLiteのブロードバンドの展開\"、RFC 6333、DOI 10.17487 / RFC6333、2011年8月、<のhttp：/ /www.rfc-editor.org/info/rfc6333>。"
    },
    {
      "indent": 3,
      "text": "[RFC6598] Weil, J., Kuarsingh, V., Donley, C., Liljenstolpe, C., and M. Azinger, \"IANA-Reserved IPv4 Prefix for Shared Address Space\", BCP 153, RFC 6598, DOI 10.17487/RFC6598, April 2012, <http://www.rfc-editor.org/info/rfc6598>.",
      "ja": "[RFC6598]ワイル、J.、Kuarsingh、V.、Donley、C.、Liljenstolpe、C.、およびM. Azinger、 \"共有アドレススペースのためのIANAリザーブIPv4のプレフィックス\"、BCP 153、RFC 6598、DOI 10.17487 / RFC6598 、2012年4月、<http://www.rfc-editor.org/info/rfc6598>。"
    },
    {
      "indent": 3,
      "text": "[RFC6614] Winter, S., McCauley, M., Venaas, S., and K. Wierenga, \"Transport Layer Security (TLS) Encryption for RADIUS\", RFC 6614, DOI 10.17487/RFC6614, May 2012, <http://www.rfc-editor.org/info/rfc6614>.",
      "ja": "[RFC6614]冬、S.、マッコーリー、M.、Venaas、S.、およびK. Wierenga、 \"RADIUSのためのトランスポート層セキュリティ（TLS）暗号化\"、RFC 6614、DOI 10.17487 / RFC6614、2012年5月、<のhttp：/ /www.rfc-editor.org/info/rfc6614>。"
    },
    {
      "indent": 3,
      "text": "[RFC6887] Wing, D., Ed., Cheshire, S., Boucadair, M., Penno, R., and P. Selkirk, \"Port Control Protocol (PCP)\", RFC 6887, DOI 10.17487/RFC6887, April 2013, <http://www.rfc-editor.org/info/rfc6887>.",
      "ja": "[RFC6887]ウィング、D.、編、チェシャー、S.、Boucadair、M.、Penno、R.、およびP.セルカーク、 \"ポート制御プロトコル（PCP）\"、RFC 6887、DOI 10.17487 / RFC6887、2013年4月、<http://www.rfc-editor.org/info/rfc6887>。"
    },
    {
      "indent": 3,
      "text": "[RFC6888] Perreault, S., Ed., Yamagata, I., Miyakawa, S., Nakagawa, A., and H. Ashida, \"Common Requirements for Carrier-Grade NATs (CGNs)\", BCP 127, RFC 6888, DOI 10.17487/RFC6888, April 2013, <http://www.rfc-editor.org/info/rfc6888>.",
      "ja": "[RFC6888]ペロー、S.編、山形、I.、宮川、S.、中川、A.、およびH.芦田、 \"キャリアグレードNATのための共通要件（CGNを）\"、BCP 127、RFC 6888、 DOI 10.17487 / RFC6888、2013年4月、<http://www.rfc-editor.org/info/rfc6888>。"
    },
    {
      "indent": 3,
      "text": "[RFC6967] Boucadair, M., Touch, J., Levis, P., and R. Penno, \"Analysis of Potential Solutions for Revealing a Host Identifier (HOST_ID) in Shared Address Deployments\", RFC 6967, DOI 10.17487/RFC6967, June 2013, <http://www.rfc-editor.org/info/rfc6967>.",
      "ja": "[RFC6967] Boucadair、M.、タッチ、J.、リーバイス、P.、およびR. Penno、 \"共有アドレス展開でホスト識別子（HOST_ID）を明らかにするのに潜在的な解決策の分析\"、RFC 6967、DOI 10.17487 / RFC6967、 2013年6月、<http://www.rfc-editor.org/info/rfc6967>。"
    },
    {
      "indent": 3,
      "text": "[RFC7785] Vinapamula, S. and M. Boucadair, \"Recommendations for Prefix Binding in the Context of Softwire Dual-Stack Lite\", RFC 7785, DOI 10.17487/RFC7785, February 2016, <http://www.rfc-editor.org/info/rfc7785>.",
      "ja": "[RFC7785] Vinapamula、S.及びM. Boucadair、RFC 7785、 \"Softwireデュアルスタックライトのコンテキストで結合プレフィックスの推奨事項\"、DOI 10.17487 / RFC7785、2016年2月、<HTTP：//www.rfc-editor。組織/情報/ rfc7785>。"
    },
    {
      "indent": 3,
      "text": "[TR-146] Broadband Forum, \"TR-146: Subscriber Sessions\", Broadband Forum Technical Report 146, Issue 1, May 2013, <http://www.broadband-forum.org/technical/ download/TR-146.pdf>.",
      "ja": "[TR-146]ブロードバンドフォーラム、 \"TR-146：加入者セッション\"、ブロードバンドフォーラムテクニカルレポート146号1、2013年5月、<http://www.broadband-forum.org/technical/ダウンロード/ TR-146。 PDF>。"
    },
    {
      "indent": 3,
      "text": "[WIFI-SERVICES] Gundavelli, S., Grayson, M., Seite, P., and Y. Lee, \"Service Provider Wi-Fi Services Over Residential Architectures\", Work in Progress, draft-gundavelli-v6ops-community-wifi-svcs-06, April 2013.",
      "ja": "[WIFI-SERVICES] Gundavelli、S.、グレイソン、M.、Seite、P.、およびY.リー、 \"サービスプロバイダのWi-Fiサービス住宅アーキテクチャオーバー\" が進行中で働いて、ドラフトgundavelli-v6opsコミュニティ-WIFI -svcs-06、2013年4月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks to Dan Wing, Roberta Maglione, Daniel Derksen, David Thaler, Alan DeKok, Lionel Morand, and Peter Deacon for their useful comments and suggestions.",
      "ja": "彼らの役に立つコメントと提案のためのダン・ウィング、ロベルタマリオーネ、ダニエルDerksen、デビッド・ターラー、アランDeKok、ライオネル・モラン、そしてピーター・ディーコンに感謝します。"
    },
    {
      "indent": 3,
      "text": "Special thanks to Lionel Morand for the Shepherd review and to Kathleen Moriarty for the AD review.",
      "ja": "シェパードレビューのためとADのレビューのためのキャスリーン・モリアーティにライオネル・モランに感謝します。"
    },
    {
      "indent": 3,
      "text": "Thanks to Carl Wallace, Tim Chown, and Ben Campbell for the detailed review.",
      "ja": "詳細なレビューのためのカール・ウォレス、ティムのchown、そしてベン・キャンベルに感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Dean Cheng Huawei 2330 Central Expressway Santa Clara, California 95050 United States of America",
      "ja": "ディーン・チェンHuawei社2330セントラルエクスプレスサンタクララ、カリフォルニア州アメリカの95050米国"
    },
    {
      "indent": 3,
      "text": "Email: dean.cheng@huawei.com",
      "ja": "メール：dean.cheng@huawei.com"
    },
    {
      "indent": 3,
      "text": "Jouni Korhonen Broadcom Corporation 3151 Zanker Road San Jose, California 95134 United States of America",
      "ja": "Jouni Korhonenブロードコム・コーポレーション3151 Zanker道路、サンノゼ、カリフォルニア州アメリカの95134米国"
    },
    {
      "indent": 3,
      "text": "Email: jouni.nospam@gmail.com",
      "ja": "メール：jouni.nospam@gmail.com"
    },
    {
      "indent": 3,
      "text": "Mohamed Boucadair Orange Rennes France",
      "ja": "モハメド・Boucadairオレンジフランスレンヌ"
    },
    {
      "indent": 3,
      "text": "Email: mohamed.boucadair@orange.com",
      "ja": "メール：mohamed.boucadair@orange.com"
    },
    {
      "indent": 3,
      "text": "Senthil Sivakumar Cisco Systems 7100-8 Kit Creek Road Research Triangle Park, North Carolina United States of America",
      "ja": "Senthilさんシバクマーシスコシステムズ7100から8キットクリーク道路リサーチトライアングルパーク、アメリカのノースカロライナ州、米国"
    },
    {
      "indent": 3,
      "text": "Email: ssenthil@cisco.com",
      "ja": "メール：ssenthil@cisco.com"
    }
  ]
}