{
  "title": {
    "text": "RFC 8318 - IAB, IESG, and IAOC Selection, Confirmation, and Recall Process: IAOC Advisor for the Nominating Committee",
    "ja": "RFC 8318 - IAB、IESG、およびIAOC選択、確認、およびリコールプロセス：指名委員会のためにIAOCアドバイザー"
  },
  "number": 8318,
  "created_at": "2019-10-30 03:47:15.441814+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        S. Dawkins\nRequest for Comments: 8318                                Wonder Hamster\nBCP: 10                                                     January 2018\nUpdates: 7437\nCategory: Best Current Practice\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 4,
      "text": "IAB, IESG, and IAOC Selection, Confirmation, and Recall Process:\n           IAOC Advisor for the Nominating Committee",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This specification formalizes an ad hoc practice used to provide advice to the IETF Nominating Committee (NomCom) about the operations of the IETF Administrative Oversight Committee (IAOC).",
      "ja": "この仕様は、IETF行政監視委員会（IAOC）の操作に関するIETF指名委員会（NomCom）へのアドバイスを提供するために使用するアドホック練習を形式化。"
    },
    {
      "indent": 3,
      "text": "This document updates RFC 7437.",
      "ja": "この文書は、RFC 7437に更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモはインターネット最も良い現在の練習を説明します。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 BCPの詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8318.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttps://www.rfc-editor.org/info/rfc8318で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2018 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2018 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（https://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Background on 'IAOC Liaisons' to Nominating Committees  . . .   3\n3.  BCP Text Changes  . . . . . . . . . . . . . . . . . . . . . .   4\n  3.1.  Change to Section 4.3 of RFC 7437, 'Structure'  . . . . .   4\n4.  Security Considerations . . . . . . . . . . . . . . . . . . .   4\n5.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   4\n6.  Normative References  . . . . . . . . . . . . . . . . . . . .   5\nAppendix A.  Discussion Points  . . . . . . . . . . . . . . . . .   6\n  A.1.  Why Is This Role an Advisor?  . . . . . . . . . . . . . .   6\n  A.2.  Why Is This Role Not a Liaison? . . . . . . . . . . . . .   7\n  A.3.  Why Is This Role Not Required to Be a Sitting IAOC\n        Member? . . . . . . . . . . . . . . . . . . . . . . . . .   8\n  A.4.  Why Does the Nominating Committee Request an IAOC\n        Advisor?  . . . . . . . . . . . . . . . . . . . . . . . .   8\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .   9\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .   9",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This specification formalizes an ad hoc practice used to provide advice to the IETF Nominating Committee (NomCom) about the operations of the IAOC (described in [RFC4071]).",
      "ja": "この仕様は、（[RFC4071]に記載されている）IAOCの動作についてIETF指名委員会（NomCom）へのアドバイスを提供するために使用されるアドホック練習を形式化。"
    },
    {
      "indent": 3,
      "text": "This document updates [RFC7437].",
      "ja": "このドキュメントの更新[RFC7437]。"
    },
    {
      "indent": 3,
      "text": "Proposed future changes to BCP 10 should be discussed on the public IETF NomCom discussion mailing list, at <https://www.ietf.org/mailman/listinfo/ietf-nomcom>.",
      "ja": "BCP 10に提案将来の変更は、<https://www.ietf.org/mailman/listinfo/ietf-nomcom>で、公共のIETF NomCom議論メーリングリストで議論されるべきです。"
    },
    {
      "indent": 0,
      "text": "2. Background on 'IAOC Liaisons' to Nominating Committees",
      "section_title": true,
      "ja": "指名委員会に「IAOCリエゾン」に関する背景"
    },
    {
      "indent": 3,
      "text": "When RFC 7437 [RFC7437] was approved, it explicitly charged the nominating committee with selecting and reviewing certain members of the IAOC. However, [RFC7437] did not provide for the IAOC to send a liaison to the nominating committee.",
      "ja": "RFC 7437 [RFC7437]が承認された場合には、それが明示的にIAOCの特定のメンバーを選択し、見直しを指名委員会を充電しました。ただし、[RFC7437]は指名委員会への連絡を送信するためにIAOCのために提供されていませんでした。"
    },
    {
      "indent": 3,
      "text": "This was not thought to be an obstacle because [RFC7437] allowed any committee member to propose a liaison from the IAOC:",
      "ja": "[RFC7437]は、任意の委員がIAOCから連絡を提案することができので、これは障害物であると考えられていませんでした。"
    },
    {
      "indent": 6,
      "text": "Any committee member may propose the addition of a liaison from other unrepresented organizations to participate in some or all of the deliberations of the committee. The addition must be approved by the committee according to its established voting mechanism. Liaisons participate as representatives of their respective organizations.",
      "ja": "いずれの委員は、委員会の審議の一部またはすべてに参加するために、他の図示しない団体からのリエゾンの追加を提案することができます。さらには、その確立の投票メカニズムに応じて委員会によって承認されなければなりません。リエゾンは、それぞれの組織の代表として参加します。"
    },
    {
      "indent": 3,
      "text": "Beginning in 2010, the IAOC provided a liaison to each nominating committee. In 2016, the IAOC did not provide a liaison because the nominating committee was not appointing an IAOC member. The previous nominating committee had filled a mid-term vacancy (using the process described in Section 3.5. of [RFC7437]) by appointing an IAOC member for a term longer than two years. In 2017, the NomCom was selecting an IAOC member, but the opportunity to request a liaison from the IAOC was overlooked, because this practice wasn't part of the documented process in [RFC7437].",
      "ja": "2010年に始まり、IAOCは、各指名委員会への連絡を提供します。指名委員会はIAOCのメンバーを任命されなかったため、2016年には、IAOCは、リエゾンを提供していませんでした。以前の指名委員会は、二年より長期ためIAOC部材を任命することによって（セクション3.5に記載された方法を用いて、[RFC7437]の）中期の空孔を充填しました。 2017年に、NomComはIAOCのメンバーを選択したが、この方法は、[RFC7437]で文書化されたプロセスの一部ではなかったので、IAOCから連絡を要求する機会を見落としました。"
    },
    {
      "indent": 3,
      "text": "This specification adds the previously ad hoc role to [RFC7437] so that future nominating committees will be less likely to overlook it.",
      "ja": "将来の指名委員会はそれを見落とす可能性が低くなるように、この仕様は、[RFC7437]に以前にアドホック・ロールを追加します。"
    },
    {
      "indent": 3,
      "text": "Although past ad hoc practice has characterized this role as a \"liaison\", this specification labels the role as an \"advisor\". The rationale for this change in nomenclature is provided in Appendix A.1.",
      "ja": "過去の広告ホックの練習は「リエゾン」として、この役割を特徴付けているが、この仕様は、「顧問」としての役割をラベル付けします。命名法のこの変化の理論的根拠は、付録A.1で提供されています。"
    },
    {
      "indent": 0,
      "text": "3. BCP Text Changes",
      "section_title": true,
      "ja": "3. BCPテキストの変更"
    },
    {
      "indent": 3,
      "text": "This section provides the updated BCP text for [RFC7437].",
      "ja": "このセクションでは、[RFC7437]の更新されたBCPのテキストを提供します。"
    },
    {
      "indent": 3,
      "text": "For each OLD text selection, NEW text is provided that replaces the OLD text in [RFC7437].",
      "ja": "各OLDテキスト選択のために、新しいテキストが[RFC7437]で古いテキストを置き換えるが提供されます。"
    },
    {
      "indent": 0,
      "text": "3.1. Change to , 'Structure'",
      "section_title": true,
      "ja": "3.1。 「構造」に変更"
    },
    {
      "indent": 3,
      "text": "OLD",
      "ja": "古い"
    },
    {
      "indent": 6,
      "text": "Any committee member may propose the addition of an advisor to participate in some or all of the deliberations of the committee. The addition must be approved by the committee according to its established voting mechanism. Advisors participate as individuals.",
      "ja": "いずれの委員は、委員会の審議の一部またはすべてに参加するために顧問の追加を提案することができます。さらには、その確立の投票メカニズムに応じて委員会によって承認されなければなりません。顧問は、個人として参加します。"
    },
    {
      "indent": 3,
      "text": "NEW",
      "ja": "新着"
    },
    {
      "indent": 6,
      "text": "Any committee member may propose the addition of an advisor to participate in some or all of the deliberations of the committee. The addition must be approved by the committee according to its established voting mechanism. Advisors participate as individuals.",
      "ja": "いずれの委員は、委員会の審議の一部またはすべてに参加するために顧問の追加を提案することができます。さらには、その確立の投票メカニズムに応じて委員会によって承認されなければなりません。顧問は、個人として参加します。"
    },
    {
      "indent": 6,
      "text": "Committee members are encouraged to propose the addition of an advisor who is knowledgeable about the operations of the IAOC, whether or not that nominating committee is reviewing an IAOC position. The nominating committee may choose to ask the IAOC to suggest an advisor who is knowledgeable about IAOC operations but may select any advisor they vote to approve.",
      "ja": "委員会のメンバーは、その指名委員会がIAOC位置を検討しているかどうか、IAOCの操作に関する知識が豊富である顧問の追加を提案することをお勧めします。指名委員会は、IAOC操作に関する知識が豊富であるが、それらが承認する投票を任意の顧問を選択することが顧問を提案するIAOCに依頼することもできます。"
    },
    {
      "indent": 0,
      "text": "4. Security Considerations",
      "section_title": true,
      "ja": "4.セキュリティについての考慮事項"
    },
    {
      "indent": 3,
      "text": "This document updates an IETF process BCP and has no direct Internet security implications.",
      "ja": "この文書は、IETFプロセスBCPを更新しては直接のインターネットセキュリティの意味を持っていません。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document has no IANA actions.",
      "ja": "このドキュメントには、IANAのアクションを持っていません。"
    },
    {
      "indent": 0,
      "text": "6. Normative References",
      "section_title": true,
      "ja": "6.引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC4071] Austein, R., Ed. and B. Wijnen, Ed., \"Structure of the IETF Administrative Support Activity (IASA)\", BCP 101, RFC 4071, DOI 10.17487/RFC4071, April 2005, <https://www.rfc-editor.org/info/rfc4071>.",
      "ja": "[RFC4071] Austeinと、R.、エド。およびB. Wijnenの、エド。、 \"IETF管理サポート活動（IASA）の構造\"、BCP 101、RFC 4071、DOI 10.17487 / RFC4071、2005年4月、<https://www.rfc-editor.org/info/ rfc4071>。"
    },
    {
      "indent": 3,
      "text": "[RFC7437] Kucherawy, M., Ed., \"IAB, IESG, and IAOC Selection, Confirmation, and Recall Process: Operation of the Nominating and Recall Committees\", BCP 10, RFC 7437, DOI 10.17487/RFC7437, January 2015, <https://www.rfc-editor.org/info/rfc7437>.",
      "ja": "[RFC7437] Kucherawy、M.編、 \"IAB、IESG、およびIAOC選択、確認、およびリコール処理：指名の動作とリコール委員会\"、BCP 10、RFC 7437、DOI 10.17487 / RFC7437、2015年1月、< https://www.rfc-editor.org/info/rfc7437>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Discussion Points",
      "ja": "付録A.ディスカッションポイント"
    },
    {
      "indent": 3,
      "text": "This section preserves discussions and explanations that came up during document discussions. Ordinarily, this section might be deleted during the evaluation process, but some questions came up repeatedly, so the editor has included them for anyone who also shares those questions.",
      "ja": "このセクションでは、ドキュメントディスカッションの際に思い付いた議論や説明を保持します。通常、このセクションは、評価の過程で削除されるかもしれないが、いくつかの質問を繰り返して来たので、エディタはまた、これらの質問を共有する人のためにそれらを含めています。"
    },
    {
      "indent": 0,
      "text": "A.1. Why Is This Role an Advisor?",
      "ja": "A.1。なぜ、この役割は顧問ですか？"
    },
    {
      "indent": 3,
      "text": "The editor of this document briefly considered proposing a new and IAOC-specific role to [RFC7437] but considered such a proposal to be complex. Anticipating every corner case in IETF process BCPs is challenging and prone to error, and as this specification was being written, the IETF Chair was sponsoring a design team reviewing all aspects of the IETF Administrative Support Activity (IASA). Therefore, the structure and membership of the IAOC itself could change in the near future. Instead, the specification describes how the nominating committee requests advisors and builds on mature text that has survived many nominating committee cycles.",
      "ja": "このドキュメントの編集を簡単に[RFC7437]に新しいとIAOC固有の役割を提案すると考えられますが、そのような提案は複雑であると考えられて。 IETFプロセスのBCPのすべてのコーナーケースを予測することは誤りを挑戦と傾向があり、そしてこの仕様が書かれていたとして、IETF議長は、IETFの管理サポート活動（IASA）のすべての側面を見直し、設計チームのスポンサーました。したがって、IAOC自体の構造とメンバーシップは、近い将来に変更することができます。代わりに、仕様は、指名委員会が顧問を要求し、多くの指名委員会のサイクルを生き延びた、成熟したテキストの上に構築する方法について説明します。"
    },
    {
      "indent": 3,
      "text": "After choosing to reuse existing roles defined in [RFC7437], the definition of \"advisor\" in Section 4.9 of [RFC7437] seemed appropriate.",
      "ja": "[RFC7437]で定義された既存の役割を再利用することを選択した後、[RFC7437]のセクション4.9で「顧問」の定義が適切なように見えました。"
    },
    {
      "indent": 6,
      "text": "An advisor is responsible for such duties as specified by the invitation that resulted in the appointment.",
      "ja": "顧問は、任命が生じた招待状で指定されたなどの業務を担当しています。"
    },
    {
      "indent": 6,
      "text": "Advisors do not vote on the selection of candidates.",
      "ja": "顧問は、候補者の選択に投票しません。"
    },
    {
      "indent": 3,
      "text": "The position described in this specification could be filled by an advisor who would be a non-voting member of the nominating committee, who is knowledgeable about the operations of the IAOC, and who has duties that could evolve over time as the IAOC itself evolves.",
      "ja": "本明細書に記載された位置はIAOCの操作に関する知識が豊富である指名委員会の非投票メンバー、および誰IAOC自体が発展するにつれて、経時的発展可能性義務を有しているであろう顧問によって充填することができます。"
    },
    {
      "indent": 3,
      "text": "The only difference between this advisor that requires an update to [RFC7437], and any other advisor is that committee members are explicitly encouraged to suggest that this advisor be appointed as described in this specification. The text updating [RFC7437] is found in Section 3.",
      "ja": "[RFC7437]に更新する必要があり、この顧問、およびその他の顧問との唯一の違いは、委員会のメンバーは、明示的に本明細書で説明するように、この顧問を任命することを示唆することが推奨されていることです。テキスト更新[RFC7437]はセクション3で発見されました。"
    },
    {
      "indent": 0,
      "text": "A.2. Why Is This Role Not a Liaison?",
      "ja": "A.2。なぜ、この役割は、連絡はないですか？"
    },
    {
      "indent": 3,
      "text": "Discussions on the IETF NomCom mailing list led to the recognition that \"liaison\" was not the best description of this role.",
      "ja": "IETF NomComメーリングリスト上の議論は、「リエゾン」は、この役割の最善の説明はなかったという認識に至りました。"
    },
    {
      "indent": 3,
      "text": "The role of liaison defined in Section 4.7 of [RFC7437] places some significant obligations on liaisons beyond what is necessary for someone to answer questions from the nominating committee about the IAOC. These obligations include the following:",
      "ja": "[RFC7437]のセクション4.7で定義されたリエゾンの役割はIAOCに関する指名委員会からの質問に答えるために誰かのために必要なものを超えてリエゾンにいくつかの重要な義務を課します。これらの義務は、次のものがあります。"
    },
    {
      "indent": 3,
      "text": "o Liaisons are responsible for ensuring the nominating committee in general and the Chair in particular execute their assigned duties in the best interest of the IETF community.",
      "ja": "Oのリエゾンは、一般的には指名委員会およびIETFコミュニティの最善の利益に自分に割り当てられた任務を実行し、特に椅子を確保する責任があります。"
    },
    {
      "indent": 3,
      "text": "o Liaisons from the IESG, IAB, and Internet Society Board of Trustees (if one is appointed) are expected to review the operation and execution process of the nominating committee and to report any concerns or issues to the Chair of the nominating committee immediately. If they cannot resolve the issue between themselves, liaisons must report it according to the dispute resolution process stated elsewhere in this document.",
      "ja": "O（1が任命されている場合）IESG、IAB、および評議員のインターネット協会委員会からのリエゾンは、指名委員会の操作と実行プロセスを確認すると、直ちに指名委員会の委員長に任意の懸念や問題を報告することが期待されています。彼らは自分たちの間で問題を解決できない場合は、リエゾンは、このドキュメントの他の場所で述べた紛争解決プロセスに従って、それを報告しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Liaisons may have other nominating committee responsibilities as required by their respective organizations or requested by the nominating committee; such responsibilities may not conflict with any other provisions of this document.",
      "ja": "Oのリエゾンは、それぞれの組織が必要か、指名委員会の要求に応じて他の指名委員会の責務を有していてもよいです。そのような責任は、本書の他の条項と矛盾しないことがあります。"
    },
    {
      "indent": 3,
      "text": "Finally, as mentioned in Section 4.6 of [RFC7437], all of the liaisons are included in the pool of people who are eligible to be selected as a replacement for a Chair.",
      "ja": "[RFC7437]の4.6節で述べたように最後に、リエゾンの全ては議長の代替として選択の対象人々のプールに含まれています。"
    },
    {
      "indent": 6,
      "text": "There are a variety of ordinary circumstances that may arise from time to time that could result in a Chair being unavailable to oversee the activities of the committee. The Chair, in consultation with the Internet Society President, may appoint a substitute from a pool comprised of the liaisons currently serving on the committee and the prior year's Chair or designee.",
      "ja": "委員会の活動を監督するために利用できなく椅子につながる可能性が随時発生する可能性のある普通の状況はさまざまです。議長は、インターネット協会会長と協議の上、現在の委員会と前年度のチェアや指名を務めるリエゾンで構成されるプールからの代替を任命することができます。"
    },
    {
      "indent": 3,
      "text": "Note: During discussion of this specification, we noted that any liaison would be part of the pool of potential substitute nominating committee Chairs. It wasn't clear to the discussion participants whether there was an intentional decision to make liaisons voted onto the nominating committee eligible to be substitute Chairs. That potential change is out of scope for this specification but may be a conversation worth having separately.",
      "ja": "注意：この仕様の議論の中で、我々はすべてのリエゾンは、潜在的な代替指名委員会の議長のプールの一部であろうと指摘しました。これは、代替議長になる資格指名委員会に投票リエゾンを作るための意図的な決断があったかどうかの議論参加者に明確ではありませんでした。その電位変化は、この仕様の範囲外であるが、個別に持つ価値が会話かもしれません。"
    },
    {
      "indent": 3,
      "text": "All of these obligations are important, but there are always at least two full liaisons from the confirming bodies that are already responsible for those responsibilities. It is simply not necessary to make the job of helping the nominating committee understand the role and operational practices of the IAOC more demanding than it must be.",
      "ja": "これらの義務のすべてが重要ですが、すでにそれらの責任を担当している確認団体から少なくとも2つの完全なリエゾンは常にあります。指名委員会は、それがなければなりませんよりも、より厳しい役割とIAOCの運用実務を理解助ける仕事をするために、単に必要はありません。"
    },
    {
      "indent": 3,
      "text": "So, requiring the IAOC to name a formal liaison to the nominating committee isn't justified.",
      "ja": "だから、指名委員会への正式なリエゾンを指名するIAOCを必要とすることは正当化されません。"
    },
    {
      "indent": 0,
      "text": "A.3. Why Is This Role Not Required to Be a Sitting IAOC Member?",
      "ja": "A.3。なぜ、この役割は、お座りIAOCメンバーである必要はありませんか？"
    },
    {
      "indent": 3,
      "text": "In addition to the reasons given in Appendix A.2, the requirement that the IAB and IESG liaisons to the nominating committee be sitting members of the organizations they represent, whose positions are not being reviewed by this nominating committee, is especially challenging for the IAOC.",
      "ja": "付録A.2にした理由に加えて、指名委員会へのIABとIESGリエゾンが位置この指名委員会によって検討されていないそれらが表す組織のメンバーを座ってする要件は、IAOCのために特に困難です。"
    },
    {
      "indent": 3,
      "text": "Many IAOC positions are filled by members who are already members of IETF leadership and are subject to review by the nominating committee. This means that limiting an IAOC liaison to one of the sitting members would mean that in some years the only individuals eligible to serve as liaison for the nominating committee would be sitting members of the IAOC that a) were appointed by the previous nominating committee and are not being by the current nominating committee, or b) were appointed by the IAB or IESG and are not being reviewed by the current IAB or IESG. \"Eligible\" does not also mean \"willing and able to serve\", so it is possible that an IAOC might find itself with no sitting member to send as advisor in some years.",
      "ja": "多くのIAOC位置はすでにIETFリーダーシップのメンバーであり、指名委員会による審査の対象となるメンバーによって満たされています。これは、座ってメンバーの一人にIAOCのリエゾンを制限することa）は、以前の指名委員会によって任命されたことが何年かに指名委員会のための連絡窓口として機能する資格のみ個人がIAOCのメンバーに座ってされることを意味するであろうことを意味し現在の指名委員会によってされていない、またはb）IABやIESGによって任命され、現在のIABやIESGによってレビューされていません。 「適格」も「喜んで仕えるとすること」を意味し、IAOCは、いくつかの年で顧問として送信することなしに座っメンバーで自身を見つけるかもしれない可能性がありません。"
    },
    {
      "indent": 3,
      "text": "Although all IAOC liaisons to the nominating committee have served as sitting members of the IAOC, given 10 years of IAOC operation, this specification assumes that other members of the community have sufficient experience to provide guidance if the IAOC chooses to suggest such a person. If any given IAOC thought that was important, they could certainly continue to suggest sitting members, but if no sitting member was willing and able to serve, the IAOC would be free to do the next best thing and would likely be the best qualified group to decide who to send.",
      "ja": "指名委員会へのすべてのIAOCのリエゾンは、IAOCの座ってメンバーを務めIAOC操作の10年間与えられているが、この仕様は、コミュニティの他のメンバーがIAOCは、そのような人を提案することを選択した場合のガイダンスを提供するのに十分な経験を持っていることを前提としています。任意のIAOCはそれが重要だと思ったならば、彼らは確かに座ってメンバーを提案し続けることができますが、何も座っメンバーが喜んと奉仕することができなかった場合は、IAOCは次善の策を行うことが自由になり、おそらくへの最高の資格のグループになります送信するかを決めます。"
    },
    {
      "indent": 0,
      "text": "A.4. Why Does the Nominating Committee Request an IAOC Advisor?",
      "ja": "A.4。なぜ指名委員会は、IAOC顧問をリクエストしていますか？"
    },
    {
      "indent": 3,
      "text": "This specification could have described the mechanism in one of two ways:",
      "ja": "この仕様は、次のいずれかの方法でメカニズムを説明している可能性が："
    },
    {
      "indent": 3,
      "text": "o the IAOC could simply provide the name of the advisor to the nominating committee, or",
      "ja": "IAOCは、単に指名委員会に顧問の名前を提供することができ、O、または"
    },
    {
      "indent": 3,
      "text": "o the nominating committee could request the name of an advisor from the IAOC.",
      "ja": "O指名委員会は、IAOCから顧問の名前を要求することができます。"
    },
    {
      "indent": 3,
      "text": "Either choice could work. The reason that this specification chose to have the nominating committee make the first move is that this is more similar to the way other advisors to the nominating committee are selected, except that the nominating committee is asking the IAOC for a suggestion before inviting the advisor to join the nominating committee.",
      "ja": "どちらの選択は仕事ができます。この仕様は、指名委員会は、最初の移動をすることを選択した理由は、指名委員会が顧問を招待する前に、提案のためのIAOCを求めていることを除いて、これは指名委員会への他の顧問が選択されている方法に類似であるということです指名委員会に参加します。"
    },
    {
      "indent": 3,
      "text": "The suggestion is, in fact, a suggestion; the nominating committee still votes to invite this advisor as they would vote to invite any advisor, as described in Section 4.3 of [RFC7437].",
      "ja": "提案は、実際には、提案です。 [RFC7437]のセクション4.3で説明したように指名委員会はまだ、彼らは任意の顧問を招待して投票するよう、この顧問を招待することを投票します。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Adrian Farrel, Alissa Cooper, Andy Malis, Alvaro Retana, Joel Halpern, John Klensin, Leslie Daigle, Michael Richardson, Robert Sparks, Russ Housley, S. Moonesamy, Scott Bradner, Stephen Farrell, and Ted Hardie for providing feedback on early draft versions of this document.",
      "ja": "エードリアンファレル、アリッサ・クーパー、アンディMalis、アルバロRetana、ジョエル・ハルパーン、ジョン・クレンシン、レスリーDaigle氏、マイケル・リチャードソン、ロバート・スパークス、ラスHousley、S. Moonesamy、スコット・ブラッドナー、スティーブン・ファレル、およびテッドハーディーのおかげで早期にフィードバックを提供するためのこの文書の草案。"
    },
    {
      "indent": 3,
      "text": "The input provided by Joel Halpern (2008-2009 nominating committee Chair) and Michael Richardson (2014-2015 nominating committee Chair) is especially appreciated because only a few people can provide a nominating committee Chair's perspective on how useful representation from the IAOC has been in practice.",
      "ja": "ほんの数人がでてきたどのように便利な表現IAOCからの指名委員会の議長の視点を提供することができるので、ジョエル・ハルパーン（2008年から2009年指名委員会の委員長）とマイケル・リチャードソン（2014年から2015年指名委員会の議長）によって提供される入力が特に高く評価され練習。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Spencer Dawkins Wonder Hamster Internetworking LLC",
      "ja": "スペンサー・ドーキンスワンダーハムスターインターネットワーキングLLC"
    },
    {
      "indent": 3,
      "text": "Email: spencerdawkins.ietf@gmail.com",
      "ja": "メール：spencerdawkins.ietf@gmail.com"
    }
  ]
}