{
  "title": {
    "text": "RFC 8150 - MPLS Transport Profile Linear Protection MIB",
    "ja": "RFC 8150 - MPLSトランスポートプロファイルリニアプロテクションMIB"
  },
  "number": 8150,
  "created_at": "2019-10-23 23:55:23.803552+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                S. Kingston Smiler\nRequest for Comments: 8150                                   IP Infusion\nCategory: Standards Track                                  M. Venkatesan\nISSN: 2070-1721                                        Dell Technologies\n                                                                 D. King\n                                                      Old Dog Consulting\n                                                               S. Aldrin\n                                                            Google, Inc.\n                                                                 J. Ryoo\n                                                                    ETRI\n                                                              April 2017",
      "raw": true
    },
    {
      "indent": 14,
      "text": "MPLS Transport Profile Linear Protection MIB",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols. In particular, it defines objects for managing Multiprotocol Label Switching - Transport Profile (MPLS-TP) linear protection.",
      "ja": "このメモはネットワーク管理プロトコルと共に使用するための管理情報ベース（MIB）の一部を画定します。特に、マルチプロトコルラベルスイッチングを管理するためにオブジェクトを定義 - トランスポートプロファイル（MPLS-TP）リニアプロテクションを。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8150.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc8150で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2017 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................3\n2. The Internet-Standard Management Framework ......................3\n3. Conventions .....................................................3\n4. Overview ........................................................4\n5. Structure of the MIB Module .....................................4\n   5.1. Textual Conventions ........................................4\n   5.2. The MPLS-TP Linear Protection Switching Subtree ............4\n   5.3. The Notifications Subtree ..................................5\n   5.4. The Table Structures .......................................5\n6. Relationship to Other MIB Modules ...............................7\n   6.1. Relationship to the MPLS OAM Identifiers MIB Module ........7\n7. Example of Protection Switching Configuration ...................7\n8. Definitions .....................................................9\n9. Security Considerations ........................................43\n10. IANA Considerations ...........................................44\n11. References ....................................................45\n   11.1. Normative References .....................................45\n   11.2. Informative References ...................................47\nAcknowledgments ...................................................47\nContributors ......................................................47\nAuthors' Addresses ................................................48",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This memo defines a portion of the Management Information Base (MIB) for use with network management protocols. In particular, it defines objects for managing Multiprotocol Label Switching - Transport Profile (MPLS-TP) linear protection.",
      "ja": "このメモはネットワーク管理プロトコルと共に使用するための管理情報ベース（MIB）の一部を画定します。特に、マルチプロトコルラベルスイッチングを管理するためにオブジェクトを定義 - トランスポートプロファイル（MPLS-TP）リニアプロテクションを。"
    },
    {
      "indent": 3,
      "text": "This MIB module should be used for configuring and managing MPLS-TP linear protection for MPLS-TP Label Switched Paths (LSPs).",
      "ja": "このMIBモジュールは、スイッチパス（LSP）の設定およびMPLS-TPラベルのためのMPLS-TPのリニア保護を管理するために使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "At the time of this writing, Simple Network Management Protocol (SNMP) SET is no longer recommended as a way to configure MPLS networks as described in RFC 3812 [RFC3812]. However, since the MIB module specified in this document is intended to work in parallel with the MIB module for MPLS specified in [RFC3812] and the MIB module for MPLS-TP Operations, Administration, and Maintenance (OAM) identifiers in RFC 7697 [RFC7697], certain objects defined here are specified with a MAX-ACCESS clause of read-write or read-create so that specifications of the base tables in [RFC3812] and [RFC7697] and the new MIB module in this document are consistent.",
      "ja": "RFC 3812 [RFC3812]で説明したように、この記事の執筆時点では、簡易ネットワーク管理プロトコル（SNMP）SETは、もはやMPLSネットワークを構成するための方法として推奨されていません。しかし、この文書で指定されたMIBモジュールは[RFC3812]とRFC 7697でMPLS-TP運用、管理、および保守（OAM）識別子のMIBモジュールで指定されたMPLSのためのMIBモジュールと並行して動作するように意図されているので[RFC7697 ]、ここで定義された特定のオブジェクトがのMAX-ACCESS句で指定された書き込みを読み出すか、[RFC3812]及び[RFC7697]及びこの文書の新しいMIBモジュール内のベース・テーブルの仕様が一致しているように作成してお読みください。"
    },
    {
      "indent": 0,
      "text": "2. The Internet-Standard Management Framework",
      "section_title": true,
      "ja": "2.インターネット標準管理フレームワーク"
    },
    {
      "indent": 3,
      "text": "For a detailed overview of the documents that describe the current Internet-Standard Management Framework, please refer to section 7 of RFC 3410 [RFC3410].",
      "ja": "現在のインターネット標準の管理フレームワークを記述したドキュメントの詳細な概要については、RFC 3410 [RFC3410]のセクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB. MIB objects are generally accessed through the Simple Network Management Protocol (SNMP). Objects in the MIB are defined using the mechanisms defined in the Structure of Management Information (SMI). This memo specifies a MIB module that is compliant to the SMIv2, which is described in STD 58, RFC 2578 [RFC2578], STD 58, RFC 2579 [RFC2579] and STD 58, RFC 2580 [RFC2580].",
      "ja": "管理対象オブジェクトが仮想情報店を介してアクセスされ、管理情報ベースまたはMIBと呼ばれます。 MIBオブジェクトは、一般的に簡易ネットワーク管理プロトコル（SNMP）を介してアクセスされます。 MIBのオブジェクトは、管理情報（SMI）の構造で定義されたメカニズムを使用して定義されています。このメモは、STD 58、RFC 2578 [RFC2578]、STD 58、RFC 2579 [RFC2579]とSTD 58、RFC 2580 [RFC2580]に記載されているSMIv2のに準拠しているMIBモジュールを指定します。"
    },
    {
      "indent": 0,
      "text": "3. Conventions",
      "section_title": true,
      "ja": "3.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [RFC2119].",
      "ja": "キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、 \"推奨NOT\"、および「OPTIONAL BCP 14、RFC 2119 [RFC2119]に記載されているように「この文書に解釈されるべきです。"
    },
    {
      "indent": 0,
      "text": "4. Overview",
      "section_title": true,
      "ja": "4.概要"
    },
    {
      "indent": 3,
      "text": "RFC 6378 [RFC6378] defines the protocol to provide a linear protection switching mechanism for MPLS-TP for a point-to-point LSP within the protection domain bounded by the endpoints of the LSP. RFC 7271 [RFC7271] describes alternative mechanisms to perform some of the functions defined in [RFC6378] and also defines additional mechanisms to provide operator control and experience that more closely model the behavior of linear protection seen in other transport networks. Two modes are defined for MPLS-TP linear protection switching: the Protection State Coordination (PSC) mode and the Automatic Protection Switching (APS) mode, as specified in [RFC6378] and [RFC7271], respectively. The detailed protocol specification of MPLS-TP linear protection is described in [RFC6378] and [RFC7271].",
      "ja": "RFC 6378 [RFC6378]はLSPの端点によって囲ま保護ドメイン内のポイントツーポイントLSPのためのMPLS-TP線形保護切替機構を提供するためのプロトコルを定義しています。 RFC 7271 [RFC7271]は[RFC6378]で定義された機能の一部を実行するために別のメカニズムを説明し、また、より密接に他のトランスポートネットワークで見られる線形保護の挙動をモデル化するオペレータ制御及び経験を提供するために追加のメカニズムを定義します。 2つのモードがMPLS-TPのリニアプロテクション切り替えのために定義されています。保護状態調整（PSC）モードと自動保護スイッチング（APS）モード、それぞれ、[RFC6378]と[RFC7271]で指定されています。 MPLS-TP線形保護の詳細なプロトコル仕様は、[RFC6378]及び[RFC7271]に記載されています。"
    },
    {
      "indent": 3,
      "text": "This document specifies a MIB module for Label Edge Routers (LERs) that support MPLS-TP linear protection as described in [RFC6378] and [RFC7271]. Objects defined in this document are generally applied to both the PSC mode and the APS mode. If an object is valid for a particular mode only, it is noted in the description for the object.",
      "ja": "この文書では、[RFC6378]と[RFC7271]で説明したようにMPLS-TPのリニア保護をサポートラベルエッジルータ（LERが）のためのMIBモジュールを指定します。この文書で定義されたオブジェクトは、一般に、PSCモードとAPSモードの両方に適用されます。オブジェクトは、特定のモードに対して有効である場合は、オブジェクトの説明に記載されています。"
    },
    {
      "indent": 0,
      "text": "5. Structure of the MIB Module",
      "section_title": true,
      "ja": "MIBモジュールの構造5."
    },
    {
      "indent": 0,
      "text": "5.1. Textual Conventions",
      "section_title": true,
      "ja": "5.1. テキストの表記法"
    },
    {
      "indent": 3,
      "text": "The following new textual conventions are defined in this document:",
      "ja": "次の新しいテキストの表記法は、この文書で定義されています。"
    },
    {
      "indent": 3,
      "text": "o MplsLpsReq: This textual convention describes an object that stores the PSC Request field of the PSC control packet.",
      "ja": "O MplsLpsReq：このテキストの表記法は、PSC制御パケットのPSC要求フィールドを格納するオブジェクトを記述します。"
    },
    {
      "indent": 3,
      "text": "o MplsLpsFpathPath: This textual convention describes an object that stores the Fault Path (FPath) field and Data Path (Path) field of the PSC control packet.",
      "ja": "O MplsLpsFpathPath：このテキストの表記法は、障害パス（FPATH）フィールドとPSC制御パケットのデータパス（パス）フィールドを格納するオブジェクトを記述します。"
    },
    {
      "indent": 3,
      "text": "o MplsLpsCommand: This textual convention describes an object that allows a user to perform any action over a protection domain.",
      "ja": "O MplsLpsCommand：このテキストの表記法は、ユーザーが保護ドメインの上に任意のアクションを実行することを可能にするオブジェクトを記述します。"
    },
    {
      "indent": 3,
      "text": "o MplsLpsState: This textual convention describes an object that stores the current state of the PSC state machine.",
      "ja": "O MplsLpsState：このテキストの表記法はPSCステートマシンの現在の状態を格納するオブジェクトを記述します。"
    },
    {
      "indent": 0,
      "text": "5.2. The MPLS-TP Linear Protection Switching Subtree",
      "section_title": true,
      "ja": "5.2.  MPLS-TPリニアプロテクションスイッチングサブツリー"
    },
    {
      "indent": 3,
      "text": "MPLS-LPS-MIB is the MIB module defined in this document. It is rooted under the mplsStdMIB subtree per [RFC3811]. \"LPS\" as used in this document means \"Linear Protection Switching\".",
      "ja": "MPLS-LPS-MIBは、この文書で定義されたMIBモジュールです。それは、[RFC3811]あたりmplsStdMIBサブツリーの下に根ざしています。この文書で使用される「LPS」とは、「リニア保護スイッチング」を意味します。"
    },
    {
      "indent": 0,
      "text": "5.3. The Notifications Subtree",
      "section_title": true,
      "ja": "5.3. 通知のサブツリー"
    },
    {
      "indent": 3,
      "text": "Notifications are defined to inform the management station about switchovers, provisioning mismatches, and protocol failures of the linear protection domain. The following notifications are defined for this purpose:",
      "ja": "通知は、スイッチオーバー、プロビジョニングのミスマッチ、およびリニアプロテクションドメインのプロトコルの障害についての管理ステーションに通知するために定義されています。以下の通知は、この目的のために定義されています。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventSwitchover informs the management station about the switchover of the active path.",
      "ja": "アクティブパスの切り替えに関する管理ステーションに通知する通知mplsLpsEventSwitchover O。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventRevertiveMismatch informs the management station about a provisioning mismatch in the revertive mode across the endpoint of the protection domain.",
      "ja": "O通知mplsLpsEventRevertiveMismatchは、保護ドメインのエンドポイント間で復帰モードでのプロビジョニングのミスマッチについて、管理ステーションに通知します。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventProtecTypeMismatch informs the management station about a provisioning mismatch in the protection type, representing both the bridge type and the switching type, across the endpoint of the protection domain.",
      "ja": "O通知mplsLpsEventProtecTypeMismatchは、保護ドメインのエンドポイントを横切るブリッジ型とスイッチング方式の両方を表す保護タイププロビジョニングミスマッチ、約管理ステーションに通知します。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventCapabilitiesMismatch informs the management station about a provisioning mismatch in Capabilities TLVs across the endpoint of the protection domain.",
      "ja": "O通知mplsLpsEventCapabilitiesMismatchは、保護ドメインのエンドポイント間でケイパビリティのTLVにおけるプロビジョニングのミスマッチについて、管理ステーションに通知します。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventPathConfigMismatch informs the management station about a provisioning mismatch in the protection path configuration for PSC communication.",
      "ja": "PSCの通信のための予備パス構成でプロビジョニングミスマッチについて管理ステーションに通知する通知mplsLpsEventPathConfigMismatch O。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventFopNoResponse informs the management station that protocol failure has occurred due to a lack of response to a traffic switchover request in 50 ms.",
      "ja": "O通知mplsLpsEventFopNoResponseがプロトコルの失敗が原因50ミリ秒のトラフィック切り替え要求に対する応答の欠如のために発生したことを管理ステーションに通知します。"
    },
    {
      "indent": 3,
      "text": "o The notification mplsLpsEventFopTimeout informs the management station that protocol failure has occurred because no protocol message was received during at least 3.5 times the long PSC message interval [RFC7271].",
      "ja": "O通知mplsLpsEventFopTimeoutにはプロトコル・メッセージは、少なくとも3.5倍長いPSCメッセージ間隔[RFC7271]の間に受信されなかったため、プロトコル障害が発生した管理ステーションに通知します。"
    },
    {
      "indent": 0,
      "text": "5.4. The Table Structures",
      "section_title": true,
      "ja": "5.4. 表構造"
    },
    {
      "indent": 3,
      "text": "The MPLS-TP linear protection MIB module has four tables. The tables are as follows:",
      "ja": "MPLS-TPリニア保護MIBモジュールは、4つのテーブルがあります。次のように表には、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o mplsLpsConfigTable",
      "ja": "O mplsLpsConfigTable"
    },
    {
      "indent": 6,
      "text": "This table is used to configure MPLS-TP linear protection domains. An MPLS-TP linear protection domain (or a protection domain) is identified by mplsLpsConfigDomainIndex. A protection domain consists of two LERs, as well as the working path and protection path that connect the two LERs. The objects in this table are used to configure properties that are specific to the protection domain. Two Maintenance Entities (MEs) MUST be defined for each protection domain: one for the working path and the other for the protection path. Therefore, two entries in the mplsLpsMeConfigTable, which is for configuring the MEs used in protection switching, are associated to one entry in this table.",
      "ja": "このテーブルは、MPLS-TPのリニアプロテクションドメインを設定するために使用されます。 MPLS-TPのリニアプロテクションドメイン（または保護ドメイン）mplsLpsConfigDomainIndexによって識別されます。保護ドメインは、二つのLERを接続する2つのLERと同様に、現用パスと保護パスから構成されています。この表のオブジェクトは、保護ドメインに固有のプロパティを設定するために使用されています。保護パスの現用パス用とその他：二つの保守エンティティ（MES）は、各保護ドメインのために定義されなければなりません。したがって、保護スイッチングに使用されるのMEを設定するためのものであるmplsLpsMeConfigTable、2つのエントリは、このテーブル内の1つのエントリに関連付けられています。"
    },
    {
      "indent": 3,
      "text": "o mplsLpsStatusTable",
      "ja": "O mplsLpsStatusTable"
    },
    {
      "indent": 6,
      "text": "This table provides the current status information of MPLS-TP linear protection domains that have been configured on the system. The entries in the mplsLpsStatusTable have an AUGMENTS relationship with the entries in the mplsLpsConfigTable. When a protection domain is configured or deleted in the mplsLpsConfigTable, then the corresponding row of that session in the mplsLpsStatusTable is automatically created or deleted, respectively.",
      "ja": "このテーブルには、システム上に構成されているMPLS-TPリニアプロテクションドメインの現在のステータス情報を提供します。 mplsLpsStatusTableのエントリはmplsLpsConfigTable内のエントリとAUGMENTS関係を持っています。保護ドメインがmplsLpsConfigTableで設定または削除された場合、その後mplsLpsStatusTableでそのセッションの対応する行がそれぞれ自動的に作成または削除されます。"
    },
    {
      "indent": 3,
      "text": "o mplsLpsMeConfigTable",
      "ja": "O mplsLpsMeConfigTable"
    },
    {
      "indent": 6,
      "text": "This table is used to associate MEs to the protection domain. Each protection domain requires two MEs. One entry in the mplsLpsConfigTable is associated with two entries in this table: one for the working path and the other for the protection path of the protection domain. The mplsLpsMeConfigPath object in this table indicates that the path is either the working path or the protection path. The ME is identified by mplsOamIdMegIndex, mplsOamIdMeIndex, and mplsOamIdMeMpIndex, which are the same index values as the entry in the mplsOamIdMeTable defined in [RFC7697]. The relationship to the mplsOamIdMeTable is described in Section 6.1.",
      "ja": "このテーブルは、保護ドメインへのMEを関連付けるために使用されます。各保護ドメインは、二つのMEが必要です。保護ドメインの保護パスの現用パス用とその他：mplsLpsConfigTableにおける一つのエントリはこの表の2つのエントリに関連付けられています。この表のmplsLpsMeConfigPathオブジェクトは、パスが現用パスまたは保護パスのいずれかであることを示しています。 MEは、[RFC7697]で定義さmplsOamIdMeTable内のエントリと同一のインデックス値であるmplsOamIdMegIndex、mplsOamIdMeIndex、及びmplsOamIdMeMpIndex、によって識別されます。 mplsOamIdMeTableとの関係は、セクション6.1に記載されています。"
    },
    {
      "indent": 3,
      "text": "o mplsLpsMeStatusTable",
      "ja": "mplsLpsMeStatusTable上"
    },
    {
      "indent": 6,
      "text": "This table provides current information about the protection status of MEs that have been configured on the system. When an ME is configured or deleted in the mplsLpsMeConfigTable, then the corresponding row of that session in the mplsLpsMeStatusTable is automatically created or deleted, respectively.",
      "ja": "このテーブルには、システム上に構成されているのMEの保護ステータスに関する現在の情報を提供します。 MEはmplsLpsMeConfigTableで設定または削除された場合、その後mplsLpsMeStatusTableでそのセッションの対応する行がそれぞれ自動的に作成または削除されます。"
    },
    {
      "indent": 0,
      "text": "6. Relationship to Other MIB Modules",
      "section_title": true,
      "ja": "他のMIBモジュールへ6.関係"
    },
    {
      "indent": 0,
      "text": "6.1. Relationship to the MPLS OAM Identifiers MIB Module",
      "section_title": true,
      "ja": "6.1.  MPLS OAM識別子MIBモジュールとの関係"
    },
    {
      "indent": 3,
      "text": "Entries in the mplsOamIdMeTable [RFC7697] are extended by entries in the mplsLpsMeConfigTable. Note that the nature of the \"extends\" relationship is a sparse augmentation so that the entry in the mplsLpsMeConfigTable has the same index values as the entry in the mplsOamIdMeTable. Each time that an entry is created in the mplsOamIdMeTable for which the LER supports MPLS-TP linear protection, a row is created automatically in the mplsLpsMeConfigTable.",
      "ja": "mplsOamIdMeTable [RFC7697]のエントリはmplsLpsMeConfigTableのエントリによって拡張されます。 mplsLpsMeConfigTableのエントリがmplsOamIdMeTable内のエントリと同じインデックス値を有するように「延び」関係の性質が疎増強であることに留意されたいです。 LERは、MPLS-TPのリニア保護をサポートするためのエントリがmplsOamIdMeTableで作成されるたびに、行がmplsLpsMeConfigTableに自動的に作成されます。"
    },
    {
      "indent": 3,
      "text": "When a point-to-point transport path needs to be monitored, one ME is needed for the path and one entry in the mplsOamIdMeTable will be created. But the ME entry in the mplsOamIdMeTable may or may not participate in protection switching. If an ME participates in protection switching, an entry in the mplsLpsMeConfigTable MUST be created, and the objects in the entry indicate which protection domain this ME belongs to and whether this ME is for the working path or the protection path. If the ME does not participate in protection switching, an entry in the mplsLpsMeConfigTable does not need to be created.",
      "ja": "ポイント・ツー・ポイントの搬送経路を監視する必要がある場合は、mplsOamIdMeTableにおけるMEは、パスのために必要とされる1つのずつエントリが作成されます。しかしmplsOamIdMeTableにおけるMEのエントリは、または保護スイッチングに参加できない場合があります。 MEは、保護スイッチングに参加する場合は、mplsLpsMeConfigTable内のエントリが作成されなければならない、とエントリ内のオブジェクトは、このMEは、にして、このMEが現用パスまたは保護パスにあるかどうかを属する保護ドメインを示しています。 MEは、保護スイッチングに参加していない場合は、mplsLpsMeConfigTableのエントリを作成する必要はありません。"
    },
    {
      "indent": 0,
      "text": "7. Example of Protection Switching Configuration",
      "section_title": true,
      "ja": "保護スイッチングの設定の7例"
    },
    {
      "indent": 3,
      "text": "This example considers the protection domain configuration on an LER to provide protection for a co-routed bidirectional MPLS tunnel. For the working path and protection path of the protection domain, two Maintenance Entity Groups (MEGs) need to be configured, and each MEG contains one ME for a point-to-point transport path. For more information on the mplsOamIdMegTable and the mplsOamIdMeTable, see [RFC7697].",
      "ja": "この例では、共同でルーティング双方向MPLSトンネルの保護を提供するためにLER上の保護ドメインの設定を検討します。ワーキングパスとプロテクションドメインの予備パスのために二つの保守エンティティグループ（メガバイト）を設定する必要があり、各MEGは、ポイントツーポイント搬送路ための一MEを含有します。 mplsOamIdMegTableとmplsOamIdMeTableの詳細については、[RFC7697]を参照してください。"
    },
    {
      "indent": 3,
      "text": "Although the example described in this section shows a way to configure linear protection for MPLS-TP tunnels, this also indicates how the MIB values would be returned if they had been configured by alternative means.",
      "ja": "このセクションで説明する例では、MPLS-TPトンネルの線形保護を設定する方法を示しているが、これはまた、彼らは別の手段によって構成されていた場合MIB値が返されるかを示しています。"
    },
    {
      "indent": 3,
      "text": "The following table configures a protection domain.",
      "ja": "次の表は、保護ドメインを設定します。"
    },
    {
      "indent": 3,
      "text": "In the mplsLpsConfigTable:\nmplsLpsConfigEntry ::= SEQUENCE\n{\n   -- Protection domain index (index to the table)\n   mplsLpsConfigDomainIndex  = 3,\n   -- Protection domain name\n   mplsLpsConfigDomainName   = \"LPDomain3\",\n   mplsLpsConfigMode         = psc(1),\n   mplsLpsConfigProtectionType = oneColonOneBidirectional(2),\n   -- Mandatory parameters needed to activate the row go here\n   mplsLpsConfigRowStatus    = createAndGo(4)\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "The following table associates the MEs with the protection domain.",
      "ja": "次の表は、保護ドメインでのMEを関連付けます。"
    },
    {
      "indent": 3,
      "text": "In the mplsLpsMeConfigTable:\nMplsLpsMeConfigEntry ::= SEQUENCE\n{\n   -- MEG index (index to the table)\n   mplsOamIdMegIndex                 = 1,\n   -- ME index (index to the table)\n   mplsOamIdMeIndex                  = 1,\n   -- Maintenance Point (MP) index (index to the table)\n   mplsOamIdMeMpIndex                = 1,\n   -- Protection domain this ME belongs to\n   mplsLpsMeConfigDomain             = 3,\n   -- Configuration state\n   mplsLpsMeConfigPath               = working(1)\n}\n{\n   -- MEG index (index to the table)\n   mplsOamIdMegIndex                 = 2,\n   -- ME index (index to the table)\n   mplsOamIdMeIndex                  = 2,\n   -- MP index (index to the table)\n   mplsOamIdMeMpIndex                = 2,\n   -- Protection domain this ME belongs to\n   mplsLpsMeConfigDomain             = 3,\n   -- Configuration state\n   mplsLpsMeConfigPath               = protection(2)\n}",
      "raw": true
    },
    {
      "indent": 0,
      "text": "8. Definitions",
      "section_title": true,
      "ja": "8.定義"
    },
    {
      "indent": 3,
      "text": "This MIB module makes reference to the following documents: [RFC2578], [RFC2579], [RFC2580], [RFC3289], [RFC3411], [RFC3811], [RFC6378], [RFC7271], [RFC7697], [G8121], and [G8151].",
      "ja": "、[RFC2578]、[RFC2579]、[RFC2580]、[RFC3289]、[RFC3411]、[RFC3811]、[RFC6378]、[RFC7271]、[RFC7697]、[G8121]：このMIBモジュールは、以下の文書を参照しますそして[G8151]。"
    },
    {
      "indent": 3,
      "text": "MPLS-LPS-MIB DEFINITIONS ::= BEGIN",
      "raw": true
    },
    {
      "indent": 3,
      "text": "IMPORTS MODULE-IDENTITY, NOTIFICATION-TYPE, OBJECT-TYPE, Counter32, Unsigned32 FROM SNMPv2-SMI -- RFC 2578",
      "ja": "輸入MODULE-IDENTITY、NOTIFICATION-TYPE、OBJECT-TYPE、Counter32の、Unsigned32のはSNMPv2-SMI FROM  -  RFC 2578"
    },
    {
      "indent": 6,
      "text": "MODULE-COMPLIANCE, OBJECT-GROUP, NOTIFICATION-GROUP FROM SNMPv2-CONF -- RFC 2580",
      "ja": "MODULE-COMPLIANCE、OBJECT-GROUP、NOTIFICATION-GROUPのSNMPv2-CONF FROM  -  RFC 2580"
    },
    {
      "indent": 6,
      "text": "TEXTUAL-CONVENTION, RowStatus, TimeStamp, StorageType, TruthValue FROM SNMPv2-TC -- RFC 2579",
      "ja": "SNMPv2の-TCからのテキストの表記法、RowStatusの、タイムスタンプ、StorageType、のTruthValue  -  RFC 2579"
    },
    {
      "indent": 6,
      "text": "SnmpAdminString FROM SNMP-FRAMEWORK-MIB -- RFC 3411",
      "ja": "SNMP-FRAMEWORK-MIB FROMれるSnmpAdminString  -  RFC 3411"
    },
    {
      "indent": 6,
      "text": "IndexIntegerNextFree FROM DIFFSERV-MIB -- RFC 3289",
      "ja": "DIFFSERV-MIBからIndexIntegerNextFree  -  RFC 3289"
    },
    {
      "indent": 6,
      "text": "mplsStdMIB FROM MPLS-TC-STD-MIB -- RFC 3811",
      "ja": "RFC 3811  -  MPLS-TC-STD-MIBからmplsStdMIB"
    },
    {
      "indent": 6,
      "text": "mplsOamIdMegIndex, mplsOamIdMeIndex, mplsOamIdMeMpIndex FROM MPLS-OAM-ID-STD-MIB; -- RFC 7697",
      "ja": "mplsOamIdMegIndex、mplsOamIdMeIndex、MPLS-OAM-ID-STD-MIBからmplsOamIdMeMpIndex。 -  RFC 7697"
    },
    {
      "indent": 3,
      "text": "mplsLpsMIB MODULE-IDENTITY LAST-UPDATED \"201704040000Z\" -- April 4, 2017 ORGANIZATION \"Multiprotocol Label Switching (MPLS) Working Group\" CONTACT-INFO \" Kingston Smiler Selvaraj IP Infusion RMZ Centennial Mahadevapura Post Bangalore 560048 India Email: kingstonsmiler@gmail.com",
      "ja": "mplsLpsMIBのMODULE-IDENTITY LAST-UPDATED \"201704040000Z\"  -  2017年4月4日ORGANIZATION \"マルチプロトコルラベルスイッチング（MPLS）ワーキンググループ\" CONTACT-INFO「キングストンSmiler Selvaraj IPインフュージョンRMZセンテニアルMahadevapuraポストバンガロール560048インドメール：kingstonsmiler@gmail.com"
    },
    {
      "indent": 9,
      "text": "Venkatesan Mahalingam\nDell Technologies\n5450 Great America Parkway\nSanta Clara, CA  95054\nUnited States of America\nEmail: venkat.mahalingams@gmail.com",
      "raw": true
    },
    {
      "indent": 9,
      "text": "Daniel King Old Dog Consulting United Kingdom Email: daniel@olddog.co.uk",
      "ja": "ダニエル・キング老犬のコンサルティングイギリスEメール：daniel@olddog.co.uk"
    },
    {
      "indent": 9,
      "text": "Sam Aldrin Google, Inc. 1600 Amphitheatre Parkway Mountain View, CA 94043 United States of America Email: aldrin.ietf@gmail.com",
      "ja": "サム・オルドリングーグル株式会社1600アンフィシアターパークウェイマウンテンビュー、CA 94043アメリカ合衆国Eメール：aldrin.ietf@gmail.com"
    },
    {
      "indent": 3,
      "text": " Jeong-dong Ryoo ETRI 218 Gajeong-ro Yuseong-gu, Daejeon 34129 South Korea Email: ryoo@etri.re.kr \" DESCRIPTION \"This MIB module supports the configuration and management of MPLS-TP linear protection domains.",
      "ja": "チョン洞リュETRI 218 Gajeong-RO儒城区、大田34129韓国の電子メール：ryoo@etri.re.kr「DESCRIPTION」このMIBモジュールはMPLS-TPのリニアプロテクションドメインの設定と管理をサポートしています。"
    },
    {
      "indent": 7,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as\nauthors of the code.  All rights reserved.",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Redistribution and use in source and binary forms, with or without modification, is permitted pursuant to, and subject to the license terms contained in, the Simplified BSD License set forth in Section 4.c of the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info).\"",
      "ja": "、に基づき許可されており、中に含まれるライセンス条項に従う、簡体BSDライセンスは、IETFドキュメントに関連IETFトラストの法律規定（のセクション4.Cに記載されている変更の有無にかかわらず、ソースおよびバイナリ形式での再配布および使用http://trustee.ietf.org/license-info）。」"
    },
    {
      "indent": 3,
      "text": "REVISION \"201704040000Z\" -- April 4, 2017 DESCRIPTION \"MPLS-TP protection domain objects for LSP MEG End Points (MEPs).\"",
      "ja": "REVISION \"201704040000Z\"  -  2017年4月4日の説明は \"LSP MEGエンドポイント（MEPの）のためのMPLS-TP保護ドメインオブジェクト。\""
    },
    {
      "indent": 6,
      "text": "::= { mplsStdMIB 22 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "-- Top-level components of this MIB module.\n-- Notifications\nmplsLpsNotifications\n   OBJECT IDENTIFIER ::= { mplsLpsMIB 0 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "-- Tables, scalars\nmplsLpsObjects\n   OBJECT IDENTIFIER ::= { mplsLpsMIB 1 }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "-- Conformance\nmplsLpsConformance\n   OBJECT IDENTIFIER ::= { mplsLpsMIB 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "MplsLpsReq ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n      \"This textual convention describes an object that stores\n       the PSC Request field of the PSC control packet.  The values\n       are as follows:",
      "raw": true
    },
    {
      "indent": 10,
      "text": "noRequest\nNo Request",
      "raw": true
    },
    {
      "indent": 10,
      "text": "doNotRevert Do-not-Revert",
      "ja": "doNotRevert DO-ない、元に戻します"
    },
    {
      "indent": 10,
      "text": "reverseRequest Reverse Request",
      "ja": "reverseRequestリバースリクエスト"
    },
    {
      "indent": 10,
      "text": "exercise Exercise",
      "ja": "演習演習"
    },
    {
      "indent": 10,
      "text": "waitToRestore Wait-to-Restore",
      "ja": "復元待ちwaitToRestore"
    },
    {
      "indent": 10,
      "text": "manualSwitch Manual Switch",
      "ja": "manualSwitch手動切り替え"
    },
    {
      "indent": 10,
      "text": "signalDegrade Signal Degrade (SD)",
      "ja": "signalDegrade信号劣化（SD）"
    },
    {
      "indent": 10,
      "text": "signalFail Signal Fail (SF) forcedSwitch Forced Switch",
      "ja": "signalFail信号障害（SF）forcedSwitchの強制切り替え"
    },
    {
      "indent": 6,
      "text": " lockoutOfProtection Lockout of Protection.\" REFERENCE \"Section 4.2.2 of RFC 6378 and Section 8 of RFC 7271\" SYNTAX INTEGER { noRequest(0), doNotRevert(1), reverseRequest(2), exercise(3), waitToRestore(4), manualSwitch(5), signalDegrade(7), signalFail(10), forcedSwitch(12), lockoutOfProtection(14) }",
      "ja": "保護のlockoutOfProtectionロックアウト。RFC 6378及びRFC 7271のセクション8の」参照 \"セクション4.2.2\" SYNTAX INTEGER {noRequest（0）、doNotRevert（1）、reverseRequest（2）、運動（3）、waitToRestore（4）、 manualSwitch（5）、signalDegrade（7）、signalFail（10）、forcedSwitch（12）、lockoutOfProtection（14）}"
    },
    {
      "indent": 3,
      "text": "MplsLpsFpathPath ::= TEXTUAL-CONVENTION\n   DISPLAY-HINT \"1x:\"\n   STATUS      current\n   DESCRIPTION\n      \"This textual convention describes an object that stores\n       the Fault Path (FPath) field and Data Path (Path) field of\n       the PSC control packet.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "FPath is located in the first octet, and Path is\nlocated in the second octet.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "The value and the interpretation of the FPath field are as follows:",
      "ja": "次のように値とFPATHフィールドの解釈は以下のとおりです。"
    },
    {
      "indent": 10,
      "text": "2-255 for future extensions",
      "ja": "将来の拡張のための2-255"
    },
    {
      "indent": 10,
      "text": "1 the anomaly condition is on the working path",
      "ja": "1異常状態がワーキングパス上にあります"
    },
    {
      "indent": 10,
      "text": "0 the anomaly condition is on the protection path",
      "ja": "0異常状態は、保護パス上にあります"
    },
    {
      "indent": 10,
      "text": "The value and the interpretation of the Path field are as follows:",
      "ja": "次のように値とPathフィールドの解釈は以下のとおりです。"
    },
    {
      "indent": 10,
      "text": "2-255 for future extensions",
      "ja": "将来の拡張のための2-255"
    },
    {
      "indent": 10,
      "text": "1 protection path is transporting user data traffic",
      "ja": "1つの保護パスは、ユーザデータトラフィックを伝送されます"
    },
    {
      "indent": 6,
      "text": " 0 protection path is not transporting user data traffic.\" REFERENCE \"Sections 4.2.5 and 4.2.6 of RFC 6378\" SYNTAX OCTET STRING (SIZE (2))",
      "ja": "0保護パスは、ユーザデータトラフィックを転送されていません。」REFERENCE \"セクション4.2.5およびRFC 6378\" 構文オクテットSTRINGの4.2.6（SIZE（2））"
    },
    {
      "indent": 3,
      "text": "MplsLpsCommand ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n      \"This command allows a user to perform any action over a\n       protection domain.  If the protection command cannot be\n       executed because a request of equal or higher priority is\n       in effect, an inconsistentValue error is returned.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "The command values are as follows:",
      "ja": "次のようにコマンドの値は次のとおりです。"
    },
    {
      "indent": 10,
      "text": "noCmd This value should be returned by a read request when no command has been written to the object in question since initialization. This value may not be used in a write operation. If noCmd is used in a write operation, a wrongValue error is returned.",
      "ja": "何のコマンドが初期化以来問題のオブジェクトに書き込まれていない場合noCmdこの値は、読み出し要求によって返されるべきです。この値は、書き込み操作で使用することはできません。 noCmdが書き込み動作で使用されている場合は、wrongValueエラーが返されます。"
    },
    {
      "indent": 10,
      "text": "clear Clears all of the commands listed below for the protection domain.",
      "ja": "明確には保護ドメインのために、下記のコマンドをすべてクリアします。"
    },
    {
      "indent": 10,
      "text": "lockoutOfProtection Prevents switching traffic to the protection path.",
      "ja": "lockoutOfProtectionは保護パスにトラフィックを切り替えないようにします。"
    },
    {
      "indent": 10,
      "text": "forcedSwitch Switches traffic from the working path to the protection path.",
      "ja": "forcedSwitchは、保護パスへの現用パスからのトラフィックを切り替えます。"
    },
    {
      "indent": 10,
      "text": "manualSwitchToWork Switches traffic from the protection path to the working path.",
      "ja": "manualSwitchToWorkは現用パスにプロテクションパスからのトラフィックを切り替えます。"
    },
    {
      "indent": 10,
      "text": "manualSwitchToProtect Switches traffic from the working path to the protection path.",
      "ja": "manualSwitchToProtectは、保護パスへの現用パスからのトラフィックを切り替えます。"
    },
    {
      "indent": 10,
      "text": "exercise Used to verify the correct operation of the PSC communication and the integrity of the protection path. This command is not applicable to the PSC mode.",
      "ja": "演習では、PSCの通信と保護パスの整合性の正しい動作を検証するために使用します。このコマンドは、PSCモードには適用されません。"
    },
    {
      "indent": 10,
      "text": "freeze This command freezes the protection state and is a local command that is not signaled to the remote node. This command is not applicable to the PSC mode.",
      "ja": "このコマンドは、保護状態をフリーズし、リモートノードに通知されていない地元のコマンドであるフリーズ。このコマンドは、PSCモードには適用されません。"
    },
    {
      "indent": 6,
      "text": " clearfreeze Clears the local freeze. This command is not applicable to the PSC mode.\" REFERENCE \"Sections 3.1 and 3.2 of RFC 6378 and Sections 4.3 and 6 of RFC 7271\" SYNTAX INTEGER { noCmd(1), clear(2), lockoutOfProtection(3), forcedSwitch(4), manualSwitchToWork(5), manualSwitchToProtect(6), exercise(7), freeze(8), clearfreeze(9) }",
      "ja": "clearfreezeは地元の凍結を解除します。このコマンドは、PSCのモードに適用されない。」参照 \"セクション3.1及びRFC 6378の3.2節4.3およびRFC 7271の6\" SYNTAX INTEGER {noCmd（1）、クリア（2）、lockoutOfProtection（3）、forcedSwitch（4 ）、manualSwitchToWork（5）、manualSwitchToProtect（6）、運動（7）、凍結（8）、clearfreeze（9）}"
    },
    {
      "indent": 3,
      "text": "MplsLpsState ::= TEXTUAL-CONVENTION\n   STATUS      current\n   DESCRIPTION\n      \"This textual convention describes an object that stores\n       the current state of the PSC state machine.  The values\n       are as follows:",
      "raw": true
    },
    {
      "indent": 10,
      "text": "normal\nNormal state.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "unavLOlocal Unavailable state due to local LO command.",
      "ja": "ローカルLOコマンドによるunavLOlocal利用不可状態。"
    },
    {
      "indent": 10,
      "text": "unavSFPlocal Unavailable state due to local SF-P.",
      "ja": "地元SF-PによるunavSFPlocal利用不可状態。"
    },
    {
      "indent": 10,
      "text": "unavSDPlocal Unavailable state due to local SD-P.",
      "ja": "ローカルSD-PによるunavSDPlocal利用不可状態。"
    },
    {
      "indent": 10,
      "text": "unavLOremote Unavailable state due to remote LO message.",
      "ja": "遠隔LOメッセージによるunavLOremote利用不可状態。"
    },
    {
      "indent": 10,
      "text": "unavSFPremote Unavailable state due to remote SF-P message.",
      "ja": "unavSFPremote使用不可状態遠隔SF-Pメッセージに起因します。"
    },
    {
      "indent": 10,
      "text": "unavSDPremote Unavailable state due to remote SD-P message.",
      "ja": "リモートSD-PメッセージによるunavSDPremote利用不可状態。"
    },
    {
      "indent": 10,
      "text": "protfailSFWlocal Protecting Failure state due to local SF-W.",
      "ja": "地元SF-Wによる障害状態の保護protfailSFWlocal。"
    },
    {
      "indent": 10,
      "text": "protfailSDWlocal Protecting Failure state due to local SD-W.",
      "ja": "ローカルSD-Wによる障害状態の保護protfailSDWlocal。"
    },
    {
      "indent": 10,
      "text": "protfailSFWremote Protecting Failure state due to remote SF-W message.",
      "ja": "リモートSF-Wメッセージに起因する障害状態の保護protfailSFWremote。"
    },
    {
      "indent": 10,
      "text": "protfailSDWremote Protecting Failure state due to remote SD-W message.",
      "ja": "リモートSD-Wメッセージに起因する障害状態の保護protfailSDWremote。"
    },
    {
      "indent": 10,
      "text": "switadmFSlocal Switching Administrative state due to local FS command. Same as Protecting Administrative state due to local FS command in the PSC mode.",
      "ja": "ローカルFSコマンドによる管理状態を切り替えswitadmFSlocal。 PSCモードに起因するローカルFSコマンドへの管理状態を守ると同じ。"
    },
    {
      "indent": 10,
      "text": "switadmMSWlocal Switching Administrative state due to local MS-W command.",
      "ja": "switadmMSWlocalはローカルMS-Wコマンドによる管理状態を切り替えます。"
    },
    {
      "indent": 10,
      "text": "switadmMSPlocal Switching Administrative state due to local MS-P command. Same as Protecting Administrative state due to local MS command in the PSC mode.",
      "ja": "switadmMSPlocalはローカルMS-Pコマンドによる管理状態を切り替えます。 PSCモードに起因する局所的なMSコマンドへの管理状態を守ると同じ。"
    },
    {
      "indent": 10,
      "text": "switadmFSremote Switching Administrative state due to remote FS message. Same as Protecting Administrative state due to remote FS message in the PSC mode.",
      "ja": "switadmFSremoteが原因リモートFSメッセージへの管理状態を切り替えます。 PSCモードに起因するリモートFSメッセージへの管理状態を守ると同じ。"
    },
    {
      "indent": 10,
      "text": "switadmMSWremote Switching Administrative state due to remote MS-W message.",
      "ja": "switadmMSWremote起因リモートMS-Wメッセージに管理状態を切り替えます。"
    },
    {
      "indent": 10,
      "text": "switadmMSPremote Switching Administrative state due to remote MS-P message. Same as Protecting Administrative state due to remote MS message in the PSC mode.",
      "ja": "switadmMSPremote起因リモートMS-Pメッセージに管理状態を切り替えます。 PSCモードでのリモートMSメッセージへの管理状態を守ると同じ。"
    },
    {
      "indent": 10,
      "text": "wtr Wait-to-Restore state.",
      "ja": "WTR復元待ち状態。"
    },
    {
      "indent": 10,
      "text": "dnr Do-not-Revert state.",
      "ja": "DNRがdo--戻すない状態。"
    },
    {
      "indent": 10,
      "text": "exerLocal Exercise state due to local EXER command.",
      "ja": "ローカルEXERコマンドによるexerLocal運動状態。"
    },
    {
      "indent": 6,
      "text": " exerRemote Exercise state due to remote EXER message.\" REFERENCE \"Sections 3 and 11 of RFC 7271\"",
      "ja": "遠隔EXERメッセージによるexerRemote運動状態。」参照 『セクション3及びRFC 7271の11』"
    },
    {
      "indent": 6,
      "text": "SYNTAX INTEGER { normal(1), unavLOlocal(2), unavSFPlocal(3), unavSDPlocal(4), unavLOremote(5), unavSFPremote(6), unavSDPremote(7), protfailSFWlocal(8), protfailSDWlocal(9), protfailSFWremote(10), protfailSDWremote(11), switadmFSlocal(12), switadmMSWlocal(13), switadmMSPlocal(14), switadmFSremote(15), switadmMSWremote(16), switadmMSPremote(17), wtr(18), dnr(19), exerLocal(20), exerRemote(21) }",
      "ja": "SYNTAX INTEGER {ノーマル（1）、unavLOlocal（2）、unavSFPlocal（3）、unavSDPlocal（4）、unavLOremote（5）、unavSFPremote（6）、unavSDPremote（7）、protfailSFWlocal（8）、protfailSDWlocal（9）、protfailSFWremote（ 10）、protfailSDWremote（11）、switadmFSlocal（12）、switadmMSWlocal（13）、switadmMSPlocal（14）、switadmFSremote（15）、switadmMSWremote（16）、switadmMSPremote（17）、WTR（18）、DNR（19）、exerLocal（ 20）、exerRemote（21）}"
    },
    {
      "indent": 3,
      "text": "-- Start of -- MPLS-TP Linear Protection Switching Configuration Table. -- This table supports the addition, configuration, and deletion -- of MPLS-TP linear protection domains.",
      "ja": " -  MPLS-TPリニア保護スイッチング構成表 - のスタート。 -  MPLS-TPリニア保護ドメインの - このテーブルには、さらに、コンフィギュレーション、および削除をサポートしています。"
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigDomainIndexNext OBJECT-TYPE\n   SYNTAX      IndexIntegerNextFree (0..4294967295)\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"This object contains an unused value for\n       mplsLpsConfigDomainIndex, or a zero to indicate that\n       the number of unassigned entries has been exhausted.\n       Negative values are not allowed, as they do not correspond\n       to valid values of mplsLpsConfigDomainIndex.\"\n   ::= { mplsLpsObjects 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigTable OBJECT-TYPE\n   SYNTAX      SEQUENCE OF MplsLpsConfigEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"This table lists the MPLS-TP linear protection domains that\n       have been configured on the system.\n       An entry is created by a network operator who wants to run\n       the MPLS-TP linear protection protocol for the protection\n       domain.\"\n   ::= { mplsLpsObjects 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigEntry OBJECT-TYPE\n   SYNTAX      MplsLpsConfigEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"A conceptual row in the mplsLpsConfigTable.\"\n   INDEX { mplsLpsConfigDomainIndex }\n   ::= { mplsLpsConfigTable 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "MplsLpsConfigEntry ::= SEQUENCE {\n   mplsLpsConfigDomainIndex         Unsigned32,\n   mplsLpsConfigDomainName          SnmpAdminString,\n   mplsLpsConfigMode                INTEGER,\n   mplsLpsConfigProtectionType      INTEGER,\n   mplsLpsConfigRevertive           INTEGER,\n   mplsLpsConfigSdThreshold         Unsigned32,\n   mplsLpsConfigSdBadSeconds        Unsigned32,\n   mplsLpsConfigSdGoodSeconds       Unsigned32,\n   mplsLpsConfigWaitToRestore       Unsigned32, mplsLpsConfigHoldOff             Unsigned32,\n   mplsLpsConfigContinualTxInterval Unsigned32,\n   mplsLpsConfigRapidTxInterval     Unsigned32,\n   mplsLpsConfigCommand             MplsLpsCommand,\n   mplsLpsConfigCreationTime        TimeStamp,\n   mplsLpsConfigRowStatus           RowStatus,\n   mplsLpsConfigStorageType         StorageType\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigDomainIndex OBJECT-TYPE SYNTAX Unsigned32 (1..4294967295) MAX-ACCESS not-accessible STATUS current DESCRIPTION \"Index for the conceptual row identifying a protection domain. Operators should obtain new values for row creation in this table by reading mplsLpsConfigDomainIndexNext.",
      "ja": "mplsLpsConfigDomainIndexのOBJECT-TYPEの構文Unsigned32保護ドメインを特定する概念的な列のための（1 4294967295）MAX-ACCESSステータス現在の説明「インデックス。演算子mplsLpsConfigDomainIndexNextを読み取ることによってこの表の行作成の新しい値を得るべきです。"
    },
    {
      "indent": 6,
      "text": "    When the value of this object is the same as the value of\n    mplsLpsMeConfigDomain, the mplsLpsMeConfigDomain is defined\n    as either the working path or the protection path for this\n    protection domain.\"\n::= { mplsLpsConfigEntry 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigDomainName OBJECT-TYPE\n   SYNTAX      SnmpAdminString (SIZE (0..32))\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"Textual name that represents the MPLS-TP linear protection\n       domain.  It facilitates easy administrative identification of\n       each protection domain.\"\n   DEFVAL {\"\"}\n   ::= { mplsLpsConfigEntry 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigMode OBJECT-TYPE SYNTAX INTEGER { psc(1), aps(2) } MAX-ACCESS read-create STATUS current DESCRIPTION \"The mode of the MPLS-TP linear protection mechanism. This can be either PSC or APS, as follows:",
      "ja": "mplsLpsConfigModeのOBJECT-TYPE SYNTAX INTEGER {PSCは、（1）、APS（2）} MAX-ACCESSリード作成ステータス現在の説明「MPLS-TP線形保護機構のモードこれは以下のように、PSC又はAPSのいずれかであり得ます："
    },
    {
      "indent": 10,
      "text": "PSC\nThe Protection State Coordination mode as described in\nRFC 6378.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "APS The Automatic Protection Switching mode as described in RFC 7271.",
      "ja": "RFC 7271で説明したように自動保護スイッチングモードをAPS。"
    },
    {
      "indent": 10,
      "text": "This object may not be modified if the associated mplsLpsConfigRowStatus object is equal to active(1).",
      "ja": "このオブジェクトは、関連mplsLpsConfigRowStatusオブジェクトはアクティブと等しい場合修正されないかもしれません（1）。"
    },
    {
      "indent": 10,
      "text": "The value of this object is not supposed to be changed during operation. When the value should be changed, the protection processes in both LERs MUST be restarted with the same new value.",
      "ja": "このオブジェクトの値は、動作中に変更されることになっていません。値を変更する必要がある場合は、両方のLERで保護プロセスが同じ新しい値で再起動する必要があります。"
    },
    {
      "indent": 6,
      "text": "    If this value is changed at one LER during operation,\n    the LER will generate PSC packets with a new\n    Capabilities TLV value.  This will result in\n    mplsLpsEventCapabilitiesMismatch notifications at both LERs.\"\nREFERENCE\n   \"Sections 9.2 and 10 of RFC 7271\"\nDEFVAL {psc}\n::= { mplsLpsConfigEntry 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigProtectionType OBJECT-TYPE SYNTAX INTEGER { onePlusOneUnidirectional(1), oneColonOneBidirectional(2), onePlusOneBidirectional(3) } MAX-ACCESS read-create STATUS current DESCRIPTION \"The protection architecture type of the protection domain. This object represents both the bridge type, which can be either a permanent bridge (1+1) or a selector bridge (1:1); and the switching scheme, which can be either unidirectional or bidirectional.",
      "ja": "mplsLpsConfigProtectionTypeのOBJECT-TYPE SYNTAX INTEGER {onePlusOneUnidirectional（1）、oneColonOneBidirectional（2）、onePlusOneBidirectional（3）} MAX-ACCESSはリード作成ステータス現在の説明「保護領域の保護アーキテクチャのタイプ。このオブジェクトは、ブリッジ型の両方を示し、これ永久ブリッジ（1 + 1）またはセレクタ橋のいずれかであることができる（1：1）;および単方向または双方向のいずれかであることができるスイッチング方式、。"
    },
    {
      "indent": 10,
      "text": "1+1\nIn the 1+1 protection scheme, a fully dedicated protection\npath is allocated.  Data traffic is copied and fed at the\nsource to both the working path and the protection path.\nThe traffic on the working path and protection path is\ntransmitted simultaneously to the sink of the protection\ndomain, where selection between the working path and the\nprotection path is performed.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "1:1 In the 1:1 protection scheme, a protection path is allocated to protect against a defect, failure, or degradation on the working path. In normal conditions, data traffic is transmitted over the working path, while the protection path functions in the idle state. If there is a defect on the working path or a specific administrative request, traffic is switched to the protection path.",
      "ja": "1：1で1：1プロテクション方式は、保護パスは現用パス上の欠陥、障害、または劣化から保護するために割り当てられます。通常の状態では、データトラフィックは、アイドル状態の予備パス機能ながら、現用パスを介して送信されます。現用パスまたは特定の管理要求に欠陥がある場合は、トラフィックは保護パスに切り替えています。"
    },
    {
      "indent": 10,
      "text": "bidirectional In the bidirectional protection scheme, both directions will be switched simultaneously even if the fault applies to only one direction of the path.",
      "ja": "双方向の保護方式で双方向のは、両方の方向は、障害がパスの一方向のみに適用された場合でも、同時に切り替えられます。"
    },
    {
      "indent": 10,
      "text": "unidirectional In the unidirectional protection scheme, protection switching will be performed independently for each direction of a bidirectional transport path.",
      "ja": "一方向保護方式で一方向、保護スイッチングは、双方向搬送路の各方向に対して独立して行われます。"
    },
    {
      "indent": 10,
      "text": "This object may not be modified if the associated mplsLpsConfigRowStatus object is equal to active(1).\"",
      "ja": "関連mplsLpsConfigRowStatusオブジェクトは、（1）アクティブに等しい場合、このオブジェクトは修正されないかもしれません。」"
    },
    {
      "indent": 6,
      "text": "REFERENCE\n   \"Section 4.2.3 of RFC 6378\"\nDEFVAL {oneColonOneBidirectional}\n::= { mplsLpsConfigEntry 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigRevertive OBJECT-TYPE SYNTAX INTEGER { nonrevertive(1), revertive(2) } MAX-ACCESS read-create STATUS current DESCRIPTION \"This object represents the reversion mode of the linear protection domain. The reversion mode of the protection mechanism may be either revertive or non-revertive.",
      "ja": "mplsLpsConfigRevertive OBJECT-TYPE SYNTAX INTEGER {復帰、（1）非復元（2）} MAX-ACCESSリード作成ステータス現在の説明は「このオブジェクトは、線形保護ドメインの復帰モードを表す。保護機構の復帰モードが復帰のいずれであってもよいですまたは非リバーティブ。"
    },
    {
      "indent": 10,
      "text": "nonrevertive\nIn the non-revertive mode, after a service has been recovered,\ntraffic will be forwarded on the protection path.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "revertive In the revertive mode, after a service has been recovered, traffic will be redirected back onto the original working path.",
      "ja": "サービスが回復された後、トラフィックが元の現用パスへリダイレクトされます、リバーティブモードでは、リバーティブ。"
    },
    {
      "indent": 6,
      "text": "    This object may not be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Section 4.2.4 of RFC 6378\"\nDEFVAL { revertive }\n::= { mplsLpsConfigEntry 5 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigSdThreshold OBJECT-TYPE SYNTAX Unsigned32 (0..100) MAX-ACCESS read-create STATUS current DESCRIPTION \"This object holds the threshold value of the Signal Degrade (SD) defect in percent. In order to detect the SD defect, the MPLS-TP packet loss measurement (LM) is performed every second.",
      "ja": "mplsLpsConfigSdThreshold OBJECT-TYPE構文Unsigned32（0..100）MAX-ACCESSはリード作成ステータス現在の説明は「このオブジェクトはパーセントで信号劣化（SD）欠陥の閾値を保持する。SDの欠陥を検出するために、MPLS-をTPパケット損失測定（LM）は毎秒行われます。"
    },
    {
      "indent": 10,
      "text": "If either the packet loss is negative (i.e., there are more\npackets received than transmitted) or the packet loss ratio\n(lost packets/transmitted packets) in percent is greater than\nthis threshold value, a Bad Second is declared.\nOtherwise, a Good Second is declared.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "The SD defect is detected if there are mplsLpsConfigSdBadSeconds consecutive Bad Seconds and cleared if there are mplsLpsConfigSdGoodSeconds consecutive Good Seconds.",
      "ja": "SD欠陥がmplsLpsConfigSdBadSeconds連続で悪い秒がある場合に検出され、mplsLpsConfigSdGoodSeconds連続でグッド秒がある場合にクリアされます。"
    },
    {
      "indent": 6,
      "text": "    This object may be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Clause 6.1.3.3 of ITU-T Recommendation G.8121/Y.1381 and\n    Table 8-1 of ITU-T Recommendation G.8151/Y.1374\"\nDEFVAL { 30 }\n::= { mplsLpsConfigEntry 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigSdBadSeconds OBJECT-TYPE SYNTAX Unsigned32 (2..10) UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"This object holds the number of Bad Seconds to detect the SD.",
      "ja": "mplsLpsConfigSdBadSeconds OBJECT-TYPE構文Unsigned32（2..10）UNITS「秒」MAX-ACCESSはリード作成しますステータス現在の説明は「このオブジェクトは、SDを検出するために、不正な秒数を保持しています。"
    },
    {
      "indent": 10,
      "text": "If the number of consecutive Bad Seconds reaches this value,\nthe SD defect is detected and used as an input to\nthe protection switching process.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "    This object may be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Clause 6.1.3.3 of ITU-T Recommendation G.8121/Y.1381 and\n    Table 8-1 of ITU-T Recommendation G.8151/Y.1374\"\nDEFVAL { 10 }\n::= { mplsLpsConfigEntry 7 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigSdGoodSeconds OBJECT-TYPE SYNTAX Unsigned32 (2..10) UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"This object holds the number of Good Seconds to declare the clearance of an SD defect.",
      "ja": "mplsLpsConfigSdGoodSeconds OBJECT-TYPE構文Unsigned32（2..10）UNITS「秒」MAX-ACCESSはリード作成しますステータス現在の説明は「このオブジェクトは、SD欠陥のクリアランスを宣言するグッド秒数を保持しています。"
    },
    {
      "indent": 10,
      "text": "After an SD defect occurs on a path, if the number of\nconsecutive Good Seconds reaches this value for the\ndegraded path, the clearance of the SD defect is declared\nand used as an input to the protection switching process.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "    This object may be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Clause 6.1.3.3 of ITU-T Recommendation G.8121/Y.1381 and\n    Table 8-1 of ITU-T Recommendation G.8151/Y.1374\"\nDEFVAL { 10 }\n::= { mplsLpsConfigEntry 8 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigWaitToRestore OBJECT-TYPE SYNTAX Unsigned32 (5..12) UNITS \"minutes\" MAX-ACCESS read-create STATUS current DESCRIPTION \"This object holds the Wait-to-Restore timer value in minutes and can be configured in 1-minute intervals between 5 and 12 minutes.",
      "ja": "mplsLpsConfigWaitToRestore OBJECT-TYPE構文Unsigned32（5..12）UNITS「分」MAX-ACCESSはリード作成しますステータス現在の説明は「このオブジェクトは分単位で復元待ちタイマー値を保持し、5の間で1分間隔で設定することができますそして12分。"
    },
    {
      "indent": 10,
      "text": "The WTR timer is used to delay the reversion of the PSC state\nto the Normal state when recovering from a failure condition\non the working path when the protection domain is configured\nfor revertive behavior.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "    This object may not be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Section 3.5 of RFC 6378\"\nDEFVAL { 5 }\n::= { mplsLpsConfigEntry 9 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigHoldOff OBJECT-TYPE SYNTAX Unsigned32 (0..100) UNITS \"deciseconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The hold-off time in deciseconds. Represents the time between SF/SD condition detection and declaration of an SF/SD request to the protection switching logic. It is intended to avoid unnecessary switching when a lower-layer protection mechanism is in place. Can be configured in intervals of 100 milliseconds.",
      "ja": "mplsLpsConfigHoldOffのOBJECT-TYPE構文Unsigned32（0..100）ユニットはMAX-ACCESSはリード作成ステータス現在の説明「1/10秒単位でホールドオフ時間を「1/10秒単位」SF / SD状態検出及びSF / SDの宣言間の時間を表します保護スイッチングロジックへの要求。下位層の保護メカニズムが所定の位置にあるときに、不必要なスイッチングを回避するためであるが。100ミリ秒間隔で設定することができます。"
    },
    {
      "indent": 10,
      "text": "When a new defect or a more severe defect occurs on\nthe active path (the path from which the selector selects\nthe user data traffic) and this value is non-zero,\nthe hold-off timer will be started.  A defect on the standby path (the path from which the selector does not select the\nuser data traffic) does not trigger the start of the hold-off\ntimer, as there is no need for a traffic switchover.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "    This object may not be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Section 3.1 of RFC 6378\"\nDEFVAL { 0 }\n::= { mplsLpsConfigEntry 10 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigContinualTxInterval OBJECT-TYPE SYNTAX Unsigned32 (1..20) UNITS \"seconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The Continual Tx Time in seconds. Represents the time interval to send the continual PSC packet to the other end, based on the current state.",
      "ja": "mplsLpsConfigContinualTxInterval OBJECT-TYPE構文Unsigned32（1..20）UNITS「秒」MAX-ACCESSはリード作成しますステータス現在の説明は「継続的な送信時間を秒単位で。基づいて、もう一方の端には継続的なPSCのパケットを送信する時間間隔を表します現在の状態。"
    },
    {
      "indent": 6,
      "text": "    This object may not be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Section 4.1 of RFC 6378\"\nDEFVAL { 5 }\n::= { mplsLpsConfigEntry 11 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigRapidTxInterval OBJECT-TYPE SYNTAX Unsigned32 (1000..20000) UNITS \"microseconds\" MAX-ACCESS read-create STATUS current DESCRIPTION \"The Rapid Tx interval in microseconds. Represents the time interval to send the PSC packet to the other end, when there is a change in the state of the linear protection domain due to local input. The default value is 3.3 milliseconds (3300 microseconds).",
      "ja": "mplsLpsConfigRapidTxInterval OBJECT-TYPE構文Unsigned32（1000..20000）UNITS「マイクロ秒」MAX-ACCESSはリード作成ステータス現在の説明「マイクロ秒の急速な送信間隔を。存在する場合、もう一方の端にPSCパケットを送信する時間間隔を表しますローカル入力によるリニアプロテクションドメインの状態の変化。デフォルト値は3.3ミリ秒（3300ミリ秒）です。"
    },
    {
      "indent": 6,
      "text": "    This object may not be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Section 4.1 of RFC 6378\"\nDEFVAL { 3300 }\n::= { mplsLpsConfigEntry 12 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigCommand OBJECT-TYPE SYNTAX MplsLpsCommand MAX-ACCESS read-create STATUS current DESCRIPTION \"Allows the initiation of an operator command on the protection domain.",
      "ja": "mplsLpsConfigCommandのOBJECT-TYPE SYNTAX MplsLpsCommand MAX-ACCESSはリード作成しますステータス現在の説明は「保護ドメイン上のオペレータコマンドの開始を可能にします。"
    },
    {
      "indent": 10,
      "text": "When read, this object returns the last command written\nor noCmd if no command has been written since initialization.\nThe return of the last command written does not imply that\nthis command is currently in effect.  This request may have\nbeen preempted by a higher-priority local or remote request.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "    This object may be modified if the associated\n    mplsLpsConfigRowStatus object is equal to active(1).\"\nREFERENCE\n   \"Sections 3.1 and 3.2 of RFC 6378 and Sections 4.3 and 6 of\n    RFC 7271\"\nDEFVAL { noCmd }\n::= { mplsLpsConfigEntry 13 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigCreationTime OBJECT-TYPE\n   SYNTAX      TimeStamp\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The value of sysUpTime at the time the row was created.\"\n   ::= { mplsLpsConfigEntry 14 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigRowStatus OBJECT-TYPE\n   SYNTAX      RowStatus\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"This object represents the status of the MPLS-TP linear\n       protection domain entry.  This variable is used to\n       create, modify, and/or delete a row in this table.\"\n   ::= { mplsLpsConfigEntry 15 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsConfigStorageType OBJECT-TYPE\n   SYNTAX      StorageType\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"The storage type for this conceptual row.\n       Conceptual rows having the value 'permanent' need not\n       allow write access to any columnar objects in the row.\"\n   DEFVAL      { nonVolatile }\n   ::= { mplsLpsConfigEntry 16 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- -- MPLS-TP Linear Protection Switching Status Table. -- This table provides protection domain statistics. --",
      "ja": " -   - ステータステーブルを切り替えMPLS-TPリニアプロテクション。 - このテーブルには、保護ドメインの統計情報を提供します。 - "
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusTable OBJECT-TYPE\n   SYNTAX      SEQUENCE OF MplsLpsStatusEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"This table provides status information about MPLS-TP\n       linear protection domains that have been configured\n       on the system.\"\n   ::= { mplsLpsObjects 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusEntry OBJECT-TYPE\n   SYNTAX      MplsLpsStatusEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"A conceptual row in the mplsLpsStatusTable.\"\n   AUGMENTS { mplsLpsConfigEntry }\n   ::= { mplsLpsStatusTable 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "MplsLpsStatusEntry ::= SEQUENCE {\n   mplsLpsStatusState                 MplsLpsState,\n   mplsLpsStatusReqRcv                MplsLpsReq,\n   mplsLpsStatusReqSent               MplsLpsReq,\n   mplsLpsStatusFpathPathRcv          MplsLpsFpathPath,\n   mplsLpsStatusFpathPathSent         MplsLpsFpathPath,\n   mplsLpsStatusRevertiveMismatch     TruthValue,\n   mplsLpsStatusProtecTypeMismatch    TruthValue,\n   mplsLpsStatusCapabilitiesMismatch  TruthValue,\n   mplsLpsStatusPathConfigMismatch    TruthValue,\n   mplsLpsStatusFopNoResponses        Counter32,\n   mplsLpsStatusFopTimeouts           Counter32\n} mplsLpsStatusState OBJECT-TYPE\n   SYNTAX      MplsLpsState\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The current state of the PSC state machine.\"\n   REFERENCE\n      \"Section 11 of RFC 7271\"\n   ::= { mplsLpsStatusEntry 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusReqRcv OBJECT-TYPE\n   SYNTAX      MplsLpsReq\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The current value of the PSC Request field received on\n       the most recent PSC packet.\"\n   REFERENCE\n      \"Section 4.2 of RFC 6378\"\n   ::= { mplsLpsStatusEntry 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusReqSent OBJECT-TYPE\n   SYNTAX      MplsLpsReq\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The current value of the PSC Request field sent on the\n       most recent PSC packet.\"\n   REFERENCE\n      \"Section 4.2 of RFC 6378\"\n   ::= { mplsLpsStatusEntry 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusFpathPathRcv OBJECT-TYPE\n   SYNTAX      MplsLpsFpathPath\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The current value of the FPath and Path fields received\n       on the most recent PSC packet.\"\n   REFERENCE\n      \"Section 4.2 of RFC 6378\"\n   ::= { mplsLpsStatusEntry 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusFpathPathSent OBJECT-TYPE\n   SYNTAX      MplsLpsFpathPath\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"The current value of the FPath and Path fields sent\n       on the most recent PSC packet.\"\n   REFERENCE\n      \"Section 4.2 of RFC 6378\"\n   ::= { mplsLpsStatusEntry 5 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusRevertiveMismatch OBJECT-TYPE\n   SYNTAX      TruthValue\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"This object indicates a provisioning mismatch in the\n       revertive mode across the protection domain endpoints.\n       The value of this object becomes true when a PSC message with\n       an incompatible Revertive field is received or false when a\n       PSC message with a compatible Revertive field is received.\"\n   REFERENCE\n      \"Section 12 of RFC 7271\"\n   ::= { mplsLpsStatusEntry 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusProtecTypeMismatch OBJECT-TYPE\n   SYNTAX      TruthValue\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"This object indicates a provisioning mismatch in the\n       protection type, representing both the bridge type and the\n       switching type, across the protection domain endpoints.\n       The value of this object becomes true when a PSC message with\n       an incompatible Protection Type (PT) field is received or\n       false when a PSC message with a compatible PT field is\n       received.\"\n   REFERENCE\n      \"Section 12 of RFC 7271\"\n   ::= { mplsLpsStatusEntry 7 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusCapabilitiesMismatch OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-only STATUS current DESCRIPTION \"This object indicates a provisioning mismatch in Capabilities TLVs across the protection domain endpoints. The value of this object becomes true when a PSC message with an incompatible Capabilities TLV field is received or false when a PSC message with a compatible Capabilities TLV field is received.",
      "ja": "mplsLpsStatusCapabilitiesMismatchのOBJECT-TYPEの構文のTruthValue MAX-ACCESS read-only説明は「このオブジェクトは、保護ドメインのエンドポイントを横切る能力のTLVの中にプロビジョニングミスマッチを示す。互換性のない機能のTLVフィールドを有するPSCメッセージを受信したとき、このオブジェクトの値がtrueになりますまたは虚偽の互換性のある機能のTLVフィールドを持つPSCメッセージを受信したとき。"
    },
    {
      "indent": 6,
      "text": "    The Capabilities TLV with 0xF8000000 indicates that the APS\n    mode is used for the MPLS-TP linear protection mechanism,\n    whereas the PSC mode either (1) uses the Capabilities TLV\n    with a value of 0x0 or (2) does not use the Capabilities TLV\n    because the TLV does not exist.\"\nREFERENCE\n   \"Section 12 of RFC 7271\"\n::= { mplsLpsStatusEntry 8 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusPathConfigMismatch OBJECT-TYPE SYNTAX TruthValue MAX-ACCESS read-only STATUS current DESCRIPTION \"This object indicates a provisioning mismatch in the protection path configuration for PSC communication across the protection domain endpoints.",
      "ja": "mplsLpsStatusPathConfigMismatchのOBJECT-TYPEの構文のTruthValue MAX-ACCESS read-only説明は「このオブジェクトは、保護ドメインのエンドポイントを横切るPSC通信のための予備パス構成でプロビジョニングミスマッチを示しています。"
    },
    {
      "indent": 6,
      "text": "    The value of this object becomes true when a PSC message is\n    received from the working path or false when a PSC message\n    is received from the protection path.\"\nREFERENCE\n   \"Section 12 of RFC 7271\"\n::= { mplsLpsStatusEntry 9 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusFopNoResponses OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object holds the number of occurrences of protocol failure due to a lack of response to a traffic switchover request within 50 ms.",
      "ja": "mplsLpsStatusFopNoResponsesのOBJECT-TYPE SYNTAXカウンタACCESS read-only説明は「この目的は、50ミリ秒以内にトラフィック切り替え要求に対する応答の欠如のために、プロトコルの失敗の発生回数を保持します。"
    },
    {
      "indent": 6,
      "text": "    When there is a traffic switchover due to a local request,\n    a 50 ms timer is started to detect protocol failure due to\n    no response.  If there is no PSC message received with the\n    same Path value as the Path value in the transmitted\n    PSC message until the 50 ms timer expires, protocol failure\n    due to no response occurs.\"\nREFERENCE\n   \"Section 12 of RFC 7271\"\n::= { mplsLpsStatusEntry 10 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsStatusFopTimeouts OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"This object holds the number of occurrences of protocol failure due to no PSC message being received during at least 3.5 times the long PSC message interval.",
      "ja": "mplsLpsStatusFopTimeouts OBJECT-TYPE SYNTAXカウンタACCESS read-only説明は「このオブジェクトにより何PSCメッセージは、少なくとも3.5倍長いPSCメッセージインターバルの間に受信されないれることにプロトコルの失敗の発生回数を保持します。"
    },
    {
      "indent": 6,
      "text": "    When no PSC message is received on the protection path during\n    at least 3.5 times the long PSC message interval and there\n    is no defect on the protection path, protocol failure due to\n    no PSC message occurs.\"\nREFERENCE\n   \"Section 12 of RFC 7271\"\n::= { mplsLpsStatusEntry 11 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- MPLS-TP Linear Protection ME Association Configuration Table. -- This table supports the addition, configuration, and deletion -- of MPLS-TP linear protection MEs in protection domains.",
      "ja": " -  MPLS-TPリニアプロテクションME会構成表。 -  MPLS-TPリニア保護のMEの保護ドメイン内 - このテーブルには、さらに、コンフィギュレーション、および削除をサポートしています。"
    },
    {
      "indent": 3,
      "text": "mplsLpsMeConfigTable OBJECT-TYPE\n   SYNTAX      SEQUENCE OF MplsLpsMeConfigEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"This table lists ME associations that have been configured\n       in protection domains.\"\n   ::= { mplsLpsObjects 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsMeConfigEntry OBJECT-TYPE SYNTAX MplsLpsMeConfigEntry MAX-ACCESS not-accessible STATUS current DESCRIPTION \"A conceptual row in the mplsLpsMeConfigTable. There is a sparse relationship between the conceptual rows of this table and the mplsOamIdMeTable.",
      "ja": "mplsLpsMeConfigTableでmplsLpsMeConfigEntry OBJECT-TYPE構文MplsLpsMeConfigEntry MAX-ACCESSステータス現在の説明は「概念的な列。この表の概念的な行とmplsOamIdMeTable間の疎な関係が存在します。"
    },
    {
      "indent": 10,
      "text": "Each time that an entry is created in the mplsOamIdMeTable\nfor which the LER supports MPLS-TP linear protection,\na row is created automatically in the mplsLpsMeConfigTable.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "An entry in this table is related to a single entry in the mplsOamIdMeTable. When a point-to-point transport path needs to be monitored, one ME is needed for the path, and one entry in the mplsOamIdMeTable will be created. But the ME entry in the mplsOamIdMeTable may or may not participate in protection switching.",
      "ja": "この表のエントリはmplsOamIdMeTableで単一のエントリに関連しています。ポイント・ツー・ポイントの搬送路は1 ME、監視する必要がある場合は、パスのために必要とされ、かつmplsOamIdMeTable内の1つのエントリが作成されます。しかしmplsOamIdMeTableにおけるMEのエントリは、または保護スイッチングに参加できない場合があります。"
    },
    {
      "indent": 10,
      "text": "If an ME participates in protection switching, an entry in the mplsLpsMeConfigTable MUST be created, and the objects in the entry indicate which protection domain this ME belongs to and whether this ME is for the working path or the protection path.",
      "ja": "MEは、保護スイッチングに参加する場合は、mplsLpsMeConfigTable内のエントリが作成されなければならない、とエントリ内のオブジェクトは、このMEは、にして、このMEが現用パスまたは保護パスにあるかどうかを属する保護ドメインを示しています。"
    },
    {
      "indent": 6,
      "text": "    If the ME does not participate in protection switching,\n    an entry in the mplsLpsMeConfigTable does not need\n    to be created.\"\nINDEX {mplsOamIdMegIndex, mplsOamIdMeIndex, mplsOamIdMeMpIndex}\n::= { mplsLpsMeConfigTable 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "MplsLpsMeConfigEntry ::= SEQUENCE {\n   mplsLpsMeConfigDomain                Unsigned32,\n   mplsLpsMeConfigPath                  INTEGER\n} mplsLpsMeConfigDomain OBJECT-TYPE\n   SYNTAX      Unsigned32 (0..4294967295)\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"This object holds the mplsLpsConfigDomainIndex value for\n       the protection domain in which this ME is included.\n       If this ME is not part of any protection domain, then\n       this object contains the value 0.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "    When the value of this object is the same as the value of\n    mplsLpsConfigDomainIndex, the object is defined as either\n    the working path or the protection path of the\n    protection domain corresponding to mplsLpsConfigDomainIndex.\"\nDEFVAL { 0 }\n::= { mplsLpsMeConfigEntry 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsMeConfigPath OBJECT-TYPE\n   SYNTAX      INTEGER { working(1), protection(2) }\n   MAX-ACCESS  read-create\n   STATUS      current\n   DESCRIPTION\n      \"This object represents whether the ME is configured\n       as the working path or the protection path.\"\n   REFERENCE\n      \"Section 4.3 of RFC 6378\"\n   ::= { mplsLpsMeConfigEntry 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- -- MPLS Linear Protection ME Status Table. -- This table provides protection switching ME statistics. --",
      "ja": " -   -  MPLSリニアプロテクションME状態表。 - このテーブルには、MEに統計を切り替える保護を提供します。 - "
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusTable OBJECT-TYPE\n   SYNTAX      SEQUENCE OF MplsLpsMeStatusEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"This table contains status information of all the MEs\n       that are included in MPLS-TP linear protection domains.\"\n   ::= { mplsLpsObjects 5 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusEntry OBJECT-TYPE\n   SYNTAX      MplsLpsMeStatusEntry\n   MAX-ACCESS  not-accessible\n   STATUS      current\n   DESCRIPTION\n      \"A conceptual row in the mplsLpsMeStatusTable.\"\n   AUGMENTS { mplsLpsMeConfigEntry }\n   ::= { mplsLpsMeStatusTable 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "MplsLpsMeStatusEntry ::= SEQUENCE {\n   mplsLpsMeStatusCurrent               BITS,\n   mplsLpsMeStatusSignalDegrades        Counter32,\n   mplsLpsMeStatusSignalFailures        Counter32,\n   mplsLpsMeStatusSwitchovers           Counter32,\n   mplsLpsMeStatusLastSwitchover        TimeStamp,\n   mplsLpsMeStatusSwitchoverSeconds     Counter32\n}",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusCurrent OBJECT-TYPE SYNTAX BITS { localSelectTraffic(0), localSD(1), localSF(2) } MAX-ACCESS read-only STATUS current DESCRIPTION \"Indicates the current state of the ME.",
      "ja": "mplsLpsMeStatusCurrent OBJECT-TYPE構文BITS {localSelectTraffic（0）、localSD（1）、localSF（2）} MAX-ACCESS read-onlyステータス現在の説明は「MEの現在の状態を示します。"
    },
    {
      "indent": 10,
      "text": "localSelectTraffic\nThis bit indicates that traffic is being selected from\nthis ME.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "localSD This bit implies that a local Signal Degrade condition is in effect on this ME/path.",
      "ja": "localSDこのビットはローカル信号劣化条件は、このME /パスに有効であることを意味します。"
    },
    {
      "indent": 6,
      "text": "    localSF\n    This bit implies that a local Signal Fail condition is\n    in effect on this ME/path.\"\nREFERENCE\n   \"Section 4.3 of RFC 6378 and Section 7 of RFC 7271\"\n::= { mplsLpsMeStatusEntry 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusSignalDegrades OBJECT-TYPE\n   SYNTAX      Counter32\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"Represents the count of Signal Degrade conditions.\n       For the detection and clearance of Signal Degrade,\n       see the description of mplsLpsConfigSdThreshold.\"\n   REFERENCE\n      \"Section 7 of RFC 7271\"\n   ::= { mplsLpsMeStatusEntry 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusSignalFailures OBJECT-TYPE\n   SYNTAX      Counter32\n   MAX-ACCESS  read-only\n   STATUS      current\n   DESCRIPTION\n      \"Represents the count of Signal Fail conditions.\n       This condition occurs when the OAM running on this ME\n       detects the Signal Fail event.\"\n   REFERENCE\n      \"Section 4.3 of RFC 6378\"\n   ::= { mplsLpsMeStatusEntry 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusSwitchovers OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION \"Represents the count of switchovers that happened in this ME.",
      "ja": "mplsLpsMeStatusSwitchovers OBJECT-TYPE SYNTAXカウンタACCESS read-onlyステータス現在の説明は「このMEで起こったスイッチオーバーの数を表します。"
    },
    {
      "indent": 10,
      "text": "When the mplsLpsMeConfigPath value is 'working', this object\nwill return the number of times that traffic has been\nswitched from this working path to the protection path.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "    When the mplsLpsMeConfigPath value is 'protection', this\n    object will return the number of times that traffic has been\n    switched back to the working path from this protection path.\"\nREFERENCE\n   \"Section 4.3 of RFC 6378\"\n::= { mplsLpsMeStatusEntry 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusLastSwitchover OBJECT-TYPE SYNTAX TimeStamp MAX-ACCESS read-only STATUS current DESCRIPTION \"This object holds the value of sysUpTime at the time that the last switchover happened.",
      "ja": "mplsLpsMeStatusLastSwitchoverのOBJECT-TYPE構文タイムスタンプMAX-ACCESS read-onlyステータス現在の説明は「このオブジェクト最後のスイッチオーバーが起こった時のsysUpTimeの値を保持します。"
    },
    {
      "indent": 10,
      "text": "When the mplsLpsMeConfigPath value is 'working', this object\nwill return the value of sysUpTime when traffic was switched\nfrom this path to the protection path.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "If traffic has never switched to the protection path, the value 0 will be returned.",
      "ja": "トラフィックは保護パスに切り替えることがない場合、値0が返されます。"
    },
    {
      "indent": 6,
      "text": "    When the mplsLpsMeConfigPath value is 'protection', this\n    object will return the value of sysUpTime the last time that\n    traffic was switched back to the working path from this path.\n    If no traffic has ever switched back to the working path from\n    this protection path, the value 0 will be returned.\"\nREFERENCE\n   \"Section 4.3 of RFC 6378\"\n::= { mplsLpsMeStatusEntry 5 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsMeStatusSwitchoverSeconds OBJECT-TYPE SYNTAX Counter32 UNITS \"seconds\" MAX-ACCESS read-only STATUS current DESCRIPTION \"The cumulative Protection Switching Duration (PSD) time in seconds.",
      "ja": "mplsLpsMeStatusSwitchoverSeconds OBJECT-TYPE SYNTAX Counter32ユニット \"秒\" MAX-ACCESS read-onlyステータス現在の説明「累積保護スイッチング時間（PSD）秒単位の時間。"
    },
    {
      "indent": 10,
      "text": "For the working path, this is the cumulative number of\nseconds that traffic was selected from the protection path.",
      "raw": true
    },
    {
      "indent": 6,
      "text": "    For the protection path, this is the cumulative number\n    of seconds that the working path has been used to\n    select traffic.\"\nREFERENCE\n   \"Section 4.3 of RFC 6378\"\n::= { mplsLpsMeStatusEntry 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsNotificationEnable OBJECT-TYPE SYNTAX BITS { switchover(0), revertiveMismatch(1), protecTypeMismatch(2), capabilitiesMismatch(3), pathConfigMismatch(4), fopNoResponse(5), fopTimeout(6) } MAX-ACCESS read-write STATUS current DESCRIPTION \"Provides the ability to enable and disable notifications defined in this MIB module.",
      "ja": "mplsLpsNotificationEnable OBJECT-TYPE構文BITS {切り替え（0）、revertiveMismatch（1）、protecTypeMismatch（2）、capabilitiesMismatch（3）、pathConfigMismatch（4）、fopNoResponse（5）、fopTimeout（6）} MAX-ACCESS読み取りと書き込みステータス現在の説明は「このMIBモジュールで定義された通知を有効または無効にするための機能を提供します。"
    },
    {
      "indent": 10,
      "text": "switchover\nIndicates that mplsLpsEventSwitchover notifications should be\ngenerated.",
      "raw": true
    },
    {
      "indent": 10,
      "text": "revertiveMismatch Indicates that mplsLpsEventRevertiveMismatch notifications should be generated.",
      "ja": "revertiveMismatchはmplsLpsEventRevertiveMismatch通知が生成されるべきであることを示します。"
    },
    {
      "indent": 10,
      "text": "protecTypeMismatch Indicates that mplsLpsEventProtecTypeMismatch notifications should be generated.",
      "ja": "protecTypeMismatchはmplsLpsEventProtecTypeMismatch通知が生成されるべきであることを示します。"
    },
    {
      "indent": 10,
      "text": "capabilitiesMismatch Indicates that mplsLpsEventCapabilitiesMismatch notifications should be generated.",
      "ja": "capabilitiesMismatchはmplsLpsEventCapabilitiesMismatch通知が生成されるべきであることを示します。"
    },
    {
      "indent": 10,
      "text": "pathConfigMismatch Indicates that mplsLpsEventPathConfigMismatch notifications should be generated.",
      "ja": "pathConfigMismatchはmplsLpsEventPathConfigMismatch通知が生成されるべきであることを示します。"
    },
    {
      "indent": 10,
      "text": "fopNoResponse Indicates that mplsLpsEventFopNoResponse notifications should be generated.",
      "ja": "fopNoResponseはmplsLpsEventFopNoResponse通知が生成されるべきであることを示します。"
    },
    {
      "indent": 6,
      "text": "    fopTimeout\n    Indicates that mplsLpsEventFopTimeout notifications should be\n    generated.\"\nREFERENCE\n   \"Section 12 of RFC 7271\"\nDEFVAL { { } }\n::= { mplsLpsObjects 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- MPLS Linear Protection EVENTS.",
      "ja": " -  MPLSリニアプロテクションEVENTS。"
    },
    {
      "indent": 3,
      "text": "mplsLpsEventSwitchover NOTIFICATION-TYPE\n   OBJECTS { mplsLpsMeStatusSwitchovers, mplsLpsMeStatusCurrent }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventSwitchover notification is sent when the\n       value of an instance of mplsLpsMeStatusSwitchovers\n       increments.\"\n   ::= { mplsLpsNotifications 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsEventRevertiveMismatch NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusRevertiveMismatch }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventRevertiveMismatch notification is sent when\n       the value of mplsLpsStatusRevertiveMismatch changes.\"\n   ::= { mplsLpsNotifications 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsEventProtecTypeMismatch NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusProtecTypeMismatch }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventProtecTypeMismatch notification is sent\n       when the value of mplsLpsStatusProtecTypeMismatch changes.\"\n   ::= { mplsLpsNotifications 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsEventCapabilitiesMismatch NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusCapabilitiesMismatch }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventCapabilitiesMismatch notification is sent\n       when the value of mplsLpsStatusCapabilitiesMismatch changes.\"\n   ::= { mplsLpsNotifications 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsEventPathConfigMismatch NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusPathConfigMismatch }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventPathConfigMismatch notification is sent\n       when the value of mplsLpsStatusPathConfigMismatch changes.\"\n   ::= { mplsLpsNotifications 5 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsEventFopNoResponse NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusFopNoResponses }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventFopNoResponse notification is sent when the\n       value of mplsLpsStatusFopNoResponses increments.\"\n   ::= { mplsLpsNotifications 6 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsEventFopTimeout NOTIFICATION-TYPE\n   OBJECTS { mplsLpsStatusFopTimeouts }\n   STATUS  current\n   DESCRIPTION\n      \"An mplsLpsEventFopTimeout notification is sent when the\n       value of mplsLpsStatusFopTimeouts increments.\"\n   ::= { mplsLpsNotifications 7 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- End of Notifications.",
      "ja": " - 通知の終わり。"
    },
    {
      "indent": 3,
      "text": "-- Module Compliance.",
      "ja": " - モジュールコンプライアンス。"
    },
    {
      "indent": 3,
      "text": "mplsLpsCompliances\n   OBJECT IDENTIFIER ::= { mplsLpsConformance 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsGroups\n   OBJECT IDENTIFIER ::= { mplsLpsConformance 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- Compliance requirement for fully compliant implementations.",
      "ja": " - 完全に準拠した実装のためのコンプライアンス要件。"
    },
    {
      "indent": 3,
      "text": "mplsLpsModuleFullCompliance MODULE-COMPLIANCE\n   STATUS      current\n   DESCRIPTION\n      \"Compliance statement for agents that provide full support for\n       the MPLS-LPS-MIB module.  Such devices can provide linear\n       protection and also be configured using this MIB module.\"\n   MODULE -- this module\n   MANDATORY-GROUPS {\n      mplsLpsScalarGroup,\n      mplsLpsTableGroup,\n      mplsLpsMeTableGroup\n   }\n   GROUP        mplsLpsNotificationGroup\n   DESCRIPTION\n      \"This group is only mandatory for those\n       implementations that can efficiently implement\n       the notifications contained in this group.\"\n   ::= { mplsLpsCompliances 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- Compliance requirement for read-only implementations.",
      "ja": " - 読み取り専用の実装のためのコンプライアンス要件。"
    },
    {
      "indent": 3,
      "text": "mplsLpsModuleReadOnlyCompliance MODULE-COMPLIANCE STATUS current DESCRIPTION \"Compliance statement for agents that only provide read-only support for the MPLS-LPS-MIB module.\" MODULE -- this module MANDATORY-GROUPS { mplsLpsScalarGroup, mplsLpsTableGroup, mplsLpsMeTableGroup } GROUP mplsLpsNotificationGroup DESCRIPTION \"This group is only mandatory for those implementations that can efficiently implement the notifications contained in this group.\"",
      "ja": "mplsLpsModuleReadOnlyCompliance MODULE-COMPLIANCEステータス現在の説明「唯一のMPLS-LPS-MIBモジュールの読み取り専用のサポートを提供するエージェントのための準拠宣言。」 MODULE  - このモジュールMANDATORY-GROUPS {mplsLpsScalarGroup、mplsLpsTableGroup、mplsLpsMeTableGroup} GROUP mplsLpsNotificationGroup DESCRIPTION \"このグループは効率的にこのグループに含まれる通知を実装することができ、これらの実装のためだけに必須です。\""
    },
    {
      "indent": 6,
      "text": "-- mplsLpsConfigTable",
      "ja": " -  mplsLpsConfigTable"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigMode MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT mplsLpsConfigMode MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigProtectionType MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT mplsLpsConfigProtectionType MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigRevertive MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT mplsLpsConfigRevertive MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigSdThreshold MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT mplsLpsConfigSdThreshold MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigSdBadSeconds MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECTのmplsLpsConfigSdBadSeconds MIN-ACCESS読み取り専用説明 \"書き込みアクセス必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigSdGoodSeconds MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECTのmplsLpsConfigSdGoodSeconds MIN-ACCESS読み取り専用説明 \"書き込みアクセス必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigWaitToRestore MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT mplsLpsConfigWaitToRestore MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigContinualTxInterval MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT mplsLpsConfigContinualTxInterval MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigRapidTxInterval MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT mplsLpsConfigRapidTxInterval MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigCommand MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECTは、MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\" mplsLpsConfigCommand"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigRowStatus SYNTAX RowStatus { active(1) } MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT mplsLpsConfigRowStatus構文RowStatus {アクティブ（1）} MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要となりません。\""
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsConfigStorageType MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT mplsLpsConfigStorageType MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "-- mplsLpsMeConfigTable",
      "ja": " -  mplsLpsMeConfigTable"
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsMeConfigDomain MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT mplsLpsMeConfigDomain MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "OBJECT mplsLpsMeConfigPath MIN-ACCESS read-only DESCRIPTION \"Write access is not required.\"",
      "ja": "OBJECT mplsLpsMeConfigPath MIN-ACCESS読み取り専用説明 \"書き込みアクセスが必要とされていません。\""
    },
    {
      "indent": 6,
      "text": "::= { mplsLpsCompliances 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- Units of conformance.",
      "ja": " - 適合の単位。"
    },
    {
      "indent": 3,
      "text": "mplsLpsScalarGroup OBJECT-GROUP\n   OBJECTS {\n           mplsLpsConfigDomainIndexNext,\n           mplsLpsNotificationEnable\n           }\n   STATUS  current\n   DESCRIPTION\n      \"Collection of objects needed for MPLS linear protection.\"\n   ::= { mplsLpsGroups 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsTableGroup OBJECT-GROUP\n   OBJECTS {\n      mplsLpsConfigDomainName,\n      mplsLpsConfigRowStatus,\n      mplsLpsConfigMode,\n      mplsLpsConfigProtectionType,\n      mplsLpsConfigRevertive,\n      mplsLpsConfigSdThreshold,\n      mplsLpsConfigSdBadSeconds,\n      mplsLpsConfigSdGoodSeconds,\n      mplsLpsConfigWaitToRestore,\n      mplsLpsConfigHoldOff,\n      mplsLpsConfigContinualTxInterval,\n      mplsLpsConfigRapidTxInterval,\n      mplsLpsConfigCommand,\n      mplsLpsConfigCreationTime,\n      mplsLpsConfigStorageType,\n      mplsLpsStatusState,\n      mplsLpsStatusReqRcv,\n      mplsLpsStatusReqSent,\n      mplsLpsStatusFpathPathRcv,\n      mplsLpsStatusFpathPathSent, mplsLpsStatusRevertiveMismatch,\n      mplsLpsStatusProtecTypeMismatch,\n      mplsLpsStatusCapabilitiesMismatch,\n      mplsLpsStatusPathConfigMismatch,\n      mplsLpsStatusFopNoResponses,\n      mplsLpsStatusFopTimeouts\n      }\n   STATUS  current\n   DESCRIPTION\n      \"Collection of objects needed for MPLS linear protection\n       configuration and statistics.\"\n   ::= { mplsLpsGroups 2 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsMeTableGroup OBJECT-GROUP\n   OBJECTS {\n      mplsLpsMeConfigDomain,\n      mplsLpsMeConfigPath,\n      mplsLpsMeStatusCurrent,\n      mplsLpsMeStatusSignalDegrades,\n      mplsLpsMeStatusSignalFailures,\n      mplsLpsMeStatusSwitchovers,\n      mplsLpsMeStatusLastSwitchover,\n      mplsLpsMeStatusSwitchoverSeconds\n      }\n   STATUS  current\n   DESCRIPTION\n      \"Collection of objects needed for MPLS linear protection\n       ME configuration and statistics.\"\n   ::= { mplsLpsGroups 3 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "mplsLpsNotificationGroup NOTIFICATION-GROUP\n   NOTIFICATIONS {\n      mplsLpsEventSwitchover,\n      mplsLpsEventRevertiveMismatch,\n      mplsLpsEventProtecTypeMismatch,\n      mplsLpsEventCapabilitiesMismatch,\n      mplsLpsEventPathConfigMismatch,\n      mplsLpsEventFopNoResponse,\n      mplsLpsEventFopTimeout\n      }\n   STATUS  current\n   DESCRIPTION\n      \"Collection of objects needed to implement notifications.\"\n   ::= { mplsLpsGroups 4 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- MPLS-LPS-MIB module ends END",
      "ja": " -  MPLS-LPS-MIBモジュールは、ENDを終了します"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "There are a number of management objects defined in this MIB module with a MAX-ACCESS clause of read-write and/or read-create. Such objects may be considered sensitive or vulnerable in some network environments. The support for SET operations in a non-secure environment without proper protection opens devices to attack. These are the tables and objects and their sensitivity/vulnerability:",
      "ja": "読み書きおよび/またはリード作成のMAX-ACCESS句でこのMIBモジュールで定義された管理オブジェクトの数があります。そのようなオブジェクトは、いくつかのネットワーク環境に敏感又は脆弱と考えることができます。適切な保護のない非安全な環境におけるSET操作のサポートは、攻撃にデバイスを開きます。これらは、テーブルと、オブジェクトとそれらの感度/脆弱性です："
    },
    {
      "indent": 3,
      "text": "o The mplsLpsConfigTable is used to configure MPLS-TP linear protection domains. Improper manipulation of the objects in this table may result in different behaviors than what network operators originally intended, such as delaying traffic switching or causing a race condition with server-layer protection after network failure (mplsLpsConfigHoldOff), delaying or speeding up reversion after recovering from network failure (mplsLpsConfigWaitToRestore), unexpected traffic switching (mplsLpsConfigCommand), or the discontinuance of the operation of a protection switching control process (mplsLpsConfigMode, mplsLpsConfigProtectionType).",
      "ja": "O mplsLpsConfigTableは、MPLS-TPのリニアプロテクションドメインを設定するために使用されます。この表のオブジェクトの不適切な操作は、このようなトラフィックの切り替えを遅らせるか、ネットワーク障害（mplsLpsConfigHoldOff）の後に、サーバー層保護との競合状態を引き起こし、遅延またはから回復した後の復帰を高速化などのネットワーク事業者が本来意図するものとは異なる振る舞いになることがありネットワーク障害（mplsLpsConfigWaitToRestore）、予想外のトラフィック切り替え（mplsLpsConfigCommand）、又は保護切替制御処理（mplsLpsConfigMode、mplsLpsConfigProtectionType）の動作の中止。"
    },
    {
      "indent": 3,
      "text": "o The mplsLpsMeConfigTable is used to assign each ME to either the working path or the protection path. Improper manipulation of this object may result in the discontinuance of the operation of a protection switching control process.",
      "ja": "O mplsLpsMeConfigTable現用パスや予備パスのいずれかに各MEを割り当てるために使用されます。このオブジェクトの不適切な操作は、保護切替制御処理の動作の中止をもたらすことができます。"
    },
    {
      "indent": 3,
      "text": "o The notification is controlled by the mplsLpsNotificationEnable object. In the case of the discontinuance of a protection switching control process, network operators may not be notified if the mplsLpsNotificationEnable object is compromised.",
      "ja": "O通知がmplsLpsNotificationEnableオブジェクトによって制御されます。 mplsLpsNotificationEnableオブジェクトが損なわれている場合、保護切替制御処理の中止の場合に、ネットワークオペレータは、通知されなくてもよいです。"
    },
    {
      "indent": 3,
      "text": "Some of the readable objects in this MIB module (i.e., objects with a MAX-ACCESS other than not-accessible) may be considered sensitive or vulnerable in some network environments. It is thus important to control even GET and/or NOTIFY access to these objects and possibly to even encrypt the values of these objects when sending them over the network via SNMP. These are the tables and objects and their sensitivity/vulnerability:",
      "ja": "このMIBモジュールで読み取り可能なオブジェクトの一部（すなわち、アクセス可能ではない以外MAX-ACCESS持つオブジェクト）は、いくつかのネットワーク環境に敏感又は脆弱と考えることができます。 GETおよび/またはこれらのオブジェクトへのアクセスを通知し、おそらくSNMPを通してネットワークの上にそれらを送信する場合でも、これらのオブジェクトの値を暗号化するためにも、制御することが重要です。これらは、テーブルと、オブジェクトとそれらの感度/脆弱性です："
    },
    {
      "indent": 3,
      "text": "o The mplsLpsStatusTable and the mplsLpsMeStatusTable collectively show the history and current status of the MPLS-TP linear protection domains. They can be used to estimate the performance and qualities of networks configured to use MPLS-TP linear protection. If an administrator does not want to reveal this information, then these tables should be considered sensitive/vulnerable.",
      "ja": "O mplsLpsStatusTableとmplsLpsMeStatusTableをまとめMPLS-TPリニア保護ドメインの歴史と現在のステータスを示します。彼らは、MPLS-TPのリニアプロテクションを使用するように構成されたネットワークの性能と品質を推定するために使用することができます。管理者がこの情報を明らかにしたくない場合には、これらのテーブルは、脆弱/敏感考慮されるべきです。"
    },
    {
      "indent": 3,
      "text": "SNMP versions prior to SNMPv3 did not include adequate security. Even if the network itself is secure (for example by using IPsec), there is no control as to who on the secure network is allowed to access and GET/SET (read/change/create/delete) the objects in this MIB module.",
      "ja": "SNMPv3の前のSNMPバージョンは十分なセキュリティを含んでいませんでした。ネットワーク自体が（IPsecを使って、例えば）安全であっても、安全なネットワーク上で/ SETにアクセスし、GETだれに許容されているかのように何の制御（/作成/変更/読み取り、削除）このMIBモジュール内のオブジェクトはありません。"
    },
    {
      "indent": 3,
      "text": "Implementations SHOULD provide the security features described by the SNMPv3 framework (see [RFC3410]), and implementations claiming compliance to the SNMPv3 standard MUST include full support for authentication and privacy via the User-based Security Model (USM) [RFC3414] with the AES cipher algorithm [RFC3826]. Implementations MAY also provide support for the Transport Security Model (TSM) [RFC5591] in combination with a secure transport such as SSH [RFC5592] or TLS/DTLS [RFC6353].",
      "ja": "実装は、（[RFC3410]を参照）SNMPv3フレームワークで説明したセキュリティ機能を提供すべき、およびSNMPv3規格に準拠を主張する実装は、AESとユーザベースセキュリティモデル（USM）[RFC3414]を経由して認証とプライバシーのためのフルサポートを含まなければなりません暗号アルゴリズム[RFC3826]。また、実装は、そのようなSSH [RFC5592]またはTLS / DTLS [RFC6353]などの安全な輸送との組み合わせで輸送セキュリティモデル（TSM）[RFC5591]のためのサポートを提供することができます。"
    },
    {
      "indent": 3,
      "text": "Further, deployment of SNMP versions prior to SNMPv3 is NOT RECOMMENDED. Instead, it is RECOMMENDED to deploy SNMPv3 and to enable cryptographic security. It is then a customer/operator responsibility to ensure that the SNMP entity giving access to an instance of this MIB module is properly configured to give access to the objects only to those principals (users) that have legitimate rights to indeed GET or SET (change/create/delete) them.",
      "ja": "さらに、SNMPv3の前のSNMPバージョンの展開はお勧めしません。代わりに、SNMPv3を展開すると、暗号化セキュリティを有効にすることをお勧めします。このMIBモジュールのインスタンスへのアクセスを与えるSNMP実体が適切にのみプリンシパル（ユーザ）にオブジェクトへのアクセスを提供するように設定されていることを確認するために、顧客/オペレータ責任実際にGETまたはSET（変化への正当な権利を有することです/）/削除、それらを作成します。"
    },
    {
      "indent": 0,
      "text": "10. IANA Considerations",
      "section_title": true,
      "ja": "10. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has assigned an OID of decimal 22 for the MPLS Linear Protection MIB module (MPLS-LPS-MIB) specified in this document in the \"MIB Transmission Group - MPLS STD MIB\" subregistry of the \"Internet-standard MIB - Transmission Group\" registry.",
      "ja": "レジストリ - 「送信グループのインターネット標準MIB」の副登録 -  IANAは、「MPLS STD MIB MIB伝送グループ」で、この文書で指定されたMPLSリニアプロテクションMIBモジュールの小数点以下22のOID（MPLS-LPS-MIB）が割り当てられています。"
    },
    {
      "indent": 0,
      "text": "11. References",
      "section_title": true,
      "ja": "11.参考文献"
    },
    {
      "indent": 0,
      "text": "11.1. Normative References",
      "section_title": true,
      "ja": "11.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2578] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Structure of Management Information Version 2 (SMIv2)\", STD 58, RFC 2578, DOI 10.17487/RFC2578, April 1999, <http://www.rfc-editor.org/info/rfc2578>.",
      "ja": "[RFC2578] McCloghrie、K.、エド。、パーキンス、D.、編、及びJ. Schoenwaelder、エド。DOI 10.17487 / RFC2578、STD 58、RFC 2578、 \"管理情報バージョン2（SMIv2）の構造\"、 1999年4月、<http://www.rfc-editor.org/info/rfc2578>。"
    },
    {
      "indent": 3,
      "text": "[RFC2579] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Textual Conventions for SMIv2\", STD 58, RFC 2579, DOI 10.17487/RFC2579, April 1999, <http://www.rfc-editor.org/info/rfc2579>.",
      "ja": "[RFC2579] McCloghrie、K.、エド。、パーキンス、D.、編、及びJ. Schoenwaelder、エド。、 \"SMIv2のためのテキストの表記法\"、STD 58、RFC 2579、DOI 10.17487 / RFC2579、1999年4月、<HTTP ：//www.rfc-editor.org/info/rfc2579>。"
    },
    {
      "indent": 3,
      "text": "[RFC2580] McCloghrie, K., Ed., Perkins, D., Ed., and J. Schoenwaelder, Ed., \"Conformance Statements for SMIv2\", STD 58, RFC 2580, DOI 10.17487/RFC2580, April 1999, <http://www.rfc-editor.org/info/rfc2580>.",
      "ja": "[RFC2580] McCloghrie、K.、エド。、パーキンス、D.、編、及びJ. Schoenwaelder、エド。、 \"SMIv2のための適合性宣言\"、STD 58、RFC 2580、DOI 10.17487 / RFC2580、1999年4月、<HTTP ：//www.rfc-editor.org/info/rfc2580>。"
    },
    {
      "indent": 3,
      "text": "[RFC3289] Baker, F., Chan, K., and A. Smith, \"Management Information Base for the Differentiated Services Architecture\", RFC 3289, DOI 10.17487/RFC3289, May 2002, <http://www.rfc-editor.org/info/rfc3289>.",
      "ja": "[RFC3289]ベイカー、F.、チャン、K.、およびA.スミス、 \"差別化サービスアーキテクチャのための管理情報ベース\"、RFC 3289、DOI 10.17487 / RFC3289、2002年5月、<のhttp：//www.rfc-editor .ORG /情報/ rfc3289>。"
    },
    {
      "indent": 3,
      "text": "[RFC3411] Harrington, D., Presuhn, R., and B. Wijnen, \"An Architecture for Describing Simple Network Management Protocol (SNMP) Management Frameworks\", STD 62, RFC 3411, DOI 10.17487/RFC3411, December 2002, <http://www.rfc-editor.org/info/rfc3411>.",
      "ja": "[RFC3411]ハリントン、D.、Presuhn、R.、およびB. Wijnenの、 \"簡易ネットワーク管理プロトコル（SNMP）管理フレームワークを記述するためのアーキテクチャ\"、STD 62、RFC 3411、DOI 10.17487 / RFC3411、2002年12月、<HTTP ：//www.rfc-editor.org/info/rfc3411>。"
    },
    {
      "indent": 3,
      "text": "[RFC3414] Blumenthal, U. and B. Wijnen, \"User-based Security Model (USM) for version 3 of the Simple Network Management Protocol (SNMPv3)\", STD 62, RFC 3414, DOI 10.17487/RFC3414, December 2002, <http://www.rfc-editor.org/info/rfc3414>.",
      "ja": "[RFC3414]ブルーメンソール、U.とB. Wijnenの、 \"ユーザベースセキュリティモデル（USM）簡易ネットワーク管理プロトコル（SNMPv3の）のバージョン3のために\"、STD 62、RFC 3414、DOI 10.17487 / RFC3414、2002年12月、< http://www.rfc-editor.org/info/rfc3414>。"
    },
    {
      "indent": 3,
      "text": "[RFC3811] Nadeau, T., Ed., and J. Cucchiara, Ed., \"Definitions of Textual Conventions (TCs) for Multiprotocol Label Switching (MPLS) Management\", RFC 3811, DOI 10.17487/RFC3811, June 2004, <http://www.rfc-editor.org/info/rfc3811>.",
      "ja": "[RFC3811]ナドーは、T.、エド。、およびJ. Cucchiara、エド。は、 \"マルチプロトコルラベルのためのテキストの表記法（TCS）の定義は、スイッチング（MPLS）管理\"、RFC 3811、DOI 10.17487 / RFC3811、2004年6月、<HTTP ：//www.rfc-editor.org/info/rfc3811>。"
    },
    {
      "indent": 3,
      "text": "[RFC3826] Blumenthal, U., Maino, F., and K. McCloghrie, \"The Advanced Encryption Standard (AES) Cipher Algorithm in the SNMP User-based Security Model\", RFC 3826, DOI 10.17487/RFC3826, June 2004, <http://www.rfc-editor.org/info/rfc3826>.",
      "ja": "[RFC3826]ブルーメンソール、U.、メイノー、F.、およびK. McCloghrie、 \"のAdvanced Encryption Standard（AES）SNMPユーザベースセキュリティモデルにおける暗号アルゴリズム\"、RFC 3826、DOI 10.17487 / RFC3826、2004年6月、< http://www.rfc-editor.org/info/rfc3826>。"
    },
    {
      "indent": 3,
      "text": "[RFC5591] Harrington, D. and W. Hardaker, \"Transport Security Model for the Simple Network Management Protocol (SNMP)\", STD 78, RFC 5591, DOI 10.17487/RFC5591, June 2009, <http://www.rfc-editor.org/info/rfc5591>.",
      "ja": "[RFC5591]ハリントン、D.およびW. Hardaker、 \"簡易ネットワーク管理プロトコル（SNMP）のためのトランスポート・セキュリティモデル\"、STD 78、RFC 5591、DOI 10.17487 / RFC5591、2009年6月、<のhttp：//www.rfc- editor.org/info/rfc5591>。"
    },
    {
      "indent": 3,
      "text": "[RFC5592] Harrington, D., Salowey, J., and W. Hardaker, \"Secure Shell Transport Model for the Simple Network Management Protocol (SNMP)\", RFC 5592, DOI 10.17487/RFC5592, June 2009, <http://www.rfc-editor.org/info/rfc5592>.",
      "ja": "[RFC5592]ハリントン、D.、Salowey、J.、およびW. Hardaker、RFC 5592、DOI 10.17487 / RFC5592、2009年6月 \"簡易ネットワーク管理プロトコル（SNMP）用シェル輸送モデルをセキュア\"、<のhttp：// www.rfc-editor.org/info/rfc5592>。"
    },
    {
      "indent": 3,
      "text": "[RFC6353] Hardaker, W., \"Transport Layer Security (TLS) Transport Model for the Simple Network Management Protocol (SNMP)\", STD 78, RFC 6353, DOI 10.17487/RFC6353, July 2011, <http://www.rfc-editor.org/info/rfc6353>.",
      "ja": "[RFC6353] Hardaker、W.、 \"トランスポート層セキュリティ簡易ネットワーク管理プロトコル（SNMP）用（TLS）輸送モデル\"、STD 78、RFC 6353、DOI 10.17487 / RFC6353、2011年7月、<のhttp：//www.rfc -editor.org/info/rfc6353>。"
    },
    {
      "indent": 3,
      "text": "[RFC6378] Weingarten, Y., Ed., Bryant, S., Osborne, E., Sprecher, N., and A. Fulignoli, Ed., \"MPLS Transport Profile (MPLS-TP) Linear Protection\", RFC 6378, DOI 10.17487/RFC6378, October 2011, <http://www.rfc-editor.org/info/rfc6378>.",
      "ja": "[RFC6378]ヴェンガルテン、Y.、編、ブライアント、S.、オズボーン、E.、Sprecher、N.、およびA. Fulignoli、編、 \"MPLSトランスポートプロファイル（MPLS-TP）リニアプロテクション\"、RFC 6378、 DOI 10.17487 / RFC6378、2011年10月、<http://www.rfc-editor.org/info/rfc6378>。"
    },
    {
      "indent": 3,
      "text": "[RFC7271] Ryoo, J., Ed., Gray, E., Ed., van Helvoort, H., D'Alessandro, A., Cheung, T., and E. Osborne, \"MPLS Transport Profile (MPLS-TP) Linear Protection to Match the Operational Expectations of Synchronous Digital Hierarchy, Optical Transport Network, and Ethernet Transport Network Operators\", RFC 7271, DOI 10.17487/RFC7271, June 2014, <http://www.rfc-editor.org/info/rfc7271>.",
      "ja": "[RFC7271]リュ、J.、編、グレー、E.、編、ヴァンHelvoort、H.、D'アレッサンドロ、A.、チャン、T.、およびE.オズボーン、「MPLSトランスポートプロファイル（MPLS-TP同期デジタル階層、光トランスポートネットワークの運用の期待と一致するように）リニアプロテクション、およびイーサネットトランスポートネットワークオペレーター」、RFC 7271、DOI 10.17487 / RFC7271、2014年6月、<http://www.rfc-editor.org/info/ rfc7271>。"
    },
    {
      "indent": 3,
      "text": "[RFC7697] Pan, P., Aldrin, S., Venkatesan, M., Sampath, K., Nadeau, T., and S. Boutros, \"MPLS Transport Profile (MPLS-TP) Operations, Administration, and Maintenance (OAM) Identifiers Management Information Base (MIB)\", RFC 7697, DOI 10.17487/RFC7697, January 2016, <http://www.rfc-editor.org/info/rfc7697>.",
      "ja": "[RFC7697]パン、P.、アルドリン、S.、Venkatesan、M.、サンパス、K.、ナドー、T.、およびS. Boutros、「MPLSトランスポートプロファイル（MPLS-TP）運用、管理、および保守（OAM ）識別子管理情報ベース（MIB）」、RFC 7697、DOI 10.17487 / RFC7697、2016年1月、<http://www.rfc-editor.org/info/rfc7697>。"
    },
    {
      "indent": 0,
      "text": "11.2. Informative References",
      "section_title": true,
      "ja": "11.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3410] Case, J., Mundy, R., Partain, D., and B. Stewart, \"Introduction and Applicability Statements for Internet-Standard Management Framework\", RFC 3410, DOI 10.17487/RFC3410, December 2002, <http://www.rfc-editor.org/info/rfc3410>.",
      "ja": "[RFC3410]ケース、J.、マンディ、R.、パーテイン、D.、およびB.スチュワート、 \"インターネット標準の管理フレームワークのための序論と適用性声明\"、RFC 3410、DOI 10.17487 / RFC3410、2002年12月、<のhttp： //www.rfc-editor.org/info/rfc3410>。"
    },
    {
      "indent": 3,
      "text": "[RFC3812] Srinivasan, C., Viswanathan, A., and T. Nadeau, \"Multiprotocol Label Switching (MPLS) Traffic Engineering (TE) Management Information Base (MIB)\", RFC 3812, DOI 10.17487/RFC3812, June 2004, <http://www.rfc-editor.org/info/rfc3812>.",
      "ja": "[RFC3812]スリニバサン、C.、Viswanathanの、A.、およびT.ナドー、 \"マルチプロトコルラベルスイッチング（MPLS）トラフィックエンジニアリング（TE）管理情報ベース（MIB）\"、RFC 3812、DOI 10.17487 / RFC3812、2004年6月、< http://www.rfc-editor.org/info/rfc3812>。"
    },
    {
      "indent": 3,
      "text": "[G8121] International Telecommunication Union, \"Characteristics of MPLS-TP equipment functional blocks\", ITU-T Recommendation G.8121/Y.1381, April 2016, <https://www.itu.int/rec/T-REC-G.8121/en>.",
      "ja": "[G8121]国際電気通信連合、 \"MPLS-TP装置の機能ブロックの特性\"、ITU-T勧告G.8121 / Y.1381、2016年4月、<https://www.itu.int/rec/T-REC- G.8121 / EN>。"
    },
    {
      "indent": 3,
      "text": "[G8151] International Telecommunication Union, \"Management aspects of the MPLS-TP network element\", ITU-T Recommendation G.8151/Y.1374, January 2015, <https://www.itu.int/rec/T-REC-G.8151/en>.",
      "ja": "[G8151]国際電気通信連合、 \"MPLS-TPネットワーク要素の管理面\"、ITU-T勧告G.8151 / Y.1374、2015年1月、<https://www.itu.int/rec/T-REC -G.8151 / EN>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors wish to thank Joan Cucchiara for her review as MIB Doctor. Joan's detailed comments were of great help for improving the quality of this document.",
      "ja": "著者は、MIB医師としての彼女の検討のためジョアンCucchiaraに感謝したいです。ジョアンの詳細なコメントは、この文書の品質を向上させるための大きな助けとしました。"
    },
    {
      "indent": 3,
      "text": "The authors would also like to thank Loa Andersson and Adrian Farrel for their valuable comments and suggestions on this document.",
      "ja": "著者らはまた、このドキュメントの彼らの貴重なコメントや提案のためのLoaアンデションとエードリアンファレルに感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "Vishwas Manral Nano Sec 599 Fairchild Drive Mountain View, CA United States of America",
      "ja": "Vishwas Manralナノ秒599フェアチャイルドドライブマウンテンビュー、アメリカのカリフォルニア州、米国"
    },
    {
      "indent": 3,
      "text": "Email: vishwas@nanosec.io",
      "ja": "メール：vishwas@nanosec.io"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Kingston Selvaraj IP Infusion RMZ Centennial Mahadevapura Post Bangalore 560048 India",
      "ja": "センテニアル部屋imphusinキングストン、バンガロール560048、インドポストmahadevapura Selvarajリップ"
    },
    {
      "indent": 3,
      "text": "Email: kingstonsmiler@gmail.com",
      "ja": "メール：kingstonsmiler@gmail.com"
    },
    {
      "indent": 3,
      "text": "Venkatesan Mahalingam Dell Technologies 5450 Great America Parkway Santa Clara, CA 95054 United States of America",
      "ja": "Venkatesan Mahalingamデル・テクノロジーズ5450グレートアメリカパークウェイサンタクララ、CAアメリカの95054米国"
    },
    {
      "indent": 3,
      "text": "Email: venkat.mahalingams@gmail.com",
      "ja": "メール：venkat.mahalingams@gmail.com"
    },
    {
      "indent": 3,
      "text": "Daniel King Old Dog Consulting United Kingdom",
      "ja": "ダニエル・キング老犬のコンサルティングイギリス"
    },
    {
      "indent": 3,
      "text": "Email: daniel@olddog.co.uk",
      "ja": "メール：daniel@olddog.co.uk"
    },
    {
      "indent": 3,
      "text": "Sam Aldrin Google, Inc. 1600 Amphitheatre Parkway Mountain View, CA 94043 United States of America",
      "ja": "サム・オルドリングーグル株式会社1600アンフィシアターパークウェイマウンテンビュー、カリフォルニア州アメリカの94043米国"
    },
    {
      "indent": 3,
      "text": "Email: aldrin.ietf@gmail.com",
      "ja": "メール：aldrin.ietf@gmail.com"
    },
    {
      "indent": 3,
      "text": "Jeong-dong Ryoo ETRI 218 Gajeong-ro Yuseong-gu, Daejeon 34129 South Korea",
      "ja": "チョン洞リュETRI 218 Gajeong-RO儒城区、大田34129韓国"
    },
    {
      "indent": 3,
      "text": "Email: ryoo@etri.re.kr",
      "ja": "メール：ryoo@etri.re.kr"
    }
  ]
}