{
  "title": {
    "text": "RFC 8059 - PIM Join Attributes for Locator/ID Separation Protocol (LISP) Environments",
    "ja": "RFC 8059 - PIMロケータ/ ID分離プロトコル（LISP）環境の属性に参加"
  },
  "number": 8059,
  "created_at": "2019-10-22 20:56:05.673191+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         J. Arango\nRequest for Comments: 8059                                     S. Venaas\nCategory: Experimental                                     Cisco Systems\nISSN: 2070-1721                                              I. Kouvelas\n                                                    Arista Networks Inc.\n                                                            D. Farinacci\n                                                             lispers.net\n                                                            January 2017",
      "raw": true
    },
    {
      "indent": 9,
      "text": "                 PIM Join Attributes\nfor Locator/ID Separation Protocol (LISP) Environments",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines two PIM Join/Prune attributes that support the construction of multicast distribution trees where the root and receivers are located in different Locator/ID Separation Protocol (LISP) sites. These attributes allow the receiver site to select between unicast and multicast underlying transport and to convey the RLOC (Routing Locator) address of the receiver ETR (Egress Tunnel Router) to the control plane of the root ITR (Ingress Tunnel Router).",
      "ja": "この文書は、二つのPIMは、/ rootおよび受信機は異なるロケータ/ ID分離プロトコル（LISP）部位に配置されているマルチキャスト配信ツリーの構築をサポートプルーン属性を参加規定します。これらの属性は、受信機サイトはユニキャストとマルチキャストの基礎となるトランスポート間で選択すると、ルートITR（入力トンネルルータ）の制御プレーンに受信ETR（出力トンネルルータ）のRLOC（ルーティングロケータ）アドレスを伝えることを可能にします。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for examination, experimental implementation, and evaluation.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、検査、実験的な実装、および評価のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document defines an Experimental Protocol for the Internet community. This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "この文書は、インターネットコミュニティのためにExperimentalプロトコルを定義します。このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8059.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc8059で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2017 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2017 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Requirements Notation . . . . . . . . . . . . . . . . . . . .   3\n3.  PIM Join/Prune Attributes . . . . . . . . . . . . . . . . . .   3\n4.  The Transport Attribute . . . . . . . . . . . . . . . . . . .   4\n  4.1.  Transport Attribute Format  . . . . . . . . . . . . . . .   4\n  4.2.  Using the Transport Attribute . . . . . . . . . . . . . .   5\n5.  Receiver ETR RLOC Attribute . . . . . . . . . . . . . . . . .   5\n  5.1.  Receiver RLOC Attribute Format  . . . . . . . . . . . . .   6\n  5.2.  Using the Receiver RLOC Attribute . . . . . . . . . . . .   6\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   7\n7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   8\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . .   8\n  8.2.  Informative References  . . . . . . . . . . . . . . . . .   8\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   9",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The construction of multicast distribution trees where the root and receivers are located in different LISP sites [RFC6830] is defined in [RFC6831]. Creation of (root-EID,G) state in the root site requires that unicast LISP-encapsulated Join/Prune messages be sent from an ETR on the receiver site to an ITR on the root site. The term \"EID\" is short for \"Endpoint ID\".",
      "ja": "ルート及び受信機は異なるLISPサイト[RFC6830]に配置されているマルチキャスト配信ツリーの構築には、[RFC6831]で定義されています。ルートサイトで（ルートEID、G）の作成状態は、ユニキャストLISPカプセル化参加/プルーンメッセージは、ルートサイト上のITRに受信サイトにETRから送信されることを必要とします。用語「EIDは、」「エンドポイントID」の略です。"
    },
    {
      "indent": 3,
      "text": "[RFC6831] specifies that (root-EID,G) data packets are to be LISP-encapsulated into (root-RLOC,G) multicast packets. However, a wide deployment of multicast connectivity between LISP sites is unlikely to happen any time soon. In fact, some implementations are initially focusing on unicast transport with head-end replication between root and receiver sites.",
      "ja": "[RFC6831]は（ルートEID、G）データパケットは（ルートRLOC、G）マルチキャストパケットにLISPカプセル化されることを指定します。しかし、LISPサイト間のマルチキャスト接続の幅広い展開がいつでもすぐに起こることは稀です。実際には、いくつかの実装は、最初はルートと受信機のサイト間のヘッドエンドのレプリケーションとユニキャスト輸送に焦点を当てています。"
    },
    {
      "indent": 3,
      "text": "The unicast LISP-encapsulated Join/Prune message specifies the (root-EID,G) state that needs to be established in the root site, but conveys nothing about the receiver's capability or desire to use multicast as the underlying transport. This document specifies a Join/Prune attribute that allows the receiver ETR to select the desired transport.",
      "ja": "ユニキャストLISPカプセル化入会/プルーンのメッセージは、ルートサイトに確立する必要があるが、受信機の能力や基礎となるトランスポートとしてマルチキャストを使用する願望については何も伝えていない（ルート-EID、G）状態を指定します。この文書では、受信機ETRが必要なトランスポートを選択することができます参加/プルーンの属性を指定します。"
    },
    {
      "indent": 3,
      "text": "The term \"transport\" in this document is intentionally somewhat vague. Currently, it is used just to indicate whether multicast or head-end replication is used; this means that the outer destination address is either a unicast or multicast address. Future documents may specify how other types of delivery, encapsulation, or underlay are used.",
      "ja": "この文書に記載されている用語「輸送は、」意図的にやや曖昧です。現在のところ、ただマルチキャストまたはヘッドエンドのレプリケーションが使用されているかどうかを示すために使用されます。これは、外側の宛先アドレスがユニキャストまたはマルチキャストアドレスのいずれかであることを意味します。将来の文書は、配信、カプセル化、またはアンダーレイの他のタイプが使用されている方法を指定することもできます。"
    },
    {
      "indent": 3,
      "text": "Knowledge of the receiver ETR's RLOC address is essential to the control plane of the root ITR. The RLOC address determines the downstream destination for unicast head-end replication and identifies the receiver ETR that needs to be notified should the root ITR of the distribution tree move to another site. The root ITR can change when the source EID is roaming to another LISP site.",
      "ja": "受信機ETRのRLOCアドレスの知識は、ルートITRの制御プレーンに不可欠です。 RLOCアドレスがユニキャストヘッドエンドレプリケーションの下流先を決定し、配信ツリーのルートITRは別のサイトに移動する必要が通知される必要がある受信機ETRを識別する。ソースEIDは別のLISPサイトにローミングしているときのルートは、ITRは変更することができます。"
    },
    {
      "indent": 3,
      "text": "Service providers may implement unicast reverse path forwarding (uRPF) policies requiring that the outer source address of the LISP-encapsulated Join/Prune message be the address of the receiver ETR's core-facing interface used to physically transmit the message. However, due to policy and load-balancing considerations, the outer source address may not be the RLOC on which the receiver site wishes to receive a particular flow. This document specifies a Join/Prune attribute that conveys the appropriate receiver ETR's RLOC address to the control plane of the root ITR.",
      "ja": "サービスプロバイダは、LISPカプセル化参加/プルーンメッセージの外側のソース・アドレスが物理的にメッセージを送信するために使用される受信機ETRのコアに面したインターフェイスのアドレスであることが必要とユニキャストリバースパス転送（uRPFの）ポリシーを実装することができます。しかし、ポリシーおよび負荷分散の考慮に起因し、外側のソースアドレスは、受信機サイトは、特定のフローを受信することを望むでRLOCではないかもしれません。この文書では、ルートITRのコントロールプレーンに適切な受信機ETRのRLOCアドレスを伝える参加/プルーンの属性を指定します。"
    },
    {
      "indent": 3,
      "text": "This document uses terminology defined in [RFC6830], such as EID, RLOC, ITR, and ETR.",
      "ja": "この文書は、EID、RLOC、ITR、及びETRとして、[RFC6830]で定義された用語を使用します。"
    },
    {
      "indent": 0,
      "text": "2. Requirements Notation",
      "section_title": true,
      "ja": "2.要件表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はあります[RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. PIM Join/Prune Attributes",
      "section_title": true,
      "ja": "3. PIMは/プルーンの属性に参加します"
    },
    {
      "indent": 3,
      "text": "PIM Join/Prune attributes are defined in [RFC5384] by introducing a new Encoded-Source type that, in addition to the Join/Prune source, can carry multiple Type-Length-Value (TLV) attributes. These attributes apply to the individual Join/Prune sources on which they are stored.",
      "ja": "PIMプルーン属性が参加/プルーン源に加えて、複数のタイプレングス値を運ぶことができ、新たなエンコード・ソースのタイプ（TLV）属性を導入することによって、[RFC5384]で定義されている/参加。これらの属性は、それらが格納されている個々の参加/プルーンソースに適用されます。"
    },
    {
      "indent": 3,
      "text": "The attributes defined in this document conform to the format of the encoding type defined in [RFC5384]. The attributes would typically be the same for all the sources in the Join/Prune message. Hence, we RECOMMEND using the hierarchical Join/Prune attribute scheme defined in [RFC7887]. This hierarchical system allows attributes to be conveyed in the Upstream Neighbor Address field, thus enabling the efficient application of a single attribute instance to all the sources in the Join/Prune message.",
      "ja": "この文書で定義された属性は、[RFC5384]で定義された符号化タイプのフォーマットに準拠します。属性は、一般的に参加/プルーンのメッセージ内のすべてのソースに対して同じになります。そこで、私たちは[RFC7887]で定義された階層プルーン/参加属性スキームを使用することをお勧めします。この階層システムは、このように参加/プルーンメッセージ内のすべてのソースに単一の属性インスタンスの効率的な適用を可能にする、属性が上流隣接Addressフィールドで搬送されることを可能にします。"
    },
    {
      "indent": 3,
      "text": "LISP Tunnel Routers (xTRs) do not exchange PIM Hello Messages, and hence no Hello option is defined to negotiate support for these attributes. Systems that support unicast head-end replication are assumed to support these attributes.",
      "ja": "LISPトンネルルータ（xTRs）はPIM Helloメッセージを交換しません、したがって、こんにちはなしオプションは、これらの属性のサポートを交渉するために定義されています。ユニキャストヘッドエンドレプリケーションをサポートするシステムは、これらの属性をサポートすることを想定しています。"
    },
    {
      "indent": 0,
      "text": "4. The Transport Attribute",
      "section_title": true,
      "ja": "4.トランスポート属性"
    },
    {
      "indent": 3,
      "text": "It is essential that a mechanism be provided by which the desired transport can be conveyed by receiver sites. Root sites with multicast connectivity will want to leverage multicast replication. However, not all receiver sites can be expected to have multicast connectivity. It is thus desirable that root sites be prepared to support (root-EID,G) state with a mixture of multicast and unicast output state. This document specifies a Join/Prune attribute that allows the receiver to select the desired underlying transport.",
      "ja": "所望の輸送がレシーバ部位に搬送することが可能な機構を提供することが必須です。マルチキャスト接続でのルートサイトは、マルチキャストレプリケーションを活用したいと思うでしょう。ただし、いないすべての受信サイトは、マルチキャスト接続性を持っていることが期待できます。ルート・サイトがマルチキャストとユニキャストの出力状態の混合物（ルートEID、G）ステートをサポートするために用意されることが望ましいです。この文書では、受信機が必要な基礎となるトランスポートを選択することができます参加/プルーンの属性を指定します。"
    },
    {
      "indent": 0,
      "text": "4.1. Transport Attribute Format",
      "section_title": true,
      "ja": "4.1. トランスポート属性のフォーマット"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|F|E|  Type = 5 | Length = 1    |  Transport    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "F bit: The Transitive bit. Specifies whether the attribute is transitive or non-transitive. MUST be set to zero. This attribute is ALWAYS non-transitive.",
      "ja": "Fビット：推移ビット。属性が推移的または非推移であるかどうかを指定します。ゼロに設定しなければなりません。この属性は、常に非推移です。"
    },
    {
      "indent": 3,
      "text": "E bit: End-of-Attributes bit. Specifies whether this attribute is the last. Set to zero if there are more attributes. Set to 1 if this is the last attribute.",
      "ja": "Eビット：エンド・オブ・属性ビット。この属性が最後であるかどうかを指定します。より多くの属性がある場合は、ゼロに設定してください。これが最後の属性である場合は、1に設定してください。"
    },
    {
      "indent": 3,
      "text": "Type: The Transport Attribute type is 5.",
      "ja": "タイプ：transport属性タイプは5です。"
    },
    {
      "indent": 3,
      "text": "Length: The length of the Transport Attribute value. MUST be set to 1.",
      "ja": "長さ：トランスポート属性値の長さ。 1に設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Transport: The type of transport being requested. Set to zero for multicast. Set to 1 for unicast. The values from 2 to 255 may be assigned in the future.",
      "ja": "交通：交通機関の種類が要求されています。マルチキャストのためにゼロに設定してください。ユニキャストのために1に設定します。 2から255までの値は、将来的に割り当てることができます。"
    },
    {
      "indent": 0,
      "text": "4.2. Using the Transport Attribute",
      "section_title": true,
      "ja": "4.2. トランスポート属性を使用しました"
    },
    {
      "indent": 3,
      "text": "Hierarchical Join/Prune attribute instances [RFC7887] SHOULD be used when the same Transport Attribute is to be applied to all the sources within the Join/Prune message or all the sources within a group set. The root ITR MUST accept Transport Attributes in the Upstream Neighbor Encoded-Unicast address, Encoded-Group addresses, and Encoded-Source addresses.",
      "ja": "階層的な参加/プルーンは、同じトランスポート属性は/参加プルーンメッセージ内のすべてのソースまたはグループセット内のすべてのソースに適用されるときにインスタンス[RFC7887]を使用するべきである属性。 ITRは、交通を受け入れなければならないルートは、上流隣接エンコードされたユニキャストアドレス、符号化され、グループアドレス、およびエンコード・ソース・アドレスの属性。"
    },
    {
      "indent": 3,
      "text": "There MUST NOT be more than one Transport Attribute within the same encoded address. If an encoded address has more than one instance of the attribute, the root ITR MUST discard all affected Join/Prune sources. The root ITR MUST also discard all affected Join/Prune sources if the Transport Attribute value is unknown.",
      "ja": "同じエンコードされたアドレス内の複数のトランスポート属性があってはなりません。エンコードされたアドレスが属性の複数のインスタンスを持っている場合、ルートは、ITRは、すべて/プルーンソースに参加し影響を受け捨てなければなりません。トランスポート属性値が不明な場合ITRはまた、影響を受けるすべてを捨てなければなりませんルートは/プルーンソースに参加します。"
    },
    {
      "indent": 0,
      "text": "5. Receiver ETR RLOC Attribute",
      "section_title": true,
      "ja": "5.レシーバーETRのRLOC属性"
    },
    {
      "indent": 3,
      "text": "When a receiver ETR requests unicast head-end replication for a given (root-EID,G) entry, the PIM control plane of the root ITR must maintain an outgoing interface list (\"oif-list\") entry for the receiver ETR and its corresponding RLOC address. This allows the root ITR to perform unicast LISP-encapsulation of multicast data packets to each and every receiver ETR that has requested unicast head-end replication.",
      "ja": "受信機ETRが所定の（ルートEID、G）エントリのためのユニキャストヘッドエンド複製を要求すると、ルートのPIM制御プレーンは、ITRは、受信ETR及びそのためのエントリ（「OIFリスト」）発信インターフェイスリストを維持しなければなりませんRLOCアドレスに対応します。これは、ルートITRは、各ユニキャストヘッドエンド複製を要求したすべての受信機ETRへマルチキャストデータパケットのユニキャストLISPカプセル化を実行することを可能にします。"
    },
    {
      "indent": 3,
      "text": "The PIM control plane of the root ITR could potentially determine the RLOC address of the receiver ETR from the outer source address field of the LISP-encapsulated Join/Prune message. However, receiver ETRs are subject to uRPF checks by the network providers on each core-facing interface. The outer source address must therefore be the RLOC of the core-facing interface used to physically transmit the LISP-encapsulated Join/Prune message. Due to policy and load-balancing considerations, that may not be the RLOC on which the receiver site wishes to receive a particular flow. This document specifies a Join/Prune attribute that conveys the appropriate receiver RLOC address to the PIM control plane of the root ITR.",
      "ja": "ルートのPIM制御プレーンは、ITRは、潜在的にLISPカプセル化参加/プルーンメッセージの外側のソースアドレスフィールドから受信ETRのRLOCアドレスを決定することができます。しかしながら、受信機ETRSは各コアに面したインターフェイス上のネットワークプロバイダによってuRPFのチェックの対象となっています。外側のソースアドレスは、従って、物理的にLISPカプセル化/参加プルーンメッセージを送信するために使用されるコアに面したインターフェイスのRLOCなければなりません。政策とロードバランシングの考慮事項に、それは、受信サイトは、特定の流れを受けたいどのRLOCではないかもしれません。この文書では、ルートITRのPIMコントロールプレーンへの適切な受信機のRLOCアドレスを伝える参加/プルーンの属性を指定します。"
    },
    {
      "indent": 3,
      "text": "To support root-EID mobility, receiver ETRs must also be tracked by the LISP control plane of the root ITR, regardless of the underlying transport. When the root-EID moves to a new root ITR in a different LISP site, the receiver ETRs do not know the root-EID has moved and therefore do not know the RLOC of the new root ITR. This is true for both unicast and multicast transport modes. The new root ITR does not have any receiver ETR state. Therefore, it is the responsibility of the old root ITR to inform the receiver ETRs that the root-EID has moved. When the old root ITR detects that the root-EID has moved, it sends a LISP Solicit-Map-Request (SMR) message to each receiver ETR. The receiver ETRs do a mapping database lookup to retrieve the RLOC of the new root ITR. The old root ITR detects that the root-EID has moved when it receives a Map-Notify from the Map-Server. The transmission of the Map-Notify is triggered when the new root ITR registers the root-EID [EID-MOBILITY]. When a receiver ETR determines that the root ITR has changed, it will send a LISP-encapsulated PIM prune message to the old root xTR and a LISP-encapsulated PIM join message to the new root xTR.",
      "ja": "ルートEIDモビリティをサポートするために、受信機ETRSもかかわらず、基礎となるトランスポートのルートITRのLISP制御プレーンによって追跡されなければなりません。ルート-EIDが異なるLISPサイトに新しいルートITRに移動すると、受信ETRSは、root-EIDが移動したかわからないので、新しいルートITRのRLOCを知りません。これは、ユニキャストとマルチキャスト転送モードの両方に当てはまります。新しいルートITRは、任意の受信機ETR状態を持っていません。したがって、ルート-EIDが移動したレシーバETRSを知らせるために、古いルートITRの責任です。古い根ITRがroot-EIDが移動したことを検出すると、各受信機ETRにLISP要請 - 地図 - 要求（SMR）メッセージを送信します。レシーバETRSは、新しいルートITRのRLOCを取得するために、マッピングデータベースの検索を行います。 ITRは、それが地図-サーバーから-通知地図を受信したときにルート-EIDが移動したことを検出し、古いルート。新しいルートは、ITRがルートEID [EID-MOBILITY]を登録する際、通知マップの送信がトリガされます。受信機ETRがルートITRが変化したと判断した場合、それは新しいルートXTRへの参加メッセージを古いルートXTRとLISPカプセル化PIMにLISPカプセル化PIMのPruneメッセージを送信します。"
    },
    {
      "indent": 0,
      "text": "5.1. Receiver RLOC Attribute Format",
      "section_title": true,
      "ja": "5.1. レシーバRLOC属性のフォーマット"
    },
    {
      "indent": 6,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|F|E|  Type = 6 |    Length     |  Addr Family  |  Receiver RLOC\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-...",
      "raw": true
    },
    {
      "indent": 3,
      "text": "F bit: The Transitive bit. Specifies whether this attribute is transitive or non-transitive. MUST be set to zero. This attribute is ALWAYS non-transitive.",
      "ja": "Fビット：推移ビット。この属性が推移的または非推移であるかどうかを指定します。ゼロに設定しなければなりません。この属性は、常に非推移です。"
    },
    {
      "indent": 3,
      "text": "E bit: End-of-Attributes bit. Specifies whether this attribute is the last. Set to zero if there are more attributes. Set to 1 if this is the last attribute.",
      "ja": "Eビット：エンド・オブ・属性ビット。この属性が最後であるかどうかを指定します。より多くの属性がある場合は、ゼロに設定してください。これが最後の属性である場合は、1に設定してください。"
    },
    {
      "indent": 3,
      "text": "Type: The Receiver RLOC Attribute type is 6.",
      "ja": "タイプ：レシーバーRLOC属性タイプは6です。"
    },
    {
      "indent": 3,
      "text": "Length: The length in octets of the attribute value. MUST be set to the length in octets of the receiver RLOC address plus 1 octet to account for the Address Family field.",
      "ja": "長さ：属性値のオクテットの長さ。アドレスファミリフィールドを考慮するための受信機RLOCアドレスプラス1つのオクテットのオクテットの長さに設定しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Addr Family: The PIM Address Family of the receiver RLOC as defined in [RFC7761].",
      "ja": "ADDRファミリー：[RFC7761]で定義されるように受信機RLOCのPIMアドレスファミリ。"
    },
    {
      "indent": 3,
      "text": "Receiver RLOC: The RLOC address on which the receiver ETR wishes to receiver the unicast-encapsulated flow.",
      "ja": "受信機RLOC：受信ETRユニキャストカプセル化フロー受信機を希望するにRLOCアドレス。"
    },
    {
      "indent": 0,
      "text": "5.2. Using the Receiver RLOC Attribute",
      "section_title": true,
      "ja": "5.2. レシーバRLOC属性を使用しました"
    },
    {
      "indent": 3,
      "text": "Hierarchical Join/Prune attribute instances [RFC7887] SHOULD be used when the same Receiver RLOC Attribute is to be applied to all the sources within the message or all the sources within a group set. The root ITR MUST accept Transport Attributes in the Upstream Neighbor Encoded-Unicast address, Encoded-Group addresses, and Encoded-Source addresses.",
      "ja": "階層的な参加/プルーン[RFC7887]をインスタンス属性同じレシーバRLOC属性は、グループセット内のメッセージ内のすべてのソースまたはすべてのソースに適用されるときに使用されるべきです。 ITRは、交通を受け入れなければならないルートは、上流隣接エンコードされたユニキャストアドレス、符号化され、グループアドレス、およびエンコード・ソース・アドレスの属性。"
    },
    {
      "indent": 3,
      "text": "There MUST NOT be more than one Receiver RLOC Attribute within the same encoded address. If an encoded address has more than one instance of the attribute, the root ITR MUST discard all affected Join/Prune sources. The root ITR MUST also discard all affected Join/Prune sources if the address family is unknown or the address length is incorrect for the specified address family.",
      "ja": "同じエンコードされたアドレス内の複数のレシーバRLOC属性があってはなりません。エンコードされたアドレスが属性の複数のインスタンスを持っている場合、ルートは、ITRは、すべて/プルーンソースに参加し影響を受け捨てなければなりません。アドレスファミリが不明であるか、アドレス長が指定したアドレスファミリの正しくない場合ITRはまた、影響を受けるすべてを捨てなければなりませんルートは/プルーンソースに参加します。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Security of Join/Prune attributes is only guaranteed by the security of the PIM packet. The attributes specified herein do not enhance or diminish the privacy or authenticity of a Join/Prune message. A site that legitimately or maliciously sends and delivers a Join/Prune message to another site will equally be able to append these and any other attributes it wishes. See [RFC5384] for general security considerations for Join/Prune attributes.",
      "ja": "参加/プルーンのセキュリティはPIMパケットのセキュリティによって保証されている属性。ここ指定された属性は、参加/プルーンのメッセージのプライバシーや信頼性を向上させるか、減少させません。合法的にまたは悪意を持って別のサイトに参加/プルーンのメッセージを送信し、提供するサイトでは、同じように、それは望んでこれらおよび他の属性を追加することができるようになります。 /プルーンの属性に参加するための一般的なセキュリティ上の考慮事項については、[RFC5384]を参照してください。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "Two new PIM Join/Prune attribute types have been assigned: value 5 for the Transport Attribute and value 6 for the Receiver RLOC Attribute.",
      "ja": "二つの新しいPIMは/プルーンに参加属性タイプが割り当てられている：レシーバRLOC属性のためのトランスポート属性と値6の値5を。"
    },
    {
      "indent": 3,
      "text": "The \"PIM Join/Prune Transport Types\" registry has been created for the Join/Prune Transport attribute. The registration policy is IETF Review [RFC5226], and the values are in the range 0-255. This document assigns value 0 for multicast and value 1 for unicast.",
      "ja": "「PIM参加/プルーン交通タイプ」レジストリが参加/プルーントランスポート属性のために作成されています。登録ポリシーはIETFレビュー[RFC5226]は、値は0から255の範囲内にあります。この文書では、マルチキャストおよびユニキャストのための値1の値0を割り当てます。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC5384] Boers, A., Wijnands, I., and E. Rosen, \"The Protocol Independent Multicast (PIM) Join Attribute Format\", RFC 5384, DOI 10.17487/RFC5384, November 2008, <http://www.rfc-editor.org/info/rfc5384>.",
      "ja": "[RFC5384]ボーア人、A.、Wijnands、I.、およびE.ローゼン、 \"プロトコル独立マルチキャスト（PIM）属性フォーマットへの参加\"、RFC 5384、DOI 10.17487 / RFC5384、2008年11月、<のhttp：//www.rfc -editor.org/info/rfc5384>。"
    },
    {
      "indent": 3,
      "text": "[RFC6830] Farinacci, D., Fuller, V., Meyer, D., and D. Lewis, \"The Locator/ID Separation Protocol (LISP)\", RFC 6830, DOI 10.17487/RFC6830, January 2013, <http://www.rfc-editor.org/info/rfc6830>.",
      "ja": "[RFC6830]ファリナッチ、D.、フラー、V.、マイヤー、D.、およびD.ルイス、 \"ロケータ/ ID分離プロトコル（LISP）\"、RFC 6830、DOI 10.17487 / RFC6830、2013年1月、<HTTP：/ /www.rfc-editor.org/info/rfc6830>。"
    },
    {
      "indent": 3,
      "text": "[RFC6831] Farinacci, D., Meyer, D., Zwiebel, J., and S. Venaas, \"The Locator/ID Separation Protocol (LISP) for Multicast Environments\", RFC 6831, DOI 10.17487/RFC6831, January 2013, <http://www.rfc-editor.org/info/rfc6831>.",
      "ja": "[RFC6831]ファリナッチ、D.、マイヤー、D.、Zwiebel、J.、およびS. Venaas、 \"ロケータ/ ID分離プロトコルマルチキャスト環境の（LISP）\"、RFC 6831、DOI 10.17487 / RFC6831、2013年1月、< http://www.rfc-editor.org/info/rfc6831>。"
    },
    {
      "indent": 3,
      "text": "[RFC7761] Fenner, B., Handley, M., Holbrook, H., Kouvelas, I., Parekh, R., Zhang, Z., and L. Zheng, \"Protocol Independent Multicast - Sparse Mode (PIM-SM): Protocol Specification (Revised)\", STD 83, RFC 7761, DOI 10.17487/RFC7761, March 2016, <http://www.rfc-editor.org/info/rfc7761>.",
      "ja": "[RFC7761]フェナー、B.、ハンドレー、M.、ホルブルック、H.、Kouvelas、I.、Parekhの、R.、張、Z.、およびL.鄭、「プロトコル独立マルチキャスト - スパースモード（PIM-SM） ：プロトコル仕様（改訂）」、STD 83、RFC 7761、DOI 10.17487 / RFC7761、2016年3月、<http://www.rfc-editor.org/info/rfc7761>。"
    },
    {
      "indent": 3,
      "text": "[RFC7887] Venaas, S., Arango, J., and I. Kouvelas, \"Hierarchical Join/Prune Attributes\", RFC 7887, DOI 10.17487/RFC7887, June 2016, <http://www.rfc-editor.org/info/rfc7887>.",
      "ja": "[RFC7887] Venaas、S.、アランゴ、J.、及びI. Kouvelas、 \"階層参加/プルーン属性\"、RFC 7887、DOI 10.17487 / RFC7887、2016年6月、<http://www.rfc-editor.org/情報/ rfc7887>。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[EID-MOBILITY] Portoles-Comeras, M., Ashtaputre, V., Moreno, V., Maino, F., and D. Farinacci, \"LISP L2/L3 EID Mobility Using a Unified Control Plane\", Work in Progress, draft-portoles-lisp-eid-mobility-01, October 2016.",
      "ja": "[EID-MOBILITY] Portoles-Comeras、M.、Ashtaputre、V.、モレノ、V.、メイノー、F.、およびD.ファリナッチ、 \"統合制御プレーンを使用LISP L2 / L3 EIDモビリティ\"、進行中で働いて、ドラフトportoles-lispの-EID-モビリティ-01、2016年10月。"
    },
    {
      "indent": 3,
      "text": "[RFC5226] Narten, T. and H. Alvestrand, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 5226, DOI 10.17487/RFC5226, May 2008, <http://www.rfc-editor.org/info/rfc5226>.",
      "ja": "[RFC5226] Narten氏、T.とH. Alvestrand、 \"RFCsにIANA問題部に書くためのガイドライン\"、BCP 26、RFC 5226、DOI 10.17487 / RFC5226、2008年5月、<http://www.rfc-editor.org /情報/ RFC5226>。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jesus Arango Cisco Systems 170 Tasman Drive San Jose, CA 95134 United States of America",
      "ja": "イエス・アランゴシスコシステムズ170タスマン・ドライブサンノゼ、CAアメリカの95134米国"
    },
    {
      "indent": 3,
      "text": "Email: jearango@cisco.com",
      "ja": "メール：jearango@cisco.com"
    },
    {
      "indent": 3,
      "text": "Stig Venaas Cisco Systems 170 Tasman Drive San Jose, CA 95134 United States of America",
      "ja": "スティグVenaasシスコシステムズ170タスマン・ドライブサンノゼ、CAアメリカの95134米国"
    },
    {
      "indent": 3,
      "text": "Email: stig@cisco.com",
      "ja": "メール：stig@cisco.com"
    },
    {
      "indent": 3,
      "text": "Isidor Kouvelas Arista Networks Inc. 5453 Great America Parkway Santa Clara, CA 95054 United States of America",
      "ja": "イジドールKouvelasアリスタネットワークス株式会社5453グレートアメリカパークウェイサンタクララ、CAアメリカの95054米国"
    },
    {
      "indent": 3,
      "text": "Email: kouvelas@arista.com",
      "ja": "メール：kouvelas@arista.com"
    },
    {
      "indent": 3,
      "text": "Dino Farinacci lispers.net San Jose, CA United States of America",
      "ja": "ディノファリナッチlispers.netサンノゼ、アメリカのカリフォルニア州、米国"
    },
    {
      "indent": 3,
      "text": "Email: farinacci@gmail.com",
      "ja": "メール：farinacci@gmail.com"
    }
  ]
}