{
  "title": {
    "text": "RFC 8728 - RFC Editor Model (Version 2)",
    "ja": "RFC 8728 - RFCエディターモデル（バージョン2）"
  },
  "number": 8728,
  "created_at": "2020-08-17 18:47:56.632949+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Architecture Board (IAB)                        O. Kolkman, Ed.\nRequest for Comments: 8728                              Internet Society\nObsoletes: 6635                                          J. Halpern, Ed.\nCategory: Informational                                         Ericsson\nISSN: 2070-1721                                           R. Hinden, Ed.\n                                                    Check Point Software\n                                                           February 2020",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 22,
      "text": "RFC Editor Model (Version 2)",
      "ja": "RFCエディターモデル（バージョン2）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The RFC Editor model described in this document divides the responsibilities for the RFC Series into three functions: the RFC Series Editor, the RFC Production Center, and the RFC Publisher. Internet Architecture Board (IAB) oversight via the RFC Series Oversight Committee (RSOC) is described, as is the relationship between the IETF Administration Limited Liability Company and the RSOC. This document reflects the experience gained with \"RFC Editor Model (Version 1)\", documented in RFC 5620; and obsoletes RFC 6635 to replace all references to the IETF Administrative Support Activity (IASA) and related structures with those defined by the IASA 2.0 Model.",
      "ja": "このドキュメントで説明するRFCエディタモデルは、RFCシリーズの責任を3つの機能に分割します。RFCシリーズエディタ、RFCプロダクションセンター、およびRFCパブリッシャです。 IETF Administration Limited Liability CompanyとRSOCの関係と同様に、RFCシリーズ監視委員会（RSOC）によるインターネットアーキテクチャボード（IAB）の監視について説明します。このドキュメントは、RFC 5620に記載されている「RFC Editor Model（Version 1）」で得られた経験を反映しています。また、RFC 6635を廃止し、IETF管理サポートアクティビティ（IASA）および関連する構造へのすべての参照を、IASA 2.0モデルで定義されたものに置き換えます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の状態"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはInternet Standards Trackの仕様ではありません。情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. It represents the consensus of the Internet Architecture Board (IAB). Documents approved for publication by the IAB are not candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットアーキテクチャボード（IAB）の製品であり、IABが永続的な記録を提供するために価値があると見なした情報を表しています。これは、インターネットアーキテクチャボード（IAB）のコンセンサスを表しています。 IABによって公開が承認されたドキュメントは、どのレベルのインターネット標準の候補にもなりません。 RFC 7841のセクション2をご覧ください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8728.",
      "ja": "このドキュメントの現在のステータス、正誤表、およびフィードバックの提供方法に関する情報は、https：//www.rfc-editor.org/info/rfc8728で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2020 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2020 IETFトラストおよびドキュメントの作成者として識別された人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "この文書は、BCP 78およびIETF文書に関するIETFトラストの法的規定（https://trustee.ietf.org/license-info）の対象であり、この文書の発行日に有効です。これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているため、注意深く確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n  1.1.  The RFC Editor Function\n2.  RFC Editor Model\n  2.1.  RFC Series Editor\n    2.1.1.  Strategic Leadership and Management of the Publication\n            and Production Functions\n    2.1.2.  Representation of the RFC Series\n      2.1.2.1.  Representation to the IETF\n      2.1.2.2.  External Representation\n    2.1.3.  Development of RFC Production and Publication\n    2.1.4.  Development of the RFC Series\n    2.1.5.  Workload\n    2.1.6.  Qualifications\n    2.1.7.  Conflict of Interest\n  2.2.  RFC Production Center\n  2.3.  RFC Publisher\n3.  Committees\n  3.1.  RFC Series Oversight Committee (RSOC)\n    3.1.1.  RSOC Composition\n4.  Administrative Implementation\n  4.1.  Vendor Selection for the Production and Publisher Functions\n  4.2.  Budget\n  4.3.  Disagreements among Entities Related to the RFC Editor\n  4.4.  Issues with Contractual Impact\n5.  IANA Considerations\n6.  Security Considerations\n7.  References\n  7.1.  Normative References\n  7.2.  Informative References\nIAB Members at the Time of Approval\nAcknowledgments\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document reflects the experience gained with \"RFC Editor Model (Version 1)\", documented in [RFC5620], and updates the RFC Editor Model (Version 2) to be aligned with the new IASA 2.0 Model [RFC8711] that creates the IETF Administration Limited Liability Company (IETF LLC) managed by a board of directors (IETF LLC Board). As part of the IASA 2.0 Model, the IETF Administrative Oversight Committee (IAOC) is eliminated, and its oversight and advising functions transferred to the new IETF LLC. This document obsoletes [RFC6635] to replace all references to the IASA and related structures with those defined by the IASA 2.0 Model.",
      "ja": "このドキュメントは、[RFC5620]に文書化されている「RFCエディターモデル（バージョン1）」で得られた経験を反映し、IETF管理を作成する新しいIASA 2.0モデル[RFC8711]に合わせてRFCエディターモデル（バージョン2）を更新します。取締役会（IETF LLC理事会）が管理する有限責任会社（IETF LLC）。 IASA 2.0モデルの一部として、IETF管理監視委員会（IAOC）が廃止され、その監視および助言機能が新しいIETF LLCに移管されました。このドキュメントは、[RFC6635]を廃止し、IASAおよび関連構造へのすべての参照をIASA 2.0モデルで定義されたものに置き換えます。"
    },
    {
      "indent": 3,
      "text": "The IAB, on behalf of the Internet technical community, is concerned with ensuring the continuity of the RFC Series, orderly RFC Editor succession, RFC quality, and RFC document accessibility. The IAB is also sensitive to the concerns of the IETF LLC about providing the necessary services in a cost-effective and efficient manner.",
      "ja": "IABは、インターネット技術コミュニティを代表して、RFCシリーズの継続性、整然としたRFCエディターの継承、RFC品質、およびRFCドキュメントのアクセシビリティの確保に関与しています。 IABは、費用効果が高く効率的な方法で必要なサービスを提供することに関するIETF LLCの懸念にも敏感です。"
    },
    {
      "indent": 3,
      "text": "The previous RFC Editor model [RFC5620] was first approved by the IAB in October 2008, and our understanding of the model has evolved with our experience since. During the implementation of version 1 of the model [RFC5620], it was quickly realized that the role of the RFC Series Editor (RSE) and the oversight responsibilities needed to be structured differently. In order to gain experience with \"running code\", a transitional RSE was hired who analyzed the managerial environment and provided recommendations. This was followed by the appointment of an acting RSE, who ably managed the series while work was undertaken to select and hire a permanent RSE. This version of the model is based on the recommendations of both temporary RFC Series Editors and the extensive discussion in the IETF community, on the rfc-interest list, and within the IAB.",
      "ja": "以前のRFC Editorモデル[RFC5620]は、2008年10月にIABによって最初に承認され、モデルに対する私たちの理解は、それ以降の経験とともに進化しました。モデル[RFC5620]のバージョン1の実装中に、RFCシリーズエディター（RSE）の役割と監視の責任を異なる方法で構成する必要があることがすぐにわかりました。 「コードの実行」の経験を得るために、管理環境を分析して推奨事項を提供する暫定RSEが採用されました。これに続いて、代理RSEが任命されました。RSEは、恒久的なRSEを選択して雇用する作業が行われている間、シリーズを適切に管理しました。このバージョンのモデルは、一時的なRFCシリーズエディターの推奨とIETFコミュニティ、rfc-interestリスト、およびIAB内での広範な議論に基づいています。"
    },
    {
      "indent": 3,
      "text": "This document, and the resulting structures, will be modified as needed through normal procedures. The RSE, and the IAB, through the RFC Series Oversight Committee (see Section 3.1), will continue to monitor discussions within the community about potential adjustments to the RFC Editor model and recognize that the process described in this document may need to be adjusted to align with any changes that result from such discussions; hence, the version number in the title.",
      "ja": "このドキュメントと結果の構造は、通常の手順で必要に応じて変更されます。 RSEとIABは、RFCシリーズ監視委員会（セクション3.1を参照）を通じて、コミュニティ内でのRFCエディターモデルの潜在的な調整に関する議論を引き続き監視し、このドキュメントで説明されているプロセスを調整する必要があることを認識します。そのような議論から生じるあらゆる変化に合わせる;したがって、タイトルのバージョン番号です。"
    },
    {
      "indent": 3,
      "text": "The IAB maintains its responsibilities as defined in [RFC2850].",
      "ja": "IABは[RFC2850]で定義されているようにその責任を維持します。"
    },
    {
      "indent": 0,
      "text": "1.1. The RFC Editor Function",
      "section_title": true,
      "ja": "1.1. RFCエディター機能"
    },
    {
      "indent": 3,
      "text": "The RFC Series is described in [RFC8729]. Its Section 3.1 defines \"RFC Editor\":",
      "ja": "RFCシリーズは[RFC8729]で説明されています。セクション3.1は「RFCエディタ」を定義しています。"
    },
    {
      "indent": 3,
      "text": "|  Originally, there was a single person acting as editor of the RFC\n|  Series (the RFC Editor).  The task has grown, and the work now\n|  requires the organized activity of several experts, so there are\n|  RFC Editors, or an RFC Editor organization.  In time, there may be\n|  multiple organizations working together to undertake the work\n|  required by the RFC Series.  For simplicity's sake, and without\n|  attempting to predict how the role might be subdivided among them,\n|  this document refers to this collection of experts and\n|  organizations as the \"RFC Editor\".\n|\n|  The RFC Editor is an expert technical editor and series editor,\n|  acting to support the mission of the RFC Series.  As such, the RFC\n|  Editor is the implementer handling the editorial management of the\n|  RFC Series, in accordance with the defined processes.  In\n|  addition, the RFC Editor is expected to be the expert and prime\n|  mover in discussions about policies for editing, publishing, and\n|  archiving RFCs.",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "RFC 8729 does not explore the internal organization of the RFC Editor. However, RFC 8729 envisions changes in the RFC Editor organizational structure. There have been several iterations on efforts to improve and clarify this structure. These have been led by the IAB, in consultation with the community and many leadership bodies within the community. This first resulted in the publication of [RFC5620] and then in further discussions leading to the publication of [RFC6635]. Some of the details on this evolution can be found below. In undertaking this evolution, the IAB considered changes that increase flexibility and operational support options, provide for the orderly succession of the RFC Editor, and ensure the continuity of the RFC Series, while maintaining RFC quality, maintaining timely processing, ensuring document accessibility, reducing costs, and increasing cost transparency. The model set forth below describes the internal organization of the RFC Editor, while remaining consistent with RFC 8729.",
      "ja": "RFC 8729は、RFCエディターの内部組織を探索しません。ただし、RFC 8729は、RFCエディターの組織構造の変更を想定しています。この構造を改善し、明確にするための取り組みについて、いくつかの反復がありました。これらは、コミュニティおよびコミュニティ内の多くのリーダーシップ組織と協議して、IABが主導しています。これにより、最初に[RFC5620]が発行され、その後、[RFC6635]の発行に至るまでのさらなる議論が行われました。この進化の詳細の一部を以下に示します。 IABはこの進化に着手する際に、柔軟性と運用サポートオプションを増やし、RFCエディターの規則正しい継承を提供し、RFC品質を維持し、タイムリーな処理を維持し、ドキュメントのアクセシビリティを確保しながら、RFCシリーズの継続性を確保する変更を検討しました。コスト、およびコストの透明性の向上。以下に示すモデルは、RFC 8729との整合性を保ちながら、RFCエディターの内部構成を説明しています。"
    },
    {
      "indent": 3,
      "text": "Note that RFC 8729 uses the term \"RFC Editor function\" or \"RFC Editor\" as the collective set of responsibilities for which this memo provides a model for internal organization. This memo defines the term \"RFC Series Editor\" or \"Series Editor\" for one of the organizational components.",
      "ja": "RFC 8729では、このメモが内部組織のモデルを提供する責任の集合として、「RFCエディタ機能」または「RFCエディタ」という用語を使用していることに注意してください。このメモは、組織コンポーネントの1つに対して「RFCシリーズエディター」または「シリーズエディター」という用語を定義します。"
    },
    {
      "indent": 0,
      "text": "2. RFC Editor Model",
      "section_title": true,
      "ja": "2. RFCエディターモデル"
    },
    {
      "indent": 3,
      "text": "The RFC Editor model divides the responsibilities for the RFC Series into the following components:",
      "ja": "RFCエディタモデルは、RFCシリーズの責任を次のコンポーネントに分割します。"
    },
    {
      "indent": 3,
      "text": "* RFC Series Editor (RSE)",
      "ja": "* RFCシリーズエディター（RSE）"
    },
    {
      "indent": 3,
      "text": "* RFC Production Center",
      "ja": "* RFCプロダクションセンター"
    },
    {
      "indent": 3,
      "text": "* RFC Publisher",
      "ja": "* RFCパブリッシャー"
    },
    {
      "indent": 3,
      "text": "The structure and relationship of the components of the RFC Series production and process is schematically represented by Figure 1. The picture does not depict oversight and escalation relations. It does include the streams and their managers (which are not part of the RFC Series Editor, the RFC Production Center, or Publisher facilities) in order to more fully show the context in which the RFC Series Editor operates.",
      "ja": "RFCシリーズの生産とプロセスのコンポーネントの構造と関係は、図1で概略的に表されています。この図は、監視とエスカレーションの関係を示していません。 RFCシリーズエディターが動作するコンテキストをより完全に示すために、ストリームとそのマネージャー（RFCシリーズエディター、RFCプロダクションセンター、または発行者機能の一部ではない）が含まれています。"
    },
    {
      "indent": 3,
      "text": "                                      +-------------+\n                                      |             |\n                       +--------------+     IAB     <----------+\n                       |              |             |          |\n                       |              |=============|          |\n                       |              |             |          |\n                       |              |     RSOC    <----------+\n                       |              |             |          |\n                       |              +-------+-----+     +----+----+\n                       |                      |           |         |\n                       |          +...........|.........+ |Community|\n                       |          .           |         . |   at    |\n                       |          .   +-------V-----+   . |  Large  |\n                       |          .   |             |   . |         |\n                       |          .   |     RFC     |   . +----+----+\n                       |          .   |    Series   |   .      |\n                       |          .   |    Editor   <----------+\n                       |          .   |             |   .\n                       |          .   +-+---------+-+   .\n                       |          .     |         |     .\n+-------------+  +-----V-------+  .  +--V--+   +--V--+  .     +-----+\n|             |  |             |  .  |     |   |     |  .     |     |\n| Independent |  | Independent |  .  | RFC |   |     |  .     |  E  |\n|   Authors   +--> Submission  +----->     |   |     |  .     |  n  |\n|             |  |   Editor    |  .  |  P  |   |     |  .     |  d  |\n|             |  |             |  .  |  r  |   | RFC |  .     |     |\n+-------------+  +-------------+  .  |  o  |   |     |  .     |  U  |\n+-------------+  +-------------+  .  |  d  |   |  P  |  .     |  s  |\n|             |  |             |  .  |  u  |   |  u  |  .     |  e  |\n|     IAB     +-->     IAB     +----->  c  |   |  b  |  .     |  r  |\n|             |  |             |  .  |  t  |   |  l  |  .     |  s  |\n+-------------+  +-------------+  .  |  i  +--->  i  +-------->     |\n+-------------+  +-------------+  .  |  o  |   |  s  |  .     |  &  |\n|             |  |             |  .  |  n  |   |  h  |  .     |     |\n|    IRTF     +-->     IRSG    +---->|     |   |  e  |  .     |  R  |\n|             |  |             |  .  |  C  |   |  r  |  .     |  e  |\n+-------------+  +-------------+  .  |  e  |   |     |  .     |  a  |\n+-------------+  +-------------+  .  |  n  |   |     |  .     |  d  |\n|             |  |             |  .  |  t  |   |     |  .     |  e  |\n|    IETF     +-->    IESG     +----->  e  |   |     |  .     |  r  |\n|             |  |             |  .  |  r  |   |     |  .     |  s  |\n+-------------+  +-------------+  .  +-----+   +-----+  .     +-----+\n                                  .                     .\n                                  +..... RFC Editor ....+",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Figure 1: Structure of RFC Series Production and Process",
      "ja": "図1：RF​​Cシリーズの生産とプロセスの構造"
    },
    {
      "indent": 3,
      "text": "In this model, documents are produced and approved through multiple document streams. The stream manager for each stream is responsible for the content of that stream. The four streams that now exist are described in [RFC8729]. The RFC Editor function is responsible for the packaging and distribution of the documents. As such, documents from these streams are edited and processed by the Production Center and published by the Publisher. The RFC Series Editor will exercise strategic leadership and management over the activities of the RFC Publisher and the RFC Production Center (both of which can be seen as back-office functions) and will be the entity that:",
      "ja": "このモデルでは、複数のドキュメントストリームを通じてドキュメントが作成および承認されます。各ストリームのストリームマネージャは、そのストリームのコンテンツを管理します。現在存在する4つのストリームは[RFC8729]で説明されています。 RFCエディタ機能は、ドキュメントのパッケージ化と配布を担当します。そのため、これらのストリームからのドキュメントは、Production Centerによって編集および処理され、発行者によって公開されます。 RFCシリーズエディターは、R​​FCパブリッシャーとRFCプロダクションセンター（どちらもバックオフィス機能と見なすことができます）の活動に対して戦略的なリーダーシップと管理を実行し、以下のエンティティになります。"
    },
    {
      "indent": 3,
      "text": "* Represents the RFC Series and the RFC Editor function within the IETF and externally.",
      "ja": "* IETF内および外部のRFCシリーズおよびRFCエディター機能を表します。"
    },
    {
      "indent": 3,
      "text": "* Leads the community in the design of improvements to the RFC Series.",
      "ja": "* RFCシリーズの改善の設計においてコミュニティをリードします。"
    },
    {
      "indent": 3,
      "text": "* Is responsible for planning and seeing to the execution of improvements in the RFC Editor production and access processes.",
      "ja": "* RFC Editorの作成およびアクセスプロセスの改善を計画し、実行を確認する責任があります。"
    },
    {
      "indent": 3,
      "text": "* Is responsible for the content of the rfc-editor.org web site, which is operated and maintained by the RFC Publisher.",
      "ja": "* RFC Publisherによって運営および維持されているrfc-editor.org Webサイトのコンテンツに責任があります。"
    },
    {
      "indent": 3,
      "text": "* Is responsible for developing consensus versions of vision and policy documents. These documents will be reviewed by the RFC Series Oversight Committee (Section 3.1) and subject to its approval before final publication.",
      "ja": "* ビジョンとポリシー文書のコンセンサスバージョンの開発を担当します。これらのドキュメントは、RFCシリーズ監視委員会（セクション3.1）によってレビューされ、最終的な公開前に承認されます。"
    },
    {
      "indent": 3,
      "text": "These responsibilities are defined below, although the specific work items under them are a matter for the actual employment contract and its Statement of Work (SOW).",
      "ja": "これらの責任は以下に定義されていますが、その下の特定の作業項目は実際の雇用契約とその作業明細書（SOW）の問題です。"
    },
    {
      "indent": 3,
      "text": "The IAB maintain its chartered responsibility as defined in [RFC2850]. More details on the oversight by the IAB via the RFC Series Oversight Committee (RSOC) can be found in Section 3.1. For example, the RSE does not have the direct authority to hire or fire RFC Editor contractors or personnel.",
      "ja": "IABは、[RFC2850]で定義されているチャーターされた責任を維持します。 RFCシリーズ監視委員会（RSOC）によるIABによる監視の詳細については、セクション3.1を参照してください。たとえば、RSEには、RFCエディターの請負業者または要員を雇用または解雇する直接の権限がありません。"
    },
    {
      "indent": 0,
      "text": "2.1. RFC Series Editor",
      "section_title": true,
      "ja": "2.1. RFCシリーズエディター"
    },
    {
      "indent": 3,
      "text": "The RFC Series Editor is the individual with overall responsibility for the quality, continuity, and evolution of the RFC Series.",
      "ja": "RFCシリーズエディターは、R​​FCシリーズの品質、継続性、および進化について全体的な責任を持つ個人です。"
    },
    {
      "indent": 3,
      "text": "The RSE is appointed by the IAB, but formally hired by the IETF LLC. The IAB delegates the direct oversight over the RSE to the RSOC, which it appoints.",
      "ja": "RSEはIABによって任命されますが、IETF LLCによって正式に採用されました。 IABは、RSEに対する直接の監視を、指定するRSOCに委任します。"
    },
    {
      "indent": 3,
      "text": "The RSE is expected to cooperate closely with the IETF LLC and the stream managers.",
      "ja": "RSEは、IETF LLCおよびストリームマネージャーと緊密に協力することが期待されています。"
    },
    {
      "indent": 0,
      "text": "2.1.1. Strategic Leadership and Management of the Publication and Production Functions",
      "ja": "2.1.1. 出版および制作機能の戦略的リーダーシップと管理"
    },
    {
      "indent": 3,
      "text": "With respect to the RFC Publisher and Production Center functions, the RSE provides input to the IETF LLC budget, SOWs, and manages vendor selection processes. The RSE performs annual reviews of the RFC Production Center and Publisher function, which are then provided to the RSOC, the IETF LLC, and the community. Normally, private financial details would not be included in a public version unless the IETF LLC concludes it is necessary to make such information public.",
      "ja": "RFCパブリッシャーとプロダクションセンターの機能に関して、RSEはIETF LLC予算、SOWへの入力を提供し、ベンダー選択プロセスを管理します。 RSEは、RFC Production CenterおよびPublisher機能の年次レビューを実行し、RSOC、IETF LLC、およびコミュニティに提供されます。通常、IETF LLCがそのような情報を公開する必要があると結論しない限り、民間の財務詳細は公開バージョンに含まれません。"
    },
    {
      "indent": 3,
      "text": "The RSE is responsible for the performance of the RFC Production Center and Publisher. The RSE is responsible for issues that go beyond the RFC Production Center or Publisher functions, such as cross-stream coordination of priorities. Issues that require changes to the budget or contracts shall be brought to the attention of the IETF LLC by the RSE.",
      "ja": "RSEは、RFC Production CenterおよびPublisherのパフォーマンスを担当します。 RSEは、優先順位のクロスストリーム調整など、RFC Production CenterまたはPublisherの機能を超える問題に責任があります。予算または契約の変更が必要な問題は、RSEによってIETF LLCに通知されるものとします。"
    },
    {
      "indent": 3,
      "text": "The RSE is also responsible for creating documentation and structures that will allow for continuity of the RFC Series in the face of changes in contracts and personnel.",
      "ja": "RSEは、契約と人員の変更に直面した場合にRFCシリーズの継続性を可能にするドキュメントと構造の作成も担当します。"
    },
    {
      "indent": 3,
      "text": "Vendor selection for the RFC Production Center and Publisher functions is done in cooperation with the streams and under final authority of the IETF LLC. Details on this process can be found in Section 4.1.",
      "ja": "RFC Production CenterおよびPublisher機能のベンダー選択は、ストリームと協力して、IETF LLCの最終的な権限の下で行われます。このプロセスの詳細については、セクション4.1を参照してください。"
    },
    {
      "indent": 0,
      "text": "2.1.2. Representation of the RFC Series",
      "section_title": true,
      "ja": "2.1.2. RFCシリーズの表現"
    },
    {
      "indent": 3,
      "text": "The RSE is the primary representative of the RFC Series. This representation is important both internally, relative to the IETF, and externally.",
      "ja": "RSEはRFCシリーズの主要な代表です。この表現は、IETFに対して内部的にも外部的にも重要です。"
    },
    {
      "indent": 0,
      "text": "2.1.2.1. Representation to the IETF",
      "section_title": true,
      "ja": "2.1.2.1. IETFへの表現"
    },
    {
      "indent": 3,
      "text": "The RSE is the primary point of contact to the IETF on matters relating to the RFC Series in general, or policy matters relating to specific documents. Issues of practical details in the processing of specific documents are generally worked through directly with the RFC Production Center staff.",
      "ja": "RSEは、RFCシリーズ全般に関連する事項、または特定のドキュメントに関連するポリシー事項に関するIETFへの主要な連絡窓口です。特定のドキュメントの処理における実際の詳細の問題は、通常、RFC Production Centerのスタッフと直接やり取りされます。"
    },
    {
      "indent": 3,
      "text": "This includes providing suitable reports to the community at large, providing email contact for policy questions and inputs, and enabling and participating in suitable on-line forums for discussion of issues related to the RFC Series.",
      "ja": "これには、コミュニティ全体への適切なレポートの提供、ポリシーの質問と入力に関する電子メールの連絡先の提供、およびRFCシリーズに関連する問題についての議論のための適切なオンラインフォーラムの有効化と参加が含まれます。"
    },
    {
      "indent": 3,
      "text": "Due to the history and nature of the interaction between the RSE and the IETF, certain principles, described in the following subsections, must be understood and adhered to by the RSE in his or her interactions with the community. These apply to the representation function, as well as to the leadership the RSE provides for production and series development.",
      "ja": "RSEとIETF間の相互作用の歴史と性質により、以下のサブセクションで説明する特定の原則は、RSEがコミュニティとの相互作用において理解し、順守する必要があります。これらは、表現機能だけでなく、RSEがプロダクションおよびシリーズ開発のために提供するリーダーシップにも適用されます。"
    },
    {
      "indent": 0,
      "text": "2.1.2.1.1. Volunteerism",
      "section_title": true,
      "ja": "2.1.2.1.1. ボランティア活動"
    },
    {
      "indent": 3,
      "text": "The vast majority of Internet technical community work is led, initiated, and done by community volunteers, including oversight, policy making, and direct production of, for example, many software tools. The RSE, while not a volunteer, is dependent upon these volunteer participants. Also, the spirit of the community is heavily focused on and draws from these volunteers. As such, the RSE needs to support the vitality and effectiveness of volunteer participation.",
      "ja": "インターネット技術コミュニティの作業の大部分は、監視、政策立案、たとえば多くのソフトウェアツールの直接生産など、コミュニティボランティアによって主導、開始、実行されています。 RSEはボランティアではありませんが、これらのボランティア参加者に依存しています。また、コミュニティの精神は、これらのボランティアに重点を置き、そこから引き出されています。そのため、RSEはボランティア参加の活力と効果をサポートする必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1.2.1.2. Policy Authority",
      "section_title": true,
      "ja": "2.1.2.1.2. 政策当局"
    },
    {
      "indent": 3,
      "text": "All decisions are to be made in the overall interest of the broader Internet community. The RSE is responsible for identifying materially concerned interest groups within the Internet community and reaching out to them. Those interest groups include at least the IETF community, the IRTF community, the network research community, and the network operations community. Other interest groups might also be materially interested.",
      "ja": "すべての決定は、より広いインターネットコミュニティの全体的な利益のためになされます。 RSEは、イン​​ターネットコミュニティ内の重大な関心のある利益団体を特定し、それらに連絡する責任があります。これらの利益団体には、少なくともIETFコミュニティ、IRTFコミュニティ、ネットワーク研究コミュニティ、およびネットワーク運用コミュニティが含まれます。他の利益団体も物質的に関心があるかもしれません。"
    },
    {
      "indent": 3,
      "text": "The RSE must consult with the community on policy issues. The RSE works with the community to achieve policy that meets the overall quality, continuity, and evolution goals the RSE is charged with meeting. As described in Section 3.1, the RSE reports the results of such interactions to the RSOC, including a description of the outreach efforts and the specific recommendations on policy. This enables the RSOC to provide the oversight the IAB is required to apply, as well as to confirm that the Internet community has been properly consulted and considered in making policy.",
      "ja": "RSEは、政策問題についてコミュニティと協議する必要があります。 RSEはコミュニティと協力して、RSEが満たすべき全体的な品質、継続性、および進化の目標を満たすポリシーを達成します。セクション3.1で説明したように、RSEはそのようなやり取りの結果をRSOCに報告します。これには、アウトリーチの取り組みの説明とポリシーに関する具体的な推奨事項が含まれます。これにより、RSOCは、IABが適用する必要のある監視機能を提供し、ポリシーの作成においてインターネットコミュニティが適切に参照および検討されていることを確認できます。"
    },
    {
      "indent": 0,
      "text": "2.1.2.2. External Representation",
      "section_title": true,
      "ja": "2.1.2.2. 外部表現"
    },
    {
      "indent": 3,
      "text": "From time to time, individuals or organizations external to the IETF need a contact person to talk to about the RFC Series. The RSE, or the RSE's designate, serves this role.",
      "ja": "IETFの外部にいる個人または組織は、RFCシリーズについて話し合うための連絡担当者を必要とする場合があります。 RSEまたはRSEの代理がこの役割を果たします。"
    },
    {
      "indent": 3,
      "text": "Over time, the RSE should determine what, if any, means should be employed to increase end-user awareness of the series, to reinforce the stature of the series, and to provide the contact point for outside parties seeking information on the series or the Editor.",
      "ja": "時間が経つにつれて、RSEは、シリーズのエンドユーザーの認識を高め、シリーズの名声を強化し、シリーズまたはシリーズに関する情報を求める外部の関係者に連絡窓口を提供するためにどのような手段を採用すべきかを決定する必要があります。編集者。"
    },
    {
      "indent": 0,
      "text": "2.1.3. Development of RFC Production and Publication",
      "section_title": true,
      "ja": "2.1.3. RFCの作成と公開の開発"
    },
    {
      "indent": 3,
      "text": "Closely related to providing strategic leadership and management to the RFC Production Center and Publisher functions is the need to develop and improve those functions. The RSE is responsible for ensuring that such ongoing development takes place.",
      "ja": "RFC Production CenterとPublisherの機能に戦略的なリーダーシップと管理を提供することに密接に関連しているのは、これらの機能を開発して改善する必要があることです。 RSEは、このような継続的な開発が行われるようにする責任があります。"
    },
    {
      "indent": 3,
      "text": "This effort must include the dimensions of document quality, timeliness of production, and accessibility of results. It must also specifically take into account issues raised by the IETF community, including all the streams feeding into the RFC Editor function.",
      "ja": "この取り組みには、ドキュメントの品質、制作の適時性、および結果のアクセシビリティの側面を含める必要があります。また、RFCエディター機能に供給されるすべてのストリームを含む、IETFコミュニティーによって提起された問題を特に考慮に入れる必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1.4. Development of the RFC Series",
      "section_title": true,
      "ja": "2.1.4. RFCシリーズの開発"
    },
    {
      "indent": 3,
      "text": "In order to develop the RFC Series, the RSE is expected to develop a relationship with the Internet technical community. The Editor is expected to engage with the Internet technical community in a process of articulating and refining a vision for the series and its continuous evolution. The RSE is also expected to engage other users of the RFC Series, in particular, the consumers of these documents, such as those people who use them to specify products, write code, test behaviors, or other related activities.",
      "ja": "RFCシリーズを開発するために、RSEはインターネット技術コミュニティとの関係を発展させることが期待されています。編集者は、シリーズとその継続的な進化のビジョンを明確にし、洗練するプロセスにおいて、インターネット技術コミュニティに関与することが期待されています。 RSEは、RFCシリーズの他のユーザー、特にこれらのドキュメントの利用者（製品の指定、コードの記述、テストの動作、またはその他の関連する活動にそれらを使用する人々など）との関わりも期待されています。"
    },
    {
      "indent": 3,
      "text": "Concretely:",
      "ja": "具体的には："
    },
    {
      "indent": 6,
      "text": "The RSE is responsible for the coordination of discussion on series evolution among the series' stream participants and the broader Internet technical community.",
      "ja": "RSEは、シリーズのストリーム参加者とより広範なインターネット技術コミュニティの間で、シリーズの進化に関する議論の調整を担当します。"
    },
    {
      "indent": 6,
      "text": "In time, the RSE is expected to develop and refine a vision for the RFC Series, including examining:",
      "ja": "やがて、RSEは、RFCシリーズのビジョンを開発および改善することが期待されます。"
    },
    {
      "indent": 6,
      "text": "- The RFC Series, as it continues to evolve. The RSE is expected to take a broad view and look for the best ways to evolve the series for the benefit of the entire Internet community. As such, the RSE may even consider evolution beyond the historical 'by engineers for engineers' emphasis; and",
      "ja": "- RFCシリーズは、進化し続けています。 RSEは、広い視野を持ち、インターネットコミュニティ全体の利益のためにシリーズを進化させる最良の方法を探すことが期待されています。そのため、RSEは、「エンジニアによるエンジニアのための」という歴史的な重点を超えた進化を検討することさえあります。そして"
    },
    {
      "indent": 6,
      "text": "- Its publication-technical environment, by looking at whether it should be slowly changing in terms of publishing and archiving techniques -- particularly to better serve the communities that produce and depend on the RFC Series. For example, all of those communities have been slowly changing to include a significant population of multi-lingual individuals or non-native speakers of English. Another example is that some of these constituencies also have shifted to include significant groups whose primary focus is on the constraints and consequences of network engineering, rather than a primary interest in the engineering issues themselves.",
      "ja": "- 特にRFCシリーズを作成し、それに依存するコミュニティにより良いサービスを提供するために、発行およびアーカイブ技術の観点からゆっくりと変更する必要があるかどうかを見ることで、その発行技術環境。たとえば、これらのコミュニティはすべて、多言語の個人または英語を母国語としない人々のかなりの人口を含むようにゆっくりと変化しています。別の例として、これらの支持者の一部は、エンジニアリングの問題自体への主な関心ではなく、ネットワークエンジニアリングの制約と結果に主に焦点を当てている重要なグループを含めるようにシフトしています。"
    },
    {
      "indent": 3,
      "text": "For this type of responsibility, the RSE cooperates closely with the community, and operates under oversight of the RSOC: thus, ultimately, under oversight of the IAB.",
      "ja": "この種の責任において、RSEはコミュニティと緊密に協力し、RSOCの監督下で、つまり最終的にはIABの監督下で運営されます。"
    },
    {
      "indent": 0,
      "text": "2.1.5. Workload",
      "section_title": true,
      "ja": "2.1.5. ワークロード"
    },
    {
      "indent": 3,
      "text": "On average, the job is expected to take half of a full-time equivalent position (FTE, thus approximately 20 hrs per week), with the workload per week nearing full time during IETF weeks. In addition, the job is expected to take more than 20 hours per week in the first few months of the engagement and when involved in special projects.",
      "ja": "平均して、ジョブはフルタイムの同等の職位（FTE、したがって週あたり約20時間）の半分を占めると予想され、IETFの週の間は週あたりのワークロードがフルタイムに近づきます。さらに、仕事の最初の数か月間、および特別なプロジェクトに関与する場合、仕事は週20時間以上かかると予想されます。"
    },
    {
      "indent": 0,
      "text": "2.1.6. Qualifications",
      "section_title": true,
      "ja": "2.1.6. 資格"
    },
    {
      "indent": 3,
      "text": "The RFC Series Editor is a senior technology professional. The following qualifications are desired:",
      "ja": "RFCシリーズエディタは、上級技術者です。以下の資格が必要です。"
    },
    {
      "indent": 3,
      "text": "1. Strategic leadership and management experience fulfilling the requirements outlined in this document, the many aspects of this role, and the coordination of the overall RFC Editor process.",
      "ja": "1. このドキュメントで概説されている要件、この役割の多くの側面、およびRFCエディタープロセス全体の調整を実現する戦略的リーダーシップと管理経験。"
    },
    {
      "indent": 3,
      "text": "2. Good understanding of the English language and technical terminology related to the Internet.",
      "ja": "2. インターネットに関連する英語と技術用語をよく理解している。"
    },
    {
      "indent": 3,
      "text": "3. Good communication skills.",
      "ja": "3. よいコミュニケーション力。"
    },
    {
      "indent": 3,
      "text": "4. Experience with editorial processes.",
      "ja": "4. 編集プロセスの経験。"
    },
    {
      "indent": 3,
      "text": "5. Ability to develop strong understanding of the IETF and RFC process.",
      "ja": "5. IETFおよびRFCプロセスについての理解を深める能力。"
    },
    {
      "indent": 3,
      "text": "6. Independent worker.",
      "ja": "6. 独立した労働者。"
    },
    {
      "indent": 3,
      "text": "7. Willingness to, and availability for, travel.",
      "ja": "7. 旅行への意欲と利用可能性。"
    },
    {
      "indent": 3,
      "text": "8. The ability to work effectively in a multi-actor and matrixed environment with divided authority and responsibility similar to that described in this document.",
      "ja": "8. このドキュメントで説明されているものと同様の権限と責任が分割された、複数の俳優とマトリックス環境で効果的に機能する能力。"
    },
    {
      "indent": 3,
      "text": "9. Experience with and ability to participate in, and manage, activities by email and teleconferences, not just face-to-face interactions.",
      "ja": "9. 対面でのやり取りだけでなく、メールや電話会議での活動に参加し、管理する経験と能力。"
    },
    {
      "indent": 3,
      "text": "10. Demonstrated experience in strategic planning and the management of entire operations.",
      "ja": "10. 戦略的計画と運用全体の管理における確かな経験"
    },
    {
      "indent": 3,
      "text": "11. Experience as an RFC author.",
      "ja": "11. RFC作成者としての経験。"
    },
    {
      "indent": 0,
      "text": "2.1.7. Conflict of Interest",
      "section_title": true,
      "ja": "2.1.7. 利益相反"
    },
    {
      "indent": 3,
      "text": "The RSE is expected to avoid even the appearance of conflict of interest or judgment in performing these roles. To ensure this, the RSE will be subject to a conflict of interest policy established by the IETF LLC.",
      "ja": "RSEは、これらの役割を実行する際に利益相反や判断の出現さえも回避することが期待されています。これを確実にするために、RSEはIETF LLCによって確立された利益相反ポリシーの対象となります。"
    },
    {
      "indent": 0,
      "text": "2.2. RFC Production Center",
      "section_title": true,
      "ja": "2.2. RFCプロダクションセンター"
    },
    {
      "indent": 3,
      "text": "The RFC Production Center function is performed by a paid contractor, and the contractor's responsibilities include the following:",
      "ja": "RFC Production Center機能は有償の請負業者によって実行され、請負業者の責任には以下が含まれます。"
    },
    {
      "indent": 3,
      "text": "1. Editing inputs from all RFC streams to comply with the RFC Style Manual, under the direction of the RSE;",
      "ja": "1. RSEの指示の下で、RFCスタイルマニュアルに準拠するようにすべてのRFCストリームからの入力を編集する。"
    },
    {
      "indent": 3,
      "text": "2. Creating records of edits performed on documents;",
      "ja": "2. ドキュメントに対して行われた編集の記録を作成する。"
    },
    {
      "indent": 3,
      "text": "3. Identifying where editorial changes might have technical impact and seeking necessary clarification;",
      "ja": "3. 編集上の変更が技術的な影響を与える可能性のある場所を特定し、必要な説明を求めます。"
    },
    {
      "indent": 3,
      "text": "4. Engaging in dialog with authors, document shepherds, IANA, and/ or stream-dependent contacts when clarification is needed;",
      "ja": "4. 明確化が必要な場合は、作者、ドキュメントシェパード、IANA、および/またはストリームに依存する連絡先との対話に参加する。"
    },
    {
      "indent": 3,
      "text": "5. Creating records of dialog with document authors;",
      "ja": "5. 文書作成者との対話の記録を作成する。"
    },
    {
      "indent": 3,
      "text": "6. Requesting advice from the RFC Series Editor as needed;",
      "ja": "6. 必要に応じてRFCシリーズエディターにアドバイスを要求する。"
    },
    {
      "indent": 3,
      "text": "7. Providing suggestions to the RFC Series Editor as needed;",
      "ja": "7. 必要に応じてRFCシリーズエディタに提案を提供します。"
    },
    {
      "indent": 3,
      "text": "8. Providing sufficient resources to support reviews of RFC Publisher performance by the RFC Series Editor and external reviews of the RFC Editor function initiated by the IAB or IETF LLC;",
      "ja": "8. RFCシリーズエディターによるRFCパブリッシャーのパフォーマンスのレビュー、およびIABまたはIETF LLCによって開始されたRFCエディター機能の外部レビューをサポートするのに十分なリソースを提供します。"
    },
    {
      "indent": 3,
      "text": "9. Coordinating with IANA to ensure correct documentation of IANA-performed protocol registry actions;",
      "ja": "9. IANAと調整して、IANAが実行したプロトコルレジストリアクションの正しいドキュメントを保証します。"
    },
    {
      "indent": 3,
      "text": "10. Assigning RFC numbers;",
      "ja": "10. RFC番号の割り当て。"
    },
    {
      "indent": 3,
      "text": "11. Establishing publication readiness of each document through communication with the authors, document shepherds, IANA, and/or stream-dependent contacts, and, if needed, with the RFC Series Editor;",
      "ja": "11. 著者、ドキュメントシェパード、IANA、および/またはストリームに依存する連絡先とのコミュニケーションを通じて、および必要に応じてRFCシリーズエディタを使用して、各ドキュメントの公開準備を確立します。"
    },
    {
      "indent": 3,
      "text": "12. Forwarding documents that are ready for publication to the RFC Publisher;",
      "ja": "12. RFCパブリッシャーに発行する準備ができているドキュメントの転送。"
    },
    {
      "indent": 3,
      "text": "13. Forwarding records of edits and author dialog to the RFC Publisher so these can be preserved;",
      "ja": "13. 編集および作成者ダイアログのレコードをRFCパブリッシャーに転送して、それらを保持できるようにします。"
    },
    {
      "indent": 3,
      "text": "14. Liaising with the streams as needed.",
      "ja": "14. 必要に応じてストリームと連絡を取る。"
    },
    {
      "indent": 3,
      "text": "All these activities will be done under the general direction, but not day-to-day management, of the RSE and need some level of coordination with various submission streams and the RSE.",
      "ja": "これらのすべてのアクティビティは、RSEの一般的な指示の下で行われますが、日常的な管理は行われず、さまざまな送信ストリームおよびRSEとある程度の調整が必要です。"
    },
    {
      "indent": 3,
      "text": "The RFC Production Center contractor is to be selected through an IETF LLC Request for Proposal (RFP) process as described in Section 4.1.",
      "ja": "セクション4.1で説明されているように、RFC Production Centerの請負業者は、IETF LLCのRequest for Proposal（RFP）プロセスを通じて選択されます。"
    },
    {
      "indent": 0,
      "text": "2.3. RFC Publisher",
      "section_title": true,
      "ja": "2.3. RFCパブリッシャー"
    },
    {
      "indent": 3,
      "text": "The RFC Publisher responsibilities include the following:",
      "ja": "RFCパブリッシャーの責任には、以下が含まれます。"
    },
    {
      "indent": 3,
      "text": "1. Announcing and providing on-line access to RFCs.",
      "ja": "1. RFCへのオンラインアクセスを発表および提供します。"
    },
    {
      "indent": 3,
      "text": "2. Providing an on-line system to submit RFC Errata.",
      "ja": "2. RFC Errataを提出するためのオンラインシステムの提供。"
    },
    {
      "indent": 3,
      "text": "3. Providing on-line access to approved RFC Errata.",
      "ja": "3. 承認されたRFCエラッタへのオンラインアクセスを提供します。"
    },
    {
      "indent": 3,
      "text": "4. Providing backups.",
      "ja": "4. バックアップを提供します。"
    },
    {
      "indent": 3,
      "text": "5. Providing storage and preservation of records.",
      "ja": "5. 記録の保存と保存を提供します。"
    },
    {
      "indent": 3,
      "text": "6. Authenticating RFCs for legal proceedings.",
      "ja": "6. 法的手続きのためのRFCの認証。"
    },
    {
      "indent": 3,
      "text": "All these activities will be done under the general direction, but not day-to-day management, of the RSE and need some level of coordination with various submission streams and the RSE.",
      "ja": "これらのすべてのアクティビティは、RSEの一般的な指示の下で行われますが、日常的な管理は行われず、さまざまな送信ストリームおよびRSEとある程度の調整が必要です。"
    },
    {
      "indent": 3,
      "text": "The RFC Publisher contractor is to be selected through an IETF LLC RFP process as described in Section 4.1.",
      "ja": "セクション4.1で説明されているように、RFCパブリッシャー請負業者はIETF LLC RFPプロセスを通じて選択されます。"
    },
    {
      "indent": 0,
      "text": "3. Committees",
      "section_title": true,
      "ja": "3. 委員会"
    },
    {
      "indent": 0,
      "text": "3.1. RFC Series Oversight Committee (RSOC)",
      "section_title": true,
      "ja": "3.1. RFCシリーズ監視委員会（RSOC）"
    },
    {
      "indent": 3,
      "text": "The IAB is responsible for the oversight of the RFC Series and acts as a body for final conflict resolution, including the process described in Section 4.3.",
      "ja": "IABは、RFCシリーズの監視を担当し、セクション4.3で説明されているプロセスを含む、最終的な紛争解決のための機関として機能します。"
    },
    {
      "indent": 3,
      "text": "In order to provide continuity over periods longer than the NomCom appointment cycle [RFC8713] and assure that oversight includes suitable subject matter expertise, the IAB will establish a group that implements oversight for the IAB, the RFC Series Oversight Committee (RSOC).",
      "ja": "NomComのアポイントメントサイクル[RFC8713]よりも長い期間の継続性を提供し、監視に適切な主題の専門知識が含まれるようにするために、IABはIABの監視を実装するグループ、RFCシリーズ監視委員会（RSOC）を設立します。"
    },
    {
      "indent": 3,
      "text": "The RSOC will act with authority delegated from the IAB: in general, it will be the RSOC that will approve consensus policy and vision documents as developed by the RSE in collaboration with the community. While it is expected that the IAB will exercise due diligence in its supervision of the RSOC, the RSOC should be allowed the latitude to do its job without undue interference from the IAB. Therefore, it is expected that the IAB will accord RSOC reports and recommendations the benefit of the doubt.",
      "ja": "RSOCは、IABから委任された権限で行動します。一般的に、RSOCは、コミュニティと協力してRSEによって開発されたコンセンサスポリシーおよびビジョンドキュメントを承認します。 IABがRSOCの監督に十分な注意を払うことが期待されていますが、RSOCはIABからの過度の干渉なしにその仕事をする余裕を許されるべきです。したがって、IABがRSOCのレポートと推奨事項に疑いの利益を与えることが期待されます。"
    },
    {
      "indent": 3,
      "text": "For all decisions that affect the RSE individually (e.g., hiring and firing), the RSOC prepares recommendations for the IAB. The final recommendation to the IETF LLC is the responsibility of the IAB, after discussion with RSOC on the recommendations. For instance the RSOC would do the following:",
      "ja": "RSEに個別に影響するすべての決定（採用や解雇など）について、RSOCはIABの推奨事項を準備します。 IETF LLCへの最後の推奨は、推奨事項についてRSOCと話し合った後のIABの責任です。たとえば、RSOCは次のことを行います。"
    },
    {
      "indent": 3,
      "text": "* perform annual reviews of the RSE and report the result of these reviews to the IAB.",
      "ja": "* RSEの年次レビューを行い、これらのレビューの結果をIABに報告する。"
    },
    {
      "indent": 3,
      "text": "* manage RSE candidate selection and advise the IAB on candidate appointment (in other words, select the RSE subject to IAB approval).",
      "ja": "* RSE候補の選択を管理し、候補者の任命についてIABに助言する（つまり、IAB承認の対象となるRSEを選択する）。"
    },
    {
      "indent": 3,
      "text": "RSOC members are expected to recognize potential conflicts of interest and behave accordingly.",
      "ja": "RSOCメンバーは、潜在的な利益相反を認識し、それに応じて行動することが期待されています。"
    },
    {
      "indent": 3,
      "text": "For the actual recruitment and selection of the RSE, the RSOC will propose a budget for the search process. It will work with the IETF LLC to refine that budget and develop remuneration criteria and an employment agreement or contracting plans, as appropriate.",
      "ja": "RSEの実際の採用と選択のために、RSOCは検索プロセスの予算を提案します。 IETF LLCと協力して予算を調整し、必要に応じて報酬基準と雇用契約または契約計画を策定します。"
    },
    {
      "indent": 3,
      "text": "The RSOC will be responsible for ensuring that the RFC Series is run in a transparent and accountable manner.",
      "ja": "RSOCは、RFCシリーズが透明で責任ある方法で実行されるようにする責任があります。"
    },
    {
      "indent": 3,
      "text": "The RSOC shall develop and publish its own rules of order.",
      "ja": "RSOCは独自の順序規則を作成し、公開するものとします。"
    },
    {
      "indent": 3,
      "text": "The initial RSOC was charged with designing and executing a solicitation, search, and selection process for the first actual (not transitional or \"acting\") RSE appointment. That process involved iteration on this and related documents and evaluation of various strategies and options. During the creation of what became [RFC6635], it was expected that the RSOC would describe the process it ultimately selected to the community. The RSOC did involve the community in interim considerations when that was likely to be of value. Following completion of the selection process, the RSOC will determine the best way to share information learned and experience gained with the community and determine how to best preserve that information for future use.",
      "ja": "最初のRSOCは、最初の実際の（暫定的または「代理」ではない）RSE予約の要請、検索、および選択プロセスの設計と実行を担当していました。そのプロセスには、このドキュメントと関連ドキュメントの反復、およびさまざまな戦略とオプションの評価が含まれていました。 [RFC6635]となるものの作成中に、RSOCが最終的に選択したプロセスをコミュニティに説明することが期待されていました。 RSOCは、価値があると思われる暫定的な検討にコミュニティを関与させました。選択プロセスの完了後、RSOCは、コミュニティで学んだ情報や経験を共有するための最良の方法を決定し、その情報を将来使用するために最適に保存する方法を決定します。"
    },
    {
      "indent": 0,
      "text": "3.1.1. RSOC Composition",
      "section_title": true,
      "ja": "3.1.1. RSOCの構成"
    },
    {
      "indent": 3,
      "text": "The RSOC will operate under the authority of the IAB, with the IAB retaining final responsibility. The IAB will delegate authority and responsibility to the RSOC as appropriate and as RSOC and RSE relationships evolve. The RSOC will include people who are not current IAB members. Currently, this is aligned with the IAB program structure. The IAB will designate the membership of the RSOC with the following goals: preserving effective stability; keeping it small enough to be effective, and keeping it large enough to provide general Internet community expertise, specific IETF expertise, publication expertise, and stream expertise. Members serve at the pleasure of the IAB and are expected to bring a balance between short- and long-term perspectives. Specific input about, and recommendations of, members will be sought from the streams, the IETF LLC, and the RSE.",
      "ja": "RSOCはIABの権限の下で運営され、IABは最終的な責任を負います。 IABは、必要に応じて、またRSOCとRSEの関係が発展するにつれて、権限と責任をRSOCに委任します。 RSOCには、現在のIABメンバーではない人々が含まれます。現在、これはIABプログラム構造と整合しています。 IABは、次の目標でRSOCのメンバーシップを指定します。効果的な安定性の維持。効果を発揮するのに十分小さく、一般的なインターネットコミュニティの専門知識、特定のIETF専門知識、出版の専門知識、およびストリームの専門知識を提供するのに十分な大きさを維持します。メンバーはIABの喜びに奉仕し、短期的および長期的展望のバランスをもたらすことが期待されています。メンバーに関する具体的なインプットと推奨事項は、ストリーム、IETF LLC、およびRSEから求められます。"
    },
    {
      "indent": 3,
      "text": "In addition to the members from outside of the IAB appointed to the RSOC, IAB members may participate as full members of the RSOC. Under most circumstances, there will be a specific individual IAB member appointed by the IAB as the program lead, who will be a full member of the RSOC. This member's role is distinct from any RSOC-internal organizational roles, such as would be created by the RSOC choosing to appoint a chair from among its members. Other IAB members may choose to be full members of the RSOC, with the consent of the IAB. This consent is primarily concerned with avoiding overpopulating the RSOC and providing it with relatively stable membership, which will work best if it is not too large a committee.",
      "ja": "RSOCに任命されたIAB外のメンバーに加えて、IABメンバーはRSOCのフルメンバーとして参加できます。ほとんどの状況下では、プログラムリーダーとしてIABによって任命された特定の個々のIABメンバーが存在し、RSOCの完全なメンバーになります。このメンバーの役割は、RSOCがメンバーの中から議長を指名することを選択することによって作成されるような、RSOC内部の組織の役割とは異なります。他のIABメンバーは、IABの同意を得て、RSOCのフルメンバーになることを選択できます。この同意は主に、RSOCの過密化の回避と比較的安定したメンバーシップの提供に関係しています。これは、委員会が大きすぎない場合に最も効果的です。"
    },
    {
      "indent": 3,
      "text": "The IETF LLC will appoint an individual to serve as its liaison to the RSOC. The RSE and the IETF LLC Liaison will serve as non-voting ex officio members of the RSOC. Either or both can be excluded from its discussions if necessary.",
      "ja": "IETF LLCは、RSOCとの連絡係となる個人を任命します。 RSEおよびIETF LLCリエゾンは、RSOCの投票権のない職権上のメンバーとして機能します。必要に応じて、どちらかまたは両方をディスカッションから除外できます。"
    },
    {
      "indent": 0,
      "text": "4. Administrative Implementation",
      "section_title": true,
      "ja": "4. 管理の実装"
    },
    {
      "indent": 3,
      "text": "The exact implementation of the administrative and contractual activities described here are a responsibility of the IETF Administration Limited Liability Company [RFC8711] in cooperation with the RFC Series Editor. The authority structure is described in Figure 2.",
      "ja": "ここで説明する管理および契約活動の正確な実装は、RFCシリーズエディターと協力してIETF Administration Limited Liability Company [RFC8711]が責任を負います。権限構造を図2に示します。"
    },
    {
      "indent": 15,
      "text": "    +----------------+       +----------------+\n    |                |       |                |\n    |      IAB       |       |    IETF LLC    |\n    |                |       |                |\n    +==========+-----+       +-+--------------+\n    |          |               .\n    |   RSOC   |               .\n    |          |               .\n    +----+-----+               .\n         |                     .\n         |                     .\n         |   ...................\n         |   .                 .\n+--------V---V----+            .\n|                 |            .\n|       RFC       |            .\n|      Series     |            .\n|      Editor     |            .\n|                 |            .\n+--------+--------+            .\n         |                     .\n         |        .................\n         |        .               .\n         +--+----------------+    .\n            |     .          |    .\n            |     .          |    .\n        +---V-----V--+    +--V----V---+\n        |    RFC     |    |    RFC    |\n        | Production |    | Publisher |\n        |   Center   |    |           |\n        +------------+    +-----------+",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 25,
      "text": "Legend:",
      "ja": "伝説："
    },
    {
      "indent": 25,
      "text": "-------    IAB RFC Series Oversight\n.......    IETF LLC Contract/Budget Oversight",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 14,
      "text": "Figure 2: Authority Structure of the RFC Series",
      "ja": "図2：RFCシリーズの機関構造"
    },
    {
      "indent": 0,
      "text": "4.1. Vendor Selection for the Production and Publisher Functions",
      "section_title": true,
      "ja": "4.1. プロダクションおよびパブリッシャー機能のベンダー選択"
    },
    {
      "indent": 3,
      "text": "As stated earlier, vendor selection is done in cooperation with the streams and under the final authority of the IETF LLC.",
      "ja": "前述のように、ベンダーの選択は、ストリームと協力して、IETF LLCの最終的な権限の下で行われます。"
    },
    {
      "indent": 3,
      "text": "The RSE owns and develops the work definition (the SOW) and participates in the IETF LLC vendor selection process. The work definition is created within the IETF LLC budget and takes into account the stream managers and community input.",
      "ja": "RSEは作業定義（SOW）を所有および開発し、IETF LLCベンダー選択プロセスに参加します。作業定義はIETF LLCの予算内で作成され、ストリーム管理者とコミュニティの意見を考慮に入れます。"
    },
    {
      "indent": 3,
      "text": "The process to select and contract for an RFC Production Center, RFC Publisher, and other RFC-related services, is as follows:",
      "ja": "RFC Production Center、RFC Publisher、およびその他のRFC関連サービスを選択して契約するプロセスは、次のとおりです。"
    },
    {
      "indent": 3,
      "text": "* The IETF LLC establishes the contract process, including the steps necessary to issue an RFP when necessary, the timing, and the contracting procedures.",
      "ja": "* IETF LLCは、必要に応じてRFPを発行するために必要な手順、タイミング、および契約手続きを含む契約プロセスを確立します。"
    },
    {
      "indent": 3,
      "text": "* The IETF LLC establishes the Selection Committee, which will consist of the RSE, the IETF LLC Executive Director, and other members selected by the RSOC and the IETF LLC. The Committee shall be chaired by the RSE.",
      "ja": "* IETF LLCは、RSE、IETF LLC Executive Director、およびRSOCとIETF LLCによって選択された他のメンバーで構成される選択委員会を設立します。委員会はRSEが議長を務める。"
    },
    {
      "indent": 3,
      "text": "* The Selection Committee selects the vendor, subject to the successful negotiation of a contract approved by the IETF LLC. In the event that a contract cannot be reached, the matter shall be referred to the Selection Committee for further action.",
      "ja": "* 選択委員会は、IETF LLCによって承認された契約の交渉の成功を条件として、ベンダーを選択します。契約が成立しない場合は、選考委員会に付託して対応を求めます。"
    },
    {
      "indent": 3,
      "text": "* The Selection Committee may select an RFC Publisher either through the IETF LLC RFP process or, at the Committee's option, the Committee may select the IETF Secretariat to provide RFC Publisher services, subject to negotiations in accordance with the IETF LLC procedures.",
      "ja": "* 選択委員会は、IETF LLC RFPプロセスを通じて、または委員会のオプションでIETF事務局を選択して、IETF LLC手順に従って交渉の対象となるRFCパブリッシャーサービスを提供することにより、RFCパブリッシャーを選択できます。"
    },
    {
      "indent": 0,
      "text": "4.2. Budget",
      "section_title": true,
      "ja": "4.2. 予算"
    },
    {
      "indent": 3,
      "text": "The expenses discussed in this document are not new expenses. They have been and remain part of the IETF Administration Limited Liability Company [RFC8711] budget.",
      "ja": "このドキュメントで説明されている経費は新しい経費ではありません。それらは、IETF Administration Limited Liability Company [RFC8711]の予算の一部であり、その一部です。"
    },
    {
      "indent": 3,
      "text": "The RFC Series portion of the IETF LLC budget shall include funding to support the RSE, RFC Production Center, RFC Publisher, and the Independent Stream.",
      "ja": "IETF LLC予算のRFCシリーズ部分には、RSE、RFC Production Center、RFC Publisher、およびIndependent Streamをサポートするための資金が含まれます。"
    },
    {
      "indent": 3,
      "text": "The IETF LLC has the responsibility to approve the total RFC Editor budget (and the authority to deny it). The RSE must work within the IETF LLC budgetary process.",
      "ja": "IETF LLCは、RFC編集者の予算全体（およびそれを拒否する権限）を承認する責任があります。 RSEはIETF LLCの予算プロセス内で機能する必要があります。"
    },
    {
      "indent": 3,
      "text": "The RSE is responsible for managing the RFC Editor function to operate within those budgets. If production needs change, the RSE is responsible for working with the Production Center, and where appropriate, other RFC Editor component institutions, relevant streams, and/or the RSOC to determine what the correct response should be. If they agree that a budgetary change is needed, that decision needs to be taken to the IETF LLC.",
      "ja": "RSEは、RFCエディター機能を管理して、それらの予算内で運用する責任があります。プロダクションの変更が必要な場合、RSEはプロダクションセンターと連携し、必要に応じて、他のRFCエディターコンポーネント機関、関連ストリーム、RSOCと連携して正しい応答を決定します。彼らが予算の変更が必要であることに同意した場合、その決定はIETF LLCに行われる必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3. Disagreements among Entities Related to the RFC Editor",
      "section_title": true,
      "ja": "4.3. RFCエディタに関連するエンティティ間の不一致"
    },
    {
      "indent": 3,
      "text": "The RFC Series Editor and the RFC Production Center and Publisher facilities work with the various streams to produce RFCs. Disagreements may arise between these entities during the execution of the RFC Editor operations. In particular, different streams may disagree with each other, or disagree with the RFC Editor function. Potentially, even the RSOC or the IETF LLC could find themselves in disagreement with some aspect of the RFC Editor operations. Note that disagreements between an author and the RFC Production Center are not cross-entity issues, and they are to be resolved by the RSE, in accordance with the rest of this document.",
      "ja": "RFCシリーズエディタ、RFC Production Center、およびPublisherの機能は、さまざまなストリームと連携してRFCを作成します。 RFCエディタ操作の実行中に、これらのエンティティ間で不一致が発生する場合があります。特に、異なるストリームは互いに同意しない場合や、RFCエディター機能に同意しない場合があります。場合によっては、RSOCやIETF LLCでさえ、RFCエディタの操作の一部の側面に不満を感じる可能性があります。著者とRFC Production Centerの間の不一致は、エンティティ間の問題ではなく、このドキュメントの残りの部分に従って、RSEによって解決されることに注意してください。"
    },
    {
      "indent": 3,
      "text": "If such cross-entity disagreements arise, the community would generally hope that they can be resolved politely and directly. However, this is not always possible. At that point, any relevant party would first formally request a review and reconsideration of the decision. If the party still disagrees after the reconsideration, that party may ask the RSE to decide or, especially if the RSE is involved, the party may ask the IAB Chair (for a technical or procedural matter) to mediate or appoint a mediator to aid in the discussions, although he or she not is obligated to do so. All parties should work informally and in good faith to reach a mutually agreeable conclusion. As noted below, any such issues that involve contractual matters must be brought to the attention of the IETF LLC. If the IAB Chair is asked to assist in resolving the matter, the Chair may ask for advice or seek assistance from anyone the Chair deems helpful. The Chair may also alert any appropriate individuals or organizations to the existence of the issue.",
      "ja": "このようなエンティティ間の不一致が発生した場合、コミュニティは一般に、それらが丁寧かつ直接解決されることを望みます。ただし、これは常に可能であるとは限りません。その時点で、すべての関連当事者は最初に正式に決定のレビューと再検討を要求します。再検討後も当事者が同意しない場合、その当事者はRSEに決定を求めることができます。または、特にRSEが関与している場合、当事者はIAB議長に（技術的または手続き上の問題について）メディエーターを仲介または指名するよう要請することができます。彼または彼女はそうする義務を負いませんが、議論。すべての当事者は、互いに同意できる結論に達するために、非公式かつ誠実に行動する必要があります。下記のように、契約上の問題を含むそのような問題は、IETF LLCの注意を引く必要があります。 IABの議長が問題の解決を支援するように求められた場合、議長はアドバイスを求めたり、議長が役に立ったとみなした人に支援を求めたりすることができます。議長は、問題の存在について適切な個人または組織に警告することもできます。"
    },
    {
      "indent": 3,
      "text": "If such a conclusion is not possible through the above less formal processes, then the matter must be registered with the RFC Series Oversight Committee. The RSOC may choose to offer advice to the RSE or more general advice to the parties involved and may ask the RSE to defer a decision until it formulates its advice. However, if a timely decision cannot be reached through discussion, mediation, and mutual agreement, the RSE is expected to make whatever decisions are needed to ensure the smooth operation of the RFC Editor function; those decisions are final.",
      "ja": "上記のあまり正式ではないプロセスでそのような結論が不可能な場合は、問題をRFCシリーズ監視委員会に登録する必要があります。 RSOCは、RSEへのアドバイスまたは関係者へのより一般的なアドバイスを提供することを選択し、RSEがアドバイスを策定するまで決定を延期するように要求する場合があります。ただし、ディスカッション、調停、相互の合意を通じてタイムリーな決定に到達できない場合、RSEはRFCエディター機能の円滑な運用を確保するために必要なあらゆる決定を行うことが期待されます。これらの決定は最終的なものです。"
    },
    {
      "indent": 3,
      "text": "The RSE may make final decisions unilaterally only to assure the functioning of the process, and only while there is an evaluation of current policies to determine whether they are appropriately implemented in the decision or need adjustment. In particular, it should be noted that final decisions about the technical content of individual documents are the exclusive responsibility of the stream approvers from which those documents originate, as shown in the illustration in Figure 1.",
      "ja": "RSEは、プロセスの機能を保証するためにのみ、また現在のポリシーが評価で適切に実施されているか、調整が必要かを判断するために、一方的に最終決定を下す場合があります。特に、図1の図に示すように、個々のドキュメントの技術的な内容に関する最終決定は、それらのドキュメントの作成元であるストリーム承認者が独占的に担当することに注意してください。"
    },
    {
      "indent": 3,
      "text": "If informal agreements cannot be reached, then formal RSOC review and decision making may be required. If so, the RSE must present the issues involved to the community so that the community is aware of the situation. The RSE will then report the issue to the RSOC for formal resolution by the RSOC with confirmation by the IAB in its oversight capacity.",
      "ja": "非公式の合意に到達できない場合は、正式なRSOCレビューと意思決定が必要になる場合があります。もしそうなら、RSEは、コミュニティが問題を提示して、コミュニティが状況を認識できるようにする必要があります。次に、RSEは、RSOCによる正式な解決のためにRSOCに問題を報告し、監督能力のIABによる確認を行います。"
    },
    {
      "indent": 3,
      "text": "IAB and community discussion of any patterns of disputes are expected to inform future changes to RFC Series policies, including possible updates to this document.",
      "ja": "紛争のパターンに関するIABとコミュニティの議論は、このドキュメントの更新の可能性を含め、RFCシリーズポリシーの将来の変更を通知することが期待されています。"
    },
    {
      "indent": 0,
      "text": "4.4. Issues with Contractual Impact",
      "section_title": true,
      "ja": "4.4. 契約上の影響に関する問題"
    },
    {
      "indent": 3,
      "text": "If a disagreement or decision has immediate or future contractual consequences, it falls under [RFC8711]. If this happens, the RSE must identify the issue and provide advice to the IETF LLC. Additionally, if the RSOC has also developed advice, it should forward that advice to the IETF LLC.",
      "ja": "不一致または決定が即時または将来の契約上の結果をもたらす場合、それは[RFC8711]に該当します。これが発生した場合、RSEは問題を特定し、IETF LLCにアドバイスを提供する必要があります。さらに、RSOCもアドバイスを作成している場合は、そのアドバイスをIETF LLCに転送する必要があります。"
    },
    {
      "indent": 3,
      "text": "The IETF LLC must notify the RSOC and IAB regarding the action it concludes is required to resolve the issue based on its applicable procedures and provisions in the relevant contracts.",
      "ja": "IETF LLCは、関連する契約の該当する手順と条項に基づいて問題を解決するために必要であると結論付けたアクションについて、RSOCとIABに通知する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines several functions within the overall RFC Editor structure, and it places the responsibility for coordination of registry value assignments with the RFC Production Center. The IETF LLC will facilitate the establishment of the relationship between the RFC Production Center and IANA.",
      "ja": "このドキュメントでは、RFCエディター構造全体のいくつかの機能を定義し、RFC Production Centerとレジストリ値の割り当てを調整する責任を負っています。 IETF LLCは、RFC Production CenterとIANAの間の関係の確立を促進します。"
    },
    {
      "indent": 3,
      "text": "This document does not create a new registry nor does it register any values in existing registries, and no IANA action is required.",
      "ja": "このドキュメントでは、新しいレジストリを作成したり、既存のレジストリに値を登録したりすることはなく、IANAによるアクションは必要ありません。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The same security considerations as those in [RFC8729] apply. The processes for the publication of documents must prevent the introduction of unapproved changes. Since the RFC Editor maintains the index of publications, sufficient security must be in place to prevent these published documents from being changed by external parties. The archive of RFC documents, any source documents needed to recreate the RFC documents, and any associated original documents (such as lists of errata, tools, and, for some early items, originals that are not machine readable) need to be secured against any kind of data storage failure.",
      "ja": "[RFC8729]と同じセキュリティ上の考慮事項が適用されます。文書の公開プロセスでは、未承認の変更の導入を防止する必要があります。 RFCエディタは出版物の索引を維持するので、これらの出版された文書が外部の関係者によって変更されるのを防ぐために十分なセキュリティを配備する必要があります。 RFCドキュメントのアーカイブ、RFCドキュメントを再作成するために必要なすべてのソースドキュメント、および関連するすべてのオリジナルドキュメント（正誤表、ツール、および一部の初期のアイテムでは、機械可読でないオリジナルなど）は、一種のデータストレージ障害。"
    },
    {
      "indent": 3,
      "text": "The IETF LLC should take these security considerations into account during the implementation and enforcement of the RFC Editor component contracts.",
      "ja": "IETF LLCは、RFC Editorコンポーネントコントラクトの実装および施行時に、これらのセキュリティに関する考慮事項を考慮に入れます。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2850] Internet Architecture Board and B. Carpenter, Ed., \"Charter of the Internet Architecture Board (IAB)\", BCP 39, RFC 2850, DOI 10.17487/RFC2850, May 2000, <https://www.rfc-editor.org/info/rfc2850>.",
      "ja": "[RFC2850]インターネットアーキテクチャボードおよびB.カーペンター編、「インターネットアーキテクチャボード（IAB）のチャーター」、BCP 39、RFC 2850、DOI 10.17487 / RFC2850、2000年5月、<https：//www.rfc-editor .org / info / rfc2850>。"
    },
    {
      "indent": 3,
      "text": "[RFC6635] Kolkman, O., Ed., Halpern, J., Ed., and IAB, \"RFC Editor Model (Version 2)\", RFC 6635, DOI 10.17487/RFC6635, June 2012, <https://www.rfc-editor.org/info/rfc6635>.",
      "ja": "[RFC6635] Kolkman、O。、編、Halpern、J。、編、IAB、「RFC Editor Model（Version 2）」、RFC 6635、DOI 10.17487 / RFC6635、2012年6月、<https：// www。 rfc-editor.org/info/rfc6635>。"
    },
    {
      "indent": 3,
      "text": "[RFC8711] Haberman, B., Hall, J., and J. Livingood, \"Structure of the IETF Administrative Support Activity, Version 2.0\", BCP 101, RFC 8711, DOI 10.17487/RFC8711, February 2020, <https://www.rfc-editor.org/info/rfc8711>.",
      "ja": "[RFC8711]ハーバーマン、B。、ホール、J。、およびJ.リビングウッド、「IETF管理サポート活動の構造、バージョン2.0」、BCP 101、RFC 8711、DOI 10.17487 / RFC8711、2020年2月、<https：// www.rfc-editor.org/info/rfc8711>。"
    },
    {
      "indent": 3,
      "text": "[RFC8729] Housley, R., Ed. and L. Daigle, Ed., \"The RFC Series and RFC Editor\", RFC 8729, DOI 10.17487/RFC8729, February 2020, <https://www.rfc-editor.org/info/rfc8729>.",
      "ja": "[RFC8729] Housley、R.、Ed。およびL.ダイグル編、「The RFC Series and RFC Editor」、RFC 8729、DOI 10.17487 / RFC8729、2020年2月、<https://www.rfc-editor.org/info/rfc8729>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC5620] Kolkman, O., Ed. and IAB, \"RFC Editor Model (Version 1)\", RFC 5620, DOI 10.17487/RFC5620, August 2009, <https://www.rfc-editor.org/info/rfc5620>.",
      "ja": "[RFC5620]コルクマン、O。、エド。 IAB、「RFC Editor Model（Version 1）」、RFC 5620、DOI 10.17487 / RFC5620、2009年8月、<https://www.rfc-editor.org/info/rfc5620>。"
    },
    {
      "indent": 3,
      "text": "[RFC8713] Kucherawy, M., Ed., Hinden, R., Ed., and J. Livingood, Ed., \"IAB, IESG, IETF Trust, and IETF LLC Selection, Confirmation, and Recall Process: Operation of the IETF Nominating and Recall Committees\", BCP 10, RFC 8713, DOI 10.17487/RFC8713, February 2020, <https://www.rfc-editor.org/info/rfc8713>.",
      "ja": "[RFC8713] Kucherawy、M.、Ed。、Hinden、R.、Ed。、and J. Livingood、Ed。、 \"IAB、IESG、IETF Trust、and IETF LLC Selection、Confirmation、and Recall Process：Operation of the IETF指名委員会とリコール委員会」、BCP 10、RFC 8713、DOI 10.17487 / RFC8713、2020年2月、<https://www.rfc-editor.org/info/rfc8713>。"
    },
    {
      "indent": 0,
      "text": "IAB Members at the Time of Approval",
      "ja": "承認時のIABメンバー"
    },
    {
      "indent": 3,
      "text": "Internet Architecture Board Members at the time this document was approved for publication were:",
      "ja": "このドキュメントの公開が承認された時点のインターネットアーキテクチャボードメンバーは次のとおりです。"
    },
    {
      "indent": 6,
      "text": "Jari Arkko Alissa Cooper Stephen Farrell Wes Hardaker Ted Hardie Christian Huitema Zhenbin Li Erik Nordmark Mark Nottingham Melinda Shore Jeff Tantsura Martin Thomson Brian Trammell",
      "ja": "ジャリアルコアリッサクーパースティーブンファレルウェスハーダーカーテッドハーディークリスチャンウイテマジェンビンリーエリックノードマークマークノッティンガムメリンダショアジェフタンツラマーティントムソンブライアントラメル"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The RFC Editor model was conceived and discussed in hallways and on mailing lists. The first iteration of the text on which this document is based was first written by Leslie Daigle, Russ Housley, and Ray Pelletier. In addition to the members of the IAOC and IAB in conjunction with those roles, major and minor contributions were made by (in alphabetical order): Bob Braden, Brian Carpenter, Sandy Ginoza, Joel M. Halpern, Alfred Hoenes, Paul Hoffman, John Klensin, Subramanian Moonesamy, Alice Russo, and Jim Schaad.",
      "ja": "RFC Editorモデルは、廊下やメーリングリストで構想され、議論されました。このドキュメントの基礎となるテキストの最初の反復は、レスリーデイグル、ラスハウズリー、およびレイペレティエによって最初に書かれました。 IAOCとIABのメンバーに加えて、これらの役割に加えて、ボブブレーデン、ブライアンカーペンター、サンディジーノザ、ジョエルM.ハルパーン、アルフレッドホーネス、ポールホフマン、ジョンによる大小の寄稿が行われました。クレンシン、サブラマニアンムーネサミー、アリスルッソ、ジムシャード。"
    },
    {
      "indent": 3,
      "text": "The IAOC members at the time RFC 6635 was approved were (in alphabetical order): Bernard Aboba (ex officio), Eric Burger, Dave Crocker, Marshall Eubanks, Bob Hinden, Russ Housley (ex officio), Ole Jacobsen, Ray Pelletier (non-voting), and Lynn St. Amour (ex officio).",
      "ja": "RFC 6635が承認されたときのIAOCメンバーは次のとおりです（アルファベット順）：バーナードアボバ（職権）、エリックバーガー、デイブクロッカー、マーシャルユーバンクス、ボブヒンデン、ラスハウズリー（職権）、オレヤコブセン、レイペルティエ（非職権） -投票）、およびLynn St. Amour（職権外）。"
    },
    {
      "indent": 3,
      "text": "The IAB members at the time the initial RFC Editor model (Version 1, RFC 5620) was approved were (in alphabetical order): Loa Andersson, Gonzalo Camarillo, Stuart Cheshire, Russ Housley, Olaf Kolkman, Gregory Lebovitz, Barry Leiba, Kurtis Lindqvist, Andrew Malis, Danny McPherson, David Oran, Dave Thaler, and Lixia Zhang. In addition, the IAB included two ex officio members: Dow Street, who was serving as the IAB Executive Director, and Aaron Falk, who was serving as the IRTF Chair.",
      "ja": "最初のRFCエディターモデル（バージョン1、RFC 5620）が承認されたときのIABメンバーは次のとおりです（アルファベット順）：ロアアンダーソン、ゴンサロカマリロ、スチュアートチェシャー、ラスハウズリー、オラフコルクマン、グレゴリーレボビッツ、バリーレイバ、カーティスリンドクヴィスト、Andrew Malis、Danny McPherson、David Oran、Dave Thaler、Lixia Zhang。さらに、IABには2人の職権上のメンバーが含まれていました。IABエグゼクティブディレクターを務めていたダウストリートと、IRTFチェアを務めていたアーロンフォークです。"
    },
    {
      "indent": 3,
      "text": "The IAB members at the time RFC 6635 was approved were (in alphabetical order): Bernard Aboba, Ross Callon, Alissa Cooper, Spencer Dawkins, Joel Halpern, Russ Housley, David Kessens, Olaf Kolkman, Danny McPherson, Jon Peterson, Andrei Robachevsky, Dave Thaler, and Hannes Tschofenig. In addition, at the time of approval of RFC 6635, the IAB included two ex officio members: Mary Barnes who was serving as the IAB Executive Director, and Lars Eggert, who was serving as the IRTF Chair.",
      "ja": "RFC 6635が承認されたときのIABメンバーは（アルファベット順）：バーナードアボバ、ロスカロン、アリッサクーパー、スペンサードーキンス、ジョエルハルパーン、ラスハウズリー、デビッドケセン、オラフコルクマン、ダニーマクファーソン、ジョンピーターソン、アンドレイロバチェフスキー、デイブ・ターラー、そしてハネス・ツコフェニグ。さらに、RFC 6635の承認時に、IABには2つの職権上のメンバーが含まれていました。IABエグゼクティブディレクターを務めていたMary Barnesと、IRTFチェアを務めていたLars Eggertです。"
    },
    {
      "indent": 3,
      "text": "Bob Hinden served as document editor for this RFC to align it with the IASA 2.0 structure.",
      "ja": "Bob Hindenは、このRFCをIASA 2.0の構造に合わせるために、このRFCのドキュメントエディターを務めました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Olaf Kolkman (editor) Internet Society",
      "ja": "オラフ・コルクマン（編集者）インターネット協会"
    },
    {
      "indent": 3,
      "text": "Email: kolkman@isoc.org",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Joel M. Halpern (editor) Ericsson",
      "ja": "ジョエル・M・ハルパーン（編者）エリクソン"
    },
    {
      "indent": 3,
      "text": "Email: joel.halpern@ericsson.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Robert M. Hinden (editor) Check Point Software 959 Skyway Road San Carlos, CA 94070 United States of America",
      "ja": "Robert M. Hinden（編集者）Check Point Software 959 Skyway Road San Carlos、CA 94070アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: bob.hinden@gmail.com",
      "raw": true,
      "ja": ""
    }
  ]
}