{
  "title": {
    "text": "RFC 8313 - Use of Multicast across Inter-domain Peering Points",
    "ja": "RFC 8313 - ドメイン間のピアリングポイント間でのマルチキャストの使用"
  },
  "number": 8313,
  "created_at": "2019-10-30 01:46:47.020468+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                  P. Tarapore, Ed.\nRequest for Comments: 8313                                      R. Sayko\nBCP: 213                                                            AT&T\nCategory: Best Current Practice                              G. Shepherd\nISSN: 2070-1721                                                    Cisco\n                                                          T. Eckert, Ed.\n                                                                  Huawei\n                                                             R. Krishnan\n                                                          SupportVectors\n                                                            January 2018",
      "raw": true
    },
    {
      "indent": 10,
      "text": "Use of Multicast across Inter-domain Peering Points",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document examines the use of Source-Specific Multicast (SSM) across inter-domain peering points for a specified set of deployment scenarios. The objectives are to (1) describe the setup process for multicast-based delivery across administrative domains for these scenarios and (2) document supporting functionality to enable this process.",
      "ja": "この文書では、配備シナリオの指定されたセットのためのドメイン間ピアリングポイントでソース固有マルチキャスト（SSM）の使用を検討します。 （1）マルチキャストベースこれらのシナリオの管理ドメイン間で配信し、このプロセスを有効にする機能をサポート（2）文書のためのセットアップ処理を説明するために目的があります。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This memo documents an Internet Best Current Practice.",
      "ja": "このメモはインターネット最も良い現在の練習を説明します。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on BCPs is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 BCPの詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8313.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttps://www.rfc-editor.org/info/rfc8313で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2018 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2018 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（https://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction ....................................................4\n2. Overview of Inter-domain Multicast Application Transport ........6\n3. Inter-domain Peering Point Requirements for Multicast ...........7\n   3.1. Native Multicast ...........................................8\n   3.2. Peering Point Enabled with GRE Tunnel .....................10\n   3.3. Peering Point Enabled with AMT - Both Domains\n        Multicast Enabled .........................................12\n   3.4. Peering Point Enabled with AMT - AD-2 Not\n        Multicast Enabled .........................................14\n   3.5. AD-2 Not Multicast Enabled - Multiple AMT Tunnels\n        through AD-2 ..............................................16\n4. Functional Guidelines ..........................................18\n   4.1. Network Interconnection Transport Guidelines ..............18\n        4.1.1. Bandwidth Management ...............................19\n   4.2. Routing Aspects and Related Guidelines ....................20\n        4.2.1. Native Multicast Routing Aspects ...................21\n        4.2.2. GRE Tunnel over Interconnecting Peering Point ......22\n        4.2.3. Routing Aspects with AMT Tunnels ...................22\n        4.2.4. Public Peering Routing Aspects .....................24\n   4.3. Back-Office Functions - Provisioning and Logging\n        Guidelines ................................................26\n        4.3.1. Provisioning Guidelines ............................26\n        4.3.2. Inter-domain Authentication Guidelines .............28\n        4.3.3. Log-Management Guidelines ..........................28\n   4.4. Operations - Service Performance and Monitoring\n        Guidelines ................................................30\n   4.5. Client Reliability Models / Service Assurance Guidelines ..32\n   4.6. Application Accounting Guidelines .........................32\n5. Troubleshooting and Diagnostics ................................32\n6. Security Considerations ........................................33\n   6.1. DoS Attacks (against State and Bandwidth) .................33\n   6.2. Content Security ..........................................35\n   6.3. Peering Encryption ........................................37\n   6.4. Operational Aspects .......................................37\n7. Privacy Considerations .........................................39\n8. IANA Considerations ............................................40\n9. References .....................................................40\n   9.1. Normative References ......................................40\n   9.2. Informative References ....................................42\nAcknowledgments ...................................................43\nAuthors' Addresses ................................................44",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Content and data from several types of applications (e.g., live video streaming, software downloads) are well suited for delivery via multicast means. The use of multicast for delivering such content or other data offers significant savings in terms of utilization of resources in any given administrative domain. End User (EU) demand for such content or other data is growing. Often, this requires transporting the content or other data across administrative domains via inter-domain peering points.",
      "ja": "アプリケーション（例えば、ライブビデオストリーミング、ソフトウェアのダウンロード）のいくつかのタイプからコンテンツおよびデータは、マルチキャスト手段を介して配信するのに適しています。このようなコンテンツやその他のデータを配信するためのマルチキャストの使用は、任意の管理ドメイン内のリソースの活用の面で大幅な節約を提供しています。このようなコンテンツや他のデータのためのエンドユーザー（EU）の需要が高まっています。多くの場合、これは、ドメイン間のピアリング・ポイントを経由して管理ドメイン全体のコンテンツやその他のデータを転送する必要があり。"
    },
    {
      "indent": 3,
      "text": "The objectives of this document are twofold:",
      "ja": "このドキュメントの目的は2つあります："
    },
    {
      "indent": 3,
      "text": "o Describe the technical process and establish guidelines for setting up multicast-based delivery of application content or other data across inter-domain peering points via a set of use cases (where \"Use Case 3.1\" corresponds to Section 3.1, \"Use Case 3.2\" corresponds to Section 3.2, etc.).",
      "ja": "O技術的なプロセスを説明し、「ユースケース3.1」のセクション3.1に、「ユースケース3.2」に対応するユースケースのセット（を介してドメイン間のピアリング・ポイント間でのアプリケーションのコンテンツまたはその他のデータのマルチキャストベースの配信を設定するためのガイドラインを確立3.2節など）に対応しています。"
    },
    {
      "indent": 3,
      "text": "o Catalog all required exchanges of information between the administrative domains to support multicast-based delivery. This enables operators to initiate necessary processes to support inter-domain peering with multicast.",
      "ja": "Oマルチキャストベースの配信をサポートするために、管理ドメイン間での情報のすべての必要な交換をカタログ。これは、ドメイン間のマルチキャストピアリングをサポートするために必要なプロセスを開始するために、オペレータを可能にします。"
    },
    {
      "indent": 3,
      "text": "The scope and assumptions for this document are as follows:",
      "ja": "次のようにこの文書の範囲および仮定は以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Administrative Domain 1 (AD-1) sources content to one or more EUs in one or more Administrative Domain 2 (AD-2) entities. AD-1 and AD-2 want to use IP multicast to allow support for large and growing EU populations, with a minimum amount of duplicated traffic to send across network links.",
      "ja": "O管理ドメイン1（AD-1）は、1つ以上の管理ドメイン内の1つのまたは複数のEU 2（AD-2）エンティティにコンテンツソース。 AD-1、AD-2は、ネットワークリンクを介して送信するために、重複したトラフィックの最小量で、大規模で成長しているEUの人口のためのサポートを可能にするために、IPマルチキャストを使用します。"
    },
    {
      "indent": 6,
      "text": "* This document does not detail the case where EUs are originating content. To support that additional service, it is recommended that some method (outside the scope of this document) be used by which the content from EUs is transmitted to the application in AD-1 and AD-1 can send out the traffic as IP multicast. From that point on, the descriptions in this document apply, except that they are not complete because they do not cover the transport or operational aspects of the leg from the EU to AD-1.",
      "ja": "*このドキュメントでは、EU群は、コンテンツを発信している場合ではないディテールありません。その付加サービスをサポートするために、それのEUからのコンテンツをAD-1、AD-1のアプリケーションに送信される（この文書の範囲外の）いくつかの方法を使用することが推奨されるIPマルチキャストのようにトラフィックを送信することができます。その時点から、この文書の記述は、彼らがAD-1への輸送やEUからの脚の運用面をカバーしていないので、彼らが完了していないことを除いて、適用されます。"
    },
    {
      "indent": 6,
      "text": "* This document does not detail the case where AD-1 and AD-2 are not directly connected to each other and are instead connected via one or more other ADs (as opposed to a peering point) that serve as transit providers. The cases described in this document where tunnels are used between AD-1 and AD-2 can be applied to such scenarios, but SLA (\"Service Level Agreement\") control, for example, would be different. Additional issues will likely exist as well in such scenarios. This topic is left for further study.",
      "ja": "*このドキュメントではなく、詳細AD-1、AD-2は、互いに直接接続されておらず、代わりにトランジット・プロバイダとして機能する一つ以上の他の広告（ピアリングポイントとは対照的に）を介して接続されている場合がありません。トンネルがAD-1、AD-2との間で使用され、この文書に記載され場合は、このようなシナリオに適用することができるが、SLA（「サービスレベル契約」）の制御は、例えば、異なるであろう。追加の問題がありそうなシナリオにおいても同様に存在します。このトピックでは、さらなる研究のために残されています。"
    },
    {
      "indent": 3,
      "text": "o For the purposes of this document, the term \"peering point\" refers to a network connection (\"link\") between two administrative network domains over which traffic is exchanged between them. This is also referred to as a Network-to-Network Interface (NNI). Unless otherwise noted, it is assumed that the peering point is a private peering point, where the network connection is a physically or virtually isolated network connection solely between AD-1 and AD-2. The other case is that of a broadcast peering point, which is a common option in public Internet Exchange Points (IXPs). See Section 4.2.4 for more details.",
      "ja": "本文書の目的のためにO、用語「ピアリングポイント」トラフィックがそれらの間で交換される上に2つの管理ネットワークドメインとの間のネットワーク接続（「リンク」）を指します。これは、ネットワーク・ツー・ネットワークインタフェース（NNI）と呼ばれます。特に断りのない限り、ピアリングポイントは、ネットワーク接続がもっぱらAD-1、AD-2との間の物理的または仮想的に分離されたネットワーク接続であるプライベートピアリングポイント、であることが想定されます。その他の場合は、公共のインターネットエクスチェンジ（のIXP）で一般的なオプションである点を、ピアリング放送のことです。詳細は、4.2.4項を参照してください。"
    },
    {
      "indent": 3,
      "text": "o AD-1 is enabled with native multicast. A peering point exists between AD-1 and AD-2.",
      "ja": "O AD-1は、ネイティブマルチキャストで有効になっています。ピアリングポイントは、AD-1、AD-2の間に存在します。"
    },
    {
      "indent": 3,
      "text": "o It is understood that several protocols are available for this purpose, including Protocol-Independent Multicast - Sparse Mode (PIM-SM) and Protocol-Independent Multicast - Source-Specific Multicast (PIM-SSM) [RFC7761], the Internet Group Management Protocol (IGMP) [RFC3376], and Multicast Listener Discovery (MLD) [RFC3810].",
      "ja": "Oいくつかのプロトコルがプロトコル独立マルチキャストを含め、この目的のために利用可能であることが理解される - 希薄モード（PIM-SM）およびプロトコル独立マルチキャスト - ソース固有のマルチキャスト（PIM-SSM）[RFC7761]、インターネットグループ管理プロトコル（IGMP）[RFC3376]、およびマルチキャストリスナー発見（MLD）[RFC3810]。"
    },
    {
      "indent": 3,
      "text": "o As described in Section 2, the source IP address of the (so-called \"(S,G)\") multicast stream in the originating AD (AD-1) is known. Under this condition, using PIM-SSM is beneficial, as it allows the receiver's upstream router to send a join message directly to the source without the need to invoke an intermediate Rendezvous Point (RP). The use of SSM also presents an improved threat mitigation profile against attack, as described in [RFC4609]. Hence, in the case of inter-domain peering, it is recommended that only SSM protocols be used; the setup of inter-domain peering for ASM (Any-Source Multicast) is out of scope for this document.",
      "ja": "第2節で説明したように、O、（いわゆる \"（S、G）\"）由来ADにおけるマルチキャストストリームの送信元IPアドレス（AD-1）が知られています。それは受信機の上流のルータが中間ランデブーポイント（RP）を起動する必要なく、ソースに直接参加メッセージを送信することを可能にするようにこの状態で、PIM-SSMを使用することは、有益です。 [RFC4609]に記載されているようにSSMの使用はまた、攻撃に対する改善された脅威軽減プロファイルを提示します。従って、ドメイン間のピアリングの場合は、それだけSSMプロトコルを使用することが推奨されます。 ASMのためのドメイン間のピアリングの設定（任意-ソースマルチキャスト）は、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "o The rest of this document assumes that PIM-SSM and BGP are used across the peering point, plus Automatic Multicast Tunneling (AMT) [RFC7450] and/or Generic Routing Encapsulation (GRE), according to the scenario in question. The use of other protocols is beyond the scope of this document.",
      "ja": "Oこの文書の残りの部分では、PIM-SSMおよびBGPピアリング・ポイント間で使用されていることを前提とし、プラス自動マルチキャストトンネリング（AMT）[RFC7450]及び/又は総称ルーティングカプセル化（GRE）は、当該シナリオに従って。他のプロトコルの使用は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 3,
      "text": "o AMT is set up at the peering point if either the peering point or AD-2 is not multicast enabled. It is assumed that an AMT relay will be available to a client for multicast delivery. The selection of an optimal AMT relay by a client is out of scope for this document. Note that using AMT is necessary only when native multicast is unavailable in the peering point (Use Case 3.3) or in the downstream administrative domain (Use Cases 3.4 and 3.5).",
      "ja": "ピアリングポイント又はAD-2のいずれかが有効にマルチキャストされていない場合、O AMTは、ピアリングポイントに設定されています。 AMTリレーはマルチキャスト配信のためのクライアントに利用可能になることが想定されます。クライアントによる最適AMTリレーの選択は、このドキュメントの範囲外です。 AMTを使用して、ネイティブマルチキャストピアリングポイント（ユースケース3.3）または下流管理ドメイン（ユースケース3.4および3.5）で利用できない場合にのみ必要であることに留意されたいです。"
    },
    {
      "indent": 3,
      "text": "o It is assumed that the collection of billing data is done at the application level and is not considered to be a networking issue. The settlements process for EU billing and/or inter-provider billing is out of scope for this document.",
      "ja": "O課金データの収集は、アプリケーションレベルで行われ、ネットワークの問題ではないと考えられることが想定されます。 EUの請求および/またはインタープロバイダの課金のための集落プロセスはこの文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "o Inter-domain network connectivity troubleshooting is only considered within the context of a cooperative process between the two domains.",
      "ja": "Oドメイン間のネットワーク接続のトラブルシューティングは、2つだけのドメイン間の連携処理のコンテキスト内であると考えられます。"
    },
    {
      "indent": 3,
      "text": "This document also attempts to identify ways by which the peering process can be improved. Development of new methods for improvement is beyond the scope of this document.",
      "ja": "この文書はまた、ピアリングプロセスを向上させることが可能な方法を特定することを試みます。改善のための新たな方法の開発は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 0,
      "text": "2. Overview of Inter-domain Multicast Application Transport",
      "section_title": true,
      "ja": "ドメイン間のマルチキャストアプリケーション転送の2の概要"
    },
    {
      "indent": 3,
      "text": "A multicast-based application delivery scenario is as follows:",
      "ja": "次のようにマルチキャストベースのアプリケーション配信シナリオがあります。"
    },
    {
      "indent": 3,
      "text": "o Two independent administrative domains are interconnected via a peering point.",
      "ja": "O 2つの独立した管理ドメインは、ピアリングポイントを介して相互に接続されています。"
    },
    {
      "indent": 3,
      "text": "o The peering point is either multicast enabled (end-to-end native multicast across the two domains) or connected by one of two possible tunnel types:",
      "ja": "ピアリングポイントoをマルチキャスト有効（二ドメイン間のエンドツーエンドのネイティブマルチキャスト）または2つの可能なトンネル型のいずれかで接続されたいずれかです。"
    },
    {
      "indent": 6,
      "text": "* A GRE tunnel [RFC2784] allowing multicast tunneling across the peering point, or",
      "ja": "ピアリングポイントを横切るマルチキャストトンネリングを可能にする* GREトンネル[RFC2784]、又は"
    },
    {
      "indent": 6,
      "text": "* AMT [RFC7450].",
      "ja": "* OFFICE [RFC7450]。"
    },
    {
      "indent": 3,
      "text": "o A service provider controls one or more application sources in AD-1 that will send multicast IP packets via one or more (S,G)s (multicast traffic flows; see Section 4.2.1 if you are unfamiliar with IP multicast). It is assumed that the service being provided is suitable for delivery via multicast (e.g., live video streaming of popular events, software downloads to many devices) and that the packet streams will be carried by a suitable multicast transport protocol.",
      "ja": "Oサービス・プロバイダは、一つ以上の（S、G）Sを介して、マルチキャストIPパケットを送信することをAD-1における1つの以上のアプリケーション・ソースを制御する（マルチキャストトラフィックフロー、あなたはIPマルチキャストに慣れていない場合は、セクション4.2.1を参照します）。提供されているサービスは、マルチキャスト（人気イベントなど、ライブビデオストリーミング、多くのデバイスへのソフトウェアのダウンロード）を介して、パケットストリームは、適切なマルチキャストトランスポートプロトコルによって運ばれることを送達するのに適していることが想定されます。"
    },
    {
      "indent": 3,
      "text": "o An EU controls a device connected to AD-2, which runs an application client compatible with the service provider's application source.",
      "ja": "O EUは、サービスプロバイダーのアプリケーションのソースと互換性のあるアプリケーションクライアントを実行しAD-2に接続されたデバイスを制御します。"
    },
    {
      "indent": 3,
      "text": "o The application client joins appropriate (S,G)s in order to receive the data necessary to provide the service to the EU. The mechanisms by which the application client learns the appropriate (S,G)s are an implementation detail of the application and are out of scope for this document.",
      "ja": "アプリケーションクライアントは、EUへのサービスを提供するために必要なデータを受信するために適切な（S、G）をS oを接合します。アプリケーションクライアントは、適切な（S、G）を学習する機構Sは、アプリケーションの実装の詳細であり、この文書の範囲外です。"
    },
    {
      "indent": 3,
      "text": "The assumption here is that AD-1 has ultimate responsibility for delivering the multicast-based service on behalf of the content source(s). All relevant interactions between the two domains described in this document are based on this assumption.",
      "ja": "ここでの仮定は、AD-1は、コンテンツソース（S）に代わって、マルチキャストベースのサービスを提供するための最終的な責任を有することです。本書で説明した2つのドメインの間に関連するすべての相互作用は、この仮定に基づいています。"
    },
    {
      "indent": 3,
      "text": "Note that AD-2 may be an independent network domain (e.g., a Tier 1 network operator domain). Alternately, AD-2 could also be an enterprise network domain operated by a single customer of AD-1. The peering point architecture and requirements may have some unique aspects associated with enterprise networks; see Section 3.",
      "ja": "そのAD-2は、独立したネットワークドメイン（例えば、ティア1つのネットワークオペレータドメイン）であってもよい注意。あるいは、AD-2はまた、AD-1の単一の顧客によって操作される企業ネットワークドメインであってもよいです。ピアリングポイントアーキテクチャと要件は、企業ネットワークに関連付けられたいくつかのユニークな側面を有していてもよいです。第3節を参照してください。"
    },
    {
      "indent": 3,
      "text": "The use cases describing various architectural configurations for multicast distribution, along with associated requirements, are described in Section 3. Section 4 contains a comprehensive list of pertinent information that needs to be exchanged between the two domains in order to support functions to enable application transport.",
      "ja": "マルチキャスト配信のための様々なアーキテクチャ上の構成を説明するユースケースは、関連する要求と共に、第4章は、アプリケーションの輸送を可能にするための機能をサポートするために2つのドメイン間で交換される必要がある関連情報の包括的なリストを含むセクション3に記載されています。"
    },
    {
      "indent": 0,
      "text": "3. Inter-domain Peering Point Requirements for Multicast",
      "section_title": true,
      "ja": "マルチキャスト3.ドメイン間ピアリングポイントの要件"
    },
    {
      "indent": 3,
      "text": "The transport of applications using multicast requires that the inter-domain peering point be enabled to support such a process. This section presents five use cases for consideration.",
      "ja": "マルチキャストを使用したアプリケーションの輸送は、ドメイン間のピアリングポイントは、このようなプロセスをサポートするために有効にする必要があります。このセクションでは、検討のための5つのユースケースを提示します。"
    },
    {
      "indent": 0,
      "text": "3.1. Native Multicast",
      "section_title": true,
      "ja": "3.1。ネイティブマルチキャスト"
    },
    {
      "indent": 3,
      "text": "This use case involves end-to-end native multicast between the two administrative domains, and the peering point is also native multicast enabled. See Figure 1.",
      "ja": "このユースケースは、2つの管理ドメイン間のエンドツーエンドのネイティブマルチキャストを含む、及びピアリングポイントはまた、ネイティブマルチキャスト有効です。図1を参照してください。"
    },
    {
      "indent": 3,
      "text": "   -------------------               -------------------\n  /       AD-1        \\             /        AD-2       \\\n / (Multicast Enabled) \\           / (Multicast Enabled) \\\n/                       \\         /                       \\\n| +----+                |         |                       |\n| |    |       +------+ |         |  +------+             |   +----+\n| | AS |------>|  BR  |-|---------|->|  BR  |-------------|-->| EU |\n| |    |       +------+ |   I1    |  +------+             |I2 +----+\n\\ +----+                /         \\                       /\n \\                     /           \\                     /\n  \\                   /             \\                   /\n   -------------------               -------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "AD = Administrative Domain (independent autonomous system) AS = multicast (e.g., content) Application Source BR = Border Router I1 = AD-1 and AD-2 multicast interconnection (e.g., MP-BGP) I2 = AD-2 and EU multicast connection",
      "ja": "AD = AS =マルチキャスト管理ドメイン（独立した自律システム）（例えば、コンテンツ）アプリケーションソースBRは=ボーダルータI1 = AD-1、AD-2マルチキャスト相互接続（例えば、MP-BGP）I2 = AD-2、EUマルチキャスト接続"
    },
    {
      "indent": 6,
      "text": "Figure 1: Content Distribution via End-to-End Native Multicast",
      "ja": "図1：エンドツーエンドのネイティブマルチキャストを介したコンテンツ配信"
    },
    {
      "indent": 3,
      "text": "Advantages of this configuration:",
      "ja": "この構成の利点："
    },
    {
      "indent": 3,
      "text": "o Most efficient use of bandwidth in both domains.",
      "ja": "両方のドメインにおける帯域幅のO最も効率的な使用。"
    },
    {
      "indent": 3,
      "text": "o Fewer devices in the path traversed by the multicast stream when compared to an AMT-enabled peering point.",
      "ja": "AMT対応ピアリングポイントと比較した場合、マルチキャストストリームが横断する経路に少ないデバイスO。"
    },
    {
      "indent": 3,
      "text": "From the perspective of AD-1, the one disadvantage associated with native multicast to AD-2 instead of individual unicast to every EU in AD-2 is that it does not have the ability to count the number of EUs as well as the transmitted bytes delivered to them. This information is relevant from the perspective of customer billing and operational logs. It is assumed that such data will be collected by the application layer. The application-layer mechanisms for generating this information need to be robust enough so that all pertinent requirements for the source provider and the AD operator are satisfactorily met. The specifics of these methods are beyond the scope of this document.",
      "ja": "AD-1の観点から、AD-2のすべてのEUにAD-2のネイティブマルチキャストの代わりに個々のユニキャストに関連する一つの欠点は、それがのEUの数、ならびに送信されたバイトをカウントする機能を有していないということですそれらに配信。この情報は、顧客の請求や操作ログの観点から適切です。このようなデータは、アプリケーション層によって収集されることが想定されます。この情報を生成するためのアプリケーションレイヤメカニズムは、ソースプロバイダとADオペレータのすべての関連要件を満足満たされるように十分に堅牢である必要があります。これらのメソッドの詳細は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 3,
      "text": "Architectural guidelines for this configuration are as follows:",
      "ja": "次のようにこの構成のための建築ガイドラインは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "a. Dual homing for peering points between domains is recommended as a way to ensure reliability with full BGP table visibility.",
      "ja": "A。ドメイン間の点をピアリングデュアルホーミングは、フルBGPテーブルの可視性と信頼性を確保する方法として推奨されています。"
    },
    {
      "indent": 3,
      "text": "b. If the peering point between AD-1 and AD-2 is a controlled network environment, then bandwidth can be allocated accordingly by the two domains to permit the transit of non-rate-adaptive multicast traffic. If this is not the case, then the multicast traffic must support congestion control via any of the mechanisms described in Section 4.1 of [BCP145].",
      "ja": "B。 AD-1、AD-2との間のピアリングポイントは、制御されたネットワーク環境である場合、帯域幅は、非レート適応型マルチキャストトラフィックの通過を許可するために、2つのドメインがそれに応じて割り当てることができます。そうでない場合、次いで、マルチキャストトラフィックは[BCP145]のセクション4.1で説明されたメカニズムのいずれかを介して輻輳制御をサポートしなければなりません。"
    },
    {
      "indent": 3,
      "text": "c. The sending and receiving of multicast traffic between two domains is typically determined by local policies associated with each domain. For example, if AD-1 is a service provider and AD-2 is an enterprise, then AD-1 may support local policies for traffic delivery to, but not traffic reception from, AD-2. Another example is the use of a policy by which AD-1 delivers specified content to AD-2 only if such delivery has been accepted by contract.",
      "ja": "C。送信と2つのドメイン間のマルチキャストトラフィックの送受信、典型的には、各ドメインに関連付けられたローカルポリシーによって決定されます。 AD-1は、サービスプロバイダとAD-2が企業である場合、例えば、次にAD-1、AD-2、からのトラフィックの受信にではなく、トラフィック配信のためのローカルポリシーをサポートすることができます。別の例では、AD-1は、そのような送達は、契約により受け付けられた場合にのみ、AD-2に指定されたコンテンツを配信することにより、ポリシーを使用することです。"
    },
    {
      "indent": 3,
      "text": "d. It is assumed that relevant information on multicast streams delivered to EUs in AD-2 is collected by available capabilities in the application layer. The precise nature and formats of the collected information will be determined by directives from the source owner and the domain operators.",
      "ja": "D。 AD-2でのEUに配信マルチキャストストリームに関連する情報は、アプリケーション層で使用可能な機能によって収集されているものとします。収集された情報の正確な性質およびフォーマットは、ソース所有者とドメインオペレータからの指示により決定されるであろう。"
    },
    {
      "indent": 0,
      "text": "3.2. Peering Point Enabled with GRE Tunnel",
      "section_title": true,
      "ja": "3.2。 GREトンネルで有効ピアリングポイント"
    },
    {
      "indent": 3,
      "text": "The peering point is not native multicast enabled in this use case. There is a GRE tunnel provisioned over the peering point. See Figure 2.",
      "ja": "ピアリングポイントは、このユースケースで有効にネイティブマルチキャストではありません。ピアリングポイントの上にプロビジョニングされたGREトンネルがあります。図2を参照してください。"
    },
    {
      "indent": 4,
      "text": "   -------------------              -------------------\n  /       AD-1        \\            /        AD-2       \\\n / (Multicast Enabled) \\          / (Multicast Enabled) \\\n/                       \\        /                       \\\n| +----+          +---+ |  (I1)  | +---+                 |\n| |    |   +--+   |uBR|-|--------|-|uBR|   +--+          |   +----+\n| | AS |-->|BR|   +---+-|        | +---+   |BR| -------->|-->| EU |\n| |    |   +--+<........|........|........>+--+          |I2 +----+\n\\ +----+                /   I1   \\                       /\n \\                     /   GRE    \\                     /\n  \\                   /   Tunnel   \\                   /\n   -------------------              -------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "AD = Administrative Domain (independent autonomous system) AS = multicast (e.g., content) Application Source uBR = unicast Border Router - not necessarily multicast enabled; may be the same router as BR BR = Border Router - for multicast I1 = AD-1 and AD-2 multicast interconnection (e.g., MP-BGP) I2 = AD-2 and EU multicast connection",
      "ja": "AD = AS =マルチキャスト管理ドメイン（独立した自律システム）（例えば、コンテンツ）アプリケーションソースUBR =ユニキャスト境界ルータ - 必ずしもマルチキャストに対応していません。マルチキャストI1 = AD-1、AD-2マルチキャスト相互接続（例えば、MP-BGP）I2 = AD-2、EUマルチキャスト接続のために -  BR BR =ボーダルータと同じルータであってもよいです"
    },
    {
      "indent": 15,
      "text": "Figure 2: Content Distribution via GRE Tunnel",
      "ja": "図2：GREトンネルを介したコンテンツ配信"
    },
    {
      "indent": 3,
      "text": "In this case, interconnection I1 between AD-1 and AD-2 in Figure 2 is multicast enabled via a GRE tunnel [RFC2784] between the two BRs and encapsulating the multicast protocols across it.",
      "ja": "この場合、図2のAD-1、AD-2との間の配線I1は、マルチキャスト2つのBR及びそれを横切ってマルチキャストプロトコルをカプセル化との間のGREトンネル[RFC2784]を介して有効になっています。"
    },
    {
      "indent": 3,
      "text": "Normally, this approach is chosen if the uBR physically connected to the peering link cannot or should not be enabled for IP multicast. This approach may also be beneficial if the BR and uBR are the same device but the peering link is a broadcast domain (IXP); see Section 4.2.4.",
      "ja": "UBRは、物理的またはIPマルチキャストを有効にするべきではないことはできませんピアリングリンクに接続された場合、通常、このアプローチが選択されています。 BRとUBRが同じデバイスであるが、ピアリングリンクブロードキャストドメイン（IXP）である場合、このアプローチはまた、有益であり得ます。セクション4.2.4を参照してください。"
    },
    {
      "indent": 3,
      "text": "The routing configuration is basically unchanged: instead of running BGP (SAFI-2) (\"SAFI\" stands for \"Subsequent Address Family Identifier\") across the native IP multicast link between AD-1 and AD-2, BGP (SAFI-2) is now run across the GRE tunnel.",
      "ja": "ルーティング構成は、基本的には変わらない。代わりに、BGP（SAFI-2）を実行する（「サフィ」は「次のアドレスファミリー識別子」を表す）AD-1、AD-2との間のネイティブIPマルチキャストリンク、BGP（SAFI-2）を横切ります今GREトンネル上で実行されます。"
    },
    {
      "indent": 3,
      "text": "Advantages of this configuration:",
      "ja": "この構成の利点："
    },
    {
      "indent": 3,
      "text": "o Highly efficient use of bandwidth in both domains, although not as efficient as the fully native multicast use case (Section 3.1).",
      "ja": "両方のドメインにおける帯域幅のO非常に効率的な使用、完全にネイティブマルチキャストユースケースほど効率的ではないが（セクション3.1）。"
    },
    {
      "indent": 3,
      "text": "o Fewer devices in the path traversed by the multicast stream when compared to an AMT-enabled peering point.",
      "ja": "AMT対応ピアリングポイントと比較した場合、マルチキャストストリームが横断する経路に少ないデバイスO。"
    },
    {
      "indent": 3,
      "text": "o Ability to support partial and/or incremental IP multicast deployments in AD-1 and/or AD-2: only the path or paths between the AS/BR (AD-1) and the BR/EU (AD-2) need to be multicast enabled. The uBRs may not support IP multicast or enabling it could be seen as operationally risky on that important edge node, whereas dedicated BR nodes for IP multicast may (at least initially) be more acceptable. The BR can also be located such that only parts of the domain may need to support native IP multicast (e.g., only the core in AD-1 but not edge networks towards the uBR).",
      "ja": "O能力は、AD-1及び/又はAD-2の部分及び/または増分IPマルチキャスト展開をサポートする：AS / BRとの間の唯一の経路またはパス（AD-1）及びBR / EU（AD-2）に必要マルチキャストを有効にします。 uBRsは、IPマルチキャストをサポートしていない場合があり、またはIPマルチキャストのための専用BRノードが（少なくとも最初は）より許容可能であり得る一方、それは、その重要エッジノードで動作可能として危険見ることができる可能にします。 BRは、ドメインの部分のみが（AD-1において、例えば、コアのみが、UBR向かっネットワークエッジない）ネイティブIPマルチキャストをサポートする必要があるかもしれないように配置することができます。"
    },
    {
      "indent": 3,
      "text": "o GRE is an existing technology and is relatively simple to implement.",
      "ja": "O GREは、既存の技術であり、実装が比較的簡単です。"
    },
    {
      "indent": 3,
      "text": "Disadvantages of this configuration:",
      "ja": "この構成の欠点："
    },
    {
      "indent": 3,
      "text": "o Per Use Case 3.1, current router technology cannot count the number of EUs or the number of bytes transmitted.",
      "ja": "パーユースケース3.1 O、現在のルータ技術はのEUの数や送信バイト数をカウントすることはできません。"
    },
    {
      "indent": 3,
      "text": "o The GRE tunnel requires manual configuration.",
      "ja": "O GREトンネルは手動設定を必要とします。"
    },
    {
      "indent": 3,
      "text": "o The GRE tunnel must be established prior to starting the stream.",
      "ja": "O GREトンネルは、ストリームを開始する前に確立されなければなりません。"
    },
    {
      "indent": 3,
      "text": "o The GRE tunnel is often left pinned up.",
      "ja": "O GREトンネルが頻繁に固定されたまま。"
    },
    {
      "indent": 3,
      "text": "Architectural guidelines for this configuration include the following:",
      "ja": "この構成のための建築ガイドラインは、次のものがあります。"
    },
    {
      "indent": 3,
      "text": "Guidelines (a) through (d) are the same as those described in Use Case 3.1. Two additional guidelines are as follows:",
      "ja": "（d）をガイドライン（A）は、ユースケース3.1で説明したものと同じです。次の2つの追加のガイドラインは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "e. GRE tunnels are typically configured manually between peering points to support multicast delivery between domains.",
      "ja": "電子。 GREトンネルは、典型的には、ドメイン間のマルチキャスト配信をサポートするために、ポイントをピアリング間に手動で設定されています。"
    },
    {
      "indent": 3,
      "text": "f. It is recommended that the GRE tunnel (tunnel server) configuration in the source network be such that it only advertises the routes to the application sources and not to the entire network. This practice will prevent unauthorized delivery of applications through the tunnel (for example, if the application (e.g., content) is not part of an agreed-upon inter-domain partnership).",
      "ja": "F。ソースネットワークにおけるGREトンネル（トンネルサーバ）の構成は、それが唯一のアプリケーションソースへの全体ではなく、ネットワークへのルートをアドバタイズするようにすることが推奨されます。 （アプリケーション（例えば、コンテンツ）が合意されたドメイン間のパートナーシップの一部でない場合、例えば、）この方法は、トンネルを介してアプリケーションの不正配信を防止します。"
    },
    {
      "indent": 0,
      "text": "3.3. Peering Point Enabled with AMT - Both Domains Multicast Enabled",
      "section_title": true,
      "ja": "3.3。両方のドメインのマルチキャストが有効 - ポイントはAMTで有効ピアリング"
    },
    {
      "indent": 3,
      "text": "It is assumed that both administrative domains in this use case are native multicast enabled here; however, the peering point is not.",
      "ja": "このユースケースでは、両方の管理ドメインがネイティブマルチキャストがここに有効であると仮定する。しかし、ピアリングポイントではありません。"
    },
    {
      "indent": 3,
      "text": "The peering point is enabled with AMT. The basic configuration is depicted in Figure 3.",
      "ja": "ピアリングポイントは、AMTで有効になっています。基本的な構成は図3に示されています。"
    },
    {
      "indent": 4,
      "text": "   -------------------              -------------------\n  /       AD-1        \\            /        AD-2       \\\n / (Multicast Enabled) \\          / (Multicast Enabled) \\\n/                       \\        /                       \\\n| +----+          +---+ |   I1   | +---+                 |\n| |    |   +--+   |uBR|-|--------|-|uBR|   +--+          |   +----+\n| | AS |-->|AR|   +---+-|        | +---+   |AG| -------->|-->| EU |\n| |    |   +--+<........|........|........>+--+          |I2 +----+\n\\ +----+                /  AMT   \\                       /\n \\                     /  Tunnel  \\                     /\n  \\                   /            \\                   /\n   -------------------              -------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "AD = Administrative Domain (independent autonomous system) AS = multicast (e.g., content) Application Source AR = AMT Relay AG = AMT Gateway uBR = unicast Border Router - not multicast enabled; also, either AR = uBR (AD-1) or uBR = AG (AD-2) I1 = AMT interconnection between AD-1 and AD-2 I2 = AD-2 and EU multicast connection",
      "ja": "AD =管理ドメイン（独立した自律システム）AS =マルチキャスト（例えば、コンテンツ）アプリケーションソースAR = AMTリレーAG = AMTゲートウェイUBR =ユニキャスト境界ルータ - 有効マルチキャストありません。また、AR = UBR（AD-1）又はAD-1、AD-2 I2 = AD-2、EUマルチキャスト接続との間のUBR = AG（AD-2）I1 = AMT相互接続のいずれか"
    },
    {
      "indent": 12,
      "text": "Figure 3: AMT Interconnection between AD-1 and AD-2",
      "ja": "図3：AD-1、AD-2との間の相互接続AMT"
    },
    {
      "indent": 3,
      "text": "Advantages of this configuration:",
      "ja": "この構成の利点："
    },
    {
      "indent": 3,
      "text": "o Highly efficient use of bandwidth in AD-1.",
      "ja": "AD-1における帯域幅のO高効率利用。"
    },
    {
      "indent": 3,
      "text": "o AMT is an existing technology and is relatively simple to implement. Attractive properties of AMT include the following:",
      "ja": "O AMTは、既存の技術であり、実装が比較的簡単です。 AMTの魅力的な特性は、次のものがあります。"
    },
    {
      "indent": 6,
      "text": "* Dynamic interconnection between the gateway-relay pair across the peering point.",
      "ja": "*ピアリングポイントを横切るゲートウェイリレー対の間の動的相互。"
    },
    {
      "indent": 6,
      "text": "* Ability to serve clients and servers with differing policies.",
      "ja": "*異なるポリシーをクライアントとサーバにサービスを提供する機能。"
    },
    {
      "indent": 3,
      "text": "Disadvantages of this configuration:",
      "ja": "この構成の欠点："
    },
    {
      "indent": 3,
      "text": "o Per Use Case 3.1 (AD-2 is native multicast), current router technology cannot count the number of EUs or the number of bytes transmitted to all EUs.",
      "ja": "パーユースケース3.1（AD-2がネイティブマルチキャストである）O、現在のルータ技術はのEUの数または全てのEUへ送信されたバイト数をカウントすることはできません。"
    },
    {
      "indent": 3,
      "text": "o Additional devices (AMT gateway and relay pairs) may be introduced into the path if these services are not incorporated into the existing routing nodes.",
      "ja": "これらのサービスは、既存のルーティングノードに組み込まれていない場合はO追加のデバイス（AMTゲートウェイとリレー対）の経路に導入することができます。"
    },
    {
      "indent": 3,
      "text": "o Currently undefined mechanisms for the AG to automatically select the optimal AR.",
      "ja": "O現在AGのための未定義のメカニズムは、自動的に最適なARを選択します。"
    },
    {
      "indent": 3,
      "text": "Architectural guidelines for this configuration are as follows:",
      "ja": "次のようにこの構成のための建築ガイドラインは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "Guidelines (a) through (d) are the same as those described in Use Case 3.1. In addition,",
      "ja": "（d）をガイドライン（A）は、ユースケース3.1で説明したものと同じです。加えて、"
    },
    {
      "indent": 3,
      "text": "e. It is recommended that AMT relay and gateway pairs be configured at the peering points to support multicast delivery between domains. AMT tunnels will then configure dynamically across the peering points once the gateway in AD-2 receives the (S,G) information from the EU.",
      "ja": "電子。 AMTリレーとゲートウェイ対はドメイン間マルチキャスト配信をサポートするピアリング点で構成されることが推奨されます。 AD-2におけるゲートウェイは、EUからの（S、G）情報を受信するとAMTトンネルは、次にピアリングポイントを横切って動的に構成されます。"
    },
    {
      "indent": 0,
      "text": "3.4. Peering Point Enabled with AMT - AD-2 Not Multicast Enabled",
      "section_title": true,
      "ja": "3.4。ポイントはAMTで有効ピアリング -  AD-2ではないマルチキャストが有効"
    },
    {
      "indent": 3,
      "text": "In this AMT use case, AD-2 is not multicast enabled. Hence, the interconnection between AD-2 and the EU is also not multicast enabled. This use case is depicted in Figure 4.",
      "ja": "このAMTユースケースでは、AD-2は、マルチキャスト有効になっていません。したがって、AD-2およびEU間の相互接続は、マルチキャスト有効になっていません。このユースケースは、図4に示されています。"
    },
    {
      "indent": 4,
      "text": "  -------------------               -------------------\n  /       AD-1        \\            /        AD-2       \\\n / (Multicast Enabled) \\          / (Not Multicast      \\\n/                       \\        /              Enabled) \\ N(large)\n| +----+          +---+ |        | +---+                 |  # EUs\n| |    |   +--+   |uBR|-|--------|-|uBR|                 |   +----+\n| | AS |-->|AR|   +---+-|        | +---+    ................>|EU/G|\n| |    |   +--+<........|........|...........            |I2 +----+\n\\ +----+                / N x AMT\\                       /\n \\                     /  Tunnel  \\                     /\n  \\                   /            \\                   /\n   -------------------              -------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "AS = multicast (e.g., content) Application Source uBR = unicast Border Router - not multicast enabled; otherwise, AR = uBR (in AD-1) AR = AMT Relay EU/G = Gateway client embedded in EU device I2 = AMT tunnel connecting EU/G to AR in AD-1 through non-multicast-enabled AD-2",
      "ja": "AS =マルチキャスト（例えば、コンテンツ）アプリケーションソースUBR =ユニキャスト境界ルータ - 有効マルチキャストありません。 （AD-1）そうでなければ、AR = UBR非マルチキャスト対応AD-2を介してAD-1中のArするEU / Gを結ぶEUデバイスI2 = AMTトンネル内に埋め込まれたAR = AMTリレーEU / Gは、=ゲートウェイクライアント"
    },
    {
      "indent": 7,
      "text": "Figure 4: AMT Tunnel Connecting AD-1 AMT Relay and EU Gateway",
      "ja": "図4：AD-1 AMTリレーおよびEUゲートウェイを接続するAMTトンネル"
    },
    {
      "indent": 3,
      "text": "This use case is equivalent to having unicast distribution of the application through AD-2. The total number of AMT tunnels would be equal to the total number of EUs requesting the application. The peering point thus needs to accommodate the total number of AMT tunnels between the two domains. Each AMT tunnel can provide the data usage associated with each EU.",
      "ja": "このユースケースは、AD-2を介してアプリケーションのユニキャスト配信を有することと等価です。 AMTトンネルの総数は、アプリケーションの要求のEUの総数に等しくなります。ピアリングポイントは、このように二つのドメイン間AMTトンネルの総数を収容する必要があります。各AMTトンネルは、各EUに関連付けられたデータの使用を提供することができます。"
    },
    {
      "indent": 3,
      "text": "Advantages of this configuration:",
      "ja": "この構成の利点："
    },
    {
      "indent": 3,
      "text": "o Efficient use of bandwidth in AD-1 (the closer the AR is to the uBR, the more efficient).",
      "ja": "O AD-1における帯域幅の効率的な使用は、（近いARはUBR、より効率的です）。"
    },
    {
      "indent": 3,
      "text": "o Ability of AD-1 to introduce content delivery based on IP multicast, without any support by network devices in AD-2: only the application side in the EU device needs to perform AMT gateway library functionality to receive traffic from the AMT relay.",
      "ja": "O AD-2のネットワークデバイスによって任意のサポートなしIPマルチキャストに基づいてコンテンツ配信を導入するAD-1の能力：のみアプリケーション側EU装置では、AMTリレーからのトラフィックを受信するためにAMTゲートウェイライブラリ機能を実行する必要があります。"
    },
    {
      "indent": 3,
      "text": "o Allows AD-2 to \"upgrade\" to Use Case 3.5 (see Section 3.5) at a later time, without any change in AD-1 at that time.",
      "ja": "oはユースケース3.5にAD-2「アップグレード」することを可能にする、その時点でAD-1を変更せず、後で（3.5節を参照してください）。"
    },
    {
      "indent": 3,
      "text": "o AMT is an existing technology and is relatively simple to implement. Attractive properties of AMT include the following:",
      "ja": "O AMTは、既存の技術であり、実装が比較的簡単です。 AMTの魅力的な特性は、次のものがあります。"
    },
    {
      "indent": 6,
      "text": "* Dynamic interconnection between the AMT gateway-relay pair across the peering point.",
      "ja": "*ピアリングポイントを横切るAMTゲートウェイリレー対の間の動的相互。"
    },
    {
      "indent": 6,
      "text": "* Ability to serve clients and servers with differing policies.",
      "ja": "*異なるポリシーをクライアントとサーバにサービスを提供する機能。"
    },
    {
      "indent": 3,
      "text": "o Each AMT tunnel serves as a count for each EU and is also able to track data usage (bytes) delivered to the EU.",
      "ja": "O各AMTトンネルは、各EUのカウントとして機能し、また、EUに配信されたデータの使用（バイト）を追跡することができます。"
    },
    {
      "indent": 3,
      "text": "Disadvantages of this configuration:",
      "ja": "この構成の欠点："
    },
    {
      "indent": 3,
      "text": "o Additional devices (AMT gateway and relay pairs) are introduced into the transport path.",
      "ja": "O追加のデバイス（AMTゲートウェイとリレー対）搬送路に導入されます。"
    },
    {
      "indent": 3,
      "text": "o Assuming multiple peering points between the domains, the EU gateway needs to be able to find the \"correct\" AMT relay in AD-1.",
      "ja": "ドメイン間の複数のピアリングポイントを仮定すると、O、EUゲートウェイはAD-1の「正しい」AMTリレーを見つけることができる必要があります。"
    },
    {
      "indent": 3,
      "text": "Architectural guidelines for this configuration are as follows:",
      "ja": "次のようにこの構成のための建築ガイドラインは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "Guidelines (a) through (c) are the same as those described in Use Case 3.1. In addition,",
      "ja": "（c）はガイドライン（A）は使用例3.1に記載したものと同じです。加えて、"
    },
    {
      "indent": 3,
      "text": "d. It is necessary that proper procedures be implemented such that the AMT gateway at the EU device is able to find the correct AMT relay for each (S,G) content stream. Standard mechanisms for that selection are still subject to ongoing work. This includes the use of anycast gateway addresses, anycast DNS names, or explicit configuration that maps (S,G) to a relay address; or letting the application in the EU/G provide the relay address to the embedded AMT gateway function.",
      "ja": "D。適切な手順がEU装置でAMTゲートウェイはそれぞれ（S、G）は、コンテンツストリームの正しいAMTリレーを見つけることができるように実施されることが必要です。その選択のための標準的なメカニズムはまだ進行中の作業の対象となっています。これは、エニーキャストゲートウェイアドレス、エニーキャストDNS名、またはリレー・アドレスに（S、G）をマッピングする明示的な設定の使用を含みます。またはEU / G内のアプリケーションが埋め込まAMTゲートウェイ機能へ中継アドレスを提供させます。"
    },
    {
      "indent": 3,
      "text": "e. The AMT tunnel's capabilities are expected to be sufficient for the purpose of collecting relevant information on the multicast streams delivered to EUs in AD-2.",
      "ja": "電子。 AMTトンネルの機能は、AD-2でのEUに配信マルチキャストストリームに関連する情報を収集するために十分であることが期待されます。"
    },
    {
      "indent": 0,
      "text": "3.5. AD-2 Not Multicast Enabled - Multiple AMT Tunnels through AD-2",
      "section_title": true,
      "ja": "3.5。 AD-2ではないマルチキャストが有効 - 複数のAMTトンネルAD-2を介して"
    },
    {
      "indent": 3,
      "text": "Figure 5 illustrates a variation of Use Case 3.4:",
      "ja": "図5は、ユースケース3.4のバリエーションを示しています。"
    },
    {
      "indent": 4,
      "text": "  -------------------               -------------------\n  /       AD-1        \\            /        AD-2       \\\n / (Multicast Enabled) \\          / (Not Multicast      \\\n/                 +---+ \\  (I1)  / +---+        Enabled) \\\n| +----+          |uBR|-|--------|-|uBR|                 |\n| |    |   +--+   +---+ |        | +---+           +---+ |   +----+\n| | AS |-->|AR|<........|....    | +---+           |AG/|....>|EU/G|\n| |    |   +--+         |  ......|.|AG/|..........>|AR2| |I3 +----+\n\\ +----+                /   I1   \\ |AR1|   I2      +---+ /\n \\                     /  Single  \\+---+                /\n  \\                   / AMT Tunnel \\                   /\n   -------------------              -------------------",
      "raw": true
    },
    {
      "indent": 3,
      "text": "uBR = unicast Border Router - not multicast enabled; also, either AR = uBR (AD-1) or uBR = AGAR1 (AD-2) AS = multicast (e.g., content) Application Source AR = AMT Relay in AD-1 AGAR1 = AMT Gateway/Relay node in AD-2 across peering point I1 = AMT tunnel connecting AR in AD-1 to gateway in AGAR1 in AD-2 AGAR2 = AMT Gateway/Relay node at AD-2 network edge I2 = AMT tunnel connecting relay in AGAR1 to gateway in AGAR2 EU/G = Gateway client embedded in EU device I3 = AMT tunnel connecting EU/G to AR in AGAR2",
      "ja": "UBR =ユニキャスト境界ルータ - 有効にマルチキャストではありません。 =マルチキャストASまた、AR = UBR（AD-1）のいずれか又はUBR = AGAR1（AD-2）を横切るAD-2におけるAD-1 AGAR1 = AMTゲートウェイ/中継ノード（例えば、コンテンツ）アプリケーションソースAR = AMTリレーピアリング点I1 = AMTトンネルAGAR2 EU / G =ゲートウェイ、ゲートウェイするAD-2ネットワークエッジI2 AGAR1に= AMTトンネル接続リレーでAD-2 AGAR2 = AMTゲートウェイ/リレーノードでAGAR1にゲートウェイにAD-1におけるARを結びますAGAR2でArにEU / Gを結ぶEUデバイスI3 = AMTトンネル内に埋め込まれたクライアント"
    },
    {
      "indent": 10,
      "text": "Figure 5: AMT Tunnel Connecting AMT Gateways and Relays",
      "ja": "図5：AMTゲートウェイとリレーを接続するAMTトンネル"
    },
    {
      "indent": 3,
      "text": "Use Case 3.4 results in several long AMT tunnels crossing the entire network of AD-2 linking the EU device and the AMT relay in AD-1 through the peering point. Depending on the number of EUs, there is a likelihood of an unacceptably high amount of traffic due to the large number of AMT tunnels -- and unicast streams -- through the peering point. This situation can be alleviated as follows:",
      "ja": "ケースピアリングポイントを介してEU装置及びAD-1におけるAMTリレーを連結AD-2のネットワーク全体を横切るいくつかの長いAMTトンネル3.4結果を使用。ユニキャストストリーム -   - ピアリングポイントを介してのEUの数に応じて、AMTによるトンネルの多数へのトラフィックの許容できないほど高い量の可能性があります。次のようにこの状況を緩和することができます。"
    },
    {
      "indent": 3,
      "text": "o Provisioning of strategically located AMT nodes in AD-2. An AMT node comprises co-location of an AMT gateway and an AMT relay. No change is required by AD-1, as compared to Use Case 3.4. This can be done whenever AD-2 sees fit (e.g., too much traffic across the peering point).",
      "ja": "O AD-2で戦略的に配置AMTノードのプロビジョニング。 AMTノードは、AMTゲートウェイとAMTリレーのコロケーションを含みます。ユースケース3.4と比較して変更なしには、AD-1で必要とされません。 AD-2（ピアリングポイント間で、例えば、あまりにも多くのトラフィック）フィットを見ている時はいつでもこれを行うことができます。"
    },
    {
      "indent": 3,
      "text": "o One such node is on the AD-2 side of the peering point (AMT node AGAR1 in Figure 5).",
      "ja": "O一つのそのようなノードは、ピアリングポイント（図5のAMTノードAGAR1）のAD-2側にあります。"
    },
    {
      "indent": 3,
      "text": "o A single AMT tunnel established across the peering point linking the AMT relay in AD-1 to the AMT gateway in AMT node AGAR1 in AD-2.",
      "ja": "AD-2でAMTノードAGAR1にAMTゲートウェイにAD-1でAMTリレーを結ぶピアリングポイントを越えて確立単一AMTトンネルO。"
    },
    {
      "indent": 3,
      "text": "o AMT tunnels linking AMT node AGAR1 at the peering point in AD-2 to other AMT nodes located at the edges of AD-2: e.g., AMT tunnel I2 linking the AMT relay in AGAR1 to the AMT gateway in AMT node AGAR2 (Figure 5).",
      "ja": "AMTノードAGAR2でAMTゲートウェイにAGAR1にAMTリレーを連結例えば、AMTトンネルI2（図5：AD-2の縁部に位置する他のAMTノードにAD-2のピアリングポイントでAMTノードAGAR1を連結AMTトンネルO ）。"
    },
    {
      "indent": 3,
      "text": "o AMT tunnels linking an EU device (via a gateway client embedded in the device) and an AMT relay in an appropriate AMT node at the edge of AD-2: e.g., I3 linking the EU gateway in the device to the AMT relay in AMT node AGAR2.",
      "ja": "AMTにAMTリレーに装置内EUゲートウェイを連結例えば、I3：（デバイス内に埋め込まれたゲートウェイクライアントを介して）EU装置を連結AMTトンネル及びAD-2のエッジで適切なAMTノードにAMTリレーOノードAGAR2。"
    },
    {
      "indent": 3,
      "text": "o In the simplest option (not shown), AD-2 only deploys a single AGAR1 node and lets the EU/G build AMT tunnels directly to it. This setup already solves the problem of replicated traffic across the peering point. As soon as there is a need to support more AMT tunnels to the EU/G, then additional AGAR2 nodes can be deployed by AD-2.",
      "ja": "O最も単純なオプション（図示せず）では、AD-2は、単一AGAR1ノードを展開し、EU / Gがそれに直接AMTトンネルを構築することができます。このセットアップは、すでにピアリングポイント間で複製されたトラフィックの問題を解決します。すぐにEU / Gに多くのAMTトンネルをサポートする必要があるとして、追加AGAR2ノードがAD-2で展開することができます。"
    },
    {
      "indent": 3,
      "text": "The advantage of such a chained set of AMT tunnels is that the total number of unicast streams across AD-2 is significantly reduced, thus freeing up bandwidth. Additionally, there will be a single unicast stream across the peering point instead of, possibly, an unacceptably large number of such streams per Use Case 3.4. However, this implies that several AMT tunnels will need to be dynamically configured by the various AMT gateways, based solely on the (S,G) information received from the application client at the EU device. A suitable mechanism for such dynamic configurations is therefore critical.",
      "ja": "AMTトンネルのような連鎖セットの利点は、AD-2の両端のユニキャストストリームの総数が大幅従って帯域幅を解放し、低減されることです。加えて、代わりのピアリングポイントを横切る単一のユニキャストストリームが存在するであろう、おそらく、ユースケース3.4当たりのそのようなストリームの許容できないほど多数。しかし、これはいくつかのAMTトンネルが動的にのみEU装置におけるアプリケーションのクライアントから受信した（S、G）情報に基づいて、様々なAMTゲートウェイで構成する必要があることを意味します。このような動的構成するのに適した機構は、したがって重要です。"
    },
    {
      "indent": 3,
      "text": "Architectural guidelines for this configuration are as follows:",
      "ja": "次のようにこの構成のための建築ガイドラインは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "Guidelines (a) through (c) are the same as those described in Use Case 3.1. In addition,",
      "ja": "（c）はガイドライン（A）は使用例3.1に記載したものと同じです。加えて、"
    },
    {
      "indent": 3,
      "text": "d. It is necessary that proper procedures be implemented such that the various AMT gateways (at the EU devices and the AMT nodes in AD-2) are able to find the correct AMT relay in other AMT nodes as appropriate. Standard mechanisms for that selection are still subject to ongoing work. This includes the use of anycast gateway addresses, anycast DNS names, or explicit configuration that maps (S,G) to a relay address. On the EU/G, this mapping information may come from the application.",
      "ja": "D。適切な手順は、（EU装置及びAD-2でAMTノードの）様々なAMTゲートウェイは、必要に応じて他のAMTノードで正しいAMTリレーを見つけることができるように実現されることが必要です。その選択のための標準的なメカニズムはまだ進行中の作業の対象となっています。これは、リレーアドレスにマッピングエニーキャストゲートウェイアドレス、エニーキャストDNS名、または明示的なコンフィギュレーション（S、G）の使用を含みます。 EU / Gには、このマッピング情報は、アプリケーションから来るかもしれません。"
    },
    {
      "indent": 3,
      "text": "e. The AMT tunnel's capabilities are expected to be sufficient for the purpose of collecting relevant information on the multicast streams delivered to EUs in AD-2.",
      "ja": "電子。 AMTトンネルの機能は、AD-2でのEUに配信マルチキャストストリームに関連する情報を収集するために十分であることが期待されます。"
    },
    {
      "indent": 0,
      "text": "4. Functional Guidelines",
      "section_title": true,
      "ja": "4.機能のガイドライン"
    },
    {
      "indent": 3,
      "text": "Supporting functions and related interfaces over the peering point that enable the multicast transport of the application are listed in this section. Critical information parameters that need to be exchanged in support of these functions are enumerated, along with guidelines as appropriate. Specific interface functions for consideration are as follows.",
      "ja": "アプリケーションのマルチキャスト伝送を可能にピアリングポイント上支持機能と関連するインターフェースは、このセクションに記載されています。これらの機能のサポートに交換する必要がある重要な情報のパラメータが適切なガイドラインと一緒に、列挙されています。次のように検討のための特定のインタフェース機能です。"
    },
    {
      "indent": 0,
      "text": "4.1. Network Interconnection Transport Guidelines",
      "section_title": true,
      "ja": "4.1。ネットワークの相互接続交通ガイドライン"
    },
    {
      "indent": 3,
      "text": "The term \"network interconnection transport\" refers to the interconnection points between the two administrative domains. The following is a representative set of attributes that the two administrative domains will need to agree on to support multicast delivery.",
      "ja": "用語「ネットワーク相互接続トランスポート」は、2つの管理ドメイン間の相互接続点を指します。以下は、2つの管理ドメインは、マルチキャスト配信をサポートするために同意する必要があります属性の代表的なセットです。"
    },
    {
      "indent": 3,
      "text": "o Number of peering points.",
      "ja": "ピアリングポイントのOの数。"
    },
    {
      "indent": 3,
      "text": "o Peering point addresses and locations.",
      "ja": "ポイントアドレスと場所をピアリングO。"
    },
    {
      "indent": 3,
      "text": "o Connection type - Dedicated for multicast delivery or shared with other services.",
      "ja": "O接続タイプ - マルチキャスト配信のための専用または他のサービスと共有します。"
    },
    {
      "indent": 3,
      "text": "o Connection mode - Direct connectivity between the two ADs or via another ISP.",
      "ja": "O接続モード -  2つの広告の間で、または別のISPを介して直接接続。"
    },
    {
      "indent": 3,
      "text": "o Peering point protocol support - Multicast protocols that will be used for multicast delivery will need to be supported at these points. Examples of such protocols include External BGP (EBGP) [RFC4760] peering via MP-BGP (Multiprotocol BGP) SAFI-2 [RFC4760].",
      "ja": "Oのピアリングポイントプロトコルのサポート - マルチキャスト配信に使用されるマルチキャストプロトコルは、これらの点で支持する必要があります。そのようなプロトコルの例は、外部BGP（EBGP）MP-BGP（マルチプロトコルBGP）SAFI-2 [RFC4760]を介してピアリング[RFC4760]を含みます。"
    },
    {
      "indent": 3,
      "text": "o Bandwidth allocation - If shared with other services, then there needs to be a determination of the share of bandwidth reserved for multicast delivery. See Section 4.1.1 below for more details.",
      "ja": "O帯域幅の割り当て - 他のサービスと共有している場合、マルチキャスト配信のために予約された帯域幅の共有の決意が必要です。詳細については、下記のセクション4.1.1を参照してください。"
    },
    {
      "indent": 3,
      "text": "o QoS requirements - Delay and/or latency specifications that need to be specified in an SLA.",
      "ja": "O QoS要件 - 遅延および/またはSLAで指定する必要がレイテンシー仕様。"
    },
    {
      "indent": 3,
      "text": "o AD roles and responsibilities - The role played by each AD for provisioning and maintaining the set of peering points to support multicast delivery.",
      "ja": "各プロビジョニングのためのADとマルチキャスト配信をサポートする点をピアリングのセットを維持することによって果たされる役割 -  ADの役割及び責任O。"
    },
    {
      "indent": 0,
      "text": "4.1.1. Bandwidth Management",
      "section_title": true,
      "ja": "4.1.1。帯域幅管理"
    },
    {
      "indent": 3,
      "text": "Like IP unicast traffic, IP multicast traffic carried across non-controlled networks must comply with congestion control principles as described in [BCP41] and as explained in detail for UDP IP multicast in [BCP145].",
      "ja": "IPユニキャストトラフィックのように、IPマルチキャストトラフィックは、[BCP41]で説明したようにBCP145]でUDP IPマルチキャストのために詳細に説明されるように輻輳制御の原則に従わなければならない非制御ネットワークを介して行います。"
    },
    {
      "indent": 3,
      "text": "Non-controlled networks (such as the Internet) are networks where there is no policy for managing bandwidth other than best effort with a fair share of bandwidth under congestion. As a simplified rule of thumb, complying with congestion control principles means reducing bandwidth under congestion in a way that is fair to competing (typically TCP) flows (\"rate adaptive\").",
      "ja": "非制御（インターネットなど）のネットワークが輻輳の下で帯域幅の公平な分配と最善の努力以外の帯域幅を管理するためのポリシーが存在しないネットワークです。親指の簡素化ルールとして、輻輳制御の原則を遵守することは競争に公平である方法（通常はTCP）で輻輳下の帯域幅を減少させることを意味するが（「レート適応を」）が流れます。"
    },
    {
      "indent": 3,
      "text": "In many instances, multicast content delivery evolves from intra-domain deployments where it is handled as a controlled network service and does not comply with congestion control principles. It was given a reserved amount of bandwidth and admitted to the network so that congestion never occurs. Therefore, the congestion control issue should be given specific attention when evolving to an inter-domain peering deployment.",
      "ja": "多くの場合、マルチキャストコンテンツ配信は、それが制御されたネットワークサービスとして処理され、輻輳制御の原則に準拠していないドメイン内の展開から進化します。これは、帯域幅の予約量を​​与えられ、その輻輳が発生したことがないので、ネットワークに入院しました。ドメイン間ピアリング展開に進化したときにそのため、輻輳制御の問題は、特定の注意を与えられるべきです。"
    },
    {
      "indent": 3,
      "text": "In the case where end-to-end IP multicast traffic passes across the network of two ADs (and their subsidiaries/customers), both ADs must agree on a consistent traffic-management policy. If, for example, AD-1 sources non-congestion-aware IP multicast traffic and AD-2 carries it as best-effort traffic across links shared with other Internet traffic (subject to congestion), this will not work: under congestion, some amount of that traffic will be dropped, often rendering the remaining packets as undecodable garbage clogging up the network in AD-2; because this traffic is not congestion aware, the loss does not reduce this rate. Competing traffic will not get their fair share under congestion, and EUs will be frustrated by the extremely bad quality of both their IP multicast traffic and other (e.g., TCP) traffic. Note that this is not an IP multicast technology issue but is solely a transport-layer / application-layer issue: the problem would just as likely happen if AD-1 were to send non-rate-adaptive unicast traffic -- for example, legacy IPTV video-on-demand traffic, which is typically also non-congestion aware. Note that because rate adaptation in IP unicast video is commonplace today due to the availability of ABR (Adaptive Bitrate) video, it is very unlikely that this will happen in reality with IP unicast.",
      "ja": "エンド・ツー・エンドのIPマルチキャストトラフィックは、2つの広告（およびその子会社/顧客）のネットワークを通過する場合には、両方の広告は、一貫したトラフィック管理ポリシーに同意しなければなりません。例えば、AD-1のソース非輻輳アウェアIPマルチキャストトラフィックとAD-2はそれを他のインターネットのトラフィック（混雑の対象）と共有リンクの間で、ベストエフォートトラフィックを伝送する場合、これは動作しません。混雑の下、いくつかのそのトラフィックの量は、多くの場合、AD-2でネットワークを詰まら復号できないゴミとして残りのパケットをレンダリング、削除されます。このトラフィックが混雑認識していないので、損失がこのレートを減らすことはありません。競合するトラフィックが混雑の下で公正な取り分を得ることはありません、とのEUは、そのIPマルチキャストトラフィックと他の（例えば、TCP）トラフィックの両方の極端に悪い品質でイライラされます。 - 例えば、従来のAD-1が非レート適応ユニキャストトラフィックを送信した場合の問題は、同じように可能性が起こるでしょう：これはIPマルチキャスト技術の問題ではなく、単にトランスポート層/アプリケーション層の問題であることに注意してくださいまた、典型的には非輻輳を認識しているIPTV、ビデオ・オン・デマンド交通、。 IPユニキャストビデオでレート適応が原因ABR（アダプティブビットレート）ビデオの利用可能性に今日一般的であるので、これがIPユニキャストと現実に起こるのだろうということはほとんどありませんので注意してください。"
    },
    {
      "indent": 3,
      "text": "While the rules for traffic management apply whether IP multicast is tunneled or not, the one feature that can make AMT tunnels more difficult is the unpredictability of bandwidth requirements across underlying links because of the way they can be used: with native IP multicast or GRE tunnels, the amount of bandwidth depends on the amount of content -- not the number of EUs -- and is therefore easier to plan for. AMT tunnels terminating in the EU/G, on the other hand, scale with the number of EUs. In the vicinity of the AMT relay, they can introduce a very large amount of replicated traffic, and it is not always feasible to provision enough bandwidth for all possible EUs to get the highest quality for all their content during peak utilization in such setups -- unless the AMT relays are very close to the EU edge. Therefore, it is also recommended that IP multicast rate adaptation be used, even inside controlled networks, when using AMT tunnels directly to the EU/G.",
      "ja": "トラフィック管理のためのルールは、IPマルチキャストがトンネリングさか、AMTのトンネルをより困難にすることができます一つの特徴があるため、彼らが使用することができる方法の根底にあるリンク間の帯域幅要件の予測不可能であるされているかどうかを適用中：ネイティブIPマルチキャストまたはGREトンネルでないのEUの数 -   - 、帯域幅の量は、コンテンツの量に依存するために計画する方が簡単です。 AMTトンネルはのEUの数と、他方で、EU / Gでスケールを終了します。 AMTリレーの近傍には、彼らは、複製されたトラフィックの非常に大きな量を導入することができ、そしてそれは、このようなセットアップでピーク利用時のすべてのコンテンツのための最高の品質を得るために可能なすべてのEUのために常に準備に十分な帯域幅には不可能です - AMTリレーしない限り、EUのエッジに非常に近いです。したがって、また、EU / Gに直接AMTトンネルを使用する場合にIPマルチキャストレート適応をも制御ネットワークの内部で、使用することが推奨されます。"
    },
    {
      "indent": 3,
      "text": "Note that rate-adaptive IP multicast traffic in general does not mean that the sender is reducing the bitrate but rather that the EUs that experience congestion are joining to a lower-bitrate (S,G) stream of the content, similar to ABR streaming over TCP. Therefore, migration from a non-rate-adaptive bitrate to a rate-adaptive bitrate in IP multicast will also change the dynamic (S,G) join behavior in the network, resulting in potentially higher performance requirements for IP multicast protocols (IGMP/PIM), especially on the last hops where dynamic changes occur (including AMT gateways/relays): in non-rate-adaptive IP multicast, only \"channel change\" causes state change, but in rate-adaptive multicast, congestion also causes state change.",
      "ja": "一般的にはその速度適応型IPマルチキャストトラフィックは、送信者が、ビットレートを削減していることではなく、むしろのEUは、経験の混雑が終わっストリーミングABRと同様の内容の低ビットレート（S、G）ストリームに参加していることをことを意味するものではありません注意してくださいTCP。したがって、動的（S、G）が変更されるIPマルチキャストにおけるレート適応型ビットレート非レート適応ビットレートからの移行は、IPマルチキャストプロトコル（IGMP / PIMのための潜在的により高い性能要件をもたらす、ネットワーク内の行動に参加します）、特にAMTゲートウェイ/リレーなどの動的な変更が発生し、最後のホップ（）上：非レート適応型IPマルチキャストでは、唯一の「チャンネル変更は、」状態変化を引き起こすが、レート適応型マルチキャストでは、輻輳は、状態変化を引き起こします。"
    },
    {
      "indent": 3,
      "text": "Even though not fully specified in this document, peerings that rely on GRE/AMT tunnels may be across one or more transit ADs instead of an exclusive (non-shared, L1/L2) path. Unless those transit ADs are explicitly contracted to provide other than \"best effort\" transit for the tunneled traffic, the tunneled IP multicast traffic must be rate adaptive in order to not violate BCP 41 across those transit ADs.",
      "ja": "完全にこの文書で指定されていないにもかかわらず、AMT GRE /トンネルに頼るピアリング代わりに排他的（非共有、L1 / L2）経路の一つ以上のトランジットの広告であってもよいです。これらのトランジット広告が明示的にトンネルトラフィックのための「ベストエフォート」のトランジット以外に提供する契約を結んでいる場合を除き、トンネリングされたIPマルチキャストトラフィックは、これらのトランジットの広告全体でBCP 41に違反していないために、レート適応でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2. Routing Aspects and Related Guidelines",
      "section_title": true,
      "ja": "4.2。ルーティング態様および関連ガイドライン"
    },
    {
      "indent": 3,
      "text": "The main objective for multicast delivery routing is to ensure that the EU receives the multicast stream from the \"most optimal\" source [INF_ATIS_10], which typically:",
      "ja": "マルチキャスト配信ルーティングのための主な目的は、EUは、典型的には、「最適な」ソース[INF_ATIS_10]からマルチキャストストリームを受信することを保証することです。"
    },
    {
      "indent": 3,
      "text": "o Maximizes the multicast portion of the transport and minimizes any unicast portion of the delivery, and",
      "ja": "Oは、輸送のマルチキャスト部分を最大化および送達の任意のユニキャスト部分を最小限に抑え、かつ"
    },
    {
      "indent": 3,
      "text": "o Minimizes the overall combined route distance of the network(s).",
      "ja": "Oは、ネットワーク（複数可）の全体的な合成経路の距離を最小化します。"
    },
    {
      "indent": 3,
      "text": "This routing objective applies to both native multicast and AMT; the actual methodology of the solution will be different for each. Regardless, the routing solution is expected to:",
      "ja": "このルーティング目的は、ネイティブマルチキャストとAMTの両方に適用されます。ソリューションの実際の方法は、それぞれ異なります。かかわらず、ルーティングソリューションが期待されています。"
    },
    {
      "indent": 3,
      "text": "o Be scalable,",
      "ja": "Oスケーラブルで、"
    },
    {
      "indent": 3,
      "text": "o Avoid or minimize new protocol development or modifications, and",
      "ja": "O避けるか、または新しいプロトコルの開発や修正を最小限にし、"
    },
    {
      "indent": 3,
      "text": "o Be robust enough to achieve high reliability and to automatically adjust to changes and problems in the multicast infrastructure.",
      "ja": "O、高い信頼性を実現するために、自動的にマルチキャストインフラの変化や問題に適応するのに十分な堅牢で。"
    },
    {
      "indent": 3,
      "text": "For both native and AMT environments, having a source as close as possible to the EU network is most desirable; therefore, in some cases, an AD may prefer to have multiple sources near different peering points. However, that is entirely an implementation issue.",
      "ja": "ネイティブおよびAMT両方の環境のために、EUのネットワークにできるだけ近い源を有することが最も望ましいです。従って、いくつかのケースでは、ADは、異なるピアリングポイントの近くに複数のソースを持っていることを好むことができます。しかし、それは完全に実装の問題です。"
    },
    {
      "indent": 0,
      "text": "4.2.1. Native Multicast Routing Aspects",
      "section_title": true,
      "ja": "4.2.1。ネイティブマルチキャストルーティングの側面"
    },
    {
      "indent": 3,
      "text": "Native multicast simply requires that the administrative domains coordinate and advertise the correct source address(es) at their network interconnection peering points (i.e., BRs). An example of multicast delivery via a native multicast process across two administrative domains is as follows, assuming that the interconnecting peering points are also multicast enabled:",
      "ja": "ネイティブマルチキャストは単に管理ドメイン座標およびそのネットワーク相互接続のピアリングポイント（すなわち、のBR）で正しいソースアドレスを広告することを必要とします。ポイントをピアリング相互接続は、マルチキャスト有効になっていると仮定すると、次のように2つの管理ドメイン間ネイティブマルチキャストプロセスを介してマルチキャスト配信の例を示します。"
    },
    {
      "indent": 3,
      "text": "o Appropriate information is obtained by the EU client, who is a subscriber to AD-2 (see Use Case 3.1). This information is in the form of metadata, and it contains instructions directing the EU client to launch an appropriate application if necessary, as well as additional information for the application about the source location and the group (or stream) ID in the form of (S,G) data. The \"S\" portion provides the name or IP address of the source of the multicast stream. The metadata may also contain alternate delivery information, such as specifying the unicast address of the stream.",
      "ja": "O適切な情報をAD-2の加入者であるEUのクライアント、（ユースケース3.1を参照）することによって得られます。この情報は、メタデータの形態であり、それはEUクライアントを導く命令は（の形でソース位置及びグループ（またはストリーム）IDに関するアプリケーションのために必要に応じて適切なアプリケーションを起動し、ならびに追加情報を含んでいますS、G）データ。 「S」の部分は、マルチキャストストリームのソースの名前またはIPアドレスを提供します。メタデータはまた、そのようなストリームのユニキャストアドレスを指定するような代替配信情報を含むことができます。"
    },
    {
      "indent": 3,
      "text": "o The client uses the join message with (S,G) to join the multicast stream [RFC4604]. To facilitate this process, the two ADs need to do the following:",
      "ja": "Oクライアントは、マルチキャストストリーム[RFC4604]を参加する（S、G）と参加メッセージを使用します。このプロセスを容易にするために、2つの広告は以下を実行する必要があります。"
    },
    {
      "indent": 6,
      "text": "* Advertise the source ID(s) over the peering points.",
      "ja": "*ピアリング・ポイント上のソースID（複数可）をアドバタイズ。"
    },
    {
      "indent": 6,
      "text": "* Exchange such relevant peering point information as capacity and utilization.",
      "ja": "*交換容量と使用率などの関連ピアリングポイント情報。"
    },
    {
      "indent": 6,
      "text": "* Implement compatible multicast protocols to ensure proper multicast delivery across the peering points.",
      "ja": "*ピアリングポイント間で適切なマルチキャスト配信を保証するために、互換性のあるマルチキャストプロトコルを実装します。"
    },
    {
      "indent": 0,
      "text": "4.2.2. GRE Tunnel over Interconnecting Peering Point",
      "section_title": true,
      "ja": "4.2.2。インターコネクティングピアリングポイント以上GREトンネル"
    },
    {
      "indent": 3,
      "text": "If the interconnecting peering point is not multicast enabled and both ADs are multicast enabled, then a simple solution is to provision a GRE tunnel between the two ADs; see Use Case 3.2 (Section 3.2). The termination points of the tunnel will usually be a network engineering decision but generally will be between the BRs or even between the AD-2 BR and the AD-1 source (or source access router). The GRE tunnel would allow end-to-end native multicast or AMT multicast to traverse the interface. Coordination and advertisement of the source IP are still required.",
      "ja": "相互接続ピアリングポイントがマルチキャストに対応しておらず、両方の広告がマルチキャスト有効になっている場合は、簡単な解決策を提供2つの広告の間にGREトンネルです。ユースケース3.2（3.2節）を参照してください。トンネルの終端点は、通常、ネットワークエンジニアリング決定であろうが、一般のBRとの間に、あるいはAD-2 BR及びAD-1ソース（またはソースアクセスルータ）の間です。 GREトンネルは、エンドツーエンドのネイティブマルチキャストまたはAMTマルチキャストインターフェイスを横断することを可能にします。ソースIPの調整と広告がまだ必要とされます。"
    },
    {
      "indent": 3,
      "text": "The two ADs need to follow the same process as the process described in Section 4.2.1 to facilitate multicast delivery across the peering points.",
      "ja": "2つの広告は、ピアリングポイント間でマルチキャスト配信を容易にするために、セクション4.2.1で説明した処理と同様の処理を実行する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.2.3. Routing Aspects with AMT Tunnels",
      "section_title": true,
      "ja": "4.2.3。 AMTトンネルを使ったルーティング側面"
    },
    {
      "indent": 3,
      "text": "Unlike native multicast (with or without GRE), an AMT multicast environment is more complex. It presents a two-layered problem in that there are two criteria that should be simultaneously met:",
      "ja": "（GREの有無にかかわらず）ネイティブマルチキャストとは異なり、AMTマルチキャスト環境はより複雑です。同時に満たされるべき2つの基準があるという点で、これは、2つの層の問題を提起します："
    },
    {
      "indent": 3,
      "text": "o Find the closest AMT relay to the EU that also has multicast connectivity to the content source, and",
      "ja": "Oまた、コンテンツソースへのマルチキャスト接続性を持っているEUに最も近いAMTリレーを検索し、"
    },
    {
      "indent": 3,
      "text": "o Minimize the AMT unicast tunnel distance.",
      "ja": "O AMTユニキャストトンネル距離を最小化。"
    },
    {
      "indent": 3,
      "text": "There are essentially two components in the AMT specification:",
      "ja": "AMT仕様での2つのコンポーネントが基本的にあります。"
    },
    {
      "indent": 3,
      "text": "AMT relays: These serve the purpose of tunneling UDP multicast traffic to the receivers (i.e., endpoints). The AMT relay will receive the traffic natively from the multicast media source and will replicate the stream on behalf of the downstream AMT gateways, encapsulating the multicast packets into unicast packets and sending them over the tunnel toward the AMT gateways. In addition, the AMT relay may collect various usage and activity statistics. This results in moving the replication point closer to the EU and cuts down on traffic across the network. Thus, the linear costs of adding unicast subscribers can be avoided. However, unicast replication is still required for each requesting endpoint within the unicast-only network.",
      "ja": "AMTリレー：これらは、受信機（すなわち、エンドポイント）にUDPマルチキャストトラフィックをトンネリングする目的を果たします。 AMTリレーは、ユニキャストパケットにマルチキャストパケットをカプセル化し、AMTゲートウェイに向かってトンネルを介してそれらを送信し、マルチキャストメディアソースからのネイティブトラフィックを受信し、下流AMTゲートウェイに代わってストリームを複製します。また、AMTリレーは、様々な使用状況およびアクティビティ統計情報を収集することがあります。これは近いEUへのレプリケーションポイントを移動することになり、ネットワーク上のトラフィックが削減します。このように、ユニキャストの加入者を追加する線形コス​​トを回避することができます。しかし、ユニキャスト複製はまだユニキャストのみのネットワーク内の各要求のエンドポイントのために必要とされます。"
    },
    {
      "indent": 3,
      "text": "AMT gateway: The gateway will reside on an endpoint; this could be any type of IP host, such as a Personal Computer (PC), mobile phone, Set-Top Box (STB), or appliances. The AMT gateway receives join and leave requests from the application via an Application Programming Interface (API). In this manner, the gateway allows the endpoint to conduct itself as a true multicast endpoint. The",
      "ja": "AMTゲートウェイ：ゲートウェイは、エンドポイントに常駐します。これは、パーソナルコンピュータ（PC）、携帯電話、セットトップボックス（STB）、またはアプライアンスとしてIPホスト、任意のタイプである可能性があります。 AMTゲートウェイが参加し、アプリケーション・プログラミング・インターフェース（API）を介してアプリケーションからの要求を残す受信します。このように、ゲートウェイは、エンドポイントが真のマルチキャストエンドポイントとして自身を行うことを可能にします。ザ・"
    },
    {
      "indent": 6,
      "text": "AMT gateway will encapsulate AMT messages into UDP packets and send them through a tunnel (across the unicast-only infrastructure) to the AMT relay.",
      "ja": "AMTゲートウェイがUDPパケットにAMTメッセージをカプセル化し、AMTリレーに（ユニキャスト専用インフラストラクチャ全体）トンネルを介してそれらを送信します。"
    },
    {
      "indent": 3,
      "text": "The simplest AMT use case (Section 3.3) involves peering points that are not multicast enabled between two multicast-enabled ADs. An AMT tunnel is deployed between an AMT relay on the AD-1 side of the peering point and an AMT gateway on the AD-2 side of the peering point. One advantage of this arrangement is that the tunnel is established on an as-needed basis and need not be a provisioned element. The two ADs can coordinate and advertise special AMT relay anycast addresses with, and to, each other. Alternately, they may decide to simply provision relay addresses, though this would not be an optimal solution in terms of scalability.",
      "ja": "最も単純なAMTユースケース（セクション3.3）マルチキャスト2つのマルチキャスト対応ADS間で有効にされていない点をピアリング含みます。 AMTトンネルは、ピアリングポイントのAD-1側にAMTリレーとピアリングポイントのAD-2側にAMTゲートウェイとの間に配備されています。この構成の一つの利点は、トンネルは、必要に応じて確立され、プロビジョニング要素である必要はないということです。 2つの広告座標と宣伝特別AMTリレーエニーキャストアドレスを用いて、そしてお互いにすることができます。代わりに、彼らは、これは、スケーラビリティの面で最適な解決策ではないでしょうけれども、単に規定は、アドレスを中継するように決定することができます。"
    },
    {
      "indent": 3,
      "text": "Use Cases 3.4 and 3.5 describe AMT situations that are more complicated, as AD-2 is not multicast enabled in these two cases. For these cases, the EU device needs to be able to set up an AMT tunnel in the most optimal manner. There are many methods by which relay selection can be done, including the use of DNS-based queries and static lookup tables [RFC7450]. The choice of the method is implementation dependent and is up to the network operators. Comparison of various methods is out of scope for this document and is left for further study.",
      "ja": "AD-2は、これら2つの場合に有効にマルチキャストされていないとして、より複雑であるAMT状況について説明ケース3.4および3.5を使用してください。これらのケースについては、EUデバイスは、最も最適な方法でAMTトンネルを設定できるようにする必要があります。 DNSベースのクエリと静的なルックアップテーブル[RFC7450]の使用を含むリレーの選択を行うことができたことで、多くの方法があります。方法の選択は、実装に依存しており、ネットワークオペレータに任されています。様々な方法の比較はこの文書の範囲外であると、さらなる研究のために残されています。"
    },
    {
      "indent": 3,
      "text": "An illustrative example of a relay selection based on DNS queries as part of an anycast IP address process is described here for Use Cases 3.4 and 3.5 (Sections 3.4 and 3.5). Using an anycast IP address for AMT relays allows all AMT gateways to find the \"closest\" AMT relay -- the nearest edge of the multicast topology of the source. Note that this is strictly illustrative; the choice of the method is up to the network operators. The basic process is as follows:",
      "ja": "エニーキャストIPアドレスプロセスの一部として、DNSクエリに基づいて、中継選択の例示的な例は、ユースケース3.4および3.5（セクション3.4および3.5）のためにここに記載されています。ソースのマルチキャストトポロジの最も近いエッジ -  AMTリレーのエニーキャストIPアドレスを使用すると、すべてのAMTゲートウェイは、「最も近い」AMTリレーを見つけることができます。これは厳密に例示するものであることに注意してください。方法の選択は、ネットワーク事業者に任されています。次のように基本的なプロセスは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Appropriate metadata is obtained by the EU client application. The metadata contains instructions directing the EU client to an ordered list of particular destinations to seek the requested stream and, for multicast, specifies the source location and the group (or stream) ID in the form of (S,G) data. The \"S\" portion provides the URI (name or IP address) of the source of the multicast stream, and the \"G\" identifies the particular stream originated by that source. The metadata may also contain alternate delivery information such as the address of the unicast form of the content to be used -- for example, if the multicast stream becomes unavailable.",
      "ja": "O適切なメタデータは、EUクライアントアプリケーションによって得られます。メタデータは、マルチキャストのために、（S、G）データの形式のソースの場所とグループ（またはストリーム）IDを指定し、要求されたストリームを追求するために、特定の目的地の順序リストにEUクライアントを指示命令が含まれます。 「S」部分は、マルチキャストストリームのソースのURI（名前またはIPアドレス）を提供し、「G」は、そのソースが発信特定のストリームを識別する。メタデータはまた、使用されるコンテンツのユニキャスト形式のアドレスとして代替配信情報を含んでいてもよい - 例えば、マルチキャストストリームが使用できなくなった場合。"
    },
    {
      "indent": 3,
      "text": "o Using the information from the metadata and, possibly, information provisioned directly in the EU client, a DNS query is initiated in order to connect the EU client / AMT gateway to an AMT relay.",
      "ja": "、おそらく、EUクライアントに直接プロビジョニング情報をメタデータからの情報を使用してO、DNSクエリがAMTリレーにEUクライアント/ AMTゲートウェイを接続するために開始されます。"
    },
    {
      "indent": 3,
      "text": "o Query results are obtained and may return an anycast address or a specific unicast address of a relay. Multiple relays will typically exist. The anycast address is a routable \"pseudo-address\" shared among the relays that can gain multicast access to the source.",
      "ja": "Oクエリ結果が得られ、エニーキャストアドレス又はリレーの特定のユニキャストアドレスを返すことができます。複数のリレーは一般的に存在します。エニーキャストアドレスは、ソースへのマルチキャストアクセスできるリレーで共有ルーティング可能な「擬似アドレス」です。"
    },
    {
      "indent": 3,
      "text": "o If a specific IP address unique to a relay was not obtained, the AMT gateway then sends a message (e.g., the discovery message) to the anycast address such that the network is making the routing choice of a particular relay, e.g., the relay that is closest to the EU. Details are outside the scope of this document. See [RFC4786].",
      "ja": "リレーに固有の特定のIPアドレスが得られなかった場合はO、AMTゲートウェイは、次にリレー、例えば、ネットワークが特定の中継の経路選択を行っているようなエニーキャストアドレスへのメッセージ（例えば、ディスカバリメッセージ）を送信しますそれは、EUに最も近いです。詳細は、このドキュメントの範囲外です。 [RFC4786]を参照してください。"
    },
    {
      "indent": 3,
      "text": "o The contacted AMT relay then returns its specific unicast IP address (after which the anycast address is no longer required). Variations may exist as well.",
      "ja": "（エニーキャストアドレスがもはや必要とされた後に）接触AMTリレーは、その特定のユニキャストIPアドレスを返し、O。バリエーションも同様に存在してもよいです。"
    },
    {
      "indent": 3,
      "text": "o The AMT gateway uses that unicast IP address to initiate a three-way handshake with the AMT relay.",
      "ja": "O AMTゲートウェイは、ユニキャストIPアドレスがAMTリレーとのスリーウェイハンドシェイクを開始することを使用します。"
    },
    {
      "indent": 3,
      "text": "o The AMT gateway provides the (S,G) information to the AMT relay (embedded in AMT protocol messages).",
      "ja": "AMTゲートウェイはAMTリレーへの（S、G）情報を提供するO（AMTプロトコルメッセージに埋め込まれました）。"
    },
    {
      "indent": 3,
      "text": "o The AMT relay receives the (S,G) information and uses it to join the appropriate multicast stream, if it has not already subscribed to that stream.",
      "ja": "O AMTリレーは（S、G）情報を受信し、それが既にそのストリームに加入していない場合、適切なマルチキャストストリームを結合するためにそれを使用します。"
    },
    {
      "indent": 3,
      "text": "o The AMT relay encapsulates the multicast stream into the tunnel between the relay and the gateway, providing the requested content to the EU.",
      "ja": "O AMTリレーは、EUに要求されたコンテンツを提供するリレーとゲートウェイとの間のトンネルにマルチキャストストリームをカプセル化します。"
    },
    {
      "indent": 0,
      "text": "4.2.4. Public Peering Routing Aspects",
      "section_title": true,
      "ja": "4.2.4。公共ピアリングルーティング側面"
    },
    {
      "indent": 3,
      "text": "Figure 6 shows an example of a broadcast peering point.",
      "ja": "図6は、ブロードキャスト・ピアリング・ポイントの例を示しています。"
    },
    {
      "indent": 13,
      "text": " AD-1a            AD-1b\n BR                BR\n  |                 |\n--+-+---------------+-+-- broadcast peering point LAN\n    |                 |\n    BR               BR\n   AD-2a            AD-2b",
      "raw": true
    },
    {
      "indent": 21,
      "text": "Figure 6: Broadcast Peering Point",
      "ja": "図6：ブロードキャストピアリングポイント"
    },
    {
      "indent": 3,
      "text": "A broadcast peering point is an L2 subnet connecting three or more ADs. It is common in IXPs and usually consists of Ethernet switch(es) operated by the IXP connecting to BRs operated by the ADs.",
      "ja": "放送ピアリング・ポイントは、3つ以上の広告を接続L2サブネットです。それのIXPに一般的であり、通常は広告で操作のBRに接続IXPによって操作イーサネットスイッチ（ES）からなります。"
    },
    {
      "indent": 3,
      "text": "In an example setup domain, AD-2a peers with AD-1a and wants to receive IP multicast from it. Likewise, AD-2b peers with AD-1b and wants to receive IP multicast from it.",
      "ja": "AD-1aに例のセットアップドメイン、AD-2Aピアで、そこからIPマルチキャストを受信したいです。 AD-1Bと同様に、AD-2bの仲間とそれからIPマルチキャストを受信したいです。"
    },
    {
      "indent": 3,
      "text": "Assume that one or more IP multicast (S,G) traffic streams can be served by both AD-1a and AD-1b -- for example, because both AD-1a and AD-1b contact this content from the same content source.",
      "ja": "1つまたは複数のIPマルチキャスト（S、G）トラフィックストリームはAD-1aおよびAD-1Bの両方によってサービスすることができると仮定 - 例えば、同じコンテンツソースからAD-1aおよびAD-1Bの接触両方このコンテンツため。"
    },
    {
      "indent": 3,
      "text": "In this case, AD-2a and AD-2b can no longer control which upstream domain -- AD-1a or AD-1b -- will forward this (S,G) into the LAN. The AD-2a BR requests the (S,G) from the AD-1a BR, and the AD-2b BR requests the same (S,G) from the AD-1b BR. To avoid duplicate packets, an (S,G) can be forwarded by only one router onto the LAN; PIM-SM / PIM-SSM detects requests for duplicate transmissions and resolves them via the so-called \"assert\" protocol operation, which results in only one BR forwarding the traffic. Assume that this is the AD-1a BR. AD-2b will then receive unexpected multicast traffic from a provider with whom it does not have a mutual agreement for that traffic. Quality issues in EUs behind AD-2b caused by AD-1a will cause a lot of issues related to responsibility and troubleshooting.",
      "ja": "この場合、AD-2aおよびAD-2Bもはや制御上流のドメインができる -  AD-1AまたはAD-1B  - は、LANにこの（S、G）を転送します。 AD-2AのBRは、AD-1aはBRから（S、G）を要求し、AD-2BのBRは、AD-1BのBRから同一の（S、G）を要求します。重複パケットを避けるため、（S、G）は、LAN上に一つだけのルータによって転送することができます。 PIM-SM / PIM-SSMは、重複送信の要求を検出し、トラフィックを転送するだけで1 BRになり、いわゆる「主張」プロトコルの動作を介して、それらを解決します。これはAD-1aはBRであると仮定する。 AD-2bは、それがそのトラフィックのために相互の合意を持っていない人とプロバイダからの予期しないマルチキャストトラフィックを受信します。 AD-1Aによって引き起こさAD-2Bの後ろのEUにおける品質上の問題は責任およびトラブルシューティングに関連する問題の多くが発生します。"
    },
    {
      "indent": 3,
      "text": "In light of these technical issues, we describe, via the following options, how IP multicast can be carried across broadcast peering point LANs:",
      "ja": "これらの技術的な問題に鑑み、我々はIPマルチキャストは、ブロードキャストピアリングポイントのLAN間で行うことができるか、以下のオプションを経由して、説明します。"
    },
    {
      "indent": 3,
      "text": "1. IP multicast is tunneled across the LAN. Any of the GRE/AMT tunneling solutions mentioned in this document are applicable. This is the one case where a GRE tunnel between the upstream BR (e.g., AD-1a) and downstream BR (e.g., AD-2a) is specifically recommended, as opposed to tunneling across uBRs (which are not the actual BRs).",
      "ja": "1. IPマルチキャストは、LAN経由でトンネリングされます。この文書に記載されたGRE / AMTトンネリングソリューションのいずれかが適用されます。これは、（実際のBRはない）uBRs横切っトンネリングとは対照的に、上流BR（例えば、AD-1a）および下流BR間のGREトンネルが（例えば、AD-2a）は、具体的に、推奨される一つのケースです。"
    },
    {
      "indent": 3,
      "text": "2. The LAN has only one upstream AD that is sourcing IP multicast, and native IP multicast is used. This is an efficient way to distribute the same IP multicast content to multiple downstream ADs. Misbehaving downstream BRs can still disrupt the delivery of IP multicast from the upstream BR to other downstream BRs; therefore, strict rules must be followed to prohibit such a case. The downstream BRs must ensure that they will always consider only the upstream BR as a source for multicast traffic: e.g., no BGP SAFI-2 peerings between the downstream ADs across the peering point LAN, so that the upstream BR is the only possible next hop reachable across this LAN. Also, routing policies can be configured to avoid falling back to using SAFI-1 (unicast) routes for IP multicast if unicast BGP peering is not limited in the same way.",
      "ja": "2. LANは、IPマルチキャストを供給している唯一の上流ADを有し、そしてネイティブIPマルチキャストが使用されます。これは、複数の下流の広告に同じIPマルチキャストコンテンツを配信するための効率的な方法です。さらに他の下流のBR上流BRからIPマルチキャストの配信を中断させることができ、下流のBRを誤動作。従って、厳密なルールは、このような場合を禁止するために従わなければなりません。下流のBRは、彼らが常にマルチキャストトラフィックのソースとしてのみ上流BRを検討することを確認する必要があります。例えば、ピアリングポイント間で下流ADの間にはBGP SAFI-2ピアリングないLAN、上流BRが唯一可能な次のホップであるようにこのLAN上で接続可能。また、ルーティングポリシーはSAFI-1（ユニキャスト）ユニキャストBGPピアリングは、同じように限定されるものではない場合にIPマルチキャスト用のルートを使用してフォールバックを回避するように構成することができます。"
    },
    {
      "indent": 3,
      "text": "3. The LAN has multiple upstream ADs, but they are federated and agree on a consistent policy for IP multicast traffic across the LAN. One policy is that each possible source is only announced by one upstream BR. Another policy is that sources are redundantly announced (the problematic case mentioned in the example in Figure 6 above), but the upstream domains also provide mutual operational insight to help with troubleshooting (outside the scope of this document).",
      "ja": "3. LANは、複数の上流の広告を持っていますが、彼らは、連合であり、LAN経由でIPマルチキャストトラフィックの一貫したポリシーに同意します。一つのポリシーは、それぞれの可能なソースが一つだけ上流BRが発表されていることです。別のポリシーは、ソースが重複（上記図6の例で述べた問題の場合）に発表されていることであるが、上流のドメインはまた、（本文書の範囲外）トラブルシューティングに役立つ相互運用洞察を提供します。"
    },
    {
      "indent": 0,
      "text": "4.3. Back-Office Functions - Provisioning and Logging Guidelines",
      "section_title": true,
      "ja": "4.3。バックオフィス機能 - プロビジョニングおよびロギングのガイドライン"
    },
    {
      "indent": 3,
      "text": "\"Back office\" refers to the following:",
      "ja": "「バックオフィス」とは、以下を参照します。"
    },
    {
      "indent": 3,
      "text": "o Servers and content-management systems that support the delivery of applications via multicast and interactions between ADs.",
      "ja": "Oサーバと広告との間のマルチキャストとの相互作用を介してアプリケーションの配信をサポートするコンテンツ管理システム。"
    },
    {
      "indent": 3,
      "text": "o Functionality associated with logging, reporting, ordering, provisioning, maintenance, service assurance, settlement, etc.",
      "ja": "O機能は、ロギング、レポート作成、発注、プロビジョニング、メンテナンス、サービス保証、決済などに関連付けられています"
    },
    {
      "indent": 0,
      "text": "4.3.1. Provisioning Guidelines",
      "section_title": true,
      "ja": "4.3.1。プロビジョニングのガイドライン"
    },
    {
      "indent": 3,
      "text": "Resources for basic connectivity between ADs' providers need to be provisioned as follows:",
      "ja": "広告のプロバイダ間の基本的な接続のためのリソースは、次のようにプロビジョニングする必要があります。"
    },
    {
      "indent": 3,
      "text": "o Sufficient capacity must be provisioned to support multicast-based delivery across ADs.",
      "ja": "O十分な容量は、ADS間でマルチキャストベースの配信をサポートするためにプロビジョニングする必要があります。"
    },
    {
      "indent": 3,
      "text": "o Sufficient capacity must be provisioned for connectivity between all supporting back offices of the ADs as appropriate. This includes activating proper security treatment for these back-office connections (gateways, firewalls, etc.) as appropriate.",
      "ja": "O十分な容量は、必要に応じて広告をすべてのバックサポートオフィス間の接続用にプロビジョニングされなければなりません。これは、必要に応じて、これらのバックオフィス接続（ゲートウェイ、ファイアウォールなど）のための適切なセキュリティ処理をアクティブに含まれています。"
    },
    {
      "indent": 3,
      "text": "Provisioning aspects related to multicast-based inter-domain delivery are as follows.",
      "ja": "次のようにマルチキャストベースのドメイン間の配信に関連するプロビジョニングの側面があります。"
    },
    {
      "indent": 3,
      "text": "The ability to receive a requested application via multicast is triggered via receipt of the necessary metadata. Hence, this metadata must be provided to the EU regarding the multicast URL -- and unicast fallback if applicable. AD-2 must enable the delivery of this metadata to the EU and provision appropriate resources for this purpose.",
      "ja": "マルチキャストを介して要求されたアプリケーションを受信する能力が必要なメタデータの受信を介してトリガされます。該当する場合と、ユニキャストフォールバック - したがって、このメタデータは、マルチキャストURLに関するEUに提供されなければなりません。 AD-2は、この目的のためにEUにこのメタデータの配信・提供、適切なリソースを有効にする必要があります。"
    },
    {
      "indent": 3,
      "text": "It is assumed that native multicast functionality is available across many ISP backbones, peering points, and access networks. If, however, native multicast is not an option (Use Cases 3.4 and 3.5), then:",
      "ja": "ネイティブマルチキャスト機能は、多くのISPバックボーン、ピアリングポイント、アクセスネットワーク全体で利用可能であると仮定されます。しかし、ネイティブマルチキャストオプション（ユースケース3.4および3.5）でない場合は、次のようにします。"
    },
    {
      "indent": 3,
      "text": "o The EU must have a multicast client to use AMT multicast obtained from either (1) the application source (per agreement with AD-1) or (2) AD-1 or AD-2 (if delegated by the application source).",
      "ja": "O EUはまたは（AD-1と契約あたり）のいずれか（1）アプリケーション・ソースから得られたAMTマルチキャストを使用するマルチキャストクライアントを有していなければならない（2）AD-1、AD-2（アプリケーション・ソースによって委任されている場合）。"
    },
    {
      "indent": 3,
      "text": "o If provided by AD-1 or AD-2, then the EU could be redirected to a client download site. (Note: This could be an application source site.) If provided by the application source, then this source would have to coordinate with AD-1 to ensure that the proper client is provided (assuming multiple possible clients).",
      "ja": "AD-1またはAD-2が提供する場合は、O、その後、EUは、クライアントのダウンロードサイトにリダイレクトすることができます。 （注：これは、アプリケーションのソースサイトとすることができる）アプリケーション・ソースによって提供される場合、このソースは適切なクライアントが（複数の可能なクライアントと仮定して）設けられていることを保証するためにAD-1と連携しなければなりません。"
    },
    {
      "indent": 3,
      "text": "o Where AMT gateways support different application sets, all AD-2 AMT relays need to be provisioned with all source and group addresses for streams it is allowed to join.",
      "ja": "AMTゲートウェイは異なるアプリケーションセットをサポートする場合は、O、すべてのAD-2 AMTリレーは、参加することを許可されたストリームのすべてのソースとグループアドレスをプロビジョニングする必要があります。"
    },
    {
      "indent": 3,
      "text": "o DNS across each AD must be provisioned to enable a client gateway to locate the optimal AMT relay (i.e., longest multicast path and shortest unicast tunnel) with connectivity to the content's multicast source.",
      "ja": "各ADを横切る入出力DNSは、コンテンツのマルチキャストソースへの接続との最適なAMTリレー（すなわち、最長マルチキャスト経路と最短ユニキャストトンネル）を見つけるために、クライアント・ゲートウェイを有効にするようにプロビジョニングされなければなりません。"
    },
    {
      "indent": 3,
      "text": "Provisioning aspects related to operations and customer care are as follows.",
      "ja": "次のように操作し、顧客ケアに関連するプロビジョニングの側面があります。"
    },
    {
      "indent": 3,
      "text": "It is assumed that each AD provider will provision operations and customer care access to their own systems.",
      "ja": "それは、自分のシステムに各ADプロバイダの意志提供業務と顧客ケアがアクセスすることを想定しています。"
    },
    {
      "indent": 3,
      "text": "AD-1's operations and customer care functions must be able to see enough of what is happening in AD-2's network or in the service provided by AD-2 to verify their mutual goals and operations, e.g., to know how the EUs are being served. This can be done in two ways:",
      "ja": "AD-1の業務と顧客ケア機能はEU群が提供されているかを知るために、例えば、AD-2のネットワークまたはそれらの相互の目標や操作を確認するために、AD-2が提供するサービスで何が起こっているのかを十分に見ることができなければなりません。これは、2つの方法で行うことができます。"
    },
    {
      "indent": 3,
      "text": "o Automated interfaces are built between AD-1 and AD-2 such that operations and customer care continue using their own systems. This requires coordination between the two ADs, with appropriate provisioning of necessary resources.",
      "ja": "O自動化インターフェイスは操作および顧客ケアが独自のシステムを使用し続けるように、AD-1、AD-2との間に構築されます。これは、必要なリソースの適切なプロビジョニングと、2つの広告間の調整が必要となります。"
    },
    {
      "indent": 3,
      "text": "o AD-1's operations and customer care personnel are provided direct access to AD-2's systems. In this scenario, additional provisioning in these systems will be needed to provide necessary access. The two ADs must agree on additional provisioning to support this option.",
      "ja": "O AD-1の業務と顧客ケア担当者はAD-2のシステムへの直接アクセスを提供しています。このシナリオでは、これらのシステムでは、追加のプロビジョニングは、必要なアクセスを提供するために必要とされるであろう。 2つの広告は、このオプションをサポートするために追加のプロビジョニングに同意しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3.2. Inter-domain Authentication Guidelines",
      "section_title": true,
      "ja": "4.3.2。ドメイン間の認証ガイドライン"
    },
    {
      "indent": 3,
      "text": "All interactions between pairs of ADs can be discovered and/or associated with the account(s) utilized for delivered applications. Supporting guidelines are as follows:",
      "ja": "広告対の間のすべての相互作用が発見され、および/または送達用途に利用アカウント（複数可）に関連付けることができます。次のようにサポートするガイドラインは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "o A unique identifier is recommended to designate each master account.",
      "ja": "O一意の識別子が各マスターアカウントを指定することをお勧めします。"
    },
    {
      "indent": 3,
      "text": "o AD-2 is expected to set up \"accounts\" (a logical facility generally protected by credentials such as login passwords) for use by AD-1. Multiple accounts, and multiple types or partitions of accounts, can apply, e.g., customer accounts, security accounts.",
      "ja": "O AD-2は、AD-1で使用するために、「アカウント」（一般的には、ログインパスワードなどの認証情報によって保護された論理機能）を設定することが予想されます。複数のアカウント、および複数の種類またはアカウントのパーティションは、例えば、顧客アカウント、セキュリティアカウントを適用することができます。"
    },
    {
      "indent": 3,
      "text": "The reason to specifically mention the need for AD-1 to initiate interactions with AD-2 (and use some account for that), as opposed to the opposite, is based on the recommended workflow initiated by customers (see Section 4.4): the customer contacts the content source, which is part of AD-1. Consequently, if AD-1 sees the need to escalate the issue to AD-2, it will interact with AD-2 using the aforementioned guidelines.",
      "ja": "顧客：特にAD-2との相互作用を開始する（そしてそのために、いくつかのアカウントを使用）するAD-1の必要性に言及する理由は、反対とは反対に、顧客によって開始推奨ワークフロー（セクション4.4を参照）に基づいていますコンタクトAD-1の一部であるコンテンツソース、。 AD-1は、AD-2に問題をエスカレートする必要性を見れば結果的に、それはAD-2は、前述のガイドラインを使用して対話します。"
    },
    {
      "indent": 0,
      "text": "4.3.3. Log-Management Guidelines",
      "section_title": true,
      "ja": "4.3.3。ログイン管理ガイドライン"
    },
    {
      "indent": 3,
      "text": "Successful delivery (in terms of user experience) of applications or content via multicast between pairs of interconnecting ADs can be improved through the ability to exchange appropriate logs for various workflows -- troubleshooting, accounting and billing, optimization of traffic and content transmission, optimization of content and application development, and so on.",
      "ja": "トラブルシューティング、課金および請求、トラフィック及びコンテンツ伝送の最適化の最適化 - 広告を相互接続する対の間のマルチキャストを介してアプリケーションやコンテンツの（ユーザ・エクスペリエンスの点で）成功した​​送達は、様々なワークフローのための適切なログを交換する能力を介して改善することができますコンテンツおよびアプリケーション開発など。"
    },
    {
      "indent": 3,
      "text": "Specifically, AD-1 take over primary responsibility for customer experience on behalf of the content source, with support from AD-2 as needed. The application/content owner is the only participant who has, and needs, full insight into the application level and can map the customer application experience to the network traffic flows -- which, with the help of AD-2 or logs from AD-2, it can then analyze and interpret.",
      "ja": "必要に応じて具体的には、AD-1は、AD-2からの支援を受けて、コンテンツソースの代わりに、顧客体験のための主要な責任を引き継ぎます。アプリケーション/コンテンツ所有者が持っている唯一の参加者である、とのニーズ、アプリケーションレベルへの完全な洞察力とネットワークトラフィックに、顧客のアプリケーション体験をマッピングすることができます流れ -  AD-2からAD-2またはログの助けを借りています、 、それはその後、分析し、解釈することができます。"
    },
    {
      "indent": 3,
      "text": "The main difference between unicast delivery and multicast delivery is that the content source can infer a lot more about downstream network problems from a unicast stream than from a multicast stream: the multicast stream is not per EU, except after the last replication, which is in most cases not in AD-1. Logs from the application, including the receiver side at the EU, can provide insight but cannot help to fully isolate network problems because of the IP multicast per-application operational state built across AD-1 and AD-2 (aka the (S,G) state and any other operational-state features, such as Diffserv QoS).",
      "ja": "ユニキャスト配信とマルチキャスト配信の主な違いは、コンテンツソースは、マルチキャストストリームからよりユニキャストストリームから下流のネットワークの問題について多くの詳細を推測できることです。マルチキャストストリームはである最後の複製、後を除いて、EUごとではありませんAD-1でほとんどのケースではありません。 EUでの受信機側などのアプリケーションからのログは、洞察力を提供することができますが、完全に（S、G別名（なぜならAD-1、AD-2間で構築されたIPマルチキャストアプリケーションごとの動作状態のネットワークの問題を特定するのに役立つことはできませんなどのDiffserv QoSなど）の状態と、他の運転状態の特徴、）。"
    },
    {
      "indent": 3,
      "text": "See Section 7 for more discussion regarding the privacy considerations of the model described here.",
      "ja": "ここで説明するモデルのプライバシーの考慮事項に関する詳細な議論については、セクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Different types of logs are known to help support operations in AD-1 when provided by AD-2. This could be done as part of AD-1/AD-2 contracts. Note that except for implied multicast-specific elements, the options listed here are not unique or novel for IP multicast, but they are more important for services novel to the operators than for operationally well-established services (such as unicast). We therefore detail them as follows:",
      "ja": "ログの異なるタイプのAD-2により提供された場合AD-1でサポート業務を支援することが知られています。これは、AD-1 / AD-2の契約の一環として行うことができます。暗黙のマルチキャスト固有の要素を除いて、ここに記載されているオプションは、IPマルチキャストのための一意または小説ではありませんが、彼らは（例えば、ユニキャストなど）運用上十分に確立サービスのためのより事業者へのサービスの小説のためのより重要であることに注意してください。したがって、我々は詳細にそれらを次のように："
    },
    {
      "indent": 3,
      "text": "o Usage information logs at an aggregate level.",
      "ja": "O使用情報は、集約レベルで記録します。"
    },
    {
      "indent": 3,
      "text": "o Usage failure instances at an aggregate level.",
      "ja": "集約レベルでO使用障害インスタンス。"
    },
    {
      "indent": 3,
      "text": "o Grouped or sequenced application access: performance, behavior, and failure at an aggregate level to support potential application-provider-driven strategies. Examples of aggregate levels include grouped video clips, web pages, and software-download sets.",
      "ja": "Oグループ化またはシーケンスされたアプリケーションへのアクセス：パフォーマンス、行動、および潜在的なアプリケーション・プロバイダー・ドリブン戦略をサポートするための集約レベルでの失敗。集計レベルの例としては、グループ化されたビデオクリップ、Webページ、およびソフトウェアのダウンロードセットが含まれます。"
    },
    {
      "indent": 3,
      "text": "o Security logs, aggregated or summarized according to agreement (with additional detail potentially provided during security events, by agreement).",
      "ja": "Oセキュリティログ、（潜在的に合意することによって、セキュリティイベント中に提供追加の詳細と共に）凝集又は契約に従ってまとめます。"
    },
    {
      "indent": 3,
      "text": "o Access logs (EU), when needed for troubleshooting.",
      "ja": "トラブルシューティングのために必要なOアクセスログ（EU）、。"
    },
    {
      "indent": 3,
      "text": "o Application logs (\"What is the application doing?\"), when needed for shared troubleshooting.",
      "ja": "Oのアプリケーションログ（「アプリケーションが何をしているのですか？」）、共有のトラブルシューティングのために必要。"
    },
    {
      "indent": 3,
      "text": "o Syslogs (network management), when needed for shared troubleshooting.",
      "ja": "共有のトラブルシューティングのために必要なのSyslog（ネットワーク管理）、O。"
    },
    {
      "indent": 3,
      "text": "The two ADs may supply additional security logs to each other, as agreed upon in contract(s). Examples include the following:",
      "ja": "契約（複数可）に合意したように、2つの広告が、互いに、追加のセキュリティログを供給することができます。例としては次のものがあります。"
    },
    {
      "indent": 3,
      "text": "o Information related to general security-relevant activity, which may be of use from a protection or response perspective: types and counts of attacks detected, related source information, related target information, etc.",
      "ja": "等検出された攻撃の種類や数、関連するソース情報、関連するターゲット情報：O情報が保護または応答の観点から有用であり得る一般的なセキュリティ関連の活動に関連します"
    },
    {
      "indent": 3,
      "text": "o Aggregated or summarized logs according to agreement (with additional detail potentially provided during security events, by agreement).",
      "ja": "O集約または要約ログ（潜在的に一致することにより、セキュリティイベント、中に提供される追加のディテール）契約に従います。"
    },
    {
      "indent": 0,
      "text": "4.4. Operations - Service Performance and Monitoring Guidelines",
      "section_title": true,
      "ja": "4.4。オペレーション - サービスのパフォーマンスと監視のガイドライン"
    },
    {
      "indent": 3,
      "text": "\"Service performance\" refers to monitoring metrics related to multicast delivery via probes. The focus is on the service provided by AD-2 to AD-1 on behalf of all multicast application sources (metrics may be specified for SLA use or otherwise). Associated guidelines are as follows:",
      "ja": "「サービス性能」は、プローブを介してマルチキャスト配信に関連するメトリックを監視することをいいます。焦点は、すべてのマルチキャストアプリケーションソース（メトリックはSLAの使用のためにまたは他の方法で指定することができる）の代わりにAD-1、AD-2が提供するサービスです。次のように関連するガイドラインは以下のとおりです。"
    },
    {
      "indent": 3,
      "text": "o Both ADs are expected to monitor, collect, and analyze service performance metrics for multicast applications. AD-2 provides relevant performance information to AD-1; this enables AD-1 to create an end-to-end performance view on behalf of the multicast application source.",
      "ja": "Oどちらの広告は、監視、収集、およびマルチキャストアプリケーションのためのサービス・パフォーマンス・メトリックを分析することが期待されています。 AD-2は、AD-1に関連するパフォーマンス情報を提供します。これは、マルチキャストアプリケーションのソースの代わりにエンドツーエンドのパフォーマンス・ビューを作成するために、AD-1を可能にします。"
    },
    {
      "indent": 3,
      "text": "o Both ADs are expected to agree on the types of probes to be used to monitor multicast delivery performance. For example, AD-2 may permit AD-1's probes to be utilized in the AD-2 multicast service footprint. Alternately, AD-2 may deploy its own probes and relay performance information back to AD-1.",
      "ja": "O両方の広告は、マルチキャスト配信のパフォーマンスを監視するために使用されるプローブの種類に同意することが期待されます。例えば、AD-2は、AD-2マルチキャストサービスのフットプリントに利用されるAD-1のプローブを可能にすることができます。あるいは、AD-2は、独自のプローブを展開することができ、バックAD-1の性能情報を中継します。"
    },
    {
      "indent": 3,
      "text": "\"Service monitoring\" generally refers to a service (as a whole) provided on behalf of a particular multicast application source provider. It thus involves complaints from EUs when service problems occur. EUs direct their complaints to the source provider; the source provider in turn submits these complaints to AD-1. The responsibility for service delivery lies with AD-1; as such, AD-1 will need to determine where the service problem is occurring -- in its own network or in AD-2. It is expected that each AD will have tools to monitor multicast service status in its own network.",
      "ja": "「サービスの監視」は、一般に、特定のマルチキャストアプリケーションのソースプロバイダに代わって提供さ（全体としての）サービスを指します。サービスの問題が発生したときには、このようのEUからの苦情を必要とします。 EUは、ソースプロバイダへの苦情を指示します。順番にソースプロバイダは、AD-1にこれらの苦情を提出します。サービス提供の責任は、AD-1です。独自のネットワークまたはAD-2  - のような、AD-1は、サービスの問題が発生している場所を決定する必要があります。各ADは、独自のネットワークでマルチキャストサービスの状態を監視するためのツールを持っていることが期待されます。"
    },
    {
      "indent": 3,
      "text": "o Both ADs will determine how best to deploy multicast service monitoring tools. Typically, each AD will deploy its own set of monitoring tools, in which case both ADs are expected to inform each other when multicast delivery problems are detected.",
      "ja": "Oどちらの広告は、マルチキャストサービス監視ツールを展開する最善の方法を決定します。典型的には、各ADは、両方の広告がマルチキャスト配信の問題が検出されたときに互いに通知することが期待される場合に、監視ツールの独自のセットを展開します。"
    },
    {
      "indent": 3,
      "text": "o AD-2 may experience some problems in its network. For example, for the AMT use cases (Sections 3.3, 3.4, and 3.5), one or more AMT relays may be experiencing difficulties. AD-2 may be able to fix the problem by rerouting the multicast streams via alternate AMT relays. If the fix is not successful and multicast service delivery degrades, then AD-2 needs to report the issue to AD-1.",
      "ja": "O AD-2は、そのネットワーク内のいくつかの問題が発生することがあります。例えば、AMTユースケース（セクション3.3、3.4、3.5）のために、一つ以上のAMTリレーは問題が発生することができます。 AD-2は、代替AMTリレーを介してマルチキャストストリームを再ルーティングすることによって問題を解決できる可能性があります。修正が成功したとマルチキャストサービス提供が低下しない場合、AD-2は、AD-1に問題を報告する必要があります。"
    },
    {
      "indent": 3,
      "text": "o When a problem notification is received from a multicast application source, AD-1 determines whether the cause of the problem is within its own network or within AD-2. If the cause is within AD-2, then AD-1 supplies all necessary information to AD-2. Examples of supporting information include the following:",
      "ja": "問題の通知をマルチキャストアプリケーション・ソースから受信される場合、O、AD-1は、問題の原因が自ネットワーク内又はAD-2の範囲内であるか否かを判定する。原因がAD-2の範囲内であれば、AD-1は、AD-2に、すべての必要な情報を提供しています。情報をサポートしているの例としては次のものがあります。"
    },
    {
      "indent": 6,
      "text": "* Kind(s) of problem(s).",
      "ja": "問題の*種類（S）（S）。"
    },
    {
      "indent": 6,
      "text": "* Starting point and duration of problem(s).",
      "ja": "問題の*開始点と持続時間（秒）。"
    },
    {
      "indent": 6,
      "text": "* Conditions in which one or more problems occur.",
      "ja": "* 1つ以上の問題が発生する条件。"
    },
    {
      "indent": 6,
      "text": "* IP address blocks of affected users.",
      "ja": "*影響を受けるユーザーのIPアドレスブロック。"
    },
    {
      "indent": 6,
      "text": "* ISPs of affected users.",
      "ja": "*影響を受けるユーザーのISPは。"
    },
    {
      "indent": 6,
      "text": "* Type of access, e.g., mobile versus desktop.",
      "ja": "*アクセスの種類、デスクトップ対例えば、モバイル。"
    },
    {
      "indent": 6,
      "text": "* Network locations of affected EUs.",
      "ja": "*影響を受けたのEUのネットワークの場所。"
    },
    {
      "indent": 3,
      "text": "o Both ADs conduct some form of root-cause analysis for multicast service delivery problems. Examples of various factors for consideration include:",
      "ja": "Oどちらの広告は、マルチキャストサービス提供の問題の根本原因分析のいくつかのフォームを行っています。検討のための様々な要因の例としては："
    },
    {
      "indent": 6,
      "text": "* Verification that the service configuration matches the product features.",
      "ja": "*サービス構成は、製品の機能と一致していることを確認。"
    },
    {
      "indent": 6,
      "text": "* Correlation and consolidation of the various customer problems and resource troubles into a single root-service problem.",
      "ja": "*単一のルート・サービスの問題への様々な顧客の問題や資源問題の相関と統合。"
    },
    {
      "indent": 6,
      "text": "* Prioritization of currently open service problems, giving consideration to problem impacts, SLAs, etc.",
      "ja": "問題の影響、のSLAなどを考慮し、現在開いているサービスの問題の*優先順位付け、"
    },
    {
      "indent": 6,
      "text": "* Conducting service tests, including tests performed once or a series of tests over a period of time.",
      "ja": "テストを含む*伝導サービス・テストは、時間をかけて一回または一連のテストを行いました。"
    },
    {
      "indent": 6,
      "text": "* Analysis of test results.",
      "ja": "*テスト結果の分析。"
    },
    {
      "indent": 6,
      "text": "* Analysis of relevant network fault or performance data.",
      "ja": "*関連するネットワーク障害やパフォーマンスデータの分析。"
    },
    {
      "indent": 6,
      "text": "* Analysis of the problem information provided by the customer.",
      "ja": "*お客様が提供する問題情報の分析。"
    },
    {
      "indent": 3,
      "text": "o Once the cause of the problem has been determined and the problem has been fixed, both ADs need to work jointly to verify and validate the success of the fix.",
      "ja": "問題の原因が決定されていると、問題が修正されていたらO、両方の広告が確認し、修正の成功を検証するために共同で作業する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.5. Client Reliability Models / Service Assurance Guidelines",
      "section_title": true,
      "ja": "4.5。クライアントの信頼性モデル/サービス保証ガイドライン"
    },
    {
      "indent": 3,
      "text": "There are multiple options for instituting reliability architectures. Most are at the application level. Both ADs should work these options out per their contract or agreement and also with the multicast application source providers.",
      "ja": "信頼性アーキテクチャを制定のための複数のオプションがあります。大半は、アプリケーションレベルです。どちらの広告は、マルチキャストアプリケーションのソース・プロバイダーでも、彼らの契約または契約ごとに、これらのオプションを仕事とする必要があります。"
    },
    {
      "indent": 3,
      "text": "Network reliability can also be enhanced by the two ADs if they provision alternate delivery mechanisms via unicast means.",
      "ja": "それら提供代替送達機構場合、ネットワークの信頼性は、ユニキャスト手段を介して2つの広告によって高めることができます。"
    },
    {
      "indent": 0,
      "text": "4.6. Application Accounting Guidelines",
      "section_title": true,
      "ja": "4.6。アプリケーション会計ガイドライン"
    },
    {
      "indent": 3,
      "text": "Application-level accounting needs to be handled differently in the application than in IP unicast, because the source side does not directly deliver packets to individual receivers. Instead, this needs to be signaled back by the receiver to the source.",
      "ja": "アプリケーションレベルの会計は、ソース側が直接、個々の受信者にパケットを配信していないため、IPユニキャストに比べてアプリケーションに異なる方法で処理する必要があります。代わりに、これはソースに受信機によって戻って合図する必要があります。"
    },
    {
      "indent": 3,
      "text": "For network transport diagnostics, AD-1 and AD-2 should have mechanisms in place to ensure proper accounting for the volume of bytes delivered through the peering point and, separately, the number of bytes delivered to EUs.",
      "ja": "ネットワーク・トランスポート診断のために、AD-1、AD-2は、別々に、ピアリングポイントを介して送達され、バイトのボリュームのための適切な会計処理、のEUに送られたバイト数を確保するために適所にメカニズムを有していなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Troubleshooting and Diagnostics",
      "section_title": true,
      "ja": "5.トラブルシューティングと診断"
    },
    {
      "indent": 3,
      "text": "Any service provider supporting multicast delivery of content should be able to collect diagnostics as part of multicast troubleshooting practices and resolve network issues accordingly. Issues may become apparent or identifiable through either (1) network monitoring functions or (2) problems reported by customers, as described in Section 4.4.",
      "ja": "コンテンツのマルチキャスト配信をサポートする任意のサービスプロバイダは、マルチキャストのトラブルシューティングプラクティスの一環として、診断を収集し、それに応じてネットワークの問題を解決することができるはずです。セクション4.4で説明したような問題は、（1）ネットワーク監視機能や顧客によって報告された（2）の問題のいずれかを介して明らか又は識別可能になることができます。"
    },
    {
      "indent": 3,
      "text": "It is recommended that multicast diagnostics be performed, leveraging established operational practices such as those documented in [MDH-05]. However, given that inter-domain multicast creates a significant interdependence of proper networking functionality between providers, there exists a need for providers to be able to signal (or otherwise alert) each other if there are any issues noted by either one.",
      "ja": "このような[MDH-05]に記載されているような確立されたオペレーショナル・プラクティスを活用し、マルチキャスト診断を行うことが推奨されます。しかしながら、ドメイン間マルチキャストプロバイダとの間の適切なネットワーク機能の有意な相互依存関係を作成することを考えると、いずれかによって示さ何か問題がある場合プロバイダがお互いに合図することができる（または警告）であることの必要性が存在します。"
    },
    {
      "indent": 3,
      "text": "For troubleshooting purposes, service providers may also wish to allow limited read-only administrative access to their routers to their AD peers. Access to active troubleshooting tools -- especially [Traceroute] and the tools discussed in [Mtrace-v2] -- is of specific interest.",
      "ja": "トラブルシューティングの目的のために、サービスプロバイダーはまた、ADの仲間に自分のルータに制限され、読み取り専用の管理アクセスを許可したい場合があります。アクティブなトラブルシューティングツールにアクセス - 特に[トレースルート]および[MTRACE-V2]で説明したツールは、 - 特定の関心があります。"
    },
    {
      "indent": 3,
      "text": "Another option is to include this functionality in the IP multicast receiver application on the EU device and allow these diagnostics to be remotely used by support operations. Note, though, that AMT does not allow the passing of traceroute or mtrace requests; therefore, troubleshooting in the presence of AMT does not work as well end to end as it can with native (or even GRE-encapsulated) IP multicast, especially with regard to traceroute and mtrace. Instead, troubleshooting directly on the actual network devices is then more likely necessary.",
      "ja": "別のオプションは、EUのデバイス上のIPマルチキャスト受信アプリケーションでこの機能が含まれ、これらの診断を遠隔サポート業務で使用できるようにすることです。 AMTは、トレースルートやMTRACE要求の通過を許可していないこと、しかし、注意してください。従って、AMTの存在下でのトラブルシューティングは、それが天然の（あるいはGREカプセル化）IPマルチキャストとすることができるように特にトレースルートとMTRACEに関して、エンド・トゥ・エンドとしてうまく機能しません。代わりに、実際のネットワークデバイス上で直接トラブルシューティングが可能性が高いことが必要です。"
    },
    {
      "indent": 3,
      "text": "The specifics of notifications and alerts are beyond the scope of this document, but general guidelines are similar to those described in Section 4.4. Some general communications issues are as follows.",
      "ja": "通知や警告の詳細は、このドキュメントの範囲を超えていますが、一般的なガイドラインは、セクション4.4で説明したものと同様です。次のようにいくつかの一般的な通信の問題があります。"
    },
    {
      "indent": 3,
      "text": "o Appropriate communications channels will be established between the customer service and operations groups from both ADs to facilitate information-sharing related to diagnostic troubleshooting.",
      "ja": "O適切な通信チャネルは、診断トラブルシューティングに関する情報共有を容易にするために、両方の広告からの顧客サービス及びオペレーショングループとの間に確立されるであろう。"
    },
    {
      "indent": 3,
      "text": "o A default resolution period may be considered to resolve open issues. Alternately, mutually acceptable resolution periods could be established, depending on the severity of the identified trouble.",
      "ja": "Oデフォルトの解像度の期間は、未解決の問題を解決することが考えられます。代替的に、相互に受け入れ可能な解決期間は、識別されたトラブルの重症度に応じて、確立することができます。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 0,
      "text": "6.1. DoS Attacks (against State and Bandwidth)",
      "section_title": true,
      "ja": "6.1。 （州および帯域幅に対する）DoS攻撃"
    },
    {
      "indent": 3,
      "text": "Reliable IP multicast operations require some basic protection against DoS (Denial of Service) attacks.",
      "ja": "信頼性の高いIPマルチキャストの操作は、DoS攻撃（サービス拒否）攻撃に対するいくつかの基本的な保護を必要としています。"
    },
    {
      "indent": 3,
      "text": "SSM IP multicast is self-protecting against attacks from illicit sources; such traffic will not be forwarded beyond the first-hop router, because that would require (S,G) membership reports from the receiver. Only valid traffic from sources will be forwarded, because RPF (\"Reverse Path Forwarding\") is part of the protocols. One can say that protection against spoofed source traffic performed in the style of [BCP38] is therefore built into PIM-SM / PIM-SSM.",
      "ja": "SSM IPマルチキャストは、自己保護不正ソースからの攻撃です。それは、受信機からの（S、G）メンバーシップレポートを必要とするので、このようなトラフィックは、最初のホップルータを超えて転送されません。 RPF（「リバースパス転送」）は、プロトコルの一部であるため、発生源からの唯一の有効なトラフィックは、転送されます。一つは、[BCP38]のスタイルで行われ、偽装された送信元トラフィックに対するその保護はしたがって、PIM-SM / PIM-SSMに組み込まれていると言うことができます。"
    },
    {
      "indent": 3,
      "text": "Receivers can attack SSM IP multicast by originating such (S,G) membership reports. This can result in a DoS attack against state through the creation of a large number of (S,G) states that create high control-plane load or even inhibit the later creation of a valid (S,G). In conjunction with collaborating illicit sources, it can also result in the forwarding of traffic from illicit sources.",
      "ja": "レシーバは、（S、G）メンバーシップレポートを発信することにより、SSM IPマルチキャストを攻撃することができます。これは、高いコントロールプレーンの負荷を作成またはさらに有効な（S、G）の後の生成を阻害する（S、G）ステートの多数の作成を通じて状態に対するDoS攻撃をもたらすことができます。不正なソースを協力に関連して、それはまた、違法なソースからのトラフィックの転送をもたらすことができます。"
    },
    {
      "indent": 3,
      "text": "Today, these types of attacks are usually mitigated by explicitly defining the set of permissible (S,G) on, for example, the last-hop routers in replicating IP multicast to EUs (e.g., via (S,G) access control lists applied to IGMP/MLD membership state creation). Each AD (say, \"ADi\") is expected to know what sources located in ADi are permitted to send and what their valid (S,G)s are. ADi can therefore also filter invalid (S,G)s for any \"S\" located inside ADi, but not sources located in another AD.",
      "ja": "今日では、この種の攻撃は、通常、明示的に、たとえば、上の（S、G）が許容のセットを定義することによって緩和され、（S、G）を介して例えばのEU（にIPマルチキャストを複製におけるラストホップルータは、アクセス制御リストを適用しますIGMP / MLDメンバーシップの状態を作成します）。各ADは（たとえば、「ADiの」）はADiのに位置情報源が送信し、その有効な（S、G）Sは何が許可されているかを知ることが予想されます。アナログ・デバイセズは、したがって、他のADに位置源ADiの内側に位置する任意の「S」の（S、G）S無効フィルタリング、しかしすることができません。"
    },
    {
      "indent": 3,
      "text": "In the peering case, without further information, AD-2 is not aware of the set of valid (S,G) from AD-1, so this set needs to be communicated via operational procedures from AD-1 to AD-2 to provide protection against this type of DoS attack. Future work could signal this information in an automated way: BGP extensions, DNS resource records, or backend automation between AD-1 and AD-2. Backend automation is, in the short term, the most viable solution: unlike BGP extensions or DNS resource records, backend automation does not require router software extensions. Observation of traffic flowing via (S,G) state could also be used to automate the recognition of invalid (S,G) state created by receivers in the absence of explicit information from AD-1.",
      "ja": "ピアリング場合に、さらなる情報なしで、AD-2は、AD-1からの有効な（S、G）のセットを認識していないので、このセットが提供するAD-2にAD-1から操作手順を介して通信する必要がありますDoS攻撃のこのタイプに対する保護。 AD-1、AD-2の間でBGPの拡張機能、DNSリソースレコード、またはバックエンドの自動化：今後の仕事は、この自動化された方法で情報を知らせることができます。バックエンドの自動化は、短期的には、ある、最も実行可能なソリューション：BGPの拡張やDNSリソースレコードとは異なり、バックエンドの自動化は、ルータのソフトウェアの拡張を必要としません。 （S、G）ステートを介して流れるトラフィックの観察はまた、AD-1から無効な（S、G）明示的な情報が存在しない場合に受信機によって作成された状態の認識を自動化するために使用することができます。"
    },
    {
      "indent": 3,
      "text": "The second type of DoS attack through (S,G) membership reports exists when the attacking receiver creates too much valid (S,G) state and the traffic carried by these (S,G)s congests bandwidth on links shared with other EUs. Consider the uplink to a last-hop router connecting to 100 EUs. If one EU joins to more multicast content than what fits into this link, then this would also impact the quality of the same content for the other 99 EUs. If traffic is not rate adaptive, the effects are even worse.",
      "ja": "攻撃受信機はあまり有効な（S、G）を作成するときに（S、G）メンバーシップレポートを通じてDoS攻撃の二種類が存在状態及びこれらの（S、G）Sによって運ばれるトラフィックは、他のEUとの共有リンク上の帯域幅を混雑。 100件のEUへの接続ラストホップルータへのアップリンクを考えてみましょう。 1 EUは、このリンクに収まるものよりもマルチキャストコンテンツに参加した場合、これはまた、他の99個のEUで同じコンテンツの品質に影響を与えるでしょう。トラフィックが適応レートされていない場合、効果はさらに悪化しています。"
    },
    {
      "indent": 3,
      "text": "The mitigation technique is the same as what is often employed for unicast: policing of the per-EU total amount of traffic. Unlike unicast, though, this cannot be done anywhere along the path (e.g., on an arbitrary bottleneck link); it has to happen at the point of last replication to the different EU. Simple solutions such as limiting the maximum number of joined (S,G)s per EU are readily available; solutions that take consumed bandwidth into account are available as vendor-specific features in routers. Note that this is primarily a non-peering issue in AD-2; it only becomes a peering issue if the peering link itself is not big enough to carry all possible content from AD-1 or, as in Use Case 3.4, when the AMT relay in AD-1 is that last replication point.",
      "ja": "緩和技術、多くの場合、ユニキャストのために採用されているものと同じである：トラフィックのあたり-EU総量のポリシング。ユニキャストとは異なり、しかし、これは、（例えば、任意のボトルネックリンク上の）経路に沿ってどこにでも行うことができません。それは別のEUへの最後の複製の時点で起こることがあります。そのようなEUあたりの接合の最大数（S、G）Sを制限するような単純な解決策は、容易に入手可能です。アカウントに消費される帯域幅を取るの解決策は、ルータにベンダー固有の機能として利用できます。これは主に、AD-2で非ピアリング問題であることに注意してください。 AD-1でAMTリレーは最後の複製ポイントということであるとき、ピアリングのリンク自体は、ユースケース3.4、のように、AD-1からのすべての可能なコンテンツを運ぶのに十分な大きさでない場合、またはそれが唯一のピアリング問題となります。"
    },
    {
      "indent": 3,
      "text": "Limiting the amount of (S,G) state per EU is also a good first measure to prohibit too much undesired \"empty\" state from being built (state not carrying traffic), but it would not suffice in the case of DDoS attacks, e.g., viruses that impact a large number of EU devices.",
      "ja": "（S、G）EUあたりの状態の量を制限することも（状態がトラフィックを伝送していない）構築されてからあまり望ましくない「空」の状態を禁止する良い最初の尺度であるが、それはDDoS攻撃、例えばの場合には十分ではないでしょう、EUの多数のデバイスに影響を与えるウイルス。"
    },
    {
      "indent": 0,
      "text": "6.2. Content Security",
      "section_title": true,
      "ja": "6.2。コンテンツセキュリティ"
    },
    {
      "indent": 3,
      "text": "Content confidentiality, DRM (Digital Rights Management), authentication, and authorization are optional, based on the content delivered. For content that is \"FTA\" (Free To Air), the following considerations can be ignored, and content can be sent unencrypted and without EU authentication and authorization. Note, though, that the mechanisms described here may also be desirable for the application source to better track users even if the content itself would not require it.",
      "ja": "コンテンツの機密性、DRM（デジタル著作権管理）、認証、および承認が配信されたコンテンツに基づいて、オプションです。 「FTA」（空気に無料）であるコンテンツについては、次の考慮事項を無視することができ、コンテンツは暗号化されていないとEUの認証と認可なしに送信することができます。ここで説明するメカニズムは、コンテンツ自体がそれを必要としない場合でも、より良いトラックユーザーにアプリケーションのソースのために望ましいことが、しかし、注意してください。"
    },
    {
      "indent": 3,
      "text": "For inter-domain content, there are at least two models for content confidentiality, including (1) DRM authentication and authorization and (2) EU authentication and authorization:",
      "ja": "ドメイン間のコンテンツの場合、（1）DRM認証と認可及び（2）EUの認証および承認を含むコンテンツの機密性のために少なくとも2つのモデルが、あります。"
    },
    {
      "indent": 3,
      "text": "o In the classical (IP)TV model, responsibility is per domain, and content is and can be passed on unencrypted. AD-1 delivers content to AD-2; AD-2 can further process the content, including features like ad insertion, and AD-2 is the sole point of contact regarding the contact for its EUs. In this document, we do not consider this case because it typically involves service aspects operated by AD-2 that are higher than the network layer; this document focuses on the network-layer AD-1/AD-2 peering case but not the application-layer peering case. Nevertheless, this model can be derived through additional work beyond what is described here.",
      "ja": "O古典（IP）のTVモデルでは、責任は、ドメインごとにあり、かつコンテンツがあると、暗号化されていないに渡すことができます。 AD-1、AD-2へのコンテンツ配信します。 AD-2は、さらに広告挿入などの機能を含め、コンテンツを処理することができ、およびAD-2は、そのためのEUの接触に関する連絡先の唯一のポイントです。それは通常、ネットワーク層よりも高いAD-2が運営するサービスの側面を伴うため、このドキュメントでは、我々はこのような場合を考慮していません。この文書は、ネットワーク層AD-1 / AD-2ピアリングの場合はなくアプリケーション層のピアリングの場合に焦点を当てます。それにもかかわらず、このモデルは、ここで説明されているもの以外に追加の作業を通じて導出することができます。"
    },
    {
      "indent": 3,
      "text": "o The other model is the one in which content confidentiality, DRM, EU authentication, and EU authorization are end to end: responsibilities of the multicast application source provider and receiver application. This is the model assumed here. It is also the model used in Internet \"Over the Top\" (OTT) video delivery. Below, we discuss the threats incurred in this model due to the use of IP multicast in AD-1 or AD-2 and across the peering point.",
      "ja": "マルチキャストアプリケーションのソース・プロバイダと受信機アプリケーションの責任：O他のモデルは、コンテンツの機密性、DRM、EU認証、およびEUの承認は、エンドツーエンドいるものです。これは、ここで想定したモデルです。また、（OTT）ビデオ配信「頂部の上に」インターネットで使用されるモデルです。以下に、我々は原因AD-1におけるIPマルチキャストの使用またはAD-2へとピアリングポイント間で、このモデルで発生した脅威を議論します。"
    },
    {
      "indent": 3,
      "text": "End-to-end encryption enables end-to-end EU authentication and authorization: the EU may be able to join (via IGMP/MLD) and receive the content, but it can only decrypt it when it receives the decryption key from the content source in AD-1. The key is the authorization. Keeping that key to itself and prohibiting playout of the decrypted content to non-copy-protected interfaces are typical DRM features in that receiver application or EU device operating system.",
      "ja": "EUは（IGMP / MLD経由）に参加することができるとコンテンツを受け取ることができるが、それはコンテンツの復号鍵を受信したときだけそれを解読することができます：エンドツーエンドの暗号化は、エンドツーエンドEUの認証と認可を可能にしますAD-1におけるソース。キーが承認されます。その受信機アプリケーションまたはEUデバイスのオペレーティングシステムにおける典型的なDRM機能はそれ自体にその鍵を保持し、非コピープロテクトインターフェイスに復号されたコンテンツの再生を禁止します。"
    },
    {
      "indent": 3,
      "text": "End-to-end encryption is continuously attacked. Keys may be subject to brute-force attacks so that content can potentially be decrypted later, or keys are extracted from the EU application/device and shared with other unauthenticated receivers. One important class of content is where the value is in live consumption, such as sports or other event (e.g., concert) streaming. Extraction of keying material from compromised authenticated EUs and sharing with unauthenticated EUs are not sufficient. It is also necessary for those unauthenticated EUs to get a streaming copy of the content itself. In unicast streaming, they cannot get such a copy from the content source (because they cannot authenticate), and, because of asymmetric bandwidths, it is often impossible to get the content from compromised EUs to a large number of unauthenticated EUs. EUs behind classical \"16 Mbps down, 1 Mbps up\" ADSL links are the best example. With increasing broadband access speeds, unicast peer-to-peer copying of content becomes easier, but it likely will always be easily detectable by the ADs because of its traffic patterns and volume.",
      "ja": "エンドツーエンドの暗号化を継続的に攻撃されます。キーは、そのコンテンツが潜在的に後で復号化することができ、またはキーがEUアプリケーション/装置から抽出され、他の認証されていない受信機と共有するように、被験体へのブルートフォース攻撃であってもよいです。値は、スポーツなどのライブ消費、または他のイベント（例えば、コンサート）ストリーミングである場合、コンテンツの1つの重要なクラスはあります。損なわ認証のEUからの鍵材料と非認証のEUと共有の抽出が十分ではありません。これらの認証されていないのEUは、コンテンツ自体のストリーミングコピーを取得することも必要です。非対称の帯域幅の、認証されていないのEUの数が多いために妥協のEUからコンテンツを取得することはしばしば不可能であるため、ユニキャストストリーミングでは、彼らは、（彼らは認証できないため）コンテンツソースから、このようなコピーを取得し、することはできません。 「ダウン16 Mbpsの、最大1Mbpsの」古典の後ろのEU ADSLリンクが最良の例です。ブロードバンドアクセス速度が増加すると、コンテンツのユニキャストピア・ツー・ピアのコピーが容易になるが、それはおそらく、常に、そのトラフィックパターンとボリュームの広告で容易に検出されます。"
    },
    {
      "indent": 3,
      "text": "When IP multicast is being used without additional security, AD-2 is not aware of which EU is authenticated for which content. Any unauthenticated EU in AD-2 could therefore get a copy of the encrypted content without triggering suspicion on the part of AD-2 or AD-1 and then either (1) live-decode it, in the presence of the compromised authenticated EU and key-sharing or (2) decrypt it later, in the presence of federated brute-force key-cracking.",
      "ja": "IPマルチキャストは、追加のセキュリティなしで使用されている場合は、AD-2は、EUがどのコンテンツに対して認証されているのに気づいていないです。 AD-2のいずれかの認証されていないEUは、したがって、妥協認証されたEUの存在下で、その後、AD-2またはAD-1のいずれか（1）ライブデコードしての一部に疑いをトリガーすることなく、暗号化されたコンテンツのコピーを得ることができるし、鍵共有又は（2）キークラッキング連合ブルートフォースの存在下で、後でそれを復号化します。"
    },
    {
      "indent": 3,
      "text": "To mitigate this issue, the last replication point that is creating (S,G) copies to EUs would need to permit those copies only after authentication of the EUs. This would establish the same authenticated \"EU only\" copy that is used in unicast.",
      "ja": "この問題を軽減するため、EU群に（S、G）のコピーを作成された最後の複製点が唯一のEUの認証後にそれらのコピーを許可する必要があります。これは、ユニキャストで使用されているのと同じ認証された「EUのみ」のコピーを確立します。"
    },
    {
      "indent": 3,
      "text": "Schemes for per-EU IP multicast authentication/authorization (and, as a result, non-delivery or copying of per-content IP multicast traffic) have been built in the past and are deployed in service providers for intra-domain IPTV services, but no standards exist for this. For example, there is no standardized RADIUS attribute for authenticating the IGMP/MLD filter set, but such implementations exist. The authors of this document are specifically also not aware of schemes where the same authentication credentials used to get the encryption key from the content source could also be used to authenticate and authorize the network-layer IP multicast replication for the content. Such schemes are technically not difficult to build and would avoid creating and maintaining a separate network traffic-forwarding authentication/authorization scheme decoupled from the end-to-end authentication/authorization system of the application.",
      "ja": "ごとのEU IPマルチキャスト認証/認可（ごとのコンテンツIPマルチキャストトラフィックのと、結果として、非配達またはコピー）のためのスキームは、過去に構築されていると、ドメイン内のIPTVサービスのためのサービス・プロバイダーに配備されているが、何の基準は、このために存在しません。例えば、そこにIGMP / MLDフィルタセットを認証するための標準化されたRADIUS属性はありませんが、そのような実装が存在します。本書の著者は、特に、コンテンツソースから暗号化キーを取得するために使用したのと同じ認証資格情報は、コンテンツのためのネットワーク層IPマルチキャストレプリケーションを認証および認可するために使用できるスキームを認識していません。このようなスキームは、技術的に構築することは困難ではなく、アプリケーションのエンド・ツー・エンドの認証/認可システムから分離独立したネットワークトラフィックフォワーディングの認証/認可スキームを作成し、維持避けるだろう。"
    },
    {
      "indent": 3,
      "text": "If delivery of such high-value content in conjunction with the peering described here is desired, the short-term recommendations are for sources to clearly isolate the source and group addresses used for different content bundles, communicate those (S,G) patterns from AD-1 to AD-2, and let AD-2 leverage existing per-EU authentication/ authorization mechanisms in network devices to establish filters for (S,G) sets to each EU.",
      "ja": "ここに記載ピアリングと併せて、このような高価値のコンテンツの配信が望まれる場合ソースは明らかに異なるコンテンツバンドルのために使用されるソースとグループアドレスを単離するために、短期的な勧告は、これら（S、G）ADからパターンを通信する、あります-1 AD-2、および（S、G）のフィルタを確立するために、ネットワークデバイスにあたり、EU認証/認可メカニズムを既存のAD-2レバレッジを聞かせては、各EUに設定します。"
    },
    {
      "indent": 0,
      "text": "6.3. Peering Encryption",
      "section_title": true,
      "ja": "6.3。ピアリング暗号化"
    },
    {
      "indent": 3,
      "text": "Encryption at peering points for multicast delivery may be used per agreement between AD-1 and AD-2.",
      "ja": "マルチキャスト配信のためのポイントをピアリングで暗号化は、AD-1、AD-2との間に契約ごとに使用してもよいです。"
    },
    {
      "indent": 3,
      "text": "In the case of a private peering link, IP multicast does not have attack vectors on a peering link different from those of IP unicast, but the content owner may have defined strict constraints against unauthenticated copying of even the end-to-end encrypted content; in this case, AD-1 and AD-2 can agree on additional transport encryption across that peering link. In the case of a broadcast peering connection (e.g., IXP), transport encryption is again the easiest way to prohibit unauthenticated copies by other ADs on the same peering point.",
      "ja": "プライベートピアリングリンクの場合は、IPマルチキャストは、IPユニキャストのものとは異なるピアリングのリンクに攻撃ベクトルを持っていませんが、コンテンツ所有者であっても、エンドツーエンドの暗号化されたコンテンツの認証されていないコピーに対して厳しい制約を定義していること。この場合には、AD-1、AD-2は、そのピアリングリンクを介して追加の輸送暗号化に同意することができます。放送ピアリング接続の場合には（例えば、IXP）は、トランスポート暗号化は、再び同じピアリングポイントに他の広告によって認証されていないコピーを禁止する最も簡単な方法です。"
    },
    {
      "indent": 3,
      "text": "If peering is across a tunnel that spans intermittent transit ADs (not discussed in detail in this document), then encryption of that tunnel traffic is recommended. It not only prohibits possible \"leakage\" of content but also protects the information regarding what content is being consumed in AD-2 (aggregated privacy protection).",
      "ja": "ピアリング（この文書で詳細に説明しない）間欠トランジット広告にまたがるトンネルを横切っている場合、そのトンネルトラフィックの暗号化が推奨されます。これは、コンテンツの可能性「漏れ」を禁止しているだけでなく、コンテンツがAD-2（集約プライバシー保護）で消費されているものについての情報を保護するだけでなく。"
    },
    {
      "indent": 3,
      "text": "See Section 6.4 for reasons why the peering point may also need to be encrypted for operational reasons.",
      "ja": "ピアリングポイントも運用上の理由のために暗号化される必要があるかもしれない理由については、6.4節を参照してください。"
    },
    {
      "indent": 0,
      "text": "6.4. Operational Aspects",
      "section_title": true,
      "ja": "6.4。運用面"
    },
    {
      "indent": 3,
      "text": "Section 4.3.3 discusses the exchange of log information, and Section 7 discusses the exchange of program information. All these operational pieces of data should by default be exchanged via authenticated and encrypted peer-to-peer communication protocols between AD-1 and AD-2 so that only the intended recipients in the peers' AD have access to it. Even exposure of the least sensitive information to third parties opens up attack vectors. Putting valid (S,G) information, for example, into DNS (as opposed to passing it via secured channels from AD-1 to AD-2) to allow easier filtering of invalid (S,G) information would also allow attackers to more easily identify valid (S,G) information and change their attack vector.",
      "ja": "4.3.3ログ情報の交換を議論し、7章では、番組情報のやり取りについて説明します。ピアのADで唯一の目的の受信者がそれにアクセスできるようにデータのすべてのこれらの操作の作品は、デフォルトではAD-1、AD-2の間で認証および暗号化ピア・ツー・ピア通信プロトコルを介して交換されなければなりません。第三者に少なくとも機密情報の暴露でさえ攻撃ベクトルを開きます。また、より多くの攻撃を可能にする（S、G）無効な情報のより容易なフィルタリングを可能にするために（AD-2にAD-1から保護チャネルを介して渡すとは対照的に）、DNSに、例えば、（S、G）は、有効な情報を入れます簡単に有効な（S、G）情報を識別し、彼らの攻撃ベクトルを変更します。"
    },
    {
      "indent": 3,
      "text": "From the perspective of the ADs, security is most critical for log information, as it provides operational insight into the originating AD but also contains sensitive user data.",
      "ja": "それは元のADに運用洞察を提供だけでなく、ユーザーの機密データが含まれているとして、広告観点から、セキュリティは、ログ情報のために最も重要です。"
    },
    {
      "indent": 3,
      "text": "Sensitive user data exported from AD-2 to AD-1 as part of logs could be as much as the equivalent of 5-tuple unicast traffic flow accounting (but not more, e.g., no application-level information). As mentioned in Section 7, in unicast, AD-1 could capture these traffic statistics itself because this is all about traffic flows (originated by AD-1) to EU receivers in AD-2, and operationally passing it from AD-2 to AD-1 may be necessary when IP multicast is used because of the replication taking place in AD-2.",
      "ja": "ログの一部としてAD-1、AD-2からエクスポート敏感ユーザデータは、5タプルのユニキャストトラフィックフローアカウンティング（ただし、複数、例えば、無アプリケーションレベルの情報）の等価な限りとすることができます。ユニキャストでは、第7節で述べたように、これはすべてのAD-2でのEUの受信機へ（AD-1によって発信）トラフィックフロー程度であり、運用ADへのAD-2からそれを渡しているので、AD-1は、これらのトラフィック統計自体を取り込むことができIPマルチキャストが原因でAD-2で行われているレプリケーションの使用されたときに-1が必要になることがあります。"
    },
    {
      "indent": 3,
      "text": "Nevertheless, passing such traffic statistics inside AD-1 from a capturing router to a backend system is likely less subject to third-party attacks than passing it \"inter-domain\" from AD-2 to AD-1, so more diligence needs to be applied to secure it.",
      "ja": "それにも関わらず、バックエンドシステムに取り込みルータからAD-1内部のようなトラフィックの統計情報を渡すと、おそらくあまりサードパーティの攻撃の対象とAD-1にAD-2からの「ドメイン間」それを渡すよりもあるので、より多くの勤勉はする必要がありますそれを確保するために適用されます。"
    },
    {
      "indent": 3,
      "text": "If any protocols used for the operational exchange of information are not easily secured at the transport layer or higher (because of the use of legacy products or protocols in the network), then AD-1 and AD-2 can also consider ensuring that all operational data exchanges go across the same peering point as the traffic and use network-layer encryption of the peering point (as discussed previously) to protect it.",
      "ja": "情報の動作交換のために使用される任意のプロトコルが容易に（なぜなら、ネットワーク内のレガシー製品またはプロトコルを使用する）、トランスポート層以上で固定されていない場合、AD-1、AD-2はまた、すべての動作することを確実に考慮することができそれを保護するために（前述したように）データ交換は、ピアリングポイントのトラフィックと使用ネットワーク層の暗号化と同じピアリングポイントを越えて行きます。"
    },
    {
      "indent": 3,
      "text": "End-to-end authentication and authorization of EUs may involve some kind of token authentication and are done at the application layer, independently of the two ADs. If there are problems related to the failure of token authentication when EUs are supported by AD-2, then some means of validating proper operation of the token authentication process (e.g., validating that backend servers querying the multicast application source provider's token authentication server are communicating properly) should be considered. Implementation details are beyond the scope of this document.",
      "ja": "エンドツーエンドの認証とのEUの承認は、認証トークンのいくつかの種類を含むことができるし、独立して2つの広告の、アプリケーション層で行われます。 EUがAD-2でサポートされているトークン認証の失敗に関連する問題、トークン認証プロセスの適切な動作を検証するし、いくつかの手段（例えば、マルチキャストアプリケーションのソース・プロバイダのトークン認証サーバに照会するバックエンドサーバが通信していることを検証がある場合適切に）考慮されるべきです。実装の詳細は、このドキュメントの範囲を超えています。"
    },
    {
      "indent": 3,
      "text": "In the event of a security breach, the two ADs are expected to have a mitigation plan for shutting down the peering point and directing multicast traffic over alternative peering points. It is also expected that appropriate information will be shared for the purpose of securing the identified breach.",
      "ja": "セキュリティ侵害が発生した場合には、2つの広告は、ピアリングポイントをシャットダウンし、代替ピアリングポイント上でマルチキャストトラフィックを導くための緩和計画を有することが期待されます。また、適切な情報が特定の違反を確保するために共有されることが期待されます。"
    },
    {
      "indent": 0,
      "text": "7. Privacy Considerations",
      "section_title": true,
      "ja": "7.プライバシーの考慮事項"
    },
    {
      "indent": 3,
      "text": "The described flow of information about content and EUs as described in this document aims to maintain privacy:",
      "ja": "この文書に記載されたコンテンツとのEUに関する情報の説明の流れは、プライバシーを維持することを目指して："
    },
    {
      "indent": 3,
      "text": "AD-1 is operating on behalf of (or owns) the content source and is therefore part of the content-consumption relationship with the EU. The privacy considerations between the EU and AD-1 are therefore generally the same (with one exception; see below) as they would be if no IP multicast was used, especially because end-to-end encryption can and should be used for any privacy-conscious content.",
      "ja": "AD-1は、代わって操作する（または所有している）、コンテンツソース、したがって、EUとコンテンツ消費関係の一部です。 EUとAD-1の間でプライバシーの考慮事項は、一般的にしたがって、ある同じ;ないIPマルチキャストが使用されなかった場合、彼らはだろうとして、エンドツーエンドの暗号化は、あらゆるプライバシーのために使用する必要がありますすることができ、特にので、（一つの例外を除いて下記を参照） -consciousコンテンツ。"
    },
    {
      "indent": 3,
      "text": "Information related to inter-domain multicast transport service is provided to AD-1 by the AD-2 operators. AD-2 is not required to gain additional insight into the user's behavior through this process other than what it would already have without service collaboration with AD-1, unless AD-1 and AD-2 agree on it and get approval from the EU.",
      "ja": "ドメイン間マルチキャストトランスポート・サービスに関連する情報は、AD-2のオペレータによりAD-1に供給されます。 AD-2は、AD-1、AD-2がそれに同意し、EUからの承認を得ない限り、それはすでに、AD-1とのサービス連携せずに持っているだろうか以外に、このプロセスを介してユーザの行動への追加の洞察を得るために必要とされていません。"
    },
    {
      "indent": 3,
      "text": "For example, if it is deemed beneficial for the EU to get support directly from AD-2, then it would generally be necessary for AD-2 to be aware of the mapping between content and network (S,G) state so that AD-2 knows which (S,G) to troubleshoot when the EU complains about problems with specific content. The degree to which this dissemination is done by AD-1 explicitly to meet privacy expectations of EUs is typically easy to assess by AD-1. Two simple examples are as follows:",
      "ja": "それはAD-2から直接支持を得るために、EUのために有益であると考えられる場合、例えば、それは、一般的に、コンテンツとネットワークとの間のマッピングを認識するAD-2のために必要であろう（S、G）状態となるようAD-図2は、EUが特定のコンテンツに問題が文句を言う場合の対処いる（S、G）を知っています。この普及はのEUのプライバシーの期待に応えるために、明示的にAD-1によって行われる度合いは、一般的にAD-1で評価するのは簡単です。次のように2つの単純な例を示します。"
    },
    {
      "indent": 3,
      "text": "o For a sports content bundle, every EU will happily click on the \"I approve that the content program information is shared with your service provider\" button, to ensure best service reliability, because service-conscious AD-2 would likely also try to ensure that high-value content, such as the (S,G) for the Super Bowl, would be the first to receive care in the case of network issues.",
      "ja": "Oスポーツコンテンツバンドルについて、すべてのEUは喜んでサービスを意識したAD-2はそうも確保しようとするので、最高のサービスの信頼性を確保するために、ボタン「私はコンテンツの番組情報は、サービスプロバイダと共有されていることを承認する」をクリックしますその高価値コンテンツは、スーパーボウルのための（S、G）のように、ネットワークの問題の場合には治療を受けることが最初であろう。"
    },
    {
      "indent": 3,
      "text": "o If the content in question was content for which the EU expected more privacy, the EU should prefer a content bundle that included this content in a large variety of other content, have all content end-to-end encrypted, and not share programming information with AD-2, to maximize privacy. Nevertheless, the privacy of the EU against AD-2 observing traffic would still be lower than in the equivalent setup using unicast, because in unicast, AD-2 could not correlate which EUs are watching the same content and use that to deduce the content. Note that even the setup in Section 3.4, where AD-2 is not involved in IP multicast at all, does not provide privacy against this level of analysis by AD-2, because there is no transport-layer encryption in AMT; therefore, AD-2 can correlate by on-path traffic analysis who is consuming the same content from an AMT relay from both the (S,G) join messages in AMT and the identical content segments (that were replicated at the AMT relay).",
      "ja": "問題の内容がEUにはより多くのプライバシーを期待されるコンテンツであった場合、O、EUは、すべてのコンテンツのエンドツーエンドの暗号化を持って、他のコンテンツの色々なこのコンテンツを含むコンテンツバンドルを好む、およびプログラミング情報を共有するべきではありませんAD-2で、プライバシーを最大限に高めることができます。ユニキャストでは、AD-2のEUは、同じコンテンツを見ている相関と内容を推測するためにそれを使用できなかったため、それにもかかわらず、トラフィックを観測AD-2に対するEUのプライバシーはまだ、ユニキャストを使用して同等のセットアップに比べて低くなります。 AMTにはトランスポート層の暗号化がないので、AD-2による分析のこのレベルに対してプライバシーを提供していない、AD-2は全くIPマルチキャストに関与していないセクション3.4、であっても、セットアップに注意してください。従って、AD-2（S、G）、AMT及び（AMTリレーで複製された）同じコンテンツセグメント内のメッセージを参加両方からAMTリレーから同一のコンテンツを消費しているオンパストラフィック分析によって相関させることができます。"
    },
    {
      "indent": 3,
      "text": "In summary, because only content to be consumed by multiple EUs is carried via IP multicast here and all of that content can be end-to-end encrypted, the only privacy consideration specific to IP multicast is for AD-2 to know or reconstruct what content an EU is consuming. For content for which this is undesirable, some form of protections as explained above are possible, but ideally, the model described in Section 3.4 could be used in conjunction with future work, e.g., adding Datagram Transport Layer Security (DTLS) encryption [RFC6347] between the AMT relay and the EU.",
      "ja": "唯一のコンテンツは、複数のEUで消費されるので、要約すると、ここではIPマルチキャストを経由して行われ、その内容の全ては、エンドツーエンド暗号化することができ、IPマルチキャストに固有の唯一のプライバシーの配慮は知っているか、または再構築するためにAD-2何のためにあるのかコンテンツEUが消費しています。これは望ましくないため、コンテンツについては、保護のいくつかのフォームは、上述したように可能ですが、理想的には、3.4節に記述されたモデルは、データグラムトランスポート層セキュリティ（DTLS）暗号化[RFC6347]を追加して、例えば、将来の仕事に関連して使用することができAMTリレーとEUの間で。"
    },
    {
      "indent": 3,
      "text": "Note that IP multicast by nature would permit the EU's privacy against the content source operator because, unlike unicast, the content source does not natively know which EU is consuming which content: in all cases where AD-2 provides replication, only AD-2 knows this directly. This document does not attempt to describe a model that maintains such a level of privacy against the content source; rather, we describe a model that only protects against exposure to intermediate parties -- in this case, AD-2.",
      "ja": "ユニキャストとは異なり、コンテンツソースがネイティブEUがどのコンテンツを消費しているかを知らない、ので、自然によるIPマルチキャストは、コンテンツソースのオペレータに対して、EUのプライバシーを可能にすることに注意してください：AD-2は、レプリケーションを提供し、すべての場合には、唯一のAD-2が知っていますこの直接。この文書では、コンテンツソースに対するプライバシーのようなレベルを維持してモデルを記述しようとしません。むしろ、我々は唯一の中間の関係者への暴露から保護モデルを記述する - この場合には、AD-2。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document does not require any IANA actions.",
      "ja": "このドキュメントは、IANAのアクションを必要としません。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2784] Farinacci, D., Li, T., Hanks, S., Meyer, D., and P. Traina, \"Generic Routing Encapsulation (GRE)\", RFC 2784, DOI 10.17487/RFC2784, March 2000, <https://www.rfc-editor.org/info/rfc2784>.",
      "ja": "[RFC2784]ファリナッチ、D.、李、T.、ハンクス、S.、マイヤー、D.、およびP. Trainaの、 \"総称ルーティングカプセル化（GRE）\"、RFC 2784、DOI 10.17487 / RFC2784、2000年3月<HTTPS ：//www.rfc-editor.org/info/rfc2784>。"
    },
    {
      "indent": 3,
      "text": "[RFC3376] Cain, B., Deering, S., Kouvelas, I., Fenner, B., and A. Thyagarajan, \"Internet Group Management Protocol, Version 3\", RFC 3376, DOI 10.17487/RFC3376, October 2002, <https://www.rfc-editor.org/info/rfc3376>.",
      "ja": "[RFC3376]カイン、B.、デアリング、S.、Kouvelas、I.、フェナー、B.、およびA. Thyagarajan、 \"インターネットグループ管理プロトコル、バージョン3\"、RFC 3376、DOI 10.17487 / RFC3376、2002年10月、< https://www.rfc-editor.org/info/rfc3376>。"
    },
    {
      "indent": 3,
      "text": "[RFC3810] Vida, R., Ed., and L. Costa, Ed., \"Multicast Listener Discovery Version 2 (MLDv2) for IPv6\", RFC 3810, DOI 10.17487/RFC3810, June 2004, <https://www.rfc-editor.org/info/rfc3810>.",
      "ja": "[RFC3810]ビダ、R.、エド、およびL.コスタ、エド、 \"IPv6のマルチキャストリスナ発見バージョン2（MLDv2の）\"、RFC 3810、DOI 10.17487 / RFC3810、2004年6月、<HTTPS：// WWW。 rfc-editor.org/info/rfc3810>。"
    },
    {
      "indent": 3,
      "text": "[RFC4760] Bates, T., Chandra, R., Katz, D., and Y. Rekhter, \"Multiprotocol Extensions for BGP-4\", RFC 4760, DOI 10.17487/RFC4760, January 2007, <https://www.rfc-editor.org/info/rfc4760>.",
      "ja": "[RFC4760]ベイツ、T.、チャンドラ、R.、カッツ、D.、およびY. Rekhter、 \"BGP-4のためのマルチプロトコル拡張機能\"、RFC 4760、DOI 10.17487 / RFC4760、2007年1月、<https：//でWWW。 rfc-editor.org/info/rfc4760>。"
    },
    {
      "indent": 3,
      "text": "[RFC4604] Holbrook, H., Cain, B., and B. Haberman, \"Using Internet Group Management Protocol Version 3 (IGMPv3) and Multicast Listener Discovery Protocol Version 2 (MLDv2) for Source-Specific Multicast\", RFC 4604, DOI 10.17487/RFC4604, August 2006, <https://www.rfc-editor.org/info/rfc4604>.",
      "ja": "[RFC4604]ホルブルック、H.、カイン、B.、およびB.ハーバーマン、 \"ソース固有マルチキャストのためにインターネットグループ管理プロトコルバージョン3（IGMPv3の）およびマルチキャストリスナ発見プロトコルバージョン2（MLDv2の）の使用\"、RFC 4604、DOI 10.17487 / RFC4604、2006年8月、<https://www.rfc-editor.org/info/rfc4604>。"
    },
    {
      "indent": 3,
      "text": "[RFC4609] Savola, P., Lehtonen, R., and D. Meyer, \"Protocol Independent Multicast - Sparse Mode (PIM-SM) Multicast Routing Security Issues and Enhancements\", RFC 4609, DOI 10.17487/RFC4609, October 2006, <https://www.rfc-editor.org/info/rfc4609>.",
      "ja": "[RFC4609] Savola、P.、Lehtonenの、R.、およびD.マイヤー、 \"プロトコル独立マルチキャスト - スパースモード（PIM-SM）マルチキャストルーティングセキュリティの問題と機能拡張\"、RFC 4609、DOI 10.17487 / RFC4609、2006年10月、< https://www.rfc-editor.org/info/rfc4609>。"
    },
    {
      "indent": 3,
      "text": "[RFC7450] Bumgardner, G., \"Automatic Multicast Tunneling\", RFC 7450, DOI 10.17487/RFC7450, February 2015, <https://www.rfc-editor.org/info/rfc7450>.",
      "ja": "[RFC7450] Bumgardner、G.、 \"自動マルチキャストトンネリング\"、RFC 7450、DOI 10.17487 / RFC7450、2015年2月、<https://www.rfc-editor.org/info/rfc7450>。"
    },
    {
      "indent": 3,
      "text": "[RFC7761] Fenner, B., Handley, M., Holbrook, H., Kouvelas, I., Parekh, R., Zhang, Z., and L. Zheng, \"Protocol Independent Multicast - Sparse Mode (PIM-SM): Protocol Specification (Revised)\", STD 83, RFC 7761, DOI 10.17487/RFC7761, March 2016, <https://www.rfc-editor.org/info/rfc7761>.",
      "ja": "[RFC7761]フェナー、B.、ハンドレー、M.、ホルブルック、H.、Kouvelas、I.、Parekhの、R.、張、Z.、およびL.鄭、「プロトコル独立マルチキャスト - スパースモード（PIM-SM） ：プロトコル仕様（改訂）」、STD 83、RFC 7761、DOI 10.17487 / RFC7761、2016年3月、<https://www.rfc-editor.org/info/rfc7761>。"
    },
    {
      "indent": 3,
      "text": "[BCP38] Ferguson, P. and D. Senie, \"Network Ingress Filtering: Defeating Denial of Service Attacks which employ IP Source Address Spoofing\", BCP 38, RFC 2827, May 2000, <https://www.rfc-editor.org/info/rfc2827>.",
      "ja": "[BCP38]ファーガソン、P.およびD. Senieは、：、BCP 38、RFC 2827、2000年5月 \"ネットワーク入力フィルタリングは、IP Source Address Spoofingを使うサービス妨害Attacksを破り\"、<HTTPS：//www.rfc-editor。組織/情報/ RFC2827>。"
    },
    {
      "indent": 3,
      "text": "[BCP41] Floyd, S., \"Congestion Control Principles\", BCP 41, RFC 2914, September 2000, <https://www.rfc-editor.org/info/rfc2914>.",
      "ja": "[BCP41]フロイド、S.、 \"輻輳制御の原理\"、BCP 41、RFC 2914、2000年9月、<https://www.rfc-editor.org/info/rfc2914>。"
    },
    {
      "indent": 3,
      "text": "[BCP145] Eggert, L., Fairhurst, G., and G. Shepherd, \"UDP Usage Guidelines\", BCP 145, RFC 8085, March 2017, <https://www.rfc-editor.org/info/rfc8085>.",
      "ja": "[BCP145]エッゲルト、L.、Fairhurst、G.、およびG.シェパード、 \"UDP使用上の注意事項\"、BCP 145、RFC 8085、2017年3月、<https://www.rfc-editor.org/info/rfc8085> 。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC4786] Abley, J. and K. Lindqvist, \"Operation of Anycast Services\", BCP 126, RFC 4786, DOI 10.17487/RFC4786, December 2006, <https://www.rfc-editor.org/info/rfc4786>.",
      "ja": "[RFC4786] Abley、J.及びK. Lindqvist、 \"エニーキャストサービスの操作\"、BCP 126、RFC 4786、DOI 10.17487 / RFC4786、2006年12月<https://www.rfc-editor.org/info/rfc4786> 。"
    },
    {
      "indent": 3,
      "text": "[RFC6347] Rescorla, E. and N. Modadugu, \"Datagram Transport Layer Security Version 1.2\", RFC 6347, DOI 10.17487/RFC6347, January 2012, <https://www.rfc-editor.org/info/rfc6347>.",
      "ja": "[RFC6347]レスコラ、E.およびN. Modadugu、 \"データグラムトランスポート層セキュリティバージョン1.2\"、RFC 6347、DOI 10.17487 / RFC6347、2012年1月、<https://www.rfc-editor.org/info/rfc6347>。"
    },
    {
      "indent": 3,
      "text": "[INF_ATIS_10] \"CDN Interconnection Use Cases and Requirements in a Multi-Party Federation Environment\", ATIS Standard A-0200010, December 2012.",
      "ja": "[INF_ATIS_10] \"マルチ党連合環境でのCDN相互接続ユースケースと要件\"、ATIS標準A-0200010、2012年12月。"
    },
    {
      "indent": 3,
      "text": "[MDH-05] Thaler, D. and B. Aboba, \"Multicast Debugging Handbook\", Work in Progress, draft-ietf-mboned-mdh-05, November 2000.",
      "ja": "[MDH-05]ターラー、D.とB. Aboba、 \"マルチキャストデバッグハンドブック\" が進行中で働いて、ドラフト-IETF-mboned-MDH-05、2000年11月。"
    },
    {
      "indent": 3,
      "text": "[Traceroute] \"traceroute.org\", <http://traceroute.org/#source%20code>.",
      "ja": "[トレースルート] \"traceroute.org\"、<http://traceroute.org/#source%20code>。"
    },
    {
      "indent": 3,
      "text": "[Mtrace-v2] Asaeda, H., Meyer, K., and W. Lee, Ed., \"Mtrace Version 2: Traceroute Facility for IP Multicast\", Work in Progress, draft-ietf-mboned-mtrace-v2-22, December 2017.",
      "ja": "[MTRACE-V2] Asaeda、H.、マイヤー、K.、およびW.リー、エド、 \"MTRACEバージョン2：IPマルチキャストのためのtracerouteの施設\"。進行中で働いて、ドラフト-IETF-mboned-MTRACE-v2-22 、2017年12月。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank the following individuals for their suggestions, comments, and corrections:",
      "ja": "著者は彼らの提案、コメント、修正のために以下の個人に感謝したいと思います："
    },
    {
      "indent": 6,
      "text": "Mikael Abrahamsson",
      "ja": "ミカエルAbrahamsson"
    },
    {
      "indent": 6,
      "text": "Hitoshi Asaeda",
      "ja": "ひとし あさえだ"
    },
    {
      "indent": 6,
      "text": "Dale Carder",
      "ja": "デールカーダー"
    },
    {
      "indent": 6,
      "text": "Tim Chown",
      "ja": "ティムはchown"
    },
    {
      "indent": 6,
      "text": "Leonard Giuliano",
      "ja": "レオナルドジュリアーノ"
    },
    {
      "indent": 6,
      "text": "Jake Holland",
      "ja": "ジェイクオランダ"
    },
    {
      "indent": 6,
      "text": "Joel Jaeggli",
      "ja": "ジョエルJaeggli"
    },
    {
      "indent": 6,
      "text": "Henrik Levkowetz",
      "ja": "ヘンリクLevkowetz"
    },
    {
      "indent": 6,
      "text": "Albert Manfredi",
      "ja": "アルバート・マンフレディ"
    },
    {
      "indent": 6,
      "text": "Stig Venaas",
      "ja": "スティグVenaas"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Percy S. Tarapore (editor) AT&T",
      "ja": "パーシー・S. Tarapore（エディタ）AT＆T"
    },
    {
      "indent": 3,
      "text": "Phone: 1-732-420-4172 Email: tarapore@att.com",
      "ja": "電話：1-732-420-4172 Eメール：tarapore@att.com"
    },
    {
      "indent": 3,
      "text": "Robert Sayko AT&T",
      "ja": "ロバートSayko AT＆T"
    },
    {
      "indent": 3,
      "text": "Phone: 1-732-420-3292 Email: rs1983@att.com",
      "ja": "電話：1-732-420-3292 Eメール：rs1983@att.com"
    },
    {
      "indent": 3,
      "text": "Greg Shepherd Cisco",
      "ja": "グレッグ・シェパードシスコ"
    },
    {
      "indent": 3,
      "text": "Email: shep@cisco.com",
      "ja": "メール：shep@cisco.com"
    },
    {
      "indent": 3,
      "text": "Toerless Eckert (editor) Huawei USA - Futurewei Technologies Inc.",
      "ja": "Toerlessエッカート（編集）華為USA  -  Futureweiテクノロジーズ株式会社"
    },
    {
      "indent": 3,
      "text": "Email: tte+ietf@cs.fau.de, toerless.eckert@huawei.com",
      "ja": "メール：tte+ietf@cs.fau.de、toerless.eckert@huawei.com"
    },
    {
      "indent": 3,
      "text": "Ram Krishnan SupportVectors",
      "ja": "ラムクリシュナンSupportVectors"
    },
    {
      "indent": 3,
      "text": "Email: ramkri123@gmail.com",
      "ja": "メール：ramkri123@gmail.com"
    }
  ]
}