{
  "title": {
    "text": "RFC 8508 - IMAP REPLACE Extension",
    "ja": "RFC 8508 - IMAPは、拡張子をREPLACE"
  },
  "number": 8508,
  "created_at": "2019-10-29 14:02:20.604529+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                         S. Brandt\nRequest for Comments: 8508                                       Verizon\nCategory: Standards Track                                   January 2019\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 25,
      "text": "IMAP REPLACE Extension",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines an IMAP extension that can be used to replace an existing message in a message store with a new message. Message replacement is a common operation for clients that automatically save drafts or notes as a user composes them.",
      "ja": "この文書は、新しいメッセージでメッセージストア内の既存のメッセージを置き換えるために使用することができるIMAP拡張を定義します。メッセージ交換は、ユーザーがそれらを構成するように自動的にドラフトやメモを保存し、クライアントのための一般的な操作です。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8508.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttps://www.rfc-editor.org/info/rfc8508で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2019 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2019 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（https://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Overview  . . . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Conventions Used in This Document . . . . . . . . . . . . . .   3\n3.  REPLACE and UID REPLACE . . . . . . . . . . . . . . . . . . .   3\n  3.1.  Advertising Support for REPLACE . . . . . . . . . . . . .   3\n  3.2.  REPLACE Command . . . . . . . . . . . . . . . . . . . . .   3\n  3.3.  UID REPLACE Command . . . . . . . . . . . . . . . . . . .   4\n  3.4.  Semantics of REPLACE and UID REPLACE  . . . . . . . . . .   5\n  3.5.  IMAP State Diagram Impacts  . . . . . . . . . . . . . . .   6\n4.  Interaction with Other Extensions . . . . . . . . . . . . . .   6\n  4.1.  ACL . . . . . . . . . . . . . . . . . . . . . . . . . . .   6\n  4.2.  CATENATE  . . . . . . . . . . . . . . . . . . . . . . . .   6\n  4.3.  UIDPLUS . . . . . . . . . . . . . . . . . . . . . . . . .   8\n  4.4.  IMAP Events in Sieve  . . . . . . . . . . . . . . . . . .   8\n  4.5.  CONDSTORE/QRESYNC . . . . . . . . . . . . . . . . . . . .   8\n  4.6.  OBJECTID  . . . . . . . . . . . . . . . . . . . . . . . .   8\n  4.7.  MULTIAPPEND . . . . . . . . . . . . . . . . . . . . . . .   8\n5.  Formal Syntax . . . . . . . . . . . . . . . . . . . . . . . .   9\n6.  Security Considerations . . . . . . . . . . . . . . . . . . .   9\n7.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   9\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   9\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . .   9\n  8.2.  Informative References  . . . . . . . . . . . . . . . . .  10\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  11\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .  11",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Overview",
      "section_title": true,
      "ja": "1。概要"
    },
    {
      "indent": 3,
      "text": "This document defines an IMAP ([RFC3501]) extension to facilitate the replacement of an existing message with a new one. This is accomplished by defining a new REPLACE command and extending the Unique Identifier (UID) command to allow UID REPLACE.",
      "ja": "この文書は、新しいものと既存のメッセージの交換を容易にするために、IMAP（[RFC3501]）拡張を定義します。これは、新しいREPLACEコマンドを定義し、UIDがREPLACEできるように固有の識別子（UID）コマンドを拡張することによって達成されます。"
    },
    {
      "indent": 3,
      "text": "Since there is no replace function in the base IMAP specification, clients have instead had to use a combination of three separate commands issued in serial fashion; APPEND, STORE, and EXPUNGE. Pipelining of these three commands is not recommended since failure of any individual command should prevent subsequent commands from being executed lest the original message version be lost.",
      "ja": "何のベースIMAP仕様で機能が置き換えられているので、クライアントは、代わりにシリアル方式で発行された3つの別々のコマンドを組み合わせて使用​​していたなかったです。 APPEND、STORE、およびEXPUNGE。これら三つのコマンドのパイプライン化は、元のメッセージのバージョンが失われないように実行されてから後続のコマンドを防ぐ必要がある任意の個々のコマンドの失敗以来、推奨されません。"
    },
    {
      "indent": 3,
      "text": "Because of the non-atomic nature of the existing sequence, interruptions can leave messages in intermediate states that can be seen and acted upon by other clients. Such interruptions can also strand older revisions of messages, thereby forcing the user to manually clean up multiple revisions of the same message in order to avoid wasteful quota consumption. Additionally, the existing sequence can fail on APPEND due to an over-quota condition even though the subsequent STORE/EXPUNGE would free up enough space for the newly revised message. And finally, server efficiencies may be possible with a single logical message replacement operation as compared to the existing APPEND/STORE/EXPUNGE sequence.",
      "ja": "そのため、既存の配列の非アトミックな性質のため、中断が見られると、他のクライアントによって作用することができ中間状態でメッセージを残すことができます。このような中断はまた、これにより手動で無駄なクォータの消費を避けるために、同じメッセージの複数のリビジョンをクリーンアップするためにユーザーを強制的に、メッセージの古いリビジョンをストランドことができます。さらに、既存のシーケンスは、後続STORE / EXPUNGEは、新たに改訂されたメッセージのための十分なスペースを空けるだろうにもかかわらずによる過クォータ状態にAPPENDに失敗する可能性があります。そして最後に、サーバーの効率が既存のAPPEND / STORE / EXPUNGE配列と比較して、単一の論理メッセージの交換作業で可能かもしれません。"
    },
    {
      "indent": 3,
      "text": "In its simplest form, the REPLACE command is a single-command encapsulation of APPEND, STORE +flags \\DELETED, and UID EXPUNGE for a message, except that it avoids any of the quota implications or intermediate states associated with the three-command sequence. Server developers are encouraged to implement REPLACE as an atomic operation to simplify error handling, minimize operational concerns, and reduce potential security problems. For systems where this is not possible, communication with the requesting client must ensure no confusion of message store state. A server MUST NOT generate a response code for the STORE +flags \\DELETED portion of the sequence. Additionally, servers supporting the REPLACE command MUST NOT infer any inheritance of content, flags, or annotations from the message being replaced.",
      "ja": "その最も単純な形態では、REPLACEコマンドは、クォータの影響または三コマンドシーケンスに関連付けられた中間状態のいずれかを回避すること以外は、メッセージのAPPEND、DELETED STORE +フラグ\\、およびUID EXPUNGEの単一のコマンドのカプセル化です。サーバーの開発者は、エラー処理を簡素化するために、原子操作としてREPLACE実装運用の懸念を最小限にし、潜在的なセキュリティ上の問題を軽減することが奨励されています。これが不可能なシステムでは、要求元のクライアントとの通信には、メッセージストアの状態の混乱を確保してはなりません。サーバーは、配列の一部を削除しSTORE +フラグ\\のための応答コードを生成してはなりません。また、REPLACEコマンドをサポートするサーバは、交換されるメッセージからコンテンツ、旗、または注釈のいずれかの継承を推測してはなりません。"
    },
    {
      "indent": 0,
      "text": "2. Conventions Used in This Document",
      "section_title": true,
      "ja": "この文書で使用される2.表記"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "キーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、 \"SHALL\"、 \"SHOULD\"、 \"ないもの\"、 \"推奨\" \"ない（SHOULD NOT）\"、 \"MAY\"、 \"推奨NOT\"、および「OPTIONAL BCP 14に記載されているように「この文書に解釈されるべきである[RFC2119]、[RFC8174]と、ここで示されるように、それらは、すべて大文字で表示された場合にのみ。"
    },
    {
      "indent": 3,
      "text": "Formal syntax is defined by [RFC5234].",
      "ja": "正式な構文は、[RFC5234]で定義されています。"
    },
    {
      "indent": 3,
      "text": "Example lines prefaced by \"C:\" are sent by the client, and ones prefaced by \"S:\" are sent by the server.",
      "ja": "「C：」で始まる例ラインは、クライアントによって送信され、「S：」で始まるものは、サーバによって送信されます。"
    },
    {
      "indent": 0,
      "text": "3. REPLACE and UID REPLACE",
      "section_title": true,
      "ja": "3. REPLACEとUID REPLACE"
    },
    {
      "indent": 0,
      "text": "3.1. Advertising Support for REPLACE",
      "section_title": true,
      "ja": "3.1。 REPLACEのための広告サポート"
    },
    {
      "indent": 3,
      "text": "Servers that implement the REPLACE extension will return \"REPLACE\" as one of the supported capabilities in the CAPABILITY command response.",
      "ja": "REPLACE拡張を実装するサーバは、CAPABILITYコマンド応答でサポートされている機能の一つとして、「REPLACE」を返します。"
    },
    {
      "indent": 0,
      "text": "3.2. REPLACE Command",
      "section_title": true,
      "ja": "3.2。コマンドをREPLACE"
    },
    {
      "indent": 3,
      "text": "Arguments: message sequence number mailbox name OPTIONAL flag parenthesized list OPTIONAL date/time string message literal",
      "ja": "引数：literalメッセージシーケンス番号、メールボックス名オプションのフラグ括弧リストの任意の日付/時刻文字列のメッセージ"
    },
    {
      "indent": 3,
      "text": "Responses: no specific responses for this command",
      "ja": "回答：このコマンドのための特定の応答がありません"
    },
    {
      "indent": 3,
      "text": "Result: OK - replace completed NO - replace error; can't remove specified message or can't add new message content BAD - command unknown or arguments invalid",
      "ja": "結果：OK  - 完了NOを交換する - エラーを置き換えます。指定したメッセージを削除することはできません、または新しいメッセージ内容BADを追加することはできません - コマンドが不明または引数無効"
    },
    {
      "indent": 3,
      "text": "Example: C: A003 REPLACE 4 Drafts (\\Seen \\Draft) {312} S: + Ready for literal data C: Date: Thu, 1 Jan 2015 00:05:00 -0500 (EST) C: From: Fritz Schmidt <fritz.ze@example.org> C: Subject: happy new year !! C: To: miss.mitzy@example.org C: Message-Id: <B238822388-0100000@example.org> C: MIME-Version: 1.0 C: Content-Type: TEXT/PLAIN; CHARSET=US-ASCII C: C: Just saw the best fireworks show. Wish you were here. C: S: * OK [APPENDUID 1 2000] Replacement Message ready S: * 5 EXISTS S: * 4 EXPUNGE S: A003 OK Replace completed",
      "ja": "例：C：リテラルデータCの+準備：A003 4件の下書きをREPLACE {312} S（\\ \\ドラフト見て）日付：木、2015年1月1日0時05分00秒-0500（EST）C：から：フリッツシュミット< fritz.ze@example.org> C：件名：ハッピーニューイヤー！ C：TO：miss.mitzy@example.orgのC：メッセージ-ID：<B238822388-0100000@example.org> C：MIME-バージョン：1.0 C：のContent-Type：text / plainの。 CHARSET = US-ASCII C：C：ちょうど最高の花火が表示されました。あなたがここにいたらいいのにと思う。 C：S：* OK [APPENDUID 1 2000]交換メッセージ準備S：* 5はSをEXISTS：* 4 EXPUNGEのS：A003 OKが完了交換してください"
    },
    {
      "indent": 0,
      "text": "3.3. UID REPLACE Command",
      "section_title": true,
      "ja": "3.3。 UIDは、コマンドをREPLACE"
    },
    {
      "indent": 3,
      "text": "This extends the first form of the UID command (see Section 6.4.8 of [RFC3501]) to add the REPLACE command defined above as a valid argument. This form of REPLACE uses a UID rather than a sequence number as its first parameter.",
      "ja": "これは、有効な引数として上記で定義されたREPLACEコマンドを追加する（[RFC3501]のセクション6.4.8を参照）UIDコマンドの最初の形式を拡張します。 REPLACEのこの形式は、最初のパラメータとしてUIDはなく、シーケンス番号を使用します。"
    },
    {
      "indent": 3,
      "text": "Example: C: A004 UID REPLACE 2000 Drafts (\\Seen \\Draft) {350} S: + Ready for literal data C: Date: Thu, 1 Jan 2015 00:06:00 -0500 (EST) C: From: Fritz Schmidt <fritz.ze@example.org> C: Subject: happy new year !! C: To: miss.mitzy@example.org C: Message-Id: <B238822389-0100000@example.org> C: MIME-Version: 1.0 C: Content-Type: TEXT/PLAIN; CHARSET=US-ASCII C: C: Just saw the best fireworks show. Wish you were here. C: Hopefully next year you can join us. C: S: * OK [APPENDUID 1 2001] Replacement Message ready S: * 5 EXISTS S: * 4 EXPUNGE S: A004 OK Replace completed",
      "ja": "例：C：リテラルデータCについて+準備：A004 UID 2000の下書き{350} S（\\ \\ドラフト見られる）をREPLACE日：木、2015年1月1日午前0時06分○○秒-0500（EST）C：から：フリッツシュミット<fritz.ze@example.org> C：件名：ハッピーニューイヤー！ C：TO：miss.mitzy@example.orgのC：メッセージ-ID：<B238822389-0100000@example.org> C：MIME-バージョン：1.0 C：のContent-Type：text / plainの。 CHARSET = US-ASCII C：C：ちょうど最高の花火が表示されました。あなたがここにいたらいいのにと思う。 C：うまくいけば来年あなたは私たちに参加することができます。 C：S：* OK [APPENDUID 1 2001]交換メッセージ準備S：* 5はSをEXISTS：* 4 EXPUNGEのS：A004 OKが完了交換してください"
    },
    {
      "indent": 0,
      "text": "3.4. Semantics of REPLACE and UID REPLACE",
      "section_title": true,
      "ja": "3.4。 REPLACEとUIDは、REPLACEのセマンティクス"
    },
    {
      "indent": 3,
      "text": "The REPLACE and UID REPLACE commands take five arguments: a message identifier, a named mailbox, an optional parenthesized flag list, an optional message date/time string, and a message literal. The message literal will be appended to the named mailbox, and the message specified by the message identifier will be removed from the selected mailbox. These operations will appear to the client as a single action. This has the same effect as the following sequence:",
      "ja": "REPLACE REPLACEとUIDコマンドは、5つの引数を取る：メッセージ識別子、名前のメールボックス、オプションの括弧で囲まれたフラグ一覧、オプションのメッセージの日付/時刻文字列、およびリテラルメッセージを。リテラルメッセージは、指定されたメールボックスに追加され、メッセージ識別子で指定されたメッセージは、選択されたメールボックスから削除されます。これらの操作は、単一のアクションとしてクライアントに表示されます。これは、次の順序と同じ効果があります。"
    },
    {
      "indent": 6,
      "text": "1. APPEND 2. [UID] STORE +FLAGS.SILENT \\DELETED 3. UID EXPUNGE",
      "ja": "1. APPEND 2. [UID] STORE + FLAGS.SILENT \\ DELETED 3. UID EXPUNGE"
    },
    {
      "indent": 3,
      "text": "In the cited sequence, the quota implications of APPEND are evaluated within the context of the pending EXPUNGE so that only the net quota consumption is considered. Additionally, the EXPUNGE portion of the sequence only applies to the specified message, not all messages flagged as \"\\Deleted\".",
      "ja": "引用されたシーケンスでは、APPENDのクォータの意味合いはネットのみクォータの消費量が考慮されるように、保留中のEXPUNGEのコンテキスト内で評価されます。また、シーケンスのEXPUNGE部分のみが指定されたメッセージではなく、「\\削除された」としてフラグが付けられたすべてのメッセージに適用されます。"
    },
    {
      "indent": 3,
      "text": "Although the effect of REPLACE is identical to the steps above, the semantics are not identical; similar to MOVE [RFC6851], the intermediate states do not occur and the response codes are different. In particular, the response codes for APPEND and EXPUNGE will be returned while those for the STORE operation MUST NOT be generated.",
      "ja": "REPLACEの効果は、上記の手順と同じであるが、意味は同じではありません。 [RFC6851]を移動させるために同様の、中間状態は発生せず、応答コードが異なっています。ストア動作のものが生成されない必要があるが、特に、APPENDとEXPUNGEの応答コードが返されます。"
    },
    {
      "indent": 3,
      "text": "When an error occurs while processing REPLACE or UID REPLACE, the server MUST NOT leave the selected mailbox in an inconsistent state; any untagged EXPUNGE response MUST NOT be sent until all actions are successfully completed.",
      "ja": "REPLACEまたはUID REPLACE処理中にエラーが発生した場合、サーバは、一貫性のない状態で選択されたメールボックスを残してはいけません。すべてのアクションが正常に完了するまで、任意のタグの付いていないEXPUNGE応答を送ってはいけません。"
    },
    {
      "indent": 3,
      "text": "While it may be common for the named mailbox argument to match the selected mailbox for the common use case of replacing a draft, the REPLACE extension intentionally does not require the two to be the same. As an example, it's possible to use the REPLACE command to replace a message in the \\Drafts special-use mailbox (see Section 2 of [RFC6154]) with a message in the \\Sent special-use mailbox following message submission.",
      "ja": "名前のメールボックス引数が草案を交換する一般的なユースケースのために選択したメールボックスと一致することが一般的かもしれないが、REPLACE拡張子が意図的に2つが同じであることを必要としません。例として、それは、\\でメッセージを表示して（[RFC6154]のセクション2を参照）\\下書きの特殊用途のメールボックスにメッセージを交換するためにREPLACEコマンドを使用することが可能ですメッセージ送信、次の特殊用途のメールボックスを送りました。"
    },
    {
      "indent": 3,
      "text": "Because of the similarity of REPLACE to APPEND, extensions that affect APPEND affect REPLACE in the same way. Response codes such as TRYCREATE (see Section 6.3.11 of [RFC3501]), along with those defined by extensions, are sent as appropriate. See Section 4 for more information about how REPLACE interacts with other IMAP extensions.",
      "ja": "そのため追加するREPLACEの類似性、APPENDに影響を与えるの拡張機能は、同じようにREPLACE影響を及ぼす。例えばTRYCREATEとして応答コードは、（[RFC3501]のセクション6.3.11を参照のこと）、拡張によって定義されたものと一緒に、必要に応じて送信されます。他のIMAP拡張と相互作用をREPLACE方法の詳細については、第4章を参照してください。"
    },
    {
      "indent": 0,
      "text": "3.5. IMAP State Diagram Impacts",
      "section_title": true,
      "ja": "3.5。 IMAP状態図への影響"
    },
    {
      "indent": 3,
      "text": "Unlike the APPEND command, which is valid in the authenticated state, the REPLACE and UID REPLACE commands MUST only be valid in the selected state. This difference from APPEND is necessary since REPLACE operates on message sequence numbers. Additionally, the REPLACE extension intentionally follows the convention for UID commands found in Section 6.4.8 of [RFC3501] in that the UID variant of the command does not support use from the authenticated state.",
      "ja": "認証された状態で有効なAPPENDコマンドとは異なり、REPLACEおよびUIDは、コマンドのみを選択した状態で有効でなければなりませんREPLACE。 REPLACEは、メッセージシーケンス番号に動作するのでAPPENDからこの違いが必要です。また、REPLACEの拡張は、意図的にコマンドのUIDバリアントは、認証された状態から使用をサポートしていないという点で、[RFC3501]のセクション6.4.8で見つかったUIDコマンドの規則に従います。"
    },
    {
      "indent": 0,
      "text": "4. Interaction with Other Extensions",
      "section_title": true,
      "ja": "その他の拡張4.対話"
    },
    {
      "indent": 3,
      "text": "This section describes how REPLACE interacts with some other IMAP extensions.",
      "ja": "このセクションでは、いくつかの他のIMAP拡張と相互作用をREPLACE方法を説明します。"
    },
    {
      "indent": 0,
      "text": "4.1. ACL",
      "section_title": true,
      "ja": "4.1。 ACL"
    },
    {
      "indent": 3,
      "text": "The Access Control List (ACL) rights [RFC4314] required for UID REPLACE are the union of the ACL rights required for UID STORE and UID EXPUNGE in the current mailbox, and APPEND in the target mailbox.",
      "ja": "UIDのために必要なアクセス制御リスト（ACL）の権限[RFC4314]は、現在のメールボックスにUID STOREとUID EXPUNGEに必要なACL権の組合ですREPLACE、およびターゲットメールボックスに追加します。"
    },
    {
      "indent": 0,
      "text": "4.2. CATENATE",
      "section_title": true,
      "ja": "4.2。 CATENATE"
    },
    {
      "indent": 3,
      "text": "Servers supporting both REPLACE and CATENATE [RFC4469] MUST support the additional append-data and resp-text-code elements defined in Section 5 (\"Formal Syntax\") of [RFC4469] in conjunction with the REPLACE command. When combined with CATENATE, REPLACE can become quite an efficient way of message manipulation.",
      "ja": "REPLACEとCATENATE [RFC4469]の両方サポートするサーバは、追加の追記データとREPLACEコマンドと一緒に[RFC4469]のセクション5（「正式な構文」）で定義されたRESPテキスト・コード要素をサポートしなければなりません。 CATENATEと組み合わせると、REPLACEメッセージ操作の非常に効率的な方法になることができます。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 5,
      "text": "User composes message and attaches photo\n----------------------------------------\nC: A010 APPEND Drafts (\\Seen \\Draft) {1201534}\nS: + Ready for literal data\nC: Date: Thu, 1 Jan 2015 00:10:00 -0500 (EST)\nC: From: Fritz Schmidt <fritz.ze@example.org>\nC: Message-ID: <B238822388-0100003@example.org>\nC: MIME-Version: 1.0\nC: Content-Type: multipart/mixed;\nC:         boundary=\"------------030305060306060609050804\"\nC:\nC: --------------030305060306060609050804\nC: Content-Type: text/plain; charset=utf-8; format=flowed\nC: Content-Transfer-Encoding: 7bit\nC:\nC: Here is picture from the fireworks\nC:\nC: Yours...\nC: Fritz\nC:\nC: --------------030305060306060609050804\nC: Content-Type: image/jpeg;\nC:         name=\"Fireworks.jpg\"\nC: Content-Transfer-Encoding: base64\nC: Content-Disposition: attachment;\nC:         filename=\"Fireworks.jpg\"\nC:\n  <large base64 encoded part goes here>\nC:\nC: --------------030305060306060609050804--\nS: A010 OK [APPENDUID 1 3002] APPEND complete",
      "raw": true
    },
    {
      "indent": 5,
      "text": "User completes message with To: and Subject: fields\n---------------------------------------------------\nC: A011 UID REPLACE 3002 Drafts CATENATE (TEXT {71}\nS: + Ready for literal data\nC: To: Mitzy <miss.mitzy@example.org>\nC: Subject: My view of the fireworks\nC:  URL \"/Drafts/;UID=3002\")\nS: * OK [APPENDUID 1 3003] Replacement Message ready\nS: * 5 EXISTS\nS: * 4 EXPUNGE\nS: A011 OK REPLACE completed",
      "raw": true
    },
    {
      "indent": 0,
      "text": "4.3. UIDPLUS",
      "section_title": true,
      "ja": "4.3。 UIDPLUS"
    },
    {
      "indent": 3,
      "text": "Servers supporting both REPLACE and UIDPLUS [RFC4315] SHOULD send APPENDUID in response to a UID REPLACE command. For additional information, see Section 3 of [RFC4315]. Servers implementing REPLACE and UIDPLUS are also advised to send the APPENDUID response code in an untagged OK before sending the EXPUNGE or replaced responses. (Sending APPENDUID in the tagged OK as described in the UIDPLUS specification means that the client first receives EXPUNGE for a message and afterwards APPENDUID for the new message. It can be unnecessarily difficult to process that sequence usefully.)",
      "ja": "REPLACEとUIDPLUS [RFC4315]の両方支持サーバーはUID REPLACEコマンドに応答してAPPENDUIDを送信すべきです。詳細については、[RFC4315]のセクション3を参照してください。サーバーは、REPLACE実装とUIDPLUSもEXPUNGEまたは交換応答を送信する前に、タグなしOKでAPPENDUID応答コードを送信することをお勧めします。 （UIDPLUS仕様書に記載されるようにタグ付けされたOKでAPPENDUIDを送信すると、クライアントは最初に新しいメッセージのメッセージのEXPUNGEを受信し、その後APPENDUIDことを意味する。有用そのシーケンスを処理するために不必要に困難であり得ます。）"
    },
    {
      "indent": 0,
      "text": "4.4. IMAP Events in Sieve",
      "section_title": true,
      "ja": "4.4。ふるいでIMAPのイベント"
    },
    {
      "indent": 3,
      "text": "REPLACE applies to IMAP events in Sieve [RFC6785] in the same way that APPEND does. Therefore, REPLACE can cause a Sieve script to be invoked with the imap.cause set to \"APPEND\". Because the intermediate state of STORE +FLAGS.SILENT \\DELETED is not exposed by REPLACE, no action will be taken that results in an imap.cause of FLAG.",
      "ja": "んAPPEND同じようにふるい[RFC6785]でIMAPイベントに適用されREPLACE。したがって、REPLACEは、Sieveスクリプトは、「APPEND」に設定imap.causeで呼び出されることがあります。 STORE + FLAGS.SILENT \\ DELETEDの中間状態は、REPLACEによって公開されていないので、何もアクションはFLAGのimap.causeで結果というとられません。"
    },
    {
      "indent": 0,
      "text": "4.5. CONDSTORE/QRESYNC",
      "section_title": true,
      "ja": "4.5。 CONDSTORE / QRESYNC"
    },
    {
      "indent": 3,
      "text": "Servers implementing both REPLACE and CONDSTORE/QRESYNC [RFC7162] MUST treat the message being replaced as if it were being removed with a UID EXPUNGE command. Sections 3.2.9 and 3.2.10 of [RFC7162] are particularly relevant for this condition.",
      "ja": "それはUID EXPUNGEコマンドで除去されたかのように交換しCONDSTORE / QRESYNC [RFC7162]の両方の実装のサーバが交換されるメッセージを処理しなければなりません。セクション3.2.9と[RFC7162]の3.2.10は、この条件のために特に関連します。"
    },
    {
      "indent": 0,
      "text": "4.6. OBJECTID",
      "section_title": true,
      "ja": "4.6。 OBJECTID"
    },
    {
      "indent": 3,
      "text": "Servers implementing both REPLACE and OBJECTID [RFC8474] MUST return different EMAILIDs for both the replaced and replacing messages. The only exception to this is the case outlined in Section 5.1 (\"EMAILID Identifier for Identical Messages\") of [RFC8474] when the server detects that both messages' immutable content is identical.",
      "ja": "[RFC8474]を交換し、OBJECTID両方実装したサーバは、両方の取り替えおよび交換のメッセージの異なるEMAILIDsを返さなければなりません。これに対する唯一の例外は、サーバが両方のメッセージ不変のコンテンツが同一であることを検出した場合、[RFC8474]のセクション5.1（「同一メッセージのEMAILID識別子」）に概説された場合です。"
    },
    {
      "indent": 0,
      "text": "4.7. MULTIAPPEND",
      "section_title": true,
      "ja": "4.7。 MULTIAPPEND"
    },
    {
      "indent": 3,
      "text": "The REPLACE extension has no interaction with MULTIAPPEND [RFC3502]. This document explicitly does not outline a method for replacing multiple messages concurrently.",
      "ja": "REPLACE拡張子はMULTIAPPEND [RFC3502]との相互作用を持っていません。この文書は、明示的に並行して複数のメッセージを交換するための方法を概説していません。"
    },
    {
      "indent": 0,
      "text": "5. Formal Syntax",
      "section_title": true,
      "ja": "5.正式な構文"
    },
    {
      "indent": 3,
      "text": "The following syntax specification uses the Augmented Backus-Naur Form (ABNF) notation as specified in [RFC5234]. [RFC3501] defines the non-terminals \"capability\",\"command-select\", \"mailbox\", \"seq-number\", and \"uid\". [RFC4466] defines the non-terminal \"append-message\".",
      "ja": "以下の構文仕様は、[RFC5234]で指定された拡張バッカス・ナウアフォーム（ABNF）の表記を使用します。 [RFC3501]非終端「能力」を定義し、「コマンド選択」、「メールボックス」、「配列番号」、および「UID」。 [RFC4466]は非末端「追加メッセージ」を定義します。"
    },
    {
      "indent": 3,
      "text": "Except as noted otherwise, all alphabetic characters are case insensitive. The use of uppercase or lowercase characters to define token strings is for editorial clarity only. Implementations MUST accept these strings in a case-insensitive fashion.",
      "ja": "特記しないものを除いて、すべての英字は大文字小文字を区別しません。トークン文字列を定義するには、大文字と小文字の使用は、編集上明確にするためです。実装は大文字と小文字を区別しないやり方で、これらの文字列を受け入れなければなりません。"
    },
    {
      "indent": 3,
      "text": "capability =/ \"REPLACE\"",
      "ja": "機能= / \"REPLACE\""
    },
    {
      "indent": 3,
      "text": "command-select =/ replace replace = \"REPLACE\" SP seq-number SP mailbox append-message uid =/ \"UID\" SP replace",
      "ja": "コマンド選択= /置き換える置き換え= \"REPLACE\" SP配列番号SPメールボックス追記メッセージのUID = / \"UID\" SP置き換えます"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document is believed to add no security problems beyond those that may already exist with the base IMAP specification. The REPLACE command may actually prevent some potential security problems because it avoids intermediate message states that could possibly be exploited by an attacker.",
      "ja": "この文書は、すでにベースIMAP仕様に存在し得るものを超えてはセキュリティ上の問題を追加していないと考えられています。それはおそらく、攻撃者によって悪用される可能性が中間のメッセージ状態を避けるため、REPLACEコマンドは、実際にいくつかの潜在的なセキュリティ上の問題を防ぐことができます。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "The IANA has added REPLACE to the \"IMAP Capabilities\" registry at <https://www.iana.org/assignments/imap-capabilities>.",
      "ja": "IANAは、<https://www.iana.org/assignments/imap-capabilities>で「IMAP機能」レジストリにREPLACE追加しました。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3501] Crispin, M., \"INTERNET MESSAGE ACCESS PROTOCOL - VERSION 4rev1\", RFC 3501, DOI 10.17487/RFC3501, March 2003, <https://www.rfc-editor.org/info/rfc3501>.",
      "ja": "[RFC3501]のCrispin、M.、 \"インターネットメッセージアクセスプロトコル -  VERSION 4rev1\"、RFC 3501、DOI 10.17487 / RFC3501、2003年3月、<https://www.rfc-editor.org/info/rfc3501>。"
    },
    {
      "indent": 3,
      "text": "[RFC4314] Melnikov, A., \"IMAP4 Access Control List (ACL) Extension\", RFC 4314, DOI 10.17487/RFC4314, December 2005, <https://www.rfc-editor.org/info/rfc4314>.",
      "ja": "[RFC4314]メルニコフ、A.、 \"IMAP4アクセス制御リスト（ACL）拡張\"、RFC 4314、DOI 10.17487 / RFC4314、2005年12月、<https://www.rfc-editor.org/info/rfc4314>。"
    },
    {
      "indent": 3,
      "text": "[RFC4315] Crispin, M., \"Internet Message Access Protocol (IMAP) - UIDPLUS extension\", RFC 4315, DOI 10.17487/RFC4315, December 2005, <https://www.rfc-editor.org/info/rfc4315>.",
      "ja": "[RFC4315]のCrispin、M.、 \"インターネットメッセージアクセスプロトコル（IMAP） -  UIDPLUS拡張\"、RFC 4315、DOI 10.17487 / RFC4315、2005年12月<https://www.rfc-editor.org/info/rfc4315>。"
    },
    {
      "indent": 3,
      "text": "[RFC4466] Melnikov, A. and C. Daboo, \"Collected Extensions to IMAP4 ABNF\", RFC 4466, DOI 10.17487/RFC4466, April 2006, <https://www.rfc-editor.org/info/rfc4466>.",
      "ja": "[RFC4466]メルニコフ、A.およびC. Daboo、 \"IMAP4 ABNFに収集された拡張機能\"、RFC 4466、DOI 10.17487 / RFC4466、2006年4月、<https://www.rfc-editor.org/info/rfc4466>。"
    },
    {
      "indent": 3,
      "text": "[RFC4469] Resnick, P., \"Internet Message Access Protocol (IMAP) CATENATE Extension\", RFC 4469, DOI 10.17487/RFC4469, April 2006, <https://www.rfc-editor.org/info/rfc4469>.",
      "ja": "[RFC4469]レズニック、P.、 \"インターネットメッセージアクセスプロトコル（IMAP）CATENATE拡張\"、RFC 4469、DOI 10.17487 / RFC4469、2006年4月、<https://www.rfc-editor.org/info/rfc4469>。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, DOI 10.17487/RFC5234, January 2008, <https://www.rfc-editor.org/info/rfc5234>.",
      "ja": "[RFC5234]クロッカー、D.、エド。そして、P. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、STD 68、RFC 5234、DOI 10.17487 / RFC5234、2008年1月、<https://www.rfc-editor.org/info/rfc5234>。"
    },
    {
      "indent": 3,
      "text": "[RFC6785] Leiba, B., \"Support for Internet Message Access Protocol (IMAP) Events in Sieve\", RFC 6785, DOI 10.17487/RFC6785, November 2012, <https://www.rfc-editor.org/info/rfc6785>.",
      "ja": "[RFC6785] Leiba、B.、RFC 6785 \"IMAP（Internet Message Access Protocol）のふるいでのイベントのサポート\"、DOI 10.17487 / RFC6785、2012年11月、<https://www.rfc-editor.org/info/rfc6785 >。"
    },
    {
      "indent": 3,
      "text": "[RFC7162] Melnikov, A. and D. Cridland, \"IMAP Extensions: Quick Flag Changes Resynchronization (CONDSTORE) and Quick Mailbox Resynchronization (QRESYNC)\", RFC 7162, DOI 10.17487/RFC7162, May 2014, <https://www.rfc-editor.org/info/rfc7162>.",
      "ja": "[RFC7162]メルニコフ、A.とD. Cridland、 \"IMAP拡張機能：クイックフラグの変更を再同期（CONDSTORE）とクイックメールボックス再同期（QRESYNC）\"、RFC 7162、DOI 10.17487 / RFC7162、2014年5月、<https：//でWWW。 rfc-editor.org/info/rfc7162>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B.、 \"RFC 2119個のキーワードに小文字VS大文字の曖昧さ\"、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 3,
      "text": "[RFC8474] Gondwana, B., Ed., \"IMAP Extension for Object Identifiers\", RFC 8474, DOI 10.17487/RFC8474, September 2018, <https://www.rfc-editor.org/info/rfc8474>.",
      "ja": "[RFC8474]ゴンドワナ、B.編、 \"オブジェクト識別子のIMAP拡張\"、RFC 8474、DOI 10.17487 / RFC8474、2018年9月、<https://www.rfc-editor.org/info/rfc8474>。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3502] Crispin, M., \"Internet Message Access Protocol (IMAP) - MULTIAPPEND Extension\", RFC 3502, DOI 10.17487/RFC3502, March 2003, <https://www.rfc-editor.org/info/rfc3502>.",
      "ja": "[RFC3502]のCrispin、M.、 \"インターネットメッセージアクセスプロトコル（IMAP） -  MULTIAPPEND拡張\"、RFC 3502、DOI 10.17487 / RFC3502、2003年3月、<https://www.rfc-editor.org/info/rfc3502>。"
    },
    {
      "indent": 3,
      "text": "[RFC6154] Leiba, B. and J. Nicolson, \"IMAP LIST Extension for Special-Use Mailboxes\", RFC 6154, DOI 10.17487/RFC6154, March 2011, <https://www.rfc-editor.org/info/rfc6154>.",
      "ja": "[RFC6154] Leiba、B.とJ.ニコルソン、 \"特殊用途のメールボックス用のIMAP LIST拡張\"、RFC 6154、DOI 10.17487 / RFC6154、2011年3月、<https://www.rfc-editor.org/info/rfc6154 >。"
    },
    {
      "indent": 3,
      "text": "[RFC6851] Gulbrandsen, A. and N. Freed, Ed., \"Internet Message Access Protocol (IMAP) - MOVE Extension\", RFC 6851, DOI 10.17487/RFC6851, January 2013, <https://www.rfc-editor.org/info/rfc6851>.",
      "ja": "[RFC6851] Gulbrandsenの、A.およびN.フリード、エド、 \"インターネットメッセージアクセスプロトコル（IMAP） -  MOVE拡張\"、RFC 6851、DOI 10.17487 / RFC6851、2013年1月、<HTTPS：。//www.rfc-editor。組織/情報/ rfc6851>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The author would like to thank the participants of IMAPEXT with particular thanks to Arnt Gulbrandsen, Alexey Melnikov, Chris Newman, and Bron Gondwana for their specific contributions.",
      "ja": "著者は、彼らの特定の貢献のためARNT Gulbrandsenの、アレクセイ・メルニコフ、クリス・ニューマン、およびブロンゴンドワナに特定のおかげでIMAPEXTの参加者に感謝したいと思います。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Stuart Brandt Verizon 22001 Loudoun County Parkway Ashburn, VA 20147 United States of America",
      "ja": "スチュアートブラントベライゾン22001ラウドン郡パークウェイアッシュバーン、VAアメリカの20147米国"
    },
    {
      "indent": 3,
      "text": "Email: stujenerin@aol.com",
      "ja": "メール：stujenerin@aol.com"
    }
  ]
}