{
  "title": {
    "text": "RFC 8708 - Use of the HSS/LMS Hash-Based Signature Algorithm in the Cryptographic Message Syntax (CMS)",
    "ja": "RFC 8708 - 暗号メッセージ構文（CMS）でのHSS / LMSハッシュベースの署名アルゴリズムの使用"
  },
  "number": 8708,
  "created_at": "2020-03-11 15:23:45.690132+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        R. Housley\nRequest for Comments: 8708                                Vigil Security\nCategory: Standards Track                                  February 2020\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 1,
      "text": "Use of the HSS/LMS Hash-Based Signature Algorithm in the Cryptographic Message Syntax (CMS)",
      "ja": "暗号メッセージ構文（CMS）でのHSS / LMSハッシュベースの署名アルゴリズムの使用"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This document specifies the conventions for using the Hierarchical Signature System (HSS) / Leighton-Micali Signature (LMS) hash-based signature algorithm with the Cryptographic Message Syntax (CMS). In addition, the algorithm identifier and public key syntax are provided. The HSS/LMS algorithm is one form of hash-based digital signature; it is described in RFC 8554.",
      "ja": "このドキュメントでは、Cryptographic Message Syntax（CMS）で階層型署名システム（HSS）/ Leighton-Micali Signature（LMS）ハッシュベースの署名アルゴリズムを使用するための規則を指定します。 さらに、アルゴリズム識別子と公開キー構文が提供されます。 HSS / LMSアルゴリズムは、ハッシュベースのデジタル署名の1つの形式です。 RFC 8554に記載されています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット標準化過程の文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、Internet Engineering Task Force（IETF）の製品です。 IETFコミュニティのコンセンサスを表しています。 これは公開レビューを受けており、Internet Engineering Steering Group（IESG）による公開が承認されています。 インターネット標準の詳細については、RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8708.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックに関する情報は、https：//www.rfc-editor.org/info/rfc8708で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2020 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2020 IETF Trustおよび文書作成者として特定された人物。 全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、このドキュメントの公開日に有効なBCP 78およびIETFトラストのIETFドキュメントに関連する法的条項（https://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているので、注意深く確認してください。 このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseテキストを含める必要があり、Simplified BSD Licenseに記載されている保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction 1.1. ASN.1 1.2. Terminology 1.3. Motivation 2. HSS/LMS Hash-Based Signature Algorithm Overview 2.1. Hierarchical Signature System (HSS) 2.2. Leighton-Micali Signature (LMS) 2.3. Leighton-Micali One-Time Signature (LM-OTS) Algorithm 3. Algorithm Identifiers and Parameters 4. HSS/LMS Public Key Identifier 5. Signed-Data Conventions 6. Security Considerations 7. IANA Considerations 8. References 8.1. Normative References 8.2. Informative References Appendix A. ASN.1 Module Acknowledgements Author's Address",
      "ja": "1. はじめに1.1。 ASN.1 1.2。 用語1.3。 動機2. HSS / LMSハッシュベースの署名アルゴリズムの概要2.1。 階層署名システム（HSS）2.2。 レイトン・ミカリ署名（LMS）2.3。 Leighton-Micaliワンタイム署名（LM-OTS）アルゴリズム3.アルゴリズム識別子とパラメーター4. HSS / LMS公開キー識別子5.署名付きデータ規約6.セキュリティに関する考慮事項7. IANAに関する考慮事項8.参照先8.1。 規範的な参考資料8.2。 参考情報付録A. ASN.1モジュールの謝辞著者のアドレス"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document specifies the conventions for using the Hierarchical Signature System (HSS) / Leighton-Micali Signature (LMS) hash-based signature algorithm with the Cryptographic Message Syntax (CMS) [CMS] signed-data content type. The LMS system provides a one-time digital signature that is a variant of Merkle Tree Signatures (MTS). The HSS is built on top of the LMS system to efficiently scale for a larger numbers of signatures. The HSS/LMS algorithm is one form of hash-based digital signature, and it is described in [HASHSIG]. The HSS/ LMS signature algorithm can only be used for a fixed number of signing operations with a given private key, and the number of signing operations depends upon the size of the tree. The HSS/LMS signature algorithm uses small public keys, and it has low computational cost; however, the signatures are quite large. The HSS/LMS private key can be very small when the signer is willing to perform additional computation at signing time; alternatively, the private key can consume additional memory and provide a faster signing time. The HSS/LMS signatures [HASHSIG] are currently defined to exclusively use SHA-256 [SHS].",
      "ja": "このドキュメントは、暗号メッセージ構文（CMS）[CMS]署名データコンテンツタイプで階層型署名システム（HSS）/ Leighton-Micali署名（LMS）ハッシュベースの署名アルゴリズムを使用するための規則を指定します。 LMSシステムは、Merkle Tree Signatures（MTS）のバリアントであるワンタイムデジタル署名を提供します。 HSSはLMSシステムの上に構築され、より多くの署名に効率的に対応します。 HSS / LMSアルゴリズムは、ハッシュベースのデジタル署名の1つの形式であり、[HASHSIG]で説明されています。 HSS / LMS署名アルゴリズムは、特定の秘密鍵を使用した一定数の署名操作にのみ使用でき、署名操作の数はツリーのサイズに依存します。 HSS / LMS署名アルゴリズムは小さな公開キーを使用し、計算コストが低くなります。ただし、署名は非常に大きくなります。署名者が署名時に追加の計算を実行する場合、HSS / LMS秘密鍵は非常に小さくなります。または、秘密キーは追加のメモリを消費し、署名時間を短縮できます。 HSS / LMS署名[HASHSIG]は現在、SHA-256 [SHS]のみを使用するように定義されています。"
    },
    {
      "indent": 0,
      "text": "1.1. ASN.1",
      "section_title": true,
      "ja": "1.1. ASN.1"
    },
    {
      "indent": 3,
      "text": "CMS values are generated using ASN.1 [ASN1-B], using the Basic Encoding Rules (BER) and the Distinguished Encoding Rules (DER) [ASN1-E].",
      "ja": "CMS値は、ASN.1 [ASN1-B]を使用して、基本エンコーディングルール（BER）および識別エンコーディングルール（DER）[ASN1-E]を使用して生成されます。"
    },
    {
      "indent": 0,
      "text": "1.2. Terminology",
      "section_title": true,
      "ja": "1.2. 用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.3. Motivation",
      "section_title": true,
      "ja": "1.3. 動機"
    },
    {
      "indent": 3,
      "text": "Recent advances in cryptanalysis [BH2013] and progress in the development of quantum computers [NAS2019] pose a threat to widely deployed digital signature algorithms. As a result, there is a need to prepare for a day when cryptosystems such as RSA and DSA that depend on discrete logarithms and factoring cannot be depended upon.",
      "ja": "暗号解読の最近の進歩[BH2013]および量子コンピューターの開発の進歩[NAS2019]は、広く展開されているデジタル署名アルゴリズムに対する脅威をもたらします。 その結果、離散対数や因数分解に依存するRSAやDSAなどの暗号システムに依存できない日を準備する必要があります。"
    },
    {
      "indent": 3,
      "text": "If large-scale quantum computers are ever built, these computers will be able to break many of the public key cryptosystems currently in use. A post-quantum cryptosystem [PQC] is a system that is secure against quantum computers that have more than a trivial number of quantum bits (qubits). It is open to conjecture when it will be feasible to build such computers; however, RSA, DSA, Elliptic Curve Digital Signature Algorithm (ECDSA), and Edwards-curve Digital Signature Algorithm (EdDSA) are all vulnerable if large-scale quantum computers are ever developed.",
      "ja": "大規模な量子コンピューターが構築された場合、これらのコンピューターは現在使用されている公開鍵暗号システムの多くを破壊することができます。 ポスト量子暗号システム[PQC]は、些細な数の量子ビット（qubit）を超える量子コンピューターに対して安全なシステムです。 そのようなコンピュータを構築することが実現可能になると予想される場合があります。 ただし、大規模な量子コンピューターが開発された場合、RSA、DSA、楕円曲線デジタル署名アルゴリズム（ECDSA）、およびエドワーズ曲線デジタル署名アルゴリズム（EdDSA）はすべて脆弱です。"
    },
    {
      "indent": 3,
      "text": "Since the HSS/LMS signature algorithm does not depend on the difficulty of discrete logarithms or factoring, the HSS/LMS signature algorithm is considered to be post-quantum secure. One use of post-quantum-secure signatures is the protection of software updates, perhaps using the format described in [FWPROT], to enable deployment of software that implements new cryptosystems.",
      "ja": "HSS / LMS署名アルゴリズムは離散対数や因数分解の難しさに依存していないため、HSS / LMS署名アルゴリズムは事後量子安全であると見なされます。 量子安全後の署名の1つの使用法は、おそらく[FWPROT]で説明されている形式を使用して、新しい暗号システムを実装するソフトウェアの展開を可能にするソフトウェア更新の保護です。"
    },
    {
      "indent": 0,
      "text": "2. HSS/LMS Hash-Based Signature Algorithm Overview",
      "section_title": true,
      "ja": "2. HSS / LMSハッシュベースの署名アルゴリズムの概要"
    },
    {
      "indent": 3,
      "text": "Merkle Tree Signatures (MTS) are a method for signing a large but fixed number of messages. An MTS system depends on a one-time signature method and a collision-resistant hash function.",
      "ja": "マークルツリー署名（MTS）は、多数の固定された数のメッセージに署名する方法です。 MTSシステムは、1回限りの署名方式と耐衝突ハッシュ関数に依存しています。"
    },
    {
      "indent": 3,
      "text": "This specification makes use of the hash-based algorithm specified in [HASHSIG], which is the Leighton and Micali adaptation [LM] of the original Lamport-Diffie-Winternitz-Merkle one-time signature system [M1979] [M1987] [M1989a] [M1989b].",
      "ja": "この仕様は、[HASHSIG]で指定されたハッシュベースのアルゴリズムを利用します。これは、元のLamport-Diffie-Winternitz-Merkleワンタイム署名システム[L1979] [M1987] [M1989a]のLeightonおよびMicali適応[LM]です。 [M1989b]。"
    },
    {
      "indent": 3,
      "text": "As implied by the name, the hash-based signature algorithm depends on a collision-resistant hash function. The hash-based signature algorithm specified in [HASHSIG] uses only the SHA-256 one-way hash function [SHS], but it establishes an IANA registry [IANA-LMS] to permit the registration of additional one-way hash functions in the future.",
      "ja": "名前が示すように、ハッシュベースの署名アルゴリズムは、衝突に強いハッシュ関数に依存しています。 [HASHSIG]で指定されたハッシュベースの署名アルゴリズムは、SHA-256一方向ハッシュ関数[SHS]のみを使用しますが、IANAレジストリ[IANA-LMS]を確立して、追加の一方向ハッシュ関数の登録を許可します 未来。"
    },
    {
      "indent": 0,
      "text": "2.1. Hierarchical Signature System (HSS)",
      "section_title": true,
      "ja": "2.1. 階層署名システム（HSS）"
    },
    {
      "indent": 3,
      "text": "The MTS system specified in [HASHSIG] uses a hierarchy of trees. The N-time Hierarchical Signature System (HSS) allows subordinate trees to be generated when needed by the signer. Otherwise, generation of the entire tree might take weeks or longer.",
      "ja": "[HASHSIG]で指定されたMTSシステムは、ツリーの階層を使用します。 N-time Hierarchical Signature System（HSS）により、署名者が必要なときに下位ツリーを生成できます。 そうしないと、ツリー全体の生成に数週間以上かかる場合があります。"
    },
    {
      "indent": 3,
      "text": "An HSS signature as specified in [HASHSIG] carries the number of signed public keys (Nspk), followed by that number of signed public keys, followed by the LMS signature as described in Section 2.2. The public key for the topmost LMS tree is the public key of the HSS system. The LMS private key in the parent tree signs the LMS public key in the child tree, and the LMS private key in the bottom-most tree signs the actual message. The signature over the public key and the signature over the actual message are LMS signatures as described in Section 2.2.",
      "ja": "[HASHSIG]で指定されているHSS署名は、署名された公開鍵（Nspk）の数、それに続く署名された公開鍵の数、セクション2.2で説明されているLMS署名が続きます。 最上位のLMSツリーの公開鍵は、HSSシステムの公開鍵です。 親ツリーのLMS秘密鍵は子ツリーのLMS公開鍵に署名し、最下部のツリーのLMS秘密鍵は実際のメッセージに署名します。 公開鍵に対する署名と実際のメッセージに対する署名は、セクション2.2で説明されているLMS署名です。"
    },
    {
      "indent": 3,
      "text": "The elements of the HSS signature value for a standalone tree (a top tree with no children) can be summarized as:",
      "ja": "スタンドアロンツリー（子のない最上位ツリー）のHSS署名値の要素は、次のように要約できます。"
    },
    {
      "indent": 6,
      "text": "u32str(0) ||\nlms_signature  /* signature of message */",
      "raw": true
    },
    {
      "indent": 3,
      "text": "where, u32str() and || are used as defined in [HASHSIG].",
      "ja": "ここで、u32str（）および|| [HASHSIG]で定義されているように使用されます。"
    },
    {
      "indent": 3,
      "text": "The elements of the HSS signature value for a tree with Nspk signed public keys can be summarized as:",
      "ja": "Nspk署名付き公開キーを持つツリーのHSS署名値の要素は、次のように要約できます。"
    },
    {
      "indent": 6,
      "text": "u32str(Nspk) ||\nsigned_public_key[0] ||\nsigned_public_key[1] ||\n   ...\nsigned_public_key[Nspk-2] ||\nsigned_public_key[Nspk-1] ||\nlms_signature  /* signature of message */",
      "raw": true
    },
    {
      "indent": 3,
      "text": "where, as defined in Section 3.3 of [HASHSIG], the signed_public_key structure contains the lms_signature over the public key, followed by the public key itself. Note that Nspk is the number of levels in the hierarchy of trees minus 1.",
      "ja": "ここで、[HASHSIG]のセクション3.3で定義されているように、signed_public_key構造には、公開キー上のlms_signatureが含まれ、その後に公開キー自体が続きます。 Nspkは、ツリーの階層のレベルから1を引いたものであることに注意してください。"
    },
    {
      "indent": 0,
      "text": "2.2. Leighton-Micali Signature (LMS)",
      "section_title": true,
      "ja": "2.2. レイトン・ミカリ署名（LMS）"
    },
    {
      "indent": 3,
      "text": "Each tree in the system specified in [HASHSIG] uses the Leighton-Micali Signature (LMS) system. LMS systems have two parameters. The first parameter is the height of the tree, h, which is the number of levels in the tree minus one. The [HASHSIG] specification supports five values for this parameter: h=5, h=10, h=15, h=20, and h=25. Note that there are 2^h leaves in the tree. The second parameter, m, is the number of bytes output by the hash function, and it is the amount of data associated with each node in the tree. The [HASHSIG] specification supports only the SHA-256 hash function [SHS], with m=32. As a result, the [HASHSIG] specification supports five tree sizes; they are identified as:",
      "ja": "[HASHSIG]で指定されたシステムの各ツリーは、Leighton-Micali Signature（LMS）システムを使用します。 LMSシステムには2つのパラメーターがあります。 最初のパラメーターは、ツリーの高さhです。これは、ツリー内のレベルの数から1を引いたものです。 [HASHSIG]仕様は、このパラメーターの5つの値をサポートしています：h = 5、h = 10、h = 15、h = 20、およびh = 25。 ツリーには2 ^ hの葉があることに注意してください。 2番目のパラメーターmは、ハッシュ関数によって出力されるバイト数であり、ツリー内の各ノードに関連付けられたデータの量です。 [HASHSIG]仕様は、m = 32のSHA-256ハッシュ関数[SHS]のみをサポートします。 その結果、[HASHSIG]仕様は5つのツリーサイズをサポートしています。 次のように識別されます。"
    },
    {
      "indent": 3,
      "text": "* LMS_SHA256_M32_H5",
      "ja": "* LMS_SHA256_M32_H5"
    },
    {
      "indent": 3,
      "text": "* LMS_SHA256_M32_H10",
      "ja": "* LMS_SHA256_M32_H10"
    },
    {
      "indent": 3,
      "text": "* LMS_SHA256_M32_H15",
      "ja": "* LMS_SHA256_M32_H15"
    },
    {
      "indent": 3,
      "text": "* LMS_SHA256_M32_H20",
      "ja": "* LMS_SHA256_M32_H20"
    },
    {
      "indent": 3,
      "text": "* LMS_SHA256_M32_H25",
      "ja": "* LMS_SHA256_M32_H25"
    },
    {
      "indent": 3,
      "text": "The [HASHSIG] specification establishes an IANA registry [IANA-LMS] to permit the registration of additional hash functions and additional tree sizes in the future.",
      "ja": "[HASHSIG]仕様は、IANAレジストリ[IANA-LMS]を確立して、将来的に追加のハッシュ関数と追加のツリーサイズの登録を許可します。"
    },
    {
      "indent": 3,
      "text": "As specified in [HASHSIG], the LMS public key consists of four elements: the lms_algorithm_type from the list above, the otstype to identify the Leighton-Micali One-Time Signature (LM-OTS) type as discussed in Section 2.3, the private key identifier (I) as described in Section 5.3 of [HASHSIG], and the m-byte string associated with the root node of the tree (T[1]).",
      "ja": "[HASHSIG]で指定されているように、LMS公開キーは4つの要素で構成されます。上のリストのlms_algorithm_type、セクション2.3で説明したLeighton-Micaliワンタイム署名（LM-OTS）タイプを識別するotstype、秘密キー [HASHSIG]のセクション5.3で説明されている識別子（I）、およびツリーのルートノードに関連付けられたmバイトの文字列（T [1]）。"
    },
    {
      "indent": 3,
      "text": "The LMS public key can be summarized as:",
      "ja": "LMS公開鍵は次のように要約できます。"
    },
    {
      "indent": 6,
      "text": "u32str(lms_algorithm_type) || u32str(otstype) || I || T[1]",
      "raw": true
    },
    {
      "indent": 3,
      "text": "As specified in [HASHSIG], an LMS signature consists of four elements: the number of the leaf (q) associated with the LM-OTS signature value, an LM-OTS signature value as described in Section 2.3, a typecode indicating the particular LMS algorithm, and an array of values that is associated with the path through the tree from the leaf associated with the LM-OTS signature value to the root. The array of values contains the siblings of the nodes on the path from the leaf to the root but does not contain the nodes on the path itself. The array for a tree with height h will have h values. The first value is the sibling of the leaf, the next value is the sibling of the parent of the leaf, and so on up the path to the root.",
      "ja": "[HASHSIG]で指定されているように、LMS署名は4つの要素で構成されます。LM-OTS署名値に関連付けられたリーフ（q）の数、セクション2.3で説明するLM-OTS署名値、特定のLMS アルゴリズム、およびLM-OTS署名値に関連付けられたリーフからルートへのツリーを通るパスに関連付けられた値の配列。 値の配列には、リーフからルートへのパス上のノードの兄弟が含まれますが、パス自体のノードは含まれません。 高さhのツリーの配列にはh値があります。 最初の値は葉の兄弟であり、次の値は葉の親の兄弟であり、同様にルートへのパスになります。"
    },
    {
      "indent": 3,
      "text": "The four elements of the LMS signature value can be summarized as:",
      "ja": "LMS署名値の4つの要素は、次のように要約できます。"
    },
    {
      "indent": 6,
      "text": "u32str(q) || ots_signature || u32str(type) || path[0] || path[1] || ... || path[h-1]",
      "ja": "u32str（q）|| ots_signature || u32str（type）|| パス[0] || パス[1] || ... || パス[h-1]"
    },
    {
      "indent": 0,
      "text": "2.3. Leighton-Micali One-Time Signature (LM-OTS) Algorithm",
      "section_title": true,
      "ja": "2.3. Leighton-Micaliワンタイム署名（LM-OTS）アルゴリズム"
    },
    {
      "indent": 3,
      "text": "Merkle Tree Signatures (MTS) depend on a one-time signature method, and [HASHSIG] specifies the use of the LM-OTS, which has five parameters:",
      "ja": "マークルツリー署名（MTS）は1回限りの署名方法に依存し、[HASHSIG]はLM-OTSの使用を指定します。LM-OTSには5つのパラメーターがあります。"
    },
    {
      "indent": 3,
      "text": "n: The length in bytes of the hash function output. [HASHSIG] supports only SHA-256 [SHS], with n=32.",
      "ja": "n：ハッシュ関数出力のバイト単位の長さ。 [HASHSIG]は、n = 32のSHA-256 [SHS]のみをサポートします。"
    },
    {
      "indent": 3,
      "text": "H: A preimage-resistant hash function that accepts byte strings of any length and returns an n-byte string.",
      "ja": "H：任意の長さのバイト文字列を受け入れ、nバイト文字列を返す、イメージ耐性のあるハッシュ関数。"
    },
    {
      "indent": 3,
      "text": "w: The width in bits of the Winternitz coefficients. [HASHSIG] supports four values for this parameter: w=1, w=2, w=4, and w=8.",
      "ja": "w：Winternitz係数のビット幅。 [HASHSIG]は、このパラメーターの4つの値をサポートしています：w = 1、w = 2、w = 4、およびw = 8。"
    },
    {
      "indent": 3,
      "text": "p: The number of n-byte string elements that make up the LM-OTS signature value.",
      "ja": "p：LM-OTS署名値を構成するnバイト文字列要素の数。"
    },
    {
      "indent": 3,
      "text": "ls: The number of bits that are left-shifted in the final step of the checksum function, which is defined in Section 4.4 of [HASHSIG].",
      "ja": "ls：チェックサム関数の最終ステップで左シフトされるビット数。これは[HASHSIG]のセクション4.4で定義されています。"
    },
    {
      "indent": 3,
      "text": "The values of p and ls are dependent on the choices of the parameters n and w, as described in Appendix B of [HASHSIG].",
      "ja": "[HASHSIG]の付録Bで説明されているように、pとlsの値は、パラメーターnとwの選択に依存します。"
    },
    {
      "indent": 3,
      "text": "The [HASHSIG] specification supports four LM-OTS variants:",
      "ja": "[HASHSIG]仕様は、4つのLM-OTSバリアントをサポートしています。"
    },
    {
      "indent": 3,
      "text": "* LMOTS_SHA256_N32_W1",
      "ja": "* LMOTS_SHA256_N32_W1"
    },
    {
      "indent": 3,
      "text": "* LMOTS_SHA256_N32_W2",
      "ja": "* LMOTS_SHA256_N32_W2"
    },
    {
      "indent": 3,
      "text": "* LMOTS_SHA256_N32_W4",
      "ja": "* LMOTS_SHA256_N32_W4"
    },
    {
      "indent": 3,
      "text": "* LMOTS_SHA256_N32_W8",
      "ja": "* LMOTS_SHA256_N32_W8"
    },
    {
      "indent": 3,
      "text": "The [HASHSIG] specification establishes an IANA registry [IANA-LMS] to permit the registration of additional variants in the future.",
      "ja": "[HASHSIG]仕様は、IANAレジストリ[IANA-LMS]を確立して、将来的に追加のバリアントの登録を許可します。"
    },
    {
      "indent": 3,
      "text": "Signing involves the generation of C, an n-byte random value.",
      "ja": "署名には、nバイトのランダム値であるCの生成が含まれます。"
    },
    {
      "indent": 3,
      "text": "The LM-OTS signature value can be summarized as the identifier of the LM-OTS variant, the random value, and a sequence of hash values (y[0] through y[p-1]) that correspond to the elements of the public key, as described in Section 4.5 of [HASHSIG]:",
      "ja": "LM-OTSシグネチャ値は、パブリックの要素に対応するLM-OTSバリアントの識別子、ランダム値、およびハッシュ値のシーケンス（y [0]〜y [p-1]）として要約できます。 [HASHSIG]のセクション4.5で説明されているキー："
    },
    {
      "indent": 6,
      "text": "u32str(otstype) || C || y[0] || ... || y[p-1]",
      "ja": "u32str（otstype）|| C || y [0] || ... || y [p-1]"
    },
    {
      "indent": 0,
      "text": "3. Algorithm Identifiers and Parameters",
      "section_title": true,
      "ja": "3. アルゴリズム識別子とパラメーター"
    },
    {
      "indent": 3,
      "text": "The algorithm identifier for an HSS/LMS hash-based signature is:",
      "ja": "HSS / LMSハッシュベースの署名のアルゴリズム識別子は次のとおりです。"
    },
    {
      "indent": 6,
      "text": "id-alg-hss-lms-hashsig OBJECT IDENTIFIER ::= { iso(1)\n    member-body(2) us(840) rsadsi(113549) pkcs(1) pkcs9(9)\n    smime(16) alg(3) 17 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "When this object identifier is used for an HSS/LMS signature, the AlgorithmIdentifier parameters field MUST be absent (that is, the parameters are not present, and the parameters are not set to NULL).",
      "ja": "このオブジェクト識別子がHSS / LMS署名に使用される場合、AlgorithmIdentifierパラメータフィールドは存在しない必要があります（つまり、パラメータは存在せず、パラメータはNULLに設定されません）。"
    },
    {
      "indent": 3,
      "text": "The signature value is a large OCTET STRING, as described in Section 2 of this document. The signature format is designed for easy parsing. The HSS, LMS, and LM-OTS components of the signature value each include a counter and a typecode that indirectly provide all of the information that is needed to parse the value during signature validation.",
      "ja": "このドキュメントのセクション2で説明されているように、署名値は大きなOCTET STRINGです。 署名形式は、簡単に解析できるように設計されています。 署名値のHSS、LMS、およびLM-OTSコンポーネントにはそれぞれ、署名の検証中に値を解析するために必要なすべての情報を間接的に提供するカウンターとタイプコードが含まれています。"
    },
    {
      "indent": 3,
      "text": "The signature value identifies the hash function used in the HSS/LMS tree. [HASHSIG] uses only the SHA-256 hash function [SHS], but it establishes an IANA registry [IANA-LMS] to permit the registration of additional hash functions in the future.",
      "ja": "署名値は、HSS / LMSツリーで使用されるハッシュ関数を識別します。 [HASHSIG]はSHA-256ハッシュ関数[SHS]のみを使用しますが、将来追加のハッシュ関数の登録を許可するためにIANAレジストリ[IANA-LMS]を確立します。"
    },
    {
      "indent": 0,
      "text": "4. HSS/LMS Public Key Identifier",
      "section_title": true,
      "ja": "4. HSS / LMS公開キー識別子"
    },
    {
      "indent": 3,
      "text": "The AlgorithmIdentifier for an HSS/LMS public key uses the id-alg-hss-lms-hashsig object identifier, and the parameters field MUST be absent.",
      "ja": "HSS / LMS公開キーのAlgorithmIdentifierは、id-alg-hss-lms-hashsigオブジェクト識別子を使用し、パラメータフィールドは存在しない必要があります。"
    },
    {
      "indent": 3,
      "text": "When this AlgorithmIdentifier appears in the SubjectPublicKeyInfo field of an X.509 certificate [RFC5280], the certificate key usage extension MAY contain digitalSignature, nonRepudiation, keyCertSign, and cRLSign; however, it MUST NOT contain other values.",
      "ja": "このAlgorithmIdentifierがX.509証明書[RFC5280]のSubjectPublicKeyInfoフィールドに表示される場合、証明書のキー使用法の拡張にはdigitalSignature、nonRepudiation、keyCertSign、およびcRLSignが含まれる場合があります。 ただし、他の値を含めることはできません。"
    },
    {
      "indent": 6,
      "text": "pk-HSS-LMS-HashSig PUBLIC-KEY ::= {\n    IDENTIFIER id-alg-hss-lms-hashsig\n    KEY HSS-LMS-HashSig-PublicKey\n    PARAMS ARE absent\n    CERT-KEY-USAGE\n      { digitalSignature, nonRepudiation, keyCertSign, cRLSign } }",
      "raw": true
    },
    {
      "indent": 6,
      "text": "HSS-LMS-HashSig-PublicKey ::= OCTET STRING",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note that the id-alg-hss-lms-hashsig algorithm identifier is also referred to as id-alg-mts-hashsig. This synonym is based on the terminology used in an early draft version of the document that became [HASHSIG].",
      "ja": "id-alg-hss-lms-hashsigアルゴリズム識別子は、id-alg-mts-hashsigとも呼ばれることに注意してください。 この同義語は、[HASHSIG]になったドキュメントの初期ドラフトバージョンで使用されている用語に基づいています。"
    },
    {
      "indent": 3,
      "text": "The public key value is an OCTET STRING. Like the signature format, it is designed for easy parsing. The value is the number of levels in the public key, L, followed by the LMS public key.",
      "ja": "公開鍵の値はOCTET STRINGです。 署名形式と同様に、簡単に解析できるように設計されています。 値は、LMS公開キーが後に続く公開キーLのレベル数です。"
    },
    {
      "indent": 3,
      "text": "The HSS/LMS public key value can be described as:",
      "ja": "HSS / LMS公開キーの値は次のように説明できます。"
    },
    {
      "indent": 9,
      "text": "u32str(L) || lms_public_key",
      "ja": "u32str（L）|| lms_public_key"
    },
    {
      "indent": 3,
      "text": "Note that the public key for the topmost LMS tree is the public key of the HSS system. When L=1, the HSS system is a single tree.",
      "ja": "最上位のLMSツリーの公開キーは、HSSシステムの公開キーであることに注意してください。 L = 1の場合、HSSシステムは単一ツリーです。"
    },
    {
      "indent": 0,
      "text": "5. Signed-Data Conventions",
      "section_title": true,
      "ja": "5. 署名付きデータの規則"
    },
    {
      "indent": 3,
      "text": "As specified in [CMS], the digital signature is produced from the message digest and the signer's private key. The signature is computed over different values depending on whether signed attributes are absent or present.",
      "ja": "[CMS]で指定されているように、デジタル署名はメッセージダイジェストと署名者の秘密鍵から生成されます。 署名は、署名された属性が存在するかどうかに応じて異なる値で計算されます。"
    },
    {
      "indent": 3,
      "text": "When signed attributes are absent, the HSS/LMS signature is computed over the content. When signed attributes are present, a hash is computed over the content using the same hash function that is used in the HSS/LMS tree, then a message-digest attribute is constructed with the hash of the content, and then the HSS/LMS signature is computed over the DER-encoded set of signed attributes (which MUST include a content-type attribute and a message-digest attribute). In summary:",
      "ja": "署名された属性が存在しない場合、HSS / LMS署名はコンテンツに対して計算されます。 署名された属性が存在する場合、HSS / LMSツリーで使用されているのと同じハッシュ関数を使用してコンテンツに対してハッシュが計算され、コンテンツのハッシュとHSS / LMS署名でメッセージダイジェスト属性が構築されます DERエンコードされた署名済み属性のセット（コンテンツタイプ属性とメッセージダイジェスト属性を含める必要があります）で計算されます。 要約すれば："
    },
    {
      "indent": 6,
      "text": "IF (signed attributes are absent)\nTHEN HSS_LMS_Sign(content)\nELSE message-digest attribute = Hash(content);\n     HSS_LMS_Sign(DER(SignedAttributes))",
      "raw": true
    },
    {
      "indent": 3,
      "text": "When using [HASHSIG], the fields in the SignerInfo are used as follows:",
      "ja": "[HASHSIG]を使用する場合、SignerInfoのフィールドは次のように使用されます。"
    },
    {
      "indent": 3,
      "text": "* digestAlgorithm MUST contain the one-way hash function used in the HSS/LMS tree. In [HASHSIG], SHA-256 is the only supported hash function, but other hash functions might be registered in the future. For convenience, the AlgorithmIdentifier for SHA-256 from [PKIXASN1] is repeated here:",
      "ja": "* digestAlgorithmには、HSS / LMSツリーで使用される一方向ハッシュ関数を含める必要があります。 [HASHSIG]では、SHA-256がサポートされている唯一のハッシュ関数ですが、将来他のハッシュ関数が登録される可能性があります。 便宜上、[PKIXASN1]のSHA-256のAlgorithmIdentifierはここで繰り返されます。"
    },
    {
      "indent": 12,
      "text": "mda-sha256 DIGEST-ALGORITHM ::= {\n    IDENTIFIER id-sha256\n    PARAMS TYPE NULL ARE preferredAbsent }",
      "raw": true
    },
    {
      "indent": 12,
      "text": "id-sha256 OBJECT IDENTIFIER ::= { joint-iso-itu-t(2)\n    country(16) us(840) organization(1) gov(101) csor(3)\n    nistAlgorithms(4) hashalgs(2) 1 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "* signatureAlgorithm MUST contain id-alg-hss-lms-hashsig, and the algorithm parameters field MUST be absent.",
      "ja": "* signatureAlgorithmにはid-alg-hss-lms-hashsigを含める必要があり、アルゴリズムパラメータフィールドは存在しない必要があります。"
    },
    {
      "indent": 3,
      "text": "* signature contains the single HSS signature value resulting from the signing operation as specified in [HASHSIG].",
      "ja": "* signatureには、[HASHSIG]で指定された署名操作から生じる単一のHSS署名値が含まれます。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Implementations MUST protect the private keys. Compromise of the private keys may result in the ability to forge signatures. Along with the private key, the implementation MUST keep track of which leaf nodes in the tree have been used. Loss of integrity of this tracking data can cause a one-time key to be used more than once. As a result, when a private key and the tracking data are stored on non-volatile media or in a virtual machine environment, failed writes, virtual machine snapshotting or cloning, and other operational concerns must be considered to ensure confidentiality and integrity.",
      "ja": "実装は秘密鍵を保護しなければなりません。 秘密鍵の侵害により、署名を偽造する可能性があります。 秘密鍵とともに、実装はツリー内のどのリーフノードが使用されたかを追跡しなければなりません。 この追跡データの整合性が失われると、ワンタイムキーが複数回使用される可能性があります。 その結果、秘密キーと追跡データが不揮発性メディアまたは仮想マシン環境に保存されている場合、書き込みの失敗、仮想マシンのスナップショットまたはクローン作成、およびその他の運用上の懸念を考慮して、機密性と整合性を確保する必要があります。"
    },
    {
      "indent": 3,
      "text": "When generating an LMS key pair, an implementation MUST generate each key pair independently of all other key pairs in the HSS tree.",
      "ja": "LMSキーペアを生成するとき、実装は、HSSツリー内の他のすべてのキーペアとは無関係に各キーペアを生成する必要があります。"
    },
    {
      "indent": 3,
      "text": "An implementation MUST ensure that an LM-OTS private key is used to generate a signature only one time and ensure that it cannot be used for any other purpose.",
      "ja": "実装では、LM-OTS秘密鍵を使用して署名を1回だけ生成し、他の目的に使用できないようにする必要があります。"
    },
    {
      "indent": 3,
      "text": "The generation of private keys relies on random numbers. The use of inadequate pseudorandom number generators (PRNGs) to generate these values can result in little or no security. An attacker may find it much easier to reproduce the PRNG environment that produced the keys, searching the resulting small set of possibilities, rather than brute-force searching the whole key space. The generation of quality random numbers is difficult, and [RFC4086] offers important guidance in this area.",
      "ja": "秘密鍵の生成は、乱数に依存しています。 これらの値を生成するために不適切な疑似乱数ジェネレーター（PRNG）を使用すると、セキュリティがほとんどまたはまったくなくなる可能性があります。 攻撃者は、キースペース全体をブルートフォース検索するよりも、キーを生成したPRNG環境を再現する方がはるかに簡単で、結果として生じる可能性のある小さなセットを検索する可能性があります。 高品質の乱数の生成は困難であり、[RFC4086]はこの分野で重要なガイダンスを提供します。"
    },
    {
      "indent": 3,
      "text": "The generation of hash-based signatures also depends on random numbers. While the consequences of an inadequate pseudorandom number generator (PRNG) to generate these values is much less severe than in the generation of private keys, the guidance in [RFC4086] remains important.",
      "ja": "ハッシュベースの署名の生成も乱数に依存します。 これらの値を生成するための不適切な擬似乱数生成器（PRNG）の結果は、秘密鍵の生成よりもそれほど深刻ではありませんが、[RFC4086]のガイダンスは重要なままです。"
    },
    {
      "indent": 3,
      "text": "When computing signatures, the same hash function SHOULD be used to compute the message digest of the content and the signed attributes, if they are present.",
      "ja": "署名を計算するとき、コンテンツと署名された属性が存在する場合、それらのメッセージダイジェストを計算するために同じハッシュ関数を使用する必要があります。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "In the \"SMI Security for S/MIME Module Identifier (1.2.840.113549.1.9.16.0)\" registry, IANA has updated the reference for value 64 to point to this document.",
      "ja": "「S / MIMEモジュール識別子のSMIセキュリティ（1.2.840.113549.1.9.16.0）」レジストリで、IANAはこのドキュメントを指すように値64の参照を更新しました。"
    },
    {
      "indent": 3,
      "text": "In the \"SMI Security for S/MIME Algorithms (1.2.840.113549.1.9.16.3)\" registry, IANA has updated the description for value 17 to \"id-alg-hss-lms-hashsig\" and updated the reference to point to this document.",
      "ja": "「S / MIMEアルゴリズムのSMIセキュリティ（1.2.840.113549.1.9.16.3）」レジストリで、IANAは値17の説明を「id-alg-hss-lms-hashsig」に更新し、これを指すように参照を更新しました 資料。"
    },
    {
      "indent": 3,
      "text": "IANA has also added the following note to the \"SMI Security for S/MIME Algorithms (1.2.840.113549.1.9.16.3)\" registry:",
      "ja": "IANAは、「S / MIMEアルゴリズムのSMIセキュリティ（1.2.840.113549.1.9.16.3）」レジストリに次のメモも追加しました。"
    },
    {
      "indent": 6,
      "text": "Value 17, \"id-alg-hss-lms-hashsig\", is also referred to as \"id-alg-mts-hashsig\".",
      "ja": "値17、「id-alg-hss-lms-hashsig」は、「id-alg-mts-hashsig」とも呼ばれます。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8. 参考文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[ASN1-B] ITU-T, \"Information technology -- Abstract Syntax Notation One (ASN.1): Specification of basic notation\", ITU-T Recommendation X.680, August 2015.",
      "ja": "[ASN1-B] ITU-T、「情報技術-抽象構文表記法1（ASN.1）：基本表記法の仕様」、ITU-T勧告X.680、2015年8月。"
    },
    {
      "indent": 3,
      "text": "[ASN1-E] ITU-T, \"Information technology -- ASN.1 encoding rules: Specification of Basic Encoding Rules (BER), Canonical Encoding Rules (CER) and Distinguished Encoding Rules (DER)\", ITU-T Recommendation X.690, August 2015.",
      "ja": "[ASN1-E] ITU-T、「情報技術-ASN.1エンコードルール：基本エンコードルール（BER）、標準エンコードルール（CER）および識別エンコードルール（DER）の仕様」、ITU-T勧告X。 690、2015年8月。"
    },
    {
      "indent": 3,
      "text": "[CMS] Housley, R., \"Cryptographic Message Syntax (CMS)\", STD 70, RFC 5652, DOI 10.17487/RFC5652, September 2009, <https://www.rfc-editor.org/info/rfc5652>.",
      "ja": "[CMS] Housley、R。、「Cryptographic Message Syntax（CMS）」、STD 70、RFC 5652、DOI 10.17487 / RFC5652、2009年9月、<https://www.rfc-editor.org/info/rfc5652>。"
    },
    {
      "indent": 3,
      "text": "[HASHSIG] McGrew, D., Curcio, M., and S. Fluhrer, \"Leighton-Micali Hash-Based Signatures\", RFC 8554, DOI 10.17487/RFC8554, April 2019, <https://www.rfc-editor.org/info/rfc8554>.",
      "ja": "[HASHSIG] McGrew、D.、Curcio、M。、およびS. Fluhrer、「Leighton-Micali Hash-Based Signatures」、RFC 8554、DOI 10.17487 / RFC8554、2019年4月、<https：//www.rfc-editor。 org / info / rfc8554>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S.、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC5280] Cooper, D., Santesson, S., Farrell, S., Boeyen, S., Housley, R., and W. Polk, \"Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile\", RFC 5280, DOI 10.17487/RFC5280, May 2008, <https://www.rfc-editor.org/info/rfc5280>.",
      "ja": "[RFC5280] Cooper、D.、Santesson、S.、Farrell、S.、Boeyen、S.、Housley、R.、W. Polk、 \"インターネットX.509公開鍵インフラストラクチャ証明書および証明書失効リスト（CRL）プロファイル \"、RFC 5280、DOI 10.17487 / RFC5280、2008年5月、<https://www.rfc-editor.org/info/rfc5280>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 3,
      "text": "[SHS] National Institute of Standards and Technology (NIST), \"Secure Hash Standard (SHS)\", FIPS PUB 180-4, DOI 10.6028/NIST.FIPS.180-4, August 2015, <https://doi.org/10.6028/NIST.FIPS.180-4>.",
      "ja": "[SHS]米国国立標準技術研究所（NIST）、「Secure Hash Standard（SHS）」、FIPS PUB 180-4、DOI 10.6028 / NIST.FIPS.180-4、2015年8月、<https://doi.org /10.6028/NIST.FIPS.180-4>。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[BH2013] Ptacek, T., Ritter, T., Samuel, J., and A. Stamos, \"The Factoring Dead: Preparing for the Cryptopocalypse\", August 2013, <https://media.blackhat.com/us-13/us-13-Stamos-The-Factoring-Dead.pdf>.",
      "ja": "[BH2013] Ptacek、T.、Ritter、T.、Samuel、J。、およびA. Stamos、「The Factoring Dead：Cryptopocalypseの準備」、2013年8月、<https://media.blackhat.com/us- 13 / us-13-Stamos-The-Factoring-Dead.pdf>。"
    },
    {
      "indent": 3,
      "text": "[CMSASN1] Hoffman, P. and J. Schaad, \"New ASN.1 Modules for Cryptographic Message Syntax (CMS) and S/MIME\", RFC 5911, DOI 10.17487/RFC5911, June 2010, <https://www.rfc-editor.org/info/rfc5911>.",
      "ja": "[CMSASN1] Hoffman、P。、およびJ. Schaad、「暗号メッセージ構文（CMS）およびS / MIME用の新しいASN.1モジュール」、RFC 5911、DOI 10.17487 / RFC5911、2010年6月、<https：//www.rfc -editor.org/info/rfc5911>。"
    },
    {
      "indent": 3,
      "text": "[CMSASN1U] Schaad, J. and S. Turner, \"Additional New ASN.1 Modules for the Cryptographic Message Syntax (CMS) and the Public Key Infrastructure Using X.509 (PKIX)\", RFC 6268, DOI 10.17487/RFC6268, July 2011, <https://www.rfc-editor.org/info/rfc6268>.",
      "ja": "[CMSASN1U] Schaad、J。およびS. Turner、「X.509（PKIX）を使用した暗号メッセージ構文（CMS）および公開鍵インフラストラクチャ用の追加の新しいASN.1モジュール」、RFC 6268、DOI 10.17487 / RFC6268、7月 2011、<https://www.rfc-editor.org/info/rfc6268>。"
    },
    {
      "indent": 3,
      "text": "[FWPROT] Housley, R., \"Using Cryptographic Message Syntax (CMS) to Protect Firmware Packages\", RFC 4108, DOI 10.17487/RFC4108, August 2005, <https://www.rfc-editor.org/info/rfc4108>.",
      "ja": "[FWPROT] Housley、R.、「暗号化メッセージ構文（CMS）を使用したファームウェアパッケージの保護」、RFC 4108、DOI 10.17487 / RFC4108、2005年8月、<https://www.rfc-editor.org/info/rfc4108> 。"
    },
    {
      "indent": 3,
      "text": "[IANA-LMS] IANA, \"Leighton-Micali Signatures (LMS)\", <https://www.iana.org/assignments/leighton-micali-signatures/>.",
      "ja": "[IANA-LMS] IANA、「Leighton-Micali Signatures（LMS）」、<https://www.iana.org/assignments/leighton-micali-signatures/>。"
    },
    {
      "indent": 3,
      "text": "[LM] Leighton, T. and S. Micali, \"Large provably fast and secure digital signature schemes based on secure hash functions\", U.S. Patent 5,432,852, July 1995.",
      "ja": "[LM] Leighton、T.、S。Micali、「安全なハッシュ関数に基づく、証明可能で高速で安全な大規模なデジタル署名スキーム」、米国特許5,432,852、1995年7月。"
    },
    {
      "indent": 3,
      "text": "[M1979] Merkle, R., \"Secrecy, Authentication, and Public Key Systems\", Technical Report No. 1979-1, Information Systems Laboratory, Stanford University, 1979.",
      "ja": "[M1979]マークル、R。、「秘密、認証、および公開鍵システム」、技術報告書1979-1、スタンフォード大学、1979年、情報システム研究所。"
    },
    {
      "indent": 3,
      "text": "[M1987] Merkle, R., \"A Digital Signature Based on a Conventional Encryption Function\", Advances in Cryptology -- CRYPTO '87 Proceedings, Lecture Notes in Computer Science Vol. 293, DOI 10.1007/3-540-48184-2_32, 1988, <https://doi.org/10.1007/3-540-48184-2_32>.",
      "ja": "[M1987] Merkle、R.、「従来の暗号化機能に基づいたデジタル署名」、暗号学の進歩-CRYPTO '87 Proceedings、講演ノートin Computer Science Vol。 293、DOI 10.1007 / 3-540-48184-2_32、1988、<https://doi.org/10.1007/3-540-48184-2_32>。"
    },
    {
      "indent": 3,
      "text": "[M1989a] Merkle, R., \"A Certified Digital Signature\", Advances in Cryptology -- CRYPTO '89 Proceedings, Lecture Notes in Computer Science Vol. 435, DOI 10.1007/0-387-34805-0_21, 1990, <https://doi.org/10.1007/0-387-34805-0_21>.",
      "ja": "[M1989a] Merkle、R.、 \"A Certified Digital Signature\"、Advances in Cryptology-CRYPTO '89 Proceedings、Lecture Notes in Computer Science Vol。 435、DOI 10.1007 / 0-387-34805-0_21、1990、<https://doi.org/10.1007/0-387-34805-0_21>。"
    },
    {
      "indent": 3,
      "text": "[M1989b] Merkle, R., \"One Way Hash Functions and DES\", Advances in Cryptology -- CRYPTO '89 Proceedings, Lecture Notes in Computer Science Vol. 435, DOI 10.1007/0-387-34805-0_40, 1990, <https://doi.org/10.1007/0-387-34805-0_40>.",
      "ja": "[M1989b] Merkle、R.、 \"One Way Hash Functions and DES\"、Advances in Cryptology-CRYPTO '89 Proceedings、Lecture Notes in Computer Science Vol。 435、DOI 10.1007 / 0-387-34805-0_40、1990、<https://doi.org/10.1007/0-387-34805-0_40>。"
    },
    {
      "indent": 3,
      "text": "[NAS2019] National Academies of Sciences, Engineering, and Medicine, \"Quantum Computing: Progress and Prospects\", The National Academies Press, DOI 10.17226/25196, 2019, <https://doi.org/10.17226/25196>.",
      "ja": "[NAS2019] National Academy of Sciences、Engineering、and Medicine、 \"Quantum Computing：Progress and Prospects\"、The National Academies Press、DOI 10.17226 / 25196、2019、<https://doi.org/10.17226/25196>。"
    },
    {
      "indent": 3,
      "text": "[PKIXASN1] Hoffman, P. and J. Schaad, \"New ASN.1 Modules for the Public Key Infrastructure Using X.509 (PKIX)\", RFC 5912, DOI 10.17487/RFC5912, June 2010, <https://www.rfc-editor.org/info/rfc5912>.",
      "ja": "[PKIXASN1] Hoffman、P。、およびJ. Schaad、「X.509（PKIX）を使用した公開鍵インフラストラクチャ用の新しいASN.1モジュール」、RFC 5912、DOI 10.17487 / RFC5912、2010年6月、<https：// www。 rfc-editor.org/info/rfc5912>。"
    },
    {
      "indent": 3,
      "text": "[PQC] Bernstein, D., \"Introduction to post-quantum cryptography\", DOI 10.1007/978-3-540-88702-7_1, 2009, <http://www.springer.com/cda/content/document/ cda_downloaddocument/9783540887010-c1.pdf>.",
      "ja": "[PQC] Bernstein、D.、 \"Introduction to post-quantum cryptography\"、DOI 10.1007 / 978-3-540-88702-7_1、2009、<http://www.springer.com/cda/content/document/ cda_downloaddocument /9783540887010-c1.pdf>。"
    },
    {
      "indent": 3,
      "text": "[RFC4086] Eastlake 3rd, D., Schiller, J., and S. Crocker, \"Randomness Requirements for Security\", BCP 106, RFC 4086, DOI 10.17487/RFC4086, June 2005, <https://www.rfc-editor.org/info/rfc4086>.",
      "ja": "[RFC4086] Eastlake 3rd、D.、Schiller、J。、およびS. Crocker、「Randomness Requirements for Security」、BCP 106、RFC 4086、DOI 10.17487 / RFC4086、2005年6月、<https：//www.rfc-editor .org / info / rfc4086>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. ASN.1 Module",
      "section_title": true,
      "ja": "付録A.ASN.1モジュール"
    },
    {
      "indent": 3,
      "text": "<CODE STARTS>",
      "ja": "<コードの開始>"
    },
    {
      "indent": 3,
      "text": "MTS-HashSig-2013\n  { iso(1) member-body(2) us(840) rsadsi(113549) pkcs(1) pkcs9(9)\n    id-smime(16) id-mod(0) id-mod-mts-hashsig-2013(64) }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "DEFINITIONS IMPLICIT TAGS ::= BEGIN",
      "raw": true
    },
    {
      "indent": 3,
      "text": "EXPORTS ALL;",
      "ja": "すべてをエクスポートします。"
    },
    {
      "indent": 3,
      "text": "IMPORTS\n  PUBLIC-KEY, SIGNATURE-ALGORITHM, SMIME-CAPS\n    FROM AlgorithmInformation-2009  -- RFC 5911 [CMSASN1]\n      { iso(1) identified-organization(3) dod(6) internet(1)\n        security(5) mechanisms(5) pkix(7) id-mod(0)\n        id-mod-algorithmInformation-02(58) } ;",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- -- Object Identifiers --",
      "ja": "--オブジェクト識別子-"
    },
    {
      "indent": 3,
      "text": "id-alg-hss-lms-hashsig OBJECT IDENTIFIER ::= { iso(1)\n    member-body(2) us(840) rsadsi(113549) pkcs(1) pkcs9(9)\n    smime(16) alg(3) 17 }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "id-alg-mts-hashsig OBJECT IDENTIFIER ::= id-alg-hss-lms-hashsig",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- -- Signature Algorithm and Public Key --",
      "ja": "--署名アルゴリズムと公開鍵-"
    },
    {
      "indent": 3,
      "text": "sa-HSS-LMS-HashSig SIGNATURE-ALGORITHM ::= {\n    IDENTIFIER id-alg-hss-lms-hashsig\n    PARAMS ARE absent\n    PUBLIC-KEYS { pk-HSS-LMS-HashSig }\n    SMIME-CAPS { IDENTIFIED BY id-alg-hss-lms-hashsig } }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "pk-HSS-LMS-HashSig PUBLIC-KEY ::= {\n    IDENTIFIER id-alg-hss-lms-hashsig\n    KEY HSS-LMS-HashSig-PublicKey\n    PARAMS ARE absent\n    CERT-KEY-USAGE\n        { digitalSignature, nonRepudiation, keyCertSign, cRLSign } }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "HSS-LMS-HashSig-PublicKey ::= OCTET STRING",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- -- Expand the signature algorithm set used by CMS [CMSASN1U] --",
      "ja": "--CMS [CMSASN1U]で使用される署名アルゴリズムセットを展開します-"
    },
    {
      "indent": 3,
      "text": "SignatureAlgorithmSet SIGNATURE-ALGORITHM ::=\n    { sa-HSS-LMS-HashSig, ... }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "-- -- Expand the S/MIME capabilities set used by CMS [CMSASN1] --",
      "ja": "--CMS [CMSASN1]で使用されるS / MIME機能セットを拡張します-"
    },
    {
      "indent": 3,
      "text": "SMimeCaps SMIME-CAPS ::=\n    { sa-HSS-LMS-HashSig.&smimeCaps, ... }",
      "raw": true
    },
    {
      "indent": 3,
      "text": "END",
      "ja": "終わり"
    },
    {
      "indent": 3,
      "text": "<CODE ENDS>",
      "ja": "<コード終了>"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks to Joe Clarke, Roman Danyliw, Scott Fluhrer, Jonathan Hammell, Ben Kaduk, Panos Kampanakis, Barry Leiba, John Mattsson, Jim Schaad, Sean Turner, Daniel Van Geest, and Dale Worley for their careful review and comments.",
      "ja": "ジョー・クラーク、ローマン・ダニリウ、スコット・フルーラー、ジョナサン・ハンメル、ベン・カドゥク、パノス・カンパナキス、バリー・レイバ、ジョン・マットソン、ジム・シャード、ショーン・ターナー、ダニエル・ヴァン・ジースト、デール・ウォーリーに感謝します。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者の住所"
    },
    {
      "indent": 3,
      "text": "Russ Housley Vigil Security, LLC 516 Dranesville Road Herndon, VA 20170 United States of America",
      "ja": "Russ Housley Vigil Security、LLC 516 Dranesville Road Herndon、VA 20170アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: housley@vigilsec.com",
      "raw": true
    }
  ]
}