{
  "title": {
    "text": "RFC 8004 - Host Identity Protocol (HIP) Rendezvous Extension",
    "ja": "RFC 8004 - ホストアイデンティティプロトコル（HIP）ランデブー拡張"
  },
  "number": 8004,
  "created_at": "2019-10-19 13:34:50.557863+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       J. Laganier\nRequest for Comments: 8004                       Luminate Wireless, Inc.\nObsoletes: 5204                                                L. Eggert\nCategory: Standards Track                                         NetApp\nISSN: 2070-1721                                             October 2016",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Host Identity Protocol (HIP) Rendezvous Extension",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines a rendezvous extension for the Host Identity Protocol (HIP). The rendezvous extension extends HIP and the HIP Registration Extension for initiating communication between HIP nodes via HIP rendezvous servers. Rendezvous servers improve reachability and operation when HIP nodes are multihomed or mobile. This document obsoletes RFC 5204.",
      "ja": "このドキュメントでは、Host Identity Protocol（HIP）のランデブー拡張を定義しています。 ランデブー拡張機能は、HIPとHIP登録拡張機能を拡張して、HIPランデブーサーバーを介してHIPノード間の通信を開始します。 ランデブーサーバーは、HIPノードがマルチホームまたはモバイルの場合、到達可能性と操作を改善します。 このドキュメントはRFC 5204を廃止します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット標準化過程の文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、Internet Engineering Task Force（IETF）の製品です。 IETFコミュニティのコンセンサスを表しています。 これは公開レビューを受けており、Internet Engineering Steering Group（IESG）による公開が承認されています。 インターネット標準の詳細については、RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc8004.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックに関する情報は、http：//www.rfc-editor.org/info/rfc8004で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2016 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2016 IETF Trustおよび文書の著者として特定された人物。 全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、この文書の発行日に有効なBCP 78およびIETFトラストのIETF文書に関する法的条項（http://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているので、注意深く確認してください。 このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseテキストを含める必要があり、Simplified BSD Licenseに記載されている保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Overview of Rendezvous Server Operation . . . . . . . . . . .   3\n  3.1.  Diagram Notation  . . . . . . . . . . . . . . . . . . . .   5\n  3.2.  Rendezvous Client Registration  . . . . . . . . . . . . .   5\n  3.3.  Relaying the Base Exchange  . . . . . . . . . . . . . . .   6\n4.  Rendezvous Server Extensions  . . . . . . . . . . . . . . . .   7\n  4.1.  RENDEZVOUS Registration Type  . . . . . . . . . . . . . .   7\n  4.2.  Parameter Formats and Processing  . . . . . . . . . . . .   7\n    4.2.1.  RVS_HMAC Parameter  . . . . . . . . . . . . . . . . .   7\n    4.2.2.  FROM Parameter  . . . . . . . . . . . . . . . . . . .   8\n    4.2.3.  VIA_RVS Parameter . . . . . . . . . . . . . . . . . .   9\n  4.3.  Modified Packets Processing . . . . . . . . . . . . . . .   9\n    4.3.1.  Processing Outgoing I1 Packets  . . . . . . . . . . .   9\n    4.3.2.  Processing Incoming I1 Packets  . . . . . . . . . . .  10\n    4.3.3.  Processing Outgoing R1 Packets  . . . . . . . . . . .  10\n    4.3.4.  Processing Incoming R1 Packets  . . . . . . . . . . .  10\n5.  Security Considerations . . . . . . . . . . . . . . . . . . .  11\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  11\n7.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  12\n  7.1.  Normative References  . . . . . . . . . . . . . . . . . .  12\n  7.2.  Informative References  . . . . . . . . . . . . . . . . .  13\nAppendix A.  Changes from RFC 5204  . . . . . . . . . . . . . . .  14\nAcknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .  14\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  14",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "\"The Host Identity Protocol (HIP) Architecture\" [HIP-ARCH] introduces the rendezvous mechanism to help a HIP node to contact a frequently moving HIP node. The rendezvous mechanism involves a third party, the rendezvous server (RVS), which serves as an initial contact point (\"rendezvous point\") for its clients. The clients of an RVS are HIP nodes that use the HIP Registration Extension [RFC8003] to register their HIT->IP address mappings with the RVS. After this registration, other HIP nodes can initiate a base exchange using the IP address of the RVS instead of the current IP address of the node they attempt to contact. Essentially, the clients of an RVS become reachable at the RVS's IP address. Peers can initiate a HIP base exchange with the IP address of the RVS, which will relay this initial communication such that the base exchange may successfully complete.",
      "ja": "「ホストアイデンティティプロトコル（HIP）アーキテクチャ」[HIP-ARCH]では、HIPノードが頻繁に移動するHIPノードに接続できるようにするランデブーメカニズムが導入されています。 ランデブーメカニズムには、クライアントの初期コンタクトポイント（「ランデブーポイント」）として機能するランデブーサーバー（RVS）のサードパーティが関与します。 RVSのクライアントは、HIP Registration Extension [RFC8003]を使用して、HIT-> IPアドレスマッピングをRVSに登録するHIPノードです。 この登録後、他のHIPノードは、接続しようとするノードの現在のIPアドレスの代わりに、RVSのIPアドレスを使用してベース交換を開始できます。 基本的に、RVSのクライアントはRVSのIPアドレスで到達可能になります。 ピアは、RVSのIPアドレスを使用してHIPベース交換を開始できます。これにより、ベース交換が正常に完了するように、この初期通信が中継されます。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "This section defines terms used throughout the remainder of this specification.",
      "ja": "このセクションでは、この仕様の残りの部分で使用される用語を定義します。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in RFC 2119 [RFC2119].",
      "ja": "このドキュメントのキーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「MAY」、および「OPTIONAL」は RFC 2119 [RFC2119]で説明されているように解釈されます。"
    },
    {
      "indent": 3,
      "text": "In addition to the terminology defined in the HIP specification [RFC7401] and the HIP Registration Extension [RFC8003], this document defines and uses the following terms:",
      "ja": "HIP仕様[RFC7401]およびHIP Registration Extension [RFC8003]で定義されている用語に加えて、このドキュメントでは次の用語を定義および使用しています。"
    },
    {
      "indent": 3,
      "text": "Rendezvous Service A HIP service provided by an RVS to its rendezvous clients. The RVS offers to relay some of the arriving base exchange packets between the Initiator and Responder.",
      "ja": "ランデブーサービスRVSがランデブークライアントに提供するHIPサービス。 RVSは、イニシエーターとレスポンダー間で到着するベース交換パケットの一部を中継することを提案します。"
    },
    {
      "indent": 3,
      "text": "Rendezvous Server (RVS) A HIP registrar providing rendezvous service.",
      "ja": "ランデブーサーバー（RVS）ランデブーサービスを提供するHIPレジストラー。"
    },
    {
      "indent": 3,
      "text": "Rendezvous Client A HIP requester that has registered for rendezvous service at an RVS.",
      "ja": "ランデブークライアントRVSでランデブーサービスに登録したHIPリクエスター。"
    },
    {
      "indent": 3,
      "text": "Rendezvous Registration A HIP registration for rendezvous service, established between an RVS and a rendezvous client.",
      "ja": "ランデブー登録RVSとランデブークライアントの間に確立されたランデブーサービスのHIP登録。"
    },
    {
      "indent": 0,
      "text": "3. Overview of Rendezvous Server Operation",
      "section_title": true,
      "ja": "3. Rendezvousサーバーの動作の概要"
    },
    {
      "indent": 3,
      "text": "Figure 1 shows a simple HIP base exchange without an RVS, in which the Initiator initiates the exchange directly with the Responder by sending an I1 packet to the Responder's IP address, as per the HIP specification [RFC7401].",
      "ja": "図1は、RVSを使用しない単純なHIPベース交換を示しています。イニシエーターは、HIP仕様[RFC7401]に従って、I1パケットをレスポンダーのIPアドレスに送信することにより、レスポンダーと直接交換を開始します。"
    },
    {
      "indent": 22,
      "text": "+-----+                +-----+\n|     |-------I1------>|     |\n|  I  |<------R1-------|  R  |\n|     |-------I2------>|     |\n|     |<------R2-------|     |\n+-----+                +-----+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Figure 1: HIP Base Exchange without a Rendezvous Server",
      "ja": "図1：Rendezvousサーバーを使用しないHIP Base Exchange"
    },
    {
      "indent": 3,
      "text": "The End-Host Mobility and Multihoming with the HIP specification [HIP-HOST-MOB] allows a HIP node to notify its peers about changes in its set of IP addresses. This specification presumes initial reachability of the two nodes with respect to each other.",
      "ja": "HIP仕様[HIP-HOST-MOB]を使用したエンドホストモビリティとマルチホーミングにより、HIPノードはIPアドレスのセットの変更についてピアに通知できます。 この仕様では、2つのノードの相互の初期到達可能性を前提としています。"
    },
    {
      "indent": 3,
      "text": "However, such a HIP node MAY also want to be reachable to other future correspondent peers that are unaware of its location change. The HIP Architecture [HIP-ARCH] introduces RVSs with whom a HIP node MAY register its Host Identity Tags (HITs) and current IP addresses. An RVS relays HIP packets arriving for these HITs to the node's registered IP addresses. When a HIP node has registered with an RVS, it SHOULD record the IP address of its RVS in its DNS record, using the HIP DNS resource record type defined in the HIP DNS Extension [RFC8005].",
      "ja": "ただし、そのようなHIPノードは、その場所の変更を認識していない他の将来の通信相手ピアにも到達可能にしたい場合があります。 HIPアーキテクチャ[HIP-ARCH]は、HIPノードがホストIDタグ（HIT）と現在のIPアドレスを登録できるRVSを導入します。 RVSは、これらのHITに到着したHIPパケットをノードの登録済みIPアドレスに中継します。 HIPノードがRVSに登録されている場合、HIP DNS拡張[RFC8005]で定義されているHIP DNSリソースレコードタイプを使用して、DNSレコードにRVSのIPアドレスを記録する必要があります。"
    },
    {
      "indent": 22,
      "text": "            +-----+\n   +--I1--->| RVS |---I1--+\n   |        +-----+       |\n   |                      v\n+-----+                +-----+\n|     |<------R1-------|     |\n|  I  |-------I2------>|  R  |\n|     |<------R2-------|     |\n+-----+                +-----+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "Figure 2: HIP Base Exchange with a Rendezvous Server",
      "ja": "図2：ランデブーサーバーとのHIP Base Exchange"
    },
    {
      "indent": 3,
      "text": "Figure 2 shows a HIP base exchange involving an RVS. It is assumed that HIP node R previously registered its HITs and current IP addresses with the RVS, using the HIP Registration Extension [RFC8003]. When the Initiator I tries to establish contact with the Responder R, it must send the I1 of the base exchange either to one of R's IP addresses (if known via DNS or other means) or to one of R's RVSs. Here, I obtains the IP address of R's RVS from R's DNS record and then sends the I1 packet of the HIP base exchange to RVS. RVS, noticing that the HIT contained in the arriving I1 packet is not one of its own, MUST check its current registrations to determine if it needs to relay the packets. Here, it determines that the HIT belongs to R and then relays the I1 packet to the registered IP address. R then completes the base exchange without further assistance from RVS by sending an R1 directly to the I's IP address, as obtained from the I1 packet. In this specification, the client of the RVS is always the Responder. However, there might be reasons (such as NAT and firewall traversal) to allow a client to initiate a base exchange through its own RVS. This specification does not address such scenarios, which should be specified in other documents.",
      "ja": "図2は、RVSを含むHIPベース交換を示しています。 HIPノードRは、HIP登録拡張機能[RFC8003]を使用して、以前にそのHITと現在のIPアドレスをRVSに登録したと想定されます。イニシエーターIがレスポンダーRとの接続を確立しようとするとき、RのIPアドレス（DNSまたは他の手段で知られている場合）またはRのRVSのいずれかにベースエクスチェンジのI1を送信する必要があります。ここでは、RのDNSレコードからRのRVSのIPアドレスを取得し、HIPベース交換のI1パケットをRVSに送信します。 RVSは、到着するI1パケットに含まれるHITが独自のものではないことに気付いて、現在の登録を確認して、パケットを中継する必要があるかどうかを判断する必要があります。ここでは、HITがRに属していると判断し、登録されたIPアドレスにI1パケットを中継します。次に、Rは、R1をI1パケットから取得したとおりにIのIPアドレスに直接送信することにより、RVSからの支援なしで基本交換を完了します。この仕様では、RVSのクライアントは常にレスポンダーです。ただし、クライアントが独自のRVSを介してベース交換を開始できるようにする理由（NATやファイアウォールトラバーサルなど）がある場合があります。この仕様は、他のドキュメントで指定されるべきそのようなシナリオに対処しません。"
    },
    {
      "indent": 0,
      "text": "3.1. Diagram Notation",
      "section_title": true,
      "ja": "3.1。 ダイアグラム表記"
    },
    {
      "indent": 3,
      "text": "Notation       Significance\n--------       ------------",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "I, R I and R are the respective source and destination IP addresses in the IP header.",
      "ja": "I、R I、およびRは、IPヘッダー内のそれぞれの送信元および宛先IPアドレスです。"
    },
    {
      "indent": 3,
      "text": "HIT-I, HIT-R HIT-I and HIT-R are the Initiator's and the Responder's HITs in the packet, respectively.",
      "ja": "HIT-I、HIT-R HIT-I、およびHIT-Rは、それぞれパケット内のイニシエーターおよびレスポンダーのHITです。"
    },
    {
      "indent": 3,
      "text": "REG_REQ A REG_REQUEST parameter is present in the HIP header.",
      "ja": "REG_REQ REG_REQUESTパラメーターは、HIPヘッダーに存在します。"
    },
    {
      "indent": 3,
      "text": "REG_RES A REG_RESPONSE parameter is present in the HIP header.",
      "ja": "REG_RES REG_RESPONSEパラメーターは、HIPヘッダーに存在します。"
    },
    {
      "indent": 3,
      "text": "FROM:I A FROM parameter containing the IP address I is present in the HIP header.",
      "ja": "FROM：I IPアドレスIを含むFROMパラメーターは、HIPヘッダーに存在します。"
    },
    {
      "indent": 3,
      "text": "RVS_HMAC An RVS_HMAC parameter containing an Hashed Message Authentication Code (HMAC) keyed with the appropriate registration key is present in the HIP header.",
      "ja": "RVS_HMAC適切な登録キーでキー設定されたハッシュメッセージ認証コード（HMAC）を含むRVS_HMACパラメーターは、HIPヘッダーに存在します。"
    },
    {
      "indent": 3,
      "text": "VIA:RVS A VIA_RVS parameter containing the IP address RVS of a rendezvous server is present in the HIP header.",
      "ja": "VIA：RVSランデブーサーバーのIPアドレスRVSを含むVIA_RVSパラメーターがHIPヘッダーに存在します。"
    },
    {
      "indent": 0,
      "text": "3.2. Rendezvous Client Registration",
      "section_title": true,
      "ja": "3.2。 ランデブークライアントの登録"
    },
    {
      "indent": 3,
      "text": "Before an RVS starts to relay HIP packets to a rendezvous client, the rendezvous client needs to register with the RVS to receive rendezvous service by using the HIP Registration Extension [RFC8003] as illustrated in the following schema:",
      "ja": "RVSがランデブークライアントへのHIPパケットの中継を開始する前に、ランデブークライアントは、次のスキーマに示すように、HIP Registration Extension [RFC8003]を使用してランデブーサービスを受信するためにRVSに登録する必要があります。"
    },
    {
      "indent": 16,
      "text": "+-----+                            +-----+\n|     |            I1              |     |\n|     |--------------------------->|     |\n|     |<---------------------------|     |\n|  I  |         R1(REG_INFO)       | RVS |\n|     |         I2(REG_REQ)        |     |\n|     |--------------------------->|     |\n|     |<---------------------------|     |\n|     |         R2(REG_RES)        |     |\n+-----+                            +-----+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Rendezvous Client Registering with a Rendezvous Server",
      "ja": "Rendezvousサーバーに登録するRendezvousクライアント"
    },
    {
      "indent": 0,
      "text": "3.3. Relaying the Base Exchange",
      "section_title": true,
      "ja": "3.3。 Base Exchangeの中継"
    },
    {
      "indent": 3,
      "text": "If a HIP node and one of its RVSs have a rendezvous registration, the RVSs relay inbound I1 packets (that contain one of the client's HITs) by rewriting the IP header. They replace the destination IP address of the I1 packet with one of the IP addresses of the owner of the HIT, i.e., the rendezvous client. They MUST also recompute the IP checksum accordingly.",
      "ja": "HIPノードとそのRVSの1つにランデブー登録がある場合、RVSは、IPヘッダーを書き換えることにより、インバウンドI1パケット（クライアントのHITの1つを含む）を中継します。 I1パケットの宛先IPアドレスを、HITの所有者、つまりランデブークライアントのIPアドレスの1つに置き換えます。 また、IPチェックサムもそれに応じて再計算する必要があります。"
    },
    {
      "indent": 3,
      "text": "Because of ingress filtering on the path from the RVS to the client [RFC2827] [RFC3013], a HIP RVS SHOULD replace the source IP address, i.e., the IP address of I, with one of its own IP addresses. The replacement IP address SHOULD be chosen according to relevant IPv4 and IPv6 specifications [RFC1122] [RFC6724]. Because this replacement conceals the Initiator's IP address, the RVS MUST append a FROM parameter containing the original source IP address of the packet. This FROM parameter MUST be integrity protected by an RVS_HMAC keyed with the corresponding rendezvous registration integrity key [RFC8003].",
      "ja": "RVSからクライアント[RFC2827] [RFC3013]へのパスでのイングレスフィルタリングのため、HIP RVSはソースIPアドレス、つまりIのIPアドレスを独自のIPアドレスの1つで置き換える必要があります。 置換IPアドレスは、関連するIPv4およびIPv6仕様[RFC1122] [RFC6724]に従って選択する必要があります。 この置換はイニシエーターのIPアドレスを隠すため、RVSはパケットの元のソースIPアドレスを含むFROMパラメーターを追加する必要があります。 このFROMパラメータは、対応するランデブー登録整合性キー[RFC8003]でキー設定されたRVS_HMACによって整合性が保護されている必要があります。"
    },
    {
      "indent": 6,
      "text": "                                       I1(RVS, R, HIT-I, HIT-R\n I1(I, RVS, HIT-I, HIT-R) +---------+     FROM:I, RVS_HMAC)\n +----------------------->|         |--------------------+\n |                        |   RVS   |                    |\n |                        |         |                    |\n |                        +---------+                    |\n |                                                       V\n+-----+        R1(R, I, HIT-R, HIT-I, VIA:RVS)       +-----+\n|     |<---------------------------------------------|     |\n|     |                                              |     |\n|  I  |            I2(I, R, HIT-I, HIT-R)            |  R  |\n|     |--------------------------------------------->|     |\n|     |<---------------------------------------------|     |\n+-----+             R2(R, I, HIT-R, HIT-I)           +-----+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 17,
      "text": "Rendezvous Server Rewriting IP Addresses",
      "ja": "ランデブーサーバーのIPアドレスの書き換え"
    },
    {
      "indent": 3,
      "text": "This modification of HIP packets at an RVS can be problematic because HIP uses integrity checks. Because the I1 does not include HMAC or SIGNATURE parameters, these two end-to-end integrity checks are unaffected by the operation of RVSs.",
      "ja": "HIPは整合性チェックを使用するため、RVSでのこのHIPパケットの変更には問題があります。 I1にはHMACまたはSIGNATUREパラメーターが含まれていないため、これら2つのエンドツーエンドの整合性チェックは、RVSの操作による影響を受けません。"
    },
    {
      "indent": 3,
      "text": "The RVS SHOULD verify the checksum field of an I1 packet before doing any modifications. After modification, it MUST recompute the checksum field using the updated HIP header, which possibly included new FROM and RVS_HMAC parameters, and a pseudo-header containing the updated source and destination IP addresses. This enables the Responder to validate the checksum of the I1 packet \"as is\", without having to parse any FROM parameters.",
      "ja": "RVSは、変更を行う前にI1パケットのチェックサムフィールドを確認する必要があります。 変更後、新しいFROMおよびRVS_HMACパラメーターを含む可能性のある更新されたHIPヘッダーと、更新されたソースおよび宛先IPアドレスを含む擬似ヘッダーを使用して、チェックサムフィールドを再計算する必要があります。 これにより、レスポンダーは、FROMパラメーターを解析することなく、I1パケットのチェックサムを「そのまま」検証できます。"
    },
    {
      "indent": 0,
      "text": "4. Rendezvous Server Extensions",
      "section_title": true,
      "ja": "4. Rendezvous Server Extensions"
    },
    {
      "indent": 3,
      "text": "This section describes extensions to the HIP Registration Extension [RFC8003], allowing a HIP node to register with an RVS for rendezvous service and to notify the RVS aware of changes to its current location. It also describes an extension to the HIP specification [RFC7401] itself, allowing establishment of HIP associations via one or more HIP RVSs.",
      "ja": "このセクションでは、HIP登録拡張機能[RFC8003]の拡張機能について説明します。これにより、HIPノードは、ランデブーサービスのためにRVSに登録し、現在の場所の変更をRVSに通知できます。 また、HIP仕様[RFC7401]自体の拡張についても説明し、1つ以上のHIP RVSを介したHIPアソシエーションの確立を可能にします。"
    },
    {
      "indent": 0,
      "text": "4.1. RENDEZVOUS Registration Type",
      "section_title": true,
      "ja": "4.1。 RENDEZVOUS登録タイプ"
    },
    {
      "indent": 3,
      "text": "This specification defines an additional registration for the HIP Registration Extension [RFC8003] that allows registering with an RVS for rendezvous service.",
      "ja": "この仕様は、ランデブーサービスのためにRVSに登録できるようにするHIP Registration Extension [RFC8003]の追加登録を定義します。"
    },
    {
      "indent": 3,
      "text": "Number   Registration Type\n------   -----------------\n1        RENDEZVOUS",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "4.2. Parameter Formats and Processing",
      "section_title": true,
      "ja": "4.2。 パラメータの形式と処理"
    },
    {
      "indent": 0,
      "text": "4.2.1. RVS_HMAC Parameter",
      "section_title": true,
      "ja": "4.2.1。 RVS_HMACパラメーター"
    },
    {
      "indent": 3,
      "text": "The RVS_HMAC is a non-critical parameter whose only difference with the HMAC parameter defined in the HIP specification [RFC7401] is its \"type\" code. This change causes it to be located after the FROM parameter (as opposed to the HMAC):",
      "ja": "RVS_HMACは重要ではないパラメーターで、HIP仕様[RFC7401]で定義されているHMACパラメーターとの唯一の違いはその「タイプ」コードです。 この変更により、（HMACではなく）FROMパラメーターの後に配置されます。"
    },
    {
      "indent": 3,
      "text": "Type 65500 Length Variable. Length in octets, excluding Type, Length, and Padding.",
      "ja": "タイプ65500の長さ変数。 タイプ、長さ、およびパディングを除くオクテット単位の長さ。"
    },
    {
      "indent": 3,
      "text": "HMAC HMAC computed over the HIP packet, excluding the RVS_HMAC parameter and any following parameters. The HMAC is keyed with the appropriate HIP integrity key (HIP-lg or HIP-gl) established when rendezvous registration happened. The HIP \"checksum\" field MUST be set to zero, and the HIP header length in the HIP common header MUST be calculated not to cover any excluded parameter when the HMAC is calculated. The size of the HMAC is the natural size of the hash computation output depending on the used hash function.",
      "ja": "HMAC HMACは、HIPパケットで計算されましたが、RVS_HMACパラメーターとそれに続くパラメーターは除外されています。 HMACは、ランデブー登録が行われたときに確立された適切なHIP整合性キー（HIP-lgまたはHIP-gl）でキー設定されます。 HIP「チェックサム」フィールドはゼロに設定する必要があり、HIP共通ヘッダーのHIPヘッダー長は、HMACの計算時に除外パラメーターをカバーしないように計算する必要があります。 HMACのサイズは、使用されるハッシュ関数に応じたハッシュ計算出力の自然なサイズです。"
    },
    {
      "indent": 3,
      "text": "To allow a rendezvous client and its RVS to verify the integrity of packets flowing between them, both SHOULD protect packets with an added RVS_HMAC parameter keyed with the HIP-lg or HIP-gl integrity key established while registration occurred. A valid RVS_HMAC SHOULD be present on every packet flowing between a client and a server and MUST be present when a FROM parameter is processed.",
      "ja": "ランデブークライアントとそのRVSがそれらの間を流れるパケットの整合性を検証できるように、両方とも、登録中に確立されたHIP-lgまたはHIP-gl整合性キーをキーとする追加のRVS_HMACパラメーターでパケットを保護する必要があります。 有効なRVS_HMACは、クライアントとサーバー間を流れるすべてのパケットに存在する必要があり、FROMパラメータが処理されるときに存在しなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2.2. FROM Parameter",
      "section_title": true,
      "ja": "4.2.2。 FROMパラメーター"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|             Type              |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n|                             Address                           |\n|                                                               |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "Type 65498 Length 16 Address An IPv6 address or an IPv4-in-IPv6 format IPv4 address.",
      "ja": "タイプ65498長さ16アドレスIPv6アドレスまたはIPv4-in-IPv6形式のIPv4アドレス。"
    },
    {
      "indent": 3,
      "text": "An RVS MUST add a FROM parameter containing the original source IP address of a HIP packet whenever the source IP address in the IP header is rewritten. If one or more FROM parameters are already present, the new FROM parameter MUST be appended after the existing ones.",
      "ja": "RVSは、IPヘッダーのソースIPアドレスが書き換えられるたびに、HIPパケットの元のソースIPアドレスを含むFROMパラメーターを追加する必要があります。 1つ以上のFROMパラメーターが既に存在する場合、既存のパラメーターの後に新しいFROMパラメーターを追加する必要があります。"
    },
    {
      "indent": 3,
      "text": "Whenever an RVS inserts a FROM parameter, it MUST insert an RVS_HMAC protecting the packet integrity, especially the IP address included in the FROM parameter.",
      "ja": "RVSがFROMパラメーターを挿入するときはいつでも、パケットの整合性、特にFROMパラメーターに含まれるIPアドレスを保護するRVS_HMACを挿入する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.2.3. VIA_RVS Parameter",
      "section_title": true,
      "ja": "4.2.3。 VIA_RVSパラメーター"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|             Type              |             Length            |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n|                            Address                            |\n|                                                               |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n.                               .                               .\n.                               .                               .\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                                                               |\n|                            Address                            |\n|                                                               |\n|                                                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 4,
      "text": "Type 65502 Length Variable Address An IPv6 address or an IPv4-in-IPv6 format IPv4 address.",
      "ja": "タイプ65502長さ可変アドレスIPv6アドレスまたはIPv4-in-IPv6形式のIPv4アドレス。"
    },
    {
      "indent": 3,
      "text": "After the Responder receives a relayed I1 packet, it can begin to send HIP packets addressed to the Initiator's IP address, without further assistance from an RVS. For debugging purposes, it MUST append a newly created VIA_RVS parameter at the end of the R1 packet that contains the IP address of the RVS that relayed the I1 packet. Including more than one IP address in the VIA_RVS parameter is outside the scope of this specification. The main goal of using the VIA_RVS parameter is to allow operators to diagnose possible issues encountered while establishing a HIP association via an RVS.",
      "ja": "レスポンダーは、中継されたI1パケットを受信すると、RVSからの支援がなくても、イニシエーターのIPアドレスにアドレス指定されたHIPパケットの送信を開始できます。 デバッグのために、I1パケットを中継したRVSのIPアドレスを含む、新しく作成されたVIA_RVSパラメーターをR1パケットの最後に追加する必要があります。 VIA_RVSパラメーターに複数のIPアドレスを含めることは、この仕様の範囲外です。 VIA_RVSパラメーターを使用する主な目的は、オペレーターがRVSを介してHIPアソシエーションを確立する際に発生する可能性のある問題を診断できるようにすることです。"
    },
    {
      "indent": 0,
      "text": "4.3. Modified Packets Processing",
      "section_title": true,
      "ja": "4.3。 変更されたパケット処理"
    },
    {
      "indent": 3,
      "text": "The following subsections describe the differences of the processing of I1 and R1 while an RVS is involved in the base exchange.",
      "ja": "以下のサブセクションでは、RVSが基本交換に関与している間のI1とR1の処理の違いについて説明します。"
    },
    {
      "indent": 0,
      "text": "4.3.1. Processing Outgoing I1 Packets",
      "section_title": true,
      "ja": "4.3.1。 発信I1パケットの処理"
    },
    {
      "indent": 3,
      "text": "An Initiator SHOULD NOT send an opportunistic I1 with a NULL destination HIT to an IP address that is known to be a rendezvous server address, unless it wants to establish a HIP association with the RVS itself and does not know its HIT.",
      "ja": "イニシエーターは、RVS自体とのHIPアソシエーションを確立する必要があり、そのHITが不明な場合を除き、ランデブーサーバーアドレスであることがわかっているIPアドレスに、宛先HITがNULLの日和見I1を送信すべきではありません。"
    },
    {
      "indent": 3,
      "text": "When an RVS rewrites the source IP address of an I1 packet due to egress filtering, it MUST add a FROM parameter to the I1 that contains the Initiator's source IP address. This FROM parameter MUST be protected by an RVS_HMAC keyed with the integrity key established at rendezvous registration.",
      "ja": "RVSが出力フィルタリングのためにI1パケットのソースIPアドレスを書き換える場合、イニシエーターのソースIPアドレスを含むFROMパラメーターをI1に追加する必要があります。 このFROMパラメーターは、ランデブー登録時に確立された整合性キーでキー設定されたRVS_HMACによって保護されなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.3.2. Processing Incoming I1 Packets",
      "section_title": true,
      "ja": "4.3.2。 着信I1パケットの処理"
    },
    {
      "indent": 3,
      "text": "When an RVS receives an I1 whose destination HIT is not its own, it consults its registration database to find a registration for the rendezvous service established by the HIT owner. If it finds an appropriate registration, it relays the packet to the registered IP address. If it does not find an appropriate registration, it drops the packet.",
      "ja": "RVSは、宛先HITが独自のものではないI1を受信すると、その登録データベースを調べて、HIT所有者によって確立されたランデブーサービスの登録を見つけます。 適切な登録を見つけると、登録されたIPアドレスにパケットを中継します。 適切な登録が見つからない場合、パケットをドロップします。"
    },
    {
      "indent": 3,
      "text": "An RVS SHOULD interpret any incoming opportunistic I1 (i.e., an I1 with a NULL destination HIT) as an I1 addressed to itself and SHOULD NOT attempt to relay it to one of its clients.",
      "ja": "RVSは、着信日和見I1（つまり、宛先HITがNULLのI1）を自分宛のI1として解釈する必要があり（SHOULD NOT）、クライアントの1つへの中継を試みるべきではありません（SHOULD NOT）。"
    },
    {
      "indent": 3,
      "text": "When a rendezvous client receives an I1, it MUST validate any present RVS_HMAC parameter. If the RVS_HMAC cannot be verified, the packet SHOULD be dropped. If the RVS_HMAC cannot be verified and a FROM parameter is present, the packet MUST be dropped.",
      "ja": "ランデブークライアントがI1を受信すると、現在のRVS_HMACパラメーターを検証する必要があります。 RVS_HMACを検証できない場合、パケットをドロップする必要があります。 RVS_HMACを検証できず、FROMパラメータが存在する場合、パケットをドロップする必要があります。"
    },
    {
      "indent": 3,
      "text": "A rendezvous client acting as Responder SHOULD drop opportunistic I1s that include a FROM parameter, because this indicates that the I1 has been relayed.",
      "ja": "レスポンダーとして動作するランデブークライアントは、FROMパラメーターを含む日和見的なI1をドロップする必要があります。これは、I1が中継されたことを示しているためです。"
    },
    {
      "indent": 0,
      "text": "4.3.3. Processing Outgoing R1 Packets",
      "section_title": true,
      "ja": "4.3.3。 発信R1パケットの処理"
    },
    {
      "indent": 3,
      "text": "When a Responder replies to an I1 relayed via an RVS, it MUST append to the regular R1 header a VIA_RVS parameter containing the IP addresses of the traversed RVSs.",
      "ja": "ResponderがRVSを介してリレーされたI1に応答する場合、通常のR1ヘッダーに、通過したRVSのIPアドレスを含むVIA_RVSパラメーターを追加する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3.4. Processing Incoming R1 Packets",
      "section_title": true,
      "ja": "4.3.4。 着信R1パケットの処理"
    },
    {
      "indent": 3,
      "text": "The HIP specification [RFC7401] mandates that a system receiving an R1 MUST first check to see if it has sent an I1 to the originator of the R1 (i.e., the system is in state I1-SENT). When the R1 is replying to a relayed I1, this check SHOULD be based on HITs only. In case the IP addresses are also checked, then the source IP address MUST be checked against the IP address included in the VIA_RVS parameter.",
      "ja": "HIP仕様[RFC7401]では、R1を受信するシステムは、最初にR1の発信者にI1を送信したかどうかを確認する必要があります（つまり、システムは状態I1-SENTにあります）。 R1がリレーされたI1に応答する場合、このチェックはHITのみに基づいている必要があります。 IPアドレスもチェックされる場合は、VIA_RVSパラメーターに含まれるIPアドレスに対してソースIPアドレスをチェックする必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Security Considerations",
      "section_title": true,
      "ja": "5.セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This section discusses the known threats introduced by these HIP extensions and the implications on the overall security of HIP. In particular, it argues that the extensions described in this document do not introduce additional threats to HIP.",
      "ja": "このセクションでは、これらのHIP拡張によって導入された既知の脅威と、HIPの全体的なセキュリティへの影響について説明します。 特に、このドキュメントで説明されている拡張機能は、HIPに追加の脅威をもたらさないと主張します。"
    },
    {
      "indent": 3,
      "text": "It is difficult to encompass the whole scope of threats introduced by RVSs because their presence has implications both at the IP and HIP layers. In particular, these extensions might allow for redirection, amplification, and reflection attacks at the IP layer, as well as attacks on the HIP layer itself, for example, man-in-the-middle attacks against the HIP base exchange.",
      "ja": "RVSによってもたらされる脅威の範囲全体を網羅することは困難です。なぜなら、それらの存在はIP層とHIP層の両方に影響を与えるからです。 特に、これらの拡張機能により、IPレイヤーでのリダイレクト、増幅、および反射攻撃、およびHIPレイヤー自体への攻撃（HIPベース交換に対する中間者攻撃など）が可能になる場合があります。"
    },
    {
      "indent": 3,
      "text": "If an Initiator has a priori knowledge of the Responder's host identity when it first contacts the Responder via an RVS, it has a means to verify the signatures in the HIP base exchange, which protects against man-in-the-middle attacks.",
      "ja": "イニシエーターが最初にRVS経由でレスポンダーに連絡するときに、レスポンダーのホストIDのアプリオリ知識を持っている場合、中間者攻撃から保護するHIPベース交換の署名を検証する手段があります。"
    },
    {
      "indent": 3,
      "text": "If an Initiator does not have a priori knowledge of the Responder's host identity (so-called \"opportunistic Initiators\"), it is almost impossible to defend the HIP exchange against these attacks, because the public keys exchanged cannot be authenticated. The only approach would be to mitigate hijacking threats on HIP state by requiring an R1 answering an opportunistic I1 to come from the same IP address that originally sent the I1. This procedure retains a level of security that is equivalent to what exists in the Internet today.",
      "ja": "イニシエーターがレスポンダーのホストID（いわゆる「日和見的イニシエーター」）の先験的な知識を持っていない場合、交換された公開鍵を認証できないため、これらの攻撃からHIP交換を防御することはほとんど不可能です。 唯一のアプローチは、最初にI1を送信した同じIPアドレスから来るように日和見的なI1に応答するR1を要求することにより、HIP状態でのハイジャックの脅威を緩和することです。 この手順は、今日のインターネットに存在するものと同等のセキュリティレベルを維持します。"
    },
    {
      "indent": 3,
      "text": "However, for reasons of simplicity, this specification does not allow the establishment of a HIP association via an RVS in an opportunistic manner.",
      "ja": "ただし、単純化のため、この仕様では、日和見的にRVSを介してHIPアソシエーションを確立することはできません。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "[RFC5204], obsoleted by this document, made the following definitions and reservations in the \"Parameter Types\" subregistry under \"Host Identity Protocol (HIP) Parameters\":",
      "ja": "[RFC5204]は、このドキュメントで廃止され、「Host Identity Protocol（HIP）Parameters」の下の「Parameter Types」サブレジストリで次の定義と予約を行いました。"
    },
    {
      "indent": 3,
      "text": "Value   Parameter Type  Length\n-----   --------------  --------\n65498   FROM            16\n65500   RVS_HMAC        variable\n65502   VIA_RVS         variable",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In the \"Parameter Types\" subregistry under \"Host Identity Protocol (HIP) Parameters\", references to [RFC5204] have been replaced by references to this document.",
      "ja": "「Host Identity Protocol（HIP）Parameters」の下の「Parameter Types」サブレジストリでは、[RFC5204]への参照がこのドキュメントへの参照に置き換えられました。"
    },
    {
      "indent": 3,
      "text": "[RFC5204], obsoleted by this document, made the following definition and reservation in the \"Registration Types\" subregistry under \"Host Identity Protocol (HIP) Parameters\":",
      "ja": "[RFC5204]は、このドキュメントで廃止され、「Host Identity Protocol（HIP）Parameters」の下の「Registration Types」サブレジストリで次の定義と予約を行いました。"
    },
    {
      "indent": 3,
      "text": "Value   Registration Type\n-----   -----------------\n1       RENDEZVOUS",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "In the \"Registration Types\" subregistry under \"Host Identity Protocol (HIP) Parameters\", references to [RFC5204] have been replaced by references to this document.",
      "ja": "「Host Identity Protocol（HIP）Parameters」の下の「Registration Types」サブレジストリで、[RFC5204]への参照はこのドキュメントへの参照に置き換えられました。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7.参照"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1。 規範的参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC1122] Braden, R., Ed., \"Requirements for Internet Hosts - Communication Layers\", STD 3, RFC 1122, DOI 10.17487/RFC1122, October 1989, <http://www.rfc-editor.org/info/rfc1122>.",
      "ja": "[RFC1122]ブレーデン、R。、「インターネットホストの要件-通信層」、STD 3、RFC 1122、DOI 10.17487 / RFC1122、1989年10月、<http://www.rfc-editor.org/info/ rfc1122>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S。、「要求レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC6724] Thaler, D., Ed., Draves, R., Matsumoto, A., and T. Chown, \"Default Address Selection for Internet Protocol Version 6 (IPv6)\", RFC 6724, DOI 10.17487/RFC6724, September 2012, <http://www.rfc-editor.org/info/rfc6724>.",
      "ja": "[RFC6724] Thaler、D.、Ed。、Draves、R.、Matsumoto、A。、およびT. Chown、「インターネットプロトコルバージョン6（IPv6）のデフォルトアドレス選択」、RFC 6724、DOI 10.17487 / RFC6724、2012年9月 、<http://www.rfc-editor.org/info/rfc6724>。"
    },
    {
      "indent": 3,
      "text": "[RFC7401] Moskowitz, R., Ed., Heer, T., Jokela, P., and T. Henderson, \"Host Identity Protocol Version 2 (HIPv2)\", RFC 7401, DOI 10.17487/RFC7401, April 2015, <http://www.rfc-editor.org/info/rfc7401>.",
      "ja": "[RFC7401] Moskowitz、R.、Ed。、Heer、T.、Jokela、P.、およびT. Henderson、「Host Identity Protocol Version 2（HIPv2）」、RFC 7401、DOI 10.17487 / RFC7401、2015年4月 ：//www.rfc-editor.org/info/rfc7401>。"
    },
    {
      "indent": 3,
      "text": "[RFC8003] Laganier, J. and L. Eggert, \"Host Identity Protocol (HIP) Registration Extension\", RFC 8003, DOI 10.17487/RFC8003, October 2016, <http://www.rfc-editor.org/info/rfc8003>.",
      "ja": "[RFC8003] Laganier、J。およびL. Eggert、「ホストアイデンティティプロトコル（HIP）登録拡張」、RFC 8003、DOI 10.17487 / RFC8003、2016年10月、<http://www.rfc-editor.org/info/rfc8003 >。"
    },
    {
      "indent": 3,
      "text": "[RFC8005] Laganier, J., \"Host Identity Protocol (HIP) Domain Name System (DNS) Extension\", RFC 8005, DOI 10.17487/RFC8005, October 2016, <http://www.rfc-editor.org/info/rfc8005>.",
      "ja": "[RFC8005] Laganier、J。、「ホストアイデンティティプロトコル（HIP）ドメインネームシステム（DNS）拡張」、RFC 8005、DOI 10.17487 / RFC8005、2016年10月、<http://www.rfc-editor.org/info/ rfc8005>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2。 参考資料"
    },
    {
      "indent": 3,
      "text": "[HIP-ARCH] Moskowitz, R. and M. Komu, \"Host Identity Protocol Architecture\", Work in Progress, draft-ietf-hip-rfc4423- bis-14, June 2016.",
      "ja": "[HIP-ARCH] Moskowitz、R。、およびM. Komu、「ホストアイデンティティプロトコルアーキテクチャ」、Work in Progress、draft-ietf-hip-rfc4423- bis-14、2016年6月。"
    },
    {
      "indent": 3,
      "text": "[HIP-HOST-MOB] Henderson, T., Vogt, C., and J. Arkko, \"Host Mobility with the Host Identity Protocol\", Work in Progress, draft-ietf-hip-rfc5206-bis-14, October 2016.",
      "ja": "[HIP-HOST-MOB] Henderson、T.、Vogt、C。、およびJ. Arkko、「ホストアイデンティティプロトコルを使用したホストモビリティ」、Work in Progress、draft-ietf-hip-rfc5206-bis-14、2016年10月 。"
    },
    {
      "indent": 3,
      "text": "[RFC2827] Ferguson, P. and D. Senie, \"Network Ingress Filtering: Defeating Denial of Service Attacks which employ IP Source Address Spoofing\", BCP 38, RFC 2827, DOI 10.17487/RFC2827, May 2000, <http://www.rfc-editor.org/info/rfc2827>.",
      "ja": "[RFC2827]ファーガソン、P。、およびD.セニー、「ネットワークイングレスフィルタリング：IPソースアドレススプーフィングを使用するサービス拒否攻撃に打ち勝つ」、BCP 38、RFC 2827、DOI 10.17487 / RFC2827、2000年5月、<http：// www .rfc-editor.org / info / rfc2827>。"
    },
    {
      "indent": 3,
      "text": "[RFC3013] Killalea, T., \"Recommended Internet Service Provider Security Services and Procedures\", BCP 46, RFC 3013, DOI 10.17487/RFC3013, November 2000, <http://www.rfc-editor.org/info/rfc3013>.",
      "ja": "[RFC3013]キラレア、T。、「推奨されるインターネットサービスプロバイダーのセキュリティサービスと手順」、BCP 46、RFC 3013、DOI 10.17487 / RFC3013、2000年11月、<http://www.rfc-editor.org/info/rfc3013> 。"
    },
    {
      "indent": 3,
      "text": "[RFC5204] Laganier, J. and L. Eggert, \"Host Identity Protocol (HIP) Rendezvous Extension\", RFC 5204, DOI 10.17487/RFC5204, April 2008, <http://www.rfc-editor.org/info/rfc5204>.",
      "ja": "[RFC5204] Laganier、J。およびL. Eggert、「ホストアイデンティティプロトコル（HIP）ランデブー拡張」、RFC 5204、DOI 10.17487 / RFC5204、2008年4月、<http://www.rfc-editor.org/info/rfc5204 >。"
    },
    {
      "indent": 0,
      "text": "Appendix A. Changes from ",
      "ja": "付録A.変更点"
    },
    {
      "indent": 3,
      "text": "o Updated HIP references to revised HIP specifications.",
      "ja": "o改訂されたHIP仕様へのHIP参照を更新しました。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The following people have provided thoughtful and helpful discussions and/or suggestions that have improved this document: Marcus Brunner, Tom Henderson, Miika Komu, Mika Kousa, Pekka Nikander, Juergen Quittek, Justino Santos, Simon Schuetz, Tim Shepard, Kristian Slavov, and Martin Stiemerling.",
      "ja": "以下の人々は、このドキュメントを改善する思慮深く有益な議論や提案を提供してくれました。 マーティン・スティーマーリング。"
    },
    {
      "indent": 3,
      "text": "Lars Eggert has received funding from the European Union's Horizon 2020 research and innovation program 2014-2018 under grant agreement No. 644866. This document reflects only the authors' views, and the European Commission is not responsible for any use that may be made of the information it contains.",
      "ja": "Lars Eggertは、助成金契約第644866の下で、欧州連合のHorizon 2020研究およびイノベーションプログラム2014-2018から資金を受け取っています。この文書は著者の見解のみを反映しており、欧州委員会は、 含まれる情報。"
    },
    {
      "indent": 3,
      "text": "Thanks to Joel M. Halpern for performing the Gen-ART review of this document as part of the publication process.",
      "ja": "公開プロセスの一部としてこのドキュメントのGen-ARTレビューを行ってくれたJoel M. Halpernに感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Julien Laganier Luminate Wireless, Inc. Cupertino, CA United States of America",
      "ja": "Julien Laganier Luminate Wireless、Inc.カリフォルニア州クパチーノアメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: julien.ietf@gmail.com",
      "ja": "メール：julien.ietf@gmail.com"
    },
    {
      "indent": 3,
      "text": "Lars Eggert NetApp Sonnenallee 1 Kirchheim 85551 Germany",
      "ja": "Lars Eggert NetApp Sonnenallee 1 Kirchheim 85551ドイツ"
    },
    {
      "indent": 3,
      "text": "Phone: +49 151 12055791 Email: lars@netapp.com URI: http://eggert.org",
      "ja": "電話：+49 151 12055791メール：lars@netapp.com URI：http://eggert.org"
    }
  ]
}