{
  "title": {
    "text": "RFC 8728 - RFC Editor Model (Version 2)",
    "ja": "RFC 8728 - RFC Editor Model（バージョン2）"
  },
  "number": 8728,
  "created_at": "2020-03-11 18:18:32.401918+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Architecture Board (IAB)                        O. Kolkman, Ed.\nRequest for Comments: 8728                              Internet Society\nObsoletes: 6635                                          J. Halpern, Ed.\nCategory: Informational                                         Ericsson\nISSN: 2070-1721                                           R. Hinden, Ed.\n                                                    Check Point Software\n                                                           February 2020",
      "raw": true
    },
    {
      "indent": 22,
      "text": "RFC Editor Model (Version 2)",
      "ja": "RFC Editor Model（バージョン2）"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The RFC Editor model described in this document divides the responsibilities for the RFC Series into three functions: the RFC Series Editor, the RFC Production Center, and the RFC Publisher. Internet Architecture Board (IAB) oversight via the RFC Series Oversight Committee (RSOC) is described, as is the relationship between the IETF Administration Limited Liability Company and the RSOC. This document reflects the experience gained with \"RFC Editor Model (Version 1)\", documented in RFC 5620; and obsoletes RFC 6635 to replace all references to the IETF Administrative Support Activity (IASA) and related structures with those defined by the IASA 2.0 Model.",
      "ja": "このドキュメントで説明するRFCエディターモデルは、RFCシリーズの責任を3つの機能に分割します。RFCシリーズエディター、RFCプロダクションセンター、およびRFCパブリッシャーです。 IETF Administration Limited Liability CompanyとRSOCの関係と同様に、RFCシリーズ監視委員会（RSOC）によるインターネットアーキテクチャ委員会（IAB）の監視について説明します。 このドキュメントは、RFC 5620で文書化された「RFC Editor Model（Version 1）」で得られた経験を反映しています。 RFC 6635を廃止し、IETF管理サポートアクティビティ（IASA）および関連する構造へのすべての参照をIASA 2.0モデルで定義されたものに置き換えます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントは、インターネット標準化過程の仕様ではありません。 情報提供を目的として公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Architecture Board (IAB) and represents information that the IAB has deemed valuable to provide for permanent record. It represents the consensus of the Internet Architecture Board (IAB). Documents approved for publication by the IAB are not candidates for any level of Internet Standard; see Section 2 of RFC 7841.",
      "ja": "このドキュメントは、インターネットアーキテクチャ委員会（IAB）の製品であり、IABが永続的な記録を提供するのに価値があると判断した情報を表しています。 これは、インターネットアーキテクチャ委員会（IAB）のコンセンサスを表しています。 IABによる公開が承認されたドキュメントは、どのレベルのインターネット標準の候補でもありません。 RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8728.",
      "ja": "このドキュメントの現在のステータス、エラッタ、およびフィードバックの提供方法に関する情報は、https：//www.rfc-editor.org/info/rfc8728で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2020 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（c）2020 IETF Trustおよび文書作成者として特定された人物。 全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document.",
      "ja": "このドキュメントは、このドキュメントの公開日に有効なBCP 78およびIETFトラストのIETFドキュメントに関連する法的条項（https://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているので、注意深く確認してください。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction 1.1. The RFC Editor Function 2. RFC Editor Model 2.1. RFC Series Editor 2.1.1. Strategic Leadership and Management of the Publication and Production Functions 2.1.2. Representation of the RFC Series 2.1.2.1. Representation to the IETF 2.1.2.2. External Representation 2.1.3. Development of RFC Production and Publication 2.1.4. Development of the RFC Series 2.1.5. Workload 2.1.6. Qualifications 2.1.7. Conflict of Interest 2.2. RFC Production Center 2.3. RFC Publisher 3. Committees 3.1. RFC Series Oversight Committee (RSOC) 3.1.1. RSOC Composition 4. Administrative Implementation 4.1. Vendor Selection for the Production and Publisher Functions 4.2. Budget 4.3. Disagreements among Entities Related to the RFC Editor 4.4. Issues with Contractual Impact 5. IANA Considerations 6. Security Considerations 7. References 7.1. Normative References 7.2. Informative References IAB Members at the Time of Approval Acknowledgments Authors' Addresses",
      "ja": "1. はじめに1.1。 RFCエディター機能2. RFCエディターモデル2.1。 RFCシリーズエディター2.1.1。 出版および生産機能の戦略的リーダーシップと管理2.1.2。 RFCシリーズ2.1.2.1の表現。 IETF 2.1.2.2への表現。 外部表現2.1.3。 RFC Production and Publication 2.1.4。の開発 RFCシリーズ2.1.5の開発。 ワークロード2.1.6。 資格2.1.7。 利益相反2.2。 RFC Production Center 2.3。 RFCパブリッシャー3.委員会3.1。 RFCシリーズ監視委員会（RSOC）3.1.1。 RSOCの構成4.管理の実装4.1。 プロダクションおよびパブリッシャー機能のベンダーの選択4.2。 予算4.3。 RFCエディターに関連するエンティティ間の不一致4.4。 契約上の影響に関する問題5. IANAに関する考慮事項6.セキュリティに関する考慮事項7.参照7.1。 規範的参考資料7.2。 承認時の参考文献IABメンバー謝辞著者の住所"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document reflects the experience gained with \"RFC Editor Model (Version 1)\", documented in [RFC5620], and updates the RFC Editor Model (Version 2) to be aligned with the new IASA 2.0 Model [RFC8711] that creates the IETF Administration Limited Liability Company (IETF LLC) managed by a board of directors (IETF LLC Board). As part of the IASA 2.0 Model, the IETF Administrative Oversight Committee (IAOC) is eliminated, and its oversight and advising functions transferred to the new IETF LLC. This document obsoletes [RFC6635] to replace all references to the IASA and related structures with those defined by the IASA 2.0 Model.",
      "ja": "このドキュメントは、[RFC5620]で文書化された「RFC Editor Model（Version 1）」で得られた経験を反映し、IETF Administrationを作成する新しいIASA 2.0 Model [RFC8711]に合わせてRFC Editor Model（Version 2）を更新します 取締役会（IETF LLC取締役会）が管理する有限責任会社（IETF LLC）。 IASA 2.0モデルの一部として、IETF管理監視委員会（IAOC）が廃止され、その監視および助言機能が新しいIETF LLCに移されました。 このドキュメントは[RFC6635]を廃止し、IASAおよび関連する構造へのすべての参照をIASA 2.0モデルで定義されたものに置き換えます。"
    },
    {
      "indent": 3,
      "text": "The IAB, on behalf of the Internet technical community, is concerned with ensuring the continuity of the RFC Series, orderly RFC Editor succession, RFC quality, and RFC document accessibility. The IAB is also sensitive to the concerns of the IETF LLC about providing the necessary services in a cost-effective and efficient manner.",
      "ja": "IABは、インターネットテクニカルコミュニティを代表して、RFCシリーズの継続性、秩序あるRFCエディターの継承、RFC品質、およびRFCドキュメントのアクセシビリティを確保することに関心があります。 IABは、費用対効果の高い効率的な方法で必要なサービスを提供することに関するIETF LLCの懸念にも敏感です。"
    },
    {
      "indent": 3,
      "text": "The previous RFC Editor model [RFC5620] was first approved by the IAB in October 2008, and our understanding of the model has evolved with our experience since. During the implementation of version 1 of the model [RFC5620], it was quickly realized that the role of the RFC Series Editor (RSE) and the oversight responsibilities needed to be structured differently. In order to gain experience with \"running code\", a transitional RSE was hired who analyzed the managerial environment and provided recommendations. This was followed by the appointment of an acting RSE, who ably managed the series while work was undertaken to select and hire a permanent RSE. This version of the model is based on the recommendations of both temporary RFC Series Editors and the extensive discussion in the IETF community, on the rfc-interest list, and within the IAB.",
      "ja": "以前のRFC Editorモデル[RFC5620]は、2008年10月にIABによって最初に承認されました。モデルの理解は、それ以来の経験とともに発展してきました。 モデル[RFC5620]のバージョン1の実装中に、RFCシリーズエディター（RSE）の役割と監視責任を異なる構造にする必要があることがすぐに認識されました。 「実行中のコード」の経験を積むために、管理環境を分析し、推奨事項を提供する移行RSEを雇いました。 これに続いて、恒久的なRSEを選択して雇用するための仕事が行われている間、シリーズをうまく管理している演技RSEが任命されました。 このバージョンのモデルは、一時的なRFCシリーズエディタの推奨事項と、IETFコミュニティ、rfc-interestリスト、およびIAB内での広範な議論に基づいています。"
    },
    {
      "indent": 3,
      "text": "This document, and the resulting structures, will be modified as needed through normal procedures. The RSE, and the IAB, through the RFC Series Oversight Committee (see Section 3.1), will continue to monitor discussions within the community about potential adjustments to the RFC Editor model and recognize that the process described in this document may need to be adjusted to align with any changes that result from such discussions; hence, the version number in the title.",
      "ja": "このドキュメントと結果の構造は、通常の手順で必要に応じて変更されます。 RSEおよびIABは、RFCシリーズ監視委員会（セクション3.1を参照）を通じて、RFCエディターモデルの潜在的な調整に関するコミュニティ内の議論を引き続き監視し、このドキュメントで説明されているプロセスを調整する必要があることを認識します そのような議論から生じるあらゆる変更に対応する。 したがって、タイトルのバージョン番号。"
    },
    {
      "indent": 3,
      "text": "The IAB maintains its responsibilities as defined in [RFC2850].",
      "ja": "IABは、[RFC2850]で定義されている責任を維持します。"
    },
    {
      "indent": 0,
      "text": "1.1. The RFC Editor Function",
      "section_title": true,
      "ja": "1.1. RFCエディター機能"
    },
    {
      "indent": 3,
      "text": "The RFC Series is described in [RFC8729]. Its Section 3.1 defines \"RFC Editor\":",
      "ja": "RFCシリーズは[RFC8729]で説明されています。 セクション3.1では、「RFC Editor」を定義しています。"
    },
    {
      "indent": 3,
      "text": "| Originally, there was a single person acting as editor of the RFC | Series (the RFC Editor). The task has grown, and the work now | requires the organized activity of several experts, so there are | RFC Editors, or an RFC Editor organization. In time, there may be | multiple organizations working together to undertake the work | required by the RFC Series. For simplicity's sake, and without | attempting to predict how the role might be subdivided among them, | this document refers to this collection of experts and | organizations as the \"RFC Editor\". | | The RFC Editor is an expert technical editor and series editor, | acting to support the mission of the RFC Series. As such, the RFC | Editor is the implementer handling the editorial management of the | RFC Series, in accordance with the defined processes. In | addition, the RFC Editor is expected to be the expert and prime | mover in discussions about policies for editing, publishing, and | archiving RFCs.",
      "ja": "| もともと、RFCの編集者として行動している一人の人がいました。 シリーズ（RFCエディター）。 タスクが成長し、現在の作業| にはいくつかの専門家の組織的な活動が必要です。 RFC Editors、またはRFC Editor組織。 やがて、 仕事を引き受けるために一緒に働く複数の組織| RFCシリーズで必要です。 単純化のために、なしで| 役割がそれらの間でどのように細分されるかを予測しようとする| このドキュメントは、この専門家のコレクションを指し、| 「RFCエディター」としての組織。 | | RFCエディターは、専門の技術エディターおよびシリーズエディターです。 RFCシリーズのミッションをサポートするために行動する。 そのため、RFC | Editorは、の編集管理を処理する実装者です。 定義されたプロセスに従って、RFCシリーズ。 で| さらに、RFC Editorは専門家であり素数であることが期待されています。 編集、公開、および| RFCのアーカイブ。"
    },
    {
      "indent": 3,
      "text": "RFC 8729 does not explore the internal organization of the RFC Editor. However, RFC 8729 envisions changes in the RFC Editor organizational structure. There have been several iterations on efforts to improve and clarify this structure. These have been led by the IAB, in consultation with the community and many leadership bodies within the community. This first resulted in the publication of [RFC5620] and then in further discussions leading to the publication of [RFC6635]. Some of the details on this evolution can be found below. In undertaking this evolution, the IAB considered changes that increase flexibility and operational support options, provide for the orderly succession of the RFC Editor, and ensure the continuity of the RFC Series, while maintaining RFC quality, maintaining timely processing, ensuring document accessibility, reducing costs, and increasing cost transparency. The model set forth below describes the internal organization of the RFC Editor, while remaining consistent with RFC 8729.",
      "ja": "RFC 8729は、RFC Editorの内部組織を調査していません。ただし、RFC 8729は、RFC Editorの組織構造の変更を想定しています。この構造を改善および明確化するための取り組みについては、いくつかの繰り返しがありました。これらはIABが主導し、コミュニティおよびコミュニティ内の多くのリーダーシップ機関と協議しています。これにより、最初に[RFC5620]が公開され、次に[RFC6635]が公開されるまでさらに議論されました。この進化の詳細の一部を以下に示します。この進化に着手する際、IABは柔軟性と運用サポートオプションを向上させ、RFCエディターの秩序ある継承を提供し、RFC品質の維持、タイムリーな処理の維持、ドキュメントのアクセシビリティの確保、RFCシリーズの継続性を確保する変更を検討しましたコスト、およびコストの透明性の向上。以下に示すモデルは、RFC 8729との整合性を保ちながら、RFCエディターの内部組織を説明しています。"
    },
    {
      "indent": 3,
      "text": "Note that RFC 8729 uses the term \"RFC Editor function\" or \"RFC Editor\" as the collective set of responsibilities for which this memo provides a model for internal organization. This memo defines the term \"RFC Series Editor\" or \"Series Editor\" for one of the organizational components.",
      "ja": "RFC 8729では、「RFCエディター機能」または「RFCエディター」という用語を、このメモが内部組織のモデルを提供する責任の集合セットとして使用していることに注意してください。 このメモは、組織コンポーネントの1つに対する「RFCシリーズエディター」または「シリーズエディター」という用語を定義しています。"
    },
    {
      "indent": 0,
      "text": "2. RFC Editor Model",
      "section_title": true,
      "ja": "2. RFCエディターモデル"
    },
    {
      "indent": 3,
      "text": "The RFC Editor model divides the responsibilities for the RFC Series into the following components:",
      "ja": "RFC Editorモデルは、RFCシリーズの責任を次のコンポーネントに分割します。"
    },
    {
      "indent": 3,
      "text": "* RFC Series Editor (RSE)",
      "ja": "* RFCシリーズエディター（RSE）"
    },
    {
      "indent": 3,
      "text": "* RFC Production Center",
      "ja": "* RFCプロダクションセンター"
    },
    {
      "indent": 3,
      "text": "* RFC Publisher",
      "ja": "* RFCパブリッシャー"
    },
    {
      "indent": 3,
      "text": "The structure and relationship of the components of the RFC Series production and process is schematically represented by Figure 1. The picture does not depict oversight and escalation relations. It does include the streams and their managers (which are not part of the RFC Series Editor, the RFC Production Center, or Publisher facilities) in order to more fully show the context in which the RFC Series Editor operates.",
      "ja": "RFCシリーズの生産とプロセスのコンポーネントの構造と関係は、図1で概略的に表されています。この図は、監視とエスカレーションの関係を示していません。 RFCシリーズエディターが動作するコンテキストをより完全に示すために、ストリームとそのマネージャー（RFCシリーズエディター、RFCプロダクションセンター、またはパブリッシャー機能の一部ではない）が含まれます。"
    },
    {
      "indent": 3,
      "text": "                                      +-------------+\n                                      |             |\n                       +--------------+     IAB     <----------+\n                       |              |             |          |\n                       |              |=============|          |\n                       |              |             |          |\n                       |              |     RSOC    <----------+\n                       |              |             |          |\n                       |              +-------+-----+     +----+----+\n                       |                      |           |         |\n                       |          +...........|.........+ |Community|\n                       |          .           |         . |   at    |\n                       |          .   +-------V-----+   . |  Large  |\n                       |          .   |             |   . |         |\n                       |          .   |     RFC     |   . +----+----+\n                       |          .   |    Series   |   .      |\n                       |          .   |    Editor   <----------+\n                       |          .   |             |   .\n                       |          .   +-+---------+-+   .\n                       |          .     |         |     .\n+-------------+  +-----V-------+  .  +--V--+   +--V--+  .     +-----+\n|             |  |             |  .  |     |   |     |  .     |     |\n| Independent |  | Independent |  .  | RFC |   |     |  .     |  E  |\n|   Authors   +--> Submission  +----->     |   |     |  .     |  n  |\n|             |  |   Editor    |  .  |  P  |   |     |  .     |  d  |\n|             |  |             |  .  |  r  |   | RFC |  .     |     |\n+-------------+  +-------------+  .  |  o  |   |     |  .     |  U  |\n+-------------+  +-------------+  .  |  d  |   |  P  |  .     |  s  |\n|             |  |             |  .  |  u  |   |  u  |  .     |  e  |\n|     IAB     +-->     IAB     +----->  c  |   |  b  |  .     |  r  |\n|             |  |             |  .  |  t  |   |  l  |  .     |  s  |\n+-------------+  +-------------+  .  |  i  +--->  i  +-------->     |\n+-------------+  +-------------+  .  |  o  |   |  s  |  .     |  &  |\n|             |  |             |  .  |  n  |   |  h  |  .     |     |\n|    IRTF     +-->     IRSG    +---->|     |   |  e  |  .     |  R  |\n|             |  |             |  .  |  C  |   |  r  |  .     |  e  |\n+-------------+  +-------------+  .  |  e  |   |     |  .     |  a  |\n+-------------+  +-------------+  .  |  n  |   |     |  .     |  d  |\n|             |  |             |  .  |  t  |   |     |  .     |  e  |\n|    IETF     +-->    IESG     +----->  e  |   |     |  .     |  r  |\n|             |  |             |  .  |  r  |   |     |  .     |  s  |\n+-------------+  +-------------+  .  +-----+   +-----+  .     +-----+\n                                  .                     .\n                                  +..... RFC Editor ....+",
      "raw": true
    },
    {
      "indent": 10,
      "text": "Figure 1: Structure of RFC Series Production and Process",
      "ja": "図1：RFCシリーズの生産とプロセスの構造"
    },
    {
      "indent": 3,
      "text": "In this model, documents are produced and approved through multiple document streams. The stream manager for each stream is responsible for the content of that stream. The four streams that now exist are described in [RFC8729]. The RFC Editor function is responsible for the packaging and distribution of the documents. As such, documents from these streams are edited and processed by the Production Center and published by the Publisher. The RFC Series Editor will exercise strategic leadership and management over the activities of the RFC Publisher and the RFC Production Center (both of which can be seen as back-office functions) and will be the entity that:",
      "ja": "このモデルでは、ドキュメントは複数のドキュメントストリームを介して作成および承認されます。 各ストリームのストリームマネージャーは、そのストリームのコンテンツを担当します。 現在存在する4つのストリームは[RFC8729]で説明されています。 RFC Editor機能は、ドキュメントのパッケージ化と配布を担当します。 そのため、これらのストリームのドキュメントはProduction Centerによって編集および処理され、Publisherによって公開されます。 RFCシリーズエディターは、RFCパブリッシャーとRFCプロダクションセンター（どちらもバックオフィス機能と見なすことができます）の活動に対して戦略的なリーダーシップと管理を行い、次のエンティティになります。"
    },
    {
      "indent": 3,
      "text": "* Represents the RFC Series and the RFC Editor function within the IETF and externally.",
      "ja": "* IETF内および外部のRFCシリーズおよびRFCエディター機能を表します。"
    },
    {
      "indent": 3,
      "text": "* Leads the community in the design of improvements to the RFC Series.",
      "ja": "* RFCシリーズの改善の設計においてコミュニティをリードしています。"
    },
    {
      "indent": 3,
      "text": "* Is responsible for planning and seeing to the execution of improvements in the RFC Editor production and access processes.",
      "ja": "* RFC Editorの生産プロセスとアクセスプロセスの改善の計画と実行を担当します。"
    },
    {
      "indent": 3,
      "text": "* Is responsible for the content of the rfc-editor.org web site, which is operated and maintained by the RFC Publisher.",
      "ja": "* RFC Publisherによって運営および管理されているrfc-editor.org Webサイトのコンテンツを担当します。"
    },
    {
      "indent": 3,
      "text": "* Is responsible for developing consensus versions of vision and policy documents. These documents will be reviewed by the RFC Series Oversight Committee (Section 3.1) and subject to its approval before final publication.",
      "ja": "* ビジョンおよびポリシードキュメントのコンセンサスバージョンを開発する責任があります。 これらの文書は、RFCシリーズ監視委員会（セクション3.1）によってレビューされ、最終公開前に承認される必要があります。"
    },
    {
      "indent": 3,
      "text": "These responsibilities are defined below, although the specific work items under them are a matter for the actual employment contract and its Statement of Work (SOW).",
      "ja": "これらの責任は以下で定義されますが、その下の特定の作業項目は実際の雇用契約とその作業指示書（SOW）の問題です。"
    },
    {
      "indent": 3,
      "text": "The IAB maintain its chartered responsibility as defined in [RFC2850]. More details on the oversight by the IAB via the RFC Series Oversight Committee (RSOC) can be found in Section 3.1. For example, the RSE does not have the direct authority to hire or fire RFC Editor contractors or personnel.",
      "ja": "IABは、[RFC2850]で定義されているように、チャーターされた責任を維持します。 RFCシリーズ監視委員会（RSOC）を介したIABによる監視の詳細については、セクション3.1を参照してください。 たとえば、RSEには、RFC Editorの請負業者または要員を雇用または解雇する直接的な権限はありません。"
    },
    {
      "indent": 0,
      "text": "2.1. RFC Series Editor",
      "section_title": true,
      "ja": "2.1. RFCシリーズエディター"
    },
    {
      "indent": 3,
      "text": "The RFC Series Editor is the individual with overall responsibility for the quality, continuity, and evolution of the RFC Series.",
      "ja": "RFCシリーズエディタは、RFCシリーズの品質、継続性、および進化に対して全体的な責任を持つ個人です。"
    },
    {
      "indent": 3,
      "text": "The RSE is appointed by the IAB, but formally hired by the IETF LLC. The IAB delegates the direct oversight over the RSE to the RSOC, which it appoints.",
      "ja": "RSEはIABによって任命されますが、IETF LLCによって正式に雇用されています。 IABは、RSEに対する直接の監視をRSOCに委任し、RSOCが任命します。"
    },
    {
      "indent": 3,
      "text": "The RSE is expected to cooperate closely with the IETF LLC and the stream managers.",
      "ja": "RSEは、IETF LLCおよびストリームマネージャーと緊密に協力することが期待されています。"
    },
    {
      "indent": 0,
      "text": "2.1.1. Strategic Leadership and Management of the Publication and Production Functions",
      "ja": "2.1.1. 出版および生産機能の戦略的リーダーシップと管理"
    },
    {
      "indent": 3,
      "text": "With respect to the RFC Publisher and Production Center functions, the RSE provides input to the IETF LLC budget, SOWs, and manages vendor selection processes. The RSE performs annual reviews of the RFC Production Center and Publisher function, which are then provided to the RSOC, the IETF LLC, and the community. Normally, private financial details would not be included in a public version unless the IETF LLC concludes it is necessary to make such information public.",
      "ja": "RFC PublisherおよびProduction Centerの機能に関して、RSEはIETF LLC予算への入力、SOW、およびベンダー選択プロセスの管理を提供します。 RSEは、RFC Production CenterとPublisherの機能の年次レビューを実行します。これらは、RSOC、IETF LLC、およびコミュニティに提供されます。 通常、プライベートな金融の詳細は、IETF LLCがそのような情報を公開する必要があると結論付けない限り、パブリックバージョンに含まれません。"
    },
    {
      "indent": 3,
      "text": "The RSE is responsible for the performance of the RFC Production Center and Publisher. The RSE is responsible for issues that go beyond the RFC Production Center or Publisher functions, such as cross-stream coordination of priorities. Issues that require changes to the budget or contracts shall be brought to the attention of the IETF LLC by the RSE.",
      "ja": "RSEは、RFC Production CenterおよびPublisherのパフォーマンスを担当します。 RSEは、優先順位のクロスストリーム調整など、RFC Production CenterまたはPublisherの機能を超える問題を担当します。 予算または契約の変更を必要とする問題は、RSEによってIETF LLCに通知されます。"
    },
    {
      "indent": 3,
      "text": "The RSE is also responsible for creating documentation and structures that will allow for continuity of the RFC Series in the face of changes in contracts and personnel.",
      "ja": "また、RSEは、契約と人員の変更に直面した場合にRFCシリーズの継続を可能にする文書と構造の作成を担当します。"
    },
    {
      "indent": 3,
      "text": "Vendor selection for the RFC Production Center and Publisher functions is done in cooperation with the streams and under final authority of the IETF LLC. Details on this process can be found in Section 4.1.",
      "ja": "RFC Production CenterおよびPublisher機能のベンダー選択は、ストリームと協力して、IETF LLCの最終権限の下で行われます。 このプロセスの詳細は、セクション4.1に記載されています。"
    },
    {
      "indent": 0,
      "text": "2.1.2. Representation of the RFC Series",
      "section_title": true,
      "ja": "2.1.2. RFCシリーズの表現"
    },
    {
      "indent": 3,
      "text": "The RSE is the primary representative of the RFC Series. This representation is important both internally, relative to the IETF, and externally.",
      "ja": "RSEは、RFCシリーズの主要な代表です。 この表現は、IETFに関連して内部的にも外部的にも重要です。"
    },
    {
      "indent": 0,
      "text": "2.1.2.1. Representation to the IETF",
      "section_title": true,
      "ja": "2.1.2.1. IETFへの表現"
    },
    {
      "indent": 3,
      "text": "The RSE is the primary point of contact to the IETF on matters relating to the RFC Series in general, or policy matters relating to specific documents. Issues of practical details in the processing of specific documents are generally worked through directly with the RFC Production Center staff.",
      "ja": "RSEは、RFCシリーズ全般に関連する事項、または特定のドキュメントに関連するポリシー事項に関するIETFへの主要な連絡先です。 特定のドキュメントの処理における実際的な詳細の問題は、通常、RFC Production Centerスタッフと直接やり取りされます。"
    },
    {
      "indent": 3,
      "text": "This includes providing suitable reports to the community at large, providing email contact for policy questions and inputs, and enabling and participating in suitable on-line forums for discussion of issues related to the RFC Series.",
      "ja": "これには、コミュニティ全体への適切なレポートの提供、ポリシーに関する質問と入力のための電子メール連絡先の提供、RFCシリーズに関連する問題の議論のための適切なオンラインフォーラムの有効化と参加が含まれます。"
    },
    {
      "indent": 3,
      "text": "Due to the history and nature of the interaction between the RSE and the IETF, certain principles, described in the following subsections, must be understood and adhered to by the RSE in his or her interactions with the community. These apply to the representation function, as well as to the leadership the RSE provides for production and series development.",
      "ja": "RSEとIETFの相互作用の歴史と性質により、以下のサブセクションで説明する特定の原則は、コミュニティとの相互作用においてRSEによって理解され、遵守されなければなりません。 これらは、RSEが生産およびシリーズ開発に提供するリーダーシップだけでなく、表現機能にも適用されます。"
    },
    {
      "indent": 0,
      "text": "2.1.2.1.1. Volunteerism",
      "section_title": true,
      "ja": "2.1.2.1.1. ボランティア"
    },
    {
      "indent": 3,
      "text": "The vast majority of Internet technical community work is led, initiated, and done by community volunteers, including oversight, policy making, and direct production of, for example, many software tools. The RSE, while not a volunteer, is dependent upon these volunteer participants. Also, the spirit of the community is heavily focused on and draws from these volunteers. As such, the RSE needs to support the vitality and effectiveness of volunteer participation.",
      "ja": "インターネットテクニカルコミュニティの作業の大部分は、コミュニティボランティアによって主導、開始、実行されます。これには、監視、ポリシー作成、およびたとえば多くのソフトウェアツールの直接制作が含まれます。 RSEは、ボランティアではありませんが、これらのボランティア参加者に依存しています。 また、コミュニティの精神は、これらのボランティアに重点を置いており、これらのボランティアから引き出されています。 そのため、RSEはボランティア参加の活力と有効性をサポートする必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1.2.1.2. Policy Authority",
      "section_title": true,
      "ja": "2.1.2.1.2. 政策当局"
    },
    {
      "indent": 3,
      "text": "All decisions are to be made in the overall interest of the broader Internet community. The RSE is responsible for identifying materially concerned interest groups within the Internet community and reaching out to them. Those interest groups include at least the IETF community, the IRTF community, the network research community, and the network operations community. Other interest groups might also be materially interested.",
      "ja": "すべての決定は、より広範なインターネットコミュニティの全体的な利益のために行われます。 RSEは、インターネットコミュニティ内の重要な関心のある利益団体を特定し、それらに手を差し伸べる責任があります。 これらの関心グループには、少なくともIETFコミュニティ、IRTFコミュニティ、ネットワーク研究コミュニティ、およびネットワーク運用コミュニティが含まれます。 他の関心グループも実質的に関心があるかもしれません。"
    },
    {
      "indent": 3,
      "text": "The RSE must consult with the community on policy issues. The RSE works with the community to achieve policy that meets the overall quality, continuity, and evolution goals the RSE is charged with meeting. As described in Section 3.1, the RSE reports the results of such interactions to the RSOC, including a description of the outreach efforts and the specific recommendations on policy. This enables the RSOC to provide the oversight the IAB is required to apply, as well as to confirm that the Internet community has been properly consulted and considered in making policy.",
      "ja": "RSEは、ポリシーの問題についてコミュニティと相談する必要があります。 RSEはコミュニティと協力して、RSEが会議で担当する全体的な品質、継続性、および進化の目標を満たすポリシーを達成します。 セクション3.1で説明したように、RSEは、アウトリーチの取り組みの説明やポリシーに関する具体的な推奨事項など、そのようなやり取りの結果をRSOCに報告します。 これにより、RSOCはIABが適用する必要がある監視を提供し、ポリシーを作成する際にインターネットコミュニティが適切に相談および検討されたことを確認できます。"
    },
    {
      "indent": 0,
      "text": "2.1.2.2. External Representation",
      "section_title": true,
      "ja": "2.1.2.2. 外部表現"
    },
    {
      "indent": 3,
      "text": "From time to time, individuals or organizations external to the IETF need a contact person to talk to about the RFC Series. The RSE, or the RSE's designate, serves this role.",
      "ja": "IETFの外部の個人または組織には、RFCシリーズについて話すための連絡先が必要になる場合があります。 RSEまたはRSEの指定がこの役割を果たします。"
    },
    {
      "indent": 3,
      "text": "Over time, the RSE should determine what, if any, means should be employed to increase end-user awareness of the series, to reinforce the stature of the series, and to provide the contact point for outside parties seeking information on the series or the Editor.",
      "ja": "時間が経つにつれて、RSEは、シリーズのエンドユーザーの認知度を高め、シリーズの身長を強化し、シリーズまたは 編集者。"
    },
    {
      "indent": 0,
      "text": "2.1.3. Development of RFC Production and Publication",
      "section_title": true,
      "ja": "2.1.3. RFCの作成と公開の開発"
    },
    {
      "indent": 3,
      "text": "Closely related to providing strategic leadership and management to the RFC Production Center and Publisher functions is the need to develop and improve those functions. The RSE is responsible for ensuring that such ongoing development takes place.",
      "ja": "RFC Production CenterおよびPublisherの機能に戦略的リーダーシップと管理を提供することに密接に関連しているのは、それらの機能を開発および改善する必要性です。 RSEは、そのような継続的な開発が行われるようにする責任があります。"
    },
    {
      "indent": 3,
      "text": "This effort must include the dimensions of document quality, timeliness of production, and accessibility of results. It must also specifically take into account issues raised by the IETF community, including all the streams feeding into the RFC Editor function.",
      "ja": "この取り組みには、ドキュメントの品質、制作の適時性、結果のアクセシビリティの次元を含める必要があります。 また、RFC Editor機能にフィードするすべてのストリームを含め、IETFコミュニティによって提起された問題を明確に考慮する必要があります。"
    },
    {
      "indent": 0,
      "text": "2.1.4. Development of the RFC Series",
      "section_title": true,
      "ja": "2.1.4. RFCシリーズの開発"
    },
    {
      "indent": 3,
      "text": "In order to develop the RFC Series, the RSE is expected to develop a relationship with the Internet technical community. The Editor is expected to engage with the Internet technical community in a process of articulating and refining a vision for the series and its continuous evolution. The RSE is also expected to engage other users of the RFC Series, in particular, the consumers of these documents, such as those people who use them to specify products, write code, test behaviors, or other related activities.",
      "ja": "RFCシリーズを開発するために、RSEはインターネット技術コミュニティとの関係を発展させることが期待されています。 編集者は、インターネット技術コミュニティと協力して、シリーズとその継続的な進化のビジョンを明確にし、洗練するプロセスに取り組むことが期待されています。 また、RSEは、RFCシリーズの他のユーザー、特に製品の指定、コードの記述、動作のテスト、またはその他の関連するアクティビティに使用するユーザーなど、これらのドキュメントの消費者に関与することが期待されています。"
    },
    {
      "indent": 3,
      "text": "Concretely:",
      "ja": "具体的に："
    },
    {
      "indent": 6,
      "text": "The RSE is responsible for the coordination of discussion on series evolution among the series' stream participants and the broader Internet technical community.",
      "ja": "RSEは、シリーズのストリーム参加者とより広範なインターネット技術コミュニティの間で、シリーズの進化に関する議論の調整を担当します。"
    },
    {
      "indent": 6,
      "text": "In time, the RSE is expected to develop and refine a vision for the RFC Series, including examining:",
      "ja": "やがて、RSEは、RFCシリーズのビジョンを開発および改良することが期待されます。"
    },
    {
      "indent": 6,
      "text": "- The RFC Series, as it continues to evolve. The RSE is expected to take a broad view and look for the best ways to evolve the series for the benefit of the entire Internet community. As such, the RSE may even consider evolution beyond the historical 'by engineers for engineers' emphasis; and",
      "ja": "- RFCシリーズは、進化を続けています。 RSEは、広い視野を持ち、インターネットコミュニティ全体の利益のためにシリーズを進化させるための最良の方法を探すことが期待されています。 そのため、RSEは、歴史的な「エンジニアのためのエンジニア」による強調を超えた進化を検討することさえあります。 そして"
    },
    {
      "indent": 6,
      "text": "- Its publication-technical environment, by looking at whether it should be slowly changing in terms of publishing and archiving techniques -- particularly to better serve the communities that produce and depend on the RFC Series. For example, all of those communities have been slowly changing to include a significant population of multi-lingual individuals or non-native speakers of English. Another example is that some of these constituencies also have shifted to include significant groups whose primary focus is on the constraints and consequences of network engineering, rather than a primary interest in the engineering issues themselves.",
      "ja": "- 特に、RFCシリーズを作成して依存しているコミュニティにより良いサービスを提供するために、出版技術とアーカイブ技術の観点からゆっくりと変化すべきかどうかを検討することによる、出版技術環境。 たとえば、これらのコミュニティはすべて、多言語の個人や英語を母国語としない人のかなりの人口を含むように徐々に変化しています。 別の例として、これらの選挙区の一部は、エンジニアリングの問題自体への主な関心ではなく、ネットワークエンジニアリングの制約と結果に主な焦点を当てる重要なグループを含むようにシフトしました。"
    },
    {
      "indent": 3,
      "text": "For this type of responsibility, the RSE cooperates closely with the community, and operates under oversight of the RSOC: thus, ultimately, under oversight of the IAB.",
      "ja": "この種の責任について、RSEはコミュニティと緊密に協力し、RSOCの監視下で動作します。したがって、最終的にはIABの監視下で動作します。"
    },
    {
      "indent": 0,
      "text": "2.1.5. Workload",
      "section_title": true,
      "ja": "2.1.5. 仕事量"
    },
    {
      "indent": 3,
      "text": "On average, the job is expected to take half of a full-time equivalent position (FTE, thus approximately 20 hrs per week), with the workload per week nearing full time during IETF weeks. In addition, the job is expected to take more than 20 hours per week in the first few months of the engagement and when involved in special projects.",
      "ja": "平均すると、ジョブはフルタイムの同等の職位の半分（FTE、つまり週に約20時間）を占めると予想され、週あたりのワークロードはIETF週のフルタイムに近くなります。 また、仕事は、エンゲージメントの最初の数か月間、および特別なプロジェクトに関与している場合、週に20時間以上かかることが予想されます。"
    },
    {
      "indent": 0,
      "text": "2.1.6. Qualifications",
      "section_title": true,
      "ja": "2.1.6. 資格"
    },
    {
      "indent": 3,
      "text": "The RFC Series Editor is a senior technology professional. The following qualifications are desired:",
      "ja": "RFCシリーズエディターはシニアテクノロジーの専門家です。 次の資格が必要です。"
    },
    {
      "indent": 3,
      "text": "1. Strategic leadership and management experience fulfilling the requirements outlined in this document, the many aspects of this role, and the coordination of the overall RFC Editor process.",
      "ja": "1. このドキュメントで概説されている要件、この役割の多くの側面、およびRFCエディタープロセス全体の調整を遂行する戦略的リーダーシップと管理経験。"
    },
    {
      "indent": 3,
      "text": "2. Good understanding of the English language and technical terminology related to the Internet.",
      "ja": "2. インターネットに関する英語と専門用語の十分な理解。"
    },
    {
      "indent": 3,
      "text": "3. Good communication skills.",
      "ja": "3. よいコミュニケーション力。"
    },
    {
      "indent": 3,
      "text": "4. Experience with editorial processes.",
      "ja": "4. 編集プロセスの経験。"
    },
    {
      "indent": 3,
      "text": "5. Ability to develop strong understanding of the IETF and RFC process.",
      "ja": "5. IETFおよびRFCプロセスの強力な理解を深める能力。"
    },
    {
      "indent": 3,
      "text": "6. Independent worker.",
      "ja": "6. 独立した労働者。"
    },
    {
      "indent": 3,
      "text": "7. Willingness to, and availability for, travel.",
      "ja": "7. 旅行への意欲と空室状況。"
    },
    {
      "indent": 3,
      "text": "8. The ability to work effectively in a multi-actor and matrixed environment with divided authority and responsibility similar to that described in this document.",
      "ja": "8. このドキュメントで説明されているものと同様の権限と責任が分割された、マルチアクターおよびマトリックス環境で効果的に機能する能力。"
    },
    {
      "indent": 3,
      "text": "9. Experience with and ability to participate in, and manage, activities by email and teleconferences, not just face-to-face interactions.",
      "ja": "9. 直接対面する対話だけでなく、電子メールや電話会議によるアクティビティの経験と参加能力、および管理能力。"
    },
    {
      "indent": 3,
      "text": "10. Demonstrated experience in strategic planning and the management of entire operations.",
      "ja": "10. 戦略的計画および運用全体の管理における実証済みの経験。"
    },
    {
      "indent": 3,
      "text": "11. Experience as an RFC author.",
      "ja": "11. RFC作成者としての経験。"
    },
    {
      "indent": 0,
      "text": "2.1.7. Conflict of Interest",
      "section_title": true,
      "ja": "2.1.7. 利益相反"
    },
    {
      "indent": 3,
      "text": "The RSE is expected to avoid even the appearance of conflict of interest or judgment in performing these roles. To ensure this, the RSE will be subject to a conflict of interest policy established by the IETF LLC.",
      "ja": "RSEは、これらの役割を実行する際に利益相反または判断の出現さえ回避することが期待されています。 これを確実にするために、RSEはIETF LLCによって確立された利益相反ポリシーの対象となります。"
    },
    {
      "indent": 0,
      "text": "2.2. RFC Production Center",
      "section_title": true,
      "ja": "2.2. RFCプロダクションセンター"
    },
    {
      "indent": 3,
      "text": "The RFC Production Center function is performed by a paid contractor, and the contractor's responsibilities include the following:",
      "ja": "RFC Production Center機能は有料の請負業者によって実行され、請負業者の責任には以下が含まれます。"
    },
    {
      "indent": 3,
      "text": "1. Editing inputs from all RFC streams to comply with the RFC Style Manual, under the direction of the RSE;",
      "ja": "1. すべてのRFCストリームからの入力を編集して、RSEの指示の下でRFCスタイルマニュアルに準拠します。"
    },
    {
      "indent": 3,
      "text": "2. Creating records of edits performed on documents;",
      "ja": "2. ドキュメントで実行された編集の記録を作成します。"
    },
    {
      "indent": 3,
      "text": "3. Identifying where editorial changes might have technical impact and seeking necessary clarification;",
      "ja": "3. 編集上の変更が技術的な影響を与える可能性がある場所を特定し、必要な説明を求めます。"
    },
    {
      "indent": 3,
      "text": "4. Engaging in dialog with authors, document shepherds, IANA, and/ or stream-dependent contacts when clarification is needed;",
      "ja": "4. 明確化が必要な場合、著者、ドキュメントシェパード、IANA、ストリーム依存の連絡先と対話する。"
    },
    {
      "indent": 3,
      "text": "5. Creating records of dialog with document authors;",
      "ja": "5. ドキュメント作成者との対話の記録を作成します。"
    },
    {
      "indent": 3,
      "text": "6. Requesting advice from the RFC Series Editor as needed;",
      "ja": "6. 必要に応じてRFCシリーズエディターからアドバイスを要求します。"
    },
    {
      "indent": 3,
      "text": "7. Providing suggestions to the RFC Series Editor as needed;",
      "ja": "7. 必要に応じてRFCシリーズエディターに提案を提供します。"
    },
    {
      "indent": 3,
      "text": "8. Providing sufficient resources to support reviews of RFC Publisher performance by the RFC Series Editor and external reviews of the RFC Editor function initiated by the IAB or IETF LLC;",
      "ja": "8. RFCシリーズエディターによるRFCパブリッシャーのパフォーマンスのレビューと、IABまたはIETF LLCによって開始されたRFCエディター機能の外部レビューをサポートするのに十分なリソースを提供します。"
    },
    {
      "indent": 3,
      "text": "9. Coordinating with IANA to ensure correct documentation of IANA-performed protocol registry actions;",
      "ja": "9. IANAと連携して、IANAが実施したプロトコルレジストリアクションの正しいドキュメントを保証します。"
    },
    {
      "indent": 3,
      "text": "10. Assigning RFC numbers;",
      "ja": "10. RFC番号の割り当て。"
    },
    {
      "indent": 3,
      "text": "11. Establishing publication readiness of each document through communication with the authors, document shepherds, IANA, and/or stream-dependent contacts, and, if needed, with the RFC Series Editor;",
      "ja": "11. 作成者、ドキュメントシェパード、IANA、ストリーム依存の連絡先、および必要に応じてRFCシリーズエディターとの通信を通じて、各ドキュメントの公開準備を確立します。"
    },
    {
      "indent": 3,
      "text": "12. Forwarding documents that are ready for publication to the RFC Publisher;",
      "ja": "12. RFC Publisherへの公開準備が整ったドキュメントの転送。"
    },
    {
      "indent": 3,
      "text": "13. Forwarding records of edits and author dialog to the RFC Publisher so these can be preserved;",
      "ja": "13. 編集および作成者のダイアログの記録をRFCパブリッシャーに転送して、これらを保存できるようにします。"
    },
    {
      "indent": 3,
      "text": "14. Liaising with the streams as needed.",
      "ja": "14. 必要に応じてストリームと連携します。"
    },
    {
      "indent": 3,
      "text": "All these activities will be done under the general direction, but not day-to-day management, of the RSE and need some level of coordination with various submission streams and the RSE.",
      "ja": "これらのすべての活動は、RSEの日常的な管理ではなく一般的な指示の下で行われ、さまざまな提出ストリームおよびRSEとのある程度の調整が必要です。"
    },
    {
      "indent": 3,
      "text": "The RFC Production Center contractor is to be selected through an IETF LLC Request for Proposal (RFP) process as described in Section 4.1.",
      "ja": "RFC Production Centerの請負業者は、セクション4.1で説明されているIETF LLC提案要求（RFP）プロセスを通じて選択されます。"
    },
    {
      "indent": 0,
      "text": "2.3. RFC Publisher",
      "section_title": true,
      "ja": "2.3. RFCパブリッシャー"
    },
    {
      "indent": 3,
      "text": "The RFC Publisher responsibilities include the following:",
      "ja": "RFCパブリッシャーの責任には以下が含まれます。"
    },
    {
      "indent": 3,
      "text": "1. Announcing and providing on-line access to RFCs.",
      "ja": "1. RFCへのオンラインアクセスの発表と提供。"
    },
    {
      "indent": 3,
      "text": "2. Providing an on-line system to submit RFC Errata.",
      "ja": "2. RFCエラータを送信するためのオンラインシステムの提供。"
    },
    {
      "indent": 3,
      "text": "3. Providing on-line access to approved RFC Errata.",
      "ja": "3. 承認されたRFCエラッタへのオンラインアクセスを提供します。"
    },
    {
      "indent": 3,
      "text": "4. Providing backups.",
      "ja": "4. バックアップを提供します。"
    },
    {
      "indent": 3,
      "text": "5. Providing storage and preservation of records.",
      "ja": "5. 記録の保存と保存を提供します。"
    },
    {
      "indent": 3,
      "text": "6. Authenticating RFCs for legal proceedings.",
      "ja": "6. 法的手続きのためのRFCの認証。"
    },
    {
      "indent": 3,
      "text": "All these activities will be done under the general direction, but not day-to-day management, of the RSE and need some level of coordination with various submission streams and the RSE.",
      "ja": "これらのすべての活動は、RSEの日常的な管理ではなく一般的な指示の下で行われ、さまざまな提出ストリームおよびRSEとのある程度の調整が必要です。"
    },
    {
      "indent": 3,
      "text": "The RFC Publisher contractor is to be selected through an IETF LLC RFP process as described in Section 4.1.",
      "ja": "RFC Publisherの請負業者は、セクション4.1で説明されているIETF LLC RFPプロセスを通じて選択されます。"
    },
    {
      "indent": 0,
      "text": "3. Committees",
      "section_title": true,
      "ja": "3. 委員会"
    },
    {
      "indent": 0,
      "text": "3.1. RFC Series Oversight Committee (RSOC)",
      "section_title": true,
      "ja": "3.1. RFCシリーズ監視委員会（RSOC）"
    },
    {
      "indent": 3,
      "text": "The IAB is responsible for the oversight of the RFC Series and acts as a body for final conflict resolution, including the process described in Section 4.3.",
      "ja": "IABは、RFCシリーズの監視を担当し、セクション4.3で説明されているプロセスを含む、最終的な競合解決の機関として機能します。"
    },
    {
      "indent": 3,
      "text": "In order to provide continuity over periods longer than the NomCom appointment cycle [RFC8713] and assure that oversight includes suitable subject matter expertise, the IAB will establish a group that implements oversight for the IAB, the RFC Series Oversight Committee (RSOC).",
      "ja": "NomComのアポイントメントサイクル[RFC8713]よりも長い期間にわたって継続性を提供し、監視に適切な主題の専門知識が含まれることを保証するために、IABはIABの監視を実装するグループ、RFCシリーズ監視委員会（RSOC）を設立します。"
    },
    {
      "indent": 3,
      "text": "The RSOC will act with authority delegated from the IAB: in general, it will be the RSOC that will approve consensus policy and vision documents as developed by the RSE in collaboration with the community. While it is expected that the IAB will exercise due diligence in its supervision of the RSOC, the RSOC should be allowed the latitude to do its job without undue interference from the IAB. Therefore, it is expected that the IAB will accord RSOC reports and recommendations the benefit of the doubt.",
      "ja": "RSOCはIABから委任された権限で行動します。一般に、コミュニティと協力してRSEによって開発されたコンセンサスポリシーとビジョンドキュメントを承認するのはRSOCです。 IABがRSOCの監督においてデューデリジェンスを実施することが期待されますが、RSOCはIABからの過度の干渉なしに業務を行うことができます。 したがって、IABはRSOCの報告書に同意し、疑いの利益を提言することが期待されます。"
    },
    {
      "indent": 3,
      "text": "For all decisions that affect the RSE individually (e.g., hiring and firing), the RSOC prepares recommendations for the IAB. The final recommendation to the IETF LLC is the responsibility of the IAB, after discussion with RSOC on the recommendations. For instance the RSOC would do the following:",
      "ja": "RSEに個別に影響するすべての決定（雇用や解雇など）について、RSOCはIABの推奨事項を準備します。 IETF LLCへの最後の推奨事項は、推奨事項についてRSOCと議論した後、IABの責任です。 たとえば、RSOCは次のことを行います。"
    },
    {
      "indent": 3,
      "text": "* perform annual reviews of the RSE and report the result of these reviews to the IAB.",
      "ja": "* RSEの年次レビューを実施し、これらのレビューの結果をIABに報告します。"
    },
    {
      "indent": 3,
      "text": "* manage RSE candidate selection and advise the IAB on candidate appointment (in other words, select the RSE subject to IAB approval).",
      "ja": "* RSE候補者の選択を管理し、候補者の任命についてIABに助言します（言い換えると、IABの承認を受けるRSEを選択します）"
    },
    {
      "indent": 3,
      "text": "RSOC members are expected to recognize potential conflicts of interest and behave accordingly.",
      "ja": "RSOCメンバーは、潜在的な利益相反を認識し、それに応じて行動することが期待されています。"
    },
    {
      "indent": 3,
      "text": "For the actual recruitment and selection of the RSE, the RSOC will propose a budget for the search process. It will work with the IETF LLC to refine that budget and develop remuneration criteria and an employment agreement or contracting plans, as appropriate.",
      "ja": "RSEの実際の採用と選択のために、RSOCは検索プロセスの予算を提案します。 IETF LLCと連携して、予算を調整し、必要に応じて報酬基準と雇用契約または契約計画を策定します。"
    },
    {
      "indent": 3,
      "text": "The RSOC will be responsible for ensuring that the RFC Series is run in a transparent and accountable manner.",
      "ja": "RSOCは、RFCシリーズが透過的で説明可能な方法で実行されるようにする責任があります。"
    },
    {
      "indent": 3,
      "text": "The RSOC shall develop and publish its own rules of order.",
      "ja": "RSOCは、独自の順序規則を開発および公開するものとします。"
    },
    {
      "indent": 3,
      "text": "The initial RSOC was charged with designing and executing a solicitation, search, and selection process for the first actual (not transitional or \"acting\") RSE appointment. That process involved iteration on this and related documents and evaluation of various strategies and options. During the creation of what became [RFC6635], it was expected that the RSOC would describe the process it ultimately selected to the community. The RSOC did involve the community in interim considerations when that was likely to be of value. Following completion of the selection process, the RSOC will determine the best way to share information learned and experience gained with the community and determine how to best preserve that information for future use.",
      "ja": "最初のRSOCは、最初の実際の（過渡的または「実行中」ではない）RSEアポイントメントの勧誘、検索、および選択プロセスの設計と実行を担当しました。 そのプロセスには、この文書と関連文書の反復、およびさまざまな戦略とオプションの評価が含まれていました。 [RFC6635]になったものの作成中に、RSOCは最終的にコミュニティに選択したプロセスを記述することが期待されていました。 RSOCは、価値があると思われる場合に、暫定的な考慮事項にコミュニティを関与させました。 選択プロセスの完了後、RSOCは、学習した情報や経験をコミュニティと共有する最適な方法を決定し、その情報を将来の使用のために最適に保存する方法を決定します。"
    },
    {
      "indent": 0,
      "text": "3.1.1. RSOC Composition",
      "section_title": true,
      "ja": "3.1.1. RSOCの構成"
    },
    {
      "indent": 3,
      "text": "The RSOC will operate under the authority of the IAB, with the IAB retaining final responsibility. The IAB will delegate authority and responsibility to the RSOC as appropriate and as RSOC and RSE relationships evolve. The RSOC will include people who are not current IAB members. Currently, this is aligned with the IAB program structure. The IAB will designate the membership of the RSOC with the following goals: preserving effective stability; keeping it small enough to be effective, and keeping it large enough to provide general Internet community expertise, specific IETF expertise, publication expertise, and stream expertise. Members serve at the pleasure of the IAB and are expected to bring a balance between short- and long-term perspectives. Specific input about, and recommendations of, members will be sought from the streams, the IETF LLC, and the RSE.",
      "ja": "RSOCはIABの権限の下で運営され、IABは最終的な責任を保持します。 IABは、必要に応じて、RSOCとRSEの関係が発展するにつれて、権限と責任をRSOCに委任します。 RSOCには、現在のIABメンバーではない人々が含まれます。 現在、これはIABプログラム構造と整合しています。 IABは、RSOCのメンバーシップを次の目標で指定します。効果的な安定性を維持します。 効果的になるように十分小さくし、一般的なインターネットコミュニティの専門知識、特定のIETFの専門知識、出版の専門知識、およびストリームの専門知識を提供するのに十分な大きさにします。 メンバーはIABの喜びに応え、短期的視点と長期的視点のバランスをとることが期待されています。 ストリーム、IETF LLC、およびRSEからメンバーに関する特定の入力および推奨事項が求められます。"
    },
    {
      "indent": 3,
      "text": "In addition to the members from outside of the IAB appointed to the RSOC, IAB members may participate as full members of the RSOC. Under most circumstances, there will be a specific individual IAB member appointed by the IAB as the program lead, who will be a full member of the RSOC. This member's role is distinct from any RSOC-internal organizational roles, such as would be created by the RSOC choosing to appoint a chair from among its members. Other IAB members may choose to be full members of the RSOC, with the consent of the IAB. This consent is primarily concerned with avoiding overpopulating the RSOC and providing it with relatively stable membership, which will work best if it is not too large a committee.",
      "ja": "RSOCに任命されたIAB外のメンバーに加えて、IABメンバーはRSOCの正会員として参加することができます。 ほとんどの場合、プログラムリーダーとしてIABによって任命された特定の個々のIABメンバーが存在し、RSAの完全なメンバーになります。 このメンバーの役割は、RSOCがメンバーの中から議長を任命することを選択することにより作成されるRSOC内部組織の役割とは異なります。 他のIABメンバーは、IABの同意を得て、RSOCの完全なメンバーになることを選択できます。 この同意は、主にRSOCの過密を回避し、比較的安定したメンバーシップを提供することに関するもので、委員会が大きすぎない場合に最適に機能します。"
    },
    {
      "indent": 3,
      "text": "The IETF LLC will appoint an individual to serve as its liaison to the RSOC. The RSE and the IETF LLC Liaison will serve as non-voting ex officio members of the RSOC. Either or both can be excluded from its discussions if necessary.",
      "ja": "IETF LLCは、RSOCへの連絡役となる個人を任命します。 RSEとIETF LLCリエゾンは、RSOCの職権上の議決権のないメンバーとして機能します。 必要に応じて、どちらかまたは両方を議論から除外できます。"
    },
    {
      "indent": 0,
      "text": "4. Administrative Implementation",
      "section_title": true,
      "ja": "4. 管理実装"
    },
    {
      "indent": 3,
      "text": "The exact implementation of the administrative and contractual activities described here are a responsibility of the IETF Administration Limited Liability Company [RFC8711] in cooperation with the RFC Series Editor. The authority structure is described in Figure 2.",
      "ja": "ここで説明されている管理および契約上の活動の正確な実装は、RFC Series Editorと協力してIETF Administration Limited Liability Company [RFC8711]の責任です。 権限構造については、図2で説明しています。"
    },
    {
      "indent": 15,
      "text": "    +----------------+       +----------------+\n    |                |       |                |\n    |      IAB       |       |    IETF LLC    |\n    |                |       |                |\n    +==========+-----+       +-+--------------+\n    |          |               .\n    |   RSOC   |               .\n    |          |               .\n    +----+-----+               .\n         |                     .\n         |                     .\n         |   ...................\n         |   .                 .\n+--------V---V----+            .\n|                 |            .\n|       RFC       |            .\n|      Series     |            .\n|      Editor     |            .\n|                 |            .\n+--------+--------+            .\n         |                     .\n         |        .................\n         |        .               .\n         +--+----------------+    .\n            |     .          |    .\n            |     .          |    .\n        +---V-----V--+    +--V----V---+\n        |    RFC     |    |    RFC    |\n        | Production |    | Publisher |\n        |   Center   |    |           |\n        +------------+    +-----------+",
      "raw": true
    },
    {
      "indent": 25,
      "text": "Legend:",
      "ja": "伝説："
    },
    {
      "indent": 25,
      "text": "-------    IAB RFC Series Oversight\n.......    IETF LLC Contract/Budget Oversight",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Figure 2: Authority Structure of the RFC Series",
      "ja": "図2：RFCシリーズの権限構造"
    },
    {
      "indent": 0,
      "text": "4.1. Vendor Selection for the Production and Publisher Functions",
      "section_title": true,
      "ja": "4.1. プロダクションおよびパブリッシャー機能のベンダー選択"
    },
    {
      "indent": 3,
      "text": "As stated earlier, vendor selection is done in cooperation with the streams and under the final authority of the IETF LLC.",
      "ja": "前述したように、ベンダーの選択はストリームと協力して、IETF LLCの最終権限の下で行われます。"
    },
    {
      "indent": 3,
      "text": "The RSE owns and develops the work definition (the SOW) and participates in the IETF LLC vendor selection process. The work definition is created within the IETF LLC budget and takes into account the stream managers and community input.",
      "ja": "RSEは、作業定義（SOW）を所有および開発し、IETF LLCベンダー選択プロセスに参加します。 作業定義はIETF LLC予算内で作成され、ストリームマネージャーとコミュニティの入力を考慮に入れます。"
    },
    {
      "indent": 3,
      "text": "The process to select and contract for an RFC Production Center, RFC Publisher, and other RFC-related services, is as follows:",
      "ja": "RFC Production Center、RFC Publisher、およびその他のRFC関連サービスを選択して契約するプロセスは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "* The IETF LLC establishes the contract process, including the steps necessary to issue an RFP when necessary, the timing, and the contracting procedures.",
      "ja": "* IETF LLCは、必要に応じてRFPを発行するために必要な手順、タイミング、および契約手順を含む契約プロセスを確立します。"
    },
    {
      "indent": 3,
      "text": "* The IETF LLC establishes the Selection Committee, which will consist of the RSE, the IETF LLC Executive Director, and other members selected by the RSOC and the IETF LLC. The Committee shall be chaired by the RSE.",
      "ja": "* IETF LLCは、RSEC、IETF LLC Executive Director、およびRSOCとIETF LLCによって選択された他のメンバーで構成される選択委員会を設置します。 委員会はRSEが議長を務めます。"
    },
    {
      "indent": 3,
      "text": "* The Selection Committee selects the vendor, subject to the successful negotiation of a contract approved by the IETF LLC. In the event that a contract cannot be reached, the matter shall be referred to the Selection Committee for further action.",
      "ja": "* IETF LLCによって承認された契約の交渉が成功することを条件に、選択委員会がベンダーを選択します。 契約に到達できない場合、問題は選択委員会に付託され、さらなる措置が取られます。"
    },
    {
      "indent": 3,
      "text": "* The Selection Committee may select an RFC Publisher either through the IETF LLC RFP process or, at the Committee's option, the Committee may select the IETF Secretariat to provide RFC Publisher services, subject to negotiations in accordance with the IETF LLC procedures.",
      "ja": "* 選択委員会は、IETF LLC RFPプロセスを介してRFCパブリッシャーを選択するか、委員会のオプションで、委員会がIETF LLC手順に従って交渉して、RFCパブリッシャーサービスを提供するIETF事務局を選択できます。"
    },
    {
      "indent": 0,
      "text": "4.2. Budget",
      "section_title": true,
      "ja": "4.2. 予算"
    },
    {
      "indent": 3,
      "text": "The expenses discussed in this document are not new expenses. They have been and remain part of the IETF Administration Limited Liability Company [RFC8711] budget.",
      "ja": "このドキュメントで説明する費用は、新しい費用ではありません。 それらは、IETF Administration Limited Liability Company [RFC8711]予算の一部であり、その一部です。"
    },
    {
      "indent": 3,
      "text": "The RFC Series portion of the IETF LLC budget shall include funding to support the RSE, RFC Production Center, RFC Publisher, and the Independent Stream.",
      "ja": "IETF LLC予算のRFCシリーズ部分には、RSE、RFC Production Center、RFC Publisher、およびIndependent Streamをサポートするための資金が含まれます。"
    },
    {
      "indent": 3,
      "text": "The IETF LLC has the responsibility to approve the total RFC Editor budget (and the authority to deny it). The RSE must work within the IETF LLC budgetary process.",
      "ja": "IETF LLCには、RFC Editorの総予算（およびそれを拒否する権限）を承認する責任があります。 RSEは、IETF LLCの予算プロセス内で機能する必要があります。"
    },
    {
      "indent": 3,
      "text": "The RSE is responsible for managing the RFC Editor function to operate within those budgets. If production needs change, the RSE is responsible for working with the Production Center, and where appropriate, other RFC Editor component institutions, relevant streams, and/or the RSOC to determine what the correct response should be. If they agree that a budgetary change is needed, that decision needs to be taken to the IETF LLC.",
      "ja": "RSEは、これらの予算内で動作するようにRFCエディター機能を管理する責任があります。 プロダクションのニーズが変化した場合、RSEはプロダクションセンター、および必要に応じて他のRFC Editorコンポーネント機関、関連ストリーム、および/またはRSOCと連携して、正しい応答を決定する責任があります。 予算の変更が必要であることに同意する場合、その決定はIETF LLCに下す必要があります。"
    },
    {
      "indent": 0,
      "text": "4.3. Disagreements among Entities Related to the RFC Editor",
      "section_title": true,
      "ja": "4.3. RFCエディターに関連するエンティティ間の不一致"
    },
    {
      "indent": 3,
      "text": "The RFC Series Editor and the RFC Production Center and Publisher facilities work with the various streams to produce RFCs. Disagreements may arise between these entities during the execution of the RFC Editor operations. In particular, different streams may disagree with each other, or disagree with the RFC Editor function. Potentially, even the RSOC or the IETF LLC could find themselves in disagreement with some aspect of the RFC Editor operations. Note that disagreements between an author and the RFC Production Center are not cross-entity issues, and they are to be resolved by the RSE, in accordance with the rest of this document.",
      "ja": "RFC Series EditorとRFC Production CenterおよびPublisherの機能は、さまざまなストリームと連携してRFCを生成します。 RFC Editor操作の実行中に、これらのエンティティ間に不一致が生じる場合があります。 特に、異なるストリームは互いに一致しないか、RFCエディタ機能に一致しない場合があります。 潜在的に、RSOCまたはIETF LLCでさえ、RFC Editorの操作のいくつかの側面に不一致に陥ることがあります。 著者とRFC Production Centerとの間の不一致は、エンティティ間の問題ではなく、このドキュメントの残りの部分に従ってRSEによって解決されることに注意してください。"
    },
    {
      "indent": 3,
      "text": "If such cross-entity disagreements arise, the community would generally hope that they can be resolved politely and directly. However, this is not always possible. At that point, any relevant party would first formally request a review and reconsideration of the decision. If the party still disagrees after the reconsideration, that party may ask the RSE to decide or, especially if the RSE is involved, the party may ask the IAB Chair (for a technical or procedural matter) to mediate or appoint a mediator to aid in the discussions, although he or she not is obligated to do so. All parties should work informally and in good faith to reach a mutually agreeable conclusion. As noted below, any such issues that involve contractual matters must be brought to the attention of the IETF LLC. If the IAB Chair is asked to assist in resolving the matter, the Chair may ask for advice or seek assistance from anyone the Chair deems helpful. The Chair may also alert any appropriate individuals or organizations to the existence of the issue.",
      "ja": "このようなエンティティ間の不一致が生じた場合、コミュニティは一般に、それらが丁寧かつ直接的に解決できることを望んでいます。ただし、これは常に可能とは限りません。その時点で、関係者は最初に正式に決定の再検討と再検討を要求します。再検討後も当事者が同意しない場合、その当事者はRSEに決定を求めることができ、特にRSEが関与する場合は、IAB議長に（技術的または手続き的な問題について）調停者を仲介または任命するよう依頼することができます彼または彼女はそうする義務はありませんが、議論。すべての関係者は、相互に同意できる結論に達するために、非公式かつ誠実に作業する必要があります。以下に示すように、契約上の問題を伴うこのような問題は、IETF LLCに通知する必要があります。 IAB議長が問題の解決を支援するように求められた場合、議長は助言を求めるか、議長が役に立つと考える人に支援を求めることができます。議長は、問題の存在を適切な個人または組織に警告することもできます。"
    },
    {
      "indent": 3,
      "text": "If such a conclusion is not possible through the above less formal processes, then the matter must be registered with the RFC Series Oversight Committee. The RSOC may choose to offer advice to the RSE or more general advice to the parties involved and may ask the RSE to defer a decision until it formulates its advice. However, if a timely decision cannot be reached through discussion, mediation, and mutual agreement, the RSE is expected to make whatever decisions are needed to ensure the smooth operation of the RFC Editor function; those decisions are final.",
      "ja": "上記のあまり形式的なプロセスではそのような結論が不可能な場合、RFCシリーズ監視委員会に問題を登録する必要があります。 RSOCは、RSEへのアドバイスまたは関係者へのより一般的なアドバイスを提供することを選択でき、そのアドバイスを策定するまでRSEに決定を延期するように依頼できます。 ただし、議論、調停、および相互の合意によってタイムリーな決定に到達できない場合、RSEは、RFCエディター機能の円滑な運用を確保するために必要な決定を行うことが期待されます。 これらの決定は最終的なものです。"
    },
    {
      "indent": 3,
      "text": "The RSE may make final decisions unilaterally only to assure the functioning of the process, and only while there is an evaluation of current policies to determine whether they are appropriately implemented in the decision or need adjustment. In particular, it should be noted that final decisions about the technical content of individual documents are the exclusive responsibility of the stream approvers from which those documents originate, as shown in the illustration in Figure 1.",
      "ja": "RSEは、プロセスの機能を保証するためにのみ、また決定に適切に実装されているか、調整が必要かどうかを判断する現在のポリシーが評価されている間のみ、最終決定を一方的に行うことができます。 特に、図1の図に示すように、個々のドキュメントの技術内容に関する最終決定は、それらのドキュメントの作成元であるストリーム承認者の排他的な責任であることに注意する必要があります。"
    },
    {
      "indent": 3,
      "text": "If informal agreements cannot be reached, then formal RSOC review and decision making may be required. If so, the RSE must present the issues involved to the community so that the community is aware of the situation. The RSE will then report the issue to the RSOC for formal resolution by the RSOC with confirmation by the IAB in its oversight capacity.",
      "ja": "非公式の合意に達することができない場合、RSOCの正式なレビューと意思決定が必要になる場合があります。 その場合、RSEは、コミュニティが関係する問題を提示して、コミュニティが状況を認識できるようにする必要があります。 その後、RSEは、RSOCによる正式な解決のために、RSOCに問題を報告し、IABの監督能力を確認します。"
    },
    {
      "indent": 3,
      "text": "IAB and community discussion of any patterns of disputes are expected to inform future changes to RFC Series policies, including possible updates to this document.",
      "ja": "紛争のパターンのIABとコミュニティの議論は、RFCシリーズポリシーの将来の変更（このドキュメントの可能な更新を含む）を通知することが期待されています。"
    },
    {
      "indent": 0,
      "text": "4.4. Issues with Contractual Impact",
      "section_title": true,
      "ja": "4.4. 契約上の影響に関する問題"
    },
    {
      "indent": 3,
      "text": "If a disagreement or decision has immediate or future contractual consequences, it falls under [RFC8711]. If this happens, the RSE must identify the issue and provide advice to the IETF LLC. Additionally, if the RSOC has also developed advice, it should forward that advice to the IETF LLC.",
      "ja": "意見の相違または決定が即時または将来の契約上の結果をもたらす場合、[RFC8711]に該当します。 これが発生した場合、RSEは問題を特定し、IETF LLCにアドバイスを提供する必要があります。 さらに、RSOCもアドバイスを作成している場合、そのアドバイスをIETF LLCに転送する必要があります。"
    },
    {
      "indent": 3,
      "text": "The IETF LLC must notify the RSOC and IAB regarding the action it concludes is required to resolve the issue based on its applicable procedures and provisions in the relevant contracts.",
      "ja": "IETF LLCはRSOCに通知する必要があり、IABは、関連する契約の該当する手順と規定に基づいて問題を解決するために必要であると結論付けるアクションについて通知します。"
    },
    {
      "indent": 0,
      "text": "5. IANA Considerations",
      "section_title": true,
      "ja": "5. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines several functions within the overall RFC Editor structure, and it places the responsibility for coordination of registry value assignments with the RFC Production Center. The IETF LLC will facilitate the establishment of the relationship between the RFC Production Center and IANA.",
      "ja": "このドキュメントは、RFC Editor構造全体のいくつかの機能を定義し、RFC Production Centerとのレジストリ値の割り当ての調整を担当します。 IETF LLCは、RFC Production CenterとIANA間の関係の確立を促進します。"
    },
    {
      "indent": 3,
      "text": "This document does not create a new registry nor does it register any values in existing registries, and no IANA action is required.",
      "ja": "このドキュメントは、新しいレジストリを作成したり、既存のレジストリに値を登録したりすることはなく、IANAアクションは不要です。"
    },
    {
      "indent": 0,
      "text": "6. Security Considerations",
      "section_title": true,
      "ja": "6. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "The same security considerations as those in [RFC8729] apply. The processes for the publication of documents must prevent the introduction of unapproved changes. Since the RFC Editor maintains the index of publications, sufficient security must be in place to prevent these published documents from being changed by external parties. The archive of RFC documents, any source documents needed to recreate the RFC documents, and any associated original documents (such as lists of errata, tools, and, for some early items, originals that are not machine readable) need to be secured against any kind of data storage failure.",
      "ja": "[RFC8729]のものと同じセキュリティの考慮事項が適用されます。 文書の公開プロセスでは、承認されていない変更の導入を防止する必要があります。 RFC Editorは出版物のインデックスを保持しているため、これらの出版された文書が外部の関係者によって変更されるのを防ぐために、十分なセキュリティを設定する必要があります。 RFC文書のアーカイブ、RFC文書を再作成するために必要なソース文書、および関連するオリジナル文書（エラッタ、ツール、および一部の初期のアイテムの場合、機械可読ではないオリジナルなど）は、すべてに対して保護する必要があります データストレージの障害の種類。"
    },
    {
      "indent": 3,
      "text": "The IETF LLC should take these security considerations into account during the implementation and enforcement of the RFC Editor component contracts.",
      "ja": "IETF LLCは、RFC Editorコンポーネントコントラクトの実装および実施中に、これらのセキュリティに関する考慮事項を考慮する必要があります。"
    },
    {
      "indent": 0,
      "text": "7. References",
      "section_title": true,
      "ja": "7. 参考文献"
    },
    {
      "indent": 0,
      "text": "7.1. Normative References",
      "section_title": true,
      "ja": "7.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2850] Internet Architecture Board and B. Carpenter, Ed., \"Charter of the Internet Architecture Board (IAB)\", BCP 39, RFC 2850, DOI 10.17487/RFC2850, May 2000, <https://www.rfc-editor.org/info/rfc2850>.",
      "ja": "[RFC2850]インターネットアーキテクチャ委員会とB.カーペンター編、「インターネットアーキテクチャ委員会（IAB）の憲章」、BCP 39、RFC 2850、DOI 10.17487 / RFC2850、2000年5月、<https：//www.rfc-editor .org / info / rfc2850>。"
    },
    {
      "indent": 3,
      "text": "[RFC6635] Kolkman, O., Ed., Halpern, J., Ed., and IAB, \"RFC Editor Model (Version 2)\", RFC 6635, DOI 10.17487/RFC6635, June 2012, <https://www.rfc-editor.org/info/rfc6635>.",
      "ja": "[RFC6635] Kolkman、O.、Ed。、Halpern、J.、Ed。、and IAB、 \"RFC Editor Model（Version 2）\"、RFC 6635、DOI 10.17487 / RFC6635、June 2012、<https：// www。 rfc-editor.org/info/rfc6635>。"
    },
    {
      "indent": 3,
      "text": "[RFC8711] Haberman, B., Hall, J., and J. Livingood, \"Structure of the IETF Administrative Support Activity, Version 2.0\", BCP 101, RFC 8711, DOI 10.17487/RFC8711, February 2020, <https://www.rfc-editor.org/info/rfc8711>.",
      "ja": "[RFC8711] Haberman、B.、Hall、J。、およびJ. Livingood、「IETF管理サポートアクティビティの構造、バージョン2.0」、BCP 101、RFC 8711、DOI 10.17487 / RFC8711、2020年2月、<https：// www.rfc-editor.org/info/rfc8711>。"
    },
    {
      "indent": 3,
      "text": "[RFC8729] Housley, R., Ed. and L. Daigle, Ed., \"The RFC Series and RFC Editor\", RFC 8729, DOI 10.17487/RFC8729, February 2020, <https://www.rfc-editor.org/info/rfc8729>.",
      "ja": "[RFC8729] Housley、R.、Ed。 およびL.デイグル編、「RFCシリーズとRFCエディター」、RFC 8729、DOI 10.17487 / RFC8729、2020年2月、<https://www.rfc-editor.org/info/rfc8729>。"
    },
    {
      "indent": 0,
      "text": "7.2. Informative References",
      "section_title": true,
      "ja": "7.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC5620] Kolkman, O., Ed. and IAB, \"RFC Editor Model (Version 1)\", RFC 5620, DOI 10.17487/RFC5620, August 2009, <https://www.rfc-editor.org/info/rfc5620>.",
      "ja": "[RFC5620]コルクマン、O。、エド。 およびIAB、「RFC Editor Model（Version 1）」、RFC 5620、DOI 10.17487 / RFC5620、2009年8月、<https://www.rfc-editor.org/info/rfc5620>。"
    },
    {
      "indent": 3,
      "text": "[RFC8713] Kucherawy, M., Ed., Hinden, R., Ed., and J. Livingood, Ed., \"IAB, IESG, IETF Trust, and IETF LLC Selection, Confirmation, and Recall Process: Operation of the IETF Nominating and Recall Committees\", BCP 10, RFC 8713, DOI 10.17487/RFC8713, February 2020, <https://www.rfc-editor.org/info/rfc8713>.",
      "ja": "[RFC8713] Kucherawy、M.、Ed。、Hinden、R.、Ed。、and J. Livingood、Ed。、 \"IAB、IESG、IETF Trust、and IETF LLC Selection、Confirmation、and Recall Process：Operation of the IETF 指名委員会およびリコール委員会」、BCP 10、RFC 8713、DOI 10.17487 / RFC8713、2020年2月、<https://www.rfc-editor.org/info/rfc8713>。"
    },
    {
      "indent": 0,
      "text": "IAB Members at the Time of Approval",
      "ja": "承認時のIABメンバー"
    },
    {
      "indent": 3,
      "text": "Internet Architecture Board Members at the time this document was approved for publication were:",
      "ja": "この文書の発行が承認された時点でのインターネットアーキテクチャ委員会のメンバーは次のとおりです。"
    },
    {
      "indent": 6,
      "text": "Jari Arkko Alissa Cooper Stephen Farrell Wes Hardaker Ted Hardie Christian Huitema Zhenbin Li Erik Nordmark Mark Nottingham Melinda Shore Jeff Tantsura Martin Thomson Brian Trammell",
      "ja": "Jari Arkko Alissa Cooper Stephen Farrell Wes Hardaker Ted Hardie Christian Huitema Zhenbin Li Erik Nordmark Mark Nottingham Melinda Shore Jeff Tantsura Martin Thomson Brian Trammell"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The RFC Editor model was conceived and discussed in hallways and on mailing lists. The first iteration of the text on which this document is based was first written by Leslie Daigle, Russ Housley, and Ray Pelletier. In addition to the members of the IAOC and IAB in conjunction with those roles, major and minor contributions were made by (in alphabetical order): Bob Braden, Brian Carpenter, Sandy Ginoza, Joel M. Halpern, Alfred Hoenes, Paul Hoffman, John Klensin, Subramanian Moonesamy, Alice Russo, and Jim Schaad.",
      "ja": "RFC Editorモデルは、廊下やメーリングリストで考案され議論されました。 このドキュメントの基になっているテキストの最初の反復は、最初にレスリーデイグル、ラスハウズリー、およびレイペルティエによって書かれました。 IAOCおよびIABのメンバーとこれらの役割に加えて、主要およびマイナーな貢献が（アルファベット順で）行われました：ボブブレーデン、ブライアンカーペンター、サンディギノザ、ジョエルM.ハルパーン、アルフレッドホーネス、ポールホフマン、ジョン クレンシン、スブラマニアンムーネサミー、アリスルッソ、ジムシャード。"
    },
    {
      "indent": 3,
      "text": "The IAOC members at the time RFC 6635 was approved were (in alphabetical order): Bernard Aboba (ex officio), Eric Burger, Dave Crocker, Marshall Eubanks, Bob Hinden, Russ Housley (ex officio), Ole Jacobsen, Ray Pelletier (non-voting), and Lynn St. Amour (ex officio).",
      "ja": "RFC 6635が承認された時点のIAOCメンバーは、（アルファベット順）バーナードアボバ（職権なし）、エリックバーガー、デイブクロッカー、マーシャルユーバンクス、ボブヒンデン、ラスハウスリー（職権あり）、オレヤコブセン、レイペルティエ（non -voting）、およびLynn St. Amour（職権外）。"
    },
    {
      "indent": 3,
      "text": "The IAB members at the time the initial RFC Editor model (Version 1, RFC 5620) was approved were (in alphabetical order): Loa Andersson, Gonzalo Camarillo, Stuart Cheshire, Russ Housley, Olaf Kolkman, Gregory Lebovitz, Barry Leiba, Kurtis Lindqvist, Andrew Malis, Danny McPherson, David Oran, Dave Thaler, and Lixia Zhang. In addition, the IAB included two ex officio members: Dow Street, who was serving as the IAB Executive Director, and Aaron Falk, who was serving as the IRTF Chair.",
      "ja": "最初のRFCエディターモデル（バージョン1、RFC 5620）が承認された時点のIABメンバーは、アルファベット順で次のとおりでした。 、Andrew Malis、Danny McPherson、David Oran、Dave Thaler、Lixia Zhang。 さらに、IABには2人の職権上のメンバーが含まれていました。IABエグゼクティブディレクターを務めていたダウストリートと、IRTFチェアを務めていたアーロンフォークです。"
    },
    {
      "indent": 3,
      "text": "The IAB members at the time RFC 6635 was approved were (in alphabetical order): Bernard Aboba, Ross Callon, Alissa Cooper, Spencer Dawkins, Joel Halpern, Russ Housley, David Kessens, Olaf Kolkman, Danny McPherson, Jon Peterson, Andrei Robachevsky, Dave Thaler, and Hannes Tschofenig. In addition, at the time of approval of RFC 6635, the IAB included two ex officio members: Mary Barnes who was serving as the IAB Executive Director, and Lars Eggert, who was serving as the IRTF Chair.",
      "ja": "RFC 6635が承認された時点のIABメンバーは、アルファベット順で次のとおりでした。 デイブ・ターラー、ハンネス・ツコフェニグ。 さらに、RFC 6635の承認の時点で、IABには2人の職権上のメンバーが含まれていました。"
    },
    {
      "indent": 3,
      "text": "Bob Hinden served as document editor for this RFC to align it with the IASA 2.0 structure.",
      "ja": "ボブ・ヒンデンは、このRFCのドキュメントエディタとして機能し、IASA 2.0構造に合わせました。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Olaf Kolkman (editor) Internet Society",
      "ja": "オラフ・コルクマン（編集者）インターネット協会"
    },
    {
      "indent": 3,
      "text": "Email: kolkman@isoc.org",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Joel M. Halpern (editor) Ericsson",
      "ja": "ジョエル・M・ハルパーン（編集者）エリクソン"
    },
    {
      "indent": 3,
      "text": "Email: joel.halpern@ericsson.com",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Robert M. Hinden (editor) Check Point Software 959 Skyway Road San Carlos, CA 94070 United States of America",
      "ja": "Robert M. Hinden（編集者）Check Point Software 959 Skyway Road San Carlos、CA 94070アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: bob.hinden@gmail.com",
      "raw": true
    }
  ]
}