{
  "title": {
    "text": "RFC 8654 - Extended Message Support for BGP",
    "ja": "RFC 8654 - BGPの拡張メッセージサポート"
  },
  "number": 8654,
  "created_at": "2020-03-09 20:24:49.987985+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                           R. Bush\nRequest for Comments: 8654                                  Arrcus & IIJ\nUpdates: 4271                                                   K. Patel\nCategory: Standards Track                                   Arrcus, Inc.\nISSN: 2070-1721                                                  D. Ward\n                                                           Cisco Systems\n                                                            October 2019",
      "raw": true
    },
    {
      "indent": 20,
      "text": "Extended Message Support for BGP",
      "ja": "BGPの拡張メッセージサポート"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "The BGP specification (RFC 4271) mandates a maximum BGP message size of 4,096 octets. As BGP is extended to support new Address Family Identifiers (AFIs), Subsequent AFIs (SAFIs), and other features, there is a need to extend the maximum message size beyond 4,096 octets. This document updates the BGP specification by extending the maximum message size from 4,096 octets to 65,535 octets for all messages except for OPEN and KEEPALIVE messages.",
      "ja": "BGP仕様（RFC 4271）では、4,096オクテットの最大BGPメッセージサイズが義務付けられています。 BGPは新しいアドレスファミリ識別子（AFI）、後続のAFI（SAFI）、およびその他の機能をサポートするように拡張されているため、最大メッセージサイズを4,096オクテットを超えて拡張する必要があります。 このドキュメントは、OPENおよびKEEPALIVEメッセージを除くすべてのメッセージの最大メッセージサイズを4,096オクテットから65,535オクテットに拡張することにより、BGP仕様を更新します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット標準化過程の文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、Internet Engineering Task Force（IETF）の製品です。 IETFコミュニティのコンセンサスを表しています。 これは公開レビューを受けており、Internet Engineering Steering Group（IESG）による公開が承認されています。 インターネット標準の詳細については、RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8654.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックに関する情報は、https：//www.rfc-editor.org/info/rfc8654で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2019 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2019 IETF Trustおよび文書の著者として特定された人物。 全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、このドキュメントの公開日に有効なBCP 78およびIETFトラストのIETFドキュメントに関連する法的条項（https://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているので、注意深く確認してください。 このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseテキストを含める必要があり、Simplified BSD Licenseに記載されている保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction 1.1. Requirements Language 2. BGP Extended Message 3. BGP Extended Message Capability 4. Operation 5. Error Handling 6. Changes to RFC 4271 7. IANA Considerations 8. Security Considerations 9. References 9.1. Normative References 9.2. Informative References Acknowledgments Authors' Addresses",
      "ja": "1. はじめに1.1。 要件言語2. BGP拡張メッセージ3. BGP拡張メッセージ機能4.操作5.エラー処理6. RFC 4271の変更7. IANAに関する考慮事項8.セキュリティに関する考慮事項9.参考文献9.1。 規範的な参考文献9.2。 参考情報謝辞著者のアドレス"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The BGP specification [RFC4271] mandates a maximum BGP message size of 4,096 octets. As BGP is extended to support new AFIs, SAFIs, and other capabilities (e.g., BGPsec [RFC8205] and BGP - Link State (BGP-LS) [RFC7752]), there is a need to extend the maximum message size beyond 4,096 octets. This document provides an extension to BGP to extend the message size limit from 4,096 octets to 65,535 octets for all messages except for OPEN and KEEPALIVE messages.",
      "ja": "BGP仕様[RFC4271]は、4,096オクテットの最大BGPメッセージサイズを義務付けています。 BGPが新しいAFI、SAFI、およびその他の機能（たとえば、BGPsec [RFC8205]およびBGP-リンク状態（BGP-LS）[RFC7752]）をサポートするように拡張されると、最大メッセージサイズを4,096オクテットを超えて拡張する必要があります。 このドキュメントは、BGPに拡張を提供して、OPENおよびKEEPALIVEメッセージを除くすべてのメッセージのメッセージサイズ制限を4,096オクテットから65,535オクテットに拡張します。"
    },
    {
      "indent": 0,
      "text": "1.1. Requirements Language",
      "section_title": true,
      "ja": "1.1. 要件言語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. BGP Extended Message",
      "section_title": true,
      "ja": "2. BGP拡張メッセージ"
    },
    {
      "indent": 3,
      "text": "A BGP message over 4,096 octets in length is a BGP Extended Message.",
      "ja": "長さが4,096オクテットを超えるBGPメッセージは、BGP拡張メッセージです。"
    },
    {
      "indent": 3,
      "text": "BGP Extended Messages have a maximum message size of 65,535 octets. The smallest message that may be sent is a BGP KEEPALIVE, which consists of 19 octets.",
      "ja": "BGP拡張メッセージの最大メッセージサイズは65,535オクテットです。 送信できる最小のメッセージは、BGP KEEPALIVEで、19オクテットで構成されています。"
    },
    {
      "indent": 0,
      "text": "3. BGP Extended Message Capability",
      "section_title": true,
      "ja": "3. BGP拡張メッセージ機能"
    },
    {
      "indent": 3,
      "text": "The BGP Extended Message Capability is a new BGP capability [RFC5492] defined with Capability Code 6 and Capability Length 0.",
      "ja": "BGP拡張メッセージ機能は、機能コード6および機能長0で定義された新しいBGP機能[RFC5492]です。"
    },
    {
      "indent": 3,
      "text": "To advertise the BGP Extended Message Capability to a peer, a BGP speaker uses BGP Capabilities Advertisement [RFC5492]. By advertising the BGP Extended Message Capability to a peer, a BGP speaker conveys that it is able to receive and properly handle BGP Extended Messages (see Section 4).",
      "ja": "BGP拡張メッセージ機能をピアにアドバタイズするために、BGPスピーカーはBGP機能アドバタイズメント[RFC5492]を使用します。 BGP拡張メッセージ機能をピアにアドバタイズすることにより、BGPスピーカーは、BGP拡張メッセージを受信して適切に処理できることを伝えます（セクション4を参照）。"
    },
    {
      "indent": 3,
      "text": "Peers that wish to use the BGP Extended Message Capability MUST support error handling for BGP UPDATE messages per [RFC7606].",
      "ja": "BGP拡張メッセージ機能の使用を希望するピアは、[RFC7606]ごとにBGP UPDATEメッセージのエラー処理をサポートする必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Operation",
      "section_title": true,
      "ja": "4. 操作"
    },
    {
      "indent": 3,
      "text": "The BGP Extended Message Capability applies to all messages except for OPEN and KEEPALIVE messages. These exceptions reduce the complexity of providing backward compatibility.",
      "ja": "BGP拡張メッセージ機能は、OPENおよびKEEPALIVEメッセージを除くすべてのメッセージに適用されます。 これらの例外により、下位互換性を提供する複雑さが軽減されます。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker that is capable of receiving BGP Extended Messages SHOULD advertise the BGP Extended Message Capability to its peers using BGP Capabilities Advertisement [RFC5492]. A BGP speaker MAY send BGP Extended Messages to a peer only if the BGP Extended Message Capability was received from that peer.",
      "ja": "BGP拡張メッセージを受信できるBGPスピーカーは、BGP機能アドバタイズメント[RFC5492]を使用して、BGP拡張メッセージ機能をピアにアドバタイズする必要があります。 BGPスピーカーは、BGP拡張メッセージ機能がピアから受信された場合にのみ、そのピアにBGP拡張メッセージを送信できます。"
    },
    {
      "indent": 3,
      "text": "An implementation that advertises the BGP Extended Message Capability MUST be capable of receiving a message with a length up to and including 65,535 octets.",
      "ja": "BGP拡張メッセージ機能をアドバタイズする実装は、65,535オクテットまでの長さのメッセージを受信できる必要があります。"
    },
    {
      "indent": 3,
      "text": "Applications generating information that might be encapsulated within BGP messages MUST limit the size of their payload to take the maximum message size into account.",
      "ja": "BGPメッセージ内にカプセル化される可能性のある情報を生成するアプリケーションは、ペイロードのサイズを制限して、最大メッセージサイズを考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "If a BGP message with a length greater than 4,096 octets is received by a BGP listener who has not advertised the BGP Extended Message Capability, the listener will generate a NOTIFICATION with the Error Subcode set to Bad Message Length ([RFC4271], Section 6.1).",
      "ja": "BGP拡張メッセージ機能をアドバタイズしていないBGPリスナーが4,096オクテットを超える長さのBGPメッセージを受信した場合、リスナーはエラーサブコードをBad Message Length（[RFC4271]、セクション6.1）に設定したNOTIFICATIONを生成します 。"
    },
    {
      "indent": 3,
      "text": "A BGP UPDATE will (if allowed by policy, best path, etc.) typically propagate throughout the BGP-speaking Internet and hence to BGP speakers that may not support BGP Extended Messages. Therefore, an announcement in a BGP Extended Message where the size of the attribute set plus the NLRI is larger than 4,096 octets may cause lack of reachability.",
      "ja": "BGP更新は（ポリシー、最適パスなどで許可されている場合）通常、BGPを使用するインターネット全体に伝播するため、BGP拡張メッセージをサポートしない可能性のあるBGPスピーカーに伝播します。 したがって、属性セットとNLRIのサイズが4,096オクテットより大きいBGP拡張メッセージでのアナウンスにより、到達可能性が失われる可能性があります。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker that has advertised the BGP Extended Message Capability to its peers may receive an UPDATE from one of its peers that produces an ongoing announcement that is larger than 4,096 octets. When propagating that UPDATE onward to a neighbor that has not advertised the BGP Extended Message Capability, the speaker SHOULD try to reduce the outgoing message size by removing attributes eligible under the \"attribute discard\" approach of [RFC7606]. If the message is still too big, then it must not be sent to the neighbor ([RFC4271], Section 9.2). Additionally, if the NLRI was previously advertised to that peer, it must be withdrawn from service ([RFC4271], Section 9.1.3).",
      "ja": "BGP拡張メッセージ機能をピアにアドバタイズしたBGPスピーカーは、ピアの1つから、4,096オクテットより大きい進行中のアナウンスを生成するUPDATEを受信する場合があります。 BGP拡張メッセージ機能をアドバタイズしていないネイバーにそのUPDATEを先に伝播するとき、スピーカーは[RFC7606]の「属性破棄」アプローチの下で適格な属性を削除することによって発信メッセージサイズを削減しようとします。 それでもメッセージが大きすぎる場合は、隣人に送信してはいけません（[RFC4271]、セクション9.2）。 さらに、NLRIが以前にそのピアにアドバタイズされていた場合、サービスから撤回する必要があります（[RFC4271]、セクション9.1.3）。"
    },
    {
      "indent": 3,
      "text": "If an Autonomous System (AS) has multiple internal BGP speakers and also has multiple external BGP neighbors, care must be taken to ensure a consistent view within the AS in order to present a consistent external view. In the context of BGP Extended Messages, a consistent view can only be guaranteed if all the Internal BGP (iBGP) speakers advertise the BGP Extended Message Capability. If that is not the case, then the operator should consider whether or not the BGP Extended Message Capability should be advertised to external peers.",
      "ja": "自律システム（AS）に複数の内部BGPスピーカーがあり、複数の外部BGPネイバーもある場合、一貫した外部ビューを表示するには、AS内で一貫したビューを確保するように注意する必要があります。 BGP拡張メッセージのコンテキストでは、すべての内部BGP（iBGP）スピーカーがBGP拡張メッセージ機能をアドバタイズする場合にのみ、一貫したビューが保証されます。 そうでない場合、オペレータは、BGP拡張メッセージ機能を外部ピアにアドバタイズする必要があるかどうかを検討する必要があります。"
    },
    {
      "indent": 3,
      "text": "During the incremental deployment of BGP Extended Messages and use of the \"attribute discard\" approach of [RFC7606] in an iBGP mesh or with External BGP (eBGP) peers, the operator should monitor any routes dropped and any discarded attributes.",
      "ja": "BGP拡張メッセージのインクリメンタル展開およびiBGPメッシュまたは外部BGP（eBGP）ピアでの[RFC7606]の「属性破棄」アプローチの使用中、オペレーターは、ドロップされたルートおよび破棄された属性を監視する必要があります。"
    },
    {
      "indent": 0,
      "text": "5. Error Handling",
      "section_title": true,
      "ja": "5. エラー処理"
    },
    {
      "indent": 3,
      "text": "A BGP speaker that has the ability to use BGP Extended Messages but has not advertised the BGP Extended Message Capability, presumably due to configuration, MUST NOT accept a BGP Extended Message. A speaker MUST NOT implement a more liberal policy accepting BGP Extended Messages.",
      "ja": "BGP拡張メッセージを使用できるが、おそらく構成が原因でBGP拡張メッセージ機能をアドバタイズしていないBGPスピーカーは、BGP拡張メッセージを受け入れてはなりません。 スピーカーは、BGP拡張メッセージを受け入れるより自由なポリシーを実装してはなりません。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker that does not advertise the BGP Extended Message Capability might also genuinely not support BGP Extended Messages. Such a speaker will follow the error-handling procedures of [RFC4271] if it receives a BGP Extended Message. Similarly, any speaker that treats an improper BGP Extended Message as a fatal error MUST follow the error-handling procedures of [RFC4271].",
      "ja": "BGP拡張メッセージ機能をアドバタイズしないBGPスピーカーも、BGP拡張メッセージを完全にサポートしない場合があります。 このようなスピーカーは、BGP拡張メッセージを受信した場合、[RFC4271]のエラー処理手順に従います。 同様に、不適切なBGP拡張メッセージを致命的なエラーとして扱うスピーカーは、[RFC4271]のエラー処理手順に従う必要があります。"
    },
    {
      "indent": 3,
      "text": "Error handling for UPDATE messages, as specified in Section 6.3 of [RFC4271], is unchanged. However, if a NOTIFICATION is to be sent to a BGP speaker that has not advertised the BGP Extended Message Capability, the size of the message MUST NOT exceed 4,096 octets.",
      "ja": "[RFC4271]のセクション6.3で指定されているUPDATEメッセージのエラー処理は変更されていません。 ただし、BGP拡張メッセージ機能をアドバタイズしていないBGPスピーカーにNOTIFICATIONを送信する場合、メッセージのサイズは4,096オクテットを超えてはなりません（MUST NOT）。"
    },
    {
      "indent": 3,
      "text": "It is RECOMMENDED that BGP protocol developers and implementers are conservative in their application and use of BGP Extended Messages. Future protocol specifications MUST describe how to handle peers that can only accommodate 4,096 octet messages.",
      "ja": "BGPプロトコルの開発者と実装者は、BGP拡張メッセージのアプリケーションと使用において保守的であることが推奨されます。 将来のプロトコル仕様では、4,096オクテットメッセージのみを収容できるピアの処理方法を説明する必要があります。"
    },
    {
      "indent": 0,
      "text": "6. Changes to RFC 4271",
      "section_title": true,
      "ja": "6. RFC 4271の変更"
    },
    {
      "indent": 3,
      "text": "[RFC4271] states \"The value of the Length field MUST always be at least 19 and no greater than 4096.\" This document changes the latter number to 65,535 for all messages except for OPEN and KEEPALIVE messages.",
      "ja": "[RFC4271]は、「長さフィールドの値は常に少なくとも19で、4096以下でなければならない」と述べています。 このドキュメントでは、OPENおよびKEEPALIVEメッセージを除くすべてのメッセージの後者の番号を65,535に変更します。"
    },
    {
      "indent": 3,
      "text": "Section 6.1 of [RFC4271] specifies raising an error if the length of a message is over 4,096 octets. For all messages except for OPEN and KEEPALIVE messages, if the receiver has advertised the BGP Extended Message Capability, this document raises that limit to 65,535.",
      "ja": "[RFC4271]のセクション6.1は、メッセージの長さが4,096オクテットを超える場合にエラーを発生させることを指定しています。 OPENおよびKEEPALIVEメッセージを除くすべてのメッセージについて、受信者がBGP拡張メッセージ機能をアドバタイズしている場合、このドキュメントはその制限を65,535に引き上げます。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has made the following allocation in the \"Capability Codes\" registry:",
      "ja": "IANAは、「機能コード」レジストリで次の割り当てを行いました。"
    },
    {
      "indent": 3,
      "text": "+-------+----------------------+-----------+\n| Value | Description          | Reference |\n+=======+======================+===========+\n| 6     | BGP Extended Message | RFC 8654  |\n+-------+----------------------+-----------+",
      "raw": true
    },
    {
      "indent": 5,
      "text": "Table 1: Addition to \"Capability Codes\" Registry",
      "ja": "表1：「機能コード」レジストリへの追加"
    },
    {
      "indent": 0,
      "text": "8. Security Considerations",
      "section_title": true,
      "ja": "8. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This extension to BGP does not change BGP's underlying security issues [RFC4272].",
      "ja": "BGPへのこの拡張は、BGPの根本的なセキュリティ問題[RFC4272]を変更しません。"
    },
    {
      "indent": 3,
      "text": "Due to increased memory requirements for buffering, there may be increased exposure to resource exhaustion, intentional or unintentional.",
      "ja": "バッファリングのメモリ要件が増加するため、意図的または意図的ではないリソースの枯渇にさらされる可能性が高くなります。"
    },
    {
      "indent": 3,
      "text": "If a remote speaker is able to craft a large BGP Extended Message to send on a path where one or more peers do not support BGP Extended Messages, peers that support BGP Extended Messages may:",
      "ja": "リモートスピーカーが大きなBGP拡張メッセージを作成して、1つ以上のピアがBGP拡張メッセージをサポートしないパスで送信できる場合、BGP拡張メッセージをサポートするピアは次のことを行うことができます。"
    },
    {
      "indent": 3,
      "text": "* act to reduce the outgoing message (see Section 4) and, in doing so, cause an attack by discarding attributes one or more of its peers may be expecting. The attributes eligible under the \"attribute discard\" approach must have no effect on route selection or installation [RFC7606].",
      "ja": "* 発信メッセージを削減し（セクション4を参照）、その際に、1つ以上のピアが予期している可能性のある属性を破棄することにより攻撃を引き起こします。 「属性廃棄」アプローチの下で適格な属性は、ルートの選択またはインストールに影響を与えてはなりません[RFC7606]。"
    },
    {
      "indent": 3,
      "text": "* act to reduce the outgoing message (see Section 4) and, in doing so, allow a downgrade attack. This would only affect the attacker's message, where 'downgrade' has questionable meaning.",
      "ja": "* 発信メッセージを削減し（セクション4を参照）、その際にダウングレード攻撃を許可します。 これは、「ダウングレード」の意味が疑わしい攻撃者のメッセージにのみ影響します。"
    },
    {
      "indent": 3,
      "text": "* incur resource load (processing, message resizing, etc.) when reformatting the large messages.",
      "ja": "* 大きなメッセージを再フォーマットするときにリソースの負荷（処理、メッセージのサイズ変更など）が発生します。"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S.、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC4271] Rekhter, Y., Ed., Li, T., Ed., and S. Hares, Ed., \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, DOI 10.17487/RFC4271, January 2006, <https://www.rfc-editor.org/info/rfc4271>.",
      "ja": "[RFC4271] Rekhter、Y.、Ed。、Li、T.、Ed。、and S. Hares、Ed。、 \"A Border Gateway Protocol 4（BGP-4）\"、RFC 4271、DOI 10.17487 / RFC4271、January 2006 、<https://www.rfc-editor.org/info/rfc4271>。"
    },
    {
      "indent": 3,
      "text": "[RFC5492] Scudder, J. and R. Chandra, \"Capabilities Advertisement with BGP-4\", RFC 5492, DOI 10.17487/RFC5492, February 2009, <https://www.rfc-editor.org/info/rfc5492>.",
      "ja": "[RFC5492] Scudder、J. and R. Chandra、 \"Capabilities Advertisement with BGP-4\"、RFC 5492、DOI 10.17487 / RFC5492、February 2009、<https://www.rfc-editor.org/info/rfc5492>。"
    },
    {
      "indent": 3,
      "text": "[RFC7606] Chen, E., Ed., Scudder, J., Ed., Mohapatra, P., and K. Patel, \"Revised Error Handling for BGP UPDATE Messages\", RFC 7606, DOI 10.17487/RFC7606, August 2015, <https://www.rfc-editor.org/info/rfc7606>.",
      "ja": "[RFC7606] Chen、E.、Ed。、Scudder、J.、Ed。、Mohapatra、P。、およびK. Patel、「BGP UPDATEメッセージの修正されたエラー処理」、RFC 7606、DOI 10.17487 / RFC7606、2015年8月、 <https://www.rfc-editor.org/info/rfc7606>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[RFC4272] Murphy, S., \"BGP Security Vulnerabilities Analysis\", RFC 4272, DOI 10.17487/RFC4272, January 2006, <https://www.rfc-editor.org/info/rfc4272>.",
      "ja": "[RFC4272] Murphy、S。、「BGPセキュリティ脆弱性分析」、RFC 4272、DOI 10.17487 / RFC4272、2006年1月、<https://www.rfc-editor.org/info/rfc4272>。"
    },
    {
      "indent": 3,
      "text": "[RFC7752] Gredler, H., Ed., Medved, J., Previdi, S., Farrel, A., and S. Ray, \"North-Bound Distribution of Link-State and Traffic Engineering (TE) Information Using BGP\", RFC 7752, DOI 10.17487/RFC7752, March 2016, <https://www.rfc-editor.org/info/rfc7752>.",
      "ja": "[RFC7752] Gredler、H.、Ed。、Medved、J.、Previdi、S.、Farrel、A。、およびS. Ray、「BGPを使用したリンクステートおよびトラフィックエンジニアリング（TE）情報の北限分布」 、RFC 7752、DOI 10.17487 / RFC7752、2016年3月、<https://www.rfc-editor.org/info/rfc7752>。"
    },
    {
      "indent": 3,
      "text": "[RFC8205] Lepinski, M., Ed. and K. Sriram, Ed., \"BGPsec Protocol Specification\", RFC 8205, DOI 10.17487/RFC8205, September 2017, <https://www.rfc-editor.org/info/rfc8205>.",
      "ja": "[RFC8205] Lepinski、M.、Ed。 およびK. Sriram、編、「BGPsecプロトコル仕様」、RFC 8205、DOI 10.17487 / RFC8205、2017年9月、<https://www.rfc-editor.org/info/rfc8205>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors thank Alvaro Retana for an amazing review; Enke Chen, Susan Hares, John Scudder, John Levine, and Job Snijders for their input; and Oliver Borchert and Kyehwan Lee for their implementations and testing.",
      "ja": "著者は素晴らしいレビューをしてくれたアルバロ・レタナに感謝します。 Enke Chen、Susan Hares、John Scudder、John Levine、およびJob Snijdersの入力。 Oliver BorchertとKyehwan Leeの実装とテストについて。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Randy Bush Arrcus & IIJ 5147 Crystal Springs Bainbridge Island, WA 98110 United States of America",
      "ja": "Randy Bush Arrcus＆IIJ 5147 Crystal Springs Bainbridge Island、WA 98110アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: randy@psg.com",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Keyur Patel Arrcus, Inc.",
      "ja": "Keyur Patel Arrcus、Inc."
    },
    {
      "indent": 3,
      "text": "Email: keyur@arrcus.com",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Dave Ward Cisco Systems 170 W. Tasman Drive San Jose, CA 95134 United States of America",
      "ja": "Dave Ward Cisco Systems 170 W. Tasman Drive San Jose、CA 95134アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: dward@cisco.com",
      "raw": true
    }
  ]
}