{
  "title": {
    "text": "RFC 8984 - JSCalendar: A JSON Representation of Calendar Data",
    "ja": "RFC 8984 - JScalendar：カレンダーデータのJSON表現"
  },
  "number": 8984,
  "created_at": "2021-07-18 02:59:05.319535+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        N. Jenkins\nRequest for Comments: 8984                                   R. Stepanek\nCategory: Standards Track                                       Fastmail\nISSN: 2070-1721                                                July 2021",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 11,
      "text": "JSCalendar: A JSON Representation of Calendar Data",
      "ja": "JScalendar：カレンダーデータのJSON表現"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "This specification defines a data model and JSON representation of calendar data that can be used for storage and data exchange in a calendaring and scheduling environment. It aims to be an alternative and, over time, successor to the widely deployed iCalendar data format. It also aims to be unambiguous, extendable, and simple to process. In contrast to the jCal format, which is also based on JSON, JSCalendar is not a direct mapping from iCalendar but defines the data model independently and expands semantics where appropriate.",
      "ja": "この仕様は、カレンダー環境およびスケジューリング環境でのストレージとデータ交換に使用できるカレンダーデータのデータモデルとJSON表現を定義しています。それは、広く展開されたiCalendarデータフォーマットに対する代替手段、そして経時的な後継者を目指しています。それはまた明確で、拡張可能、そしてプロセスが簡単であることを目指しています。JSONに基づいているJCAL形式とは対照的に、JScalendarはiCalendarからの直接マッピングではなく、データモデルを独立して定義し、必要に応じてセマンティクスを拡大します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "本文書の位置付け"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット規格のトラック文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "この文書は、インターネットエンジニアリングタスクフォース（IETF）の製品です。IETFコミュニティのコンセンサスを表します。それは公開レビューを受け、インターネットエンジニアリングステアリンググループ（IESG）による出版の承認を受けました。インターネット規格に関する詳細情報は、RFC 7841のセクション2で利用できます。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8984.",
      "ja": "この文書の現在のステータス、任意のエラータ、およびフィードバックを提供する方法は、https://www.rfc-editor.org/info/frfc8984で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2021 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2021 IETF信頼と文書著者として識別された人。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、このドキュメントの発行日に有効なBCP 78およびIETFドキュメントに関連するIETFトラストの法的規定（https://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するお客様の権利と制限について説明しているため、注意深く確認してください。 このドキュメントから抽出されたコードコンポーネントには、Trust LegalProvisionsのセクション4.eで説明されているSimplifiedBSD Licenseテキストが含まれている必要があり、Simplified BSDLicenseで説明されているように保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction\n  1.1.  Motivation and Relation to iCalendar and jCal\n  1.2.  Notational Conventions\n  1.3.  Type Signatures\n  1.4.  Data Types\n    1.4.1.  Id\n    1.4.2.  Int\n    1.4.3.  UnsignedInt\n    1.4.4.  UTCDateTime\n    1.4.5.  LocalDateTime\n    1.4.6.  Duration\n    1.4.7.  SignedDuration\n    1.4.8.  TimeZoneId\n    1.4.9.  PatchObject\n    1.4.10. Relation\n    1.4.11. Link\n2.  JSCalendar Objects\n  2.1.  Event\n  2.2.  Task\n  2.3.  Group\n3.  Structure of JSCalendar Objects\n  3.1.  Object Type\n  3.2.  Normalization and Equivalence\n  3.3.  Vendor-Specific Property Extensions, Values, and Types\n4.  Common JSCalendar Properties\n  4.1.  Metadata Properties\n    4.1.1.  @type\n    4.1.2.  uid\n    4.1.3.  relatedTo\n    4.1.4.  prodId\n    4.1.5.  created\n    4.1.6.  updated\n    4.1.7.  sequence\n    4.1.8.  method\n  4.2.  What and Where Properties\n    4.2.1.  title\n    4.2.2.  description\n    4.2.3.  descriptionContentType\n    4.2.4.  showWithoutTime\n    4.2.5.  locations\n    4.2.6.  virtualLocations\n    4.2.7.  links\n    4.2.8.  locale\n    4.2.9.  keywords\n    4.2.10. categories\n    4.2.11. color\n  4.3.  Recurrence Properties\n    4.3.1.  recurrenceId\n    4.3.2.  recurrenceIdTimeZone\n    4.3.3.  recurrenceRules\n    4.3.4.  excludedRecurrenceRules\n    4.3.5.  recurrenceOverrides\n    4.3.6.  excluded\n  4.4.  Sharing and Scheduling Properties\n    4.4.1.  priority\n    4.4.2.  freeBusyStatus\n    4.4.3.  privacy\n    4.4.4.  replyTo\n    4.4.5.  sentBy\n    4.4.6.  participants\n    4.4.7.  requestStatus\n  4.5.  Alerts Properties\n    4.5.1.  useDefaultAlerts\n    4.5.2.  alerts\n  4.6.  Multilingual Properties\n    4.6.1.  localizations\n  4.7.  Time Zone Properties\n    4.7.1.  timeZone\n    4.7.2.  timeZones\n5.  Type-Specific JSCalendar Properties\n  5.1.  Event Properties\n    5.1.1.  start\n    5.1.2.  duration\n    5.1.3.  status\n  5.2.  Task Properties\n    5.2.1.  due\n    5.2.2.  start\n    5.2.3.  estimatedDuration\n    5.2.4.  percentComplete\n    5.2.5.  progress\n    5.2.6.  progressUpdated\n  5.3.  Group Properties\n    5.3.1.  entries\n    5.3.2.  source\n6.  Examples\n  6.1.  Simple Event\n  6.2.  Simple Task\n  6.3.  Simple Group\n  6.4.  All-Day Event\n  6.5.  Task with a Due Date\n  6.6.  Event with End Time Zone\n  6.7.  Floating-Time Event (with Recurrence)\n  6.8.  Event with Multiple Locations and Localization\n  6.9.  Recurring Event with Overrides\n  6.10. Recurring Event with Participants\n7.  Security Considerations\n  7.1.  Expanding Recurrences\n  7.2.  JSON Parsing\n  7.3.  URI Values\n  7.4.  Spam\n  7.5.  Duplication\n  7.6.  Time Zones\n8.  IANA Considerations\n  8.1.  Media Type Registration\n  8.2.  Creation of the \"JSCalendar Properties\" Registry\n    8.2.1.  Preliminary Community Review\n    8.2.2.  Submit Request to IANA\n    8.2.3.  Designated Expert Review\n    8.2.4.  Change Procedures\n    8.2.5.  \"JSCalendar Properties\" Registry Template\n    8.2.6.  Initial Contents for the \"JSCalendar Properties\"\n            Registry\n  8.3.  Creation of the \"JSCalendar Types\" Registry\n    8.3.1.  \"JSCalendar Types\" Registry Template\n    8.3.2.  Initial Contents for the \"JSCalendar Types\" Registry\n  8.4.  Creation of the \"JSCalendar Enum Values\" Registry\n    8.4.1.  \"JSCalendar Enum Values\" Registry Property Template\n    8.4.2.  \"JSCalendar Enum Values\" Registry Value Template\n    8.4.3.  Initial Contents for the \"JSCalendar Enum Values\"\n            Registry\n9.  References\n  9.1.  Normative References\n  9.2.  Informative References\nAcknowledgments\nAuthors' Addresses",
      "raw": true,
      "toc": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "This document defines a data model for calendar event and task objects, or groups of such objects, in electronic calendar applications and systems. The format aims to be unambiguous, extendable, and simple to process.",
      "ja": "このドキュメントは、カレンダーイベントとタスクオブジェクト、またはそのようなオブジェクトのグループ、電子カレンダーアプリケーションとシステムのデータモデルを定義しています。フォーマットは、明確に、拡張可能、そして処理が簡単であることを目的としています。"
    },
    {
      "indent": 3,
      "text": "The key design considerations for this data model are as follows:",
      "ja": "このデータモデルの重要な設計上の考慮事項は次のとおりです。"
    },
    {
      "indent": 3,
      "text": "* The attributes of the calendar entry represented must be described as simple key-value pairs. Simple events are simple to represent; complex events can be modeled accurately.",
      "ja": "* 表されるカレンダーエントリの属性は、単純なキー値ペアとして記述されなければなりません。単純なイベントは表現するのが簡単です。複雑なイベントは正確にモデル化できます。"
    },
    {
      "indent": 3,
      "text": "* Wherever possible, there should be only one way to express the desired semantics, reducing complexity.",
      "ja": "* 可能な限り、望ましい意味を表現する1つの方法は1つだけであり、複雑さを減らすことができます。"
    },
    {
      "indent": 3,
      "text": "* The data model should avoid ambiguities, which often lead to interoperability issues between implementations.",
      "ja": "* データモデルはあいまいさを避けるべきであり、それは実装間の相互運用性の問題につながることが多い。"
    },
    {
      "indent": 3,
      "text": "* The data model should be generally compatible with the iCalendar data format [RFC5545] [RFC7986] and extensions, but the specification should add new attributes where the iCalendar format currently lacks expressivity, and drop seldom-used, obsolete, or redundant properties. This means translation with no loss of semantics should be easy with most common iCalendar files.",
      "ja": "* データモデルは、一般にICERENDAR DATAフォーマット[RFC5545] [RFC7986]と拡張機能と互換性がありますが、この仕様は、現在、iCalendarフォーマットが現在発現率を欠いています。これは、ほとんどの一般的なiCalendarファイルを使って、セマンティクスの損失を持たない翻訳を意味します。"
    },
    {
      "indent": 3,
      "text": "* Extensions, such as new properties and components, should not require updates to this document.",
      "ja": "* 新しいプロパティやコンポーネントなどの拡張機能は、このドキュメントの更新を必要としません。"
    },
    {
      "indent": 3,
      "text": "The representation of this data model is defined in the Internet JSON (I-JSON) format [RFC7493], which is a strict subset of the JSON data interchange format [RFC8259]. Using JSON is mostly a pragmatic choice: its widespread use makes JSCalendar easier to adopt and the ready availability of production-ready JSON implementations eliminates a whole category of parser-related interoperability issues, which iCalendar has often suffered from.",
      "ja": "このデータモデルの表現は、JSONデータ交換フォーマットの厳密なサブセット[RFC8259]であるInternet JSON（I-JSON）フォーマット[RFC7493]で定義されています。JSONの使用は実用的な選択です：その広範な使用はJScalendarを採用しやすく、プロダクション対応のJSON実装の容易な可用性はパーサー関連の相互運用性の問題の全体を排除し、そのICalendarが頻繁に発生しました。"
    },
    {
      "indent": 0,
      "text": "1.1. Motivation and Relation to iCalendar and jCal",
      "section_title": true,
      "ja": "1.1. 動機とiCalendarとKcalとの関係"
    },
    {
      "indent": 3,
      "text": "The iCalendar data format [RFC5545], a widely deployed interchange format for calendaring and scheduling data, has served calendaring vendors for a long time but contains some ambiguities and pitfalls that cannot be overcome without backward-incompatible changes.",
      "ja": "カレンダーデータとスケジューリングデータのための広範な展開された交換形式であるiCalendar Data Format [RFC5545]は、長期間にわたってカレンダーベンダーを提供していましたが、逆方向に互換性のない変更なしに克服できないいくつかのあいまいさと落とし穴を含みます。"
    },
    {
      "indent": 3,
      "text": "Sources of implementation errors include the following:",
      "ja": "実装エラーの発生源には、次のものがあります。"
    },
    {
      "indent": 3,
      "text": "* iCalendar defines various formats for local times, UTC, and dates.",
      "ja": "* ICalendarは、現地時間、UTC、および日付のさまざまな形式を定義しています。"
    },
    {
      "indent": 3,
      "text": "* iCalendar requires custom time zone definitions within a single calendar component.",
      "ja": "* iCalendarは、単一のカレンダーコンポーネント内でカスタムタイムゾーン定義を必要とします。"
    },
    {
      "indent": 3,
      "text": "* iCalendar's definition of recurrence rules is ambiguous and has resulted in differing interpretations, even between experienced calendar developers.",
      "ja": "* ICalendarの繰り返し規則の定義はあいまいですが、経験豊富なカレンダー開発者の間でさえも、解釈が異なりました。"
    },
    {
      "indent": 3,
      "text": "* The iCalendar format itself causes interoperability issues due to misuse of CRLF-terminated strings, line continuations, and subtle differences among iCalendar parsers.",
      "ja": "* iCalendarフォーマット自体は、CRLF終端文字列の誤用、ラインの継続、ICalendarパーサー間の微妙な違いにより、相互運用性の問題が発生します。"
    },
    {
      "indent": 3,
      "text": "In recent years, many new products and services have appeared that wish to use a JSON representation of calendar data within their APIs. The JSON format for iCalendar data, jCal [RFC7265], is a direct mapping between iCalendar and JSON. In its effort to represent full iCalendar semantics, it inherits all the same pitfalls and uses a complicated JSON structure.",
      "ja": "近年、API内のカレンダーデータのJSON表現を使用することを望む多くの新製品やサービスが現れています。iCalendarデータ、JCAL [RFC7265]のJSON形式は、iCalendarとJSON間の直接マッピングです。フルICalendarセマンティクスを表すための努力において、それはすべて同じ落とし穴を継承し、そして複雑なJSON構造を使用します。"
    },
    {
      "indent": 3,
      "text": "As a consequence, since the standardization of jCal, the majority of implementations and service providers either kept using iCalendar or came up with their own proprietary JSON representations, which are incompatible with each other and often suffer from common pitfalls, such as storing event start times in UTC (which become incorrect if the time zone's rules change in the future). JSCalendar meets the demand for JSON-formatted calendar data that is free of such known problems and provides a standard representation as an alternative to the proprietary formats.",
      "ja": "結果として、JCALの標準化以来、大多数の実装およびサービスプロバイダはICalendarを使用して保持されているか、または独自の独自のJSON表現を実現し、それは互いに互換性があり、イベント開始時間の保存などの一般的な落とし穴に影響を与えます。UTC（タイムゾーンのルールが将来変更された場合に間違っているようになる）JScalendarは、そのような既知の問題を解放し、独自のフォーマットに代わるものとして標準的な表現を提供するJSON形式のカレンダーデータの需要を満たしています。"
    },
    {
      "indent": 0,
      "text": "1.2. Notational Conventions",
      "section_title": true,
      "ja": "1.2. 表記規則"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 3,
      "text": "The underlying format used for this specification is JSON. Consequently, the terms \"object\" and \"array\" as well as the four primitive types (strings, numbers, booleans, and null) are to be interpreted as described in Section 1 of [RFC8259].",
      "ja": "この仕様に使用される基礎となるフォーマットはJSONです。その結果、「オブジェクト」および「配列」および4つのプリミティブタイプ（文字列、数字、ブール値、およびNULL）は、[RFC8259]のセクション1に記載されているように解釈されるべきである。"
    },
    {
      "indent": 3,
      "text": "Some examples in this document contain \"partial\" JSON documents used for illustrative purposes. In these examples, an ellipsis \"...\" is used to indicate a portion of the document that has been removed for compactness.",
      "ja": "この文書のいくつかの例には、例示の目的で使用される「部分的な」JSON文書が含まれています。これらの例では、省略記号「...」は、コンパクトさのために取り除かれた文書の一部を示すために使用される。"
    },
    {
      "indent": 0,
      "text": "1.3. Type Signatures",
      "section_title": true,
      "ja": "1.3. タイプシグネチャー"
    },
    {
      "indent": 3,
      "text": "Type signatures are given for all JSON values in this document. The following conventions are used:",
      "ja": "この文書内のすべてのJSON値に対してタイプ署名が与えられます。以下の表記法が使用されます。"
    },
    {
      "indent": 3,
      "text": "\"*\": The type is undefined (the value could be any type, although permitted values may be constrained by the context of this value).",
      "ja": "\"*\"：タイプは未定義です（値は任意のタイプかもしれませんが、許可された値はこの値のコンテキストによって制約されるかもしれません）。"
    },
    {
      "indent": 3,
      "text": "\"String\": This is the JSON string type.",
      "ja": "\"string\"：これはJSON文字列型です。"
    },
    {
      "indent": 3,
      "text": "\"Number\": This is the JSON number type.",
      "ja": "\"number\"：これはJSON番号の種類です。"
    },
    {
      "indent": 3,
      "text": "\"Boolean\": This is the JSON boolean type.",
      "ja": "\"boolean\"：これはJSONブール型です。"
    },
    {
      "indent": 3,
      "text": "\"A[B]\": The keys are all of type \"A\" and the values are all of type \"B\" for a JSON object.",
      "ja": "\"A [B]\"：キーはすべて \"A\"のすべてであり、JSONオブジェクトの値はすべて \"B\"のすべてです。"
    },
    {
      "indent": 3,
      "text": "\"A[]\": There is an array of values of type \"A\"",
      "ja": "\"a []\"： \"a\"タイプの値の配列があります"
    },
    {
      "indent": 3,
      "text": "\"A|B\": The value is either of type \"A\" or of type \"B\".",
      "ja": "\"A | B\"：値は \"a\"の型または \"b\"のどちらかである。"
    },
    {
      "indent": 3,
      "text": "Other types may also be given; their representations are defined elsewhere in this document.",
      "ja": "他の種類も与えられてもよい。それらの表現はこの文書の他の場所で定義されています。"
    },
    {
      "indent": 0,
      "text": "1.4. Data Types",
      "section_title": true,
      "ja": "1.4. データ型"
    },
    {
      "indent": 3,
      "text": "In addition to the standard JSON data types, the following data types are used in this specification:",
      "ja": "標準のJSONデータ型に加えて、この仕様では以下のデータ型が使用されています。"
    },
    {
      "indent": 0,
      "text": "1.4.1. Id",
      "section_title": true,
      "ja": "1.4.1. ID."
    },
    {
      "indent": 3,
      "text": "Where \"Id\" is given as a data type, it means a \"String\" of at least 1 and a maximum of 255 octets in size, and it MUST only contain characters from the \"URL and Filename Safe\" base64url alphabet, as defined in Section 5 of [RFC4648], excluding the pad character (\"=\"). This means the allowed characters are the ASCII alphanumeric characters (\"A-Za-z0-9\"), hyphen (\"-\"), and underscore (\"_\").",
      "ja": "「ID」がデータ型として与えられている場合、それは少なくとも1と最大255オクテットのサイズの「文字列」を意味し、で定義されているように、「URLとファイル名安全」のBase64URLアルファベットの文字のみを含める必要があります。パッド文字（ \"=\"）を除く[RFC4648]のセクション5。つまり、許可されている文字は、ASCII英数字（ \"A-ZA-Z0-9\"）、ハイフン（ \" - \"）、およびアンダースコア（ \"_\"）です。"
    },
    {
      "indent": 3,
      "text": "In many places in JSCalendar, a JSON map is used where the map keys are of type Id and the map values are all the same type of object. This construction represents an unordered set of objects, with the added advantage that each entry has a name (the corresponding map key). This allows for more concise patching of objects, and, when applicable, for the objects in question to be referenced from other objects within the JSCalendar object.",
      "ja": "JScalendarの多くの場所では、JSONマップが使用され、地図キーがID型であり、マップ値はすべて同じ種類のオブジェクトである場合に使用されます。この構造は、順序付けられていないオブジェクトのセットを表し、各エントリに名前（対応するマップキー）があるという追加の利点があります。これにより、オブジェクトのより簡潔なパッチが適用され、該当する場合は、問題のオブジェクトをJScalendarオブジェクト内の他のオブジェクトから参照することができます。"
    },
    {
      "indent": 3,
      "text": "Unless otherwise specified for a particular property, there are no uniqueness constraints on an Id value (other than, of course, the requirement that you cannot have two values with the same key within a single JSON map). For example, two Event objects might use the same Ids in their respective \"links\" properties or, within the same Event object, the same Id could appear in the \"participants\" and \"alerts\" properties. These situations do not imply any semantic connections among the objects.",
      "ja": "特定のプロパティに対して特に指定されていない限り、ID値に一意性の制約はありません（もちろん、単一のJSONマップ内に同じキーで2つの値を持つことができない要件）。たとえば、2つのイベントオブジェクトは、それぞれの \"Links\"プロパティで同じIDを使用するか、同じイベントオブジェクト内で同じIDが \"参加者\"および \"alerts\"プロパティに表示される可能性があります。これらの状況は、オブジェクト間の意味のある接続を意味するものではありません。"
    },
    {
      "indent": 0,
      "text": "1.4.2. Int",
      "section_title": true,
      "ja": "1.4.2. int."
    },
    {
      "indent": 3,
      "text": "Where \"Int\" is given as a data type, it means an integer in the range -2^53+1 <= value <= 2^53-1, the safe range for integers stored in a floating-point double, represented as a JSON \"Number\".",
      "ja": "「int」がデータ型として与えられている場合、それは範囲-2 ^ 53 1≦value <= 2 ^ 53-1の範囲内の整数を意味し、浮動小数点ダブルに格納されている整数の安全範囲。JSON「番号」"
    },
    {
      "indent": 0,
      "text": "1.4.3. UnsignedInt",
      "section_title": true,
      "ja": "1.4.3. 陰額"
    },
    {
      "indent": 3,
      "text": "Where \"UnsignedInt\" is given as a data type, it means an integer in the range 0 <= value <= 2^53-1, represented as a JSON \"Number\".",
      "ja": "「unsignedInt」がデータ型として与えられている場合、それはJSON \"番号\"として表される範囲0≦value <= 2 ^ 53-1の整数を意味します。"
    },
    {
      "indent": 0,
      "text": "1.4.4. UTCDateTime",
      "section_title": true,
      "ja": "1.4.4. utcdateTime"
    },
    {
      "indent": 3,
      "text": "This is a string in the \"date-time\" [RFC3339] format, with the further restrictions that any letters MUST be in uppercase, and the time offset MUST be the character \"Z\". Fractional second values MUST NOT be included unless non-zero and MUST NOT have trailing zeros, to ensure there is only a single representation for each date-time.",
      "ja": "これは「日付 - 時刻」[RFC3339]フォーマットで、任意の文字が大文字でなければならず、時間オフセットは文字 \"z\"でなければなりません。ゼロ以外の場合は、末尾のゼロを持たずに、各日付 - 時刻の単一の表現があることを確認するために、小数点以下の値を含めてはいけません。"
    },
    {
      "indent": 3,
      "text": "For example, \"2010-10-10T10:10:10.003Z\" is conformant, but \"2010-10-10T10:10:10.000Z\" is invalid and is correctly encoded as \"2010-10-10T10:10:10Z\".",
      "ja": "たとえば、 \"2010-10-10t10：10：10.003z\"は準拠ですが、 \"2010-10-10t10：10：10.000z\"が無効で、「2010-10-10t10：10：10z」として正しくエンコードされています。"
    },
    {
      "indent": 0,
      "text": "1.4.5. LocalDateTime",
      "section_title": true,
      "ja": "1.4.5. LocalDateTime"
    },
    {
      "indent": 3,
      "text": "This is a date-time string with no time zone/offset information. It is otherwise in the same format as UTCDateTime, including fractional seconds. For example, \"2006-01-02T15:04:05\" and \"2006-01-02T15:04:05.003\" are both valid. The time zone to associate with the LocalDateTime comes from the \"timeZone\" property of the JSCalendar object (see Section 4.7.1). If no time zone is specified, the LocalDateTime is \"floating\". Floating date-times are not tied to any specific time zone. Instead, they occur in each time zone at the given wall-clock time (as opposed to the same instant point in time).",
      "ja": "これは、時間帯/オフセット情報がない日時文字列です。それは、小数秒を含むUTCDateTimeと同じ形式である。たとえば、 \"2006-01-02T15：04：05\"と \"2006-01-02T15：04：05.003\"が有効です。LocalDateTimeに関連付けるタイムゾーンは、JScalendarオブジェクトの \"timezone\"プロパティから来ています（セクション4.7.1を参照）。タイムゾーンが指定されていない場合、LocalDateTimeは「フローティング」です。フローティングの日時は特定のタイムゾーンに接続されていません。代わりに、それらは与えられた壁掛け時刻の各時間帯で（同じ瞬間的な時点とは対照的に）発生します。"
    },
    {
      "indent": 3,
      "text": "A time zone may have a period of discontinuity, for example, a change from standard time to daylight savings time. When converting local date-times that fall in the discontinuity to UTC, the offset before the transition MUST be used.",
      "ja": "タイムゾーンは、例えば、標準時から夏時間への変更などの期間を有することができる。不連続の日付をUTCに変換するときは、遷移前のオフセットを使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "For example, in the America/Los_Angeles time zone, the date-time 2020-11-01T01:30:00 occurs twice: before the daylight savings time (DST) transition with a UTC offset of -07:00 and again after the transition with an offset of -08:00. When converting to UTC, we therefore use the offset before the transition (-07:00), so it becomes 2020-11-01T08:30:00Z.",
      "ja": "たとえば、アメリカ/ LOS_ANGELESタイムゾーンでは、日付時間2020-11-01T01：30：00が2回発生します。夏時間（DST）が-07：00の遷移後、遷移後のUTCオフセットの遷移-08：00のオフセットで。UTCに変換するとき、我々は遷移前のオフセット（-07：00）を使用するので、2020-11-01t08：30：00Zになります。"
    },
    {
      "indent": 3,
      "text": "Similarly, in the Australia/Melbourne time zone, the date-time 2020-10-04T02:30:00 does not exist; the clocks are moved forward one hour for DST on that day at 02:00. However, such a value may appear during calculations (see duration semantics in Section 1.4.6) or due to a change in time zone rules (so it was valid when the event was first created). Again, it is interpreted as though the offset before the transition is in effect (+10:00); therefore, when converted to UTC, we get 2020-10-03T16:30:00Z.",
      "ja": "同様に、オーストラリア/メルボルンタイムゾーンでは、日付時間2020-10-04T02：30：00は存在しません。時計は、その日のDSTの1時間前に02:00に移動されます。ただし、このような値は計算中に現れることがあります（セクション1.4.6の期間セマンティクスを参照）、またはタイムゾーンのルールの変更が原因で表示される場合があります（そのため、イベントが最初に作成されたときに有効でした）。繰り返しますが、遷移が有効な前のオフセットがあるかのように解釈されます（10:00）。したがって、UTCに変換されると、2020-10-03T16：30：00Zが得られます。"
    },
    {
      "indent": 0,
      "text": "1.4.6. Duration",
      "section_title": true,
      "ja": "1.4.6. 期間"
    },
    {
      "indent": 3,
      "text": "Where Duration is given as a type, it means a length of time represented by a subset of the ISO 8601 duration format, as specified by the following ABNF [RFC5234]:",
      "ja": "期間はタイプとして与えられている場合、それは次のABNF [RFC5234]で指定されているISO 8601期間形式のサブセットによって表される時間を意味します。"
    },
    {
      "indent": 7,
      "text": "dur-secfrac = \".\" 1*DIGIT\ndur-second  = 1*DIGIT [dur-secfrac] \"S\"\ndur-minute  = 1*DIGIT \"M\" [dur-second]\ndur-hour    = 1*DIGIT \"H\" [dur-minute]\ndur-time    = \"T\" (dur-hour / dur-minute / dur-second)\ndur-day     = 1*DIGIT \"D\"\ndur-week    = 1*DIGIT \"W\"\ndur-cal     = (dur-week [dur-day] / dur-day)",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 7,
      "text": "duration = \"P\" (dur-cal [dur-time] / dur-time)",
      "ja": "期間=「P」（DURCAL [期日] /期日）"
    },
    {
      "indent": 3,
      "text": "In addition, the duration MUST NOT include fractional second values unless the fraction is non-zero. Fractional second values MUST NOT have trailing zeros to ensure there is only a single representation for each duration.",
      "ja": "さらに、分数がゼロでない限り、持続時間は分数の第2の値を含んではいけません。各期間に単一の表現しかないことを確認するために、分数の2つの値に末尾のゼロを持たない必要があります。"
    },
    {
      "indent": 3,
      "text": "A duration specifies an abstract number of weeks, days, hours, minutes, and/or seconds. A duration specified using weeks or days does not always correspond to an exact multiple of 24 hours. The number of hours/minutes/seconds may vary if it overlaps a period of discontinuity in the event's time zone, for example, a change from standard time to daylight savings time. Leap seconds MUST NOT be considered when adding or subtracting a duration to/from a LocalDateTime.",
      "ja": "期間は、抽象数、日数、数分、または秒の抽象数を指定します。週または日数を使用して指定された期間は、必ずしも24時間の正確な倍数に対応していません。時間/分/秒数は、イベントのタイムゾーンの不連続期間、たとえば標準時から夏時間までの変更など、変化する場合があります。LocalDateTimeへの期間を追加または減算するときは、LEAP秒を考慮しないでください。"
    },
    {
      "indent": 3,
      "text": "To add a duration to a LocalDateTime:",
      "ja": "localDateTimeに期間を追加するには："
    },
    {
      "indent": 3,
      "text": "1. Add any week or day components of the duration to the date. A week is always the same as seven days.",
      "ja": "1. 日付の期間の毎週または日々を追加します。一週間は常に7日と同じです。"
    },
    {
      "indent": 3,
      "text": "2. If a time zone applies to the LocalDateTime, convert it to a UTCDateTime following the semantics in Section 1.4.5.",
      "ja": "2. タイムゾーンがLocalDateTimeに適用されている場合は、セマンティクスに従ってそれをUTCDateTimeに変換してください。"
    },
    {
      "indent": 3,
      "text": "3. Add any hour, minute, or second components of the duration (in absolute time).",
      "ja": "3. 期間の任意の時間、分、または2番目のコンポーネントを追加します（絶対時間）。"
    },
    {
      "indent": 3,
      "text": "4. Convert the resulting UTCDateTime back to a LocalDateTime in the time zone that applies.",
      "ja": "4. 結果のUTCDateTimeを適用するタイムゾーン内のLocalDateTimeに変換します。"
    },
    {
      "indent": 3,
      "text": "To subtract a duration from a LocalDateTime, the steps apply in reverse:",
      "ja": "LocalDateTimeから持続時間を差し引くために、ステップは逆に適用されます。"
    },
    {
      "indent": 3,
      "text": "1. If a time zone applies to the LocalDateTime, convert it to UTC following the semantics in Section 1.4.5.",
      "ja": "1. タイムゾーンがLocalDateTimeに適用されている場合は、セマンティクスに従ってそれをUTCに変換してください。"
    },
    {
      "indent": 3,
      "text": "2. Subtract any hour, minute, or second components of the duration (in absolute time).",
      "ja": "2. 期間（絶対時間）の1時間、分、または2番目の構成要素を減算します。"
    },
    {
      "indent": 3,
      "text": "3. Convert the resulting UTCDateTime back to LocalDateTime in the time zone that applies.",
      "ja": "3. 結果のUTCDateTimeを適用するタイムゾーンでLocalDateTimeに変換します。"
    },
    {
      "indent": 3,
      "text": "4. Subtract any week or day components of the duration from the date.",
      "ja": "4. 日付から持続時間の週または日々の成分を減算します。"
    },
    {
      "indent": 3,
      "text": "5. If the resulting time does not exist on the date due to a discontinuity in the time zone, use the semantics in Section 1.4.5 to convert to UTC and back to get a valid LocalDateTime.",
      "ja": "5. タイムゾーンの不連続性により、結果が日付に存在しない場合は、セクション1.4.5のセマンティクスを使用してUTCに変換し、有効なLocalDateTimeを取得します。"
    },
    {
      "indent": 3,
      "text": "These semantics match the iCalendar DURATION value type ([RFC5545], Section 3.3.6).",
      "ja": "これらのセマンティクスは、iCalendar Duration Value Type（[RFC5545]、セクション3.3.6）と一致します。"
    },
    {
      "indent": 0,
      "text": "1.4.7. SignedDuration",
      "section_title": true,
      "ja": "1.4.7. 単位"
    },
    {
      "indent": 3,
      "text": "A SignedDuration represents a length of time that may be positive or negative and is typically used to express the offset of a point in time relative to an associated time. It is represented as a Duration, optionally preceded by a sign character. It is specified by the following ABNF:",
      "ja": "手順は、正または負の時間の長さを表し、通常、関連する時間に対して時点のオフセットを表現するために使用されます。それは任意選択で符号文字が先行する期間として表される。これは次のABNFで指定されています。"
    },
    {
      "indent": 3,
      "text": "signed-duration = [\"+\" / \"-\"] duration",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "A negative sign indicates a point in time at or before the associated time; a positive or no sign indicates a time at or after the associated time.",
      "ja": "負の符号は、関連する時間以降の時点を示しています。正またはなし記号は、関連する時間以降の時間を示します。"
    },
    {
      "indent": 0,
      "text": "1.4.8. TimeZoneId",
      "section_title": true,
      "ja": "1.4.8. タイムゾーン"
    },
    {
      "indent": 3,
      "text": "Where \"TimeZoneId\" is given as a data type, it means a \"String\" that is either a time zone name in the IANA Time Zone Database [TZDB] or a custom time zone identifier defined in the \"timeZones\" property (see Section 4.7.2).",
      "ja": "「TimeZoneID」がデータ型として与えられている場合は、IANAタイムゾーンデータベース[TZDB]のタイムゾーン名または「TimeZones」プロパティで定義されているカスタムタイムゾーンIDのいずれかである「文字列」を意味します（セクション4.7を参照）。.2）。"
    },
    {
      "indent": 3,
      "text": "Where an IANA time zone is specified, the zone rules of the respective zone records apply. Custom time zones are interpreted as described in Section 4.7.2.",
      "ja": "IANAタイムゾーンが指定されている場合、それぞれのゾーンレコードのゾーンルールが適用されます。カスタムタイムゾーンは、セクション4.7.2で説明されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "1.4.9. PatchObject",
      "section_title": true,
      "ja": "1.4.9. パッチオブジェクト"
    },
    {
      "indent": 3,
      "text": "A PatchObject is of type \"String[*]\" and represents an unordered set of patches on a JSON object. Each key is a path represented in a subset of the JSON Pointer format [RFC6901]. The paths have an implicit leading \"/\", so each key is prefixed with \"/\" before applying the JSON Pointer evaluation algorithm.",
      "ja": "PatchObjectは \"string [*]\"タイプです、そしてJSONオブジェクト上の順序付けられていないパッチのセットを表します。各キーは、JSONポインタ形式[RFC6901]のサブセットに表されるパスです。パスには暗黙の先行 \"/\"があるため、JSONポインタ評価アルゴリズムを適用する前に各キーの前に「/」が付いています。"
    },
    {
      "indent": 3,
      "text": "A patch within a PatchObject is only valid if all of the following conditions apply:",
      "ja": "以下のすべての条件が適用されている場合にのみ、PatchObject内のパッチが有効です。"
    },
    {
      "indent": 3,
      "text": "1. The pointer MUST NOT reference inside an array (i.e., you MUST NOT insert/delete from an array; the array MUST be replaced in its entirety instead).",
      "ja": "1. ポインタは配列内を参照してはいけません（すなわち、配列から挿入/削除してはいけません。代わりに配列全体が置き換えられなければならない）。"
    },
    {
      "indent": 3,
      "text": "2. All parts prior to the last (i.e., the value after the final slash) MUST already exist on the object being patched.",
      "ja": "2. 最後のすべての部分（すなわち、最後のスラッシュ後の値）が、パッチが適用されているオブジェクトにすでに存在している必要があります。"
    },
    {
      "indent": 3,
      "text": "3. There MUST NOT be two patches in the PatchObject where the pointer of one is the prefix of the pointer of the other, e.g., \"alerts/1/offset\" and \"alerts\".",
      "ja": "3. PatchObjectに2つのパッチがありません.1つのポインタは、「Alerts / 1 / Offset」と「警告」のポインタの接頭辞です。"
    },
    {
      "indent": 3,
      "text": "4. The value for the patch MUST be valid for the property being set (of the correct type and obeying any other applicable restrictions), or, if null, the property MUST be optional.",
      "ja": "4. パッチの値は、設定されているプロパティが設定されている（正しいタイプの）プロパティが有効でなければなりません（正しいタイプと他の適用可能な制限事項）、またはNULLの場合、プロパティはオプションである必要があります。"
    },
    {
      "indent": 3,
      "text": "The value associated with each pointer determines how to apply that patch:",
      "ja": "各ポインタに関連付けられている値によって、そのパッチを適用する方法が決まります。"
    },
    {
      "indent": 3,
      "text": "* If null, remove the property from the patched object. If the key is not present in the parent, this a no-op.",
      "ja": "* NULLの場合は、パッチが付いているオブジェクトのプロパティを削除します。キーが親に存在しない場合、これはNOOPです。"
    },
    {
      "indent": 3,
      "text": "* If non-null, set the value given as the value for this property (this may be a replacement or addition to the object being patched).",
      "ja": "* null以外の場合は、このプロパティの値として指定された値を設定します（これは、パッチが適用されているオブジェクトへの置き換えまたは追加になります）。"
    },
    {
      "indent": 3,
      "text": "A PatchObject does not define its own \"@type\" property (see Section 4.1.1). An \"@type\" property in a patch MUST be handled as any other patched property value.",
      "ja": "PatchObjectは独自の \"@type\"プロパティを定義しません（セクション4.1.1を参照）。パッチ内の \"@type\"プロパティは、他のどのパッチ適用されたプロパティ値として処理する必要があります。"
    },
    {
      "indent": 3,
      "text": "Implementations MUST reject a PatchObject in its entirety if any of its patches are invalid. Implementations MUST NOT apply partial patches.",
      "ja": "そのパッチのいずれかが無効である場合、実装はその全体が完全に拒否されなければなりません。実装は部分的なパッチを適用してはいけません。"
    },
    {
      "indent": 3,
      "text": "The PatchObject format is used to significantly reduce file size and duplicated content when specifying variations to a common object, such as with recurring events or when translating the data into multiple languages. It can also better preserve semantic intent if only the properties that should differ between the two objects are patched. For example, if one person is not going to a particular instance of a regularly scheduled event, in iCalendar, you would have to duplicate the entire event in the override. In JSCalendar, this is a small patch to show the difference. As only this property is patched, if the location of the event is changed, the occurrence will automatically still inherit this.",
      "ja": "PatchObjectフォーマットは、繰り返しイベントやデータを複数の言語に変換するときなど、共通のオブジェクトにバリエーションを指定するときに、ファイルサイズと重複コンテンツを大幅に削減するために使用されます。2つのオブジェクト間で異なる必要があるプロパティのみがパッチが適用されている場合は、セマンティックインテントをよりよく保存することもできます。たとえば、1人の人が定期的にスケジュールされたイベントの特定のインスタンスに行かない場合は、iCalendarで、オーバーライドでイベント全体を複製する必要があります。JScalendarでは、違いを示すための小さなパッチです。このプロパティのみがパッチされているので、イベントの場所が変更された場合、発生は自動的にこれを継承します。"
    },
    {
      "indent": 0,
      "text": "1.4.10. Relation",
      "section_title": true,
      "ja": "1.4.10. 関係"
    },
    {
      "indent": 3,
      "text": "A Relation object defines the relation to other objects, using a possibly empty set of relation types. The object that defines this relation is the linking object, while the other object is the linked object. A Relation object has the following properties:",
      "ja": "関係オブジェクトは、空のリレーションタイプのセットを使用して、他のオブジェクトとの関係を定義します。この関係を定義するオブジェクトはリンクオブジェクトですが、もう一方のオブジェクトはリンクされたオブジェクトです。Relationオブジェクトには、次のプロパティがあります。"
    },
    {
      "indent": 3,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"Relation\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは「関係」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "relation: \"String[Boolean]\" (optional, default: empty Object) This describes how the linked object is related to the linking object. The relation is defined as a set of relation types. If empty, the relationship between the two objects is unspecified.",
      "ja": "関係： \"string [boolean]（オプション、デフォルト：空のオブジェクト）リンクされたオブジェクトがリンクオブジェクトに関連する方法を説明します。関係は一連の関係タイプとして定義されます。空の場合、2つのオブジェクト間の関係は指定されていません。"
    },
    {
      "indent": 6,
      "text": "Keys in the set MUST be one of the following values, specified in the property definition where the Relation object is used, a value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3):",
      "ja": "セット内のキーは、関係オブジェクトが使用されているプロパティ定義、IANA \"JScalendar Enum値\"レジストリ、またはベンダー固有の値に登録されている値で指定されている、次の値のいずれかです。"
    },
    {
      "indent": 6,
      "text": "\"first\": The linked object is the first in a series the linking object is part of.",
      "ja": "\"first\"：リンクされたオブジェクトはシリーズの最初のものです。リンクオブジェクトはの一部です。"
    },
    {
      "indent": 6,
      "text": "\"next\": The linked object is next in a series the linking object is part of.",
      "ja": "\"next\"：リンクされたオブジェクトは次のシリーズの中で次のものです。"
    },
    {
      "indent": 6,
      "text": "\"child\": The linked object is a subpart of the linking object.",
      "ja": "「子」：リンクされたオブジェクトは、リンクオブジェクトのサブパートです。"
    },
    {
      "indent": 6,
      "text": "\"parent\": The linking object is a subpart of the linked object.",
      "ja": "\"親\"：リンクオブジェクトはリンクされたオブジェクトのサブパートです。"
    },
    {
      "indent": 6,
      "text": "The value for each key in the map MUST be true.",
      "ja": "マップ内の各キーの値はtrueでなければなりません。"
    },
    {
      "indent": 0,
      "text": "1.4.11. Link",
      "section_title": true,
      "ja": "1.4.11. リンク"
    },
    {
      "indent": 3,
      "text": "A Link object represents an external resource associated with the linking object. It has the following properties:",
      "ja": "リンクオブジェクトは、リンクオブジェクトに関連付けられている外部リソースを表します。次のプロパティがあります。"
    },
    {
      "indent": 3,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"Link\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは「リンク」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "href: \"String\" (mandatory) This is a URI [RFC3986] from which the resource may be fetched.",
      "ja": "HREF： \"String\"（必須）これはリソースがフェッチされる可能性があるURI [RFC3986]です。"
    },
    {
      "indent": 6,
      "text": "This MAY be a \"data:\" URL [RFC2397], but it is recommended that the file be hosted on a server to avoid embedding arbitrarily large data in JSCalendar object instances.",
      "ja": "これは \"Data：\" URL [RFC2397]でもかまいませんが、JScalendarオブジェクトインスタンスで任意の大きなデータを埋め込むのを防ぐために、ファイルをサーバー上でホストすることをお勧めします。"
    },
    {
      "indent": 3,
      "text": "cid: \"String\" (optional) This MUST be a valid \"content-id\" value according to the definition of Section 2 of [RFC2392]. The value MUST be unique within this Link object but has no meaning beyond that. It MAY be different from the link id for this Link object.",
      "ja": "cid： \"string\"（オプション）[RFC2392]のセクション2の定義によると、これは有効な \"content-id\"値でなければなりません。値はこのリンクオブジェクト内で一意である必要がありますが、それを超えて意味がありません。このリンクオブジェクトのリンクIDとは異なる場合があります。"
    },
    {
      "indent": 3,
      "text": "contentType: \"String\" (optional) This is the media type [RFC6838] of the resource, if known.",
      "ja": "contentType： \"string\"（オプション）既知であれば、これはリソースのメディアタイプ[RFC6838]です。"
    },
    {
      "indent": 3,
      "text": "size: \"UnsignedInt\" (optional) This is the size, in octets, of the resource when fully decoded (i.e., the number of octets in the file the user would download), if known. Note that this is an informational estimate, and implementations must be prepared to handle the actual size being quite different when the resource is fetched.",
      "ja": "size： \"unsignedint\"（オプション）これは、既知であれば、完全に復号されたときのリソースのサイズ（すなわち、ユーザがダウンロードするファイル内のオクテット数）であるサイズです。これは情報推定値であり、リソースが取り出されたときに実際のサイズがかなり異なることを処理するために実装を準備する必要があります。"
    },
    {
      "indent": 3,
      "text": "rel: \"String\" (optional) This identifies the relation of the linked resource to the object. If set, the value MUST be a relation type from the IANA \"Link Relations\" registry [LINKRELS], as established in [RFC8288].",
      "ja": "REL： \"string\"（オプション）リンクされているリソースの関係を識別します。設定されている場合、[RFC8288]で設定されているように、値はIANA \"Link Relations\" Registry [Linkrels]からの関係の種類でなければなりません。"
    },
    {
      "indent": 3,
      "text": "display: \"String\" (optional) This describes the intended purpose of a link to an image. If set, the \"rel\" property MUST be set to \"icon\". The value MUST be one of the following values, another value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3):",
      "ja": "表示： \"string\"（オプション）イメージへのリンクの目的を目的としています。設定されている場合は、 \"REL\"プロパティを \"icon\"に設定する必要があります。値は、IANA \"JScalendar enum値\"レジストリ、またはベンダー固有の値に登録されている別の値、またはベンダー固有の値のいずれかでなければなりません（セクション3.3を参照）。"
    },
    {
      "indent": 6,
      "text": "\"badge\": an image meant to be displayed alongside the title of the object",
      "ja": "「バッジ」：オブジェクトのタイトルと一緒に表示されることを意味する画像"
    },
    {
      "indent": 6,
      "text": "\"graphic\": a full image replacement for the object itself",
      "ja": "\"Graphic\"：オブジェクト自体のフル画像の置き換え"
    },
    {
      "indent": 6,
      "text": "\"fullsize\": an image that is used to enhance the object",
      "ja": "\"fullsize\"：オブジェクトの強化に使用されるイメージ"
    },
    {
      "indent": 6,
      "text": "\"thumbnail\": a smaller variant of \"fullsize\" to be used when space for the image is constrained",
      "ja": "「サムネイル」：画像のスペースが制約されているときに使用される「フルサイズ」のより小さい変形"
    },
    {
      "indent": 3,
      "text": "title: \"String\" (optional) This is a human-readable, plain-text description of the resource.",
      "ja": "title： \"string\"（オプション）これはリソースの人間が読めるようなプレーンテキストの説明です。"
    },
    {
      "indent": 0,
      "text": "2. JSCalendar Objects",
      "section_title": true,
      "ja": "2. JScalendarオブジェクト"
    },
    {
      "indent": 3,
      "text": "This section describes the calendar object types specified by JSCalendar.",
      "ja": "JScalendarで指定されたカレンダーオブジェクトタイプについて説明します。"
    },
    {
      "indent": 0,
      "text": "2.1. Event",
      "section_title": true,
      "ja": "2.1. イベント"
    },
    {
      "indent": 3,
      "text": "Media type: \"application/jscalendar+json;type=event\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "An Event represents a scheduled amount of time on a calendar, typically a meeting, appointment, reminder, or anniversary. It is required to start at a certain point in time and typically has a non-zero duration. Multiple participants may partake in the event at multiple locations.",
      "ja": "イベントは、カレンダー、通常は会議、予定、リマインダー、または記念日の予定された時間を表します。ある時点で開始する必要があり、通常はゼロ以外の持続時間を持ちます。複数の参加者が複数の場所でイベントに参加することがあります。"
    },
    {
      "indent": 3,
      "text": "The @type (Section 4.1.1) property value MUST be \"Event\".",
      "ja": "@type（セクション4.1.1）プロパティ値は \"event\"でなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.2. Task",
      "section_title": true,
      "ja": "2.2. 仕事"
    },
    {
      "indent": 3,
      "text": "Media type: \"application/jscalendar+json;type=task\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "A Task represents an action item, assignment, to-do item, or work item. It may start and be due at certain points in time, take some estimated time to complete, and recur, none of which is required.",
      "ja": "タスクは、アクション項目、割り当て、TO-DO項目、または作業項目を表します。それは開始され、特定の時点で期限切れになるかもしれません、完了するまでの推定時間をかけて、どれも必須ではありません。"
    },
    {
      "indent": 3,
      "text": "The @type (Section 4.1.1) property value MUST be \"Task\".",
      "ja": "@Type（セクション4.1.1）プロパティ値は「タスク」でなければなりません。"
    },
    {
      "indent": 0,
      "text": "2.3. Group",
      "section_title": true,
      "ja": "2.3. グループ"
    },
    {
      "indent": 3,
      "text": "Media type: \"application/jscalendar+json;type=group\"",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "A Group is a collection of Event (Section 2.1) and/or Task (Section 2.2) objects. Typically, objects are grouped by topic (e.g., by keywords) or calendar membership.",
      "ja": "グループはイベントのコレクション（セクション2.1）および/またはタスク（セクション2.2）オブジェクトです。通常、オブジェクトはトピック（たとえばキーワードで）またはカレンダーメンバーシップによってグループ化されます。"
    },
    {
      "indent": 3,
      "text": "The @type (Section 4.1.1) property value MUST be \"Group\".",
      "ja": "@Type（セクション4.1.1）プロパティ値は \"Group\"でなければなりません。"
    },
    {
      "indent": 0,
      "text": "3. Structure of JSCalendar Objects",
      "section_title": true,
      "ja": "3. JScalendarオブジェクトの構造"
    },
    {
      "indent": 3,
      "text": "A JSCalendar object is a JSON object [RFC8259], which MUST be valid I-JSON (a stricter subset of JSON) [RFC7493]. Property names and values are case sensitive.",
      "ja": "JScalendarオブジェクトはJSONオブジェクト[RFC8259]です。これは有効なI-JSON（JSONのSlicterサブセット）[RFC7493]です。プロパティ名と値は大文字と小文字が区別されます。"
    },
    {
      "indent": 3,
      "text": "The object has a collection of properties, as specified in the following sections. Properties are specified as being either mandatory or optional. Optional properties may have a default value if explicitly specified in the property definition.",
      "ja": "次のセクションで指定されているように、オブジェクトにプロパティのコレクションがあります。プロパティは必須またはオプションのどちらでも指定されています。プロパティ定義で明示的に指定した場合、オプションのプロパティにはデフォルト値があります。"
    },
    {
      "indent": 0,
      "text": "3.1. Object Type",
      "section_title": true,
      "ja": "3.1. オブジェクトタイプ"
    },
    {
      "indent": 3,
      "text": "JSCalendar objects MUST name their type in the \"@type\" property if not explicitly specified otherwise for the respective object type. A notable exception to this rule is the PatchObject (Section 1.4.9).",
      "ja": "JScalendarオブジェクトは、それぞれのオブジェクトタイプに対して明示的に指定されていない場合は、「@type」プロパティでそれらの型に名前を付けなければなりません。この規則に対する注目すべき例外はPatchObjectです（セクション1.4.9）。"
    },
    {
      "indent": 0,
      "text": "3.2. Normalization and Equivalence",
      "section_title": true,
      "ja": "3.2. 正規化と等価性"
    },
    {
      "indent": 3,
      "text": "JSCalendar aims to provide unambiguous definitions for value types and properties but does not define a general normalization or equivalence method for JSCalendar objects and types. This is because the notion of equivalence might range from byte-level equivalence to semantic equivalence, depending on the respective use case. Normalization of JSCalendar objects is hindered because of the following reasons:",
      "ja": "JScalendarは、値の種類とプロパティの明確な定義を提供することを目的としていますが、JScalendarオブジェクトやタイプの一般的な正規化または同値メソッドを定義しません。これは、それぞれのユースケースに応じて、等価性の概念がバイトレベルの等価性からセマンティックな等価性に及ぶ可能性があるためです。以下の理由により、JScalendarオブジェクトの正規化が妨げられています。"
    },
    {
      "indent": 3,
      "text": "* Custom JSCalendar properties may contain arbitrary JSON values, including arrays. However, equivalence of arrays might or might not depend on the order of elements, depending on the respective property definition.",
      "ja": "* カスタムJScalendarプロパティには、配列を含む任意のJSON値が含まれている可能性があります。ただし、配列の等価性は、それぞれのプロパティ定義に応じて、要素の順序に依存しない場合があります。"
    },
    {
      "indent": 3,
      "text": "* Several JSCalendar property values are defined as URIs and media types, but normalization of these types is inherently protocol and scheme specific, depending on the use case of the equivalence definition (see Section 6 of [RFC3986]).",
      "ja": "* いくつかのJScalendarプロパティ値は、URIとメディアタイプとして定義されますが、これらのタイプの正規化は、等価定義のユースケースに応じて、本質的にプロトコルとスキーム固有です（[RFC3986]のセクション6を参照）。"
    },
    {
      "indent": 3,
      "text": "Considering this, the definition of equivalence and normalization is left to client and server implementations and to be negotiated by a calendar exchange protocol or defined elsewhere.",
      "ja": "これを考慮すると、等価性と正規化の定義は、クライアントとサーバーの実装に残り、カレンダー交換プロトコルによってネゴシエートされるか、または他の場所で定義されます。"
    },
    {
      "indent": 0,
      "text": "3.3. Vendor-Specific Property Extensions, Values, and Types",
      "section_title": true,
      "ja": "3.3. ベンダー固有のプロパティ拡張子、値、および型"
    },
    {
      "indent": 3,
      "text": "Vendors MAY add additional properties to the calendar object to support their custom features. To avoid conflict, the names of these properties MUST be prefixed by a domain name controlled by the vendor followed by a colon, e.g., \"example.com:customprop\". If the value is a new JSCalendar object, it either MUST include an \"@type\" property, or it MUST explicitly be specified to not require a type designator. The type name MUST be prefixed with a domain name controlled by the vendor.",
      "ja": "ベンダーは、カスタム機能をサポートするためにカレンダーオブジェクトに追加のプロパティを追加することがあります。競合を回避するためには、これらのプロパティの名前をベンダーによって制御されたドメイン名に続いてコロン、例えば「example.com:customprop」が付いている必要があります。値が新しいJScalendarオブジェクトの場合は、「@Type」プロパティを含める必要があります。または型指定子を必要としないように明示的に指定する必要があります。タイプ名は、ベンダーによって制御されているドメイン名を付ける必要があります。"
    },
    {
      "indent": 3,
      "text": "Some JSCalendar properties allow vendor-specific value extensions. Such vendor-specific values MUST be prefixed by a domain name controlled by the vendor followed by a colon, e.g., \"example.com:customrel\".",
      "ja": "いくつかのJScalendarプロパティはベンダー固有の値拡張機能を可能にします。そのようなベンダー固有の値は、ベンダーによって制御されたドメイン名に続いてコロン、例えば「example.com:Customrel」によって接頭辞める必要があります。"
    },
    {
      "indent": 3,
      "text": "Vendors are strongly encouraged to register any new property values or extensions that are useful to other systems as well, rather than use a vendor-specific prefix.",
      "ja": "ベンダーは、ベンダー固有のプレフィックスを使用するのではなく、他のシステムにも役立つ新しいプロパティ値または拡張機能を登録することを強くお勧めします。"
    },
    {
      "indent": 0,
      "text": "4. Common JSCalendar Properties",
      "section_title": true,
      "ja": "4. 一般的なJScalendarのプロパティ"
    },
    {
      "indent": 3,
      "text": "This section describes the properties that are common to the various JSCalendar object types. Specific JSCalendar object types may only support a subset of these properties. The object type definitions in Section 5 describe the set of supported properties per type.",
      "ja": "このセクションでは、さまざまなJScalendarオブジェクト型に共通のプロパティについて説明します。特定のJScalendarオブジェクトタイプは、これらのプロパティのサブセットしかサポートできません。セクション5のオブジェクトタイプ定義は、タイプごとにサポートされているプロパティのセットを示しています。"
    },
    {
      "indent": 0,
      "text": "4.1. Metadata Properties",
      "section_title": true,
      "ja": "4.1. メタデータのプロパティ"
    },
    {
      "indent": 0,
      "text": "4.1.1. @type",
      "section_title": true,
      "ja": "4.1.1. @タイプ"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (mandatory)",
      "ja": "タイプ： \"string\"（必須）"
    },
    {
      "indent": 3,
      "text": "This specifies the type that this object represents. The allowed value differs by object type and is defined in Sections 2.1, 2.2, and 2.3.",
      "ja": "これは、このオブジェクトが表すタイプを指定します。許容値はオブジェクトタイプによって異なり、セクション2.1,2.2、および2.3で定義されています。"
    },
    {
      "indent": 0,
      "text": "4.1.2. uid",
      "section_title": true,
      "ja": "4.1.2. UID."
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (mandatory)",
      "ja": "タイプ： \"string\"（必須）"
    },
    {
      "indent": 3,
      "text": "This is a globally unique identifier used to associate objects representing the same event, task, group, or other object across different systems, calendars, and views. For recurring events and tasks, the UID is associated with the base object and therefore is the same for all occurrences; the combination of the UID with a \"recurrenceId\" identifies a particular instance.",
      "ja": "これは、同じイベント、タスク、グループ、またはその他のオブジェクトを表すオブジェクトを異なるシステム、カレンダー、およびビューに関連付けるために使用されるグローバルに一意の識別子です。繰り返しイベントとタスクのために、UIDは基本オブジェクトに関連付けられ、したがってすべての出現には同じです。UIDと「RecurrenceID」との組み合わせは、特定のインスタンスを識別します。"
    },
    {
      "indent": 3,
      "text": "The generator of the identifier MUST guarantee that the identifier is unique. [RFC4122] describes a range of established algorithms to generate universally unique identifiers (UUIDs). UUID version 4, described in Section 4.4 of [RFC4122], is RECOMMENDED.",
      "ja": "識別子の発電機は、識別子が一意であることを保証しなければなりません。[RFC4122]は、普遍的に固有の識別子（UUID）を生成するためのさまざまなアルゴリズムの範囲を説明しています。[RFC4122]のセクション4.4で説明されているUUIDバージョン4をお勧めします。"
    },
    {
      "indent": 3,
      "text": "For compatibility with UIDs [RFC5545], implementations MUST be able to receive and persist values of at least 255 octets for this property, but they MUST NOT truncate values in the middle of a UTF-8 multi-octet sequence.",
      "ja": "UIDS [RFC5545]との互換性のために、実装はこのプロパティに対して少なくとも255オクテットの値を受信して持続することができなければなりませんが、UTF-8マルチオクテットシーケンスの途中で値を切り捨ててはなりません。"
    },
    {
      "indent": 0,
      "text": "4.1.3. relatedTo",
      "section_title": true,
      "ja": "4.1.3. に関連して"
    },
    {
      "indent": 3,
      "text": "Type: \"String[Relation]\" (optional)",
      "ja": "タイプ： \"String [Relation]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This relates the object to other JSCalendar objects. This is represented as a map of the UIDs of the related objects to information about the relation.",
      "ja": "これはオブジェクトを他のJScalendarオブジェクトに関連付けます。これは、関連オブジェクトのUIDの関係についての地図として表されます。"
    },
    {
      "indent": 3,
      "text": "If an object is split to make a \"this and future\" change to a recurrence, the original object MUST be truncated to end at the previous occurrence before this split, and a new object is created to represent all the occurrences after the split. A \"next\" relation MUST be set on the original object's \"relatedTo\" property for the UID of the new object. A \"first\" relation for the UID of the first object in the series MUST be set on the new object. Clients can then follow these UIDs to get the complete set of objects if the user wishes to modify them all at once.",
      "ja": "オブジェクトが「このと将来」を再発にするために分割されている場合、元のオブジェクトはこの分割の前に前のオカレンスで終了するように切り捨てられ、分割後のすべての出現を表すために新しいオブジェクトが作成されます。新しいオブジェクトのUIDのオリジナルのオブジェクトの「関連」プロパティに「次の」リレーションを設定する必要があります。シリーズ内の最初のオブジェクトのUIDの「最初の」関係を新しいオブジェクトに設定する必要があります。その後、クライアントはこれらのUIDに従って、ユーザーがそれらすべてを一度に変更したい場合は、オブジェクトの完全なセットを取得できます。"
    },
    {
      "indent": 0,
      "text": "4.1.4. prodId",
      "section_title": true,
      "ja": "4.1.4. Prodid."
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional)",
      "ja": "タイプ： \"string\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is the identifier for the product that last updated the JSCalendar object. This should be set whenever the data in the object is modified (i.e., whenever the \"updated\" property is set).",
      "ja": "これは、最後にJScalendarオブジェクトを更新した製品の識別子です。これは、オブジェクト内のデータが変更されるたびに設定されるべきです（すなわち、「更新された」プロパティが設定されるたびに）。"
    },
    {
      "indent": 3,
      "text": "The vendor of the implementation MUST ensure that this is a globally unique identifier, using some technique such as a Formal Public Identifier (FPI) value, as defined in [ISO.9070.1991].",
      "ja": "実装の仕入先は、[ISO.9070.1991]で定義されているように、正式な公開識別子（FPI）値などのいくつかの手法を使用して、これがグローバルに一意の識別子であることを確認する必要があります。"
    },
    {
      "indent": 3,
      "text": "This property SHOULD NOT be used to alter the interpretation of a JSCalendar object beyond the semantics specified in this document. For example, it is not to be used to further the understanding of nonstandard properties, a practice that is known to cause long-term interoperability problems.",
      "ja": "このプロパティは、このドキュメントで指定されたセマンティクスを超えてJScalendarオブジェクトの解釈を変更するために使用しないでください。例えば、標準的な特性の理解、長期的な相互運用性の問題を引き起こすことが知られている慣例の理解には、それを使用するべきではない。"
    },
    {
      "indent": 0,
      "text": "4.1.5. created",
      "section_title": true,
      "ja": "4.1.5. 作成した"
    },
    {
      "indent": 3,
      "text": "Type: \"UTCDateTime\" (optional)",
      "ja": "タイプ： \"utcdatetime\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is the date and time this object was initially created.",
      "ja": "これは、このオブジェクトが最初に作成された日時です。"
    },
    {
      "indent": 0,
      "text": "4.1.6. updated",
      "section_title": true,
      "ja": "4.1.6. 更新しました"
    },
    {
      "indent": 3,
      "text": "Type: \"UTCDateTime\" (mandatory)",
      "ja": "タイプ： \"utcdatetime\"（必須）"
    },
    {
      "indent": 3,
      "text": "This is the date and time the data in this object was last modified (or its creation date/time if not modified since).",
      "ja": "これは、このオブジェクト内のデータが最後に変更された日時（または未修正の場合は作成日時）です。"
    },
    {
      "indent": 0,
      "text": "4.1.7. sequence",
      "section_title": true,
      "ja": "4.1.7. 順位"
    },
    {
      "indent": 3,
      "text": "Type: \"UnsignedInt\" (optional, default: 0)",
      "ja": "タイプ： \"unsignedint\"（オプション、デフォルト：0）"
    },
    {
      "indent": 3,
      "text": "Initially zero, this MUST be incremented by one every time a change is made to the object, except if the change only modifies the \"participants\" property (see Section 4.4.6).",
      "ja": "最初はゼロ、これは変更が「参加者」プロパティのみを変更するのであれば、オブジェクトに対して変更が加えられるたびにこれを1つずつ増分する必要があります（セクション4.4.6を参照）。"
    },
    {
      "indent": 3,
      "text": "This is used as part of the iCalendar Transport-independent Interoperability Protocol (iTIP) [RFC5546] to know which version of the object a scheduling message relates to.",
      "ja": "これは、スケジューリングメッセージが関連するオブジェクトのバージョンのオブジェクトのバージョンを知るために、iCalendarトランスポート非依存型相互運用プロトコル（ITIP）[RFC5546]の一部として使用されます。"
    },
    {
      "indent": 0,
      "text": "4.1.8. method",
      "section_title": true,
      "ja": "4.1.8. 方法"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional)",
      "ja": "タイプ： \"string\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is the iTIP [RFC5546] method, in lowercase. This MUST only be present if the JSCalendar object represents an iTIP scheduling message.",
      "ja": "これは小文字のITIP [RFC5546]メソッドです。JScalendarオブジェクトがITIPスケジューリングメッセージを表す場合にのみ存在する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.2. What and Where Properties",
      "section_title": true,
      "ja": "4.2. 財産がどこで"
    },
    {
      "indent": 0,
      "text": "4.2.1. title",
      "section_title": true,
      "ja": "4.2.1. 題名"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional, default: empty String)",
      "ja": "タイプ： \"string\"（オプション、デフォルト：空の文字列）"
    },
    {
      "indent": 3,
      "text": "This is a short summary of the object.",
      "ja": "これはオブジェクトの短い要約です。"
    },
    {
      "indent": 0,
      "text": "4.2.2. description",
      "section_title": true,
      "ja": "4.2.2. description"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional, default: empty String)",
      "ja": "タイプ： \"string\"（オプション、デフォルト：空の文字列）"
    },
    {
      "indent": 3,
      "text": "This is a longer-form text description of the object. The content is formatted according to the \"descriptionContentType\" property.",
      "ja": "これはオブジェクトのより長い形式のテキストの説明です。コンテンツは、 \"descriptionContentType\"プロパティに従ってフォーマットされています。"
    },
    {
      "indent": 0,
      "text": "4.2.3. descriptionContentType",
      "section_title": true,
      "ja": "4.2.3. 説明コンテンツタイプ"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional, default: \"text/plain\")",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "This describes the media type [RFC6838] of the contents of the \"description\" property. Media types MUST be subtypes of type \"text\" and SHOULD be \"text/plain\" or \"text/html\" [MEDIATYPES]. They MAY include parameters, and the \"charset\" parameter value MUST be \"utf-8\", if specified. Descriptions of type \"text/html\" MAY contain \"cid\" URLs [RFC2392] to reference links in the calendar object by use of the \"cid\" property of the Link object.",
      "ja": "これにより、 \"description\"プロパティの内容のメディアタイプ[RFC6838]が説明されています。メディアタイプは、 \"text\"の型のサブタイプでなければならず、 \"Text / Plain\"または \"Text / HTML\" [MediaTypes]にする必要があります。それらにはパラメータを含めることができ、指定されている場合は \"charset\"パラメータ値は \"UTF-8\"でなければなりません。Type / HTMLの型の説明リンクオブジェクトの「CID」プロパティを使用して、カレンダーオブジェクト内のリンクを参照するための「CID」URL [RFC2392]を含めることができます。"
    },
    {
      "indent": 0,
      "text": "4.2.4. showWithoutTime",
      "section_title": true,
      "ja": "4.2.4. 見解"
    },
    {
      "indent": 3,
      "text": "Type: \"Boolean\" (optional, default: false)",
      "ja": "型： \"boolean\"（オプション、デフォルト：false）"
    },
    {
      "indent": 3,
      "text": "This indicates that the time is not important to display to the user when rendering this calendar object. An example of this is an event that conceptually occurs all day or across multiple days, such as \"New Year's Day\" or \"Italy Vacation\". While the time component is important for free-busy calculations and checking for scheduling clashes, calendars may choose to omit displaying it and/or display the object separately to other objects to enhance the user's view of their schedule.",
      "ja": "これは、このカレンダーオブジェクトをレンダリングするときに、時間がユーザーに表示されることが重要ではないことを示しています。この例は、「新年の日」や「イタリアの休暇」など、一日中または複数日にわたる概念的に発生するイベントです。時間成分が自由忙しい計算とスケジューリングの検査に重要な場合、カレンダーはそれを表示したり、そのスケジュールの表示を強化するために他のオブジェクトと別々にオブジェクトを別々に表示することを選択できます。"
    },
    {
      "indent": 3,
      "text": "Such events are also commonly known as \"all-day\" events.",
      "ja": "そのようなイベントは一般的に「終日」イベントとして知られています。"
    },
    {
      "indent": 0,
      "text": "4.2.5. locations",
      "section_title": true,
      "ja": "4.2.5. 居場所"
    },
    {
      "indent": 3,
      "text": "Type: \"Id[Location]\" (optional)",
      "ja": "タイプ： \"ID [場所]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is a map of location ids to Location objects, representing locations associated with the object.",
      "ja": "これは、オブジェクトに関連付けられている場所を表す場所オブジェクトへの場所IDのマップです。"
    },
    {
      "indent": 3,
      "text": "A Location object has the following properties. It MUST have at least one property other than the \"relativeTo\" property.",
      "ja": "ロケーションオブジェクトには、次のプロパティがあります。「Relativeto」プロパティ以外の少なくとも1つのプロパティが必要です。"
    },
    {
      "indent": 3,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"Location\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは「場所」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "name: \"String\" (optional) This is the human-readable name of the location.",
      "ja": "name： \"string\"（オプション）これは場所の人間が読める名前です。"
    },
    {
      "indent": 3,
      "text": "description: \"String\" (optional) This is the human-readable, plain-text instructions for accessing this location. This may be an address, set of directions, door access code, etc.",
      "ja": "説明： \"string\"（オプション）これはこの場所にアクセスするための人間が読めるようなプレーンテキストの指示です。これはアドレス、方向のセット、ドアアクセスコードなどです。"
    },
    {
      "indent": 3,
      "text": "locationTypes: \"String[Boolean]\" (optional) This is a set of one or more location types that describe this location. All types MUST be from the \"Location Types Registry\" [LOCATIONTYPES], as defined in [RFC4589]. The set is represented as a map, with the keys being the location types. The value for each key in the map MUST be true.",
      "ja": "locationTypes： \"string [boolean]\"（オプション）この場所を記述する1つ以上の場所タイプのセットです。[RFC4589]で定義されているように、すべてのタイプは[Location Types Registry] [LocationTypes]からでなければなりません。セットはマップとして表され、キーは位置タイプです。マップ内の各キーの値はtrueでなければなりません。"
    },
    {
      "indent": 3,
      "text": "relativeTo: \"String\" (optional) This specifies the relation between this location and the time of the JSCalendar object. This is primarily to allow events representing travel to specify the location of departure (at the start of the event) and location of arrival (at the end); this is particularly important if these locations are in different time zones, as a client may wish to highlight this information for the user.",
      "ja": "RelativeTo： \"string\"（オプション）これは、この場所とJScalendarオブジェクトの時間の関係を指定します。これは主に、出発地（イベント開始時）と到着の場所（最後）の場所を指定するために旅行を表すイベントを許可することです。クライアントがユーザーのこの情報を強調表示したい場合があるため、これは特に重要です。"
    },
    {
      "indent": 6,
      "text": "This MUST be one of the following values, another value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3). Any value the client or server doesn't understand should be treated the same as if this property is omitted.",
      "ja": "これは、次の値のいずれかでなければなりません。別の値は、IANA \"JScalendar Enum値\"レジストリ、またはベンダー固有の値に登録されている（セクション3.3を参照）。このプロパティを省略した場合は、クライアントまたはサーバーが理解していない値を扱う必要があります。"
    },
    {
      "indent": 6,
      "text": "\"start\": The event/task described by this JSCalendar object occurs at this location at the time the event/task starts.",
      "ja": "\"start\"：このJScalendarオブジェクトによって記述されたイベント/タスクは、イベント/タスクの起動時にこの場所に発生します。"
    },
    {
      "indent": 6,
      "text": "\"end\": The event/task described by this JSCalendar object occurs at this location at the time the event/task ends.",
      "ja": "\"end\"：このJScalendarオブジェクトによって記述されたイベント/タスクは、イベント/タスクが終了する時点でこの場所で行われます。"
    },
    {
      "indent": 3,
      "text": "timeZone: \"TimeZoneId\" (optional) This is a time zone for this location.",
      "ja": "TimeZone： \"timezoneID\"（オプション）これはこの場所のタイムゾーンです。"
    },
    {
      "indent": 3,
      "text": "coordinates: \"String\" (optional) This is a \"geo:\" URI [RFC5870] for the location.",
      "ja": "座標： \"string\"（オプション）場所の \"GEO：\" URI [RFC5870]です。"
    },
    {
      "indent": 3,
      "text": "links: \"Id[Link]\" (optional) This is a map of link ids to Link objects, representing external resources associated with this location, for example, a vCard or image. If there are no links, this MUST be omitted (rather than specified as an empty set).",
      "ja": "リンク： \"id [link]\"（オプション）これはリンクIDのマップです。これは、この場所に関連付けられている外部リソース、たとえば、VCardまたはImageなどの外部リソースのマップです。リンクがない場合は、これを省略する必要があります（空のセットとして指定されています）。"
    },
    {
      "indent": 0,
      "text": "4.2.6. virtualLocations",
      "section_title": true,
      "ja": "4.2.6. virtuallocations."
    },
    {
      "indent": 3,
      "text": "Type: \"Id[VirtualLocation]\" (optional)",
      "ja": "タイプ： \"id [virtuallocation]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is a map of virtual location ids to VirtualLocation objects, representing virtual locations, such as video conferences or chat rooms, associated with the object.",
      "ja": "これは、オブジェクトに関連付けられているビデオ会議やチャットルームなどの仮想的な場所を表すVirtualLocationオブジェクトへの仮想位置IDのマップです。"
    },
    {
      "indent": 3,
      "text": "A VirtualLocation object has the following properties.",
      "ja": "VirtualLocationオブジェクトには、次のプロパティがあります。"
    },
    {
      "indent": 3,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"VirtualLocation\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは「virtuallocation」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "name: \"String\" (optional, default: empty String) This is the human-readable name of the virtual location.",
      "ja": "name： \"string\"（オプション、デフォルト：空の文字列）これは、仮想位置の人間が読める名前です。"
    },
    {
      "indent": 3,
      "text": "description: \"String\" (optional) These are human-readable plain-text instructions for accessing this virtual location. This may be a conference access code, etc.",
      "ja": "説明： \"string\"（オプション）この仮想位置にアクセスするための人間が読めるプレーンテキストの指示です。これは会議アクセスコードなどです。"
    },
    {
      "indent": 3,
      "text": "uri: \"String\" (mandatory) This is a URI [RFC3986] that represents how to connect to this virtual location.",
      "ja": "URI： \"string\"（必須）これは、この仮想位置への接続方法を表すURI [RFC3986]です。"
    },
    {
      "indent": 6,
      "text": "This may be a telephone number (represented using the \"tel:\" scheme, e.g., \"tel:+1-555-555-5555\") for a teleconference, a web address for online chat, or any custom URI.",
      "ja": "これは、電話会議、オンラインチャット用のWebアドレス、または任意のカスタムURIの電話番号（「TEL：1-555-5555」）である電話番号（「TEL：1-555-5555」）でもかまいません。"
    },
    {
      "indent": 3,
      "text": "features: \"String[Boolean]\" (optional) A set of features supported by this virtual location. The set is represented as a map, with the keys being the feature. The value for each key in the map MUST be true.",
      "ja": "特徴： \"string [boolean]\"（オプション）この仮想位置でサポートされている一連の機能。セットはマップとして表され、キーは機能です。マップ内の各キーの値はtrueでなければなりません。"
    },
    {
      "indent": 6,
      "text": "The feature MUST be one of the following values, another value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3). Any value the client or server doesn't understand should be treated the same as if this feature is omitted.",
      "ja": "この機能は、IANA \"JScalendar Enum値\"レジストリ、またはベンダー固有の値に登録されている別の値のいずれかです（セクション3.3を参照）。クライアントまたはサーバーが理解していない値は、この機能が省略されている場合と同じように扱われるべきです。"
    },
    {
      "indent": 6,
      "text": "audio: Audio conferencing",
      "ja": "オーディオ：オーディオ会議"
    },
    {
      "indent": 6,
      "text": "chat: Chat or instant messaging",
      "ja": "チャット：チャットまたはインスタントメッセージング"
    },
    {
      "indent": 6,
      "text": "feed: Blog or atom feed",
      "ja": "フィード：ブログまたは原子飼料"
    },
    {
      "indent": 6,
      "text": "moderator: Provides moderator-specific features",
      "ja": "モデレータ：モデレータ固有の機能を提供します"
    },
    {
      "indent": 6,
      "text": "phone: Phone conferencing",
      "ja": "電話：電話会議"
    },
    {
      "indent": 6,
      "text": "screen: Screen sharing",
      "ja": "画面：画面共有"
    },
    {
      "indent": 6,
      "text": "video: Video conferencing",
      "ja": "ビデオ：ビデオ会議"
    },
    {
      "indent": 0,
      "text": "4.2.7. links",
      "section_title": true,
      "ja": "4.2.7. リンク"
    },
    {
      "indent": 3,
      "text": "Type: \"Id[Link]\" (optional)",
      "ja": "タイプ： \"id [link]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is a map of link ids to Link objects, representing external resources associated with the object.",
      "ja": "これは、オブジェクトに関連付けられている外部リソースを表すオブジェクトをリンクするためのリンクIDのマップです。"
    },
    {
      "indent": 3,
      "text": "Links with a rel of \"enclosure\" MUST be considered by the client to be attachments for download.",
      "ja": "RELの「エンクロージャ」とのリンクは、クライアントがダウンロード用の添付ファイルになるように考慮する必要があります。"
    },
    {
      "indent": 3,
      "text": "Links with a rel of \"describedby\" MUST be considered by the client to be alternative representations of the description.",
      "ja": "「記載されている」というRELとのリンクは、説明の代替表現であるためにクライアントによって考慮されなければなりません。"
    },
    {
      "indent": 3,
      "text": "Links with a rel of \"icon\" MUST be considered by the client to be images that it may use when presenting the calendar data to a user. The \"display\" property may be set to indicate the purpose of this image.",
      "ja": "RELの「アイコン」とのリンクは、カレンダーデータをユーザーに提示するときに使用できるようにするためにクライアントであることが必要です。この画像の目的を示すために「表示」プロパティを設定することができる。"
    },
    {
      "indent": 0,
      "text": "4.2.8. locale",
      "section_title": true,
      "ja": "4.2.8. ロケール"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional)",
      "ja": "タイプ： \"string\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is the language tag, as defined in [RFC5646], that best describes the locale used for the text in the calendar object, if known.",
      "ja": "これは[RFC5646]で定義されている言語タグで、カレンダーオブジェクトのテキストに使用されているロケールを既知であれば最もよく表しています。"
    },
    {
      "indent": 0,
      "text": "4.2.9. keywords",
      "section_title": true,
      "ja": "4.2.9. キーワード"
    },
    {
      "indent": 3,
      "text": "Type: \"String[Boolean]\" (optional)",
      "ja": "type： \"string [boolean]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is a set of keywords or tags that relate to the object. The set is represented as a map, with the keys being the keywords. The value for each key in the map MUST be true.",
      "ja": "これは、オブジェクトに関連するキーワードまたはタグのセットです。セットはマップとして表され、キーはキーワードです。マップ内の各キーの値はtrueでなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.2.10. categories",
      "section_title": true,
      "ja": "4.2.10. カテゴリー"
    },
    {
      "indent": 3,
      "text": "Type: \"String[Boolean]\" (optional)",
      "ja": "type： \"string [boolean]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is a set of categories that relate to the calendar object. The set is represented as a map, with the keys being the categories specified as URIs. The value for each key in the map MUST be true.",
      "ja": "これは、カレンダーオブジェクトに関連するカテゴリのセットです。セットはマップとして表され、キーはURIとして指定されたカテゴリです。マップ内の各キーの値はtrueでなければなりません。"
    },
    {
      "indent": 3,
      "text": "In contrast to keywords, categories are typically structured. For example, a vendor owning the domain \"example.com\" might define the categories \"http://example.com/categories/sports/american-football\" and \"http://example.com/categories/music/r-b\".",
      "ja": "キーワードとは対照的に、カテゴリは通常構造化されています。たとえば、ドメイン \"example.com\"を所有するベンダーは、カテゴリ \"http://example.com/categories/sports/american-football\"と \"http://example.com/categories/music/rb\"を定義することがあります。。"
    },
    {
      "indent": 0,
      "text": "4.2.11. color",
      "section_title": true,
      "ja": "4.2.11. 色"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional)",
      "ja": "タイプ： \"string\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is a color clients MAY use when displaying this calendar object. The value is a color name taken from the set of names defined in Section 4.3 of CSS Color Module Level 3 [COLORS] or an RGB value in hexadecimal notation, as defined in Section 4.2.1 of CSS Color Module Level 3.",
      "ja": "このカレンダーオブジェクトを表示するときに使用できるカラークライアントです。値は、CSSカラーモジュールレベル3のセクション4.2.1で定義されているCSSカラーモジュールレベル3 [Colors]またはRGB値のセクション4.3で定義されている名前のセットから取得されたカラー名です。"
    },
    {
      "indent": 0,
      "text": "4.3. Recurrence Properties",
      "section_title": true,
      "ja": "4.3. 再発特性"
    },
    {
      "indent": 3,
      "text": "Some events and tasks occur at regular or irregular intervals. Rather than having to copy the data for every occurrence, there can be a base event with rules to generate recurrences and/or overrides that add extra dates or exceptions to the rules.",
      "ja": "一部のイベントやタスクは、通常または不規則な間隔で発生します。あらゆる出現ごとにデータをコピーする必要がなくなったら、ルールに追加の日付または例外を追加する再発やオーバーライドを生成するための規則を持つ基本イベントがあります。"
    },
    {
      "indent": 3,
      "text": "The recurrence set is the complete set of instances for an object. It is generated by considering the following properties in order, all of which are optional:",
      "ja": "再発セットは、オブジェクトのインスタンスの完全なセットです。次のプロパティを順番に検討することによって生成されます。"
    },
    {
      "indent": 3,
      "text": "1. The \"recurrenceRules\" property (Section 4.3.3) generates a set of extra date-times on which the object occurs.",
      "ja": "1. \"Recurrencerules\"プロパティ（セクション4.3.3）は、オブジェクトが発生する追加の日時のセットを生成します。"
    },
    {
      "indent": 3,
      "text": "2. The \"excludedRecurrenceRules\" property (Section 4.3.4) generates a set of date-times that are to be removed from the previously generated set of date-times on which the object occurs.",
      "ja": "2. 「excredRecurrenceRules」プロパティ（セクション4.3.4）は、オブジェクトが発生した日時の以前に生成された日時セットから削除される日時のセットを生成します。"
    },
    {
      "indent": 3,
      "text": "3. The \"recurrenceOverrides\" property (Section 4.3.5) defines date-times that are added or excluded to form the final set. (This property may also contain changes to the object to apply to particular instances.)",
      "ja": "3. 「RecurrenceOverrides」プロパティ（セクション4.3.5）は、最終セットを形成するために追加または除外される日時を定義します。（このプロパティには、特定のインスタンスに適用するオブジェクトへの変更も含めることができます。）"
    },
    {
      "indent": 0,
      "text": "4.3.1. recurrenceId",
      "section_title": true,
      "ja": "4.3.1. 繰り返し"
    },
    {
      "indent": 3,
      "text": "Type: \"LocalDateTime\" (optional)",
      "ja": "タイプ： \"localdateTime\"（オプション）"
    },
    {
      "indent": 3,
      "text": "If present, this JSCalendar object represents one occurrence of a recurring JSCalendar object. If present, the \"recurrenceRules\" and \"recurrenceOverrides\" properties MUST NOT be present.",
      "ja": "存在する場合、このJScalendarオブジェクトは、繰り返しJScalendarオブジェクトの1つの発生を表します。存在する場合は、「RecurrenceRules」と「RecurrenceOverrides」プロパティが存在してはいけません。"
    },
    {
      "indent": 3,
      "text": "The value is a date-time either produced by the \"recurrenceRules\" of the base event or added as a key to the \"recurrenceOverrides\" property of the base event.",
      "ja": "値は、ベースイベントの「Recurrencerules」によって生成されるか、または基本イベントの「RecurrenceOverrides」プロパティのキーとして追加されます。"
    },
    {
      "indent": 0,
      "text": "4.3.2. recurrenceIdTimeZone",
      "section_title": true,
      "ja": "4.3.2. RecurrenceIdTimeZone."
    },
    {
      "indent": 3,
      "text": "Type: \"TimeZoneId|null\" (optional, default: null)",
      "ja": "タイプ： \"timezoneID | null\"（オプション、デフォルト：null）"
    },
    {
      "indent": 3,
      "text": "Identifies the time zone of the main JSCalendar object, of which this JSCalendar object is a recurrence instance. This property MUST be set if the \"recurrenceId\" property is set. It MUST NOT be set if the \"recurrenceId\" property is not set.",
      "ja": "メインJScalendarオブジェクトのタイムゾーンを識別し、そのjscalendarオブジェクトは繰り返しインスタンスです。\"RecurrenceId\"プロパティが設定されている場合は、このプロパティを設定する必要があります。\"RecurrenceID\"プロパティが設定されていない場合は設定してはいけません。"
    },
    {
      "indent": 0,
      "text": "4.3.3. recurrenceRules",
      "section_title": true,
      "ja": "4.3.3. 再発者"
    },
    {
      "indent": 3,
      "text": "Type: \"RecurrenceRule[]\" (optional)",
      "ja": "タイプ： \"recurrencerule []\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This defines a set of recurrence rules (repeating patterns) for recurring calendar objects.",
      "ja": "これにより、繰り返しカレンダーオブジェクトを繰り返すための繰り返し規則（繰り返しパターン）が定義されています。"
    },
    {
      "indent": 3,
      "text": "An Event recurs by applying the recurrence rules to the \"start\" date-time.",
      "ja": "イベントは、「開始」日時に再発規則を適用することによって再帰します。"
    },
    {
      "indent": 3,
      "text": "A Task recurs by applying the recurrence rules to the \"start\" date-time, if defined; otherwise, it recurs by the \"due\" date-time, if defined. If the task defines neither a \"start\" nor \"due\" date-time, it MUST NOT define a \"recurrenceRules\" property.",
      "ja": "定義されている場合、タスクは「開始」日時に復帰ルールを適用することによって再帰します。それ以外の場合は、定義されている場合は、「期日」日時によって再帰します。タスクが「START」または「期日」日時も定義されていない場合は、「RecurRencerules」プロパティを定義してはなりません。"
    },
    {
      "indent": 3,
      "text": "If multiple recurrence rules are given, each rule is to be applied, and then the union of the results are used, ignoring any duplicates.",
      "ja": "複数の再発ルールが指定されている場合は、各ルールを適用する必要があり、その結果の共和敗が使用され、重複を無視します。"
    },
    {
      "indent": 3,
      "text": "A RecurrenceRule object is a JSON object mapping of a RECUR value type in iCalendar [RFC5545] [RFC7529] and has the same semantics. It has the following properties:",
      "ja": "RecurRenceruleオブジェクトは、iCalendar [RFC5545] [RFC7529]のRecur値タイプのJSONオブジェクトマッピングです。同じ意味論を持ちます。次のプロパティがあります。"
    },
    {
      "indent": 3,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"RecurrenceRule\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは「再現者」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "frequency: \"String\" (mandatory) This is the time span covered by each iteration of this recurrence rule (see Section 4.3.3.1 for full semantics). This MUST be one of the following values:",
      "ja": "周波数： \"string\"（必須）これは、この再発規則の各反復によってカバーされている期間です（全セマンティクスのセクション4.3.3.1を参照）。これは次のいずれかの値でなければなりません。"
    },
    {
      "indent": 6,
      "text": "* \"yearly\"",
      "ja": "* 「年間」"
    },
    {
      "indent": 6,
      "text": "* \"monthly\"",
      "ja": "* 「毎月」"
    },
    {
      "indent": 6,
      "text": "* \"weekly\"",
      "ja": "* \"毎週\""
    },
    {
      "indent": 6,
      "text": "* \"daily\"",
      "ja": "* 「毎日」"
    },
    {
      "indent": 6,
      "text": "* \"hourly\"",
      "ja": "* 「毎時」"
    },
    {
      "indent": 6,
      "text": "* \"minutely\"",
      "ja": "* 「細かい」"
    },
    {
      "indent": 6,
      "text": "* \"secondly\"",
      "ja": "* 「第二に」"
    },
    {
      "indent": 6,
      "text": "This is the FREQ part from iCalendar, converted to lowercase.",
      "ja": "これはICalendarのFreq Partで、小文字に変換されました。"
    },
    {
      "indent": 3,
      "text": "interval: \"UnsignedInt\" (optional, default: 1) This is the interval of iteration periods at which the recurrence repeats. If included, it MUST be an integer >= 1.",
      "ja": "間隔： \"UnsignedInt\"（オプション、デフォルト：1）これは、再発が繰り返される反復期間の間隔です。含まれている場合は、整数> = 1でなければなりません。"
    },
    {
      "indent": 6,
      "text": "This is the INTERVAL part from iCalendar.",
      "ja": "これはiCalendarの間隔部分です。"
    },
    {
      "indent": 3,
      "text": "rscale: \"String\" (optional, default: \"gregorian\") This is the calendar system in which this recurrence rule operates, in lowercase. This MUST be either a CLDR-registered calendar system name [CLDR] or a vendor-specific value (see Section 3.3).",
      "ja": "rscale： \"string\"（オプション、デフォルト： \"Gregorian\"）この再発規則が小文字で動作するカレンダーシステムです。これは、CLDR登録カレンダシステム名[CLDR]またはベンダー固有の値でなければなりません（セクション3.3を参照）。"
    },
    {
      "indent": 6,
      "text": "This is the RSCALE part from iCalendar RSCALE [RFC7529], converted to lowercase.",
      "ja": "これは、iCalendar RSCale [RFC7529]からのRSCaleパートで、小文字に変換されます。"
    },
    {
      "indent": 3,
      "text": "skip: \"String\" (optional, default: \"omit\") This is the behavior to use when the expansion of the recurrence produces invalid dates. This property only has an effect if the frequency is \"yearly\" or \"monthly\". It MUST be one of the following values:",
      "ja": "スキップ： \"string\"（オプション、デフォルト： \"省略）これは、再発の拡張が無効な日付を生成するときに使用する動作です。このプロパティは、周波数が「年間」または「毎月」の場合にのみ効果があります。次のいずれかの値のいずれかでなければなりません。"
    },
    {
      "indent": 6,
      "text": "* \"omit\"",
      "ja": "* 「省」"
    },
    {
      "indent": 6,
      "text": "* \"backward\"",
      "ja": "* 「後方」"
    },
    {
      "indent": 6,
      "text": "* \"forward\"",
      "ja": "* \"前方\""
    },
    {
      "indent": 6,
      "text": "This is the SKIP part from iCalendar RSCALE [RFC7529], converted to lowercase.",
      "ja": "これは、iCalendar RSCale [RFC7529]からのスキップ部分で、小文字に変換されます。"
    },
    {
      "indent": 3,
      "text": "firstDayOfWeek: \"String\" (optional, default: \"mo\") This is the day on which the week is considered to start, represented as a lowercase, abbreviated, and two-letter English day of the week. If included, it MUST be one of the following values:",
      "ja": "FirstDayOfWeek： \"string\"（オプション、デフォルト： \"Mo\"）これは、週が始動し、小文字、省略され、そして2文字の英語の日数として表される日です。含まれている場合は、次の値のいずれかになります。"
    },
    {
      "indent": 6,
      "text": "* \"mo\"",
      "ja": "* \"MO\""
    },
    {
      "indent": 6,
      "text": "* \"tu\"",
      "ja": "* \"TU\""
    },
    {
      "indent": 6,
      "text": "* \"we\"",
      "ja": "* \"我々\""
    },
    {
      "indent": 6,
      "text": "* \"th\"",
      "ja": "* \"th\""
    },
    {
      "indent": 6,
      "text": "* \"fr\"",
      "ja": "* \"fr\""
    },
    {
      "indent": 6,
      "text": "* \"sa\"",
      "ja": "* \"sa\""
    },
    {
      "indent": 6,
      "text": "* \"su\"",
      "ja": "* \"su\""
    },
    {
      "indent": 6,
      "text": "This is the WKST part from iCalendar.",
      "ja": "これはiCalendarからのWKST部分です。"
    },
    {
      "indent": 3,
      "text": "byDay: \"NDay[]\" (optional) These are days of the week on which to repeat. An \"NDay\" object has the following properties:",
      "ja": "投稿者： \"nday []\"（オプション）これらは繰り返す曜日です。\"nday\"オブジェクトには、次のプロパティがあります。"
    },
    {
      "indent": 6,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"NDay\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは \"nday\"でなければなりません。"
    },
    {
      "indent": 6,
      "text": "day: \"String\" (mandatory) This is a day of the week on which to repeat; the allowed values are the same as for the \"firstDayOfWeek\" recurrenceRule property.",
      "ja": "日：「文字列」（必須）これは繰り返す曜日です。許容値は、「FirstDayOfWeek」Recurrencuraluleプロパティと同じです。"
    },
    {
      "indent": 9,
      "text": "This is the day of the week of the BYDAY part in iCalendar, converted to lowercase.",
      "ja": "これは、iCalendarのByday Partの曜日の日、小文字に変換されました。"
    },
    {
      "indent": 6,
      "text": "nthOfPeriod: \"Int\" (optional) If present, rather than representing every occurrence of the weekday defined in the \"day\" property, it represents only a specific instance within the recurrence period. The value can be positive or negative but MUST NOT be zero. A negative integer means the nth-last occurrence within that period (i.e., -1 is the last occurrence, -2 the one before that, etc.).",
      "ja": "nthofperiod： \"int\"（オプション）存在する場合は、「Day」プロパティで定義されている平日の発生を表すのではなく、繰り返し期間内の特定のインスタンスのみを表します。値は正または負になりますが、ゼロにしてはいけません。負の整数とは、その期間内のNTH最後の発生（すなわち、-1が最後の発生、-2、それ以前のものなど）を意味する。"
    },
    {
      "indent": 9,
      "text": "This is the ordinal part of the BYDAY value in iCalendar (e.g., 1 or -3).",
      "ja": "これは、iCalendar（例えば、1または-3）におけるバイ日値の序数部分です。"
    },
    {
      "indent": 3,
      "text": "byMonthDay: \"Int[]\" (optional) These are the days of the month on which to repeat. Valid values are between 1 and the maximum number of days any month may have in the calendar given by the \"rscale\" property and the negative values of these numbers. For example, in the Gregorian calendar, valid values are 1 to 31 and -31 to -1. Negative values offset from the end of the month. The array MUST have at least one entry if included.",
      "ja": "Monthay： \"int []\"（オプション）これらは繰り返す月の日です。有効な値は1から1月の最大日数が「rscale」プロパティとこれらの数値の負の値で指定されたカレンダーにいずれにもなります。たとえば、グレゴリオ暦では、有効な値は1~31、-31から-1です。負の値は月末からオフセットします。含まれている場合、配列には少なくとも1つのエントリが必要です。"
    },
    {
      "indent": 6,
      "text": "This is the BYMONTHDAY part in iCalendar.",
      "ja": "これはiCalendarのbymonthayの部分です。"
    },
    {
      "indent": 3,
      "text": "byMonth: \"String[]\" (optional) These are the months in which to repeat. Each entry is a string representation of a number, starting from \"1\" for the first month in the calendar (e.g., \"1\" means January with the Gregorian calendar), with an optional \"L\" suffix (see [RFC7529]) for leap months (this MUST be uppercase, e.g., \"3L\"). The array MUST have at least one entry if included.",
      "ja": "ByMonth： \"string []\"（オプション）これらは繰り返す月です。各エントリは、カレンダーの最初の月の「1」から始めて、「1」から始めて、「1」から「1」（Gregorianカレンダーを意味します）、オプションの \"L\"サフィックス（[RFC7529]参照）を使用しています。うるう月（これは大文字、例えば「3L」でなければなりません）。含まれている場合、配列には少なくとも1つのエントリが必要です。"
    },
    {
      "indent": 6,
      "text": "This is the BYMONTH part from iCalendar.",
      "ja": "これはiCalendarからのbymonthの部分です。"
    },
    {
      "indent": 3,
      "text": "byYearDay: \"Int[]\" (optional) These are the days of the year on which to repeat. Valid values are between 1 and the maximum number of days any year may have in the calendar given by the \"rscale\" property and the negative values of these numbers. For example, in the Gregorian calendar, valid values are 1 to 366 and -366 to -1. Negative values offset from the end of the year. The array MUST have at least one entry if included.",
      "ja": "byyearday： \"int []\"（オプション）これらは繰り返す年の日です。有効な値は、「RSCale」プロパティで指定されたカレンダーとこれらの数値の負の値であるカレンダーに、1年の間で最大日数の最大数です。たとえば、グレゴリオ暦では、有効な値は1から366、-366から-1です。負の値は年末から相殺されます。含まれている場合、配列には少なくとも1つのエントリが必要です。"
    },
    {
      "indent": 6,
      "text": "This is the BYYEARDAY part from iCalendar.",
      "ja": "これはiCalendarからのyeardayの部分です。"
    },
    {
      "indent": 3,
      "text": "byWeekNo: \"Int[]\" (optional) These are the weeks of the year in which to repeat. Valid values are between 1 and the maximum number of weeks any year may have in the calendar given by the \"rscale\" property and the negative values of these numbers. For example, in the Gregorian calendar, valid values are 1 to 53 and -53 to -1. The array MUST have at least one entry if included.",
      "ja": "byweekno： \"int []\"（オプション）これらは繰り返す年の数週間です。有効な値は1から1年の間で、「RSCale」プロパティとこれらの番号の負の値によって指定されたカレンダーにあらゆる週の最大数です。たとえば、グレゴリオカレンダーでは、有効な値は1から53、-53から-1です。含まれている場合、配列には少なくとも1つのエントリが必要です。"
    },
    {
      "indent": 6,
      "text": "This is the BYWEEKNO part from iCalendar.",
      "ja": "これはiCalendarからのbyweekno部です。"
    },
    {
      "indent": 3,
      "text": "byHour: \"UnsignedInt[]\" (optional) These are the hours of the day in which to repeat. Valid values are 0 to 23. The array MUST have at least one entry if included. This is the BYHOUR part from iCalendar.",
      "ja": "byour： \"unsignedint []\"（オプション）これらは繰り返す日の時間です。有効な値は0から23です。含まれている場合、配列は少なくとも1つのエントリを持つ必要があります。これはiCalendarからのビアの部分です。"
    },
    {
      "indent": 3,
      "text": "byMinute: \"UnsignedInt[]\" (optional) These are the minutes of the hour in which to repeat. Valid values are 0 to 59. The array MUST have at least one entry if included.",
      "ja": "minute： \"unsignedint []\"（オプション）これらは繰り返す時間の議事録です。有効な値は0から59です。含まれている場合、配列は少なくとも1つのエントリを持つ必要があります。"
    },
    {
      "indent": 6,
      "text": "This is the BYMINUTE part from iCalendar.",
      "ja": "これはiCalendarからの単項部分です。"
    },
    {
      "indent": 3,
      "text": "bySecond: \"UnsignedInt[]\" (optional) These are the seconds of the minute in which to repeat. Valid values are 0 to 60. The array MUST have at least one entry if included.",
      "ja": "bysecond： \"unsignedint []\"（オプション）これらは繰り返すための分の秒です。有効な値は0から60です。含まれている場合、配列は少なくとも1つのエントリを持たなければなりません。"
    },
    {
      "indent": 6,
      "text": "This is the BYSECOND part from iCalendar.",
      "ja": "これはiCalendarからのビーコード部分です。"
    },
    {
      "indent": 3,
      "text": "bySetPosition: \"Int[]\" (optional) These are the occurrences within the recurrence interval to include in the final results. Negative values offset from the end of the list of occurrences. The array MUST have at least one entry if included. This is the BYSETPOS part from iCalendar.",
      "ja": "BySetPosition： \"int []\"（オプション）これらは最終結果に含めるための再発間隔内の発生です。負の値は、出現リストの一覧の末尾からオフセットします。含まれている場合、配列には少なくとも1つのエントリが必要です。これはiCalendarのBySetpos部です。"
    },
    {
      "indent": 3,
      "text": "count: \"UnsignedInt\" (optional) These are the number of occurrences at which to range-bound the recurrence. This MUST NOT be included if an \"until\" property is specified.",
      "ja": "count： \"unsignedint\"（オプション）これらは再発を範囲に囲みますが発生した出現数です。「まで」プロパティが指定されている場合は、これを含めることはできません。"
    },
    {
      "indent": 6,
      "text": "This is the COUNT part from iCalendar.",
      "ja": "これはiCalendarのカウント部分です。"
    },
    {
      "indent": 3,
      "text": "until: \"LocalDateTime\" (optional) These are the date-time at which to finish recurring. The last occurrence is on or before this date-time. This MUST NOT be included if a \"count\" property is specified. Note that if not specified otherwise for a specific JSCalendar object, this date is to be interpreted in the time zone specified in the JSCalendar object's \"timeZone\" property.",
      "ja": "： \"localdateTime\"（オプション）これは繰り返しを終了する日時です。最後の発生はこの日時の前または前にあります。\"count\"プロパティが指定されている場合は含まれてはいけません。特別なJScalendarオブジェクトに対して指定されていない場合は、この日付はJScalendarオブジェクトの「TimeZone」プロパティで指定されたタイムゾーンで解釈されます。"
    },
    {
      "indent": 6,
      "text": "This is the UNTIL part from iCalendar.",
      "ja": "これはiCalendarからの部分です。"
    },
    {
      "indent": 0,
      "text": "4.3.3.1. Interpreting Recurrence Rules",
      "section_title": true,
      "ja": "4.3.3.1. 再発規則の解釈"
    },
    {
      "indent": 3,
      "text": "A recurrence rule specifies a set of date-times for recurring calendar objects. A recurrence rule has the following semantics. Note that wherever \"year\", \"month\", or \"day of month\" is used, this is within the calendar system given by the \"rscale\" property, which defaults to \"gregorian\" if omitted.",
      "ja": "再発ルールは、繰り返しカレンダーオブジェクトを繰り返すための日時のセットを指定します。再発規則には以下のセマンティクスがあります。「年」、「月」、または「月の日」が使用されるところはどこでも、これは「RSCale」プロパティによって与えられたカレンダーシステム内であり、省略された場合は「Gregorian」はデフォルトである。"
    },
    {
      "indent": 3,
      "text": "1. A set of candidates is generated. This is every second within a period defined by the \"frequency\" property value:",
      "ja": "1. 一組の候補が生成される。これは、 \"周波数\"プロパティ値で定義された期間内の毎秒です。"
    },
    {
      "indent": 7,
      "text": "\"yearly\": every second from midnight on the first day of a year (inclusive) to midnight the first day of the following year (exclusive).",
      "ja": "「毎年」：翌年の初日から午前中までの真夜中から毎晩翌年の初日に（排他的）。"
    },
    {
      "indent": 10,
      "text": "If skip is not \"omit\", the calendar system has leap months, and there is a \"byMonth\" property, generate candidates for the leap months, even if they don't occur in this year.",
      "ja": "スキップが「省略」されていない場合、カレンダーシステムは閏月があり、「ByMonth」プロパティがあり、今年は発生しなくても閏年の候補者を生成します。"
    },
    {
      "indent": 10,
      "text": "If skip is not \"omit\" and there is a \"byMonthDay\" property, presume each month has the maximum number of days any month may have in this calendar system when generating candidates, even if it's more than this month actually has.",
      "ja": "スキップが「省略」されておらず、「ByMonthay」プロパティがある場合は、毎月想定されていた場合、候補者がこのカレンダーシステムに存在する場合には、候補者がこのカレンダーシステムに持つ場合があります。"
    },
    {
      "indent": 7,
      "text": "\"monthly\": every second from midnight on the first day of a month (inclusive) to midnight on the first of the following month (exclusive).",
      "ja": "「毎月」：翌月の最初の月の初日から真夜中まで真夜中から毎晩（排他的）。"
    },
    {
      "indent": 10,
      "text": "If skip is not \"omit\" and there is a \"byMonthDay\" property, presume the month has the maximum number of days any month may have in this calendar system when generating candidates, even if it's more than this month actually has.",
      "ja": "スキップが「省略」されていない場合は「ByMonthay」プロパティがある場合は、この月を生成するときに月の最大日数がある場合には、このカレンダーシステムでは、実際には実際に持っている場合でも月数が1ヶ月の最大日数があります。"
    },
    {
      "indent": 7,
      "text": "\"weekly\": every second from midnight (inclusive) on the first day of the week (as defined by the \"firstDayOfWeek\" property or Monday if omitted) to midnight seven days later (exclusive).",
      "ja": "「毎週」：週の初日（「FirstDayOfweek」プロパティまたは月曜日に定義されているように）毎秒（「FirstDayofweek」プロパティまたは月曜日）から真夜中に7日後に毎晩（排他的）。"
    },
    {
      "indent": 7,
      "text": "\"daily\": every second from midnight at the start of the day (inclusive) to midnight at the end of the day (exclusive).",
      "ja": "「毎日」：一日の終わりに一日（包括的）から真夜中までの真夜中から毎晩（排他的）。"
    },
    {
      "indent": 7,
      "text": "\"hourly\": every second from the beginning of the hour (inclusive) to the beginning of the next hour (exclusive).",
      "ja": "「毎時」：毎秒（包括的）から次の時間の始まりまで（排他的）。"
    },
    {
      "indent": 7,
      "text": "\"minutely\": every second from the beginning of the minute (inclusive) to the beginning of the next minute (exclusive).",
      "ja": "「細かい」：毎秒（包括的）から、次の分の始まり（排他的）。"
    },
    {
      "indent": 7,
      "text": "\"secondly\": only the second itself.",
      "ja": "「第二に」：2番目のそれ自体だけです。"
    },
    {
      "indent": 3,
      "text": "2. Each date-time candidate is compared against all of the byX properties of the rule except bySetPosition. If any property in the rule does not match the date-time, the date-time is eliminated. Each byX property is an array; the date-time matches the property if it matches any of the values in the array. The properties have the following semantics:",
      "ja": "2. 各日時候補は、BySetPosition以外のルールのすべてのBYXプロパティと比較されます。ルール内のプロパティが日付 - 時刻と一致しない場合、日時は除去されます。各BYXプロパティは配列です。日時は、配列内のいずれかの値と一致する場合、プロパティと一致します。プロパティには次のセマンティクスがあります。"
    },
    {
      "indent": 7,
      "text": "byMonth: The date-time is in the given month.",
      "ja": "ByMonth：日時は与えられた月にあります。"
    },
    {
      "indent": 7,
      "text": "byWeekNo: The date-time is in the nth week of the year. Negative numbers mean the nth last week of the year. This corresponds to weeks according to week numbering, as defined in ISO.8601.2004, with a week defined as a seven-day period, starting on the \"firstDayOfWeek\" property value or Monday if omitted. Week number one of the calendar year is the first week that contains at least four days in that calendar year.",
      "ja": "byweekno：日時はその年のN週間にあります。負の数は、最後の週を平均しています。これは、ISO.8601.2004で定義されています。暦年の1つの1つは、その暦年に少なくとも4日を含む最初の週です。"
    },
    {
      "indent": 10,
      "text": "If the date-time is not valid (this may happen when generating candidates with a \"skip\" property in effect), it is always eliminated by this property.",
      "ja": "日付時間が無効な場合（これは有効な「スキップ」プロパティを持つ候補を生成するときに発生する可能性があります）、これは常にこのプロパティによって排除されます。"
    },
    {
      "indent": 7,
      "text": "byYearDay: The date-time is on the nth day of year. Negative numbers mean the nth last day of the year.",
      "ja": "バイエアデー：日付時間は年の日の日にあります。負の数は、最終年の最終日を意味します。"
    },
    {
      "indent": 10,
      "text": "If the date-time is not valid (this may happen when generating candidates with a \"skip\" property in effect), it is always eliminated by this property.",
      "ja": "日付時間が無効な場合（これは有効な「スキップ」プロパティを持つ候補を生成するときに発生する可能性があります）、これは常にこのプロパティによって排除されます。"
    },
    {
      "indent": 7,
      "text": "byMonthDay: The date-time is on the given day of the month. Negative numbers mean the nth last day of the month.",
      "ja": "Monthay：日時は月の特定の日にあります。負の数字は月の最終日を意味します。"
    },
    {
      "indent": 7,
      "text": "byDay: The date-time is on the given day of the week. If the day is prefixed by a number, it is the nth occurrence of that day of the week within the month (if frequency is monthly) or year (if frequency is yearly). Negative numbers mean the nth last occurrence within that period.",
      "ja": "バイデー：日時は週の指定日にあります。その日が数字の前に付いている場合は、月（頻度が毎月の場合）または年（頻度が年間の場合）の曜日のNTH発生です。負の数は、その期間内のN番目の最後の発生を意味します。"
    },
    {
      "indent": 7,
      "text": "byHour: The date-time has the given hour value.",
      "ja": "byour：日時は与えられた時間値を持っています。"
    },
    {
      "indent": 7,
      "text": "byMinute: The date-time has the given minute value.",
      "ja": "単に：日時は与えられた微小値を持っています。"
    },
    {
      "indent": 7,
      "text": "bySecond: The date-time has the given second value.",
      "ja": "2秒：日時は指定された第2の値を有する。"
    },
    {
      "indent": 7,
      "text": "If a \"skip\" property is defined and is not \"omit\", there may be candidates that do not correspond to valid dates (e.g., February 31st in the Gregorian calendar). In this case, the properties MUST be considered in the order above, and:",
      "ja": "「スキップ」プロパティが定義されていて「省略」されていない場合、有効な日付に対応しない候補（例えば、Gregorianカレンダーの2月31日）があるかもしれません。この場合、プロパティは上記の順序で考慮されなければなりません。"
    },
    {
      "indent": 7,
      "text": "1. After applying the byMonth filter, if the candidate's month is invalid for the given year, increment it (if skip is \"forward\") or decrement it (if skip is \"backward\") until a valid month is found, incrementing/decrementing the year as well if passing through the beginning/end of the year. This only applies to calendar systems with leap months.",
      "ja": "1. ByMonthフィルタを適用した後、候補者の月が特定の年に無効であれば、それをインクリメントする（スキップが「前方」の場合）、またはそれを減らした場合（スキップが「後方」の場合）、年を増減させる年の初めと終わりを通過する場合これはうるう月のカレンダーシステムにのみ適用されます。"
    },
    {
      "indent": 7,
      "text": "2. After applying the byMonthDay filter, if the day of the month is invalid for the given month and year, change the date to the first day of the next month (if skip is \"forward\") or the last day of the current month (if skip is \"backward\").",
      "ja": "2. ByMontaday Filterを適用した後、月の日が与えられた月と年の間無効であれば、日付を翌月の最初の日（スキップが「前方」の場合）または現在の月の最終日（スキップは「後方」です）。"
    },
    {
      "indent": 7,
      "text": "3. If any valid date produced after applying the skip is already a candidate, eliminate the duplicate. (For example, after adjusting, February 30th and February 31st would both become the same \"real\" date, so one is eliminated as a duplicate.)",
      "ja": "3. スキップを適用した後に生成された有効な日付がすでに候補者である場合は、重複を排除します。（たとえば、調整後、2月31日と2月31日は両方とも同じ「実際の」日付になりますので、重複しています。）"
    },
    {
      "indent": 3,
      "text": "3. If a \"bySetPosition\" property is included, this is now applied to the ordered list of remaining dates. This property specifies the indexes of date-times to keep; all others should be eliminated. Negative numbers are indexed from the end of the list, with -1 being the last item, -2 the second from last, etc.",
      "ja": "3. 「BySetPosition」プロパティが含まれている場合、これは残りの日付の順序付きリストに適用されます。このプロパティは、保持する日時のインデックスを指定します。他のすべてを排除する必要があります。負の数はリストの末尾から索引付けされ、-1が最後の項目、-2が最後のものなどです。"
    },
    {
      "indent": 3,
      "text": "4. Any date-times before the start date of the event are eliminated (see below for why this might be needed).",
      "ja": "4. イベント開始日の前の日時は排除されます（これが必要な理由については以下を参照）。"
    },
    {
      "indent": 3,
      "text": "5. If a \"skip\" property is included and is not \"omit\", eliminate any date-times that have already been produced by previous iterations of the algorithm. (This is not possible if skip is \"omit\".)",
      "ja": "5. 「スキップ」プロパティが含まれており、「省略」されていない場合は、アルゴリズムの前の反復によって既に作成されている日時を排除します。（スキップが省略されている場合はこれは不可能です。）"
    },
    {
      "indent": 3,
      "text": "6. If further dates are required (we have not reached the until date or count limit), skip the next (interval - 1) sets of candidates, then continue from step 1.",
      "ja": "6. さらなる日付が必要な場合（日付または数制限までに達していない）、次の（Interval-1）セットの候補をスキップしてから、ステップ1から続行します。"
    },
    {
      "indent": 3,
      "text": "When determining the set of occurrence dates for an event or task, the following extra rules must be applied:",
      "ja": "イベントまたはタスクの発生日数のセットを決定する場合は、次の余分な規則を適用する必要があります。"
    },
    {
      "indent": 3,
      "text": "1. The initial date-time to which the rule is applied (the \"start\" date-time for events or the \"start\" or \"due\" date-time for tasks) is always the first occurrence in the expansion (and is counted if the recurrence is limited by a \"count\" property), even if it would normally not match the rule.",
      "ja": "1. ルールが適用される最初の日時（イベントの「開始」日時または「開始」または「期日」タスクの日時は、常に拡張内の最初の出現箇所です（そして、たとえそれが通常規則に一致しないであっても、再発は「カウント」プロパティによって制限されます。"
    },
    {
      "indent": 3,
      "text": "2. The first set of candidates to consider is that which would contain the initial date-time. This means the first set may include candidates before the initial date-time; such candidates are eliminated from the results in step 4 of the list above.",
      "ja": "2. 考慮すべき候補の最初のセットは、初期日時を含むことです。これは、最初のセットが初期日時の前に候補を含めることができることを意味します。そのような候補は、上記のリストのステップ4の結果から排除される。"
    },
    {
      "indent": 3,
      "text": "3. The following properties MUST be implicitly added to the rule under the given conditions:",
      "ja": "3. 次のプロパティは、指定された条件下でルールに暗黙的に追加されなければなりません。"
    },
    {
      "indent": 7,
      "text": "* If frequency is not \"secondly\" and there is no \"bySecond\" property, add a \"bySecond\" property with the sole value being the seconds value of the initial date-time.",
      "ja": "* 周波数が「2番目に」で、「bySecond」プロパティがない場合は、唯一の値が初期日時の秒値である \"BySecond\"プロパティを追加します。"
    },
    {
      "indent": 7,
      "text": "* If frequency is not \"secondly\" or \"minutely\" and there is no \"byMinute\" property, add a \"byMinute\" property with the sole value being the minutes value of the initial date-time.",
      "ja": "* 頻度が「2番目に」または「細かく」プロパティがない場合は、「yminute」プロパティがない場合は、初期の日時の分の値である \"byminute\"プロパティを追加します。"
    },
    {
      "indent": 7,
      "text": "* If frequency is not \"secondly\", \"minutely\", or \"hourly\" and there is no \"byHour\" property, add a \"byHour\" property with the sole value being the hours value of the initial date-time.",
      "ja": "* 頻度が「2番目に」、「ミニスト」、または「毎時」で、「Byhour」プロパティがない場合は、唯一の値が初期日時の時間値である \"byhour\"プロパティを追加します。"
    },
    {
      "indent": 7,
      "text": "* If frequency is \"weekly\" and there is no \"byDay\" property, add a \"byDay\" property with the sole value being the day of the week of the initial date-time.",
      "ja": "* 頻度が「weekly」で、「byday」プロパティがない場合は、初期日時の曜日である唯一の値を持つ \"byday\"プロパティを追加してください。"
    },
    {
      "indent": 7,
      "text": "* If frequency is \"monthly\" and there is no \"byDay\" property and no \"byMonthDay\" property, add a \"byMonthDay\" property with the sole value being the day of the month of the initial date-time.",
      "ja": "* 頻度が「毎月」で、「Byday」プロパティと「ByMonthay」プロパティがない場合は、「ByMonthay」プロパティを、初期日時の月の唯一の値で追加します。"
    },
    {
      "indent": 7,
      "text": "* If frequency is \"yearly\" and there is no \"byYearDay\" property:",
      "ja": "* 頻度が「年次」の場合、「yyearday」プロパティはありません。"
    },
    {
      "indent": 10,
      "text": "- If there are no \"byMonth\" or \"byWeekNo\" properties, and either there is a \"byMonthDay\" property or there is no \"byDay\" property, add a \"byMonth\" property with the sole value being the month of the initial date-time.",
      "ja": "- \"ByMonth\"プロパティがない場合、および \"bymonthay\"プロパティがある場合、または \"bymonthay\"プロパティがあり、 \"byday\"プロパティはありません。。"
    },
    {
      "indent": 10,
      "text": "- If there are no \"byMonthDay\", \"byWeekNo\", or \"byDay\" properties, add a \"byMonthDay\" property with the sole value being the day of the month of the initial date-time.",
      "ja": "- \"bymonthay\"、 \"byweekno\"、または \"byday\"のプロパティがない場合は、初期日時の月の唯一の値で \"bymonthay\"プロパティを追加してください。"
    },
    {
      "indent": 10,
      "text": "- If there is a \"byWeekNo\" property and no \"byMonthDay\" or \"byDay\" properties, add a \"byDay\" property with the sole value being the day of the week of the initial date-time.",
      "ja": "- \"byweekno\"プロパティと \"ByMonthay\"または \"Byday\"プロパティがある場合は、初期日時の曜日である唯一の値を持つ \"byday\"プロパティを追加してください。"
    },
    {
      "indent": 0,
      "text": "4.3.4. excludedRecurrenceRules",
      "section_title": true,
      "ja": "4.3.4. recredrecurrenceslules"
    },
    {
      "indent": 3,
      "text": "Type: \"RecurrenceRule[]\" (optional)",
      "ja": "タイプ： \"recurrencerule []\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This defines a set of recurrence rules (repeating patterns) for date-times on which the object will not occur. The rules are interpreted the same as for the \"recurrenceRules\" property (see Section 4.3.3), with the exception that the initial date-time to which the rule is applied (the \"start\" date-time for events or the \"start\" or \"due\" date-time for tasks) is only considered part of the expansion if it matches the rule. The resulting set of date-times is then removed from those generated by the \"recurrenceRules\" property, as described in Section 4.3.",
      "ja": "これにより、オブジェクトが発生しない日時用の繰り返し規則（繰り返しパターン）が定義されています。ルールは、ルールが適用される初期日時（イベントの開始日時または開始時刻）を除いて、「Recurrencerules」プロパティ（セクション4.3.3を参照）と同じように解釈されます。「または「期限」タスクの日付 - ルールと一致する場合にのみ、拡張の一部に過ぎません。その結果、結果の日時は、セクション4.3で説明されているように、「Recurrenceules」プロパティによって生成されたものから削除されます。"
    },
    {
      "indent": 0,
      "text": "4.3.5. recurrenceOverrides",
      "section_title": true,
      "ja": "4.3.5. リコランオオーバーライド"
    },
    {
      "indent": 3,
      "text": "Type: \"LocalDateTime[PatchObject]\" (optional)",
      "ja": "型： \"LocalDateTime [PatchObject]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "Maps recurrence ids (the date-time produced by the recurrence rule) to the overridden properties of the recurrence instance.",
      "ja": "Recurrence ID（Recurrence Ruleによって生成された日時）をRecurrenceインスタンスのオーバーライドされたプロパティにマッピングします。"
    },
    {
      "indent": 3,
      "text": "If the recurrence id does not match a date-time from the recurrence rule (or no rule is specified), it is to be treated as an additional occurrence (like an RDATE from iCalendar). The patch object may often be empty in this case.",
      "ja": "繰り返しIDが繰り返しルールからの日時と一致しない場合（またはルールが指定されていない場合）、それは（iCalendarからのRDateのように）追加のオカレンスとして扱われます。この場合、パッチオブジェクトは空の場合があります。"
    },
    {
      "indent": 3,
      "text": "If the patch object defines the \"excluded\" property of an occurrence to be true, this occurrence is omitted from the final set of recurrences for the calendar object (like an EXDATE from iCalendar). Such a patch object MUST NOT patch any other property.",
      "ja": "パッチオブジェクトが発生する「除外された」プロパティを真になるように定義している場合、この発生はカレンダーオブジェクトの最後の再発セット（iCalendarからの拡張など）から省略されます。そのようなパッチオブジェクトは他のプロパティにパッチしないでください。"
    },
    {
      "indent": 3,
      "text": "By default, an occurrence inherits all properties from the main object except the start (or due) date-time, which is shifted to match the recurrence id LocalDateTime. However, individual properties of the occurrence can be modified by a patch or multiple patches. It is valid to patch the \"start\" property value, and this patch takes precedence over the value generated from the recurrence id. Both the recurrence id as well as the patched \"start\" date-time may occur before the original JSCalendar object's \"start\" or \"due\" date.",
      "ja": "デフォルトでは、発生は、START（またはDUE）の日時を除くすべてのプロパティを除く、Recurrence ID LocalDateTimeと一致するようにシフトされます。ただし、発生の個々のプロパティは、パッチまたは複数のパッチによって変更できます。\"Start\"プロパティ値をパッチし、このパッチは繰り返しIDから生成された値よりも優先されます。元のJScalendarオブジェクトの「START」または「期日」日付の前に、繰り返しIDとパッチが付いた「開始」日時の両方が発生する可能性があります。"
    },
    {
      "indent": 3,
      "text": "A pointer in the PatchObject MUST be ignored if it starts with one of the following prefixes:",
      "ja": "次のプレフィックスのいずれかで始まると、PatchObjectのポインタを無視する必要があります。"
    },
    {
      "indent": 3,
      "text": "* @type",
      "ja": "* @タイプ"
    },
    {
      "indent": 3,
      "text": "* excludedRecurrenceRules",
      "ja": "* recredrecurrenceslules"
    },
    {
      "indent": 3,
      "text": "* method",
      "ja": "* 方法"
    },
    {
      "indent": 3,
      "text": "* privacy",
      "ja": "* プライバシー"
    },
    {
      "indent": 3,
      "text": "* prodId",
      "ja": "* Prodid."
    },
    {
      "indent": 3,
      "text": "* recurrenceId",
      "ja": "* 繰り返し"
    },
    {
      "indent": 3,
      "text": "* recurrenceIdTimeZone",
      "ja": "* RecurrenceIdTimeZone."
    },
    {
      "indent": 3,
      "text": "* recurrenceOverrides",
      "ja": "* リコランオオーバーライド"
    },
    {
      "indent": 3,
      "text": "* recurrenceRules",
      "ja": "* 再発者"
    },
    {
      "indent": 3,
      "text": "* relatedTo",
      "ja": "* に関連して"
    },
    {
      "indent": 3,
      "text": "* replyTo",
      "ja": "* に返信"
    },
    {
      "indent": 3,
      "text": "* sentBy",
      "ja": "* セントバリー"
    },
    {
      "indent": 3,
      "text": "* timeZones",
      "ja": "* 時間帯"
    },
    {
      "indent": 3,
      "text": "* uid",
      "ja": "* UID."
    },
    {
      "indent": 0,
      "text": "4.3.6. excluded",
      "section_title": true,
      "ja": "4.3.6. 除外された"
    },
    {
      "indent": 3,
      "text": "Type: \"Boolean\" (optional, default: false)",
      "ja": "型： \"boolean\"（オプション、デフォルト：false）"
    },
    {
      "indent": 3,
      "text": "This defines if this object is an overridden, excluded instance of a recurring JSCalendar object (see Section 4.3.5). If this property value is true, this calendar object instance MUST be removed from the occurrence expansion. The absence of this property, or the presence of its default value as false, indicates that this instance MUST be included in the occurrence expansion.",
      "ja": "これは、このオブジェクトが繰り返しJScalendarオブジェクトのオーバーライドされ、除外されたインスタンスであるかどうかを定義します（セクション4.3.5を参照）。このプロパティ値がtrueの場合、このCalendarオブジェクトインスタンスはオカレンス拡張から削除する必要があります。このプロパティの欠如、またはそのデフォルト値の存在はfalseとして、このインスタンスをオカレンス拡張に含める必要があることを示します。"
    },
    {
      "indent": 0,
      "text": "4.4. Sharing and Scheduling Properties",
      "section_title": true,
      "ja": "4.4. プロパティの共有とスケジューリング"
    },
    {
      "indent": 0,
      "text": "4.4.1. priority",
      "section_title": true,
      "ja": "4.4.1. 優先"
    },
    {
      "indent": 3,
      "text": "Type: \"Int\" (optional, default: 0)",
      "ja": "タイプ： \"int\"（オプション、デフォルト：0）"
    },
    {
      "indent": 3,
      "text": "This specifies a priority for the calendar object. This may be used as part of scheduling systems to help resolve conflicts for a time period.",
      "ja": "これは、カレンダーオブジェクトの優先順位を指定します。これは、スケジューリングシステムの一部として使用され、期間の競合を解決するのに役立ちます。"
    },
    {
      "indent": 3,
      "text": "The priority is specified as an integer in the range 0 to 9. A value of 0 specifies an undefined priority, for which the treatment will vary by situation. A value of 1 is the highest priority. A value of 2 is the second highest priority. Subsequent numbers specify a decreasing ordinal priority. A value of 9 is the lowest priority. Other integer values are reserved for future use.",
      "ja": "優先順位は0~9の範囲の整数として指定されます。値0は未定義の優先順位を指定します。これは、治療が状況によって異なります。1の値が最も優先されます。値2が2番目に高い優先順位です。後続の数字は減少した順序優先順位を指定します。9の値が最低の優先順位です。他の整数値は将来の使用のために予約されています。"
    },
    {
      "indent": 0,
      "text": "4.4.2. freeBusyStatus",
      "section_title": true,
      "ja": "4.4.2. FreebusyStatus."
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional, default: \"busy\")",
      "ja": "タイプ： \"string\"（オプション、デフォルト： \"busy\"）"
    },
    {
      "indent": 3,
      "text": "This specifies how this calendar object should be treated when calculating free-busy state. This MUST be one of the following values, another value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3):",
      "ja": "これは、自由ビジー状態を計算するときにこのカレンダーオブジェクトをどのように扱うかを指定します。これは、IANA \"JScalendar Enum値\"レジストリ、またはベンダー固有の値に登録されている別の値のいずれかです（セクション3.3を参照）。"
    },
    {
      "indent": 3,
      "text": "\"free\": The object should be ignored when calculating whether the user is busy.",
      "ja": "\"free\"：ユーザーがビジーであるかどうかを計算するときにオブジェクトは無視されるべきです。"
    },
    {
      "indent": 3,
      "text": "\"busy\": The object should be included when calculating whether the user is busy.",
      "ja": "\"Busy\"：ユーザーがビジーであるかどうかを計算するときにオブジェクトを含める必要があります。"
    },
    {
      "indent": 0,
      "text": "4.4.3. privacy",
      "section_title": true,
      "ja": "4.4.3. プライバシー"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional, default: \"public\")",
      "ja": "タイプ： \"string\"（オプション、デフォルト： \"public\"）"
    },
    {
      "indent": 3,
      "text": "Calendar objects are normally collected together and may be shared with other users. The privacy property allows the object owner to indicate that it should not be shared or should only have the time information shared but the details withheld. Enforcement of the restrictions indicated by this property is up to the API via which this object is accessed.",
      "ja": "カレンダーオブジェクトは通常一緒に収集され、他のユーザーと共有される可能性があります。Privacyプロパティを使用すると、オブジェクトの所有者は、共有されていないか、または時間情報が共有されているだけでなく、詳細が差し控えられていることを示すことができます。このプロパティによって示される制限の強制は、このオブジェクトがアクセスされるAPI次第です。"
    },
    {
      "indent": 3,
      "text": "This property MUST NOT affect the information sent to scheduled participants; it is only interpreted by protocols that share the calendar objects belonging to one user with other users.",
      "ja": "このプロパティは、スケジュールされた参加者に送信された情報に影響を与えないでください。1人のユーザーに属するカレンダーオブジェクトを他のユーザーと共有するプロトコルによってのみ解釈されます。"
    },
    {
      "indent": 3,
      "text": "The value MUST be one of the following values, another value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3). Any value the client or server doesn't understand should be preserved but treated as equivalent to \"private\".",
      "ja": "値は、次の値のいずれかでなければなりません。別の値は、IANA \"JScalendar enum値\"レジストリ、またはベンダー固有の値に登録されている（セクション3.3を参照）。クライアントまたはサーバーが理解していない値はすべて保存されるべきですが、「プライベート」と同等のものとして扱われるべきです。"
    },
    {
      "indent": 3,
      "text": "\"public\": The full details of the object are visible to those whom the object's calendar is shared with.",
      "ja": "\"public\"：オブジェクトの詳細は、オブジェクトのカレンダーが共有されている人に表示されます。"
    },
    {
      "indent": 3,
      "text": "\"private\": The details of the object are hidden; only the basic time and metadata are shared. The following properties MAY be shared; any other properties MUST NOT be shared:",
      "ja": "\"Private\"：オブジェクトの詳細は隠されています。基本的な時間とメタデータだけが共有されています。以下のプロパティは共有される可能性があります。他のプロパティを共有してはいけません。"
    },
    {
      "indent": 6,
      "text": "* @type",
      "ja": "* @タイプ"
    },
    {
      "indent": 6,
      "text": "* created",
      "ja": "* 作成した"
    },
    {
      "indent": 6,
      "text": "* due",
      "ja": "* due"
    },
    {
      "indent": 6,
      "text": "* duration",
      "ja": "* 期間"
    },
    {
      "indent": 6,
      "text": "* estimatedDuration",
      "ja": "* 推定"
    },
    {
      "indent": 6,
      "text": "* freeBusyStatus",
      "ja": "* FreebusyStatus."
    },
    {
      "indent": 6,
      "text": "* privacy",
      "ja": "* プライバシー"
    },
    {
      "indent": 6,
      "text": "* recurrenceOverrides (Only patches that apply to another permissible property are allowed to be shared.)",
      "ja": "* RecurrenceOverrides（別の許容プロパティに適用されるパッチのみが共有されます。）"
    },
    {
      "indent": 6,
      "text": "* sequence",
      "ja": "* 順位"
    },
    {
      "indent": 6,
      "text": "* showWithoutTime",
      "ja": "* 見解"
    },
    {
      "indent": 6,
      "text": "* start",
      "ja": "* 開始"
    },
    {
      "indent": 6,
      "text": "* timeZone",
      "ja": "* タイムゾーン"
    },
    {
      "indent": 6,
      "text": "* timeZones",
      "ja": "* 時間帯"
    },
    {
      "indent": 6,
      "text": "* uid",
      "ja": "* UID."
    },
    {
      "indent": 6,
      "text": "* updated",
      "ja": "* 更新しました"
    },
    {
      "indent": 3,
      "text": "\"secret\": The object is hidden completely (as though it did not exist) when the calendar this object is in is shared.",
      "ja": "\"secret\"：このオブジェクトがcalendarの場合、オブジェクトは完全に隠されています（存在しなかったかのように）このオブジェクトが共有されます。"
    },
    {
      "indent": 0,
      "text": "4.4.4. replyTo",
      "section_title": true,
      "ja": "4.4.4. に返信"
    },
    {
      "indent": 3,
      "text": "Type: \"String[String]\" (optional)",
      "ja": "タイプ： \"string [string]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This represents methods by which participants may submit their response to the organizer of the calendar object. The keys in the property value are the available methods and MUST only contain ASCII alphanumeric characters (A-Za-z0-9). The value is a URI for the method specified in the key. Future methods may be defined in future specifications and registered with IANA; a calendar client MUST ignore any method it does not understand but MUST preserve the method key and URI. This property MUST be omitted if no method is defined (rather than being specified as an empty object).",
      "ja": "これは、参加者がカレンダーオブジェクトの主催者に応答を送信することができる方法を表します。プロパティ値のキーは使用可能なメソッドであり、ASCII英数字（A-ZA-Z0-9）のみを含める必要があります。値は、キーで指定されたメソッドのURIです。将来の方法は将来の仕様で定義され、IANAに登録されている可能性があります。カレンダークライアントは、理解できないがメソッドキーとURIを保存する必要がある方法を無視する必要があります。メソッドが定義されていない場合は、（空のオブジェクトとして指定されているのではなく）省略してください。"
    },
    {
      "indent": 3,
      "text": "The following methods are defined:",
      "ja": "以下の方法が定義されています。"
    },
    {
      "indent": 3,
      "text": "\"imip\": The organizer accepts an iCalendar Message-Based Interoperability Protocol (iMIP) [RFC6047] response at this email address. The value MUST be a \"mailto:\" URI.",
      "ja": "\"imip\"：オーガナイザーは、このメールアドレスでのiMIP）[RFC6047]の応答imip）[RFC6047]を受け入れます。値は「Mailto：」URIでなければなりません。"
    },
    {
      "indent": 3,
      "text": "\"web\": Opening this URI in a web browser will provide the user with a page where they can submit a reply to the organizer. The value MUST be a URL using the \"https:\" scheme.",
      "ja": "「Web」：WebブラウザでこのURIを開くと、ユーザーに開催されるページをオーガナイザに返信できるページを提供します。値は \"https：\"スキームを使用したURLでなければなりません。"
    },
    {
      "indent": 3,
      "text": "\"other\": The organizer is identified by this URI, but the method for submitting the response is undefined.",
      "ja": "「その他」：主催者はこのURIによって識別されますが、応答を送信する方法は未定義です。"
    },
    {
      "indent": 0,
      "text": "4.4.5. sentBy",
      "section_title": true,
      "ja": "4.4.5. セントバリー"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional)",
      "ja": "タイプ： \"string\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is the email address in the \"From\" header of the email in which this calendar object was received. This is only relevant if the calendar object is received via iMIP or as an attachment to a message. If set, the value MUST be a valid \"addr-spec\" value as defined in Section 3.4.1 of [RFC5322].",
      "ja": "これは、このカレンダーオブジェクトが受信されたEメールの「From」ヘッダーのEメールアドレスです。これは、カレンダーオブジェクトがIMIPを介して受信されたり、メッセージへの添付ファイルとして受信されたりする場合にのみ関係します。設定されている場合、値は[RFC5322]のセクション3.4.1で定義されている有効な \"addr-spec\"値でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.4.6. participants",
      "section_title": true,
      "ja": "4.4.6. 参加者"
    },
    {
      "indent": 3,
      "text": "Type: \"Id[Participant]\" (optional)",
      "ja": "タイプ： \"ID [参加者]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is a map of participant ids to participants, describing their participation in the calendar object.",
      "ja": "これは、カレンダーオブジェクトへの参加を説明する参加者への参加者IDの地図です。"
    },
    {
      "indent": 3,
      "text": "If this property is set and any participant has a \"sendTo\" property, then the \"replyTo\" property of this calendar object MUST define at least one reply method.",
      "ja": "このプロパティが設定され、参加者が「sendto」プロパティを持つ場合、このカレンダーオブジェクトの \"replyto\"プロパティは少なくとも1つの応答メソッドを定義する必要があります。"
    },
    {
      "indent": 3,
      "text": "A Participant object has the following properties:",
      "ja": "参加者オブジェクトには、次のプロパティがあります。"
    },
    {
      "indent": 3,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"Participant\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは「参加者」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "name: \"String\" (optional) This is the display name of the participant (e.g., \"Joe Bloggs\").",
      "ja": "名前： \"string\"（オプション）これは参加者の表示名（例えば、 \"Joe Bloggs\"）です。"
    },
    {
      "indent": 3,
      "text": "email: \"String\" (optional) This is the email address to use to contact the participant or, for example, match with an address book entry. If set, the value MUST be a valid \"addr-spec\" value as defined in Section 3.4.1 of [RFC5322].",
      "ja": "電子メール： \"string\"（オプション）これは参加者に連絡するために使用する電子メールアドレス、または例えばアドレス帳のエントリと一致します。設定されている場合、値は[RFC5322]のセクション3.4.1で定義されている有効な \"addr-spec\"値でなければなりません。"
    },
    {
      "indent": 3,
      "text": "description: \"String\" (optional) This is a plain-text description of this participant. For example, this may include more information about their role in the event or how best to contact them.",
      "ja": "説明： \"string\"（オプション）これはこの参加者の平凡な説明です。たとえば、これには、イベント内のそれらの役割についてのより多くの情報、またはそれらに連絡するのが最善の方法に含まれるかもしれません。"
    },
    {
      "indent": 3,
      "text": "sendTo: \"String[String]\" (optional) This represents methods by which the participant may receive the invitation and updates to the calendar object.",
      "ja": "sendto： \"string [string]\"（オプション）これは、参加者が招待状とカレンダーオブジェクトへの更新を受信できるメソッドを表します。"
    },
    {
      "indent": 6,
      "text": "The keys in the property value are the available methods and MUST only contain ASCII alphanumeric characters (A-Za-z0-9). The value is a URI for the method specified in the key. Future methods may be defined in future specifications and registered with IANA; a calendar client MUST ignore any method it does not understand but MUST preserve the method key and URI. This property MUST be omitted if no method is defined (rather than being specified as an empty object).",
      "ja": "プロパティ値のキーは使用可能なメソッドであり、ASCII英数字（A-ZA-Z0-9）のみを含める必要があります。値は、キーで指定されたメソッドのURIです。将来の方法は将来の仕様で定義され、IANAに登録されている可能性があります。カレンダークライアントは、理解できないがメソッドキーとURIを保存する必要がある方法を無視する必要があります。メソッドが定義されていない場合は、（空のオブジェクトとして指定されているのではなく）省略してください。"
    },
    {
      "indent": 6,
      "text": "The following methods are defined:",
      "ja": "以下の方法が定義されています。"
    },
    {
      "indent": 6,
      "text": "\"imip\": The participant accepts an iMIP [RFC6047] request at this email address. The value MUST be a \"mailto:\" URI. It MAY be different from the value of the participant's \"email\" property.",
      "ja": "\"imip\"：参加者はこのメールアドレスでiMIP [RFC6047]要求を受け入れます。値は「Mailto：」URIでなければなりません。参加者の「Eメール」プロパティの値とは異なる場合があります。"
    },
    {
      "indent": 6,
      "text": "\"other\": The participant is identified by this URI, but the method for submitting the invitation is undefined.",
      "ja": "「その他」：参加者はこのURIによって識別されますが、招待状を送信する方法は未定義です。"
    },
    {
      "indent": 3,
      "text": "kind: \"String\" (optional) This is what kind of entity this participant is, if known.",
      "ja": "種類： \"string\"（オプション）これはこの参加者が知っている場合はどのような種類のエンティティです。"
    },
    {
      "indent": 6,
      "text": "This MUST be one of the following values, another value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3). Any value the client or server doesn't understand should be treated the same as if this property is omitted.",
      "ja": "これは、次の値のいずれかでなければなりません。別の値は、IANA \"JScalendar Enum値\"レジストリ、またはベンダー固有の値に登録されている（セクション3.3を参照）。このプロパティを省略した場合は、クライアントまたはサーバーが理解していない値を扱う必要があります。"
    },
    {
      "indent": 6,
      "text": "\"individual\": a single person",
      "ja": "「個人」：一人の人物"
    },
    {
      "indent": 6,
      "text": "\"group\": a collection of people invited as a whole",
      "ja": "「グループ」：全体として招待された人のコレクション"
    },
    {
      "indent": 6,
      "text": "\"location\": a physical location that needs to be scheduled, e.g., a conference room",
      "ja": "「場所」：スケジュールされる必要がある物理的な場所、例えば会議室"
    },
    {
      "indent": 6,
      "text": "\"resource\": a non-human resource other than a location, such as a projector",
      "ja": "「リソース」：プロジェクタなどの場所以外の人間の非人事資源"
    },
    {
      "indent": 3,
      "text": "roles: \"String[Boolean]\" (mandatory) This is a set of roles that this participant fulfills.",
      "ja": "役割： \"String [Boolean]\"（必須）これはこの参加者が果たす一連の役割です。"
    },
    {
      "indent": 6,
      "text": "At least one role MUST be specified for the participant. The keys in the set MUST be one of the following values, another value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3):",
      "ja": "参加者に少なくとも1つの役割を指定する必要があります。セット内のキーは、IANA \"JScalendar Enum値\"レジストリ、またはベンダー固有の値に登録されている別の値のいずれかです（セクション3.3を参照）。"
    },
    {
      "indent": 6,
      "text": "\"owner\": The participant is an owner of the object. This signifies they have permission to make changes to it that affect the other participants. Nonowner participants may only change properties that affect only themselves (for example, setting their own alerts or changing their RSVP status).",
      "ja": "「所有者」：参加者はオブジェクトの所有者です。これは他の参加者に影響を与えることを変更する権限を持っていることを意味します。Nonowner参加者は、自分だけに影響を与えるプロパティを変更することができます（たとえば、自分のアラートを設定するか、RSVPステータスの変更）。"
    },
    {
      "indent": 6,
      "text": "\"attendee\": The participant is expected to be present at the event.",
      "ja": "「出席者」：参加者はイベントで存在すると予想されます。"
    },
    {
      "indent": 6,
      "text": "\"optional\": The participant's involvement with the event is optional. This is expected to be primarily combined with the \"attendee\" role.",
      "ja": "\"オプション\"：イベントへの参加者の関与はオプションです。これは主に「出席者」の役割と組み合わせると予想されます。"
    },
    {
      "indent": 6,
      "text": "\"informational\": The participant is copied for informational reasons and is not expected to attend.",
      "ja": "「情報」：参加者は情報上の理由からコピーされ、参加することは期待されていません。"
    },
    {
      "indent": 6,
      "text": "\"chair\": The participant is in charge of the event/task when it occurs.",
      "ja": "「椅子」：参加者が発生したときにイベント/タスクを担当しています。"
    },
    {
      "indent": 6,
      "text": "\"contact\": The participant is someone that may be contacted for information about the event.",
      "ja": "「連絡先」：参加者は、イベントに関する情報について連絡することができる人です。"
    },
    {
      "indent": 6,
      "text": "The value for each key in the map MUST be true. It is expected that no more than one of the roles \"attendee\" and \"informational\" be present; if more than one are given, \"attendee\" takes precedence over \"informational\". Roles that are unknown to the implementation MUST be preserved.",
      "ja": "マップ内の各キーの値はtrueでなければなりません。「参加者」と「情報」のいずれかの役割が存在することが予想されます。複数のものが与えられている場合、「出席者」は「情報」よりも優先されます。実装に不明の役割は保存されなければなりません。"
    },
    {
      "indent": 3,
      "text": "locationId: \"Id\" (optional) This is the location at which this participant is expected to be attending.",
      "ja": "locationId： \"id\"（オプション）これはこの参加者が受講すると予想される場所です。"
    },
    {
      "indent": 6,
      "text": "If the value does not correspond to any location id in the \"locations\" property of the JSCalendar object, this MUST be treated the same as if the participant's locationId were omitted.",
      "ja": "JScalendarオブジェクトの「location」プロパティの位置IDに値が任意の位置IDに対応していない場合は、参加者のLocationIDが省略されている場合と同じように扱われなければなりません。"
    },
    {
      "indent": 3,
      "text": "language: \"String\" (optional) This is the language tag, as defined in [RFC5646], that best describes the participant's preferred language, if known.",
      "ja": "言語： \"string\"（オプション）これは[RFC5646]で定義されている言語タグです。これは、既知であれば参加者の優先言語を最もよく表しています。"
    },
    {
      "indent": 3,
      "text": "participationStatus: \"String\" (optional, default: \"needs-action\") This is the participation status, if any, of this participant.",
      "ja": "PartionStatus： \"string\"（オプション、デフォルト： \"needs-action\"）この参加者の場合は、参加状況です。"
    },
    {
      "indent": 6,
      "text": "The value MUST be one of the following values, another value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3):",
      "ja": "値は、IANA \"JScalendar enum値\"レジストリ、またはベンダー固有の値に登録されている別の値、またはベンダー固有の値のいずれかでなければなりません（セクション3.3を参照）。"
    },
    {
      "indent": 6,
      "text": "\"needs-action\": No status has yet been set by the participant.",
      "ja": "\"ニーズ - アクション\"：参加者がまだステータスが設定されていません。"
    },
    {
      "indent": 6,
      "text": "\"accepted\": The invited participant will participate.",
      "ja": "「承認された」：招待された参加者が参加します。"
    },
    {
      "indent": 6,
      "text": "\"declined\": The invited participant will not participate.",
      "ja": "「辞退」：招待された参加者は参加しません。"
    },
    {
      "indent": 6,
      "text": "\"tentative\": The invited participant may participate.",
      "ja": "「暫定的」：招待された参加者が参加することがあります。"
    },
    {
      "indent": 6,
      "text": "\"delegated\": The invited participant has delegated their attendance to another participant, as specified in the \"delegatedTo\" property.",
      "ja": "「委任」：招待された参加者は、「delegatedto」プロパティで指定されているように、別の参加者に出席を委任しました。"
    },
    {
      "indent": 3,
      "text": "participationComment: \"String\" (optional) This is a note from the participant to explain their participation status.",
      "ja": "参加コメント： \"String\"（オプション）参加者からのメモで、参加ステータスを説明するためのメモです。"
    },
    {
      "indent": 3,
      "text": "expectReply: \"Boolean\" (optional, default: false) If true, the organizer is expecting the participant to notify them of their participation status.",
      "ja": "ExpectReply： \"boolean\"（オプション、デフォルト：false）trueの場合、主催者は参加者に参加状況を通知することを期待しています。"
    },
    {
      "indent": 3,
      "text": "scheduleAgent: \"String\" (optional, default: \"server\") This is who is responsible for sending scheduling messages with this calendar object to the participant.",
      "ja": "ScheduleAgent： \"string\"（オプション、デフォルト： \"server\"）このカレンダーオブジェクトを使用したスケジューリングメッセージを参加者に送信する責任がある人です。"
    },
    {
      "indent": 6,
      "text": "The value MUST be one of the following values, another value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3):",
      "ja": "値は、IANA \"JScalendar enum値\"レジストリ、またはベンダー固有の値に登録されている別の値、またはベンダー固有の値のいずれかでなければなりません（セクション3.3を参照）。"
    },
    {
      "indent": 6,
      "text": "\"server\": The calendar server will send the scheduling messages.",
      "ja": "\"Server\"：カレンダーサーバーはスケジューリングメッセージを送信します。"
    },
    {
      "indent": 6,
      "text": "\"client\": The calendar client will send the scheduling messages.",
      "ja": "「クライアント」：カレンダークライアントはスケジューリングメッセージを送信します。"
    },
    {
      "indent": 6,
      "text": "\"none\": No scheduling messages are to be sent to this participant.",
      "ja": "「なし」：この参加者にスケジュールメッセージを送信することはできません。"
    },
    {
      "indent": 3,
      "text": "scheduleForceSend: \"Boolean\" (optional, default: false) A client may set the property on a participant to true to request that the server send a scheduling message to the participant when it would not normally do so (e.g., if no significant change is made the object or the scheduleAgent is set to client). The property MUST NOT be stored in the JSCalendar object on the server or appear in a scheduling message.",
      "ja": "ScheduleForceDend： \"boolean\"（任意、デフォルト：false）クライアントは、通常、サーバーが通常そうしない場合に（たとえば、重要な変更がない場合は）参加者に参加者にスケジューリングメッセージを送信するように、参加者のプロパティをTrueに設定できます。オブジェクトまたはスケジュールがクライアントに設定されていました。このプロパティは、サーバー上のJScalendarオブジェクトに保存したり、スケジューリング・メッセージに表示されてはいけません。"
    },
    {
      "indent": 3,
      "text": "scheduleSequence: \"UnsignedInt\" (optional, default: 0) This is the sequence number of the last response from the participant. If defined, this MUST be a nonnegative integer.",
      "ja": "ScheduleSequence： \"unsignedint\"（オプション、デフォルト：0）参加者からの最後の応答のシーケンス番号です。定義されている場合、これは非負の整数でなければなりません。"
    },
    {
      "indent": 6,
      "text": "This can be used to determine whether the participant has sent a new response following significant changes to the calendar object and to determine if future responses are responding to a current or older view of the data.",
      "ja": "これは、参加者がカレンダーオブジェクトへの大幅な変更に従って新しい応答を送信し、将来の応答がデータの現在または古いビューに応答しているかどうかを判断するために使用できます。"
    },
    {
      "indent": 3,
      "text": "scheduleStatus: \"String[]\" (optional) This is a list of status codes, returned from the processing of the most recent scheduling message sent to this participant. The status codes MUST be valid \"statcode\" values as defined in the ABNF in Section 3.8.8.3 of [RFC5545].",
      "ja": "scheduleStatus： \"string []\"（オプション）これは、この参加者に送信された最新のスケジューリングメッセージの処理から返されたステータスコードのリストです。ステータスコードは、[RFC5545]のセクション3.8.8.3のABNFで定義されている有効な \"statcode\"値でなければなりません。"
    },
    {
      "indent": 6,
      "text": "Servers MUST only add or change this property when they send a scheduling message to the participant. Clients SHOULD NOT change or remove this property if it was provided by the server. Clients MAY add, change, or remove the property for participants where the client is handling the scheduling.",
      "ja": "サーバーは、参加者にスケジューリングメッセージを送信するときにこのプロパティを追加または変更するだけです。クライアントはサーバーによって提供された場合にこのプロパティを変更または削除しないでください。クライアントは、クライアントがスケジューリングを処理している参加者のプロパティを追加、変更、または削除することができます。"
    },
    {
      "indent": 6,
      "text": "This property MUST NOT be included in scheduling messages.",
      "ja": "このプロパティはメッセージのスケジューリングに含めてはいけません。"
    },
    {
      "indent": 3,
      "text": "scheduleUpdated: \"UTCDateTime\" (optional) This is the timestamp for the most recent response from this participant.",
      "ja": "SplicheUpdated： \"utcdatetime\"（オプション）この参加者からの最新の対応のタイムスタンプです。"
    },
    {
      "indent": 6,
      "text": "This is the \"updated\" property of the last response when using iTIP. It can be compared to the \"updated\" property in future responses to detect and discard older responses delivered out of order.",
      "ja": "これは、ITIPを使用するときの最後の応答の「更新」プロパティです。それは将来の回答の「更新された」プロパティと比較され、順不同の回答を検出して廃棄することができます。"
    },
    {
      "indent": 3,
      "text": "sentBy: \"String\" (optional) This is the email address in the \"From\" header of the email that last updated this participant via iMIP. This SHOULD only be set if the email address is different to that in the mailto URI of this participant's \"imip\" method in the \"sendTo\" property (i.e., the response was received from a different address to that which the invitation was sent to). If set, the value MUST be a valid \"addr-spec\" value as defined in Section 3.4.1 of [RFC5322].",
      "ja": "SentBy： \"string\"（オプション）これは、最後にこの参加者を介して最後に更新されたEメールの「From」ヘッダーの電子メールアドレスです。これは、この参加者の「SENDTO」プロパティの「IMIP」メソッドのMailTo URIのMailTo URIのMailTo URI（つまり、招待状が送信されたアドレスから応答を受信しました）の場合にのみ設定する必要があります。。設定されている場合、値は[RFC5322]のセクション3.4.1で定義されている有効な \"addr-spec\"値でなければなりません。"
    },
    {
      "indent": 3,
      "text": "invitedBy: \"Id\" (optional) This is the id of the participant who added this participant to the event/task, if known.",
      "ja": "招待された「id」（オプション）これは、この参加者を既知であればイベント/タスクに追加した参加者のIDです。"
    },
    {
      "indent": 3,
      "text": "delegatedTo: \"Id[Boolean]\" (optional) This is set of participant ids that this participant has delegated their participation to. Each key in the set MUST be the id of a participant. The value for each key in the map MUST be true. If there are no delegates, this MUST be omitted (rather than specified as an empty set).",
      "ja": "delegatedto： \"id [boolean]\"（オプション）これは参加者が参加を委任した参加者IDのセットです。セット内の各キーは参加者のIDでなければなりません。マップ内の各キーの値はtrueでなければなりません。デリゲートがない場合は、これを省略する必要があります（空のセットとして指定されています）。"
    },
    {
      "indent": 3,
      "text": "delegatedFrom: \"Id[Boolean]\" (optional) This is a set of participant ids that this participant is acting as a delegate for. Each key in the set MUST be the id of a participant. The value for each key in the map MUST be true. If there are no delegators, this MUST be omitted (rather than specified as an empty set).",
      "ja": "delegatedfrom： \"id [boolean]\"（オプション）この参加者が代理人として機能している参加者IDのセットです。セット内の各キーは参加者のIDでなければなりません。マップ内の各キーの値はtrueでなければなりません。委任者がない場合は、これを省略する必要があります（空のセットとして指定されています）。"
    },
    {
      "indent": 3,
      "text": "memberOf: \"Id[Boolean]\" (optional) This is a set of group participants that were invited to this calendar object, which caused this participant to be invited due to their membership in the group(s). Each key in the set MUST be the id of a participant. The value for each key in the map MUST be true. If there are no groups, this MUST be omitted (rather than specified as an empty set).",
      "ja": "memberof： \"id [boolean]（オプション）このカレンダーオブジェクトに招待されたグループ参加者のセットです。これは、この参加者がグループ内のメンバーシップのために招待されました。セット内の各キーは参加者のIDでなければなりません。マップ内の各キーの値はtrueでなければなりません。グループがない場合は、これを省略する必要があります（空のセットとして指定されています）。"
    },
    {
      "indent": 3,
      "text": "links: \"Id[Link]\" (optional) This is a map of link ids to Link objects, representing external resources associated with this participant, for example, a vCard or image. If there are no links, this MUST be omitted (rather than specified as an empty set).",
      "ja": "links： \"id [link]\"（オプション）これは、リンクIDをリンクIDのマップです。これは、この参加者に関連付けられている外部リソース、たとえばVCardまたはImageです。リンクがない場合は、これを省略する必要があります（空のセットとして指定されています）。"
    },
    {
      "indent": 3,
      "text": "progress: \"String\" (optional; only allowed for participants of a Task) This represents the progress of the participant for this task. It MUST NOT be set if the \"participationStatus\" of this participant is any value other than \"accepted\". See Section 5.2.5 for allowed values and semantics.",
      "ja": "進捗： \"string\"（オプションです。タスクの参加者のみのみ許可されています）これは、このタスクの参加者の進行状況を表します。この参加者の「参加者」が「承認済み」以外の値である場合は設定してはいけません。許容値と意味については5.2.5項を参照してください。"
    },
    {
      "indent": 3,
      "text": "progressUpdated: \"UTCDateTime\" (optional; only allowed for participants of a Task) This specifies the date-time the \"progress\" property was last set on this participant. See Section 5.2.6 for allowed values and semantics.",
      "ja": "ProgrestUpdated： \"utcdatetime\"（オプション。タスクの参加者のみのみ許可されています）この参加者の最後に「進行状況」プロパティが最後に設定された日時を指定します。許容値とセマンティクスについては、5.2.6項を参照してください。"
    },
    {
      "indent": 3,
      "text": "percentComplete: \"UnsignedInt\" (optional; only allowed for participants of a Task) This represents the percent completion of the participant for this task. The property value MUST be a positive integer between 0 and 100.",
      "ja": "パーセントComplete： \"unsignedint\"（オプションです。タスクの参加者のみにのみ許可されています）これは、このタスクの参加者の完了率を表します。プロパティ値は、0から100までの正の整数でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4.4.7. requestStatus",
      "section_title": true,
      "ja": "4.4.7. requestStatus."
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional)",
      "ja": "タイプ： \"string\"（オプション）"
    },
    {
      "indent": 3,
      "text": "A request status as returned from processing the most recent scheduling request for this JSCalendar object. The allowed values are defined by the ABNF definitions of \"statcode\", \"statdesc\" and \"extdata\" in Section 3.8.8.3 of [RFC5545] and the following ABNF [RFC5234]:",
      "ja": "このJScalendarオブジェクトの最新のスケジューリング要求の処理から返された要求ステータス。許可された値は、[RFC5545]の3.8.8.3項の「statcode」、「statdesc」、および「extdata」のABNF定義と、次のABNF [RFC5234]によって定義されます。"
    },
    {
      "indent": 3,
      "text": "reqstatus = statcode \";\" statdesc [\";\" extdata]",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Servers MUST only add or change this property when they performe a scheduling action. Clients SHOULD NOT change or remove this property if it was provided by the server. Clients MAY add, change, or remove the property when the client is handling the scheduling.",
      "ja": "サーバーは、スケジューリングアクションを実行するときにこのプロパティを追加または変更するだけです。クライアントはサーバーによって提供された場合にこのプロパティを変更または削除しないでください。クライアントがスケジューリングを処理しているときにクライアントがプロパティを追加、変更、または削除することがあります。"
    },
    {
      "indent": 3,
      "text": "This property MUST only be included in scheduling messages according to the rules defined for the REQUEST-STATUS iCalendar property in [RFC5546].",
      "ja": "このプロパティは、[RFC5546]のRequest-Status iCalendarプロパティに対して定義された規則に従って、メッセージのスケジューリングにのみ含める必要があります。"
    },
    {
      "indent": 0,
      "text": "4.5. Alerts Properties",
      "section_title": true,
      "ja": "4.5. アラートプロパティ"
    },
    {
      "indent": 0,
      "text": "4.5.1. useDefaultAlerts",
      "section_title": true,
      "ja": "4.5.1. UsedEfaultAlerts."
    },
    {
      "indent": 3,
      "text": "Type: \"Boolean\" (optional, default: false)",
      "ja": "型： \"boolean\"（オプション、デフォルト：false）"
    },
    {
      "indent": 3,
      "text": "If true, use the user's default alerts and ignore the value of the \"alerts\" property. Fetching user defaults is dependent on the API from which this JSCalendar object is being fetched and is not defined in this specification. If an implementation cannot determine the user's default alerts, or none are set, it MUST process the \"alerts\" property as if \"useDefaultAlerts\" is set to false.",
      "ja": "trueの場合は、ユーザーのデフォルトのアラートを使用して、「alerts」プロパティの値を無視してください。ユーザーのデフォルトの取得は、このJScalendarオブジェクトがフェッチされているAPIによって異なり、この仕様では定義されていません。実装がユーザーのデフォルトのアラートを判別できない場合、またはNoneが設定されている場合は、 \"aurdefaultalouerts\"がfalseに設定されているかのように \"Alerts\"プロパティを処理する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.5.2. alerts",
      "section_title": true,
      "ja": "4.5.2. 警戒している"
    },
    {
      "indent": 3,
      "text": "Type: \"Id[Alert]\" (optional)",
      "ja": "タイプ： \"id [alert]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is a map of alert ids to Alert objects, representing alerts/ reminders to display or send to the user for this calendar object.",
      "ja": "これは、このカレンダーオブジェクトのユーザーに表示または送信するためのアラート/リマインダを表すオブジェクトを警告するためのアラートIDのマップです。"
    },
    {
      "indent": 3,
      "text": "An Alert object has the following properties:",
      "ja": "アラートオブジェクトには、次のプロパティがあります。"
    },
    {
      "indent": 3,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"Alert\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは「警告」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "trigger: \"OffsetTrigger|AbsoluteTrigger|UnknownTrigger\" (mandatory) This defines when to trigger the alert. New types may be defined in future documents.",
      "ja": "トリガ： \"OffsetTrigger | absoluteTrigger | unknowntrigger\"（必須）これは、いつアラートをトリガーするかを定義します。新しいタイプは将来の文書で定義できます。"
    },
    {
      "indent": 6,
      "text": "An \"OffsetTrigger\" object has the following properties:",
      "ja": "「オフセットトリガー」オブジェクトには、次のプロパティがあります。"
    },
    {
      "indent": 6,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"OffsetTrigger\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは「オフセットトリガー」でなければなりません。"
    },
    {
      "indent": 6,
      "text": "offset: \"SignedDuration\" (mandatory) This defines the offset at which to trigger the alert relative to the time property defined in the \"relativeTo\" property of the alert. Negative durations signify alerts before the time property; positive durations signify alerts after the time property.",
      "ja": "オフセット： \"sindendulation\"（必須）これは、アラートの \"relativeto\"プロパティで定義されているTimeプロパティを基準にしてアラートをトリガするオフセットを定義します。マイナスの持続時間は、Timeプロパティの前にアラートを意味します。肯定的な期間は、Timeプロパティの後にアラートを意味します。"
    },
    {
      "indent": 6,
      "text": "relativeTo: \"String\" (optional, default: \"start\") This specifies the time property that the alert offset is relative to. The value MUST be one of the following:",
      "ja": "RelativeTo： \"string\"（オプション、デフォルト： \"start\"）アラートオフセットが相対的な時間プロパティを指定します。値は次のいずれかでなければなりません。"
    },
    {
      "indent": 9,
      "text": "\"start\": triggers the alert relative to the start of the calendar object",
      "ja": "\"start\"：カレンダーオブジェクトの開始を基準にしてアラートをトリガーします。"
    },
    {
      "indent": 9,
      "text": "\"end\": triggers the alert relative to the end/due time of the calendar object",
      "ja": "\"end\"：カレンダーオブジェクトの終了/期限を基準にしてアラートをトリガーします。"
    },
    {
      "indent": 6,
      "text": "An \"AbsoluteTrigger\" object has the following properties:",
      "ja": "\"AbsoluteTrigger\"オブジェクトには、次のプロパティがあります。"
    },
    {
      "indent": 6,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"AbsoluteTrigger\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは「AbsoluteTrigger」でなければなりません。"
    },
    {
      "indent": 6,
      "text": "when: \"UTCDateTime\" (mandatory) This defines a specific UTC date-time when the alert is triggered.",
      "ja": "\"utcdatetime\"（必須）これは、アラートがトリガされたときの特定のUTC日時を定義します。"
    },
    {
      "indent": 6,
      "text": "An \"UnknownTrigger\" object is an object that contains an \"@type\" property whose value is not recognized (i.e., not \"OffsetTrigger\" or \"AbsoluteTrigger\") plus zero or more other properties. This is for compatibility with client extensions and future specifications. Implementations SHOULD NOT trigger for trigger types they do not understand but MUST preserve them.",
      "ja": "\"UnknownTrigger\"オブジェクトは、値が認識されない \"@type\"プロパティ（すなわち、 \"offsetTrigger\"または \"AbsoluteTrigger\"）と0個以上の他のプロパティを含むオブジェクトです。これは、クライアント拡張と将来の仕様との互換性のためのものです。実装は、理解していないがそれらを保存しなければならないトリガーの種類を引き起こすべきではありません。"
    },
    {
      "indent": 3,
      "text": "acknowledged: \"UTCDateTime\" (optional) This records when an alert was last acknowledged. This is set when the user has dismissed the alert; other clients that sync this property SHOULD automatically dismiss or suppress duplicate alerts (alerts with the same alert id that triggered on or before this date-time).",
      "ja": "確認された： \"utcdatetime\"（オプション）アラートが最後に認められたときのこのレコード。これは、ユーザーがアラートを解除したときに設定されます。このプロパティを同期する他のクライアントは、重複アラートを解除または抑制する必要があります（この日時の前または前にトリガーされた同じアラートIDを持つアラート）。"
    },
    {
      "indent": 6,
      "text": "For a recurring calendar object, setting the \"acknowledged\" property MUST NOT add a new override to the \"recurrenceOverrides\" property. If the alert is not already overridden, the \"acknowledged\" property MUST be set on the alert in the base event/task.",
      "ja": "繰り返しカレンダーオブジェクトの場合、「確認された」プロパティを設定する必要はありません「RecurrenceOverrides」プロパティに新しいオーバーライドを追加しないでください。アラートがまだ上書きされていない場合は、[承認された]プロパティを[基本イベント] / [タスク]で[アラート]に設定する必要があります。"
    },
    {
      "indent": 6,
      "text": "Certain kinds of alert action may not provide feedback as to when the user sees them, for example, email-based alerts. For those kinds of alerts, this property MUST be set immediately when the alert is triggered and the action is successfully carried out.",
      "ja": "特定の種類の警告アクションは、ユーザがそれらを見たとき、例えば電子メールベースのアラートについてのフィードバックを提供することはできないかもしれない。これらの種類のアラートの場合、このプロパティはアラートが発生したときにすぐに設定する必要があり、アクションは正常に実行されます。"
    },
    {
      "indent": 3,
      "text": "relatedTo: \"String[Relation]\" (optional) This relates this alert to other alerts in the same JSCalendar object. If the user wishes to snooze an alert, the application MUST create an alert to trigger after snoozing. This new snooze alert MUST set a parent relation to the identifier of the original alert.",
      "ja": "関連： \"String [Relation]（オプション）このアラートは、同じJScalendarオブジェクト内の他のアラートに関連付けられています。ユーザーがアラートをスヌーズしたい場合、アプリケーションはSnoozingの後にトリガーするアラートを作成する必要があります。この新しいSnoozeアラートは、元のアラートの識別子に親の関係を設定する必要があります。"
    },
    {
      "indent": 3,
      "text": "action: \"String\" (optional, default: \"display\") This describes how to alert the user.",
      "ja": "処置： \"string\"（オプション、デフォルト： \"display\"）ユーザーに警告する方法について説明します。"
    },
    {
      "indent": 6,
      "text": "The value MUST be at most one of the following values, a value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3):",
      "ja": "値は、次のいずれかの値、IANA \"JScalendar enum値\"レジストリ、またはベンダー固有の値に登録されている値（セクション3.3を参照）に、次のいずれかの値でなければなりません。"
    },
    {
      "indent": 6,
      "text": "\"display\": The alert should be displayed as appropriate for the current device and user context.",
      "ja": "「表示」：現在のデバイスとユーザーコンテキストに適したアラートを表示する必要があります。"
    },
    {
      "indent": 6,
      "text": "\"email\": The alert should trigger an email sent out to the user, notifying them of the alert. This action is typically only appropriate for server implementations.",
      "ja": "「Eメール」：アラートは、それらにアラートを通知するようにユーザーに送信された電子メールを起動する必要があります。このアクションは通常、サーバー実装にのみ適切です。"
    },
    {
      "indent": 0,
      "text": "4.6. Multilingual Properties",
      "section_title": true,
      "ja": "4.6. 多言語プロパティ"
    },
    {
      "indent": 0,
      "text": "4.6.1. localizations",
      "section_title": true,
      "ja": "4.6.1. ローカライズ"
    },
    {
      "indent": 3,
      "text": "Type: \"String[PatchObject]\" (optional)",
      "ja": "型： \"String [PatchObject]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "A map where each key is a language tag [RFC5646], and the corresponding value is a set of patches to apply to the calendar object in order to localize it into that locale.",
      "ja": "各キーが言語タグ[RFC5646]で、対応する値は、それをそのロケールにローカライズするためにカレンダーオブジェクトに適用する一連のパッチです。"
    },
    {
      "indent": 3,
      "text": "See the description of PatchObject (Section 1.4.9) for the structure of the PatchObject. The patches are applied to the top-level calendar object. In addition, the \"locale\" property of the patched object is set to the language tag. All pointers for patches MUST end with one of the following suffixes; any patch that does not follow this MUST be ignored unless otherwise specified in a future RFC:",
      "ja": "PatchObjectの構造については、PatchObject（セクション1.4.9）の説明を参照してください。パッチは最上位のカレンダオブジェクトに適用されます。さらに、パッチ付きオブジェクトの \"Locale\"プロパティが言語タグに設定されています。パッチのすべてのポインタは、次のいずれかのサフィックスで終わらなければなりません。これに従わないパッチは、将来のRFCで特に指定されていない限り無視されなければなりません。"
    },
    {
      "indent": 3,
      "text": "* title",
      "ja": "* 題名"
    },
    {
      "indent": 3,
      "text": "* description",
      "ja": "* description"
    },
    {
      "indent": 3,
      "text": "* name",
      "ja": "* 名前"
    },
    {
      "indent": 3,
      "text": "A patch MUST NOT have the prefix \"recurrenceOverrides\"; any localization of the override MUST be a patch to the \"localizations\" property inside the override instead. For example, a patch to \"locations/abcd1234/title\" is permissible, but a patch to \"uid\" or \"recurrenceOverrides/2020-01-05T14:00:00/title\" is not.",
      "ja": "パッチには「RecurrenceOverrides」を付けてはいけません。上書きのローカライズは、代わりに上書き内の「ローカライズ」プロパティへのパッチである必要があります。たとえば、 \"locations / abcd1234 / title\"へのパッチは許可されていますが、 \"uid\"または \"recullenceoverrides / 2020-01-05t14：00：00 / title\"のパッチはありません。"
    },
    {
      "indent": 3,
      "text": "Note that this specification does not define how to maintain validity of localized content. For example, a client application changing a JSCalendar object's \"title\" property might also need to update any localizations of this property. Client implementations SHOULD provide the means to manage localizations, but how to achieve this is specific to the application's workflow and requirements.",
      "ja": "この仕様は、ローカライズされたコンテンツの有効性を維持する方法を定義していません。たとえば、JScalendarオブジェクトの \"title\"プロパティを変更するクライアントアプリケーションは、このプロパティのローカライズを更新する必要もあります。クライアント実装は、ローカライズを管理するための手段を提供する必要がありますが、これを実現する方法はアプリケーションのワークフローと要件に固有のものです。"
    },
    {
      "indent": 0,
      "text": "4.7. Time Zone Properties",
      "section_title": true,
      "ja": "4.7. タイムゾーンのプロパティ"
    },
    {
      "indent": 0,
      "text": "4.7.1. timeZone",
      "section_title": true,
      "ja": "4.7.1. タイムゾーン"
    },
    {
      "indent": 3,
      "text": "Type: \"TimeZoneId|null\" (optional, default: null)",
      "ja": "タイプ： \"timezoneID | null\"（オプション、デフォルト：null）"
    },
    {
      "indent": 3,
      "text": "This identifies the time zone the object is scheduled in or is null for floating time. This is either a name from the IANA Time Zone Database [TZDB] or the TimeZoneId of a custom time zone from the \"timeZones\" property (Section 4.7.2). If omitted, this MUST be presumed to be null (i.e., floating time).",
      "ja": "これにより、オブジェクトがスケジュールされているタイムゾーンがフローティング時間の場合はNULLです。これは、IANA Time Zoneデータベース[TZDB]からの名前または「TimeZones」プロパティ（セクション4.7.2）からのカスタムタイムゾーンのタイムゾーンです。省略した場合、これはNULL（すなわち、フローティングタイム）と推定する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.7.2. timeZones",
      "section_title": true,
      "ja": "4.7.2. 時間帯"
    },
    {
      "indent": 3,
      "text": "Type: \"TimeZoneId[TimeZone]\" (optional)",
      "ja": "タイプ： \"timezoneid [timezone]\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This maps identifiers of custom time zones to their time zone definitions. The following restrictions apply for each key in the map:",
      "ja": "これはカスタムタイムゾーンの識別子をタイムゾーン定義にマッピングします。次の制限事項は、マップ内の各キーに適用されます。"
    },
    {
      "indent": 3,
      "text": "* To avoid conflict with names in the IANA Time Zone Database [TZDB], it MUST start with the \"/\" character.",
      "ja": "* IANAタイムゾーンデータベース[TZDB]の名前との競合を避けるために、「/」文字で始める必要があります。"
    },
    {
      "indent": 3,
      "text": "* It MUST be a valid \"paramtext\" value, as specified in Section 3.1 of [RFC5545].",
      "ja": "* [RFC5545]のセクション3.1で指定されているように、有効な \"ParamText\"値でなければなりません。"
    },
    {
      "indent": 3,
      "text": "* At least one other property in the same JSCalendar object MUST reference a time zone using this identifier (i.e., orphaned time zones are not allowed).",
      "ja": "* 同じJScalendarオブジェクト内の少なくとも1つの他のプロパティは、この識別子を使用してタイムゾーンを参照する必要があります（すなわち、孤立したタイムゾーンは許可されていません）。"
    },
    {
      "indent": 3,
      "text": "An identifier need only be unique to this JSCalendar object. It MAY differ from the \"tzId\" property value of the TimeZone object it maps to.",
      "ja": "識別子はこのJScalendarオブジェクトに固有のものであるだけです。マップするTimeZoneオブジェクトの「TZID」プロパティ値とは異なる場合があります。"
    },
    {
      "indent": 3,
      "text": "A JSCalendar object may be part of a hierarchy of other JSCalendar objects (say, an Event is an entry in a Group). In this case, the set of time zones is the sum of the time zone definitions of this object and its parent objects. If multiple time zones with the same identifier exist, then the definition closest to the calendar object in relation to its parents MUST be used. (In context of Event, a time zone definition in its \"timeZones\" property has precedence over a definition of the same id in the Group). Time zone definitions in any children of the calendar object MUST be ignored.",
      "ja": "JScalendarオブジェクトは、他のJScalendarオブジェクトの階層の一部である可能性があります（たとえば、イベントはグループ内のエントリです）。この場合、一連のタイムゾーンは、このオブジェクトとその親オブジェクトのタイムゾーン定義の合計です。同じ識別子を持つ複数のタイムゾーンが存在する場合は、その両親に関してカレンダーオブジェクトに最も近い定義を使用する必要があります。（イベントのコンテキストでは、その「TimeZones」プロパティのタイムゾーン定義は、グループ内の同じIDの定義よりも優先されます。カレンダーオブジェクトのあらゆる子のタイムゾーン定義は無視されなければなりません。"
    },
    {
      "indent": 3,
      "text": "A TimeZone object maps a VTIMEZONE component from iCalendar, and the semantics are as defined in [RFC5545]. A valid time zone MUST define at least one transition rule in the \"standard\" or \"daylight\" property. Its properties are:",
      "ja": "TimeZoneオブジェクトはiCalendarからVTimeZoneコンポーネントをマッピングし、セマンティクスは[RFC5545]で定義されています。有効なタイムゾーンは、「標準」または「Daylight」プロパティに少なくとも1つの遷移規則を定義する必要があります。そのプロパティは次のとおりです。"
    },
    {
      "indent": 3,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"TimeZone\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは「タイムゾーン」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "tzId: \"String\" (mandatory) This is the TZID property from iCalendar. Note that this implies that the value MUST be a valid \"paramtext\" value as specified in Section 3.1. of [RFC5545].",
      "ja": "tzid： \"string\"（必須）これはiCalendarのTzidプロパティです。これは、セクション3.1で指定されているように、値が有効な \"ParamText\"値でなければならないことに注意してください。[RFC5545]の。"
    },
    {
      "indent": 3,
      "text": "updated: \"UTCDateTime\" (optional) This is the LAST-MODIFIED property from iCalendar.",
      "ja": "更新： \"utcdatetime\"（オプション）これはiCalendarの最後の変更されたプロパティです。"
    },
    {
      "indent": 3,
      "text": "url: \"String\" (optional) This is the TZURL property from iCalendar.",
      "ja": "URL： \"string\"（オプション）これはiCalendarのTzurlプロパティです。"
    },
    {
      "indent": 3,
      "text": "validUntil: \"UTCDateTime\" (optional) This is the TZUNTIL property from iCalendar, specified in [RFC7808].",
      "ja": "validuntil： \"utcdatetime\"（オプション）これは[RFC7808]で指定されているiCalendarのTzunTilプロパティです。"
    },
    {
      "indent": 3,
      "text": "aliases: \"String[Boolean]\" (optional) This maps the TZID-ALIAS-OF properties from iCalendar, specified in [RFC7808], to a JSON set of aliases. The set is represented as an object, with the keys being the aliases. The value for each key in the map MUST be true.",
      "ja": "aliases： \"string [boolean]\"（オプション）これは[RFC7808]で指定されているiCalendarからのTzid-aliasプロパティをJSONのエイリアスセットにマッピングします。セットはオブジェクトとして表され、キーはエイリアスです。マップ内の各キーの値はtrueでなければなりません。"
    },
    {
      "indent": 3,
      "text": "standard: \"TimeZoneRule[]\" (optional) This the STANDARD sub-components from iCalendar. The order MUST be preserved during conversion.",
      "ja": "標準： \"timezonerule []\"（オプション）これはiCalendarの標準的なサブコンポーネントです。順序は変換中に保存されなければなりません。"
    },
    {
      "indent": 3,
      "text": "daylight: \"TimeZoneRule[]\" (optional) This the DAYLIGHT sub-components from iCalendar. The order MUST be preserved during conversion.",
      "ja": "夏時間： \"TimeZonerule []\"（オプション）これはiCalendarの昼間のサブコンポーネントです。順序は変換中に保存されなければなりません。"
    },
    {
      "indent": 3,
      "text": "A TimeZoneRule object maps a STANDARD or DAYLIGHT sub-component from iCalendar, with the restriction that, at most, one recurrence rule is allowed per rule. It has the following properties:",
      "ja": "TimeZoneruleオブジェクトは、ICalendarから標準または昼光サブコンポーネントをマッピングします。これは、ルールごとに1つの再発ルールが許可されているという制限付きでマッピングされます。次のプロパティがあります。"
    },
    {
      "indent": 3,
      "text": "@type: \"String\" (mandatory) This specifies the type of this object. This MUST be \"TimeZoneRule\".",
      "ja": "@type： \"string\"（必須）このオブジェクトの型を指定します。これは「TimeZonerule」でなければなりません。"
    },
    {
      "indent": 3,
      "text": "start: \"LocalDateTime\" (mandatory) This is the DTSTART property from iCalendar.",
      "ja": "start： \"localdatetime\"（必須）これはiCalendarのDTStartプロパティです。"
    },
    {
      "indent": 3,
      "text": "offsetFrom: \"String\" (mandatory) This is the TZOFFSETFROM property from iCalendar.",
      "ja": "offsetFrom： \"string\"（必須）これはiCalendarのTzOffSetFromプロパティです。"
    },
    {
      "indent": 3,
      "text": "offsetTo: \"String\" (mandatory) This is the TZOFFSETTO property from iCalendar.",
      "ja": "オフセット： \"String\"（必須）これはiCalendarのTzoffsettoプロパティです。"
    },
    {
      "indent": 3,
      "text": "recurrenceRules: \"RecurrenceRule[]\" (optional) This is the RRULE property mapped, as specified in Section 4.3.3. During recurrence rule evaluation, the \"until\" property value MUST be interpreted as a local time in the UTC time zone.",
      "ja": "Recurrencerules： \"recurrencerule []\"（オプション）これはセクション4.3.3で指定されているように、これはマッピングされているRRULEプロパティです。再発ルールの評価中は、「まで」プロパティ値がUTCタイムゾーン内の現地時間として解釈されなければなりません。"
    },
    {
      "indent": 3,
      "text": "recurrenceOverrides: \"LocalDateTime[PatchObject]\" (optional) This maps the RDATE properties from iCalendar. The set is represented as an object, with the keys being the recurrence dates. The patch object MUST be the empty JSON object ({}).",
      "ja": "RecurrenceOverrides： \"localDateTime [PatchObject]\"（オプション）これはiCalendarのRDateプロパティをマッピングします。セットはオブジェクトとして表され、キーは繰り返し日です。パッチオブジェクトは、空のJSONオブジェクト（{}）でなければなりません。"
    },
    {
      "indent": 3,
      "text": "names: \"String[Boolean]\" optional) This maps the TZNAME properties from iCalendar to a JSON set. The set is represented as an object, with the keys being the names, excluding any \"tznparam\" component from iCalendar. The value for each key in the map MUST be true.",
      "ja": "names： \"string [boolean]\"オプション）これはiCalendarからのTzNameプロパティをJSONセットにマッピングします。セットはオブジェクトとして表され、キーはiCalendarからの任意の \"tznparam\"コンポーネントを除いて、名前です。マップ内の各キーの値はtrueでなければなりません。"
    },
    {
      "indent": 3,
      "text": "comments: \"String[]\" (optional) This maps the COMMENT properties from iCalendar. The order MUST be preserved during conversion.",
      "ja": "コメント： \"string []\"（オプション）これはiCalendarからのコメントのプロパティをマッピングします。順序は変換中に保存されなければなりません。"
    },
    {
      "indent": 0,
      "text": "5. Type-Specific JSCalendar Properties",
      "section_title": true,
      "ja": "5. タイプ固有のJScalendarプロパティ"
    },
    {
      "indent": 0,
      "text": "5.1. Event Properties",
      "section_title": true,
      "ja": "5.1. イベントのプロパティ"
    },
    {
      "indent": 3,
      "text": "In addition to the common JSCalendar object properties (Section 4), an Event has the following properties:",
      "ja": "一般的なJScalendarオブジェクトプロパティ（セクション4）に加えて、イベントには次のプロパティがあります。"
    },
    {
      "indent": 0,
      "text": "5.1.1. start",
      "section_title": true,
      "ja": "5.1.1. 開始"
    },
    {
      "indent": 3,
      "text": "Type: \"LocalDateTime\" (mandatory)",
      "ja": "タイプ： \"localdatetime\"（必須）"
    },
    {
      "indent": 3,
      "text": "This is the date/time the event starts in the event's time zone (as specified in the \"timeZone\" property, see Section 4.7.1).",
      "ja": "これは、イベントのタイムゾーンでイベントが起動した日時（「TimeZone」プロパティで指定されているように、4.7.1節）を参照してください。"
    },
    {
      "indent": 0,
      "text": "5.1.2. duration",
      "section_title": true,
      "ja": "5.1.2. 期間"
    },
    {
      "indent": 3,
      "text": "Type: \"Duration\" (optional, default: \"PT0S\")",
      "ja": "タイプ： \"duration\"（オプション、デフォルト： \"PT0S\"）"
    },
    {
      "indent": 3,
      "text": "This is the zero or positive duration of the event in the event's start time zone. The end time of an event can be found by adding the duration to the event's start time.",
      "ja": "これは、イベントの開始タイムゾーン内のイベントのゼロまたは正の期間です。イベントの終了時刻は、イベントの開始時刻に期間を追加することによって見つけることができます。"
    },
    {
      "indent": 3,
      "text": "An Event MAY involve start and end locations that are in different time zones (e.g., a transcontinental flight). This can be expressed using the \"relativeTo\" and \"timeZone\" properties of the Event's Location objects (see Section 4.2.5).",
      "ja": "イベントは、異なるタイムゾーン（例えば、Transcontinental Flight）にある開始位置および終了位置を含み得る。これは、イベントの場所オブジェクトの \"relativeto\"と \"timezone\"プロパティを使用して表現できます（4.2.5項を参照）。"
    },
    {
      "indent": 0,
      "text": "5.1.3. status",
      "section_title": true,
      "ja": "5.1.3. 状態"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional, default: \"confirmed\")",
      "ja": "タイプ： \"string\"（オプション、デフォルト： \"acture\"）"
    },
    {
      "indent": 3,
      "text": "This is the scheduling status (Section 4.4) of an Event. If set, it MUST be one of the following values, another value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3):",
      "ja": "これはイベントのスケジューリングステータス（セクション4.4）です。設定されている場合は、次のいずれかの値でなければなりません.IANA \"JScalendar enum値\"レジストリ、またはベンダー固有の値に登録されている別の値（セクション3.3を参照）。"
    },
    {
      "indent": 3,
      "text": "\"confirmed\": indicates the event is definitely happening",
      "ja": "「確認された」：イベントが間違いなく起こっていることを示します"
    },
    {
      "indent": 3,
      "text": "\"cancelled\": indicates the event has been cancelled",
      "ja": "「キャンセル」：イベントがキャンセルされたことを示します"
    },
    {
      "indent": 3,
      "text": "\"tentative\": indicates the event may happen",
      "ja": "「暫定的」：イベントが発生する可能性があることを示します"
    },
    {
      "indent": 0,
      "text": "5.2. Task Properties",
      "section_title": true,
      "ja": "5.2. タスクのプロパティ"
    },
    {
      "indent": 3,
      "text": "In addition to the common JSCalendar object properties (Section 4), a Task has the following properties:",
      "ja": "共通のJScalendarオブジェクトのプロパティ（セクション4）に加えて、タスクには次のプロパティがあります。"
    },
    {
      "indent": 0,
      "text": "5.2.1. due",
      "section_title": true,
      "ja": "5.2.1. due"
    },
    {
      "indent": 3,
      "text": "Type: \"LocalDateTime\" (optional)",
      "ja": "タイプ： \"localdateTime\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is the date/time the task is due in the task's time zone.",
      "ja": "これはタスクがタスクのタイムゾーンに起因する日付/時刻です。"
    },
    {
      "indent": 0,
      "text": "5.2.2. start",
      "section_title": true,
      "ja": "5.2.2. 開始"
    },
    {
      "indent": 3,
      "text": "Type: \"LocalDateTime\" (optional)",
      "ja": "タイプ： \"localdateTime\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This the date/time the task should start in the task's time zone.",
      "ja": "これにより、タスクのタイムゾーンでタスクが起動する日時。"
    },
    {
      "indent": 0,
      "text": "5.2.3. estimatedDuration",
      "section_title": true,
      "ja": "5.2.3. 推定"
    },
    {
      "indent": 3,
      "text": "Type: \"Duration\" (optional)",
      "ja": "タイプ： \"duration\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This specifies the estimated positive duration of time the task takes to complete.",
      "ja": "これは、タスクが完了するのにかかる期間の推定された期間を指定します。"
    },
    {
      "indent": 0,
      "text": "5.2.4. percentComplete",
      "section_title": true,
      "ja": "5.2.4. パーセントコンパート"
    },
    {
      "indent": 3,
      "text": "Type: \"UnsignedInt\" (optional)",
      "ja": "タイプ： \"unsignedint\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This represents the percent completion of the task overall. The property value MUST be a positive integer between 0 and 100.",
      "ja": "これはタスク全体の完了率を表します。プロパティ値は、0から100までの正の整数でなければなりません。"
    },
    {
      "indent": 0,
      "text": "5.2.5. progress",
      "section_title": true,
      "ja": "5.2.5. 進捗"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional)",
      "ja": "タイプ： \"string\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This defines the progress of this task. If omitted, the default progress (Section 4.4) of a Task is defined as follows (in order of evaluation):",
      "ja": "これにより、このタスクの進行状況が定義されています。省略した場合、タスクのデフォルトの進行状況（セクション4.4）は次のように定義されています（評価の順に）。"
    },
    {
      "indent": 3,
      "text": "\"completed\": if the \"progress\" property value of all participants is \"completed\"",
      "ja": "「完了」：すべての参加者の「進捗」プロパティ値が「完了」の場合"
    },
    {
      "indent": 3,
      "text": "\"failed\": if at least one \"progress\" property value of a participant is \"failed\"",
      "ja": "「失敗」：参加者の少なくとも1つの「進捗」プロパティ値が「失敗」の場合"
    },
    {
      "indent": 3,
      "text": "\"in-process\": if at least one \"progress\" property value of a participant is \"in-process\"",
      "ja": "「インプロセス」：参加者の少なくとも1つの「進捗」プロパティ値が「インプロセス」の場合"
    },
    {
      "indent": 3,
      "text": "\"needs-action\": if none of the other criteria match",
      "ja": "「ニーズ - アクション」：他の基準が一致しない場合"
    },
    {
      "indent": 3,
      "text": "If set, it MUST be one of the following values, another value registered in the IANA \"JSCalendar Enum Values\" registry, or a vendor-specific value (see Section 3.3):",
      "ja": "設定されている場合は、次のいずれかの値でなければなりません.IANA \"JScalendar enum値\"レジストリ、またはベンダー固有の値に登録されている別の値（セクション3.3を参照）。"
    },
    {
      "indent": 3,
      "text": "\"needs-action\": indicates the task needs action",
      "ja": "\"Needs-Action\"：タスクのニーズアクションを示します"
    },
    {
      "indent": 3,
      "text": "\"in-process\": indicates the task is in process",
      "ja": "「インプロセス」：タスクがプロセス中のことを示します"
    },
    {
      "indent": 3,
      "text": "\"completed\": indicates the task is completed",
      "ja": "「完了」：タスクが完了したことを示します"
    },
    {
      "indent": 3,
      "text": "\"failed\": indicates the task failed",
      "ja": "\"failed\"：タスクが失敗したことを示します"
    },
    {
      "indent": 3,
      "text": "\"cancelled\": indicates the task was cancelled",
      "ja": "「キャンセル」：タスクがキャンセルされたことを示します"
    },
    {
      "indent": 0,
      "text": "5.2.6. progressUpdated",
      "section_title": true,
      "ja": "5.2.6. 進歩した"
    },
    {
      "indent": 3,
      "text": "Type: \"UTCDateTime\" (optional)",
      "ja": "タイプ： \"utcdatetime\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This specifies the date/time the \"progress\" property of either the task overall (Section 5.2.5) or a specific participant (Section 4.4.6) was last updated.",
      "ja": "これは、タスク全体（セクション5.2.5）または特定の参加者（セクション4.4.6）が最後に更新された日時を指定します。"
    },
    {
      "indent": 3,
      "text": "If the task is recurring and has future instances, a client may want to keep track of the last progress update timestamp of a specific task recurrence but leave other instances unchanged. One way to achieve this is by overriding the \"progressUpdated\" property in the task \"recurrenceOverrides\" property. However, this could produce a long list of timestamps for regularly recurring tasks. An alternative approach is to split the Task into a current, single instance of Task with this instance progress update time and a future recurring instance. See also Section 4.1.3 on splitting.",
      "ja": "タスクが定期的で将来のインスタンスがある場合、クライアントは特定のタスクの再発の最後の進捗更新タイムスタンプを追跡することをお勧めしますが、他のインスタンスを変更しないようにします。これを達成する1つの方法は、タスク \"RecurrenceOverrides\"プロパティの \"ProgressUpdated\"プロパティを上書きすることです。ただし、これは定期的に繰り返し繰り返し作業するためのタイムスタンプの長いリストを作成する可能性があります。別の方法では、このインスタンス進捗更新時刻と将来の繰り返しインスタンスを使用して、タスクを現在のタスクの現在のタスクのインスタンスに分割することです。分割に関するセクション4.1.3も参照してください。"
    },
    {
      "indent": 0,
      "text": "5.3. Group Properties",
      "section_title": true,
      "ja": "5.3. グループのプロパティ"
    },
    {
      "indent": 3,
      "text": "Group supports the following common JSCalendar properties (Section 4):",
      "ja": "グループは、次の一般的なJScalendarプロパティをサポートしています（セクション4）。"
    },
    {
      "indent": 3,
      "text": "* @type",
      "ja": "* @タイプ"
    },
    {
      "indent": 3,
      "text": "* uid",
      "ja": "* UID."
    },
    {
      "indent": 3,
      "text": "* prodId",
      "ja": "* Prodid."
    },
    {
      "indent": 3,
      "text": "* created",
      "ja": "* 作成した"
    },
    {
      "indent": 3,
      "text": "* updated",
      "ja": "* 更新しました"
    },
    {
      "indent": 3,
      "text": "* title",
      "ja": "* 題名"
    },
    {
      "indent": 3,
      "text": "* description",
      "ja": "* description"
    },
    {
      "indent": 3,
      "text": "* descriptionContentType",
      "ja": "* 説明コンテンツタイプ"
    },
    {
      "indent": 3,
      "text": "* links",
      "ja": "* リンク"
    },
    {
      "indent": 3,
      "text": "* locale",
      "ja": "* ロケール"
    },
    {
      "indent": 3,
      "text": "* keywords",
      "ja": "* キーワード"
    },
    {
      "indent": 3,
      "text": "* categories",
      "ja": "* カテゴリー"
    },
    {
      "indent": 3,
      "text": "* color",
      "ja": "* 色"
    },
    {
      "indent": 3,
      "text": "* timeZones",
      "ja": "* 時間帯"
    },
    {
      "indent": 3,
      "text": "In addition, the following Group-specific properties are supported:",
      "ja": "さらに、次のグループ固有のプロパティがサポートされています。"
    },
    {
      "indent": 0,
      "text": "5.3.1. entries",
      "section_title": true,
      "ja": "5.3.1. エントリ"
    },
    {
      "indent": 3,
      "text": "Type: \"(Task|Event)[]\" (mandatory)",
      "ja": "タイプ： \"（タスク|イベント）[]\"（必須）"
    },
    {
      "indent": 3,
      "text": "This is a collection of group members. Implementations MUST ignore entries of unknown type.",
      "ja": "これはグループメンバーの集まりです。実装は、不明な型のエントリを無視する必要があります。"
    },
    {
      "indent": 0,
      "text": "5.3.2. source",
      "section_title": true,
      "ja": "5.3.2. ソース"
    },
    {
      "indent": 3,
      "text": "Type: \"String\" (optional)",
      "ja": "タイプ： \"string\"（オプション）"
    },
    {
      "indent": 3,
      "text": "This is the source from which updated versions of this group may be retrieved. The value MUST be a URI.",
      "ja": "これは、このグループの更新されたバージョンが取得される可能性があるソースです。値はURIでなければなりません。"
    },
    {
      "indent": 0,
      "text": "6. Examples",
      "section_title": true,
      "ja": "6. 例"
    },
    {
      "indent": 3,
      "text": "The following examples illustrate several aspects of the JSCalendar data model and format. The examples may omit mandatory or additional properties, which is indicated by a placeholder property with key \"...\". While most of the examples use calendar event objects, they are also illustrative for tasks.",
      "ja": "次の例は、JScalendarデータモデルとフォーマットのいくつかの態様を示しています。例は、鍵の「...」とPlaceHolderプロパティによって示される必須または追加のプロパティを省略することができます。例のほとんどはカレンダーイベントオブジェクトを使用していますが、それらはタスクにも例示的です。"
    },
    {
      "indent": 0,
      "text": "6.1. Simple Event",
      "section_title": true,
      "ja": "6.1. シンプルなイベント"
    },
    {
      "indent": 3,
      "text": "This example illustrates a simple one-time event. It specifies a one-time event that begins on January 15, 2020 at 1 pm New York local time and ends after 1 hour.",
      "ja": "この例は単純な1回のイベントを示しています。2020年1月15日、午後1時、2020年1月15日のニューヨーク現地時間に始まり1時間後に終了するワンタイムイベントを指定します。"
    },
    {
      "indent": 3,
      "text": "{\n  \"@type\": \"Event\",\n  \"uid\": \"a8df6573-0474-496d-8496-033ad45d7fea\",\n  \"updated\": \"2020-01-02T18:23:04Z\",\n  \"title\": \"Some event\",\n  \"start\": \"2020-01-15T13:00:00\",\n  \"timeZone\": \"America/New_York\",\n  \"duration\": \"PT1H\"\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.2. Simple Task",
      "section_title": true,
      "ja": "6.2. 単純な仕事"
    },
    {
      "indent": 3,
      "text": "This example illustrates a simple task for a plain to-do item.",
      "ja": "この例では、平野のTO-DO項目の簡単な作業を示します。"
    },
    {
      "indent": 3,
      "text": "{\n  \"@type\": \"Task\",\n  \"uid\": \"2a358cee-6489-4f14-a57f-c104db4dc2f2\",\n  \"updated\": \"2020-01-09T14:32:01Z\",\n  \"title\": \"Do something\"\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.3. Simple Group",
      "section_title": true,
      "ja": "6.3. シンプルなグループ"
    },
    {
      "indent": 3,
      "text": "This example illustrates a simple calendar object group that contains an event and a task.",
      "ja": "この例は、イベントとタスクを含む単純なカレンダオブジェクトグループを示しています。"
    },
    {
      "indent": 3,
      "text": "{\n  \"@type\": \"Group\",\n  \"uid\": \"bf0ac22b-4989-4caf-9ebd-54301b4ee51a\",\n  \"updated\": \"2020-01-15T18:00:00Z\",\n  \"name\": \"A simple group\",\n  \"entries\": [{\n    \"@type\": \"Event\",\n    \"uid\": \"a8df6573-0474-496d-8496-033ad45d7fea\",\n    \"updated\": \"2020-01-02T18:23:04Z\",\n    \"title\": \"Some event\",\n    \"start\": \"2020-01-15T13:00:00\",\n    \"timeZone\": \"America/New_York\",\n    \"duration\": \"PT1H\"\n  },\n  {\n    \"@type\": \"Task\",\n    \"uid\": \"2a358cee-6489-4f14-a57f-c104db4dc2f2\",\n    \"updated\": \"2020-01-09T14:32:01Z\",\n    \"title\": \"Do something\"\n  }]\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.4. All-Day Event",
      "section_title": true,
      "ja": "6.4. 終日イベント"
    },
    {
      "indent": 3,
      "text": "This example illustrates an event for an international holiday. It specifies an all-day event on April 1 that occurs every year since the year 1900.",
      "ja": "この例は、国際的な休日のためのイベントを示しています。1900年以来毎年発生する4月1日の終日イベントを指定します。"
    },
    {
      "indent": 3,
      "text": "{\n  \"...\": \"\",\n  \"title\": \"April Fool's Day\",\n  \"showWithoutTime\": true,\n  \"start\": \"1900-04-01T00:00:00\",\n  \"duration\": \"P1D\",\n  \"recurrenceRules\": [{\n    \"@type\": \"RecurrenceRule\",\n    \"frequency\": \"yearly\"\n  }]\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.5. Task with a Due Date",
      "section_title": true,
      "ja": "6.5. 期日のタスク"
    },
    {
      "indent": 3,
      "text": "This example illustrates a task with a due date. It is a reminder to buy groceries before 6 pm Vienna local time on January 19, 2020. The calendar user expects to need 1 hour for shopping.",
      "ja": "この例では、期日を持つタスクを示します。2020年1月19日に午後6時までの議論を購入することは注意事項です。カレンダーユーザーは買い物に1時間を必要とします。"
    },
    {
      "indent": 3,
      "text": "{\n  \"...\": \"\",\n  \"title\": \"Buy groceries\",\n  \"due\": \"2020-01-19T18:00:00\",\n  \"timeZone\": \"Europe/Vienna\",\n  \"estimatedDuration\": \"PT1H\"\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.6. Event with End Time Zone",
      "section_title": true,
      "ja": "6.6. 終了タイムゾーンを持つイベント"
    },
    {
      "indent": 3,
      "text": "This example illustrates the use of end time zones by use of an international flight. The flight starts on April 1, 2020 at 9 am in Berlin local time. The duration of the flight is scheduled at 10 hours 30 minutes. The time at the flight's destination is in the same time zone as Tokyo. Calendar clients could use the end time zone to display the arrival time in Tokyo local time and highlight the time zone difference of the flight. The location names can serve as input for navigation systems.",
      "ja": "この例は、国際飛行を利用した終了時間帯の使用を示しています。フライトは2020年4月1日にベルリン現地時間に午前9時に始まります。フライトの持続時間は10時間30分で予定されています。飛行先の時刻は東京と同じタイムゾーンにあります。カレンダークライアントは、終了タイムゾーンを使用して、東京現地時間に到着時間を表示し、フライトのタイムゾーンの違いを強調表示できます。位置名はナビゲーションシステムの入力として機能することができます。"
    },
    {
      "indent": 3,
      "text": "{\n  \"...\": \"\",\n  \"title\": \"Flight XY51 to Tokyo\",\n  \"start\": \"2020-04-01T09:00:00\",\n  \"timeZone\": \"Europe/Berlin\",\n  \"duration\": \"PT10H30M\",\n  \"locations\": {\n    \"1\": {\n      \"@type\": \"Location\",\n      \"rel\": \"start\",\n      \"name\": \"Frankfurt Airport (FRA)\"\n    },\n    \"2\": {\n      \"@type\": \"Location\",\n      \"rel\": \"end\",\n      \"name\": \"Narita International Airport (NRT)\",\n      \"timeZone\": \"Asia/Tokyo\"\n    }\n  }\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.7. Floating-Time Event (with Recurrence)",
      "section_title": true,
      "ja": "6.7. フローティングタイムイベント（再発）"
    },
    {
      "indent": 3,
      "text": "This example illustrates the use of floating time. Since January 1, 2020, a calendar user blocks 30 minutes every day to practice yoga at 7 am local time in whatever time zone the user is located on that date.",
      "ja": "この例は、フローティング時間の使用を示しています。2020年1月1日以降、カレンダーユーザーは毎日30分をブロックして、ユーザーがその日にあるタイミングゾーンで旧時刻のヨガを現地時間に練習します。"
    },
    {
      "indent": 3,
      "text": "{\n  \"...\": \"\",\n  \"title\": \"Yoga\",\n  \"start\": \"2020-01-01T07:00:00\",\n  \"duration\": \"PT30M\",\n  \"recurrenceRules\": [{\n    \"@type\": \"RecurrenceRule\",\n    \"frequency\": \"daily\"\n  }]\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.8. Event with Multiple Locations and Localization",
      "section_title": true,
      "ja": "6.8. 複数の場所とローカライズを持つイベント"
    },
    {
      "indent": 3,
      "text": "This example illustrates an event that happens at both a physical and a virtual location. Fans can see a live concert on premises or online. The event title and descriptions are localized.",
      "ja": "この例は、物理的な場所と仮想的な場所の両方で発生したイベントを示しています。ファンは敷地内またはオンラインでライブコンサートを見ることができます。イベントのタイトルと説明はローカライズされています。"
    },
    {
      "indent": 3,
      "text": "{\n  \"...\": \"\",\n  \"title\": \"Live from Music Bowl: The Band\",\n  \"description\": \"Go see the biggest music event ever!\",\n  \"locale\": \"en\",\n  \"start\": \"2020-07-04T17:00:00\",\n  \"timeZone\": \"America/New_York\",\n  \"duration\": \"PT3H\",\n  \"locations\": {\n    \"c0503d30-8c50-4372-87b5-7657e8e0fedd\": {\n      \"@type\": \"Location\",\n      \"name\": \"The Music Bowl\",\n      \"description\": \"Music Bowl, Central Park, New York\",\n      \"coordinates\": \"geo:40.7829,-73.9654\"\n    }\n  },\n  \"virtualLocations\": {\n    \"vloc1\": {\n      \"@type\": \"VirtualLocation\",\n      \"name\": \"Free live Stream from Music Bowl\",\n      \"uri\": \"https://stream.example.com/the_band_2020\"\n    }\n  },\n  \"localizations\": {\n    \"de\": {\n      \"title\": \"Live von der Music Bowl: The Band!\",\n      \"description\": \"Schau dir das größte Musikereignis an!\",\n      \"virtualLocations/vloc1/name\":\n        \"Gratis Live-Stream aus der Music Bowl\"\n    }\n  }\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.9. Recurring Event with Overrides",
      "section_title": true,
      "ja": "6.9. 上書きを持つ繰り返しイベント"
    },
    {
      "indent": 3,
      "text": "This example illustrates the use of recurrence overrides. A math course at a university is held for the first time on January 8, 2020 at 9 am London time and occurs every week until June 24, 2020. Each lecture lasts for one hour and 30 minutes and is located at the Mathematics department. This event has exceptional occurrences: at the last occurrence of the course is an exam, which lasts for 2 hours and starts at 10 am. Also, the location of the exam differs from the usual location. On April 1, no course is held. On January 7 at 2 pm, there is an optional introduction course, which occurs before the first regular lecture.",
      "ja": "この例は、再発のオーバーライドの使用を示しています。2020年1月8日に2020年1月8日に大学での数学コースが開催され、2020年6月24日まで毎週発生します。各講義は1時間30分続き、数学部門にあります。このイベントには並外れた発生があります。コースの最後の発生では試験で、2時間続き、午前10時から始まります。また、試験の場所は通常の場所とは異なります。4月1日、コースは開催されません。1月7日の午後2時には、最初の定期講義の前に発生するオプションの紹介コースがあります。"
    },
    {
      "indent": 3,
      "text": "{\n  \"...\": \"\",\n  \"title\": \"Calculus I\",\n  \"start\": \"2020-01-08T09:00:00\",\n  \"timeZone\": \"Europe/London\",\n  \"duration\": \"PT1H30M\",\n  \"locations\": {\n    \"mlab\": {\n      \"@type\": \"Location\",\n      \"title\": \"Math lab room 1\",\n      \"description\": \"Math Lab I, Department of Mathematics\"\n    }\n  },\n  \"recurrenceRules\": [{\n    \"@type\": \"RecurrenceRule\",\n    \"frequency\": \"weekly\",\n    \"until\": \"2020-06-24T09:00:00\"\n  }],\n  \"recurrenceOverrides\": {\n    \"2020-01-07T14:00:00\": {\n      \"title\": \"Introduction to Calculus I (optional)\"\n    },\n    \"2020-04-01T09:00:00\": {\n      \"excluded\": true\n    },\n    \"2020-06-25T09:00:00\": {\n      \"title\": \"Calculus I Exam\",\n      \"start\": \"2020-06-25T10:00:00\",\n      \"duration\": \"PT2H\",\n      \"locations\": {\n        \"auditorium\": {\n          \"@type\": \"Location\",\n          \"title\": \"Big Auditorium\",\n          \"description\": \"Big Auditorium, Other Road\"\n        }\n      }\n    }\n  }\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "6.10. Recurring Event with Participants",
      "section_title": true,
      "ja": "6.10. 参加者との繰り返しイベント"
    },
    {
      "indent": 3,
      "text": "This example illustrates scheduled events. A team meeting occurs every week since January 8, 2020 at 9 am Johannesburg time. The event owner also chairs the event. Participants meet in a virtual meeting room. An attendee has accepted the invitation, but, on March 4, 2020, he is unavailable and declined participation for this occurrence.",
      "ja": "この例では、スケジュールされたイベントを示します。2020年1月8日からヨハネスブルグ時に毎週チーム会議が行われます。イベントの所有者もイベントを務めます。参加者は仮想会議室で会います。出席者は招待状を受け入れましたが、2020年3月4日、彼は利用できず、この出現の参加を拒否しています。"
    },
    {
      "indent": 3,
      "text": "{\n  \"...\": \"\",\n  \"title\": \"FooBar team meeting\",\n  \"start\": \"2020-01-08T09:00:00\",\n  \"timeZone\": \"Africa/Johannesburg\",\n  \"duration\": \"PT1H\",\n  \"virtualLocations\": {\n    \"0\": {\n      \"@type\": \"VirtualLocation\",\n      \"name\": \"ChatMe meeting room\",\n      \"uri\": \"https://chatme.example.com?id=1234567&pw=a8a24627b63d\"\n    }\n  },\n  \"recurrenceRules\": [{\n    \"@type\": \"RecurrenceRule\",\n    \"frequency\": \"weekly\"\n  }],\n  \"replyTo\": {\n    \"imip\": \"mailto:f245f875-7f63-4a5e-a2c8@schedule.example.com\"\n  },\n  \"participants\": {\n    \"dG9tQGZvb2Jhci5xlLmNvbQ\": {\n      \"@type\": \"Participant\",\n      \"name\": \"Tom Tool\",\n      \"email\": \"tom@foobar.example.com\",\n      \"sendTo\": {\n        \"imip\": \"mailto:tom@calendar.example.com\"\n      },\n      \"participationStatus\": \"accepted\",\n      \"roles\": {\n        \"attendee\": true\n      }\n    },\n    \"em9lQGZvb2GFtcGxlLmNvbQ\": {\n      \"@type\": \"Participant\",\n      \"name\": \"Zoe Zelda\",\n      \"email\": \"zoe@foobar.example.com\",\n      \"sendTo\": {\n        \"imip\": \"mailto:zoe@foobar.example.com\"\n      },\n      \"participationStatus\": \"accepted\",\n      \"roles\": {\n        \"owner\": true,\n        \"attendee\": true,\n        \"chair\": true\n      }\n    }\n  },\n  \"recurrenceOverrides\": {\n    \"2020-03-04T09:00:00\": {\n      \"participants/dG9tQGZvb2Jhci5xlLmNvbQ/participationStatus\":\n                                                          \"declined\"\n    }\n  }\n}",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Calendaring and scheduling information is very privacy sensitive. It can reveal the social network of a user, location information of this user and those in their social network, identity and credentials information, and patterns of behavior of the user in both the physical and cyber realm. Additionally, calendar events and tasks can influence the physical location of a user or their cyber behavior within a known time window. Its transmission and storage must be done carefully to protect it from possible threats, such as eavesdropping, replay, message insertion, deletion, modification, and on-path attacks.",
      "ja": "カレンダー情報とスケジューリング情報は非常にプライバシーに敏感です。それは、ユーザーのソーシャルネットワーク、このユーザーの位置情報、およびそれらのソーシャルネットワーク、アイデンティティおよびクレデンシャル情報、および物理的およびサイバーレルムの両方でユーザーの動作のパターンを明らかにすることができます。さらに、カレンダーイベントとタスクは、既知の時間ウィンドウ内のユーザーの物理的な場所またはそのサイバーの動作に影響を与える可能性があります。その伝送と保管は、盗聴、再生、メッセージの挿入、削除、修正、およびオンパスの攻撃など、可能な脅威から保護するために慎重に行われなければなりません。"
    },
    {
      "indent": 3,
      "text": "The data being stored and transmitted may be used in systems with real-world consequences. For example, a home automation system may turn an alarm on and off or a coworking space may charge money to the organizer of an event that books one of their meeting rooms. Such systems must be careful to authenticate all data they receive to prevent them from being subverted and ensure the change comes from an authorized entity.",
      "ja": "記憶され送信されているデータは、現実世界の結果を有するシステムで使用されてもよい。例えば、ホームオートメーションシステムは、アラームをオンオフまたはオフまたはオフにすることができ、あるいはカウコーキングスペースは、その本が彼らの会議室の1つの本の主催者にお金を充電するかもしれません。そのようなシステムは、それらが逆転されないようにするために受けるすべてのデータを認証するように注意しなければならず、変更が許可されたエンティティからのものであることを確認する必要があります。"
    },
    {
      "indent": 3,
      "text": "This document only defines the data format; such considerations are primarily the concern of the API or method of storage and transmission of such files.",
      "ja": "この文書はデータ形式のみを定義します。そのような考慮事項は、主に、そのようなファイルの保存および送信のAPIまたは送信方法の関心事である。"
    },
    {
      "indent": 0,
      "text": "7.1. Expanding Recurrences",
      "section_title": true,
      "ja": "7.1. 再発を展開しています"
    },
    {
      "indent": 3,
      "text": "A recurrence rule may produce infinite occurrences of an event. Implementations MUST handle expansions carefully to prevent accidental or deliberate resource exhaustion.",
      "ja": "再発規則は、イベントの無限の発生を生み出すことがあります。実装は、偶発的または意図的なリソースの枯渇を防ぐために慎重に拡張を処理する必要があります。"
    },
    {
      "indent": 3,
      "text": "Conversely, a recurrence rule may be specified that does not expand to anything. It is not always possible to tell this through static analysis of the rule, so implementations MUST be careful to avoid getting stuck in infinite loops or otherwise exhausting resources while searching for the next occurrence.",
      "ja": "逆に、何にも展開されない再発規則を指定することができます。ルールの静的分析を通してこれを伝えることは必ずしも可能ではないので、インフォメーションループやその他の場合は次の出現を検索しながらリソースを排出するのを避けるように注意しなければなりません。"
    },
    {
      "indent": 3,
      "text": "Events recur in the event's time zone. If the user is in a different time zone, daylight saving transitions may cause an event that normally occurs at, for example, 9 am to suddenly shift an hour earlier. This may be used in an attempt to cause a participant to miss an important meeting. User agents must be careful to translate date-times correctly between time zones and may wish to call out unexpected changes in the time of a recurring event.",
      "ja": "イベントはイベントのタイムゾーンで再発します。ユーザが異なるタイムゾーンにある場合、夏時間の遷移は、例えば9歳で通常1時間を早くシフトさせるイベントを引き起こす可能性がある。これは、参加者に重要な会議を見逃すことを試みることができます。ユーザーエージェントは、時間帯の間で日時を正しく翻訳するように注意してください、そして、繰り返しのイベントの時に予期しない変更を求めることができます。"
    },
    {
      "indent": 0,
      "text": "7.2. JSON Parsing",
      "section_title": true,
      "ja": "7.2. JSON PARSING"
    },
    {
      "indent": 3,
      "text": "The security considerations of [RFC8259] apply to the use of JSON as the data interchange format.",
      "ja": "[RFC8259]のセキュリティ上の考慮事項は、データ交換形式としてJSONの使用に適用されます。"
    },
    {
      "indent": 3,
      "text": "As for any serialization format, parsers need to thoroughly check the syntax of the supplied data. JSON uses opening and closing tags for several types and structures, and it is possible that the end of the supplied data will be reached when scanning for a matching closing tag; this is an error condition, and implementations need to stop scanning at the end of the supplied data.",
      "ja": "シリアル化フォーマットについては、パーサーが提供されたデータの構文を十分に確認する必要があります。JSONは、いくつかの種類や構造体について開閉タグを使用し、一致する閉鎖タグをスキャンするときに供給されたデータの終わりに達する可能性があります。これはエラー状態であり、供給されたデータの最後にスキャンを停止する必要があります。"
    },
    {
      "indent": 3,
      "text": "JSON also uses a string encoding with some escape sequences to encode special characters within a string. Care is needed when processing these escape sequences to ensure that they are fully formed before the special processing is triggered, with special care taken when the escape sequences appear adjacent to other (non-escaped) special characters or adjacent to the end of data (as in the previous paragraph).",
      "ja": "JSONはまた、ストリング内の特殊文字をエンコードするために一部のエスケープシーケンスを使用して文字列エンコーディングを使用します。これらのエスケープシーケンスを処理するときには、特別な処理がトリガされる前に完全に形成され、エスケープシーケンスが他の（非エスケープされていない）の特殊文字またはデータの終わりに隣接するように見られるようにするために、特別な注意を払って、特別な注意を払って注意が必要です。前の段落で。"
    },
    {
      "indent": 3,
      "text": "If parsing JSON into a non-textual structured data format, implementations may need to allocate storage to hold JSON string elements. Since JSON does not use explicit string lengths, the risk of denial of service due to resource exhaustion is small, but implementations may still wish to place limits on the size of allocations they are willing to make in any given context, to avoid untrusted data causing excessive memory allocation.",
      "ja": "JSONを非テキスト構造化データ形式に解析する場合、実装はJSON文字列要素を保持するためにストレージを割り当てる必要があるかもしれません。JSONは明示的な文字列の長さを使用しないので、リソースの枯渇によるサービス拒否のリスクは小さくなりますが、信頼されていないデータを引き起こすのを防ぐために、実装は割り当てのサイズに制限を希望する場合があります。過度のメモリ割り当て"
    },
    {
      "indent": 0,
      "text": "7.3. URI Values",
      "section_title": true,
      "ja": "7.3. URI値"
    },
    {
      "indent": 3,
      "text": "Several JSCalendar properties contain URIs as values, and processing these properties requires extra care. Section 7 of [RFC3986] discusses security risks related to URIs.",
      "ja": "いくつかのJScalendarプロパティには値としてのURIが含まれており、これらのプロパティの処理には特別な注意が必要です。[RFC3986]のセクション7は、URIに関連するセキュリティリスクについて説明します。"
    },
    {
      "indent": 3,
      "text": "Fetching remote resources carries inherent risks. Connections must only be allowed on well-known ports, using allowed protocols (generally, just HTTP/HTTPS on their default ports). The URL must be resolved externally and not allowed to access internal resources. Connecting to an external source reveals IP (and therefore often location) information.",
      "ja": "リモートリソースの取得は、固有のリスクを担います。接続は許可されたプロトコル（通常はデフォルトのポートでのHTTP / HTTPSのみ）を使用して、よく知られているポートでのみ許可されている必要があります。URLは外部で解決され、内部リソースへのアクセスを許可されていなければなりません。外部ソースへの接続は、IP（そしてそれ故に場所）情報を明らかにします。"
    },
    {
      "indent": 3,
      "text": "A maliciously constructed JSCalendar object may contain a very large number of URIs. In the case of published calendars with a large number of subscribers, such objects could be widely distributed. Implementations should be careful to limit the automatic fetching of linked resources to reduce the risk of this being an amplification vector for a denial-of-service attack.",
      "ja": "悪意を持って構築されたJScalendarオブジェクトには、非常に多数のURIが含まれている可能性があります。多数の加入者を持つ公開されたカレンダーの場合、そのようなオブジェクトは広く分散される可能性があります。実装は、リンク拒否攻撃のための増幅ベクトルであるというリスクを減らすために、リンクされたリソースの自動フェッチを制限するように注意してください。"
    },
    {
      "indent": 0,
      "text": "7.4. Spam",
      "section_title": true,
      "ja": "7.4. スパム"
    },
    {
      "indent": 3,
      "text": "Calendar systems may receive JSCalendar files from untrusted sources, in particular, as attachments to emails. This can be a vector for an attacker to inject spam into a user's calendar. This may confuse, annoy, and mislead users or overwhelm their calendar with bogus events, preventing them from seeing legitimate ones.",
      "ja": "カレンダーシステムは、特に電子メールへの添付ファイルとして、信頼できないソースからJScalendarファイルを受信することがあります。これは、攻撃者がスパムをユーザーのカレンダーに注入するためのベクトルになる可能性があります。これは、ユーザーが偽のイベントで自分のカレンダーを混乱させる、または誤解を招く可能性があり、それらが正当なものを見るのを防ぎます。"
    },
    {
      "indent": 3,
      "text": "Heuristic, statistical, or machine-learning-based filters can be effective in filtering out spam. Authentication mechanisms, such as DomainKeys Identified Mail (DKIM) [RFC6376], can help establish the source of messages and associate the data with existing relationships (such as an address book contact). However, misclassifications are always possible and providing a mechanism for users to quickly correct this is advised.",
      "ja": "ヒューリスティック、統計的、または機械学習ベースのフィルタは、スパムを除去するのに効果的です。DomainKeys識別メール（DKIM）[RFC6376]などの認証メカニズムは、メッセージの送信元を確立し、既存の関係（アドレス帳の接点など）を関連付けるのに役立ちます。しかしながら、誤分類は常に可能であり、ユーザがこれをすばやく修正するためのメカニズムを提供する。"
    },
    {
      "indent": 3,
      "text": "Confusable unicode characters may be used to trick a user into trusting a JSCalendar file that appears to come from a known contact but is actually from a similar-looking source controlled by an attacker.",
      "ja": "既知の連絡先から来るように見えるが実際には攻撃者によって制御されている同様のソースからのjscalendarファイルを信頼するためにユーザーをトリックするために、混乱可能なUnicode文字を使用することができます。"
    },
    {
      "indent": 0,
      "text": "7.5. Duplication",
      "section_title": true,
      "ja": "7.5. 複製"
    },
    {
      "indent": 3,
      "text": "It is important for calendar systems to maintain the UID of an event when updating it to avoid an unexpected duplication of events. Consumers of the data may not remove the previous version of the event if it has a different UID. This can lead to a confusing situation for the user, with many variations of the event and no indication of which one is correct. Care must be taken by consumers of the data to remove old events where possible to avoid an accidental denial-of-service attack due to the volume of data.",
      "ja": "予期しないイベントの重複を回避するために、カレンダーシステムがイベントのUIDを更新することを維持することが重要です。データの消費者は、異なるUIDがある場合、イベントの以前のバージョンを削除することはできません。これは、イベントの多くのバリエーションを使用して、どちらが正しいのかというわけではなく、ユーザーにとって混乱している状況につながる可能性があります。データの量のために偶発的なサービス拒否攻撃を避けるために、データの消費者によって注意を払う必要があります。"
    },
    {
      "indent": 0,
      "text": "7.6. Time Zones",
      "section_title": true,
      "ja": "7.6. 時間帯"
    },
    {
      "indent": 3,
      "text": "Events recur in a particular time zone. When this differs from the user's current time zone, it may unexpectedly cause an occurrence to shift in time for that user due to a daylight savings change in the event's time zone. A maliciously crafted event could attempt to confuse users with such an event to ensure a meeting is missed.",
      "ja": "イベントは特定のタイムゾーンで再発します。これがユーザの現在のタイムゾーンとは異なる場合、イベントのタイムゾーンで夏時間の変化により、そのユーザの間に発生したときに発生が発生する可能性がある。故意に作られたイベントが、会議が見逃されるように、ユーザーをそのようなイベントと混同しようとする可能性があります。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "8.1. Media Type Registration",
      "section_title": true,
      "ja": "8.1. メディアタイプ登録"
    },
    {
      "indent": 3,
      "text": "This document defines a media type for use with JSCalendar data formatted in JSON.",
      "ja": "このドキュメントは、JSCRendarデータフォーマットされたJSCalendarデータで使用するためのメディアタイプを定義します。"
    },
    {
      "indent": 3,
      "text": "Type name: application",
      "ja": "タイプ名：アプリケーション"
    },
    {
      "indent": 3,
      "text": "Subtype name: jscalendar+json",
      "ja": "サブタイプ名：JScalendar JSON."
    },
    {
      "indent": 3,
      "text": "Required parameters: type",
      "ja": "必要なパラメータ：タイプ"
    },
    {
      "indent": 6,
      "text": "The \"type\" parameter conveys the type of the JSCalendar data in the body part. The allowed parameter values correspond to the \"@type\" property of the JSON-formatted JSCalendar object in the body:",
      "ja": "「Type」パラメータは、身体部分のJScalendarデータの型を伝えます。許容されるパラメータ値は、本文のJSON形式のJScalendarオブジェクトの \"@type\"プロパティに対応します。"
    },
    {
      "indent": 6,
      "text": "\"event\": The \"@type\" property value MUST be \"Event\".",
      "ja": "\"event\"： \"@type\"プロパティ値は \"event\"でなければなりません。"
    },
    {
      "indent": 6,
      "text": "\"task\": The \"@type\" property value MUST be \"Task\".",
      "ja": "\"タスク\"： \"@type\"プロパティ値は \"タスク\"でなければなりません。"
    },
    {
      "indent": 6,
      "text": "\"group\": The \"@type\" property value MUST be \"Group\".",
      "ja": "\"Group\"： \"@type\"プロパティ値は \"group\"でなければなりません。"
    },
    {
      "indent": 6,
      "text": "No other parameter values are allowed. The parameter MUST NOT occur more than once.",
      "ja": "他のパラメータ値は許可されていません。パラメータは複数回発生してはいけません。"
    },
    {
      "indent": 3,
      "text": "Optional parameters: none",
      "ja": "オプションのパラメータ：なし"
    },
    {
      "indent": 3,
      "text": "Encoding considerations: This is the same as the encoding considerations of application/json, as specified in Section 11 of [RFC8259].",
      "ja": "エンコードに関する考慮事項：[RFC8259]のセクション11で指定されているように、これはアプリケーション/ JSONの符号化考慮事項と同じです。"
    },
    {
      "indent": 3,
      "text": "Security considerations: See Section 7 of this document.",
      "ja": "セキュリティ上の考慮事項：この文書のセクション7を参照してください。"
    },
    {
      "indent": 3,
      "text": "Interoperability considerations: While JSCalendar is designed to avoid ambiguities as much as possible, when converting objects from other calendar formats to/from JSCalendar, it is possible that differing representations for the same logical data or ambiguities in interpretation might arise. The semantic equivalence of two JSCalendar objects may be determined differently by different applications, for example, where URL values differ in case between the two objects.",
      "ja": "相互運用性の考慮事項：jscalendarは可能な限りあいまいさを避けるように設計されていますが、他のカレンダーフォーマットからJScalendarとの間でオブジェクトを変換すると、同じ論理データまたは解釈のあいまいさの異なる表現が発生する可能性があります。2つのオブジェクトの間には、2つのオブジェクトの間にURL値が異なる場合、2つのJScalendarオブジェクトの意味的な等価性が異なるアプリケーションによって異なるように決定されてもよい。"
    },
    {
      "indent": 3,
      "text": "Published specification: RFC 8984",
      "ja": "公開仕様：RFC 8984"
    },
    {
      "indent": 3,
      "text": "Applications that use this media type: Applications that currently make use of the text/calendar and application/calendar+json media types can use this as an alternative. Similarly, applications that use the application/json media type to transfer calendaring data can use this to further specify the content.",
      "ja": "このメディアタイプを使用するアプリケーション：現在テキスト/カレンダーとアプリケーション/ Calendar JSONメディアタイプを使用しているアプリケーションは、これを代替として使用できます。同様に、Application / JSONメディアタイプを使用してカレンドデータを転送するアプリケーションは、これを使用してコンテンツをさらに指定できます。"
    },
    {
      "indent": 3,
      "text": "Fragment identifier considerations: A JSON Pointer fragment identifier may be used, as defined in [RFC6901], Section 6.",
      "ja": "フラグメント識別子の考慮事項：[RFC6901]、セクション6で定義されているように、JSONポインタフラグメント識別子を使用できます。"
    },
    {
      "indent": 3,
      "text": "Additional information:  Magic number(s):  N/A",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 28,
      "text": "File extensions(s):  N/A",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 28,
      "text": "Macintosh file type code(s):  N/A",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Person & email address to contact for further information: calsify@ietf.org",
      "ja": "詳細については、連絡先のある人とEメールアドレス：calsify@ietf.org"
    },
    {
      "indent": 3,
      "text": "Intended usage: COMMON",
      "ja": "意図された使用法：一般的な"
    },
    {
      "indent": 3,
      "text": "Restrictions on usage: N/A",
      "ja": "使用制限：N / A."
    },
    {
      "indent": 3,
      "text": "Author: See the \"Author's Address\" section of this document.",
      "ja": "著者：この文書の「作者の住所」を参照してください。"
    },
    {
      "indent": 3,
      "text": "Change controller: IETF",
      "ja": "変更コントローラ：IETF."
    },
    {
      "indent": 0,
      "text": "8.2. Creation of the \"JSCalendar Properties\" Registry",
      "section_title": true,
      "ja": "8.2. \"JScalendar Properties\"レジストリの作成"
    },
    {
      "indent": 3,
      "text": "IANA has created the \"JSCalendar Properties\" registry to allow interoperability of extensions to JSCalendar objects.",
      "ja": "IANAは、JScalendarオブジェクトへの拡張子の相互運用性を可能にするために「JScalendar Properties」レジストリを作成しました。"
    },
    {
      "indent": 3,
      "text": "This registry follows the Expert Review process ([RFC8126], Section 4.5). If the \"Intended Usage\" field is \"common\", sufficient documentation is required to enable interoperability. Preliminary community review for this registry is optional but strongly encouraged.",
      "ja": "このレジストリは、エキスパートレビュープロセスに従います（[RFC8126]、4.5）。「意図された使い方」フィールドが「一般的」である場合は、相互運用性を可能にするには十分な文書化が必要です。このレジストリの予備コミュニティレビューはオプションですが、強く奨励されています。"
    },
    {
      "indent": 3,
      "text": "A registration can have an intended usage of \"common\", \"reserved\", or \"obsolete\". IANA will list registrations with a common usage designation prominently and separately from those with other intended usage values.",
      "ja": "登録は、「一般的な」、「予約」、または「時代遅れ」の使用目的の使用をすることができます。IANAは、他の意図された使用値を持つものとは、際立った一般的な使用法で登録をリストします。"
    },
    {
      "indent": 3,
      "text": "A \"reserved\" registration reserves a property name without assigning semantics to avoid name collisions with future extensions or protocol use.",
      "ja": "「予約済み」登録は、将来の拡張子またはプロトコル使用を伴う名前の衝突を避けるためにセマンティクスを割り当てることなくプロパティ名を予約します。"
    },
    {
      "indent": 3,
      "text": "An \"obsolete\" registration denotes a property that is no longer expected to be added by up-to-date systems. A new property has probably been defined covering the obsolete property's semantics.",
      "ja": "「時代遅れ」登録は、最新のシステムによって追加されることが期待されなくなったプロパティを表します。古い財産は、時代遅れの財産のセマンティクスをカバーすることを定義されています。"
    },
    {
      "indent": 3,
      "text": "The JSCalendar property registration procedure is not a formal standards process but rather an administrative procedure intended to allow community comment and check it is coherent without excessive time delay. It is designed to encourage vendors to document and register new properties they add for use cases not covered by the original specification, leading to increased interoperability.",
      "ja": "JScalendarプロパティ登録手順は正式な標準プロセスではなく、コミュニティのコメントを許可することを目的とした管理手順は、過度の時間遅延なしにコヒーレントであることを目的としています。ベンダーが、元の仕様によってカバーされていない使用例を追加する新しいプロパティを文書化し登録するように設計されており、相互運用性が向上します。"
    },
    {
      "indent": 0,
      "text": "8.2.1. Preliminary Community Review",
      "section_title": true,
      "ja": "8.2.1. 予備コミュニティレビュー"
    },
    {
      "indent": 3,
      "text": "Notice of a potential new registration SHOULD be sent to the Calext mailing list <calsify@ietf.org> for review. This mailing list is appropriate to solicit community feedback on a proposed new property.",
      "ja": "潜在的な新規登録の通知は、ReviewのためにCALEXTメーリングリスト<calsify@ietf.org>に送信する必要があります。このメーリングリストは、提案された新しいプロパティに関するコミュニティフィードバックを求めるのに適しています。"
    },
    {
      "indent": 3,
      "text": "Property registrations must be marked with their intended use: \"common\", \"reserved\", or \"obsolete\".",
      "ja": "プロパティ登録は、「一般的な」、「予約」、または「時代遅れ」という目的でマークされている必要があります。"
    },
    {
      "indent": 3,
      "text": "The intent of the public posting to this list is to solicit comments and feedback on the choice of the property name, the unambiguity of the specification document, and a review of any interoperability or security considerations. The submitter may submit a revised registration proposal or abandon the registration completely at any time.",
      "ja": "このリストへのパブリック投稿の意図は、プロパティ名の選択、仕様文書の曖昧さ、およびどの相互運用性またはセキュリティ上の考慮事項の見直しに関するコメントとフィードバックを求めることです。提出者は改訂登録提案を提出するか、いつでも登録を完全に放棄することができます。"
    },
    {
      "indent": 0,
      "text": "8.2.2. Submit Request to IANA",
      "section_title": true,
      "ja": "8.2.2. IANAにリクエストを送信してください"
    },
    {
      "indent": 3,
      "text": "Registration requests can be sent to <iana@iana.org>.",
      "ja": "登録要求は<iana@iana.org>に送信できます。"
    },
    {
      "indent": 0,
      "text": "8.2.3. Designated Expert Review",
      "section_title": true,
      "ja": "8.2.3. 指定されたエキスパートレビュー"
    },
    {
      "indent": 3,
      "text": "The primary concern of the designated expert (DE) is preventing name collisions and encouraging the submitter to document security and privacy considerations. For a common-use registration, the DE is expected to confirm that suitable documentation, as described in Section 4.6 of [RFC8126], is available to ensure interoperability. That documentation will usually be in an RFC, but simple definitions are likely to use a web/wiki page, and if a sentence or two is deemed sufficient, it could be described in the registry itself. The DE should also verify that the property name does not conflict with work that is active or already published within the IETF. A published specification is not required for reserved or obsolete registrations.",
      "ja": "指定された専門家（DE）の主な関心事は、名前の衝突を防ぎ、提出者がセキュリティとプライバシーの考慮事項を文書化することを奨励しています。一般的な登録のために、DEは[RFC8126]のセクション4.6で説明されているように、適切な資料が相互運用性を確保するために利用可能であることを確認すると予想されます。そのドキュメントは通常RFCにありますが、単純な定義はWeb / Wikiページを使用する可能性があり、文または2つが十分に見られた場合は、レジストリ自体に記述できます。DEはまた、プロパティ名がアクティブな作業またはIETF内で既に公開されている作業と競合しないことを確認する必要があります。公開された仕様は、予約済みまたは時代遅れの登録には必要ありません。"
    },
    {
      "indent": 3,
      "text": "The DE will either approve or deny the registration request and publish a notice of the decision to the Calext WG mailing list or its successor, as well as inform IANA. A denial notice must be justified by an explanation, and, in the cases where it is possible, concrete suggestions on how the request can be modified so as to become acceptable should be provided.",
      "ja": "DEは登録要求を承認または拒否し、CALEXT WGメーリングリストまたはその後継者、およびIANAに知らせる通知を公開します。説明によって拒否されなければならず、可能性がある場合には、要求を許容するようにどのように変更することができるかについての具体的な提案を提供する必要がある。"
    },
    {
      "indent": 0,
      "text": "8.2.4. Change Procedures",
      "section_title": true,
      "ja": "8.2.4. 手続きを変更する"
    },
    {
      "indent": 3,
      "text": "Once a JSCalendar property has been published by IANA, the change controller may request a change to its definition. The same procedure that would be appropriate for the original registration request is used to process a change request.",
      "ja": "JScalendarプロパティがIANAによって公開されると、変更コントローラはその定義に変更を要求することができます。元の登録要求に適しているのと同じ手順を使用して変更要求を処理するために使用されます。"
    },
    {
      "indent": 3,
      "text": "JSCalendar property registrations may not be deleted; properties that are no longer believed appropriate for use can be declared obsolete by a change to their \"intended usage\" field; such properties will be clearly marked in the IANA registry.",
      "ja": "JScalendarプロパティ登録は削除されない場合があります。使用に適しているとはもはや信じられないプロパティは、「意図された使用」フィールドへの変更によって時代遅れに宣言することができます。そのような特性は、IANAレジストリには明確にマークされます。"
    },
    {
      "indent": 3,
      "text": "Significant changes to a JSCalendar property's definition should be requested only when there are serious omissions or errors in the published specification, as such changes may cause interoperability issues. When review is required, a change request may be denied if it renders entities that were valid under the previous definition invalid under the new definition.",
      "ja": "JScalendarプロパティの定義に対する重要な変更は、公開された仕様に重大な省略やエラーがある場合にのみ要求されるべきです。そのような変更は相互運用性の問題を引き起こす可能性があります。レビューが必要な場合は、新しい定義の下で、前の定義の下で有効なエンティティをレンダリングすると、変更要求が拒否されることがあります。"
    },
    {
      "indent": 3,
      "text": "The owner of a JSCalendar property may pass responsibility to another person or agency by informing IANA; this can be done without discussion or review.",
      "ja": "JScalendarプロパティの所有者は、IANAに知らせることによって他の人または代理店に責任を負う可能性があります。これは議論やレビューなしで行うことができます。"
    },
    {
      "indent": 0,
      "text": "8.2.5. \"JSCalendar Properties\" Registry Template",
      "section_title": true,
      "ja": "8.2.5. \"JScalendarプロパティ\"レジストリテンプレート"
    },
    {
      "indent": 3,
      "text": "Property Name: This is the name of the property. The property name MUST NOT already be registered for any of the object types listed in the \"Property Context\" field of this registration. Other object types MAY already have registered a different property with the same name; however, the same name SHOULD only be used when the semantics are analogous.",
      "ja": "プロパティ名：これはプロパティの名前です。この登録の「プロパティコンテキスト」フィールドにリストされているオブジェクトタイプのいずれにも登録されてはいけません。他のオブジェクトタイプはすでに同じ名前の異なるプロパティを登録しているかもしれません。ただし、セマンティクスが類似している場合にのみ同じ名前を使用する必要があります。"
    },
    {
      "indent": 3,
      "text": "Property Type: This is the type of this property, using type signatures, as specified in Section 1.3. The property type MUST be registered in the \"JSCalendar Types\" registry.",
      "ja": "プロパティタイプ：これは、セクション1.3で指定されているように、タイプシグネチャを使用して、このプロパティの型です。プロパティタイプは \"JScalendar Types\"レジストリに登録する必要があります。"
    },
    {
      "indent": 3,
      "text": "Property Context: This is a comma-separated list of JSCalendar object types this property is allowed on.",
      "ja": "プロパティのコンテキスト：これはJScalendarオブジェクト型のコンマ区切りリストですこのプロパティは許可されています。"
    },
    {
      "indent": 3,
      "text": "Reference or Description: This is a brief description or RFC number and section reference where the property is specified (omitted for \"reserved\" property names).",
      "ja": "参照または説明：これは、プロパティが指定されている簡単な説明またはRFC番号およびセクション参照です（「予約済み」プロパティ名については省略）。"
    },
    {
      "indent": 3,
      "text": "Intended Usage: This may be \"common\", \"reserved\", or \"obsolete\".",
      "ja": "意図された用途：これは「一般的な」、「予約」、または「時代遅れ」でもかまいません。"
    },
    {
      "indent": 3,
      "text": "Change Controller: This is who may request a change to this entry's definition (\"IETF\" for RFCs from the IETF stream).",
      "ja": "変更コントローラ：このエントリの定義（IETFストリームからのRFCの場合は \"IETF\"）の変更を要求するかもしれません。"
    },
    {
      "indent": 0,
      "text": "8.2.6. Initial Contents for the \"JSCalendar Properties\" Registry",
      "section_title": true,
      "ja": "8.2.6. \"JScalendar Properties\"レジストリの初期内容"
    },
    {
      "indent": 3,
      "text": "The following table lists the initial entries of the \"JSCalendar Properties\" registry. All properties are for common use. All RFC section references are for this document. The change controller for all these properties is \"IETF\".",
      "ja": "次の表に、「JScalendar Properties」レジストリの初期エントリを示します。すべてのプロパティは一般的な用途です。すべてのRFCセクションの参照はこの文書のためのものです。これらすべてのプロパティの変更コントローラは \"IETF\"です。"
    },
    {
      "indent": 3,
      "text": "+====================+=================+================+===========+\n|Property Name       |Property Type    |Property Context|Reference  |\n|                    |                 |                |or         |\n|                    |                 |                |Description|\n+====================+=================+================+===========+\n|@type               |String           |Event, Task,    |Section    |\n|                    |                 |Group,          |4.1.1,     |\n|                    |                 |AbsoluteTrigger,|Section    |\n|                    |                 |Alert, Link,    |4.5.2,     |\n|                    |                 |Location, NDay, |Section    |\n|                    |                 |OffsetTrigger,  |1.4.11,    |\n|                    |                 |Participant,    |Section    |\n|                    |                 |RecurrenceRule, |4.2.5,     |\n|                    |                 |Relation,       |Section    |\n|                    |                 |TimeZone,       |4.4.6,     |\n|                    |                 |TimeZoneRule,   |Section    |\n|                    |                 |VirtualLocation |4.3.3,     |\n|                    |                 |                |Section    |\n|                    |                 |                |1.4.10,    |\n|                    |                 |                |Section    |\n|                    |                 |                |4.7.2,     |\n|                    |                 |                |Section    |\n|                    |                 |                |4.2.6      |\n+--------------------+-----------------+----------------+-----------+\n|acknowledged        |UTCDateTime      |Alert           |Section    |\n|                    |                 |                |4.5.2      |\n+--------------------+-----------------+----------------+-----------+\n|action              |String           |Alert           |Section    |\n|                    |                 |                |4.5.2      |\n+--------------------+-----------------+----------------+-----------+\n|alerts              |Id[Alert]        |Event, Task     |Section    |\n|                    |                 |                |4.5.2      |\n+--------------------+-----------------+----------------+-----------+\n|aliases             |String[Boolean]  |TimeZone        |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|byDay               |NDay[]           |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|byHour              |UnsignedInt[]    |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|byMinute            |UnsignedInt[]    |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|byMonth             |String[]         |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|byMonthDay          |Int[]            |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|bySecond            |UnsignedInt[]    |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|bySetPosition       |Int[]            |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|byWeekNo            |Int[]            |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|byYearDay           |Int[]            |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|categories          |String[Boolean]  |Event, Task,    |Section    |\n|                    |                 |Group           |4.2.10     |\n+--------------------+-----------------+----------------+-----------+\n|cid                 |String           |Link            |Section    |\n|                    |                 |                |1.4.11     |\n+--------------------+-----------------+----------------+-----------+\n|color               |String           |Event, Task,    |Section    |\n|                    |                 |Group           |4.2.11     |\n+--------------------+-----------------+----------------+-----------+\n|comments            |String[]         |TimeZoneRule    |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|contentType         |String           |Link            |Section    |\n|                    |                 |                |1.4.11     |\n+--------------------+-----------------+----------------+-----------+\n|coordinates         |String           |Location        |Section    |\n|                    |                 |                |4.2.5      |\n+--------------------+-----------------+----------------+-----------+\n|count               |UnsignedInt      |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|created             |UTCDateTime      |Event, Task,    |Section    |\n|                    |                 |Group           |4.1.5      |\n+--------------------+-----------------+----------------+-----------+\n|day                 |String           |NDay            |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|daylight            |TimeZoneRule[]   |TimeZone        |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|delegatedFrom       |Id[Boolean]      |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|delegatedTo         |Id[Boolean]      |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|description         |String           |Event, Task,    |Section    |\n|                    |                 |Location,       |4.2.2,     |\n|                    |                 |Participant,    |Section    |\n|                    |                 |VirtualLocation |4.2.5,     |\n|                    |                 |                |Section    |\n|                    |                 |                |4.4.6,     |\n|                    |                 |                |Section    |\n|                    |                 |                |4.2.6      |\n+--------------------+-----------------+----------------+-----------+\n|description         |String           |Event, Task     |Section    |\n|ContentType         |                 |                |4.2.3      |\n+--------------------+-----------------+----------------+-----------+\n|display             |String           |Link            |Section    |\n|                    |                 |                |1.4.11     |\n+--------------------+-----------------+----------------+-----------+\n|due                 |LocalDateTime    |Task            |Section    |\n|                    |                 |                |5.2.1      |\n+--------------------+-----------------+----------------+-----------+\n|duration            |Duration         |Event           |Section    |\n|                    |                 |                |5.1.2      |\n+--------------------+-----------------+----------------+-----------+\n|email               |String           |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|entries             |(Task|Event)[]   |Group           |Section    |\n|                    |                 |                |5.3.1      |\n+--------------------+-----------------+----------------+-----------+\n|estimatedDuration   |Duration         |Task            |Section    |\n|                    |                 |                |5.2.3      |\n+--------------------+-----------------+----------------+-----------+\n|excluded            |Boolean          |Event, Task     |Section    |\n|                    |                 |                |4.3.6      |\n+--------------------+-----------------+----------------+-----------+\n|excluded            |RecurrenceRule[] |Event, Task     |Section    |\n|RecurrenceRules     |                 |                |4.3.4      |\n+--------------------+-----------------+----------------+-----------+\n|expectReply         |Boolean          |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|features            |String[Boolean]  |VirtualLocation |Section    |\n|                    |                 |                |4.2.6      |\n+--------------------+-----------------+----------------+-----------+\n|firstDayOfWeek      |String           |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|freeBusyStatus      |String           |Event, Task     |Section    |\n|                    |                 |                |4.4.2      |\n+--------------------+-----------------+----------------+-----------+\n|frequency           |String           |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|href                |String           |Link            |Section    |\n|                    |                 |                |1.4.11     |\n+--------------------+-----------------+----------------+-----------+\n|interval            |UnsignedInt      |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|invitedBy           |Id               |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|keywords            |String[Boolean]  |Event, Task,    |Section    |\n|                    |                 |Group           |4.2.9      |\n+--------------------+-----------------+----------------+-----------+\n|kind                |String           |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|language            |String           |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|links               |Id[Link]         |Group, Event,   |Section    |\n|                    |                 |Task, Location, |4.2.7,     |\n|                    |                 |Participant     |Section    |\n|                    |                 |                |4.2.5,     |\n|                    |                 |                |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|locale              |String           |Group, Event,   |Section    |\n|                    |                 |Task            |4.2.8      |\n+--------------------+-----------------+----------------+-----------+\n|localizations       |String           |Event, Task     |Section    |\n|                    |[PatchObject]    |                |4.6.1      |\n+--------------------+-----------------+----------------+-----------+\n|locationId          |Id               |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|locations           |Id[Location]     |Event, Task     |Section    |\n|                    |                 |                |4.2.5      |\n+--------------------+-----------------+----------------+-----------+\n|locationTypes       |String[Boolean]  |Location        |Section    |\n|                    |                 |                |4.2.5      |\n+--------------------+-----------------+----------------+-----------+\n|memberOf            |Id[Boolean]      |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|method              |String           |Event, Task     |Section    |\n|                    |                 |                |4.1.8      |\n+--------------------+-----------------+----------------+-----------+\n|name                |String           |Location,       |Section    |\n|                    |                 |VirtualLocation,|4.2.5,     |\n|                    |                 |Participant     |Section    |\n|                    |                 |                |4.2.6,     |\n|                    |                 |                |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|names               |String[Boolean]  |TimeZoneRule    |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|nthOfPeriod         |Int              |NDay            |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|offset              |SignedDuration   |OffsetTrigger   |Section    |\n|                    |                 |                |4.5.2      |\n+--------------------+-----------------+----------------+-----------+\n|offsetFrom          |UTCDateTime      |TimeZoneRule    |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|offsetTo            |UTCDateTime      |TimeZoneRule    |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|participants        |Id[Participant]  |Event, Task     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|participationComment|String           |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|participationStatus |String           |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|percentComplete     |UnsignedInt      |Task,           |Section    |\n|                    |                 |Participant     |5.2.4      |\n+--------------------+-----------------+----------------+-----------+\n|priority            |Int              |Event, Task     |Section    |\n|                    |                 |                |4.4.1      |\n+--------------------+-----------------+----------------+-----------+\n|privacy             |String           |Event, Task     |Section    |\n|                    |                 |                |4.4.3      |\n+--------------------+-----------------+----------------+-----------+\n|prodId              |String           |Event, Task,    |Section    |\n|                    |                 |Group           |4.1.4      |\n+--------------------+-----------------+----------------+-----------+\n|progress            |String           |Task,           |Section    |\n|                    |                 |Participant     |5.2.5      |\n+--------------------+-----------------+----------------+-----------+\n|progressUpdated     |UTCDateTime      |Task,           |Section    |\n|                    |                 |Participant     |5.2.6      |\n+--------------------+-----------------+----------------+-----------+\n|recurrenceId        |LocalDateTime    |Event, Task     |Section    |\n|                    |                 |                |4.3.1      |\n+--------------------+-----------------+----------------+-----------+\n|recurrenceIdTimeZone|TimeZoneId|null  |Event, Task     |Section    |\n|                    |                 |                |4.3.2      |\n+--------------------+-----------------+----------------+-----------+\n|recurrenceOverrides |LocalDateTime    |Event, Task,    |Section    |\n|                    |[PatchObject]    |TimeZoneRule    |4.3.5,     |\n|                    |                 |                |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|recurrenceRules     |RecurrenceRule[] |Event, Task,    |Section    |\n|                    |                 |TimeZoneRule    |4.3.3,     |\n|                    |                 |                |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|rel                 |String           |Link            |Section    |\n|                    |                 |                |1.4.11     |\n+--------------------+-----------------+----------------+-----------+\n|relatedTo           |String[Relation] |Event, Task,    |Section    |\n|                    |                 |Alert           |4.1.3,     |\n|                    |                 |                |Section    |\n|                    |                 |                |4.5.2      |\n+--------------------+-----------------+----------------+-----------+\n|relation            |String[Boolean]  |Relation        |Section    |\n|                    |                 |                |1.4.10     |\n+--------------------+-----------------+----------------+-----------+\n|relativeTo          |String           |OffsetTrigger,  |Section    |\n|                    |                 |Location        |4.5.2,     |\n|                    |                 |                |Section    |\n|                    |                 |                |4.2.5      |\n+--------------------+-----------------+----------------+-----------+\n|replyTo             |String[String]   |Event, Task     |Section    |\n|                    |                 |                |4.4.4      |\n+--------------------+-----------------+----------------+-----------+\n|requestStatus       |String           |Event, Task     |Section    |\n|                    |                 |                |4.4.7      |\n+--------------------+-----------------+----------------+-----------+\n|roles               |String[Boolean]  |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|rscale              |String           |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|sentBy              |String           |Event, Task,    |Section    |\n|                    |                 |Participant     |4.4.5,     |\n|                    |                 |                |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|standard            |TimeZoneRule[]   |TimeZone        |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|start               |LocalDateTime    |TimeZoneRule    |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|scheduleAgent       |String           |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|scheduleForceSend   |Boolean          |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|scheduleSequence    |UnsignedInt      |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|scheduleStatus      |String[]         |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|scheduleUpdated     |UTCDateTime      |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|sendTo              |String[String]   |Participant     |Section    |\n|                    |                 |                |4.4.6      |\n+--------------------+-----------------+----------------+-----------+\n|sequence            |UnsignedInt      |Event, Task     |Section    |\n|                    |                 |                |4.1.7      |\n+--------------------+-----------------+----------------+-----------+\n|showWithoutTime     |Boolean          |Event, Task     |Section    |\n|                    |                 |                |4.2.4      |\n+--------------------+-----------------+----------------+-----------+\n|size                |UnsignedInt      |Link            |Section    |\n|                    |                 |                |1.4.11     |\n+--------------------+-----------------+----------------+-----------+\n|skip                |String           |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|source              |String           |Group           |Section    |\n|                    |                 |                |5.3.2      |\n+--------------------+-----------------+----------------+-----------+\n|start               |LocalDateTime    |Event, Task     |Section    |\n|                    |                 |                |5.1.1,     |\n|                    |                 |                |Section    |\n|                    |                 |                |5.2.2      |\n+--------------------+-----------------+----------------+-----------+\n|status              |String           |Event           |Section    |\n|                    |                 |                |5.1.3      |\n+--------------------+-----------------+----------------+-----------+\n|timeZone            |TimeZoneId|null  |Event, Task,    |Section    |\n|                    |                 |Location        |4.7.1,     |\n|                    |                 |                |Section    |\n|                    |                 |                |4.2.5      |\n+--------------------+-----------------+----------------+-----------+\n|timeZones           |TimeZoneId       |Event, Task     |Section    |\n|                    |[TimeZone]       |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|title               |String           |Event, Task,    |Section    |\n|                    |                 |Group, Link     |4.2.1      |\n+--------------------+-----------------+----------------+-----------+\n|trigger             |OffsetTrigger|   |Alert           |Section    |\n|                    |AbsoluteTrigger| |                |4.5.2      |\n|                    |UnknownTrigger   |                |           |\n+--------------------+-----------------+----------------+-----------+\n|tzId                |String           |TimeZone        |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|uid                 |String           |Event, Task,    |Section    |\n|                    |                 |Group           |4.1.2      |\n+--------------------+-----------------+----------------+-----------+\n|until               |LocalDateTime    |RecurrenceRule  |Section    |\n|                    |                 |                |4.3.3      |\n+--------------------+-----------------+----------------+-----------+\n|updated             |UTCDateTime      |Event, Task,    |Section    |\n|                    |                 |Group           |4.1.6      |\n+--------------------+-----------------+----------------+-----------+\n|uri                 |String           |VirtualLocation |Section    |\n|                    |                 |                |4.2.6      |\n+--------------------+-----------------+----------------+-----------+\n|url                 |String           |TimeZone        |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|useDefaultAlerts    |Boolean          |Event, Task     |Section    |\n|                    |                 |                |4.5.1      |\n+--------------------+-----------------+----------------+-----------+\n|validUntil          |UTCDateTime      |TimeZone        |Section    |\n|                    |                 |                |4.7.2      |\n+--------------------+-----------------+----------------+-----------+\n|virtualLocations    |Id               |Event, Task     |Section    |\n|                    |[VirtualLocation]|                |4.2.6      |\n+--------------------+-----------------+----------------+-----------+\n|when                |UTCDateTime      |AbsoluteTrigger |Section    |\n|                    |                 |                |4.5.2      |\n+--------------------+-----------------+----------------+-----------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 5,
      "text": "Table 1: Initial Contents of the \"JSCalendar Properties\" Registry",
      "ja": "表1：「JScalendar Properties」レジストリの初期内容"
    },
    {
      "indent": 0,
      "text": "8.3. Creation of the \"JSCalendar Types\" Registry",
      "section_title": true,
      "ja": "8.3. 「JScalendar Type」レジストリの作成"
    },
    {
      "indent": 3,
      "text": "IANA has created the \"JSCalendar Types\" registry to avoid name collisions and provide a complete reference for all data types used for JSCalendar property values. The registration process is the same as for the \"JSCalendar Properties\" registry, as defined in Section 8.2.",
      "ja": "IANAは名前の衝突を避けるために「JScalendar Type」レジストリを作成し、JScalendarプロパティ値に使用されるすべてのデータ型に完全な参照を提供しました。登録プロセスは、セクション8.2で定義されているように、「JScalendar Properties」レジストリと同じです。"
    },
    {
      "indent": 0,
      "text": "8.3.1. \"JSCalendar Types\" Registry Template",
      "section_title": true,
      "ja": "8.3.1. \"JScalendar Types\"レジストリテンプレート"
    },
    {
      "indent": 3,
      "text": "Type Name: the name of the type",
      "ja": "タイプ名：タイプの名前"
    },
    {
      "indent": 3,
      "text": "Reference or Description: a brief description or RFC number and section reference where the Type is specified (may be omitted for \"reserved\" type names)",
      "ja": "参照または説明：タイプが指定されている簡単な説明またはRFC番号およびセクション参照（予約済みの名前の名前の場合は省略される可能性があります）"
    },
    {
      "indent": 3,
      "text": "Intended Use: common, reserved, or obsolete",
      "ja": "使用目的：一般的な、予約済み、または廃止されたもの"
    },
    {
      "indent": 3,
      "text": "Change Controller: who may request a change to this entry's definition (\"IETF\" for RFCs from the IETF stream)",
      "ja": "変更コントローラ：誰がこのエントリの定義に変更を要求することができます（IETFストリームからのRFCの場合は \"IETF\"）"
    },
    {
      "indent": 0,
      "text": "8.3.2. Initial Contents for the \"JSCalendar Types\" Registry",
      "section_title": true,
      "ja": "8.3.2. \"JScalendar Types\"レジストリの初期内容"
    },
    {
      "indent": 3,
      "text": "The following table lists the initial entries of the JSCalendar Types registry. All properties are for common use. All RFC section references are for this document. The change controller for all these properties is \"IETF\".",
      "ja": "次の表に、JScalendar型レジストリの初期エントリを示します。すべてのプロパティは一般的な用途です。すべてのRFCセクションの参照はこの文書のためのものです。これらすべてのプロパティの変更コントローラは \"IETF\"です。"
    },
    {
      "indent": 3,
      "text": "+=================+==========================+\n| Type Name       | Reference or Description |\n+=================+==========================+\n| Alert           | Section 4.5.2            |\n+-----------------+--------------------------+\n| Boolean         | Section 1.3              |\n+-----------------+--------------------------+\n| Duration        | Section 1.4.6            |\n+-----------------+--------------------------+\n| Id              | Section 1.4.1            |\n+-----------------+--------------------------+\n| Int             | Section 1.4.2            |\n+-----------------+--------------------------+\n| LocalDateTime   | Section 1.4.5            |\n+-----------------+--------------------------+\n| Link            | Section 1.4.11           |\n+-----------------+--------------------------+\n| Location        | Section 4.2.5            |\n+-----------------+--------------------------+\n| NDay            | Section 4.3.3            |\n+-----------------+--------------------------+\n| Number          | Section 1.3              |\n+-----------------+--------------------------+\n| Participant     | Section 4.4.6            |\n+-----------------+--------------------------+\n| PatchObject     | Section 1.4.9            |\n+-----------------+--------------------------+\n| RecurrenceRule  | Section 4.3.3            |\n+-----------------+--------------------------+\n| Relation        | Section 1.4.10           |\n+-----------------+--------------------------+\n| SignedDuration  | Section 1.4.7            |\n+-----------------+--------------------------+\n| String          | Section 1.3              |\n+-----------------+--------------------------+\n| TimeZone        | Section 4.7.2            |\n+-----------------+--------------------------+\n| TimeZoneId      | Section 1.4.8            |\n+-----------------+--------------------------+\n| TimeZoneRule    | Section 4.7.2            |\n+-----------------+--------------------------+\n| UnsignedInt     | Section 1.4.3            |\n+-----------------+--------------------------+\n| UTCDateTime     | Section 1.4.4            |\n+-----------------+--------------------------+\n| VirtualLocation | Section 4.2.6            |\n+-----------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 10,
      "text": "Table 2: Initial Contents of the \"JSCalendar Types\" Registry",
      "ja": "表2：「JScalendar Types」レジストリの初期内容"
    },
    {
      "indent": 0,
      "text": "8.4. Creation of the \"JSCalendar Enum Values\" Registry",
      "section_title": true,
      "ja": "8.4. \"JScalendar enum値\"レジストリの作成"
    },
    {
      "indent": 3,
      "text": "IANA has created the \"JSCalendar Enum Values\" registry to allow interoperable extension of semantics for properties with enumerable values. Each such property will have a subregistry of allowed values. The registration process for a new enum value or adding a new enumerable property is the same as for the \"JSCalendar Properties\" registry, as defined in Section 8.2.",
      "ja": "IANAは、列挙型の値を持つプロパティの意味論の相互運用可能な拡張を可能にするために「JScalendar enum値」レジストリを作成しました。そのような各プロパティは許容値のサブレクス論を有するであろう。新しい列挙値の登録プロセスまたは新しい列挙型プロパティの追加は、セクション8.2で定義されている「JScalendarプロパティ」レジストリと同じです。"
    },
    {
      "indent": 0,
      "text": "8.4.1. \"JSCalendar Enum Values\" Registry Property Template",
      "section_title": true,
      "ja": "8.4.1. \"JScalendar enum値\"レジストリプロパティテンプレート"
    },
    {
      "indent": 3,
      "text": "This template is for adding a subregistry for a new enumerable property to the \"JSCalendar Enum\" registry.",
      "ja": "このテンプレートは、「JScalendar Enum」レジストリに新しい列挙型プロパティのサブレジストを追加するためのものです。"
    },
    {
      "indent": 3,
      "text": "Property Name: These are the name(s) of the property or properties where these values may be used. This MUST be registered in the \"JSCalendar Properties\" registry.",
      "ja": "プロパティ名：これらは、これらの値を使用できるプロパティまたはプロパティの名前です。これは「JScalendar Properties」レジストリに登録する必要があります。"
    },
    {
      "indent": 3,
      "text": "Context: This is the list of allowed object types where the property or properties may appear, as registered in the \"JSCalendar Properties\" registry. This disambiguates where there may be two distinct properties with the same name in different contexts.",
      "ja": "コンテキスト：これは、 \"JScalendar Properties\"レジストリに登録されているように、プロパティまたはプロパティが表示されることができる許可されたオブジェクトタイプのリストです。これは、異なるコンテキストで同じ名前の2つの異なるプロパティがある場合が曖昧になる。"
    },
    {
      "indent": 3,
      "text": "Change Controller: (\"IETF\" for properties defined in RFCs from the IETF stream).",
      "ja": "Change Controller :( \"IETF\"が、IETFストリームからRFCで定義されているプロパティの場合は）。"
    },
    {
      "indent": 3,
      "text": "Initial Contents: This is the initial list of defined values for this enum, using the template defined in Section 8.4.2. A subregistry will be created with these values for this property name/context tuple.",
      "ja": "初期内容：これは、セクション8.4.2で定義されているテンプレートを使用して、このENUMの定義された値の初期リストです。サブレジストは、このプロパティ名/コンテキストタプルのこれらの値を使用して作成されます。"
    },
    {
      "indent": 0,
      "text": "8.4.2. \"JSCalendar Enum Values\" Registry Value Template",
      "section_title": true,
      "ja": "8.4.2. \"JScalendar enum値\"レジストリ値テンプレート"
    },
    {
      "indent": 3,
      "text": "This template is for adding a new enum value to a subregistry in the JSCalendar Enum registry.",
      "ja": "このテンプレートは、JScalendar ENUMレジストリのサブリュージストリに新しいENUM値を追加するためのものです。"
    },
    {
      "indent": 3,
      "text": "Enum Value: the verbatim value of the enum",
      "ja": "列挙値：列挙体の逐語的価値"
    },
    {
      "indent": 3,
      "text": "Reference or Description: a brief description or RFC number and section reference for the semantics of this value",
      "ja": "参照または説明：この値のセマンティクスの簡単な説明またはRFC番号とセクションリファレンス"
    },
    {
      "indent": 0,
      "text": "8.4.3. Initial Contents for the \"JSCalendar Enum Values\" Registry",
      "section_title": true,
      "ja": "8.4.3. \"JScalendar enum値\"レジストリの初期内容"
    },
    {
      "indent": 3,
      "text": "For each subregistry created in this section, all RFC section references are for this document.",
      "ja": "このセクションで作成された各サブレジストについて、すべてのRFCセクション参照はこのドキュメントのためのものです。"
    },
    {
      "indent": 3,
      "text": "Property Name:      action\nContext:            Alert\nChange Controller:  IETF\nInitial Contents:\n                    +============+==========================+\n                    | Enum Value | Reference or Description |\n                    +============+==========================+\n                    | display    | Section 4.5.2            |\n                    +------------+--------------------------+\n                    | email      | Section 4.5.2            |\n                    +------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 3: JSCalendar Enum Values for action (Context: Alert)",
      "ja": "表3：actionのJScalendar enum値（コンテキスト：alert）"
    },
    {
      "indent": 3,
      "text": "Property Name:      display\nContext:            Link\nChange Controller:  IETF\nInitial Contents:\n                    +============+==========================+\n                    | Enum Value | Reference or Description |\n                    +============+==========================+\n                    | badge      | Section 1.4.11           |\n                    +------------+--------------------------+\n                    | graphic    | Section 1.4.11           |\n                    +------------+--------------------------+\n                    | fullsize   | Section 1.4.11           |\n                    +------------+--------------------------+\n                    | thumbnail  | Section 1.4.11           |\n                    +------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 4: JSCalendar Enum Values for display (Context: Link)",
      "ja": "表4：表示のJScalendar列挙値（コンテキスト：リンク）"
    },
    {
      "indent": 3,
      "text": "Property Name:      features\nContext:            VirtualLocation\nChange Controller:  IETF\nInitial Contents:\n                    +============+==========================+\n                    | Enum Value | Reference or Description |\n                    +============+==========================+\n                    | audio      | Section 4.2.6            |\n                    +------------+--------------------------+\n                    | chat       | Section 4.2.6            |\n                    +------------+--------------------------+\n                    | feed       | Section 4.2.6            |\n                    +------------+--------------------------+\n                    | moderator  | Section 4.2.6            |\n                    +------------+--------------------------+\n                    | phone      | Section 4.2.6            |\n                    +------------+--------------------------+\n                    | screen     | Section 4.2.6            |\n                    +------------+--------------------------+\n                    | video      | Section 4.2.6            |\n                    +------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 5: JSCalendar Enum Values for features (Context: VirtualLocation)",
      "ja": "表5：機能に関するjscalendar enum値（コンテキスト：virtuallocation）"
    },
    {
      "indent": 3,
      "text": "Property Name:      freeBusyStatus\nContext:            Event, Task\nChange Controller:  IETF\nInitial Contents:\n                    +============+==========================+\n                    | Enum Value | Reference or Description |\n                    +============+==========================+\n                    | free       | Section 4.4.2            |\n                    +------------+--------------------------+\n                    | busy       | Section 4.4.2            |\n                    +------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 25,
      "text": " Table 6: JSCalendar Enum Values for freeBusyStatus (Context: Event, Task)",
      "ja": "表6：FreebUsyStatusのjscalendar enum値（コンテキスト：イベント、タスク）"
    },
    {
      "indent": 3,
      "text": "Property Name:      kind\nContext:            Participant\nChange Controller:  IETF\nInitial Contents:\n                    +============+==========================+\n                    | Enum Value | Reference or Description |\n                    +============+==========================+\n                    | individual | Section 4.4.6            |\n                    +------------+--------------------------+\n                    | group      | Section 4.4.6            |\n                    +------------+--------------------------+\n                    | resource   | Section 4.4.6            |\n                    +------------+--------------------------+\n                    | location   | Section 4.4.6            |\n                    +------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 7: JSCalendar Enum Values for kind (Context: Participant)",
      "ja": "表7：親切なJScalendar enum値（コンテキスト：参加者）"
    },
    {
      "indent": 3,
      "text": "Property Name:      participationStatus\nContext:            Participant\nChange Controller:  IETF\nInitial Contents:\n                    +==============+==========================+\n                    | Enum Value   | Reference or Description |\n                    +==============+==========================+\n                    | needs-action | Section 4.4.6            |\n                    +--------------+--------------------------+\n                    | accepted     | Section 4.4.6            |\n                    +--------------+--------------------------+\n                    | declined     | Section 4.4.6            |\n                    +--------------+--------------------------+\n                    | tentative    | Section 4.4.6            |\n                    +--------------+--------------------------+\n                    | delegated    | Section 4.4.6            |\n                    +--------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 27,
      "text": "Table 8: JSCalendar Enum Values for participationStatus (Context: Participant)",
      "ja": "表8：PleastationStatusのjscalendar enum値（コンテキスト：参加者）"
    },
    {
      "indent": 3,
      "text": "Property Name:      privacy\nContext:            Event, Task\nChange Controller:  IETF\nInitial Contents:\n                    +============+==========================+\n                    | Enum Value | Reference or Description |\n                    +============+==========================+\n                    | public     | Section 4.4.3            |\n                    +------------+--------------------------+\n                    | private    | Section 4.4.3            |\n                    +------------+--------------------------+\n                    | secret     | Section 4.4.3            |\n                    +------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 9: JSCalendar Enum Values for privacy (Context: Event, Task)",
      "ja": "表9：プライバシーのjscalendar enum値（コンテキスト：イベント、タスク）"
    },
    {
      "indent": 3,
      "text": "Property Name:      progress\nContext:            Task, Participant\nChange Controller:  IETF\nInitial Contents:\n                    +==============+==========================+\n                    | Enum Value   | Reference or Description |\n                    +==============+==========================+\n                    | needs-action | Section 5.2.5            |\n                    +--------------+--------------------------+\n                    | in-process   | Section 5.2.5            |\n                    +--------------+--------------------------+\n                    | completed    | Section 5.2.5            |\n                    +--------------+--------------------------+\n                    | failed       | Section 5.2.5            |\n                    +--------------+--------------------------+\n                    | cancelled    | Section 5.2.5            |\n                    +--------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": " Table 10: JSCalendar Enum Values for progress (Context: Task, Participant)",
      "ja": "表10：進行状況のjscalendar enum値（コンテキスト：タスク、参加者）"
    },
    {
      "indent": 3,
      "text": "Property Name:      relation\nContext:            Relation\nChange Controller:  IETF\nInitial Contents:\n                    +============+==========================+\n                    | Enum Value | Reference or Description |\n                    +============+==========================+\n                    | first      | Section 1.4.10           |\n                    +------------+--------------------------+\n                    | next       | Section 1.4.10           |\n                    +------------+--------------------------+\n                    | child      | Section 1.4.10           |\n                    +------------+--------------------------+\n                    | parent     | Section 1.4.10           |\n                    +------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 11: JSCalendar Enum Values for relation (Context: Relation)",
      "ja": "表11：jscalendar enum値の関係（コンテキスト：Relation）"
    },
    {
      "indent": 3,
      "text": "Property Name:      relativeTo\nContext:            OffsetTrigger, Location\nChange Controller:  IETF\nInitial Contents:\n                    +============+==========================+\n                    | Enum Value | Reference or Description |\n                    +============+==========================+\n                    | start      | Section 4.5.2            |\n                    +------------+--------------------------+\n                    | end        | Section 4.5.2            |\n                    +------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 12: JSCalendar Enum Values for relativeTo (Context: OffsetTrigger, Location)",
      "ja": "表12：relativetoのjscalendar enum値（コンテキスト：OffSetTrigger、場所）"
    },
    {
      "indent": 3,
      "text": "Property Name:      roles\nContext:            Participant\nChange Controller:  IETF\nInitial Contents:\n                    +===============+==========================+\n                    | Enum Value    | Reference or Description |\n                    +===============+==========================+\n                    | owner         | Section 4.4.6            |\n                    +---------------+--------------------------+\n                    | attendee      | Section 4.4.6            |\n                    +---------------+--------------------------+\n                    | optional      | Section 4.4.6            |\n                    +---------------+--------------------------+\n                    | informational | Section 4.4.6            |\n                    +---------------+--------------------------+\n                    | chair         | Section 4.4.6            |\n                    +---------------+--------------------------+\n                    | contact       | Section 4.4.6            |\n                    +---------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 27,
      "text": "Table 13: JSCalendar Enum Values for roles (Context: Participant)",
      "ja": "表13：ロールのJScalendar enum値（コンテキスト：参加者）"
    },
    {
      "indent": 3,
      "text": "Property Name:      scheduleAgent\nContext:            Participant\nChange Controller:  IETF\nInitial Contents:\n                    +============+==========================+\n                    | Enum Value | Reference or Description |\n                    +============+==========================+\n                    | server     | Section 4.4.6            |\n                    +------------+--------------------------+\n                    | client     | Section 4.4.6            |\n                    +------------+--------------------------+\n                    | none       | Section 4.4.6            |\n                    +------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 14: JSCalendar Enum Values for scheduleAgent (Context: Participant)",
      "ja": "表14：ScheduleAgentのJScalendar enum値（コンテキスト：参加者）"
    },
    {
      "indent": 3,
      "text": "Property Name:      status\nContext:            Event\nChange Controller:  IETF\nInitial Contents:\n                    +============+==========================+\n                    | Enum Value | Reference or Description |\n                    +============+==========================+\n                    | confirmed  | Section 5.1.3            |\n                    +------------+--------------------------+\n                    | cancelled  | Section 5.1.3            |\n                    +------------+--------------------------+\n                    | tentative  | Section 5.1.3            |\n                    +------------+--------------------------+",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 26,
      "text": "Table 15: JSCalendar Enum Values for status (Context: Event)",
      "ja": "表15：ステータスのJScalendar enum値（コンテキスト：イベント）"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9. 参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[CLDR] \"Unicode Common Locale Data Repository\", <http://cldr.unicode.org/>.",
      "ja": "[CLDR] \"Unicode Common Locale Data Repository\"、<http://cldr.unicode.org/>。"
    },
    {
      "indent": 3,
      "text": "[COLORS] Çelik, T., Lilley, C., and L. Baron, \"CSS Color Module Level 3\", W3C Recommendation, June 2018, <https://www.w3.org/TR/css-color-3/>.",
      "ja": "[色]Çelik、T.、Lilley、C.、およびL. Baron、「CSSカラーモジュールレベル3」、W3C勧告、2018年6月、<https://www.w3.org/tr/css-color-3/>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] BRADNER、S、「RFCSで使用するためのキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https：//www.rfc-editor.org/info/RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC2392] Levinson, E., \"Content-ID and Message-ID Uniform Resource Locators\", RFC 2392, DOI 10.17487/RFC2392, August 1998, <https://www.rfc-editor.org/info/rfc2392>.",
      "ja": "[RFC2392] Levinson、E.、「Content-IDおよびメッセージIDユニフォーム・ロケーター」、RFC 2392、DOI 10.17487 / RFC2392、1998年8月、<https：//www.rfc-editor.org/info/rfc2392>。"
    },
    {
      "indent": 3,
      "text": "[RFC2397] Masinter, L., \"The \"data\" URL scheme\", RFC 2397, DOI 10.17487/RFC2397, August 1998, <https://www.rfc-editor.org/info/rfc2397>.",
      "ja": "[RFC2397] Masinter、L. \"\"データ \"URLスキーム\"、RFC 2397、DOI 10.17487 / RFC2397、1998年8月、<https://www.rfc-editor.org/info/rfc2397>。"
    },
    {
      "indent": 3,
      "text": "[RFC3339] Klyne, G. and C. Newman, \"Date and Time on the Internet: Timestamps\", RFC 3339, DOI 10.17487/RFC3339, July 2002, <https://www.rfc-editor.org/info/rfc3339>.",
      "ja": "[RFC3339] Klyne、G.およびC. NEWMAN、「インターネット上の日時：Timestamps」、RFC 3339、DOI 10.17487 / RFC3339、2002年7月、<https：//www.rfc-editor.org/info/rfc3339>。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, DOI 10.17487/RFC3986, January 2005, <https://www.rfc-editor.org/info/rfc3986>.",
      "ja": "[RFC3986] Berners-Lee、T.、Field、R.、およびL.Masinter、「Uniform Resource Identifier（URI）：汎用構文」、STD 66、RFC 3986、DOI 10.17487 / RFC3986、2005年1月、<https：//www.rfc-editor.org/info/rfc3986>。"
    },
    {
      "indent": 3,
      "text": "[RFC4122] Leach, P., Mealling, M., and R. Salz, \"A Universally Unique IDentifier (UUID) URN Namespace\", RFC 4122, DOI 10.17487/RFC4122, July 2005, <https://www.rfc-editor.org/info/rfc4122>.",
      "ja": "[RFC4122]リーチ、P.、Mealling、M.、およびR.Salz、「普遍的にユニークな識別子（UUID）URN名前空間」、RFC 4122、DOI 10.17487 / RFC4122、2005年7月、<https：//www.rfc-editor.org/info/rfc4122>。"
    },
    {
      "indent": 3,
      "text": "[RFC4589] Schulzrinne, H. and H. Tschofenig, \"Location Types Registry\", RFC 4589, DOI 10.17487/RFC4589, July 2006, <https://www.rfc-editor.org/info/rfc4589>.",
      "ja": "[RFC4589] Schulzrinne、H.およびH.Tschofenig、 \"Location Types Registry\"、RFC 4589、Doi 10.17487 / RFC4589、2006年7月、<https：//www.rfc-editor.org/info/rfc4589>。"
    },
    {
      "indent": 3,
      "text": "[RFC4648] Josefsson, S., \"The Base16, Base32, and Base64 Data Encodings\", RFC 4648, DOI 10.17487/RFC4648, October 2006, <https://www.rfc-editor.org/info/rfc4648>.",
      "ja": "[RFC4648] Josefsson、S。、「Base16、Base32、およびBase64データエンコーディング」、RFC 4648、DOI 10.17487 / RFC4648、2006年10月、<https：//www.rfc-editor.org/info/rfc4648>。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, DOI 10.17487/RFC5234, January 2008, <https://www.rfc-editor.org/info/rfc5234>.",
      "ja": "[RFC5234] Crocker、D.、ED。2008年1月、<https://www.rfc-editor.org/info/rfc-editor.org/info/rfc- editor.org/info/rfc523,2008、<https://www.rfc-editor.org/info/rfc- editor.org/info/rfc- editor.org/info/rfc- editor.org/info/rfc- editor.org/info/rfc- editor.org/info/rfc5234>。"
    },
    {
      "indent": 3,
      "text": "[RFC5322] Resnick, P., Ed., \"Internet Message Format\", RFC 5322, DOI 10.17487/RFC5322, October 2008, <https://www.rfc-editor.org/info/rfc5322>.",
      "ja": "[RFC5322] Resnick、P.、Ed。、「インターネットメッセージフォーマット」、RFC 5322、DOI 10.17487 / RFC5322、2008年10月、<https：//www.rfc-editor.org/info/rfc5322>。"
    },
    {
      "indent": 3,
      "text": "[RFC5545] Desruisseaux, B., Ed., \"Internet Calendaring and Scheduling Core Object Specification (iCalendar)\", RFC 5545, DOI 10.17487/RFC5545, September 2009, <https://www.rfc-editor.org/info/rfc5545>.",
      "ja": "[RFC5545] Desruisseaux、B.、ED。、「インターネットカレンダーとスケジューリングコアオブジェクト仕様（iCalendar）」、RFC 5545、DOI 10.17487 / RFC5545、2009年9月、<https://www.rfc-editor.org/info/RFC5545>。"
    },
    {
      "indent": 3,
      "text": "[RFC5546] Daboo, C., Ed., \"iCalendar Transport-Independent Interoperability Protocol (iTIP)\", RFC 5546, DOI 10.17487/RFC5546, December 2009, <https://www.rfc-editor.org/info/rfc5546>.",
      "ja": "[RFC5546] Daboo、C、ED。、「ICALENDAR Transponite-Decendent Intemoperability Protocol（ITIP）」、RFC 5546、DOI 10.17487 / RFC5546、2009年12月、<https：//www.rfc-editor.org/info/rfc5546>。"
    },
    {
      "indent": 3,
      "text": "[RFC5646] Phillips, A., Ed. and M. Davis, Ed., \"Tags for Identifying Languages\", BCP 47, RFC 5646, DOI 10.17487/RFC5646, September 2009, <https://www.rfc-editor.org/info/rfc5646>.",
      "ja": "[RFC5646] Phillips、A.、ED。そして、「言語を特定するためのタグ」、BCP 47、RFC 5646、DOI 10.17487 / RFC5646、2009年9月、<https：//www.rfc-editor.org/info/rfc5646>。"
    },
    {
      "indent": 3,
      "text": "[RFC5870] Mayrhofer, A. and C. Spanring, \"A Uniform Resource Identifier for Geographic Locations ('geo' URI)\", RFC 5870, DOI 10.17487/RFC5870, June 2010, <https://www.rfc-editor.org/info/rfc5870>.",
      "ja": "[RFC5870] MayRhofer、A.およびC. Spanring、「地理的位置の統一資源識別子（ 'Geo' Uri）」、RFC 5870、DOI 10.17487 / RFC5870、2010年6月、<https：//www.rfc-編集者。org / info / rfc5870>。"
    },
    {
      "indent": 3,
      "text": "[RFC6047] Melnikov, A., Ed., \"iCalendar Message-Based Interoperability Protocol (iMIP)\", RFC 6047, DOI 10.17487/RFC6047, December 2010, <https://www.rfc-editor.org/info/rfc6047>.",
      "ja": "[RFC6047]メルニコフ、A.、ED。、「iCalendarメッセージベースの相互運用性プロトコル（IMIP）」、RFC 6047、DOI 10.17487 / RFC6047、2010年12月、<https://www.rfc-editor.org/info/rfc6047>。"
    },
    {
      "indent": 3,
      "text": "[RFC6838] Freed, N., Klensin, J., and T. Hansen, \"Media Type Specifications and Registration Procedures\", BCP 13, RFC 6838, DOI 10.17487/RFC6838, January 2013, <https://www.rfc-editor.org/info/rfc6838>.",
      "ja": "[RFC6838] Freed、N.、Klensin、J.、およびT.Hansen、「メディアタイプの仕様および登録手順」、BCP 13、RFC 6838、DOI 10.17487 / RFC6838、2013年1月、<https：///www.rfc-editor.org/info/rfc6838>。"
    },
    {
      "indent": 3,
      "text": "[RFC6901] Bryan, P., Ed., Zyp, K., and M. Nottingham, Ed., \"JavaScript Object Notation (JSON) Pointer\", RFC 6901, DOI 10.17487/RFC6901, April 2013, <https://www.rfc-editor.org/info/rfc6901>.",
      "ja": "[RFC6901] Bryan、P.、ED。、ZYP、K.、およびM. Nottingham、Ed。、「JavaScriptオブジェクト表記（JSON）ポインタ」、RFC 6901、DOI 10.17487 / RFC6901、2013年4月、<https：//www.rfc-editor.org/info/rfc6901>。"
    },
    {
      "indent": 3,
      "text": "[RFC7493] Bray, T., Ed., \"The I-JSON Message Format\", RFC 7493, DOI 10.17487/RFC7493, March 2015, <https://www.rfc-editor.org/info/rfc7493>.",
      "ja": "[RFC7493] Bray、T.、Ed。、「I-JSONメッセージフォーマット」、RFC 7493、DOI 10.17487 / RFC7493、2015年3月、<https：//www.rfc-editor.org/info/rfc7493>。"
    },
    {
      "indent": 3,
      "text": "[RFC7529] Daboo, C. and G. Yakushev, \"Non-Gregorian Recurrence Rules in the Internet Calendaring and Scheduling Core Object Specification (iCalendar)\", RFC 7529, DOI 10.17487/RFC7529, May 2015, <https://www.rfc-editor.org/info/rfc7529>.",
      "ja": "[RFC7529] Daboo、CおよびG.ヤクシェフ、「インターネットカレンダーの非グレゴリオ系再発ルールおよびスケジューリングコアオブジェクト仕様書（ICALENDAR）」、RFC 7529、DOI 10.17487 / RFC7529、2015年5月、<https：// www。rfc-editor.org/info/rfc7529>。"
    },
    {
      "indent": 3,
      "text": "[RFC7808] Douglass, M. and C. Daboo, \"Time Zone Data Distribution Service\", RFC 7808, DOI 10.17487/RFC7808, March 2016, <https://www.rfc-editor.org/info/rfc7808>.",
      "ja": "[RFC7808] Douglass、M.およびC. Daboo、「タイムゾーンデータ配信サービス」、RFC 7808、DOI 10.17487 / RFC7808、2016年3月、<https：//www.rfc-editor.org/info/rfc7808>。"
    },
    {
      "indent": 3,
      "text": "[RFC8126] Cotton, M., Leiba, B., and T. Narten, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 8126, DOI 10.17487/RFC8126, June 2017, <https://www.rfc-editor.org/info/rfc8126>.",
      "ja": "[RFC8126]綿、M.、Leiba、B.およびT.Narten、「RFCSのIANAに関する考察のためのガイドライン」、BCP 26、RFC 8126、DOI 10.17487 / RFC8126、2017年6月、<HTTPS：// WWW.rfc-editor.org / info / rfc8126>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B、「RFC 2119キーワードの大文字の曖昧さ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https：//www.rfc-editor.org/info/RFC8174>。"
    },
    {
      "indent": 3,
      "text": "[RFC8259] Bray, T., Ed., \"The JavaScript Object Notation (JSON) Data Interchange Format\", STD 90, RFC 8259, DOI 10.17487/RFC8259, December 2017, <https://www.rfc-editor.org/info/rfc8259>.",
      "ja": "[RFC8259] Bray、T.、ED。、「JavaScriptオブジェクト表記（JSON）データ交換フォーマット」、STD 90、RFC 8259、DOI 10.17487 / RFC8259、2017年12月、<https：//www.rfc-editor.org/ info / rfc8259>。"
    },
    {
      "indent": 3,
      "text": "[RFC8288] Nottingham, M., \"Web Linking\", RFC 8288, DOI 10.17487/RFC8288, October 2017, <https://www.rfc-editor.org/info/rfc8288>.",
      "ja": "[RFC8288]ノッティンガム、M。、「Webリンク」、RFC 8288、DOI 10.17487 / RFC8288、2017年10月、<https：//www.rfc-editor.org/info/rfc8288>。"
    },
    {
      "indent": 3,
      "text": "[TZDB] IANA, \"Time Zone Database\", <https://www.iana.org/time-zones>.",
      "ja": "[TZDB] IANA、「タイムゾーンデータベース」、<https：//www.iana.org/time-zones>。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[ISO.9070.1991] ISO/IEC, \"Information technology -- SGML support facilities -- Registration procedures for public text owner identifiers\", Edition 2, ISO/IEC 9070:1991, April 1991, <https://www.iso.org/standard/16645.html>.",
      "ja": "[ISO.9070.1991] ISO / IEC、「情報技術 -  SGMLサポート設備 - パブリックテキスト所有者識別子の登録手順」、編集2、ISO / IEC 9070：1991、1991年4月、<https：//www.iso。org /標準/ 16645.html>。"
    },
    {
      "indent": 3,
      "text": "[LINKRELS] IANA, \"Link Relations: Link Relation Types\", <https://www.iana.org/assignments/link-relations>.",
      "ja": "[Linklels] IANA、「リンク関係：リンク関係の種類」、<https://www.iana.org/ashignments/link-relations>。"
    },
    {
      "indent": 3,
      "text": "[LOCATIONTYPES] IANA, \"Location Types Registry\", <https://www.iana.org/assignments/location-type-registry>.",
      "ja": "[LocationTypes] IANA、 \"Location Types Registry\"、<https：//www.iana.org/ashignments/location-type-registry>。"
    },
    {
      "indent": 3,
      "text": "[MEDIATYPES] IANA, \"Media Types\", <https://www.iana.org/assignments/media-types>.",
      "ja": "[メディアタイプ] IANA、「メディアタイプ」、<https：//www.iana.org/assignments/media-types>。"
    },
    {
      "indent": 3,
      "text": "[RFC6376] Crocker, D., Ed., Hansen, T., Ed., and M. Kucherawy, Ed., \"DomainKeys Identified Mail (DKIM) Signatures\", STD 76, RFC 6376, DOI 10.17487/RFC6376, September 2011, <https://www.rfc-editor.org/info/rfc6376>.",
      "ja": "[RFC6376] Crocker、D.、ED。、Hansen、T.、Ed。、およびM.Kucherawy、Ed。、「ドメインキー識別メール（DKIM）シグニチャ」、STD 76、RFC 6376、DOI 10.17487 / RFC6376、2011年9月<https：//www.rfc-editor.org/info/rfc6376>。"
    },
    {
      "indent": 3,
      "text": "[RFC7265] Kewisch, P., Daboo, C., and M. Douglass, \"jCal: The JSON Format for iCalendar\", RFC 7265, DOI 10.17487/RFC7265, May 2014, <https://www.rfc-editor.org/info/rfc7265>.",
      "ja": "[RFC7265] KEWISCH、P、Daboo、C.、およびM. Douglass、「JCAL：ICALENDARのJSON形式」、RFC 7265、DOI 10.17487 / RFC7265、2014年5月、<https：//www.rfc-編集者。ORG / INFO / RFC7265>。"
    },
    {
      "indent": 3,
      "text": "[RFC7986] Daboo, C., \"New Properties for iCalendar\", RFC 7986, DOI 10.17487/RFC7986, October 2016, <https://www.rfc-editor.org/info/rfc7986>.",
      "ja": "[RFC7986] Daboo、C.、「ICALendarの新しいプロパティ」、RFC 7986、DOI 10.17487 / RFC7986、2016年10月、<https：//www.rfc-editor.org/info/rfc7986>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank the members of CalConnect for their valuable contributions. This specification originated from the work of the API technical committee of CalConnect: The Calendaring and Scheduling Consortium.",
      "ja": "著者らは彼らの貴重な貢献のためにCalconsectのメンバーに感謝したいと思います。この仕様は、CalconnectのAPIテクニカル委員会の働き、カレンダーとスケジューリングコンソーシアム。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者の住所"
    },
    {
      "indent": 3,
      "text": "Neil Jenkins Fastmail Collins St. West P.O. Box 234 Melbourne VIC 8007 Australia",
      "ja": "Neil Jenkins Fastmail Collins St. West P.O.ボックス234メルボルンVIC 8007オーストラリア"
    },
    {
      "indent": 3,
      "text": "Email: neilj@fastmailteam.com\nURI:   https://www.fastmail.com",
      "raw": true,
      "ja": ""
    },
    {
      "indent": 3,
      "text": "Robert Stepanek Fastmail Collins St. West P.O. Box 234 Melbourne VIC 8007 Australia",
      "ja": "Robert Stepanek Fastmail Collins St. West P.O.ボックス234メルボルンVIC 8007オーストラリア"
    },
    {
      "indent": 3,
      "text": "Email: rsto@fastmailteam.com\nURI:   https://www.fastmail.com",
      "raw": true,
      "ja": ""
    }
  ]
}