{
  "title": {
    "text": "RFC 8373 - Negotiating Human Language in Real-Time Communications",
    "ja": "RFC 8373 - リアルタイムコミュニケーションにおける交渉人間の言語"
  },
  "number": 8373,
  "created_at": "2019-11-02 03:01:12.110460+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        R. Gellens\nRequest for Comments: 8373                    Core Technology Consulting\nCategory: Standards Track                                       May 2018\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 9,
      "text": "Negotiating Human Language in Real-Time Communications",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "Users have various human (i.e., natural) language needs, abilities, and preferences regarding spoken, written, and signed languages. This document defines new Session Description Protocol (SDP) media-level attributes so that when establishing interactive communication sessions (\"calls\"), it is possible to negotiate (i.e., communicate and match) the caller's language and media needs with the capabilities of the called party. This is especially important for emergency calls, because it allows for a call to be handled by a call taker capable of communicating with the user or for a translator or relay operator to be bridged into the call during setup. However, this also applies to non-emergency calls (for example, calls to a company call center).",
      "ja": "ユーザーは、話書かれ、署名された言語に関する様々なヒト（すなわち、自然）言語ニーズ、能力、および嗜好を持っています。この文書は、新しいセッション記述プロトコル（SDP）を定義メディアレベルでは、呼び出し元の言語とメディアはの能力を必要とするので（すなわち、通信との一致）インタラクティブ通信セッション（「呼び出し」）を確立するとき、交渉することが可能であることを属性パーティーと呼ばれます。それは、ユーザーまたはセットアップ時に呼び出しに橋渡しする翻訳者やリレーオペレータのために通信することが可能なコール受け手によって処理される呼び出しが可能になりますので、これは、緊急通話のために特に重要です。しかし、これはまた、非緊急コールに適用（例えば、会社のコールセンターに呼び出します）。"
    },
    {
      "indent": 3,
      "text": "This document describes the need as well as a solution that uses new SDP media attributes.",
      "ja": "この文書では、必要性だけでなく、新しいSDPメディア属性を使用するソリューションについて説明します。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これは、インターネット標準化過程文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。インターネット標準の詳細については、RFC 7841のセクション2で利用可能です。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8373.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttps://www.rfc-editor.org/info/rfc8373で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2018 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2018 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（https://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n  1.1.  Applicability . . . . . . . . . . . . . . . . . . . . . .   4\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   5\n3.  Desired Semantics . . . . . . . . . . . . . . . . . . . . . .   5\n4.  The Existing 'lang' Attribute . . . . . . . . . . . . . . . .   5\n5.  Solution  . . . . . . . . . . . . . . . . . . . . . . . . . .   5\n  5.1.  The 'hlang-send' and 'hlang-recv' Attributes  . . . . . .   5\n  5.2.  No Language in Common . . . . . . . . . . . . . . . . . .   7\n  5.3.  Usage Notes . . . . . . . . . . . . . . . . . . . . . . .   7\n  5.4.  Examples  . . . . . . . . . . . . . . . . . . . . . . . .   8\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  10\n  6.1.  att-field Subregistry of SDP Parameters . . . . . . . . .  10\n  6.2.  Warning Codes Subregistry of SIP Parameters . . . . . . .  11\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .  11\n8.  Privacy Considerations  . . . . . . . . . . . . . . . . . . .  11\n9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  12\n  9.1.  Normative References  . . . . . . . . . . . . . . . . . .  12\n  9.2.  Informative References  . . . . . . . . . . . . . . . . .  12\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  13\nContributors  . . . . . . . . . . . . . . . . . . . . . . . . . .  13\nAuthor's Address  . . . . . . . . . . . . . . . . . . . . . . . .  13",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "A mutually comprehensible language is helpful for human communication. This document addresses the negotiation of human language and media modality (spoken, signed, or written) in real-time communications. A companion document [RFC8255] addresses language selection in email.",
      "ja": "相互に理解できる言語は、人間のコミュニケーションのために有用です。この文書は、人間の言語とリアルタイム通信におけるメディアモダリティ（話、署名、または書かれた）の交渉に取り組みます。仲間ドキュメント[RFC8255]は、電子メールでの言語選択に対応しています。"
    },
    {
      "indent": 3,
      "text": "Unless the caller and callee know each other or there is contextual or out-of-band information from which the language(s) and media modalities can be determined, there is a need for spoken, signed, or written languages to be negotiated based on the caller's needs and the callee's capabilities. This need applies to both emergency and non-emergency calls. An example of a non-emergency call is when a caller contacts a company call center; an emergency call typically involves a caller contacting a Public Safety Answering Point (PSAP). In such scenarios, it is helpful for the caller to be able to indicate preferred signed, written, and/or spoken languages and for the callee to be able to indicate its capabilities; this allows the call to proceed using the language(s) and media forms supported by both.",
      "ja": "呼び出し元と呼び出し先が互いに知っているか、またはそこ言語（複数可）、そこからコンテキストまたはアウトオブバンド情報であり、メディア・モダリティを決定することができる、発話する必要がある、署名された、または書かれた言語に基づいて交渉される場合を除き発信者のニーズと呼び出し先の能力。この必要性は、緊急・非緊急コールの両方に適用されます。とき、発信者の連絡先会社のコールセンター非緊急コールの例があります。緊急コールは、通常ポイント（PSAP）に応答公安に接触し、発信者を必要とします。発信者が、署名された書かれた、および/または言語を話すと被呼者のためのその能力を示すことができるように好適示すことができるようにするためにそのようなシナリオでは、それは有用です。これは、呼び出しは、言語（複数可）との両方でサポートされているメディアの形式を使用して続行することができます。"
    },
    {
      "indent": 3,
      "text": "For various reasons, including the ability to establish multiple streams using different media (i.e., voice, text, and/or video), it makes sense to use a per-stream negotiation mechanism known as the Session Description Protocol (SDP). Utilizing SDP [RFC4566] enables the solution described in this document to be applied to all interactive communications negotiated using SDP, in emergency as well as non-emergency scenarios.",
      "ja": "異なるメディア（すなわち、音声、テキスト、および/またはビデオ）を使用して、複数のストリームを確立する能力を含む様々な理由のため、それは、セッション記述プロトコル（SDP）として知られている当たりのストリームネゴシエーションメカニズムを使用するように理にかなっています。 SDP [RFC4566]を利用し、この文書に記載された溶液は、緊急及び非緊急のシナリオでは、SDPを使用してネゴシエート全てのインタラクティブ通信に適用されることを可能にします。"
    },
    {
      "indent": 3,
      "text": "By treating language as another SDP attribute that is negotiated along with other aspects of a media stream, it becomes possible to accommodate a range of users' needs and called-party facilities. For example, some users may be able to speak several languages but have a preference. Some called parties may support some of those languages internally but require the use of a translation service for others, or they may have a limited number of call takers able to use certain languages. Another example would be a user who is able to speak but is deaf or hard of hearing and desires a voice stream to send spoken language plus a text stream to receive written language. Making language a media attribute allows standard session negotiation to handle this by providing the information and mechanism for the endpoints to make appropriate decisions.",
      "ja": "メディアストリームの他の側面に沿って交渉している別のSDP属性として言語を処理することで、ユーザーのニーズと呼ばれるパーティ施設の範囲に適応することが可能となります。例えば、一部のユーザーが複数の言語を話すが、好みを持つことができるかもしれません。いくつかの呼者は、内部的にこれらの言語のいくつかをサポートしていますが、他人のために翻訳サービスを使用する必要、または彼らは、特定の言語を使用できるコール受験者の数が限られている場合があります。別の例は、話すことができますが、聴覚障害者や難聴であると話し言葉プラス書かれた言語を受け取るために、テキストストリームを送信するために音声ストリームを希望するユーザーになります。メイキング言語は、メディア属性は、標準のセッションネゴシエーションが適切な意思決定を行うためのエンドポイントの情報およびメカニズムを提供することで、これを処理することができます。"
    },
    {
      "indent": 3,
      "text": "The term \"negotiation\" is used here rather than \"indication\" because human language (spoken/written/signed) can be negotiated in the same manner as media (audio/text/video) and codecs. For example, if we think of a user calling an airline reservation center, the user may be able to use a set of languages, perhaps with preferences for one or a few, while the airline reservation center may support a fixed set of languages. Negotiation should select the user's most preferred language that is supported by the call center. Both sides should be aware of which language was negotiated.",
      "ja": "人間の言語は（話/書かれた/署名）メディア（オーディオ/テキスト/ビデオ）とコーデックと同様に交渉することができるので、用語「交渉」とは、「表示」のではなく、ここで使用されます。私たちは、航空会社の予約センターに電話ユーザーを考えた場合、ユーザーは、航空会社の予約センターは、言語の固定セットをサポートするかもしれないが、おそらく1つまたは少数のための好みで、言語のセットを使用することができます。交渉は、コールセンターでサポートされている利用者の最も好みの言語を選択する必要があります。双方は、交渉された言語を認識する必要があります。"
    },
    {
      "indent": 3,
      "text": "In the offer/answer model used here, the offer contains a set of languages per media (and direction) that the offerer is capable of using, and the answer contains one language per media (and direction) that the answerer will support. Supporting languages and/or modalities can require taking extra steps, such as bridging external translation or relay resources into the call or having a call handled by an agent who speaks a requested language and/or has the ability to use a requested modality. The answer indicates the media and languages that the answerer is committing to support (possibly after additional steps have been taken). This model also provides knowledge so both ends know what has been negotiated. Note that additional steps required to support the indicated languages or modalities may or may not be in place in time for any early media.",
      "ja": "ここで使用されるオファー/アンサーモデルでは、オファーは、オファーが使用可能であることをメディア（および方向）あたりの言語のセットが含まれている、との回答は回答がサポートするメディア（および方向）ごとに一つの言語が含まれています。サポート言語および/または様式は、このような呼び出しに外部の翻訳やリレーリソースを埋めるか、要求された言語を話すおよび/または要求されたモダリティを使用する能力を持っているエージェントによって処理コールを持つように余分なステップを、取る必要とすることができます。答えは、回答が（追加の手順が取られた後かもしれません）をサポートするためにコミットされているメディアや言語を示します。また、このモデルでは、両端が交渉されているものを知っているので、知識を提供しています。または任意の初期メディアのための時間の所定の位置にあってもなくてもよく示されている言語やモダリティをサポートするために必要な追加の手順に注意してください。"
    },
    {
      "indent": 3,
      "text": "Since this is a protocol mechanism, the user equipment (UE) client needs to know the user's preferred languages; while this document does not address how clients determine this, reasonable techniques could include a configuration mechanism with a default of the language of the user interface. In some cases, a UE client could tie language and media preferences, such as a preference for a video stream using a signed language and/or a text or audio stream using a written/spoken language.",
      "ja": "これは、プロトコル・メカニズムであるので、ユーザ装置（UE）クライアントは、ユーザーの優先言語を知っている必要があります。この文書は、クライアントがこれを決定する方法を扱っていませんが、合理的な技術は、ユーザーインターフェイスの言語のデフォルトで設定メカニズムを含めることができます。いくつかのケースでは、UEクライアントが書き込ま/音声言語を使用して署名された言語および/またはテキストまたはオーディオストリームを使用して、ビデオストリームの優先として、言語とメディア嗜好を結ぶことができました。"
    },
    {
      "indent": 3,
      "text": "This document does not address user interface (UI) issues, such as if or how a UE client informs a user about the result of language and media negotiation.",
      "ja": "この文書では、このような場合、またはどのようにUEクライアントは、言語とメディアネゴシエーションの結果についてユーザーに知らせるなど、ユーザーインターフェイス（UI）の問題に対処しません。"
    },
    {
      "indent": 0,
      "text": "1.1. Applicability",
      "section_title": true,
      "ja": "1.1. 適用性"
    },
    {
      "indent": 3,
      "text": "Within this document, it is assumed that the negotiating endpoints have already been determined so that a per-stream negotiation based on SDP can proceed.",
      "ja": "この文書の中で、SDPに基づくストリームごとの交渉を進めることができるように交渉のエンドポイントが既に決定されているものとします。"
    },
    {
      "indent": 3,
      "text": "When setting up interactive communication sessions, it is necessary to route signaling messages to the appropriate endpoint(s). This document does not address the problem of language-based routing.",
      "ja": "インタラクティブ通信セッションを設定するとき、それは適切なエンドポイント（複数可）にシグナリングメッセージをルーティングする必要があります。この文書では、言語ベースのルーティングの問題に対処していません。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Desired Semantics",
      "section_title": true,
      "ja": "3.希望のセマンティクス"
    },
    {
      "indent": 3,
      "text": "The desired solution is a media attribute (preferably per direction) that may be used within an offer to indicate the preferred language(s) of each (direction of a) media stream and within an answer to indicate the accepted language. When multiple languages are included for a media stream within an offer, the languages are listed in order of preference (most preferred first).",
      "ja": "所望の溶液は、メディアストリーム毎（A方向）の言語（複数可）を示し、受け入れ言語を示す回答内に提供内で使用されてもよい（好ましくは、方向ごとに）メディア属性です。複数の言語をオファー内のメディア・ストリームのために含まれている場合、言語は、優先順位（第最も好ましい）に記載されています。"
    },
    {
      "indent": 3,
      "text": "Note that negotiating multiple simultaneous languages within a media stream is out of scope of this document.",
      "ja": "メディア・ストリーム内の複数の同時言語を交渉することは、この文書の範囲外であることに注意してください。"
    },
    {
      "indent": 0,
      "text": "4. The Existing 'lang' Attribute",
      "section_title": true,
      "ja": "4.既存の「LANG」属性"
    },
    {
      "indent": 3,
      "text": "RFC 4566 [RFC4566] specifies an attribute 'lang' that is similar to what is needed here but is not sufficiently specific or flexible for the needs of this document. In addition, 'lang' is not mentioned in [RFC3264], and there are no known implementations in SIP. Further, it is useful to be able to specify language per direction (sending and receiving). This document therefore defines two new attributes.",
      "ja": "RFC 4566 [RFC4566]は、ここで必要とされるものに似ていますが、この文書のニーズに十分に特異的または柔軟ではない属性「LANG」を指定します。また、「LANG」は[RFC3264]に記載され、SIPには既知の実装はありませんされていません。また、方向（送信および受信）あたり言語を指定できるようにすることが有用です。この文書は、したがって、2つの新しい属性を定義します。"
    },
    {
      "indent": 0,
      "text": "5. Solution",
      "section_title": true,
      "ja": "5.ソリューション"
    },
    {
      "indent": 3,
      "text": "An SDP attribute (per direction) seems the natural choice to negotiate human language of an interactive media stream, using the language tags of [BCP47].",
      "ja": "SDP属性は（方向ごと）[BCP47]の言語タグを使用して、インタラクティブ・メディア・ストリームの人間の言語を交渉するために自然な選択です。"
    },
    {
      "indent": 0,
      "text": "5.1. The 'hlang-send' and 'hlang-recv' Attributes",
      "section_title": true,
      "ja": "5.1.  「-送信をあえて」 'あえて-RECVの属性"
    },
    {
      "indent": 3,
      "text": "This document defines two media-level attributes: 'hlang-send' and 'hlang-recv' (registered in Section 6). Both start with 'hlang', short for \"human language\". These attributes are used to negotiate which human language is selected for use in (each direction of) each interactive media stream. (Note that not all streams will necessarily be used.) Each can appear for media streams in offers and answers.",
      "ja": "'hlang-SEND' と 'hlang-RECVを'（第6節に登録）：この文書では、2メディアレベル属性を定義します。どちらも、「人間の言語」の略、「hlang」で始めます。これらの属性は、人間の言語は、各双方向メディアストリーム（各方向）に使用するために選択された交渉するために使用されます。 （すべてのストリームが必ず使用されないことに注意してください。）それぞれのオファーとアンサー内のメディアストリームに表示されます。"
    },
    {
      "indent": 3,
      "text": "In an offer, the 'hlang-send' value is a list of one or more language(s) the offerer is willing to use when sending using the media, and the 'hlang-recv' value is a list of one or more language(s) the offerer is willing to use when receiving using the media. The list of languages is in preference order (first is most preferred). When a media is intended for interactive communication in only one direction (e.g., a user in France with difficulty speaking but able to hear who indicates a desire to receive French using audio and send French using text), either 'hlang-send' or 'hlang-recv' MAY be omitted. Note that the media can still be useful in both directions. When a media is not primarily intended for language (for example, a video or audio stream intended for background only), both SHOULD be omitted. Otherwise, both SHOULD have the same value. Note that specifying different languages for each direction (as opposed to the same, or essentially the same, language in different modalities) can make it difficult to complete the call (e.g., specifying a desire to send audio in Hungarian and receive audio in Portuguese).",
      "ja": "オファーにおいて、「hlang-送信」の値は、一つ以上の言語（複数可）申出メディアを使用して送信するときに使用する意思があるのリストであり、「hlang-RECV」の値は、一つ以上の言語のリストでありますメディアを使用して受信した場合（S）申出を使用する意思があります。言語のリストは、優先順位（第最も好ましい）です。メディアは、一方向のみ（例えば、難しさを話すが、オーディオを使用して、フランス語を受信したテキストを使用してフランス語を送信する意欲を示し誰聞くことができるとフランスのユーザー）での双方向コミュニケーションのために意図されている場合、いずれかの「hlang-SEND」または ' hlang-RECV」は省略されるかもしれません。メディアがまだ両方向に有用であることができることに注意してください。メディアは、主言語のために意図されていない場合（例えば、ビデオまたはオーディオストリームのみ背景を意図し）、両方が省略されるべきです。それ以外の場合は、両方が同じ値を持つ必要があります。 （異なるモダリティで同じ、言語本質的に同じ、またはではなく）各方向に異なる言語を指定すると、それが困難なコールを完了するために作ることができることに注意してください（例えば、ハンガリー語の音声を送信し、ポルトガル語で音声を受信するために願望を指定します） 。"
    },
    {
      "indent": 3,
      "text": "In an answer, 'hlang-send' is the language the answerer will send if using the media for language (which in most cases is one of the languages in the offer's 'hlang-recv'), and 'hlang-recv' is the language the answerer expects to receive if using the media for language (which in most cases is one of the languages in the offer's 'hlang-send').",
      "ja": "その答えは、「hlang-送信は」回答は（ほとんどの場合、プランの「hlang-RECV」における言語の一つである）の言語用のメディアを使用した場合に送信されます言語、および「hlang-RECV」をされています言語回答は（ほとんどの場合、プランの「hlang-送信」における言語の一つである）の言語用のメディアを使用した場合は受信することを期待します。"
    },
    {
      "indent": 3,
      "text": "In an offer, each value MUST be a list of one or more language tags per [BCP47], separated by white space. In an answer, each value MUST be one language tag per [BCP47]. [BCP47] describes mechanisms for matching language tags. Note that Section 4.1 of RFC 5646 [BCP47] advises to \"tag content wisely\" and not include unnecessary subtags.",
      "ja": "オファーでは、それぞれの値は、空白で区切られた[BCP47]あたり一つ以上の言語タグのリストでなければなりません。答えでは、それぞれの値は、[BCP47]あたり1個の言語タグでなければなりません。 [BCP47]言語タグに一致するためのメカニズムを記載しています。 RFC 5646のセクション4.1 [BCP47]「タグコンテンツが賢明」としない不要サブタグを含むように助言に留意されたいです。"
    },
    {
      "indent": 3,
      "text": "When placing an emergency call, and in any other case where the language cannot be inferred from context, each OFFERed media stream primarily intended for human language communication SHOULD specify the 'hlang-send' and/or 'hlang-recv' attributes for the direction(s) intended for interactive communication.",
      "ja": "緊急電話をかける場合、言語は文脈から推測することができない他の場合には、各提供メディアストリームが主「hlang-SEND」および/または「hlang-RECV」を指定する必要があり、人間の言語コミュニケーションのために意図さ、方向属性双方向通信のために意図さ（S）。"
    },
    {
      "indent": 3,
      "text": "Clients acting on behalf of end users are expected to set one or both of the 'hlang-send' and 'hlang-recv' attributes on each OFFERed media stream primarily intended for human communication when placing an outgoing session, and either ignore or take into consideration the attributes when receiving incoming calls, based on local configuration and capabilities. Systems acting on behalf of call centers and PSAPs are expected to take the attributes into account when processing inbound calls.",
      "ja": "エンドユーザーに代わって動作するクライアントは、一つまたは「hlang-SEND」と「hlang-RECV」の発信セッションを配置する際に、主に人間のコミュニケーションのために意図され、各提供メディアストリームの属性の両方を設定し、どちらか無視するかにかかると予想されています考慮属性ローカル設定および機能に基づいて、着信コールを受けます。コールセンターとのPSAPに代わって動作するシステムは、インバウンドコールを処理するときに考慮に属性を取ることが期待されています。"
    },
    {
      "indent": 3,
      "text": "Note that media and language negotiation might result in more media streams being accepted than are needed by the users (e.g., if more preferred and less preferred combinations of media and language are all accepted). This is not a problem.",
      "ja": "注複数のメディアストリームをもたらす可能性のあるメディアと言語ネゴシエーションがユーザによって必要とされるよりも受け入れられる（例えば、メディアおよび言語のより好ましい未満好ましい組み合わせは、すべての受け入れられた場合）。これは問題ではありません。"
    },
    {
      "indent": 0,
      "text": "5.2. No Language in Common",
      "section_title": true,
      "ja": "5.2. 共通でないLanguage"
    },
    {
      "indent": 3,
      "text": "A consideration regarding the ability to negotiate language is whether the call proceeds or fails if the callee does not support any of the languages requested by the caller. This document does not mandate either behavior.",
      "ja": "言語を交渉する能力についての考察は、呼び出し先が呼び出し側によって要求された任意の言語をサポートしていない場合、失敗したコールが進行するかどうかです。この文書では、いずれかの行動を強制しません。"
    },
    {
      "indent": 3,
      "text": "When a call is rejected due to lack of any language in common, the SIP response has SIP response code 488 (Not Acceptable Here) or 606 (Not Acceptable) [RFC3261] and a Warning header field [RFC3261] with a warning code of 308 and warning text indicating that there are no mutually supported languages; the warning text SHOULD also contain the supported languages and media.",
      "ja": "コールが原因一般的に任意の言語の欠如のために拒否された場合、SIP応答308の警告コードとSIP応答（ここでは許容できない）コード488または606（許容できない）[RFC3261]と警告ヘッダーフィールド[RFC3261]を有しますそして、警告文には、相互にサポートされる言語が存在しないことを示しています。警告文は、サポートされる言語とメディアをも含むべきです。"
    },
    {
      "indent": 3,
      "text": "Example:",
      "ja": "例："
    },
    {
      "indent": 3,
      "text": "Warning: 308 proxy.example.com \"Incompatible language specification: Requested languages not supported. Supported languages are: es, en; supported media are: audio, text.\"",
      "ja": "警告：308 proxy.example.com「互換性のない言語仕様：要求された言語がサポートされていないサポートされている言語は以下のとおりです。ES、EN;サポートされているメディアは、次のとおりです。オーディオ、テキスト」"
    },
    {
      "indent": 0,
      "text": "5.3. Usage Notes",
      "section_title": true,
      "ja": "5.3. 使用上の注意"
    },
    {
      "indent": 3,
      "text": "A sign-language tag with a video media stream is interpreted as an indication for sign language in the video stream. A non-sign-language tag with a text media stream is interpreted as an indication for written language in the text stream. A non-sign-language tag with an audio media stream is interpreted as an indication for spoken language in the audio stream.",
      "ja": "ビデオメディアストリームと手話タグは、ビデオストリームにおける手話の指標として解釈されます。テキストメディアストリームと非手話タグは、テキストストリームに書かれた言語の指示として解釈されます。オーディオメディアストリームと非手話タグは、オーディオストリームにおける音声言語のための指標として解釈されます。"
    },
    {
      "indent": 3,
      "text": "This document does not define any other use for language tags in video media (such as how to indicate visible captions in the video stream).",
      "ja": "この文書は、（例えば、ビデオストリームに表示キャプションを表示するためにどのような）映像メディアにおける言語タグのための任意の他の使用を定義していません。"
    },
    {
      "indent": 3,
      "text": "This document does not define the use of sign-language tags in text or audio media.",
      "ja": "この文書では、テキストやオーディオメディアにおける手話タグの使用を定義していません。"
    },
    {
      "indent": 3,
      "text": "In the IANA registry for language subtags per [BCP47], a language subtag with a Type field \"extlang\" combined with a Prefix field value \"sgn\" indicates a sign-language tag. The absence of such \"sgn\" prefix indicates a non-sign-language tag.",
      "ja": "[BCP47]あたりの言語サブタグのためのIANAレジストリに、Typeフィールド「extlang」Prefixフィールド値と組み合わせる「SGN」と言語サブタグは手話タグを示しています。こうした「SGN」接頭辞がない場合は、非手話タグを示します。"
    },
    {
      "indent": 3,
      "text": "This document does not define the use of language tags in media other than interactive streams of audio, video, and text (such as \"message\" or \"application\"). Such use could be supported by future work or by application agreement.",
      "ja": "この文書は、（例えば、「メッセージ」や​​「アプリケーション」など）、オーディオ、ビデオ、およびテキストのインタラクティブストリーム以外のメディアでの言語タグの使用を定義していません。このような使用は、将来の仕事で、またはアプリケーションの合意によりサポートすることができます。"
    },
    {
      "indent": 0,
      "text": "5.4. Examples",
      "section_title": true,
      "ja": "5.4. 例"
    },
    {
      "indent": 3,
      "text": "Some examples are shown below. For clarity, only the most directly relevant portions of the SDP block are shown.",
      "ja": "いくつかの例を以下に示します。明確にするために、SDPブロックの唯一の最も直接的に関連する部分が示されています。"
    },
    {
      "indent": 3,
      "text": "An offer or answer indicating spoken English both ways:",
      "ja": "申し出や答えが英語の両方の方法を話さ示します。"
    },
    {
      "indent": 6,
      "text": "m=audio 49170 RTP/AVP 0 a=hlang-send:en a=hlang-recv:en",
      "ja": "EN：M =オーディオ49170 RTP / AVP 0 =-あえては真に= recv-に、送信します"
    },
    {
      "indent": 3,
      "text": "An offer indicating American Sign Language both ways:",
      "ja": "両方の方法アメリカ手話を示すのオファー："
    },
    {
      "indent": 6,
      "text": "m=video 51372 RTP/AVP 31 32 a=hlang-send:ase a=hlang-recv:ase",
      "ja": "M =ビデオ51372 RTP / AVP 31 32 = Aあえて-送信、= ASEあえて-RECVを：ASE"
    },
    {
      "indent": 3,
      "text": "An offer requesting spoken Spanish both ways (most preferred), spoken Basque both ways (second preference), or spoken English both ways (third preference):",
      "ja": "オファーは、（最も好ましい）両方の方法は、両方の方法（第2優先順位を）バスク話さスペイン語話、または英語の両方の方法（第3の好みを）話さ要求します："
    },
    {
      "indent": 6,
      "text": "m=audio 49250 RTP/AVP 20 a=hlang-send:es eu en a=hlang-recv:es eu en",
      "ja": "M =オーディオ49250 RTP / 20 = AVP send-あえて：ES =あなたあえて-のrecvで：EU ESアン"
    },
    {
      "indent": 3,
      "text": "An answer to the above offer indicating spoken Spanish both ways:",
      "ja": "話の両方のスペインの方法を示す上記のオファーへの答え："
    },
    {
      "indent": 6,
      "text": "m=audio 49250 RTP/AVP 20 a=hlang-send:es a=hlang-recv:es",
      "ja": "M =オーディオ49250 RTP / AVP 20 =あえて-送信、=のESはあえて-RECV、ES"
    },
    {
      "indent": 3,
      "text": "An alternative answer to the above offer indicating spoken Italian both ways (as the callee does not support any of the requested languages but chose to proceed with the call):",
      "ja": "上記のオファーに代わる答えは（呼び出し先が要求された言語のいずれかをサポートしていないとしてではなく、コールの続行を選択する）両方の方法をイタリア語話さ示します："
    },
    {
      "indent": 6,
      "text": "m=audio 49250 RTP/AVP 20 a=hlang-send:it a=hlang-recv:it",
      "ja": "M =オーディオ49250 RTP / 20 = AVP-あえては、送信：それ本当に= recv-：それを"
    },
    {
      "indent": 3,
      "text": "An offer or answer indicating written Greek both ways:",
      "ja": "申し出またはその答えはギリシャ語の両方の方法を書いて示します。"
    },
    {
      "indent": 6,
      "text": "m=text 45020 RTP/AVP 103 104 a=hlang-send:gr a=hlang-recv:gr",
      "ja": "M =テキスト45020 RTP / AVP 103 104は、あえて、送信、Aは= GRあえて-RECVを=：GR"
    },
    {
      "indent": 3,
      "text": "An offer requesting the following media streams: video for the caller to send using Argentine Sign Language, text for the caller to send using written Spanish (most preferred) or written Portuguese, and audio for the caller to receive spoken Spanish (most preferred) or spoken Portuguese:",
      "ja": "以下のメディアストリームを要求提供：アルゼンチンの手話を使用して送信するために、発信者のためのビデオ、話さスペイン語（最も好ましい）を受信するために書かれたスペイン語（最も好ましい）または書面によるポルトガル語、および、発信者の音声を使用して送信するため、呼び出し元のテキストまたは話ポルトガル語："
    },
    {
      "indent": 6,
      "text": "m=video 51372 RTP/AVP 31 32 a=hlang-send:aed",
      "ja": "M =ビデオ51372 RTP / AVP 31 32 =あえて-送信を：AED"
    },
    {
      "indent": 6,
      "text": "m=text 45020 RTP/AVP 103 104 a=hlang-send:sp pt",
      "ja": "SPのPT：M =テキスト45020 RTP / AVP 103 104は、あえて、送信を="
    },
    {
      "indent": 6,
      "text": "m=audio 49250 RTP/AVP 20 a=hlang-recv:sp pt",
      "ja": "M =オーディオ49250 RTP / AVP 20 =あえて-RECV：SPのPT"
    },
    {
      "indent": 3,
      "text": "An answer for the above offer, indicating text in which the callee will receive written Spanish and audio in which the callee will send spoken Spanish. (The answering party has no video capability):",
      "ja": "上記のオファーのための答え、呼び出し先はスペイン語と呼び出し先はスペイン語を話さ送信しますれているオーディオ書か受信する元で示すテキスト。 （答えるパーティーにはビデオ機能を持っていません）："
    },
    {
      "indent": 6,
      "text": "m=video 0 RTP/AVP 31 32 m=text 45020 RTP/AVP 103 104 a=hlang-recv:sp",
      "ja": "M =ビデオ0 RTP / AVP 31 32メートル=テキスト45020 RTP / AVP 103 104 = hlang-RECV：SP"
    },
    {
      "indent": 6,
      "text": "m=audio 49250 RTP/AVP 20 a=hlang-send:sp",
      "ja": "M =オーディオ49250 RTP / 20 = AVPはsend-あえて：SPを"
    },
    {
      "indent": 3,
      "text": "An offer requesting the following media streams: text for the caller to send using written English (most preferred) or written Spanish, audio for the caller to receive spoken English (most preferred) or spoken Spanish, and supplemental video:",
      "ja": "以下のメディアストリームを要求提供：書かれた英語（最も好ましい）またはスペイン語を書かれ、（最も好ましい）またはスペイン語話、および補足ビデオ英会話を受信するために、発信者の音声を使用して送信するため、呼び出し元のテキスト："
    },
    {
      "indent": 6,
      "text": "m=text 45020 RTP/AVP 103 104 a=hlang-send:en sp",
      "ja": "M =テキスト45020 RTP / AVP 103 104は、あえて、送信を=：SPエン"
    },
    {
      "indent": 6,
      "text": "m=audio 49250 RTP/AVP 20 a=hlang-recv:en sp",
      "ja": "M =オーディオ49250 RTP / AVP 20 =あえて-RECVを：SPエン"
    },
    {
      "indent": 6,
      "text": "m=video 51372 RTP/AVP 31 32",
      "ja": "M =ビデオ51372 RTP / AVP 31 32"
    },
    {
      "indent": 3,
      "text": "An answer for the above offer, indicating text in which the callee will receive written Spanish, audio in which the callee will send spoken Spanish, and supplemental video:",
      "ja": "呼び出し先が書かれたスペイン語、呼び出し先はスペイン語、および補足ビデオを話さお送りしますここで音声を受信なるテキストを示す上記のオファーのための答え："
    },
    {
      "indent": 6,
      "text": "m=text 45020 RTP/AVP 103 104 a=hlang-recv:sp",
      "ja": "M = AVPテキスト45020 RTP / 103,104 =あえて-RECV、SP"
    },
    {
      "indent": 6,
      "text": "m=audio 49250 RTP/AVP 20 a=hlang-send:sp",
      "ja": "M =オーディオ49250 RTP / 20 = AVPはsend-あえて：SPを"
    },
    {
      "indent": 6,
      "text": "m=video 51372 RTP/AVP 31 32",
      "ja": "M =ビデオ51372 RTP / AVP 31 32"
    },
    {
      "indent": 3,
      "text": "Note that, even though the examples show the same (or essentially the same) language being used in both directions (even when the modality differs), there is no requirement that this be the case. However, in practice, doing so is likely to increase the chances of successful matching.",
      "ja": "両方向に使用される言語の例は、同じ（または本質的に同じ）を示すにもかかわらず、なお（モダリティが異なる場合であっても）、このような場合であるという要件は存在しません。しかし、実際には、そうすることは成功したマッチングの可能性を高める可能性があります。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "6.1. att-field Subregistry of SDP Parameters",
      "section_title": true,
      "ja": "6.1.  SDPパラメータのフィールド副登録"
    },
    {
      "indent": 3,
      "text": "The syntax in this section uses ABNF per RFC 5234 [RFC5234].",
      "ja": "このセクションの構文は、RFC 5234 [RFC5234]あたりのABNFを使用しています。"
    },
    {
      "indent": 3,
      "text": "IANA has added two entries to the \"att-field (media level only)\" subregistry of the \"Session Description Protocol (SDP) Parameters\" registry.",
      "ja": "IANAは、「ATT-フィールド（メディアレベルのみ）」の副登録「セッション記述プロトコル（SDP）パラメータ」レジストリに2つのエントリを追加しました。"
    },
    {
      "indent": 3,
      "text": "The first entry is for 'hlang-recv':",
      "ja": "最初のエントリは、「hlang-RECV」のためであります："
    },
    {
      "indent": 3,
      "text": "Attribute Name: hlang-recv Long-Form English Name: human language receive Contact Name: Randall Gellens Contact Email Address: rg+ietf@coretechnologyconsulting.com Attribute Value: hlang-value Attribute Syntax: hlang-value = hlang-offv / hlang-ansv ; hlang-offv used in offers ; hlang-ansv used in answers hlang-offv = Language-Tag *( SP Language-Tag ) ; Language-Tag as defined in [BCP47] SP = 1*\" \" ; one or more space (%x20) characters hlang-ansv = Language-Tag Attribute Semantics: Described in Section 5.1 of RFC 8373 Usage Level: media Mux Category: NORMAL Charset Dependent: No Purpose: See Section 5.1 of RFC 8373 O/A Procedures: See Section 5.1 of RFC 8373 Reference: RFC 8373",
      "ja": "属性名：hlang-recvをロングフォーム英語名：人間の言語は、連絡先の名前を受け取る：ランドールGellens連絡先メールアドレス：rg+ietf@coretechnologyconsulting.com属性値：hlang値の属性の構文：hlang値= hlang-OFFV / hlang- ansv;申し出で使用hlang-OFFV。 hlang-ansv答えhlang-OFFV =言語タグ*（SP言語タグ）で使用されます。 SP = 1 *」 \"[BCP47]で定義されるように言語タグ。一つ以上のスペース（％×20）の文字hlang-ansv =言語タグは、意味属性：メディアのMuxカテゴリ：NORMAL文字セット依存：なし目的：RFCのセクション5.1 8373 O / Aの手順を参照してくださいRFCのセクション5.1 8373使用レベルで説明します：RFC 8373リファレンスのセクション5.1を参照してください。RFC 8373"
    },
    {
      "indent": 3,
      "text": "The second entry is for 'hlang-send':",
      "ja": "2番目のエントリは「hlang-送信」のためであります："
    },
    {
      "indent": 3,
      "text": "Attribute Name: hlang-send Long-Form English Name: human language send Contact Name: Randall Gellens Contact Email Address: rg+ietf@coretechnologyconsulting.com Attribute Value: hlang-value Attribute Syntax: hlang-value = hlang-offv / hlang-ansv Attribute Semantics: Described in Section 5.1 of RFC 8373 Usage Level: media Mux Category: NORMAL Charset Dependent: No Purpose: See Section 5.1 of RFC 8373 O/A Procedures: See Section 5.1 of RFC 8373 Reference: RFC 8373",
      "ja": "属性名：長い形式の英語名をhlang-送る：ランドールGellens連絡先メールアドレス：rg+ietf@coretechnologyconsulting.com属性値：hlang値の属性の構文：hlang値= hlang-OFFV / hlang-人間の言語は、連絡先の名前を送信ansv属性の意味：メディアマルチプレクサカテゴリ：NORMAL文字セット依存：なし目的：RFCのセクション5.1 8373 O / Aの手順を参照してください。RFC 8373：RFCのセクション5.1 8373リファレンスを参照してくださいRFCのセクション5.1 8373使用レベルで説明"
    },
    {
      "indent": 0,
      "text": "6.2. Warning Codes Subregistry of SIP Parameters",
      "section_title": true,
      "ja": "6.2. 警告コードSIPパラメータの副登録"
    },
    {
      "indent": 3,
      "text": "IANA has added the value 308 to the \"Warning Codes (warn-codes)\" subregistry of the \"Session Initiation Protocol (SIP) Parameters\" registry. (The value lies within the range allocated for indicating problems with keywords in the session description.) The reference is to this document. The warn text is \"Incompatible language specification: Requested languages not supported. Supported languages are [list of supported languages]; supported media are: [list of supported media].\"",
      "ja": "IANAは、「警告コード（警告・コード）」、「セッション開始プロトコル（SIP）パラメータ」レジストリの副登録に値308を追加しました。 （値は、セッション記述のキーワードの問題を示すために割り当てられた範囲内にある。）参照は、この文書にあります。警告文は、「互換性のない言語仕様：要求された言語がサポートされていないサポートされている言語は、[サポートされている言語のリスト]であり、サポートされているメディアは、次のとおりです。[サポートされているメディアのリスト]。」であります"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "The Security Considerations of [BCP47] apply here. An attacker with the ability to modify signaling could prevent a call from succeeding by altering any of several crucial elements, including the 'hlang-send' or 'hlang-recv' values. RFC 5069 [RFC5069] discusses such threats. Use of TLS or IPsec can protect against such threats. Emergency calls are of particular concern; RFC 6881 [RFC6881], which is specific to emergency calls, mandates use of TLS or IPsec (in ED-57/SP-30).",
      "ja": "[BCP47]のセキュリティの考慮事項が適用されます。シグナリングを変更する能力を持つ攻撃者が「hlang-送信」または「hlang-RECV」値を含むいくつかの重要な要素、のいずれかを変更することによって、後続のコールを防ぐことができます。 RFC 5069 [RFC5069]は、このような脅威について説明します。 TLSやIPsecの使用は、このような脅威から保護することができます。緊急コールが特に懸念されています。緊急呼に特有であるRFC 6881 [RFC6881]は、（ED-57 / SP-30）TLSやIPsecを使用することを義務付け。"
    },
    {
      "indent": 0,
      "text": "8. Privacy Considerations",
      "section_title": true,
      "ja": "8.プライバシーに関する注意事項"
    },
    {
      "indent": 3,
      "text": "Language and media information can suggest a user's nationality, background, abilities, disabilities, etc.",
      "ja": "言語やメディア情報、ユーザの国籍を提案することができ、背景、能力、障害者など"
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参考文献"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1. 引用規格"
    },
    {
      "indent": 3,
      "text": "[BCP47] Phillips, A., Ed. and M. Davis, Ed., \"Matching of Language Tags\", BCP 47, RFC 4647, DOI 10.17487/RFC4647, September 2006.",
      "ja": "[BCP47]フィリップス、A.編。そして、M.デイヴィス、エド。、 \"言語タグのマッチング\"、BCP 47、RFC 4647、DOI 10.17487 / RFC4647、2006年9月。"
    },
    {
      "indent": 14,
      "text": "Phillips, A., Ed. and M. Davis, Ed., \"Tags for Identifying\nLanguages\", BCP 47, RFC 5646, DOI 10.17487/RFC5646,\nSeptember 2009.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3261] Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A., Peterson, J., Sparks, R., Handley, M., and E. Schooler, \"SIP: Session Initiation Protocol\", RFC 3261, DOI 10.17487/RFC3261, June 2002, <https://www.rfc-editor.org/info/rfc3261>.",
      "ja": "[RFC3261]ローゼンバーグ、J.、Schulzrinneと、H.、カマリロ、G.、ジョンストン、A.、ピーターソン、J.、スパークス、R.、ハンドレー、M.、およびE.学生、 \"SIP：セッション開始プロトコル\" 、RFC 3261、DOI 10.17487 / RFC3261、2002年6月、<https://www.rfc-editor.org/info/rfc3261>。"
    },
    {
      "indent": 3,
      "text": "[RFC4566] Handley, M., Jacobson, V., and C. Perkins, \"SDP: Session Description Protocol\", RFC 4566, DOI 10.17487/RFC4566, July 2006, <https://www.rfc-editor.org/info/rfc4566>.",
      "ja": "[RFC4566]ハンドリー、M.、ヤコブソン、V.、およびC.パーキンス、 \"SDP：セッション記述プロトコル\"、RFC 4566、DOI 10.17487 / RFC4566、2006年7月、<https://www.rfc-editor.org/情報/ RFC4566>。"
    },
    {
      "indent": 3,
      "text": "[RFC5234] Crocker, D., Ed. and P. Overell, \"Augmented BNF for Syntax Specifications: ABNF\", STD 68, RFC 5234, DOI 10.17487/RFC5234, January 2008, <https://www.rfc-editor.org/info/rfc5234>.",
      "ja": "[RFC5234]クロッカー、D.、エド。そして、P. Overell、 \"構文仕様のための増大しているBNF：ABNF\"、STD 68、RFC 5234、DOI 10.17487 / RFC5234、2008年1月、<https://www.rfc-editor.org/info/rfc5234>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B.、 \"RFC 2119個のキーワードに小文字VS大文字の曖昧さ\"、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2. 参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC3264] Rosenberg, J. and H. Schulzrinne, \"An Offer/Answer Model with Session Description Protocol (SDP)\", RFC 3264, DOI 10.17487/RFC3264, June 2002, <https://www.rfc-editor.org/info/rfc3264>.",
      "ja": "[RFC3264]ローゼンバーグ、J.、およびH. Schulzrinneと、RFC 3264、DOI 10.17487 / RFC3264、2002年6月 \"セッション記述プロトコル（SDP）とのオファー/アンサーモデル\"、<https://www.rfc-editor.org /情報/ RFC3264>。"
    },
    {
      "indent": 3,
      "text": "[RFC5069] Taylor, T., Ed., Tschofenig, H., Schulzrinne, H., and M. Shanmugam, \"Security Threats and Requirements for Emergency Call Marking and Mapping\", RFC 5069, DOI 10.17487/RFC5069, January 2008, <https://www.rfc-editor.org/info/rfc5069>.",
      "ja": "[RFC5069]、RFC 5069、DOI 10.17487 / RFC5069、2008年1月、テイラー、T.、エド。、Tschofenig、H.、Schulzrinneと、H.、およびM・シャンミューガム、 \"緊急コールマーキングとマッピングのためのセキュリティの脅威と要件\" <https://www.rfc-editor.org/info/rfc5069>。"
    },
    {
      "indent": 3,
      "text": "[RFC6881] Rosen, B. and J. Polk, \"Best Current Practice for Communications Services in Support of Emergency Calling\", BCP 181, RFC 6881, DOI 10.17487/RFC6881, March 2013, <https://www.rfc-editor.org/info/rfc6881>.",
      "ja": "[RFC6881]ローゼン、B.とJ.ポーク、 \"緊急コールのサポートにおける通信サービスのための最も良い現在の練習\"、BCP 181、RFC 6881、DOI 10.17487 / RFC6881、2013年3月、<HTTPS：//www.rfc-editor .ORG /情報/ rfc6881>。"
    },
    {
      "indent": 3,
      "text": "[RFC8255] Tomkinson, N. and N. Borenstein, \"Multiple Language Content Type\", RFC 8255, DOI 10.17487/RFC8255, October 2017, <https://www.rfc-editor.org/info/rfc8255>.",
      "ja": "[RFC8255]トムキンソン、N.とN. Borenstein、 \"複数言語のコンテンツタイプ\"、RFC 8255、DOI 10.17487 / RFC8255、2017年10月、<https://www.rfc-editor.org/info/rfc8255>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Many thanks to Bernard Aboba, Harald Alvestrand, Flemming Andreasen, Francois Audet, Eric Burger, Keith Drage, Doug Ewell, Christian Groves, Andrew Hutton, Hadriel Kaplan, Ari Keranen, John Klensin, Mirja Kuhlewind, Paul Kyzivat, John Levine, Alexey Melnikov, Addison Phillips, James Polk, Eric Rescorla, Pete Resnick, Alvaro Retana, Natasha Rooney, Brian Rosen, Peter Saint-Andre, and Dale Worley for their reviews, corrections, suggestions, and participation in email and in-person discussions.",
      "ja": "バーナードAboba、ハラルドAlvestrand、フレミングAndreasenの、フランソワAudet、エリック・バーガー、キース糖剤、ダグイーウェル、クリスチャン・グローブス、アンドリュー・ハットン、Hadrielカプラン、アリKeranen、ジョン・クレンシン、Mirja Kuhlewind、ポールKyzivat、ジョン・レヴァイン、アレクセイ・メルニコフに感謝彼らのレビューのため、訂正、提案、参加メールにと対面ディスカッション、アディソン・フィリップス、ジェームズ・ポーク、エリックレスコラ、ピート・レズニック、アルバロRetana、ナターシャ・ルーニー、ブライアン・ローゼン、ピーター・サン・アンドレ、そしてデールウォーリー。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "協力者"
    },
    {
      "indent": 3,
      "text": "Gunnar Hellstrom deserves special mention for his reviews and assistance.",
      "ja": "グンナー・ヘルストロームは、彼のレビューと支援のための特別な言及に値します。"
    },
    {
      "indent": 0,
      "text": "Author's Address",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Randall Gellens Core Technology Consulting",
      "ja": "ランドールGellensコア技術コンサルティング"
    },
    {
      "indent": 3,
      "text": "Email: rg+ietf@coretechnologyconsulting.com URI: http://www.coretechnologyconsulting.com",
      "ja": "メール：rg+ietf@coretechnologyconsulting.com URI：http://www.coretechnologyconsulting.com"
    }
  ]
}