{
  "title": {
    "text": "RFC 8486 - Ambisonics in an Ogg Opus Container",
    "ja": "RFC 8486 - Ogg Opusコンテナ内のアンビソニックス"
  },
  "number": 8486,
  "created_at": "2019-10-23 15:24:28.237550+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                       J. Skoglund\nRequest for Comments: 8486                                    Google LLC\nUpdates: 7845                                                 M. Graczyk\nCategory: Standards Track                                   October 2018\nISSN: 2070-1721",
      "raw": true
    },
    {
      "indent": 18,
      "text": "Ambisonics in an Ogg Opus Container",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document defines an extension to the Opus audio codec to encapsulate coded Ambisonics using the Ogg format. It also contains updates to RFC 7845 to reflect necessary changes in the description of channel mapping families.",
      "ja": "このドキュメントでは、Ogg形式を使用してコード化されたAmbisonicsをカプセル化するためのOpusオーディオコーデックの拡張機能を定義しています。 また、チャネルマッピングファミリの説明に必要な変更を反映するためのRFC 7845の更新も含まれています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット標準化過程の文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、Internet Engineering Task Force（IETF）の製品です。 IETFコミュニティのコンセンサスを表しています。 これは公開レビューを受けており、Internet Engineering Steering Group（IESG）による公開が承認されています。 インターネット標準の詳細については、RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8486.",
      "ja": "このドキュメントの現在のステータス、エラッタ、およびフィードバックに関する情報は、https：//www.rfc-editor.org/info/rfc8486で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2018 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2018 IETF Trustおよび文書作成者として特定された人物。 全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書は、BCP 78と、この文書の公開日に有効なIETF文書に関するIETFトラストの法的条項（https://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているので、注意深く確認してください。 このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseテキストを含める必要があり、Simplified BSD Licenseに記載されている保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2\n2.  Terminology . . . . . . . . . . . . . . . . . . . . . . . . .   3\n3.  Ambisonics with Ogg Opus  . . . . . . . . . . . . . . . . . .   3\n  3.1.  Channel Mapping Family 2  . . . . . . . . . . . . . . . .   3\n  3.2.  Channel Mapping Family 3  . . . . . . . . . . . . . . . .   4\n  3.3.  Allowed Numbers of Channels . . . . . . . . . . . . . . .   5\n4.  Downmixing  . . . . . . . . . . . . . . . . . . . . . . . . .   6\n5.  Updates to RFC 7845 . . . . . . . . . . . . . . . . . . . . .   7\n  5.1.  Format of the Channel Mapping Table . . . . . . . . . . .   7\n  5.2.  Unknown Mapping Families  . . . . . . . . . . . . . . . .   8\n6.  Experimental Mapping Families . . . . . . . . . . . . . . . .   8\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .   8\n8.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   9\n9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   9\n  9.1.  Normative References  . . . . . . . . . . . . . . . . . .   9\n  9.2.  Informative References  . . . . . . . . . . . . . . . . .  10\nAcknowledgments . . . . . . . . . . . . . . . . . . . . . . . . .  10\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  10",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "Ambisonics is a representation format for three-dimensional sound fields that can be used for surround sound and immersive virtual-reality playback. See [fellgett75] and [daniel04] for technical details on the Ambisonics format. For the purposes of the this document, Ambisonics can be considered a multichannel audio stream. A separate stereo stream can be used alongside the Ambisonics in a head-tracked virtual reality experience to provide so-called non-diegetic audio -- that is, audio that should remain unchanged by rotation of the listener's head, such as narration or stereo music. Ogg is a general-purpose container, supporting audio, video, and other media. It can be used to encapsulate audio streams coded using the Opus codec. See [RFC6716] and [RFC7845] for technical details on the Opus codec and its encapsulation in the Ogg container, respectively.",
      "ja": "Ambisonicsは、サラウンドサウンドと没入型の仮想現実の再生に使用できる3次元の音場の表現形式です。 Ambisonics形式の技術的な詳細については、[fellgett75]および[daniel04]を参照してください。 このドキュメントの目的上、Ambisonicsはマルチチャンネルオーディオストリームと見なすことができます。 別のステレオストリームをAmbisonicsと共にヘッドトラッキングのバーチャルリアリティエクスペリエンスで使用して、いわゆる非独創的なオーディオ、つまり、ナレーションやステレオミュージックなど、リスナーの頭の回転によって変化しないオーディオを提供できます 。 Oggは、オーディオ、ビデオ、およびその他のメディアをサポートする汎用コンテナーです。 Opusコーデックを使用してコード化されたオーディオストリームをカプセル化するために使用できます。 OpusコーデックとOggコンテナでのカプセル化の技術的な詳細については、それぞれ[RFC6716]および[RFC7845]を参照してください。"
    },
    {
      "indent": 3,
      "text": "This document extends the Ogg Opus format by defining two new channel mapping families for encoding Ambisonics. The Ogg Opus format is extended indirectly by adding items with values 2 and 3 to the \"Opus Channel Mapping Families\" IANA registry. When 2 or 3 are used as the Channel Mapping Family Number in an Ogg stream, the semantic meaning of the channels in the multichannel Opus stream is one of the Ambisonics layouts defined in this document. This mapping can also be used in other contexts that make use of the channel mappings defined by the \"Opus Channel Mapping Families\" registry.",
      "ja": "このドキュメントは、Ambisonicsをエンコードするための2つの新しいチャネルマッピングファミリを定義することにより、Ogg Opus形式を拡張します。 Ogg Opus形式は、値2および3のアイテムを「Opus Channel Mapping Family」IANAレジストリに追加することにより間接的に拡張されます。 Oggストリームでチャネルマッピングファミリ番号として2または3が使用される場合、マルチチャネルOpusストリームのチャネルの意味は、このドキュメントで定義されているAmbisonicsレイアウトの1つです。 このマッピングは、「Opus Channel Mapping Families」レジストリで定義されたチャネルマッピングを利用する他のコンテキストでも使用できます。"
    },
    {
      "indent": 3,
      "text": "Furthermore, mapping families 240 through 254 (inclusively) are reserved for experimental use.",
      "ja": "さらに、マッピングファミリ240〜254（包括的）は実験用に予約されています。"
    },
    {
      "indent": 0,
      "text": "2. Terminology",
      "section_title": true,
      "ja": "2.用語"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "キーワード「MUST」、「MUST NOT」、「REQUIRED」、「SHALL」、「SHALL NOT」、「SHOULD」、「SHOULD NOT」、「RECOMMENDED」、「NOT RECOMMENDED」、「MAY」、および「OPTIONAL」 この文書の「」は、BCP 14 [RFC2119] [RFC8174]で説明されているように、ここに示すようにすべての大文字で表示される場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "3. Ambisonics with Ogg Opus",
      "section_title": true,
      "ja": "3. Ogg Opusを使用したAmbisonics"
    },
    {
      "indent": 3,
      "text": "Ambisonics can be encapsulated in the Ogg format by encoding with the Opus codec and setting the channel mapping family value to 2 or 3 in the Ogg identification (ID) header. A demuxer implementation encountering channel mapping family 2 or 3 MUST interpret the Opus stream as containing Ambisonics with the format described in Sections 3.1 or 3.2, respectively.",
      "ja": "Obiコーデックでエンコードし、Ogg識別（ID）ヘッダーでチャネルマッピングファミリの値を2または3に設定することにより、AmbisonicsをOgg形式でカプセル化できます。 チャネルマッピングファミリ2または3に遭遇するデマルチプレクサ実装は、それぞれセクション3.1または3.2で説明されている形式のAmbisonicsを含むものとしてOpusストリームを解釈する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.1. Channel Mapping Family 2",
      "section_title": true,
      "ja": "3.1。 チャネルマッピングファミリ2"
    },
    {
      "indent": 3,
      "text": "This channel mapping uses the same channel mapping table format used by channel mapping family 1. The output channels are Ambisonic components ordered in Ambisonic Channel Number (ACN) order (which is defined in Figure 1) followed by two optional channels of non-diegetic stereo indexed (left, right). The terms \"order\" and \"degree\" are defined according to [ambix].",
      "ja": "このチャネルマッピングは、チャネルマッピングファミリ1で使用されるのと同じチャネルマッピングテーブル形式を使用します。出力チャネルは、Ambisonic Channel Number（ACN）の順序で並べられたAmbisonicコンポーネントです（図1で定義）。 インデックス付き（左、右）。 「順序」および「度」という用語は、[ambix]に従って定義されます。"
    },
    {
      "indent": 25,
      "text": "ACN = n * (n + 1) + m,\nfor order n and degree m.",
      "raw": true
    },
    {
      "indent": 17,
      "text": "Figure 1: Ambisonic Channel Number (ACN)",
      "ja": "図1：Ambisonicチャンネル番号（ACN）"
    },
    {
      "indent": 3,
      "text": "For the Ambisonic channels, the ACN component corresponds to channel index as k = ACN. The reverse correspondence can also be computed for an Ambisonic channel with index k.",
      "ja": "Ambisonicチャネルの場合、ACNコンポーネントはチャネルインデックスに対応し、k = ACNです。 逆対応は、インデックスkのAmbisonicチャネルに対しても計算できます。"
    },
    {
      "indent": 23,
      "text": "order   n = floor(sqrt(k)),\ndegree  m = k - n * (n + 1).",
      "raw": true
    },
    {
      "indent": 15,
      "text": "Figure 2: Ambisonic Degree and Order from ACN",
      "ja": "図2：ACNからのアンビソニック度と順序"
    },
    {
      "indent": 3,
      "text": "Note that channel mapping family 2 allows for so-called mixed-order Ambisonic representation, in which only a subset of the full Ambisonic order number of channels is encoded. By specifying the full number in the channel count field, the inactive ACNs can then be indicated in the channel mapping field using the index 255.",
      "ja": "チャネルマッピングファミリ2では、いわゆる混合次アンビソニック表現が可能です。この場合、完全なアンビソニック次数のチャネルのサブセットのみがエンコードされます。 チャネルカウントフィールドで完全な数を指定することにより、インデックス255を使用してチャネルマッピングフィールドで非アクティブなACNを示すことができます。"
    },
    {
      "indent": 3,
      "text": "Ambisonic channels are normalized with Schmidt Semi-Normalization (SN3D). The interpretation of the Ambisonics signal as well as detailed definitions of ACN channel ordering and SN3D normalization are described in [ambix], Section 2.1.",
      "ja": "Ambisonicチャネルは、Schmidt Semi-Normalization（SN3D）で正規化されます。 Ambisonics信号の解釈、およびACNチャネル順序とSN3D正規化の詳細な定義は、[ambix]、セクション2.1で説明されています。"
    },
    {
      "indent": 0,
      "text": "3.2. Channel Mapping Family 3",
      "section_title": true,
      "ja": "3.2。 チャネルマッピングファミリ3"
    },
    {
      "indent": 3,
      "text": "In this mapping, C output channels (the channel count) are generated at the decoder by multiplying K = N + M decoded channels with a designated demixing matrix, D, having C rows and K columns (C and K do not have to be equal). Here, N denotes the number of streams encoded, and M is the number of these encoded streams that are coupled to produce two channels. As for channel mapping family 2, this mapping family also allows for the encoding and decoding of full-order Ambisonics and mixed-order Ambisonics, as well as non-diegetic stereo channels. Furthermore, it has the added flexibility of mixing channels. Let X denote a column vector containing K decoded channels X1, X2, ..., XK (from N streams), and let S denote a column vector containing C output streams S1, S2, ..., SC. Then, S = D X, as shown in Figure 3.",
      "ja": "このマッピングでは、C行とK列（CとKが等しくなくてもよい）を持つ指定された分離行列DでK = N + Mデコードされたチャネルを乗算することにより、C出力チャネル（チャネルカウント）がデコーダで生成されます ）。 ここで、Nはエンコードされたストリームの数を示し、Mは2つのチャネルを生成するために結合されたこれらのエンコードされたストリームの数です。 チャネルマッピングファミリ2に関しては、このマッピングファミリでは、フルオーダーのアンビソニックスとミックスオーダーのアンビソニックス、および非ダイジェティックステレオチャンネルのエンコードとデコードも可能です。 さらに、チャンネルをミキシングする柔軟性が追加されています。 Xは（N個のストリームから）K個のデコードされたチャネルX1、X2、...、XKを含む列ベクトルを示し、SはC個の出力ストリームS1、S2、...、SCを含む列ベクトルを示します。 次に、図3に示すように、S = D Xです。"
    },
    {
      "indent": 18,
      "text": "/     \\   /                   \\ /     \\\n| S1  |   | D11  D12  ... D1K | | X1  |\n| S2  |   | D21  D22  ... D2K | | X2  |\n| ... | = | ...  ...  ... ... | | ... |\n| SC  |   | DC1  DC2  ... DCK | | XK  |\n\\     /   \\                   / \\     /",
      "raw": true
    },
    {
      "indent": 14,
      "text": "Figure 3: Demixing in Channel Mapping Family 3",
      "ja": "図3：チャンネルマッピングファミリー3での分離"
    },
    {
      "indent": 3,
      "text": "The matrix MUST be provided in the channel mapping table part of the identification header; see Section 5.1.1 of [RFC7845]. The matrix replaces the need for a channel mapping field; for channel mapping family 3, the mapping table has the following layout:",
      "ja": "マトリックスは、識別ヘッダーのチャネルマッピングテーブル部分で提供される必要があります。 [RFC7845]のセクション5.1.1を参照してください。 マトリックスは、チャネルマッピングフィールドの必要性を置き換えます。 チャネルマッピングファミリ3の場合、マッピングテーブルのレイアウトは次のとおりです。"
    },
    {
      "indent": 5,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n                                                +-+-+-+-+-+-+-+-+\n                                                | Stream Count  |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n| Coupled Count | Demixing Matrix                               :\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 7,
      "text": "Figure 4: Channel Mapping Table for Channel Mapping Family 3",
      "ja": "図4：チャネルマッピングファミリ3のチャネルマッピングテーブル"
    },
    {
      "indent": 3,
      "text": "The fields in the channel mapping table have the following meaning:",
      "ja": "チャネルマッピングテーブルのフィールドには次の意味があります。"
    },
    {
      "indent": 3,
      "text": "1. Stream Count \"N\" (8 bits, unsigned):",
      "section_title": true,
      "ja": "1.ストリームカウント「N」（8ビット、符号なし）："
    },
    {
      "indent": 7,
      "text": "This is the total number of streams encoded in each Ogg packet.",
      "ja": "これは、各Oggパケットでエンコードされたストリームの総数です。"
    },
    {
      "indent": 3,
      "text": "2. Coupled Stream Count \"M\" (8 bits, unsigned):",
      "section_title": true,
      "ja": "2.結合ストリームカウント「M」（8ビット、符号なし）："
    },
    {
      "indent": 7,
      "text": "This is the number of the N streams whose decoders are to be\nconfigured to produce two channels (stereo).",
      "raw": true
    },
    {
      "indent": 3,
      "text": "3. Demixing Matrix (16*K*C bits, signed):",
      "section_title": true,
      "ja": "3.マトリックスの分離（16 * K * Cビット、署名済み）："
    },
    {
      "indent": 7,
      "text": "The coefficients of the demixing matrix stored in column-major\norder as 16-bit, signed, two's complement fixed-point values with\n15 fractional bits (Q15), little endian.  If needed, the output\ngain field can be used for a normalization scale.  For mixed-\norder Ambisonic representations, the silent ACN channels are\nindicated by all zeros in the corresponding rows of the mixing\nmatrix.  This also allows for mixed order with non-diegetic\nstereo as the number of columns implies the presence of non-\ndiegetic channels.",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Note that [RFC7845] specifies that the identification header cannot exceed one \"page\", which is 65,025 octets. This limits the Ambisonic order, which then MUST be lower than 12, if full order is utilized and the number of coded streams is the same as the Ambisonic order plus the two non-diegetic channels. The total output channel number, C, MUST be set in the third field of the identification header.",
      "ja": "[RFC7845]は、識別ヘッダーが1つの「ページ」、つまり65,025オクテットを超えてはならないことを指定していることに注意してください。 これにより、Ambisonicの順序が制限されます。完全な順序が使用され、コード化されたストリームの数がAmbisonicの順序に2つの非ダイジェティックチャネルを加えた場合、12より低くなければなりません。 総出力チャネル番号Cは、識別ヘッダーの3番目のフィールドに設定する必要があります。"
    },
    {
      "indent": 0,
      "text": "3.3. Allowed Numbers of Channels",
      "section_title": true,
      "ja": "3.3。 許可されたチャンネル数"
    },
    {
      "indent": 3,
      "text": "For both channel mapping families 2 and 3, the allowed numbers of channels are (1 + n)^2 + 2j for n = 0, 1, ..., 14 and j = 0 or 1, where n denotes the (highest) Ambisonic order and j denotes whether or not there is a separate non-diegetic stereo stream. This corresponds to periphonic Ambisonics from zeroth to fourteenth order plus potentially two channels of non-diegetic stereo. Explicitly, the allowed number of channels are 1, 3, 4, 6, 9, 11, 16, 18, 25, 27, 36, 38, 49, 51, 64, 66, 81, 83, 100, 102, 121, 123, 144, 146, 169, 171, 196, 198, 225, and 227. Note again that if full Ambisonic order is used and the number of coded streams is the same as the Ambisonic order plus the two non-diegetic channels, the order must then be lower than 12, due to the identification header length limit.",
      "ja": "チャネルマッピングファミリ2と3の両方で、n = 0、1、...、14、およびj = 0または1の場合、許可されるチャネル数は（1 + n）^ 2 + 2jです。nは（最高）を示します アンビソニックの順序とjは、独立した非独創的なステレオストリームがあるかどうかを示します。 これは、0次から14次までのペリフォニックアンビソニックスに加えて、潜在的に2チャンネルの非独創的なステレオに対応します。 明示的に、許可されるチャネルの数は1、3、4、6、9、11、16、18、25、27、36、38、49、51、64、66、81、83、100、102、121、 123、144、146、169、171、196、198、225、および227。再度、完全なアンビソニック次数が使用され、コード化されたストリームの数がアンビソニック次数と2つの非ダイジェティックチャネルと同じである場合、 識別ヘッダーの長さの制限により、順序は12未満でなければなりません。"
    },
    {
      "indent": 0,
      "text": "4. Downmixing",
      "section_title": true,
      "ja": "4.ダウンミキシング"
    },
    {
      "indent": 3,
      "text": "The downmixing matrices in this section are only examples known to give acceptable results for stereo downmixing from Ambisonics, but other mixing strategies will be allowed, e.g., to emphasize a certain panning.",
      "ja": "このセクションのダウンミキシングマトリックスは、Ambisonicsからのステレオダウンミキシングで許容できる結果が得られることがわかっている例にすぎませんが、たとえば特定のパンニングを強調するために、他のミキシング戦略を使用できます。"
    },
    {
      "indent": 3,
      "text": "An Ogg Opus player MAY use the matrix in Figure 5 to implement downmixing from multichannel files using channel mapping families 2 and 3 when there is no non-diegetic stereo. The first and second Ambisonic channels are known as \"W\" and \"Y\", respectively. The omitted coefficients in the matrix in the figure have the value 0.0.",
      "ja": "Ogg Opusプレーヤーは、図5のマトリックスを使用して、非ダイジェティックステレオがない場合に、チャネルマッピングファミリ2および3を使用してマルチチャネルファイルからのダウンミキシングを実装できます。 最初と2番目のAmbisonicチャネルは、それぞれ「W」と「Y」として知られています。 図のマトリックスで省略された係数の値は0.0です。"
    },
    {
      "indent": 19,
      "text": "/   \\   /                  \\ /     \\\n| L |   | 0.5  0.5 0.0 ... | |  W  |\n| R | = | 0.5 -0.5 0.0 ... | |  Y  |\n\\   /   \\                  / | ... |\n                             \\     /",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Figure 5: Stereo Downmixing Matrix for Channel Mapping Families 2 and 3 - Only Ambisonic Channels",
      "ja": "図5：チャンネルマッピングファミリー2および3のステレオダウンミキシングマトリックス-Ambisonicチャンネルのみ"
    },
    {
      "indent": 3,
      "text": "The first Ambisonic channel (W) is a mono audio stream that represents the average audio signal over all directions. Since W is not directional, Ogg Opus players MAY use W directly for mono playback.",
      "ja": "最初のAmbisonicチャネル（W）は、全方向の平均オーディオ信号を表すモノラルオーディオストリームです。 Wは方向性を持たないため、Ogg Opusプレーヤーはモノラル再生にWを直接使用できます。"
    },
    {
      "indent": 3,
      "text": "If a non-diegetic stereo track is present, the player MAY use the matrix in Figure 6 for downmixing. Ls and Rs denote the two non-diegetic stereo channels.",
      "ja": "非独創的なステレオトラックが存在する場合、プレーヤーは図6のマトリックスを使用してダウンミキシングを行うことができます。 LsとRsは、2つの非独創的なステレオチャネルを示します。"
    },
    {
      "indent": 14,
      "text": "/   \\   /                            \\  /     \\\n| L |   | 0.25  0.25 0.0 ... 0.5 0.0 |  |  W  |\n| R | = | 0.25 -0.25 0.0 ... 0.0 0.5 |  |  Y  |\n\\   /   \\                            /  | ... |\n                                        |  Ls |\n                                        |  Rs |\n                                        \\     /",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Figure 6: Stereo Downmixing Matrix for Channel Mapping Families 2 and 3 - Ambisonic Channels Plus a Non-Diegetic Stereo Stream",
      "ja": "図6：チャンネルマッピングファミリー2および3のステレオダウンミキシングマトリックス-アンビソニックチャンネルと非ダイジェティックステレオストリーム"
    },
    {
      "indent": 1,
      "text": "5. Updates to",
      "section_title": true,
      "ja": "5.への更新"
    },
    {
      "indent": 0,
      "text": "5.1. Format of the Channel Mapping Table",
      "section_title": true,
      "ja": "5.1。 チャネルマッピングテーブルの形式"
    },
    {
      "indent": 3,
      "text": "The language in Section 5.1.1 of [RFC7845] (copied below) implies that the channel mapping table, when present, has a fixed format for all channel mapping families:",
      "ja": "[RFC7845]のセクション5.1.1（以下にコピー）の言語は、チャネルマッピングテーブルが存在する場合、すべてのチャネルマッピングファミリに対して固定形式であることを意味します。"
    },
    {
      "indent": 6,
      "text": "The order and meaning of these channels are defined by a channel mapping, which consists of the 'channel mapping family' octet and, for channel mapping families other than family 0, a 'channel mapping table', as illustrated in Figure 3.",
      "ja": "これらのチャネルの順序と意味は、図3に示すように、「チャネルマッピングファミリ」オクテットと、ファミリ0以外のチャネルマッピングファミリの「チャネルマッピングテーブル」で構成されるチャネルマッピングによって定義されます。"
    },
    {
      "indent": 3,
      "text": "This document updates [RFC7845] to clarify that the format of the channel mapping table may depend on the channel mapping family:",
      "ja": "このドキュメントは、[RFC7845]を更新して、チャネルマッピングテーブルの形式がチャネルマッピングファミリに依存する可能性があることを明確にします。"
    },
    {
      "indent": 6,
      "text": "The order and meaning of these channels are defined by a channel mapping, which consists of the 'channel mapping family' octet and for channel mapping families other than family 0, a 'channel mapping table'.",
      "ja": "これらのチャネルの順序と意味は、「チャネルマッピングファミリ」オクテットおよびファミリ0以外のチャネルマッピングファミリの「チャネルマッピングテーブル」で構成されるチャネルマッピングによって定義されます。"
    },
    {
      "indent": 6,
      "text": "The format of the channel mapping table depends on the channel mapping family. Unless the channel mapping family requires a custom format for its channel mapping table, the RECOMMENDED channel mapping table format for new mapping families is illustrated in Figure 3.",
      "ja": "チャネルマッピングテーブルの形式は、チャネルマッピングファミリによって異なります。 チャネルマッピングファミリがそのチャネルマッピングテーブルのカスタム形式を必要としない限り、新しいマッピングファミリの推奨されるチャネルマッピングテーブル形式を図3に示します。"
    },
    {
      "indent": 3,
      "text": "The change above is not meant to change how families 1 and 255 currently work. To ensure that, the first paragraph of Section 5.1.1.2 is changed from:",
      "ja": "上記の変更は、ファミリー1および255の現在の動作を変更することを意図したものではありません。 それを確実にするために、セクション5.1.1.2の最初の段落は次のように変更されます。"
    },
    {
      "indent": 6,
      "text": "Allowed numbers of channels: 1...8. Vorbis channel order (see below).",
      "ja": "許可されるチャンネル数：1 ... 8。 Vorbisチャネルの順序（以下を参照）。"
    },
    {
      "indent": 3,
      "text": "to:",
      "ja": "に："
    },
    {
      "indent": 6,
      "text": "Allowed numbers of channels: 1...8, with the mapping specified according to Figure 3. Vorbis channel order (see below).",
      "ja": "許可されるチャネル数：1 ... 8、マッピングは図3に従って指定されます。Vorbisチャネルの順序（以下を参照）。"
    },
    {
      "indent": 3,
      "text": "Similarly, the first paragraph of Section 5.1.1.3 is changed from:",
      "ja": "同様に、セクション5.1.1.3の最初の段落は以下から変更されています。"
    },
    {
      "indent": 6,
      "text": "Allowed numbers of channels: 1...255. No defined channel meaning.",
      "ja": "許可されるチャネル数：1 ... 255。 チャネルの意味が定義されていません。"
    },
    {
      "indent": 3,
      "text": "to:",
      "ja": "に："
    },
    {
      "indent": 6,
      "text": "Allowed numbers of channels: 1...255, with the mapping specified according to Figure 3. No defined channel meaning.",
      "ja": "許可されるチャネル数：1 ... 255。マッピングは図3に従って指定されます。チャネルの意味は定義されていません。"
    },
    {
      "indent": 0,
      "text": "5.2. Unknown Mapping Families",
      "section_title": true,
      "ja": "5.2。 不明なマッピングファミリ"
    },
    {
      "indent": 3,
      "text": "The treatment of unknown mapping families is changed slightly. Section 5.1.1.4 of [RFC7845] states:",
      "ja": "未知のマッピングファミリの扱いが若干変更されました。 [RFC7845]のセクション5.1.1.4には次のように記載されています。"
    },
    {
      "indent": 6,
      "text": "The remaining channel mapping families (2...254) are reserved. A demuxer implementation encountering a reserved 'channel mapping family' value SHOULD act as though the value is 255.",
      "ja": "残りのチャネルマッピングファミリ（2 ... 254）は予約されています。 予約された「チャネルマッピングファミリ」値に遭遇したデマルチプレクサ実装は、値が255であるかのように動作する必要があります。"
    },
    {
      "indent": 3,
      "text": "This is changed to:",
      "ja": "これは次のように変更されます。"
    },
    {
      "indent": 6,
      "text": "The remaining channel mapping families (2...254) are reserved. A demuxer implementation encountering a 'channel mapping family' value that it does not recognize SHOULD NOT attempt to decode the packets and SHOULD NOT use any information except for the first 19 octets of the ID header packet (Figure 2) and the comment header (Figure 10).",
      "ja": "残りのチャネルマッピングファミリ（2 ... 254）は予約されています。 認識されない「チャネルマッピングファミリ」値に遭遇したデマルチプレクサー実装は、パケットのデコードを試行すべきではなく、IDヘッダーパケットの最初の19オクテット（図2）およびコメントヘッダー（図 10）。"
    },
    {
      "indent": 0,
      "text": "6. Experimental Mapping Families",
      "section_title": true,
      "ja": "6.実験的マッピングファミリー"
    },
    {
      "indent": 3,
      "text": "To make development of new mapping families easier while reducing the risk of creating compatibility issues with non-final versions of mapping families, mapping families 240 through 254 (inclusively) are now reserved for experiments and implementations of in-development families. Note that these mapping-family experiments are not restricted to Ambisonics. Implementers SHOULD attempt to use experimental family numbers that have not recently been used and SHOULD advertise what experimental numbers they use (e.g., for Internet-Drafts).",
      "ja": "マッピングファミリの非最終バージョンとの互換性の問題を作成するリスクを軽減しながら、新しいマッピングファミリの開発を容易にするために、マッピングファミリ240から254（包括的）は、開発中ファミリの実験および実装のために予約されています。 これらのマッピングファミリの実験はAmbisonicsに限定されないことに注意してください。 実装者は、最近使用されていない実験的な家族番号の使用を試みるべきであり、使用している実験的な番号を宣伝する必要があります（たとえば、インターネットドラフト用）。"
    },
    {
      "indent": 3,
      "text": "The Ambisonics mapping experiments that led to this document used experimental family 254 for family 2 and experimental family 253 for family 3.",
      "ja": "このドキュメントにつながったAmbisonicsマッピング実験では、ファミリー2に実験ファミリー254、ファミリー3に実験ファミリー253を使用しました。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "Implementations of the Ogg container need to take appropriate security considerations into account, as outlined in Section 8 of [RFC7845]. The extension defined in this document requires that semantic meaning be assigned to more channels than the existing Ogg format requires. Since more allocations will be required to encode and decode these semantically meaningful channels, care should be taken in any new allocation paths. Implementations MUST NOT overrun their allocated memory nor read from uninitialized memory when managing the Ambisonic channel mapping.",
      "ja": "[RFC7845]のセクション8に概説されているように、Oggコンテナの実装では、適切なセキュリティ上の考慮事項を考慮する必要があります。 このドキュメントで定義されている拡張機能では、既存のOgg形式が必要とするよりも多くのチャネルにセマンティックな意味を割り当てる必要があります。 これらの意味的に意味のあるチャネルをエンコードおよびデコードするには、より多くの割り当てが必要になるため、新しい割り当てパスでは注意が必要です。 実装は、Ambisonicチャネルマッピングを管理するときに、割り当てられたメモリをオーバーランしたり、初期化されていないメモリから読み取ったりしてはなりません。"
    },
    {
      "indent": 0,
      "text": "8. IANA Considerations",
      "section_title": true,
      "ja": "8. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "IANA has added 17 new assignments to the \"Opus Channel Mapping Families^a registry.",
      "ja": "IANAは「Opus Channel Mapping Families ^ aレジストリに17の新しい割り当てを追加しました。"
    },
    {
      "indent": 3,
      "text": "+---------+----------------------+----------------------------------+\n| Value   | Description          | Reference                        |\n+---------+----------------------+----------------------------------+\n| 0       | Mono, L/R stereo     | Section 5.1.1.1 of [RFC7845],    |\n|         |                      | Section 5 of this document       |\n|         |                      |                                  |\n| 1       | 1-8 channel surround | Section 5.1.1.2 of [RFC7845],    |\n|         |                      | Section 5 of this document       |\n|         |                      |                                  |\n| 2       | Ambisonics as        | Section 3.1 of this document     |\n|         | individual channels  |                                  |\n|         |                      |                                  |\n| 3       | Ambisonics with      | Section 3.2 of this document     |\n|         | demixing matrix      |                                  |\n|         |                      |                                  |\n| 240-254 | Experimental use     | Section 6 of this document       |\n|         |                      |                                  |\n| 255     | Discrete channels    | Section 5.1.1.3 of [RFC7845],    |\n|         |                      | Section 5 of this document       |\n+---------+----------------------+----------------------------------+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "9. References",
      "section_title": true,
      "ja": "9.参照"
    },
    {
      "indent": 0,
      "text": "9.1. Normative References",
      "section_title": true,
      "ja": "9.1。 規範的参考文献"
    },
    {
      "indent": 3,
      "text": "[ambix] Nachbar, C., Zotter, F., Deleflie, E., and A. Sontacchi, \"AMBIX - A SUGGESTED AMBISONICS FORMAT\", Ambisonics Symposium, June 2011, <http://iem.kug.ac.at/fileadmin/media/iem/projects/2011/ ambisonics11_nachbar_zotter_sontacchi_deleflie.pdf>.",
      "ja": "[ambix] Nachbar、C.、Zotter、F.、Deleflie、E。、およびA. Sontacchi、「AMBIX-A SUGGESTED AMBISONICS FORMAT」、Ambisonics Symposium、2011年6月、<http://iem.kug.ac.at / fileadmin / media / iem / projects / 2011 / ambisonics11_nachbar_zotter_sontacchi_deleflie.pdf>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S.、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC6716] Valin, JM., Vos, K., and T. Terriberry, \"Definition of the Opus Audio Codec\", RFC 6716, DOI 10.17487/RFC6716, September 2012, <https://www.rfc-editor.org/info/rfc6716>.",
      "ja": "[RFC6716] Valin、JM。、Vos、K。、およびT. Terriberry、「Definition of the Opus Audio Codec」、RFC 6716、DOI 10.17487 / RFC6716、2012年9月、<https://www.rfc-editor.org / info / rfc6716>。"
    },
    {
      "indent": 3,
      "text": "[RFC7845] Terriberry, T., Lee, R., and R. Giles, \"Ogg Encapsulation for the Opus Audio Codec\", RFC 7845, DOI 10.17487/RFC7845, April 2016, <https://www.rfc-editor.org/info/rfc7845>.",
      "ja": "[RFC7845] Terriberry、T.、Lee、R。、およびR. Giles、「OpusオーディオコーデックのOggカプセル化」、RFC 7845、DOI 10.17487 / RFC7845、2016年4月、<https：//www.rfc-editor。 org / info / rfc7845>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 0,
      "text": "9.2. Informative References",
      "section_title": true,
      "ja": "9.2。 参考資料"
    },
    {
      "indent": 3,
      "text": "[daniel04] Daniel, J. and S. Moreau, \"Further Study of Sound Field Coding with Higher Order Ambisonics\", Audio Engineering Society Convention Paper, May 2004, <https://www.researchgate.net/publication/ 277841868_Further_Study_of_Sound_Field_Coding _with_Higher_Order_Ambisonics>.",
      "ja": "[daniel04]ダニエル、J。およびS.モロー、「高次アンビソニックスによる音場コーディングのさらなる研究」、オーディオエンジニアリングソサエティコンベンションペーパー、2004年5月、<https://www.researchgate.net/publication/ 277841868_Further_Study_of_Sound_Field_Coding _with_Higher_Order_Ambisonics> 。"
    },
    {
      "indent": 3,
      "text": "[fellgett75] Fellgett, P., \"Ambisonics. Part one: General system description\", Studio Sound vol. 17, no. 8, pp. 20-22, August 1975, <http://www.michaelgerzonphotos.org.uk/articles/ Ambisonics%201.pdf>.",
      "ja": "[fellgett75] Fellgett、P。、「Ambisonics。パート1：一般的なシステムの説明」、Studio Sound vol。 17、いいえ。 8、pp。20-22、1975年8月、<http://www.michaelgerzonphotos.org.uk/articles/ Ambisonics％201.pdf>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgments",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Thanks to Timothy Terriberry, Jean-Marc Valin, Mark Harris, Marcin Gorzel, and Andrew Allen for their guidance and valuable contributions to this document.",
      "ja": "このドキュメントへのガイダンスと貴重な貢献をしてくれたTimothy Terriberry、Jean-Marc Valin、Mark Harris、Marcin Gorzel、およびAndrew Allenに感謝します。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Jan Skoglund Google LLC 345 Spear Street San Francisco, CA 94105 United States of America",
      "ja": "Jan Skoglund Google LLC 345 Spear Street San Francisco、CA 94105アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: jks@google.com",
      "ja": "メール：jks@google.com"
    },
    {
      "indent": 3,
      "text": "Michael Graczyk",
      "ja": "マイケル・グラチク"
    },
    {
      "indent": 3,
      "text": "Email: michael@mgraczyk.com",
      "ja": "メール：michael@mgraczyk.com"
    }
  ]
}