{
  "title": {
    "text": "RFC 8669 - Segment Routing Prefix Segment Identifier Extensions for BGP",
    "ja": "RFC 8669 - BGPのセグメントルーティングプレフィックスセグメント識別子拡張"
  },
  "number": 8669,
  "created_at": "2020-03-10 11:04:40.999071+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                        S. Previdi\nRequest for Comments: 8669                           Huawei Technologies\nCategory: Standards Track                                    C. Filsfils\nISSN: 2070-1721                                           A. Lindem, Ed.\n                                                           Cisco Systems\n                                                          A. Sreekantiah",
      "raw": true
    },
    {
      "indent": 59,
      "text": " H. Gredler RtBrick Inc. December 2019",
      "ja": "H.グレドラーRtBrick Inc. 2019年12月"
    },
    {
      "indent": 6,
      "text": "Segment Routing Prefix Segment Identifier Extensions for BGP",
      "ja": "BGPのセグメントルーティングプレフィックスセグメント識別子拡張"
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "概要"
    },
    {
      "indent": 3,
      "text": "Segment Routing (SR) leverages the source-routing paradigm. A node steers a packet through an ordered list of instructions called \"segments\". A segment can represent any instruction, topological or service based. The ingress node prepends an SR header to a packet containing a set of segment identifiers (SIDs). Each SID represents a topological or service-based instruction. Per-flow state is maintained only on the ingress node of the SR domain. An \"SR domain\" is defined as a single administrative domain for global SID assignment.",
      "ja": "セグメントルーティング（SR）は、ソースルーティングパラダイムを活用します。 ノードは、「セグメント」と呼ばれる命令の順序付きリストを介してパケットをステアリングします。 セグメントは、トポロジベースまたはサービスベースの任意の命令を表すことができます。 入力ノードは、セグメント識別子（SID）のセットを含むパケットにSRヘッダーを付加します。 各SIDは、トポロジーまたはサービスベースの命令を表します。 フローごとの状態は、SRドメインの入力ノードでのみ維持されます。 「SRドメイン」は、グローバルSID割り当ての単一の管理ドメインとして定義されます。"
    },
    {
      "indent": 3,
      "text": "This document defines an optional, transitive BGP attribute for announcing information about BGP Prefix Segment Identifiers (BGP Prefix-SIDs) and the specification for SR-MPLS SIDs.",
      "ja": "このドキュメントでは、BGPプレフィックスセグメント識別子（BGPプレフィックスSID）とSR-MPLS SIDの仕様に関する情報を通知するためのオプションの推移的BGP属性を定義しています。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This is an Internet Standards Track document.",
      "ja": "これはインターネット標準化過程の文書です。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Further information on Internet Standards is available in Section 2 of RFC 7841.",
      "ja": "このドキュメントは、Internet Engineering Task Force（IETF）の製品です。 IETFコミュニティのコンセンサスを表しています。 これは公開レビューを受けており、Internet Engineering Steering Group（IESG）による公開が承認されています。 インターネット標準の詳細については、RFC 7841のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at https://www.rfc-editor.org/info/rfc8669.",
      "ja": "このドキュメントの現在のステータス、エラータ、およびフィードバックに関する情報は、https：//www.rfc-editor.org/info/rfc8669で入手できます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2019 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "Copyright（c）2019 IETF Trustおよび文書の著者として特定された人物。 全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "このドキュメントは、このドキュメントの公開日に有効なBCP 78およびIETFトラストのIETFドキュメントに関連する法的条項（https://trustee.ietf.org/license-info）の対象となります。 これらのドキュメントは、このドキュメントに関するあなたの権利と制限を説明しているので、注意深く確認してください。 このドキュメントから抽出されたコードコンポーネントには、Trust Legal Provisionsのセクション4.eに記載されているSimplified BSD Licenseテキストを含める必要があり、Simplified BSD Licenseに記載されている保証なしで提供されます。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1. Introduction 2. MPLS BGP Prefix-SID 3. BGP Prefix-SID Attribute 3.1. Label-Index TLV 3.2. Originator SRGB TLV 4. Receiving BGP Prefix-SID Attribute 4.1. MPLS Data Plane: Labeled Unicast 5. Advertising BGP Prefix-SID Attribute 5.1. MPLS Data Plane: Labeled Unicast 6. Error Handling of BGP Prefix-SID Attribute 7. IANA Considerations 8. Manageability Considerations 9. Security Considerations 10. References 10.1. Normative References 10.2. Informative References Acknowledgements Contributors Authors' Addresses",
      "ja": "1. はじめに2. MPLS BGPプレフィックスSID 3. BGPプレフィックスSID属性3.1。 ラベルインデックスTLV 3.2。 発信元SRGB TLV 4. BGPプレフィックスSID属性の受信4.1。 MPLSデータプレーン：ラベル付きユニキャスト5. BGPプレフィックス-SID属性のアドバタイジング5.1。 MPLSデータプレーン：ラベル付きユニキャスト6. BGPプレフィックスSID属性のエラー処理7. IANAに関する考慮事項8.管理性に関する考慮事項9.セキュリティに関する考慮事項10.参考文献10.1 規範的参考文献10.2。 有益な参考文献謝辞投稿者著者のアドレス"
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1. はじめに"
    },
    {
      "indent": 3,
      "text": "The Segment Routing (SR) architecture leverages the source-routing paradigm. A segment represents either a topological instruction, such as \"go to prefix P following shortest path\", or a service instruction. Other types of segments may be defined in the future.",
      "ja": "セグメントルーティング（SR）アーキテクチャは、ソースルーティングパラダイムを活用します。 セグメントは、「最短パスの後にプレフィックスPに移動する」などのトポロジー命令、またはサービス命令を表します。 将来、他のタイプのセグメントが定義される可能性があります。"
    },
    {
      "indent": 3,
      "text": "A segment is identified through a Segment Identifier (SID). An \"SR domain\" is defined as a single administrative domain for global SID assignment. It may be comprised of a single Autonomous System (AS) or multiple ASes under consolidated global SID administration. Typically, the ingress node of the SR domain prepends an SR header containing SIDs to an incoming packet.",
      "ja": "セグメントは、セグメントID（SID）によって識別されます。 「SRドメイン」は、グローバルSID割り当ての単一の管理ドメインとして定義されます。 単一の自律システム（AS）または統合されたグローバルSID管理下の複数のASで構成される場合があります。 通常、SRドメインの入力ノードは、着信パケットにSIDを含むSRヘッダーを付加します。"
    },
    {
      "indent": 3,
      "text": "As described in [RFC8402], when SR is applied to the MPLS data plane ([RFC8660]), the SID consists of a label.",
      "ja": "[RFC8402]で説明されているように、SRがMPLSデータプレーン（[RFC8660]）に適用される場合、SIDはラベルで構成されます。"
    },
    {
      "indent": 3,
      "text": "[RFC8402] also describes how Segment Routing can be applied to an IPv6 data plane (SRv6) using an IPv6 routing header containing a stack of SR SIDs encoded as IPv6 addresses [IPv6-SRH]. The applicability and support for Segment Routing over IPv6 is beyond the scope of this document.",
      "ja": "[RFC8402]は、IPv6アドレス[IPv6-SRH]としてエンコードされたSR SIDのスタックを含むIPv6ルーティングヘッダーを使用して、セグメントルーティングをIPv6データプレーン（SRv6）に適用する方法も説明しています。 IPv6を介したセグメントルーティングの適用性とサポートは、このドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "A BGP Prefix Segment is a BGP prefix with a Prefix-SID attached. A BGP Prefix-SID is always a global SID ([RFC8402]) within the SR domain and identifies an instruction to forward the packet over the Equal-Cost Multipath (ECMP) best path computed by BGP to the related prefix. The BGP Prefix-SID is the identifier of the BGP Prefix Segment. In this document, we always refer to the BGP Prefix Segment by the BGP Prefix-SID.",
      "ja": "BGPプレフィックスセグメントは、プレフィックスSIDが付加されたBGPプレフィックスです。 BGPプレフィックスSIDは常にSRドメイン内のグローバルSID（[RFC8402]）であり、BGPによって計算されたEqual-Cost Multipath（ECMP）最適パスを介して関連プレフィックスにパケットを転送する命令を識別します。 BGPプレフィックスSIDは、BGPプレフィックスセグメントの識別子です。 このドキュメントでは、BGP Prefix-SIDによって常にBGP Prefix Segmentを参照します。"
    },
    {
      "indent": 3,
      "text": "This document describes the BGP extensions to signal the BGP Prefix-SID. Specifically, this document defines a BGP attribute known as the \"BGP Prefix-SID attribute\" and specifies the rules to originate, receive, and handle error conditions for the attribute.",
      "ja": "このドキュメントでは、BGP Prefix-SIDを通知するためのBGP拡張機能について説明します。 具体的には、このドキュメントでは、「BGP Prefix-SID属性」と呼ばれるBGP属性を定義し、属性のエラー条件を生成、受信、および処理するルールを指定します。"
    },
    {
      "indent": 3,
      "text": "The BGP Prefix-SID attribute defined in this document can be attached to prefixes from Multiprotocol BGP IPv4/IPv6 Labeled Unicast ([RFC4760] [RFC8277]). Usage of the BGP Prefix-SID attribute for other Address Family Identifier (AFI) / Subsequent Address Family Identifier (SAFI) combinations is not defined herein but may be specified in future specifications.",
      "ja": "このドキュメントで定義されたBGPプレフィックスSID属性は、マルチプロトコルBGP IPv4 / IPv6ラベル付きユニキャスト（[RFC4760] [RFC8277]）からのプレフィックスに添付できます。 他のアドレスファミリ識別子（AFI）/後続アドレスファミリ識別子（SAFI）の組み合わせに対するBGPプレフィックス-SID属性の使用法はここでは定義されていませんが、将来の仕様で指定される可能性があります。"
    },
    {
      "indent": 3,
      "text": "[RFC8670] describes example use cases where the BGP Prefix-SID is used for the above AFI/SAFI combinations.",
      "ja": "[RFC8670]は、BGP Prefix-SIDが上記のAFI / SAFIの組み合わせに使用される使用例について説明しています。"
    },
    {
      "indent": 3,
      "text": "It should be noted that:",
      "ja": "注意すべきこと："
    },
    {
      "indent": 3,
      "text": "* A BGP Prefix-SID will be global across ASes when the interconnected ASes are part of the same SR domain. Alternatively, when interconnecting ASes, the ASBRs of each domain will have to handle the advertisement of unique SIDs. The mechanisms for such interconnection are outside the scope of the protocol extensions defined in this document.",
      "ja": "* 相互接続されたASが同じSRドメインの一部である場合、BGPプレフィックスSIDはAS全体でグローバルになります。 または、ASを相互接続する場合、各ドメインのASBRは一意のSIDのアドバタイズメントを処理する必要があります。 このような相互接続のメカニズムは、このドキュメントで定義されているプロトコル拡張の範囲外です。"
    },
    {
      "indent": 3,
      "text": "* A BGP Prefix-SID MAY be attached to a BGP prefix. This implies that each prefix is advertised individually, reducing the ability to pack BGP advertisements (when sharing common attributes).",
      "ja": "* BGPプレフィックス-SIDは、BGPプレフィックスに添付される場合があります。 これは、各プレフィックスが個別にアドバタイズされることを意味し、BGPアドバタイズメントをパックする機能が低下します（共通属性を共有する場合）。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"NOT RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all capitals, as shown here.",
      "ja": "この文書のキーワード \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", および \"OPTIONAL\" はBCP 14 [RFC2119] [RFC8174]で説明されているように、すべて大文字の場合にのみ解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. MPLS BGP Prefix-SID",
      "section_title": true,
      "ja": "2. MPLS BGPプレフィックスSID"
    },
    {
      "indent": 3,
      "text": "The BGP Prefix-SID is realized on the MPLS data plane ([RFC8660]) in the following way:",
      "ja": "BGP Prefix-SIDは、次の方法でMPLSデータプレーン（[RFC8660]）で実現されます。"
    },
    {
      "indent": 6,
      "text": "The operator assigns a globally unique label index, L_I, to a locally originated prefix of a BGP speaker N, which is advertised to all other BGP speakers in the SR domain.",
      "ja": "オペレータは、グローバルに一意のラベルインデックスL_Iを、BGPスピーカーNのローカル発信プレフィックスに割り当てます。これは、SRドメイン内の他のすべてのBGPスピーカーにアドバタイズされます。"
    },
    {
      "indent": 6,
      "text": "According to [RFC8402], each BGP speaker is configured with a label block called the Segment Routing Global Block (SRGB). While [RFC8402] recommends using the same SRGB across all the nodes within the SR domain, the SRGB of a node is a local property and could be different on different speakers. The drawbacks of the use case where BGP speakers have different SRGBs are documented in [RFC8402] and [RFC8670].",
      "ja": "[RFC8402]によると、各BGPスピーカーは、セグメントルーティンググローバルブロック（SRGB）と呼ばれるラベルブロックで構成されます。 [RFC8402]はSRドメイン内のすべてのノードで同じSRGBを使用することを推奨していますが、ノードのSRGBはローカルプロパティであり、スピーカーによって異なる場合があります。 BGPスピーカーのSRGBが異なるユースケースの欠点は、[RFC8402]および[RFC8670]で文書化されています。"
    },
    {
      "indent": 6,
      "text": "If traffic engineering within the SR domain is required, each node may also be required to advertise topological information and Peer SIDs for each of its links and peers. This information is required to perform the explicit path computation and to express an explicit path as a list of SIDs. The advertisement of topological information and peer segments (Peer SIDs) is done through [BGPLS-SR-EPE].",
      "ja": "SRドメイン内のトラフィックエンジニアリングが必要な場合、各ノードは、各リンクおよびピアのトポロジ情報とピアSIDをアドバタイズする必要があります。 この情報は、明示的なパス計算を実行し、明示的なパスをSIDのリストとして表現するために必要です。 トポロジ情報とピアセグメント（ピアSID）の広告は、[BGPLS-SR-EPE]を介して行われます。"
    },
    {
      "indent": 6,
      "text": "If a prefix segment is to be included in an MPLS label stack, e.g., for traffic-engineering purposes, knowledge of the prefix originator's SRGB is required in order to compute the local label used by the originator.",
      "ja": "プレフィックスセグメントをMPLSラベルスタックに含める場合、たとえば、トラフィックエンジニアリングの目的で、発信者が使用するローカルラベルを計算するには、プレフィックス発信者のSRGBの知識が必要です。"
    },
    {
      "indent": 6,
      "text": "This document assumes that Border Gateway Protocol - Link State (BGP-LS) is the preferred method for a collecting both peer segments (Peer SIDs) and SRGB information through [RFC7752], [BGPLS-SR-EPE], and [BGPLS-SR-EXT]. However, as an optional alternative for the advertisement of the local SRGB without the topology or the peer SIDs and, therefore, without applicability for TE, the Originator SRGB TLV of the BGP Prefix-SID attribute is specified in Section 3.2 of this document.",
      "ja": "このドキュメントでは、[RFC7752]、[BGPLS-SR-EPE]、および[BGPLS-SR]を介して、ピアセグメント（ピアSID）とSRGB情報の両方を収集するために、ボーダーゲートウェイプロトコル-リンク状態（BGP-LS）が推奨される方法であると想定しています -EXT]。 ただし、トポロジまたはピアSIDのないローカルSRGBのアドバタイズメントのオプションの代替として、したがって、TEの適用性なしで、BGP Prefix-SID属性のオリジネーターSRGB TLVはこのドキュメントのセクション3.2で指定されます。"
    },
    {
      "indent": 6,
      "text": "A BGP speaker will derive its local MPLS label L from the label index L_I and its local SRGB as described in [RFC8660]. The BGP speaker then programs the MPLS label L in its MPLS data plane as its incoming/local label for the prefix. See Section 4.1 for more details.",
      "ja": "BGPスピーカーは、[RFC8660]で説明されているように、ラベルインデックスL_IとローカルSRGBからローカルMPLSラベルLを取得します。 次に、BGPスピーカーは、MPLSデータプレーンのMPLSラベルLをプレフィックスの着信/ローカルラベルとしてプログラムします。 詳細については、セクション4.1を参照してください。"
    },
    {
      "indent": 6,
      "text": "The outgoing label for the prefix is found in the Network Layer Reachability Information (NLRI) of the Multiprotocol BGP IPv4/IPv6 Labeled Unicast prefix advertisement as defined in [RFC8277]. The label index L_I is only used as a hint to derive the local/ incoming label.",
      "ja": "プレフィックスの発信ラベルは、[RFC8277]で定義されているマルチプロトコルBGP IPv4 / IPv6ラベル付きユニキャストプレフィックスアドバタイズメントのネットワーク層到達可能性情報（NLRI）にあります。 ラベルインデックスL_Iは、ローカル/着信ラベルを導出するためのヒントとしてのみ使用されます。"
    },
    {
      "indent": 6,
      "text": "Section 3.1 of this document specifies the Label-Index TLV of the BGP Prefix-SID attribute; this TLV can be used to advertise the label index for a given prefix.",
      "ja": "このドキュメントのセクション3.1は、BGPプレフィックスSID属性のラベルインデックスTLVを指定します。 このTLVは、特定のプレフィックスのラベルインデックスをアドバタイズするために使用できます。"
    },
    {
      "indent": 0,
      "text": "3. BGP Prefix-SID Attribute",
      "section_title": true,
      "ja": "3. BGPプレフィックス-SID属性"
    },
    {
      "indent": 3,
      "text": "The BGP Prefix-SID attribute is an optional, transitive BGP path attribute. The attribute type code 40 has been assigned by IANA (see Section 7).",
      "ja": "BGP Prefix-SID属性は、オプションの推移的なBGPパス属性です。 属性タイプコード40は、IANAによって割り当てられています（セクション7を参照）。"
    },
    {
      "indent": 3,
      "text": "The BGP Prefix-SID attribute is defined here to be a set of elements encoded as \"Type/Length/Value\" tuples (i.e., a set of TLVs). All BGP Prefix-SID attribute TLVs will start with a 1-octet type and a 2-octet length. The following TLVs are defined in this document:",
      "ja": "ここでは、BGP Prefix-SID属性は、「タイプ/長さ/値」タプル（つまり、TLVのセット）としてエンコードされた要素のセットであると定義されています。 すべてのBGPプレフィックスSID属性TLVは、1オクテットタイプと2オクテット長で始まります。 このドキュメントでは、次のTLVが定義されています。"
    },
    {
      "indent": 3,
      "text": "* Label-Index TLV",
      "ja": "* ラベルインデックスTLV"
    },
    {
      "indent": 3,
      "text": "* Originator SRGB TLV",
      "ja": "* 発信元SRGB TLV"
    },
    {
      "indent": 3,
      "text": "The Label-Index and Originator SRGB TLVs are used only when SR is applied to the MPLS data plane.",
      "ja": "Label-IndexおよびOriginator SRGB TLVは、SRがMPLSデータプレーンに適用される場合にのみ使用されます。"
    },
    {
      "indent": 3,
      "text": "For future extensibility, unknown TLVs MUST be ignored and propagated unmodified.",
      "ja": "将来の拡張性のために、未知のTLVは無視され、変更されずに伝播されなければなりません。"
    },
    {
      "indent": 0,
      "text": "3.1. Label-Index TLV",
      "section_title": true,
      "ja": "3.1. ラベルインデックスTLV"
    },
    {
      "indent": 3,
      "text": "The Label-Index TLV MUST be present in the BGP Prefix-SID attribute attached to IPv4/IPv6 Labeled Unicast prefixes ([RFC8277]). It MUST be ignored when received for other BGP AFI/SAFI combinations. The Label-Index TLV has the following format:",
      "ja": "ラベルインデックスTLVは、IPv4 / IPv6ラベル付きユニキャストプレフィックス（[RFC8277]）に付加されたBGPプレフィックスSID属性に存在する必要があります。 他のBGP AFI / SAFIの組み合わせで受信した場合、無視する必要があります。 Label-Index TLVの形式は次のとおりです。"
    },
    {
      "indent": 3,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|       Type    |             Length            |   RESERVED    |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|            Flags              |       Label Index             |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Label Index          |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "where:",
      "ja": "どこ："
    },
    {
      "indent": 6,
      "text": "Type: 1",
      "ja": "タイプ：1"
    },
    {
      "indent": 6,
      "text": "Length: 7, the total length in octets of the value portion of the TLV.",
      "ja": "長さ：7、TLVの値部分のオクテット単位の全長。"
    },
    {
      "indent": 6,
      "text": "RESERVED: 8-bit field. It MUST be clear on transmission and MUST be ignored on reception.",
      "ja": "予約済み：8ビットフィールド。 それは送信時に明確でなければならず、受信時には無視されなければなりません。"
    },
    {
      "indent": 6,
      "text": "Flags: 16 bits of flags. None are defined by this document. The Flags field MUST be clear on transmission and MUST be ignored on reception.",
      "ja": "フラグ：16ビットのフラグ。 このドキュメントでは何も定義されていません。 Flagsフィールドは送信時にクリアしなければならず、受信時には無視しなければなりません。"
    },
    {
      "indent": 6,
      "text": "Label Index: 32-bit value representing the index value in the SRGB space.",
      "ja": "ラベルインデックス：SRGB空間のインデックス値を表す32ビット値。"
    },
    {
      "indent": 0,
      "text": "3.2. Originator SRGB TLV",
      "section_title": true,
      "ja": "3.2. 発信元SRGB TLV"
    },
    {
      "indent": 3,
      "text": "The Originator SRGB TLV is an optional TLV and has the following format:",
      "ja": "Originator SRGB TLVはオプションのTLVであり、次の形式があります。"
    },
    {
      "indent": 4,
      "text": " 0                   1                   2                   3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Type      |          Length               |    Flags      |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|     Flags     |\n+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 4,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         SRGB 1 (6 octets)                                     |\n|                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 4,
      "text": "+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|         SRGB n (6 octets)                                     |\n|                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|                               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "where:",
      "ja": "どこ："
    },
    {
      "indent": 6,
      "text": "Type: 3",
      "ja": "タイプ：3"
    },
    {
      "indent": 6,
      "text": "Length: The total length in octets of the value portion of the TLV: 2 + (non-zero multiple of 6).",
      "ja": "長さ：TLVの値部分のオクテット単位の全長：2 +（6の非ゼロ倍数）。"
    },
    {
      "indent": 6,
      "text": "Flags: 16 bits of flags. None are defined in this document. The Flags field MUST be clear on transmission and MUST be ignored on reception.",
      "ja": "フラグ：16ビットのフラグ。 このドキュメントでは何も定義されていません。 Flagsフィールドは送信時にクリアしなければならず、受信時には無視しなければなりません。"
    },
    {
      "indent": 6,
      "text": "SRGB: 3 octets specifying the first label in the range followed by 3 octets specifying the number of labels in the range. Note that the SRGB field MAY appear multiple times. If the SRGB field appears multiple times, the SRGB consists of multiple ranges that are concatenated.",
      "ja": "SRGB：範囲内の最初のラベルを指定する3オクテットと、それに続く範囲内のラベルの数を指定する3オクテット。 SRGBフィールドは複数回表示される場合があります。 SRGBフィールドが複数回表示される場合、SRGBは連結された複数の範囲で構成されます。"
    },
    {
      "indent": 3,
      "text": "The Originator SRGB TLV contains the SRGB of the node originating the prefix to which the BGP Prefix-SID is attached. The Originator SRGB TLV MUST NOT be changed during the propagation of the BGP update. It is used to build SR policies when different SRGBs are used in the fabric, for example, [RFC8670].",
      "ja": "発信元SRGB TLVには、BGP Prefix-SIDが付加されているプレフィックスを発信するノードのSRGBが含まれています。 発信者SRGB TLVは、BGPアップデートの伝播中に変更してはなりません。 [RFC8670]のように、ファブリックで異なるSRGBが使用される場合にSRポリシーを構築するために使用されます。"
    },
    {
      "indent": 3,
      "text": "Examples of how the receiving routers concatenate the ranges and build their neighbor's Segment Routing Global Block (SRGB) are included in [RFC8660].",
      "ja": "[RFC8660]には、受信ルーターが範囲を連結し、近隣のセグメントルーティンググローバルブロック（SRGB）を構築する方法の例が含まれています。"
    },
    {
      "indent": 3,
      "text": "The Originator SRGB TLV may only appear in a BGP Prefix-SID attribute attached to IPv4/IPv6 Labeled Unicast prefixes ([RFC8277]). It MUST be ignored when received for other BGP AFI/SAFI combinations. Since the Label-Index TLV is required for IPv4/IPv6 prefix applicability, the Originator SRGB TLV will be ignored if it is not specified in a manner consistent with Section 6.",
      "ja": "発信元SRGB TLVは、IPv4 / IPv6ラベル付きユニキャストプレフィックス（[RFC8277]）に付加されたBGPプレフィックスSID属性にのみ表示されます。 他のBGP AFI / SAFIの組み合わせで受信した場合、無視する必要があります。 Label-Index TLVはIPv4 / IPv6プレフィックスの適用可能性に必要であるため、セクション6と一貫した方法で指定されていない場合、Originator SRGB TLVは無視されます。"
    },
    {
      "indent": 3,
      "text": "If a BGP speaker receives a node's SRGB as an attribute of the BGP-LS Node NLRI and the BGP speaker also receives the same node's SRGB in a BGP Prefix-SID attribute, then the received values should be the same. If the values are different, the values advertised in the BGP-LS NLRI SHOULD be preferred, and an error should be logged.",
      "ja": "BGPスピーカーがBGP-LSノードNLRIの属性としてノードのSRGBを受信し、BGPスピーカーがBGPプレフィックスSID属性で同じノードのSRGBも受信する場合、受信値は同じである必要があります。 値が異なる場合は、BGP-LS NLRIでアドバタイズされた値が優先される必要があり、エラーをログに記録する必要があります。"
    },
    {
      "indent": 0,
      "text": "4. Receiving BGP Prefix-SID Attribute",
      "section_title": true,
      "ja": "4. BGPプレフィックスSID属性の受信"
    },
    {
      "indent": 3,
      "text": "A BGP speaker receiving a BGP Prefix-SID attribute from an External BGP (EBGP) neighbor residing outside the boundaries of the SR domain MUST discard the attribute unless it is configured to accept the attribute from the EBGP neighbor. A BGP speaker SHOULD log an error for further analysis when discarding an attribute.",
      "ja": "SRドメインの境界外にある外部BGP（EBGP）ネイバーからBGP Prefix-SID属性を受信するBGPスピーカーは、EBGPネイバーから属性を受け入れるように設定されていない限り、属性を破棄しなければなりません。 属性を破棄する場合、BGPスピーカーは、さらなる分析のためにエラーを記録する必要があります。"
    },
    {
      "indent": 0,
      "text": "4.1. MPLS Data Plane: Labeled Unicast",
      "section_title": true,
      "ja": "4.1. MPLSデータプレーン：ラベル付きユニキャスト"
    },
    {
      "indent": 3,
      "text": "A BGP session supporting the Multiprotocol BGP Labeled IPv4 or IPv6 Unicast ([RFC8277]) AFI/SAFI is required.",
      "ja": "マルチプロトコルBGPラベル付きIPv4またはIPv6ユニキャスト（[RFC8277]）AFI / SAFIをサポートするBGPセッションが必要です。"
    },
    {
      "indent": 3,
      "text": "When the BGP Prefix-SID attribute is attached to a BGP Labeled IPv4 or IPv6 Unicast [RFC8277] AFI/SAFI, it MUST contain the Label-Index TLV and MAY contain the Originator SRGB TLV. A BGP Prefix-SID attribute received without a Label-Index TLV MUST be considered to be \"invalid\" by the receiving speaker.",
      "ja": "BGP Prefix-SID属性がBGPラベル付きIPv4またはIPv6ユニキャスト[RFC8277] AFI / SAFIに接続されている場合、Label-Index TLVを含む必要があり、Originator SRGB TLVを含む場合があります。 Label-Index TLVなしで受信されたBGP Prefix-SID属性は、受信スピーカーによって「無効」であると見なされなければなりません。"
    },
    {
      "indent": 3,
      "text": "The label index provides guidance to the receiving BGP speaker as to the incoming label that SHOULD be allocated to the prefix.",
      "ja": "ラベルインデックスは、プレフィックスに割り当てる必要がある着信ラベルに関する受信側BGPスピーカーへのガイダンスを提供します。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker may be locally configured with an SRGB=[SRGB_Start, SRGB_End]. The preferred method for deriving the SRGB is a matter of local node configuration.",
      "ja": "BGPスピーカーは、SRGB = [SRGB_Start、SRGB_End]でローカルに構成できます。 SRGBを導出するための好ましい方法は、ローカルノードの構成の問題です。"
    },
    {
      "indent": 3,
      "text": "The mechanisms through which a given label-index value is assigned to a given prefix are outside the scope of this document.",
      "ja": "特定のラベルインデックス値が特定のプレフィックスに割り当てられるメカニズムは、このドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "Given a label index L_I, we refer to (L = L_I + SRGB_Start) as the derived label. A BGP Prefix-SID attribute is designated \"conflicting\" for a speaker M if the derived label value L lies outside the SRGB configured on M. Otherwise, the Label-Index TLV is designated \"acceptable\" to speaker M.",
      "ja": "ラベルインデックスL_Iが与えられた場合、派生ラベルとして（L = L_I + SRGB_Start）を参照します。 BGPプレフィックスSID属性は、派生ラベル値LがMに設定されたSRGBの外側にある場合、スピーカーMに対して「競合する」と指定されます。"
    },
    {
      "indent": 3,
      "text": "If multiple different prefixes are received with the same label index, all of the different prefixes MUST have their BGP Prefix-SID attribute considered to be \"conflicting\".",
      "ja": "同じラベルインデックスで複数の異なるプレフィックスを受信した場合、すべての異なるプレフィックスのBGP Prefix-SID属性が「競合」していると見なされる必要があります。"
    },
    {
      "indent": 3,
      "text": "If multiple valid paths for the same prefix are received from multiple BGP speakers or, in the case of [RFC7911], from the same BGP speaker, and the BGP Prefix-SID attributes do not contain the same label index, then the label index from the best path BGP Prefix-SID attribute SHOULD be chosen with a notable exception being when [RFC5004] is being used to dampen route changes.",
      "ja": "複数のBGPスピーカー、または[RFC7911]の場合、同じBGPスピーカーから同じプレフィックスの複数の有効なパスを受信し、BGP Prefix-SID属性に同じラベルインデックスが含まれていない場合、 [RFC5004]がルート変更を減衰するために使用されている場合を除いて、BGP Prefix-SIDの最適パス属性を選択する必要があります。"
    },
    {
      "indent": 3,
      "text": "When a BGP speaker receives a path from a neighbor with an \"acceptable\" BGP Prefix-SID attribute and that path is selected as the best path, it SHOULD program the derived label as the label for the prefix in its local MPLS data plane.",
      "ja": "BGPスピーカーが「受け入れ可能な」BGPプレフィックスSID属性を持つネイバーからパスを受信し、そのパスが最適なパスとして選択されると、ローカルMPLSデータプレーンのプレフィックスのラベルとして派生ラベルをプログラムする必要があります。"
    },
    {
      "indent": 3,
      "text": "When a BGP speaker receives a path from a neighbor with an \"invalid\" or \"conflicting\" BGP Prefix-SID attribute, or when a BGP speaker receives a path from a neighbor with a BGP Prefix-SID attribute but is unable to process it (e.g., local policy disables the functionality), it MUST ignore the BGP Prefix-SID attribute. For the purposes of label allocation, a BGP speaker MUST assign a local (also called dynamic) label (non-SRGB) for such a prefix as per classic Multiprotocol BGP IPv4/IPv6 Labeled Unicast ([RFC8277]) operation.",
      "ja": "BGPスピーカーが「無効な」または「競合する」BGPプレフィックスSID属性を持つネイバーからパスを受信した場合、またはBGPスピーカーがBGPプレフィックスSID属性を持つネイバーからパスを受信したが処理できない場合（ たとえば、ローカルポリシーが機能を無効にする場合）、BGP Prefix-SID属性を無視する必要があります。 ラベル割り当ての目的で、BGPスピーカーは、従来のマルチプロトコルBGP IPv4 / IPv6ラベル付きユニキャスト（[RFC8277]）操作に従って、そのようなプレフィックスにローカル（動的とも呼ばれる）ラベル（非SRGB）を割り当てなければなりません。"
    },
    {
      "indent": 3,
      "text": "In the case of an \"invalid\" BGP Prefix-SID attribute, a BGP speaker MUST follow the error-handling rules specified in Section 6. A BGP speaker SHOULD log an error for further analysis. In the case of a \"conflicting\" BGP Prefix-SID attribute, a BGP speaker SHOULD NOT treat it as an error and SHOULD propagate the attribute unchanged. A BGP speaker SHOULD log a warning for further analysis, i.e., in the case the conflict is not due to a label-index transition.",
      "ja": "「無効な」BGP Prefix-SID属性の場合、BGPスピーカーはセクション6で指定されたエラー処理規則に従う必要があります。BGPスピーカーは、さらなる分析のためにエラーを記録する必要があります。 「矛盾する」BGP Prefix-SID属性の場合、BGPスピーカーはそれをエラーとして扱わないでください（SHOULD NOT）。 BGPスピーカーは、さらなる分析のために警告をログに記録する必要があります（競合がラベルインデックスの遷移によるものではない場合）。"
    },
    {
      "indent": 3,
      "text": "When a BGP Prefix-SID attribute changes and transitions from \"conflicting\" to \"acceptable\", the BGP Prefix-SID attributes for other prefixes may also transition to \"acceptable\" as well. Implementations SHOULD ensure all impacted prefixes revert to using the label indices corresponding to these newly \"acceptable\" BGP Prefix-SID attributes.",
      "ja": "BGP Prefix-SID属性が変更され、「競合」から「許容可能」に移行すると、他のプレフィックスのBGP Prefix-SID属性も「許容可能」に移行する場合があります。 実装は、影響を受けるすべてのプレフィックスが、これらの新しく「受け入れられる」BGPプレフィックスSID属性に対応するラベルインデックスの使用に戻ることを保証する必要があります。"
    },
    {
      "indent": 3,
      "text": "The outgoing label is always programmed as per classic Multiprotocol BGP IPv4/IPv6 Labeled Unicast ([RFC8277]) operation. Specifically, a BGP speaker receiving a prefix with a BGP Prefix-SID attribute and a label NLRI field of Implicit NULL [RFC3032] from a neighbor MUST adhere to standard behavior and program its MPLS data plane to pop the top label when forwarding traffic to the prefix. The label NLRI defines the outbound label that MUST be used by the receiving node.",
      "ja": "発信ラベルは常に、従来のマルチプロトコルBGP IPv4 / IPv6ラベル付きユニキャスト（[RFC8277]）操作に従ってプログラムされます。 具体的には、BGP Prefix-SID属性を持つプレフィックスとImplicit NULL [RFC3032]のラベルNLRIフィールドをネイバーから受信するBGPスピーカーは、標準動作に準拠し、MPLSデータプレーンをプログラムして、トラフィックを転送するときにトップラベルをポップしなければなりません プレフィックス。 ラベルNLRIは、受信ノードが使用しなければならないアウトバウンドラベルを定義します。"
    },
    {
      "indent": 0,
      "text": "5. Advertising BGP Prefix-SID Attribute",
      "section_title": true,
      "ja": "5. BGPプレフィックスSID属性のアドバタイジング"
    },
    {
      "indent": 3,
      "text": "The BGP Prefix-SID attribute MAY be attached to BGP IPv4/IPv6 Labeled Unicast prefixes [RFC8277]. In order to prevent distribution of the BGP Prefix-SID attribute beyond its intended scope of applicability, attribute filtering SHOULD be deployed to remove the BGP Prefix-SID attribute at the administrative boundary of the SR domain.",
      "ja": "BGP Prefix-SID属性は、BGP IPv4 / IPv6ラベル付きユニキャストプレフィックス[RFC8277]に添付することができます。 BGP Prefix-SID属性が意図した適用範囲を超えて配布されるのを防ぐため、属性フィルタリングを展開して、SRドメインの管理境界でBGP Prefix-SID属性を削除する必要があります。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker that advertises a path received from one of its neighbors SHOULD advertise the BGP Prefix-SID received with the path without modification as long as the BGP Prefix-SID was acceptable. If the path did not come with a BGP Prefix-SID attribute, the speaker MAY attach a BGP Prefix-SID to the path if configured to do so. The content of the TLVs present in the BGP Prefix-SID is determined by the configuration.",
      "ja": "ネイバーの1つから受信したパスをアドバタイズするBGPスピーカーは、BGPプレフィックスSIDが受け入れ可能である限り、パスとともに受信したBGPプレフィックスSIDを変更せずにアドバタイズする必要があります。 パスにBGP Prefix-SID属性が付いていない場合、スピーカーは、BGP Prefix-SIDをパスに付加することができます（そのように構成されている場合）。 BGP Prefix-SIDに存在するTLVの内容は、構成によって決まります。"
    },
    {
      "indent": 0,
      "text": "5.1. MPLS Data Plane: Labeled Unicast",
      "section_title": true,
      "ja": "5.1. MPLSデータプレーン：ラベル付きユニキャスト"
    },
    {
      "indent": 3,
      "text": "A BGP speaker that originates a prefix attaches the BGP Prefix-SID attribute when it advertises the prefix to its neighbors via Multiprotocol BGP IPv4/IPv6 Labeled Unicast ([RFC8277]). The value of the label index in the Label-Index TLV is determined by configuration.",
      "ja": "プレフィックスを発信するBGPスピーカーは、マルチプロトコルBGP IPv4 / IPv6ラベル付きユニキャスト（[RFC8277]）を介して近隣にプレフィックスをアドバタイズするときに、BGP Prefix-SID属性を付加します。 Label-Index TLVのラベルインデックスの値は、設定によって決まります。"
    },
    {
      "indent": 3,
      "text": "A BGP speaker that originates a BGP Prefix-SID attribute MAY optionally announce the Originator SRGB TLV along with the mandatory Label-Index TLV. The content of the Originator SRGB TLV is determined by configuration.",
      "ja": "BGPプレフィックスSID属性を発信するBGPスピーカーは、オプションで、必須のラベルインデックスTLVとともに発信者SRGB TLVをアナウンスすることができます。 Originator SRGB TLVの内容は、構成によって決まります。"
    },
    {
      "indent": 3,
      "text": "Since the label-index value must be unique within an SR domain, by default an implementation SHOULD NOT advertise the BGP Prefix-SID attribute outside an AS unless it is explicitly configured to do so.",
      "ja": "ラベルインデックス値はSRドメイン内で一意である必要があるため、デフォルトでは、明示的に設定されていない限り、実装はASの外部でBGP Prefix-SID属性をアドバタイズするべきではありません。"
    },
    {
      "indent": 3,
      "text": "In all cases, the Label field of the advertised NLRI ([RFC8277] [RFC4364]) MUST be set to the local/incoming label programmed in the MPLS data plane for the given advertised prefix. If the prefix is associated with one of the BGP speaker's interfaces, this is the usual MPLS label (such as the Implicit or Explicit NULL label [RFC3032]).",
      "ja": "すべての場合において、アドバタイズされたNLRI（[RFC8277] [RFC4364]）のラベルフィールドは、指定されたアドバタイズされたプレフィックスのMPLSデータプレーンでプログラムされたローカル/着信ラベルに設定されなければなりません。 プレフィックスがBGPスピーカーのインターフェイスの1つに関連付けられている場合、これは通常のMPLSラベル（ImplicitまたはExplicit NULLラベル[RFC3032]など）です。"
    },
    {
      "indent": 0,
      "text": "6. Error Handling of BGP Prefix-SID Attribute",
      "section_title": true,
      "ja": "6. BGPプレフィックスSID属性のエラー処理"
    },
    {
      "indent": 3,
      "text": "When a BGP speaker receives a BGP UPDATE message containing a malformed or invalid BGP Prefix-SID attribute attached to an IPv4/ IPv6 Labeled Unicast prefix ([RFC8277]), it MUST ignore the received BGP Prefix-SID attribute and not advertise it to other BGP peers. In this context, a malformed BGP Prefix-SID attribute is one that cannot be parsed due to not meeting the minimum attribute length requirement, containing a TLV length that doesn't conform to the length constraints for the TLV, or containing a TLV length that would extend beyond the end of the attribute (as defined by the attribute length). This is equivalent to the \"Attribute discard\" action specified in [RFC7606]. When discarding an attribute, a BGP speaker SHOULD log an error for further analysis.",
      "ja": "BGPスピーカーが、IPv4 / IPv6ラベル付きユニキャストプレフィックス（[RFC8277]）に付加された不正または無効なBGPプレフィックスSID属性を含むBGP UPDATEメッセージを受信した場合、受信したBGPプレフィックスSID属性を無視し、他にアドバタイズしない BGPピア。 このコンテキストでは、不正な形式のBGP Prefix-SID属性は、最小属性長の要件を満たさないために解析できない属性であり、TLVの長さの制約に適合しないTLV長を含むか、TLV長を含む （属性の長さで定義されているように）属性の終わりを超えて拡張されます。 これは、[RFC7606]で指定された「属性破棄」アクションと同等です。 属性を破棄する場合、BGPスピーカーは、さらなる分析のためにエラーを記録する必要があります。"
    },
    {
      "indent": 3,
      "text": "As per [RFC7606], if the BGP Prefix-SID attribute appears more than once in an UPDATE message, all the occurrences of the attribute other than the first one SHALL be discarded and the UPDATE message will continue to be processed. Similarly, if a recognized TLV appears more than once in a BGP Prefix-SID attribute while the specification only allows for a single occurrence, then all the occurrences of the TLV other than the first one SHALL be discarded and the Prefix-SID attribute will continue to be processed.",
      "ja": "[RFC7606]に従って、BGP Prefix-SID属性がUPDATEメッセージに複数回出現する場合、最初の属性以外の属性の出現はすべて破棄され（SHALL）、UPDATEメッセージの処理が続行されます。 同様に、認識されたTLVがBGP Prefix-SID属性に2回以上出現し、仕様では1回しか出現できない場合、最初のTLV以外のTLVの出現はすべて破棄され、Prefix-SID属性が継続します 処理されます。"
    },
    {
      "indent": 3,
      "text": "For future extensibility, unknown TLVs MUST be ignored and propagated unmodified.",
      "ja": "将来の拡張性のために、未知のTLVは無視され、変更されずに伝播されなければなりません。"
    },
    {
      "indent": 0,
      "text": "7. IANA Considerations",
      "section_title": true,
      "ja": "7. IANAの考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines a BGP path attribute known as the BGP Prefix-SID attribute. IANA has assigned attribute code type 40 to the BGP Prefix-SID attribute from the \"BGP Path Attributes\" registry.",
      "ja": "このドキュメントでは、BGP Prefix-SID属性と呼ばれるBGPパス属性を定義しています。 IANAは、属性コードタイプ40を「BGP Path Attributes」レジストリからのBGP Prefix-SID属性に割り当てています。"
    },
    {
      "indent": 3,
      "text": "This document defines two TLVs for the BGP Prefix-SID attribute. These TLVs have been registered with IANA. IANA has created a registry for BGP Prefix-SID Attribute TLVs as follows:",
      "ja": "このドキュメントでは、BGP Prefix-SID属性の2つのTLVを定義しています。 これらのTLVはIANAに登録されています。 IANAは、次のようにBGPプレフィックスSID属性TLVのレジストリを作成しました。"
    },
    {
      "indent": 3,
      "text": "Under the \"Border Gateway Protocol (BGP) Parameters\" registry, the new registry titled \"BGP Prefix-SID TLV Types\" has been created and points to this document as the reference.",
      "ja": "「Border Gateway Protocol（BGP）Parameters」レジストリの下に、「BGP Prefix-SID TLV Types」というタイトルの新しいレジストリが作成され、参照としてこのドキュメントをポイントしています。"
    },
    {
      "indent": 3,
      "text": "Registration Procedure(s):",
      "ja": "登録手順："
    },
    {
      "indent": 6,
      "text": "Values 1-254, Expert Review as defined in [RFC8126] Values 0 and 255, Reserved",
      "ja": "値1〜254、[RFC8126]で定義されているエキスパートレビュー、値0および255、予約済み"
    },
    {
      "indent": 3,
      "text": "+-------+-----------------+---------------+\n| Value | Type            | Reference     |\n+=======+=================+===============+\n| 0     | Reserved        | This document |\n+-------+-----------------+---------------+\n| 1     | Label-Index     | This document |\n+-------+-----------------+---------------+\n| 2     | Deprecated      | This document |\n+-------+-----------------+---------------+\n| 3     | Originator SRGB | This document |\n+-------+-----------------+---------------+\n| 4-254 | Unassigned      |               |\n+-------+-----------------+---------------+\n| 255   | Reserved        | This document |\n+-------+-----------------+---------------+",
      "raw": true
    },
    {
      "indent": 8,
      "text": "Table 1: BGP Prefix-SID TLV Types",
      "ja": "表1：BGPプレフィックス-SID TLVタイプ"
    },
    {
      "indent": 3,
      "text": "The value 2 previously corresponded to the IPv6 SID TLV, which was specified in previous versions of this document. It was removed, and use of the BGP Prefix-SID for Segment Routing over the IPv6 data plane [RFC8402] has been deferred to future specifications.",
      "ja": "値2は、このドキュメントの以前のバージョンで指定されたIPv6 SID TLVに以前対応していました。 これは削除され、IPv6データプレーン[RFC8402]を介したセグメントルーティングのためのBGPプレフィックスSIDの使用は将来の仕様に延期されました。"
    },
    {
      "indent": 3,
      "text": "IANA has also created the \"BGP Prefix-SID Label-Index TLV Flags\" registry under the \"Border Gateway Protocol (BGP) Parameters\" registry, with a reference to this document. Initially, this 16-bit flags registry is empty. The registration policy for flag bits is Expert Review [RFC8126], consistent with the \"BGP Prefix-SID TLV Types\" registry.",
      "ja": "IANAは、このドキュメントを参照して、「Border Gateway Protocol（BGP）Parameters」レジストリの下に「BGP Prefix-SID Label-Index TLV Flags」レジストリも作成しました。 最初は、この16ビットフラグレジストリは空です。 フラグビットの登録ポリシーはエキスパートレビュー[RFC8126]であり、「BGP Prefix-SID TLV Types」レジストリと一致しています。"
    },
    {
      "indent": 3,
      "text": "Finally, IANA has created the \"BGP Prefix-SID Originator SRGB TLV Flags\" registry under the \"Border Gateway Protocol (BGP) Parameters\" registry, with a reference to this document. Initially, this 16-bit flags registry is empty. The registration policy for flag bits is Expert Review [RFC8126] consistent with the BGP Prefix-SID TLV Types registry.",
      "ja": "最後に、IANAはこのドキュメントを参照して、「Border Gateway Protocol（BGP）Parameters」レジストリの下に「BGP Prefix-SID Originator SRGB TLV Flags」レジストリを作成しました。 最初は、この16ビットフラグレジストリは空です。 フラグビットの登録ポリシーは、BGP Prefix-SID TLV Typesレジストリと一致するエキスパートレビュー[RFC8126]です。"
    },
    {
      "indent": 3,
      "text": "The designated experts must be good and faithful stewards of the above registries, ensuring that each request is legitimate and corresponds to a viable use case. Given the limited number of bits in the flags registries and the applicability to a single TLV, additional scrutiny should be afforded to requests for flag-bit allocation. In general, no single use case should require more than one flag bit and, should the use case require more, alternate encodings using new TLVs should be considered.",
      "ja": "指定された専門家は、上記のレジストリの善良で忠実なスチュワードである必要があり、各リクエストが正当であり、実行可能なユースケースに対応していることを確認します。 フラグレジストリのビット数が限られていることと、単一のTLVに適用できることを考えると、フラグビット割り当ての要求に追加の精査を行う必要があります。 一般に、単一のユースケースで複数のフラグビットを必要とするべきではなく、ユースケースでさらに必要な場合は、新しいTLVを使用した代替エンコーディングを検討する必要があります。"
    },
    {
      "indent": 0,
      "text": "8. Manageability Considerations",
      "section_title": true,
      "ja": "8. 管理性に関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document defines a BGP attribute to address use cases such as the one described in [RFC8670]. It is assumed that advertisement of the BGP Prefix-SID attribute is controlled by the operator in order to:",
      "ja": "このドキュメントは、[RFC8670]で説明されるようなユースケースに対処するためにBGP属性を定義します。 BGP Prefix-SID属性のアドバタイズメントは、次の目的でオペレーターによって制御されると想定されます。"
    },
    {
      "indent": 3,
      "text": "* Prevent undesired origination/advertisement of the BGP Prefix-SID attribute. By default, a BGP Prefix-SID attribute SHOULD NOT be attached to a prefix and advertised. Hence, BGP Prefix-SID Advertisement SHOULD require explicit enablement.",
      "ja": "* BGP Prefix-SID属性の望ましくない発信/広告を防ぎます。 デフォルトでは、BGP Prefix-SID属性をプレフィックスに付加してアドバタイズする必要があります。 したがって、BGP Prefix-SID Advertisementには明示的な有効化が必要です。"
    },
    {
      "indent": 3,
      "text": "* Prevent any undesired propagation of the BGP Prefix-SID attribute. By default, the BGP Prefix-SID is not advertised outside the boundary of a single SR/administrative domain that may include one or more ASes. The propagation to other ASes MUST be explicitly configured.",
      "ja": "* BGP Prefix-SID属性の望ましくない伝播を防止します。 デフォルトでは、BGP Prefix-SIDは、1つ以上のASを含む単一のSR /管理ドメインの境界外にアドバタイズされません。 他のASへの伝播は明示的に構成する必要があります。"
    },
    {
      "indent": 3,
      "text": "The deployment model described in [RFC8670] assumes multiple ASes under a common administrative domain. For this use case, the BGP Prefix-SID Advertisement is applicable to the inter-AS context, i.e., EBGP, while it is confined to a single administrative domain.",
      "ja": "[RFC8670]で説明されている展開モデルは、共通の管理ドメインで複数のASを想定しています。 このユースケースでは、BGP Prefix-SID Advertisementは、AS間コンテキスト、つまりEBGPに適用できますが、単一の管理ドメインに限定されます。"
    },
    {
      "indent": 0,
      "text": "9. Security Considerations",
      "section_title": true,
      "ja": "9. セキュリティに関する考慮事項"
    },
    {
      "indent": 3,
      "text": "This document introduces a BGP attribute (BGP Prefix-SID), which inherits the security considerations expressed in: [RFC4271], [RFC8277], and [RFC8402].",
      "ja": "このドキュメントでは、[RFC4271]、[RFC8277]、および[RFC8402]で表されるセキュリティの考慮事項を継承するBGP属性（BGP Prefix-SID）を紹介します。"
    },
    {
      "indent": 3,
      "text": "When advertised using BGPsec as described in [RFC8205], the BGP Prefix-SID attribute doesn't impose any unique security considerations. It should be noted that the BGP Prefix-SID attribute is not protected by the BGPsec signatures.",
      "ja": "[RFC8205]で説明されているようにBGPsecを使用してアドバタイズされるとき、BGP Prefix-SID属性は一意のセキュリティ上の考慮事項を課しません。 BGP Prefix-SID属性はBGPsec署名によって保護されていないことに注意してください。"
    },
    {
      "indent": 3,
      "text": "It should be noted that, as described in Section 8, this document refers to a deployment model where all nodes are under the single administrative domain. In this context, we assume that the operator doesn't want to leak any information related to internal prefixes and topology outside of the administrative domain. The internal information includes the BGP Prefix-SID. In order to prevent such leaking, the common BGP mechanisms (filters) are applied at the boundary of the SR/administrative domain. Local BGP-attribute-filtering policies and mechanisms are not standardized and, consequently, are beyond the scope of this document.",
      "ja": "セクション8で説明されているように、このドキュメントは、すべてのノードが単一の管理ドメインの下にある展開モデルを指していることに注意してください。 このコンテキストでは、オペレータが管理ドメイン外の内部プレフィックスとトポロジに関連する情報を漏らしたくないと想定しています。 内部情報には、BGP Prefix-SIDが含まれます。 このようなリークを防ぐために、SR /管理ドメインの境界に一般的なBGPメカニズム（フィルター）が適用されます。 ローカルBGP属性フィルタリングポリシーとメカニズムは標準化されていないため、このドキュメントの範囲外です。"
    },
    {
      "indent": 3,
      "text": "To prevent a Denial-of-Service (DoS) or Distributed-Denial-of-Service (DDoS) attack due to excessive BGP updates with an invalid or conflicting BGP Prefix-SID attribute, error log message rate limiting as well as suppression of duplicate error log messages SHOULD be deployed.",
      "ja": "無効または競合するBGP Prefix-SID属性、エラーログメッセージのレート制限、および重複の抑制による過剰なBGP更新によるサービス拒否（DoS）または分散サービス拒否（DDoS）攻撃を防ぐため エラーログメッセージを展開する必要があります。"
    },
    {
      "indent": 3,
      "text": "Since BGP-LS is the preferred method for advertising SRGB information, the BGP speaker SHOULD log an error if a BGP Prefix-SID attribute is received with SRGB information different from that received as an attribute of the same node's BGP-LS Node NLRI.",
      "ja": "BGP-LSはSRGB情報をアドバタイズするための好ましい方法であるため、BGPスピーカーは、同じノードのBGP-LSノードNLRIの属性として受信したものとは異なるSRGB情報を持つBGP Prefix-SID属性を受信した場合、エラーをログに記録する必要があります。"
    },
    {
      "indent": 0,
      "text": "10. References",
      "section_title": true,
      "ja": "10. 参考文献"
    },
    {
      "indent": 0,
      "text": "10.1. Normative References",
      "section_title": true,
      "ja": "10.1. 引用文献"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <https://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119] Bradner、S.、「要件レベルを示すためにRFCで使用するキーワード」、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<https://www.rfc-editor.org/info/ rfc2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC4271] Rekhter, Y., Ed., Li, T., Ed., and S. Hares, Ed., \"A Border Gateway Protocol 4 (BGP-4)\", RFC 4271, DOI 10.17487/RFC4271, January 2006, <https://www.rfc-editor.org/info/rfc4271>.",
      "ja": "[RFC4271] Rekhter、Y.、Ed。、Li、T.、Ed。、and S. Hares、Ed。、 \"A Border Gateway Protocol 4（BGP-4）\"、RFC 4271、DOI 10.17487 / RFC4271、January 2006 、<https://www.rfc-editor.org/info/rfc4271>。"
    },
    {
      "indent": 3,
      "text": "[RFC4364] Rosen, E. and Y. Rekhter, \"BGP/MPLS IP Virtual Private Networks (VPNs)\", RFC 4364, DOI 10.17487/RFC4364, February 2006, <https://www.rfc-editor.org/info/rfc4364>.",
      "ja": "[RFC4364] Rosen、E.およびY. Rekhter、「BGP / MPLS IP仮想プライベートネットワーク（VPN）」、RFC 4364、DOI 10.17487 / RFC4364、2006年2月、<https://www.rfc-editor.org/info / rfc4364>。"
    },
    {
      "indent": 3,
      "text": "[RFC4760] Bates, T., Chandra, R., Katz, D., and Y. Rekhter, \"Multiprotocol Extensions for BGP-4\", RFC 4760, DOI 10.17487/RFC4760, January 2007, <https://www.rfc-editor.org/info/rfc4760>.",
      "ja": "[RFC4760] Bates、T.、Chandra、R.、Katz、D。、およびY. Rekhter、「BGP-4のマルチプロトコル拡張」、RFC 4760、DOI 10.17487 / RFC4760、2007年1月、<https：// www。 rfc-editor.org/info/rfc4760>。"
    },
    {
      "indent": 3,
      "text": "[RFC7606] Chen, E., Ed., Scudder, J., Ed., Mohapatra, P., and K. Patel, \"Revised Error Handling for BGP UPDATE Messages\", RFC 7606, DOI 10.17487/RFC7606, August 2015, <https://www.rfc-editor.org/info/rfc7606>.",
      "ja": "[RFC7606] Chen、E.、Ed。、Scudder、J.、Ed。、Mohapatra、P。、およびK. Patel、「BGP UPDATEメッセージの修正されたエラー処理」、RFC 7606、DOI 10.17487 / RFC7606、2015年8月、 <https://www.rfc-editor.org/info/rfc7606>。"
    },
    {
      "indent": 3,
      "text": "[RFC7911] Walton, D., Retana, A., Chen, E., and J. Scudder, \"Advertisement of Multiple Paths in BGP\", RFC 7911, DOI 10.17487/RFC7911, July 2016, <https://www.rfc-editor.org/info/rfc7911>.",
      "ja": "[RFC7911] Walton、D.、Retana、A.、Chen、E。、およびJ. Scudder、「BGPの複数パスの広告」、RFC 7911、DOI 10.17487 / RFC7911、2016年7月、<https：// www。 rfc-editor.org/info/rfc7911>。"
    },
    {
      "indent": 3,
      "text": "[RFC8126] Cotton, M., Leiba, B., and T. Narten, \"Guidelines for Writing an IANA Considerations Section in RFCs\", BCP 26, RFC 8126, DOI 10.17487/RFC8126, June 2017, <https://www.rfc-editor.org/info/rfc8126>.",
      "ja": "[RFC8126] Cotton、M.、Leiba、B。、およびT. Narten、「RFCでIANA考慮事項セクションを記述するためのガイドライン」、BCP 26、RFC 8126、DOI 10.17487 / RFC8126、2017年6月、<https：// www .rfc-editor.org / info / rfc8126>。"
    },
    {
      "indent": 3,
      "text": "[RFC8174] Leiba, B., \"Ambiguity of Uppercase vs Lowercase in RFC 2119 Key Words\", BCP 14, RFC 8174, DOI 10.17487/RFC8174, May 2017, <https://www.rfc-editor.org/info/rfc8174>.",
      "ja": "[RFC8174] Leiba、B。、「RFC 2119キーワードの大文字と小文字のあいまいさ」、BCP 14、RFC 8174、DOI 10.17487 / RFC8174、2017年5月、<https://www.rfc-editor.org/info/ rfc8174>。"
    },
    {
      "indent": 3,
      "text": "[RFC8205] Lepinski, M., Ed. and K. Sriram, Ed., \"BGPsec Protocol Specification\", RFC 8205, DOI 10.17487/RFC8205, September 2017, <https://www.rfc-editor.org/info/rfc8205>.",
      "ja": "[RFC8205] Lepinski、M.、Ed。 およびK. Sriram、編、「BGPsecプロトコル仕様」、RFC 8205、DOI 10.17487 / RFC8205、2017年9月、<https://www.rfc-editor.org/info/rfc8205>。"
    },
    {
      "indent": 3,
      "text": "[RFC8277] Rosen, E., \"Using BGP to Bind MPLS Labels to Address Prefixes\", RFC 8277, DOI 10.17487/RFC8277, October 2017, <https://www.rfc-editor.org/info/rfc8277>.",
      "ja": "[RFC8277] Rosen、E。、「BGPを使用してMPLSラベルをバインドしてプレフィックスをアドレス指定する」、RFC 8277、DOI 10.17487 / RFC8277、2017年10月、<https://www.rfc-editor.org/info/rfc8277>。"
    },
    {
      "indent": 3,
      "text": "[RFC8402] Filsfils, C., Ed., Previdi, S., Ed., Ginsberg, L., Decraene, B., Litkowski, S., and R. Shakir, \"Segment Routing Architecture\", RFC 8402, DOI 10.17487/RFC8402, July 2018, <https://www.rfc-editor.org/info/rfc8402>.",
      "ja": "[RFC8402] Filsfils、C.、Ed。、Previdi、S.、Ed。、Ginsberg、L.、Decraene、B.、Litkowski、S。、およびR. Shakir、「Segment Routing Architecture」、RFC 8402、DOI 10.17487 / RFC8402、2018年7月、<https://www.rfc-editor.org/info/rfc8402>。"
    },
    {
      "indent": 3,
      "text": "[RFC8660] Bashandy, A., Ed., Filsfils, C., Ed., Previdi, S., Decraene, B., Litkowski, S., and R. Shakir, \"Segment Routing with the MPLS Data Plane\", RFC 8660, DOI 10.17487/RFC8660, December 2019, <https://www.rfc-editor.org/info/rfc8660>.",
      "ja": "[RFC8660] Bashandy、A.、Ed。、Filsfils、C.、Ed。、Previdi、S.、Decraene、B.、Litkowski、S.、およびR. Shakir、 \"MPLS Data Planeによるセグメントルーティング\"、RFC 8660、DOI 10.17487 / RFC8660、2019年12月、<https://www.rfc-editor.org/info/rfc8660>。"
    },
    {
      "indent": 0,
      "text": "10.2. Informative References",
      "section_title": true,
      "ja": "10.2. 参考引用"
    },
    {
      "indent": 3,
      "text": "[BGPLS-SR-EPE] Previdi, S., Talaulikar, K., Filsfils, C., Patel, K., Ray, S., and J. Dong, \"BGP-LS extensions for Segment Routing BGP Egress Peer Engineering\", Work in Progress, Internet-Draft, draft-ietf-idr-bgpls-segment-routing-epe-19, 16 May 2019, <https://tools.ietf.org/html/draft-ietf-idr-bgpls-segment-routing-epe-19>.",
      "ja": "[BGPLS-SR-EPE] Previdi、S.、Talaulikar、K.、Filsfils、C.、Patel、K.、Ray、S。、およびJ. Dong、「セグメントルーティングBGP出力ピアエンジニアリングのためのBGP-LS拡張」 、Work in Progress、Internet-Draft、draft-ietf-idr-bgpls-segment-routing-epe-19、2019年5月16日、<https://tools.ietf.org/html/draft-ietf-idr-bgpls- segment-routing-epe-19>。"
    },
    {
      "indent": 3,
      "text": "[BGPLS-SR-EXT] Previdi, S., Talaulikar, K., Filsfils, C., Gredler, H., and M. Chen, \"BGP Link-State extensions for Segment Routing\", Work in Progress, Internet-Draft, draft-ietf-idr-bgp-ls-segment-routing-ext-16, 27 June 2019, <https://tools.ietf.org/html/draft-ietf-idr-bgp-ls-segment-routing-ext-16>.",
      "ja": "[BGPLS-SR-EXT] Previdi、S.、Talaulikar、K.、Filsfils、C.、Gredler、H。、およびM. Chen、「BGP Link-State extensions for Segment Routing」、Work in Progress、Internet-Draft 、draft-ietf-idr-bgp-ls-segment-routing-ext-16、2019年6月27日、<https://tools.ietf.org/html/draft-ietf-idr-bgp-ls-segment-routing- ext-16>。"
    },
    {
      "indent": 3,
      "text": "[IPv6-SRH] Filsfils, C., Dukes, D., Previdi, S., Leddy, J., Matsushima, S., and D. Voyer, \"IPv6 Segment Routing Header (SRH)\", Work in Progress, Internet-Draft, draft-ietf-6man-segment-routing-header-26, 22 October 2019, <https://tools.ietf.org/html/draft-ietf-6man-segment-routing-header-26>.",
      "ja": "[IPv6-SRH] Filsfils、C.、Dukes、D.、Previdi、S.、Leddy、J。、松島、S。、およびD. Voyer、「IPv6セグメントルーティングヘッダー（SRH）」、Work in Progress、インターネット -ドラフト、draft-ietf-6man-segment-routing-header-26、2019年10月22日、<https://tools.ietf.org/html/draft-ietf-6man-segment-routing-header-26>"
    },
    {
      "indent": 3,
      "text": "[RFC3032] Rosen, E., Tappan, D., Fedorkow, G., Rekhter, Y., Farinacci, D., Li, T., and A. Conta, \"MPLS Label Stack Encoding\", RFC 3032, DOI 10.17487/RFC3032, January 2001, <https://www.rfc-editor.org/info/rfc3032>.",
      "ja": "[RFC3032]ローゼン、E。、タッパン、D。、フェドルコウ、G。、レフター、Y。、ファリナッチ、D。、リー、T。、およびA.コンタ、「MPLSラベルスタックエンコーディング」、RFC 3032、DOI 10.17487 / RFC3032、2001年1月、<https://www.rfc-editor.org/info/rfc3032>。"
    },
    {
      "indent": 3,
      "text": "[RFC5004] Chen, E. and S. Sangli, \"Avoid BGP Best Path Transitions from One External to Another\", RFC 5004, DOI 10.17487/RFC5004, September 2007, <https://www.rfc-editor.org/info/rfc5004>.",
      "ja": "[RFC5004] Chen、E。、およびS. Sangli、「外部から外部へのBGPベストパス遷移の回避」、RFC 5004、DOI 10.17487 / RFC5004、2007年9月、<https://www.rfc-editor.org/info / rfc5004>。"
    },
    {
      "indent": 3,
      "text": "[RFC7752] Gredler, H., Ed., Medved, J., Previdi, S., Farrel, A., and S. Ray, \"North-Bound Distribution of Link-State and Traffic Engineering (TE) Information Using BGP\", RFC 7752, DOI 10.17487/RFC7752, March 2016, <https://www.rfc-editor.org/info/rfc7752>.",
      "ja": "[RFC7752] Gredler、H.、Ed。、Medved、J.、Previdi、S.、Farrel、A。、およびS. Ray、「BGPを使用したリンクステートおよびトラフィックエンジニアリング（TE）情報の北限分布」 、RFC 7752、DOI 10.17487 / RFC7752、2016年3月、<https://www.rfc-editor.org/info/rfc7752>。"
    },
    {
      "indent": 3,
      "text": "[RFC8670] Filsfils, C., Ed., Previdi, S., Dawra, G., Aries, E., and P. Lapukhov, \"BGP Prefix Segment in Large-Scale Data Centers\", RFC 8670, DOI 10.17487/RFC8670, December 2019, <https://www.rfc-editor.org/info/rfc8670>.",
      "ja": "[RFC8670] Filsfils、C.、Ed。、Previdi、S.、Dawra、G.、Aries、E。、およびP. Lapukhov、「大規模データセンターのBGPプレフィックスセグメント」、RFC 8670、DOI 10.17487 / RFC8670 、2019年12月、<https://www.rfc-editor.org/info/rfc8670>。"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Satya Mohanty for his contribution to this document.",
      "ja": "著者は、このドキュメントへの貢献についてSatya Mohantyに感謝します。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Alvaro Retana for substantive comments as part of the Routing AD review.",
      "ja": "著者は、Routing ADレビューの一部として実質的なコメントをいただいたAlvaro Retanaに感謝します。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Bruno Decraene for substantive comments and suggested text as part of the Routing Directorate review.",
      "ja": "著者らは、実質的なコメントをしてくれたBruno Decraeneに感謝し、ルーティング総局のレビューの一環としてテキストを提案しました。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Shyam Sethuram for comments and discussion of TLV processing and validation.",
      "ja": "著者は、TLV処理と検証に関するコメントと議論についてShyam Sethuramに感謝します。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Robert Raszuk for comments and suggestions regarding the MPLS data-plane behavior.",
      "ja": "著者は、MPLSデータプレーンの動作に関するコメントと提案について、Robert Raszukに感謝します。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Krishna Deevi, Juan Alcaide, Howard Yang, and Jakob Heitz for discussions on conflicting BGP Prefix-SID label indices and BGP add paths.",
      "ja": "著者は、競合するBGP Prefix-SIDラベルインデックスとBGP追加パスに関する議論について、Krishna Deevi、Juan Alcaide、Howard Yang、およびJakob Heitzに感謝します。"
    },
    {
      "indent": 3,
      "text": "The authors would like to thank Peter Yee, Tony Przygienda, Mirja Kuhlewind, Alexey Melnikov, Eric Rescorla, Suresh Krishnan, Warren Kumari, Ben Campbell Sue Hares, and Martin Vigoureux for IDR Working Group last call, IETF Last Call, directorate, and IESG reviews.",
      "ja": "著者は、IDRワーキンググループラストコール、IETFラストコール、ディレクター、およびIESGについて、ピーターイー、トニープルジギエンダ、ミルジャクーレウィンド、アレクセイメルニコフ、エリックレスコーラ、スレシュクリシュナン、ウォーレンクマリ、ベンキャンベルスーヘアス、マーティンヴィグールーに感謝します。 レビュー。"
    },
    {
      "indent": 0,
      "text": "Contributors",
      "ja": "貢献者"
    },
    {
      "indent": 3,
      "text": "Keyur Patel Arrcus, Inc. United States of America",
      "ja": "Keyur Patel Arrcus、Inc.アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: Keyur@arrcus.com",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Saikat Ray Unaffiliated United States of America",
      "ja": "サイカットレイアフィリエイトアメリカ"
    },
    {
      "indent": 3,
      "text": "Email: raysaikat@gmail.com",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Stefano Previdi Huawei Technologies Italy",
      "ja": "Stefano Previdi Huawei Technologies Italy"
    },
    {
      "indent": 3,
      "text": "Email: stefano@previdi.net",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Clarence Filsfils Cisco Systems Brussels Belgium",
      "ja": "Clarence Filsfils Cisco Systemsブリュッセルベルギー"
    },
    {
      "indent": 3,
      "text": "Email: cfilsfil@cisco.com",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Acee Lindem (editor) Cisco Systems 301 Midenhall Way Cary, NC, 27513 United States of America",
      "ja": "Acee Lindem（編集者）Cisco Systems 301 Midenhall Way Cary、NC、27513アメリカ合衆国"
    },
    {
      "indent": 3,
      "text": "Email: acee@cisco.com",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Arjun Sreekantiah",
      "ja": "アルジュン・スレカンティア"
    },
    {
      "indent": 3,
      "text": "Email: arjunhrs@gmail.com",
      "raw": true
    },
    {
      "indent": 3,
      "text": "Hannes Gredler RtBrick Inc.",
      "ja": "ハネス・グレドラーRtBrick Inc."
    },
    {
      "indent": 3,
      "text": "Email: hannes@rtbrick.com",
      "raw": true
    }
  ]
}