{
  "title": {
    "text": "RFC 7553 - The Uniform Resource Identifier (URI) DNS Resource Record",
    "ja": "RFC 7553 - 統一資源識別子（URI）DNSリソースレコード"
  },
  "number": 7553,
  "created_at": "2019-10-30 09:54:16.420110+09:00",
  "updated_by": "",
  "contents": [
    {
      "indent": 0,
      "text": "Internet Engineering Task Force (IETF)                      P. Faltstrom\nRequest for Comments: 7553                                        Netnod\nCategory: Informational                                       O. Kolkman\nISSN: 2070-1721                                                     ISOC\n                                                               June 2015",
      "raw": true
    },
    {
      "indent": 7,
      "text": "The Uniform Resource Identifier (URI) DNS Resource Record",
      "raw": true
    },
    {
      "indent": 0,
      "text": "Abstract",
      "ja": "抽象"
    },
    {
      "indent": 3,
      "text": "This document describes the already registered DNS resource record (RR) type, called the Uniform Resource Identifier (URI) RR, that is used for publishing mappings from hostnames to URIs.",
      "ja": "この文書では、既に登録されているDNSリソースレコード（RR）の種類を説明し、統一資源識別子（URI）RR、それはURIにホスト名から出版のマッピングに使用されると呼ばれます。"
    },
    {
      "indent": 0,
      "text": "Status of This Memo",
      "ja": "このメモのステータス"
    },
    {
      "indent": 3,
      "text": "This document is not an Internet Standards Track specification; it is published for informational purposes.",
      "ja": "このドキュメントはインターネット標準化過程仕様ではありません。それは、情報提供の目的のために公開されています。"
    },
    {
      "indent": 3,
      "text": "This document is a product of the Internet Engineering Task Force (IETF). It represents the consensus of the IETF community. It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG). Not all documents approved by the IESG are a candidate for any level of Internet Standard; see Section 2 of RFC 5741.",
      "ja": "このドキュメントはインターネットエンジニアリングタスクフォース（IETF）の製品です。これは、IETFコミュニティの総意を表しています。これは、公開レビューを受けており、インターネットエンジニアリング運営グループ（IESG）によって公表のために承認されています。 IESGによって承認されていないすべての文書がインターネットStandardのどんなレベルの候補です。 RFC 5741のセクション2を参照してください。"
    },
    {
      "indent": 3,
      "text": "Information about the current status of this document, any errata, and how to provide feedback on it may be obtained at http://www.rfc-editor.org/info/rfc7553.",
      "ja": "このドキュメントの現在の状態、任意の正誤表、そしてどのようにフィードバックを提供するための情報がhttp://www.rfc-editor.org/info/rfc7553で取得することができます。"
    },
    {
      "indent": 0,
      "text": "Copyright Notice",
      "ja": "著作権表示"
    },
    {
      "indent": 3,
      "text": "Copyright (c) 2015 IETF Trust and the persons identified as the document authors. All rights reserved.",
      "ja": "著作権（C）2015 IETF信託とドキュメントの作成者として特定の人物。全著作権所有。"
    },
    {
      "indent": 3,
      "text": "This document is subject to BCP 78 and the IETF Trust's Legal Provisions Relating to IETF Documents (http://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License.",
      "ja": "この文書では、BCP 78と、この文書の発行日に有効なIETFドキュメント（http://trustee.ietf.org/license-info）に関連IETFトラストの法律の規定に従うものとします。彼らは、この文書に関してあなたの権利と制限を説明するように、慎重にこれらの文書を確認してください。コードコンポーネントは、トラスト法規定のセクションで説明4.eおよび簡体BSDライセンスで説明したように、保証なしで提供されているよう簡体BSDライセンスのテキストを含める必要があり、この文書から抽出されました。"
    },
    {
      "indent": 0,
      "text": "Table of Contents",
      "ja": "目次"
    },
    {
      "indent": 3,
      "text": "1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3\n2.  Applicability Statement . . . . . . . . . . . . . . . . . . .   3\n3.  DNS Considerations  . . . . . . . . . . . . . . . . . . . . .   4\n4.  The Format of the URI RR  . . . . . . . . . . . . . . . . . .   4\n  4.1.  Owner Name, Class, and Type . . . . . . . . . . . . . . .   4\n  4.2.  Priority  . . . . . . . . . . . . . . . . . . . . . . . .   5\n  4.3.  Weight  . . . . . . . . . . . . . . . . . . . . . . . . .   5\n  4.4.  Target  . . . . . . . . . . . . . . . . . . . . . . . . .   5\n  4.5.  URI RDATA Wire Format . . . . . . . . . . . . . . . . . .   6\n5.  Usages  . . . . . . . . . . . . . . . . . . . . . . . . . . .   6\n  5.1.  Example: FTP Server in the example.com Domain . . . . . .   6\n  5.2.  Relation to S-NAPTR . . . . . . . . . . . . . . . . . . .   7\n  5.3.  Relation to U-NAPTR . . . . . . . . . . . . . . . . . . .   7\n  5.4.  Relation to SRV . . . . . . . . . . . . . . . . . . . . .   7\n6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   7\n  6.1.  Registration of the URI Resource Record Type  . . . . . .   7\n  6.2.  Registration of Services  . . . . . . . . . . . . . . . .   8\n7.  Security Considerations . . . . . . . . . . . . . . . . . . .   8\n8.  References  . . . . . . . . . . . . . . . . . . . . . . . . .   9\n  8.1.  Normative References  . . . . . . . . . . . . . . . . . .   9\n  8.2.  Informative References  . . . . . . . . . . . . . . . . .   9\nAppendix A.  The Original RRTYPE Allocation Request . . . . . . .  11\nAcknowledgements  . . . . . . . . . . . . . . . . . . . . . . . .  14\nAuthors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  14",
      "raw": true
    },
    {
      "indent": 0,
      "text": "1. Introduction",
      "section_title": true,
      "ja": "1.はじめに"
    },
    {
      "indent": 3,
      "text": "This document explains the use of the Domain Name System (DNS) for the storage of URIs [RFC3986] and how to resolve hostnames to such URIs that can be used by various applications using the URI resource record type. For resolution, the application needs to know both the hostname and the protocol that the URI is to be used for. The protocol is registered by IANA.",
      "ja": "この文書は、URIの保存のためのドメインネームシステム（DNS）[RFC3986]の使用を説明し、どのようにURIのリソースレコードタイプを使用して、さまざまな用途で使用することができ、そのようなURIにホスト名を解決します。解決のために、アプリケーションはホスト名とURIがために使用されるプロトコルの両方を知っている必要があります。プロトコルは、IANAによって登録されています。"
    },
    {
      "indent": 3,
      "text": "Historically, uses of the DNS to map a domain name to a URL have relied on the Naming Authority Pointer (NAPTR) RRTYPEs [RFC2915] and then on the Dynamic Delegation Discovery System (DDDS) [RFC3401] application framework with the DNS as a database as specified in RFC 3404 [RFC3404]. This has a number of implications such as the fact the RRSet returned will contain all URIs \"connected\" with the owner, and not only the ones related to a specific service.",
      "ja": "歴史的には、命名権限ポインタ（NAPTR）RRTYPEs [RFC2915]とに依存してきたURLにドメイン名をマップするためにDNSを使用し、その後にダイナミックな委譲発見システム（DDDS）データベースとDNSと[RFC3401]アプリケーションフレームワークRFC 3404 [RFC3404]で指定されるように。これは、このような資源レコード集合は、所有者、およびだけでなく、特定のサービスに関連したもので、「接続」すべてのURIが含まれています返された事実としての意味の数を持っています。"
    },
    {
      "indent": 3,
      "text": "The URI resource record specified in this document enables the querying party to do the equivalent of selecting which of the NAPTR records one is interested in and have only those returned. This is possible because data in the service field of the NAPTR record is included in the owner part of the URI resource record type. It is also the case that as the URI resource record type includes the target URI directly as part of the RDATA, it is very easy to extract the correct target URI, instead of applying rewrite rules as in NAPTR.",
      "ja": "この文書で指定されたURIのリソースレコードは1つがに興味を持っているとのみが戻ってきたNAPTRレコードの選択と同等の操作を行うための照会パーティを可能にします。 NAPTRレコードのサービスフィールドのデータは、URIのリソースレコードタイプの所有者の一部に含まれているので、これは可能です。これは、直接RDATAの一部としてではなくNAPTRのように書き換え規則を適用すること、正しいターゲットURIを抽出することは非常に簡単であり、また、URIリソースレコードタイプとしてターゲットURIを含む場合です。"
    },
    {
      "indent": 3,
      "text": "Querying for URI resource records is not replacing querying for NAPTR resource records (or use of S-NAPTR [RFC3958]). Instead, the URI resource record type provides a complementary mechanism to be used when one already knows what service field is interesting. With it, one can directly query for the specific subset of the otherwise possibly large RRSet returned when querying for NAPTR resource records.",
      "ja": "URIのリソースレコードを照会するNAPTRリソースレコード（またはS-NAPTR [RFC3958]を使用する）を照会置換されていません。代わりに、URIリソースレコードタイプは1つがすでにフィールドが面白いです何のサービスを知っているときに使用する補完的なメカニズムを提供します。それによって、人は直接、そうでない場合は、おそらく大規模な資源レコード集合の特定のサブセットを照会することができますNAPTRリソースレコードを照会するときに返さ。"
    },
    {
      "indent": 3,
      "text": "The key words \"MUST\", \"MUST NOT\", \"REQUIRED\", \"SHALL\", \"SHALL NOT\", \"SHOULD\", \"SHOULD NOT\", \"RECOMMENDED\", \"MAY\", and \"OPTIONAL\" in this document are to be interpreted as described in BCP 14, RFC 2119 [RFC2119].",
      "ja": "この文書のキーワード \"MUST\"、 \"MUST NOT\"、 \"REQUIRED\"、、、、 \"べきではない\" \"べきである\" \"ないもの\" \"ものとし\"、 \"推奨\"、 \"MAY\"、および \"OPTIONAL\" はありますBCP 14、RFC 2119 [RFC2119]に記載されているように解釈されます。"
    },
    {
      "indent": 0,
      "text": "2. Applicability Statement",
      "section_title": true,
      "ja": "2.適用性に関する声明"
    },
    {
      "indent": 3,
      "text": "In general, it is expected that URI records will be used by clients for applications where the relevant protocol to be used is known, but, for example, an extra abstraction is needed in order to separate a domain name from a point of service (as addressed by the URI). One example of such a situation is when an organization has many domain names but only one official web page.",
      "ja": "一般に、（たとえば、余分な抽象化は、サービスの点からドメイン名を分離するために必要とされる、URIレコードは、関連するプロトコルが知られており、使用するアプリケーションのためにクライアントによって使用されることが期待されるが、 ）URIによって対処。組織は、多くのドメイン名が、唯一の公式Webページを持っている場合、このような状況の一例です。"
    },
    {
      "indent": 3,
      "text": "Applications need to know the specific service to prepend the hostname with. Using repetitive queries for URI records is not a replacement for querying for NAPTR records according to the NAPTR (DDDS) or S-NAPTR algorithms. NAPTR records serve the purpose of discovering the various services or the URIs (for looking up access points for a given service). These are two very different kinds of needs.",
      "ja": "アプリケーションでは、とホスト名を付加するために特定のサービスを知っている必要があります。 URIレコードの反復クエリを使用するNAPTR（DDDS）またはS-NAPTRアルゴリズムに従ってNAPTRレコードを照会するための交換はありません。 NAPTRレコードは、（特定のサービスのためのアクセスポイントを検索するため）、さまざまなサービスやURIを発見する目的を果たします。これらは、ニーズの2つの非常に異なる種類があります。"
    },
    {
      "indent": 0,
      "text": "3. DNS Considerations",
      "section_title": true,
      "ja": "3. DNSの考慮事項"
    },
    {
      "indent": 3,
      "text": "Using prefix labels, such as underscored service tags, for a specific owner name may cause a counter-intuitive effect when the owner name is a wildcard name. For example, _s2._s1.*.example.net is not a wildcard name and cannot be used to return a synthesized answer for a query name of _s2._s1.a.example.net. See Section 4.5 of RFC 4592 [RFC4592] for more details. Besides, underscored service tags used for the URI RR (based on the \"Service Name and Transport Protocol Port Number Registry\") may have slightly different semantics than service tags used for underscored prefix labels that are used in combination with other (yet unspecified) RR types. This may cause subtle management problems when delegation structure that has developed within the context of URI RRs is also to be used for other RR types. Because the service labels might be overloaded, applications should carefully check that the application-level protocol is indeed the protocol they expect.",
      "ja": "所有者名がワイルドカード名である場合に、特定の所有者名のために、このよう下線サービスタグなどの接頭辞ラベルを使用すると、直感的な効果を引き起こす可能性があります。例えば、_s2._s1。*。example.netは、ワイルドカード名ではなく、_s2._s1.a.example.netのクエリ名のために合成された答えを返すために使用することはできません。詳細については、RFC 4592 [RFC4592]の4.5節を参照してください。また、（「サービス名とトランスポートプロトコルポート番号レジストリ」に基づいて）URI RRは他の（まだ詳細不明）RRとの組み合わせで使用されている下線接頭辞のラベルに使用するサービスタグよりもわずかに異なる意味を持っていることのために使用されるサービスタグを強調タイプ。 URI RRのコンテキスト内で開発した代表団の構造は、他のRRタイプのために使用されることもあるとき、これは微妙な管理上の問題を引き起こす可能性があります。サービスラベルがオーバーロードされる可能性があるため、アプリケーションは慎重にアプリケーションレベルのプロトコルが実際に彼らが期待するプロトコルであることを確認する必要があります。"
    },
    {
      "indent": 3,
      "text": "Subtle management issues may also arise when the delegations from service to sub-service labels involve several parties and different stakeholders.",
      "ja": "サブサービスラベルへのサービスからの代表団は、いくつかの政党と異なる利害関係者が関与する際の微妙な管理の問題も発生する可能性があります。"
    },
    {
      "indent": 0,
      "text": "4. The Format of the URI RR",
      "section_title": true,
      "ja": "4. URI RRのフォーマット"
    },
    {
      "indent": 3,
      "text": "This is the presentation format of the URI RR:",
      "ja": "これは、URIのRRのプレゼンテーション形式です："
    },
    {
      "indent": 6,
      "text": "Owner name TTL Class URI Priority Weight Target",
      "ja": "所有者名TTLクラスURIの優先順位重ターゲット"
    },
    {
      "indent": 3,
      "text": "The URI RR does not cause any kind of Additional Section processing.",
      "ja": "URI RRは追加セクション処理のいずれかの種類が発生することはありません。"
    },
    {
      "indent": 0,
      "text": "4.1. Owner Name, Class, and Type",
      "section_title": true,
      "ja": "4.1。所有者名、クラス、およびタイプ"
    },
    {
      "indent": 3,
      "text": "The URI owner name is subject to special conventions.",
      "ja": "URIの所有者名は、特別な規則に従うものとします。"
    },
    {
      "indent": 3,
      "text": "Just like the SRV RR [RFC2782], the URI RR has service information encoded in its owner name. In order to encode the service for a specific owner name, one uses service parameters. Valid service parameters are those registered by IANA in the \"Service Name and Transport Protocol Port Number Registry\" [RFC6335] or as \"Enumservice",
      "ja": "ただ、SRVのRR [RFC2782]のように、URI RRは、その所有者名で符号化されたサービス情報を持っています。特定の所有者名のサービスを符号化するためには、サービスパラメータを使用します。有効なサービスパラメータは、「サービス名とトランスポートプロトコルポート番号レジストリ」[RFC6335]またはEnumservice」としてIANAによって登録されたものであり、"
    },
    {
      "indent": 3,
      "text": "Registrations [RFC6117]. The Enumservice Registration parameters are reversed (i.e., subtype(s) before type), prepended with an underscore (_), and prepended to the owner name in separate labels. The underscore is prepended to the service parameters to avoid collisions with DNS labels that occur in nature, and the order is reversed to make it possible to do delegations, if needed, to different zones (and therefore providers of DNS).",
      "ja": "登録[RFC6117]。 Enumservice登録パラメータが逆になっている（すなわち、サブタイプ（S）型の前）、下線（_）で付加し、別のラベルに所有者名の前に付加。アンダースコアは、自然界に存在DNSラベルとの衝突を避けるために、サービスパラメータの前に付加されており、必要に応じて順番が異なるゾーン（したがって、DNSの提供者）に、委任を行うことを可能にするために逆転されます。"
    },
    {
      "indent": 3,
      "text": "For example, suppose we are looking for the URI for a service with ENUM Service Parameter \"A:B:C\" for host example.com. Then we would query for (QNAME,QTYPE)=(\"_C._B._A.example.com\",\"URI\").",
      "ja": "「：B：C」ホストexample.comの例では、我々はENUMサービスパラメータとサービスのURIを探しているとします。その後、我々は（QNAME、QTYPE）=（ \"_ C._B._A.example.com\"、 \"URI\"）を照会します。"
    },
    {
      "indent": 3,
      "text": "As another example, suppose we are looking for the URI for a service with Service Name \"A\" and Transport Protocol \"B\" for host example.com. Then we would query for (QNAME,QTYPE)=(\"_A._B.example.com\",\"URI\").",
      "ja": "別の例として、我々はサービス名「A」およびトランスポートプロトコル、ホストexample.comの「B」とのサービスのURIを探しているとします。その後、我々は（QNAME、QTYPE）=（ \"_ A._B.example.com\"、 \"URI\"）を照会します。"
    },
    {
      "indent": 3,
      "text": "The type number for the URI record is 256.",
      "ja": "URIレコードのタイプ番号は256です。"
    },
    {
      "indent": 3,
      "text": "The URI resource record is class independent.",
      "ja": "URIのリソースレコードは、クラス無関係です。"
    },
    {
      "indent": 3,
      "text": "The URI RR has no special Time-to-Live (TTL) requirements.",
      "ja": "URI RRは特別な生存時間（TTL）の要件を持っていません。"
    },
    {
      "indent": 0,
      "text": "4.2. Priority",
      "section_title": true,
      "ja": "4.2。優先"
    },
    {
      "indent": 3,
      "text": "This field holds the priority of the target URI in this RR. Its range is 0-65535. A client MUST attempt to contact the URI with the lowest-numbered priority it can reach; URIs with the same priority SHOULD be selected according to probabilities defined by the weight field.",
      "ja": "このフィールドは、このRRにターゲットURIの優先順位を保持しています。その範囲は0〜65535です。クライアントは、それが到達できる最も低い番号の優先順位とURIに連絡しようとしなければなりません。同じ優先度を持つURIは重量フィールドによって定義された確率に応じて選択されるべきです。"
    },
    {
      "indent": 0,
      "text": "4.3. Weight",
      "section_title": true,
      "ja": "4.3。重量"
    },
    {
      "indent": 3,
      "text": "This field holds the server selection mechanism. The weight field specifies a relative weight for entries with the same priority. Larger weights SHOULD be given a proportionately higher probability of being selected. The range of this number is 0-65535.",
      "ja": "このフィールドは、サーバ選択機構を保持しています。重みフィールドは、同じ優先順位を持つエントリの相対的な重みを指定します。より大きな重みが選択されているのに比例してより高い確率を与えられるべきです。この番号の範囲は0〜65535です。"
    },
    {
      "indent": 0,
      "text": "4.4. Target",
      "section_title": true,
      "ja": "4.4。ターゲット"
    },
    {
      "indent": 3,
      "text": "This field holds the URI of the target, enclosed in double-quote characters ('\"'), where the URI is as specified in RFC 3986 [RFC3986]. Resolution of the URI is according to the definitions for the Scheme of the URI.",
      "ja": "URIのこの分野RFC 3986 [RFC3986]で指定されたURIは、二重引用符で囲まれたターゲットのURIを、（「\"」）、保持している。決議は、URIのスキームのための定義に従っています。"
    },
    {
      "indent": 3,
      "text": "Since the URI will not be encoded as a <character-string> (see Section 3.3 of RFC 1035 [RFC1035]), there is no 255-character size limitation.",
      "ja": "URIは、<文字列>（RFC 1035のセクション3.3 [RFC1035]を参照）としてエンコードされていないので、何の255文字サイズの制限はありません。"
    },
    {
      "indent": 3,
      "text": "The Target MUST NOT be an empty URI (\"\").",
      "ja": "ターゲットは、空のURI（「」）にすることはできません。"
    },
    {
      "indent": 0,
      "text": "4.5. URI RDATA Wire Format",
      "section_title": true,
      "ja": "4.5。 URI RDATAワイヤーフォーマット"
    },
    {
      "indent": 3,
      "text": "The RDATA for a URI RR consists of a 2-octet Priority field, a 2-octet Weight field, and a variable-length Target field.",
      "ja": "URI RR用RDATAは、2オクテットの優先度フィールド、2オクテット体重フィールド、及び可変長対象フィールドから成ります。"
    },
    {
      "indent": 3,
      "text": "Priority and Weight are unsigned integers in network byte order.",
      "ja": "優先度と重みは、ネットワークバイト順で符号なし整数です。"
    },
    {
      "indent": 3,
      "text": "The remaining data in the RDATA contains the Target field. The Target field contains the URI as a sequence of octets (without the enclosing double-quote characters used in the presentation format).",
      "ja": "RDATAの残りのデータは、ターゲットフィールドが含まれています。ターゲットフィールドは、（プレゼンテーション形式で使用囲む二重引用符なし）オクテットのシーケンスとしてURIが含まれています。"
    },
    {
      "indent": 3,
      "text": "The length of the Target field MUST be greater than zero.",
      "ja": "ターゲット・フィールドの長さは、ゼロより大きくなければなりません。"
    },
    {
      "indent": 3,
      "text": "                     1 1 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 2 2 2 3 3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Priority             |          Weight               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               /\n/                             Target                            /\n/                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 0,
      "text": "5. Usages",
      "section_title": true,
      "ja": "5.使用方法"
    },
    {
      "indent": 0,
      "text": "5.1. Example: FTP Server in the example.com Domain",
      "section_title": true,
      "ja": "5.1。例：example.comドメイン内のFTPサーバー"
    },
    {
      "indent": 3,
      "text": "An organization has the domain names example.com and example.net, and their FTP archive is at ftp://ftp1.example.com/public. Given the service name \"ftp\" and transport protocol \"tcp\" (from the IANA \"Service Name and Transport Protocol Port Number Registry\"), the following URI resource records could be made available in the respective zones (example.com and example.net):",
      "ja": "組織がドメイン名example.comとexample.netがあり、そのFTPアーカイブがftp://ftp1.example.com/publicです。サービス名（IANA「サービス名とトランスポートプロトコルポート番号登録」から）「FTP」とトランスポートプロトコル「TCP」を考えると、次のURIのリソースレコードは、各ゾーンで利用できるようにすることができた（example.comとexample.net ）："
    },
    {
      "indent": 3,
      "text": "$ORIGIN example.com. _ftp._tcp IN URI 10 1 \"ftp://ftp1.example.com/public\"",
      "ja": "$ ORIGIN example.comの。 URI 10 1 \"ftp://ftp1.example.com/public\" IN _ftp._tcp"
    },
    {
      "indent": 3,
      "text": "$ORIGIN example.net. _ftp._tcp IN URI 10 1 \"ftp://ftp1.example.com/public\"",
      "ja": "$ ORIGINのexample.net。 URI 10 1 \"ftp://ftp1.example.com/public\" IN _ftp._tcp"
    },
    {
      "indent": 0,
      "text": "5.2. Relation to S-NAPTR",
      "section_title": true,
      "ja": "5.2。 S-NAPTRとの関係"
    },
    {
      "indent": 3,
      "text": "The URI resource record type is not a replacement for the S-NAPTR. It is instead an extension and the second step of the S-NAPTR resolution can resolve a URI resource record instead of using SRV records and yet another algorithm for how to use SRV records for the specific protocol.",
      "ja": "URIのリソースレコードタイプはS-NAPTRに代わるものではありません。その代わりに拡張され、S-NAPTR解像度の第二段階ではなくSRVレコードと特定のプロトコルのためのSRVレコードを使用する方法のさらに別のアルゴリズムを用いたURIのリソースレコードを解決できます。"
    },
    {
      "indent": 3,
      "text": "$ORIGIN example.com. ;; order pref flags IN NAPTR 100 10 \"D\" \"EM:ProtA\" ( ; service \"\" ; regexp _http._tcp.example.com. ) ; replacement",
      "ja": "$ ORIGIN example.comの。 ;; NAPTR 100 10 \"D\" \"EM IN県フラグを注文する：\"（。;サービス \"\";正規表現_http._tcp.example.com）PROTA。置換"
    },
    {
      "indent": 3,
      "text": "_http._tcp IN URI 10 1 \"http://www.example.com/path\"",
      "ja": "URI 10 1 \"http://www.example.com/path\" IN _http._tcp"
    },
    {
      "indent": 0,
      "text": "5.3. Relation to U-NAPTR",
      "section_title": true,
      "ja": "5.3。 U-NAPTRとの関係"
    },
    {
      "indent": 3,
      "text": "The URI resource record type, together with S-NAPTR, can be viewed as a replacement for U-NAPTR [RFC4848]. The URI resource record type is only interesting when one know a base domain name, a protocol, and a service so that one can compose the record to look up. NAPTR records of any kind are used to look up what services exist for a certain domain, which is one step before the URI resource record is used.",
      "ja": "URIリソースレコードタイプは、一緒になってS-NAPTRと、U-NAPTR [RFC4848]の代替として見ることができます。 1は、ルックアップするために、レコードを構成することができるように1はベースドメイン名、プロトコル、およびサービスを知っているときURIのリソースレコードタイプは面白いです。あらゆる種類のNAPTRレコードはサービスはURIのリソースレコードが使用される前に一歩である特定のドメイン、のために存在するものを検索するために使用されています。"
    },
    {
      "indent": 0,
      "text": "5.4. Relation to SRV",
      "section_title": true,
      "ja": "5.4。 SRVとの関係"
    },
    {
      "indent": 3,
      "text": "The URI resource record type can be viewed as a replacement for the SRV record. This is because it, like the SRV record, can only be looked up if one knows the base domain, the protocol, and the service. It has a similar functionality and uses the same registry for service names, but instead of returning a hostname and port number, the URI record returns a full URI. As such, it can be viewed as a more powerful resource record than SRV.",
      "ja": "URIのリソースレコードタイプは、SRVレコードの代替として表示することができます。 SRVレコードのように、一つだけは基本ドメイン、プロトコル、およびサービスを知っている場合見上げことができるからです。これは、同様の機能を持っており、サービス名の同じレジストリを使用していますが、代わりにホスト名とポート番号を返すので、URIレコードは完全なURIを返します。このように、それはSRVよりも強力なリソースレコードとみなすことができます。"
    },
    {
      "indent": 0,
      "text": "6. IANA Considerations",
      "section_title": true,
      "ja": "6. IANAの考慮事項"
    },
    {
      "indent": 0,
      "text": "6.1. Registration of the URI Resource Record Type",
      "section_title": true,
      "ja": "6.1。 URIリソースレコードタイプの登録"
    },
    {
      "indent": 3,
      "text": "After an expert review in February 2011 (see Appendix A), IANA allocated RRTYPE 256 for the URI resource record type in the registry named \"Resource Record (RR) TYPEs\" (as defined in [BCP42], which was RFC 6195 at the time but has since been replaced by RFC 6895) located at <http://www.iana.org/assignments/dns-parameters>.",
      "ja": "2011年2月の専門家の審査の後、IANAが一度にRFC 6195だった[BCP42]で定義されている（「リソースレコード（RR）タイプ」という名前のレジストリ内のURIのリソースレコードタイプ、のためRRTYPE 256を割り当てられる（付録Aを参照してください）しかし、以来、<http://www.iana.org/assignments/dns-parameters>にあるRFC 6895）に置き換えられました。"
    },
    {
      "indent": 3,
      "text": "IANA has updated the reference for this registration to refer to this RFC.",
      "ja": "IANAは、このRFCを参照するには、この登録のための参照を更新しました。"
    },
    {
      "indent": 0,
      "text": "6.2. Registration of Services",
      "section_title": true,
      "ja": "6.2。サービスの登録"
    },
    {
      "indent": 3,
      "text": "No new registry is needed for the registration of services as the Service Name, Transport Protocol Port Numbers, Enumservices and the DNS SRV Service Type registries are also used for the URI resource record type.",
      "ja": "新しいレジストリは、URIリソースレコードタイプに使用されているサービス名、トランスポートプロトコルポート番号、EnumservicesおよびDNS SRVサービスタイプレジストリなどのサービスの登録に必要ありません。"
    },
    {
      "indent": 0,
      "text": "7. Security Considerations",
      "section_title": true,
      "ja": "7.セキュリティの考慮事項"
    },
    {
      "indent": 3,
      "text": "Using the URI resource record together with security mechanisms that rely on verification of authentication of hostnames, like TLS, makes it important to choose the correct domain name when doing the comparison and ensure that the change in the hostname to be used is secured by DNSSEC so that it can be trusted in a similar way as a redirect in HTTP using TLS.",
      "ja": "ホスト名の認証の検証に依存しているセキュリティ・メカニズムと一緒にURIのリソースレコードを使用して、TLSのように、それは重要な比較を行う際に正しいドメイン名を選択し、使用するホスト名の変更がDNSSECで固定されていることを保証することができるので、それはTLSを使用してHTTPでのリダイレクトと同様の方法で、信頼することができます。"
    },
    {
      "indent": 3,
      "text": "If, for example, the URI resource record is not signed with the help of DNSSEC and then validated successfully, trusting the non-signed URI will effectively lead to a downgrade attack.",
      "ja": "例えば、URIのリソースレコードがDNSSECの助けを借りて署名した後、正常に検証されていない、場合、非署名URIを信頼することは効果的にダウングレード攻撃につながります。"
    },
    {
      "indent": 3,
      "text": "The basic mechanism for successful use of URI works as follows:",
      "ja": "次のようにURIの使用の成功のための基本的なメカニズムは機能します。"
    },
    {
      "indent": 3,
      "text": "1. Announce that example.com is hosted at example.org (with some URL) in DNS.",
      "ja": "1. example.comをDNSに（いくつかのURLで）example.orgでホストされていることを発表。"
    },
    {
      "indent": 3,
      "text": "2. Secure the URI resource record with DNSSEC. This is best done by doing validation in the application doing the lookup, but it could also be done in the local recursive resolver or in the trusted recursive resolver also doing validation. All are according to the local trust policy.",
      "ja": "2. DNSSECとURIのリソースレコードを固定します。これは最高のルックアップを実行アプリケーションで検証を行うことによって行われているが、それもまた、検証を行っている地元の再帰リゾルバにまたは信頼できる再帰リゾルバに行うことができます。すべてが地元の信頼ポリシーに従っています。"
    },
    {
      "indent": 3,
      "text": "3. Verify the TLS (for example) certificate for the connection to example.org matches, i.e., use the hostname in the URI and not the hostname used originally when looking up the URI resource record.",
      "ja": "3. URIリソースレコードを検索するときに最初に使用したホスト名、一致をexample.orgの、すなわち、URIでホスト名を使用せずに接続するためのTLS（例えば）証明書を検証します。"
    },
    {
      "indent": 3,
      "text": "4. If needed, do application-layer authentication, etc., over the then encrypted connection.",
      "ja": "4.必要な場合は、暗号化された接続を介して、などのアプリケーション層認証を行います。"
    },
    {
      "indent": 3,
      "text": "It is also possible that the URI in the resource record type has errors in it. Applications using the URI resource record type for resolution should behave similarly as if the user typed (or copied and pasted) the URI. At least it must be clear to the user that the error is not due to any error from his side.",
      "ja": "リソースレコードタイプでURIがそれに誤りがあることも可能です。ユーザーが入力（またはコピー＆ペースト）の場合と同様にURIを振る舞うべきで解決のためのURIのリソースレコードタイプを使用するアプリケーション。少なくともそれはエラーが彼の側からのエラーによるものではなく、ユーザーに明確でなければなりません。"
    },
    {
      "indent": 3,
      "text": "One SHOULD NOT include userinfo (see \"User Information\", Section 3.2.1 of RFC 3986 [RFC3986]) in a URI that is used in a URI resource record as DNS data must be viewed as publicly available information.",
      "ja": "一つはのuserinfoはDNSデータとしてURIのリソースレコードで使用されるURIのように公に入手可能な情報を表示する必要があります（「ユーザー情報」、RFC 3986 [RFC3986]のセクション3.2.1を参照）を含んではなりません。"
    },
    {
      "indent": 0,
      "text": "8. References",
      "section_title": true,
      "ja": "8.参照文献"
    },
    {
      "indent": 0,
      "text": "8.1. Normative References",
      "section_title": true,
      "ja": "8.1。引用規格"
    },
    {
      "indent": 3,
      "text": "[BCP42] Eastlake 3rd, D., \"Domain Name System (DNS) IANA Considerations\", BCP 42, RFC 6895, April 2013, <http://www.rfc-editor.org/info/bcp42>.",
      "ja": "[BCP42]イーストレーク第3、D.、 \"ドメインネームシステム（DNS）IANAの考慮事項\"、BCP 42、RFC 6895、2013年4月、<http://www.rfc-editor.org/info/bcp42>。"
    },
    {
      "indent": 3,
      "text": "[RFC1035] Mockapetris, P., \"Domain names - implementation and specification\", STD 13, RFC 1035, DOI 10.17487/RFC1035, November 1987, <http://www.rfc-editor.org/info/rfc1035>.",
      "ja": "[RFC1035] Mockapetris、P.、 \"ドメイン名 - 実装及び仕様\"、STD 13、RFC 1035、DOI 10.17487 / RFC1035、1987年11月、<http://www.rfc-editor.org/info/rfc1035>。"
    },
    {
      "indent": 3,
      "text": "[RFC2119] Bradner, S., \"Key words for use in RFCs to Indicate Requirement Levels\", BCP 14, RFC 2119, DOI 10.17487/RFC2119, March 1997, <http://www.rfc-editor.org/info/rfc2119>.",
      "ja": "[RFC2119]ブラドナーの、S.、 \"要件レベルを示すためにRFCsにおける使用のためのキーワード\"、BCP 14、RFC 2119、DOI 10.17487 / RFC2119、1997年3月、<http://www.rfc-editor.org/info/ RFC2119>。"
    },
    {
      "indent": 3,
      "text": "[RFC3986] Berners-Lee, T., Fielding, R., and L. Masinter, \"Uniform Resource Identifier (URI): Generic Syntax\", STD 66, RFC 3986, DOI 10.17487/RFC3986, January 2005, <http://www.rfc-editor.org/info/rfc3986>.",
      "ja": "[RFC3986]バーナーズ - リー、T.、フィールディング、R.、およびL. Masinter、 \"ユニフォームリソース識別子（URI）：汎用構文\"、STD 66、RFC 3986、DOI 10.17487 / RFC3986、2005年1月<HTTP：/ /www.rfc-editor.org/info/rfc3986>。"
    },
    {
      "indent": 3,
      "text": "[RFC6117] Hoeneisen, B., Mayrhofer, A., and J. Livingood, \"IANA Registration of Enumservices: Guide, Template, and IANA Considerations\", RFC 6117, DOI 10.17487/RFC6117, March 2011, <http://www.rfc-editor.org/info/rfc6117>.",
      "ja": "[RFC6117] Hoeneisen、B.、Mayrhofer、A.、およびJ. Livingood、 \"EnumservicesのIANA登録：ガイド、テンプレート、およびIANAの考慮事項\"、RFC 6117、DOI 10.17487 / RFC6117、2011年3月、<のhttp：// WWW .rfc-editor.org /情報/ rfc6117>。"
    },
    {
      "indent": 3,
      "text": "[RFC6335] Cotton, M., Eggert, L., Touch, J., Westerlund, M., and S. Cheshire, \"Internet Assigned Numbers Authority (IANA) Procedures for the Management of the Service Name and Transport Protocol Port Number Registry\", BCP 165, RFC 6335, DOI 10.17487/RFC6335, August 2011, <http://www.rfc-editor.org/info/rfc6335>.",
      "ja": "[RFC6335]コットン、M.、エッゲルト、L.、タッチ、J.、ウェスター、M.、およびS.チェシャー、「IANA（Internet Assigned Numbers Authority）のサービス名とトランスポートプロトコルポート番号レジストリの管理のための手順」、BCP 165、RFC 6335、DOI 10.17487 / RFC6335、2011年8月、<http://www.rfc-editor.org/info/rfc6335>。"
    },
    {
      "indent": 0,
      "text": "8.2. Informative References",
      "section_title": true,
      "ja": "8.2。参考文献"
    },
    {
      "indent": 3,
      "text": "[RFC2782] Gulbrandsen, A., Vixie, P., and L. Esibov, \"A DNS RR for specifying the location of services (DNS SRV)\", RFC 2782, DOI 10.17487/RFC2782, February 2000, <http://www.rfc-editor.org/info/rfc2782>.",
      "ja": "[RFC2782] Gulbrandsenの、A.、いるVixie、P.、およびL. Esibov、 \"サービスの場所を特定するためのDNS RR（DNSのSRV）\"、RFC 2782、DOI 10.17487 / RFC2782、2000年2月、<HTTP：// www.rfc-editor.org/info/rfc2782>。"
    },
    {
      "indent": 3,
      "text": "[RFC2915] Mealling, M. and R. Daniel, \"The Naming Authority Pointer (NAPTR) DNS Resource Record\", RFC 2915, DOI 10.17487/RFC2915, September 2000, <http://www.rfc-editor.org/info/rfc2915>.",
      "ja": "[RFC2915] Mealling、M.およびR.ダニエル、 \"命名権限ポインタ（NAPTR）DNSリソースレコード\"、RFC 2915、DOI 10.17487 / RFC2915、2000年9月、<http://www.rfc-editor.org/info / rfc2915>。"
    },
    {
      "indent": 3,
      "text": "[RFC3401] Mealling, M., \"Dynamic Delegation Discovery System (DDDS) Part One: The Comprehensive DDDS\", RFC 3401, DOI 10.17487/RFC3401, October 2002, <http://www.rfc-editor.org/info/rfc3401>.",
      "ja": "[RFC3401] Mealling、M.、 \"ダイナミックな委譲発見システム（DDDS）第一部：総合DDDS\"、RFC 3401、DOI 10.17487 / RFC3401、2002年10月、<http://www.rfc-editor.org/info/ rfc3401>。"
    },
    {
      "indent": 3,
      "text": "[RFC3403] Mealling, M., \"Dynamic Delegation Discovery System (DDDS) Part Three: The Domain Name System (DNS) Database\", RFC 3403, DOI 10.17487/RFC3403, October 2002, <http://www.rfc-editor.org/info/rfc3403>.",
      "ja": "[RFC3403] Mealling、M.、 \"ダイナミックな委譲発見システム（DDDS）パート3：ドメインネームシステム（DNS）データベース\"、RFC 3403、DOI 10.17487 / RFC3403、2002年10月、<のhttp：//www.rfc-editor .ORG /情報/ rfc3403>。"
    },
    {
      "indent": 3,
      "text": "[RFC3404] Mealling, M., \"Dynamic Delegation Discovery System (DDDS) Part Four: The Uniform Resource Identifiers (URI)\", RFC 3404, DOI 10.17487/RFC3404, October 2002, <http://www.rfc-editor.org/info/rfc3404>.",
      "ja": "[RFC3404] Mealling、M.、 \"ダイナミックな委譲発見システム（DDDS）第四部：統一資源識別子（URI）\"、RFC 3404、DOI 10.17487 / RFC3404、2002年10月、<のhttp：//www.rfc-editor。組織/情報/ rfc3404>。"
    },
    {
      "indent": 3,
      "text": "[RFC3597] Gustafsson, A., \"Handling of Unknown DNS Resource Record (RR) Types\", RFC 3597, DOI 10.17487/RFC3597, September 2003, <http://www.rfc-editor.org/info/rfc3597>.",
      "ja": "[RFC3597]グスタフソン、A.、RFC 3597、DOI 10.17487 / RFC3597、2003年9月、 \"未知のDNSリソースレコード（RR）タイプの取り扱い\" <http://www.rfc-editor.org/info/rfc3597>。"
    },
    {
      "indent": 3,
      "text": "[RFC3958] Daigle, L. and A. Newton, \"Domain-Based Application Service Location Using SRV RRs and the Dynamic Delegation Discovery Service (DDDS)\", RFC 3958, DOI 10.17487/RFC3958, January 2005, <http://www.rfc-editor.org/info/rfc3958>.",
      "ja": "[RFC3958] Daigle氏、L.とA.ニュートン、 \"ドメインベースのアプリケーションサービスの場所のSRV RRを使用し、ダイナミックな委譲発見サービス（DDDS）\"、RFC 3958、DOI 10.17487 / RFC3958、2005年1月、<のhttp：// WWW .rfc-editor.org /情報/ rfc3958>。"
    },
    {
      "indent": 3,
      "text": "[RFC4592] Lewis, E., \"The Role of Wildcards in the Domain Name System\", RFC 4592, DOI 10.17487/RFC4592, July 2006, <http://www.rfc-editor.org/info/rfc4592>.",
      "ja": "[RFC4592]ルイス、E.、 \"ドメインネームシステムにおけるワイルドカードの役割\"、RFC 4592、DOI 10.17487 / RFC4592、2006年7月、<http://www.rfc-editor.org/info/rfc4592>。"
    },
    {
      "indent": 3,
      "text": "[RFC4848] Daigle, L., \"Domain-Based Application Service Location Using URIs and the Dynamic Delegation Discovery Service (DDDS)\", RFC 4848, DOI 10.17487/RFC4848, April 2007, <http://www.rfc-editor.org/info/rfc4848>.",
      "ja": "[RFC4848] Daigle氏、L.、 \"ドメインベースのアプリケーションサービスの場所は、URIを使用し、ダイナミックな委譲発見サービス（DDDS）\"、RFC 4848、DOI 10.17487 / RFC4848、2007年4月、<のhttp：//www.rfc-editor。組織/情報/ rfc4848>。"
    },
    {
      "indent": 3,
      "text": "[RFC5507] IAB, Faltstrom, P., Ed., Austein, R., Ed., and P. Koch, Ed., \"Design Choices When Expanding the DNS\", RFC 5507, DOI 10.17487/RFC5507, April 2009, <http://www.rfc-editor.org/info/rfc5507>.",
      "ja": "[RFC5507] IAB、Faltstrom、P.、エド。、Austeinと、R.、エド。、およびP.コッホ、エド。、 \"設計上の選択DNSの拡張\"、RFC 5507、DOI 10.17487 / RFC5507、2009年4月、< http://www.rfc-editor.org/info/rfc5507>。"
    },
    {
      "indent": 0,
      "text": "Appendix A. The Original RRTYPE Allocation Request",
      "ja": "付録A.オリジナルRRTYPE割り当て要求"
    },
    {
      "indent": 3,
      "text": "On February 22, 2011 IANA assigned RRTYPE 256 for the URI resource record based on a request that followed the procedure documented in [BCP42] (which was RFC 6195 at the time but has since been replaced by RFC 6895). The DNS RRTYPE PARAMETER ALLOCATION form as submitted to IANA at that time is replicated below for reference.",
      "ja": "2011年2月22日にIANAは、（一度にRFC 6195であったが、以来、RFC 6895に置き換えられている）[BCP42]に記載の手順に従った要求に基づいてURIのリソースレコードのRRTYPE 256を割り当て。その時点でIANAに提出されたDNS RRTYPE PARAMETER割り当て形態は、参照のために以下に複製されます。"
    },
    {
      "indent": 3,
      "text": "Note: Although \"ownername\" should be \"owner name\", \"ownername\" has been preserved below because it was part of the original request form submitted to IANA.",
      "ja": "注意：「ownernameには、」「所有者名」である必要がありますが、それはIANAに提出し、元の申請フォームの一部だったので、「ownernameには、」以下に保存されています。"
    },
    {
      "indent": 3,
      "text": "A. Submission Date:",
      "ja": "A.提出日："
    },
    {
      "indent": 8,
      "text": "May 23, 2009",
      "ja": "2009年5月23日"
    },
    {
      "indent": 3,
      "text": "B. Submission Type:",
      "ja": "B.提出の種類："
    },
    {
      "indent": 8,
      "text": "[X] New RRTYPE\n[ ] Modification to existing RRTYPE",
      "raw": true
    },
    {
      "indent": 3,
      "text": "C. Contact Information for submitter:",
      "ja": "提出者のためのC.お問い合わせ先："
    },
    {
      "indent": 8,
      "text": "Name: Patrik Faltstrom\nEmail Address: paf@cisco.com\nInternational telephone number: +46-8-6859131\nOther contact handles:\n(Note: This information will be publicly posted.)",
      "raw": true
    },
    {
      "indent": 3,
      "text": "D. Motivation for the new RRTYPE application?",
      "ja": "新しいRRTYPEアプリケーションのD.動機？"
    },
    {
      "indent": 8,
      "text": "There is no easy way to get from a domain name to a URI.  Some\nmechanisms exists via use of the NAPTR [RFC3403] resource\nrecord.  That implies quite complicated rules that are\nsimplified via the S-NAPTR [RFC3958] specification.  But, the\nability to directly look up a URI still exists.  This\nspecification uses a prefix based naming mechanism originated in\nthe definition of the SRV [RFC2782] resource record, and the\nRDATA is a URI, encoded as one text field.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "See also above (Section 1).",
      "ja": "（セクション1）の上にも参照してください。"
    },
    {
      "indent": 3,
      "text": "E. Description of the proposed RR type.",
      "ja": "提案されたRR型のE.説明。"
    },
    {
      "indent": 8,
      "text": "The format of the URI resource record is as follows:",
      "ja": "次のようにURIリソースレコードの形式は次のとおりです。"
    },
    {
      "indent": 8,
      "text": "Ownername TTL Class URI Priority Weight Target",
      "ja": "ownernameにTTLクラスURIの優先順位重ターゲット"
    },
    {
      "indent": 8,
      "text": "The URI RR has service information encoded in its ownername. In order to encode the service for a specific ownername one uses service parameters. Valid service parameters used are either Enumservice Registrations registered by IANA, or prefixes used for the SRV resource record.",
      "ja": "URI RRはそのownernameにで符号化されたサービス情報を持っています。特定ownernameにいずれかのサービスを符号化するために、サービスパラメータを使用します。使用する有効なサービスパラメータがEnumservice IANAによって登録された登録、またはSRVリソースレコードに使用プレフィックスのどちらかです。"
    },
    {
      "indent": 8,
      "text": "The wire format of the RDATA is as follows:",
      "ja": "次のようにRDATAのワイヤフォーマットは次のとおり"
    },
    {
      "indent": 6,
      "text": "                     1 1 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 2 2 2 3 3\n 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n|          Priority             |          Weight               |\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+\n/                                                               /\n/                             Target                            /\n/                                                               /\n+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+",
      "raw": true
    },
    {
      "indent": 3,
      "text": "F. What existing RRTYPE or RRTYPEs come closest to filling that need and why are they unsatisfactory?",
      "ja": "F.どのような既存のRRTYPEまたはRRTYPEsは、その必要性を満たすに最も近い来て、なぜ彼らは満足できるものではありませんか？"
    },
    {
      "indent": 8,
      "text": "The RRTYPE that come closest is the NAPTR resource record.  It\nis for example used in the DDDS and S-NAPTR algorithms.  The\nmain problem with the NAPTR is that selection of what record (or\nrecords) one is interested in is based on data stored in the\nRDATA portion of the NAPTR resource record.  This, as explained\nin RFC 5507 [RFC5507], is not optimal for DNS lookups.  Further,\nmost applications using NAPTR resource records uses regular\nexpression based rewrite rules for creation of the URI, and that\nhas shown be complicated to implement.",
      "raw": true
    },
    {
      "indent": 8,
      "text": "The second closest RRTYPE is the SRV record that given a prefixed based naming just like is suggested for the URI resource record, one get back a port number and domain name. This can also be used for creation of a URI, but, only URIs without path components.",
      "ja": "二番目に近いRRTYPEがちょうどURIのリソースレコードのために提案されるのが好き接頭辞ベースの命名を与えられたSRVレコードで、1は、ポート番号とドメイン名を取り戻します。これはまた、唯一のパスコンポーネントなしのURI、URIの作成に使用することができるが。"
    },
    {
      "indent": 3,
      "text": "G. What mnemonic is requested for the new RRTYPE (optional)?",
      "ja": "何ニーモニックG.（オプション）新しいRRTYPEのために要求されていますか？"
    },
    {
      "indent": 8,
      "text": "URI",
      "ja": "売り"
    },
    {
      "indent": 3,
      "text": "H. Does the requested RRTYPE make use of any existing IANA Registry or require the creation of a new IANA sub-registry in DNS Parameters?",
      "ja": "H.は、要求されたRRTYPEは、既存のIANAレジストリを利用したり、DNSパラメータの新しいIANAサブレジストリを作成する必要がありますか？"
    },
    {
      "indent": 8,
      "text": "Yes, partially.",
      "ja": "はい、部分的に。"
    },
    {
      "indent": 8,
      "text": "One of the mechanisms to select a service is to use the Enumservice Registry managed by IANA. Another is to use services and protocols used for SRV records.",
      "ja": "サービスを選択するための機構の1つは、IANAが管理しEnumserviceレジストリを使用することです。もう一つは、SRVレコードのために使用されるサービスとプロトコルを使用することです。"
    },
    {
      "indent": 3,
      "text": "I. Does the proposal require/expect any changes in DNS servers/ resolvers that prevent the new type from being processed as an unknown RRTYPE (see [RFC3597])?",
      "ja": "I.は、提案は（[RFC3597]を参照）/不明RRTYPEとして処理されてから、新しいタイプのを防ぐDNSサーバ/リゾルバの変更を期待する必要がありますか？"
    },
    {
      "indent": 8,
      "text": "No",
      "ja": "の"
    },
    {
      "indent": 3,
      "text": "J. Comments:",
      "ja": "J.コメント："
    },
    {
      "indent": 8,
      "text": "None",
      "ja": "無し"
    },
    {
      "indent": 0,
      "text": "Acknowledgements",
      "ja": "謝辞"
    },
    {
      "indent": 3,
      "text": "Ideas on how to split the two different kinds of queries, \"What services exists for this domain name\" and \"What is the URI for this service\", came from Scott Bradner and Lawrence Conroy. Other people that have contributed to this document include Richard Barnes, Leslie Daigle, Victor Dukhovni, Olafur Gudmundsson, Philip Hallam-Baker, Ted Hardie, Sam Hartman, Evan Hunt, John Klensin, Peter Koch, Eliot Lear, Andy Newton, Mark Nottingham, Penn Pfautz, Jinmei Tatuya, Willem Toorop, and Nico Williams.",
      "ja": "「このドメイン名のために存在するどのようなサービス」のクエリの2種類を分割する方法についてのアイデア、そして「このサービスのURIとは何ですか」、スコット・ブラッドナー、ローレンスコンロイから来ました。この文書に貢献してきた他の人は、リチャード・バーンズ、レスリーDaigle氏、ビクターDukhovni、オラフルグドムンソン、フィリップ・ハラム・ベイカー、テッドハーディー、サム・ハートマン、エヴァン・ハント、ジョン・クレンシン、ピーター・コッホ、エリオット・リア、アンディ・ニュートン、マーク・ノッティンガムを含めますペンPfautz、神明達也、ウィレムToorop、そしてニコ・ウィリアムズ。"
    },
    {
      "indent": 3,
      "text": "Cisco is acknowledged as Mr. Faltstrom's employer at the time this document was developed.",
      "ja": "シスコは、この文書が開発された時点で氏Faltstromの雇用者として認められています。"
    },
    {
      "indent": 3,
      "text": "The NLnet Labs is acknowledged as Mr. Kolkman's employer at the time this document was developed.",
      "ja": "NLnet Labsは、この文書が開発された時点での氏Kolkmanの雇用者として認められています。"
    },
    {
      "indent": 0,
      "text": "Authors' Addresses",
      "ja": "著者のアドレス"
    },
    {
      "indent": 3,
      "text": "Patrik Faltstrom Netnod",
      "ja": "パトリックFaltstrom Netnod"
    },
    {
      "indent": 3,
      "text": "EMail: paf@netnod.se",
      "ja": "メールアドレス：paf@netnod.se"
    },
    {
      "indent": 3,
      "text": "Olaf Kolkman Internet Society",
      "ja": "オラフKolkmanインターネット協会"
    },
    {
      "indent": 3,
      "text": "EMail: kolkman@isoc.org",
      "ja": "メールアドレス：kolkman@isoc.org"
    }
  ]
}